{"songs": [{"title": "Fatty Girl", "album": null, "year": null, "lyrics": "(feat. Ludacris)\n\nF is for all the Fatties wearin my shit!\n(Do you want me to..) uh, yeah, what?\n(Uhh, Trackmasters, FB, Entertainment)\nYeah, this how we gon' do this (uhh, uhh, ooh!)\n\n[Ludacris]\nYo, girl you taste like a Cinnabun\nSo sweet from the thighs to the cheek\nSex on the beach, check the size of my meat; call me the butcher\nLudacris King Ding-a-Ling sheet smusher\nSweet street pusher, give me that gusher\nNasty stuff - look up - I took her\nRan out of liquor (time to re-up!)\nHere comes her nigga (who gives a fuck!)\nRap fame and plat' thangs they can't hang\nI mack dames and pack thangs and act strange\nJang-a-ling dang-a-ling oh no they can't stop\nTake it to the floor back up and then drop\nEffervescent.. time time's of the essence\nMake 'em undress in less than three seconds\nSo whores keep steppin whores keep slobbin\nSex as a weapon, clothes that I slept in\nStreets keep mobbin, thieves keep robbin\nGet two in yoor butt, three to your noggin\nCreepin and crawlin, I'm incogneg'\nCan't catch the balls then you in the wrong league\nLet a dog breathe, watch a pimp walk\nShut yo' ass up when you hear a pimp talk\nFriskier dreams, Krispier Kremes\nYou lookin mighty fine in them jeans\n\n[Chorus]\nAll you brothers want a, fatty girl, fatty girl\nFatty girl - who me?\nYou know I got a, fatty girl, fatty girl\nFatty girl - what's she mean?\nEver since I got a, fatty girl, fatty girl\nFatty girl - fat as a bitch!\nFatty girl, fatty girl\nFatty girl..\n\n[LL Cool J - overlaps Chorus]\nUhh.. uhh.. hot.. fire.. hot\n(Step up and represent player) International baller baby\n\nHEESHY! Young birds in the Coupe goin\nHEESHY! (Papi tell me if you don't feel me)\nEasy; I feel greasy when you squeeze me\n(Cut de blood claat talk and do what ya wan' please me)\nI'm talkin down home smothered in gravy, Cool J be\nHavin young ladies bustin like 380's\nLubricated silencers, crushin all challengers\nGats that be claimin they Glocks but really Dillingers\nGet it? Glock Dillinger, I'm big you small\nMore nuts on your face than graffiti on the wall\nHair like Brillo, cuttin up my pillow\nGot 'em sayin (hello!) naked in a tub of a Jello\nStill no competition, still flow nigga listen\n(I'm not supposed to do this type of thing I'm a Christian)\nAmen! It's like a scene out of Player's magazine\nLet them other cats holla, L'll make you scream\n\n[Chorus]\n\n[Keith Murray - overlaps Chorus]\nAiyyo welcome home Murray!\n\nYo, this is in thought of those broads who got the goods\nTo the chicks who don't - ehhhh it's still all good\nSome broads got an automatic thickness for eight\nYou'll soon get it, just stay workin hard at it\nGoodness gracious, good God almighty\nYou got a badoonka donk, girl don't hurt nobody!\nToes all painted, feet all out\nIt's an aphrodisiac for the mall without a doubt\nJuicy chunky stanky funky\nGut slappin ball slappin cater to your every fantasy\nYou got your tongue clitoris tits and belly pierced (all that?)\nNecklace around yo' waist toe rings - girl do yo' thang!\nI mean, in them jeans yo shape is BEAUTIFUL!\nAnd I'm \"For You, By You\" like FUBU (bitch you know the name)\nWhoo-wee Jesus JoJo K-Ci and Mary\nGirl you don't know what you do to me (lord have mercy!)\nAin't no doubt about it, when she walk by\nTongues hang out, eyes pop out the socket (BING!)\nCats cringe and point like pssh\nUmmph you can see that thang from the front\nWe gas those up like, full service\nAnd, keep 'em drunk like Kathie Lee Curtis\nAnd when you shake it, you rock my world\nI done died and went to heaven, you got a fatty girl!\n\n[Chorus] - repeat to the end", "image": "https://images.genius.com/9e00cf56336ec8915e2fa3b2b2e7502d.377x377x1.jpg"}], "artist": "LL Cool J"}