{"songs": [{"title": "Klusterfuk", "album": "Klusterfuk", "year": "2012-03-13", "lyrics": "[Intro: Tech N9ne]\nI was born in November, 8th day, 1971st y'all\n9 o'clock in the morning a Christian girl\nIn Kansas City gave birth, yaah\nShe taught the kid how to love\nAnd give all praises to our maker till the earth fall\nThen mama married a Muslim when I was 12\nAnd the transition was the worst y'all\nI converted to Islam, but every once in awhile\nI'd read a bible verse, yaah\nHow am I to refrain from eatin' pork\nAnd havin' Christmas when I'm thirst ahh?\nAll of this it was blended, many religions\nPlenty women down my shirt, yaah\nAt home no longer attended\nWhen I was 17 I bounced like a nerf ball\n\n[Verse: Tech N9ne]\nYeeeeah! (Spit a bit quick!)\nBy day I slay, Pai Mei, trick, (don't get a bitch hit!)\nI'm Master Ip'in it, I'm flyin' around with equipment\nReally big time and now I'm not fitness, bitch\nI'm ridin' around and I'm grittin' it\nTo the people, the people that want the evil, I'm givin' you\nThat and a coupla others a (Klusterfuk!)\nOf a brotha which you discover I (Crush mucks up!)\nIn the gutter 'cause I'm a thug and their (Tough just struck!)\nOn you mo'fuckers I'll be the blood brother\nGivin' you love from a slug if you bug on a nigga\nTug on a trigga, no hugs, I'ma kiss her with\nGrudges and plug her with drugs when I give her dick\nFatherly when I spit on these kiddies, don't bother me\nIn the brown and red dickies, Mahogany\nRed all over me like I hit a artery\nFuck all of these, hypocrites, lick a dick, just swallow me\nIf you follow me and wanted to abolish me\nWhen I'm honestly straight oddity\nI'm just twisted, non-fictitious, on this wicked shit (Spit a bit quick!)\nReady whenever, machete will sever the head or\nBe dead up then the leg up in the metal and (Big thick bricks!)\nPucker up, suck this nutter butter, gutter slut\nIf you wonder what is uttered this is Klusterfuk!\nEver seen a nigga with hella followers\nAnd they love a nigga so much if he wanna tell them to kill?\nHa-ha-ha-ha-hah! And they will!\nSo ya better watch that, no it ain't a shock tactic, got that bit down to the grill\nHeh-heh-heh-heh-heh-heeeh! Way real!\nI got the shit that get the crowd jumpin'\nMoshin', a lotta thumpin', silly just like a drunken monkey!\nNigga, we punkin' flunkies! Killa, we krunk and funky!\nUhh, pumpin' chunky! Uhh, booty bitches in the bunk with a donkey, eh!\nCrazy, I might be way in my psyche, laid as a bright P.A\nPlayin', they wanna fight me\nThey don't really like me\nDay and the night replay\nYeah, I'm good and a little bit of evil\nInside of me, they about equal\nCall it a bust, when I'm all in a rut\nI'm a Klusterfuk, nigga y'all is just (Fecal!)\n\n[Chorus 1: Tech N9ne]\nGrowin' up low enough must have sucked (People!)\nCall me what? Call me a Klusterfuk (Fecal!)\nGrowin' up low enough must have sucked (People!)\nCall me what? Call me a Klusterfuk\n\n[Interlude: Sassy]\nTalk about growin' up fucked up\nI grew up with a mentally ill mother, so it's no wonder that I'm slightly askew\nHer fanatical religious views had me sittin' in pews eight days a week\nAnd because of that, me and God didn't speak for a while\nNow I crack a smile when I'm asked my religious preference\nI utter a Tech N9ne reference replying: \"I'm a Klusterfuk\"\nI mixed up all the stuff that religion had to offer\nBoiled it in my cauldron 'till the bullshit burned off it, all that was left was love\nI can't say I always rise above the trivial shit in my life, 'cause I don't\nSometimes my ego won't allow me to walk away, if you know what I'm sayin'\nI've done a lot of drugs, shit, I've done a lot of thugs, but in the end\nAs long as I'm aligned with love, then I know I'm livin' righteous\n\n[Chorus 2: Tech N9ne]\nBy a landslide my energy!\nWill kill a man, why try mimic me?!\nCause the fans tied identically!\nLove it when the fans buy my memories!\nBy a landslide my energy!\nWill kill a man, why try mimic me?!\nCause the fans tied identically!\nLove it when the fans buy my memories!\n\n[Chorus 1 & 2]\nBy a landslide my energy! (Growin' up low enough must have sucked)\nWill kill a man, why try mimic me?!\nCause the fans tied identically! (Call me what? Call me a Klusterfuk)\nLove it when the fans buy my memories!\nBy a landslide my energy! (Growin' up low enough must have sucked)\nWill kill a man, why try mimic me?!\nCause the fans tied identically! (Call me what? Call me a Klusterfuk)\nLove it when the fans buy my memories!", "image": "https://images.genius.com/d81918b5eb66018731d6fb1da718ea1e.900x900x1.jpg"}], "artist": "Tech N9ne"}