{"songs": [{"title": "Bloody Mary", "album": "Dedication 6: Reloaded", "year": "2018-01-24", "lyrics": "[Intro]\nI'ma be alright because Dizzy here wilin'\n\n[Verse 1: Juelz Santana]\nUh, okay, time to make my mark, I gave 'em a head start\nNow I'm on my Nicki shit, I don't want no fraud\nTryna raise the bar, grab it like I passed the bar\nYou would think I'm ridin' bikes by the way I handle bars, yeah\nNew nigga in charge, it's a new nigga in charge\nPoppin' all these blues, I might turn into an avatar\nThey ain't wanna see me back, he's back\nHuman cracking the flesh, sorry I had to relapse\nThese niggas weak, wack, I twist 'em like weed raps\nStill on my Nino Brown, still getting Gee Money on G-packs\nNo stunna man bussin' like Duh Duh Man, it's evident\nThese hoes love me, they say my dick is they medicine\nCosby spikin' gelatin, still pushin' and pedalin'\nSettling never, I'm like DiCaprio in The Revenant\nStill whippin' and stretchin' it, two pots, ambidextrous\nI'm a beast, a dog, I see that money, I'm fetching it\nYour ho throwin' it at me, I'm catchin' it, don't check me, go check ya bitch\nYou don't want to get me out of my element\nFrom a tenant in the tenements to owning my residence\nPhone still clicking, I feel like a receptionist\nAnd I'm extraterrestrian\nMy life's a fucking movie, boy don't get yourself edited\nI'm like Steph at the free-throw, that piece blow, I never miss\nTaught you girl how to whip the girl now she a lesbian\nYou can level up, still won't be on my level then\nIt's level 10, these niggas hot, I must be kettlin'\nThey don't want the steam but I know you want the tea\nThat's yo bitch, why she only fuck with me? 'Cause I'm ballin', MSG\nRoof missing on this whip and I need two kitchens\nFuck the DA, I ain't never been no stoop pigeon\nWon't catch me in no club unless my tool get in\nBe smart cause Bouncy a fool with it\nSon say it's on, 7-11 with it\nThat's 24-7 with it, wherever, whatever with it, yeah\nYour momma gonna need a church with a reverend in it\nJust pray its a heaven in it, and hope that they let you in it, yeah\nBoy I expose the truth in guys\nCross me and get crucified\nWar's on, the bazooka rise, niggas get neutralized\n\n[Verse 2: Lil Wayne]\nSuicide, it's a suicide\nTell 'em seek and you will find cause I'ma lose my mind\nKick a nigga ass then give 'em my shoes to shine\nIt's do or die, I come from where we used to crime\nThe Uzi-9 more important than school supplies\nThe pools is dry, my niggas and the food is fried\nThe news is lies, the pigeons is too spooked to fly\nThe rules denied, all the toughest goons is mine\nThat’s Tunechi's slimes, they kill you and go do the time\nWe unified, Young Money revolutionized the new design\nWe had to leave the flukes behind and super size\nThe numbers through the roof and sky\nDon't look too surprised, look through the lines\nWe makin' moves and strides, grooves and vibes\nI'm too alive, these hoes need to be supervised\nThey put on a cute disguise, your grooms is blind\nShe get dick in the Uber ride, #2 with fries\nI'm pimpin', now who am I? I'm who and why\nI'm rude and kind, my cars are computerized\nI'm cruisin' by, smokin' blunts Ruben size\nYou fools can try, these tools getting utilized\nYou euthanized, blrtt, skrrt, shoot then drive\nNow who survived? We comin' back to rewind\nI'm usually high, sippin' on the Houston wine\nFeel humanized, I want my throne to recline\nJackie red, Julie blonde, they Cuban fine\nI bruise they spine, I leave and they snooze 'til nine\nSuperglued to the grind, my crew my tribe\nThese bitches try to divide, we too divine\nGot the drugs to provide, the coolest highs\nThe greenest green and the white with the bluest eyes\nThe syrup and the juice collide, the two combine like suits and ties\nMagic, poof, goodbye\n\n[Outro: Lil Wayne]\nDedication is arguably the best mixtape series of all time, that's these words on this paper. The artwork has been duplicated, the work ethic has been emulated, the title alone is a daily discussion within hip hop. How does it feel to have that impact? Okay first of all, that was all something new to me. So, I ain't know it was the best mixtape series of all time, I totally didn't, forgive me, I don't know...just didn't..um. The artwork been duplicated? I honestly don't even be doing my artwork I swear, I just be too busy, just moving, gotta get to the next. I'm sorry, uh, the work ethic has been emulated? Now that right there...uhhhhh..I don't know right there...I don't know...I don't know about the work ethic being emulated man...yeah I don't know, uh. The title alone is a daily discussion within hip hop? How does it feel to have that impact? Um, dedication! Yeah dedicate yourself to something man, dedicate it to something man. If yourself isn't in your music its still you, that's your words, dedicate it to something man it has to be dedicated to something, and it only means that you're dedicated. You're a dedicated person. I am a very dedicated person, to everything I love, everything, everyone. Very very very dedicated. And that what Dedication 6 about. But it is some six shit. Some very sick shit. So yeah, dedication six six six yourself. To hell. Thank you!", "image": "https://images.genius.com/7eee606ac8ea7a0565130c6e3ee4cd0e.1000x1000x1.jpg"}], "artist": "Lil Wayne"}