{"songs": [{"title": "Chuck D Speaks / Devil In A New Dress", "album": "Renzel Remixes", "year": null, "lyrics": "[Intro]\nGet it, get it...get it, come on get down X4\n[?]\nDon't know how to do this\nIs we who know how to do this\nYeah Boy\n\n[Verse 1]\nBass, how low can you go? Death row\nWhat a brother know, once again\nBack is the incredible, rhyme animal\nThe uncountable, beef\nPublic Enemy Number One, five, four, said freeze\nAnd I got none, can I tell them that I never really had a gun\nBut it's the wax of the Terminator X fun\nNow they got me in the cell, took my recozay cell\nCuz a brother like me  said well,  power cuz I'm a profit I think y'all listen to\n(What they can say to you) What you wanna do, wanna do...wanna do\n\n[Speaker 1]\nRose, and they say we ain't even supposed to talk right? Sold, first words or people heard coming in, so we can buy for skin. Brothers from other mothers, one from the South, one from New York. Sold, so we go. Marked black in the market. black in the market. black in the market.That matters, all lives matter, and all black lives matter. Cuz if we don't matter, nobody matters. We scattered. But sking is a business, like prison be a business bro. These government last names born a business. Black market unequal, built on deeds of evil. Asked a judge. Nods his head but his finger don't budge. And so we marked. Black market\n\n[Verse 2]\n(Play that music)\n[?]\nLooking at my bitch, I bet she give your ass a bone\nLooking at my wrist and it turn your ass to stone\nStretched limousines, sipping rosie all alone\nDouble headed monster with a mind of his own\nCherry red, cherry head, he said it's just my character\nAll black tux, nigga shoes lavender\nI never needed acceptance from all you outsiders\nHad ciphers with Ezzy before his mouth white\n\n[Verse 3]\nBefore his jaw shatter climbing up the Lord's ladder\nWe still speeding, running science like they don't matter\nHaters talking never made me mad, never then\nNot when I'm in my favorite paper tag\nBell 4, G4's at the clear port, when they came twos\nFool imma pet boy, when it came to dope\nI was quick to export, never tied a ball and so it's on to the next sport\nNew Mercedes Sedan, the next sport, so many cars\nDMV thought it was mail fraud, different tracks I was getting mail from\nPope county, Jacksonville, Dayton, Millborn\nWhole clique, appetite, had tapeworms, then they tied up in they grass\nFinal as my Jay Burns, I cheered a table before the night's over\nGod bless the man I put this ice over, Game 2Pac money twice over\nSill a real nigga red, Gucci sweater, dice roller\nI'm making love to the angel of death, catch your feelings\nNever stumble, retracing my steps\nCatch your feelings, never stumble, retracing my steps", "image": "https://images.genius.com/26f2cdfc9fdcb22135f837c8ea35c566.1000x1000x1.jpg"}], "artist": "Rick Ross"}