{"songs": [{"title": "Shorty (Put It On The Floor)", "album": "Love Don’t Cost a Thing (Original Soundtrack)", "year": null, "lyrics": "[Intro]\nNew York put it on the floor\nNew York put it on the floor (what, c'mon)\nCali put it on the floor\nCali put it on the floor (love don't cost a thing)\nMiami put it on the floor\nMiami put it on the floor\nAtlanta put it on the floor\nAtlanta put it on the floor (Just Blaze)\n\n[Verse 1 - Busta Rhymes]\nYo, watch how the women start sniffin around\nWhen we be rippin it down, we got 'em stickin around\nThe way they love the kid, like I'm the king of the town\nThe way my money stack stupid, got 'em flippin around, and got 'em diggin\nThe sound\nI know you look finger lickin\nAnd baby girl, I only use my dough for trickin or chicken\nListen, cooked food shorty fatten my tummy\nYou can go in and out my slacks, don't touch my money\nEven though you lookin good and it was nice to meet ya\nYou be lucky if you even get a slice of pizza, from me (c'mon)\nBefore you ever try to touch my money clip\nI'll put you on the corner walkin up and down the money strip (now look it\nHere)\nHoney dip, better find another dummy quick\nHomie tryna stunt, better jump inside a money whip (go on)\nAnd see what you can get, and keep it over there\nYou better try your luck, cause you ain't gettin nothin over here\n\n[Hook: Busta Rhymes]\nI think you need to move it to the left\n(Shorty)\nMove it to the left\n(Shorty)\nIf you ain't got your own paper, I don't suggest you hold your breath\n(Shorty)\nKeep it right\n(Shorty)\nYou better keep it tight\n(Shorty)\nYou better bring money out ya crib, cause you ain't gettin none of mine\nTonight\n(Shorty)\n\n[Verse 2 - Chingy]\nMa let me see you twist it like a centipede\nI keep a stack of that, plus some Hennessey\nSince I got rich, I keep a lot of enemies\nBut trip and it's like that, cause I've been a G\nLook at the way these women tend to grin at me\nI like the way she shake it with a lot of energy\nMagnums, alcoholic freaks the remedy\nI'm the young Donald Trump, is y'all hearin me?\nGirls on the sideline, yeah they cheerin me\nAsk her \"can she drive a stick?\" now she steerin me\nMan I'm sick, no it ain't no curin me\nC to the H to the I-N-G ... Y\n\n[Hook] - w/ ad libs\n\n[Verse 3 - Fat Joe]\nYeah, uh, yo, uh\nPut that ass up on the floor\nMake it clap when you seen cats pass through the door (uh)\nI ain't tryna act gas at all\nChicks attack like he's \"Joe Crack, The Boss\"\nPlayed it back, cause I be so paranoid\nI got a wife, but baby please don't back it off (uh)\nShe understood that, said \"what's good, Crack?\"\nGot me screamin \"where the hood, where the hood rat\"\nMami I ain't gotta pop the piston\nBut the rocks got a gleam, so hard to miss 'em\nSo I, cut the chase, took her out the place\nPut her in a bed, put smile on her face (uh)\nShe don't know \"Joe Crack the Don\"\nNever spend no type of real cheese on a broad\nAll I keep is 100 G's, limit credit cards\nCould you believe we could spend it all\nTalk to 'em, c'mon\n\n[Break]\nNew York put it on the floor\nNew York put it on the floor\nJersey put it on the floor\nJersey put it on the floor\nV.A. put it on the floor\nV.A. put it on the floor\nChi-town put it on the floor\nChi-town put it on the floor\n\n[Verse 4 - Nick Cannon]\nJust work shorty, you gon' work for this little bit of change\nSide order of pimpin, little bit of game\nWhat ya know gon' hurt, just a little bit of pain\nWhen I rip your skirt from your little bitty frame\nWhole lot trickin, whole lotta cash\nShorty on Nick with a whole lot of ass\nFly guy, Antonio Vargas\nCarrera Porsche's we ain't even parkin\nValet, alligator Air Forces\nWaves in my head have them chicks gettin nauseous\nLet 'em cause the fame, my dough, your world\nSo shake it like a na-na-nasty girl\n\n[Hook] - 2X\n\n[Outro]\nBK put it on the floor\nBK put it on the floor (Flipmode)\nBX put it on the floor\nBX put it on the floor (TS)\nSt. Louis put it on the floor\nSt. Louis put it on the floor (DTP)\nPhilly put it on the floor\nPhilly put it on the floor (no doubt) (*fade*)", "image": "https://images.genius.com/1f94b43fed8cc9236e29af911d7a089b.500x500x1.jpg"}], "artist": "Busta Rhymes"}