{"songs": [{"title": "Sixx Minutes", "album": "Tha Doggfather", "year": "1996-11-12", "lyrics": "[Intro]\nYeah yeah yeah, make some motherfuckin' noise\nYo Doggy Dogg you're on, live on stage\nPerforming tonight\n(Excuse me Doggy Dogg you're on)\nYou know! The one and only\nDon Corleone\nThe big homey, y'know me\n\n[Verse 1]\nWell if it's on, then I guess it's 'bout time\nLet me slide into this OG rhyme\nI do mine the way I do mine\nAnd I takes my time when I'm droppin' my lines\nI look around, I spot MC's (and they)\nAll in the place (and they) all wannabe's\nTryin' to make their paper, tryin' to do they thang\nBut to me they all tryin' to say the same thang\nHow could you rap over beats that whack?\nYou ain't reachin' the crowd, you ain't makin' your fact\nYou ain't droppin' lines that hit the top\nYou can't make the party go hip-hop\nAnd you can't do your thing without using mine\nWe get and steal, I see you're on the grind\nBut I'ma take my time to get my point across\nAnd if you get caught up in the rap shit then got lost\nAnd if you get tossed it's on your own, it's your own fault\nSee I gots ta get mine, I don't try no song\nI just move on, groove on, try to prove on\nThen I do mines to do mines and I'mma keep on, keep on, keep on\nTo get'cha you in a... .smooth type of atmosphere\nSit back and pay attention yeah\nYou ain't never heard it like that\nUhh, is that right? That's right black\nBut uhh\n\n[Chorus]\nSix minutes (six minutes), six minutes (six minutes)\nSix minutes, Doggy Dogg you're on\nUh uh on, uh uh on\nExcuse me Doggy Dogg you're on\nSix minutes (six minutes), six minutes (six minutes)\nSix minutes Doggy Dogg you're on\nUh uh on, uh uh on\nExcuse me Doggy Dogg you're on\n\n[Verse 2]\nI gets my hair whipped on Friday, my day, why they\nEven trippin' on me? Yeah the big homey\nGamey Gamey says \"Snoop Corleone\nListen to me man, stay away from them phonies\nIt's niggas like that that get you caught up quick\nYou gots ta stay focussed Dogg, keep your eye on your grip\nCos if you slip they gon' getcha and they gon' getcha fast\nThese niggas out for your money man, they tryna get your cash\"\nI don't give a damn, you gots ta match\nYou can be from the East Coast and get love cos I ain't trippin' on your ass\nI don't smash on niggas who are smaller than me\nI smash on niggas who big like the DPGC\nOohwee, I getcha crazy\nYou gots ta have a stomach for this shit, baby\nAnd if ya don't you won't, you fake the funk\nSee Snoop is the G in the G-Funk\nNow don't do nuttin' that you can't get out of\nUh uh, you know I got big love for the real G's\nWe make mo' G's, I gots ta have it\n\n[Chorus]\nSix minutes (six minutes), six minutes (six minutes)\nSix minutes, Doggy Dogg you're on\nUh uh on, uh uh on\nExcuse me Doggy Dogg you're on\nSix minutes (six minutes), six minutes (six minutes)\nSix minutes Doggy Dogg you're on\nUh uh on, uh uh on\nExcuse me Doggy Dogg you're on\n\n[Interlude]\nI got the, I got the, I got the paper\nI keep ya, I keep ya, I keep ya cryin\nI thought ya, I thought ya knew my nigga\nYa better, ya better ask somebody (Better ask somebody)\n\n[Verse 3]\nUh, it don't quit\nNow let me take my time and just get into the shit\nI'm just driftin', so swift and smooth\nHow many niggas make the whole party move like I do?\nI can't name nobody\nSo sit back relax and let the Dogg rock the party\nAin't no party like a DP party\nCos everybody in the DP party's naughty\nThey acts a fool, old school, new school\nEverything is everything, everybody playin' cool\nAin't no set trippin', everybody just dippin'\nBitches gettin' with niggas and niggas gettin' bitches\nIt's all superb, word to my momma\nAin't no drama, no need for that\nYou can put your gat back in' your pocket\nUnlock it cos Snoop Dogg is on the mic, I plan to rock it\nDon't stop, (excuse me Doggy Dogg you're on)\n\n[Chorus]\nSix minutes (six minutes), six minutes (six minutes)\nSix minutes, Doggy Dogg you're on\nUh uh on, uh uh on\nExcuse me Doggy Dogg you're on\nSix minutes (six minutes), six minutes (six minutes)\nSix minutes Doggy Dogg you're on\nUh uh on, uh uh on\nExcuse me Doggy Dogg you're on", "image": "https://images.genius.com/ecb7c80ab44a68c9d33f60b5fccd0a70.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}