{"songs": [{"title": "Wave", "album": null, "year": null, "lyrics": "MILANI:INTRO\n\n\n\nBut you was outchea fucking with him\n\nOffside course ride in a benz?\nFuck it I ain't know, was it a bimmer?\n\nLook how much that nigga got you to get\n(See I ain't saying I was better but I)\n\nHad my days I could love it depends\n(Dont sweat it.  Girl it ain't shit\n Where that heart?\n I brought the tool for the fix)\n\nBack at it, love? Thats a dead end\nShe call me papa . We baps when the day ends\n(Hhmm yeaah)\n\nBaps When the day ends\nLani I'd have all your kids like a daycare\nStill throwing shots Girl you still in the picture\n\n\nThat still your girl but she know she my bitch\nApril Im sorry I callled you a bitch\n\nWait for your calls when I call you ain't pick up hmm\n\nBRIDGE:\n(Girl you know I saw what I saw. You just believe what you hear from these broads\n\nShit ain't never ever gon feel the same\nPity this time you the one here to blame\n\nAll my drinks is in colour.  Comas and code\n\nLani Lani. Dropped my soul at the dojo\n\nPicking shrooms all my niggas is ayt\n\nChasing paper for the..\n\n\nHOOK:\n\nWhy you fiend yeah?\n\nGirl just come\nCome ride this wave\n\nWhy you fiend yeah(yeah)?\nWave wave wave wave Yeah\n\nWhy you fiend yeah?\nGirl just come\nCome ride this wave\n\n\nWhy you fiend yeah(yeah)?\nWave wave wave wave Yeah\n\nRAY:\n\nYou got me catching my wave when I'm f*cking with you/\nYou got me feeling like Mike and it's prolly the Shoes/\nGot me feeling like Noah bitches coming in two's/\nYou can have it both my lady if you really can't choose/\nAh/\nYou told me you want a commitment/\nYou got shit twisted like cursive and that's how its written/\nTold my world is Paradise-Garden of Eden/\nTold me you don't suck no dick, so I told you to eat it/\nYea I rejected Boss Brain and somehow they hating on me/\nI don't get it how you hating when you barely know me/\nThey always told me risk it that's how you get it homie/\nThey always told me life is short, shorter than Gary Coleman/\nAnd everyday of my life is one of those greatest moments/\nHow I have to roll a jay just to fade all my fucken problems/\nYou ain't replied emails now you working on it/\nYou said you gon surpass us but you hardly working on it/\n\nBRIDGE + HOOK\n\nRAY:\n\nWhy you fiend/\nGirl why you fiend/\nI know for a fact you finna ride this dick/\nNo need to pretend all your friends is not here/\n(They not here)\nRide this wave/\nThey only hear me in the morning like I'm Sway/\nWho the best in the game/\nI'm overwhelmed cause they said it was Ray/\nRide this wave/\nRide this wave/\nAll of your bictches been riding my dick/\nNow you finna hate cause I'm doing great/\nShe starting a book so I just flip the page/\nIf you ain't got no plans you can call me today/\n\nHOOK", "image": "https://images.genius.com/3252379f345638f5b880f5055e0ca791.540x540x1.jpg"}], "artist": "B.o.B"}