{"songs": [{"title": "No Pistols", "album": "Adrenaline Rush 2007", "year": null, "lyrics": "(feat. Speedknot Mobstaz)\n\n[Chorus:]\nDon't wanna see you with no pistols if you ain't ready to roll n*gga(put down that 45)\nDon't wanna see you with no pistols if you ain't ready to roll n*gga(gotta let that 40 ride)\nDon't wanna see you with no pistols if you ain't ready to roll n*gga (let's do a homicide)\nDon't ever wanna see you with no pistols if you ain't ready to roll n*gga\n\n[Twista:]\nDon't wanna see you with that 45 unless you gon' ride\nIf I say you gon' die motherf*cker I get so loud\nWhat you be procrastinating I think you f*ck around with pistols cause they fascinating\nYou motherf*ckers ain't gon' do nothing\nWhen you get through frontin niggas out here already know that you ain't gon' shoot nothing\nEnd up at the pearly gates when they test you\nGotta dirty face but what you know about a 30 ain't special shit\nAnd I know them hard words make you jump up with your? when you got the mosburg pump bitch\nAnd the shortys lookin at you like a punk bitch\nCause you ain't making what you claim ain't gon' dump click\nYou gon cry when you hear them bullets dumping when them shortys come and ride on you(when the pistol click clack)\nIf you still alive will you really get the dumpin if you got that 45 on you?\n\n[Chorus]\n[Mayz:]\nOnce upon a time in the sha there was three real killas who bust guns and puff fire\nThey cut weight by the key and baggin every gram\nInstead? bustin with the pistol in they hand\nI'm preachin murder like a vicious reverand\nAbout niggas who claim they shootin but they never seen 357s\nNow what reason would you hold it up\nPut that pistol down nigga pick that weed up roll it up\nTwista up the light you don't really won die\nStop your blood clot crying\nYour bullets don't fly\n? aim smooth? I keep that smith and wessel with me like I'm blackmoon\nToss up the living room storm through the kitchen\nI caught that nigga in the bathroom shittin and pissin'\nWhat you shakin' for I thought you said you ready to ride\nDon't be coming with me if you ain't strapped because I\n\n[Chorus]\n[Liffy Stokes:]\nI keep a p95 nine milli ruger\nYou f**kin with a shooter\nQuick to bloody your suit up\nMy aim impeccable point like a decibel\n300 feet away in a tower snipin a festival\nWhat you know about 9's and Glock 40's\nAnd 45's see our 15's with the 5 pound slide\nThirty shot clips snub noses with the rubber grips\nWicked techs that'll put the kiss of death on your lover's lips\n[? ] we get the squeeze nigga\nAk-47s make them bitches retreat nigga\nLike a g nigga\nI make em bleed nigga\n? I'm bustin that's on my c nigga\nMy war chest is filled with ballers and techs\nSki masks gloves and vests so nigga what's next nigga\nIt's real thuggin you a bitch to the bone\nIf you ain't go through nothin shorty leave them pistols alone\n\n[Chorus]", "image": "https://images.genius.com/37a0e3023180b834b869e6ad5b51b224.500x500x1.jpg"}], "artist": "Twista"}