{"songs": [{"title": "Roger That", "album": null, "year": null, "lyrics": "[Verse 1: Nicki Minaj]\nI'm in the collard green 6, cornbread in the guts\nGot the Halloween kicks trick or treating the clutch\nCome on nigga, is you tricking or what?\nFlow tighter than a dick in the butt\nJust hopped off the plane, came back from Vancouv'\nLittle white tee, some boobs and bamboo\nWhite girls tell me, \"Hey, Nicki, your camp rules\nIs that why you get more head than shampoos?\"\nAsalaamalaikum, no oink for me\nAnd I never let a D-boy boink for free\nCause it's barbie bitch, you can join the wave\nI done penny, nickel, dimed, I done coined the phrase\nYou couldn't beat me there if you had a Leer\nIndian-style court side with a cavalier\nVIP Roseau's you can have a beer\nCause honey when you getting money you don't have a care\n\nNow Roger that, Rroger that. Roger that, Rroger that\nRoger that, Roger that...Roger\n\n[Verse 2: Tyga]\nYoung black Rico's\nKill for the C notes\nBut me though\nI jack son bitch Tito\nShe wanna play games\nBut this is not bingo\nMonopoly I'm past \"GO\"\nGon' ahead and deep-throat\n4-chick Foursomes\nSkin colors mocha\nSally and Sonia put the pussies on my Totem\nPole\nWatt stroke 'em\nStrike it like bowling\nNow open like you yawnin'\nIt's 6 in the morning\nSleeping on me probably in a coffin\nI'm hotter than the end of fuckin' August\nI'm awesome\nI'm awesome. Repeat it to your Grandma and Uncles, my Mothers\nTyga's no Dad but I'm the motherfucker\nMy fuckers\nThis the last supper\nLook, no hands\nI'm a bread cuffer\nI don't dare lover\nI'm a dare devil\nI don't fear nothin'\nMotherfucker\nYoung money!\n\nNow roger that. Roger that. Roger that. Roger that. Fuck around and never get Roger back\n\n[Verse 3: Wayne]\n(I'm goin' in!)\nFresh off the jet, sharper than Gillette\nThe blunt still wet, so pass it like brat\nWe sip side a mug, we call it upset\nSmoke more than 4 quarters, we call it sudden debt\nI'm a beast\nYou a pet\nAK long neck\nKeith Sweat\nWeezy, motherfucker\nCapo in this bitch with me\nMoney talks and have a convo in this bitch with me\nI'm mountain high Colorado in this bitch with me\nFlow crazy, 730, you just 650\n20 bullets from the Chopper take the roof off\nLaughing to the bank\nI'm a goof ball\nIt's YM\nAnd we at yo neck like a Violin\nIt's our world\nWe make it spin\nAnd y'all the prey. Amen\nNow roger that. Roger that. Where Roger at? I heard Rog' a Rat\nFuck around and never get Roger back", "image": "https://images.rapgenius.com/0aab17e1dedea1987868eca79f47596f.500x500x1.jpg"}], "artist": "Nicki Minaj"}