{"songs": [{"title": "Extraordinary", "album": "Poindexter", "year": "2009-09-17", "lyrics": "[Chorus]\nI ain't your ordinary nigga\nLook around, this ain't what ordinary gets ya\nI ain't your ordinary nigga\nLook around, this ain't what ordinary gets ya\n\n[Verse 1]\nGam-B, the one like Neo\nYou didn't see it coming\nReverse Miss Cleo\nI'm C-P30\nOr better yet Anakin\nWhen it comes to lightsaber's that I'm handlin\nI used to be king of the whack look\nNow I stay king of the MacBook\nYes, mack book, where you write your numbers down\nYeah, boy, I got girls in and out of town\nYou got it wrong like saying OJ; IJ\nStop the rumors\nAsian girls don't got sideways\nI gotta fuck every shade of latte\nI gotta flow like my mouth to Kanye's\nThese niggas think that I'm playing, I ain't saying nothing\nI'll fuck your girl on the burner\nI'm so top stuffing\nYou can't stop nothing, I'm the juggernaut\nThat's why your B's sweet on me like I'm butterscotch\nYeah, we run a lot\nBoy, the track runners here\nI'm Elroy we jet sun out the atmosphere\nLet me make it clear\nI'm your inner fear\nAnd I'm taking over, please don't interfere\n\n[Chorus]\nI ain't your ordinary nigga\nLook around, this ain't what ordinary gets ya\nI ain't your ordinary nigga\nLook around, this ain't what ordinary gets ya\n\n[Verse 2]\nUh, I'm the streets desire\nYou're getting too old man, please retire\nDon't make me carry you like I'm Liar Liar\nBring the heat like a monster, I'm Elmo's fire\nI'm too busy spittin' shit with a socialite\nI'm too busy sittin' bitch with some model types\nYes, sir, my girl's look like Rihanna twice\nWith some packed bags, yeah, they ain't going home tonight\nGet your camera phone, prove ya seen me\nOr else you'll be with friends like \"Please believe me!\"\nI'm all that, I'm Kel and Kenan\nNigga, I come hard like I'm filled with semen\nThese rappers bore me\nGun talk with black clothes\nY'all let me know when y'all let 1998 go\nY'all niggas scared to grow\nI'm never scared to go\nAnywhere that's new, I go outside, y'all niggas stay at home\nBut that's alright dude\nI'm a special guy\nY'all been wanting to rap since you were ankle high\nAnd I've been wanting to rap since like what, 05?\nDo the math man, how are you one of the best alive?\nGam-B, yes me, best out there\nTrying to get universal like healthcare\nSo fresh, so clean, like a new pair\nWhen you get to the top what you do there?\n\n[Chorus]\nI ain't your ordinary nigga\nLook around, this ain't what ordinary gets ya\nI ain't your ordinary nigga\nLook around, this ain't what ordinary gets ya", "image": "https://images.genius.com/78bea76bf210cec3130c214f2a4ab5f7.800x800x1.jpg"}], "artist": "Childish Gambino"}