{"songs": [{"title": "You Ain’t Hard", "album": "I’m Serious", "year": "2001-10-09", "lyrics": "[Verse 1]\nI done been locked up wit the worsest of niggas\nArmed robbin con men and murderous niggas\nThe dope boys be the first to deliver\nGreen, brown, or blow, got mo snow than Buffalo in the winter\nThink these lyrics is comin from a pretender\nIf I said it I done seen it or done it\nSo I mean it when I say you don't want it\nDone came a long way from jumpin the hunnids (hundreds)\nTo baggin them quarters, doin shows from L.A. to Flawda (Florida)\nIn Atlanta, I'm the law and the order, the king of it\nGot a throne and a brougham and a (?) that's chrome\nCallin houses on the water my home, wit no mortgage or loan\nIf I live in it I bought it and own it\nIf I'm wit a bitch I caught her and boned it\nNo question, no less than a week and she's in confession\nAnd I bought no necklace unless I'm investin\nNo exceptions, I'll open ya closed session\n\n[Hook] X2\nYou ain't hard til you cookin like this\nYou ain't mob til you fucked wit the click\nOr you flippin them bricks\nWe make music for the broke and the rich\nFor the hoop and the 6\nFor the hustlas went from nothin to (?)\n\nWe hustle from 6 to 6 to 6 again\nSell fat nicks for 10 til the bricks get in\nVenturin from ATL to Michigan\nThe talk of yo town, y'ain't even worth mentionin\nPeppermint try'na get another shipment in\nAnd Sam Goody just hit us on the hip again\nGot hot shit under our fits that'll pierce ya skin\nAnd the click I'm in some made men, know dat\nGot a deal now, but I was the shit befo dat\nTotin steel now, but hold my own wit no gat\nT.I.P. the answer to the question \"Where them hoes at?\"\nThe heat is catchin up to niggas runnin 4 flat\nAt the club gettin crunker than crackers on Prozac\nSay you got some dubs on the Lac? Well shawty where the vogues at?\nT.I.P. ain't the shit? come on shawty, don't act\nI'm the hottest thing ever flowed over 24 tracks\n\n[Hook] X2\n\nSome niggas wonder how I made it, I do what it takes\nAt school I was cool wit the nigga who threw a 22 in ya face\nTook ya starter coat and choked ya til you blue in the face\nOr you might know me as the nigga who fucked ya bitch and bust 2 in her face\nEither way, I'm a winner like the 4 and the trey\nYou probably never held mo dough than I can blow in a day\nSometimes I'm wearin gold, sometimes I'm ridin on it\nBetween us, I doubled up off my signin bonus\nK.P. and Jay say \"Shawty, ay you goin legit\"\nBut I ignored the shit, when I scored a brick\nI bet you never knew how quick 36 O's'll flip\nYeah I cook it til it bubble up, see how quick it double up\nCompetition's in trouble I'm supplyin the hood\nBorn, bred, when I'm dead, I'mma die in the hood\nNiggas be tryin the hood, I open fire in the hood\nShut 'em up, wet 'em up, and let 'em lie in the hood\n\n[Hook] X2", "image": "https://images.genius.com/d4010b5f2aa7374582fd8c3be5913af3.1000x1000x1.jpg"}], "artist": "T.I."}