{"songs": [{"title": "Set The Tone", "album": "Young Sinatra: Undeniable", "year": "2012-04-30", "lyrics": "[Intro: Charlie Chaplin (Sampled) & Samples]\nI don't want to rule or conquer anyone. I should like to help everyone if possible: Jew, Gentile, black man, white. We all want to help one another. Human beings are like that. We want to live by each other's happiness, not by each other's misery. We don't want to hate and despise one another. In this world there’s room for everyone and the good earth is rich, and can provide for everyone. The way of life can be free and beautiful, but we have lost the way. Greed has poisoned men's souls...\n\"Sinatra\" \"Sinatra shot ya, goddamn you\"\n\"Is this what you want?\" \"Logic\"\n\"You are watching a master at work\"\n\"You have interfered with our affairs for the last time\"\n\n[Verse]\nMany men wish to acquire fame for the wrong reasons\nFans telling me never change, but it's hard to fight the seasons\nThey hear me on the radio and now they yelling \"Treason\"\n'Cause Logic givin' 'em mainstream verses like Ephesians\nBut I never sacrificed my lyrics or my flow\nThere's a time and place for everything, so what the fuck you yelling for?\nThe fame hit me quicker than previously determined\nRattPack, real all the time, fuck a vermin\nMotivated by money, sex, drugs and violence\n'Cause the era that we living in was built up on defiance\nWhat we need is alliance, but y'all don't really hear me though\nSo, hip-hop's a chariot and Logic's finna carry it\nStallion, coming for their necks like a medallion\nStraight out of Sierra Leone\nMotherfuckers it's on, I'm under your skin like cortisone\nNinty-nine percent of these motherfuckers is bullshit (\"Sinatra\")\nBut I'm on that Bull shit: Michael Jordan\nCutting records after the show in my hotel while I'm touring\nYeah, and I ain't even twenty-three\nBut my bank account can vouch, I'm ballin' like an M.V.P\nYes, it's me, L.O.G.I.C, I'm repping MD\nNow what the fuck is a vacation? I see no satisfaction\nI work twelve hours a day every day with no distraction\nSeven days a week, and twelve hours, that's a lazy day\nGoing seventy-four hours with no sleep, call that a crazy day\n\"As you can see, my Jedi powers are far beyond yours\"\nThis is Manhunt, and I ain't stopping till y'all apprehended\nMany years I have attended and finally been commended\nFor keeping it real, so finger fuck whoever I've offended\nNow pull out the MAC and watch them freeze like PC's\nI'm Celsius, never graduated, so fuck degrees\nI educate 'em with ease, however listener please\nDon't knock that last line, school it just wasn't for me\nWe all different and I'm here to make a killing\nSo say hello to the villain, 'cause in this day that we livin' in\nThe nice guys finish last\nI'm blowing up, guess you could say I'm having a blast\n\n[Outro: Samples]\n\"Sinatra shot ya, goddamn you\"\n\"You are watching a master at work\"\n\"Is this what you want?\"", "image": "https://images.genius.com/4cb73fd1e86a44f861bc4ba694c17126.1000x1000x1.jpg"}], "artist": "Logic"}