{"songs": [{"title": "Black Cop", "album": "Return of the Boom Bap", "year": "1993-09-28", "lyrics": "Buck buck buck-buck-buck, buck-buck buck buck!\nAll rude bwoy lissen up!\nBlack cop!! Black cop black cop black cop\nStop shootin black people, we all gonna drop\nYou don't even get, paid a whole lot\nSo take your M-60 and put it 'pon lock!\nTake your four-five and you put it 'pon lock!\nLookin for your people when you walk down a block\nHere in America you have drug spot\nThey get the black cop, to watch the drug spot\nThe black drug dealer just avoid black cop\nThey're killin each other on a East Coast block\nKillin each other on a West Coast block\nWhite police, don't give a care about dat\nDem want us killin each other over crack\nAnyway you put it it's a black on BLACK\nBlack cop black cop black cop\nBlack cop black cop black cop\nThirty years ago, there were no black cops\nYou couldn't even run, drive round the block\nRecently police trained black cop\nTo stand on the corner, and take gunshot\nThis type of warfare isn't new or a shock\nIt's black on black crime again nonstop\nBlack cop!! Black cop black cop\nBlack cop black cop black cop\n\n\"Don't be the sucker..\nDon't be the sucker comin into my face..\nDon't be the sucker..\"\n\nHere's what the West and the East have in common\nBoth have black cops in cars profilin\nHardcore kids in the West got stress\nIn the East we are chased by the same black beast\nThe black cop is the only real obstacle\nBlack slave turned black cop is not logical\nBut very psychological, haven't you heard?\nIt's the BLACK COP killin black kids in Johannesburg\nWhassup black cop, yo, whassup?!\nYour authorization says shoot your nation\nYou wanna uphold the law, what could you do to me?\nThe same law dissed the whole black community\nYou can't play both sides of the fence\n1993 mad kids are gettin tense\nBlack cop!! Black cop black cop black cop\nStop shootin black people we all gonna drop\nYou don't even get, paid a whole lot\nTake your four-five and you put it 'pon lock!\nTake your M-60 and put it 'pon lock!\nTake your uzi, put it 'pon lock!\nBlack cop black cop black cop\nBlack cop black cop black cop\n\n\"Don't be the sucker..\nDon't be the sucker..\nDon't be the sucker..\nDon't be the sucker comin into my face\nDon't.. don't be the sucker comin into my face\nDon't-don't-don't be the sucker comin into my face\nDon't-don't-don't-don't\nDon't be the sucker comin into my face\nDon't-don't, don't-don't\nDon't be the sucker comin into my face\nDon't-don't-don't!\nDon't be the sucker comin into my face with that yang-yang!\"", "image": "https://images.genius.com/2573d3afb044969d03669dee90d609f7.1000x1000x1.jpg"}], "artist": "KRS-One"}