{"songs": [{"title": "Let Me Fly (Clark Washington Mix)", "album": "Murder Inc.", "year": "2002-01-01", "lyrics": "Uh. Yea. Uh. If you love something let it go, if it\nComes back to you it's yours. If it doesn't, it never was\nHold me down baby\n\nEither let me fly, or give me death\nLet my soul rest, take my breath\nIf I don't fly I'ma die anyway, I'ma live on\nBut I'll be gone any day\n\nEither let me fly, or give me death\nLet my soul rest, take my breath\nIf I don't fly I'ma die anyway, I'ma live on\nBut I'll be gone any day\n\nHold me down, niggas wanna know me now\nDidn't want ta play wit' me when to show me how\nNo meow\nIs it all about the bark?\nLet the dog lose baby it's about to spark\nLight up the night, like the 4th of July\nNiggas know, when I let go, niggas die\nWit' this Y and you don't know you slow like Baltimore\nIf you ain't tryin' ta go ya blow\nI soak up all the pain and accept it in silence\nWhen I let go it's violence cause the wildest\nLeaves the dog barkin' up the tree for the cat\nIn the fog but ya'll niggas see is the bat\nFlappin' away wit' em blind like Stevy\nNiggas don't hear me, still tryin' to see me\nStop being greedy, ya heard what I said\nLet me go, let me flow on my bed\n\nEither let me fly, or give me death\nLet my soul rest, take my breath\nIf I don't fly I'ma die anyway, I'ma live on\nBut I'll be gone any day\n\nEither let me fly, or give me death\nLet my soul rest, take my breath\nIf I don't fly I'ma die anyway, I'ma live on\nBut I'll be gone any day\n\nI sold my soul to the devil, and the price was cheap\nA yo it's cold on this level cause it's twice as deep\nBut you don't hear me, ignorance is bliss and so on\nSometimes it's better to be thought dumb\nShall I go on\nYou don't want no real, what the deal is a mystery\nHow is it I can live and make history\nIf you don't see it then it, wasn't ment for you to see\nIf you wasn't born wit' it then, it wasn't ment for you to be\nBut you can't blame me for not wantin' to be hound\nLock down in a cell wit' a soul gettin' dwelled\nThis is hell, go get the devil and get me the key\nBut can't be worst than the curse that was given ta me\nIt's what I live for, you take away that and I'm gone\nThere's a difference between, doin' wrong and being wrong\nAnd that ain't right\nJust keep it fair baby\nPut me in the year, and I'll take it there baby\nYes\n\nEither let me fly, or give me death\nLet my soul rest, take my breath\nIf I don't fly I'ma die anyway, I'ma live on\nBut I'll be gone any day\n\nEither let me fly, or give me death\nLet my soul rest, take my breath\nIf I don't fly I'ma die anyway, I'ma live on\nBut I'll be gone any day\n\nI'm a flow regardless because I'm an artist until I'm trapped\nI'ma continue to hit the hardest whether I scrap or rap\nGive me death but you ain't my friend\nI see it in your eyes, you contemplate my end\nYou waitin' for that bend in the road, where you were told\nThat you would go, when you were old\nAnd if you died young, it was told\nSo what the dilly, what it was worth\nThink back 26 years, be like what of his birth\nWhat if it was a miscarriage and I never existed\nHave I given something that have been taken away you\nWould of missed it\nDidn't know, did I persisted?\nIt was the call of the wild\nI'm here to say what's in my heart, and you call it a style\nDon't put it in the cage, don't mistreat it\nYou say you hunger for knowledge, here it is eat it\nAnother song completed is another thought captured\nLet me do my thing I got it locked wit' this rap shit\n\nEither let me fly, or give me death\nLet my soul rest, take my breath\nIf I don't fly I'ma die anyway, I'ma live on\nBut I'll be gone any day\n\nEither let me fly, or give me death\nLet my soul rest, take my breath\nIf I don't fly I'ma die anyway, I'ma live on\nBut I'll be gone any day\n\nOr give me death, uh uh uh, or take my breath\nI'ma die anyway, but I'll be gone any day\nWhere my niggas?\nUh ha ha, for my niggas\nUh ha ha, for my niggas\nUh ha ha, for my niggas", "image": "https://images.rapgenius.com/d367d0bc912e4856e7ae18e124bfdf44.419x400x1.jpg"}], "artist": "DMX"}