{"songs": [{"title": "Double Cross", "album": "36 Seasons", "year": "2014-11-20", "lyrics": "[Verse 1: Ghostface Killah]\nCleaned up, now I gotta find Bamboo\nI changed shit on the block and got rid of the fools\nThings'll be different, no need to feel pressured\nNo more drug houses, little kids could be treasured\nThe streets ain't filled with crackheads and D's\nI go walk around my hood, nigga know my steez\nPhilly, about to rebuild the nation\nThrough the knowledge of self, through education\n\n[Interlude]\nFreeze, motherfucker. Hands, hands, let me see your hands. Get out of the car. Get out of the fucking car. Get out, eat some fucking dirt. Get on the fucking ground\n\n[Verse 2: Ghostface Killah]\nI seen the police pull up, and rides hopped out\nPut your hand behind your back, you're guilty without a doubt\nWhat you mean, son? We built on this\nIllegal chokeholds, slap cuffs on my wrist\nI don't know what you talking about, boy, I'm the authority\nI'm just here to question up minority\nA thug drug pusher, violent man of deception\nAnd you just happen to fit the description\n\n[Interlude]\nNigga, you just another pawn in my chess game. I taught you everything you know, I run this motherfucking city. Think you gon' fuck everything up? You got the right to remain silent. Anything you say will be used against you in the court of law. (Faggot ass police nigga, man) Nigga, you're going away for a long time\n\n[Verse 3: Ghostface Killah]\nOkay, I got it, niggas just set me up\nDo their dirty work and thrown behind bars\nYou want wars? You got it - Tony ain't the one\nI told you before, I make murdering fun\nGotta swindle the kid, have me masking your enemies\nIt's all good in my chest, I got ten of these hearts\nAnd I vow for revenge\nTony don't stand for crumbs and fake friends\n\n[Verse 4: AZ]\nIt's funny, only if niggas really knew\nGot the keys to the city, I could kill a whole crew\nPut the squeeze on the willy, get silly, go fool\nChop a nigga up, blame his body on his dude\nWhat it do? It's bigger than the boys in blue\nBeyond definition what this falls into\nM's in my optic, no ends to the profits\nJudges, prosecutors, politicians in my pocket\nHostage, high life, living on the edge\nToxic in hindsight, see me when I'm dead\nPledge, sworn in to serve and protect\nWhat a web, catch a head, then I'm on to the next\nShit be booing, played out scripts, need a new one\nI dare a nigga doubt what I'm doing\nMoving, cash rules everything around me\nCrown me, I'm trying to squeeze blood out the county", "image": "https://images.rapgenius.com/24859cf0fe9fd30930516744cb0dda43.940x626x1.gif"}], "artist": "Ghostface Killah"}