{"songs": [{"title": "Exercise Yo’ Game", "album": "Gangsta’s Paradise", "year": null, "lyrics": "Verse One: E-40\n\nWhen I was fifteen years old\nStraight dope game I was told\nI went from, selling pennies of the riders dank-ah (riders dank-ah)\nTimin ass think of slangin crank (think of slangin griqua)\nSituation critical: phone home, phone home\nTalkin on my digital: call phone\nYa seen a boatload of situations, for dangleations\nInvalid ghetto pass late ass registrations\nBoy I tell you shit is pitiful, damn!\nVocally repentable, dead right!\nI try to stay away from artificial (artificial)\nPlastic ass (plastic ass), pleather motherfuckin individuals\n(Fuckah!!)\n\n*Coolio*\nExercise yo' game main\nCause things is changin and rearrangin\nExercise yo game main\nJust use yo' brain main don't run the same game\n\n*E-40*\nExercise yo' game main\nFertilize yo' grass, playa get that cash\nExercise yo' game main\nBut you gotta make it last!\n\nVerse Two: Coolio\n\nOne lone loco rides away\nInto the sunset but, I ain't done yet\nRespect yourself and wear your vest\nKeep your guard up cause fools be hard up\nWhen you hittin dips better check yo' clips and\nWatch the police and the Bloods and the Crips\nAnyway you choose got ta pay your dues\nKeep one in the chamber cause the shoes always loose\nRubber wheels beat rubber heels anyday\nPut the green in your jeans and get the holes out ya halo\nOr you can stay broke while your homies is rollin smokes\nAnd sippin yak and smokin dank and tellin jokes, haha\nPa-pap, pa-pap *gunshot sound accompanies*, fool you can have that\nI worked too hard for mine, to let you take a dime\nNo pain no gain no pocket change\nPrepare yourself for battle, exercise yo' game\n\n*Coolio*\nExercise yo' game main\nMake your money grow don't you be no ho low\nExercise yo' game main\nKeep your works on tight to make yo' stash stay right and\n\n*E-40*\nExercise yo' game main\nFertilize your grass,  playa get yo' cash\nExercise yo' game main\nPlaya get your coins, be like Donald Goines\nHave heart have money man, have heart have money man -- YAKNOW!\n\nVerse Three: KAM\n\nI got next you wanna run with me homey (yeap)\nWell I don't need playas in the paint who cain't do nuttin fo' me\nShow me get down nigga (right) we can make sumpim happen (yeah)\nI'm West coast Eastside East hood slum gangsta rappin\nNiggas say you want to be affiliated (yeah)\nWell let me warn you: I'm the kind of playa that's really hated\nI'm rated X like Malcolm\nE-40, Coolio, and KAM -- sprinkle game like talcum\nYou want to make money in the game well let me show you\nHow to do for self cause ain't nobody gon' do this for you\nOh you caught like lint; if you waitin on the mystery God\nCause ain't nobody gonna give you shit\nYou gotsta get up, off yo' ass\nAnd put yourself in heaven on Earth, before you pass\nAnd exercise yo' game -- exercise yo' game fool\n\nVerse Four: 40 Thevz\n\nPeep game from a young ass, rollin on the one way\nFoot to the gas got the indo mixed with hash\nMonday through Sunday and all in-between\nI fiend for my paper, my fed, and my green\nAin't no busters or no suckers on my team or in my mattress\nJust call me the Pimp\nAnd you can call me the Rat\nWatch my feet hit the tracks it, ain't no lookin back\nI'm on a mission tryin to put my fuckin click on the map\nBut these niggas don't know the half\nRunnin with riff raff but I got some game for your bitch ass\nCause your game is weaker than an anorexic\nI exercised my game until I had my game perfected\nI wrote the game on paper then I put the game on record\nYou better check it nigga don't you every disrespect it\n\nE-X-C-E, R-I-S-E, Y-O-G-A, M-E for-dy/40\nThevz in the house better exercise yo' game\nExercise yo' game\n\n*E-40*\nHave heart have money main, have heart have money man, YAKNOW!\n*Coolio*\nExercise yo' game main\nMake your money grow don't you be no ho low\nExercise yo' game main\nKeep your works on tight to make your stash stay right and\n*E-40*\nExercise yo' game main\nFertilize your grass, playa get that cash and\nExercise yo' game main\nBut you gotta make it last (make it last)!!!\n\n[E-40] All day erytime\n[Cool] Yeah\n[E-40] E-40 and tha motherfuckin Click\n[Cool] That's right\n[E-40] PMD\n[Cool] Yeah\n[E-40] Crowbar, Barr 9\n[Cool] Uh-huh\n[E-40] 40 Thevz\n[Cool] That's right\n[E-40] Erytime, motherfucka\n[Cool] In that ass\n[E-40] like Bugsy\n[Cool] Yeah\n[E-40] De massive\n[Cool] Uh-huh\n[E-40] We don't stop\n[Cool] My nigga Kam\n[E-40] We don't quit\n[Cool] God damn!\n[E-40] Fuck a motherfucka -- we on hit, the Bay to L.Aaaaaaaaaii\n[Cool] Slide\n[E-40] Motherfucka display\n[Cool] All the way to Compton\n[E-40]  Yo' game orientate in situations\nNiggas dump all on my Clickalications, I'm pervin\n[Cool] Oh yeah\n[E-40] Erytime motherfucka\n[Cool] Sho' we do -- don't let us in we breakin in fool\n[E-40] This is what I do\n[Cool] Yeah -- E-40, Coolio, the 40 Thevz -- my nigga Kam, god damn\n[Cool] Yeah, Barr 9 in the house", "image": "https://images.genius.com/bd2e6c4ceafdecadc8f1ece3f595f617.1000x1000x1.jpg"}], "artist": "Coolio"}