{"songs": [{"title": "What Cha About", "album": null, "year": null, "lyrics": "Yeah, you know, I'm slidin why'knahmsayin?\nRollin down the streets doin my thang why'knahmsayin?\nThat's the flow, whattup?\nSmokin my weed, why'knahmsayin? Drinkin my joint\nThis bitch man, this bitch roll up to me man\nThis bitch pull up inside and shit\nRoll down the window and shit, I'm like - \"Fuck you want bitch?\"\nBitch, tell me, why'knahmsayin?\nShe tell me \"Turn that shit down, Tha Dogg Pound broke up\"\nHeh, hehehe, haha, I had to laugh at the hoe, why'knahmsayin?\nThat's some funny shit\nFor real though man, tell these motherfuckers what's happenin\n\n{*music starts*}\n\n[Chorus: repeat 2X]\n[Daz] What you about nigga?\n[Sung] Dogg Pound for life\n[Daz] Do ya some nigga?\n[Sung] Smoke a pound tonight\n[Daz] How ya feel nigga?\n[Sung] I feel larger than life\nDogg Pound for life\n\n[Kurupt]\nDogg Pound shit..\nLife without money (money) that's like breathin wit no air\nPrepared, there's no love in warfare, engage\nI make the front page, like Nicholas Cage\nAnd get served, front and center stage (get served)\nI'll break you through 'til you throw up your teflon barriers\nAnd get penetrated, tell the connectects superior\nHostile, verbal apposal in 3D hittin every galaxy throwin up D.P\nNow I could be quick as a cheetah\nAnd rip through ya shit like a motherfuckin wild heina\nFrom the city where light shine bright at night\n(at night) MC's, Shaniqua's, speakin upon the mic\nFrom L.A. to the city of Phil' (Phil')\nWhen you approach Kurupt, approach wit skill\n\n(f'real) Cause if you don't you'll get shook (shook)\nAnd broken, nigga I rock it and break it open\n\n[Chorus]\n[Daz]\nWhat you about?\n\n[Kurupt]\nYou servin me motherfucker? (hell no) I think not\nThat's facin a blizzard in a fuckin tank top (back it up)\nI took trips from New Jerz' to Cape Cot (Cot)\nYou could be adventurous up againt tremendous odds\nAnd face a poltergeist, I'll bring it to ya nice\nI had the whole scenery surrounded like the wise {*cat meow*}\nWho could it be comin through in all blue (fool)\nDogg Pound Gangstas number one, number two\nNever evade the principle, the top principle\nUp against the top invincible, rhyme assassin\nI lay the cards on the table, take a pick\nThe wrong choice'll get your whole chest cavitys picked\n(ahh!) That's were all the bullshit ceases\nThis whole frame and format crumble right before his eyes into pieces\n(fuck that!) Fake ass assassin wit no heart, no mind\nNo money, no hoes, no flows and no rhyme\n(no rhyme!) Waitin for the poetical Satan\nCreatin slaughters, runnin through stores like Water Patan\n(oh, oh) I'm all about money makin\nAnd I'm makin mistakes, you're only worth what your creatin\nAnd a garden of snakes\nNow all I could do is survive, is stay alive\nMoney 'til I motherfuckin die, stranded on Tha Row\nI'm in this motherfucker to grow\nAnd make fetti like I'm on a mountain of snow\n\n[Chorus]\n\n[Chorus] - 0.5X\n{*music plays to fade*}", "image": "https://images.genius.com/e051ff42cc180d489d4e1b4e3e2906cd.333x333x1.jpg"}], "artist": "Kurupt"}