{"songs": [{"title": "Closer", "album": "Authentic", "year": "2013-04-30", "lyrics": "Just pull up on you playin this\nYea\nNot caring how you feel about it\nYea\nYou probably don't even know what it is\nYea\n\nGive it up\nI'm a love it, boy, I won't you stop\n(You don't stop)\nBaby bring me closer\nTake it off\nI'm a love it, boy, I won't you stop\n(You don't stop)\nBring it closer and closer\n\nYou was reminiscin and wishin\nFor L to deliver what the game's been missin\nBeast that knock rhymes that lock with precision\nHot like when Pac first popped out of prison\nTwo schools of thought headed for a collision\nDid it big for a minute then you lost yo vision\nSkinny jeans, a wedgy and a dance rendition\nTycoons wouldn't choose that mission\nThese cats is all hyped, that's why I don't listen\nI'm too tank fittin right, I see ya'll slippin\nAin't no hate love, nah I ain't trippin\nStill love jewelry and champagne sippin\nBank roll healthy, ice is still sickening\nCouldn't get fresh if you broke up, get slicking\nWe Diddy bop, ya'll out here skippin\nBaby just ignore these fools, they trippin\n\nGive it up\nI'm a love it, boy, I won't you stop\n(You don't stop)\nBaby bring me closer\nTake it off\nI'm a love it, boy, I won't you stop\n(You don't stop)\nBring it closer and closer\n\nBeen with your Peewee Kirkland to Peewee Herman\nBishop Lamont, need to give em a sermon\nHow soon we forget when the chrome is turnin\nModels in the backseat burnin\nBut even if I wasn't LL Cool J\nI had the same girl that I have today\nAnd that's not something most of these cats could say\nYour whole hand's different than you're payin, a mistake\nNow some of ya'll gonna feel some kind of weight\nThat's yo prop in which you, you know how we play\nGrown, we're the bad, grinding all day\nFool, you got a edge when you take that away baby\nThe moment of truth and the jacuzz on\nLike that news, play some rhythm and blues\nWorry bout the water baby, leave on your shoes\nToast to the gold, my heart don't lose\n\nGive it up\nI'm a love it, boy, I won't you stop\n(You don't stop)\nBaby bring me closer\nTake it off\nI'm a love it, boy, I won't you stop\n(You don't stop)\nBring it closer and closer\n\nLL – grown up man\nCouldn't give a damn if a young boy's my fan\nLong as his mama 2 step to my jam\nWhile she cleanin up her house, mop in her hand\nIt's how I changed the game, now you understand?\nI got that old money, weak rubber bands\nCats playin themselves, getting out of hand\nShow two features to chase teenage fans\nWell I got it right, I cram to understand\nHow you trendy shorty, L's a brand\nRaised on hip-hop, the grownup fans\nHands in the air, rocking in a stance\nI've been made, ain't no making of the bands\nSave the techno and glow sticks for Disneyland\nI'm sayin 5 features on every other jam\nYou like them? Listen to em, we don't give a damn\n\nGive it up\nI'm a love it, boy, I won't you stop\n(You don't stop)\nBaby bring me closer\nTake it off\nI'm a love it, boy, I won't you stop\n(You don't stop)\nBring it closer and closer\n\nAha, know what I mean?\nSo you can get yo 2 step on, you know?\nIt's what we love, you know what I'm sayin?\nI'll love you, boy I won't stop\nIt's the music we love, you know what I mean?\nYou know?", "image": "https://images.genius.com/c0c7dbb9fd10ac4887ec94389a4d0712.1000x1000x1.jpg"}], "artist": "LL Cool J"}