{"songs": [{"title": "The Documentary", "album": "The Documentary", "year": "2005-01-18", "lyrics": "[Intro: Livin' tha Life (2003)]\nBitch, I want my mother fuckin' money back\nYou only gave me five dollars!\nI gave you twenty mother fuckin' dollars!\nNo, you didn't! You only gave me five dollars!\nNo, I gave you twenty and I ain't gon' sit here and argue with your flat-ass face, home girl\nThis is America!\nYou know, that's the thing about you mother fuckers\nGo home!\nI ain't goin' no where 'til I get my mother fuckin' change\nI will blow this mother fucker up if I don't get my mother fuckin' change\n*Speaking Japanese*\n*Mocking Japanese*\nI want my mother fuckin' change!\n\n[Verse 1]\nWhat happened in hip-hop that got Pac and Big shot?\nThe thicks blocks, now every rapper claim he let his clip pop\nBut even myself tote a gun, and know to run than get shot\nI've been there before now I'm fuckin' with Doc\n(Dr. Dre: Gotta do them Calvin Broadus numbers)\nIf not, I pitch rocks, anticipatin' my incarceration\nMedia think I'm fakin' like Mason, but when it comes to mace\nFuck R. Kelly, I don't take it in the face\nI find out who sprayed it, and I'm puttin' you under the pavement\nNo Buddhist priest, Catholic, or Baptist pastor can save him\nI'm far from religious, but I got beliefs\nSo I put canary yellow diamonds in my Jesus piece\nI came back from the dead without a part of my chest\nLaid in a hospital bed on cardiac arrest\nI waited for 3 years while everybody else dropped\nNow I understand why Nas did a song with his pops\n\n[Chorus]\nI'm Ready To Die without a Reasonable Doubt\nSmoke Chronic and hit it Doggystyle before I go out\nUntil they sign my Death Certificate, All Eyez On Me\nI'm still at it, Illmatic, and that's The Documentary\nReady To Die without a Reasonable Doubt\nSmoke Chronic and hit it Doggystyle before I go out\nUntil they sign my Death Certificate, All Eyez On Me\nI'm still at it, Illmatic, and that's The Documentary\n\n[Verse 2]\nIf I die my niggas\nFuck it, I did a song with Mary Blige, my niggas\nGot a hook from Faith, no verse from Jay\nI guess on Westside Story he thought I spit in his face\nTold Ed Lover & Moni Love I was talkin' to Ja\nWith that Maybach line, it was payback time\nKeep fuckin' with me nigga, I'll put you under me\nTake your car and trade it in for eight 3 hundred C's\nIf you cross my T, I'll dot your eyes\nYou'll do life in a cemetery, I'll do mine with Shyne\nCome home sit in the throne with my legs crossed\nAnd my Air Forces, middle finger up, fuck the world\n'Cause I'm feelin' like Puff when Life After Death hit\nMo' money, mo' problems and I lost my best friend\nI'm the second dopest nigga from Compton you'll ever hear\nThe first nigga only put out albums every 7 years\n\n[Interlude: Radio Interview]\n(You know what speaking of Jay\nThat just makes me roll down\nNow your song Westside Story)\nUh Oh\n(You got a line that says\n\"I don't do button up shirts\nOr drive Maybachs\"\nIs that a shot at Jay?)\nNah, I was talkin' about Ja Rule\nYeah, so, I mean, I just-I-I got a lot of respect for Jay\nYou know what I'm sayin'?\nI never take shots at legends\nI just-that's just somethin' I don't do\n\n[Verse 3]\nLet me tell you why I do this shit\nI'm a son of a gun 'cause moms was a Hoover Crip\nFirst day I got signed, I had to prove I spit\nFreestyle with Busta Rhymes (Busta: son, duke is sick)\nThe protégé of Doc Dre, I could finally put the shoes on\nNow that the rumors of Rakim and Cube gone\nThey say truth hurts, sunk like quicksand\nDon't stop me in traffic and ask about Hittman\nI gotta restore the feelin' that crawled from under the rock\nAfter Tha Dogg Pound crushed the buildings\nI got a family to feed, I'm the middle of 9 children\nWe can talk about a loan after I sell 5 million\nIf I tell you I ain't Game and I don't know Dre\nYou goin' do me like Xzibit and cut half my face?\nI take all the credit for puttin' the West back on the map\nIf you ain't feelin' that, guess I'm Guerrilla Black\n\n[Chorus]\nI'm Ready To Die without a Reasonable Doubt\nSmoke Chronic and hit it Doggystyle before I go out\nUntil they sign my Death Certificate, All Eyez On Me\nI'm still at it, Illmatic, and that's The Documentary\nReady To Die without a Reasonable Doubt\nSmoke Chronic and hit it Doggystyle before I go out\nUntil they sign my Death Certificate, All Eyez On Me\nI'm still at it, Illmatic, and that's The Documentary (The Documentary)", "image": "https://images.genius.com/395930cce0f4587e3046d2e0a817502c.900x900x1.jpg"}], "artist": "The Game"}