{"songs": [{"title": "I Hate You", "album": null, "year": null, "lyrics": "[Samples]\n\n[Intro]\nSeptember 22nd, 2009\nKendrick Lamar\nTo... to...\n\n[Verse 1: Kendrick Lamar]\nLet me start off this letter saying I don't like you\nScared of you but I will fight you\nI stare at the ceiling and think about you\nCuriosity killing me, thinking of when I'ma meet you\nYou introduced yourself to so many others, mothers, sisters and brothers, children and babies drive me crazy I wonder\nWhy you love people that love people that do right?\nIs it rocket science to you or is it just your type?\nOne of my biggest fears, is waking up 4 in the morning and gotta hear you met one of my peers\nOr maybe a family member that you thought was cool\nOr maybe a person that I'll never meet 'cause of you\nYou, son of a bitch and I wish you never existed\nAnd I swear I'd blow your brains out if you pay me a visit\nBut that's not realistic, 'cause you'll never rot\nBut I'ma still send this letter off\nP.O. Box, and when you get it....\n\n[Hook]\nPlease take it personal\nPlease take it personal\nPlease take it personal\nBecause it's personal\n\n[Verse 2: Kendrick Lamar]\nLet me continue this letter saying I don't like you\nScared of you but I will fight you\nShould be ashamed of the moves you make\nThe pain you bring, the sorrow and the hearts you break\nEveryday you remind me that you're always there\n'Cause every time I come around someone's getting shot down\nAnd all I say is a prayer, \"so help me, Lord!\"\nThen the Lord talk back, \"I can't help you, boy!\"\nThat's fucked up, my life's fucked, was cursed before birth\nAnd what's fucked up, I gotta live my life with the hurt\nOf knowing that you're everlasting\nDwelling upon the masses\nOf the Earth fatal assassins\nSnatchin' bodies\nProbably, on my notepad as I write\nWhy the fuck you wanna take my life?\nSooner or later, I'm tired and weary and my gray hairs are not in my favor\nSo when I write on this paper\nIt's real talk\nSo...\n\n[Hook]\nPlease take it personal\nPlease take it personal\nPlease take it personal\nBecause it's personal\n\n[Verse 3: Kendrick Lamar as Death]\nLet me start off this letter saying I don't like you too\nAnd the reason we haven't met because I've been busy doing whatever since grade school\nI've watched your every move\nYou slipped up a few times, I gave you a pass\nSo don't say I ain't sympathetic\nBut you can barely get curiosity, I'ma dead it\nEverybody wanna know why I act this way\nLet's just say... I had a bad day\nMatter fact, everyday\nBut I take it out on somebody and you could probably find me wherever the wolves parade\nI was born to be a killjoy, I'm an old brat\nConceived by Adam and Eve, so who you mad at?\nNot me, see me? I'm just doing my job\nAnd you ducking me? Is mos def an odd\nSo why send this letter as if I never knew you?\nI rather knock on your door and just hand it to you\n\n[Interlude: Ab-Soul]\nIt's everywhere\nThe streets, the corners, the coroners, the morgues, the cemeteries, hospitals\nHeard about it when I was little\nTomorrow's not promised, 'cause any day can be knocking at your front door\nWar, genocide, homicide, suicide all coincide\nSigned and sealed by the living\nMake it, don't take it\n\n[Hook: Kendrick Lamar]\nPlease take it personal\nPlease take it personal\nPlease take it personal\nBecause it's personal", "image": "https://images.genius.com/25d8a9c93ab97e9e6d5d1d9d36e64a53.1000x1000x1.jpg"}], "artist": "Kendrick Lamar"}