{"songs": [{"title": "Shittin’ on ’Em", "album": "Get Off the Stage", "year": null, "lyrics": "[Too $hort]\nI'm a legend in the game, you can't replace me\nI'm drivin' this car, don't try to race me\nYou'll never win, I came straight from the coastline\nI got the most albums and the most rhymes\nI could die and you still won't catch up\nHow you gonna step up when you let them little heffers\nDig in your pocket while they suckin' on your left nut\nYou a soldier? Nigga I'm a vet, what\nI'm old school with a new style\nGirls hear me rap and act too wild\nBut that's how I like 'em, what you wanna do now?\nGet you all alone girl and turn you out\nYou want a man that do all he can\nHold your hand, and take you to the promise land\nBut I refuse to help you get there\n(Good luck) I hope you choose on the best player\n\n[Chorus]\nShittin' on 'em\nI'm shittin' on 'em...\nI'm shittin' on 'em beotch!\n\n[Too $hort]\nShe said I'm too old, get fucked it's too late\nShe said tell $hort it's a new day\nBitch I say fuck what you say\nI'm from the Old Bay and the New Bay\nWhen you make the wrong choice, who you gon' blame?\nI'm all in your ear tellin' you the wrong thing\nBut you listen anyway, buyin' the dream\nYou know about us pimps, we be lyin' and things\nI don't wanna fight for the bitch Joe\nIt's all about the game, and who can spit the most\nI'm never too faded to hustle\nBall up my fists, and make a muscle\nI stay strapped, I don't wanna tustle\nFake ass bodyguard nigga wanna wrestle\nCause you think she's likin' me?\nShe's goin' hella stupid on this hyphy beat?\nAnd now you wanna fight with me?\nMake me mad, and I'ma fuck your wife-to-be\nI'm from the Eastside where the Raiders play\nWhere you get your game from? I say the Bay\nYou think I'll square up? You can't be hopin'\nI'm hard on a bitch, I was trained in Oakland\nI never turned in my player card\nAsk anybody, they'll say I'm hard\nI'm shittin' on 'em\n\n[Chorus]\nI'm shittin' on 'em...\nI'm shittin' on 'em...\nI'm shittin' on 'em...\nI'm shittin' on 'em beotch!\n\n[Too $hort]\nYou so horny, tryin' to find you a bitch mayne\nI'm hustlin', I gotta stay rich mayne\nYou friendly, like to buy hoes gifts\nBut I'm mean, I hit 'em with the closed fist\nYou a sucka, take a bitch on a trip\nI kick back, and send a bitch to go get my stack\nAnd you'll never do that\nYou're weak for a bitch, you better move back\nWhy they always use you?\nCause you pay 'em, that's what they used to\nMan bitches everywhere\nTreat niggas like you like teddy bears\nYou'll get to feel on her and touch her\nYou always with her but you still ain't fucked her\nYou fell in love with the bitch last summer\nI fucked a few times then dumped her\nYou tricks, always tryin' to find you a better hoe\nI told you, never put the pussy on a pedestal\nThem nasty little cum freaks, F 'em\nIf they wasn't bout the money I left 'em\nBurn rubber, I'm drivin' fast\nThat's my new motto 'cause it's time to smash\nI flew past still givin' it gas\nMade a right turn, swingin' the ass\nI'm shittin' on 'em\n\n[Chorus]\nI'm shittin' on 'em...\nI'm shittin' on 'em...\nI'm shittin' on 'em...\nI'm shittin' on 'em beotch!", "image": "https://images.genius.com/bf235bef3026a6f3ce0ab508ff5f91d3.500x500x1.jpg"}], "artist": "Too $hort"}