{"songs": [{"title": "The Lessin", "album": "The Sneak Attack", "year": null, "lyrics": "Yeah.. uh-huh.. underground, never stop y'all\nUnderground, K.P. y'all c'mon!\n\n[Hook: April S. Williams]\nAin't no stoppin what we done\nDon't give up this fight is won\nThere's no way they can hold us down\nCause with power and strength we gonna take it now\nTake that stand realize the truth\nKnowledge intellect bringin minds anew\nThere's no way they can hold us down\nCause with power and strength we gonna save you now\n\n[KRS-One over Hook]\nUh-huh\nYeah, yeah, yeah\nUh-huh\nTell them again, tell them again!\nUhh\nGet 'em up now, word\nJust get it up now, uh-huh\nALL OF THE MASSIVE!\n\n[KRS-One]\nB, R, O, N, X\nSee these cars, see these checks, intellect\nSee these thugs, ain't no sweat, intellect\nA thousand miles, how do you do it? One step\nNow check out this flow, they wanna be down, but they cain't\nOriginal +Criminal Minded+ flow, they just ain't\nReady for the real, ready to peel off the paint\nYour style is fake, the teacher returns to debate\nYou the best? That's bull, you questionable\nHighly flexible, wasn't you sexual?\nNow you hardcore? You need to see God more\nI sit on the faculty; you, you sophomore\n\n[Hook]\n\n[KRS-One over Hook]\nUhh, get 'em up\nYeah, get 'em up uhh\nYeah, uhh, that's right\nThat's right uh-huh, tell 'em again\nIt go.. get 'em up\nYeah, that's right, uh-huh\nUh-huh\nAnother Kenny Parker exclusive!\n\n[KRS-One]\nTime to get it, now you did it, tryin to spit it\nYou don't fit it, ask the critics, already did it, skipped the gimmicks\nI don't mimic, metaphysics, you'll admit it, better to live it\nBetter to give it, so I spit it every minute so you get it\nMy lyric is wicked an' full of culture y'all\nHuh? Battle, nah - get back in your car\nEither you never heard of me or you really wanna get with me\nBut as your teacher let me test you for a learning disability\nYou feeling me? Cause you can't, get it through your head\nThis is, sui-CIDE!! You're better off dead\nLet me not amp you up, cause this style you can't do what\nMy stomach can take it and your stomach it'll cramp you up\nThis is, breath control, breath control stylee\nI get up all in that ass that (?) heinie\nTry me, back in the days you woulda had sorrow\nTry the teacher today, and you won't see tomorrow cause\n\n[Hook]\n\n[KRS-One over Hook]\nUhh, we get 'em up\nUhh, that's right, get 'em up\nYeah, uh-huh, get 'em up\nYeah, ONE MORE TIME NOW!\nUhh, that's right, get 'em up\nUh-huh, uh-huh, get 'em up I HEAR YOU\nUh-huh, I HEAR YOU, WORD UP!\nLOOK AT THIS!\n\n[KRS-One]\nLike a piss on the streets I exist\nNot the meat but the fish\nComplete the feat when I'm speakin the heat into this\nWitness Kris rippin this\nDon't trip on this, skip ahead if you're ready\nMy show medley is deadly\nI'm about a hundred million mic years away\nThese players I don't hate, but I'm not here to play\nI hit it all day, all night, all afternoon\nRock all mics from the days of sassoon\nWhere the hell was you? On the corner with rats\nWhen we was at the LQ, lockin it down and that was that\nDivine speaker, mind keeper, time teacher, time leader\nI'll be sittin in the club by the speaker\nWaitin for you rappers to choke up then I eat ya\nLike some prehistoric winged creature, AHHH!\nOn your neck, like the American eagle facin East and West\nI be the best, Blastmaster KRS cause\n\n[Hook]\n\n[KRS-One over Hook]\nWe get 'em up\nUhh, yo, we get 'em up\nLike, YEAH, I SEE IT OVER THERE\nI SEE IT OVER THERE, IT'S.. YEAH IT'S OVER HERE!\nUhh! Uhh, one more time we get it up\nYeah, yeah, we get it\nUhh, uhh, IT'S OVER HERE NOW!\nIT'S OVER HERE NOW! UHH!\n\n[April and KRS-One ad lib]\n\n[Hook]\n\n[KRS-One]\nAttention all true hip-hoppers\nLet us come together, for the unity of hip-hop culture\nEvery third week in May, is hip-hop appreciation week\nCelebrate with us\nThen, join us in November, for hip-hop history month\nBig up, to the Zulu Nation, PEACE!", "image": "https://images.genius.com/756508fbcbfc3c6ac80f412ee6f089bd.1000x1000x1.jpg"}], "artist": "KRS-One"}