{"songs": [{"title": "War With God", "album": "Release Therapy", "year": null, "lyrics": "[Intro: Ludacris & Sample]\nThe time has come for bad things to end\nThe time has come for life to begin\nYes!\nThe time has come for the war of the gods\nIt's that time\nI'mma take the subtle approach first\n'Cause I'm just gettin started\nLet's go!\nLook:\n\n[Verse 1: Ludacris]\nI'm the best and there's nothing that you can do about it (nope!)\nNever needed a publicity stunt, let's tell the truth about it (yeah!)\nEven in the core of the streets, you can't sway the youth about it (nah!)\nBut keep running yo mouth\nAnd I swear I'mma knock a tooth up out it (blaow!)\nI never claimed to be nuthin but who the fuck I am\nNever sold cocaine in my life, but I'm still the fuckin man (right!)\nUnderstand, nuthin you did makes you better nigga\nYou claim the streets, but the streets respect that cheddar, nigga\nLuda got twice as much yo life you can charge it to 'em (ching!)\nI fit four of your houses inside my daughters room (woo!)\nAnd still have room for young Karma to play\nGivin back to the children of tommorrow, for good karma today\nSo you can say whatcha wanna say, and you can talk that talk\nBut real niggas ain't doin no talkin cause we walk that walk\nAlbum for album, you can see I got a multimillion plan\nSo call yourself whatever you want except The Multimillion Man\nNigga!\n\n[Hook: Ludacris & Sample]\nLucifer, oh Lucifer\nWhatever you want except the multi-million man, nigga\nGod of evil, you're the god of hate\nCall yourself whatever you want except the million man, nigga\nLucifer, oh Lucifer\nCall yourself whatever you want except the million man, nigga\nThe darkness is waiting, fire and light\nHow many, man?\n\n[Verse 2: Ludacris]\nHow many times is you gon rap about busting your gun? (huh?)\nHow many times is you gon trap without busting your gun? (gon' bust it!)\nOnly shots you ever took were subliminal to the general\nDisrespecting those doing real time with real criminals (woo!)\nAnd I ain't never did a day in my life\nBut it should be illegal to walk a day in my life\nI paid the price and the cost to be the boss\nSo you can rest your mouth\nI'm universal, Luda never limits hisself to the south\nI give a damn about ya hootin and hollerin, it ain't botherin me!\nI hear you talkin but you ain't made it to three!\nYou know where I live, but you ain't made it to me!\nYou ain't made, nigga\nI'm havin a house party, kid, come get played, nigga\nYou got played, my record label never jerked me\nSo shoot me, stab me, but words will never hurt me\nI feed off your energy (woo!), my powers with God\nSo it's even better if you make ya diss record real hard\n\n[Hook: Ludacris over woman singing]\nLucifer, oh Lucifer\nMake the record real hard\nGod of evil, you're the god of hate\nMake the record real hard\nLucifer, oh Lucifer\nYa diss record real hard\nThe darkness is waiting, fire and light\n\n[Verse 3: Ludacris]\nSee, even without all that bass and treble, I'm as hot as the devil\nBut I work for the top floor, homie, get on my level\nI been stripped away ya powers 'cause I gave you my blessing\nSo it'll take more than majority vote to win this election\nMan, mixtapes are not my resume, it's too hot\nAnd I warned them I was coming, I got that number one spot\nSo unless you using tampons, quit acting stuck up\nAnd do like your records say, or shut the FUCK up\n\n[Hook: Ludacris]\nDo like your records say, or shut the fuck up\nDo like your records say, or shut the fuck up\nShut the fuck up\nCh-ch-ch-ch-shut the fuck up\n\n[Coda: Sample]\nLucifer, oh Lucifer\nGod of evil, you're the god of hate\nLucifer, oh Lucifer\nThe darkness is waiting, fire and light", "image": "https://images.genius.com/57825a3687491fdf0e3c4c58b1b7aee5.1000x1000x1.jpg"}], "artist": "Ludacris"}