{"songs": [{"title": "Freak To The Funk", "album": "Freak To The Funk / Ghost Rider 12", "year": "1995-01-01", "lyrics": "[Sen Dog]\nFreak to tha funk\nFreak to tha funk\nFreak to tha funk\nFreak to tha funk\n\n[B-Real]\nLet me see yo' hands up high\nYou and I, homie, don't see eye to eye\nWhy can't we all just hit a bong?\nOr you can bring it on, just bring it on\nIt's that alley cat, back in ya speaker\nGive it up for the number one funk freaker\nAs I kick the rhythm to the side of ya brain\nThrow the funk up, the Buddha blood flowin' in ya veins\nIt's that Cypress Hill-at your will-light 'em up-flavour\nSee if you can find the last action nigga on the fader\nRun ya jewels, run ya freak and ya mic tools\nAs I beat ya phuckin' ass out on the street\n(Yeahh!) I'ma give you what you want\nPoof! Sit back, it's a freak to tha funk\n\n[Hook]\n(I'm the freaker, the one that freaks the funk)[repeat]\nFreak to tha funk, freak to tha funk, freak to tha funk\nFreak to tha funk\nFreak to tha funk, freak to tha funk, freak to tha funk\nFreak-ehh\n\n[Verse 2: Sen Dog]\nI'm the individual with the bi- linguals\nAnd I - freak this funk till the end, then I finish all\nCause I got them homies waiting in the frente\nDown to take a ride and roll on some gente\nYou don't know me and you don't know my trigger\n(In '95 you can't fuck with a nigga!)\nOh my god, look at these fools tryna act hard\nIsn't it odd, that we pulled their card\nThirty-one flavours of funk, woe you\nAnd ya neighbor when I hit the skunk\nBow down to the mad dog, dirty dog\nRollin' in on the funk like I'm on a hog\n\n[Hook]\n(I'm the freaker, the one that freaks the funk)[repeat throughout]\nFreak to tha funk, freak to tha funk, freak to tha funk\nFreak to tha funk\nFreak to tha funk, freak to tha funk, freak to tha funk\nFreak to tha funk\nFreak to tha funk, freak to tha funk, freak to tha funk\nFreak to tha funk\n\n[Playing around with funk freaker/freak tha funk]\n\n[Verse 3: B-Real]\nYou're lookin' at the Buddha master\nWith the funk to plaster\nUp a punk ass nigga if I have to\nRollin' in the mind of the wicked\nSlick and slide don't drive when I kick it\nWhatcha wanna do, it's that way fool\nI mean how you gonna do that, when you got no tools?\nNo skills, no funk, no feels\nBut still you wanna run up on the hill?\nLet me give you what you deserve\nPhuck the nigga with nerves in my party with no herb\nEverybody want to hit the blunt, but nobody wanna share it\nTear it up - So I just keep on with my skunk\nNow everybody wanna just freak tha funk\n\n[Hook]\n\n[Sen Dog]\nFirst you find the funk, so you can freak the funk\nAnd remember, there is never no funk that is unfreakable\nYou must freak every funk and style of funk\nFunk, f-f-funk-a-funk-a-funk - you must freak it", "image": "https://images.genius.com/2615919eb0bcef9d55421080ab3b10b1.860x860x1.jpg"}], "artist": "Cypress Hill"}