{"songs": [{"title": "Make Em’ Say", "album": "Flamers 2.5: The Preview", "year": "2010-03-17", "lyrics": "[Intro]\nShowtime (flamers)\nIf you sippin' on somthin put it down right now\nGet Money\nWe bout to get it poppin, this song\n\n[Verse 1]\nI like my rosé red and my diamonds blue\nKeep a dime chick like 5 times 2\nI be killin these haters when I slide by through\nLike a drive by do in a sky dive coop\nFlyin, the whip sound like a lion\nKeep a white girl with white girl like ryan\nUh, Shit I ain't baggin, I'm buyin\nA lot of these suckas be frauds, lyin\nReally though, they fishin for a robbery\nI got them biddies tryna hit me like a lottery\nHaters wanna body me cause I'm a hot commodity\nPuffin on that hater ease the pain like a apology\nNiggas they can spit but they'll never be as fly as me\nWrist lookin like the same arena where the Flyers be- ICEY\nI know, I don't think they like me\nMaybe cause I might be dickin down they wifey\nUmm, It's easy to hate me it's harder to love me\nYou a hater\nAsk ya bitches bet ya all of them fucked me\nThey callin' me hubby but they be callin' for nothin'\nCause when I tell them hoes I like em I be kiddin like Cudi\n\n[Hook]\nThey be like...\nYup yup we make em say...\nYup yup we make em say...\nYup we got em like...\nLet's get it\nYou got a boyfriend?\nNo, we don't care\nNow where that money at?\nIt's over here\nWe ball hard\nBottles in the air\nChillin in the whip make them biddies stop and stare\n\n[Verse 2]\nBefore I met T.I.P. I was the king, Martin Luther\nDiamonds in the bezzle lookin husky, Rasputia\nDon't get it twisted I spit, but I'm a shooter\nGlock 17 clip hangin longer then a ruler\nEvery time I see them hoes they be like\nYou the best like Drizzy, but I tell them I'm cooler\nI ain't even hit, she gave me brain like a tutor\nI kick that chick out early in the morning like a rooster\nI'm a D.O.P.E.B.O.Y\nLookin like money everytime I flow by\nHaters hatin on me\nI don't know why\nCause I'm come from da bottom were da sun don't shine\nPops died young so I had to man up\nCases got caught so I had to stand up\nI'm the best around hands down hands up\nSmack a sucka right in front of his squad and what like...\n\n[Hook]\n\n[Verse 3]\nThem boys damn near forty\nThey ain't fuckin with shorty\nI shine like a buck worth of jewelry\nFor sure he the hottest in America\nAll guts glory\nBenzo 6 all on that back, Rob Horry\nLimbo, bend the corner all eyes on me\nLike I'm 2Pac niggas envy\nWanna shakur me\nHaters, why get mad?\nI get paper\nAll black Camaro lookin like Darth Vader\nDiamonds in ma chain like da water in Jamaica- all blue\nThem biddies like \"Who da F RU\"\nMy niggas we ball through\nSumthin we all do\nOn that day she pop me she prolli will call you\nMy niggas tryna turn a pound of raw to a molly\nIn the kitchen million dollar whippin like Bugatti\nMe, ma niggas got it\nHater like, how he do that?\nWho that? we that!\nProlly\n\n[Hook]", "image": "https://images.genius.com/d76ee1acc13d517c9a1ca16cf95a42ba.500x500x1.jpg"}], "artist": "Meek Mill"}