{"songs": [{"title": "Understand Me", "album": null, "year": null, "lyrics": "[Verse 1]\nThirteen, I was a thug, selling drugs\nMany people thought I flipped my wig, sorta bugged\nBut I shrugged 'em off, like who cares what they say?\nThey was getting jelly and I was getting paid\nWasn't afraid to chase dough\nWasn't afraid to catch a case so\nAs long as the papes flowed\nWarnings I took 'em like yeah yeah, if you say so\nLadies I book 'em with some cash and hey ho\nI rolled in cars Pops never seen\nI rolled with stars and ladies from the magazine\nGetting dirty down low dough making it clean\nAnd mind you I was only thirteen\nA rebel with a cause\nA street level hustler with cash coming out the pores\nBreaking laws, breaking jaws, and taking whores\nProbably taking yours, yours, yours, and maybe yours\nBut most important, taking care of the family\nStill, most people don't understand me\n\n[Chorus]\nMaybe if they tried to understand me, what should I do?\nI had to feed my fuckin' family, what else could I do?\nMaybe if they tried to understand me, what should I do?\nI had to feed my fuckin' family, what else could I do?\n\n[Verse 2]\nBy fifteen, many brothers had to run\nI had mad dough, mad friends, and mad guns\nNothing to lose\nMake it big or make the news\nTake your pick, I got shit under both shoes\nSo I'm clocking\nBecause opportunity don't come knocking\nOn the door in the projects, socking 'em\nNine to five, please\nI'm talking about five to nine G's in three hours easy\nI had to block in to smash\nTry to slow up my cash and better dash to Jake before I break your ass\n'Cause I'm not to be played out\nFolks that try to play Jay, well OK, you getting laid out\nI had no problem with smoking the rope\nCause there's no joking with dough\nNo warning shots so I'm hoping you know\nI had a supply so I was in demand G\nLadies loved I, niggas couldn't stand me\nBut they wouldn't bring the noise\n'Cause I got boys that got Buck Rogers like (?)\nSo brothers ought to give it a second thought 'fore you caught speeding\nExternal, internal, fuck him, he's bleeding\nAnd it's back to the norm\nMaking cold cash so fast and keeping ladies warm\nStill checking in on the family\nStill, most people don't understand me\n\n[Chorus]\nMaybe if they tried to understand me, what should I do?\nI had to feed my fuckin' family, what else could I do?\nMaybe if they tried to understand me, what should I do?\nI had to feed my fuckin' family, what else could I do?\n\n[Verse 3]\nJust dude is no just dude\nSo I just do what I just do to keep a buck or two\nWhat's my options?\nTell me before you say stop and I tell you about that weak shit you popping\nI'm from the projects, wasn't for me\nBy nineteen, I'd be in jail, smoking or buying the key\nWhich one would you choose out of the three?\nYeah I know, go for the 40 G's\nIt's no longer for the family they no longer need\nBut for the greed, getting props, and being top seed\nSis tells me to slow up, whoa\nI didn't hear a peep when I was keeping your belly full\nAnd you was happy when all your nappies had new kicks\nI didn't hear shit, so you quit\nI got large and forgot the family\nAnd now nobody understands me\n\n[Chorus]\nMaybe if they tried to understand me, what should I do?\nI had to feed my fuckin' family, what else could I do?\nMaybe if they tried to understand me, what should I do?\nI had to feed my fuckin' family, what else could I do?\nMaybe if they tried to understand me, what should I do?\nI had to feed my fuckin' family, what else could I do?\nMaybe if they tried to understand me, what should I do?\nI had to feed my fuckin' family, what else could I do?", "image": "https://images.genius.com/bf0f68ee56f29c8542ad805c6419682b.676x676x1.jpg"}], "artist": "JAY-Z"}