{"songs": [{"title": "Who Am I (What’s My Name)? (Remix)", "album": "Death Row Greatest Hits", "year": null, "lyrics": "(The bomb)\n(The bomb)\n(Dogg!)\n\n[Verse 1: Snoop Dogg]\nFrom the depths of the sea, back to the block\nSnoop Doggy Dogg, Funky, yes but of the Doc\nWent solo on that ass, but it's still the same\nLong Beach is the spot where I served my cane\nFollow me, follow me, follow me, follow me, but don't lose your grip\nNine-trizzay's the yizzear for me to fuck up shit\nSo I ain't holdin nuttin back\nAnd motherfucker I got five on the twenty sack\nIt's like that and as a matter of fact (RAT-TAT-TAT-TAT)\nCos I never hesitate to put a nigga on his back\n(Yeah check out the whole manuscript\nIt's Dogg Pound and Snoop Dogg rockin gangsta shh...)\nWhat's my motherfuckin name?\n\n[Hook: Dat Nigga Daz]\nSnoop Dogg-y Dogg\nSnoop Dogg-y Dogg (yeah yeah yeah)\nSnoop Dogg-y Dogg\nSnoop Dogg-y Dogg (The bomb)\nSnoop Dogg-y Dogg\nSnoop Dogg-y Dogg\nSnoop Dogg-y Dogg\nSnoop Dogg-y Dogg (Dogg!)\n\n[Verse 2: Snoop Dogg]\nIt's the bow to the wow, creepin and crawlin\nYiggy yes y'allin, Snoop Doggy Dogg in\nThe motherfuckin house like everyday\nDroppin shit with my nigga Mr Dr. Dre\nLike I said, niggas can't FUCK with this (What?)\nAnd niggas can't FUCK with that\nShit that I drop cos ya know it don't stop\nMr. One Eight Seven on a motherfuckin cop\nTic toc never the Glock just some nuts and a cock\nRobbin motherfuckers then I kill dem blood clots\nThen I step thru the fog and I creep thru the smog\nCos I'm Snoop Doggy (who?) Doggy (what?) Doggy (DOGG!)\n\n[Hook: Dat Nigga Daz]\n\n[Verse 3: Snoop Dogg]\nNow just throw your hands in the motherfuckin air (HO!)\nAnd wave the motherfuckers like ya just don't care (HO! Dogg!)\nYeah roll up the dank, and pour the drank\nAnd watch your step (why?) cos Doggy's on the gank (check it out!)\nMy bank roll's on swoll\nMy shit's on hit, legit, now I'm on parole, stroll\nWith the Dogg Pound right behind me\nAnd up in yo bitch, is where ya might find me\nLayin that, playin that G thang (ba-by)\nShe want the nigga with the bigger nuts, and guess what? (Snoop)\nHe is I, and I am him, slim with the tilted brim\nWhat's my motherfuckin name?\n\n[Hook: Dat Nigga Daz]\n\n[Outro: Dat Nigga Daz]\nYeah yeah\nAs we reappear for a new year\nShowin ya how it's done\nDeath Row, Dogg Pound and we doin it live\nCheck it out.....\n(Dogg, the bomb)\n(bowwowowyippyyoyippyya, bowwowwowyippyyo, the bomb)\n(bowwowowyippyyoyippyya, bowwowwowyippyyo, the bomb)\n(Dogg!)\n(Dogg, the bomb)\n(The bomb)\n(Dogg!)\n(The bomb)\n(Dogg, the bomb!)", "image": "https://images.genius.com/9b791e9e8865e577e788752e38145914.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}