{"songs": [{"title": "Nutmeg", "album": "Supreme Clientele", "year": "2000-02-08", "lyrics": "[Intro: Ghostface Killah]\nYeah, whassup, y'all, whassup?\nThis is Ghostface, straight from Staten Island\nYou know I don't really mean no harm\nBut it just happens you know\nWhen I step approach a motherfuckin' wack nigga\nThat tryin' to spit his darts and can't spit 'em\nCheck it out though, ayo\n\n[Verse 1: Ghostface Killah]\nScientific, my hand kissed it\nRobotic, let's think optimistic\nYou probably missed it, watch me Dolly Dick it\nScotty Wotty copped it to me, big microphone hippie\nHit Poughkeepsie, crispy chicken, verbs, throw up a stone, Richie\nChop the O, sprinkle a little snow inside a Optimo\nSwing the John McEnroe, rap rock'n'roll\nTy-D-Bol, gung-ho pro, Starsky with the gumsole\nHit the rum slow, parole kids, live Rapunzel\nBut Ton' Stizzy really high, the vivid laser eye guy\nJump in the Harley ride, Clarks, I freak a lemon pie\nI'm bout it, bout it, Lord forgive me, Ms. Sally shouted\nTracey got shot in the face, my house was overcrowded\nYou fake cats done heard it first\nOn how I shitted on your turf that time, Cuban Link verse yo\nCheck out the rap kingpin, summertime, fine jewelry dripping\nFace to the box, I seen your ear twitching\nAs soon as I drove off, Cap' came to me with three sawed-offs\nGive one to Rae', let's season they broth\nLightning rod fever heaters, knock-kneed a Sheeba for hiva\nDiva got rocked from the receiver bleeder\nPortfolio, looking fancy in the pantry\nMy man got bigger dimes son, your shit is scampi\nBase that, throw what's in your mouth, don't waste that\nSee Ghost lamping in the throne with King Tut hat\nStraight off\n\n[Interlude: Ghostface Killah]\nYeah... yeah\nI just want y'all niggas\nSmack all y'all niggas, and niggarettes\nUniversal death threats, yeah\nThis be the God Body\nYeah no doubt, Judge Wise\n\n[Verse 2: Ghostface Killah]\nAyo, spiced out Calvin Coolers, lounging with 7 duelers\nThe Great Adventures of Slick, licking with 6 Rugers\nRock those, big boy Bulotti's out of Woodbridge\nPorch for the biggest beer, seasoned giraffe ribs\nRotissiere ropes, hickory cinnamon scented glaze\nPerfected find truth within self, let's smoke\nAll hail to my hands, 50 thou' appraisal\nDirty nose with the nasal drip, clique flipped on fam\nDancing with Blanche and them bitches, flicking deuce pictures\nKick down the ace of spades, snatch Jack riches\nOlsive compulsive lies flyers with my name on it\nDick made the cover now count, how many veins on it\nScooby snack jurassic plastic gas booby trap\nTen years working for me, you wanna tab shit?\nBong bong bong! Your bell went rung rung rung!\nStaple-Land's where the ambulance don't come\n\n[Interlude: Ghostface Killah]\nYeah, you see what I mean?\nYou see what I mean, you motherfucking crybabies?\nGet in line, punk!\nYou should be studying your arts instead of studying me!\nThat's how you lost your first job, punk!\nNow get in line, before you get your lil' thick ass tossed up!\nShit! I studied under Bruce Lee, nigga\nHe was on the fourth, I was on the third\n\n[Verse 3: RZA]\nPass me a honey-dipped spliff\nBlack mental cause continental drift\nOne whiff of Power-U gets my Divine stiff\nBrick rock, late night, hear the tick tock of my clock\nI used to run up and pick, a crab lock\nHit his stash, dip back, to the Lab, make him flip\nUptown, BOO-DOOP, now we back on your ave\nIncognito, fatal aikido blow, pop a needle\nDick a knock-knee ho, bust out her fetal\nNine inch long strong, Bobby pop the bitch thongs\nSpit on her, then I bang on my chest like Kong King\nMerciless Ming, point the killer bee sting\nRing dings, right through your head bing\nSnap the wing off of bats, my battle-axe tongue hacks tracks\nOnce the ball drop, I'mma snatch ten jacks\nPass the crack to a niggarette, puff a loose leaf cigarette\nWhile your man search the internet for Bob Digitech\nIn Stereo, crazy as Shapiro\nMultiply myself ten times standing next to zero\nAnd snap my fingers like the Fonz\nAnd bag me a golden bronze skinned girl with the honey blonde\nDip hair, make a nigga flip in his chair\nHad the armpit shaved off perfect with the Nair\nStomach flat as a pancake for her man's sake\nUsed to fuck her when she menstruate\nBut it made her hyperventilate\n\n[Outro: Ghostface Killah]\nBrooklyn! I know, I know, I know, I know\nQueens! I know, I know, I know, I know\nShaolin! I know, I know, I know, I know\nI know, I know, I know, I know, I know\nBronx! I know, I know, I know, I know\nJersey! I know, I know, I know\nLong Island! I know, I know, I know, I know\nI know, I know, I know, break it down!", "image": "https://images.genius.com/f0013dbd91dff7fd77352a0283ad6ec5.1000x1000x1.jpg"}], "artist": "Ghostface Killah"}