{"songs": [{"title": "Kookies", "album": "MM.. FOOD?", "year": "2004-11-16", "lyrics": "[Verse 1]\nIt's horrible, one little evening alone, home\nEnd up with carpal tunnel syndrome\nAnd here I am, known for giving heavy back aches\nGrown and living off of Little Debbie snack cakes\nSupposed to be checking emails\nAll I got is messages from ass naked females\nI don't know a Jenny\nShe said it's free and I won't owe her a penny\nAnd that's the last time I saw her\nBut thousands of more horrors on online Gomorrah\nAnd Sodom, they got 'em with they curls out\nAnd they got a better sales pitch than the Girl Scouts\nI wonder what I owe her\nFor a whole box of caramel coconut samoa\n(\"Nite nite!\"), Uh, ok honey, sweet dreams\nNow it's time to get serious like Peek Freans\nA metal handful, wipe it on the quilt\nWife wake up and I'm kill't over spilt milk\nLocked in, looking at your picture\nFully clothed winter and I right there with ya\nThinking about the last time I split your wishbone\nA man could only wish you do the same 'til he get home\nFat chance, at least he get snacks\nThat'd have to do 'til a brother get back\nUntil then smack One-Eyed Jack\nAnd hope one of his peoples can hook him with a tri-pack\nThat's three different flavors\nChocolate, vanilla and strawberry wafers\nActing all hard, 'bout to get beat up\nI'll show him what time it is once I get this sheet up\nSoon as he fell off the beat down\nAll I hear is, \"13th cell, put the sheet down\"\nDamn C.O.,, what the hell do she know?\nBesides the fact she wanna get dug out on the d-low\nA workaholic with a fountain in the ink pen\nOut in the mountains and I stopped drinking again\nIn the wee hours, he's gotten farther\nNeeding three showers, being hot and bothered\nThe wiz with her legs bent, pregnant\nGod bless the day she wondered where her egg went\nI need a L, it's hard to drink without it\nAnd could use some kookies but trying not to think about it\nWatching \"BET\" on jazz for knowledge on file\nEvery other commercial, college hoes gone wild\nSoft batch, I prefer the other bunch\nLike we got for lunch, chocolate fudge butter crunch\n\n[Instrumental Break]\n\n[Verse 2]\nHe don't mess with the Ritz Bits\nWheat Thins, Saltines or Triscuits\nMatzos or Cheez-Its\nCatch sugar fits every time that he sees\nChips Ahoy, double chocolate chunk\nSomething with the bubble and the junk in the trunk\nEven the Oreos, no matter what weather\nAlways kept 'em dipped in milk and stuck together\nIn the game he's shameless\nEven uses a code name: Famous Amos\nIt's cheaper than a short stay at the Day's Inn\nAnd good like 25 cent oatmeal raisin\nGive a hand to who invented the camera\nSkip past the gram animal in Grandma’s\nShh, make sure she don't wake from her dream chill\nOr get caught with a handful of cream fill\n\n\"Oh, honey! What are you doing? That's so nasty!\"\nIt might seem ill\n\"Ew! Go wash your hands!\"\nKookies\n\n[Outro: Samples]\n\"DOOM is master of the world.\"\n\"I'd sure hate to see that ugly mug in my history book.\"\n\"You've disturbed me for the last time.\"\n(Voice 1): Hey, y'know something gang, that DOOM ain't all bad\n(Voice 2): What do you mean, Ben?\n(Voice 1): Well I gotta admit that I've been having a real good time. Y'know, I mean, between you and me I kinda like being black\n(Voice 3): Well, maybe if we're lucky he'll attack one more time and send you back then, Benjamin\n(Voice 1): Ah-haha very funny, very very funny\n(Voice 2): He must be mad\n(Voice 4): Well, if anyone can do it. Nevertheless let's get out of here, while we can\n(Misc. Voice): Food, we need food", "image": "https://images.genius.com/f67af5eb94d7101171adfff4ca96a76c.1000x1000x1.jpg"}], "artist": "MF DOOM"}