{"songs": [{"title": "Shit Talk", "album": "DROWN IN DESIGNER", "year": "2016-05-19", "lyrics": "[Intro: Ryan Santan & Ski Mask The Slump God]\nHi, my name's Ryan (Pew)\nYou might wanna turn this the fuck up (Pew)\nSlap this shit on your motherfuckin' 808s (Or them titties, bitch)\nOr them titties (*laugh*)\nMotherfuckin' flexin' on these bitch-ass niggas (Yuh)\nWho, hey, who, hey, who (Ayy)\nOops, what I spilled? (*laugh*)\nBitch, wet, wet, wet, wet\n\n[Verse 1: Ski Mask The Slump God & Pollàri]\nFeel like Mr. T, a nigga 'bout to T up, umm\nBitch can't fuck up my re-up, umm\nOut in the Cabana with my feet up, umm\nWrist on Carter, FIBA, no diva, ayy\nMove that work, Magneto, ayy\nMy plug look like Carlito, ayy\nBest in the booth on the East Coast, huh\nGot my chest feelin' like CeeLo Green\nLean, mean, making-money machine\nOff the coke keys, I be sleep off the lean\nDonkey Kong the pussy, hit it like Bling\nAt the gates of hell, I still got on 'Preme\nOops, what I spilled? Sauce, ayy\nWhat I want? Porsche, ayy\nRunnin' man, uh, gone, ayy\nThrowin' money, Randy Moss, umm\nI'm smokin' on cannabis, feelin' like Hannibal\nHandle your fade and I damage it, umm\nPuncture my enemies, I'm the best candidate\nDrip for the cash and I ran with it, umm\nPalace on my body, I'm the man, umm\nTatt on my body, Juwanna Mann, umm\nFuck with that drama spray, llama man, umm (Llàri)\nTotal, the drama, no island-man, hey (Llàri, llàri, *laugh*)\n\n[Verse 2: Pollàri]\nI fucked that ho on the beach, yuh\nSlump moves that shit by the Ki, yuh (*cackle*)\nAll of these hoes, they on me, yuh (*cackle*)\n93 Octane, my seat, yuh (Llàri, llàri)\nI got some gold on my teeth, yuh (My teeth, yuh)\nI got some gold on my rings, yuh (My rings, llàri)\nI got your ho in my sheets, yuh (Yeah)\nFuck that lil' bitch for a week, yuh (Yeah)\nAll of these bitches, they need me, yuh (*cackle*)\nI move that water like Fiji, yuh (*cackle*)\nAll of these niggas, they hatin' like Bynum (Yeah)\nI can't see none of 'em, Stevie, yuh (Llàri, llàri)\nB-B be suckin' my pee, pee, yuh (My teeth)\nForeign ho lookin' like RiRi, yuh (Like Ri)\nI think that boy wanna be me, yuh (*cackle*)\nI drop the top, so you see me, yuh", "image": "https://images.genius.com/22af696134282b7a38fa6477e78ec3f2.640x640x1.jpg"}], "artist": "Ski Mask the Slump God"}