{"songs": [{"title": "IBETiGOTSUMWEED", "album": "Setbacks", "year": "2011-01-11", "lyrics": "[Verse 1]\nEvery time that I wake up I swear I'm never down\nEven when I'm in my dreams I'm high off self-esteem\nBlowing on that Jamaica my niggas not a team\nMarijuana fiend\nKeep your black & mild's and cigs cause me no nicotine\nI keep my pimpin' mean\nMe and Moosa as we pulled up on them sixes\nJust to go and bust some bitches\nSee the motherfuckin' wheels, sex appeal\nAnd if I'm in the backseat with them tints\nThat Glock concealed\nThey eye us as we peel\nLike the orange hat that I be stylin' in\nLike a xanny or a klonopin\nAll your swishas they be model thin\nWe plus sized nigga\nLike Tocarra and them\nShining like a halogen\nSoul bright like high beams, headlights at midnight\nLike one of Rhode Island's watch tower sights (Yeah)\nThe world is all I need\nBut if you don't know anything just know I got some weed\n\n[Hook]\nBet I got some weed\nBet I got some weed\nYou don't know anything\nKnow I got some weed\nBet I got some weed\nBet I got some weed\nAin't got no money man\nBut bet I got some weed\nHey, who got some weed\nWho, who got some weed\nWho, who got some weed\nUh, who got some weed\nUh, who got some weed\nUh, who got some weed\nUh, who got some weed\n\n[Verse 2]\nLet's go chill up on my balcony and feel the breeze\nOpen up a Corona and see who got some weed\nIf we don't have no trees then let's gather up the fees\nHundred dollars, that's a seventh of the sour dies'\nMake a order, it'll be here a quarter to three\nSmoke it til we on E\nThen we fill up again with another ten\nThen we just go run back to the chiefs for filler\nFamily needs, no worries\nSmoke one for our G's that ran with a strike of three's\nWe dying up in every plea\nSo for y'all my niggas, swear to God my heart'll bleed\nKick this shit for my lifers and ones who get ?\nEven if it's just five dollars just keep your brain on free\nElevate your mind, cause in due time you'll wine and dine\nSomethin' fine, and that kush blunt soon be your valentine\nAnd my shit be Columbine\nMy friends is all I need\nBut if you don't know anything just know I got some weed\n\n[Hook]\nBet I got some weed\nBet I got some weed\nYou don't know anything\nKnow I got some weed\nBet I got some weed\nBet I got some weed\nAin't got no money man\nBut bet I got some weed\nHey, who got some weed\nWho her? She got some weed\nWho him? He got some weed\nMy Aunt, She got some weed\nMy Unc, He got some weed\nMy Moms, she got some weed\nMy home, got some weed\nMy homie...\n\n[Outro]\nTo my nigga Tiny Deuce (He got some weed)\nWhat up ru\nTo my nigga Big Spank (He got some weed)\nWhat up ru\nMy lil homie Baby Spank (He got some weed)\nWord, Word\nMy brother from another Floyd (He got some weed)\nWord, Word\nTo my day one nigga Traffic (He got some weed)\nWhere that cake?\nTo my day one Tina Weena (She got some weed)\nWhere that cake?\nFree my nigga Flossy B (He need some weed)\nWhere that cake?\n50 washbread (He got some weed)\nI said where that cake\nTo my nigga Ab-Soul (He got some weed)\nMatch a nugget\nMy Piru nigga Manic (He got some weed)\nSoo woo\nTo my lil nigga Falon (She got some weed)\nYou tiny cuz\nRIF LA Jeff (He got some weed)\nWhat up Loc\nTo my white nigga Mac (He got some weed)\nI say, I say what up Loc\nRyan Legend on the map (He got some weed)\nI-I say what up Loc\nTo my nigga Asian J (He got some weed)\nI-I say what up Loc\nBrazy cuz CJ (He got some weed)\nI-I say what up Loc\nYeah\n\nMake sure you hit me up nigga\nShout out to my nigga June Deadline\nOh Boy you ol' jerrycurl Earthworm Jim lookin'-ass\nDa da da da-da\nBitch!\nOne more adlib on my\nWhere I'm name dropping and shit but honest Loc, Meh", "image": "https://images.genius.com/4e5d39814aadb84f19c68cb7ca188a5d.950x946x1.jpg"}], "artist": "ScHoolboy Q"}