{"songs": [{"title": "KC Tea", "album": "The Gates Mixed Plate", "year": "2010-07-27", "lyrics": "[Intro: Little Kid]\nWhat y'all drinkin' on?\n\n[Bridge: Tech N9ne]\nWhat you want? What you need?\nWhat you havin? What will it be?\nAll we need is Hennessy\nThen a Sprite, squeeze a twist of lemon\nThis one is the business\n\n[Verse: 1 Tech N9ne]\nI don't make this drink by the gallon\nI make it by the cup, then I'm stylin'\nGot KMK, Slaughterhouse and Brother Allen\nOn KC Teas we all over the world wild'n\n\n[Hook: Krizz Kaliko]\nHennessy, twist of the lemon with the\nHennessy, Sprite go right with the\nHennessy, make your night go right with the\nKC Tea (KC Tea)\n\n[Verse 2: Tech N9ne]\nI like to drink it in a real big wine glass\nAt my place with full of women lettin' time pass\nWith Hennesey, Sprite and lemon baby I mash\nDrunk as a skunk but the second one im on your fine ass\nThe first variation from the homie Vito\nWe grink the Hennesey and lemon where ever we go\nThen add the Sprite from seven was me yo\nThen me a Kali named it in a Las Vegas casino\nLemon or lime it don't matter if you slum (Man that sound real good)\nTaste good too punk\nA double shot into your cup will get you crunk\nToo much more and when you wake up and you thump like\nBam bam aww dwamn\nThis is how you feel the next day because you slamed the KC Tea\nGotta take easy like E\nThis is Tecca Nina's Kansas City spiked tea\n\n[Bridge: Tech N9ne]\nWhat you want? What you need?\nWhat you havin? What will it be?\nAll we need is Hennessy\nThen a Sprite, squeeze a twist of lemon\nThis one is the business\n\n[Hook: Krizz Kaliko]\nHennessy, twist of the lemon with the\nHennessy, Sprite go right with the\nHennessy, make your night go right with the\nKC Tea (KC Tea)\n\n[Verse 3: Tech N9ne]\nFill the cup full of ice first\nCause the Hennesey will melt a little ice and it might urk\nMe when I'm all up on a little tight skirt\nI need a fully loaded Kansas City tea to quenchin my thirst\nIf you ain't got no real lemon\nJust let a little lemon or lime juice spill in 'um\nI know alot of caucasian people don't really do the Hennesey\nBut the way I make it I will in 'um\nCovert alot of people every year and\nOn Saint Patty's Day I shared it with very weird fans\nThey started fightin' and my leg was near 'em\nI told em \"Take it easy, there's a beverage here, man!\"\nKc Tea is 100 mane\nCheck it if it's flat Sprite then I don't want it mane\nMy money mane is on Hennesey in the image on cream corn\nI'm runnin' thangs (I'm runnin' thangs)\n\n[Bridge: Tech N9ne]\nWhat you want? What you need?\nWhat you havin? What will it be?\nAll we need is Hennessy\nThen a Sprite, squeeze a twist of lemon\nThis one is the business\n\n[Hook: Krizz Kaliko]\nHennessy, twist of the lemon with the\nHennessy, Sprite go right with the\nHennessy, make your night go right with the\nKC Tea (KC Tea)\n\n[Verse 4: Tech N9ne]\nA lot a men never sinned on the Hen\nWhere ya been boy boy where ya been?\nIt'll have ya wit her again and again\nEven strong enough to do her lesbian friend\nIf you can't handle her then hand her to me\nCause I'm at five of em and I'm bout to hammer the V\nEven got it set up for the camera to see\nI'm wit her but I'm really picturing Angela Yee\nShe ain't wearin nothing but Blahniks on her feet\nKC Tea got me really supersonic in the sheets\nHittin harder than sticky icky chronic on the streets\nSo nice to wake up in the bathroom ain't no vomit on the seat\nBartender made it right and I'm sure because it tastes sweet like candy\nYeah, and Ludacris you can make it with Conjure\nAnd 40 you can make it with Landy but authentic is the\n\n[Tech N9ne talking over the hook]\nHENNESSEY (It's about 38 a Fifth)\nHENNESSEY (In Canada is like 68)\nHENNESSEY (But Wal-Mart got it for 20 BOY Yeah! let's go!)\nKC TEAA (KC TEA!)\n\n[Hook: Krizz Kaliko]\nHennessy, twist of the lemon with the\nHennessy, Sprite go right with the\nHennessy, make your night go right with the\nKC Tea (KC Tea)", "image": "https://images.genius.com/7efd1fa33fbd953a08bc1d44fae9f6a7.600x600x1.jpg"}], "artist": "Tech N9ne"}