{"songs": [{"title": "Let Bygones Be Bygones", "album": "I Wanna Thank Me", "year": "2019-08-07", "lyrics": "[Intro: Snoop Dogg & Arian Foster]\nWell, um‚ I mean‚ you still got a good relationship with him today?\nMe and Suge cool as a motherfucker\nI'm cool with Suge‚ I'm cool with Master P, Dr. Dre, I'm cool with everybody\nYeah‚ I mean, how could you not be cool with Snoop?\nBut I had to go get that cool with him\nI had to go sit down with Suge\n\n[Verse: Snoop Dogg]\nOn Crip, that was my nigga\n18 years old‚ lost and locin'\nCrack money had a nigga open\nHopin' that that rap shit wasn't just cap shit\nG'd up, no Dre, okay that's cool\nBut that's old news to niggas like us\n'Cause if so, he would've signed us off top\nBut bro stayed solid so I'ma stay solid to that\nStudio every night to the early morn'\nBloods and Crips all moving on one accord, cuz did that\nTook Death Row to the top, my buz did that\nCaught that case, came out safe, Bloods did that (Suwoop)\nSo through the ups and the downs\nReal ones know not to kick niggas when they down\nEspecially when we was down, that nigga picked niggas up\nGangbang on NY stages, hit niggas up (Death Row)\nY'all remember that? (Yup)\nYeah, he did some bullshit, I'm admitting that\nBut coming at a real Crip like he ain't one\nEspecially when he helped fucking make one\nOn the dead homies, I was at the motherfucking top\nWhen I hit my nigga up and said, \"You need to grab 'Pac\"\nTold Daz, \"Hook him up,\" brought straight up out the box\nHere's the gang, here's the beats, here's the keys, here's the locks\nThen he hit them niggas (Yes, sir), it was us, cuz\nLook around, it still is just us, cuz (Yeah)\nDre rich, Nate gone, and Ricky too\nAnd look at me, shit, I'm 'bout to turn 50 soon\nYou always said I'd be a star in the game\nNow I got a star on the fucking Walk of Fame (Yes, sir)\nI hopped out and C-walked on my star on the fuckin' Walk of Fame\nIn that motherfucking Death Row chain, nigga\n\n[Outro: Snoop Dogg]\nI know you seen that\nA lot of motherfuckers don't know\nShit, nigga, we been cool\nThis man changed my life\nShit, nigga, we made history together\nI'm talking about real history, nigga, like\nWhen they write the history books they gonna look at this shit like\nThe Great Depression\nYou know, the stock exchange\nThis shit is historic, man\nDeath Row Records, man, we did that shit, nigga\nSuge Knight, real nigga, man\nThink about all the great shit you did, nigga\nLet bygones be bygones\nYeah, what up, Dre?\nDaz, Kurupt, what up though?\nLady of Rage, RBX, D.O.C\nNate Dogg, rest in peace\nRicky Harris, rest in peace\nDJ Warren G, Dr. Dre\nCity of Compton, City of Long Beach\nDeath Row Records will go down in history, nigga\nWe did that, yeah, nigga, we did that\nDone", "image": "https://images.genius.com/2754e1fb92854bab2dec8dbc3a77e4d4.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}