{"songs": [{"title": "Next Out the Kennel", "album": "The Great Depression", "year": "2001-10-23", "lyrics": "[DJ Kay Slay]\nAiyyo, this is DJ Kay Slay from around the way\nAnd my dog DMX is puttin it down with the Bloodline family\nAnd the Bloodline kennels\nTHE GREAT DEPRESSION! FOURTH TIME!\nX keeps it gutta and his dogs are no different\nYou gotta respect the line...\nFirst out the kennel, Jynx reppin straight from Y.O. kennel\nHoldin it down...\n\n[Jynx]\nLet it be known, bring it to me\nBreak the fingers that you write with\nMouth that you recite with, real life shit\nNiggas call me God on beats, cuz I light shit\nQuicker than those, shootin big holes, rippin your clothes\nPlay games and have a thug nigga sittin at your home\nSee you walkin with that bitch when he spit at yo dome\nDamn, ya brains all over the place!\nBitch cryin and screamin, cuz ya brain's all over her face!\nI got love for street thugs and killers, with deep mugs\nWho bust they guns first then they start to cuss\nShook niggas hold they guns till they start to rust\nBitch niggas don't want no parts of us, we dangerous\nTripped a few times off of angel dust\nOne shot turn yo brains to slush\nYeah, niggas don't learn shit till the lights is off...\nIt's too late! Now your life is lost, motherfucker!\n\n[Beat changes to \"Bring Ya Whole Crew\"]\n\n[DJ Kay Slay]\nDAMN! See what I'm sayin, this shit is real\nNext out the kennel, barkin from Dirty Jerz is that nigga Loose\n\n[Loose]\nLet me Loose, nigga! Get the fuck off me!\nI can't believe my ears! Huh? These niggas is barely on!\nIn fact they wack, they just got a hot song!\nFuckin up the game is catz like you\nThat make wack niggas think they can rap too!\nBut Loose at the door now, so come with me\nI'mma make sure no more rappers like you get in!\nYou want it? We can go hard with the beats\nOr hard to the body or hard to the teeth\nYeah, I was on Universal, they couldn't have me\nThey kept me on the hush, like Whitney drug habit!\nGot drafted, then made it to the front line\nA year later, got traded to Bloodline\nNow it's hard for catz to keep they spot\nHe rock too much ice, he can't keep it hot\nAnd when all the ice melt, they all watered down\nLoose, fuck that, the streets is mines now!\n\n[Beat changes to \"D-X-L Hard White\"]\n\n[DJ Kay Slay]\nFIRE! Only stray kills, yaknowhatimsayin?\nNext out the kennel, my nigga Big Stan from Harlem\nGet at em dog...\n\n[Big Stan]\nUh-oh, who's next? That would be me, BS, ya know?\nUh, y'all niggas ain't ready, uh\nI'm like a thieve in the night, I creep in your life\nOne day when you nice, high off the henny\nCatch you while you partyin right\nWith the semi, put your body on ice, for a price\nMake a bastard of your son as well as widow your wife\nMy struggle was tight, love inside my heart has limits\nLike anything outside of Bloodline, bound to get it\nWe bound to win it, niggas want, we bound to give it\nAnd anything you catz start, you know we bound to finish\nCan you see the cage is open? Muzzle is off\nThe nine is sick, the silencer will muffle the cough\nThe Line is thick, Stan stay solo on cost\nMy shoulder will frost on any nigga other than dog\nI'm the one ya moms would hate you to cross\nIf you the only child, would be replacing the lost\nPlease think before you go against the B dot S\nAnd no it's not a game, I'm one of Bloodline's best, nigga...\n\n[Beat changes to \"Make a Move\"]\n\n[DJ Kay Slay]\nWhoa, whoa, whoa, they just keep bitin\nThe last to bite, that bitch, the bitch of the litter\nCrazy Kash, Kashmir, get at em girl...\n\n[Kashmir]\nWhat the fuck ya niggas know about grease?\nI got enough to put in ya piece, plus bust ten in ya fleece\nMake ya back bend in a crease, that's what you get offend a beast\nYou hatin me like I was a friend of Kelis\nLoad, cock back and release\nBad bitch crackin ya piece, bullet holes in the back of your peeps\nAlways catch niggas comin from the back with the heat\nLove to watch they knees buckle when they smack the concrete\nYou ain't gotta love me, just respect the bitch!\nScared to fight me, get your girls, so I can wet the bitch!\nWho gives a FUCK who ya old lady be?\nI put holes in ya old lady tee if she fuckin with me!\nYou know my niggas Stan, Jynx, Loose, Berg and X\nYa niggas switchin occupations, cuz they heard we next\nNo niggas above mine, cuz no niggas above mine\nAnd that shit's in my heart, cuz it's in my fuckin Bloodline...", "image": "https://images.genius.com/afd6872a63df0f464c2e3cf8eb96a627.500x500x1.jpg"}], "artist": "DMX"}