{"songs": [{"title": "Against All Odds", "album": "The Don Killuminati: The 7 Day Theory", "year": "1996-09-26", "lyrics": "[Intro]\nTo my niggas that went out in line on duty\n21-gun salute! One love, one thug, one nation\n(Let’s get down, let’s do this!)\n21-gun salute! (Come on, yeah, let’s do this!)\n21-gun salute!  (Come on, come on, let’s do this!)\nAll the time I be…\n\n[Hook]\nHopin' my true motherfuckers know\nThis be the realest shit I ever wrote\nAgainst all odds, up in the studio gettin' blowed\nTo the truest shit I ever spoke\n\n[Verse 1]\n21-gun salute, dressed in fatigues, black jeans and boots\nI just appeared in the crowd, all you seen was troops\nThis little nigga named Nas think he live like me\nTalking 'bout he left the hospital, took five like me\nYou live in fantasies, nigga, I reject your deposit\nWe shook Dre punk ass, now he out of the closet\nMobb Deep wonder why a nigga blowed 'em out\nNext time grown folks talking, nigga close your mouth!\nPeep me, I take this war shit deeply\nDone seen too many real players fall\nTo let these bitch niggas beat me\nPuffy, let's be honest: you a punk or you will see me with gloves?\nRemember that shit you said to Vibe about me bein' a thug?\nAnd you can tell the people you roll with whatever you want\nBut you and I know what's goin' on\nPayback, I knew you bitch niggas from way back\nWitness me strapped with MAC's, knew I wouldn't play that\nAll you old rappers tryin' to advance\nIt's all over now, take it like a man\nNiggas lookin' like Larry Holmes (look at De La Soul!)\nFlabby and sick\nTryin' to player hate on my shit, you eat a fat dick\nLet it be known, this is how you made me\nLovin' how I got you niggas crazy\n\n[Hook]\nAgainst all odds, hopin' my thug motherfuckers know\nThis be the realest shit I ever wrote\nAgainst all odds, up in the studio, gettin' blowed\nTo the truest shit I ever spoke\nAgainst all odds, hopin' my true motherfuckers know\nThis be the realest shit I ever wrote\n\n[Verse 2]\nI heard he was light-skinned, stocky, with a Haitian accent\nJewelry, fast cars and he's known for flashin'\nListen while I take you back and lace this rap\nA real live tale about a snitch named Haitian Jack\nKnew he was workin' for the feds\nSame crime, different trials, nigga, picture what he said\nAnd did I mention?\nPromised to payback, Jimmy Henchman, in due time\nI know you bitch niggas is listenin', the world is mine\nSet me up, wet me up, niggas stuck me up\nHeard the guns bust, but you tricks never shut me up\nTouch one of mine, on everything I love\nI'll destroy everything you touch\nPlay the game, nigga; all out warfare, eye for eye\nLast words to a bitch nigga: \"Why you lie?\"\nNow you gotta watch your back, now watch your front\nHere we come, gunshots to Tut, now you stuck\nFuck the rap game, nigga, this M.O.B\nSo believe me, we enemies, I go against all odds\n\n[Hook]\nI'm hopin' my true motherfuckers know\nThis be the realest shit I ever wrote\nAgainst all odds, up in the studio, gettin' blowed\nTo the truest shit I ever spoke\nI'm hopin' my true motherfuckers know\nThis be the realest shit I ever wrote; against all odds\n\n[Verse 3]\nPuffy gettin' robbed like a bitch, to hide that fact\nHe did some shit he shouldn't have did, so we ridin' for that\nAnd that nigga that was down for me, restin' dead\nSwitched sides, guess his new friends wanted him dead\nProbably be murdered for the shit that I said\nI bring the real, be a legend, breathin' or dead\nLord, listen to me, God don't like ugly, it was written\nAyo, Nas, your whole damn style is bitten\nYou heard my melody (This nigga sounds like Rakim!)\nRead about my life in the papers\nAll my run-ins with authorities, felonious capers\nNow you wanna live my life\nSo what's a \"chazzer,\" Nas? Niggas that don't rhyme right\nYou've seen too many movies\nLoad 'em up against the wall, close his eyes\nSince you lie you die — goodbye!\nLet the real live niggas hear the truth from me\nWhat would you do if you was me? Nigga\n\n[Hook]\nHopin' my true motherfuckers know\nThis be the realest shit I ever wrote\nAgainst all odds, up in the studio gettin' blowed\nTo the truest shit I ever spoke\nAgainst all odds, hopin' my true motherfuckers know\nThis be the realest shit I ever wrote\nAgainst all odds, up in the studio gettin' blowed\nTo the truest shit I ever spoke; against all odds\n\n[Outro]\n21-gun salute, one love to my true thug niggas\n(Outlaw! Outlaw! Outlaw!)\n21-gun salute to my niggas that die in the line of duty\nRepresentin' to the fullest, bein' soldiers with military minds\nThat play the rules of the game, 21-gun salute\nI salute you, my niggas, stay strong\nI ride for you, I rhyme for you, I roll for you, it's all for you\nTo all you bitch-made niggas, I'm comin' for you\nAgainst all odds, I don't care who the fuck you is\nYou touch me, I'm at you\nI know you motherfuckers didn't think I forgot\nHell nah, I ain't forgot, nigga\nI just remember what you told me\nYou said don't go to war unless I got my money right\nI got my money right now, now I want war", "image": "https://images.genius.com/de81f90d8bf5ccdc5b74c71182edc9d2.600x600x1.jpg"}], "artist": "2Pac"}