{"songs": [{"title": "This One’s for U", "album": "Kuruption!", "year": "1998-10-06", "lyrics": "[Intro]\n*smoking*\n\nYo, yo man\nYo, yo I got a message for all y'all motherfuckers mad at shit\nCause now I'm mad at shit\nGot a nigga smokin' a whole motherfucken' dope sack of some doja\nY'all know what I mean?\nShit man, motherfuckin' shit man, this some bomb ass weed\nYo check it -\nFuck all y'all fake ass, mad cause nobody don't love y'all\nSecretly dingy ass, 500,000 sold ass, bitch ass, funny style ass\nGoofy, dusty, dirty, punk ass motherfuckers\n\nGangster nigga!...\nTo all the homies...\nNo bitch-ass niggas allowed, no bitches allowed\nKurupt Young Gotti, check it out\n\n[Kurupt]\nGangsta, gangsta, I'm a G from the D\nThat's what the riders see\nI'm a get a quarter-mil, quarter-inch of a deal\nCome through - grey and blue\nI'mma show you what I do, Where I hang and shit\nDogg Pound Gangstaville in the cut, nigga what\nI'm a slip through, if you trip, I'mma trip too\nGet a bitch to strip 'til the homies dip through\nGot my nigga Slip too (what up Slip?)\nAnd I got a whole eighth of weed\nAnd that's all we need - 'til we hit the next spot\nCause when I flew in, I knew it was 'bout to be a G'd up reunion\nAin't no words to express this song\nCause one day you're here and the next you're gone\nThis goes out to the homies\nAnd this is straight from the heart and true\nAnd This One's for U\n\n[Hook]\nThis One's for U, yeah\nThis One's for U, ooh\nThis One's for U, oooh woaaa\nThis One's for U\n\n[Kurupt]\nHollered at one of the homies the other day\nHe said someone approached and then he looked the other way\nHe turned back and drawed, and all he saw -\nWas a vision of himself, he choked and he awoke\nAnd I just paused to laugh, that's some familiar shit\nCause the other day I dreamt up some similar shit\nSo I tell him I love you and stay safe\nThen I skates to a whole different hood where different shit takes place\nI've been G, since the age of 18\nWhen I first ran into heaters, nine-millimeters\nGet the cash as one, all the homies mash as one\nToke the bong and smoke these, a hundred spokes\nHoller at the big homeboy C-Style (what up C-Style!?)\nI ain't seen him in a while - so I pops the stash\nAnd pull out the orange blueberry shroomz and hash\nI don't think niggas could last\nCause ain't nothin' fuckin' with Kurupt and Daz\n\n[Hook]\nThis One's for U, ooooooh\nThis One's for U\nThis One's for U, oooh woaaa\nThis One's for U, yeah\n\n[Kurupt]\nI feel a \"woo\" comin' on cuh, I feel a \"woo\" comin' on cuh - WOO! WOO!\nI feel a \"woo\" comin' on cuh, I feel a \"woo\" comin' on cuh - WOO! WOO!\nThere I was - when I talk about history, or psychology, or biology (what?)\nWe'll talk about D.P.-ology, geology, a G's anology\nG's in rare form, C's in rare form\nI gots vision, ammunition loaded, prepare storm\nStack up the Cutlass like bustas\nHeaters cocked back for all you motherfuckers that's tryin' to touch us\nI got licks to hit, put that ass on crutches\n(I'ma) conceal the Glock, pancakes stop and drop\nBlown, hold up, what's goin' on?\nMy main compose within' a whole different zone\nHoppin' in 'fours, slammin' Cadillac doors, with a gang of hoes\nCould we pull hoes nigga, pro's nigga\nBanged out, this is for the niggas that bang (who that?)\nKurupt's the name, nigga you know the game\nSnoop Dogg's the name, nigga you know the gang\nDat Nigga Daz the name, you know exactly what we claimin'\nHeaters cocked back, get scorched just like flames\nDope in the wind, indo and Henn\nTha Gang nigga\n\n[Hook]\nThis One's for U, heyayyay\nThis One's for U, ooh\nThis One's for U, oooh woaaa\nThis One's for U\nThis One's for U, yeaaah\nThis One's for U, ooh\nThis One's for U, oooh woaaa\nThis One's for U, oooh yeaaah", "image": "https://images.genius.com/a7652517cf446c15e882aa0bc85229b3.594x594x1.jpg"}], "artist": "Kurupt"}