{"songs": [{"title": "Views", "album": "Views", "year": "2016-04-29", "lyrics": "[Intro: The Winans]\nQuestion is, will I ever leave you?\nThe answer is no, no, no-no-no, no, no\nNo, no-no-no, no, no\nNo, no, no, no\nQuestion is, will I ever leave you?\nThe answer is no, no, no-no-no, no, no\nNo, no-no-no, no, no\nNo, no, no, no\n\n[Verse 1]\nYeah, you feel the pressure, man, I know the pressure\nAnd my wifey is a spice like I'm David Beckham\nA lot of pent up aggression comin' out of my section\nOVO on me while y'all niggas was playin' dress-up\nAnd I know who gon' take the fall with me\nThey right here on call with me, they all with me\nYou could throw curve balls but I got the glove fitted\nThey've been sayin' it's love, but it isn't love, is it?\nToast to the days when they wasn't out to get me\nI worked at Jaydees Connections whenever Jason let me\nCeesay’s, I was buyin' fitteds everyday\nKiddie's Caribana, tryin' not to catch a stray\nI dropped out right before I graduate\nSix credits left, my mama had her saddest day\n“It's only up from here, I promise, you just gotta wait”\nAnd she took my word for it, that's all I had to say\nLately I just feel so out of character\nThe paranoia can start to turn into arrogance\nThoughts too deep to go work 'em out with a therapist\nI get a blank page when I try to draw a comparison\nI'm gettin' straight to the point with it\nNeed y'all to know that I never needed none of y'all niggas\nFuck bein' all buddy buddy with the opposition\nIt's like the front of the plane, nigga, it's all business\nBut I haven't flown with y'all boys in a minute\n\n[Verse 2]\nLook, they'd rather run up on me than towards their goals\nMy niggas still hit the club when it's 20 below\nWho you think runnin' this show?\nYou saw it in me at 20 years old\nThe lingo start to sound like we talkin' in code\nI got a pure soul, I don't do the hate\nYou don't worry 'bout fittin' in when you custom made\nMe and Niko used to plot on how to make a change\nNow me and Kobe doin' shots the night before the game\nStill drop 40 with liquor in my system\nNumbers goin' unlisted just to create some distance\nI might see you on and off but I'll never switch ya\nNiggas quick to double cross like both of us Christian\nLamborghini got me feelin' like I'm Christian Bale\nAnd I never bend my morals for the ticket sales\nTippin' scales, bars heavy like triple XL\nI never tag no one in, I'd rather get you myself\nRunnin' through the 6, thumbin' through the contracts\nI'm possessed, you can see it under the contacts\nThey think I had the silver spoon but they'll get it soon\nI still got somethin' left to prove since you left me room\nPaint a plan for the family debt, we in the minus\nAnd like it's goin' in a trunk, I put it all behind us\nWhere you tryna go? I got it, I'll take us wherever\nI'm a staple in the game, all my papers together\nAnd my life is on display like Truman\nThey wanna pree the movements, gotta start to make 'em sooner\nMy exes made some of my favorite music\nI dated women from my favorite movies\nKarma's such a thing of beauty\nI'd share more of my story but you wouldn't believe it\nIt's farfetched like I threw that shit a hundred meters\nI keep it a hundred like I'm running a fever\nI might take a breather but I won't ever leave you\nIf I was you, I wouldn't like me either\nYeah", "image": "https://images.genius.com/6f4b9c41ccb18485cccd6aa364ccc3b8.1000x1000x1.jpg"}], "artist": "Drake"}