{"songs": [{"title": "Heartbeat", "album": "Camp", "year": "2011-11-15", "lyrics": "[Hook]\nI wanted you to know\nThat I am ready to go, heartbeat\nMy heartbeat\nI wanted you to know\nWhenever you are around, can't speak\nI can't speak\nI wanted you to know\nThat I am ready to go, heartbeat\nMy heartbeat\nI wanted you to know\nWhenever you are around, can't speak\nI can't speak\n\n[Verse 1]\nI know what your boy like\nSkinny tie and a cuff type\nHe go and make breakfast\nYou walk around naked\nI might just text you\nTurn your phone over, when it's all over\nNo settling down, my text go to your screen\nYou know better than that\nI come around when you least expect me\nI'm sitting at the bar when your glass is empty\nYou thinking that this song's coming on to tempt me\nI need to be alone like the way you left me\nYou start calling, you start crying\nI come over, I'm inside you\nI can't find you, the girl that I once had\nBut the sex that we have isn't half bad\nThe text say that \"It's not fair\"\nThat's code for \"He's not here\"\nAnd I'ma flirt with this new girl\nAnd I'ma call if it don't work\nSo we fuck 'til we come to conclusions\nAll the things that we thought we were losing\nI'm a ghost and you know this\nThat's why we broke up in the first place\n'Cause\n\n[Hook]\nI wanted you to know\nThat I am ready to go, heartbeat\nMy heartbeat\nI wanted you to know\nWhenever you are around, can't speak\nI can't speak\nI wanted you to know\nThat I am ready to go, heartbeat\nMy heartbeat\nI wanted you to know\nWhenever you are around, can't speak\nI can't speak\n\n[Verse 2]\nIt's late night Thursday\nI know that you heard me\nBut you don't want the same thing\nWell two can play that game\nSo I'm chilling with my girlfriend\nBut she not my real girlfriend\nShe got a key to my place but\nShe's not my real girlfriend\nStupid, so dummy\nSay the wrong thing and wrong girls come runnin'\nI'm paranoid that these girls want something from me\nAnd it's hard to make a dime go 100\nAnd my dude freakin' out over a worse fate\nShe on time, but she late for they first date\nCause he went and tried out a new condom\nSlipped off in a threesome, good problems?\nRight? Wrong\nAskin' him if she wanna play games\nWith the Super Smash Brothers, but none of them you\nI miss the sex when you kiss whenever you through\n69 is the only dinner for two\nI was wrong, but would you have listened to you?\nUh, you were crazy\nI got a heart, but the artichoke\nIs the only thing girls want when you in that smoke\nAnd light\n\n[Hook]\nI wanted you to know\nThat I am ready to go, heartbeat\nMy heartbeat\nI wanted you to know\nWhenever you are around, can't speak\nI can't speak\nI wanted you to know\nThat I am ready to go, heartbeat\nMy heartbeat\nI wanted you to know\nWhenever you are around, can't speak\nI can't speak\n\n[Verse 3]\nSo we're done? This the real shit?\nWe used to hold hands like field trips\nI'm a jerk, but your dude is a real dick\nI read his post on your wall and I feel sick\nHe ain't cool, he ball and all that\nBut he just a fake nigga who blog in all caps\nYou couldn't wait to date\nI'm going straight for your thighs like the cake you ate\nI give a fuck about the niggas that you say you ate\nYou know that I’m the best when I’m a-fake-tionate\nI'm the best that you had, face it\nJ and Keyshia are related: racist\nI give you money, then you burn me, then you made off\nShe ain't a killer, but she'd fucking blow your head off\nI know he wondering, \"What the fuck you hiding?\"\nThat we dated like raps about Bin Laden\nAyo, fuck this\nAre we dating? Are we fucking?\nAre we best friends? Are we something? In between that?\nI wish we never fucked, and I mean that\n\n(But not really, you say the nastiest shit in bed and it’s fuckin’ awesome)", "image": "https://images.genius.com/78236fad04ed869070b0d50a1b6a02fa.600x602x1.jpg"}], "artist": "Childish Gambino"}