{"songs": [{"title": "One Night", "album": "Doctor’s Advocate", "year": "2006-11-14", "lyrics": "[Hook: Andrea Martin]\nI only fuck with you, on two occasions\nWhen I'm drunk, when I'm high\nI would be broke, if I would be with you\nThat is why it's fo' one night\n\n[Verse 1: The Game]\nI'm a motherfucking gangbanging nightmare, wake up motherfuckers\nI traded in my white Nike Airs\nFor a red pair of Converse, back to the hood\nMy own niggas acting like I turned my back on the hood\nI used my rap money to put crack in the hood\nEven brought the nigga Dr. Dre back to the hood\nI showed niggas the Bentley then let you drive it\nGone for two days and I ain't even check the mileage\nWhen we was fighting with Crips it wasn't about no dollars\nIt was about selling dope to put our kids through college\nI'm sitting on the block, reminiscing for hours\nWiping my tears cause now half of my niggas is cowards\nAnd I was still fuckin with niggas\nAfter I got shot and didn't get one hospital visit\nMy homey Snoop told me it'd be days like this\nIt hurt my heart, to say this shit\n\n[Hook]\n\n[Verse 2: The Game]\nRed bandana in my back pocket, I'm for real\nThis ain't a pastel color khaki suit, and I ain't Pharrell\nI don't front about shit I pull my gun up out shit\nAnd let everything fly to keep my son up outta this\nI thought you loved me nigga, talk is cheap\nRemember, the bulletholes in my son's car seat\nMy baby momma found four shells\nI ain't get one \"keep your head up,\" all I got was \"keep it real\"\n'Keep it real' my niggas?\nLast year alone I spent one point five mill' on my niggas\nAfter the bullshit, I stayed right there\nTook you to award shows, there go Jay right there, where? Right there!\nI had all you niggas in suits, cleaner than a pair of fresh Nike Airs\nI'm supposed to enjoy this shit but it's quite clear\nThe last twelve months been a fucking nightmare\n\n[Hook]\n\n[Verse 3: The Game]\nThis shit worse than arguing with my bitch\nI done been through mo' ups and downs, than the Impala switch\nGet yo hand out my pocket nigga, go fish\nI was born by myself so I don't owe y'all shit\nNigga you tell me, what you want me to do\nDrop my son off at home and come bang wit'chu?\nOh now it's fuck Game, nah nigga fuck you\nI put that on my life, matter fact, that's on Piru\nAnd the reality is, I could die too\nAnd end up in the cemetery, right beside you, we can both rot\nAngels flying over my headstone, but the devils inside yo' box\nYou wanted my shine so I gave you ice\nThen I gave you a second chance and you played me twice\nCouldn't be a real homeboy to save yo' life\nI shoulda took Dr. Dre's advice\n\n[Hook]\n\n[Outro: Andrea Martin]\nBlack Wall Street fo' life\nOnly fuck with you on two occasions\nWhen I'm out of my mind, or when I'm high\nI only, fuck with you...", "image": "https://images.genius.com/8733b8e495bb8c50e53cd1da0aada2cb.1000x1000x1.jpg"}], "artist": "The Game"}