{"songs": [{"title": "Perfecto", "album": "Swimming", "year": "2018-08-03", "lyrics": "[Intro]\nYeah, yeah, yeah, yeah, yeah\nYeah, yeah\nYeah, yeah, yeah, yeah\n\n[Chorus]\nWell, it ain't perfect but I don't mind\nBecause it's worth it\nWho really has the time at all?\nIt ain't perfect but I don't mind\n'Cause on the surface I look so fine\nBut really I'm buggin', buggin'\nMakin' somethin' out of nothin'\n\n[Verse 1]\nYeah, as hard as it gets: cool, calm and collected\nHoldin' my breath, this ain't what I expected\nDon't argue to death, pull my heart out of my chest\nThe cards is all on the table, I'm callin' it\nDon't say it, I swallow it\nWhen livin' off of borrowed time\nOften I'm on the fence, on a line\nAddin' up what's on my mind\nMy feet on the clouds, head on the ground\nThat we goin' down, bet you know me now\n\n[Bridge 1]\nI'm treading water, I swear\nThat if I drown I don't care\nThey callin' for me from the shore, I need more\n\n[Chorus]\nWell, it ain't perfect but I don't mind\nBecause it's worth it\n(Is it? Is it? Is it? Is it? Is It?)\nWho really has the time at all?\n(Is it? Is it? Is it? Is it? Is It?)\nIt ain't perfect but I don't mind\n'Cause on the surface I look so fine\nBut really I'm buggin', buggin'\nMakin' somethin' out of nothin'\n\n[Verse 2]\nYeah, it feel like the weekend on a Tuesday, I can move dates\n\"I got something else to do\" day, always do hate\nIf I do say, the D'USSÉ with the homies like it's Kool-Aid\nMe? I'm just tryna play it cool, J (anyways)\nYeah, mind over matter, I'm purer than alkaline\nBeen stuck on album time, I gotta get out to shine\nFly on the wall, shit, I was buggin'\nMiss me like you gettin' withdrawal, I keep that coming, yeah\n\n[Bridge 2]\nI'm treading water I know\nIf I stop movin', I'll float\nThey nothing new it-\nJust play it cool baby, just play it cool\nYou know, cool\n\n[Chorus]\nWell, it ain't perfect but I don't mind\nBecause it's worth it\nWho really has the time at all?\nIt ain't perfect but I don't mind\n'Cause on the surface I look so fine\nBut really I'm buggin', buggin'\nMakin' somethin' out of nothin'\n\n[Outro]\nYeah, tell me you love me, spin me around\nPretty please pick me up in the air and don't put me down\nSeen it all unfold, sat back and watched\nKnowin' time don't give a fuck about clocks until they stop\nBare feet, runnin' late, her car started\nEven though the only thing that she drivin' a hard bargain\nMore important is I'm kinda sorta out the door but\nShe put me back together when I'm out of order\nPerfect", "image": "https://images.genius.com/5f45938f2d5ece669fce342e5493f634.375x375x1.jpg"}], "artist": "Mac Miller"}