{"songs": [{"title": "Canon (Freestyle)", "album": "Return of the Dozen Vol. 2", "year": "2011-04-12", "lyrics": "[Verse 1: Swift]\nA loose canon, when they see the strap, they scatter\nI got bitches busting out of their clothes like Bruce Banner\nI roll thick as Britannicas, niggas push the panic button\nBreathing harder than Darth Vader, when I confront em\nStunting in front of your people? I treat that ass like Evel Knievel\nCrush every bone in your cerebral, I drink liters when I see you\nDon't give a fuck about who you is\nI split on your people, you're loony, gonna get Uzi-fed\nYou Can't touch this, they pray that I will stop\nMy Glock have these hoes shaking like Michael J Fox\nI'm from Murder Mitten, before we pop, we smack heads\nFor that dope I find me a pipe to crack heads\nLeave 'em bleedin' in the streets\nAnd you can see me leaving the scene with bloody cleats\nYou can follow these feet and meet me in the alley\nThere's no hiding and I'mma creep you from behind like Bishop\nAnd I ain't yelling Riverside, a lotta police died\nI fucked up they stinging operation\nBy swarm in their ass like a beehive\nI cause havoc, you can't stop it\nI cock it, and walk with caution tape in my back pocket\nHigh off oxycotin vodka, And I'mma talk more shit\nThan Andy Milanokis and knock me out a bouncer\nI slam my counselor, can't talk me out of this massacre\nAnd I be shootin' up his office with a Calico\n\n[Verse 2: Fuzz Scoota]\nBeef when I shucking and diving, tactical vest\nThey tucking the guns, we tucking the knives\nAnd Bizarre snatchin' the keys like \"Fuck it I'm Driving\"\nJump on the sidewalk park on your kids\nOn Bizzy's nuts cause he's driving\nKuniva waving an empty 5k niggas ducking and hiding\nSwift fucking that gay-ass 23 sounds so fucking surprising\nWentworth, my niggas having discussions of diving\nParty City, spend a couple of bucks on disguises\nI'm so far away, to niggas I'm on the horizon, network of shooters behind me like I fuck up Verizon\nI see you bitches looking soft with your flyers and your softer tires\nHave your fingernails ripped of with pliers\nWell off with tires, leave my initial exhaust with fires\nDoing donuts on your block, nothing but the cost of tires\nBoss with fires, higher like I've been tossed in fire\nCough get higher our peasants gon' floss with sire\nFor what will never be a task cause I shut shit down\nOn your block with the hammers like talk that fuck shit now!\nGot a kush habit, person who I fuck with pounds\nGun fetish, I fucks with rounds, every bitch I fucks with's down\nAnd for one hand, she suck dick now\nShe on some smut shit now, or met a boy with a nut drip down\n\n[Verse 3: Bizarre]\nEver since I was a young buck I kept money under the matress\nThis Dr. Dre, is gonna to be another fucking stabber (Uhhh!)\nThis is what happens, this is a fucking chain reaction (All Aboard!)\nBitch, you looking at the captain!\nCome get this ass-kicking, Bizarre party high and join the ass licking\nI'm past trippin, never went to high school I was class skippin'\nG.O.A.T. slinger, new head-banger, Wu-Tang member, 39th chamber\nSunni Muslim, out here living real foul\nPray 5 times a day, then eat a pig and a cow, WOW\nRobber with no mask, broken arm with no cast\nOak Park High School, EP and Thad\nCold as ice, matter of fact, I'm too cool\nStrangle you with an inner tube (uh..)\nCheck a nigga's oil like I work for Jiffy Lube (Stab a nigga!)\nFuck a gun, bitch, I hit yo ass with a dart\nAnd how much you owing, you ain't gonna have no fucking heart (bitch!)\nDrink water, be smart; Fuck Superman, be Clark!\nThe wild-ass animals, they coming after dark (hahaha!)\nReturn of the Dozen, motherfucker, part 2\n2 middle fingers, and I'm sayin' \"FUCK YOU!\"\nGangbanging, we always down for a fight\nAnd we throw them letters up quicker than fuckin' Vanna White\nHennessy on Sprite, me and Tina no Ike\n(Bite a nigga's ear off) Bitch don't forget about Mike!\n\n[Verse 4: Kuniva]\nYo, I'm down for my niggas, so die for me, no fakin' (un-uh)\nAnd when it's on, the only question is whose car we taking? (Let's go!)\nThat's called brotherhood, live from the east side\nA murder fest is taking place, we ride when the G's ride\nSo off with your head, I leave you coughing up red fluid\nI'll do it, police interfere then it's officer dead\nI swear, let me hear you talk to the feds\nAnd I'mma get your brother shanked for a carton of squares\nBreak you down like the kilo\nOn your wedding day climb out from under the gazebo\nPull you out of your tuxedo\nDrunk at the casino with some clean hoes and clean clothes\nWith a pack of goons and every picture is the mean pose (Yes ma'am)\nReturn of the Dozen, for thinking shit sweet\nI'll put one in your muffin, right in front of your cousin (oh shit!)\nTell your mom to stop wantin' my lovin'\nPut a shot into a pregnant chick's stomach, put one in her oven\nI'll milk carton your little niece, yeah the bitch missin'\nI'm dead wrong but you just dead, big difference!\nChunky rings on the finger leave a bunch of imprints\nBody in the trunk stinkin', lightin' a bunch of incense (ewww)\nI see dead people like The Sixth Sense\nThey walk around alive and they don't even know they're dead until the 5th hit (fuck!)\nNigga where them bitches at, pimp shit and bring the bread\nMeet me in the back room and tell your girl I need some head (right now!)\nYou don't want a problem, street sweeper hit your dingy ass\nWith the four fifths or greet him at the door with your friendly ass\nNow rockin' with a crazed nigga, stocking cap over the face\nMade nigga, K splitter, grave digger\nY'all a bunch of coochy-actin' bitches\nNow the checks flyin'\nThe old G's will tell you, wet pussy is the best kind", "image": "https://images.genius.com/78a2dd37bee3129adb21d5fac55f009d.1000x1000x1.jpg"}], "artist": "D12"}