{"songs": [{"title": "Yellow Brick Road", "album": "Encore", "year": "2004-11-12", "lyrics": "[Intro]\n\"What we have to do is deal with it when these individuals are young enough, if you will, to be saved, not in a religious sense, but not to constitute what this country at times calls (Yeah) their throwaway children.\"\n\"We seem to be approaching (C'mon!) an age of the gross.\" (*Burp*)\n\"We all have this idea that we should move up a little bit from our parents' station and each generation should do a little bit better.\"\n\n[Verse 1]\nAll right, come on, let's cut the bullshit, enough\nLet's get it started, let's start addressin' this issue, and open it up\nLet's take this shit back to the basement and we can discuss\nStatements that's made on this tape and its whole origin of\nThe music that we all know and love, the music we all enjoy\nThe music you accuse me of tryin' to destroy\nLet's rewind it to '89 when I was a boy\nOn the East Side of Detroit, crossin' 8 Mile into Warren\nInto hick territory; I'd like to share a story\nThis is my story, and can't nobody tell it for me\nYou have well informed me, I am well-aware\nThat I don't belong here: you've made that perfectly clear\nI get my ass kicked damn near everywhere\nFrom Bel-Aire shopping center just for stopping in there\nFrom the black side all the way to the white side\nOkay, there's a bright side, a day that I might slide\nYou may call it a pass, I call it haulin' my ass\nThrough that patch of grass over them railroad tracks\nOh, them railroad tracks, them old railroad tracks\nThem good old notorious so well known tracks\n\n[Hook]\nSo, let's go back, follow the yellow brick road\nAs we go on another episode\nJourney with me as I take you through this nifty little place\nThat I once used to call home sweet home\nCome on, let's go back, follow the yellow brick road\nAs we go on another episode\nJourney with me as I take you through this nifty little place\nThat I once used to call home sweet home\n\n[Bridge]\nI'd roam the streets so much they called me a drifter\nSometimes I'd stick up a thumb just to hitchhike\nJust to get picked up to get me a lift to\n8 Mile and Van Dyke or steal a goddamn bike\nFrom somebody's backyard, and drop it off at the park\nThat was the halfway mark, to meet Kim had to walk\nBack to her mama's on Chalmers after dark\nTo sneak me in the house when I'm kicked out my mom's\nThat's about the time I first met Proof\nWith Goofy Gary on the steps at Osborn, handin' out some flyers\nWe was doin' some talent shows at Center Line High\nI told him to stop by and check us out sometime\nHe looked at me like I'm out my mind\nShook his head, like, \"White boys don't know how to rhyme.\"\nI spit out a line and rhymed \"birthday\" with \"first place\"\nAnd we both had the same rhymes that sound alike\nWe was on the same shit, that Big Daddy Kane shit\nWhere compound syllables sound combined\nFrom that day we was down to ride\nSomehow we knew we'd meet again somewhere down the line\n\n[Hook]\nSo, let's go back, follow the yellow brick road\nAs we go on another episode\nJourney with me as I take you through this nifty little place\nThat I once used to call home sweet home\nCome on, let's go back, follow the yellow brick road\nAs we go on another episode\nJourney with me as I take you through this nifty little place\nThat I once used to call home sweet home\n\n[Verse 2]\nMy first year in 9th grade, can't forget that day at school\nIt was cool 'til your man MC Shan came through\nHe said that Puma's the brand ‘cause the Klan makes Troops\nIt was rumors, but man, goddamn, they flew\nMusta been true, because man, we done banned they shoes\nI had the new ones, the Cool J Ice Lamb, suede too\nBut we just threw 'em in the trash like they yesterday's news\nGuess who came through next? X Clan debuted\nProfessor X (Vanglorious!) \"Exist in a state of red\nBlack and green, with a key, sissies!\"\nNow with this being the new trend, we don't fit in\nCrackas is out with Cactus Albums, blackness is in\nAfrican symbols and medallions represent Black Power\nAnd we ain't know what it meant, me and my man Howard\nAnd Butter would go to the mall\nWith 'em all over our necks like we're showin' 'em off\nNot knowin' at all we was being laughed at\n\"You ain't even half black! You ain't 'posed to have that\nHomie, let me grab that! And that Flavor Flav clock\nWe gon' have to snatch that!\" All I remember is meeting back at\nManix's basement, sayin' how we hate this\nHow racist but dope the X Clan's tape is\nWhich reminds me, back in '89, me\nAnd Kim broke up for the first time; she was tryin' to two-time me\nAnd there was this black girl at our school, who thought I was cool\n‘Cause I rapped, so she was kinda eyein' me\nAnd oh the irony, guess what her name was?\nAin't even gonna say it, plus\nThe same color hair as hers was and blue contacts\nAnd a pair of jugs, the bombest goddamn\nGirl in our whole school, if I could pull her, not only would I become\nMore popular, but I would be able to piss Kim off\nAt the same time, but it backfired\nI was supposed to dump her, but she dumped me for this black guy\nAnd that's the last I ever seen or heard\nOr spoke to the \"Ole Foolish Pride\" girl, but I've heard\nPeople say they heard the tape and it ain't that bad\nBut it was: I singled out a whole race\nAnd for that I apologize, I was wrong\n‘Cause no matter what color a girl is, she's still a—\n\n[Hook]\nSo, let's go back, follow the yellow brick road\nAs we go on another episode\nJourney with me as I take you through this nifty little place\nThat I once used to call home sweet home\nCome on, let's go back, follow the yellow brick road\nAs we go on another episode\nJourney with me as I take you through this nifty little place\nThat I once used to call home sweet home\n\n[Outro: Debbie Mathers]\nFuck out of my house, you fuckin' pieces of shit!\nGet the fuck out of my house, you stupid fucker!\nYou son of a bitch!", "image": "https://images.genius.com/e76120b9dd2c0af6f1b3f8d3dcbe11d2.1000x1000x1.jpg"}], "artist": "Eminem"}