{"songs": [{"title": "Where My Money (I Need That)", "album": "Port of Miami", "year": "2006-08-08", "lyrics": "[Hook]\nWhere my money? I need, I need, I need cash\nNigga where my money? I need, I need, I need cash\nWhere, where, where, where my money? I need, I need, I need cash\nNigga where, where my money? I need, I need, I need cash\nWhere, where, where, where my money? You don't wanna be the one I blast (Ross)\nWhere, where, where my money? You don't wanna be the one I blast (Ross)\nWhere, where, where my money? You don't wanna be the one I blast (Ross)\nWhere my money? You don't wanna be the one I blast (Ross)\n\n[Verse 1]\nNever try me like a thug\nIf you do you better duck\nI'mma hit him in his body, somebody patchin' him up\nI'mma bust a nigga head somebody wrappin' him up\nWhen I ask you for my shit nigga am I askin' too much?\nRidin' dirty in my seven deuce\nIts dirty you can tell the truth\nI'm dirtier than a reverend fightin' Internal Revenue\nI'mma get mine you can call me uncle Sam\nUse you for your services than I don't give a damn\nSlap Bush with my cash, all these taxes and his gas\nGot these bitches sellin' ass, homicide for the cash\nHomicide for the cash ride around gunnin' mass\nSummer time Son of Sam Triple C's gon' gun you down\nTwenty birds I'mma serve posted up on this curb\nGot a lot of pistol game so we at ya everyday\nIf you owe me a dime boy you better give me mine\nCause I'm pullin' my nine with one thing that's on my mind\n\n[Hook]\nWhere my money? I need, I need, I need cash\nNigga where my money? I need, I need, I need cash\nWhere, where, where, where my money? I need, I need, I need cash\nNigga where, where my money? I need, I need, I need cash\nWhere, where, where, where my money? You don't wanna be the one I blast (Ross)\nWhere, where, where my money? You don't wanna be the one I blast (Ross)\nWhere, where, where my money? You don't wanna be the one I blast (Ross)\nWhere my money? You don't wanna be the one I blast (Ross)\n\n[Verse 2]\nStill waitin' on the call homie post to be my dawg\nIt done been more than a week he caught himself runnin' off\nYeah he bought two, but I fronted another three\nBut I'mma get him marked off for no less than a quarter key\nYeah I broke him off now I gotta break him off\nHe think he usin' his head I gotta take it off\nThat boy losin' his head then I'm takin' off\nMashin' in the grand national won't break it off\nLet me break it down\nI see Fifty off a chicken every time I break it down (down)\nBad little bitches shakin' it when they break it down (down)\nLet me break it down I broke it down to the smallest slab\nCause I'm so fat got the fiends callin' cabs\nI'm out here for my stacks\nI'm out here for my stacks\nFrom the side of the bridge\nYou gotta cross the tracks\nDade county D-boys at your front door (Ross)\nThree in the mornin' and you know why they knockin' for (Ross)\n\n[Hook]\nWhere my money? I need, I need, I need cash\nNigga where my money? I need, I need, I need cash\nWhere, where, where, where my money? I need, I need, I need cash\nNigga where, where my money? I need, I need, I need cash\nWhere, where, where, where my money? You don't wanna be the one I blast (Ross)\nWhere, where, where my money? You don't wanna be the one I blast (Ross)\nWhere, where, where my money? You don't wanna be the one I blast (Ross)\nWhere my money? You don't wanna be the one I blast (Ross)\n\n[Verse 3]\nI'm like a professor, I weigh and I measure\nTriple beam on the dresser, couldn't be fresher\nCookin' is my pleasure cookies is my treasure\nHustle couldn't be better muscle you couldn't measure\nNigga's feelin' the pressure pressure they bust pipes\nI'm cool wit your bitch your bitch fuck nice, see I need that\nFly hoes on my team, see I need that, my hoes will gimmie anythin'\nGrindin' back in Savannah, climbin' back through Atlanta\nShoot through Macon, see what’s shakin', my shit white as miss vanna\nIt's Rick Ross Rolls-Royce when I floss\nI'mma big boss and I never took a loss, see I need that\nI might of took a loss but it wasn't like that (Ross)\nSo I'm back on my grizzle, got the streets on sizzle\nIt's Ricky Rizzle the rich nizzle, the rich nizzle, now bitch\n\n[Hook]\nWhere my money? I need, I need, I need cash\nNigga where my money? I need, I need, I need cash\nWhere, where, where, where my money? I need, I need, I need cash\nNigga where, where my money? I need, I need, I need cash\nWhere, where, where, where my money? You don't wanna be the one I blast (Ross)\nWhere, where, where my money? You don't wanna be the one I blast (Ross)\nWhere, where, where my money? You don't wanna be the one I blast (Ross)\nWhere my money? You don't wanna be the one I blast (Ross)", "image": "https://images.genius.com/5af5ea1b4c83e42c587a9c3db8f46a96.1000x1000x1.jpg"}], "artist": "Rick Ross"}