{"songs": [{"title": "Who Are You (Who I Am)", "album": "BALL’N", "year": "2011-02-18", "lyrics": "[Intro: Ron Artest]\nYo, Nas what up? Yo, Nas What up?\nThis your boy Artest\nThis is one track I won't rap on, I won't rap on\nGo!\n\n[Verse 1: Nas]\nHeard you got your master's, did college up\nNever looked back, now that's what's happening\nAnd it's good to see you made it out the hood\nWith a degree, a true man with passion\nNow you could enter the so-called\n\"White Man's Society\" and go right past them\nLooking in the Wall Street Journal for your face\nBut it's always absent\nThere he go, that's him eating flan and ambrosia\nWatch on his arm, golden, laughin'\nTry to get his attention\nBut he's flinching, guess my grimy clothes threw him off, so I mention\nWe were neighbors some time ago\nHe was kinda cold, in this restaurant\nFull of his kind and more\nHe sighed, tried to look surprised, I know\nHis side of the city where he resides, so\nI had to go\nI heard him laugh hard at some sad black jokes\nHate so-called \"intellectuals\"\nNo balls, he suggests we vote\nHe stand all proud, speaking to correct his folks\nHe want to lecture folks\n'Cause he professional and he suggest that we don't sell dope\nAnd I guess it's true, but who the fuck are you?\n\n[Chorus: David Rainer]\nWho are you, tryna tell me who I am?\nTryna tell me who I am?\nWho are you, tryna tell me what I'm not?\nTryna tell me what I'm not\nWho are you, tryna tell me who I am?\nTryna box me in, tryna find who I am\n\n[Verse 2: Nas]\nI'm Idi Amin, Marcus Garvey, H. Rap Brown\nI'm Muhammad Ali, I'm Reginald Lewis\nGeorge Washington Carver, I'm Nas with incredible music\nLet's do it, thinking of a master plan\nSipping on disaster, smoking on gangster\nWatching niggas argue, chillin' on my barstool\nWith my Hell Up in Harlem hat in hand\nWith a girl named Pat, she more than a waitress\nTo order your drink with\nShe divorced a banker and bought the bar\nShe got an automobile, she gives an order to kill\nYou get caught and robbed\nWe could see your walk is off, you could lose your rhythm\nWhen you outta the gutter for a while\nYou easily go to soft from hard\nNow we all about hustlers, number runners\nHoes and sharks and we all know the code of the block\nAnd you talking some gibberish, anti-nigga shit\n'Cause you marched back with Rosa Parks\nBrother don't start, go build your Noah's Ark\nYou could float to the end of the world\nAnd pretend what you not, but I know what you are\nWhile I roll in my car, and I'm spending my knot\nWhile my enemies plot, you ain't out of the shot\nMatter of fact, you're an easier target\nAnd I respect everything you accomplished\nBut I hope I never get old and talk that nonsense\nSo who the fuck are you?\n\n[Chorus: David Rainer]\nWho are you, tryna tell me who I am?\nTryna tell me who I am?\nWho are you, tryna tell me what I'm not?\nTryna tell me what I'm not\nWho are you, tryna tell me who I am?\nTryna box me in, tryna find who I am\n\n[Outro: Nas]\nShe Queen of Nzinga\nWinnie Mandela, Ida B. Wells\nWhy can't you tell?\nWhy can't you tell?\n\n[Hook: Xin Xin]\nIt is what is is, it ain't what it ain't\nAm what I am, able to take care all of me alone\nAnd put that boy on hold\nBeen a lot of duplicated\nMakes no difference, love or hate it\nMust stick to your guns\nBecause you're the only one\nNo one is going to hold you down like the way you do\nAnd they ain't gotta lace 'em up, and walk in your shoes\nSay what you say, it's nothing\nGot nothing to prove\nSo, so who are you?\nSo, so who are you-u?\n\n[Chorus: David Rainer, Xin Xin, Both]\nWho are you? tryna tell me who I am? Who I Am?\nTryna tell me Who I Am? who I am?\nWho are you?\nWho are you, tryna tell me what I'm not?\nWho are you? Who are you?\nTryna tell me what I'm not\nWho are you, tryna tell me who I am?\nTryna box me in, tryna find who I am\nWho are, who are, who are you-u?", "image": "https://images.genius.com/23061dd2dc7e863127db561906debd27.434x434x1.jpg"}], "artist": "Nas"}