{"songs": [{"title": "Untitled 2 (Blue Faces)", "album": null, "year": "2016-01-07", "lyrics": "[Verse 1]\nTwo tears in a bucket, I cry with you, agh!\nBut I could never lie with you\nI could never afford not to afford\nI could never put my plans to the side with you\nI could never see a red light\nLike a deer with a headlight, I freeze up when I re-up\nSee, I barely have patience, and you're relating\nOnly the moment to complete us\nWhy you hate to work for it? Went to work for it\nSee, a nine-to-five was so jive turkey\nBut when Thanksgiving came, checks didn’t hurt me\nYou plead the fifth, I read the fifth amendment\nWe both criminals with bad intentions\nThey say time heals all, but if I can shortcut my success\nCorvettes by tomorrow, ugh!\n\n[Hook]\nWhy so sad? Walking around with them blue faces\nShe said I’m down on my luck\nAnd it’s something I gotta have, blue faces\nI hit the bank today and tell 'em color me bad, blue faces\nGet that new money, and it’s breaking me down\n\n[Verse 2]\nMy homegirl got a credit card scam\nShe got a scholarship to college but she don’t give a damn\nIntuition got a Black woman wishin'\nShe saying this on the phone with the noodles in the pan\nI know you, woman, I console you, woman\nYou feel like the universe owes you, woman\nOh, the anticipation, hoping you could make it\nWomen don't prosper chasin' education\nBut you're talented, and can't handle it\nAnd your homegirls can't be your manager\n365 times four, plus more\nCan't get it right, tell me, do you got the stamina?\nBut ain't no money like fast money\nEven today, I'm considered a crash dummy\nA rapper chasing stardom, how can I fast forward?\nMy accolades better than all them\n\n[Hook]\nBut why I'm so sad?\nWalking around with them blue faces\nShe said I’m down on my luck\nAnd it’s something I gotta have, blue faces (Faces)\nI hit the bank today and tell 'em, color me bad, blue faces\nGet that new money, and it’s breaking me down, to the top\n\n[Bridge]\nI love God, I love speed\nI love drank, I love mead\nI love oceans in the deep\nI love women, I love me\nI love God\nUgh! But I’m scared of godspeeeeeeed\nSometimes\n\n[Verse 3]\nI wrote this song\nLooking at a broke home, maybe (Broke home, maybe)\nYou know the poverty-stricken\nThe little broke boy and babies (Broke boy and babies)\nSomebody say \"Kendrick American, they sho’ is crazy\"\nAnd I said “Why?”\nThen he looked me in the eye\nAnd said \"Homie, you're messed up\nYou’re banking on good luck, you wishing for miracles\nNever been through 'ish, you’re crying hysterical\nYou settle for everything, complain about everything\nYSay you sold crack, my world amphetamine\nYour projects ain’t it, I live in a hut\nYou're living to keep warm, I'm living to pay rent\nI paid my way through, praying to Allah\nYou played your way through, dealing with wi-fi\nBull-'ishing yourself, you talking to strangers\nSame thing go for the ones you came with\nWe all came on the boat looking for hope\nAnd all you can say is that you’re looking for dope, huh?\nThese days ain’t no compromise, ugh\nYour pain ain’t mines half the time, ugh\nA brand new excuse ain’t nothing to me\nSee, I made my moves with shackled feet\"\n\n[Interlude]\nCape Town, Cape Town\nCape Town, Cape Town\nCaaaaaaaaape Town\nCape Town, Cape Town\nUgh!\n\n[Verse 4]\nCornrow Kenny\nAll morning with the mixed dashboards triple digits, skrrt!\nMorning with the mixed dashboards triple digits, skrrt-skrrt!\nCornrow Kenny\nSo many plays on me, I finesse\nPalisade views with some sex\nI lost a lot of love for missionary\nThis the first time I react\nMe and Top is like a Kobe-and-Phil\nA father figure; play with him, you get killed\nPlay with me and he-a kill you himself\nTDE the mafia of the west\nMove in silence, yeah, we juugin’ like that\nAct of violence, yeah, we juugin’ like that\nI did a lot of dumb things in my past\nLord forgive me, hoping I don't relapse\nDave just bought a new 9-11\nAlmost thought I’d seen another plane crash\nQ just bought a brand new McLaren\nRock-a-lack about to buy the projects\nMoosa got his son dripping in gold\nMe, I'm about to let my hair down to hoes\nAli 'bout to let his hair down to hoes\nTop billing, that’s a million a show\nMight blow the whole no-whammy on Soul\nMight tell Obama, \"Be more like Punch\"\nSounwave got a Grammy this year\nMackwop, bet he do what he want\nLevel two, level two, no, I’m not done\nYou ain’t gotta tell me that I’m the one\nI could put a rapper on life support\nGuaranteed, something that none of you want\nTen homies down and they all serving life\nWard is like twenty-five hundred a month\nWhat if I empty my bank out and stunt?\nWhat if I empty my bank out and stunt?\nYou ain’t gotta tell me that I’m the one\nYou ain’t gotta tell me that I’m the one\nYou ain’t gotta tell me that I’m the one\nYou ain’t got, you ain’t got\nYou ain’t got, you ain’t got\nTell me that, tell me that that I'm the one\nYou ain’t got, you ain’t got, you ain’t got\nYou ain’t got tell me that, what! I’m the one\nYes, I’m the one!", "image": "https://images.rapgenius.com/1661621ad8ec388b64bedc1fea3e8511.1000x562x1.jpg"}], "artist": "Kendrick Lamar"}