{"songs": [{"title": "Treasure", "album": null, "year": "2014-04-03", "lyrics": "[Hook]\nHow the hell that nigga leave the treasure?\nHow the hell that nigga leave the treasure?\nHow the hell that nigga leave the treasure, nigga?\nHow the hell that nigga leave the treasure, nigga?\nHow the hell that nigga leave the treasure, nigga? Aye!\n\n[Verse 1]\nNiggas tryna say it ain't lit up(Shut up!)\nYou ain't have any stones in your bezels (No way..)\nBurn his ass up like a sweater\nHave a nigga leaving on the stretcher\nPussy nigga know ain't no limit\nIf you tryna get it gotta spend it\nYSL counting plenty digits\nMigo graduated from the midgets (Slime!)\n\n[Hook]\nHow the hell that nigga leave the treasure?\nHow the hell that nigga leave the treasure?\nHow the hell that nigga leave the treasure, nigga?\nHow the hell that nigga leave the treasure, nigga?\nHow the hell that nigga leave the treasure, nigga? Aye!\n\n[Verse 2]\nI'm a rolling stone nigga never going home till' the ball gone\nHow the hell that nigga leave the treasure when the treasure bring the bezels\nAnd the bezels worth a foreign homes? (Chee!)\nWho the hell are you?\nYou gon play with any nigga in my brew and I'ma shoot until his arm gone\nThugga Thugga living that life like Pimp C\nGot a fucking 4 poured up in this styrofoam\nLean, lean lean lean Thug a fiend\nYoung nigga running around with thousands in his jeans\nRacks in a rental, bricks inside the fender\nHeading down the road getting trailed by lieutenants\nNigga gettin' real serve him gateway\nNigga give no wraps up, yay yay\nHolla at them last like feng shui\nThugger taking off for the runway (sheesh!)\nI ain't Rick Ross but I love gunplay\nYou can cut it off but I pull up anyway\nWhen I feed her face told me hit him in the face\nYSL clearing out the whole little place\nMake a pussy nigga turn Christian like Ma$e\nGold bottles, Ace of Spades, looking like a vase\nI ain't talking dozens but I'm gonna beat the case\nI ain't talking shoes but my blunts are laced, you dig me?\n\n[Hook]\nHow the hell that nigga leave the treasure?\nHow the hell that nigga leave the treasure?\nHow the hell that nigga leave the treasure, nigga?\nHow the hell that nigga leave the treasure, nigga?\nHow the hell that nigga leave the treasure, nigga? Aye!\n\n[Verse 3: Zuse]\nRifle come from Cuba, all dem' a tote, dem' my shooters\nClip longer than a ruler, extendo' pon' the Ruger\nAim for your bloodclot medulla, shoot ya out of your pumas\nChicken I know you a rooster, molly mi take fi a booster\nTech nine come with the cooler, ice these niggas like a jeweler\nPoy poy poy pon' a puta, bite him like barracuda\nAlways run to the mula, smoke you like you a hookah\nBlow you away, bazooka, dip, dip, dip, like a scuba\nTeaching these niggas like tutors, tell them no rumor\nHooping these niggas like hulas\nFire like Judah, never sell out like Judas, put that one on nigga\nBullet, bullet, bullet, hey, hey, hey, ride by scooter\nI never leave the treasure I'm the scoopa\n\n[Verse 1]\nNiggas tryna say it ain't lit up(Shut up!)\nYou ain't have any stones in your bezels (No way..)\nBurn his ass up like a sweater\nHave a nigga leaving on the stretcher\nPussy nigga know ain't no limit\nIf you tryna get it gotta spend it\nYSL counting plenty digits\nMigo graduated from the midgets (Slime!)\n\n[Hook]\nHow the hell that nigga leave the treasure?\nHow the hell that nigga leave the treasure?\nHow the hell that nigga leave the treasure, nigga?\nHow the hell that nigga leave the treasure, nigga?\nHow the hell that nigga leave the treasure, nigga? Aye!", "image": "https://images.rapgenius.com/5e2105efce557c12be4b06e7cd2d7ba6.608x608x1.jpg"}], "artist": "Young Thug"}