{"songs": [{"title": "You Don’t Care", "album": null, "year": "2019-06-06", "lyrics": "[Intro]\n(Billboard Hitmakers) Thugger, ayy\nYeah, yeah yeah yeah, hey\nShe act like she don't care about me\n\n[Chorus]\nRiding past a nigga, flying past you, baby\nI'm fly and flashy baby, my diamonds dancing, baby\nI just thought y'all should know, I'ma sprinkle cherries on the top\nI'm gettin' high like I'm Bob Marley\nI'm just tryna be creative and you don't care about me\nI got a bitch [?] standin' 'round in, hey\n'Cause you act like you don't care about me\nAnd you act like you don't care at all\n\n[Verse 1]\nSo I'ma, skeet off in a [?] and I'm too\nHigh to give a damn and I'm too\nFly to give a damn, yeah I'm high\nI don't give a damn, yeah I'm from a\nPlace like Amsterdam\nI just got some, head in Rotterdam\nI just got a lawsuit from my old manager\nLook at my whole clan tryna sue the man\nMight go get a Bentley, might go sip a four\nMight go get the Lamb' off the showroom floor\nI just bought a Bentley, mark set, let's go\nI just do my thing and these niggas know\nI just got a spot with [?], last year ain't have a pot to piss in\nI'ma see a psychiatrist, ain't gon' ever win unless I take some Ritalin\nNo time to fuss, no fight\nI'm at the best place of my life\nI just wanna wild out today\nI'm just ready to wild out today\nChillin' at the shop all day\nBubblegum the new Kanyes\nI'ma gon' and do what she say\nI'ma gon' and give her space, hey hey\n\n[Chorus]\nRiding past a nigga, flying past you, baby\nI'm fly and flashy baby, my diamonds dancing, baby\nI just thought y'all should know, I'ma sprinkle cherries on the top\nI'm gettin' high like I'm Bob Marley\nI'm just tryna be creative and you don't care about me\nI got a bitch [?] standin' 'round in, hey\n'Cause you act like you don't care about me\nAnd you act like you don't care at all\n\n[Verse 2]\nYou don't care about nothin' a nigga tell you, do you?\nI can see it in your eyes baby, you ain't true to name a blue, ain't you?\nYou a nasty bitch, you a dirty dog, you a slut bucket, ain't you?\nYou'll do it real good with my homie for a piggy blanket, ain't you?\nYou a real dog, you the real cause, you the real problem\nYou a nasty broad, you a dick hog, I'm a problem solver, ha\nI was 'bout to call, I was pissed off, I'm on crystal, ha\nAin't no tellin' what I'm 'bout to say, man, I'm too ticked off, uh\nHow could you care about you when you don't care about me?\nHow could you say you in love when you a low key freak?\nHow could you know about that and you don't know about this?\nHow could you do that to a G? I took your ass off E\nWho let this bitch up off the leash? I think somebody need to tame her\nHow could you say you owe me? You see me million dollar planking\nI stayed inside the house with you like you had something on our ankle\nLike you done fucked around and stanked 'em\nLet's play Big bank take lil' bank, uh\n\n[Pre-Chorus]\nI told you, I told you, told you, told you\nI showed you, I showed you, showed you, showed you\nI owe you, I owe you, owe you, owe you\nIf I only knew, oh yeah, I do\n\n[Chorus]\nRiding past a nigga, flying past you, baby\nI'm fly and flashy baby, my diamonds dancing, baby\nI just thought y'all should know, I'ma sprinkle cherries on the top\nI'm gettin' high like I'm Bob Marley\nI'm just tryna be creative and you don't care about me\nI got a bitch [?] standin' 'round in, hey\n'Cause you act like you don't care about me\nAnd you act like you don't care at all\n\n[Outro]\nHey, don't care, don't care\nI see it on your face, baby, you don't care, don't care\nI know what to do, get high 'til I don't care, don't care\nYeah, I think I'm high to the point I don't care, don't care\nGive a damn no more, [?]\nGive a damn no more, yeah, [?]\nMade that bitch, I learned the hard way\nJust dropped that the smart way\nYou a fool, you a fool, ay\nYou a fool, you a fool, ay\nYou a fool, you a fool, yeah, ay\nYou a fool, you a foolie, yeah\nBuy the bitch a new toolie, ay\nSlatt\nAhhhh", "image": "https://images.genius.com/717461618e785def35d07de6484b7ad4.1000x1000x1.png"}], "artist": "Young Thug"}