{"songs": [{"title": "Penitentiary", "album": "War & Peace Vol. 1 (The War Disc)", "year": "1998-11-17", "lyrics": "\"Attention all nigga row's and nigga hoe's\nWe've decided to rob this motherfucker the legal way\nNot subjecting ourselves to become properly owned stock\nIn the penal system. In the justice system\"\n\nPenitentiary, I hear you calling me (x4)\n\n[Verse 1]\nAs the world turns, it burns while it's spinning\nComing to a fucked-up ending\nI can't wait till the day everything in the hood is straight\nAnd I can hit the pearly gates\nUntil then, the pen is unfair\nSlave ships in the middle of nowhere (mama)\nI lets my goddamn hair grow (mama)\nBellin' in court, lookin' like a scarecrow\nOn Capital Hill, they done passed a bill\nComing at me with a fucked-up deal (what)\nThe judge gave me a 'L'\nBut y'all can't tell\nI wait and cry in my cell\nConvicted negro, superhero\nSpeaker of the house\nHate the lyrics in my mouth\nBitches in the south showin' ass (mmm)\nMix-a-Lot, got hoes puttin titties on the glass\nWe blast in the west for example\nAnd rap about this shit over funkadelic samples\nYo' babies see me kill a fool on TV (West side!)\nAnd straight call me a G\n\n[Hook 1]\nPenitentiary, I hear you calling me\nPenitentiary, I hear you calling me\nThinkin' of illegal ways to get paid\nBut it ain't shit, got to be legit\n\n[Hook 2]\nIn South-central L.A\nYou can buy your game from the C.I.A., hey-hey\nIn South-central L.A\nYou can buy your game from the C.I.A. baby\n\n[Hook 1]\n\n[Verse 2]\nWhen the evil outweighs the good\nAnd you only give a fuck about the bucks\nThe Earth will self-destruct (bitch!)\nFuck the ozone layer, bitch I'm a playa (bitch!)\nPlus we got a black mayor\nI get sex when I show flex (Booom!)\nPort Bay Rolex (Booom!)\nWhich ho is next?\nTreat you like a piece of meat, not a mate\nCalling you a ho 'cos I'm fucking on the first date\nMy world is a one-mile radius\nI swear every other hood is the shadiest\nCould the Crips and Bloods be all rotten\nWhen the trilateral commission is plottin'?\nWhat you gonna do when the Earth erupts?\nSome niggas gettin' nuts outa styrofoam cups (punk)\nFool you want monster swoll\nBut won't even think about, socking Bob Dole (punk)\nAsshole from the Senate\nHow can you relate to a project tennant?\nMotherfuck you and the Department of Corrections\nTryina' get a section of this west-side connection\n\n[Hook 1] x2\n[Hook 2]\n\nJust because you gotta stay\nYou ain't gotta rot away\nWe gon' come and get you one day\n(repeat until fade)", "image": "https://images.genius.com/9a92bffe36c691d91a9dd7116941cd17.1000x1000x1.jpg"}], "artist": "Ice Cube"}