{"songs": [{"title": "Ol’ Dirty’s Back", "album": "Tales From the Hood (The Soundtrack) ", "year": "1995-05-09", "lyrics": "Intro: Ol Dirty Bastard\n\nSup? Let's go\n(Yo Snoop Dogg! Yo Dre! Yo Too $hort! E-40, and the motherfucking Click!)\nNuff respect to the West coast\n(Duhhn duhhn duhhn)\nYo, Ol Dirty Bastard coming through\nKnow what I'm saying? I got the East coast locked the FUCK down\nHear my SHIT, nigga! (Dirty dirty dirty, Brooklyn!)\n\nVerse One: 12 O'Clock\n\nShit is crazy real in the field\nI watched niggas blood get spilled over five dollar bills\nAnd major drug deals on the real\nSee a nigga get meals and his bitch get him killed\nIn this American dream to get some cream\nYou're ownin a Beem, and your face in magazines\n12 O'Clock maintains in the game\nBring the Pain, to smokin' meth in Maine\nIt's not all about the fame, silly ass dames\nGet a gold record and you change\nAnd for the niggas sellin cocaine, you're too blame\nBlack people lives ain't the same\nAnd that's the Tale in my Hood\nNiggas is up to no good, you better watch em in them hoods\n\nVerse Two: Ol Dirty Bastard\n\nI always thought livin life was easy\nGo to school, get a job, yo it couldn't be me\nSo instead, I played my bed\nMy momma got fed, and now a nigga livin with a dread\nMy best fuckin friend, knew him since ten\nNigga feed me CREAM, let me whip the Benz\nHouses all over Texas, lightning gold Lexus\nHe had enough respect to dress this\nExpensive Tim suits, girl wearin fly Gucci boots\nPut me on like POOK!\nEvery morning that I awake\nTen G's in my fuckin face, combination to the safe!\nSon run the state, carrying coke by the weight\nNigga put pounds in the weed gate\nAnd it's ran by Ol Dirty\n12 O'Clock, my little brother, he keeps it dirty\nDirty\n\n[Fuck all that motherfucking drug selling shit\nI wanna see some motherfucking lyrics\nI wanna hear some motherfucking lyrics\nWhat up nigga, what?]\n\nHahahahahahahahahahaha\nI got you nigga\n\nVerse Three: 12 O'Clock, Ol Dirty Bastard\n\nI'll rip mics on site you know the type\nNew Jack, this is my City like Wesley Snipes\nGo fly a kite or somethin, make some muffins\nI come up bad in the town like Charles Bronson\nNow set your speaker and I'll do you for that reason\n12 is no joke I bring wreck through the seasons\nSolomon, contend, many more but just when\nThat Joker act you can save for Jack Nicholson\n\nOne two and three, through your rap fatigue\nIn the MC world, is a minor league\nWhat you speak, you swear it's unique\nIt's just a peek, physique, of an old antique\nDon't expect a project, then it's bound to freeze\nYour whole head is stuck and stiff\nNext Siamese, I never liked rhymes\nThat's incomplete, then again obsolete\nI shall repeat, there's an Easy Street\nFor niggas who earned, then learn your sojourn\nThen you return, as an intelligent, positive, messanger\nNot an experiment negative Lucifer\nWith a tittling gloss of crafted skin\nNothing like spring sauce, of the true origin\nWho would score, the wizard of war\nCame in best man was a god damn dinosaur\nNo more jungle-like living, from the Blue Lagoon\nIt's not an Animal House, National loon Lampoon\nIf you understand the what when\nWhy how, are you fellas who exempt\nOr to disallow, a fresh MC, that will knock you down\nI gets dizzy spellbound like a merry-go-round\nWhile I'm freaking, shall I expose\nYou take a subject, and then you decompose...", "image": "https://images.genius.com/48b40c11e7dd7baa898c12f5b5537e98.1000x1000x1.jpg"}], "artist": "Ol’ Dirty Bastard"}