{"songs": [{"title": "I Shot Ya (Remix)", "album": "Mr. Smith", "year": "1995-11-21", "lyrics": "[Produced by Trackmasters]\n\n[Intro: Keith Murray]\nHa!\nYeah, L.O.D\nKeith Murray, Def Squad\nMister, mister, mister, Mister Smith\nYou want a hit?\nGive me a hour plus a pen and a pad\n\n[Verse 1: Keith Murray]\nI'm here to make a dollar out of fifteen cents\nAnd let my balls hang like I'm on a toilet taking a shit\nMy style is all that and a big bag of chips with the dip\nFuck all that sensuous shit\nI represent intellectual violence\nAnd leave your clique holier than the Ten Commandments\nLike Redman, I shift with the ruck\nIf your if was a spliff, we'd be all fucked up (Word up)\nNo need to ask you who is he, son I get busy\nScuff my Timbs on the boulevard on many rough cities\n(Chicago, LA, any of 'em) I'll have to Norman Bate you\nI love ta hate you cause you's a freak by nature\nCan't wait to face ya, mutilate ya\nDrink your style down straight with no chaser\nMy verbal combat's like a mini-Mac to your back\nAs soon as one of you niggas try to over react\nThe L.O.D. love good confrontation or vamp\nBreak your concentration, murder your camp\nFor the jealous, overzealous, we fellas\nBlow the the spot like Branford Marsalis\nNiggas coming through and acting wild\nY'all commercial niggas better have a coke and a smile\nI shot ya!\n\n[Verse 2: Prodigy]\nI conversate with many men, it's time to begin again\nForgot what I already knew, ayo, you hear me friend?\nIlluminati want my mind, soul and my body\nSecret society, trying to keep they eye on me\nBut I'ma stay incogni', in places they can't find me\nMake my moves strategically, the G.O.D\nIt's sorta similar but iller than a chess player\nI use my thinker, it coincides with my blinker\nWhile you wondered what we saying on the records real\nYeah, you mothafuckin' right kid you know the deal\nMy Mobb is Infamous just like the fuckin' title read\nYou get back slapped so hard, make ya nose bleed\nSome def kids feeling guilty 'bout the space shit\nThe truth hurts baby girl so just face it (alright)\nBut anyway, back on the real side of things\nMy niggas sling cracks and wear fat diamond rings\nNot only is it inside the songs that we sing\nEverything is real not just a song that we sing\nFrom my life to the paper, very accurately\nGive you all of my two so maybe you can three\nProdigy will forever will S-H-I-N-E\nMy shit attract millions like the moon attract the sea\nHow dare you ever in your life walk past me\nWithout acknowledging this man as G-O-D\nI shot you faggot ass\n\n[Verse 3: Fat Joe]\nNow who the fuck you think you talking to\nI pay dues, I spray crews\nLook, I'm Joey Crack, motherfuckers be like, \"He's bad news\"\nRunnin this racket, from New York to Montego\nSlaughtering people, bring a ton of keys from Puerto Rico\nI'd rather be feared than loved because the fear lasts longer\nThese bitch-ass niggas know we stronger\nThan these weaklings, seeking for respect that ain't there\nKnuckleheads beware, there's mad tension in the air\nTommy guns for fun, shotties for block parties\nWhile fresh lead heats up your insides like a fifth of Bacardi\nCall the ambulette, this man's wet\nBullets cut him down from the root up just like a Gillette\nRazor, which I keep hidden in my oral\nReady to spat out at any adult that wants to quarrel\nThese feds want me for some tax evasion\nMad at the fact that somebody's getting lucci that's not Caucasian\nBullets be blazing through these streets filled with torture\nJoey Crack a.k.a. Keyser Söze\n\n[Verse 4: Foxy Brown]\nThug niggas give they minks to chinks, tore down\nWe sip drinks, rockin' minks, flashin' rings and things\nFrontin' hardcore deep inside the Jeep, mackin'\nDoin' my thing, fly nigga, you a Scarface king\nBitches grab ya ta-ta's, get them niggas for they cheddar\nFuck it, Gucci sweaters and Armani leathers\nFlossin' rocks like the size of Fort Knox\nFour carats, the ice rocks, pussy bangin' like Versace locs pops\nWant ta the creep, on the light raw ass cheeks\nI'm sexin' raw dog without protection, disease infested, uh!\nItaliano got the Lucciano\nI gets down, fuckin' with Brown Fox, extra keys to the drop\nBoo, I'm jingling, baby\nI got crazy Dominicans who pay me to lay low, I play slow\nRoll with The Firm, Mafioso crime kingpin\nIt all real nigga, what the deal? I shot ya\n\n[Verse 5: LL Cool J]\nWhat the fuck, I thought I conquered the world?\nCrushed Moe Dee, Hammer, and Ice-T's girl\nBut still, niggas want to instigate shit\nI'll battle any nigga in the rap game quick\nName the spot, I make it hot for you bitches\nFemale rappers too, I don't give a fuck, boo\nWord, I'm here to crush all my peers\nRhymes of the month in The Source for twenty years\nNiggas scared, I'm detrimental to your mental state\nI use my presidential Rolex to be the bait\nNiggas fight, Glock cocked, ya temple gets fucked\nMCs that fuck with LL, they gets bucked\nThat's real, what's up with that I Shot Ya deal?\nLight shit, niggas slip, now how the bullet feel?\nNew York appeal, in L.A. they gang bang\nBut if you touch a mic, your motherfuckin ass hang\nThat's facts, niggas don't receive no type of slack\n'Cause if they do, they ass is always runnin' back\nNot this time, but next time, I'ma name names\nLL, shitting from on top of the game\nI shot ya!", "image": "https://images.genius.com/aba57f7703e47dacfcd5243398922d01.500x500x1.jpg"}], "artist": "LL Cool J"}