{"songs": [{"title": "Dat Ass (Remix)", "album": null, "year": "2015-04-06", "lyrics": "[Verse 1: Earl Sweatshirt (Sly Tendencies)]\n\nJuicebox, tank top, tube socks\nDude stop, forehead shiny like a new Glock\nTwo shots fired at the Excursion we were swervin' in\nAll-purpose verses with a passion for servin' kids\nEmpty out your purses on an immature crime spree\nEyin' up the nurses with some gloves that read \"I squeeze\"\nWho the fuck said to speak, Mr. Me-Is-Siamese?\nEven Christ said \"Christ, he flows quite nicely\"\nHypebeast's highly likely to bite me\nAnd try to high five me, but I just give them high threes\nCause y'all don't get two, touch me, I'm the shit\nSue me, if you got an issue, grab a tissue\nMediocrity is odd to me\nAss as far as ya eyes can see. Who the best? They holla me\nNombre, Ho-lay shit, I don't spit crack, I spit cocaine crisp\nI ain't fuckin' with it if it's no payment\n'Cause everyone knows paid dues don't pay rent\nI'm dope like the coke that I'm laced with\nDreams what I'm chasin', flow hot it's chafin'\nThis is why I'm hot? No, that is why I'm blazin'\nDilla jacked Nick, I am shinin' like the diamond that I'm draped in\nBut I don't wear jewelery, it's HUF over Louis V\nExcuse the endurance miss, this critic thing is new to me\n\n[Verse 2: Big L]\n\nFuck them other cats I'm running with my own wolfpack\nKeep frontin' like you's a thug and get your dome pushed back\nCause you don't get down, that tough shit you talk is profound, you's a clown\nFuck around, come uptown and get found\nI keep a pocket full, none of you niggas can touch my funds\nI don't fight no more, all I do is bust my guns\nWhile you home relaxed, I'm squeezing macs\nBustin' off caps, those coward cats, will go to platinum plaques get taxed\nAnd I do jooks and sling pies to make cream rise\nIt's all about these green guys, front your whole team dies\nHow I'm, livin' so far swell you can't scar L\nHeaded a cartel selling more cakes than Carvel\nAnd I'm, labeled a kind thug police got my line bugged\nHope I see a grave from old age and not a nine slug\nI'm quick to bust a mean nut in some teen slut\nBig L is clean-cut with more jewels than King Tut", "image": "https://images.genius.com/6abe116b40a921476ff1094726c8d1a8.608x608x1.jpg"}], "artist": "Earl Sweatshirt"}