{"songs": [{"title": "I’m the Man", "album": "The Come Up Vol. 1 Mixtape", "year": "2007-05-04", "lyrics": "[Intro]\nHe gonna have the nerve to fucking tell me niggas from the south can’t spit?\nBitch I’ll smack your dumb ass\n(Fayettenam what up? Carolina what up?)\nStupid ass mother fuckers (New York, what up? Queens)\nI'ma quit talking shit and about show y’all\nI told y’all niggas that I’m getting my bread and going home\nI'ma show you all stupid ass motherfuckers (Coming soon, nigga)\nDumb ass niggas\n\n[Verse 1]\nThe heir to the throne\nSouth nigga bred to the bone\nBut haters say he fled from his home (Please)\nNow picture that, I was 18 with million dollar dreams (Yeah)\nMoved to Jamaica Queens, like Prince Akeem\nBut ain’t looking for no queen, (nah)\nCame to get my c.r.e.a.m. (yup)\nCity on my back, I just lift my wings, I’m fly\nYou niggas on my dick, why lie?\nThought them niggas from the south couldn’t spit, voilà\nI’m here. humble out of respect, not fear\nSo please be clear, nigga please beware\nI’m a motherfucking monster, B.S. me? (Nah)\nNo, my hand game like fucking PSP\nNow pop the champagne, money is coming soon\nMy dick do the damn thing, honey it’s cumming soon\nShe jerking, bend her over, now she hurting\nLiving reckless got me thinking of death, look how she flirting\nWell, fuck that bitch, man a nigga tryna breathe (Yeah)\nSome of these niggas be tryna dick her down and leave\nRest in peace, y'all boys living too fast\nCaught up in the cash, and got shot up in a flash\nVille niggas don’t play\nWhen it comes to that money, think real niggas won’t spray?\nMid-day when it’s sunny, they kill niggas broad day\nOn some old new jack shit\nThis rap shit is like tag nigga you not it, so run\n\n[Chorus]\nHa ha ah\nI’m the man, ha ha ha, yeah, hey\nI’m the man\nI’m the man, (I told y'all niggas)\nI’m the man\n\n[Verse 2]\nYeah, uh\nThey say I act like I’m the man, 'cause motherfucker I am\nNiggas study my style, I should be giving exams\nDamn boy I'm so flamboyant with the ensemble\nPolo jacket, polo tee, what a fine combo\nAnd I’m the man, now understand a nigga bossin’ (Yeah)\nScheming on that drop top CL but it’s costing (Yeah)\nLong term plans for the fam, we’ll be golfing\nNever catch a nigga double-crossing, unless i’m flossing (Woo)\nIn the streets niggas peaceful until you force em'\nTo quarter back them bullet passes, you could Randy Moss ‘em\nGoddamn you niggas got handled\nNiggas only publishing, my style got sampled\nSo I switched like a thick bitch with some heels on\nI seen a nigga get popped, I feel for ‘em\nI know who did it, but you think I’m finna squeal on him?\nShout out to R.J. Hill I would kill for him\nThat’s word, nigga observe my genius\nE&J sipping got a nigga straight leaning\nMy DNA dripping while your girl stay drinking (Haha)\nI told y’all I’m the man, what the fuck y'all niggas thinking?\n\n[Chorus]\nHa ha ah\nI’m the man, ha ha ha, yeah, hey\nI’m the man\nI’m the man, (I told y'all niggas)\nI’m the man\n\n[Outro]\nYea\nFirst and foremost, Fayettenam what’s good?\nCarolina, what up? Bull city, Raleigh, Charlotte, Salem\nGreensboro, Wilmington, nigga\nEverywhere dog, I’m reppin' from long distance, man\nI told y’all boy, I’m bout to get this money and come home right quick\nY’all niggas still see me tho, you think I’m still there; you ain’t even know I’m gone\nBack so much, nigga\nI hear you all little niggas talking, nigga\nPrince of the city, nigga\nPrince of the south, nigga, holla at me\nYa know? Heir to the throne, bitch", "image": "https://images.genius.com/bda451f623edd51bf1dcc17564bd3e70.501x501x1.jpg"}], "artist": "J. Cole"}