{"songs": [{"title": "What Else", "album": "Tom Clancy’s Ghost Recon: Wildlands (Original Soundtrack) ", "year": "2017-03-07", "lyrics": "[Verse 1]\nIn this moment, erase my fears\nOnly time for action, no time for tears\nAll these years been preparin' for right now\nWhen they see the AK barrel, they pipe down\nWhite sheets and nightgowns, sniffin' that blood hounds\nSoldier, swallowed my own sweat and won't drown\nMy squad is thorough, my infiltry fifth ward\nScars on faces, long way from a ghetto boy\nI'm built for this, I killed for this\nPut everythin' on the line, blood spilled for this\nThey consider it madness, grew up an ignorant bastard\nIf it wasn't 'bout guns, I was skippin' them classes\nThickest assassin, pull it the fastest\nCock it and blast it, runnin' my racket\nPut 'em all in the casket\nStrikin' them matches, wrap you in plastic\nTurn you to ashes\nCall me for duty and I'll murder the masses\n\n[Hook]\nCan I live? Can I breathe? Or will I die with this flag on my sleeve?\nWhat else, what else\nIs it war? Is it pain? Will I survive 'til the end of the game? What else, what else\n\n[Verse 2]\nI'm on a suicide mission with pistols, I won't miss you\nYou with me, I'm with you, if not, the slug gon' hit you\nRip through your tissue, I don't think the world gon' miss you\nFull magazine, 15 covers, the next issue\nGhost, not the luxury car, I'm talkin' hollows\nSub-missiles flyin' through the sky\nYou can find me in the shark tank, topped off, loadin' the scars\nTramplin' dead bodies in the field, full of blood\nNo remorse, of course we gon' be lit\nWe soldiers, trained to murder and won't miss\nNo time to piss, the realest in the midst\nLost in foreign land and we eat where we shit\nLong machete arms, get chopped up in the jungle\nToday could be your last, to hard to remain humble\nDie by yourself 'cause you was born on your own\nSome of the greatest kings got murdered on they thrones\n\n[Hook]\nCan I live? Can I breathe? Or will I die with this flag on my sleeve?\nWhat else, what else\nIs it war? Is it pain? Will I survive 'til the end of the game? What else, what else", "image": "https://images.genius.com/7ef938baba0c81d078dabbd1c96bd766.450x450x1.jpg"}], "artist": "The Game"}