{"songs": [{"title": "Investigative Reports", "album": "Liquid Swords", "year": "1995-11-07", "lyrics": "[Intro: GZA]\nHere we go, come on\n\n[Excerpt from TV report]\n\"A battle-A battle was fought, in Brooklyn...\"\n\"Hessian Soldiers killed 3,000 men; much of the fighting took place in what is now Prospect Park in Green-Wood Cemetery as well as the Park Slope and Gowanus neighborhoods.\"\n\"This was the first battle of America.\"\n\n[Interlude: U-God]\nRugged rhymsters, crooked crimesters\nDime droppers, Twenty-five-to-lifers\nBackstabbers, low blowers\nIllegal... cocaine growers\nStarvation, profanity\nAnxiety, brothers trying me\nGun slingers, dead ringers\n\n[Verse 1: Raekwon]\nYo, my slang's out of this world\nMix collaboration man, little man and his girl\nWay of life got me thinking, plus I'm analyzing young\nYouths on roofs, you know, three time felony brutes\nRoll together, tropical trees puff, whatever\nYo we could go run up on, kids for leathers\nWhat drug? Faculties bubble keys for G's\nCream flow like seven seas, hit chicks Guyanese\nWord up, hold your head before you fall out\nThe morgue route, the devil want that\nLet's get my niggas locked all out\nChange for better, that be my only vendetta\nWith life, feed your seed right, he's breathing indeed right\nChef, remarkable, sparkable, raps and tackable gats\nNever get jacked, see ya then move black\nParadise trife, plush with much ice\nGetting nice, laying back, sleep all my life; word up!\n\n[Excerpt from TV report]\n\"The battle of Brooklyn depicted was the bloodiest\nClash of the American revolution. Soldiers killed\n3,000 men, much of the fighting took place in what is now...\"\n\n[Hook: U-God]\nCrack patients, dime smokers\nVial carriers, mocha tokers\nBurnt buildings, brothers building\nSave the children, investigative reports!\n\n[Verse 2: GZA]\nCalling all cars, calling all cars! Ghetto\nPsychos, armed and dangerous, leaving mad scars\nOn those who are found bound, gagged and shot\nWhen they blast the spot, victims took off like astronauts\nGet with this, even your best can't\nCome on down, you're the next contestant!\nGet your pockets dug from all your Chemical Bank ends\nCaught him at the red light – on Putnam Avenue and Franklin\nThey used to heat up the cipher with a shot that was hyper\nThan your average JFK sniper\nHe just came home from Spofford\nRolling like Kaufman, and laid that ass out like carpet\nStop the stuttering boy, save complaints for the five-oh\nThen praise the God – chk-a-chk POW!\nThey release shots and premeditate to grab\nAnd then they jet back to the lab\nAnd then remain in Shaolin, an endangered island\nWhere shorties lose blood by the gallons\n\n[Excerpt from TV report]\n\"Have integrated a number of corrupt cops, judges\n...into high-level positions, to insure the continued\nSuccess of the drug smuggling and money laundering operations\"\n\n[Hook: U-God]\nCrack patients, dime smokers\nVial carriers, mocha tokers\nBurnt buildings, brothers building\nSave the children, investigative reports!\n\n[Verse 3: Ghostface Killah]\nYo, I grab the pen for revenge and let loose, see\nLike Muslims, standing on the block, rocking a kufi\nThe hundred-dollar kick rocking kid's back for more\nStarting gun wars, with black Reeboks and Velours\nJungle way of life, living villain\nPacked with visions, copywritten\nThrowing bread to pigeons, Christ has risen\nKing Elegant, slang master, jack expensive noodle hats\nIn sixty-nine, old timers time that brothers shot craps\nThe baggy blue Guess jeans, pull strings off in Palm Springs\nI'm locked in the bing, Rocky ring labelled rap king\nThe corner emperor – the golden thieves play the benches\nRednecks be hanging big niggas down in Memphis\nBack in Now-Y, hit the bull's eye with loaded nines\nLife is like Tarzan, swinging from a thin vine\nShatter dreams, then mirrors don't need a press spirals\nAim at the white shadows with big barrels\nOf Moet-ers, the bald headers, milk and Armarettas\nWho fear none, crushing all personal vendettas, yo\nThey use guns while we angrily shot arrows\nYou better keep your eye on the sparrow\n\n[Interlude: U-God]\nRugged rhymsters, crooked crimesters\nDime droppers, Twenty-five-to-lifers\nBackstabbers, low blowers\nIllegal... cocaine growers\nStarvation, profanity\nAnxiety, brothers trying me\nGun slingers, dead ringers\n\n[Excerpt from TV report]\n\"Have integrated a number of corrupt cops, judges and lawyers\nInto high-level positions – to insure the continued success\nOf the drug smuggling and money laundering operations\"", "image": "https://images.genius.com/70ce905afa9b4ece8c671d3ed66e1a51.500x500x1.jpg"}], "artist": "GZA"}