{"songs": [{"title": "Loose Cannons", "album": "Compton", "year": "2015-08-07", "lyrics": "[Produced by Dr. Dre & Focus...]\n\n[Intro: Dr. Dre]\nAll my life, I've been down to ride\nSo I kept it real and I stayed alive with no compromise\nAnd I fantasize about the baddest bitch and what between her thighs\nThen I woke up and realized this is my motherfuckin' real life\n\n[Verse 1: Dr. Dre]\nYou know where the fuck I'm from\nFrom that muthafuckin' legendary\nFrom the city where them niggas load clips in fast\nAnd get stabbed at homeroom should've skipped that class\nShit will never change on the West Side\nJack your shit, take your car for a test drive (Ah shit)\nGangbangin' out the window hollering let's ride\nGotta keep a tec by the bedside\nThese niggas don't know my life\nAll this pain and what I sacrificed\nAnd all my niggas that lost their life\nYou never die, you never die\nI'm in that motherfuckin' one for a minute now\nAll y'all lil' niggas need to simmer down\nShut the fuck up, I'm the one that's killing now\nTake a look who on top of the pinnacle\n\n[Verse 2: Cold 187um]\nCold 187um, know it's been a minute since you heard from us\nStill we're untouchable murderers\nR.I.P to KMG, I'm still gonna murder\nAnd don't give a fuck where the body at\nYou do too much talkin' I walk in the building\nI just give a fuck where the money at\nI'm Jordan and Jackson, the coach and the player\nThey trust me it's only just one of them\nI'm callin' them shots and makin' the plays\nIf you get a trade, better fuck with him\nI keep it gangsta, y'all testin' my patience\nGot me feelin' so anxious, I be lookin' so facetious\nFeel like running a capre\n\n[Interlude: Xzibit & Dr. Dre]\nWait, hold up I got next! What up, X?\n\n[Verse 3: Xzibit]\nSpent my birthday in Dubai\nSkyrise surprise and I'm dressed like a spy\nBlack tux, on you fucks\nAnd guess what? I'm ready to (blow, yo, oh no)\nI hang that 6-2 sideways\nPissin' off the neighbors, scrapin', bumpin' in the driveway\nCube gave me the pistol\nTold me to kill at will and (blow, yo, oh no)\n(I couldn't give a fuck) Literally\nCashed out just livin' to me\nBlast it like a Kennedy beat\nWanna get rid of 'em? Send them to me\nWhile I'm just over here cozy holdin' these double D's\nShe book smart with pornographic abilities\n(Well I don't know what you know but I know I got that shit)\nThese motherfuckers still talking? Fuck 'em!\nThat's why they bring X and the guillotine out\nTo stop these bitch niggas from runnin' their mouth\n(It's bout time somebody said something)\n\n[Verse 4: Sly Pyper]\nOne in the glove, one in the clip, one in the chamber\nOne on the dash, one in the stash, ready for danger\nI'm ready to die, I can't control this fuckin' anger\nAh shit, somebody better fuckin' stop me\nCause I'm a loose cannon that can't stand myself\nI'm bad for my own health\nYou niggas really think I give a fuck about somebody else\n(Fuck 'em)\nI swear to God, I'mma do it, back the fuck up I'mma do it\nI swear to God, I'mma lose it\n\n[Outro]\nBaby, baby! What the fuck are you doing? Put the gun down! Really? Are you doin' this shit to me again?\nOh my God\nYou is so fucked up for this\nFuck It\n*Gun cocks*\nWait, wait, wait, wait! Okay, I'm sorry! What the fuck? Don't point the fuckin' gun at me! Okay, put the fuckin' gun down! No, no, no, no!!\n*Gun shot*\nAlright, I got the legs\nMan this bitch is heavy\nYou gotta get under her armpits, man\nShut the fuck up, I got it\nWhat the, what the fuck did you guys do?\nIt was this nigga\nMe?\nShit, matter of fact you know what? You gon' dig the fuckin' hole this time\nI don't give a fuck, like it's the first fuckin' hole I ever dug\nWho the fuck is that?\nI don't know, ask fuckin' Charles Manson right here\nOh, oh, you're tryna be funny? You're really fuckin' tryna be funny right now?\nShh, shh, shut your ass up\nThis is bad. This is, this is fucking bad man. Fuck it, let's start digging", "image": "https://images.genius.com/19804ba7a9b6ceb36d0158950514927a.1000x1000x1.jpg"}], "artist": "Dr. Dre"}