{"songs": [{"title": "Neva Had Shit", "album": "Murder Was the Case", "year": "2009-05-05", "lyrics": "[Intro]\nYup! Yup!\nGucci Mane in this motherfucker (Gucci Gucci)\nMy nigga Zo' on the track (my nigga Zo')\nThat real shit, that real shit\n\n[Hook: repeat 2X]\nI'm a hood rich nigga, I ain't never had shit\nI really ain't shit; niggas talkin 'bout me\nBut they really ain't shit, they ain't said shit\nIt don't make dollars, it don't make cents/sense\n\n[Gucci Mane]\nI ain't never had shit nigga that's the truth\nRich kids in the school used to jones my shoes\nName stayed on the board, fo' checks in chalk\nIn detention cause the teacher say that we can't talk\nCar so ragged that my momma got that I just walk\nI wish I had a nickel for every fight I fought\nStealin candy out the sto' like I can't get caught\nJust a lil' bad black boy, it ain't my fault\nAfter school snack syrup and fo' pieces of bread\nGranddaddy why yo' eyes so God damn red?\n\"Got a real soft ass and a hard-ass head\nBetter mind your fuckin manners boy,\" that's what he said\n\n[Hook]\n\n[Gucci Mane]\nI moved to East Atlanta at the age of 9\nReal cold winter, 1989\nMy brother good at ball, I can't play no sports\nThey won't let you pack a tool on the b-ball court\nCluster Ave, Monty Paul, where my daddy now?\nThings goin alright, we a family now\nGot the dopeman Nikes and the Starter coat\nOnly nigga in school with the dopeman rope\nPull the joint two times, man I'm high already\nI like that girl with them braids and them high-top Chevys\nGot that bump for stick-up, Starter and the big boy chest\nTried to take it on the train but I just couldn't let him\n\n[Hook]\n\n[Gucci Mane]\n14 gettin drunk at a house party\nThey locked me up, they must have hid a half a ounce on me\nMomma mad as a mother', daddy let him be\nGucci Mane, raised me to be a straight up G\nNow my daddy hustle hard, but he love sum liquor\nAnd my momma wanna leave him but she love the nigga\nEverything kinda changed when I turned 16\nGot the old school Regal with the chrome back rings\nLike a newborn baby, man that bitch clean\nBut the motor fucked up and the transmission\nAnd it's knockin down the street with the 415's\nIn Mackmile parkin lot, stright whipping\nAnd I'm Bankhead bouncin, fo' hoes want me\nHit the half and give me two dimes for 15\nAnd my mind's on gettin rich by all means\nIn the trap, cause this rap shit was just my dream\n\n[Hook]", "image": "https://images.genius.com/599d6d3758d41c87831fae654c5caf62.499x500x1.jpg"}], "artist": "Gucci Mane"}