{"songs": [{"title": "Heartbeat (Oliver Remix)", "album": null, "year": "2011-11-15", "lyrics": "I wanted you to know\nThat I am ready to go\nHeartbeat, my heartbeat\nI wanted you to know\nWhenever you are around\nCan't speak, I can't speak\n\nI wanted you to know\nThat I am ready to go\nHeartbeat, my heartbeat\nI wanted you to know\nWhenever you are around\nCan't speak, I can't speak\n\nI know what your boy like\nSkinny tie and a cuff tight\nHe go and make breakfast\nYou walk around naked\n\nI might just text you\nTurn your phone over, when it's all over\nNo settling down, my text go to your screen\nYou know better than that\n\nI come around when you least expect me\nI'm sitting at the bar when your glass is empty\nYou thinking that the songs coming on to tempt me\nI need to be alone like the way you left me\n\nYou start calling, you start crying\nI come over, I'm inside you\nI can't find you\nThe girl that I once had\nBut the sex that we have isn't half bad\n\nThe text say that \"It's not fair\"\nThat's code for \"He's not here\"\nAnd I'mma flirt with this new girl\nAnd I'mma call if it don't work\n\nSo we fuck till we come to conclusions\nAll the things that we thought we was losing\nI'm ghost and you know this\nThat's why we broke up in the first place\n\n'Cause I wanted you to know\nThat I am ready to go\nHeartbeat, my heartbeat\nI wanted you to know\nWhenever you are around\nCan't speak, I can't speak\n\nI wanted you to know\nThat I am ready to go\nHeartbeat, my heartbeat\nI wanted you to know\nWhenever you are around\nCan't speak, I can't speak\n\nIt's late night Thursday\nI know that you heard me\nBut you don't want the same thing\nWell, two can play that game\n\nSo I'm chilling with my girlfriend\nBut she not my real girlfriend\nShe got a key to my place but\nShe's not my real girlfriend\n\nStupid, so dummy\nSay the wrong thing and wrong girls come runnin'\nI'm paranoid that these girls want something from me\nAnd it's hard to make a dime go one hundred\n\nAnd my dude freakin' out over a worse fate\nShe on time, but she late for they first date\n'Cause he went and tried out all new condoms\nSlipped off in a threesome, good problems?\n\nRight? Wrong\nAskin' him if she gonna play games\nWith the super smash brothers, but none of them you\nI miss the sex when you kiss whenever you through\nSixty-nine is the only dinner for two\n\nI was wrong, but would you have listened to you?\nUh, you were crazy\nI got a heart, but the artichoke\nIs the only thing girls want when you in that smokin' light\n\nI wanted you to know\nThat I am ready to go\nHeartbeat, my heartbeat\nI wanted you to know\nWhenever you are around\nCan't speak, I can't speak\n\nI wanted you to know\nThat I am ready to go\nHeartbeat, my heartbeat\nI wanted you to know\nWhenever you are around\nCan't speak, I can't speak\n\nSo we're done? This the real shit?\nWe used to hold hands like field trips\nI'm a jerk, but your dude is a real dick\nI read his posts on your wall and I feel sick\n\nHe ain't cool, he ball and all that\nBut he just a fake nigga who blog in all caps\nYou couldn't wait to date\nI'm going straight for your thighs like the cake you ate\n\nI give a fuck about the niggas that you say you hate\nYou know that I’m the best when I’m a-ffection-ate\nI'm the best that you had, face it\nJ and Keyshia are related, racist\n\nI give you money, then you burn it, like you Madoff\nShe ain't a killer, but she'd fucking blow your head off\nI know he wondering, \"What the fuck you hiding?\"\nThat we dated like raps about Bin Laden\n\nAyo, fuck this\nAre we dating? Are we fucking?\nAre we best friends? Are we something in between that?\nI wish we never fucked and I mean that\n\nBut not really\nYou say the nastiest shit in bed and it’s fuckin’ awesome", "image": "https://images.genius.com/91362788ed6088d22ac72895642b3e50.1000x1000x1.jpg"}], "artist": "Childish Gambino"}