{"songs": [{"title": "We Do This", "album": "Cocktails", "year": "1995-01-24", "lyrics": "[MC Breed talking]\nHey check this out Short, you know what I'm saying?\nYeah you down here in Oakland, you know what I'm saying?\nAnd I'm all up in Michigan, you know what I'm talking about? I need\nTo get up on my pimpin', you know what I'm talking 'bout? I need to be\nA player nowadays you know what I'm saying? Niggas need to know how\nTo play these hoes you know what I'm saying? On the strength, why don't you put me up on that pimpin' shit?\n\n[Verse 1: Too $hort]\nI do it like the best of the greatest, not the worst\nLike welfare day, can't stop the first of the month\nCan't stop Short Dawg neither\nGot a good ho niggas sure better keep her\n'Cause I'm on the prowl, all the time\nTryin' knock every bitch so they all be mine\nAnd I ain't never, ever gone change my ways\nDrop a few lines, leave a bitch in a daze\nHave her homegirls wonderin' what she do\nFucked around and gave me that pussy too\nI be doin' this shit on a regular basis\nGot bitches everywhere in all kind of places\nI can pull out my little black phone book\nFlip every last page take a long look\nThan pull out a bitch, like a rabbit out a hat\nNigga if I want, I can have it like that\nFuck two or three bitches at the same time\nGrab the microphone sing my rhyme\nAbout them same three bitches that fucked me good\nUs niggas gotta do what the fuck we should when we want to\nI might pass it\nSo get butt naked, shake that ass bitch\nI'm 'bout as real as the stones in my diamond rings\nYou can hate my guts, but I'm gone do these things, bitch\n\n[MC Breed and (Too Short) talking]\nLike that Short? Uhh, can't take shorts just 'cause your name Short\nMatter fact I'ma quit taking shorts man\n(Spit a little game to em Breed)\n\n[Verse 2: MC Breed]\nAhhh why have a nine, when I can have a ten?\nIf she ain't Lickin' up the nuts, while I'm gone holler at her friend\nBitch, ain't no time for me to teach her\nRather have an everyday ho, that umm knows how to treat a nigga\nThinkin' if she ain't lickin me up\nI'm givin' her to Short, 'cause he don't give a fuck\nDo yourself a favor and quit callin' my house\nIf you really don't want this nigga to put this dick in your mouth\nUmm, have you seen my bitch?\nI ain't seen her, but if I do she gets dick\nThat's what I'm givin' her just like that\nTo the front and back, nothing but the bozack\nThe second she get lonely, feelin' she can get her money\nAnd she run to fuck her own ignorant homey\nYou a lost 'cause, yellin' pause when they drop the draws\nIt's entrapment, have yo nigga breakin' nigga laws\nBut it ain't a matter of mentality, it's reality\nOpen your eyes, realize bitches ain't nothin' but a causality\nBut a factor to a nigga wanting fuckin' time\nShe's just an everyday, don't wanna catch her fuckin' mine\nBitch ain't mine, so I thought you knew this\nBitch this is how I do this\n\n[Mc Breed talking]\nShort I know you ain't done explaining, you know what I'm saying?\nPimpin' is an all american sport, you know what I'm saying? A lotta\nPeople and got that down pat yet but uh why don't you explain it out for em\n\n[Verse 3: Too $hort]\nYou can call eight ball in the corner when you shootin' pool\nBut when you play the game of life, ain't no stupid rules\nGotta go for yours at all times\n'Cause if you don't, nigga yours will be mine\nAnd I won't go to bed early, won't sleep too late\nAnd I'll never take a punk ass bitch on a date\nThey say Too Short baby why you talk so bad?\nJust a player ass nigga and that's all I rap about\nBitches, hoes and all that shit\nShe got my number, if she beep me I might call the bitch\nAnd go diggin' in them guts like a gardener\nIf she starts screamin', I'm gone fuck the ho harder\nJust havin' fun with the bitch, as she sprung on my dick\nGuess I'll pull it out and just cum on the bitch\nAnd from New Year's Day to New Year's Eve\nAnd everyday in between I will do these things, I don't stop bitch\n\n[Mc Breed talking]\nHahahaha, that nigga Short, uh uh yeah uh\n\n[Verse 4: MC Breed]\nI like to go to the club mix and mingle\nNigga plays his dick like a 12 inch single\nYeah, so what you bitches wanna do?\nStep to me you gots to do my crew, first\nWhen I rehearse I change rearrange\nMy mentality will bring you to reality\nYou on me like cologne 'til now\nI feel it's time for us to bone\nSo I look and pimp the background\nLook, listen put the bitch on lock down\nYeah you hangin' out with me tonight\nEvery things alright, but a nigga wanna fight\nDamn, that's a real player hater for ya\nFuck it, I'll be waitin' for ya\n\n[Verse 5: Father Dom]\nI'm droppin' lines like a motherfuckin' pimp at this shit\nI'm gettin' hoes out they clothes 'cause I'm good at this shit\nThey callin' me the pussy jammer 'cause I'm breakin' hoes off\nSee I'm paid to be boss, I'm kickin' back at no cost\nNever slackin', just mackin', money stackin' that's my motto\nWith so much game they want to play me like the lotto\nTip the bottle, now I'm drunk as a skunk\nHigh off the dank, but I can't front\nSee I'm never being senile\nSee I'm smooth as a nail on a fingernail file\nKeepin' it wild, but in the meanwhile we the coolest\nSure enough this how we do this\n\n[Verse 6: 2Pac]\nI'm fingerfuckin' with my diamonds\nNow peep a nigga climbin' the charts\nAin't no fear in my heart, I represent it from the start\nIndeed, my momma raised me as a G from birth\nBe a hustler motherfucker 'til I sees my hearse\nNo doubt, I bust a shot for all my niggas in jail\nAll the young black males, that gotta slang yayo\n'Cause it's a hard life nigga only thugs survive\nAin't no love, unless a nigga slangin' drugs or high\nConversations with these bitches on my mobile\nAlways in control and never let these bitches know you\nAnd even though I'm gettin' high, a thug nigga gettin' by\nCatchin' bitches spittin' lies, I'm gettin' mine\nAll day, I puff a blunt and parlay and sometimes if we party\nGettin my dick licked twice\nAnd death to a trick's life, we can pursue this 'til my shit's right\nWent from havin' fantasies, to havin' hoes leave they man for me\nThere is no realer man than me\nThe city of Oaktown laced me with my first case\nWhen them punk police tried to break me\nDidn't think the shit was cute, so I got a lawsuit\nAnd made them punk police buy my Coupe\nThis is how we do this", "image": "https://images.genius.com/4879adf970510dea7fa29b937a49bd43.593x593x1.jpg"}], "artist": "Too $hort"}