{"songs": [{"title": "Hero", "album": "Culdesac", "year": "2010-07-03", "lyrics": "[Intro]\nYeah, yes, I'm on top\nI'm going this hard, and no I won't stop\nYeah, yes, I'm on top\nI'm going this hard, and no I won't stop\n\n[Verse 1]\nCheezy wassup!\nLet me hear you holla, bitch\nActor, writer, rapper, nigga, I do all of it\nLactose tolerant; addicted to cheddar\nAnd I spent it on a jacket, man, I don't know no better\nYeah, it's Childish Gambino, yeah I'm fly as a feather\nYeah, my nigga be suburban but my flow keep it ghetto\nKeep my swagger Polaroid, you can watch it develop\nAin't it funny? In a year, I went from different to special\nYeah I got it together, yeah, I took those chances\nLabels on me like I might cause cancer\nYes a nigga flow went from Camry to Phantom\nI'm just talking real shit, hoping you can handle\nSleeping on the jet like \"lier\" like chandle\nFlyer than a jet women, hoping they can land him\nHow we turn everything to gold that they hand 'em?\nI am just different, that's the only answer\n\n[Hook]\nYeah, yes I'm on top\nI'm going this hard, and no I won't stop\nYeah, yes I'm on top\nI'm going this hard, and no I won't stop\nI'm a hero, I'm a hero\nI'm a hero, I'm a hero\nI'm a hero, I'm a hero\nI'm a hero, I'm a hero, yeah\n\n[Verse 2]\nBack on my grind, nigga I'm a skater\nShe just think I'm fine, nigga you's a hater\nStyle with no name, they just want to label me\nThey should call it what these other niggas are afraid to be\nAPC store walkin' out with eight bags\nYeah I'm killin' paper, call it poppin' tag\nYou ever spend three grand on designer vision\nWhen you should really spent it on your little sis tuition?\nShe played my album when nobody else out there would listen\nI'm comin' harder than these girls that you would swear were pissin'\nDavinci-esque, I'm the real deal\nThe only thing I don't know is how fake feel\nI'm living everything these other niggas lyin' bout\nBitches don't believe me, to prove it to em I fly 'em out\nShe say that I'm her everything, I'm better than those other guys\nI say, \"I'm just a rapper\" She tell me, \"That's a fuckin' lie\"\n\n[Hook]\nYeah, yes I'm on top\nI'm going this hard, and no I won't stop\nYeah, yes I'm on top\nI'm going this hard, and no I won't stop\nI'm a hero, I'm a hero\nI'm a hero, I'm a hero\nI'm a hero, I'm a hero\nI'm a hero, I'm a hero, yeah\n\n[Verse 3]\nThey said me rappin' was like MJ and baseball\nBut that would make me MJ, so motherfuck all of y'all\nTrippin' on this fame shit, drinking like a fuckin fish\nListen to the next track, \"I be on that other shit\"\nYes I sound weird, nigga, take it as a compliment\nGuess who's in the house and representing like a congressman\nAnything I put my mind to I accomplish it\nFrom writing scripts with Tina Fey to laying down the hardest shit\nWho else is doing what I'm doing? No one\nAnd I mean girls too, intended no pun\nI'm on the road son, busy like I'm Bone Thug\nComment left anonymous cause ain't nobody want none\nShe laying in my bed she gotta be bi-curious\nBarf on the track, be amazing and rap-furious\nDamn bloggers argue whether or not I'm serious\nIt's Nas' Illmatic, not Eddie Murphy's Delirious\nGot the limelight, you stupid you think I'm sharing this\nShowing up late, promoters wondering where he is\nGot some nightmares, but failing's gotta be scariest\nBut I would never fail, I'm a hero one of the best there is\n\n[Hook]\nYeah, yes I'm on top\nI'm going this hard, and no I won't stop\nYeah, yes I'm on top\nI'm going this hard, and no I won't stop\nI'm a hero, I'm a hero\nI'm a hero, I'm a hero\nI'm a hero, I'm a hero\nI'm a hero, I'm a hero, yeah", "image": "https://images.genius.com/0c1ef4069c4c1c948f7d4a700c4be323.555x555x1.jpg"}], "artist": "Childish Gambino"}