{"songs": [{"title": "In the Presence of Wolves", "album": null, "year": null, "lyrics": "[Intro: Royce Da 5'9\"]\nYo Tre', you gon' spot me or what?\nLet the games begin\nJah 5'9\", where you at?\nRound one (CHI-CHI GOT THE YAYO!)\nYeah, real niggas on the prowl, HOO!\n\n[Verse 1: Royce Da 5'9\"]\nYou's in the presence of wolves, let go your goods\nI smell your blood in my neck of the woods\nFuck around with us and get found on your neck in the woods\nGive him respect in his hood, don't mess with his crew\nNiggas be, salty as pretzels when I'm in the Lex' and it's movin\nInvadin and steppin in my shoes is a definite intrusion\nI'm exceptionally cool, never expect to be under pressure\nOr rescued, definitely only sweat in the booth\nI'm officially fuckin you up with, nuttin but wit\nA blizzard is frozen, hidden under the clothin\nListen, you lyrical nothin you, you touchin who?\nWhen it was wrote, you spit it, you thought you ripped it you loved it\nIt's like, the sun is above us when the wrist is uncovered\nLike, all you gon' spit is blood or kick is the bucket\nLike, ninety-nine percent of you niggas that rhyme SUCK!\nThis is, the point of no return, I'm stuck\n\n[Verse 2: Tre' Little]\nYo, yo you fuck-head niggas ain't makin gangsta music\nI make music for gangstas, it's therapeudic\nYou wild out to it, let the guns go too\nSpittin out, skeet out, smoke a blunt to it (ERRR!)\nFake niggas don't dare, it's too real\nHave you doin drive-bys on my command, NOW KILL! (UHH!)\nGo on, sniff the chi-chi, rock along with me\nIt goes - guns, murder murder live in Rock City\nYou knowwww - don't let you get beside yourself\nIt's just a, terrible thing to just lose your health\nLook wrong, don't speak, just lose your wealth\nThat's the truth baby boy - shhh, quiet as kept\nThey games we play, official titty bars and rims\nBlowin money on pussy, you can probably steal\nDrink so much alcohol, shit, liver like steel\nThat's they way that I am; light, slim but still\n\n[Verse 3: Cut Throat]\nI feel the heat around the corner but I can't see smoke\nFeel it comin in the night, no lights no coats\nThey say it's cold out here, I know how that feel\nNo help when you down, well reality ill\nSee the life and the lights on connected with crime\nWanna bang out these rhymes but can't say street times\nWhat you about the struggle of what Cut go through?\nWhen niggas tryin to grind, what won't they do?\nIt's do or die baby, y'all all alone\nNo hoes, just your soul, and a heart this cold\nGotta, stay away; don't let your, spirit break\nMore, moves to make might not, be your fate\nGet Cut Throat on these pussies, that's the ride I took\nLast gangsta left standin in a room full of crooks\nIf it's poppin come the fuck on, let's handle this now\nMy soliders stratigize, that's how we get down\n\n[Verse 4: Billy Nix]\nLook at my life, I'm dead, gunshots over my head\nI - sleep on the streets, gunshots over my bed\nCarryin unnecessary weight, envy and hate\nX-Government Agent, enemy of the state\nDeath, covers the pavement, tecs under your waist\nLimited aim, unlimited range, niggas erase\nSlow down, you gettin on now, your name is mentioned\nIn and outta the game, fame done stained your vision\nAs light shines you niggas just write rhymes\nConfined in light time combined with mental dead bitches\nThe black man just tryin to get ahead witchu\nOpen your eyes 'fore some dumb nigga with lead hits you (uhh)\nI speak peace cause peace is relevant\nContinuous struggle for betterment, war with inner self\nFightin with the inner beast, wantin whores and cuties\nThat shows around the globe during my time of duty\nDevils can't kill me, niggas can't stop me\nListen and learn, witness the return of the mock D\nDeath is a funny thing - you can die, bein broke\nOr you can die from the drama that gettin money bring\n\n[Outro: D-Elite]\nAH-ROO!  Mic's up, lights out\nReal niggas on the prowl\nStill drink if it ain't mines\n(Real niggas) Throw up drinks like gang signs\nMic's up, lights out\nYeah, r-real niggas on the prowl\nStill drink if it ain't mines\n(Real niggas) Throw up drinks like gang signs\n\nYeah, X-Gov, Tre' Little\nCha Cha, B.O., 5'9\", yeah\nYo, CHI-CHI GOT THE YAYO! {*echoes*}\nYeah yeah, Wall Street, yeah yeah yeah\nYo, yo, real niggas throw up drinks like gang signs\nAH-ROO!  Yeah yeah yeah yeah\nDrink if it ain't mines\nReal niggas throw up drinks like gang signs\nMic's up, lights out\nYeah, AH-ROO! (CHI-CHI GOT THE YAYO!)\nAH-ROO! {*fades out*}", "image": "https://images.genius.com/892233b049a8da052593a9b4030be708.988x988x1.png"}], "artist": "Royce da 5'9'’"}