{"songs": [{"title": "SportsCenter", "album": "Dedication 2", "year": "2006-05-22", "lyrics": "[Verse]\nCover my tracks like butter, so where the bread be?\nI see beef as dead meat\n\"Who that, the president?\" \"Yeah, me\" No one scare me\nAnd you ain't gotta double dare me, hear me?\nLoud and clearly, rats aren't near me\nWiretap niggas get blood in they earpiece\nI'm from New Orleans, nowhere near peace\nPure beast, fear-free, dear grief\nCatch up, bitch, I'm in gear three\nZoom gone, see ya! Peace... drop one finger\n(Gangsta!) Fuck 'em and whoever made 'em!\nI will hurt whoever love 'em, cause I hate 'em\nLookin' for a lady, high and sedated\nGot her to the pad, I don't know how a nigga made it\nShe gave me relations, so now, we related\nThe morning comes; the picture, faded\nI waited on my turn to burn, can I get a light?\nLittle dog, bigger bite, Jackson Five, Little Mike\nCan I get a mic or a mic and a half\nThat the Source owe me? Shout out to the editing staff, yeah\nI'm all grown, so much better with math\nI need a spread in the Forbes takin' a Benjamin bath, yeah\nI'm servin' this track like, Steffi Graf, yeah\nRoger Federer; there's no competitors\nNiggas know my rhetoric; bitches know my preference\nYoung God, baby: all them other niggas reverends\nSittin' in my big house surrounded by my weaponries\nI keep them away like I got leprosy\nChopper right next to me, loaded up with pepper seeds\nGot an extra clip, but that's only for my especiallies, yeah\n(Dramatic, Dramatic) This is especially for you\nJust respect a nigga game, what kinda referee is you?\nSwallow your whistle, make a nigga ride with the pistol\nCause the fakest niggas ride with the pistol\nEven if I die old, I'mma die with the pistol\nAnd if you stand over my body, I'll probably kill ya, yeah\nNow I feel it, Weezy the realest\nI wear a lot of Bathing Ape 'cause I be with gorillas, yeah\nHe what they talkin' bout: topic of the conversation\nProduct of determination, yeah\nStop playin, you are not up in my situation\nI get money like a Caucasian\nThe car red, so the car Cajun, stop hatin'\nY'all ballers, I'm a sports agent\nWait a minute, lemme translate it:\nIt's Weezy Not-The-Father Motherfuckin' Baby", "image": "https://images.genius.com/d3b5f479408c61bed346754e1bb3f8ad.1000x1000x1.png"}], "artist": "Lil Wayne"}