{"songs": [{"title": "Dirty White Speaks Make Em Say Huh", "album": "Renzel Remixes", "year": null, "lyrics": "[Speaker 1]\nLet's start music for one second, I got this drop. I gotta drop from one of di realest nigga in Dade County. Some time ago, it was a week before I release my very first mixtape. My nigga made a prediction on the intro that I wish he was here, to see it come to pass. Write some Paradise, Street Legend, Dirty White. My nigga spoken words went like this:\n\n[Speaker 2]\nHold up man, cuz you know am trippin'. I need my stank when two eye\nBoy. Boy y'all know who dis here? Boy dis Dirty White boy. One a di realest niggas in Dade County. Dis Rick Ross shit here. Port of Miami next year! Y'all fuck niggas better be ready for it boy. Cuz dis shit won\n\n[Verse 1]\nBlack market, huh, Fleecy Murder, imma make them sell\nAlright P soldiers, Black market, huh, Fleecy Murder\nBlack market, huh, Fleecy Murder\nBlack market, huh, Fleecy Murder, imma make them sell\nAlright P soldiers\nFollow procedure, pray I don't have a seizure\nTook a nigga life like a shot of Tequila\nFollow procedure, pray I don't have a seizure\nTook a nigga life like a shot of Tequila\nFollow procedure, pray I don't have a seizure\nTook a nigga life like a shot of Tequila\nFollow the leader, no cover my back\nI went over your head, never leaving no tracks\nRenegotiated, heavy they cover my tax\nStack a couple bodies, the shit in the trap\nI holla dey hoes, I spoke and dey puff\nL.A Reid they one who still trying to touch me\nInvest in the staff, maybe payoff they tabs\nCross me, somebody tell them you nigga be careful\nFuck a hoe, gushes coming at your jugular\n, never heard of meet cutting yuh tummy tuck\nAnother tap, another day homie, stay off the phone\nI know the feb told me\nI think I need another Percocet\nCross the county line, an boy, quit the murder shit\nBlack Camaro, wanna dem sixes always spinning\nSo dey [?] where these young niggas\nKilling but they call it living\nPalm trees at the trap nigga, Am Master P with a pack nigga\nC-Murder for a stack nigga, And I ain't even have to rap nigga\n\n[Outro]\n(Made back music) That’s the end\n(Say huh, huh)\n(Na na nana, na na nana)\n(Nigga say huh, huh)\n(Na na nana, na na nana)\n(Nigga say huh) Yeah", "image": "https://images.genius.com/26f2cdfc9fdcb22135f837c8ea35c566.1000x1000x1.jpg"}], "artist": "Rick Ross"}