{"songs": [{"title": ".Wav Radio Freestyle", "album": null, "year": "2017-01-06", "lyrics": "[Verse 1: Travis Scott]\nIt's after 5\n9 A.M. on a ride, 9 A.M. on a glide\n9 A.M. slipe and slide, Miami 305\nWay, who down the way?\nWho down the way?\nIt's Part 2 of the .WAV freestyle\nPart 2, .WAV\nStill gettin' paid\nStill gettin' laid\nIn the crib findin' shade\nBirdman in the buildin', damn\nThe wheel made of damn steel, damn\nMajor, major\nJeffery you gotta grab the mic, Jeffery, we goin' up\nJeffery, yeah, let me, uh\nHectic, uh, bestie, uh\nSlastie, uh, it's so rusty\nOoh yeah, oooh yeah\n\n[Hook: Young Thug]\nDon't pass me the mic\nDon't pass me the mic\nDon't pass me the mic\nNo I don't need the mic\n\n[Verse 2: Lil Duke]\nThey want me to pop it off, I always shoot first\nI don't need nobody, I'll give your ass the worst\nYee, body, put this sucka in a hearse\nYSL we killin' shit [?]\nThey lookin' for me, the feds is watchin'\nThese niggas is talkin', just plottin'\nBitches be thottin'\nThey be suckin', these bitches be fuckin'\nDon't give 'em nothin'\nI give 'em the nuttin'\nFuck 'em and leave 'em, you know I can't cuff 'em\nI'm not a busta\nBitch I got more rhymes than Busta\nOoh damn, look at my [?]\n10 on my wrist is a busta, damn\nNo Fake Watch Busta\nYou cannot fake watch Duke\nDamn... oooh\nI came out the street\n\nChattering + Laughter\n\n[Verse 3]\nRollie overloaded, can't tell the time\nAin't cuffin' these bitches, just know they ain't mine\nYou bustas have no rhymes\nBreak a hoe, break down put it in the trap\nTwist it up [?]\nDiamonds shine like a lamp\nWho next???\n\nWord up\n\nDamn, yeah, yeah\nBetter have my cash, I don't freestyle without paper\nFuck is you doin'? This money I'm pursuin'\nI got her back ruined, bed fit two, ho\nSky rocket, the racks in my pocket\nI cock it, I pop it, ain't never gon' stop it\nI'm drippin', I'm saucin', I'm drippin', I'm flawless\nI'm drippin', I'm saucin'..\nBleed, termite, I'm just sayin' the [?]\nYeah they want the curve right\nThey gave the pussy a bug bite\nOoh they got the eyes on him\nAnd they got the pliers on him\nFuck 'round and slap [?]\nSlap out the eyes on him\nYeah I got racks on me\nAnd I got your wife with me\nYeah I got your wife, homie\nYeah, yeah\n\n.WAV Radio, the freestyle way\n\n[Outro: Travis Scott]\nYo man we got Birdman in the buildin', Quavo in the mothafuckin' buildin', Thugga in the buildin', Apple Music legends... damn bruh... can't even.... ayy but, you what? But that's crazy though like how they gon' stop you in the middle of sayin' names? How you gon' suggest a shoutout? Ayo I got Quavo in the buildin'... I ain't gon' say my name! Man I'm just gon' say that if that was me, I would shout myself out...\nMan we got, we got Duke! We got Duke! Hold on, hit pause, man, hit pause, man. Yeah we got Duke in this motha. We got Duke, Duke, Duke and Duke. Then Trav, then Thug, (then Duke) then Duke (again), then Duke three more times, then Quavo (then Duke), then Duke, then Offset, then Duke, then Duke four more times, then Takeoff, then Duke. We gon' start back from the beginning, Duke again, then Birdman, not even me, it's Duke five more times, then me. Duke WAV Radio. New show, Duke WAV Radio!", "image": "https://images.genius.com/2693402f177e3c4e325e8dc4f73c758c.750x742x1.jpg"}], "artist": "Travis Scott"}