{"songs": [{"title": "Made in America", "album": "The Documentary 2", "year": "2015-10-09", "lyrics": "[Produced by Bongo]\n\n[Intro: Mvrcus Blvck]\nStarted with a dollar and a dream\nSorta like Jordan getting cut from the team\nSorta like Dre 'fore he met Jimmy Iovine\nI was lost out here, real niggas know what I mean\nI said I started with a dollar and a dream\nSorta like Jordan when he won his first ring\nSorta like Dre with the headphone thing\nYou could be whatever you want nigga, we all kings\n\n[Verse 1: The Game]\nI had a dream last night, I was Rich Porter\nThen I had a dream I had a bitch like Kim Porter\nThen I had a dream I had bricks like transporter\nChange my life like Steph Curry in the fourth quarter\nWhat if you drove by a playground and witness Michael Jordan Taking off for his first dunk, bet you wish you had your camcorder\nThat's the type of shit I'm made of\nThat's the type of shit I'm made of\nFourteen carat gold, Raekwon first album\nNothing but a G thang like when Dre met Calvin\nThat's the type of shit I'm made of\nThat's the type of shit I'm made of\n\n[Intermission]\nYeah, Yeah\nAy, wherever Nas is in the world\nHe gon' fuck with this, what up, God?\nQueensbridge just like Compton, dog\nIn Inglewood niggas just like Yonkers, y'all\nWhere them Angels at?\nSing it for me one more time\nWhile I pretend to sniff this line\n\n[Verse 2: The Game]\nI used to wanna be Eazy\nThen I realized it wasn't that easy\nI used to wish that I was 2Pac\nThen I realized that might get you shot\nFigured I just gonna be myself though\nNiggas hate me, Documentary on they shelf though\nIn this Impala, old school like some shell toes\nHad a fake gold chain, but don't nobody else knows\nThat ain't the type of shit I'm made of\nThat ain't the type of shit I'm made of\nSnitchin' on my homeboy, gossipin' bout old boys\nKeep buyin' them Ferraris cause I grew up with no toys\nThat ain't the type of shit I'm made of\nThat ain't the type of shit I'm made of\nI'm just trying to get my weight up\nI'm just trying to get my weight up\nHol' on, I'm just tryin' to get my weight up\nBig Homies drivin' by, tellin' me to stay up\nHow the fuck I'm 'posed to stay up?\nWhen this weed got me feelin' like say bruh?\nI just seen Mac Dre bruh\nAnd the Jacka, is we up in the Bay bruh?\nRecord my demo, something that I wish I could do again\nI'm with that old shit, pulled up in my newer Benz\nI went from JT the Bigga Figga to Biggie\nWe all make mistakes, look what happened to me and 50\nRecord my demo, something that I wish I could do again\nI'm with that old shit, pulled up in my newer Benz\nI went from JT the Bigga Figga to Biggie\nWe all make mistakes, look what happened to me and 50", "image": "https://images.genius.com/f5bd9dcb51fd19e06b10b2ae0e3620cf.1000x1000x1.jpg"}], "artist": "The Game"}