{"songs": [{"title": "The Sauce (Benzino Diss)", "album": "Raw and Uncut", "year": null, "lyrics": "[Intro]\nIt's all bad now, man, it's all bad\nBut y'all done fucked up now\nYeah! Haha! New shit!\nAyo, I just want the whole world to know\nThat I did not start this, but I will finish it\n\n[Verse]\nComin' up, it never mattered what color you was\nIf you could spit, then you could spit\nThat's it, that's what it was\nBack when motherfuckers was straight backpackin'\nCipherin', fightin' for life in this rap\nFor the mic to get passed, and you psyched and you gassed\nThen you hype, ‘cause you last\nAnd you might whoop some ass; if you lost, then you lost\nShake hands like a man and you swallowed it\nWhen the Unsigned Hype column in\nThe Source was like our only source of light\nWhen the mics used to mean somethin', a four was like\nYou were the shit, now it's like the least you get\nThree and a half now just means you're a piece of shit\nFour and a half or five means you're Biggie, Jigga, Nas\nOr Benzino—shit, I don't even think you realize\nYou're playin' with motherfuckers' lives\nI done watched Dre get fucked on The Chronic\nProbably ‘cause I was on it\nNow you fucked me out of my mics twice, I let it slide\nI said I wouldn't hold my fuckin' breath to get a five\nShit, I was right, I'da fuckin' died already tryin'\nI swear to God, I never lie, I bet that's why\nYou let that bitch give me that bullshit review\nI sat and took it, I ain't look at the shit, we knew\nYou'd probably try and fuck us with Obie and 50 too\n*Spit* Fuck a relationship! We through!\nNo more Source to street cred, them days is dead\nRay's got AK's to Dave Mays's head\nEvery issue there's an eight-page Made Men spread\nWill somebody please tell whoever braids his head\nThat I am not afraid of this fuckin' waste of lead\nOn my pencil, for me to write some shit this simple\nSo, listen closely, as I break it down and proceed\nThis old G's about to get smoked like rolled weed\nYou don't know me or my motherfuckin' mother\nYou motherfuckin' punk!\nPut me on your fuckin' cover just to sell your little sell-out mag\nI ain't mad, I feel bad, here's an ad\nHere's a poster of Ray-Ray and his dad\nYou wanna talk about some shit\nThat you don't know about, yeah?\nLet's talk about how you're puttin' your own son out there\nTo try to eat off him because you missed your boat\nYou're never gonna blow, bitch, you're just too old\nNo wonder you're sore now, lordy, you're bored now\nI'm pushin' 30, you're kickin' 40's door down\nBitch, this is war now, and you'll never beat me\nAll you do is cheat me out of Quotables\nBut you know that you'll always see me on your TV\n‘Cause you've got to stay up 'til three in the morning\nTo see your video played once on BET\nSo, hee hee hee, who has the last laugh? Aftermath, yeah\nSo, on behalf of our whole staff, kiss our asshole cracks\nWe'll never fold or hold back\nJust know that Benzino's wack; no matter how many times I say his name, he'll never blow, jack\nYou're better off tryin' to bring RSO back\nLook at your track record, that's how far it goes back\nIt's extortion, and Ray owns a portion\nSo, half of the staff up there is fresh out of jail from Boston\nBullyin' and bossin' Dave like a slave\nThey completely brainwashed him, and forced him to stay\nLocked in his own office\nAfraid of the softest, fakest, wannabe gangsta in New York\nAnd it's pitiful, ‘cause I would have never said shit if you'd\nHave kept your mouth shut, bitch, now what?\nHit it, Clue! Spit it, Slay! New shit, Exclusive\nYo, Lantern, yo Whoo Kid\nYou know what to do with this\nUse it, I'm through, this is stupid\nI can't believe I stooped to this bullshit to do this\nAnd who you callin' a bitch, bitch? You owe me!", "image": "https://images.genius.com/9aa2b669d2a5f46dc081ba18ab21f7aa.500x500x1.jpg"}], "artist": "Eminem"}