{"songs": [{"title": "Tweets: July 21, 2015", "album": null, "year": "2015-07-21", "lyrics": "All times PST\n\n8:00 PM: I'm not with all this fake happy shit and keep my name out of it b4 I make a scene! Lol\n\n8:08 PM: It's gone b a lil embarrassing! 😁\n\n8:09 PM: This nigga SB was twerking mannnnnnnn....i always thought u was gay letting Ya girl do all that shit with niggas while yall where together! Lol\n\n8:28 PM: Everytime a nigga do numbers they try to make up a reason why.... Last time it was a crazy storm and I did 160 they act'd like I failed or something! Lol\n\n8:29 PM: I was suppose 2 do 200k first week last time..... And when I did 165k they was acting like I failed! Lol\n\n8:30 PM: And it's get it clear Nicki or nobody not responsible for my success...I been had the culture with me..Don't ever get that confused!!!\n\n8:41 PM: My chill button has been turned back on...... Let me get back to me! Lol\n\n8:41 PM: RT @cthagod \"Satan ain't playing fair. He really trying to show us it's levels to this evil shit.\"\n\n8:42 PM: Dweebs lol 😩\n\n8:44 PM: N#%^ s so fake u can blow they cover in two days!\n\n8:46 PM: Stop comparing drake to me too.... He don't write his own raps!  That's why he ain't tweet my album because we found out!  😁\n\n8:48 PM: The whole game know forreal they scared to tell the truth!  I can't wait tok these guys and sit back and act like they don't know!\n\n8:49 PM: Don't compare me to none of the cats that don't write they own raps either...... Lol\n\n8:52 PM: Kendrick and j cole really know how to rap even tho they in different lanes .... Dude is all the way outta of it lol\n\n8:55 PM: I'm dropping soon again!\n\n8:57 PM He ain't even write that verse on my album and if I woulda knew I woulda took it off my album..... I don't trick my fans! Lol\n\n9:04 PM: I only know how to tell the truth..... If hov gave me a verse somebody wrote I would do the same thing!  No shade to hov!\n\n9:05 PM: I know a lot of talk gone b sick ...... But it's nothing they can do!\n\n9:10 PM: When I get mad I just start saying what's bothering me..... I can't not tell the truth! Lol\n\n9:16 PM: Shall I continue about the rest of these dweebs in the game....... Lol\n\n9:17 PM: And you know we talk that stick talk!\n\n9:21 PM: I don't really trip about the awards... I know they gone give em to the white kids doing it.... That's why we buy Rollie's and shit our own trophies!\n\n9:23 PM: Yall like fake winning...... I been tweeting about it for weeks now ... But today I wanted to show somebody how much I don't care! 😄\n\n9:25 PM: When he said the dream girl shit on Rico I thought he was coming at me lol Then youngbull played me the verse in his voice b4 my album came out I was mad as shit! Lol\n\n9:26 PM: Yall chill too.... Yall kinda on the list too! RT @HOT97: About what time you think Meek Mill is going to announce he's hacked?\n\n9:35 PM: If we found out jayz ain't write his own raps that's ok! I would prolly really cry!\n\n9:37 PM: I'm not off SB twerking yet tho?\n\n9:39 PM: Other artist know tho? lil Wayne and Nicki know .....  Ask em they gone act like they don't see them tweets\n\n9:52 PM: If I keep going I would b like Osama bin laden to all fans..... It's to dark on the other side and they all know I really know all these cornballs gimmicks\n\n9:52 PM: I just wanted to show somebody something that I really don't have a chill!\n\n9:55 PM: I asked her about how she did that with a boyfriend that was b4 me! Lol RT @rachelrivera: #nuffsaid @MeekMill @Drake\n\n\n\n9:55 PM: Long as I'm claiming Ya...... No lap dances....no rice no nothing for any rappers!\n\n10:02 PM: I'm out I'm going to the club.. Holla at Yall for the next episode of #whenkeepingitrealgoesright\n\n10:11 PM: Most of the duse sick about Nicki forreal.... It's a bunch of em!\n\n10:13 PM: Ross is really with me.... I don't look at no tweet ...... It's really love we don't act like we cool for the camera!\n\n10:23 PM: Lol RT @AllMediaQ: @MsBellargo you win tonight! Bellargo promo on a stack\n\n10:33 PM: And it ain't about no tweet he ain't post my album and he on it because he know we found out!  It's so much to it lol\n\n10:34 PM: Quentin miller\n\n11:02 PM: 😂😂😂😂 RT @BrunoMars: Yo I want in on this twitter Beef!! VMAs is the new WWF!! @edsheeran Fuck You!\n\n11:02 PM: And I only speak facts remenber that!\n\n11:47 PM: Roscoe dash.....\n\n11:50 PM: Yall gotta remember I'm from the trap.... I can't b seeing f%# shit going on and b whispering with my homies about how lame it is..ima say it!", "image": "https://images.genius.com/6929169de7116d41676151bdea5cc773.1000x1000x1.jpg"}], "artist": "Meek Mill"}