{"songs": [{"title": "Speedin’ on Da Highway/Exit 13", "album": "Exit 13", "year": "2008-09-05", "lyrics": "[Hook 4X: LL Cool J]\nSpeedin on the highway\nStarin at the white lines we rollin, we rollin (white lines)\n\n[LL Cool J]\nHigh speed baby!\nIt's two o'clock in the mornin, I'm stompin down on the pedal\nLook at my ring on the steering wheel and my ice on the bezel\nI made a promise to God that I would run from the devil\nWhen the engine is gunnin I'm on a whole other level\nWhite lines connected, I'm livin life like a rebel\nMy competition is chokin inside my dust when it settle\nBaby look at me now, I'm just a kid from the ghetto\nBut I'm on top of my hustle, I move the bass and the treble\nAnd I go at your generation, I'm runnin this era\nAin't no lookin behind me, my system shakin the mirror\nTop speed in the Beamer, my head boppin to \"Ether\"\nI'm on I-95, clutch burnin the reefer\nEverybody that rides with me becomes a believer\nCause I come from the hood, but I think like a Caesar\nWent from 0 to 60, four deep in the Bentley\nHell yeah I be speedin, that's why niggas resent me; ugh~!\n\n[Hook]\n\n[LL Cool J]\nYeah, uhh\nI said to hell with the past, it's time to live for the future\nMake the muffler backfire and pop like a Ruger\nDon't have the slightest idea 'bout who you ridin with do ya?\nJust keep your eye on the white lines, feel 'em goin through ya\nBetween the lines my mind works like a normal computer\nMy adrenaline's rushin like I've been dodgin the shooter\nI get surgical on the road every line is a suture\nAnd you must be a operator if niggas dispute ya\nPeelin off in a hurry, there ain't no reason to worry\nAnybody that challenges me is gonna get buried\n12 cylinders gunnin the whole world has become a\nGrill low to the ground, like a bull when it's runnin\nMy Lamborghini is hummin, it sings a tune to your woman\nSo if you make me slow down, I'm peelin off wit'cha onion\nYou need to stop all the frontin under your hood there ain't nothin\nYou know the Exit is 13, come see if I'm bluffin\n\n[Hook]\n\n[LL Cool J]\nUhh!\n\n[Funkmaster Flex]\nExactly! When we in the car we 22'd up\nWhen we in the big truck we 24'd up, y'knahmean?\nWhen you see me ridin, real fast, your job, is to stay back\nPre-bumper - behind the bumper fam! Alright?\nDo not race in front of me\nI should not be able to see, your license plate\nThat means there's somethin wrong here\n\n[LL Cool J]\nThis is the biggest decision I ever made in my life\nYou do a hundred miles an hour on the highway at night\nYou go to fasten your seatbelt and make sure that it's tight\nBecause I'm rippin the paws just like I'm rippin the mic\nBaby I'm pushin the limits as if I'm racin a bike\nTell the highway patrol no need to chase me tonight\nThe way I'm doin my thang it's like I'm up in a plane\nI hit the stick in the rain, I guess I'm sick in the brain\nRocks hittin the frame, you think the shit is a game\nBut I'm ready for anybody that steps in my lane\nAnd I know you afraid, no reason to be ashamed\nNobody's crashin my party I'm mashin out on these lames\nI devoured the cowards and there is no doubt about it\nAll these niggas are too gassed, they can't run without it\nTried to give me a flat tire, I wouldn't allow it\nI left y'all in the dust nigga, I'm too high-powered!\n\n[Hook]\n\n[Funkmaster Flex]\nExactly! When you see us, fast lane middle lane slow lane\nIt's all the same thing y'knahmean? We go fast\nWe got a lot of big wheels on our cars, it's what we do\nAight? When you see us, you salute the kingpins, the generals\nThat's us, y'knahmean?\nAnd matter of fact, we gon' jump off the Bridge right now\nWhen you see L, THIS JOINT'S IN FUCKIN EFFECT!!!!\nI've been DYIN to say that~!\nI've been DYIN to say that, eighty-six nigga!\nYou know what it is man, first album\nTen million, no fuckin video, yo LL was THERE!\nI WARN YOU! You gotta STOP!\nThere's too many questions and not enough answers\nToo many questions, mind your business knahmean?\nThis is grown shit right here, aight?\nWhen you see us, we do this for a living\nI've been doin this for a fuckin minute!!!\nYo I've been dyin to talk crazy on a L record\nThis is big for me man!\nWow!!!", "image": "https://images.genius.com/0c13f17b61fb5401ffd0b607a7ca75ab.500x500x1.jpg"}], "artist": "LL Cool J"}