{"songs": [{"title": "Off", "album": "Layers", "year": "2016-04-15", "lyrics": "[Verse]\nI'm signing off on this\nOn the same ones the treasury prints\nWith every intent to see niggas dying off of it\nI signed at Sony\nA couple of years after the NBA signed Kobe\nAnd he about to retire\nSo if anybody see Don Lenner\nMake sure you tell him I ain't lost it yet\nSomebody tell Tom Silverman \"Hi\" for me\nLook in the sky there's a fly sorcerer\nEye-balling me from of a flying saucer\nAnd my mind is like a full clip\nAnd my competitions' magazines are running low\nLike the Source and Vibe offices\nSince '99, Hip-Hop been like my orphanage\nGot dropped a lot\nBut every time I signed I got a million\nA&Rs and exec's were telling me I'm not appealing\nTrying to turn me into Nas, I'm not him but I forgive you\nThis is a Bob Marley\nBob Dylan spiritual vibe that I'm feeling\nThese scars are time healing\nClearly you lost\nYou tried to put me in a box--how dare you\nTry to minimize a lyrical god?\nI'll godzilla these walls\nMy prime's no time near\nI'll improvise till my ceilings\nGet wizard of Oz\nI'm the illest alive\nI'm the rose that rose\nFrom the concrete with the thorn\nAnd when I'm gone I shall live in a vase\nMe and Porter just handling business\nBoy we came a long way from blasting cannons\nAnd having to throw 'em in trash cans\nDismantling shipments\nI had the manager shift at my day job too\nI laid down rules\nNo gas station past 8 mile\nPast eight or late drive-throughs\nMaxell tape, you play the whole B side\nYou flip it over and hear the whole A side too\nNow we got iCloud and FaceTime basically\nTo knock down the grape vine\nMake way as the chaos ensues\nNiggas saving ratchets calling themselves bosses\nBut they not\nThey David Hasselhoff\nAnd they bay watch\nBut I'm cool\nNowadays my life be lavish\nWho I'm out with tonight\nIt might be a model or\nMight be an actress\nShe might be a ballerina\nShe might do plays\nShe might just like theatrics\nShe might be famous\nI must just pipe her for bragging rights\nShe might get mad at the paparazzi\nFor flashing cameras at her ass\nAs she covers her face with her arm\nAs if she's dabbing\nShe might be dragging\nMe at some uptight fashion show somewhere\nWhere people like Madonna and Bono go\nI might take one look up and down  at the clothes\nAnd say, \"Hell no, It's time to go.\"\nCome on it's time to go\nI might fuck her on the kitchen table\nAt her crib in the Hamptons\nI might lay her down gently\nI might slam her\nI might even fuck around and yell domino\nMy soul just sound off like \"you got a pair.\"\nI'm a real nigga\nI done lost a lot of friends over the years\nI've been losing a lot of hair\nBeen told that I'm out my mind\nBut if you only knew what was inside it\nYou too would choose to stay out of there\nI take my hats off to the addicts\nGoing through something tragic in their lives\nShit even I backed off the madness\nI had to take some time off the rap and realize\nNow how do I stop being underrated?\nHow do I get props like, let's say, a Drake?\nBut I rap with the skill set of let's say\nA Black Thought or an Elhzi\nIf Jay Elec can bag a Rothschild without an album then I can come back to rap after doing some jail time\nNo one cares about sales now\nThey care about Facebook status\nIt's all about gadgets and getting fatter than hell\nAnd consuming shit like them Patti LaBelle pies\nLike lunatics, speaking of, I knew this chick\nWho used to just be happy to make it out the hood to see me\nThen she got on some fucking Truman shit\nShe's starting asking me to do some shit....\n(Record fades to close)", "image": "https://images.genius.com/533ac062d389201c4e7eb9a973709ea4.1000x1000x1.jpg"}], "artist": "Royce da 5'9'’"}