{"songs": [{"title": "Pray", "album": "Layers", "year": "2016-04-15", "lyrics": "[Intro]\n(Let us pray)\nDear Heavenly Father, thank You for watching over us today. I pray for the sick and [shut in] and for those who have lost loved ones. Lord, I pray for the homeless. Lord, I pray for our soldiers and their families. I pray for everyone here today...\n\n[Verse 1]\nGod taketh away, and God giveth\nThe clock's tickin' away as the plot thickens today\nCause I'm sippin' hard liquor\nWe couldn't suffer the same amount of losses\nCause my supply's bigger\nDon't associate me with nothin' but that dopest child star shit\nThat Lindsey Lo', that Todd Bridges\nHit your block with a tickin' bomb that'll\nLeave the competition in the hospital\nI'm the product of foolish pride\nI'm a speeding bullet who responds to the pull of God's trigger\nJumpin' out the barrel, like \"Excuse me, Nas. Move aside, Jigga\"\nI'm hard as proving ground bricks\nGroundbreaking each time I spit words and they hit the street\nYou don't like the game, you can google my dick, bitch\n\n[Chorus]\nAnd that goes to everybody\nI pray for foes, I pray for hoes\nI pray for everybody\nBut you can pray for them\nIf you gon' pray for somebody, pray for them\n\n[Verse 2]\nDon't pray for me, pray for Paris\nPray for Nigeria, pray for peace\nPray for your marriage\nPray your horse don't sway far away from your carriage\nWhy you put all of your eggs in one basket?\nBlowin' dumb cash on Wraiths and karats\nYour daughter ain't an heiress, I hope she's taken care of\nMore importantly, I hope this gun in your face don't end up in your mouth\nI'll make you taste the terror of the kickback of this gat that could break the barrel\nMore court cases, hate betrayal\nIf I approach thee, boy, please take me serious\nCause if I say that I shall, then I shall proceed\nI don't cry wolf cause I don't enjoy wasting tears any more than I enjoy wasting shells\nI looked at the state of my health and asked the reverend 'bout it\nI didn't just pray for myself, I prayed for everybody\n\n[Chorus]\nBut you can pray for them\nThey need you more than me, pray for them\nPray for everybody\n\n[Bridge]\nLook around, look around, look around, look around\nPray for everybody, tell me exactly what you're seeing\nI'm seeing children being murdered by police and then acquitted on all charges\nIt's like they're all targets, pray for them\nPray for everybody\n\n[Verse 3]\nLive from the gutter, my father's a drugger\nThe block is my mother, 2Pac got it on lock in my suburb\nI got dope double-wrapped up in bubble wrap on top of my cupboard\nOld ladies watching from shutters\nTellin' all the children keep watching out for us\nBad influences, we the gumbo that you see inside the pot\nSwimming 'round in all the saddest, truest shit\nAddict in the coolest whip\nRiding 'round my city lookin' for the baddest newest bitch\nHammer in my stash, feeling too legit\n90 on the dash, slammin' on the gas\nPassenger mad, saying that the break pedal do exist\nI'm saying \"I'm late man, I got school to skip\"\nIntroduce me to your chick, I turn this shit to a Skip to My Lou assist\nI don't talk too much shit, I discuss shit by throwing hands\nI'm a sucker for hoes in yoga pants\nTell my queen I'm in this shit, like kissing and holding hands\nI keep my flings on the other end of a string with swollen glands\nI'm a player, I've been to every hotel and every lobby\nEvery time I pray, I send up a prayer for everybody\n\n[Chorus]\nDon't pray for me, nigga\nPray for them\nYou gon' pray for somebody?\nPray for them\n\n[Verse 4]\nDon't pray for me, pray for respect\nPray to get something different from rich and away from your debt\nNigga, I'm straight to cassette\nY'all digital, y'all about as physical as finger under some balls, coughin' while taking a test\nToo many artists get mistaken with best\nCause they on the charts, you sleepin' on me, I'll come and wake you to death\nWhile I pray against all the violence and shootin'\nISIS got Obama sittin' down with Vladimir Putin\nI saw a child online ask his father \"Why did they do this?\"\nHis father then replied to him, \"We gotta fight 'em with flowers growing out the ground\"\nI look at violence the same way I look at slavery\nIt's never ending in light of abolishment\nThese are my finest hours, then\nI pray for everybody\n\n[Bridge]\nLook around, look around, look around, look around\nPray for everybody, tell me exactly what you're seeing\nI'm seeing children being murdered by police and then acquitted on all charges\nIt's like they're all targets, pray for them\n\n[Outro]\n(Let us pray)\nLord, please keep Your arms around us, and protect us from harm and danger. In your son Jesus' name, amen. (Amen!)", "image": "https://images.genius.com/533ac062d389201c4e7eb9a973709ea4.1000x1000x1.jpg"}], "artist": "Royce da 5'9'’"}