{"songs": [{"title": "Cobra Clutch", "album": "The Swarm (Volume 1)", "year": "2008-07-21", "lyrics": "Yo, yeah bitch\nAiyyo, motherfucker\nAiyyo, swallow it\n\n[Verse 1: Ghostface Killah]\nAiyyo we dazzle off this bloody version of Glaciers\nSlang shot threw a gem in his mouth, swallowed his razor (wsssht)\nSay no more, my back be parked against the wall\nTrooper square holding, 'Face don't give a fuck about the law\nTake off the bracelets, don't get blinded by the ice Boo\nIt's not cool, Veronica slept, plus the decimal\nLook at my jumper logo look familiar? It's Power (Where is he?)\nYo every fine stitch knocks an inch off Eddie Bauer\nGucci sneaker rockin' just another form of 'Chessboxin'\nNo cock-blockin', Supreme Clientele, till I'm droppin'\nKangol slanted, Ghost'll ran with a hippie ho now\nClub bandit never empty-handed when I brand it\nMork calling Orson, Mork callin Orson down in Boston\nBoth of them dead, cop in the loft and\nBig chain swingin nigga, Matchbox car drivin\nStreet whylin, Role' with the four-finger glidin\nWatch him, scorchin with spells and top toxin\nAmoxicillin stock skyrocket, Bobby Mocassin\nSwitched from Pert Plus, escrow on the side throw in Sun trust\nGhost'll keep shinin til the sun bust\nYo word up, Born'll be right behind the curtain with the nose out\nSixty Second get the Rover out\nFeatherhead heathens, teethin' on mic dicks\nWhen thy said, \"Let the kids die for your bread nigga!\"\n\nYo, promoters don't want us in clubs because we spaz out\n'Who is these righteous motherfuckers with they flags out?'\nStapleton Projects, recognize you're lookin at\nAllah's best, puttin on the hits is no contest\nNOW, who the hypest in New York City?\nWU-TANG! Radio stop shittin on me!\n\n\"I got fifty men out in the street\nNow if they all get bitch troubles I starve\nIs that it? Is that what you're tryin to tell me?\"\nSuperfly\n\n[Verse 2: Ghostface Killah]\nAiyyo, the moccasin money, one man behind the plate\nHold it down honey-shallah rock the half man Gumby\nTwisted, the mime of the floods, niggas spell drama\nOne oh five point six llama\nCosmetic classical, Slomin's shield, Milagro Beanfield\nWatch me heal half of you, new attributes\nTeletronics, DBX, one sixty X\nCompression with the A and sharp press\nExtract bass in which the gooey dew drips, vanilla suckle\nWith jasmine bits, five hundred rap battin average\nOne taste the bowl and blow up magic, Houdini escapes\nFrom the fermenting hell halls of tragic\nSpeaking to the First of April's, deep in the rap game\nErase you, Excedrin head bredrens catch facials\nSide orders, one telephone for take out\nStomp your man half to death rob him then we break out\nGet off on the Clove Exit, knees dirty, chick kneel\nWith low leverage, watch it how she lick the head of it\nCause it's law, order today, we pay dues\nNew Tomorrow's, Rubik's Cube money in a tube\nDeck the Halls, crush celery dice that's Cinderella ball\nHey y'all Peppermint Pattie's, slum my Peter Paul\nWrangler, straight laid the track when it's sag\nWith one banger, interlude loop caused me to hang up\nTicklish, Crunchberry niggas at the flicks pissed off\nStandin in the rain and can't find they whips\nSuckers! Motherfucker!\n\nYo, promoters don't want us in clubs because we spaz out\n'Who is these righteous motherfuckers with they flags out?'\nStapleton Projects, recognize you're lookin' at\nAllah's best, puttin' on the hits is no contest\nNOW, who the hypest in New York City?\nWU-TANG! Radio stop shittin' on me!", "image": "https://images.genius.com/a67f9b4ce1676cb13798f12d3278fdd9.301x300x1.jpg"}], "artist": "Ghostface Killah"}