{"songs": [{"title": "Hoochie", "album": "Shorty the Pimp", "year": "1992-07-14", "lyrics": "[ intro ]\nYeah, you know, it's like, ehm - I rap\nI got two platinum albums\nI do a lotta concerts all over the place\nI seen the groupies\nThey do whatever you say\nWhen you want it, how you want it, and where you want it\nBut I ain't trippin\nCause these are the '90s\nSo when a freak say to me she loves me\nI just say somethin like this\n\n[ verse 1 ]\nI say baby, why you wanna do all that?\nSleep with a brother just because I rap\nYou keep lookin in my eyes, and you just won't stop\nAll damn night you been on my jock\nBut I'm no fool\nCause you're sprung on my house and my swimming pool\nCall me a dog, I got several freaks\nWhen I do my shows I can't get no sleep\nCause you keep knockin at my hotel door\nI was there to sleep, and can't get no more\nSleep, so why you wanna wake me up?\nWhen I told you once I don't wanna fuck\nSo get on, girl, won't you mind your own\nI'm tryin to sleep, so just leave me alone\nNext time I see you, I do my duty\nBut tonight, I got another hoochie\n\n[ Chorus: d'wayne wiggins ]\nHoochie, tryin to be bourgie\nBut you're nothin but a groupie\nRiding on my snoopy\n\n[ verse 2 ]\nI'm short dog, I wanna take you backstage\nAnd you can read it like it's on the front page\nYou wanna do somebody right\nFor those who ain't famous - not tonight\nYou do the nba and the nfl\nRappers and singers as well\nKeyboard players and the drummer\nIt's like track and field with just runners\nSo let me get on the phone and call all my friends\nAin't a damn thing changed but the paint on our benz\nGet somethin that you can't get from good girls\nCare less about a weave or a jherri curl\nCause I know something you don't know\nAin't nothin like these groupie hoes\nAnd since tony toni ton? made the track\nGet lost, fool, and tell your girl I'm back\nSing it\n\n[ Chorus ]\n\n[ verse 3 ]\nGet off my lap, cause you're gettin kinda heavy\nLookin at the bed, askin am I ready\nReady for what, sex?\nWell, after that, baby, what's next?\nWe get a house in the suburbs, two-car garage\nAnd every night I get a good massage?\nSave that drama for later\nAnd take this number to my skypager\nKeep in touch, but don't call too much\nWhen I come back around, you know what's up\nIt's time to get busy once again\nBring a few partners, cause I got friends\nIt's goin down like always\nYoung groupies in the hallways\nI got the money, the fame, and all the things you like\nSo I see you next time when I rock the mic\nYou\n\n[ Chorus ]", "image": "https://images.genius.com/f82c145afb5d000ecf7dbe3e66f99782.1000x992x1.jpg"}], "artist": "Too $hort"}