{"songs": [{"title": "Bought A Chicken", "album": "Gucci 2 Time", "year": "2011-01-22", "lyrics": "[Verse 1 - Gucci Mane]\nEveryday is Cinemax, every night's a porno\nAll my niggas gung-ho; animals, Congo\nShining like a french cut diamond out of Frisco\nThe year's '49 and I know everything that Bo know\nTwo Thousand 1017 and I'm ballin\nBricksquad Brick boys bad hoes callin\nSwagger through new Orleans\nRocking with the live band\nBad to the bone, leave my hat where my home is\nScrapping told a G I leave my GAT where my tone's at\nBrick Squad Mafia, dressed in black, your boy is back\nAnd off the wall with bricks and bails and pints of lean and cars and all\nShining like a French cut diamond like an actor\nEveryday is Cinemax, every night's a porno\nGucci Mane La Flare, I know everything that Bo know\nShining like a french cut diamond out of Frisco\n\n[Hook]\nI just bought a chicken, And it came with biscuits\nOur trap is a drive-thru, call it Mrs. Winters\nChicken finger-licking\nDon't tolerate no snitching\nBricksquad trappin,chickens in the kitchen\nChicken go for 30, chicken go for 30\n30-rack shawty, tryna score a birdie\nChickens go for 30, Chickens go for 30\n30-rack shawty, tryna score a birdie\n\n[Verse 2 - OJ Juiceman]\nChicken go for 30, but my chicken purrdy\nNiggas with them low numbers His chicken so dirty\nI keep it 100, my trap do them numbers\nCause I keep that super clean, my brick wonder woman\nI drop 62 my nigga, 63 grams stronger\nMy traphouse go super hard, j's love the aroma\nI feel like it's 95, I still got that hunger\nSlide through the trap and my pockets on humongous\nBricksquad trappin got young Juiceman with that money\n30 rack chicken, Come and spend your money\nIf you spend that 30, Your chicken 100\nI pull out my trap, pockets on cucumber\n\n[Hook]\n\n[Verse 3 - Wooh Da Kid]\nI'm from QU Nigga, Who you nigga?\nNeighborhood buzz, wooh da king? Much bigger\nNeighborhood thugs, You are not no killer\nChopper bullets beatin on your chest like godzilla\nAffiliated with gangstas, put the cannon to yo mama\nBeefin with wooh will bring you and your DJ Drama\nFather made a nigga, Mama raised a killa\nStreets made me bigger, I'm the nigga behind the trigga\nTry to snatch the chain off my CEO neck\nWill get you jumped,stabbed,shot, If you want respect\nGuc, Juice, Wooh don't fuck around\nChickens go for 30 all the way around\n\n[Hook]", "image": "https://images.genius.com/90ab40799fe96588d070c81815f71d93.350x350x1.jpg"}], "artist": "Gucci Mane"}