{"songs": [{"title": "Stank Ass Hoe", "album": "Skull & Bones", "year": "2000-04-25", "lyrics": "[Sen Dog]\nHa ha ha ha ha ha ha\nOnce again, ha ha ha\nWe back, ha ha ha ha ha ha ha ha ha ha ha ha ha\n\n[B-Real]\nNow all these new niggas trying to bust grapes\nKeep tryin, I'm shittin all over yo tapes\nAnd yo CDs, you see these\nNiggas wit the weed leaves, you need these\nHill biggas to bust trigga, sicka sicka\nThe rhyme spitter spittin over the transmittor\nI got double platinum records on the wall\nWhile you got double cheeseburgers in yo toilet stall\nCats wanna try me, you must be high\nCause you havin fuckin +Illusions+, no lie, what you usin?\nGimme some of that shit (shit), you fakin it\nAny little title you got, I'm takin it\nYou can't have it, you didn't earn it\nSpit on yo name, shit on it, and burn it\nSuckas wanna floss and play the big boss\nWhat movie you livin in and how much did it cost?\nWhat role are you playin? I'm only sayin\nYou're the record gettin played and I'm DJ'in\nPlayin you, playin you, and playin you\nDecayin you, I'm tyin and breakin you (ah ha ha)\n\nChorus: B-Real (Sen Dog)\nYou're a weak ass ho\nPunk slow yo role\nYou're nothin but a clone\nWith nothin to show\nYou're a weak ass ho\nNeed a style of your own\nYou're a weak ass ho\nYou're a weak ass ho (Punk ass nigga)\nLeave me alone (Carbon copyin muthafucka)\nPunk nigga wit no flow (You ain't shit)\nYou're a weak ass ho (Fuck your little record, punk)\nYou're a weak ass ho (Eat a dick)\n\n[B-Real]\nNow look at her over there (damn), lookin all fine\nShakin her ass, tellin me to grab from behind\nPlease don't mind me, you'll find me\nRollin the pine trees, women askin to sign these\nWell OK, but you're gonna get me in trouble\nNice ones, I gotta be out on the double\nI'll be in that corner table wit my homies\nGettin stoney tryin to avoid the phonies\nHuh, what you askin? Do I got plastic\nTo buy you and yo friends drinks? Do I have assets?\nDo I got a big home? Do I live alone?\nCan I use yo cell phone?, feelin my bone\nShe wanna ride me, she wanna tie me\nAround her tiny little finger and ride me blindly\nI don't think so, you stink, ho\nThe chain in yo brain is missin a link, ho\nPlease back up, I know you look good\nBut that ain't enough to get half of my stuff, bitch\n(ah ha ha, that's right, you're a stank ho!)\n\nChorus: B-Real (Sen Dog)\nYou're a stank ass ho\nTryin to get dough\nLeave me alone\nCause you can't roll\nYou're a stank ass ho\nNut ridin pro\nYou're a stank ass ho\nA stank ass ho\nLeave me alone (Broke ass hoodrat)\nYou can't roll (You can't roll)\nYou're a stank ass ho\nA stank ass ho (Stank ass ho)\nYou're a stank ass ho (Dick suckin tramp)\n(Ha ha ha ha ha ha ha ha ha ha ha)\n(Bring it back homie, come on, huh)\n\n[B-Real]\nHere goes another example to begin it\nWith a twist (yeah) like pussy I'm in it\nWhen I look at me, I look and see\nHow long it took for you to throw the book at me\nDamn that shit hurts, but I put in work\nThese niggas are like germs, over the counter they lurk\nAnd smirk when you fall down, but I calm down\nAnd put the anti-bacterial assault down\nKill germs that wanna test, they want the best\nComparin you to me is like a nigga to the cess\nNever settle for stress, or wack rappers\nI'm rockin outta the West and rockin the East after\n\nChorus: B-Real (Sen Dog)\n(Punk ass nigga)\nYou're a bitch ass ho\nKnockin on my door\nLeave me alone\nCause you got no soul\nYou're a bitch ass ho (Trick ass ho)\nNeed to find a place to go\nYou're a bitch ass ho (Punk ass niggas)\nYou're a bitch ass ho\nDon't touch the microphone\nYou're a bitch ass ho (Eat a muthafuckin dick)\nYou're a bitch ass ho\nLeave me alone\nGot no place to go\nYou're a bitch ass ho (Trick ass ho)\n*humming*", "image": "https://images.genius.com/af5085b228c3f1b6bc3a2ac39f6c6be8.1000x977x1.jpg"}], "artist": "Cypress Hill"}