{"songs": [{"title": "Invasion of the Flat Booty Bitches (Erick Sermon Remix)", "album": "Can’t Stay Away", "year": null, "lyrics": "Yeah that's right\nWe gonna flash back\nTo 1983\nI'ma show you niggas how I was spittin' this pimp game\nBefore most of you niggas even started rappin'\n1983\nToo $hort\nWord for word\nLike this baby\nInvasion of the Flat Booty Bitches\n\nA nigga like me I know what's up\nI want a nasty bitch with a lot of butt\nIf I can't find one anywhere\nIt turns my dreams to nightmares\nBaby right there ain't got no ass\nBut she's okay if she got cash\n\nBitches, bitches, bitches\nInvasion of the Flat Booty Bitches\n\nI'll tell 'bout a day that I had\nSeen nothin' but bitches with no ass\nI woke up early feeling right\nDo the same damn thing every day of my life\nCause every morning you know I get\nA good blowjob from a real fine bitch\nStrokin', smokin', sir Too $hort\nThinking about the day before\n30 minutes after I rolled out\nI pulled a freak took her to my house\nShe was hella young with a lot of butt\nShe sucked my dick and then we fucked\nThat good tight pussy I couldn't pass\nA light-skined freak with so much ass\nAt 1 P.M. I was fuckin' away\nI wanna do the same thing again today\nToday my story made itself\nEvery bitch I saw was flat as hell\nI told myself \"I must need glasses\"\nWhere's them bitches with the big round asses\nMe and me homie just wanna be tuff\nFreak two bitches then switch'em up\nIt was 3:35 the strip was lit\nEvery two blocks I saw a different bitch\nWaiting on the bus some was walking\nMe and my homie just started talking\nI said \"Homie she looks good\"\nHe said \"That ass is flat as wood\"\nI said \"What about baby in the black\"\nAnd he said \"$hort she's all back\"\n\nBitches, bitches, bitches\nInvasion of the Flat Booty Bitches\n\nEvery single day of the week\nFor every nigga living there's a freak\nIf you got game and a bed\nWhy not get fucked and get some head\nCause bitches all over wanna get fucked\nI just need one with a lot of butt\nMe and my homie rollin' and smokin'\nFlat booty bitches took over Oakland\nI told my homie \"I hate to say\nAll the bitches with ass stayed home today\"\nAnd he said \"$hort what now?\"\nPut the pedal to the metal and hit the B-town\nI thought them bitches out there was fine\nBut the invasion was on and it fucked my mind\n\nBitches, Bitches, Bitches\nInvasion of the Flat Booty Bitches\n\nWe hit the B-town like Oakland players\nI knew it bitches was everywere\nThe first one had tities so fat\nBut that don't work her ass was flat\nThe second bitch was flat too\nTalked about the bitch like a muthafuckin' fool\nI said \"Beyotch\nI know I'm capin'\nWhere's your ass baby, what happened?\"\nShe turned around caped back on me\nSaid \"Fuck you nigga, where's your teeth?\"\nI damn near fell jumping out the car\nBut I slapped that bitch and slapped her hard\nMy homie said \"$hort, we gots to cut\"\nBut I was spankin' that bitch on her big flat butt\nWe parked the car and took a walk\nI saw another bitch and I had to talk\nI said \"Baby, baby, baby come here\nYeah you baby with the long long hair\"\nBaby came over from across the street\nStanding on the corner talking to me\nI was spittin' the game but I talked too fast\nCause I didn't even notice that she had a flat ass\nSheit!\nAnd I was ready to go\nWe was rollin' back to the O'\nI told that bitch \"I changed my mind\"\nShe looked at me and she said \"Why\"\nI said \"I'm Sir Too $hort the Oakland player\nI'm not one of them niggas who don't care\nIt's no thang to do my duty\nBut not with you and your flat booty\"\nIn the Berkley town what did we find\nFreak after freak with no behind\nOne long day I never got in\nI'm glad that shit never happened again\n\nInvasion of the Flat Booty Bitches\n\nThe invasion (Beyotch) is on\n\nThat's that old school\n'83\nStill pimpin' baby\n$hort dog\nYou know I can't stay away from this game", "image": "https://images.genius.com/31a42aa43e1b297422c8b89c0ea0a2c0.500x493x1.jpg"}], "artist": "Too $hort"}