{"songs": [{"title": "WTF!?", "album": "You Will Regret (Reloaded)", "year": "2017-12-28", "lyrics": "[Intro]\nYuh, we just started from the top, yuh\nYuh, yuh, yuh, yuh\nHey, do you like curse words?\nThere is a lot in the verse\nAyy Tony, wooh!\nOowee, ayy! Uh\n\n[Chorus]\nDon't get fucked up, I'm fucked up, what the fuck? (fuck?)\nDon't get fucked up, I'm fucked up, what the fuck? (like what?)\nDon't get fucked up, I'm fucked up, what the fuck?\nWhat the fuck? What the fuck? What the fuck? What the– Ayy!\nDon't get fucked up, I'm fucked up, what the fuck? (get fucked)\nDon't get fucked up, I'm fucked up, what the fuck?\n(Don't get fucked up!)\nDon't get fucked up, I'm fucked up, what the fuck?\nWhat the fuck? What the fuck? What the fuck? What the– Ayy!\n\n[Verse 1]\nHuh? Huh? Huh? What did you say?\nUmm, (repeat), yuh (nice)\nYachty pulled up in a new 'Cedes truck (that's nice)\nLights, they on the front (whippin up)\nPause, Then I'ma stunt (like what?)\nAyy, you not savage so keep that shirt tucked (water!)\nNo you not, no you not\nI am a bad boy, don't wear no seat buckle\nBeat down that pussy then dust off my knuckles\n(What else? What else? What else? Dust off my knuckles!)\nWalk the damn plank (plank), on yo' bitch I plank (plank)\nUnless she stank, smell like a Chef Boyardee\nX came with Tank, basquiat came to paint\nAchoo, whooh, achoo, I'm blessed\nDon't ask me why 'cause I don't look like you\n\n[Chorus]\nDon't get fucked up, I'm fucked up, what the fuck?\nDon't get fucked up, I'm fucked up, what the fuck?\nDon't get fucked up, I'm fucked up, what the fuck?\nWhat the fuck? What the fuck? What the fuck? What the (I like to get fucked up!) Ayy!\n\n[Verse 2]\nTerio, ooh, kill 'em!\nIt's how I walked up in the building (building!)\nThis the man I'm with the millions\nI'm as high as hands up in the sky\nWhen it's yo' auntie saying hallelujah!\nI'm the shit, what's it to ya?\n(Umm, here's your tissue)\nYup, I needed it\nJust for my jewelry, 'cause it be dripping B\nAnd she from Italy, she got the sausage\nLike I'm the Kennedy, got lotta green on me\nTalkin' 'bout Kennedy, she said I'm awesome! Ay (talkin bout)\n\n[Chorus]\nDon't get fucked up, I'm fucked up, what the fuck? (okayyy)\nDon't get fucked up, I'm fucked up, what the fuck? (eh, ayyy)\nDon't get fucked up, I'm fucked up, what the fuck? (ain't mean to flex)\nWhat the fuck? What the fuck? What the fuck? What the– Ayy!", "image": "https://images.genius.com/8523575a0e648f3224ea582e84c74556.500x500x1.jpg"}], "artist": "Ski Mask the Slump God"}