{"songs": [{"title": "Sickology 101", "album": "Sickology 101", "year": "2009-04-28", "lyrics": "[Intro: Tech N9ne]\nHey, now everybody sit down and shut the fuck up!\nClass is now in session\nIf you came here to hear that lovey dovey shit - get the fuck out!\nIf you soft and scared of hardcore shit - get the fuck out!\nFor those who love raw shit - welcome to Sickology 101\nYour instructor for today is: Tech N9ne!\n\n[Verse 1: Tech N9ne]\nThis is style, I use pitch to catch and seduce chicks\nTo signal the true sick, monotone is what you spit\nSwitchin' the pattern, bust out that quick Middlewest chatterin'\nSome people hate but it ain't matterin'\nBut the people gather, it's flatterin'\nSwitchin' the pitch, mixin', there's no need to be stiff in this bitch\nSpittin' full clips on a mission for bliss when I be rippin' this shit\nMake it exciting, got to be inviting when you're writing your piece\nNever be dick riding, if you're going to be biting, you're igniting the beast\nThis is melodic, melodies if you got it\nMix it hot as tamales, you singin' off-key, it's garbage\nIf you can't keep an octave in a pocket, you need to stop it\nHave confidence, speak with conviction\nDon't put 'em asleep when you rock it\nThis is harmony, Nina's taking you through it\nMake it buttery, utterly beautiful, make it fluid\nSickology 101 is in session, I thought you knew it\nWe murderin' motherfuckers in music, that's how we do it!\n\n[Hook]\n(Get) on your feet, (up) out your seat\n(Get) on your feet, (up) out your seat\n(Get) on your feet, (up) out your seat\nSuch an oddity with it, this is Sickology\n(Get) on your feet, (up) out your seat\n(Get) on your feet, (up) out your seat\n(Get) on your feet, (up) out your seat\n\nFrom our West Coast instructor: Crooked I\n\n[Verse 2: Crooked I]\nMy killer cadence can keep me crushin' the competition\nComin' correct when creatin' the crazy composition\nCannibal character, Calico carrier, got a crooked copper missin''\nCali killers on candid cock emissions\nThat was constant consonant wordplay\nWordplay rhymes with Thursday and thirsty - if I'm thirst-ay!\nI change the pronunciation of words per se\nThe English language got to do whatever my verse say\nSo if you want to learn to rap, this is how (this is how)\nRight now I'm puttin' swag in my style (in my style)\nIt's an emphasis on the simplest sentences\nThen I give 'em charisma with a laugh and a smile (and a smile)\nIf you want your verses to cost higher\nThen your similes got to be hot as a live wire\nYou need some better metaphors\nFor example, this song is a war zone and you listeners in the crossfire\n\n[Hook]\n(Get) on your feet, (up) out your seat\n(Get) on your feet, (up) out your seat\n(Get) on your feet, (up) out your seat\nSuch an oddity with it, this is Sickology\n(Get) on your feet, (up) out your seat\n(Get) on your feet, (up) out your seat\n(Get) on your feet, (up) out your seat\n\nFrom our East Coast instructor: Chino XL\n\n[Verse 3: Chino XL]\nEverybody start lockin' their windows and doors\nChino might get in\nIt's like lightning and how I'm strikin' a triflin' rifleman\nBullets flyin' up and I'm numbin' the bum like it's Vicodin\nSo much metal in his spine, he could get rich from the recycling\nChino be curdlin' blood, don't get burned from the buzz\nI speak with conviction like what Da Brat just heard from the judge\nBludgeon no love, industry hate me yo\nI'd rather hear Hannah Montana than half of you rappers on the radio!\nStartin' drama with Chino, God forbid\nAuction my lyrics on eBay, that's God for bid\nProblem is lyric Jesus is more than a man\nWith a sick delivery like I drive a coroner van\nI'm demented, spittin' writtens as sick as I can\nGrenade grippin' and fittin' to detonate Disneyland\nI am teachin' Sickology, try to follow how every punch line hits\nLike Chris Brown's fist in the face of Rihanna\n\n[Hook]\n(Get) on your feet, (up) out your seat\n(Get) on your feet, (up) out your seat\n(Get) on your feet, (up) out your seat\nSuch an oddity with it, this is Sickology\n(Get) on your feet, (up) out your seat\n(Get) on your feet, (up) out your seat\n(Get) on your feet, (up) out your seat\nYes, I got to be vicious, this is Sickology\n\n[Outro]\nFor those who don't know what the fuck's goin' on\nThis is Sickology 101, you punk motherfuckers!\nHahaha, let's kill these niggas", "image": "https://images.genius.com/081166dc5d132ad1d3549578cac249e0.1000x1000x1.jpg"}], "artist": "Tech N9ne"}