{"songs": [{"title": "Tina", "album": "Bastard", "year": "2009-12-25", "lyrics": "[Intro]\nDr. TC: So, do you party?\nTyler, the Creator: Nah, I just do ignorant hoodrat shit with me and my niggas in the fucking mall, Odd Future Wolf Gang\n(Drop it)\n\n[Verse 1: Jasper]\nNiggas at the fucking mall, niggas where my fucking drawers?\nThink I'm happy? Think I'm sad? Bitch you fucking know my dad\nHe wears his pants up in his ass, touch his ass, grab his dick\nYou's a fag, you like that shit, O.F. is the fucking clique\nI'm going off the top of the brain\nNigga don't know how to rap but I'm in the game\nFuck that shit, I don't give a fuck\nI'm back up in the fucking club, niggas know I'm at the mall\nEating chips with my drawers, how you doing? How you fall?\n\n[Hook]\nSwag, swag, swag, swag\nSwag, swag, swag, swag\nTina perm your fucking weave\nTina perm your fucking weave\nTina perm your fucking weave\nTina perm your fucking weave\n\n[Verse 2: Tyler]\nEat my ass, lick my balls\nBitch I'm in the fucking mall, with my niggas eating ham (Mmmm)\nBitch I got that fucking swag, you don't know my fucking dad\nI don't know my fucking dad, what is this a fucking purse?\nI ain't fucking Mexican, but we can have sex again\nWith your sister with no rubber (Alexis' real name is Alex)\nWhat the fuck? That's your fucking brother? I ain't with that jerkin' shit\nUnless it's Steve Harvey's buff sister trying to jerk my dick\n\n[Hook]\nSwag, swag, swag, swag\nSwag, swag, swag, swag\nTina perm your fucking weave\nTina perm your fucking weave\nTina perm your fucking weave\nTina perm your fucking weave\n\n[Bridge]\nAll: Swag, swag, swag\nTaco: Swag, SWAG, SWAG, SWAG\nTyler, the Creator: Oh no, oh no, oh no\nSwag, swag, swag, swag, swag, swag, swag, swag\n\n[Verse 3: Taco]\nI'm with your girlfriend eating chips\nMmmmm, stop the beat, bitch\nUh, oh, oh, shit, fuck, mmmm, mmmm\nWait, stop the beat\nAlright, yeah, nigga, I was in the mall\nWith my niggas busting triggers, yeah, swag\n\n[Hook]\nSwag, swag, swag, swag\nSwag, swag, swag, swag\nTina perm your fucking weave\nTina perm your fucking weave\nTina perm your fucking weave\nTina perm your fucking weave\n\n[Outro]\nBitches, hoes, weaves, leather jackets (Nigga don't know)\nBitches, weaves, hoes, leather jackets\nBitches, weaves, hoes, swag (I'ma kill you and that fucking baby, bitch)", "image": "https://images.genius.com/cb0b25f99dd81109efa8db270a933a38.500x500x1.jpg"}], "artist": "Tyler, The Creator"}