{"songs": [{"title": "So Much Better", "album": "Poindexter", "year": "2009-09-17", "lyrics": "[Verse 1]\nI’m cooler than an ice cube, yeah I’m rude\n‘Bout to get your head sliced, yeah I’m nice\nAnd you ‘bout to pay the price\nLike The Price Is Right, but I’m not Bob Barker\nYes, I get down like I’m Charlie Parker\nMeaning that I’m musically inclined\nIf you try to get with mine I’m about to blow yo head back\nGet another bullet and I spray bullet (bullet)\nAnd I spray back, pop, pop, click, click (drop, drop) down\nNow they lookin’ for your body like all over the town\nNiggas, my name Gambini, I used to be clean\nNow I’m dirty martini, ‘cause this boy met world like Feeny\nThese niggas make wishes like genie\n\n[Chorus]\nNigga you know how we do\nLatinos, black people, and gringos\nThis money stained my fingers like Cheetos\nBlast it out your speakers like credo\n‘Cause I can barely hold it all in like Speedos\nThese niggas got a lot of nerve\nThese niggas got a lot of sneaks\nAnd all these skinny bitches busy shop at Anthropologie\nWho you tryin’ to be?\nI’mma take my girls to BIM and treat ‘em like a VIP\nBecause I am a G, ugh (G, ugh)\nI start the party like Chex Mix\nPut it in your house like Netflix\nBeef, nigga, it’s what’s for breakfast\nY’all niggas got beef with this kid\nY’all niggas’ punks and stay punks like the Misfits\nI'm way off in the distance\nY’all done lost the race like McCain\nBut like McCain, you used to be cool but now you lame\nIt’s hard to maintain ain’t it?\nBecause I am so much better (than before)\n\n[Verse 2]\nMy swag is so sick, you might catch it\nI’m tired of fuckin’ ‘round with little kids like I’m Brad Pitt\nThese little kids need to play in traffic\n‘Cause all they words make a nigga giggle like Mad Libs\nI’m hot like an attic in the summer\nAnd girls scream “Sick Boi” like we know each other\nBut we don’t know each other, you ain’t my fucking brother\nWe need to separate like organic peanut butter\nMy lightsaber flashing, my kneecaps ashy\nAnd girls of the world used to walk right past me\nNow I hang with girls like my girl Kate Perry\nI might have to marry Kate like my name Ashley\nThese rappers don’t know what they up against\nThey can’t see a nigga like my names Snuffleupagus\nIf you don’t like my shit, why the fuck you bumpin’ this?\nI am so much better (than before)\nYou better get it clean good ‘cause this the last straw\nAnd break inside your house and leave your gas on\nNigga, we NASA, ‘cause we ‘bout to blast off\nGo in the bathroom, we see you peein’ like I’m Shasta McNasty\nGet it? UPN? Shasta McNasty?\nNigga, I’m a master\nAnd I’m fucking plastered\nI don’t need a fucking beat for this, I can make my shit up\nWhile I go here’s the part that I’m about to show ya\nI’m the best ‘cause I gotta\nThe devil wears Prada\nAnd he’s got a boom boom like Welcome Back, Kotter\nLeave your guy like Madonna\nGot cheese like frittata, green ensalada\nGot ya, mama\nMost rappers want the drama, but I don’t want the drama\nI just want a quiet night down at Benihana\nI rap ‘cause I gotta\nDude’s got nada\nI make ‘em all proud like my middle name Obama", "image": "https://images.genius.com/78bea76bf210cec3130c214f2a4ab5f7.800x800x1.jpg"}], "artist": "Childish Gambino"}