{"songs": [{"title": "Sexual Eruption", "album": "Ego Trippin’", "year": "2007-11-20", "lyrics": "[Bridge]\nI'm gonna take my time\nShe gon' get hers before I\nI'm gonna take it slow\nI'm not gon' rush the stroke\n\n[Chorus]\nSo she can get a sexual eruption\nSo I can get a sexual eruption\nSo we can get a sexual eruption\nSexual eruption, whoa, whoa\n\n[Verse 1]\nShe might be with him but she's thinkin' 'bout me, me, me\nWe don't go to the mall, we don't go out to eat, eat, eat\nAll that we ever do is play in the sheets, sheets, sheets\nSmoke us a cigarette then go back to sleep, sleep, sleep\nCause we done got a\n\n[Chorus]\nSexual eruption\nSexual eruption, whoa, whoa\nSexual eruption\nSexual eruption, whoa\n\n[Bridge]\nI'm gonna take my time\nShe gon' get hers before I\nI'm gonna take it slow\nI'm not gon' rush the stroke\n\n[Verse 2]\nIf you don't know by now, Doggy Dogg is a freak, freak, freak\nI keep a bad bitch with me seven days out the week, week, week\nAnd all that we ever do is play in the sheets, sheets, sheets\nThen smoke us a cigarette, then go back to sleep, sleep, sleep\nCause we done got a\n\n[Chorus]\nSexual eruption\nSexual eruption, whoa, whoa\nSexual eruption\nSexual eruption, whoa\n\n[Verse 3]\nI was all in the club, sippin' some Hen, smokin' on a blunt of 'dro\nWhen I peeped this lil' ho out\nI was all in the bar, wind drift up\nShawty Redd came on, then she hit the floor now\nWith a see-through, dress, long hair, light brown eyes\nLookin' like Ms. Bo Peep\nAnd a nigga know if I take her home, with them wide ass hips\nYou damn right, I'm gon' beep\nSo I approached the chick with the real pretty face\nBig ass booty with a little bitty waist\nI whispered in her ear, \"Lil' mama, what you drink?\"\nI know that you a freak, but you know I ain't gon' say shit\nSee, my game is outrageous\nI got her to the crib and exchanged some fuck faces\nBut it wasn't no use for me to rush to bust one\nCause I wanted her to have a eruption\n\n[Chorus]\nSexual eruption\nSexual eruption, whoa\nSexual eruption\nSexual eruption, whoa, whoa\n\n[Outro]\nSexual eruption\nAll the time, anytime\nSexual eruption", "image": "https://images.genius.com/d91706948a1305031ccf909293e04302.220x220x1.jpg"}], "artist": "Snoop Dogg"}