{"songs": [{"title": "Still Brazy", "album": "Still Brazy", "year": "2016-06-03", "lyrics": "[Intro]\nAyy! This shit\nThis shit, this shit\nMy life, my life\nNigga, this shit brazy\nUh, nigga, this shit brazy\nThis shit, this shit\nThis shit brazy\nThis shit, this shit\nThis shit brazy\nNigga, this shit brazy, oh Lord!\nOh, this shit brazy\n\n[Verse 1]\nLook at my life\nBeen through it all, got bullet wounds twice\nStill don't know where it came from, yikes\nWhy everybody want a piece of my pie?\nI, I, gotta keep guns with me\nShit real, I ain't tryna be pretty\nParanoia got this Henny in my kidney (Woo)\n'Cause I don't know if they're with me or against me (Woo)\nThey always said this was how it's gon' be\nBut me... I ain't wanna believe\nThey don't wanna see a nigga with the green (With the green)\nThe reason for the 40 cal with the beam (With the beam)\nThe devil's on me, got me trippin'\nI used to party out with Scotty like Pippen\nNow I don't trust niggas, and I stopped invitin' bitches\nOver to the crib, they can't know where I'm livin'\n\n[Chorus]\nShit brazy, brazy, brazy, brazy, brazy\nThis shit, nigga, this shit brazy, brazy, brazy, brazy, brazy\nOh, this shit, this shit\nThis shit brazy, brazy, brazy, brazy, brazy (Oh Lord)\nOh, Lord, nigga this shit brazy, brazy, brazy, brazy, brazy\nOh, shit, this shit, this shit\nThis shit brazy\n\n[Verse 2]\nVerse two (Verse two), verse two (Verse two)\nI got too much to spit for verse two (Verse two)\nJust be careful on how you approach dude\nCause he done already heard about what you wanna do\nParanoia, paranoia\nParanoia down in killer California\nWhat's their motive? What's their motive?\nShit, I'm the closest with some money that they know of\nLady problems, family problems\nHomies problems, all this drama\nOn my mama, this the type of shit you sweat out in the sauna\nGrandma pray for me, devil keep away from me\nFell out with my day one, that was my ace to me\nMind blown, somethin' different what I'm on\nAll this shit got me in another rhyme zone\nLately, I've been at home\nI grab the pistol when I answer the door\n\n[Chorus]\n'Cause shit brazy, shit brazy, brazy, brazy, brazy\nThis shit, nigga, this shit brazy, brazy, brazy, brazy, brazy\nOh this shit, this shit\nThis shit brazy, brazy, brazy, brazy, brazy (Oh Lord)\nOh Lord, nigga this shit brazy, brazy, brazy, brazy, brazy\nThis shit, this shit\nThis shit brazy\n\n[Verse 3]\nI ain't F with this, but I F with this\nCan't complain about it, gotta find out where he gonna master it\nGotta put cameras all around the crib\nGotta, gotta wear the vest like a bib\nGot some, got some problems, why a whole lotta\nSo I stay dangerous, Osama\nNigga say they heard about a million dollars\nSo I gotta bulletproof the Impala\nMan, I'm 'bout to lose it\nHomies I'm confused with\nMoney get involved, it's all bad, they switch too quick\nIt's too sick, thought you was realer, my nigga\nGot popped, you ain't do shit\nThought you was my killer, my nigga\nOh! Shit get realer, my nigga\nWhen niggas know you gettin' skrilla, my nigga\nI don't know what's gotten into my nigga\nClose from day one, I was with him, my nigga\n\n[Chorus]\nThis shit brazy\nThis shit, nigga, this shit brazy, brazy, brazy, brazy, brazy\nOh this shit, this shit\nThis shit brazy, brazy, brazy, brazy, brazy (Oh Lord)\nOh Lord, nigga this shit brazy, brazy, brazy, brazy, brazy\nOh shit, this shit, this shit\nThis shit brazy, brazy, brazy, brazy, brazy, brazy", "image": "https://images.genius.com/6d9597606099b223fdd3ad68fa232887.1000x1000x1.jpg"}], "artist": "YG"}