{"songs": [{"title": "When I Get Free", "album": "Until the End of Time", "year": "1997-11-25", "lyrics": "[Intro: 2Pac & J. Valentine]\nDamn, what I'ma do now til when I free.. oh shit!\nWait wait (motherfuck..) get free.. yeah yeah\n\n[Hook]\nWhen I get free, motherfuckers better watch they ass\nSoon as I get released, I'ma clock some cash\nDid some time locked down, but I'm back on the street\nThere'll be trouble when they see me\nWhen I get free, motherfuckers better watch they ass\nSoon as I get released, I'ma clock some cash\nDid some time locked down, but I'm back on the street\nThere'll be trouble when they see me\n\n[Verse 1]\nThem bitches is foul, take a look at the evening news\nAnd see a nigga gettin' cuffed by the boys in blue\nIs it a, frame up, tryin' to keep me out the game, stuck\nThese motherfuckers tryin' to dirty up my name, but\nI'm slippin' quick as the wind, it's me or them\nFuck friends my foes be on a mission tryin' to do me in\nFuck 'em I'm bout to get out, they all soft\nI blow up my new range, and in a rage blow they balls off\nWhy are you niggas tryin' to test me trick?\nAnd be the first ones to snitch to arrest me bitch\nMain thang with nigga meal ticket only if you with the real\nThe nigga will kick it I'll enforce it with the steel\nUse the lessons that I learned in jail\nRule one: fuck a busta he can burn in Hell\nNetworkin' with connects that I got in the pen'\nIn no time, I'll be clockin' again\n\n[Hook] + [J. Valentine's harmonizing]\nWhen I get free, motherfuckers better watch they ass\nSoon as I get released, I'ma clock some cash\nDid some time locked down, but I'm back on the street\nThere'll be trouble when they see me\nWhen I get free, motherfuckers better watch they ass\nSoon as I get released, I'ma clock some cash\nDid some time locked down, but I'm back on the street\nThere'll be trouble when they see me\n\n[Verse 2]\nStill sittin' in my cell as I dwell on my past\nTryin' to figure how a nigga turned dreams into cash quick\nCall her collect, ain't no respect on the other side\nMy cellmate's suicidal 'cause his mother died\nAnd my C.O. is a lady, and I'm thinkin' maybe\nMe and her can hook up a scheme, to be Swayze\n'Cause she keep on callin' me baby\nTo a young motherfucker facin' eighty that's enough to make you crazy\nNow how long will it take, to get her hooked\nGot her watchin' me liftin' weights, sneakin' looks\nI devised a plan, I'm in the trunk while she drives the van\nAin't no disguise I'ma die as a man\nIf we make it then I'm takin' it to Hell\nAll them niggas that was frontin' while I sat up in the cell\nLocked in jail, I couldn't touch her so I planned your misery\nThe nigga you don't wanna see\n\n[Hook] + [J. Valentine's harmonizing]\nWhen I get free, motherfuckers better watch they ass\nSoon as I get released, I'ma clock some cash\nDid some time locked down, but I'm back on the street\nThere'll be trouble when they see me\nWhen I get free, motherfuckers better watch they ass\nSoon as I get released, I'ma clock some cash\nDid some time locked down, but I'm back on the street\nThere'll be trouble when they see me\n\n[Verse 3]\nStuck in my cell\nThe pen' ain't nuttin like the county jail\nWhen will they let me bail?\nWalkin' through the yard, I play the guard\nFirst nigga disrespect me, first nigga gettin' scarred\nI'm, back on the scene\nI'm hittin' knees in the back of a limousine, puffin' on weed\nAs we game on the drunk hoes\nHit the skunk I reminisce just on the way, we used to play, you punk hoes\nWhat I possess is to be rich, in currency\nParanoid niggas like bitches when they come and see me\nLaid out, played out, the nigga barely breathin'\nAs for that bullshit punk, nigga n-now we're even\nBut I wait, until it's time\nAnd try to find a crooked way to profit off this crime\nThis life of mine... until I get free\nMy prophecy is niggas screamin', as if they bleed in agony\nAs soon as they popped my gate\nI knew these motherfuckers made a mistake\n\n[Hook] + [J. Valentine's harmonizing]\nWhen I get free, motherfuckers better watch they ass\nSoon as I get released, I'ma clock some cash\nDid some time locked down, but I'm back on the street\nThere'll be trouble when they see me\nWhen I get free, motherfuckers better watch they ass\nSoon as I get released, I'ma clock some cash\nDid some time locked down, but I'm back on the street\nThere'll be trouble when they see me\nWhen I get free, motherfuckers better watch they ass\nSoon as I get released, I'ma clock some cash\nDid some time locked down, but I'm back on the street\nThere'll be trouble when they see me\n\n[Outro]\nWhen I get free\nHahaha.. yeah nigga, when I get motherfuckin' free\nPop the gate, I'm back baby!\nWhen I get free.. we up out this bitch", "image": "https://images.genius.com/c9ad2e7e47416054e9c550bf81baa724.220x220x1.jpg"}], "artist": "2Pac"}