{"songs": [{"title": "Headlines (Remix)", "album": "Back 2 The Throne", "year": null, "lyrics": "[Intro: T.I.]\nYea, Ha! Ok well\nI suppose it's safe to say\nThis is the end for you\nAnd the beginning for me\n\n[Verse 1: T.I.]\nI'm a real nigga, nothing artificial\nI run with former drug dealers and they all official\nI know you soft as tissue, so ain't no arguing wit you\nSay its all fun and games 'til them bottles hit you\nGet ya issue if you wanna I don't play it dawg\nYou don't wanna see them killers wit the K's dawg\nZone One Westside of the A dawg (Bankhead!)\nYou thinkin we some suckas, you was way off\nI ball all night, go hard all day, balls deep up in your broad all day\n\"T.I. not fly,\" that's all yall say, big bankrolls and massage all day\nNever mind they blasé, blasé, just menagé and parlay\nWith some Latin hotties, outta Hollywood in my Denali\nAye, flawless bodies, gorgeous faces, safe to say they goin places\nGreat head, wet pussy, touchin' bust or bases\nAye, shawty goin in, won't ever go away\nAnd all that goin ape shit, ain't no need to tell em they know!\n\n[Hook: Drake]\nThey know, they know, they know\nThey know, they know, they know\nThey know, they know, they know\nThey know, That the real is on the rise\nFuck them other guys\nI even gave 'em a chance to decide\nNow it's something they know\nThey know, they know, they know\n\n[Verse 2: Drake]\nI be yelling out, \"Money over everything, money on my mind\"\nThen she wanna ask when it got so empty\nTell her, \"I apologize, happened over time\"\nShe says they miss the old Drake, girl, don't tempt me\nIf they don't get it, they'll be over you\nThat new shit that you got is overdue\nYou better do what you supposed to do\nI'm like \"why I gotta be all that?\"\nBut still I can't deny the fact that it's true\nListening to you expressing all them feelings\nSoap opera rappers, all these niggas sound like \"All My Children\"\nAnd that's who you thinking is 'bout to come and make a killing\nI guess it really is just me, myself and all my millions\nYou know that they ain't even got it like that\nYou gonna hype me up and make me catch a body like that\nCause I live for this, it isn't just a hobby like that\nWhen they get my shit and play it, I ain't even gotta say it\nThey know\n\n[Hook]\n\n[Outro]\nI be yelling out, \"Money over everything, money on my mind\"\nTell her, \"I apologize, happened over time\"\nThey know", "image": "https://images.genius.com/c894c3152f72ae90e1494d821e111ee2.450x450x1.jpg"}], "artist": "T.I."}