{"songs": [{"title": "We Don’t Care Anymore", "album": "D.I.G.I.T.A.L.", "year": null, "lyrics": "[KRS-One: repeat 2X]\nWe don't care anymore (care anymore)\nWe don't share anymore (share anymore)\n\n[KRS-One]\nI'll keep on bringin and singin until your ears is ringin\nAnd stingin flingin and gleamin true MC'n with meanin\nIt's seemin we fiendin for all the cream and all the screamin\nThe demon got us believin in schemin, rhymin for no reason\nEvery weekend we weakened, discipline is what we needin\nBut we too busy freakin to understand divine speakin\nIs anyone out there tryin to make it better?\nOr is all of hip-hop about the cheddar? Whatever!\n\n[Hook 2X: KRS-One]\nYou don't care anymore (care anymore)\nWe don't share anymore (share anymore)\n\n[KRS-One]\nWe don't share and care no more, we think this one's about lust\nIn every debate we create more hate and mistrust in us\nJudge not least ye may be judged, show understandin\nYou don't know anyone's plan in life, it's so demandin\nThis one rippin off that one, that one rippin off this one\nListen, givin is livin and livin is givin, you listenin?\nOur culture we pissin in, pissin on\nRappin for platinum plaques but when live, can't get it on\n\n[Hook]\n\n[DMX]\nWhat a response, from the Bronx, to wreck shit, when it's hectic\nPlayers wanna be stars, instead of being respected\nThat's somethin that I won't do of course, I break 'em off\nStraight from the source, they think they boss, when they lost\nTryin to force it, when it don't fit, I'll bust you down and I won't quit\nMics and money you won't get, when dogs don't do that dope shit\nNow turn it around and peep it, make sure to keep it a secret\nI come down with that deep shit, straight out the sky I speak it\n\n[Hook]\n\n[singer]\nSomehowwwwww, we got lost\nAnd now our sharing, is gone\nNo one cares, no one shares\nWe gotta make it right, so we all can unite", "image": "https://images.genius.com/d939bce0d325273abe25cbd9cbdf5405.455x450x1.jpg"}], "artist": "KRS-One"}