{"songs": [{"title": "Dope Fiend Beat", "album": "Born to Mack", "year": "1987-07-20", "lyrics": "Bitch!\nFunky fresh from Oakland, California...\nDangerous Music and it don't stop to the beat, baby...\n\nBitches on my mind\nI can't hold back, now's the time\nAll you loud-mouth bitches talk too much\nAnd you dick teasing bitches never fuck\nI seen a long-hair bitch, working extensions\nHer hair ain't really but two inches\nAll you bald-head hoes in the Oakland world\nRunning 'round town with Jheri curls\nNappy head niggas like myself\nGet a bald-head and say, \"Go to hell!\"\nBut you's a snake, you's a worm\nYou bald-head bitch, you need a perm\nSo much game when the homies tough\nI make a bitch blow who never sucks\nIt really ain't a lie, but I just met her\nNow I'm saying, \"Bitch, suck better!\"\nFuck you, stupid ho, tell me just what you know\nI came to the party and turned it out\nYou said, \"Ooh, he's got a dirty mouth!\"\nBut, bitch, I kept talking shit\nMother fuck you, damn shit-head bitch\nI want a blowjob and I'm not kidding\nWork it in your mouth till your head starts spinning\nI'm that nigga you'll answer to\nIf I say, \"Bitch, jump!\", that's what you'll do\nI'm a fast talking con man blowing your mind\nBreaking you and your cousin at the same time\nWith my dirty rap coming out my mouth\nAnd you know damn well what I'm talking about\nI'm the Too $hort, baby, way too cold\nSo mother fuck you, bitch, goddamn ass ho\n\nThe dope fiend beat...\nFor all you junkies to just rock...\n\nH-E-A-D, I need a doctor just for me\nTo suck my dick like a vet\nTo give me head until I sweat\nShe's gotta suck dick\nSo I can tell all my homies just what she did\nShe sucked and sucked and she's a bitch to the beat\nOf Too $hort, I said my name is Too $hort and it don't stop\nI love you bitches for the blowjobs\nI just laugh over and over\nWhen the bitch drinks sperm like it's a soda\nI straight start aiming, woops I missed\nGet back bitch, we'll never kiss\nI say she looks so good and she's so thick\nBut, man oh man, that bitch can lick\nIf I want it I could rock her\nBut I can't fuck no-head doctor\nBitches don't know that Too $hort's tip\nYou might get G'd if you don't suck dick\nBut I'm so fresh, I'm so down\nI tell you bitches the other way around\nIf you do me first, well I'll do you\nSo the game jumps off when the bitch is through\nSoon as I come all in her mouth\nI smooth get dressed and roll out\nI'm Too $hort, baby, fresh fresh again\nOne MC, one bitch broken\nI tell you, baby, playing just like that\nI'm the best of the greatest of the ice cold rap\nAnd, bitch, you're just a bitch\nYou work fast food and you think you're rich\nYou see, my game don't stop when it's on the one\nI love to see you when you work that tongue\nGetting real busy in the back of the car\nRolling down the Skyline Boulevard\nI said, \"Bitch, what are you smoking?\"\nA big fat dick in the big East Oakland\nI see my homie, he needs to quit\nHe was walking down the street with a big fat bitch\nMaybe I'm wrong he might collect\nEvery two weeks that welfare check\nOakland, California, is the city of snakes\nPimps, pussies, players and fakes\nThe big Oaktown, the city of liars\nFresh Star Wires and Vogue tires\nA strip, bitches, nasty freaks\nMy raps, homeboy, with tremendous beats...\n\nShe's a bitch to the dope fiend beat...\nAll you junkies just ride...\n\nBitches on my mind\nI can't hold back, now's the time\nBust a left nut, right nut, in her jaw\nOpened my eye, guess what I saw\nBitches on my mind\nGrabbed the microphone then I started to rhyme\nWhat would life be if it wasn't Too $hort\nIt'd be nothing but rappers from the old New York\nBut that's not likely and there's no doubt\nBitches like me cause I'm turning it out\nI'm here, there, everywhere\nSporting fat rope, babies, I'm a mother fucking player\nRecognize game when it's in your face\nAs you dip to the beat when you feel the bass\nCrank it up loud, would be doing fine\nPose like a pimp and check my rhyme\nSome young tender doesn't like this beat\nBut a bitch ain't nothing but a word to me\nI can check her, wreck her, or just get paid\nCut to the house and freak my maid\nYou see, you can't speak English but we don't talk\nCall her Lucy and she's juicy, makes your eye balls walk\nWe never hesitate to make good love\nShe clean up my house and then clean me up\nSo check it out, all you bitches\nI tell a story 'bout rags to riches\nSo check it out, freak nasty\nI know you're fine but you look like Lassie\nBitch, not a long ago I used to hang at the mall\nTop floor, baby, all the freaks I called\nAnd if they didn't want to come. well that ain't shit\nI just drop a few lines and then call her a bitch...\nBitch!", "image": "https://images.genius.com/2cbe54aeda332def6155f0b3b28b1321.1000x1000x1.jpg"}], "artist": "Too $hort"}