{"songs": [{"title": "Pretty Bitches", "album": "The Return of Mr. Zone 6", "year": "2011-03-22", "lyrics": "[Intro]\n\"Listen to the track BITCH!\" echoes\nAy yeah girl... ay yeah\n(Brrr, brrr, brrr, brrr) Gucci (brr-brr!)\n\n[Hook: Gucci Mane]\nThe pretty bitches love me, them bitches love me\nI think them bitches love that I'm a bottle popper\n\n[Gucci Mane]\nShe caught up in my love triangle\nI used to sell them things in triangles\nAnd that was when I was in the eighth grade\nNow I'm self made; and I'm high paid\nNigga you ain't even in my tax bracket\nI'm pulling Gucci denim off the clothes racket\nGucci man, it's the Gucci crew\nBrick Squad rappers, nigga who are you?\nWhat it do nigga? What's poppin?\nBy them 30 next summer we droppin\nWe back again, yeah we back again\nAnd we gotta win, she wanna be my friend\n\n[Hook]\n\n[Gucci Mane]\nI pull up in that black and red Challenger\nA com-pe-tition, where the challengers?!\nI pull up in that 'Rari with them other ones\nAnd thinkin 'bout it, I'm goin and gettin another one\nGucci Mane I run the land from Africa to Pakistan\nUnderstand and overstand, Gucci Mane in Overland\nWhat a fine ass yellow bonnnnnnnnnne\nShe got it goin on\nNow I got so many chains on they don't know what's goin on\nFind your number in my phone and don't know what be goin wrong\nFind the number in my phone and don't know what be goin wronnnng\nShe had it goin on\n\n[Hook]\n\n[Wale]\nBrr, brr, ay, lemme see, okay\nA-T-L they know my name, Magic City throw some change\nFlyest nigga in this bitch, and I don't even own no chain\nTake yo' chick, with no complaints, she say my shit oh so great\nAnd that's why she been feelin me.. and y'all got that novocaine\nGo for mine, that ball shit, pour Ciroc 'til I'm nauseous\nStuck up when, she sober when, she rollin got no conscience\nShe OD's on Louboutin, she work at that nudie bar\nTold her do it for the money, get your Cameron Newton on\nGreen we can all burn(AuBurn), 'til I am the highest man(heisman)\nY'all a bunch of pussies, why the fuck y'all near the lion's den?\nPaper planes, pilotin, Y-S-L attirin'\nWay a nigga be in gals you'd think I know Esiason\nBurrrr!\n\n[Hook]", "image": "https://images.genius.com/8ddfda01230feb29c58165317045692f.640x640x1.jpg"}], "artist": "Gucci Mane"}