{"songs": [{"title": "Who’s Real (Ruff Ryders Remix)", "album": null, "year": null, "lyrics": "[Swizz] Ruff Ryders, we back\n['Kiss] AH-HAH!\n[Swizz] You know the streets don't know how to act\n\n[Intro: DMX]\nLet's go! (OKAY!)\nThat's what it is man, ya mean? (yeah!)\nIt don't change baby, geah!\nWe got 'Kiss on the joint! (c'mon!)\nC'mon, we got Swizz on the joint! (c'mon!)\n\n[Hook: Swizz Beatz] + (DMX)\nHe's phony, she's fake (she's fake!)\nThat's the type of people I hate (I hate!)\nIf you real and you know it clap your hands (clap your hands) {​​*clap clap*}​​\nIf you real and you know it clap your hands (clap your hands) {​​*clap clap*}​​\n\n[Interlude: Swizz Beatz] + (DMX)\nWait a minute - who's real, who's not? (who's not?)\nShe's real, but he's not (he's not!)\nIf you real and you know it clap your hands (clap your hands) {​​*clap clap*}​​\nIf you real and you know it clap your hands {​​*clap clap*}​​\n\n[Jadakiss] + (Swizz)\nRemix, uh-huh, remix\nClap clap, clap, AH-HAH! (Jada Jada!)\n\nYo, you know what I do to you\nTurn your festivities right into a funeral, the body look beautiful\nNow you could let 'em know it's real wherever 'Kiss at\nYa face get broke though, I don't know who could fix that\nMight have to ask 'Ye that, I don't play that\nI was movin that Vana White before Sajack\n500 stacks in the condo, pronto\nHandshakes, eye contact when I convo\nFake and the phony don't mix\nReal homies roll thick, real Roleys don't tick\nYou're lyin - and your stupid ass chains\nHow the fuck you expect people to believe them is real diamonds (E-V-E!)\n\n[Eve] + (Swizz)\nNow.. who's fake, who's real?\nTop chick in the game wear the crown still\nYeah, I vacated for a while\nMocha tan got ya man goin wild\nMaserati the body, charmed out the Bugatti\nCan't nobody stop me, all they could do is watch me\nNow freeze (freeze) chill (chill)\nWhere my ladies in the place that's real? (oh yeah)\n\n[Hook] - without DMX ad libs\n\n[Drag-On] + (Swizz)\n(Get 'em Drag!) I go to sleep as a gremlin and wake up as a demon\nBe a four-headed monster by the afternoon\nNow the nigga sold me a scope and the lens don't zoom (so what?)\nNow I gotta run up on 'em, BOOM!\nMy flow sound like the definition of Attica\nExtended the A-R to give it more stamina\nKnock knock, who's the next challenger?\nSo I can embarrass 'em on camera (S.P. the Ghost)\n\n[Styles P] + (Swizz)\nI'm like Billy the Kid or Bill Gates\nDeal with the real and never the real fake\nE'rybody hustlin and they all deal weight\nWhen they get around them thugs they don't all feel safe (bounce on 'em)\nEvery rapper Blood or Crip that gon' bang\nYou be with the cops who's soft ass gang\nCome to D-Block you would've lost that chain\nOr an M-16 woulda offed yo' brain (D-Block, Sheek Louch!)\n\n[Sheek Louch] + (Swizz)\nIf you keep that hammer on your waist, clap your hands\nNo jewelry, just a couple rubber bands\nYeah, you real and you know it, take the skinny jeans back\nTake the Auto-Tune off and stop actin all soft\nIf you love it in the hood, clap your hands\nLate night strip club, mami do the dance\nYeah, Sheek Louch, Donnie the Gorilla got cake yo\nLay low, eyes closed, I see who's fake though (Ruff Ryders!)\n\n[Hook]\n\n[DMX]\nOkay okay, let 'em go, Dog keep them fightin\nNiggas don't know then, let's get to fightin\nY'all walk like that, but I walk like this\nY'all look the other way but I'm startin shit\nFuck y'all niggas who ain't built like Dog\nB.F.W. - Built For War!\nI LIKE this hook, I LIKE this beat\nThis the type of shit that let me talk to the street\nBeen in the game, winnin the game\nStill in the game, cause of you it's still a game\nY'all niggas is still playin, but I don't (NOT)\nY'all niggas apologize, but I won't (NOT)\nLet Dog go last to air shit out\nBeast on the track, I'mma bear shit out\nGo go gorilla! I'm a hostile nigga\nThat's what you get for runnin your mouth niggas\n\n[Outro: Swizz Beatz]\nRuff Ryders, Ryders, Ryders, Ryders...", "image": "https://images.genius.com/34d1815281afeb502b98075367058136.453x453x1.jpg"}], "artist": "Jadakiss"}