{"songs": [{"title": "No. 99", "album": "B4.DA.$$", "year": "2014-12-09", "lyrics": "[Chorus]\nWhat's my name? What's my name?\nBadmon\nWhat's my name? What's my name?\nBadmon\nWhat's my name? What's my name?\nBadmon\nWhat's my name? What's my name?\nBadmon\nWhat's my motherfuckin'—?\n\n[Verse 1]\nReady to bust my gun, I'm rushin' in like Vladimir Putin\nWhat you want son? Fuck a rou-, let's get shootin'\nThe 47 Goonz recruitin', join or die\nWe comin' for groups of guys in suits and ties\nWho choose to hide truth from the eye\nGrab a white collar by his white evil eye\nFight or flight, yo, that's just what it is\nWhen you see a pig, hit him in his baby back ribs\nBut don't trip, I'm just another black kid, caught up in the mix\nTryna make a dollar outta 47 cents\nYo, this shit is intense, a dumb cop stoppin' me, probably\nCause he's still livin' in the past tense, how shit was back then\nThey wanna see the downfall of all black men\nAnd African, I was sent to put action in\nBut what's new when the po keep flashin' in?\nNews flash niggas, get a news flash\n\n[Chorus]\nWhat's my name? What's my name?\nBadmon\nWhat's my name? What's my name?\nBadmon\nWhat's my name? What's my name?\nBadmon\nWhat's my name? What's my name?\nBadmon\nWhat's my motherfuckin'—?\n\n[Verse 2]\nThese niggas ain't ready for the war\nKnow what I'm 'bout, cut the cheddar, close your drawer\nPlease put your bread up\nWe ain't gon' settle for no iceberg lettuce\nLet us eat when there's war\nOr end up like venison meat in the street\nThey're not ready for beef\nLet the fish burn in the pot, niggas all in the spot\nWhen it turns 12 'o clock then, we'll be curvin' the block\nYo cut this shit\nMan, I'm the best in the sector\nGet your ear buds to grip, then I dissect ya\nInject ya with my lethal weapon\nPlant a mine in the deepest section, guess who's least expected\nMothafucka please respect it\nThe last one to pull my card was easily dealt with\nThey felt it, the shift, records can't be reckoned with\nOn tracks wreckin' shit, ask me why I'm reckless\nBreak a wrist, approach my demo with a risk\nBrought my demo listens, I'm a demolition specialist\nI got the blueprint to this shit, Jay to the Oh Vee\nIf Blue was a prince, I'm still Joseph Kony\nNiggas know they can't ever little bro me\nNo matter how big they blow, they still a little below\nIt's the P-R-O E-R-A, indigo with the killer flow\nGuaranteed the realest that you ever saw\n\n[Chorus]\nWhat's my name? What's my name?\nBadmon\nWhat's my name? What's my name?\nBadmon\nWhat's my name? What's my name?\nBadmon\nWhat's my name? What's my name?\nBadmon\nWhat's my motherfuckin'—?\n\n[Outro]\nThe Badmon, young kingpin\nI move dope with that ink pen\nBeen up all night—my third eye ain't even blinkin'\nFuck what you thinkin'\nNumber 99, never trust no swine\nLick a shot one time\n\n[Produced By: Statik Selektah]", "image": "https://images.genius.com/bbff07660e1fc4007cfbbcb25dcf525b.986x986x1.jpg"}], "artist": "Joey Bada$$"}