{"songs": [{"title": "Wedding", "album": "Faces", "year": "2014-05-11", "lyrics": "[Intro]\n\"Okay, you work a God damn lousy job, you know. You come home at night, you're tired. What are you going to do? Go to a movie? Turn on your radio? Hell no. You're going to get a bottle of whiskey and drink it, and go down to a bar and maybe get in a fist fight and meet some bitch. Something's going on. Then you'll go to work the next day, and do your simple little things, right?\"\nYeah, yeah, yeah\n\n[Verse 1]\nMy bitch can tell that I'm addicted to pussy, she looking past it\nThe smile that she faking is tragic, hate looking at it\nThat magic I tried to grasp it, she's had it with the dramatics\nFantasizing love so classic\nAttracted to what she got up in her attic\nCan we mind fuck?\nDo I lie when I look inside her eyes? Hush, don't say a word\nI know I make you hurt, sorry is my favorite word\nI don't deserve your trust, but can we make it work?\nI hate to end the story\nCan we wait until the morning to decide on it?\nSpend this time pretending it was that first summer\nWe was pure lovers\nShe was used to being hurt, I took that curse from her\nSometimes I wonder what it's all for\nYou wish that I would call more\nYou're sick of seeing condoms in my sock drawer\nLoves turns to war so quickly\nI envisioned us married and 50\nCouple of kids that we drop off at little league\nI'm addicted to you\nYou only want the best, I need to listen to you\nI'm fucking other girls wishing it's you\nFuck the bullshit, we in love\nI'm a mess, but can you clean me up?\n\n[Hook]\nGirl I'm the worst\nYea, I know that I'm the worst\nYea, but you're something I can't lose\nLet me just tell you the truth, that'd be a first\nGirl I'm the worst\nYea, I know that I'm the worst\nDon't know what I gotta do\nJust love you so much that it hurts\n\n[Verse 2]\nAnd I see you falling victim to the thirst\nAll the sins you committed\nYou could probably use a couple minutes in church\nBut, for what it's worth, I think you're perfect\nThere's an angel hiding underneath your surface\nYeah, the woman of my dreams, I'm looking at her sleep\nThe pussy right in-front of me, I shouldn't be so weak\nWhat did I do to deserve a love like this?\nYou see her shining? That's my sunlight bitch\nI'm sick of fighting, that smile is so inviting\nI see you every time I'm writing\nI'm losing to all my vices, they kicking my ass\nI hold on to this feeling, I wish it would last\nDon't wanna lose you for some evil I did in the past\nYou knew I fucked that bitch and you didn't react?\nGirl, it's me and you, how simple is that?\nGave me all your love and now I'm giving it back\nBut I know, that\n\n[Hook]\nGirl, you the worst\nYeah, you know that you the worst\nBut I'm something you can't lose\nIf you just told me the truth, that'd be a first, but\nGirl, you the worst\nYeah, you know that you the worst\nEvery time you say you sorry\nEverything you do just feel like it's rehearsed", "image": "https://images.genius.com/cb728ec66cfad5964e15291c3c4a294c.375x375x1.jpg"}], "artist": "Mac Miller"}