{"songs": [{"title": "Crime Stories", "album": "Walking with a Panther", "year": "1989-06-09", "lyrics": "{*Judge talking*}\n\n[Verse 1]\nTwent-five years in the state penitentary\nTried to pull off the biggest crime of the century\nPulled out the ten-side nine milimeter\nWent out to rob, sticking up sweeter\nNever had a job you gonna work for ya\nMajor escape but a basehead saw ya\nYou got it under control, you rock and roll\nCrime is in your soul, you go on for the goal\nComin' home late with your trigger finger aching\nGot in the beef for some buckwilds (?) they making\nDrivin' fast, I can lay in the lane\nCaught with a kilo, now explain!\n\n[Hook]\nDon't do the crime, if you can't do the time\n(Crime Stories!)\nDon't do the crime, if you can't do the time\nDon't do the crime, if you can't do the time\nDon't do the crime, if you can't do the time\nDon't do it!\n\n[Verse 2]\nUzi's, nines, forty-fives and Macks\nCocaine on the brain, gold chains and jacks\nHitman for hire, big contracts\nIn fact he got macked cause the eye-contact\nBought a .38 so now he's a wanna-be master\nCome on, baby, I eat steak and lobster\nI got a Mercedes-Benz, I be as double-(?) as your friends\nBut what about the hidden camera lens?\nCortex-style, but you're countin' that money\nThen the brothers who diss think they sooo funny\nThey took yours - you thought you was nice\nBut now pay the price - they put you on ice!\n\n[Hook]\n\n{*Judge talking*}\n\n[Verse 3]\nGuilty! You get paid for crime\nI get paid to rhyme on time and in my mind\nI see I might have to find a even harder groove\nI got a smarter move\nNo crime no time, now that's smooth\nWho wants to play a cell and waste time as well\nI'd much rather be L than in hell\nCause I might never go and stick up sell\nAnd end up like them with dry pistol smell\nI'd much rather earn mines and get mines\nMake up stacks and cracks and write def rhymes\nHe cuts so quick and I'm sharp as a knife\nI got sentenced to rock, 25 to life!\n\n[Hook]\n\n[Verse 4]\nCut-throat killer, proud of the fact he kills\nHe got in the beef, he said stand back to chill\nPulled out the gun, the crowd started to run\nBOOM! (?) boy is done!\nWent around braggin', yeah boy I dit it, I admit it\nThe description of the killer - I fit it\nIf the cops wanna catch me, they better come with it\nI shot the bullet and homeboy bit it\nLike a (?), I put a pounder\nI'm fond o' kill or be killed, long as my pockets get rounder\nI'm on my own, I'm alone, and I roll for me\nCaught with a pistol -1-2-3", "image": "https://images.genius.com/35b951a9c90707d0d03de9bebbadefc6.999x999x1.jpg"}], "artist": "LL Cool J"}