{"songs": [{"title": "HiiiPoWeR", "album": "Section.80", "year": "2011-04-12", "lyrics": "[Intro: Kendrick Lamar]\nEverybody put three fingers in the air\nThe sky is falling, the wind is calling\nStand for something, or die in the morning\nSection.80, HiiiPoWeR\n\n[Verse 1: Kendrick Lamar]\nVisions of Martin Luther staring at me\nMalcolm X put a hex on my future, someone catch me\nI'm falling victim to a revolutionary song, the Serengeti's clone\nBack to put you backstabbers back on your spinal bone\nYou slipped your disc when I slid you my disc\nYou wanted to diss but jumped on my dick\nGrown men never should bite their tongue\nUnless you eating pussy that smell like it's a stale plum\nI got my finger on the mothafuckin' pistol\nAiming it at a pig, Charlotte's web is going to miss you\nMy issue isn't televised, and you ain't gotta tell the wise\nHow to stay on beat, because our life's an instrumental\nThis is physical and mental, I won't sugar coat it\nYou'd die from diabetes if these other niggas wrote it\nAnd everything on TV just a figment of imagination\nI don't want plastic nation, dread that like a Haitian\nWhile you mothafuckas waiting, I be off the slave ship\nBuilding pyramids, writing my own hieroglyphs\n\n[Chorus: Kendrick Lamar]\nJust call the shit HiiiPoWeR\nNigga, nothing less than HiiiPoWeR\nFive-star dishes, food for thought, bitches\nI mean the shit is, Huey Newton going stupid\nYou can't resist his HiiiPoWeR\nThrow your hands up for HiiiPoWeR\n\n[Verse 2: Kendrick Lamar]\nVisions of Martin Luther staring at me\nIf I see it how he seen it, that would make my parents happy\nSorry mama, I can't turn the other cheek\nThey wanna knock me off the edge like a fucking widow's peak, uhh\nAnd she always told me pray for the weak, uhh\nThem demons got me, I ain't prayed in some weeks, uhh\nDear Lord come save me, the devil's working hard\nHe probly clocking double shifts on all of his jobs\nFrightening, so fucking frightening\nEnough to drive a man insane, I need a license to kill\nI'm standing on the field full of land mines\nDoing the moonwalk, hoping I blow up in time\nCause 2012 might not be a fucking legend\nTryna be a fucking legend, the man of mankind\nWho said a black man in the Illuminati?\nLast time I checked, that was the biggest racist party\nSo get up off that slave ship\nBuild your own pyramids, write your own hieroglyphs\n\n[Chorus: Kendrick Lamar]\nJust call the shit HiiiPoWeR\nNigga, nothing less than HiiiPoWeR\nFive-star dishes, food for thought, bitches\nI mean the shit is, Bobby Seale making meals\nYou can't resist his HiiiPoWeR\nThrow your hands up for HiiiPoWeR\n\n[Bridge: Alori Joh]\nEvery day we fight the system just to make our way\nWe been down for too long, but that's alright\nWe was built to be strong, cause it's our life, na-na-na\nEvery day we fight the system, we fight the system\nWe fight the system (Never like the system)\nWe been down for too long but that's alright, na-na-na\n\n[Verse 3: Kendrick Lamar]\nWho said a black man in the Illuminati?\nLast time I checked, that was the biggest racist party\nLast time I checked, we was racing with Marcus Garvey\nOn the freeway to Africa 'til I wreck my Audi\nAnd I want everybody to view my autopsy\nSo you can see exactly where the government had shot me\nNo conspiracy, my fate is inevitable\nThey play musical chairs once I'm on that pedestal\nFrightening, so fucking frightening\nEnough to drive a man insane, a woman insane\nThe reason Lauryn Hill don't sing, or Kurt Cobain\nLoaded that clip and then said bang, the drama it bring is crazy\nProduct of the late 80's\nTryna stay above water, that's why we shun the navy\nPull your guns and play me, let's set it off\nCause a riot, throw a Molotov, somebody told me them pirates had got lost\nCause we been off them slave ships\nGot our own pyramids, write our own hieroglyphs\n\n[Chorus: Kendrick Lamar]\nJust call the shit HiiiPoWeR\nYeah, nothing less than HiiiPoWeR\nFive-star dishes, food for thought, bitches\nI mean the shit is, Fred Hampton on your campus\nYou can't resist his HiiiPoWeR\nThrow your hands up for HiiiPoWeR\n\n[Outro: Kendrick Lamar]\nThug Life! Thug Life!\n\n[Produced by J. Cole]", "image": "https://images.rapgenius.com/0a80f4709ff8bee2cf528bb5290862fe.400x400x1.jpg"}], "artist": "Kendrick Lamar"}