{"songs": [{"title": "MF DOOM’s Mask Through The Ages (Feature)", "album": "Masks & Makeup Through The Ages Collection", "year": null, "lyrics": "Zev Love X (1988 ~ 1993)Villain's first step into the spotlight was under his nickname 'Zev Love X' at the age of 17. He was part of the group KMD with his younger brother (DJ Subroc)  and third member Rodan, who was later replaced by Onyx the Birthstone Kid. After his brother DJ Subroc's death and the group was dropped from their label, DOOM went off the grid for half a decade.\n\nDuring his time with KMD DOOM didn't wear anything to hide his face from the public. Unless you count cap and his glasses of course...\nPre-MF DOOM (1997 ~ 1999)\"Dumile began freestyling incognito at open-mic events at the Nuyorican Poets Café in Manhattan, obscuring his face by putting a women's stocking over his head.\"\n- Wikipedia\nBefore even picking up the identity of MF DOOM, Dumile had already made the decision to cover up his face when he returned to the hip-hop scene. The quote above states he was wearing women's stockings over his face while 'KEO', who worked with DOOM on his first 2 masks, has stated he also wore a bandana over his face to conceal his identity. No real pictures of this era are spread publicly.\nPrototype DOOM mask (1999)Worn in videoclips from the 'Operation: Doomsday' album; for instance in '?'  & 'Dead Bent'\n\nDumile took on the identity of MF DOOM, based of Marvel villain Doctor Doom, and started with wearing a 'real' mask instead of stockings or a bandana.\n\n\"He cleans his metal mask with gasoline\"\n- MF DOOM on '?'\nBy the time DOOM spitted the line above, his mask wasn't even made of real metal yet. It was still just a plastic altered WWF Kane mask, also known as 'prototype'. Cleaning his mask with gasoline is for that reason probably not a good idea.\n\nExtra: Make your own MF DOOM prototype mask! ✂️\nOriginal DOOM mask (2000 ~ 2004)Worn on the album cover of Madvillainy, also in the music video's for this project and is the base for all further iterations.\n\"We went out and found the whole helmet from the movie 'Gladiator'\"\n~ Blake 'KEO' Lethem\nThe first real iteration where the mask was made out of metal. This was made shortly after Operation: Doomsday as he was seen wearing this during his performances at this point in time.\n\nThis mask, which is basically just the face plate from a dissmantled roman helmet replica from the movie 'Gladiator' enriched with construction helmet webbing, is considered to be the face of MF DOOM ever since.\nOriginal DOOM mask + Side spikes (2005 ~ 2010)Started to appear around the time DOOM collaborated with Danger Mouse as DANGERDOOM.\n\nIn 2004 DOOM was still seen with his original mask; for instance on the cover of 'Madvillainy'. 2005 was the year his album 'The Mouse and the Mask' came out. Even though the mask illustrated on the cover of this album doesn't have any side spikes, there are in fact pictures of the duo DANGERDOOM with these on the side of his face.\n\nThe overal aesthetics of the mask are identical to the original mask; only there are now two spikes located on each temperol bone.\nOriginal DOOM mask + Jewel & Side spikes (2011 ~ 2014)Can be seen in the music videos for his collaboration with Jneiro Jarel, where he appears as part of JJ DOOM. Also worn during the RedBull Music academy interview which took place in Madrid, 2011.\n\nIt basically is identical to the original mask with the side spikes, The biggest change however is that this mask has a small mostly red jewel in between the eyebrow area. On some occassions the jewel was seen in other colors, for instance cyan blue. It also looks more chrome-ish since the mask reflects more light than the others normally did.\nGolden DOOM mask (May 2014)First appeared in an announcement video DOOM made for 'Check the Rhyme' festival in France where he had a show.\n\nThis mask was the first iteration which changed the primary color of it, being gold instead of metallic/silver. Another unique detail about this mask is that appart from the earlier described masks there is a color difference in the hardware; The side spikes are still the chrome/silverish color while the rest of the mask is in fact gold.\n\nNehruvian DOOM mask (Oktober 2014)Started to appear around the time DOOM formed the duo NehruvianDoom with Bishop Nehru.\n\nWhile wearing the golden mask on the NehruvianDoom album artwork, DOOM has been seen sporting a transparent red mask around Bishop Nehru. the same color difference, just like on the gold one, between the spikes and the rest of the mask is also featured on this iteration. A new unique feature which isn't been spotted on other variants but does appear on the Nehruvian DOOM mask is that the jewel inbetween the eyes seems to be missing, even though the socket for the jewel is there.", "image": "https://images.genius.com/28054b9a6399c40881d222fe396dbbdb.500x500x1.jpg"}], "artist": "MF DOOM"}