{"songs": [{"title": "Open Bar (Freestyle)", "album": null, "year": null, "lyrics": "(Intro)\nBig  Sean, if you don't mind‚ let's do Open Bar\nYou  ready?\nOpen Bar‚ let's go\nWe call this Open Bar‚ 4 bars, 4 topics\nShould  be easy for you, you ready?\nYeah‚  gimme, gimme while I'm drunk\n4 bars 4 topics, Open Bar at the liftoff with B.I.G. Sean\nBig  Sean‚ J Cruz, Justin Credible\nFirst topic, Floyd Mayweather\nCheck in, 4 bars, open bar\n\n[Verse 1]\nFloyd Mayweather, just like him, I'm undefeated\nI  had a couple of girls in my room and now I'm gun depleted\nI feel like I'm goin' hard, I feel like I'm undefeated\nThat was just a rhymin' word, I didn't mean it\nDon't get me caught up, don't get me twisted\nI been goin' in the liftoff, you know I'm lifted\nI been doin' it, don't forget, aight, that's 4 bars\n\n(Interlude)\n4 bars 4 topics, Open Bar\n4 bars 4 topics,, LA girls\nBig Sean, J Cruz, Justin Credible\n\n[Verse 2]\nShout out to my LA ladies\nLazy, man, some LA girls be lazy\nMan, shout out to LA girls, man\nYou know it's sunny cuz em girls be there shaded\nI mean sometimes these girls be actin' crazy\nYou know I be in and goin', actin' hazy\nYou know I'm goin' at that champagne, maybe\nI mean\n\n(Interlude)\nOpen Bar\n4 bars 4 topics, liftoff\nPower 106\nNiki Minaj's a**\nAw, you got this, you got this, let's go\nOpen Bar\n4 bars 4 topics, nah, you good, you good\nI mean, we all like it\n\n[Verse 3]\nAight, man, it's all good, it's all jokes\nYou know I'm on my silly, know I'm on my silly flow\nYou know I got in the a** video silly clothes\nYou know I was the first one to have her bend it over in a video\nI just said thank, lay really low\n\n(Interlude)\nAight, Big Sean, one more topic, 4 bars 4 topics\nCrazy chicks, crazy chicks\nWe all know them, there's a few in here right now\nOpen Bar at the liftoff\nPower 106\nBig Sean, J Cruz, Justin Credible\n\n[Verse 4]\nYes, this a crazy world\nSometimes it's crazy girls\nThat tell you that you made em\nAlright, hold on man, look\nY'all gon' make me rappin' about some stuff man\nHol' up, man, I'm runnin' on hell lines right now\nI'mma have to stop while I'm ahead, man", "image": "https://images.genius.com/1db10915bf07ae763610bb53d1717887.1000x1000x1.jpg"}], "artist": "Big Sean"}