{"songs": [{"title": "​sweet sweet", "album": "Birds in the Trap Sing McKnight", "year": "2016-09-02", "lyrics": "[Intro]\n(Whistling)\n\n[Bridge]\n'Cause you're sweet\nSak pasé? (It's lit)\nWah yah seh? (Wah yah seh?)\nRun it up (Yah), all this cake (Yah, yah)\nBag it up (Yah), den come right away (Yah, yah!)\n'Cause you're sweet (Yah, yah-yah!)\nWhat's your status? (Yah)\nYah, might hit your address, if I'm on them Addys (Yah)\nJet right to you, I can't do no traffic (Skrrr, skrrr)\nI can't do no lacking (Skrrr, skrrr)\n\n[Chorus]\n'Cause you're sweet—sweet—like cocoa\nBut all you wanna do is the coco (Yah)\nHangin' out with you is a no go (Yah, yah-yah, straight up)\n'Cause you're sweet (Sweet, sweet), like cocoa\nBut all you wanna do is the coco (Sweet, sweet, sweet)\nHangin' out with you is a no go (Sweet, sweet, sweet)\n'Cause you're sweet (Sweet)\n\n[Verse 1]\nLike my time, like my juice (Sweet, sweet)\nWe been downstairs in the basement with the moves (Sweet, yah)\nShout my town, shout my troops (Shout, shout)\nShout my jeweler, made my chain look like Froot Loops, yuh (It's lit)\nCome get a taste, come get a scoop (Scoop)\nI done made it out the hood through all the hoops (Hula hoops)\nI done finally found a way to make the loot (Make the loot)\nLink up all my niggas and my Jewels, yuh (High up)\nLink up, link up, yuh, link up, pour my syrup (Yah)\nBad bitch, yeah, they link up, link up\nGo berserk, do some shit you think of (Yah, yah)\nLean, lean, lean, all this lean, lean, lean\nWe might lean, lean, lean (Oh)\nSmoke all my shit (Shit)\nStop it, start again (Yah)\n\n[Chorus]\n'Cause you're sweet (Yah), like cocoa\nBut all you wanna do is the coco\nHangin' out with you is a no go\n\n[Bridge]\n'Cau-, 'cause sweet, yuh\nSak pasé? (Yah)\nWah yah seh? (Yah, yah)\nRunnin' up (Yah), all this cake (Yah)\nBag it up (Bag it up), den come right away\n\n[Verse 2]\nWhen I ask who bigger (Yah)\nAin't tryna argue with ya, I'm tryna figure (Straight up)\nWho you with, who your team, what your side? (Yah)\nHow you, how you, how you ride? (Skrrr, skrrr)\nHow you use me to survive? (Straight up)\nYuh, 'cause we up, lit at five (Oh)\nAt the crib goin' live, oh, so live (Yuh)\nEric hit the strippers, yuh, order V Live (Yah)\nOrder wings, told em' hold it (Hold it)\n\n[Chorus]\n'Cause you're sweet (It's lit), like cocoa (It's lit)\nBut all you wanna do is the coco (Yah, yah)\nHangin' out with you is a no go (Straight up)\n\n[Outro]\n'Cause you're sweet like cocoa\nBut all you wanna do is the coco\nHangin' out with you is a no go\n'Cause you're sweet", "image": "https://images.genius.com/c9c8a92af16b73c835c2731f75294a82.1000x1000x1.jpg"}], "artist": "Travis Scott"}