{"songs": [{"title": "I Call Shots", "album": "Tha Streetz Iz a Mutha", "year": "1999-11-16", "lyrics": "[Snoop Dogg]\nYeah.. yo whassup my nigga?\nIt's the big homeboy Snoop Dogg\nAnd y'know, the streets is a motherfucker\nD.P.G.C., y'know\nRepresentin to the fullest, like dat dere\nY'KNOW!\n\n[Kurupt]\nOrganized madness\nThe young Godstra\nHa hah, young Frank Sinatra, beotch!\n\nChorus: repeat 2X (w/ minor variations)\n\nI call, I call shots round here\nTell who to pop and who not to pop round here\nSlow down down here, don't make too much noise\nYou know who runs the blocks round here\n\n[Kurupt]\nPsychosomatic, automatic static\nCatatonic, supersonic, bubonic chronic addict\nAstrononimcal in the Thunderdome center\nIn the depths of the dungeon, dangerous, dastardly\nCatastrophes, metamorphosize into a pit\nTyranno-Don, crackin the bricks on the walls\nCamouflage, on the side of livest\nBout to put somethin up in that could ride\nIt's time for, world war three motherfucker\nYou know me, Young Got-ti motherfucker\nI holds the microphone like a grudge\nIn the 'llac laid back, so back the fuck up\nThis might give you a heart attack\nIt's real simple, can't get mo' simple than that\nThan that..\n\nChorus\n\n[Kurupt]\nThe tactical acrobatical automatic\nAutomatically psychosomatics that got it verbally guided\nVisually you ride it Super like the Sonics\nPotent like gin and tonic being injected through the veins\nWith double dosage of liquid chronic (WHAT?)\nColumbian flake, the top rate\nIrate lost mental state\nStallion I'm want about a million or more\nOf y'all fools to come back and get some more\nYou can tell the gangsta soon as he come in the door\nHe don't wear Calvin Klein, he won't wear valour\nHe got some Cortez or some Converse on\nAll-Stars, G'd from the hat to the floor\nYou can miss me, I'm probably chillin up in Mississippi\nOr Poughkeepsie or Baton Rouge guzzlin whiskey\nI'm a walkin franchise and I wanna get paid\nGet dropped, mopped and stomped like a parade\nPersuasion, phase three of the invasion\nI gots to break loose cause I'm feelin caged in\nLoose in the jungle, blaze a botanical garden up\nNowadays, niggas ain't hard enough\nTo bombard and bogart, spots like these\nRenegade revolutionary infantries\nI'll bet a thousand to one, you're never gonna make it\nYou're never gonna get it, y'all can't fuck wit us\nPut it together, our squad 1999 Mod Squad\nUniversal Soldiers, I thought I told ya\n\nChorus\n\n[Roscoe]\nI'm a chart smasher, the youngest gangster rapper\nSpectacular, chrome thirty-eight packer\nMoney stacker, t-shirt cakalaka\nVerbal predator, fake rap attacker\nGotti jawbreaker, Roscoe the back cracker\nMoney makin, we smart like computer hackers\nI came in this game with plans to get it maxed\nAnd my enemies, feel the wrath of my rapture\nNo escapin without, instantaneous capture\nDon't be upset, when me and the homies jack ya\nCause we straight jackin, if I say it's on it's crackin\nYoung thugs, from Y.A., we make it happen\nSwearin y'all can see me but that's just like seein Elvis\nI grab to crick a back and crack a nigga 'cross the pelvis\nMy rhymes is dangerous, hazardous to health\nI make a nigga murder twenty kids and cap his own self\nWho am I? The incorrigible lyrical miracle\nIs horrible yet hysterical the way I'll embarass you\nSee me on the streets, walk by and I just stare at you\nTough talk, when there's bullets flyin through the air at you\nTest your chest nigga? One less nigga\nMe and Kurupt share two gats and one vest nigga\nWe astronomical, phenomenal, magical, mathematical\nTaking your first-born as collateral!\n\n[Kurupt]\nI call, I call shots round here", "image": "https://images.genius.com/19827b73d665d135cdf903e8afe08997.1000x1000x1.jpg"}], "artist": "Kurupt"}