{"songs": [{"title": "MIA (3 Heats)", "album": "Brake Lights", "year": "2010-08-03", "lyrics": "[Hook]\nI keep three heats on me\n.45, Glock and a gauge\nLeBron James, Chris Bosh and D. Wade\nAny nigga try to stunt get sprayed\nWhat happened to the body? Nigga, MIA!\n\n[Verse 1]\nSwear a nigga stuntin', but I do this everyday\nHad them hoes bouncin' on my dick like a Chevrolet\nPut on for my city, nigga city on my face\nAnd I'm 'bout to throw a party, tell Diddy send a case\nFuck a square nigga, I'll say it to his face\nRap niggas quick to tell like it's a snitch nigga race\nMy nigga Frank told me, \"take your time bakin' cakes\"\nGotta get to the money at a Indiana pace\nNigga said he gob' rob me, bitch you could miss me\nStay strapped up like I'm 5150\nMo' K's than the mothafuckin' pitcher\nGet your ass smoked like a Swisher\n\n[Hook]\nI keep three heats on me\n.45, Glock and a gauge\nLeBron James, Chris Bosh and D. Wade\nAny nigga try to stunt get sprayed\nWhat happened to the body? Nigga, MIA!\n\n[Verse 2]\nIn the mirror, \"where you headed nigga?\" To the fuckin' gun range\nFuck the paper, nigga shoot the whole fuckin' gun range\nYellin' at the cop car \"soo-woo\", here I come Wayne\nBail only a hundred thousand, nigga that's chump change\nBack on deuces, front's on dubs\nBet a Bentley and a Phantom that this bitch don't run\nWhen you worth twenty mill, you can shine when it's sunny\nJust turned thirty, so I can't be from Young Money\nThere's Young Money and there's young money\nNiggas from the crew then there's nigga with young money\nHatin' on a real nigga cause he on and you not\nCut your head, got some tats, now he think he 2Pac\nNigga pull up at the club tryin' to floss\nBoy done grew a beard now he think he Rick Ross\nSay he sellin' birds can't tell you what it costs\nHow the fuck you gon' get a chicken off\n\n[Hook]\nI keep three heats on me\n.45, Glock and a gauge\nLeBron James, Chris Bosh and D. Wade\nAny nigga try to stunt get sprayed\nWhat happened to the body? Nigga, MIA!\n\n[Verse 3]\nNigga sold ten million now they say I'm Hollywood\nIf I sold ten more, shit I probably would\nI done drove every car, I done sold every drug\nFucked all the hoes, popped every bottle in the club\nHoes tryin' to give me pills, bitch I ain't into drugs\nCoconut Ciroc by the case, give me groupie love\nGrammy nominated, ain't forgot about the stove\nPaint the Phantom all red, call that bitch Derrick Rose\nIn and out of lanes, 24's insane\nTo think I got this far from sellin' cocaine\nI'm a stand up nigga, get your grands up nigga\nTake your ass to Staples, get your rubber bands up nigga\nMade all this fuckin' money what the fuck I'm gon' cop now\nI don't know but I'm comin' through with the top down\nToo much to live for my sons and my daughter\nOne more and I'ma take 'em to the Carter\n\n[Hook]\nI keep three heats on me\n.45, Glock and a gauge\nLeBron James, Chris Bosh and D. Wade\nAny nigga try to stunt get sprayed\nWhat happened to the body? Nigga, MIA!", "image": "https://images.genius.com/6e47923e84d22040bd228aa550a666d4.800x800x1.png"}], "artist": "The Game"}