{"songs": [{"title": "Brave Heart", "album": "Food & Liquor II: The Great American Rap Album, Pt. 1", "year": "2012-09-25", "lyrics": "[Verse 1]\nMay the Lord have mercy on my soul\nForgive me for my fetishes, my purchases, my clothes\nAllow me to catch my rhythm so the nervousness just goes\nThat's why I sound so certain in my verses and my flows\nThe verbiage gets merciless this wordsmithness just rolls\nI've tuned into my pertinence, my purposes, my goals\nThe feeling when you realize you've been working for your foes\nAnd the curtains have just opened and they worthlessness exposed\nYou remember where you came from, where the purchases was stole\nThere was nothing in the oven and just work up on the stove\nAnd you blossomed from the bottom, yeah, you worked with it and rose\nFrom nothing to a dozen and a gardener there grows\nTell 'em!\n\n[Hook: Poo Bear]\nCourage under fire, gave me a brave heart (That's me)\nCourage under fire, gave me a brave heart\n(Yessir)\nBrave heart\n(Yeah I got that) Brave heart\n(You know) Brave heart\n\n[Verse 2]\nMay the Lord have mercy on my soul\nLike Scholls keep cushion where I land\nKeep the devil off my heels\nBut please keep me on my toes\nLike a reposessor checking for everything I drove\nLike I owe, but I don't\nPaid my dues from the go\nDoing donuts in the door, keep my shoes on the floor\nRevered by the rich, plus approved by the poor\nI've been sped up where they sniff it\n(I've been sped up where they sniff it)\nAnd screwed up where they pour\nSee I flew so way up high\nAnd I SCUBA'd way down low\nPut the top down on my fears\nPut the roof up on my woes\nI dropped that food and liquor to put you up on my stove\nThey shoplifted and stole\nThat just let me know they know\nThat was Lupe #1 now this version #4\nAnd I still feel like a virgin me versus the globe\nFrom the surface to the core\nI took on the biggest wave\nAnd I surfed it to the shore with no pomade in my fro\nTook the wood from the slave ships and furnished my abode\nThat boat is now my bed, desk, dressers and my drawers\nNow that's a house of pain!\nPlus I use nooses when I hang up all my clothes\nCouldn't change up if I chose\nThat's me\n\n[Hook: Poo Bear]\nCourage under fire, gave me a brave heart (That's me)\nCourage under fire, gave me a brave heart\n(Yessir)\nBrave heart\n(Yeah I got that) Brave heart\n(You know) Brave heart\n\n[Outro]\nMay the lord have...\nMercy on my soul", "image": "https://images.genius.com/379173777569ae56b01f75924aa6ba0d.500x500x1.jpg"}], "artist": "Lupe Fiasco"}