{"songs": [{"title": "It’s Tuesday", "album": "Rock City", "year": "2002-11-26", "lyrics": "[Intro]\nYeah, you scared ain't you? Relax, it's just music. D-Elite, Jah 5'9\", Royce 5'9\", Cha Cha, Cut Throat, Billy Nix, my nigga Tre' Little, my nigga E. The Rock City niggas, we in a world of our own, don't you wanna come ride with us? Come ride with us. Yeah, ride wit us down in Seven Mile, niggas with Rock City tattoos on they forearms, niggas throwing they sevens up with. Detroit D tattooed on they hand, that's how we do, niggas'll die for this shit. Time to play, check it out\n\n[Verse 1]\nAyo, sit back, smoke, the joke is over, you woke\nThis is pure provoked \"Murder\", it's over \"She Wrote\"\nI don't know how niggas manage to sleep\nWake up! The clock radio done panicked the streets\nSay somethin! I been waiting now hand me these beats\nI'm simply a branch of the Slim Shady family tree\nThat'll snap, D12 first in line of the wrath, I came last\nBout to put my size nine and a half, in the game's ass\nOnce I hit the booth I swooped on niggas like \"Whoosh\"\nTwo-bit niggas, coupes, and figures we rule\nI been vicious, just listen from one track to the next\nI was gangsta when rap was nothin but the hats with the X\nI sat and watched album for album, niggas flop\nNiggas went from pro-black to Italian, I was hot\nI worked my fucking ass off, hopin to blast off\nNow I'mma let y'all see me, like when Ghost took his mask off\nGive you more run for ya ones, packin a full clip\nRapper niggas come witcha guns, don't bullshit\nI'mma only give you wild shit, rap with a mild pitch\nOnly clever with that occasional style switch\nY'all niggas play around on the mic, that's why I'm 'bout to lay it down\nSavor they way that you sounding tonight\nBecause, I listen to y'all niggas records on Fool's Day\nNow crack open and bump my shit, it's Tuesday!\n\n[Outro]\nIt's Royce 5'9\"\nThis nigga know he too cool\nBut don't ya know ya too smooth\nI really love how ya do\nIt ain't no other like you\n(You better wake up, he's coming)", "image": "https://images.genius.com/2e33562233c0c84cdaac4c3b252d599c.600x600x1.jpg"}], "artist": "Royce da 5'9'’"}