{"songs": [{"title": "Smoke", "album": "Animal Ambition: An Untamed Desire To Win", "year": "2014-03-31", "lyrics": "[Intro: Trey Songz & (50 Cent)]\nAy, girl, ay, girl, ay, girl, ay, girl, a-ay, girl\nYou know its Dr. Dre, girl (Dre, girl)\n(Its 50) And Trigga, yeah\n\n[Break: Trey Songz]\nSomebody pull the fire alarm, girl, where you from?\n'Cause you got this club on fire and outside I bet all they smell is smoke\nAll they smell is smoke, girl, they yellin' smoke\nAll they smell is smoke\nThe way your body roll, I'ma lose control\n'Cause you got this club on fire and outside I bet all they smell is smoke\nAll they smell is smoke, girl, they yellin' smoke\nAll they smell is smoke\n\n[Verse 1: 50 Cent]\nCome on\nPink diamonds, pink sand, beaches Aruba\nBlue sapphires on days when she feelin' Hoover\nShe hood and in the mood when I'm in the mood\nErotic, so exotic, I'm psychotic about it\nI don't want forever, I just wanna taste her love sample\nThat product, I bet a nigga tongue go numb\nShe's a narcotic, that bomb shit burnin', we smokin'\nMy old flame, my Mary Jane, we got a love thing\nShe ain't jealous, I keep Nina around\nIn the small of my back in case some shit go down\nRight under my Hermes, I'm hearin' the word is\nMe, I'm a P.I.M.P\nI let Trey hit some, then Dre hit some\nThen pass it to the homies 'til we all get done\nNiggas can't comprehend what this shit 'bout\nPolice comin', you like, put this shit out\n\n[Hook: Trey Songz & 50 Cent]\nYou like smoke and you got me high\nYou make a nigga want to get down\nHigh\nHigh feelin' like I'm up in a cloud\nGirl, what the fuck you done to me?\nYou got me feelin' like you just rolled up for me\nYou're like smoke and you got me high\nSo high make your love come down\nHigh\nOne time, have that ass turnt out\nGirl, what the fuck you done to me?\nYou got me feelin' like you just rolled up for me\nYou're like smoke\n\n[Verse 2: 50 Cent]\nShawty hot, she full blown, she hot now\n100 degrees, that's with or without the top down\nBut when she get to workin' her hips, you know the temperature rise\nOh Lord, soon as she see the dick in her thighs\nShe like the stones in my cross, she flawless\nI'm thinkin' damn, why would God give one woman all this?\nYou know I got the kind of conversation that make her feel like she need me\nIt's complicated, my occupation, pimpin' ain't easy\nFacts, I stack racks on racks and racks\nBack when I was pumpin' crack, now my cards are black\nNigga get on my level, bark with the big dogs\nIf I want it I buy it, I don't care what this shit costs\nLuther said it: a house is not a home without her\nI had 'em panties on the Greyhound filled up with powder\nBut what she showed what she'll do for me has no limits\nHer wantin' is temporary 'cause for sure she gon' get it, wassup\n\n[Hook: Trey Songz & 50 Cent]\nYou like smoke and you got me high\nYou make a nigga want to get down\nHigh\nHigh feelin' like I'm up in a cloud\nGirl, what the fuck you done to me?\nYou got me feelin' like you just rolled up for me\nYou're like smoke and you got me high\nSo high make your love come down\nHigh\nOne time, have that ass turnt out\nGirl, what the fuck you done to me?\nYou got me feelin' like you just rolled up for me\nYou're like smoke\n\n[Verse 3: Trey Songz]\nEverybody showin' the love when she at the door\nTurn this bitch down, that's fire in the hole\nI'm tryina get it and hit it, I don't wanna pass that\nGot me addicted, I'm trippin', where the stash at?\nBaby, baby, don't you know?\nFaded, baby, just like smoke\n\n[Hook: Trey Songz & 50 Cent]\nAnd you got me high\nSo high\nGirl, what the fuck you done to me?\nYou got me feelin' like you just rolled up for me\nYou're like smoke and you got me high\nRing the alarm it's on\nHigh\nGirl, what the fuck you done to me?\nRing the alarm it's on\nYou got me feelin' like you just rolled up for me\nYou're like smoke\n\n[Outro: 50 Cent & Trey Songz]\nRing the alarm it's on\nSmoke, you're like smoke\nYeah my nigga, wassup?\nGirl, you're like smoke, smoke\nFuck with me", "image": "https://images.genius.com/f5c030d46f5ef19b61cb044a8591b6de.320x320x1.jpg"}], "artist": "Dr. Dre"}