{"songs": [{"title": "Who Knew", "album": "The Marshall Mathers LP", "year": "2000-05-23", "lyrics": "[Intro]\n(I never knew I, knew I, knew I'd) Mic check, one-two\n(I never knew I, knew I, knew I'd) Who would've knew?\n(I never knew I, knew I, knew I'd) Who would've known?\n(I never knew I, knew I, knew I'd) Fuck would've thought?\n(I never knew I, knew I, knew I'd) Motherfucker comes out\n(I never knew I, knew I, knew I'd) Sells a couple of million records\n(I never knew I, knew I, knew I'd)\nAnd these motherfuckers hit the ceiling\n\n[Verse 1]\nI don't do black music, I don't do white music\nI make fight music for high school kids\nI put lives at risk when I drive like this\nI put wives at risk with a knife like this\nShit, you probably think I'm in your tape deck now\nI'm in the back seat of your truck with duct tape stretched out\nDucked the fuck way down, waitin' to straight jump out\nPut it over your mouth, and grab you by the face — what now?\nOh, you want me to watch my mouth\nHow? Take my fuckin' eyeballs out and turn them around?\nLook, I'll burn your fuckin' house down, circle around\nAnd hit the hydrant, so you can't put your burnin' furniture out\nI'm sorry, there must be a mix-up\nYou want me to fix up lyrics\nWhile our President gets his dick sucked?\nFuck that! Take drugs, rape sluts\nMake fun of gay clubs, men who wear make-up\nGet aware, wake up, get a sense of humor\nQuit tryin' to censor music\nThis is for your kid's amusement (the kids!)\nBut don't blame me when little Eric jumps off of the terrace\nYou shoulda been watchin' him, apparently you ain't parents\n\n[Chorus]\n‘Cause I never knew I, knew I would get this big\nI never knew I, knew I'd affect this kid\nI never knew I'd get him to slit his wrist\nI never knew I'd get him to hit this bitch\nI never knew I, knew I would get this big\nI never knew I, knew I'd affect this kid\nI never knew I'd get him to slit his wrist\nI never knew I'd get him to hit this bitch\n\n[Verse 2]\nSo who's bringin' the guns in this country?\nI couldn't sneak a plastic pellet gun\nThrough customs over in London\nAnd last week I seen this Schwarzenegger movie\nWhere he's shootin' all sorts of these motherfuckers with an Uzi\nI see these three little kids up in the front row\nScreaming \"Go!\" with their 17-year-old uncle\nI'm like, guidance?!\nAin't they got the same moms and dads\nWho got mad when I asked if they liked violence?\nAnd told me that my tape taught 'em to swear?\nWhat about the make-up\nYou allow your 12-year-old daughter to wear?\nSo tell me that your son doesn't know any cuss words\nWhen his bus driver's screamin' at him, fuckin' him up worse\n(Go sit the fuck down, you little fucking prick!)\nAnd \"fuck\" was the first word I ever learned\nUp in the third grade, flippin' the gym teacher the bird (Look!)\nSo read up 'bout how I used to get beat up\nPeed on, be on free lunch\nAnd changed school every three months\nMy life's like kind of what my wife's like (What?)\nFucked up after I beat her fuckin' ass every night: Ike\nSo how much easier would life be\nIf nineteen million motherfuckers grew to be just like me?\n\n[Chorus]\n‘Cause I never knew I, knew I would get this big\nI never knew I, knew I'd affect this kid\nI never knew I'd get him to slit his wrist\nI never knew I'd get him to hit this bitch\nI never knew I, knew I would get this big\nI never knew I, knew I'd affect this kid\nI never knew I'd get him to slit his wrist\nI never knew I'd get him to hit this bitch\n\n[Verse 3]\nI never knew I, knew I'd have a new house or a new car\nA couple years ago I was more poorer than you are\nI don't got that bad of a mouth, do I?\nFuck! Shit! Ass! Bitch! Cunt! Shooby-de-doo-wop! (Oops)\nSkibbedy-be-bop, a Christopher Reeves\nSonny Bono, skis, horses and hittin' some trees (Hey)\nHow many retards'll listen to me\nAnd run up in the school shootin' when they're pissed at a tea\n-cher? Her? Him? Is it you? Is it them?\n\"Wasn't me, Slim Shady said to do it again!\"\nDamn, how much damage can you do with a pen?\nMan, I'm just as fucked up as you woulda been\nIf you woulda been in my shoes, who woulda thought\nSlim Shady would be somethin' that you woulda bought?\nThat woulda made you get a gun and shoot at a cop\nI just said it, I ain't know if you'd do it or not\n\n[Chorus]\n‘Cause I never knew I, knew I would get this big\nI never knew I, knew I'd affect this kid\nI never knew I'd get him to slit his wrist\nI never knew I'd get him to hit this bitch\nI never knew I, knew I would get this big\nI never knew I, knew I'd affect this kid\nI never knew I'd get him to slit his wrist\nI never knew I'd get him to hit this bitch\n\n[Outro]\nHow the fuck was I supposed to know?", "image": "https://images.genius.com/e7f2305258d668431f8e250a41f3459f.1000x1000x1.png"}], "artist": "Eminem"}