{"songs": [{"title": "I’m Cumin", "album": "Playtime is Over", "year": "2007-07-05", "lyrics": "[Verse 1: Nicki Minaj]\nOk ok ok ok, now who's hot, who's not?\nShorty doo whoop, it's cool you bloodclot (cool)\nYou come to the spot, see if you don't get got\nSee if you don't get got, when the semi go cock\nI'm like \"Aye, what the fuck a bitch think?\"\nNick, you know ain't nothing changed, but my wink\nPink on pink, everything in-sync\nI write pretty lyrics, every pen pink ink\nI'm representin' all my girls, niggas double up\nI don't play around, I'm a have to shut her down\nRun up into town, I'm a have to get the crown\nI'm the Young Queens bitch, with the platinum sound\nNone of ya girls can steal my shine, Fendi -\nSchooled me to the game, now I'm in my prime\nStay humble, stay low, stay on the grind\nI don't need a light, but I stay in the lime\n\n[Hook]\nWhen I tell 'em that I'm cumin' I'm cumin'\nRap bitches in the game always huffin' and puffin'\nDamn, Why these bitches always frontin' for nuthin'\nFuck around I'm a have these bitches runnin' from suttin'\nWhen I tell 'em that I'm cumin' I'm cumin'\nRap bitches in the game always huffin' and puffin'\n(Damn) Why these bitches always frontin' for nuthin'\nFuck around I'm a have these bitches runnin' from suttin'\n\n[Verse 2: Nicki Minaj]\nGuess what Nicki spit crack, like yayo\nYep, matter fact, when I rap, It's a K.O\nCome through the hood, all the boys say \"Ayo!\"\nLettuce and tomato, don't forget the mayo\nWords in the street, that Nicki don't play doe\nBitches pop shit, but they soft like play dough\nGotta lotta banks, so she wanna be me\nI gotta full tank, little momma on E\nI fly first class overseas, on this BB\nSnapple in my hand and it's strawberry kiwi\nI ain't even make it, and these girls wanna be me\nYou \"Mrs. Me Too\", like you always say me me\nI'm who they believe in, mommy don't even\nSoon as I put the keys in, I switch like seasons\nGet a couple beats from my nigga Doe Beezy\nWhy would I go hard, when this shit is so easy\n\n[Hook x2]", "image": "https://images.genius.com/b256017f3b831150266cf5131d761bfe.600x599x1.jpg"}], "artist": "Nicki Minaj"}