{"songs": [{"title": "Guaranteed Raw (Demo)", "album": "Demo Tape", "year": "1991-01-01", "lyrics": "[Intro]\nChill Twan, damn man!\nThat nigga Big got somethin to say?\nYo Big, what'chu got to say Big?\nYeah, yeah\nSpecial shoutout to my man\nMC Homicide and DJ Fatal\nTwin one and two my man Milk\nMy man Fred Dawg, the O.G.B. crew\nY'all know how we flow\nAnd I'ma drop it like this y'all\n\n[Verse 1]\nOh what a feeling! Drivin' in my four by four\nGirlies galore, B.I.G. on the door\nChrome trimming with the smoke tint\nGivin' chumps a hint as I count my mint\nStacks of doves, half my man's is C-note\nAll from sayin' rhymes that B.I.G. wrote\nBlunt, I take a toke, but only if it's weed\nSkunk with no seeds, a sip of Hennessy\nPass to D or maybe movin' solo\nNever with a skeezer by my side, that's a no-no\nTell me I ain't the flyest nigga that you ever saw\nLive in action, guaranteed raw!\n\n[Interlude]\nWho's coming through? Y'all know who! (Who?!)\n\n[Verse 2]\nBed-Stuy Brooklyn where this rapper was originated\nYour rhymes ain't shit; they must be constipated\nMany awaited the heavyset brother from Fulton Street\nTo drop a rhyme to a funky beat\nExpellin MCs as if I was at Sarah J\nOr boys and girls at any school around the way\nOpponents, pupils, but I'm the principal\nHard to beat, damn near invisible\nNiggas wanna know, how I live the mack life\nMakin money smoking mics like crack pipes\nFlippin' bombs, stayin' calm, givin' my people my palm\nAnd sayin' rhymes is an opium bomb\nYes it's me, the B.I.G\nCompetition ripper ever since 13\nUsed to steal clothes, was considered a thief\nUntil I started hustlin' on Fulton Street\nMakin' loot, knockin' boots on the regular\nPass the microphone I'm the perfect competitor\nJewels and all that, my clothes is all that\nChumps steppin' to me, that's where they took a fall at!\nB.I.G. without burner, that's unheard of\nI stay close to mine like Tina on Turner\nQuick to smother a punk motherfucker\nUndercover, word to mother, I'm above ya\nAnd I love ya 'cause you're a sweet bitch\nA crazy crab, ya might make my dick itch\nI flow looser than Luther, words ya get used ta\nB.I.G. is a born, trooper\nLike ice cream I scoop ya, my music you wanna get loose ta\nStay dipped and I'm not a booster\nSo what'cha got to say? This mackin' word is bond\nThere's no other assumption, I got it goin' on\nI'm not conceited, my friends tell me this\nEven my mother be noddin' her head to this\nMakes her proud to see her one son get loud\nFlip on a sucker and bow to the crowd\nDrink a little Hennessy, smoke a blunt or 2 or 3 or 4\nLive in action, guaranteed RAW\nRound two the rhyme regulator here to roast ya\nAs ya follow this yeah, I gave a toast to ya crew\nSee, they popped on ya like a kernel\nThey didn't realize that the beef was eternal\nInternal injury that's what you're soon to see\nB.I.G. keeps company\nSometimes in my waist, if they come opponent\nRun upstairs, change my skimmer and my coat and\nI'll be floatin' to your punk part of town\nAnybody fronting, they better duck down\nDon't get mad 'cause I grazed ya\nYou jumped in that 4-door Blazer, quick I couldn't get a good hit\nShit, I was aimin' for the melon\nBut the kick of my three-pound auto there's no tellin'\nDrink a little Hennessy, smoke a blunt or 2 or 3 or 4\nLive in action, guaranteed raw!\n\n[Outro]\nAnd you don't stop, and you don't stop\nYou keep on\nTo my man Milk, and Thai\nLike I said before the whole O.G.B. is in full effect\nMost definitely\nSent a shout on", "image": "https://images.genius.com/6c96abc4bf36378ec25a3f74b38f27fb.1000x1000x1.jpg"}], "artist": "The Notorious B.I.G."}