{"songs": [{"title": "Neighborhood Drug Dealer", "album": "Hood Billionaire", "year": "2014-11-24", "lyrics": "[Intro]\nAy, this shit not to be played with around here\nCome through here your ass will get it\nMy nigga, I've been waitin' to holla at you my nigga\nThis shit crazy out here boy, don't nobody got nothin' out here boy\nYeah nigga, I'm tellin' you nigga, you the hood billionaire nigga\nI'm talkin' about you boy, this shit where they believe in my nigga\n\n[Hook]\nUh, I'm your neighborhood drug dealer\nIt's your neighborhood drug dealer\nUh, it's your neighborhood drug dealer\nI'm your neighborhood drug dealer\nNeighborhood drug dealer\nIt's your neighborhood drug dealer\nOne, two, what it be?\nMichael Jordan, white, bitch, 23\n\n[Verse 1]\nBet you hear my pipes rev when I tip the scale\nRich forever, still a muscle and it never fails\nYou a house nigga so they let you get the mail\nWe in the back whippin' egg whites and crackin' shells\nRobin jeans for my team, pocket for the sale\nPussy niggas gossip pray you die from gonorrhea\nAl Capone where I'm from that Benzo bullet proof\nNeighborhood dope boy you can get it too\nFuck them pussy niggas catch they ass at Smoothie Kings\nHundred missed calls after that new toolie rings\nSkip south beach, bitch, bring it to the bridge\nFor that chain put that thang right up to ya rib\n\n[Hook]\nUh, I'm your neighborhood drug dealer\nIt's your neighborhood drug dealer\nUh, it's your neighborhood drug dealer\nI'm your neighborhood drug dealer\nNeighborhood drug dealer\nIt's your neighborhood drug dealer\nOne, two, what it be?\nMichael Jordan, white, bitch, 23\n\n[Verse 2]\nChevy SS, she heard I bump fire\nGot row houses up and down through Pembroke Pines\nSay the streets talk, I say it’s 'bout time\nBal Harbor on my mama been about mine\nStill pay my child support, in all trap money\nAll 5's and 10's, can't touch my rap money\nShe won't fuck with me, I'm hatin', yeah her pussy stank\nMeet your amigo mama then you crack the piggie bank\nDope boy dream, never lose it all\nMontgomery, Alabama know he love to send em soft\nBaton Rouge, that actavis act a fool\nNeighborhood dope boy you should hit me too\n\n[Hook]\nUh, I'm your neighborhood drug dealer\nIt's your neighborhood drug dealer\nUh, it's your neighborhood drug dealer\nI'm your neighborhood drug dealer\nNeighborhood drug dealer\nIt's your neighborhood drug dealer\nOne, two, what it be?\nMichael Jordan, white, bitch, 23", "image": "https://images.genius.com/bef9a0948252c91da2c707ba7803fcfd.1000x1000x1.jpg"}], "artist": "Rick Ross"}