{"songs": [{"title": "Hush", "album": "The Sneak Attack", "year": null, "lyrics": "[Intro]\nUh-huh, whatchu thought? Uh-huh, we was done?\nUh-huh, whatchu thought?! Yeah, yeah\nYeah, whatchu thought? Uhh, uhh, uhh\nYo, yo, back again! What's that? Back again!\nWhat's that? Word! C'mon\n\n[Hook 2X: Nyce]\nA North Face and skully hat don't make you a thug\nA army suit, a pair of Timbs don't make you a thug\nAn ill mug and a gat don't make you a thug\nA real thug is a thug that's Hush!\n(Yo, yo, yo, check it, check it)\n\n[Verse 1: KRS-One]\nLet us begin, KRS, winnin again, KRS-One did it again\nKRS bigger than them, look at them they bit it again\nI think my gun just gonna start clickin again\nClick-clack, I always spit back\nAnybody call my name I go get that\nIn fact we draggin 'em out, to a deserted route\nThe teacher returns, you must learn, the word is out\nNo doubt highly respected, Front Page Records\nOff the hook, yet still connected\nAre you teachin yourself, teachin yourself?\nI'm like history repeatin itself\n\"Criminal Minded\", you've been blinded again\nLookin for my style you can't find it again\nYou can find these others that may sound like Kris\nBut when it comes to the hands they don't get down like Kris!\nThey never ran up in the clubs with a hundred thugs\nNever had the respect of Crips and Bloods\nNever knew B.O., they never knew Big Pun\nThey never battled MC's, they never bust they gun\nThey don't know that, all they know is that show DAT\nThat's Digital Audio Tape if you don't know that\nNow go back and get my name correct\n'fore I snatch that platinum from 'round your neck\n\n[Hook 2X: Nyce]\nA doo rag a platinum chain don't make you a thug\nA fat ride with chrome don't make you a thug\nThat tough guy talk don't make you a thug\nA real thug is a thug that's Hush!\n(Word, yeah yeah, uh-huh, yo Yo, yo, yo hit 'em Kris!)\n\n[Verse 2: KRS-One]\nWhat mean the world to me? H-I-P, H-O-P\nAnd S-I-M, O-N-E, and G-O-D, I stay low key\nI go down to hell, and slap up Satan\nThen return to heaven, where Scott LaRock is waitin\nResurrection, just like my brown complexion\nWhen I speak, I don't need protection from the heat\nI walk these streets and I'm quick to hit first\nThrow on any beat I'll be quick to spit first\nAnd rip town, I take one look around\nAnd all you hear is, \"Get down, get down, get down!\"\nKnowledge Reigns Supreme, I stay on blast\nThat's why these rappers want me to go on last\nThat's the truth, that's the fact, that's the deal\nForget sex appeal, my tech is real\nAnd my rep is real, K-R-S\nWoo-woop-woop! That's the sound of E-M-S\nThe rag on your head, it best stay white\nCause I can turn that red in a mintue a-ight?\nNow go back and get my name correct\n'fore I snatch them diamonds from 'round your neck\nOnce again, get my name correct\n'fore I snatch that platinum from 'round your neck\n\n[Hook: Nyce]\nA North Face and skully hat don't make you a thug\nA army suit, a pair of Timbs don't make you a thug\nAn ill mug and a gat don't make you a thug\nA real thug is a thug that's Hush!\nA doo rag a platinum chain don't make you a thug\nA fat ride with chrome don't make you a thug\nThat tough guy talk don't make you a thug\nA real thug is a thug that's Hush!\n(Yeah.. yeah.. yo, yo, yo)\n\n[Verse 3: KRS-One]\nTo all my heads who wanna see an improvement\nIn hip-hop culture, join this movement\nWe need more Glocks than my man Freddie Foxxx\nThe knowledge I spit to the click it don't stop\nThat hardcore God-core, ready to start war\nRock more shock more top your pop tour\nI'm sure I'll drop the grade to zero\nWhen the teacher return, I don't chase DeNiro\nLike where yo? Where yo? They livin' in fear yo\nIt's a jungle sometime, but I got my spear yo\nThe album's called \"Sneak Attack\", that's what it is\nKRS-One spittin' facts to kids\n\n[Hook: Nyce]", "image": "https://images.genius.com/756508fbcbfc3c6ac80f412ee6f089bd.1000x1000x1.jpg"}], "artist": "KRS-One"}