{"songs": [{"title": "My Priorities", "album": "The Infamous Archives", "year": "2007-03-13", "lyrics": "[Intro: Prodigy]\nOh-Yea, we here - that's right, my niggas light that shit up\nLight your shit up, oh-yea, oh-yea\nTappin' bottles back that, spit lines for the homies\nThat's R.I.P., you feel me? Aiight let's learn these niggas sumtin'\nWe gon' run down the line like this...\n\n[Prodigy]\nBefore I get the watch - I get the big Glock\nBefore I step foot in the V - I get the stash box\nNo matter the casin', I'm bringin' the heat\nTake my kids to Sesame Place, I'm bringin' my heat\nFo'sho, you neva know it might pop off\nBetter safe than sorry, niggas could neva rob me\nOr reach the hand toward me and in any type fashion\nFuck what you heard or think my shit blastin'\nWe hittin' the club; I get my contraband\nYou fuckin' wit us? You'd rather suck madd dick\nBefore I squeeze I aim at your hat then\nWithout hesitation, turn your shit backwards\nSoon as I purchase my kicks; I put the gemstars in\nSo if they lock me up; my razor makes madd hits\nBefore I die, the world gon' hear me\nAnd make me rich, my kids will be filthy\n\n[Hook: Prodigy]\nPriorities; put my gun on, I'm ready for the day\nTwo; tryin' hit you before you hit me\nC; he a good nigga, don't call cross P\nFour; balance my hatred and love more\nE; tryin' to stay alive, only live once\nSix; neva let fear control me dunn\nG; make the money, money neva made me\nEight; live by four, it should be straight\n\n[Prodigy]\nAyo, nigga I don't shoot cars up or dawgs up\nThat shit I did when I was sixteen, word up!\nThat's child play now I gotta taste for blood\nI gotta see some meat hangin' 'fore the jobs well done\nI need to see a nigga drop 'fore I make my gun stop\nAnd before I start shootin', I make sure you hop\nNiggas wind me up and wind me up\n'Til I pop up on your scene like Jack in the Box\nWith the two toppings, cuttin' at you up like butter\nVA style nigga your meat get smothered\nMobb style nigga me and my blood brothers kill\nPretty boy, rappers if their songs speak others\nOh you shot niggas before? That's cool wit me\nCause you gon' need experience tunnin' wit P\nBefore I came to QB, I was already thug\nBefore all this rap shit, I was already bugged\n\n[Hook: Prodigy]", "image": "https://images.genius.com/cb51383ec91030d5e17e2b134d0e8477.1000x1000x1.jpg"}], "artist": "Mobb Deep"}