{"songs": [{"title": "IANAHB", "album": "I Am Not a Human Being II", "year": "2013-03-22", "lyrics": "[Produced by Elew]\n\n[Verse]\nI'm in the crib butt naked, bitch\nShe said my dick could be the next black president\nAmericans hate that I'm American\nMedicine, I treat it like peppermints\nUh, I'm in the ocean getting shark pussy\nShoot you in your fucking mouth and make you talk to me\nSometimes, I need someone to talk to\n'Cause I am not a human being, Part II\nGetting paid, show money for walkthroughs\nLetting all these hoes ride my dick, carpool\nMy bars passed the bar exam, no law school\nCash Money Army, veteran with my war wounds\nUh, whatcha man doing?\nI pop his muthafucking top like a canned good\nAnd all my niggas that I roll with are hella armed\nAnd last night, I took a transformer\nAnd had a dream that my dick turned to Megatron\nBut my girl was sleeping with Decepticons\nMoney talks, man and mine talks lecture-long\nP-U-S-S-Y, my second home\nI be grinding on them hoes like a half pipe\nShe say, \"Tunechi, you the shit, you need your ass wiped\"\nI say, \"Before you gas me up, check the gas price\"\nThen I make her take this dick, like advice\nShe seesaw it, she suck it and enjoy it\nI stick it in her ass like some fucking steroids\nJose Canseco, make no mistake\nLike a white boy wearing black paint, you're a fake ass nigga\nBrake pads, nigga, wait, you ain't in my weight class, nigga\nLooking for the mutherfucking man in the mirror\nRunning this shit like a faucet, Farrah\nBarra-cuda, who the fuck you-uh?\nI can make your bitch root for me like I grew her\nBodies in the sewer, tampons in manure\n90 billion bitches on my stick like a skewer\nThat's swag, I'm a true Blood, bitch, no fangs\nBeen went pro, now I'm going propane\nBitch get off me, bitch get off me\nI got her over here blowing me like coffee\nDecaffeinated, hand me that paper like I graduated\nAnd I get head while it's decapitated\nThink it's a game? Nigga, come play\nI'm with my killer B's, fuck bug spray\nYeah, Young Money so gangsta\nI personally know strangers\nIt's so strange, but this girl named Dana like to go anal\nShoot him in his head, what's that? A no-brainer\nPlain old nigga, but a break from the norm\nI wear my heart on my sleeve, so don't be breaking my arm\nI rather ring ya fucking neck before I ring the alarm\nI dream to meet a serial killer that'll bring me along with him\nI gotta hit 'em like redbones with long hair\nFuck with me, your ass is grass, get a lawn chair\nI was fucking before my dick started growing hair\nBitches sweating me like John Mayer, or warm air\nMan, nuts and bananas\nYou know how the tables turn, where are your table manners?\nIf you fake, put a egg in your shoe and scramble\nNo rubber, I just fucked this piano\nNigga", "image": "https://images.genius.com/025852747d34bfec09080ad4c10b07b6.1000x1000x1.jpg"}], "artist": "Lil Wayne"}