{"songs": [{"title": "Hold Dat Thought", "album": "Hard to Kill", "year": "2008-09-24", "lyrics": "[Intro]\nZaytoven on the track\nZay-tiggy! Gucci, Gucci\nSo Icy Entertainment\nLet's go\n\n[Hook: repeat 2X]\nThey call me Chef Boy RG, but hold that thought\nIt's a Kodak moment, how I hold that fork\nGot a hurricane wrist game tornado turns dog\nPockets Piggly Wiggly, caine Kermit the Frog dawg\n\n[Gucci Mane]\nEarly in the mornin, I ain't even yawnin\nCookin up a cake, like I'm doin a performance\nWhen it come to flossin, I ain't even talkin\nDiamonds on my donk* got my Chevy moonwalkin\nTen bricks on my Bart Simpson, just look\nMy watch, thirty-five pounds of kush\nMy ring, thirty-six O's my nig'\nMy bracelet, five hundred pounds of mid'\nA Gucci wrapped tour bus, y'all hoes follow us\nParty pack of pills man, hoes gonna swallow us\nNaturally a loner, but love my kid\nMix the soda with the cola, I can buy me a friend\nNew swag somethin like Trap House times 10\nE'ry nig' around me bust heads, YA DIG?~!\nIced out grill, I can't buy that bullshit\nI'm with some street shit, like the reverend in the pulpit\n\n[Hook]\n\n[Gucci Mane]\nLike the boy Rip Ham I got a real good J\nOne gram for the eighty, that's a real good play\nGot them Vince Carter quarters, add soda and water\nI'm not athletic, but I'mma straight baller\nThe Spud Webb ticket, with the Larry Bird yay\nAnd it's jumpin from the free throw like MJ\nSee my 'Vette pass by, like a Steve Nash pass\nStay loyal like the fans of the Utah Jazz\nLike Dr. J shorts, my work real tight\nYou got that Atlanta Hawks yay, it won't get right\n(You cain't get right) Catch me on the rebound, like Bo Outlaw\nI'mma Mikey Vick it, whip it, cook it southpaw\nThirty-six ho-zoes, tried to make the endzone\nMake a Joe Horn move, and use my cell phone\nAlways scramblin in the pot, just like Steve Young\nFive for the Keyshawn, seven for the Deion\n\n[Hook]\n\n[Gucci Mane]\nGucci on fire like mojo crack pot\nFell over a chump, right back like crack rock\nMoney stupid dumb, just like Cold Blood\nJust like Young Hot, I show no love\nMines is gettin like Cheeba, mines like Fat\nAnd my trap roll hard, just like Shawty Black\nI'mma country ass nigga, just like Ace\nGotta fetish, for the stones, just like UGK\nMy dough like bruh, yours like G\nAnd my patience very short, just like Courtney C\nAngie B, Russell P, but it's yo' choice\nMy girl Angel pussy deep, like Slick Man voice\nLike Redd oh-three, man I got bread\nMy pocket on swoll like HP fo'head\nI'mma money go getter, so I'm like gettin {?}\nGotta a hundred hoes jockin, just like throwback\n\n[Hook]\n\n[Outro]\nAy man, Street Entertainment\nSo Icy Entertainment\nWe present the Trap-A-Thon\nThat's a money makin marathon\nCause Gucci Mane I'm a trapaholic\nI'm addicted to the trap, you feel me?\nI'm in Zone 6 central right now\nChillin in the traphouse\nI got my A-R's to cook, you feel me?\nI feel like a motherfuckin waffle house chef right now\nGEAH! Gucci Mane, Laflare man\nSo Icy Entertainment, gone", "image": "https://images.genius.com/3baa00f3106cb117f4503a7ef54414cc.1000x1000x1.jpg"}], "artist": "Gucci Mane"}