{"songs": [{"title": "Can U C the Pride in the Panther (Female Version)", "album": "The Rose That Grew From Concrete Vol. 1", "year": "2000-11-21", "lyrics": "[Intro]\nThis song is dedicated\nTo the mothers and the children of the revolution\nFrom 2Pac, to Afeni Shakur\nAnd many many more\nThis is for you\nOne love, one life\n\n[Verse]\nCan you see.. the pride of the panther\nAs she nurtures.. her young all alone\nIt's the seed.. that must grow regardless\nOf the fact that, it's been planted in stone\nCan you see.. the pride of the panther\nIn the concrete jungle, alone with her cub\nIt's the seed.. that must come to harvest\nIt's the tree.. that must grow out of love\nCan you see the pride in the panther\nAs he glows in splendor and grace?\nTopling obstacles placed\nIn the way of the progression of his race?\nCan you see the pride in the panther\nAs she nurtures her young, all alone?\nThe seed must grow regardless\nOf the fact that it's planted in stone\nCan't you see the pride of the panthers\nAs they unify, as one?\nThe flower blooms with brilliance and\nOutshines all the rays of the sun\nKeeps bright like the rays of the sun\nCarries out like the rays of the sun\nKeeps bright like the rays of the sun\nShines bright like a new day begun\nCan you see the pride in the panther\nAs he glows in splendor and grace?\nTopling the obstacles placed\nIn the way of the progression of his race\nCan you see the pride in the panther\nAs she nurtures her young all alone?\nThe seed must grow, regardless\nOf the fact that it's been planted in stone\nCan't you see the pride of the panthers\nAs they unify as one?\nThe flower blooms, with brilliance\nAnd outshines all the rays of the sun\nIt outshines all the rays of the sun\nCarries out like a new day begun (uh-huh)\nIt shines bright like the rays of the sun (hah)\nAnd keeps high like a new day begun\n\n[Bridge]\nShines bright like the rays of the SUN!\nKeeps high like a new day begun\nCarry out like the rays of the sun\nKeep on like a new day begun, say\nShine bright like the rays of the SUN!\nKeep high like a new day begun, say\nShine bright like the rays of the sun (c'mon)\nKeep high like a new day begun, say\nShine bright like the rays of the SUN!\nKeep high like a new day begun, yes\nTo shine bright like the rays of the sun (uh-huh)\nCarry out like a new day begun, say (c'mon)\nSHINE BRIGHT LIKE THE RAYS OF THE SUN (whoo!)\nKeep high like a new day begun (ha ha)\nShine bright like the rays of the sun say (c'mon)\nKeep it high like the new day begin say\nSHINE BRIGHT LIKE THE RAYS OF THE SUN (whoo!)\nKeep high like a new day begun (ha ha)\nShine bright like the rays of the sun (yeah)\nCarry out like the rays of the sun (huh)\nCarry out like a new day begun\nA new day begun, a new day begun\nA new day begun begun begun begun\nBegun begun begun.. hoo!\nPower to the people! (Power to the people)\nHe said.. power to the people! (Power to the people)\nHe said.. power to the people! (Power to the people)\nHe said.. love is people power (LOVE)\nLove is people power (LOVE)\nLove is people power (LOVE)\nLove is people power (when all else crumbles)\nLove is people power (love must prevail)\nLove is the people's power\n\n[Outro]\nEvery revolutionary act is a act of love\nAnd love is the engine of the revolution\nI love y'all, like 'Pac loved y'all\nLike Afeni loved 'Pac, like we love Afeni\nLike we love love.. one love", "image": "https://images.genius.com/866e68770deafd17a70d2918c7819b81.817x1000x1.jpg"}], "artist": "2Pac"}