{"songs": [{"title": "All That I Got Is You", "album": "Ironman", "year": "1996-09-22", "lyrics": "[Intro One: The Education of Sonny Carson]\n'What they gives you, blood?'\n'Three months, man.'\n'Whatchu doin in here anyway? You oughta be home with your momma.  How old are you boy?'\n'Thirteen.'\n'Thirteen? Damn, the bastards must be runnin' outta niggas to arrest.'\n\n[Intro: Ghostface]\nYeah, ohh yeah, this goes out\nTo all the families that went through the struggle\nYeah, from the heart\nIt was all from the heart, everything was real\n\n[Mary J.]\nAll that I got is you\nAnd I'm so thankful I made it through\n\n[Verse 1: Ghostface Killah]\nYo, dwellin' in the past, flashbacks when I was young\nWhoever thought that I'd have a baby girl and three sons\nI'm goin' through this difficult stage I find it hard to believe\nWhy my Old Earth had so many seeds\nBut she's her own woman, due to me I respect that\nI saw life for what it's really worth and took a step back\nFamily ain't family no more, we used to play ball\nEggs after school, eat grits cause we was poor\nGrab the pliers for the channel, fix the hanger on the TV\nRockin each others pants to school wasn't easy\nWe survived winters, snotty nosed with no coats\nWe kept it real, but the older brother still had jokes\nSadly, Daddy left me at the age of six\nI didn't know nuttin' but mommy neatly packed his shit\nShe cried and grandma held the family down\nI guess mommy wasn't strong enough, she just went down\nCheck it, fifteen of us in a three bedroom apartment\nRoaches everywhere, cousins and aunts was there\nFour in the bed, two at the foot, two at the head\nI didn't like to sleep with Jon-Jon he peed the bed\nSeven o'clock, pluckin' roaches out the cereal box\nSome shared the same spoon, watchin' Saturday cartoons\nSugar water was our thing, every meal was no frill\nIn the summer, free lunch held us down like steel\nAnd there was days I had to go to Tech's house with a note\nStating, \"Gloria, can I borrow some food I'm dead broke\"\nSo embarrasin' I couldn't stand to knock on they door\nMy friends might be laughin', I spent stamps in stores\nMommy where's the toilet paper, use the newspaper\nLook Ms. Rose gave us a couch, she's the neighbor\nThings was deep, my whole youth was sharper than cleats\nTwo brothers with muscular dystrophy, it killed me\nBut I remember this, moms would lick her finger tips\nTo wipe the cold out my eye before school with her spit\nCase worker had her runnin' back to face to face\nI caught a case, housin' tried to throw us out of our place\nSometimes I look up at the stars and analyze the sky\nAnd ask myself was I meant to be here, why?\nYeah, yo\n\n[Hook: Mary J. Blige]\nAll that I got is you\nAnd I'm so thankful I made it through\nAll that I got is you\nAnd I'm so thankful I made it through\nAll that I got is you\nAnd I'm so thankful I made it through\nAll that I got is you\nAnd I'm so thankful I made it through\nAll that I got is you\nAnd I'm so thankful I made it through\n\n[Ghostface during the hook]\nWord up mommy, I love you\nWord up\nIt was all you, word, you brought me in like this\n\n[Verse 2: Mary J. Blige]\nI sit and think about\nAll the times we did without dad\nI always said I woudn't cry\nWhen I saw tears in your eyes\nI understand that daddy's not here now\nBut some way or somehow, I will always be around, yeah\nAll the things that I did from this to them\nOh from drugs to being there\nBeing down and out and I love you always\n\n[Outro: Popa Wu]\nYeah, you say\nYou see the universe, which consists of the sun moon and star\nAnd them planets, that exist in my space\nLike man woman and child\nYou understand?\nWe got to keep it real, and what reality\nAnd reality will keep it real with us\nI remember them good ol' days\nBecause see, that's the child I was\nWhat made me the man I am today\nSee cause if you forget where you come from, heheh\nYou're never gonna make it where you're goin', aheh\nBecause you lost the reality of yourself\nSo take one stroll through your mind\nAnd see what you will find\nAnd you'll see a whole universe all over again\nAnd again and again and again and again", "image": "https://images.genius.com/14f5bb85c354d432f748240524b167d9.600x508x1.jpg"}], "artist": "Ghostface Killah"}