{"songs": [{"title": "Uncut Cypher", "album": null, "year": null, "lyrics": "[Verse 1: Reek Da Villain]\nAye yo, weak minded bitches fall victim because my charm's strong\nJazzy pair of Louis on my feet, Shoey Armstrong\nMa couldn't be my cheerleader with platinum pom-poms\nShe the type to misrepresent a king like Lebron's mom\nBeating on my chest with a crown, King Kong Don\nLangston Hughes, I write a poem that do the Bible Psalms harm\nThese other rappers want problems, then bring it on umm\nThis rapping beef is nothing, my studio's an Islam farm\nAnd all cowards'll become victims of man\nKeep a 5th of Remy and a stick of piff in my hand\nYeah they fly but I'm a pilot that no one can understand\nPlus the way I go ham'll make a Muslim say 'Damn.'\nHustle hard, trips to Miami for three days\nSo I can meet with the connects and get the D. Wade\nRun up in the Gucci store and drop 3k\nYou bum, I could get your whole outfit out of BJ's\nLyrical scientist, leaving mics with psoriasis\nAll this work that I'm shitting is Michael Myer's psychiatrist\nPyrics suppliacist, who be lying stiff when the iron spits\nI come alone, just me and one 9 Johnny [Unitas]\nAnd let my bitch serenade through these slums\nAnd blow so much loud, I need a hearing aid\nFor my lungs\nAnd as far as metaphors, rate this\nI was a snail til haters threw salt on me and I dissolved into greatness\n\n[Verse 2: 2 Chainz]\nWhat goes around comes around like a hula hoop\nHair weave killa, I'll show up to your funeral\nAll this work, I need a cubicle\nClear coat cuticle, different color diamonds like a Rubix Cube\nIf this was New Edition, I'll be Bobby Brown\nPut the check over your head and call it Nike Town\nHow could I be down, Free Boosie, wipe me down\nMy credit card is black and proud\nI've been trapping since Rocsi had the ankles out\nI'm going to the money and I took the paper route\nUh Yeh, I'm hood approved and I'm street tested\nYou a nobody............ anorexic\nIf you stay next to me, you're close to a blessing\nSo, I'm guessin, I could get arrested -\nFor aggravated flexing, with all this ice on\nMy mic on, I apply pressure like a python\nAnd everybody know this that body flow, bench press, cardio\nThey try to cramp a nigga style like a Charlie horse\nYeh, they plot on you, and they drop on you\nI put a Glock to your eye and call it glaucoma\nBow! From 30 nights of sipping dirty sprite\nI call this shit Bluetooth because I don't need a mic, 2 Chainz...\n\n[Verse 3: Busta Rhymes]\nI said \"Please Stephen Hill, don't even put me in a cypher.'\nThere's only one outcome when I get a little hyper\nYou gonna start seeing niggas getting nervous with they shook ass\nYop! Yop! Yop! Cause I'm merciless with the whoop ass\nDon't get shook now, what you sliding for\nSoon as you slide, you getting stuck like a nigga was sliding doors, Bing!\nA fucking park in my coupe\nBitch I can come and run circles around you dudes like I'm stirring the soup\nBetter move from out my way before you niggas get pushed down\nWhen these wack niggas spit you be hearing a 'shoosh' sound\nNot 'shoosh', when you wanna hear young niggas on their come-up\nBut shoosh lil homie, SHHHHH-Shut the fuck up!\nI see through niggas more then a little, your translucent\nYou know I come for blood like nigga need a transfusion, bing!\nListen good, I hope you hear me on these features\nMurk your face with dark and brown spots like brick oven pizzas\nYou niggas make me wanna wrap my fingers round triggers\nI skin cliques and make leather jackets out of rap niggas\nDamn it! I crashed, planets like asteroids\nThe witnesses be watching you be doing them foul boy\nI shrink niggas down to size, smaller then altoids\nAnd remain the reason the people be makin wild noise\nI bodybag you until I'm done with this shit\nAnd tell the truth, I'm at the point, I'm having fun with this shit\nMaking families really looking, and somebody's really checking\nWe left him laying stiff in the frozen meat section\nIm on my pinky ring floss\nBitches be callin me cat-daddy, when they want to speak to the boss\nWhips matching the rubix cube color\nSo many rings on both of my fingers, now they calling me Ring-A-Ling brothers\nSpit venom to the people's enjoyment\nSqueeze niggas til their head pop, have these niggas leaking like ointment, bing!\nWhat the fire be sparking\nHave you laying next to your man like both them niggas parrellel parking\nWanna act tough, hope you niggas know what you starting\nWOOF! You got a dog, or is it a barrel we barking\nThey got a god, pull a threat with these bars\nGot chicks from here to Morroco, skin color Hennesy bronze\nIf you dudes really thinking your low key\nClosest you really would get to shining is when your shining my trophies\nFortunate for you dudes, I'm knowing your whole steez\nNiggas front and do nothing, babble and blow weed\nWhen I see dollar\nGreen money tint, Mark Jacobs leather suit\nStrutting motherfucker, my money sick\nRènado Slim money, we famous now\nMoney freaking so long, dude got a crib on Uranus now\nYou really need to fuck with me to fall back\nOr I'll skin you niggas, lay you out just like a leapord skin format now\nIf you ain't knowing how I'm handling niggas now\nI ain't fighting no more, I stuff animal niggas now, gone\n\n[Verse 4: Ludacris]\nYeah, slow it down real quick I want them to understand every word\n(Beat slows down)\nSlow it down if you moving too fast\nAny rapper talk slick I'll Tami Roman his ass\nSmackdown vs RAW, lets battle to the death\nOr whoever wants to see more bars then DMX\nParents mad cause I cuss at times\nOr is it cause I keep a spliff like Busta Rhymes\nIf you mention MCs, Luda's in the best of em\nI'm a stay hard til I die like Hugh Hefner\nMagnum sponsored, I'm longer then a marathon\nCall me Mega like the head of the decepticons\nIn my prime like Optimus, rock to this\nChain Hungover like Zach Galifianakis\nThey say Luda's in the movies, why he rapping still\nCause I need more jaguars then Jacksonville\nMore bills than Buffalo from my flow\nAnd more blue jays then Toronto\nLudacris I made soccer moms rap\nAlbums, I drop 8 like Octomom's snatch\nHardly clubbing when I do I be flexing\nI be in the cut, that's a Luda C-Section\nYall get your strings pulled, im the orchestrator\nCause I got it made like Arnold Schwarzenegger\nGet it, I'll terminate a super-duper man\nKill yourself if you ain't no damn Luda fan", "image": "https://images.genius.com/54314abfbbbf16253d72455428cc44e6.834x834x1.jpg"}], "artist": "Busta Rhymes"}