{"songs": [{"title": "Hashtag", "album": "The Documentary 2", "year": "2015-10-09", "lyrics": "[Intro: Jelly Roll]\nEgos, egos\nWe broke up like The Beatles\nNow a nigga out here on his own, WOO YEAH!\nGrandmama baby gotta turn up\nGranddaddy was a preacher, YEAH!\nWhat the fuck that got to do with me, though?\nNot a goddamn thing, not a motherfucking thing, NO!\nBig nigga got a dream, motherfucking dream, I turn 'em to reality\nWake up in the morning by myself\nSo I'ma go hard 'til I got nothing left\n’Cause I'ma die by myself, just like you, motherfucker\n’Cause you ain't no better than me, no better than we ('tell 'em)\nMotherfucker\nEvery time I'm in the light, I'm in the dark, Ray Charles (Ray Charlie!)\nLike OOH, OOH YEAH! GOOD LORD! HASHTAG!\nWhat has changed besides the whole motherfucking world?\nIt won't be long before the whole world go into stress\n\n[Verse: The Game & (Jelly Roll)]\nSmoke enough to get fucked up\n(Get high nigga, how long we smoking for? )\nTil' the day I die nigga, West side nigga, smoking chocolate thai nigga\nCan't hit my mothafuckin' blunt unless yo ass got five nigga\nBumpin' Luniz, watchin' Goonies get head on my mama's couch, she walked in\nHad to cuss my mama out, she said get a job, get up off yo ass\n(I'm like \"Ooh Hashtag\"!)\nNow just relax my nigga, picture me rollin' down Compton Boulevard\nWith a chopper on my lap, now repost that my nigga\nDon't make me DM your BM, she wanna see him cause he win whatever he in\nPark a Bugatti at my mama house\nThey ain't even payin' rent, livin' sugar free\n(Nigga why you bullshittin')\nI'm just a hood nigga, all I wanna do is buy swishers\nTake pictures while I'm fucking on these bitches\nHittin' switches while I'm dippin'\nRed Cup full of betchu can't kill it\nThree wheelin' and I bet I won't spill it\nNot one drip\nBeen driving through Compton all day ain't got sweated by one Crip\nIt's my lucky day, and even if it wasn't, a nigga still wouldn't give a fuck today\nDon't pull it if you ain't gonna blast\nMy nigga you can be a hashtag! (Yeah!)\n\n[Outro: Jelly Roll]\nEverytime I'm in the light (I'm in the light)\nI'm in the dark (In the dark)\nRay Charles (Ray Charles)\nLike ooh, yeah, good lord\nHashtag!\nWhat has changed besides the whole motherfucking world?\nIt won't be long before the whole world go into stress\nI swear\nGoddamn\nBelieve that\nNo brakes\nNo love\nWithout love\n[Spoken outro]", "image": "https://images.genius.com/f5bd9dcb51fd19e06b10b2ae0e3620cf.1000x1000x1.jpg"}], "artist": "The Game"}