{"songs": [{"title": "​untitled 08 | 09.06.2014.", "album": "untitled unmastered.", "year": "2016-03-03", "lyrics": "[Chorus]\nWhy so sad?\nWalking around with them blue faces\nShe said I’m down on my luck\nAnd it’s something I gotta have\nBlue faces\nI hit the bank today and told them color me bad\nBlue faces\nGet that new money, and it’s breaking me down honey\n\n[Verse 1]\nTwo tears in the bucket I cry with you\nBut I could never lie with you\nI could never afford not to afford\nI could never put my plans to the side with you\nI could never see a red light\nLike a deer with a headlight\nI freeze up when I re-up\nSee I barely have patience\nAnd you're relating\nOnly the moment to complete us\nWhy you hate to work for it?\nThe reason I never went to work for it\nSee a nine to five was so jive turkey\nBut when Thanksgiving came that check didn’t hurt me\nYou plead the fifth\nI read the Fifth Amendment\nWe both criminals with bad intentions\nThey say time heals all\nBut if I can shortcut\nMy success, Corvettes by tomorrow\nWait a minute!\n\n[Chorus]\nNow, why you so sad?\nWalking around with them blue faces\nShe said I’m down on my luck\nAnd it’s something I gotta have\nBlue faces\nI hit the bank today and told them color me bad\nBlue faces\nGet that new money, and it’s breaking me down honey\n\n[Verse 2]\nMy home girl got a credit card scam\nShe got a scholarship to college but she don’t give a damn\nIntuition got a broke bitch wishin'\nShe tell me this on the phone with the noodles in the pan\nI know you, woman, I console you, woman\nYou feel like the universe owes you, woman\nOh the anticipation, of hoping you could make it\nBitches don't prosper chasing education\nBut you're talented, and can't handle it\nAnd your homegirls can't be your manager\n365 times four, plus more\nIf you can't get it right, tell me, do you got the stamina?\nBut shit, ain't no money like fast money\nEven today I'm considered a crash dummy\nA rapper chasing stardom, how can I fast forward?\nMy accolades better than all them\n\n[Chorus]\nWhy you so sad?\nWalking around with them blue faces\nShe said I’m down on my luck\nAnd it’s something I gotta have\nBlue faces\nI hit the bank today and told them color me bad\nBlue faces\nGet that new money, and it’s breaking me down honey\n\n[Verse 3]\nI wrote this song looking at a broke home baby\nYou know the poverty stricken the little broke boy and babies\nSomebody yell \"Kendrick American, they sho’ is crazy\"\nAnd I said “why?”\nThen he looked me in the eye, and said \"nigga you fucked up\"\nYou’re banking on good luck, you wishing for miracles\nYou never been through shit, you’re crying hysterical\nYou settle for everything, complain about everything\nYou say you sold crack, my world amphetamine\nYour projects ain’t shit, I live in a hut bitch\nI'm living to keep warm, you living to pay rent\nI prayed my way through by waiting on Allah\nYou played your way through, by living in sci-fi\nBullshitting yourself, you talking to strangers\nSame thing goes for the ones you came with\nWhen y'all came on the boat looking for hope\nAnd all you can say is that you’re looking for dope\nThese days ain’t no compromise\nAnd your pain ain’t mines half the time\nA brand new excuse ain’t shit to me\nBitch, I made my moves, with shackled feet\nCape Town\n\n[Interlude]\nIn today's day and age we practice the self pity of taking the easy way out\nYou wait on them, him and her\nBut when a blessing takes too long, that's when you go wrong\nYou selfish motherfucker\n\n[Chorus]\nWhy so sad?\nWalking around with them blue faces\nShe said I’m down on my luck\nAnd it’s something I gotta have\nBlue faces\nI hit the bank today and told them color me bad\nBlue faces\nGet that new money, and it’s breaking me down honey\n\n[Outro]\nPimp pimp (hooray!)", "image": "https://images.genius.com/45790022edf45dc9796e781a40cabb42.1000x1000x1.jpg"}], "artist": "Kendrick Lamar"}