{"songs": [{"title": "Thoughts on Trayvon Martin, President Obama, Race", "album": null, "year": null, "lyrics": "[Elliot Wilson]\nWhen somebody like Harry Belafonte makes a comment, you get offended by that.\n\n[Jay Z]\nI’m offended by that because, first of all, and this is gonna sound arrogant, but my presence is charity, just who I am, just like Obama’s is, Obama provides hope, whether he does anything, the hope that he provides for a nation, and outside of America, is enough. Know what I’m saying? Just being who he is. He’s the first Black president. If he speaks on any issue or anything, he should be left alone. I’m not gonna say anything bad about him. Of course, we’re gonna challenge him to do better, but I felt that Belafonte just went about it wrong, the way he did it in the media and then bigged up Bruce Springsteen or somebody, and it was like, whoa, you just sent the wrong message all the way around. You know what I’m saying? You bigged up--Bruce Springsteen is a great guy, you know what I mean?--you a civil rights activist and you just bigged up the white guy against me in the white media. And I’m not saying that in a racial way, I’m just saying what is, the facts of what it was. And it was like, that was the wrong way to go about it.\n\n[Wilson]\nToday, President Obama made a statement about Trayvon Martin...\n\n[Jay Z]\nAmazing, amazing, amazing. Because it’s hard in politics to really just make a statement as a human. I felt today he was very admirable because he made a statement as a father and as a black man and as someone who had compassion for the things that we go through because he’s been through it before. It’s certainly not normal. You know, a politician is not supposed to speak like that.\n\n[Wilson]\nHe went out of his way to address it...\n\n[Jay Z]\nNo, not address it; he really gave facts about clutching purses. We’ve never heard that! We never heard that come out of a president’s mouth. You know, so, that was big, really admirable. I really have another level of respect for him, to be in that position and make that stance, because that’s what I want to do, I want to be in this position and still talk about what’s right and wrong. I’m not gonna always be right; I’m not gonna always do the right thing. But I’m trying. That’s my whole goal, is to maintain a sense of myself and also I want to represent us. I want to represent us in a way we’ve never been represented before.\n\n[Wilson]\nWhat are your thoughts on Trayvon?\n\n[Jay Z]\nI was really angry. I didn’t sleep for two days. I was really angry about it. We all knew there was still a bit of racism in America, but for it to be so blatant was… if you just asked the questions, asked yourself the question, ‘Didn’t Trayvon have a right to stand his ground?’ He was being chased, he was being chased and he fought back. He might’ve won, that doesn’t mean he’s a criminal. he won. If you chase me, and you try to attack me, and I defend myself, how can I be in the wrong? This guy went to get Skittles and go back and watch the All-Star Game. He had plans. Get an Arizona and get the skittles and watch the game. You know, he probably had his whole position...he had no intentions of robbing anyone's home. You know? So, it's just a thing where, again, a reminder that we still have a long way to go. It's beautiful now, because this generation, they don't see color in that way. We're a bit removed from those racist feelings because, again, it's hard to teach racism when your child is out...you know, our clubs is integrated, the music we listen to is the same.\n\n[Wilson]\n..went to the Jay Z/JT show.\n\n[Jay Z]\nExactly. All our feelings and all our anxieties are more similar now, so you have hope that this generation don't see racism that way, but you still see the old guard, the whole thing that I'm fighting against, that old guard and their old ideas and their stubborn ways and all their ego and all that bullshit. It's still there and it still exists, you know, and you just hate to believe that even a part of it has got to be about business. You know, they're funding George Zimmerman because people want to hold onto their guns, so the NRA is like...you just start...you're mind can go so many places, why the verdict came down the way it came down and we all know it was wrong. It was wrong, this guy was not a professional. First of all, you're not a professional to profile someone. I'm a professional, law enforcement officer, and I'm taught not to profile. This guy's a novice, this guy's a fucking mall cop. You can't assess the situation and figure out what you're going to do, that's not what you do for a living. And even the law, that Stand Your Ground law, you can have a fight with someone, and if they're running away, you can shoot them and kill them, and you're fine? That's not...can we...what?? Let's say...come on...come on man. Someone's robbing your house and they leave and you can shoot them on the way out? They don't possess a threat to you at that point. How? How is that self-defense?\n\n[Wilson]\nYea. I know you dedicated \"Forever Young\" at the shows to him, and stuff like that. The Trayvon situation.\n\n[Jay Z]\nYeah because his memory will live on, right, it'll be...hopefully it'll be...of course, you feel horrible for his parents, that they had to lose their kid, but hopefully this is the moment that changed that law and changed the way we interact with each other. You hate that a child had to be sacrificed for that.\n\n[Wilson]\nWhen you made \"Fuck Up The World\", I know you watch CNN, it was a rebellion act that you saw that kind of inspired that.\n\n[Jay Z]\nYeah the Arab Spring and everybody, how they were standing up and speaking for themselves all around the world, you know, Egypt and whether right or wrong, people now have this platform to say, \"we're not going to allow your politics to get in the way with the way people feel and how the people should be represented.\"\n\n[Wilson]\nIt's funny cause they say how personal Magna Carta Holy Grail is, but you could call it political in a lot of senses. Like, that song \"Somewhereinamerica\", you could take the catchphrase of Miley Cyrus twerking and that's catchy, but it's humor and wit, with a deeper message behind it.\n\n[Jay Z]\nYes, and that's the thing, like reviews...think about trying to get that line. You hear that Miley Cyrus, you're going to come to the wrong conclusion that you really understand the story. People are like, \"why's he saying 'Miley Cyrus' in the song?\" Don't you understand? It's hard to understand the intention behind it. Again, it uses wit and it's catchy, but the real story is about racism. The whole song is, somewhere in America, you can't teach racism when your child is connected to the culture. It's very hard to...\n\n[Wilson]\nShe could be any white girl in middle-America.\n\n[Jay Z]\nExactly.\n\n[Wilson]\nLearning a black dance, or a Hip Hop dance.\n\n[Jay Z]\nRight\n\n[Wilson]\n\"Jay Z Blue\" obviously...you made \"Glory\" right after you had your child, and that seemed like..\"Glory\", the title itself is a very positive kind of glorious thing, and then you look at \"Jay Z Blue\" and there's a very dark vibe to it. The \"Mommie Dearest\" sample [incoherent], why do you feel like you wanted that type of song to represent that?\n\n[Jay Z]\nIf you think about the timing, it's life, right? When your baby first comes, it's only joy. It's only joy, it's like, \"oh my god, look at this.\" It's fascinating that two people can create a life, \"this is real,\" and you know, so it's only glory. It's all joy. Then after that kicks in, you sit with yourself, like, \"am I going to be a good dad?\" I know I have the DNA of my dad, and I know it's not just me and my dad. This is an ongoing problem within our community, how do I get around it? So all those fears and all those anxieties start setting in. I mean, if you intend to do it the right way, the correct way, then you got to really think about it. So those first days was glorious, it was all joy, and now I have to really do the work and make sure I don't repeat that cycle, because I do have my father's DNA, and I'm sure he didn't set out to leave. Actually, he married my mom. It wasn't like he just left day one, he married my mom. He tried, you know? Just, life got in the way. His brother got killed, drugs got into play, so all these things got into play that he couldn't see, nine years out, what was going to happen in life. I'm sure he went into it with the best intentions, the same we all do, and it didn't work out. I don't want that to happen, so let me talk about it. Let me deal with these feelings, let me deal with these emotions, and let me work on it. Let me work it out. So \"Jay Z Blue\" is pretty much that, \"father never taught me how to be a father/treat a mother/I don't want to have to just repeat another/leave another.\" You know, that's the story in a nutshell.\n\n[Wilson]\nWhat's the statement on you putting \"On The Run (Pt. II)\" on the album?\n\n[Jay Z]\nBesides it being really dope?...[laughter]...Again, it's just a showcase of...there's very few relationships in Hip Hop music. There's a lot of, \"I took your girl, and I'm gonna take her again,\"..[cross-talk]..You know what I'm saying? I don't know if people are properly absorbing what I'm doing here. Like I don't know, in the context of...\n\n[Wilson]\nMaking marriage cool in some sense.\n\n[Jay Z]\nJust being honest about it, and putting those sort of subject matters in Hip Hop records. You know? That's not normal.\n\n[Wilson]\nA record like \"On The Run\"? We wouldn't have got that 3 years ago, 4 years ago...\n\n[Jay Z]\nYou would of got \"Big Pimpin'\"\n\n[Wilson]\nThe relationship being such a high profile relationship, there's people that feel so invested in a positive way, and hate on it because of the negative [criticism]..that's how society is. Is it interesting to be on that forefront where, you know, you have to deal with everybody else's feelings and how much they're impacted by what you're doing and just living your life?\n\n[Jay Z]\nI tend not to think about it. If I'm talking about it, we're having a conversation about it, it comes up, I think about it, but everyday when I'm walking around, I don't think about it at all. I know I'm living my life right. I just live my life right, and go about it the right way, and everything will sort itself out. If I'm on the side of right...\n\n[Wilson]\nBut \"On The Run\" is a celebration of it in some sense.\n\n[Jay Z]\nThat's what I mean, so I know I'm on the right, so I'm cool..[laughter]..but if I do something wrong a little bit, my Karma is immediate. My karma is immediate, I'll know. I'll know because something will happen, and it'll be like, \"oh, that wasn't the right shit to do, I apologize.\" [laughter]\n\n[Wilson]\nWell I'm glad you decided to do this man, I hope it was the right decision [laughter].\n\n[Jay Z]\nHey, facts only..[laughter]", "image": "https://images.genius.com/bf0f68ee56f29c8542ad805c6419682b.676x676x1.jpg"}], "artist": "JAY-Z"}