{"songs": [{"title": "Roommates", "album": null, "year": null, "lyrics": "[Intro: Consequence]\nThe conman, aw, damn, we back in town, word\n\n[Hook: Consequence]\nI'm sick and tired of you sittin' around here all day\nI'm sick and tired of you smokin' weed in the hallway\nBut why you worried about me?\nWhy you worried about what I'm doin' here?\nWhy you got to embarrass me in front of company?\n\n[Verse 1: Consequence]\nDamn, you back from your trip\nI thought the plane would have helped you over\nStop sellin' crack out the crib, yeah, when hell freeze over\nUntil the (?) over, hard to fly wings over\nDog, you talkin' way too fast, tell me it slower\nYou seen my boys is over, (?) wasn't right\nCause my feet is on the sofa and I never fill up the (?)\nA man (?), dog, I ain't got my half\nBut if you buy me this, ma, I promise I'll pay you back\nBut the way you act, I be really want to see you dead\nPlus it's four hundred missin' from under my bed\nThey put me in arrest and have you beat them 'bout the iron\nWhen them niggas rushed the crib\nI was the one that poured the ice in them\n\n[Hook: Consequence]\nI'm sick and tired of you sittin' around here all day\nI'm sick and tired of you smokin' weed in the hallway\nBut why you worried about me?\nWhy you worried about what I'm doin' here?\nWhy you got to embarrass me in front of company?\n\n[Verse 2: Kanye West]\nWe have, we have in this corner the dead heat roommate\nFresh from his momma crib\nHe embossed the market thanks to my sponsorship\nI ain't finna argue 'bout what we finna watch, dog\nWe finna watch Fox and the weed finna (?)\nI can't even bring hoes to my spot\nYou be tryin' to thug 'em out, roommate version of Pac\nWhen it's not grievin' when I ask where you'd be\nYou told me like (?), he beat the shit out of me\nThen you borrowed my clothes, don't do that\nIt's makin' me nervous, I found my bird in my (?) book\nCan't find my Julius Erving\nYou from a family of alchies and I'm (?)\nBut I'm feelin' like Perfect Strangers\nCause you about to crowd me, get the fuck out\n\n[Hook: Consequence]\nI'm sick and tired of you sittin' around here all day\nI'm sick and tired of you smokin' weed in the hallway\nBut why you worried about me?\nWhy you worried about what I'm doin' here?\nWhy you got to embarrass me in front of company?\n\n[Verse 3: Kanye West]\nYou got all these Halle Berry posters in the crib\nHow you think she feel about you havin' roaches in the crib?\nI got my name on the orange juice, posted in the crib\nShe drinkin' out the pitcher like most of it was his\nNigga, what the fuck you did with my pornos and comic books?\nHow come I never got the message that my people said you took?\nLook, who the fuck you down with?\nCause them chromes is off the hook\nIt's like the (?) of Rhode Island every time you try to cook\nYou try to cook, nigga, look, I don't ever try to cook\nI just been tryin' to get back that money that I loaned your ass\nOff the books, off the books, yep, a month ago\nYou must have forgot, you must be thinkin' that I'm rich\nBecause I'm rollin' with the rocks\n\n[Verse 4: Consequence]\nAyo, it ain't that I forgot, it's that the (?) is callin'\nAnd you never paid me back\nFrom the time that you broke the toilet\nYou can (?) us out for callin' to my new vacant house\nCause I need my own space, so I'm sorry you bought 'em out\n\n[Hook: Consequence]\nI'm sick and tired of you sittin' around here all day\nI'm sick and tired of you smokin' weed in the hallway\nBut why you worried about me?\nWhy you worried about what I'm doin' here?\nWhy you got to embarrass me in front of company?", "image": "https://images.rapgenius.com/a5f3d80df686cd289f74a159807122cf.1000x1000x1.jpg"}], "artist": "Kanye West"}