{"songs": [{"title": "No More", "album": null, "year": "2011-11-13", "lyrics": "We need to have a conversation\n\n[Verse 1: LL Cool J]\nI made you, why would I play you?\nTrade home base for a California angel\nSwing at a fast bitch, foul out betray you\nWhen I won't even wanna hit it in a day or two\nStraight home I'd run, well that's debatable\nI can't front, I hit a slump, all players do\nBut tough times are minor, to a major dude\nWe all lose sometimes, I call it paying dues\nNow you're searching other clubs for what's available\nA year ago my slot was unassailable\nMy feast is a famine without you to cater to\nIf these walls could talk, what would they say to you?\n\n[Hook: Ne-Yo]\nDon't understand what we're going though\nBut it's like you don't know me\nAnd I don't know you, no more\nNot no more!\nAnd it's like, damn how the hell we get here?\nNo idea, but we're not what we were before\nCould it be that I don't love you\nAnd you don't love me no more?\nThat girl don't live here, not no more!\nYeah, yeah, yeah, that girl no more!\n\n[Verse 2: LL Cool J]\nThe dining room has an empty chair\nThe mirrored staircase has an empty stair\nHouse full of company, but no ones here\nWe're saying cheers while we're holding back tears\nTo keep up appearances in front of our peers\nWe play holiday card tricks every year\nBlack jack, poker, make the joker disappear\nThe ace can't breathe when there's tension in the air\nThree clubs in one night, but nobody cares\nCause it's still not a full house without a pair\nYou tipped your hand, but the text wasn't clear\nYou're dealing from the bottom queen of hearts, play fair!\n\n[Hook]\n\n[Verse 3: LL Cool J]\nSlip in the door, you hold my hopes so\nAll I hear is love don't live here anymore\nWe can tear the house down or build some scaffold\nWe're sitting on a fence, so where you wanna go?\nYou're the architect of your life, it's your show\nYou create the blueprint and how the rooms flow\nBefore you burn the house down, think, take it slow\nEven arsonists needs shelter, let me know!\n\n[Hook]", "image": "https://images.genius.com/7dc78eeed2099cdceeb37c88ec5eb073.600x600x1.jpg"}], "artist": "LL Cool J"}