{"songs": [{"title": "Wasted", "album": "Rodeo (Deluxe Edition)", "year": "2015-09-04", "lyrics": "[Intro: Travis Scott]\nWasted and numb\n(Aw, aw, yeah, aw)\nAre you wasted or nah?\nWasted or nah?\nWasted or nahhhh?\n\n[Verse 1: Travis Scott]\nTake a sip, drowning in this shit\nCoppers on my hip, I hold my head\nI've been taking risks to make that money flip\nShots to the head\nI ain't order it, I can't afford this shit\nGo to war with this you overboard, I'm over bored with shit\nNow it's pay up player, pay a nigga\nGotta day to day to stack and still I pay accounts\n20 racks to show just a little allowance\nOnly come to Houston if the boy allow it\nBow your head to a real one, coming down with them main niggas\nH-Town don't play with us, them wit-it boys stay wit-it\nI've been grinding, slaving over time since I was a fan\nLooking in the mirror like \"One day, Jacques, you gon' be the man\"\nOne skinny tatted nigga, blunt flicker\nYoung La Flame hot spitter who can't hold his liquor, yeah\n\n[Chorus: Pimp C]\nIt's really going down in the goddamn south\nI'm trill, I'm country 'til the end\nIt-it-i-it's really going down in the goddamn south\nI'm trill, I'm country 'til the end\n\n[Interlude: Juicy J & Travis Scott]\nThere's a lot of motherfuckers that can't handle they liquor\nCan't handle these drugs\nWasted or nah?\nIt's only real niggas that can handle their shit man\nWasted or nah?\nYeah (Wasted or nah?)\nSo if you tryna get lit, wanna pour up\nMake sure you stay on our level cause we go up\nLet me see you up\n\n[Verse 2: Juicy J]\nIs you wasted, baby?\nOne shot, two shots and you still talking crazy (Trippy)\nThree shots and you faded\nFreaks coming out at night and they gettin' X rated\nFour shots now she wanna do the clique\nAny more shots she ain't gon' remember shit\nSmoking on extendos, no clips\nProject hoes going up in the Ritz (Trippy)\nShe gon' do it for a G, anything for me, bro\nShe just wanna fucking drink and chief all the weed up\nSexy bitch, pop that pussy 'cause you in your prime\nPour that purple over ice, call it turtle time\nShawty never been a hesitator\nGot her going down on the elevator\nHeard the pussy bomb, I'ma detonate her\nFuck her from the back, keep the neck for later\nNo magic trick but I levitate her\nWith the magic stick, nothing less than great\nWhen I hit her with the dope D I'm gone\nDon't text me later, no extra favors\n\n[Chorus: Pimp C]\nIt's really going down in the goddamn south\nI'm trill, I'm country 'til the end\nIt-it-i-it's really going down in the goddamn south\nI'm trill, I'm country 'til the end\n\n[Outro: T.I.]\nMm; weed, lean, MDMA, he say, she say\nAll the products of a young man gone the long way\nFrom the home that he knew, 'til he roamed where he at\nAnd the phone break up, unknown wake up\nSeveral one night stands, hung up phone, break up\nIf he fall, will he fly? Sure, wouldn't take much\nFor you to find out, jump, if you took that plunge\nIf not, we're in the same spot, how could you judge?\nHow could you judge? C-c-could you judge?", "image": "https://images.genius.com/937ebfe41ce59f14c6ecff9976182911.600x600x1.jpg"}], "artist": "Travis Scott"}