{"songs": [{"title": "LAMBORGHINI TRUCK (ATLANTA SHIT)", "album": "The Play Don’t Care Who Makes It", "year": "2018-02-08", "lyrics": "[Intro]\nYeah, deuce\nAtlanta shit, uh, Atlanta\nAtlanta shit\n\n[Verse 1]\nAtlanta shit, I'm a fashion lover\nVirgil Abloh did my first album cover\nGot my first plaque with Mike Will\nNigga, I don't sleep, no NyQuil\nUsed to sin to pay the bills in my habitat\nThey don't ask where you from when you on a jet\nBackend picker upper, I know you heard about it\nGot a bag from 2012, I ain't never count it\nI let Rico Wade hear my last album\nThen them boys in the dungeon, ain't no band wagon\nMan, I looked up to Dre, he my fuckin' favorite\nAnd Yung Joc still owe me a lil' paper\nServed Big Gipp and Cee-Lo, lethal\nI was mobile, they was peephole, but we was equal\nWe were trappin', they were rappin'\nThat's why I fuck with Dolla, he was always snappin'\nStarted from apartments, ended in a mansion\nThat's the definition of growth and expansion\nA slope and a ramp and a envelope full of hope\nShe gon' lick the stamp and I'm the main attraction\nLamborghini fast and I'm too tall for that shit\nI tried to get in, I had to crawl in that bitch\nBut they 'bout to make a truck so I'ma call 'em\nAsk 'em, \"How many y'all gettin'? I want all of 'em\"\n\n[Chorus]\nLamborghini truck, Lamborghini truck\nLamborghini truck, Lambo, Lamborghini truck\nLamborghini truck (Lamborghini truck)\nLamborghini truck (Lamborghini truck)\nLamborghini truck (Lamborghini truck)\nLamborghini truck (Lamborghini truck)\nLamborghini truck (Lamborghini truck)\nLamborghini truck (Lamborghini truck)\nLamborghini truck (Lamborghini truck)\nLamborghini truck (Lamborghini truck)\n\n[Bridge]\nLamborghini truck (never givin' up)\nLamborghini what? (never givin' up)\nLamborghini who? (never givin' up)\nLamborghini bust (never givin' up)\n\n[Verse 2]\nPanini with the crust (never givin' up)\nGianni on the tux (never givin' up)\nMoney on the other side (never givin' up)\nIn God We Trust (In God We Trust)\nKiller Mike from Adamsville (Mike)\nFam Goon from the Bluff (from the Bluff)\nWhere you from? Where you rode the bus? (bus)\nYeah, them Migos from the North (Migos)\nAnd I'm like the Snowman when I'm holdin' on a fork (skrrt)\nAnd I'm like Dro when I'm rockin' Polo Sport\nI feel like Gucci when I'm walkin' out of court\nRest in peace Lo, rest in peace Bankroll\nOne time for Rocko, Tip, and Roscoe\nOne of the top flows, on the top floor\nGet it wholesale like Costco\nYou know I got that glow, Bruce LeRoy\nAs far as the rappers, I'm startin' to eat more\n2 Chainz\n\n[Chorus]\nLamborghini truck, Lamborghini truck\nLamborghini truck, Lambo, Lamborghini truck\nLamborghini truck (Lamborghini truck)\nNigga, I remember when Baby D was in BMF\nFuck y'all niggas\nLamborghini truck (Lamborghini truck)\nLamborghini truck (Lamborghini truck)\nLamborghini truck (Lamborghini truck)\nLamborghini truck (Lamborghini truck)\nLamborghini truck (Lamborghini truck)\nAtlanta shit\nLamborghini truck (Lamborghini truck)\nNigga, the whole Atlanta gonna have a Lambo truck, nigga\nYou know how we do, gettin' a bag down here, nigga\nLamborghini truck (Lamborghini truck)\n\n[Outro]\nAlready know my lil' bruh's Skooly gonna have one skateboard, know what I'm sayin'? Yellow, motherfuckers, nah, I'ma get that yellow muhfucka. Shout out Future, nigga, Thug, know what I'm sayin'? Scooter, know what I'm sayin'? Lucci, know what I'm sayin'? The city, we full of hittas, we full of hittas. Got Buddha, 217, know what I'm sayin'? Even though those niggas ain't from Atlanta do they beat though. There's so many Atlanta nigga with so much talent, man. Nah, for real. Greg Street, love you, bro, know what I'm sayin'? Everybody who supported me, for real. Even if you didn't support me, somehow you supported me. For real, this go to all the DJs. Not only in the city but just DJs period. Shout out to all the strippers, yes. The strippers, cannot forget about you. Atlanta shit, ATL shit. This is where you come down for a couple days and you never go back home, nigga, trust me, I heard that story a thousand times\n\"Bitch, what you still doin'?\"\n\"I ain't goin' back home, I stay here now, I live here now\"", "image": "https://images.genius.com/36ea96fb9aee3d82e5685a543e312975.717x717x1.jpg"}], "artist": "2 Chainz"}