{"songs": [{"title": "Show Me Somethin’", "album": null, "year": null, "lyrics": "[Intro]\nUh yea, yea, yea, yea, yea\n\n[Hook]\nWhat am I here for?\nI'm a man so I cannot let them tears fall\nBut understand trynna get my head clear ya'll\nThis shit is on my mind\nAsking for the lord to show me all my signs\nShow me something\nCause I'm trynna find something\nI'm lost can you show me something\nI'm lost can you show me something\n\n[Verse 1]\nI sit and reminisce on them niggas no longer here\nAnd how I used to hit the mall and ya was always there\nI sit and think how I didn't grow up with my father there\nNo need to cry cause it only made me stronger yea\nI watched my brother get in trouble with the law and yea\nThat shit cut me like I was sitting in a barber chair\nCause I don't want to see them locked up in them bars in there\nAnd I don't want to see him stretched out in a coffin yea\nI'm wishing I can move my momma out so far from here\nI know that she deserve much better and she worked hard as hell\nThat's why you never see me settle cause they want us here\nI'm trynna side step the devil but he heartless yea\nBut just know that I'm a rebel and yo it's almost here\nI'm talking bout the revolution I am Paul Revere\nSo dry your eyes momma please you can pause them tears\nCause I promise I'm gon get us outta here\nI'm gon get us outta here\n\n[Hook]\nWhat am I here for?\nI'm a man so I cannot let them tears fall?\nBut understand trynna get my head clear ya'll this shit is on my mind\nAsking for the lord to show me all my signs\nShow me something\nCause I'm trynna find something\nI'm lost can u show me something\nI'm lost can you show me something\n\n[Verse 2]\nI swear I'm praying for my niggas when I say grace\nI know them niggas don't care who they hit they spray strays\nBut lord please protect my family cause if they graze\nNiggas is loading up that ammi and them A-K's\nI know it's wrong and that revenge is all in your hands\nBut last night I heard they robbed and killed an old man\nNow if they cold enough to take a life that's innocent\nI know that they could give a fuck whether I live and shit\nAnd so I'm asking you if you can hold me down lord\nBe my umbrella-ella-ella in this downpour\nI know you never ever ever let me drown or\nWon't let that devil ever ever win this round naw\nAnd though I stray for you, you know that my heart is good\nAnd I know I ain't exactly living how I probly should\nAnd I'm a try to act better like it's Hollywood\nNiggas congratulate me I just tell them God is good\nGod is good\n\n[Hook]\n\n[Verse 3]\nYea, huh, yea my niggas drug dealing in the trap\nI'm tellin you wake up nigga it's a trap\nYou set up and to them young mothers fed up\nJust keep your head up\nDon't let up\nYou fall you get up\nYou make your bed up that you sleep in\nFake rappers ain't practicing what dey preaching\nHey tell you hit the trap while they relaxing on the beach and\nI'm here to spit the facts\nA nigga backflipped off the deep end\nI smell this shit for what it is\nNot kells but I love the kids\nAnd so I make the song to let em know that they important\nCause them racist teachers couldn't give a fuck bout wat they score is\nSo they try to get them hands up on them Grants like Horace\nNow slanging for you knoe it cops is knocking they got warrants\nDamn!, uh, and how he running for it\nDamn!, yea and now the cops is running for him damn!\nAnd now he finally slowing down\nHands behind your head, lay down on the ground, nigga\n\n[Hook]", "image": "https://images.genius.com/2cd936e786e1ab454043327d585c7702.1000x1000x1.jpg"}], "artist": "J. Cole"}