{"songs": [{"title": "Facts (Charlie Heat Version)", "album": "The Life of Pablo", "year": "2016-02-12", "lyrics": "[Intro]\nDirt and grime and filth inside\nThe story of my lifetime\nOf cheating, stealing, never feeling\nPain of a brother, your dirty mother\nHa, ha, ha, look how far we are\nG-G-G-Good work, Charlie\n(Perfect!)\n\n[Chorus]\nYeezy, Yeezy, Yeezy just jumped over Jumpman\nYeezy, Yeezy, Yeezy just jumped over Jumpman\n(You!)\n\n[Verse 1]\nYeezy, Yeezy, Yeezy, I feel so accomplished\nI done talked a lot of shit but I just did the numbers\nHerzog and Adidas, man, you know they love it\nIf Nike ain't have Drizzy, man, they would have nothin', woo!\nIf Nike ain't have Don C, man, they would have nothin', ooh!\nBut I'm all for the family, tell 'em, \"Get your money\"\nYeezy, Yeezy, Yeezy, they line up for days\nNike out here bad, they can't give shit away\nI stuck to my roots, I'm like Jimmy Fallon\nI ain't dropped the album but the shoes went platinum (Woo!)\nEvery time I talk, they say I'm too aggressive\nI was out here spazzin', now y'all get the message?!\nOn the field I'm over-reckless, on my Odell Beckham\n2020, I'ma run the whole election, yah!\nI've been trending years, y'all a couple days\nYeezy in the house and we just got appraised\nNike, Nike treat employees just like slaves\nGave LeBron a billi' not to run away (You!)\nTen-thousand dollar fur for Nori, I just copped it (You!)\nYour baby daddy won't even take your daughter shoppin' (You!)\nI done wore designers I won't wear again\nMake 'em niggas famous, they get arrogant\n\n[Chorus]\nYeezy, Yeezy, Yeezy just jumped over Jumpman, ah!\nYeezy, Yeezy, Yeezy just jumped over Jumpman\n(Sonic boom!)\n\n[Verse 2]\nYeezy, Yeezy, Yeezy, this is pure luxury\nI give 'em Grey Poupon on a DJ Mustard, ah!\nIf you ain't poppin' shit then why you rap for, huh?\nPlus Kimoji just shut down the app store, ah!\nAnd we made a million a minute, we made a million a minute\n(We did)\nYeah, we made a million a minute, we made a million a minute, ah!\nDo anybody feel bad for Bill Cosby?\nDid he forget the names just like Steve Harvey? (You!)\nTell Adidas that we need a million in production (You!)\nI done told y'all, all I needed was the infrastructure (Boom!)\nNow we hottest in the streets, it ain't no discussion\nJames Harden, Swaggy P runnin' up the budget (Yoga flame!)\nKeep the work at my baby mama's mama's house\nI'm a jerk, you need to work, you need to call my spouse\nYeezy, Yeezy, take a picture with me on Rodeo\nYeezy, Yeezy, Yeezy, I might do my own hotel\nCouches, couches, couches, couches, which one should I pick?\nI need extra deep, I like my bitches extra thick (sonic boom!)\nEvery time I see the news, man it bring me home\nCall up DJ Mano, shout out Twilite Tone\nWe just blessed to be alive, yeah, ain't that the truth?\nSo let's celebrate the life of Timbuck2\nTimbuck2, Timbuck2\n\n[Outro]\nHa, ha, ha, look how far we are, are, are, are, are, are, are\n(Perfect!)", "image": "https://images.genius.com/389e5fd1eff885b2e7b62060869945cc.1000x1000x1.jpg"}], "artist": "Kanye West"}