{"songs": [{"title": "I’m With Whateva", "album": "Duets: The Final Chapter", "year": "2005-12-20", "lyrics": "[Intro: Jim Jones]\nR.I.P. Big\nWe some niggas that's gonna make you proud of this game\nSmell me? Jones, Capo\nCash Money, Santana\nDipset, Lil Weezy\nLet's ride, Let's ride\nCause real Gs know the feeling\nIt's hard body, no remorse for the killing\nCause real Gs know the feeling\nIt's hard body, no remorse for the killing\n\n[Verse 1: Lil Wayne]\nMad trees and bitches in dungarees\nThe city under seas, kitchen hundred degrees\nI love that summer breeze, I'll stand in it 'til it freeze\nI'm from another breed, them s-s-southern Gs\nI sip promethazine, I lean, I stand tall\nI'm mean, I'm mad raw, I'm coming like fastball\nSteee-rike, yup, so get it right\nNigga, one of my sniplets'll end your whole life\nYou ain't nothing but a riblet to a nigga with a knife\nAnd a fork, I'm a pig myself, I eat pork\nSo be smart and play your own part\nIf you don't love yourself, I'll make you see your own heart\nAnd we don't like the narcs, stay away from the cell\nHey, I'mma shoot it out if I'm facing the L\nYeah, so tell your girl to come and make me rich\nWeezy Baby, nigga, nine to five, ten to six\n\n[Hook: Juelz Santana]\nAll night, I can't sleep, I toss and turn\nGot my hand on my pistol, when will these motherfuckers learn?\nI ain't going out without a fight\nI'm with whatever and I ain't going out without a fight\nI'm with whatever, I ain't going out without a fight\nI'm with whatever, it'd be your life before my life\nAt night, I can't sleep, I toss and turn\nGot my hand on my pistol, when will these motherfuckers learn?\n\n[Verse 2: Juelz Santana]\nIt's showdown time, throwdown time\nSafety off, four pound time\nClack clack, go get yours, I'll go get mine\nCheck it man, I'm with whatever\nGoodness gracious, the paper\nWhere the cash at? Where the stash at?\nI'll blow that ass back for fronting on a nigga like me\nYou got nothing on a nigga like me, you'll see\nI'm on the grind from sun up to sun down\nIf I'm lying, may lightning come down and strike me right now\nI'll turn a dollar to a twenty to a fifty to a hundred\nKeep it coming 'til I'm full on my stomach\nI'm stuck in my ways, I'm stuck puffing my haze\nHand on my pistol, front of it sprays\nI'm stuck living the life of a ghetto nigga\nTrying to get rid of the life, alright?\n\n[Hook: Juelz Santana]\n[All night, I can't sleep, I toss and turn\nGot my hand on my pistol, when will these motherfuckers learn?\nI ain't going out without a fight\nI'm with whatever and I ain't going out without a fight\nI'm with whatever, I ain't going out without a fight\nI'm with whatever, it'd be your life before my life\nAt night, I can't sleep, I toss and turn\nGot my hand on my pistol, when will these motherfuckers learn?]\n\n[Verse 3: Notorious B.I.G (not in album version)]\nAs I grab the Glock, put it to your head piece\nOne in the chamber, the safety is off, released\nStraight at your dome, holmes, I wanna see cabbage\nBiggie Smalls the savage\nDoing your brain cells much damage\nTeflon is the material, for the imperial\nMic gripper, girl stripper, the Henny sipper\nI drop lyrics off and on like a light switch\nQuick to grab the right bitch and make her drop with you\n.45 Glocks and Tecs are expected when I wreck shit\nRespect is collected, so check it\nI got techniques dripping out my butt cheeks\nSleep on my stomach so I don't fuck up my sheets\nMy shit is deep, deeper than my grave, G\nI'm ready to die, and nobody can save me\nFuck the world, fuck my moms and my girl\nMy life is played out like a Jheri curl\nI'm ready to die\n\n[Hook: Juelz Santana]\n[All night, I can't sleep, I toss and turn\nGot my hand on my pistol, when will these motherfuckers learn?\nI ain't going out without a fight\nI'm with whatever and I ain't going out without a fight\nI'm with whatever, I ain't going out without a fight\nI'm with whatever, it'd be your life before my life\nAt night, I can't sleep, I toss and turn\nGot my hand on my pistol, when will these motherfuckers learn?]", "image": "https://images.genius.com/09b1732dbce927085a1fca7538fc1bb3.500x500x1.jpg"}], "artist": "The Notorious B.I.G."}