{"songs": [{"title": "The Start of Your Ending (41st Side)", "album": "The Infamous", "year": "1995-04-25", "lyrics": "[Intro: Havoc]\nYou know what I'm sayin'?\nI wanna say what's up to my man\nLouie you know he's still here\nDrop this one for you, you know\nAnd for those who don't know\nThe 41st Side\n\n[Verse 1: Havoc]\nI keep it real, pack steel like my man YG\nWhen a fool try to play me wet 'em up then I'm Swayze\nYou must be crazy, kid\nRan, I never did\nForever wildin' that's how we live up in the Bridge\nYou just sit scared\nCock back the Gat then hit a nigga like a bid\n25, nah, kid you gettin' life\nForever burnin' in hell, niggas is trife\nIt's the, semi-auto, you can bring it on, yo\nI'm pullin' out strippin' niggas just like a porno flick\nI'm sick the Mobb rolls thick\nCross paths with my clique and get vic\nI'm on some bullshit that's how I was raised, G\nEach level is a stage\nHave you slidin' down blades in pools of alcohol\nWalk before you crawl\nI'm in this to win this, you gonna take a fall\nThe Infamous Queensbridge, kid, we on the scene, kid\nCreepin' on those who caught sleepin'\nDon't ever do that I run with two macs\nAnd plus my crew backs my every move\nI choose givin' crews the blues\nI'm open off the Dainy\nObey me or get sprayed with the sweeper\nCause I'm my brothers keeper\nThe Grim Reaper holdin' with nothin' but big batters\nAnd big heaters\nBlow you three times leave a mark like Adidas\nJig you, I know how to fix you\nPretty boy niggas frontin' hard is the issue\nWord to my unborn you get scolded\nOld and molded when I get bent you get folded\nEvery rhyme is the truth that I must get 'cross\nPut you right on your back, take it to the source\nNo doubt I'm stuck and I can't get out\nOf this lifestyle, the 41st side get bent, run wild\nThe 41st side, two\nYou know how we do, violate, motherfucker\nI'ma see you, with the Linden\nIt's the start of your endin'\nSettin' it again and again\n\n[Interlude]\nYeah kid, its Big Time boy, 12th street representin' it\nBig shout out to my man, Tear Gas, think, Lake whole crew kid\nYou knowhatI'msayin' couso? Richie Fraud known to leave ya scarred, give a big shoot out to my man Heavy L\nBig Palms representing from the Goodfellas\n\n[Verse 2: Prodigy]\nYo, it's the P. E. double push a Lex bubble in the winter\nYou can't come along only the hoes can enter\nTold her to meet me at six on the hill at the center\nTook her to the west way and bent her right over\nStay intoxicated, never sober\nFaced it, violate and get lace'd\nWhy you wasting slugs? You ain't buckin' nothing\nYou better off buckin' yourself: you need to stop fronting\nI used to drive an Ac and kept a Mac in the engine\nLittles painted it black with crack sale intentions\nTo blow up the whole projects the Infamous\nOur sons will grow up to be murderers and terrorists\nIt's the nigga in me, accompanied by the cognac\nYou can ask around, don't fuck with the Mobb\nI could've told you that, where you been at\nYou must have cut class\nIf it ain't me, another member of my crew will kick your ass (what what, what)\nWe do damage to limbs\nIn '91, stomping you out with black Timbs\nProdigy and the H.A.V.O.C. from the Q.B.C\nPutting cowards where they're supposed to be\nIf I don't know your face then don't come close to me\nI got too much beef for that\nDrama in the 3rd degree\nAnd to the kids you don't wanna be me\nI'm up in the mix of action, where niggas wanna kill me\nBut it's the start of they ending, my man's lendin' me his Linden Forty-two shots depending\nOn whether or not the clip is full to the top\nWe busting caps non-stop, blazing\nIn all the shows and even at the hoes\n(Nah, nah chill son)\nWhat?\n\n[Outro]\nAnd it's the start of your ending\n(word up yo, it's the start of niggas ending, youknowhatI'msayin?)\nAnd it's the start of your motherfuckin' ending\n(All y'all weak-ass crews that got drama with mines, you know what I'm sayin', It's the start of your ending, word up)\nAnd it's the motherfuckin' start of the ending\n(we know the fuck you is, you know what will happen)\n(Recognize and realize)\n41st side get bent, run wild\n41st side get bent, run wild\nThe 41st side get bent, run wild\nWord up you know what I'm sayin'?", "image": "https://images.genius.com/b07e53ad94c52f45245db1c1d49e6b00.1000x1000x1.png"}], "artist": "Mobb Deep"}