{"songs": [{"title": "Holla", "album": "Genesis", "year": "2001-11-27", "lyrics": "[Intro]\nYeah, yeah\nThis shit sound like... One, two o'clock in the mornin' with the full moon out\nNiggas in they trucks, creepin'\nWith a fresh box of ecstasy pills for these bitches\n\n[Verse 1]\nYeah, team select, please collect, Gs connect\nThieves, nigga, direct the trees to the SmokeFest\nWanna take a toke? (Yes!)\nThe newest zone I'm in\nI'm like Smithsonian, nigga, fuck it, call me Napoleon\nWave the torch, cut the head off the Leviathan\nThe terminology I'm rhymin' in cause a frenzy up in Ireland\nHit ya, I'm gon' get ya\nAnd drop the bomb scripture at your barmitzvah\nYo, map shit out, blast through the speakers\nWith a wifebeater on, Bushe below, a new pair of sneakers\nStreet niggas hang on the sidewalk\nThat's where I learned my fly talk, pimp strut, and how to skywalk\nModeratin' how we establish the whole Conglomerate\nThe way we honor it, you'll never conquer it\nSee how we wreck has a global effect on even Polish people\nYoung and restless down to the old and feeble\nPeep them, Czechoslovakian to Yugoslavian niggas\nBe all into my bounce so don't be botherin', niggas\nSo NOW you should feel the whole cathedralish bounce\nPut one in your stomach leave you in a fetalish crouch, nigga\nMy vernacular is spectacular\nStrategic plans'll have you lookin wacker than a postal office massacre\nIs that so? Make moves just like a fatso\nBounce in a minivan Astro after my gat (Blow!)\n\n[Hook]\nAyo, get up, get out, get dough\n(Ha, get dough, nigga)\nRoll up, light up, and smoke that 'dro\n(Smoke 'dro now)\nBitch, shake yo' hips and bounce real slow\nNiggas, rep yo' hood, I'm with that\nAll my niggas\n(All my niggas)\nIf you with me\n(If you with me)\nYeah, I see you\n(Yeah)\nHolla\n(Throw yo' guns in the motherfuckin air, c'mon!)\nAll my bitches, if you're with me\n(Yeah, all my bitches where you at now)\nYeah, I see you\n(You know I see y'all)\nHolla\n(Yeah)\n\n[Verse 2]\nMy whole entire mind state deeper—\nThan astronomy and mathematics like Galileo\nSmash you niggas like mashed potato\nBack when niggas used to rock Ballys and Clarks\nI used to watch, little niggas shouldn't hustle nickel crack in the park\nBarrels spray the brighter flame in the dark\nBlood-spill stain on the street, that's how niggas be leavin' they mark\nFuckin' with diplomats who love Bailey's\nMonopolize and quickly get other money fuckin' with Israelis\nSo solid how we be symbolic\nTo a handful of niggas that be all schemin' on the same wallet\nThem type niggas that be conspirin' and kidnappin'\nShit happens! Gun clap for you in the gift wrappin'\nYou should follow how the style switch up\nLike a group of religious niggas schemin' to kill they archbishop\nYou big, pussy nigga, actin' all hard\nCall me atheist, because I don't believe in you, God\nIt's like a grand feast, celebratin' the bounce of the century\nI tote the recipe quick for any type of discrepancy\nBusta Rhymes, the great renaissance artist and architect\nLike how a Filippo Brunelleschi portrait is so hard to get\nWe got the obscure shit for the street\nNevertheless, we split your head and your chest, now rock to the beat\nYo, we got the obscure shit for the street\nNevertheless, we split your head and your chest, now rock to the beat\n\n[Hook]\nAyo, get up, get out, get dough\n(Ha)\nRoll up, light up, and smoke that 'dro\n(Get dough, smoke 'dro, muh'fuckers!)\nBitch, shake yo' hips and bounce real slow\n(Yeah! Yeah! Yeah!)\nNiggas, rep yo' hood, I'm with that\nAll my niggas\n(Yeah, all my niggas)\nIf you with me\n(If you with me, c'mon!)\nYeah, I see you\n(Yeah, know I see y'all)\nHolla\n(Throw yo' motherfuckin' guns in the sky, c'mon!)\nAll my bitches, if you're with me\n(All my bitches where you at, yaknow I see y'all)\nYeah, I see you\n(Yeah! Yeah!)\nHolla\n(Holla at me, now, c'mon!)\n\n[Outro]\nYeah\nBusta Rhymes, cookin' up a little brown stew 'n' chicken\nDr. Dre, niggas\nYeah\n\n[Skit: Wife-in-law]\nYeah, I understand that you're not happy, but that's your wife, and I'm your mistress, so you gotta go back home. But before you do, let me swallow you. Let me lick you in all the right places. I want you to cum all over me, and when you do, I'll bathe you. And then we'll get out the tub, and we'll fuck, and I'll lick your ass, and I'll braid your hair, and you can fuck me anyway you please. We can do almost anything, but once we're finished, and you're happy here, you have to go back home to your wife. But don't you ever forget that I'm your wife in law...\n\n[Produced by Dr. Dre]", "image": "https://images.genius.com/4102489ca8934c81cdf553b85cec18fd.1000x1000x1.jpg"}], "artist": "Busta Rhymes"}