{"songs": [{"title": "Ransom", "album": "Heartbreak Drake", "year": null, "lyrics": "[Intro - Drake]\nYea, it's Drizzy baby\nYou already know who it is\nIt's the first time I'm high\nIt's the first time I smoked in like 3 months\nI'm sorry mama, I had to do it to them\n40 I see you\nO, I see you homie\nI stay late tonight right?\nYou know what happen when I stay late\nYea, Boi-1da!\nI swear it's like this every single time\nToronto I got you\nI got us\n\n[Verse 1 - Drake]\nI'm a hard guy to get along with, get on a song with\nWhen shit be going right, well I just flip it to the wrong shit\nThe team that I belong to, the artists I put on with\nDon't ever ask for nothing cause them niggas got their own shit\nMe and Weezy are like a mouth full of hot peppers\nBlack Ferrari with the red seats, I call it \"playing checkers\"\nI'm never doing verses, I'm forever giving lectures\nIf you trying to meet with money I'll be happy to connect ya\nLife is better than it's ever been\nScheduling million-dollar meetings with the President\nSomeone cut the lights on! Where is Thomas Edison?\nGot a a new condo, watch me as I settle in\nI deserve a MTV show for me and my people\nAnd if you trying to zone, I got a whole Swisher Sweet full\nRappers are liars and their women are deceitful\nAdd until they subtract me, I'll never be your equal\nLast Place Drizzy is the nigga in the lead now\nWeezy told me just write every single thing you need down\nAnd he got it for me and I'm as happy can be now\nBout to start ballin' like I'm coming off a rebound\nYea, and I should have the most bragging rights\nBecause the nigga spit crack, bag it tight\nHate when rappers say they trying to get their swagger right\nCause I dunn came on more fire than a dragon fight\nFuck you pussy ass hater you should do you\nYou ain't heard of me then you should go and get a Blue's Clue?\nOops! I mean a red clue; Wayne's here, Soo-woo!\nBet he felt that like the end of a pool cue\nBut I ain't banging, I ain't waving no flag\nI'm ATF but they ain't seeing no badge\nIt's Heartbreak Drake I hate to see him so sad\nI can son you, see a little me in your dad\nI'm the same yellow boy that used to play up on the Degrassi\nCan pocket 20 thousand to be anywhere they ask me\nCash like Johnny, Banks like Ashley\nBurnin' like a Camel Light; stupid ho, ash me\nBut don't ask me shit about me\nAnd no the game really ain't shit without me\nShe might have to pay me but I dick her down free\nWanna know if it's the truth then pull the zipper down and see\nNo homo though\n\n[Verse 2 - Lil Wayne]\nYea, um, I'm going in\nDrizzy I got us, this is my promise\nIma bring that barrel to them bitches' eyeliners\nAnd what I make up, would fuck up your skin\nI pick the buck up and buck-buck then buck-buck again\nI would butt-fuck your friend\nThen suck up her twin, I put the buck-up to him\nThen buck-buck and buck-buck and buck-buck again\nSuck nut, you duck, fuck your unloving kin, now don't rub it in\nLike Lubriderm on a new tattoo I had to\nKick my princess up out my castle\nDad, who? Never had that dude, always had a black tool\nEven when I was at school, cause bullies aren't bullet-proof\nRed scarf, hoody too, probably ain't as hood as you\nStupid motherfucker the only thing in the hood is you\nI do everything good as you, no I do everything better\nI get paid for every letter, A-B-C, et cetera\nFetch a bone. Like a dog motherfucker I am going for your neck\nIn a sec, intercept, bring it back like work in a trunk\nAnd my exit coming up, yup I am headed to the buck like\nBuck-buck again! Might fly to L.A and just fuck Karrine\nNahh fuck Karrine! Lets get bucks again, and fuckin' spend\nThem bucks, and then, just fuck Karrine\nIf I told you I'mma do it, I did it\nGot my city on my fitted, bout to pop it, let's get it\nLets get it motherfucker whatcha waitin on\nIt is bout a minute past pissed and I'm about to get shitted\nI'm with it if money is the it you want me with\nAnd I probly just spit on the chick you won't be with\nAnd I hate a boney bitch only like em only thick\nAnd I own hip-hop, if you don't spit I'm gon' evict\nAnd I just sold a lot of property to a buyer\nAnd I think his name was kinda like Drake Drizzy Rogers\nOr Drizzy Drake Rogers I'm too busy to play father\nAnd when it comes to the game I'm too willing to play harder\nSo harder I go, there he go\nThey chant MVP when I shoot a free throw\nC.E.O., Jas what it do\nThe haters on their face and in their ass is a shoe\nFaster than you, badder than you, radder than you, et cetera\nI told ya, I get paid by the letter like\nA-B-C-D-E-F-G-H-I-J-K-L-M-N-O-P-Q-R-S-T-U-V-W-X-Y\nZZ Top, yes he rock\nAnd me and Drizzy both wrote on Detox\nThat was just a foot note, how long can he could go\nWondering when he stop, bitch when the beat stop\nSo I'mma keep rockin' to the sheet rock bend\nThen the heat I send burn skin, the end\n\n[Outro: Lil Wayne]\nYoung mula, baby, uhh", "image": "https://images.genius.com/405c9bcb0dcbee7d15bcc86cd8e8366a.500x500x1.jpg"}], "artist": "Drake"}