{"songs": [{"title": "Maggot Brain", "album": "Still Blowin’", "year": null, "lyrics": "[Intro]\nBeitch!\nShort Short\nI'm from The Town\n\n[Too $hort]\nTen years ago, you was havin thangs\nNow you ain't nuttin but a maggot brain\nUsed to be on the block gettin at 'em mayne\nBack in the days when you was slangin 'caine\nNow you fresh out of jail, just comin home\nLivin at your momma's house, nuttin goin on\nCain't hustle, and you cain't fit in\nHit the corner, but you ain't makin friends\nYo' life, just twist and turns\nOut on parole, now he fin'sta learn\nIf you sleep too late you cain't get the worm\nYou cain't smoke weed cause ain't shit to burn\nThat's where you at, and ain't no way back\nThese lil' niggas on the block stay strapped\nFuck that~! Convicted felon with a gat?\nIt's mandatory; you get caught you goin back\n\n[Chorus: repeat 2X]\nYou gettin off doin nothin\nGet your mind right ya, need to do somethin\nSpend all day smokin blunts\nYou maggot brain, get yo' mind right and so somethin\n\n[Silk E]\nYou barely pay your rent; spend all day on the phone\nYou're always lyin, yo' excuses be irrelevant\nYou let 'em hit and use yo' food stamps to feed his friends\nAlways yellin, always beggin somebody to babysit\nHell, you're always in barely everything\nAlways causin problems, always with it, barely know his name\nYouse a trainwreck, think we can't see through that?\nGet ya mind right, youse a burnt out turfin rat\nYou barely in your house, it always smell like piss\nYou only scrapin when company comes over\nThen you jumpin in the shower, snitchin and ya gossipin\nAin't nobody like you, so you wonder why she not ya friend\nSilk, it's Silk E not cotton blend\nAuthentic not rented official game spitter\nFight over yo' baby daddy {?} fuck with her\nAlways talkin shit, always on my nerves, youse a maggot brain\nMaggot brain\n\n[Chorus]\n[Too $hort]\nI know you doin bad, but don't stalk her\nYour girl upgraded now she's fuckin a baller\nShe don't wanna be wit'chu - why would she?\nVideo games, blunts and pussy?\nThat's all you want, cause you have no goals\nStayin at your momma's house, is so old\nYou need to reinvent yo'self right now\nYou need a makeover, a new lifestyle\nSome new clothes, a new place to live\nGo get yo' baby momma and take yo' kids\nStop doin crime, and stay out of court\nCause you know you ain't never paid child support\nAnd if you get a job, they take it out yo' check\nCan't get a driver's license, now you really 'bout to quit\nTen years ago, you was havin thangs\nAnd now you ain't nuttin but a maggot brain - BITCH!\n\n[Chorus]\n[Outro]\nYou in the mix baby\nWit'cha boy Too $hort\nI'm still blowin", "image": "https://images.genius.com/cbce7a2bf9547c73552eb8d05ea5f8b2.700x700x1.jpg"}], "artist": "Too $hort"}