{"songs": [{"title": "No Tilt", "album": null, "year": "2017-09-08", "lyrics": "[Intro: Ski Mask the Slump God]\nAyy!\nHaha, basic smoke\nWater! Pussy boy, huh, look at it\nBet, bet, bet, bet (look at it), bet\nLook at it, look at it, look at it!\nBet, bet (huh, huh, huh, huh, huh!)\nYuh (ayy!), yuh\nYuh, yuh, yuh, yuh\n\n[Verse 1: Ski Mask The Slump God]\nDiamonds on loop-de-loop\nSo big it look like a hula hoop\nThey tryna lock me in pigeon coop\nEven if so I would chop the roof\nSlick like I'm Rick\nSlick like a fork after used to eating ramen noodle soup\nI'm on a hunt like Attila the Hun or it’s winter way\nHungry for caribou (water!)\nTryna bag me a bad and boujee barbie boo\nThat be flipping like nickel when I rendezvous\nHow I recycle money it's like déjà vu\nThis not Snakes on a Plane, this is Gucci on my suit\nWhoops, I gave her sauce like oops\nWeed smoke it smell like a poop\nI just spilled sauce like whoops\nI just spilled sauce like, sauce like, sauce like, sauce like\nSauce, sauce, sauce\n\n[Chorus: Ski Mask The Slump God]\nI just spilled sauce like whoops\nWeed smoke it smell like a poop\nOops, whoops\nI just spilled sauce like whoops\nI just spilled sauce like oops\nWeed smoke it smell like a poop\n\n[Verse 2: Lil Yachty]\nDiamonds, ooh, I like diamonds, ooh\nNiggas hate me cause I'm gettin' this guap\nSpend it all on diamonds, uh\nNiggas fuck with me when I was coming up\nBut I'm on they hatin', uh\nThat don't make sense (nah)\nWe out gettin' money boy why is you tense\nThese washed up rappers be rinsed\nBentley or Benz, whichever I'm in, got a bitch and her friends (aah)\nI live for my enemies, pray for my sins\nI beat that bitch mouth, leave a child on her chin (whoo)\nRing on my finger, nine times ten\nFuck with the kid if you wanna lose friends (yeah!)\nI just met the bitch and she gave me her Xans (yeah! yeah!)\nMy bitch from India, ain't talkin' redskins (yeah! yeah! let's go!)\nI'm a rich young nigga from the county (wooh!)\nYou a fake Blood, you don't bank bounty (brr-at!)\nBetter ask your main bitch how she found me (yeah!)\nKeep young real niggas all around me (wooh!)\nI said fuck cops (fuck 'em!)\nG-Wagon, truck stops (skrrt)\nGot a big knot (yeah!), ayy!\n\n[Verse 3: A$AP Ferg]\nDiamonds they loop-de-loop (loop)\nHop in the coupe and swoop (swoop)\nYou is a Juicy Fruit (fruit)\nYou don't got juice you fruit (money)\nHop on that track and poop (poop)\nI'm spittin' that shit I'm the truth (truth)\nBustin' that mac out the roof (brrt, hooh, hooh, hooh, money!)\nMy bitch got an attitude\nWell I got a Céline bag for you (yeah)\nMy bitch is so magical\nMake her disappear like a spectacle (hooh)\nI'ma hit 'em with the Batman, uh (skrt)\nCall me Master Bruce (yeah!)\n.45 make a nigga tap dance (right!)\nWith the Mac in the backpack\n\n[Chorus: Ski Mask the Slump God]\nI just spilled sauce like whoops\nWeed smoke it smell like a poop\nOops, whoops\nI just spilled sauce like whoops\nI just spilled sauce like oops\nWeed smoke it smell like a poop (water!)\n\n[Outro: Ski Mask The Slump God]\nI just spilled sauce like whoops\nWeed smoke it smell like a poop\nOops–", "image": "https://images.genius.com/bf61e153a6263880496154e869d38603.498x498x1.png"}], "artist": "Ski Mask the Slump God"}