{"songs": [{"title": "What the Game Made Me", "album": "I Got the Hook-Up! (Original Motion Picture Soundtrack) ", "year": "1998-04-07", "lyrics": "[Chorus: Jay-Z]\nI'm what the game made me\nNot what the fame made me\nNo amount of money can change me\nI'm what you lames can't be\nLive nigga what? Live as fuck\n\n[Verse 1: Jay-Z]\nCheck, live from the 7-1-8\nEither respect the flow or learn your lesson from your wake\nI'm wishin arthritis on all writers who, Knock My Hustle\nHow can y'all understand the struggle?\nIt's hard to live, when you got greedy niggas in the mix\nKnowin I outclass three-E niggas in the six\nSo I outblast til it's empty clips\nAnd I outlast niggas, survival of the fit\nOne life, I gotta make sure it's done right\nCause them yet to have a conversation bout reincarnation\nBall out, until I fall out\nStick thick chicks, try to tear they wall out\nHard to think about your future with, nothin to gain\nHard to concentrate on school with stomach pain\nLife's harsh, I know y'all runnin from 'caine\nBut it'll only catch you and track you down\nWith no deal, who you gonna rap to now?\nStart your own record company, that's profound\nLive niggas gonna rumble when you backs on the wall\nJive niggas gonna crumble and fall\n\n[Chorus]\n\n[Verse 2: Memphis Bleek]\nAiyyo whether in the Pinto, or rollin in the six\nI come through cocky, holdin my dick\nI never switch shit, cause that's some bitch shit\nI get the Bisquick take it to the district\nCause I could never get rich, and switch my style\nI just cop a little hurt, to the mercantile\nI'm tryin to get it though, rhymin with this six digit flow\nGettin fly is the minimal, holdin somethin is the principal\nRespect this young nigga that's, holdin the torch\nPreachin shit like the crack game, don't take shorts\nThrow it down it's a bet, nigga roll hard\nTil you got somethin icey, round your neck\nIn this concrete jungle get rich or remain humble\nNever speak the biz, at worst I might mumble\nNiggas test it I spit guns, angrily\nTil all that remains is me\n\n[Chorus: Memphis Bleek]\n\n[Verse 3: Sauce Money]\nI went from no dough to show dough to money to blow\nFrom umm, ho I don't know, to get deez\nNever, \"Excuse me miss,\" bitch please, never try to provoke\nSame disrespectful cat I was when I was broke\nAin't nuttin changed baby but the different faces I stop\nOr maybe some of the places I shop\nNow that I run through tracks like cleets with a Air\nFor some of the hottest beats, still catch me eatin at Pete's\nFuck the foul cat who screamed out and threatened my life\nIt's all good, here I come kid, dead to the hood\nTil I'm in the dirt, foul cats like termites\nCome out of the woodworks, if they think you stack paper\nDead niggas react later while the cancer spread\nTeach a team how to scheme before they answer lead\nYou know me, I used to shoot hoops in the park, ain't nothin changed\nExcept now I push Coupe's in the dark\n\n[Chorus: Sauce Money]", "image": "https://images.genius.com/4837c1022e10f4e9d9e46abff51b9e75.571x571x1.jpg"}], "artist": "JAY-Z"}