{"songs": [{"title": "Don’t Hurt Me", "album": "A Son Unique", "year": null, "lyrics": "[Ol' Dirty Bastard]\nYo, stepping fresh out the clean, through the fog\nI be that Ol' stinkin' Dirt McGirt dog, with a hurtin' for ya\nThat nigga liftin' ya skirt, learned it in the dark\nHurtin' bitches feelings on purpose, I'm a dog\nBiting, no -- I don't bite, see\nI just like to nibble on ya nipple, a little\nIt's not a riddle, or game, with dope\nI just wanna stroke or poke, you in the right place\nAs if your pussy got a nice face\nYou need to stop fucking with lightweights\nSee my Roc chain is heavy, cock game, is ready\nTo shoot, oh bitch, go get cute\nCuz you can easily get treated like a prostitute\nPlease believe me, I like it raw, because I'm so freaky\nDirty, but a nigga still shining when you see me\nYou know that nigga, A, Son\nNever been tooken out, Dame, good looking out\nHoes holla!\n\n[Hook: Rhymefest (girl) {Ol' Dirty Bastard}]\nI'mma keep it real, don't hurt me\nA nigga like me, love the ill punani, cuz I'm dirty\nPlease don't flirt with the Dirt McGirt\nWhen I'm done, liftin' ya skirt, then this mic get hurt, u know\n(Don't hurt me, Dirty) {Okay}\n(I promise, I won't you, Dirty) {You sure?}\n(Don't hurt me, again) {Okay} (Don't, don't, don't hurt me again)\n\n[Ol' Dirty Bastard]\nAiyo, my album gets crazy, but I'm still on the low\nYour style is flashy, and you don't got no hoes\nDon't front, I spit classics, you know how it go\nOn my leisure, Lisa give me so much throat\nWell I need ya, bitch, betta have my dough\nAnd Indonesia, in the Dutch, already rolled\nDon't let 'em fool ya, tell you, Ol' Dirty's a joke\nSomebody school her, tell her Ol' Dirty's a pro\nFirst it's marriage.... then it's babies....\nYou know, Dirt love the babies.... (aiyo, bounce with me now)\nIt's game time, baby, ball with me now, I'm in your court, now\nIn your grand marquee, on tour with me now\nWith the Benz, laid back, in the hood with me now\nMomma said she wanna go with me, cuz I make her feel good\nWhen she go away with me, Ol' Dirty, nigga!\n\n[Hook]\n\n[Outro: Ol' Dirty Bastard (girl)]\n(Don't hurt me, again, don't, don't, don't hurt me again)\nYeah, I'm back, what you thought?\n(Don't hurt me, again, don't, don't, don't hurt me again)\nShake ya ass to this!", "image": "https://images.genius.com/035d8c96b903707a3cfd550d89c33684.400x400x1.jpg"}], "artist": "Ol’ Dirty Bastard"}