{"songs": [{"title": "Good Kush And Alcohol (Love Me Demo)", "album": "#MikeWiLLBeenTriLL", "year": "2012-12-24", "lyrics": "[Intro: Future]\nYeah, yeah, BeenTrill, the movie, hosted by yours truly. The Astronaut Kid, motherfucker. Been trill, been doin’ it, been at it. Been start doin’ in this shit before you niggas. Been fly, been underrated, been grindin’, been payin’ dues. Been smashin’ your bitch, nigga. Been turnin’ up. We been had it. We been at it. We been making classics, motherfucker. Been trill, nigga. Future Hendrix. Astronaut nigga. Still on Pluto motherfucker\n\n[Hook: Future]\nI'm on that good kush and alcohol\nI got some down bitches I can call\nI don't know what I would do without y'all\nI'mma ball til the day I fall\n\n[Hook 2: Drake]\nYeah, long as my bitches love me (yeah, yeah)\nI can give a fuck 'bout no hater\nLong as my bitches love me\nI can give a fuck 'bout no niggas\nLong as these bitches love me\n\n[Verse 1: Future]\nI suffered like immigrants, now my bitches immigrants\nYoung niggas ain’t got remorse, they shootin' at your innocence\nYou put in your own work, you reap all your benefits\nYou grind til’ you shed a tear, like, why I get put in for\nI done it, lost it all, I had no one to call\nWe living on couches, these niggas ain’t 'bout shit\nTake a straight shot to the head, face first sippin' ain’t scared\nBut it’s time to break bread, she asked how much I need\nI’m ‘bout to fuck the hood out this bitch ad roll me some weed\nI can’t see it like I want to, but she’s always there for me\nIt’s been hate the days in the streets and I have nobody\nWhen I'm stressing, I hit her up and then we talk ‘bout it\n\n[Hook: Future]\nI'm on that good kush and alcohol\nI got some down bitches I can call\nI don't know what I would do without y'all\nI'mma ball til the day I fall\n\n[Hook 2: Drake]\nYeah, long as my bitches love me (yeah, yeah)\nI can give a fuck 'bout no hater\nLong as my bitches love me\nI can give a fuck 'bout no niggas\nLong as these bitches love me\n\n[Verse 2: Future]\nOG, Granddaddy, blowing like a chimney\nLast night I passed out mixed for a women\nCan’t keep it real with niggas, you got to handle business\nYou can’t see what I go through cuz it’s covered with all my image\nAnd I love this life, and I won’t trade it for the world\nAnd these niggas fake, that’s why you got to fuck their girls\nGet high as kites, and we taking shot’s of syrup\nI can’t see myself, if I was looking in the mirror\nI don’t understand the haters and I will never understand it\nThese niggas rather see you fall, than see you standin’\nThese niggas they'll leave you for dead while you breathin'\nI feel like she love me, unconditionally, know I can see it\n\n[Hook: Future]\nI'm on that good kush and alcohol\nI got some down bitches I can call\nI don't know what I would do without y'all\nI'mma ball til the day I fall\n\n[Hook 2: Drake]\nYeah, long as my bitches love me (yeah, yeah)\nI can give a fuck 'bout no hater\nLong as my bitches love me\nI can give a fuck 'bout no niggas\nLong as these bitches love me", "image": "https://images.genius.com/5ecf9dc2688313a7b0d2559e0820499a.300x300x1.jpg"}], "artist": "Future"}