{"songs": [{"title": "H2O", "album": "YouWillRegret", "year": "2017-06-26", "lyrics": "[Intro: Ski Mask the Slump God & XXXTENTACION]\nHuh!\nMe and Ski are in the booth, together, (Huh) together!\nBack still hurt, again bitch, ayy!\nHuh, huh\nI'ma give yo' bitch molly and water! Hahahahaha\nI, I do not fuck I swear to god Yuh, yuh, ayy, ayy, ayy, ayy, ayy, ayy\nI'm gonna water her crops, huh, huh, huh (Viral pussy ho! Ayy)\nAyy!\n\n[Pre-Chorus: Ski Mask the Slump God & XXXTENTACION]\nI'm gon' make her H2O, out her pussy hole\nI'm gon' make her H2O, out her pussy hole (Ayy!)\nPut some diamonds on my fist, now my wrist too cold (Oh my, ayy-ayy)\nPut some diamonds on my fist (Oh my), now my (Oh my) wrist too cold\n\n[Chorus: XXXTENTACION & Ski Mask the Slump God]\nOkay like, wet, wet, wet, wet, wet, wet, H2O (Water)\nWet, wet, wet, wet, wet, wet, H2O, ayy! (Water)\nWet, wet, wet, wet, wet, wet, (Water, Ayy ayy) H2O, uh!\nI'm gon' make her H2O, out her pussy hole, okay like (Ayy-ayy, ayy)\nYuh!\n\n[Verse 1: Ski Mask the Slump God & XXXTENTACION]\nWrist too cold, wrist too cold, wrist too cold, wrist too cold\nDiamonds on my face, they gave me runny nose\nFuck my foes, and these hoes (Ayy!)\nOkay, wrist too cold, wrist too cold, wrist too cold, wrist too cold (Uh)\nI was chillin' in the 90210 Body bag him if he try to take my ho (Ayy, ayy)\nI think I hit my peak (Ooh!), I'm high as a eagle beak\nShe's wet as Dawson's Creek, I just made a mil' no Meek\nBitch I cut off the leash (Ayy!), I do not want your yeast\nPeace to the Middle East (Ayy-ayy)\nI want your Reese's Piece\n\n[Chorus: XXXTENTACION & Ski Mask the Slump God]\nOkay like, wet, wet, wet, wet, wet, wet, H2O (Rrr, uh)\nWet, wet, wet, wet, wet, wet, H2O (Ayy!)\nWet, wet, wet, wet, wet, wet, H2O (Uh)\nI'm gon' make her H2O, out her pussy hole, okay like (Wet, wet, wet, wet, ayy-ayy, ayy)\n\n[Verse 2: XXXTENTACION & Ski Mask the Slump God]\nGot her wetter than water, what is your fuckin' vendetta?\nI just be beatin' her pussy, I'm not a gentleman\nVetements, slob up on my denim, cost a settlement, settle\nHop up on that booty, she shake it like snake, rattle\nIf she say she want a spanking, bitch, I'ma beat her with a paddle\nThen I pop up in front of her just like a Yu-Gi-Oh! battle (Ayy)\nI need a triangle diamond, bitch, I'm American Idol (Ayy, Ayy, Ayy)\nGot her pussy so watered that it might have it's own title (Ayy, Ayy, Ayy)\n\n[Bridge: Ski Mask the Slump God & XXXTENTACION]\nWrist too cold, wrist too cold, wrist too cold, wrist too cold\nDiamonds on me, water, H2O, H2O, H2O (Uhh)\nWrist too cold, wrist too cold, wrist too cold, wrist too cold (Ayy!)\nDiamonds on me, water, H2O\nDiamonds on me, water\n\n[Chorus: XXXTENTACION & Ski Mask the Slump God]\nOkay like, wet, wet, wet, wet, wet, wet, H2O (Yuh, ayy, ayy, yuh)\nWet, wet, wet, wet, wet, wet, H2O (Water, Ayy!)\nWet, wet, wet, wet, wet, wet, H2O (Okay, okay, yuh!)\nI'm gon' make her H2O, out her pussy hole, okay like (Ayy!, yuh!)\nYuh", "image": "https://images.genius.com/36f197d09b38537613f514d89aed39cb.440x440x1.jpg"}], "artist": "Ski Mask the Slump God"}