{"songs": [{"title": "Metropolis", "album": "Under Pressure (Deluxe Version)", "year": "2014-10-21", "lyrics": "[Verse 1]\nSometimes I feel like I've drifted, I feel different I feel gifted\nI've been high so long, don't need to smoke to get lifted\nI've been under pressure looking for Nikki\nWhenever she is around, you know I come quickly\nVivid memories of Chicago, south side where I go\nFrom Reggies to the House of Blues, progress is the motto\nMan the first show that I ever done sold out was in Chicago\nYeah, yeah, living like I've been ready to die\nMaybe not, I don't know why my mind is changing\nRearranging this dangerous melody, uh\nYeah, and I know that ain't nobody finna ever be ahead of me\nAll that competition right there is dead to me\nYeah, uh, yeah, I've been turning the pages\nFeeling the vibe, shit is outrageous\nBoy, I've been feeling courageous\nThis shit right here, I've been at it for ages\nFeels like I'm running through mazes\nEverybody has they phases\nYeah, vibe with this, bad bitch in the whip and I ride to this\nAnd I'm feeling it uh, hope when I'm forty I'm still in it\nOne of the few that be killing it, uh\nYeah, young motherfucker that be giving what he living\nOn the road to success so you know that I'm driven\nBut they didn't wanna publish it\nBut right now I'm on some other shit\nI'm in a different world, I'm with a different girl\nI'm with the same team, but it's a different scheme\nRemember back when I couldn't even pay the bills\nAnd I'll never forget how that feels back when I would\n\n[Refrain 1]\nBuy it, break it, roll it, light it, smoke it, inhale it, I'm gone\nBuy it, break it, roll it, light it, smoke it, inhale it, I'm gone\n\n[Verse 2]\nOkay, doing what I gotta do, flying at this altitude\nI look out the window like Goddamn, that's what I really do\nDon't know why I fear the planes, sometimes I wish to sustain\nIf I look back on it I would do it all over again\nNikki, Nikki, where you been? I can't wait to breathe you in\nBeen on this plane way too long, I can't wait to see you again\nOh my God this turbulence has got me sippin' on this liquor\nCrazy, racist, white bitch looking at us\nLike, \"Who are these niggas?\"\nFirst class, on they ass, all complain that's when I dash\nJust landed in Europe and this model bitch is tryna smash\nNow I'm riding on the train, all this shit inside my brain\nJust left a hotel in Belgium, damn them waffles was insane\nSmoking blunts in Amsterdam\nOh my God, this is my jam\n\"May-December\" by Mos Def\nIn my headphones, that's the man\n\n[Refrain 2]\nI know, I know that I got it if I, do what I gotta do to get by\nAnd they wonder why I never get high\nAnd they wonder why I never get high\nI know, I know that I got it if I, do what I gotta do to get by\nAnd they wonder why I never get high\nAnd they wonder why I never get high\n\n[Verse 3]\nOkay, fuck affiliation, I'm that dude that did it on his own\nThese thoughts inside my mind be fuckin' with me when I'm all alone\nI really like this girl she bad as fuck, why must I run away?\nIt feel like self assassination, I can't put this gun away\nGod damn, what's the plan? Not complacent where I am\nReminiscing when I hit the road back in that mini van\nBroke as fuck, not a dollar, whipping that Chevy Impala\nPraying that we make it out this city, Lord willin', Insha'Allah\nUp to date the couple years, now my idols are my peers\nI was on the road to nowhere till I decided to veer\nPut my everything into this shit, you know, I know you know this\nUsed to give a fuck what people thought, hoping that they would notice\nStop giving a fuck cause music gotta be the only motive\nMind racing on and off the track, I'm going locomotive\n\n[Skit: Logic & Anna]\nI can't believe you don't like Tarantino\nUgh, I don't like him because, like—when it's non like non-Tarantino-esque, I think it's a good movie—\nYou mean like Inglourious Basterds?—I didn't see that\nWhat?!—I didn't, I don't know—\nOh my God! Have you seen 'Pulp Fiction'?\nYeah, but I don't really remember it\nWhat you talking about? Have you seen uh... this is funny cause we're on a train... have you seen—fuck! What's his name? The guy from the movie, in the place, on the thing?\nOn the train? With the scenery?\nUh, I'm tryna remember right now, dammit—'Source Code'!\nNo—You haven't seen that?\nNo—With the dude from 'Donnie Darko'?\nWho's that?—Oh my God\nWell, I still wanna know what your favorite Tarantino movie is...\nMy favorite Tarantino movie—?\n\n[Refrain 2]\nI know, I know that I got it if I, do what I gotta do to get by\nAnd they wonder why I never get high\nAnd they wonder why I never get high\nI know, I know that I got it if I, do what I gotta do to get by\nAnd they wonder why I never get high\nAnd they wonder why I never get high\nI know, I know that I got it if I, do what I gotta do to get by\nAnd they wonder why I never get high\nAnd they wonder why I never get high\n\n[Outro: Thalia]\nThe original members of the Rattpack include:\nC Dot Castro, Big Lenbo and Logic", "image": "https://images.genius.com/6d3ae39514ef99749706fb3ccdc22dd2.1000x1000x1.jpg"}], "artist": "Logic"}