{"songs": [{"title": "La Rhumba", "album": "Digital Bullet", "year": "2001-08-28", "lyrics": "[Intro: Ndira]\nHere we are..\nBobby, I was just wondering, you know\nAbout me and you, tonight\nIf we could go do a little Rhumba\nDance, you just think about it and let me know\n\n[Hook: Ndira]\nEsta bueno, porque esta es La Rhumba\nVen bailar conmigo en esta Rhumba\nEsta bueno, porque esta es La Rhumba\nVen bailar conmigo esta Rhumba\n\n[Verse 1: RZA]\nRhumba? What's Rhumba?\nI'm sayin' though, what?\nI'm sayin'..\nYo, what up Butter Pec'? Girl, you got me shy to speak\nYou the same dime piece that I saw last week\nOn the dancefloor, yo, the way you glide\nMake a club of thugs do the Electric Slide\nPretty in pink, come here, let me buy you a drink\nArmaretta sour orders put us both in sync'\nMy name is Bobby and I don't usually dance that much\nI play the wall, but girl, you got that magic touch\nThat lured me in like a fly into the spider's web\nNot these everyday hoes sweatin' ghetto celebs\nPower Rule, I heard you got the good Power-U\nLet's slip to my crib for an hour or two\n\n[Hook]\nEsta bueno, porque esta es La Rhumba\nVen bailar conmigo en esta Rhumba\nEsta bueno, porque esta es La Rhumba\nVen bailar conmigo esta Rhumba\n\nEsta bueno, porque esta es La Rhumba\nVen bailar conmigo en esta Rhumba\nEsta bueno, porque esta es La Rhumba\nVen bailar conmigo esta Rhumba\n\n[Verse 2: Method Man + Killa Sin]\nHey, hey, hey..\nUh, uh, uh, uh..\nEh eh eh eh eh..\nHey, Butter Pecan what's that lingo you speakin'?\nIt sound like, let's me and you slide for the weekend (True)\nI got drinks and tasty treats to sink your teeth in\nYour popi two-way beepin', let him know that you cheatin'\nRunnin' 'round indecent exposed without no clothes\nThere it go (*plug*), Moby Dick and there she blows\nYou got me covered, girl, and it shows and I suppose\nWe can play doctor soon as I drop my Girbauds\nI don't wanna dance baby girl, it's like my legs is on strike\nBoogie that ass to the bar, snatch a Remi, no ice\nI'm in the corner, we can vibe all night\nPolite, I need a bag of that grass\nTo blast me out of sight like a satellite\nBigga what up? Yo, long time, good to see you\nLook at shorty ass shakin' like the system in my vehicle\nClubbin', twenty deep, buggin', all types of funny freaks\nMouths wide shut, we let our love for the money speak\n\n[Hook]\nEsta bueno, porque esta es La Rhumba\nVen bailar conmigo en esta Rhumba\nEsta bueno, porque esta es La Rhumba\nVen bailar conmigo esta Rhumba\n\n[Beretta 9]\nYo\nOpen season, open fire, Beretta barbed wire\nFirst platoon strike soon, scud-missile on the whistle\nUp in the club with the pistol\nThis chick bumped into me like, \"You big joint official?\"\nIndeed, so? Blow out your back, yo\nShe was like, \"Yo, negro, negro\"\nPuffin' all that trash, you best to see so (so so)\nSo I introduced her nightcap, she was like, \"I like that\"\nLater on tonight, you know, I gotta spit that\nFlow and a half, blow at her back\nI like it rough, and I hope she's rough back\nShe was like say her name\nI was like, \"Say mine back\"\nShe was like, \"Yo, daddy, daddy, daddy\"\nI love it like that, Beretta stay givin' it\nPower-U so good, I just might have to jizz in it\n\n[Hook]\nEsta bueno, porque esta es La Rhumba\nVen bailar conmigo en esta Rhumba\nEsta bueno, porque esta es La Rhumba\nVen bailar conmigo esta Rhumba\n\nEsta bueno, porque esta es La Rhumba\nVen bailar conmigo en esta Rhumba\nEsta bueno, porque esta es La Rhumba\nVen bailar conmigo esta Rhumba\n\nEsta bueno, porque esta es La Rhumba\nVen bailar conmigo en esta Rhumba\nEsta bueno, porque esta es La Rhumba\nVen bailar conmigo esta Rhumba\n\nEsta bueno, porque esta es La Rhumba\nVen bailar conmigo en esta Rhumba\nEsta bueno, porque esta es La Rhumba\nVen bailar conmigo esta Rhumba", "image": "https://images.genius.com/52be3befc1392598c2d27e30b8059858.500x500x1.jpg"}], "artist": "RZA"}