{"songs": [{"title": "So High", "album": "Star Power", "year": "2008-09-17", "lyrics": "Remember this shit right here?\nThis what we do. W-E-E-D\nI shouldn't have to tell you to roll up the blunts\nThey should already be lit. Bitch\n\n[Verse 1: Wiz Khalifa]\nNiggas always ask me why I get (So high)\nI tell them mind they fuckin' business\nI'm tryin' find a couple swishers and I'm (So high)\nI think I bought a box and don't remember\nThey watch singin' this boy (so high)\nYou see that smoke coming out the windows\nI keeps Urkel like the Winslows\nYou smell purple when the wind blows (It's fading away)\nDon't know how I wake up sober I go to sleep (So high)\nCan't even keep my eyes open\n'Member first time I tried smoking\nWiz (So high) damn near thought I was gon' die chokin'\nSmoke kush so that's prolly why I look (So high)\nEyes getting red, mouth all dry (it's fading, its fading)\nMy memory y'all (Is fading away)\nYeah\n\nSwag, I need you to call up if you know for a fid-act that you got the best weed in your motherfuckin' town or your section, Yeah.. Taylor Gang gon' be in your city or state and I need you to blow it down with your boy. It's Mr. EZ Wider with my man Wiz Khalifa, Mr. Blow it by the O, Swisher Sweets, no Phillies. C'mon\n\n[Verse 2: Wiz Khalifa]\nTook a trip out to cali and man I never been\n(So high) before or even after that\nMe and my niggas rollin' back to back until we get (So high)\nYeah, on the road\n30 blunts before a show, they like how did you perform (So high)\nI say this what I does\nYou can say I love my drugs\nMatter fact, roll another one girl, my buzz (Is fading away)\nI get everybody in this bitch (So high)\nBrought the chronic everybody get a spliff\nDon't smoke get a tiny little whiff and be feeling (So high)\nHaha, smokin' in my car\nDon't know how I could even drive my whip (So high)\nRoll another one when the first blunt's lit\nMy energy y'all (It's fading, fading, fading)\nIt's fading away (It's fading away)\n\n[Outro]\nYeah, you know, keep that cloud of smoke, man\nStay rollin' up them swishers, pullin' out that bag\nYeah", "image": "https://images.genius.com/100d0985ce3b8ee4e2364dd7c94351b4.500x500x1.jpg"}], "artist": "Wiz Khalifa"}