{"songs": [{"title": "True Crime", "album": null, "year": null, "lyrics": "[Intro]\nYeah… Yeuuh! I don’t know what you gonna do about this one man\nGilla\n(We ain’t going out like this mothafucker!)\n\n[Verse 1]\nA-yo, something going on I’m strapped\nI ain’t the one to be tiptoeing on and back\nMy getaway cars, so keep the motor warm relax\nI’m ‘bout to fade niggas like corduroys and slacks\nYou know the drama I bring, devil piranha, suicidal Nirvana\nBomb like I was born from Osama’s mama\nThe ocean liner rhymer, I keep it afloat\nMy no goes workplace see who’s sleeping the most\nNow I’m in NYC ready for a showdown\nWhile the wolf got my weight up, face got no frown\nI’m in a trench I see a punk getting close\nSo my right hand’s on my 357 straight from Oaktown\nMy bullets make ya hammer dance to the ambulance\nRock like the Duran Duran, Hanna Barbarian\nHot when I’m behind the pen, Doc’ll go man-to-man\nHoods raise up or feel shots like a cameraman\n\n[Hook] X2\nOHHH!! What the fuck is going on!?\nHow many motherfuckers on my back?\nHow many mo’fuckers I’m gon' have to clap?\nIt’s time to get up!\n\n[Verse 2]\nYo, I’m pouring ash through the city\nLike P. Diddy sent me for cheesecake\nYeah the cheese that come in a briefcase\nRedman, Gilla House sell weed on Ebay\nA man do what he want, a boy do what he says\nSo I’ll go get my gun, go and show my True Crime\nNever scared, I walk in a joint like ‘Do summin’!’\nI’ll move something, never stand around and wait for it\nAnything I cake on it, same way that Jay own it\nI’m tryna get back, hand on my click-clack\nSouthside to Northside, G.W. Bridge at\nShit getting ugly, I’m a Lion you a Kit-Kat\nBeating meeting me, yo your baby mamas wouldn’t risk that\nThink I’m laying down? NO! Zero on the ground flo'\nGot them in that black gun, bullets gotta now go\nOpen up your brown nose, smell the underground DOPE!\nRedman, True Crime, Gilla ensemble\n\n[Hook] X4\nOHHH!! What the fuck is going on!?\nHow many motherfuckers on my back?\nHow many mo’fucker I’m gon' have to clap?\nIt’s time to get up!\n\nIt’s time to get up, up, up!", "image": "https://images.genius.com/09bed7d894b68c251538868d4a34b7f8.1000x1000x1.jpg"}], "artist": "Redman"}