{"songs": [{"title": "SNOMED", "album": null, "year": "2017-03-21", "lyrics": "[Intro]\nAy, ay, ay, ay ay ay\nBITCH\nYa, okay\nBoot in the booth, boot in the booth, boot in the booth, I got boot in the uh\nBoot in the booth, Boot in the ya, ya, ya, ya, ya, ya, ya\nSHEESH\nWet flex sex in the flesh and my chain wet like sex\nBitch!\n\n[Hook: Ski Mask The Slump God and DIRTYFACESMOOK]\nYou niggas worried, lookin pussy, like the courage\nWit' that thirty, leave a pussy dirty, like I'm Curry\nStreet sweepin', got a broomstick on my thirty\nLittle bitch flirty, pussy purrin', like it's Gary\nYou niggas worried, lookin pussy, like the courage\nWit' that thirty, leave a pussy dirty, like I'm Curry\nStreet sweepin', got a broomstick on my thirty\nHis bitch flirty, pussy purrin', like it's Gary\n\n[Verse: Ski Mask the Slump God and DIRTYFACESMOOK/Both]\nBalmains with the wrinkles like a pug\nAnd I must be virgin cause I never gave a fuck\nSay I'm extension cord I got the best plug\nI'm feelin' like a father who her nigga gave mean mug\nI'm outer space I touched the moon bitch I done glo'd up\nI got the K don't be a fool you'll get sewed up\nGot Vintage Cartiers I'm seein' thru the bullshit\nThis movie rated X directors cut a full clip\nHopscotch jump that nigga like a skip\nPop Pop, how she twerk them pussylips\nCan you dig it, we got clips like a snippet\nTo make some noise, need some help, like a cricket\nThe roof feel like Jurrasic Park I'm gettin money now\nSki Mask keep a 30 'round, gun 'em down\nI got a very rare chopper in my skinny jeans\nDon't make me pop it bitch I'll cock it back and wet the scene\nAy, watch me pull up to the scene in the car from the movie Cars Lightning Mcqueen\nRed on my raf like a beam\nKick to your mouth now you out like some lean\nI be on some big mon ting\n\"I love gold!\" said my pinkyring\nStep through red bottom clean like a nigga musta crawled up, out, in a ‘merzine\nSmook, zoot, alley-oop the boot, in the booth\nAbercrombie your bitch, a moose\nDuck Duck Goose, in the cooch\nYou know I pits up a layer on my bitch in her hair\nCan you say very rare?\nAnd my wrist look so inviting just like it's a flare\nWiz weed, purple hair\nWhip that bitch, grip that bitch\nGettin' outa line, huh, pimpslap bitch\nWhip that bitch, grip that bitch\nKeep them baby's 'round me like a Cabbage Patch kid\nOk whip that bitch, whip that bitch\nOh\nThats the end?", "image": "https://images.genius.com/32aaec847d29530374c64b3f72f0e747.630x630x1.jpg"}], "artist": "Ski Mask the Slump God"}