{"songs": [{"title": "It’s Not Design", "album": "DROGAS Light", "year": "2017-02-10", "lyrics": "[Intro: Salim]\nOh no\nYeah, yeah, yeah, oh\n\n[Verse 1: Lupe Fiasco]\nWhat if I said, love was a lie though?\nIt was more like hate with a eye closed\nAnd the other eye, had the eye rolled\nThat's contempt and ignorance, I know\nBut what do I know?\nOnly thing that I seen was the inside, of a blindfold\nAnd you just as blind as me\nSo how I look? Askin' you where do I go\nEye and I keep high hope alive though\nThat love's not a lie it just likes to lie low\nLikes to hide right there in plain sight\nAnd you got to find it with your eyes, closed\nAnd in the dark, you see the part\nOf your partner that's the heart\nIf you die, it's like apartheid, we can bring it back to the, start\n\n[Hook: Salim]\nIt's not designed to make you feel that way now, baby (oh no)\nNo, it's not designed to make you feel love\nIt's not designed to make you feel that way now, baby (oh no)\nOh no, yeah\n\n[Verse 2: Lupe Fiasco]\nOn second thought, leave apartheid in the grave\nBut the heart part, that can be saved\nThe hard part's makin' sure it don't break\nInto little sharp pieces that are hard to replace\nHard to find spare arteries these days\nIn decent shape and know things'll decay\nAnd at these rates you're gon' need to be paid\nLike three-ty ways just to see D. Wade\nTo the place that sells these parts\nThat you couldn't keep safe from the stee-art\nSo why would we waste our art on your mistake\nWhen you was drivin' reckless? Didn't pump the brakes\nHate to have to shoot you down\nA fine runnin' heart makes a soothin' sound\nIt's junkyard love in your future, pal\nDidn't appreciate it then, bet you do, now\n\n[Hook: Salim]\nIt's not designed to make you feel that way now, baby (oh no)\nOn no no!\nIt's not designed to make you feel that way now, baby (oh no)\nOh oh oh, yeah, hey baby\nIt's not designed to make you feel that way now, baby (oh no)\nNoooo baby\nIt's not designed to make you feel that way now, baby (oh no)\nNever gonna make you feel, nooo, babe\n\n[Verse 3: Lupe Fiasco]\nAnd in the futuristic\nLove will be reduced to physics\nComputer digits made by robots\nThat use statistics, algorithms and group logistics\nThe mood-resistant\nDownloadable thing that's used specific\nEasily updated with few commitments\nCan find its way home if you forget it\nSay, maybe on a starship tour\nHeard a knock at your starship door\nIt was the girl that you had met at the starship bar\nHad a dance on the starship floor\nBut then you got starship sick\nSo you had to run to the starship store\nAnd then you got those starship pills\nBut when you back, she wasn't there no more\nShe says, \"Hope you got a starsuit at the starship store\nMaybe we can take a trip\nTo take a look at the stars around parsec 4\"\nAnd it was the most beautiful thing\nYou both had ever seen in your lives before\nAnd she pulled out her love\nSo you reached down in your starsuit for\nBut your pockets empty now the moments passed\nAnd it'll probably never happen like this again\nI guess it didn't work out for you in the, end\n\n[Hook: Salim]\nIt's not designed to make you feel that way now, baby (oh no)\nOn no no, yeah a-yeah\nIt's not designed to make you feel that way now, baby (oh no)\nNot designed! Not designed baby! Hoo, hoo baby\nIt's not designed to make you feel that way, now, baby (oh no)\nIt's not designed to make you feel that way, now, baby (oh no)\nNot designed! Not designed! No no no no no no no oh\n\n[Outro: Salim]\nOh oh\nNo no, baby\nHoo hoo, ahh, baby", "image": "https://images.genius.com/df21a5c133cedab6f30681d3578b81a2.1000x1000x1.jpg"}], "artist": "Lupe Fiasco"}