{"songs": [{"title": "MMM (Michael Myers Mask)", "album": "Strangeulation Vol. II", "year": "2015-09-15", "lyrics": "[Verse 1]\n(Enter the mind of Tech N9ne)\nLaurie Strode\nI got a gory soul\nSo the story goes\nShould I never kill another one or get a bit of lovin' in me or reload?\nReload, everybody lookin' at me like a hero\nWhen I kill a demon lesser than zero\nSee no evil within it\nI'm a killer and I'm bigger than Deebo\nHe knows, we go begin it\nDeep inside of me I'm dealin' with a trio\nLeave hoes below, you finished\nAbomination comin', I got that combination cracks\nAll that time you wastin' runnin' I got that bomb relation rap\nNow they're tryin' to make it back\nTo Tech N9ne and shakin' wack\nNow I'm dominatin', mom awakin' from a non forsaken nap\nHello mother, when you left I was no mellow brother\nI put on my red, killed 'em all dead and I did it with my fellow thuggers\nI tell no others, but I'm taking my hell so hovers\nWhen I gotta murder everything dead - I smother\nLike Othello's lover\nYou cannot tell me to stop it with doctor Loomis\nNothing would ever delay when I got your doom, it's\nThe Boogeyman I got to get your for real\nAnd nobody is saving me, not with appeal\nI'm a murderin' son of a bitch\nAnd I'm ill with impeccable skill and a purpose to kill\n\n[Hook]\nMy mental's made of Michael Myers' mask\nYou... lay lifeless, Lord don't like yo liars laugh\nWho... wanna see this sinful psycho sire spaz?\nPlease don't light yo lighters last\n'Cause this frightful fire's fast (uh-huh)\nMy mental's made of Michael Myers' mask\nYou... lay lifeless, Lord don't like yo liars laugh\nWho... wanna see this sinful psycho sire spaz?\nPlease don't light yo lighters last\n'Cause this frightful fire's fast (uh-huh)\n\n[Verse 2]\nNot too many motherfuckers out there I wish I hadn't killed\nDraggin' lil' rappers up Debra's Hill like Jack and Jill\nSlashin' 'til the back cracks attackin' with stabbin' steel\nHavin' chills when it happens after stashin' 'em in Haddonfield\nI got a demon in me, green with envy, seen the memory\nHow I get souls\nBring in Philly, things to get me\nNever that is why I got up out of Smith's Grove\nI'll eradicate a nigga with the feeling\nThat he better than a spitter with a bigger trigger\nStep up and try to get at me and be disposed\nI don't know why the great Malek Akkad not fuckin' with me\nWanted to use the theme for P.B. 3, they told me fuckin' fifty\nYeah it's worth it, yeah we got it\nBut not when Carpenter charged me five\nFor the first Psycho Bitch so I had to switch\nWhen I wanted to just keep it alive!\nGuess he didn't know I spill them bastards\nWho say another killer's better, I kill them slashers\nI peel them actors, I'm real grim faster\nOriginal mask motherfucker William Shatner\n\n[Hook]\nMy mental's made of Michael Myers' mask\nYou... lay lifeless, Lord don't like yo liars laugh\nWho... wanna see this sinful psycho sire spaz?\nPlease don't light yo lighters last\n'Cause this frightful fire's fast (uh-huh)\nMy mental's made of Michael Myers' mask\nYou... lay lifeless, Lord don't like yo liars laugh\nWho... wanna see this sinful psycho sire spaz?\nPlease don't light yo lighters last\n'Cause this frightful fire's fast (uh-huh)\n\n[Verse 3]\nThis killer jam knocks\nI'm here to kill everbody lyrically, specifically 'til her pants drop\nI'm iller than Shaq, thriller fans watch me\nMurder many men in Michael Myers mask not a Silver Shamrock\nCelebrate Samhain all year round\nNever let a fake man reign!\nI'ma bake damn brains with a weird sound\nGivin' hella aches and pain\nEminem is Jason, Krayzie Bone is leatherface and Bushwick Chuckie\nBut anything after double M were just replicas of me\nWho got you? Niggas need a new doctor\nStop the bleeding, who shot ya?\nIt was really a true chopper\nMike is who offed ya\nMainly because you caca\nStep and see who do block ya\nRest in peace to Moustapha\n\n[Hook]\nMy mental's made of Michael Myers' mask\nYou... lay lifeless, Lord don't like yo liars laugh\nWho... wanna see this sinful psycho sire spaz?\nPlease don't light yo lighters last\n'Cause this frightful fire's fast (uh-huh)\nMy mental's made of Michael Myers' mask\nYou... lay lifeless, Lord don't like yo liars laugh\nWho... wanna see this sinful psycho sire spaz?\nPlease don't light yo lighters last\n'Cause this frightful fire's fast (uh-huh)\n\n[Outro]\nMr. Sandman, nobody wants to see you\nMy Tony Moran stand", "image": "https://images.genius.com/d6abef8fbc863a78647f5e7bfd58bbe7.500x500x1.jpg"}], "artist": "Tech N9ne"}