{"songs": [{"title": "We Don’t Love Them Hoes", "album": "The Infamous Archives", "year": "2007-03-13", "lyrics": "[Movie dialogue]\nYou know Sometimes people can be awfully cruel\nIf you happen to care for somebody more than yourself\nThey consider you a fool\nThey mistake love for weakness and play on your mind\nAnd at your expense they amuse themself just to pass the time\n\n[Intro: Havoc]\nYea, uh-huh, we don't love them, we don't love 'em\nEh-huh, eh-huh, we don't love 'em, yea, yo\n\n[Verse One: Prodigy]\nUh-huh, yea\nMe and shorty in the back seat chiefin' on ganja leaf\nShe ain't inspired cheek cause her man is weak\nHe make it real easy for me to get her for free\nShe real use to the bullshit that he be speakin'\nShe's not use to - havin' that pussy ho beatin'\nThe bitch don't want to feel love, she want to feel sleazy\nBitch wanna have fun, yo ass is dough\nThat's why she ride with us to all the weekend shows\nWhen I have first met the ho, she was real timid\nShe ain't know if it was aiight for her to live it\nDAMN! look at her now, with many Pastel, Polo skirts\nYou see it all when she sit down\nShe keep it real easy for me to be in and out\nAll I gotta do is open 'em legs and bang it out\nWithout the struggle, or gettin' them panties off\nFuck her like I'm tryin' to kill her\nThen I tell her \"get lost\"\n\n[Hook: Havoc]\nLove them hoes, we don't love them (Nope)\nLove them hoes, we don't love them (Nope)\nLove them hoes, we don't love them (No)\nLove them hoes, we don't love them (Uh-huh)\nLove them hoes, we don't love them (No)\nLove them hoes, we don't love them (No)\nLove them hoes, we don't love them (No)\n\n[Interlude: Havoc]\nDamn! baby, how you call yourself a Pimp?\nLet, let me understand somethin'\nHow you gon' be a Pimp, and get Pimped\nThat shit don't make sense to me man\nYou lettin' them bitches all up on your pocket man\nYou should be ashamed of yourself\n\n[Verse Two: Havoc]\nSome think it's cool in the game and handcuff a bro', homey you wrong\nFuck you think she walk around with the matchin' pair of thongs\nTooth brush and the purse, the ho works\nShorty gained at your cribs, she at work\nMaster of the toe curl, shorty got it down to a science\nPlacin' body enough to start, damn right\nNigga like me just bang her out, and bangin' her friend\nSoon enough it'll be a family event\nKnow the hipno', havin' them bent, sneakin' up\nYou ain't the only one beatin' her up\nReal reason why she fucks with you cause you be lightin' her up\nTo her it's like paper trainin' to puff\nDo she suck you?, fuck you?, make you feel like a man?\nYou gettin' that good lovin' and bitin' your own hand\nYo you just another fool, hopeless, tryin' to lock her\nShe got your ass comin' out the pockets uh?\n\n[Outro: Havoc w/ conversation]\nAy Ma, how you doin'?\nStill, what you doin'?\nTrue, chillin', you know me up in the studio doin' my thing\nYea, yea, you need what?, what the fuck you talkin' about\nYou need some, you better ask your baby father for that shit\nYou crazy, damn baby\n\n[Hook: Havoc]\nLove them hoes, we don't love them\nLove them hoes, we don't love them\nLove them hoes, we don't love them\nLove them hoes, we don't love them (Uh-huh)\nLove them hoes, we don't love them\nLove them hoes, we don't love them\nLove them hoes, we don't love them", "image": "https://images.genius.com/cb51383ec91030d5e17e2b134d0e8477.1000x1000x1.jpg"}], "artist": "Mobb Deep"}