{"songs": [{"title": "A Song for Assata", "album": "Like Water for Chocolate", "year": "2000-03-28", "lyrics": "[Intro: Common]\nIn the Spirit of God\nIn the Spirit of the Ancestors\nIn the Spirit of the Black Panthers\nIn the Spirit of Assata Shakur\nWe make this movement towards freedom\nFor all those who have been oppressed, and all those in the struggle\nYeah. yo, check it-\n\n[Verse 1: Common]\nThere were lights and sirens, gunshots firing\nCover your eyes as I describe a scene so violent\nSeemed like a bad dream, she laid in a blood puddle\nBlood bubbled in her chest, cold air brushed against open flesh\nNo room to rest, pain consumed each breath\nShot twice with her hands up\nPolice questioned but shot before she answered\nOne Panther lost his life, the other ran for his\nScandalous the police were as they kicked and beat her\nComprehension she was beyond, trying to hold on\nTo life. She thought she'd live with no arm\nThat's what it felt like, got to the hospital, eyes held tight\nThey moved her room to room-she could tell by the light\nHandcuffed tight to the bed, through her skin it bit\nPut guns to her head, every word she got hit\n\"Who shot the trooper?\" they asked her\nPut mace in her eyes, threatened to blast her\nHer mind raced till things got still\nOpened her eyes, realized she's next to her best friend who got killed\nShe got chills, they told her: that's where she would be next\nHurt mixed wit anger, survival was a reflex\nThey lied and denied visits from her lawyer\nBut she was building as they tried to destroy her\nIf it wasn't for this German nurse they would've served her worse\nI read this sister's story, knew that it deserved a verse\nI wonder what would happen if that would've been me?\nAll of this just so we could be free\nSo dig it, y'all\n\n[Chorus: Cee-Lo]\nI'm thinking of Assata, yes\nListen to my love, Assata, yes\nYour power and pride is beautiful\nMay God bless your soul\n\n[Verse 2: Common]\nIt seemed like the middle of the night when the law awakened her\nWalkie-talkies crackling, I see them when they're taking her\nThough she kind of knew\nWhat made the ride peaceful was the trees and the sky was blue\nArrived to Middlesex Prison about 6 in the morning\nUneasy as they pushed her to the second floor in\nA cell, one cot, no window, facing hell\nPut in the basement of a prison with all males\nAnd the smell of misery, seatless toilets and centipedes\nShe'd exercise, paint, and begin to read\nTwo years in a hole, her soul grew weak\nAway from people so long she forgot how to speak\nShe discovered freedom is a unspoken sound\nAnd a wall is a wall and can be broken down\nFound peace in the Panthers she went on trial with\nOne of the brothers she had a child with\nThe foulness they would feed her, hoping she's lose her seed\nHeld tight, knowing the fight would live through this seed\nIn need of a doctor, from her stomach she'd bleed\nOut of this situation a girl was conceived\nSeparated from her, left to mother the Revolution\nAnd lactated to attack hate\nCause federal and state was built for a Black fate\nHer emptiness was filled with beatings and court dates\nThey fabricated cases, hoping one would stick\nAnd said she robbed places that didn't exist\nIn the midst of threats on her life and being caged with Aryan whites\nThrough dark halls of hate she carried the light\nI wonder what would happen if that would've been me\nAll of this just so we could be free\nYeah, I often wonder what would happen if that would've been me\nAll of this just so we could be free\nSo dig it, people\n\n[Chorus: Cee-Lo]\nI'm thinking of Assata, yes\nListen to my love, Assata, yes\nYour power and pride is beautiful\nMay God bless your soul\n\n[Verse 3: Common]\nYo, from North Carolina her grandmother would bring\nNews that she had had a dream\nHer dreams always meant what they needed them to mean\nWhat made them real was the action in between\nShe dreamt that Assata was free in their old house in Queens\nThe fact that they always came true was the thing\nAssata had been convicted of a murder she couldn't of done\nMedical evidence shown she couldn't have shot the gun\nIt's time for her to see the sun from the other side\nTime for her daughter to be by her mother's side\nTime for this beautiful woman to become soft again\nTime for her to breathe, and not be told how or when\nShe untangled the chains and escaped the pain\nHow she broke out of prison I could never explain\nAnd even to this day they try to get to her\nBut she's free with political asylum in Cuba\n\n[Chorus: Cee-Lo]\nI’m thinking of Assata, yeah\nListen to my love, Assata, yeah\nWe’re molded from the same mud, Assata\nWe share the same blood, Assata, yeah\nYour power and pride, so beautiful\nMay God bless your soul\nYour power and pride, so beautiful\nMay God bless your soul\n\n[Outro: Assata Shakur]\nFreedom? You're asking me about freedom? You're asking me about freedom? I'll be honest with you. I know a whole more about what freedom isn't than about what it is, because I've never been free. I can only share my vision with you of the future, about what freedom is\n\nThe way I see it, freedom is-- is the right to grow, is the right to\nBlossom. Freedom is-- is the right to be yourself, to be who you are, to be who you wanna be, to do what you wanna do--", "image": "https://images.genius.com/8dbc84c60c9d76fe49cdbcee56ef974c.1000x1000x1.jpg"}], "artist": "Common"}