{"songs": [{"title": "Dough Is What I Got", "album": "Lil Weezy Ana", "year": "2007-04-13", "lyrics": "[Intro]\nThis is a public service announcement\nLil Wayne, Weezy F. Baby, is the best rapper alive\nHit me\nGood morning, New York\nGood afternoon, New Orleans\nGood night, America\nYeah\n\n[Hook]\nDough is what I got, lil mama\nDough is what I got, pretty lady\nDough is what I got, shawty\nDough is what I got, baby\nC'mon, I'm paid, I'm paid\nI'm paid, I'm paid, hey!\n\n[Verse 1]\nGive a woman none, uh-uh\nI already gave my brother some, it's my sister turn\nAin't it funny how the fish do bird\nBut your boy just relax like a fresh new perm\nAs the world in the barrel of the pistol turn\nAnd we get it how we live, never lived and learned\nGotta talk about the flow 'cause you is concerned\nOnly down-south rapper could've been in The Firm\nOr The Commission or a Wu-Tang nigga\nTryna tell you I can kick it like Liu Kang, nigga\nGot that Sub-Zero flow, how you owe me mine\nNigga \"Get over here\" like Scorpion\nAnd when it comes down to this recording\nI must be Lebron James if he's Jordan\nNo, I won rings with my performance\nI'm more Kobe Bryant of an artist\nSame coach, same game, been starting\nSame Triangle Offense\nI come through the lane like a Dodge, and\nReferee niggas is lame, they call charging\nI have no brain, I'm retarded\nWe are not the same, I'm a Martian\nYou can be my Jane, I'm your Tarzan\nI'm from the jungle where the snakes is all poison\nI am magnificent like Marcus\nYou might wanna fall back like August\nOr late September, whatever you call it\nI hit niggas in the head like Vonage\nI am talking to no particular audience\nBut understand, I'm the guardian\nAnd understand there won't be no guarding him\nYou will just get played like an accordion\nI don't give a damn if she's bossy\nI keep pussy running like a faucet\nShe better catch like she Steve Largent\nBecause I'm \"What's up!?\" like Martin\n\n[Interlude]\nHahaha, woo! Yeah\nSee, I know y'all talking about me\nAnd you don't like what you hear sometimes\nBut umm, since I'm so bright\nI'mma put the spotlight on you baby\n\n[Hook]\nShow me what you 'bout, lil daddy\nI know you need to stop, stop hatin'\nI know what you not, whoadie\nAnd that is Weezy Baby\nBlunts up, now blaze, blaze, blaze, blaze\nWork it\n\n[Verse 2]\nTell the world \"Take six\"\nYoung Dictionary, make words make sense\nThen, I make cents make dollars\nMake the skinny girl holla, make the fat girl hungry\nMake the ugly girls want me, put the pretty girls on me\nMake the shy girls horny, make the fly girls corny\nAnd only for me, because of who I A-M, holla back in the morning\nHey! Now holla back if you own shit, the CEO of the moment\nBullshit – I don't condone it\nAw baby, just hop on it\n\n[Interlude]\nHaha, yeah\nYou like that... I know!\nMarley, what up? Hey! Hey! Hey!\n\n[Hook]\nShow me what you got, lil mama\nShow me what you got, pretty lady\nShow me what you got, shawty\nShow me what you got, baby\nYou rappers ain't safe, safe, safe, safe, ah!", "image": "https://images.genius.com/32e1b9a7e336b3f316f0f5de4d6c2815.300x300x1.jpg"}], "artist": "Lil Wayne"}