{"songs": [{"title": "That’s the Way the Game Goes", "album": "Brake Lights", "year": "2010-08-03", "lyrics": "[Chorus: Shawty Lo]\nThey just shootin' up BOLO\nGot a lock on the block, put the game in a chokehold\nWe gettin' money in the trap tonight\nWe gettin' money in the trap tonight\nStill trappin' in the same clothes\nUndercovers in them plain clothes, that's the way the game goes\nWe gettin' money in the trap tonight\nWe gettin' money, money\n\n[Verse 1: Game]\nYeeeaaaah, I'm trappin' like T.I\nIf I trap 'til I die, nigga, that's my B.I\nSame clothes as yesterday, so a nigga see why\nWe call ourselves trap stars and ride around in G rides\nBakin' soda, cookin' it, make sure them hoes watchin' it\nGlaze on the Audemar, so you know I'm glockin' it\nRockin' it, bag it up and then I'm to the block with it\nHit a few corners in the Chevy then I'm droppin' it\nYeah, I'm block dimin' it, my bird's real confident\nNever flip 'em where you lay your head, now that's common sense\nHit my connect, they already know what I'm comin' wit\nThat Phantom on them 24's, 50 round drummin' it\nRemember when I was slummin' it? Well, ain't much changed\nBlame it on my momma, she introduced me to cocaine\nNow my block propane, burnin' rubber on the tires\nNow Game, Shawty Lo will set the club on fire\n\n[Chorus: Shawty Lo]\nThey just shootin' up BOLO\nGot a lock on the block, put the game in a chokehold\nWe gettin' money in the trap tonight\nWe gettin' money in the trap tonight\nStill trappin' in the same clothes\nUndercovers in them plain clothes, that's the way the game goes\nWe gettin' money in the trap tonight\nWe gettin' money, money\n\n[Verse 2: Shawty Lo]\nTrap all night 'til the sun up\n'Til it's all gone then re-up\nBall, what's up? You know how we do\nFifty want five, oh he want two?\nIn the kitchen, you know the menu\nNo red meat, straight sea food\nThe fish scale you know it cook well\nT4L, you know we raise hell\nYeeaahh, got the game in a chokehold\nBricks on lock, got blow in stock\nI'm Big round my way, plus I work 2Pac\nDaaammnn, I meant to say two blocks\n\n[Chorus: Shawty Lo]\nThey just shootin' up BOLO\nGot a lock on the block, put the game in a chokehold\nWe gettin' money in the trap tonight\nWe gettin' money in the trap tonight\nStill trappin' in the same clothes\nUndercovers in them plain clothes, that's the way the game goes\nWe gettin' money in the trap tonight\nWe gettin' money, money\n\n[Verse 3: Game]\nI got purp by the pound, birds by the kilogram\nHow you meet the connect? Just walk around the middle man\nWhat if it's a problem? Gotta kill the middle man\nGet that Donald duct tape and throw his ass in the van\nNow what's a trapper? Me and Shawty Lo\n'Fore we was rappers, we was choppin' onions, Martha Stewart know\nLouis V apron keep the powder off my clothes\nAnd fiends don't need skis for the California snow\nI made California blow but I ain't never did California blow, keep a snow bunny\nEverybody know that I can get it fronted, no money\nEverybody know if I had it like Scarface, I'd get everybody blow\nI should rent a helicopter and fly over the town\nLook up, it's a bird, no, it's a cocaine cloud\nAnd I know a million connects that'll hold Game down\nAnd when I make it rain, my money make the rain sound\n\n[Chorus: Shawty Lo]\nThey just shootin' up BOLO\nGot a lock on the block, put the game in a chokehold\nWe gettin' money in the trap tonight\nWe gettin' money in the trap tonight\nStill trappin' in the same clothes\nUndercovers in them plain clothes, that's the way the game goes\nWe gettin' money in the trap tonight\nWe gettin' money, money", "image": "https://images.genius.com/6e47923e84d22040bd228aa550a666d4.800x800x1.png"}], "artist": "The Game"}