{"songs": [{"title": "Punch Drunk Love", "album": "Universal Mind Control", "year": "2008-12-09", "lyrics": "[Hook: Kanye West]\n'ey baby, am I crazy?\nOr was you givin me the eye?\nYou said maybe? (Yea) Well, you crazy\nBecause I know I'm too fly\nAlready know I'm too fly\nAlready know I'm too fly (You hype!)\nAlready know I'm too fly\nYeah, I know what you like\n\n[Verse 1: Common]\nRight now I'm off the wine, wine, we can take our time, time\nSo much I want to punch spill the bump when we grind\nMy uh is in ya body, my uh is in ya mind\nCheck my dictionary, that ass is so divine\nIt slippery when it's wet girl, I can read the signs\nI knock and I knock, uhh, can I come inside?\nI knock and I knock, girl, can I come inside?\nI feel like it's home when I'm in between ya thighs\nIt's the joy and the pain and the bites and the brain\nWhat make it feel so good, that type of stuff you can't explain\nI do, what I do, to do, to make it rain\nYou got the invite tonight and I'm so glad ya came\n'Cause you the type of dame to be game and yo\nMic check like the way I begin my show\nGirl I come from chica' so in I 'go\nTurn around, it's about to be a TKO\n\n[Hook]\n\n[Verse 2: Common]\nSome call me Com (Com), some call me the Red (Red)\nYou can call me daddy, I'mma put ya to bed\nAn appetite for seduction and it gotta be fed\nThis sexual eruption gotcha hittin ya head\nOn the board and, knock, you screamin, \"Oh Lord\"\nWe exchange like students cause I study a broad\nAnd listen to ya body and, low key party and\nI keep pushin and pushin, you pump the vol-i-ume up\nWe the type to make lovin we up\nWe take a ride down south cause you need to re-up\nGirl you call me Big Bank like I was savin it up\nI'm the doctor, I can hold it 'til patience is up\nAh, ah, ah-ah - I make, I make I make it hot baby\nAh, ah-ah - I know, I know, I know ya spot baby\nWhen we do it like we don't want it to end\nIt's three PM we gon' do it again\n\n[Hook]\n\n[Bridge: Pharrell]\nC'mon girl, let's go\nTo distant lands unknown\nWe can fly on air\nIf love is every where for you and me\n\n[Hook] + [Bridge]", "image": "https://images.genius.com/5e77fbc81fc58bc396f33872fc1ec855.1000x1000x1.jpg"}], "artist": "Common"}