{"songs": [{"title": "Spaze Out", "album": "Lupe Fiasco’s Food & Liquor (Advance/Pre-Release Leak)", "year": null, "lyrics": "[Lupe: Talking]\nThe uprising has begun\nThe revolution is here\nThe propaganda will be smashed\nYour establishment will be shaken to the core\nA new regime is being ushered in on the back of the people\nWe will not be held down any longer\nThis is a new day. Yeeaaa, spazz out\n\nFiasco\nFiasco\nFiasco [x3]\nFiasco\nFiasco\nFiasco [x3]\n\n[Verse 1]\nUh, Uh, Uh\nThe revolution is here, a evolution of years\nThe building of skills now my brilliance is clear. Chea!\nThe anointed one to point a gun that's been appointed by the slums\nTo make u get it, show u how to get it done\nGet a gun if u got it, tuck your chain, remove your watches\nBrush up on your slang and your knowledge\nJust acquaint yourself with making wealth, join a gang\nPick a system, take it hostage\nStuff your shoes, get a white tee, say hello to the impoveraged\nNot completely poor, but they are completely more\nIn the midst of getting missed and getting pissed and taking yours\nWhat u shaking for, you scared? Naw\nWell I'm just makin' sure\nNo cowards will not take this cause\n\n[Hook:]\nSpazz out (Oh, really now)\nSpazz out (Oh, really now)\nSpazz out (Oh, really now) [x3]\nSpazz out (Oh, really now)\nSpazz out (Oh, really now)\nSpazz out (Oh, really now) [x3]\n\n[Verse 2]\nNo problem we will take wit force\nWe properly will break em off\nGot em, lead em, freed em, teach em, rape em, make em, take em off\nLook homey run your chain\nNot the one that's on your neck\nBut the one that's on your brain\nThat they use to keep in check\nRebels that don't have a cause\nThe devil down here doesn't pause\nSo you gotta keep it moving\nSo the movement doesn't fall\nAnd this consist of white and black and all\nThat's tired of fronting, tired of jumping for the man\nEvery time he ask for something, NO\nDon't they think they got to drinking, smoking just to fit in\nWomen that think they gotta screw the owner just to fit in, NO\nThe overlooked and undercared, it's over look\nThe son is here, they unprepared, so we took them unawares\n\n[Hook]\n\n[Verse 3]\nGet ready, it's about to change\nThings might never be the same\nYou might never be the king coup! (Coup)\nAs long as they release the reigns\nIf you think that we are playing\nWatch us leave here with a bang BOOM!\nBe careful cause there's thinkers here\nMost the crooks are slingers here\nWho know the tricks and know the books\nAnd what took to bring us here\nNow, a coup is in effect, you serpents of the throne\nBring a bird for the next and a murder of the known\nThe propaganda's ugly, the truth is on its way\nThis is a lot felt, they just didn't know how to say\nThey mouth is here, the stakes is high, the doubt is here\nThe threat is real, they can't survive what we are about to do\n\n[Hook]\n\n[Lupe Talking:]\nPimp the system\nThings are never gonna be the same\nFNF full reign\n1st & 15th\nChea\nSpazz Out", "image": "https://images.genius.com/3eefa46f0c6e9d0def3a2d3c94939cad.1000x1000x1.jpg"}], "artist": "Lupe Fiasco"}