{"songs": [{"title": "2Nite", "album": null, "year": null, "lyrics": "[Hook: Jeremih]\nTonight, we're gonna get badder (Badder)\nYou're gonna get wetter (Wetter)\nWe're gonna take our time\nNot tomorrow, no, tonight, we'll love\n(Fucking like we in love, we be fucking like we in love)\n\n[Verse 1: Dr. Dre]\nYeah, she got that shit that make you kill a nigga\nCrack that last bottle, I'll kill it with you\nPour my feelings out and spill it with you\nThat's a no-no, but what he don't know\nNever hurt him, so just desert him\nI find it hard to believe that he ain't pullin' your weave\nNo, I'm kiddin', I'm knowin' my dick is different\nHe kept his distance, I kept comin' over and stayed persistent\nYou bitin' your lips, toes twitching and she crinching\nSteamin' up the bathroom 'til we left it a sauna\nI beat it up and now you usin' my tee as pajamas\nYour friends tried to warn you about me, even your mama\nBut you said you'd deal with the consequence, even if it was karma\nBut how can I complain when you give me insane brain?\nLike you graduated with honors, you probably hate that I'm honest\nBut, fuck it, I'm going all out\nYou should too, good things don't last forever, I thought you knew\n\n[Hook: Jeremih]\nTonight, we're gonna get badder (Badder)\nYou're gonna get wetter (Wetter)\nWe're gonna take our time\nNot tomorrow, no, tonight, we'll love\n(Fucking like we in love, we be fucking like we in love)\n\n[Bridge: Jeremih]\nNow don't you no worry about that\nWhatever you want, I'm on that\nSo don't hesitate, girl, when you lonely\nBaby, don't worry, we know that I got you\n\n[Verse 2: Kendrick Lamar]\nNow here we go again, from the bed to the floor again\nI hear your phone on vibrate and I know it's him\nBut that's what happens when that kitty's in the lion's den\nYou start lying and changing places\nYou might've been, I might've been too aggressive\nBut it was far from desperate\nI mean, the swag I got, just know it's half the effort\nThey tryin' to toot my horn\nBut, shit, I sworn that I swarmed up in it, stamped and fingerprint it\nLeft the coupe tinted when you played the passenger\nDon't be passing up 'til we finish\nWhat we started, you with it? I'm with it\nThen lay your seat way back like it was vintage\nWhile I hit the highway and slowly puff on this spinach\nCamouflage emotions got your feelings wide open\nI'm hoping you come to grips\nAt least before you provoke 'em to trip\nBut that's inevitable, and if I put you on a pedestal\nThat means I'm fuckin' you on a chair\n\n[Hook: Jeremih]\nTonight, we're gonna get badder (Badder)\nYou're gonna get wetter (Wetter)\nWe're gonna take our time\nNot tomorrow, no, tonight, we'll love\n(Fucking like we in love, we be fucking like we in love)\n\n[Bridge: Jeremih]\nNow don't you no worry about that\nWhatever you want, I'm on that\nSo don't hesitate, girl, when you lonely\nBaby, don't worry, we know that I got you\n\n[Verse 3: Jeremih]\nNow that I got you about they thinking out you\nI want to stop and I don't want you to stop that\nOw, we in a phase, oh, I can't wait\nCause waters don't label you, oh, no, no\nI'm from, came from the bottom, so just get on top of that\nHow about with the top back with your top back?\nTake that off, uh, ooh, ooh, break that off more, more\n\n[Hook: Jeremih]\nTonight, we're gonna get badder (Badder)\nYou're gonna get wetter (Wetter)\nWe're gonna take our time\nNot tomorrow, no, tonight, we'll love\n(Fucking like we in love, we be fucking like we in love)", "image": "https://images.genius.com/bf3badae49c33b583126057638078bd8.576x576x1.jpg"}], "artist": "Dr. Dre"}