{"songs": [{"title": "What’z Ya Phone #", "album": "All Eyez on Me", "year": "1996-02-13", "lyrics": "[Intro: 2Pac]\nWhat's your phone number?\n\n[Verse 1: 2Pac]\nNow, I could make miracles to tempos\nIt's instrumental, waitin' for the nymphos: that's the intro\nShook when you rush me, walked up and touched me\nWhy? Do you wanna fuck me?\nJust ‘cause I'm paid in the worst way? True\nLookin' kinda good in your birthday suit\nI wonder if you're wild and you act shy\nDo you like to be on top or the back side?\nWatch me while you lick your lips\nShake your hips, goddamn, I love that shit\nYo, let's stop fakin', be real now\nI got a room and a hard-on – still down?\nMet you standin' at a bar full of black dudes\nSaid you wanna see my scars and my tattoos\nWhen we head for my hideout, act right\nBoss player when I ride out, that's right\nWhat's ya phone number?\n\n[Chorus: 2Pac & Danny Boy]\nIf you really wanna fuck with me, I'm ready\nBaby, let me give you a call\nHow long will it take to break you off?\nIf you really wanna fuck with me, I'm ready\nBaby, let me give you a call\nHow long will it take to break you off?\n\n[Verse 2]\nOh, shit, baby is a dime piece, more than just fine\nShe's personally blessed from the gods\nIf I seen her right now, she could get me hard\nDidn't wanna talk to me just to see my car\nNever had sex with a rich rap star\n'Til I got her in the back of my homeboy's car\nTell me, why do we live this way?\nMoney over bitches, let me hear you say\nWhat's your phone number? Are you alone?\nGot a pocket full of rubbers, let's bone\nTime for your girlfriend to take you home\nI had fun, but baby, gotta leave me alone\nPicture in my rhyme, take time to rewind these words I say\nIf you open your mind, bet in a minute you'll find\nIt's time, let the Outlawz play\nWhat's ya phone number?\n\n[Chorus: 2Pac & Danny Boy]\nIf you really wanna fuck with me, I'm ready\n(What's ya phone number?)\nBaby, let me give you a call\nHow long will it take to break you off?\n(What's ya phone number?)\nIf you really wanna fuck with me, I'm ready\n(What's ya phone number?)\nBaby, let me give you a call\nHow long will it take to break you off?\n\n[Skit: 2Pac & Girl]\nHello?\nHello? Who is this?\nIs this 2Pac?\nThis is who?\nIs this 2Pac?\nYeah, it's 2Pac, who dis?\nHi, baby, how are you?\nI'm aight. What's up, baby?\nYou don't recognize the voice?\nYou recognize my voice, huh?\nDo you recognize my voice?\nNah, I know you?\nYeah, you know me\nI guess you don't recognize me when I'm talking\nWhere I know you from? Where I know you from?\nYou just know me, baby\nWhere? Talk up, I can't barely hear you\nYou know me from when we were, you know, intimate\nOh, we... oh, we fucked?\nOh, baby, did we ever\nOh, tell me about it, baby\nI remember when I put that big dick in my hand\nAnd stroked it up and down\nOoooh!\nThen I put it in my mouth\nYou did?\nI sucked it\nOoh, you did?\nOoh, I did\nShit!\nSucked it and fucked it; put me in, you came\nDid I come?\nOoh, baby; everywhere, everywhere\nYou don't remember me yet?\nI'm starting to get a picture, why don't you help me out?\nWhat did I do to the pussy, baby? What a nigga do to the pussy?\nYou rocked it\nDid I?\nYeah, you did\nDid I give you some of that Thug Passion?\nMmmm...\nHehehe... ayy, so what you doing right now, though?\nMe and my finger are gettin' acquainted\nHow many you got?\nI got ten, but only one is workin'\nAh, well, can I come over there?\nIf you want to\nDo I want to?\nDo a bear shit in the woods and wipe his ass with a rabbit?\nMmmm, you gonna rock it, baby?\nHell yeah, I'm gonna rock it, baby\nLike you did before?\nNo dizoubt. You gonna feel that Thug Passion for real\nMmmm, baby\nI'm on my way though; I'm about to fly over there in a 500\nIt ain't gonna take but a minute\nHey, light the candles\nGet the baby oil out and turn all the lights out\nDrink a little bit of that shit\nI'm on my way, baby, I'm gonna knock that pussy into next week\nKnock it out, baby, knock it out\nI'm finna knock the taste out your mouth, girl\nI'm gonna put your legs on your head\nI'ma tie you up, blindfold you\nAnd we gon' play which hole feel the best, hahaha\nYou know which hole feel the best\nYeah, we finna see tonight, though\nI'm gonna make you remember me\nOh, yeah?\nYeah\nOh yeah, you got my dick hard\nI mean, I can't, I can't find the steering shift\nYou got me so fucked up; I'm playing with myself and shit\nBaby, can I shift your gear?\nYeah, you can shift all that shit baby, for real\nCan I shift it from the back?\nHahaha, do a bear shit in the woods\nAnd wipe his ass with a fucking white rabbit?\nCan I shift it in the front?\nHell yeah... ayy, you know what I wanna do though?\nWhat you wanna do?\nI wanna fuck you on the balcony\nWhile you lookin' out over LA, ya know what I mean?\nJust poundin' that shit from the back\n'Cause a motherfucker hop that shit\nLike I got hydraulics fixed in me, you feel me?\nI be hittin' switches, baby\nOoh, I feel you, yes\nHehehe... hey, I'm finna come over there\nJust wait for me, sweetheart, I'm on my way right now\nI'll see you later, baby, bye\nBye, boo\nHaha, yeah, I'm finna get some pussy, nigga\nHeh, get some pussy, hahahaha\nWhat's ya phone number?", "image": "https://images.genius.com/f0e663efef180da9b5d259005a1919e3.589x589x1.jpg"}], "artist": "2Pac"}