{"songs": [{"title": "Mrs. Pitts", "album": "Return of the Dozen Vol. 1", "year": null, "lyrics": "[DJ Young Mase]\nRip Big P Forever\nRip JD\nThe Dozens\n\n[Hook: King Gordy]\nI thought we'd see forever you and I (Oh I thought we'd see forever)\nYou was my home boy I was your guy (You were my best friend)\nNow when I rhyme I look at the sky\nMrs. Pitts I'm sorry (Ooh I'm so sorry, ooh I'm so sorry)\nSee he was an inspiration to me (You were my only inspiration)\nYou were supposed to make it with me (You were supposed to be there)\nLord I don't know what to say but plead\nMrs. Pitts I'm sorry\n\n[Verse 1: Bizarre]\nKarnail Pitts will never never die\nAs long as I'm breathing and my groups still alive\nAnd I can't lie I miss my nigga\nEvery time I see Belle Isle and Detroit River\nMrs. Pitts you done lost two sons\nProof dying that's like the 3rd one\nAnd I wanna thank you for showing up to my court cases\nStanding in front of the judge three years I'm facing\nTold me to be proud and dry my tears\nBe a grown man and show no fear\nWe all love driving, reminiscing about how me you and Proof used to go fishing\nI wanna give you a call but I don't know what to say\nThat's why I get on my knees every night and I start to pray\nDrive down 6 Mile I circle your block\nPark in front of your house but I'm scared to knock\nI miss you (Carolynn)\n\n[Hook]\n\n[Verse 2: Swift]\nNow every Saturday after shop\nYou gave me props I gave you props too\nRespected each other and as time grew\nHe always took the time to ride thru\nAnd ask me if I had a verse ready to rock at St. Andrews\nAnd as for you I'm sorry we never took the time to see you\nWhen we got signed we came up to your job\nNow that was a long time ago\nI thought I'd let you know that you was on my mind\nThrough this rhyme I apologize\n\n[Verse 3: Kuniva]\nAs time goes on and the pain starts to easy up\nJust know your son's memory will never leave us\nAnd you can call on us if you ever need us\nCause life's road is full of hard knocks and speed bumps\nYou so strong and I wish you the best\nI wish you more stress so you can pass life's test\nIf you feel like you drowning we'll be your life vest\nI had to get it off of my chest\nMrs. Pitts I'm sorry\n\n[Hook]\n\nOh I'm so sorry Oh I'm so sorry\n\n[Talking: Bizarre]\nWe miss you\nCarolynn Pitts you lost three sons\nBut you got four more still alive and breathin\nAnd there for you\nWhat up Moe\nRip Suge\n5150\nYea\nMrs. Pitts we love you\nD12 4 life\nYeah", "image": "https://images.genius.com/ee35f41ed149c86d6fe47f68d55c39e1.450x450x1.gif"}], "artist": "D12"}