{"songs": [{"title": "Self-Titled", "album": "Prince of the City: Welcome to Pistolvania", "year": null, "lyrics": "[Intro]\nYou know how we do! Yeah This is what I do young. From my side of the city the dip side\nLet's Ride. Yes Sir All my gangsters grab your weapons, punks hit the door. Let's get it\nLet's get it yeah uhh\n\n[Verse 1]\nI ain't nothin nice\nLine em up buckem twice\nLay em' down middle fingers up screamin fuck your life\nI roll them 7′s out go head and tuck your dice\nCrack your skull never seemed sicker in your fuckin life\nSee I don't hustle white\nScrawny but my knuckles right\nLeft hand will leave them shook hooks not the stuff you write\nAnd when your hands ashy only time you've touched the white\nSnatch your grind now it my grind you couldn't hustle right\nSee I'm a hungry dude feelin the pain\nRibs touchin got the thrill in my vains\nAnd you niggas is all in the sunshinen but we still in the rain\nAnd for the team leave you spillin your brains\nCause I ain't feelin you lames\nNow clowns should be feelin ashamed\nSo put the heat to your temple and bang\nMe and my soldiers in that that black on black we killin the game\nYou dudes pumped put a chill in your frame\nLet's go man!\n\n[Hook x2]\nYou should print my information, quote my rhymes\nTop 5 dead or alive\nYo! Brothers respect mine\nThe kid that they yapping about they won't stop\nYou know who rule this shit\nThe city is mine\n\n[Verse 2]\nReady willing and able, and I've been keeping it stable\nHave a leg on the table, since the killing of Abel\nBullets rip through your facial, yeah will give you a face full\nI'm into making it painful on demand like your cable\nSee you dudes is some divas, leave us we move with the heaters\nBeef and we shoot through your beaters we turn you dudes to believers\nYeah I'm rocking and ready blown I'm cockin em steady\nPopping em [?] I'm heavy dropping the top on the chevy\nLet em bang through the smith and your brain will be missing\nChanging the game it was written changing the lanes when I'm whipping\nIt's only natural you hate me cause I'm hot\nCause I get love in the streets and I ain't never played the block\nYou see I do me and you can't never play me cause you not\nThe flow is Ludacris, coming for that number one spot\nSo get outta line and get smacked in\nI move with the movers\nYou lose with the losers they smooth when executing manuevers\n\n[Hook]\nYou should print my information, quote my rhymes\nTop 5 dead or alive\nYo! Brothers respect mine\nThe kid that they yapping about they won't stop\nYou know who rule this shit\nThe city is mine", "image": "https://images.genius.com/22079eaff0395f48f7e1891ca05897a0.1000x1000x1.jpg"}], "artist": "Wiz Khalifa"}