{"songs": [{"title": "To Live And Die in L.A.", "album": "The Don Killuminati: The 7 Day Theory", "year": "1996-09-26", "lyrics": "[Intro]\n“Street Science, you’re on the air. What do you feel when you hear a record like 2Pac’s new one?”\n“I love 2Pac’s new record.”\n“Right, but don’t you feel like that creates tension between East and West? I mean, he’s talking about killing people, ‘I had sex with your wife’ — and not in those words. But he’s talking about, ‘I wanna see you deceased’…\"\n\n[Intro: 2Pac]\nNo Doubt\nTo live and die in L.A., California\nWhat you say about Los Angeles?\nStill the only place for me\nIt never rains in Southern California\n\n[Verse 1: 2Pac]\nTo live and die in L.A\nWhere everyday we try to fatten our pockets\nUs niggas hustle for the cash, so it's hard to knock it\nEverybody got they own thing, currency chasin'\nWorldwide through the hard times, worrying faces\nShed tears as we bury niggas close to heart\nWho was a friend, now a ghost in the dark\nCold-hearted 'bout it, nigga got smoked by a fiend\nTryin' to floss on him, blind to a broken man's dream\nA hard lesson, court cases keep me guessin'\nPlea bargain ain't an option now, so I'm stressin'\nCost me more to be free than a life in the pen\nMakin' money off of cuss words, writin' again\nLearn how to think ahead, so I fight with my pen\nLate night down sunset, likin' the scene\nWhat's the worst they can do to a nigga?\nGot me lost in Hell, to live and die in L.A. on bail\n\n[Chorus: Val Young & 2Pac]\nMy angel sing\nTo live and die in L.A., it's the place to be\nAnd the angels go\nYou've got to be there to know it\nWhen everybody wanna see\nTo live and die in L.A\nTo live and die in L.A., it's the place to be\nYou've got to be there to know it\nWhen everybody wanna see\n\n[Verse 2: 2Pac]\nIt's the city of angels and constant danger\nSouth Central L.A. can't get no stranger\nFull of drama like a soap opera, on the curb\nWatchin' the ghetto bird helicopters, I observe\nSo many niggas gettin' three strikes, tossed in jail\nI swear, the pen right across from hell\nI can't cry, ‘cause it's on now\nI'm just a nigga on his own now\nLivin' life thug style, so I can't smile\nWriting to my peoples when they ask for pictures\nThinkin' Cali just fun and bitches\nBetter learn about the dress code, B's and C's\nAll them other niggas copycats, these is G's\nI love Cali like I love women\n‘Cause every nigga in L.A. got a little bit of thug in him\nWe might fight amongst each other\nBut I promise you this: we'll burn this bitch down\nGet us pissed, to live and die in L.A\n\n[Chorus: Val Young & 2Pac]\nTo live and die in L.A., it's the place to be\nLet my angels sing\nYou've got to be there to know it\nWhen everybody wanna see\nAnd my angels go\nTo live and die in L.A., it's the place to be\nTo live and die in L.A\nYou've got to be there to know it\nWhen everybody wanna see\n\n[Verse 3: 2Pac]\nIt wouldn't be L.A. without Mexicans\nBlack love, brown pride, and the sets again\nPete Wilson tryin' to see us all broke\nI'm on some bullshit out for everything they owe\nRemember KDAY? Weekends, Crenshaw, MLK?\nAutomatics rang free, niggas lost they way\nGang signs being shown, nigga, love your hood\nBut recognize and it's all good\nWhere the weed at? Niggas gettin' shermed out\nSnoop Dogg in this mothafucka burned out\nM.O.B., Big Suge in the Lo-Lo, bounce and turn\nDogg Pound in the Lex with a ounce to burn\nGot them Watts niggas with me, O.F.T.B\nThey got some hash, took the stash, left the rest for me\nNeckbone, Tray, Heron, Buntry too\nBig Rock got knocked, but this one's for you\nI hit the studio and drop a jewel, hopin' it pay\nGettin' high, watchin' time fly; to live and die in L.A\n\n[Chorus: Val Young & 2Pac]\nTo live and die in L.A., it's the place to be\nLet my angel sing\nYou've got to be there to know it\nWhen everybody wanna see\nAnd my angels go\nTo live and die in L.A., it's the place to be\nTo live and die in L.A\nYou've got to be there to know it\nWhen everybody wanna see\nLet my angel sing\n\n[Outro: 2Pac]\nThis go out for 92.3 and 106\nAll the radio stations that be bumpin' my shit\nMakin' my shit sells quatruple quitraple platinum\n(To live and die in L.A., mhmmm)\nThis go out to all the magazines that support a nigga\nAll the real motherfuckers\n(To live and die in L.A., mhmmm)\nAll the stores, the mom and pop spots\nA&R people, all y'all mothafuckers\n(To live and die in L.A., mhmmm)\nL.A., \"California Love\" part mothafuckin' two\nWithout gay ass Dre\n(To live and die in L.A., mhmmm)\n(To live and die in L.A., mhmmm)", "image": "https://images.genius.com/2b8d1860db20385b8f73b10bec2ad841.555x555x1.jpg"}], "artist": "2Pac"}