{"songs": [{"title": "Maxine", "album": "Bulletproof Wallets", "year": "2001-11-13", "lyrics": "[Intro: Raekwon]\nYou got your hands on Mooney shit?\nSay word\nWe gon' get high!\nI don't give a fuck about that nigga\nHe a bird anyway\nWe be taking his packages...\nHe a snitch too!\n\n[Verse 1: Ghostface Killah]\nAyo\nIn Pam's house there was money missing\nShe was too dumb, had her nose numb, sniffin' blow in the kitchen\nHer kids never ate, BCW's involved with her\nKids that she never seen, shipped two to Florida\nMaxine, dark skinneded, bald headed bitch, mean\nPam's right hand, together they're the coldest fiends\nAww shit, guess who arrived at the door\nIt's Mooney the supplier, \"Shh, don't open the door!\"\n\"Bitch, open the door!\" \"Maxine, he gon' kill me!\"\n\"Chill, I got a friend cop.\" \"Girl, you don't know his beef!\"\nThree long kicks the hinges flew off\nKids screaming, the heavy face slap blew Maxine head off\nIt's on in the crib, \"You wrong for what you did\nYou gon' pay Pam, fuck that boo, kiss your kids\nY'all get the fuck in the room.\"\"Fuck you, you ain't our real Daddy!\"\n\"Next time you see my Caddy, don't fucking flag me\"\nThis is where he fucks, up at peep his movements\nMaxine's in the kitchen crying, grits is boiling, on the side\nShe had a cup of lye, somebody gotta die\n\"Uh huh, y'all bitches fucked up, smoked out my packages\n\n[Verse 2: Raekwon]\nY'all had Mackie's shit and Pappy's shit\nWord to Aunt May I want mine\"\nPulled out the nine, get in the tub\nHe seen the hot iron pulled the plug out\nHe steamed Pam brought it back to Penny on Good Times\nBack in the dollar bill he sniffed like six lines\nHe put his Gat down, why he do that?\nCreeping through the crib is Maxine, pot holder down with the grits\nPam sucking his dick, Maxine Al Greened him\nScreaming, slipped in piss, he ran in the seed's room\nGrits down cryin' aight with his balls out\nHe stepped on Clarence, Biggie Smalls album\n\"Boobie get that nigga!\" Pam yelling, \"Rip that nigga!\"\nMookie went and got the dye out the kitchen\nJames jumped on Moon, poked him with a screw driver\nBroke the TV, niggas watching Knight Rider!\n\n[Ghostface Killah]\nThis is Pam Jerkins mother house\nThe same shit go on in her brother house\nYou know Mooney's only a buck oh five wet\nHe only had two hundred dollars worth of shit\nAnd the kids tore his ass up!\n\n[Verse 3: Ghostface Killah]\nThe seeds had a huddle up, I felt sorry for him\nThe funny shit when bowlegged Keke hopped on him\nJumped on him, pigeon toed Mookie poured lye on him\nYou should've seen this motherfucker's face frying\nHalf dying, they stuck a fork through his nuts\nThe little girl was happy, she picked her brother up\n\"Quick, pick the window up,\" Mooney overheard\nRight before they threw him out, the nigga said \"Word?!?\"\n\nOn the count of three\nHe landed right in front of the first floor balcony\nBlood, brains is splattered\nHe was dead\nAnd the cops never came\nThat's Stapleton\n\n[Outro: Ghostface Killah]\nAll, all, all in together now\nWe getting fresh getting right for the weather now\nAnd if we fall in the game, yo that's never now\nCome to my projects and we'll air you out", "image": "https://images.genius.com/f4093661813b3ac25f7c044e4b1e305d.899x899x1.jpg"}], "artist": "Ghostface Killah"}