{"songs": [{"title": "Strangeulation Vol. II Cypher I", "album": "Strangeulation Vol. II", "year": "2015-11-20", "lyrics": "[Produced by Seven]\n\n[Intro]\nSmoking weed\nTrue indeed\nSick emcees, presented by\nTecca Neez! Check it out\n\n[Verse]\nAin't nobody busting, like the nigga with a gun up, in the middle of the west\nI be the killa with a TEC and I'm a villain with a vest, I gotta fill 'em with effects, then I get it out the way\nSo I can say, what I wanna say\nRight over the track singing, like the father of Nona Gaye\nLet's get it on, they love it when Tech spit a song way rugged\nAnd check niggas on they grudges, then death shitted on they buzzes\nThat was just the intros, for the family with sin souls\nBut the Gandys with the fem flows, can't stand me, like ten toes\nI rock it, making my female fans freaking faucets\nPut me up against Hop is thoughtless, not supposed to press partners, stop it\nCan't compete compare crotches, cockless, taking Tech is too toxic, toss it!\nNever will the bosses take losses\nStudy cautiousness off this shit!\n'Cause some fans are antagonistic\nNaggin' bitches, raggin' like a stabbin' happened, when I'm havin' hits\nGet massive sick shit, like I ain't Vlad and vicious, bad and twisted\nKeep it jabbing fisted, Trav insisted\nSo I frown scarier, when the clown buries a nigga down to the ground, but the crown carrier\nGet the hound out the mound, and they’re bound, marry 'em all together, is how we breaking the sound barrier\nI'm three-dimensional, we invincible, you saying I'm over, you never see the principle\nMy seed is meant to grow rapid, I'm the classical rap shit on acid!\nBastards! (Hurl bars) Never will niggas be able to gimme the trash it\nJack it! (World star) How in the fuck am I ripping, and reaching the masses?\nAsses, faggots, too many back splashes\nThen a wack black chat hatches, 'cause you napped at rap classes\nThey making a mockery of my painted face\nBut me I resemble our ancestors\nAnd these niggas talking stuck, at a fainted pace\nStill not realizing, this man blessed ya\nI am so clever, my friends adore me they banging Yates\nYour rhyme is no measure to him, you bore me, gay flaming fakes\nFind him more cheddar, my end's for me stay gaining great\n'Cause I am forever like Em, 40, Jay, Wayne and Drake\nPure art, I'm the shit and nigga, you're farts\nHow they gonna challenge the Tecca N9na, when your flow's softer, than a Velour scarf?\nBlowing this track into pieces, I'm leaving you fewer parts\nAt this moment, I am laying as dead, as before my 2.0 tour starts\nAin't packed shit yet, this how your taint rap hits best\nTecca N9na ain't plastic, my bank's drastic, you can't match his checks\nLot of gore in the flow, and I’m born to go, got your whore in the door\nTaking your chick, 'cause a nigga been up on the Forbes list, now four in a row\nMy religion is followed by little kids\nCollege kids, metalheads, hip hop heads, the rips and soo-woos\nYour religion is tainted by money grubbing\nFunny hugging, chummy loving grown men, that like to do youths\nSo I stick with my technicians\nNo F's given, yeah, this team is a mixture of a few groups\nThis for my fans, nigga, fuck everybody else\nIf you loving this Tech N9ne, give me three aooh's, and two whoops", "image": "https://images.genius.com/d6abef8fbc863a78647f5e7bfd58bbe7.500x500x1.jpg"}], "artist": "Tech N9ne"}