{"songs": [{"title": "N9NA", "album": "N9NA", "year": "2018-11-02", "lyrics": "[Intro]\nAyy, ayy, ayy, ayy, ayy, ayy, ayy, ayy, ayy\nOh, welcome to the mothafuckin' show\nI go by the name of\n\n[Chorus]\nT-E-C-H-N-9-N-E\nT-E-C-H-N-9-N-E\nYeah\nT-E-C-H-N-9-N-E\nT-E-C-H-N-9-N-E\nFor short, you can call me N9na!\nT-E-C-H-N-9-N-E\nT-E-C-H-N-9-N-E\nFor short, you can call me N9na!\nT-E-C-H-N-9-N-E\nT-E-C-H-N-9-N-E\nYeah\n\n[Verse 1]\nI been a killer in the game\nWhen I first put the pen to the pad like your first day out\nN9ne be a thriller with the thang\nWhen I spurt, suck 'em in with the gab in the verse they shout\nLike when all the people at the church play Crouch\nWhen you're pornographic and the Kirk spray out\nOn a workday couch and divert they spouse at the house\nMy residue on her birthday blouse\nWhat I hear out here is not stunnin'\nSound like y'all disregarded what Biggie and Pac brung in\nBut me, I been rippin' shows, havin' the thots summoned\nWhen I took my dick out of the equation\nYo, they stopped comin'\n'Bout to flow tonight\nAm I gonna be spittin' wickedness? Sho' ya right\nVulgar like Dolemite, not runnin' fo' the light\nPoltergeist, roll the dice\nYou're gonna find I'm the business when I hold the mic\nKnow the fright\nN9cian out-rap you chickens, Qdoba like\nVive la Tech, N9na the vet\nEveryone knowin' that he so ballsy\nDiva ya get, eager to let\nAll of us hit because we so saucy\nDeeper the press, the weaker ya set\nThey cannot fathom how we so Maude Khalifah the best\nPeak of the nest\nThat is the reason why people call me\n\n[Chorus]\nT-E-C-H-N-9-N-E\nT-E-C-H-N-9-N-E\nYeah\nT-E-C-H-N-9-N-E\nT-E-C-H-N-9-N-E\nFor short, you can call me N9na!\nT-E-C-H-N-9-N-E\nT-E-C-H-N-9-N-E\nFor short, you can call me N9na!\nT-E-C-H-N-9-N-E\nT-E-C-H-N-9-N-E\nYeah\n\n[Verse 2]\nAin't no way you get around it\nThere's no takin' away my seat\nI'm chosen, right hand on my crotch\nIt'll let you know ain't nothin' weak I'm holdin'\nSnakes and the bats around my neck\nThey be like my flows, I keep 'em frozen\nChoppin' away you wack ass rappers\nN9na be leaving 'em decomposin'\nI can demolish all of 'em, that's my sales pitch\nOne monkey done stopped the show\nI'm from the Zou, I can smell shit\nThey wanna get violent\n'Cause their ladies really want my male stick\nBut I never cooperate with a thot to mate so you fail, bitch\nSuperhero to boost the ego\nI eat up any rapper like I do chorizo\nI'm takin' what I got and give it to the Migos\nTo woo the people, get through to Ebro\nSuperpowers, I'm possessin' it\nTech is if nothin' written on my check is a deficit\nDumping diction down a dungeon's a definite\nRock the red on my red and I'm reppin' it\nGot a problem with it, blood, there is the bait\nWe soldiers living in this country and well aware of your hate\nThis country from the jump ain't nothin' but terror mistake\nSo I think that hat would've been a good thing if it said\nMake America Great, my name is\n\n[Chorus]\nT-E-C-H-N-9-N-E\nT-E-C-H-N-9-N-E\nYeah\nT-E-C-H-N-9-N-E\nT-E-C-H-N-9-N-E\nFor short, you can call me N9na!\nT-E-C-H-N-9-N-E\nT-E-C-H-N-9-N-E\nFor short, you can call me N9na!\nT-E-C-H-N-9-N-E\nT-E-C-H-N-9-N-E\nYeah\n\n[Outro]\nYeah, N9na, you tell 'em, you sell 'em\nReal shit, ill spit, meal ticks, to deal with, let's go\nAyy, oh, ayy, oh, ayy, oh, ayy, oh\nWelcome to the motherfuckin' show", "image": "https://images.genius.com/1967a0242f0a3a45659744f3cd09da56.500x500x1.jpg"}], "artist": "Tech N9ne"}