{"songs": [{"title": "Kill Zone (Freestyle)", "album": "Return of the Dozen Vol. 2", "year": "2011-04-12", "lyrics": "[Intro: DJ Young Mase]\nYeah, D12 is back in the building\n'Bout to hit y'all with some freestyle shit\nMerry Christmas motherfuckers, 2011\nGet 'em, get 'em, yeah\n\n[Verse 1: Kuniva]\nHey yo, I'm gone off that henny low cleaved and he smoked\nTill he's soaked and covered in blood and without a penny broke\nI never was a mathematician, the class division bored me\nI was snoring, dreamt of being a graphic villain\nAnd caps we peeling, re-mash admission\nLeave your face looking like a fatal crash collision\nBlast the 5th and, dip out or throw you in the trunk\nAnd like an old white lady's butt your ass is missing (nigga!)\nYou can compare me to Rick Ross in some ways (Boss!)\nCause whenever you see the Boss you're going to see Gun Play\nPut the torch in your face and Daffy Duck your grill up\nThis ain’t Call of Duty, grab the uzi, get your kills up\nNiggas be rolling, plus they claim they're sitting on grams\nBut they never tell you their fucking Grams are Golden\nI'm so serial, I’ll let the cannon Bussa Bus\nIn any Scenario, bitch, what the dealio?\nI could take the hardest sack and turn it to a kiddy show\nIf I find you fucked like hide and go giddy yo\nI am so vivid, let the bullets play hide and go get it\nWhen I am pissed off, I am so livid\nAnd niggas can’t fuck with us, new niggas or old ones\nFill your homies with hot hollows and grab a cold one\nWho next flexing? I lift my two hands up\nA tech in each one, and you can forward this text message\n\n[Verse 2: Bizarre]\nYall know Bizarre's going to say some crazy shit (Yall know!)\nShade45 gon' play this shit, I'm amazing, BITCH!\nI'm the best rapper ever\nGet on stage in spandex and a tight ass leather (Damn!)\nLace weed, cocaine joints\nStop looking for Bin Laden, Bin Laden stay in Detroit\nBrain froze, can’t feel my toes\nAll I need is an eight ball, and a picture of Amber Rose (Kanye!)\n20 thousand, Delonte West can fuck my mother\n50 thousand, he can sodomize my brother (Sorry bro)\nElton John said he's a celibic fag (what's a celibic fag?)\nA fag that don’t like dick in his ass (wow)\nGay or straight, fuck it, we all going to heaven\nSo put on some skinny jeans, and tongue kiss John Legend\nI'm bout to go to Canada, I can’t wait\nTell bitches I know Drake and get my asshole ate\nEating pussy, naw, that ain't cool\nBut what's cool is eating ass hair with food\nI'm a rude dude, Ruder then Jude\nBaby face, NWA attitude (Fuck the police!)\nAnd I smell food, time to eat\nPinky porno on, time to beat (I'M BOUT TO BUST!)\nWife went to work, time too cheat\nIn jail for rape, somebody call reap, I'm a freak!\n\n[Verse 3: Swift]\nNo surviving this poisonous hybrid\nYou bitches skating on thin ice and falling inside of it\nI am a human piranha, with a murderous persona\nI'll drown a nigga inside his own saliva and blood\nThe mental asylum kicked me out of it, it wasn't enough\nI need a higher, more maniacal place to call a club\nI'm a cutthroat, a nasty old animal\nThat'll crack a nigga fast as pistachios and mozzel tov\nI stomp a nigga for being soft\nSee I'm just a dog that opened his mouth and broke the fucking muzzle off\nI'm coming for your boss, at any cost\nHere, watch this moss eat through his clothes like a mothball\nI'm not y'all, stab a nigga with rusty daggers\nGive him lock jaw, where they can’t open their trap\nImagine what hack saws could do to these rap frauds, you ain’t thugging\nThey should be knocking on wood like Jim Duggan\nI'm hugging this Glock, I'mma squeeze like an anaconda\nThat's standing on your block I'll blast any bandana that I see\nI’ll beat you with your own I.V. in a 'spital\nI’ll put a pillow over that widdle to squeeze\nI’ve been a heathen, see I was my momma’s mistake\nA born tyrant, I'm bombing where ever you bastards hibernate\nThey contemplate on killing me, I'm in the D' living it\nI'm at the shooting range, and busting before I'm in that bitch", "image": "https://images.genius.com/78a2dd37bee3129adb21d5fac55f009d.1000x1000x1.jpg"}], "artist": "D12"}