{"songs": [{"title": "Reincarnation", "album": null, "year": "1996-06-10", "lyrics": "[Intro: 2Pac]\nAre you scared to die?\nIs reincarnation\nAre you - are you afraid to die?\n(Reach the whole nation)\nMe? (murderer)\nMy only fear of death is reincarnation\nUh\n\n[Hook: 2Pac]\nMy only fear of death, is reincarnation\nI use my last breath, to reach the whole nation\nHow can they call me murderer for my spoken words?\nThis composition be my prophecy I hope it's heard\nMy only fear of death, is reincarnation\nI use my last breath, to reach the whole nation\nHow can they call me murderer for my spoken words?\nThis composition be my prophecy I hope it's heard\n\n[Verse 1: 2Pac]\nHard words is spoken, many promises broken\nAs if it's, useless to hope, they got me constantly smoking\nMy role model was a cold bottle of O.E\nSurrounded by my closest homies but nobody knows me\nI pray to God it ain't easy\nHalf the cops in California got a hard on to squeeze me\nRunning through the backstreets, hopping over fences\nTryna shake the fucking K-9s, running around senseless\nI'll prolly be a mystery to many, but a legend to some\nI've been a man for many women, but husband for none\nIn case you see me out in traffic, looking nervous and high\nMy hands, holding my pistols will they serve us or die?\nMay God forgive me for my crooked ways, I didn't mean it\nKnew I'd fall in love with money the first day that I seen it\nMaybe now they can understand it's my occupation\nIt's clear that my only fear of death is reincarnation\n\n[Hook: 2Pac]\nMy only fear of death, is reincarnation\nI use my last breath, to reach the whole nation\nHow can they call me murderer for my spoken words?\nThis composition be my prophecy, I hope it's heard\nMy only fear of death, is reincarnation\nI use my last breath, to reach the whole nation\nHow can they call me murderer for my spoken words?\nThis composition be my prophecy, I hope it's heard\n\n[Verse 2: Hussein Fatal]\nI keep my shit off safety, I've been shooting rocks lately\nEverybody gots they nickel plates to penetrate me\nI was supposed to be the murder first to go\nThem niggas missing, grazed my wrist, I took it personal\nKato told me that I was slipping, got his strap and started tripping\nSlipped two clips on the table, twist the L and said \"Fatal listen\"\nEverybody don't be missing keep your vest on, baby\nAnd you know that shit that happens to the Teflon, crazy\nYou ain't gotta pack a gat, I got your backs keep your front line\nOr we can stall that, from the Cadillac we about to bum shot\nBut Reeg locked down, (so) it's still begging casket\nAll we thought about was plastic and murdering bastards\n\n[Hook: 2Pac]\nMy only fear of death, is reincarnation\nI use my last breath, to reach the whole nation\nHow can they call me murderer for my spoken words?\nThis composition is my prophecy, I hope it's heard\nMy only fear of death, is reincarnation\nI use my last breath, to reach the whole nation\nHow can they call me murderer for my spoken words?\nThis composition is my prophecy, I hope it's heard\n\n[Verse 3: E.D.I Mean]\nI spend my days and nights, not knowing if it strays in flight\nGon' finally catch me, leaving my foes hella happy\n'Cause look, at any moment, the game could be my main opponent\nNiggas be swimming where the sharks in, and don't even know it\nBut I stay focused, concentrate on my surroundings\n'Cause if I'm slipping, well that's when niggas will get to clowning\nAnd I can't have it, I got a mission to complete\nRaise my kids upright, make sure they got something to eat\nAnd my daily ritual is, protect my physical biz\nI just can't see now, I choose death before the penal\n'Cause what good am I to that little nigga with them big eyes?\nIf I'm incarcerated, you feel me now I gots to make it\nAnd If I don't, Re-Reincarnation ain't an option\nLeave my ass dead until it's really poppin'\n\n[Hook: 2Pac]\nMy only fear of death, is reincarnation\nI use my last breath, to reach the whole nation\nHow can they call me murderer for my spoken words?\nThis composition is my prophecy, I hope it's heard\nMy only fear of death, is reincarnation\nI use my last breath, to reach the whole nation\nHow can they call me murderer for my spoken words?\nThis composition is my prophecy, I hope it's heard\nMy only fear of death, is reincarnation\nI use my last breath, to reach the whole nation\nHow can they call me murderer for my spoken words?\nThis composition is my prophecy, I hope it's heard\n\n[Interlude: 2Pac]\nHow can y'all call us murderers and shit and\nBlame all the problems of the world on us young dumb, Thug Niggas from the streets, ain't that a bitch\nHow come y'all ain't giving a fuck about us when we was broke and poor?\nHow come when we get a little money, motherfuckers wanna stop us and block us?\nWhat part of the game is that?\nWho should we love, who should we believe in when the motherfuckers that's supposed to be our role models, supposed to be the people we look up to is tryna snatch us out of the game\nWhat type of shit is that?\nFuck 'em all\n\n[Verse 4: Kastro]\nI still whizz for the top Dollar\nJust a true thug [?] a comer\nHigh power, small timer, made nigga top grade\nWith a mean ways to play 'em these days, homie I'm saying though they tryna play me, so I gots to get them, hit 'em and lay low\nI told you before, my only fear of death\nIs momma crying for help, and papa tryin' to help\nWhen I know we ain't got it, but shit I gots to handle this card\nThey handin' me, snitches, trick bitches, niggas who ain't us enemy\nNever worry, apparently, I think I never buried\nBut if so, I gotta go my nigga's will always love me\nThug family ties, I know they want me to die\nBut I'ma survive, see the look in my eyes\n\n[Outro: Lemika]\nAnd this Lemika and I'd like to give a shout out to all the tre whizz kids out there, Aunt Micky in the house, and I'm chilling up in the studio with 2Pac and Cocoa G and uh -laughs- okay I'm out..\nI'm done, I went out, oh shit, put this back", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}