{"songs": [{"title": "That’s All She Wrote", "album": "No Mercy", "year": "2010-12-07", "lyrics": "[Hook 1: T.I.]\nNow I don’t really care what you call me\nJust as long as you don't call me broke\nI bet they knew as soon as they saw me\nGoodnight, it's over with, that's all she wrote\nStreets like cold Chicago\nAin't nothin' new, I seen it all before\nBut still, I ball like no tomorrow\nGoodnight, it’s over with, that's all she wrote\nAll she wrote, all she wrote\nI said, it’s over with, that's all she wrote\nAll she wrote, all she wrote\nGoodnight, it's over with, that's all she wrote\n\n[Verse 1: T.I.]\nIt's stupid how I go in\nKnowin' everybody knowin' that I’m sewin' up the game\nDestroyin' like they hate me for it\nEventually, see they can't beat and then with me, they join\nOthers sworn under oath or banished, left completely scorned\nYou tell lies, get cut, nigga, kick rocks\nYou never did blend in with the big shots\nOn the fast track, ain't no need for no pit stops\nI just laugh at, nigga wishin' they were this hot\nGuess they mad at me, huh? Really pissed off\nBetter that than pissed on\nI’m the Jetsons, you the Flintstones\nCatch me in the end zone, high-steppin', Prime Time\nThought you niggas been known, ain't no blockin' my shine\nLike my new Air Yeezys, you can see me in the nighttime\nI get rich off livin' life, you check to check, recitin' rhymes\nSo call me what you want, wanna hate? Have a nice time\nWhile I get stupid paper, hey, my dough ain't in its right mind\n\n[Hook 1: T.I.]\nNow I don’t really care what you call me\nJust as long as you don't call me broke\nI bet they knew as soon as they saw me\nGoodnight, it's over with, that's all she wrote\nStreets like cold Chicago\nAin't nothin' new, I seen it all before\nBut still I ball like no tomorrow\nGoodnight, it’s over with, that's all she wrote\n\n[Verse 2: Eminem]\nYou're starin' straight into a barrel of hate\nTerrible fate, not even a slim chance to make a narrow escape\nCupid shot his arrow and missed\nWait, Sarah, you're late\nYour train left, mascara and eggs smear in your face\nNight's over, goodbye, ho, I thought that I told ya\nThat spilled nut ain't nothin' to cry over\nNever shoulda came within range of my Rover\nShoulda known I was trouble soon as I rolled up\nAny chick who's dumb enough after I blindfold her\nTo still come back to the crib\nMust want me to mess with her mind, hold up\nShe mistook me for some high roller\nBut I won't buy her soda\nUnless it's Rock and Rye cola (Faygo's cheaper)\nBuy you a bag of Fritos?\nI wouldn't let you eat the fucking chip on my shoulder\nIf you was bleach and I was hair I wouldn't die for ya\nTryna pull five bucks from me is like tryna pull five molars\nYou'll get your eyes swolled up\nI'm on my straight-grizzly\nSo why would I buy you a gay-ass teddy bear?\nBitch, you're already bi-polar\n\n[Hook 2: Eminem]\nNow I don’t really care what you call me\nYou can even call me cold\nThese bitches knew as soon as they saw me\nIt's never me they'll get the privilege to know\nI roll like a desperado\nNow I never know where I’m gonna go\nStill, I ball like there’s no tomorrow\nUntil it's over and that's all she wrote\n\n[Verse 3: T.I.]\nThe credit roll, the curtain close, the movie over with (that's it)\nBut don’t get mad at me, go blame the chick who wrote this shit (nope)\nYeah, life is sure a bitch (bitch), but she know I’m rich (I'm rich)\nThat why she give me what I want and I just throw her dick\nHere I go again, I kick this shit, give a damn, got it pourin' in\nPesos, Euros, Yen, ah-ha, I’m paid, never gon' be broke again\nSee me posted in anything, wearin' any chain\nNever gon' see me totin' anything, all you gon' see is bang\nIt's so nice where I kick it, hate you never get to visit\nYeah, I’m on another level, but you niggas still can't get it\nIt's all over ‘fore you finish–sorry, bro, this where we end it\nWon’t give you the satisfaction of me givin' you the business\n\n[Verse 4: Eminem]\nYeah, I guess life is a bitch, ain't it, Tip?\nAnd each one thinks they the shit\nShirt off my back? I wouldn’t give you the dirt off my handkerchief\nI’m givin' these hoes a dose of their own medicine\nLet 'em get a good taste of it\nI’m sure you got that relationship memo by now\nBut in case you didn't, I'ma stick this whole pad full of sticky notes to your forehead and staple it\nLife is too short and I got no time to sit around just wastin' it\nSo I pace this shit a little bit quicker, that clock I'm racin' it\nDouble timing it, but I still spit triple the amount of\nInsults in a tenth of the time that it may take you pricks\nTo catch on; while you strong arm, I'm like Stretch Armstrong\nMan, I still say K-Mart's like there's an apostrophe 's' on it, dawg\nAnd they say McDonald's isn’t a restaurant, well I guess I’m wrong\nBut if you're gonna tell me that the A&W ain't the spot for the best hot dogs, you can get the F on, dawg\n\n[Bridge: T.I.]\nAnd on my throne I remain, all alone in my lane\nI’m as strong as the King, they were gone ‘fore they came\nNow I don’t wanna hang, I slap five with them rap guys\nThey just wanna sabotage my hustle, shawty, that's why\n\n[Hook 3: T.I. & Eminem]\nNow I don’t really care what you call me\nYou can even call me cold\nI bet they knew as soon as they saw me\nGoodnight, it’s over with, that's all she wrote\nI roll like a desperado\nNow I never know where I’m gonna go\nBut still I ball like there’s no tomorrow\nGoodnight, it’s over with, that's all she wrote\nAll she wrote, all she wrote\nI said, it's over with, that's all she wrote\nAll she wrote, all she wrote\nGoodnight, it’s over with, that's all she wrote", "image": "https://images.genius.com/f55abc725080eb05147e45ce3cd406a8.1000x1000x1.jpg"}], "artist": "T.I."}