{"songs": [{"title": "Move the Crowd (The Wild Bunch Remix)", "album": " Paid In Full (Deluxe Edition)", "year": null, "lyrics": "Verse one:\nStanding by the speaker, suddenly I had this\nFever, was it me or either summer madness\nCuz I just can't stand around\nSo I get closer and the closer I get, the better it sound\nMy mind starts to activate, rhymes collaborate\nCuz When i heard the beat, I just had to make\nSomething from the top of my head\nSo I fell into the groove of the wax and I said\nHow could I move the crowd\nFirst of all, ain't no mistakes allowed\nHere's the instruction, put it together\nIt simple ain't it but quite clever\nSome of you been trying to write rhymes for years\nBut weak ideas irritate my ears\nIs this the best that you can make?\nCuz if not and you got more, I'll wait\nBut don't make me wait too long coz I'm a move on\nThe dancefloor when they put something smooth on\nSo turn up the bass, it's better when it's loud\nCuz I like to move the crowd\n\nMove the crowd...\n\nVerse two:\nImagine me wit the heat that's made by solar\nIt gets stronger everytime I hold a\nMicrophone, check the tone to get started\nThe line for the microphone is departed\nSo leave it up to me, my DJ is mixing\nEveryone is moving or eager to listen\nYour hands in the air, your mouth, shut!\nCuz I'm on the mic and Eric B is on the cut\nFor those that know me, indeed I like to flow\nEspecially when the music's going slow\nIt gives me a chance to let everybody know\nIt's time to bust out the Rakim show\nI'm the intelligent wise on the mic I will rise\nRight in front of your eyes cuz I am a surprise\nSo I'ma let my knowledge be born to a perfection\nAll praise due to Allah and that's a blessing\nWit knowledge of self, there's nothing I can't solve\nAt 360 degrees, I revolve\nThis is actual fact, it's not an act, it's been proven\nIndeed and I proceed to make the crowd keep moving\n\nMove the crowd...", "image": "https://images.genius.com/544b6274041065fc3d40982c5f03d4c6.640x640x1.jpg"}], "artist": "Eric B. & Rakim"}