{"songs": [{"title": "On Fire (Freestyle)", "album": "Return of the Dozen Vol. 2", "year": "2011-04-12", "lyrics": "[Intro]\nThis is another\nD12 Exclusive\n\n[Verse 1: Swifty]\nIf you say that you hungry, then I ain't concerned\nUnless you came in this game with a tapeworm\nThe phantom of hip-hop, cause this is the doctrine of a madman\nAnd I’m assassinating doctors, no shot treatment is needed\nI’m up in the hospital weeded with bloody orthopedics\nI’m giving it to innocent people that don’t need it\nAnd I’m exporting you niggas without a heater\nKeep them breathin' nut there’s none worthy\nIf I ain't out murkin' motherfuckers, I’m cold turkey\nOr worst thing since Percy\nWhen I was younger, my momma placed me in the dirty nursery\nThat’s why they labeled me a cursed beast, I’m blood-thirsty\nI pop up, unexpectedly like a herpe\nI murder you for dirt, cheap\nOpen up that door like Lurch\nAnd I’m murk the first nigga that I see\nWhen I guillotine, I slit a niggas brain\nAnd slit it till you get rap and signature, my name\nThe pinnacle of insane, my genitals remain\nBigger then a Afro-Puffs, on cranium arrange\nShit, it’s normal till I end with a gauge\nCut your life short, like an editor with blades\nI’m a predator, infrared up in the trees\nWhen I conversate I’ll be shootin' more in a breeze\nI breath bitches to their knees\nGivin' them stitches with a rusted needle and barb wires\nSealin' their lips I’m justa', opposite of narcoleptic\nI breathe darkness, sleepwalker tearing the tees off these hawkers\nI throw you hoes in the ocean\nAnd seen it to souls that the air force is exploding with seahorses\nLike me, my sorcerist is talking bitchy\nThis ain't Pulp Fiction, my addiction is torture methods\n\n[Verse 2: Bizarre]\nI rap, like I got a chip on my shoulder\nThis ain't no chip, this is a 15 pound boulder\nPracticing yoga, meditatin' on death\nBottle of Vicodin ‘till ain't nothing left\nI got an Idea lets play butt-naked hokey-pokey\nCut off the lights, listen to Esham and hold me (Yeah)\nDamn my neighbor is nosey, close the blinds\nThis kid ain’t ten, he’s barely nine\nNice behind. Damn, I’m talkin’ about a kid\nI’m talkin' about rapes, I’m talkin' about a bed\nMia, my wife’s Spanish she’s been fuckin' from the back\nI’m in the other room tongue-kissing the cat\n“Damn, this is one sick motherfucker (Aha)\nHe talks about rape and he’ll tongue-kiss your brother\" (Damn)\nRape your grandma in the ass and I put a plug\nHide out for 30 days and wait for her period to come (Yeah)\n30th day I beat her ass for nothing\nBitch is 65 years old, that period ain't comin'\nI’m a Lutheran, a catholic, a Jehovah witness, a baptist\nA Muslim, I’m a faggot, Go-Go Gadget!\n\n[Verse 3: Kuniva]\nKickin' down your door with a 44.-matic\nAnd the size will make you shake like a know dope addict\nTurn a robbery into something more tragic\n“Don’t shoot, here’s my watch it's all Rolls gold have it\"\nBitch! I coined the phrase \"I'm goin' in\"\nYour mom insisting play the game\nThe first tongue on my dong wins\nThey says the Dozen was slippin', yo how'd you figure that\nSlap the drool out of your mouth, tell you to spit a rap\nBreakin every bone in your hand, homie Twitter that\nI am like a Chinese chef the way I'm killin cats\nSee a fool screamin at his caddy and then I prop it up\nGet the kinda stuff that make your toilet keep stoppin' up\nWe cannot stop the cuts after I tie you in a chair\nAnd grab the Ginsu knives, now we can chop it up\nI'll take it easy if your chick's pregnant\nI'll wait until your kid's stretchin then sock him in his midsection (ah!)\nDon't ever try to slug me, I'll leave the back of your head bloody\nSo when you wipe it looks like you're doin' the Dougie\nSo don't trust me, I'm grimy and unlucky\nVoice-mails from your bitch like, \"Kuniva, come fuck me!\"\nGritty, know every nook and cranny of the city\nBullet for every fool that Mr. T pitied\nI smell pussy and I don't see titties\nCash buried underground, Dirty Money, P. Diddy\nShifty off the remmy or the Henny\nHit your Bentley I'm simply demandin\nAnd I'm never fuckin bitches gently, gang around\nAll up in the crib pistol hangin out (sup bitch)\nLikes the way I rhyme and I love the way she slang her mouth\nThrow your whole grill out and I'm goin' apeshit\nTake 6 from this banana clip before I peel out\nFuck y'all, I don't give you that cause I don't trust y'all\nTell your momma she need a baby nigga to get suck the duck ball\nOnly one D12, only one group\nSo how can so much filth fit inside one booth?\nThere's only one Shady so there's only one truth\nUntil you sell over 8 mill we are that group (ouch)\n\n[Interlude: Bizarre]\nHey yo Maestro\nWhat the fuck happened?\nI mean for real\nWhat the fuck happened?\nHey!\nTurn this shit off!\nFuck\n\n[Interlude: Fuzz]\n\n[Verse 4: Fuzz Scoota]\nMarried to game a benevolent groom\nBachelor party, arranged shoot up the reverend in June\nReference the goons, you have to give the elephants room\nRun shit from the elegant room to the president's tomb\nD12, one plus eleven is noon\nMake a community feel like heaven's sent to them\nAnd if I have to get my intelligence room\nBe at your residence soon\nGuns on me lookin like an evidence room\nAnd that fits range, that python, that shit snapped bones\nYou'd rather be shot with it than bitch-smacked holmes\nAfter dark DJ's will put your kid-raps on, but\nFor that young money my nigga you'll get kidnapped holmes\nAfter triple-countin the bread you can get back home\nCollect the ransom, told my driver, \"Take this bitch back home\"\nConversation's recorded, gotta get that phone\nIt's got valuable information on the bricks' that's flown\nThe confidential on hoes and the dicks' that's blown\nD12, the reason ya girl done bring a thick ass home\nAnd I need help on the bitches, gotta get back home\nSo they won't be asking \"When will you get back home?\"\nI call yo bitch like \"Bitch, come and pick this bitch up,\"\nGot her on speed dial, she used to come and get this dick up\nShe call like \"You have a few minutes to come and get this quick nut?\"\nI have a few second ma, I can get come and get this dick sucked\n\n[Outro: DJ Young Maise]\nFuzz Scoota!\nNewest member of D12\nWhat Up!\nWe Back Mutherfuckers!\nD12\nReturn of the Dozen Volume 2\nWe on Fire!\nAnd we (don't stop)", "image": "https://images.genius.com/78a2dd37bee3129adb21d5fac55f009d.1000x1000x1.jpg"}], "artist": "D12"}