{"songs": [{"title": "Listen to Me", "album": "Q.B. 2 Compton", "year": null, "lyrics": "[Intro:]\nUhh, Uhh, Where am I going?\nWhere am I? Yo, it's ill\n\n[Verse 1]\nYo my wife's tired of fucking me\nLife tries ducking me\nLuckily I find 'em just at the right time\nMac in my right arm, Tequila bottle in\nMy left arm like Cristian\nWatching my life go, Can´t do myself in\nWolves in the night yo, hells men\nTwo revolvers I can let twelve spin\nHop in my Benz, push it to the limit\nBuck-sixty, who wit' me? My (?) to well\nTwisted blunts and inner conscience\nTelling me that I ain't shit\nNo matter how much cash I sit with\nStill gotta ask the lord for forgiveness\nMy precious baby girl came like forty nights of rain\nTo replenish my adolescent brain\nBlessed be her name, before her birth I was insane\nSo I drive the cooler pressure down, delay the pain\nI ate from these poisonous, fucked up streets\nTasted larceny, it was sweet, I starved for more to eat\nThough I took, that was to live, hope God will forgive\nAs odd as it is, the more I gain the harder it is\nTo maintain, bitches playin' games\nNiggas snitchin', I ain't saying names\nBut y'all niggas better watch how y'all slang\nLost so many close niggas, drunk almost crashed\nI'm going too fast, highway patrol will just flash\nLights in my rearview, if they stop me I hope they lock me\nInstead they speed ahead\nYo nigga watch me\n\n[Hook]\nI'm drunk by myself, gun under my seat\nI don't want none of my peeps caught up in none of my beef\nI'm a ride to the end of the road if I have to\nPraying no car speeds by for me to crash to\nSteering wheel in my hand\nTrying to hold it steady\nAnything in my way is dead\nCause that's the way I feel, I am already\nWhen I'm drunk by myself alone in the zone\nDrunk by myself\n\n[Verse 2]\nHeard niggas hate me, but I hated too once\nBeen in the shoes of a Wolf in the night when he hunts\nFor every shell niggas bust, we bust at ourselves\nCan't tell them niggas nothing though, bullets wak'em up well\nTake them to hell\nStick up niggas once ran up on me\nMy decadent lifestyle attracted sharks on me\nI ain't your mark homey\nIt's hard to look straight, my foot on the brake\nSpilling my bottle not even shook of the Jakes\nCould hardly look both ways, put out the haze blurry vision\nThink about the time in my life before I was in televison\nHella women, jealous niggas up in my vision\nSince we all hood niggas expect kilos\nFor what they not seeing is police expect Rico\nOnly if I could take care of everybody, intoxicated\nWindows up blastin A.C. going wherever instinct takes me\nI hate it when I'm like this\nThe bottle's my accomplice\n\n[Hook]\n\n[Verse 3]\nThe reason that I want to be alone\nTired of all the things that went wrong\nThat would have went right if I would have did it on my own\nTake another swigg\nThe more I drink, the more I think bad thoughts\nFake friends who hung around who wanna bring you down\nNot knowing who to trust, runors about niggas coming through\nSupposedly to shoot at us, not knowing what was true\nOr what to believe, that's why I'm on the low lately\nChoosing a Henny bottle over a friend, driving again\nTo keep my mind off that weak shit\nThere's love through it all, things to live for\nI swerve, almost crash into a wall\nThink about the good, find myself laughing\nTurn the cell off, no way to be reached\nKnow I'm near my crib, trying to see my way through the streets\nReminded of the positive, I take my drunk ass home\nStart feeling out of it, can't wait to get out of this whip\nBring my ass to the crib\nI'm tired...\n\n[Hook]", "image": "https://images.genius.com/fa91cff72cfd37fd6ea86da4dde45a21.300x300x1.jpg"}], "artist": "Nas"}