{"songs": [{"title": "Keep It Real", "album": "Death Row’s Snoop Doggy Dogg: Greatest Hits", "year": "2001-10-23", "lyrics": "[Intro: Snoop Doggy Dogg]\nAnd now, our national anthem!\nIt's going down, West Coast\nA toast to the Coast, West Coast!\nI got my nigga Mack 10 up in the house from the Westside Connection\nMy nigga Deadly Threat from the L.A. Zoo\nL-B-C Crew, D.P.G, West Coast finest\nHere's a toast to the coast!\n\n[Verse One: Mack 10]\nWhat have we? - a house full of Cavi, no stress\nWell known riders from different sides of the West\nGot the hi-zoes licking up, so hard we're sticking up\nHow could the East Coast win; when the West Coast is clicking up?\nSo please, no set tripping about Cs and Bs\nIt's the Westside connected with the D.P.G.s\nFor the cheese we're jab with the gift of the gab always capping\nMack 10 and Snoop rapping, now how does that happen?\nIt's all good, fool, so peep game if you could\nSnoop be from Long Beach, and I be from Inglewood\nSo now you despise, cause it came to your surprise\nTwo well known enemies now becoming allies\nIn Californ-I-A; we parley the G way\nSome wear red and black, and some sport (Blue and Grey!)\nBut gangsters don't dance, we hang-boogie and bang\nSo it's the Westside connected with the Dogg Pound Gang\n\n[Chorus: Snoop Doggy Dogg X2]\nWe are party people, West Coast gangsters are party people\n(Rock the party ya'll) (Rock the party ya'll) (Rock the party ya'll)\nWe are party people, West Coast gangsters are party people\n(Rock the party ya'll) (Rock the party ya'll) (Rock the party ya'll)\nParty people, party people; do you wanna get funky?\nGet down.. get down.. you know..\n\n[Verse Two: Bad Azz]\nUp jump the boogie, so I've jumped up with it\nWe smoke weed by the ounce, no hit it\nIt's a party, Bombay and Bacardi, O.E. and Hennessy\nWe're all heated just in case; any of my enemies slipped in\nTripped in, you don't wanna own a casket this soon\nGet at the bitches, nigga, bump to the boom\nThe ladies love me cause I love myself\nI'm like an age, by no wine in time you'll find;\nI'm at the top of the shelf\nSo when you ready and you're cracking a sip\nStrip, trip, slide around your house in your slippers\nBump the rap tunes that's as cold as the Whispers\nFantastic, brand new in this classic\nWe done mellowed out but you still get your ass kicked\nIt's Mr. Bad Azz, I rock microphones right\nWest Coast, East Side, for life!\n\n[Verse Three: Techniec]\nIt ain't no need for the fronting black, between me and you\nReality bites, so I'ma keep it real with my crew\nI'm dangerous like Michael Dew\nMy life cycle completes the last stages\nI'm more, I'm through, definitely gauges is outrageous\nCause I was born to rock the party\nOh! now you're Mister Smarty because we got the show started!\nI'm cold hearted, and won't stop what I'm revealing\nLeave it up to the West to have them dancing on the ceiling\nAnd I'm feeling, that Vibe that represents the East\nI attack like a pack, to make them burn like grease\nSo let the nonsense cease, and hold my piece in case\nReel-to-reel come to deal, I have to give them a taste\nI serve face to face, rhymes define by Tech\nVersatile style done switched up to wreck your whole set\n\n[Interlude: Snoop Doggy Dogg]\nThat's real, you know\nIt's getting kind funky here man, uhh..\n\n[Verse Four: Kurupt]\nMack 10 is the lick, Dogg Pound is the clique\nI can't get enough of this gangster shit\nMy name ain't +Jeru+ and I ain't out to +Dama-ja+\nBut when on the mic, emcees, to me, they're all amateurs\nSee the opponents; disassemble the components\nDisassemble the opponents, then disappear in a moment\nIn a blink's time, I take time in the doorway to crime\nWith a criminal mind, the raw kind\nMicrophones used so abusively\nYou can't fuck with the K-U-R-U-P-T\nAnd in the mixture, painted clearer than a picture of a psycho\nI'm suicidal, split shit to cause a twister\nAnd get you twisted, you're fucking with the unlisted\nTo be specific; niggas ain't being realistic\nI ain't impressed, you're about to get your chest test\nIn the west; where it's about your money and your set\n\n[Verse Five: Deadly Threat]\nYou East Coast niggas flow like the home grown grow\nZoo got the flavor, every color for the rainbow\nDream, on out far, pass the stars\nYour styles ain't doper than ours\nHard to the core, hit it one time, hit it some more\nY'all spit but that West Coast shit is out doors\nWild like Ninety Days in the cage\nCold like the Everglades, and never fades\nMe, C to the Z to the T\nBeef? Bet' not let me catch you in the streets\nHoo-Bang, cracked in the fast lane\nThe melody by Deadly, the Dopeman\n\n[Outro: Snoop Doggy Dogg]\nYeah yeah yeah, there you have it\nIt's like magic, it's so tragic\nThe West Coast, Hoo-Banging, Westside Connection, L.A. Zoo\nL-B-C Crew, and you know about the infamous D.P.G.s\nWe make them freeze to their knees, real Gs\nKeep it real though!", "image": "https://images.genius.com/dceebda859a32eb0b992545242936a6f.480x480x1.jpg"}], "artist": "Snoop Dogg"}