{"songs": [{"title": "Neva Left", "album": "Neva Left", "year": "2017-05-19", "lyrics": "[Intro]\nDogg, what up, mane?\nWord on the streets is you ain't what you used to be\n\n[Verse 1]\nI gang bang to the fullest\nA lot of niggas talk about it but they really don't do it, do they?\nSo I'm doin' it for y'all\nMark or a buster, I'ma ruin it for y'all\nStomp that, strap up, mash up\nAnd get it crackin' with the slapper, jacker\nSmacker, rapper? Nah nigga, that ain't me\nGangsta? Yeah nigga, can't you see?\nRider, like the tonners on my Chevrolet\nWest Coast, motherfucker, that's the only way\nYeah homie, what you say?\nHome of the Wook, Wok and Gunplay\nA lot of homies shoot to J\nBut most of 'em prefer to shoot the K\nYeah, that's the good life\nAnd where we come from, loc, that's the hood life\nWhere you mama and daddy\nThrow the set up out the moon while they swangin' the caddy\nThat's on the set, tats on they neck\nStreets sweet with the heat, yep, they stay on deck\nI'm dazed and blazed, no confusin', I'm choosin'\nThis how I was raised\nI bring that out and bag it up, no doubt\nSwing it out and let it up and bang that out\nThis Crips, nigga\n\n[Interlude]\nThat's crazy, cuz\nYou know my whole life, I wanted to be a gangsta, mane\nI used to see my OG home boys at King Park\nRidin' on bikes but they came with they flags on the end\nSee Stacey Adams, 501's\nThat shit was fascinating\n\n[Verse 2]\nThe Miles Davis of gangbangin' and crack slangin'\nDrivin' a fresh rock, run 'em with blocks in 'em\nFresh out the county, I'm boxin' 'em\nMoved on up and bought a continental, nigga, with knock in it\nNow I'm rockin' it, '61 blockin' it\nIf y'all ridin' by, my nigga, we cockin' it\nWe poppin' on imposters, fake ass mobsters\nEast side niggas, ain't no stoppin' us\nMy recipe is treachery\nThe best in me, nigga, the West to be\nA better place for the one of Ace\nPut a 9 millimeter in your fuckin' face\nAnd let you say your grace before you have a taste\nOf reality, set in, yeah, this your fate\nNow your homies at your funeral\nPlottin' on some get back\nBut you can't get back 'cause nigga, you dated\nAnother sad gangsta story\nAnd usually ones with the territory\nNo nuts, no glory\nNo pain, no gain\nLife for a nigga growin' up in the game\nThis slangin' thang\nDrinkin', sell a lil' cocaine\nGet locked up for a minute now we in it to win it\nNow everybody know me\nThey watchin' the makings of a real OG\n\n[Interlude]\nYeah, they say if you watch somethin' long enough, you'll become it\nYou know, they say imitation is the best form of flattery\nThat's what I was told\nA lot of niggas is imitatin' this real gangsta shit\nYou ain't cut from it\nYou dig?\n\n[Verse 3]\nYeah, scarin' all the white folk\nWhile stayin' on the right note\nAnd you can quote me if you want to\nDon't say what you will do, nigga, what you gon' do?\nI'm live in the flesh\nCaught him on Imperial left five in his chest\nSurvive in the west\nIt's everyday cycle, you never know what might go blam\nAnd how you like me now?\nCrip 'til you slip, Mr. Big Bow Wow\nYeah, it's my chance to prance\nI got ants in my pants and I needs to dance\nI go for broke, no joke\nI gotta put my drink down, I'm tryna C walk, loc\nSee i'ma take off, break off\nAnd make off with the cash\nAt the pad with, a thick lil bitch, she super bad\n\n[Outro]\nGangsta, gangsta\nFuturistic\nSnoop Dogg\n48 hunnid\nC's up, yeah\nShoot or shout out to my home boys\nHarlem 30\nYeah, real shit\nAll my niggas on the East coast\n6-0's, Eight Tray, Hoovers\nMain Street, all my niggas in Compton\nAnd the South side, ya dig?\nNutty Blocc\nSantana\nOh, can't forget them Long Beach niggas\nEast side the same\nRollin 20 Crips\n19th Street\nWest side, you know what's hatnin'\nSaten Day, West Coast\nNorth side on the block\nAll hood, yeah\nCrip shit", "image": "https://images.genius.com/60bf707949edab977c5ad8da61ef82a2.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}