{"songs": [{"title": "Do It to Death", "album": "E.L.E. (Extinction Level Event): The Final World Front", "year": "1998-12-15", "lyrics": "[Intro]\nHuh huh-huh huh-huh huh huh-huh-huh huh\nHuh huh-huh huh-huh huh huh-huh-huh huh\nHuh huh-huh, huh huh, woo\nWoo-woo-woo-woo\nWoo-woo-woo-woo\nYeah, everybody, c'mon\nHere we go party people, woo\n\n[Verse 1]\nPull up in the whip, pop the trunk, feel it?\nBarefoot gorilla baboon funk, ya hear it?\nMe and my nigga Richie was itchy to meet some women\nMet some chickens, they was actin so snobby and bitchy, fuck it\nPass me the sticky\nThe chicky wanted to leave me with a kiss and a hickie\nI ain't wit it but give me a quicky, I ain't in to doin the licky-licky\nEven though you be lookin so pretty, I own all of my shit, never 50-50\nOodle noodles all 'dose fools never refuse, accuse me for the bruise\nChick got a rattling sound, better tighten the screws\nRunnin and gunnin, kinda stunnin\nThe way we be comin around, slummin, wylin and dollin\nMy nigga Horace kick up a nigga like Chuck Norris\nGot some other niggas lost way up in the forest\nHang you up in a harness, label me and all of my niggas the hardest\nFuck around, be the next \"Formerly Known As\" artist\nLayed out with a goddess, pretty lilly Adonis\nBesides all of that, niggas is novice, I make you all a promise\nThe promise is that I'm so dominant and that I am so prominent\nCaptured the whole of Asia as a continent\nOh shit, I be comin and tumblin down, rumblin, stumblin down\nFreaky prophet with unusual musical sound\nBringin the ruckus, you motherfuckers be givin me pounds\n'Semite Sam, give me the camcorder and a city with plans\nMe and my fam, hustle and tussle in makin this groove, me and my mans\n\n[Chorus]\nHow we gon' do this? (Make them move)\nKeepin it live (where my niggas is at?)\nStackin my paper (put it away safe)\nStraight buckwild, let me see your hands\nWhat we gon' do? (Do it to death)\nWhat we gon' do? (We gon' do it to death)\nWhat we gon' do? (Do it to death)\nWhat we gon' do? (Do it to death)\n\n[Verse 2]\nYo! Pin or a needle, make you wobble or weeble\nNiggas is feeble, back in the day I used to get money illegal\nGet some ass, cop a room down at the Regal\nHit you wit so much drama make niggas always wait for the sequel\nYo there ain't no equal on how we be reppin for the people\nYo there really ain't no equal.....\nAsk Hillary, met her down on Flatbush and Tillory\nShe killin me, got me crazy, wylin, actin straight grizzly\nWe never made it too far together\nI left her standin on Franklin and Willoughby\nAnother mystery to me\nWhile she still on the corner kissin at me, hissin at me\nIgnorin these bitches, they're angry, now they're riffin at me\nVital and critical, literal lyrical, make niggas pitiful\nGo to the clinical, examine your physical\nFrightening and enlightening at the same time\nGet the goods and price them, and doin the heist again\nYou thinkin we would be nice again\nWe on a mission, we don't need none of your advice again\nHold me down BABY, pitter patter, you chitter chatter too much\nI'mma splitter splatter your blidder bladder\nMake you spill out your guts\n\n[Chorus]\nHow we gon' do this? (Make them move)\nKeepin it live (where my niggas is at?)\nStackin my paper (put it away safe)\nStraight buckwild, let me see your hands\nWhat we gon' do? (Do it to death)\nWhat we gon' do? (We gon' do it to death)\nWhat we gon' do? (Do it to death)\nWhat we gon' do? (Do it to death)\nFlipmode Squad, hell yeah\nHow we gon' do this? (Make them move)\nKeepin it live (where my niggas is at?)\nStackin my paper (put it away safe)\nStraight buckwild, let me see your hands\nWhat we gon' do? (Do it to death)\nWhat we gon' do? (We gon' do it to death)\nWhat we gon' do? (Do it to death)\nWhat we gon' do? (Do it to death)\nAyo, Flipmode Squad, hell yeah\nHow we gon' do? (We gon' do it to death)\nHow we gon' do? (We gon' do it to death)", "image": "https://images.genius.com/74d986e571f31c27df8d6f3000e2079f.500x500x1.jpg"}], "artist": "Busta Rhymes"}