{"songs": [{"title": "Ghost", "album": "Tupac: Resurrection", "year": "2003-11-11", "lyrics": "[2Pac - Speaking]\nThe only way, for me to come back, is by Makaveli\nThat's it! All these motherfuckers stole from me\nI'm taking back what's mine\n\n[Slowed down voice]\nYou motherfuckers can't stop me (laughing)\nEven if I die, I'm gon' be a fuckin problem\nDo you believe in ghosts, motherfucker?\nReal live black... ghosts\nFeel me?\n\n[Verse One: 2Pac]\nSome say I'm crazy, these punk-ass cops can't fade me\nMama tried to raise me, but had too many babies\nPapa was a motherfuckin, joke\nUsed to find dope in his coat\nAnd nearly choked when he'd tell me not to smoke\nDaaamn, don't get me started\nMy mama smoked so goddamn much\nWhen she was pregnant I'm surprised I ain't retarded\nAt night I can't sleep, count sheep\nAs they pass through the glass of my neighbors five deep\nStarin at the wall, heard a scream\nWake up in the mornin'\nSee the blood in the hall from the murder scene\nDon't cry, just ask why, and try not to die\nAs I take you through a ghetto nigga's lullaby\nOn the corner, where the niggas slang they crack\nAnd the undercovers jack those that don't watch they back\n(Five-0) I daydream about the dope world\nTake a puff from the blunt and watch the smoke swirl\nMy mossberg goes BOOM, what's another plug\nSnatchin drugs, pumpin' slugs in these other thugs\n(GIVE IT UP NIGGA) Don't run out of breath\nEvery step could be death 'til you blast\nAnd be the last nigga left, then I'll be ghost\n\n[Chorus: 2Pac]\nDon't cry, just ask why, and try not to die\nAs I take you through a ghetto nigga's lullaby\nDon't cry, just ask why, and try not to die\nAs I take you through a ghetto nigga's lullaby\n\n[Verse Two: 2Pac]\nA seven-deuce full of niggas goes by\nThought I was trippin' the second time they rolled, by\nRecognized the plates, the faces looked familiar\nEverybody swear they know the nigga that's gonna, kill ya\nDon't murder me murder me, kill a nigga in his sleep\nLet me die as I rest in peace, deep\nBack to these niggas in the seven-deuce\nA Mac-10 out the window bout to let it loose, what could I do\nRun for cover and return fire\nDIE MOTHERFUCKIN DIE, hope your ass fry, don't ask why\nBut I let off everything I have\nAn empty clip, hit the ground as a nigga dash\nOn my ass was the motherfuckin cops now\nBarely breathin tryin to keep from gettin shot down\nBOO-YAOW is the sound, bullet whizzed by\nStill runnin like a nigga got nine lives\nDon't know why but I'm running to my fucking block\nTook a shot, tired of running from the niggas and the cops\nTime to be a ghost\n(Hey man, come the fuck on)\nAnd then we'll be ghost\n\n[Chorus: 2Pac]\nDon't cry, just ask why, and try not to die\nAs I take you through a ghetto nigga's lullaby\n\nFUCK THE POLICE NIGGA!", "image": "https://images.genius.com/6257fe15b02c727932e884339c27b0a5.600x600x1.jpg"}], "artist": "2Pac"}