{"songs": [{"title": "5 Deadly Venomz", "album": "Strictly 4 My N.I.G.G.A.Z...", "year": "1993-02-16", "lyrics": "[Intro: 2Pac & Stretch]\n(Laughs) We're going platinum nigga, we going platinum\nYeah, you got the Live Squad in this motherfucker\nWe get my nigga Treach from Naughty By Nature up in this motherfucker\nMy nigga Apache up in this motherfucker\n\n[Verse 1: 2Pac]\nMy Mossberg goes boom, gimme room, can I catch it\nTalkin' quicker then a vic that's tryin' to keep from gettin' blasted\nI had enough I put a hit upon them bastards\nBoo-yaa, turn this Benz into a casket\nNow they after me, prowling for a niggas bucks\nTime to see, who's the G, with the bigger nuts\nBuck buck, big up and livin' reckless\nNiggas with a death wish step in with a TEC and I'll wet this\nYeah this shit is hyper\nTrue to what I'm writing, representing and I'm striking like a viper\nHuh, I got my mind made up, I got my nine\nRing the alarm, and strong arm what's mine\nSome niggas need to feel me with a passion\nI'm old fashioned, run up on me, nigga, and get blasted\nWith five deadly venomz\n\n[Bridge]\n(Yeah 'Pac, fuck that, still hittin' 'em up with\nThat old deadly shit. Aiyyo Treach where you at?\nStep up and hit they ass up with the wickedness)\n\n[Verse 2: Treach]\nWe come to hit you with a sock full of Brooklyn\nTo the Onyx of your nose, punk is funky like skunk blunts\nStunk like funk cunt\nI come to take you on a war rough and rugged route\nAnd if another doubts I blow your fuckin' mother out\nAnd after she's crossed out\nI shout, \"I'm de MC wit de nasty mouf!\" and kick the bitch out\nSue me? I pay the lawyer for ya oh boy yeah\nPlus my style's ten to twenty fuckin' pounds more\nI take you quicker than a picture of a punk ya pickin' shit\nPickin' pockets with a razor stoppin' Russian rockets\nNot shoplift, I'm liftin' shop\nOnce you sound hot, 'cause if you ain't a perfect ten\nMy sign is stop!\nIt's twenty mother-crooked-fuckin' styles in 'em\nLike women I did 'em I'm in for deadly ready venom\n\n[Verse 3: Stretch]\nYeah, as I take a puff I get rough, Big Mad\nTo put it on, can't none come tougher see\nI'm down with the sound of the Squad hard, boom!\nBreakin' 'em down, I make 'em see their doom\nComing straight from the dome where I roam it's a job to\nRob and steal and runnin' from the coppers\nWho hold a, boulder, turn the gun controller\nStarted from a punk now to be a high roller\nYoungest, reckless, crazy, disaster\nMAC-11 blaster, and I run faster\nThan a lot of cops I can't be stopped till my head gets popped\nA lot of fuckin' bodies will drop\nIt's a disaster, I'm coming for the blood splatter\nI make 'em scatter, leavin' trails of brains and bladders\nBlowin' 'em out the frame with no shame\nGame tight, drop a body then get out of sight\nCount my loot after I shoot, leave my kicks up and it's\nSomething I don't wanna do, something that I never did\nI try to get him, I think I hit 'em, I lit him\nHe's out! A poison, a deadly venom\n\n[Bridge]\n(Yeah Mad, fuck that! You know how we do\nKnowhatI'msayin? Squad in effect, YG'z in effect\nNow you know a nigga like me gotta represent)\n\n[Verse 4: Majestic]\nOnce again, back to rip shit, quick on the flip tip\nThe psycho, represent the real to take the mic flow\nDeadly, rock a head G, check the melody\nNiggas can't touch me when I wreckin' G you better flee\n'Cause I'm gifted with a jab and a forty-four Mag\nSo nigga flip or take a trip in a body bag\nUhh, boom you slipped up, now you're zipped up\nYeah one more statistic, fronted and got ripped up\nNo joke, you be yolk, no matter how it sound\nWe're taking all fake niggas back to the stomping grounds\nLine 'em up single file, dome runnin' in 'em\nA nigga hit 'em with the venom, the fourth deadly venom\n\n[Bridge]\n(Nigga, yaknowhatI'msayin? Fuck that!\nI told you, we takin' over, yo 'Pac.)\n\n[Verse 5: 2Pac]\nFive deadly venomz verse five be the livest\nStrugglin' and strive, keep a nine in my waistline\nTake mine, you better bury me, G\nPunk ass niggas don't even worry me, see\nI got a Glock that say 'Pac run the block\nFuck the cops 'cause my gauge gets me... PAID\nAs I sit and reminisce about the old days\nHugging on my AK, fuck getting played, hey\nI say niggas need to get they mind right\nUntil they do I pop a clip and grip my nine tight\nNow it's on everyday could be my last day\nThat's why I blast on they ass as I passed let the glass spray\nFirst you had a mouth full of fronts\nNow your mouth's full of chunks, Pac's out puffin' blunts\nDeadly venomz\n\n[Bridge]\n(Hahaha, yeah pass that shit over here\nApache bout to clean shit up)\n\n[Verse 6: Apache]\nThrow up your middle finger! Start the track for the maniac\nOnly thing I'm givin out is black donuts and dirty backs\nLet me tell how you rough I get\nI pop shit behind your back get in your face and pop the same shit\nYou can't get in because my gate's bigger I'mma snake nigga\nMy act guards me so hard I pull the fuckin' trigger\nI'm a cinch in a clinch, your punch is like a pinch.\nTest the rhyme I'll knock your hairline back an inch\nFuckin' up pooh-butts, cut 'em like cold cuts\nChoke 'em with my boot lace, then leave 'em hangin' like old nuts\nClip up and move out, time to get 'em\nThat's the results of fuckin with the fifth venom in denim\n\n[Outro]\n(Yeah, yaknowhatI'msayin?\nFive motherfuckin deadly venomz, in effect for ninety-three\nNinety-four ninety-five all that other shit\nWe takin this motherfucker over this larger hit\nYaknowhatI'msayin? Follow us, come along. Yaknowhat I'msayin?\nWe takin this motherfucker over. TRUST. We out.)", "image": "https://images.genius.com/fb1da91ac989d8c57dfce412441800da.953x953x1.jpg"}], "artist": "2Pac"}