{"songs": [{"title": "ESPYs Conference Call", "album": null, "year": "2014-07-11", "lyrics": "Connor Shell:\n\nYou’re so vocal about how much you care about your hometown of Toronto and how much your friends and crew mean to you and the sense of responsibility you feel to put on for your city. Can you give any insight for what it must have been like for someone like LeBron to make that decision, and that ultimate responsibility?\n\nDrake:\n\nYeah, I mean, I think that for the last week and a half I’ve probably been bothering LeBron as much as the press has trying to figure out what his decision is going to be. I think we were all extremely intrigued by what stage of his life he’s in. I don’t think that there’s a better way to deal with it than how he just did. I think if we can give out an award at the ESPYS for incredible essay writing, I would definitely love to present that to him because I think what he just did was patriotic in its own way, was courageous and was just, to me, I think it’s going to be one of the most historic things of our generation.\n\nI’m just honored to know him and glad that I’ve gotten to, no pun intended, witness this moment for sure. I think it’s an incredible thing.  I actually woke up kind of late today, so I’m just catching on. It’s a great feeling for me. I can’t wait to get off this call and call him myself and tell him how proud I am because he’s been a friend of mine for a long time.\n\nShell:\n\nObviously, you’ve joined Saturday Night Live and we’ve had Justin Timberlake host the show. Are you going to take a more musical approach to the ESPYS than what we’ve seen in the past?\n\nDrake:\n\nI think obviously one of the talents that I’m able to bring to the ESPYS is music, but I’m just going to get up there and I want to just prepare a great night for people. I think we have prepared an incredible night for people. I definitely want to incorporate music, but I’m not there to put on a strictly music‑based show. Yeah, we definitely have some incredible pre‑tapes. Yeah, I think it’s just going to be a great night overall. I’m there to deliver a great hosting job.\n\nShell:\n\nWhat makes the perfect ESPYS host? We’ve seen some amazing people like Justin Timberlake and John Hamm and even LeBron James. What strikes the perfect balance between a sports fan and an entertainer?\n\nDrake:\n\nWell, I think what makes a perfect ESPYS host is obviously somebody that can fill the room with energy and joy for the people that are in the seats. But I think most importantly what I bring is the fact that I feel that I know the room better than any host before me just because so many of these guys I have personal relationships with. I think I’m going to be able to tap into some jokes that will be appreciated by my friends in the crowd and also the athletes that I don’t know.\n\nTo me, it’s just about knowing the room that you’re in and trying to have the right presence and trying to give these guys an incredible night which they deserve.\n\nShell:\n\nHosting a sports awards show, what do you feel is music’s role in sports?\n\nDrake:\n\nWell I said once in a rap song that deep down we want to be them and they want to be us as far as musicians and athletes go. I think that when I speak to any of my friends that play sports they’re always super into music, whether it be rap or other genres. My dream in life or my other dream in life that I’ll obviously never achieve was to go to college and be recruited and play in the league, so I think they’re synonymous in that way. We inspire each other, and I think that’s what really ties music and sports together.\n\nShell:\n\nThis is a question for the producer, and if possible I have a follow‑up for Drake. With the LeBron news and the decision that was so successful for ESPN, was there an actual attempt to get his announcement slated for the ESPYS? Did anybody reach out? Were you close?\n\nMaura Mandt:\n\nNo, there was not an attempt to have that be there. And with the decision, it wasn’t something we were looking to have that announcement be on the ESPYS. Certainly if LeBron wanted to announce on the ESPYS, I would have happily had him there. I think what the ESPYS is about is the sports world plays out over the year, and then we find the right person to help put that into perspective, and that’s what you look for the host for.\n\nWe’re going to be reflecting on the year, and LeBron is something that happened, so it will definitely be something that we’ll address in the show. But just like in sports, we don’t try to make that news happen. It unfolds.\n\nShell:\n\nDrake, in monologues hosts usually take jabs at those in attendance, and a lot of times in hip‑hop that’s kind of also a part of rap music and it’s always been. Do you see similarities to delivering jokes on stage, whether it be metaphorically or outright in hip‑hop?\n\nDrake:\n\nI think that’s a funny question. I think it’s a good fit. I definitely think that hip‑hop is a little more malicious than what any host is going for. I think we’re not trying to end people’s careers or make people feel bad in any way, and that’s kind of most of the time what problems in hip‑hop are about. So our night, like I said, is about being funny and about giving these guys a great time and celebrating sports.\n\nSo, yeah, I think there is definitely a difference. Though being clever with words is being clever with words, so that is one advantage that any musician has or any great writer has. But I think the end goals are a bit different.\n\nShell:\n\nYou’re also being aware of public perception. For instance, you Instagrammed the meme of yourself playing soccer, right, and you so like you definitely have, I don’t know how to put it, maybe a love triangle thing going on with Skylar and she’ll probably be there. Can we expect a joke or where you’ll mention it like you did with SNL when you did the whole dated Rihanna thing? Everyone loved it, so can we expect that now that you’ll be hosting the ESPYS?\n\nDrake:\n\nWell, I obviously don’t want to give away the material. But I do have a growing affection for Skylar, and I’m not sure she’ll be able to make it, but I’m sure I’ll give you a treat if you enjoy my past references. I’m sure, if I haven’t done it already, now that I know you’re looking for it, I might stick one in there, for sure. You never know.\n\nShell:\n\nOne of the things about ESPN and the ESPYS is the incredible amount of social media reaction there is during the shows and the build‑up.  Today, I don’t know if you realize this, but you’ve been the talk of social media because of the pictures that Chris Brown posted up. I just wonder about your feelings on that and if you can tell us what that means?\n\nDrake:\n\nWell, as far as the latter end of the question, I’d rather not comment on it, but I know that our goal is obviously the night of the ESPYS to completely take over the internet for everything that we do to go viral and for people to enjoy days or weeks afterwards. I think that is kind of the goal of anything in this day and age is to sort of have a life on the internet. That’s why I’m excited.\n\nWe’ve been working hard, like I said, on the pre‑tapes and on the monologue and on every aspect of the show just to make sure that it lives on past this night, which I can 100% guarantee it will.\n\nShell:\n\nIs Cleveland your new favorite sports city? How are you going to incorporate A. Wiggins, Manziel, and LB James into your ESPY segment?\n\nDrake:\n\nFirst of all, I’d like to say that despite what everyone on the internet thinks, I do not team jump. I’ve been ‑‑ in the past, I’ve always supported the player and not the institution unless it’s the Kentucky Wildcats or the Toronto Raptors. Those are two teams that I will never stray from. But what people have to understand whether it comes to soccer, whether it comes to football or obviously basketball, I have a lot of friends that play for a lot of different teams.\n\nSo it’s not that I’m team jumping, I’m just a supportive friend. With the recent news, of course I’m going to go ‑‑ of course I’m going to go watch games in Cleveland. If not for LeBron, who like I said has been a brother to me for years, I mean, we’ve got three kids from Toronto on one team, plus we have Manziel who, again, is part of our family and like a brother.\n\nSo I definitely have to look into some real estate in Cleveland and maybe make some trips this year. I might have to go spend a month out of the year there and watch my guys do what they do best.\n\nBut, yeah, like I said, my teams will always forever be who they are, but, yes, I will support the group that has shifted to Cleveland. I think that for Cleveland, a place that I’ve been time and time again touring, I just think it’s going to be greet. I really would love to see that city grow because they’re just a supportive group of people, and it is a great place, so I’m really excited.\n\nShell:\n\nSo the ESPYS is your second host gig this year. SNL was amazing by the way. So is hosting something that you’re trying to do more of or are you just working on more music? You have a lot to write about now that you’re a bachelor again.\n\nDrake:\n\nWell, actually, my status hasn’t changed, just to clear that up. I’ve always been out here coasting. But aside from that, the ESPYS is my main focus like SNL. When I commit to something, I don’t let my focus stray.\n\nSo for Maura to give me this opportunity to host, I don’t take it lightly. I put everything on hold to be ‑‑ to give the best performance that I possibly can at this awards show, and then from there, I have things coming up, whether it’s the OVO Fest or the tour with Lil Wayne, which is a real thing, which a lot of people don’t know if it’s a real thing or not, but it’s very real and it’s going to be very competitive. And then from there, I’ll figure out the next steps for me.\n\nI’m always working on new music, but the ESPYS is the main focus right now, and we’ll figure out what’s next afterwards.\n\nShell:\n\nOne thing we learned about you after hosting SNL is you’re a tremendous impressionist. I personally loved the Katt Williams and Lil Wayne.  With having so many friends and being friendly with people in the audience, can we expect you to break out any impressions during the show?\n\n\nDrake:\n\nYeah, I’m actually excited to say that I definitely have incorporated impressions in my performance, and that is something that I actually pride in that I studied for. I love finding a character and getting into that character, especially if I know the person or know their mannerisms or can really study their mannerisms. So, yes, I will be doing impressions during the ESPYS, and they’re good. I’m excited.  They’re great.\n\nShell:\n\nAre you bringing your lint roller?\n\nDrake:\n\nOh, yes. I think I’ll probably have it somewhere around. Maybe I should. I should bring it out on stage. You shouldn’t have said it on the call. You should have anonymously sent that tip in, maybe we would have used the joke. No, I think I’ll be lint‑free that night. I’ll have a stylist and hopefully there is no lint on any of my suit.\n\nShell:\n\nSo we know that you wore some custom Calvin Klein outfits for your tour. Are you planning on the same fashion wearing any Calvin Klein suits, and which stars are you in terms of sports world are you looking forward to what they’re going to wear?\n\nDrake:\n\nI’m not exactly sure what brands I’m going to be wearing. Right now I’m sort of still, like I said, very focused on the show. I’ll figure out the suit aspect probably next week and what particular designers I’ll be wearing. But I’m more excited about the costumes and the sort of athlete outfits that I’ll be draped in for you all to admire. So that’s really what my main focus is, but I’ll get my suits together.\nI’m also excited to see what the athletes are wearing through the show because that can make for a joke in itself. I might just cut to somebody and I won’t have to say anything.\n\nShell:\n\nYou have so many relationships with a lot of athletes. Is there anyone in particular that you haven’t met yet that you’re looking forward to meeting or have any of your friends that you’re with already given you any advice about hosting?\n\nDrake:\n\nWell, I mean, I’ve gotten a lot of well wishes from my friends. You know, one of my mentors who is not an athlete, but obviously Jamie Foxx, a previous host and a big reason why I asked to be a part of this, just because that performance that he gave, I believe he hosted twice or three times, oh, twice, right. It was inspiring to me for so many reasons because of how he incorporated music, but how funny he was and how commanding his presence was. So his mentorship and advice has been great to me. Is there anybody that I’m looking forward to meeting?\nI mean, yeah, I was going to say, I’ve never met Skylar. I’m sure it will be extremely awkward when I do. But I guess that would be my answer if she manages to show up, which she probably won’t. Her boyfriend will probably tie her down to a chair or something. But, yeah, if I ever get to meet her I probably owe her an apology right off the bat. It’s been all in good spirits. But, yeah, that is the one person I’d like to meet.\n\nJust for that last person, I also want to meet this guy that says that he lost because he listened to my music. I want to meet that guy and just look him in the eye and see exactly who he is as a man and size him up and then chop him right down. Yeah, Nick whatever his name is, because he didn’t win, so that’s how he’s going to be remembered. Nick whatever his name is.\n\nShell:\n\nCan you talk a little bit about the collaborative process in preparing for the awards and how many of the ideas are coming from you, and how many are coming from the writing staff? Also, if you think writing a joke is harder than writing a song?\n\nDrake:\n\nOh, very good double question. Well, for the first part, the collaborative process has been absolutely incredible. We have such a great team from obviously the chief boss lady Maura all the way down to the writers and everybody that’s involved. Everyone involved has been incredible to work with. We’ve been at it now for three months, I think, just on and off, meeting and talking and brain storming. As far as ideas being mine, I am very happy and proud to say that a lot of the ideas that I submitted are what I’m going to be performing or delivering on Wednesday night. Whether it be music, jokes and pre‑taped pieces, I was heavily involved in the input of what to deliver and how to deliver it.\n\nIs writing a joke harder than writing a song? I think that because of the way I write songs which is very honest, raw emotion about my life, I think that writing a joke becomes a little easier for me because it’s just a little more lighthearted than your average brooding Drake song as the public would deem it.\n\nBut, yeah, I mean, all my music is so honest, that sometimes it’s hard to tap into that and be that honest with yourself. When you’re able to be lighthearted and joke around, I enjoy it. It comes a little quicker than songs do.\n\nMandt:\n\nI’d like to make a comment on the collaboration process. Having worked on the show a number of years, one of the things that really resonates in the content is when it’s authentic from the person delivering it. Being able to have the access we’ve had to Drake from the first time we met and spoke and had his input on what’s coming up with stuff that he wants to do and us being able to go back and contribute and have them come to life, it really elevates it, so it’s definitely been a collaborative process on his end and being involved.\n\nWe had a shoot the other day from one of the skits, and on set he was coming up with stuff, and you guys will see it and know what I’m talking about when you see the show. But there was no script in certain areas of it. It was really like an improv session, and it was one of the greatest things to be able to see. I’m really excited to have that be seen by everyone on the show.", "image": "https://images.genius.com/e8e4af9d70633a1703ccd3faf671871c.640x640x1.jpg"}], "artist": "Drake"}