{"songs": [{"title": "Which One of You", "album": "Tha Blue Carpet Treatment", "year": "2006-11-21", "lyrics": "Yes.. greetings loved ones\nYou inside the Nine Inch Dick, experience\nFor the 2000 plus S-I-X\nOh we're still in it\nDig this\n\n[Snoop Dogg]\nShe the type of girl to play (which one of you bitches like me?)\nI met her just the other day (which one of you bitches like me?)\nShe really didn't wanna give me no play (which one of you bitches like me?)\nAs I walked up she just turned away (which one of you bitches like me?)\n\n[Nine Inch Dix]\nI saw you hangin with yo' friends (which one of you bitches like me?)\nThey was lookin at my friends (which one of you bitches like me?)\nBut which one of y'all was checkin out this pimped-out playa?\nGirl you don't have to pretend\nWhoa whoa whoa whoa, baby\nI seen your homegirls jockin my riiiiide\nAnd ooh, baby\nWhich one of y'all will step off insiiiiide - and run away with me\n\n[Hook 2X: Nine Inch Dix]\nWhich one of you bitches like me?\nWhich one of you bitches, bitches!\nWhich one of you bitches like me?\nWhich one of you bitches, bitches\n\n[Snoop Dogg]\nWe was at the party like (which one of you bitches like me?)\nI was tryna live the naughty life (which one of you bitches like me?)\nMan them skinny girls was everywhere...\nI had to stop, pause and fix my hair - hand me my mirror Jerome\nShe was big but she was cute (which one of you bitches like me?)\nAnd I noticed she had major loot (which one of you bitches like me?)\nHo, ho, ho - it really didn't matter what she weighed...\nSee cause a big girl loves to play and play a playa, playa\n\n[Nine Inch Dix]\nHey! Bitches! I need yo' attention\nWho wanna ride in a pimped-out Cadillac and say hey!\nDelicious, you look sweet like candy\nI gotta ride shotgun with a bad bitch in the back\nNo matter what you see, or baby what you saw\nIf you stand tall, we gon' ball through it all\nAnd if the police come, don't let me take a fall\nPlease stuff this work, in the crotch of your drawers\nWhich one of you like me?\nI heard she was a major ho, so unforgettable\nNext time I see her though, I'mma let her know\n\n[Snoop Dogg]\nWe been drinkin havin fun, me and you, one on one\nDoin thangs, holdin hands, makin plans, help me sing\n\n[Snoop + Nine Inch Dix]\nWe been drinkin havin fun, me and you, one on one\nDoin thangs, holdin hands, makin plans, I'm your man\n\n[Ad libs for 15 seconds]\n\n[Hook] - fades out w/ ad libs", "image": "https://images.genius.com/9eeff8d4aa3579798c6d6f74d21fad47.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}