{"songs": [{"title": "Heavy", "album": "Boiling Point: K.O.D. Collection", "year": "2012-10-30", "lyrics": "[Intro]\nDeformity, a bodily malformation, check\nDistortion, or disfigurement, check\nA Deform, person or thing, check\nGross, ugliness, check\n\n[Verse 1]\nI don't wanna take this, I don't wanna carry this, I don't wanna lift this\nEveryday, when I wake, wishin' was a way that I can rip this\nOff of my shoulder off of my back, like a big boulder got me off track\nI don't wanna be seen lookin like that\nI'm looking at it, it's mean lookin right back\nUgly, bloody, pussin', heavy\nWay more sinister than Leatherface, Jason or Fuckin' Freddy\nAnd that shit weighs me down, got me going crazy now\nLazy round me place, cause I got shit right side of my face\nHow did I get it? How did I grow it? How do I cock back and just blow it\nOff? Surgery yes you know it cost and I ain't goin out to show it off\nI'm just stuck in here, with this fuckin' weird stuff in near\nCrushin', pussin', bustin' till it up and clears\nI'm ready, it's wicked, it's gotta be deadly\nIt's everything you could imagine, bad, twisted, evil and medley\nDown into eternal fire, this is where it lead me\nCan hardly hold it up because this thing is so fucking heavy\n\n[Hook]\n(Ewww, that's gross, yuck, what's that?\nOh my god, disgusting, repulsive, what the fuck?\nIt's not a tumor, fuck the rumor\nI need more to go, stop Staring at this\nMutherfucking side show)\nHEAVY (Everyone you love got needs)\nHEAVY (I'll shove start to buckle at the kness)\nHEAVY (My lord said this slow heal carry\nAnd if it don't then it might get scary)\nHEAVY\n\n[Verse 2]\nCha!\nGotta cover it up, gotta go outside to get food\nHow when the smell is like shit stew?\nThe way people are staring and lookin it gets cruel\nBad when I'm shoppin', at the walmart\nThey be laughin', then a brawl starts\nCause they wanna pick on a muthafucker\nWith deformities, bless yall heart\nI'm sick of it, when it's on my back\nI can't even get a women to kiss on this\nFace, I don't even want to live on this, place\nBecause all people givin' is hate\nAnd your really gonna get it bad if your, disfigured\nThe more these sick gigglers\nPointed my heavy load it gets bigger\nThey call me hunchback and I wish they wouldn't taunt that\nThey be lookin at a nigga like I woke up\nAnd showin straight up shittin' in their lunch sack\nKids, grown ups, dogs, cats\nAll be lookin and pointing at this deformity on my back\nTaking over me, I'm slowly, turning into it\nThis repulsive, nasty, heavy, sick, humongous pile of shit\nUnder my skin, infecting my blood\nLike I have some kind of disease, it's\nBig and bulgin out of my jacket and everybody sees it\n\n[Hook]\n\n[Verse 3]\nWhat is it? With this load I carry there's problems in my life\nGot big problems with the IRS and problems with my wife\nGot a lot of problems with this music career, problems with my mom\nAnd I gotta solve 'em quick they fallen on me\nIt's a problem with this shit on, and it's heavy\nWhen everybody depends on you to be the shot caller\nAnd you pushin, tryin to get all of your people\nOver the wall, but the shit got taller\nBut you tough and determined, you rough and you learnin'\nYou cannot do if you not baller\nSo you get it and hit it one after another\nAnd look - the lump got smaller", "image": "https://images.genius.com/b49e837c9c7732be929537953b47ac6e.700x700x1.jpg"}], "artist": "Tech N9ne"}