{"songs": [{"title": "The One", "album": null, "year": "2010-08-26", "lyrics": "[Hook]\nLa la la la laaah\nThey ain't got nothing on me\nHey hey\nLa la la la la la la\nThey ain't got nothing on me\n\n[Verse 1]\nThe lil engine that could\nThis lil nigga is good\nRappers claiming they sick I heal niggas for good\nCause homie I’ve been ill\nSince Hilfiger was hood (ha-ha remember that? Hilfiger cargoes’)\nWon't admit it but if you was a real nigga you would\nAnd now I got your chick nigga\nShe'll get out the hood\nAnd no I would peck her but she peck on my wood\nAnd she do it so good\nI gotta thank her\nI got her ass clapping that’s how I congratulate her\nShe like to roll the dro up in the bed go higher\nPepsi cola Michael Jackson and her head so fire\nI love this lil redbone Maya\nShe be getting louder than a set of Dr Dre head phones try her\nIf you ever need her\nShe got a man that don't never see her\nAnd when his phone ring he looking like \"this better be her\"\nThis unrelated but I wish I could have met Aaliyah\nAnd when I get to heaven, homie I better see her\nBut what you think it's really like behind the pearly gates\nNo murder rates all the bad shit we heard of race\nAnd can we still do the fun shit we did love and if so\nThen do you think some angels work in strip clubs\nWell if so I be trying to get my dick rubbed\nMake it rain filling up their tip cups\nThrowing ones...\n\n[Bridge]\nYeah nigga I'm the one\n(Hey hey)\nSay I’m the one\nYeah boy I'm the one\nHey yeah\nNow I'm the one thus meaning no one must try\nNo two no three no four, no why?\nCause I'm the one\nYeah nigga I'm the one\n\n[Verse 2]\nNow every nigga keep talking keep walking\nThis the Ville where the real killers don’t speak often\nBut leave you leaking on the concrete police talking\nMy flow Nieman Marcus\nYou're so flea market so don't be starting cause Cole retarded\nI be shitting on my niggas and my dough be farting\nThey won’t even say excuse me\nUsually the groupies don't amuse me\nJust wanna say I rate the tape my paper my loosely(?)\nBut can I take a lil dip in your Jacuzzi\nNow I ain't Biggie but I got you feeling +Juicy+\nOhh she feeling like she never before\nI bet she never forget me like an elephant won't\nAnd yeah my name J.Cole I got a hell of a flow\nI guarantee I'm gon sell em if you ever been poor\nOr if you're trying to be rich\nAnd this economy shhh if anything making money man\nIt’s probably this\nBoy I'm the one...\n\n[Bridge]\n[Hook]\n\n[Third Verse]\nThe lil engine that could\nThis lil nigga is good\nRappers claiming they sick I heal niggas for good\nA couple of yall ain't took a field trip to the hood\nAy me I'm Fresh Prince, I'm Will Smith to the hood Baby!\nAin't sayin names but we not the same\nAll that money and the fame don’t change the fact that u lame\nMight wanna grab you a chain wanna tip up your hat\nMight wanna purchase some game homie your shit is so wack!!!\nI got my finger on the trigger tell that nigga hold datt\nBoy I’m picture perfect baby you can check the Kodak\nHey so anything you can do I can do better\nAnd any chick you can screw I can get wetter\nI’m young black get to live my life on the run!\nBet ya bottom dollar before I’m done\nThey say that I’m the one\nYeah nigga I’m the one HA!!\n\n[Bridge]", "image": "https://images.genius.com/2cd936e786e1ab454043327d585c7702.1000x1000x1.jpg"}], "artist": "J. Cole"}