{"songs": [{"title": "American Dream", "album": null, "year": "2011-11-06", "lyrics": "[Verse 1]\nUhhn!\nLike muthafuck all y'all\nMr. Mike Tyson flow, uppercut all y'all\nStep into my ring bitches, ding ding bitches\nClick clack pow pow\n\n[Mike Tyson talking]\n\nUhhn!\nLike muthafuck all y'all\nMr. Mike Tyson flow, uppercut all\n\nUhhn!\nLike muthafuck all y'all\n\nUhhn!\nLike muthafuck all y'all\nMr. Mike Tyson flow, uppercut all y'all\nStep into my ring bitches, ding ding bitches\nClick clack pow pow ping ping bitches\n\nI'm the dream machine I mean king vision\nI can see through yo' scene like clear screen, hear me?\nTo a lion you are just deer meat\nFear God fear me ser-ious us\nP.E. YM them try them and die when I say so\nWeezy F. for Fuego\nIt's all gravy tryna build like Legos\nBetta \"Let Go My Ego!\" with some breakfast on the table\nYeah!\nAnd I don't know how fake feel nigga cuz all my life I been a real nigga\nFuck ya girlfriend, fuck ya homie too\nI drop bombs I'm in the booth in a army suit\nAnd I'm armed to shoot and I'm a marksmen too\nAnd you're the target, oops!\nAnd everything gets better in time and time is forever\nAnd muthafucka it's my time and I'm better\n\n[Mike Tyson talking]\n\n[Verse 2]\nHo I go so hard\nI'm so gone my I.D. is a postcard\n\nI travel like B-ball with no calls\nI play my roll and listen out for the roll ball\nThis is a movie and every movie must go off\nBut this gangsta doesn't die like O-Dogg\nSay what up Blood!\nWhat da lick Reid!?\nFive star general and the six speed\nStill hood like thick cheese bitch please\nHim squeeze quicker than the wind breeze\nBullets that a trim trees\nSimply shoot till its empty if be turn dat thick cheese to swiss cheese\nFolla me! Folla me!\nFuck around and see a whole notha side of me\nI separate yo' body with them hollow tips biologist\nPhotographies, picture me in yo' bedroom with a mask on\nPistol to yo' head while you puttin' yo' pants on (Hurry up nigga)\n\nPayton Manning offense Singletary defense\nSuper-duper-extra-much-really-very-street shit\nThat is how I keeps it rest in piece Pimp C\nI do it how I do it cuz I know my nigga see me\nAnd I'mma hold it down bitch yeah that crown fit\nThe boy got a flow that you can drown in\nWhen you in the water watch them sharks\nWhen you in the water watch dat salt\nYoung Carter no floss that was so raw ah\n\n[Mike Tyson talking]\n\n[Verse 3]\nHahaha!\nFuckin' right I'm a monster\nSharper than a blade like Sticky Fingers Sonya\nMortal Kombat Street Fightin' like E. Honda\nMurk ya and da dummie dat signed ya what's really\nFireman spit gasoline on ya contract\nFuck a pen I need a match fuck a bitch I need a batch of bitches\nY'all niggas act like a bunch of bitches\nBlood bitches leave you in a tub of blood\nBitches young niggas, Young Money, young niggas, fuck pistols\nWe at yo' window with scud missiles Young Carter\nBig nuts and they hung farther than ya father's\nUhahaha!", "image": "https://images.genius.com/f903dae2533e450c8d3cb233aa846020.745x745x1.jpg"}], "artist": "Lil Wayne"}