{"songs": [{"title": "I Knock You Out", "album": null, "year": "2011-04-06", "lyrics": "[Verse 1: The Notorious B.I.G.]\nNotorious is glorious in the sack, hit skins from the back\nPut my thumb up in the ass crack\nBrooklyn freaky nigga with the most stuff\nI’m Jesus pops, Mary just blame Joseph\nYou should see her drink the semen, she suck a mean one\nLeaving them three apostles scheming, see when, BIG fuck a bitch\nBIG duck a bitch quick fast\nDick to ass, don’t hesitate to split fast\nYou know what’s up, here’s a quarter and a buck\nMy steps is kinda creaky, try not to wake my moms up\nCause when I bust, I lick shots like a shotty\nThats why nut is drippin all over your body!\nYou know what’s up!\n\n[Hook: Busta Rhymes]\nB.R. and B.I. get cream, people always sayin’ what the hell does that mean?\nBitches always see me and they can’t understand how I once a little boy and became a man\nNow, as for the way we make em scream and shout, bitches\nOne by one I knock you out, bitches\nOne by one I knock you out, bitches\nOne by one I knock you out, bitches\n\n[Verse 2: Busta Rhymes]\nYou’re dippin your hand in the grab bag\nStopping and than I drop it, and pop em, dig up all in your ass bag\nShe giving me head all up in the back of the damn cab\nThe meter running hoping shawty paying the damn tab\nShe how the ass drag\nThis shit big, thats why we fuck em New York all the way down to Baghdad\nStabbing the pussy and jabbing like I’m Zab Judah\nAnd plummet her pussy with plungers like I’m Roto Rooter\nBeat the pussy til the shit flab\nAnd wear it out til it swole and the coochie smelling like king crab\nThis type of dick is something this bitch never had\nAnd make her swollow the dick til the bitch gag\nGet mad, chick grabbing all over my jonhson, Charles Bronson\nBig slab of meat, hungry and fresh of a monthly so she had to eat\nThrowing me the ass and we ain't even have to speak\n\n[Hook]", "image": "https://images.genius.com/54314abfbbbf16253d72455428cc44e6.834x834x1.jpg"}], "artist": "Busta Rhymes"}