{"songs": [{"title": "Late Nights", "album": null, "year": "2016-04-20", "lyrics": "[Hook]\nLate night on the move, what you bitches wanna do?\nWe can do a hotel or get up in a swimming pool\nSet up on the mountaintop, let you get a hella view\nOnce you get the diznick, you do what I tell it to\nAin't no telling like Jack told Helen\nYou can kick it with a he-she or chill out with a felon\nI'm a go-gorilla not your average bitch nigga\nAll I want is your money but I just might hit up\n\n[Verse 1]\n[?] money gone\nGot your bitch on my cellphone\nTryna get with a nigga but I'm 'bout gone\nGone like a motherfucker, really not trippin' man\nI'm fuckin' with these hoes and I'm getting all these bitches man (bitches man)\nWith the game of the players and and I'm only [?]\nBig fame with the game, man I'm certified\nWon't say, Rosé went to her defense\nDon't say nothing nigga that's my bitch\nHoes say late night when it fall apart\nThey say and I took her from you in the dark\nInner freeze and I end up with the car keys\nHad to put the bomb weed, as I break a bomb bitch\nAnd they say you roam in the centerfold\nBut she bomb and she grown and she wanna go\nSo I put her in the back of a Sprinter Van\nRent-A-Center [?] van, yeah I went up in her man\n\n[Hook]\nLate night on the move, what you bitches wanna do?\nWe can do a hotel or get up in a swimming pool\nSet up on the mountaintop, let you get a hella view\nOnce you get the diznick, you do what I tell it to\nAin't no telling what Jack told Helen\nYou can kick it with a he-she or chill out with a felon\nI'm a go-gorilla not your average bitch nigga\nAll I want is your money but I just might hit up\n\n[Verse 2]\nSee on the late night tip, I know a lot of y'all  even know what it is, but let me talk to the bitches for a minute. Yeah, excuse my French, yeah, real spit. See here's the thing right here baby, now when you with a mac you gotta get maced and when you with a pimp you gotta get pimped but when you with a player you gon' get played. So which one is it? Cause it's late night, choose up. Slide up outta them store shoes and slip into these hoe shoes. Yeah, like Pimpin' Silky say, see about it. Haha yeah, it's late night, it's real late, it's too late to be talking. I mean it's too late for anything but uh...doing what we came here to do, so let's get it\n\n[Hook]\nLate night on the move, what you bitches wanna do?\nWe can do a hotel or get up in a swimming pool\nSet up on the mountaintop, let you get a hella view\nOnce you get the diznick, you do what I tell it to\nAin't no telling what Jack told Helen\nYou can kick it with a he-she or chill out with a felon\nI'm a go-gorilla not your average bitch nigga\nAll I want is your money but I just might hit up", "image": "https://images.rapgenius.com/366ee581b4a431bfc4d43e74e8970fa1.600x602x1.jpg"}], "artist": "Snoop Dogg"}