{"songs": [{"title": "Just Lose It", "album": "Encore", "year": "2004-09-28", "lyrics": "[Intro: Eminem]\nDown down down\nDown down down\nDown down down\nDown okay\nGuess who's back, back again\nShady's back, tell a friend\nNow everyone report to the dance floor\nTo the dance floor, to the dance floor\nNow everyone report to the dance floor\nAlright, stop… pajama time\n\n[Verse 1: Eminem]\nCome here, little kiddies! On my lap!\nGuess who's back with a brand new rap?\nAnd I don't mean \"rap\" as in a new case\nOf child molestation accusations\nAh, ah, ah, ah, ah, no worries\nPapa's got a brand new bag of toys\nWhat else could I possibly do to make noise?\nI done touched on everything but little boys\nAnd that's not a stab at Michael\nThat's just a metaphor, I'm just psycho\nI go a little bit crazy sometimes\nI get a little bit out of control with my rhymes\nGood God, dip, do a little slide\nBend down, touch your toes, and just glide\nUp the center of the dance floor\nLike TP for my bung-hole\nAnd it's cool if you let one go\nNobody's gonna know; who'd hear it?\nGive a little \"poot poot,\" it's okay\n(*fart*) Oops, my CD just skipped\nAnd everyone just heard you let one rip\n\n[Chorus: Eminem]\nNow I'm gonna make you dance\nIt's your chance, yeah boy, shake that ass\nWhoops, I mean girl… girl, girl, girl\nGirl, you know you're my world\nAlright, now lose it! (ah ah ah ah ah)\nJust lose it! (ah ah ah ah ah)\nGo crazy! (ah ah ah ah ah)\nOh, baby (ah ah) oh, baby, baby (ah ah)\n\n[Bridge 1: Eminem]\nWell, it's Friday and it's my day\nJust to party all the way 'til Sunday\nMaybe 'til Monday, I don't know what day\nEvery day's just a holiday\nCruisin' on the freeway, feelin' kinda breezy\nLet the top down and my hair blow\nI don't know where I'm goin', all I know is\nWhen I get there someone's gonna touch my body\n\n[Verse 2: Eminem & Dr. Dre]\n'Scuse me, miss, I don't mean to sound like a jerk\nBut I'm feelin' just a little stressed out from work\nCould you punch me in the stomach and pull my hair\nSpit on me, maybe gouge my eyes out? (Yeah)\nNow, what's your name, girl? What's your sign?\nMan, you must be up out your mind\nDre (ah ah) beer goggles, blind\nI'm just tryin' to unwind, now I'm…\n\n[Chorus]\nNow I'm gonna make you dance\nIt's your chance, yeah boy, shake that ass\nWhoops, I mean girl… girl, girl, girl\nGirl, you know you're my world\nAlright, now lose it! (ah ah ah ah ah)\nJust lose it! (ah ah ah ah ah)\nGo crazy! (ah ah ah ah ah)\nOh, baby (ah ah) oh, baby, baby (ah ah)\n\n[Bridge 2: Eminem]\nWell, it's Tuesday and I'm locked up\nI'm in jail and I don't know what happened\nThey say I was runnin' butt-naked\nDown the street screamin' (ah ah ah ah)\nYour honor, I'm sorry, I don't remember\nAll I know is this much, I'm not guilty\nThey said, \"Save it, boy, we got you on tape\nYellin' at an old lady to touch my body!\"\n\n[Verse 3: Eminem]\nNow this is the part where the rap breaks down\nIt gets real intense, no one makes a sound\nEverything looks like it's 8 Mile now\nThe beat comes back and everybody lose themselves\nNow snap back to reality; look, it's B. Rabbit!\n\"Yo, you signed me up to battle? I'm a grown man!\"\nChubba-chubba-chubba-chubba-chubba-chubba-chubby\nI don't have any lines to go right here, so chubba Teletubby\nFellas! (what?) Fellas! (what?)\nGrab your left nut, make your right one jealous (what?)\nBlack girls, white girls, skinny girls, fat girls\nTall girls, small girls, I'm calling all girls\nEveryone report to the dance floor\nIt's your chance for a little romance or\nButt-squeezin', it's the season\nJust go (ah ah ah ah); it's so appeasin'\n\n[Chorus: Eminem]\nNow I'm gonna make you dance\nIt's your chance, yeah boy, shake that ass\nWhoops, I mean girl… girl, girl, girl\nGirl, you know you're my world\nAlright, now lose it! (ah ah ah ah ah)\nJust lose it! (ah ah ah ah ah)\nGo crazy! (ah ah ah ah ah)\nOh, baby (ah ah) oh, baby, baby (ah ah)\n\n[Outro: Eminem]\nTouch my body\nTouch my body\nOh boy, touch my body\nI mean girl, touch my body", "image": "https://images.genius.com/f1955468f27f52ebab882ea438c00bd1.1000x1000x1.png"}], "artist": "Eminem"}