{"songs": [{"title": "Who Shot Ya (Freestyle)", "album": null, "year": null, "lyrics": "[Intro: Jay-Z]\nTurn the music up, uh uh uh, turn the music up\nOld school, new school, need to know this\nI burn like Left Eye Lisa Lopes\nBurn slow like blunts of hydro\nJigga Man, BK shit, y'all know\nJigga Man, ya heard? The fugitive\nAllow me to vent on this Clue shit\nAllow me to say thanks to all the people for all their support, and your prayers\nAnd all the people that pre-judge me: Fuck you, suck my dick...\n\n[Verse 1: Jay-Z]\nD.A. act like a nigga starvin' for Jay\nIf they lock me in a cage, fuck it, party away\nI'm still hot, I'm still S-dot ya'll\nStill got millions buried in the sock drawer\nStill holdin' my own on the corner nigga\nWhat don't kill me can only make me stronger nigga\nAnd when I get back home\nGet your ass up out the throne\nIt's just goin' back to the way shit was\nI'mma stay hot no matter what my shit does\nI could drop a straight dud, I'mma stay up\nNiggas tryin' break my will\nYou know that ain't my steel\nI'm Destiny's Child, my fate's been sealed\nYou're dealin' with a higher power\nI'm like Dwight Eisenhower\nMy life can move a thousand miles and hour\nReflect me folks\nAs my world turns like the wheels on a bicycle spoke\nIt's much deeper than a soap, it's a constant drama series\nAll they see is money, they want me to blind the jury\nAll this bullshit can make the mind weary\nBut my theory is the sun shines clearly\n(The Sun will shine clearly!)\n\n[Verse 2: Jay-Z]\nNow everybody wanna rhyme like Hov\nCause I rhyme like I be rhymin' in the Rov'\nClimbin' in them hoes\nMy minds like the diamonds, I'll blind you at them shows\nI don't shine, I glow\nI remind you of that dough\nDon't I? Murder niggas won't I?\nMy persona, hustler turned rapper, smell the crack aroma\nSend shots like toma! in any language\nLeave niggas in a coma when I'm bangin' that Fifth\nGet chicks lit off Coronas and bamboo spliffs\nAnd get the camcorder to camcord their hand movements\nAnd for what? Ya'll actin' like ya'll better than Hov\nYa'll niggas should open up for the Letterman show\nNiggas is funny\nAll I do is get money and ya'll niggas sound funny to me\nEverybody's rappin' like they better than Hov\nBut that shit's real funny to me\nI'm at the forefront of this rap shit, truth is truth\nLook around at all the platinum, proof is proof\nListen to how niggas is rappin', thats due to who?\nBut I'mma let niggas live cause it's beautiful\n\nLive niggas...\nJigga Man ya heard? Clue... Duro...", "image": "https://images.genius.com/bf0f68ee56f29c8542ad805c6419682b.676x676x1.jpg"}], "artist": "JAY-Z"}