{"songs": [{"title": "No Pretending", "album": "The Wonder Years", "year": "2011-09-27", "lyrics": "[Intro: Raekwon]\nYeah, yeah you already know man, for real man\nFrom the projects man, all the way to motherfucking\nThe other side of the world, and shit\nYou know, 9th Wonder on the track\nBig, big boy style, you already know\nLouis Rich man\n\n[Verse 1: Raekwon]\nFrom the Benz to Impalas, a fistful of cash\nA bank account, mad thick, quick to hem you, and blast\nInstead of maxing in the winter, I'm in Japan with my kin\nHydro spraying a blunt, while Duke do the glasses\nIt's evident we're comical, quick to\nChange up the slang, and bring the beef to you\nJust like McDonald's do\nFronting raw, sit behind the bulletproof wall\nCount my money, go to war, pull out while fucking my brawd\nI'm no industry nigga that suck dick, I only write checks\nGet out of line I'm striking the WIC, pull a viper out\nStunting on the beaches, ocean pacific gear\n........run the world with my girl it's like sex and the city\nDouble Aston, rub my dick, fuck with my titties\nYo bitches that love you, that's wonderful, what it do now?\nBut don't pretend it don't look comfortable\n\n[Bridge x4]\nBut don't pretend it dont look comfortable\n\n[Sample Hook by 9th Wonder]\n\n[Verse 2: Raekwon]\nAy yo back to blowing holes in the microphone pole\nI do it easy, with 41 years of my soul\nI run around high, and use it like a lullaby\nGone with the wind, with Asics on my feet you can smell the Glock\nCousin stay buzzing, from here to Toronto\nThen from there to Buenos Aires, sunk in the congo\nAll kind of colorful brims,trend big, what it do, yeah\nYou got money? You welcome to share....keep change\nDwell on recollection, reflections for days\nAnd slanging gats in the buildings for sections\nSwim through money like I'm Jewish\nCruising around salt waters, flows don't blow through no sewers\nYou hungry? Hit me on the hip. You smell me?\nFake niggas sitting on my whip you tell me?\nAnd I got it premiere, stay winning\nRespectable real,rugby rap on the low no pretending\n\n[Bridge x3]\nRugby rap on the low, no pretending\n\n[Verse 3: Big Remo]\nCall me Breezy, short for Big Remo\nCall up a breezy, tell her to send 3 more\nAs in kilos, pies be gambinos\nAuto-pilot im on grind, no sleep mode\nAuto signing, no diamond....wood piece on\nDezzy underneath arm, in case I gotta beast on em'\nYou soft like a threechon....Pussy get beat on\nCherry street fairy around the way, I'm legendary nigga\nAsk around the three-four...\nI run with the billas, dealers, killas, lamas, gorillas, pretenders\nFake niggas you ain't get the memo?\nTry to form an alliance with the lion out of Carolina\nI can speak for em', the jays that I unleash on em'\nAnd they don't capeesh, they hem'd up to see\nSo I respect the street, it's not a game or for thing shit\nIm a star, linin' with Gods, Im shining..It's hard\n\n[Sample Hook by 9th Wonder]", "image": "https://images.genius.com/8d727a22a4d1d05ff7dc9a2ed5ca0c53.1000x1000x1.jpg"}], "artist": "9th Wonder"}