{"songs": [{"title": "Antisocial", "album": "Burrrprint (2) HD", "year": "2010-03-13", "lyrics": "[Hook: Gucci Mane]\nBaby, you don't have to treat me all anti\nWhy you wanna put me on standby?\nI can't lie, girl you're hotter than a campfire\nWe can stay up all night like vampires\nComplement each other like burgers and french fries\nIn the last minute I done thought about you ten times\nFine on the out but she pretty on the inside\nAnd every since she left it's like my heart died\n\n[Verse 1: Gucci Mane]\nBaby I think you can bring out Gucci's other side\nShe said, \"How you don't you trust me, you did a homicide?\"\nThen said, \"I got a boyfriend who I can't put aside\nEven though the grass so much greener on the other side.\"\nAnd every man like what he can't have\nIt's funny but I came back\nBaby girl so bad, diss me but I ain't mad\nWhy you wanna tease me?\nYou should wanna squeeze me\nHomie ain't the kid, baby he could never be me\nHow you wanna go and act anti-social\nBet your man don't know you like I know you, so true\nMaybe one day babe you gon get your mind right\nAnd if you looking for me you can find me in Atlanta\n\n[HOOK]\n\n[Verse 2: Gucci Mane]\n(Well damn!)\nOnce upon a time a long time ago\nI had a bitch but she felt she had to let me go\nCalled me and then she came by and said, \"Shit\nYeah you got talent but I'm a bad bitch.\"\nBut now when I see her shorty whole swag switched\nI walk right by her like she don't exist\nHer car broke down and it can't get fixed\nHer swag broke down and her bag counterfeit\n(Well damn!)\nThat's not Gucci, baby that's floochy\nRemember 2000 you was acting all booshie\n9 years later and you're best friend choosing\nI scooped her in my phantom and I took her to the movies\nGucci don't gotta act anti\nTold her she can have me when she want,that's when she fantasized\nTold her I can't talk to her cause I got that man pride\nEver since I left baby girl told me her heart died (Gucci!)\n\n[HOOK]\n\n[Verse 3: Mylah]\nExcuse me if I sound a little crazy\nBut just wanna be good to my baby\nCause he been holding me down\nAnd putting it down\nHe give me everything I don't need no one around\nBut you're saying you can give it to me better\nGet me hot like it's July and I'm rocking a sweater\nJust for hitting the road\nWould you women let go\nSay you got 20/20\nHer man's 2004\nMaybe I'll give you a try\nAnd keep it low\nI could let you ride\nSomething like a test drive\nSee baby I ain't so anti\n\n[HOOK]", "image": "https://images.genius.com/c1e86882e49586297dcbe8c6885a8b32.1000x1000x1.jpg"}], "artist": "Gucci Mane"}