{"songs": [{"title": "Bye Bye Baby", "album": "Yandhi", "year": "2019-07-17", "lyrics": "[Verse 1]\nOff the meds, off the head\nNiggas soft as bread, niggas soft as bread\nStay off them blogs, they play with y'all thoughts\nMade her wait for my dawgs that ain't say what they saw\nOnly the brave, they want us locked in the cage\nIf you owe me money, I shouldn't have to remind you to pay\nVodka rum with my Ralph Lauren\nHottest bitch a full time, leeches still beg on the side\nOff the meds, can't get out of the bed\nPaparazzi waiting like that mob on the Dawn of the Dead\nI don't know you, my dawg, step away from the bus\nKnow they want me to fall, but my balance is just\nYou weren't with me when them struggles and battles was tough\nSo I cut your head off 'fore I give you a cut\nWhen they tell me I can't do it, it give me a rush\nAin't got this type of bank account 'less you 50 and up\nThey on my muthafuckin' dick, all this dirt they tryin' get\nGo with whoever, I ain't got no pick\nCome through just to get that flick\n\n[Bridge]\nGet back, go down\nNew 'Rari, slow down\nCheck the score, blow out\nI'm a bull like the home town\n\n[Verse 2]\nYeezys on, Yeezy bomber, wear my own designer\nName good, all my bridges open, go wherever, that's power\nShe came from the club tryna fuck, bitch, get in the shower\nYou a kid to me, boy, I prolly fucked your mama\nHunnid Ms, you did that? Baddest chick in the world, you hit that?\nTook your bitch, you miss that? All the fake buys, bitch, get back\n\n[Chorus]\nYeah, get back, get back\nHunnid rounds, no kickback\nMansion party, lil' kickback\nChampagne, gon' sip that\nGet that, get back\nHunnid rounds, no kickback\nMansion party, lil' kickback\nFake vibes, we ain't with that\n\n[Verse 3]\nLook what they doin', look what they sayin'\n\"That nigga selfish, look at his mansion\"\nThirty thousand square feet, secret rooms, look at the plan\nLook at the money, look at the bands\nI get on my knees, I'm thankin' the man\nHe said he ain't like that nigga, I just seen him shakin' his hand\nI'm shakin' my head, I'm shakin' my head\nYou like that Benz? They made it in France\n\n[Chorus]\nBut watch your hands, get back\nGet back, get back\nHunnid rounds, no kickback\nMansion party, lil' kickback\nFake vibes, we ain't with that\nChampagne, gon' sip that\nHunnid rounds, no kickback\nAll the fake vibes, I ain't with that\n\n[Verse 4]\nMy life a mofo, spot like some UFO\nPrice tag upon your soul, you sold it, you gotta go\nTrade my respect for some attention? Fuck no\nLookin' at these bitches bodies, girl, y'all overdose\nWhy y'all overdose?", "image": "https://images.genius.com/96257331e42fd82012b16e4312d68257.1000x1000x1.jpg"}], "artist": "Kanye West"}