{"songs": [{"title": "Ready 2 Ryde", "album": "Tha Last Meal", "year": "2000-12-19", "lyrics": "[Eve]\nKeep it shaking, Cali keep it quaking\nCause the Ryders got me bringin home the bacon\nShow me love, and it wasn't no mistakin\nThat I would dedicate this melody - fuck the hatin\n\n[Hook: Snoop Dogg]\nI had to tell my girl to pack her shit\nCause she slipped and dipped inside\nI need a girl that's ready to ride\nTo keep the heater right by her side\n\n[Eve]\nAiyyo, so what the deal Dogg, tell me, keep it real Dogg\nNiggas seem stressed to the brain, how you feel dogg?\nNigga I'mma ride, set it up, let it spill Dogg\nAnything you want, I can flip, got the skill Dogg\n\n[Snoop Dogg]\nBaby girl you so so-phisticated\nFinance related, you graduated\nTo the next level in the game, wearin my name\nBad little brickhouse, go and do that thang\n\n[Eve]\nYo - niggas surprised when they open they eyes\nThick in the thighs wasn't part of they plan\nNot just his bitch, I'm like his main man\nAct shifty - your resistance gone swiftly\nBitches mad at a nigga, askin why he kissed me\nStop whinin, just to cry and get the mackin daddy\nI don't like it when the angry chick is actin crabby\nThat's why he bagged me\nGhetto jewel, never loud and trashy\nNo stressin over chicks - problem? Bet I solve it fastly\n\n[Hook] - 2X\n\n[Snoop Dogg]\nWe gangbang on these niggas like we 'posed to do\nAnd I'll be damned if I let a bitch get close to you\nWe posted Boo - you, my, one and only\nQuick to dump before the homies\nRemember when that phony nigga ran up on me at the club?\nYou filled him up with slugs, that's what I call love\nAll that pushin and shovin, kissin and huggin\nThuggin, dig it, dug-in\nI'm lovin every minute of it Boo\nThe way you stay true, and always kept your cool\nYou kept the heater right by your thigh\nAnd when the shit got hectic you was ready to ride\nYou didn't run out, when I pulled the gun out\nThat's what I'm talkin bout, no doubt\nRuff Rydin, Eastsidin, to the realest y'know\nD-O-double-Gizze, you know how we get busy\n\n[Eve]\nAiyyo, how could I leave a real nigga? A real nigga's all I need\nFake bitches try to take my place, fall to they knees\nDon't violate, see my man, he don't like no scrapes\nAnd if I heard you was frontin I hop on the case\nWild one? Maybe, but I'mma protect my baby\nTest me fool and by the end you gon' think I'm crazy\nThat's how I do for my Dogg, keep my (?) strong\nBoth sides relied on the shit, nigga sing the song\n\n[Hook] - 2X\n\n[Snoop Dogg]\nYeah.. hahah, E-V-E! D-O-double-Gizze! Y'know!\nRuff Rydin, Eastsidin! Foe life, ahh! Yeah..\nAnd you thought it'd never happen\nFuck the haters, bow wow!\nWoof.. woof.. woof.. woof..\n{*Dogg panting*} BEOTCH!\nIt's official now, yeah\nWe gon' Ruff Ryde up on out of here on this one\nEastside up Eastsidaz\nGoldie Loc in the house\nLil' 1/2 Dead\nDJ Jam, my nigga E, Davey Dave, uhh, misbehave\nGive it to 'em Dogg\nWhattup DMX? WOOF!\nMaster P? UNNNGHH!\nDr. Dre {*chronic inhaled sound*}\nMy nephew Scott on the beat\nIlly Philly-delphia\n\n{*sounding like a P-Funkster*}\nAwwwwwww, yeah babyyy!\nIt's another one, funky as they come\nEvey Eve and Doggy Dogg\nBitch please, awwww!", "image": "https://images.genius.com/1abc5e5fc609da0014a0675d49a1a15f.953x953x1.jpg"}], "artist": "Snoop Dogg"}