{"songs": [{"title": "Frankie Limon", "album": "SouthMatic", "year": "2019-06-21", "lyrics": "[Intro]\nI-I-I-I got a six shooter for the top five vets\nAnd then one bullet left to play Russian roulette\nI'm Nostradamus, I've seen your future, it's too late\nAll y'all niggas suspect I guess crime pays, what can I say?\n(What can I say?)\n\n[Refrain]\nSo fuck you and your mob guys\nThis the part of the film where your mob dies, I got 'em!\n\n[Verse 1]\nN-N-Nigga flip and spit hot coals\nI showed you niggas how to go diamond like I was minin' hope\nMy mind's a playground where my mood swings\nBut I ain't here to play though, I'm more like Plato\nY'all niggas Play-Doh\nY-Y-Yeah, I'm the man of the hour\nSongs made 30 mils like I'm manufacturing flour\nYou niggas ain't that hard to find\nShould be a fine to get in line like, \"damn, one at a time\"\nL-l-l-l-l-like how you niggas make it this far\nI never babysit my liquor but I raise the bar\nI left the 'gram to cut an album, niggas thought I was dead\nAnd I ain't talking diet when I say you niggas fed\nI get to, get to, get to, get to, get to slidin' on 'em\nAnd then I get to, get to, get to Frankie Limon on 'em\nVeganism, feminism, government hypnotism\nI'm just speaking facts bro, this ain't even lyricism\nI drop a gem but niggas carry the mask\nGas tank on empty but the car full of gas\nW-W-Why do fools gotta try me though (Gotta try me though)\nLike I ain't got a .308 rifle scope (Rifle scope)\nNigga you ain't saying shit, I'm about to blow (Boutta blow)\nTell a rap nigga park it like a automobile\nI ain't got no more chill\n\n[Refrain]\nFuck you and your mob guys\nThis the part of the flick where the mob dies\nAnd all of the Gods rise\n\n[Chorus]\nGorilla, Godzilla, God nigga, vibe nigga\nI don't need no props nigga\nI just raise my stocks nigga\nDon't say I'm pro-black, fuck niggas\nI trust everything but niggas, what nigga?\nAnd if you knew what I knew\nThe government would back up off of you too, boo\n\n[Verse 2]\nYou had the ball but you fumbled though (But you fumbled though)\nYour bills piling up, you must live in Buffalo (You must live in Buffalo)\nI don't want no respect from you\nSent your girl home in a Uber XL to be respectable\nNiggas gon' start to question you\nHow you grown gettin' bullied?\nI guess your mind did not quite develop fully (Uh yeah)\nI'm going bat shit, niggas scared to wipe their asses\nYeah I'm from a different bracket\nRappin' on a track where 2Pac did a verse for Michael Jackson\nGot the flash drive in my jacket\nWhy the fools try B.o.B\nBefore you try me, try crack, shit\nTell a nigga park it like Jurassic\nCountry ass accent, you gotta admit, above average\nI just bagged your bitch, with an iPhone 6\nI showed you magic, when y'all was getting no bread\nOn that Atkins\n\n[Outro]\nHi-Hi-Hi-High hopes for hell\nThey say in war you must oppress the male\nNiggas said they woke and I'm skeptical\nSame mentality, you just replace Jesus with vegetables", "image": "https://images.genius.com/a9a03f89f8f3d7ce8b4db691d6f598db.800x800x1.jpg"}], "artist": "B.o.B"}