{"songs": [{"title": "Remind Me", "album": "Revival", "year": "2017-12-15", "lyrics": "[Verse 1: Eminem]\nYo! I bust in, devilish grin, disgustin'\nAsshole, freckled cheeks and a butt-chin\nCallin' all party animals, get\nOn the floor when I pop up on some Whac-A-Mole shit\nIn search of a chick who's stacked and so thick\nAnd implants are so big\nShe can hang me up on that rack, big ol' tits\nLike Anna Nicole Smith\nBody's bananas and sass to go with\nI spot you at first glance and go \"shit!\"\nYou wearin' those pants that don't fit\nThat butt won't ever give up\nThat's why you stick it out no matter what, huh?\n'Cause you got an ass that won't quit\nSo, get on the horn, my saxophone\nGrab hold of my instrument, get a grasp, and blow \"whee\"\nYou just laugh and go heehee\n'Cause you're just as nasty so that's appropriate\nThat's why—\n\n[Chorus: Eminem / Joan Jett & the Blackhearts]\nI love you, 'cause you remind me of me\nThat's why I love you, 'cause you're like me (Yeah, me)\nI said I love you, 'cause you remind me of me\nThat's why I love you, 'cause you're like me, nasty (Yeah, me)\n\n[Interlude: Eminem]\nYou know, I'm wearin' a new shirt tonight too\nWith me on it\n\n[Verse 2: Eminem]\nI'm lookin' at your tight rear like a sightseer\nYour booty is heavy duty like diarrhea\nThe plan's to bring you to my house\nYou're drinkin' Jack and Beam\nI'm thinkin' soon this tramp'll lean so we should bounce\nBut you're outta your tube-top\nIf you're thinkin' that mi casa es su casa\nYeah, you're a cute fox\nPerfect ten so back that up like a moonwalk\nGirl, you're smokin' like Snoop Dogg\nBut you must be tokin' if you think you're takin' over my quarters\nThere goes the dime into the jukebox\nTwo shots of blue Hpnotiq and soon I'll\nTurn this pool hall to a barroom brawl\nSo, Rick, scratch on the break like the cue ball\nTurn the volume all the way up on your boombox\nAnd excuse the locker room talk, I'm just too raw\nBut apparently, so are you, ma\n'Cause you just kicked me in the balls and told me to screw off\nAnd that's why—\n\n[Chorus: Eminem / Joan Jett & the Blackhearts]\nI love you, 'cause you remind me of me\nThat's why I love you, 'cause you're like me (Yeah, me)\nI said I love you, 'cause you remind me of me\nThat's why I love you, 'cause you're like me, nasty (Yeah, me)\n\n[Bridge: Eminem & Joan Jett & The Blackhearts]\nSaid \"Can I take you home, where we can be alone?\"\nShorty, you the shit, girl, I ordered you to sit\nI know you're probably feelin' me more than you admit\nPull up a chair, sweetie, let me order you a drink\nI only go to meetings court-ordered from a shrink\nSo from the bottom to the top, floor to ceilin'\nYou ain't run of the mill, you're one in a million\n'Cause real tits are still fun\nBut everybody knows fake tits are still better than real ones\n\n[Verse 3: Eminem]\nSo come and spend the night with the guy most are terrified of\nBut tonight, curiosity overrides ya\nBeside ya fired up like a starter pistol\nCrystal, let's slide hon, tonight I'm your pilot\n'Cause you should be up in the sky, girl\nYou're so fucking fly, you belong in the mile high club\nSo come on, baby, the night's young\nDon't string me along, I'm high-strung\nWe might wind up on mound like we're tryin' for the Cy Young\nFuckin' 'fore we get to the house\nScrewin' our brains out like changing a lightbulb\nThat's why I like ya, 'cause I'm crazy just like ya\nNow every time I get brain, you screw mine up\nI barely can think straight, your head game is a mindfuck\nSo ready, set, aim and fire\nYes, babe, I’m fallin' in like, that's kinda, why I love\n\n[Chorus: Eminem / Joan Jett & the Blackhearts]\nI love you, 'cause you remind me of me\nThat's why I love you, 'cause you're like me (Yeah me)\nI said I love you, 'cause you remind me of me\nThat's why I love you, 'cause you're like me, nasty (Yeah, me)", "image": "https://images.genius.com/edd76153e7ac3ec36be997aea55f32ed.1000x1000x1.png"}], "artist": "Eminem"}