{"songs": [{"title": "Hustlin Everyday", "album": "Amber Kush Mixtape", "year": "2011-04-20", "lyrics": "Yeah bitch, we're high, we're drunk. as fuck. there’s no police fuck man. the day is great. today is large..\n(chorus:)\nI’ve been hustling like everyday\nDoin' time on my grind trynna make a pay\nHey I’m still postin’ on the same block\nThe same hoodn still duckin' from the same cops\nI try hard but the life that I live man ain't all it's seemin'\nSometimes I pray to God I’m dreamin’\nBut I ain’t try to get out but I can’t damn\n\n\nVerse 1 (Big Bang)\nAy, yo im Stuck in a situation; hustlin’ to get this paper\nLess of a dyin' breed they say that the hood’s in danger\nThats why im in the streets from dawn to dusk. if they could the government would drop a bomb on us\nHow you supposed to dream big when you’re stuck in a nightmare. stay strapped cuz around here they dont fight fair\nParanoid gotta watch for the cops. cuz they sure dont got abomb playin rocks in the socks gotta probably pretend to tell'em you just a plea.They try to hit you wit six but you will only do three there’s no justice when theyre lockin up just us\nThe label us as thugs gangstas and hustlas hittin me wit possession now im under arrest. and the reason why i smoke is to deal with the stress. the only things gonna change is what i been wishin: life over hustlin',stuck in the system\n\nChorus}\n\nVerse 2 (Big Bake)\nWell, if there’s hell here it is my home oh so known its where the drug dealers get it in. tryin to make a livin, but i need to make a killin. ya pocket pissin, the projects is a vision\nBabies born into hustlas, they the cousins of the customers\nThe police always f*ck with us but what the f*ck you want from us\nYou wanna see us suffering the drugs are just the cover up\nThey always tear us down the moment we think we comin up. if only I can make a couple bucks\nTo get my grandmother up and out the hood and get her that house she always wanted out in the woods\nMy intentions are good, though they treat me as the bad guy\nJust another black guy tryin to get his stacks high.just another pull over I’m pretty sure its that guy\nNot the life I wanted but the life I live\nMusics my only way out tell'em bout it wiz\n\n[Hook]\n\nVerse 3 (Big Bang)\n\nI’ve been .. vision\nThe way I’m living ..but the same time in prison ..\n‘cause I’m seeing that they need something\nNow who am I not to supply to get this money I’m not a dummy\nI know this is a vicious cycle .. stronger with the bottom line\n..survival that’s why I try to be the bets man that I can\nI’m not looking for every man woman to understand\nListen this is my struggle\nWhy they see so many niggas lock the way\n..pretty box .. i said ..is coming, but while I live people .. for nothing\nI’m smoking guns .. I’ma just do it not talking ..\nWatch my movements because the proof is always in ..", "image": "https://images.genius.com/7399221217b5e3f2c2dafff0c5e3c210.697x521x1.jpg"}], "artist": "Wiz Khalifa"}