{"songs": [{"title": "Watcha Gonna Do", "album": null, "year": null, "lyrics": "I be dippin' in clubs, girls screamin', \"Do you want it Timb?\"\nNigga, playa hater sayin', \"Who the hell is him?\"\nI'm in the back, gleamin' from all that virgin gem\nKeep a bunch of pretty models surroundin' Timb\n\nI'm over capac'y when it come to makin' them beats\nMe and Missy makin' y'all, move y'all feets\nMakin' y'all dance and tango, make y'all legs get weak\nThat's only 'cause we drop a bunch of heat\n\nThat's watcha gonna expect, comin' from my crew\nBunch of dope beats, and a bunch of dope lyrics too\nI know that's too much for you to handle dude\nNow ask yourself what\n\nWatcha gonna do? Watcha gonna do?\nWatcha gonna do? Watcha gonna do?\nWatcha gonna do? Watcha gonna do?\nWatcha gonna do? Watcha gonna do?\n\nWhen they come in the spot, dem wanna jock\nDem nasty boy lookin' around, with big cocks\nThem girls be plottin' on how to get the rocks\nSo I beat that ass to the ground like I'm the cops\n\nWhat they gon' say? Don't wan' play\nGet 'em in the club, ahh, smokin' on hay\nWhen I'm in my ride, people walkin' by\nPistol by my side, in case dem wan' try\n\nWatcha gonna do? Watcha gonna do?\nWatcha gonna do? Watcha gonna do?\nWatcha gonna do? Watcha gonna do?\nWatcha gonna do? Watcha gonna do?\n\nI be gettin' in girls clothes, make 'em buy my whole wardrobe\nBetter get all my dough, pluckin' the hair in my nose\nIt's official I'm a pimp, 'cause my name glows\nAnd I'm back to the Yugos\n\nTalkin' that junk, you get buried\nYou don't wanna end up in the cemetery\nMe and Timbaland got tracks that will kill you\nIn the other hand I got gats that will peel you\n\nWatcha gon' say? Watcha gon' do?\nWhen I'm in the club, comin' for you\nI'm just a smooth motherfucker\nWatcha gon' say? Watcha gon' do?\nWhen I'm in the club, and I'm comin' for you\nI'm just a smooth motherfukcer\n\nWatcha gonna do? Watcha gonna do?\nWatcha gonna do? Watcha gonna do?\nWatcha gonna do? Watcha gonna do?\nWatcha gonna do? Watcha gonna do?\n\nWatcha gonna do? Watcha gonna do?\nWatcha gonna do? Watcha gonna do?\nWatcha gonna do? Watcha gonna do?\nWatcha gonna do? Watcha gonna do?", "image": "https://images.genius.com/085828b7d79bf8cf068b1557ca7a5e4c.1000x1000x1.jpg"}], "artist": "Missy Elliott"}