{"songs": [{"title": "Handcuffin’ Them Hoes", "album": "Apollo Kids", "year": "2010-12-21", "lyrics": "[Ghostface Killah]\nYeah, yeah\nYeah I cheat and I fuck other bitches\nY'all just lame sucker-for-love ass niggas\nSu.F.L.A.N! Go ahead and spell it out\nI gets my love game on without a doubt\nMy girl know I'm live (yeah) point blank period\nHandcuffin them hoes y'all can't be serious\nYou ain't cut from the right cloth, fuck your rag\nOne word in your bitch ear, she all in the bag\nGive a fuck if that's your broad, she shouldn't be out\nWe in the club lookin to put somethin fat in her mouth\nEasy! Hold on, I see a fox comin\nBetween now and a few hours I'll be up in her stomach\nAnd I ain't even gotta be dipped\nI pull out my pocket too Sloppy Joe, mixed this thick\nYou ever try foldin a brick?\nTryin to shove hundred dollar bills in your jeans and half of it rip?\nWe them Staten Island boys, intelligent thugs\n9 out of 10 times yeah we lookin to fuck\nAnd y'all already word know what it is\nOn some Teena Marie shit, nucca, I'm talkin square biz\nWhat?\n\n[Hook: Ghostface]\nY'all need to stop handcuffin them hoes\nComin in the club handcuffin them hoes\nYou don't even know 'em handcuffin them hoes\nCuffin them hoes, cuffin them hoes\n\n[Jim Jones - talking over Hook at first]\nWhassup Ghost?\nWesthaven\nSucker! I hear you Ghost\nJones~!\n\nF.EM.L, Fuck 'em and we leave 'em (I'm gone)\nP-I-M-P, treat 'em like we great 'em (ya hear that?)\nShit, treat 'em like we don't need 'em\nCause after we fuck 'em out the phone we delete 'em (doop doop)\nLeave 'em for them suckers, let them other niggas keep 'em (you can have her)\nThey keep 'em to the point that we don't see 'em (where'd she go?)\nShit, but the bitches need freedom\nThey wanna come outside and start freakin (AOW!)\nJumpin on dick like they leapin (watch it) it's Leap Year {*laughin*}\nShe disappearin for the weekend (where she went?!)\nSo hell yeah she starts creepin\nYou had her locked up like she was livin in precinct (prisoner!)\nShe want a gangster, nigga youse a weakling\nShe wanna ride fast in the cars while we chiefin (vroom vroom)\nJust cause you was cuffin the ho\nI had fucked her one time now I'm duckin this ho\nPlease in your mind, never drop a dime but\nDamn, ain't that some shit?\nAnd I just wanted to have a good time\nNow I got a ho on my line, buggin!\nSlow down\n\n[Hook]\n\n[Jim Jones - over Hook]\nStop cuffin these hoes\nStop cuffin these hoes\n\n[Hook]\n\n[Jim Jones - over Hook]\nStop cuffin these hoes\nStop cuffin these hoes\nLet her go!", "image": "https://images.genius.com/f48f03bc4acc3c9c4ddc676ddc586579.1000x1000x1.png"}], "artist": "Ghostface Killah"}