{"songs": [{"title": "Whatta You Know", "album": "Unreleased & Revamped", "year": "1996-08-13", "lyrics": "[Whatta you know?] (3x)\n\nB-Real:\nWhatta you know? The nigga stole my dough\nSo I reached in the closet for the 4-4\n[Whatta you know?] Jus' hold on, just wait a minute\nIt's gone, along with my big bad nickel-plated\nWhatta you know? The fucker took my phone\nI still can't believe that he robbed my home!\nWhatta you know? I think he got to the herb\nAnd the ferria, and the jewlery, and the Mossberg\nWhatta you know? I can't find my keys to the 6-5\nAll the way live on D's\nWhatta you know? I can't find my Rolex\nWith the 21 diamonds, shinin' on flecks\nWhatta you know? When I find that mark-ass nigga\nI'mma cut out his fuckin' heart!\n\nSen-Dog:\nWhatta you know? I came up on this baller\nFor the dollar and the weed sack, and his Impala!\nWhatta you think, when you can't trust your so-called homie\nLike me, and you thought that you know me?\nWhatta you feel, when you're lookin' in the closet\nAnd the gat's gone, and so is your cellular phone?\nWhatta you know? I took your loot and the jewels\nWith the buddah and the laptop in the nickel-plated tool!\nWhatta you know? Now I run the show\nWith the phat pockets and the nigga's fly gold\nWahtta you think, when ya ass gets jacked\nBy a homie who was supposed to have your back?\n\nB-Real:\nWhatta you know? I'm rollin' in my zone\nAnd I think I see the puto who rigged my home\n[Whatta you think?] I got the Glock in the glove\nShould I dump on the man, leave him lying in the mud?\nWahtta you know? He pulled out my 4-4\nNow I got no choice, so I let it all flow\n[Whatta you know?] The motherfucker's all blastin'\n4-5 equal, in time for some tractions\n[Whatta you know?] Slide action, no question\nForty-five slug is bad for your complexion\n[Whatta you know?] The puto's cryin' like a bitch\nNow the puto's lyin' in a fuckin' ditch!\n\nB-Real (spoken):\n[Whatta you know?] You can't even trust your fuckin' best homeboy these days, homes\n[Whatta you know?] You got to sleep with one nine fuckin' open ...\n[Whatta you know?] Payback's a motherfuckin' bitch!\n[Whatta you know?] That puto should've watched his fuckin' back\n\n[Whatta you know?] (repeated till end)", "image": "https://images.genius.com/5bfb3c1df682504d29cac02d808840bd.600x608x1.jpg"}], "artist": "Cypress Hill"}