{"songs": [{"title": "Soldiers", "album": "The Language of My World", "year": "2005-10-10", "lyrics": "[Intro]\nThis is for my soldiers\nNot my soldiers that chose to be soldiers\nBut the soldiers that were forced to be soldiers\n\nNow what’s the trouble, you scared of being a human?\nIf the truth is a tool I double dare you to use it\nHit the booth and I’m well aware of what I’m doin’\nIf I confuse you with the humor I’m preparing them for the movement\nI’ve been alive before and every person’s got a purpose\nMost don’t observe it or know what they’re striving towards\nOnly you can light the torch\nCause you won’t survive the war if you don’t know what the fuck it is you’re fighting for\nMost of us won’t open up and trust the inner source\nCombined with being tempted to just accept it\nBut don’t twist the message, if you must think of my support\nSometimes you gotta pull off the tees and get on some left right left shit\nI worked with 80 soldiers hooded behind locked doors\nForced into a war, an entrance with no exit\nBefore they could grow up, just some crazy soldiers\nArming them with crack and guns, in essence, defenceless\nYup, my man rapping, charismatic and handsome\nIn his own words 21st century panther\nThirteen-years-old gets into a fight\nDecided to steal the kid’s bike\nCops come and he ends up in hand cuffs\nTwo months in and now he’s caught in the trap\nGot out, got caught with a gat and crack\nNow what do these people think\nJuvenile life like that he grew up in a room with a mac\nAnd he’ll be policed until the day he can legally drink\n\n[Hook]\nNow tell me what’s the matter with this picture\nI wish it was a dream but it seems too vivid\nThere’s blood on these streets I can’t see who’s is it\nI should probably mind my business\nI said tell me what’s the matter with this picture\nI wish it was a dream but it seems to vivid\nThere’s blood on these streets I can see whose is it\nAmerica wants me to mind my business\n\nNow if you contain anything in a cage\nIts natural tendency is going to try to be escape right?\nWhen these kids get out of the gates and face life\nIf you raised them as a criminal what do you estimate they’ll behave like?\nThe ratio is 80 something percent of kids who get locked up again or go straight to the pen\nAnd that’s strange right\nIt’s a snowball effect, and they wanna see you again\nSo they can make sure that America remains white\nYup, going back on that race shit\nMost of the neighborhoods are like cages they try and escape and\nIf the American dream is to make it\nIt’s obviously blatant that if you’re left with nothing, what do you do?\nTake it\nAttempted Murder was the case\nMy man got beat up, stomped in his face\nAsk George Bush what you do when you’re attacked\nHis boy went and let it spray, hit one of them in the leg\nNow George you can relate\nRemember Iraq, or was it Afghanistan? Just ain't funny\nProving sometimes you gotta take something to make money\nMy man’s homie snitched and said that he planned to hit\nAnd he’ll be out when he’s 46\nNow ain’t the game something\nThe soldiers follow the same orders\nThe generals are Crips folk and south of the border\nNortenos and bloods\nNow is it a kid with a gun or the system he lives in that has his disorder\nIf there’s a fiend on the block, somebody’s serving em\nIf there’s a teen with a Glock, there’s a cop looking to turn 'em in\nIf you have something I want, there’s somebody murdering\nSince 1492, where the fuck do you think we learned it from\n\n[Hook]", "image": "https://images.genius.com/a341d7269423ec87ff688b91d8b38e47.800x800x1.jpg"}], "artist": "Macklemore"}