{"songs": [{"title": "Rock City", "album": "The Rock City Mixtape", "year": "2002-01-05", "lyrics": "[Intro: Eminem]\nRock City\nRoyce five nine\nSlim Shady\nCome on\n\n[Verse 1: Royce da 5’9” & Eminem]\nCan't stop the hustle, Royce nickel nine\nGlock stops the tussle, nine shots'll bust you\nPine box, they'll stuff you, fuck you, I am not the tussle\nNiggas don't know me, I'm Detroit's king nigga, bow!\nRock City's where the niggas pimp hoes and ball\nStrip hoes in bars, steal clothes from malls\nAs long as your city's got the\nBombs and your city's got the\nArms and your city's got the\nTitties sagging looking like they got forearms\nGold bottles, green bottles, Cris' to the don\nNiggas get popped for selling weed, shaked with seeds\nIf you hate me you hate the D, nigga please\nI'm taking shit back to the riots in the sixties\nThink I'm lying? Visit me (Where you live)\n\n[Chorus: Eminem]\nRock City, come on and rock with me (c'mon)\nRock City, come on and rock with me (c'mon)\nRock City, come on and rock with me\nRock with me, come on and rock with me\nRock City, come on the block with me (c'mon)\nRock City, come and rock with me\nRock-City-c'mon-rock-on-city-c'mon\n\n[Verse 2: Royce da 5’9”]\nSuburban and city niggas hustle together\nLong as it's money involved, niggas'll tussle together\nLong as the hustle's a hustle, the green is green\nWhite is white, nigga we buying if the price is right\nSo, drop the mics, everything's on cock\nFrom the shots to the dice, we are not into hype (nope)\nYou can't say we can't work\nEither we some plant workers or we some niggas that plant work\nWhat? Detroit bitches is 'bout it\nYou can just ask any one of your niggas that visit about it\nAny seven mile bitch know how to get rich\nShe'll fuck you 'til you sleep plus lie to your bitch\nPlus she'll suck and swallow up outta your dick\nAnd she'll keep a sugar daddy that'll buy her some shit, come on\n\n[Chorus: Eminem]\nRock City, come on and rock with me (c'mon)\nRock City, come on and rock with me\nRock City, come on and rock with me (c'mon)\nRock with me, come on and rock with me\nRock City, come on the block with me\nRock City, come and rock with me\n\n[Bridge: Eminem]\nThe city with the bars, where the goons\nWhere the cars is produced, here we are with the\n\n[Verse 3: Royce da 5’9”]\nNew casinos, car shuffles, numbers to bet\nDisrespect and get a new smile under your neck\nA city full of thug-ass niggas, and punk-rockers\nA lot of niggas act like Pac, so cops watch 'em\nThem shot blocks up in the black or the light Timbs\nWhite boys look, act, and rap like Slim (hi)\nFight Music, knife users never respect it\nGuns talk, high schools with metal detectors\nA city full of Tommy Hearns thumpers\nGrant Hill hoopers, Barry Sanders runners, stunners\nChaldeans with weed-connects like whoa\nType of weed, no need to test like 'dro\nType of cats who got dough, they like - so?\nYou real then you might go, where?\n\n[Chorus: Eminem]\nRock City, come on and rock with me (c'mon)\nRock City, come on and rock with me (c'mon)\nRock with me, come on and rock with me (c'mon)\nRock City, come on and rock with me (c'mon)\nRock City, come on the block with me (c'mon)\nRock City, come and rock with me (c'mon)\nRock City, come on and rock with me\nRock City, come on and rock with me\nRock City, come on and rock with me\nRock City, come on and rock with me (c'mon)\nRock with me, come on the block with me\nRock City, come and rock with me\nRock with me\n\n[Outro: Royce da 5’9” & Eminem]\nDetroit, Rock City, Slim Shady\nWon't you come on the block with us?\nRoyce da 5’9”, won't you just come and rock with us?\nRoyce da 5’9”, it's the next level, Rock City\nRoyce nickel nine, Slim Shady, Rock City\nWon't you come and rock with us?\nRock City, won't you come on the block with us?\nRock with me, won't you come and rock with us?\nRock City, two-thousand, rock with me, touch it\nFuck", "image": "https://images.genius.com/33f0545a004d615ab6c8cf34f6ae20d0.550x550x1.jpg"}], "artist": "Royce da 5'9'’"}