{"songs": [{"title": "Be Easy", "album": "Fishscale", "year": "2005-10-25", "lyrics": "[Intro: Ghostface Killah]\nYeah, what's happening New York City?\nIt's ya boy Ghost in the muthafuckin' house tonight\n(\"Don't fuck with Ghost, you'll feel sorry\")\nKnow what I mean? We about to get it popping, let's go!\nYo! Yo!\n\n[Hook: Ghostface Killah]\nTell your crew to be easy, niggas run around\nWith them fake frowns, sell 'em on eBay\nGet word to the DJ, tell 'em Staten Island's\nIn the house, put the record on replay\n\n[Verse 1: Ghostface Killah]\nGet your nose blowned off by the fifth, uh\nYou wanna be there, layin' all stiff, uh\nEverytime you go uptown, you get jipped, uh\nThat's karma, boy, running your lip, uh\nYou be fronting like you got a bunch of chicks, uh\nYou be at home, nigga, beating your dick, uh\nI'm in the club with the chipped up wrist, uh\nYou at the bar, whoadie, drinking my piss, uh\nThe yellow shit, and the bottle ain't Crys', son\nYou turned your muthafuckin' head, nigga, we switched 'em\nYou just mad cause I'm hitting your sister\nYou in the other room, huh, you couldn't sleep, uh\nPop a lotta shit without that liquor, yup\nWe mossied up, so take our picture\nI'm like the boogeyman, nigga, I'll get ya\nWhether now, later, afterlife or switcher\n\n[Interlude: Ghostface Killah]\nYeah, oh shit, aiyo Tone hurry up and get 'em, nigga\nYou knowhatimean, it's about to pop off!\nYa'll niggas clear the fucking floor\nGet the fuck out the way, come on!\n\n[Hook: Ghostface Killah]\nTell your crew to be easy, niggas run around\nWith them fake frowns, sell 'em on eBay\nGet word to the DJ, tell 'em Staten Island's\nIn the house, put the record on replay\n\n[Trife Da God & Ghostface Killah]​​\nYo, it's Tone in the building (the teams in the building)\nNiggas wanna beef (​​​​​​​what up, what up, what up)​​​​\nWe packed to the ceiling (we constantly chilling)\nWe can cause (​​​​​​​we could, we shoot, we slice, we cut​​​​​​)\n\n[Verse 2: Ghostface Killah]\nShimmy shimmy ya, shimmy yam, shimmy yea, now\nYes, my birthday landed in May, now\nPeace to Dirt Dog, I'm back like deja vu\nLeave your girl around me, I will bag your boo\nAhh, you bitch niggas better listen up\nAnybody front, paramedics gonna pick 'em up\nThey try to save you, swear to God, I hit the nurse up\nLike \"Nah, doc, he look better in a hearse truck\"\nI tried to ignore it, his people saw it\nI ain't the type of dude you go to war with\nMy Polo gun yo, will crack the floor shit\nWhen the heat's on, you know I draw it\nI had his number down, Toney just called it\n\n[Interlude: Ghostface Killah]\nYo, aiyo, Pete Rock, good looking nigga!\nStaten Island, yo Theodore! What's the deal\nSlap me one of the ratchets, I'm about to go in! Yo!\n\n[Hook: Ghostface Killah]\nTell your crew to be easy, niggas run around\nWith them fake frowns, sell 'em on eBay\nGet word to the DJ, tell 'em Staten Island's\nIn the house, put the record on replay\n\n[Verse 3: Ghostface Killah]\nGotta get that cheese, gotta pimp that V\nGotta burn those leaves, and uh\nPretty Tone make the girls say please\nDaddy work that d, put it in and be eas' and uh\nSo what, come on, now some of y'all people\nMight know me from my wallabies\nPretty bitches got my number, y'all can dial me\nI stick it up like an iced cake robbery\nAnd when I'm done, y'all can finger nail file me\nFloss the ill robes since Criminology\nSupreme Clientele, put the world on top of me\nYo babe, hurry up with those collard greens\nI represent S.I., ain't as wild as me\nThey lousy, I'm phat like a pound of cheeba weed brownies\nTone got the power squeeze, don't surround me\nQuick to pick a honey up, shit, the flow's Bounty\nYa'll can just crown me!\n\n[Outro: Ghostface Killah]\nYeah, that's right\nI like to thank y'all for coming out tonight\nHow y'all like that shit? You know what I mean?\nYou really run New York\nThis is that Theodore shit, muthafucker!\n   ", "image": "https://images.genius.com/e51f84020471b1354755e8496fc232e3.500x500x1.jpg"}], "artist": "Ghostface Killah"}