{"songs": [{"title": "Dead Wrong (Remix) (Alternate Version)", "album": null, "year": null, "lyrics": "[Puff Daddy] Bad Boy baby\n[Notorious B.I.G.] Yeah\nYeah\nJunior M.A.F.I.A\nYeah\n[Puff Daddy] Yeah\nB.I.G. 2000\nB.I.G. 2000 Born Again\nCome on\n\nChorus: The Notorious B.I.G. & Puff Daddy\nThe weak or the strong\nWho got it goin' on?\nYou're dead wrong\nThe weak or the strong\nWho got it goin' on?\nYou're dead wrong\n\n[Verse 1: The Notorious B.I.G.]\nRelax and take notes\nWhile I take tokes of the marijuana\nSmoke\nThrow you in a choke\nGun smoke, gun smoke\nBiggie Smalls for mayor\nThe rap slayer\nThe hooker layer\nMotherfucker, say your prayers\nHail Mary, full of grace\nSmack the bitch\nIn the face\nTake her Gucci bag\nAnd her North Face off her back\nJab her if she act\nFunny with the money, oh, you got him mistaken, honey\nI don't wanna rape ya\nI just want the paper\nThe Visa\nKapeesha?\nI'm out like\n\"The Vapors\"\nWho's the one you call Mr. Macho\nThe head honcho\nSwift fist like\nCumacho\nI got so\nMuch style, I should be down with The Stylistics\nMake up to break up\nNiggas need to wake up\nSmell the indonesia\nBeat you to a seizure\nThen fuck your moms, hit the skins to amnesia\nShe don't remember shit\nJust the two hits\nHer hittin' the floor\nAnd me hittin' the clits\nSuckin' on the tits\nHad the hooker beggin' for the dick\nAnd your moms ain't, ugly, love\nMy dick got rock quick\nI guess I was a combination of House Of Pain and Bobby Brown\nI was Humpin' Around and Jump-in Around\nJacked her, then I asked her, \"Who's the man?\"\nShe said, \"B.I.G.\"\nThen I bust in her E-Y-E (Yo B.I.G., you're dead wrong)\n\nRepeat Chorus Twice\n\n[Verse 2: Eminem]\nThere's several different levels to Devil worshippin': horse's heads\nHuman sacrifices, canibalism, candles and exorcism\nAnimals having sex with 'em, camels, mammals and rabbits\nBut I don't get into that, I kick the habit, I just\nBeat you to death with weapons that eat through the flesh\nAnd I never eat you unless the fuckin', meat looks fresh\nI got a lion in my pocket, I'm lyin'\nI got a nine in my pocket, and baby I'm just\nDyin' to cock him\nHe's ready for war\nI'm ready for war\nI got machetes and swords for any faggot that said he was raw\nMy uz is as\nHeavy as yours, yeah you met me before\nI just didn't have as large an arsenal of weapons before\nMarshall will step in the door\nI lay your head on the floor\nWith your body spread on the bedspread\nRed on the wall\nRed on the ceilin', red on the floor, get a new whore\nMet on the second, wet on the third, then she's dead on the fourth\nI'm dead wrong\n\nRepeat Chorus Twice\n\n[Verse 3: Busta Rhymes]\nHow many licks does it take to the center of my Tootsie Roll? (Or)\nHow many nuts to the center of your booty hole?\nHold on, shorty, cause I'm about to slap this groupie nigga\nJab this fluesy nigga, watch 'em bleed, then shit dookie, nigga\nSpooky nigga, you gettin' skinny like you Pookie, nigga\nBlood spill got you laggin' out like that soupie nigga\nSmoke this Lucy nigga, time passin' on the frank mic\nWatch 'em dyin' slow, then see ya skin, you start to change color\nMy goons lay the flood, leave you layin', drippin' blood\nThen ended up fingerfuckin' your mother at a strip club\nWe dead wrong for how we gutter like how in the sudden\nFascinated how all of this street shit, we straight mother\nFuck it\nWe thug rugged to the tenth power\nLike B.I.G. was listenin'\nSo Gimme The Loot for the past ten hours\nAnother dick\nHear the click of my gun cock\nSame mentality when I was scheeming on a lunch box\nGimme that!\nTwenty-focused and I'm sorry Campbell\nI'm taking from you and your wife and run the baby Pamper (What?)\n\nRepeat Chorus Til Fade", "image": "https://images.genius.com/accf2df97375292b16f399ff6ec71e6e.500x500x1.png"}], "artist": "The Notorious B.I.G."}