{"songs": [{"title": "Mind Kcuf", "album": "The Storm", "year": "2016-12-09", "lyrics": "[Intro: Krizz Kaliko]\nIt's too many wanna be loved\nI just wanna kcuf and get up\nDon't gotta tell me what you're thinkin', 'cause I know just what you're thinkin'\nShe light to me with a sign up\nShe just wanna get mind kcuffed\n\n[Verse 1: Tech N9ne]\nHey, new pic through, my twit view\nHad me wishin' I was next to you to sniff you\nSo the fact I never met you was an issue\nIt's true so I'm hopin' it's a get to\nYou baby what I am creating hope it lifts you\nTo where you never need a tissue\nJust a wet towel when I see it's somethin' I wanna lick boo\nLike your eyelids..\nLot of beautiful parts of your body baby this is my bid\nHave you trippin' about the freaky shit I did\nYou're interacting with the poet and porn hybrid\nLickin' things on your body, that they prolly\nNever thought of servicin' but romancin's my hobby\nI'll lick you like a lolly, from your eyes and I'll leave\nYour teeth in my sweet with my tongue like it was Molly\nHella beauty wake the N9ne up\nWhen you share pretty pictures of your fine butt\nHad a dream I bit your neck and red wine gushed\nSo I sipped you every time I eat the prime cut\nWanna take you to a spot, no one'll find us\nBe secluded, we gettin' zooted, we design lust\nYou submissive with mental misses and I'm what?\nSuper dominant, get your ankles, wrist and mind kcuffed\n\n[Hook: Krizz Kaliko]\nCon-trol, something's wrong with me\nI just can't let, go\nLet me, let me see how far that you'll go\nI got control of yo body\nNow let me kcuf your mind, let me kcuf your mind\nMind kcuf!\n\n[Verse 2: Tech N9ne]\nI tongue the inside of my mouth all day\nSo, by the time I get to you it'll be all play\nDancin' my tongue around where your pink drawers lay\nWe freaks but you creep's y'all wanna peek y'all pay\nYeah-e-yeah, a little bit of crazy there\nShe will be my lady if she don't look away\nShe will see my shady stare\nTrying to hold your brain hostage\nSo you listen to every single thing I talk miss\nLike \"Let me hit it from the back in a crowded mosh pit.\" People peepin' what we doin', think we lost it\nHope you thinkin' what I'm sayin' isn't awkwid\nAnd you ain't trippin' off of me 'cause you a boss bitch\nI wanna take a dip in all your sauces\nDon't be cautious, I wanna eat you 'til I'm nauseas\nCan I suck your tongue? (Let me do it)\nCan I touch your buns, when you push your gun in a lustful sprung (Ooh)\nWith a thrust so hung, I'mma crush yo lungs (Yeah!)\nYou still reading? I'm hoping for a response this evening, I'm teethin'\nI'm hopin' your picture is not deceivin'\n'Cause jeez when I look at your body girl you're not even a vegan\nPlease direct message me\nWe try at best and then we die in ecstasy\nI request that you mesh with me\nSee why it catches me, she fly as heck to me\nI'm the kind that really wants to control your brain\nWanna lock you up in chains\nGive you this pain when you feel every fuckin' thing\n\n[Hook: Krizz Kaliko]\nCon-trol, something's wrong with me\nI just can't let, go\nLet me, let me see how far that you'll go\nI got control of yo body\nNow let me kcuf your mind, let me kcuf your mind\nMind kcuf!\nCuff you like the police, something's wrong with me\nI just can't let, go\nLet me, let me see how far that you'll go\nI got control of yo body\nNow let me kcuf your mind, let me kcuf your mind\nMind kcuf! (x2)\n\n[Outro: Krizz Kaliko]\nI ain't playin' wit'chu, not even a little bit (No-uh)\nI ain't playin' wit'chu, not even a little bit (No-uh)\nWe gon' see, she gon' do it\nKcuf!", "image": "https://images.genius.com/dac1cf83fc6c83ed086fa8adde3a8bc2.1000x1000x1.jpg"}], "artist": "Tech N9ne"}