{"songs": [{"title": "Down Wit Us", "album": "Def Jam’s How to Be a Player Soundtrack ", "year": null, "lyrics": "Artist: Redman\nAlbum: How to Be a Player soundtrack\nSong: Down Wit Us *\n\n* a '97 update of Boogie Down Production's \"I'm Still #1\"\n\nHa ha, yo, yo\nMy man Keith Murray, is down wit us\nMy nigga Erick Sermon, is down wit us\nMy man Lil' Jamal, is down wit us\nMy Def Squad click, is down wit us\nThe Pack Pistol Posse is down wit us yo\nMy L.O.D. click, is down wit us\nWe're number one!\nHa ha ha, ha ha, yo yo, yo well yo\n\nIt's the Red Moolie, yellin for the villain in the movie\nI'm like Kentucky, I pack a biscuit and a two-piece\nYa nod thorough, blows like the tri-borough\nI die thorough with a metal on my chest sayin Def\nCheck out the rhythm that I cook up\nYou too scared to look up, you're merkin\nI Set it Off like La in that big-ass Suburban *errrr*\nBumrush your villa then I'm closin all the curtains, LIGHTS OUT\nWho's next to get stomped? I smash hardcore from Jerz\nTo the South South Bronx, the bizarre rap non-superstar\nOf course, my Actions Affirmative like Nas Escobar\nFlip a quarter, heads or tails you're gettin slaughtered\nI blow the S-L boy out of order\nMy mental disorder is pure water\nI hit your wifey doggystyle in the Land\nWhile the CD program's on 'Whatever Man'\n\nMy peoples up in Jersey, is down wit us, uhh\nMy peoples locked down, down wit us, uhh\nMy peoples in New York, is down wit us\nThe housing projects, is down wit us\nMy people who be hustlin is down wit us\nCause makin funky music is a must\nI'm number one!\nHa haa! Check it check check check here we go huh huh\n\nAiyyo, throw yo' hands up in the motherfuckin air\nAnd wave em, until y'all cash flows hit the pavement\nFuck the B-X, I roll on fours like G-S\nSigned truly yours, Funk Doctor Spock, P.S\nRumble in the Jungle, I bumped into Fugees\nOn the humble, on the one-deuce, my bundles\nBe raw diggy, surprise you like you saw titties\nOn that, milk chick, watch me damage your acoustics\nThe Muddy Waters be blowin your tape recorders\nPull out the four niggas steppin like they on a Nord(ic)\nTrack, cool out black got no time for scratch\nYou wanna battle, here's a lyric with a bomb attached *pssst*\nThese your peoples, you better call em back before I beat through\nHis windpipe, with the cordless mic and the cerebral\nHAHH, look up in the motharfuckin sky, it's a\nWidow, pushin a fifteen zero zero\nWith tinted windows, so it's hard to look through\nChickenhead shotgun, pumpin Erykah Badu\nDon't snooze, you'll be like damn is it the shoes?\nThe way I maneuv I could slip a uz in school\nI been a raw dog since I brought me an eighth\nAnd Can't Nobody Hold Me Down like I'm Puffy and Mase\n\nHa hah, ha ha ha! Ha ha, aiyyo, aiyyo\nFox Boogie Brown, is down wit us\nMy nigga Meth-Tical, is down wit us\nYo, Thuggish Ruggish Flesh, is down wit us, yo\nYo, my homie Richie Rich, is down wit us, yo\nThat nigga LL Cool, is down wit us, yo\nMy dog Warren G, is down wit us\nWe're number one!\nHa hah, ha hah, ya-ha-ha, yo yo\n\nTrigger the Gambler, down wit us, yo\nMy peeps West coast, is down wit us, yo\nMy peeps who pack toast, is down wit us yo\nAtlanta, G-A, is down wit us yo\nMy peeps in Virginia, is down wit us yo\nNorth Carolina, is down wit us yo\nMy peeps in D.C., is down wit us yo\nMy peeps in...", "image": "https://images.genius.com/2de0906afb1ac0a1df8e9c65790e4db0.400x393x1.jpg"}], "artist": "Redman"}