{"songs": [{"title": "Hit ’Em Up (Radio Version)", "album": "Greatest Hits", "year": "1996-06-04", "lyrics": "[Intro: 2Pac]\nI ain't got no friends\nYeah, I'ma do this track\nWestside!\nMOB, Bad Boy Killa!\nHahahaha, hey fat boy...\n\n[Verse 1: 2Pac]\nFirst off, touch your chick and the clique you claim\nWestside when we ride, come equipped with game\nYou claim to be a player, but I bust your wife\nWe bust on Bad Boys, brothers touch for life\nPlus Puffy trying to see me, weak hearts I rip\nBiggie Smalls and Junior M.A.F.I.A. some mark-ass tricks\nWe keep on coming while we running for your jewels\nSteady gunning, keep on busting at them fools\nYou know the rules\nLil' Caesar go ask your homie how I'll leave you\nCut your trick ass up, leave you in pieces, now be deceased\nLittle Kim, don't compensate for real G's\nQuick to snatch your ugly hair off the streets\nYou Little weave! I'll let them suckas know it's on for life\nDon't let the Westside ride the night haha\nBad Boy murdered on wax and killed\nMess with me and get your caps peeled\nYou know\n\n[Hook: 2Pac]\nSee, grab your Glocks when you see 2Pac\nCall the cops when you see 2Pac, oh\nWho shot me, but your punks didn't finish\nNow you about to feel the wrath of a menace\nBusta, I hit 'em up\n\n[Interlude: 2Pac]\nYeah, straight out on the Bad Boy camp\nYou know how we do it\nAll my real homeboys in New York keep thuggin'\nAll the rest of you bustas die slow!\n\n[Verse 2: Hussein Fatal]\nGet out the way yo, Hussein Fatal\nBiggie Smalls just got dropped\nLittle Moo', pass the MAC\nAnd let me hit him in his back\nFrank White needs to get spanked right for settin' traps\nLittle accident murderer\nAnd I ain't never heard of ya\nPoisonous gats attack when I'm servin' ya\nSpank ya, shank ya whole style when I gank\nGuard your rank 'cause I'ma slam your ass in the paint\nPuffy weaker than a block that I'm runnin' through\nAnd I'm smokin' Junior M.A.F.I.A. in front of you\nWith the ready power\nTucked in my Guess under my Eddie Bauer\nYour clout petty/sour\nI push packages every hour; I hit 'em up!\n\n[Hook: 2Pac]\nSee, grab your Glocks when you see 2Pac\nCall the cops when you see 2Pac, oh\nWho shot me, but your punks didn't finish\nNow you about to feel the wrath of a menace\nBusta, I hit 'em up\n\n[Verse 3: 2Pac]\nPeep how we do it, keep it real, it's penintentiary steel\nThis ain't no freestyle battle, all you suckers gettin' killed with your\nMouths open\nTryin' to come up off of me you and the clouds hopin', smokin' dope\nIt's like a Shermine brothers think they learned to fly\nBut they burn little suckers you deserve to die\nTalkin' about you gettin' money but it's funny to me\nAll you suckers livin' bummy while you messin' with me\nI'm a self made millionaire\nThug livin', out of prison, pistols in the air\nBiggie remember when I use to let you sleep on the couch\nAnd beg the trick that I let you sleep in the house\nNow it's all about versace, you copied my style\nFive shots couldn't drop me, I took it and smiled\nNow I'm back to set the record straight, with my A-K\nI'm still the thug that you love to hate\nLittle busta I'll Hit 'Em Up\n\n[Verse 4: Kadafi]\nI'm from N-E-W Jers' where plenty of murders occurs\nNo points or commas, we bring drama to all you herbs\nNow go check the scenario: Lil' Cease\nI'll bring you fake G's to your knees, coppin' pleas in de Janeiro\nBig Momma, is you coked up or doped up?\nGet your little Junior Whopper click smoked up\nPlease tell me is you stupid?\nI take money, crash and mash through Brooklyn\nWith my click lootin', shootin' and pollutin' your block\nWith a 15-shot cocked Glock to your knot\nOutlaw MAFIA clique movin' up another notch\nAnd your pop stars popped and get mopped and dropped\nAll your fake-ass East Coast props brainstormed and locked\n\n[Verse 5: E.D.I. Mean]\nYou's a beat biter, a Pac style taker\nI'll tell you to your face you ain't nothin' but a faker\nSofter than Alize with a chaser\nAbout to get murdered for the paper\nE.D.I. Mean approach the scene of the caper\nLike a loc, with Prodigy' in a choke\nGun totin' smoke, Outlawz we ain't no joke\nThug Life, cowards better be knowin'\nWe approachin' in the wide open, gun smokin'\nNo need for hopin', it's a battle lost\nI got 'em crossed as soon as the funk is boppin' off\nHAHA, I hit 'em up!\n\n[Outro: 2Pac]\nEmpty clips, set trip\nYou know what time it is\nWestside, Outlaw, Thug Life till we die\nCalifornia love, california thug\nYou know what time it is\nBad Boy Killa\nMobb Deep Killa\nChino XL Killa\nMuch love to Smiff N Wesson, Freddie Foxxx, Bunchy The Fat Bastard, Naughty\nBy Nature and all the real thugs out there\nKeep it comin'!\nWestsiiide!\nYou know what time it is\nAll my real homeboyz in Jerzey, get up!\nOutlaw! Thug Life! to die\nWestside, Outlaw\nLive it up or give it up, Busta\nHahahaha, Yeah!\nYou know what time it is\nLove bout you, hate about me\nGun talkin' automatic mini's`\nEleven's, fo'teens\nWhatever!\nYou wanna see us? Have you punks wannabe's\nBad Boy Killa, we the realest, whatever!\nWe got, together, Outlawz!\nThugs to the realest, feel us, All you suckas die!\nSlow, my fo'fo', go, bow-bow\nKastro, EDI, close my foes\nWithout love, no love, do ya\nYou knew it!\nIt came with it, we bought it, record it, THUG LIFE!\nForever, together, we ride, we die, we high\nFOREVER!\nTHUG LIFE!\nOUTLAW RIDAHZ!\nWestside!\nM.O.B.!", "image": "https://images.genius.com/a6d7f93a83ec4f3dde28a749c01a6465.480x480x1.jpg"}], "artist": "2Pac"}