{"songs": [{"title": "Work For Me", "album": "A Son Unique", "year": null, "lyrics": "[Intro: Ol' Dirty Bastard]\nDirty, ya'll niggas get the fuck up\nI'm out of jail, nigga, I'm out of jail\nWhat more, nigga, Dirty\nGo and get the fuck out, I'mma pull\nOne of your muthafucka's eye, ahh, something\nDirt McGirt, muthafucka\n\n[Ol' Dirty Bastard]\nYa'll know who I am, what?\nDirt McGirt, baby, whose the man?\nWhat part you fools don't understand\nBeen away now, I'm back by popular demand\nAin't a damn thing changed, nigga, back up\nFirst nigga to act up, get smacked up\nOrange suits on hand, Dirty this, Dirty that\nYo, where Dirty at? But now Dirty back\nMy girl is nasty, her booty is stank\nI fucked her all night, until a nigga shoot blanks\nDoggystyle, will never spill my drink\nThen smoke a blunt, and watch the shit on tape\nYou can sit on my face, I like the taste\nIf my P.O. call, tell that bitch to wait\nI break ya face, invade your space\nDon't make the mistake, tell me who is in the place what?\n\n[Hook: Ol' Dirty Bastard]\nYeah, let me see you work something\nSlow down, don't hurt nothing\nYou nasty, ain't ya? You freaky, ain't ya?\nGet ya ass over here, shake it like ya just don't care\nNow bounce-bounce, move it over here, now\nWork, work, move it over here\n\n[Young Chris]\nHistory, I do her, then we split up\nLyon call, whenever, we ready to get up\nI ain't never been hit up, with a line that's strong\nHave a nigga fuck the shit up, with his love, that's wrong\nGot a hell of a body, yeah, I love that tone\nAnd god damn, I love that moan\nThere's just something about you, make a nigga stay all night long\nMy undercover freak the shit\nIt's cool, cuz her peeps was rich\nSo whatever I want covered, and she got my peeps' pitch right\nSo when I'm on the road, or a girl play the show\nShe can respect homebase, she play the codes\nNasty as she wanna be, shaking that ass right in front of me\nCan't seem to keep her from up under me\nAnd how I am, try'nna see if chirp gash\nShake it for the Gunnerz and Dirt, shh..\n\n[Hook]\n\n[Ol' Dirty Bastard]\nI'm dirty, just like the dirty south\nI talk dirty, wash out my dirty mouth\nI'm dirty, just like the dirty south\nTalk dirty, wash out my dirty mouth\nWhat, nigga? Why you wanna get me started?\nGot me in the club with Tha Alkaholiks\nOn the down low, like I'm ducking the warrant\nGetting head in the back by the bathroom toilet\nThere's beauty all around, let me see the performance\nShe down for whatever, you know I'mm all for it\nGotta spark hard, hoppin' sports bar\nAfter this, it's the Marriot courtyard\nGold card, I'mma max it out\nJust keep your titties shaking and the apples out\nYou can, stick around, honey, that's no doubt\nBust a nut, then I'm passing out\n\n[Hook 2X]", "image": "https://images.genius.com/035d8c96b903707a3cfd550d89c33684.400x400x1.jpg"}], "artist": "Ol’ Dirty Bastard"}