{"songs": [{"title": "Big Booty Hoes", "album": "Born Again", "year": "1999-12-07", "lyrics": "[Intro: Too $hort]\nBeeotch!\nTalk about these hoes Big..\n\n[Verse 1: Notorious B.I.G.]\nI got a bitch that suck my dick til I nut\nSpit it on my gut and slurp that shit back up\nAin't that a slut (HELL YEA) she even take it in the butt\nFuck for bout a hour, now she want a golden shower\nYou didn't know that we be pissin on hoes, bitch (BEOTCH)\nLuke and Biggie straight shittin on hoes, bitch (BEOTCH)\nLick your toes, bitch? (BEOTCH) Fuck no, you must be crazy\nSquirt in your face and then I'm Swayze (bitch)\nRecognize G, straight up, I can't knock ya\nAfter Big Poppa, fuck ALL of Junior M.A.F.I.A\nThe whole clique, dick sucked, ass licked\nLeave your number by the phone, bring yo' ass on home\nI roam in Lexuses and Benzes, the fly way\nWith the flyest bitch gettin head on the highway (ridin)\nMy way deep throat on Luke's boat\nWhen the moon rises, I'm cumin in her eyes-es (do it)\nJust the way players play\nLeave it up to me, I get fucked all day (yeah)\nSucked all day, smokin blunts, countin cheese\nFucking bitches til they assholes bleed\nWhat you say ba-by\n\n[Hook: Too $hort & Biggie]\nAll I want is hoes, big booty hoes\nCheck it out, here's another one\nAll I want is hoes, big booty hoes\n(Don't take em to the crib unless they bonin)\n\n[Verse 2: Notorious B.I.G.]\nUhh.. uhh..\nBiggie bag bitches from barbecues to barmitzvah's\nThe dick don’t fit, use your lips cause.. (use em)\nI'm feelin kinda itchy for a quickie\nDon't take off your coat, all you got to do is lick me\nMe eat you, I beat you, then greet you to the door bitch\nCause I don't love you no more\nWhich one of these hoes in the lobby wanna slob me?\nYou know me, I like my dick Brown like Bobby\nIn the duke shoot, then the bitch get the boot\nUnless she lick ass and blow dicks like flutes\nI like em cute, round tits and fat asses\nEducated, so I can bust off on they glasses\nI wanna cum on your tongue and gums, all night\nThe bitch drink nuts by the pint\n\n[Pre-Hook: Too $hort]\nDrink it bitch!\nAll of these hoes do that shit\n\n[Hook: Too $hort & Biggie]\nAll I want is hoes, big booty hoes\nCheck it out, here's another one\nAll I want is hoes, big booty hoes\n(Don't take em to the crib unless they bonin)\n\n[Verse 3: Too $hort]\nIt's after midnight, it's time to come up\nFuckin with some sluts tryin to bust a nut\nI ain't seen this many hoes in a long time\nI wanna make em all mine (get down ho)\nBut it's gettin kinda late, and I cain't wait\nBitch fuck a first date\nI pulled out my dick, she called me rude..\n.. but then she ate it like food (tramp)\nThen she noticed the limp and the whip\nRecognize game, you've been pimped by a pimp\nThrow all that trick shit, out the window\nYou come up short tryin to doubt the pimp ho\nToo $hort baby, straight from Oakland\nHo money is my fix and I can't be broken\nFreak bitches all on my dick\nWe on some Brooklyn - Oakland, California shit (beotch!)\n\n[Hook: Too $hort & Biggie]\nAll I want is hoes, big booty hoes\nCheck it out, here's another one\nAll I want is hoes, big booty hoes\n(Don't take em to the crib unless they bonin)\n\n[Outro: Too $hort]\nYou knew I was a dog when you met me bitch (BITCH)\nHa ha, fo' sho' (YEAHH)\nTell you anything you wanna hear right about now\nTo the spot, that's where we goin baby\nSee we goin to the spot\nDo our thang like we always do\nYou ain't know?", "image": "https://images.genius.com/5fa56d7da6cf3fe54995d91d7120c735.500x500x1.jpg"}], "artist": "The Notorious B.I.G."}