{"songs": [{"title": "Grown Ass Kid", "album": "Grown Ass Kid", "year": "2016-05-12", "lyrics": "[Verse 1: Mick Jenkins]\nFuck with me y'all\nI mean either way you stuck with me y'all\nI'm coming at these rap niggas first\nAnd for most that's unluckily y'all\nBetter know it\nJust a mustard seed dog that I ever really needed\nNigga's just tryna see Jesus\nSipping water like it come with different cheeses\nAll of your opinions facetious, it's feces\nI got a thesis or slick dissertation\nOur entire species is young and impatient and passive\nAll at the same damn time, why? Chi to kill them with kindness\nHit them with the Visine, try to cure the blindness\nCouple coffee beans for the sinus\nFolgers the best part of waking up\nIs the alignment of self with God, and that isn't for a selfish heart\nMy intention was to flood the scene\nI don't ever really hug the scene\nY'all know I been submarine with this shit\nLittle more Actavis how I lean with this shit\nBlack as hell, still the cream of this crop\nWith dream, no king just Ving Rhames with six shots\nIt's the dawn of the dead and I feel so alive\nAnd the free been in here you can tell by my mind, like\n\n[Hook: Arima Ederra]\nYou just a grown ass kid, who the fuck do you think you is?\nThe sun is only half way risen, you haven't come out your crib\nYou just a grown ass boy, get up out of here with all that noise\nYou ain't ever gonna find no joy playin' yourself like a toy, you just a...\nYou just a grown ass kid, who the fuck do you think you is?\nThe sun is only half way up, you steady talking that shit\nYou just a grown ass boy, get up out of here with all that noise\nYou ain't ever gonna find no joy playin' yourself like a toy, you just a...\n\n[Verse 2: Chance the Rapper]\nLazy male complaining about how in high school he could, but his ACL\nAy be clear, this my daddy house, you just the uncle from ATL\n(Better take out that trash)\nBoy get your big....grown ass on\nOld ass home, broke ass drinking up all the milk\nBut can't do no laundry, e-Harmony romance on\nWatch your tone folk, talking to grown folk\nYeah, yeah, get that bass out your voice, you were sounding like Tone Lōc\nNow watch how I move, different chapters\nDecisions, missions, visit pastors\nEverybody finally can say it out loud, \"My favorite rapper a Christian rapper\"\nAnd he got fate in his faith in his soul\nAnd a tape, and a cape and that drape from out west\nTo the lake and it cover his face like a Bape\nAnd I hate when I wait but it never come late\nFrom tobacco back roads to bus seat back rows\nA Black boy, black rose, back rolls\nMen grow just as surely as mountains peak and plateaus plateau, ya kna wha' mean?\n\n[Hook: Arima Ederra]\nYou just a grown ass kid, who the fuck do you think you is?\nThe sun is only half way risen, you haven't come out your crib\nYou just a grown ass boy, get up out of here with all that noise\nYou ain't ever gonna find no joy playin' yourself like a toy\nBoy you just a...\n\n[Verse 3: Alex Wiley]\nKinda crazy how it fall up in your lap right?\nShit was determined in a past life\nIf you ask nicely, mad, nice\nEven with mad lights you couldn't see the boy\nUp in class like I'm only half right, they ain't believe the boy\nWave when you pass them, moments you should bask in\nWonder if the Lord's on my side, let me ask him, or ask her\nI don't need a password, don't ask about my past word\nLiving until my last words, wondering if this music got the slash in\nDon't forget the cash and mix in with the passion, oh\nIf I don't feel the love then I'mma pass end\nShit is everlasting, I'mma have a blast and uh\nI'mma have a good day, I'mma stay zonin'\nI might get high as shit or I might stay sober\nMight roll a J and I might just pass it\nMight hit the Bay and I might trip acid\nThey tried to treat us like some bummy little sneakers\nI tell 'em \"When you dream, make sure that you dream big\"\nYou could be cool and an Uber driver\nThe next minute you in Aruba, you scuba divin'\nI hope they sell you the truth and that you survivin'\nDon't do how they gon' scrutinize 'em\nAnd looking at the youth, tryna euthanize 'em\nIf it was up to you they would nuke the projects\n\n[Outro: Ha Ha Davis]\nGet up off that bed, big fella\nYou a grown boy, big fella\nYou need your diaper change, big fella\nYou still catching a bus nigga and living at mom's crib, big fella\nYou been tryna get money\nYou only got ten singles in your pocket, big fella\nGet up now, big fella, find you a job\nStill playing Xbox 360, you ain't even got an Xbox One\nYou got a PS one and an Xbox 360, big fella\nGo find you a job, today, right now, big fella\nThe sun is almost gone, big fella\nGet up now, big fella\n(...playin' yourself like a toy\nBoy you just a...)\nGet up, big fella\nWhat is you doing?\nYou been sleeping all day, big fella\nYou ain't even got no pillows or no cover or no sheets on your bed, big fella\nIt's time to find another hustle, big fella\nThat scamming ain't cutting it, big fella\nGet up now\nGet up, get up, get up, big fella", "image": "https://images.genius.com/26bbe1d303cde614fd8ce4e18e780066.500x500x1.jpg"}], "artist": "Chance the Rapper"}