{"songs": [{"title": "Where Ya Heart At", "album": "Murda Muzik", "year": "1999-04-27", "lyrics": "[Intro: Prodigy]\nLets do it, dunn...\nI mean, that's why I keep my mouth tight\nAin't got no words for y'all niggas, man...y'all niggas is crazy\n\n[Verse 1: Prodigy]\nHey yo, its hell on earth down here the pavement scorching\nIt's molten rock when the Mobb walks in\nShit gets hot like a ill pot of grits spilled on you\nSpit fire with nines but never squealed on you\nI understood, you should try to take my life\nIf I was you I would too, damn right\nIf I had drama with a nigga like such as myself\nI couldn't even sleep at night until I made things right\nPull out guns, exchange a fight\nBe the first to let off mines, ignite the pipes...\nAnd never let the daylight decieve\nDuring the sun's hours niggas do bleed\nAim for the waist and something on the top gets shot\nNiggas can't shoot, never made a thing drop\nKeep cream of the crop\nFresh out of box shit filled to the top\nSmell the barrell when it's bolt-locked, nigga\n\n[Chorus 1: Prodigy]\nHave you ever lost a loved one?\nOr never understood love 'til you lost one?\nWhere your heart at?\nI left mines behind with my dearly departed\nWhere your heart at?\nStrength missing, to take losses is the hardest\nThe ones that overcome be the calmest\nStrive regardless. Where your heart at? Brave-hearted\nNow lets find out where niggas hearts' at\n\n[Verse 2: Havoc]\nThis is to my physical, you gone, to me you still here\nI be buggin' thinking how you doin' up there\nProbably watching over me, calling out my fouls\nFuck with mad chicks but I take care of my child\nI miss that ass, tell God I said \"Pardon me\"\nIf You're real; He'll forgive me [no doubt]\nBut I ain't crying no more about how you're gone\nUsed to hold me down; niggas front, it's on\nAin't sweating going to jail, you better shoot me\nJust lost my heart-If I die, you comin' wit' me\nQuickly, while I'm pissy\nThey're just bitches that's a little too frisky, risky\nOn point, hope these cats is getting the point\nWhisper out my name, stare but please don't point\nCall me paranoid\nBut I'm on point, close by the stash joint\nGot you in my mind, I guess that's why the say love is blind\n\n[Chorus 2: Prodigy]\nStrength missing, we take losses, be the hardest\nThe ones that overcome be the calmest, strive regardless\nWhere your heart at? Brave-hearted\nYou better finish what you started, dunn\nIf you ever lost a loved one\nYou'll never understand love 'til you lost one\nWhere your heart at?\nI left mine behind with my dearly departed\nWhere your heart at?\nStrength missing, to take losses be the hardest\nThe ones that overcome be the calmest, strive regardless\nWhere your heart at? Brave-hearted\nNow let's find out where niggas' hearts at\nHave you ever lost a loved one?\nYou'll never understand love 'til you lost one\nWhere your heart at?\nI left mines behind wit' my dearly departed\nNow where your heart at?\n\n[Verse 3: Prodigy]\nI find myself dozing off with it [guns]\nWaking up every forty minutes [dunn]\nSoaking wet, dripped to death in it\nOn top of rules, big barrels and tools get tested\nAnd hittin' off makes my dick get erected\nWe all strive for a better tomorrow\nBut as far as today, your ass gotsta pay\nAnd ain't no time better than the present one at hand\nAnd never keep your shit too far from your hand\n\n[Verse 4: Havoc]\nThink about this are you with your hands on who you running with\nSome timers, playa haters and dick riders\nBent niggas that be crashin' into dividers\nGettin' you into shit, got that ass tied up\nGot them la'd up, got you comin' out of your vault\nWith no plans of giving back, live in serious debt\nYour lady fucking other niggas, you a fool for her\nTalking 'bout you got money, you just using her\nActually losin' her...", "image": "https://images.genius.com/550b89543b907f703f98597d3c19b1f0.1000x1000x1.jpg"}], "artist": "Mobb Deep"}