{"songs": [{"title": "Sway ABFF Freestyle", "album": null, "year": "2016-05-31", "lyrics": "[Verse 1: Common]\nHot damn, black America again\nThink of Sandra Bland as I'm staring in the wind\nThe color of my skin, they comparing it to sin\nThe darker it gets the less fairer it has been\nThe hate, the hate made, I inherited from them\nBut I ain't gon' point the finger\nWe got anointed singers\nLike Nina, Marvin, Billie, Stevie\nNeed to hear them songs\nSometimes to believe me\nWho freed me, Lincoln or Cadillac?\nDrinking or battle raps?\nOr is it God's speed that we travel at\nEndangered in our own habitat\nThem guns and dope, man y'all can have it back\nAs a matter fact, we them lab rats\nYou built the projects for, now you want ya hood back\nI guess if you could rap, you would express it too\nThat PTSD, we need professionals\nYou know what pressure do, it makes the pipes bust\nFrom schools to prison y'all, they tryna pipe us\n'Til your political parties invite us\nInstead of making voting laws to spite us\nYou know, you know we from a family of fighters\nFought in, our wars and your wars, you put a nigga in Star Wars\nMaybe you need two, and then maybe then we'll believe you\nSee black people, in the future, we wasn't shipped here\nTo rob and shoot ya\nWe hold these truths to be self-evident\nAll men and women are created equal, including black Americans\nYeah, that's black America again\n\n[Verse 2: Common]\nWe go here, we go here, here we go again\nTrayvon'll never get to be an older man\nBlack children, they childhood stole from them\nRobbed of our names and our language, stole again\nWho stole the soul from black folk?\nSame man that stole the land from chief black smoke\nAnd made the whip crackle on our back slow\nMade us go through the back door\nAnd raffle black bodies on the slave blocks\nNow we slaves to the blocks cause on 'em we spray shots\nLeaving our own to lay in a box\nBlack mothers' stomach stay in a knots\nWe kill each other, more than the cops\nI wish the hating would stop\nWe are at war, in a battle with us\nI know that black lives matter, do they matter to us?\nThese are the things we gotta discuss\nThe new plantation, mass-incarceration\nInstead of educate, they'd rather convict the kids\nAs dirty as the water in Flint, the system is\nIs it a felony? or a misdemeanor?\nMaria Sharapova making more than Serena\nIt took Viola Davis to say this\nThe roles of the help and the gangstas is really all they gave us\nWe need Avas, Ta-Nehisis, and Cory Bookers\nThe salt of the Earth, they get the salt with sugar\nAnd greasy foods, I don't believe the news\nOr radio, stereotypes we refuse\nBrainwashed in the cycle to spin\nWe write our own story, black America again", "image": "https://images.genius.com/b17d102850bdaf360b9797ebf46e55f7.800x440x1.jpg"}], "artist": "Common"}