{"songs": [{"title": "I’m Ready For You (Full Length)", "album": null, "year": null, "lyrics": "[Drake: Verse 1]\nR.I.P. to the girl you used to see\nHer days are over. Baby she's over\nI've decided to give you all of me\nBaby come closer, baby come closer\nI'm ready for ya!\nKill 'em all, switch it up\nPut it on, zip it up\nLet my perfume, soak into your sweater\nSay you'll be here soon, sooner the better\nNo option for her, you sayin' no\nI run this game, just play your role\nFollow my lead, whatchu waitin' fo'?\nThought it over and decided tonight is the night\n\n(Background voice)\nYeah I hear you talkin', don't know who you tryin' to flatter\nGot my mind made up. I-I-I'm ready for ya\nI'm in control, but with you bein' a man\nYou don't seem to understand that I-I-I'm ready for ya\nI-I-I'm ready for ya\nI-I-I'm ready for ya\nSo keep thinkin' you the man\nCause it's all part of my plan\nI-I-I'm ready for ya\nNothin' on, I strut around\nI do it big, I shut it down\nI wonder if you'll be able to handle me\nMental picture, no cameras please\n(Background voice)\n\n[Drake - Verse 2]\nUh, red lipstick on the wine glass cameras in my mind\nFlash, black lingerie white diamonds, what a contrast\nI know you get impatient as the time pass, you say you want it fast\nDefine fast, cause I can speed it up, and make it last\nAnd I could audition for this, and I could be part of the cast\nAnd I could produce for your future, I could co-direct your past\nAnd make damn sure you never forget it, commited, im ready, im with it\nStill here like a statue, pink champagne, green ink in your tattoos\nYou say you got bagges, well im packed too, plus I got a sex pistol\nPointed right at you \"BANG!\", the baddest women ever in the heart of south\nProven over and over again thats why im hard to doubt, plus im\nYoung money 'till the death, I took the carter route\nIm more than ready too, hope of something that you thought about\n[Hook]\n\n[End]\n\nArtist: Drake", "image": "https://images.genius.com/e8e4af9d70633a1703ccd3faf671871c.640x640x1.jpg"}], "artist": "Drake"}