{"songs": [{"title": "Going Through Changes", "album": "Recovery", "year": "2010-06-18", "lyrics": "[Chorus: Ozzy Osbourne]\nI'm going through changes\nI'm going through changes\n\n[Verse 1: Eminem]\nLately I really feel like I'm rollin' for delf\nLike Philly, feel like I'm losin' control of myself\nI sincerely apologize if all that I sound like\nIs I'm complainin' but life keeps on complicatin'\nAnd I'm debatin' on leavin' this world this evenin'\nEven my girls can see I'm grievin', I try and hide it\nBut I can't, why do I act like I'm all high and mighty\nWhen inside I'm dyin'? I am finally realizin' I need\nHelp, can't do it myself, too weak\nTwo weeks I've been havin' ups and downs goin' through peaks\nAnd valleys, dilly-dallyin' 'round with the idea\nOf endin' this shit right here,  I'm hatin' my reflection\nI walk around the house tryna fight mirrors\nI can't stand what I look like, yeah I look fat\nBut what do I care? I give a fuck\nOnly thing I fear's Hailie, I'm afraid if I close my eyes, that I might see her... shit\n\n[Chorus: Ozzy Osbourne]\nI'm going through changes\nI'm going through changes\n\n[Verse 2: Eminem]\nI lock myself in the bedroom, bathroom, nappin' at noon\nYeah, Dad's in a bad mood, he's always snappin' at you\nMarshall, what happened that you can't stop with these pills?\nAnd you've fallen off with your skills and your own fans are laughin' at you\nIt become a problem you're too pussy to tackle? Get up\nBe a man, stand, a real man woulda had this shit handled\nKnow you just had your heart ripped out and crushed\nThey say Proof just flipped out, homie just whipped out and bust\nNah, it ain't like Doody to do that, he wouldn't fuckin'\nShoot at nobody, he'd fight first, but dwellin'\nOn it only makes the night worse, now I'm poppin' Vics, Percs\nAnd Methadone pills, \"Yeah, Em, tight verse\nYou killed it!\" Fuckin' drug dealers hang around me like yes men\nAnd they gon' do whatever I says when I says it\nIt's in their best interest to protect their investment\nAnd I just lost my fuckin' best friend, so fuck it, I guess then—\n\n[Chorus: Eminem (& Ozzy Osbourne)]\n(I'm going through changes) Don’t know what I’m gonna do\n(I'm going through changes) But I just keep on going through changes\n\n[Verse 3: Eminem & Hailie Jade]\nMy friends can't understand this new me, that's understandable\nMan, but think how bananas you'd be, you'd be an animal too\nIf you were trapped in this fame and caged in it like a zoo\nAnd everybody's lookin' at you, what you want me to do?\nI'm startin' to live like a recluse\nAnd the truth is, fame's startin' to give me an excuse\nTo be at an all-time low; I sit alone in my home theater\nWatchin' the same damn DVD of the\nFirst tour; the last tour, he was still alive\nAnd it hurts so I fast forward, sleeping pills'll make me feel alright\nAnd if I'm still awake in the middle of the night\nI'll just take a couple more, yeah, you're motherfuckin' right\nI ain't slowin' down for no one, I am almost homeward bound\nAlmost in a coma, yeah homie, come on, dole 'em out!\n\"Daddy, don't you die on me! Daddy, better hold your ground!\"\nFuck, don't I know the sound of that voice? Yeah, baby, hold me down (Daddy!)\n\n[Chorus: Eminem, Hailie Jade (& Ozzy Osbourne)]\n(I'm going through changes) (Daddy!) Don’t know what I’m gonna do\n(I'm going through changes) But I just keep on going through changes\n\n[Verse 4: Eminem]\nWake up in the hospital, full of tubes, but somehow I'm pullin' through\nSwear when I come back I'ma be bulletproof\nI'ma do it just for Proof, I think I should state a few\nFacts, 'cause I may not get a chance again to say the truth\nShit, it just hit me that what if I would not've made it through?\nI think about the things I woulda never got to say to you\nI'd never get to make it right, so here's what I came to do\nHailie, this one is for you, Whitney and Alaina too\nI still love your mother, that'll never change\nThink about her every day, we just could never get it together, hey\nWish there was a better way for me to say it\nBut I swear on everything, I'd do anything for her on any day\nThere are just too many things to explain, when it rains\nGuess it pours — yes, it does, wish there wasn't any pain\nBut I can't pretend there ain't, I ain't placin' any blame\nI ain't pointin' fingers, Heaven knows I've never been a saint\nI know that it feels like we just pissed away our history\nAnd just today I looked at your picture, almost if to say\nI miss you subconsciously, wish it didn't end this way\nBut I just had to get away, don't know why, I don't know what else to say, I guess I'm—\n\n[Chorus: Eminem (& Ozzy Osbourne)]\n(I'm going through changes) Don’t know what I’m gonna do\n(I'm going through changes) But I just keep on going through changes", "image": "https://images.genius.com/7b93181ae4ed594c902bf7e4e2149ca7.1000x1000x1.jpg"}], "artist": "Eminem"}