{"songs": [{"title": "High Life", "album": null, "year": null, "lyrics": "Verse:\n\nSo high, what's beneath me, I can't even call it high\nLike taking holders when the season started\nIt ain't much to say when actions speak for themselves\nSo just the fact that I'm in this motherfucker means I'm balling\nSo next time you take shots keep an extra cartridge\nNiggers handcuffing hoes like the police department\nYou think you flying but you really falling\nYou just ain't hit the concrete yet nigga, you're stalling\nThey say pop means being popular to the population\nSo excuse me for being the topic of your conversation\nI just keep banging verses and rocking your mama's braces\nWhat you blaze in a week, that's what I start my day with\nMy checks worth more than your net worth\nI got a network about the size of the next earth\nI'm laid up, so much head that my neck hurt\nI'm living a dream, I never once with the bed first you dig\nSo what should I do with so much hate?\nFuck it, I turn crabs into bucket to a buffet\nAnd beef to a filet;  that's a full-course Entrée\nAnd girl I turn that avocado to some guacamole\nSo Spanish girls only, we can skip the foreplay\nRoll up some good haze and stay high for 4 days\nWe can do it 4 ways, left right, up down\nMy cup running over but I won't put my cup down\nYou haters cheer-leading while I'm out here running touch downs\nBut I won't be ran down, I run shit, you ran down\n[?] Blowing whistles like please get the sun down\nMe while I'm globetrotting from sun up to sun down\nBut still I'm straight, [?]\nNo time to play cause I know they don't want me on top, [?]\nBut still I'm blazed, so many trees, don't need no shades\nLiving that Stamp Life, I think my passport need mo' space\n\nOutro:\n\nHaha, yeah, it's B. O. B.O. Bitch\nAll you hater, I don't even wanna hear no\nI don't even know why I got smoked for...\nBut still man, you know how I do it\nGrand hustle in the building, yo\n... It's a problem, yo, feel it...", "image": "https://images.genius.com/3252379f345638f5b880f5055e0ca791.540x540x1.jpg"}], "artist": "B.o.B"}