{"songs": [{"title": "Run", "album": "The Devil’s Night Mixtape", "year": "2015-10-30", "lyrics": "[Intro]\nSwifty McVay: Got him, in the scope\nPerson 2: Man hit this nigga man\nSwifty McVay: Damn nigga. Stand still motherfucker\nPerson 2: Man go ahead hit that nigga, come on we gotta get the fuck on\nSwifty McVay: The leaves in the way\nPerson 2: What?\nSwifty McVay: Shut up nigga I got this\nPerson 2: Hit that nigga\nSwifty McVay: I'm 'bout to hit him. I got him\n*Gun cocks*\n*Bang*\n\nRun...\n\n[Verse 1: Swifty McVay]\nDuct tape her, put the video tape and rape her\nAnd fuck favors, I'm a criminal with a major\nDisruptive membrane that's never letting go of the beef\nI'm no stranger, streets paid with blood stains\nI strangler her loose, wrangle a jump suit\nMachete and leather boots\nI'm severing whatever nigga sold you crack\nAnd told you to expose your scrotum to these whores and you click-clack, remember that\n[?] the pain, have you niggas ducking like the hunchback of Notre-Dame\nFuckers ain't gon' say a thing\nHuggin a burner, you acting like you trying to murder\nLike a marine that's never been overseas\nI heard the niggas like you\nI can turn your city against any nigga willing to send me an invite\nWhoever double-cross me\nThen already walked across my first line\nSo its dandelions and curse time\n\n[Hook]\nRun\nIt’s a nigga running behind you, you better hopin' for he don't find you, you know you better\nRun\nHearing them bullets whistlin' by you\nYou see the red dots are around you, you know you better\nRun\nThose niggas really trying to kill you, you better hopin' for he won't kill you, you know you better\nRun\n\n[Verse 2: Kuniva]\nBlack gloves, black hat, black hoodie,black gat\nFlashlight attached to [?] where the clap at\nNigga, get your [?] on, my [?] on\nBullets leave the group, let 'em get a solo *gunshot*\n[?], head on the council, pick the lock, backdoor, dead the whole household\nYou want murder? Take a flight out here (c'mon)\nWhen the hammer sparks, you gon' get a bright idea (c'mon)\nYou better *gunshot* the other way, before I (Run) to the car\nWhen you (Run) start playin', you don't (Run) to Bizarre (Yeah)\nI leave a nigga slomp, a pistol grip will make your adrenaline pump (shit)\nI blow your clothes backwards, criss-cross your ass\nMake your whole body jump (jump) (jump)\nThis is gangsta shit like a John Gotti dump\nPeople that's been shot before, they keep tellin' you that shit ain't fun (fun) (fun)\nIf you get the chance, yo you better\n\n[Hook]\nRun\nIt’s a nigga running behind you, you better hopin' for he don't find you, you know you better\nRun\nHearing them bullets whistlin' by you\nYou see the red dots are around you, you know you better\nRun\nThose niggas really trying to kill you, you better hopin' for he won't kill you, you know you better\nRun", "image": "https://images.genius.com/66678b06c44c6843cfd77955e8887e02.500x500x1.jpg"}], "artist": "D12"}