{"songs": [{"title": "Westside Story", "album": "The Documentary", "year": "2004-09-07", "lyrics": "[Verse 1: The Game]\nCrip niggas, Blood niggas, ese's, Asians\nDominicans, Puerto Ricans, white boys, Jamaicans\nLatin Kings, Disciples, Vice Lords, Haitians\nAll these motherfuckers been patiently waitin'\nSince the West coast fell off, the streets been watchin'\nThe West coast never fell off, I was asleep in Compton\nAftermath been here, the beats been knockin'\nNate Dogg doin' his thing, DPG still poppin'\nI got California Love, fuckin' bitches to that 'Pac shit\nAnd Westside Connection, been had it locked bitch\nI'm in the rearview, my guns is cockin'\nI put red dots on that nigga head like Rodman\nAll Stars, fat laces, gun charge, court cases\nFought that, not guilty, I'm back, niggas hate me\nBeen there, done that, sold crack, got jacked\nGot shot, came back, jumped on Dre's back\nPayback, homey I'm bringin' C.A. back\nAnd I don't do button up shirts or drive Maybachs\nAll you old record labels tryin' to advance\nAftermath bitch, take it like a muh'fuckin' man\n\n[Chorus: 50 Cent]\nIf you take a look in my eyes\nYou see I'll be a gangsta till I die\nThat California chronic got me so high\nGame tell 'em where you from, nigga Westside\nIf you take a look in my eyes\nYou see I'll be a gangsta till I die\nThat California chronic got me so high\nGame tell 'em where you from, nigga Westside\n\n[Verse 2: The Game]\nI'm lowridin' homey, six trey Impala\nGold D's spinnin', chrome hydraulics\nRun up on my lo-lo, you stop breathin'\nHollow tips make niggas disappear like Houdini\nGang bangin' is real, homey I'm living proof\nLike Snoop Dogg, C-walkin' on top of the devil's roof\nRap critics wanna converse about this and that\nCause red strings in his Converse, and this a Dre track\nKeep jibbin' and jabbin', I pull the .38\nMagnum and get to clickin' and clackin', your homies wanna know\nWhat happened come to Compton see Thriller like Mike Jackson\nI might be Spike Lee of this gun clappin'\nPrior to rappin', I was drug traffickin'\nIn the dope spot playin' John Madden\nHomey I ain't braggin', I took five\nYou wanna die, run up on that black 745\n\n[Chorus: 50 Cent]\nIf you take a look in my eyes\nYou see I'll be a gangsta till I die\nThat California chronic got me so high\nGame tell 'em where you from, nigga Westside\nIf you take a look in my eyes\nYou see I'll be a gangsta till I die\nThat California chronic got me so high\nGame tell 'em where you from, nigga Westside\n\n[Verse 3: The Game]\nNew York, New York, big city of dreams\nI got my L.A. Dodger fitted on, I'm doin' my thing\nGot me fuckin' with G-Unit, you know the drama that bring\nI got niggas in Westside Compton and Southside Queens\nAnd Buck told me in Cashville I'm good when I come through\nSo I ain't gotta tuck in my chain like DJ Pooh\nI'm gangsta - more like Deebo when he was Zeus\nPlay Bishop, I paint that picture, now who got the Juice?\nYou niggas is Nutso, I take off your roof\nLeave yo' ass stretched out like a Cadillac coupe\nGod gotta let me in heaven, all the shit I've been through\nI was a O.G. in the hood before I turned twenty-two\nHomey I let the .38 special ripped through that vest\nAnd I don't contemplate whether or not he left his shit on the dresser\nGot Compton on my back, I'm startin' to feel the pressure\nI'm lyrically Kool G. Rap on these Dre records\n\n[Chorus: 50 Cent]\nIf you take a look in my eyes\nYou see I'll be a gangsta till I die\nThat California chronic got me so high\nGame tell 'em where you from, nigga Westside\nIf you take a look in my eyes\nYou see I'll be a gangsta till I die\nThat California chronic got me so high\nGame tell 'em where you from, nigga Westside (nigga Westside)", "image": "https://images.genius.com/d555eb24af5930287973f88b035d1a21.300x300x1.jpg"}], "artist": "The Game"}