{"songs": [{"title": "Spellbound (The Original)", "album": "Unleashed & Unreleased", "year": "1998-01-01", "lyrics": "Solo don't spell like this one, Know what I'm sayin'?\nNeed to get at me with dat dumb shit\nHit me dawg. Hey Wood, what's up dawg\nOhh, Uhh. Check it out yall. Big vees on the muthf**king tables\nThis how it's goin dizzee\n\nSpell Bound\nIt ain't hard to tell\nYou go crazy, when the S-P-E-L-L\nYou won't catch it or match it\nBut ounce you how much it\nHeats up the crowd\nYo beats but won't touch it\nAs long as I'm the D-M-X\nThe rhymes are D-O-B-E cold\nD-A-M-E-G-E-N- E-M-C-E-E\nI K-I-L-L the K-I-L-L to W-O-R-K U-N-T-I-L\nI hit the fest and up the best of them all\nS-P-E-L-L-I-N-G until they fall\nDropping like an F-L-Y the T-R-Y to get built\nThe D-M-X will allways die\nAnother body in the M-O-R-G-U-E\nYou will be trying to battle and can't emcee\nS-P-E-L-L-B-O-U-N-D this the S-T-Y-L-E I like the to U-S-E\nWhen I am rhyming I R-I-P-P-I-N-G\nGet picked on timing I'm in my P-R-I-M-E\nThe D-M-X E-L-I-M-I-N-A-T-S C-O-M-P-E-T-I-T-I-O-N and the rest\nMy hoe in K-R-E-S the dub B-R-O-N-X\nMahnhattan, Brooklyn or G-U-E-E-N-S\nS ment I ment for O-M\nAnd I'm gone have to show them\nBut if they R-P-I-T-E or S I do not they them\nHow can I S-P-E-L-L\n\n\nW-E-L-L\nRaising some H-E-L-L\nWeighting to be L-L\nStaying after T-O-P\nI'm R-U-G-G-E-D\nAnd if you went to Do B-E-T-T-L-E then see me\nBut you will L-O-S-E-H-E-I-N-S-T\nMe the D-M-X cause I'm the D-O-P-E-S-T\nI'll allways be a A-T- and A E-M-C-E-E\nThere hasen't been a part to S-T-E-P -T-O- M-E\nS-T-Y-L-E that is W-I-L-D\nIt's Spellbound\nThats a N-A-M-E\nPumpin' lyrics that are based on my abillity to spell\nThat I just f**k it up it ain't hard to tell\n\nDMX: Yeah. Keep that goin' babe. Cause I'm 'gon show 'em somthin' real on the spellbound tip. Imma show 'em somthin', You know what I'm sayin'? Imma show 'em some real shit, right here\nUh, check it out yall, check it, check it, check it out yall. Now tell me if you catch what I'm sayin, baby. I'm on some shit like, umm...\nVerse #2:\nI am T-H-E- O-R-I-G-I-N-A-L- A-U-T-H-O-R- O-F- S-P-E-L-L-P-O-U-N-D cause X\nM-A-R-X- T-H-E- S-P-O-T\nNow\nD-I-D-N-Apostrophe-T- U- T-R-Y T-O- B-I-T-E And R-H-Y-M-E U-S-I-N-G an S-T-Y-L-E that was made by me?\nO-F- CO-U-R-S-E Y-O-U- D-I-D so D-O-N-T L-I-E\nB-E-C-A-U-S-E Y-O-U-R-E C-A-U-G-H-T\nAll you T-T-H-E-R-E hatin' D S-T-R-A-I-G-H-T U-P\nB-U-S-T-E-D- C-H-U-M-P- N-O-W- W-H-A-T\n\nNow what the f**k I spelled was...\n\"Didn't you try to bite the rhyme, using the style that was made by me?\nOf course you did, So don't lie, because you could out there and straight bust it chump\nNow what?\"\nYou know what I'm sayin. Now thats what mutherf**kers that have to rewind on they tapedeck\nYah mean. Catch it if you can baby. Spellbound", "image": "https://images.rapgenius.com/c048ed75e001e7462e2f3445177e4821.500x500x1.jpg"}], "artist": "DMX"}