{"songs": [{"title": "Defeated", "album": "Bible of Love", "year": "2018-03-16", "lyrics": "[Prayer]\nFather, we pray this morning for the spirit of wisdom and revelation, and the knowledge of Jesus Christ\nWe thank You and we pray for the sick, the shut-in\nWe pray for the young people, we pray for the babies\nWe pray for everyone that's sick this morning\nEveryone that's lost this morning\nIn the name of Jesus, we thank You\nHallelujah, we thank You for Your love, we thank You for Your power, thank You\nFor You are greater than all\n\n[Chorus]\nSatan, the Lord rebuke you\nSatan, the Lord rebuke you\nSatan, the Lord rebuke you\nHe's defeated again\n\n[Verse 1: John P. Kee]\nChanged my hustle to witness\nAll the things I did wrong\nGave me a brand new message -\nGave me a brand new song\nSo now I can't be threatened\nBy the drama and the tricks you bring\nFor I will not be defeated -\nFor there is joy in the song that I sing\n\n[Chorus]\n(Satan)\nSatan, the Lord rebuke you. (Oh Satan)\nSatan, the Lord rebuke you. (Satan, the Lord Rebuke you)\nSatan, the Lord rebuke you. (Ooh, yeah yeah, yeah yeah yeah yeah)\nHe's defeated (defeated) again (again - everybody)\n\nSatan, the Lord rebuke you. (Ooh, Satan the Lord rebuke ya')\nSatan, the Lord rebuke you. (Rebuke you, yeah)\nSatan, the Lord rebuke you. (You are defeated)\nHe's defeated again. (again - listen)\n\n[Verse 2]\nOpen your ears - open your eyes\nEverything you're trying to do\nYou gotta know, gotta reinvent it\n(or we will) never gain and introduce to you. (oh my)\nThe enemy promised (enemy, he promised) said he promised\nHe'll steal and destroy\nBut the Bible says, no weapon formed against me\nWill prosper or take my joy!\nMy joy!\n\n[Chorus]\nSatan, the Lord rebuke you. (Wooh! Satan, the Lord rebuke you.)\nSatan, the Lord rebuke you. (Hah, Ooh, Satan)\nSatan, the Lord rebuke you. (Rebuke you - yeah)\nHe's defeated again. (Defeated wooh - everybody sing)\n\nSatan, the Lord rebuke you. (He is)\nSatan, the Lord rebuke you. (He's rebuked in here, he is)\nSatan, the Lord rebuke you. (Yo Snoop, y'all break it down for me)\n\n[Bridge]\nHe's defeated (Can I get a real witness in here)\nHe's defeated (Now I don't look like the things I been through, somebody help me)\nHe's defeated (Can you grab somebody's hand and rock with me, good evening)\nHe's defeated (I need a few of the holies to open your mouth and say it with me - oh!)\n\nHe's defeated (I don't fear the terror by night)\nHe's defeated (Nor do I fear the arrow by day, uh huh)\nHe's defeated (Jesus made me a promise)\nHe's defeated (He has all power in His hand)\n\nHe's defeated again!\n\n(Oh Lord, we rebuke the devourer and deceiver...)", "image": "https://images.genius.com/c9dee508f81bde784b713142dc6009e9.600x600x1.jpg"}], "artist": "Snoop Dogg"}