{"songs": [{"title": "Sky High", "album": "Flight School", "year": "2009-04-17", "lyrics": "[Hook]\nYeah they talk but I can't hear what they say\nCause I'm flyin sware they see me but I'm too many miles away\nCause I'm flying in the air your all the way down and I'm flyin\nTo the sky I don't touch the ground! I'm flyin\nSo high I can touch the sky [x8]\n\n[Verse 1]\nI’m living this movie, you niggas like TiVo\nSee the same things twice, nothing like me though\nMan they can dream, flow like a whole kilo\nNow I got your bitch, try and find me like nemo\nSpend a lot of cash, can’t front I might leave broke\nOne life to live, 800 on the weed smoke\nStacks for them Guccis like, fuck it im'a need those\nYoung superstar, but were feelin like heroes\nTop down, and im flying like an eagle\nTats on my neck, face, hands like a cholo\nAll about my Green, bout my Green like Gino\nStars in my face, no scars no Cino\nSmile hard, (hard) swag real mean though\nPaid enough for it, show my ass with my jeans low\nStarted from the bottom, now made it like zero\n/got it on lockdown, feeling like nino\n\n[Hook]\nYeah they talk but I can't hear what they say\nCause I'm flyin sware they see me but I'm too many miles away\nCause I'm flying in the air your all the way down and I'm flyin\nTo the sky I don't touch the ground! I'm flyin\nSo high I can touch the sky [x8]\n\n[Verse 2]\nNow I'm in florida yeah they know me there too\nWalkin with jewels out showin all my tattoos\nCan't say my name right but they know I'm that dude\nWalk 54 place niggas eatin fast food\nBrother out in Lauderdale cousin down in FAMU\nSo that means I got a plug good drugs when I land too\nKnow I'm underage not much that I can't do\nYou don't talk money that's why I can't understand you\nSee I'm hot now going for a grammy though\nThink this bitch bad you should see my Miami ho\nDown in south beach met her at the Cameo\nTold her what my life like took her to the Sagamore\n100 grand on my neck just cause I gotta glow\nNever buyin dubs, whole zips what I gotta blow\nAlways dressed to impress you can tell\nShe love my cologne that's money that you smell yeah!\n\n[Hook]\nYeah they talk but I can't hear what they say\nCause I'm flyin sware they see me but I'm too many miles away\nCause I'm flying in the air your all the way down and I'm flyin\nTo the sky I don't touch the ground! I'm flyin\nSo high I can touch the sky [x8]", "image": "https://images.genius.com/87ca659a586e891811e781b44890aa4a.400x400x1.jpg"}], "artist": "Wiz Khalifa"}