{"songs": [{"title": "Milky Cereal", "album": "Mama Said Knock You Out", "year": "1990-08-28", "lyrics": "[Intro]\nOoh yeah\nMh\nHey yo, man\nAin't nothin' like a nice bowl of cornflakes in the morning\nTo smooth you out\n\n[Chorus]\nMilky cereal\n(Baby)\nMilky cereal\nMilky cereal\n(Baby)\nMilky cereal\n\n[Verse 1]\nMirror, mirror on the wall\nWho's the baddest female of them all?\nIt was Frosted Flake, she loved to bowl\nAnd although her skin was white she had a lot of soul\nRich female, very debonnaire\nDrivin' a Rolls with rollers in her hair\nWe was hangin' out, pumpin' the stereo\nShe took me to a club, I think the name was Cheerio's\nShe walked like she was jumpin' a hurdle\nI was happy as a kid that just saw _Mutant Ninja Turtles_\nA guy walked over, said, \"Your earring's cute\"\nI said, \"I'm wearin' a earring, but it ain't no Fruit Loop\"\nMe and Frosted went to get a drink\nBut she ordered somethin' bugged and I ain't know what to think\nShe ordered potassium, calcium\nCarbohydrate scotch with sodium\nShe took me to her crib, threw me on the couch\nI woke up the next morning with a spoon in my mouth\nShe's\n\n[Chorus]\nMilky cereal\n(Baby)\nMilky cereal\nMilky cereal\n(Baby)\nMilky cereal\nMilky cereal\n(Baby)\nMilky cereal\nMilky cereal\n(Baby)\nMilky cereal\n\n[Vesre 2]\nI went to Vegas, didn't think it'd do any harm\nI walked into this girl named Lucky Charm\nFor some reason we walked in the rain\nShe had a four-leaf clover with a big gold chain\nShe had a salary that was full of calories, for real\nAnd I was in the mood for a homecooked meal\nSo we went to be alone\nBut we had to be quiet, cause her Corn Pops was home\nKissed her neck, kissed her back, kissed her arms\nI said, \"Forget it, let me see your Lucky Charms\"\nWhen we began her hairstyle was neat\nBut when I left the next morning it looked like Shredded Wheat\nTalked about marriage, I said, \"That's risky\nBesides, it's such a waste of Rice Krispies\"\nShe had a robe with the velours material\nHer pops woke up, I said, \"Hello Mr. Cereal\nI came this morning to deliver the paper\"\nHe said, \"Stop frontin', I know you caught the vapors\nThat's my daughter, so save your croonin\nYou better find another bowl of cereal to stick your spoon in\"\n\n[Chorus]\nMilky cereal\n(Baby)\nMilky cereal\nMilky cereal\n(Baby)\nMilky cereal\nMilky cereal\n(Baby)\nMilky cereal\nMilky cereal\n(Baby)\nMilky cereal\nYeah, check this out here:\n\n[Verse 3]\nThen there was Pebbles, times was rough\nShe was turnin' tricks to get her \"coo-coo puff!\"\nHer mind was gone, but she turned me on, in fact\nShe was wearin' an Apple Jack hat\nWith a full-link fox and some pink bobby-socks\nHer father had a greedy disease, fried chicken pox\nWe called him Hungry Jack\nHe talked like pops, and then he dressed like The Mack\nHe invited me out to lunch\nWith a old army buddy of his, Captain Crunch\nThe waiter said, \"Jack, what would you like today?\"\nHe said, \"I don't know, just make it Special, 'K?\"\nHe said, \"Cool,\" came back with the order\nThat's when I said, \"Hey yo, Jack, I like your daughter\"\nHe said, \"Pebbles? Boy, are you crazy?\"\nI said, \"Nah, I wanna ride in a Mercedes\"\nShe could sing while I'm swingin' my thing\nCause her burgers taste better than Burger King\"\nHe said, \"Go party? Do some minglin'?\nYou and my daughter? Your brain must be jinglin!\"\nI said, \"It's smooth, no disrespect\nShe'll sign a pre-nup, so she don't get half of my week check\"\nThen we walked down the aisle\nOur honeymoon was milky - cereal style\nYou know what I'm sayin'?\n\n[Chorus]\nMilky cereal\n(Baby)\nMilky cereal\nMilky cereal\n(Baby)\nMilky cereal\nMilky cereal\n(Baby)\nMilky cereal\nMilky cereal\n(Baby)\nMilky cereal\nMilky\n\n[Outro]\nHa-ha-ha\nPeace!", "image": "https://images.genius.com/22e65b653eb6ded3289c8de99a5e66f7.1000x1000x1.jpg"}], "artist": "LL Cool J"}