{"songs": [{"title": "What’s Ya Poison", "album": "Murda Muzik", "year": "1999-08-17", "lyrics": "[Intro: Prodigy]\nFucking clown ass niggas, man\n(Uh huh, uh huh, uh huh, uh huh, uh huh)\nFuck wrong with these niggas, man\nWord to mother son\nThat good shit\nThis shit right here (gotta bring shit back, man)\nShould give you strength, nigga (knahmean?)\nShould keep you healthy\n(That's what I'm talking about)\nWord up, dunn\n\n[Verse 1: Prodigy]\nYo, my rap taste good in my mouth like Deer Park\nFor your ears to list-this\nYou don't wanna miss this, dunn\nDon't be a statistic\nKeep your rhymes to yourself, we make fools out of niggas\nAnd write shit that certainly'll move y'all niggas\nPeace, to my Sumner villains in pink houses\nFrom Red Hook, to QB, y'all know the routine\nWe need a movie to show how our life so ill\nEvery summer in the projects we partied on the benches\nA few gallons of gin and Pepsi\nRemember party balls (I remember that shit)\nThat was back in like '90\nWe used to roll oo-wees, now we stuff Dutches\nBing bust it, what's your discussion\nY'all niggas talk a lot of shit heard you on the tape frontin'\nI fakes nothin', ya fuck around and push the wrong button\nI dedicate my days to seein' you drip blood\nWill always love Gambo and Scarface\nKilla Black, no man can fill your shoes\nNow what's bad news\nIt couldn't get no worse, so what y'all niggas know about the turmoil\nWhat y'all know about the blood, soil, clothes and little hoes\nAnd the legs of pants, slugs that crack the shin bone\nThe other shots blast through your left clavicle\nMelt switch suits and paint the avenues\n\n[Verse 2: Havoc]\nHow you want it, bent, ski'd or straight blunted?\nMedium rare, raw? Havoc just over done it\nAnd while you sittin' there whisperin', like a little girl\nFuck, waitin' around 'til the dutchie gets twirled\nWe going at you, not 'cause we want to but 'cause we have to\nRevoke situation that you couldn't last through\nIf I can't have it all, then I don't want it at all\nOff top serious dog, I'm out for the brawl\nBattle the world, shit I kick'll dazzle your girl\nHandle the bitch\nCan't? Then take this referral\nHit 'em with the pink slip, get 'em bent to earl\nHennessy got my mind locked, tight in a curl\nHold it down like Saddam, you can't search my crib\nEven with dirty worms I'ma still appear\n\n[Break: Havoc]\nHow you want it, bent, ski'd or straight blunted?\nHow you want it, bent, ski'd or straight blunted?\n\n[Verse 3: Cormega]\nYo, yo, my pen is sick like a heroin addict, whenever Mega spits\nI exhale preciseness, drug dealer ghetto shit\nSweat in my hand, plus the finger numb from measuring grams\nGun on my waist, in case I see son, who wetted my man\nI be Gore-Texing to death, rockin' ice with special effects\nIt's obvious that I was destined to rep\nYo my persona is the drama, my Infamous conglomerates\nConsidered mad real, niggas feel the Montana shit\nBorn official, my niggas that's gone I miss you\nI shed a tear, see y'all niggas when I get there\nYo my dunn did six years and still didn't hit the strip\nI'm waiting on the day, when Rikers Island ciphers incomplete\nWhen I can sleep with no heat, hidden beneath the sheet\nAnd I can relax with my Air Max, appearing on my feet\nWhen I rhyme you enter my mind\nSeein' niggas need the excellence\nI represent is manifested in the beat\nRespect this, like a Lexus Jeep\nMy technique, leaves my enemies stressed for weeks, vexed at me\nEspecially knowin' my destiny is near\nThey scared to death of me, they fear\nTo even question me, I serve 'em like I'm stretchin' keys, please\n\n[Outro: Havoc]\nHow you want it, bent, ski'd or straight blunted?\nHow you want it, bent, ski'd or straight blunted?\nHow you want it, bent, ski'd or straight blunted?\nHow you want it, bent, ski'd or straight blunted?", "image": "https://images.genius.com/550b89543b907f703f98597d3c19b1f0.1000x1000x1.jpg"}], "artist": "Mobb Deep"}