{"songs": [{"title": "The Plug", "album": "Self Made Volume 3", "year": "2016-01-16", "lyrics": "[Intro: Papi & Meek Mill]\n(Maybach Music) Hello? (Yo)\nMeek que hay papi (what's good?)\nShit, llego eso (come on man)\nVeinte (come on man, that ain't right)\nQuince (I'ma come holla at you in person, Papi)\nVamos donde tu estas yo voy pa ya ahora\nMeet me on the Northside, 23rd and Berks, man\n(I'ma be right here wit it) Dalé\n\n[Verse 1: Meek Mill]\nWord to my son man, I don't let them see the monster in me\nLoad my 30, leave the crib and bring that choppa with me\nI run them streets and make it home soon as my momma hit me\nPut my son to sleep and right back to the drama quickly\nPapi said he got them bricks and we gon' take 'em down\nI call Omelly, \"Bring them shooters, we gon' break it down\"\nHe said he coming and he coming in with 80 pounds\nWe finna line a nigga up and we gon' take 'em down\n\"Hello\" (Dimelo?) \"Papi, where you at?\"\n(En camino) He said it's in and I'm like, \"Papi, bring the set\"\nHe brought his shooter, I'ma prolly bring the MAC\nI spent my money on a lawyer and it's time to get it back\nI got niggas in the bushes and they lurking\nYoung niggas barely legal but they murking\nI hit them with the Desert Eagle and it's curtains\nI'ma shoot him in his head cause I heard that nigga working\n\n[Interlude: Omelly & Vock]\nHey Vock man, what's the deal man?\nIt's Omelly, what's poppin? (What's up cool?)\nHeh, ain't shit chillin\nAy, but look tho, I got a sting for us\nGet the fuck outta here! What's the score?\n80 joints nigga, heh (80 joints?! Who?)\nMeek connect man (get the fuck outta here, Papi?!)\nYeah man, just bring the ladders man\nAre you kidding me? Say no more man, I'm on my way\n\n[Verse 2: Omelly]\nRiding four deep, on my way to Meek\nSaid he got a lick for us, know this nigga sweet\nSaid he got 80 jawns, who to call but me?\nSo I called my dogs cause my dogs gotta eat\nLet him off the leash, now it's time to feast\nGot McDonald's money but I'm tryna eat Philippe's\nTired of all this drought shit, this broke shit ain't me\nIf this sting go right, it's gon' put me on my feet where I need to be\nI ain't lying Meek, this nigga move, I'm leaving him\nI got some loose cannons and they all agreeing with me\nBlack glove, black hoodies, I brought the team with me\nBlack strap, MAC-10, brought the machines with me\nNow we slidin' down the North, to 23rd and Berks\nCause Papi, he got that work\nYoung hitters, they with me, they tryna murk\nI just tell them, \"Chill, we gon' take him for what he worth\", uhh\n\n[Interlude: Papi & Young Breed]\nYo, these fucking mama bichos, these fucking cocksuckers\nWhat, what's up, Papi? Talk to me\nThey tryna set me up, huh? (Who?)\nThey tryna take my gold (who?! Who want problems?!)\nOh no, Papi, not today, I need you here (it's too easy)\nI have a ticket waiting for you in Miami International\nAnd Breed, one more thing: dios me lo bendiga\nI'm ready to eat baby, let's get it\n\n[Verse 3: Young Breed]\nYeah, ay\nLoad up the AK and the motherfuckin' MAC-11\nHundred thangs to a dope boy, fucking blessing\nHit up Boobie, told him, \"Meet me on 183rd\"\nFunny how 187 get your boy hundred birds\nBang, Dade County niggas ain't a game\nWe call them sticks missed calls, they gon' let 'em ring\nSKs, I just grabbed last month nigga\nMy new shooter ain't prayed in a month nigga\nGot the devil in him, all he know is M-1s\nTold him bring back all the paper into 10 tons\nSee them boys selling dope, just a day job\nBut dropping bodies how they really pay the bill boy\nSo Papi, how you want it? Body bag, closed casket\nKeep it clean, let them live, bring back all the dope and cash?\nPaper right, on sight, boy that's just how it go\nTell them how you want it, Papi (matalo!)\n\n[Outro: Papi]\nI told these mama bichos not to fuck wit me\nEsto es \"Self Made 3\" papa, and this is \"The Plug\"\nGriselda Blanco lives, Griselda Blanco lives\n(Maybach Music)", "image": "https://images.genius.com/a0e5d4137e24ca9bb8d23cbf6a051f80.500x500x1.jpg"}], "artist": "Meek Mill"}