{"songs": [{"title": "Blow It Out (Remix)", "album": "Chicken-n-Beer", "year": null, "lyrics": "[Ludacris]\nOWWWWWWW!!!\n\n[Verse - Ludacris]\nI never used to snore in my sleep till this rap shit started\nWarm thoughts fill the hot-headed and cold-hearted\nYour whole paycheck, you burp it and then fart it\nAnd y'all think I'm gon stop?! BLOW IT OUT YOUR ASS!\nIn one year I got rich, now life's movin so fast\nBut bein broke with no food is just a thing of the past\nPlus I'm the new phenomenon like white women with ass\nAnd y'all prayin that I flop?! BLOW IT OUT YOUR ASS!\nIn New York I buy clothing, in Cali I get green\nIn Atlanta I get sleep, in Texas I sip lean\nAll these rappers wanna know what I'm gettin for sixteens\nTry 80, want a discount? BLOW IT OUT YOUR ASS!\nSee in just six months I infiltrated the system\nIf you find somebody better, then I'm sorry I missed him\nNiggas hate givin me props cause I might use it against them\nC'mon, get Ludacris out! BLOW IT OUT YOUR ASS!\n\n[Hook - Ludacris] (2x)\nIf you mad I'm on top, then wish me gone\nIf you mad I'm on the road, then wish me home\nAnd if you mad that I'm right, punk wish me wrong\nBut after your three wishes - BLOW IT OUT YOUR ASS!\n\n[Verse - Ludacris]\nIt's time to saddle up the Tontos cause I'm the Lone Ranger\nI eat dinner with Jews but don't talk to strangers\nI'm just a few albums from filling your disc changer\nIf you ever think of stoppin me - BLOW IT OUT YOUR ASS!\nI'm a hustler by nature but criminal by law\nAny charges set against me, chunk it up and stand tall\nNext year I'm lookin into buyin Greenbriar Mall\nYou probably own a lot of proper-ty! BLOW IT OUT YOUR ASS!\nC'mon and take a look, he's got gigantic balls!\nPlus his money keeps flowin like Niagara Falls\nWe all know Jesus saves and Ludacris withdraws\nI'm bout to go on vacation - BLOW IT OUT YOUR ASS!\nShout out to Bill O'Reilly, I'm a throw you a curve\nYou mad cause I'm a THIEF and got away with words\nI'm a start my own beverage, it'll calm your nerves\nPepsi's the New Generation? - BLOW IT OUT YOUR ASS!\n\n[Hook]\n\n[Verse - 50 Cent]\nThese niggas be frontin, they hate it when we stunting\nThey see us in Caddy's and coupes and Benz's and it's nothing\nThey act like they got something, we don't deserve - something\nNigga hate it, like it or love it or - BLOW IT OUT YOUR ASS!\nIt's simple, top of the charts, number one wit a bullet\nDisturbin Tha Peace and G G G G Unit!\nGot it locked boy, get ya shot boy\nYou don't like that we're on top boy, okay - BLOW IT OUT YOUR ASS!\nFrom NY to ATL, we get it crunk bitch\nSemi-auto on my waist, I don't play that pump shit\nMotherfuckers think that I blew up real fast\nBut I've been underground a long time so BLOW IT OUT YOUR ASS!\nI got candy paint, on my '65\nImpala holla at my shorty if you ready to ride\nWhacha mean your ass ain't got money for gas?\nThen get the fuck out, you're mad? so what, BLOW IT OUT YOUR ASS!\n\n[Hook]\n\n[Outro - Ludacris]\nYeah! History has been made!\nLudacris and 50 Cent! real recognize real\nIf you're feeling a little awkward about the situation\nDon't hesistate to just BLOW IT OUT YOUR ASS!", "image": "https://images.genius.com/1498cf277a7dc50ffc916ca191c3608f.1000x1000x1.jpg"}], "artist": "Ludacris"}