{"songs": [{"title": "1-900-LL Cool J", "album": "Walking with a Panther", "year": "1989-06-09", "lyrics": "{*phone rings twice*}\nYo.. \"Hello 1-900-LL Cool J?\"\nYeah whassup? \"Can you please bust a funky rhyme for me?\"\nYeah I can do that, check this one out honey\n\nI motivate, accelerate\nDevastate, and dominate\nI don't smoke crack so I won't lose weight\nGive me the {pussy} and the money and the mic and I'm straight\nGo to a restaurant, give me steak\nThen cook my chicken with Shake'n'Bake\nI leave all the preachin to Reverand Flake\nHow much money can one black man make? Huh\nI'm what's known as a true dynamiter\nI write rhymes fast without a typewriter\nGo with the flow, but no, I'm not a biter\nCan't compare a cock-a-roach and a spider\nHell, you might as well get a glass of punch\nCause you're bitin my lyrics like a Nestle Crunch, huh\nAnd bitin my rhymes ain't slick\nI got your gold teeth marks all over my dick\nComplications and aggravation\nAn unnecessary-sation\nI'm like Sunkist, good vibrations\nYour al-blum, sounds like a compilation\nCool out, grab a seat and listen..\nCause I'mma start dismissin\nSucker MC's who's out there frontin\nTalkin all that yang, yo you smokin somethin\nShoulda treated me royal, yo he wasn't loyal\nNow it's all about chaos and turmoil\nGimme that microphone\nI'mma show you the real meaning of the danger zone\n\n{*phone rings*}\nYo.. \"Hello is this 1-900-LL Cool J?\"\nYeah whassup? \"Can you tell me what you do when you're coolin out?\"\nYo check this out\n\nNow when I'm coolin out, no time for a granny\nJust a fly girl in t-shirt and panties\n\"Can LL screw?\" Man, can he!\nI tell you what, give up the fanny\nCause on a bedroom tune, J's swift\nNot too big, but nothin to play with\nIn addition, you on a mission\nYou need to audition for another position\nDoin damage is a crew tradition\nName your next al-blum intermission\nYou're full of preservatives -- plus\nYou're too conservative\nI'm full of flair, savoir faire, debonairre\nThere's no competition for this here\nSo don't waste your time and breath\nI'm givin you all a big F\nMC's I envelop\nAs the song goes on, the rhyme develops\nI'm asiatic, acrobatic, charismatic\nYou don't want no static\nAnyway, I ain't havin it\nWhen I see the microphone -- I'm grabbin it\nPlug it in and take charge\nLL XL, Xtra-Large\nKnowhatI'msayin? Peace\n\n{*phone rings three times*}\nHello?\nHello whassup girl?\nHow you doin girl? I been tryin to call you all day\nWord up I was talkin to LL he was kickin some mo' HYPED up rhymes to me\nWord, I spoke to him today too - them rhymes WAS pumpin\nWell not to cut you short but I gotta go cause my man is here\nAlright\nSee-ya", "image": "https://images.genius.com/35b951a9c90707d0d03de9bebbadefc6.999x999x1.jpg"}], "artist": "LL Cool J"}