{"songs": [{"title": "This Can’t Be Life", "album": null, "year": null, "lyrics": "(feat. Jay-Z)\n\n[Jay-Z]\nGeah.. whassup?\nWhere's all my street niggas, project niggas\nReal niggas, worldwide\nLet's reflect.. e'rybody got a story\nWe all ghetto B - here's mine\nGeah\n\nSee I was -- born in sewage, born to make bomb music\nFlow tight like I was born Jewish\nUsed the streets as a conduit - I kept arms\n38 longs inside my mom's Buick\nAt any given moment Shawn could lose it, be on the news\nIron cuffs - arms through it; or stuffed with embalmin fluid\nShit, I'm goin through it - mom dukes too\nTears streamin down her pretty face, she got her palms to it\nMy life is gettin too wild\nI need to bring some sort kinda calm to it\nBout to lose it; voices screamin \"Don't do it!\"\nIt's like '93, '94, bout the year\nThat Big and Mag dropped; and \"Illmatic\" rocked\nOutta every rag drop, and the West had it locked\nEverybody doin 'em, I'm still scratchin on the block\nLike \"Damn; I'ma be a failure\"\nSurrounded by thugs, drugs, and drug - paraphenalia\nCops courts, and their thoughts is to derail us\nThree time felons in shorts with jealous thoughts\nTryin figure where your mail is, guesstimate the weight you sellin\nSo they can send shots straight to your melon; wait!\nIt gets worse, baby momma water burst\nBaby came out stillborn, still I gotta move on\nThough my heart still torn, life gone from her womb\nDon't worry, if it was meant to be, it'll be -- soon\n\n[Chorus: Jay-Z]\nThis can't be life, this can't be love\nThis can't be right, there's gotta be more, this can't be us\nThis can't be life, this can't be love\nThis can't be right, there's gotta be more, this can't be us\n\n[Beanie Sigel]\nChill dog\nSecond oldest born, from Michelle Brown my mother\nHell bound, grew with two sisters and one brother\nPop wasn't around, so many stories that's another\nI'm thinkin damn; how my older sister gon' make me tougher\nWhen steel sharpens steel, I'ma keep it real\nI'm tired of tryin to hide my pain behind the syrups and pills\nDead to the world, stretched out like a corpse for real\nY'all niggas thinkin what y'all readin in The Source is real\nWhat my life like, you lookin at the source, it's real\nWhat your life like? Mine dog, of course it's real\nPassin judgment, you niggas second-guessin Beans\nCause you don't eat swine don't make you Amin\nDog you know a couple suras, out the Qur'an\nI guess you all on your din and I ain't on mine\nStop that Akki, 'fore I send shots though your body\nMake 'em feel feel hell on earth before Allah drop thee\nI feel the line's drawn here, nuttin more can stop me\nTill them feds pick me up, or them boys pop me\nThere's only three things that make Mac not act like Beans\nAmatullah Tisha, Po Aldin, Samir Amin\nMy seeds dog, gotta teach 'em that before I leave dog\nShit I know that I'ma see 'em when I leave dog\nI come back in the afterlife\nLike fuck it I done touched hell twice; what's the meanin?\n\n[Chorus]\n[Scarface]\nYeah.. uhh..\nNow as I walk into the studio, to do this with Jig'\nI got a phone call from one of my nigs\nSaid my homeboy Reek, he just lost one of his kids\nAnd when I heard that I just broke into tears\nAnd see in the second hand; you don't really know how this is\nBut when it hits that close to home you feel the pain at the crib\nSo I called mine, and saddened my wife with the bad news\nNow we both depressed, countin our blessings cause Brad's two\nPrayin for young souls to laugh atlife through the stars\nLovin your kids just like you was ours\nAnd I'm hurtin for you dog; but ain't nobody pain is like yours\nI just know that heaven'll open these doors\nAnd ain't no bright side to losin lifel; but you can view it like this\nGod's got open hands homey, he in the midst.. of good company\nWho loves all and hates not one\nAnd one day you gon' be wit your son\nI could've rapped about my hard times on this song\nBut heaven knows I woulda been wrong\nI wouldn'ta been right, it wouldn'ta been love\nIt wouldn'ta been life, it wouldn'ta been us\nThis can't be life\n\n[Chorus]\n[Jay-Z]\nThis can't be life..", "image": "https://images.genius.com/4a83e0fa554b5f2e5c5acce61362bbe7.1000x1000x1.png"}], "artist": "Scarface"}