{"songs": [{"title": "Real Estate", "album": "Royalty", "year": "2012-07-04", "lyrics": "[Chorus: Childish Gambino]\nI got a PJ for the whole crew\nPassport looking old news\nChampagne in a glasshouse\nOld money know what I’m about\nPut your money in that real estate\nI put my money in that real estate\nI put my money in that real estate\nNigga, I’m from Georgia, that’s the realest state\n\n[Verse 1: Childish Gambino]\nI’m feeling like New Zealand, charge it to the Am-Ex\nGotta use that latex or she living like a princess\nThey don’t wake you up in private, let a nigga sleep\nI got houses in the mountains, man Will Smith live down the street\nGot that generation money, my grandkids are assholes\nStacking something dummy, every verse I got got cash flow\nMonaco they loved me, I’m wearing something ugly\nBut they still know I’m rich though so my doo-rag lookin’ stuffy\nRollin’ with the royalty, Kauai is just my Camelot\nGlasshouse, champagne, white shirt, no socks, no top Saint Bart's\nPushin’ 997’s like I’m making fuckin’ phone calls\nHalf a mill' is low ball\nLot of diamonds light bright, whiskey older than Betty White\nSpot me on Dalmatian Croatian girls salvation us\nMake something of myself man\nSomebody let ’em know, ‘cause it’s that Eastside nigga (A-T-L!)\n\n[Chorus: Childish Gambino]\nI got a PJ for the whole crew\nPassport looking old news\nChampagne in a glasshouse\nOld money know what I’m about\nPut your money in that real estate\nI put my money in that real estate\nI put my money in that real estate\nNigga, I’m from Georgia, that’s the realest state\n\n[Verse 2: Alley Boy]\nRidin’ around with a whole meal, real estate, can a nigga live?\nGold slug, no ice grill, deal with Molly, no x pill\nGeorgia nigga I’m A-town, Eastside nationwide\nRep nigga like Tim Briggs, killed them, homicide\nReal estate that’s my estate Georgia peach like Big Meech\nMason Ave, that’s my street, we sellin’ crack on Front Street\nOld money got dust on it, old chopper got rust on it\nNew crib got a ticket on it, just cashed out seven figures on it\nBaby mama, stank bitch fought child support, I’m too rich\nPussy ho got lucky, you can pay your bills on my dick\nMy driver license’s suspended, but I’m still ridin’ in a Bentley\nI’m still strapped with that semi, real estate we winnin’\nMe and Childish Gambino plenty chips, no casino\nPoppin’ bottles with models, they gon' suck on some pronto\nPut my grill in your real estate, know I come from that realest state\nNiggas eatin' off our paper plate, we just copped them new Audi 8's\n\n[Chorus: Childish Gambino]\nI got a PJ for the whole crew\nPassport looking old news\nChampagne in a glasshouse\nOld money know what I’m about\nPut your money in that real estate\nI put my money in that real estate\nI put my money in that real estate\nNigga, I’m from Georgia, that’s the realest state\nI got a PJ for the whole crew\nPassport looking old news\nChampagne in a glasshouse\nOld money know what I’m about\nPut your money in that real estate\nI put my money in that real estate\nI put my money in that real estate\nNigga, I’m from Georgia, that’s the realest state\n\n[Outro: Swank]\nMan, Atlanta showing love too, man\nShout out to Eastside, shout out to Southside, Westside\nAnd fuck the Northside, man them niggas up there be testin’\nAin’t nothing changed man, we still get money out here\nRoyalty forever in this bitch\nGambino nigga, you know what I’m saying?\nThat new shit man\nOne time for the one time man, real nigga stand up\nTwo times for the bad bitches, three for the rich\nYou know what I’m talking about?\nYou know what it is man, yeah man\nMoney talk, bullshit walkin’ marathon\nReal niggas know what I’m talking about\nRoyalty forever motherfucker\nGambino forever motherfucker\nGet used to it, Royalty nigga, Royalty motherfucker\nMotherfucking Eastside stand up, Stone Mountain, L-town\nWe in this bitch like we fuckin' a dog or some shit, my nigga\nMan y’all motherfuckers already know what it is\nRoyalty forever in this bitch, bitch niggas fall back\nReal recognize real and y’all sucka niggas ain’t it\nYou feel me? Man don’t watch me, watch TV\nWait, ‘Bino on that shit too, God damn!\nMan, we gettin' that white people money, you heard that?\nMatter of fact Tina, tell these niggas what I’m talking about one time\n\n[Outro 2: Tina Fey]\nYeah, we in here, we in this thing\nGambino is forever, Royalty is forever\nWe ballin’ ‘till we fuckin’ up the hardwood homey\nThis is the life we live, son\nMy president is black and my Prius is blue, motherfucker\nRoyalty all day, we droppin’ racks in Nordstroms, son\nThat’s racks on racks, damn it\nYou feel me? You feel me?\nThis is the part where most people would say something crazy and drop the n-word after it\nNot going to, not gonna do that\nI don’t feel comfortable\nI’m out!", "image": "https://images.genius.com/587833871590a682c8aed1b739f0cb23.906x905x1.jpg"}], "artist": "Childish Gambino"}