{"songs": [{"title": "Beef Is Ova", "album": null, "year": null, "lyrics": "[Intro: Proof]\n*Chants: HELL YEAH*\nAyo, the big Proof\n1 sixth of D12, one half of Promatic\nAll life after death\nI heard you, nigga, I heard you, my TV is big like a truck\nForreal, nigga, I do roll deep nigga cause i'm a boss bitch\nSee me on them streets ya hear me?\nYou ain't making my heart hurt nigga\nGonna make y'all hurt\nYo Killa Kaunn where the fuck you at nigga?\n\n[Verse 1: Killa Kaunn]\nI'm sick of these punk pussy rappers yapping and flexed\nPut the Tech to the back of your neck and let it stretch\nRoyce ain't the king of shit, and i'mma delete the Elite\nHow you a gangsta but you never in the streets?\nI'll put you in a coma when you rolling up Magoda\n2 shots at y'all Range Rover, game over\nWhere the fuck is the truth when i'm up in the booth\nPurple Gang, Killa Kaunn, bitch i'm riding with Proof\nMy guns will burn like the Seesraw sakes, bet yo ass get a grouse, That's why you the next Malcolm X\nTre Little gon' get dropped like Ja Ja's own label\nAnd we only see your videos on Comcast Cable\nLocal punk pussy, wishing you was burn in Queens\nDonell Jones looking nigga, born to sing\nWhat is y'all, a crew of \"has been\" thugs?\nWait, you can't be a \"has been\" where your ass never was\nRoyce you charred and feathered up, stop fucking with us fo' we blow your truck\nWe fucking you up\nJa Ja's screaming, \"Where's the love for me?\"\nThat’s what happen when your ass a whore in the industry\nAnd my voice get lost, and still get you a sale\nPlus you bitch ass niggas do it via E-Mail\nThis is Killa Kaunn, top gun in this joint\nDude, my guns is blazing and they aiming at Royce\nI'm the number one street nigga\nI got deadly aim, and you faggots won't remain, Bullet to your brain\nIf you broke motherfuckers had a boss, I'll target that motherfucker, you already lost\nFuck Kino, he mad cause I won the Spitfest, that's a testament to the flow cause I spit best\nPurple Gang BITCH!\n\n[Hook: Proof]\nHey Detroit is you with me y'all? (HELL YEAH)\nIs Royce from Detroit? (NO)\nStraight off 7 Mile? (HELL NO)\nAin't he the king of the D? (NO)\nDo y'all love Royce from now? (HELL NO)\n\n[Verse 2: Flame]\nThis nigga's sick, but i'mma cure his cold\nThrow a tissue on a 40. Cal and blow his nose\nYou rock Rhinestones, you can't afford Diamonds\nYou the king of Wuss City stop lying (STOP LYING)\nGot shells flying, out the Tommy Gun\nNiggas bought his bootleg and wanted a refund\nNigga I ain't done, I always bring the drama\nYou wanna blow up, hugging a suicide bomber\nNigga I'll pop you if I see you on the streets\nBut I won't get a chance, you don't live in the D\nYou'll be resting in the peace if you cross the team\nI'm the type to shoot your ass, and scream out \"FREEZE!\"\nNigga please, you don't bust slugs\nYou a internet gangsta, a E-mail thug\nNever unloved, nigga, it's gonna be blood puddles\nYou're surrounded with more Eagles than McNabb in a huddle\n\n[Hook: Proof]\n(HELL YEAH!)\nY'all niggas scared of war? (NO)\nBow down to the king? (HELL NO)\nShouldn't I let this slide? (NO)\nY'all gonna let him outside? (HELL NO)\n\n[Verse 3: Famous]\nI said take this bitch down, and take his cash\nAnd shoot more holes in his face than a Jason mask\nThey whole crew is bitch and they captain his wood\nHe could get karafold but he not from the hood\nNigga this is Famous, East side weapon\nWe catch bodies like Firefighters on 9/11\nSo that chick better duck when they're tossed around\nA slug'll get y'all stomach shown like an ultrasound\nFuck what y'all niggas is on, my whole trick is the crew\nAnd Trey Little, we got AK's bigger than you (Bitch)\nAnd you better duck if one fire\nI'll have you with a locked at home with a vest on like the umpire\nDon't feel you with thugs and strongarms\nCause all the wheelchair's gonna give you is strong arms\nYeah, you little niggas, we got the streets locked\nAnd the only soldiers y'all ran with is a pair of Reeboks\nLike it or not I'm the hottest around\n40. Cal will blow Rhinestones up outta your crown\nLaying down, you sleeping with Tech's to your head\nWake you up with a toast like breakfast in bed\nIf you high and on P then you facing the streets\nThat's a whole lotta drama so watch your mouth\nCause if we drop by once and miss you, we gon' double back\nAnd pop your dumbass more times than the sheet of bubble wrap\n\n[Hook: Proof]\n\nDo they got street credit ? (NO)\nAin't they built for war ? (HELL NO)\nIs Detroit past 8 Mile ? (NO)\nDoes a real nigga lie ? (HELL NO)\n\n[Outro: Proof]\nAyo, it's over, I'm officially announcing, it's over\nAin't no beef out here, ain't no competition, it's grown ass men to boys, When it come to the street shit, ya heard me\nSo y’all motherfuckers keep it in the mic booth\nDon’t step out on the pavement, we live right there, you hear me, Purple Gang! Killa Kaunn! Famous! Flame! First Born! J-Hill! Kuniva! Real niggas, niga! They spit liver saliva. Godfather. I.F. 2 Death, Kaiser Sozet, We do what we ‘sposed to, picture me on the poster, it’s over", "image": "https://images.genius.com/a168ce2b6c86a86cfb53a6d996cdc8ca.304x400x1.png"}], "artist": "Proof"}