{"songs": [{"title": "G Funk Intro", "album": "Doggystyle", "year": "1993-11-23", "lyrics": "[Intro: George Clinton]\nYeah, this is another story about dogs\nFor the dog that don't pee on trees is a bitch\nSo says Snoop Dogg\nSo get your pooper scooper, 'cause the nigga's talkin shit\nRoof! Roof! Roof! Roof! Roof!\n\n[Verse 1: The Lady of Rage, (Dr. Dre), & Snoop Dogg]\nI'm sippin' on Tanqueray\nWith my mind on my money and my mouth fulla gan-jay\nR-A-G to the motherfuckin' E\nBack with my nigga, S-N-double-O-P\n(Yeah, and ya don't stop)\nRage in effect I just begun to rock\n(I said, yeah, and you don't quit)\nHey yo Rage, would you please drop some gangsta shit?\nI rock ruff and stuff with my Afro Puffs\nHandcuffed as I bust, 'bout to tear shit up\nOh, what? Did ya think I, didn't ever think I\nWould be the one to make you blink eye, I'm catchy like pink-eye\nNever will there ever be another like me\nUm, you can play the left, 'cause it ain't no right in me\nOut the picture, out the frame, out the box I knock 'em all\nSmack 'em out the park, like \"A Friendly Game of Baseball\"\nGrand slam, yes, I am\nKickin' up dust and I don't give a goddamn\n'Cause I'm that lyrical murderer, pleading guilty\nYou know from my skills I'm about to be–\nFilthy, large, Rage in charge\nYou know what's happenin', don't try to play Raj\nThis ain't no rerun, see hon', don't you wanna be one\nHowever, Rage'll wreck ya, 'cause I'm def\nI kick my vocals, I loc yo, coast to coast or local, uh\nI'll make 'em go coo-coo for my Cocoa\nPuffin' stuff, ayo Snoop, you're up\nLet these niggas know that niggas don't give a fuck\n\n[Bridge: Snoop Dogg]\nThis is just a small introduction to the G-funk era\nEveryday of my life I take a glimpse in the mirror\nAnd I see motherfuckers tryin' to be like me\nEver since I put it down with the D-R-E\n\n[Outro: George Clinton]\nFoamin' at the mouth and waggin' his tail\nSearchin through the yard with a keen sense of smell\nLookin' for the business in heat\nAnd when he find it he'll be sniffin her seat\nWe travel in packs and we do it from the back\nHow else can you get to the booty?\nWe do it doggystyle, all the while we do it doggystyle\nYo motherfuckin' hoe!\nHe fucked the fleas off the bitch, he shaked the ticks off his dick\nAnd in the booty, he buries his motherfuckin' bone\nAnd if there's any left over, he'll roll over and take a doggy bag home\n\n[Skit: Daz Dillinger & Snoop Dogg]\nDamn, that Tanqueray is talkin' to a nigga\nI ain't bullshittin', one of y'all niggas gotta get it\nMan, I got to piss\nBreath test?", "image": "https://images.genius.com/d31a03639b8f8f4259b9b9da07972d52.996x1000x1.jpg"}], "artist": "Snoop Dogg"}