{"songs": [{"title": "Make it Hurt", "album": "Genesis", "year": "2001-11-27", "lyrics": "We gon' change things\nYea, Genesis niggas\nWe gotta introduce y'all to the motherfuckin new millenium bounce\nYea, two-thousand and one hot shit hot shit c'mon\nAll my niggas in the place, all my bitches in the place\nC'mon, c'mon, let's get to it\nLet's get to it, let's get to it\nAll my niggas and my bitches let's get to it\nNew milleni-nigga bounce, new millenium bounce\nC'mon, c'mon, c'mon\n\n[Verse One]\nAiyyo it's colder than a muh'fucka, who just let the hawk in?\nNigga guess who just walked in?\nLynch, most (?) makes them other niggas sit upon the bench broke\nThen I step up in a trenchcoat nigga\nGot no time to be fuckin with them wonderama niggas\nLet me loosen up your bra-strap mama nigga\nLISTEN UP! Look how we be rippin up and got the party pickin up\nAnd got you niggas spittin up SHIT\nNo pain, nigga never no gain, nigga no strain\nO.D. into my cocaine music\nSpit that venom; pretty thick bitches walk by\nIf you let 'em pussy printin through they denim\nTake her for a ride 'round the block, let her enjoy the whip\nDrop her off, let her walk the strip\nAin't it funny how nature work?\nMake bitches wanna bounce on a nigga 'til they make it hurt, c'mon\n\n[Hook]\nShake yo' shit until you make it hurt\nThrow yo' pussy 'til you make it hurt\nPop that shit until you make it hurt\nBounce 'til you really wanna make it hurt\nNow bang yo' head until you make it hurt\nC'mon, stomp yo' feet until we make it hurt\nPound that shit until we make it hurt\nUntil we make it hurt, now let's make it hurt\n\n[Verse Two]\nAre we ever gonna stop nigga? HECK NO!\nShit now let me rip the muh'fucka from the get-go, nigga\nLet go 'fore you make a nigga wanna let the tec blow\nBitches dancin like a stepshow, nigga\nViolate nigga, you gets no love, ghetto\nOnly give a nigga show love ditto\nYour clique too little, fuck givin niggas a riddle\nFuck around I turn your wife into a widow\nNitro nigga, make you wanna wild on the floor\nLike a bunch of little psycho niggas\nPresto, shit we got a expo of bitches in here\nWhylin like a bunch of lesbo bitches\nThe best show of bitches, so electro bitches, c'mon\nGet on your mark, get ready set go bitches\nThen we go and add a little propane to it\nThen we send another whole flame through it\nClear everything in my path, before I split you in half\nYou wack nigga, better get you a staff\nThe freak bitches try to hit me with math\nBrushin off wack niggas while them same bitches givin me ass, yo\nNow let me give you more hot shit, just for the record\nAnd make bitches wanna get ass-naked, c'mon\nParty 'til you wanna lash out\nBetter yet, y'all niggas party 'til you motherfuckin pass out!\n\n[Hook]\n\n[Verse Three]\nC'mon! Throw yo' hands up high y'all\nLight yo' L, get high y'all\nShit you can't deny y'all\nDon't lie y'all, don't try y'all\nAll my niggas inside y'all\nC'mon, let's start that shit y'all\nC'mon, and you know we won't quit\nThen bang niggas with hit after hit y'all, c'mon\nIn the meantime nigga just pass me the Henny, c'mon\nLittle Cris' and a bottle of the Remi\nWrite a bit and STILL sortin it out\nFlipmode up in this muh'fucka nigga, whatchu talkin about?\nHold up - a lot of people ain't compatible nigga\nThey be buggin on how a nigga spend capital nigga\nAin't it funny how nature work?\nHot shit'll make 'em bounce 'til she really wanna make it hurt, c'mon\n\n[Hook] - repeat 2X", "image": "https://images.genius.com/4102489ca8934c81cdf553b85cec18fd.1000x1000x1.jpg"}], "artist": "Busta Rhymes"}