{"songs": [{"title": "Kill That Nigga", "album": "Infamy", "year": "2001-12-11", "lyrics": "[Intro - Havoc]\nYo, It's like this man, It's real simple\n\n[Verse 1 - Havoc]\nIf my nigga was my nigga like I thought he was\nWould he have snitched, hung me out the dry to fuck?\nGuess you don't know a nigga 'till you catch a case with 'em\nIt ain't all gravy just because you make cake with 'em\nIt's real, niggas scared to death of state prison\nTo the end when a nigga get caught start snitchin'\nImagine the eyes of a nigga that you knew\nFor about 20 joints with the nerve to point\nHurt worser than that physical pain\nYou fetish nigga roll with the sorry fuck, now he switchin' to lame\nNiggas in the box could relate to my pain\nAll I got is my word and I'mma get you thats my word\nThrough family friends or even fuckin' your bird\nFuck it anything long as your death occur\nWhatever happened to death before dishonor?\nIt's time for your end and it's my honor\n\n[Hook]\n(Kill that nigga)\nNever wish death, only if I have to, if it's my last option left\n(Kill that nigga)\nShould've kept your mouth tight he's losin' his life\nBe locked up or sending out kites\n\n[Verse 2 - Prodigy]\nAy yo this nigga runnin' 'round runnin' his mouth speakin' on the wrong shit\nWhat the fuck is this Dave Letterman shit on the late night\nCreep on the talk show as rap asses get shot in they throat, speak on that\nGirlie mouth nigga you worse than a bitch\nI done shot niggas for you, put my life at risk\nHow you gonna go behind me and knife my back?\nMust be insane and I got a cure for that\nMy hammer will knock sense in the nigga real quick\nNail a nigga tongue with the four fifth\nNigga you in violation of that code of silence\nNiggas like you get real niggas indicted!\nWe can't have that! Kidnap that bitch!\nTorture and torment that snitch!\nWe gotta make examples out these hummingbird fucks\nMatter fact pull 'em out the trunk, I'm bout to\n\nChorus (repeat 2x)\n\nNever wish death\n\nKill that nigga (3x)\n\nI'm sendin' out kites\n\nKill that nigga (4x)", "image": "https://images.genius.com/1e1ebfd1f79138a02b3cbced2c28bcf7.800x800x1.jpg"}], "artist": "Mobb Deep"}