{"songs": [{"title": "Squeeze the Trigger", "album": "Rhyme Pays", "year": "1987-11-04", "lyrics": "Yo Evil, what's up man? They be buggin', they won't play our records on the radio, man, say we violent, man. They need to look at the news, you know what I'm sayin'? They need to kill that noise. Man what you doin' with that up under your shirt? Aw, man, it's time we put some head out, word. Let's get busy, E. Come on, home boy\n\nSqueeze the trigger\n\nMan I'm tired of this nonsense, sweatin' my crew, tryin' to come to the show, searchin' my car, man I'm sick of the cops\n\nRampage on the stage, my crew's in a rage\nSearched my posse, found the Uzi but missed the 12 gauge\nManiac, I'm a rhyme brainiac, livin' on the edge of a razor, remember that\nCold rollin' thick as a shake, I'm rockin' hard as a quake\nI can live on bread and water or lobster and steak\nMy mind's a riot gun, there ain't none bigger\nAbout to unload the ammo, E squeeze the trigger\n\n(\"You fight...\") Got 'im! (\"...to live.\")\n\"Police still have no leads for the apprehension of [?]\"\n\"Has it ever occured to you? The president might be the one who wants you dead.\"\n\nThey say I'm violent, they should watch the T.V\nYou say I'm brutal, you should check your P.D\nYou made me, now your kids rave me\nI rap about the life that the city streets gave me\nMurder, intrigue, somebody must bleed\nMiami Vice is small time, L.A.'s the big league\nFrom the Rollin' '60s to the Nickerson G's\nPueblos, Grape Street, this is what I see\nThe Jungle, the '30s, the V.N.G\nLife in L.A. ain't no cup of tea\nAnd they be sayin' I'm illin', yo\n\nSqueeze the trigger\nGot 'im!\n\n\"Violence erupts at a Los Angeles hip hop concert. Rap music is blamed for violence\nViolence erupts at a New York hockey game. Hockey is blamed for violence\nViolence breaks out at a European soccer game. Soccer is blamed for violence\nViolence breaks out at a nuclear peace rally. Peace is blamed for violence.\"\n\nI've been dogged out by cops, shackled and socked\nPaid my dues to the streets, took my hard knocks\nDisrespected by snobs, damn near trampled by mobs\nPersecuted by squares workin' nine to five jobs\nBut like a panther I prowl, like a lion I growl\nLearn to see behind my back like the head of an owl\nI'm the voice of the youth, the prophet of truth\nWhat I speak is reality though some may say ruth-\n-less tactics are takin' by me to awaken\nPeople to life but I feel no fakin'\nNo jivin', no lyin', no frontin', no playin'\nSay exactly what's up, understand what I'm sayin'\nBan me, try it, you might cause a riot\nWhat the radio won't play, the underground will supply it\nI'm an MC pirate that's loud not quiet\nRadical as they make'em, make a rule I'll defy it\nCritics may say I'm wise, some may call my words lies\nI've lived more in one day than they will in their lives\nWith most due respect the words I inject\nKick credit for realism and the truth I project\nBecause I could bust rhymes for fun, or cut MC's like a knife\nBut the topic I love is the drama of life\nSo don't diss me don't dare, I feel you should care\nYou may think I'm soft but you're just unaware\nOf the wrath of the Ice enraged prepare\nFor a true nighmare\n\nSqueeze the trigger\n\nCops hate kids, kids hate cops, cops kill kids with warnin' shots\nWhat is crime and what in not? What is justice? I think I forgot\nWe buy weapons to keep us strong\nReagan sends guns where they don't belong\nThe controversy is thick and the drag is strong\nBut no matter the lies we all know who's wrong\nHomeless sleep on the city streets\nWaitin' to die with nothin' to eat\nWhile rich politicians soak their feet\nIn the pools at their ten million buck retreats\nPeople hate people for color of face\nNo one had a choice in the race we were placed\nA brother in Queens was beaten and chased\nMurdered cold in the streets, a goddamn disgrace\nJust because of his race, his life went to waste\nAnd no one went to jail when the court heard the case\nJustice or corruption? It's all interlaced\nHow can you swallow this? I can't stand the taste\n\nSqueeze the trigger\n\n[?]\n\nI get paid for illin', cold makin' a killin'\nMy pockets keep fillin', I got dollars to the ceilin'\nGot a safe in my floor, car got bullet-proof doors\nEvery time I rock the mic I leave you wishin' for more\nBecause my raps ain't bull, got cold stupid pull\nYou wanna eat my rhymes like candy, 'til your mind's over full\nBut most MC's today ain't got nothin' to say\nA to the mother fuckin' K\n\nSqueeze the trigger", "image": "https://images.genius.com/4087bd0151e7fc336a1bdb7aca3ef257.1000x1000x1.jpg"}], "artist": "Ice-T"}