{"songs": [{"title": "Hello (King)", "album": "King", "year": "2006-03-28", "lyrics": "[Intro]\nHey, what's happenin'?\nIt's been a minute, huh? I'm just hollerin'\nHow you doin?\n\n[Verse 1: T.I.]\nIt's been a minute since I seen ya, I fell off of the scene\nCause it seem like you wanted other things than the king\nWhy you fightin', fussin', cussin', and disagreein' with the king?\nWhen you got cribs, cars, bling, and a king with the king?\nIs the grass as green as it seemed in ya dreams\nAre you gettin' all the things that you needed and I ain't bring\nIt satisfy your self-esteem bein' seen on the screen?\nIs this new nigga the real thing or is just a little fling?\nDid he buy a nice bracelet and get you a little ring\nOr give you the attention and all of the little things?\nHe know what to do with the stuff that you stuff in them little jeans?\nDo he stand up and lean in it 'til you start screamin'\nOr smack your ass and kiss your g-string to start eatin?\nYou get how you need it, not only when it's convenient\nI just pick up the phone and call you every week or two\nTo let you know I miss you and see how that nigga treatin' you\n\n[Hook: Governor King]\nI remember morning, noon, and night I used to hold you tight\nI know we used to fuss and fight\nBut I'm just calling to say, \"Hello, hello baby\"\nSee time has its own funny way of keeping us close\nEven though we never stayed, together\nI just wanted to say, \"Hello, hello baby\"\n\n[Verse 2: T.I.]\nHello? Ay, it's me\nHey, what's happenin'? How ya doin'? I know plenty of niggas pursuin'\nThem panties, all for the screwin', fly you down to Miami\nLet you walk the red carpet when I'm out at the Grammys\nBut I'm what he can never be, a boss, understand me?\nYou pose and take pictures of things he buy for ya\nHe got you roses, but that don't mean that he'll die for ya\nHey, maybe I got too much pride to cry for ya\nBut not too much to call you and tell you that I adore ya\nAnd tell you how I'm missin you, lovin' you and kissin' you\nI think about the good old days and wanna visit you\nThis song I'd like to listen to whenever reminisicin' you\nYou, stay on my mind, never mind how I picture you\nThink about the past and all the time that I spent witchu\nRubbin' on that ass from behind as I dig in you\nNever been a doubt in my mind that I was diggin' you\nHow I love you shorty, you'll never find another nigga to\n\n[Hook]\n\n[Verse 3: Governor King]\nEvery now and then I think of you\nAnd I can't lie I be wantin' you\nBut I understand that I'm not your man\nAnd I also know that the future's not in your hands\nSo every now and then I'll call you\nTo say, \"How you doin'?\" and, \"Baby I miss you, girl\"\nThis is just to say, \"Hello, hello baby\"\n\n[Hook]", "image": "https://images.genius.com/757a45da6a6e4106770d36a71b9d8b5b.300x300x1.jpg"}], "artist": "T.I."}