{"songs": [{"title": "I’m Nice", "album": "The Bar Exam 2", "year": "2008-09-20", "lyrics": "[Intro]\nYou can see Green Lantern is invading the airwaves\nHe's invading the airwaves. Turn up the radio, turn up your radio\n\n[Hook]\nI'm grindin' till I'm tired\nCause you ain't grindin' until you die\nThat's way I'm grindin', that's why\nI'm losin' my mind, I spit through the day to get through the night\nGood lord I'm the shit, you niggas know I'm lethal\nI'm just wonderin' why you won't admit that I'm nice\nWhat the fuck you niggas tryna do tonight?\nMotherfucker I'm nice\n\n[Verse One]\nI don't need no ovation, MC with no patience\nDiddy called me to write it when he needed rotation\nWent to his location, wrote it for no pay then\nGave him my CD, while the streets was pulsatin'\nI guess my luck passed, yup, cause Puff passed\nPuff passed on me like the weed rotatin'\nNo hatin', he must be eatin' way too much cheesecake\nIf he think he can see an MC from his team take me\nThat ain't a diss though, it's just so frustratin'\nMakes you wanna go and shoot up stations\nSmack a DJ I don't like for nothin' basically\nIf I should die tonight I done been to enough places\nPlay some motherfuckin' Nas you bitch\nQuit ridin' dick, worryin' about Plies and Trick\nHe's just nice, Jesus Christ\nBut this is God you get, my new name should be Allah Who Spit\nMy vibe is sick, my CD in your car, bitch you ridin' with\nMore hot shit in it then Robbers Get, lava, saliva\nI'm prob-ally in L.A. gettin' into some head like a Dodger's fit\nWe oppo-site, let's be Frank like Sinatra\nShit, I'm the illest nigga out this bitch\nI'll empty every bullet out this clip, don't doubt this\nI'm on fire nigga, who gonna douse this?\n\n[Hook]\n\n[Verse Two]\nWe are not the same but I'm not a martian\nI'm an arson, I ride around drama-startin'\nI bet you niggas won't be wolfin' when that llama barkin'\nCause you can get the picture with some milk behind the carton\nWhat's beef? I play it one way\nViolate on Sunday get annihilated Monday (I'm nice)\nYou niggas is actors, what are you recordin'?\nI leave you bleedin', lyin' on the cuttin' room floor then\nListen to Joe Budden say, \"I fell the fuck off\"\nBut he ain't never fell on, I'm just gonna ignore him\nMake a nigga extra famous after I warn him\nDon't jump, you as gay as, Greg Louganis into that water\nYou don't want it, you can either have a nice afternoon\nOr you can have your family do the morning\nNothing can stop us, fly when nothin' can top us\nBeen hustling hip-hop since I went and fucked with the Doctor\nI know I sound high, but I will break you\nDo you like a cup at the opera, no thank you\nNigga I ain't buyin' them wolf tickets you sellin'\nI'm an artist, here's my pen, bury it with Magellan\nNigga who is you tellin'? I know that I'm nice\nLife is a gamble, I roll like I loaded my dice\nMy flow is my life, my talents just go with my pipes\nThat Phantom on them 20-20's and so is my sight\n\n[Hook]", "image": "https://images.genius.com/5b0c99ea857e85f30c22aa344281f869.320x320x1.jpg"}], "artist": "Royce da 5'9'’"}