{"songs": [{"title": "You", "album": "DIME TRAP", "year": "2018-10-05", "lyrics": "[Chorus: Teyana Taylor]\nTellin' me the things you that heard about\nNothin' good comes when you searchin' for the wrong things\nSomethin' feels off when I come around\nAskin' me questions like, \"What do I believe in?\"\n\"You,\" everyone's a saint 'til the church lets out\nThat goes for you too\nEverything ain't perfect but I do it for...\n\n[Verse 1: T.I.]\nWho is you to judge me?\nJust 'cause I'm drunk and stumblin' out the club, me, her and her girlfriend\nAin't nobody perfect but the Lord\nYou always quick to point out all my flaws when I was leaving out yours\nHere's a message little girls, little boy\nYou could be the dirtiest muh'fucker in the world but have morals\nDon't nobody give you nothin' 'less you work for it\nLadies get an education, you ain't gotta twerk for it\nYou know the Lord send you a sign, don't ignore it\nAnd that's whether you study from the Bible or Quran or the Torah\nWe original, indigenous, god among men\nIt's two things that's yours, your body and your sin\nGotta claim 'em, just like these so-called conservatives\nFight against the rights of homosexuals then go home and play with lil' kid\nShit, I promised all the shit that I'd ever did\nWas to move out and leave the hood and keep me from trappin' not up the river\nAnd my testimony my testament\nAll the bullshit that I seen happen in life turned me into a pessimist\nI'm cynical, yeah, I learned life is all about principle\nYou so judgmental 'cause you miserable\nAnd my inner peace ain't expendable\n\n[Chorus: Teyana Taylor]\nTellin' me the things you that heard about\nNothin' good comes when you searchin' for the wrong things\nSomethin' feels off when I come around\nAskin' me questions like, \"What do I believe in?\"\n\"You,\" everyone's a saint 'til the church lets out\nThat goes for you too\nEverything ain't perfect but I do it for...\n\n[Verse 2: T.I.]\nI never seen nobody end up in the right place\nWorried about the wrong thing\nSo in tribulation, better do your own thang\nSee, some of my partners trap and some of 'em gang bang\nSome of 'em snort powder, just barely maintain\nNo fuckin' with the Cali, got degree in Physics\nCame home with a diploma, got a job makin' pennies\nHomie like me who ain't finished high school, dropped out and went to prison\nStill ended up runnin' multi-million dollar businesses\nMan, if I tell you shit I knew about\nYou can tell the difference between me reflectin' and tryna glorify\n'Cause most the time this shit be borderline outta line\nAnd you just wanna monetize, only focus on the bottom line\nWhen it deeper than that\nWe here to analyze life and hope the people connect\nWe not just out here sellin' reefer, find the cheaper connect\nJust waitin' on TIP to spit some shit a G could respect\nFor real\n\n[Chorus: Teyana Taylor]\nTellin' me the things you that heard about\nNothin' good comes when you searchin' for the wrong things\nSomethin' feels off when I come around\nAskin' me questions like, \"What do I believe in?\"\n\"You,\" everyone's a saint 'til the church lets out\nThat goes for you too\nEverything ain't perfect but I do it for...\n\n[Outro: T.I.]\nYeah, you see the shit they missin' today is the G-code\nYou know, what we did, man, we did out of a lack of options, you know?\nBut we stuck to a code\nYou win, you lose, but you abide by the code\nYou dig what I'm sayin'?", "image": "https://images.genius.com/61f835d7291443dff51b3425a66506e9.600x600x1.png"}], "artist": "T.I."}