{"songs": [{"title": "Henny (Remix)", "album": "The Infamous Mobb Deep", "year": "2014-04-01", "lyrics": "[Intro]\nWild thing (Yuh)\nHennessy (Hennessy)\nHennessy (Hennessy)\nWeed, Hennessy\nA little slide, baby let's ride\n(Montana) Hahn\n\n[Verse 1: French Montana]\nShe feelin' me, cup full of Hennessy\nBaby show me love but fuck me like the enemy\nBy far, baby, listen close\nYachts, man, we don't do the fishin' boats\nSteak and lobster, I'm tryin' to surf\nTurks and Caicos on the first, missed the [?]\n24 carat, neck full of gol and\nGray ends, black shades rollin'\nSpeedin' in a European car like I stole it\nCoke boys made it to the top like we told 'em\nMy nigga Chink Drugz told 'em\nMotherfuck they feelin'\nLet's get these motherfucking millions\n\n[Bridge: Mack Wilds]\nHennessy\n\n[Verse 2: Havoc]\nDouble shots of the Hennessy\nWe gon' kill this whole bottle\nAfter this you gon' remember me\n'Cause now the case of new big guy\nWas having your bitch callin' over in overtime a line up\nYou soft with it, she just want it wild rough\nBoss would of took nothin', got her riled up\nIn the zone ignorin' everything around us\n\n[Verse 3: Prodigy]\nOoh, baby you sexy, fuck, you that bitch (Hennessy)\nBottles and shots and we twist\nI'm that thug you want to be wit'\nAnd live an infamous life, pour up and get lit\nStay away from that basic zone, that's not us\nWe came here to party, they came to watch us\nAnd damn, I feel no remorse for your ex\nBetter take it easy 'fore I crack him in the head with the\n\n[Bridge: Mack Wilds]\nHennessy\n\n[Verse 4: Mack Wilds]\nHow the hell did you get here?\nWas you sent for me?\nManhattan fly, Brooklyn bad, maybe Stapleton\nI wish I had some more treats, girl, just to trick on ya\nBut this money ain't impressive huh?\nWell I'm a fly mu'fucker from around the way\nS.I. 'til I die and I say your brave\nMake money for my fam, fans out of enemies\nAnd I'm smoother than a shot of\n\n[Chorus: Mack Wilds]\nHennessy (Hennessy)\nHennessy (Hennessy)\nHennessy (Hennessy)\nIf I hit her then you gon' remember me (Remember me) Remember me (Remember me)\nRemember me (Remember me)\nAnd you ain't too cool to pass by\nWhat you sayin' baby? Let's ride\nYou fuckin' with the right guy\nAnd I know you're feelin' me (Feelin' me)\nYes, you're feelin' me\n\n[Verse 5: Busta Rhymes]\nYo, live thorough niggas (Uhh!), five borough niggas (Uhh!)\nHat low, whippin 'cross the Tri-Boro niggas (Uhh!)\nYour team look soft, you look like five solo niggas (Ha!)\nRespect my city 'fore I get my bipolar niggas! (Eeeeh!)\nSee how that nigga sound? (Yes!) The only thing they understand\nIs beatin niggas to death, don't put your hand on me!\n(Uh!) You see we back to the strip, we drop a bundle, nigga!\nNow get the black and we back inside the tunnel, nigga!\n(Heh-heh!) See we run it like we was joggin on 'em\nCome get your shit like you really just caught a bargain on 'em!\nHey-hey! See the melee we be causin, nigga\n(More hood) than the club security robbin niggas\nProvide the fire and smoke, call me the arson nigga\nLike we in jail sellin cigarettes, bring a carton, nigga! (Ha!)\nWe cause 'em really to ack' a way when I'm clobbin' niggas\nAnd I advise you to back away when I'm talkin', niggas!\nHot shit, sizzle the street, see what we cookin', nigga\nUh! Pardon me, Uh Uhh! We got 'em pushin', nigga! (Hahaha!)\nYou ain't with it, then you can leave\nNow that I'm back up in this bitch, sorry niggas, you can't breathe\n(Yaah!) Leave me alone and I'm beggin' a nigga please (Yaah!)\nDoin that shit that make niggas crash into trees (Yaaaahhh!)\nMack Wildz, Montana, Mobb Deep\nYou see them chicks, just let 'em know that our city don't never sleep\nWe got that\n\n[Chorus: Mack Wilds]\nHennessy (Hennessy)\nHennessy (Hennessy)\nHennessy (Hennessy)\nIf I hit her then you gon' remember me (Remember me) Remember me (Remember me)\nRemember me (Remember me)\nAnd you ain't too cool to pass by\nWhat you sayin' baby? Let's ride\nYou fuckin' with the right guy\nAnd I know you're feelin' me (Feelin' me)\nYes, you're feelin' me", "image": "https://images.genius.com/d36f3c5fdf16cb402e39bef763e25bf4.1000x1000x1.jpg"}], "artist": "Mobb Deep"}