{"songs": [{"title": "Next To It", "album": null, "year": "2014-08-11", "lyrics": "[Produced By: Ty Dolla $ign & Shafiq Husayn]\n\n[Intro: Lupe Fiasco]\nWhat it say?\nNext to it, next to it, to it, to it, to it, to it\nNe-next to it, to it, to it, to it, to it, to it\nHey, what it say?\nUhh, uhh, uhh\n\n[Verse 1: Lupe Fiasco]\nMoney ain't shit when there's wealth next to it\nWealth ain't shit when there's health next to it\nIn the lane with nobody else next to it\nAin't get here by myself, lot of help next to it\nWord to Chilly Chill, that's myself, let's do it\n1st and 15th ENT, FNF music\nAlbum number five, ayy nigga, let's do it\nDon't say my name 'less my city next to it\nAnything look good with a titty next to it\nAnd the titty got a face that's pretty next to it\nRiding 'round town, something really exclusive\nBump a little Pac with some Biggie next to it\nNigga, that's love with a twist next to it\nNigga, that's a Blood with a Crip next to it\nAt the Bulls game like a tree gift next to it\nYes nigga, that's the floor and I sit next to it, let's do it\n\n[Hook: Ty Dolla $ign]\nEverything look better with a bitch next to it\nRollie on the wrist, let's do this\nTop down on a whip that's roofless\nAin't impressed, it's the bitch that do it\nLet's do it\nClub ain't turnt 'less some bitches into it\nIt's the bitch that do it\nYeah, yeah\n\n[Verse 2: Lupe Fiasco]\nCrib ain't shit 'less a whip next to it\nWhip ain't shit 'less a Benz next to it\nBut a Benz ain't shit when a Rari next to it\nRari ain't shit when a Zonda next to it\nReally tell a difference when a Honda next to it\nBut a Honda is the shit when you jogging next to it\nThis a baby momma with a condom next to it\nCause this a miracle, I'm still rocking, let's do it, let's do it\nZero need a comma with a zero next to it\nThen another comma with a zero next to it\nThen a zero next to it and a zero next to it\nThen another fucking comma then a zero next to it\nNigga what we talking? That's a million, let's do it\nNigga what we talking? That's a million, let's do it!\nStill at the bottom with a million next to it\nCause a million ain't shit when a billion next to it\nA billion ain't shit when a trillion next to it\nCaptain Save-A-Hoe, she want a hero next to it\nBut I ain't tryna hear it, put my ear up next to it\nCause it's strange to a nigga, got a weirdo next to it\nNigga, your wallet got a robber next to it\nBlack ski mask with a chopper next to it\nYou might need a bed with a doctor next to it\nBut nigga I ball like soccer next to it, let's do it\n\n[Hook: Ty Dolla $ign]\nEverything look better with a bitch next to it\nRollie on the wrist, let's do this\nTop down on a whip that's roofless\nAin't impressed, it's the bitch that do it\nLet's do it\nClub ain't turnt 'less some bitches into it\nIt's the bitch that do it\nYeah, yeah\n\n[Verse 3: Lupe Fiasco]\nNigga, my hood, feel like Heaven\nWith third worlds next to it\nBut nigga we good, and we'll be even better\nWith thirty girls next to us\nYeah, the White House had a trap next to it\nYeah nigga, that's a fact next to it\nMy house had a trap next to it\nAyy nigga, where's the house? Let's do it\nYour chest ain't shit 'less a chain next to it\nChain ain't shit 'less gold next to it\nBut gold ain't shit when a diamond next to it\nYour beat ain't shit 'less I'm rhyming next to it\nHah, hah, shining next to it\nShit ain't real, can't find her next to it\nNigga, let's park it on the red carpet\nGrammy Awards, my momma next to it, let's do it\n\n[Hook: Ty Dolla $ign]\nEverything look better with a bitch next to it\nRollie on the wrist, let's do this\nTop down on a whip that's roofless\nAin't impressed, it's the bitch that do it\nLet's do it\nClub ain't turnt 'less some bitches into it\nIt's the bitch that do it\nYeah, yeah\n\n[Outro: Lupe Fiasco]\nTo it, to it, to it\nNext to it, next to it, to it, to it, to it\nNext to it, next to it, to it, to it, to it\nNext, next to it, to it, yeah", "image": "https://images.rapgenius.com/88bba27d6e660c1c1530f209d1b9b1f6.500x500x1.jpg"}], "artist": "Lupe Fiasco"}