{"songs": [{"title": "The Ringer (traduzione italiana)", "album": null, "year": "2018-08-31", "lyrics": "[Intro]\n*Schianto Aereo*\nYeah (Illa)\nYo, scriverò solo le prime cose che mi vengono in mente, e vedo dove mi porterà farlo, perchè ora mi sento come se volessi prendere a pugni il mondo intero\nYeah\n\n[Verse]\nLasciatemi spiegare come creare la grandezza\nDritti fuori dal cancello, sto per romperlo\nNon sono permessi errori, ma state sicuri, sto per\nStuprare l'alfabeto, potrei far alzare qualche sopracciglio\nSe insisto sul problema solo per sfogarmi (Brrr!)\nL' intera rivista potrebbe mandare via Staples\nSelvaggio, ma non penso a nessun conto in banca\nMa troia, Sono libero dalle catene come Kala Brown\nTesta di cazzo, chiudi la cazzo di bocca quando sto parlando, troietta\nAspetta scusa, qual'è il tuo talento? Oh, criticare\nIl mio talento? Oh, troia, non so chi cazzo siate voi tutti\nPer scrivere una barra schifosa o avere addirittura un' opinione o un pensiero\nParli di me, milioni di visualizzazioni, attenzione nei telegiornali\nParlo di te, sconfitta sicura per me, vittoria certa per te\nMiliardi di visualizzazioni, i tuoi dieci centesimi sono due\nSkippi la musica per scrivere recensioni di merda\nPer fare visual, ma troia, hai solo acceso la miccia\nNon farti ingannare, come sempre\nLa lista della merda è rinnovata, quindi trovati qualche merdata da fare\nO fatti dissare perchè sinceramente non capisco\nChe cazzo di merda ti stai ascoltando\nHai la minima idea di quanto odio questo schifoso flow\nQuindi lo copiano tutti? Probabilmente no\nLevate questo cazzo di audio dalla mia Audii, yo, adiós\nCapisco perchè alla gente piace Lil Yachty, ma non a me comunque\nNon sto nemmeno dissando, semplicemente non è per me\nSemplicemente quello che sono è un emcee\nForse \"Stan\" non è la tua tazza di tè (Capito?)\nForse la tua tazza è piena di sciroppo e tè dimagrante\nForse ho bisogno di fomentare sta merda, preferibilmente\nFar tremare il mondo se dipendesse da me\nPaul vuole che mi calmi, voi tutti volete che sia pazzo\nDovrei prendermi una pillola, probabilmente lo farò\nIl vecchio me ha ucciso il nuovo me, guardatelo morire dissanguato\nAlito sullo specchio, non vedo il mio respiro\nForse sono morto, devo essere posseduto\nCome una magia malvagia, Sono E-V-I-L (compitato EVIL)\nBlocco una striscia sbiancante della Crest sulla punta del cazzo\nCon un punteruolo da ghiaccio, lo metto in una tenaglia\nLo appendo ad un recinto appuntito, lo colpisco con una chiave inglese\nMentre prendo le mie palle e le smuovo su e giù come un interruttore della luce\nCome il vicepresidente Mike Pence\nPasso sopra le mie palle con una Sidekick  mentre le lascio su una striscia chiodata\nQueste sono le cose che farei piuttosto che sentirvi rappare\nVisto che il 90% delle vostre rime parlano di gioielli e\nGesù Cristo, amico, quante volte\nQualcuno vorrà farsi la mia troia? (fatti la mia scopamica!)\nNon vedrete mai un Em ingioiellato\nMa talmente freddo che non appena prendo il M-I-C\nPolarizzo merda, tanto che il Tamigi potrebbe congelarsi\nEd il vostro cranio potrebbe spaccarsi in due come se vi fossi passato sopra\nStronzo, faccio venire giù il locale come un manganello  (Sì)\nPerché abbassare il volume?\nNon è abbastanza alto, no alza il Valium!\nPerché non ho idea di come farvi chiudere il becco\nOra che non ha importanza il livello\nA cui rappo, scommetto centomila bigliettoni\nVe ne fregherete e sarete tipo, \"Amico,come cazzo\nLa fighetta impazzirà solo perchè il suo album fa schifo\nE ora vuole prendersela con noi.\" (Ooouuu)\nMa la settimana scorsa, un ex-fan mi ha spedito una copia\nDel Mathers LP per dirmi di studiarlo\nMi aiuterà a ritornare me stesso e mi amerà (Oooouuu)\nHo risposto alla puttana e ho detto che se avessi fatto così\nSarei semplicemente come tutti gli altri nella fottuta industria\nSpecialmente una fottuta copia di me ai tempi di recovery (NFing)\nQuindi sfondare una fica con le dita, alette di pollo, MGK, Iggy ‘zae\nLil Pump, Lil Xan imitano Lil Wayne\nDovrei dare addosso a tutti in questo business, scegli un nome\nMi sono stufato di essere umile\nHo sentito che volete brontolare come uno stomaco vuoto\nHo sentito i vostri borbottii, ma è tutto un miscuglio senza senso\nL’era da cui provengo vi sfonderà di pugni, questo è ciò che accadrà\nChe cazzo farete quando arriverà?\nVi sbriciolerò e poi mi farò una cagata\nE ve la lancerò addosso, a meno che non siate Joyner\nKendrick o Cole o Sea siete finiti\nSto per portarlo a tutti quelli che lo vogliono in questo game\nImmagino che quando andate da BK vi aspettate di trovare un Whopper\nPotete ordinare un Quarter Pounder quando andate da McDonald’s\nMa se state cercando una bistecca è meglio che prendiate Revival\nMa vi comportate tutti come se provassi a servirvi un mini-hamburger\nForse le vocals dovevano avere l'auto-tune e in quel caso le avreste comprate\nMa dire che non ho più abilità\nPerchè vi siete persi un verso e non lo avete mai capito\nPerchè è andato oltre le vostre teste, perchè siete troppo stupidi per arrivarci\nPerchè siete mentalmente ritardati, ma fate finta di essere i più svegli\nCon la vostra esperienza e conoscenza, ma non sarete mai artisti\nE sono più duro con me stesso di quanto lo potreste essere a prescindere\nQuello che non sarò mai è perfetto, tutto ciò che sarò è onesto\nAnche quando non ci sarò più diranno che l'ho portato\nAnche quando raggiungerò i quaranta come un cazzo di alcolista\nCon una bottiglia di malt liquor\nMa non potevo più sopportare questa merda\nIl fatto che so che finirò a fondo\nSe non mi tiro fuori dalla morsa della sconfitta e mi rialzo in piedi\nNon capisco nemmeno perché voi tutti abbiate cominciato a prendervela con me\nFinisco nei beef, i miei nemici muoiono\nNon cesso il fuoco almeno fino a che non sono tutti morti\nSono dell’eastside, mai fatto beccare quando sono rilassato\nOra capite perché non dormo, non abbasso nemmeno le palpebre, non batto ciglio\nNon mi stanco, manco annuisco ai beat\nNemmeno chiudo i miei fottuti occhi quando starnutisco\n“Dai, amico! La tua performance al BET cypher era debole, era spazzatura\nLa Cosa non è nemmeno arancione – o mio Dio, hai esagerato!”\nUrlo a tutti i daltonici\nTutti e ognuno di voi, se dite che un camion dei pompieri è color acquamarina\nO pensate che l’acqua sia rosa\n“Amico, quello è un dattero.” “A me sembra un'oliva.”\n“Guarda, quella è una mela!” “No, non lo è, è una pesca!”\nQuindi ancora, sfondare una fica con le dita, Pootie Tang\nBurger Kang, Gucci Gang, cacca, diamine\nCharlamagne odierà comunque, non importa cosa dico\nDammi il Donkey of the day\nChe bel modo di cominciare per questo 2018\nMa dirò tutto quello che voglio dire\nBenvenuti al mattatoio, stronzi! (yeah)\nInvitali come una One a Day\nNon ho finito (ben detto)\nPerché mi sento come una bestia da soma\nQuella riga nella sabbia , ne valeva la pena?\nPerché il modo in cui vedo la gente voltarmi le spalle\nLa fa sembrare inutile, sta perdendo il suo scopo\nVedo la mia fan base farsi in tre parti\nE stavo solo provando a fare la cosa giusta, ma gira voce\nChe il giudizio dell’opinione pubblica è arrivato ad un verdetto\nOppure deve ancora essere determinato?\nPerché sono determinato ad essere me stesso, criticato o venerato\nMa se potessi tornare in dietro, almeno l’avrei detto in un altro modo\nAvrei detto che empatizzo con quelle persone cui questo serpente malvagio\nHa venduto quel sogno che ha disertato\nComunque penso che vada bene così\nQuesti miei versi lo stanno rendendo un pochino nervoso\nEd è troppo spaventato per rispondermi a parole\nPerché sa che sarebbe liricamente assassinato\nMa almeno so che le ha sentite\nPerché Agente Arancione ha appena mandato i Servizi Segreti\nAd incontrarmi per vedere se davvero penso di fargli del male\nO se sono collegato ai terroristi\nIo ho risposto, “solo quando si ha a che fare con l’inchiostro e con i liricisti”\nMa la mia specialità sono più i giornalisti dei media\n(aspetta, aspetta, aspetta…)\nHo detto che la mia carne è più succosa, un giornalista\nPuò avere un bel boccone di carne\nE sì, intendo prendere in bocca un cazzo\nPerché loro hanno insultato a morteil mio album\nQuindi ho mostrato il dito medio ai media\nNon voglio trasformare il tutto in una seduta terapeutica\nMa mi hanno messo sotto torchio\nQuindi non la faccio finita con la stampa\nE faccio a pezzi questo beat", "image": "https://images.genius.com/b379811c1415017b9f3e3a71b9d26060.400x400x1.jpg"}], "artist": "Eminem"}