{"songs": [{"title": "VCR / Wheels", "album": "Bastard", "year": "2009-12-25", "lyrics": "Part 1 - VCR\n\n[Verse 1]\nI don't want to play you\nI just want to tape you undressing\nAnd I'll lay you down and record soft porn\nIf it's romance then it's hardcore\nIf it's horror, pop the popcorn\nThe thoughts to rape you really turns me on\n\n[Chorus]\nPress my buttons baby\nPress my buttons\nPress my buttons baby\nYeah\nPress my buttons baby\nPress my fucking buttons baby\nPress my buttons baby\n\n[Verse 2]\nYou're my favorite show, any chance I get I try to watch\nDie hard fan can't stop with the tapings\nSort of like a psycho when I can't stop with the rapings\nOf the VHS, especially during sex baby\n\n[Chorus]\nPress my buttons baby\nPress my buttons\nPress my buttons baby\nYeah\nPress my buttons baby\nPress my fucking buttons baby\nPress my buttons baby\n\n[Verse 3]\nReady to watch? I'm a slip it in the tape deck\nBut put it in slow-mo, I don't want to bust the tape yet, press play\nNow this is what I call an evening\nA live show, almost equivalent to the screening\nYour dream movie? I'm the clearest copy\nNow time for Blow, I'm Johnny deep with the rarest poppy\nSnort a little, now you're getting groovy\nCause I'll kill if I find out you're watching some other movies, bitch\n\n[Chorus]\nPress my buttons baby\nPress my fucking buttons\nPress my buttons baby\nYeah\nPress my buttons baby\nPress my fucking buttons baby\nPress my buttons baby\nYeah\nPress my buttons baby\nPress my fucking buttons baby\nPress this\nStop!\n\nPart 2 - Wheels\n\n[Verse 1]\nDanielle, Danielle, yeah you heard about Raquel\nWell that didn't go well, let us try to make it swell\nPut the beaver in the mail, we can take it slow like snail\nLock my heart up, this is jail, throw away the key\n\n[Chorus]\nCan I sleep over\nAnd wake up next to you?\nI want to feel you near\nJust let me whisper in your ear\nUm\n\n[Verse 2]\nWe can kick it on the couch, blunt you can roll it up\nBut I'm on some shrooms if you really want to feel the room\nI just want to kick it, kick it for the rest\nI skated all day, I just need some rest and your breasts\n\n[Chorus]\nCan I sleep over\nAnd wake up next to you?\nI want to feel you near\nJust let me whisper in your ear\nUm\n\n[Verse 3]\nWe can count the stars on the hood of your father's car\nHe's a buster anyway, I can take him any day\nLook into your eyes I realize that I like you so much\nThat was corny, now I'm horny, can I have a kiss?\n\n[Chorus]\nCan I sleep over\nAnd wake up next to you?\nI want to feel you near\nJust let me whisper in your ear\nUm\n\n[Verse 4]\nWe both teenagers with the same mind state\nHow about some ice cream and some South Park for this first date?\nYour cat is waiting for that raw fish I can't wait\nGet it?\n\n[Chorus]\nCan I sleep over\nAnd wake up next to you?\nI want to feel you near\nJust let me whisper in your ear\nUm", "image": "https://images.genius.com/cb0b25f99dd81109efa8db270a933a38.500x500x1.jpg"}], "artist": "Tyler, The Creator"}