{"songs": [{"title": "KIll You (explict)", "album": null, "year": null, "lyrics": "[Produced by Dr. Dre & Mel-Man]\n\n[Intro]\nWhen I was just a little baby boy\nMy momma used to tell me these crazy things\nShe used to tell me my daddy was an evil man\nShe used to tell me he hated me\nBut then I got a little bit older\nAnd I realized she was the crazy one\nBut there was nothing I could do or say to try to change it\n‘Cause that's just the way she was\n\n[Verse 1]\nThey said I can’t rap about being broke no more\nThey ain't say I can't rap about coke no more\nSlut, you think I won’t choke no whore\n'Til the vocal cords don't work in her throat no more?\nThese motherfuckers are thinkin' I'm playin'\nThinkin' I'm sayin’ the shit ‘cause I’m thinkin' it just to be sayin’ it\nPut your hands down, bitch, I ain't gon' shoot you\nI'ma pull you to this bullet and put it through you\nShut up, slut! You’re causin' too much chaos\nJust bend over and take it like a slut — okay, Ma?\n\"Oh, now he's raping his own mother\nAbusing a whore, snorting coke\nAnd we gave him the Rolling Stone cover?\"\nYou're goddamn right, bitch, and now it's too late\nI'm triple platinum and tragedies happened in two states\nI invented violence, you vile venomous volatile vicious\nVain Vicodin, vrin vrin vrin!\nTexas Chainsaw, left his brains all\nDanglin' from his neck while his head barely hangs on\nBlood, guts, guns, cuts\nKnives, lives, wives, nuns, sluts — bitch, I'ma kill you!\n\n[Pre-Hook]\nYou don't wanna fuck with me\nGirls neither, you ain't nothin' but a slut to me\nBitch, I'ma kill you! You ain't got the balls to beef\nWe ain't gon' never stop beefin', I don't squash the beef\nYou better kill me, I'ma be another rapper dead\nFor poppin' off at the mouth with shit I shouldn't have said\nBut when they kill me, I'm bringin' the world with me\nBitches too, you ain't nothin' but a girl to me\n\n[Hook]\nI said you don't wanna fuck with Shady (‘Cause why?)\n‘Cause Shady will fucking kill you (Ha-ha)\nI said you don't wanna fuck with Shady (Why?)\n‘Cause Shady will fucking kill you\n\n[Verse 2]\nBitch, I'ma kill you! Like a murder weapon, I'ma conceal you\nIn a closet with mildew, sheets, pillows and film you\nFuck with me, I been through Hell, shut the hell up\nI'm tryna develop these pictures of the Devil to sell 'em\nI ain't \"acid rap,\" but I rap on acid\nGot a new blow-up doll and just had a strap-on added\nWhoops! Is that a subliminal hint?\nNo, just criminal intent to sodomize women again\nEminem offend? No, Eminem'll insult\nAnd if you ever give in to him you give him an impulse\nTo do it again, then if he does it again\nYou'll probably end up jumpin' out of somethin' up on the tenth\nBitch, I'ma kill you! I ain't done, this ain't the chorus\nI ain't even drug you in the woods yet to paint the forest\nA bloodstain is orange after you wash it\nThree or four times in a tub, but that's normal — ain't it, Norman?\nSerial killer hiding murder material\nIn a cereal box on top of your stereo\nHere we go again, we're out of our medicine\nOut of our minds and we want in yours: let us in, or I'ma kill you!\n\n[Pre-Hook]\nYou don't wanna fuck with me\nGirls neither, you ain't nothin' but a slut to me\nBitch, I'ma kill you! You ain't got the balls to beef\nWe ain't gon' never stop beefin', I don't squash the beef\nYou better kill me, I'ma be another rapper dead\nFor poppin' off at the mouth with shit I shouldn't have said\nBut when they kill me, I'm bringin' the world with me\nBitches too, you ain't nothin' but a girl to me\n\n[Hook]\nI said you don't wanna fuck with Shady (‘Cause why?)\n‘Cause Shady will fucking kill you (Ha-ha)\nI said you don't wanna fuck with Shady (Why?)\n‘Cause Shady will fucking kill you\n\n[Verse 3]\nKnow why I say these things?\n‘Cause ladies' screams keep creepin' in Shady's dreams\nAnd the way things seem\nI shouldn't have to pay these shrinks\nThese 80 G's a week to say the same things tweece\nTwice, whatever, I hate these things\nFuck shots, I hope the weed'll outweigh these drinks\nMotherfuckers want me to come on their radio shows\nJust to argue with 'em ‘cause their ratings stink\nFuck that! I'll choke radio announcer to bouncer\nFrom fat bitch to all seventy thousand pounds of her\nFrom principal to the student body and counselor\nFrom in-school to before school to outta school\nI don't even believe in breathin'\nI'm leavin' air in your lungs\nJust to hear you keep screamin' for me to seep it\nOkay, I'm ready to go play, I got the machete from O.J\nI'm ready to make everyone's throats ache\nYou faggots keep eggin' me on\n'Til I have you at knifepoint, then you beg me to stop\nShut up! Give me your hands and feet\nI said shut up when I'm talkin' to you\nYou hear me? Answer me, or I'ma kill you!\n\n[Pre-Hook]\nYou don't wanna fuck with me\nGirls neither, you ain't nothin' but a slut to me\nBitch, I'ma kill you! You don't got the balls to beef\nWe ain't gon' never stop beefin', I don't squash the beef\nYou better kill me, I'ma be another rapper dead\nFor poppin' off at the mouth with shit I shouldn't have said\nBut when they kill me, I'm bringin' the world with me\nBitches too, you ain't nothin' but a girl to me\nBitch, I'ma kill you!\n\n[Hook]\nYou don't wanna fuck with Shady (‘Cause why?)\n‘Cause Shady will fucking kill you (Ha-ha)\nI said you don't wanna fuck with Shady (Why not?)\n‘Cause Shady will fucking kill you\n\n[Outro]\nHa-ha-ha, I'm just playing, ladies\nYou know I love you", "image": "https://images.genius.com/b379811c1415017b9f3e3a71b9d26060.400x400x1.jpg"}], "artist": "Eminem"}