{"songs": [{"title": "Kanye West & Taylor Swift ‘Famous’ Lyric Phone Conversation", "album": null, "year": "2016-07-17", "lyrics": "Kanye: OK, dope. You still got the Nashville number?\nTaylor: I still have the Nashville area code but I had to change it\nKanye: For all my south side niggas that know me best, I feel like me and Taylor might still have sex.\nTaylor: I'm like this close to overexposure.\nKanye: Oh well this one is, uh — I think this is a really cool thing to have.\nTaylor: I know! I mean it's like a compliment kind of.\nKanye: What I give a fuck about is just you as a person, and as a friend.\nTaylor: That's sweet.\nKanye: I want things that make you feel good. I don't wanna do rap that makes people feel bad.\nTaylor: Um, yea. I mean, go with whatever line you think is better. It's obviously very tongue in cheek either way.\nTaylor: And I really appreciate you telling me about it, that's really nice!\nKanye: Yea. I just felt I had a responsibility to you as a friend. I mean, thanks for being so cool about it.\nTaylor: Aw, thanks! Yeah I really appreciate it. Like, the heads up is so nice!\nTaylor: …things without like even asking or seeing if I'd be OK with it. And I just really appreciate it.\nTaylor: I'd never expect you to tell me about a line in your song.\nTaylor: And then the flowers that you sent me, I Instagrammed a picture of them and it's the most Instagram likes I've ever gotten.\nKanye: Relationships are more important than punchlines, you know.\nTaylor: Yea. I mean, I don't think anybody would listen to that and be like, Oh, that's a real diss. Like, she must be crying about…\nTaylor: You gotta tell the story the way that it happened to you and the way you experienced it. Like you honestly didn't know who I was before that.\nTaylor: It doesn't matter if I sold 7 million of that album before you did that, which is what happened. You didn't know who I was before that.\nTaylor: … that I can make these things happen and I have the ideas to do it and I create these things and concepts. And, like, I'm always gonna respect you.\nTaylor: And I'm really glad you had the respect to call me and tell me that as a friend, about the song. It's just a really cool thing to do, and a really good show of friendship. So thank you.\nKanye: Thank you too.\nTaylor: And you know, if people ask me about it, I think it would be great for me to be like, Look, he called me and told me about the line before it came out. Like, joke's on you guys, we're fine.\nTaylor: You guys wanna call this a feud, you wanna call this throwing shade. But right after the song comes out I'm gonna be on a Grammy red carpet and they're gonna ask me about it and I'm gonna be like, he called me.\nTaylor: …awesome that you're so outspoken and it's gonna be like, Yea, she does, it made her famous! It's more provocative to say, Might still have sex.\nTaylor: …it's not. It doesn't matter to me. there's not one that hurts my feelings and one that doesn't.", "image": "https://images.genius.com/13f97c80b314e831ec9d245ff5d4b370.818x818x1.png"}], "artist": "Kanye West"}