{"songs": [{"title": "It Never Ends", "album": "The Lost Tapes 2", "year": "2019-07-19", "lyrics": "[Verse 1]\nBuckets like Gilligan\nStill I peep reptilians in the Filligan\nBlendin' in, my quintillion ton brain\nGot me revealing men\nQuintessential Queensbridge poet back to the grill again\nDid songs with Chubb Rock to Chris Brown, switch styles\nYet to see any heavyweight make it to this round\nThis that pure champion sound, I wear the crizzown\nRaw, one take, I don't even need a mixdown\nDemure, not docile, volatile, I kick down\nAmphibians, reptiles that make that hiss sound\nThey eyes change color, their pupils start to slit down\nWhen I take cover, and I let off a fifth round\n\n[Chorus]\nI got seven MAC-11s, about eight .38s\nNine 9s, ten MAC-10s, the shit never ends\nRest in peace to B.I., the shit never ends\nB.I.G. shit\nI got seven MAC-11s, about eight .38s\nNine 9s, ten MAC-10s, the shit never ends (Never ends, never ends)\nThe world's going crazy, this shit never ends (Never ends, never ends)\n\n[Verse 2]\nStop waiting for the hood to 'preciate ya\nWhoever gets love in the hood, he's a freak of nature\nWhen I said I wasn't mainstream, lames scream\n\"What does he mean?\nWho does he think he is?\nHis bank be hid, he hardly out\nHe still as hard as he was when he started out\"\nWe count 'em out, we count 'em in\nAmongst the real, never my crown in doubt\nSo around my house with my wiz, lessons I got from my friends\nDo they love me for me or love me for them?\n\n[Chorus]\nI got seven MAC-11s, about eight .38s\nNine 9s, ten MAC-10s, the shit never ends\nThe world's out war, the shit never ends\nEverybody packin'\nI got seven MAC-11s, about eight .38s\nNine 9s, ten MAC-10s, the shit never ends (Never ends, never ends)\nIt never ends, the shit never ends (Never ends, never ends)\nWhat will it take to end?\n\n[Verse 3]\nCan't see me moving, I'm like the fastest\nI'm a 3D movie, no need of glasses\nThey hate it before they hear it\nClear that my perseverance is somethin' they can't bear\nIt's become apparently clear\nThey fear me, I'm not dying or rather\nPut my ears to the blaring cop siren\nAm I here or in a hot dryer?\nDidn't hear all that pop-soundin' fakespeare, pop rhymin'\nNiggas should stop lyin'\nWhy in a whole year, you still in the same spot trying\nTo change, but you not risin'?\nWhen will somebody real tell him he not Nas-in'\nCars, you just started drivin'\nI've been ridin', been made it\nYou and your pretend stages\nI did this since windbreakers (Windbreakers)", "image": "https://images.genius.com/91da51c7ed14c805c492a0346f54d465.1000x1000x1.jpg"}], "artist": "Nas"}