{"songs": [{"title": "What Ya Know About Hopsin?", "album": null, "year": null, "lyrics": "[Verse 1]\nI flow them words that hits you like smokin' herbs\nConvince you to throw them birds since you so disturbed\nI won't even bother with dissin' you on a verse\nMy Hennessy went in worse, my niggas be on alert\nI'll have you on your knees sittin' alone in church\nWhen I interrupt on the turf my nigga it's gonna hurt\nI guarantee that blood'll be leakin' up on your shirt\nI sock you into a casket and send you into the earth\nOh snap looks like he ain't what he thought he'd be\nThought he could slaughter me rawly, the orders where we all be\nVicious is just a part of me, leave the hitman then call on me\nAnd follow me as I'm causin' this rage be involved wit' me\nIt's all a mystery how I make flawless victories\nFrom splittin' wigs and leavin' a shiny and bald like Mr. Clean\nMy style is fresher than niggas who swallow Listerine\nI'll have you begging for life, the rest is all in history\n\n[Hook]\nMan! What y'all niggas know about Hopsin?\nNothing! we just know he always drop hot shit\nC'mon fuck 'em up, fuck 'em up, bust 'em up, bust 'em up\nCut 'em up, cut 'em up, shut 'em up, shut 'em up\nMan! What y'all know about Hopsin?\nNothing! they just know I always drop hot shit\nHopsin gon' make it hot, wack niggas shake the spot\nWhy the fuck y'all niggas stalling, time to get this party started\n\n[Verse 2]\nFor nigga think he tired I just feel like I gotta diss him\nPut him on blast nigga 'cause Hopsin know to whip him\nMake that nigga cry ocean 'til his momma get him\nAnd if you wanna take it to the streets you know I'm boxing with him\nWhen it to comes to fighting Hopsin got a lot of victims\nSince elementary school I was anxious to sock and kick 'em\nHang around me long enough and you can even witness the field\nBut once you hear the (whoopsie) I'm gonna (finish him)\nIt ain't Mortal Kombat it's combat of mortals\nYou get whoopty woos by me not Jax or Goro\nI smack the cornrow right off the top of your dome\nInstead of popping the chrome leave you dazed off in the zone\nHopsin is sick with the provocative flow\nI'm as solid as bones and if you sit talk in my throne\nI wouldn't bother to answer with that knock of the door\nYou wind up missing in the woods and nobody you'll know\n\n[Hook]\nMan! What y'all niggas know about Hopsin?\nNothing! we just know he always drop hot shit\nC'mon fuck 'em up, fuck 'em up, bust 'em up, bust 'em up\nCut 'em up, cut 'em up, shut 'em up, shut 'em up\nMan! What y'all know about Hopsin?\nNothing! they just know I always drop hot shit\nHopsin gon' make it hot, wack niggas shake the spot\nWhy the fuck y'all niggas stalling, time to get this party started\n\n[Verse 3]\nI'm dangerous, gaffled this shit and my name [?]\nMy venom is angry, my adrenaline ain't weak\nIf a nigga fuck around I'ma get him the same week\nWhy you act raw when you niggas is mainly\nLike a fresh pack of lemurs 'cause your limit'll spray sleeps\nWack life act like you living the crazy\nLet me tell you something you criminals ain't g's\n'Cause when Hopsin come around your women is ain't shizzin'\nQuick to dump you know chicks'll run\n[?]\nYour old Hopsin a monster\nQuick as thunder, whip you under two seconds flat\nNiggas like whose flesh is that\nDon't test this cat you're best as [?]\nYour gats are weak you be falling fast asleep\nI'ma deck you so hard, I'ma crack your teeth\nAnd let my homies have a piece to smash the beat\n\n[Hook]\nMan! What y'all niggas know about Hopsin?\nNothing! we just know he always drop hot shit\nC'mon fuck 'em up, fuck 'em up, bust 'em up, bust 'em up\nCut 'em up, cut 'em up, shut 'em up, shut 'em up\nMan! What y'all know about Hopsin?\nNothing! they just know I always drop hot shit\nHopsin gon' make it hot, wack niggas shake the spot\nWhy the fuck y'all niggas stalling, time to get this party started\n\n[Hook]\nMan! What y'all niggas know about Hopsin?\nNothing! we just know he always drop hot shit\nC'mon fuck 'em up, fuck 'em up, bust 'em up, bust 'em up\nCut 'em up, cut 'em up, shut 'em up, shut 'em up\nMan! What y'all know about Hopsin?\nNothing! they just know I always drop hot shit\nHopsin gon' make it hot, wack niggas shake the spot\nWhy the fuck y'all niggas stalling, time to get this party started", "image": "https://images.genius.com/1620b55458e423f96bf6316d13418223.1000x1000x1.jpg"}], "artist": "Hopsin"}