{"songs": [{"title": "Last Words", "album": "Killer", "year": "2008-07-01", "lyrics": "[Dr. Frazier]\nI know you dislike coming here\nBut what these sessions are for Aaron\nIs so you can release all the hostility that you hold inside yourself\nI just want you to relax\nAnd keep in mind that this is a safe place\nSo feel free to curse, cry or any other emotion that might occur during todays visit\nThese sessions are confidential\nI am only here to listen and not to judge\nI'm just here to help you bring the things that are bottled up within.. out\n\n[Verse 1: Tech N9ne]\nFuck everybody who doubted me\nAnd said my movement's a fallacy\nI'm loud and these pussies don't even know how to be\nThis is the rowdy me\nStraight malicious and clouty me\nDemons have crowded me and I really gotta get 'em up out of me\nY'all ain't ever known\nWhat's really inside of my dome\nPlay like I'm weak when I'm strong\nSo I can peep the ones wrong\nThey obsolete 'cause I'm gone\nThis is a speech to condone\nI got the beast in my bones\nAnd Y'all 'bout to reap the unknown\nI had every woman you saw Tecca Nina hang with\nMost of there friends they see daily, I dug out and came with\nHow can I do this 'cause my brain, it stay on insane shit\nNever can a nigga say no names but it's hella pain to retain this\nBlack's the blood in my veins, how can I cleanse it and drain this\nDisaster was in my lane, but a nigga pinned it and framed it\nAfter me no one thing, will remain on the Strange list\nHave to leave out with a bang, stuck off in the rain, now I hang bitch\n\n[Hook: Krizz Kaliko]\nWhat more can I say to you?.. I\nTalk until my face is blue.. I\nDon't look like I'm crazy do I?\nDo you feel me? *It's my last words*\nWhat more can I say to you?.. I\nTalk until my face is blue.. I\nDon't look like I'm crazy do I?\nCan you hear me? *It's my last words*\n\n[Dr. Frazier]\nTalk about some of the things that really eat away at you\nLike your career, your music...\nAnd don't hold back Aaron, 'cause again these sessions\nAre to extract the things that could possibly make you explode\n\n[Verse 2: Tech N9ne]\nWhen y'all listen to my music I think y'all take it lightly\nBut I been raw since the beginning just ask my Uncle Ikey\nHe will tell you royalty's been planted deep in my psyche\nAll you peasants hail the king just call me Aaron almighty\nSo when you critique my music you sound like fools to me\nAnd I don't think you deserve to hear another jewel from me\nThe industry cheated me, repeatedly cruel to me\nSo now I act conceited, guess you needed no grooves from me\nI've had it, I'm tired mane\nYou niggas is fired mane\n'Cause you know me and Travis was supposed to inherit the entire thang\nI'm normal, I've never admired fame\nI'm just famous 'cause I'm a fuckup and y'all desire pain\nSo don't talk to me when you see me\nAwfully's how you treat me\nOff of me, everybody leave me\nIt costed me, never was it easy\nSo say goodbye to the bad guy a nigga don't have anymore to sell you\nThis might be the last time you hear a bad guy like Tecca Nina baby, let me tell you\n\n[Outro: Krizz Kaliko & Tech N9ne]\nWhat more can I say to you?.. I (Yeah)\nTalk until my face is blue.. I\nDon't look like I'm crazy do I?\nDo you feel me? (Supposed to be more than this, man)\nWhat more can I say to you?.. I\nTalk until my face is blue.. I\nDon't look like I'm crazy do I?\nCan you hear me? (I'm outta here)\nSee I've been inside out\nY'all heard the best of it\nGot no more to give\nThere ain't no rest of it.. there\nI'm all out there but y'all don't care\nI got no more to bare, yeah\nWhat more can I say to you?.. I (That's right)\nTalk until my face is blue.. I (Fuck It)\nDon't look like I'm crazy do I?\nCan you feel me? (I gave everything I could give)\nWhat more can I say to you?.. I\nTalk until my face is blue.. I\nDon't look like I'm crazy do I?\nDo You feel me?\n\nI don't wanna hear nothin' else man, I just wanna\nGo somewhere with my children, man\nDisappear, like dear God\nMake me a bird so I can fly\nFly far away from here...\nTech N9ne", "image": "https://images.genius.com/ce6124bde0d76994fd0d3a8ddb1d4e97.1000x994x1.jpg"}], "artist": "Tech N9ne"}