{"songs": [{"title": "On the Boulevard", "album": "The Wash (Original Motion Picture Soundtrack)", "year": "2001-11-06", "lyrics": "[Dr. Dre]\nYou in the office of the good doc again, let's walk again\nIt's like clock again, the hood rock again\nYou should pop it in,ain't take it out\nThat shit Dre on, you can't make it out\nThe world ain't set for what I'm about to do\nNinety-six tracks mixed down to two\nI stepped out the booth, called up Snoop\nLike toucan, Dre got colorful loops\n\n[Snoop Dogg]\nWe can shoot, we can scrap\nWe can rap, we can act\nWe can mack these bitches, whatever you want\nOl' bitch ass niggas think it's better to front\n\n[Dr. Dre]\nHow it be on the West, forever the hunt\n\n[Snoop Dogg]\nBut I won't wear no bull's eye (Bull's eye eye)\nBull's eye is how these fools die (Die die)\nWaitin' on school by (By by)\nHave you on the news by (By)\n\n[Dr. Dre]\nY'all know how the story goes\nWe give a fuck about award shows\n\n[Snoop Dogg]\nSame shit about hoes\n\n[Dr. Dre]\nReal niggas own platinum balls\nI ain't got it on my neck nigga check my walls\nI think y'all just tryin' to insight us\nYo I see how the world can't see these Eastsidaz\nAll y'all wanna criticize, fuckin' with us tryin' to get a ride\nThat's when my shit flies\n\n[Snoop Dogg]\nAnd here's where the pimp lies\n\n[Dr. Dre]\nI spit game at the globe\nFirst week deuce five\n\n[Hook: Kokane]\nI'd rather be ridin' than walkin'\nWhile all you loud mouth niggas keep talkin'\nAll you high paid niggas stay fly\nI'mma slide left, fly right on by\nI'mma do it on the boulevard\nFast bitches, fast cars and stars\nStayin' bossed up eatin' caviar\nLookin' for the next play to have it all, ah nah\n\n[Dr. Dre with Snoop rapping along]\nIt's funny how the game goes\nNew face but they look like the same hoes\nI try to get away, everybody wanna hit of Dre\nStay focused, bang I done hit a day\n\n[Snoop Dogg]\nNigga fuck what cha' heard, shit is all lies\nNiggas mad Dre and Snoop stayin' multi\n\n[Dr. Dre]\nFuck y'all, wanna slice and it's all mine\n\n[Snoop Dogg]\nMy career in fifth gear while y'all's dyin'\n\n[Dr. Dre]\nYou thinkin' California all sun and surf, for sho'\nI can see you walkin' under the Earth\n\n[Snoop Dogg]\nMy gun burst em'\n\n[Dr. Dre]\nAnd I still got my first mil\nStill bounce till I feel like the Earth tilt\n\n[Snoop Dogg]\nEvery club, Dre and Snoop loudest\nG-Funk, get it crunk like the Dirty South\nHold ya mouth, you ain't worth a third of me\n\n[Dr. Dre]\nA word from me, exclusive as a surgery\nBut I don't use a scalpel, chainsaw shoppin'\nMy fingerprints all over the top ten\n\n[Snoop Dogg]\nLike that\n\n[Dr. Dre]\nWhole staff'll come through and spin\nEither on the film or the two-inch wheel\nBehind the wheel of a sixty-four\nI can't stop till I done fifty totes\n\n[Snoop Dogg]\nY'all motherfuckers know me\nI smoke a lot of weed, sayin' fuck a pass like Kobe\n\n[Hook]\n\n[Kokane x4]\nRock on, rock on, keep movin' on\nGroovin' on and hold ya on\n\n[Hook]", "image": "https://images.genius.com/32a541ad1876dff1162d425aab3980ab.500x500x1.jpg"}], "artist": "Dr. Dre"}