{"songs": [{"title": "I’m a hustler", "album": null, "year": null, "lyrics": "[Intro: devil]\nPssst... psssssst... heyyoo...\nAre you afraid to die, or do you wanna live forever\nTell me, which one ?\n\n[1st verse: 2pac]\nThey wanna bury me, I'm worried -- I'm losin my mind\nLook down the barrel of my nine and my vision's blurry\nFallin to pieces, am I guilty?\nI pray to the Lord but he ignores me unfortunately cuz I'm guilty\nShow me a miracle I'm hopeless -- I'm chokin off marijuana smoke\nWith every toke its like I'm losin focus\nFallin to sleep while I'm at service, when will I die?\nForever paranoid and nervous because I'm high\nDon't mention funerals I'm stressin, and goin nutty\nAnd reminiscin bout them niggas that murdered my buddy...\n\n[Chorus: 2pac]\nThe motherfuckers pass\nBy me like they know me, smilin as they laugh\nI put up my middle finger then I dash\nNiggas don't like me cuz I'm thuggin' and everyday I'm a hustler...\nLookin to get paid\n\n[2nd verse: 2pac]\nI wonder when will I be happy, ain't nothin funny\nFlashbacks of bustin caps, anythin for money\nWhere am I goin I discovered, can't nothin save me\nMy next door neighbor's havin convo with undercovers\nPut a surprise in the mailbox, hope she get it\nHappy birthday bitch, you know you shouldn'ta did it\nEverydoy's dyin am I next -- who can I trust?\nWill they be G's, and they look at me before they bust?\nOr will they killin me while I'm sleepin, two to the head\nWhile I'm in bed, leakin blood on my satin sheets\nIs there a heaven for a baller? I'm gettin suspicious\nOf this bitch the line busy everytime I call her\nNow she's tellin me to visit, who else is home?\nI check the house before I bone, so we all alone\nAfter I nut I hit the highway -- see ya later\nTo all the players watch the fly way a nigga played her\n\n[Chorus]\n\n[3rd verse: 2pac]\nThe bitch tellin all her homies -- that I can fuck her like no other\nNow them other bitches wanna bone me\nI'm under pressure gettin drunk, somebody help me\nI drink a fifth a Hennesey I don't think it's healty\nI see my enemies they creepin, don't make me blast\nI watch the five-oh's roll, the motherfukers pass\nThey wanna bury me, I'm worried -- no need to lie\nI pray to God I don't scream when it's time to fry\nNowhere to rest I'm loosin homies, ain't that a bitch\nWhen I was rich I had clout, now a nigga's lonely\nI put the pistol to my head -- and say a prayer...\nI see visions of me dead, Lord are you there?\n\n[Chorus]\n\n[4th verse: 2pac]\nThen tell me am I lost cuz I'm lonely\nI thought I had friends but in the end a nigga dies lonely\nNowhere to run I'm in terror -- and on one cares\nA closed casket at my funeral and on one's there\nIs there a future for a killer? I change my ways\nBut still that don't promise me the next day\nSo I stay thuggin with a passion, forever blastin\nI'm bustin on these motherfuckers in my madness\nThey wonder if I'm hellbound... well hell can't be worse than this cuz I'm in hell now\nDon't make me hurt you I don't want to -- but I will\nSeen motherfuckers killed over phone bills\nNever will I die I'll be back\nReincarnated as a motherfuckin mack\nI love it cause in Heaven there's no shortage on G's\nI'm tellin you now, you motherfuckers don't know me... you don't know me\n\n[Chorus]\n\nHustlerrrrr", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}