{"songs": [{"title": "Wu Tang Forever", "album": "YSIV", "year": "2018-09-28", "lyrics": "[Intro + background]\nEn garde, I'll let you try my Wu-Tang style\nI'd like to try your Wu-Tang style, let's begin, then\nShaolin shadowboxing and the Wu-Tang sword style\nIf what you say is true, the Shaolin and the Wu-Tang could be dangerous\nDo you think your Wu-Tang sword can defeat me?\nWu-Tang!\nWu-Tang!\nWu-Tang!\nWu-Tang!\n\n[Verse 1: Logic]\nAyo, ayo, Wu-Tang forever, who rhyme better?\nWe too clever, the boom bap's back, harder than ever\nR.I.P. O.D.B, comin' through like Killa Bee\nEver since I heard Enter the 36 in '93\nYou cannot defeat my Wu-Tang style, I leave 'em all dismembered\nFuck a mumble rap, that shit won't never be remembered\nNot even a contender, no, pretender, best surrender\nMy agenda is killin' shit, they feelin' this (Sinatra)\nYeah, we live and thorough\nAssassinatin' every single muthafuckin' borough\nFrom Staten to Brooklyn to Queens, the Bronx and Harlem\nAll the way to Maryland, yeah, we comin' for all 'em\nBobby Tarantino to the Digital\nMy shit is pivotal, smokin' chronic, no medicinal\nWho you know assemble the Clan like Voltron?\nThe one and only Logic, the God, the don, I'm gone\n\n[Break: Ghostface Killah]\nAy-yo, Logic, what up?\nWe gon' let these muthafuckas try this Wu-Tang style\n\n[Verse 2: Ghostface Killah]\nYo, yo, yo, yo, kaboom!\nGuess who stepped in the room\nIt's Ghostface, gold plates, old truths, more cake\nIntelligent brothers with nine hoods, movin' snowflakes\nGuillotine your head, last scene in the showcase\nPush weight, this Colgate, tre-eights and old gates\nExfoliate those we most hate, we don't associate\nWe wear robes that you can't even pronunciate\nWe eat foods where you can't even pronounce you ate\nCribs where the floor just rises up and rotates\nLocations low-key, can't even locate\nTwin nina sisters with the beam, we all soulmates\nTeam makin' us so much cream, we bought gold plates\n\n[Verse 3: Raekwon]\nYo, mountains of haze in the crib of my blades\nIt gets messy underneath the dresser, the gauge\n57 MB, yo, metallic green, seats is piped off\nSeize 'em old tracks, unite through 'em\nThe kitchen is my palace, get your dance on\nWhile we just levitate with trees, get your branch on\nI'm known to wil’ out, put the cams on\nJewels down, the sets dip, my gems got grams on\nA specialist when I'm bakin'\nRhymes be comin' out, we makin'\nWe challengin' these chumps for lumps\nHere's the statement—stop hatin'\nThe crew is all about gettin' this cake in\nYou know about me, you relatin'\n\n[Verse 4: RZA]\nThe enigma, the stigmas that the RZA and the GZA\nBoth lyrical prolific, fixtures of rap scriptures\nMixtures of hipsters, weed smokers, and beer drinkers\nPrince and the Pauper, spiritual clear-thinkers\nCake in the oven, Superbad like McLovin\nHuggin' all four boroughs, puffin' herb with my cousin\nAcademically speaking, rap vocabulary's weakenin'\nI felt it comin' like The Weeknd when these starboys start tweakin'\nSporadic pill-poppin' of OxyContin\nIII-gotten sexual intercourse make shorty wop feel rotten\nThe travesty-tapestry of microphone mastery has been refuted\nDiluted, broken down to a catastrophe\nBut cats still get the trophy, hit y'all with that \"Okie-dokie\"\nBurt Reynolds, Bandit, goddamnit\nWhere the fuck is Smokey Bear when you need one?\nI got a light-beam gun\nI'll blast a hole in your chest that you can't bleed from\nBut you'll die through iniquity, plus stupidity of that trickery\nMy verse got it hot up in here, not the humidity\nYou can never get rid of me, step back and consider me\nWu Killa Bee, but I'm not big on bigotry\n\n[Verse 5: Method Man]\nOld school on this track, I feel invincible\nThis new school ain't really got rules and lack the principles\nGot more clowns than the Motown, they puttin' critical\nThe gun, Smokey Robinson, you need a Miracle\nGo back, homie, back when rappers used to be lyrical\nWhen nine out of ten of his friends used to be criminals\nThe stats, homie, all these killas usin' subliminals\nY'all don't even smile in your pictures, you dudes is miserable\nWitty unpredictable torture over your physical\nStruggle bar, used to pour water over the cereal\nAnother bar, reppin' my squad, not individual\nBut one Nation under God, that's indivisible\nMy time critical, hands off I'm digital\nMe and my Ladybug, back when the planet was Digable\nI'm cool like that, my cash rule like that\nI'm classic, Patti LaBelle, Voulez Vous like that, come on\n\n[Verse 6: Inspectah Deck]\nIt's only Logic, we got 'em mobbin' in the mosh pit\nFifth Brother, INS hotter than the tropics\nThe hot shit I drop quick\nMajor player, watch my stock lift\nRazor-blade sharpness regardless to whom or what\nSound boy, turn that music up\nNaysayer, you ain't even got a clue what's up\nDeadly melody, the sickness, the remedy\nEverything circulate back around eventually\nWitty unpredictable, talent all-natural\nGain, Wu-Tang pumpin' through your veins\nTwenty-five years, still more of the same\nThe flow like water with the boilin' flame\nINS, your highness, they callin' my name\nBoy, I wet the scene similar to fallin' rain\nIn our own lane, y'all soundin' all the same\nTell 'em Wu-Tang is on your brain\n\n[Verse 7: Cappadonna]\nSurvival of the fittest be cold days with no money\nThey don't want me with stacks, they better take it from me\nYou know the currency gone soon as you break a twenty\nSo I ain't down if you ain't talkin' that band language\nDear Lord, I'm tryna buy me a train with it\nAn airplane, see me flyin' to Spain with it\nBut money don't make me, and I ain't gonna change with it\nI'm in the hood, lookin' good, the way I came with it\nDo it for the Cs, they understood the game with it\nWe gave birth when we understood the pain with it\nWhen we create wars, everybody is a gangbanger\nWe killin' each other, but we all got the same anger\nNever go against the grain, homie, that's hateful\nAnother day in the life for us to be grateful\nSpread love, homie, yeah, get a plateful\nIt's better to stay full, so let's make moves\nI know your momma told you that I was a great dude\nThese dirty-ass cops, they kill and rape you\nOn some Jason shit, might Crystal in the Lake you\nWhat? What, what? They might Crystal in the Lake you\n\n[Verse 8: Jackpot Scotty Wotty]\nBoom bap blast'll blow your sleeves off\nOur Flashback Jacks are somethin' to feed off\nSmoke and roast ya, the No. 9 Potion\nPull that shit, son, we open the ocean\nWho gives a fuck who's snortin' and drinkin' and smokin'?\nYou get killed for jokin', everybody's hopin'\nThat's another level of emotion\nFood stamps niggas doin' grocery\nPolice wanna grope me\nPerp walk, then nigga street-talk\nWe bury niggas in sea salt\nI carry the torch where I leave off\nI'm givin' bitches somethin' to breathe on\nI rip off a shoulder to lean on\nIt's fair game, it's two in a lane, she took two trains\nAnd none of my rhymes are two and the same\nNigga get cooked on a open flame\nI'm a hillbilly, Park Hill-trained\n\n[Verse 9: U-God]\nMy rhyme starts riots in the mountains\nThirty-six million and countin'\nThe harder they come, the harder I go\nLoosen up my arms, can I get comfortable?\nStay on my tip-toes, old-school Wu beat\nThis is a flip-phone, dude, your slips showin'\nWhere I come from it stays snowin'\nThe grammar is raw, I'm slammin' the door\nBeez bang bong in your jaw\nI hit 'em in the head with the hammer of Thor\nStars and bars, makes me a general\nAnything less, makes me a criminal\nGotta dig deep for these Wu-Tang minerals\n\n[Verse 10: Masta Killa]\nG.O.D., shadowbox with the L.O.G.I.C\nOn the count of three, Wu-Tang\nFirst, master your breathin'\nI'm mental ass-whoopin', I'm teachin' when I'm speakin'\nI'm a champion from Brooklyn\nI'm movin' super-ninjas and Shaolin executioners\nAvenger, a righteous defender\nGrandmaster from the 36th Chamber\nToad style is mentally strong, so strengthen your arms\nTo hold my microphone you need iron palms\nRemain calm, Jamel Irief\nWise chief, Wu-Tang poison clansman from the east, yeah\n\n[Verse 11: GZA]\nEnter a world of a universal mind of one kind\nA thick swarm of words that's expressed in one rhyme\nFood for thought, impossible sliders with the seasoning Regardless, I speak logic—clear reasoning\nThe uncivilized, get the mineral lines, quartz\nSelf-directed, calculated, controlled thoughts\nA point-of-view of the thinkers\nMonumental architecture, amazing as the Incas\n\n[Break: Cappadonna]\n(Sinatra) (Wu-Tang)\nW.T.C., ah-ha\nThe faculty\nAin't nothin' goin' on, don't nothin' move\nNobody slide, nobody get hurt\n\n[Outro]\nEn garde, I'll let you try my Wu tang style\nI'd like to try your Wu tang style, let's begin, then\nShaolin shadowboxing and the Wu tang sword style\nIf what you say is true, the Shaolin and the Wu Tang could be dangerous\nDo you think your Wu Tang sword can defeat me?", "image": "https://images.genius.com/04d1c970904a534f622b012d9599fc9b.440x440x1.jpg"}], "artist": "Logic"}