{"songs": [{"title": "Underground", "album": "Relapse", "year": "2009-05-15", "lyrics": "[Intro]\nA lot of people ask me\nWhere the fuck I've been at the last few years\nShit, I don't know\nBut I do know I'm back now\nHaha\n\n[Chorus]\nHere comes the rain and thunder now\nNowhere to run, to run to now\nI disappeared, don't wonder how\nLookin' for me? I'm underground\nHere comes the rain and thunder now\nNowhere to run, to run to now\nI disappeared, don't wonder how\nLookin' for me? I'm underground\n\n[Verse 1]\nDre, I'm down here, under the ground, dig me up!\nBroken tibias, fibias, yeah, fix me up\nSixty sluts, all of them dyin' from asphyxia\nAfter they sip piss through a Christopher Reeves sippy cup\nDixie cups, toxins, boxes of Oxy pads\nEnough Oxycontin to send a fuckin' ox to rehab\nWack job in the back in a black stocking cap\nJackin' off to a hockey mask at a boxing match\n(He can't say that!) Yes, he can\nI just did, faggot, now guess again\nBetter text message your next-of-kin\nTell 'em shit's about to get extra messy\nEspecially when I flex again\nAnd throw a fuckin' lesbian in wet cement\nFaggoty, faggoty, faggoty! Raggedy Ann and Andy\nNo! Raggedy Andy and Andy\nNo, it can't be, it can't be—yes, it can be\nThe fuckin' Anti-Christ is back, Dante\nIt's Satan in black satin panties\nThis is Amityville, calamity, goddamn it\nInsanity, pills, fanny pack filled with Xannies\nThrough every nook and cranny, lookin' for trannies\nMilk and cookies spilled on my silk négligée, looky\nRazor-ba-lades with me to make you ba-leed\nCases of Maybelline makeup lay on a table of weed\nSlim Shady? Shit sounds like a fable to me\n'Til he jumps out of the fuckin' toilet when you're takin' a pee\n\n[Chorus]\nHere comes the rain and thunder now\nNowhere to run, to run to now\nI disappeared, don't wonder how\nLookin' for me? I'm underground\nHere comes the rain and thunder now\nNowhere to run, to run to now\nI disappeared, don't wonder how\nLookin' for me? I'm underground\n\n[Verse 2]\nSix semen samples, seventeen strands of hair\nFound in the back of a van after the shoot with Vanity Fair\nHannah Montana, prepare to elope with a can opener\nAnd be cut open like cantaloupe on canopy beds\nAnd Glad bags, yeah glad to be back\n'Cause last year was a tragedy that landed me smack-dab in rehab\nFuckin' doctor, I ain't understand a damn word he said\nI planned to relapse the second I walked out of that bitch\nTwo weeks in Brighton, I ain't enlightened\nBitin' into a fuckin' Vicodin like I'm a Viking\nOh, lightning is strikin', it might be a fuckin' sign I need a psychic\nEvaluation, fuck Jason, it's Friday the 19th\nThat means it's just a regular day (hah!)\nAnd this is the kind of shit I think of regularly\nFuckin' lesbian shouldn't have had her legs in the way\nNow she's pregnant and gay, missin' both legs and beggin' to stay\n\n[Chorus]\nHere comes the rain and thunder now\nNowhere to run, to run to now\nI disappeared, don't wonder how\nLookin' for me? I'm underground\nHere comes the rain and thunder now\nNowhere to run, to run to now\nI disappeared, don't wonder how\nLookin' for me? I'm underground\n\n[Verse 3]\nTell the critics I'm back and I'm comin' to spit it back in abundance\nHit a fag with onions, then split a bag of Funyuns\nMad at me? Understandable, cannibal, shoot an animal\nOut of a cannon and have 'em catapult at an adult\nCaptain of a cult with an elite following\nTo turn Halloween back into a trick-or-treat holiday\nHave Michael Myers lookin' like a liar, swipe his powers\nReplace his knife with flowers and a stack of fliers\nHit Jason Vorhees with a 40; stuck a suppository\nUp his ass, and made him tell me a story\nGave Hannibal Lector a fuckin' nectarine\nAnd sat him in the fuckin' fruit and vegetable section\nAnd gave him a lecture\nWalked up Elm Street with a fuckin' Wiffle bat drew\nFought Freddy Krueger and Edward Scissorhands too\nAnd came out with a little scratch, ooh\nLookin' like I got in a fuckin' pillow fight with a Triple F.A.T. goose\nInsanity, can it be vanity?\nWhere's the humanity in having a twisted fantasy\nWith an arm-and-leg amputee?\nStraitjacket with a hundred and eight brackets\nAnd a strap that wraps twice around my back\nThen they latch it; cut your fuckin' head off\nAnd ask where you're headed off to\nGet it? \"Headed off to?\" Medic, this headache's awful!\nThis anesthetic's pathetic, so is this diabetic waffle\nAnd this prosthetic arm keeps crushin' my hard taco\n\n[Chorus]\nHere comes the rain and thunder now\nNowhere to run, to run to now\nI disappeared, don't wonder how\nLookin' for me? I'm underground\nHere comes the rain and thunder now\nNowhere to run, to run to now\nI disappeared, don't wonder how\nLookin' for me? I'm underground\n\n[Outro]\nSo, it wasn't a choice, it was \"I had to do this.\"\nAnd now I got 90 days clean\nAnd uh, that's all I have to share, thanks\n(Thanks for sharing, Brian\nIs there anyone else who'd like to share this evening?)\nYeah, I got something to share:\n\"When you walked through the door you were queer to me\nSo come here, baby boy, just come here to me\nYou're a cock-boy, everybody wants you\nYou're gayer than you would ever claim to\nI won't have to rape you\nSo, homie, lay down, down, down\nLay down, down, down\nLay down, down, down, lay down, lay down.\"\nWhere's everybody going?\nThis always went over real big in Gay-A\nOkay, wait, I got another one\n\"I just love condoms and lots of cum.\"\nNo? Well, shit!", "image": "https://images.genius.com/280d45965a412d7e2a115e2db61d79f2.1000x1000x1.jpg"}], "artist": "Eminem"}