{"songs": [{"title": "Only Dimes", "album": "The Pimp Tape", "year": "2018-11-08", "lyrics": "[Intro: The-Dream]\nEh, eh, eh\n\n[Chorus: The-Dream]\nLooking for Tati, Sienna, Adina, Savannah\nLooking for Roxy, Shaquita\nIf you in The Bay, I'll come meet ya\nIf you in The A, I need ya\nI'm a fiend for Anita\nLooking for the bad, and the baddest\nOn a Monday, like we in Magic, hey\n\n[Verse 1: G-Eazy]\nEvery big film needs a supporting cast\nShe know she ain't the one but she supporting that\nRoom service bottles, I'ma order that\nShe got a bomb ass pearl but it's more than that\nShe knows what it is and she play her role\nEvery girl's not built for it, it takes a toll\nShe hops on top and she take control\nAnd it's between us, she won't tell a soul\nOur secret, it's how we keep it\nNot everybody's business who I sleep with\nPoppin' Dom P, I ain't drinking cheap shit\nIt's G and Too Short, every bar gotta bleep it\nAlbum 25, it's The Pimp Tape\nAsked the OG, \"How long did this take?\"\nHe said, \"It's an Oakland thang\"\nThen he sparked another one, just, just smokin', mayne\n\n[Chorus: The-Dream]\nLooking for Tati, Sienna, Adina, Savannah\nLooking for Roxy, Shaquita\nIf you in The Bay, I'll come meet ya\nIf you in The A, I need ya\nI'm a fiend for Anita\nLooking for the bad, and the baddest\nOn a Monday, like we in Magic, hey\n\n[Verse 2: Too $hort]\nShe's on my line, and that's good to know\nAnd she's a bad one, so that's good for $hort\nShe's ready, and I'm wit' it\nGot the Uber on the way, I'll be there in a minute\nWe can hit the bar and have a few drinks\nGet in the zone, tell me what you think\nAbout my lifestyle, it's quite wild\nI like to use Magnums, no Lifestyle\nI hope I don't scare you with how I'm living\nI'm all around the world with beautiful women\nI can't help that, I'm a player\nAnd if you still on my line, hit me later\nThen we can chill all the time, anywhere\nMake a lot of noise, let 'em know when we here\nPulling on your hair, slap you on the rear\nYou see me with my other girl, you don't care\n\n[Chorus: The Dream]\nLooking for Tati, Sienna, Adina, Savannah\nLooking for Roxy, Shaquita\nIf you in The Bay, I'll come meet ya\nIf you in The A, I need ya\nI'm a fiend for Anita\nLooking for the bad, and the baddest\nOn a Monday, like we in Magic, hey\n\n[Outro: The-Dream]\nThe kind of girl I only fuck with: dimes\nAnd I'm tryin' to fuck all the time\nAre you a freak, shorty? What's your sign?\nI bet you I could make you mine\nFirst, I'ma put you on that D'Ussé\nAnd then I'ma front up in that pussy\nGirl, I need you on my line\nI only fuck with dimes", "image": "https://images.genius.com/46e22a0f3338d4832cc1464e3d1176d3.680x680x1.jpg"}], "artist": "Too $hort"}