{"songs": [{"title": "Higher (Remix)", "album": null, "year": "2010-08-28", "lyrics": "[Intro: Swizz Beatz]\nY'all ready for this?\nI need y'all to put your lighters up like this\n\n[Verse 1: Game]\nGuess who in the building, send New York a fax\nTell 'em I'm rollin' chronic up with Jay Electronica\nTell 'em it's (Game time!), yeah let 'em know son\nI’ve been swiss cheesing beats since ‘01\nI put the Range in the Rov, the 6 in the hundred\nStay blunted nigga I gets money\nYou niggas just spittin' to get cars and cop cribs\nCan I live? Drive that bullshit off a bridge\nWith a Jesus piece under my polo\nEntourage, never that, now I ride solo\nRoll up backwoods and smoke with finesse, yes!\nI said a prayer then I took off my vest\nNow I’m walking with disciples, fully-loaded rifles\nBack on the top like I’m sittin' on the Eiffel\nTower I devour MC’s\nI’m dope aka a hundred keys\n\n[Hook: Swizz Beatz]\nPut ya drinks in the air and get\nHigher, higher, higher, higher\nPut ya drinks in the air and get\nHigher, higher, higher, higher\nGame and Swizz in here we get\nHigher, higher, higher, higher\nPut your hands in the air and get\nHigher, higher, higher, higher\n\n[Verse 2: Jay Electronica]\nNas already told you\nThe rap game is like the crack game, cut throat\nYou got to pull your own weight nigga, tug-boat\nI’m out West now bangin' with the Game and them\nCalifornia top shelf kush to the cranium\nOne love, one blood, the legend is real\nWord to @Iamdiddy, the President Seal\nHas been stamped and approved\nWe rock every crowd, you get trampled and booed\nIt's the phantom of the chakra, slum dog opera\nRap Radar, Nah Right, Okayplayer mosh up\nEverything was all good just a week ago\nWhat happened to your clique, nigga, where your people go?\nI got a message for you homie, let your people know\nWe got the game locked down from Inglewood to Tupelo\nJay ElecYarmulke and Westside Red\nBreaking bread like black kings, fuck what you said\n\n[Hook] x2", "image": "https://images.genius.com/9c29ee407cd2d88f01ce08743e61d3b1.614x614x1.jpg"}], "artist": "The Game"}