{"songs": [{"title": "No Haters", "album": "Sorry 4 The Wait 2", "year": "2015-01-20", "lyrics": "[Intro: Skooly]\nLondon on da Track, bitch!\n\n[Verse: Lil Wayne]\nWe catch a body and we laugh about it\nI fucked her friend, I don't feel bad about it\nGrinding, it's agonizing but it's gratifying\nSkinny tires on a salad diet\nOoh, I lost my mind, I'm like \"Fuck everybody!\"\nYeah, I lost my mind, but I got extra copies\nYeah, I fuck so long, it feel like exercising\nI'll test a lion before testifying\nAll I got is hitters in my squad\nI could get you killed, all my niggas want the job\nI could get you killed, it just take a head nod\nI want you dead by tonight, that's a real deadline\nZero fucks given\nI make her come to the condo butt naked 'cause, bitch, ain't no stealin'\nShe still come visit, she don't wan' leave\nShe compared it to me leaving a witness\nI said, \"I get it,\" I keep some cocaine on me for the bitches\nAnd this AK is not for decoration\nFuckboys give me the heebie-jeebies\nI got a hit list like the Yellow Pages\nHey, if she can suck a dick and snort a Quaalude\nThen, ooh, baby, you got my full attention\nChampagne expensive, it taste good or vintage\nOpen your nose, I'll put some sugar in it\nI don't fuck around with them fuck-arounds\nUh, I might fuck around and catch a body\nYeah, I got some niggas that'll hunt you down\nYeah, and catch you slipping like you playing hockey\nWoo! We catch a body and we laugh about it\nYeah, I fuck her friend, I don't feel bad about it\nUh, money and drugs, I'm talkin' math and science\nOoh, skinny tires, on a salad diet\nChopper leave you with a half a body\nMake sure he dead, before we leave, my nigga, grab his wallet\nOoh, I got the hook up on them rocket launchers\nI told Obama, \"Fuck with me, you know I got it\"\nSlime, you need to fuck with me, you know I got it\nI know somebody that know somebody\nLook, traffic dying, we still trap-or-dying\nIt's agonizing but it's gratifying\nSquad! I could get you killed, all my niggas want the job\nI could get you killed, it just take a head nod\nWant you dead by tonight, that's a real deadline\nHold up, you ain't got no hitters in your squad\nI could get you killed, that's my real day job\nI'm a crime of passion, I'm a fucking hate crime\nSpit like I ate bombs, Eminem on 8 Mile\nI'm the motherfucking man, Scarface, Facemob\nPockets looking like The Blob, chips like Cape Cod\nBust your motherfucking egg 'til I see egg nog\nMy bougie bitch ratchet, my ratchet bitch a straight snob\nHold up, who know how to read gang signs?\nCause we gon' throw 'em up and we gon' give 'em hang time\nI got white, I got brown, sell it at the same time\nThat's that James Brown, and that's that James Bond, ooh\nWe catch a body and we laugh about it\nIt's catastrophic but we glamorize it\nIt's agonizing but it's gratifying\nSkinny tires on a salad diet, ooh!\nChopper leave you with a half a body\nNo hesitation, no stall, like the bathroom crowded\nChopper so big, so tall, it could wrap around me\nTriple A: Astronomic And Atomic\n\n[Outro: Lil Wayne]\nTunechi\nAnd it's that Sorry 4 The Wait\nAnd I'm so sorry for the wait, yeah", "image": "https://images.genius.com/c84ee812d9e99028d560054b386d4d9d.500x500x1.jpg"}], "artist": "Lil Wayne"}