{"songs": [{"title": "Graduation Camp", "album": "No Genre: The Label", "year": "2015-01-03", "lyrics": "[Hook: Jaque Beats]\nSippin' on that Hennessy\nSure feel good to me\nLet me hit that\nLil mama got that ass to squeeze\nI'ma put that ass to sleep\nCan I hit that\n\n[Verse 1: B.o.B]\nGirl I don't know how you passed\nYou wasn't even in class\nGot a D for them titties, and an A for that ass\nShe bust it open for bobby\nShe shakin' for bands\nLook like buffy the body the way that she stand\nGot a fifth of that henny a eight of that gas\nAnd its 3 in the morning nigga you do the math\nAnd add it up, I like a hard drop baby back it up\nTell that nigga that you with you had enough\nShe a thoroughbred, saddle up\nI'm bout to shoot a movie how you actin' up\nI'm bout to knock it out the park batter up\nGirl you bad as fuck...\nI'm in ya neighborhood yea swangin' wood yea\nPull ya brains while I jug girl you got some good hair\nWalkin' like a dog yea, break it off yea\nOn the table cloth yea, wipe it off there\nI see ya nigga hatin' there a little salt there\nI just drop a little sauce yea, i'm the boss there\nStretch the box out yea, on ya couch yea\nKill the pussy off yea, and i'ma chalk there\nBands\n\n[Hook: Jaque Beats]\nSippin' on that Hennessy\nSure feel good to me\nLet me hit that\nLil mama got that ass to squeeze\nI'ma put that ass to sleep\nCan I hit that?\n\nSippin' on that Hennessy\nSure feel good to me\nLet me hit that\nLil mama got that ass to squeeze\nI'ma put that ass to sleep shh\n\n[Verse 2: Jaque Beats]\nSee I woke up this mornin' with a Spanish brunette\nTheres a chance I get to knockin' call it rushin' roulette\nAin't no groceries in her dorm so she rushin' to get\nSomethin' to set the mood I know she could cool\nSo I let her get the 4th letter whoa\nHit it in a Volkswagen, and her name Jetta\nHit it after church so we all sinners\nMatter fact she's in the choir, she do everything [?]\nAnd everyone's a winner when we at the ocean\nBikini's on binoculars i know they scopin'\nHotel I let her be my chauffeur\nLove, how she look with her garage open...\nI'm bout to double park that in her heart yea\nFuck around and do a cartwheel leave ya broad there\nTest drive that's a car sale new Ferrari\nFeelin' on the hump hump shawty this is not braille\nShe a cougar that's a all tail with a tall tail\nOther women be like, oh hell, he ain't for real\nShe show me that monkey she can't keep it in a ball rail\nSo she throw it at me and I bat it, i'm like aw yea, aww yea\n\n[Hook: Jaque Beats]\nSippin' on that Hennessy\nSure feel good to me\nLet me hit that\nLil mama got that ass to squeeze\nI'ma put that ass to sleep\nCan I hit that?\n\nSippin' on that Hennessy\nSure feel good to me\nLet me hit that\nLil mama got that ass to squeeze\nI'ma put that ass to sleep\n\n[Verse 3: T.I.]\nUhh well I be god damned what it is\nBitch shake it for you sit back [?]\nI know yo baby daddy so you with that nigga still?\nFuck him girl if he hit you, I get that nigga killed\nAss big like a tractor trailor wheel\nIf money get it done we can make a deal\nBut you gotta bring ya girl make her take a pill\nAnd do it all babe tomorrow you'll be naked still\nHonest and truly I do concur\nThat you a super bad bitch I ought to buy you a purse\nYou got a mediocre nigga shawty I come first\nAnd if I come first treat it like starburst and just...\nChew it, shawty you know how to do it\nMy dick so big its in you I could nail the pussy to it\nI bet I get it hot and wet like some lighter fluid\nAll it's missing is some fire wood to put some fire to it\nAy\n\n[Hook: Jaque Beats]\nSippin' on that Hennessy\nSure feel good to me\nLet me hit that\nLil mama got that ass to squeeze\nI'ma put that ass to sleep\nCan I hit that?\n\nSippin' on that Hennessy\nSure feel good to me\nLet me hit that\nLil mama got that ass to squeeze\nI'ma put that ass to sleep\nCan I hit that?\n\n[outro: Jaque Beats]\nYo its, its Jaque i make, i make beats and uumm...awkward", "image": "https://images.genius.com/75e7f10bcbceaf55df2abb72f70543f1.500x500x1.jpg"}], "artist": "B.o.B"}