{"songs": [{"title": "No K", "album": "Special Effects", "year": "2015-05-04", "lyrics": "Inside joke is outside now\n\n[Verse 1: Tech N9ne]\nNo K?\nJust another way me and my crew say, \"No way\"\nOr \"It's not okay\" when I got the bottles pay\nAnd somebody you don't know that wanna swallow say\n\"I don't got no grip but want a sip.\" No K\n\"Can I take yo blunt right to my lips?\" No K\nBroke ass always begging me that's No K\nYou don't understand then bitch, no way\nSee you ballin', gotta tell 'em, \"No K\"\nLookin' like a money bag, smellin' Dolce\nHungry lookin' at you like their feelin' Chipotle\nAll you gotta tell 'em, \"Run to hell and go play\"\nWe flyin', you tryin', to get a check, sit next to who's buyin'\nShe wanna sex a vet, never request a net and love Tech for Tech, but you lyin'\nHey, and that's no K, get away and the bitch best obey\nTryin' to use sex to get yo way but the greed negated everything that ho say\nAnd she played out like exposé, tryin' to get quality time like, \"Let's crochet.\"\nGot me thinkin' of chinnin' some underhanded women but I never hit a woman so I'mma fetch Solé\nAnd Ginuwine said, \"That's no k.\" (Heh Heh Heh)\nSayin' if you got ya hand out, stop ya damn mouth\nAin't none of my fault you get low pay\nSo needy (Ha), I'm on Ace of Spades and you J Roget\nThey wanna try and get whatever you got\nWanna wear the chain and watch, I'ma say, \"No K.\"\n\n[Hook: Krizz Kaliko]\nNo K, that's what I say when I don't really wanna\nSay that it's all right (No, no, no)\nNo K, that's what I tell you when I ain't just trynna\nTalk to you all night\n(Noo-ohh) Can't get my money\n(Noo-ohh) That's not okay\n(Noo-ohh) And I'm one hunnit\n(Noo-ohh) So I'ma tell you that's no K\nNo K\n\n[Verse 2: E-40]\nNo K\nShe my bitch but I ain't finna give her her none of my pay\nNo way, no how, no what?\nBitch, I don't give a motherfuck\nIt's paper over pussy, P-O-P\nCelebrity get everything for free\nIf you can't swim, you gon' drown\nThrow a bitch up in the air and break her 'fore she hit the ground\nNo K  No K, No K No K\nThis ain't Broadway, no play\nFrom the track, from the cage, from the soil, from the mud\nWords hella hate, no love\nNo suckers allowed in my camp and hell no, you can't hit my weed you tramp\nWanna stand on the stage? No K, you can't\nRide on my bus? No K, you can't\nWhy you always got ya hand out? All you do is pout like a woman\nGrown man, act like niggas owe you somethin'\nHabitual liar, always lyin' for nothin'\nStart a lot of shit and be the first one runnin'\nNo K, prolly told on hella niggas in the game\nLike Jose, AK, AK-47 to a nigga brain\nGet him out the way\n\n[Hook]", "image": "https://images.genius.com/edd99f73805809fd6bac9dda75c9e951.550x550x1.png"}], "artist": "Tech N9ne"}