{"songs": [{"title": "We’re Back", "album": "Eminem Presents: The Re-Up", "year": "2006-12-05", "lyrics": "[Ad-Lib: Eminem]\nShady\nWe're back!\n\n[Verse 1: Eminem]\nNothing can stop and nothing can change it\nYou better just make new livin' arrangements\nIf you think you the top and king of the castle\nYou about to be thrown off the throne and ripped a new asshole\nAll I hear is I'm best at this and I'm best at that\nBut I don't hear my name, no, ne'er brought up in rap\nAnd I don't usually trip or dare get caught up in that\nBut when they say \"one of the best\"\nI'm nowhere thought of as that\nNot even the same league as Jay-Z, Nas, Pac, Biggie or maybe\nThey'll name me somewhere down at the bottom\nRight after AZ\nOr say he ripped that Biggie verse, or that Jay-Z\n\"Ayo his verses were crazy, on that 'Renegade,' b!\nBut I ain't never bought no whole CD of Shady\"\nAnd all I hear is pop tunes come on the radi—\nO, and they play 'em 20 times in a row daily\nAnd that very well maybe the same reason they don't say me\nWhen they speak on hip-hop legends, which has amazed me\nCause I thought the formula was to hit mainstream\nAnd make it big—ba—big—big bay—ba—baby\n\n[Verse 2: Obie Trice]\nSo maybe the eighties made me crazy\nI've been tryna get my weight up since the ace Slim Shady\nGave me the gate key, paved the way\nSo lately my stakes get better each day\nReplay my relay race, when I was chasin the 8V at eighteen\nEight years later his voice in Beijing, no choice I chase cream, so\n\n[Ad-Lib: Eminem]\nShady (Stat Quo!)\nWe're back!\n\n[Verse 3: Stat Quo]\nThis is what I eat, sleep and breath and feed\nMy kids would it fulfill all my family needs (c'mon)\nI treat the mic like the block, fuck with my rocks, and squeeze\nCritics expecting me to underachieve\nI just deal with the hate I receive by rolling back my sleeves\nSure was a breeze, I bring him right to his knees\nAnd tell him \"suck my dick,\" I take a bow and leave\nWith a sack full of unmarked cheese\nI find it hard to believe who to pull or proceed\nTo be G's and claim they runnin' shit, nigga, I run me (I run me!)\nAs a kid, teacher said I had a mouth on me\nThat same mouth got me the deal with Dre and E\nFolk in the hood be askin' where I be\nDawg, I'm out in Hawaii, don't like it? Drink my pee\nRecord song for the \"Detox\" LP\nFeet don't fail he\nNiggas got me bent like Cranberry and Belvee\nI'mma die wealthy\nBoss in the game, what the fuck they gon' tell me?\nA-Town's entrée Aftermath, Shady!\n\n[Ad-Lib: Eminem]\nShady (Bobby Creek!)\nWe're back!\n\n[Verse 4: Bobby Creekwater]\nY'all market y'all block, they sent me to corner that\nRap game's an old flame, my nigga I want 'em back\nLike mic check, pimp for what it's worth, I got the right net\nSittin' here excited by some shit that ain't right yet\nNo regret, live by a code you don't know bout\nY'all niggas won't be certified 'till I show I\nGo out on a limb with Em, 'cause I'm with him\nPut a barrel to the apparel of you and some of them\n(None of them) stand a chance, at the dance without a bowtie\nShady Records re-introduce you niggas to Mow-ti\nSo high, of the light that they have given me\nAnd the haters like a chauffeur because it's driven me\nTo a view with a vendetta I am the epitome\nI don't give a fuck about ya nigga, I'm just livin me\nWe the reason for the season\nSo I'm breezin through the track, nigga\n\n[Ad-Lib: Eminem]\nShady!\n(Ca$his!)\n\n[Verse 5: Ca$his]\nI can prove I'm here to do something you never do\nFrom hand to hand coke sales, from my revenue\nI ain't been to a function, where I ain't snuck a weapon through\n'Cause my background reveals a one eight seven too\nTo the block, I'm the truth, to the cops, I'm the proof of this\nAnd niggas still out there, you just gotta shoot\nI carry over my street ethics, to the booth\nAnd the shady crime fam, Al Capone in his youth\nThe difference between me and you, I already done it\nAnd lived the street life, niggas run away from if\nYou follow my life, in a midwest blunted\nPitchforks held high, four fifth by the stomach\nYou can find me right now, on the C.A. streets\nI'm on the roof, of the building, shooting at police\nSome of the homies feel opposition can't kill me\nI'm a walking obituary, death live in me\nI take life through the pen, by the way, I'mma see\nOr have you raped in the pen, like American meat\nI'm connected gettin weight from MS 13\nWith S.K's, A.R's and Mini fourteens\nI'm Cashis, the last of the real, with a strap\nOn Pro-sac, D's and E-Pills, it's a rap\nGet the block on tip, two for tens of crack\nI'm in a lifetime contract, Shady's back\nNigga\n\n[Ad-Lib: Eminem]\nShady, (Ha! I told you we was back!), we're back!\n\n[Outro]\nHaaaaaaaaa! *Fart*\n(What?)", "image": "https://images.genius.com/33da7d45539d664487f55ab555d4af7f.355x352x1.jpg"}], "artist": "Eminem"}