{"songs": [{"title": "Be This Way", "album": "The Pretty Toney Album", "year": "2004-04-20", "lyrics": "[Intro: Ghostface Killah w/ Billy Stewart samples]\nAiyo... aiyo, what up, yo\nWhat up, ya'll, this that Pretty Toney shit\nAiyo, I know there's a lot of hoods and shit out there\nA lot of niggas done got bodied\nA lot of niggas done got robbed and shit\nYou know what I mean? We love a lot of things in the hood\nBut time goes on... and if we don't change a lot of shit\nShit always gonna be this way, and that's a muthafucka fact!\nTrue gangsta shit, ya'll, yo, yo, yo\nWhen ya'll turn my mic up in here, bareback shit\nKnowhatimean? Tired of ya'll muthafuckas and shit\nOne-two, fuck around and clob on one of ya'll muthafuckas\nYo Spidey, put that reverb shit, on\nCome on... \"Can you feel it? Can you feel it?\" Yeah\n\"Can you feel it...\" Let's go, fuck it...\n\n[Verse 1]\nLive from Staten Island where the gangsters kill\nOnly place on the map that got the 30 dollar bill\nAnd we front like we got millions\nOur specialty is how we willie, niggas—that's how Buck brought the building\nAnd the police is pussy, they protect and serve\nThey connect with baseheads then they frisk our birds\nSmack DVDs, blowin' herb\nI'm in the room bonin' these two white bitches, Ice baggin' up work\nThat's how we get down, fuck Vegas, the black Carlo Gambino\nRockin' the wallo's, blow his diamonds in Z-No's\nSpicey, verses is jalapenos\nBest to leave, when I'm in the big Escalade, I'm sittin' on Dino\nTone Stark, a poet's art\nKiss the girls and bake them pies, clean up, some are old darts\nThis that real live don' shit, you heard!\n\n[Hook: Ghostface Killah]\nYo, they lick forty rounds, today\nOkay, plus the shit is mad hot around the way\nNiggas don't give a fuck on any time or day\nOr if he dyin' today or could he find a way\nBlow niggas over 'turf—bitches, dimes and trays\nBlow a nigga a jewel and watch him slide away\nIt's like that, in the hood, he in the grimy say\nBut what we tryna say is gonna \"be this way\"\nIt don't have to... it don't have to... \"My God!\"\n\n[Verse 2]\nWith big carrots and static, with that leaves the bad habits\nDrugs layin' in buildings with great big automatics\nAnimos' in the hood, it's a fact, we could do magic\nSplatter faggots in lobbies, the heat burn off his eyelashes\nDon't try to pass this, back up or you'll receive something\nReal tragic, them hollows'll race through your jacket\nSemi gangsters with weak tactics\nForensic scientists called in to display graphics for square inch to his back winds\nThey brain and spleen is left all over a fiend's mattress\nBastard, we cock and squeeze after we leave our ratchets\nWe keep the hood cryin' for massive havoc\nNo Trix we take from silly rabbits, yo feed them lead carrots\nThe little mans'll connect and they touch that fabric\nThe only thing that can stop 'em is that tephlon fashion\nMaybe artillery's heavy like a bunch of fat chicks\nBrrrr.... baow! Ain't no comin' back bitch!\n\n[Hook: Ghostface Killah]\nYo, they lick forty rounds, today\nOkay, plus the shit is mad hot around the way\nNiggas don't give a fuck on any time or day\nOr if he dyin' today or could he find a way\nBlow niggas over 'turf—bitches, dimes and trays\nBlow a nigga a jewel and watch him slide away\nIt's like that, in the hood, he in the grimy say\nBut what we tryna say is gonna \"be this way\"\nIt don't have to... it don't have to... \"My God!\"\n\n[Outro: Billy Stewart samples]\n\"Ways... be this way!\" (3X)", "image": "https://images.genius.com/1563d407e670f05603a84947a6af2c41.1000x1000x1.jpg"}], "artist": "Ghostface Killah"}