{"songs": [{"title": "St. Tropez (Live)", "album": "Forest Hills Drive: Live from Fayetteville, NC", "year": "2016-01-26", "lyrics": "[Intro]\nListen, huh\nAy put your hands in the air one time, throw your hands in the air, one time, one time, hey\nPut your hands in the air two times, throw your hands in the air two times, two times, two six\nPut your hands in air three times, throw your hands in the air three times, three times, hey\nPut your hands in the air four times, throw your motherfuckin' hands up and sing\n\n[Verse 1]\nRoll up and smoke my sins away I’d like to go to St. Tropez Maybe I'll go, maybe I'll stay Maybe I’ll stay\nShe asked me if I'm scared to fly To tell the truth, I'm terrified I never been that high before Very bad reason not to go (I know) Terrible reason not to go (I know)\nSing\n\n[Hook]\nHe's on his way, he's 'bout to get paid He's on his way to Hollywood He's on his way, he’s ’bout to get paid He's on his way to Hollywood Show him the\nWay, he’s 'bout to get paid He's on his way to Hollywood He's on his way, he’s 'bout to get paid He's on his way to Hollywood\n\n[Verse 2]\nAy from the door I showed you my scars And I told you girl, \"I won't lie\" If we at war, then this is a war that I can't afford, no I, I, I I wanted more\nBut that was before Lord knows I'm torn, so I–I cry (No I, I, I)\nFrom the corner of my eye, baby It's been hard for me to smile Lately, it's been hard for me to smile Lately, it's been hard for me to smile Lately, it's\nBeen hard for me to smile\n\n[Spoken Interlude]\nFayetteville shit, listen\nAy put your hands in the air one time, throw your hands in the air one time, one time, up top\nPut your hands in the air two times, throw your motherfuckin' hands in the-air\n\n[Singing Sample]\nIf you won't take me in your home If you won't take me in your home If you won't take me in your home If you won't take me in your home\n\n[Hook]\nHe's on his way, he's 'bout to get paid He's on his way to Hollywood He's on his way, he's 'bout to get paid He's on his way to Hollywood Show him the\nWay, he's 'bout to get paid He's on his way to Hollywood He's on his way, he's 'bout to get paid He's on his way to Hollywood\n\n[Spoken Interlude]\n\nY'all feeling alright man, make some motherfuckin' noise one time\nThis shit crazy, man y'all don't even realize this shit is like\nThis shit is unreal man lemme- lemme talk to y'all for a second\nI want to talk to y'all- because\nIt's cool for me to come out here tonight\nIt's just an honor to be able to fuckin' sell out the Crown and shit and come back home and this shit is retarded in itself I appreciate y'all, thank you man\nBut it's one thing for me to come out here tonight and just perform the whole album for y'all, that's already amazing, thank y'all for letting me do that shit, you know what I mean that's already crazy\nNiggas don't do that type of shit, perform they whole albums\nBut it's one thing to just come and do the songs, that's cool, I love doing that I do that every day of my life\nBut, me personally, I like to use the shows as an opportunity that I don't ever really get like that\nBut I love to do it\nAnd that's the opportunity to come here and speak directly to y'all and have y'all feel every word that I'm fuckin' saying to you that's what I like to do\nSo right now, I want to talk to y'all about- this song right here that I just did\nThe name of that song is called St. Tropez right, that's the name of that song, St. Tropez\nBut if I'm being honest with y'all\nIf I'm keeping it funky\nIf I'm being real\nIf I'm keeping it a hunnid\nOr if I'm keeping it fo' hunnid how my nigga YG fo' hunnid be fuckin' saying\nHe love YG, look at him (laughs) aight'\nIf I'm being real, then the truth is\nNigga, I don't even know where the fuck St. Tropez is at\nI don't know it's at\nI don't give a fuck (laughs)\nWhen I talk about St. Tropez in the song-\nWhat I do know about St. Tropez is, it seems like the type of place that really rich people go to when they got a lot of fuckin' money and they wanna vacation and be on a yacht with champagne glasses and bikinis- it seem like that type of place\nBut when I talk about it on this song it's just a metaphor\nWhat this song is about, and y'all gon' feel me, y'all gon' feel me cause I'm home, and y'all gon' feel me\nWhat this song is about, and a lot of people don't understand this cause I be doing shows in New York, Los Angeles, you know fuckin' Chicago, big ass cities\nSo they don't feel me, they don't know what it's like to be somebody that's from a small town, a place like Fayetteville you know what I mean they don't know what it's like\nThey can't really relate to that shit, so what I'm trying to explain to them is\nWhen I'm talking about St. Tropez on this song it's just a metaphor\nWe grow up our whole- our whole lives watching TV, looking at the movies, seeing places like what- like Paris, London England, St. Tropez, New York City, Chicago, L.A. right?\nAnd as a kid from Fayetteville what do we tell ourselves?\n\"Man one day I'ma go there, one day I'ma go there\" right?\nWhat ends up happening?\nA lot of times because we come from a small town what happens?\nWe suffer from what we call a small-town mentality now what does that mean?\nThat means we grow up our whole lives seeing these places, and we tell ourselves we gon' go\nBut as we grow up we get way too comfortable in our comfort zone, right?\nAnd we too afraid to leave, right?\nThat's why so many people- ain't really stepping out the city like that, they too afraid to go right?\nSo what I'm talking about on this song is tryna give y'all insight to the mentality that I had to overcome\nIf you know anything about my story you know when I turned 18 I said \"fuck this shit\" I moved all the way to New York City I ain't know nobody in fucking New York- but I left\nI left the Ville and I went to New York I took a leap of faith\nFast forward the rest is history\nRight now- listen\nI want to take a break from all this album shit\nAnd I want to perform a song that only- only those people that's been fucking with me from day one is gon' fuck with\nI don't know how many people in here that been fucking with me\n\n[Into Intermission]", "image": "https://images.genius.com/6affcd514d0bc308d7761e9589cd9abc.1000x1000x1.jpg"}], "artist": "J. Cole"}