{"songs": [{"title": "Southern Fried Intro", "album": "Chicken-n-Beer", "year": "2003-10-07", "lyrics": "[Intro]\nHey, yeah! I want all you proud sistas to stand up\nI want everybody to stand up and be counted tonight\nBrothers and Sisters if you know you got your thing together\nI want you to stand on up, now I got somethin' to tell ya'\nI told ya' how to think about it, now I want to tell how to get the thing together\nSo come on now and get up to it yall\n\n[Verse 1]\nThe incredible, untouchable nigga spittin' venom out his body wit' the dopest flows\nAnd wonder why the line's around the corner\nCuz the little motherfucker has the dopest shows\nSo one time for my independant women and all the single mothers who be gettin' that cake\nTwo times for my dawgs pullin' triggers\nAnd my niggas in the kitchen that be flippin' that weight\nEast coast, west coast, midwest, dirty south\nThen we took it all around the world\nI got fans in retirement homes, to teenagers, to little bitty boys and girls\nDroppin' lyrical bombs up in ya' hood\nNon-stoppin', I'mma hit 'em till the block explode\nHip hop, R&B, Pop-tart, what you want?\nI even got a little rock 'n' roll\nThe most creative, original, got 'em takin' subliminal\n*Boom boom* cuz they can't get what I gots\nThey want it so bad, four million dollar pad\nAnd enough to retire off two albums, gone, wave ya' white flags, I'm hot!\nAnd everytime I rhyme I'm puttin' rappers in the ground\nWit' lines that got 'em hooked like dope\nThey gotta make up they mind, because they runnin' outta time\nAnd I'm about to make 'em choke\nBetter turn your stereo louder, listen up and let me preach\nLet's get arrested for Disturbin' the Peace! (C'mon)\n\n[Unnamed male]\nMan! This Disturbin' Tha Peace shit gettin' on my nerves\nBoy I tell you the truth, know what I'm sayin'?\nWhile he doin' shows, I'm in these skreets, know what I'm sayin'?\nWhile he on tv, I'm in these skreets\nAnd then my broad, my kid walkin' around singin' it\nBoy, if they sing another verse, boy I swear\nKnow what I'm sayin'? I'm on another level though\nI gotta car wash, I gotta shop on O' National\nI got my own record label, you heard of us\nThe Posse Family Cartel, you know what I'm sayin', we real\nWho this nigga thing he is?\n\n[Verse 2]\nI'mma house hold name, wit' game spittin' outta my mouth at all times\nI spit it out and about, and spit outta the south,until they recognize the danger signs\nSo feel a tingle in yo' s-spine, by the way I talk\nAnd it's pimpin' in my blood, you can tell by the way I walk\nOoh lawd, more styles than a barber shop, call the cops\nPeople in the way wanna baller block\nLittle do they know that I'm callin' shots\nAnd I'm not to be fucked with\nIf you see me comin' 'round the corner, then duck quick, perpetrators can suck dick\nI tried to tell 'em, but they dont wanna listen\nI tried to shine 'em, but they dont wanna glisten, while the high hat keeps on tickin'\nAnd the kick drum keep on pumpin', I'm dumpin' on the closest fools\nCuz rules were made to be broken, but you can't make broken rules\nHear what I'm sayin' or heard what I said\nHear what they playin', cuz thru this music I'mma still be heard if I'm dead\nCall ya' producers, cuz I'm hurtin' these beats\nI said it once, I'll say it twice, biatch, Disturbin' Tha Peace\nC'mon\n\nYeah, folk\nThe King of the kings has spoken\nATL shawty! Hood to hood, block to block\nWe bouta let our nuts hang!\nDisturbin' Tha Peace!\nWe dont die, we multiply\nWe makin Def Jam history\nThanks for gettin' the CD shawty!", "image": "https://images.genius.com/1498cf277a7dc50ffc916ca191c3608f.1000x1000x1.jpg"}], "artist": "Ludacris"}