{"songs": [{"title": "Lucky You (Traduzione Italiana)", "album": null, "year": "2018-08-31", "lyrics": "[Intro: Joyner Lucas]\nWhoa, Joyner, Joyner, yeah, yeah, yeah\n\n[Bridge: Joyner Lucas]\nYeah, ho fatto un sacco di cose in passato, lo ammetto\nNon mi rimangio quello che dico, se l'ho detto allora intendevo ciò\nIn tutta la mia vita ho voluto un grammy, ma probabilmente non lo avrò mai\nNon ho mai avuto un trofeo o una cazzo di coccarda (Yah l'ho detto)\nFanculo il sistema, sono quel negro, piega la legge, taglia le regole\nSto per rischiare tutto quanto, non ho troppo da perdere\nAvete mangiato fin troppo tempo, è il mio turno di togliere il cibo\nPassa il piatto! Dov'è il mio drink? Questo è il mio giorno, fortunato tu\nFanculo anche a te woo!\n\n[Chorus: Joyner Lucas]\nDovete spostarvi, dovete spostarvi, dovete spostarvi\nFatemi spazio, fatemi spazio, datemi il rispetto\nSalto fuori dalla coupe, salto fuori dalla coupe, salto fuori e sparo\nDovete spostarvi, dovete spostarvi, datemi il rispetto\n\n[Verse 1: Joyner Lucas]\nIndietro alle mie stronzate, la mia schiena al muro\nVi volto le spalle, siete tutti finiti\nIndietro a questi proiettili, si ritorna al lavoro\nTiro fuori il mio MAC e tutti voi correte\nIndietro alla merda sul blocco, si ritorna allo spaccio\nQuesti pacchi e in realtà sto pompando\nNon posso fottere con voi rapper, praticamente voi succhiate cazzi\nPotrete aver fatto platino, ma quello non significa niente\nSto per fare un casino sta volta\nDritto fuori dalla cucina, gli ho detto che il forno è mio\nNon fotto con voi ragazzi\nSe non vi uccido, sappiate che soffrirete questa volta\nNon sono un gangster, ma ho qualche pistola\nQualche catena e qualche lama e un paio di nove millimetri\nMannaie e pistole, una pernice, un pero\nI miei \"Dodici giorni di Natale\" non furono nient'altro che bugie\nVi corro incontro come un lottatore di sumo (sumo)\nPoi dicono che parlo come un coglione (coglione)\nVivo su Marte ma non sono Bruno (woo)\nStronzo sono un cane, chiamami Cujo (rah)\nTu giochi le tue carte, io te le rimando indietro\nE potrei metterne giù quattro come a Uno (bup)\nÈ meglio che tu stia zitto, frocio, puttanella e tutti voi codardi\nHanno inventato un level up nel ghetto per diventare vecchi\nCercando qualcosa che probabilmente non posso trovare\nQuesta merda diventa importante finché un altro beef non muore\nIn realtà un negro mi vuole legato e basta\nSono sempre stato solo e non ho mai avuto bisogno di nessuno\nSolo me e la mia mitraglietta, dirò a questi negri di giacere per terra\nTenetevi i soldi, non ho mai voluto quello stile di vita\nPrego solo Dio affinché mio figlio stia bene, ora\nHo detto niente amore per l'altra sponda\nO per qualcuno che voglia del fumo (Joyner)\nQuando morirò verrò ricordato come l'underdog che non ha mai perso la speranza\nSei nel taxi sbagliato sul sentiero sbagliato\nNegro, via sbagliata, strada sbagliata\nI serpenti nell'erba cercano di strisciare in fretta\nHo appena comprato un fottuto tosaerba\n\n[Bridge: Eminem]\nHo detto tante cose nella mia vita, lo ammetto\nQuesto è in qualche modo una vendetta, mi pento di averle dette\nHo vinto un paio di Grammys ma ho venduto l'anima per averli\nNon era per i trofei, solo per il fottuto riconoscimento\nQuale cazzo è la differenza?\nSono io quel bianco, piega la legge, fanculo le regole\nEro solito rischiare tutto, ora ho troppo da perdere\nHo mangiato abbastanza, il mio stomaco dovrebbe essere pieno\nHo appena mangiato, lecco il piatto, questo è il mio buffet, beato me\nChe cazzo pensi? (woo!)\nHo un po' di ville\nNon ho ancora maniere\nTu hai un paio di ghost writer\nMa a questi bambini in realtà non importa\nMi chiedono, \"Che cazzo è successo all' hip-hop\"\nHo detto  \"Non ho alcuna risposta.\"\nPerchè ho incassato una sconfitta quando ho fatto uscire il mio ultimo album\nMi ha fatto veramente male ma sono ritornato questi rapper\nE venendo veramente da umili origini+\nIn qualche modo vincendo non sono a mio agio\nVorrei poter dire \"Che senzazione meravigliosa!\"\nStiamo facendo il botto come se stessimo spingendo il soffitto”\nMa sembra che nessuno abbia delle cazzo di abilità\nPerfino per mantenersi su un argomento, questo mi uccide\nL'inabilità di mantenere l'umiltà\nHa-ta-ta ba-ta-ta, perchè non facciamo un mucchio di\nFottute canzoni sul niente e ci balbettiamo sopra?\nFanculo, andrò per la giugulare\nQuesta merda è un circo, voi clown che uscite fuori\nNon date il minimo cazzo di peso\nA quelli che erano qui prima di voi che avete fatto rap\nRicapitoliamo, prima gli MC spaccavano sulle cassette\nADAT, dove sono i G Rap e i Kane?\nAbbiamo bisogno di 3 mazzette da 1000 il prima possibile, e riportate Masta Ace\nPerché la metà di questi rapper hanno un danno cerebrale\nTutto quel rappare sulla lean, quei tatuaggi in faccia, sciroppati come la linfa di un albero\nNon odio la trap e non voglio sembrare infuriato\nMa in effetti, dov'è il vecchio me? Lo stesso gatto\nChe prenderebbe quel feed-back e risponderebbe, ne ho bisogno\nMa credo che sia inevitabile\nSanno quale bottone premere o quale leva tirare\nPer farmi scattare (troietta)\nE se gli do ascolto probabilmente peggioro le cose\nMa avete preso i vostri cazzi nel culo, troia (capito?)\nUll’orlo, ogni minuto mi faceva pensare di finire\nTutto con acetominofene e raccoglierne i benefici\nSono di nuovo addormentato al volante\nMentre penso all'intento malvagio\nDi uccidere un altro beat\nPerché anche se dovessi finire di nuovo ad ingoiare un'altra pillola\nAnche se fosse ketamina o metanfetamina con il minithin\nDovrebbe essere almeno dai 70 ai 300 milligrammi\nE potrei anche farlo, perché finirò di nuovo ad essere un cattivo\nQuesto ha dei livelli, io ho un ascensore\nNon potresti mai dirmi che non sono un cazzo di distruttore di record\nSembro un disco rotto ogni volta che infrango un record\nNessuno potrebbe mai cancellare l'eredità che ho lasciato, non ho mai compiaciuto\nFiglio di puttana, so che ora ho il diritto di essere così\nHo il dispetto nel mio DNA\nMa ho scritto finché le ruote non si staccano, sto lavorando senza mai stancarmi, ayy\nÈ il momento che aspettavate tutti\nCome la California che spera che diluvi\nIn quella siccità, avete tutti pregato per\nLa mia caduta da 8 Mile a Southpaw\nAncora lo stesso Marshall, quel fuorilegge\nDel quale dicono che come scrittore potrebbe essere caduto\nSono tornato su quel toro come i cowboy\n\n[Chorus: Joyner Lucas & Eminem]\nDovete spostarvi, dovete spostarvi, dovete spostarvi\nFatemi spazio, fatemi spazio, datemi il rispetto\nSalto fuori dalla coupe, salto fuori dalla coupe, salto fuori e sparo\nDovete spostarvi, dovete spostarvi, datemi il rispetto", "image": "https://images.genius.com/b379811c1415017b9f3e3a71b9d26060.400x400x1.jpg"}], "artist": "Eminem"}