{"songs": [{"title": "No One’s Iller", "album": "Slim Shady EP", "year": "1997-12-06", "lyrics": "[Intro/hook: Bizarre]\nYeah… ha ha ha (BANG!)\nYeah, Bizarre Kid comin' at you\nEminem and Fuzz and Mr. Swifty, ha ha\nNo one's iller than me (what?)\nNo one, no one is iller than me\nNo one is iller than me\nIt's Mr. Swifty from the 313\n\n[Verse 1: Swifty McVay]\nI make rappers wanna turn into singers\nI keep hoes lickin' they fingers\nBring this competition and face this meaning\nGot your whole crew doin' subpoenas\nHell nah, you ain't seen a crew, genius\nMurder whoever's between us, pack your heaters\nKeep it close, you can't beat us\nWhile your whole crew treat us like G's, you best believe this\nI done made quadriplegics outta these non-rappin' rejects\nWhile the whole world ejects your tape\nIt ain't no secret that your shit sounds fake\nYou can't stop it, my mind state\nMakes it too late for cops in tryin' to stop the crime rate\nI'm like toothaches: I'm painful to rappers\nThen you can tell from these shells\nHow I gotta bend 'em like root canals\nI erase all trails, somethin' farther from gettin' bail\nMakes you wanna kill an emcee yourself, you might as well\nBe within a 25 to life sentence, on linking trials\nHorrified, and keep on frontin', repentin' and lose they bowels\nEverything is foul when Swift's around, vacate now\nNiggas dumb enough to try to front and escape, how?\nI'm gonna take this 'gnac and drink it straight wild\nNiggas steady fallin' in my face like milk crates – BLAAAOW!\nIt's Swifty from the 313\nLike I said, no one is iller than me, unnhh\n\n[Verse 2: Bizarre]\nMe and Eminem and Mike, drivin' down Van Dyke\nGet my dick sucked late at night by a fuckin' transvestite\nStill on probation for stranglin' my boy Jason\nShould be takin' my medication, it's 9 to 10 I'm facin'\nLast week this old man I had to blast\n‘Cause he tried to help me out when my car was out of gas\nRipped this old lady, hung her neck by a hook\nDidn't realize it was my grandmother 'til I checked her pocketbook\nFuckin' with the white boys got me back on crack\nBetter explain where the hell your TV's and VCR's is at\nI done lost 100 pounds, I ain't been eatin' like I should\nThis wounded dog in the street is sure lookin' good\nRob this little boy in his fuckin' paper route\nThrowin' bombs at day care centers and yell: \"Everybody get out!\"\nMy girl beat my ass and shot me in the back with a 2-piece\n‘Cause she found out I was havin' an affair\nWith her 10-year-old niece\n\n[Hook: Bizarre]\nNo one, no one's iller than me\nIt's Bizarre Kid straight from the 313\nNo one, no one is iller than me\nIt's Bizarre Kid straight from the 313\n\n[Verse 3: Eminem]\nNobody better test me, ‘cause I don't wanna get messy\nEspecially when I step inside this bitch, dipped freshly\nNew Lugz, give the crew hugs, guzzle two mugs\nBefore I do drugs that make me throw up like flu bugs\nTrue thugs, rugged unshaven messy scrubs\nWhippin' 40-bottles like the fuckin' Pepsi clubs\nDown a fifth, crack open a six\nI'm on my seventh 8-ball, now I gotta take a piss\nI'm hollerin' at these hoes that got boyfriends\nWho gives a fuck who they was?\nI'm always takin' someone else's girl like Cool J does\nThey probably don't be packin' anyways — do they, Fuzz?\nWe walked up, stomped they asses and blew they buzz\nMics get sandblasted, stab your abdomen\nWith a hand-crafted pocketknife and spill your antacid\nSprayed your motherfuckin' crib up when I ran past it\nFuckin' felon, headed to Hell in a handbasket\nTalkin' shit'll get you, your girl and your man blasted\nKidnapped and slapped in a van, wrapped in Saran plastic\nGet your damn ass kicked\nBy these fantastic furious four motherfuckers\nFlashin' in front of your face without the Grandmasters\nSlim Shady, ain't nobody iller than me\n\n[Verse 4: Fuzz Scoota]\nI run shit like an ass with legs\nMassive lead to leave your cabbage red\nSimilar to your ass in a casket dead\nDrastic spread of acid heads\nCome to abort you like a bastard egg\nThat trash you said got you standin' on plastic legs\nAsk the feds if I'm past the edge\nRockin' the most classic threads, flashin' bread\nRoll down the window: \"Bitch, you got some fantastic legs!\"\nYou can get 'til that ass get red\nYou can get 'til that ass get red\nBizarre, you get him and him\nSwift, you get him and him, I'll get him and him\nLeave the other two for my nigga Eminem\nNever writer's block, I block writers\nMy block's tighter, ante up and get your top fighters\nGot fired for jumpin' the counter with a mop stick\nSome bitch ran up screamin', \"Get the cops, quick!\"\nAnd got drop kicked, now she screamin', \"Stop it!\"\nGot clips to stop shit, rock shit and grab this hot shit\nWherever you shop, bitch, Fuzz Scoota '97 crop pick\nSick of y'all niggas lookin' at me like I got tits\nI shoot a rocket through your optic\nYou niggas still don't know the top pick\nI got bricks, lose my foot in your ass\nAnd have you shittin' socks, bitch\nP Rock shit, leave your fuckin' knot split\nGrab the green from Al by showin' him hot grits\n(No one) — ain't nobody iller than me\n\n[Hook: Bizzare]\nIt's the Mr. Fuzzy from the 313\nNo one, no one is iller than me\nIt's Eminem and Swift from the 313\nNo one, no one is iller than me\nIt's Fuzz and Buzz-arre from the 313\n\n[Outro: Bizzare]\nYou have now witnessed four ill emcees\nFrom the home of potholes and trash\nWe'll lyrically blast", "image": "https://images.genius.com/672f82b07e927570becdf0e67c91fc5e.1000x1000x1.png"}], "artist": "Eminem"}