{"songs": [{"title": "California Love (Remix)", "album": "All Eyez on Me", "year": "1996-02-13", "lyrics": "[Intro: Roger Troutman]\nCalifornia love!\n\n[Hook: Roger Troutman]\nCalifornia, knows how to party\nCalifornia, knows how to party\nIn the city of L.A\nIn the city of good ol' Watts\nIn the city, the city of Compton\nWe keep it rocking! We keep it rocking!\n\n[Verse 1: Dr. Dre]\nNow let me welcome everybody to the wild, wild west\nA state that's untouchable like Eliot Ness\nThe track hits ya eardrum like a slug to ya chest\nPack a vest for your Jimmy in the city of sex\nWe in that sunshine state where the bomb ass hemp be\nThe state where ya never find a dance floor empty\nAnd pimps be on a mission for them greens\nLean mean money-making-machines serving fiends\nI been in the game for ten years making rap tunes\nEver since honeys was wearing Sassoon\nNow it's '95 and they clock me and watch me\nDiamonds shining looking like I robbed Liberace\nIt's all good, from Diego to the Bay\nYour city is the bomb if your city making pay\nThrow up a finger if ya feel the same way\nDre putting it down for Californ-I-A\n\n[Hook: Roger Troutman]\nCalifornia, knows how to party\nCalifornia (West Coast), knows how to party (yes, they do!)\nIn the city of L.A. (city of L.A)\nIn the city of good ol' Watts (good ol' Watts)\nIn the city, the city of Compton (city of Compton)\nWe keep it rocking (keep it rocking) We keep it rocking!\n\n[Interlude: Roger Troutman]\nShake it shake it baby, shake, shake it shake it baby\nShake it shake it mama, shake it Cali\nShake, shake it baby\nShake, shake it shake, shake it, shake it Cali\n\n[Verse 2: 2Pac]\nOut on bail fresh outta jail, California dreaming\nSoon as I stepped on the scene, I'm hearing hoochies screaming\nFiending for money and alcohol\nThe life of a westside playa where cowards die and the strong ball\nOnly in Cali where we riot not rally to live and die\nIn L.A. we wearing Chucks not Ballies (that's right)\nDressed in Locs and khaki suits and ride is what we do\nFlossing but have caution we collide with other crews\nFamous cause we program\nWorldwide et 'em recognize from Long Beach to Rosecrans\nBumping and grinding like a slow jam, it's west side\nSo you know the row won't bow down to no man\nSay what you say, but give me that bomb beat from Dre\nLet me serenade the streets of L.A\nFrom Oakland to Sacktown, the Bay Area and back down\nCali is where they put they mack down, give me love!\n\n[Hook: Roger Troutman]\nCalifornia, knows how to party\nCalifornia, knows how to party (c'mon baby)\nIn the city of L.A. (South Central)\nIn the city of good ol' Watts (Uh, that's right)\nIn the city, the city of Compton\nWe keep it rocking (keep it rocking) We keep it rocking!\n(Ye', ye' Now make it shake)\n\n[Interlude: Roger Troutman]\nShake it shake it baby, shake, shake it shake it baby\nShake it shake it mama, shake it Cali (Shake it, Cali)\nShake, shake it baby\nShake, shake it shake, shake it mama, shake it Cali (Uh, uh, West Coast)\n\n[Outro: Dr. Dre & 2Pac]\nUh, yeah, uh, long beach in the house, uh yeah\nOaktown, Oakland definitely in the house\nFrisco, Frisco\nHey, you know LA is up in this\nPasadena, where you at\nYeah, Inglewood, Inglewood always up to no good\nEven Hollywood trying to get a piece baby\nSacramento, Sacramento where ya at? yeah\nThrow it up y'all, throw it up, throw it up! I can't see ya\nCalifornia love\nLet's show these fools how we do it on this on that west side\n'Cause you and I know it's the best side\nYea that's right, west coast we coast\nUh California love, California love\n\n[Outro: Roger Troutman]\nCalifornia, knows how to party\nCalifornia, knows how to party (where they at uh)\nIn the city of L.A. (South Central)\nIn the city of good ol' Watts (Yeah, yeah)\nIn the city, the city of Compton (In the city of Compton)\nWe keep 'em rocking, we keep 'em rocking!\nJust c'mon just shake it baby baby baby shake it mama shake it mama sha' Cali'\nRichter scale talking about a earthquake on the richter scale-la'\nCity of Compton, city of Compton where the girls shake their booty's\nShake it mama, shake it baby, shake shake it baby, shake shake it\nComputer-puter-puter-puter-puter-puter-puter, Joe", "image": "https://images.genius.com/c5460d748a580f6eb762585f967c9919.1000x1000x1.png"}], "artist": "2Pac"}