{"songs": [{"title": "Blink Blink", "album": null, "year": null, "lyrics": "[Intro: LL Cool J]\nYou see yo' this is a worldwide operation\nThis shit is official! It's not a game... yeah!\nWord up! Ai yo 'Deutschland' we up in this piece baby!\n\n[Verse 1: LL Cool J]\nI'ma snatch up your mama, bullet train\nNiggas talk gangsta shit but can't really bang\nCan't really murder with slang to swerve lane to lane\nFollow bustin' on motherfuckers just for discussin' my name\nHealy \"Bang bang\", hail to the motherfuckin' cows\nCome home an' city slicker dough\nIn italiano bravissimo\nYou know I come back like the crow\n\"Blink Blink\" that's the sound of the man who came to murder shit\nFor three thirds of this\nYou the mad peasant\nAs I sing ya' to the essence\nAnd use a flame thrower to transmit the message\nTight I will recite from day to night\nHard shit like fuckin' up a father with a pipe\nCrazy all my life swazy with ya wife\nTony Montana with my fingers in your dyke\nLike my platinum triple\nMy honeys quadruple\nA room full of dangerous minds with no scruple\nWatch them subliminal transfliction to criminals\nBetter show respect! You keep your game original\nFuck face! You ignorant idiot\nWhen it comes to dough wanna quick an expidient\nNever underestimate my greediness\nQuick to murder shit is switched to a alias\n\n[Chorus](LL Cool J) {Spax}\n\"Blink Blink\" that's the sound of the man who came to murder shit\n{Murdaa!}\n\"Blink Blink\" that's the sound of the man who came to murder shit\n{Murdaa!}\n\"Blink Blink\" that's the sound of the man who came to murder shit\n{Murdaa!}\n\"Blink Blink\" that's the sound of the man who came to murder shit\n{Murdaa!}\n\n[Verse 2: Spax]\nIch hör' nur RaRa und BlahBlah\nKomm gar nicht klar - klar\nDas is'n Drama, dass jeder redet und voll keinen Plan hat\nNaDa - das is nicht mein Ding muss euch was beibringen\nDer Schein stinkt, bin kein Feigling is' nicht mein Karma\nIch 'spit' 'Raps' auf 'Tracks' wie auf's Plattenbiz\nUnd meine Scheiße trifft im Rampenlicht und auch da, wo Schatten ist\nDie Welt ist 'Talkshow-Shit', für mich voll Horrortrip\nUnd manchmal weiß ich nicht wohin, warum, womit\nAber es ist so 'for real'\nJeder kann's spüren und fühlen\nDass wir nur misstrauen, nicht träumen und uns nichts mehr berührt\nIch schieb schon Paras, bei den Psychos vor meiner Tür\nHör' den Taxifahrer nebenan mit Waffen trainieren\n'ClickClack'\nBleib' auf Distanz aus Angst\nWeil diese Welt aus Geldgier mit dem Teufel tanzt\nHab' mich in meinem Hirn verschanzt und schieß' zurück\nMeine Munition ist meine Meinung, die euch tief bedrückt\nHabe Argusaugen, die alles beäugen da draußen\nDie alles sehen und mitnehmen, doch nicht alles glauben\nIch halte Sachen am Laufen bewegen zum Überleben\nWeil das Fadenkreuz das Ziel nicht erfasst\nGeht jeder Schuss daneben\nMörder gibt's überall, Zerstörer gibt's überall\nKlone und Kopien machen Alarm, getarnt als Original\nWir kochen alle mit Wasser und atmen die gleiche Luft\nDer Unterschied ist nur, der eine macht, der andere versucht\n\n[Chorus]\n(Samples)\n\n\"Gotta stay on some strong shit\"\n\"You don't like it so I guess we gotta conflict\"\n\"So you wanna be hardcore\"\n\"Stand up like a man\", \"You afraid?\"\n\"The track flower\"\n\"Duplicate... rap cloner\"\n\"You disrespect\"\n\"You get the tech\"\n\n[Chorus]", "image": "https://images.genius.com/9e00cf56336ec8915e2fa3b2b2e7502d.377x377x1.jpg"}], "artist": "LL Cool J"}