{"songs": [{"title": "Just to Get By", "album": "The Warm Up", "year": "2009-06-15", "lyrics": "[Intro]\n\"That was the warm up, that was the warm up, baby\nAight, Elite, for real, one take, dawg, and I'm up outta here\nOne, yup, yeah.\"\n\n[Verse]\nLord, please forgive me for my sinning\nI ain’t saying that I’m finished, but I’m praying in advance\nCause the way her eyes glance like they playing in my pants\nYeah, ball game\nI swear the hoes wasn’t in my plans when a nigga took the chance and came to the big city\nMy beat machine the only fucking thing I had with me\nLike Bobby had Whitney, we was cooking up crack\nBut them fifteen credits had a nigga off track\nPicture that, best rapper since Lil Wayne in classes\nThe best bachelor since Bruce Wayne with his bachelor’s\nBut mastered this rap shit\nYou hear the words coming from my lips bastards\nI never crack, I got that Chapstick\nI practiced till that shit made perfect and served it to the people on a silver platter\nNow where’s the ladder?\nCause either you gonna whine or you climb; I chose the latter\nKnow you haters is pissed, hold your bladder though\n‘Fore you get tossed like a forward lateral\nWe never tattle, let God handle that\nOr let the mob handle that\nNo Soprano, half black, half white; I’m a piano\nI’m an animal, my video on Discovery Channel\nI’m a beast when my shit hits the streets, these niggas cease to exist\nLike a beach in a tsunami,  you'll find me in the ‘Ville\nIn the state of NC\nBitch, if I ain’t back home, I’m up in NYC\n‘Bout that money prob-ly like a fucking robbery\nBut I ain’t jacking\nI’m chasing dreams sort of like jeans, boy, I ain’t slacking\nI’m chasing dreams sort of like jeans, boy, I ain’t slacking\nHey, take a hard look at my drive nigga, no hacking on my shit\nI’m straight smacking niggas, straight tagging niggas\nYo, I freestyle and fuck you niggas, ya’ll be wilding and I’m out", "image": "https://images.rapgenius.com/bbedb619df51d7c751c886dc70dfc60c.1000x1000x1.jpg"}], "artist": "J. Cole"}