{"songs": [{"title": "Grew Up A Screw Up", "album": "Release Therapy", "year": null, "lyrics": "[Hook: Notorious B.I.G. sample]\n\"I grew up a fucking screw-up\nGot introduced to the game, to the game then fucking blew up\"\n\n[Intro: Ludacris speaking over B.I.G. sample repeated]\nYeah! Dedicated to all my hustlers that's a product of they environment\nWhether getting money legally or ILLEGALLY\nWe gotta do what we gotta do to survive man!\nYeah! Grew up a screw up baby\nGot introduced to the game, I ain't took a breath yet\nLet's go!\n\n[Ludacris]\nEver since I was an embryo, waiting to shape up and ship out\nSomething in my brain said, \"Wake up and kick out!\"\nRoberta and Wayne stayed up and flipped out\nCause when I came I was draped up and dripped out\nSnip the umbilical, spit the government chip out\nPeace up, A-Town down and then I dipped out\nAnd oh my gosh, the Osh Kosh was picked out\nI slipped in, even my baby stroller was tricked out\nSomebody get him, the little nigga's out of control\nPut a little bit of rum in my bottle I'll dream about diamonds and gold\nGold gold, to grow from an infant to toddler was effervescent\nThe essence of adolescence got my body feeling freshen\nFreshing freshing, and it was a blessing to rhyme and start rapping\nI was the best in my section with flows hard than erections\nStill the best but now I'm grown with more range than a Texan\nAnd I'm a heavyweight you niggas is lighter than my complexion\n\n[Hook]\n\n[Young Jeezy over the Hook]\nAyyyy\nY'all already know what it is\nI'mma tell you nigga\nC.T., know what it is, 'bout 17-5\n\n[Young Jeezy]\nHomey fronted me a zip, shit I made it a bird\nThat's seventeen and a half, all I need is the word\nSay the, ice is cool but them pots is hot\nYou better cook slow but that money come fast\nI got what you need I hope you brought all the cash\nYou know the kid pimping all over the world\nA hundred carats got me all over your girl\nYEAH, five bricks and my Gucci duffle bag\nA corporate thug, I run with a Playaz Circle\nI got a Field Mob that'll Disturb your Peace\nBlowing Sean Jay, all we do is smoke\nFinish counting my bread and I was getting some head\nWhat's up?\n\n[Hook]\n\n[Ludacris]\nI'mma be all the way real with this, look\nWhen I came into the game they ain't do nothing but doubt me\nNow the whole game's changed and it ain't nothing without me\nPicking up my sloppy seconds as they reach for the crown\nOnly reason you on that song is cause I turned that down\nI went from Hot Wheels to big wheels, Hyundais to Bentleys\nAnd five course meals, no more Popeye's and Blimpie's\nFrom alright to handsome, from one room to mansions\nFrom hanging on the block to throwing parties in the Hamptons\nFrom, broke as a joke to rich as a bitch, I bought a\nPlane and a boat and six other whips, no MARTA\nFrom dice on the curb to stacking up chips, but harder\nFrom birds on my nerves to chicks on my DICK! Guard your\nWomen dawg I went from ashy to classy\nWent from a, kiss on the cheek to doing the nasty\nReach your hand up in the air and you can play with the stars\nIt's not the hand that you're dealt but how you're playing your cards\nBoy!\n\n[Hook]", "image": "https://images.genius.com/57825a3687491fdf0e3c4c58b1b7aee5.1000x1000x1.jpg"}], "artist": "Ludacris"}