{"songs": [{"title": "Last of a Dying Breed (Original Version)", "album": "Theater of the Mind", "year": "2008-10-24", "lyrics": "[Verse 1: Ludacris]\nLuda!\nI done killed so many niggas in the booth I sell rappers on eBay\nSoldiers couldn't cause more disaster on D-Day\nHaters better cover up they jaw like Freeway\nCause every hit record's been instant like replays\nHold the line, I got yo' momma on 3-way\nTell her Luda's got more records than the DJ\nTell her she should blow me like candles on yo' B-day\nCause I've signed more lines than she's passed on the freeway\nMore checks than you ever could imagine\nMore wood up in my whip than in a forest full of cabins\nAnd yes I stay high on that purple like Aladdin\nAnd women say I talk mo' game than John Madden\nHow'd it happen, how'd they let me in the booth?\nHow they let these rappers lie, how DARE I tell the truth!\nI'm the truth, and these other boys phony\nIt's a movie so act like you know me\n\n[Hook One: Ludacris] {w/ scratches by DJ Jaycee}\nI'm a lyricist to the death, so I got what you need\nLudacris, I'm the last of a dyin breed\nAnd we almost extinct, so I'm sayin it loud\nSay it with me {*\"MC means move the crowd\" - Rakim*}\nSay it with me {*\"MC means move the crowd\" - Rakim*}\nSay it with me! {*\"MC means move the crowd\" - Rakim*}\n{*scratches: \"M-MC means move, means move... m-move... move the crowd\"*}\n\n[Verse 2: Lil Wayne]\nI got it baby!\nAnd I'm an MC, I move the crowd like Moses\nLike the Red Sea I wear red like roses\nGo against me and you'll be dead like roses\nSpittin at your head full of bread like toasters\nNever had a holster, I keep it on my lap\nAnd hip-hop ain't dead, it just had a heart attack\nBut you see I keep it pumpin, yeah I got that heart back\nSo just call me Little Carter, or Little Cardiac\nPrecious like an artifact, valuable like a quarterback\nHannibal like they call me Jack, throwback like a Starter hat\nNow how did he thought of that? I mean how did he think of that?\nI mean how did I think of that? Now like a rental, bring it back\nI mean how did I think of that? I surprise myself sometimes\nSomeone should throw me a surprise party for every rhyme\nEvery time I do it, I do it dirty like swine\nFor the dirty and fine, hip-hop, I'm alive!\n\n[Hook Two: Lil Wayne, Ludacris] {w/ scratches by DJ Jaycee}\n[W] I'm a lyricist to the death and I got what you need\n[W] Weezy F, the last of a dyin breed\n[W] And we almost extinct, so I'm sayin it loud\n[L] Say it with me {*\"MC means move the crowd\" - Rakim*}\n[L] Say it with me {*\"MC means move the crowd\" - Rakim*}\n[L] Say it with me! {*\"MC means move the crowd\" - Rakim*}\n{*scratches: \"M-MC means move, means move... m-move... move the crowd\"*}\n\n[Verse 3: Ludacris]\nThis is music Musclemania, my verse is on steroids\nPrivate planes, I'm on the jet, son, like Elroy\nFlying through the sky at amazing speeds\nWe on that Superman kush or that amazing weed\nThe new Bentley came out, my team said, \"Luda, get it!\"\n20 thou' says that I'm the only nigga wit it!\nNew Era on yo' brain like a A-town fitted\nAnd I'm not E-40 but I'm so Sick Wid It\nThat my flow got the flu, hoes I got a few\nBut I'm stingy with the dough, I'm like \"No not for you!\"\nWhat the fuck was you thinkin, off what I'm thinkin\nMe and Wayne on that lean, what the FUCK was you drinkin?\nStinkin like a dead body off in the woods\nSo I snatched her like a weave comin off in the hood\nAnd if you down for no bad, then we up to no good\nAnd it's important that you make it understood\n\n[Hook One]", "image": "https://images.genius.com/abff9ac1df466053c5fe1b6b3c92056f.1000x1000x1.jpg"}], "artist": "Ludacris"}