{"songs": [{"title": "Mr. Scarface: Part III the Final Chapter", "album": "The World is Yours", "year": "1993-08-17", "lyrics": "(All I have in this world)\n--] Tony 'Scarface' Montana\n[ continues through intro ]\n\nHey\nShit\nYeah nigga, that's\nThat - that - that\nThis - this is some - ehm\nWhat we gon' call this one here?\nFuck it\nLet's call it - ehm\nSome - some\nSome old school Scarface freestylin\nYouknowmsayin?\nYeah\n\nAaaaah shit!\nI'm finna freestyle in this bitch\nHe-yeah\nHuh youknowmsayin?\nCheck it out\n\n[ VERSE 1 ]\nI started small time, dope game, cocaine\nPushin rocks on the block, I'm never broke, mayn\nBut now I'm up against some mo' shit\nBecause the five-o's done jumped in my face with some ho shit\nTried to mix a nigga up in a homicide\nSaid I shot a muthafucka in his mama's ride\nI ain't the nigga in the trench coat\nI don't push rocks on the block, I deal the big dope\nI ain't the nigga on the mic that done said he quit\nBut I be damned if I get popped for some petty shit\nThat's why I move the real chickens\nSo if I'm goin down, I'm comin home on a meal ticket\nCause in this game you can't bar shit\nDo your dirt on the cool, so they can't say they saw shit\nSo when them muthafuckas step up with that he-say\nYou can tell em hoes to hit the freeway\nCause I ain't touchin shit with my own hands\nI leave the dirt to be done by the next man\nAnd count my money when they push it off\nI wonder if the dope game is still bein good to y'all\nCause in the past four years, yo\nI done clocked more cash sellin dope than them white folks\nThat's the reason why they upset\nAnd always tryin to mix a nigga up in some fuck shit\nBut I'm a killer comin atcha\nMr. Scarface Part III, nigga, The Final Chapter\n\nHe-he-he\nJust freestylin in the studio, though\n\nWhere is Scarface?\nWhere is Scarface?\n(Here I am\nHere I am)\nHow much do you make, Sir?\n(I don't -\nMan, what the fuck is you talkin bout how much I make?!)\nHa-ha-ha..\n(Fuck you!)\n\n[ VERSE 2 ]\nI'm in the South Park, peepin out the territory\nFinna set up shop just like in every story\nSo I'm rentin out the backside\nAnd let them niggas do they work, and me, I'm kickin back, right?\nAnd layin low in the next section\nGot a fully automatic M-11 for my protection\nEverything is goin smooth as planned\nI gots to try to fool the man\nCause if I'm caught, I'm doin 10 flat\nSo I'm gettin it while the gettin's good, nigga, fuck that\nCause if I fall short, nigga, then I'm ass out\nAnd then we'll see what the judge try to pass out\nI see some niggas we competin with\nIt's goin down tonight in the village, and I can see this shit\nSo I'm on the telephone callin up the squad\n\"Get your shit together, nigga, we finna mob\"\nBefore I hung up the phone, niggas was lettin loose\nI grabbed my shit and tried to find my bullet-proof\nBut fuck it, niggas, ain't goin for the chit-chat\nThey startin off with a headshot\nSo if I gotta die, then I gotta die, nigga\nAnd when I fall on my ass, don't ask me why, nigga\nIt was just my time and the man came to get me\nFuck it - plus a bullet hit me\nA straight niggaroe subtractor\nMr. Scarface Part III, muthafucka, The Final Chapter\n\nThe final chapter for real\n(All I have in this world..)\nYep\nHe-he\nI gotta - ehm\nShit, I guess I better talk about a broad then, huh?\nBefore I close this muthafucka off, right?\nCheck it out\n\n[ VERSE 3 ]\nLater on, all alone, sat around the house layin low\nWaitin for these niggas to jump so I can buck a ho\nAnd just like I expected\nA bitch came by in a gee wantin to get naked\nNow shit's gettin hectic\nThe situation's lookin grim, so yo, I gots to check it\nClean those traps, all the other shit\nI'm fuckin one ho, and in comes another bitch\nSo now I'm jackbonin two hoes\nWho's the nigga in the Kamurshol? Fuck, nigga, who knows?\nShe musta knew the bitch that I was fuckin with\nAnd plus I'm strapped and she was suckin dick\nUp and down with a smooth stroke\nTakin 9 inches of this dick like a deep throat\nThe other bitch was involved in masturbation\nOh shit - now I'm ejaculatin\nI let loose and they was fightin for the white shit\nI got a rubber tryin to make my pipe fit\nI finally made the cock crack\nThe bitch pulled a .330 and shoved it up my back\nThen some niggas came out with a chainsaw\nAnd tried to hack my muthafuckin brains off\nThese bitches set me up, y'all\nPussy - a nigga's quickest downfall\nI couldn't do shit except take it like a man\nBut if I live, it's on again\nBut I wanted a quick piece\nSo I put down my piece and end up put down, deceased\nShe put the rifle to my muthafuckin head\nMr. Scarface is - naw, fuck that shit..\n\nAh-ha-ha\nYouknowmsayin?\nPunch the beat in", "image": "https://images.genius.com/2c9d70007eb3a5b42d898b73f3ce76f0.936x936x1.jpg"}], "artist": "Scarface"}