{"songs": [{"title": "Buried in the streets", "album": null, "year": "2015-09-29", "lyrics": "(Intro)\nCan you smoke?\nNever swim against the current\nAnd they say the tide is rising\nUh, these niggas drownin’ to death\nWhere the lifeguards? We on the boat\nLet these pussies know they got a rope\nOr they want ya boy that threw a rope\nAh!\n\n(Verse 1)\nSuccessful nigga, pants hangin’ off my ass\nKing of diamonds, boy you better go and pay yo tax\nStrong arm, robberies, but neva take advice\nNot the type of brother that’ll read a book at night\nHe a fool, ain't he? Holla \"Where that tool at?\"\nHe-a move that, pocket full of food stamps\nNiggas pray to see they seeds in the Ivy Leagues\nBut all I see is young teens on a Rikers team\nNiggas throw a molly tryna get the lottery\nI know she fuckin’ homie, shawty, don't you lie to me\nYou gon’ fall in and outta love a hundred times\nLook at me, get yo money like I'm gettin' mine\nHalf these niggas jealous of that spot you in\nExercise the same muscle you know got you in\nCaught him wit a block, my nigga had to plead a Ten\nStay alive through my rhymes until we meet again\n\n(Verse 2)\nReminiscing on railings on my own, still jaded\nRest in peace a real nigga, we all real elated\nIt done been a couple years and it’s still raining\nEveryday the sun shine, I know you still reigning\nSuge got up on his shackles And that nigga fainted\n2Pac triggerman, somewhere on his knees praying\nNow it’s time for certain things to come to light\nDavid Kenneth testifies against Mr. Knight\nHouse cost 6, another 2 to paint it\nPrayin' one day all my haters maybe get acquainted\nNo longer in the beef, now I'm on to Bison\nEvander Holyfield, swear I really want to write him\nTo ask him how it feels, maybe vice-versa\nTo know a nigga, bought his crib with a nice verse\nHundred rooms all alone, still blowin’ dro\nBlack bottle, in my robe, do this for my WOES", "image": "https://images.genius.com/3dce21029cdd8aab73eb473e015807d5.1000x1000x1.jpg"}], "artist": "Rick Ross"}