{"songs": [{"title": "Breaker 1/9", "album": "Can I Borrow a Dollar?", "year": "1993-01-12", "lyrics": "A weeby weeby wobble gobble gobble DO the turkey\nLord have mercy, mercy mercy me\nYou see I'm tryin to get the punani\nBut you just wanna rock me, ah-eh-eh, ah-eh-eh\nYou see I'm tryin to get the punani\nBut you just wanna rock me, oooh, check it\nSo get your rattle rattle thunder clatter boom boom boom\nBecause I gotta gotta get some, el-bow, room\nSo I can Bang-kok, better yet, knock Italy\nBut raindrops keep fallin on my couch, try to sit with me\nTamperin up my program, so I play another slow jam\nIt's not an ancient Chinese secret, you should know man\nBut you insist on stay and playin Genesis\nI gotta put an end to this, balderdash, EEE haul ass\nAnd don't come knockin my door, with the cockle-doodle-doo\nI'm talkin the his and his and hers, Three's Company too\nSo step to the step to the rear\nAnd don't come back now, hear?\n\nAhh to the break y'all (break y'all, yeah)\nAhh to the break y'all (break y'all, made it!)\nTo the break y'all (break y'all, NAHH!)\nTo the break y'all (break y'all break, BREAK!)\n\nThe CB's, the CB's, they'rrrrre here!\nI'm checkin my mirror from the rear, blocks are closer than they appear\nThe time is near for you to drop your beer and get your nuts again\nBut ain't no haps (UH-UH) your dick isn't there\nYou're thinkin that, \"Oops, I made a mistake\"\nYou say, \"Fuck Nell Carter, c'mon Jimmy, give me a break\"\nYou made a mistake on the first take\nTryin to break a leg for take two\nYou shoulda ate your Wheaties\nAnd Petey mighta made a breakthrough\nYou say to hope that things might bloom, so you assume position\nWishin he would listen, so you start to kissin\nIt's alive, and up goes, and up goes you're adrenaline\nYou aimed, you fired, THERE YOU GO, limp figures\nSo you take ? and then play the role of friend and talk\nTry to tell her it's her fault, when Jack your Been wouldn't Stalk\nBaby Bubba you's a goner, ahh, you's a goner\nIt's fucked up, when Your Dick Is Playin Tricks On Ya\nSo you pop fizz, what a relief, beef strokin'-off\nMy man, got your thing, in your hand, say, \"I I think I can!\"\nDamn this never happened before, yeah sure that's what they all say\nUh-oh you better get Maaco kid, cause old girl is salty\nWhat was sweet to eat, has now dried up and rotted\nIt's a pile of pew, pick up your glove and say, \"Yo I got it!\"\nHopin you won't drop you thought you had it made like ?Kay?\nWhat more could go wrong - you got the right one baby!\nUh-huh, let you tell it, everybody and their momma knows\nThat you came quick, quicker than a pizza, from Domino's\n\nTo the break y'all (break y'all, YEAH)\nTo the break y'all (break y'all, MAYBE)\nTo the break y'all (break y'all, NAHHH)\nTo the break y'all (break y'all, check it out)\n\nThe 1/9, the 1/9, the CB's, the break\nThe 1/9, the 1/9, the CB's, the break!\nThe 1/9, the 1/9, the CB's, the break!!\nBreak it up, break it up, break it up, BREAK DOWN!\n\nWalkin up and then down the strip\nLookin for some hip so I can skip\nI spotted this honeydip, and her friend tried to sell me a script\nThat they were in a rush to catch the bus, but that was the OLD Gus\nSo I'm gettin a bus, as I thrill at the disgust\nSince old girl was with this, I told her friend to kiss this\nAnd listen physical fitness use your brain and mind your business\nDippin from a distance, in an instance I got the digits\nAnd blew a kiss to her\n(THAT OLD STANK HOEEEE) was mad I didn't speak to her\nI hooked up with the one that looked NICE\nTook her mind, like an ICE\n'Til her friends gave her advice to think, twice\nBefore with me she slept, my rep was kinda ill\nThey told her to keep that booty still\nI been through more hoes than the pill\nStill I overcame cause I got game like a athlete (UHH)\nIn less than a half week, she was with it to do the nasty (BREAK)\nThe drawers dropped, the top off, and the boots was gettin knocked\nI heard the door unlock, it was her pop he was a cop\nSo I stopped dropped and rolled, so I wouldn't inhale a shell\nBroke like a fingernail, on my trail was the smell of tail\nBailed back around the flat, to wash off the smell of cat\nLike a belt, everything was strapped\n'til my homey asked, \"WASSUP WIT DAT?\"\nThe dat was like dis G, I told him I got busy\nThis was the spy who dissed me cause he told it like a sissy\nTHAT WAS FOUL, I went to him lost in the mind now it's a dead end\nThe little red Corvette that locked the door and I can't get in\nNo more no more no more and now I know and now I know\nDon't mess around with CB's, good buddie, ten-fo'\n\n(Ha hahh, yeahh, ahh break it..)", "image": "https://images.genius.com/32e49b44dcd4ab4511f0005c85cd0b11.640x640x1.jpg"}], "artist": "Common"}