{"songs": [{"title": "Regardless", "album": "Death is Certain", "year": "2004-02-24", "lyrics": "[Verse 1]\nMy arms are heavy, knees weak, palms are sweaty\nNiggas wanna see me gone already\nFrom this song on it's on, you about to be swept away\nYesterday is long gone\nI took some time to redefine my style\nI kept my cool, sun was behind the clouds\nYou lames can't put me in the same category as a rookie\nNope, my name ain't new\nRappers can't push me as high as I can\nPush myself, you not inspiring\nThe stolen spot is open, I chose to not listen\nAnd I don't even know what's hot or who dissin'\nOr who's consistent or who's nice or not\nWho's on top or whose wife is sniffin'\nOr who's meltin' soon to be failin'\nAll I know is the way the streets felt 'bout \"Boom\"\n\n[Chorus]\nRegardless, nigga pump yo brakes\nYa car is movin' fast, we will lump your face\nRegardless, me and Cash will come\nAnd take yo ass away far, nigga don't play\nRegardless, the M-I-C\nWe kickin' ass and takin' names, you can't ID\nRegardless, me and Tre is comin'\nOut to play wit you today, it's curtains\n\n[Verse 2]\nD-Elite! We comin' with the lighting and thunder\nUnder the rain, to pump it you need a jeep!\nYou need at least some speakers while ya glued to ya seat\nFrom cruisin', while I creep through ya system\nI'm gon' be heard as God is my word\nDeliverin' the kind of murder, KOCH don't deserve\nThe real will cop it\nEvery label in the world look out for me, I will kill yo roster\nI will shut this shit down\nAnd on top of that I could fuck yo bitch now\nIt's hard to believe that Columbia couldn't market me\nTo do numbers like D12 at least!\nI played myself for radio play\nI never dance, but the skill itself is a second chance\nI'm back with tools by me, start the beef\nI'm 'bout to part these streets like \"Bruce Almighty\"\n\n[Chorus]\nRegardless, nigga pump yo brakes\nYa car is movin' fast, we will lump your face\nRegardless, me and Cash will come\nAnd take yo ass away far, nigga don't play\nRegardless, the M-I-C\nWe kickin' ass and takin names, you can't ID\nRegardless, me and Tre is comin'\nOut to play wit you today, it's curtains", "image": "https://images.genius.com/2e15d971471dc5a14cf09f1d638b3456.1000x1000x1.jpg"}], "artist": "Royce da 5'9'’"}