{"songs": [{"title": "Throw Some D’s (Remix)", "album": "Freshmen Adjustment Vol. 3", "year": null, "lyrics": "(Intro)\nThis the remix\nI mean, I ain't really into rims and all that\nIf I'ma take, five, ten stacks of some D's it's gon' be a different kind of D's\nYou know what I'm saying? Hm?\n\n(Chorus 1)\nKanye's got stacks, ya'll already know that\nLouis that, Goucci this, just got a model chick\n(Throw some D's on that bitch!)\nJust got a stripper chick\n(Throw some D's on that bitch!)\nSomething feel different...\nCute little college chick, linin' up a scholarship\nJust got a school grant, spent that on some new tits\n(Throw some D's on that bitch!)\nAin't that a true bitch?\n(Throw some D's on that bitch!)\nLet me show you how to do this shit\n\n(Verse One)\nGet you a cute chick, face got potential\nWorking with her little hips, waist like a pencil\nKnow how niggas play you, but you know how 'Ye do\nSays she love Beyonce, let me upgrade you\nSpanish chick grab my chain, says \"is that He-Su's?\"\nIf I'm unfaithful, blame it on the Grey Goose\nAll my friends says implants is a selfish gift, they all up in\nShe ain't pregnant but about to have twins\nNow, is it real love, I need to ask Cupid\nShe real smart but her ass stupid\nAnd she gon' finish school and get all type of degrees\nBut I bet she never had them D's...\n\n(Chorus 2)\nKanye's got stacks, y'all already know that\nLouis that, Goucci this, just got a model chick\n(Throw some D's on that bitch!)\nJust got a stripper chick\n(Throw some D's on that bitch!)\nMan, that's a prerequisite\nCute chick living good, down here in Hollywood\nUpcoming actress, but she got a flat chest\n(Throw some D's on that bitch!)\nThat'll give her access\n(Throw some D's on that bitch!)\nLet me show you what happened\n\n(Verse Two)\nWalking down Melrose, spot where they sell clothes\nThat chick know she bad, tell by the Chloe bag\nShe ain't no hoodrat, she ain't gotta prove that\nI peep the McCartney's, Stella got her groove back\nHold on, lemme ask you, why you spend your money on that shallow shit?\nWhy don't you buy some bigger tits?\nSomething that'll last you\nI couldn't tell you if Halle's really real\nBut I'ma let you know soon as I get a chance to feel\nI don't need no hands to know Lindsey Lohan\nShe on the same program as Britney, is you wit' me?\nThat's why I respect Alicia Keys\nShe say f**k getting them D's\nI'ma just ride out with these\n\n(Chorus 2)", "image": "https://images.genius.com/e00085bf087c8e35e4d55ae683cbbcd7.500x500x1.jpg"}], "artist": "Kanye West"}