{"songs": [{"title": "Real Rich", "album": "Rolling Papers 2", "year": "2018-05-04", "lyrics": "[Intro: Gucci Mane]\nGuwop! Wiz!\nTaylor Gang, 1-0-1-7\n\n[Verse 1: Wiz Khalifa]\nRidin' around blowin' so much dope but I'm always handlin' business\nWay too high don't pick up my phone, if I do, I'm like \"Who is this?\"\nAin't got time for a girlfriend, telling that bitch I ain't got no feelings\nYoung nigga straight from the bottom, now my car ain't got no ceiling\nYoung nigga stackin' up millions, y'all niggas actin' like children\nOuu, nigga couldn't used to get in, now I'm ownin' the building\nBrought the bitch to my crib, said she felt like she went on a field trip\nNigga like me gon' always stack, when I'm older I'm probably gon' still get\n\n[Chorus: Wiz Khalifa]\nBaby, I'm a rich-ass nigga, never said I was gon' be easy to deal with\nBut I be on some real shit, but I be on some real shit\nBaby, I'm a rich-ass nigga, never said I was gon' be easy to deal with\nBut I be on some real shit, but I be on some real shit\n\n[Verse 2: Gucci Mane]\nI'm a country-ass Beverly hill-billy\nEat it up bitch, I'ma meal ticket\nFlush it down concert like fuck a ticket\nRich-ass, crazy-ass, super picky\nWant a rich dick say I'm bucket listed\nI don't fuck broke, I got a boujee dick\nFirst round draft, I'm a lottery pick\nPepped up, East Atlanta vitamins shit\nSolitaires glarin', big stone like Sharon\nSuperstar, Ed Sheeran, bitches love my earrings\nKnow she fucked wit him, I still fucked her\nFuck that nigga, he a real sucka\nIt's the Wiz and the Wizop\nI baguetted my watch wit' real boogers\n\n[Chorus: Wiz Khalifa]\nBaby, I'm a rich-ass nigga, never said I was gon' be easy to deal with\nBut I be on some real shit, but I be on some real shit\nBaby, I'm a rich-ass nigga, never said I was gon' be easy to deal with\nBut I be on some real shit, but I be on some real shit", "image": "https://images.genius.com/0bb3245ccc1788f6ee25aa8515eec590.355x355x1.jpg"}], "artist": "Wiz Khalifa"}