{"songs": [{"title": "Gunfiyah", "album": null, "year": "2017-07-09", "lyrics": "[Verse 1]\nNow will there ever be a day that my niggas won't ride for me? For me?\nNah, nah, nah\nAnd will there ever be a day that your bitch won't slide with me? Homie?\nNah, nah, nah\nAnd will it ever be a day that your hands ain't up when a nigga on stage\nI been rollin' up haze in the studio for days just to work for a wage\nNow I'm on, fuckin' paid in this mothafucka\nWho got a hit just like this? And got heart and rich like this?\nNever failed, 20 years and he still got grip like this\nAnd got kids with a super hot bitch like this\nYou spendin' time tryna get like this\nI wrote a script like this, I'm on some shit like\nI'm at home on the track, nigga, this my shit\nTry to spit my clip, you might get hit and divided\n\n[Refrain]\nUh, kill shit, I'ma talk about it\nLaid out with the chalk around him\nCame back as kings, came back with rings\nWhat if we fall? I never thought about it, nigga\n\n[Chorus]\nGunfire, gunfire, nah, nah, nah\nRun at yah, run at yah, nah, nah, nah\nWe come for yah, come for yah, nah, nah, nah\nSet fire to my enemies\nFuck a rasclaat, or a enemy\nMe got a few chains worth a hundred ki's\nThem say they waan romp, me say, \"Pussy, please\"\nPussy boy never worried me\nMy clips up on the streets\nNuh call the police pon me\nA hundred keys in these streets\nPussy boy, no wan romp wit me\n\n[Refrain]\nUh, kill shit, I'ma talk about it\nLaid it out with the chalk around him\nCame back as kings, came back with rings\nWhat if we fall? I never thought about it, nigga\n\n[Verse 2]\nHow you spell C.E.O.? D.R.E\nWhat a nigga dream he could try to be\nUh, even though I'm from a place where\nNiggas got TECs, don't mean technology\nGrew up 'round Blood niggas, real camaraderie\nPlus Crip niggas on the other side of me\nBut I'm the only nigga that I ever tried to be\nWinner never sins, you know these niggas tired of me\nNot to it if you want crap shootin' in your home\nWhere a nigga came from, my life changed\n'Cause a nigga made hits while my homies flipped bricks\nLot of them ain't here, can't complain\nTried to survive 9 to the 5\nYou ain't alive if you ain't not willin' to die\nThe lower the low, the higher the high\nDo or you don't, you fall or you fly\nI mean you ride or die, nigga\n\n[Refrain]\nUh, kill shit, I'ma talk about it\nLaid out with the chalk around him\nCame back as kings, came back with rings\nWhat if we fall? I never thought about it, nigga\n\n[Chorus]\nGunfire, gunfire, nah, nah, nah\nRun at yah, run at yah, nah, nah, nah\nWe come for yah, come for yah, nah, nah, nah\nSet fire to my enemies\nFuck a rasclaat, those our enemies\nMi got a few chains worth a hundred keys\nThem say they waan ride, mi say, \"Pussy, please\"\nPussy boy never worried me\nMy clips up on hundred streets\nNuh call the police pon me\nA hundred keys in these streets\nPussy boy, now I walk with weed", "image": "https://images.genius.com/d5f976b628ec80f757cc03787e34275e.527x533x1.jpg"}], "artist": "Dr. Dre"}