{"songs": [{"title": "Say What", "album": "Violator: The Album", "year": null, "lyrics": "[Chorus]\nMost thugs front when they get the chance (say what?)\nSome thugs hit the blunt when they get the chance (say what?)\nLive thugs stack chedder, then they make plans (say what?)\n\nI, Cool J, NY2K\nRule milleniums with my compadres\nThey tounges sway with really nothing to say\nThey pack guns, but I stack funds\nI'm second to none\nMy hot streak's just begun\nYou wanna bring beef? You got to serve it well-done\nYou ran the wrong way, now you livin' on the run\nNot some, each one's a bum, every one\nCoughed up a lung, became my son\nFlames I brung, platinumn weighs a ton\nHeavy on the chest, I pitty all the rest\nI put 'em to the test\nI spit it like I'm blessed\nI testify\nI have no need to lie\nI buried many, still many wanna die\nI zone out crazy, starin' don't faze me\nGot ya whole strategy shook\nIt's too daisy\n\n[Chorus]\nClack, relaod, clack, reload\nGot ya pictures sittin' in my lap\nHe explode\nDuck when you hear the rat-tat-tat\n'Cause once you cross over baby, ain't no comin' back\nBeleive that\nI flows when I hit that\nStrive till I get that\nNever mind a set-back\nNo time to wet that\nA lyrical hi-jack, you don't wanna try that\nCreep wit' my CD, don't let 'em know you buy that\nOne in the snips, one in the whip with the low jack\nCall a 911 to get the LL back\nOriginal bells, LL\nRocked them till they fell\nCompetition bailed\nLooked like mince green when mic had 'em swelled\nWrote all them rhymes and never gonna sell\nMeanwhile, I'm countin' prezzies in the the 'tel\nAnd in the meanwhile, I throw my baby in Chanelle\n\n[Chorus]\n\nUnh, I'm lyrically hot tonight, come on\nUnh, I'm lyrically hot tonight, come on\nLayin' low to catch you on stage so I can run on\nMatter fact, you not on my level, I throw my son on\nMission is complete, technique is unique\nDefeat the rhyme weak and mine ya knee-deep\nRewind a rip beats and give jeeps the heat\nEven if you walkin', wit' ya walkman in the street\nActin' gassed up, but you really on need\nHow you countin' your paper kid, without a GED?\nSlow down, let me do my thing now, hold up\nMaybe that's the reason you stressed, quick to roll up\nPut the L down, picked the other LL up\nMaybe we can straighten this out before it's toe-up\nWatch me closely, boom! I'm a blow-up\nAnd spend the whole rest of my life stackin' dough up\n\n[Chorus]\n\nWhoo, Vinnie Biggs, you hot with this one, dawg\nRoundtree\nRock The Bells\nUnh, Brian Daughtery\nUnh, all my peeps, my peeps, my peeps across the land\nKnow what I mean? we gonna keep gettin' paper\nThis is real\nThis is real, right here\nRock The Bells\nIt's deeper than the deepest blue sea, dawg\nKnow what I'm sayin'?\nI'm feelin' it like you feelin' it\nHa ha, word up\nI'm lovin' it like you lovin' it baby\nRewind it, it's short", "image": "https://images.genius.com/cfb82e92d3a328a63075fa8a47649ed0.400x400x1.jpg"}], "artist": "LL Cool J"}