{"songs": [{"title": "Mafia Music (Remix)", "album": null, "year": null, "lyrics": "[Intro: The Game]\nYeah! Maybach Music! Family we livin'\n\n[Verse One: The Game]\nWho stack cheddar better than the rat killer\nThat nigga that bust gats quicker, and he throw back liquor\nThe mafia way, toast it up like Sopranos\nAnd when it's snowin, I push it like pianos\nBack in the Lambo like I was born with it\nMakavelli prophecy shoot up the car I'm goin' with it\nFrom the cradle to the grave on these twenty two's\nBefore I take my last breath I let the semi loose\nIf there's heaven for a nigga with a crucifix\nSo much ice in it, mix the O and Gin and Goose with this\nB-O- double S that's my nigga Ross!\nAnd I'm his Cali connect, cause I can get it 'cross\nUsed to put ducks in the bathroom watch that bitch float\nCouple years past now it's keys on the big boat\nTake a shortcut 'round the Pacific\nThrow the AK in Atlantic that's mafia livin'\n\n[Verse Two: Ja Rule]\nGuess who's bizack? Yeah, nigga you guessed\nWho shot ya, I spit murder, the music is mafia\nThe swag's incomparable, but that just's comparison\nImpossible, like dope that don't move\nAnd I drip off the spoon, infectious to hoods\nAnd one cold afternoon, you'll get shot at your home\nNow, I smell pussy, pussy got lips\nBut it don't talk to me, that's why you my bitch\nAnd you on my dick (ah-ha!)\nCause I fucked ya up once, fucked ya up twice\nAnd you still talkin shit ('Preme nigga!)\nWhat must I do to get through to you?\nCurly, get off my dick, 'fore that ch-ch-ch-chi-chopper\nGet ta pah-pah-pah-pah-poppin off of niggas that been mouthin off\nRead in between the lines when you hear me talk\nGo and get out of line, this is Rule York\n\n[Verse Three: Fat Joe]\nThug nigga 'till I die, and I ain't even try\nSee the murder in my eyes, nigga fuck the other side\nI don't give a fuck! I will burn your jheri curls\nYayo is his bottom bitch, Banks is a girlie-girl\nDon't worry 'bout Whoo Kid, Macho smacked his face in\nLighty threw the towel and begged Pistol not to drape him\nI meant (?), don't let me catch Nelson\nI done spoke to God, man, He can't even help him, help him\nBig up to Maybach Music\nGot them choppers man, don't make us use it\nHits out the park, they call me Big Papi\nEven if you shot me, you still couldn't stop me\nStill went to Africa, still wore the big chain\nWhere you got robbed at? Nigga, on the same stage\nI say the shit that you can't say\nCause I am not a snitch, I ain't bitch-made\n\n[Verse Four: Rick Ross]\nDavid beat Goliath\nThe meek will inherit the earth\nDeeper\n\nTriple black Benz, Lord, forgive me for my sins\nI put hits on all you niggas, includin' some old friends\nMoney come and go, but the trill will remain\nBitch, I keep it real like I'm still dealin' 'caine\nRealest shit I wrote and I put this on this quote\nBefore I had a flow, I had a kilogram of coke\nMoney on the flo', twenty homies on the books\nFat mob boss but I'm runnin wit the crooks\nNo need for a vest, that'll suffocate the flesh\nI'm Martin on the balcony anticipatin' death (death)\nLet the rifles sing, cause \"I have a dream\"\nMy Coretta Scott-King in the tub full of cream\nPink champange seem to take away the pain\nWhile the blue hollow points penetratin' all the lames (lames)\nMoney ain't a thang, bitch, that's a lie\nIt only controls every bitch that's alive\nMoney manifests, haters gotta die (die)\nTia never told you that that motherfucker rides\nNiggas takin sides, crack smoking wives\nCracking crabs at the tables, count the cash, crack the wine\nSnakes gotta feel it, beef never squashed (never)\nThis time I'm embark on my Million Man March\nI'm unorthodox, name me the victor\nIn the suite wit Shaniqua and that brain off the Richter\nMarquise knocks, Marquise stop\nThen I give him 50 Cent, that's Marquise' pops\nI put a milli on it, this pussy don't want it\nShow up in his hood wit the wolves by the mornin' (bang)\nNigga, this a gift, maybe you could live\nMy music is the mob, it is what it is\nStrapped to a T, as real as it gets\nOnly boss getting money with the Bloods and the Crips\nAmen\n\n[Outro: Rick Ross]\nDeeper than motherfuckin' Rap, nigga\nOnce you crossed that line\nIt ain't 'bout, North or South\nIt's about money and power, riders and punks\nWe know how the story goes nigga, contract killers\nIt's not a threat, it's a promise\nMoney long as 183rd Street, nigga aka Miami Gardens\nYou could make that list too, nigga\nAmen\nThe Lord is my light and salvation, who shall I fear?\nThe Lord is the strength of my life, of whom shall I be afraid?\nMy evil and foes come upon me to eat up my flesh, they shall stumble and fall\nThough a host should encamp against me, my heart shall not fear\nThough war should rise, in this I shall be confident\nIt's deeper than rap, nigga", "image": "https://images.genius.com/3dce21029cdd8aab73eb473e015807d5.1000x1000x1.jpg"}], "artist": "Rick Ross"}