{"songs": [{"title": "R.A.W.", "album": "Build and Destroy", "year": null, "lyrics": "[Hook: scratches by DJ Revolution]\n{\"Raw!\"} {\"R.A.W.\"}\n{\"Give it to ya - raw!\"} {\"R.A.W.\"}\n{\"Give it to ya - raw!\"} {\"R.A.W.\"}\n{\"Give it to ya - raw!\"} {\"R.A.W.\"}\n{\"Give it to ya - raw!\"} {\"Gon' give it to ya..\"}\n\n[Checkmate]\nRaw.. love and war\nI'mma give it to ya.. let's go..\n\nRaw, imperial cats is wieldin instrumental war\nRap tactical macks perform unspeakable acts\nAnd hope on vengeance, exposin your pretenders\nTo the laws and battle nature performance under the gun\nAnd we move, with maximum efficiency to your redundant\nAnd shake, we dominate 'em on old fashion, break 'em with a power\nLike glass jaws, fresh we outta grammar inflict force\nWe grapple your mental with word tentacles sick\nManipulate your heart rate through brain chemicles slick\nI slide through like lubrication on a Latex\nFuckin your thought process hard like date-rape sex\nSmokin cigarettes slow and once your cherry glow red\nCause I'mma see the satisfaction in the end\nMy caliber big time designed to be fatal\nAnd crush a nigga windpipes slow with my cables\nThey feel this soloist soon, this cat controllin the womb\nI'm movin cracks like they body consume\nCertified but my ability's skill, license to kill\nAnd carry the heavy weaponry, ill like pentetiaries\nRAW! {*echoes*}\n\n[Hook]\n\n[Royce Da 5'9\"]\nYo.. it's several different levels to pickin up shovels\nAnd dumpin you in ditches under sea level, frontin you can witness\nLet me refreshin you niggas tell you my position in this\nBeef! Leavin you under Venice, opposition finished!\nHere it is, we invaded created a Pyramid\nOf a Haven of names, so blame Dre and that ear of his\nSo {*heavy breathing*} breathe, I'd rather REACH for your neck\nAnd I never HEAT you for respect, unless you GREET me wit less\nI got a skunk, in my trunk\nI'm lyin, I got a pump in my trunk\nYou dyin, how many lumps niggas want?\nWho's ready for y'all? We ready for y'all\nWe too incredibly raw, for any artist that said he would draw\nI stand firm, and it hurts to live it\nYou open up that can of worms, I hope you ready for the dirt that's wit it\nDefenders of the fame fast, Concise is a Checkmate\nThe endin of your life, so prepare for your rest date, c'mon\n\n{\"Raw!\"} {\"R.A.W.\"} {\"RAW, RAW!\"}\n{\"I'ma give it to ya - raw!\"} {\"R.A.W.\"}\n{\"RAW! I'mma give it to ya - raw!\"} {\"R.A.W.\"}\n{\"RAW! I'mma g-give it to ya - raw!\"} {\"R.A.W.\"}\n\n[Concise]\nLet's go\nIt's war games and I'm a dominator by nature\nBattle machines, chamoflouge greens on your radar\nThey starvin the artists, bullshit, charge it\nDischarge on a target, dearly departed\nRaw and uncut, uncooked I'm pure\nPrice to sell tour, rap sell out stores\nSomethin to live for, double my street value\nClear-cut your colony, and balance the economy\nI speak in testaments, unleashin pestilence\nLight speed, supreme being the Fifth Element\nHigh grade, the most potent, West coast wasps rollin\nAnd build a empire like the Romans\nDown by law, raw like in Nassau\nWhen I took the bottle to the center of your glass jaw\nDefendin number 7, ball ready and write\nMost steady on mic, raw like Israel light\nYoung Lord of the Sound Table, niggas of the +Knight+\nThe ruler rough rhyme better known as Concise\nWe certified original, roll heat\nYou niggas is beginners in this rap race runnin with cold feet like\n\n[Hook] - w/ variations and scratches till fade", "image": "https://images.genius.com/d86b45b993cdf0c53559e740521a4bba.500x494x1.jpg"}], "artist": "Royce da 5'9'’"}