{"songs": [{"title": "Grenade (Remix)", "album": null, "year": null, "lyrics": "[Verse 1: Lil Wayne]\nAnd I don't mind when we fall out\nAs long as we fall back into it\nI hope we never put an end to it\nEven though you not that into it\nHeaven, have you ever been to it?\nCause you look like you never been\nYou're more of a Hell's Angel\nAnd for you, I'd rather sin\nBroken heart, love you with a broken heart\nFor you I'd jump off Noah's arc\nLove is blind and hope is dark\nWhy does pain feel so good?\nLove is science live for you\nDie for you, and I'll die smiling\n\n[Verse 2: Bruno Mars]\nEasy come, easy go, that's just how you live\nOh, take, take, take it all but you never give\nShould've known you was trouble from the first kiss\nHad your eyes wide open, why were they open?\nGave you all I had and you tossed it in the trash\nYou tossed it in the trash, you did\nTo give me all your love is all I ever asked\nCause what you don't understand is\n\n[Hook: Bruno Mars]\nI'd catch a grenade for you, throw my hand on a blade for you\nI'd jump in front of a train for you, you know I'd do anything for ya\nI would go through all this pain\nTake a bullet straight through my brain\nYes, I would die for you, baby, but you won't do the same\nNo, no, no, no\n\n[Verse 3: Bruno Mars]\nBlack, black, black and blue, beat me 'til I'm numb\nTell the devil I said, hey, when you get back to where you're from\nMad woman, bad woman, that's just what you are, yeah\nYou'll smile in my face then rip the brakes out my car\nGave you all I had and you tossed it in the trash\nYou tossed it in the trash, yes, you did\nTo give me all your love is all I ever asked\nCause what you don't understand is\n\n[Hook]\n\n[Bridge: Bruno Mars]\nIf my body was on fire\nOoh, you'd watch me burn down in flames\nYou said you loved me, you're a liar\nCause you never, ever, ever did, baby\n\nBut darling\n[Hook]", "image": "https://images.genius.com/f903dae2533e450c8d3cb233aa846020.745x745x1.jpg"}], "artist": "Lil Wayne"}