{"songs": [{"title": "Ain’t Nuttin’ But Music", "album": "Devils Night", "year": "2001-06-19", "lyrics": "[Intro]\nLa la la la la la\nLa la la la, la\nLa la la la la la, la\nHahahahaha\n\n[Verse 1: Eminem]\nIt's shit like this I kick to these rich white kids\nWho just might see how fucked up this sick life is\nOops, I did it again, didn't I?\nMy shit's harder to figure out than what Britney's tit size is\nOoh, I probably pissed you off again, didn't I, bitch?\nSo what? Christina Gaguilera better kiss my grits\nYou know how many shits I give? I wish I did\nSo I can quit giving these twisted little kids ideas\nThis just in: Britney just dissed Justin\nShe just fucked Ben, got tit-fucked and dick-sucked him\nIf Affleck can get his ass licked, how come I can't?\nShit, god damn, bitch, I'm rich, I can't understand this\nAre those pictures I made of us together on the internet\nAs close as I'm ever gonna get to hitting it from the back?\nAnd shit, when it comes to that, I hit harder from the back\nThan Everlast when he's plugging Lethal in his fucking ass\nJust give me one more chance, Britney hit me one more time\nLet me know what's on your mind, Whitney give me one more line\nTo sniff, you fuckers know what time it is\nFuck your jewelry, my record's almost diamond, BEEOTCH!\n\n[Chorus: Eminem]\nWhat's going on in the world today?\nPeople fighting, feuding, looting, it's okay\nLet it go, let it flow, let the good times roll\nTell 'em Dre! (It ain't nuttin' but music)\nWhat's going on in the world today?\nPeople fighting, feuding, looting, it's okay\nLet it go, let it flow, let the good times roll\nTell 'em Dre! (It ain't nuttin' but music)\n\n[Verse 2: Bizarre]\nEminem doesn't like N'Sync, well I do\nSo fuck him, and the Backstreet Boys too\nWhatever happened to the cast of Diff'rent Strokes?\nGary's broke, Todd's snorting coke, and Dana overdosed (aw!)\nI got two little boys with me\nMichael Jackson sent two helicopters to get me (Hee! Hee!)\nI'm up early with my hair curly\nMe and Mr. Furley, fucking Laverne and Shirley\n\n[Verse 3: Kuniva]\nA lot of rappers are living in la-la land\nThat's why I let my dogs out on the Baha Men\nAs bad as a life I had, I'm not mad\nI don't need to be a Jackass to beat up my dad\nMy whole family's country, my grandmother's old fashioned\nAnd she keeps asking me why I rap with a honkey\nBut granny I'm a flunky, I could be a junkie\nI could be hanging with the hoochies out at the club scene\n\n[Bridge: Kon Artis]\nTo all the independent women in the house! (Hooouse!)\nShow us your tits and shut your motherfucking mouth! (What?!)\n\n[Verse 4: Proof]\nRobert Downey, Bobby Brownie, Whitney Houston\nThe shit she's using\nJesse Jackson, reverend scandal\nGot George Michael's, Tevin Campbell's\nPee Wee Herman's, peep show places\nPublic restrooms, peep those cases!\n\n[Chorus: Eminem]\nWhat's going on in the world today?\nPeople fighting, feuding, looting, it's okay\nLet it go, let it flow, let the good times roll\nTell 'em Dre! (It ain't nuttin' but music)\nWhat's going on in the world today?\nPeople fighting, feuding, looting, it's okay\nLet it go, let it flow, let the good times roll\nTell 'em Dre! (It ain't nuttin' but music)\n\n[Verse 5: Swift]\nYour mom and dad probably mad at us (for what?)\nWe done turned their kids into little body snatchers\nAin't like where I'm from, we don't bite our tongue\nAre you sure you want niggas 21 to carry guns?\nIt's sad but I'm glad that I'm made to rhyme\nWhere you work you ain't getting paid for that overtime\nIt's only music, media know it but they blind\nI ain't in y'all life, so stay they hell up outta mine! (Nigga)\nY'all the reason why Princess Diana ended up dying\nIf you people get offended I don't care (stop crying!)\nTrying to get us to leave cause what we say just ain't clean (uh, uh)\nBut holding back on what I say just ain't me\n\n[Verse 6: Kon Artis]\nNow what's these parents all mad for?\n\"Your music is bad for 'em\"\nFor teenage kids that drink more than Ted Danson in Cheers\nCarson drink beers, we all fart and piss and cuss out our bitch (SHUT UP!)\nBroke or rich, I still do that same old shit\nI don't jump in front of a camera and change no shit\nSo when they ask me about my sarcasticness\nI just slap 'em, turn around and ask them this\n\n[Chorus: Eminem]\nWhat's going on in the world today?\nPeople fighting, feuding, looting, it's okay\nLet it go, let it flow, let the good times roll\nTell 'em Dre! (It ain't nuttin' but music)\nWhat's going on in the world today?\nPeople fighting, feuding, looting, it's okay\nLet it go, let it flow, let the good times roll\nTell 'em Dre! (It ain't nuttin' but music)\n\n[Outro]\nLa la la la la la\nLa la la la, la\nLa la la la la la, la\nOoh ooh, ooh ooh ooh\nOoh ooh ooh, ooh ooh ooh\nOoh ooh ooh, ooh\n[Kuniva]\nLook out for the D12 R&B album coming out soon\nStraight R&B, straight R&B, straight R&B\nJodeci, we got you!", "image": "https://images.genius.com/591360993ef93e1c0a2402279fb90319.600x600x1.jpg"}], "artist": "D12"}