{"songs": [{"title": "I Wouldn’t Do That", "album": "No Shame", "year": "2017-11-24", "lyrics": "[Pre-Hook]\nYikes, I'm in my zone\nGet on my level, I'm wildin' out, move back\nGet off of me, I am the prodigy\nI feel like I am a new man\nI really don't see any areas in this shit I should improve at\nSo who tryna wake up the dragon? You?\nNah, I wouldn't do that\n\n[Bridge]\nOkay, alright\nIt's about to go down\nIt's about to go down\nIt's about to go down\nIt's about to go down, nigga\nYeah, okay (Prodigy)\nCheck me out, look!\n\n[Verse 1]\nOh, shit who's that?\nI'm the rapper lunatic who comin' at you like a locomotive\nI been down, now I'm up\nHop solo, nigga damn, it's like my life is like a rollercoaster\nYour flow the coldest? Well I flow below it\nYou know I'm bloated from eating so many niggas\nAh, hold on a moment!\nHomie, I don't need a major label\nI'm at home with twitter fingers whippin' up my own promotions\nRap monster, Black Mamba\nYou can't run from the wrath I've been asked to cast on ya\nTo all the haters who been keepin' up with my every move\nHere's my penis to latch on ya (catch!)\nI'm the only MC in this wack genre (bitch!)\nDon't look at me, I'ma spaz on ya\nKids, go get the key to your dad's Honda and turn up\nRoll up the street and you pass ganja (are you serious?)\nI came up with a couple new answers (what's that?)\nI'ma need a couple new dance singles (nigga what?)\n'Cause I done made a whole lot of money\nBut I'm feelin' blue still, I ain't talkin' Zoolander\nI was Hugh Heff'in on the low\nWhen my girl found out, she was like, \"You bastard!\nIt's so obvious you never even loved me\nYou stupid ugly motherfucker, fuck you and her!\"\nFame's a web and I'm caught between it\nWalk and breathe it, cool thing and it's all convenient\nHoes beggin' me to sign all across the cleavage\nNigga, you should hear the tone that they talk to me with\nI'd be stupid if I don't fill 'em all with semen (true)\nI don't know where to go with these darker demons (true)\nI've been on the phone tryna talk to Jesus (true)\nI am on a roll, and can y'all believe it? Alright\n\n[Pre-Hook]\nYeah, I'm in my zone\nGet on my level, I'm wildin' out, move back\nBitch, get off of me, I am the prodigy\nI feel like I am a new man\nI really don't see any areas in this shit I should improve at\nSo who tryna wake up the dragon? You?\nNah, I wouldn't do that\n\n[Hook]\nNope, nu uh, sorry\nI wouldn't do that\nCome on, what? Are you serious?\nI wouldn't do that\nThis guy, really? Fuck are you doin'?\nI wouldn't do that\nLook buddy, I get it, I know! It's not gonna work\nI wouldn't do that\n\n[Verse 2]\nI got a story and I hope it unfolds (yeah)\nUndercover Prodigy, I won't become broke (yeah)\nNobody fuckin' with me and both of us know\nY'all two week hyped like Pokémon GO\nYou don't see it, homie, then you smokin' on dope\nGot MC's hemmed up, chokin' on rope (so?)\nHaters keep talkin' but doin' nothin' about it\nAs I let my nuts hang while I'm holdin' on both\nI been on one, charged up like protons\nI'm so gone, it's goin' down like nose runs, nigga\nCollectin' mo' funds like bank robbers who tote guns\nIt's so fun, look at the hoes come, nigga\nStep aside, allow me to prepare for my finale\nIt's grind time around me (yup)\nDamn, Hopsin, you tight, no doubt B\nBack at it again with the white Janoski\nLook, I ain't innocent, I stay killin' shit\nRape sentences and shake witnesses, I'm an insane menace\nVacate the day premises, my brain's missin'\nI date women for eight minutes then play 'em like Sega Genesis\nStraight nigga, but shit, it's too late to take Ritalin\nAnd doctors, they've been itchin' for days to make sense of it\nIf I'm around, no such thing as a safe citizen\nWhen I'm on the mic I deliver like St. Nicholas\nNiggas get in shivers the moment the base tricklin'\nYou can see I'm not in the mood to play, gentlemen\nForever ill is somethin' you can't fiddle with\nYou ain't got the balls to hang, okay little dick?\nNiggas, I'm God, I'm a numskull\nIf you don't like me, what the fuck did you come for?\nIf anybody sayin' I'm not raw\nJust tell 'em one thing: I got bars, nigga\n\n[Pre-Hook]\nYeah, I'm in my zone\nGet on my level, I'm wildin' out, move back\nBitch, get off of me, I am the prodigy\nI feel like I am a new man\nI really don't see any areas in this shit I should improve at\nSo who tryna wake up the dragon? You?\nNah, I wouldn't do that\n\n[Hook]\nNope, nu uh, sorry\nI wouldn't do that\nCome on, what? Are you serious?\nI wouldn't do that\nThis guy, really? Fuck are you doing?\nI wouldn't do that\nLook buddy, I get it, I know! It's not gonna work\nI wouldn't do that", "image": "https://images.genius.com/538c208e6d573914c37ce0417736d005.1000x1000x1.jpg"}], "artist": "Hopsin"}