{"songs": [{"title": "Sad Circus", "album": "Welcome to Strangeland", "year": "2011-11-08", "lyrics": "[Intro: Makzilla as Circus Announcer]\nLadies and gentlemen, hurry hurry hurry! Step right up and witness the sad circus! Come one, come all, to the sad circus! Step right up and see the lonely poor bastard. Witness, the man with no hope. Stories guaranteed to be tear jerkers. Now without further adieu, the sad circus!\n\n[Verse 1: Tech N9ne]\nI had so many plans, cause I got plenty fans\nI thought that I was never gonna be alone to spend these grands\nBut it seems that every girl that I dated somehow hated the way I loved\nAnd I mated with so many, now the ones that with it, its not any; they all ran\nI thought that I was gonna be Hugh Hef, 6 women to go 2-step but not one of my crews left\nKids are growing up and they got lives now nobody arise now\nUsed to be married but narcissism let my bride down\nI used to be a playa, I used to be afraid of bein' alone\nBut they all eventually said \"I'll see ya later...\" much later...\nSittin' in this plush lair must say I'm stuck in a rut\nI guess not enough prayer\nCause ain't nobody came back, I bust the same raps\nBut ain't no dame pack wish I could change that\nThey say that I'm extra I'm messed up and I murk the deals\nThat I have with them in the past and I miss 'em and it hurts for real\n\n[Hook: Courtney Kuhnz]\nSee the man with the broken heart (He's just right over there)\nAll alone he stands so lonely in this world so cold\nAnd he's been hopeless from the start (He feels like no one cares)\nBorn alone, he'll die so lonely, saddest story ever told\n\n[Verse 2: Brotha Lynch Hung]\nSooner or later rumors that tear me up in pieces\nAnd he's just bad luck everywhere I go I'm sick of this steepness\nMore money more problems, no money problems gettin' worse\nHe don't have to get bloody but he didn't have to get hurt\nFuck I'm so tired of all this cryin' it don't work\nIt's affectin' my work, not even carin' about my worth\nThin line between love and raps, Strange got the fans comin' back\nBad plus bad run in packs, startin' to think is a curse\nI can't you do it without you nigga'\nCan't be done without me nigga'\nWell, yes it can, wait, please don't do it without me nigga'\nStrange move on without these lyrics, makin' it to where these fans can hear it\nI'mma have to get done I'm near it, Brotha Lynch Hung you can't be serious\nI'm starin' at these pills, in the back of the Cadillac, and matta' fact\nI got it I grip my steel, I'm always on this suicide thinkin' that's how I feel\nI figure if I get rid of these pills nobody would care if I'm killed\nMy label's on the road, me just sittin' at home, see\nSpittin that chrome, he gettin'that gold\nWe get that call and then we run in they house, gun up in they mouth\nJust know it's Madesicc Strange that's what I'm talkin' 'bout\n\n[Hook]\n\n[Makzilla as Circus Announcer]\nThank you! For coming, to the sad circus...come again...or not...hahahaha...\n\n[Outro: Tech N9ne]\nI'm falling, I'm crawling, I'm yelling but no one can hear me calling. I'm crying, profusely, sometimes I wish somebody would just come and noose me", "image": "https://images.genius.com/4392f3223b9e5965e7f76dc529941352.1000x1000x1.jpg"}], "artist": "Tech N9ne"}