{"songs": [{"title": "Song Cry", "album": "The Blueprint", "year": "2002-05-08", "lyrics": "[Produced by Just Blaze]\n\n[Intro: Bobby Glenn + Jay Z]\nPicture all the possibilities\nPicture all the possibilities\nSounds like a love song\nSounds like a love song\nThe most incredible, baby\nI can't see 'em comin' down my eyes\nSo I gotta make the song cry\nI can't see 'em comin' down my eyes\nSo I gotta make the song cry\n\n[Verse 1: Jay Z]\nGood dude, I know you love me like cooked food\nEven though a nigga gotta move like a crook move\nWe was together on the block since free lunch\nWe shoulda been together havin' Four Seasons brunch\nWe used to use umbrellas to face the bad weather\nSo now we travel first class to change the forecast\nNever in bunches, just me and you\nI loved your point of view ‘cause you held no punches\nStill I left you for months on end\nIt's been months since I checked back in\nWe're somewhere in a small town\nSomewhere lockin' a mall down\nWoodgrain, four and change, Armor All'd down\nI can understand why you want a divorce now\nThough I can't let you know it, pride won't let me show it\nPretend to be heroic, that's just one to grow with\nBut deep inside a nigga so sick\n\n[Hook: Jay Z]\nI can't see 'em comin' down my eyes\nSo I got to make the song cry\nI can't see 'em comin' down my eyes\nSo I got to let the song cry\nI can't see it comin' down my eyes\nSo I got to make the song cry\nI can't see it comin' down my eyes\nSo I got to make the song cry\n\n[Verse 2: Jay Z]\nOn repeat, the CD of Big's \"Me & My Bitch\"\nWatchin' Bonnie and Clyde, pretendin' to be that shit\nEmpty gun in your hand, sayin', \"Let me see that clip!\"\nShopping sprees, pull out your Visa quick\nA nigga had very bad credit, you helped me lease that whip\nYou helped me get the keys to that V dot 6\nWe was so happy poor, but when we got rich\nThat's when our signals got crossed and we got flipped\nRather mine, I don't know what made me leave that shit\nMade me speed that quick, let me see — that's it\nIt was the cheese, helped them bitches get amnesia quick\nI used to cut up they buddies, now they sayin' they love me\nUsed to tell they friends I was ugly and wouldn't touch me\nThen I showed up in that dubbed out buggy\nAnd then they got fuzzy\nAnd they don't remember that, and I don't remember you\n\n[Hook: Jay Z]\nI can't see it comin' down my eyes\nSo I got to make the song cry\nI can't see it comin' down my eyes\nSo I got to make the song cry\nYeah, I've seen 'em comin' down your eyes\nBut I got to make the song cry\nI can't see it comin' down my eyes\nSo I got to make the song cry\n\n[Verse 3: Jay Z]\nA face of stone, was shocked on the other end of the phone\nWord back home is that you had a special friend\nSo what was oh so special then?\nYou have given away without gettin' at me\nThat's your fault, how many times you forgiven me?\nHow was I to know that you was plain sick of me?\nI know the way a nigga livin' was whack\nBut you don't get a nigga back like that!\nShit, I'm a man with pride, you don't do shit like that\nYou don't just pick up and leave and leave me sick like that\nYou don't throw away what we had, just like that\nI was just fuckin' them girls, I was gon' get right back\nThey say you can't turn a bad girl good\nBut once a good girl's gone bad, she's gone forever\nI'll mourn forever\nShit, I've got to live with the fact I did you wrong forever\n\n[Hook: Jay Z]\nI can't see 'em comin' down my eyes\nSo I got to make the song cry\nI can't see 'em comin' down my eyes\nSo I got to let the song cry\nI know, I've seen 'em comin' down your eyes\nBut I got to make the song cry\nI can't see 'em comin' down my eyes\nSo I got to make the song cry", "image": "https://images.genius.com/e78484e97f84fb7918363bf70e8b4459.300x300x1.jpg"}], "artist": "JAY-Z"}