{"songs": [{"title": "No Mercy", "album": null, "year": "2015-03-14", "lyrics": "Tell me about these fake ass bitches\n\n[2Pac]\nLook here little nigga\nMost of these niggas be bitches too\nBut you'll never hear that side of the story\nSo uhh, we finna do this shit like this\n\nIt's like I tell my niggas, keep your eyes on these bitches\nThey love to G a nigga young dumb and gettin riches\nWhat the fuck you think a trick is nigga\nNigga done stick and wet his dick\nAnd then get tricked out all his riches by a -- BITCH!\nI'm here to school you to the rules of the game, it'll cost ya\nThink you alla that just cause she let a nigga toss her\nIt's like a motherfuckin priveledge\nSo don't give up your conversation, give that bitch your 7 digits\nWhen she call ya, ask that tramp whassup\nAnd if she hesitate, nigga hang up, worrrd up\nAnd let that bitch meditate to the dial tone\nAnd call me when you're ready to bone, and it's on\nA motherfucking mack tonight\nStay that stay strapped cause my raps is tight\nYou fuckin punks, I hate you snitches\nWent against the grain and the game to be fake ass bitches\n\n(God, damn! You can't just hit them niggas with that game\nAnd expect them to accept it; girl your heard me it gets skanless\nBut we gonna kick this shit like this here)\n\n[Chorus: 2Pac]\n\nI can't stand fake ass bitches\nLyin ass niggas and you punk ass snitches\n[repeat 2X]\n\nTime to show these bustas who's boss\nRun up on a real motherfucker and get tossed\nThe game is deep, and thicker than a motherfuckin jimmy\nBroke hoes runnin round yellin \"Gimme!\"\nI can't stand it, hoes talkin bout they got a man\nShit all I wanted her to do is suck my DICK\nSo how about hittin a motherfucker on my pager\nBusy now bitch but you can give me the pussy later\nFly how I fade her, played her like a game of Sega\nFuckin with the player that done made her, huh\nAnd I ain't sleepin caught you creepin for my money\nGot the dick and now you get the pistol honey (bitch)\nSo get the bozack, knockin hoes back, keep my dough stacked\nSo where the motherfuckin hoes at?\nPunk niggas can't fade the mack, livin fat\nGettin paid to rap, it's like that, you motherfuckin bitches\n\nOh you too nigga, don't think we ain't talkin bout your punk ass\nYou old fake ass nigga\nStandin there wearin all them Pendletons and khakis and all that\nYou soft as a motherfuckin grape\nAin't this a motherfuckin bitch\nI can see right through your flower ass\nSome of these niggas is bitches too, man I tell ya\nIt's gonna be harder and harder to be a Thug in ninety-fo'\nBut we gonna do this shit\nY'all take this shit and you play this shit for every single\nFake ass bitch out there\nAnd there's plenty of em\nYou probably got one sittin next to you right now\nBobbin his fake ass head to this, dope ass shit that he listenin to\nFake ass motherfuckin bitch, die in ninety-four", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}