{"songs": [{"title": "On Genius and Fashion", "album": "Kanye West’s Visionary Streams of Consciousness", "year": "2013-11-24", "lyrics": "Wait a second, would you rather me not talk at all? ’Cause I don’t want to like, I don’t want to rattle no cages or nothing, I don’t want to like, I don’t want to get in trouble. I want to be scared. I’m trying my best to be scared. I’m trying my hardest to be scared. No, no, no, I don’t want to talk. I don’t want to talk at all. As a matter of fact I’m just going to tip-toe on this\n\nI’m scared of anonymous comments online. I’m scared of them. These words affect me so much. They affect me so much. No, I’m sorry. I’m scared, I’m scared. I’m scared of these corporations, like, not giving me another deal that they didn’t give me already. I’m scared. I’m scared.  I’m so shook. I’m so, so scared. So scared. Soooo\n\nYou ain’t never seen, you ain’t ever seen, that my great, great, great, granddaddy somehow ended up on that boat. Somehow he ended up on that boat. But I know that we were royalty. I know we built the pyramids. I know anything is possible. I know anything is possible. And everybody has a moment in time and I picked y’all when I was walking in Madison Square Garden, I just wanted to make sure, thank y’all for giving me this moment in time. ’Cause everybody has a moment. And in your moment you gotta own it. There’s so many people have a moment and they don’t own it\n\nYou know, it’s so funny when people compliment me and they say the word genius, and somehow that like, separates me from rappers in some way, there’s the connotation of that. But what I need y’all to realize is Jay Z is a genius. And I need y’all to understand that Drake is a genius. I need y’all to understand that rap is an amazing way to express genius\n\n’Cause just as an architect would build buildings, we put our words together to express the shit that we going through. We are the modern day poets, obviously. But why are so many writers so condescending to the rappers? Why do they try to classify us as musicians as being ignorant in some way? Why do they try to classify us, as far as the classes go? You know how it goes, right? I think it’s like a battle between art and architecture as the top. And if you’re an artist or an architect, you look down upon a fashion designer. And if you’re a fashion designer, you look down upon a musician. And if you a musician, you sign a deal with a corporation so you can buy a bigger house. And every time you go in the studio you watch your fucking mouth\n\nYou watch, you watch your fucking mouth. You don’t, you don’t want to lose this house. But when they write these history books, they’re not going to talk about what house we had. When they write the history books they aren’t going to talk about the money we made. They’re going to talk about the impact we had. They’re going to talk about the impact we had\n\nAnd being that I saw The Hunger Games today, I wanted to bring up something, because it was very inspiring. It felt like almost a mimic of my exact life and shit. I know it. I was like, “Baby we gotta be on that movie board when they writing this shit.” And I saw Lenny Kravitz. There wouldn’t be no song called “Niggas in Paris” if it wasn’t for Lenny Kravitz. ’Cause that was the first nigga in Paris. Fucking with the models and shit, rocking Rick Owens head-to-toe and shit. Black. Rock. Star\n\nBut what’s interesting to me is like I was fond of hanging out with different people, in Paris, right. ’Cause Lenny Kravitz has like, the best taste. And he has like the dopest crib in Paris, everybody knows about it. And I don’t know if you know this, but he designs furniture, he designs lighting fixtures, and he had been working on a clothing line for a long, long, long, long, long, long, long time. Long time. Long, long, long, long time\n\nAnd the designers would love it when Lenny Kravitz would show up at their fashion show. Yeah we gonna take some pictures of Lenny Kravitz and we gonna say he’s at the such and such show, and that’s gonna promote our brand. Hey Lenny, promote it the best you can. Hey Lenny, promote it the best you can. Hey Lenny, promote it the best you can. Best you can. Hey Kanye, promote it the best you can. Hey Kanye, promote us the best you can. From Paris to New York all the way to Japan. Hey Kanye, I mean Lenny, I mean any of you niggas, promote it the best you can. Any of you niggas promote if the best you can\n\nSo I said, “Wait a second, though.” I said, “I’ve got a dream of doing my clothing and I, I want to learn about furniture,” and you know what they told me when I was in Paris? You know when the W Magazine writer came out and wrote that classist-ass interview about me? You know what they said? You know what the billionaires told me? I went to about three or four different people and you know what they told me when I told them about my dreams? They said,  “Lenny Kravitz wanted the same, same thing.” They said, “Lenny Kravitz wanted the same, same thing.” Don’t let me sing because I want y’all to understand that I need to talk to you. They told me, “Hey that’s cute, that’s the same thing Lenny wanted to do.” Like it’s a motherfucking joke. It wouldn’t be no Kanye west if it wasn’t for Lenny Kravitz. You know what I’m saying?\n\nBut the only difference between me and Lenny Kravitz is I turned up on these niggas. I don’t give a fuck about looking cool or being cool. And this is no disrespect to Lenny. But they got this shit called cool, everybody want to look cool, everybody want to be cool, everybody don’t want to break their motherfucking cool, don’t nobody want to look like a fool\nMy boy [?], who used to work for Donda and now designs stages for Jay Z and Justin. The other day he said a word that I hadn’t heard people say before. And he said he was working at some corporation, and the head of the corporation is always like, kind of down on him and shit, and the word was to marginalize. To marginalize. And then he also said he tried to make him look like an idiot in front of people, right? So has anyone here tonight ever read a piece of press or saw something or heard something on the radio where they tried to make me look like an idiot? Wait a second, I don’t know, have you ever heard anything in the press where they’re trying to make me look stupid? You know what I’m saying, like I’m actually stupid. (Laughs) You know what I’m saying, like I’m not smart, like stupid. Like, like what the fuck is wrong with him? You know what I’m saying? Have y’all ever read or heard someone say, “I don’t like Kanye West”?\n\nI’ll tell you something. Have you ever heard anyone talk shit about Lenny Kravitz though? He’s a nice guy. He’s a nice guy. He’s so well-mannered. I envy manners. I envy it. I envy people who are extremely likeable. I’m like, “Damn, I wish I could be likeable like them.” I wish people would like me like that\n\nSo what they basically did was, at Fashion Week… Let me explain something to you… I don’t give a fuck about fashion. I care about talent. I care about creativity. And it just so happens that with the advent of the Louis Vuitton bag, fashion rise to the top, and stole all of the creativity to only work for its small box, and sell it back to you at a higher price. That’s what the fuck fashion is to me. I care about dreamers. I care about heart. I care about soul. Not those who are marginalized\n\nSo if you think about someone like McQueen. Instead of being forced to make some fucking T-shirts with a skull on it, why wasn’t he allowed to make movies? He was just as good as Tarsem, he’s just a good a visualist as anyone else. But they would marginalize him as only a fashion designer. Which, let’s rewind, is above a music producer, and it’s above a rapper\n\n’Cause you gotta stay in your tier, in your section. You gotta stay right there, you can’t move. But if you pay for a ticket, you wanted to come to see this show, and you standing right there, right? And when you’re trying to go you say I want to go up there, a security guard stops you, and then holds you, and if you start screaming the paparazzi catch you, catch you with your face looking all crazy, and then you scream out loud, and you got to really scream, you gotta say, “I am a god!” Just for them to let you a little bit up\n\nBut you know who fucked it up for everyone? Marc Jacobs. Because he gave two niggas a shot, me and Pharrell. He fucked the whole game up, and Pharell’s such a nice guy. ’Cause soon as I was able to make that Louis Vuitton sneaker, and the world reacted—I didn’t price it, but the world reacted to it—I got to see what it meant to create inside of that type of production facility. And wait a second, the same guy that was creative enough to make all of this [gestures back to his stage setup], that’s worn Jordans his whole life, could create a sneaker with Louis Vuitton and people reacted to that. And I said, I made another color. I did a pink model, and I did a red model, and I named them after my friends. I made one in Jasper after Ivan Jasper and one Mr. Hudson after Mr. Hudson, and one, the Louis Vuitton Don, for my nigga Don C. And that last day in the factory, I was going through the colors and it came to me, when they made me do a couple pictures and shit, and I called back after they sold out. And they said, “I’m sorry, Mr. West, but you’re not going to be able to create anything else in here. You’re not going to be able to create anything else again.” They said, “I’m sorry,” and I said, “But wait a second. I sold out.” They said, “I’m sorry Mr. West, you can never create anything else again.”\n\nAnd right there, I was scared. Right there I was scared. ’Cause I thought that if I just went to their fashion show again and I just sat down like a good nigga they would let Lenny Kravitz get his shot! I thought maybe, maybe they would let Pharell get his shot. But no, no, no. Fuck you, nigga. Fuck you, nigga. Fuck you, nigga. Is that abrasive enough for you? ’Cause that’s what it is. Fuck you, nigga. Is that abrasive enough for you?\n\nAnd what about Mark Parker, and what about Hedi Slimane? I thought Hedi Slimane was my friend, and that’s why I’m so hurt. How many names did people call me for wearing tight jeans when I’m the rapper that wore tight jeans and shit, that brought tight jeans to the ghetto and shit? I thought I was Hedi Slimane designing motherfuckin’ tight jeans that you want. I’m the nigga that, you know I’m rocking that shit. Then he had his first fashion show, and I was so happy for him. I was so, so, so happy for him. And he told me, you can come to my show, but you just can’t go to Riccardo’s show and you can’t go to Phoebe’s show\n\nBut he wouldn’t say that to Anna Wintour. He wouldn’t say that to [?]. And now his whole shit based off of rock and roll, and you trying to tell the number one rock star on the planet where the fuck he can go? So he can sell y’all, some motherfucking $10,000 pair of jeans? Fuck fashion. Fuck fashion. I mean, what’s the worst thing they gonna do, not help me again? What’s the worst they gonna do tell me I can’t go to these shows again? What’s the worst they gonna do, tell me that because I’m a musician, I don’t have any ideas for clothing again? What’s the worst they gonna do, marginalize me again? And never let Pharrell get his shot, and never let Lenny get his shot?\n\nBut I’mma tell y’all right now, I will take that spot. I am 2Pac of this clothing shit.  And I’mma take that spot, and we gonna combine all the creators, the best creators on the planet, and we gonna lower the motherfucking prices, so everybody can get it. And we ain’t gonna steal from people’s ideas like H&M. And we ain’t gonna steal people’s ideas like Zara. We gon’ make our own shit. We gon’ combine the best creators on the planet, and we gon’ take them from Harvard, and we gon’ take them from St. Mark's, and we gon’ take ’em from the street\n\nAnd I’m sorry I went so long tonight. I know you just want to hear another motherfuckin’ hit song tonight. I’m so sorry I went so long tonight. I know you just want to hear another motherfuckin’ hit song tonight. Hit song tonight, hit song tonight. Another hit song, another hit song. Yes they do. I ask people about it, I tell them that I’m this creator, and they say I need another hit song. They say I need another hit song, hit song tonight, hit song…\n\nHold up, hold up. I’m sorry, if anyone out there thinks they can do anything, put your hands up right motherfuckin’ now! Almost forgot that part", "image": "https://images.genius.com/9fa6626ebb7cecda3ba692c1c80f52bf.1000x664x1.jpg"}], "artist": "Kanye West"}