{"songs": [{"title": "I Get Money (Freestyle)", "album": null, "year": null, "lyrics": "I get money\nI, I get money\nI, I get\nI get\nI get\nI get\nF*ck I look like coppin benim and tops\nNiggas wanna book me but they ain't spendin no guap\nThat's why I pull up to the curb like f*ck's the world\nYou know I keep the .22 tucked in the girdle\nHad to leak one of my bitches off Throop and Myrtle\nPut the shells to your back now they callin you turtle\nSee if you wanna laugh you can laugh\nBut nigga get my money, get my cash, get my math\nSee everything's funny 'till that ass gettin trashed\nI'm gettin dirty money like my stash need a bath\nSee boys, if it don't make sense then it don't make dollas\nWhen broke niggas holla I just pop my collas\nThe dope boys get it, yeah the dope boys cool\nBut the white boys say, they be like Nicki rules\nLike ya got money, cause you're sittin on dubs\nWhere your company nigga where your pay stubs\nLook I'm on the grind and I'm lookin for the grub\n50 in the club and we lookin for the bub\nTalkin bout you wanna interjoin me\nFirst you gon' need to get a couple employees, get it\nGet your money right, get your money right, right\nThen you can bite, you know this somethin tight, tight\nYou know I smoke bitches, I'm a need a light, light\nCoogi on my coochie size 3, white nikes, YEAH!\nI-I get money, money I got\nI-I get money, money I got\nI-I get money, money I got\nI-I get money, money I got (I, I get it)\nI-I get money, money I got\nM-money I got, M-money I got\nWhile ya'll motherf*ckers was talking that K-Mart shit\nEvery two days my man was movin 4-6 bricks\nAnd I copped me a 5 bedroom house\n2 car garage, 3 full baths, I love it when you run your mouth\nJag in the driveway, sittin right next to the Rover\nBitch I ain't never been over\nBroke ass runnin round talkin bout I'm popped\nBag and shoes bout a g each, bitch what you got\nI keep a fresh pair of sevens on\nBitch you still got 54'11's on, uh\nSince when I gave a f*ck about this rappin shit\nWhile you waitin round for record deals I'm stackin bitch\nI blow your budget in a day, your advance the same night\nBefore you talk next bitch get your game tight\nBitch I get money, money I got\nBitch I don't come outta pocket, I let a nigga cop it\nI-I get money, money I got\nI-I get money, money I got\nI-I get money, money I got (I get it)\nI-I get money, money I got (I, I, I get it)\nI-I get money, money I got (I, I, I get it)\nM-money I got, M-money I got (yeah, I run new york)\nI-I get money, money I got (I, I get it)\nI-I get money, money I got (I, I get it)\nI-I get money, money I got (I, I get it)\nM-money I got, M-money I got\nThe bank don't stop cause they put me in cuffs\nStill made money up in the can, what the f*ck?\nI'll have a baby by you baby, if you a billionaire\nWrite the check before I come, just sign right here\nI'm a stay rich, I ain't gon die tryna spend my shit\nI'm a die tryna spend your shit\nNowadays these rap niggas on some feminine shit\nSo I guess Queen B gon be the man of this shit\nLaughin at these rap bitches on some amateur shit\nThey better off makin a livin on some janitor shit\nWho the hell is this chick\nShe been out kinda long\nHad 1 hot song, I'm sorry I missed it\nToo busy being conceited, puttin on my lipstick\nTakin trips out in Cali, chillin with the Hiltons\nYeah, I'm chillin\nKim top billin\nWith the top down, throwin money through the ceiling, I get it!\nThe lifestyle you only rap about, I live it!\nMy man buy me cars that you hoes be rentin!\nI'm classy like the phantom, You a Honda Civic!\nLil Kim got your whole bank stock, I get it!\nBustin shots\nB-Bustin shots, B-Bustin shots\nYeah!\nSee you can call this the Rem-mix\nBut it ain't Rem tho\nIt's Shesus Khryst, I switched up my M.O\nThe BX savior, gimme that paper\nI'm passin out the collection plates\nCause I get gully, bust a shot right at your favorite rapper\nReally kill Hip-Hop\nSee I'm gettin that guap\nHater you just a Rem fan\nI put haters in trunks and I don't mean swim pants\nI talk gun talk and people believe me\nBut that's how I do it when I do it for tv\nTryna stop my cash flow I flips on you assholes\nMy itinerary full, I got mad shows\nI'm goin overseas to see R to the Easy\nAt that currency exchange I get that Euro easy\nAnd my hair be FRESH\nMy gear be FRESH\nI got last year, this year and next cause\nI get money, money I got\nI-I get money, money I got\nI-I get money, money I got\nM-money I got, M-money I got\nI-I get money, money I got\nI-I get money, money I got\nI-I get money, money I got (I, I get it)\nM-money I got, M-money I got", "image": "https://images.genius.com/361fbb0a68e9287bdc9eb1ad1f8099a7.640x640x1.jpg"}], "artist": "Nicki Minaj"}