{"songs": [{"title": "Mixtape", "album": "Coloring Book", "year": "2016-05-13", "lyrics": "[Intro: Young Thug &  Lil Yachty]\nChance the motherfuckin' Rapper\nWith a capitalized, uh, times\nNot the times but you know what I'm saying, the times\nLil Boat\nChance\nThugger!\nLil Boat\n\n[Chorus: Chance the Rapper & Young Thug]\nAm I the only nigga still care about mixtapes? (Hell no!)\nAm I the only nigga still care about mixtapes?\nI'm the only nigga still care about mixtapes\nBad little bitch, wanna know how lips taste\n(She curious, she curious)\nI swear I'm the only nigga still care about mixtapes\nBad little bitch, wanna know how the lips taste\n\n[Verse 1: Chance The Rapper]\nAll I can hear is the third, ayy\nAll I can hear is the third, ayy\nWe don't know none of your words, ayy\nWe don't know none of your words, ayy\nI love my women real tall, ayy\nType that can really play ball, ayy\nYou buy my hat at the park, ayy\nThink I might really play ball, ayy\nI got a link in my bio\nMy bitch do the salsa like pico de gallo\nThey gotta ask if they may, Cinco de Mayo\nHow can they call themselves bosses\nWhen they got so many bosses?\nYou gotta see what your boss say\nI get it straight out the faucet\nI ain't felt like this\nSince the third Drought, third Carter drop\nTold my momma third grade\nI'd be in the third Barbershop\nAnd yeah, my momma got real worried\nWhen she heard college drop\nBut now I call the shots\n\n[Chorus: Chance the Rapper & Young Thug]\nI'm the only nigga still care about mixtapes\nBad little bitch wanna know how lips taste\n(She curious, she curious)\nI swear I'm the only nigga still cares about mixtapes\nBad little bitch wanna know how lips taste\n\n[Verse 2: Young Thug]\nBad little mama, she gettin' it Obama\nShe sting like a bumble bee, hot as the sauna\nShe shine like a Rollie, got that from her momma\nCan't see me, can't be me, I'm ridin' like a panda\nThat booty gon' roll and it's outta control\nAnd these bitches gon' fuck off respect and that loyalty\nAll my bitches lovin' me and they spoil me\nRub me down with that lotion, babe, oil me\nDrinking Actavis, baby I'm showin' me\nIn that choppa I see your perimeter\nChange the culture, cause my ring is a solar\nWait one minute I told you\nYeah, I would like to know you\nYeah, you lucky like clovers\nYeah, the clothes no good\nMama I do it, the racks I pursue it\nJust look at me baby, I came from the sewers\nThey love all the slime ball\nLike they fuck all these cats on your slime dog\nI got me some rings like I'm Bruce Bowen\nI'm ballin' on you like I'm Chris Paul\n\n[Chorus: Chance the Rapper & Young Thug]\nI'm the only nigga still care about mixtapes\nBad little bitch wanna know how lips taste\n(She curious, she curious)\nI swear I'm the only nigga still care about mixtapes\nBad little bitch wanna know how lips taste\n\n[Verse 3: Lil Yachty]\nAm I the only one who really care about cover art?\nGrowing up I ain't have my brother\n'Cause he said the streets gave him a fresh start\nI ain't know what that mean\nI bumped heads with my dean\nDropped out and hit the scene\nNow I'm stunting like bling\nTime and time again, they told me no\nThey told me I wouldn't go\n'Cause in high school all I cared about was hoes\nWell, maybe that shit was my interest\nNow I spend more than they make at my dentist\nAfter \"1 Night\" the fuck thought I was finished?\nI pinned my name to the game like a seamstress\nOh, bitch, I bite like a gator\nFuck them reviews that they put in the paper\nDid what I wanted, didn't care about a hater\nDelivered my tape to the world as a caterer\nOh, they fuck with me cause I'm different\nNew sound, new appearance\nBitch, it's Boat from the 6\nGive a fuck about a bitch\nWalk out, my hand on my dick, I'm the shit\n\n[Chorus: Chance the Rapper & Young Thug]\nI'm the only nigga still care about mixtapes\nBad little bitch wanna know how lips taste\n(She curious, she curious)\nI said am I the only nigga still care about mixtapes\nBad little bitch wanna know how lips taste", "image": "https://images.genius.com/b17a54d05a3de269cc6ea53c3f71f73e.1000x1000x1.jpg"}], "artist": "Chance the Rapper"}