{"songs": [{"title": "Just Like Dope", "album": "You Nasty", "year": null, "lyrics": "[Too $hort]\nIt's that high\nThe pussy's just like dope\nIt's that dope\n\nEven, if, you don't, want no mo'\nEven if you don't want no mo'\nThe pussy's just like dope\n\nFirst time you got a shot, you was hooked\nWhen she walked into your life, you never shoulda looked\nAin't no rehab for pussy, it won't hurt me\nYou just like cigarettes and goin cold turkey\nThat's all you ever think about\nNasty ass hoes'll give you stank mouth\nFirst thing in the morning, she's on your mind\nTwenty minute kisses, all the time\nBomb ass head, hit it from the back\nShe be ridin yo' dick like a horse bareback\nYou ever wonder where she learned that?\nThe bitch'll pull a pimp's perm back\nSpecial handlin, dick's the package\nIt's mine - you gon' let me have it back bitch?\nGood pussy make you fall in love\nYou better say no to drugs\n\nChorus: Too $hort\n\nIt's like heroin (heroin, heroin)\nThe pussy's just like dope\nEven, if, you don't, want no mo'\nThe pussy's just like dope\n\n[Too $hort]\nI chose to say no to drugs\nPussy throw them thangs beat yo' ass like thugs\nHave you whipped, creamin in yo' hand and shit\nCall her every day and can't stand the bitch\nYou old pussy ass sucker niggas\nStill love hoes that fuck other niggas\nCan't tell you nothin, you need counselin\nFuck that shit, keep poundin it\nI'm talkin bout some stay wet\nBustin big nuts in her face shit\nDick thrustin like a spaceship\nRed snapper's what I call that pussy\nWhy you askin stupid questions like would she\nSuck yo' dick -- you ain't know?\nIt was passed down to her from her kinfolks\nMomma and her aunties was freaks\nKryptonite pussy got you weak\n\nChorus\n\n[E-40]\nUh-huh.. OOOH!\nSome of these bitches is garden tools, and I don't mean shovels\nI mean hoes HOES experts at workin they pussy muscles\nLiterally (??) over these hoes, niggas'll fight and scrap for\nBut see I don't play that shit, I beat a bootch down with a belt buckle\nThe first thing you wanna do is go down on a botch, and eat her crabby\nKNOWIN that there botch still got lead in her ass from yesterday\nI'm on your botch -- size 44D bodacious breasts\nBut the bitch got mo' miles on her THAN SOUTHWEST\nDon't, you, get it dis-com-bob-u-la-ted (discombobulated)\nShe used to have a 70's bush - until I shaved it (until I shaved it)\nBeatch, beatch!\nNow you all in front of her momma's house, blowin your horn\n(blowin your horn) All in front of her momma's house, blowin your horn\nSuicide, dial that girl for help?  (help?)\nShot up her fam' BAM, returned to grind on yourself\n\nChorus 2X", "image": "https://images.genius.com/96065abbdb6b1c6563ccc77d191b621b.300x300x1.jpg"}], "artist": "Too $hort"}