{"songs": [{"title": "Stop Talkin’ to the Cops", "album": "Stop Snitchin, Stop Lyin", "year": "2005-12-03", "lyrics": "[Intro: The Game]\nOh!\n50 guess who's back?\nOh!\n50, guess who's back, you bitch ass nigga?\nHahaha! It's The Game nigga, your arch-nemesis\nI see'd your lil movie nigga. That shit was aight\nI swear I see'd this shit, look...\n\"If you was my best friend...\" Hahahaha\nYou got beat out by Chicken Little\nSo that's your name: Chicken Little, bitch!\n\n[Chorus: The Game]\nNigga you run with the coppers\nWord on the streets says you's a snitch\nNigga stop talking to the coppers\nThe whole NYC knows you's a bitch\nNigga we took your choppers\nWe'll hit you up and leave you in a ditch\nNigga you cannot stop us\nSay my name that's only gon' make me rich\n\n[Verse 1: The Game]\nGuess who's back in this motherfucker?\nMore beef than USDA\nNow who the fuck wanna play with the California king\nStash box in all 5 of my cars, nigga\nLiving the California dream\nAnd I ain't gotta pay no cops\nAll I gotta do is make sure Yayo flop\nFirst week 200, that's all he got\nSecond week 68, and the number 10 spot\nThird week 30,000; fourth week you stop\nI guess I'm your psychic friend because of G-Unot\nAnd while you talking on the internet\nI'm loading slugs in the TEC\nConnecticut 5 hours away, and I rent a jet\nTurning Spider Loc against me for your benefit\nI still got love for Cuz but Blood been a vet\nReal niggas ain't hard to find\nCome to your own hood and look under the G-Unot sign\n\n[Chorus: The Game]\nNigga you run with the coppers\nWord on the streets says you's a snitch\nNigga stop talking to the coppers\nThe whole NYC knows you's a bitch\nNigga we took your choppers\nWe'll hit you up and leave you in a ditch\nNigga you cannot stop us\nSay my name that's only gon' make me rich\n\n[Outro: Phat Rat (spoken)]\nG g g g, not!\nYou bitch ass niggas, I'm back\nI been waiting on this, nigga\nYayo! Excuse me, Yay-ho!\nNigga, you first!\nYou bitch ass nigga, this is Phat Rat, nigga!\nMe and you, nigga. Pay per view, nigga!\nWe gon' be the under-card of the main event, nigga\nWith 50-snitch and my nigga, nigga\nAnd we gon' have another fight, nigga\nMy cousin Lisa, nigga\nShe gon' fight, umm, Banks bitch ass nigga\nFor the card under me and you\nYou ho ass nigga\nI couldn't wait til they cut this motherfucking mic on, nigga\nCall my bluff, nigga\nI ain't no rapper, nigga...\nBut I'm rapping, nigga, like you wit that bullshit, nigga\nYou gon' sit yo old ass down, nigga\nYou be 36 in December, nigga\nAftermath, nigga! Black Wall Street, nigga!\nOliver!\nI was on your bitch ass last night on Santa Monica, nigga!\nNigga, I do my research!\nThere's a bunch of homosexuals down there on Santa Monica nigga\nYeah, nigga, I got it on footage --\nChasing your bitch ass, Oliver!\nYou ain't finna fool the people, nigga, let motherfuckers know\nI'mma get yo bitch ass stripped, and take a picture, nigga\nShow your shit swinging because you ain't had the operation, nigga\nTell that bitch ass nigga 50 to pay for that motherfucker to get sliced off, nigga\nSo next time you put some shorts on that video, a big ass bulge gon' be sitting there, nigga\nBecause I got everybody looking for it, nigga\nNigga balls all squished up like that, nigga\nYou bitch motherfucker\nStop snitchin' and stop lyin'!\nNigga talking 'bout Get Rich or Die Tryin', nigga\nYeah nigga, you gon' Die Tryin', nigga!\nNigga Get Rich nigga, bitch ass nigga\nNiggas gon' find out you out there, nigga, tryna\nPay something to happen to somebody; you know where they end up, nigga\nThey already on all of us, nigga!\nLike I tell niggas, nigga, I know about 4 agencies watching me\nSo therefore, yo bitch ass gon' end up in one of these California prisons, nigga!\nThen what you gon' do, nigga?!\nMartha made it but I guarantee you won't, nigga!\nBlack Wall... wait a minute\nTHE Black Wall Street, nigga!\nYou better make sure you respect it, nigga, and say \"the\" --\nT-H-E, nigga, not T-H-A, nigga!\nLa-Di-Da! La-Di-Da!\nNigga, I got hooks and all!\nBrazil and Wilmington, you bitch ass nigga!\n\n[Outro: The Game]\nNigga 50 said that I'm only known in a 8-block radius. Well, nigga, this the motherfucking 8-block radius I wanna be known in. It's motherfucking Beverly Hills, nigga! Shit, how I get here, man? You help me? You ain't help me do shit, sucker ass nigga! I lost fans fucking wit you, nigga! You a motherfucking snitch, the whole world know you a snitch, your whole family know you a snitch, even your son know you a snitch, nigga: Gon' tell his teacher he been acting bad at home, nigga. Put the nigga on punishment, nigga; stop telling on him!", "image": "https://images.genius.com/01f294862dcdd3cf6d179355bd83e8a8.300x300x1.jpg"}], "artist": "The Game"}