{"songs": [{"title": "Can’t Stop, Won’t Stop", "album": "I Got Next", "year": "1997-05-20", "lyrics": "[KRS-One]\nOpen a de herb gate sellin pure ganja\nBabylon come but they undercova\nThey never really want me stop sell ganja\n(They just wanna take a cut of what you make so far!)\nBut I'm not havin it, I load the SLR\nPack the ganja BOOM! They break down the door\nPop-pop! T'ree shots, exchanged at close range\nOut of three Babylon, me hit one in the brain\nPop-pop! Two shots hit da window pane\nI exchanged four shots, I drop and feel pain\nBut I'm not hit, into the bathroom I crawl\nI look out the window, it's a one story fall\nI'm fallin, hit the ground and start crawlin\nSoon I'm walkin 'round, blendin in with the crowd\nAnother day, I got away, I gotta fix this problem someday\nBut the very next day...\n\n[Hook: repeat 2X]\nCan't stop, won't stop - sellin mad izm\nAll comeptition - I gots to get with 'em\nMe nah go jail and me nah go prison\n(Take it to his face kid, diss him!)\n\n[KRS-One]\nI'm in another herb gate like a superstar\nEleven A.M., things are safe so far\nI used to worry 'bout the competition on the block\nBut now the competition on the block is the cops\nAnd even block watch doesn't know where we lay\nWell.. (\"Open up! It's the D.E.A.!\")\nAww man, just when I went for more lead\nThe door opens up, I got a Glock to my forehead\n(\"Get down! Get on the floor!\") I felt the stick, I thought I was dead\nBut I woke up instead in a cell layin on my bed\nI lay back down, then I heard the crack sound\nTwo D.T.'s came in and laid they Glocks down\nOne was whistlin a love song, as he put some gloves on\nI thought to myself, damn something's wrong\nBoom bap! Boom bap against my head\nI fell back on the bed, down to his feet\nThe pain was insane but the hit was sweet\nCause these dumb-ass cops punched me right by the heat\nThe Glock, two shots, three shots they screamin\nThen someone said... (\"Hey wake up kid, you're dreamin!\")\nI said, \"Yo dreamin?! That nightmare was hell\"\nBut as I look around, I was still in my cell\nDamn, I got myself caught up in a jam\nThe D.T. that woke me up was like, WHAT?!\nI wiped the saliva, off my mouth\nThe D.T. said.. (\"Let's make a deal\") No doubt!\nNo question, now we started up the session\nNo need for guessin, yes they want my supplier\nI said, what makes you think there's anyone higher?\nHe said.. (\"Don't be a God damned liar!\")\nYou killed three D.T.'s yesterday, you heard me\nBut still the cops you knocked off yea was dirty\nNow the whole investigation is federal\nWe want you to point out, the rest of the cops that are criminal\nHe continued to say, you can't think it through\nThis whole drug game is BIGGER than you!\nFollow our plan man and you'll be free\nLet me explain one thing so you can see, we\n\n[Hook]\n\n[KRS-One]\nNow I'm back in the herb gate, all wired up\nConstantly thinkin about bein tied up\nSnap out of it - I'm thinkin, \"Damn we like elves!\nThe federal and local cops got wars with themselves;\nAnd I'm in the middle, and can't solve the riddle\nMy nose is runny..\" {*knock at door*} (\"Let me get a 20!\")\nA 20 of the green or a 20 of the brown?\n(\"Gimme the whole pound, clown, or duck down!\") {*gunfire*}\nGod damn, God damn, here we go again\nBut this time I'm set up by my federal friend\nSuddenly I hear.. (\"Yo, move from the door!\") {*two shots*}\nFollowed by the shot sounded like a four-four {*two shots*}\nAfter the violence, then there was silence\nThen I heard.. (\"Hey yo it's us, open up the door!\")\nBut rule number one in this game is self-reliance\nSo I picked up the mini-mac in case they wanted more\nThe door opened up, the feds said WHATTUP?\nThey was stickin you up, so they had to get bucked\nSuddenly a sense of trust came over me\nI thought to myself, \"Well soon I'll be free!\"\nBut as I turned around, I heard the gun go click {*clik-clak*}\nI said wait, but it was too late - {*GUNSHOT*}", "image": "https://images.genius.com/2d8a06de1f39a224dcb05e3e9195e0b4.640x640x1.jpg"}], "artist": "KRS-One"}