{"songs": [{"title": "Built For This (2018 Mix)", "album": null, "year": null, "lyrics": "Build For This Remix\n\n[Verse 1: Method Man]\n\nSort of like Malcolm at the Audubon\nThey coming for me, time is money no Audemar\nSee bar-for-bar, I keep it pushing no R&R\nNo foreign broads and no promotion for foreign cars\nThe game is ours, let’s keep it funky who said he was\nLike Staten Island, Italians bleed spaghetti sauce\nIf y'all ain't shaking or stacking than y'all already lost\nAlready cross the light, Christ I'm ready for em\nPlus anybody that saying no, I’m taking numbers\nI’m taking names, I’ll take your chain take this hunger\nPain, pain, pain\nThen you feel the thunder and rain I don’t talk it like the rainbow\nI get it done and the game y’all\nDo me a favor, don’t ever play with my ball\nNever been a player-hater I just ain't playing with y'all\nYou watching lame but look I’m taking the charge\nGoing hard will get you two shots now I’m facing the charge\n\n[Hook x2: Freddie Gibbs]\nFire up the la let’s go take a ride\nThey might catch you by surprise if you let em slide\nBut if you’re built for this shit then you might survive\nGuess I’ll see you when you wake up on the other side\n\n[Verse 2: 2Pac]\nNow, ever since a nigga was a seed\nOnly thing promised to me was the penitentiary\nStill ballin', ridin' on these niggas ‘cause they lame\nIn a '61 Chevy, still heavy in this game\nCan you feel me? Blame it on my mama, I'm a thug nigga\nUp before the sun rise, quicker than the drug dealers\nTell me if it's on, nigga, then we first to bomb, bust\nOn these bitch-made niggas, hit 'em up\nWestside! Ain't nobody loved me as a broke nigga\nFinger on the trigger, Lord forgive me if I smoke niggas\nI love my females strapped, then fuck her from the back\nI get my currency in stacks, California is where I'm at\nRidin', passed by while these niggas wondered why\nI got shot but didn't die, let 'em see who's next to try\nDid I cry? Hell nah, nigga, tears shed\nFor all my homies in the pen, many peers dead; a nigga still ballin'\n\n[Hook x2: Freddie Gibbs]\n\nFire up the la let’s go take a ride\nThey might catch you by surprise if you let em slide\nBut if you’re built for this shit then you might survive\nGuess I’ll see you when you wake up on the other side\n\n[Verse 3: Ice Cube]\nThe world is mine nigga get back\nDon't mess with my stack the gauge is racked\nAbout to drop the bomb I'm the Westcoast don\nBig fish in a small pond\nNow the feds trying to throw they book at the crook\nBut I shook they worm and they hook\nGuppies hold they breath. They want to miss me when I'm tipsy\nRunning everything westside of the Mississippi\nIts the unseen, pulling strings with my pinky ring\nWe got your woman, pucker up 'fore we fuck her up\nBow down before I make a phone call\nGot 25 niggas running up on y'all\nFor the cheese we want them keys\nEverybody freeze on your knees, butt naked please\nBefore any of you guppies get heart\nNigga rewind my part fool\n\n[Hook x2: Freddie Gibbs]\n\nFire up the la let’s go take a ride\nThey might catch you by surprise if you let em slide\nBut if you’re built for this shit then you might survive\nGuess I’ll see you when you wake up on the other side\n\n[Verse 4: 2Pac]\nNow everybody wanna see us dead\nTwo murdered on the front page\nShot to death, bullets to the head\nNiggas holla out my name and it's similar to rape\nMotherfuckers know I'm comin', so they runnin' to they graves\nWatch! Swoop down with my nigga from the Pound\n‘Cause Trick don't give a fuck\nWhere you coward niggas now?\nBlast, keep pumpin', ain't worried about nothin'\nBusters thought we was frontin'\nSo reload and keep dumpin'; still ballin'\n\n[Verse 5: Eazy-E]\n\nSeven-thousand, four hundred, twenty three grains\nOf sand drop from the hourglass\nIt's how much time I got left on this planet\nSome motherfucker's gotta die!\nI'm an evil motherfucker ready to tear shit up\nI'm gonna put these things on you, and never let up\nSee, my momma...she was wrong when I was born\nThat a nigga like E should'a never been born\nToo late, big mistake in '72\nIt's '92, now the year of code blue\n15 hours..11 minutes..30 seconds\nI'm a motherfuckin' wreck\nGonna pay back niggas who did me wrong in the past\nMy days ain't long\nI'm comin' strong and fast\nLock up 8 niggs..kill up 10 pigs\nInnocent and fuckers are also dyin, too\nNow what else can I do?\nFuck, fuck, fuck and plant my seeds\nLeavin' kids in this world like me\nThe lunatic psycho mutherfucka Eazy-E\n\n[Hook x2: Freddie Gibbs]\nFire up the la let’s go take a ride\nThey might catch you by surprise if you let em slide\nBut if you’re built for this shit then you might survive\nGuess I’ll see you when you wake up on the other side", "image": "https://images.genius.com/fe6629f7a5e6af0aa38ca87547ced96f.1000x562x1.jpg"}], "artist": "Method Man"}