{"songs": [{"title": "Groupie", "album": "Everready [The Religion]", "year": "2007-06-07", "lyrics": "[Intro: Sheena from St. Louis]\nHey, baby. I was callin' to say that I- I... I miss you\nI'll do anything to be with you, baby, call me back\nThis is Sheena from St. Louis, call me back!\n\n[Hook: Krizz Kaliko]\nYou're just a groupie (Who, me?)\nBut you mean much more to me\nThan just a groupie (Who, me?)\n'Cause the things you do to me\nShe's just a groupie (Who, me?)\nBut she means much more to me\nThan just a groupie (Who, me?)\n'Cause the things you do to me\n\n[Verse 1: Kutt Calhoun]\nThe Hostile Takeover, oowee!\nI met a Apple Bottom, San Jo model, like to swallow (Groupie!)\nHuh, wonderin' if mami gon' choose me\nFuck it, let the Grey Goose and Cranberry Tropical lead her to me\nThen I'll holla, I'm actin' all non-chalant, you eyeing me\nSort of obli-vi-ous to my dogs comments\nYou need a mental connection from stress relief (I'll offer)\nAs soon as the pill kick in watch the panty hose fall off her\nAnd twenty minutes later, mami's on E\nAnd she can't keep her little groupie hands off me\nNow her mouth is around my dick\nThen we fuckin' and sex-ercising\nI'm in her hole, Off in her soul\nLovin' my extra sized (dick)\nWhenever I call, I can hit it\nShe love some Kutta\nWhenever I'm dwellin' on that encounter it makes me stutter\n'Cause I, I, uhh (Dammit)\nWon't even try y'all\nPop it and knock yo shit outta socket like Houston's eye ball, 'cause\n\n[Hook: Krizz Kaliko]\nYou're just a groupie (Who, me?)\nBut you mean much more to me\nThan just a groupie (Who, me?)\n'Cause the things you do to me\nShe's just a groupie (Who, me?)\nBut she means much more to me\nThan just a groupie (Who, me?)\n'Cause the things you do to me\n\n[Verse 2: Krizz Kaliko]\nRoad again, I met a lot of groupies\nI got a California, Colorado, Kansas City (Groupie!)\nAnd ooh-wee! Wasn't s'posed to choose me\nSomethin' I said to her maybe made her give it to me\nCaribou got you woozy too\nGot ya doing things you wouldn't usually do\nAnd ooh, I love womens\nGotta find a way to get 'em on the bus and outta their linens\nI make 'em strip for me (Damn)\nIt's the shit homie (Woo!)\nTreats me somethin' nice\nBeast, we somethin' like\nGimme Felicia O!\nKnow how to do it right\nWhen you see the Snake and the Bat\nKnow where yo girlfriend at\n'Cause every time you turn yo back\nShe be with them rapper cats\nLet her on the bus to braid my cornrows\nBut when I start pourin' those, we makin' pornos\nTo me you much more than a S-L-U-T\n(She's a groupie!)\n\n[Hook: Krizz Kaliko]\nYou're just a groupie (Who, me?)\nBut you mean much more to me\nThan just a groupie (Who, me?)\n'Cause the things you do to me\nShe's just a groupie (Who, me?)\nBut she means much more to me\nThan just a groupie (Who, me?)\n'Cause the things you do to me\n\n[Interlude: Shannon from Washington]\nHey, I was just thinkin' about the time we had on the stairs\nI'd have to say, that was a first *Laughs* Call me back\nI wanna tell you about this crazy dream I've been havin' about you, baby\nThis is Shannon from Washington, I miss you\n\n[Verse 3: Tech N9ne]\nWhat's sizzlin pigeon? When I'm thizzin' I need a\nSupercalianimalistic, sex me à la (Groupie!)\nAnd I don't care if she fair with the long hair\nBut as long as we there, bare and I bone\nAnd we share squares on the stairs of my hotel\nIf they stare at us, oh well\n'Cause your boyfriend's waitin' while I'm breakin' your swole tail\nAnd your boyfriend hates, while he pace, cryin' a storm in the lobby\nWhen you get to the house you fight like Foreman and Ali\nBut check it, gave you an autograph\nOn your calf then I dashed\nBut I didn't know that it'd be a tattoo the next time I saw your ass\nShe got on my bus, I was like \"Holy shit\"\nShe laid on the couch opened her legs and said, \"You owe me this\"\nI'm the answer to your girls groupie pains, oochie coochie dames tempt me\nWhen in my presence they tell me, \"Pinch me\"\n'Cause I'm exciting baby, if I didn't exist\nSexy female scientists would have to invent me\n\n[Hook: Krizz Kaliko]\nYou're just a groupie (Who, me?)\nBut you mean much more to me\nThan just a groupie (Who, me?)\n'Cause the things you do to me\nShe's just a groupie (Who, me?)\nBut she means much more to me\nThan just a groupie (Who, me?)\n'Cause the things you do to me\n\n[Outro: Krizz Kaliko]\nSee I'm tryna keep it quiet\nTryna keep it on the low\nAin't gon' let you bust a while\nOpen up but what's at home\n\nShe's  just a groupie\nBut she means much more to me\nThan just a groupie\n'Cause the things you do to me", "image": "https://images.genius.com/03fc1f30c3a9ab069072c2b38b117ffe.999x1000x1.jpg"}], "artist": "Tech N9ne"}