{"songs": [{"title": "Fuck Santa", "album": null, "year": "2008-12-17", "lyrics": "After the joy, half laughter the book\nOf the kids favorite motherfucking chapter\nNo need to be a actor (cover up with quilt)\nSo the fat nigga could drink my motherfucking milk\nI wan't some gold bapes I want a prom date\nSloppy ass musty bitch, that's overweight\nI wan't a new piano,record deal, new pills, therapist\nI'm pissed (Somebody give me a hug)\nJingle balls and I'm fucking Mrs. Clause\nHave her climbing up the wall, while he givin' ya'll gifts\nHe ain't never gave me shit\nMy mom bought the wrapping, and the shit that influenced\nMe to start rapping. It's not a joke, chilling with the Polar Bear\nThat used to work for coke, santa's sniffin' coke\nMy Santa Letter Wrote\nFuck you, whiney Malcolm X movie, try me\nAnd I'm stealing Harry Potter's Cloak\n\nMiddle East was his birthday, 25th I'd rather get gifts\nSo why the fuck would I go out my way to celebrate birthday\nI'm selfish what the fuck I look like buying a gift\nHide em, bed under the couch\nRad kid done smashed they motherfucking ginger house\nAnd Jesus don't know me, he ain't my homie\nOur friendship sits on a self\nSanta go and molest an elf\n\nPrancer, Jingle, Rudolf\nDrunk driving at night, a peppermint Smirnoff\nSanta little buzz, and forgot to switch gears off\nMy childhood is here, never ever ever smirnoff\nSnowman robbing little girl, boys, for toys\nAnd G.I. Joes, and here his fat ass go on my roof\nLike Ho Ho (Ho Ho Ho)\n\nChristmas tree's green, and this time of year clean\nMake me wanna go and do things (like)\nNigga's in a tinsel, sleighbell blow whistle\nAlana, Raquel, hope ya'll under the missle-toe\nThe house is decorated, and man I'm frustrated\nCause' I didn't get shit that I really wanted\nNew Years zoom like a mother fucking Mazda\nBut at the end I wanna' know what the fuck is Kwanzaa?\n\n(What is it? Nobody Knows...Nobody Knows\nAnybody?)\n(O.F.M Banging on your FM.)\n\nMerry Christmas, Happy Holidays\nFuck It, I'm still a kid\nBout' to go have a snowball fight\nIn the middle of LA\nSteal some Christmas trees, set em' on fire\nEat some gingerbread cookies\nShit, I don't know\nIt's the time to enjoy life\nYou Know?\nHappy Holidays from us at Odd Future\nAnd, Fuck you. Fuck You. Fuck You", "image": "https://images.genius.com/610384882ca6311db99de4fbfcdf2b46.421x421x1.jpg"}], "artist": "Tyler, The Creator"}