{"songs": [{"title": "Smoke Weed Everyday (Hedegaard Remix)", "album": null, "year": "2011-05-30", "lyrics": "Da da da da daa\nIt's tha mothafuckin' D oh double G\n(Snoop Dogg)\nDa da da da daa\nYou know I'm mobbin' with the D R E\n\nSmoke weed everyday\nSm-s-s-s-smoke weed everyday\nSmoke weed everyday\nSm-s-s-s-smoke weed everyday\nSmoke weed everyday\nSm-s-s-s-smoke weed everyday\n\nYeah yeah yeah\nYou know who's back up in this mothafucker\n\nWhat what what what\nSo blaze the weed out there\nBlaze it up\nBlaze that shit up nigga\nYeah, waz up Snoop?\n\nTop Dogg buy them all nigga burn this shit up\nD P G C my nigga turn that shit up\nCPT, LBC yeah we hookin' back up\nN' when they bang this in the club baby, you gotta get up\n\nThug niggas, drug dealers yeah they givin' it up\nLow life, your life boy we livin' it up\nTake a chance that's why we dancin' in the party fo' sho'\nSlip my ho a forty four n' she crept in it back do'\n\nBitches lookin' at me strange but you know I don't care\nStep up in this mothafucker just to swingin' my hair\nBitch quit talkin', Crip walk if you down with the set\nTake a bullet with some dick take this dope from this jet\n\nOutta town put it down for father of rap\nN' if your ass get crack bitch shut your trap\nCome back get back that's the part of success\nN' if you believe the X, then you'll relievin' your stress\n\nDa da da da daa\nIt's the mothafuckin' D R E\nDr. Dre mothafucker, what what what what\nDa da da da daa\n\nYou know I'm mobbing with the D oh double G\nStraight off the fuckin' street's of CPT\nKing of the beats n' you ride to em' in your fleet wood\n(Fleet wood)\nOr Coupe DeVille rollin' on dubs\n\nHow you feel?\nWhoopty whoop nigga what?\nDre n' snoop chroniced out\nIn the 'llac with doc in the back\n\nSippin' 'gnac, clip in the strap\nDippin' through hoods\nWhat hoods? Compton, Long Beach, Ingelwood\nSouth Central out to the West side\n(West side)\n\nIt's California love this California bud\nGot a nigga gang of pub\nI'm on one, I might bail up in the Century Club\nWith my jeans on n' my team's strong\n\nGet my drink on n' my smoke on\nThen go home with somethin' to poke on\n(Waz up bitch)\nLoc' it's on for the two triple, oh\nComin' real it's the next episode\n\nHold up, hey\nFor my niggas who be thinkin' we soft\nWe don't play\nWe gonna rockin' 'til the weels fall of\n\nHold up, hey\nFor my niggas who be acting to bold\nTake a seat\nHope you ready for the next episode, hey\nSmoke weed every day", "image": "https://images.genius.com/bf3badae49c33b583126057638078bd8.576x576x1.jpg"}], "artist": "Dr. Dre"}