{"songs": [{"title": "It’s Time I See You", "album": "Kiss Tha Game Goodbye", "year": "2001-08-07", "lyrics": "[Drag-On]\nYeah! Yeah! Yeah!\nFuck y'all niggas talkin 'bout huh?\n[\"It's Time I See You\"]\nGet it right, you faggot niggas heard Suge Knight\nDouble R's the only niggas he respect and, y'all niggas shook right?\nY'all get on Hot 97 and, talk wit a baritone\nWit two niggas downstairs with licensed guns to take y'all home\nScared ass niggas, you think they gon take a life so they can get life [nope]\nAsk Puff they ain't tryin to hear that nigga\nFor no cake, and y'all can get at us on Labor Day\nWe make stones that say pay ya debt on your moms labor day\nI'm in the hood so we can link up, any place you think of\nHandheld don't hold prints plus I burnt the tip of my fingers\nI'm a Bronx gangsta nigga, double R's hoodrat\nThe nigga they come get quick bitch, on this hood shit\n\n[Cross]\nY'all bitches think the Ryders a joke, well I don't play [let's go]\nI blow you whole fuckin shit up like Tim McVeigh\nGimme the needle, not tomorrow, but today\nCross comin y'all better get the fuck out the way\nI ain't the shit that you see that's on the top of your church\nI put a bomb in your baby carriage, brick through your hearse\n\n[Infa-Red]\nTell your CEO, don't call my CEO apologizin\nI'm at your wake in the choir standin harmonizin\nIt's Infa-Red the shit that be on top of the heater\nThe best thing in New York since Steinbrenner signed Jeter\nHold Camby sister the hostage, then send 'em a reef\nSo stop frontin vegetarian, y'all scared of beef\n\n[Eve]\nYo, ay suck my dick bitch, the way this chick spit ridickliss\nHere we go again, only we on Kiss shit\nWe comin and you keep runnin\nYou keep claimin you the best that done it\nPussy let me see somethin\nFake niggas screamin \"Ride or Die\"\nSame niggas we run up on and make 'em cry\nOutta all the camps in this game, nigga\nWe the champs in this game\nWho kick the real shit before the fame\nFuck you fat ass, fake bad ass niggas\nStill play the hood while you ride past niggas\nCoward trust me, we keep it gutter\nHope you stay mad a hater cuz you can't touch us, huh\n\n\"It's Time I See You\"\n\n[Styles]\nAyo, I ain't got a care in the world\nKidnappin your kid, maimin your mom, and airin' your girl\nAnd like, you ain't got a care in the world\nI'm hopeless and numb, I can't see but I can focus my gun\nAnd I'm back to smokin blunts to the head\nMy nerves is shot, my paces is short, I dump in your head\nI'm the hardest nigga out you outta know it by now\nI'm the nigga that they talk about goin to Chao\nAnd my name ring bells, my blade stay bloody\nIf you heard about me beefin dog I leave the most shells\nThe nigga to salute, the quickest to shoot\nHoliday Styles, motherfucker, givin you hell\n\n[Sheek]\nWhat? Like I won't run up and break your jaw\nLike they make a vest for your head to stop the 4\nI'm tired of rappin, let's get the mack and send niggas on vacation\nRight in front of the radio station\nMotherfuckers ain't quiet til the Tec go off\nArteries hitted, hawkin, they neck is shit\nI'm the motherfuckin hardest\nI smack the shit out of any one of your artists\nWhatever the label\nY'all niggas don't want beef, y'all want meat at the table\nAnd I don't give a fuck, Sheek'll do life in the box\nBefore any of y'all bitch niggas front on The LOX\nWhat? Motherfuckers, c'mon\n\n[Jadakiss]\nYo, If I miss your head and your neck, I'll hurt your chest\nIf you from the streets betrayal is worse than death\nAnd I'm known for gettin money, not known for wildin\nBut I'm real I could rock both phones in the island\nThis is how we even the bets\nI kill everything you love dog, right now, even the pets\nEverything got dubs on it, even the vets\n50 close, then 50 wide, even the sets\nCause the bullets is like calisthenics when I'm squirtin\nWhen they start hurtin, that means they workin\nOnly way we comin is hard\nIndustry is like jail nigga, double R's runnin the yard, uh", "image": "https://images.genius.com/659c95067dc52688c5cb0888483ceafc.640x640x1.jpg"}], "artist": "Jadakiss"}