{"songs": [{"title": "First Place Winner", "album": "The Drought Is Over 6 (The Reincarnation)", "year": "2008-11-26", "lyrics": "[Hook: Swizz Beatz]\nAm I the best? Yes\nAm I the best? Yes\nI'm a first place winner, first place winner\nI'm a first place winner, first place winner\nI ain't never been scared to get-get-get no get no money\nI ain't never been scared to g-g-get no get no money\nI ain't never been scared to get-get-get no get no money\nI ain't never been scared to get no money money money...\n[Repeat]\n\n[Lil Wayne talking over Swizz]\nHahaha, Young Money baby!\nAy! Just because I just said Young Money\nI just made this song a whole lot better\nDoesn't money make everything better?\nFuck it, yeah Young Money, Cash Money\nYoung Money, Cash Money, Young Money, Cash.. Money..\nBig money, beyotch!! hehe\nI know they tired of me\nCause I'm sleeping on them\nI ain't never been scared of getting no money bitch!\n\n[Verse: Lil Wayne]\nWhat the fuck I look like?\nFuck my verse nigga Swizz got the hook right\nDon't look left baby girl just look right\nAnd you gone see us in more red than Suge Knight\nGangbanger yes, soo-woo gang\nAnd if you ain't wit it then you in the food chain\nI'm in that wide body I'mma need two lanes\nBlue seats white paint wetter than new rain\nIt look like a white person, with blue veins\nI keep a black Glock, red dot blue flame\nFeet hanging out the window jock my shoe game\nCause all my kicks fly, like Liu Kang\nHehe, old playa new game\nI'm focused, I'm thinking like I got two brains\nI'm in my prime I feel like a new Wayne\nHow come there is two bitches but ain't no two Waynes?\n{*Wayne over Hook*}\nHehe I don't know what they do but I do thangs\nThis Mr. \"Everytime You See Me Got A New Chain\"\nMy flow crazy, I ain't too sane\nBut I am the shit and they just poop stains\n{*Wayne talking*}\nHaha! Yeah!\nNow all the ladies say, \"ooh Wayne.. ooh Wayne\"\nHehe alright YEAH! AY!\n\n[Hook: Swizz Beatz] - 2X\n\n[Verse: Boo]\nYeah I grind hard (grind hard) but I shine harder (harder)\nMy watch stupid (stupid) my chain retarded (-tarded)\nCLS-500, the kid Broadus\nB double O, still gettin in pimpin\nWe might got the same car but my rims different\nPlus a sexy lil fine bitch come with it\nYoung Money we the flyest crew (flyest crew)\nRappers we can't see y'all, who are you? (who are you?)\nSpit it's your turn jack do what ya do (Currensy)\nMack still spitting like he new and improved (Mack Maine)\nWeezy and the Pimp are just shittin on fools\nAnd you know me jack I got work to move (yeah)\n\n[Hook: Swizz Beatz]\n\n[Verse: Curren$y]\nYeah Young Money in the house\nMotherfuck anybody else who in the house\nMy niggas with me so you know it's guns in the house\nThe cops'll grab a roll of yellow tape and run around your house\nWhy y'all fuckin with Lil Spitta?\nI wasn't doing nothing just laid up chillin\nPlaying Tony Hawk on the Xbox, burnin incense\nRocking sweat pants and some Jordan number sixes\nMy check cleared I'm officially a rich nigga\nSo from this day I'mma smile in all my pictures\nGet the champagne from the top shelf\nThe crib got wings like a jet, one east one west\n\n[Hook: Swizz Beatz]\n\n[Verse: Mack Maine]\nBitch I'm Mack Maaaaaaine\nI'm psycho, like no, other motherfucker\nAnd I'm in this bitch hollerin Young Money motherfucker\nIt's Mack Maine I make my money speak latin\nAnd I'm comfortable like my sheet satin\nThe kush got me higher than an old hooker's skirt (skirt)\nAnd I never been to culinary school but cook work (cheah)\nI'm no sergeant homie so I never cuff a ho\nAnd I hustle for my +Bills+ like I'm from Buffalo\nYa figga deal - but on the really-real\nPause the clock my flow timeless\nSay my name and lose your job like you're Don Imus (fuck you)\nI'm just a, real nigga, Mack Mizzle\nI'm off the hizzle, with two pistols now\n\n[Hook: Swizz Beatz]", "image": "https://images.genius.com/3f99fb60638817d357014fe4a769ff57.320x320x1.jpg"}], "artist": "Lil Wayne"}