{"songs": [{"title": "The Awesome", "album": "Poindexter", "year": "2009-09-17", "lyrics": "[Hook: MC Chris]\nI am the awesome\nYou see me flossin', watch me walk upon your face\nMake that incision\nI leave you itchin' just to join my monster race\nSay I'm just messin'\nYea well I'm pissed and I can keep an even key\nYou think you know me\nBut you can blow me cause you don't know how I feel\n\n[Verse 1: Childish Gambino]\nIt's Childish Gambino, ho\nWhat you know about that?\nNiggas 'fraid to go outside, they some house cats\nCause if they see me, they might have to act right\nI'm livin' life right, like I got a past life\nBoy I got a flashlight\nCheck my fuckin' hoodie skin\nLike God was makin' light and threw my hoodie in\nBambi, naw nigga that's my pseudonym\nCall me Elroy\nNigga we some hooligans\nAnd just in case, I keep a million in the glove box\nBlast this shit from in your car to make the hood rock\nIce cold, bright colors, like a juice pop\nAnd if you try to touch my shit I'll make your juice pop\nYes I get a two spot just for fuckin' showin' up\nBoy it's me, T.N.T., boy I'm blowin' up\nNigga throw it up\nBoy, I am the awesome\nCall me Elroy\nOr Mr. \"Hey, how much it cost him\"\n\n[Hook: MC Chris]\n\n[Verse 2: MC Chris]\nOkay!\nRackin' 'em, stackin' 'em, packin' these ballers\nBleedin' These hoes I carve ‘em with a big carver\nStiff Like Barbara's\nI pack a punch like a bunch of starbursts\nBack up ma, let me celebrate your suit\nLike five toes cuz you gonna get the boot\nLike five guys cuz ____________\nUnderground sound I reiterate “Roots” what the minute men lose, what the little man grew, his crew while they wrestle in the nude, can’t handle the truth, I prefer my own coop\nWith my hand on the mic and my mind on the move\nCryin’-on-The-View, Ridin' the wave, I'ma take a step that you bothered to save\nI can get crunk in a couple of ways", "image": "https://images.genius.com/78bea76bf210cec3130c214f2a4ab5f7.800x800x1.jpg"}], "artist": "Childish Gambino"}