{"songs": [{"title": "I Need Dollas", "album": null, "year": null, "lyrics": "[Hook: Aloe Blacc]\nWell I need a dollar, dollar, a dollar that's what I need\nSaid I need a dollar, dollar, a dollar that's what I need\nAnd I need dollar dollar, a dollar that's what I need\nAnd if I share with you my story would you share your dollar with me\n\n[Verse 1]\nYou know what it is\nBitch it's still none other than the King\nNeed green just to occupy my rubberbands\nHundred grand at a time, keep it coming\nWhen I started I was trapping\nWoke up ballin like \"what happened?\"\nIt's gonna be up to the captain\nLet's just smoke up in this city\nLet me get 100 milli and focus on a billi\nWhat's the muthafuckin dilly nigga? You already know\nProfits at a steady flow, cheddar, paper, fetti, dough\nStay a step ahead of whatever when niggas say he go\nWe never should've let him go to movies, television shows\nAnd who we foolin? He ain't stupid\nHis bankroll just feed his ego\nNo less than 7 zeroes, stimulate bitches libido\nFlow crazy just like Danger Mouse and Cee-Lo\nFrom a kilo to a yacht in Cabo\nChillin like December in Toledo\nHe's so hungry for the money like he's still selling dimes\nGot a mil on his mind, dollar bill at a time\n\n[Hook]\n\n[Verse 2]\nAin't no vacation, working like a Jamaican, mixed with a Hatian\nSeveral different occupations - no exaggeration\n18-20 hour days while you sleeping, my money making money\nPatient I ain't chasin money, 'less the conversation money\nAnd what you saying dunny? Why you talking to me?\nHundred bound a verse, a quarter mil a show, a mil a movie\nPRPS, Gucci, Louis got my head as big as Stewie's\n20 mil's the answer if you ask me how Akoo is doing\nPay me now or keep it moving, no exception, no confusion\nIf we racing to the top, no competition, I'm a shoe-in\nAnd you in my way, don't ruin my date\nFore I pay 100K for them to boo you off stage\nI'm way up front, stop playing, don't front\nUsed to want dough like JC but now I'm thinking Donald Trump\nBob Johnson, Warren Buffett, fuck it, it ain't that tough\nHundred mil stacked up, dollar bills add up..", "image": "https://images.genius.com/68262ccdcbffb87427d31b0d6085c2e3.400x400x1.jpg"}], "artist": "T.I."}