{"songs": [{"title": "Let’s Go On the Run", "album": "The Big Day", "year": "2019-07-26", "lyrics": "[Intro: Chance the Rapper]\nOoh, ooh\nOoh,  ooh\n\n[Chorus: Chance the Rapper]\nHey  there, lovely sister\nWon't you come home to your mister?\nI've got plans to hug and kiss ya\nI've  got plans to hug and hug and hug you\nLet's  go on the run (Ooh, ooh)\nLet's go on the run\nIt's  time to hit the road\nWe got one place to go (Ooh, ooh)\n\n[Verse 1: Chance the Rapper]\nGreaseproof, meep-meep, I feel like Road Runner\nI get my feet loose\nI  got that Superman hidden under my cheap suit\nSittin', just waitin' for Lois to wanna leave too, me too\nI swear we gotta get away anywhere that we can\nJust meet me by the water, I'll be there with the sand\nAnd if it goes left, that's according to plan\nSometimes you gotta chuck the wagon off at the bend\n\n[Verse 2: Knox Fortune]\nShe broke up with her boyfriend\nThe people wanna know what he said\nThey wanna know the way how\nYou can break her heart like that\nDo you know I could see someone with personality?\nSomeone who doesn't think like me\nSomeone who doesn't feel like me\nI wanna run away now\nDoo-doo, doo-doo, doo-doo-doo-doo\nI wanna run away now\nDoo-doo-doo-doo-doo-doo-doo\n(Check, check, check)\nCh-Check it out\n\n[Verse 3: Chance the Rapper & John Witherspoon]\nBaby, we dippin', tell me who's whippin'\nLet's beat the traffic, give it a whippin'\nThese niggas lame\nThey think they different\nWith all that extra ass advice but don't nobody listen\nBaby, I'm deeper than a iceberg with only the tip in\nThat's why you passed the open Mike when I was only Pippen\nI say we move down to Atlanta, get a big ol' house\nWith a giant pair of Timbs just to kick folks out\nGet outta here\nAin't nobody talkin' to you (Ooh, ooh)\nAnd be unbothered (Ooh, ooh)\nAnd be unbothered\nWe'll move farther and farther and farther away (Yeah)\n\n[Chorus: Chance the Rapper]\nHey there, lovely sister\nWon't you come home to your mister?\nI've got plans to hug and kiss ya\nI've got plans to hug and hug and hug you\nLet's go on the run (Ooh, ooh)\nLet's go on the run\nIt's time to hit the road\nWe got one place to go (Ooh, ooh)\n\n[Bridge: Chance the Rapper]\n(Ooh)\nOoh, ooh\n\n[Verse 4: Chance the Rapper]\nDon't hyperventilate\nKeep the lyric cool like Cole Bennett Lemonade\nThe boy got aluminum foil on his dinner plate\nLot of matcha and lattes when it's gettin' late\nThe mattress just can't inflate\nWalk out like a zombie from the stu' and assimilate\nHumans to simulate\nWent into the bed close the lights and dim the drapes\nAlways Matt Damon when you come Jimmy Kimmel late\nTryna fill the shoes Nick Cannon wear, rental skates\nPiss like urinal cakes\nI'm ready, I'm finna take the long ride home like the end of a limo date\nRolled the window down so hard that the window break\nAnd toss out my demo tape\n\n[Outro]\nOoh, ooh", "image": "https://images.genius.com/102754ce389c900531057dd11508c674.1000x1000x1.png"}], "artist": "Chance the Rapper"}