{"songs": [{"title": "All In A Day’s Work", "album": "Compton", "year": "2015-08-07", "lyrics": "[Intro: Jimmy Iovine]\nFear, fear's a powerful thing. I mean it's got a lot of firepower. If you can figure out a way to wrestle that fear to push you from behind rather than to stand in front of you, that's very powerful. I always felt that I had to work harder than the next guy, just to do as well as the next guy. And to do better than the next guy, I had to just kill. And you know, to a certain extent, that's still with me in how I work, you know, I just... go in\n\n[Verse 1: Anderson .Paak]\nSittin' 'bout a hundred stories up, like what the fuck?\nAnd I'm just lookin' at it all\nI'll be right here in Los Angeles, lookin' like a villain layin' low\nNothin' I can do but pack it all up\nGoin' up, but shit, I feel the love\nSpotlight on me and I'm feelin' so rare tonight\nActin' a fool and feelin' alive\nI'm fuckin' flawless like I live in a vault\n\n[Bridge: Anderson .Paak]\nOnly type of livin' I know\n(Only type of living I, only type of living I)\nYeah, see, if it was you, you would've killed yourself by now\n(Only type of living I, only type of living I know)\nIt takes a special kind of mothafucka to live like this\n(Only type of living I)\nAnd they ask me how I do it\n(Only type of living I know)\nMothafucka, just take a look around\n\n[Verse 2: Dr. Dre & Anderson Paak]\nBest believe I'm in the buildin'\nHa, I hear you mothafuckas talkin' and all that, but uh\nNo, no, don't mention me at all\nYeah, comin' live and direct\nAnd I know you feelin' some type of way about it, but uh\nWatch your mouth, I dare your ass to say somethin'\nI thought it was all good (Hey)\nBut now you mothafuckas crossed the line and\nKinda pissin' me off\nAll the fans and all the fame\nAnd though I gave everything to this game, they still complain\nNow what the fuck do y'all expect me to do?\nThere's so much fuckin' pressure\nThere's so much pressure\nAnd it's all in a day's work\n\n[Bridge: Marsha Ambrosius]\nWork, hard\nWorkin' so hard\n24/7, 3-6-5\n365, hard work\nIt's all in a day's work\n\n[Verse 3: Dr. Dre + Anderson .Paak]\nMy whole life, all I ever thought about is grindin'\nEven though my surroundings only showed me crime and violence\nThat was back when a rapper needed guns way more than a stylist\nAnd that was back when I felt like\nRappers was true mothafuckin' riders\nOr even back in the day when I was a fuckin' youngster, man\nShit I was still sayin', \"Fuck the police\"\n(Man, fuck the police)\nBorn and raised in the belly of the beast\n(Mothafuckin' Hub City)\nI had a dream that we was at peace\nBut I was so wrong, so wrong\nY'all too wrapped up in the bullshit and bias\nNow reality TV is talking 'bout pulpits and choirs\nSome of these hoes give less than a fuck\nWhen they runnin' their life story by us\nIt's the worst when I'm in a hotel, like a Hilton, sick and tired\nAnd some of these housewives way too fuckin' desperate\nThese bitches thinkin' fame first\nI can't knock the hustle, shit, it's (All in a day's work)\nBut that's that shit with potential to make the game worse\nShit, it's just somethin' about that Hollywood curse\nThey just thirsty\n\n[Chorus: Anderson .Paak]\nHard times\nI double my grind, fuck the part-time\nStay ready for war, I'm on the front line\nI'm gettin' the feelin' like it's all mine\nIt's becoming the only feeling I know\n(Only type of livin' I) Only type of livin' I know\n(Only type of livin' I) Only type of livin' I know\n(Only type of livin' I) Only type of livin' I know\n(Only type of livin' I know)\n\n[Interlude]\nGonna go to work\nWe gotta work\nWe gotta work\nLet's get back to work\nOn the grind, back to work\nLet's work\n\n[Verse 4: Dr. Dre & Anderson .Paak]\nRich as fuck, but, guess what?\nI'm back to work (Yeah, I'm back to work)\nOverseas, back home, no time to sleep\nI'm back to work (Huh, I'm back to work)\nSo many people that I love, they want my time\nBut I got to work (I'm sorrry, I'm back to work)\nSome of my friends don't understand, shit\nI got to work (Huh, I'm back to work)\nAlways talkin' 'bout bustin' the club\nBut I'm like, \"Fuck that, I gotta work\" (Fuck that, I'm workin')\nIf you really wanna do it like this, shit\nYou better get back to work (I'm workin', huh)\nBack to work, right back to work (Right back to work)\nGotta get back to work (Right back to work)\nShit, right back to work (Right back to work, huh)", "image": "https://images.genius.com/19804ba7a9b6ceb36d0158950514927a.1000x1000x1.jpg"}], "artist": "Dr. Dre"}