{"songs": [{"title": "World Go Round", "album": "Back on My B.S.", "year": "2009-04-06", "lyrics": "[Busta Rhymes]\nLook, it's been a long time, I shouldn'ta left you\nBut now I came back to step through\nThink of how many weak dudes you heard boo\nTime's up, sorry I let you\nListen to them, you see I'm back with a gem\nAnd you knowin that I'mma always keep it hot 'til the end\nAnd again and again, that's how we\n\n[Estelle]\nMake the world go round\nRound, ah-ah-ah-ah-ahh-ahh\nGo round, round, ah-ah-ah-ah-ahh-ahh\nGo round, round, ah-ah-ah-ah-ahh-ahh\nGo round, round, ah-ah-ah-ah go round\n\n[Busta Rhymes]\nAy, AY! Just feel my presence\nBetter than ever, back with a vengeance\nAh hey, slide on baby just ride on\nI give ya, e'rything people rely on\nMy nigga, the heat that meat gets fried on\nStill'll, drop shit to murder the club\nCall it a killa, stand up with my back on the wall\nAnd let her throw her ass, that's what a thug do\nPut it down, rep how we rep, niggas know we ball\nIf you ain't know we bought out the club too\nBaby girl get it - let's swing it\nRight back to the crib then I hit it, she love the way I spit it\nHuh! See when I come they love how I'm movin it\nThey worship the kid and the way I'm really doin it\nShit, make baby girl moist\nI'm steppin in the club, valet the Rolls Royce\n\n[Hook: Estelle]\nFilthy talkin, bottle poppin\nDisco rockin, park, go party\nI feel life, money and Cashmere\nThese things, make the world go round\nRound, ah-ah-ah-ah-ahh-ahh\nGo round, round, ah-ah-ah-ah-ahh-ahh\nGo round, round, ah-ah-ah-ah-ahh-ahh\nGo round, round, ah-ah-ah-ah go round\n\n[Busta Rhymes]\nNow what the hell are you lookin for?\nWatch how a nigga bring the ceilin to the floor\nSee the way I do and get a little raw now\nBreak somethin, see the way we kickin in the door now\nWhen I come see a Range and a Porsche now\nDo what I say, women to the floor now\nMore is what I'm comin to get\nWorld tours now, nigga charter the jet\nGot, women sweatin and they ready and they willin I\nCome to the telly and they steady doin the diddy bop\nHit you with it, sh-sh-sh-sh-shorty gettin really hot\nPretty with it, the way a bitch can make the city stop\nWhyle all night, mami know the routine\nStyle so right - and I'm creatin a new scene\nBass seem to make mami come and put it on ya\nWhile I give it to ya cause you know I'm back to DO IT for ya!\n\n[Hook]\n\n[Busta Rhymes]\nAnd away we go - off to the next spot\nFirst 5 is a little club kinda hot\nFirst on the scene, see the blunt fire spark\nSnatch shorty, take her to the corner where it's dark\nNow, shorty breathin all heavy, hands all on me\nThen she turn around and try to put her ass on me\nI ain't payin no mind\n'til I seen her crew waitin on the Soul Train line\nNow, shorty workin hard tryin to get with me\nWanna take me to the bathroom tryin to give me quickie\nBut - I ain't trickin on 'em like my name Tricky\nWhen they smell my cologne they wanna try to give me hickie\nLike kissin and huggin and suckin on my wrist full of diamonds\nMove slow, I'll tuck your little chick in my pocket\nType of shit I do all day\nLike the last broad to the show stay, okay?\n\n[Hook]", "image": "https://images.genius.com/f98950948e4d586d256bb83ec370957b.180x180x1.jpg"}], "artist": "Busta Rhymes"}