{"songs": [{"title": "Get Back Up", "album": "No Mercy", "year": "2012-07-22", "lyrics": "[Hook: Anna]\nYou can't let nobody stand in your way\nYou've just got to get back up yeah, you've just gotta get back up, ho-oh\nAnd take down everything that you cannot change now\nYou've just got to get back up yeah, you've just gotta get back up, ho-oh\n\n[Verse 1: T.I.]\nHey, what it is, world? Yeah, it's me again\nBack before you, at your mercy, on bended knee again\nNo runnin' from the truth, as much as we pretend\nThat it ain't what it is, then it hits CNN\nApologies to my fans and my closest friends (I'm sorry)\nFor lettin' you down, I won't take you down this road again (uh-uh)\nMost of you now sayin' \"Whatever, here we go again\"\nBlogs, radio and television all goin' in\nI laugh to keep from crying through all of the embarrassment (I gotta say)\nI gotta say you fuckin' haters is hilarious (ha-ha!)\nHow dare you sit right there and act as if you holier than thou?\nPoint your finger now with me looking down (down)\nSame clown that was twitpicking at my wedding\nOn the same Twitter page disrespecting, wait a second\nNever mind my imperfections, this a fact, remember that\nNo mistake's too great to recover and bounce back\n\n[Hook]\n\n[Verse 2: Eminem]\nIf I could capture the rage of today's youth and bottle it\nCrush the glass with my bare hands and swallow it\nThen spit it back in the faces of you racists\nAnd hypocrites who think the same shit but don't say shit\nYou Liberaces, Versaces and you Nazis\nWatch me cause you thinkin' you got me in this hot seat\nYou motherfuckers wanna judge me cause you're not me\nYou'll never stop me, I'm top speed as you pop me\nI came to save these new generations of babies\nFrom parents who failed to raise 'em cause they're lazy\nTo grow to praise me, I'm makin' 'em go crazy\nThat's how I got this whole nation to embrace me\nAnd you fugazi if you think I'ma admit wrong\nI cripple any hypocritic critic I'm sic'd on\nAnd this song is for any kid who gets picked on\nA sick song to retaliate to and it's called\nThis kind of music, use it and you get amped to do shit\n\n[Hook]\n\n[Verse 3: Lupe Fiasco]\nNow we can say it ain't our fault if we never heard it\nBut if we know better, then we probably deserve it\nJihad is not a holy war, where's that in the worship?\nMurdering is not Islam, and you are not observant\nAnd you are not a Muslim\nIsrael don't take my side cause look how far you've pushed them\nWalk with me into the ghetto, this where all the kush went\nComplain about the liquor store, but what you drinking liquor for?\nComplain about the gloom, but when'd you pick a broom up?\nJust listening to Pac ain't gon' make it stop\nA rebel in your thoughts ain't gon' make it halt\nIf you don't become an actor, you'll never be a factor\nPills with million side effects, take 'em when the pain's felt\nWash them down with diet soda, killing off your brain cells\nCrooked banks around the world would gladly give a loan today\nSo if you ever miss a payment, they can take your home away\n\n[Hook]", "image": "https://images.genius.com/a0e027e4b17def20f1ba1ed5f0629f62.1000x563x1.jpg"}], "artist": "Eminem"}