{"songs": [{"title": "Wise", "album": "Wu-Tang Clan & Friends: Unreleased", "year": null, "lyrics": "[Ghostface Killah]\nI think it happened on a Saturday\nI heard the phone ring, ding, ding\nWho this? 'Vine yo..\nWise guy killed last night by the Tracks\nIt was the same who our niggas teeth up\nSent 'em back, we shoulda thrilled a long time ago\nWe went this recording, now we owe\nThe devil slit trough, without an intro\nYo 'Vine, it can't be!\nWise guest-starring me\nCan it be, we both got hit\nGod legendary, he and General\nHe survived A-dog\nHard to even picture god eaten by gray dogs\nHe stayed in his world\nAnd he sidely sweard\nTo tell the truth, that DeVon was like\n\"Your out of cure boo\"\nWisegod Allah, warrior\nXY chromosome, sat heavy on the throne\nTouched something for you\nYa stupid fail niggas f**ked up\nBecouse bitches is talking\nThey living, i'm twisting\nYou alleybag\nYou killed my man, you killed my man\nAnd you sent him back\nAfter this day, watch your hats\nSlugs flying everywhere\n\nYou could smell heaven in the air\nYou can never get the god, yeah\nNow i'm cypher\nYou've been driving off the same battery\nWe had, back in '91 that got you hyper\nGod been beautiful, god been great\nGod fed you, you died but we survived that day\nYou killed your king, Rakeem Allah\nGave him his life, he was your offspring\nCamouflage dog, days was green\nOne righteous man fought for his right, gods pupil\nYo, that's my fam, we snatch me out of big head van\nWe tought you how to get gain, from sayin' \"peace god\"\nAs long we translate Allah's tounge, spit the language hard\nAlley thoughts, identical twin\nMy alias gasanate, the days close\nThe days close, how'd you know!\n\n[The Dramatics]\nOnce the sun comes out and the rain is gone..\nI know I'm gonna see, a better day\nI know I think I'm crying, becouse of you\nI'm crying, don't want you to see me cry\nLove you Wise, love you Wise, love you Wise!\n\n[Chorus (x3)]\nI wanna go outside, in the rain...\nIt may sound crazy, it may sound crazy\nBut I wanna go outside, in the rain...", "image": "https://images.genius.com/28877affb1f69256e036226f709cc67b.533x533x1.jpg"}], "artist": "Ghostface Killah"}