{"songs": [{"title": "I’m Me", "album": "Tha Carter III", "year": "2007-12-24", "lyrics": "[Intro]\nThe hottest under the sun (who dat?)\nAin't nobody fuckin' with me, man\nAnd you already know that, pimpin'\nCash Money Records, where dreams come true\nFuck up my dream, somebody gon' die tonight\nAnd you already know that, pimpin'\nAye, it's Cash Money Records, man, a lawless gang\n\n[Verse 1]\nUn-fucking-believable! Lil Wayne's the president\nFuck 'em, fuck 'em, fuck 'em, even if they celibate\nI know the game is crazy, it's more crazy than it's ever been\nI'm married to that crazy bitch; call me Kevin Federline\nIt's obvious that he'll be Cash Money 'til the death of him\nThe ground shall break when they bury him—bury him?\nI know one day they got to bury him\nBetter lock my casket tight, baby, so I don't let the Devil in\nPeople, it's just me and my guitar\nYeah, bitch, I'm heavy metallin'\nYou can get the fuckin' Led Zeppelin\nNiggas is bitches, bitches, I think they full of estrogen\nAnd we hold court and take your life for a settlement\nYes, I am the best—and no, I ain't positive, I'm definite\nI know the game like I'm reffin' it\nThis is Tha Carter, Tha Carter 3, the New Testament\nAnd I'm the God, and this is what I bless 'em with\n\n[Chorus]\nBitch, I'm me, I'm me, I'm me, I'm me\nBaby, I'm me, so who you?\nYou're not me, you're not me\nAnd I know that ain't fair, but I don't care\nI'm a motherfuckin' Cash Money Millionaire\nI know that ain't fair, but I don't care\nI'm a motherfuckin' Cash Money Millionaire\nYeah, Junior\n\n[Verse 2]\nIt's Cash Money over everythang\nIt's in my blood, I feel it runnin' in every vein\nI'm from the mud, I am a missile like a Scud\nWhat's really good, I'm 'bout that ruckus like Fudd\nAnd I stayed on my flo' at Cash Money, like a rug\nTied to the fuckin' Birdman like a lug\nAnd dear Mr. Ronald Williams\nTo you I shall forever give thanks like a pilgrim\nCash Money million-heir to the throne\nGoin' at their heads, like hair in a comb\nSittin' by the window, I just stare at the storm\nKnow I'll make it through it like hair in a comb\nYoung Money over bitches, my niggas trust my senses\nAnd I will take a dasher as the Lord is my witness\nAnd you all have witnessed, but I am not finished\nSo keep your mouth closed and let your eyes listen\n\n[Chorus]\nBitch, I'm me, I'm me, I'm me\nBaby, I'm me, so who you?\nYou're not me, you're not me\nAnd I know that ain't fair, but I don't care\nI'm a motherfuckin' Cash Money Millionaire\nI know that ain't fair, but I don't care\nI'm still a motherfuckin' Cash Money Millionaire, bitch\n\n[Verse 3]\nLast year they had the Grammy's and left me in Miami\nSleepin' on a nigga like I'm rappin' in my jammies\nI'm rappin' when you sleep\nI was rappin' when you were in jammies\nMel Gibson flow, Lethal Weapon, book 'em, Danny\nI'm a monster, I tell you, Monster Wayne\nI have just swallowed the key to the House of Pain\nNow I'm stuck here to deal with the house's pain\nFuck with me, I will peel like the house's paint—let's go!\nNiggas don't wanna see me ‘cause I'm better in bold\nThe only time I will depend is when I'm 70 years old\nThat's when I can't hold my shit within, so I shit on myself\n‘Cause I'm so sick and tired of shittin' on everybody else\nI try to tell you like I'm sayin' somethin'\nI'm from the Dirty like the bottom of my pants cuff\nAnd now nothin' gonna stop me, so just envy it\nHey, I'll accept a friendly quit, ha ha\n\n[Chorus]\nBitch, I'm me, I'm me, bitch I'm me\nBaby, I'm me, so who you?\nFuck you , you're not me\nAnd I know that ain't fair, but I don't care\nI'm a motherfuckin' Cash Money Millionaire\nI know that ain't fair, but I don't care\nI'm a motherfuckin' Cash Money Millionaire, bitch!\n\n[Outro]\nThe hottest under the sun (who dat?)\nAin't nobody fuckin' with me, man\nAnd you already know that, pimpin'\nCash Money Records, where dreams come true\n(Who dat?) Somebody gon die tonight\nAnd you already know that, pimpin'\nAye, it's Cash Money Records, man, a lawless gang", "image": "https://images.genius.com/70a7ef69242915a9cd1c3f68031e4c0a.1000x1000x1.jpg"}], "artist": "Lil Wayne"}