{"songs": [{"title": "Say What You Say", "album": "The Eminem Show", "year": "2002-05-21", "lyrics": "[Intro: Dr. Dre & Eminem]\nSo I'm out the game, huh?\nYo, Dre, we ridin'?\nWhatever\nHaha, well, I'm with you, homie\nOkay, let's handle the small shit\n\n[Verse 1: Eminem & Dr. Dre]\nI was born to brew up storms, stir up shit\nKick up dust, cuss 'til I slur up spit\nGrew up too quick, went through too much\nKnew too much shit, corrupt\nAnd I'ma pour it on like syrup, bitch\nThick and rich, sick and twisted, Mr. Buttersworth\nDre told me to milk this shit for what it's worth\n'Til the cow just tilts and tips and stumbles to Earth\nAnd if I fumble a verse, keep going\nFirst take I make, mistakes, just keep it\nNo punches pulled, no punches, that's weak shit\nFake shit, if I ever take shit I'll eat shit\nWasn't for him, wouldn't be shit\nCreep with me as we take a little trip down memory lane\nBeen here longer than anyone in the game\nAnd I ain't got to lie about my age\n(But what about Jermaine?) Fuck Jermaine!\nHe don't belong speaking mine or Timbaland's name\nAnd don't think I don't read your little interviews\nAnd see what you're sayin'\nI'm a giant, and I ain't gotta move 'til I'm provoked\nWhen I see you, I'ma step on you and not even know it\nYou midget, mini-me with a bunch of little mini-yous\nRunning around your backyard swimming pools\nOver 80 million records sold\nAnd I ain't have to do it with 10- or 11-year-olds\n\n[Chorus: Eminem]\n‘Cause what you say is what you say\nSay what you say how you say it whenever you saying it\nJust remember how you said it when you was spraying it\nSo who you playing with, huh? (Huh, huh, huh)\n‘Cause what you say is what you say\nSay what you say how you say it whenever you saying it\nJust remember how you said it when you was spraying it\nSo who you playing with, huh? (Huh, huh, huh)\n\n[Verse 2: Eminem & Dr. Dre]\nSecond verse, it gets worse, it gets no better than this\nAmateurs drink veteran piss from a Dixie cup\nIf you ever mix me up or confuse me\nWith a Canibus or Dre with a Dupri\nWe'll rub it in, every club you're in\nWe'll have you blackballed\nAnd make sure you never rap a-fucking-gain\nDre ain't having it, long as I'm here to play devil's advocate\nIf there was some magic shit I could wave over the industry\nThat could save it when I'm gone and buried\nTo make sure the tradition carries on, I would\nIf I could only use this power for good\nI wouldn't, not even if I could\nFrom the hood, and I'm a hornet\nAnd I'ma only sting when I'm cornered\nAnd I'ma only sucker punch and swing without warning\nAnd swing to knock somebody's fucking head off\n‘Cause I know if they get up\nI won't get a chance to let off another punch\nI'm punk rock, no one's punk\nDon't give a fuck: white-Pac, so much spunk\nWhen I was little I knew I would blow up and sell a mil'\nOr grow up to be Attila, go nuts and be a killer\nAnd I'm something of a phenom, one puff of the chron'\nI'm unstoppable, I'm alive and on top again\nThere's no obstacle that I can't conquer\nSo come along with us (C'mon!)\n\n[Chorus: Eminem]\n‘Cause what you say is what you say\nSay what you say how you say it whenever you saying it\nJust remember how you said it when you was spraying it\nSo who you playing with, huh? (Huh, huh, huh)\n‘Cause what you say is what you say\nSay what you say how you say it whenever you saying it\nJust remember how you said it when you was spraying it\nSo who you playing with, huh? (Huh, huh, huh)\n\n[Verse 3: Dr. Dre & Eminem]\nNow anybody who knows Dre\nKnows I'm about fast cars and Alizé, partying all day\nBut I handled my business, ‘cause it's work before play\nDon't look for trouble, but I'll serve you gourmet\nHowever you want it, you can have it your way\nYou fuck my night up, I'ma fuck up your day\nBullet with your name, sendin' it your way\nThat goes for anyone who walks through that doorway\n‘Cause this is my space, you invade it\nLive to regret it, and you'll die tryin' to violate it\nFuck around, get annihilated, eyes dilated\nHuh, like my old lady\n‘Cause what you say is what you say\nSometimes what you mean is two different things\nDepending on your mood if it swings\nThink too many things, little hit of Dre's weed\nI can do anything, catch a contact and I'm gone\nAnd I'm back, I speed write\nAnd my loose leaf's my launchpad\nAnd I can pull any string; don't have to prove anything\nCatch a contract on your head\nYou headed West, talk shit about Dre\nYou better get a vest and invest\nIn something to protect your head and neck\nAnd it's back and forth all day, like Red and Meth\nI joke when I say I'm the best in the booth\nBut a lot of truth is said in jest\nAnd if I ever do live to be a legend I'ma die a sudden death\nFive mics in The Source? Ain't holding my fucking breath\nBut I'll suffocate for the respect\n'Fore I breathe to collect a fucking check\n\n[Chorus: Eminem]\n‘Cause what you say is what you say\nSay what you say how you say it whenever you saying it\nJust remember how you said it when you was spraying it\nSo who you playing with, huh? (Huh, huh, huh)\n‘Cause what you say is what you say\nSay what you say how you say it whenever you saying it\nJust remember how you said it when you was spraying it\nSo who you playing with, huh? (Huh, huh, huh)\n\n[Outro: Dr. Dre & Timbaland]\nWatch your fucking mouth!\nYo, this' Timbaland, tell him I said suck my dick!", "image": "https://images.genius.com/c43578375ef2ac32c140cc35dfe2fef1.1000x1000x1.png"}], "artist": "Eminem"}