{"songs": [{"title": "Murderous", "album": "The Beautiful Mixtape Vol. 2: The Struggle Continues", "year": null, "lyrics": "[Intro: Kardinal Offishall]\nMurderous!\nKardinal Offishall and Talib Kweli with a new syllabus\nT. Dot, BK stand the fuck up let’s go\nBlack Jays\nIt’s Kardinal Offishall my niggas\nBlack Jays is the team\n\n[Verse 1: Kardinal Offishall]\nThe fireman fire starter rocks harder\nLyrical jihad shit hard living on the boulevard\nFirst hand man with a plan stand up!\nGet the fuck out your Benz\nClean your third eye lens\nGot signed Carties still living in the hood\nFucked up the industry like it’s all good\nEver since I came out and rocked the party\nEvery blood clot rapper want [?]\nAnyways, in many ways we display shit\nThat’s hard to look at like ultraviolet rays\nI stays clean, never fiend for the green\nIf it fucks with my Lou, Black Jays makes a scene\nEasy we breeze through your hood\nMixtapes to passport, eat whack niggas for sport\nSince the days of jam sports me and [?]\nThe plan gave up the hoes, I don’t fuck fans\nBut I fuck with ‘em though, let ‘em know\nT. Dot coming for the title destroying in stereo\nMono mono e mono mind your brain get throttled\n21 and over like a hennesey bottle\nMe and Talib got dibs on the top spot\nAir force ones fresh the colour of crack rock\nRocking your concrete sometime soon\nBlack Jays in your area hungry like noon\nMuthafuckers\n\n[Verse 2: Talib Kweli]\nInternational collector of capital\nPassport pay unnatural black radical\nChilling in Canada when I spit the flow\nI get more chicks in Toronto than a Little X video\nI cross the border with a bird or two\nIt’s personal I got a little merch in this commercial too\nWhat you say perishable in court is inadmissible\nBreak it down everything you spit is bull, it’s pitiful to watch\nI stand out in a city full of hot young spinners\nBlow the spot with the best of the T. Dot, yea\nKweli and Kardinal rock with the official\nWe sharper when we hit and can’t stop to blow a tissue\nDoing way more than an’you\nWhat I spit is finna split you in two\nIt really don’t matter how vocal is you\nI’m not to be confused with those who know\nProvoke the issue attack, I blast back like Africans in Mogadishu\nIn fact, our flashback’s bringing out the Nat Turner in me\nWhere’s the people what’s the word in the street?\nI smash king’s the man atop of your throne\nYour girl’s riding my poem\nI’m like hip hop’s Oliver Stone\nFrom the 718 where the trees grow leaves\nTo fall and change colours like the [?]\nYou be lookin’ like a scene out a Spike Lee flick\nYou ain’t fucking with it, you ain’t tight we sick", "image": "https://images.genius.com/77b2cb0937e1d9604da173026219d5ac.705x706x1.jpg"}], "artist": "Talib Kweli"}