{"songs": [{"title": "Church", "album": "GEMINI", "year": "2017-09-22", "lyrics": "[Verse 1: Macklemore]\nMoms and pops, they used to take us to church\nSaying \"If you don't believe, then the prayin' don't work\"\nWith the beatbox I got free on the pavement, I'm first\nMusic brought me to my knees, I found faith in a verse\nSo dear Spirit, I know I gotta take a chance\nAnd my mistakes and shortcomings finally made a man\nI got some issues, I got problems, gotta make amends\nI watch my daughter giggin' in the kitchen to the safety dance\nThis shit right here, we call love\nYou can't put that into words, but feel that in your gut\nThe goosebumps on my arms, I watch the fallin' sun\nKiss my daughter and say \"Thank God\" as I wake up\nOh I know, yeah, I know now\nAnd I'm up, but I'm aware that it goes down\nTravelled 'round the globe, I needed to slow down\nAnd no better feeling riding 'round in my hometown\n\n[Chorus: Xperience]\nHope I'm feeling this good when it's Monday mornin'\nBeen doing my own thing, can't say that I'm sorry\nAnd I can only pray someday that we'll all be\nMore than just okay, we can be so free\nAnd I can get fly with ya, ride with ya, shine with ya, yeah\nI can get fly with ya, ride with ya, shine with ya, yeah\n\n[Verse 2: Macklemore]\nOh my God, oh my God\nNo other person on this earth could ever take my job\nThis my life, it was planned, I can't take it off\nBruised elbows, knees scraped, I learned to take a fall\nMy mistake, my mistake\nKarma waits, karma waits\nBut I'll be brave, I'll be brave\nThe pain seems more than I could take, I could take\nI learn more from loss than the gain, than the gain\nNew state of mind, I feel like taking my time\nAnd that laidback reclines, still pushing that '85 Lac\nWindows down, city passing by, like a timelapse\nThe weatherman be trippin', so that ceiling got that white rag, ay\nWe came so far, just some kids in the city tryna make some art\nLeave some change in the fountain, hope to make my mark\nYou see I was given a role, never played my part\n\n[Chorus: Xperience]\nHope I'm feeling this good when it's Monday mornin'\nBeen doing my own thing, can't say that I'm sorry\nAnd I can only pray someday that we'll all be\nMore than just okay, we can be so free\nAnd I can get fly with ya, ride with ya, shine with ya, yeah\nI can get fly with ya, ride with ya, shine with ya, yeah\n\n[Outro]\nI can have a life to– I have life today. I rely on that constant communication with my higher power, more so than anybody these days. And I realized, that's kinda all I need. And then, of course, y'all appear, right, y'all appear, things appear, and situations appear. And I realize, that's God working through me, if I allow myself to be that vessel.", "image": "https://images.genius.com/5ea668c903da567bb7c9de7dda4c7b81.1000x1000x1.jpg"}], "artist": "Macklemore"}