{"songs": [{"title": "Wanna Be Heard", "album": "Kendrick Lamar EP", "year": "2009-12-31", "lyrics": "[Intro]\nIt's like I don't think you fully understand who I am, ya know?\nI'm just a good kid from Compton that wanna rap\nI don't represent no colors, I represent my lil' sisters and brothers\nI'm the oldest, nigga\nAnd if you can't respect that, your whole perspective is wack\nCheck it out\n\n[Verse 1]\nI used to wanna rap like Jay-Z\nUntil I finally realized that Jay wasn't me\nI took my time to jot down every line that's a quotable\nCritics say I don't be killing this shit but I know I do\nBecause I used to practice early morning and then after school\nI'm working on my hooks my nigga, I ain't tryna battle you\nBut even if I did, I guarantee I'd overshadow you\nLike a fucked up taper that turned to bowl cut\nI'mma close cut to Common and Gucci Mane\nNow that's a comparison that you probably wouldn't understand\nBecause I can touch the people and still keep it ghetto\nAs an '87 Regal with the tree air freshener on the rearview mirror\nI wear a heart on my shoulder\n'Member when we used to make the boost look like Motorola?\nYour cousin fucked up your room every time he came over\nThen went to jail when we got older\nThat shit is a bad odor, but still I remain focused\nIn due time, I'll be able to swipe my card and it won't say decline\nThat shit's embarrassing huh\nHope no one pay you no mind\nBut it's a bad bitch behind you while you standing in line\nCan you relate to my story? Can you follow my dreams\nAnd admirations that I had ever since I was thirteen?\nMy momma believed in me, she let me use her van to go to the studio\nEven though she know her tank is empty, that's who I do it fo'\nMy pops got a different approach, yeah he believed\nBut he always questioned when I'mma drop my debut CD\nHow long this gon' take nigga? You still haven't ate nigga\nAt twenty-two I had two cars and my own place nigga\nIt's a sacrifice I try to tell him\nThat's when he turn to BET and tell me that he jealous\nOf all these niggas getting money and their shit don't sound like shit\nI ain't tryna kill your confidence or forcing you to quit\nI just wanna hear you heard\n\n[Chorus]\nYep, yep, that's my word\nMake a statement with these nouns and verbs\nI represent the liquor that's poured out on the curb\nListen to my nouns and verbs (Man, I wanna be heard)\nLike a cattle with sheep\nWhile y'all sleep I be up, cooking up all day\nLike a mad scientist in that laboratory\nMotherfuck what a critic got to say, I'ma be heard\n\n[Verse 2]\nWhat up DZYNE? I ain't forgot nigga\nYou developed me, telling me I was hot nigga\nYou believed in me first, that's what's for sure\nAt the church recording, at the garage, but it worked\nBut me and Dave kind of felt you lost the passion\nA lot was going on in your life and you needed space\nBut still I should have came to you first to tell you what happened\nBut I was seventeen and figured it's best I stay away\nAnd I was wrong, I was young and couldn't look you in the eye for what I'd done\nBut I'm telling you we ain't done\nMatter of fact, how's your sons? What they up to?\nRemember they used to run away while you had worked on ProTools?\nPeople I used to be in the booth till four in the morning\nWith school in the morning, yawning, but I was on it\nMe, you and Dave was on it\nBuzzing like Charlotte Hornets when that tape dropped\nWhere them beats nigga? It's been five years since we had rocked\nTime to be heard\n\n[Chorus]\nYep, yep, that's my word\nMake a statement with these nouns and verbs\nI represent the liquor that's poured out on the curb\nListen to my nouns and verbs (Man, I wanna be heard)\nLike a cattle with sheep\nWhile y'all sleep I be up, cooking up all day\nLike a mad scientist in that laboratory\nMotherfuck what a critic got to say, I'ma be heard\n\n[Verse 3]\nSo can you feel it?\nWhen you hear it do it pulsate your spirit?\nDo it make you wanna say motherfuck a gimmick?\nThe truth can set you free if you Do the Right Thing\nWord to Spike Lee, don't he look like Sounwave?\nThat's kinda random, but my humor sometimes strays\nLike a dog in the night\nTwenty-four hours in a day but only take five minutes\nTo grab a pad and a pen, then send your dog a kite\nI spread love like a Hippy, but I'm a Black one\nWith Jesus Christ passion, I swear on the bible\nTabernacle to all my rivals, I ain't mad\nYou hate a nigga for tryna help you, that's your bad\nBecause I figure I can make a way with these stanzas\nI probably can't heal cancer, but I can heal the city\nMy niggas, tell me you with me\nAnd if you is won't you pop my CD in\nOpen up your trunk, then let it bump, so I can be heard\nYeah, uh huh\n\n[Chorus]\nYep, yep, that's my word\nMake a statement with these nouns and verbs\nI represent the liquor that's poured out on the curb\nListen to my nouns and verbs (Man, I wanna be heard)\nLike a cattle with sheep\nWhile y'all sleep I be up, cooking up all day\nLike a mad scientist in that laboratory\nMotherfuck what a critic got to say, I'ma be heard\n\n[Outro]\nD-Dave, what up nigga?\nMatt Jeezy, hahaha...", "image": "https://images.genius.com/de49545ec6453e829bb3ff6d34d088db.1000x1000x1.jpg"}], "artist": "Kendrick Lamar"}