{"songs": [{"title": "That’s Tha Homie", "album": "Malice N Wonderland", "year": "2009-11-03", "lyrics": "[Intro: Snoop]\nDanja!\nWith the most connected\nAnd the most protected\nYa dig?\n\n[Hook: repeat 2X]\nWhen you say my name, when you - when you say my name\nWhen you say my name they gon' say (that's-that's the homie)\nI'm connected everywhere, I'm-I'm connected everywhere (that's the homie)\nEverywhere-everywhere, I'm-I'm-I'm connected everywhere (that's the homie)\n\n[Snoop Dogg]\nEverywhere I go all of the people know my name\nIt's ya big homie Snoopy, just tell 'em you with me\nI got a partner out in Vegas, hook up on the strippers\nHe likes to call them showgirls but Snoopy never tip her\nGot a homie out in Reno, he likes to play Pokeno\nYou get that boy a 20 he'll turn that into a C-note\nI'm known across the planet, you need that Southern fix?\nI got a girl that looks like Janet, she out there in Atlanta\nMy boy out in the Chi-Town, hook up on apparel\nPlus he'll cook you up some shit, he works the kitchen down at Harold's\nMy niggas out in Zone 6, soul food, no sushi mayne\nCookin up the whole thing for Snoop Dogg and Gucci Mane\nMy homegirls out in Brooklyn, bad lil' bitches\nThey boostin like crazy, put my fo' on 26's\nYou want it they can get it, they held me down for summers\nIt's half off on whatever, matter fact take down this number homie\n\n[Hook]\n\n[Snoop Dogg]\nEverywhere I go all of the people know my name\nIt's ya big homie Snoopy, just tell 'em you with me\nI got a homie out in Texas, club scene reckless\nMention Uncle Snoopy he can get you on the guestlist\nRidin through New Orleans, rest in peace Soulja\nSlim, you need some trim, I've got some bitches in the 'Nolia\nCatch me out in M-I-A, what you need a whole pound?\nLittle Haiti, Long Beach, Rollin 20, Zoe Pound\nI got a couple killers, out in Pittsburgh\nYou need a nigga wrapped, you better whisper\nI got what you need, you better know that shit\nYou tryin to pop a biz I'll put you with my Oakland bitch\nI got some partners in Albuquerque, New Mexico\nI say one word they hold your ass and never let you go\nDon't you just sit and wonder, they held me down for summers\nSo when you see 'em comin, matter fact take down they number\n\n[Hook]\n\n[Snoop Dogg]\nEverywhere I go all of the people know my name\nIt's ya big homie Snoopy, just tell 'em you with me\nI got a partner in Nigeria, man he got the heaters\nTrade you Russian bullets for a new pair of sneakers\nWe up in Amsterdam, you like to spark a lot?\nMy boy he like to talk a lot, he own his own coffee shop\nI got a homie in Japan, he always been a fan\nGive you weed by the zip, or by the gram\nYeah... I had a homegirl in Pari'\n'Til the bitch left her nigga now she wanna marry me\nGot a homie in Australia, he showed me where to go\nYou know him as Gladiator, I call him Russell Crowe\nI got a homie in Canada, 150 for a zone\nHe got the purple by the bundles, I'm still high when I get home\nI'm well-connected fool, they held me down for summers\nIt's D-O-double G, matter fact take down my number homie\n\n[Hook] - 1.5X\n\n[Interlude]\nI'm connected everywhere, I'm-I'm connected everywhere (that's the homie)\nEverywhere-everywhere, I'm-I'm-I'm connected everywhere (that's the homie)\nI'm connected everywhere, I'm-I'm connected everywhere (that's the homie)\nEverywhere-everywhere, I'm-I'm-I'm connected everywhere (that's the homie)\n\n[Outro: Snoop]\nJust say Snoop Dogg and watch what they say\nThat's the homie, real talk, no matter where you go\nCity to city, flow to flow\nEven in the penitentiary man\nI'm the homie man, I be lookin out, youknow'mtalkinbout?\nIn the community, I be lookin out\nIn the churches I be lookin out\nAnd if you don't look out\nI'll be in yo' house, lookin out\nYa dig? Cause I am the homie, hehehe\nYeah, Bigg Snoop Dogg\nYour friendly neighborhood Snoop Dogg", "image": "https://images.genius.com/a9730b160b9e646d986f0b4659d2dc40.800x800x1.jpg"}], "artist": "Snoop Dogg"}