{"songs": [{"title": "Ballin’ Uncontrollably", "album": "Straight from the Lab Part 2", "year": "2011-12-18", "lyrics": "[Intro]\nYa, We gots money baby, I'm talking about, talking about that long money, when you see us come through, you just know...\n\n[Hook]\nBallin' uncontrollably, ballin' uncontrollably, ballin' uncontrollably ba-ballin' uncontrollably\nBallin' uncontrollably, ballin' uncontrollably, ballin' uncontrollably ba-ballin' uncontrollably\nBallin' uncontrollably, ballin' uncontrollably, ballin' uncontrollably ba-ba-ba controllably\nBallin' uncontrollably, ballin' uncontrollably, ballin' uncontrollably ba-ballin' uncontrollably\n\n[Verse 1]\nMan, I got everything candy-painted, candy-painted tint, it's so dark\nI'd be lying if I said I ain't hit at least nine of my friends\nPlus, I got so much candy paint in my rims\nPaint be flyin' off my car be candy paintin' the neighborhood kids\nI got that whole block lookin' like it's Candyland\nAsk about me, man, they be like, there go the candy man\nI park the car in the garage and go in and\nCome back the next mornin', the rims are still spinnin'\nHit the doors on that Phantom, man, that shit looks like the Batmobile\nThirty-two inch rims, shit, I ain't even got no wheels\nCustom-fitted, custom-kitted wood grain\nCustom everything, what's that on the seat, custom mustard stain\nNow let's go hit the mall, y'all know that we finna ball\nGet out the car, they be like, ah, there go them superstars\nHit every single store, flash a fuckin' wad of cash\nBut I ain't buying shit, bitch, kiss my candy-painted ass, we\n\n[Hook]\nBallin' uncontrollably, ballin' uncontrollably, ballin' uncontrollably ba-ballin' uncontrollably\nBallin' uncontrollably, ballin' uncontrollably, ballin' uncontrollably ba-ballin' uncontrollably\nBallin' uncontrollably, ballin' uncontrollably, ballin' uncontrollably ba-ba-ba controllably\nBallin' uncontrollably, ballin' uncontrollably, ballin' uncontrollably ba-ballin' uncontrollably\n\n[Verse 2]\nHit the corner liquor store to get Corona, tip the owners\nSipped it on the way out as I dipped, I wanna rip the road up\nAnd I'mma hit the cinema and I'mma get the hoes\nWhen I be at a theater shit, anything goes\nI'm ballin' outta control, girls know I'm loaded with dough\nBut shit, I'm stingy as fuck, I'm fuckin' stingy as hoes\nThese bitches don't get a crumb, and it come but I'm like what up\nShut up, bitch, sit up, get up off them knees, my candy paint's enough\nIf you're lucky, I'll let you hug me, but that's all you get\nThen I'mma split, disappear, a cloud of smoke is all you see\n\n[Hook]\nBallin' uncontrollably, ballin' uncontrollably, ballin' uncontrollably ba-ballin' uncontrollably\nBallin' uncontrollably, ballin' uncontrollably, ballin' uncontrollably ba-ballin' uncontrollably\nBallin' uncontrollably, ballin' uncontrollably, ballin' uncontrollably ba-ba-ba controllably\nBallin' uncontrollably, ballin' uncontrollably, ballin' uncontrollably ba-ballin' uncontrollably\n\n[Verse 3]\nBitch, get the fuck out my car if we ain't finna fuck\nI'm horny as fuck bitch, are you suckin' my dick or what\nI'll fuck a chick in the butt, I really don't give a shit\nIs pretty Marshall gonna have to go choke me a bitch\nYou fuckin' keyed up my Benz bitch, I beat up my friends\nDon't think I won't beat a bitch, I'll kick a six-year-old in the ribs\nYou fuckin' retard, I'll have you suckin' farts out my seat\nI'll teach you not to know how to control your bowels when you eat\nWhat the fuck do you think that colostomy bag is for, looks?\nI ain't waste nine bullets on you for you to not sing no hooks\nI fuckin' take a Make a Wish Foundation patient with me\nHow 'bout some coke inside of your saline solution IV\nTurn around and use it on me, you tryna snort all my keys\nYou fuckin' brat, get in back, you're comin' to Florida with me\nTell your momma I'mma drop you off at the hospital later\nWe finna make this run, take this gun and cover me, Slater and quit your\n\n[Hook]\nBallin' uncontrollably, ballin' uncontrollably, ballin' uncontrollably ba-ballin' uncontrollably\nBallin' uncontrollably, ballin' uncontrollably, ballin' uncontrollably ba-ballin' uncontrollably\nBallin' uncontrollably, ballin' uncontrollably, ballin' uncontrollably ba-ba-ba controllably\nBallin' uncontrollably, ballin' uncontrollably, ballin' uncontrollably ba-ballin' uncontrollably\n\n[Outro]\nTracy, I joined this class cuz I thought I’d be cooking with a partner\nBut she’s never here, and I don’t get twice the credit for all the work\n\nI didn't invent odd numbers Seth\n\nI know, but I’m over here in my unit, every day, cooking my terrible-tasting food, and then I gotta look over at Evan, I mean look at him, it looks like the most fun I’ve ever seen in my entire life. And, I’m just saying, I wash and dry, I’m like a single mother. And, no offense but, everyone takes this class to get an A and it’s bullshit, but uh no offense, I’m just saying. And I’m not putting down your profession, but when am I gonna need to cook tiramisu? Am I gonna be a chef? No. There’s 3 weeks left in school, give me a freaking break, sorry for cursing. OH MY GOD that’s like the coolest fucking story I’ve ever heard in my life, it’s insane. Can you tell us again? Do you have time? Tracy, Tracy, can you hear me? I’m in the car right now. Listen, I am McLovin, yeah. McLovin in the house! McLovin in the house! Yeah", "image": "https://images.genius.com/92a4caddb38548f811a9d5b5599e4304.1000x1000x1.png"}], "artist": "Eminem"}