{"songs": [{"title": "Who the Illest", "album": "Q.B. 2 Compton", "year": null, "lyrics": "[The Game]\nWho the illest hub dawg you know\nPeelin slugs at your mug, dealin drugs in front of the projects\nMy projects, more scatter, more street\nMakin room for more drama, more hustle, more heat\nI can show you how to get, American money easy\nIt's the gangster, all motherfuckers envy\nLeave all semi I tote, clips empty\nFoes tempt me, I'm seein no penitentiary\nCrime scene clean, shells, no prints\nFlee the shootout, X-5, no {?}\nIt's meant for me to survive this gangster shit\nMeant for you not to be livin, food for the pigeons\nIt's rules I'm givin, new lessons for the street\nThis jungle I'm from B don't breed no weak\nLames that don't know the game please don't speak\nYou get killed, want me peeled, I'm showin no {?} nigga\n\n[Hook: The Game] + (Sean T)\nEvery nigga out there claimin to be the illest\nI don't know if y'all know let a nigga know I'm lost in the stipulations\nNiggas hatin, everybody waitin for the outcome\nWhatever happened to just to rappin?\n(Mic graspin, freestyle flow flashin)\n(Rippin up tracks and, doin the thang)\n(What'chu niggas know about Sean T and the Game?)\n(Who's the illest?)\n\n[Sean T]\nI'm off the rack like slabs of ribs, I want it big\nI ain't fuckin with kids, I'm after six digit things\nFuck the rings and the tribulations, constant playa hatin\nThis crimin-al lifestyle, keeps me animatin\nLet's turf talk before you niggas thuggin it up\nIt don't matter if you Crip'n, or Blood'n it up\nDallas Squad blooded it up, smashin on sight\nBut he hoppin on haters like BMX bikes\nFuck around with the Squad see unbearable sights\nWe takin gangster shit to the maximum height\nBut I'm mainly into bubblin, fat grip doublin\nBig heads I'm lovin 'em, you feelin me y'all\nLeavin the envious in awe cause I tremendously ball\nI'm supported by the Game so you know I won't fall\nI'ma execute my options, keep wettin my paws\nAnd come out unscathed with no scratches or flaws\nWho's the illest\n\n[Hook]\n\n[The Game]\nThey say \"Game, you rappin like you from the East coast,\" meet toast\nGun jammed in your throat, forgot that you spoke\nGame got the streets woke young'n, same nigga got the coke runnin\nIntroduce the new fiends to smack\nPops told me when I was younger, you can't live like that\nSo I don't listen to pops nigga I listen to Kool G. Rap\nWent from hustlin sacks to heavy weight, shufflin crack\nKids and preachers know me, young Game the O.G\nAsk the reverand kept the church from fallin, young'uns from starvin\nI'm the project like Marcy or the Nickerson Gardens\nComfortable dawg, Compton to Harlem, any city ghetto or hood\nKick back, blowin, listen to Marvin\nGet head, count dough and just sit in the apartment\nAK in the sofa, I'm the illest, who come closer\nTo the late ones or great ones fightin over a crown\nGet shot off that throne, who the illest now, huh?\n\n[Hook]\n\n[Sean T]\nSome say the gangster mentality is dead, imagine that\nWhen fools pullin straps out with infrared\nWe're livin in a time of plagues and corrupt life\nWhen homies in the circle end up all trife\nTryin to shine bright, but lookin all dim\nMeanwhile I stay sharp like a ballpoint pen\nI see the smirks and grins but I just laugh\nCause I'm gettin lucrative loot, endless math\nIf you only knew the half of it, you wouldn't hate\nBut niggas just pig and talk shit behind Jake\nMan you cain't knock the hustle, I ain't fin' to be greedy\nI want an exit out the game kinda like Paul Vitti\nI'm tryin to slang CD's in cruise control\nInstead of sellin illegal pharmaceuticals\nShould I ask for your advice?  Like you would know\nFuck it, I'm out to get it, I'm a fool for dough\n\n[Hook]", "image": "https://images.genius.com/40d38d21ace3ff6fcc01da5f319eae00.1000x1000x1.jpg"}], "artist": "The Game"}