{"songs": [{"title": "Shakey Dog", "album": "Fishscale", "year": "2006-03-28", "lyrics": "[Intro: Ghostface Killah]\nYeah, what's the deal? What's the deal y'all?\nI need y'all niggas to buckle up one time\nFasten your seatbelts, I'ma take y'all on some real shit\nThis Theodore shit, y'all niggas know what time it is and shit\nY'know I mean? It's real motherfuckin' shit, you know\n\n[Verse: Ghostface Killah]\nYo, making moves back and forth uptown\n60 dollars plus toll is the cab fee\nWintertime bubble goose, goose, clouds of smoke\nMusic blastin' and the Arab V blunted\nWhip smelling like fish from 125th\nThrowin' ketchup on my fries, hitting baseball spliffs\nBack seat with my leg all stiff\nPush the fuckin' seat up, tartar sauce on my S Dot kicks\nRocks is lit while I'm poppin' the clips\nI'm ready for war, got to call the Cuban guys\nGot the Montana booth in front of the store\nMade my usual gun check, safety off, come on Frank\nThe moment is here, take your fuckin' hood off\nAnd tell the driver to stay put\nFuck them niggas on the block they shook, most of them won't look\nThey frontin', they no crooks they fuck up they own jux\nLook out for Jackson 5-0 'cause they on foot\nStraight ahead is the doorway, see that lady with the shopping cart\nShe keep a shottie cocked in the hallway\nDamn she look pretty old Ghost\nShe work for Kevin, she 'bout 77\nShe paid her dues when she smoked his brother in law at his bosses' wedding\nFlew to Venezuela quickly when the big fed stepped in\n3 o'clock, watch the kids, third floor, last door\nYou look paranoid that's why I can't juks with you\nWhy? Why you behind me leery?\nShakey Dog stutterin', when you got the bigger cooker on you\nYou is a crazy motherfucker, small Hoodie dude\nHilarious move, you on some Curly, Moe, Larry shit\nStraight parry shit, Krispy Kreme\nCocaine, dead bodies, jail time you goin' carry it\nMatter of fact, all the cash, I'ma carry it\nStash it in jelly and break it down at the Marriott\nThis is the spot, yo son your burner cocked?\nThese fuckin' maricons on the couch watchin' Sanford and Son\nPassin' they rum, fried plantains and rice, big round onions on a T-bone steak\nMy stomach growling, yo I want some\nHold on, somebody's comin', get behind me, knock at the door\nAct like you stickin' me up, put the joint to my face\nPush me in quickly when the bitch open up\nRemember you don't know me, blast him if he reach for his gun\nYo who goes there? Tony, Tony one second homie\nNo matter rain, sleet or snow you know you supposed to phone me\nOff came the latch, Frank pushed me into the door\nThe door flew open, dude had his mouth open\nFrozen, stood still with his heat bulgin'\nTold him, \"Freeze!\" lay the fuck down and enjoy the moment\nFrank snatched his gat, slapped him, asked him\nWhere's the cash, coke and the crack? Get to smokin' you fast\nHis wife stood up speakin' in Spanish, big tittie bitch holdin' the cannon\nRan in the kitchen, threw a shot\nThe kick in the four-fifth broke a bone in her wrist\nAnd she dropped the heat, \"Give up the coke!\", but the bitch wouldn't listen\nI'm on the floor like, \"Holy shit!\", watchin' my man Frank get busy\nHe zoned out, finished off my man's wiz\nHe let the pitbull out, big head Bruno with the little shark's teeth chargin'\nFoamin' out the mouth, I'm scared\nFrank screamin', blowin' shots in the air\nMissin' his target, off the Frigidare, it grazed my ear\nKilled that bullshit pit, ran to the bathroom butt first\nFrank put two holes in the doorman's Sassoon\nThe coke's in the vacuum, got to the bathroom, faced his bad moves\nThe big one had the centipede stab wound\nFrank shot the skinny dude, laid him out\nThe bigger dude popped Frankie boy, played him out\nTo be continued...", "image": "https://images.genius.com/61b48fa7fe972c473dc1c20c9489e45f.1000x1000x1.jpg"}], "artist": "Ghostface Killah"}