{"songs": [{"title": "Patna Dem (Ludamix)", "album": "Conjure (A Hustler’s Spirit)", "year": null, "lyrics": "[Intro: Lil' Scrappy]\nI was on the ave' cuttin slabs with my patna' dem\nThen I left the block and hit the lab with my patna' dem\nFlipped a couple bad little bitches with my patna' dem\nBeat a fuck nigga, get some stitches for my patna' dem\nCiroc, this my fucka' I'm a sip it with my patna' dem\nRoll a couple of swishers, hit the blunt with my patna' dem\nFresh up on the scene looking clean with my patna' dem\nGot a bag of kush and some beans from my patna' dem\nGot a bad bitch super cool with my patna' dem\nHit up south side, rich too with my patna' dem\nNeed a couple dollar, I'm a holla at my patna' dem\nNigga wanna problem, scrap them squabble with it patna' dem\n\n[Hook: Rich Kids]\nBoulevard (My patna' dem)\nHerndon Holmes (My patna' dem)\nSummer Hill (My patna' dem)\nMechanicsville (My patna' dem)\nThomasville (My patna' dem)\nYou know Pittsburgh (My patna' dem--patna' dem with patna' dem)\nYou know I fuck with (patna' dem)\n\nCedar, AL (My patna' dem)\nAdamsville (My patna' dem)\nBowen Homes (My patna' dem)\nSimp-set (My patna' dem)\n[Ludacris]\nLudacris (My patna' dem)\nD-D-DTP (My patna' dem)\n[Rich Kids]\nAyyyyyyyyyy\nThis is how I kicks it\n\n[Verse 2: Ludacris]\nCollege park my patna' dem\nBenjamins, I got lots of them\nCome and try to take my Benjamins and see big Glocks and me cocking them\nPlatinum hits, I'm dropping them\nLouie kicks, I'm rocking them\nSo zip your lips it Ludacris and bitch it ain't no stopping them\nSilly hoes, I'm socking them\nFifteens in the trunk, I'm knocking them\nWhy the 5 percent tint on this Bentley window always blocking them?\nCause Lil' Scrappy my patna' dem\nTity Boi, I'm on the block with him\nDolla Boy he be robbing them and Lil' Fate I ride in the drop with him\nI-Dub, we be swapping them\nGet a couple of bills and popping them\nChing-a-ling was DTP but we had to end up dropping him\nNow B.X.C., my patna' dem\nWilly and P what's popping Slim?\nDTP still going strong and all these hoes be jocking them\nDoing them and bopping them\nScrewing them, chop-chopping them\nNotorious like B.I.G. and he even got a little bit of Pac in him\nNow new artists, we shopping them\nAir ones, we stocking them\nHit the dealership, get a brand new whip and then we hop in them\nBad boy like Block and them\nIt's going down like Joc and them\nChaka Zulu and Jeff Dixon, I'm going all the way to the top with them\nBusiness deals, we locking them\nForbes list, we topping them\nAnd Conjure cognac is coming soon, no diss to Ciroc and them\nOhhhhh\n\n[Hook]", "image": "https://images.genius.com/5cb5a8107978b6c3e404d085c42ab3d1.595x596x1.jpg"}], "artist": "Ludacris"}