{"songs": [{"title": "Mr. Smith", "album": "Mr. Smith", "year": "1995-11-21", "lyrics": "[Intro]\nUh Mr. Smith, Mr Smith, Mr Smith\nUh Mr Smith, it's the bomb y'knowhutI'msayin? Mr Smith\nMr Smith, word up kid, yeah Mr Smith, check it out\n\n[Verse 1]\nI'm goin' to the top, leavin' smoke in my trail\nBitch ass gangstas put that ass on sale\nAnd even if I'm twice as expensive as the rest\nWhen I go for dolo, you ain't checkin' for nothin' less\nMy strategy is splittin' brain cavity's\nIt's ya majesty bringin' you a tragedy\nYeah, on the butcher block slice her like a ox\nWhen it's time to get down, nigga I jam like a Glock\nI bust through all types of red tape and sue papes\nNiggas come old but they always wanna infiltrate\nI'm cuttin' snakes through the belly witta icepick\nAnd scoopin' hotties, a strong aisle of flip trips\nIt's the rebirth of murkin' niggas once again\nI drain with ink and put your blood in my pen\nI'm breakin' ribs 'til somethin' gives\nA nigga got to live and Mr Smith is power god, kid\n\n[Chorus]\nMr Smith you got the shit sewed up\nWork ya thang baby, show 'em how to blow up\nMr Smith you got the shit sewed up\nWork ya thang baby, show 'em how to blow up\nMr Smith you got the shit sewed up\nWork ya thang baby, show 'em how to blow up\n\n[Verse 2]\nWhat? You wanna do what? You lack the vitality\nOriginality, so face reality\nI'm on some ole wild shit, ya niggas can't get wit\nMatter of fact, mornin' yawn and suck a dick\nNah hold up, the fuck is goin' on?\nAll these cartoon character MC's gettin' airborne\nTakin off like a hot air balloon\nGoin up up up, oh no kaboom\nBring your heroes down to ground zero\nShotty grippin' ya grill like Pesci and DeNiro\nI'm on some [BLANK] shit, throats is gettin' shit\nScoopedin' New Jacks and kick 'em in the fire pit\nTell them ole Jap niggas they need to go and stick it\nCos when it comes to this rap shit I'm mad wicked\nThe grand sire bringin' flavor to the whole game\nMr Smith is my motherfuckin' name\n\n[Chorus]\nMr Smith you got the shit sewed up\nWork ya thang baby, show 'em how to blow up\nMr Smith you got the shit sewed up\nWork ya thang baby, show 'em how to blow up\nMr Smith you got the shit sewed up\nWork ya thang baby, show 'em how to blow up\nTo the bridge\n\n[Bridge]\nMr Smith (I was a mack since birth)\nTalkin' 'bout Mr Smith (I invented the taadow!) Uh\nTalkin 'bout Mr Smith\nTalkin 'bout Mr Smith\nTalkin 'bout\n\n[Verse 3]\nTime's up, your rhyme's up, mix the lines up\nI'm about to blow the spot up with that divine touch\nI got the magnetic energetic lyrical calasthetic\nYa better call a medic cos ya look pathetic\nGuan boy it's the champion Mr Smith\nYour niggas couldn't raise up with a forklift\nCocked the hammer, peep out the grammar\nIt's hard like Bacardi and hot like a house party\nAll your so-called flavor niggas is deaded\nYour next step is where ya headed so don't forget it\nYour rhymes is beat, your steelo's scarred to scrape\nWhen you scream you sound muddy like a bled teeth\nI get'cha open like f-lay, 'tack you when I spray\nLethal compositions around your way\nI'm the maniacal murderous Mr James Smith\nRippin' ya ass out the frame with my verbal gift\n\n[Chorus]\nMr Smith you got the shit sewed up\nWork ya thang baby, show 'em how to blow up\nMr Smith you got the shit sewed up\nWork ya thang baby, show 'em how to blow up\nMr Smith you got the shit sewed up\nWork ya thang baby, show 'em how to blow up\nMr Smith you got the shit sewed up\nWork ya thang baby, show 'em how to blow up\nMr Smith you got the shit sewed up\nWork ya thang baby, show 'em how to blow up", "image": "https://images.genius.com/aba57f7703e47dacfcd5243398922d01.500x500x1.jpg"}], "artist": "LL Cool J"}