{"songs": [{"title": "Middle Finger", "album": null, "year": null, "lyrics": "[Intro]\n\"This has once again proof that no routine police stop is actually routine. We saw that last week of course, in Brooklyn with the tragedy over there and then again last night here in Tottawa, another police shooting\"\n\nHere's what they think about you\n\n\"I hate little motherfuckers like you. Little niggers like shit! Think your tough, huh? Blow your head off, your little Smith and Wesson couldn't do shit. How you feel now?\"\n\n[Hook- David Banner]\nCops keep firing in my environment\nMiddle finger to the law nigga gripping my balls\nCops keep firing in my environment\nMiddle finger to the law nigga gripping my balls\nCops keep firing in my environment\nMiddle finger to the law nigga gripping my balls\nI like to see them fall, guilty for doing wrong\nMiddle finger to the law nigga gripping my balls\n\n[Verse 1 - Nas]\nNow all you hypocrites, witness the injustice\nConversations taped illegally, then they cuff us\nU.S. attorneys, public defenders send us off to hard prison time\nWhether you innocent or did the crime\nSay you come from who this cops pursue you hard\nRun your plates, put guns in your face\nPut you in the car, for nothing\nNow your strugglin', tied up, standing in line-ups\nCall your lawyer, they charged you with murder\nWhy? Cuz these liars said you shot another man on his driveway\nGuilty, just for being black on a Friday\nPolygraph test you failing, because you're nervous\nCharged for murder you didn't commit, then they serve ya\nFifteen years, maximum security\nSlashing, stab wounds, broken bone injuries\nYou were placed there intentionally\nEither you bang or you miss me, listen to me\n\n[Hook]\n\nIm grippin' the Nina, visions of 9/11\nVisions of three sixes, no sevens\nThis is Bushonomics, George is a modern day Ronald Reagan\nI pray to god in the midst of Pagans\nNiggers I'm just saying\nWhen do we stop playing?\nWhen do we stop pimping and start spraying?\n50 shots for every cop that popped Sean Bell his body lay'in\nBut they acquit cuz they know\nThat our generation won't do shit! Nothing, nada\nBut every rapper is a shotta or a Don Dada\nOr a killer, but you ain't killing nothing\nAnd it's peace unless it's another nigga\nTryna raise boys to Superman\nAnd while I'm at it fuck Arthur J. Cooperman\nIt's never justice for blacks but they send just us to Iraq\nWith poor whites and Latinos\nI pray to God that you hear this single\nThis is Banner's middle finger y'all\n\n[Hook]\n\n[Outro]\nYou still want to be nigga too?\n(*Gunshot sound)", "image": "https://images.genius.com/23061dd2dc7e863127db561906debd27.434x434x1.jpg"}], "artist": "Nas"}