{"songs": [{"title": "No Tellin’", "album": "If You’re Reading This It’s Too Late", "year": "2015-02-13", "lyrics": "[Chorus]\nEnvelopes comin' in the mail, let her open 'em\nHopin' for a check again, ain't no tellin'\nYeah, she invite me to the telly, keep the blade with me\nWhen I go to check a bitch, ain't no tellin'\nYeah, police comin' 'round lookin' for some help\nOn a case they gotta solve, we never help 'em\nYeah, I stay up late at night, thinkin' 'bout my life\nWant a lot, will I get it all? Ain't no tellin'\nAin't no tellin', yeah, ain't no tellin'\nYeah, no tellin', ain't no tellin'\n\n[Verse 1]\nSuitcase, I been livin' out a suitcase\nStill drinkin' Henny, if it's done, I'll take the D'usse\nOops, ayy, fuck it, all you niggas two-faced\nGot the club goin' up on a Tuesday\nTrue say, I been goin' hard, but then again\nThey think I'm soft, think I'm innocent\nI'm just lookin' in the mirror like I'm really him\nMan, I'm really him, you just fillin' in\nMan, I got a blunt, can I get a light? Yeah\nI took the summer off to get it right\nYeah, I gave these boys a shot and they fuckin' failed\nNiggas like \"You took the summer off? We couldn't tell\"\nDawg, just bought a island, gotta sail to it\nYou pick the casket, I'll put the nail through it\nI ain't gotta do it, but fuck it, somebody gotta do it\nHate if someone else did it, fuck, I may as well do it, ah!\n\n[Chorus]\nEnvelopes comin' in the mail, let her open 'em\nHopin' for a check again, ain't no tellin'\nYeah, she invite me to the telly, keep the blade with me\nWhen I go to check a bitch, ain't no tellin'\nYeah, police comin' 'round lookin' for some help\nOn a case they gotta solve, we never help 'em\nYeah, I stay up late at night, thinkin' 'bout my life\nWant a lot, will I get it all? Ain't no tellin'\nAin't no tellin', yeah, ain't no tellin'\nYeah, no tellin', ain't no tellin'\n\n[Verse 2]\nOkay, I had to switch the flow up on you niggas\nThe shit was gettin' too predictable\nThe new shit is on steroids, I would never pass a physical\nI got it rollin' in all kinda ways, lump sum and residual, yeah\nI mean we hear about the money you been gettin'\nWe just never seen a visual\nIt's our year (aw yeah), aw yeah\nI mean besides Ricky Ross, Aubrey the biggest boss here (grunt)\nWhat's the word these days?\nBuncha' niggas chasing after all these women\nThey don't even know (WOOO)\nBuncha' out of season women fuckin' off-season niggas\nTo get last season wardrobe (WOOO)\nAll the rappers that you vouch for\nNeed to get out of the house more, they washed up\nAnd even if the team was religious with it\nI can't really see another squad tryna' cross us, naw (WOOO)\n\n[Beat Switch]\n\n[Interlude: Popcaan]\nOVO, Unruly\nOne shot to make it in a life\nFrom the six to the fucking 876\n\n[Chorus]\nEnvelopes comin' in the mail, let her open 'em\nHopin' for a check again, ain't no tellin'\nYeah, she invite me to the telly, keep the blade with me\nWhen I go to check a bitch, ain't no tellin'\nYeah, police comin' 'round lookin' for some help\nOn a case they gotta solve, we never help 'em\nYeah, I stay up late at night, thinkin' 'bout my life\nWant a lot, will I get it all? Ain't no tellin'\nAin't no tellin', yeah, ain't no tellin'\nYeah, no tellin', man ain't no tellin'\n\n[Verse 3]\nI gotta keep watchin' for oppers\n'Cause anything's possible, yeah\nThere's no code of ethics out here\nAnyone will take shots at you, yeah\nNiggas think they can come take what I got\nLet's be logical, yeah\nV-Live, I order that Alfredo pasta\nThen eat in the kitchen like I'm in the mafia\nHouston, they get me though\nEuropean, my vehicle, how much it hit me fo'?\nAin't no tellin', yeah\nWhat am I willin' to give her\nTo get what I want tonight?\nAin't no tellin'\nPlease do not speak to me\nLike I'm that Drake from four years ago\nI'm at a higher place\nThinkin' they lions and tigers and bears\nI go huntin', put heads on my fire place, oh my\n\n[Outro]\nTake time, ain't no tellin'\nOh my, ain't no tellin'", "image": "https://images.genius.com/bcf01db777c6e5c46eddb1031a2008d1.1000x1000x1.jpg"}], "artist": "Drake"}