{"songs": [{"title": "Like Yeah", "album": "Killer", "year": "2008-10-03", "lyrics": "[Intro]\n(TECH N9NE!) Technicians!\nAhoo! Ahoo! Ahoo!\n\n[Verse 1: Tech N9ne]\nEy! It's time to get into some sin you been listenin' to jibberish\nHits in the interim, them are done 'cause here me come\n(To make you stand up, stand tough, hands up, damn ya)\nIf you don't get it, get rid of it, trip if you diggin' it!\nI guess I got mo' than my balls and my word\nI got broads in a herd, chasin' this and all of my nerves\n(They've got the illness, they feel this realness, chill, bitch)\nI got a bed, it's too crowded for you to come get in it!\nI spit that Tech scheiße off to y'all\nIt's crazy! Even Michael Jackson said it's \"Off the Wall\"\n(I'm with the sickness, big Tech's lidless, Midwest)\nI be the best one for gunnin', nobody can get with it!\nSo when you see me in the spot: bow down, trick\nI eat, drink, sleep, dress, look and sound rich\n(So jump up, get pumped up, crunked up, everyone must)\nStop with the jealousy with me, the haters be riveted!\n\n[Hook: Tech N9ne & Krizz Kaliko]\n(K-I-L-L) E to the R, a dot!\nJust ain't fair that when I pop up the spot be like, \"YEAH!\"\nKiller, killer, it's the gorilla\nAnd if they feel ya they screamin' like\n\"Yeah! Yeah! Yeah!\"\nLike, \"Yeah! Yeah! Yeah!\"\nMister, mister, quick to get with ya\nChick, if she get a whiff of this she'll be like\n\"Yeah! Yeah! Yeah!\"\nLike, \"Yeah! Yeah! Yeah!\"\n\n[Verse 2: Tech N9ne]\nI'm back with the heat and yes, Young Fyre produced it\nWith true spit, I get lots of relish with Strange Music\nMy crew's thick, (That's right!) Deuce Clique, and guess who's with\nTwo chicks (Tech N9ne!) In my lou of Caribou sips\nThe super dew lifts, everybody in the party will lose it\nVodka and Mountain Dew is the new shit\nThanks to IcyRoc and Demonica, we honor ya\nAnd I get so much money sometimes it feel like I'm wearin' a yarmulke\nYou cannot monitor my money, I'll monetarily astonish ya\nSo what's with the bad comments and all the drama for?\n(I can produce a picture, stop with the truce and hit ya\nI'm at the top, but I can be poppin' and shootin' with ya)\nChip on my shoulder now, \"Mr. Nice Guy\" is over, wow!\nTo a ritzy and older style from ditsy and Gomer Pyle\nLook at my checks swell, chicks with wet tails\nReady to rock it, in my pocket got the Trojan Magnum XL's\n\n[Hook: Tech N9ne & Krizz Kaliko]\n(K-I-L-L) E to the R, a dot!\nJust ain't fair that when I pop up the spot be like, \"YEAH!\"\nKiller, killer, it's the gorilla\nAnd if they feel ya they screamin' like\n\"Yeah! Yeah! Yeah!\"\nLike, \"Yeah! Yeah! Yeah!\"\nMister, mister, quick to get with ya\nChick, if she get a whiff of this she'll be like\n\"Yeah! Yeah! Yeah!\"\nLike, \"Yeah! Yeah! Yeah!\"\n\n[Verse 3: Tech N9ne]\n(TECH N9NE!) Yeah, I think they with me, mayne\nYeah, yeah, this is Kansas City, mayne\nThe industry's still punks, that's why they real slump\nBut when we in this drop, all our records we will dump\nHavin' a good time, just stackin' 'em with Travis, we laid back\nDoin' about a hundred fifty with slaps in the Maybach\nHaters, of course ya doubt that I'm makin' a warped amount\nI got Ozone, Murder Dog, double XL and Source accounts\n(So what's all the force about?) Killer in and remorse is out!\nFuck Mark Cerami, you heard that from the horse's mouth\nThat ain't comin' from RBC, that ain't comin' from Fontana\nIt's comin' from Strange Music's Dontana in a calm manner\nI'll say this in baritone, (\"We come to get our cheddar!\")\nHuntin' you in yo' dreams, you wake up screamin' in falsetto\nMTV clipped me, birthday bash show\nI got fans like cat castro that'll boost my cash flow!\nMTV, completely, we sick of it, you won't give a bit?\nJust look at my eyes and my blood and my ligaments\nYou can see that Tecca Nina don't give a shit\n\n[Hook: Tech N9ne & Krizz Kaliko]\n(K-I-L-L) E to the R, a dot!\nJust ain't fair that when I pop up the spot be like, \"YEAH!\"\nKiller, killer, it's the gorilla\nAnd if they feel ya they screamin' like\n\"Yeah! Yeah! Yeah!\"\nLike, \"Yeah! Yeah! Yeah!\"\nMister, mister, quick to get with ya\nChick, if she get a whiff of this she'll be like\n\"Yeah! Yeah! Yeah!\"\nLike, \"Yeah! Yeah! Yeah!\"", "image": "https://images.genius.com/ce6124bde0d76994fd0d3a8ddb1d4e97.1000x994x1.jpg"}], "artist": "Tech N9ne"}