{"songs": [{"title": "Medicine Ball", "album": "Relapse", "year": "2009-05-15", "lyrics": "[Intro]\nOh my goodness, what have I done?\nOh no, I can't believe it\nIt's like I've got the whole world in my palm\nAnd I'm ready to drop bombs\n\n[Verse 1]\nWelcome to the Slim Shady Mecca, Rebecca\nIt's the village in New York, right next to the Tribeca\nThat's my sector, homosexual dissector\nCome again, rewind selector\nI said, nice rectum, I had a vasectomy Hector\nSo you can't get pregnant if I bisexually wreck ya\nHannibal Lecter in the guy section, I bet ya\nI tantalize ya and in less than five seconds I get ya\nThey say once bitten then twice shy, well lie next to the guy\nWith nine ecstasy pills and five extra\nBoxes of ribbed condoms in quantities, why yes sir\nI took the rest of the Lunesta pills from my dresser\nThat's my kind of vibe, what else should I try, Lester?\nDrop-kick the bitch before her second trimester\nPerform the home abortion with Dexter, then I guess I'll\nDig her fetus out with a wire hanger, then digest her\n\n[Chorus]\nI guess it's time for you to hate me again\nLet's begin, now hand me the pen\nHow should I begin it and where does it all end?\nThe world is just my medicine ball, you're all in\nI said, I guess it's time for you to hate me again\nLet's begin, now hand me the pen\nHow should I begin it and where does it all end?\nMy medicine ball, you're in my medicine ball, friends\n\n[Verse 2]\nAll my Westside bitches throw it up\nPut a balloon inside your pussy, queef, and blow it up\nMan, I think that he just fell off the deep end, sure enough\nSo you better change the station to keep from throwing up\nMan, you seen it all before, you're all too familiar with it\nThere's a penis on the floor and two balls, so you know who did it\nYou know you with it, girl, don't front, oh no you didn't\nI won't rape all the Pussycat Dolls? Nicole, you kiddin'?\nI'll pee on Rihanna, see man, I do what I wanna\nSpray perfume in the sauna room, crazy-gluin' Madonna\nTo the La-Z-Boy sofa, fold her in two, then sit on her\nImagine the visual for that, man, who would've thought I\nCould ever be such a relentless prick, unleashing his vengeance\nBut the chick's so old, she looks like she outlived a life sentence\nI never meant this rhyme to be so offensive\nIf you weren't so defensive, it wouldn't be, you're so sensitive\n\n[Chorus]\nI guess it's time for you to hate me again\nLet's begin, now hand me the pen\nHow should I begin it and where does it all end?\nThe world is just my medicine ball, you're all in\nI said, I guess it's time for you to hate me again\nLet's begin, now hand me the pen\nHow should I begin it and where does it all end?\nMy medicine ball, you're in my medicine ball, friends\n\n[Verse 3]\nPut Christopher Reeves on a unicycle with a kickstand\nKick it up and push him and lead him right into quicksand\nHere, you need a hand, big man? Grab hold of this branch\nWith both hands, man, they don't understand, I'm just a sick man\nNow everybody's pissed at me\nLike it's my fault his name rhymes with so many different words, jeez\nSo one last time, Mr. Christopher Reeves\nWon't you break it down for me and just spit the verse, please?\n\"Eminem, I'm coming to kill you (inhale)\nAlways hated you, and I still do\nYou'll never fill my shoes, my Superman costume (inhale)\nDoesn't even fit you, they don't feel you\nYou're taking this shit too far (inhale)\nWho do you think you are? Hang my suit up in the armoire\nEvery day I hate you more and more, throw down the cardboard\nLet's breakdance if you think you're hardcore\"\n\n[Chorus]\nI guess it's time for you to hate me again\nLet's begin, now hand me the pen\nHow should I begin it and where does it all end?\nThe world is just my medicine ball, you're all in\nI said, I guess it's time for you to hate me again\nLet's begin, now hand me the pen\nHow should I begin it and where does it all end?\nMy medicine ball, you're in my medicine ball, friends\n\n[Outro]\nThe world is mine", "image": "https://images.genius.com/280d45965a412d7e2a115e2db61d79f2.1000x1000x1.jpg"}], "artist": "Eminem"}