{"songs": [{"title": "The Watch", "album": "Hidden Darts: Special Edition", "year": "2005-11-18", "lyrics": "[Singer]\nTony for mayor.. (x4)\n\n[Ghostface Killah]\nCatch me in a crisp blue six, deep dish\nJaws is Cris', valor stopped at the wrist\nWatches involved, talk to me Trick Daddy\nI liked the way you tilt ya hat up in that Caddy\nSon, can't believe you the most slept on\nTook a break since the Cuban, niggas lookin' like you just repped wrong\nYou done slipped down a bid, got caught with the hammer\nSteal banners, medical examiners, clocked live hammers\nFor real, you a live nigga, rock the five in ya slippers\nLike them other five guys in ya picture\nCome on, watch, I'm the star of the show, so blow dem\nMothafucka, you ain't blew in three years\nSon of a bitch, that's why I rock the big shit\nDon't forget who you is, nigga, you my little shit\nI will crush you to pieces, stop ya heart from tickin'\nAnd you mad cuz you a older clock, couple rocks missin'\nAnd my writin', the band, you can say it's ice flight-nin'\nYou don't like him, do you? You wanna fight him\nIn fact, I should've put you back, relaxed on the stones\nAnd copped ya two-thousand leather shit, snow cones\nA bowl of milk almost killed you, ah, you almost drowned in my Pops\nI brought another box, I'mma keep it real with you\nAnd I'mma murder you if ya bitch-ass get on my nerves again\n\n[Raekwon (Ghostface Killah)]\nYo, Ghost, you'se a funny nigga\nTurn on the radio, all you hear is X and Jigga\nHaha, you vexed, nigga?\nNo airplay (bet my gat spray) Yeah, that's hearsay\nYou spray hairspray and up North, nigga, you ain't gettin' jailplay\n(How you know?) Yo, it's obvious, clear as day\n\n[Ghostface Killah]\nHold on, let me park my shit, let me find out this nigga barkin' and shit\nI'm a Don of this shit, and you know that shit I wrote with Golden Arms is a hit\nMy Wallos show off, go off like an alarm in the six\nDrapped in yellow and I'm still poppin'\nMy movie life in the hood is like an ill doctrine\nBeat trial with a legal aide, fuck Cochrane\nAnd if it's on I might blow you if I'm boxed in.. {*echoes*}\n\n[Break: Raekwon (Ghostface Killah)]\nYo, yo, yo, what you doin', man?\nYo, man, chill out, man\n(Don't even worry)\nI'm just fuckin' with you, man\nWhy you.. (OK) Come on, son\nWe can't.. don't depart us like this, son\nCome on (I'll destroy you)\nCome on, man (You pop too much shit)\nCome on, man, I'm just tellin' you time\n(I ain't a-like that, you know who brought you)\nNigga, I'm just fuckin' with you\n(Bye!)\n\n[Singer]\nTony for mayor.. {*repeats to fade*}\n\n[Outro: Ghostface Killah (Raekwon)]\nYo, let me tell y'all mothafuckas somethin'\n(Shoot one of those niggas, Lord)\nWe could battle for belts, ice (Type shit)\nWhatever the fuck you want to do\nLet me tell y'all somethin'\nThis the Theodore Unit, mothafucka\nWe takin' the bait of this shit\nThat's word to my momma, man\n(Staten Island, nigga, what, nigga?)\nCoke, spoon throwers (Get ya money right)\n(Gotta know how real do this)\nSlew-footed mothafuckas, I pop all y'all niggas\nY'all niggas is fucked, straight up\nWe back in here now, mothafuckas\nIt's the fuckin' Unit, you heard\nThat's the Theodore Unit\nY'all mothafuckas better recognize\nAight? That's my word\n(Yeah, nigga, yeah)", "image": "https://images.genius.com/b7b55998d5f43c353e2149b260e48a8f.700x700x1.jpg"}], "artist": "Ghostface Killah"}