{"songs": [{"title": "Rubiks Cube Freestyle", "album": null, "year": "2015-11-19", "lyrics": "[Logic]\nYo, this is what we do\nNah, nah, give me the next one, give me the next one, hold up\n[Big Boy]\nWhat about this one?\n[Logic]\nYeah, uh, check check, oh yeah, see i like this BPM. Here we go, you ready?\n[Big Boy]\nUh-huh\n[Logic]\nOk, here we go, check it\n[Verse 1: Logic]\nIḿ bout to spit the vibe\nThis is how we do it whether its that new or that tribe\nWe always gotta keep it alive\nYou know my\nVision is hella crazy\nThe flow is never lazy\nSee, I don’t even know what Im saying\nIm just vacaying in Barbados\nThe second i get its crazy ’cause she ’Jamaican me crazy’\nI don’t know, I’m just spitting this rhyme\nI gotta spit it on time\nThe second I do it strictly come off my mind\nThey say they know the deal\nAlways keep it real\nAnd yes, I get it like that\nThis is how we do, I got my first tat\n¨Happy Wife, Happy Life¨\nNot a flow is never trife\nI gotta, get it like this, its hella crazy\nThe flow is never lazy\nAnd it doesnt even make sense, it doesnt even matter\nIm just spittin´\nThat random thought\nIt can't be taught\nThis is how we do it\nSpeaking of thots, i can't fade these hoes\nWhere ya´ll been?\nWhere ya´ll going?\nThis is how we do it\nI don’t even know what Im saying\nI ain’t knowing, Im just keeping this\nI just got this Rubik’s Cube, it’s got the lube and pars on that, we all on that\nAnd this is how we do it\nI spit these rhymes, its kinda crazy\n[Dialogue]\nOh no, and ya’ll done messed this Rubik’s Cube up\n[laughter]\nSee hold up, hold up\nYa’ll messed it up\nSo I gotta flip this around, take it out, put it back in\n[Verse 1: Logic continued]\nNow I do the algorithm real slick, real smooth\nThis is how we do it, like a criminal\nFlow so medicinal\nMy stuff is heavily eradicated, never eradicated\nThey evacuated the second I arrived on the scene\nI spit it hella clean, spit it hella mean\nThought I had it for a second but I didn’t\nGotta bring it back\nThis is like, it’s really crazy when you spit it like this\n[Dialogue]\nOh my God! Ya’ll really messed it up\nYa’ll messed it up, ya’ll messed it up\nI gotta bring it back, ya’ll was flipping it too hard with your fingers\nI’m lingin, I’m lingering\nI got it, I’m singing\nI’m bringing them in\nAnd this is how we do it, let me begin\n[Dialogue]\nI would’ve solved it faster if ya’ll wouldn’t have messed it up\n[Verse 1]\nBut it’s all good we gotta keep it going\nShoutout to Kurupt\nThat West Coaster\nThe holy, the one and only, the grail\nSpit the second I get it, and I prevail, the scene\n[Dialogue]\nOh!\n(Big Boy)\nAnd he PREVAILS, ladies and gentlemen! There it is right there! Logic, Rubik’s Cube Freestyle!\nNever done ladies and gentlemen!\n[Verse 2: Logic]\nOk, I’m ’bout to go again, my flow again\nMy eyes closed\nAnd this is how we do it when we spit it, do it for the pros\nThey think they know, but i don’t even think they truly understand\nI’m a miraculous man\nAnd this is how we get it, uh\nI mix it up, I get it up, I keep my eyes closed\nOn that second that I got it, these hoes on ’em\nI don’t even know just what I’m saying\nI ain’t even playing\nMayday, tell me, I gotta get it right, get it tight\n[Dialogue]\nOh!\n(Big Boy)\nWe got Logic up in here, ladies and gentlemen!\nIt is definitely going down here\nBIG BOY!", "image": "https://images.genius.com/75b9fd3705271c3c10d64dfb3139caf7.900x900x1.jpg"}], "artist": "Logic"}