{"songs": [{"title": "III. Life: The Biggest Troll [Andrew Auernheimer]", "album": "Because the Internet", "year": "2013-12-10", "lyrics": "[Intro]\nI'm fly\n\n[Verse 1]\nMan made the web, you don't need a name (Yeah)\nMan made of faults, I ain't too ashamed\nEvery thought I had, put it in a box (Box)\nEverybody see it just before the cops\nTrolling, trolling, trolling these niggas\nRick Rolling these niggas, they mad cause they don't know any better\n\"Hold up, it's the kid—quick, tell him he can't sit with us!\"\nFuck it, got money, bought friends like I'm TBS\nVVS, I can see it all with the clarity\nReal deep, hope they dig a nigga 'fore they bury me\nEven though we were told to go where they wouldn't go\nHella slow, that's that dial up, watch it pile up, fly\n\n[Hook]\nAndrew Auernheimer\nPulling on her weave, it's that Andrew Auernheimer\nAndrew Auernheimer\nPulling on her weave, it's that Andrew Auernheimer\nAndrew Auernheimer\nPulling on her weave, it's that Andrew Auernheimer\nAndrew Auernheimer\nPulling on her weave, it's that Andrew Auernheimer\n\n[Verse 2]\nWe are the dreams of our parents lost in the future\nWho hide the deepest desires and wear a mask like a lucha—\nDoor open, we were smoking in the hotel\nThe vapors went through the hallway, the manager pissed as hell\nI mean, where's the line between Donny-G and Gambino?\nHe hang with girls like he Lena, but needed some time to re-up\nTequila in the cantina, 30 dollars I swallowed\nThe Sauza so malo (I nuzzled my Nyla)\nThen she said, \"You need to grow up\nYou been doing this for too long\nThat Camp was a million years ago, sing me a different song.\"\nWhether you're trolling or controlling, just a reminder\nYou think you get it, you don't, it's that Andrew Auernheimer\nI'm gone—Now I'm back\nGive a fuck or give 'em hell, just not a chance to react\nTyler Durden, this burden hurting, they said there was curtains\nCertain demise, look in his eyes, the pain inadvertent\nI could've stayed where I was and had a life you'd be proud of\nBut I'd rather chase things never thought of\nIt was all love, saying, \"Go hard\"\nMaking dope, it's a trap; Ackbar backfired\nPanic dreams, so it seems we're meant to die\nI had to figure it out; \"It's the best,\" no, that's a lie\nHad to get some stuff off my chest, I vaporized\nHigh on my own, it took time to realize\nBecause the internet, mistakes are forever\nBut if we fuck up on this journey, at least we're together\nMan, I wish I could go back and tell that kid it's make-believe\nMake him believe in himself, people who needed my help\nFeelings I felt, killing myself, no one's ever been this lost\nI just get the information, retweet it or say it sucks\nI just got the motivation, your talent's just bunch of luck\nHard work and dedication, but lately it's run amok\nWaking up in these places I don't remember\nTexts from people I never met, doors left open\n(Who is this? Don't do it, where are you?\nWho is this? Who is this) I don't know who I am anymore\nStill on the beat though\nStill in the game, but he move with a cheat code\nSlowest connection ever, my life inside a computer\nThem bands that'll make her dance, my wallet's Lollapalooza\nThe violence, first-person shooter\nFirst person to move, first person to speak\nMy mils aren't meek, they scream in the streets\nLosing my frame of reference, these pieces of shit for breakfast\nFunny, the day you born, that's really your death sentence\nI met this girl at a dinner, we conversatin'\nShe beautiful in the face, but her voice is truly amazing\nPlus she write her own shit, becoming so close knit\nSmoke up and talk in the evening, she helping me focus\nNo Anna Nicole Smith, she getting hers\nNiggas take her props, like a musical, live and learn\nShe say she feel alone all the time, I'm similar\nI meet her in my dreams, on the moon, I visit her\nEvery night I text her: \"I wanna solve the world, I think I need your help\"\nShe text me, \"How you gon' trust somebody when you don't trust yourself?\"\nI mean she right though, .45 like a lightbulb\nAnd I could've died like my iPhone but I kept going like a psycho\nAnd I took chance like a dice roll, dropping jewels like it's puberty\nWrote a note on the glass: \"You see what these labels do to me?\"\nText said, \"I'm wet\"; I said, \"Hold up, wait a minute\"\nH2O plus my D, that's my hood, I'm living in it\nNever forget this feeling, never gon' reach a million\nEventually all my followers realize they don't need a leader\nStay on your own shit, fuck what these clones think\nJust remember that you the shit, but act like it don't stink\nWe were childish, but had to grow up\nWhen you spitting real shit, eventually you throw up\nRealities like allergies, I'm afraid to go nuts\n\"Life: The Biggest Troll\", but the joke is on us\nYeah, the joke's you showed up\n\n[Outro]\nYou're here now\nYou have to help me\nYou have to help me\nI need you—you have to help me\nYou have to help me\nYou have to help me\nPlease help me\nPlease help me\nPlease, please help me\nPlease—", "image": "https://images.genius.com/b8c1f5981bc77ffd06580a1f2e693cf3.300x300x1.jpg"}], "artist": "Childish Gambino"}