{"songs": [{"title": "New York", "album": "Maximum Strength 2008", "year": "2008-06-10", "lyrics": "[Intro]\nAnd you say New York City!\nDuane 'Darock', KRS\n\n[Hook: female singers]\nIt's New Yorrrrrrrrrk, and we livin\nThe whole world, it knows, your name\nIt's New Yorrrrrrrrrk, and we livin\nThe whole world, it knows, your name\n\n[Over Hook]\nLenox Avenue, Park Ave\nLong Island I see you baby\nJamaican Ave, Queens\nKRS, let's go!\n\n[KRS-One]\nNew, York, City, get it right, get it tight, get it hype\nNew York City's in the house tonight\nAll day, off and on, Broadway\nThe world's Big Apple is what they all say\nWait, way back in the day\nDudes from the South migrated this way North\nLookin for the higher pay of course\nLed by the forces they became big bosses\nLike Rick Ross is, the city that never sleeps\nYup, New York is\nIf you can make it here, you can make it anywhere\nWhat's that?\n\n[Hook]\n\n[Over Hook]\nFlatbush! Brooklyn (we live this)\nBX Bronx, c'mon\nGun Hill Road, Grand Concourse\n\n[KRS-One]\nNew, York, City, still part of my heart, still part of my start\nAs you can see it's still, part of my art\nStill part of my lesson plan, listen man~!\nN.Y., every year we fresh again\nI be doin South Bronx everywhere I go\nEverywhere I go, every nation know\nI'm a New York dude that's not New York rude\nAll over the world I eat New York food\nHa, I'm at home anywhere, any place\nRight now somebody from New York in this place\nYeah, no matter where I be\nI'll always be N-Y-C\n\n[Hook]\n\n[Over Hook]\nConey Island! Brighton Beach\nWooo, Red Hook!\nI see you Canal Street, Delancey Street\nHester Street, c'mon, New York let's go\n\n[KRS-One]\nNew, York, City, metropolitan life, cosmopolitan life\nIt put the strength inside of my life\nBut New York City got its challenges also\nRacism, sexism, crime, you all know!\nThem guns that keep goin off bustin\nAnd another one bites the dust when\nConflicts arise and dudes start bustin\nAnd cussin, I gotta speak to this\nNew York is not unique in this\nBut if we keep sewing this we gonna keep reapin this\nI'm teachin this, we gotta overcome our weaknesses\nRemember man!\n\n[Hook]\n\n[Over Hook]\nBig up to the firefighters, rest in peace\nWorld Trades y'know\nBrooklyn! The Bronx, Queens\nManhattan! Staten Island! New York love it baby\n\n[Hook]\n\n[Over Hook]\nSouth Bronx\nSouth Bronx, big 'em up!\nRest in peace Jam Master Jay, Big Pun\nBig L, Randy Parker\nYou with us for life rest in peace my brother", "image": "https://images.genius.com/8e8d71ccffef56195f7ad1ad515b3f54.640x640x1.jpg"}], "artist": "KRS-One"}