{"songs": [{"title": "Slow Jams Interlude (Live at the North Sea Jazz Festival, 2005)", "album": "Live at the Jazz Room", "year": "2005-07-10", "lyrics": "Yo, DJ Dummy, you got something to slow it down with?\nIt's a lotta, like, beautiful ladies out there, man\nThis the time of the party I feel we like, man, we can get cool with the opposite sex, you know?\nGot a slow joint for the people?\nWe gon' slow it down in the basement party\nSo if you see a nice young lady that you might wanna talk to her\nGet your courage up right now and start thinking about it\nThis the right jam to play for the ladies\n\n[Plays Isley Brothers \"For the Love of You\"]\n\nI wanna know, I wanna know if I could get one sista to come up here and dance with me\nOne lady, she gotta really feel it though\nShe gotta want it\nOne lady to come up...\n\nSing it with us y'all, yeah, unh\nWhat's your name? (I'm Michelle)\nYeah, where you from? (Los Angeles, United States of America)\nGive it up, what you doin', you just visiting out here?\n(Yeah, I came to the festival with my aunt and my friend Ashley)\nWhere your auntie at? (She ain't here)\nShe don't like hip-hop? (She does, she was supposed to be here)\nAlright, cool, well, we gon' enjoy this real quick, you know\nHey, let me tell you, you know it's a lot of beautiful ladies out there\nWhat's your name again? I'm sorry (Michelle) *crowd boos*\nAlright, alright, alright, alright\nIt's a lot of beautiful ladies out there, Michelle, you know\nBut uh, I had to stop for you because...\n\n[Plays Prince \"Adore\"]\nThe first moment I say you\nI knew that you were the one\n\nAnd you know, Michelle, usually, I like to take my time\nBut tonight...\n\n[Plays R. Kelly \"Bump N Grind\"]\nI don't see nothin' wrong, oh\nWith a little bump n grind (With a little bump n grind)\nI don't see nothin' wrong...\n\nYo, I got her name right now, y'all\nI know her name, I know your name now", "image": "https://images.genius.com/045767268a13a813bd7645f24fad7896.499x499x1.jpg"}], "artist": "Common"}