{"songs": [{"title": "Everybody Rise Again", "album": "Genesis", "year": "2001-11-27", "lyrics": "[Busta Rhymes]\nLet's get it goin\nYeah... yeah\nI'm about to Picasso a new picture for you mufuckas\nI'm baaack... yeah\nI just want every one of you mothafuckas that here to do one thing with me\nC'mon\n\n[Hook]\nEverybody rise, everybody rise, everybody riiiiiiiiise\nC'mon, New York, Jersey, Philly, Bemore, D.C., Virginia, come on!\nEverybody rise, everybody rise, everybody riiiiiiiiise\nN.C., ATL, Chicago, Cleveland, Miami, LA, Houston\n\n(Verse 1)\nWe bite the nigga straight outta jail, give me the money nigga\nI'll smack you stupid, ain't nuttin funny nigga\nI'll lay a nigga out and use they ass to shoot like a marble black floor\nBloody something like a hacksaw\nAnd then we stash a couple gats in the bag because we at war\nPistol whip some of these niggas, leavin em wit cracked jaws\nBattlin like we in costalon, niggas see you supposed to know\nWe extremely serious niggas\nYou see it's so marvelous how we just strap more, pack more\nNo chichi niggas allowed, just throw em out the back door\nThis lone menace got it wicked for the protenants\nYou niggas soft like limp dick and lead progenes\nBlessin the younger thug wit shit to look forward to\nThe god is back, so niggas is quick and to fast forward you\nYo, this shit be straight energy\nYou've been fuckin wit Flip Mode, nigga, while I'm refreshin your memory\nC'mon!\n\n(Chorus)\nEverybody rise, everybody rise, everybody riiiiiiiiise\nN.O., Seattle, Detroit, St Louis, Dallas, South Carolina, niggas c'mon!\nEverybody rise, everybody rise, everybody riiiiiiiiise\nConnecticut, Pennsylvania, Boston, Buffalo, Delaware, Okland, Little Rock, c'mon!\n\n(Verse 2)\nYou see it's hectic, respect it\nBlow up your deck until my cassette is ejected\nHow I will beat you just like your father, don't even bother\nHowever nigga, whatever nigga, who wanna follow?\nIt gets coarse like the calice of a struggling black foot under privilege\nI'm quick to stick you for your whole bank book\nBitches follow my bounce and follow my flow\nFollow me now, follow me later, follow my glow\nAyyo, follow instructions and follow the pro\nAnd to follow my magic, bitches wanna follow my doe\nKeepin ya bouncing, got all my people singin the hook\nGot bitches buggin like how niggas be wild in the brook\nLook, we street niggas, while you live by the book\nFunny nigga, ain't no need to shoot yourself in the foot\nFuck wit bitches that's gettin doe and they know how to cook\nIn every struggle, I always did whatever it took!\nSo all my niggas\n\n(Chorus)\nEverybody rise, everybody rise, everybody riiiiiiiiise\nMaryland, Michigan, Kansas, Kentucky, Alabama, Indiana, Utah, c'mon!\nEverybody rise, everybody rise, everybody riiiiiiiiise\nPhoenix, Memphis, Nashville, Mississippi, Rhode Island, Colorado, Wyoming, fuck it\nEverybody rise, everybody rise, everybody riiiiiiiiise\nIdaho, Illinois, Minnesota, Missouri, Oklahoma, Overgod, South Dakota, come on!\nEverybody rise, everybody rise, everybody riiiiiiiiise\nAll my five boroughs, Brooklyn, Queens, Yorksman, Hatinstaton alley niggas, come on!\n\nHa, yeah, everybody rise, come on\nEverybody rise again, rise wit me mufuckas\nAs I welcome you all to the genesis\nA whole new foundation, A whole new idea\nA whole new experience\nA whole... entire... new... movement\nBusta Rhymes, Flip Mode Squad, I salute y'all\nYeah, yeah, come on, everybody riiiiiiiiiiiiiiise\nYeah, yeah, enough of the intro shit, let's get straight to it", "image": "https://images.genius.com/4102489ca8934c81cdf553b85cec18fd.1000x1000x1.jpg"}], "artist": "Busta Rhymes"}