{"songs": [{"title": "Senior Skip Day", "album": "K.I.D.S", "year": "2010-08-13", "lyrics": "[Intro]\nKids\nKids\nHa-ha\n\n[Verse 1]\nI'm just high, why they hatin' on me?\nPeople tend to think all the drinks on me\nI don't even have no money to spend\nTo buy Patron for you and all your friends\nBaby, I be on my grind, rain, sleet, snow\nRollin' up good every place we go\n'Cause we tryin' to get high, get high, get high\nKnow the bullshit and all the problems, but we too gone to see\nLittle bit of this and a little bit of that\nWe proceed to give them what they need\nJust wakin' up then gettin' stoned\nRub my eyes and check my phone\nOpen up the fridge to make some waffles\nBut no more syrup left in my bottle\nDamn, well, it's okay\nI top it off with scrambled eggs\nAyy, gotta work with watcha got\nAyy, gotta work with watcha got\n\n[Chorus]\nSupposed to be in class but I ain't goin'\nLet's chill on the couch\nSee what's on the telly\nGirl, we won't leave the house\nCan ya stay a while?\nCan ya stay a while?\n'Cause girl I'm feelin' lazy\nAnd I'm tryna hang around\n\n[Verse 2: Mac Miller]\nAin't tryna get out of my bed till noon\nNeighbors smell the perfume smoke in my room\nAnd I got the door closed can't be sure though\nAmsterdam weed, spendin' euro's\nGet the herb rolled,let's relax\nTake your shoes off and kick it back\nWe escaped the world, escaped the stress\nBut I don't give a fuck if the house a mess\nCause we gonna handle that later, we gonna handle that later\nRight now lets get this paper and smile for all them haters\nAye cream cheese and a bagel, have a glass of milk and an eggo\nI'm rockin' PJ's and no shirt, I smoke weed, eat yogurt\nHaha, enjoy the best things in your life\nCause you ain't gonna get to live it twice\nThey say you waste time asleep, But I'm just tryin' to dream\n\n[Chorus]\nSupposed to be in class but I ain't goin'\nLet's chill on the couch\nSee what's on the telly\nGirl, we won't leave the house\nCan ya stay a while?\nCan ya stay a while?\n'Cause girl I'm feelin' lazy\nAnd I'm tryna hang around\n\n[Outro (Sampled)]\nHardcore pound fucking. That's the shit, right there.\nNo, no, no, no. Hell yeah. Yo, that’s the only way to do it, man. It’s that boom boom boom, man.\nYeah, man.\nI know, but there’s a difference between making love, having sex, and then fucking.\nRight, right.", "image": "https://images.genius.com/b7b181331518245aabbe770526a08ae1.275x275x1.jpg"}], "artist": "Mac Miller"}