{"songs": [{"title": "Nothin’ On You", "album": "Extra Lasers", "year": null, "lyrics": "[Hook: Bruno Mars]\nBeautiful girls, all over the world\nI could be chasin' but my time would be wasted\nThey got nothin' on YOOOOOOOOOU, baby\nNothin' on YOOOOOOOOOU, baby\nThey might say hi, and I might say hey\nBut you shouldn't worry, about what they say\nCause they got nothing' on YOOOOOOOOOU, baby\nNothin' on YOOOOOOOOOU, baby\n\n[Lupe Fiasco]\nYou already know where my heart be at\nTempo that my heart beat at, boom boom\nThat for you, for real, for truth\nThere's never been trivial pursuit\nMay look like a sedan man but I'm really just a coupe\nNow that's two, so they can't fit, there's no room\nAnd there's no roof, so there's no limitation\nLimitless, since it's initiation\nAnd to the crew, seed sown, then it grew\nWas a pilot now we in syndication\nAnd every time we show up this Pay-Per-View\nOr the news, you're my satellite, that Youtube (tell 'er!)\n\n[Hook]\n\n[Lupe Fiasco]\nOn my microphone hustle, stay behind the bar\nAnd I thought I could never be imprisoned\nThis the story of how you caught me slippin'\nThat's right, locked up abroad\nYou remain, they mirage, they collapse, we collage\nWe stick together like we starting fires\nThick as thieves, pick pockets at large\nKinda like lame miserab's\nBut we don't play, Broadway's for the stars\nShe's venus, and me's mars, so we like on a whole 'nother chart\nSurreal, it's like a whole 'nother art\nHanging at the moment, and we got our names on the A-train cars\nLike freedom meets cars, coming down banging knocking pictures off the walls\n\n[Hook: Bruno Mars]\n\n[Lupe Fiasco]\nSo what more? Further I could go into\nBut what for? We're already killing them\nWe're like Williams and Woods on tour\nNow that's love above par, ooh\nI just love to love ya'll, you're my power\nMy peace, my elegant flowers\nNo matter what the world is coming to\nI take the rap, they got nothin' on…you\n\n[Lupe Talking Over Hook]\nHeh..you know what I'm sayin'?\nI mean, temptation is a mother\nBut you're like none other\nThey can't compare\n's why I'm here, you know?\nIt's like FOR-ever, that's like a long time (haha)\nYeah, the vibrations are very nice on this one\nLupe, let's go…PEACE!", "image": "https://images.genius.com/6064ad68b3a05d49650aa973fff2bff4.500x500x1.jpg"}], "artist": "Lupe Fiasco"}