{"songs": [{"title": "Ball To Da Max", "album": null, "year": "2010-11-10", "lyrics": "[Intro: Meek Mill]\nDream team! Here we go again! We do this!\n\n[Verse 1: Meek Mill]\nI got a neck full of hate, wrist full of jealousy\nWhen I was 18, that's when I caught my first felony\nNow, I'm in a Phantom, just a cruising like Penelope\nDipping like the blue cheese and counting all the celery\nAll this bullshit coke, fuck is niggas selling me?\nThey got me in the studio, rapping; making melodies\nJust to get my cash back, tryna get my stash back\nNightmares of being broke, man, I be having flashbacks\nNigga fuck my bitch, you better ask him where the cash at\nAll white Mazaradi, looking like a lab rat\nNigga broker than a Joke, why you think you're laughed at?\nI'm a rude boy, Top Shotta like Mad Max\nWe was at the club, she told me \"Teach me how to dougie\"\nTook her to lofts, she told me \"Teach me how to suck it\"\nShe only wanna fuck me cuz she know I get that money\nI don't know what that bitch thinking, she can't get a dollar from me!\n\n[Chorus: Meek Mill]\nWe ball to da max, all we know is spend it\nAnd go and get it back\nShe all on my dick cuz I make a lot of paper\nAnd I know I'm winning cuz I make a lot of haters\nSwag on 100, my wrist on froze\nMoney, cash, hoes; that's all a nigga knows\nI say money, cash, hoes; that's all a nigga knows\n\n[Verse 2: Meek Mill]\nGotta go to court tomorrow, and I'm a wear my Audemar\nAnd shit all on the D.A., kill em on a weekday\nOnly hit her once and now she want an instant replay\nI'm bout to start selling dick, put it on EBay\nAll the girls'll buy it, you should come and buy it\nI'll let you eat it all; put you on my dick diet\nShit, I ain't just spitting bitch, I'm getting rich by it\nNiggas say they getting money, come around and get quiet\nWe ball to da max with it, I'm in a Maybach, I'm in the back with it\nShout out to lil (?) he on the track with it\n2 9s like a hit em; Warren Sapp with it\nOk, I've been on my grind getting paper everyday\nShit, I think I'm married to the (?) everyday\nNigga crossed the line, I'm a send em (?)\nMatter fact, Nah, I'm fucking all their bitches anyway\n\n[Chorus: Meek Mill]\nWe ball to da max, all we know is spend it\nAnd go and get it back\nShe all on my dick cuz I make a lot of paper\nAnd I know I'm winning cuz I make a lot of haters\nSwag on 100, my wrist on froze\nMoney, cash, hoes; that's all a nigga knows\nI say money, cash, hoes; that's all a nigga knows\n\nMoney, cash, hoes, that's all a nigga know\nMoney cash, hoes, that's all a nigga know\nMoney cash, hoes, that's all a nigga know\nNike flow; I just do it, just do it, just do it, just do it, just do it", "image": "https://images.genius.com/6929169de7116d41676151bdea5cc773.1000x1000x1.jpg"}], "artist": "Meek Mill"}