{"songs": [{"title": "Framed", "album": "Revival", "year": "2017-12-15", "lyrics": "[Verse 1]\nFeeling kinky, lip syncing to Too $hort's \"Freaky Tales\" (Biatch!)\nHaving creepy visions of whiskey drinking\nAnd envisioning sneaking into where Christie Brinkley dwells\nI know this is risky thinking but I wanna stick her like she's decals\nBut when murdering females\nBetter pay attention to these details or you could be derailed\nBetter wear at least three layers of clothing or be in jail\nIf you get scratched because your DNA'll\nBe all up under her fingernails\nMan, he hears you, I don't think he cares\nHe gives a fuck, even his pinky swears\nThree personalities burstin' out of me, please beware\nHer TV blares, can't hear the creaking stairs\nShe's unaware in no underwear, she's completely bare\nTurns around and screams, I remember distinctly\nI said \"I'm here to do sink repairs.\"\nChop her up, put her body parts\nIn front of Steven Avery's trailer and leave 'em there\n\n[Chorus]\nBut hey man, I was framed\nI know what this looks like, officers\nPlease just give me one minute\nI think I can explain\nI ain't murdered nobody\nI know these words are so nutty\nBut I'm just here to entertain\nHow come your shirt is so bloody?\nThere's a missing person, so what? He's\nGot nothin' to do with me\nI'm almost certain I was framed\n\n[Verse 2]\nWoke up, it was dawn, musta knew somethin' was wrong\nThink I'm becomin' a monster 'cause of the drugs that I'm on\nDonald Duck's on, there's a Tonka Truck in the yard\nBut dog, how the fuck is Ivanka Trump in the trunk of my car?\nGotta get to the bottom of it to try to solve it\nMust go above and beyond, 'cause it's incumbent upon me\nPlus I feel somewhat responsible for the dumb little blonde\nGirl, that motherfuckin' baton twirler that got dumped in the pond\nSecond murder with no recollection of it\nCollectin' newspaper articles, cuttin' out sections from it\nMemory's too fucked to remember, destructive temper\nCut my public defender's jugular then stuck him up in a blender\nAnother dismembered toddler discovered this winter probably\n'Cause the disassembled body\nWas covered up in the snow since the month of November oddly\nI'm wanted for questioning\nThem son of a bitches probably just wanna pin this on me\n\n[Chorus]\nBut hey man, I was framed\nI know what this looks like, officers\nPlease just give me one minute\nI think I can explain\nI ain't murdered nobody\nI know these words are so nutty\nBut I'm just here to entertain\nHow come your shirt is so bloody?\nThere's a missing person, so what? He's\nGot nothin' to do with me\nI'm almost certain I was framed\n\n[Verse 3]\nStill on the loose, they\nSpotted me inside McDonald's Tuesday\nIn a Toronto Blue Jays cap, lookin' like your college roommate\nWith Rihanna, Lupe, Saddam Hussein, Bobby Boucher\nOr was it Cool J? The cops is on a goose chase\nJust escaped from the state pen\nFor [edited] eight women who hate men\nDon't make it no weirder, I'm naked\nWhen I break in your basement\nUnder your baby's play pen, I lay in, wait adjacent\nFacin' the door, remainin' patient while stayin' complacent\nBlatant sexual implications are continuin' to get thrown\nInsinuations are placed in little riddles and poems\nLeft on your pillow in hopes, that when you get home\nYou'll get the hint, ho: I'm in your window\nBut it never occurred to me I could describe a murder scene\nIn a verse and be charged with first degree\n'Cause it just happened to match up perfectly\nWith the massacre or the Burger King burglary\nNo, officer, you see ...\n\n[Chorus]\nI was framed\nI know what this looks like, officers\nPlease just give me one minute\nI think I can explain\nI ain't murdered nobody\nI know these words are so nutty\nBut I'm just here to entertain\nHow come your shirt is so bloody?\nThere's a missing person, so what? He's\nGot nothin' to do with me\nI'm almost certain I was framed", "image": "https://images.genius.com/edd76153e7ac3ec36be997aea55f32ed.1000x1000x1.png"}], "artist": "Eminem"}