{"songs": [{"title": "No Problem", "album": "Deeply Rooted", "year": "2014-04-22", "lyrics": "[Verse 1]\nGreatest ever done it, you can learn from it\nDope game; ran it - rap game; run it\nStreet cred hundred, nerd turned D-boy\nNaughty genetic make-up, baby, I'm a G-boy\nHashtag street-boy, wrong one to fuck with\nCross me at your own risk, play to get back, you can trust this\nI am far from average, to me it ain't no such thing\nMe against the world so fuck it I let my nuts hang\nI've been known to bust bang, Kíli of the NEB\nI don't need an army when the smoke clears, he sees me\nRhyming at its finest unlike those vaginas\nThey claim that they the real deal knowing I'm the highest\nTime for the command chain, I am what the streets made\nI am what the hood built, you are just a weakling\nHomocidal maniac with suicidal tendencies\nYou're more like a punk band, I'm more like a pedigree\nNigga, you ain't seen yet so y'all can not describe me\nI'm a freak of nature, Don't shit here suprise me\nMoney over everything except a nigga's manhood\nI am not a prostitute, you don't understand hood\nFuck a nigga getting his unless he 'bout to give me mine\nOtherwise he prime beef, shocking when I up the nine\nAnd hit him with it several times, fuck you thought I was civilized?\nWelcome to the jungle, fool, it's only right I punish you\nNigga with an attitude, feel like MC Ren felt\nQuiet on the set, you funky bitch, you get your friend slept\nI'll give your gang a black eye, blame it on the black God\nI be on some nigga shit, I'm nigga rich so that's why\nGuess what my religion is, this is what the business is\nExpose you for your garbage ass rappers, you can witness this\nCame to bang the game up, pussies think they came up\nOh, you got a drophead? So now you think you're famous?\nOut here it's dangerous, if we don't know your name cuz\nWe don't even give a fuck, rappers get it fucked up\nSecurity save you? Nah, it's their side job\nThey don't want no conflict, they don't want no problem\nNah", "image": "https://images.genius.com/8962738e6fdff4298d09683da33f7a92.1000x1000x1.jpg"}], "artist": "Scarface"}