{"songs": [{"title": "Many Rivers", "album": "No Genre Pt. 2", "year": "2014-03-18", "lyrics": "[Intro]\nMany rivers to cross (you ain't got to ask me what I do this for)\nBut I can't seem to find my way over (I do this for my city)\n\n[Verse 1]\nConstantly on the come up, constantly on the come up\nBut I always get this feeling and it's constantly on my stomach\nI learned to always follow my instinct, when you come from where I come from\nThey try to make a nigga feel like King Kong in the concrete jungle\nDamn, cause they don't teach niggas how to deal with anger\nNah, they only teach niggas there ain't nothin' real but danger\nPolitics will not swing in our favor\nCause all of us are rappers or entertainers\nBut I still woke up and said, \"Young nigga, get it\"\nCause this is your life you can choose how you live it\n\n[Hook]\nAre we just lost in the city of madness?\nOr do the powers that be just lack human compassion?\nI don't know...\n\n[Interlude 1]\nAnd they don't want you to speak the truth, man\nSee when you speak the truth they like to make you feel crazy\nBut you ain't crazy, don't let them lie to you\nWhoever you are, you out there\nKeep doing you, man, fuck the haters\nLet 'em hate, let 'em hate\n\n[Verse 2]\nYou only get one life, you know\nAnd this life ain't in my control\nWhen you talk about politics, it's a rod for a lightning bolt\nTell me how do you fight a war when the price is for your soul?\nWhen you gambling with your life, that's a hell of a pair of dice to roll\nThey say, \"Bobby Ray where you went? All you talk about is whips\"\nI say you can lead a horse to water but you can't make it take a sip\nYeah, everybody got their own two pennies\nBut what does that mean if it don't make sense?\nI see the crowd, their hands up high\nBut what does that mean? What do they get?\nAt the end of the day what I get paid and they go home what do they think?\nHow can we ever be free if policies don't ever change?\n\n[Hook]\n\n[Interlude 2]\nYou know, sometimes it feels like it's just against the world, man\nWho really got our best interests, man?\nDon't, don't, don't let 'em take your soul, man\nDon't, don't, don't let 'em take your soul, don't take your soul\n\n[Intro]\n\n[Outro]\nNo Genre\nPeople ask me what No Genre means\nYou know, I once did a mixtape called No Genre\nI didn't realize that no genre man, like no genre really described my career\nPeople started, like, gravitating toward No Genre and, you know, I was like, \"Fuck it, let's do a part two\"\nIt really can't be defined by any genre, so\nFuck it man, No Genre", "image": "https://images.genius.com/07af9b12b2956baf31b88d2ae47697d2.500x500x1.jpg"}], "artist": "B.o.B"}