{"songs": [{"title": "Facebook Q&A", "album": null, "year": "2013-11-07", "lyrics": "Q: Why don't you smile?\nA: ain't shit funny\n\nQ: Where is the toy warehouse?\nA:  google that shit\n\nQ: Do you put Nutella on your waffles in the morning ?\nA:  í've been doing the berzerk face for two months straight\n\nQ: Hi! Which person from history, do you most admire.. and why??\nA:  ali, wasn't afraid of any challenge\n\nQ: Did you overcome your fear of giraffes?\nA:  no, just sick of sticking my neck out for people\n\nQ: If you could go back and change one thing about MMLP2, what would that be and why?\nA: I would have added \"don't front\" on to the deluxe bonus disc but we didn't clear the sample in time\n\nQ: What made you change your hair color again?\nA: slim shady's back bitch\n\nQ: How are you doing?\nA: good\n\nQ: What tips can you give to people who's just starting to write songs\nA: keep writing\n\nQ: i dont know what i ask :/\nA: i don't know what you say\n\nQ: Ladies send me a friend request. married or single:) friends are always good:)\nA: sned this guy a friend request\n\nQ: do you even lift?\nA: fuck yeah bro\n\nQ: What is your all time favorite thing to do while you wind down from a busy day?\nA: nintendo bitch, run punch jump\n\nQ: do you have a dog?\nA: nope\n\nQ: What do you think of Macklemore and Ryan Lewis and their style? What other artists do you like?\nA: I think they made a great album\n\nQ: how long did it take to write \"Rap God\" ?\nA: six minutes and one second\n\nQ: What do you think J.Cole?\nA: He is dope\n\nQ: What tips can you give to people who's just starting to write songs\nA: keep writing\n\nQ: Who's your favorite comic-book hero?\nA: spiderman\n\nQ: That Ken Kaniff in Wicked Ways skit, damn man, laughed so much\nA: thanks, me too\n\nQ: Are you the first rapper to smack a bitch or say faggot?\nA: apparently yes\n\nQ: Who's your favorite basketball team?\nA: detroit pistons\n\nQ: what time is it there ???\nA: you have no idea how funny that is\n\nQ: what is your favorite TV series/show?\nA: the wire\n\nQ: Favorite spot to masterbate outside of home?\nA: mcdonald's bathroom\n\nQ: What's your favorite Mexican food mother fucker\nA: taco's bitch!\n\nQ: Awesome!\nA: indeed\n\nQ: what is byour favorte NFL team\nA: the lions\n\nQ: Why do you hate the broncos so bad?\nA: i don't, matthew does\n\nQ: Did you ever stroke Rick Rubin's beard in the studio to get ideas?\nA: no, we only sampled \"the stroke\"\n\nQ: I wish you could see my questions\nA: i kinda just did\n\nQ: Can u mix your own track alone? I mean Eq Compression etc\nA: pretty damn close\n\nQ: what inspired you to start rapping?\nA: ll cool j\n\nQ: Ever eat Jets pizza? Best thing about warren MI when I visited :)\nA: fuck yeah, its delicious\n\nQ: How do you keep a straight face when you incorporate so many awesome puns in your lyrics?\nA: i laugh enough when I am recording them, thats why I never smile\n\nQ: Do you do cleaning at home? :D\nA: i wipe my own ass\n\nQ: How are you doing?\nA: good\n\nQ: What is one thing that you get annoyed at the most ?\nA: when people keep asking me if I am retiring\n\nQ: Have you had a nose job\nA: if I did I should sue the doctor\n\nQ: Why don’t you follow anyone on Twitter?\nA: always be a leader, not a follower\n\nQ: I would cry if you saw this ;(\nA: start crying\n\nQ: Im sure that you are not going to see this comment..\nA: boy were you wrong, gotta wrap this up. thanks everyone for the questions, I got to get back to work", "image": "https://images.genius.com/b379811c1415017b9f3e3a71b9d26060.400x400x1.jpg"}], "artist": "Eminem"}