{"songs": [{"title": "Juice", "album": "Young Sinatra", "year": "2011-09-19", "lyrics": "[Intro]\n\"Hmmm, yeah!\"\nSinatra\n\n[Verse 1]\nAight, yeah, yeah, homie I'm comin'\nI'm coming and I'm never gonna give up\nMy mentality is making rappers feel like\nThey can never even live up to Logic\nYou bust I dodge it\nThink you seein' me, nah, you just miragin'\nI'm gunnin, I'm gunnin like a semi-automatic\nThat’s fully equipped with lyricism, I'll let 'em have it\nI blast it, any style that you comin' at me with\nI master it, I slam mothafuckas that I'm out on you bastards\nSyke, I'm just playin' with y'all\n\n[Verse 2]\nYeah, you know I had to keep it going\nKid rhymes that blow minds and C4in\nReal recognize real and you lookin' foreign\nI was spittin' flows before I was even born in the womb\nAnd I'ma keep it up until the tomb\nAnd as for the fame, yeah I know it's coming soon\nCause I'm goin' in raw, finna bust up in your room\nI hit a beat and it's ergence to emerge in the game\nPukin Hodukens I'm too sick to spit that Yoga flame\nThe way I see it, this is rap second renassaince\nSpittin' dirty sentences, so ill they affecting medicine\nHa, I'm heaven sent and spittin' fire like a demon\nAs the internet I let my flow to get to streamin', I'm beamin'\nFlawlessly listen in that women in yo head while you dreamin'\nLeo Dicaprio flow all up in that bitch schemin'\nTryna' get you to buy that album, tryna get you feenin'\nSee my vision as I commentate it\nYou wanna see naked rerun of the bait but the hater ate it\nSuccess is truly overrated\nI've seen caster with a blow up to pop and get deflated\nSee yeah, you made it but all your fans hate it\nAnd it's kinda lookin' like you and Satan negotiated\nWhen it comes down to the rap game you see I'm integrated\nHalf-white, half-black I had it incorporated\nGet the money\n(Whoever did this is a real pro)\n\n[Verse 3]\nYeah, I'm just a youngin' with a dream\nWho spittin' 'til sixteen\nQuite the microphone fiend\nOther rappers nah'mean\nWhen I step up on the scene\nAll they gon' see is my skin\n'Til I open up my mouth and they find out my lyrics mean\nHad a meeting with Raheem\nDre and the whole team\nBut before I execute a perfect plan I gotta scheme\nCause right now I'm on the dolo\nEverything about this tape I did it on the solo\nYeah, I said it's hurricane Logic\nMaryland can't dodge it\nThey gon' be bumpin' me from the burbs to the projects\nI get on the mic and excite anybody around me\nYou're probably wondering why a label has not found me\nIt's not that easy, I gotta work from the ground\nBe the center of attention, look at the people around me\nBlack on the inside, my outside Ritz\nWhat's a cracker without the cheese?\nI gotta stack chips\n\n[Outro]\n\"Would you care for a glass of grape juice?\"\n\"Nigga, what the fuck is juice?\"\n\"You have interfered with our affairs for the last time.\"", "image": "https://images.genius.com/6118bfdbbde22320e3c6bc130e1772d3.1000x1000x1.jpg"}], "artist": "Logic"}