{"songs": [{"title": "Na-Nana-Na", "album": "Sweat", "year": "2004-09-13", "lyrics": "[Intro: Nelly and Jazze Pha]\nMan, to tell you the truth, I just wanna go to the club\nYeah, me too\nKnow what I'm talkin' 'bout?\n\n[Jazze Pha]\nLadies and gentlemen! Ladies and gentlemen\nThis, is truly an event\nNelly Nel, Jazze Phizzle, Jazz Phiza-fel\n(Na-nana-na, nana, nana, nana) Woooo-eee!\n(Na-nana-na, nana, nana, nana) Woo, woo, woo, oh boy!\n(Na-nana-na, nana, nana, nana) Oh boy! Ohhh!\nHey, hey hey hey hey hey hey\n\n[Hook: Nelly]\nWell uh-huh, well uh-huh girl I'm parked outside\nAnd you know that it's sittin on chrome, chrome (uh-huh)\nHey, I'm just lookin for a pretty young thang\nThat uh, I can take home (take home)\nCan we leave hurr (yeah) can we leave hurr (yeah)\nCan we leave hurr (yeah) can we leave hurr - shorty can we\nLeave hurr (yeah) can we leave hurr (yeah)\nCan we leave hurr (yeah) can we leave hurr (yeah)\n\n[Nelly]\nI'm throwin nuggets out the fellow I push to Carmello\nYellow on yellow flooded the band and the bezel\nHear me now! Oh, no, the U-City hero\nI took the Phantom to the Opera, same van roll through the ghetto\nCan we leave hurr? Shorty need to make up her mind\nI seen them niggas over there, but they ain't takin my shine\nGot 7 niggas tryin to be me, out here breakin they spine\nBut they got 7 different levels for they minions to mind\nI want you both shorty (oh) go get it crunk shorty (oh)\nI see your A-T-L stamp and go' head and stomp shorty (oh)\nI got that shake now, and don't be scared now\nCause we can come from the kitchen up to that bed now\nShit it ain't nuttin to a boss, I heat you like air off\nIt ain't nuttin, they ain't cuttin, they frontin, that's they loss\nCause the, 'Tics is good, and the van is paid off\nAnd I done got so damn cocky I took that Band-Aid off\n\n[Hook]\n\n[Nelly]\nUhhhhhhhh, picture perfect, I paint a perfect picture\nThird album, same focus, my intent is to get richer\nI'm with my dirty Jazze Phizzle, he yieldin that instrumental\nYouse a cold-ass nigga on the track (SHO' NUFF!)\nMan - I'm tired of poppin these bottles, tired of fuckin these models\nI'm tired of these Menage-a nights - yeah right (PSYCH!)\nI was built for it, I got hip for it\nI even got a little swagger in my limp for it\nI done had, sex in the city plus sex in the country\nYou know - sex in the zoo di-rectly behind the monkeys\nHold up! Don't get me wrong, I'm lookin for Ms. Right\nBut tonight ain't the time, I'm lookin for right now\nIt's two-thousand-fo', I'm in a new home\nThrew out the Bentley bought a Double R for kissing does\nIt's like I'm rolling under permanent mistletoe, I think you been sittin low\nI got a driver dirty, he come when the whistle blow\n\n[Hook]\n\n[Nelly]\n(Na-nana-na) I'm smoother than you know\n(Na-nana-na) Cadillac do's and bank rolls\n(Na-nana-na) I simply go places you can't go\nAin't see me in no Linc', but you know that derrty in Brougham\nI be on my (grind-na-grind-na-grind-na-grind)\nWith my money on my (mind-my-mind-my-mind-my-mind)\nPlus I'm still in my (prime-my-prime-my-prime-my-prime)\nAnd we be smokin that (la-lala-lala-lala)\n\n[Hook]\n\n(Na-nana-na, nana, nana, nana) - {*repeat to fade*}", "image": "https://images.genius.com/d228092985a51eeb2d4700f76161a5bc.600x600x1.jpg"}], "artist": "Nelly"}