{"songs": [{"title": "Streets of Music", "album": "The Wonder Years", "year": "2011-09-27", "lyrics": "[Hook: Von Pea]\nI said it’s a wonderful year\nI said it’s a wonderful year\n\n[Verse 1: Von Pea]\nHere we go, ugh\nYoung enough for iPods, old enough for Walkmen\nToo young for park jams\nBy the time I came they sealed street lamps\nNo more of that vibe\nBut everywhere I went, they would still rap, I\nGrew up in Bed-Stuy, real life Mookie\nListening to “Buggin’ Out,” walkin' past Pookie’s\nI guess it helps build character\nOlder guys listening to Kane, talkin' Africa\n“Smooth Operator,” Cee on the fader\nCee led to B.I.G. and you know what came later\nYou wanna talk music in the streets?\nImagine “Hypnotize” blastin' as his body was carried through Bed-Stuy\nDiddy had Ma$e and the cops did too\nPepper spray during our brother’s parade\nWe just wanted to send him off properly and thank him\nMusic our outer sanctum, it’s a wonderful year\n\n[Hook: Von Pea]\nI said it’s a wonderful year\nI said it’s a wonderful--\n\n[Verse 2: Donwill]\nFell in love face first when I heard Kane’s verse\nMaybe it was Todd Shaw, life is Too $hort\nSounds like it cuz it made life matter\nMan the music in them streets, made a lot of moments magic\nLike the first song you played when you got the L’s\nI was probabaly bumpin' Ant Banks or Quik myself\nIn my mom’s whip, frontin' tryna get at some girls\nHouse speakers in the hatchback, the shit sounded terrible\nI'm form Ohio so when Bone Thugs dropped\nSlid that in the deck right next to Pac\nThen I moved to Carolina when that Outkast dropped\nAnd blew big weed bumpin' CNN and Nas, but\nNow I'm in the Stuy where they set up shop\nPull the sound system out and yellow tape the block\nThey can hate it online, but if the streets say go\nOff of Kenwood spins you’d be ghetto gold\nYo!\n\n[Hook: Von Pea]\nI said it’s a wonderful year\nI said it’s a wonderful year\n\n[Verse 3: Enigma]\nYo, yo, check\nMusic in the park, that pure art\nThe year marks the real, for real\nPac and B.I.G. in that stereo shit\nPoppin' wheelies to the sounds to the Illadelph\nHalflife roots to the past, they feel it past, get mad hyped\nHear that Nas then they act right\nBoom bap raps, like comin' from the back of the Acc\nThem Wu tracks had us breakin' our necks\nKept them haters in check\nKept them tapes in the deck\nMan we played em to def, had mad flavor\nBefore swag, you heard the urge to stack paper\nMajor game players, the fame made em some mainstayers\nThen we zone out\nOld heads told us to turn it down\nHad a couple of lame neighbors saying we run it loud\nThey shut it down, never that, ever that\nStill bumpin' hella tracks\nLil flavor for your ears to get that feelin' back\nLet’s go\n\n[Hook: Von Pea]\nI said it’s a wonderful year\nI said it’s a wonderful year\nI said it’s a wonderful year\nI said it’s a wonderful year", "image": "https://images.genius.com/8d727a22a4d1d05ff7dc9a2ed5ca0c53.1000x1000x1.jpg"}], "artist": "9th Wonder"}