{"songs": [{"title": "Living the Life", "album": "Duets: The Final Chapter", "year": "2005-12-20", "lyrics": "[Notorious B.I.G] + (Faith Evans)\nTo my motherfuckin' man, fifty grand, the alcholic man\nInject a tall can in his blood stream if he can\nBiggie Smalls, the pussy stroker\nEmcee provoker, the chocolate tah smoker (huh?)\nI like to mack in Maximas and Acuras\nYour girl butt cheeks, I'm smackin' (huh?)\nThe raw rapper, spot smacker\nWit the lil hooker on my lap-ah, you know your favorite macker\nA shy nigga, but I ain't ya fuckin' comforter\nAnd If I ever fall in love, I better fuck it up\nAsk the hooker, If I didn't jug her\nShe try to front, then I put the Chucky Booker on her\n(Why you wanna...play games on me?)\nBitch, you crazy? Commitments, I'm Swayze\nNo time for the ill shit\nMess with the niggas on that real blood spill shit\nMy rappin' tactics, are drastic\nStretchin' motherfuckers like Mr. Fantastic\nSo if you wanna see my Pedigree, you better be\nFilled with energy, niggas never gettin' me\n\n[Hook 2X: Bobby Valentino and Cheri Dennis] + (Ludacris ab-libbing)\nBig cities and bright lights\nShort days and long nights\nNo stress and no strife\nI'm high off living the life\n\n[Ludacris]\nIt's clear to see that I'm the motherfuckin' man, I done learned from the\nBest of em; Took the first slot, niggas still second guessin' em\nHoes, I'm undressin' em', foes, I'm not stresin' em'\nOutlastin' a bunch of 'em , outflowed the rest of em'\nCuz everyday, I stay preachin' on the pulpit\nSo tell them haters they could miss me with that bullshit\nBut I won't miss, I'm Luda, the heat holder\nI'm rich, bitch! I've done more shows than Oprah\nAnd I'm a soldier, ready for whatever\nRoll with a bunch of niggas that don't know no better\nKing like Coretta, countin' mo' cheddar\nJust hired two dykes to be my ho getters\nWhen it comes to these women, dog, ain't no one fuckin' wit me\nThey runnin' back, you think I had TJ Duckett wit me\nThat's cause I throw it like Vick, from the yard line\nMenage a trois, it's safe to say I'm havin' hard times\n\n[Hook] + (Ludacris ab-libbing)\n\n[Snoop Dogg]\nTo my nigga Chopper dot, with the whoopty-whop on the block\nGot the heaters cocked, cause I know the suckers on the block\nHennesey and Belve-D, brings a lot of jealousy\nNigga stop snitchin', nephew, why you tellin' me?\nThey say the game ain't what it use to be on (?)\nUsed to be a G, but now he just a ho\nRunnin' 'round poitin' fingers, tellin' names\nYou fuckin' up the rules to this dirty game, and it's a diry shame\nI ain't flippin' out, that's probably why I'm dippin' out\nYa'll fools trippin' out, that why I'm on a different route\nNow, makin' money, havin' clout, what's what it's all about\nTwenty seven cars and a tweleve bedroom house\nNow they call me Snoopy Trump\nI keep my heater close, cause I love to bust\nNow hat's a stain on a nigga, I bang on a nigga\nKick rocks and watch how I do my thang, young nigga; I'm livin' the life!\n\n[Hook] + (Snoop Dogg ab-libbing)\n\n[Hook] - w/o ab-libs", "image": "https://images.genius.com/09b1732dbce927085a1fca7538fc1bb3.500x500x1.jpg"}], "artist": "The Notorious B.I.G."}