{"songs": [{"title": "Get You Some", "album": "The Big Bang", "year": "2006-06-09", "lyrics": "[Hook: Marsha (& Q-Tip)]\nMoney, cars, clothes, sexy broads, plenty more, go.. get you some\n(Mansion, yachts, planes, Phantoms, bitch you better...) go.. get you some\n(Hustlin, jugglin, robbin, stealin shit, I gotta get this fuckin...)\nMoney, cars, clothes, sexy broads, plenty more, go.. get you some\n(Fortune, power, fame, passion for this shit you need to...) go.. get you some\n(Don't stop, nigga we ain't done, gun it through your fuckin road block)\n\n[Busta Rhymes]\nI'm sayin who told y'all to let a muhfucker back on the block\nWith the bullshit, see y'all done fucked up now!\nTurn the volume up and bang it out the trunk now!\nYou gotta problem son? Imagine how the club sound\nLook and see I'm ready to spark it\nSoon as I zoom on my target, muhfucker better roll out the carpet\nSee the way I comin through, and how I kick in the door\nWatch how I coffee grind like never before.. the way I wreck from the door\nSo immaculate, passionate, when I'm speakin\nI'm preachin, all my niggas out in EVERY HOOD!\nYou tryin to compete? You better be INCREDIBLY GOOD!\nNiggas you want heat? I figured you would!\nThat's I waste no time to give it to you niggas (this time)\nAnd give you all the jewels in (this rhyme), and then I put it down to you all!\nI can't get enough of it niggas, I gotta ex-plore (many)\nAll of my options, I gotta get me plenty more...\n\n[Hook]\n\n[Busta Rhymes]\nA lot of niggas shit sound dated\nI'm like Shaq, franchise player just got traded\nTo the number one team in the league\nSee I ain't on J Records, I'm on DRE Records, Aftermath BITCH!\nYou need to learn cause you ain't knowin the half, BITCH!\nAnd while I'm gone I'm puttin dough in the stash, BITCH!\nSo new and fresh I say it again\nSo what it do, don't test see I'mma blaze to the end\nI'm comin through, so confess you niggas know who the kid\nI'm like a newborn nigga, that's securing a win\n(HOT!) So new and so current and they hate this\nThe streets'll classify me in another level of greatness\nI'm here to fix up the game, I'm givin it a facelift\nNew and improved, watch the way I make the game shift!\nNow watch me swing it out the ballpark\nI come to shut it down, don't let the war start while I come to get the...\n\n[Hook]", "image": "https://images.genius.com/be78d5f1fcdafddac07407fe6e45d552.630x630x1.jpg"}], "artist": "Busta Rhymes"}