{"songs": [{"title": "KJOMD", "album": "E.B.A.H.", "year": "2012-09-18", "lyrics": "[Intro: Tech N9ne & Female voice]\nUh-uh-uh\nWhat?\nKJOMD baby\nWhat's kjomd?\nThis right here\n\n[Hook: Krizz Kaliko]\nI'm kinda jealous of my dick sometimes\nCause its always on their mind\nI'm kinda jealous of my dick for sure\nCause they seem to love you more, baby\nI'm kinda jealous of my dick you know\nBut it gets me what I need\nI'm kinda jealous of my dick for sure\nCause they love you more than me baby\n\n[Verse 1: Tech N9ne]\nYou ever been in a predicament\nWhen you and your lady are fussin'\nAnd cussin'\nAnd she dont wanna deal with you but you\nPull out your dick and get to stickin'\nHer and all of a sudden wanna chill\nAnd have a meal with you\nThats crazy right? She ain't even got a feel for you\nAll she want is the pecker to fetch her\nMy tally wacker to break her\nBack and no [chatter]\nWhen she mad at you no matter\nWhat kinda ill you do\nMy dick get all the love\nSo many women got jaws for blood\nThey even give draws they kissin balls but no kiss at all for mug\n(Hahh) I no my breath dont stink\nAny more neglect and my chest go sink\nBaby I want love and a kiss thang\nIt's pain\nBut I'm sayin' I'm kinda jealous of my dick, man\n\n[Hook]\nI'm kinda jealous of my dick sometimes\nCause its always on their mind\nI'm kinda jealous of my dick for sure\nCause they seem to love you more\nI'm kinda jealous of my dick you know\nBut it gets me what I need baby\nI'm kinda jealous of my dick for sure\nCause they seem to love you more\n\n[Verse 2: Tech N9ne]\nI can already see the call\nThey don't wanna be with me at all\nThey just wanna do D to balls\nI shouldn't a ever let it be free to ya'll\nCause my heart be hurtin'\nBut my private part be squrtin'\nI don't even get a touch it in spurts\nWhenever I'm lookin' for love and sex be certain\nI even have a lot sayin'\nI ain't givin you none but I can suck you off. Damn!\nI don't think I would ever cut you off\nCause look at the crazy amount of nuts you lost\nBut they all wanna bone me\nThey don't want to get to know me\nThey wanna dome me but I'm hungry\nFor lovin' I never get because of my dick, bitch I'm lonely\n\n[Hook]\nI'm kinda jealous of my dick sometimes\nCause its always on their mind\nI'm kinda jealous of my dick for sure\nCause they seem to love you more\nI'm kinda jealous of my dick, you know\nBut it gets me what I need\nI'm kinda jealous of my dick for sure\n\n[Verse 3: Krizz Kaliko]\nKali Baby!\nIt gets me in to problems and it gets me out\nGets me into arguments and don't even know what it's about.\nCall him the Black n' Decker pecker he's a home wrecker\nDrops 'em to they knees and he's a little chin checker\nSee it's either him or me\nLately we becoming enemies\nOnly likely when I'm in between them\nAnd they say they love me\nWhen I'm in the V\nI try to tell them get out\nAnd then they spit out\nAnd they scream my ding-a-ling they can't live without\nAbusin my unit, just wish they love me more then my middle\n\n[Outro: Krizz Kaliko]\nI said you love me but I hate you, Fo' Sho'\nYou can't see me but I've watched you\nKinda women that you love them (hoes)\nIf there's a way to stop it I don't, know, Kind of jealous\n(I'm kinda jealous of my dick you know)\nIt's crazy crazy crazy, I'm kind of jealous\n(I'm kinda jealous of my dick for sure)\nMy johnson, my unit, my peter, my trunk, my everything wrong\nI'm kinda jealous. Kinda jealous of my dick sometimes\nYeah...", "image": "https://images.genius.com/ecaf59e8351d366bc86005cc66afe532.800x800x1.jpg"}], "artist": "Tech N9ne"}