{"songs": [{"title": "A Penny For My Thoughts", "album": "Can I Borrow a Dollar?", "year": "1992-10-06", "lyrics": "\"Friends, Romans, Countrymen ... lend me a dollar! Ahh-ha!\"\n\"How much? A dollar.\"\n\"One dollar...\"\n\"I got your money. I got your poor, measly...\"\n\"One dollar...\"\n\"Can I borrow a dollar?\"\n\"Nigga you ain't shit. You wasn't shit when you was here! I seen you do that shit all that's the same shit you was doin' 'round the poolroom nigga. It ain't nothin'. Let me have a dollar.\"\n\"Can I have a dolla? One dolla.\"\n\"One dollar...\"\n\"How much? A dollar.\"\n\"One dollar...\"\n\"One beer? Man you gotta give me a dollar for a beer.\"\n\n[Twilite Tone]\nCheck this out\nOne time, steps a man\nCommon Sense and the Unamerican Caravan\nThe true b-boys, dem dere and we in here\nYeah, ya know, from the Southside of Chicago\nAnd we don't front\nWho me? I am Twilite Tone\nBabylon dread, Bumstead, and we come like DIS\n\n[Common]\nThis the start of somethin big\nMethink I knows ya gonna dig it\nIt's time to plant the seed\nHip-Hop's the tree and I'mma fig it\nFigure it out, the mic, I'm rippin it like a ligament\nGimme a light a Bud Light, and shit'll get lit just like a cigarette\nI'm a b-boy so don't test me, many rappers don't impress me\nYou try steppin into my city I'll, Snipe em like Wesley\nSo you best be on your way, I'm doper than Marion Berry, hey\nWake up everyday and make-up rhymes but I'm not Mary Kay\nSome say I'm dope as fuck, some label my rhymes incest\nMy flex is kinda Mean Joe, so hey kid, catch\nThese nuggets, these nuggets, these nugget ugget uggets\nWith some peas and a hole in the bucket (cool, cool)\nDear Liza, Minelli, I jam like jelly and I got\nHelly what, helly what, helly rhymes\nI can remember times when for a 40 I had to beg for bucks\nNobody really gave a, so I had to beg for fucks\nNow what do niggas do when they got not food\nSkibbidy skap and busta bust a rap\nSo I pick up the pen and then begin the thoughts to get to pumpin\nHopin like all the people let me talk, let me say somethin\nCause nothin for nothin leaves nothin, I got nuthin to lose\nI put, nuttin in my notes, I'm not your host when I got nuttin to use\nDues gettin credited, now I debit my bank account\nNot on a blind date, could I see me taken out\nBy some glutteus, glutteus, maximus, maximus\nI'm spas-ta-gis-a-mister-gis a mister-gis-ta-spas-ta-gis\nSpectacular, the papes I Count like Dracula\nYou can't cut the rug, because you suck, MC Vacumn Up\nRappers I stiff arm like Walter Payton\nTheir ain't no way or half-step, and flex a rhyme like a bicep\nSome steps with concepts, but umm, WHO cares\nNot even the damn People Under the Stairs\n\n[Twilite Tone]\nInterruption, interruption\nTrue b-boys runnin shit\nUnamerican Caravan, beatin you down\nDen dere's de man who don't stop\nYo Com, come back with some Sense, UHH\n\n[Common]\nDoo-doo-doo-doo-doo-doo, here I come, here I come (what?)\nA-doo-doo-doo-doo-doo-doo, here I come, here I come (yeah!)\nI'm comin around the mountain high as lower than a valley\nI'm the cat, from the alley, from the back, I'mma rally\nAnd tally up points, rollin joints, risin to the tops\nSomewhat of a playwright, cause like a stage I got props\nMy crew's a strange brew, a drink a day'll keep the stink away\nWe been through AA, but hey, what can I say?\nSay say say, what you want, but you'll pay the con-se-quences\nCause Mister Common Sense is (yeah)\nNot gonna take it, so leave you better believe it\nEven if your name ain't Ripley, cause Ripley don't know diddley\nHit me one time, two times, for the U-AYYY-C\nHeyyyyyy, but anyway\nI hit a skid, and I peel out like MC Eiht, damn I kill it\nEarn my money the old fashioned way - I steal it\nStop thief in the temple, I hit em with a blow\nSomebody done stole my beeper but I'mma steal the show\nI'm throwin a Heidi Ho into a bro and tellin her\nGo for what you know bruh, the people before me go under\nYo we gotta gotta get we gotta get we gotta get\nGotta get, gotta gotta gotta get get over\nSomewhere over the rainbow, I'm still the same old same old\nRingin around the collar, borrowin a dollar, check my balls\nDirty drawers, see the kitty suckin titties\nVideo watchin lush from the city\nI'm the extra-terrestrial, rappers phone home cause they have to\nThem marks be callin', Ork, come in Ork, Nanu Nanu\nThe perfect stranger, comin in to a, fuck a new land\nCause Jeffrey where I was born, and see I'm only human\nDoin anything to make a buck, what the fuck I gotta\nDo what I gotta go (*echoes*)", "image": "https://images.genius.com/e3b1b8cdac9f386a42441991d28a760b.624x624x1.jpg"}], "artist": "Common"}