{"songs": [{"title": "Gossip Folks (feat. Ludacris) (Hyped Up radio)", "album": null, "year": null, "lyrics": "[People in background chatting]\nYo, yo yo move out of the way\nWe got missy Elliott coming through\nGirl that is missy Elliott she lost a lot of weight\nGirl I heard she eats one cracker a day\nOh well I heard the bitch was married to Tim and started fucking with Trina\nI heard the bitch got hit with three zebras and a monkey\nI can't stand the bitch no way\n\nWhen I walk up in the piece\nI ain't gotta even speak\nI'm a bad mamajama goddammit motherfuckers you ain't gotta like me\nHow you studying these hoes\nNeed to talk what you know\nAnd stop talking bout who I'm sticking and licking jus mad it ain't yours\nI know ya'll poor ya'll broke\nYa'll job jus hanging up coats\nStep to me get burnt like toast\nMotherfuckers adios amigos\nHalf half pose pose\nI don't brag I mostly boast\nFrom the VA to the LA coast\nIffy kiffy izzy oh\n\nMusi ques\nI sews on bews\nI pues a twos on que zat\nPue zoo\nMy kizzer\nPous zigga ay zee\nIts all kizza\nIts always like\nIts all kizza\nIts always like\nNa zound\nWa zee\nWa zoom zoom zee\n\nWhen I pull up in my whip\nBitches wanna talk shit\nI be drivin I'm glad and I'm stylin\nThese motherfuckers ask did ya see it\nI'm gripping these curves\nSkerrrt, did ya heard\nI lovas my feathers, my furs\nAhh I fly like a bird\nChickenheads on the prowl\nWho ya tryin'a fuck now?\nNaw you ain't getting loud\nBetter calm down for I smack ya ass down\nI need my drums bass high\nHas to be my snare strings horns and\nI need my Tim sound\nRight, left\nIzzy kizzy looky here\n\n[Chorus]\n[Missy]\nAhhhhhhh\nSucka MC know I'm stupid fresh\nGet 10 percent dis knock the hair off ya chest\nCouple bottles of hypnotic just to wet down my tongue\nAnd say wip wip wack what cha playin me huh?\n[Eve]\nMe and Missy ballin up the avenue\nFunky fresh dress to impress we mackin dues\nMusic bizz only reason I ain't jackin fools\nYou know bullshit walkin, stackin rules\n[Missy]\nPeople keep brawlin the streets is callin\nDrink till im nice and ah ah ah on an\n[Eve]\nIm bad luck ya'll made cause ya'll suck\nPlease do not try to fuck with this young buck\n[Missy]\nPlease don't make us tell you how much you suck\nSissy\n\n(funky fresh dressed to impress ready to party)\n\n[Ludacris]\nOnce upon a time in College Park\nWhere they live life fast and they scared of dark\nThere was a little nigga by the name of Cris\nNobody paid him any mind\nNo one gave a shit\nKnowing he could rap\nNo one lift a hand\nSo he went about his business and devised a plan\nMade a CD then he hit the block\n50 thousand sold\nSeven dollars a pop\nHold the phone\nThree years later\nStepped out the swamp\nWith ten and a half gators\nNow all around the world on the microphone\nHe leave the booth smelling like Burberry cologne\nStill riding chrome\nGot bitches in the kitchen\nNever home alone\nAnd he's on the grind\nPlease let me know if he's on your mind\nAnd respect you'll give me\nLudacris I live loud like Timmy\nUh had to clear these rumors\nI got a headache and it's not a tumor\nGet up on my lap get my head sucked right\nSprayed so I never let the bed bugs bite\nHard to the core\nCore to the right\nYou drop down turn around pick a bale of cotton\n\n[Chorus]\n[People in the background chatting]\nYo, straight up Missy killed that shit tonight for real\nI know I know, I don't even care about her beign preganant by Michael Jackson\nYou know what we should do\nWe should go get her album when it comes out\nThere she go, there she go, there she\nHeeeey Misssy\n\n[Missy]\nHi Missy?\nWhat's up fools?\nYou think I ain't knowin yall broke Milli Vanilli\nJay Jay fan wannabes ain't over here gossiping bout me?\nYo how bout you buff these Pumas for 20 cents so your lights won't get cut off\nYou soggy breasts, cow stomachs\nYo take those baby GAP shirts off, too\nYou just mad cuz Payless ran out of plastic pumps for the after party\nYo by the way, go get my album\nDamn!", "image": "https://images.genius.com/085828b7d79bf8cf068b1557ca7a5e4c.1000x1000x1.jpg"}], "artist": "Missy Elliott"}