{"songs": [{"title": "Blow Your Mind", "album": "Whut? Thee Album", "year": "1992-08-27", "lyrics": "* see the remix for the full Korean verse + translation\n\n[Verse 1]\nAHHHH!! Look out, it's the Funkadelic Funk for chumps\nWho don't be knowin' my name, I tear the frame out ya punks\nI make ya slide, make ya slip, make ya wanna backflip\nI get biz with the skit, I DJ like Quik\nThe top notch of the block, 'cause I carry a Glock\nHoly hot rocks, I'm hot, so give up the props\nMy style is HUMMIN CUMMIN ATCHA, duck or get backed up\nDispatcher: 'Red, get freaky to the rapture'\nSo come on light the buddha, check your honey while I scoop her\nThe Superfly, Jimmy Fly Snuka rips the roof off\nThen hook off on your crew, to the checka one, two\nIt's you, who? (AGA-AHHH! WWAAAAAH!) Redman with the Kung-Fu\nCome on and get down and boogie oogie with the ruffneck\nHit women like Madonna all the way down to Smurfette\nBut first get your tables I roast your whole record label, kids\nYo E (Whassup, G?) Briiiiiidge!\n\n[Hook 2X]\n\"You blow my mind, baby\" \"I'll toast to that\"\n\"You blow my mind, baby\"\nPress rewind if I haven't blown your mind\n\n[Verse 2]\nI do the hustle like Russell, Rush the stage with Simmons\nDeadly venom, makes me Poison like Michael Bivins\nOr a cobra, pop more pop than Coca-Cola\nNext to Yoda, I'm a Star at War, plus roller coaster\nI got my mind made up GURRRRL\nCome on and get it if you widdit, troop\nKrush Groovin' smooth as the lightning loops\nThe kind of loops I sample from a James Brown group\nI give credit, 'cause I'm cautious, about lawsuits\nPsychoBetaP-Funk, got styles hard as tree trunks\nFor real, punk, you got a blunt, light it 'cause I need one\nAnd get down with the irrelevant funk to make ya jump\nWith the fly human being, watch me freak it in Korean\nChu ri ka pi kyura mulla kara\nNu gu nya nada na na nun Redman\nNa bo da challan nom hana do upda ...\n... Nah Duke, forget it\nI rip shop in hip-hop, I get props, my lip rocks\nThe rap stuff's more spooky than movies from Hitchcock\nSit back relax let me rip to the funk track\nAnd press rewind if I haven't blown your mind\n(\"REE-WIND!!\")\n\n[Hook]\n\"You blow my mind, baby\" \"I'll toast to that\"\n\"You blow my mind, baby\"\nPress rewind if I haven't blown your mind\n\"You blow my mind, baby\" \"I'll toast to that\"\n\"You blow my mind, baby\"\nPress rewind if I—HA-UHH...\n\n[Verse 3]\nLet me get busy with the funky fly stuff\n'Cause I cut your freakin' eyes out\nFuck Bruce Willis because I die rough\nIt's the Funkadelic Redman and I hit ya with the\nFunkadelic level, the P-Funk, the devil\nThe spectular, Blacula, bust holes like Dracula\nLoaded, of course, more Legend than Acura\nI'm swift, I like big spliffs so I tisk tisk a tasket\nPlus keep the Glock in my basket\nI cough up a lung 'cause I freak it with the tongue\n'Cause I can 'Wax on! Wax off!' like Daniel-son\nDo the yea yea, boogey say up jump the boogey\nTo the boogey to the boogey\nThanks to E 'cause he hooked me\nSo fuck what ya heard, word to herb\n'Cause I mac-a-frama-lama\nPlus I kick the grammar, straight from NEW JERZ\nIt's the renegade rap Redman, really who rip rhymes in rough mode\nYo, hold your breath while I explode!\n\n[Hook 2X]\n\"You blow my mind, baby\" \"I'll toast to that\"\n\"You blow my mind, baby\"\nPress rewind if I haven't blown your mind", "image": "https://images.genius.com/7f00f3a812da2a949568478da4a86ac0.350x350x1.jpg"}], "artist": "Redman"}