{"songs": [{"title": "We Put It Down for Y’all", "album": "Anarchy", "year": "2000-06-20", "lyrics": "[Intro]\nShit is about to get real serious\nBusta Rhymes, Flipmode Squad, Swizz Beatz, check it out\n\n[Verse 1]\nYo it's like tic tac toe\nThe god is back, make bitches say ho\nBlow shit, roast ya than down in Waco\nBigfoot raps nigga let's make dough\nPull up to the lot, valet the Range Rove\nFlyer than a motherfucker, all day glow\nIn the club nigga glow in the dark and lay low\nBang your head to this shit, while the beat play slow\nJunior varsity niggas while we play pro\nRingside seats we all in the same row\nLike a crew of bitches pull up in Dodge Durangos\nAnd how we dazzle these bitches with how we change flows\nWe take your slot, how a bitch take half\nAnd rock chains with pieces the size of spacecrafts\nYou know what I rep, that's Flipmode Squad\nWildin like a thousand niggas up in the wreck yard\n\n[Chorus]\nCallin' all live niggas, booyah\nCallin' all live bitches, ooh, ooh\nYes, I hold a pound for y'all, say what?\nBusta Rhymes hold it down for y'all, get money\nCallin' all live niggas, booyah\nCallin' all live bitches, ooh, ooh\nYes, I hold a crown for y'all, say what?\nFlipmode put it down for y'all, yeah, yeah\n\n[Verse 2]\nYeah, yo, the empire strikes back\nShit is official, street niggas fight back\nThe way we set it off even the bitches might black\nRaunchy as fuck, even they like it like that\nBusta Rhymes in this bitch you know I got another batch\nMore hotter shit nigga strike another match\nBang this shit in your truck, nigga open up the hatch\nAnd hold on your jewels before your shit get snatched\nBetter lock your doors, slide across the latch\nBefore we figure out the next vic to catch\nSo much lyrics flowin' to throw in a teacup\nMore crack for y'all we just reed up\nGutter like a piss test in a pee cup\nSwitch the bounce for the streets, had to change the speed up\nRaw for the bitches who thick and beefed up\nStrip a club, big titty bitches double D cup\nWe all up in the truck, what the fuck we treed up\nPure coke for niggas, get skeed up\nLet me bang something hard on your head like Vince Carter\nAnd charter jets for my niggas with automatic starters\nBlow shit regular like the UniBomber\nSurprise attack you niggas like fuckin Pearl Harbor\nJailhouse raps, let it bang a little harder\nWhile I rep for the fam, Busta Rhymes the godfather\n\n[Chorus]\nCallin' all live niggas, booyah\nCallin' all live bitches, ooh, ooh\nYes, I hold a pound for y'all, say what?\nBusta Rhymes hold it down for y'all, get money\nCallin' all live niggas, booyah\nCallin' all live bitches, ooh, ooh\nYes, I hold a crown for y'all, say what?\nFlipmode put it down for y'all, yeah, yeah\nCallin' all live niggas, booyah\nCallin' all live bitches, ooh, ooh\nYes, I hold a pound for y'all, say what?\nBusta Rhymes hold it down for y'all, get money\nCallin' all live niggas, booyah\nCallin' all live bitches, ooh, ooh\nYes, I hold a crown for y'all, say what?\nFlipmode put it down for y'all, yeah, yeah\n\n[Outro]\nSo remarkable\nClassic rugged nigga music\nBig truck shit\n20-inch rims on a UConn or something\nA fuckin Escalade, Navigator", "image": "https://images.genius.com/c03e10c88fa343cd2e7c18112c468983.1000x1000x1.jpg"}], "artist": "Busta Rhymes"}