{"songs": [{"title": "You Know, You Know", "album": null, "year": "2016-08-17", "lyrics": "[Chorus]\nYou know, you know\nYou know, you know\n\n[Verse 1]\nUh, you know you know how the story goes\nYou done jocked my style, you done stole my flow\nYou done seen me out, you gets no hello\nAnd you wonder why? Man you know you know\nYeah and you should let them boys know too\nShow them niggas every single thing I showed you\nI'm here feeling like 50 back in ’02, and everybody sayin' I'm the man, so true\nYeah but what does it take to feel secure?\nA place with wooden floors and space to put awards\nA couple of parking spots and maids to do the chores\nThe cars you always wanted, the women that you adore\nWell I got it, I got it\nI wonder if I'd be happy without it, I doubt it\nI try not to really think about it\nI made it but I'm still playin' like I'm bein' scouted 'til I'm out it\nGame time bitch, I hope you're proud of us\nKing James shit watch me throw the powder up\nThis OG got my whole suite cloudin' up\nAnd I bet you I be out of time before I'm out of luck\nThey ain't rootin' for me, they ain't clappin' for me\nI'm only sayin can somebody just be happy for me\nI really hate to say I told you so\nSo I bite my tongue but you know you know\n\n[Chorus]\nYou know, you know\nYou know, you know\n\n[Verse 2]\nUhh, please make your long story shorter\nCause time is of the essence for the king of first quarter\nNumbers do the talkin' I have nothing for reporters\nI just hope we make these flights and don’t get held up at the border\nYeah, so you can spare me all the accolades\nI'm the reason you can find my city on an atlas page\nHalf a million dollars later and my taxes paid\nAnd I'm still spendin' money from my actin' days\nDamn, life is such a lovely thing\nFeel the perks that a 7 figure budget bring\nTell your girlfriend that I can pull some fuckin' strings\nSo we're courtside when LeBron get a fuckin' ring\nYeah, I bet I be there I be there\nYou see that ’62 sittin outside? That's me there\nI'm jumpin to the top its my leap year, prepare\nPutting in that overtime I never said it'd be fair\nI'm always left wishin' I could have done it in person\nMy apologies to all of the ones I was hurtin'\nI got new girls but none of they love is for certain\nAnd call old girls but none of they numbers are workin'\nDamn, what happened to us?\nLife can always change, you have to adjust\nHow come when I got a party you stare at me in disgust?\nThey pay us just to have fun you should see that as a plus\nEspecially when I come flyin' through the door\nAnd kindly ignore, the paparazzi outside tryin' to record\nWhy has every woman never dined here before?\nAm I the only 23 year old wine connoisseur?\nThe Rothschilds, the Cru's, the Gajas and the Opuses\nIt's always nice when you're out with someone that notices\nMy condo got that art gallery openness\nI'm just really hopin' that that isn’t what the motive is\nThey ain't rootin' for me, they ain't clappin' for me\nI'm only sayin' can somebody just be happy for me?\nI really hate to say I told you so\nSo I bite my tongue but you know you know\n\n[Chorus]\nYou know, you know\nYou know, you know", "image": "https://images.genius.com/d5fca1588b4ba67c54f55ffbdbf688e0.355x355x1.png"}], "artist": "Drake"}