{"songs": [{"title": "2014 HHS1987 Freestyle", "album": null, "year": null, "lyrics": "[Rapping: Meek Mill, Verse 1]\nUh, go hard for that paper so I can get what I want\nStood in the back, I couldn't fit in the front\nNow I pull in the back, my whip sit in the front\nWith no roof on that bitch, I let it flip in the trunk\nLike it's gymnastics, I know magic\nCaught with the bastards, early gymnastics\nI never had a master but I done mastered\nThe art of getting money in a timely fashion\n\n[Talking: Omelly]\nYou know we still...remain real nigga, you know, niggas be playin'\nYou gotta see 'em, you gotta see me man\nWhen you see me you keep the same energy that you had\nYou know what I'm saying?\nI got blood all over me, you know, when, when you niggas pop shit\nJust know that y'll gotta see us, We not gunna tweet you niggas or nothin'\nYou have to see us. You see what I'm saying?\nI mean that's a nigga jaw right there today. You gotta see us\nAnd it could have got worse but, you know, these niggas be pussies\nYou don't even got to take it there. It's just how I be feelin' , I don't know\nShoot, just keep the same energy\nWhenever you say something about any Dreamchaser, nigga, just keep the same energy when you see us and man\nAnybody, we ain't got no picks over here. Dreams worth more than money\n\n[Rapping: Meek Mill, Verse 2]\nUh, gimme some levels, turn it up\nUh, they sayin' that I talk too much money\nBut maybe cause I saw too much money\nI can't chase around no broads with no regard to touch money\nSo if it ain't about no paper, get them all the fuck from me\nYoung dummies, uh, realest, richest nigga in my town\nYeah, if you ain't come with your pistol then get from 'round here\nCause I'm the ref. with the whistle, you out of bounds here\nAnd this time on my Sky-dweller say “The crowns near\"\nCause it's crowns there, you hear broke niggas talkin' that never sound fair\nBe tryna broker and bargain something that's not there\nI'm barely sleeping, having million dollar nightmares\nI'm right c'here, finna kill 'em, kill 'em all, they shi-shi-shivering\nI think they mad I put on my hood, fuckin' Zimmermans\nRacist when they tie me down with cases\nCause my hand got dealed all aces, and I make their yearly savings\nOn the days end, that I stayed in, First year I came in, Pop stars got came in\n\n[Talking: Meek] (laughing)\nHold up, hold up, I don't know I said first year I came in, they got came in\n\n[Rapping: Meek, Verse 3]\nBasic bitches can't sit with us\nAnd none of these niggas ain't really rich as us\nWe swore that that money’ll never get to us\nWe swore that these bitches'll never get to us\nBut now I'm feeling like I'm made for this shit\nAnd loyalty go to the grave for this shit\nAnd where the feeling you can't pay for this shit\nAll my niggas pay for this shit\nCause we already rich and you know I'm the shit\nGot fifty niggas with me, they got Rollies on they wrist\nUh, I want everything my niggas want except for the hoes they fuckin'\nRoll that window down and nigga we get to bustin'\nWho that right there? Turn around they fuss if [?] truckin'\nIt don't matter, you know how we rockin', we thuggin'\nUh, living this life, getting it right\nThat shit y'll niggas talk about we did it twice\nG-5 eggs in back this the life\nLook at my man's wrist there, you see it's bright\nUh, rollie on wrist, ice on neck\n21st and Berks, this the whole set\nMy nigga Dean, he was catchin' wreck\nBending corners on niggas, 50 in the Tec\nWe got 30 in the Macs, 80 in the Myags..\n\n[Talking: Meek Mills]\n(laughing) I can’t...I need like a basic beat\n\n[Rapping: Meek, Verse 4]\n[?] thinking how I got here\nLocin’ low and tosin’ pussy you was not there\nHoldin’ never foldin’, we was on the top tier\nShackled to our ankles, it was like a nightmare\nYou ever wash out your drawers the same water you shit\nDoing your push-ups right on the floor where you piss\nCellies with niggas that went to war with the strip\nYou gotta rumble with ‘em nighttime down to the mornin’ and shit\nI’m trying to tell them...(laughing) they can’t get no more of that right there\n(laughing) they can’t get no more of that\nI seen a nigga get murdered for a half a bird\nHeadshot, cat licked his brains off the curb\nBefore I had this paper always had an urge\nTo ball in ‘em sixes on them like, Julius served\nI moved to the ‘burbs, but I’m still in the hood\nAnd I ain’t gotta rock a vest ‘cause really I’m good\nAnd I should shout out my connects, like really I should\nLike Death Row and 9’5, Meek Milly I Suge\nBut I’m cocky as Pac, ice hockey the watch\nGreen Mercedes, brown butter be broccoli the drop\n‘Cause them winters was cold, the beef from broccoli was hot\nWe was sellin’ them O’s, still getting watch from the cops\nFederal papers, indictments, nothing was righteous\nPraying that Papi don’t grow up to be just like us\nPraying them people don’t judge us and try to life us\nI did it for all my niggas, we ballin’ no they don’t like us\nAnd they wanna kill us, if they could one of the realest\nBut they can’t find us on a wood watching the Clippers like a Kingpin\n(Huh? Yeah) But for this rapping swear to God I just wanted to be a Kingpin\n\n[Talking: Takbar]\nAt the bottom of the joint put some “Motivational uses only” man\nNo hatin’ man we wanna see the whole Philly win\nYa'm sayin? Like we wanna see when we out of town\nA bunch of niggas from Philly holdin’ it down too man\nWhat part of Philly you from man? Put on it for the whole city man, everybody\nTurn up, Put down the guns and pick up some money\n(I’mma keep mines and keep the money, yeah you know what I mean)\n(I ain’t mad at nothin’ tho)\n\n[Rapping: Meek Mill, verse 5]\nMan, you ready?\nI think the D.A wanna murder me\nAs they swore me in I spelled my name nervously\nFeeled like I committed perjury\n‘Cause this time they talkin’ ‘bout in here, it ain’t me\nAnd next time I bring my son to court so he can see\nHow they wanna murder his Daddy, I murder the Caddy\nWhen I’m on the roads to the riches no words for the Navi’\nShould I make a left or right,? ‘Cause nothing was never right\nWe’s infatuated with bustin’ guns and sellin’ white\nI remember Snupe’s momma called me from the scene\nNo life in his body, blood on his jeans\nCouldn’t believe it, one of the youngest in my regime\nGot murdered and I’m feelin’ like it’s ‘cause of me\nWas it the fame that I brought to him? Huh?\nOr the name that I brought to him?\nMan a nigga put a fling, put a torch to ‘em\nAnd I put that on my son, I tried to talk to ‘em\nAnd tell ‘em stay away from murder\nR.I.P to my Lil nigga Snupe\nYeah that’s how we rockin’, we rockin’ our Lil Snupe for life nigga\nYou know how we doin’ it\nI said, I said they even killed my homies, they murdered Lil’ Snupe\nHe was only 18, only one that was a coupe\nIf you get a job they laugh at you, kill something they salute\nThat’s the only shit they see, that’s the only shit they do murder\nBlack clouds, black people, black roses\nYoung mothers teaching daughters how to bust it open\nBabies having babies and them babies having babies man\nThis shit is lookin’ crazy even birthday was a maybe\nMommy playing daddy role, ‘cause he behind a fence\nAnd she told them he in school ‘cause them kids they in suspense\nMan these clouds look grey from this view behind the tent\nGood girls that selling pussy, she was due behind the rent\nAnd these kids need shelter, don’t nobody help her\nAnd who am I to judge her, tears of a single mother\nAnd the only thing that scare her, ain’t nobody hear her\nSo them tears turn black when the touch the mascara\nWhy I treat my last meal like I treat my last prayer\nVery thankful, ‘cause I done had shackles on my ankles\nShackles on my wrist too, I swear that shit was painful\nThe reflection of your eyes through that picture\nI could paint you, like Basquiat, feel a soul from the fascia\nSome recite the songs, the religious say the fire hot\nAnd I don’t want to go to hell, but it’s hell on Earth\nIf I can't pay God with this money, then tell me what it’s worth\n\n[Talking: Meek] Let me get down to these bitches..UHN!\n\n[Rapping: Meek, Verse 6]\nI say, I say, Said she want a boss just to sweep her off her feet\nHit her with the D and I can’t keep her off the meat\nKeep her off of me and we don’t get to hardly speakin’\nWe be creepin’ all in weekends, I’m talkin’ freakin’ all in weeks\nBut I know you still think about when i fucked you\nAnd when I came through with your best friend, crushed you\nAll white [?] no tint, know I touched you\nTried to give my man some, he ain’t wanna bust you\n‘Cause loyalty is royalty, hoes ain’t loyal\nYou are what you are and I had love for you\nHeard you with a baller, hopin’ he enjoy you\nHopin’ he like buying  Louis Vuitton just to spoil you\n‘Cause you was like a bill with a drill to my pocket\nAll these hundred dollar bills in my pocket\nI could build my own bad bitch ‘cause i got it\nLet you meet my new girl she looks like a Goddess\nShe could give you gottens and she gon’ give you problems\nWhen she don’t even try to, blame it on your momma, bitch\nOr blame it on jail, ‘cause you thought you was poppin'\nWith your little followers (ha)\nShe thought she was poppin’ with her little bit of followers, ha\nI said my girl fuck a nigga with some money\nWhat I do? Tell her break ‘em, And if a nigga fuck my bitch for free\nWhat I do? Let ‘em take her (You can have that bitch)\n‘Cause I got so much money, What I do? I could build ‘em, I could make ‘em\nTummy tucks and ass shots, what we doin’? Flying bitches to Jamaica\nDreamchaser, nigga!\nTalk to ‘em!\n\n[Talking: Omelly]\nReal niggas back in style man, Guns and butter man, D.C\n[Rapping: Omelly]\nUh, Uh, It’s Osama, Twin Llama, from the D.C. camp\nHeard you like to run your mouth, you the people’s champ?\nAll that shit gon’ get your t-shirt damp\nA tag on your toe, pussy nigga that’s the D.C. stamp\nCarry two’s, with my jewels, you niggas thinkin’ jackpot\nWell walk up on me, you gon’ hear that Mac pop (blap!)\n(With the ladder in the stashbox) (oh)\n(Black Talon that’ll knock down a Sasquatch)\n\n[Rapping: Meek, Verse 7]\nLet me talk to these bitches, I said\nI said, you was who you was when you got here\nAnd you are who you are, who you not here\nBreaking news, shit I think we got a thot here\nState to state yeah the ho out here\nTalkin’  ‘bout Greystone she be like \"I’m there\"\nLive on Sunday, Tiny and T.I. there (laughing)\nI said, I said, Velvet on Sunday (unintelligible)\nI said, what I said? I said ATL Saturday tweeting at T.I there\nLIV on Sunday TV  that Lebron there\nSeen a flyer on Instagram that LeBron there\nHe ain’t even show up, she ain’t make her mind there\nStevie J on the mic, Meek Milly P my here\nThat ain’t in the building got Omelly, Coon and Tak here\nNow you in my VIP, bitch how you got here?\nI took a G-5 here, you had a buddy pass that’s not fair\nHow the fuck you beat me here? I seen you in Atlanta\nI went to Live, you got there ‘fore me and we came in a motherfuckin’ G-5 bitch\n(She had a buddy pass, how she get here?)", "image": "https://images.genius.com/6929169de7116d41676151bdea5cc773.1000x1000x1.jpg"}], "artist": "Meek Mill"}