{"songs": [{"title": "World Class", "album": null, "year": null, "lyrics": "We call him Yella, he is the best\nHe rocks the house on the DMX\nWhen he's on the beatbox, he cannot miss\nSo listen to the beat, as he rocks like this...\n\nYes, Yella is his name, and he's created\nThe big beat sound, so devastated\nParty people in the place, you beware of the shock\n'Cause Yella (Yella) Yella is on the beatbox, huh!\n\nTo feel the beat, it's time for you\nTo rock with the devastatin' Wreckin Cru\nYou got snare, hi-hat and bass in your face\nSo come on Yella boy, let's wreck this place, huh!\n\nThe headlines read \"We are in Town\"\nThe World Class Cru is gonna throw down\nWe are here, and here to stay\nAnd we came to raise hell, and not to play\nAs we grow stronger, you get weaker\nSucker MC put your ear to the speaker\nThere is no doubt that we are best\nWe don't have to scratch just to make the beat fresh\nThe beat will blast and we'll outlast\nThere is no other that's in its class\nIt's not a 808 or a Drum-you-lator\nIt's a DMX and it is greater\nIt makes a sound that's so unique\nHuh! To rock your butt and move your feet\nNow sucker MC's we will impress\n'Cause Yella (Yella) Yella on the DMX, huh-huh!\n\nParty people in the place, we're not through\nWe're gonna show just what we're gonna do\nSo listen up close and don't miss a word\n'Cause it is the hardest rap you ever heard\nLike a blast from heaven, a blaze from hell\nWho's comin' on the mic? Well, it's Cli-n-tel\nSo sucker MC's, you better beware\n'Cause I will be your next nightmare\nYes, I am fresh, the MC wizard\nWhen it comes to cold raps, huh, I'm a blizzard\nWell, I'm the genius, the mastermind\nSuper def creator of MC rhymes\nSo come a little closer and you will see\nWho? The Cli-n-tel's in the place to be\nNow comin' on the mic without delay\nA little \"Bom bom bom\"... It's Dr Dre\nI'm the physician who's gonna start dishin'\nAll them things that you've been missin'\nIf it's for answers that you have been fishin'\nTake a bite of this for your nutrition\nI'm the real doctor, that is final\nAll you other suckers are made of vinyl\nI won the election to issue injections\nTo who? Sucker MC's who wish for perfection\nNext in line there's Lonzo\nProducer of the groove, grandmaster of the show\nThe head debater, there is none greater\nBecause he is the Cru's creator\nYou put us all together, you've got the best\nWhile Yella throws down on a DMX, huh-huh!", "image": "https://images.genius.com/bf3badae49c33b583126057638078bd8.576x576x1.jpg"}], "artist": "Dr. Dre"}