{"songs": [{"title": "Futuristic Funk", "album": "2011's Freshman Class: The Mixtape", "year": null, "lyrics": "[intro]\nYeah, and it goes like\nHey, hey, hey, hey, and I tell em' fuck youuuuu if you hatin'\nSo fuck youuu, we makin' money bitch\nThat's all I really got to say\nI'm just gunna start rappin' and shut the fuck up !\nBlaow\n\n[Verse 1: Mac Miller]\nI said they actin' like they better, but they never been the shit\nHows it feel to have a hundred thousand people on ya dick?\nWell, it feels good, homie you should probably try it\nIf you never rocked a sold out show then keep quiet\nI gets busy on a track, workin' double time\nTryna find a foreign pussy just to put my tongue inside\nI be on top of the charts, you just an underline\nTearin' through the streets all these hatin' suckers run inside\nFurious, fool probably wanna come and stomp me out\nMad they got a girl, and I’m all that bitch talks about\nBeen gettin' money since I walked around my fathers house\nThat dads be cop and search when I come and take their daughters out\nPaper comes in large amounts, Im eatin' like I should\nSurf and Turf shit, sink my teeth in somethin' good\nThey mad I ain't hood, nah I came to party hard\nYour grillin' at me but I smile back, bitch hardy har\n\n[Hook]\nCome on down, grab your girlfriend down, make her spin around\nAin't no other motherfucker get the people this wild\nWhat you want? some futuristic funk\nTell me what you want? a little futuristic funk\nWe those kids gettin' cheese on some Cheetos shit\nJust fuckin' for the night, then we leave that bitch\nSo what you want? some futuristic funk\nTell me what you want, a little futuristic funk\n\n[Verse 2: Mac Miller]\nHey, so you probably heard I rap a ton, havin' fun\nNever have I had a gun\nVomit when I spit like I devoured somethin' bad for lunch\nTryna figure out the way to get me rich, I have a hunch\nLike Velma up a Scooby-Doo, confusin' like a Rubix Cube\nUsually don't do this I be stupid just a nuisance\nAll you seem to hear about, I’m in ya ear, q-tip\nYeah that's dude sick, sleeve with a few tricks\nBreathe in a huge spliff, weed come in two zips\nYou light it then I burn it like a furnace when the herb hits\nLike it cause I earn it smokin' good veggie turnips\nBitch I'm fallin' from the sky like bird shit\nMakin' movies everywhere I go, call me Ernest\n\n[Hook]\nCome on down, grab your girlfriend down, make her spin around\nAin't no other mothafucker get the people this wild\nWhat you want? some futuristic funk\nTell me what you want, a little futuristic funk\nWe those kids gettin' cheese on some Cheetos shit\nJust fuckin' for the night, then we leave that bitch\nSo what you want? some futuristic funk\nTell me what you want? a little futuristic funk\n\nLike uhhhh, like uhhhhh\nYo Jerm's out there, makin' all this shit sound good\nI'm in here talkin' shit, don't be mad mothafucker\nI'm gettin, I'm gettin, I'm livin' great, your not !", "image": "https://images.genius.com/6fdd82bef1bb980ec41bfc4de3a134c9.500x500x1.jpg"}], "artist": "Mac Miller"}