{"songs": [{"title": "On Me", "album": "Blacc Hollywood", "year": "2014-08-19", "lyrics": "[Intro]\nWhat's up? What's happening Jeezy? I just touched down\nThese hoes on me, Jeezy, for real\n\n[Hook: Jeezy]\nWhat I'm supposed to do, these haters on me\nThey make it so bad, these bitches want me\nSpent the whole thirty grand, blew the whole clique, damn\nWhen I fell up in the spot the forty on me\nWhat I'm supposed to do, these haters on me\nWhat I'm supposed to do, these bitches want me\nWhat I'm supposed to do, these haters on me\nWhat I'm supposed to do, these bitches want me\n\n[Verse 1: Jeezy]\nThere be no hating, no faking, no lying, no snitching\nYou play with it, you go there, you cross line, I'm tripping\nThem hoes try them long clips, I'm going straight loco\nYour clique poor, you dead broke, I'm world wide, you local\nI'm grinding, I'm shining, I'm stunting, I'm flexing\nThem bitches you came with, they all in my section\nThey smoking, we drinking, they turnt up, they sipping\nShe spilled Don P on me, I said bitch you tripping\nMy weed costs, my belt costs, my jeans cost a grip, bitch\nAnd you know that four cal is right here on hip, bitch\nTwo door cost half mil, that there be rich shit\nDon't know me? You hate me? That there be bitch shit\n\n[Hook: Jeezy]\n\n[Verse 2: Wiz Khalifa]\nKeep the shit talking, turn me up a little more, uh\nOh my God, look what I just bought\nAnother presidential rollie, don't ask what it costs\nAnd you might get lost, come into my crib\nI'm just a young nigga, getting it how I live\nI'm supposed to stacking, supposed to be grinding\nSupposed to be swagging, supposed to be shining\nSupposed to be way up ahead of my game\nWhile you in back, or stuck in the line\nI'm spending my cash, I'm in this bitch, rolling my grass up\nClub's so packed in there, can't no one get past us\nOh, I'm with my whole crew, spent thirty thousand in the club\nThat's what I'm supposed to do, say fuck the chase\nI drink it straight, like what I'm supposed to do\nIf you made what I made a show you'd probably throw it too\n\n[Hook: Jeezy]\n\n[Verse 3: Wiz Khalifa]\nI told a bitch to bring her friend, like what I'm supposed to do\nI bought a bottle, drink it straight, like what I'm supposed to do\nI hit the club on hella hoes, like what I'm supposed to do\nAnd V.I.P. be rolling drugs, like what I'm supposed to do\nYou see me driving foreign cars, like what I'm supposed to do\nA hundred deep up in this bitch, can't see me rolling through\nThis nigga tripping, took his bitch, like what I'm supposed to do\nA young rich nigga, I'm buying for my whole crew\nAnd I'll serve a nigga pound if he roll through\nReal niggas with me and they well known too\nAnd if I'm smoking one you best believe she smoking too\nA million dollars, one summer, what I'm supposed to do, uh\n\n[Hook: Jeezy]", "image": "https://images.genius.com/bc518c4d4e7c42fd3eb6b8a0683c0e63.500x500x1.jpg"}], "artist": "Wiz Khalifa"}