{"songs": [{"title": "Provo King", "album": "New Black", "year": null, "lyrics": "[Verse 1]\nI am the provo king, the leader of the unknown beings\nI am exactly what the fuck you're thinkin' provo means\nThe line I walk is thinner than a fuckin' yo-yo string\nSo what the fuck is crazy? For me there's no such thing\nSo much emotion, I can sense it but it's so unseen\nCause when the other side is callin', your phone don't ring\nYou know what my logo means, wear more than some Polo jeans\nSomethin', somethin', somethin', virtuoso dreams\nThe tubes is knockin', you pillow talkin in red, white and blue pajamas\nSometimes I'm super honest, cause I can't be who you want me to be\nOr how they want me to speak\nYeah I'm a free thinker, that's why they're comin' for me\nYeah you niggas asleep, that's why I'm callin' you sheep\nDeep fry your mind, you a human omelette with cheese\nThe all seein' eye, the beast monitors me\nYour mama, your daddy, your auntie, your uncle, your neice\n\n[Hook]\nAnd a nigga came up, lookin' in the street lights\nTryna dodge a gun, and the judge and police lights\nWe out here starvin' tryna find a way to eat right\n'Bout to touch the sky, let a nigga get his feet right\nNigga came up, nigga came up\nI said a nigga came up, a nigga came up\nA nigga came up, lookin' at the street lights\nTryna survive another night on the east side\nAnd we out here starvin' tryna find a way to eat right\n'Bout to touch the sky, let a nigga get his feet right\nA nigga came up, a nigga came up\nI said a nigga came up, a nigga came up\n\n[Verse 2]\nRedeem myself for who? Redeem myself for you?\nRedeem myself for your squad? Redeem myself for your crew?\nI'm tradin' blows with a giant, I'm in the ring with a deuce\nI broke myself out the chains, I cut myself out the noose\nSo fuck your slanted review, you write at home in your room\nSo busy spreadin' the hate, you end up missin' the truth\nYou mothafuckas can shove it, I never back down for nothin'\nThe man got his hand up your pants, you just a puppet\nI'm throwin' a fit and fussin' cause niggas killin' their cousin\nMake it worse, he just a kid, kid of your mama's brother\nAsk the world, can I live, live, live? No discussion\n'Fore they put you in the picture, first they gotta check the color\nWhere are your rights that get left in the dust?\nThey get the cheese and don't throw us the crust\nPlus sayin' please doesn't make it a must\nSo we get strapped, give me buck or I bust\n\n[Hook]\n\n[Bridge] x2\nDark skinned nigga, light skinned nigga\nDon't mean shit when the light man hit yah\nI said dark skinned nigga, light skinned nigga\nSee you on the news, hope your white friends miss you\nCause a nigga came up", "image": "https://images.genius.com/54ff9f204f4b8fc3528da5fc7e538aa9.500x500x1.jpg"}], "artist": "B.o.B"}