{"songs": [{"title": "Kiss My Ass", "album": null, "year": null, "lyrics": "Kiss my ass !\nYes sir !\nI don?t care who you are\nI don?t care what you do\nThere comes a time (uh huh)\nEverybody?s life (yup!)\nWhen?\nYou just gotta tell a motha fucka\n\nChorus:\nYo, If you blatantly hatin' and waitin on my downfall\nThen just be patient, and kiss my ass!\nIf you didn't believe and you had a problem\nWith my previous l.p's, then kiss my ass!\nIf you downright spoiled and feel I don't do enough for you\nThat's right, kiss my ass !\nPop off when you see me, keep it movin or breathe easy\nWhateva, kiss my ass!\n\nVerse 1:\nYo everybody love him\nEvery body know him\nHe gettin money now\nEverybody think he owe em?\nThey stay askin him for weed plants like he grow em'\nThey know if he catch em? violatin he'll blow em?\nAlways wanna know what he doin where he goin\nWhat chain was he wearin, what he drivin ,was he glowin?\nWho givin him head, who he hittin, who he go wit\nWho u seen him in the mall, or creepin out the mo? wit?\nRoc-a-fella, def jam, the right label to go wit\nAnd when the album drops, are they really gon promote it?\nIs L.A behind the project and are you focused?\nI just smile and ask them back, why you wanna know this?\nEverybody got they hands out, here we go again\nYou ain't buy none of his albums, you downloaded them\nHe ain't got no security, the pound?s holdin him\nAnd if he never told you before, you now know it then\n\nChorus:\nIf you blatantly hatin' and waitin on my downfall\nThen just be patient, and kiss my ass!\nIf you didn't believe and you had a problem\nWith my previous l.p's, then kiss my ass!\nIf you downright spoiled and feel I don't do enough for you\nThat's right, kiss my ass !\nPop off when you see me, keep it movin or breathe easy\nWhateva, kiss my ass!\n\nVerse 2:\nI don?t care about your hair or your nails\nI ain't got no bails and no lawyers for niggas that caught sales\nI don?t care about your rent or your mortgage or the cocaine shortage\nOr how many times you been distorted\n\nAnd I ain't got a dime for the limo, for your prom, betta get it from your mom\nOr get up on ya grind\nI don?t wanna hear the garbage about how u need your car fixed\nOr money to get back and forth to the doctors\nDon?t try to seduce me cuz I ain't got a quarter for a Lucy\nJust give me a dap or salufe me I don?t wanna hear the sorrow I ain't got nothin to borrow\nI?m goin on tour so I won't see you tomorrow\nI don?t care about the drought, or how much the price change\nWhat u almost did with the bank, at the dice game\nAnd I?m sorry if I forgot, to tell you how I felt but I really mean it a lot\n\nChorus:\nIf you blatantly hatin' and waitin on my downfall\nThen just be patient, and kiss my ass!\nIf you didn't believe and you had a problem\nWith my previous l.p's, then kiss my ass!\nIf you downright spoiled and feel I don't do enough for you\nThat's right, kiss my ass !\nPop off when you see me, keep it movin or breathe easy\nWhateva, kiss my ass!\n\nVerse 3:\nYo you outside standin around, front of the club\nCoulda been went inside, it only cost you a dub\nWhat u tryna wait on me to get in free\nOnly thing is we ain't spoke since 2003\nSo I act like I don?t know you when I see you in the town tomorrow I gotta blow you\nThis is what I go through\nNow I got a lawsuit and u got a velour suit\nSome bullshit jewelry from canal and a 04 coupe\nThe car coulda been better, for that to be the case\nThe scar woulda been better\nScrew a vendetta, you show it you betta pull it\nBut since u tryna count my money then count bullets\nSoon as u allow it instantly you become a liability to cowards\nCheaper to send them flowers\nBy now you should know it, this is how I feel and how I?ve always felt\nEven though I don?t show it\n\nChorus:\nIf you blatantly hatin' and waitin on my downfall\nThen just be patient, and kiss my ass!\nIf you didn't believe and you had a problem\nWith my previous l.p's, then kiss my ass!\nIf you downright spoiled and feel I don't do enough for you\nThat's right, kiss my ass !\nPop off when you see me, keep it movin or breathe easy\nWhateva, kiss my ass!", "image": "https://images.genius.com/34d1815281afeb502b98075367058136.453x453x1.jpg"}], "artist": "Jadakiss"}