{"songs": [{"title": "Relax With Pep", "album": "Don’t Sweat the Technique", "year": "1992-06-23", "lyrics": "[Hook]\nRelax with pep\n\n[Verse 1]\nMy styles will move, I'm calm but deadly\nHeat up but cool, I'm rough as a right hook\nBut still look smooth, even when I'm unseen\nI show and prove - women, I give 'em pain and still soothe\nAs I'll put you down but I'm hard to put up with\nSwell up like helium but I can make it fit\nI'm taking what I want and make you wanna give it here\nProvoking you to flaunt, you get the idea\nGot it, gone, my schedule is packed\nMy day is laidback cause I'm ahead of all that\nThen I can relax cause I'm before my time\nI hand you a manual before the rhymes\nSo you can catch up and keep up and move right along\nThe day is kind of off but I can get it on\nI'm taking it step by step and when the night is in depth\nIt's cool cause I'm relaxed with pep\n\n[Hook]\n\n[Verse 2]\nI enchant a riot with a quiet storm\nIs it the way I parlay or the knowledge being born\nAll praises due to the magnificent, most high and magnificent\nFrom him, I was sent with intent to invent\nNew ways for better displays for better days\nNo more crimes, I got rhymes and it pays\nI'm prepared to take mine and get mine\nAnd I can protect mine either with a rhyme or a nine\nA silent rage but if amplified\nRhymes multiply, it's hard to provoke when I\nPut a mode in effect, the episode's correct\nReload and you don't know what code to respect\nI get swift and changeable, adapt and master\nBut still remaindable, rap gets faster\nReacts and projects, attracts and it gets\nTo the max, it's in depth, it attacks but it's relaxed with pep\n\n[Hook]\n\n[Verse 3]\nCheck one, them I'm a check another one too\nThe R's brand new so you can view a few\nI got a exquisite, exhibit, explicit\nIs it a whiz kid or Kid Wizard? Well, is it?\nRelax, I'll track out, lap the half stepper\nHere come the right one baby I'm Dr. Pepper\nSo check the Richter, scale rhymes overload\nBlow up and explode, abrupt and reload the code\nYou can't pinpoint or locate, the rate\nOr evaluate the up to date, stayed\nUp front, laid back, coming off on track\nGirls want some of this because I'm all that\nSweat the concept as the ep's in depth\nAs the track is kept, you can't intercept the step\nReacts and projects and attracts and it gets\nTo the max and in depth, it attacks but it's relaxed with pep\n\n[Hook]", "image": "https://images.genius.com/c242f8367734db09ac26eb1c1bbcee98.900x900x1.jpg"}], "artist": "Eric B. & Rakim"}