{"songs": [{"title": "Work It (Remix)", "album": "Under Construction", "year": "2002-11-12", "lyrics": "[Intro]\nDJ please, pick up your phone\nI'm on the request line!\nG U-nit!\nThis is a Missy Elliot one time exclusive (Come on)\n\n[Chorus]\nIs it worth it? Let me work it\nI put my thing down, flip it and reverse it\nTi esrever dna ti pilf, nwod gniht ym tup\nTi esrever dna ti pilf, nwod gniht ym tup\nIf you got a big, let me search ya\nAnd find out how hard I gotta work ya\nTi esrever dna ti pilf, nwod gniht ym tup\nTi esrever dna ti pilf, nwod gniht ym tup\nRemix (Uh, yeah)\n\n[Verse 1: 50]\nNow Missy she too much for me (I'm freaky)\nTook me to to the crib man, she told me (Eat me)\nNow my babymama told her ass not to beat me\nHer broke ass wanna fight, Missy know how to treat me (Yeah)\nShe sitting on cash, she got money out the ass\nGave her them back shots and got money out her ass\nNow you can see me in the coupe like WHAT\nNext time I'll hit her in that G5 TRUCK\nI've got the magic stick, I can go for hours\nFrom the bed to the floor, to the sink to the shower\nWith her back to the bed and her legs to the sky\nI can go hard, know why, big girls don't cry\nI had visions of Missy with her money by the tub\nChing! Ching! Jackpot, I think I'm in love\nI'm looking for Missy now so I can get my back rubbed\nThis the shit she hollered in my ear before we left the club\n\n[Verse 2: Missy]\nI'd like to get to know ya, so I can show ya\nPut the pussy on ya, like I told ya\nGimme all your numbers so I can phone ya\nYour girl acting stank than call me ov-ah\nNot on the bed, lay me on your sofa\nCall before you come, I need to shave my cho-cha\nYou do or you don't or you will or you won't cha\nGo downtown and eat it like a vul-cha\nSee my hips and my tips don'tcha\nSee my ass and my lips don'tcha\nLost a few pounds in my waist for ya\nThis the kinda beat that go wa-ta-ta\nRa-ta-ta-ta, ta-ta-ta-ta-ta\nSex me so good I say blah-blah-blah\nWork it! I need a glass of wat-ah\nBoy oh boy its good to know ya\n\n[Hook]\nIs it worth it, let me work it\nI put my thing down, flip it and reverse it\n\"I put my thing down, flip and reverse it\"\n\"I put my thing down, flip and reverse it\"\nIf you got a big , let me search ya\nTo find out how hard I gotta work ya\n\"I put my thing down, flip and reverse it\"\n\"I put my thing down, flip and reverse it\"\n\n[Verse 2]\nIf you're a fly gal, get your nails done\nGet a pedicure, get your hair did\nBoy lift it up, lets make a toast-ah\nLets get drunk, its gon bring us clos-ah\nDon't I look like a Halle Berry post-ah?\nSee dem Belvedere playin tricks on ya\nGirlfriend wanna be like me nev-ah\nYou won't find a bitch that's even bett-ah\nI make it hot as Las Vegas weath-ah\nListen up close while I take you backwards\n\"Watch the way Missy like to take it backwards\"\nI'm not a prostitute but I can give you whatchu want\nI love your braids and your mouth full of funk\nLove the way my ass ba-bump ba-bump bump\nKeep your eyes on my ba-bump ba-bump bump\nAnd think you can handle this ga-donk ga-donk donk\nTake my thong off and my ass go boom\nCut the lights off so you see what I can do\n\n[Hook]\nIs it worth it, let me work it\nI put my thing down, flip it and reverse it\n\"I put my thing down, flip and reverse it\"\n\"I put my thing down, flip and reverse it\"\nIf you got a big , let me search ya\nTo find out how hard I gotta work ya\n\"I put my thing down, flip and reverse it\"\n\"I put my thing down, flip and reverse it\"\n\n[Verse 3]\nBoys, boys, all type of boys\nBlack, white, Puerto Rican, Chinese boys\nWhy-thai,-thai-o-toy-o-thai-thai\nRock-thai,-thai-o-toy-o-thai-thai\nGirls, girls, get that cash\nIf its 9 to 5 or shakin ya ass\nAin't no shame ladies, do your thang\nJust make sure you ahead of tha game\n\nJust cause I got a lot of fame sup-ah\nPrince couldn't get me change my name papa\nKunta Kinte, enslave a game, no sir\nPicture black sayin, \"Oh yessuh massa\"\nPicture Lil' Kim dating a pastor\nMinute man, big men can outlast ya\nWho is the best? I don't have to ask ya\nWhen I come out, you won't even matt-ah\nWhy you act dumb like ughhh, duh\nSo you act dumb like ughhh, duh\nAnd the drummer boy go pa-rum pa-pum pum\nGive ya some some some of this Cinnabon\n\n[Hook]\nIs it worth it, let me work it\nI put my thing down, flip it and reverse it\n\"I put my thing down, flip and reverse it\"\n\"I put my thing down, flip and reverse it\"\nIf you got a big, let me search ya\nTo find out how hard I gotta work ya\n\"I put my thing down, flip and reverse it\"\n\"I put my thing down, flip and reverse it\"\n\nTo my fellas, ooooh\nGood God, I like the way you work that\nTo my ladies, woo\nYou sure know how to work that, good God", "image": "https://images.genius.com/490e9e271e99d6b5c4adbd4dd6e47971.1000x1000x1.jpg"}], "artist": "Missy Elliott"}