{"songs": [{"title": "Lonely (Old Version) (Dirty)", "album": null, "year": "2004-02-24", "lyrics": "[Intro: Bobby Vinton]\nLonely, I'm Mr. Lonely\nI have nobody\nFor my owwnnn\nI'm so lonely, I'm Mr. Lonely\nI have nobody\nFor my owwnnn\nI'm so lonely\n\n[Bridge]\nYo, this one here\nGoes out to all my players out there, man\nYa know, that got that one good girl, dog\nThat's always been there, man\nLike, took all the bullshit\nThen one day she can't take it no more and decides to leave\n\n[Verse 1]\nYeah, I woke up in the middle of the night\nAnd I noticed my girl wasn't by my side\nCoulda sworn I was dreamin, for her I was feenin\nSo I had to take a little ride\nBack tracking on these few years\nTrynna figure out what I do to make it go bad\nCause ever since my girl left me\nMy whole life came crashin' and I'm so\n\n[Hook]\nLonely (so lonely)\nI'm Mr. Lonely (Mr. Lonely)\nI have nobody (I have nobody)\nFor my own (to call my own) girl\n\nI'm so lonely (so lonely)\nI'm Mr. Lonely (Mr. Lonely)\nI have nobody (I have nobody)\nFor my own (to call my own) girl\nI'm so lonely\n\n[Verse 2]\nCan't believe I had a girl like you\nAnd I just let you walk right out of my life\nAfter all I put you through\nYou still stuck around and stayed by my side\nWhat really hurt me is I broke your heart\nBaby you a good girl and I had no right\nI really wanna make things right cause\nWithout you in my life girl I'm so\n\n[Hook]\n\n[Verse 3]\nBeen all about the world ain't never met a girl\nThat can take the things that you been through\nNever thought the day would come\nWhere you would get up and run\nAnd I would be out chasing you\nCause ain't nowhere in the globe I'd rather be\nAin't no one on the globe I'd rather see\nThan the girl of my dreams that made me be\nSo happy but now so lonely\n\n[Hook]\n\n[Verse 4]\nNever thought that I'd be alone (be alone)\nI didn't think you'd be gone this long (gone so long)\nI just want you to call my phone\nSo stop playing girl and come on home (come on home)\nBaby girl I didn't mean to shout\nI want me and you to work it out (work it out, baby)\nI never wished I'd ever hurt my baby\nAnd it's drivin me crazy cause I'm so\n\n[Hook]\n\n[Outro]\nSo lonely, (lonely)\nSo lonely, (so lonely)\nMr. Lonely, (lonely)\nSo lonely, (so lonely)\nSo lonely, (lonely)\nSo lonely, (so lonely)\nSo lonely\nMr. Lonely", "image": "https://images.genius.com/b714c76ff85aee144b80660942cf2e22.1000x1000x1.jpg"}], "artist": "Akon"}