{"songs": [{"title": "PHenomenon", "album": "Setbacks", "year": "2011-01-11", "lyrics": "[Chorus: Alori Joh]\nI feel like a phenomenon\nLike I'm who these people idolize\nAnd I won't let nothing get in my way\nIt ain't a thing, we do this all the time\n\n[Verse 1: ScHoolboy Q]\nGot another one, twist another one, off that indo\nThat's my medicine, need a bigger lung\nFame going to my head, call it wisdom\nNow I need racks, yeah, Wimbledon\nThis chewing gum, always hold ya tongue\nNever spit it out, we finna miss like cobras huh\nWe soldiers huh, you noticed them\nAs the tales money flip, until the quota's done\nYeah, until my single come, be the Devil's son\nDevil's work, getting work, Hallelujah\nHope the Lord alerts, do a soul search\nUnderstand my heart's good, but my daughter's first\nBlack episode, my down time, needed church\nPrecious life what my style is worth\nWon't gain, let my shit assert\nMove on!\n\n[Hook]\nWe do this all the time\nWe do this all the time\nWe do this all the time\nAll the time\n\n[Verse 2: ScHoolboy Q]\nAnd I'm still up, never gave a damn, never gave a fuck\nAll my real niggas, we gon' stay in touch\nEven out of range, nigga do your thang\nYou know where I'm at, just holla back\nWhere that cash at? Nigga flashback\nNigga sixteen? A dope sack\nA sixteen? Stretch that\nDouble that, yeah, flip that\nBig steps, work hard\nBig yards, slanging footballs\nHave 'em running back, receivers serving corners\nIt's taken by the pushers, burners eyes and lookers\nYeah, yeah, yeah, now see we gotta make it\nWe ain't trying to brick, unless we cop a brick\nAccompanied by the razors, you know the shit\nI make it easy, ain't this bout a bitch?\nMove on!\n\n[Hook]\nWe do this all the time\nWe do this all the time\nWe do this all the time\nAll the time\n\n[Verse 3: ScHoolboy Q]\nSaid I can't lose, nigga gotta win\nFuture looking bright, Thomas Edison\nHere we go again\nMusic always kept me calm, nigga ritalin\nAlways got it done, you a middleman\nContraband, yo we get it in\nYou are inelegant, my niggas looking militant\nDope boys, what you know about it?\nYou just know about it\nA nigga sky high, boy, fuck a pilot\nMicrowave it fast boy, fuck a pilot\nYeah, hold it silence, keep your mouth closed\nThe game is to be sold not to be told, you like a ho\nMatter like a auction, gave it to the best bidder\nLucky I didn't rob you, why your ass bitter?\nI'm that nigga, better ask nigga\nYou was a phase, I outlast niggas\nMove on!\n\n[Hook]\nWe do this all the time\nWe do this all the time\nWe do this all the time\nAll the time", "image": "https://images.genius.com/4e5d39814aadb84f19c68cb7ca188a5d.950x946x1.jpg"}], "artist": "ScHoolboy Q"}