{"songs": [{"title": "Pop’s Rap Part 2 / Fatherhood", "album": "One Day It’ll All Make Sense", "year": "1997-09-30", "lyrics": "Hey, Hey old been, and you too baby sweets\nI'm back in the studio, you know, I drove up\nIn the parking lot, and the parking lot was empty\nWasn't no cars out there like nobody wasn't even in here\nAll the doors were locked from the inside\nBut, I found a window cracked on the first floor so now I'm in here\nLet's rap\nSo, I come in here, talk to my son, you know?\nBut, but, his next album he got comin' out\nYou know it's been such a spiritual feelin'\nI had to come back in the studio just to see what he was doing\nCause I was gettin' those vibes all in the rocky mountains say, \"I got to go,\"\nYou know? I understand I'm finna' be a grandfather\nAnd I'm so proud\nI can say that in many ways, I can say I'm so happy, I'm so proud\nYou know? Son I wanna give you, you know?\nAny direction in parenting at this stage\nBecause I think it's gonna come to you, just like it came to me\nSee you came to me and your mom from the spiritual world\nWe're just the physical parents, you know?\nGod loaned you to us, as God's spirit\nWe're the physical parents, you know?\nLike I say, I'm not gonna give you no directions, you know?\nBut, I know when you started teaching me\nSee we talk about the life and education of one Lonnie Lynn\nI think I'm the one that got taught, I do believe that, son, you know?\nAnd I know when you started teaching me too\nYou know, I was hanging out, mad at the world\nMy professional basketball career was over\nAnd I didn't believe in the red, white and blue anymore\nAnd I was dissipatin' heavily, I wasn't experimentin', you know?\nAnd one morning you looked across the table at me, it was like \"What? Whatchu' gon' be? Whatchu' gon' do?\nYou got the responsibility to teach me the right things\nYou got the responsibility to teach me truth and respect and love, and safety\"\nYou know? And my knees started gettin' a little stronger, you know?\nI said, cause I can't get past these eyes man, it's just the eyes of a babe looking at me\nAnd I couldn't look it off, I couldn't even play it off, you know?\nAnd immediately I started gettin' the road maps seein' like how am I gon' do this?\nI had to thank The Almighty for the strength, that he sent to me through you\nSo, I'm here to say, you know, thank you son\nI'm here to say I'm so proud and numerous other things\nCause you've been a teacher to me, just like, I have supposed to be a teacher to you\nCause a lot of people think that parenting and raising a child is a one way street\nBut, you taught me continuous numerous lessons\nAnd I love you my son", "image": "https://images.genius.com/c13069157cf82b06434a58c5005ed904.1000x1000x1.jpg"}], "artist": "Common"}