{"songs": [{"title": "’88 Coupes", "album": null, "year": null, "lyrics": "[Verse 1]\nMan, I don't know what they smokin'\nOur rappers must be on that Lindsay Lohan\nI think that snow bunny got 'em open\nYour 'erb smell funny and I funny like we jokin'\nLook, if it ain't about this money, don't approach 'em\nIf you do try and play, I got a K that can coach 'em\nPen game, poke 'em like an inmate enforcer\nI'm for that, it's nothin' like a doormat, you're welcome\nHuh, shout-out to Jadakiss and French\nI got two French vanillas French kissin', that's a pimp\nIf my goon don't stretch 'em wit' the weapon, that's a ten\nLittle meth in your possession, that's possession wit' intent, bruh\nIt's a hard knock life, but we find a way\nAnd we still find the time to write a rhyme a day\nI'm tryin' to send my babies to college\nWhy you rappers babysittin' your pockets?\nI want your life or your wallet\nBrr, that's the sound of the roscoe\nMexicans is vatos, skinny jeans is flacko\nThat means I'm tight wit' you, I'm ready to fight wit' you\nPlease, and that don't mean I'm tryin' to be polite wit' you\nNah, see, I ain't even try and griped wit' you\nSo take your team if they ain't tryin' to lose they life wit' you\nBack down while I'm puttin' this MAC down\nBut only for a limited time, homie, so act now\nBruh, keep it a hundred and a Backwood\nWho else could think on an empty stomach? I'm that good\nFar from the slave ship, just far from basic\nStarted from the basement, now we're y'all replacements\nRap star Belly, magazine, who sixteen?\nSon, you all ready, headshot, all beggin'\nMan in the myth, take a stand, any stand on the Fifth\nI'm tryin' to hold it down, I hold the Clan\nGet a grip, Lord, from this jump I got my hand on the ripcord\nAnd I ain't tryin' to bite the hand off your bit Ford\nNow y'all done got the Method Man on some rich border\nI'm gettin' paid and I'm full\nY'all sheep for the wolves, we gon' eat 'til we good\nY'all don't speak when you should, ain't no peace in my hood", "image": "https://images.rapgenius.com/387ef5f3d78854b3d7a28cf45cf495d3.1000x1000x1.jpg"}], "artist": "Method Man"}