{"songs": [{"title": "Forever", "album": "Underground Luxury", "year": "2013-12-17", "lyrics": "[Hook 1: B.o.B]\nNothing is forever is it?\nNothing is forever is it?\nNothing is forever is it?\nSo until I die, I’ll be forever livin'\n\n[Verse 1: B.o.B]\nStarted with my pockets slim\nNow I got a lot of 'M's\nThey see me and they know it’s him\nOh they oh they know it’s him\nI’m so high, I don’t even get high no more\nI’m so fly, I don’t even look down no more\nI’m so out there, I'm not going out no more\nNiggas still hate, I don’t even know why no more\n\n[Bridge: B.o.B]\nI don’t know why, I don’t know why\nThese niggas lame and I don’t know why\nI don’t know why, I don’t know why\nWe ain’t the same and I don’t know why\n\n[Hook 1]\n\n[Verse 2: B.o.B]\nMotherfuck your opinion\nI'll show you where you can stick it\nI swear they worse than these bitches, all these niggas got feelings\nThey say I got too many women but I’m just keepin it pimpin\nThe way she mastered that P, I guess she keep it No Limit\nNow watch me get ignorant, roof with no ceiling, smoking on \"Hilary\"\nMe, I’m so different, I just stand out, these niggas be blending in\nThey say I’m too \"pop,\" they say I’m too \"hood\"\nNow that’s a predicament\nBut as you can see: The path that I’m on, success is just imminent\nBut at least I know I’m on alert\nAnd I know I know I've got my worth\nYou see there's snakes out there and they sure are lurkin'\nBecause this life ain’t fair and it sure ain’t perfect\n\n[Bridge]\n\n[Hook 2: B.o.B]\nNothing is forever is it?\nIt sure as fuck ain't television\nNothing is forever is it?\nSo until I die, I'll be forever livin'\n\n[Verse 3: Playboy Tre]\nYeah, everybody's talking like they're so cold\nBut when this shit jumps off, they ain’t tough no more\nAll my white friends are like: \"You soft bro!\"\nAnd all my black friends, you know them\nThey be like: \"Fuck them lying-ass hoes!\"\nNothing lasts forever, so why are they hating?\nI don’t have a clue, nigga's wanna brag about money?\nGuess what nigga: We've got money too\nTreboy, Playboy, you can call me Christian's dad\nAnd if you freak wanna try to jump down\nI'mma leap off of that lilly pad\n\n[Bridge & Hook 2: B.o.B]\n\n[Underground Luxury Interview]", "image": "https://images.genius.com/d3cd5182aae0c27fc3ee1ef77656f879.500x500x1.jpg"}], "artist": "B.o.B"}