{"songs": [{"title": "King of the Jungle", "album": "Pro Era", "year": "2018-03-09", "lyrics": "[Intro]\nYo Biggie!\nWhat up, son?\nWhat up, son?\nYo! Yo, drop that shit!\n\n[Sample (Notorious Big)]\nIs Brooklyn in the house?\nIs Brooklyn in the house?\n\n[Chorus]\nIron fist\nStuck in the lab like a scientist\nKillin' everything in my environment\nI ain't the one\nOne\n\n[Verse]\nI'm Brooklyn borough thorough\nKing of the jungle now they all in trouble\nSix years strong they can't knock the hustle\nI'ma be here long on some rap Rapunzel shit\nStay close to where I stack my bundles\nWe'll get a paper cut anytime my tongue'll lift\nI talk sharp, please don't start with the Don\nGuarantee to never do me no harm\nI could teach you to raise a army of guns to bust for me\nPalmin' the napalm, and then drop in the bars calmly\nThrow dirt on my palms hardly ever\nIf I let her bite the fingerprints off of my Gucci sweater\nFuck you know about this boss shit, big talk shit\nI spark big spliffs, the shots I call it\nNiggas ain't got bars, they non-alcoholics\nI raise the bar so high, that I'm getting brolic from all this\nLook, flows is polished, foes demolished\nI was raised in them neighborhoods so impoverished\nNow I get a little taller when I stand on my wallet\nAnd I bought tracks with the late, great Christopher Wallace\nI'm a hip-hop scholar, graduated with the young god honors\nAnd the wisdom and the knowledge from all of my forefathers\nI pay homage, only right I keep this shit honest\nHigh-level shit, they call me your highness bitch\n\n[Sample (Notorious Big)]\nIs Brooklyn in the house?\n\n[Chorus + Sample]\nIron fist\nStuck in the lab like a scientist\nKillin' anything in my environment\nI ain't the one that you niggas should be trying with, ya heard\nIs Brooklyn in the house?\nIron fist\nStuck in the lab like a scientist\nKillin' everything in my environment\nI ain't the one\n\n[Sample (Notorious Big)]\nIs Brooklyn in the house?\nIs Brooklyn in the house?\nIs Brooklyn in the house?\nIs Brooklyn in the house?", "image": "https://images.genius.com/d67ded0e938412ac025f5405b93c3f05.594x598x1.png"}], "artist": "Joey Bada$$"}