{"songs": [{"title": "The Grow Op (Intro)", "album": null, "year": null, "lyrics": "[Intro]\nYo, you already know what it is man\nTreeJ\nMother fucking grow op!\nLadies and gentlemen, I go by the name of Mac Miller\nAnd I’mma start rapping to yall' in a second but..\nI gotta' light this first\nYou know that’s important!\nIt’s mother fucker 4/20\nI’d like to wish you all a happy holiday\nI want you to put this in, turn it on\nHave some pre rolls ready\nAnd don’t stop smoking till the shit is done man!\nThe man Big Jerm on the beat\nTreeJ smoking icon\nI’mma tell you one time man\nI ain’t gonna tell you again\nAre you all fools who think you smoke\nI put you up against my man TreeJ\nI bet you fifty thousand dollars he will smoke more than the table\nThat’s real, holla' at me\nAlright, so let’s see!\n\n[Verse 1]\n\nUh, uh, yeah\nStill blowing trees like a hurricane\nAnd I knock a pussy out with my herbal stra\nStill blowing trees like a hurricane\nAnd I knock a pussy out with my herbal straa\nHey, yeah, yeah!\nStill blowing trees like a hurricane\nAnd I knock a pussy out with my herbal strain\nHave em fast asleep\nLook at them laughing like passed that weed\nHaven’t made a weed song in a minute though\nCause I’ve been gettin' dough, now it’s back to getting smoked\nHave her mother fucking high on her tippy toes\nAnd zip a O, Now you’re smoking with a pro\nSo what you know about that?\nYou smoke weed, what you know about wax?\nAha, you’re cooking it up\nAt the airport GSA looking at us\nYou used to smoke that dirt you couldn’t adjust\nWhen you had to hit that Kush\nYou were used to the bush like W. George\nCome with this killer and I promise that you gonna end up sitting in the morgue\nMost dope blow the most smoke that’s a fact bitch\nPlus my obsession with a blunt, thats a fat bitch\nWhy you’re smoking on that rap shit?\nWhy you even have it? Pillow tight weed on my mattress\nYou now rocking with TreeJ, clockwork the DJ\nSmoking another after that, replay\nMost dope mother fucker is to grow up\nMy weed stinking like Justin, with no socks\nYeah, I’mma show off, probably high I'm mad as fuck\nI’ll give him bars, and Bugs Bunny, and Duffy Duck\nWhat you’re looking at, mother fucker?\nPass the blunt!\nLucky ass bitch video, where is it cut, cut, cut, cut\nLike a 80 dough, these other crew smoke less than a 80 though\nFind me smoking blunts with Fran and Vinny radio\nBest to come up, smoke until the sun is up\nLight another blunt! Yeah mother fucker is the grow op!", "image": "https://images.genius.com/70b2ca5e1882a2f184d45a2e6ccb37eb.916x916x1.jpg"}], "artist": "Mac Miller"}