{"songs": [{"title": "Driving Ms. Daisy", "album": "Under Pressure (Deluxe Version)", "year": "2014-08-27", "lyrics": "[Verse 1: Logic]\nSomewhere this shit done got crazy\nI've just been drivin' Ms. Daisy\nWith my hands on the steering wheel\nAnd my eyes on the pavement\nI give a fuck 'bout where they went\nI owe my lawyer a payment\nThey talkin' 'bout no arraignment\nNow I wonder where the rain went\nI just been all in my mind, homies tell me I'm stressin'\nI been countin' what's on my bucket list\nAnd not on my blessings\nI think it's time for a lesson, hold up (Hold up), you better pay attention\nI-I-I can't end up like my mama poppin' anti-depressants\nMy therapist think I'm crazy (Uh, yeah, yeah-yeah)\nWell, shit, she probably does (Aw yeah!)\nAll that stress I'm under, I wonder why I don't do drugs (I don't do drugs, yeah)\nRaised in a household full of killers and thugs (Uh, uh, uh)\nShit, I've been in doubt so long, don't know who I was\nBut I know who I am (Know who I am)\nYes, I know who I is (Know who I is)\nPlease pardon my grammar, Daisy vibin' with this\n\n[Chorus: Logic & Childish Gambino]\nI've just been drivin'\nUh-uh, nah-nah, da-da-da, la-da-da-da\nI've just been drivin'\nUh-uh, nah-nah, da-da-da, la-da-da-da\nI just been drivin' Miss Daisy\nUh-uh, nah-nah, nah-nah, uh, uh, ah-da-da\nI just been drivin' Miss Daisy\nUh-uh, nah-nah, nah-nah, uh, uh, ah-da-da (Yeah)\nI've just been drivin' Miss Daisy\nUh-uh, nah-nah, nah-nah, uh, uh, ah-da-da (Yeah)\nI've just been drivin' Miss Daisy\nUh-uh, nah-nah, nah-nah, uh, uh, ah-da-da (Yeah, yeah, yeah)\n\n[Verse 2: Childish Gambino]\nThat Bino the realest (Uh)\nThis beat made me kill it (Uh)\nHer feet to the ceiling, she said that she love me\nShe never said that in college, 3005 is our mileage\nI'm in my lane like a Prius, because I'm movin' in silence\nYou still ain't broke down yet? (Yeah)\nAll the flashing lights and a couple Crown Vic's\nWanna rock a crown and a ring on the left\nTell your nigga speed up, she don't wanna get left\nRelationships look closer in that rear view\nFinally slow it down and realize she ain't nowhere near you\nSo now you gotta stop (Stop), park (Park)\nPut that shit in neutral\nYeah, you really love her, but is she worth yo' future?\nYour Ciara, your Beyoncé, they be sayin' he got money\nThink that Kim be wit Kanye if he left drive in the driveway?\nYeah, I know who you are, yeah, I know who you is\nWe were drivin' together, when we met we were kids\nYou ain't know 'bout the biz, I ain't know 'bout it either\nI see you in that new ride, I flash my lights when I see you\n\n[Chorus: Logic & Childish Gambino]\nI just be drivin'\nUh-uh, nah-nah, da-da-da, la-da-da-da (Yeah, uh, yeah)\nI just been drivin' (Yeah)\nUh-uh, nah-nah, da-da-da, la-da-da-da\nI just been drivin' Miss Daisy\nUh-uh, nah-nah, nah-nah, uh, uh, ah-da-da\nI just been drivin' Miss Daisy\nUh-uh, nah-nah, nah-nah, uh, uh, ah-da-da\nI just been drivin' Miss Daisy\nUh-uh, nah-nah, nah-nah, uh, uh, ah-da-da\nI just been drivin' Miss Daisy\nUh-uh, nah-nah, nah-nah, uh, uh, ah-da-da (Yeah-yeah, you)\n\n[Outro: Logic]\nAh, ah, ah, ah, ah, ah, ah, da-da\nTurn left on West Deer Park\nDoing 90 on the highway\nWe gon' do it my way\nI said, 90 on the highway, we gon' do it my way\nUh, I said, 90 on the high, 90 on the high, ah-da-da\n90 on the high, 90 on the high, ah-da-da\nI just been drivin' Miss Daisy (Yeah, uh, you-you, uh-uh, yeah, yeah-yeah)\nI just been drivin' Miss Daisy (You-you, yeah-yeah-yeah-yeah, uh, you-you, aw yeah! Uh-uh, you, you, you)\nI just been drivin' Miss Daisy (Yeah, you-you, uh yeah, uh yeah-yeah)\nI just been drivin' Miss Daisy (You-you, yeah-yeah-yeah-yeah, uh, you-you, aw yeah! You-you, you-you, yeah-yeah)", "image": "https://images.genius.com/2c9956b0499470e6d5e3e5d1e65f0713.500x500x1.jpg"}], "artist": "Logic"}