{"songs": [{"title": "Offended", "album": "Revival", "year": "2017-12-15", "lyrics": "[Verse 1: Eminem]\nYou claim if you get knocked by the cops\nYou'll give 'em not even a statement\nWalk in the arraignment\nShoot the bailiff, karate kick the plaintiff\nGotti with the stainless\nI'll just call it shoddy entertainment\nIf y'all was in the party gettin' faded\nOn molly, had the audience sedated\nYou wouldn't catch a body if it fainted\nProbably let it fall and hit the pavement\nBut you'd be the first lobbyin' to claim it\nBitch, stop bein' a lame\nYour hobby isn’t robbery and dismemberin' body limbs\nLike you was Tommy Lynn Sells\nAnd chainsawin' them in the basement\nHardly fits your job description\nAin't nobody dippin'\nOut the back of the club like, \"Oh my God, he's trippin'!\"\nOnly time you get the blade is probably with the dang lawn equipment, ain't it?\nWouldn't take a bobby pin and wave it\nI need to stop bein' debated\nYou're still copyin', Xeroxing, I'm still coppin' a feel\nLike Bill Cosby at will, poppin' a pill\nThen spill Oxys in Jill's coffee\nThen send her out to the hotel lobby a lil' wobbly and still groggy\nThis blonde fuck's reprehensible\nMisconducts, never sensible\nKiss my butt, my set of principles\nIs gone, but 'til I get the President to respond\nMy pen and pencil is a missile launcher\nAnd send it to Mitch McConnell\nJust as big of a bitch as Donald—shit's on, bruh! (Ha-ha)\nLet me sing this shit soprano\nWhile I do it pizzicato\nIvanka, stiff-arm her while I'm hittin' on Melania\nAnd this song's for all ya\n\n[Chorus: Eminem & Kent Jones]\n'Cause nobody likes me, everybody hates me\nThey want me to go eat some worms (I hope you offended)\nAnd drag my name through the mud, through the dirt\nBut I'ma make you eat your words (I hope you offended)\nYou can try to hold me down, but you better let me up\n'Cause you're only gonna make things worse (I hope you offended)\n'Cause I swear when I get up, I'm never gonna let up\n'Til everybody eats my turds\n\n[Verse 2: Eminem & Paul Rosenberg]\nThese drums and hard snares bring out the worst in me\nLike Justin Ross Harris at a nursery\nGoin' ham at candy yam on nanny cam\nI'm gettin' handies with the zanny Xannys in the Caddy armrest\nI'm imaginin' objects\nSo I'm battin' cobwebs from a daddy longleg\nIn Hamtramck, got the panoramic camera\nXanax, a banana hammock and a Santa hat\nI'm smellin' like a damn mechanic\nWith a chick that looks like Janet Jackson with a Spanish accent\nTwice her age and I'm actin' half it (Ha-ha)\nGrow up? Nah, not that I know of, y'all\nBasement just got a frickin' overhaul\nGot a stripper pole installed\nStarted rollin' all through those Klonopins like a bowlin' ball\nLike an overdose on twice the ratio of Propofol\nAnd go through no withdrawal\nWhile I get fellatio and give a facial to\nAn interracial blow-up doll of Rachel Dolezal\nYou're so appalled (Em…), so's my manager\nBitch, I am mature, fuck a pro career\nCoast is clear, but nowhere to go from here\nAnd nobody's close so don't compare\nThey ain't nowhere near, I'm way over here\nMy competition can't see me—'cause I don't own a mirror!\nBut, Marshall, you are terrific, so smart and gifted\nI'm so narcissistic, when I fart I sniff it\nDo a fake dab to smell my armpits, whiff it\nYour anxiety's throwin' gang signs\nBut I made strides with these rape lines\nI'm cuttin' back on women hate crimes\nLike Ray Rice when he FaceTimes\nBang, bang, bang, bang time\nDang knives're butcher than gay wives\nYou're gonna need sutures the same size\nAs the blade I push into caput'cha\nWhen I pull 'em like (What?) sleigh rides\nGotta stab a bitch at least eight times to make it on Dateline\nI came to stake my claim like a canine waitin' in a buffet line\nSo, Kellyanne Conway, I'm a really bad hombre\nCome play, belly dance on me\nI've been makin' wedding plans all day\n\n[Chorus: Eminem & Kent Jones]\n'Cause nobody likes me, everybody hates me\nThey want me to go eat some worms (I hope you offended)\nAnd drag my name through the mud, through the dirt\nBut I'ma make you eat your words (I hope you offended)\nYou can try to hold me down, but you better let me up\n'Cause you're only gonna make things worse (I hope you offended)\n'Cause I swear when I get up, I'm never gonna let up\n'Til everybody eats my turds\n\n[Verse 3: Eminem]\nEight-year-old with the wordplay\nGirl, take this pole like a survey\nToday wasn't my birthday\nBut I'm caked up like a dessert tray\nSo we're in shape, 'cause you're in a slurrin' state\nI’m a ten, you’re an eight\nLike what I do before, after, and durin' rape!\nYou wanna get into a pissin' contest and find out who's better?\nAnd be made a fool out of when I pull on 'em?\nR. Kelly with a full bladder\nNon-high school grad, I'm not a scholar\nBut I'm so cold when I'm droppin' knowledge\nMy degrees is the same as I got in college (Zero)\nBut nobody's hotter, you owe me my respect\nI owe you nada like Haloti, partner\nBlow me, told you I'm so dirty, homie\nYou can throw me in some holy water\nWith some floaties on and get the soap and try to\nGet the Pope to hold me while you hose me off\nAnd nope, I won't be washed\nHope to God I don't explode\nI gotta blow this spot up though, I got a lotta mo'\nI won't put the sugar coating on it though\n'Cause sometimes you can feel like your energy's expired\nRap's got you drained, dead tired, zapped\nYou feel like a wet pile of crap\nBut look, man, like the feds buggin' my phone (Uh-huh)\nI get why you're tapped\n\"But you gotta get your fire back\nCatch fire, get upset and fire back!\"\nIs what I tell myself when times get bad\n'Cause sometimes I might get sad\nBut I take the same advice I had\nAnd tell myself like I used to tell Hailie when life's a drag\nTold her to do like her dad: don't cry, get mad!\n'Cause little baby powders belong in diaper bags\nI'm hyper, by the time you see this side of me\nI'm right in your ass (Sodomy!)\nFoot up it, I stood up for the kid\nWho had to put up with the bullies at his school (At his school)\nYou ain't had to have no money\nOr go shoppin' just to cop a fuckin' attitude (Attitude)\nNow my dough's amountin' to a mountain\nThat's rised too high to count it\nNever asked to be rich, all I did was wish\nI had a dime for every time that I was doubted\nBut then I think about it, then I'm enraged\n'Cause I just figured out that if I was paid\nFor the time I spent to put the pen to the page\nIt'd be minimum wage\nBut it's embedded in my head I never\nHunted for the bread and butter\nWhat I wanted was to be the one that they was scared of but\nI'm never gonna get the credit for the sweat and blood\nI put up in the pen, and when I'm dead I wonder\nWill they put me on a pedestal\nOr forget I was ever this incredible?\nI guess I better go harder than ever 'cause\nI'll never get another motherfuckin' opportunity again\nTo offend as many people with this, I can simply because I can\n\n[Chorus: Eminem & Kent Jones]\n'Cause nobody likes me, everybody hates me\nThey want me to go eat some worms (I hope you offended)\nAnd drag my name through the mud, through the dirt\nBut I'ma make you eat your words (I hope you offended)\nYou can try to hold me down, but you better let me up\n'Cause you're only gonna make things worse (I hope you offended)\n'Cause I swear when I get up, I'm never gonna let up\n'Til everybody eats my turds", "image": "https://images.genius.com/edd76153e7ac3ec36be997aea55f32ed.1000x1000x1.png"}], "artist": "Eminem"}