{"songs": [{"title": "The Watchers", "album": "No Genre", "year": "2010-12-07", "lyrics": "[Verse]\nYes, I feel the end, the end is close\nThe same thing happened eons ago\nTo know exactly you have to read up some more\nEveryday technology speeds up some more\nAs is above, so is below\nSome feel the heat, yet some feel the cold\nWe are the souls, yes, we have been chose\nSome roll with angels and demons and ghosts\nBut shh! Hold up, Bob, don’t go there!\nYou know that they watching, the all-seeing stare\nBut they can’t stop me, I’m already there\nAnd y’all ain't seen shit but y’all already scared\nI’m gone, high like fructose, fructose\nYou wanna know the truth? Really, you don't, you don't\nIt’ll blow you out your mind, like a UFO, UFO\nI’m basically a resident of Pluto, Pluto\nYou know, but you’ll probably be the same one hatin'\nSayin' every rapper is in the freemasons\nWhile the cops giving out free mace to your face\nNow how do that taste? I’m outta my mind\nThese videos tellin’ y'all lies, bruh\nTellin' y'all we holding evil hand-signs, bruh\nLast time I checked I’m from the Eastside, bruh\nSo do your research and make your own mind up\n’Cause us musicians have influence on this mic\nBut they don’t like that, so they conquer and divide\nDouble-H N-D, hip hop never dies\nSo shoot all you want, but we fly\nBecause, you know, no one man should have all that power\nObviously ‘cause it’s only one power\nBut nevermind, y’all keep worshipping Towers\nWhile the clock keeps handing y'all hours\nBut pucker up because the truth gets sour\nMore sour than the sour diesel I devour\nHear me by the hour, I give you 50 vowels\nWhen I brain storm it's like a shower\nSo pull out your towels, and don't let 'em play you\nDo your own thing, fuck what they do!\nAnd if you good at somethin' make sure they pay you\nAnd if not, take a thankyou\nWhether they praise you, or whether they hate you\nIt’s all about the attention that they pay you\nY’all on that grape drink, try this grape juice\nShouts to Grand Hustle, we got that break through\nAnd, yes, it’s evident we better than\nThe rest of these competitors\nReally there ain't no one else ahead of us\nYeah, I bust these verses off, et cetera, et cetera\n‘Cause they watching y’all like the Federers, owww\n\n[Outro]\nKadoish, kadoish, kadoish\nAdonai Tsebayoth\nIt’s B.O.B. and I’m out. Peace!", "image": "https://images.genius.com/d18ebaef113d710715491da16422feee.1000x1000x1.jpg"}], "artist": "B.o.B"}