{"songs": [{"title": "What the Blood Clot!?!", "album": "Tical", "year": "1994-11-15", "lyrics": "[Intro: RZA, (Method Man), {Y-Kim the Ill Figure}]\nShit is banging! You see what I'm saying? Our shit is banging!\n(Our shit is staining, son) Yo, Shaolin running this shit, son!\nRunning this shit! (Staining) What's up, Y-Kim? 'Sup, nigga?\n{What's up, man? What's up?}\nWhat's up? Representing Brownsville\nKnow I'm saying? Base, peace to all my Brownsville niggas!\n{The alcoholics son} What's going on, son?\nPeace to all my Putnam Avenue motherfuckers!\nBedford-Stuy, nigga!\n(Yeah, peace to the valley goat..)\nPeace to my Wild Wild West Brighton niggas! (Big up The Bridge!) Yeah, FUCK outta here, nigga\n\n[Verse 1: Method Man]\nAll I hear is gun shots\nCan I touch something? What the Blood Clot!?!\nNigga want Tical, make it happen\nYou know my fucking style, fuck the rapping\nWe can take it back to '85 if you wanna start acting like you live\nIt's all good, I'm rolling with my clique\nOwls, Backwoods and Phillies\nSmoking cess blunts, mixed with illy got me flustered\nNow the whole world looks dusted\nI'm in the area with the steel that never rusted\nFor real, nigga touch it and you burn\nWhen will motherfuckers learn?\nWhat be spreading like a germ? Haha, it's Meth, word\nI be that early bird that got the worm and if you check it\nI'm on point, like a fax machine you get the message\nIt's be no question it's them, bust the second guessings\nKeep your thoughts on your lessons\nWhat the Blood Clot!?!\nTo tell the truth you don't amaze me\nKilla Hill Project, a Star Trek phaser couldn't faze me\nWhat? Check the Raider Ruckus, fuck this\nSmoke a Dutchmaster, have 'em screaming for the dutchess\nYeah, I gotta have it, so I strive to stack my papes\nIf I don't do it for mydelf, I'ma do it for Kase\n'Cause that's my peoples\nI'm giving you injections that be lethal\nWeapons, when niggas start to half stepping, then I get evil\nBut don't let that negative vibe right there mislead you\nI'm humble, a fucking Killa Bee, far from bumble\nI sting you - bzzz - and I bring you\nThirty-six Chambers of head banger, bitch\nWhat ya deal with? I think the mic's on the fritz\nFaggot soundmen, they be sabotaging shit\nLook up in the sky, it's a bird, it's a plane\nMeth-Tical, let the whole world know my fucking name\nWhat the Blood Clot!?!\n\n[Outro: Method Man]\nYeah, yeah, you know what I'm saying?\nKeep it reals on this thing\nFirst of all I'd like to give a big up, peace and shout out\nTo my brothers in the belly of the beast\nRaider Ruckus, we friends to the end and back again, baby. One love\nGin Lover, Shitty Brown, Pus Head, Pil, the P.L.L\nStack DAT, Dusty, Storm, Suu! We still in here, nigga\nJamel, one love, baby, Nice\nUncle Eric aka Shane, I ain't forget you, nigga\nShakim, Nutt, Big Shaft, K. Fisk, Big Free from Cipher Heat\nAll the fugitives on the run\nEverybody from Rikers Island to San Quentin\nAnd a big major shout out to my old dad who just got home on work release\nKeep your heads up niggas\n\nMy people!\n\n(Yeah that nigga fucking Dirty Bastard, God, that nigga is crazy)\nFucked with a napkin on his dick\n(laughter)", "image": "https://images.genius.com/e8eea98eab886487258b11bd4e1cca4b.1000x1000x1.jpg"}], "artist": "Method Man"}