{"songs": [{"title": "Trylogy", "album": "Tha Streetz Iz a Mutha", "year": "1999-11-16", "lyrics": "[Kurupt]\nRainstorm the back of the bank, bustin loose like Muggsy\nTyphoons, Kurupt Calhoun\nWith a platoon of backwards ass buffoons\nReady to shoot anything that moves\nLoad to tunes from \"The Blue Lagoon\"\nMask on, khakis, ounced on house shoes\nSo I'mma start it off skitzin on the first nigga\nSaul here for stacks, heard me, hear me?\nHeard that, word don't pass the front do'\nBefore you gotta show em your heart and soul and Desert Eagle fo'\nExplode then watch em fold, the other niggas froze\nHe knew better, mask in an all blue sweater\nTwo pumps ready for a riot\nFull Baretta, six hostages with a loss of oxygen\nWet as a river, sixteen bricks to flip\nAfter I flip these bitch niggas for they shit\nI been down with the twist since eighty-six\nHyperactive with a automatic, snappin reaction\nI'm sick of waitin, a thirty-eight, I'm jackin for Daytons\nKick the door in for sure, double four's rammin\nHollow bandit, ready to knock him off if he standin\nPosition the cannons, telegraph the whole parameter\nParalyze anything that walks through perimeter\nCervical veins lacerated lost to missiles\nInterrogated and I paraded posted with pistols\nTime for war this is when the heart's exposed\nChange up the game, cockin and sparks explode\nI'm a marksman, touch of death, ten steps then draw\nAnd that's all, end to anything before\nIn a world war, off like a Concorde jet\nBut fool, D.P.G.'s the set\nIn a world war, this is when the heart's exposed\nChange up the game, cock, sparks explode\nManic-depressive panic and then start skitzin\nNot givin a fuck while all y'all bitchin\nDis is for all my G's, my ho-mies\nFlippin birds and servin ki's\nI'm with King T and Tha Liks, Alkahol-ed it up\nLike bitch, get the fuck off my dick!\nI got pistols, pills, acid, bomb, crank\nCrystallized coke and limes, I don't give a fuck!", "image": "https://images.genius.com/19827b73d665d135cdf903e8afe08997.1000x1000x1.jpg"}], "artist": "Kurupt"}