{"songs": [{"title": "Kitchen", "album": "Trap-A-Velli 2 (The Residue)", "year": "2011-02-22", "lyrics": "[Hook: 2 Chainz]\nI go hard in the mother fuckin' kitchen\nHalf thing, whole thing, nigga I'm pitchin\nHit it with the soda make a nigga start whipping\nHit you with the choppa make a nigga start flipping!\nI go hard in the mother fuckin' kitchen\nHalf thing, whole thing, nigga I'm pitchin\nHit it with the soda make a nigga start whipping\nHit you with the choppa make a nigga start flipping!\n\n[Verse 1: 2 Chainz]\nI go hard in the mother fuckin kitchen\nUsing baby bottles for the lean, wifey say I'm trippin\nPlus I got Maybelline smeared right below my zipper\nI’m a kama sutra reader and a conjure drinker\nHot on the stove, smoking like reefer\nThis work ain’t bout shit, that’s why its cheaper\nThis ho ain’t bout shit, that’s why she cheaper\nAll we blow is strong, that’s why you weaker!\nWait up, your status change when your weight up\nWaiting on the meal, I already put my plate up!\nNigga fall back up, I already put my rake up\nEverytime I leave the booth, they put yellow tape up\nHair weave killer, messing up her make-up\nPyrex vision and I’m bout to cook a cake up\nGet a fork, add a little water\nGet on any track, and I ride it like Marauder\n\n[Hook]\nI go hard in the mother fuckin' kitchen\nHalf thing, whole thing, nigga I'm pitchin\nHit it with the soda make a nigga start whipping\nHit you with the choppa make a nigga start flipping!\n\n[Verse 2: Young Jeezy]\nIt’s Jizzle 3 Watches, yeah that asshole!\nOne platinum, one white, one rose gold\nDrive a solid gold Rolls to the Rose Bowl\nRosé in the club for my rose hoes\nMan fuck these niggas I got blow goals\nI count money all night, I need some no-doz\nHater, try one of these, you need a bank roll\nThrow the money in the trunk, bitch the bank roll\nI go hard in the mother fuckin kitchen, nigga\nGot me staring at that water like I’m fishing, nigga!\nNever know about me, I pull a bass out\nDrop a 250 in and pull a half out\nHad to do it for the town and the trap niggas\nMe and 2 Chainz, its over for you rap niggas\nAnd nothin says butter like Parkay\nAnd nothin make them Jay's stutter like hard yay\n\n[Hook]\nI go hard in the mother fuckin' kitchen\nHalf thing, whole thing, nigga I'm pitchin\nHit it with the soda make a nigga start whipping\nHit you with the choppa make a nigga start flipping!\n\n[Verse 3: Pusha-T]\nStarted in the kitchen, king of the whipping\nDenzel in glory, tear drop was missing\nJust like the roof is, riding in that Chris Brown\nTwo seater deuces, peeling like I skip town\nPocket full of brick money, neck full of black gold\nBlack diamonds got the Jesus piece like Manute Bol\nThat’s 2 Chainz, I'm 2 Stoves\nFor every one I cook, I make two clones\nMary Kate and Ashley, Tia and Tamera\nTwo in the Four like the Porsche Panamera\nLook in the mirror, look in the mirror\nVision clouded by the coke, ain’t making it clearer\nI make it look easy, I rap it up greazy\nBandanna round the brick, I make it look look Jeezy\nBut I push a ton of it, get the name right\nWho else could fly it in and land on the same flight?...\n\n[Hook]\nI go hard in the mother fuckin' kitchen\nHalf thing, whole thing, nigga I'm pitchin\nHit it with the soda make a nigga start whipping\nHit you with the choppa make a nigga start flipping!", "image": "https://images.genius.com/82908e72685ad4d4fa667a2842fbd939.500x500x1.jpg"}], "artist": "2 Chainz"}