{"songs": [{"title": "Wow", "album": "Freshmen Adjustment Vol. 1", "year": null, "lyrics": "[Intro]\nIntroducing... Mr. I Ain't Know You Did That\nAnd, Mr. Oh, That's My Favorite Shit\nAnd Mr. OH! Damn, I Wish That Was a Single\nAnd uh, like Noreaga say, it goes... uh!\n\n[Hook]\nI go to Jacob with 25 thou, you go with 25 hundred, wow\nI got 11 plaques on my wall right now\nYou got your first gold single damn nigga, wow\nH to the Izzo did 3 thou spins in a week\nYou get a thou in a month, wow\nY'all niggas want credit but y'all need to slow down\nKanye to the killin' y'all from Chi-town\n\n[Verse 1]\nHow your wife gon' say she never sold drugs a day in her life?\nBut she still wanna pump the yay?\nAnd y'all mad 'cause y'all not knowin\n'Cause these canaries so yellow\nWhen y'all pull up whether to stop or keep going\nI got Gs, rock Rock n Roll tees wit no sleeves\nTats showin', tucked in, strap showin'\nHow he get seven TVs in that ‘lac-‘lac?\n3 in the front, 2 in the back, 2 in that back-back\nWhile you in that hatchback\nAnd try to sell work and don’t get shit from them packs back\nAnd try to rap, the studios won't give you ya DATs back\nAnd try to get publishin', all you get in your ass capped (That's all, nigga)\nAnd that’s that\n\n[Hook]\nI go to Jacob with 25 thou\nYou go with 25 hundred, wow\nI got eleven plaques on my wall right now\nYou got your first gold single! Damn, nigga, wow!\n\n[Verse 2]\nMagazines call me a rock star, bitches call me cock-star\nBillboard pop star, neighborhood block star\nChi-town go-getting pimps, we mobsters\nGingerbread man even says “You’re a monster”\nRemember that? Uh-huh, that’s that Shrek shit\nRemember back in ’92, niggas used to catch wreck, shit\nRemember that track I tracked for you bout three months ago?\nUh 0uh, that’s the one, now cut my check, bitch\nAnd I ain't feeling that Lexus - more that CLK\nSee me like \"Damn! A CL, K?”\nYeah that’s how we eating and, keep us looking peace and then\nI ain't know he rap as good as he do beats, and then\n\n[Hook]\nI go to Jacob with 25 thou\nYou go with 25 hundred, wow\nI got 11 plaques on my wall right now\nYou got your first gold single damn nigga, wow\nH to the Izzo did three-thou spins in a week\nYou get a thou in a month, wow\nY'all niggas want credit but y'all need to slow down\nKanye to the killin' y'all from Chi-town\n\n[Verse Three]\nNow, niggas forcing me to keep the heater\nBlack strap, white handle, I got jungle fever\nYou know the rules, five up close, one gon' leave ya\nYou don't know about Kanye? Son gon' teach you\nWhat's the first thing that popped in ya mind\nWhile I was popping this rhyme?\nYou don't picture popping a nine?\nSee you paralyzed from the top of the spine...", "image": "https://images.genius.com/11b5c3bdc828bc9942f2c195f9ffa76c.300x300x1.jpg"}], "artist": "Kanye West"}