{"songs": [{"title": "Gimme the Loot", "album": "Ready to Die", "year": "1994-09-13", "lyrics": "[Intro: Notorious B.I.G.]\nYeah, motherfuckers better know\nHuh, huh (I'm a bad, bad, bad)\nLock your windows, close your doors\nBiggie Smalls\nHuh, yeah\n(I'm a bad, bad, bad)\n\n[Verse 1]\nMy man Inf left a TEC and a nine at my crib\nTurned him self in, he had to do a bid\nA one-to-three, he be home the end of '93\nI'm ready to get this paper, G, you with me?\nMotherfuckin' right, my pockets lookin' kinda tight\nAnd I'm stressed\nYo, Biggie let me get the vest\nNo need for that, just grab the fuckin' gat\nThe first pocket that's fat, the TEC is to his back\nWord is bond, I'ma smoke him, yo, don't fake no moves (What?)\nTreat it like boxin', stick and move, stick and move\nNigga, you ain't got to explain shit\nI've been robbin' motherfuckers since the slave ships\nWith the same clip and the same four-five\nTwo point blank, a motherfucker sure to die\nThat's my word, nigga even try to bogard\nHave his mother singin', \"It's so hard\"\nYes, love, love your fuckin' attitude\nBecause the nigga play pussy\nThat's the nigga that's gettin' screwed\nAnd bruised up from the pistol whippin'\nWelts on the neck from the necklace strippin'\nThen I'm dippin' up the block and I'm robbin' bitches, too\nUp the herringbones and bamboos\nI wouldn't give a fuck if you're tnangerp\nGive me the baby rings and the #1 Mom pendant\nI'm slammin' niggas like Shaquille, shit is real\nWhen it's time to eat a meal I rob and steal\n'Cause mom duke ain't givin' me shit\nSo for the bread and butter, I leave niggas in the gutter\nHuh, word to mother, I'm dangerous\nCrazier than a bag of fuckin' angel dust\nWhen I bust my gat, motherfuckers take dirt naps\nI'm all that and a dime sack, where the paper at?\n\n[Interlude]\nWhen he's stickin' you and takin' all of your money\n\n[Chorus]\nGimme the loot, gimme the loot (I'm a bad, bad, bad)\nGimme the loot, gimme the loot (I'm a bad, bad, bad)\nGimme the loot, gimme the loot (I'm a bad, bad, bad)\nGimme the loot, gimme the loot (I'm a bad, bad, bad)\n(What's mines is mines and what's yours is mine)\nGimme the loot, gimme the loot (I'm a bad, bad, bad)\nGimme the loot, gimme the loot (I'm a bad, bad, bad)\nGimme the loot, gimme the loot (I'm a bad, bad, bad)\nGimme the loot, gimme the loot (I'm a bad, bad, bad)\n(What's mines is mines and what's yours is mine)\n\n[Verse 2]\nBig up! Big up! It's a stick up! Stick up!\nAnd I'm shootin' niggas quick if ya hiccup\nDon't let me fill my clip up in ya back and headpiece\nThe opposite of peace, sendin' mom duke a wreath\nYou're talkin' to the robbery expert\nStep into your wake with your blood on my shirt\nDon't be a jerk and get smoked over bein' resistant\n'Cause when I lick shots them shits is persistent\nGoodness gracious, the papers\nWhere the cash at? Where the stash at?\nNigga, pass that\nBefore you get your grave dug from the main thug\nThree fifty-seven slug\nAnd my nigga Biggie got a itchy one grip\nOne in the chamber, thirty-two in the clip\nMotherfuckers better strip, (Yeah, nigga, peel!)\nBefore you find out how blue steel feel\nFrom the Beretta, puttin' all the holes in ya sweater\nThe money-getter, motherfuckers don't know better\nRolex watches and colorful Swatches\nI'm diggin' in pockets, motherfuckers can't stop it\nMan, niggas come through, I'm takin' high school rings too\nBitches get ********* for their earrings and bangles\nAnd when I rock her and drop her, I'm taking her door knockers\nAnd if she's resistant: blakka, blakka, blakka\nSo go get your man, bitch, he can get robbed, too\nTell him Biggie took it, what the fuck he gonna do?\nMan I hope apologetic or I'm a have to set it\nAnd if I set it, the cocksucker won't forget it\n\n[Interlude]\nHey bitch, hey bitch, gimme your money bitch (When he's stickin' you and takin' all your money)\n\n[Chorus]\nGimme the loot, gimme the loot (I'm a bad, bad, bad)\nGimme the loot, gimme the loot (I'm a bad, bad, bad)\nGimme the loot, gimme the loot (I'm a bad, bad, bad)\nGimme the loot, gimme the loot (I'm a bad, bad, bad)\n(What's mines is mines and what's yours is mine)\nGimme the loot, gimme the loot (I'm a bad, bad, bad)\nGimme the loot, gimme the loot (I'm a bad, bad, bad)\nGimme the loot, gimme the loot (I'm a bad, bad, bad)\nGimme the loot, gimme the loot (I'm a bad, bad, bad)\n(What's mines is mines and what's yours is mine)\n\n[Verse 3]\nMan listen, all this walkin' is hurtin' my feet\nOoh, money looks sweet\nWhere at? In the Isuzu Jeep\nMan, I throw him in the fiend you grab the fucking cream\nAnd if he start to scream, bom-bom, have a nice dream\nHold up, he got a fucking bitch in the car\nFur coats and diamonds, she think she a superstar\nOoh, Biggie let me jack her, I'll kick her in the back\nHit her with the gat\nYo, chill, shorty, let me do that\nJust get the fucking car keys and cruise up the block\nThe bitch act shocked getting shot on the spot\nOh shit, the cops\nBe cool, fool\nThey ain't gonna roll up, all they want is fucking doughnuts\nSo why the fuck he keep looking?\nI guess to get his life tooken\nI just came home, ain't trying to see Central Booking\nOh shit, now he looking in my face\nYou better haul ass 'cause I ain't with no fucking chase\nSo lace up your boots, 'cause I'm about to shoot\nA true motherfucker going out for the loot\n\n[Outro]\nTake that motherfuckers", "image": "https://images.genius.com/e6cce6ad5c26175653cd5e5590b6e235.1000x1000x1.jpg"}], "artist": "The Notorious B.I.G."}