{"songs": [{"title": "Whatcha Gon’ Do", "album": "Miss E ...So Addictive", "year": "2001-05-15", "lyrics": "[Timbaland]\nDun-dun-dun, dun-dun-DUNN-dun\nDun-dun-dun, dun-dun-DUNN-dun\nDun-dun-dun, dun-dun-DUNN-dun\nDun-dun-dun, dun-dun-DUNN-dun\n\nI be dippin in clubs, girls screamin, \"Do you want it Timb?\"\nNiggas, playa hatin sayin, \"Who the hell is him?\"\nI'm in the back, gleamin from all that virgin gem\nKeep a bunch of pretty models surroundin Timb\nI'm over capac'y when it come to makin them beats\nMe and Missy makin Y'ALL, move y'all feets\nMakin y'all dance and tango, make y'all legs get weak\nThat's only cause we drop a bunch of heat\nThat's whatcha gonna expect, comin from my crew\nBunch of dope beats, and a bunch of dope lyrics too\nI know that's too much for you to handle dude\nNow ask yourself what..\n\n[Chorus: Timbaland]\nWhatcha gonna do?  Whatcha gonna do?\nWhatcha gonna do?  Whatcha gonna do?\nWhatcha gonna do?  Whatcha gonna do?\nWhatcha gonna do?  Whatcha gonna do?\n\n[Missy]\nWhen me come in the spot, dem wannn' jock\nDem nasty boy lookin around, with big cocks\nThem girls be plottin on how to get the rocks\nSo I beat that ass to the ground like I'm the cops\nAHH, what they gon' say, AHH, don't wan' play\nRRR, get 'em in the club, AHH, smokin on hay, HEY\nAHH, when I'm in my ride, OH AHH, people walkin by\nAH AHH, pistol by my side, B-BRRR, in case dem wan' try\n\n[Chorus]\n\n[Timbaland]\nI be gettin in girls clothes, make 'em buy my whole wardrobe\nBetter get all my dough, pluckin the hair in my nose\nIt's official I'm a pimp, cause my name glows\nIf (?) I'm back to the Yugos\n\n[Missy]\nTalkin that junk, you get BURRIED\nYou don't wanna end up in the cemeTARRRRY\nMe and Timbaland got tracks that will KILL YOU\nAny other hen I got gats that will PEEL YOU\nWhatcha gon' say, RRR, whatcha gon' do, RRR\nWhen I'm in the club, RRR, comin for you\nI'm just a smooth motherfucker (aww yeah baby)\n(Y'all heard me?!) Ahhh\nWhatcha gon' say, RRR, whatcha gon' do, RRR\nWhen I'm in the club, RRR, and comin for you\nI'm just a smooth motherfucker\n\n[Chorus]\n\n[Chorus]", "image": "https://images.genius.com/faad336511ca96884fc642f4beeba1a6.1000x1000x1.jpg"}], "artist": "Missy Elliott"}