{"songs": [{"title": "Armed & Dangerous", "album": "Rise Up", "year": "2010-04-20", "lyrics": "[B-Real (Sen Dog):]\nReady? set, go! I'm ready to run\nSteady we get though, under the sun\nAbout to let go. - Show me respect though!\nIt's gon' be a fat joint. - Soul - in your mental. (soul - in your mental!)\nWe came from the bottom and rose to the top\nLike the cream in your coffee - burning hot! (burning hot!)\nClimbing the Billboards for the number one spot\nKing of the block - stop for a second to watch!\nLook and learn and loose your knot\nNo more bottles to pop, no birds in the drop\nBut - we still rollin'! (we still rollin'!) - Pocket's swollen. (pockets swollen!)\nWe're - locked and loaded, then the scene exploded\nWe' - solid as ever on any endeavour\nCypress Hill forever, doesn't get any better!\nWe - came and saw. - And conquered it all! (conquered it all!)\nWe're hungry for more like the kids in Darfur. (like the kids in Darfur!)\n\n[Hook: B-Real]\nWe live hard, still armed and dangerous!\nWe young love, be alarmed, don't play with us!\nPlay the song! Gotta bounce just to stay with us!\nCome along, hit the bong and blaze with us!\n\n[Sen Dog:]\nI'm the dog and I'm undisputed. - And you've been recruited!\nI'm the general that your boy saluted. (that your boy saluted!)\nGive you a minute to see how we do it (how we do it!)\nYou've never seen such finesse cause you're so polluted. (you're so polluted!)\nI'm the king in this area hombre\nKnocked 'em out the park when I'm standing on home plate. (c'mon!)\nSo many years of blood sweat and tears\nWithout me the dogs stay switching the gears!\nBut I'm still the same man from back in the day\nAnd I'm still gettin' luck from Africa to L.A.! (to L.A.!)\nJake One hit play; burst started to sway\nEvery time I leave the city fools want me to stay! (want me to stay!)\nCause they stay loyal, so it's harder to go\nAnd like the lights. - I got's to grow!\nThat means I'll roll (I'll roll!) but I'll return later (I'll return later!)\nGive props to my peop (le), and buckshots to haters. (buck, buck!)\n\n[Hook x2]\n\n[B-Real (Sen Dog):]\nRaise your hands in the air like you're supposed to\nAnd everybody scream like you're on a rollercoaster\nWe're down - with the Costra Nostra\nWe smashing! - We sick jackin' and the Soul Assassins. (Soul Assassins!)\nThe Hip-hop culture - we fuck you both\nJust as you caught in the rapture. - All I hear is laugher. (all I hear is laughter!)\nIn a year's time some of you punks, won't matter!\nLet's see - if you can hang if you can climb the ladder!\nYou ain't a rapper, you're a fucking joke! (you're a fucking joke!)\nA one-shock hack on a track, get your pass revoked! (get your pass revoked!)\nI got keys to the city and we locking you out\nWe come hard for the paint. - And I'm blocking you out!\nSo run for the hills and hide in the can\nWe just put the mic' down - and be that fan. (and be that fan!)\nWith your - petty hands outside the lobby\nI'm a pro, get my signature, this ain't no hobby!\n\n[Hook x2]", "image": "https://images.genius.com/f469b84836527dfec52206e182dfacce.220x220x1.jpg"}], "artist": "Cypress Hill"}