{"songs": [{"title": "When I Sleep", "album": null, "year": "2011-08-05", "lyrics": "Let you know something about me\nI'm a Southern boy! Know what I'm talking about?\n\n[Hook - Ned Cameron]\nI remember all the days stuck in December\nCaught in the rain, all the pain, having no money come my way\nBut now I'm making money even when I sleep\nEyes wide awake, but I really need a dream\nWe hustle, hustle\n\n[Verse 1]\nI go by Weezy, baby, so call me \"Lil Weezle\"\nMy city is New Orleans, baby, my street is Eagle\nAnd that's my nigga's ?\nHe like to break a piece\nHe got the gun, I got the rope, my nigga pick a tree\nAin't talking money, I let the nickel speak\nNiggas think I'm cheap, you ain't gon cent to me\nThe only thing to be: a picture on your shirt\nNo homo: I put your dick in the dirt\nFlip em like a shovel with that wrist work\nI stop ya, heard? I keep em coming like clockwork\nJ cool with the jump, it's an outburst\nAnd we gon' be from South Philly til the South dirt\nBaton Rouge, Lafayette or the Outskirts\nIt's lilWeezyana stay in your house jerk,\nThis ain't a concert, this ain't a hot verse\nThis a lot worse, so hear the shot burst:\n\n[Hook - Ned Cameron]\n\nEvery hustle, we hustle, hustle - hey!\n\n[Verse 2 - Kid Ink]\nStraight from the bottom, now I'm high as a mountain\nFrom the city where you need way more protection than a condom\nHad a dream but I'm conscious, see the veins in my sockets\nIn the sky, wishing I could turn this plane into a rocket\nAnd just leave here, more money but the problems still live here\nI feel the pressure from my lil peers\nCause I'm about to blow, Swisher Sweet breathe in\nOne hit, lose your breath, all I do is (breathe) win\nBig fish swimming in the deep end\nNo present, fuck I'm into pretense\nI remember rainfall in the street\nNow I'm in the club: watch me make this bitch precipitate\nI promised to myself I would be the best\nYou could say I'm crazy or a mess\nJust hand me a wrench\nAnd it's nothing you can tell a ho\nLife is just a bitch, I'll forgive her but I'll never forget", "image": "https://images.genius.com/e76c1ae2a82cfea475269184a6d7c38d.300x300x1.jpg"}], "artist": "Lil Wayne"}