{"songs": [{"title": "None of Y’all Betta", "album": "Kiss Tha Game Goodbye", "year": "2001-08-07", "lyrics": "[Intro: Styles P]\nIt's sorta like the Holy Trinity...\nI'mma say...\nI say it's like three different guns you fuckin faggots\nGet shot three different ways\nMatter fact, make that six different ways\nGun in each hand bitch\nNone of y'all betta\n[DJ Premier scratch twice]-- Jadakiss-- \"Ain't none of y'all betta\"\nIf it is name it\nWe'll squash you, ASAP, feel it\n\n[Verse 1: Styles P]\nAll I know, niggas give me all my dough\nLike Boston George comin through with all my blow\nRight now I'm tryin to charter a jet\nFuck this, hit the Panama Canal and get a harder connect\nStep on your toes, mess with your hoes, shoot up your mans\nCome through the block tryin to screw up your plans\nCuz I still rob niggas for coke\nUnderstand I'm the first one they call when they gettin the dope\nI'm the one who prick your finger when they give you the oath\nI'm the one who made the hit when they bring you the toast\nLike Pacino and DeNiro 'cept they call me Paniro\nSad Styles still spin that arrow, fuck it\nLike the boss of New York, you know how I feel\nKill a motherfucker cuz a corpse don't talk [no doubt]\nSixteen in the joint wit one in the head\nIf the bullets had legs have them run in your head, bitch\n\n[Hook - DJ Premier scratches]--- Jadakiss- \"ain't none of y'all betta...\"\nSheek- \"what y'all know about...\" Styles P- \" put in my work...\"\nSheek- \"on the block...\"\nJadakiss- \"ain't none of y'all betta...\" Styles P- \"Let you know it's all real...\"\nTef and Billy Danze- \"Is it real? Yeah son!\"\nJadakiss- \"ain't none of y'all betta...\" Sonja Blade- \"what y'all know about...\"\nStyles P- \"put in my work...\" Sheek--- \"on the block...\"\nJadakiss- \"ain't none of y'all betta...\" Styles P- \"bet you know it's all real...\"\nTef and Billy Danze- \"Is it real? Yeah son!\"\nJadakiss- \"ain't none of y'all betta...\"\n\n[Verse 2: Sheek Louch]\nLet's get it poppin my nigga\nLoad the tech up and go shoppin my nigga\nAnd I don't mean the mall or no Gucci store\nYou know what the fuck I want, bricks of raw\nAnd I'm too old to make less than a hundred a year\nIf it means wavin the hammer and leavin you there\nIf it means grabbin your kids out daycare\nSomebody losin a seed, pay or bleed\nIt's Sheek Louch, I ain't got no heart\nI shoot broad daylight right in front of the mark\nI put 28 holes through the icy car\nFuck around, like the God won't squeeze\nIf I don't see the badge I'm clappin the D's\nLOX motherfucker, the OX motherfucker\nThe reason why you shouldn't cop drops motherfucker\nLike it's something for me to shoot your pops motherfucker, what\n\n[Hook]\n\n[Verse 3: Jadakiss]\nAyo the dopes in the rice, the cokes in the pyrex\nOver the stove and I'm bout to hit it with the ice\nRunners love to pump the bomb\nAin't no more fair ones, now niggas'll jump your moms\nThe god, minus the 12 disciples\nI pop up, all you see is shells and rifles\nIf I don't like you, I'mma kill you not fight you\nI bite a little piece of your ear off like Mike do\nAnd everybody gon' follow me now\nDown 8th in a new Z, mahogany brown\nFaggots want you to kill 'em in a hurry\nIt fucks me up, like they ain't got no money to get buried\nYou could flip, I'll survive m'kay, motherfucker\nIn my block still doin twenty-five a day\nKnow you work out, chest and your back all nice\nBut the twelve gauge'll have your six pack on ice, what?\n\n[Hook]", "image": "https://images.genius.com/659c95067dc52688c5cb0888483ceafc.640x640x1.jpg"}], "artist": "Jadakiss"}