{"songs": [{"title": "Kids (Keep Up)", "album": "Camp", "year": "2011-11-15", "lyrics": "[Chorus]\nIf we were kids, I'd want to give\nYou everything that you would want\nThose other boys, they give you toys\nBut all they wanna do is\nKeep up, keep up, keep up, keep up\nThat's all I want, keep up\nKeep up with me, keep up\nKeep up, keep up, keep up, keep up\nThat's all I want, keep up\nKeep up with me, keep up\n\n[Verse 1]\nI guess I'm fuckin' now, I'm gettin' used to it\nIt's cause I shine, and I ain't gotta use a crucifix\nFuck the fussin' and fightin' and arguin' to this and that\nAnd, \"Why you being mean to me Donald?\"\nI never text her back\nI know it's coming quick, wishin' I could fast forward\nTell these nice girls they're the reason that I'm an asshole\nOmega to alpha male, because of that dollar bill\nWhen I worked the mail room, I ain't have a shot in hell\nI called her ass for two months, ain't heard shit from her\nThese girls couldn't care less when ya chips under\nThe chips are up and on my shoulder, you heard me?\nI take it out on girls who don't even deserve it\nThe girls I tried to hit last year, I still might\nKarma's a bitch who doesn't suck, but I still like\nIf we were kids, I'd have the black K-swiss and Reebok\nIf we were kids, I wouldn’t act like this, but we not\n\n[Chorus]\nIf we were kids, I'd wanna give you everything\nThat you would want\nThose other boys, they give you toys\nBut all they wanna do is\nKeep up, keep up, keep up, keep up\nThat's all I want, keep up\nKeep up with me, keep up\nKeep up, keep up, keep up, keep up\nThat's all I want, keep up\nKeep up with me, keep up\n\n[Verse 2]\nYou made a mistake\nThese dudes? Man, you bathin' in apes\nFindin' you's like findin' Asians I hate\nBut they say I got a fetish, nah, I’m skippin' all of it\nBlack and white girls always come wit' a set of politics\nThat’s all that I was sayin', I’m a proud man\nThey wanna holler when they see your name on SoundScan\nHer name Mercedes, but she push a brown Focus\nAnd she’s doin' coke in front of me, but act like I don’t notice\nThere ain't breakage in that Trojan? She see what she wanna see\nSo I make her take Plan B in front of me\nWomen talk shit on men like all day\nBut it's Pete Wentz, goes both ways\nThey too busy stabbin' hoes like OJ\nThey too busy trappin' pros like Kobe\nThe only thing I put before me is \"Do, re\"\nIf you had told me the truth, we’d be ok\n\n[Chorus]\nIf we were kids, I'd want to give\nYou everything that you would want\nThose other boys, they give you toys\nBut all they wanna do is\nKeep up, keep up, keep up, keep up\nThat's all I want, keep up\nKeep up with me, keep up\nKeep up, keep up, keep up, keep up\nThat's all I want, keep up\nKeep up with me, keep up\n\n[Outro]\nIt’s alright, it’s okay\nIt’s alright, it’s okay, girl\nIt’s okay", "image": "https://images.genius.com/00196af444633a4108e6dc544358985e.630x630x1.jpg"}], "artist": "Childish Gambino"}