{"songs": [{"title": "Mind Made Up (ft. LL Cool J)", "album": "Dretox", "year": null, "lyrics": "[Chorus: Dre]\n\nI got my mind made up, come on; get in, get into it\nLet it ride, tonight's the night, yeah\nI got my mind made up, come on; get in, get into it\nLet it ride, tonight's the night, yeah\n\n[Verse 1: LL Cool J and (Dre)]\n\nUh, you know you a freak\nBefore the album went platinum, ya hardly speak\nAnd now you're skin grinnin, gassed off the chrome rims and\nTwenty room mansion, I rest my Timb's in (yeah, yeah)\nUhh, I feel it how ya shake it\nRings in ya belly, I can't take it (nah)\nToss up your Moët, money make it\nLast week frontin', tonight butt naked (butt naked)\nI got the flavour, make em Zoom-a-zoom (uh, uh)\nThe LL Cool J(yeah), give me room\nLooked up in my eyes as I lowered the boom\n(Twenty thousand freaks packed up in one room, uhh)\n\n[Hook: Dre]\n\nAll I wanna do, is Zoom-a-Zoom Zoom Zoom\n(Mmmm, whatchu wanna do) Uhh, whatchu wanna do?\nAll I wanna do, is Zoom-a-Zoom Zoom Zoom\n(Mmmm, whatchu wanna do) Uhh, whatchu wanna do?\n\n[Verse 2: Dre and (LL Cool J)]\n\nOnce again it's on, can't be home\nThe crime got me in the zone; homies blowin up the celly\nPhone\nThe world knew I had to come once mo'\nAnd just to let y'all know, I do my thing and still blow\nNuff to burn ten mill' cells, confirmed\nThe most anticipated since Tyson's return\nSo come on everybody let's all get down\n(Cause what we have, is a brand new sound)\n\n[Pre-Hook: LL Cool J]\n\nAll the mommies in the house gettin live tonight\nThey wanna (Zoom Zoom Zoom, Zoom Zoom-Zoom)\nAnd all my dogs feel the vibe tonight\nThey wanna (Zoom Zoom Zoom, Zoom Zoom-Zoom)\nSay what?\n\n[Varied Hook: Dre and (LL Cool J)]\n\nAll I wanna do, is Zoom-a-Zoom Zoom Zoom\n(Mmmm, whatchu wanna do) Uhh, whatchu wanna do?\nAll I wanna do, is Zoom-a-Zoom Zoom Zoom\n\n(Dre, whatchu wanna do?\nMr. Smith, it's on you, uh)\n\n[Verse 3: LL Cool J]\n\nIn other words, it's gon' be like that\nYou young boys is blind, I'm seein them cats\nEvolutionary (what?) Revolutionary and legendary\nI got a climax waiting for each and every cherry\nI'm like a narcotic, niggas is microscopic\nDr. Dre and Cool J, is the topic\nForever, my lyrics is rough and energetic\nThem cats is blazin? I don't get it, they cosmetic\nIf shorty wanna step up? I'll twist his neck up\nYou can't get no money battling me; that's like ripping your\nCheck up\nWhat partna? Take ten paces and turn around\nThat quick, yo' whole ghost town is burnin' down (Woof!)\nWhat I spit, manipulates whole clicks\nMake 'em conversate on how real niggas ride my dick\nIt's like a serum, I just can't hear 'em\nAll them new niggas poppin' new shit, I never fear 'em\n\nAs we proceed\nTo give you what you need\nSatisfaction guaranteed\nBreak it down!\n(Yeah, yeah)\n\n[Chorus: Dre]\n\nI got my mind made up, come on; get in, get into it\nLet it ride, tonight's the night, yeah\nI got my mind made up, come on; get in, get into it\nLet it ride, tonight's the night, yeah\nI got my mind made up, come on; get in, get into it\nLet it ride, tonight's the night, yeah", "image": "https://images.genius.com/a07da7e37a6306d0e29285084f5afb9e.400x400x1.jpg"}], "artist": "Dr. Dre"}