{"songs": [{"title": "What’s Beef?", "album": "Life After Death", "year": "1997-03-25", "lyrics": "[Produced by Carlos \"6 July\" Broady and Nashiem Myrick]\n\n[Intro]\nThe Commission:\nUncle Paulie, P. Diddy, Cease-A-Leo DeGenero (yeahhh)\nCharli Baltimore, Iceberg Slim\nThe most shady, Frankie Baby\nWe here (do you know what beef is?)\nWe ain't goin' nowhere (do you know what beef is?)\nUh-uh (ask yourself, do you know what beef is?)\nUh-uh, uhh\n\n[Verse 1]\nHa ha ha ha ha, check out this bizarre\nRapper style used by me, the B.I.G\nI put my key, you put your key in, money we'll be seein'\nWill reach the fuckin' ceiling, check-check it\nMy Calico been cocked, this rap Alfred Hitchcock\nDrop-top-notch, playa-hatin' gon' stop\nThis instant, rappers too persistent\nQuick to spit Biggie name on shit, make my name taste\nLike ass when you speak it, see me in the street\nYour jewelry? You can keep it, that be our little secret\nSee me, B, that is, I that is, gee-whiz\nMotherfuckers still in my biz\nDon't they know my nigga Gutter fuckin' kidnap kids\nFuck 'em in the ass, throw 'em over the bridge\nThat's how it is, my shit is laid out\nFuck that \"beef\" shit, that shit is played out\nY'all got the gall, all I make is one phone call\nAll y'all disappear by tomorrow\nAll your guns is borrowed, I don't feel sorrow\nActually, your man passed the Gat to me, now check this\n\n[Chorus]\nWhat's beef?\nBeef is when you need two Gats to go to sleep\nBeef is when your moms ain't safe up in the streets\nBeef is when I see you\nGuaranteed to be in ICU, one more time\nWhat's beef?\nBeef is when you make your enemies start your Jeep\nBeef is when you roll no less than 30 deep\nBeef is when I see you\nGuaranteed to be in ICU, check it\n\n[Verse 2]\nI done smoked with the best of 'em (uh-huh)\nShot at the rest of 'em (Uh-huh)\nWas about a hundred or more, maybe less of 'em\nGot my rocks off, that nigga from the Brook just be\nWildin' on you, just be stylin' on you (you so crazy)\nWhen I, tried to warn you but your eyes fucked up\nNow I cleared them shits with hits\nYou on the fuckin' bench (mmm)\nPardon my French but, uh, sometimes I get kind of\nPeeved at these weak MCs (don't stop)\nWith the supreme baller-like lyrics\nI call 'em like I see 'em, G\nY'all niggas sound like me (yeah)\nY'all was grimy in the early 90s, far behind me\nIt ain't hard to find me\nNumber one with the Bui Ya Kah (Bui Ya Kah)\nGive me the Remy and the chronic, ain't no tellin' what I do to ya\nIt's obvious the game's new to ya (New to ya)\nTake them ends you make (Ehehe)\nAnd spend 'em on a tutor, hah, one shot, I'm through with ya\n\n[Chorus]\nWhat's beef?\nBeef is when you need two Gats to go to sleep (Don't sleep)\nBeef is when your moms ain't safe up in the streets (Ain't safe)\nBeef is when I see you\nGuaranteed to be in ICU (I see you), one more time\nWhat's beef? (What's beef)\nBeef is when you make your enemies start your Jeep (Start my Jeep)\nBeef is when you roll no less than 30 deep (30 deep)\nBeef is when I see you\nGuaranteed to be in ICU, check it (I see you)\n\n[Verse 3]\nThere'll be nothin' but smooth sailin' (sailin')\nWhen I spit shots, now your crew's bailin' (bailin')\nAll I got is heat and tough talk for you (uh-huh)\nTie you up, cut your balls off just to use (oooh)\nMan, listen, straight torture\nLook what that slick shit bought ya\nA first class ticket to Lucifer, real name Christopher\nWatch me Set It Off like Vivica\nHere lies your demise, close your eyes (uh-huh)\nThink good thoughts, die while your skin start to glisten\nPale blue hands get cold: your soul's risen\nIt's bad cause I just begun\nWhat make the shit real bad, I was havin' fun (ahaha!)\n\n[Chorus]\nWhat's beef? (What's beef?)\nBeef is when you need two Gats to go to sleep (Don't sleep)\nBeef is when your moms ain't safe up in the streets (Ain't safe) Beef is when I see you\nGuaranteed to be in ICU, one more time (I see you)\nWhat's beef? (What's beef?)\nBeef is when you make your enemies start your Jeep (Start my Jeep)\nBeef is when you roll no less than 30 deep (30 deep)\nBeef is when I see you (I see you)\nGuaranteed to be in ICU, and I'm through\n\n[Outro]\n(Yeah, and I'm through)\nUhhh, uhhh\nThe life after\n(Now ask yourself, do you really, know what beef is?)\nLife after\n(Then ask yourself)\nUhh (Do you really, want beef?)\nLife after...\n(Ahahaha! Yeah, I like that)\n(Big Nash, Hitmen baby, on and on and on and on)\n(Bad Boy)\n(Y'all know what it is)\n(Shit, I don't want no beef, ahaaa!)", "image": "https://images.genius.com/f4413efc6682e8c2cfa7a01117fc8cd5.1000x1000x1.jpg"}], "artist": "The Notorious B.I.G."}