{"songs": [{"title": "Maybach Music II", "album": "Deeper Than Rap", "year": "2009-05-19", "lyrics": "[Chorus: T-Pain]\nHey! Realest shit I ever wrote, chillin' in my Maybach\nWhatever I send out homie I'ma make back\nCan you believe that? Whoa-ooh-ooh\nYou gotta see it (hey)\n'Cause I don't plan on goin' broke, put that on my Maybach\n'Cause I'm in it to win now, niggas can't take that\nListen to my Maybach music\nTo my Maybach music\n\n[Verse 1: Kanye West]\nMartin, Louie the King Jr\nStartin' all that stuntin' is gon' ruin you\nIf B.I. was alive, he'd prob'ly have the 2-tone\nWith the Grey Poupon, anythin' 'Ye poop on\nWill explode cause I am the shit and this is my commode\nUh-oh, there they go\nTalkin' 'bout how your boy's clothes extra tight\nI just remembered that my limelight extra bright\nI hit the strip club and girls get extra hype\nYou hit the strip club and girls turn extra dyke\nWe know who not gettin' no sex tonight\nAnd a lap dance'll probably be a blessin', right?\nSo all the shit you talkin' dead, coffin\nLight the weed, coughin', new crib, loft in\nWhere it's at? Austin, where is that? Texas\nWhat's in front? Benzes, what else? Lexus\nWell who's Maybach is this? Mr. West's\n\n[Chorus: T-Pain]\nHey! Realest shit I ever wrote, chillin' in my Maybach\nWhatever I send out, homie I'ma make back\nCan you believe that? Whoa-ooh-ooh\nYou gotta see it (hey)\n'Cause I don't plan on goin' broke, put that on my Maybach\n'Cause I'm in it to win now, niggas can't take that\nListen to my Maybach music\nTo my Maybach music\n\n[Verse 2: Rick Ross]\nBoss!\nKush burn like petroleum, crib needs custodians\nShades in all shades, these made of rhodium\nUsed to be the Oldsmo, hoes call it oh-lo\nNow I got so many horses, bitches call me Polo\n57, 62, tell me how you wanna move\nYeah, you know I got them both, beat your ass black and blue\nI was barely gettin' pretty women\nNow I scoop Emmy winners like kitty litter\nAny winter, Fendi denim like a slender nigga\nLookin' in the mirror, I can see the real contender\nCelery for Eben Gregory, I'm on my dinner\nSo what the fuck is ya tellin' me other than your gender?\nI'm a boss and I'm ridin' like a small Vogue\nNiggas make your wheels and ride 'em 'til they fall off\nYeah, Ross!\n\n[Chorus: T-Pain]\nHey! Realest shit I ever wrote, chillin' in my Maybach\nWhatever I send out, homie I'ma make back\nCan you believe that? Whoa-ooh-ooh\nYou gotta see it (hey)\n'Cause I don't plan on goin' broke, put that on my Maybach\n'Cause I'm in it to win now, niggas can't take that\nListen to my Maybach music\nTo my Maybach music\n\n[Verse 3: Lil Wayne]\nWell alright, heheh!\nAll black Maybach, I'm sittin' in the asshole\nClassy as a mother, still gutter like a bad bowl\nBenjamin Franklin on X how that cash roll\nThat's right, the mills do like damp clothes\nI eat your meal too, we don't feel you\nAnd we be strappin' up like the Navy Seal do\nSweet as banana split everytime I peel through\nFresher than Will Smith and Uncle Phil too\nWatchin' TV in the Maybach in traffic\nI'm on my feet like Tough Actin' Tinactin\nI'm runnin' this shit, you should try tacklin'\nLil Wayne in one word, immaculate\nYou see the BIG, you see the Jay, the 2Pac in him\nThe Kurt Cobain, the Andre Three Stacks\nAnd then I'm back to doin' shit like I do's in Maybach music\nYeah, Young Mula baby! Oww!\n\n[Chorus: T-Pain]\nHey! Realest shit I ever wrote, chillin' in my Maybach\nWhatever I send out, homie I'ma make back\nCan you believe that? Whoa-ooh-ooh\nYou gotta see it (hey)\n'Cause I don't plan on goin' broke, put that on my Maybach\n'Cause I'm in it to win now, niggas can't take that\nListen to my Maybach music\nTo my Maybach music", "image": "https://images.genius.com/78f87f596103b6fbd0d1c2f8dad653c4.1000x1000x1.jpg"}], "artist": "Rick Ross"}