{"songs": [{"title": "I Feel Good", "album": "Free Weezy Album", "year": "2015-07-04", "lyrics": "[Intro]\nTunechi\nBaby\n(Hey!)\n\n[Verse 1]\nUh, Lord I think I'm ballin' too hard\nAnd my girlfriend think she too much\nAll she do is get pretty, I get shitfaced\nDon't we make a cute couple?\nTo a broke heart we look like 2 bucks\nI got a posse full of hitters\nAnd a pocket full of \"In God We Trust\"\nIt's been so long since I said \"It cost too much\"\nI'm so addicted to the fast money lifestyle\nAnd withdrawal sucks\nAnd dead presidents act immortal\nBut I know you see money's not a problem\nBal' like a butch bitch\nLet's go on a shopping spree, take that shit to Goodwill\nMoney in a shoebox, what's up with all these shoeboxes?\nBaby, I'm my own boss, \"Dwayne, you gon' get you fired!\"\n\n[Hook]\nBut I feel good, woo\nI knew that I would, yeah\nI feel good, yeah\nI'm smoking that good, yeah\nI feel good, yeah\nMy girl got that good, yeah\nGirl your pussy so good\nAnd these hoes is no good\nBut I got you, yeah\nGirl your pussy so good (so good)\nAnd these hoes is no good (no good)\nBut I got you, yeah\nI got you, wooo\n\n[Verse 2]\nWoo, Tunechi, baby, yeah\nThey say \"Boy put some money aside\"\nDon't tell me what to do with mine\nAll my kids already rich, and they kids, and they kids...\nThey think money grow on trees\nAnd as tall as they grew, I climbed\nKnock-knock \"Who's there?\" Hah!\nI told the bitch \"It's just money\"\nThe road can get a lil bumpy\nSo, on the low, I got that blow\nAnd ya nose gon' feel like a trumpet\nI'm goin home to my lil mama, she call me Big Poppa\nShe get hard dick and McDonald's\nCause she so tired of them Whoppers\nI fuck her good, so proper, she say my name in Opera\nI turn into a Piranha, then eat it like Tilapia\nShe know I'm going through a lot\nSo she say my name in Gospel\nNo weapon formed against Weezy shall prosper\n\n[Hook]\nAnd I feel good, yeah\nI knew that I would, yeah\nAnd I'm still hood, yeah\nShoutout to my hood\nI was sick of stuntin'  but I feel cured\nLeave yo ass in the woods, yeah\nAnd these hoes is no good, no good\nBut I got a few, yeah\nThese hoes is no good (no good)\nThese hoes is no good (no good)\nBut, fuck it, I got you, ah\nFuck 'em I got you, ah\n\n[Outro]\nAnd I feel good\nTunechi, baby (Hey!)\nI feel good, yeah\nWoo! Like diamonds on wood\nWoo, mmm, ow! yeah\nI feel good, yeah\nMy girl got that good, yeah\nGirl, your pussy so good\nAnd these hoes is no good\nBut I got you, yeah\n(Woaw!)", "image": "https://images.genius.com/22c3b68c0f49bb742b34148131ca933d.1000x1000x1.jpg"}], "artist": "Lil Wayne"}