{"songs": [{"title": "Tim Westwood TV Freestyle 2013", "album": null, "year": "2013-01-17", "lyrics": "Instru 1\n\nBout to shut down the future festival\nAnd my future see a lot of decimals\nShow you coward suckers what the tech'll do\nLeave 'em stiff, leave them frozen like a vegetable\nWestwood whats really good in the hood my dude?\nAnd I've got the drop top you see me driving through\nI get them chopped and screwed I got the livest crew\nI'm doin numbers every summer man I got to do\nPots and pans when I do my dance see my pants they come from France\nBitches wanna go on dates, if they broke they ain't got no chance\nTell her I need Goyard bags, tell her I got all that swag\nIf you wanna date me, bitch, better take me\nTo Chow's or Phillipe's, bitch you seen my peops\nA-S-A-P bitch we deep up in these streets\nPretty nigga gold teeth and I roll too deep\nIf you want it with my niggas with the reaper you will meet\nHuh, sleep up in that dirt nigga, leave 'em in the hearse\nPretty nigga long shirts they say we wearin skirts\n50 for a verse I tell you it might hurt if a nigga on my turf\nTalkin records gettin murked\nAnd I swear im in the charger, fuck that we in the Lam\nCrazy ass nigga somethin' like the son of sam\nGoddamn I'm the man in my kicks from Japan\nBrother man fifth low, and I do the disco\n\nOh\nUnderstand me (2x)\n\nWe bout to won the grammy\nNext year cause my shit came too early\nI’m the jiggy young nigga bitch you heard me\n\nUnderstand me (2x)\n\nLong live A$AP is winnin' Grammys\n'bout ten a those, 'bout ten a those\nAnd my bad bitches always be in centerfold\nRocky where you been? I been thuggin' lately\nFuck that shit these niggas watchin' jockin' and they buggin' lately\nTalkin' bout I’m switch hittin', talkin' 'bout I'm mainstream\nYou should just be happy a young nigga who made green\nMade dreams come true though and I’m high on Pluto\nAnd I got a foreign car it only came with like two doors\nAnd got niggas dead broke career kudos\nI don’t give a fuck but this shit right here my new flow\nMy old flow you stole that, old shit that’s throwback\nFuck that I got the white cap on black hoodie and a skull cap in\nBitches know better fall back, ball bat to your head\nCrack that leave you dead heard what I said\nThen i’m all ah scraps and my lips is looking chapped\nCause I ain’t got chapstick to put it on my huh\nTell your fucking girl suck up on my knob\nCause I’m a A$AP nigga ridin' with the mob in the suave\n\nAye Westwood what's good?\nYou got somethin' else for me?\nThis is off the top, Whatever you got\nJiggy cause I'm pretty boy\nJiggy cause I'm pretty\n\nLil' Keke got free free bose but you know I scroll it\nFuck that shit we got this weed up and you can't be rollin'\nSee my piff game niggas holdin' it down in London town\nWhen I come around got to hold that crown, four pound I shut 'em down\nHarlem nigga never stutter word to my mother\nAnd you rich bout to keep it gutter in a butter never butter\nNever stutter never nervous\nRunnin' from the cops, drunk as fuck and I'm swervin'\nAnd I got a permit, I ain't got no license\nAnd I wrap the game tight, you can call it vice grips\nAnd you know your biceps get hit with that tech if you talk\nRespect it you better respect, Protect Ya Neck that Wu-Tang shit\nNiggas gettin' throwed for the twenty thirteen on the scene\nA$AP ya' mean getting green, green, green, green\nGettin green green\nGot five for these verses, purple like his shirt is\nA$AP up in London town, gotta tell 'em where my turf is\nOther rappers is worthless, leave them all in hearses\nAnd I got like 4 long shirt thieves they ain't no shirtses\nNo curses, fuck that, back on the trap when I spit\nFuck that they can go back on my dick when I come with this classic shit\nCause they bitin' but ain't nobody excited when I write it\nSo it's off the top if you know the hype is still the heighted\nThe climate, they climbin', My teeth ain't got no diamonds\nI'm rhymin', I'm shinin', Fuck that shit this is blindin'\nAnd you know we just grindin' until we eatin'\nAnd Rocky is the best it ain't no mother fuckin' secret\nWestwood, Westwood what's good? Freestylin' off the top of the dome baby\nA$AP, Long Live A$AP in stores, Go get it today baby\nA$AP Harlem World nigga\n\nHey Westwood, what you want me to spit about? Say anything\n\n[Westwood] Yo, Being A$AP Rocky kid\n\nRocky kid, and you know I'm that cocky kid\nFuck that made history just look back at what Rocky did\nIn one year alone, no protege, you better hate\nCan't relate, Fuck that these wack niggas they led astray\nPaper chasin' and chasin' paper, fuck that these niggas haters\nGot the lasers, they got tasers. We the greatest, we the Lakers\nWe the Knicks, get off our dicks, these bitches tick tick-tock on the clock\nOn the dot, when I'm on my shit won't stop until the fuckin' cops come knockin'\nWhat's poppin'? What's happening? Turn down this music?\nWhat you mean nigga? I gotta be a legendary influence\nIn my mother fuckin' culture, my mother fuckin' era\nAnd you should just admit it can't nobody do it better\nGotta Hood by Air sweater, this shit is M3\nAnd I'm in a M3 till my nigga Benji's we throwin'\nWe ballin, it's snowin', we glowin', it's rainin'\nWe came in, we changes, it's ours for the takin'\nWe makin' Jamaican bitches shake it, what's happenin' make it\nBecause we money makin', Manhattan ain't no shit takin'\nMistakin' you crazy, you flakin' I mean they wanna say what they be sayin'\nIlluminati all he sayin' oh that gay shit that they say\nShit I can't be with these mother fuckers talkin' crazy about us\nNigga better bring the ruckus. Niggas know I'm west coast\nAnd I got them chuckers and I bring it up town, up to Harlem mother fuckers\nWassup? Yeah yeah A$AP nigga\n\nOff the top. Next time we gotta do this for a hour straight\nBlow down, I gotta bring the Mob out here, A$AP Mob out here one time\nWestwood, A$AP\n\n[Westwood] Crazy, crazy man", "image": "https://images.genius.com/84260afdfa02f8cba4117c80ac6c847b.1000x1000x1.jpg"}], "artist": "A$AP Rocky"}