{"songs": [{"title": "I Wanna Rock (DJ Green Lantern Interstate Trafficking Remix) 12\"", "album": null, "year": null, "lyrics": "[Intro: DJ Green Lantern]\nRight about now!!! You are about to be possessed!!!!\nBy the sounds of Snoop Dogg!!!! And DJ Green Lantern!!!!\n\n[Hook: Roscoe Dash Rick Ross]\n(Let Go) I Wanna Rock, Rock, Rock\nI Wanna Rock, Rock, Rock (Ah, Ah, Let Go)\nI Wanna Rock, Rock, Rock (Ah, Ah, Let Go)\nI Wanna Rock, Rock, Rock (Ah, Ah, Let Go)\nI Wanna Rock, Rock, Rock (Ohhhh! Come on, Come on, Come on, Let Go)\nI Wanna Rock, Rock, Rock\nI Wanna Rock, Rock, Rock (Ah, Ah, Let Go)\nI Wanna Rock, Rock, Rock (Ah, Ah, Let Go) Teflon don\nI Wanna Rock, Rock, Rock (Ah, Ah, Let Go)\nI Wanna Rock, Rock, Rock (Ohhhh! Come on, Come on, Come on, Let Go) Snoop what it do\n\n[Verse 1: Rick Ross]\n(*Maybach music!!!) Let's go!!! BOSS!!!!\nBitch I think I'm Scarface!!! Bitch I think I'm Nino!!!\nBitch I think I'm Pablo!!!! Put that on this kilo!!!!\nPut that on this remix, bracelet cost me three bricks\nSquash that shit with Mayweather, I call that real G shit\nBitch my life a gamble, Lucky Luciano!!!!\nWhen I die, nigga ride, don't burn no fuckin candles (UHHHHHHH!!!!)\nBitch I think I'm Spielberg!!!! I just made a movie!!!\nTime to pop my chill pill, with my spanish two piece\n(ROSS!!!!!!!!!) Ricky Ross!!!!!!!!!!!\n\n[Verse Two: Snoop Dogg]\nBIG SNOOP DOGG!!! I like steak and eggs I like Mike & Ike's\nI like breakin hoes I like breakin dykes\nI like doin my thang like every night\nTonight's the night like Betty Wright and that's right\nI came to get ya up off the wall, we 'gon rock, we 'gon ball\nBig Snoop D-O-G I got pills, thrills, whatever you need\nJust name it AIM it AOL, strip clubs A-T-L\nPimp game, never fail, in the ocean, I'm the whale\nNBA to the NFL they all waitin to inhale\n\n[Hook: Roscoe Dash]\n(Let Go) I Wanna Rock, Rock, Rock\nI Wanna Rock, Rock, Rock (Ah, Ah, Let Go)\nI Wanna Rock, Rock, Rock (Ah, Ah, Let Go)\nI Wanna Rock, Rock, Rock (Ah, Ah, Let Go)\nI Wanna Rock, Rock, Rock (Ohhhh! Come on, Come on, Come on, Let Go)\n(Let Go) I Wanna Rock, Rock, Rock\nI Wanna Rock, Rock, Rock (Ah, Ah, Let Go)\nI Wanna Rock, Rock, Rock (Ah, Ah, Let Go)\nI Wanna Rock, Rock, Rock (Ah, Ah, Let Go)\nI Wanna Rock, Rock, Rock (Ohhhh! Come on, Come on, Come on, Let Go)\n\n[Verse 3: Yo Gotti]\n(I'm goooooooooooone...)\nRemix -- G shit\nBigg Snoop Dogg, g-gan-gan-gangsta shit\n(YO GOTTI!!) What's haps? Smoke chronic and ride switches\nI'm from a small town, they label us Nort' Memphis\nIn the club, I'm like a rock band, I be goin insane\n(Totally duuuuuuuuuude!!!!)\nGot it Osbourne, nigga I be off the chi-dain (off the chi-dain!)\n+Black Sabbath+ -- white monies\nGreen Tuesdees, let's count the money\nClub jumpin, (I'm here!) What's hap'n?!\nBaking Soda Gotti, Mr. DJ Green Lantern\nCall me Mr. Lamborghini Drop, swag on the arena top\nI'm 'bout to blow the woofers out, I need to turn it down a notch\n\n[Hook: Roscoe Dash Yo Gotti Maino]\nI Wanna Rock, Rock, Rock (Ah, Ah, Let Go) I'm Yo Gotti\nI Wanna Rock, Rock, Rock (Ah, Ah, Let Go)  Uh-ha!\nI Wanna Rock, Rock, Rock (Ah, Ah, Let Go)\nI Wanna Rock, Rock, Rock (Ohhhh! Come on, Come on, Come on, Let Go)\nI Wanna Rock, Rock, Rock (Ah, Ah, Let Go)\nI Wanna Rock, Rock, Rock (Ah, Ah, Let Go)\nI Wanna Rock, Rock, Rock (Ah, Ah, Let Go)  Yeah! Unstoppable! Whaddup Snoop!\nI Wanna Rock, Rock, Rock (Ohhhh! Come on, Come on, Come on, Let Go) Welcome to Brooklyn\n\n[Verse 4: Maino]\nYeah truthfully I gave them a reason for them to fear me now\nLife is like chess so my next move is for the crown\nLook at how they tremble now they know that I ain't actin it\nFans wanna touch the same hand I smack rappers with\nI ain't on that rapper shit, mami I'm the realest yo\nDifferent city different day, different telly different ho\nDon't make me act a fooly, leave me with all these groupies\nRollin in the Coupe, I'm chillin just me and Snoopy\nLord please forgive me for wild livin these wild women\nBottles keep on comin I'm now winnin my style different\nThis is for the G's the homeys that's out there livin that\nGreen Lantern tell 'em it's true I brought Brooklyn back\n\n[Hook: Roscoe Dash Maino OJ Da Juiceman]\nI Wanna Rock, Rock, Rock (Ah, Ah, Let Go)  Maino!\nI Wanna Rock, Rock, Rock (Ah, Ah, Let Go)\nI Wanna Rock, Rock, Rock (Ah, Ah, Let Go)\nI Wanna Rock, Rock, Rock (Ohhhh! Come on, Come on, Come on, Let Go) Ay, Ay, Ay, Damn\nI Wanna Rock, Rock, Rock (Ah, Ah, Let Go) Ay, Ay, Ay, Young Juice\nI Wanna Rock, Rock, Rock (Ah, Ah, Let Go) Ay, Ay, Ay, Okay\nI Wanna Rock, Rock, Rock (Ah, Ah, Let Go) Ay, Ay, Ay, Damn\n(Let Go) I Wanna Rock, Rock, Rock (Ohhhh! Come on, Come on, Come on) Young G...\n\n[Verse 5: OJ Da Juiceman]\n{*\"Ays\" and \"okays\" heard in the background, of course*}\nIt's the king of the rock, and I mean the shit literally\nTrap 'til we thru, man trappin in my history\nCatch me in the kitchen and Young Juicey doin chemistry\nI SKERT! with my right when my left reaches this track or beat\nGOMAD dog and my trap look like a spelling bee\nGreen Lantern and the Juiceman high just like the tractor be\nAnd I be su' one hundred just like the letter G\nSnoop Dogg, good look, that's the big whole me\nSo I do it B.I.G., everytime in Long Beach\nNYC, what it do? You know dat I rock witchu\nAnd everytime that I'm on stage, I be rockin Muari shoes\nGangsta as a muthafucka, I just say that I'm a BOOOOOOOO~!\n\n[Hook: Roscoe Dash OJ Da Juiceman]\nI Wanna Rock, Rock, Rock (Ah, Ah, Let Go)  Ay, Ay, Ay, Damn\nI Wanna Rock, Rock, Rock (Ah, Ah, Let Go) Ay, Ay, Ay, Young Juice\nI Wanna Rock, Rock, Rock (Ah, Ah, Let Go) Ay, Ay, Ay, Okay\nI Wanna Rock, Rock, Rock (Ohhhh! Come on, Come on, Come on, Let Go) Ay, Ay, Ay, Damn\nI Wanna Rock, Rock, Rock (Ah, Ah, Let Go) Ay, Ay, Ay, Damn\nI Wanna Rock, Rock, Rock (Ah, Ah, Let Go) Ay, Ay, Ay, Young Juice\nI Wanna Rock, Rock, Rock (Ah, Ah, Let Go) Ay, Ay, Ay, Okay\nI Wanna Rock, Rock, Rock (Ohhhh! Come on, Come on, Come on, Let Go) Ay, Ay, Ay, Damn", "image": "https://images.genius.com/8c99dd335733f9c3cf16f57c9f589cfb.361x361x1.jpg"}], "artist": "Snoop Dogg"}