{"songs": [{"title": "Sellin Dreams", "album": "Detroit", "year": "2012-09-06", "lyrics": "[Verse 1: Big Sean]\nWelcome to Hell's paradise\nI always heard life was a pair of dice\nSeven, 11, or a pair of eyes\nAs I'm looking at her smearing eyes\nShe yelling, \"Take them glasses off, yo eyes are the only things that's not lying\"\nNot caring to the point that I stopped lying\nI tell her I feel the same\nShe tell me, \"Nigga, quit playing, you the only one that's not crying\"\nYou said you wasn't on no steal your man shit\nIf I broke it off now we won't be on some friend shit\nMan, what goes around comes around, that ceiling fan shit\nI broke the levy to your eyes that I don't give a damn, shit\n\n[Chorus: Chris Brown]\nAnd time after time, it's the same old shit\nThink it might be too late, for me to learn from my mistakes\nAnd I know that it hurts, I know that it hurts you\nBut you should have used your head first\nThis might be the biggest mistake, it's too late\n'Cause two can't be in first place\n\n[Verse 2: Big Sean]\nWell, wake up then, shit, call your ex and make up then\nWhat was no strings attached got tangled when\nFun stopped being fun, and feelings tried to finagle in\nWe had that independent love, you tried to bring a label in\nGirlfriend? Nah, I already got one\nYou need a good guy and I'm already not one\nShe said, \"We lost a kid already, I'm already not that young\nMy biological clock is ticking, I'm not just tryna have fun\"\nShit's way different from us first chilling\nSometimes last words can have the worst ending\nWish we could fast forward time and reverse feelings\nIs there a warranty for love to return or fix it? (Hmm)\nShe said you good either way\nWhen it was her last night, nigga, and me today\nYou the man, huh? Getting all the TNA\nYou fucking her raw too, sharing our DNA?\nHuh, and so on and so on (Hmm)\nAnd the shit just always goes on\nNothing about us feeling right\nBut she'll be back before the end of the night, saying\n\n[Chorus: Chris Brown]\nOh, and time after time, it's the same old shit (Same old shit, yeah)\nThink it might be too late (Oh, no), for me to learn from my mistakes\nAnd I know that it hurts, I know that it hurts you\nBut you should have used your head first\nThis might be the biggest mistake, it's too late\n'Cause two can't be in first place\n\n[Outro: Chris Brown]\nI love, I love her", "image": "https://images.genius.com/6b6ac4eb55acf7dda757b1f6c6081c31.500x500x1.jpg"}], "artist": "Big Sean"}