{"songs": [{"title": "We Be Steady Mobbin’", "album": "We Are Young Money", "year": "2009-06-11", "lyrics": "[Produced by Kane Beatz]\n\n[Verse 1: Lil Wayne]\nMan, fuck these niggas!\nI'ma spare everything but these niggas\nI flip the gun and gun-butt these niggas\nTake the knife off the AK and cut these niggas\nYeah, and fuck these bitches\nI swear I care about everything but these bitches\nI don’t care, I \"so what\" these bitches\nAnd I put Young Mula, baby, way above these bitches\nIf it ain’t broke, don’t break it\nAnd if he ain’t shook, I’m gon' shake him\nHope I don’t look weak, cause when a wolf cry wolf\nYou still see that wolf's teeth, mothafucka\nFuturistic handgun\nIf you act foul, you get two shots and one\nI'm at your face like Lancôme\nYou niggas softer than Roseanne's son\nHey, you cannot reach me on my Samsung\nI'm busy fuckin' the world and givin' the universe my damn tongue\nCrazy motherfucker, I am one\nBut the crazy thing is, I began one\nAll white bricks\nI’m straight like it’s jumping back to 36, nigga\nBig house, long hallways\nGot 10 bathrooms, I could shit all day, nigga\n\n[Chorus: Lil Wayne]\nAnd we don’t want no problems\nOkay, you’re a goon, what's a goon to a goblin?\nYeah, and Kane on the beat\nI fuck around and leave a nigga's brains on the street\nUghh, now pop that pussy\nI bring her to my bedroom and pop that pussy\nUh huh, and we be steady mobbin'\nOh Kemosabe, big ballin' is my hobby\n\n[Verse 2: Gucci Mane]\nWhat the fuck is up? It’s Gucci Mane the G\nAsk Tity Boi, no pity boy, this scar city the city boy\nSo icy, so no Nike boy, just Gucci, Louis, Prada, 'scuse me\n\"Gucci Mane keep shittin' on me, why that boy keep buyin' jewelry?\"\nEast Atlanta cockin' hammers, bandannas on car antennas\nNo, we do not talk to strangers, just cut off these niggas' fingers\nGucci’s armed and dangerous, cocaine, codeine and angel dust\nThis AK-47 will hit ya everywhere from the ankle up\nGun same size as Nia Long, clip long as a Pringles can\n4-5 Desert Eagle on me, you’ll think I'm a Eagles fan\nToni Braxton sniper rifle, make you never breathe again\nFuck that nigga, kill that nigga, bring him back, kill him again (Gucci!)\n\n[Verse 3: Lil Wayne]\nYeah, the money is the motive\nFuck with the money, it get ugly as Coyote\nOkay, I’m reloaded, better pull it if you tote it\nI buy a pound, break it down and put it in a stogie\nSwagger so bright, I don’t even need light\nI’m with a model broad, she don’t even eat rice\nBut would you believe that she eat dykes?\nAnd she asked me for a picture, so I gave her 3 strikes\nYeah, I-I’m the man around this motherfucker\nI’m so hot you probably catch a tan around this motherfucker\nThis rap game, I got my hand around this motherfucker\nYeah I said game, but I ain’t playing around this motherfucker\nYeah, I’m the best to ever do it, bitch\nAnd you’re the best at never doing shit\nIf you the shit, then I am sewerage\nT-try me and I’ll have your people reading eulogies\nI swear you can’t fuck with me\nBut I can fuck your girl and make her nut for me\nThen slut for me, then kill for me, then steal for me\nAnd of course it’ll be your cash\nThen I'll murder that bitch and send her body back to your ass\n\n[Chorus: Lil Wayne]\nAnd we don’t want no problems\nOkay, you’re a goon, what's a goon to a goblin?\nYeah, and Kane on the beat\nI fuck around and leave a nigga's brains on the street\nUghh, now pop that pussy\nI bring her to my bedroom and pop that pussy\nUh huh, and we be steady mobbin'\nOh Kemosabe, big ballin' is my hobby\n\n[Verse 4: Lil Wayne]\nUh, man suck my clip\nSwallow my bullets, and don’t you spit\nUhh! I am the hip-hop socialist\nLife is a gamble and I’m all about my poker chips\nDo you want a dose of this? I will make the most of this\n'F' is for ferocious, murder your associates\nThe top is so appropriate, this is just where I belong\nKeep a hard dick for your girlfriend to wobble on, Weezy!\n\n[Chorus: Lil Wayne]\nAnd we don’t want no problems\nOkay, you’re a goon, what's a goon to a goblin?\nYeah, and Kane on the beat\nI fuck around and leave a nigga's brains on the street\nUghh, now pop that pussy\nI bring her to my bedroom and pop that pussy\nUh huh, and we be steady mobbin'\nOh Kemosabe, big ballin' is my hobby", "image": "https://images.genius.com/5f41ff0fcf98a0c2b7f7239f3cc7e4a1.1000x1000x1.jpg"}], "artist": "Lil Wayne"}