{"songs": [{"title": "Pigions", "album": "EARL", "year": "2010-03-31", "lyrics": "[Verse 1: Earl Sweatshirt]\nWelcome back to class, bitch, grab on to your glasses\nOdd Future leaving even niggas in past tense\nStyle is patent, the measures is drastic\nEither that or they 4:4, some call them fantastic\nShe called me fantastic, I called her a fat bitch\nStill kill the pussy, put the cat in a casket\nThe funeral service was fucking worthless, so I said a couple words at it\nDidn't know her but I'm confirming that she sure gurgled dick\nThe Odd nigga with a spoon in your Danimals\nAs hungry as a cannibal, trapped in a van of cantaloupes\nHarder than granite, hoes know I'm coming\nWith the grand force of Van Damme's fist in a damn cannon, so\nFans catch us on Animal Planet, tracking hoes\nAnd attacking faster than foes can change the channel, whoa\nMy dick hates sweaters so she jack it slow\nThe aftermath proves to be smoother than hair relaxer, no\n\n[Hook: Tyler, The Creator & Earl Sweatshirt]\nWave high to the Ritalin regiment\nDouble S shit, swastikas on the Letterman, bitch\nHungry wolves at the door, bitch, let us in\nKill 'em all, O.F. is what I represent\nSay hi to the Ritalin regiment\nDouble S shit, swastikas on the Letterman, bitch\nHungry wolves at the door, bitch, let us in\nKill 'em all, O.F. is what I represent\n\n[Verse 2: Earl Sweatshirt]\nTook the van, went snatch her\nOh, you wanna snap and scratch? Snap your fucking jabber\nWocky, she's a dancer, walkie-talkie Ace for back up\nLike, \"Fag, I got class and can't take this bitch to math, what\nTell the fucking teacher that this burlap sack is filled\nWith snacks for after class for the whole class to snack up?\nYeah, right, get over here faster\nCause Earl's a pro rapper but amateur kidnapper\"\n\n[Verse 3: Tyler, The Creator]\nEarl, goddammit, I'm still in my damn pajamas\nWaiting on mom to bring me the Aspirin from a trampoline jump\nAnd if I pick her up, I'm humping and I'm fucking with no lubricant\nI'm using spit, piss, vaseline or something, how old is she?\n(Seventeen) This bitch is underage\nBut I'll have her face off tied and Nicholas caged\nBut anyway, give me cash fag, cause I'm low on gas\nAww fuck it, about to jack off, go catch a fucking cab\nNo I'm not lying when I say that brother's all I have\nBut if you're not dying don't fucking bother to call me back\nI'm sleep... [sound of Tyler masturbating]\n\n[Hook: Earl Sweatshirt]\nSay hi to the Ritalin regiment\nDouble S shit, swastikas on the Letterman, bitch\nHungry wolves at the door, bitch, let us in\nKill 'em all, O.F. is what I represent\n\n[Bridge: Tyler, The Creator]\nKill people, burn shit, fuck school\nOdd Future here to steer you to what the fuck's cool\nFuck rules, skate life, rape, write, repeat twice\nOdd Future young enough to get your priest mouth drool\nKill people, burn shit, fuck school\nOdd Future here to steer you to what the fuck's cool\nFuck rules, skate life, rape, write, repeat twice\nOdd Future young enough to get your priest mouth drool\n\n[Verse 4: Earl Sweatshirt]\nI don't give a fuck, like a senior citizen\nShit and run back to the lab, need assistance from\nSister with the biggest bumbaclot girls\nI'm around calves big cause they run a lot and scream, oh\nPay him some attention, he's smart and he's genius\nHe ain't touching me like Martin Sheen's penis\nY'all niggas ain't clean as my team is mean as\nHitting amputees in the knees, Jesus\nPlease, just peep the Crystal Method where\nI take a fucking beat, strip it naked then I wreck it\nIt's no question, Sweatshirt's OF\nAnd you can tell by the chiseled horns on my forehead bitch\nHammer-hat flyer than a bag of bats\nAnd Jade's a fucking acrobat, I'll flip her on a mattress\nLast straw, fuck that, I'm who broke the camel's back\nSay you want that dope shit, welcome to Satan's cabbage patch, bitch\n\n[Outro: Tyler, The Creator]\nTold you he can rap, dumb mothafucka", "image": "https://images.genius.com/686e994c9078e4edf012d684e6850747.500x500x1.jpg"}], "artist": "Earl Sweatshirt"}