{"songs": [{"title": "Orange Pineapple Juice", "album": "Resurrection", "year": "1994-10-25", "lyrics": "Hand me a little bit of umm, orange pineapple juice\nI'mma sip on it, check it out\n\nI got a rhyme, you got a rhyme\nBut my rhyme is better than yours\n(repeat 2X)\n\nU-A-C, they get they P's and\nNo I.D., be gettin his P's and\nThe Late Show, they get they P's and\nProfessaNots, they get they P's and\n\nPeep the maneuver, how bout the Heim-lich\nI rhyme sick and you can get the duck, coon\nI'm the shit, you're shit out of luck, tough\nI'm the act to follow, housing kids like Ronald\nMac like Donald Goines, flows I change like coins\nChoyoyoyyoyoyyng, choyoyoyyyyng, choyoyoyoyyyyyng\nI draw a crowd like blood with the 'pint of' technique\nAnd everybody there be like, \"YEAH!\"\nCause cain't near a nig dat'll say 'Whoomp, There It Is'\nI'm like a mom on section 8, over-bearing kids\nShit they be like, \"Com-mon!\" That's my muhfucka (true)\nYouse a hamburger, I'mma Fuddrucker\nAskin me to let us catch up, knowin you can't cut the mustard\nSo where's the beef, jerky?\nI'm as Worthy as James, not that good with names\nBut I do remember your face from someplace this is one taste\nOf Chicago, we got mo' many mo' many mo' many mo' flavors\nDon't just come to me, go ask thy neighbor-I'm-a-hood takin niggas under\nOn the tundra, cause \"they're plain, they're plain\"\nI'm on a plateau that is fat so\nIt's just a fan-tasy, for the fans to see\nHow I land, I'm grand like a finale\nI'm goin back to Cali (why?) cause Cali got bitches check it\nAiyyo Doc this is a sickness\n\nDee-da-da-da-doo-doo, dee-da-da, ah-eh-da-da\nDee-da-da-da-DOO-doo, dee-da-da, dee-da-da\nSouth Side, rock on and\nThe West Side, we gotta rock on and\nHey yo Chicago, we gotta rock on and\nThe East coast, you gotta rock on and\nThe West coast, you gotta rock on and\nAh down South, you gotta rock on and\nCheck it... \"Now you can go!\"\n\nMister Pussy Emcee, just get on gone\nGet on gone, you pussy MC!\nSteppin to me, with them dirty feets you'll get defeated\nLike Kunta Kinte, I'm kin to the Lynn crew\nMy great, great, grandpap done been through\nSo much it's in my hemoglobin to be a ill nigga\nSo I figure like a father... that I'mma Turn This Mutha Out\nBut Common you ain't hittin in New York\nI don't know what you thought hops, but chief I got tall props\nSome cats think I'm six feet I'm so deep\nSome stunts be thinkin I'm six-fo', my shit be hittin like switches\nBitches, ask, why my, britches, sag\nI ask the bitches, \"Why your titties saggin?\"\nPut your nipple to the bottle I bust rhymes like breastses\nI can get down, d-d-d-down like pessimist\n\"Ring the Alarm\", I got Charm like a neck-a-lace\nTell the truth, tell the truth, y'all had to move your neck to this\nDidn't you, didn't you... and it, and it, and it\nAnd it don't stop, bust it\n\n\"Gotta crew ya better tell em\" --> Keith Murray", "image": "https://images.genius.com/8cc4e9a4a27cf48a434a2d5800999430.500x500x1.jpg"}], "artist": "Common"}