{"songs": [{"title": "Fright Night (Whatcha Gonna Do) OG", "album": null, "year": null, "lyrics": "[Verse 1: 2Pac]\nAnd uh, I started out dumb, sprung of a hood rat\nListening to the radio, wishing that I could rap\nBut nothing changed, I was stuck in the game\n'Cause everybody in the industry was fucking me, man\nListen; I've got a scheme, break away, do my own thing\nDrop some conversation, sit back and let the phone ring\nNiggas ain't wanna see me rise\n97 watch me cut these motherfuckers down to size\nAnd if I catch another case, Lord knows how they hate me\nGot a player in the court room, please don't let 'em frame me\nI've been dealt a lot of bad cards living as a thug\nCount my blessings and throw my stressings in this land with no love\nMaybe they see me rolling, look at all this green I'm holding\nI get this why they envious and get their eyes swollen\nHoping the heavenly father love a hustler\nMeet the hardest nigga on the Earth to ever bust a nut\nMy homies tell me, \"Have a heart\" — fuck their feelings\nI've been trying to make a million since we started, we cold hearted\nNiggas in masks that'll blast at the task force\nEmpty out my clip, time to mash, they asked for it\nMe, Makaveli, I'm a motherfucker\nWe break bread, now we thug brothers\nNiggas talk a lot of non-shit I choose to ignore it\nA war they ain't ready for it\n\n[Chorus]\nNow what'cha gonna do, when my niggas come for you\nNow what'cha gonna do, when my niggas come for you\nTell me now what'cha gonna do, When my niggas\nCome for you?\nNow what'cha gonna do, when my niggas come for you\n\n[Verse 2: 2Pac]\nWatch me clown, give me loving when I'm high\nI'm an outlaw baby, I'll be thugging 'til I die\nIn my drop-top double-R, life as a rap star\nHustle like a crack fiend 'til they catch me\nGo ask somebody to your show\nWatch them niggas out the sight of my night scope\nCooking white dope got my nigga 25-to-life stretched out\nTrying to have all the better things in life\nWell Makaveli — a born leader, 10 millimeter\nChange a nigga's future like a schizophrenic palm reader\nHeed, from out the bible I read\nSee the meek shall inherit the Earth\nAnd the strong will lead\nHittin' weed like it's alright\nI'm in the studio making music all night\nMy enemies cry whenever I rise, they hated 'til the death\nTrying to beat me out my last breath\nWhatcha gonna do?\n\n[Chorus]\nNow what'cha gonna do?, when my niggas come for you\nTell me now what'cha gonna do, When my niggas\nCome for you?\nTell me now what'cha gonna do?, When my niggas\nCome for you?\nWhat'cha gonna do, When my niggas come for you?\n\n[Verse 3: Storm]\nWho's to blame for my mind frames?\nThis poverty does money game\nGot me fiendin' for riches wantin' to kill for a taste of fame\nRecurrin' dreams of illest ears, front page magazines\nLivin' life like a thug queen\nBut instead, I'm having nightmares\nThey call 'em Outlaw premonitions of premeditated missions\nLivin' conditions suspicious, so they got me on they hit-list\nWishin' that I was slip like a wet bitch\nBut it's the timin' nigga\nAnd I've been waiting for years, I put my grind in nigga\nI see you smoking, 'cause I got what you wanna flaunt\nMy every calculated move is a nail through your coffin\nNow what you don't know is I got 16 point holler\nThugged out female war shot-caller\nNow what you gonna do?\nWhere's yo buster ass crew?\nWhen my niggas come for you\n(When we come for ya)\n\n[Chorus]\nNow whatcha gonna do when my niggas come for you?\nNow, nigga now, now whatcha gonna do when my niggas come for you?\nNow whatcha gonna do when my niggas come for you\n(Throw your hands up), now whatcha gonna do when my niggas come for you\n(Whatchu running fo'), now whatcha gonna do when my niggas come for you?\n(Busted), Now whatcha gonna do when my niggas for you?\n(when we come for ya)\nNow whatcha gonna do when my niggas for you\nHahaha\n(When they come for you)\n(When they come for you )\nShhh\nWhen they come for you", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}