{"songs": [{"title": "WKYA (Drop)", "album": "Malpractice", "year": "2001-05-22", "lyrics": "[Radio announcer]\nThis is DJ Sayyyy WHAT?! on this motherfucker\nComin at you live on WKYA Radio from the Brick City\nThe weather is callin for it to be hotter than a MOTHERFUCKER out there\nSo crack a brew, roll a blunt, cause the phone lines are open right now\nWe've expanded to cities like Atlanta, D.C., Tampa, Chicago\nDallas, Memphis, Detroit and L.A\nSo call in now, 1-800-High-as-a-Motherfucker\nThat's 1-800-,High-as-a-MOTHERFUCKER!!\n\nDOCTOR DOCTOR! Tell me how ya do it\nSpit hot shit like it ain't nuttin to it..\n\nDOCTOR DOCTOR! Tell me how ya do it\nSpit hot shit like it ain't nuttin to it..\n\n[Redman]\nYo, when I walk I stalk like a dog (AROOF!)\nWritin \"fuck ya hometown\" on ya wall (AROOF!)\nWKYA! Them niggas that'll whip out the dick\nAnd piss ALL in your gar-ments\nWhen I come around, son lay 'em down\nThis Homey the Clown play around so pay it now\nSweepin the block up, Mayor Doc, he in town\nRidin the highway at night to run a deer down; I look for the action\nFunk Doc, I don't look when I'm crashin!\nI'm so dope I could bundle cook-up by the aspirin\nGaspin like it's Aspen, no air\nBeef we bring it on with tap shoes and hope the po'-po' there\nGraduated, they said Red would go nowhere (uh-uh)\nNow, SOURCE AWARDS, ride a water buffalo there\nPolo Gear, holes in it, the fo'-fo' wear\nAss out, check the weather report for cold air (brrrr)\nOn your hottest day of the summer, I snowmobile in\nStack new jacks in the Carter, blow the building\nIt's WKYA muh'fucker\nBringin trouble your way, so duck muh'fucker!\n\nYeahh! Two-hundred and fifty-five-thousand pounds\nOf guerilla shit funk fo' yo' ass motherfucker!\nBricks to Brook-nam, we hold it down, PPP Def Squad\nYa tell me once and I'll tell you again\nPull out the mac-10 and rob yo' friend, yeahhh!\n(Fucker) WKYA (We kickin yo' ass)", "image": "https://images.genius.com/109a9fb9c91fad29c7f632fb053de1bf.1000x1000x1.jpg"}], "artist": "Redman"}