{"songs": [{"title": "Good Riddance (Aristo Diss)", "album": null, "year": "2009-03-02", "lyrics": "[Verse 1: Bishop Brigante]\nIt's fuckin' losers like you that make me do what I do\nMake me hate where I'm from, you as fake as they come\nEverybody got guns, who the fuck gonna squeeze\nEverybody got SARS, you ain't fucking with these\nWhy you wish to be ghetto, tell me what's it about\nWhy you tryna get in where I'm tryna get out\nWhy won't you just be yourself, why won't you tell us the truth\nLike how you only load guns when you up in the booth\nYou ain't nothin' to shoot, you don't even exist\nYou just a fantasy, family as weak as it gets\nAnd you ain't speakin' a bitch, cause I don't listen to chicks\nI don't argue with broads, cause I'm really a pimp\nBut I will tell you this, as far as y'all are concerned\nPull out my Santa Claus, and make the holidays burn\nYou can call me the Grinch, cause y'all are nothing but Who's\nJust another bunch of phony acts with nothing to prove\n\n[Verse 2: Ken Masters]\nNow let the kids play like the rider's ride\nWe spendin' all day, these niggas idolize\nThey claim they want fame nigga so we decided\nThat we gon' make 'em some stars until the drama dies\nBut they can go back to they holes where they mama lies\nOr write more lies about they drugs, guns or homicide\nFunny, claim the thug life that they abidin' by\nBut run up on 'em, then they turn into the silent type, they wanna compromise\nMy niggas, we ride or die\nAnd roll with them bitches that got they body right\nThese niggas ain't built, ain't got the body type\nTime to break a nigga's spirit like the Amistad, tryna fool the audience\nFeel the ambience\nStars in your presence, kings of the city are appalled by the peasants\nAin't gotta say names, we can all get a reference\nBrains and the info from your broads in the west end\nMasters, flowing staggers on bars\nNigga stay mad cause his swagger's on Mars\nY'all niggas ain't thinking we calling y'all 'tards\nClaim you want war, okay, on guard\n\n[Verse 3: Young Tony]\nAyo, hey you Mr. Rapper Guy\nWhen you in the booth, tell me why you have to lie\nCome on, spit the truth, all I hear is bang bang, hustle this, hustle that\nBut if you hustle crack, then where the money at?\nNo proof, Dr. Seuss, story tellin' when he rhyme, like\nOnce upon a time I was really on the grind\nThere's another lie, couldn't out-hustle me\nHatin' when it come to D, I can take you're starting 5\nI'm only goin' at generic rap niggas that\nRap about ki's but couldn't show me 10 G's\nAnd these nigga' dry snitching on they tees\nStanding out, like a sore thumb to the D's\nMy nigga please, if you really had work\nYou would do what you do and wouldn't put it on your shirt\nIt makes my heart hurt when dumb niggas act hood\nYou ain't no hustla, just a nigga that can rap good\n\n[Verse 4: Jonny Roxx]\nSee there's a height requirement, nigga to mention my name (smarten up)\nHow the fuck you little niggas didn't stay in your lane\nMan you offered me a truce and I took it\nNow I hear this bullshit so how the fuck am I to overlook it?\nIf this little nigga survive then it gotta be God\nHow the fuck are you a hustla with your factory job ?\nAnd I don't get it, nigga I'm a fucking diabetic\nAnd I don't usually eat y'all sweet niggas\nEvery time I see y'all retard niggas y'all bitch out\nWaddup Roxx? now we cool? then you dip out\nTalkin' all that bang bang shit, pull a clip out\nSayin' you a blood, next week you prolly crip out\nI'm saying, we don't believe y'all niggas (nah)\nG-35, x5 nah niggas (yeah)\nThis here is a public announcement for my niggas (yeah)\nNo more goodnight, good mornin', goodbye niggas\n\n[Verse 5: JD Era]\nI don't appreciate niggas sayin' my name in they bullshit\nIt's like putting a knife against the lyrical full-clip\nDo shit on my own, I never asked for help\nIf I was rapping like y'all I woulda killed myself\nAnd nah, this ain't beef, it's missing a few ingredients\nDog you ain't a general, stick to being obedient\nPiggy back, that ain't something I had to do\nLaughing at Drake? you should'a seen how I was laughing at you\nI don't beef over little shit, angry? A little bit\nLittle niggas get little recognition you little bitch\nI don't do the little subliminals, I'm addressin' it\nAnd if Littles wanna get in the middle then I'm suggesting it\nThey called you a bitch, were tryna act out\nThey challenge 'em to a fight and then they back out\nSo tell me how the fuck I can respect you cats\nIf you a gangsta, then what part of the game is that?\n\n[Verse 6: Drake]\nHey yo Aristo, I'm lost, can you tell me whats goin' on in the streets?\nHow it feel to count dough while you palmin' the heat?\nAnd yes I asked for a 16, you did your 16\nI heard that weak shit and only wanted the beat (it's true)\nBut fuck the money and the cars that I drive to set\nAnd fuck the women that's lying to all the guys they met\nAnd fuck the features on my songs and the deals on the table\nOr basically it's fuck everything that you strive to get\nAnd it's the room of resolution, I'm finishing it in here\nIf I copy Budden's flow, you mimickin' his career\nAnd the same money we hearin' you giving to charity\nYou need to be giving to Littles to give him some clarity (what up Littles)\n'Cause that's your homeboy I think he's owed that much\nTell him pressing 25 don't mean you sold that much\nAnd Breana, I don't mean to alarm ya\nBut you need to get outside the car to shoot this video in Parma (Tony!)\nYou act like you hood and hood niggas'll harm ya\nAnd this is not hatin' my nigga we call it karma\nBut yo Thug Life, show me where the hammer be\nYes I took an L on my own and they didn't damage me\nYou try to cover up your lies like a canopy\nAnd tryna pull 17 year olds down in Bramalea (I know about it)\nAnd we don't got it out for you\nWe just saying that don't nobody vouch for you\nNope, nobody thorough is willing to give a cosign (nobody)\nAnd you don't even sell blow, you just blow time\nYou can't even get a factor grant\nSo stop rapping, go fix parts at a tractor plant (damn)\nAnd listen here, Tetley Tea\nYou one of the seven dwarfs standing next to me\nYou probably snitchin' in court, then accept the plea\nAnd I hear you paying these women and I sex for free (what up sweetheart)\nBut dog, how did this start, how we get to this part?\nWe all got niggas doing bids \"Mr. Wishheart\" (what up Cam)\nIt's not cool to use another nigga's as a threat tho'\nI said you a bitch, I heard a seven man echo\nYou saying I hustle, my source for currency coke\nThey saying you never moving it and currently broke\nAnd you risk doing crack time and hang around black crime\nJust so you can have something to say in you rap lines\nThey say Drake killed it like young girls at a private school (I did)\nDog if I were you, I tell you what I would do\nI would cut ties with the cops and just make them fire you\nLose the body pack and the velcro you feed the wire through\nTell them not to call and that's even if they require you\n'Cause they the only people recording that wanna hire you (it's true)\nWith what I spend in a weekend I could acquire you\nSome of them believe you got money you little liar you\nBut, I don't admire you, short niggas tell tall tales\nGood riddance Aristo I just retired you!", "image": "https://images.genius.com/e8e4af9d70633a1703ccd3faf671871c.640x640x1.jpg"}], "artist": "Drake"}