{"songs": [{"title": "Oh No", "album": "Straight from the Lab Part 2", "year": null, "lyrics": "[Intro]\nOh no, what's happening to my brain?\nI can't believe this is happening again!\n\n[Verse 1]\nLava on my lips I flips, wake up think I have a cramp\nI'm trying to shove the lava lamp up my father's ass\nI think I'm out of gas, man, I need another mask\nI'd ask my mother but I think she's laughing at the plants\nA half a gram of graham crackers and some Van de Kamp's\nI think I'll eat some Ambiens like they're candied yams\nCut a couple cadavers up and have a little snack\nAbra-fucking-cadabra, motherfucker look who's back\nJust like a pendulum, Satan's pentagram swings\nI accidentally dented it and bent the damn thing\nShit I think I might have did it when I was dancing\nWhile I was chopping one of my legs off when I pulled a hamstring\nFirst I Re-Up, then I Relapse\nGo to rehab and I Detox after I see Doc\nAnd I'll be back with the sequel, repeat the cycle\nCause I react like the She-Hulk when I see NyQuil\n\n[Hook]\nOh no! (Oh no!)\nHere we go again (again)\nDon't know (don't know)\nWhen it's going to end\nUh, oh! (Uh, oh!)\nWhere did it begin?\nDon't go (don't go)\nMaybe way back when\n(Relapse!)\n\n[Verse 2]\nInto the well, baby Jessica fell, she may have wetted herself\nQuit playing, get her some help\nMary Kay Letourneau sending me letters from jail, every day in journals\nSaying how, she wanted to smother me in lettuce and mayo\nI'm the medicine man, my medical marijuana\nWas prescribed by a doctor, shove a typewriter up\nPerez Hilton's ass, shit, almost forgot that\nHe's always shoving something up his ass so why not that?\nAnd fuck it while I'm venting let's shove a vending machine\nUp his rear end when he's bending over pretending that he\nDidn't say anything that would be offending to me\nStick his head in a blender, begin blending in G\nWhere should I put the pink sissy with the fluffy hair?\nPut him under the stairs? People are already under there\nHmm, I wonder where. Wait, I think the cubpoard's bare\nStuff him up in the Tupperware and shove him up in there\n\n[Hook]\nOh no! (Oh no!)\nHere we go again (again)\nDon't know (don't know)\nWhen it's going to end\nUh, oh! (Uh, oh!)\nWhere did it begin?\nDon't go (don't go)\nMaybe way back when\n(Relapse!)\n\n[Verse 3]\nVicodin's like a nitrogen hydrogen vitamin\nI bite into five and then I get high as a kite again\nI like it when I get in my zone on the mic again\nWho am I kidding? I couldn't quit this shit if my life depends\nI relapsed twice after I came outta Brighton then\nYeah, rehab's nice, I had my name up in lights again\nYou see that's why I can't decipher what life I'm in\nI might pull a knife on your wife and slice her and dice her then\nIt sounds so enticing, isn't it nice when I'm hype again?\nOn nights when I'm like this, no time to write just type it in\nIf I could get my pen to slow down, what'd I write just then?\nMan I'm 'bout to hyperventilate, I just have hypertension\nI have the type of mental state you couldn't comprehend\nUnusually stupid of you for you to think I'm your friend\nI usually do what I do and suffer no consequence\nI offer no mercy, the controversy is once again\n\n[Hook]\nOh no! (Oh no!)\nHere we go again (again)\nDon't know (don't know)\nWhen it's going to end\nUh, oh! (Uh, oh!)\nWhere did it begin?\nDon't go (don't go)\nMaybe way back when\n(Relapse!)", "image": "https://images.genius.com/92a4caddb38548f811a9d5b5599e4304.1000x1000x1.png"}], "artist": "Eminem"}