{"songs": [{"title": "In A Nutshell", "album": "Fuck Da City Up", "year": "2012-01-01", "lyrics": "[Hook: Lady G]\nIn a nutshell, I'm the shit off in this bitch\nThe reason all the bad bitches switch off in this bitch\nI'm flyer than a rocket, lift off up in this bitch\nEverybody on their toes, I'm on my tip off in this bitch\nIn a nutshell, we getting money, cracking bitches\nPaparazzi has their cameras snapping, taking pictures\nMaserati snatchin 60 down the residential\nI can tell from your reaction you don't know nobody realer\nIn a nutshell\n\n[Verse 1: T.I.]\nShawty I'm so far gone\nRedhead and a blonde on each arm\nLanvin, Louboutin, Maison Margiela\nThey be blogging about what I got on, debating where they sell 'em\nI tell 'em, even if you find 'em, you ain't finna get 'em\nMy swagger on Beretta: (click click) Pow! Get 'em\nBoy I'm all about that balling\nI just flossed a stunt but I don't front\nDamn this shit they talking about\nBitch, I ain't got it because I don't want it\nSex on the Beamer, arrogant demeanor\nShe say she ain't freaking, bet I turn her like Tina\nMills on deck, got that check, no FEMA\nLooking at my net like overlooking the marina\nThem machines out front in the valet, not the alley\nIn my Ballys cracking bitches from the valley out in Cali\nWith that bread, I'm a beast, you don't know about me?\nNational Geographic did a show about me\n\n[Hook: Lady G]\n\n[Verse 2: T.I.]\nMan, ain't nobody on my level\nJust ask that new Bugatti or them diamonds in my bezel\nI throw a ho a mazi I don't give a shit about it\nParty with me, I collect the hottest bodies as a hobby\nFly as I can be, need no copilot\nThe bomb, kill shit dead, kamikaze\nBetter watch me though, I'm definitely popping, that I'm certain of\nWe grand hustle playboys, partner, ain't no work in us\nAll the money we throwing, they reimbursing us\nGet 'em to the crib and fill their pussies, not their purses up\nNeed no dress rehearsal, bruh, I'm fresh as shit, it's effortless\nAmazing hoes, impressing bitches: \"Tip is just the best at this!\"\n\n[Hook: Lady G]\n\n[Verse 3: Spodee]\nI'm a stunner, kill 'em without a lama\nThey callin' me paris hunter whenever in Ferragamo\nThey love me in California, they feel him in Arizona\nI got hoes so bad, I wanna drill 'em without a condom\nI fill 'em up in the Hummer, I fill 'em up with the mali\nKeep 'em off of the white and fill 'em up with the rati\nI'm a Eastside Gotti with a beachside hottie (yeah)\nIt's always on me, I got a discreet sign, shottie\nSince I've been getting bigger, I picked up a couple hobbies\nNow I like to fly, now I like Ducatis\nFirst I was just hot, now I'm like wasabi\nIn a nutshell, nigga, I'm the shit to everybody\n\n[Hook: Lady G]", "image": "https://images.genius.com/c4a42649ba1a4f401f2ed78317e312fc.1000x1000x1.jpg"}], "artist": "T.I."}