{"songs": [{"title": "Mic Check One Two", "album": null, "year": "1990-01-01", "lyrics": "[Intro]\nLet's just go, man\nIs it recording?\nYeah, let's just rhyme out our ass\nBout to kick a rhyme right outta my head\nMic check one two\nMic check one two\nMic check one two\n\n[Verse 1]\nHere I go in the place to be, rhyming like this on the M-I-C\nHere's the way that I rhyme so naturally, and actually\nWhen I grab the mic, all the people say \"M&M, you're one of the funkiest MC's out today\nAnd I say \"I agree\", because I am a funky dope slamming MC\nI slam them back, daddy, eveytime I grab the mic and say I wanna rap, daddy\nBut you can't, because I take it\nGrab the mic and after I'm done, I break it\nWhen I'm done, I just slam the\nMicrophone and cram it right in your asshole\nBecause 'asshole' and 'cram the' didn't rhyme, but that's alright 'cause I'm jamming\nOn the microphone 'cause I'm slamming, busting out lyrics and you like to examine\nMy style that I'm doing, but if you step to me pursuing, I'll ruin\nAll your hopes and dreams, 'cause I work with my man, he's on my team\nMy man Manix is on my side every time the (?) they say\n\"Damn, how'd you make a beat like that ma'am?\"\nAnd I say \"I'm not a ma'am, I'm a sir\", and if you step to me your eyes'll be blurred\n\n[Bridge]\nOne two\nOne two mic check-a one two\nOne two one two\nMic check-a check one two\nMic check-a one two one two\nMic check three four six seven eight\n\n[Verse 2]\nMic check one two\nDo unto others as you would have them do to you\nNo, that's not the way I work because\nWhen I rhyme I'm a jerk\nI grab the mic and start dissing\nAll these MC's and try to put them into submission\nTake them out for the count because the amount I throw is so deaf\nWord! Deaf didn't rhyme but I\nOn your windshield just like a turd\nEvery time that I rhyme you know that I'm\nGoing to climb to the tip tip top and I'm\nNot going to stop 'cause I grab the mic and dop-da dop dop\nI fucked up, but that's alright because my luck's up\nNo it's not, 'cause here I am, I got a lot to give\nAnd I don't live positive\nNow I'm not saying I'm negative\nBut if I grab the mic I do mega kits\nEvery time that I grab the mic you know that M&M is gonna be rolling his tongue just like this\nAnd then I go do a funky rhyme and if any MC steps up he gets fucking dissed\nBad, don't call me dad\nVanilla Ice said that, that made me mad\nSo when I step to the mic\nKnow that I gotta clear my throat and excite\nI'm trying to get the mic cord away from the stereo so I can bust some material\nI take it around my leg, and then all the MC's wanna beg\nAnd say \"Yo, please give me a turn!\"\nI say \"No\" because it's my turn to burn\nAnd I bust a rhyme like this and you can't step to a rhyme that I do 'cause you're dissed!\nYou're dissed so bad every time\nSure, he don't get a turn, and he's starting to get mad but I'm\nJust going to take the mic, I'm not gonna give it to him because I am\nSo damn hyped in the place to be\nRhyming like this 'cause I'm an MC\nRhyming so deaf to the happy ass beat\nIt's kinda gay like Liberace but hey\nListen to the words that I display every time I kick a rhyme this way\nYou know that the star is worthwhile, every time I grab the mic I'm longer than I mile\n\n[Verse 3]\nI waste no time, when I can't flip I caper\nI cut your butt up like G Floyd like paper\nWhen I bust a rhyme I'm a stud\nThat's what I like to say, jump on my pud\nGirly girly, would you like to fuck me fuck me in my house early?\nOr late, I don't care, let's make a date 'cause I don't pump weights to get dates\nJust because I'm huge, I bust a lyric\nBut I get greedy like a Scrooge\nWhen I grab the mic it's kinda stingy\nI kick rhymes that ain't dingy\nWhen I bust I'm like forcillin\nYou try to grab the mic and force it again\nBut you can't 'cause you are speechless\nAnd I get sandy like teachers\nI get sandy, I grab the mic handy\nIt's so I can get candy\nWhen I bust the shit I get like a noogie\nThen I boogie, boogie on down because\nEvery time that I kick a rhyme I just 'dud'\nI meant to say 'do', but I got an addiction to friction every time I kick non-fiction\nNon-fiction science, every time I grab the mic I got the alliance\nRight behind me stepping into the 90's, you know you'll try me and you'll die, G\nSo don't even try it, I don't buy it, so you'd better keep quiet\n'Cause you're into it, ain't nothing but to do it\n\n[Verse 4]\nYou'd better catch up 'cause you're trailing\nYou'd better put springs in your ass and jump like Van Halen\nEvery (time I bust a) rhyme I get like a panther if you're lying that slander\n'Cause you're lying like Berry Saunders, every time I grab the mic I get married and I\nLike to kick a rhyme that I pick\nEvery time I pick the mic up I stick\nA dick right up your ass like a faggot\nYou're gonna die, be crawling with maggots\nEvery time I dread you like hair, I said you'd better get (?) on your underwear\nYou'd better run, 'cause if you don't\nAfraid you'll be seeing a ghost like a Rake\nYou ain't an eighth of me, every time I grab the mic girls try to act so faithfully\nBut I say \"No, don't be a fan. Just try to step to my dick and act like a man\"\nNo, that don't make no sense but every time  I cut class like a pair of scissors I get so damn hyped\nOn the mic, 'cause every time I step to the forefront I like\nTo wonder on to something that I'm drawn to\nEvery time I grab the mic and pass it to Sean he\nGets so deaf but I'm not gonna pass it yet\n'Cause I burn like acid vet, word!\nI'm a stick like a trident 'cause you need guidance", "image": "https://images.genius.com/b379811c1415017b9f3e3a71b9d26060.400x400x1.jpg"}], "artist": "Eminem"}