{"songs": [{"title": "Go Hard, Pt. 1", "album": "Bar Exam 3: The Most Interesting Man", "year": "2010-05-30", "lyrics": "[Verse 1: Royce Da 5'9\"]\nBar Exam 3 is like a mock a nigga, pop a nigga mockery\nHousin', put the lock on it, Monopoly\nCall me Enterpriser, stick my battery\nInside a little white bunny, you can call me Energizer\nThe most interesting man in the world, I know papi\nSippin' root beer floats Saki mixed with Dos Equis\nI'm a Slaughterhouse rock star, I pick up the biggest pig\nI can find and throw it at the windshield of a cop car\nDissin' me can be pretty fatal 'cause bitch, I got Money In The Bank from puttin' that shit into Yayo like 50's label\nFuckin' freak, ya mommy and daddy, daddy and daughter\nYa daddy, your grand daddy, your name fatty is Carter\nShe like, \"Get inside me\" but that's a tight squeeze\nOnce I'm in her juice box she gon' hit the Hi-C's/high c/high sea\nI'm hooked up cause I'm ill ass fuck like I.V.'s\nI bare arms like it ain't nothin' up my sleeves\nThe next MC that rhyme 'official' with 'ref with a whistle'\nThat ain't Young Money, I'mma definitely diss you, if you\nRhymin' 'packin' a mac' with 'back of the Acura'\nPerhaps you can't match my spectacular vernacular\nYou still rhymin' 'bottles' with 'models', 'college' with 'knowledge'\nUsin' the word 'swagga,' you're probably garbage\nYou thugs funny, comparin' 5'9\" to anybody\nYou comparin' Superman to Bugs Bunny\n\n[Interlude: Royce da 5'9\"]\nYou are now rockin' with the Bar Exam 3!\nThe most interesting man in the world\n\n[Hook: Royce da 5'9\"]\nBE3 go (hard, hard-hard)\nNickel Nine go (hard, hard-hard)\nKid Vishis go (hard, hard-hard)\nNigga we so (hard, hard-hard)\n\n[Verse 2: Kid Vishis]\nI be blazin'\nI'm talkin' 'bout stoned, Goliath in the fight vs. David\nI'll kill ya, bullets ain't lyrical, blaoka!\nStraight to the point, the gun's Waka Flocka\nRhymes is electric, five volts\nIt'll make your voice crack like Whitney hittin' high notes\nI got a metal gut with large nuts\nYou bitch ass niggas, we call y'all \"dog butts\"\nYeah, I remember what they said\nYeah, my pockets used to be skinny, now they fat like K-Fed\nAww man, my bullets is a fan of me\nKiss him right in the mouth, do him like Kid Cudi\nThey say one man's trash, another man's treasure\nI call her a fat, black, bitch, you call her Precious\nSince I'm a gun blazer\nIt cost me nothin' to take your money, Vishis like a fund raiser\nRuger by me, you with a gun\nIs a bigger myth than Jay-Z in the Illuminati\nThis is B verse rockin', so you gettin' punched up\nMore than Mike Tyson do to paparazzi\nFreeze when you see the mag, I don't flash I blast\nLeave his ass as nasty as Trina rash\nWhen it come to that rhymin' shit\nNigga, I'm a steroid shot, you a Flintstone Vitamin\n\n[Interlude: Royce da 5'9\"]\nM.I.C. Records! The most interesting man in the world!\n\n[Hook: Royce Da 5'9\"]\nBE3 go (hard, hard-hard)\nNickel Nine go (hard, hard-hard)\nKid Vishis go (hard, hard-hard)\nNigga we so (hard, hard-hard)", "image": "https://images.genius.com/f26afa0e15f73eb0b5cef561ec304c68.450x450x1.jpg"}], "artist": "Royce da 5'9'’"}