{"songs": [{"title": "Cash Money Millionaires", "album": "Tha Carter", "year": "2004-06-29", "lyrics": "I keep pimpin\nI keep pimpin\nI keep I, I keep pimpin\nI, I, I keep pimpin\n\n[Verse 1]\nI got a bitch in the back, got a ho in the front\nOne cookin the crack, one rollin da blunt\nYou get pussy and ass from a beautiful broad\nIf you lookin' fa that holla at cha boy\nI'm a m-m-mack mack a p-p-pimp\nI sp-sp-sp-spit out shrimp\nI pull up clean I get out limp\nI walk like (?)\nI talk like bi, bitch get chere\nBest playa on my team when I ball women cheer\nAnd they love the way I come out wit the gear\nThis jacket these shoes don't come out this year\nSo if you love ya girl don't let her come out this year\nIf you leave her out there then she comin out here\nAnd that ain't fair but I don't care\nI'm a motherfuckin Cash Money Millionaire Yeah!\n\n[Hook x2]\nWho you think you fuckin wit (Bitch!)\nWho you think you fuckin wit\nWho you think you fuckin wit\nWho you think you fuckin wit\nWho you think you fuckin wit I'm serious bout this pimpin shit\n[I'm a motherfuckin Cash Money Millionaire, naire, naire...]\n\n[Verse 2]\nI got 25 dollars on my dresser and if I\nGive it to my ho she gon bring back mo'\nNot a.. minute go she ain't gettin that loot\nAnd if you ain't got no money she ain't gettin at you\nI like em sexy high yellow if you fit in that shoe\nOoh boo you can come and get in that coupe\nTake a hit of that fruit, get high with Wayne\nFly with Birdman Jr., wave hi to planes\nSay bye to lanes don't buy they game\nIf he ain't scored in the first half bench his ass\nIf you play wit my money I'm a lynch ya ass\nI'll John Lynch ya shit don't tempt me bitch Oh!\nWipe me down cause I'm filthy rich\nIf gettin moneys a crime then I'm guilty bitch\nAnd that ain't fair but I don't care\nI'm a motherfuckin Cash Money Millionare Yeah!\n\n[Hook 2x]\n\n[Verse 3]\nI sit low in the car, sit high in the truck\nLay at the front of the plane, lay at the back of the bus\nGot ladies fa days, got women fa months\nLeave ya girl at home I made 21\nGot that thing on chrome blade 21\nGot them thangs inside make me empty one\nPull it ova to the side by a pretty one, like\nWhats good mami come make a cloud yo pillow, come fly wit me\nMy diamonds sing, my weed is rap\nCall me Weezy Da King or call me Weezy Da Crack\nIf pimpin is dead then I'm bringin it back\nMatter fact it neva died so I take that back\nIf ya shoes too small shawty take that back\nCause you gon walk all day till you make that back\nAnd that ain't fair but I don't care\nI'm a motherfuckin Cash Money Millionaire Yeah!\n\n(hook) 2x\n\nWho you think you fuckin wit....(repeats)\n\nWhats really good moma. Its ya boy W.a.e.z.y.F. Baby\nSo high in the sky I'm so fly watch out fa the power lines ya know!\nGet wit me...One\nPimp Daddy!\n\nI'm a motherfuckin Cash Money Millionaire, naire, naire... (repeats 4x)", "image": "https://images.genius.com/423c90e7f232e6d83a86b2645ff72b5c.500x500x1.png"}], "artist": "Lil Wayne"}