{"songs": [{"title": "Squash All Beef", "album": "KRS-One", "year": "1995-11-07", "lyrics": "Hah, respect!\nAll crew, all massive, everywhere in the world\nYou practice the art of hip-hop\nThis goes out to every boy and every girl\n\nGive me relief! I sing!\n\nGive me relief! Squash all beef!\nDon't let these arguments destroy us! I sing!\nGive me relief! Squash all beef!\nDon't let these arguments destroy us!\n\nCheck it\nAll beef can be squashed if you want it\nBut instead of forgiveness, ego you flaunt it\nEverybody gets into two or three quarrels\nLeadin to a squabble, someone will die tomorrow\nLife is not a thing you can borrow\nAll beefs don't have to lead to sorrow\nWill ya, go out tomorrow\nI think, you should think about the beef you got\nAnd confront your enemy before it gets too hot\nNever feel ashamed, to say, \"Yo G I'm sorry\nI apologize,\" the object is to stay alive\n\nI never ran from the Klu Klux Klan\nAnd I shouldn't have to run from a black man\n\n(a group says it together)\nI never ran from the Klu Klux Klan\nAnd I shouldn't have to run from a black man\n\nYeah!\nGive me relief! Squash all beef!\nDon't let these arguments destroy us! I sing!\nGive me relief! Squash all beef!\nDon't let these arguments destroy us!\n\nHe said she said, but she said she didn't\nFace gets hit, and then, bullets start spittin\nNo one's admittin to their wrong doing, unfittin\nRevenge we're pursuin, look at what you're doin, LISTEN\nRelease the karma that you're carryin'\nBe a mental vegetarian indulge in no beefs, like the\nFish in the aquarium, you'll enjoy it while you're tryin it\nThere is no seperation between the mind and the environment\nLike a bolt of lightning\nI'm givin 5000 volts of the occult while I'm writin and recitin\nI've come to enlighten black and white to the meaningless fightin\nClash of the titans ain't right\nAnd it's wrong so the song reflects\nFor too long we've been vexed at each other\nEvery sister, every brother..\nYou've gots ta LOVE one another\n\nI never ran from the Klu Klux Klan\nAnd I shouldn't have to run from a black man\n\n(a group says it together)\nI never ran from the Klu Klux Klan\nAnd I shouldn't have to run from a black man\n\nYeah!\nGive me relief! Squash all beef!\nDon't let these arguments destroy us! Check it\nGive me relief! Squash all beef!\nDon't let these arguments destroy us! Ha hah\n\nGive me relief! (That's right)\nSquash all beef!\n\nIf I ruled the schools, from pole to pole\nThe entire judicial system would fold\nI would get rid of the books cause they bogus\nAnd in school, Knowledge of Self would be the focus\nKids would flock to the schools like locusts\nCause school now relates to them, and you would notice\nViolence in society would be a minimal\nCause the education yeah, would now be metaphysical\nNot livin by laws, but livin by principal\nIf you disobey, the UNIVERSE gets with you\nWe would study giving so no one would steal\nAnd we would read each other's magnetic fields\nPetty crimes times petty crimes\nEquals prison for lifetimes\nThe universe divided by two\nEquals me and you\nMe and you, go into the universe once\nOr as one united front\nBut listen up, when I was growin up in hip-hoppin\nWe had a thing called Jailhouse Boxin\nThat's why I'm STILL here rockin\nCause my competition never pulled a Glock in, yeah\n\nGive me relief! Squash all beef!\nDon't let these arguments destroy us! I sing!\nGive me relief! Squash all beef!\nDon't let these arguments destroy us! Yeah!\nGive me relief! Squash all beef!\nDon't let these arguments destroy us! I sing!\nGive me relief! Squash all beef!\nDon't let these arguments destroy us!\n\nWhattup Sadat X?", "image": "https://images.genius.com/78316fa7efcf948425107910e5b3a92b.300x300x1.jpg"}], "artist": "KRS-One"}