{"songs": [{"title": "The Great Americans", "album": "Self Made Volume 3", "year": null, "lyrics": "[Intro: Rockie Fresh]\nRockie Fresh, and I'm from Chicago (Maybach Music)\nWhere young niggas die every few seconds\nBut we still just wanna be great Americans, yeah\n\n[Verse 1: Rick Ross]\nUh, I was born to be another number\nSo was number 1, I pray I never fumble\nUh, I used to wear the cheapest clothes\nNow my posters in the reefer stores (huh)\nI be posted like I’m 7’4\"\n'Til the day I'm knocking at my heaven's door\nJust like Club LIV when that confetti fall\nI fell in love with the game, damn it's a distant love\nI let her see it just to tell her friends what she saw\n200 mil' how I get it, damn I can't be far\nI keep my sneakers low cut\nHeat fitted, G-5 with the nose up\nSelf made, St. Regis with the toast up\nRoom service, Belaire, time to toast up\nMy attraction have African in them happy homes\nNever seen a square nigga with a happy home\nAll the money generated, double M the greatest (Maybach Music)\nRest in peace to every genius that never made it\nDon't it sound like I'm dedicated?\nJoe Flacco deal, nigga with hot flows\nWhole cheerleading squad all through my iPhone\nAll them hoes in my iPhone, nigga, yeah\nSneakers snow white, nigga, at the 50 yard line (huh)\n\n[Interlude: Kay Foxx]\n\"It's Kay Foxx reporting live\nA Carol City rapper facing the music\nConnected to an alleged robbery and assault\nGunplay surrendered at Miami-Dade headquarter\nThe charge armed robbery means he cannot post bond.\"\n\n[Verse 2: Gunplay]\nMomma poor, daddy poor, what's the antidote?\nWind through the window blew the candle out\nNo lights, many cold nights\nHungry belly, burning, yearning rice\nRent late, on a plate, just a blank space\nOld girl lookin' at me with the blank face\nMade it off a prayer and a saint's grace\nAK's kept me in a safe space\nSucka free for the one three\nProbably on tour for the one four\nSucka tried to give me life plus one more\nBut I gave it back and told them \"fuck y'all!\"\nIn this day and time I got a '89\nMiami state of mind, cocaine, steak and wine\nUnderstand I over came\nMade it through rain and open flames\n\n[Interlude: Rick Ross]\nNiggas was sold for, practically nothin'\nWho became great Americans\n\n[Verse 3: Fabolous]\nUh, my car be parked out front of Darby (yeah)\nMy chick Barbie, your bitch gar-B\nA-G-E, I just A-T-E\nSippin' A-C-E over at A-B-E (nice)\nAnd offers, I'm not a back-and-forth'er\nI don't make friends baby, I make offers\nLike you can get with this (or) or you can get with that (huh)\nI think you get with this (huh) cause this is where it's at (haha)\nHate when broke niggas try to play mediator (word)\nKeep your two cents to yourself, you might need it later (word)\nSilence is golden, duck tape is silver (yeah)\nProfessional shooters, Leon and Mathilda\nYeah, my woman vary, just give me a young Tahiry (feel me?)\nWho do whatever I ask of her, dead Siri (feel me?)\nMy theory keep winning as the days change\nYesterday's home-runs won't win today's games, nigga\nWin today's games, nigga, uh\n\n[Outro: Rockie Fresh & DJ Scream]\nLife's a game, it's only how you play it\nTake advice from a few who made it\nGot a chance, you should go and take it\nGet it now, homie, why you waitin'?\nGot a dream? You should go and chase it\nBe creative, stop bein' basic\nKeep it movin', don't be complacent\nShow love, why you hatin'?\nYou could be somebody famous\nYou could be somebody famous\nGreat American dreams, yeah\nThis the legendary DJ Scream talkin to you\n\"Self Made 3\"", "image": "https://images.genius.com/a0e5d4137e24ca9bb8d23cbf6a051f80.500x500x1.jpg"}], "artist": "Rick Ross"}