{"songs": [{"title": "The Resistance", "album": "Thank Me Later", "year": "2010-06-15", "lyrics": "[Intro]\nYesterday when we were getting high\nYou were invited, you woulda liked it\nI-I- I know you all too well\nI said that we could kiss the past goodbye\nBut you weren't excited\nThere's no way to fight it\nYou can stay but shawty here I go\n\n[Verse 1]\nShould I spend a weekend in Vegas?\nI'm living inside a moment, not taking pictures to save it\nI mean, how could I forget? My memory's never faded\nI can't relate to these haters, my enemies never made it\nI am still here with who I started with\nThe game needed life, I put my heart in it\nI blew myself up, I'm on some martyr shit\nCarry the weight for my city like a cargo ship\nI'm 23 with a money tree\nGrowing more too, I just planted a hundred seeds\nIt's ironic cause my mother was a florist\nAnd that's how she met my pops\nAnd now my garden is enormous\n\"It's happening, Penny Lane, just like you said!\"\nI avoided the coke game and went with Sprite instead\nUh-huh, that's word to the millions that they putting up\nI'm trying to do better than good enough\n\n[Chorus]\nWhat am I afraid of?\nThis is supposed to be what dreams are made of\nBut people I don't have the time to hang with\nAlways look at me and say the same shit\nThey say \"You promised me you would never change\"\n\"You promised me you would never change\"\n\n[Verse 2]\nAm I wrong for making light of my situation? Clap on?\nWhen 40 got some shit for me to snap on, now that I'm on\nI don't really want to worry about getting back on\nI'm just trying to stay on, get my fucking buffet on\nI heard they just moved my grandmother to a nursing home\nAnd I be acting like I don't know how to work a phone\nBut hit \"redial\", you'll see that I just called\nSome chick I met at the mall that I barely know at all and\nPlus this woman that I messed with unprotected\nTexted saying she wished she would have kept it\nThe one that I'm laying next to just looked over and read it\nMan, I couldn't tell you where the fuck my head is\nI'm holding on by a thread\nIt's like I'm high right now, the guy right now\nAnd you could tell by looking in my eyes right now\nThat nothing really comes as a surprise right now\nCause we just having the time of our lives right now\n\n[Chorus]\nWhat am I afraid of?\nThis is supposed to be what dreams are made of\nBut people I don't have the time to hang with\nAlways look at me and say the same shit\nThey say \"You promised me you would never change\"\n\"You promised me you would never change\"\n\n[Verse 3]\nI live by some advice this girl Lissa told me\nThe other day Lissa told me that she missed the old me\nWhich made me question when I went missing\nAnd when I started treating my friends different\nMaybe it was the fast paced switch up\nOr the two guns in my face during the stick up\nMaybe cause a girl I thought I trusted\nWas who set the whole shit up\nBut in fact I haven't seen them since they locked Big Rich up\nI know but same time I'm quick to forget\nI'm 'bout to roll me up a blunt with my list of regrets\nBurn it all, burn it all, I'm starting it fresh\nCause half the time I got it right I probably guessed\nDid I just trade free time for camera time?\nWill I blow all of this money baby, hammer time?\nYeah, I just need some closure\nAin't no turning back for me, I'm in it 'til it's over", "image": "https://images.genius.com/f0994c69f0994bc6b307070ecb02d6cd.1000x1000x1.jpg"}], "artist": "Drake"}