{"songs": [{"title": "AOL Shut Down", "album": null, "year": null, "lyrics": "[Intro]\nMan, I don't know what the fuck these dudes are tryna diss me and shit, man\nThey ain't even on my level and they ain't never going to be on my level\nI ain't even gotta try that hard, ya know what I'm saying\nThey put their fullest into their disses and shit, and I just fucking go shit some now real quick, you know, it's that easy\nThey will never be on my level, and I'm speaking the truth\nThey know it, they might deny it, but they fucking know it deep down inside\nTheir mom and dad know it, their homies know it, my homies know it, we all fucking know it. They ain't got one hit song, they mixtape all their shit, my shit is all original, my beats\nJust keep it real with this shit, I ain't try to be like nobody else\nYeah they say I try to be like Eminem, I'm just my doing what the fuck I'm doing\nThey never see nobody do that shit before\nThey're fuckin' getting jealous, 'cause their shit is just bullshit, know what I'm saying?\nBut for all you motherfuckers out there who thought Hopsin wasn't gon' make his comeback, man, what comeback, I ain't never left!\nFuck you language arts, Wicky Rosco, whatever the fuck your name is, fuck you Chops, and fuck you Perez!\nLET'S GO!\n\n[Verse 1]\nSo I sound like Eminem, okay now\nGo ahead and lie say you didn't jock Soslay style\nTalkin' all that shit, sayin' I'm on the shelf\nListen to your ass bitch, you describing yourself\nMan you wish you was me, but y'all ain't like me\nYou out your mind, thinkin' I'ma finna get ate by teens\nI'ma put you in your place too, dissin' me just ain't cool\nRosco and Chops friends for life y'all some gay dudes\nY'all ain't no real recording artist with that wack rap\nI'm better then y'all and I'ma DIE! over that fact\nAnd I don't even know what hype these fools to push me\nThe day they eat me it'll be the day I grew a pussy\nThis shit is mine and I'll never give the game up\nEspecially to a studio gangster from Pennsylvania\nLast time that I dissed lang he was filled with aches of pain\nNow he coming back a year later then just change his name what? to Rosco what? Is he fakin'?\nI could've sworn that motherfucking rap name was taken\nNow what you doing man?\nIt's s'pposed to be a secret, plus nobody else take, noticed this so I'ma keep it\nPlus nobody noticed that your sister is a freak bitch\n'Cause I been talkin' to her myspaceing her every weekend\nShe wanna fly down and deep throat me up to I be skeetin'\nThat's all the bitch is good for so after that she'll be leaving\nThe bitch is just a motherfuckin' prostitute\nRun up in your crib, and have me telling my ass not to shoot\nAnd I'm a nice guy man, I ain't gonna rape your mama dude\nI'ma put a gun to you and make you beat your momma's coot\nYou done fuck with the wrong fucking guy\nThis ain't just rapping, this is real fucking life, bitch\nAnd Chop you think you're stopping me cuz\nListen to your shit man fix your quality up\nYour mother fucking vocals are just super loud\nI popped your diss in, and it blew my subwoofer out\nY'all think you slick with your hard on rap\nDissin' AOL rappers, when you are those cats\nMan! All your music's just a big old lie\nYou based your rap career off what's happening online\nHow many damn songs you hear me share about these motherfuckers (NONE!)\n'Cause I don't really care 'bout these motherfuckers\nI don't collaborate with none of y'all 'cause actually\nYou ain't worthy enough to hop up on a track with me\nY'all trying your hardest while I'm having fun with this shit\nFuck the chatrooms, the battles man, I'm done with this shit\n\nSo, fuck all y'all, fuck all y'all\nFuck all y'all, fuck all y'all\nFuck all y'all, fuck all y'all\n\nFuck all y'all, fuck all y'all\nFuck all y'all, fuck all y'all\n(stop, stop, stop it!)\n\n[Break]\nStop, cut it off, cut it off\nI forgot somebody\nPerez, you thought I was going to let you slide my friend?\nOh no!\n\nHit it! [?]\nThis is for México motherfucker!\nYou talk with me too much 'migo\nI tried to told you 'migo once, but you don't listen to me!\n\n[Chorus]\nBuenos dias, Perez, adios\nBuenos dias, Perez, adios\nBuenos dias, Perez, adios my friend\nBuenos dias, Perez, adios my friend\n\n[Verse 2]\nFuck me little, vato, I put you in the pothole\nDon't you know fuckers take me, I'm coming from the barrio (dale oh!)\nI'm crazy like the crazy guys\nI'll just punch you in the face and give us just a lazy eye\nI don't really know why you think you can beat me\nI'll come to your house, with Joker, En Creepy\nEn Sneeky, En Pipi, En Carlos, En Ricky, Jorge\n[?] Christie, who's freaky\n\nOoh!\nDale oh!\nDale\nIt's over\nIt's over\nTurn it off, it's over, dale", "image": "https://images.genius.com/1620b55458e423f96bf6316d13418223.1000x1000x1.jpg"}], "artist": "Hopsin"}