{"songs": [{"title": "Bump That", "album": "Free Agents - The Murda Mixtape (Bonus Disc)", "year": "2007-03-13", "lyrics": "[H] Yeah\n[50] Yeah\n[H] It's real, it's real\n[50] Yeah\n[H] Got 'em\n\n[Hook: 50 Cent]\nBump that - niggas try to stunt on my clique\nThen when I get on that shit, I bring it to 'em\nWhere they pump at, 12-gauge Mausberg\nNo shell in the head 'fore you put in work\nYou gotta pump that - you done hit a nigga with it\nAnd you runnin, the police is comin, take my advice nigga\nDump that - this is serious, these rap niggas\nI'm just havin fun with it, 50 Cent, Havoc bump that\n\n[50 Cent]\nMy son asked, \"Daddy why you carry a gun, you ain't a cop\"\nI looked at him and said, \"Sometimes you gotta shoot or get shot\nWanna go to show-and-tell and show the class my Glock?\nShow 'em the clip, show 'em the beam, show 'em how Daddy lean\"\nIn the convertible Jag, 22-inch mags\nFor a high school dropout, shit, that ain't bad\nI ain't a Blood or a Crip, I'm doin my own thang\nG-UNIT! Shit, I done started my own gang\nI don't go that funny dance, I don't throw gang signs\nBut I'm a gangsta to the core so I stay with a nine\nYou think all I do is rap, then you don't know me good\nHave Smurf hangin out the sunroof to light up yo' hood\nMan, Carlito ain't never seen Blanco comin\nBut if he did, you think he woulda started runnin?\nAnd I move with them Doublemint Twins, and two macs\nI'll leave you flat your back - BRRRAT! Take that\n\n[Hook]\n\n[Noyd]\nUh-huh, aiyyo, aiyyo, aiyyo\nMy life story is that gangsta thing, packin that thing\nIced out diamond rings; fuck linen\nIt's Timbs and jeans, puffin cigars, stuff it with greens\nWhat's fuckin with Queens? Nuttin and not a thing\nWe kings of rap, shanks and gats, knuckles and bats\nGet at me, you want beef, come correct\nStunt on any nigga in my clique-ah, you get clapped\nWe sick, so quick, you be layin on your back\nCause we don't give a fuck nigga, we love to dump\nYou don't wanna get jumped, better turn yo' music up\nAnd bump that - cause we comin with them guns black\nAnd cause of the hoodrats, know where your home's at\nFuck that, this is for my niggas in the hoods that\nSlingin them blue caps, smokin that chronic sack\nGet that paper, watch for all haters\nSnitches and them bitches and them inside traders\nNigga fuck that\n\n[Hook]\n\n[Havoc]\nYeah, yeah\nIf you trippin with my niggas 50 and Noyd\nIf anybody ask me nigga them my homeboys\nWhen it come to drama know we pack them big gats\n(We got a ton of slugs) Bitch, and it's like that\nWe them thirsty ones, no mask, we stick cats\nI never handcuff a ho, I let you whip that\nLet my money bubble, live off the kick back\nThis midnight shit is serious, where your kids at?\nThese streets too dangerous to let them roam\nI done seen the gulliest of 'em, cry for home\nLike a fish out of water, they gasp and shake\nI'm a friend of the jooks and the dukes and the duct tape\nLike a Down South nigga I won't stop 'til I'm \"skraight\"\nWalkin up the street, testin out my heat\nUh-huh.. and as you stand in disbelief\nWhen it comes to the slugs I ain't cheap\nNigga you know I..\n\n[Hook]", "image": "https://images.genius.com/cb51383ec91030d5e17e2b134d0e8477.1000x1000x1.jpg"}], "artist": "Mobb Deep"}