{"songs": [{"title": "Welcome To Gilla House", "album": "Ill At Will Mixtape Vol. 1", "year": "2004-01-01", "lyrics": "[Hook]\nIt ain't the way you walk\nThat makes you a gangsta\nIt ain't the way you talk\nThat makes you a gangsta\nNo matter now many guns you got\nYou ain't no gangsta\nCause you ain't gon' bust no shots\nAnd that ain't gangsta\n\n[Verse One]\nMe and the mic like Adam and Eve\nGetting y'all nose open like Claritin D\nI'm back in the basement, the black Julio Iglesias\nGot hoes that's not high maintenance\nCan you taste it? Bricks in the air\nSo next year, they elect Doc for mayor\nWhoever the king now, give up the crown\nAnd don't fumble when you running for touchdowns\nI'm one quarterback that can throw the bomb\nThat's why half my arm is golden bronze\nOver a hundred yards\nShit I even hit the man in the stand, yelling hot dog\nBelieve it, my rhyming is good\nEach Row is Death like it is signed to Suge\nI'm one hot nigga you can find in the hood\nSo don't find your punk ass lying in the woods\nDead and stinking, L.O.D. back on the map, we linking\nThere's gonna be a lot of funerals and Lincolns\nKeith Murray got his shit together so fuck you and whoever\nGillahouse, that's the code\nI spit fire like that dude that won Next Episode\nStop drop and roll while Bricks unload\nMuddy Waters, who next to get IKSRFO!\n\n[Gov-Matic Interlude]\n\n{beat change}\n\n[Verse Two]\nChicks know I'mma freak on the low\nDoc like Saddam, you can find me in the hole\nIn the bed, they say \"Red tied me to the post\nFucked my brains out.\" With your hands on my throat\nI know they like the way I rock the boat\nWax ass, my dick squirt Mop N Glo\nMob Double O, I'm in the traffic dipping\nYou trying to win a Benz with a raffle ticket\nBut you can have the car and the jewels\nI don't need material to put fire to you fools\nI started young\nMade my umbilical cord a guitar and my mother's stomach a drum\nMade my first hit when I was three months\nCelebrated, left my mom throwing up\nFunk Doctor, don't spit he throw it up\nLike a fo' fo' built in my lower gut\n\nYeah, one time for you motherfucking niggas\nYeah, one time for you motherfucking bitches\nYeah, one time for you motherfucking niggas\nYeah, one time for you motherfucking bitches\n\nI'mma show you how to smoke now, my blunts fat and then yo' ass fat\nSo bitch let's go fuck\nI'mma show you how to smoke now, my blunts fat and then yo' ass fat\nSo bitch let's go fuck\n\n[Verse Three]\nYo, pins and needles, needles and pins\nA happy nigga, is a happy nigga that sins\nI'm like Jackie Chan in the hand with pens\nMixed with Jet Li and Anthony Anderson\nMy clientele is Seinfeld status\nMy rap quotables, best thing since Hamlet\nI'm in the hood like Planned Parent\nBust a nut, get up and put her on mass transit\nRedman is in the house motherfucker\nI put the infra red dot to your trucker\nI'm underground, I live out of bunker\nThis ain't the world of Willy Wonka\nIt's the Bricks nigga", "image": "https://images.genius.com/269feb9a815361d5df2b9a0fae3113b1.959x948x1.jpg"}], "artist": "Redman"}