{"songs": [{"title": "The Nigga Trapp", "album": "Laugh Now, Cry Later", "year": "2006-06-06", "lyrics": "[Ice Cube]\nNigga I'm a hustler, act like I'm lovin ya\nDon't mind fuckin ya, just like the Governor\nUsed to be the dope man, rolled a hundred spokes man\nWhen I come through, treat me like the Pope man\nGhetto spokesman, I know niggas\nIn Eastside Oakland all the way to Brook-lyn\nAnd they love my shitty drawers, what you smokin?\nThink you got the balls, nigga I'm a Trojan\nCatchin all that just like a prophylac'\nDon't reproduce, that bullshit is whack\nFlavor Flav with a white bitch that is whack\nGot to put the nigga back in my Cadillac\nTake him to the hood, where it's action packed\nLet him know that the target's still on his back\nIt's a hustle called capitalism\nGot my niggas in prison, all stuck in the system yeah\nRecognize who's a hustler, George Dubya\nHe's the one that's sittin back, fuckin ya\nWith a big dick stuck in ya\nI'm from a place where the fuckin Terminator is the Governor\n\n(I got a Public Pretender.. tryin to make me a winner)\n(Nigga please don't surrender.. they'll have you for dinner)\n\n[Hook: Ice Cube]\nThe ghetto is a nigga trap, take the cheese\nSoon as you do it here come the police\nInvented and designed fo' us to fail\nWhere you gon' end up, dead or in jail\n\n[Ice Cube]\nYou only got two places\nState of California, got two faces\nMotherfuckin devils, get straight racist\nWhen they get you in them lonely dark places\nConcrete slave ships, never move\nWhere niggas like us get used like a mule\nDon't let 'em catch you, arrest you\nStrip and undress you, throw you in a cesspool\nYou wanna know the crime of the century\nA ghetto elementary, a mental penitentiary\nBlack man, you never been friend of me\nBoy you kin to me, why we enemies?\nThe ghe-tto is a trap\nFuck where you from, nigga look where you at\nWhere you wanna be? Point it out on a map\nDon't be scared to leave homey, we can come back\nIf you wanna come back to this bullshit\nMost of it comin straight out the pulpit\nWe got to change our ways in the hood\nUnderstand that it's AIDS in the hood...\n\nThe nigga trap...\n\n[Hook] - 2X\n\n(I got a Public Pretender.. tryin to make me a winner)\n(Nigga please don't surrender.. they'll have you for dinner)", "image": "https://images.genius.com/c4141aa982e145b56c3c52c3fbd1c258.1000x1000x1.jpg"}], "artist": "Ice Cube"}