{"songs": [{"title": "Show Me That You Love", "album": "Let Love", "year": "2019-08-23", "lyrics": "[Verse 1: Common]\nEmbedded in emotion, I'm open, hopin' whoever's\nCalling's all in for the low-key, it was O-M-O-Y-E\nI read my daughter's name slowly, I'm asleep, sleepin'\nWith the TV on, two in the morn', \"Who the hell is this?\"\nOn some Biggie Warn', something's wrong, what's going on?\nYou should be under covers, warm, is there a thunderstorm?\nSomeone done you wrong? Words stumbled on, she mumbled on\nSomething's on, oh shit, she lit, a habit she got, legit\nWe talked a bit, truthfully I was tired\nYouthfully, she was high with her friends, I said bye quick\nThe phone collided with my sleep again, three minutes later\nBut there's another layer, she said I didn't care\nShe said I wasn't there when she was younger\nSummer tour buses wasn't enough to show what love is\nShe said I did things that a dad doesn't, and that she had questions\nIf I'm a good father, why all the bad judgement?\nI'm looking past judgement, about to ask somethin'\nBut she was bag bustin', inside I'm mad, cussin'\nInside I'm sad, dustin' off my pride\nI thought that I did protect and provide, and I'm a father that's live\nWhat about them rides with you in the backseat?\nYou tellin' me if it's a wack beat, I came to a few track meets\nWeekend movies, I got you tickets to Lil' Uzi\nTruly I try, she said\n\"It's the things that you didn't do, not what you did\"\nIt hurt her spirit when she saw me with another woman's kid\nPeeled back and thought, to love her, I gotta listen\nNow love and action is the new vision, she said\n\"Dad, let your actions be your loudest speaker\"\nAnd now my daughter is now my teacher, with love\n\n[Verse 2: Jill Scott]\nShow me that you're there\nShow me that you care\nI've been looking for you\nBut you don't wanna share\nI've been looking for you\nEven over there\nWill you stay around this time\nOr should I be prepared?\nShow me that you're there\nShow me how you care\nYou like to come around here\n(You know actions speak louder than words, right?)\nShow me that you love me\nShow me that you care\nThis space is feeling empty\nBut you don't see me there\nYou won't feel the pain\nAnd you won't take the blame\nHow you come around here\nAnd you just stay the same\nShow me that you love\nShow me that you care\nWhen is the time for\nYou to pull a chair?\nAnd tell me who you are\nAnd tell me you'll be there\nAnd show up when it's hard\nAnd show me you care\nShow me, show me\nShow me, show me, show me\nShow me\nShow me, show me, show me\nShow me\n\n[Instrumental]", "image": "https://images.genius.com/edcca611de8a88a9ff0e0173cc02f5a7.1000x1000x1.png"}], "artist": "Common"}