{"songs": [{"title": "Mitus Touch", "album": null, "year": null, "lyrics": "[Hook]\nThat new Rihanna in the front\nBitches in the back they don't like me though\nWhy? I can tell you 'bout stupid hoes\nWhy? I bet she don't act stupid though\n\n[Verse 1]\nCuz I cut a bitch\nI fuck a bitch, go and find another bitch\nAnd I never trust a bitch\nYou done touched a nigga 30 times\nOn some baby mother shit\nTalkin' bout you celibate\nBut you still suckin' dick\nThis that half a brick, quarter brick\nAye, come and place your order bitch\nMore of that gutter shit\n\n[Hook]\nNew Rihanna in the front\nBitches in the back, she don't like me though\nWhy? I don't know, she might be broke\nWhy? I can tell you bout stupid hoes\nWhy? I bet she don't act stupid though\n\n[Verse 2]\nShe know that I have sex with 'em\nIf you tryin' get lit then go ahead light it ho\nWhat you bitches fightin' for?\nNah, I can't even that’s why you can't sit with us\nYou need to just sit your ass down\nI heard you fucked that nigga well I fucked that nigga too\nAnd they probably didn't tell you that’s what suckers niggas do\nAnd if he had a chance with me he would have never fucked with you\n\n[Hook 2]\nCause that New Rihanna in the front (Bitch)\nBitches in the back, they don't like me though\nWhy? Side piece 'bout to let wifey know\nWhy? Thirsty hoes is tryin' get chose\nWhy? I bet she don't act stupid though\n\n[Bridge]\nCut that bitch in the bathroom\nCut that bitch in the bathroom\nI cut that bitch in the bathroom\nI cut that bitch in the bathroom\nI bet you need to quit playin', quit playin' with me bro\n\n[Outro]\nGot a nigga fucked up up in here\nYou know I'm sayin?\nA bitch say she don't like me, you ask her why, she go\n“I don't know,” just like some shit stupid bitches say\nKnowImsayin?\n(Look, I can't even deal with this shit right now. This bitch is crazy, she must have lost her fucking mind. I'm tired of going back and forth with this ho. What the fuck? I can't even deal. Who the fuck does this bitch think she is?)", "image": "https://images.genius.com/70c6e506a91f6dabdd23cad304812ce3.533x533x1.jpg"}], "artist": "Kanye West"}