{"songs": [{"title": "Open Fire", "album": "R U Still Down? (Remember Me)", "year": "1997-11-25", "lyrics": "Alright now, here we go\n\n[Verse 1]\nTell me, how many real motherfuckers feel me?\nI smoke a blunt and freak the funk until these jealous motherfuckers kill me\nI'm out the gutter, pick a hero\nI'm 165 and stayin' high 'til I die, my competition's zero\n'Cause I could give a fuck about you, you better duck\nGo or I'll be forced to hit yo' ass up, I give a fuck\nI'm sick inside my mind, why they sweat me?\nIt's gonna take an army full of crooked ass cops to come and get me\nNiggas know I ain't the one to sleep on, I'm under pressure\nGotta sleep with my piece, an extra clip beside my dresser\nWord to God I've been ready to die since I was born\nI don't want no shit but niggas trip and, yo, it's on\nOpen fire on my adversaries, don't even worry\nBetter have on a vest aim for the chest and then you buried\nIt's a man's world, niggas get played, another stray\nHope I live to see another day, hey!\nI'm gettin' sweated by these undercovers\nWho can I trust, got my mama stressin', thinkin' it's a drug bust\nGotta get paid but all the drama that's attached\nWe livin' a drug life, THUG LIFE, each day could be my last\nWill I blast when it's time to shoot? Don't even ask\nThat's the consequences when ya livin' fast\nSix bricks of tricks, for my niggas, I gotta come up\nAnd recoup, you keep the dope just bring me six figures\nIs it a bust? I hear the sirens, run for cover\nOver the fence and open fire\n\nAlright now, here we go\n\n[Verse 2]\nThese motherfuckers on my ass I'm in traffic, will it be tragic?\nI'm comin' round the corner like I'm Magic\nDoin' ninety on the freeway, and hittin' switches\nIn a high speed chase with these punk bitches\nDon't turn around I ain't givin' up, cause they don't worry me\nPussy ass bitches better bury me\nRunnin' outta gas time to park it, I'm on foot\nWe in the hood, how the fuck they gon' catch a crook? haha\nI got away cause I'm clever\nWent to my neighbors for a favor now you know players stick together\nI watch the scene from the rooftop, spittin' loogies\nAt the coppers that pursue me, beotch!\nI be a hustler 'til it's over, motherfucker\nOpen fire on you bustas\n\nAlright now, here we go\n\n[Verse 3]\nDon't try to follow me, I'm headed outta state\nI gotta pay my fuckin' bills, so I'm transportin' weight\nChange my plates, pick up my nigga, and now we rollin'\nDroppin' keys like they stolen, hehe\nTell me who do you fear? I'm outta town until the coast is clear\nEnough dope to last a year\nThey got me runnin' from the police, nowhere to go\nWith the lights out, rollin' down a dirt road\nBut I ain't goin' alive, I'd rather die than be a convict\nI'd rather fire on my target\nI hit the corner doin' ninety, ahhhh shit!\nThem bitches right behind me\nThey take a shot and hit my fuckin' tires\nNow, jump out the car then I open fire, sucka!\n\nHahahaha, Thug Life, bitch! goin' out like that", "image": "https://images.genius.com/4f924e981b74c6d754d2c9da26f83f15.500x500x1.png"}], "artist": "2Pac"}