{"songs": [{"title": "Miss America Reprise", "album": null, "year": "2012-12-07", "lyrics": "[Intro: J. Cole]\nSometimes you rip straight through\n(I told you how we was gon’ do it)\nAnd sometimes you just love rappin’ this shit so much you just\n(Drama I told you how we was gon’ do it)\nYou just like “fuck it” let me get that shit again\nGod, please forgive us\n\n[Verse: J. Cole]\nYeah, blood on my sneakers, no remorse for the grievers\nHe played the corner like Revis, he should've had better defense\nThat's how I'm feelin', blood spillin' I love killin'\nNiggas'll swear that they it, this is as rare as it gets\nRap game changed, this is embarrassing shit\nBunch of bitches posin' on some old Miss America shit\nI was a wilder nigga, back on my therapist shit\nMoving careless as shit\nIn a city where niggas really don't care who they hit\nWho the fuck was I?\nJust a young little nigga tryin' to see the other side\nOf the railroad tracks, where the scarecrows at\nNo brains on them niggas but they'll air your back\nFuck the man, Uncle Sam, I won't sell your crack\nI won't fight your wars, I won't wear your hat\nI'mma pass your classes, I'mma learn your craft\nI'mma fuck your daughters, I'mma burn your flag\nBeware of the days when the first go last\nAnd the last go first, damn the past sure hurt\nThat’s why I hit the Henny in this flask\nWith my foot pressed heavy on this gas\nLife is like a Brillo pad\nSometimes I sit and wish I had the life that Willow had\nSaid I walk around mad ‘cause I never see my dad\nAnd you wonder why my motherfuckin’ brother’s so bad\nAnd I was in the third grade first time I skipped class\nWhoa!\nSwitch topics, look, my bitch tropic\nStack so thick to fit need six pockets\nSmash whole cliques, so sick I get nauseous\nQuick as pickpockets, slick like Rick Fox’s hair\nDiamond chain, yeah the Roc is here\nYou lean back like a rocking chair\nYou niggas not prepared, no preparation\nThis is dedication\nSlit your fuckin’ throat and blame it on my medication\nIlluminati meeting, showed up late and met a Mason\nWho saw me and assured me that there was no better nation\nFor, crooks and thieves, looks deceive\nThey throw The Book at niggas with no books to read\nSee, there I go, every time I try to stunt\nCan’t help but kick the real shit\nMan, why I even front?\nMaybe ‘cause that’s all you little niggas ever want\nBut I’mma change the game\nSee you in a couple months, boy\n\n[Outro: DJ Drama]\nHopefully this here shows y’all somethin’\nDedication\nWhat’s ours, and what’s yours\nYou see the playing field was never really that even\nWe just let you play the game but you dropped the ball\nCole World\nBorn sinner\nAll the way\nDrama\nYou’re welcome", "image": "https://images.genius.com/2cd936e786e1ab454043327d585c7702.1000x1000x1.jpg"}], "artist": "J. Cole"}