{"songs": [{"title": "Analyze the Game", "album": "Chase the Cat", "year": null, "lyrics": "Why.. why she hoein man?\nWhy's she hoein, you ain't knowin?  Oh you know why\nWhy is she prostitutin her body.. BEITCH!\n\n[Chorus: Too $hort]\nAnalyze the game and tell me why; cause pimpin won't die\nAll these tricks want pussy to buy; the pimpin won't die\nYou can analyze the game and tell me why; cause pimpin cain't die\nAll these tricks want pussy to buy - pimpin won't die bitch\n\n[Too $hort]\nWhy she hoein, you ain't knowin..\n.. about all them dicks she be blowin, bitch where you goin?\nBring yo' ass back, here right now\nCook my food, and clean my house\nPut my dick, in yo' mouth\nHell naw bitch you ain't goin out\nYou better realize she's a ho by nature\nTakes one to know one fo'sho' I'm a player\nShe ain't really happy 'less she lickin a dick\nWith a sucker-ass nigga that be trickin an' shit\nYou can't train the pussy, by lockin it up\nRaw dickin the pussy, and knockin it up (nope)\nShe still gon' be a ho and a baby by you don't mean shit\nWhat kind of player are you?  Let's get rich\nRun the game with no glitch\nLook her in the eye and say BEITCH!\n\n[Chorus]\nAnalyze the game and tell me why; cause pimpin won't die\nAs long as these tricks want pussy to buy; the pimpin won't die\nYou can analyze the game and tell me why\nY'know the pimpin can't die BEITCH\nAs long as you believe I'll never lie - can't die..\n\n[Too $hort]\nAin't no need, for you to front (nope)\nKeep it real with these hoes, they give you what you want\nTell the bitch, you wanna fuck (yup)\nIf she say no.. so what?\nCause all you really wanna do is get this cash\nPull hundred dollar bills out a bitch's ass\nToo many niggas with the wrong agenda\nCan't love the bitch, turned around to pimp her\nMake your wife your ho, and your ho your wife\nYou can't do this dumb shit your whole life\nThat ain't pimpin - you need to let that go\nRun home to your wife and forget that ho\n\n[Chorus]\nAnalyze the game and tell me why (tell me why).. it won't die\nAs long as these tricks want pussy to buy; this pimpin won't die\nYou can analyze the game and tell me why; the pimpin won't die\nAs long as you believe I'll never tell a lie - it cain't die..\n\n[Too $hort]\nNigga you all straight lines and fo' corners\nSquarer than a motherfucker, Oakland California\nThat's where I got my name, I never could change\nRunnin through the streets of the O is to blame mayne\nYou always frontin - whassup wit you?\nYou either do what you told or tell people what to do\nAre you a boss or a worker - you big pimpin\nAll by yourself and ain't got no women\n\n[Chorus]\nAnalyze the game, please tell me why.. the pimpin won't die\nAs long as these tricks want pussy to buy.. pimpin cain't die\nYou can analyze the game and tell me why.. y'know the pimpin won't die\nAs long as you believe I'll never lie - pimps up hoes down beatch\n\nAnalyze the game and tell me why (tell me why) - it won't die\nAll these tricks want pussy to buy; the pimpin won't die\nAnalyze the game and tell me why (tell me why) - cain't die\nAll my bitches know I don't lie - this pimpin will never die\n\nBeitch!", "image": "https://images.genius.com/5879836b504c477d7cddacb459c66e7c.776x768x1.jpg"}], "artist": "Too $hort"}