{"songs": [{"title": "Piss’n On Your Ego", "album": null, "year": null, "lyrics": "[Verse 1: T.I.]\nAutomatic bullet flow\nUzi, Calico\nLadies man, Yeah, but to that pussy I'm a bully tho\nBeat it, eat it, let it go\nRetarded, stupid, silly tho\nThis city been on life support\nI'm gonna get out and kill it tho\nReally tho, off the chain\nGetting it, doing heavy things\nStuntin out the frame\nStill to bust a nigga cabin mayne\nGod like charlemayne\nIn the A the hottest thing\nEver hit it, ever did it no these nigga [?]\nI ain't finna front, nigga lame if you ask me\nI'm way in the front, run shit, no athlete\nPassionly, nigga watch my smoke as I go and get money to the top I go\nTell you get dough, nigga stop I know the housekeeper get more\nNow come and mop my floor\n\n[Chorus]\nSittin up high, small money we don't see no\nStupid, dumb fly ask yo bitch nigga she know\nNigga know my stylo, swagg on GO\nShittin on yo pride nigga pissin on yo ego\nWe be Pissin on yo ego, pissin on yo ego\nShittin on yo pride nigga pissin on yo ego\nWe be pissin on yo ego, pissin on yo ego\nSucka nigga hatin we know but we pisson on yo ego\n\n[Verse 2: B.o.B]\nI'm back up on my rap shit, you bastards got it backwards\nGot it twisted and exaggerated\nStretched out: elastics\nYou niggas ain't on my radar!\nI bypass niggas, no gastric\nI pull up front in that monster truck\nAnd I park that shit Jurrassic\nGot a drunk bitch on my mattress\nDoing backflips, gymnastics\nShe holding on to that monkey bar\nYelling out my name: no ad-libs\nNiggas get mad at us for what?\nWe live out life at the after-party\nDon't come at me with that ego shit\nI piss on that like a port-o-potty\nThis beat is retarded so therefore my flow is autistic\nCome on down to Bobby's World\nYou and your friend all a visit\nFlow like I'm on a mission\nSo there is no competition\nIt's looking like hunting season\nAnd we in the slaughter business\n\n[Chorus]\n\n[Verse 3: T.I]\nBall hard: pavement\nBroads in amazement\nLarge money talking, I ain't gotta make a statement\nMy impatient grind, I'm taking mine\nI ain't finna wait for mine\nAnybody wanna shine, I suggest you wait in line\nI'm chasing dime paper\nBut for these haters I don't break a stride\nDefecating on your pride, make you commit suicide\nDo or die, who am I?\nBullet hit the Bulls-eye\nI'm doin' my thing, Say I ain't my nigga you a lie\nDo it by the hood, I grew up to say what's up\nAnd all the real niggas know me, I don't need no introduction\nBulletproof truck with a couple cute sluts in the back\nDoin' everything I ask for a wrap what's that\nThey handle that and I struck that cat so good I get my money back\n\n[Chorus]", "image": "https://images.genius.com/68262ccdcbffb87427d31b0d6085c2e3.400x400x1.jpg"}], "artist": "T.I."}