{"songs": [{"title": "Who You Think I Am?", "album": "Operation: Doomsday.", "year": "1999-04-20", "lyrics": "[Produced by MF DOOM]\n\n[Intro: Megalon]\nWho you think I am, but who you want me to be?\n\n[Verse 1: King Ceasar]\nWhen I rock, jock niggas in shellshock\nDon't watch the birdie watch the clock go tick tock\nI rip shop, I make ya girls bottom lip drop\nYo word to the truckers at the pit stop I'm hip hop\nI hold heat, never forget what niggas told me, they showed me\nOther emcees trying to fold, me they owe me\nYo, plus them niggas mad slow G\nI got my \"Get U Now,\" so I'm comin with my homie\nHere's the plan; stick 'em up, I enter, through the window\nStoop down so we can't see our crescendo\nPass the indo, yo we used to be our friend though\nYeah but thats the reason I don't really like to lend dough\n\n[Verse 2: Rodan]\nFrom the corners cylindrical triangle hats\nSays dunce. Lyrics precise like forensical science leave you entangled for months\nTryin' to figure who done it, you fronted\nGot cha shit stunted, didn't have to be that way\nSome saw the light comin' in, they shunned it\nFor the wickedness to those whose despise life and worship death\nThe established matched at eye for eye, tooth for tooth, breath to breath\nThese are the last days of the countdown, shit is just that drastic\nWrite journals, like they use the prophets, study math like a Aztec\n\n[Verse 3: Megalon]\nLoved not for who you think I am, but who you want me to be\nA true thuggin emcee, true thugs, with no strings attached\nI wanna give you my slugs and don't wanna take em\nBox sprays, but with my box cutter in my boxes\nShots sprayed, who on cops high says we rastas\nRock away boulevard, got love and obnoxious\nBout five cops today, my rock away\nNiggas and rock rage, got paid\nA rock, you know why I rock, meet me at the Lobster's\nI suggest I should dress proper\nCopped a buzz, I copped a dutch\nI got a lotta love, with no strings attached\n\n[Verse 4: Kamackeris]\nRhymes, rhymes, rhymes, we got plenty\nDimes, dimes, dimes, too many\nSparked up and chat, you keep countin\nI do my thing, jealous niggas keep doubtin\nRock 'n' roll, lock 'n' load\nEmcees out for pots of gold, we stop 'em cold\nIn they tracks an take all they chips-eses\nAll they dats, all they bullshit mixeses\nGive 'em a credit, not debt it\nWe just flipped the calistetic\nToss the Andy Pettitte, you said it\nWe grandslam in the never boss stand\nAny pussy emcee's we abandon\n\n[Verse 5: King Geedorah]\nFlew in from Monster Island just to rag shit wit jet lag\nWith brothers specializin ways how us not to get bagged\nEgads! I bring confusion like roll call\nTo emcees so-called, hoes be like \"yup I told y'all\"\nSo socialize my bio so I dip dip dive\nMemorize like I-omega zip drive\nGo to the bar to drink to get soberer\nKing Ghidra eat the head of a king cobra like ginkoba\n\n[Verse 6: Kong]\nKong get a cut like Kobe, now hold heat\nSo sweet, roll deep but no beef\nThose that doze deep, close sheets\nPo chose to speak with, reach over to reload the piece\nSlip from freak to deak, keep concrete\nParallel to body til the next male\nShotties and hotty, still waitin to exhale\nSmell the blood bath a slug's caught\nSlugs passed and bloodsport\nBugged laugh, a bugged thought\nCaught some eyes make the case last stack a locker\nBocker, drink a vodka, hit note, like Sinatra at a opera\nDrop a flocker, Orville Redenbacher\nGet you, got you, shot the two L's without the proper\nFor the albums knocker\nHit the liquor, quicker than a quicker picker upper\nGirl and stick er, I leave more nuts than a snicker\nKick er to the curb, punk a bitch, stomp a chick\nFor now call me Kong, Monster Isle, Monster Click (Bow!)\n\n[Outro: Megalon]\nLoved not for who you think I am, but who you want me to be\nTrue thuggin emcee, true thugs, with no strings attached\nI wanna give you my slugs, and don't wanna take 'em back", "image": "https://images.genius.com/c0a80e3098696bdf600f54a76667c069.1000x1000x1.jpg"}], "artist": "MF DOOM"}