{"songs": [{"title": "Super High (Remix)", "album": null, "year": null, "lyrics": "[Verse 1 - Currency]\nYou think you got the bond cause I rolled you a joint?\nI smoke with all mine, baby girl, what's your point?\nDon't front, you in the back of a long line\nTrying to get in, cause only members inside\nTrees get twisted up like fingers in gang signs\nPurple Kushions broke my fall, I fell from a grapevine\nSuper high, from the free throw line, I'm\nDrexler status, glide the espionage\nMany a jealous eyes scrutinze the wise\nBut the Jets in the house like the curtains and the blinds\nIt hurt to see me shine, that's why they frowning all the time\nIn they internet videos, digital CB4s\nAngry orangutans, I'm arranging my sneakers\nI'm the action on the court, you the gum stuck to the bleachers\nI think I'm Paul Pierce, I think I'm Rondo\nHigh off that headband, you dying on that hydro\n\n[Verse 2 - Wiz Khalifa]\nI thought of this fresh off a bong rip\nMy bitch next to me, getting undressed for me\nRunning bath water, playing her favorite songs\nWhile I get another one lit\nDon't usually smoke at all but say tonight she'll take a hit\nThat's understood\nFrom the smell, and by what I paid\nYou know it's good\nThem niggas with me? They from the hood\nNow we through parties in the sky\nI'm on the 42nd floor, now that's super high\nChampagne, more paper planes than you can fly\nThem young niggas fell soon as they tried\nWhen the paparazzi flash, I'll be counting all this cash\nPlotting a million about how I can build a mountain out of hash\n\n[Hook - Ne-Yo]\nAll these cars, all these stars, all around me (super high)\nPut your eyes to the sky, that's where you'll find me\nCause we are super high\n\n[Verse 3 - Rick Ross]\nI'm getting money, no Illuminati\nMy pain never went in vain, it's all over my body\nGet the spliff in my Mr. Bughatti\nKick it with my lil' homies, a Mr. Miyagi\nI gotta buy my niggas each a pound\nTweaking up our sneaker style, passing reefer 'round\nSpitting only lethal rounds, speakers beating down\nNot talking munchies when I say my niggas eating now\nPromoter gave me 40 thou, I think we even now\nPina colada, paper smoking, Garden of Eden now\nTaylor Gang is what we bleed about\nJet setters in places you only read about\n\n[Bridge - Wiz Khalifa]\nAnd now, everywhere I go\nIt's so strong, they ask me where I get my smoke\nBitches don't have to guess, they know\nI keep one rolled up, we can do whatever you want\nSmoking pina colada papers, baby girl\nWe don't fuck with them blunts\nUnless I'm with the Boss\n\n[Verse 4 - Rick Ross]\nIf you looking for me, you can find me in the Guinness Book\nOnly fly bitches ride with the Boss, take a look\nI'm super fly, I'm super high (Super duper, super duper high)\nYou getting yours, I'm getting mine", "image": "https://images.genius.com/3dce21029cdd8aab73eb473e015807d5.1000x1000x1.jpg"}], "artist": "Rick Ross"}