{"songs": [{"title": "Who’s Real", "album": "The Last Kiss", "year": "2009-06-16", "lyrics": "[Intro: Swizz Beatz] + (Jadakiss)\nHe's phony, she's fake\nThat's the type of people I hate (uhh)\nHey, hey, Jada Jada! (AH-HAHHHH!) Jada Jada!\nPoint 'em out, point 'em out (uh)\nPoint 'em out (uhh)\n\n[Hook: Swizz Beatz]\nHe's phony, she's fake\nThat's the type of people I hate\nIf you real and you know it clap your hands {*clap clap*}\nIf you real and you know it clap your hands {*clap clap*}\nWait a minute - who's real, who's not?\nShe's real, but he's not\nIf you real and you know it clap your hands {*clap clap*}\nIf you real and you know it clap your hands {*clap clap*}\n\n[Jadakiss]\nAH-HAHHHH! Uhh, yeah, yo\nGuns gon' clap, packs gon' move\nBlood get drawn, skin gon' bruise\nReal gon' win, the fake gon' lose\nThe love overpowers the hate by twos\nAll they left was the yellow tape and his shoes\nIt's real when the funeral and wake make the news\nLoad the trey-pound so we six up on 'em\nSo when they act phony we just switch up on 'em, what\n\n[Hook] w/ ad libs\n\n[OJ Da Juiceman]\nWho's phony, who's fake?\nSilver Hummer, on eights\nLife's good, I'm straight\nClap your hands one time you relate\nCan't keep it 100, them the ones I hate\nBut I'mma keep it 200 for the ones that fake\nRed and black car on the red chrome skates\nYoung Juiceman push a burner on my plate\n\n[Hook] w/ ad libs\n\n[Jadakiss]\nUh, yeah, yo\nPocket full of cash, wallet full of plastic\nIn and out the lanes, dippin through the traffic\nWe ain't hustlin no more, we doin gymnastics\nCouple of flips and then stash it, bastards\nReal gon' recognize real\nPhony gon' recognize steel, I reckon I will\nExpose those who are, if you ain't or you are\nI done gone too far, sorry, MWAH\nGet yourself a fresh flesh wound or a new scar\nBullet holes all on the side of your new car\nLoad up the AR, spray y'all, okay y'all?\nIt's real on this side, phony wherever they are, what!\n\n[Hook] w/ ad libs", "image": "https://images.genius.com/74f6cb8e37420dc73fd4019537e3cbd1.953x953x1.jpg"}], "artist": "Jadakiss"}