{"songs": [{"title": "Wicked Ways", "album": "The Marshall Mathers LP2", "year": "2013-11-05", "lyrics": "[Hook: X Ambassadors]\nI'm getting by with my wicked ways\nI'm loading up and I'm taking names\nI wanna dig my way to hell\nI wanna dig my way to hell\nI'm getting by with my wicked ways\nI'm loading up and I'm taking names\nI wanna dig my way to hell\nI wanna dig my way to hell\n\n[Verse 1: Eminem]\nGuess I got a way with words, I could get away with murder\nEver heard of Aspergers'? It's a rare condition\nIt's what you're sufferin' from when you simply don't care if it's an\n80 degree day and there's no frickin' air conditionin'\nAnd you can't see the bitch’s hair is frizzin'\n'Cause you got the windows up, blarin' the system\nIn your Chevrolet Prizm\nThe devil ain't on a level same as him\nPicture someone who revels in straight masochism\nAnd imagine him givin' an adjective an ass-whoopin'\nSo bad they should put his ass in prison\nA word bully, I verbally abuse verbs\nLike they did somethin' to me personally\nUsed to get bullied, so I'd cut class and ditch it\nNow I bully rap, I'm the shit, faggot (Sniff it!)\nCadillac from a K Car\nMy ass from a hole in the ground, still can’t tell 'em a-part\nCame straight out the trailer park\nScreamin', \"I'm proud to shop at K-Mart,\" and it became art\nAnd I'm still fed up and as pissed off as they are\nTo this day I still get in fights with the same broad\nAt the same Walmart, arguin' over the same cart\nIn the middle of the aisle whilin', I don't give a fuck, I don't play\nBitch, you think you saw this basket first?\nYou're ass backwards like motherfuckin' Bob and Silent Jay\nIllest shit you could think I would say\nMind's like a pile of clay\nWhen's the last time that you saw a villain with a cape\nRipped a gapin' hole in it, flipped out\nRipped down the drapes, tied 'em around my neck\nWent down the fire escape of the Empire State\nSlipped, fell straight down to the ground\nSplattered all over the entire state\nAnd straight to hell, got impaled by the gates\nSaw Satan, stuck his face in an ashtray\nWhile I sashayed around flames with a match\nAnd I gave him the gas face\nAnd this ain't got nothin' to do with a scale\nOr being gay, little faggot, but by the way\nThoughts are gettin' darker by the day\nI'm a combination of Skylar Grey\nTyler the Creator, and Violent J\nIt's a fuckin' miracle to be this lyrical\nPaint my face with clown makeup and a smiley face\nI'm insane, every rhyme I say\nSons you like an ultra-violet ray\nI’m sellin' hatred, buffet style, all the shit you can eat\n$11.99, so come on and pile a plate!\nI’m throwin' down the gauntlet to see what hell I can raise\nWith the rhyme I’m spittin' while I’m shittin' on competition\nIn the meantime it’s always mean time, I'm gettin'—\n\n[Hook: X Ambassadors]\nI'm getting by with my wicked ways\nI'm loading up and I'm taking names\nI wanna dig my way to hell\nI wanna dig my way to hell\nI'm getting by with my wicked ways\nI'm loading up and I'm taking names\nI wanna dig my way to hell\nI wanna dig my way to hell\n\n[Verse 2: Eminem]\nI’ve been a career asshole\nI don’t see why these people always got my back\nI done said so much fucked up shit\nI was born a mistake, but I was put here not by accident\nI had a purpose and that purpose\nWas to beat a beat purplish, slaughter tracks\nI done put my two dimes and a nickel in this shit\nI’m comin' to get that quarter back\nLike Ndamukong, the drama can build\nYour mama can ask me for my autograph\n'Cause that cougar's a MILF\nShe's the oldest trick in the book, but I sure would fall for that\nYou done brought a bat to a rocket launcher fight\nWhen I get on the mic I'ma snap\nMake you wish the ambulance that took me to the hospital\nWhen I overdosed woulda caught a flat\nIf it makes you sick to your stomach acid\nIndigestion, my suggestion’s Kaopectate\nIf it feels like I'm runnin' away with the game\nIt's 'cause I am, don't speculate, spectate\nAll I got is dick for days and insults for decades\nBut I get by with my wicked ways\nLady, you can suck a dick 'til your neck aches\nCry 'til you get puffy eyes, red faced\nBut I'm leavin' on this jet plane\nYou ain't fly, you're an airhead\nAnd I'm sick of poundin' a square peg in a round hole\nSorry, another catchphrase\nBut your baggage ain't gon' fit in my storage overhead space\n'Cause it just ain't big enough to fit your damaged goods\nOther words: don't try to put your heart in a headcase\n'Cause baby, stable mentally I ain't\nI need my meds, I peed my bed\nI'm going blind, I don't see my legs, I keep on falling down\nNo wonder you can't stand me, I need my cane\nSomeone help me, I think my face is melting\nIf you felt these migraines\nAnd see these maggots eat my brain\nThis G-I-A-N-T hole in my empty head\nIf you read my mind, you can see my pain\nAnd you'd see why I be this way\nEver since I was knee-high playin' with G.I. Joes\nTold these hoes shut their P-I-E holes, now peep my game\n'Cause I'm 'bout it 'bout it\nLike a fuckin' (fuckin') echo (echo)\n(Psych) Psycho on a cyclone cycle, spiralin', here I go\nI'm outta control like no other mic go\nStab you 'til the knife goes – dull\nI'm nothin' but a hole inside your skull where your eye goes\n'Cause I'ma sock it to you!\nDyke ho, you don't like it?\nGet on your Harley Davidson menstrual cycle\nAnd ride it like a motorbike\nI'm finna blow the mic the whole night, so\nStrike up the fuckin' maestro, I'm nitro\nAnd hi, ho, hand me my shovel!\nI'm liable to dig my hole deeper\nAnd it's off to H-E double hockey sticks, I go\n\n[Hook: X Ambassadors]\nI'm getting by with my wicked ways\nI'm loading up and I'm taking names\nI wanna dig my way to hell\nI wanna dig my way to hell\nI'm getting by with my wicked ways\nI'm loading up and I'm taking names\nI wanna dig my way to hell\nI wanna dig my way to hell\n\n[Outro/Skit: Eminem & Ken Kaniff]\nOhh, please be empty\nPlease be empty, please be empty\nThank you, God!\nShit… Is that a girl?\nI'm gonna rock this blouse and put a cock in my mouth\nAnd get my balls blew out, and get gay into the A.M.\nAnd lay with eighteen guys naked\nAnd let myself show, let myself show\nButtfuck it, suck it, pull it, tug it\nLife's too short to not stroke your bone\nSo everybody, everybody\nCircle jerk, touch my body\nWho is that? Where are you going? Come back!\nWhy does everyone always leave me?\nHello? Fuck you then!\nBlow it out your ass!", "image": "https://images.genius.com/a24c8428273f315c50a002663b515ffb.1000x1000x1.png"}], "artist": "Eminem"}