{"songs": [{"title": "I Wanna Do It", "album": "Pimpin’ Incorporated", "year": null, "lyrics": "[Chorus: Too $hort]\nI wanna do it {*repeat 4X*}\n\n[Too $hort]\nShe wanna do it like that, I love the way she do me\nWith that pretty-ass face and that big fat booty\nGot me horny, I wanna have sex wit'chu\nAnd do all them things, we never ever get to do\nWe already talked about it, you said you wit it\nGet butt-naked in the bed and let me hit it\nLast time I saw you, you was quick with the jag\nWanna hit it from the back, let them big titties sag\nBitch hella thick, lotta junk in her trunk\nWhen you start don't stop cause I just wanna cum\nAnd then fuck you again, bust a nut on your chin\nGet my dick back hard and run up in your friend\nWe can all get together on the late night\nA whole lotta fuckin and suckin, 'til it's daylight\nI'm $hort Dawg, you better hand me that cat\nYou so sexy when you up there dancin like that\n\n[Chorus]\n\n[Too $hort]\nDid you think I wouldn't be in here spankin that cat\nTryin to put her motherfuckin ankles on her neck\nI made her lick it, suck it, swallow it, she asked me\nHow it get so damn hard again, I'm nasty\nBut I'm not a freak\nI just say a lot of rhymes to a lot of beats\nIt comes easily, I'm a pimp in these streets\nI'ma keep makin money in this industry\nSo when she bends her knees, I'll be standin up\nGettin head for 30 minutes, bitch can I fuck?\nI know I came in your mouth I can't trust you slut\nThat's why I'm 'bout to raise up, when I bust a nut\nWipe your face with a napkin from KFC\nI give a fuck what happened, bitch c'est la vie\nI'm out!  What'chu complainin about?\nYou should be happy, I left some DNA in your mouth\n\n[Girl] You wanna do what muh'fucker, you wanna fuck?\nI wanna do it\n[Girl] Shit it ain't free\nI cain't lie\n[Girl] If you got that money you can get in this real quick\nI wanna do it\n[Girl] But I don't fuck with broke-ass niggas\nSo what'chu wanna do?\n[Girl] What'chu tryin to do?\nI wanna do it\n[Girl] Motherfucker you cain't get in this shit!\nThat ain't fly... I wanna do it\n[Girl] Nigga you better have yo' cash first, ass last\n\n[Too $hort]\nHell nah bitch you can't get over on me\nI'm always sharp, I'm even sober when I drink\nYou runnin game on me, I gotta go\nBitch slick talkers might talk you out of your shit\nBut not mine, I keep ridin clean\nI don't need you BITCH you need a lot of things\nAll I need is mo' money, and some choosin hoes\nWhat I look like buyin bitches new shoes and clothes\nEverythang on a bitch that's how it used to go\nBack when them old school niggas rode trues and vogues\nI'll be talkin this pimp shit daily\nBitch you can't play me, what'chu do for me lately?\nI know what it is, don't wanna hear about sex\nIt's two different things with a player and a trick\nShe can hold out her hand... and I won't pay her shit\nI just say bee-itch!\n\n[Chorus]\n\n[Too $hort talking over Chorus]\n$hort Dawg in the house\nYou listenin to, Pimpin' Incorporated, the mixtape\nNo it's not the new album, this is not the new album\nUp All Nite album #16 comin soon\n\n[Too $hort]\nYeah this $hort Dawg\nSpittin that game baby\nAlbum #16 on the way\nUp All Nite, in stores soon baby\nNo doubt, ain't nobody got more rhymes than Too $hort\nAin't no rappers with mo' songs than $hort Dawg\nThat nigga's been doin this shit forever!", "image": "https://images.genius.com/b06c57cf2cfd6ca6f1870496190e3b04.700x700x1.jpg"}], "artist": "Too $hort"}