{"songs": [{"title": "Pu$$y (RNT)", "album": "Lost In The Atlantic ", "year": "2014-09-17", "lyrics": "[Produced by MoeZ'art]\n\n[Verse 1: Lupe Fiasco]\nLord have Murcielagos waiting on the nigga\nAt the end when the time come\nGet the drop on the weed spot\nLike there's too much water in the tea pot, huh\nLord have Murcielagos on the poor, nigga, pour, nigga\nThey adore the event of war\nDown force on the doors of adored niggas\nDoes the Lord like to thank award winners?\nAnd the war winners'll rewards inner\nOr the all-enders ain't the pure chemists\nSo the form in this can be raw in this like the porn business\nKeen to king 'til the, 'til the pawn hit us\nIf he goes, half a million sold, sold the soul, going gold\nIn the end will it go to the pawn business?\nYou ain't doing nothing with it\nLet a nigga get it for the low-low-low-low\nLames tried to form it, brains couldn't storm it like a Ororo-ro-ro-ro-ro-ro\nIn the Philippines eating chicken wings, smothered with adobo-dobo-dobo-do\nVatos, fiascos, vocos locos like a cho-lo-lo-lo\nGadget go, go, go, go, go, ratchet ho, ho, ho, ho, ho\nSanta ho, ho, ho, ho, ho, K-Ci, Jo-Jo-Jo-Jo-Jo\nBrown skin brother in a fed box at the hell lil' nigga live there for months\nExcept these young, black males wouldn't drive if you give them trucks\nNigga, nigga, nigga what, I don't give a, give a, give a, fuck\nWith a, with a mind full of money, pockets full of nothing\nNiggas gonna feel what a nigga feel\nAlways been a winner ever since beginner\nAll the way to the end and never ever been a pussy\n\n[Hook: Billy Blue] (x4)\nPussy nigga, pussy pussy nigga, pussy pussy nigga get fucked\nReal nigga, Twitter, what?\n\n[Verse 2: Lupe Fiasco]\nLord, please keep these diablo niggas off a nigga mind\nLord, please keep these diablo niggas off a nigga spine\nLord, please keep me Fiasco outta rest of these nigga lie\nThese nigga lie, these nigga lie, these nigga lie, these nigga lie\nLord, please forgive me for the sinning\nSinning please forgive me for the snitching to the Lord\nOpenin' for business scissors to the ribbon niggas wanting to get in, open up the doors\nSon wanna feel 'em, open up the ceiling\nNiggas start tripping, open up the floor\nTrap like Indiana Jones looking for a map\nThat I sketched on the back on one of my raps under my hat\nCoffin is the cousin to the bed that's under my back\nDream so real niggas die taking one of my naps\nMattress full of money, monster under that sheets full of raps\nComfort for the weak, sleep for the whack\nParty while you slumber, tell 'em money coming, jump in my sack\nNiggas wanna exercise, exercise I-X-I ain't no jumpin' my jack\nIf I lift an arm I'mma lift a car, nigga, that's a gun in my lap\nHurdle to the tire, chariots of fire\nI'm a flyer, take you under my flap\nIs he going nuts? Is he going bolts?\nNo, going both running my track\nNigga, nigga, nigga, nigga, nigga, nigga, nigga, nigga, nigga what\nI just figure, figure, figure you gon' be a nigga, nigga, nigga, nigga what\nAnd since niggas is faster than them white folks on the tracks\nWhite folks tightrope, like both, I could be a sprintin' nigga\nNik Wallenda, runnin' over rap\nI higher, higher wire, you a wire on a power pad running over that\nRunning over that, running over that, running over that, running over that\nFive time winner, five-nine, fine line thinner\nEinstein mind, mind bender\nFine dine, nine, wine, find cocaine in my mind's antenna\nPussy!\n\n[Hook]", "image": "https://images.rapgenius.com/e33ef27f4978381a66fd648ad2b08c11.500x500x1.jpg"}], "artist": "Lupe Fiasco"}