{"songs": [{"title": "Won’t Stop", "album": "Doctor’s Advocate Unreleased", "year": null, "lyrics": "[Hook]\nI won't stop. No matter what they say\nAnd I'm still fucking with Dr. Dre\nIt's Aftermath, so nigga stay the fuck out my way\nI'm telling you, blood\n\nI won't stop. No matter what they say\nAnd I'm still fucking with Dr. Dre\nIt's Aftermath, so nigga stay the fuck out my way\nI'm telling you, cuz\n\n[Verse 1]\nMan, look at the wheels, the motherfucking wheels\nBlack low and half blood, you niggas know the deal\nFuck lamborghini doors, nigga I ride stock\nAnd fuck you lil rap niggas, homie I buy Pac\nDre told me long time ago,\"Joy is pain\nYou sell 5 million records, some shit gon' change.\"\nHe was right, I traded the coupe and bought me a range\nNo ice to black diamonds in my Aftermath chain\nYou know I'm gonna ride and ain't shit changed\nBut the right to claim both sides\n(East Side, West Side!)\nAsk these, niggas know me down in Bed Stuy\nBlowing sticky with them Crooklyn kids\nHit switches on the Brooklyn Bridge, speakers bangin'\n\"I'm going going,\" B.I.G. took you there\nAnd Game recognize Game, don't play me homie\nOr think cause I'm a millionaire, I won't spray you homie\nYou know\n\n[Hook]\n\n[Verse 2]\nIt only been 12 months, I done lost a few friends\nHad my baby mama bust the windows out of my Benz\nHip hop police on me every city I'm in\nWell, hell, me and Dre, we dipping again\n3 wheel motion, chrome spokes on the rims\nRun up on us watch that 38 revolver spin\nI'm rich Game bitch, I made a few mill'\nNow the '64 Impala got a Paul Wall grill\nThey say I moved out the hood\nI ain't keeping it real\nSo I took the projects\nPut 'em on top of the hill\nI'm hungry, still rap like I ain't got no deal\nYou can pop that Cristal, but nigga I pop steel\nI'm going diamond, I put that on my first born child\nI'm almost there, I ran 99 miles\nBitches, they used to diss me, they feeling me now\nThey say I rap like the ol' Snoop\nOn Doggystyle. Ha ha!\n\n[Hook]\n\n[Verse3]\nThis could be the day you get rich or\nThis could be the day you try\nThis could be the day you walk away or\nThis could be the day you die\n\nYeah motherfucker, you hear my shit in the club\nWhen you do, 9 out of 10 times, I'm in the club\nStop fucking with Cristal, I can't pay that price\nI take twenty 40 ounces and a bucket of ice\nPour it on my niggas, now they flooded with ice\nNiggas hate me to my death, cause I'm loving my life\nI can walk through any hood, I paid that cost\nI ain't felt this good since I got shot in the heart\n25 years old, put the tail on the Porsche\n25 covers from Double XL to The Source\nDr. Dre chose me, to carry the torch\nI spit, cause the D.O.C. lost his voice\n\n[Hook]", "image": "https://images.genius.com/2e8536f82c41897ab6c3869a347337ea.500x500x1.jpg"}], "artist": "The Game"}