{"songs": [{"title": "Nas Tribute", "album": null, "year": null, "lyrics": "[Hook: Nas Sample] X2\nIf I, ever make a record\nI'll take a check and put something\nAway for a rainy day to make my exit\nBut look at me now, but look at me now\n\n[Intro: KRS-One]\nHere we go, yo, yea, KRS in the building\nMarley Marl, whuttup, Marley Marl, yea, look up\n\n[Verse One: KRS-One]\nYo Nas, this KRS shouting you out\nB.R.O.N.X. I couldn't make it to the jam\nTo be live on your set\nBut take these sixteen as a sign of my respect\nYou're Illmatic and you still got it\nThe crown of Hip-Hop, there's still time you could still grab it\nDon't be distracted by them faggots\nYou still fly, they remain maggots\nNas, you will not lose\nYour contribution to Hip-Hop makes you the top two\nAnd with KRS, we're the\nTop two\nThese mothafuckas find themselves laid out on FOX news\nYo Nas, Hip-Hop can't be dead, you brought it back\nWith the words you said, you are Hip-Hop fo'real\nAnd that shit between you and Jada, y'all gots to chill\n\n[Hook: Nas Sample] X2\n\n[Interlude: KRS-One]\nWe're all brothers, we're all brothers, rise up, Hip-Hop\nNas you're the man, word up, Hip-Hop, One Nation\nBig up, from the Bronx, to Queensbridge, Marley Marl in the house\nCome together, rock on, Bronx, Queensbridge come together\n\n[Verse Two: KRS-One]\nUh, you brought Queensbridge back\nAnd like my man Fat Joe, you made the Bronx lean back\nNastradamus I seen that\nYou was ahead of your time then man, a Prophet, I mean that\nPeople ask where's Dr. King's dream at?\nI think it's Hip-Hop, we already seen that\nYo Marley, I know you're in the building\nYo Kelis, I know you're there chilling\nShout-out to the Queen on the scene\nHip Hop is Dead I know what you mean\nI seen Hip-Hop die about five times already\nBut yet, we still rock steady\nStay ready, we're about to resurrect career, the real, fo'real\nThey gon' feel the steel\nK.R.S. - N.A.S., North, South, East, West\n\n[Hook: Nas Sample] X3\n\n[Outro: KRS-One]\nCongratulations, you gon' do it this year\nHip-Hop come together, it's real, we're one family\nFuck all these beefing and shit\nWe're one family, let's come together, word up\nRock on, Marley Marl, another house for hits production\n\n[Outro - Nas Sample]\nI'm the N the A to the S I R\nI'm the N the A to the S I R\nI'm the N the A to the S I R\nI'm the N the A to the S I R\n\nFresh for 2007, you suckers..", "image": "https://images.genius.com/e9fa55af2e8bfddf3b40ea0e0347874f.556x556x1.jpg"}], "artist": "KRS-One"}