{"songs": [{"title": "Do It Now", "album": "Black on Both Sides", "year": "1999-10-12", "lyrics": "[Intro: Mos Def]\nBack up, back up, back up, back up\nBack up back up back up back up EASE off\nThis goes out to all area crew (yes yes)\nTo my BK crew (ooh-OOOOOOOH-WHEEE) to my QB crew\nMy LI crew, my Shaolin crew\nMy Dirty South crew\n(What cha'll niggas know about the Dirty South?)\nAtlanta, North Cakalak'\nFor all my fam, all area crew (AOWWWWWWWWW)\nYeah mon!!\n\n[Verse 1: Mos Def]\nYes, the first cut should be the deepest\nTo penetrate beyond the muscle wall's inner regions\nFirst you was icing me, connect with the staring at the speakers\nHeard the rhyme, head high, what ya starin at ya sneakers\nYou shy now, got a lot of things on your mind now\nYou don't feel fly now, you hunting the exit sign down\nFuck what you heard, cause I snatch the grapevine down (yea yeah)\nDon't understand how I ran the line down? Rewind now\n\n[Verse 2: Busta Rhymes]\nYo, we be the most magnetic, so athletic\nLeave your peeps on the side so they can watch you and your mans get it\nTake the arch rivalry stance up on the podium\nAnd give the flavor to niggas but keep it low on sodium\nPossess shit that got you wondering how we holdin em\nThings that'll lay you out like a piece of linoleum\nBring who-ever you want, we bout to bug son and bounce\nDown to Henry Hudson, after I bust one!\n\n[Hook: Mos Def & Busta Rhymes]\nAy Mos Def!, alright okay\nHow you feel?, feeling great\nWhat you want?, I wanna do it to death, what's up with you?\nYou know my steez, true indeed\nSay it loud, black and proud\nAin't no time to hesitate at the gate, do it now!\nBus-a-Bus, What-a-gwan?\nHow you feel? Feeling great\nWhat you want?, I wanna do it to death, what up wit you?\nYou know my steez, true indeed\nSay it loud, Black and proud\nAin't no time to hesitate at the gate, do it now!\n\n[Verse 3: Mos Def]\nAy dios mio, me and Bustarimo muy peligro\nThe two hottest negroes en Los Estados Unidos\nHotter than Reno when discovered by Bugsy Siegel\nI'm black like Don Cheadle shoutin power to the people\nMy rhymes dipping like the lifeline on the e-boat\nThe raw sugar cane, NutraSweet, never Equal\nIf you in a Benzito or your mother's Buick Regal\nI get up like Chino shoutin power to the people\n\n[Verse 4: Busta Rhymes]\nYo, me and the Mighty Mos shine like a light post\nLive nigga shit be straight fucking up the white folks\nThat's why they with it now, because niggas like me and you\nWe did it now, brought it to that level so they get it now\nWe graduated saturated the game now\nInfatuated with the fame now let me explain how\nWe doing this, at any time or any place ready willing and able\nLet's get the dough secure the food on the table\n\n[Hook: Mos Def & Busta Rhymes]\nAy Mos Def!, oh my god\nHow you feel?, feeling great\nWhat you want?, I wanna do it to death, what's up with you?\nYou know my steez, true indeed\nSay it loud, black and proud\nAin't no time to hesitate at the gate, do it now!\nBus-a-Bus, rhymes galore\nWhat's the deal? Feeling great\nWhat you want?, I wanna do it to death, what up with you?\nYou know my steez, true indeed\nSay it loud, Black and proud\nAin't no time to hesitate at the gate, do it now!\n\n[Verse 5: Mos Def]\nFrom east, west, north, and south, I got joints for all of those\nHeavy aquatic water flows keepin them on they toes\nTell them thugs that wanna be CEO's to be derobed\n'Fore I wear your little dumb ass out like Easter clothes!\n\n[Verse 6: Busta Rhymes]\nYo, yo yo yo yo\nIt's like a freak show, soon as my heat blow\nSometime I speak slow so people understand my street flow\nAnd while we keep it hot, we got the most shine up in\nThis whole shit, me and Mos spit and blow the show quick\n\n[Verse 7: Mos Def]\nWatch out, your pussy sound get bucked south\nMos and Busta Rhymes too bad man-a-shutout\nWatch out, give a damn what fancy car ya hop out\nShut down your game like the NBA lockout\n\n[Verse 8: Busta Rhymes]\nYou better watch out, I'm bout to black on niggas\nLike I'm blowin on a sax, blowin my gats on niggas\nBlowin my raps on niggas, now let me mash out\nWe fatter than the biggest ass chicks pokin they ass out\n\n[Hook: Mos Def & Busta Rhymes]\nAy Mos Def!, magnetism\nHow you feel?, feeling great\nWhat you want?, I wanna do it to death, what's up with you?\nYou know my steez, true indeed\nSay it loud, black and proud\nAin't no time to hesitate at the gate, do it now!\nBus-a-Bus, woo ha\nWhat's the deal? Feeling great\nWhat you want?, I wanna do it to death, what up with you?\nYou know my steez, true indeed\nSay it loud, Black and proud\nAin't no time to hesitate at the gate, do it now!\n\n[Outro: Mos Def]\nWhat what, we got to do it, do it\nWe got to do it, do it, make me do it, do it\nWhat.. wha-what-what, we got to do it, do it\nMake me do it, do it\nDo it do it do it now!\nWhat what, we got to do it, do it\nDo we do it, do it, do it, ah do it now!\nWhat what, we got to do it, do it\nGot to do it, do it\nDo it now!", "image": "https://images.genius.com/7e6832cab470314ffb530b255928573d.600x600x1.jpg"}], "artist": "Yasiin Bey"}