{"songs": [{"title": "Ride 4 Me", "album": null, "year": null, "lyrics": "[Intro: 2Pac]\nWould you ride for me?\nWould you ride for me?\nYou lyin' if you want to ride for me\nI mean all out, not just to fuck\nI mean all that shit\n\n[Verse 1: 2Pac]\nLook, I need more than just romantic feelings\nWhen shit is frantic need a bitch\nThat’s just as scandalous when fuckin' this killer\nTo be appealin', have a bachelor in cold feelings\nMind for numbers same to wonder with this drug dealin'\nThug feelings make me a villain to the PH imbalance of civilians\nDon't let those hurt feelings turn this lesson into a killin'\nGame spillin', my prophecy fulfillin'\nTo be involved with the killin' must be a immune to squealin'\nListen lady what does it take to get you hot and crazy\nPass you a loaded 38 and bust on fools who play me\nThis is how I plan a night\nFirst we ride on the bustas then we dine\nEatin' dinner by candlelight\nBe alert and put in works with a thugz passion\nI'm a king, and you the queen up in thugz mansion\nMe, I'm a never be a busta, I ride for keeps\nI know you shy but please reply, would you ride for me?\n\n[Hook: 2Pac]\nTell me baby would you ride for me?\nBust on them mother fuckers when they lie to me?\nNow don't you ever tell a lie, just confide in me\nWould you die for me?, Tell me baby would you ride for me?\nTell me baby would you ride for me?\nWould you bang on them niggas when they lie to me?\nDon't you ever tell a lie, just confide in me\nWould you die for me?, Tell me baby would you ride for me?\n\n[Verse 2: Hussein Fatal]\nCome on baby, won't you ride for me?\nDo the time for me just cock back the 9 and see\nHow many niggas put a gun in your hand\nTell you to take what you can while you runnin' with your man\nOn my order you shoot, straight countin' the loot\nYou disguised in my boots, slip and slide in the coupe..\nUnorthodox trippin' catch him on missions\nStyles twisted daily weak MC's trail me show me how tellin' me\nSmoke me instead of jailin' me\nYou know it ain't no Fatal dog and \"J\" without felony at the telly they yellin' me\nPlay me I give you one try\nAnd I'll let you live long enough to let you see your son die\nThis evilness and wizardry Thug Life specifically it can be\nFound as deadly as them bullets that keep missin' me\nSo what I'm 'posed to do\nJust to open up your eyes and see (that's right) you got it good\nAll you have to do is ride for me\n\n[Hook: 2Pac]\nSo Tell me baby would you ride for me?\nWould you bomb on niggas when they lie to me?\nNow don't you ever tell a lie, just confide in me\nWould you die for me?, Tell me baby would you ride for me?\nTell me baby would you ride for me?\nWould you bomb on niggas when they lie to me?\nNow don't you ever tell a lie, just confide in me\nWould you die for me?, Tell me baby would you ride for me?\n\n[Verse 3: Kurupt]\nIt was a nice sunny day I was dippin' through the hood\nSeen all my homies and it was all to the good\nI'm Kurupt, the half-inch villian cold chillin'\nFrom the floor to the ceilin' and illegal livin' civillians\nSo much cash is in the bundles\nBeen there and done done it everything you've done seen and ever wanted\nI'm Kurupt, piece me up a piece of the pie\nMany try but many die in attempts to ride\nWho's the man with ten thousand plans got the grants and my my squad\nWe world wide homicidal clan\nSo many strech their arms out to touch my loot but fuck 'em dog\nBeware of the owner cuz the owner will shoot\nMeet the dog in the worst way and a nigga like me's tight on my worst day\nI been rockin fuckin' mics since the first day my eyes opened wide\nAnd finally realized tell me baby would you ride for me\n\n[Hook: 2Pac]\nSo Tell me baby would you ride for me?\nWould you bomb on niggas when they lie to me?\nNow don't you ever tell a lie, just confide in me\nWould you die for me?, Tell me baby would you ride for me?\nTell me baby would you ride for me?\nWould you bomb on niggas when they lie to me?\nNow don't you ever tell a lie, just confide in me\nWould you die for me?, Tell me baby would you ride for me?\n\n[Verse 4: Scarlo]\nOpen up my eyes, can't get up I'm feelin' weak\nOne too many nickies, take a quickie hit them streets\nPass the coke to me no weed, I'm already high\nDon't need no Indo, crack the window\nBump the deck and let me ride\nNiggas always fuckin' with me cause they don't know\nNamed me crazy when I was a baby, I'm not that ho\nHeard I was a Brood Lord, struck a nerve\nI'm swervin' off of Alizé so eat a word\nThis one in '96 for cruisin' off ?\nHard dick thriller still bitch killer\nFuckin' kibbles and bits\nNiggas won't admit, got this industry on lock down\nEgo trippin' I got tits\nI got my crazed bitches and get my shouts out\nCatch you with your pants down\nBlow your fuckin' brains out\nSteelo kind of sick, you know I be that bitch\nAnd fuck Judge Ido cause he can eat a dick\nIt didn't have to be like this to see you made me trip\nSo pull a bullet out your ass fool, ego trip\n\n[Hook: 2Pac]\nSo Tell me baby would you ride for me?\nWould you bomb on niggas when they lie to me?\nNow don't you ever tell a lie, just confide in me\nWould you die for me?, Tell me baby would you ride for me?\nTell me baby would you ride for me?\nWould you bomb on niggas when they lie to me?\nNow don't you ever tell a lie, just confide in me\nWould you die for me?, Tell me baby would you ride for me?", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}