{"songs": [{"title": "I Know", "album": null, "year": null, "lyrics": "Aye yo, who's the most explosive one yet?\nThe a roundest one left\nWho flows express to them rhythm drum set ain't done yet?\nFlow like a trumpet to your eardrum are deaf\nWho pose a threat?\nYo- who's more ferocious- none yet\nTo the night damn set mic trends and life ends\nIn sight, I see the whole world through a tight lens\nRhymes I write wins and kept a white Benz\nSpend G's like hundreds and hundreds like tens\nI get paid, Black, but laid back with mild manners\nWhen I flip it's the opposite of dark Bruce Banner\nOut the lab with soul and melodies in your ear\nAnd just when it all seem clear I disappear\nAll you gotta do is holler\nReappear like vol-la the street scholar\nI'm 40 deep like Ali Baba\nGive the mamas something to talk about in the beauty parlor\nKeep it hot like lava, yeah\nIt's Rakim Allah\n\nI know you find it hard to believe that\nI am the genie of the mic an\nI can do anything you wish but\nRight now I'm commanding you to dance\n\nReady to dance y'all, my magic carpet's the dance floor\nLast chance y'all even if you can't ball\nWhat part don't you understand? Your wish is my command\nAnd I'm a rock a jam by popular demand\nYou gone love this, it's marvelous, baby\nIt gotta thug's twist-it start to get crazy\nIt's off the meat rack- can't keep my peeps back\nSpeak raps and I freak tracks for these cats\nI got a fetish for puttin' together words and letters\nIt ain't all about the cheddars and y'all know where my head is\nGhetto scriptures for my little brothers and sisters\nAnd still get vicious for the thugs and the Misses\nWhat I don't do is talk about the same old thing\nWhen I come through, I drop it, and they gone swing\nI bring the ladies joy until they make crazy noise\nCause the beat's bangin'- I'm born to blaze, baby boy\n\nI know I you find it hard to believe that\nI am the genie of the mic an\nI can do anything you wish but\nRight now I'm commanding you to dance\n\nThe editor-forever more the predator, I said it all\nI spread a war, like never before\nSpit lead at yours like a ghetto braud raw at a\nShe'll never pause\nWith raw metaphors, I set it off\nBut I just begun the best is yet to come\nBlessed with a majestic tongue since I was young\nBut I was stressed for funds and obsessed with guns\nTest the one, let Allah protect your son\nCause something musical magician, the ageiathic author\nThe microphone magician when I have a magic marker, a mentor\nYou can explore, every sentence is a tour\nThe inventor is more than adventure\nYou'll be blown away, and a zone ?\nIt's so ill, I still grab the microphone and say\nOne of my own displays like I'm known to blaze\nAnd I bet rhyme pays until I'm old and gray\n\nI know you find it hard to believe that\nI am the genie of the mic and\nI can do anything wish but\nRight now I'm commanding you to dance\n\nI know you find it hard to believe that\nI am the genie of the mic and\nI can do anything wish but\nRight now I'm commanding you to dance\n\nI know you find it hard to believe that\nI am the genie of the mic and\nI can do anything wish but\nRight now I'm commanding you to dance\n\nI know you find it hard to believe that\nI am the genie of the mic and\nI can do anything wish but\nRight now I'm commanding you to dance", "image": "https://images.genius.com/a39c418c52aac094b7b6ccdec45b8c2a.400x400x1.jpg"}], "artist": "Eric B. & Rakim"}