{"songs": [{"title": "Where The Hoes At", "album": "Welcome to tha Chuuch, Vol. 3", "year": null, "lyrics": "[Snoop Dogg]\nDPGC, You know what I'm throwin' up\n\n[Daz Dillinger]\nYeaaa!\nY'all niggas know what time it is, yeah\nYou know we about to get stupid in this motherfucker!\nYeah, all my motherfuckin' gangsta's put your motherfuckin' hands in the air\n\nWho's the nigga that you love to hate?\nDon't debate, bust you - dead in your face\nHold up! Wait a minute as I get down and dirty with it\nSmokin' my spinach, Dat Nigga Daz is a menace\nAnd I'm finna get gangsta with it\nI'm outta the cut with some shit that I wrote\nWith my Dogghouse niggas, so you know I must be dope but I\nRat-tat-tat-tat that ass\nWhat the fuck, Dat Nigga Daz won't stop\nTil' I get the cash\nI mash for the cars, and I'll bash your jaw\nBlue and grey khakis with the All-Star's\nTen years of this gangsta shit\nBumpin' your system front and back and you know that it's crip\nOne nigga left the crew, somethin' we grew\nTo my monumental niggas that draped in all blue\nGreyed out, with the white trim Nike's\nWith my first cousin Bigg Snoop Dogg right behind me\nWanna die? Try me\nWith them AK twins drop like siamese\nGet down to grindin', yo nigga, fuck signs\n\n[Snoop Dogg]\nSuge Knight is a fat bitch! HA HA\n\n[Daz Dillinger]\nI be the nigga with an all gat tucked in my drawers\nWhy nigga? Cause I'm down by law\nD-O-double-G P-O-U-N-D, G-A-N-G-S-T-A C-R-I-P\nTell me what time it is cuh,??\nShowin' y'all? niggas there's no love\nI thug it up, I slug it up, I tug it up\nI DPGC nigga, you know what I'm throwin' uuuuup!\n\n[Chorus: Daz Dillinger]\nDPGC nigga, you know what I'm throwin' uuuuup!\nYeah, and you know we gonna keep it gangsta up in this motherfucker\nShit, I see my nigga Goldie Loc, what's up cuh!\n\n[Goldie Loc]\nStill ridin', Eastsidin'\nHittin' switches, slappin' bitches, makin' my riches\nCold crippin', stay dippin', still rippin'\nDippin' my cigarettes, fool I'm still trippin'\nKick on back and ease your cool\nCause everybody know that Daz and Goldie actin' fool\nSnoop in the Cadillac, rollin' up the whole sack\nI'm sitting in this motherfucker, holdin' on this mini-mack\nSo say it ain't gangsta\nYou one of them Rollin' 21 five boys, nigga ain't ya?\nYou got that right, now back your ass up here come them Criptonites\nI'm from the land of notorious gangstas (Long Beach!)\nWith a big \"Eastside\" always crip hard and stay anxious\nSpittin' the heat, movin' the street\n\n[Daz Dillinger]\nGoldie Loc and D-A-Z, motherfucker!\n\n[Chorus: Daz Dillinger]\nDPGC nigga, you know what I'm throwin' uuuuup!\nYeah, Dat Nigga Daz is most definately in the motherfuckin' house\nYeah, that's what I'm talkin' about, HA HA\n\n[Daz Dillinger]\nI can't quit givin' you niggas the blues\nDouble barrell shotty knockin' them niggas right out their shoes\nSolo's and crews\nI... cock the tool and rebuild the nigga whole frame and burnin' this fuse\nI wasn't born to lose\nI know your mind, your heart, your soul ain't what it seems to be\nWhen the cannon explode you and your boys is history\nI told the story of a lifetime, came back with the right rhyme\n2003 yeah it's all mine\nSo bow down and recognize to a boss\nI made the shit up nigga, so how you talk\nYou better walk the walk before your ass get chalked\nSee I stalk the street nigga day and dark\nI spark the flame, I'll leave you niggas all ashamed\nWith The Gang motherfucker we blast and maintain\nYou on the wrong side of the set, motherfucker roll it up\nDPGC nigga, you know what I'm throwin' uuuuup!\n\nYeah! HA HA, you know what I'm throwin' uuuuup!\nDPGC nigga, you know what I'm throwin' uuuuup!\nAnd it just don't stop, Dogghoused the fuck out\nLike to say what's up to my cousin Bigg Snoop Dogg\nGoldie Loc, Tray Deee, my nigga Soopafly\nMr. B-A-D, Mr. Kane, Latoia Williams, my nigga E-White\nAnd I am Dat Nigga Daz\nAnd we gonna keep it Dogghoused out motherfucker!\nSo all y'all can suuuck these nuts\n\n[Snoop Dogg]\nNow... you understand what we sayin'?\nDPGC... Dogghouse\nDat Nigga D-A-Z, L-B-C\nEastside for lizie\nCan you dig it?\nOh ya, by the way, Suge Knight is a fat, dick suckin', hatin' ass bitch... fucker!\nOh ya, fuck your wife too\nNo singin' ass bitch\nGot Dr. Dre's dick on her breath", "image": "https://images.genius.com/25bc30a6b9ef9bf94d76fe870a178c85.600x600x1.jpg"}], "artist": "Snoop Dogg"}