{"songs": [{"title": "Operation: Greenbacks", "album": "Operation: Doomsday.", "year": "1999-04-20", "lyrics": "[Produced by MF DOOM]\n\n[Hook]\nM-O-N-E-Y\nNever did a thing for L-O-V-I-N\nNever understand what people's heads are in\nAsk me what I need\n\n[King Ghidra]\nA fly tramp, that's what she called me\nCause I don't wear no Stetson hats like Paul C\nAs y'all see, who give a fuck? Who know what is it?\nThese styles will be flipped to the absolute exquisite\nIt's like a blizzard, soon as I got home from ATL\nLooked into my baby's face, my boo was like ... \"Well!\nI know your types of clientele! Thoughts, needs\"\nAs I held her firmly, yet gentle as the soft sea\nShe said, \"The one with the horse weave? The pretty one?\nAll crazy, had to touch the tattoo through the short sleeve\nWhich one you want?\" I'm like, \"If there was comp?\nFuck around, a nigga like me probably run up in all three!\"\nKing Geedorah what they call me, either caesar or baldy\nProbably have moved since last y'all saw me\nOn the D-low, I slaughter solo emcees, they paper-thin\nIn they Polo, Nautica, or DK men\n\nAmen! It's funny how significance make a difference\nNotice parables of three in every other inference\nFor instance: \"Who wanna battle? On the real?\nChoose your weapon: microphone, beats, or the wheels-of-steel\"\nI own a crown in all three for getting down without a doubt\nI'd like to give a extra special out to Jet Jaguar, the sun, moon and star\nThe Monster Island Czars - y'all know who you are\nGet that!\n\n[Hook]\nM-O-N-E-Y\nNever did a thing for L-O-V-I-N\n\n[Megalon]\nComing straight from the black lungs\nI rip tracks for all players that pack guns\nStack ones in packs, done and doing back-to-back runs\nTo my peeps that close, so's ya' knows what's up\nY'all know the dough's quick, hoes that mess with 5-O shrimp like, \"What?\"\nLike they wanna shmoosh us, just to packing the pushers\nI'm packing gat then bust a cap at po-po\nIf they catch us and try to push us\nSince when a MINY nigga don't be taking no shit?\nI be that drug dealing nigga that be fucking ya' bitch!\n\n[King Ghidra]\nWhat a fella! Like Salt, Pepa, Spinderella\nI came to spark the deaf, dumb and blind like Helen Keller\nIf I'm not with George of the Jungle, if he not with Stella\nOr either Priscilla, I'm doing dips on Godzilla\nThough y'all know he don't play, right?\nTNT throws a nigga out a moving van in broad daylight\nAnd he was shackled by hands and feet\nThen they say he tried to escape, once his face scraped the concrete\nNear the curb on Monster Island, 103 Street\nWhere brothers run the risk of getting swallowed once the Beast eat\nI'd rather lay in the cut, collect cash pay\nOnly TNT I see is Gilligan's castaway\nWith Mary Jane and Ginger\nOh, from which you spent the night by accident, I creep like a ninja\nWhen the mack is bent, who can give one fuck?\nGet bucked, get broke up like three-piece nun-chucks\nY'all sun struck, sick to they head-piece\nThree-headed beast brings the drama to a dead cease\n\n(Get that money, god)\n\nSick to they head-piece\n(Get that money, god)\n\n(Get that money, god)\n\n(Get that money, god)\n\nGreenbacks ... the meanest green stacks\n\n[Hook]\nM-O-N-E-Y\nNever did a thing for L-O-V-I-N\nNever\nAsk me what I need, I need your\nM-O-N-E-Y", "image": "https://images.genius.com/c0a80e3098696bdf600f54a76667c069.1000x1000x1.jpg"}], "artist": "MF DOOM"}