{"songs": [{"title": "Lick Your Teeth", "album": "Bad Season", "year": "2010-12-23", "lyrics": "[Verse 1: Tech N9ne]\nHey, you beautiful\nI'm tryin' to have my hair stuck off in your cuticles\nFrom cunnilingus I'll bring it if you think I'm suitable\nDo you know I'm a fool for you booty so let's go to the whole\nEncore baby, tower sweets on 'em\nSet that ass on the couch and put your feets on 'em\nThe way you lookin' baby girl got me foamin'\nSmile for me, damn, you got beautiful teeth women\nCan I lick them motherfuckers, I gotta do it\nBefore my dick's in your motherfuckin' mouth\nThat is what I'm 'bout\nLick it, then I stick it terrific and dash out\nBaby you should have did hella commercials\nPreferably, Colgate, I know hoes hate\nCause you destined to find your soulmate\nBut I'm only searchin' seekin' your taste\nSo smile at me, even growl at me\nAnd I'll run my tongue across\nYa teeth and all the while it be\nMr. fun time, that's if you sexy as fuck\nSo before we buck, I'mma slap my\nTongue across your gum line\n\n[Hook: Krizz Kaliko] (2X)\nBaby can I lick your teeth? (Yes, you can)\nWhere I'm at, your mouth looks so sweet (Yes, you can)\nSo all you gotta do is smile for me\nIf I'm into you, I'll lick your teeth\n\n[Verse 2: Irv Da Phenom]\nYou're the baddest thing I've seen in here tonight\nAnd plus this drink I'm sippin' on, don't got me right!\nNow girl, I know this here might sound a little bit eww\nBut momma don't knock it, 'til you try it\nYou never know, you just might like it\nPlus all this Hennessey, that I've been drankin' makes me feel\nLike losin' all in ambitions\nNever been with kissin' bitches, I don't know but tonight I\nWill make a bit of an exception\nI'm a bit intoxicated with the biggest of erections\nPlus you grindin' on a nigga, got me feelin' like we sexin'\nFrame can make a nigga sin\nBut gotta face that's straight from heaven\nLook good, smell good, plus you got pretty feet\nDamn you so sexy to me, I think, I would lick your teeth\n(Look good, smell good, plus you got pretty feet\nDamn you so sexy to me, I think, I would lick your teeth)\n\n[Hook] (2X)", "image": "https://images.genius.com/0fb56636df878a9df9d4417d6e65d406.1000x1000x1.jpg"}], "artist": "Tech N9ne"}