{"songs": [{"title": "The Last Hope", "album": "Comeback Season", "year": "2007-09-01", "lyrics": "[Hook: Andreena Mills]\nI gotta make it out, or move quickly\nCan't allow the past to restrict me\nBut this time around they won't skip me\nI am the last hope. Don't hesitate not even for a second\nThe hustle has become an obsession\nI'm on the front line with my weapon\nI am the last hope\n\n[Verse 1: Kardinal Offishall]\nCan you imagine the last breath of Christ?\nThe last breath of Christopher Wallace on that faithful night\nThe last step that Martin Luther took as a man\nI got the power of my world in my hand\nThe Microphone brings life or death in the blink of an eye\nI was born to provoke those born to die\nI was conceived to beat all odds like Las Vegas\nT-dot motherfucker, watch the world rape us\nGreatest strugglers hustle to succeed\nCross water smugglers tussle to burn weed\nIt meets that pressure to success in the South\nNiggas watching what I say magnifying my mouth\nI never take back talk, I apply the force\nHand blistering from many years of holding the torch\nWhen the skin rebuilds, it grows tougher than leather\nSo we can keep on hold it forever\nMy name's Kardinall\n\n[Hook]\nI gotta make it out, or move quickly\nCan't allow the past to restrict me\nBut this time around they won't skip me\nI am the last hope. Don't hesitate not even for a second\nThe hustle has become an obsession\nI'm on the front line with my weapon\nI am the last hope\n\n[Verse 2: Drake]\nJealousy is something I haven't felt in years\nThere's nobody around for me to be jealous of\nI bet you do a show in my city and no one cheers\nEven if you make the music that ladies and fellas love\nDawg, I'm incredible fuckin unforgettable, but when it comes to records I will eat it if it's edible\nThey say the futures always for-seen\nThat's why I'm steady getting more money more cream\nMy flow is stuck in the moment that comes before dreams\nI stay avoiding unlucky like 14\nAnd people get behind and they fight for em' cause he won't let no other niggas write for em'\nAnd even when its quite warm, the attitude coursing through the veins and my city is an ice storm\nThe name's Drake and I don't take it for granted\nI can take it you offended cause I'm taken advantage man\n\n[Hook]\nI gotta make it out, or move quickly\nCan't allow the past to restrict me\nBut this time around they won't skip me\nI am the last hope. Don't hesitate not even for a second\nThe hustle has become an obsession\nI'm on the front line with my weapon\nI am the last hope", "image": "https://images.genius.com/866a4a7df935705e834f236499d617c6.1000x1000x1.jpg"}], "artist": "Drake"}