{"songs": [{"title": "1st & 10", "album": "Incognegro", "year": "2000-05-16", "lyrics": "[Intro]\nClick, click\nClick, click\nYeah\nClick, click\nDTP nigga!\n\n[Verse 1: Infamous 2-0]\nI started with ten mack tens and ten clips and ten pens\nGot ten times richer in the span of ten years\nBitch, I'm ten times two on a scale of one to ten\nI'll battle ten crews with the strength of ten men\n\n[Verse 2: Fate Wilson]\nAt nine, I was into crime, sex, and drugs\nPushin' an '89 Box Chevy sittin' on dubs\nNine thugs all ski masks, black suited with gloves\nBreak the imprinted chest with at least nine slugs\n\n[Verse 3; Ludacris]\nMan I ate eight clips with eight chicks, watching eight flicks\nYou's 8-6 if you ate pussy with fake lips\nI figure eight when my mind goes in circles\nDid I do that? Or was it Mystikal and Urkel?\n\n[Verse 4: Infamous 2-0]\nOn to 7 Ak 47, so what?\nI got seven hoes stoppin' by at seven to fuck\nThen put seven in your chest seven days a week\nAnd add a foot for good measure you'll be seven feet deep\n\n[Chorus: Infamous 2-0, Fate Wilson & Ludacris]\nIt goes 10-9-8-7-6-5-4\n3-2-murder 1 lyrics at your door\nThese DTP niggas come ready for war\nSo don't start the fucking game if you won't settle the score\n\n[Verse 5: Fate Wilson]\nI got six hoes distributing on six blocks\nIt's blistering from cops tryna stop these rocks from distributing\nSix gun shots left, one pint of Vodka before this pimp will hit\nIt's street justice, now it's six hole in your casket\n\n[Verse 6: Ludacris]\nGive me a high five and I'll put that nine lower than your esophagus\nThen smack you so hard that you have to come with 2Pacalypse\nFive stars, twenty rims, five cars\nI'd add more but I had to subtract one from five bars\n\n[Verse 7: Infamous 2-0]\nI got four forty-fours on a rip on the floor\nFor you niggas talkin' shit, I'm fixin' to show you what for\nI did four months in the bing instead of a hearse\nNow it's DTP for life, dog for better or worse\n\n[Verse 8: Fate Wilson]\nI fuck three best friends, ran on all three the same game\nIn these streets I'm a murderer, I got three alias names\nI'm three times insane, three shots will cave your brain\nOn 3 fire and ready, cock back and aim\n\n[Chorus: Infamous 2-0, Fate Wilson & Ludacris]\nIt goes 10-9-8-7-6-5-4\n3-2-murder 1 lyrics at your door\nThese DTP niggas come ready for war\nSo don't start the fucking game if you won't settle the score\n\n[Verse 9: Ludacris]\nI'm packing two twenty-twos and twice the ammunition\nBut at Friday the 13th, what's up now superstition?\nI'm a two timer with a couple of twins, double jeopardy\nWith a pair of two deuces in the two seater Benz\n\n[Verse 10: Fate Wilson]\nI got one motto get dough 'til you're gone\nI got one main lady the rest of y'all is hoes\nI'm numero uno with one more before I go\nIf you think I ain't the one bitch you too slow\n\n[Verse 11: Infamous 2-0]\nAnd all you zero ass niggas ain't nothin' to me\nBecause I chop up O's, move dro', and chop keys\n0-6 is my clique along with PC\nPretty Rick, Calil, V-Slim and Shondrez\n\n[Verse 12: Ludacris]\nIt goes 1 to 10 and 10 to 1\nLudacris, Fate Feeze, and that nigga I-Twun\nIt goes 1 to 10 and 10 to 1\nLudacris, Fate Feeze, and that nigga I-Twun\n\n[Chorus: Infamous 2-0, Fate Wilson & Ludacris]\nIt goes 10-9-8-7-6-5-4\n3-2-murder 1 lyrics at your door\nThese DTP niggas come ready for war\nSo don't start the fucking game if you won't settle the score", "image": "https://images.genius.com/9ea8d719979b4d9e52d89271c9e0b7da.1000x1000x1.jpg"}], "artist": "Ludacris"}