{"songs": [{"title": "What’s My Purpose", "album": "Knock Madness", "year": "2013-11-26", "lyrics": "[Intro]\nPlanet Earth\nThe place that I live... we live\nWho owns it?\nYou?\nNah, nobody owns this shit\nJust a big ass piece of rock with humans on it\nDo what the fuck I wanna do\n\n[Verse 1]\nA lost human born into a dark society\nWith one mind state, there's no variety\nMovin' vibrantly, tryin' to be the best that I can be\nI've tried to see the light in livin' life but it just blinded me... irony\nNow I'm thinkin' violently, because I feel my country went and lied to me\nIt's bringin' out a whole new fuckin' side to me\nRide with me, if you feel my pain then you can cry with me\nThis fuckin' shady system is the rivalry\nThey the ones who raised us, turned us into cage nuts\nThey're what we're afraid of, they are why we ain't us\nThey the reason we constantly livin' for money and we just can't budge\nIt's takin' a toll on your dreams, so you gave up\nAnd now the pain stuck, they ain't showin' nothin' but fake love\nWe just numbers put on a pay stub\nOur purpose shouldn't be to make bucks\nWe all slaves and if we never make a change then we straight fucked\n\n[Hook]\nI can't stand humans, I hate humans, but I'm a human\n(I'm only human)\nOne monkey eats shit, now all the other monkeys wanna do it, humans are so stupid\nDon't bring your bull shit around me (Fuckin' human)\nThe problem is killin' my mind, God, give me a sign\nMaybe I'm trippin', tell me this life is worth livin'\n\n[Verse 2]\nWho set the standard for everybody to live by?\nHow far along in life would you be if you did try?\nWho tryna help these ghetto neighborhoods where kids die?\nThis world has turned into a mother fuckin' pigsty\nI look outside and it disgusts me, it bugs me\nIt's ugly, I trust no other fuckin' human but me\nSo what needs, to be done? Every day is a rerun\nTechnology's advanced, as people how far have we come?\nYeah, I can see that time's grown, but still I'm mind blown\n'Cause everybody's mind is stuck inside they iPhone\nThey always textin' and postin' statuses hourly\nBut in reality, there's no sign of a personality\nIt's cowardly, we shielded like we scared to get some allergies\nThe human being is what we don't know how to be\nAnd honestly these issues really suck to know\nBut I refuse to sit and let the trouble grow, so God, show me where the fuck to go\n\n[Hook]\nI can't stand humans, I hate humans, but I'm a human\n(I'm only human)\nOne monkey eats shit, now all the other monkeys wanna do it, humans are so stupid\nDon't bring your bull shit around me (Fuckin' human)\nThe problem is killin' my mind, God, give me a sign\nMaybe I'm trippin', tell me this life is worth livin'\n\n[Verse 3]\nHow can a man with power feel there's no responsibility?\nThese rappers blowin' up, but through my eyes they not as real to me\nThey constantly conceal the beast, but never try to heal the streets\nTeachin' girls to be a slut, but never make 'em feel unique\nHow can we feel fine this way? Open up your minds today\nThe matrix got you young, owin' a debt you'll spend your life to pay\nStressed out, assumin' that you'll be more happy inside your grave\nDon't tell me about no fuckin' struggle then, nigga, 'cause I know pain\nTo the point where I felt like life was shit\nGrowin' up as a kid with both parents who got no funds to ever provide you with\nShit is just stuck repeatin', the world is tough to be in\nMunchin' on fast food, don't even know what the fuck I'm eatin'\nAmerica, I gave it my all\nStill you guys arrested me for bein' black and standin' on a sidewalk\nIt doesn't matter if I'm breakin' laws or bein' harmless\nI'm automatically hated by cops 'cause my dark skin\nGod was my smartest option\nMy soul is mine, y'all ain't gonna bargain off it\n'Cause if you do that means the darkness profits\nThe sky is where I got my heart adopted\nMan, if we all just took the time to think I swear it won't be hard to stop this\nBut y'all assume that I'm just startin' nonsense\nBut I promise y'all the fuckin' world is gon' remember Marcus Hopson\nThere's consequences for enlightenment\nBut if I have to hide the truth to live then I'mma die just like my idols did\n\n[Hook]\nI can't stand humans, I hate humans, but I'm a human\n(I'm only human)\nOne monkey eats shit, now all the other monkeys wanna do it, humans are so stupid\nDon't bring your bull shit around me (Fuckin' human)\nThe problem is killin' my mind, God, give me a sign\nMaybe I'm trippin', tell me this life is worth livin'", "image": "https://images.genius.com/89f3b594c1d21cb0ced76a0e54600701.1000x1000x1.jpg"}], "artist": "Hopsin"}