{"songs": [{"title": "Project Steps", "album": "Da’ Nic", "year": "2015-03-11", "lyrics": "[Intro]\nOld habit die hard huh\nDisrespect will not be disregarded partna\nYou cross dat line I'm goin' off bout mine\nMan woman and child, no exception home boy no disrespect will be tolerated come hell or high water\nYou understand that? Ya bitch!\nBankroll Mafia, Hustle Gang ova everythang nigga\n\n[Verse 1: T.I.]\nI got fake bitches on my timeline\nSucka niggas in my rearview\nWonder why I'm even wasting my time\nEven replying to letcha know I don't feel you\nFuck 'em!\nDodging nothin' but a Fed case\nBetta know it, tired of holdin' on to dead weight\nGoin' let it go\nAnd ain't no turnin' round lookin' back\nI Swear to God I'ma drop a gem like cookin' crack\nAnd sell it hard\nI'ma, Bankhead nigga to the heart\nTote tools on the boulevard\nIts young niggas in a stolen car\nWith expensive ambition and exquisite pistols we showin’ off\nCaught that line and we goin’ off\nIn Lenox mall give a damn, who you goin’ call?\nYou violatin, we ain’t lettin’ nothin’ go at all\nWe demonstrate and leave your brains on the fuckin' wall\nPuss, you disrespectful nigga, got that\nI ain’t neva been shot at, and I ain't shot back\nBossed up in a cool whip with a hot gat\nAnd still got stacks from back from “What You Know About That?”\n\n[Hook]\nI’m just a project nigga on the front steps\nAnd gettin’ money is the concept\nBy any means, and the belt where the gun kept\nI let that whole clip ride, till ain’t one left in it\nTry me, I'ma handle my business, handle my business\nTry me, I'ma handle my business\nTry me I'ma handle my business, try me\n\n[Verse 2: T.I.]\nI got fake bitches in my timeline\nHatin' niggas in my rearview\nI got naked bitches in the high rise\nOn the balcony so they could get a clear view\nOf the city with my dick up in it\nBut in the morning won’t remember which bitch is it, shit\nAy I’m too rich for this shit but I’m too real to be tried nigga\nGoing against me just like goin’ against God\nAnd I ain’t gotta make excuses\nI don't fuck whoever, whatchu wanna do about it\nThought not, fuck around get crossed out\nYou caught slippin' roll down on your ass, .45 start spittin'\nGoin' be a long day nigga I start trippin'\nDon’t be stickin' to the script, drive-by audition, wassup\nWhatchu do for dough, guess you do it too slow\nAnd by the looks of your stuff, you ain’t doin' enough\nI’m poppin' wheelies in the front, leave you in the dust\nKick in your door masked up like, “Who in the fuck?”\nBoy you a ho ho, not just a little piece of pussy\nBetta watch your ass talkin', you don't know me nigga holdup\n\n[Hook]\nI’m just a project nigga on the front steps\nAnd gettin’ money is the concept\nBy any means, and the belt where the gun kept\nI let that whole clip ride, til ain’t one left in it\nTry me, I'ma handle my business, handle my business\nTry me, I'ma handle my business\nTry me I'ma handle my business, try me\n\n[Verse 3: T.I.]\nAll I wanna do is go and chill\nTake my mind off the ones I wanna go and kill\nYea, I’m a daddy, love my little girls\nBut I’ll still check a bitch like ‘Pac did Lauryn Hill\nHey I ain’t grow into it, I was born with it\nUsed to sell crack to the children of the corn\nI’m the reason why your mama warned you\nPray you don’t die before you make it to the street corner\n\n[Hook]\nI’m just a project nigga on the front steps\nAnd gettin’ money is the concept\nBy any means, and the belt where the gun kept\nI let that whole clip ride, til ain’t one left in it\nTry me, I'ma handle my business, handle my business\nTry me, I'ma handle my business\nTry me I'ma handle my business, try me!", "image": "https://images.rapgenius.com/f7d616764951f22c74ff6ffd7e509fa5.640x640x1.jpg"}], "artist": "T.I."}