{"songs": [{"title": "On Voting for Trump", "album": "Kanye West’s Visionary Streams of Consciousness", "year": "2016-11-17", "lyrics": "I told you. But if I would have voted, I would have voted on Trump. [audience boos]\n\nNow, there’s people that I love that did vote that voted for Hillary and I don’t love them no less because they had their opinion. I love friends that I have that voted on Hillary. My manager, Scooter Braun, voted on Hillary. One of my management team. My other manager, Izzy, I’m gonna assume voted on Hillary. Everybody said that if you voted on Trump you have to go back to like Montauk or shit. And guess what? That entire team still put together this show tonight with people with differences of opinion, still put this show together tonight and still came together and made this show for y’all. They told me, “Ye, do not say that out loud. Whatever you do, do not say that out loud.” And I just said it! I wanted to say that before the election and they told me, “Do not say that out loud. Whatever you do, do not say that.” That don’t mean that I don’t think that Black Lives Matter. That don’t mean I don’t think that I’m a believer in women’s rights. That don’t mean I don’t believe in gay marriage. That don’t mean that I don’t believe in these things because that was the guy I would have voted for.\n\nRun the next song.\n\nBelieve that there are people here enjoying, or before I start talking at least, enjoying a Kanye West show. By a show of screams do you believe that there are people at a Kanye West show who voted for Trump? [audience screams] Oh, it sound differently from before, huh? It sounds different. Why did we boo the first time on something that wasn’t, “Hey, do you like Trump?” That wasn’t what I asked. I asked you to give me your facts because the internet was giving you their facts based on what you wanted to hear and a lot of you guys got blindsided.\n\nHow that make you think, though? The fact that I just asked that undeniable question? That in most music situations you have the Democrats always since the beginning of time. The Democrats were considered to be more liberal. The Democrats were supposed to be more futuristic in their approach. The Democrats were supposed to have more empathy and be more about the people and that relates directly to music and it also relates to celebrity and the idea of what music does for you. Democrat is like music to your ears or something. Bye. Your voices. Do you believe–what percentage of people here–and by the way, I’m not setting y’all up, I’m not setting y’all up I’ve got no time for bullshit–what I’m saying is, what percentage of people here do you think voted for Trump? Do you think it was two people here? Do you think maybe it was 100 people? Do you think maybe it was 1,000 people out of the 15,000 people here? No, I’m asking you, what do you really believe? One person. Two people. What do you really believe? What do you really believe? What do you really believe? What do you really believe? What do you really believe? What do you really believe?\n\nI haven’t talked about anybody’s stances on anything. I haven’t talked about any quote that anybody gave from either side. That’s not what I’m talking ’bout. That’s not what I’m asking you. What I’m asking you is what you really believe. I put something that I would bet on. I bet that it might be 20 percent or maybe even 30 percent of this very audience right here that might have voted for Trump. I bet you 15 percent, 50 percent of them, would never say that at a Kanye West show because of the climate right now. And they don’t know they might think I’m like, “Oh, they voted for Trump... y’all should go ahead and….” It’s the opposite of that. People got the right to vote for whoever they want to vote for. That’s the right to vote! That is our right! I did not vote. Aww, no. The Saint Pablo ticket sales are going down now. Aww no, t-shirts. “Aww nah, you just got out of jail Ye. You had to deal with the Taylor Swift shit for seven years now you gonna go say some... naw, Ye don’t say shit. Just step out.” Fuck that, bro. That’s the reality.\n\nWell, Ye, how you gonna expect people to vote for you if you ain’t even vote? I’m concerned not about the idea of being president or the actual job of it. I’m concerned about putting our concept of how to do the job in a new way. And if no one will do it in that way I will take position in 2020 and do it myself. “Aw you ain’t gonna get it now because of what you just said.” It was proof that it didn’t matter what nobody just said! It doesn’t matter!\n\nIt might have been a reporter who wanted to use this as an opportunity to say, “Oh, this rapper” because when they call me a rapper they try to say that I’m less than thinking, less than a philosopher. But rappers are the philosophers of our now. The rappers all form a sense of our now. The celebrities are the influencers of our now. Just look at the president. He wasn’t even in politics and he won! That shows you not if you mad about him winning, but that shows you the level of possibility that is out there if you go and find information and don’t believe everything the fucking internet is telling you! There is possibilities! There’s possibilities inside of books. There’s possibilities when you call grandmother. Motherfuckers be on the internet way more than they calling they mother or they grandmother. To get information that would have you wrong as fuck like everybody knows a couple days ago! Do you ever want to be blindsided like that?\n\nDon’t trivialize what I was saying when I talked about our president’s approach to the campaign when I said it was entertaining. I don’t think his approach was just entertaining, because that trivializes it, I actually think that his approach was absolutely genius because it fucking worked! Next song.\n\nOh shit, you threw something at me. Does anyone else wanna throw something at me? But, you know what, I got the power to get that guy kicked out, or whatever, roughed up. No. Stay here. What do you believe? That’s your opinion. Express your opinion, bro. Express your opinion. Thank you. That’s a woman right there saying, “I love you,” after I just said that there was things that I liked about Trump’s campaign. That’s not supposed to happen, right? No! That’s not supposed to happen, right? Case in point. Aw, no. Well, no. I guess we’re not gonna sell out the rest of the tour now. There’s methods, nonpolitical methods to speaking that I like that I feel were very futuristic and that style and that method of communication has proven that it can be a politically correct way of communication. And I fuck with that. You threw something at me! Naw, he wanted me to sign his Yeezy.\n\nI don’t say 2020 out of disrespect to our president at all. I’m not saying that, “Aw man, that just mean that anybody can win.” That’s not what I’m saying when I say 2020. I’ll just say I got some ideas about the way that we should connect our ideas. And we should use opposite parties that the Republicans, that the Democrats, that everyone that ran that had an idea that people agreed with should be the collective ideas that are used to run the country. And that should mean more. So there's things that Benjamin Carson believes in... that I believe in. I believe that Benjamin Carson should still be a consultant. I think that Hillary Clinton should still be a consultant. I think that Bill Clinton should still be a consultant. Obama said... I think Obama should still be a consultant. It’s that, “Oh, I don’t fuck with your principles so now I’m not gonna give you no information that could help you help all of us.” Make sure this dude that got the Yeezy get his Yeezy back, specifically. Hey, security, get it back.\n\nMan, and you know what also? I’m not saying this to diss celebrity and that all who are particularly on the Democratic side, that’s cool, I just like... I hate the fact that because I’m a celebrity everybody told me not to say that I loved the debates. I loved his approach. It’d be like white people that’s racist running around saying “niggas” now. If people are racist and they feel more inspired to say how they feel then they exposing themselves, bro. This is what I’m saying. It’s already the beginning of change. Sometimes things that you might think are bad have to happen in order for change to fucking happen. Sometimes you might have to not get your way to really understand what to do in the future to be able to get your way.", "image": "https://images.genius.com/9fa6626ebb7cecda3ba692c1c80f52bf.1000x664x1.jpg"}], "artist": "Kanye West"}