{"songs": [{"title": "Mazinger", "album": "Lost In The Atlantic ", "year": "2014-10-31", "lyrics": "[Intro]\n\n[Intro Skit]\nI had to complete Mazinger Z. I had to, I had to\nWhy did you have to Grandfather?\nTo wreck all of Dr Hell's evil plans. Mazinger Z is clad in ultra alloy Z and is operated by photo atomic energy. It contains mighty weapons of all kinds. That robot is perfect. There is nothing to correct or adjust. Koji, Shiro, that robot is all yours. My only regret is that I cannot stay alive to watch you boys operate that robot. With Mazinger Z you can either become a God or a Devil. You'll be known as a super being. Now go!\n\n[Verse 1: Lupe Fiasco]\nSinister times, pacific the rims so I live in the mind\nSit in the head of the shit I design\nPosition it bent so I sit in recline\nBut never I sleep\nTears out the eyes is the weather I weep\nGive cheddar to beggars to better my keep\nDon't turn a back and never a cheek\nWon't be here forever, we sever, we cease\nA liar who said that we never release\nNooses surroundin' the neck of the beast\nLoosing they pounds on the treasure beneath\n200 pounds under pressure decrease\nReducing the sound to a set of beliefs\nDevil's a trick like they sent the police\nIs it or nah's (Nas) like wedded Kelis\nSo not the same like a Jet and a Jeep\nOne in the clouds, the other up under him running around\nUnlike the one never touching the ground\nSome like the one cause it doesn't come down\nUnlike the oven that's under the town\nLiquor the fire they jump in and drown\nWait till they die it's for something profound\nHead is so dreaded for clutching the crown\nAnd keeping it standing when jumping around\nFeeding the animals, touching the hounds\nEating with cannibals, lunch in the lounge\nKeeping it manual, clutch in announced\nEating the actual, reaping the benefits\nRepeat the annual, bleeping the fouls\nSomething about (something about)\nReaching the valuable, touching the down\n\n[Hook: PJ]\nYou came by yourself my darling\nBut you know we're not alone\nOh get yourself in order\nBefore they're calling you home\nIt could be wonderful\nSo tell me what is it you're waiting for?\nNo don't you go too far\nCause soon they'll be calling you home\nThey calling you home\n\n(Either become a God or a Devil)\n(Either be-, either become a God or a Devil)\nYeah you know they calling home\n(God or a Devil, either be-, either become a God or a Devil)\nYeah you know they calling home\n\n[Verse 2: Lupe Fiasco]\nLovin' the Lord\nCovet the lovers of governor or\nDozen in love with the covets or more\nIn concerts with converts-who-cover galore\nWash off they feet and then cover the floor\nMother the ships so come hover aboard\nTo raptures and ruptures start flooding the shore\nPushing and shoving and punching with oars\nThuggin' and judging, no plugging the holes\nSink to the bottom like sex in the kitchen, no food in the fridge but it's nut on the stove\nIt's what on the what?\nLike Monica sucking and bust right on her clothes\nDishonouring Monica what is it for?\nMonitor Monica, what does she know?\nFinding the evidence, answering the questions\nDid you and the president fuck on the low?\nRoom full of elephants, elegant elements, breaking it down she touching her toe\nTriple A coming to give her a jump and her engine construction don't function no more\nIt's killing her options to live in a box when they filling their stockings with lumps of the coal\nFinding the diamonds with dynamite, fighting the fire is hiding while wiping the pole\nSliding off slightly to siphon the go\nShe biting her neck like she vampire-like, ain't no lighten her load\nWith the tide and a bleach at the laundromat black trying to whiten her clothes\nSo maybe she can sneak into heaven, hmm yeah\n\n[Hook]\nYou came by yourself my darling\nBut you know we're not alone\nOh get yourself in order\nBefore they're calling you home\nIt could be wonderful\nSo tell me what is it you're waiting for?\nNo don't you go too far\nCause soon they'll be calling you home\nThey calling you home\n\n(Either become a God or a Devil)\n(Either be-, either become a God or a Devil)\nYeah you know they calling home\n(God or a Devil, either be-, either become a God or a Devil)\nYeah you know they calling home\n\n[Outro]", "image": "https://images.genius.com/086a97697018e971ec96968b06973838.275x275x1.jpg"}], "artist": "Lupe Fiasco"}