{"songs": [{"title": "Killed Before", "album": "SUPER SLIMEY", "year": "2017-10-20", "lyrics": "[Intro]\nWe got London On Da Track\n\n[Chorus]\nEveryone know I've been killed before\nI've been bent like a centerfold\nI crap with my money, no-oh\nDrop the top, get a breeze, oh-oh-oh-oh-oh\nGot four million in jewelry, oh-oh-oh-oh-oh (Whoa)\nLet that money fly to the ceiling, whoa-oh-oh-oh-oh (Whoa-oh)\nDid you pay someone's tuition? No-oh-oh-oh-oh (Whoa-oh)\nDo you own a store? No-oh-oh-oh-oh (Whoa)\n\n[Verse 1]\nYeah, fuck all this bullshit (Slatt)\nDiamonds for all us kings, yeah (Yah)\nGot my money, went Ludacris (Let's go)\nGive some racks to a hood bitch (Hoo)\nGive some racks to a pulpit (Woo)\nLook at the grain, it's wood, bitch\nOn the floor, it's a wool, bitch\nShe suck dick like a whole tick (Come on)\nDiamonds on me, they cold as shit (Phew)\nI thank God that I went legit (And what?)\nWhen we see 'em, you know we blitz (And what?)\nI can bet up, you know I'm rich (Let's go)\nShut the fuck up, nigga, bet up, you say you rich\nDifferent color diamonds, I'm a peacock\nDifferent color diamonds, I'm a peacock\nSpot full of birdies with no treetop\nYou know you my son, you can't be dad\nI bought the boat, the jet-skis\nGot an FN and a stick, don't test me\nI stacked them hundreds up to God knees\nI ain't goin' broke until 2070\n\n[Chorus]\nEveryone know I've been killed before\nI've been bent like a centerfold (Whoa)\nI crap with my money, no-oh\nDrop the top, get a breeze, oh-oh-oh-oh-oh\nGot four million in jewelry, oh-oh-oh-oh-oh (Whoa)\nLet that money fly to the ceiling, whoa-oh-oh-oh-oh (Whoa-oh)\nDid you pay someone's tuition? No-oh-oh-oh-oh (Whoa-oh)\nDo you own a store? No-oh-oh-oh-oh (Whoa)\n\n[Verse 2]\nWe ain't lettin' these bitches get between us\nWe ain't lettin' no monkey niggas stand that close to us (Close to us)\nI ain't got no heart when it come down to my bro, yeah (Yeah)\nShe is not my dresser, she just iron my clothes, yeah (Thanks)\nPulled off in a Tesla, pulled back in a Porsche, yeah (Skrrt skrrt)\n'Bout this mozzarella, you'll get burnt like toast, yeah\nI get on that bullshit, you'll get extorted, yeah (Extorted)\nSix kids with me, didn't think 'bout abortions, yeah\nAyy, I took a thottie out of Magic\nTook her to the pent, then I woo-woo-woo, ayy\nThe private jet came with a stewardess, like ooh-ooh-ooh\nReady for war like a machine, ayy\nCame from pillies to post schemin'\nNow I got fifty hoes on they knees\nI put an X in my codeine (Oh-oh)\nBut I'm putting nothing in my weed (Oh-oh)\nAnd I took a jet right overseas (Oh-oh)\nI want some head from overseas (Oh-oh)\nI caught a case, my jewelry seized (Oh-oh)\nI started off with fifty keys (Oh-oh)\nMy Bentayga clean like bleach (Oh-oh)\nOn a yacht with blue water and blue cheese\nOn this shit like fleas, ayy\n\n[Chorus]\nEveryone know I've been killed before\nI've been bent like a centerfold\nI crap with my money, no-oh\nDrop the top, get a breeze, oh-oh-oh-oh-oh\nGot four million in jewelry, oh-oh-oh-oh-oh (Whoa)\nLet that money fly to the ceiling, whoa-oh-oh-oh-oh (Whoa-oh)\nDid you pay someone's tuition? No-oh-oh-oh-oh\nDo you own a store? No-oh-oh-oh-oh\n\n[Outro]\nAyy, I took a thottie out of Magic\nTook her to the pent, then I woo-woo-woo, ayy\nThe private jet came with a stewardess, like ooh-ooh-ooh", "image": "https://images.genius.com/ac7afa411ba9ad7bb409e411dc5f4b0d.1000x1000x1.jpg"}], "artist": "Young Thug"}