{"songs": [{"title": "The Throne is Mine", "album": "Build and Destroy", "year": null, "lyrics": "* hidden bonus track; written by Royce for Dr. Dre\n\n[Verse 1]\nI can't cater to y'all cause I'm greater than y'all\nBaby, I'm like an alien invadin to y'all\nCrews, I done proved to all of you's I'm thorough now\n(What?) I used to want an island (what?) I want the world now\nDre runnin for king, street politician\nBeats one of the things I peeped y'all to listen\nPeep how I did it, I took the rap game\nFans came and I established the campaign\nDamn shame how all you haters can mud sling\nDebatin with the press on the slate that I rubbed clean\nMost of y'all wanna be loc, that bugs me\nClaimin you thugged out and don't know what a thug means\nI'mma shine so long as the sun should burn (what?)\nI was meant for the throne from the sperm to the urn (what?)\nI don't care what y'all gotta say behind us\nJust remember me, Dr. Dre your highness - sing\n\n[Hook (2x)]\nIt's my kingdom, the throne is mine\nI'm back to reclaim what I own this time\nLet it be known, engrave it in stone this time\nI'm here to rule alone this time - what?\n\n[Verse 2]\nYo, emperor dressed in a robe, iced down\nEmeralds and rubies up in the ice crown\nIt's like a dream full of upcomin events\nMy wife is a queen, my son is a prince\nTryna breathe life in the heart of this dead market\nWalkin on top of y'all, on top of the red carpet\nPaid dues, give the world somethin to bump\nMake rules with my shoes curled up in the front\nAny bad feelings for me toward you sounds fatal\nDiscussin your death with knights of the Round Table\nPassed y'all kids, did what y'all did\nSwitch the Masion into a castle and drawbridge\nA servant for any purpose, Scottish ones\nIf she see me dressin myself, she probably run\nAll you hoes callin want us to rap more\nAct-ors can fall under the trapdoor\nI don't care what y'all gotta say behind us\nJust remember me, Dr. Dre your highness - sing\n\n[Hook]\n\n[Verse 3]\nY'all niggas wanna see me fail, don't y'all?\nNaw it's aight, tell the truth - y'all wanna see me fail, don't y'all?\nI keep heat, yo that's just me bein me\nAnd why you wanna see me and peeps, it beats me\nI thought I represented better than ever before\nIt must be cause I used the tec instead of the sword\nI'm the type of cat that'll slice a cat\nBut, you can only do so much in the knife attack\nI'm badder than savages and the rest of the vultures\nMad rappers is like court jesters and jokers\nI'm the king now and while the rest of you's loc'n\nAt \"The Chronic\" tour with tapes beggin to open\nRemember this - all you niggas in jeans and hoodies\nEither run with me and the team or runnin to me\nI don't care what y'all gotta say behind us\nJust remember me, Dr. Dre your highness - sing\n\n[Hook]\n\n[Outro]\nIt's my kingdom, the throne is mine\nBack to reclaim what I own this time\nY'all know - I'mma engrave it in stone this time\nI'm here to rule alone this time - what?\nIt's my kingdom, the throne is mine\nBack to reclaim what I own this time\nI told y'all - I'mma engrave it in stone this time\nI'm here to rule alone this time - what, what, what?\n\nDoc Dre, 5'9\", run it in 9-9\nY'all thought it was over wit?\nBack again, yo\nWe got y'all surrounded, \"The Chronic 2000\"\nY'all niggas is done, done..", "image": "https://images.genius.com/d86b45b993cdf0c53559e740521a4bba.500x494x1.jpg"}], "artist": "Royce da 5'9'’"}