{"songs": [{"title": "Extra Special", "album": "Room for Improvement", "year": "2007-02-14", "lyrics": "[Intro: Drake]\nYeah. Ho!\nIt's Drake. Uh Uh. Ho!\nDo that dance. Do that Dance\n\n[Hook: Drake]\nYou special girl, don't leave me baby\nTo find another just like you won't be easy baby\nSo, at least I know where the ones at\nBaby just promise me if you go that you'll come back\n\n[Verse 1: Drake]\nLook I ought to be thankful with women I have plenty of luck\nAnd when it comes to relationships, many is stuck\nLook at fifty you make love, thirty you have sex\nSomewhere around the tender age of twenty you fuck\nOr maybe before, I'm here waiting to score\nIt's long gone like brother's having a tape in their car\nInstead these girls taking it raw\nNow they tell you to do whatever you want because it's safe to explore\nForget, wait till it's right, now it's wait till it's more\nWait till he get gets a deal girl, wait till the tour\nSo they dance to attract me, advance and attack me\nTo the point that Drake compare me to Anthony Mackie\nBut once they have my pants and my khakis\nI tell them I'm not one for commitment and romancing exactly\nBecause, I hate waking up undressed with a dame\nAnd guessing her name, I hope this shit is destined to change\n\n[Hook: Drake x2]\nYou special girl, don't leave me baby\nTo find another just like you won't be easy baby\nSo, at least I know where the ones at\nBaby just promise me if you go that you'll come back\n\nYou special girl, don't leave me baby\nTo find another just like you won't be easy baby\nSo, at least I know where the ones at\nBaby just promise me if you go that you'll come back\n\n[Verse 2: Drake]\nI don't get it, it's like my fairy was sick\nIt's like I meet the perfect girl, and she put me through some various shit\nIt's something that I can rarely predict\nAll I know is that I can never find the love that Tyler Perry depict\nI'm guessing maybe Shemar Moore isn't really all pure\nMaybe I lie to myself and it's like a small cure\nI tell it all to her\nI gotta feeling this feeling inside is something it's like and can't be all sure\nBecause really, What is a window without a car door?\nWhy I can't settle for one instead of all four?\nMu mind is clouded, this shit complex here\nJason tell me I'mma have a baby by next year\nPsychic told me I'mma have three kids\nI don't want my daughter making a song like Teairra Mari did\nSo, I'mma change, yeah this Summer is grown\nI'm running along, before I raise one of my own\n\n[Hook: Drake x2]\nYou special girl, don't leave me baby\nTo find another just like you won't be easy baby\nSo, at least I know where the ones at\nBaby just promise me if you go that you'll come back\n\nYou special girl, don't leave me baby\nTo find another just like you won't be easy baby\nSo, at least I know where the ones at\nBaby just promise me if you go that you'll come back\n\n[Outro: Drake] (x2)\nBelieve me baby, Stevie baby\nD-R-A-K-Eezzy baby\nSo do that dance, do that dance\nGo head girl and do that dance, uh, uh, uh, uh, uh. Uh\n\nBelieve me baby, Stevie baby\nD-R-A-K-Eezzy baby\nSo do that dance, do that dance\nGo head girl and do that dance, uh, uh, uh, uh, uh. Uh\n\n[Drake talking]\nYeah because you special baby\nYeah this the remix right here\nYeah Trendsetters\nDrake, It's Southern Smoke", "image": "https://images.genius.com/c85f36c02060316fcec1ed423c60f0da.1000x1000x1.jpg"}], "artist": "Drake"}