{"songs": [{"title": "In My Head", "album": "Everready [The Religion]", "year": "2007-06-07", "lyrics": "First entry to Everready: The Religion\nIt's called \"In My Head.\" It's dedicated to my Marine homeboys, Foxes\nSecond battalion, fifth regiment, like this...\n\n[Intro: Tech N9ne]\nA lot of talent a chemical imbalance and MDMA (MDMA)\nI can't reroute it so people they hear 'bout it and tend to turn away (tend to turn away)\n\n[Verse 1: Tech N9ne]\nKinetic you bet it's somethin' movin' your head it's prophetic\nSo get it embeded let it control your bodily\nClose to lettuce my head is far from synthetic\nYou credit this vet is poetic that is merely a part of me\nThe other part it be wicked similar to psychotic\nWe kick it we frolic sickness neurotic fought at the God in me\nMixed with erotic on top of Hennessy and Hpnotiq\nYou got it a solid sub-savage knowing not of comradery\nDon't want kill ya (somethin' in my head)\nIs makin' me done deal ya (somethin' in my head)\nIs making the gun fill ya (somethin' in my head)\nIs makin' me want drill ya, can we get familiar?\nCheck, always fantasizing on gettin' sex\nWettin' that and settin' Tech up on you carressin' breast\nSweatin' that you'd get me vexed and not get your second breath\nStressed you would've been left where you was beckoned at we neck and neck\n\n[Hook: Krizz Kaliko]\nEveryone want go heaven\nBut nobody want dead\nThe place where I have no relaxation\nIs in my head\nEveryone want go heaven\nBut nobody want dead\nLiberate me Lord devastation\nIs in my head\n\n[Verse 2: Tech N9ne]\nI keep that one that'll heat ya, so you better like run better seat ya\nMight get found under the bleachers, no one'll reach ya come to the creature\n'Cause in my head is a hole, dark and deep and it grows\nActually capital G-O-D have mercy on my soul\nI'm sick as I wanna be, get the hell up from front of me\nWhen I spit at everybody yeah they gonna be feeling this for eternity\nBoss many thoughts pretty lost but I cost plenty sauce\nSoft killa crossed me tossed put 'em off in the moss\nRespect my mind everyone (somethin' in my head)\nSays if he disrespect N9ne then he done (somethin' in my head)\nWish as I could put the nine on his tongue, (somethin' in my head)\nSays ignoramus you too famous for that to be done son\nStuck 'cause I can't trust his bluff must\nClutch bust (hush hold up enough)\nWoosa goosfraba makes you holla\nSometimes you gotta do what you gotta\n\n[Hook: Krizz Kaliko]\nEveryone want go heaven\nBut nobody want dead\nThe place where I have no relaxation\nIs in my head\nEveryone want go heaven\nBut nobody want dead\nLiberate me Lord devastation\nIs in my head\n\n[Verse 3: Tech N9ne]\nSome people joke and say me loco\nThrow evil quotes but yo they don't know\nDoctor don't know, so he won't go\nIn my head it's like I said I mean I'm oh so\nFull of decay and MDMA\nSin we in way deep off in the end like many men say\nSlaughter you pay, he told me that you gotta today\nAllah hu A.K.B.A.R. with a Auda Dufe'\nIn my head, in my brain, dead am I?\nWill I shed a cry when they red Ninna\nYou might red Ninna, but never dead Ninna\nBut if you bled Ninna, then you's a dead nigga!\nYo, I feel it you feel it, can we heal it? The devil's encephal\nWe rebels get it level no matter what it becomes\nWith the heavy metal impatiently wait with a shovel\nFor the wedos who hate the negros, I think I'm losing my Lithium\n\n[Bridge: Krizz Kaliko]\nSuper savage erratic you don't say such an attic combative you don't say sick his status so there's no Beyonces there's no hope for Dontez\n\n[Hook: Krizz Kaliko]\nEveryone want go heaven\nBut nobody want dead\nThe place where I have no relaxation, is in my head\nEveryone want go heaven\nBut nobody want dead\nLiberate me Lord devastation\nIs in my head", "image": "https://images.genius.com/03fc1f30c3a9ab069072c2b38b117ffe.999x1000x1.jpg"}], "artist": "Tech N9ne"}