{"songs": [{"title": "For Example", "album": "D.I.G.I.T.A.L.", "year": null, "lyrics": "[Hook: sample from a live performance of \"The Bridge is Over\"]\nHere's another example of the KRS-One (BO!)\nHere's another example of the KRS-One (BO!)\nThey wish to battle BDP but they cannot\nThey must be on the jock of WHO? (DJ Scott LaRock!)\n\n[KRS-One]\nYeah, one-two, what? What?\nGrab any tape that you think is hard\nPut it in your tape deck and press record\nGet this - what's a real hip-hop emcee?\nIs it MTV? Is it BET?\nIs it five M-I-C's so the people can see?\nI mean, how you think you free when you act like property?\nTell me, how can you judge an MC when he's rockin\nI mean, rockin it live, not pickin his cotton\nI mean, adjustin his clothes I mean, how do you know\nBefore you come to the show, and you're not gettin cheated\nThat you're not gettin heated, that you ain't come to the club\nThinkin, \"Uh-uh - I must have been weeded!\"\nYou got to be a educated consumer\nSpend your money on MC's cause these rappers'll do ya\nAll they want is your cash, ass, glass, gas and a flick\nWhen you ask for that autograph, they ass dash quick\nBeware of the rapper, he talks like it don't matter\nHe pulls his gat while we BUST OFF the gatler\nHe's more of an actor, someone, into theater\nNot an upright MC with styles who speaks clearer!\n\n[Hook]\n\n[KRS-One]\nMC's have no time for the bar\nUnless we politickin a tape to some drunk A&R\nWe grab the mic and say who we are, KRS\nAnd start takin it to the chest of the best\nThis is not a test or a demo\nThis is when you let go of the limo, like many can't do\nThey may wanna amp you and chant new, record sellin\nBut movin the crowd is somethin that they can't do!\n\n[Hook]\n\n[KRS-One]\nC'mon!\nYou got to be mistaken, I am not your boy\nYou fake what you creatin, playin wit'cha toys\nG'wan with all that bullshit bout you bringin noise\nTime for somethin more than PO-PO-POI-POI\nAll of hip-hop ain't seventeen\nSome of us still go back to \"Microphone Fiend\"\nBack when it was just MC's and DJ's\nNo video that come on and just replay\n\n[Hook]\n\n[KRS-One]\nUhhh... uh-huh, uh-huh uh-huh\nWe can never stop, forever we rock, take a listen\nThe t'cha is back, cause rap's whack when I'm missin\nMe, I would never want the future to believe\nThat when they trust to look back on us there was no dope MC's\nThere was, all these rappers grabbin more and more money\nAnd now that I'm A&R they look more and more funny\nThey rap for platinum plaques without buildin\nA cultural strategy worthy of our children!", "image": "https://images.genius.com/d939bce0d325273abe25cbd9cbdf5405.455x450x1.jpg"}], "artist": "KRS-One"}