{"songs": [{"title": "Bastard", "album": "Bastard", "year": "2009-12-25", "lyrics": "[Intro]\nYo, fuck 2DopeBoyz and fuck Nah Right\nAnd any other fuck-nigga-ass blog that can't put an 18 year old nigga\nMaking his own fucking beats, covers, videos and all that shit\nFuck you post-Drake-ass cliche-jerking, LA-slauson rapping\nFuck-nigga-ass Hypebeast niggas, now back to the album\n\n[Tyler, The Creator as Dr. TC]\nWell, Tyler, hi, I'm Dr. TC and um, I'm guessing that your teacher sent you here to talk 'cause you were misbehaving\nUm, it's gonna be three sessions: today, tomorrow, and the next day\nSo, just tell me something about yourself...\nWell, look, if you don't talk, I mean, these sessions are going to go slower\n\n[Verse 1]\nThis is what the devil plays before he goes to sleep\nSome food for thought? This food for death, go ahead and fucking eat\nMy father's dead, well I don't know, we'll never fucking meet\nI cut my wrist and play piano cause I'm so depressed\nSomebody call the pastor, this bastard is so possessed\nThis meeting just begun, nigga I'm Satan's son\n\n[Verse 2]\nMy mother raised me a single parent so it's apparent\nThat I got love for my mother, none of you other fuckers\nAre much important I'm getting angrier while recording\nI'm feeling like the bulls, I've got a gang of wolves\nOdd Future is children that's fucked up in they mental\nSimple but probably not, fuck them\n\n[Verse 3]\nI'm tall, dark, skinny, my ears are big as fuck\nDrunk white girls the only way I'll get my dick sucked\nSuspended from school, coolest nigga without effort\nEasy to spot like black bitches with fake leopard\nSoak me up in a tampon, but keep the lamp on\nCause this album pack enough evil\nThat you can't fit inside a Jansport, go to school with this\n\n[Verse 4]\nI go from AP to JC inside a fucking week\nWaking up with random girls like \"Yo, bitch, how the fuck we meet?\"\nI stay with grandma, she always bitching about her carpet\nEvery time I walk inside the house, she always tend to start shit\nNo to drugs I never spark it, I used to be bullied for honor classes\nBy those that were slow as molasses, take this shit to school\n\n[Verse 5]\nRaquel treat me like my father like a fucking stranger\nShe still don't know I made Sarah to strangle her\nNot put her in danger and chop her up in the back of a Wrangler\nAll because she said no to homecoming, demons running\nInside my heads telling me evil thoughts\nI'm the dream catcher but nothing but nightmares I caught, go to sleep\n\n[Verse 6]\nI wear green hats because I'm fortunately lucky\nFuck me the monster said, somehow the monster's dead\nInside of me, but the thoughts it tells me are still evil\nWith this state of mind, big moves, Max Keeble\nI'm on my grind feeble, my music is either\nA fucking sin or too illegal, play this shit in church\n\n[Verse 7]\nI graduated without honors or fucking father\nHe died (I'm so sorry) No bitch, don't even fucking bother\nI wanted a brother, my mother I told her\nBut instead I got a sister, just like me with her mister nada\nSo both of our imaginations are creations of the fucking situation\nThat's having our brains racing like Dayton, wearing some fucking Heelys\n\n[Verse 8]\nI know you fucking feel me, I want to fucking kill me\nBut times I'm so serious, you think I'm silly\nI'm doing Big Style Willy couldn't touch 11\nSeven, what's religion nigga? I am legend\nI roll with skaters and musicians with an intuition\nI created O.F. cause I feel we're more talented\nThan 40 year old rappers talking about Gucci\nWhen they have kids they haven't seen in years, impressing their peers\nWith the same problem, the only way to solve them\nIs to go to Father's Day convention with a gold revolver\nLife's a salad, I'm a toss it, eat that shit up, Rick Ross it\nShit it out, bag it up, sell it, I'm so damn rebellious\nCause my mother let me do what I want\nShe wasn't careless, protective she is the bear\nThe shit is so bare, my diary isn't hid\nMy father didn't give a fuck, so it's something I inherit\nMy mom is all I have so it's never meet the parents\nWhen Danielle or Milan decide to fucking share\nThis confused boy, I wanna hug hoy, I’m bad for you kids to listen to\nSoy is not the choice, I'm bad milk, drink it\n\n[Interlude: Dr. TC]\nWhoa, umm, it seems you had a lot to say\nUh, who knows I might feel as I'm evaluating\n\n[Verse 9]\nMy wrist is all red from the cutter\nDripping cold blood like the winter, the summer\nIs never that's equivalent to me and Sarah\nWell that's not her fucking name, but I think this shit is clever\nMy niggas wanna know if I'm fucking, if I'm kissing\nBut I'm sitting here downing beers simply just wishing\nWith a tear they try to tell me but I never listen\n'Cause I don't give a shit like sitting down pissing\nEighteen, still talking to imaginaries\nHopefully they see the talent I carry just like Jimmy\nLosers can never win me, you can never offend me\nMy goal in life is a Grammy, hopefully momma will attend the\nCeremony with all my homies, I'm suicidal\nThis my Zombie Circus, I hope the majors heard this\nFuck a deal, I just want my father's email\nSo I can tell him how much I fucking hate him in detail\n\n[Outro: Dr. TC]\nWow, umm, so Tyler if you had the chance to tell him something\nWhat would you tell him?", "image": "https://images.genius.com/cb0b25f99dd81109efa8db270a933a38.500x500x1.jpg"}], "artist": "Tyler, The Creator"}