{"songs": [{"title": "All That I Want", "album": "Streetlights  ", "year": "2010-04-20", "lyrics": "[Intro:Snoop Dogg]\nHey baby girl let me scream at you this is what I want to do\nStay  baby girl let me scream at you this is what I want you to do\n\n[Verse 1:Snoop Dogg]\nYea\nI hit you on the celly waiting for me at the telly  love the way you let me bust two of them on your belly\nTell me that you need my loving I’m your fine desire sneaking out on Sundays so we can watch the wine go to the movies\nI don't think that we can but we can freak in my bed whatchu think I’m your man ?\nYou see out thing is like give and take live and make real or fake sorta kinda like real estate on the down low\nBlowing on some kush and if you down with it baby keep it on the hush don't nobody have to know baby peep it are you professional ?\nCan you can you keep a secret i know its hard to hide the way you feel especially dealing with the boss Dogg\nCuz I'm so real I don't mean to sound foul but let me check my foul and break it down\nIf you with me  baby this is how it goes down down\n\n[Chorus: J. Black]\nAnd yea that's all that i want\nNo more baby  no less\nAnd yea that's all that I want\nNo drama girl no stress\nCuz you’re the one that i want\nDont say no baby say yes\nI want to touch you all over  watch you burn just a lil closer\n\n[Verse 2:Kurupt]\nHey I hit her on the celly told her meet me at the telly come over and relax I want to bust one on the belly\nPatron grown so I splurge ten at a time something so superb we just something so superb\nFly as a eagle captured by each worm (now) she want to get a lil closer\nI’m gotra close to nostra rolling her over tic tac toe toe tic told her to come and  drop all over my big dick\nIm just joking I'm just smoking endo blowing yea you know it shes so sweet got that perfect physique\nShes the type that i like she right and so petite bounce rock skate dip on and drip\nDon't give when there's something nice fat and long to kiss on the mouth\n\n[Chorus: J. Black]\n\n[Bridge:J. Black]\nI need you to move baby\nYour body got me hypnotized girl do what you do with it lady because i swear that its making me want ya yea i want cha yea when you shake it for me bartender yea the drinks are on me\n\n[Chorus: J. Black]", "image": "https://images.genius.com/48a18f242c2b2fb8c91b44110a454db4.600x600x1.jpg"}], "artist": "Kurupt"}