{"songs": [{"title": "Rock The Bells", "album": "Radio", "year": "1985-11-18", "lyrics": "[Produced by Rick Rubin]\n\nL.L. Cool J. is hard as hell\nBattle anybody I don't care who you tell\nI excel, they all fail\nI'm gonna crack shells, Double-L must rock the bells\n\nYou've been waitin' and debatin' for oh so long\nJust starvin' like Marvin for a Cool J. song\nIf you cried and thought I died, you definitely was wrong\nIt took a thought, plus I brought Cut Creator along\nEvened up with E-Love down with the Cool J. force\nSpecializin' in the rhymin' for the record of course\nI’m a tower full of power, wind, rain and hail\nCut Creator scratch the record with his fingernail\nRock the bells\n\nThe king of crowd rockers finally is back\nMy voice is your choice as the hottest wax\nTrue as a wizard, just a blizzard, I ain't taken no crap\nI'm rhymin' and designin' with your girl in my lap\nThe bass is kickin' always stickin' cause you like it that way\nYou take a step because it's def and plus it's by Cool J\nCut Creator on the fader, my right-hand man\nWe rock the bells so very well cause that's the name of this jam\nRock the bells\n\nSome girls will like this jam and some girls won't\nCause I make a lot of money and your boyfriend don't\nL.L. went to hell, gonna rock the bells\nAll you washed up rappers wanna do this well\nRock the bells\n\nNow I'm world-wide known, whether you like it or not\nMy one man band is Cut Creator a.k.a. Philpot\nHe'll never skip it, only rip it when he's on the fader\nWhat's my d.j.'s name, Cut Creator\nNow you know, at the show, who’s on the wheels\nHe'll drive the cross fader like a cut mobile\nSo precise with a slice that you know he's greater\nWhat's my d.j.'s name, Cut Creator\nNow you know, what do you know, Earl roles the weed\nI go to the store and get Old Gold\nSo all you crabby lookin' nappy headed girls get back\nCause there's a ten to one chance that you might get smacked\nRock the bells\n\nThe bells are circulatin' the blood in your veins\nWhy are girlies on the tip, L.L.'s your name\nCut Creator's (good), Cool J. is (good-good)\nYou bring the wood pecker, I'll bring the wood\nThe bells are wippin' and rippin' at your body and soul\nWhy do you like Cool J., we like rock and roll\nCause it ain't the glory days with Bruce Springsteen\nI'm not a virgin so I know I'll make Madonna scream\nYou hated Michael and Prince all the way, ever since\nIf their beats were made of meat, then they would have to be mince\nRock the bells\n\nSo listen to the lines of rhyme, I rhyme on time\nHe'll cut the record in a second, make your d.j. look blind\nSo all you Jheri Curl suckers wearin' high-heel boots\nLike ballerinas, what I mean is you're a fruit-loop troop\nAll you gonna-be(s), wanna-be(s), when will you learn\nWanna be like Cool J., you gotta wait your turn\nSome suckers don't like me, but I'm not concerned\nSix-g (s) for twenty minutes is the pay I earn\nI'm growin' and glowin' like a forest blaze\nDo you like Michael Jackson? \"We like Cool J\"\nThat's right, I'm on the mic with the help of the bells\nThere's no delayin' what I'm sayin' as I'm rockin' you well\nRock the bells", "image": "https://images.genius.com/775ff4430005d32a460579e1bed75b42.600x600x1.jpg"}], "artist": "LL Cool J"}