{"songs": [{"title": "Suprise Me", "album": null, "year": null, "lyrics": "[B.O.B]\nWell you know who it is\nYou ain't even got to ask it\nI am not the best I am the next level past it\n[x3]\n\nHaters see me passing like damn that bastard (dammit)\nCause they outta style like the water bed mattress\nYeah yeah, they thought I'd fade to the blackness\nNow they see me everywhere like Samuel L Jackson (mothafucka)\nBut I ain't actin=', I'm only givin' classes\nAnd by the looks of these grades niggas ain't passin'\nNo, it's crazy how these niggas think\nThey be actin' like I ain't like Howard in the paint\nLike trees and Cali man, all I do is blaze\nAnd they say I'm like a zombie\nCause all I want is brains\nMine\nYes, mine mine mine\nYeah you look good girl but what is on your mind?\nThink about it\nCause all these dimes\nLike Nationwide, they just wanna be on my side\nBut baby this is all I can provide\nThe whole town'll have water if I lay this pipe\nI'm on top of the world and I'm so high\nI gotta drop down just to catch my flight\nYikes\nWhat amazing heights\nGee wilikers Batman, holy satellites\nWho the hell are you to tell me ease up on this mic?\nYou, sadly have mistaken me for someone that I'm nite\nI mean not\nI messed up\nBut I rock with this stuff\nSo my stocks just went up\nYou know my flow\nYeah it's B dot O\nYeah it's B dot O\nYeah it's B dot O\nAnd you know my flow\nYeah I hear them talkin' with that raspy shit (shhh)\nBut what's an upper class man to a graduate?\nI said {mumbling} and you laugh to it\nI'm just playin' with these niggas I ain't mad at 'em\nBut since you critics want to be that adamant\nI guess I give you reason to type on your keypad again\nYeah I buy buzz and got the whole web chatterin'\nHow ironic? In my past it ain't matter then\nWell, it comes with the territory\nMy life is not an ordinary story\nNaw, and I ain't talking big\nThis is just how I feel about the situation that I'm in\nYeah\nNo you can never walk in my shoes dawg\nEven if I got my dude to make your shoes dawg\nYou know about that south we act like fools dawg\nYour girl says she like that country smooth drawl\nThat's why there's groupies ready to remove draws\nThey be going heavy duty til that Goose gone\nEvery single day I wake up to a new song\nThat's the sound of my formal introdushon\nI mean \"tion\"\nWhat's up?\nYou know, my flow\nCause it's B dot O\nAnd it's B dot O\nAnd it's B dot O\nAnd you know, my flow\nSo to all the people that's about to hate it\nHere's how I feel about you {burps}\nThere, I demonstrated\nHa, a politician so opinionated\nSo my style is addictive like simple lemonade is\nI'm in the building and I'm finna hit the stage\nYou can feel the tension and the sense of mental stimulation\nIf she's with me than she's not your lady\nAnd as we can see, she loves my babies\nMe go so crazy\nMe go so loco lately\nMostly because they raised me\nNo heat, no cold, no A.C\nYeah I'm just saying how I feel up in this booth\nOne of y'all surprise me and do something new", "image": "https://images.genius.com/3252379f345638f5b880f5055e0ca791.540x540x1.jpg"}], "artist": "B.o.B"}