{"songs": [{"title": "Lightworks", "album": "NBA 2K8 Soundtrack", "year": "2013-12-12", "lyrics": "[Intro: sample, (Talib Kweli)]\nThis is Bendix, the tomorrow people (Today)\nWhat is the magic that makes one’s eyes\nSparkle and gleam, light up the skies\nThe name of the game is lightworks\n(J Dilla, Kweli, Q-Tip, ayo, ayo, ayo, ayo, ayo)\n\n[Verse 1: Talib Kweli]\nBlast from the past, yo, I’m back from the get go\nLet’s go, let’s go, rap is special\nYa’ll dudes gas like snaps on the petro\nFlashy, like the gun blast in the ghetto\nSparkling like fireworks when we light up the sky\nWe independent like the 4th of July. Why?\nWe ask a question that you forced to reply to\nShine through the night, through the orange, sky blue\nRhyme for survival, [?]\nLike Big Jay or Skyzoo, fly with the haikus\nA pro with the pro’s, still worse with the verse\nDispersin’ the hurt to rappers gotta work with the nurse\nMade it through first thank Q-Tip for taking a verse\nSee how they all up in my mug like they takin’ a purse\nNow that’s hard, like the population of Rikers\nThis here easy, it’s lightwork\n\n[Chorus: sample]\nThe shine effect sparkle and gleam\nLight up the skies\nThe name of the game is lightworks\nLight up the spliffs\nThe name of the game is lightworks\n\n[Verse 2: Q-Tip]\nDilla still in here, Kweli he still in here\nAbstract on the track for filming fulfillment’s here\nWatch ya back, boys, there’s culture vultures everywhere\nWalking the calm streets thinking that theirs peace in there\nDraow, they blind sided up in they creepin’ in\nAfter the rush I’m drinking ice quarter waters to sustain\nFor the long haul advice is a order\nMy vertical up that no way on the way back\nCompetition, I eat that I’ll get sneaker contract\nI’ll mary a vixon, she’ll come with the tricks and\nShe’ll take all my mansions and all of my riches\nAnd leave me with the flatscreen and my new game device\nAnd my little black book, my boys and my brand new life\nNow I’m playing on my TV screen\nBeating niggas down looking Bruce Banner green\nLookin’ at the high score, do you want more?\n\n[Chorus: sample]\nThe shine effect sparkle and gleam\nLight up the skies\nThe name of the game is lightworks\nLight up the spliffs\nThe name of the game is lightworks\n\n[Verse 3: Busta Rhymes]\nCheck, niggas say my flow is bananas\nYes, flow’s sicker then another nigga\nLooking up another man’s ass\nYes, you can have the mayonaise\nBust your head and bang bitches\nUp they cope and cabanas\nAnd leave with yo bitch\nMy niggas will lay you out on a canvas\nMy clique consists of red and blue flags\nWe full of bandanas\nThorough like desperados, Antonio Banderas\nMy D crash floors, diamonds, them shits\nAs clear as a sunny day not a cloud in a sky\nMy nigga, whereas, yours look like\n“Da da da, skippity boop” period\nI’m so serious, flows makin hoes delirious\nYou wanna find out?\nBitch jump on my dick if you curious\nJ Dilla the godfather of the funk dubious\nWhile you niggas think you the cell\nI be the cell nucleus\nYou’s the stupidest\nIf you think that you can ever contest the kid\nGet outta here with ya groupie ass\n\n[Chorus: sample]\nThe shine effect sparkle and gleam\nLight up the skies\nThe name of the game is lightworks\nLight up the spliffs\nThe name of the game is lightworks\n\n[Outro: Busta Rhymes]\n[?]", "image": "https://images.genius.com/3878301b6e3b902e69604918cadecf2c.1000x1000x1.jpg"}], "artist": "Busta Rhymes"}