{"songs": [{"title": "Nikki (Commentary Version)", "album": "Under Pressure (Commentary Version)", "year": null, "lyrics": "'Kay, \"Nikki.\" Spoiler alert here, if you- if you don’t understand the concept of \"Nikki,\" or you haven't heard the song yet, please do listen to that before you continue with this, please. For me, I was always- I'm- I’m just a huge fan of music. You know, I wear my heart on my sleeve, my inspirations on my sleeve, and one of them is Kanye West. And I always loved his song \"Addiction.\" You know, \"What's you addiction? Is it money? Is it cars? Is it [gibberish]? I got addict-\" You know, it's just like, I wanted to do something as well\n\nBut like I said, I grew up in a- in a pretty crazy household and I saw, you know, the use of narcotics and alcohol, and how it destroyed my family, so I-I never really went down that, so I-I never really had an addiction except cigarettes... And I thought, \"Well, that's kinda corny.\" Like, you know what I mean? Cigarettes is so frowned upon. How can I do it in a way where people can relate to it? And then I-I-I discovered the concept of Nikki, and taking it much more further than just this song: putting her all over the album. And if I talk about Nikki as if she is in fact a woman, then it would- it would- it would allude to that\n\nAnd um, but it's even before then. You know, I mean nine months before the album was even out, I would hashtag \"Who's Nikki?\" on Twitter, this or that. Who's Nikki? Who's Nikki? And everybody was wondering, everybody thinks, \"Is it his mom? Is it an ex-girlfriend? Is it it a this? Is it his sister? Is it-blah\" And everybody wants to know, everybody wants to know. Then you hear me on the record, on \"Bounce,\" \"In the whip, everyday wit’ Nikki, she be ridin’ wit' me.\" You know? Different things like that, and you’re like, \"What? Who is this chick? Who is this chick?\"\n\nAnd then you get to the song, and I-I-I wrote it, as almost as if it was a break-up song. \"I love it when you're fresh. I love it when I take your top off and we share the same breath.\" Like, uhh, matters of making love, or this or that. And when you finally get to the end and it's like \"nicotine,\" it's like that \"wow\" moment, you know? I remember watching SAW for the first time and realizing that the killer was in the room the entire time, and I was like, \"Oh my god!\" You know what I mean? So, that’s what I wanted to create, and I think I did my best to create a song where it's not just nicotine. I could be heroin, it could be alcohol, it could be sex, it could be gambling, it could be whatever your thing is, um... Maybe it isn't even that bad, or maybe it's just a man or a woman that you're dealing with. Or... I-I wrote it so surface level that the listener can take it however they want, and then deep down, you would know what the song is about", "image": "https://images.genius.com/5ba79e87d2e7e865cbf9187de5396056.1000x1000x1.jpg"}], "artist": "Logic"}