{"songs": [{"title": "Sock It 2 Me", "album": "Supa Dupa Fly ", "year": "1997-07-15", "lyrics": "[Intro: Missy Elliott]\nHehe, nigga\nI'm nasty\nDo it, do it, do it, do it, do it\nNo, no, no\n\n[Verse 1: Missy Elliott]\nI was looking for affection, so I decided to go\nSwing that dick in my direction, I'll be out of control\nLet's take it to perfection, just you and me\nLet's see if you can bring, bring, bring the nasty out of me\nN-n-n-now sock it\n\n[Chorus: Missy Elliott]\nOoh ahh, sock it to me like you want to, ooh (oh)\nI can take it like a pro, you know (know)\nDo it long bro with the back stroke (hey)\nMy hormones jumping like a disco (hey)\nI be popping mess like some Crisco\nAll you gotta say is Missy go\nAnd when you say go I won't move slow (slow)\n\n[Verse 2: Missy Elliott]\nI'm at your house around midnight (midnight), don't fall asleep\nIt'll just be me, me, me on a late night creep\nI'ma show you thangs that you can't believe\nJump in this b-e-d, and won't you sock it to me?\nOh no, s-sock it to me\n\n[Chorus: Missy Elliott]\nOoh ahh, sock it to me like you want to, ooh (sock it to me)\nI can take it like a pro, you know\nDo it long bro with a back stroke (hey)\nMy hormones jumping like a disco (hey)\nI be popping mess like some Crisco (heeeey)\nAnd all you gotta say is Missy go (ohhh)\nAnd when you say go I won't move slow (slow)\n\nOoh ahh, sock it to me like you want to, ooh\nI can take it like a pro, you know\nDo it long bro with the back stroke\nMy hormones jumping like a disco\nI be popping ish like some Crisco\nAnd all you gotta say is Missy go\nAnd when you say go I won't move slow (uh-huh, yeah, yeah, yeah, yeah, yeah, yeah)\nSock it to me\n\nOoh ahh, sock it to me like you want to, ooh (ooh)\nI can take it like a pro, you know (you know)\nDo it long bro with the back stroke\nMy hormones jumping like a disco (hey)\nI be popping mess like some Crisco (hey)\nAnd all you gotta say is Missy go (heeeey)\nAnd when you say go I won't move slow\n\n[Verse 3: Da Brat]\nUh\nWhy Missy be socking it to niggas like Ree-Ree?\nThe baddest industry bitches of the century\nHit hard like penitentiary dick\nFinally admitted that we the shit combination is lethal\nPopping Patron with Missy in the 600 with no see-through\nSuffer the repercussion fucking with shit like this\nWe parlay puffing\nConstantly making niggas suffer the consequence\nGotta get these ends bitch\nHouse in the Chi with a Caddy, crib in Atlanta with a Benz\nNiggas been huffing and puffing but ain't try shit\nGot plenty motherfuckers that'll ride quick\nBesides, kid wanna bust?\nTrigger finger itch when you fucking with me\nJealous because I live more plush\nMe and Missy leave a nigga with a head rush\nBring the ruckus, plus...\nI'm telling 'em, push and pickin' up profits\nFor what I'm selling, never gon' stop it\nSocking it to niggas and rocking it\nDropping 'em on the spot\nHeat up any block or record shop\nKnocking you off of your socks\nGuaranteed platinum, watch two of the coldest bitches get hot\nI be the B-R-A-T, her be Missy\nWe some bad bitches: who be fucking it up?\nI'm the B-R-A-T, her be Missy\nAnd we some bad bitches: who be fucking it up?\n\n[Outro: Da Brat]\nI'm your nigga for life, baby (haha)\nLet's continue to drive all this motherfuckers crazy\nYou know what I'm saying?\nYeah, Timbaland, I see you, baby\nI feel you, sock it to 'em, goddammit\nIt's 9-7, this the motherfuckin' bitch era\nWhat y'all niggas wanna do?\nThe Brat-tat-tat on that ass once more\nI'm out the door motherfucker, yeah, uh", "image": "https://images.genius.com/aee95eef02d3d7213acf36958344639d.460x460x1.jpg"}], "artist": "Missy Elliott"}