{"songs": [{"title": "Rock Star Freestyle", "album": "The S. Carter Collection", "year": null, "lyrics": "[Intro: Jay-Z]\n(AAOOOWWWW!!!) it's so rock and roll\nJay skateboarder...\n\n[Verse 1: Jay-Z]\nI be the king of the Roc, there is none higher\nFuck 'Jay-Z' - y'all should call me sire\nI won't stop rocking 'til I retire\nI got Lyor rich, y'all got niggas fired\nI'm a cash cow, nigga, I'm 'bout to cash out\n'Bout to drop The Black Album and back out\nI ain't gotta come back out to pull that Maybach out the garage rap's my hobby, spending money's my job\nArmy in the cup (cup), Giorgio Armani special cut\nScooby Doo's walkin' on you mutts\nI'm back on it the famous face with the mask on it\nPlayin' laser tag with the mag, you can not want it\nYou can get it in a New York minute\nI draw a square and I dare you to walk in it\nListen, you're a square, don't get your corner bended\nYou're a circle, I will hurt you, you're a zero, I'm a hero\nI should fear no man but God\nYet and still I could chill in the City of God's in Brazil\nI'm that real was selling crack in the building\nBack when selling crack in the building was a big deal, I'm that chill\nIt's like having ice on the face of a watch when I enter the spot time stands still\nIll, check out the metaphors I build\nMade me bigger than U.S Steel, tell em' Phar-real\n\n[Hook: Pharrell (Jay-Z)]\nYou think that you don't have to ever quit\nYou think that you can get away with it\nYou think the light won't be ever lit\nIt's almost over now (the game is Hova's now)\nSomething on your chest, better get it off\nThey'll be no one left when we set it off\nWe ain't gonna take it no more\nSaid it's almost over now (the game is Hova's now)\n\n[Bridge: Pharrell (Jay-Z)]\nYou, can't be me, I'm a rock star\nI'm rhymin on the top of a cop's car\nI'm a rebel and my .44 pops far\n(It's almost over now, the game is Hova's now)\nI guess, you ain't heard that we swallow guys\nIt's too damn late to apologize\nWhen you see the mantle or will you see the skies\n(It's almost over now, the game is Hova's now.. nigga!)\n\n[Interlude: Jay-Z]\nIt's so motherfuckin' rock and roll Jay skateboarder\nI wanna send a, special shout out to Bleek, man\nHahahaha, yes, Baseline Recordings\nS Dot collection in stores\nBlack Album 'bout to change the face of music\n(Yes, yes, yes)\n\n[Hook: Jay-Z]\nYou, can't be me, I'm a rock star\nY'all rhymin' from the back of a cop car\nY'all pointin' niggas out like, \"there they are\"\n(It's almost over now, the game is Hova's now)\n\n[Verse 2: Jay-Z]\nAs tough as niggas is talkin', it's no wonder I'm still walking\nI've been runnin' New York so long I'm exhausted\nNow fuck forfeit, nah get the fuck off it\nOr get knock the fuck off it\nAnd I'm talking to uh, fuck it you're all sick\nAnd I'm fucking with you ma 'cause I don't give a fuck about your boyfriend\nI'm spiteful, if I don't like you\nI'm liable, to buy you, then drop you\nI son niggas like I adopted you, deliver shots like a doctor do\nNot the one from The Watcher 2\nIt's Young, I'm back your soldiers down\nIt's almost over now, the game is Hova's now\n\n[Outro: Jay-Z]\nHa ha ha, yes! Lenny motherfucking S has just walked into the building\nS. Carter Collection\nKicks is mean, Black Album in stores\nGuru close the door on these niggas!\nLet's go!\nLet's go!\nI'm out this motherfucker", "image": "https://images.genius.com/0572d3c2a8305ab228c6cfdc3005ee89.300x300x1.jpg"}], "artist": "JAY-Z"}