{"songs": [{"title": "Nothing Out There for Me", "album": "Under Construction", "year": "2002-11-12", "lyrics": "[Intro: Beyoncé, Missy]\nThere ain't nothin' out there!\nA Missy Elliot exclusive\n\n*phone ringing*\nI know one thing Beyoncé better not answer this phone\nHundred ladies ain't free, I ain't got no money either shoot\nWe 'posed to been at the club\nHello?\nBeyoncé I know you ain't lettin' dat broke down, insecure\nLL Cool J wanna be nigga keep you in da house for another Friday\nYo just, just go ahead I'mma stay here wit' my man\nAin't nothin' out there for me\n\n[Verse 1: Beyoncé (Missy)]\nMy man don't like my friends\n(Girl yo man ain't no good why he tryin' to keep you in?)\nHe say they influence me\n(If I was an influence I woulda been said leave)\nBut boy I love him so\n(Girl we late for the club, why you still don't wanna roll?)\nCuz I got my prize right here\n(See, the guys at da party)\nAin't nothin' out there for me (Come on)\n\n[Chorus: Missy & Beyoncé]\nAin't nothin' out there for me, this is where I wanna be\nI done already been in the streets\nAnd ain't came across nothin' so sweet\nHe's the only man that I love, and I don't need more than one\nSo don't worry when I'm hangin' out\nHe's the only one that I'm thinkin' about\n\n[Verse 2: Beyoncé (Missy)]\nI know he's insecure, everytime I leave out the door\n(You lettin' him spoil yo' night? Live ya life, you ain't even his wife)\nHe ain't gotta worry bout' me cuz' I got somethin' more sweet\n(Oh, you must got a diamond ring)\nAnd I know I'm so lucky ain't nothin'\n\n[Chorus: Missy & Beyoncé]\nAin't nothin' out there for me, this is where I wanna be\nI done already been in the streets\nAnd ain't came across nothin' so sweet\nHe's the only man that I love, and I don't need more than one\nSo don't worry when I'm hangin' out\nHe's the only one that I'm thinkin' about\n\n[Bridge: Beyonce]\nI really love him, he's my baby fo sho (my baby)\nI can show him, I love him more then ever before (And I love him)\nAnd he don't know I'm in love\nLike the time that we met (I adore him)\nI adore him and no man has come closer then that (I love him)\n\nI really love him, he's my baby fo sho (my baby)\nI can show him, I love him more then ever before (And I love him)\nAnd he don't know I'm in love\nLike the time that we met (I adore him)\nI adore him and no man has come closer then that (I adore him)\n\n[Chorus: Missy & Beyoncé]\nAin't nothin' out there for me, this is where I wanna be\nI done already been in the streets\nAnd ain't came across nothin' so sweet\nHe's the only man that I love, and I don't need more than one\nSo don't worry when I'm hangin' out\nHe's the only one that I'm thinkin' about\n\n[Outro: Beyoncé, Missy (Beyoncé)]\nLook, you goin' or what?\nGo ahead I'mma stay here wit' my man\nAin't nothin' out there for me\nThere's a lotta guys wit' cash and they like to spend money fast\nNow is you sure about dat?\nI'm chillin' wit' my man wha part don't you understand?\nYeah I'm sure about dat\nI think you should really go, I heard the party is outta control\nMake sure you sure about that\nI don't care about no club\nCuz my man is all I love, yeah I'm sure about that\nDon't let em' blow ya high, go out and have a nice time\nIs you sure about that?\nGirl I do not get high and wit' him I'm spendin' all my time\nYeah, I'm sure about that\nOk stay wit cha man, I'll be at the club doin' my dance, woo! (You’re the only one that I'm thinkin' about)", "image": "https://images.genius.com/5dfa9016abf58bcec676c0b77a31f2bc.1000x1000x1.jpg"}], "artist": "Missy Elliott"}