{"songs": [{"title": "R.E.A.L.I.T.Y.", "album": "KRS-One", "year": "1995-11-07", "lyrics": "Reality, ain't always the truth\nRhymes Equal Actual Life, In The Youth\n\n\"These are the streets!\nShit is real out here!\nThis ain't no fuckin joke!\"\n\nI lived in a spot called Millbrooke Projects\nThe original Criminal Minded rap topic\nWith twenty cents in my pocket I saw the light\nIf you're young gifted and black, you got no rights\nYour only true right, is a right to a fight\nAnd not a fair fight, I wake up wonderin who died last night\nEveryone and everything is at war\nMakin my poetic expression hardcore\nI ain't afraid to say it, and many can't get with it\nAt times in my life, I was a welfare recipient\nI ate the free cheese, while the church said believe\nAnd went to school everyday, like a god damn fool\nWell anyway, here I am, chillin at the party\nBrothers lookin at me like they wanna kill somebody\nA cypher manifested in the center of the jam\nI got to show these wack rappers really who I am\nIt's me against them, so I clear the phlegm\nAnd wage the war, hardcore to the end\nFor someone lookin inside, yeah from the out\nIt seems like disrespect is what rap is all about\nBut hip-hop as a culture, is really what we give it\nBut sometimes the culture contradicts how we live it\nCause every black kid lives two and three lives\nThe city's a jungle, only the strong will survive\n\nReality, ain't always the truth\nRhymes Equal Actual Life, In The Youth\nReality, ain't always the truth\nRhymes Equal Actual Life, In The Youth\n\nEvery single day I hear lie after lie\nLike \"Black people don't die, we multiply\"\nSo when I kick a rhyme I represent how I feel\nThe sacred street art of keepin it real\nWhy I gotta listen, to somebody else?\nHow they got wealth, let me talk about myself\nBut all I really got is hip-hop and a Glock\nThe results are obvious, if I'm confined to my block\nOccasionally, in the city I'm released\nTo meet other beasts, lookin for the feast\nWe grunt and growl, on the prowl, as the air gets thinner\n\"Yo yo there he go, him,\" there's the dinner\nWhite meat, carryin a bag of some sort\nLife is short, white meat is quickly caught\nA scuffle a muffle yet none of us hesitated\nLike Mother Africa, white meat is violated\nWe quickly dissapear, like Santa's little elves\nAnd go into a area to fight amongst ourselves\nWe say, \"peace/piece\" cause that's what we really want\nA piece of the pie that America flaunts\n\nReality, ain't always the truth\nRhymes Equal Actual Life, In The Youth\nReality, ain't always the truth\nRhymes Equal Actual Life, In The Youth\n\n\"Oh shit!\"\n\nThe truth is that police must serve and protect\nREALITY is black youth is shown no respect\nThe truth is government has a war against drugs\nREALITY is government is ruled by thugs\nWith all this technology, above and under\nHumanity still hunts down one another\nRappers display artistic cannibalism\nThrough lyricism, we fight each other over rhythm\nThrough basic animal instincts, we think\nSo the battle for mental territory is glory, end of story\n\nReality, ain't always the truth\nRhymes Equal Actual Life, In The Youth\nReality, ain't always the truth\nRhymes Equal Actual Life, In The Youth\nYeah\n\n\"These are the streets!\nShit is real out here!\nThis ain't no fuckin joke!\"", "image": "https://images.genius.com/78316fa7efcf948425107910e5b3a92b.300x300x1.jpg"}], "artist": "KRS-One"}