{"songs": [{"title": "Started From The Bottom (Freestyle)", "album": null, "year": "2013-05-06", "lyrics": "[Verse 1]\nStarted from the bottom now we here\nWe were sellin’ things, pullin' strings - puppeteer\nStarted with a dollar now I’m jumping out the Lear\nAll my niggas behind me, you can find me in the air\nIn the car smokin’ loud on my way to Mr. Chow’s\nI say: “ain’t it funny now, nigga, this bracelet’s fifty thou”\nHe say he gon’ hit me, how? I keep shooters all around me\nQuicker-picker-up your bitch, that pussy wet and I be Bounty\nI got all these haters frontin’ just from lookin’ at my pictures\nPlottin’ on my Instagram, they wanna follow me like Twitter\nOn my way home…\nBut I’mma hit her, did I mention, 30 grand’ll get you gone\nYou’ll come up missing ‘cause my cake long\nWhere your real friends at?\nHold up, fuck that, nigga, where your girlfriend at?\nShe probably in the VIP where all her girlfriends at\nShe know that you be hatin’ on me and I still hit that, damn\nYou gon’ need a green card for the Cuban link (ouch)\nCancel my account, I’ll probably move the bank\nWhen you see them hammers out you’d best not move a blink\nFN57, fuck around, shoot through a tank\nBitch, shake that ass, go on, shake them titties\nBitch, shake that ass like you work at Magic City\nI be bustin’ bottles, ain’t talkin’ ‘bout with Drizzy\nProbably be with OVO and I be in Toronto city\nWith yo fake ass, and yo fake weed\nFrontin’ on a real nigga, bitch say cheese\nAnd put your flash on just to catch the AP\nDiamonds thunderin’ all in that bitch, I call it KD\nHold up – hold up, wait a minute, y’all thought I was finished?\nI popped twenty bottles, that was just a scrimmage\nNigga, you ain’t ballin’, you pop twenty and you finished\nGot you fuckin’ up your re-up every time we in the building\n‘Cause we started from the bottom now we here\nSippin’ Rosé with Rozay and it’s Belaire\nI signed with MMG and did it in a year\nI started with a circle and I turned it to a square, ya dig?", "image": "https://images.genius.com/6929169de7116d41676151bdea5cc773.1000x1000x1.jpg"}], "artist": "Meek Mill"}