{"songs": [{"title": "Queens, NY", "album": "The Big 10", "year": "2011-12-09", "lyrics": "[Paris]\nI string em along on some acoustic guitar shit\nTell em park it in front of Neiman Marcus\nI need that, I need that\nSaid we gon chill, where the weed at, the weed at?\nSaid you got a Spider, where them keys at? Them keys at?\nLiving on em, shitted on em ?\nI'm hotter than the sauna, ? is under\nCalm yourself before you get dealt with\nHad the medics working on your pelvis\nDOA there's nothing left to say\nWent down like an hourglass\nParis 1st class regardless\nFake bitches, not responsive\nMe, I'm in the streets rocking a piece, that's retarded\nIn the diamond district with Jacob\nMaking you, you little clones wanna save up\n\n[Hook - 50 Cent]\nWe come from Queens where we are taught to handle\nBeef on our own\nYou call up cops, we get it poppin\nWe be out with the chrome\n\nWhere Brooklyn at? Where Bronx at? Where Harlem at?\nWhere Statan at?\nWhere Brooklyn at? Where Bronx at? Where Harlem at?\nWhere Yonkers at?\n\nAll my men is caped up, stingy with the snatch\nCause niggas get too attached\nSleep with the ratchet under the mattress\nNatural: my cat got a 5 o'clock shadow\nIt don't matter cause niggas is still badder\nYou chicks is getting fucked\nI'm on top, that's how I bop\nLuxury every stop\nEat it or beat it, you should already know my friend\nYou're not needed: next nigga, remix\nWord to everything with on G shit\nFuck with me, give me a reason\nFeel something hot, change the whole season\nFor the greater good, make you face your demons\nIt's the loca, caramel mocha\nBitches is on their sofa, I'm taking over\nYou now rocking with the best mama\nBombshell hood hottie in the egg-shell Bughatti, oh!\n\n[Hook]\n\n[50 Cent]\n(Queens will) ease on em, squeeze on em\nWe'll dump the .223's on em\nBreeze on em, lit the trees on em\nIn the bandanna, make em think it's gang-related\nWe on that gritty shit, the city shit\nNew York New York\nYou come through on some pretty shit\nGet outlined in chalk\nI get busy, I get busy, I'm strapped now\nI'm tryna say I want you motherfuckers to act out\nI had that ass sprint towards the door when I back out\nDon't do it, don't you do it, don't you do it\nDon't make me step to you\nHoly moly, rolly icy oyster perpetual\nDiamonds blinking like hey, just take a look at it\nI'm a regular bad man, they say I'm a mad man\nFuck a mask and gloves, I lay it on bare hands\nWe come from a war zone, them South side streets\nWhere anything and everything gets gunned to eat", "image": "https://images.genius.com/ebcbd791d9dec323345c03a3341cac73.320x285x1.jpg"}], "artist": "50 Cent"}