{"songs": [{"title": "Self-Esteem", "album": "Brass Knuckles", "year": "2008-09-16", "lyrics": "[Nelly]\nYou got to believe in yourself\nDon't let nobody tell you what you can't be\nYou got to believe in yoursel-elf, yeah\nAnd everything else'll work out, you'll see\nOhh (ohh) ohh, ohh, hoh!\n\n[Hook: Nelly]\nYou got to believe in yourself\nDon't let nobody tell you what you can't be\nYou got to believe in yoursel-elf, yeah\nAnd everything else'll work out, you'll see\nOhh, ohh, ohh, ohh\nI think I - naw, I know I can\nI think I - naw, I know I can\nI think I - naw, I know I can\nI know I can, I know I can, ay\n\n[Nelly - over Hook]\nAy, yeah\nNobody, uh-uh uh uhh\nEverybody I think I...\nUhh, uhh, uhh, uhh\n\n[Nelly]\nYou see my poppa was a rollin stone\nAnd my momma had problems of her own\nBut I still managed to make it out okay\n... ohh, ohh\nAlthough I'm hailed as a hometown hero\nStill in my hometown I'm seen as a negro\nBut man, that's okay\nUh uh uh uh uh uh\nIt's so many obstacles in life to overcome\nAnd as soon as you jump over one here come another come\nBut we got to be strong, and set examples for our sons\nIf the sun don't shine, then the decayin has begun\n\n[Hook]\n\n[Nelly]\nUhh, uhh, uhh, uhh\nThey say I'm old enough to go to war\nBut I ain't old enough to play in the NBA no more\nNow you tell me, what's wrong with that?\nAh ah ah, ah-ah ah ah\nI pledge allegiance all the way to Iraq\nBut ain't nobody pledgin to me when I get back\nTell my Uncle Sam he wrong for that\nAh ah ah, WOO!\nYou see my self-esteem, I'm never leavin home without it\nThey told me I'd never make it, they told me I ain't doubt it\nNow tell me whoever make it, now tell me I ain't got it\nI'm seein No Limits nigga, who sayin I ain't Bout it?\nWOO!\n\n[Hook]\n\n[Chuck D - over Hook]\nThat's right, you gotta believe it y'all, c'mon\nI know I can\nI think I - naw, I know I can\nI think I - naw, I know I can\nKnow I can, know you can\n\n[Chuck D]\nRock on Nelly, rock on my brother\nKeep your head up over the storm, young fella (hoh!)\nGot a letter from the government, opened and read it\nUhh, and told 'em all to forget it\nC'mon, cause we BELIEVE in the future\nUncle Sam sent his man to recruit ya\nYou still can't trust it, cause you came this far\nEnd of discussion, when you KNOW who you are\n\n[Hook]\n\n[Chuck D - over Hook]\nThat's right believe, c'mon now\nDon't let nobody tell you, what you can be\nC'mon Nelly, tell 'em man\nThat's right, rockin it positivity, that's right\nI know I can, I know I can\nI think I, I know I can\n\n[Outro: Chuck D]\nYou gotta believe it\nYou gotta believe, my brother\nYou keep doin your thing\nThat's right, keep that head up\nAll the way to the future\nThat's right, for the babies baby\nFor the babies", "image": "https://images.genius.com/c4d8605dff947c8e53f29c6880512a28.645x645x1.jpg"}], "artist": "Nelly"}