{"songs": [{"title": "Flaws", "album": "Slime Season 2", "year": "2015-10-31", "lyrics": "[Intro]\nI be the Thugga\nWho are you?\nI don't know, I don't know\nAyy, ayy\n\n[Chorus]\nRosé goin' right inside the kitchen\nI might be a lame if I don't pay that ho tuition\nI find out like two weeks ago that I was pimp\nI don't stack that shit by the four 'cause I'm not a shrimp\nMan I do it, put that shit on everything she know I do it\nFuck that work I might not do it (Sike!)\nLike my daddy or the school, I might listen to it\n\n[Verse 1]\nMy clothes they by Elizabeth Taylor baby\nFuck on your lil' bitch and get to moving with the skaters baby\nI can go around the bitch like equators baby\nAnd I feel free like the mothafuckin' nature baby\nThat lil' bitch fit the description like a blazer baby\nAnd she from L.A. just like the mothafuckin' Laker baby\nI'ma fire shots off like I know Brian Nichols\nI just might ride or die for my niggas\nThey talkin' life sentence I'll try with my niggas\nAnd I will beat trial with my niggas\nHow you gon' eye my niggas?\nTell me, how you gon' try my niggas?\nHow you goin' back and forth ‘bout my niggas?\nFlaws and all my nigga\n\n[Bridge]\nFlaws and all, fell in wit' my dawgs\nFlaws and all, even with my paw\nVersace drawers for your broad\nFlaws and all\n\n[Chorus]\nRosé goin' right inside the kitchen\nI might be a lame if I don't pay that ho tuition\nI find out like two weeks ago that I was pimp\nI don't stack that shit by the four 'cause I'm not a shrimp\nMan I do it, put that shit on everything she know I do it\nFuck that work I might not do it (Sike!)\nLike my daddy or the school, I might listen to it\n\n[Verse 2]\nTell me how you see a nigga take the spots, and knock a nigga straight off his spots\nI mean how the fuck you think you gon beat the Thugger\nDefeat the Thugger, Don’t bleach Young Thugger\nI mean how the fuck, you’ll need the Thugger\nYou’ll please the Thugger, you’ll eat the Thugger\nNo leasing Thugger, yeah, No leasing Thugger\nThe bitch so clean it's a shame no one love her\nYeah, never love these bitches\nWhen I ran my money up I started duckin' these bitches\nShe eat the dick so much, I ain't never seen the bitch in the mofuckin' kitchen\nBaby I love you, in a house full of grown folks, baby I love you\nSwear to God, you my bread and butter\nYou can get my all if the Feds destroy us\nI'ma keep my feet in these streets\nLike a \"D\", we can go straight overseas\nPut purple in my brain just like a leaf\nIf the bitch got class, yeah, she can come with me\nI ain't gotta tell these hoes, they know I'm prince of the city\nI just might pull up with bad bitches and take 'em to the trenches\n\n[Chorus]\nRosé goin' right inside the kitchen\nI might be a lame if I don't pay that ho tuition\nI find out like two weeks ago that I was pimp\nI don't stack that shit by the four 'cause I'm not a shrimp\nMan I do it, put that shit on everything she know I do it\nFuck that work I might not do it (Sike!)\nLike my daddy or the school, I might listen to it\n\n[Bridge]\nFlaws and all, fell in wit' my dawgs\nFlaws and all, even with my paw\nVersace drawers for your broad\nFlaws and all", "image": "https://images.genius.com/2b1dcde62657935e97ccf20a99636263.1000x1000x1.png"}], "artist": "Young Thug"}