{"songs": [{"title": "Body Rock", "album": "Lyricist Lounge Volume One ", "year": "1997-01-01", "lyrics": "[Intro - Mos Def]\nAlright ugh, alright, you gotta slow down, I'm trying to\nAight, yo,I oh, I only took a little bit of Spanish, you gotta\nAight I hear what you're saying but yo, alright, okay\nAlright okay, alright okay, okay\nAlright okay, (I'm feelin you), okay\nAlright okay, alright okay, okay\nAlright okay, (I'm feelin you), yo\n\n[Hook]\nAll my people in Brooklyn and you know we're hot, I say:\n(We don't stop the Body Rock)\nAll my people in Queens, and the land in between, say we:\n(Don't stop the Body Rock)\nShaolin and L-I, say you know we're fly, say we\n(Don't stop the Body Rock)\nFrom the East to the West, son, we take it to the chest say we\n(Don't stop the Body Rock)\n\n[Verse 1 - Mos Def]\nCheck me out y'all\nI'm in the lab with Ab, I got the pen and pad\nMy man T-A-S-H take it to yo' breastplate\nIt's the Mighty Mos Def, complete the trilogy\nJust shot myself a dime, see are you feeling me?\nSon I'm wicked and nice when I'm on facility\nLet me take a sec to review what I wrote\n.. \"Mos Def and does it sound far fetched?\" OK it's dope\nLet's record this ('cord this) they gonna award this (award this)\nAnd all area crew is gonna applaud this {*clapping*}\nAnd when we step to the plate Pah it's flawless\nMy man T-A-S-H with styles glory great\nGreat, great great, great great\n\n[Tash]\nUp next we got CaTash with that West coast rhyming\nBombing niggas with the style as dangerous as mountain climbing (ahhhhhhh)\nCause the Alkie words I'm spitting be twisting while you listening\nPlus I'm in this motherfucker with the Likwit coalition (woo)\nThat'll leave you in position, twisted backwards like yoga\nWhile you staring down my throat like, \"Is he drunk or is he sober?\"\n(Who knows?!) All I know is Tash got flows (woo)\nAnd got the technique to get the ladies out of they clothes\nI been overly exposed to the forty-oh's and chickens\nSo I'mma keep it pumping til the beat stop kicking\nOr til the plot thickens, cause this is how we do\nCaTashtrophe, Mos Def, and the brother man Q!\n\n[Q-Tip]\nWhat's up Tash, hey yo, Tip can't call it\nSure as Mos is Def and you Alkaholik (right)\nI'mma be surfing at, thing that's worth dealing (uh-huh)\nHypodermically, shoot up your feeling (uh)\nFiguratively speaking, of course, now (right)\nOld and greediness seeking it's course now (uh)\nWhat we gonna do? Eradicate them\nShoot them from the jam, they be diseased phlegm\n\n[Mos Def]\nTash Love... are you ready to rock the mic?\nQ-Tip... are you ready to rock the mic!\nMos Def... are you ready to rock the mic?\nWe got the universal style that you got to like!\nAnd ain't nobody steppin up when we got the mic\nSo turn the A.C. up cause it's hot tonight!\nAnd til the bright early morn' we be rockin you all\nDon't stop, the Body Rock!\n\n[Tash]\nCause I'm next to flex, and I'm technically advanced\nTo turn you on like cybersex, so in less (uh) than two sec's (uh)\nI blind MC's like Thomas Dolby with the Science that'll leave\nThey braincells fryin slowly (SCIENCE!) so slowly I flow and\nExpress written consent, from the undergroundin niggas\nCoast II Coast I represent cause gettin bent, I do\nBut I'm doper than sherm plus the way I put it down\nCould burn the perm off Big Worm, so peep this private screening\nOf the Last Action Hero that be freezin rappers dead in they tracks\nLike Sub Zero (Zero), cause Rico ain't no joke\nI eat yo' flows and yo' beat up rappers even feel my presence\nWhen I'm home with my feet up\n\n[Mos Def]\nYo what you skied up or treed up?\nRelax and pull a seat up, make your landlord turn the heat up\nGot the opposition shook like Tiger Woods about to tee up\nSo niggas no competition with the clear Mos Definition\nMC's screamin now for years can't rhyme without they mom's permission\nYou just a young'un comin out, gettin gassed to run your mouth\nWildin on the Runabout, Baby Pah you comin out\nBarkin that you want a bout but son you know the comeabout\nWhen Mos Def blow up and, you don't, nuttin\nDon't you know nuttin? My crew go huntin\nWe keep it on the norm then we transform som'in\nAnd while, we do it, you bounce to it\nThe cops wanna stop the Body Rock (but don't do it)\n\n[Q-Tip]\nDY-NO-MITE!!! Like Jimmy J.J\nSlobbed down pen-ny, somewhere in L.A. (A)\nNow we got to bond like Voltron (tron)\nTash you the bomb, Mos you the won ton (ton)\nQ will pick the lead, I must drop on thee (thee)\nA-B-S, I bust down, facility (ty)\nT-R-A-C-T is the MC (cee)\nIt's the LL, inside the place to be (be)\n\n[Mos Def]\nTash Love... are you ready to rock the mic?\nQ-Tip... are you ready to rock the mic!\nMos Def... are you ready to rock the mic?\nWe got the universal brothers that you got to like!\nNow ain't nobody steppin up when we got the mic\nSo turn your A.C. up cause it's hot tonight!\nAnd til the bright early morn' we'll be rockin you all\n(Don't stop, the Body Rock!)\n\nAll my people out in Queens that know you're hot, you say\n(Don't stop, the Body Rock!)\nAll my people out in Brooklyn and you know we're hot, say\n(Don't stop, the Body Rock!)\nShaolin to L-I and you know we're fly, said\n(Don't stop, the Body Rock!)\nAll the people on the Greens and the land in between said\n(Don't stop, the Body Rock!)\n\n... no stoppin\n... no stoppin\nOut in Jersey ... no stoppin\nPhiladelp-i-I ... no stoppin\nChi Town gettin down ... the playgrounds\nDetroit USA ... no stoppin\nIn Cali ... no stoppin\nAnd the great V-A ... no stoppin\nI sez, huh-huh huh-huh uh-huh-huh\nCause in the Brooklyn town ... no stoppin\nAnd the Boogie Down ... no stoppin\nL-I and Queens ... no stoppin\nAnd you see Medina Greens ... no stoppin\nYou know we, Lyricist Lounge ... no stoppin\nAnd my man Abstract ... no stoppin\nExcept we never do wack ... no stoppin\nYou don't stop, the Body Rock\nD-dah, don't stop", "image": "https://i.genius.com/5554e53400a95dc16ec86a4c9c5d1523de467b47?url=https%3A%2F%2Fhulkhatetimetravel.files.wordpress.com%2F2010%2F12%2Fbodyrock.jpg"}], "artist": "Yasiin Bey"}