{"songs": [{"title": "WWJD He’d Prolly LOL Like WTF!!!", "album": null, "year": null, "lyrics": "[Intro]\nReally? This is what you guys been doing?\nSearching\n\n[Hook 1]\nBefore the break there were none\nAnd as it broke there was one\nFrom moon to sun, it goes on and on\nThe winter battle was won, the summer children were born\nAnd so the story goes on and on\nCome on woman in your left beats\nThose in bed with the house keys\nSo fair weather feels heartbreak from here to eternity\nCome on woman in your own time\nFar far far from the virgin pine\nRise on now from the dead leaves\nCome back to me\nOh, she sings her favorite song\nLeft to her tears and dreams, it goes on\n\n[Verse 1]\nStanding in line for the new one\nNot the black, but the blue one\nAnd I don't even know what it do, son\nSteve Jobs said that it's too fun\nFun in a bun is what I need\nIt's cold out here, put my arms in the sleeves\nI'll probably lose my place if I leave\nBut I really need to pee\nIf I do it right here they'll see\nMakes you wonder, how do snipers\nMarathon bikers\nNext time: diapers\nThey say it has all new features\nFaster processors and much better speakers\nGreat for kids, a necessity for teachers\nFor work or home, a revolutionary way of being alone\nI mean, should we really get a loan?\nHey what's the matter, just tell it to your phone\nCupertino heart with Chinese parts\nBuilt by the poor, but designed by the smart\nThey open the door so you go\nOn your mark, get ready, set, buy\nImagine a world where everything starts with an I\nBut it still ends with a die\nProbably got an app for that, you could try\nAbove the iClouds, right into the great wifi\nSiri, can iGod really hear me?\n\"Does not compute -- can you repeat more clearly?\"\n\"Woaaaaah\"\n\n[Hook 2]\nA vessel in the bloodline\nA thirteenth Zodiac sign\nA stitch in time, it goes on and on\n\n[Hook]\n\n[Verse 2]\nStanding in line for some new Ones\nHad a bunch of blessings but I blew them\nAsked Google how to use them\nSent me to a section about used guns\nNew runs, nuns'll scream, moms with jeans\nMatch their teens' jeans and genies who try to chew gum\nAw man, it's so confusing\nConfusion in the bun is what I have\nGood thing that God accepts cash\nMaybe buy my way out his wrath\nSceptically, why am I way off this path?\nAtheism's cheaper, and accepts Visa\nMy thoughts as I'm queing up for sneakers\nWon't discriminate, getting all eight\nIn every color that they make\nBeaverton hearts with Chinese parts\nBuilt by the poor and designed by the smart\nOn your mark, get set, cop em!\nImagine a life that revolves around shopping\nConspicuous consumption\nThat means it serves no other function\nBut to show off to someone\nOthers who only try to show off to you -- look at your fellow loyal customers\nIsn't harmony great?\nLook at all these friends that marketing makes\nHow many fries can these arteries take?\nI'll give McDonald's a little help here\nI think they should expand into health care\nAnd then you'll have all ends covered\nEven make caskets, have it all umbrella'd\nCan you make a corporation fear me?\n\"Couldn't hear your order, can you speak less clearly?\"\n\n[Hook 3]\nThat witch was burning the ground\nWill someday come back around\nFrom dust from to dust it goes on and on\nBefore daybreak there were none\nAnd as it broke there was one\nAnd still the story goes on and on", "image": "https://images.genius.com/b67b7f5bfbd7eb8c5c334fa8b05a2432.400x400x1.jpg"}], "artist": "Lupe Fiasco"}