{"songs": [{"title": "Never Stop Loving You", "album": "The Wonder Years", "year": null, "lyrics": "[Produced by 9th Wonder]\n\n[Intro: Terrace Martin]\nNever stop loving you, hehe!\nEy, what's happenin y'all? Yeah\nIt's Terrace Martin and my homeboy, 9th Wonder\nBrought to you live from Devi Terrace Tuesdays\n\n[Verse 1: Talib Kweli]\nYeah, you\nExcuse me Miss Lovable, I don't mean to trouble you\nYour bubble's so beautiful, got it from your mother too\nThat night at The W, Ball when I discover you\nMade me wanna fix all your problems, now let me troubleshoot\nIn all actuality, your mentality dwarfed your attributes\nPersonality as sweet as passion fruit\nConversation casual but quickly turn to marital\nI am hip-hop but I'm not your average rapper dude\nThere's more to me, I never call you shorty cause there's more to you\nYou priceless, them other chicks affordable\nI'm callin you adorable, every chance I get in the recordin booth\nIn bed, barely audible, you wonder who I'm talkin to\nHeh.. We whisperin the sweet nothings\nBack when I was single, I had the streets buzzing\nNow I need you to complete my album\nCause you my partner and it's hard for me to be without you\n\n[Hook]\nNever stop loving you (Uh, never stop, never stop)\nNever gonna stop, never gonna stop, never gonna\nI'll never stop, never stop, no!\n\n[Verse 2: Talib Kweli]\nI had a dream that you would come and you'd complete my life\nBack when I was younger, I would wonder if I need a wife\nMentally recorded as important what I need to say\nAnd back in the days with CDs and cassettes made by TDK\nThe vinyl was spinnin, you was winnin with the 8-track\nYa momma had a Dodge Dart, way before the Maybachs\nAnd the Mercedes golf cart, I gamble like a card shark\nHit her with the wizardry, defense against the dark arts\nWrote a song about it, wanna hear it? I got a lot to say\nModify ya Spotify, play me through your Dr. Dre's\nYou got the juice now, fresh not from concentrate\nYour embrace warmer than a goose down from Dr. Jays\nThe winter of my discontent, this is what you spring for\nYou'd wonder where the summer went, stop preparin for the fall\nSee it really don't matter what the season is\nYou like my breathing, I never leave it cause I need to live", "image": "https://images.genius.com/8d727a22a4d1d05ff7dc9a2ed5ca0c53.1000x1000x1.jpg"}], "artist": "9th Wonder"}