{"songs": [{"title": "Dying With Your Boots On", "album": "The World is Yours", "year": null, "lyrics": "[Scarface]\nTrouble seems to catch a motherfucker with his cards down\nGotta keep my drawers up, shit's gettin hard now\nThese motherfuckin cops be plantin shit on these niggas\nSimply because these niggas got bank accounts that's bigger\nI just can't get no peace from you motherfuckin rollers\nEverytime I pull my Benz-o out, you pull me over\nI'm sick of motherfuckers who be jocking Whitey's coattails\nBlacker than a motherfucker, sweat me 'bout my dope-sales\nNiggas just take your cut and get your ass up out my face\nThe only thing you probably get from me is a cock-sucking pistol case\nUnless you plan on plantin a lil' somethin in my shit\nJust because you ain't got shit, bitch!\nGive em a badge and a trigger and that makes em figure\nThat they can fuck with a million dollar nigga\nThey got you mixed up, fixed up at the Segas, shookin Indo\nGettin fucked up in the gank-hole\nThe only way you'll whip that motherfucker is when you whip that motherfucker\nAnd we choke the motherfucker (Man, fuck that motherfucker!)\nSo when you hear my song and wanna get it on\nYou better come prepared motherfucker, you dyin wit'cha boots on\n\n[Chorus]\n(Put ya foot in my shoe, and let me try on your boots)\nDyin wit'cha boots on\n(Put ya foot in my shoe, and let me try on your boots)\nYeah\n\n[Interlude: prison guard talking to inmate]\nGuard: Do you know how many years you're facing inside?\n25 to life and that's on the real\nSo you better snitch on your partner\nInmate: Fuck that! It was Brad Dawg, I ain't goin out by myself\n\n[Scarface]\nNiggas gettin caught, doin time, so they snitchin\nThey pickin niggas up on a funky ass suspicion\nWe'll be goin down for some questioning we think\nAnd end up gettin hit with the fuckin kitchen sink\nRacketeer and laundering, Kingpin wondering\nIf they got some unsolved murders, then give him some of them\nJust because we're niggas and they figure we're no smarter\nWe'll sell each other out, and start rattin' on our partners\nThey start bringin up shit that happened back in '85\nAnd then comes the largest jury, bitch, they fuckin time!\nYou might as well play the state cause you gon' do day for day\nAnd sellin out your homeboys ain't the shit\nCos y'all gonna have to die in this bitch, bitch!\nLobbin wit'cha white suits on\nAnd dyin wit'cha motherfuckin boots on\n\n(Put ya foot in my shoe, and let me try on your boots)", "image": "https://images.genius.com/2c9d70007eb3a5b42d898b73f3ce76f0.936x936x1.jpg"}], "artist": "Scarface"}