{"songs": [{"title": "Pothole", "album": "Flower Boy", "year": "2017-07-21", "lyrics": "[Intro: Tyler, the Creator]\nShit\n\n[Verse 1: Tyler, the Creator]\nMy mother warned me that some niggas ain't my right hand\nTo trust her, only my heart and that elder white man\nHis name is Clancy, I fancy him, gotta give him props\nHe half the reason why dealerships even let me cop\nSo now I'm speedin' and tryna drive away from the fact\nThat she was right, so I triple left, tryna double back\nThe streets are filled with some clues\nLike how I ain't notice that? (How I ain't see that?)\nFuck it, I seen some familiar stuck in the cul-de-sac\nI pull up, get out, what up? I wanna help\nBut what you want for some, some niggas\nReally don't want for themself\nNow do I stay? Do I go? That's my dilemma\nAnd traffic is picking up, if I don't leave I'ma get stuck (Skrt)\nSo I speed off, we talk barely and it seems awkward\nAnd I heard through some words that you're off it\nI got too much drive, don't wanna steer off path\nAnd crash and get distracted\nBut I listen to that weather man 'cause it might rain\nKeep my windshield wipers prepared\n'Cause y'all throw so much shade\nAnd I got jacket in trunk, but that's in the front\nI also got power for both of us if you're ever in need of jump\nJust let me know, my nigga\n\n[Chorus: Jaden Smith & Tyler, the Creator]\nI had to switch gears on 'em\nFishtail in the rearview mirror on 'em (Skrrrrrt!)\nI had to switch gears on 'em\nYou know, swerve, left turn, steerin' wheel on 'em\nNigga that's a pothole, watch out for the pothole\nWatch out for the pothole, watch out for the pothole\nLook out for the pothole, watch out for the pothole\nWatch out for the pothole, watch out for the pothole\n\n[Verse 2: Tyler, the Creator]\nSnakes in the grass, but I walk\nI got some new boots, on the back it says GOLF\nSo I be prepared for their bites, they're all talk\nI left the condom in the grass so fuck off\nWatchin' Clarence in a mansion with nobody in it\nYoung successful nigga, ride McLaren with no windows tinted\nI drive by piggies when I'm in it 'cause it feels amazin'\nThe irony is I stopped eatin' bacon\nDon't get it twisted, nigga, I'm still hungry, oh he lonely\nAll my friends talk about their hoes and tenderonies\nBut all I can show 'em is a couple cars and more things\nThat I've made in the couple past month, he's on, please\nEveryone is a sheep, me, a lone wolf\nNobody gon' make a peep 'cause everyone wants some wool\nSince everyone is a sheep, not everyone here is cool\nMan I'd rather drown in a pool by myself\nThan fuck with their fleece\nSee, man, T-Man fans be seesaw\nWind blows, they go, which way, who knows?\nOne day, \"Fuck no,\" the next day, \"Okay\"\nBut fuck y'all, I know that T is four for four\nI just want that garden and that Batmobile\nGood health, success, time on earth worthwhile\nFind somebody who love me and raise a couple of lizards\nBut my vehicle's good for now, that's in a couple of miles\nNow keep it pushin', nigga\n\n[Chorus: Jaden Smith & Tyler, the Creator]\nI had to switch gears on 'em\nFishtail in the rearview mirror on 'em (Skrrrrrt!)\nI had to switch gears on 'em\nYou know, swerve, left turn, steerin' wheel on 'em\nNigga that's a pothole, watch out for the pothole\nWatch out for the pothole, watch out for the pothole\nLook out for the pothole, watch out for the pothole\nWatch out for the pothole, watch out for the pothole\n\n[Outro: Tyler, the Creator]\nFuck, okay, next one\nDo-do-do-do-do-do\nGotta watch out for the potholes\nOoh, said watch out for the potholes\nHaha", "image": "https://images.genius.com/3641ffe8cf5e3c7537585bbe1cc2a794.1000x1000x1.jpg"}], "artist": "Tyler, The Creator"}