{"songs": [{"title": "Playa", "album": "Sweat", "year": "2004-09-13", "lyrics": "[Intro: Havoc & Missy Elliott]\nYeahhayyy, yeahhh\nYeah, uh-huh\nYah..\nYeahhayyy, yeahhayyy!\nYeah.. fo' sho'\nYeahh!  Yah..\nMmmm-mmm-mmm, mmmm-mmm-mmm\nUhh, yah..\nM-O-B-B baby\nWooooooooo!\nUhhhh..\nYeah! Right\nUhhhh..\nLet's do this, one time baby\nUhhhh..\nYea-yea\nYah.., Yo\n\n[Verse 1: Havoc]\nWhattup ma, the name H doe, I'm into pesos\nV.I.P. and champagne by the caseloads\nDoubles get you from that bar, and get you right\nOr get you bent, whatever you like\nI'm not into wifin' - no sir\nI just wanna beat it up, hear the kitty-cat purr\nThe whip or the tail, whichever you prefer\nThe crib off limits, got wifey durr\nGot a man home beast, then be easy ma\nShe don't know how to creep, I be teachin' ma\nI got jars of that haze, yeah I'll show you how to twist\nGet it tight but not too tight, it's all in the lick\nI'll show you which end to burn, how to spot that trick\nAll you need is the will to learn\n.. and some good trees to burn\nRelax, you'll be straight like a perm, word\n\n[Chorus: Missy Elliott]\nI need a man, who's up on his game\nAnd can give me some affection, satisfy me many ways\nAre you the one to do it for me playa?\n(Are you the one to do it for me playa?)\nThen maybe I can hook up witcha later\n\n[Verse 2: Prodigy]\nBabe girl you now rockin' with strength\nInfamous Thugs it's nuttin' to slug\nAnyone, they try to ruin our fun\nI don't wanna scare you away, I'm sayin' whassup\nTell your friends come over here, and party with us\nIf y'all from the hood, y'all gon' love our ways\nCause we got money, and we still the same way\nGo 'head, do that dance, and you can feel free\nTo be you and just do you, everything's great\nYeah tonight we gon' have a little too much to drink\nJust leave your car in the lot, so you can feel safe\nWe gon' party 'til six then take it to my place\nThen later on I'll have a car bring you back safe\nI ain't into games, I'll give it to you straight\nWe can have a part time love, I just want it straight\nReally though, I changed dough, not no dames\nSo however you wanna call it, it's okay\n\n[Chorus: Missy Elliott]\nI need a man, who's up on his game\nAnd can give me some affection, satisfy me many ways\nAre you the one to do it for me playa?\n(Are you the one to do it for me playa?)\nThen maybe I can hook up witcha later\n\n[Verse 3: Nelly]\nUhh, uhh, aiy\nCheck it, check it, check it\nBaby girl right here is where you need to be\nYou better duck 'cause the bottles pop easily\nGo and get your other friends, 'cause you comin' with me\nDerrty E-N-T with the M-O-B\nSee, no respect for the Country Grammar\nSo I kick the Dunn language, the response was better\nWe like, 'Dunn' did it, 'Dunn' hit it, 'Dunn' split it\nEverything hon wanted, Dunn was with it\nShe like to see me doo-rag'd and me ball-cap'd\nShe like to see me tailored, Gator'd, slacked\nIn fact, I see you lookin' through the windshield wipers\nAs the rain hit the windows on the blue Dodge Viper\nThe sniper, not never but hit ya from long range\nCheck it, got haters like X had Brother Baines\nUsed to have quarter thangs but now I got quarter dames\nGot a quarter of a new vehicle and quarter chains\n\n[Verse 4: Missy Elliott (Nelly)]\nI'm not tryin' to be your girlfriend (you dig)\nI ain't even tryin' to lock you in\nThere's no need for us to pretend\nI'd rather spend yo' dividends\nYou and me can be lover friends\nI'd rather keep this between us two\nLet me know when you wanna begin\nAnd let me tell you what I want from you\n\n[Chorus: Missy Elliott]\nI need a man, who's up on his game\nAnd can give me some affection, satisfy me many ways\nAre you the one to do it for me playa?\n(Are you the one to do it for me playa?)\nThen maybe I can hook up witcha later", "image": "https://images.genius.com/d228092985a51eeb2d4700f76161a5bc.600x600x1.jpg"}], "artist": "Nelly"}