{"songs": [{"title": "Grooveline Pt. 2", "album": "Oxymoron", "year": "2014-02-25", "lyrics": "[Intro: Suga Free]\nI'd over look your condescending tone if you heed the gravity in mine\n\n[Pre-Hook: ScHoolboy Q]\nGot a sack of marijuana, think I'm 'bout to bend a corner\nAin't no telling who my money for\nGot my dope from cross the border\nGot my home on Figueroa, ain't no telling where that pussy go\n\n[Hook]\nWill you sell that pussy for me?\nWill you sell that pussy for me? (Will you sell that pussy for me?)\nWill you sell that pussy for me?\nWill you sell that pussy for me? (Will you sell that pussy for me?)\n\n[Verse 1: ScHoolboy Q]\nCheck the forecast, it's Wavy Q, I should make the news\nMy fortune said that I'll be pimping you and your pussy juice\nSuper sweet, sell a trick a treat, hope your lips in shape\nCause you worked your feet as you stroll them streets, beeper checking\nHope no cops arresting, girl, I told you them narcs be pressing\nBetter act like you a pedestrian and don't mention my name\nMy pimping is game, cold limp with my cane, got gold on my chain\nCome pinky my ring, it's so blickety bling\nOn 51st and Figg, grew up about ten minutes from the real Ricky\nWhere the shoelaces is orange with H hats like we from Houston\nCondoms in hoes' purses with baby wipes for they coochie\nYou's a ho that's selling booty, no need to be acting bougie\nBitch, I give your ass a noogie and a chicken nugget\nAnd make you watch me at the movies, I'm panoramic\nMy filming be rated pimping, my mink dragging\nWith two bitches that go and get it, my hoes get it\n\n[Hook]\nWill you sell that pussy for me?\nWill you sell that pussy for me? (Will you sell that pussy for me?)\nWill you sell that pussy for me?\nWill you sell that pussy for me? (Will you sell that pussy for me?)\n\n[Bridge]\nHut one, hut two\nHut three, hut four (Sell that pussy for me)\nWill you sell that pussy for me?\nWill you sell that pussy for me? (Will you sell that pussy for me?)\nHut one, hut two\nHut three, hut four (Sell that pussy for me)\nWill you sell that pussy for me?\nWill you sell that pussy for me? (Will you sell that pussy for me?)\n\n[Interlude: Suga Free]\nI ain't asking, I'm telling you, bitch\n\n[Verse 2: Suga Free]\nUh-huh, yeah, watch me go Black Forest ham\nA new school player laced with the old gift gab\nAnd don't let your Shark Week mouth override your Green Goldfish ass\nSo for every ho you clown, I'mma crown two\nAnd anything good hurts and I cried\nShit I just don't want to throw it up in my mothafuckin' face\nOr I choose to not do this around you\nSee ho you like a brain aneurysm\nWant two heads with the same dandruff in 'em\nOnly to scratch the itch with baby rattlesnake fangs\nNo Head and Shoulders or anti-venom\nYeah, P, this is gentlemanly leisure, the oldest game left to play\nAnd the hard head that make a soft ass played out\nWill forgive and forget yesterday\nNow get 'em, Q, a pimp on foot, go to sleep carless, wake up to a Cadillac\nRemember Forrest Gump walked and he was pretty stupid\nSo you know what? Accept the fact that the bitch belongs to the world\nP, cause that ho only yours as long as she hoeing\nBut Happy Pimping and Merry Ho Ho\nKeep an eye on bottom bitch too\nCause that bitch'll run a ho or two off, mane\nPimps only fuck with pimps, homie, that's why we so solid\nRed to blue, to debt, to due, it's easier\nTo put a watermelon through the eye of a needle\nThis is done by choice, not by force\nI ain't asking, I'm telling you\n\n[Hook]\nWill you sell that pussy for me?\nWill you sell that pussy for me? (Will you sell that pussy for me?)\nWill you sell that pussy for me?\nWill you sell that pussy for me? (Will you sell that pussy for me?)\n\n[Bridge: ScHoolboy Q & SZA]\nHut one, hut two\nHut three, hut four (Sell that pussy for me)\nWill you sell that pussy for me?\nWill you sell that pussy for me? (Will you sell that pussy for me?)\nHut one, hut two\nHut three, hut four (Sell that pussy for me)\nWill you sell that pussy for me?\nWill you sell that pussy for me? (Will you sell that pussy for me?)\n\n[Outro: Suga Free]\nShe gon' choose\nMan that ho gon' work hard for you, jack\nSuga... Q!\nPeep the suspension that needs no stasis\nBitch if you ain't gon' do it for me then do it for yourself, ok!\nOh I'll pimp a BB out of a spray paint can!", "image": "https://images.rapgenius.com/d5d2355f52688fb278608e4f141f9e2a.1000x1000x1.jpg"}], "artist": "ScHoolboy Q"}