{"songs": [{"title": "Happy Ending", "album": "Killer", "year": "2008-07-01", "lyrics": "[Intro: Tech N9ne]\nI don't even wanna fucking do this song, for real\nBut I wouldn't be real if I didn't\n\n[Verse 1: Tech N9ne]\nI be sittin' by myself and I be thinkin', \"Momma, what have I become?\"\nAll I wanted was a family, but when I look up, you the only one\nLosing everything but money, everybody left and I don't even get to see my young\nOnly happiness I get is in the studio or when I get to do another run\nOn the road, doin' shows, get the woes, when it slows\nGettin cold, getting old, but the flows, gettin' sold\nI've been doin' this a minute but I think I wanna end it 'cause I'm on a higher level when I go\nBut the music I be doin', it be losin' 'em and make it really tough for me to grow\nAll I wanted was a family portrait, see my babies on a ranch with horses\nBut I was fucking devil bitches in corsets\nI was livin' really good then I torched it\nI'm sorry Ms. Jackson, I'm speakin' for real and I never meant to make your daughter cry\nBut I guess I'm a failure with women I'm lost and I feel like I ought to die\nFeel like that I'm rotting away, my life is just off in the grey\nHow much does it cost? I will pay, to lay, and be off in a coffin today\nI mean off in ashes, this life ain't after it clashes, If I get blasted\nThis is Suicide Letters all over again, I thought that I passed it\nBut I guess that I didn't, 'cause this one is written and there is no mending\nWhen I'm broke I'm a joke, when I croak I just hope that I won't be descending\nBut this ain't a joke, I want you to know that Tech Ninna is never pretending\nAlone in my bed, with a gun to my head, asking, \"where is my happy ending?\"\nYeah\n\n[Pre-Chorus: Krizz Kaliko]\nTell me how it ends\n\n[Chorus: Krizz Kaliko]\nWhat about me? Where is my happy ending?\nWhat about me? Is this a life worth living?\nYou know how it begins, but how does it end for me?\nWill I ever win, or does he have it in for me?\nWill this stop before I stop breathing?\nIs there light in this dark I'm seein'?\n\n[Verse 2: Tech N9ne]\nI put my life in this music, Nina is inside out\nI set my heart out for people, they know what the inside 'bout\nWill they keep feelin' Nina forever? This I doubt\nCan never cry for help, so if you listenin' this my (Shout!)\nI'm searching for the passage way to happiness\nBut i'm worldly so I have to lay in nastiness\nYes, this is Strange year, worldwide fame's near, but the game's queer\nSometime I feel like I'm Rudolph the Reindeer\nBut instead of a red nose, I stay in my red clothes\nAnd the music they said blows, is on top and the cred grows\nCan you resurrect a motherfucker that feel like he posses a dead soul\nDeteriorate to an inferior state almost equal to bread mold\nNow as my head goes, wish I could shed those\nBecause all the times the Nina was shorted, what I bled froze\nSo now that I'm cold blooded, and hella sick is what the med shows\nThe tread slows, and don't even think you reviving a dead rose\nYeah\n\n[Pre-Chorus: Krizz Kaliko]\nTell me how it ends\n\n[Chorus: Krizz Kaliko]\nWhat about me? Where is my happy ending?\nWhat about me? Is this a life worth living?\nYou know how it begins, but how does it end for me?\nWill I ever win, or does he have it in for me?\nWill this stop before I stop breathing?\nIs there light in this dark I'm seein'?\n\n[Bridge: Tech N9ne]\nI'm on the verge of insanity, but I'm competent\nI'm breakin' so I pick this one to vent\nThe reason I look away when you talk to me my brain is producin' evilness\nI'm drownin' in 151 and Rumple Minze\nThat's how I feel\n\n[Verse 3: Tech N9ne]\nI sit in the mirror with this gun and practice how to kill\nBut I know damn well that the people like me really wanna know how to chill\nThis life is about a check, about a number, about a bill\nThink about all the love I lost because my quest is about a mill\nI feel like you're stupid, don't talk to me I'm crackin' up\nAnd I don't mean laughter, I'm full of bitterness and it's backing up\nAnd I live with angels, but lately demons been shackin' up\nTug of war with my spirit, see the blood I'm hacking up?\nI love my kids and my fans inside I sob harder\n'Cause you pay the price for my life and it's right like Bob Barker\nAnd I won't pretend that it's okay I'm no facade starter\nSo I guess my only happy ending's in a massage parlor\nYeah\n\n[Pre-Chorus: Krizz Kaliko]\nTell me how it ends\n\n[Chorus: Krizz Kaliko]\nWhat about me? Where is my happy ending?\nWhat about me? Is this a life worth living?\nYou know how it begins, but how does it end for me?\nWill I ever win, or does he have it in for me?\nWill this stop before I stop breathing?\nIs there light in this dark I'm seein'?", "image": "https://images.genius.com/ce6124bde0d76994fd0d3a8ddb1d4e97.1000x994x1.jpg"}], "artist": "Tech N9ne"}