{"songs": [{"title": "Street Talkin’", "album": "The Art of Storytelling", "year": "1999-03-14", "lyrics": "[Chorus: Slick Rick]\nNot trying to claim things I haven't earned honest, man\nSlick Rick and OutKast is on this jam\nWhat kid? Diamond on the tooth 2 grand\nTrying to help raise all youth to man\nSo give the Ruler Rick his space to slam\nHelp clean up this land\nThe reputation of this man\nWithhold and withstand\n\n[Verse 1: Slick Rick]\nOutKast and Slick, the answer is in it\nHon you need to get your ass on the dancefloor this minute\nWe bruise stuff, knock you out shoes, socks\nShow your ass, move your fuck out, we're mad smoove snots\nLa-Di-Da-Di, mmmmm we like to party\nDon't make me get money and platinumize my body\nWith bright stuff, known to earn a dyke's love\nBlind folks be like, \"Somebody turn the lights off\"\nImmense rep, poppin out a muffin\nMake famous artists that's dead hop out a coffin\nAt the real estate, behavin type choosy\nWant a palace with the shit beige and light blue please\nGot the kid like \"watch your manners\"\nSince I came out of jail, it's like the planet gone bananas\nLack of strength a badder fella had\nLady lookin at me all stink, I had to tell her that\n\n[Chorus: Slick Rick]\nNot trying to claim things I haven't earned honest, man\nSlick Rick and OutKast is on this jam\nWhat kid? Diamond on the tooth 2 grand\nTrying to help raise all youth to man\nSo give the Ruler Rick his space to slam\nHelp clean up this land\nThe reputation of this man\nWithhold and withstand\n\n[Verse 2: Big Boi]\nUhh, I went from Player's Ball to bulldoggin\nFrom bulldoggin to bowhoggin\nNow bowhoggin and pimpwalkin\nThat strictly fresh and street talkin\nAnd we all last like that there\nRuin them all up like cat hair\nWe never fall off like hat wear\nWe some of the dopest MC's out there\nNow eat that, OutKast and Ricky D, bitch, can you beat that?\nRemember the time I laid them down to Teenage Love?\nNow see that\nJust to sport a rhyme and break in new patterns like hymens\nShuckin' and jivin' was never the style\nI'm gon' keep on being this lion\nSpittin' that king shit, you cling shit\nA tailor and a seamstress\nBlue gators for you haters and the penis for all you beatches\nLike an addiction 'cause I need it, hip-hop is that I fiend it\nLike a junkie, show me your monkey, 'cause I sho' nuff like to beat it\nMight just eat it just to skeet it\nFold you up like you was pleated\nLike some slacks and, relaxin', be strollin' like Sir-Captain\nSee, I got a, baby daughter, and I feed her with this rappin'\nNot trappin', d-boy, but rappin', huh, yeah, yeah\n\n[Chorus: Slick Rick]\nNot trying to claim things I haven't earned honest, man\nSlick Rick and OutKast is on this jam\nWhat kid? Diamond on the tooth 2 grand\nTrying to help raise all youth to man\nSo give the Ruler Rick his space to slam\nHelp clean up this land\nThe reputation of this man\nWithhold and withstand\n\n[Verse 3: Slick Rick]\nSeems everybody's open off the grammar\nThe white fox pink velvet suit, white cabana\nListen baby girl, genius Rick ta..\nDreamboat, bitch, you shoulda been clicked picture\n(Check her out) I don't know what you're tryin to figure out\nDown South, barbecue ribs fly out a nigga mouth\nAnd touchin' me The Chosen, for such a will opposin\nMe and Big Boi tryin to give our children clothing\nSmokin' love—do we provide dope enough?\nEven people unborn kid wide open off\nThe enginin' I'm sendin' in\nEven make construction workers start actin kind of feminine (Hi)\n10%'ll blast this hit from me and Big Boi\nWho represent the OutKast clique\nA jealous cat, lack of strength a badder fella had\nLady lookin at me all stink, had to tell her that\n\n[Chorus: Slick Rick]\nNot trying to claim things I haven't earned honest, man\nSlick Rick and OutKast is on this jam\nWhat kid? Diamond on the tooth 2 grand\nTrying to help raise all youth to man\nSo give the Ruler Rick his space to slam\nHelp clean up this land\nThe reputation of this man\nWithhold and withstand\n\n[Outro: Slick Rick]\nSlick Rick and OutKast is on this jam\nTryin to help raise all youth to man\nSo give the Ruler Rick his space to slam", "image": "https://images.genius.com/75fada14ce31e29e3b85e79699fb75db.300x300x1.jpg"}], "artist": "Slick Rick"}