{"songs": [{"title": "Ova Here", "album": "Prophets vs. Profits", "year": "2002-08-27", "lyrics": "[Intro]\nFirst of all...\nI don't know WHO y'all saw on this stage before me, alright\nI don't know WHO y'all are gonna see on this stage after me, true\nBut this is real... hip... hop!\n\nWord up\nI'm gonna find out tonight\nWhere the real Hip Hop\n\n[Hook]\nThe real hip hop is (Ova here)\nThe real hip hop is (Ova here)\nThe real hip hop is (Ova here)\nThe real hip hop is (Ova here)\n\n[Interlude]\nBlaow-blaow, blaow-blaow\nClear em out; clear 'em out\nWord\n\n[Verse 1]\nYo Nelly, you ain't for real and you ain't universal\nYour whole style sounds like an N'Sync commercial\nIgnoramus, I'm the baddest with the mic apparatus\nChallenging the God of rap is madness\nI'll snatch your status with this ugly looking billboard, you could stop them\nBut I got enough albums to make my own top 10\nYou limited, like the speed of traffic\nYou bite my style off the radio, so when you speak it back, I hear the static\nYou better Chillout like Chuck, I kick like 3 Norrises\nOne of my 16 bar rhymes is 8 of your choruses\nOf course it is ridiculous\nWatch out, I be in the club inconspicuous\nGotcha on your hands and knees\nAin't it about time for some real emcees?\n\n[Hook]\nThe real hip hop is (Ova here)\nThe real hip hop is (Ova here)\nThe real hip hop is (Ova here)\nThe real hip hop is (Ova here)\n\n[Verse 2]\nWe on the hunt tonight\nWhen you see me coming, I don't front I fight\nPeople say I'm contradictory\nCause I'm all about peace to say the least with a violent history\nIt ain't no mystery, these rappers wanna get with me\nMy people don't see that all they hear is: \"Stop hittin' me!\nStop beatin' me Kris!\"\nYou want to help my career Nelly? Well, you can help if you don't exist!\nI think it's 'bout time we stop these pop rappers\nFuck these pop rappers, hip hop does matter\nTo me; does it matter to you, my crew?\nIf it does, you know what the hell to do\nThrow your guns in the air, pump it like, \"Yeah\"\nLet these bitch ass rappers know we in here\nGo to the shows huh, boo 'em off stage\nTell 'em KRS told you they're at the end of they days!\nLet me tell you, let's give hip hop a lift\nAnd don't buy Nelly's album on June 25th\nThat'll send a message back to all them sellouts\nHouse nigga rapper, your bottom done fell out\nYou don't even know how\nI told you I wasn't talking about you then, but I'm talking about you now\nBlaow! One to the knees, Blaow! One goes right through\nEven St. Louis don't like you!", "image": "https://images.genius.com/32bf9790e346029d7cf0897f83ab18fa.1000x1000x1.jpg"}], "artist": "KRS-One"}