{"songs": [{"title": "Criminology", "album": "Only Built 4 Cuban Linx…", "year": "1995-08-01", "lyrics": "[Intro: Sample + Raekwon]\n\"I told you a long time ago, you fucking little monkey, not to fuck me.\"\n\"Aye, aye, who the fuck you think you talkin' to, huh? You wanna fuck with—\"\n\"Who the fuck you think I am—your fuckin' bellboy?\nD'you wanna go to war? D'you wanna go to war? We'll take you to war, okay?\"\nComing up on half a mil, we build\nFor real, y'all\nTakin' you on another one, son\nUh, Julio Iglesias\nMakin' C.R.E.A.M. like that nigga\n\n[Verse 1: Ghostface Killah]\nYo, (\"Blow!\") first of all son, peep the arson\nMany brothers I be sparking and busting mad light inside the dark\nCall me dough snatcher, just the brother for the rapture\nI hang glide, holding on strong, hard to capture\nExtravagant, RZA bake the track and it's militant\nThen I react like a convict and start killing shit\nIt's manifested, the Gods work like appliances\nDealing in my cypher I revolve around sciences\nThe 9th chamber, leave you trapped inside my hallway\nYou try to flee but you got smoked up by the doorway\nNo question, I send your ass back right to the essence\nYour whole frame is smothered in dirt, now how you resting\nWhile I'll be trapped by sounds, locked behind loops\nThrowing niggas off airplanes 'cause cash rules (cash rules)\nEverything around me, black, as you can see\nSwallow this murder one verse like God Degree\nThen analyze my soundtrack for satisfaction\nYou adapt like a flashback chain reaction\n(Lace them niggas, son)\n\n[Verse 2: Raekwon]\nAKs black bust back like seventy MACs\nI'm all that, street niggas knowing my steez black\nRon G, you know he coincide with me, see\nMarvelous menace for society\nBut anyway, let's toast, champagne thoughts with Ghost\nI max the most shotguns through the nose\nFuck rap, hip hop put me on top\n'Lo wears, and Tommy Hil fly shit with a knot\nThe witty unpredictable live shit, drive-by shit\nDo-or-die shit, I'll take your lye and shit\nAnd then you know I'm running through the penal\nFoul, four-toothed child was wild\nThe old lady snitched, but fuck it, you know it\nOne love kid, no I'm not doing a bid\nToo much to get for what 'cause six niggas got\nStuck and the nigga chain was truck\nYo fuck that, Criminology rap, sneakers stay\nJet-black floating in the flyest Ac', nigga\nBring it! Yeah\n\n[Outro: Raekwon]\nMuch love go to New York City\nAll my Tommy Hil', ice rocking niggas", "image": "https://images.genius.com/70d7978ac46cdf38888210b8fcf5ab86.600x598x1.jpg"}], "artist": "Raekwon"}