{"songs": [{"title": "Eww Eww Eww (Remix)", "album": null, "year": "2014-07-17", "lyrics": "[Intro: Zuse]\nLook 'pon me, look\n\n[Verse 1: T.I.]\nThugga, I'm kill one of these suckers\nPussy ass nigga can't tell me nothing\nBeat a nigga head with a Louisville slugger\nShoot a nigga dead then feed him to the gutter\nBeat him, like a little bitch I treat him\nIt's on, on sight, like this I greet him\nPow! Talk that shit, nigga, now\nGet your ass gunned down, nigga, this my town, I run it\nSucka nigga know he don't want it\nAin't nobody gon' keep me from walking up on it\nNigga love running 'round talkin' tough, don't he?\nPray to God, may I die, let 'em fly on my opponent\nHol' up, we will roll up, hop out of that Corolla\nSpitting this AK outchea, at your chest until it blow up\nCuz, you are so done, absolutely no one\nCan save you from the wrath I'm bringin' to yo' ass, I'm goin'\nIn on you and everyone you knowin'\nI ride on you till no end, you ain't even gon' know when\nI suffocate you, smother you, I ain't gon' leave you no wind\nEverybody know you ain't got no win, cause I'm\nKnown to clown, hit the town, kick your door in\nI'm lookin' at the hammer, barrel end at your end\nPut dough in the back 'fore the thang start blowin'\nThe yop get goin', splatter your brains on the floor, I'm like\n\n[Chorus: Young Thug]\nEww, eww, eww\nEww, eww, eww, eww\n\n[Verse 2: Young Thug]\nWhat you gonna do when I pull up on you, nigga?\n(I don't know, I don't know, I don't know)\nPussy nigga know that he a cat like Tigger\n(For sure, for sure)\nBeat the pussy nigga with the baseball bat\nPull up with them F&Ns comin' out the hatch\nPussy mothafucka scared to say it to my front\nSo I'm blowin' out his back\nPoint it at his liver, make the nigga reconsider\nBands in my pants got me lookin' a little bigger\nRed just like Elmo but I never fuckin' giggle\nYou can suck my pickle for a nickel\n\n[Chorus: Young Thug]\nEww, eww, eww\nEww, eww, eww, eww\n\n[Verse 3: Zuse]\nCatch a motherfucker at the stop light\nPoint, point, point, hold the Glock tight\nYeah, I'm bout the spinach, boy, Popeye\nNiggas want beef, where my hot fries?\nCross me, nigga, get baptized\nYes, motherfucker, I'm the bad guy\nBlow you away like a landmine - dead, flatline\nI'm a God and I put that on mankind, huh\nBullet turn you into stop sign, huh\nSwat a pussy nigga if he that fly\nLight a nigga up, me no talk and beg\nCrack a nigga up like the yolk out a egg\nSmoke a nigga out like an ounce from a dread\nThese niggas straight pussy, ain't vouchin' for them\nIce cold nigga like a motherfuckin' gem\nBranch out, nigga, like a motherfuckin' stem\nCut a nigga off, ain't tied up for them\nTell a bitch nigga I'm fire with the pen\nLay a nigga down, watch him die at the end\nFour-five nigga, it's a nine, that's a ten\nPussy on my dick, you and I and my friend\nWhich one of ya'll wanna try this again?\nWhich one of ya'll wanna try me again?\nBig body six, I'm high in the Benz\nFlippin' the flow, on timin' again\nRiggidy ruggidy rhymin' again\nPussy nigga, it's applying to him\nV-I-P, ain't no line in for him\nFuck around, nigga, your chances are slim\nFlexin' on 'em, exercise in the gym\nBallin' on 'em, got my hand in the rim\n\n[Chorus: Young Thug]\nEww, eww, eww\nEww, eww, eww, eww", "image": "https://images.genius.com/526598d998730c86a9d4b6c0a5464bb7.500x500x1.jpg"}], "artist": "Young Thug"}