{"songs": [{"title": "Sex Out South", "album": "Misery Loves Kompany", "year": "2007-07-17", "lyrics": "[Chorus: Tech N9ne & Krizz Kaliko]\nSex out south, hit, in and out\nScreamin' and cussin', bustin' it out\nSex out south, freaks comin' out\nS.O.S. is what it's all about\nSex out south, hit, in and out\nScreamin' and cussin', bustin' it out\nSex out south, freaks comin' out\nS.O.S. is what it's all about\n\n[Verse 1: Kutt Calhoun]\nI got this bitch named Janae from Olathe, baby girl was flagrant\nInto bitches and sexual favors, told me I could take it\nGot a fetish – addicted to pain, wanted me to choke her\nWhile she sat on my di-nick and came all over the sofa\nBut this ho from the \"O\", she was cold, didn't like to swallow it\nA pole to the back of the throat, kept a bitch from vomittin\nShe begged for a dick in her ass, baby liked it anal\nBut my head was too big for her ass, so I used my fingers\nDown to Dallas with Rita and Alice, white and Phillipino\nOne on my dick and one tossin' my salad off in the casino\nReal sex ain't got shit on these vets, told 'em they could keep me\nEven thought about writin' the check, I'm coocoo for a threezy\nTo all you bitches and hoes that live your life unexposed\nYou better peak this, out south bitches is pros\nIf you don't know how it goes, you besta follow your nose\nGet on some freak shit, now follow as the story is told\nIt's like..\n\n[Chorus: Tech N9ne & Krizz Kaliko]\nSex out south, hit, in and out\nScreamin' and cussin', bustin' it out\nSex out south, freaks comin' out\nS.O.S. is what it's all about\nSex out south, hit, in and out\nScreamin' and cussin', bustin' it out\nSex out south, freaks comin' out\nS.O.S. is what it's all about\n\n[Verse 2: Tech N9ne]\nI know you heard that I\nTalk a lot of shit about a bitch\nBut I'm 'bout to swerve this time\nAnd talk about a different kinda chick\nThe ones who love the dick constantly, in and out\nEven like to put it in her mouth\nAnd I'm not talkin' about northbound bitches\nI'm talkin' 'bout those bitches out south\nYou can find 'em in the 50's all the way to Grandview\nYou can get 'em up in Overland Park and Olathe\nThey keep hella paper\nNever givin' a fuck about your other bitches\nNigga petty shit is second nature\nThrow 'em in the mix nigga, fuck 'em with a friend\nThey will be callin' you so they can do it again\nYou ain't gotta spend, ain't gotta pretend\nCall her up and tell her you needed to put it in\nAnd not just white, there's hella beautiful black bitches\nGet it from the back, they lovin' the dick too\nDown North women, they hate but bitch boo\nI know you don't like what I'm sayin', but it's true\nAnd y'all be fuckin' them bitches like we be fuckin' them bitches\nWe be out for the pussy and then we duckin' you bitches\nNothing you never could tell a nigga we could gonna be fuckin'\nNever stoppin' it 'cause I ain't had enough of you bitches\nNow, sex out south you can put it in her mouth\nAnd you don't need help from Hitch\nYou can find 'em in a house of six\nDo the damn thing with one and switch\nAny other women hatin', got a nigga waitin'\nFor that weak shit you pitch\nLay that shid-it di-down, bid-itch\nQuit it, sit down trid-ick, skidip now bitch\n\n[Chorus: Tech N9ne & Krizz Kaliko]\nSex out south, hit, in and out\nScreamin' and cussin', bustin' it out\nSex out south, freaks comin' out\nS.O.S. is what it's all about\nSex out south, hit, in and out\nScreamin' and cussin', bustin' it out\nSex out south, freaks comin' out\nS.O.S. is what it's all about\n\n[Verse 3: Krizz Kaliko]\nI'm talkin' 'bout chicks at Center, where I'm from\nSt. Theresa's, Bishop Hogan up in her\nHickman Mills, Ruskin, them the ones that I be tusslin' with\nNow I'mma get mine\nAnd I'm hopin' you get yours before I'm through\n'Cause Kali be mackin' them hoes fast\nAnd if ya lucky to get you a piece of evil ass whoo\nWhere the redbones\n'Cause them the ones I love out South get my head gone\nAnd they never wanna let me pull it out when I'm in 'em\nSo I'm pullin' the rubber out\nWhen I need it I'm takin' the southern route\nAnd if it's late at night, clutch your lady tight\nWhen me and my niggas is out south\nGet it with no doubt\nSit it in your mouth\nIf ya with it then baby let me hit it in down south\nStill I got too many bitches that are close to me\nAnd the ladies were really lookin' like they hoes to me\nLike a- like a lover\nI got to get some more of her\nOochee coochie the way you do me\nYou really give it to me when we be under the covers\nFelicia (Oh) I'm glad to meet ya\nBut when you kiss this and it spits then go ballistic\nI jump over pussy for head\nI get to rockin' the bed, they heard us outside screamin'\n\"Southside!\"\n\n[Chorus: Tech N9ne & Krizz Kaliko]\nSex out south, hit, in and out\nScreamin' and cussin', bustin' it out\nSex out south, freaks comin' out\nS.O.S. is what it's all about\nSex out south, hit, in and out\nScreamin' and cussin', bustin' it out\nSex out south, freaks comin' out\nS.O.S. is what it's all about", "image": "https://images.genius.com/d568b86ce102e78c9c49f201c1a48234.953x953x1.jpg"}], "artist": "Tech N9ne"}