{"songs": [{"title": "Ice Pick", "album": "Friday on Elm Street", "year": "2017-11-24", "lyrics": "[Intro: Jadakiss]\nI ain't gon' do too much on this\nIt's that Vincent Price type of shit\n(Kill kill kill! Kill kill kill! Kill kill kill!)\n\n[Verse 1: Jadakiss]\nEvery verse is a novel (read)\nEvery other chapter, I bust you or carve you (bleed)\nI'm a grown man, so I don't wanna argue (uh-huh)\n1-point-somethin' for the stone in the marble, mmm!\nThank God for the things that I got already (thank you)\nNo housewarming, crib hot already (oof!)\nI'm heroin compatible, powder-ready (uh)\nThem niggas that booked you is in the crowd already (kill kill kill!)\nG-wagon'll do store runs (haha)\nI ain't votin' this year, just coppin' more guns (yep)\nBig funerals, everybody can all come\nMortician, hell of a job, body was awesome (awesome)\nBody on the ratchet, only reason to toss 'em (mmm)\nProbably up in the Four Seasons havin' a foursome (haha)\nLucky they get a Uber, I usually iron horse 'em (yep)\nAs far as the dope boys go, I endorse them, what!\n\n[Chorus: Styles P (Jadakiss)]\nKillin' these niggas like it's a sport now\nFoul as a Rockefeller or Rothschild\nTailor made cloth on my body, holdin' the fort down\nRoom full of bosses callin' me boss now (what!)\nKillin' these niggas like it's a sport now (what, nigga?)\nFoul as a Rockefeller or Rothschild (uh)\nTailor made cloth on my body, holdin' the fort down\n(HA-HAAAEEH!) Room full of bosses callin' me boss now\n\n[Verse 2: Jadakiss]\nEvil thoughts comin', should I re again? (what)\nHavin' talks with the Devil, it's just me and him (what's up)\nHe ain't never crack a smile, but I seen him grin (haha)\nIn my man-cave, watchin' CNN (mmm)\nYeah, I do it 'cause I'm built to\nBad day for me is red wine on a silk suit\nI can make a call and have a nigga bring a mil' through (bring that)\nI associate with the niggas that coulda killed you (kill kill kill!)\nAt the table, the round or the square one\nAt the clear-port, playin' cards 'til the Lear come (c-note)\nHavin' money talks, too large for your eardrum (mmm)\nDeath penalty, that's when the needle or the chair come (Kill kill kill!)\nBest shape of my life, check the endurance\nGot the guns in the attic for homeowner's insurance (hahaha)\nYou know, preferably, rather the chrome for my performance (chrome)\nStill murderin' shit, knowin' damn well that they on us\nWe like fuck it, though, what!\n\n[Chorus: Styles P (Jadakiss)]\nKillin' these niggas like it's a sport now\nFoul as a Rockefeller or Rothschild\nTailor made cloth on my body, holdin' the fort down\nRoom full of bosses callin' me boss now (what!)\nKillin' these niggas like it's a sport now\nFoul as a Rockefeller or Rothschild\nTailor made cloth on my body, holdin' the fort down\nRoom full of bosses callin' me boss now (what!)\n\n[Outro: Jadakiss]\nWhat, what, what, what, what...\n(Kill kill kill! Kill kill kill! Kill kill kill!)", "image": "https://images.genius.com/3385235d07508159ef0e53f7e2122697.1000x1000x1.jpg"}], "artist": "Jadakiss"}