{"songs": [{"title": "This Has Been My World", "album": "Ludaversal", "year": "2015-03-31", "lyrics": "[Intro: Ludacris]\nOver a decade later\nLet's toast to the good life\nWe still living the hood life\nWelcome to my world Ludaversal\n\n[Verse 1: Ludacris]\nListen\nI think I got the best job in the world\nCuz I ain't gotta take the piss test\nMichael sending me Jordans every 1st of the month\nSaid his kids love me, ain't paid for a pair of kicks since\nWhy is it that when 'em niggas gettin' rich\nThe whole world just wanna get you some free shit? (Hahah)\nAin't that 'bout a bitch\nEspecially when they told me I'll never do shit, or be shit\nI made it and never took you for granted\nTook off and I never landed, supply whatever demanded and no one's ever handed it to me\nI kicked it off with me and my special team and shot the [?] to me\nTouchdown on my old turf, money and bitches sucking me in my microphone vest\nAnd no, I'm not surprised at my own work, been taking niggas to school, go do your homework\n\n[Hook: Ludacris]\nYeah, and I been going around in circles\nLike everyday is a rehearsal\nIs my life your entertainment?\nThis has been my world, Ludaversal\nThis has been my world, Ludaversal\nThis has been my world, Ludaversal\nMy life your entertainment\nThis has been my world, Ludaversal\n\n[Verse 2: Ludacris]\nAlmost everyday I'm waking up in another city\nAnother country, a different climate and a time zone\nJet lag but I'm out of the bed fast for bad foreign bitches that I'm eager to lay my eyes on\nSo I opened up the blinds to the sky on\nWish that I could talk to God on my iPhone\nI thank Him for all of his generosity\nAnd for satisfying most of my curiosity\nFans asking me what it's like to be me\nI always tell 'em it's more good than bad\nThey say I want what you got\nI tell 'em you'll never have shit if you don't appreciate what you have\nSo I have learned to appreciate all the simple things\nLike some good head and a fine wine\nWe all going through life searching for answers\nAnd I been all around the world tryna find mine\n\n[Hook: Ludacris]\nYeah, and I been going around in circles\nLike everyday is a rehearsal\nIs my life your entertainment?\nThis has been my world, Ludaversal\nThis has been my world, Ludaversal\nThis has been my world, Ludaversal\nMy life your entertainment\nThis has been my world, Ludaversal\n\n[Verse 3: Ludacris]\nSeems like everyday is a holiday\nCelebratory popping bottles and model days\nStereotypical rap shit personified\nFrom 8 albums committin' lyrical homicide\nThese airports like international mazes\nNow my passport needs additional pages\nThen I'm staring out at another horizon\nStaying fly even in the no fly zone\nBodies on board but my mind's gone\nAin't no better feeling than when I fly home\nStaring out the window of the plane in the rains even the clouds need a shoulder to cry on\nI'm crying cuz I'm living out my dreams\nBut this life is not easy as it seems\nIt's sorta similar to a crack game\nAin't no slowing down when you living in the fast lane\n\n[Hook: Ludacris]\nYeah, and I been going around in circles\nLike everyday is a rehearsal\nIs my life your entertainment?\nThis has been my world, Ludaversal\nThis has been my world, Ludaversal\nThis has been my world, Ludaversal\nMy life your entertainment\nThis has been my world, Ludaversal\n\n[Big Rube]\nLife is a gift\nAnd we have a responsibility to live it\nFrom the first breath to the last\nOur future is built on the foundation of our past\nExperience is a professor, and its test's at a highest pressure\nWhile we can't afford to crack\nWe must bear not to break\nLike a reed in the wind we go with the flow\nWhile still reaching for the light\nAvoid useless conflict while never running from the fight\nThe struggle that forever bubbles just beneath the surface\nI'm dedicating to the service of self and to my people\nAnd to never feeding the beast of unnecessary evil\nWe say the most when saying the least\nTaking action to display our character\nFrom the first second that we start to feast until the day that we break this barrier\nSo disparaging is the civilized savage relegated to antiquation only striving to become average\nI'm much happier as a maverick\nA cowboy that uses his cabbage to get more green than most niggas done seen\nThe good kind and never the bad bitch\nThe best that life has to give are the blessings of this life that we live\nAnd everyday on everyplace [trying] not lose my way, I've had to learn\nJust remember in any existence it's not the destination but the journey\nLive your life\n\nJust Blaze!\n\n[Musical Outro]", "image": "https://images.genius.com/62819740802d113d74cdf35e32db7990.1000x1000x1.jpg"}], "artist": "Ludacris"}