{"songs": [{"title": "Space Boogie", "album": "Space Boogie: Smoke Oddessey", "year": "2001-07-17", "lyrics": "[Kurupt]\nYeah nigga... Westcoast\nWestcoastin', floatin', oh so ferocious\nNigga!... G'z... Young Gotti\n\nI'm like... fuck a bitch and fuck you too\nIt's so many different things that I'm gon' do\nSwitches all fucked up\nLivin' in the '80's jackin' niggas for Nissan trucks\nA quarter piece to flip\nIt's me and Daz and two bitches\nI never gave a fuck, nigga Daz and Kurupt\nThey say this ain't the way to get rich!\nI might as well pimp me a bitch!\nI don't get it, I take it\nPut a glitch in the Matrix\nFlip some bricks to strip ya bitch naked\nCause I just don't care, live from \"G\" square\nWhere the best Indica get put in the air\nNigga... fuck a bitch and fuck you too\nWhat a punk mothafucka like you gon' do?\n... I holla'd at Dr. Dre, hit up Bigg Snoop\nWit the candy cut-cut perfectly on fued\nIt's on one, nah he said it's on two\nOn fifteen shells, ducked and detailed, de-railed\nAll on you to to want to\nDo what the fuck you want to do too\nGet what ya got to get to get through\nLight what ya wanna light to light fire\nBig arsonist blew to white fire\nBlast through ya home or blast to hit doors\nCrap like the crap table, Kane and Abel\nI'm cyanide Sinatra, galactic Galaga\nMetaphysical sixteen caliber Metallica\n'Sane asylum shanker, big and little banker\nPunk mothafucka, mothafuck, mothafucka, yeah nigga\nWe can go heads nigga\nYour bitch give me head nigga, heard what I said nigga?\nFlip me some bread nigga, get ya chest bust like lead niggas\nSleep to-bed nigga, Daz and Fred nigga\nKurupt Young Gotti, Baby Face, Capone\nWe on Niastra, nigga on the microphone\nNever never have I ever gave a fuck\nDat Nigga Daz Dillinger, Fred, Kurupt\nAnd we do what the fuck we want to do too\nGet what we got to get to get through\nAnd we blast what we got blast to get ours\nLife of a gangsta in a world of stars\nLight what ya wanna light to light fire\nBig arsonist blew to white fire\nDo what the fuck you want to do too\nGet what ya got to get to get through, through, through\nJust do it... don't stop\n\n[Nate Dogg]\nAll my niggas on the North side, getcha money right away\nAll my niggas on the South side, let 'em know that you don't play\nAnd say them niggas on the East side, ain't some niggas you contest\nUnless you stuck up in a time-warp, you all ready know about the West\nThey say them niggas on the North side, keep tabs on they skrill\nAll my niggas on the South side, try to make another mil'\nAll my niggas on the East side, make million dollar deals\nAll my niggas on the Westside, been doing this for years\nThrow ya mothafuckin' hands up somebody\nThrow ya mothafuckin' hood up somebody\nWhat them niggas do, they ride\nWhat them niggas do, they ride, ride\nThrow ya mothafuckin' hands up somebody\nThrow ya mothafuckin' hood up somebody\nWhat them niggas do, they ride\nWhat them niggas do, they ride, ride\n\n[Kurupt]\nMac, Young Gotti, fuck the world nigga\nDaz Dillinger, Fredwreck, Dogg Pound, L.A. life\nFuck a Long Beach world, murder your enemies cuz!\nThey tryna murder you, you know who I'm talkin' to nigga!\n2000, screech 'em on 'em, riders, the real riders\nDogg Pound Gangsta riders, hoodsies", "image": "https://images.genius.com/32f5907a0f69c52bd9d20ec857b3f90c.944x944x1.jpg"}], "artist": "Kurupt"}