{"songs": [{"title": "Maybach Music", "album": "Trilla", "year": "2008-03-11", "lyrics": "[Intro]\nHeh, what is this? (Maybach music)\nI like this Maybach music\n(Sweet!) Hahahaha\nCome and take a ride\nCome and take a, come and take a ride\n\n[Interlude: Rick Ross]\nBillionaire, yayo\n(J.U.S.T.I.C.E. League)\n\n[Verse 1: Rick Ross]\n57, yes, yes, good for a D-Boy\nHand my MAC-11 to the engineer to record\nGot the baddest women in the world for me to feed on\nDouble deck yacht, docked Boss, blowin' weed up\nRevenue incredible, it put me on a pedestal\nColumbia to Mexico, I figured was a better route\nLook at me, a model now, models and them bottles 'round\nA Blood holla, \"Ballin,'\" but the boys in blue, they shot 'em down\nGang-affiliated, colors prosecutors painted\nCause the niggas I employed name synonymous with mayhem\nInstrumentals that are mental, Maybach kind of mental\n400 off the lot, the block is monumental (Boss)\nSome things your money can't buy\nLike Heaven in the sky, even a better ride\nIn the rear, so many instruments I hear\nTucked behind curtain, no sign to fear\nI'm higher than a lear, this Maybach music\nDesigner shit I wear, make hoes lose it (Boss)\nClose your eyes and inhale the smoke\nIt's Maybach music, the realest shit I wrote, nigga\nBy an ounce, take a toke\nOf this Maybach music, the realest shit I wrote\nBoss!\n\n[Interlude: Jay-Z]\nIt's Young!\nHahahah, fuck it then\n\n[Verse 2: Jay-Z]\nBlack Maybach, white seats, black pipin'\nRemind me of Paul McCartney and Mike fightin'\nYou know, \"The Girl Is Mine\"\nLife's a bitch, so the whole world is mine\nThe six-deuce long, the curtains are drawn\nPerfectly like a Picasso, Rembrandts and Rothkos\nI'm a major player, 40/40's in Vegas at the Palazzo\nThey said it was not so\nCertain things your money can't buy\nLike being this fly, 'til then, I'm just gon' ride\nI'm like G Rap with better transportation\nOn the road to the riches, reach my final destination\nIn the lear, closer to Aaliyah, say a prayer\nHope I get to see her when I disappear from here, baby, yeah\nBut I don't see the endin' through these millionaire lenses\nJust the two M's on the emblem\nThe partition roof, translucent and humidor\nRefrigerators, where Ace of Spades or two I store\nTrue story, my closet is like two stories\nStraight to the happy endin', cause I don't do stories\nShawn Corey, real rap\nThe Maybach is bananas—peel back\n\n[Interlude: Jay-Z]\nHahahah, you feel that? Young, c'mon\n\n[Hook: Jay-Z]\nRealest shit I ever wrote, chillin' in my Maybach\n8-track episodes, been doin' this since way back\nSince way back, since way back\n8-track episodes, been doin' this since way back\nRealest shit I ever wrote, chillin' in my Maybach\n8-track episodes, been doin' this since way back\nSince way back, since way back\n8-track episodes, been doin' this since way back\n\n[Interlude: Rick Ross]\nBoss, can't be stopped now\nWe got too much cake\n\n[Verse 3: Rick Ross]\nThey pinchin' pennies, while I'm musclin' for mills\nAnd that muscle be that muzzle, when I stuff it in your grill\nStuffed shells, thanks to crack, I crack crab and lobsters\nNot all mobsters imposters, gotcha\nBoy, I got a eagle view, standin' on my balcony\nCan only stay a week or two, so many people out for me\nI bulletproofed my Maybach, got a killer's intuition\nHoldin' on that MAC-11, Makaveli premonition\nWaitin' on my Suge Knight, one nation under God\nSince I chose a thug's life, guess I gotta play my part\nNever will I die, my name symbolized\nThe hustle for young killers coming from the other side\nSome things your money can't buy\nLike Heaven in the sky, even a better ride\nI'm large, my black car, menagin' black broads\nMassage for frauds, I'm livin' large, my fat rocks\nIt's eat to kill in the field of hip-hop\nRunnin' up on the car, you get popped, mopped and dropped\nI'm the boss", "image": "https://images.genius.com/f8b2e81ca63aac9b6abc1db39b51d092.520x516x1.jpg"}], "artist": "Rick Ross"}