{"songs": [{"title": "No. T. Lose", "album": "Searching for Jerry Garcia", "year": "2005-08-09", "lyrics": "[Intro: Proof]\nThere's nothing, there's nothing\nThere's nothing, no there's nothing\nWon't lose it, can't lose it\nThere's nothing but this music\n\n[Verse 1: Proof]\nMy mind is broke, too many lines of coke\nOpen mind for beefing, no reason, now I'mma choke\nTime to quote something you've never heard\nPour my heart when I talk and spit it with every word\nWe ain't playing no more, saying no more\nNo gangs to war, move the ground when we came for yours\nIn a four-double, Billboard trouble\nThis industry ain't ready for more rebels\nKill at will, with the will to kill\nKeep it real with steel, these pills'll feel\nProof for popping, they used to jogging\nTo take out your block was my future calling\nDon't confuse it y'all, I used to brawl\n*pop pop, pop* 'Til your producer fall\nWho's involved? They don't wanna do nothing\nLoot-style, I'll make 'em all move something\nClap the mag up, back the gas up\nLeave 'em scapped and smashed up, then wrapped in plastic\nAsk the hood, this a platinum classic\nNow quit the yackin bitch and pass the acid, c'mon\n\n[Chorus: King Gordy]\nWhat they want right now is a nigga with nothin' to lose\nOhhh nothin' to lose\nHe got no shame in his game about the stuff that he do\nOhhh the stuff that he do, right now\nJump off stage right now nigga start punchin a fool\nOhh punchin a fool\nY'all bitch, that's why we ain't fuckin witchu!\nWe ain't fuckin witchu, no no\n\n[Verse 2: Proof]\nHit the metal with devilistic tongues, is fun\nFor the ghetto kids that misfit dumb\nAlong with red and yellow biscuits to munch\nThis day before you was never meant to come\nForever rich and dumb, brought out anyday\nYou heard Slim, we all out Renegades\nTo the end of days, blow your skin away\nWho better than D12? That's a sin to say\nCan you follow this? Y'all swallow shit\nOf politics, I'll lack the tolerance\nTake the motherfucking dust from this laced blunt\nTake The World With Me, fool, nigga like Pacewon\nAin't none ready, slap box for kicks\nPack box to spit, and smack cops with dick\nThis is narcotics, and dark knowledge, that's symbolic\nSin-sonic, demonic, and my hearts rotted\nMake plans on insanity sands\nI'm like \"Damn\", too much in me Incredible Man\nAnd I got a gram in each hand in enemy land\nI'm bustin' off on your block, like Yosemite Sam\n\n[Chorus: King Gordy]\nWhat they want right now is a nigga with nothin' to lose\nOhhh nothin' to lose\nHe got no shame in his game about the stuff that he do\nOhhh the stuff that he do, right now\nJump off stage right now nigga start punchin a fool\nOhh punchin a fool\nY'all bitch, that's why we ain't fuckin witchu!\nWe ain't fuckin witchu, no no\n\n[Verse 3: Proof]\nUgh, sittin' in Hell with a blunt and ice cube\nPlottin' with Satan to snatch God's light view\nDidn't like school, I never liked you\nI'm burning Bibles while I'm sniffing on this white glue\nFight dudes, black to white fools\nThen act cocky, I'm Rocky, shit I might lose\nBut I doubt it, I'm 'bout it, 'bout it, about it\nLoan me your life, or see Christ without it\nVictory, is meant to be\nWhere my father has been, it's been a mystery\nBut I don't give a fuck, I'mma live it up\nGetting drunk, hitting clubs, and I'm selling off prescription drugs\nAnd I miss you Bugz, hold steady now\nProof is here, the world ain't ready now\nIf you gay, you gay, you straight, you straight\nYou violate today, another mistake you make, HEY\nAre you swallowin'? Hey, lil' thing I'm poppin'\nDon't need a greasy college to see you droppin'\nProof the king of bosses, so bring your coffin\nI'm like a sucka punch, \"Why?\", Cause I ain't seen it often\nGenious artists, so retarded\nBroken hearted, my soul's like a open target\nAnd I'm ready to leave Earth\nYou step to my death, next year on my t-shirt\n\n[Chorus: King Gordy]\nWhat they want right now is a nigga with nothin' to lose\nOhhh nothin' to lose\nHe got no shame in his game about the stuff that he do\nOhhh the stuff that he do, right now\nJump off stage right now nigga start punchin a fool\nOhh punchin a fool\nY'all bitch, that's why we ain't fuckin witchu!\nWe ain't fuckin witchu, no no\n\n[Outro: King Gordy]\nGot Derty Harry, well well\nKing Gordy, well well\nDirty Dozen, WELL WELL\nFAT KILLAHZ, FAT KILLAHZ", "image": "https://images.genius.com/ab9a6517cd52ed1370641d9d44571fdd.500x500x1.jpg"}], "artist": "Proof"}