{"songs": [{"title": "My Christmas", "album": null, "year": null, "lyrics": "[Skit: Hopsin & Friend]\nAyo Pillowman\nWassup man?\nIt's almost Christmas bro, aren't you excited?\nMan, hell no\nHuh? Why not?\nMan, it's a long story, man\nDude, what's going on?\n\n[Chorus: Hopsin (Friend)]\nHey Mom, Dad\nWhat did you get me for\nChristmas?\n(You gotta feel the spirit bro, come on)\nHey Mom (Sing it), Dad (Yeah)\nWhat did you get me for\nChristmas?\nLemme tell you what Christmas is like for me, man\nCheck this shit out (What's going on, man?)\n\n[Verse: Hopsin (Friend)]\nYo, this year, I'm really not looking forward to Christmas (Why?)\nI'ma wake up really happy, then get pissed 'cause I ain't get shit (Aw)\nMomma be in the kitchen, cooking burnt ass biscuits (Ew)\nWhen I look at 'em funny, her ass gon' be like \"What is it?\" (Ha)\nMy friend gon' call me up telling me bullshit that I can't believe\nLike \"Yo bro, guess what? My mom got me Mercedes keys\" (Woah)\nAnd I'ma lie and be like \"Yeah, that shit is great ya see\nBut to be honest, Christmas is just another day to me\" (I see)\nI'ma be mad 'cause his parents rich and my parents not (So?)\nHe gets cars, I get pairs of socks\nI'm always gettin' treated unfair a lot, this Christmas, I ain't havin' fun\nOur tree ain't even real, it's a detachable plastic one (No way)\nMy dad gon' come with his cheap watch that he got me\nFrom the swap meet, and if I ask him if it's real, he'll say \"Probably\" (Oh)\nMan Dad, do you have no heart? You couldn't get me a go kart\nOr a Tyco RC remote control car? (Chillax)\nHe gon' be like \"There you go makin' this noise\nI done told yo ass you too old to playin' with toys\"\nThen my mom gon' walk in the room and start arguin' too\nMy dad gon' be like \"Go woman, nobody talkin' to you\" (Wow)\nAnd I'ma say \"Dad you love talking mad shit\nBut in public you always act like you above causing havoc? (No way)\nThen I'ma run upstairs, mad as fuck 'cause I've had it\nProbably masturbate while watching Spongebob and Patrick (Ew)\nI don't know\n\n[Chorus: Hopsin]\nHey Mom, Dad\nWhat did you get me for\nChristmas?\nHey Mom, Dad\nI said what did you get me for\nChristmas?\n\n[Outro: Hopsin]\nFuck man, stupid ass Christmas, man\nThat shit used to be fun when I was little\nNow that shit is wack as fuck, man\nTurned into a grown ass man now\nStupid ass real life shit, man, Damn!", "image": "https://images.genius.com/1620b55458e423f96bf6316d13418223.1000x1000x1.jpg"}], "artist": "Hopsin"}