{"songs": [{"title": "Why Did You Leave Me", "album": "Ego Trippin’", "year": "2008-03-07", "lyrics": "[Snoop Dogg]\nBada-bing, bada-boom, what a dogg gotta do?\nLet me holler at you boo, damn I miss you\nI just wanna kiss you, and all that good stuff\nWas I really all that bad or was I good enough?\nI'm under pressure, I can't run plays like this\nMy mama always said that there'll be days like this\nI'm all alone by the phone, in a zone, face is stone\nWonderin', if you ever comin' home\nI try to run the streets and play\nBut that feeling just won't go away\nMy whole life I'd throw away, to get you back on my team\nDamn, why'd you have to go away?\n\n[Hook]\nI miss your breakfast in the mornin'\nMiss you in the evenin', tell me why you're leavin'\nPlease give me a reason, nothin' could ever change me\nI'm missin' my baby, think I'm goin' crazy\n\n(Why did you leave me?)\nYou can't leave me by myself like this\nYou can't leave me by myself like this\n(Why did you leave me?)\nYou can't leave me by myself like this\nMama told me there'll be days like this\n\n[Snoop Dogg]\nI get up early in the mornin', miss your rudeness and kissin'\nI also miss that smell of that good breakfast in the kitchen\nListen, I'm a star but I'm wishin'\nTo follow you wherever you are\nYou the wheels to my car, and I can't roll without you\nMy heart is a ice box, it's cold without you\nWhy'd you have to, leave me this way?\nI'm doin' bad, you don't wanna see me this way\nI'm at the pad, tryin' to do my best\nI'm so stressed, and yes I'm still the King of the West\nTryin' to manage, and I'm gon' handle it\nI need you back in my life, cause I'm tired of livin' scandalous\n\n[Hook]\nI miss your breakfast in the mornin'\nMiss you in the evenin', tell me why you're leavin'\nPlease give me a reason, nothin' could ever change me\nI'm missin' my baby, think I'm goin' crazy\n\n(Why did you leave me?)\nYou can't leave me by myself like this\nYou can't leave me by myself like this\n(Why did you leave me?)\nYou can't leave me by myself like this\nMama told me there'll be days like this\n\n[Snoop Dogg]\nOh my Lord, I'm sittin' at the board with my head down\nI can't write my next line, I need to lay it down\nHmm, I'm stuck like a dump truck\nLookin' stupid, cupid down on my luck\nI touch a four leaf clover\nHopin' for somethin' good, like I should\nIf not I guess it's over\nBaby be real with it\nDo you love me, do you miss me?\nI can't deal with it\n\n[Hook]\nI miss your breakfast in the mornin'\nMiss you in the evenin', tell me why you're leavin'\nPlease give me a reason, nothin' could ever change me\nI'm missin' my baby, think I'm goin' crazy\n\n(Why did you leave me?)\nYou can't leave me by myself like this\nYou can't leave me by myself like this\n(Why did you leave me?)\nYou can't leave me by myself like this\nMama told me there'll be days like this", "image": "https://images.genius.com/fd5ace5214e5da1f374653720da7d1c1.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}