{"songs": [{"title": "The Storm (2017 BET Hip-Hop Awards Cypher Verse)", "album": "BET Hip-Hop Awards 2017", "year": "2017-10-10", "lyrics": "[Intro]\nIt's the calm before the storm right here\nWait, how was I gonna start this off?\nI forgot… oh yeah\n\n[Verse]\nThat's an awfully hot coffee pot\nShould I drop it on Donald Trump? Probably not\nBut that's all I got 'til I come up with a solid plot\nGot a plan and now I gotta hatch it\nLike a damn Apache with a tomahawk\nI'ma walk inside a mosque on Ramadan\nAnd say a prayer that every time **** talks\nShe gets her mou— ahh, I'ma stop\nBut we better give Obama props\n'Cause what we got in office now's a kamikaze\nThat'll probably cause a nuclear holocaust\nAnd while the drama pops\nAnd he waits for shit to quiet down, he'll just gas his plane up\nAnd fly around 'til the bombing stops\nIntensities heightened, tensions are risin'\nTrump, when it comes to givin' a shit, you're stingy as I am\nExcept when it comes to havin' the balls to go against me, you hide 'em\n'Cause you don't got the fuckin' nuts like an empty asylum\nRacism's the only thing he's fantastic for\n'Cause that's how he gets his fuckin' rocks off and he's orange\nYeah, sick tan\nThat's why he wants us to disband\n'Cause he cannot withstand\nThe fact we're not afraid of Trump\nFuck walkin' on egg shells, I came to stomp\nThat's why he keeps screamin', \"Drain the swamp!\"\n'Cause he's in quicksand\nIt's like we take a step forwards, then backwards\nBut this is his form of distraction\nPlus, he gets an enormous reaction\nWhen he attacks the NFL so we focus on that in–\n–stead of talkin' Puerto Rico or gun reform for Nevada\nAll these horrible tragedies and he's bored and would rather\nCause a Twitter storm with the Packers\nThen says he wants to lower our taxes\nThen who's gonna pay for his extravagant trips\nBack and forth with his fam to his golf resorts and his mansions?\nSame shit that he tormented Hillary for and he slandered\nThen does it more\nFrom his endorsement of Bannon\nSupport for the Klansmen\nTiki torches in hand for the soldier that's black\nAnd comes home from Iraq\nAnd is still told to go back to Africa\nFork and a dagger in this racist 94-year-old grandpa\nWho keeps ignorin' our past historical, deplorable factors\nNow if you're a black athlete you're a spoiled little brat for\nTryna use your platform or your stature\nTo try to give those a voice who don't have one\nHe says, \"You're spittin' in the face of vets who fought for us, you bastards!\"\nUnless you're a POW who's tortured and battered\n'Cause to him you're zeros\n'Cause he don't like his war heroes captured\nThat's not disrespectin' the military\nFuck that, this is for Colin, ball up a fist!\nAnd keep that shit balled like Donald the bitch!\n\"He's gonna get rid of all immigrants!\"\n\"He's gonna build that thing up taller than this!\"\nWell, if he does build it, I hope it's rock solid with bricks\n'Cause like him in politics, I'm usin' all of his tricks\n'Cause I'm throwin' that piece of shit against the wall 'til it sticks\nAnd any fan of mine who's a supporter of his\nI'm drawing in the sand a line, you're either for or against\nAnd if you can't decide who you like more and you're split\nOn who you should stand beside, I'll do it for you with this:\nFuck you!\nThe rest of America, stand up!\nWe love our military, and we love our country\nBut we fuckin' hate Trump!", "image": "https://images.genius.com/e2ec6f3894f91cc1a11ec8f71429e258.1000x1000x1.jpg"}], "artist": "Eminem"}