{"songs": [{"title": "The Making of “Ye Vs The People”", "album": null, "year": "2018-04-30", "lyrics": "[Kanye]\nLike these is all super pretty things that make you feel everything is safe\nI got my polo shirt, I got my horse, it's all good\nI got my cross on me\n\n[T.I.]\nI agree, but I just think that when you have lives lost\nAs artists, that gives us an obligation to stand up against all of that kinda shit\n\n[Kanye]\nYou know, me putting the hat on forces an evolution because\nThere's, even for me, I know so much more in the past 3 days\nBecause I'm getting this energy, positive or negative\nAgreeing with me, disagreeing with me\nIt's like, and that like sharpens the diamond, that shit\nOur mind, our conscienceness the way we're thinking\nJust breaking some shit\n\n[T.I.]\nYour intentions, from what you tell me, are pure\nBut the direction that you took to get there is a bit unorthodox\nAnd kind of... I would say - some people would say thoughtless\n\n[Kanye]\nIf I had not done what I felt and I just thought\nThen it would've just never happened\nAnd when I wear that hat it's like a fight for equality\nLike \"oh I can wear this hat too\"\nI think people get mad at me when I name my idols\nAnd I don't say Michael Jordan, I say Disney\n\n[T.I.]\nI just want you to consider all the people who just might be terribly, like, just torn apart and hurt\n\n[Kanye]\nI really wanna take that hurt off of them and let them understand that I did not wear that hat to hurt them\nHalf the shit Trump does, I don't agree with\n\n[T.I.]\nWhat half do you agree with?\nLet's get that out\n\n[Kanye]\nJust the ability to do what no one said you could do\nTo do the impossible is the most inspiring thing to me\n\n[Kanye, to someone else in the room]\nDid you play that umm, the one that said\n\"Tell Daddy what you learned in school\"\n(You wanna play with that, boy?)\nI wanna play with that, yeah\n(Alright, okay)\n\n[Kanye, on a playback of \"Ye Vs The People\"]\n\"I was in debt and the car that broke\nThe same shit I've been saying for years they called it \"loc\"\nSuccessful man, a man that [?] the [?]\nThe most successful man the one's who can afford the most mistakes\nAnd play with them\"\n\n[Kanye]\nYou could mix into that cause I basically gave a lotta my side on that\n\n[T.I]\nSure\n\n[Kanye]\nYou know what I'm saying?\nAnd your shit come in, you say\n\"Whoa whoa whoa, what you say?\nHow could that be?\n[murmurs]\"\nYou know what I'm saying?\nThe exact conversation we're having\nAnd what would you say?\n\n[T.I.]\nSure\n\"Yeah I'm just trying to figure where you're trying to go with this\nSome things you don't align with and some shit you just don't go against\"\nThat would kinda [gestures], you know\n\n[T.I., in recording studio]\nLet me hear it bro, let me see what we got here\n\n[T.I. listens on a set of headphones]\n\n[T.I., recording]\n\"... you're goin' now\n'Cause everything that you built can be destroyed and torn down\"\n\n[Kanye, recording]\n\"... know everybody emotional\n\"Would it be better if I rapped about selling crack?\nBecause it's cultural?\nOr how about I'ma shoot you? Or fuck your bitch?\nOr how about all this Gucci, or I'm fuckin' rich?\"\n\nOr uhh, I could fuck your bitch\n\n[T.I., recording]\n\"Here's a suggestion, be selective with your critical views\nOf people who done made greater contributions than you\"\n\n[Kanye, on a playback of \"Ye Vs The People\"]\n\"I know Obama was heaven-sent\nBut ever since Trump won, I felt like I could be president\"", "image": "https://images.genius.com/70c6e506a91f6dabdd23cad304812ce3.533x533x1.jpg"}], "artist": "Kanye West"}