{"songs": [{"title": "Pure Colombia", "album": "Dedication 5", "year": "2013-09-01", "lyrics": "[Verse 1: Lil Wayne]\nI can't trust these niggas, throw some water on 'em,\nThey tell me \"Go to Hell,\" Okay I know the owner\nStrip clubs gettin old all the strippers hoein'\nAll these bitches think they dimes, watch me flip a coin\nThank You Jesus, My dogs is off the leashes\nHad to leave my spanish bitch 'cuz she was startin' to get suspicious\nTell The Beef I mean business, suit and tie nigga\nYou and all your dogs can get euthanize nigga\nTrigger happy nigga, I just can’t stop smiling\nThank God I’m fly, I had to thank my pilot\nYou think you’re calling shots, you got the wrong numberI love Benjamin Franklin more than his own mother\nThrow that pussy, throw that pussy\nAnd I don’t want no throw back pussy, man fuck these pussy-\nAss niggas, I lay back and ash Swishers\nMy new shoes is ass-kickers, she drink cum like she had hiccups\nRest In Peace to my last victim\nWe be passing blunts, they be passing judgement\n5 blunts of that strong, call that strength in numbers\nAK’s with Chiquitas, you shell-shocked like Adidas\nWhoever find your body, finders keepers, yeah\nIt’s that pure Colombia\n’Cause soon as the bitch tasted it her tongue was numb\nIt’s loaded, so I just let her jump the gun\nIt’s that Dedication 5 and another one, I love it!\nTunechi\n\n[Bridge]\nYeah, free Scooter, I'm outchea\nLet's get it\n\n[Verse 2]\nI done lost a couple hoes but I'm still a pimp\nThis change of face on my Rollie, shout out Lil Kim\nPark my cars in front my house like I ain't got no garage\nJust looking for a bitch to stay down like I'm throwing knives\nMac so paid we 'bout to start calling him Macintosh\nI really beat that pussy up them niggas shadow box\nThese niggas sending threats, I'mma start sending hits\nBring me his head, so I can make sure its him\nIt's lonely at the top, it's lonely at the top\nI think I'm 'bout to jump, niggas phony as a prop\nAin't nothing on me but this chop, turn you, your homies into slop\nPut your brains all over the window, people passing window shop\nLike ugh, this that pure Columbia\nIt's just us, fuck the rest we got insomnia\nMost likely I done fucked that bitch that's laying under ya\nShe said she trying to see me, bitch that's Stevie Wonderful\nYou better, mind your business, hitman with a hit list\nYMCMB, the world is ours, seconds minutes\nI'm a movie motherfucker, camera man, are you getting this?\nBurning blunts like bridges, turn up, missing\nAhhhhh\nWe out here with that clean work, these niggas selling remix we got clean work\nKill everybody ya'll gone need a limousine hearse\nYou see I'm armed like a fucking short sleeve shirt!\nD5, what up five?\nYeah", "image": "https://images.genius.com/aa4f93cf953aad46ecd13d3027b59fff.475x475x1.jpg"}], "artist": "Lil Wayne"}