{"songs": [{"title": "I Do It for Hip Hop", "album": "Theater of the Mind", "year": "2008-11-24", "lyrics": "[Intro: Ludacris]\nI do it for hip-hop\nI do it for hip-hop\nI do it for hip-hop\n\n[Verse 1: Ludacris]\nNow this is what they call poetry in motion\nMy soul bleeds on the paper, heart screams with emotion\nIt's my daily devotion, the verses stay deeper than the ocean\nSo hip-hop you owe me a promotion!\nYeah I do a little boastin and braggin\nWhat's all the commotion and naggin about? Cause I'm still the champ in the South?\nCause rappers get in the booth and I keep draggin em out?\nWell they're fired, and these pink slips, I'm handin em out\nCause this is \"Theater of the Mind,\" consider it a sign\nOf what's to come next, my money's just fine\nBank filled with dumb checks, terrorist threat flow\nProceed to drop bombs like Mr. Funk Flex\nBut I don't do it for the money, I do it from the heart\nI do it with the beat box, I did it from the start\nI do it for the dee jays, I do it for the charts\nThe Van Gogh flow, Luda do it cause it's art\nI do it for the fans, I do it on command\nI do it for the front row, I do it for the stands\nI spit it for the hood, I do it for the block\nAnd since nine years old I did it for hip-hop, so\n\n[Hook 1: Ludacris]\nI don't do it for them cars and the fancy drops\nI do it for hip-hop\nI do it for hip-hop\nI do it for hip-hop\nAnd I don't it for the chains and the flashin rocks\nI do it for hip-hop\nI do it for hip-hop\nI do it for hip-hop\n\n[Verse 2: Nas]\nUhh, uhh, uh\nThey say I'm so low key, I'm socially awkward\nOnly niggas who really know me, who I talk with\nThey smile in the light, hate in the dark\nYou call it beef, to me, it's just a fuckin walk in the park\nCause you are who you are when nobody's lookin\nThat's who you are, so when the cash and the cars is gone\nThe day after tomorrow, don't be askin to borrow\nSki mask it hard, like the way you rap in your bars\nI can ride on you and whoever, devise new endeavors\nI'm as live as a hive full of predators\nTwenty thousand different species of bees\nSome have poisonous stings, some just pollen their leaves\nIt's like rap, some just buzz, some will attack\nCompromise their own life in fact\nSixteen years since my first sixteen\nPardon the rest of my niggas... but I'm the best who's ever did it!\n\n[Hook 2: Ludacris) & Nas](I don’t do for the cars and the fancy drops)\nUh, I doit for hip-hop\nYeah, I do it for hip-hop\nUh (I do it for hip-hop)\n(And I don’t do for the chains and the flashin’ rocks)\nWhy we do it kid? I do it for hip-hop\nYeah, I do it for hip-hop\nUh, I do it for hip-hop\n\n[Jay-Z]\nHip-hop, started out in the park\nWe used to do it to avoid the Narcs\nI used to do it so the homeboy Clark\nCan get the fuck off my back while I knocked off these packs\nI used to rap to impress my friends\nTo pass the time while I was gettin' it in\nJust so happens, I'm so illegal with the pen\nThey ain't want me doin' anything illegal again\nI lost a lot of dogs to these streets\nI got Grammy Awards on these beats\nThank God for Kool Herc\nWithout your shit I probably would've got murked\nShout out to Grandmaster Flash and to Caz\nAnd even Jaz bum-ass\nHip-hop helped me wash my rocks\nThese other rappers couldn't wash my socks\nThat's why I took the number one slot\nThe realest shit in rap comes from my voice box\nLord knows when I was on my clock\nI prolly never woulda stopped, thank God for hip-hop\n\n[Hook Three: Ludacris] + (Jay-Z) + {Both}\nI don’t do for the cars and the fancy drops\n(Uh, I do it for hip-hop)\n(I do it for hip-hop)\nI do it for hip-hop\nAnd I don’t do for the chains and the flashin’ rocks\n(Come on, I do it for hip-hop)\n(I do it for hip-hop)\n{I do it for hip-hop}\n\n{*DJ scratches and Ludacris ad-libs until 4:56*}\n\n[Hook 1: Ludacris]\nI don't do it for them cars and the fancy drops\nI do it for hip-hop\nI do it for hip-hop\nI do it for hip-hop\nAnd I don't it for the chains and the flashin rocks\nI do it for hip-hop\nI do it for hip-hop\nI do it for hip-hop", "image": "https://images.genius.com/abff9ac1df466053c5fe1b6b3c92056f.1000x1000x1.jpg"}], "artist": "Ludacris"}