{"songs": [{"title": "Right Here", "album": "No Shame", "year": "2017-11-24", "lyrics": "[Intro]\nA critic has never been able to stop me\nSomebody that doesn't like me\nThey may try to discredit me or even say things that are not true\nThey've never been able to keep me from rising higher\nThey can't stop your destiny!\nSee, an eagle can fly at heights that a crow cannot reach\nThe crows cannot go where you go\n\n[Chorus]\nIf you're lookin' for me I'll be right here, nigga\n818 livin' right here, nigga\nI'm the fuckin' man around here, nigga\nPassin' down the pussy like, \"Here, nigga!\"\nFuck the lavish shit, man, you can have it\nI came up from the gutter like some magic\nAw yeah, niggas sayin' that they want some raw shit back\nIt's right here nigga, here nigga\nYeah, listen up, yeah\n\n[Verse 1]\nBack in 1999 when I picked up a pen\nI swear I used to wish for this (yeah)\nAnd I was so frightened doubting all of my music\nI never thought you'd be into it (yeah)\nNow I feel unstoppable like I'm Bradley Cooper\nUp in that one movie Limitless (yeah)\nAnd I done been around the planet a hundred times\nNigga, I'm truly infamous (yeah)\nAll the grindin' I put into this\nAll my fans are feelin' intimate\nThis shit isn't a coincidence\nTreated this game like a glory hole\nAll I did was stick my dick in it (yeah)\nI do not believe in discipline\nNiggas think I be magicianin'\nI never needed nobody's opinion and\nCosignin' on whatever my decision is\nRap is all I had during the rough conditions\nI bought The Chronic, the deluxe edition\nI heard Eminem on \"What's The Difference\"\nI was like, \"Oh snap, what the fuck is this shit?!\"\nMy homie Justin played Crooked I\nWhen he had made a remix to the song \"Ignition\"\nI kid you not, it blew my mind, I do not lie\nSince then I've been on a mission\nTo be down with rap until my mind corrodes\nI'm dedicated with my life and soul\nWhen I be givin' my all 'til I die and I lie below\nPlease bury me with the microphone\nI ride alone through the night as I flow my pain\nNow the whole world know my name\nA whole lot changed, I'm givin' everybody mo' octane\nAnd you can see it from the dough I gain, so listen\n\n[Chorus]\nIf you're lookin' for me I'll be right here, nigga\n818 livin' right here, nigga\nI'm the fuckin' man around here, nigga\nPassin' down the pussy like, \"Here, nigga!\"\nFuck the lavish shit, man, you can have it\nI came up from the gutter like some magic\nAw yeah, niggas sayin' that they want some raw shit back\nIt's right here nigga, here nigga\n\n[Verse 2]\nThe game is a painful journey\nThank God I never came in early\nHad I blown up in 19 or 20?\nBut damn Hollywood would've raped and jerked me\nFame woulda went to my brain and hurt me\nI had no idea that it may submerge me\nOne minute you're on top, the next minute you might flop\nMan, every single day I'm learning\nI use my ill mind to boost me, still ridin' smoothly\nFeels like a movie, real lies, I'm truly\nBlessed the ways you ain't yesterday, it's too late yesterday\nYou straight kill time profusely\nGo hard, there ain't no excuse\nI get a shot then I won't get loose\nBut I won't let you\nTryin' to take advantage of my hard earned skills, nigga, no can do\nBitches, I am a boss now\nThe pushovers been tossed out\nI deliver the Raw style\nI moved outta my mom's house\nAnybody who never believed has been crossed out\nI got this shit on lock-down\nYou rappers been knowin' you never get Hop's crown\nEven though I come off as a goofy nigga\nI assure you I'm what you should not clown\nI'm too hard to digest\nYou might get your eyes wet, 818's what I rep\n'Til the day I die yes, H-O-P is timeless\nWhy the fuck should I stress?\nI have accomplished the mission that most'd be proud of\nI'm lookin' down on my doubters\nI'm laughin' like, \"Hahaha! Nigga, now what?\"\n\n[Chorus]\nIf you're lookin' for me I'll be right here, nigga\n818 livin' right here, nigga\nI'm the fuckin' man around here, nigga\nPassin' down the pussy like, \"Here, nigga!\"\nFuck the lavish shit, man, you can have it\nI came up from the gutter like some magic\nAw yeah, niggas sayin' that they want some raw shit back\nIt's right here nigga, here nigga\n\n[Outro]\nNigga, I'll be right here\nPosted on the 818 corner right here\nI'm the fuckin' man in this town right here\nAnd I'ma probably die in this city right here\nY'all can find me right here\nIn Panorama city, aw yeah!\nI hear niggas sayin' that they want some raw shit back\nIt's right here nigga, here nigga\nLet the thing out!\nUndercover Prodigy, forever ill", "image": "https://images.genius.com/538c208e6d573914c37ce0417736d005.1000x1000x1.jpg"}], "artist": "Hopsin"}