{"songs": [{"title": "Where Ya At? (Extend Version)", "album": "One Million Strong ", "year": null, "lyrics": "[Intro]\n\"This is a mission, not a small time thing\"\n\n[Prodigy of Mobb Deep]\nYeah yeah yeah yeah yeah, word up son, check it out though\nYaknowhatI'msayin? Word up son\nListen up son, youknowI'msayin?\n(Watch out for them man) Listen up son, check it out though, yo\n\n[Verse 1: Prodigy]\nOpen your eyes get wise and look alive focus your attention\nWindows 95 updated high tech lynchin'\nCrosses of the colored man who claims he hold the keys to the safe\nSecrets of the world, blow him in his face\nWho's the master of the universe, galaxy and planets\nBabylonians ecstatic moon the sinkin of Atlantis\n\n[Havoc of Mobb Deep]\nBe the one soul original black filled with melanin\nGoin out like represent Kuwait in 2000)\n\n[Merchant]\nNever too complex to where it fly\nOver the heads of 85, I strive\nTo stay real and keep hip-hop alive\nRevive thoughts collide, you better slide I advise\nYou keep the eyes on the prize, my metal rips\nMilitant minded like the prejudice, devils I shatter\nThis march was meant to spark a million diligent hearts\nOr e'rylife, we even see alike so play your part\n\n[Lord Jamar]\nKnowledge equality, born gods can follow me\nAs we swarm the yard like bees out in D.C\nThe TV'll televise the revolution for sellin lies\nWithin the constitution, realise the former solution\nOctober 16th, a million black minds comin intertwined\nOn the fact find\nLord Jamal, black Jesus and I stack rhymes\nBut the black-on-black crime that attack mine\n\n[Chorus]\nSo where you at y'all?\nRight here, hanging with my brothers and we showing no fear\nSo where you at y'all?\nRight here, if you representing then throw your hands in the air\n\n[Verse 2: Erule]\nHear my synopsis, I drop this\nGenerates thoughts of born-awareness of the here-and-now\nBuildin a poem with many spearin out\nSociety inflaws unjust laws remain the voided common cause\nEquality rules you to love that equality, many's law to trust this\nAct of the devil possess the sword of justice\nTake the devil's head thru levels nad\nBad truth can spread to mental dead\n\n[RZA]\nImagine us travellin back to Nazareth, most fabulous\nTo raise up the black dead slaves like Lazarus\n\n[Killah Priest]\nWhen I catch rays thru the blaze holy essays\nNo more death days and vexed slaves possessed in caves\n\n[RZA]\nYo it's the last days and times we gots to raise your mind\nBrothers walk around dumb different and blind\nPregnant Earths always carry eggs\nI pledge to never fall of the ledge\nAnd blacks remain family like Sister Sledge\n\n[Sunz Of Man]\nAs we struggle in the jungle of sin, my thoughts are militant\nDestroyin the ignorance, buildin the innocent\nTeachin infants infinite knowledge\nThat wasn't taught in high schools or college\nMy representation is with the 30 million man destination\nWashington, D.C., war with the masons\nThe only celebration is Satan's elimination\nThe past education at the present is relevations\nThe future's our creation, elevation of the nation\n\n[Chorus]\nSo where you at y'all?\nRight here, hanging with my brothers and we showing no fear\nSo where you at y'all?\nRight here, if you representing then throw your hands in the air\n\n[Brooklyn Zoo]\nYo around Red (16) October\nBROOKLYN ZOO attack like cobra\nKillin warrior soldiers in D.C., you face Jehovah all over\nThe darkside, I ride tracks to provide\nElementive intelligence while you fake MC's hide\n(Left, right!) as I command all my sons cos I'm grand\n(Pull his head, snatch land) See if I slide thru the sand\nSnakin those who choose to fake moves on Zoo, ya get bruised\n(Bring ya crew) Opposin the chosen son of God, you get scarred hard\n\n[Chuck D]\nNow, to all my brothers we be rhymin like this\nYeah I can handle, but they can't kill it mill or dismantle it\nAnd we can leave the component alone\nShow all my brothers a brother instead of negro\nCrackers in the back obscene nahmean?\nBut I've been knockin em out the box like saltines\nSo on the single we be flowin at the lingo\nComin together, not solo like Mandingo\n\n[DA Smart]\nSomebody stole me, you took me from Kunta to Toby\nAnd mould me, in a way that you freed me but still hold me\nWhat you tryin to pull? Eatin us like cannibals\nWhatever happened to that forty acres and that animal\nNow you tryin to use intergration just to fool us\nLike Malcolm said we been hoodwinked and bamboozled\nMama cryin, and I ain't lyin\nI'm going to Washington for justice, I'mma get it or die tryin\nDon't hesitate, he's at the gate\nAnd that's a million black men in one place to set it straight\nSo black women applaud the black God\nI'm DA Smart with the million man march\n\n[Chorus]\nSo where you at y'all?\nRight here, hanging with my brothers and we showing no fear\nSo where you at y'all?\nRight here, if you representing then throw your hands in the air", "image": "https://images.genius.com/48632002ee4fdf3d2414cabd5fa44fda.240x240x1.jpg"}], "artist": "Mobb Deep"}