{"songs": [{"title": "925", "album": "Young Sinatra: Welcome to Forever", "year": "2013-05-07", "lyrics": "[Intro]\nNow if you feeling how I'm feeling put your hands up high\nBuck, buck, buck, buck, booyakasha!\nIf you feeling how I'm feeling put your lighters in the sky\nBuck, buck, buck, buck, booyakasha!\n\n[Verse 1]\nNow if you feeling how I'm feeling, put your hands up high\nIf you feeling how I'm feeling put your lighters in the sky\nI'll be damned if I ain't living the life I always wanted\nStarted from the bottom as a youngin gettin' blunted\nNow I run it like a marathon, ho, yeah it's on, ho\nHits motherfucker, hits, Barry Bonds, ho\nIn the studio for twenty-two days\nI'm too paid, might fuck around and kick-flip in my new J's\nI got a show in Paris then Tokyo so I'm Lu-paid\nFucked a shorty in Paris, I'm getting crème brûlée’d\n\n[Chorus]\nFuck a nine to five, I'm too alive for the real world\nNever die in the real world, lie in the real world\nEverything ain't what it seems\nWhen you following your dream\nFuck a nine to five, I'm too alive for the real world\nNever die in the real world, lie in the real world\nEverything ain't what it seems\nWhen you following your dream\n\n[Verse 2]\nHow you feeling, ho? I'm making a killing, ho, really doe\nTalking all that shit behind my back just like a silly (ho)\nHad a dream: Dr. King, now that money ain't a thing\nI've been through a lot of pain, looking like we overcame\nGoddamn, life just ain't the same, all y'all know my name\nFuck the fame, Maryland where I came, broke up in the game\nAnd it feel good, good, real good, good\nNow we livin' in the hills pissing off the neighborhood\nIt's just me, Castro and 6ix, going crazy in this bitch\nPlus my homie Jon, and the whole RattPack, you know we on\nLivin' the life of a don while my homie, Slay, roll up the swisher\nI get richer while they hate, watch the money gravitate\nFinally eatin', grab a plate, hell yeah, that's sounding great\nI've been high, I been low, but there's one thing that I know:\nIt's been a long time coming, now my whole team got it\nAnd if you hatin', suck a dick and bitch about it\n\n[Chorus]\nFuck a nine to five, I'm too alive for the real world\nNever die in the real world, lie in the real world\nEverything ain't what it seems\nWhen you following your dream\nFuck a nine to five, I'm too alive for the real world\nNever die in the real world, lie in the real world\nEverything ain't what it seem\nWhen you following your motherfucking dreams, yeah\n\n[Interlude: Richard Pryor (Sampled)]\nYou know it's funny doe, man, white people be frontin'\nAnd you ever noticed like you'd be the only nigga some place\nAnd you go where white people, they be like:\n\"You wanna move out of the way fellas? Excuse me, thank you very much - taking up all the fucking area, Jesus Christ!\"\nI love when white dudes get mad and cuss\n'Cause you all are some funny motherfuckers when you cuss!\nThey be saying shit like \"Alright, cut the shit! Fucking jerk off!\"\n\n[Chorus]\nFuck a nine to five, I'm too alive for the real world\nNever die in the real world, lie in the real world\nEverything ain't what it seems\nWhen you following your dream\nFuck a nine to five, I'm too alive for the real world\nNever die in the real world, lie in the real world\nEverything ain't what it seem\nWhen you following your motherfucking dreams, yeah", "image": "https://images.genius.com/da76d57af3e6ee702af91bac2a18326a.1000x1000x1.jpg"}], "artist": "Logic"}