{"songs": [{"title": "All for Love", "album": "Still Blowin’", "year": null, "lyrics": "[Intro]\nI give a little... I take a little\nI give a little, I take a little\n\n[Too $hort]\nI can't be sober, cause I smoke weed a lot\nTried to be faithful, but I like to cheat a lot\nYou couldn't even trust me, cause I used to lie sometimes\nI'll say I love you, but not until I get mines\nI tried to have one girl but I flirt too much\nI know exactly what to do to get her to fuck\nBaby I promise, you're the only one for me\nYou know you want this, you always have fun with me\nBut not tomorrow, cause I got another date\nIf all the little girls, would just do what their mothers say\nI wouldn't be a player, and shoot 'em with the facial cream\nI used to manage my love like a baseball team\nI had to have a good line-up\nPut 'em in rotation when they sign up, a whole lot of vagina\nI even had a farm camp, where they'd get upgraded later\nCan you hang with the players if you make it to the majors?\n\n[Chorus]\nI give a little... I take a little\nI give a little... we do it all for looooooove\nI do it all for looooove\n\n[Too $hort]\nCan I change? Or will I stay the same?\nWill I be serious or keep playin games?\nTonight, I'm tryin to see the light\nIs there a woman in here that wants to be my wife?\nI want a family, I got a lot to give\nI want children, but I ain't got no kids\nI wanna love you, but did I wait too long\nIt took smiles and tears to make this song\n\n[Chorus]\n[Silk E]\nHere's why we don't hear shit while y'all pleadin your case\nYour fingers crossed behind your back and a smirk's on your face\nWith million dollar dreams fallin in and out of your neck\nWhat'chu want us to do, we girls, we ain't playin with a full deck\nWe expect some of the bullshit, so we play along\nIt's wrong, the game of cat and mouse, you hit and you gone\nNow we 'sposed to feel sorry for the big bad wolf\nFind him fuck him with no condoms - the game come from the crooks\nHow would it look? A queen gettin played by a rook'\nBe your baby momma by evenin, can't have that on the books\nDickmatized, with sex faces in the d-boy stance\nEffervescently sellin me dreams of circumstance\nHow I need to be a team player - I'd rather be the owner\nWhy get with bein a boss to be some work on the corner?\nYou're huntin for the next hot ass before the club close\nHow you lookin for love if all you run with is hoes?\n\n[Chorus]\n[Outro]\nEnjoy the ride baby\nWe smokin good, we ridin clean\nAnd you in the mix wit'cha O.G. potnah Too $hort\nWe 'bout to get back on that pimp shit right now baby!\nStill blowin!", "image": "https://images.genius.com/cbce7a2bf9547c73552eb8d05ea5f8b2.700x700x1.jpg"}], "artist": "Too $hort"}