{"songs": [{"title": "My Darling", "album": "Relapse", "year": "2009-05-19", "lyrics": "[Verse 1: Eminem]\nYeah, look\nIf I were to rap about the crap that's out\nThat's the route you probably want me to take\n‘Cause you're just dyin' to know what I think\nHear my take on some other rappers\nIf I was to say somethin' about Paul Wall\nYou'd probably crap in your pants, ‘cause I'm white and he's white\nSo he's like my competition, I mean, right?\nNope! Paul Wall is dope, and so is Bubba\nSo b-b-b-b-b-b, but I don't compete with nobody\nI just go hard, do the rope-a-dope Ali shuffle\nAnd dance around my opponents, do donuts\nSometimes I play possum, like I'm asleep, it's awesome\nI'm like a sleepin' giant, and when I awake I'm like Dre\nI just jump from outta nowhere and bite prey\nAnd sink my teeth in 'em, and fill 'em\nFull of poison, and make a noise like a snake before I kill 'em\nAnd let 'em know that I just don't feel 'em\nAnd smack 'em with the backward E, the Eminem emblem\nI was taught if you gonna murder somebody you should face him\nTell him why, look him dead in the eye, then waste him\nAnd the dark shall emerge from the fiery depths of hell\nThen swallow the shell, all the hollow who dwell\nIn the shadows of all who are willing to sell their souls\nFor this rap game and it g-g-goes\nOne-two-three, chk-chk, one-two-three\nChk-chk, one-two-three, that ain't the hook, now follow me\nThere's nothing else for me to say, my public adores me\nEverybody bores me, they're just so corny\nSo at night before I sleep, I look in the mirror\nThe mirror grows lips and it whispers: \"Come nearer!\"\n\n[Chorus: Eminem]\nMy darling, I don't ever want you to leave me, my darling\nYou and me were meant to be together, my darling\nAnd if I cannot have you, no one can, you're my darling\n‘Cause I possess your soul, your mind, your heart and your body\nI don't ever want you to leave me, my darling\nYou and me were meant to be together, my darling\nAnd if I cannot have you, no one can, you're my darling\n‘Cause I possess your soul, your mind, your heart and your body\n\n[Verse 2: Eminem]\n\"Shady, I know you're in there somewhere, come here!\nTalk to me, sit! Here, pull up a chair!\nWhy don't you cut your hair?\nHa ha ha ha ha ha! Dye it back, come on, try it!\"\nAhh, no! I told you, leave me the fuck alone, will you?\n\"But I'm here to rebuild you,\" — but I already killed you!\n\"But Shady, we were meant for each other\nThink about your mother,\" — yeah, so what of her?\n\"You think about what she did to you and your little brother\nAll them foster homes,\" — fuck you, motherfucker!\nI had you beat! — \"No, I was playin' possum\nRemember? I let you watch your little girls blossom\nI gave you enough time, your soul's mine\nI'm taking it back,\" — you fuckin' bitch, why?!\n\"Because I love you, look a little closer\nIsn't that us on that poster? Ha-ha-ha-ha!\"\n\n[Chorus: Eminem]\nMy darling, I don't ever want you to leave me, my darling\nYou and me were meant to be together, my darling\nAnd if I cannot have you, no one can, you're my darling\n‘Cause I possess your soul, your mind, your heart and your body\nI don't ever want you to leave me, my darling\nYou and me were meant to be together, my darling\nAnd if I cannot have you, no one can, you're my darling\n‘Cause I possess your soul, your mind, your heart and your body\n\n[Verse 3: Eminem & Dr. Dre]\n\"Shady, listen! (Shady!) You hear that?\nThey're screaming for you, I can bring your career back!\"\nBut I don't want it back — \"Yes, you do,\" — no, I don't\n\"Yes, you do! You're gonna regret it later,\" — no, I won't\n\"I'ma get Dre on the phone, I'll just call the Doctor\"\nGo ahead, I already talked to Dre yesterday\n\"Well, I got him on the phone right now!\"\n(Slim!) You're lying! (Yo, Slim!) How, why now?\nWhat up, Dre? (Check this out, Slim, I gotta talk to you\nI don't know, it just seems like ever since you got off your\nDrugs you became a lot softer)\nBut Dre, all that Shady is, is a bottle of hair bleach and vodka\n(Well, just think about it, Slim, I'm here\nJust hit me back and let me know what's up) — fuck this mirror!\n\"I'm not in the mirror, I'm inside you\nLet me guide you,\" — fuck you! Die, you son of a bitch!\n\"Put the gun down!\" — bye-bye! Boom!\nOkay, I'm still alive, — \"So am I too!\nYou can't kill a spirit even if you tried to\nHa-ha, you sold your soul to me, need I remind you?\nYou remember that night you prayed to God\nYou'd give anything to get a record deal? Well, Dre signed you\nThis is what you wanted your whole life, Marshall, right? Ooh\nLook at this house, look at these cars: they're so nice, woo!\nOh, but you didn't know fame has a price too?\nThat you just now seeing the downside to\nLose your best friend from high school, your wife too\nAin't even sure if your kids like you\nCome off tour, can't even sleep at night without NyQuil\nBecome a Valium addict, start a rehab cycle\nBut together we can break the cycle\nMarshall…\" — What?! — \"No one's gonna love you like I do.\"\n*Chainsaw starting up*\n\n[Chorus: Eminem]\nMy darling, I don't ever want you to leave me, my darling\nYou and me were meant to be together, my darling\nAnd if I cannot have you no one can, you're my darling\n‘Cause I possess your soul, your mind, your heart and your body\nI don't ever want you to leave me, my darling\nYou and me were meant to be together, my darling\nAnd if I cannot have you no one can, you're my darling\n‘Cause I possess your soul, your mind, your heart and your body\n(Sayin') I don't ever want you to leave me, my darling\nYou and me were meant to be together, my darling\nAnd if I cannot have you no one can, you're my darling\n‘Cause I possess your soul, your mind, your heart and your body (your body, your body, your body, your body)", "image": "https://images.genius.com/280d45965a412d7e2a115e2db61d79f2.1000x1000x1.jpg"}], "artist": "Eminem"}