{"songs": [{"title": "4 Da Fam", "album": null, "year": null, "lyrics": "[Intro Jadakiss - Styles P]\nYeah niggas\nAyo ?? I ain't gonna sit over here and lie and say I'm finished with the album\n'Cause if anybody know I ain't finished with the album..you know I ain't finished\nBut niggas say \"yo you gotta do a mixtape son!\"\nNiggas hitting me, texting me, emailing\nI'm like \"for what?\"\nGo in son!\n\n[Verse Jadakiss]\nYo the game's getting old, shorty's going up top\nComing home, a little bigger with waves and paroles\nDope's in the hole, the fiends all lined up\nEverybody trés pound down and nine'd up\nMoney short? No telling where you could wind up\nGangs in new York, a lot of soft niggas signed up\nNothing like the feeling you get, when you bust the K\nI can do back to back bullets, won't touch a tray\nMe Gus and K, rude pimping\nAnd a big shipment of something that taste different\nHollow tips turn grown men back into infants\nTwo trap houses, Greensboro and Winston\nSome is behind a wall, other niggas is fenced in\nCouple of em just touched down that just did ten\nCut ain't bad enough for staples you get stitched in\nLucky that the doctor was even able to fix him\nYeah...What the fuck did you tell me?\nRed and green stripe on the capital LV\nIf I don't make it all that means is I failed me\nSo either I make a hit record or sell D\nI'm tryna do both\nBars, top of the line, 'bout a nine or the dope\nBalcony, looking at your mind through the scope\nDevil telling me \"do it\"but the angels saying \"no\"\nMade it out the jail, you lucky nobody cut you\nYou going to the hole, screaming and nobody touch you\nLooking for the foul, and that's where the trouble 's at\nSay death comes in threes, but I can double that\nAny narcotic in the world, I can bubble that\nInfatuated with the drug game, but in love with rap\nCocaine in my DNA... and my blood is E & J\nRather see em bleed then to see em paid\nD-Block nigga we don't play!", "image": "https://images.genius.com/34d1815281afeb502b98075367058136.453x453x1.jpg"}], "artist": "Jadakiss"}