{"songs": [{"title": "Rob All Night (If I’m Gonna Rob)", "album": "Grand Champ", "year": "2003-09-16", "lyrics": "[Hook: repeat 2X]\nIf I'm gonna rob, I'mma rob all night (yeah!)\nIf I'm lookin' for something' then it's probly a fight\nIf I'm gonna fuck bitches then they better be tight\nIf that's dead, then the head better be right (C'mon)\n\n[Verse 1]\nHere we go again, fucking right\nDark Man X baby, dog for life\nKnow how this shit go, built off fights\nBitch dog be like \"AIGH, AIGH, AIGH\"\nOOH, this rap shit be getting kinda hectic\nIt's not a game nigga, cats don't respect it\nReal shit's been neglected for far too long\nLet's get it on!\nI jump off slugs like packages from UPS\nBut you run when you see X\nPull out the front when you see Tex\nPOW, the light is what you see next\nFuck who you listenin' to, I'm the badest\n98% of this industry is faggots\nDue alone niggas don't want no static\nWhent hey say who shot J R it won't be Dallas\n\n[Hook]\n\n[Verse 2]\nY'all niggas don't know how the dog livin'\nNo matter what I do I keep on winnin'\nCan't stop me now. It's just the beginning'\nGon' be there 'till the endin'\nIn 2005 you won't know\nStop, drop, open up shot, let 'em go\nHit 'em with the same flow I hit 'em with before\nThis time I'm goin' around the back door\nGot me like \"GOD!\" you niggas is stupid\nGet the drum crack 4 bars, horn then loop it\nSame shit that you did to me, took what you did\nGot niggas movin', but not institution\nDog done did it again, uh uh (WHAT?)\nDog is in it to win, uh huh (WHAT?)\nDog did a nigga and then, uh huh (WHAT?)\nYou thought dog was afraid? Nah ah (Come on)\n\n[Hook]\n\n[Verse 3]\nMy niggas, some niggas you don't wanna try\nBut then again, I be that one to bust a nigga in his eye\nI don't give a fuck bitch all my niggas ready to die\nHit you with the things so you niggas ready to fly\nYou don't want no more\nBring all ya got to even the score\nE5 is HOT? You want more?\nYou really don't know what you're askin' for\nListen old man, don't do that\nWe all dogs over here, don't act like a cat\nWe like, touch balls, round table with a bat\nStart with the cheers, \"Crack, crack, crack!\"\n\n[Hook]", "image": "https://images.genius.com/e730418bfaada4fc845d1179160af643.999x999x1.jpg"}], "artist": "DMX"}