{"songs": [{"title": "M.A.C.A.", "album": "Make America Crip Again - EP", "year": "2017-10-19", "lyrics": "[Intro Skit]\n'Cause I'ma keep it G real. I don't fuck with you, cuz\nYou disrespected me. You disrespect my hood by telling me\nTake off my flag, asking how gangster I was, nigga\nYou lucky on that day I was acting cool, cuz\nI told you I ain't got time for that, but nigga, today I got time, cuz\n\n(\"You know what? We likes to party...We likes to party\nWe likes to party\nWe don't cause trouble, we don't bother nobody...\")\n\n[Hook]\nAy young world, the world is yours\nAy young world, the world is yours\nYoung world, young world\nThe world is yours\nYoung world, the world is yours\nThe world is yours\nThe world is yours\nThe world is yours\n\n[Pre-Verse: Snoop Dogg]\nThe president say he wants to Make America Great Again\nFuck that shit, we gon' Make America Crip Again, cuz\n\n[Verse 1: Snoop Dogg]\nAs I look around I see so many millionaires\nWith skin like mine, don't pretend like I'm\nWith that bullshit, your president been tweeting\nThem black boys is balling out, the whole block been eating\nYou punk pigs we calling out\nI'ma line y'all on up\nThen start my own league, I'ma sign y'all on up\nI'm thinking who my heroes be, thank God for the Negro League\nColin Kaepernick was blackballed, ah, nigga, please\nThis still America with three K's, believe that shit\nThe world is yours my nigga, so go and see that bitch\nEvery chance you get hit that lick and get that shit\nPut your name down and your thang down\nWe gon' Make America Crip Again\n\n[Hook]\nAy young world, the world is yours\nAy young world, the world is yours\nYoung world, young world\nThe world is yours\nYoung world, the world is yours\nThe world is yours\nThe world is yours\nThe world is yours\n\n[Verse 2: Snoop Dogg]\nDon't ya look strange?\nHaving all that power but you won't make change\nBut don't trip we Crip and we gang up too\nAnd if I do a count, I'm sure we got more guns than you\nNow just imagine if we stop shooting our own kind\nI'm a Crip with no color lines, that mean I'm colorblind\nI learned that, turnt that, Willie Lynch, burnt that\nG status earned that\nNow that I'm your OG, it's my job to teach you\nShow you, look out, reach you\nEvery chance you get hit that lick and get that shit\nAnd put your name down and your thang down\nWe gon' Make America Crip Again\n\n[Hook]\nAy young world, the world is yours\nAy young world, the world is yours\nYoung world, young world\nThe world is yours\nYoung world, the world is yours\nThe world is yours\nThe world is yours\nThe world is yours\n\n[Outro]\n(\"You know what? We like to party\nWe like to party...We like to party\nYou know what? Yo, peep this, we like to party\")", "image": "https://images.genius.com/922ec31d9fecb22a0842e9ee65d6ee7c.637x637x1.jpg"}], "artist": "Snoop Dogg"}