{"songs": [{"title": "Letz Get It On (Ready 2 Rumble)", "album": null, "year": "1996-09-07", "lyrics": "[Intro]\nYes lord, yes lord\nDeath Row said so\nAll hail, all hail\nOutlawz\nLet's get ready to rumble\nLet's get ready to rumble\nHAHAHAHA\nYeah!\nThrow ya hands up!\nThrow ya hands up!\nThrow ya hands up!\nIn this corner\nThe ghetto gladiator\nIron Mike Tyson\nNever been defeated\nCan't keep a good man down!\nAnd in this corner riding with him\nHa Ha\n\n[Verse 1]\nAll they see is black venom, then my silhouette\nJust watch the fear reappear in they eyes when I hit the set\nOh no, 2Pac wit' team Tyson, Seldon was seldom seen\nIron Mike cut his head like a guillotine\nTime for some action, you're makin' me high, like Toni Braxton\nBustas switching like Dennis Rodman, we still mashin'\nI put my hand up to God, life is hard, filled with stress\nThrowing blows in this square, circle to see who's best\nMike don't hurt 'em! What they scream, wait! What they mean?\nTyson put in work, his head touched the whole Colosseum\nBetter act up when I see him, we loud in the front row\nHype up the crowd if you don't like it, what you come for?\nAll hail, to fortified to fail\nThe Bed-Stuy ass kicker, split the water like a sharks tail\nStill strugglin', may god help me bubble\nHit the ring, do my thing, all opposed feel trouble\nGet it on!\n\n[Hook]\nLet's get ready to rumble\nHaha, let's do this (yea)\nLet's get ready to rumble (you know)\nLet's get it on\nThrow ya hands up, throw ya hands up\nWhere they at? Where they at?\n\n[Verse 2]\nRound 2\nRight, left then left, right I seen him stutter WHAT?\nHe didn't duck and got stuck wit' yo' uppercut!\nNow hear the crowd screaming, It's like they fiendin'\nOh, don't you love how that black man swing?\nWe keep it real, tell Holyfield, he next in line\nSo get his heart problem checked 'fore he steps to mine\nAnd Seldon, I hardly know ya, don't bother me to show ya\nLet ya head get gassed by that fast promoter\nBe real forever, so feel my leather in combinations\nConnecting like dot to dot in steady formations\nSwift and deadly, 'cause this be deathly\nI'm a soldier, it's too late now, I tried to told ya\nGet it on!\n\n[Ad-libs + Hook]\nLet's get ready to rumble\nYES! YES! (huhu)\nLet's get it on\nAight this ain't goin' last long, y'all know how Tyson do it\nSo what, we gon' wipe beat this boy silly (hehhe)\nAnd then we go all, go party at 66 deuce mob style\nSo Tyson do ya thang boy... do ya thang\nLet's get it on now (so whatcha want?)\nYes, let's get it on (whatcha want, now?)\nLet's get ready to rumble!! (whatcha want?)\nLet's get it on now (UH, whatcha want, now?)\nYes, let's get it on (so whatcha want?)\nYes, let's get it on (so whatcha want, now?)\nLet's get ready to rumble!!! (whatcha want, now?)\nWhere ya at? Where ya at? Where ya at, now?\nWhere ya at? Where ya at? Where ya at, now?\nWhere ya at? Where ya at? Where ya at, now?\nHey Holyfield, you next! HA\nWhere ya at? Where ya at? Where ya at, now?\nWhere ya at? Where ya at? Where ya at, now?\nWhere ya at? Where ya at? Where ya at, now? (YO!)\nHey Holyfield, (HEY HEY) you next!\nHAHA\nWhere ya at?\nYeah, Iron Mike Tyson, team Tyson of theme song haha\nBy the thug you loved 'day\n2Pacalypse now, Makaveli The Don\nOutlawz, Death Row, Westside 'til we die\nIt don't stop hahaha\nIt's going down nigga", "image": "https://images.genius.com/1a9f617a9e716a695608c2cde8ffd345.1000x562x1.jpg"}], "artist": "2Pac"}