{"songs": [{"title": "Back Story", "album": null, "year": "2016-09-01", "lyrics": "[Verse 1: Rick Ross]\nGotta let it breathe\nPut the weed out\nDouble M\nNiggas' get it and they fall off\nIt's cause they all soft\nNigga like me started at the car wash\n8am to 10pm, that's on the rainy day\nWise words from dope boys meant everything\nThey say it's levels to the street life\nThen I seen a bezel with that pink ice\nAll natural, momma tell you to be careful\nIn the trap trapping to increase capital\nNo longer cruising with the windows down\nHand on the pistol anticipating the riddle sound\nI'm Kanye when it came to yay\nI'm Jay-Z when it came to keys\nI'm Snoop when it came to weed\nSo now they wanna Biggie me\nAs the credit rolls, now the charge is federal\nMoney bags, I'm placed upon a pedestal\nStill on the block in my Reeboks\nYou ain't even know these was the Basquiat's\nYou ain't really know who really call shots\nWorldwide mastermind, number one all charts\n\n[Verse 2: Skyy Frost]\nLast time I checked, I only had three choices\nIn the hood, locked up, or in a casket full of roses\nNo way to make it out\nSeen a few go the college route\nBut the bills start piling, and they always end up dropping out\nLets just say, Imma different breed\nOnly mission to succeed\nNever stood on the corner slanging keys\nI had dreams of making it big and never lost hope\nI knew I could still reach success without selling dope\nAppreciate the opportunities y’all take for granted\nAll the times y’all don’t feel like working, I’m taking advantage\nMaking sure I’ll never end up stranded, empty-handed\nOnly focused on money.  To me it’s so romantic\nThey used to laugh when I had three jobs at 18\nAct like I was crazy; only focus was making green\nNow I can hold our whole class reunion at my house\nLaugh now.  Word to Ross.  Feel like the biggest boss\n\n[Verse 3: Nipsey Hussle]\nWatch us ball\nStop a star, nigga not at all\nI'm poppin' broads with Tiny Hog at the shoppin' mall\nAll money in the squad, boy I'm not involved\nCan't pay the cost to floss? I can spot your flaws\nSLs with the toppin' off\nDress well when it's time to ball\nCouple hundred for my boxer drawers\nYoung nigga used to shop at Ross\nFirst to shoot when it's poppin' off\nCouple times, a nigga almost got popped by Ross\nCrash unit, buzz cut, ex-marines\nCrenshaw, Slauson Ave 17\nInfant Stone, Lil' Shady, Baby Buke to fast light a demonstration\n85 Cutlass with the 380s\nSummertime functions, L.A. streets' crazy\nShoot it out' that's what this crew about\nHangin' out the Cutlass window with the Rugar out\nProve yourself, killers in pursuit of clout\nIt felt wrong, but who is you to doubt\nLook, my master plan was buy a pound and then move it south\nAnd hopefully one day I'll put this music out\nTrippin' now, seeing that it's moving out\nI'm buying spots, nigga moving out\nMy fan base, I see 'em moving south\nI'm overseas eating fucking croûte\nYeah. So I can tell you what this hustling 'bout\nI couldn't tell you what no luck about\nI had maps on my wall, nigga\nDope sacks in my drawers, nigga\nLook, a lot of stress I couldn't rest not at all\nNigga risking everything trynna ball", "image": "https://images.genius.com/3dce21029cdd8aab73eb473e015807d5.1000x1000x1.jpg"}], "artist": "Rick Ross"}