{"songs": [{"title": "Listen!!!", "album": "Eardrum", "year": "2007-08-21", "lyrics": "[Intro]\nThis the year of the BlackSmith\nTalib Kweli, Kwame, let's go\nYeah, niggas don't listen\nBack in the days we all used to listen\nNow shit is so wack, nobody listen\nTo that real hip hop, yo, listen\n\n[Hook]\nLadies and gentlemen, get ready, here I come\nTalib Kweli and I'm bangin' on ya eardrum\nSomething I wanna tell you\nNow lemme get up in it, wait, wait, wait, wait\n\n[Verse 1]\nFriends, Romans, Countrymen, lend me ya ears\nStart repentin' cause the ending is near\nBut don't panic, you can't function if you livin' in fear\nPay attention, you gotta listen to hear\n(Wait just a minute), who the fuck you think talkin' to?\nPut you on hold, get a specialist to walk you through\nKweli, the flow captain of fast and slow rappin'\nI'm so crackin', you ain't heard? Ya shit appear like closed captions\nKing of the bars and I'm goin' hard, pause\nAll my confidence comes from knowin' God's Laws\nBangin' on the system, fightin' my kinda war\nLoud as a whisper, quiet as a lion's roar\n\n[Hook]\nLadies and gentlemen, get ready, here I come\nTalib Kweli and I'm bangin' on ya eardrum\n(Something I wanna tell you)\nNow lemme get up in it, it's for ya spirit so\nBut y'all hear me though\nGet up, get into it and get involved\nThere's a little something that I wanna spit for y'all\n(Something I wanna tell you)\nNow lemme get up in it, wait, wait, wait, wait\n\n[Verse 2]\nGet it now, get it fast, get it right\nGet it big, get it locked, get it done, get it tight\n(I think I wanna feel you)\nBut you don't really hear me though\nI spit clearly so it's live outcha stereo\nTo your heart while it's beatin' in ya chest\nWhen you speakin' to execs and they see behind the desk\nTo ya spirit, nothing weaker than the flesh\nSo while you try to keep it fresh, you gettin' deeper into debt\nReal hip hop is missin' from the shelf\nYup, it's what you felt when you listen to yaself\nOnly a few is makin' cuts that's spinnin'\nSo before you spend ya hard earned spinach\n\n[Hook]\nLadies and gentlemen, get ready, here I come\nTalib Kweli and I'm bangin' on ya eardrum\n(Something I wanna tell you)\nNow lemme get up in it, it's for ya spirit so\nBut y'all hear me though\nGet up, get into it and get involved\nThere's a little something that I wanna spit for y'all\n(Something I wanna tell you)\nNow lemme get up in it, wait, wait, wait, wait\n\n[Verse 3]\nYou love the sounds comin' out your speaker\nI spit rounds like a nine millimeter\nThe youth today, they frown at the teachers\nThey ain't down with no leaders\nThey don't wanna wait (just a minute)\nThey like, \"What? Nigga, wait right there\"\nI got 'Reservoir Dogs', you'll be missin' a right ear\nGet it clear, I figure it's my year\nI'm everywhere, makin' appearances in nigga's nightmares\nHear the word, peep the flow, check the cadence\nWhat you heard as a pro, I'm so amazing\nDon't front, girl, you know it's ya favorite\nNew Kweli, yo, they runnin' out of patience\n\n[Hook]\nLadies and gentlemen, get ready, here I come\nTalib Kweli and I'm bangin' on ya eardrum\n(Something I wanna tell you)\nNow lemme get up in it, it's for ya spirit so\nBut y'all hear me though\nGet up, get into it and get involved\nThere's a little something that I wanna spit for y'all\n(Something I wanna tell you)\nNow lemme get up in it, wait, wait, wait, wait\n\nYo, don't it sound so good to you?\nIt's the return of the greatest, y'all\nTalib Kweli, BKMC\nBlackSmith is the movement, BlackSmith is the music\nWhatchu ridin' for?\nWhatchu livin' for?\nWhatchu dyin' for?\n(I think I wanna feel you)\nBangin' on ya eardrum, yeah\n\nWait now, wait now, wait now for a minute\nListen\nWait now, wait now, wait now for a minute", "image": "https://images.genius.com/36dc52e92a9d27102149cf08b1a7f326.936x936x1.jpg"}], "artist": "Talib Kweli"}