{"songs": [{"title": "Breaker, Breaker", "album": "Beneath the Surface", "year": "1999-06-29", "lyrics": "[Chorus: GZA]\nBreaker, breaker one nine, clear the line\nCan you read me? Shortage on rhymes\nMCs should expect the worst\nI stay alert and shoot first\n\n[Verse 1: GZA]\nThis is not a test, it's difficulty\nPicture closely, the ignorant mostly\nBlind, deaf, dumb, your mind left numb\nLost soul who failed to hear the roll of the drum\nIn the bottom of your bomb shelter, still felt the\nHeavy blast that blew off the masks of twelve welders\nThe math of an elder, praise the Lord, thank you Genius\nOperation: Project English\nCommander the chief of flight style, check the aircraft\nGlide like the Frisbee, Digi they Disney\nTo check fault in oneself is pure loveliness\nYou break the mirror that remind you of your ugliness\nSo when I bust, no one is untouched\nSome returning with the mic clutched, like such\nWho plan but never execute. He had the heat in his\nHand, but yo he didn't shoot, therefore\nYour mechanism of material better be sickly\nOr let your lead spread incredibly quickly\nI move bravely, travellin' on a horse\nOn the battlefield, surrounded by the lost\nOf those who plotted with the brains of animals\nMy high molecular structure be untangible\nThe name ring a bell, killable two syllable\nThe Wu is comin' through, the outcome is critical\nTo be blunt, the beat was cooked up like coke goods\nThe rhyme first came to me in the oak woods\nUp to no good, rap icon\nMilk the industry like the Wall Street junk bond\nYou see the bright stone, I got your height sewn\nDirect current, that move through the mic-phone\nKey contributor, well-known major factor\nRhyme distributor, the drive of a tractor\nWho run ya down if you don't move or wanna linger\nLinger, linger, linger, linger\n\n[Chorus]\nBreaker, breaker one nine, clear the line\nCan you read me? Shortage on rhymes\nMCs should expect the worst\nI stay alert and shoot first\nBreaker, breaker one nine, clear the line\nCan you read me? Shortage on rhymes\nMCs should expect the worst\nI stay alert and shoot first\n\n[Verse 2: GZA]\nThe immortality of my fame is the measure of other's torture\nBurnt offer, from a flamin' author\nThe falconer who flies enough birds for the chase\nStrictly excel in what is excellence with grace\nThe significance was not the vulgar applause of interest\nBut the feelin' that exit, completion of a sentence\nWith age and experience, my reason ripens\nI strike on you Vikings, slash like a hyphen\nIf you enter the house of fortune by the gate of pleasure\nYou will leave by sorrow, the flow measures\nEverything fails with the unfortunate\nLearned that recordin' it, so my mind broaden it\nTrack records ranks us with the exceptional\nExtreme complex physics, high technical\nThe truth is usually seen and rarely heard\nWhat's more dangerous than hatred is the word\nYou wild cards, jack of all trades\nThose who parade their positions show their spades\nA large flock of MCs, they figure to be taught\nIt ain't hard to see why I'm vigorously sought\n\n[Chorus]\nBreaker, breaker one nine, clear the line\nCan you read me? Shortage on rhymes\nMCs should expect the worst\nI stay alert and shoot first\nBreaker, breaker one nine, clear the line\nCan you read me? Shortage on rhymes\nMCs should expect the worst\nI stay alert and shoot first\n\n[Outro: GZA]\nBreaker, breaker one nine\nBreaker, breaker one nine", "image": "https://images.genius.com/bdda24520e7142d4154c6549b6d2d517.820x820x1.jpg"}], "artist": "GZA"}