{"songs": [{"title": "Don’t Cha", "album": null, "year": null, "lyrics": "[Busta Rhymes]\nOK\nYeah\nOh, we about to get it just a lil hot and sweaty in this mu'fucka (oh, baby)\nLadies let's go\nSoldiers let's go (Dolls)\nLet me talk to y'all and just you know give you a little situation\nListen (fellas)\n\n[Busta Rhymes]\nYou see this shit get hot\nEvery time I come through\nWhen I step up in the spot (are you ready?)\nMake the place sizzle like a summertime cookout\nProwl for the best chick, yes I'm on the lookout (let's dance)\nSlow banging shorty like a belly dancer with it\nSmell good, pretty skin, so gangsta with it (oh, baby)\nNo tricks only diamonds under my sleeve\nGimme the number, but make sure you call before you leave\n\n[Pussycat Dolls]\nI know you like me (I know you like me)\nI know you do (I know you do)\nThat's why whenever I come around\nShe's all over you\nAnd I know you want it (I know you want it)\nIt's easy to see (it's easy to see)\nAnd in the back of your mind I know\nYou should be on with me\nDon't cha wish your girlfriend was hot like me?\nDon't cha wish your girlfriend was a freak like me?\nDon't cha?\nDon't cha?\nDon't cha wish your girlfriend was raw like me?\nDon't cha wish your girlfriend was fun like me?\nDon't cha?\nDon't cha?\n\n[Pussycat Dolls]\nFight the feeling (fight the feeling)\nLeave it alone (leave it alone)\n'Cause if it ain't love\nIt just ain't enough to leave my happy home\nLet's keep it friendly (let's keep it friendly)\nYou have to play fair (you have to play fair)\nSee I don't care\nBut I know she ain't gonna wanna share\nDon't cha wish your girlfriend was hot like me?\nDon't cha wish your girlfriend was a freak like me? (like me)\nDon't cha?\nDon't cha baby? Don't cha?\nAlright, sing\nDon't cha wish your girlfriend was raw like me? (Raw)\nDon't cha wish your girlfriend was fun like me? (Big fun)\nDon't cha?\n\n[Busta Rhymes]\nOk, I see how it's goin' down (ahh, don't cha)\nSeems like shorty wanna little menage pop off or something (let's go)\nWell let me get straight to it\nEvery broad wan watch a nigga when I come through it\nIt's the god almighty, looking all brand new\nIf shorty wanna jump in my ass then vanquish\nLooking at me all like she really wanna do it\nTryna put it on me till my balls black an blueish\nYa wanna play wit ah playa girl then play on\nStrip out the Chanel and leave the lingerie on\nWatch me and I'mma watch you at the same time\nLooking at ya wan break my back\nYou're the very reason why I keep a pack ah the Magnum\nAn wit the wagon hit chu in the back of tha magnum\nFor the record, don't think it was something you did\nShorty all on me 'cause it's hard to resist the kid\nI got a idea that's dope for y'all\nAs y'all could get so I could hit the both of y'all\n\n[Pussycat Dolls]\nSee I know she loves you (I know she loves you)\nI understand (I understand)\nI'd probably be just as crazy about you\nIf you were my own man\nMaybe next lifetime (maybe next lifetime)\nPossibly (possibly)\nUntil then old friend your secret is safe with me\nDon't cha wish your girlfriend was hot like me?\nDon't cha wish your girlfriend was a freak like me? (Like me)\nDon't cha?\nDon't cha baby? Don't cha?\nAlright, sing\nDon't cha wish your girlfriend was raw like me? (Raw)\nDon't cha wish your girlfriend was fun like me? (Big fun)\nDon't cha?\nDon't cha?", "image": "https://images.genius.com/54314abfbbbf16253d72455428cc44e6.834x834x1.jpg"}], "artist": "Busta Rhymes"}