{"songs": [{"title": "Back on My Grizzy", "album": "Da Drought 3", "year": "2007-04-13", "lyrics": "[Intro]\nYeah, Drought 3, yeah\nBitch I'm back on my grizzy, Young Money, where you at?\nTwo tables and a mic, tell the DJ run it back\nBitch I'm back on my grizzy, Young Money, where you at?\nTwo tables and a mic, tell the DJ run it back, bi- bi- bi-\nYou ready now?\nCut me up G, cut the music up baby\nYeah, I'm going in\n\n[Verse 1: Lil Wayne]\nBitch I'm back on my grizzy, Young Money where you at?\nIf you fuck with Young Money, Young Money where you at?\nLike the Energizer Bunny with a battery pack\nBoy that chopper keep drumming like brrrat-at-at-tat\nOr pa-rum-pa-pum-pum, and I'm so young\nBut I'm a giant, like \"Fe-Fi-Fo-Fum\"\nJust bought a new crib inside Sodom\nGot some money put away in case the hurricane come\nI'm a fucking shame, huh? Yeah I know, yeah I know\nI go out the country to get all my clothes and my hoes\nI go out my way just to get my dro and my dough\n'Cause I love it more than I love my hoes, yes I does\nI got gasoline coming out my pores, I'm a torch\nI got glasses like that white boy Scott Storch, and a Porsche\nI got license for the scorch, snipers at your porch\nRifles by the forts and we shoot up courts\nThe judge just a bitch, the jury suck dick\nI'm an Eastside Blood and I don't smoke that Crip\nI smoke that Kush, first name Bubba\nFirst name Young, last name Stunna\nCarter in the office, take notes when I'm talking\nSmooth as a cruise boat floats when I'm walking\nI boast cause I'm balling, I'm supposed to be balling\nWhen I'm on the phone with bitches, man, the money keep calling\nYou ain't satisfied 'til your son'll be calling\nTelling you where to leave the money in the morning\nOK, you want a zombie movie instead\nThat's when you walk in your house and everybody dead\nYeah, I could take a shit where I stand, where I stand\nAnd watch you pussies piss in your pants\nYou ain't a man, you're a ho, I could kill him with the flow\nAnd then play the guitar at the fucking funeral\nBig guns so they drinking big shots\nAnd my gang go Saddam Hussein and missile launch\nThe Korean call me Wayne Chang, now listen ma\nI don't know karate, but after the brain, I'll kick you out\nYou niggas suck like Tony Romo, no homo\nAnd I'm all about my money, I get paid for promo\nYeah, I'm the man in this bitch\nThey say money talks, well I'm the ventriloquist\nAnd if I ever jump, I'll probably land in your bitch\nBoy that ho colder than my hand and my wrist\nBoy I'm more cooler than a fan and a mint\nAnd when I'm done this track will need a couple bandages\nI be with savages and I'm above average\nI'm a crazy ass star like a fucking asterisk\nYou niggas can't see me, I'm on my Casper shit\nRunnin' so much game, I'll fuck around and lap a bitch\nThe club like a grocery, I just bag a bitch\nAnd you know I'm gonna score like Deion after picks\nI'm rollin' on a pill, she get that morning after dick\nAnd when my roll came down, guess what I did after it?\nI pop-popped, and took some Patron shots\nI pop-popped, and took some Grey Goose shots\nI pop-popped, yeah\nYoung Money, bitch and if you niggas wanna do it\nWe chop-chop, and leave your back on the block\nWe pop cops, and ain't no rats on my block, I got shop\nI got that dro, I got them pills, I got that yay\nGive it to them hoes and watch them bitches freak away\n\n[Outro]\nYoung Money, bitch\nDrought 3, in ya neck, pussy\nIt's like a Adam's apple, nigga\nWeezy Baby, the God, Amen, gone", "image": "https://images.rapgenius.com/3c7ad99895d80e7af6a13e7a68557365.1000x1000x1.jpg"}], "artist": "Lil Wayne"}