{"songs": [{"title": "Family Business", "album": "The College Dropout", "year": "2004-02-10", "lyrics": "[Intro]\nHow's your son? (all the things)\nHe made the team this year? (all, all, all the things things)\nAight, they said he wasn't tall enough\n(...all all that glitters is not gold\nAnd all gold is not reality\nReal is what you lays on me)\nMa we here we gon' cook this Sunday ok?\nThat's a new girlfriend?\n\n[Verse 1]\nThis is family business\nAnd this is for the family that can't be with us\nAnd this is for my cousin locked down, know the answer's in us\nThis why I spit it in my songs so sweet like a photo\nOf your granny's picture, now that you're gone, it hit us\nSuper hard on Thanksgiving and Christmas, this can't be right\nYeah you heard the track I did man, \"This Can't Be Life\"\nSomebody please say grace so I can save face\nAnd have a reason to cover my face\nI even made you a plate, soul food, know how Granny do it\nMonkey bread on the side, know how the family do it\nWhen I brought it why the guard have to look all through it?\nAs kids, we used to laugh\nWho knew that life would move this fast?\nWho knew I'd have to look at you through a glass?\nAnd look, you tell me you ain't did it then you ain't did it\nAnd if you did, then that's family business\n\n[Chorus]\nAnd I don't care 'bout\n(all the diamond rings all the diamond rings)\nThey don't mean a thing (all, all, all the things)\nAll these fancy things\nI tell you that all is my weight and gold\n(all that glitters is not gold, now gold is not reality)\nNow all I know I know all these things\n(real is what you lease on me)\n\n[Verse 2]\nThis is family business\nAnd this is for everybody standing with us\nCome on, let's take a family Grammy picture\nAbi, remember when they ain't believe in me?\nNow she like \"See, that's my cousin on TV!\"\nNow, we gettin' it and we gon' make it\nAnd they gon' hate it and I'm his favorite\nI can't deny it, I'm a straight rider\nBut when we get together be electric slidin'\nGrandma, get 'em shook up\nAw naw, don't open the photo book up\nI got an Aunt Ruth that can't remember your name\nBut I bet them Polaroids'll send her down memory lane\nYou know that one auntie, you don't mean to be rude\nBut every holiday nobody eating her food\nAnd you don't wanna stay there cause them your worst cousins\nGot roaches at their crib like them your first cousins\nAct like you ain't took a bath with your cousins\nFit 3 in the bed if it's 6 of y'all\nI'm talkin' 'bout three by the head and three by the leg\nBut you ain't have to tell my girl I used to pee in the bed\n\n[Bridge]\nRain, rain, rain go away\nLet the sun come out and all the children say\nRain, rain, rain go away\nLet the sun come out and all the children say\n\n[Verse 3]\nI woke up early this morning with a new state of mind\nA creative way to rhyme without using knives and guns\nKeep your nose out the sky, keep your heart to God\nAnd keep your face to the risin' sun\nAll my niggas from the Chi, that's my family, dog\nAnd my niggas ain't my guys, they my family, dog\nI feel like one day you'll understand me, dog\nYou can still love your man and be manly, dog\nYou ain't got to get heated at every house warmin'\nSittin' here, grillin' people like George Foreman\nWhy Uncle Ray and Aunt Shiela always performin'?\nThe second she storm out then he storm in\nY'all gon' sit down, have a good time this reunion\nAnd drink some wine like Communion\nAnd act like everything fine and if it isn't\nWe ain't letting everybody in our family business, uh\n\n[Chorus]\n(All all all the diamond rings diamond rings)\nThey don't mean a thing (all, all, all the things)\nThey don't mean a thing (all, all, all the things)\n(All all that glitters is not gold, now gold is not reality)\nThey don't mean a thing a thing\n(All, all, all the things)\nThey don't mean a thing a thing a thing\nI don't care what they don't mean a thing\n(All, all, all the things) all these fancy things\nI tell you that all is my weight and gold\nAll I know, I know all these things\nAll these things, all these things\nAll these things, all these things\n\n[Outro]\nCLK Mercedes Benz\nAll these things, all these things ...\nAll these things, all these things ...\nAll these things, all these things ...\nA whole lotta money\nAll these things, all these things\nAll these things, all these things\nAll these things, all these things\nMommy and Daddy, will you please stop fighting?\nAll these things, all these things\nAll these things, (and I don't care why) all these things\nAll these things, all these things\nAll these things, all these things...\nLet's get Stevie outta jail", "image": "https://images.genius.com/0bffd93463afe53e7f651f72bedfc78b.1000x1000x1.jpg"}], "artist": "Kanye West"}