{"songs": [{"title": "Never Come Down", "album": null, "year": null, "lyrics": "[Hook]\nYou, you, you can look up, I never come down\nHome boy, I tap dance on the clouds\nWho, who, who is it?\n\nYou, you, you can look up, I never come down\nHome boy, I tap dance on the clouds\nWho, who, who is it?\n\nYou, you, you can look up, I never come down\nHome boy, I tap dance on the clouds\nWho, who, who is it?\n\nYou, you, you can look up, I never come down\nI tap dance on the clouds\n\n[Verse 1]\nYeah, I keep it plainer than Pat, dog\nSo plain it's almost like I don't even rap, yo\nMack load, with flame from a spawning of hauntings that aren't me\nEven with my damn eyes open\nYeah, it's like my own never never land\nSmokin' on kush, from a bush you'll never touch\nBeing approached by hoes before you couldn't fuck\nAnd all they wanna know if you be down (you be down)\nIf you really understand what happen from point A\nWhat, hey, how you doing it wasn't even enough\nTo escape but I can't go\nSee I dream on and I'm over the peons\nWhile I be doin' the beyond the\nHatin' niggas be puzzled like how did he get on?\nSee, I did not dare perform with that coolery\nSo ante like nothing else matters\nWalkin' with a spirit so tattered\n\n[Hook]\nYou, you, you can look up, I never come down\nHome boy, I tap dance on the clouds\nWho, who, who is it?\n\nYou, you, you can look up, I never come down\nHome boy, I tap dance on the clouds\nWho, who, who is it?\n\nYou, you, you can look up, I never come down\nHome boy, I tap dance on the clouds\nWho, who, who is it?\n\nYou, you, you can look up, I never come down\nI tap dance on the clouds\n\n[Verse 2]\nNew type of warrior\nModern day hippie if I get enough sticky\nAnd if you don't get it I'll explain it to you simply\nAnd iffy iffy, then homie probably never get me\nNothin' really special about lil' ol' Cudder\nExcept the fact I'd slit my own throat for my mother\nIf it could make it stress free and then my brother could sacrifice\nA meal best served raw with a little steak sauce\nOh no, I bet you probably think I'm looney tune\nAfter big big country bought an album from a leak through\nHe was cool but just seems some type whatchamacall\nOther worldly, but I'm more of a worldly other\nSucker niggas like to state they undercover\nBut I'll peep ya, I'll see you from my cloud sanctuary\nAnd there's something about Mary\nShe made me un-tame\nThere was issues way before I smoked the phillies\n\n[Hook]\nYou, you, you can look up, I never come down\nHome boy, I tap dance on the clouds\nWho, who, who is it?\n\nYou, you, you can look up, I never come down\nHome boy, I tap dance on the clouds\nWho, who, who is it?\n\nYou, you, you can look up, I never come down\nHome boy, I tap dance on the clouds\nWho, who, who is it?\n\nYou, you, you can look up, I never come down\nI tap dance on the clouds\n\n[Verse 3]\nExpedited for you so homie run to it\nWe makin' the damn dough, who knew it\nAnd everybody in the game with the same ol'\nNo-no's I'll be doin' it, but Cudi from a different mode\nYou can keep it goin' though, no I will never slow\nOl' girl want purp, she is silly, yo\nI ain't trippin', I'm skippin' while I'm sippin' in\nWhile I go in though (again and again)\nTell them motherfuckin' let somebody tell new ones\nIf you get high still strive to be someone\nI am not a role model but I am the blueprint\nSuperstar concerts and honors when I spit\nOnly can be me, Scott, no one can do it, K\nOnly, I don't mean to be, I do it the CuDi way\nNo need to be mad if you not me\nLookin' for ill shit, you know where to find KC\nYeah, you know where to find KC\n\n[Hook]\nYou, you, you can look up, I never come down\nHome boy, I tap dance on the clouds\nWho, who, who is it?\n\nYou, you, you can look up, I never come down\nHome boy, I tap dance on the clouds\nWho, who, who is it?\n\nYou, you, you can look up, I never come down\nHome boy, I tap dance on the clouds\nWho, who, who is it?\n\nYou, you, you can look up, I never come down\nI tap dance on the clouds", "image": "https://images.genius.com/57fc91d7548f4e591a971ea7f5443a88.355x355x1.jpg"}], "artist": "Kid Cudi"}