{"songs": [{"title": "Top Ten", "album": null, "year": "2015-02-27", "lyrics": "[Produced by 6ix]\n\n[Verse 1: Logic]\nI hope you feel this shit\nTop ten flow and it's still this shit\nWent away, had to get away\nBeen away, came back and a motherfucker still the shit\nHold up, what's real as this?\nFeelin' myself, who ill as this?\nMastered the flow from the east to the west\nBut right now I'm wondering how trill is this\nI've been around for a minute now\nOne hunnid, I'm in it now\nPeople that wasn't there back in the day talkin' bout\nMan, remember I'm winning now\nI could only imagine if I was beginning now\nBack in the beginning now\nFuck that\nSpent a mil' on the chain and I tell my company deduct that\nGet the fuck back\n\n[Verse 2: Big KRIT]\nFirst off I give a fuck about all that top five if I ain't in it\nNiggas barely ever play my records (It don't matter)\nBut I'm still winnin' from the M-I-crooked\nJust to make 'em peep what I'm cookin', I love Mississippi\nI put a studio in my partner kitchen\nSo by the way I'm whippin you would think I'm juggin' these hoes\nCuttin' crack and make 'em double back like excuse me nigga\nI need a stove, nah, I ain't selling dope\nBut this a metaphor for my flow\nBut I'mma probably have to hit with a fork (maybe dumb it down)\n'Til it bubble up and then rise some more\nSo I can bag it up for these insta folk\nAnd sell it for the low cause they simple\nIf I hear \"KRIT, you need a hit\" one more time\nLookin' at us like \"how these motherfuckers gon' undership mine?\"\nStill do an interview here and there\nWhere they don't even know that I'm signed\n(Nigga you had to know that)\nIf I wait on the label to support my vision I might go blind\nLately I've been on my tell it all get rich\nStart plottin' on my way I did\nTo show like Empire may the very thing I dreamed of look like bullshit\nKill em all, why not, King when I'm busy\nKrizzle up in the blizzard and the cold is the  [?]\nSaid who was here, never really snowed in the sizzie\nFuck what ya heard, multi 'til I dizzie, bitch!\n\n[Verse 3: Logic]\nAight, check it, it's the take\nI heard y'all been checking my net worth\nWhat the fuck is y'all doing?\nY'all ain't on my level, boy, go pay your rent first\nAnd then maybe I'll sign you\nI'm looking for talent, I hope that I find you\n(Wait a minute, you asked me now let me tell you\nNow here's another problem)\nThey probably expecting that shit for the first album, man fuck that\nThey'll say that I changed\nAnd I'll say I had to show 'em my range\nCause if I do what I did then they'll say it's the same\nJust can't win in this game\nMoney talks, that's a figure of speech, that went over their head\nLike the dough that I throw in the air like I'm Papa John\nThat mafia money, that parmesan\nMy shortie a dime, your bitch is a nine, pennies\nProlly take her to Dennys, we chillin' at Lenny's\nYou know I got 99 problems, but keep it a hundred\nYou know that I done it\nJust me and my homies, we tryna make it to the summit\nPraying that we don't plummet\nLike \"Oh my God look at your boy now you finally done it\"\nI've been writing these records from actual facts\nSo hopefully you learn something from it\nBut what I learned is\n\n[Outro: Logic]\nI've been on a grind and now they all know what's up\nSo high, so high\nI said I've been on a grind and now they all know what's up\nSo high, so high\nI've been on a grind and now they all know what's up\nSo high, so high\nI said I've been on a grind and now they all know what's up\nSo high", "image": "https://images.rapgenius.com/9e2ee381460474e9238caf5738b55923.500x500x1.jpg"}], "artist": "Logic"}