{"songs": [{"title": "There U Go", "album": "Better Dayz", "year": "2002-11-26", "lyrics": "[2Pac] I don't know why I be fuckin witchu\n\n[Verse 1: 2Pac]\nWas it the liquor, that makes me act blind, times that I'm with her\nAnonymous pictures of other niggas tryin' to kiss her\nWill I love her or shall I diss her?\nI'm sick of this scandalous shit I deal wit', tryin' to paint a perfect picture\nMy memories of jealousy no longer carefree\nCause so much bullshit your girlfriends keep tellin' me\nI'm on tour, but now my bedroom's an open door\nSo it got me thinkin', what am I tryin' for?\nWhen I was young I was so very dumb, eager to please\nA lil', trick on a mission tryin' to get in my P\nMe and my niggas is thug niggas, former known drug dealers\nWe don't love bitches and believe, they don't love niggas\nI gotta blame my attraction\nBut you became a distraction, a threat to my paper stackin'\nI thought you changed but now I know\nCan't turn a ho into a housewife, baby, and there you go\n\n[Hook: Jazze Pha]\nThere you - there you go, actin' like a ho'\nThere you - there you go, actin' like a ho'\nThere you - there you go, actin' like a ho'\nActin' like a ho', actin' like a ho'\nHOE! See the word on the streets you're a\nHOE! Just a groupie on a world tour\nHOE! Now I found out for myself you're a\nHOE! Girl you need to check yourself\n\n[Verse 2: Kastro]\nThese silly bitches got this game twisted\nSo I don't claim 'em, just bang 'em\nPapa raised a player, so player, I play 'em\nI got hoes that got more, hoes than me\nSo how I look, gettin' hooked, like I ain't got G?\nTruly cutie booty big, but that ain't enough\nAnd the head make me beg, still that just ain't enough\nWhen I don't trust her, the bitch be lyin' too much\nWhen she be dyin' to fuck me you be buyin' her stuff, ho\n\n[Verse 3: Yaki Kadafi]\nSee girlfriend I know, your whole M.O.'s preoccupied with mostly\nGettin' clown after clown, town coast to coast - see\nI been tryin' to stay away from sluts like you\nGot me turned off completely by that sheisty shit that you do\nKnew from jump yo' aim\nStraight through them spandex, don't front just name\nSpots on yo' body for me to touch while you clutch this game\nI keep flowin' like H20 it ain't nothin' for me to say\nWhy you keep actin' like a ho? But there you go\n\n[Hook: Jazze Pha]\nThere you - there you go, actin' like a ho'\nThere you - there you go, actin' like a ho'\nThere you - there you go, actin' like a ho'\nActin' like a ho', actin' like a ho'\nHOE!, see the word on the streets you're a\nHOE!, just a groupie on a world tour\nHOE!, now I found out for myself you're a\nHOE!, girl you need to check yourself\n\n[Verse 4: Young Noble]\nUhh, when I first met her I told her I was busy all the time\nNow she, callin' me flippin' like she miss me all the time\nHow she, don't even trip she got a man at home\nYou need to stop chasin' dick bitch and raise your son\nI'm like - damn, we can creep sometime\nAnd you know I'm on the road for like weeks at a time\nGirl you're thirsty; and stop callin' while I'm workin' you hurtin' me\nAll this bullshit is irkin' me girl, but there you go\n\n[Verse 5: Big Syke]\nI blame it on yo' momma, she need to holla at you\nBut should I blame it on yo' daddy for all the things that you do\nCause there you go, just like a ho, caught in the streets\nLike givin' yo' number out to every nigga you meet\nI'm tired of the games you playin', so stop playin' (ho)\nYou hear what I'm sayin, you only good for parlayin'\nI'm layin' down the rules, this a game that you lose\nSo the streets can have you baby cause I stay on the move\n\n[Hook: Jazze Pha]\nThere you - there you go, actin' like a ho' (there you go!!)\nThere you - there you go, actin' like a ho' (actin' like a real ho')\nThere you - there you go, actin' like a ho'\nActin' like a ho', actin' like a ho'\nHOE!, see the word on the streets you're a\nHOE!, just a groupie on a world tour\nHOE!, now I found out for myself you're a\nHOE!, girl you need to check yourself\n\n[Outro: 2Pac]\nThere you go baby girl, That's the story\nThere you Motherfuckin' go\nI coulda Swore you told me you was gon' change\nAnd you don't wanna go to clubs no more and\nYou wasn't fin' to dress all crazy no more and\nYou was gon' stay home and try to chill\nWhat happened baby?\nOhh, so yo' friend wanted to go out\nThat wasn't you that went out\nYou was just goin' out cause yo' friend was\nOkay, so you was pissy drunk up in that nigga car\nCause yo' friend wanted to get drunk huh?\nIt's all good, cause there you go baby\nOh I ain't trippin' on them niggas callin' the house\nIt's all good, cause there you go\nMe I'ma still be a player, all day baby\nSo uhh, there you go\n\n[Hook: Jazze Pha]\nThere you - there you go, actin' like a ho'\nThere you - there you go, actin' like a ho'\nThere you - there you go, actin' like a ho'\nActin' like a ho', actin' like a ho'\nHOE!, see the word on the streets you're a\nHOE!, just a groupie on a world tour\nHOE!, now I found out for myself you're a\nHOE!..", "image": "https://images.genius.com/4f7dcd7bb697e66f11fe0520838cb066.1000x1000x1.jpg"}], "artist": "2Pac"}