{"songs": [{"title": "No Airplay", "album": "Mr. Smith", "year": "1995-11-21", "lyrics": "[Intro]\nY'all wanna put it on tape and do all the real shit?\nYa just wanna go straight to DAT? Aight\nYou don't wanna mix it or nothin'? Aight let's do it\nYou want me to do the hook part too?\nCheck it out uhh, check it out uhh\nYeah it's that Uncle L shit, you know, word up\nAin't no doubt about this, I'm settin' this shit right in here\nYeah yeah yeah, I'm gonna sex this up, yeah go like this here\nCheck it out\n\n[Verse 1]\nI'm beatin' niggas  the fuck up out their boots\nFlame throwin' their troops, they can't recoup from drinkin' acid soup\nSpectacular, benacular, miraculous raw shit\nScooped off the concrete to make a hit\nTearin' niggas out the hinges, competition cringes\nIn the trenches, killin' for mere inches\nWord to mama, I tongue kiss a piranha\nElectricute a barricuda for tryin to bring the drama\nI get more ass than a toilet seat\nSo put your ballerina shoes on and tiptoe down my meat\nYour motherfucking death wish will be soloist\nR-double O-K-I-E you ain't stylish\nIt's motherfucking arson from here to Parsons\nYou're fuckin' dawson, it's murder, when I step in the door run\nFor your motherfuckin' life, get ghost\nOr taste the toast and get your nuts hung on a goalpost\nStartin at'cha neck to check ya for respect\nYa back get snapped, your lower spine gets wet\nHips get ripped and then your thighs start to slide\nI'm up through your asshole and fuckin' up your inside\n\n[Chorus]\nAnd don't be gettin' no airplay\nA jam that'cha love, a jam that'cha love\nIt's a jam that'cha love that don't be gettin' no airplay\nA jam that'cha love, a jam that'cha love\n\n[Verse 2]\nYeah, the rugged ass style I possess\nThey got the niggas goin' from Bel Air to baggin' up sess\nShit, motherfuckin' right niggas in his corn\nYou shoulda never put me on this mic, you was warned\nI got niggas chasin' behind my path for garbage bags\nHopin' and prayin' I throw an old rhyme to one of the fags\nHuh, I'm on my motherfuckin' game like that\nI put it in your chest and make your heart go flat\nAll the motherfuckin' tracks in the world can't save ya\nWhen I drop these chains on ya brain and enslave ya\nOnce you was on a pedestal now ya gettin' ridiculed\nShit is critical, we're fightin' at the pinnacle\nI'm burnin' niggas like a cracker do a cross\nAin't no three-in-a-row tic tac toe, this is a real flow boss\nMakin' niggas understand my language\nThen they rap and vanish and camouflage the damage\n\n[Interlude]\nTo whom it may concern, youknowhutI'msayin?\nWe're gonna do this right here, word is bond, huh huh\n'Cause it's a jam that you love that don't be gettin' no airplay\n(A jam that'cha love that don't be gettin' no airplay)\nI wanna do that one right yo\n\n[Verse 3]\nTo whom it may concern on this motherfuckin' test\nI got the zest to clip ya through ya vest\nLittle shorties with big 40's talkin' loud, actin' proud\nBLAOW! Now ya chokin' off a black cloud\nRollin El's 'til your brain swells\nInhale deep sleep and dust me off them old ass Rock The Bells\nYou motherfuckin', you fruitcakes, you fakin' jacks\nYou niggas don't want it, I'm burnin' up the wax\nI'm a trailblazin', gun totin', renegade\nBlack ass New York niggas choppin' like a blade\nBullshinanigans, country ass mannequins\nMotherfuckin' frontin' and I bet you ain't no slam again\nYeah what? I said it and niggas sweat it\nWhat? You catch a heat-seekin missile in ya gut\n\n[Outro]\nHa ha, word is bond yo\nIt's a jam that'cha love that don't be gettin' no airplay\nYeah, ha ha, word is bond\nY'knowhutI'msayin? I'm catchin' motherfuckin' wreck in here\nKnowI'msayin?\nPissin' on all them rookies niggas word up ha ha\nYo I got the laugh, word, knowI'msayin?\nAnd sometimes niggas so skillful, you just gotta laugh at\nMotherfuckin'\nHa ha, yeah uhh\nA jam that'cha love that don't be gettin no airplay\nA jam that'cha love, a jam that'cha love\nYeah, I wanna shout it out to my mother[fuckin] [niggas] around\nFarmers\nMy nigga Zeus, knowI'msayin? My motherfuckin' minnan right\nDiddere\nSpit at the tissturn t-t-t-tables all L willing a-a-a-able\nYouknowI'msayin?\nGet mad busy in this motherfucker, y'knowI'msayin?\nMy niggas don't give a fuck, word up\nSet that shit off right, uhh", "image": "https://images.genius.com/aba57f7703e47dacfcd5243398922d01.500x500x1.jpg"}], "artist": "LL Cool J"}