{"songs": [{"title": "Gangsta’s", "album": "Space Boogie: Smoke Oddessey", "year": "2001-07-17", "lyrics": "[Hook- 1x: Daz & Kurupt]\n[D] - Gangsta\n[K] - Yeah blastin' on these sucka niggas\n[D] - Gangsta\n[K] - Yeah homie fuck them niggas\n[D] - Gangsta\nYou do not know me very well\nBut you will know me if you trip on me\nYou niggas cannot get wit me...\n\n[Daz] (Kurupt)\nWho are them two niggas that are changin' the game? (Daz and Kurupt)\nFuckin' it up, usin' our name up in vain (something Kurupt)\nSo whatcha wanna do, let's ride, bang\nUp on these other-sided niggas... and ride on the game (There they go!)\nI retaliate, in the alley way, on a sunny day (Here we go!)\nBlast up on niggas for they tally way, let 'em on they way\nBoo-ya-ka, boo-ya-ka, you should've looked before you come out\nBoo-ya-ka, boo-ya-ka, you should've looked before you run out (Nigga!)\n\n[Kurupt]\nWho them niggas that are squabblin'?, blast (Kurupt and Daz)\nQuick to knock niggas square on they ass (You betta ask)\nYeah them gangsta niggas back wit the smash, so quick, so fast\nDrinkin' straight gin outta the glass (Not if that ass)\nLook at all them niggas thinkin' that I'm free joke or somethin'\nBetta get the steppin' fo' the pump get to pumpin' and dumpin'\nRunnin' shit, smashin' shit, reckless, blastin' shit\nDippin' in the cut, not givin' a fuck, you know Daz and Kurupt\nWe just a\n\n[Hook- 1x: Daz & Kurupt]\n[D] - Gangsta\n[K] - Yeah blastin' on these sucka niggas\n[D] - Gangsta\n[K] - Yeah homie fuck them niggas\n[D] - Gangsta\nYou do not know me very well\nBut you will know me if you trip on me\nYou niggas cannot get wit me...\n\n[Kurupt]\nLook at this shit, I can't believe was goin' down right now\nGot a hand, I'm tuckin' 'bout to blast off a couple of rounds\nI show you gangsta niggas, T to a T-B, controllin' all of the monopoly\n'Opoly-y, nothin' tirin' a \"G\", stoppin' from boppin' prob' (Probably)\nI get the hoes, to throw them 'bows\nTop, gangsta'd up, Kurupt and Daz up in this mothafucka! (Fucka!)\nAnd we don't fuck wit bustas and we don't fall fo' you suckas (Suckas)\n\n[Daz] (Kurupt)\nI keep right from bitches who scream and yell my name\nIt's D.P.G mothafucka ain't nothin' really changed\n...I come through the block and let my system bang\nLet the 15 shoves and let the back hang\nSmoke out all my fuckin' window like a choo-choo train (Smoke it, smoke it)\nIndo what smokin' nigga be like some do-do rang (Gangstaville nigga)\nAhh Yeah! nigga you set some game\n\n[Daz & Kurupt]\nDogg Pound Gangsta Gang!\n\n[Daz]\nLet it bang nigga\n\n[Hook- 1x: Daz & Kurupt]\n[D] - Gangsta\n[K] - Yeah blastin' on these sucka niggas\n[D] - Gangsta\n[K] - Yeah homie fuck them niggas\n[D] - Gangsta\nYou do not know me very well\nBut you will know me if you trip on me\nYou niggas cannot get wit me... gangstas\n\n[Kurupt]\nAll of a sudden niggas got the game fucked up\nLuckily, locked up, lookin' fo' a come up\n\n[Daz]\nYeah! niggas they come around here and get fucked up\nScuffed up and touched up and fucked up, Daz and Kurupt\nNigga!\n\n[Kurupt]\nWhat! gangstaville', where the gangstas shoot to kill niggas\nFo' real, bust 'em post say, banana peel niggas\n\n[Daz]\nEverything that I talk and walk is so fo' real nigga\nYou get chalked and default and get killed quickka\n\n[Kurupt]\nI'm 'bout to smash and get my money from these mothafuckas\nDippin' and hittin' switches in my Nike cutlass fuckas\n\n[Daz]\nYou see we niggas and we runnin' shit from all you suckas\nSo weed and dick mothafuckaaaaaa!\n\n[Kurupt]\nYou see we\n\n[Hook: Daz & Kurupt]\n[D] - Gangsta\n[K] - Yeah blastin' on these sucka niggas\n[D] - Gangsta\n[K] - Yeah homie fuck them niggas\n[D] - Gangsta\nYou do not know me very well\nBut you will know me if you trip on me\nYou niggas cannot get wit me... gangstas\n[K] - Keep blastin' on these suckas niggas\n[D] - Gangsta\n[K] - Man homie fuck them niggas\n[D] - Gangsta\nYou do not know me very well\nBut you will know me if you trip on me\nYou niggas cannot get wit me...\n[K] - You see we\n[D] - Gangsta, gangsta\n[K] - Kurupt and Daz\n[D] - Gangsta\n[K] - Quick to blast, gangstas, smashin' on suckas, gangstas\n[D] - Gangsta\n[K] - You know who we are, gangstas\n[D] - Gangsta\n[K] - Smashin' on all you bitch niggas\n[D] - Gangsta\n[K] - Gangstas, smashin' on all y'all, we gangstas\nGangstas up in \"Gangstaville\"\n[D] - Gangsta\n[K] - Daz, yeah\n[D] - Gangsta\n[K] - Kurupt\n[D] - Gangsta...\n[K] - Gangstas\n\n[Intro to Bring Back That G Shit: Kurupt]\nCheck this out nigga\nIt's about time niggas started... recognizin' that gangsta shit\nBumpin' in them trunks, ya know, G-Funk, Ol' Skool to new\nGangsta shit, Fredwreck'difying, Kurupt Young Gotti and that gangsta shit\nDaz Dillinger, Bigg Snoop Dogg nigga, that's gangsta shit\nThat's gangsta shit!", "image": "https://images.genius.com/32f5907a0f69c52bd9d20ec857b3f90c.944x944x1.jpg"}], "artist": "Kurupt"}