{"songs": [{"title": "Life In Marvelous Times", "album": "The Ecstatic", "year": "2008-11-04", "lyrics": "[Mos Def]\nBright moments, bright moments always come back vivid\nThe fifth grade was epic city-wide test pressure\nThe pre-crack era\nMr. Schumer, what a prick\nAttitude match his wardrobe, uglier than sin\nThis is Bed-Stuy eighty-two\nNinth floor, three tiny rooms, one view\nBucktown, Roosevelt House\nTheir green grass is green; our green grass is brown\nShots rang, my phone wasn't touch tone\nWere heavy beef in the street, E.T. had to flee\nGreat heavens, good grief\nHungry bellies, bright gold on their teeth\nThe windows on the Ave look like sad eyes\nThey fix their sharp gaze on you when you pass by\nAnd if you dare to stand, you can see 'em cry\nYou can watch 'em scowl, feel 'em prowl\nWhile they're steady sizing every inch about you\nFast math measuring what you amount to\nThe laughter, the screams\nThe numeral, the song of songs, the book of dreams\nEnds don't meet where the arms can't reach\nMean streets, even when it's free it ain't cheap\nOn-going saga, terminal diagnosis\nBasic survival requires super heroics\nNo space in the budget for a cape\nAssume you gotta fly by night to save the day\nCrash-landings routinely happen\nSome survive, others never rise from the ashes\nWatching asphalt and observing the Sabbath\nCreates an Ecstatic and there you have it\nFrom teenage love praying in tongue\nStrange fruit, batty boots and native drums\nFrom hence I come, so here we go\nSigns and wonders all along the road\nSome lies open, some lies closed\nSome stretchers role with no lies at all\nSome riders don't know what they ridin' for\nHands on the wheel and their mind is gone\nWherever you ride, whatever your lane\nThis road called life is a beautiful thing\nAnd we are alive in amazing times\nDelicate hearts, diabolical minds\nRevelations, hatred, love and war\nAnd more and more and more and more\nAnd more of less than ever before\nIt's just too much more for your mind to absorb\nIt's scary like hell, but there's no doubt\nWe can't be alive in no time but NOW\n\nIt's just another shot to the heart\nIt's just a sure shot in the dark\nIt's just another place in the stars\nWonders on every side, life in marvelous times\nLife in marvelous times\nHey! The Ecstatic\nThe temperature's rising everywhere\nAll over the world, you can feel it\nAll over the world, feel it\nSpirits rise everywhere\nIt's just a sure shot to the heart\nIt's just a sure shot in the dark\nIt's just another place in the stars\nWonders on every side, life in marvelous times\nLife in marvelous times\nNow, always", "image": "https://images.genius.com/b13acc0fe75405f9fde88d9e60c03a7a.640x640x1.jpg"}], "artist": "Yasiin Bey"}