{"songs": [{"title": "What Can I Do?", "album": "The Fix", "year": "2002-08-06", "lyrics": "[Intro: Kelly Price]\nWhat can I do?\nWhat can I do, to make it better?\nYeah, yeah\n\n[Verse 1: Scarface]\nI thank the Lord, for every morning, he allows me to rise\nAnd though the sun is shining, there's a cloud in the sky\nLettin' me know, that at any moment, there could be rain\nAnd as beautiful as life is, there still can be pain\nDown the park, I hear the sirens, just a screamin' away\nAnd then the inevitable happens, the end of them days\nAs sad as it sounds, but that's the price we all gotta pay\nAnd the whole world knows God giveth, will taketh away (will taketh away)\nI live and I learn, I sit and watch my cigarette burn\nDown to the ash, it reminds me of the now and the past\nI say me a prayer, cause eventually I'll stand in the path\nOf the souls and dark roads that lead to rest\n\n[Hook: Kelly Price]\nDo you hear them, crying?\nWaiting for someone to come and dry their tears (someone like you and me)\nTake away their fears\n\n[Verse 2: Scarface]\nAnd then a child is born\nBloody naked, clingin' to life\nUnaware of his surroundings or if breathin' is right\nIn the arms of his mother as he looks in her eyes\nHe takes his first breath and he screams (baby's alive)\nAt the same time, another mother, murders her kids\nAnd the unbearable thought of this here just brings me to tears\nIt's hard enough we gotta raise our kids to live in this world\nSo full of hate with no faith, and killin' your pearls\nAnd sometimes, I sit it down, and wonder myself\nBut then again, I ain't Jesus, and I couldn't help\nAll I can do, is hope I never live with the fact\nThat I hurt one of my seeds ‘cause dealin’ with that\nWould be the hardest thing, I’d ever have to do in my time\nI'd have to take my own life too, and I couldn't climb\nThe stairway that you hear me singin' bout in my rhyme\nAnd a parent hurtin' his kid ain't decidin' the time\nI know it's truth, the next day, we just livin' to die\nBut I believe if you livin' right, you'll live in the sky\nLookin' down on the good and the bad, the world as a whole\nAnd hopefully you did what you did, before you had to go\n\n[Hook: Kelly Price]\nDo you hear them, crying?\nWaiting for someone to come and dry their tears\n(someone to dry their tears) Take away their fears\nCan I make it, better? (I want to make it better)\nCan I ease the pain that they are goin' through? (they're through)\nWhat can I do?\nWhat can I do?\n\n[Verse 3: Scarface]\nI say goodbye to you cruel world, I see peace in the red sky\nI see the beast when the dead die, relief when my head’s high\nHear the streets up ahead cry, when the heat from the lead fly\nFelt the grief when I said bye, 'fore the sheets on my bed dried\nThe turn of the table, the tale of the tape\nThe destruction of human flesh of the not so great\nThe long list of the John Doe’s that accompany the spirit\nAs the yells of the souls lost with hopes that god hears it\nThe resurrections of empty hearts crowd in the room\nMuffled sounds of the outside echo the tomb, but I’m cool, I’m cool\n\n(Kelly Price)\nDo you hear me?\nI'm cryin'\n\n[Hook: Kelly Price]\nDo you hear them, crying? (x2 to fade)\nWaiting for someone to come and dry their tears\n(someone to dry their tears)\nTake away their fears (take away their fears)\nCan I make it, better? (gonna make it better)\nCan I ease the pain that they are goin' through?\n(everything they're goin' through) What can I do?\nWhat can I do?", "image": "https://images.genius.com/5eb25741266e087e51cc814bb4a051e9.600x600x1.jpg"}], "artist": "Scarface"}