{"songs": [{"title": "Big Dusty", "album": "B4.DA.$$", "year": "2014-08-04", "lyrics": "[Produced by Kirk Knight]\n\n[Chorus]\nCheck my style, check, check, check it out\nCheck my style, check, check, check it out\n(Check it out y'all, check, check, check, check it out y'all)\nCheck my style, check, check, check it out\nCheck my style, check, check, check it out\n(Check it out y'all, check, check, check, check it out y'all)\nCheck my style, check, check, check it out\n\n[Verse 1]\nFuck jumping the broom, honey moons, I, I hit the pot\nSoak me up like a mop, know I'm up, know there's levels\nStaring down at the devil, hello, guess I got the memo\nPulling strings like Geppetto, you just a puppet, fellow\nI came out of the tomb, don’t drop a L, uh\nYou don't want to see the evils, which I dwell in hell\nTo excel, this shit never fails, always excels\nThey been swallowing sons before the double XL\nSex cell, ex ask why it never work out\nI guess I exercise too much, when I work out\nShows too turnt out, return home burnt out\nNow I got to hear all the shit, that you heard 'bout\nCan I live? What, these niggas want me off a bridge?\nIf I say it's turnt down, do I burn that shit?\nTruth is, if it ain't real, I don't feel it\nIf it don't hit my spirit, I don't get near it\nAnd that's point blank period, know some niggas that fear it\nSame niggas who know that we the illest\nLines so deep a great shark is what I reel up\nHit the flow and it can't go realer, my whole camp gorillas, nigga\n\n[Chorus]\n(Check, check, check it out)\nCheck my style, check, check, check it out\nCheck my style, check, check, check it out\nCheck my style, check, check, check it out\nDon't jack my style\nCheck my style, check, check, check it out\nCheck my style, check, check, check it out\nDon't jack my style\nJack, jack, jack it out\n(Check my style)\n\n[Verse 2]\nI stand juxtaposed to all my Pro's, realest illest niggas I know\nSee these foes biting the flows, they even jooks the pose\nI guess my CD really shaking the coast\nCause this really be the year that I feast, capisce?\nNothing defeats the beast, I speak my piece\nKnow niggas in the streets that heat seek for me\nRelease and squeeze\nMight put a Halloween between your spleen\nRetreat or trickle down to your last pound of green\nKnow what I mean?\nThis shit is like taking candy from the babies\nUnder these rappers is just a bunch of Now and Laters\nThey too sweet, plus they lease their Mercedes\nCan't be second greatest, I'm the best and def your favorite\nMy flow in-depth nigga, I got my wave up\nIt's either get your tidal waved, or you could be my neighbor\nCause if I can't eat, then you can't either\nI need to know, need the pizza dough, fuck I'm spitting ether for?\n\n[Bridge]\nYeah nigga\nReigning rap supreme in this bitch\nCause bitches lie niggas lie numbers, too\nCause bitches lie niggas lie numbers, too\nBitches lie niggas lie numbers, too\nBitches lie niggas lie numbers, too\nWhat the fuck you gon' do when the Era come for you?\n\n[Chorus]\nCheck my style, check, check, check it out\nCheck my style, check, check, check it out\nCheck my style, check, check, check it out\nCheck my style, check, check, check it out\nDon't jock my style\nCheck my style, check, check, check it out\nCheck my style, check, check, check it out\nCheck my style, check, check, check it out\nCheck my style, check, check, check it out\nDon't jock my style\n\n[Verse 3]\nAnd I'm from the blocks where they sell\nCell blocks rock my mental\nSee them fake thugs that you see before can't even spell\nMy flow spill with words you can’t pronounce, stories you can’t tell\n\n[Outro]\nCheck my style\nCheck, check, check it out\nCheck, check it out\n\n\n[Radio Interview]\nWelcome back y'all, you're listening to WPRO Brooklyn. That was \"Big Dusty\", the new single from Joey Bada$$ and I am turning on the A/C 'cause that joint is hot. Joey is here in the studio with us right now. Say \"Hi\" Joey and tell the people where you from. Yeah, is this mic on? Oh yeah, like, you know, I'm from, I come from Brooklyn, New York. You know, I was born and raised but ah, my my parents from the Caribbean. You know, my ma's from St. Lucia and my pa's from Jamaica. So, you know I play pretty close to my roots", "image": "https://images.rapgenius.com/508f804572b8ea60c0bdbb335fa8c108.660x660x1.jpg"}], "artist": "Joey Bada$$"}