{"songs": [{"title": "Killah Hills 10304", "album": "Liquid Swords", "year": "1995-11-07", "lyrics": "[Drug dealing skit]\nRZA: Yes the good life, you know\nGZA: What the fuck is that, Hells Angels?\nMK:  Ahh Mr. Bobby Steels, Tony Starks on the line one for Mr. Bobby Steels\nRZA: Steels over here, Steels over here\nPeace, Starks what's going on baby?\nYeah everything is lovely over here\nYeah Maximillion didn't show up yet\nI'm over here with Noodles and I got Lucky Hands with me\nGZA: You got soul, R&B, classics? All that shit right?\nRZA: Yeah, Greco is right in front of me right now\nGreco is standing right here\nYeah he has a briefcase; oh, OK, OK I got you\nAight thanks\nDK: Bobby Steels\nRZA: Mr. Greco, good to see you good to see you good to see you\nDK: A pleasure\nRZA: So is everything OK, is everything working as we planned?\nDK: Everything is working out, very nicely\nDo you have the cash, twenty-thousand dollars?\nRZA: Do we have the cash? We don't have to talk that, hey hey\nGZA: Get the fuck outta here with that Hells Angels bullshit!\nRZA: We got the cash\nYou know Cash Rules Everything Around this Motherfucker\nUhm, let me ask you...\nGZA: The fuck outta here!\nDK: Do you have the full amount? Twenty thousand as we agreed upon?\nGZA:  Fucking Hells bastards\nRZA: Let me ask you a question Mr. Greco...\nDo you know a a Don Rodriguez?\nDK: I know no such person\nRZA: Don Rodriguez from the Bronx? Don Rodriguez?\nDK: I don't know who you're talking about\nRZA: I think you do know him cause your fucking friend Don is down at One-Twenty Precinct right now singing his fucking ass like a fucking bird\nThe fucking guys is coming\nDK: Do you believe him?\n\n[Hook: GZA]\nLife of a drug dealer\nKillah hills 10304\n\n[Verse 1: GZA]\nRestaurant's on a stakeout, so order the food to take out\nChaos outside of Sparks Steak House\nMaintain the power, I feel the deal's gone sour\nNigga missed a wedding, late a fucking half-hour\nAnd his man who bought land from Tony Starks\nWhile he was contracting bricklaying jobs in city parks\nHe's a loan shark, interest raise a grand to a finger\nIn the garment district, got it sewn like Singers\n'Cause all that talk blasphemy, this kid after me\nFor the heist, in a Burlington coat factory\nFuck it, he turned state's on my nigga, Castro, this copilot\nWho used to drop rice sacks of blow\nOn this remote area we label Dead Man's Island\nTwo hundred miles South from Thailand\nRight off the docks, I got luxurious, custom-made yachts\nBurial plots, for my niggas hit with fatal shots\nThere's no need for us to spray up the scene\nI use less men, more powerful shit for my team\nLike my man, Muhammad, from Afghanistan, grew up in Iran\nThe nigga runs a neighborhood newsstand\nA wild Middle Eastern—bomb specialist\nInitiated at eleven to be a terrorist\nHe set bombs in bottles of champagne\nAnd when niggas popped the cork—niggas lost half they brains\nLike this ex-worker, tried to smuggle a half-a-key\nIn his left leg, even underwent surgery\nThey say his pirate limp gave him away\nAs the feds rushed him, coming through U.S. Customs\nNow look whose on the witness stand, singing, a well known soprano\nA smash hit from Sammy Gravano\nHere's the plan minimum for the hit, two hundred grand\nHalf time at the game, blasting niggas out the stands\nThe sharp-shooters hit the prosecutor, judges are sent\nPhotographs of they wives taking baths\nAlong with briefcase filled with one point five—that's the bribe\nTake it or commit suicide\nFirst rule—anyone who schemes on the gold in Syria\nI want they small intestines ripped from they interior\nI got a price for those jewels, ship 'em freight cargo\nDon't forget to launder the cream through Wells Fargo\nReconstruct those processing plants for the call of Costa Rica\nFour hundred barrels of ether\nTwo hundred pounds of reefer, and fifty immigrants with fake Visas\n\n[Hook: GZA]\nLife of a drug dealer\nKillah hills 10304\n\n[Outro: GZA]\nThe saga continues", "image": "https://images.genius.com/70ce905afa9b4ece8c671d3ed66e1a51.500x500x1.jpg"}], "artist": "GZA"}