{"songs": [{"title": "Star 69 (PS with Love)", "album": "Electric Circus", "year": "2002-12-10", "lyrics": "[Verse 1: Common]\nLet's do it now, it's me and you\nClose my eyes Erotica, I'm seein' you\nListen to me wishin' I could be with you\nTo share my love and ecstasy with you\nAre you alone? Is your shorty sleep?\nHold on, that's okay, ignore the beep\nFor you, my love is immortal deep\nYou are my queen but I can't ignore the freak\nLet's let our bodies talk, and our auras speak\nHold on, gotta get the toiletries\nAs our waters reach distances unheard of\nI'm in the room nestled sweet and I reserve love\nOnly for you, I ask God to show me the truth\nWhat He showed me was you\nWherever I go, my soul leads to you\nDays gone, nights lonely for you\n\n[Hook: Bilal & Prince]\nErotica, wet dreaming on my mind\nErotica, can I come in your mind?\nErotica, P.S., with love I shine\nErotica, wish on star 69\nErotica, wish on star 69\nErotica-ca-ca, wish on star 69\nErotica-ca-ca-ca-ca-ca-ca\n\n[Verse 2: Common]\nSo much I wish you were here with me now\nMy bad, I just hit redial\nI want you to come, and never leave now\nIs your mind and your right hand free now?\nOur love-reach deep down inside of it\nAs the candle burns, when desire's lit\nMakin' love knows no distance or environment\nWhen we (ahh!) I feel the most high in it\nI feel you touchin' me and I begin to rise from it\nYour love is stuck in me\nOur minds are so alive and thick\nPicture my hands on your waist as I stare in your face\nYour mouth half open, your love I can taste\nEmbracin' you, life I let go\nGotta switch phones, cause this one is ghetto\nAnother level of love we create when we take it to\nAnd when it's made, Erotica, it's made for you\n\n[Hook: Prince & Bilal]\nErotica, wet dreaming on my mind\nErotica, can I come in your mind?\nErotica, P.S., with love I shine\nErotica, wish on star 69\nErotica, wish on star 69\nErotica-ca-ca, wish on star 69\nErotica-ca-ca-ca-ca-ca-ca\n\n[Bridge: Bilal & Prince]\nSlave to your loneliness (slave to your loneliness)\nInside of loneliness (inside this alt we bear)\nWith love of loneliness (with thoughts of loneliness)\nEnslaved by loneliness (oh oh)\n\n[Verse 3: Common]\nI want you to come, inside your mind\nAnd find a place, nasty and kind\nThis is where, our desires grind\nAnd where they peak, is most divine\nA place and time, I hope we reach together\nYou are my queen, and freak forever\nI feel you in-side my stomach\nMy body shakes (ahhh)\n\n[Hook: Prince & Bilal]\nWet dreaming on my mind\nErotica, can I come in your mind?\nErotica, P.S., with love I shine\nErotica, wish on star 69\nErotica, wish on star 69\nErotica-ca-ca, wish on star 69\n\n[Outro: Prince]\nWish on star 69, wish on 69\nWish on star 69, wish on 69\nWish on star 69, wish on 69\nWish on star 69, wish on 69", "image": "https://images.genius.com/4f09b702f3b5aead8b4d73c0bfdb708e.936x936x1.jpg"}], "artist": "Common"}