{"songs": [{"title": "We Goin’ to Do it to Ya", "album": "It Ain’t Safe No More...", "year": "2002-11-26", "lyrics": "Aiyyo Mega' gimme some of that barefoot jungle shit\nAnd let me shake a leg nigga! (Megahertz)\n\nLet's give it to 'em\nYo, let's give it to 'em\nYo, let's give it to 'em\nBusta Bust, let's give it to 'em\nFlipmode, let's give it to 'em\nCheck it\n\n[Verse One]\nEver felt the fire burn like this (burn like this)\nYou shocked that I've returned like this\nStern like shit'll make you firm like this\nC'mon, while we make the bitches yearn like this\nPearl white shit'll make the world hype quick\nAnd earl like knowin I'm bonin your girl like this\nAct sweet (BOY) nigga we pack heat so (BACK BOY)\nStack money like a Backstreet Boy\nTrack sheet, never whack, bitches hittin in my back seat\nLove my flick up in the Black Beat boy\nSo move your black feet boy, make bitches bounce to this\nDon't let me have to let the mac speak boy\nTrack meet boy, hundred meter dash, straight to the trash\nYou corny rhymin on them whack beats boy (C'MON)\nAnd you know we rock on and on\nAnd make the bitches wanna bounce, all night long and\nAnd to my gettin money niggas keep ballin (c'mon)\nYou know we bout to take it to the next mornin\n\n[Hook: repeat 2X]\nGet your big ass on the floor!\nYou know we goin' do it to ya (alright)\nYou know we goin' do it to ya (alright)\nYou know we doin' do it to ya (alright) nigga\n\nGet your big ass on the floor, C'MON!!\n\n[Verse Two]\nThe Range Ro' and everything you see is paid fo' nigga, c'mon\nChange flow and then we lay low\nChase mo' money, fuck I wanna waste dough fo'\nStack peso, big money know my small money\nProbably bigger than your WHACK payroll\nMoney get your hands off of me, dance all night\nBreak bitches hot and sweaty take your tight pants off for me\nSo horny, shorty pull your plans off on me\nWhylin out, while shorty ditchin her mans off for me\nSo simple, there go the champagne glass\nWhen your pour, make sure the whole entire thing full\nSinful! Still shorty puttin the somethin on me\nBrushin on me, whylin and feelin and touchin on me\nWhatchu play fo'? (RRAH!) When I hop up in my two do'\nGreat sex and do it, say no mo' (RRAH!)\nMake those, know nigga we got heat big\nBlock sheets and shit and stay up on the hot street though (RRAH!)\nGet high shit (RRAH!) fly bitches runnin the flo'\nHollerin and screamin this my shit! (RRAH!)\nCount that in the amounts that amount to the ceiling\nI know you love the way we bounce back nigga\nGimme my ounce back nigga, Flipmode back in the spot\nYou can run and go announce that nigga, c'mon\n\n[Hook]\n\nGet your big ass on the floor\nYou know we goin'..", "image": "https://images.genius.com/cc9251ac994bbe401044c52cb51d1e49.1000x1000x1.jpg"}], "artist": "Busta Rhymes"}