{"songs": [{"title": "Dangerous Mouths", "album": "Da Real World", "year": null, "lyrics": "[Intro: Missy Elliott]\nUhh, 3000 baby\nUh huh\nOoh, raunchy, raunchy\n\n[Verse 1: Redman]\nGood riddance, to niggas and bitches bullshittin'\nI house MC's like baths and full kitchens, ready or not\nDoc, hood lynchin', icy flows\nI write with wool mittens\nIt's two, not one\nMissy dot dot com\nCome once in the blue like free hot lunch\nSo once it's on, turn it up, chickens flockin' in\nShoppin' at birds are us, murderous\nDon't blame me, blame the music\nI write with napalms in my hands\nFlame the fuses, like ca psss, off you go\nI'm nice battin', I practice when the park is closed\nI'm that man who squats out of jeeps and vans\nJump to roof to roof on the TV cam, I fuck a model\nI go out with the cheapest tramps, pussy have me trippin'\nLike Kima, Keisha and Pam\nI remain cool like, like open house on a school night\nAnimal House gettin' thrown out for food fights\nPPP strictly don't give a fuck\nAn Brick City niggas strictly don't give a fuck\n\n[Verse 2: Missy Elliott]\nLet me intervene, come between, like dick through your jeans\nHang down to your knees, it's mwa the Don-Wan\nCarry on, D.A.N. to the danger\nY'all MC's in a whole lot of danger\nChange up all your rhymes you need beats\nMy beats you see completely unique, forgive thee\nSee its the shots of Henessey that's in me\nReggie Noble through after me\n\n[Verse 3: Redman (& Missy Elliott)]\nIt takes two to tingle, and two to fuck\nI done fucked in Range Rovers to Isuzu trucks, used to move weight\nNow you makin' moves to duck\nBuilt solid without bolts, screws and nuts\nPussy tight, Jiffy Lube it up\nDoc came up, hoes use to hang up\nNow my arm close hang up, my crew is deeper than Karl Kani pockets\nWe don't buy bullets, we ask what size rockets, for thee occasion\nOne shot will have you ravin', like Symone when the four four is blown\nTwo minutes later I'll make it hotter, snap you from the vine\nTo my um blada a boom glada\n(So what you wanna do, what you wanna do?)\n\n[Bridge: Redman]\nYo, I got the chicken, the brew taken next\nAn much room Def Squad in the house\nDrop you drawers, tell your boyfriend ease up, and park his car\n\n[Verse 4: Missy Elliott]\nI'm from the south, you better watch your mouth, it's the MI\nThe S.I, if you try, then you die\nI don't take no mercy on you suckers so\nWould you still be in love, baby, if I cut your throat, cut the jokes?\nI ain't got no love for yo\nNo friends with those, who imitate me ya bold\nMy style I own, I'mma have to steal your flow, you know me Joe\nI gotta say no more, BITCH!\n\n[Outro: Missy Elliott]\nThats right nigga\nIt's Misdemeanor here, Redman, Timbaland uhh\nMuthafucka! 3 triple zero, the Matrix baby\nUhh, I'm out", "image": "https://images.genius.com/f887ad1c0966679207185a705cecd837.1000x1000x1.jpg"}], "artist": "Missy Elliott"}