{"songs": [{"title": "Hard (A Monster Made It)", "album": "Strangeulation", "year": "2014-02-07", "lyrics": "[Intro: Tech N9ne]\nStrange Music! I know ya’ll see us!\nYa’ll saw that Forbes list 2 years in a row, nigga, don’t play!\nAnd we still doing it!\nHarder than most of ya’ll motherfuckers out there, y'all know it!\nI’m 'bout to show you right here, check it out\n\n[Verse 1: Tech N9ne]\nI been reppin' heavy to all you tardy cats\nWhile you gettin' over with ya piss and farty raps\nBeen smokin' hella enough to bring Bob Marley back\nI still kill 'em all but I gotta shake 'em like \"where the party at?\"\nLet up ya dresses, confess it, Tech is impressive\nHis message, eff, it, stretches from Zacatecas to Texas\nI'm excessive with breasts-es\nWhen I press it, meshes make messes\nThat's where the sex is, it breakfast\nYes, they blessed as Hugh Hef is!\nOut rhyme the foes with all kind of flows\nTime for the N9ne because I'm the chosen\nNever gotta be foolish to get the dough\nLike a lot of you actin' up on TV to get a ho\nYou don't wanna have to fight on my card\nI give the type of choppin' that should be barred\nI'm gonna shoot beyond the stars, you try and disregard\n\n[Hook]\nMy shit is hard! Constipated\nThey wonder why it's so killa, cause a monster made it\nMy shit is hard! I'm the greatest\nLook around, that's why everybody's congregated\nMy shit is hard! Constipated\nThey wonder why it's so killa, cause a monster made it\nMy shit is hard! I'm the greatest\nLook around, that's why everybody's congregated\n\n[Verse 2: Tech N9ne]\nMoon stricken, yeah, they think I'm crazy\nWhen they ask me how I rap so quick, I say poon-lickin'\nDon't play my shit, you'll have everyone in the room bitchin'\nDoomed if and you got (ravished) and now my tomb's kickin'\nFour score, seven years a ho\nKnockin' 'em down with me, 99 beers to go\nChuggin' around 50, mix the Lou then cheers to slow\nMuthafuckas who never loved us simply cause they feared the flow\nSpit lyrics to get vicious rippers to get the pit\nDiss this and get whipped, hit this trick with this pistol grip\nBitch, this is the fifth, if suspicious, here's a stiffen of this\nSniffin' this-- Wait, what was I sayin'?\n\n[Hook]\nMy shit is hard! Constipated\nThey wonder why it's so killa, cause a monster made it\nMy shit is hard! I'm the greatest\nLook around, that's why everybody's congregated\nMy shit is hard! Constipated\nThey wonder why it's so killa, cause a monster made it\nMy shit is hard! I'm the greatest\nLook around, that's why everybody's congregated\n\n[Bridge: Tech N9ne]\nJust wear your coat if you enter the rain\nTwo dollar haters yeah I'm a be a vender for change\nSender of pain to ya lady I'mma lend her the thang\nAnd she gonna take it from me and the newest member of Strange\n\n[Verse 3: Murs]\nKings get assassinated, castles all crumble\nForever lives the legend of a poet who is humble\nWords to live by, now I die by a strange code\nAbout to kill this verse, they call me Murs if you ain't know\nI don't rap fast, I'mma leave that up to Tech and 'em\nCes, Bernz, Krizz, Rittz, Wrek, and the rest of 'em\nZero estrogen, my heart, it only pumps lava\nDNA is black mamba with a little chupacabra\nI'm a monster, I'm a problem, I'm a motherfuckin' beast\nI'm a red nosed pit, off the motherfuckin' leash\nI'm a livin' fucking legend, man, the rest of y'all just walking dead\nFeral with a arrow, call me Daryl, takin' off your head\n\n[Hook]\nMy shit is hard! Constipated\nThey wonder why it's so killa, cause a monster made it\nMy shit is hard! I'm the greatest\nLook around, that's why everybody's congregated\nMy shit is hard! Constipated\nThey wonder why it's so killa, cause a monster made it\nMy shit is hard! I'm the greatest\nLook around, that's why everybody's congregated\n\n[Outro: Tech N9ne]\nIt's getting to the point where\nI don't even wanna work with rappers no more man\nAll these years trying to get 'em all to see\nNow I just wanna do what I been doin'\nJust makin' music for my technicians to bang\nYou know what I'm sizzlin'?\nBang! Bang! Bang! For Strange!\nBang! Bang! Bang! We're gonna bang! For Strange!", "image": "https://images.genius.com/a97c6b9421fc6142eef43b7f37277096.500x501x1.jpg"}], "artist": "Tech N9ne"}