{"songs": [{"title": "Watch the Ice Break", "album": "Home Invasion", "year": "1993-03-23", "lyrics": "It's goin down\nFrom the Ammo Dump\nI got my nigga SLJ and DJ Aladdin\nDroppin the fat tracks\nHit em with it\nSyndicate's in the muthafuckin house\nAll duck MC's get flat, muthfuckas\nYeah\n\n1993\nAnd it's still me\nA rappin brother from L.A., the cool T\nDiss a brother, hate a brother, I still come back\nWith the fat tracks, fuck the pop crap\nI got a mind to cold diss a fool\nWack rappers sellin out urge me to pull tools\nFor no reason\nPop suckers hookin for hits like hoes skeezin\nProstitutes that can't shoot, yet you clock loot\nDancesteps with the weak styles, but you look cute\nBitch, that shit's wack\nLet Hammer dance, and you other fools ease back\nThe microphone in some twist in a clenched fist\nMind locked on ???? load of my hit list\nAnd make duck rappers pray\nMany talk shit, but none step this way\nCause I'm quick to beat down a weak clown\nClock crazy juice from L.A. to the Boogie Down\nI play the whole map\nGot hoes locked like a muthafuckin bear trap\nIce muthafuckin T\nBefore hoes gee they need two forms of I.D\nNever fess, not the best, but I'm hard to shake\nHuh, watch the Ice break\n\nWatch the Ice break\n\nYo, let's see now who's tryin to diss me\nSay I sold out cause I rocked with the B.C\nY'all are bitches, you're straight wack\nQuick to talk shit, but always behind the back\nI do whatever I wanna do, punk ho\nI rock a perm, you rock an afro\nI wear khakis, while y'all wear silk\nY'all drink forties, and I drink milk\nCause that's my muthafuckin biz\nI never sell out, cause it's no sale, kid\nHardcore to my heart from the fuckin start\nWhether done over beats or loud guitars\nI drop the dope hits\nCase you forgot, I invented this gangsta shit\nYou wanna step to me? New jack, walk\nCome back in five LP's, then we can talk\nYou're just new, kid, you got a hit out\nIn interviews you talk a lotta shit out\nYou got paid, you really made out\nYou went broke when your one jam played out\nNow you're searchin for that one more hit\nShhhiiit\nI ain't new to this, I got gangs of gold\nI come original, then I break the mold\nToo many MC's hit, then fold\nThey're just fakes\nHah, watch the Ice break\n\nWatch the Ice break\n\nYeah\nSyndicate jumpin off 1993\nOn some old fly smooth shit\nAll the muthfuckas out there down with us\nYou know what I'm sayin?\nWe're rollin strong\nAll the busters out there that got some static to say\nWe're settin this shit off physically this year\nLike KRS-One says:\nSucker MC's duck down\nMuthafuckas ain't takin no shit\nI'm swingin on busters, point-blank\nDiss me and it's on\nStraight up\n\nNow it's the break of dawn\nAnd the mic is still on\nAll hoes are fuckin and the rhymes are damn strong\nMany MC's that choke from the mic smoke\nThose who tried to get with me\nLost in rhyme infinity\nOr they lost breath\nTry to step to the Ice equals sure death\nCause ??it's then I begin?? than you ever assume\nDrop the mic, go rap in your living room\nI love the quick kill\nSwing on a nigga sometimes just to break ill\nKnuckle up, buster, fool, in his fuckin eye\nAll hands, I need no gun, yo punk, why?\nCause if I pull my gun, you die\nNo second try\nI gotta cool out now, so I don't over-freeze\nNut up and start murderin MC's\nStart catchin bodies from state to state\nThrow on a ski mask and walk the streets late\nAnd do me up a whole damn crew\nThe Geto Boys was trippin, but my mind's trickin me too\nCause diss me, and I meet you one day\nAnd bet your life it won't be a fun day\nI hope, nigga, it's not your fate\nThat you're around when the Ice breaks\n\nWhen the Ice breaks", "image": "https://images.genius.com/e31ea71297e7a9f7b5274df3c469e7d9.1000x1000x1.jpg"}], "artist": "Ice-T"}