{"songs": [{"title": "We Celebrate", "album": "The Big Doe Rehab", "year": "2007-12-04", "lyrics": "[Intro: Kid Capri]\nOh yeah, as we celebrate hip-hop, baby\nOh yeah, as we celebrate hip-hop, baby, whoa\nYeah, it's Ghostface and the man Kid Capri\nLet's celebrate New York, around the world\nAnd yo, Ghostface, go in heavy, man, let's do it!\n\n[Hook 1: Ghostface Killah + (Rare Earth sample)]\n(I just want to celebrate)\nLike my squad won the Super Bowl\n(I just want to celebrate)\nLike we bangin' on New Years Eve, y'all\n(I just want to celebrate)\nLike we just beat trial\n(I just want to celebrate)\nWe hype for just being here\n\n[Verse 1: Ghostface Killah]\nStones on every arm, the crib is ten million\nThe corks from Dom Perignon can't reach my ceiling\nFour maids with four grenades\nWhen the sun's in my face, all I do is lower the walls for shade\nThe pool's a pain in the ass, 50 grand on Windex, kid\nThey keep it clean, the whole bottom is glass\nSo you can see the sharks and piranhas, a pair of pajamas\nThat's my neighbor, the faggot disresepecting my mama\nNo cars in the garage, it's underground shit\nThey way the floor open up you think I'm hiding spaceships\nFrench chefs, the best grapes on they breath\nLouie aprons on the Yank cats, the puffy cooks the rest\nBesides, I got birds that never leave the nest\nThey fuck with me, I'll watch 'em confess, then I'll go rest\nGet back up, deposit them checks\nMuthafuckas fuckin' up a good time by snappin' your necks\n\n[Hook 2: Ghostface Killah + (Rare Earth sample)]\n(I just want to celebrate)\nLike my baby's first steps, you heard?\n(I just want to celebrate)\nLike my first time platinum, y'all\n(I just want to celebrate)\nLike my first piece of nookie, uhh\n(I just want to celebrate)\nWe hype for just being here\n\n[Verse 2: Ghostface Killah + (Cocoa Channelle)]\nMoney for everybody, candy to the kids\nCatch me on dateline, Starky too big\nI'm like a mannequin; I stay jig\nMansion parties for all star weekend in my L.A. crib\nWe came to party, run out of Goose we got Dollies\nShorty's sweatin' me, check out her body\nThrow up your hands like it's your birthday, mami\nLet's celebrate, now I got her girlfriends behind me\nNow I'm in the middle, watch is all chiseled\nI can holla at the birds, like Dr. Dolittle\n(What's that in your pocket, Ghost?) A Dill pickle\n(Not that) Oh, that's the .45 stainless nickel\nI'm pullin' a green, got a G for the biggest ass on the floor who look right in them jeans\nIf you fat, I might take one for the team\nBut I gotta get drunk first, know what I mean? Come on!\n\n[Hook 3: Ghostface Killah + (Rare Earth sample)]\n(I just want to celebrate)\nLike we won the Power Ball money\n(I just want to celebrate)\nTony Starks won an Oscar, y'all\n(I just want to celebrate)\nLike all of my goons just came home\n(I just want to celebrate)\nWe 'bout to have a good year\n\n[Verse 3: Ghostface Killah + (Cocoa Channelle)]\nNa-na-na-na-nah, you can't catch me\nI'm out like Thomas in a five-fifty\nPolice be fiending to frisk me\nI'm so legit I walk away with the car keys pissy\nBack at the labo, shorty wop need a Dutch\nHe fuckin' wit a Goose dick, tonight I'ma beat it up\nYour thing to wet, you sure you ain't seeded up?\n(That's how I get, Ghost, especially when you eat it up)\nMy goodness gracious, ass is flirtatious\nMove it around like a snake miss or sexy waitress\nGhost don't have no patience\nI like you, I usually change chicks like radio stations\nI'm definitely not looking for love\nBut if you give it to me right now I might say I was\nYou can chill if you want, I got crazy bud\nBut before we do, what it do, go jump in the tub; come on!\n\n[Hook 4: Trife Da God + (Rare Earth sample)]\n(I just want to celebrate)\nThrow your hands up, nigga\n(I just want to celebrate)\nPop the 'pagne, pop the cork\n(I just want to celebrate)\nRepresentin' on the streets of New York\n(I just want to celebrate)\n{Ghostface} We 'bout to have a good year\n\n[Outro: Kid Capri]\nYeah, we gets it in, gets it in, gets it in\nNew York, we been had it, we gets it in\nOutta town we fuckin' up but gets it in\nWorldwide we doin', we gets it in\nThe Ghostface, Kid Capri, I gets it in\nThat's no joke, when we here, we get it in\nNo kiddin', in the building\nGetting it in, all day, getting it in...", "image": "https://images.genius.com/f1bbc70540da138c70debc041f381d0f.1000x1000x1.jpg"}], "artist": "Ghostface Killah"}