{"songs": [{"title": "Listen To Me (Intro)", "album": "Listen To Me", "year": "2011-05-13", "lyrics": "[Intro]\nThis is a WJZ13 Eye Witness News Special Report\nGood afternoon everybody, I'm Mary Buballa, we will join Dr. Phil in just a moment but first, breaking news out of Silverspring, Maryland\nA gunman has entered the Discovery Channel building on Georgia Avenue in Silverspring, and taken at least one hostage. We're gonna look at some video of the building\nThe man entered it around 1 this afternoon. It is not known if the man works there now or has worked there in the past\nPolice are not saying that anybody have been hurt at this point. Police are saying that the suspect does have concerns about the Discovery Channel-\nHe's making some demands I'm not getting into. We are-\nThe man needs to be listened to. Somebody needs to listen to this guy. I mean...\nWe just received word the suspect is 23 year old black male. We have a name. Future. Future Joyner. He's not backing down, he's determined-\nHe's apparently some sort of rapper\nSomebody needs to listen to this kid\nSomebody really needs to listen to this guy before he kills people-\n\n[Verse]\nUh, you muhfuckas better listen to me\nYou got no muhfuckin' choice, so what's the\nChance of the world hearin' my muhfuckin' voice?\nEmbrace it (Ahh), I kill a hostage\nSpit the conscious of a prick that's violent (Yeah)\nI'm twisted minded, bitch I grew up in the [?] projects (Yeah)\nYou might as well try to kill me 'fore I blew up (Uh)\nSo fuck everybody when I grew up, henny when I threw up\nCorona and Tequila in my cooler, black smoke seepin' from the Cuba\nAttract mode, scratch from the cougar (Ah)\nPlottin' on them diamonds from the jeweler (Yeah)\nReach from the tool to fill the rugger\nThat the mouya from Bermuda, to Aruba, we maneuverin'\nThe movin' in the blue Corolla, Suburu, the new one (Ah)\nI spend like a champ, tell me, who won? (Won)\nFuck around, get your whole fuckin' crown blew up (Bang)\nMy nigga Aziz told me how to get this moola (Yeah)\nNigga Trubs took me down to Ayab (Uh), where niggas get sprayed at (Brrap)\nAnd bitches get laid at (Yeah), and niggas just hate that (Why?)\n'Cause actual niggas ain't them niggas you could pay back (Yeah)\nYou fuck what you heard, I be way back\n'Cause I ain't goin' nowhere (Nah), so homie, don't go there\nI swear y'all forgot about Joyner, I been lingin' in the cut\nMr. Alcohol Peroxide lingin' in ya cuts (Ahh)\n[?] schemin' [?] crack, what you bangin' in ya trunk?\nNiggas think they off the chain, but I been chainin' niggas up (Yeah)\nJoyner off the meat rack, hangin' niggas up\nI'm with the Satan for the flames and I been blazin' niggas up (Ooh)\nY'all been eatin' long enough now, stop bein' greedy\nSnatch the food up out ya plate, better move out the way\n'Fore I shoot out the place (Bang), what you fools gotta say?\nNiggas ain't sayin' nothin', gotta do [?] days\nI know some bad hoes that suck the poo out a lake\nAnd I don't do a lotta drinkin', I just cool out and wait\nFunny thing is, they think they sicker than me\nI shot these industry niggas up, now listen to me", "image": "https://images.genius.com/2c85e5ff7768da914af18e07c14fca52.1000x1000x1.jpg"}], "artist": "Joyner Lucas"}