{"songs": [{"title": "Sucka 4 Love", "album": null, "year": null, "lyrics": "[Intro]\nDoing me like you do, cause I know it’s what you do (x 5)\n\n[Hook]\nNever been a sucker for love\nSo if it come down to you and me you know\nI don’t give a fuck, hit the next bitch like wassup\nCause at the end of the day\nYou ain’t never been nothing but a nut\nI ain’t never been a sucker for love\nSo if it come down to you and me you know\nI don’t give a fuck, hit the next bitch like wassup\nCause at the end of the day\nYou ain’t never been nothing but a nut\n\n[Verse 1]\nListen boo, you’s a bitch, you been a bitch\nYou know how niggas do\nRun up in a bitch, fuck her well\nAnd the bitch will call them bitches\nBut then in a week or 2, fucking all them bitches\nA nigga gotta fall back and take a breather\nShawty suck a mean dick but in the morning\nGotta leave her, wasn't trying to deceive her\nI just wanted my dick suck\nCute as a motherf-cker\nAnd she got a big butt\nNow i’m like, what do i do from here\nCause she’s acting like she ain’t trying go nowhere\nAin't really trying to get attached to this shit\nShit its friday, i just want some ass in the bitch\nCan’t be mad at me, i’m just doing what niggas do\nGot kids by him, she wanna be the niggas boo? what? really?\nOh you think it’s like that, ok! i’ll be right back\n\n[Hook]\nI ain't never been a sucker for love\nSo if it come down to you and me you know\nI don’t give a fuck, hit the next bitch like wassup\nCause at the end of the day\nYou ain’t never been nothing but a nut\nI ain’t never been a sucker for love\nSo if it come down to you and me you know\nI don’t give a fuck, hit the next bitch like wassup\nCause at the end of the day\nYou ain’t never been nothing but a nut\n\n[Verse 2]\nIt was summer time, I was in the slumps\nSeen that bitch from a far, I was like wassup\nRemember me? I was that kid\nIt was him and me, you just did what you did\nHow you expect me to respect you\nWhen I know a police file of other niggas that you gave your sex to\nI ain’t never been a sucker so if you think so\nYou got the wrong motherf-cker\nWhat’s my name? ah ah, bitch! what’s my name?\nYou know who the fuck it is\nI’m a real nigga, that’s about my biz\n\n[Chrous]\n\n[Verse 3]\nI like the way you beat head, oooh, thats that street shhh\nShawty can you keep a secret?\nLook here, you know what I’m trying to creep with\nOk, come on, cars outside, hotels up the block\nJump in the ride, you and me for the rest of the night\nIt’s all good, click, turn off the lights\nPack it off like that girl, ooh, damn, that ass fat girl\nWe almost there baby, oh shit yeah baby, ow!\n\n[Hook x2]", "image": "https://images.genius.com/1bcf43b1cc0f34db6cd70e1a63c8b84c.464x464x1.jpg"}], "artist": "DMX"}