{"songs": [{"title": "The Season", "album": "NBA Live 18", "year": "2014-10-30", "lyrics": "[Produced By: J Dilla]\n\n[Verse 1]\nUnited States in fear\nLondon knows I'm a phantom, South Korea knows I'm here\nPosted, planted without exception\nRise to your feet for this rarity\nNas and Dilla beat, the fly soliloquy\nSome real nigga talkin'\nThis don't happen too often, take precaution\nLiars and frauds got you exhausted\nYou've been accosted\nWho told you I'd lost it?\nI just put it down for a second, damn\nCan the king lounge for a second, kick his hooves up?\nGrow stubble on the face for once without a smooth cut?\nGrow a little gut, can't even enjoy the fruit of my labor\nBefore they call me Luke and hand me my lightsaber\nThe ruler's back, you can tell by the trumpets\nPrince of Wales sent me tea, biscuits, crumpets\nJewelry cost more than the car, car cost 200\nGet out your chair, the season of Nasir\n\n[Hook]\n(Da-da-da-da-da\nDa-da-da-da-da)\nThe season\n(Da-da-da-da-da\nDa-da-da-da-da)\nThis is the season\n(Da-da-da-da-da\nDa-da-da-da-da)\nThe season\n(Da-da-da-da-da\nDa-da-da-da-da)\n\n[Verse 2]\nJay Elec doesn't write it\nHOV couldn't write it, he vacationin'\nJungle the only brother I take shit from\nHassan give me lines, we talk all the time\nSo I guess if he inspired my song it ain't mine\nLet me make this clear, they fear the gifted\nSome say Shakespeare never existed\nWow, now, look at the amount of resistance\nAttempts to chisel my face, from the mountain you guessed it\nBitch you guessed it\nThere, did I answer your questions?\nSo, now that's out the way let's get back to my message\nNow I'm 40 and a little change\nRide around, sport a new Benz, a little Range\nHavin' fun, my little man gettin' big\nHe and my daughter down, when we talk it's real\nNothin' is watered down, young boy swag\nI'm here today as well as the 90's\nBut the past, like my ass, is behind me\nIgnite the pyrex\nTry to bite this, get Nasty Nas-itis\nArthritis when you try to write this\nAsking why is the Feds at my niggas?\nWhy the Feds at my niggas?\nI know by now I should be talkin' bread, crack, and figures\nBut not stressin', knot stressin'\nI'm survivin', I'm survivin'\nIt's funny when I catch cops textin' and drivin'\nWho questions and penalizes them?\nOne day we'll have their ass in court and we'll be tryin' them\nHey yo, it's love for Detroit, Mo-Town, Motor City\nDilla lives on, it's like he wrote it with me\nThe soulful sample complements my rhyme so well\nSlacks by Zegna, or YSL\nMatchin' the Saint Laurents, I'm fly as hell\nHands in the air, the season of Nasir\n\n[Hook]\n(Da-da-da-da-da\nDa-da-da-da-da)\nThe season\n(Da-da-da-da-da\nDa-da-da-da-da)\nThis is the season\n(Da-da-da-da-da\nDa-da-da-da-da)\nThe season\n(Da-da-da-da-da\nDa-da-da-da-da)\n\n[Outro]\nYeah, it's that time, yeah, Dilla rest in peace, what up Detroit?\nFly ladies, dope dealers and killers\nWorldwide, NY\nYeah, yeah, the season\nYeah, this is the season...", "image": "https://images.rapgenius.com/a8658e7706fe81154dc6635697b1c494.612x611x1.png"}], "artist": "Nas"}