{"songs": [{"title": "On Creative Frustration", "album": "Kanye West’s Visionary Streams of Consciousness", "year": "2014-02-26", "lyrics": "[Meyers]: Fashion is obviously very important to you. You’re designing again, in fashion. Tell me, what’s the difference in how you approach fashion to how you approach music? Is it similar, is it completely different?\n\n[West]: Everything in the world is exactly the same.\n\n[Meyers]: Alright, great. I don’t think we’re done but I think I’m going to sign off.\n\n[West]: Meaning like, you can do comparable people like - who would you compare Daniel Day-Lewis or Phillip Seymour Hoffman to musically, or in fashion, directing, architecturally? Who was your favorite teacher when you were growing up? It’s certain people that when - that teacher when you’re in eighth grade, that this person really cared and you knew this person cared about you as a student and gave everything they had and they were meant to do that. It’s other people that were just like getting a check or something. It’s all the same. You know, for me I give you paintings, sonic paintings. I have synesthesia; I can see sound in front of me. So, when I want to do fashion, I just want to give you sculptures. So it’s like Michelangelo; the church wanted him to paint, and he just wanted to do sculptures. So the hard – the difficult thing for me that everyone doesn’t understand, I just want to be able to use marble and make sculptures. But, due to the fact that I’m a celebrity, all these different things they’re like “no, you can’t do this, you have to do this kind of line.”\n\nSo, it’s kind of the first of its kind so that’s the reason why there’s been a lot of confusion as to why I want to do it, to why is he getting so frustrated about it. It’s like: why don’t you just do music? It’s an overall creative expression. Like I have a friend, Yves Béhar, that designed the Jawbone wristband and stuff, and the Jambox and everything. As a designer, you know, he's not in a box to only design, you know, a speaker. He can design whatever he wants and I'm like, that's the type of creative expression and freedom any creative, you know, wants.\n\nAnd as, you know, get really successful at one thing you start to grow, and you're like - you feel like you can do more things, and your shoe starts to get a little bit tight, and you do everything you can to get a bigger shoe so you can walk further and run faster. And people are like now in this day and age, if you don't believe it, it's like they're like \"No, Kanye, you can't run faster. This is the limit that was made. This is the walls that Michael Jackson broke down for you, and Jay Z and Russell Simmons broke down for you. This is the end of it. So I'm in the process, 2013 all of the controversy about why - I'm in the process of breaking down walls that people will understand 10 years from now - 20 years from now.", "image": "https://images.genius.com/9fa6626ebb7cecda3ba692c1c80f52bf.1000x664x1.jpg"}], "artist": "Kanye West"}