{"songs": [{"title": "2 Tears In A Bucket", "album": null, "year": null, "lyrics": "[Sheek]\nSoon as I cop the nine, I pop the nine\nWhen I take it out the box, I represent Lox\nNow when I flow, you hit the rewind button\nSo I charge out more, want it all at the door\nFuck heat, Sheek walk around with an oven\nWho you gonna kill with that little Foreman grill?\nHow it's gon' look when I come through your block?\nSheek, Funk Doc, Meth on top\nPorsche, 300 horse fly by, back open pumpin How High (How High)\nYeah, can y'all see that (See that)\nBitch you can call me what you want, ''cause I'll Be Dat (Be Dat)\nGet off my dick, I don't care about no jewels\nLong as the condo's paid and the truck I choose\nI'm tellin y'all niggas, if it's not double R\nI'ma spell my name out on the side of your car\n\nChorus:\nCome and Ruff Ryde with us\nIf you wanna get high with us\nIf you wanna get down with us\nCome on nooooowwwww\nCome and Ruff Ryde with us\nIf you wanna get high with us\nIf you wanna get down with us\nCome on nooooowwwww\n\n[Redman]\nI got a twin cam exhaust connected to the jaw\nA five speed clutch on my paw when I ride\nI glow like the pegs in Lite-Brite\n3000 bolts of lightening when fly the right kite\nMe and Meth be hennesey, two ice cubes\nWe can draw (Choose your weapons) or do I choose?\nWhen I choose the grip, one shot lose your hip\nI hope your shoes fit for this move and pick\nMy avalanche it came with, ten feet of snow\nI'm cold blooded, my fam half eskimo\nMy flows move like endo\nTurn ten nickels into ten loads, outta ten stoves\nRide the crash course, do the math on it\nSwizz Beats you can ride Amtrak on it\nBut I'm on it, grillin with George Foreman\nYa peeps is at the Grammy awards cornin\nThe ice, the fat wallet son, I won it\nIn the helicopter, warmin before morning\nDef Jam nigga, Redman nigga, Doc\nFuck ya momma on my sweat band nigga\nYou tough guys will get smacked in the club\nWith the gun I bought from Mack in the club\nIts P-P-P from Bricks to Brook-nam (Come on)\nBring me some more ass to whoop on\n\nChorus\n\n[Method Man]\nLook what the cat dragged in\nUnderground dweller from the cellar bring terror\nScoop of high yellow cinderella, Meth forever\nNever rush a rhyme, hook could never bust my nine\nBut if I have to, I have to, it's all in the mind\nI stay ahead of time while y'all fallin behind\nTryin to relight ya lime, it's a crime when I drop ??? design\nThat tick it, tick boom, blow your mind\nYeah me, M-E-T, H, the O, the D\nCan't be done like tryin to find a penny in the sea\nNigga run for cover son go and get them guns\nY'all ain't from here, don't try to come around and gettin ones\nSwizz Beat the track in the head, but I instead\nPull my ?dart gun? and bust sixteen until it's dead\nI'm the game, all of my dogs be off the chain\nYellin Wu-Tang, Wu-Tang\n\nChorus", "image": "https://images.genius.com/09bed7d894b68c251538868d4a34b7f8.1000x1000x1.jpg"}], "artist": "Redman"}