{"songs": [{"title": "Stanley Kubrick", "album": "A.I.R. (Art Imitates Reality)", "year": "2016-08-29", "lyrics": "[Intro]\nI have two brief questions I'd like to ask, if I may\nWhen you were carrying out that incredible moonwalk\nDid you find that the surface was equally firm anywhere\nOr were there harder and softer spots that you could detect?\nAnd secondly, when you looked up at the sky could you actually See the stars, and the Solar Corona, in spite of the glare?\n\nWe were never able to see stars from the lunar surface\nOr on the daylight side of the moon\nBut I - without looking through the optics, uh\nI don't recall during the period of time that we were\nPhotographing the Solar Corona what stars we could see\n(I don't remember seeing any)\n\n[Hook]\nGiant steps are what you take, walking on the moon\nI hope my legs don't break, walking on\nWalking on the moon\n\n[Verse 1]\nB.o.B, what the hell you doing?\nWhat the fuck does Stanley Kubrick have to do with\nAstronauts and moon men\nWho the hell you fooling?\nFuck you and this whole stupid flat Earth movement\nWell, if you don't like it sue me, even science proves it\nYou're a college student, shouldn't be assuming\nGreen screen, sound stage, sound proofing\nTime to film a movie shoot\nGotta use my tools in the glass case\nAstronaut suit footprint don't match the boot\nBeen to the moon once and ain't been back since\nAnd I'm just trying to figure out where the tax dollars went\nNASA\n\n[Hook]\nGiant steps are what you take, walking on the moon\nI hope my legs don't break, walking on\nWalking on the moon\n\n[Verse 2]\nNot a huge fan of the award for the best rapper\nBut they give the moon man award to the best actor\nGuess we must go straight to the source and let's ask NASA\nUh, how do you explain the occurrence of lunar waves?\nWhy do we only see one half of the lunar face?\nHow do you explain air bubbles you view in space?\nWhy is it so important to lie to the human race?\nMillion mile internet that travels light years\nBut they can't show a space shuttle re-enter the atmosphere, okay\nTo blast off you gotta practice Freemasonry\nAn acronym that stands for Not A Space Agency\n\n[Hook: B.o.B]\nGiant steps are what you take, walking on the moon\nI hope my legs don't break, walking on\nWalking on the moon\n\nSome may say, I'm wishing my days away, no way\nAnd if it's the price I pay, some say\nTomorrow's another day, you'll stay\nWalking on, walking on the moon", "image": "https://images.genius.com/5c49104d5de1bbfefcb27959d392d8c4.1000x1000x1.jpg"}], "artist": "B.o.B"}