{"songs": [{"title": "Rain Man", "album": "Encore", "year": "2004-11-12", "lyrics": "[Intro]\nYeah\nDefinitely, definitely\nDefinitely dope\nDefinitely\nDefinitely K-Mart\nYeah, yeah\n\n[Verse 1]\nYou find me offensive\nI find you offensive for finding me offensive\nHence, if I should draw out or line any fences\nIf so, to what extents if any should I go\n'Cause it's getting expensive\nBeing on the other side of the courtroom on the defensive\nThey say I cause extensive\nPsychological nerve damage to the brain\nWhen I go to lengths this far at other people's expenses\nI say you're all just too goddamn sensitive\nIt's censorship and it's downright blasphemous\nLet's end this shit now 'cause I won't stand for this\nAnd Christopher Reeves won't sit for this neither\nAnd let's clear this up too, I ain't got no beef with him either\nHe used to be like a hero to me, I even believe I\nHad one of those 25 cent stickers on my refrigerator\nRight next to Darth Vader\nAnd Darth must've put a hex on him for later\nI feel like it's my fault 'cause of the way that\nI stuck him up in between him and Lex Luthor\nI killed Superman, I killed Superman\nAnd how ironic\nThat I'd be the bad guy, kryptonite, the green chronic\n\n[Chorus]\n'Cause I ain't got no legs\nOr no brain\nNice to meet you\nHi, my name is...\nI forgot my name\n\nMy aim was not to become what I became\nWith this level of fame\nMy soul is possessed by this devil\nMy new name is Rain Man\n\n[Verse 2]\nNow in the bible, it says\nThou shalt not watch two lesbians in bed\nHave homosexual sex\nUnless of course you were given the consent to join in\nThen of course it's intercourse and it's bisexual sex\nWhich isn't as bad\nAs long as you show some remorse for your actions\nEither before, during, or after\nPerforming the act of that which\nIs normally referred to as such more commonly known phrases\nThat are more used by today's kids in a more derogatory way\nBut who's to say what's fair to say and what not to say?\nLet's ask Dr. Dre\nDr. Dre (What up?)\nI got a question if I may (Yeah)\nIs it gay to play putt-putt golf with a friend (Yeah)\nAnd watch his butt butt when he tees off (Yeah)\nBut, but, I ain't done yet\nIn football the quarterback yells out hut-hut\nWhile he reaches in another grown man's ass\nGrabs on his nuts but just what if\nIt was never meant, it was just an accident\nBut he tripped, fell, slipped, and his penis went in\nHis teeny tiny little round hiney and he didn't mean it\nBut his little weenie flinched just a little bit\nAnd I don't need to go into any more details, but\nWhat if he pictured it as a female's butt\nIs that gay? I just need to clear things up\n'Til then, I'll just walk around with a manly strut because\n\n[Chorus]\n'Cause I ain't got no legs\nOr no brain\nNice to meet you\nHi, my name is...\nI forgot my name\n\nMy aim was not to become what I became\nWith this level of fame\nMy soul is possessed by this devil\nMy new name is Rain Man\n\n[Verse 3]\nYou find me offensive, I find you offensive\nShit this is the same verse, I just did this\nWhen am I gonna come to my good senses?\nProbably the day Bush comes to my defenses\nMy spider sense is telling me Spider-Man is nearby\nAnd my plan is to get him next\nAnd open up a whoop ass canister\nGoddammit Dre, where's the goddamn beat? (Yeah)\nAnyway, anyway, I don't know how else to put it\nThis is the only thing that I'm good at\nI am the bad guy, kryptonite, the green chronic\nDemonic, yup, yup, don't worry, I'm on it\nI got it, high-five Nick Lachey\nStuck a pin in Jessica's head and walked away\nAnd as she flew around the room like a balloon\nI grabbed the last can of chicken tuna out the trash can\nAnd zoom, I headed straight back to the Neverland Ranch\nWith a peanut butter jelly chicken tuna sandwich\nAnd I don't even gotta make no goddamn sense\nI just did a whole song and I didn't say shit\n\n[Chorus]\n'Cause I ain't got no legs\nOr no brain\nNice to meet you\nHi, my name is...\nI forgot my name\n\nMy aim was not to become what I became\nWith this level of fame\nMy soul is possessed by this devil\nMy new name is Rain Man\n\n[Outro]\n'Cause...\nYup, Rain Man\nDefinitely, definitely Dr. Dre\nSuper dope beat maker\n2000, 2400 and 87 million, 900 and se-73,400 and 63... and 70\nYeah", "image": "https://images.genius.com/e76120b9dd2c0af6f1b3f8d3dcbe11d2.1000x1000x1.jpg"}], "artist": "Eminem"}