{"songs": [{"title": "Once an Addict (Interlude)", "album": "KOD", "year": "2018-04-20", "lyrics": "[Intro]\nRight, right, right, right\nSomething's got a hold on me\nRight, right, right, right\nSometimes I think pain is just a lack of understanding\nIf we could only understand it all, would we feel no pain?\nGod must feel no pain\nSomething's got a hold on me\nOnly joy\nDoes this mean even our suffering pleases him?\n\n[Verse]\nLost in a cloud of marijuana\nYoung Carolina nigga, fish out of water\nStep-daddy just had a daughter with another woman\nMama ain't recover yet\nCallin' me at 12 at night\nShe drunk as fuck and I'm upset\n'Cause why she always using me for crutch?\nGrowin' up I used to always see her up\nLate as shit, cigarette smoke and greatest hits from Marvin Gaye\nShe kill a whole bottle of some cheap chardonnay\nI gotta leave this house 'cause part of me dies when I see her like this\nToo young to deal with pain\nI'd rather run the streets than see her kill herself\nSo 'Ville became my escape from a feelin' I hate\nMama cursing me out\nDepression's such a villainous state\nI used to stay out later on purpose\nSubconsciously I was nervous that if I came home early then what would surface was her inner demons\nAnd then I'd have to end up seein' my hero on ground zero\nTears flow while Al Green blow\nLove and happiness\nI wish that I could say the right words to cheer her up\nI wish her son's love was enough\nI tell her, \"Mama, go to sleep\"\nShe tell me \"Boy, hush. You better pray to God you never get your heart crushed\"\nI shake my head in frustration\nHead to my room and I can still hear the tunes with my door shut\nFuck it though, a couple more months I'll be gone\nOff to college and dorms\nFoolin' myself, thinkin' problems are gone\nBut now it's 1 AM and my mama dialin' my phone\nI know she intoxicated and soon this high that I'm on comes crashin' down\nShe lit, talkin' drunk shit, I'm pissed\nBut I'm still all ears like Basset Hounds\nThinkin' to myself, \"Maybe my mama need help\nDon't she got work in the morning?\nWhy she do this to herself?\nHate how she slurrin' her words\nSoundin' so fuckin' absurd\nThis ain't the woman I know, why I just sit and observe?\nWhy don't I say how I feel?\nWhen I do, she's defensive for real\nWell maybe things get better with time, I heard it heals\nLittle did I know how deep her sadness would go\nLookin' back, I wish I woulda did more instead of runnin'\n\n[Outro]\nSomething's got a hold on me\nI can't let it go\nOut of fear I won't be free\nSomething's got a hold on me\nI can't let it go\nOut of fear I won't be—\nNo!\nSomething's got a hold on me\nI can't let it go\nRight\nLife can bring much pain\nThere are many ways to deal with this pain (right)\nChoose wisely (right)", "image": "https://images.genius.com/b25da0e24e4501069a3362b517ef0516.1000x1000x1.jpg"}], "artist": "J. Cole"}