{"songs": [{"title": "Iron Maiden", "album": "Ironman", "year": "1996-10-29", "lyrics": "[Intro]\n[Kid #1]: What you doing on our turf punk?\n[Kid #2]: I got a message for Smokey\n[Kid #1]: Give it\n[Kid #2]: You Smokey, man?\n[Kid #1]: Give it!\n[Kid #2]: If you ain't Smokey it ain't your motherfucking message\n[Kid #1]: Motherfucker, I said give me the message!\n[Kid #2]: It's from Willie, in the slam\n[Kid #3]: Nigga, you been busted?\n[Kid #2]: Yeah, the man picked me up\n[Kid #3]: Well, I ain't got no fucking time to play with you. Now Give me the message\n[Kid #2]: Willie's in Warwick - doing one to three. Told me to tell y'all motherfucking to keep cool. He be out one way or another, quick. Maybe I can stick around for a while?\n[Kid #3]: No that's out man! You know. What could we The lords do with a punk like you!?\n[Kid #2]: Kiss my ass, motherfucker\n[Kid #4]: Burn him!\n[Kid #2]: Just me and you, motherfucker, just me and you! I put trademarks around your fucking eye!\n\n[Verse 1: Raekwon]\nYo, Gambino niggas who swipe theirs\nDeluxe rap cavaliers\nMidgets who steal beers, give 'em theirs\nSit back jollyin'\nMy team be gaming like Three-card Molly and\nDrug Somalians pollying\nMittens raps they crocheting\nA-yo Iron, these niggas portraying\nBut haven't been paying\nFor real, slide on these niggas like a fresh pair\nCaesar fade style, usually tuck grenade\nThrow a blade, fuck getting laid\nGuzzle this shit like Gatorade\nDay to day Wallies half leather, half-suede\nConnecting with the high stylist, dun\nLight up a chalice\nI run with nothing but the wildest, foulest\nCome on now, long-dick style\nNiggas on the hit out, ay yo Iron bite my shit out\nEventually, bust a rap gun mentally\nBeen doing this a century kid, just meant to be\nGet on your knees and bless me with a gem in the Caribbean\nSkiin' off white BM\nSnatch Canadian cream with Scandinavians\nPalladium style, play it like thirty-two Arabians\nThe greatest lesson is don't owe, you might get stole on\nWhen I go bury me with velour on\n\n[They come to me, and understand, just let me get mines first. Then after I\nGet mines, y'all can do what y'all wanna do. Fuck 'em up bad]\n\n[Verse 2: Ghostface]\n'Sho 'nuff, hit the Bank and thrust\nWu Nauticas Jamie Sommer got trained on the tour bus\nWe upgrade, swallow raw eggs, read the label\nHitting white-label, left the Winnebago unstable\nSmooth sailing, walked in, my Earth start kneeling\nStarted stealing, I'm too ill, see we're grilling at the parlay\nKicked up, mack, max motion\nMichael Bolton magazine quote, I'm too potent\nLouisville mix pain kill rap\nFuck benadryl the violin in 'Knowledge God' sounded ill\nTremendously obnoxious, no blotches\nMy telephone watch'll leave bartenders topless\nDead arm the prosecutor, smack the juror\nMe and my girl'll run like Luke and Laura\nWe sit back on Malayan islands\nSipping mixed drinks out of broke coconut bowls, we wilding\n\n[Chorus: Raekwon]\nSit back jollyin' (ah-ha, ah-ha, ah-ha, ah-ha)\nSit back jollyin' (ah-ha, ah-ha, ah-ha, ah-ha)\nSit back jollyin'\nMy team be gamin' like three card Rolly an'\nDrug Somalians pollyin'\nSit back jollyin'\nMy team be gamin' like three card Rolly an'\nDrug Somalians pollyin'\nSit back\n\n[Verse 3: Cappadonna]\nDeep meditation sound orientated, war the blizzard\nRap paramedical the wizard\nCappadonna, never catering to none\nMy microphone and three verse weigh a ton of slaughter\nYou order five thousand back across the water\nMy laboratory story keep me flowing with the glory\nAcapella or deep dirty instrumental\nI could blow the sky like the stormy wind blew\nOne gallon of wilding, Park Hill profiling\nI cut your face a Buck 50 sure why you smiling?\nFor violating my position\nI leave you smoked like a crackhead on a mission\nTwo tokes of mic dope, one stroke of elegance\nRated like the movie graphic told intelligence\nPerson to person, it'd be hard for you to take a trophy\nYou better off to get somebody out to try to smoke me\nCause I'm PLO TKO every day\nDancehall General, Party Fanatic Colonel\nCappadonna son'a old school Disco Inferno\nVeteran for rapping with the new set of Wu the hard rapping\nNinety-six jive, I keep the live crowd clapping\nWhen I bow, all praises due to Staten Isle\nI spark the mic and Shaolin spark the methtical\nEvery evening, I have a by myself meeting\nThinking who's gonna be the next to catch a beating\nFrom my mental slanging, bitching rap twist the point of warfare\nI brutalize, all competition catch hell here\nChance him, that's what they said, threw up a ransom\nI jacked it, stripped the beat naked and packed it\nGimme my rewards\n\n[Outro]\n[The way I, the way I wanna get 'em. I want 'em gotten. I want 'em layin'\nOut. I want 'em gotten. Cause niggas need to be got. He need to be\nTaken off of here. That's right.]", "image": "https://images.genius.com/86aaa4a25c81fd34a671c2db7083cc80.800x800x1.jpg"}], "artist": "Ghostface Killah"}