{"songs": [{"title": "Black Magic", "album": null, "year": null, "lyrics": "Poof, there go the car\nPoof, there go the crib\nPoof, a hundred mill\nWoop, David Copperfield\nDavid Copperfield, David Copperfield\n\nPoof, there go the car\nPoof, there go the crib\nPoof, a hundred mill\nWoop, David Copperfield\nDavid Copperfield, David Copperfield\n\nCould you knock that hoe? Could you blame that bitch?\n'Cause you wanna roll with a real nigga like me\nThen go and suck that dick like hoe to a fiend\nFuck throat when I lean, take long on a purp\n\nMad hoe on the beam, still money over these hoes\nGot YSL on my clothes and blood drip on my sneakers\nNigga, you hating on me, she chose\nAnd I ain't fuck your girl, she role\n\nMy stick shift, she drove did everything that she 'pose\nI pull my camera out and she posed\nAnd I was like goddamn, drop that, pop that\nGot the top back, on a drop back, I'm back\n\nIn a Glock, where the crotch at? I'm strapped where the rocks at?\nWhere the watch at? Stop that, you got that, got that\nGot racks, y'all niggas ain't about that, about that life\n\nPoof, there go the car\nPoof, there go the crib\nPoof, a hundred mill\nWoop, David Copperfield\nDavid Copperfield, David Copperfield\n\nPoof, there go the car\nPoof, there go the crib\nPoof, a hundred mill\nWoop, David Copperfield\nDavid Copperfield, David Copperfield\n\nPoof, niggas fuck your life, fuck y'all niggas and fuck your wife\nGot two bad bitches with a nigga and they ain't know\nThey gonna fuck all night and I rock hard white\n\nNiggas, wrist game pride, I pull up on the horse\nAnd I'm sitting on fours in a big boy drive\nCall big boy shot, all clear stones in my big boy watch\nAll year long got the strip on lock\n\nEvery time we in this bitch, man, she ain't gonna pop\nMy hip on Glock, your hip on nothing\nMy niggas got racks, your niggas be frontin'\n\nRed Cartier, red bone bitch, red bottoms on her\nHair long as shit, hold up, yellow gold rub, yellow bone hoe\nAnd yellow bottoms, it's paid, nigga, hoe, I'm made niggas\n\nPoof, there go the car\nPoof, there go the crib\nPoof, a hundred mill\nWoop, David Copperfield\nDavid Copperfield, David Copperfield\n\nPoof, there go the car\nPoof, there go the crib\nPoof, a hundred mill\nWoop, David Copperfield\nDavid Copperfield, David Copperfield", "image": "https://images.genius.com/6929169de7116d41676151bdea5cc773.1000x1000x1.jpg"}], "artist": "Meek Mill"}