{"songs": [{"title": "Tweets on Tidal’s Status", "album": null, "year": "2015-04-26", "lyrics": "Stream of consciousness coming in 5, 4, 3, 2… #TidalFacts\n\n— Mr. Carter (@S_C_) April 26, 2015\n\nTidal is doing just fine. We have over 770,000 subs. We have been in business less than one month. #TidalFacts\n\n— Mr. Carter (@S_C_) April 26, 2015\n\nThe iTunes Store wasn't built in a day. It took Spotify 9 years to be successful…\n\n— Mr. Carter (@S_C_) April 26, 2015\nWe are here for the long haul. Please give us a chance to grow & get better. #TidalFacts\n\n— Mr. Carter (@S_C_) April 26, 2015\nThere are many big companies that are spending millions on a smear campaign. We are not anti-anyone, we are pro-artist & fan. #TidalFacts\n\n— Mr. Carter (@S_C_) April 26, 2015\nWe made Tidal for fans. We have more than just music. We have video, exclusive concerts, tickets for events early, live sports!...\n\n— Mr. Carter (@S_C_) April 26, 2015\n….Tidal is where artists can give their fans more without the middlemen. #TidalFacts\n\n— Mr. Carter (@S_C_) April 26, 2015\n\nIndie artists who want to work directly w/ us keep 100% of their music. \"If you don't want the CEOs all in the videos\" haa #tidalfacts\n\n— Mr. Carter (@S_C_) April 26, 2015\nTidal pays 75% royalty rate to ALL artists, writers and producers - not just the founding members on stage\n\n— Mr. Carter (@S_C_) April 26, 2015\nRich getting richer? Equity values... YouTube $390 billion. Apple $760 billion. Spotify $8 billion. Tidal $60 million. #TidalFacts\n\n— Mr. Carter (@S_C_) April 26, 2015\nMy cousin just moved to Nigeria to discover new talent. Tidal is a global company\n\n— Mr. Carter (@S_C_) April 26, 2015\nWe have Tidal X - it supports artists by giving them a platform to connect with their most loyal fans. Tidal is for all. #Tidalfacts\n\n— Mr. Carter (@S_C_) April 26, 2015\nOur actions will speak louder than words. We made Tidal to bring people the best experiences...\n\n— Mr. Carter (@S_C_) April 26, 2015\nAnd to help artists give that to their fans over and over again…\n\n— Mr. Carter (@S_C_) April 26, 2015\nWe are human (even Daft Punk ha). We aren't perfect - but we are determined. #TidalFacts\n\n— Mr. Carter (@S_C_) April 26, 2015", "image": "https://images.genius.com/bf0f68ee56f29c8542ad805c6419682b.676x676x1.jpg"}], "artist": "JAY-Z"}