{"songs": [{"title": "R.A.G.U.", "album": "Fishscale", "year": "2006-03-28", "lyrics": "[Intro]\nHolllllllld it!\nNow you get out of here, I'm warning you\n(You bastards can't push us around - wanna fight?)\nI'll take you on\n\n[Raekwon]\nThat nigga's twisted\nStop playin with that clip man\nClose them fuckin blinds too man, y'knahmsayin?\nYo Don my man, get out of the stove man\nGet away from the stove nigga\nStop playin man, the fuck is you talkin 'bout?\n\n(Verse One: Raekwon)\nI'm in the crib watchin Larry King Live, the new Guccis on\nRefrigerator, smokin some kush, this nigga's a lighter\nSwisher, becoming a roach, go get the glass ashtray\nPour the glass of Cru, tap the bottle then toast\nBarrie took a sip for the cause, yeah my son\nSoon to be 3, tried to fill his bottle then run\nThen I got a collect call, heard niggas down the block is fighting\nSome nigga got knifed up brawling\nHeard the kid was 19, Little Infiniti too\nHis father worked up at the dealer he love Wu\nThey tried him for his Louis', son wasn't having it though\nYeah, yeah my nigga, the color of glue\nDecided i'mma intervene, guess who tried to wild on me my nigga\nThis is like out of the blue\nI'm in the Range stretch, jumped out, tucked the chain\nProceeded to talk to him, then you heard the heavy face slap\nThink I broke my wrist, now I'm at the hospital vexed\nFucked up my writing hand, that's my check\nNow I wanna kill this little nigga true\nOnly thing that stop my gun flaming cause he related to you\n\n[Ghostface Killah]\nWho? He ain't related to me\nJust that I knew him for like 18 years until he violated, stealing my gear\nIf my lil' homey, yo he eat anything for me\nSend him uptown, he get bagged, yo he never call me\nCome home and still blow cats for me\nPump crack, stabbing all them hoodrat shorties\nA live gunslinger well known, born to dance\nWhen the heat is on, Stapleton days, shot himself in the groin\nThe gun went off, it looked like a flick\nWhen he fell to the floor, holding his nuts, screaming \"God damnit\nShit I put one in my balls, what the fuck y'all looking at me for?\nCall the police, do something\nMotherfuckers standing around, watch when I get better\nAll hell's gonna be terror\nDeath to you, you,\" he pointed at Red\nI said chill, that's fam duke\nHe put real work in that make you puke, fuck that\nBut anyway son indeed, he stole two Polo rugbies\nSwore to his dead mother, I couldn't take it\nYo Lord I knocked out his teeth\nNow he's rocking those false joints like everything's peace", "image": "https://images.genius.com/61b48fa7fe972c473dc1c20c9489e45f.1000x1000x1.jpg"}], "artist": "Ghostface Killah"}