{"songs": [{"title": "Get In Where You Fit In (Video Version)", "album": null, "year": null, "lyrics": "[Verse 1: Too $hort]\nA lot of people try to be what they can't be\nAnd when you be like that you just can't see\nWhat life is all about\nPut a roof on your head, put some food on your mouth\n'Cause in the long [?] you got nothin' to prove\nLife to me is like funkin' a groove\nYou gotta get right in where you belong\nFind the right mix, and write a song\nAnd don't try to stand all out\nFrontin' on them young girls, runnin' yo mouth\nYou gotta; get yo money on all the time\nAlthought you put two 11's on bust them rhymes\nYou gotta hustle, to get every dime you can\n'Cause it's hard on a black man\nNow how many punks try to come to the hood\nHang around and try to get in good\nHow many unemployed bitshots do you know?\nHow many pimps ain't got no hoes?\nYou said \"Baby must be rich\", 'cause she looked it\nWhen outside she was ridin' in a bucket\nWith two kids in the welfare check\nFat bank, roll the food stank, you know what's next\nLet's have sex, I rather do it by myself\n[?]\n\n[Verse 2: Father Dom]\nAnd I just squeeze up\nGrab the microphone, another freeze up\nIn case you didn't know, we got skeezas\nReady to just please us, oh Jesus\n(You know they need us)\nWith the dib-dib-dab man, pimpin' is a hobby\nGot a boat float of girls downstairs\nAnd a lobby and you can't be actin' sobby, we ain't havin' that\nSo pour some Gin over ice, she's feelin' nice so we doin' that\nI'm steppin' over to a smooth lead\nThe way I'm kickin' this game, my nickname should be Bruce Lee\nI'm in [?], sayin' what she wanna hear\nMy breath's fully loaded with chronic and beer\nBut oh wait, I really should redeeme myself\nBut see, I'm stuck on [?] like a [?]\nSee, um, I got the cash but the money ain't nothin'\nSee, I gets respects from the rhymes I be bustin'\nAnd if you got a question we can settle it like [?]\nBut if not, my homies goin' in this penaltin'\nAnd pullin' out a big fat cannon\nAnd if you wanna run, [?] tripped to [?]\nSo act like you know when we flow\nAll we really wanna know is can you get in where you fit in?\nAnd I pretendin'\nSo all you fakestas jams for you\nSo $hort Dogg and my end: (you know it do)\n\n[Verse 2: Too $hort]\nGet in where you fit in, fool\nYou was a mark up at the high school\nNow you're hardcore like CB4\nBiting, what you wanna be me for?\nIt's your life, you wish it was a Too $hort rap\nBut you gots no game, and your bass ain't fat\nYou need to quit, rapping just ain't your place\nSo back on the grind and don't catch no case\nYou just silly, that's what you always be\nLike them young female that try to get with me\nI run all up in it but this ain't no race\nI (censored) right in her face\nYou probably wine her and dine her\nAnd get jealous when you can't find her\nYou're nothing but a mark\nI bet you get your ass kicked hanging at the park, punk!\nYou better watch your back\nBefore you get jacked by a gangsta with a gat\nCause Life is Too $hort, I'm In the House like that\nShorty the Pimp, was Born to Mack\nAnd I don't stop rapping, one thing I never do\nIs stop making this funky-ass beats to ride to\nAnd other rap crews can see\nDangerous Crew got the funky beats\nSo when I see ya, and act like I don't know ya\nI'm like Missouri, cause I can show ya\nWhy is my beat so funky it stanks?\nPee Wee, Shorty B, and Ant Banks\nYou outta pocket trying to hang with my crew\nYou might of just learned, but it ain't that new\nWhat happened to your funk, did you lose it?\nOr did you get ganked by Dangerous Music?\nWe stole all your money, and all your songs\nDid you like a tramp and then sent you back home\nOne punk came and went\nHad to fire, yo, but I'm still a pimp\n(MC) Lawrence (The fake gangsta)\nWould've never came up without the Bad-Ass Banksta (you little punk)\nNow he's gonna play on out ('Cause he's a mark)\nHad to put his fat foot in his mouth (You fat trick)\nQuick to say \"I'm sorry\" when you're funny\nY'all can have him, cause Dangerous don't want him\nCan tell a lie almost every other minute\nI'm like Bennett, I ain't in it\nGo on with your reject rap attack\nYou'll get more from a prize in a Cracker Jack\nAnd since Banks said he can't have no more funk (Hell naw)\nGet in where you fit in, punk\n\n[Outro: Too $hort and (Ant Banks)]\nAh, no, did I get him, did I get him?\nWait! (Yeah you got him) It's the end??\n(Yeah, it's cool right there)\nIt don't end right there, it didn't use to end right there", "image": "https://images.genius.com/0bcdb39cf102b027f7ca02cc06830a6f.481x409x1.jpg"}], "artist": "Too $hort"}