{"songs": [{"title": "Peep Game", "album": "Strictly 4 My N.I.G.G.A.Z...", "year": "1993-02-16", "lyrics": "[Verse 1: 2Pac]\nSo what the fuck you talkin about?! Aw, shit\nGoody, goody, gumdrops\nNigga, get your hoodie and your gun cocked\nRock it till the drum stops, hip hop\nEven if my shit flip flop\nIt probably wouldn't stop, talk shit and get socked\nHow ya hang em?\nKnow a realer nigga? You could bring him\nIf I don't represent the shit, I'll kick it\nWe could sway him, hunh! As if I know ya\nThen I could show ya\nBut if I don't know, I gotta .44 fo' ya\nSo, so peep game, at point blank range\nThe fame can't change what the game maintains\nStrange! Went against the grain\nAw shit! Flick or no flick I trips for no bitch\nCatch up on your pimpin', I ain't simpin', I'm a diss her\nCouldn't be my sister if she's actin' like I missed her\nTell me why they, tell me why they, tell me why they play me\nDon't these niggas know that neither one of y'all can fade me\nI ain't big, I ain't buff, I ain't deisel\nBut fuck wit 2Pac and pop goes the weasel\nMe and Threat made a bet on how many fellas\nWould jock a mothafuckin' real nigga cause they jealous\nThey do it for the fame\nExplain, insane What's in a name? What's in a name?\nPeep game\n\n[Chorus: Deadly Threat]\nPunk bitch, how ya like me now?\nCan't fuck around wit the funky style\nPut it together like a puzzle builder\nIf Threat don't get cha, Pac gon' kill ya\n\n[Verse 2: Deadly Threat]\nKilla Cali\nThe state where they kill\nDown wit Oaktown? What's up homie, can I chill?\nThe bitches lookin funny\nFilm at elev,film at eleven wit they minds on they heaven\nWit they .357\n-Where you at?\n*On the freeway, leaving LA\n-OK, see you when get here loc\n*OK\n-Here I am. Here I am\n*Goddamn that was quick\n-Told ya I was comin. Who is that? Is that your woman?\n*Na, that's just a hoochie looking for some juice\n-What's up my nigga? What ya know? A nigga got a little bigger\nThat's all folks know\nFat gold ropes\nGotta keep a low key for my attack\nWhen I approach, I want the diamonds, the pearls\nThe round the way girls\nCuz baby got, baby got back out this world\nWould you give a fee? Never\nFly like a feather\nMake more money than your daddy and your mama put together\nThe game is to be sold, not to be told\nSo buy it\nCan't afford it?\nLow budget hoes gotta brother\nPeep game\n\n[Chorus: Deadly Threat]\nPunk bitch, how ya like me now?\nCan't fuck around wit the funky style\nPut it together like a puzzle builder\nIf Threat don't get cha, Pac gon' kill ya\n\n[Verse 3: Deadly Threat]\nDon't sell out\nGet the hell out\nCause here I come\nHit em with my bop gun\nThey came and they blast\nWe got witt they ass\nAnd oh, pop this vest and all the rest of that mess\nComin through like Terminater 2\nBoost your crew cuz we ain't afraid of you\nYou know what time it is wit me once the clock stike 3\nWe goin coo-coo for Cocoa Puffs. Whooo eeii!!!\n\n[Chorus: Deadly Threat]\nPunk bitch, how ya like me now?\nCan't fuck around wit the funky style\nPut it together like a puzzle builder\nIf Threat don't get cha, Pac gon' kill ya\n\n[Verse 4: 2Pac]\nTime to get paid, time to get paid, check\nTime to represent the west homie, nuttin' but a vest on me\nGot my hands on my Glock, eyes on the prize\nFirst sucka jump, first nigga die\nGimme mine, gimme mine, gimme mine like I told ya\nHard as a boulder\nMotha fuckin soulja\nBoom bam boom!! It's a stick up\nVice president Dan Quayle eat a dick up\nPeep game\n\n[Chorus: Deadly Threat]\nPunk bitch, how ya like me now?\nCan't fuck around wit the funky style\nPut it together like a puzzle builder\nIf Threat don't get cha, Pac gon' kill ya\n\n[Outro: 2Pac]\nPunk motha fucka\nFuck all those motha fuckas\nThey all can eat a mothafucking dick up\nWord up, fuck the police, I don't give a fuck\nBobcat in this mothafucka boy\nBig up! Big up! To the criminals\nFuck em\n\"This is serious business\"\nYeah, microphone mafia\n2Pac, Threat, Bobcat\n93 shot\nYeah nigga, bitch", "image": "https://images.genius.com/fb1da91ac989d8c57dfce412441800da.953x953x1.jpg"}], "artist": "2Pac"}