{"songs": [{"title": "It’s Murda", "album": null, "year": null, "lyrics": "[DMX:]\nURRRRRRR\nUh huh\nY'all motherfuckers ready or what?\nIs y'all motherfuckers ready or what?\nI don't think you are\nI don't think so!\n\nThey got my back against the building\nI'm the villian that's creeping around corners\nLike shorty you see them niggas reaping around, warn us\nUnless he coming through, gunning through, running through\nSo be careful what you do\nSee them slugs might come to you\nAs long as I can remeber, the streets have kept me safe\nAnd ever since that time in December, the heat's been in my waist\nI need an extra set of eyes so I keep my dogs with me\nDoctor says let them die till this fucking dog bit me\nI don't know what's wrong with me\nBut it seems like since you heard of us\nY'all niggas been wanting to murder us\n(?) the third of us\nStill against me\nAnd wanting to see me in the box\nGrilling me all crazy when you see me in the locks\nLeave you dead (red?) like fox\nAin't nothing funny about that\nI see you in a coma, ain't coming up out that\nYou hold on for too long and they ain't pulling the plug for you\nI'll run up in the joint myself and bust another slug for you\nIt's murda\nIt's murda motherfuckers\n\n[Jay-Z:]\nI take a squat then post up with the toast up\nI bring beef to a closure\nKnow somethin?\n(?)\nI'm loathesome\nI scream out fuck the world then I throw something\nNiggas scheming hard but fuck it, it's the god\nI leave bullets lodged leave you leaning on your broad\nAnd our punks leave you gagged up in your car\nSlumping Kennedy-style with your memory out\nWhat the fuck y'all want?\nDaddio with the calico\nLet the gaty blow leave you bleeding on your patio\nI leave rivals on their backs looking up at the sky blue\nNot only do I leave you I hide you\nI before you\nX and Ja-Rule\nDeath before the (sauna??) now and prior to\nBoss man spy on you\nConspire you\nMe die before you?\nYou liar, you\nNiggas is dead off the hits I improve\nFuck it, I got the feds who ain't buy it to\nY'all niggas don't listen\nWhen the streets are in prison\nWhen we find them we twist them\nThey fucking up missing\nY'all don't understand we want y'all all to hate it\nIt's murda\nMurder incorporated\nIt's murda\nIn crime we all related\nIt's murda\nSee if y'all can fake it\n\n[Ja-Rule:]\nI'ma murderer and murdering anything that moves\nThrough ya nine niggas\nStraight do or die niggas\nCaught up and fall victim to the worst shit\nX, Jigga, and Ja as expected\nShot on the world and reflect it\nNiggas don't respect it\nSo get it the worst way\nFuck with the wolves you get hunted like prey\nShot up in broad day\nNow everybody want you\nI'm feeling like: stupid didn't the inc. warn you the first time\nIt's murda\nWhenever you see blood\nIt's murda\nLay you down for the love\nThat's us\nLeave the lights on\nKnife through your windpipe\nCause most of your niggas ain't cut right\nYou thinking it's alright\nBut it ain't\nI'm paralyzing clowns up and down from the waist\nGiving niggas facelifts and taking it\nWhile making you bleed\nAnd if I got a taste of the shit I'm taking more than you need\nIt's nothing but love between me, you, and these slugs\nHit him up wrap his body up in (?) rug\nWho holding the heat?\nWho leaving niggas cold in the street?\nY'all know me, ya (?), Ja-Rule the O.G\nNiggas better watch me closely\nGet a grip, it's hennessy that fuels all that murdery shit\nWhen I look in the mirror my reflection is killer\nJigga, X, Ja niggas\nIt's murda", "image": "https://images.genius.com/1bcf43b1cc0f34db6cd70e1a63c8b84c.464x464x1.jpg"}], "artist": "DMX"}