{"songs": [{"title": "My Chain", "album": null, "year": "2012-08-13", "lyrics": "[Intro: Frank Sinatra]\nI would like to be remembered as a man who brought an innovation to popular singing\nI would like to be remembered as a man who had a wonderful time living his life and who had good friends, a fine family\n\n[Chorus]\nMy chain, my chain\nDon't you like my chain, mayne?\nLife of a don, chain just glowin'\nMy chain, my chain\nDon't you like my chain, mayne?\nI'm coming in the club with that fresh shit on\nMy chain, my chain\nDon't you like my chain, mayne?\nLife of a don, chain just glowin'\nMy chain, my chain\nDon't you like my chain, mayne?\nI'm coming in the club with that fresh shit on\n\n[Verse 1]\nYeah, me and my team used to dream about\nThe future but now we be rollin' everywhere we goin'\nOur cards never showin' the moment I'm flowin' we livin' it right now\nLong way from the ghetto\nPull strings like Gepetto poppin' that fine wine\nLook at the way my chain shine\nSoon as I change my state of mind, from a lazy ass boy\nTo a man that's on his grind so answer my question\nDid I even mention the fact that I'm livin' the life that I wanted\nI keep a hunnid, got cash in abundance, that's bills by the hunnid\nI've said it and done it, you know that I run it while everyone else\nSay it, then plummit now, yeah you know I run it now\nWhile the whole world wonder how\nMy chain shine nice\nBut I am not defined by the money, not defined by the ice\nWhat defines me, let me tell you what defines me\nIs the heart and the effort I give in e-every letter in which I write for you\nAnd if you ignorant closed minded motherfuckers do not like it\nIt's not right for you\nNo it's not right for you\n\n[Chorus]\nMy chain, my chain\nDon't you like my chain, mayne?\nLife of a don, chain just glowin'\nMy chain, my chain\nDon't you like my chain, mayne?\nI'm coming in the club with that fresh shit on\nMy chain, my chain\nDon't you like my chain, mayne?\nLife of a don, chain just glowin'\nMy chain, my chain\nDon't you like my chain, mayne?\nI'm coming in the club with that fresh shit on\n\n[Verse 2]\nYeah, I'm swimming in women like Young Sinatra 1 & 2\nWith the RattPack on my back there's really no telling what we finna do\nIf a shorty in my eye, then yes baby girl I be coming for you\nNice cars, nice clothes, hotel suites after the shows\nSo simplistic, never materialistic, but we do like complements\nWhy? 'Cause theses diamonds are accomplishments\nFood stamps, welfare, medicare and section 8 to\nLouis V, smoking tree, and steak up on my dinner plate\nAnd you wonder why us rappers floss, cause for once\nWe can finally afford the cost\nI once was the worker now I'm the boss\nSee my chain is an accomplishment\nI call these diamonds milestones\nIt's hard to call for help with no dial tone\nBut, now I'm buying whips with no motherfucking miles on 'em\nBut I don't blow my money, I give it back to people\nWhy these rappers spend money on blow and stop acting equal?\nBut I've been real since the fucking prequel\nSo the next time you that you looking at my chain\nWhat you really see is 23 long years of pain\nWith nothing to lose and everything to gain\nCause the world is divided, but we are the same\nAnd I'm getting that money, 'cause bitches they love me\nAnd this is the life that I live, ain't it funny\nBut Imma keep rising, til ya'll realizing, that so much is waiting over the horizon\n'Cause I've seen the day and yes also the night\nSo that means I've seen the darkness as well as the light\nAnd that's the very same light\nThat's the very same light, that let my chain shine bright\nSaid that's the very same light, that let my chain shine bright\nSo...\n\n[Chorus]\nMy chain, my chain\nDon't you like my chain, mayne?\nLife of a don, chain just glowin'\nMy chain, my chain\nDon't you like my chain, mayne?\nI'm coming in the club with that fresh shit on\nMy chain, my chain\nDon't you like my chain, mayne?\nLife of a don, chain just glowin'\nMy chain, my chain\nDon't you like my chain, mayne?\nI'm coming in the club with that fresh shit on\n\n[Outro]\nLogic\nOpen your eyes\nSinatra\nAnd I don't think i could ask for anything more", "image": "https://images.genius.com/136e97e5df4072eae2edf091c9e151ad.500x500x1.jpg"}], "artist": "Logic"}