{"songs": [{"title": "Strangeulation II", "album": "Strangeulation", "year": "2014-05-06", "lyrics": "[Verse 1: Godemis]\nDeevil!\nPrayin' at 12:12 for hell, felon to sell\nAnd slept on a bed of nails, like nothing I've ever felt\nGhost in a shell was molded with other demons\nAs if I needed some help or a host to preserve the heathen\nGot it, my brain is rotted, I swear to God that I'm not it\nI'm set to go to the gallow as soon as the rope is knotted\nI ain't highest of high then the hydra have used adrenaline\nCame in the cypher clean, still smelling like putrid cinnamon\nThen I'm in enemy of the state, I'm straight at an angle\nStop risking and quit your bitchin', it ain't like I'm raping a angel\nSaid I was magnifique, ya'll ain't fuckin' with it, capiche?\nNot as safe as you would've thought with the devil under your feet\nThey throw a shot and then sit back and wait for some reaction\nAin't nothing to it but to do it, I'm a mummy rappin'\nSo get to clappin' or dissin' the clan you hatin'\nListen, the man is Jason and this is the Strangeulation\n\n[Verse 2: Stevie Stone]\nStevie Stone, I'm on it, I'm so clever\nNobody comparing, I'm better, I put shit together\nAmerica's most elaborate rap, pick ya head up, huh\nSmall talkin'll get you wet up, huh, yeah\nI'm ready to kill all you niggas\nThe feelin', adrenaline that'll spillin' a mill\nAnd yeah, I mill' all you niggas\nAin't even reach out they climax, rather my celing on niggas\nAnd backin' a back, I'll backhand Billy you niggas\nGet busy on niggas, this ain't no random some leakage\nStonie in the building, the bitches pull out their cleavage\nThe snake and the bat, you see them prominent features\nThe species, Strangeland, we rain on your region, huh\nMeat wagon, I come, I be taggin' 'em\nBaggin' 'em, bring 'em clusters of three, got three magnums\nGaggin' em out, you pussies is still talkin'\nI'm draggin' 'em out, I'm tappin' 'em out\n\n[Verse 3: Murs]\nAww shit, they fucked around and signed a backpacker\nSmart, rich, handsome, plus he's not a bad rapper\nI'm just a little local talent that fucked around and made it big\nUnderground bully, pickin' on all these famous kids\nAnd the danger is, now I'm doin' stranger biz\nAbout to make the world forget about what a major is\nIndependent Powerhouse, running all these cowards out\nMy enemies are all forgotten, wishin' I would shout 'em out\nAnd I don't want to hear a rapper harmonize unless\nHe thuggish, ruggish, Lazy, Krayzie, Bizzy, Wish or Flesh\nBut maybe I'm just hatin' 'cause my black ass could never sing\nAnd fuck that autotune I hope the Futures filled with better things\nAnd you a fucking liar if you say you found a better team\nImpossible! Like trying to fit my dick inside my wedding ring\nAnd all the bread it brings will be distributed and properly\nI represent for hip hop not some fucking aristocracy\n\n[Verse 4: Brotha Lynch Hung]\nI'm the Martin Scorsese of rap, rap predator\nBetter than severin' the reverend with a jackknife\nKevin and eleven of 'em, revvin' up the engines\nWe bubblin' up like 7-Up, then when\nWe shoot that shit, we eat that shit for din-din, grrr\nI don't need ya fuckin' okay, ah, are you serious? I'm okay\nI'mma make you bleed like it's your period, period\nI eat period pussy so eating you ain't serious\nWhat, you need for me to flip that shit and rip that shit\nLike a skitzo, stick that shit, that shit, like a automatic pistol grip?\nNo! I created this fast rap, I'm past that\nI put a gat in that ass crack and blast that\nI'm light years ahead of 'em, might use the head of 'em\nI lose, then you can keep the breadcrumbs\nGrrr, my nigga, I'm a carnivore\nReady for any kind of war, any kind of score", "image": "https://images.genius.com/a97c6b9421fc6142eef43b7f37277096.500x501x1.jpg"}], "artist": "Tech N9ne"}