{"songs": [{"title": "The Hunted Child", "album": "The Iceberg / Freedom of Speech... Just Watch What You Say", "year": "1989-10-10", "lyrics": "Artist: Ice-T\nAlbum: The Iceberg/Freedom of Speech\nSong: The Hunted Child\n\nVerse 1\n\n(Today in Los Angeles another youth loses his life. Gunshot wound to\nThe head. Street violence is at an all-time high)\n\nNo jokin', I'm sleepin' with my eyes open\nWanted for a homicide ride, the gun's still smokin'\nDidn't know what I was doin' but did it anyway\nNow the posse's on my trail, they say I'm gonna pay (Run!)\nI had a gun, it's mine and I packed it\nOut with my crew, the boys caught some static\nMe and this sucker punk went at it\nBang! Nine automatic\n\nHunted Child\nI'm the Hunted Child\n\nVerse 2\n\n(Sources say the assailant was 17-years old and lives in South-Central\nLos Angeles)\n\nNow I'm on a hideout tip cos they're after me\nLAPD says they're gonna capture me\nWas I crazy? I guess I had to be\nCos once you kill it's instant catastrophe\nYour whole life is over (Through!)\nForget about your girl your (Crew!)\nNowhere to run, so what you gonna do?\nBe glad it's me, homeboy, and not you\n\nThe Hunted Child\nI'm the Hunted Child\nHunted Child\nI'm the Hunted Child\n\nVerse 3\n\nI'm only 17, I didn't mean to kill, man\nBut I was slangin' and bangin' for the thrill, man\nWhen they said (Kill!) I felt chill, man\nBut once I pulled the trigger, boy, then things got ill, man\nMy homeboys dipped out the back fast\nLeft me alone in the echo of the gun blast\nEverybody saw my face, I didn't wear a mask\nYou wanna know my name? Just ask\n\nThe Hunted Child\nI'm the Hunted Child\nHunted Child\nI'm the Hunted Child\n\n(The science of Capitalism which you teach to the youth on the streets\nToday with the 'ends justifying the means' mentality ain't happenin')\n\nVerse 4\n\nI'm sweatin' heavy cos my face is on TV\nEverybody in this whole world's after me\nSince I was young I never had a damned thing\nAt Christmas time I'd hate to hear the bells ring\nCos in the ghetto Santa ain't got a dime\nYour mother's standin' in the welfare line\nThe way the youth survive is crime\nMy life is over so I might as well speak my mind\nI killed a brother cos this system had me geared to kill\nCos what I call home you call hell\nMy ghetto quarters ain't no better than a jail cell\nBut there's a message in this story that I'm tryna tell\nWe're just brothers on the streets killin' brothers\nThis system has us geared to kill one another\nSellin' dope to poison each other\nThe plan of The Man, word to the mother\nBut I'm a sucker cos I fell into their plan\n187, I killed a brother man\nMy life on Earth was hell, you understand?\nBut when I die I'm goin' to hell again\n\nI'm the Hunted Child I'm the Hunted Child I'm the Hunted Child The\nHunted Child\n\nI'm the Hunted Child\n\nI'm the Hunted Child", "image": "https://images.genius.com/8130dc496c2cedd8004532bb340c7c91.800x800x1.jpg"}], "artist": "Ice-T"}