{"songs": [{"title": "Ghetto Gospel (Original)", "album": null, "year": "1992-08-15", "lyrics": "[Produced by Deon Evans]\n\n[Verse 1: 2Pac]\nIf I could recollect before my hood days\nI'd sit, reminisce in bliss on the good days\nI stop and stare at the younger\nMy heart goes to 'em\nThey tested, it was stressed that they under\nWe never really went through that\nBecause we was born B.C. - you and me before crack\nAnd nowadays things changed\nEveryone's ashamed of the youth cause the truth look strange\nAnd for me it's reverse\nWe left them a world that's cursed and it hurts\nCause any day they'll push the button\nAnd all good men like Malcolm X and Bobby Hutton died for nothin'\nDon't 'em let me get teary\nThe world looks dreary\nBut when you wipe your eyes, see it clearly\nThere is no need for you to fear me\nIf you take the time to hear me\nMaybe you can learn to cheer me\nIt ain't about black or white cause we're human\nI hope we'll see the light before it's ruined\nMy Ghetto Gospel\n\n[Hook]\n(woman singing)\nIt's ok, it's ok, it's ok\n(2Pac over chorus)\nYeah, my Ghetto Gospel\n(Man talking)\n(woman singing)\nIt's ok, it's ok, it's ok\n\n[Verse 2: 2Pac]\nTell me, do you see that old lady? Ain't it sad?\nLivin' out of bags but she's glad for the little things she has\nAnd over there there's a lady, crack got her crazy, well guess she's givin' birth to a baby!\nI don't trip to let 'em fade me\nFrom outta the frying pan we jump into another form of slavery\nAnd even now I get discouraged\nI wonder if they take it all back will I still keep the courage?\nI refuse to be a role model\nI set goals, take control, drink out my own bottle (yeah)\nI make mistakes but learn from everyone\nAnd when it's said and done\nI bet this brother will be a better one\nIf I upset you, don't stress and never forget that God isn't finished with me yet\nI feel his hand on my brains when I write rhymes I go blind and let the Lord do his thing\nBut am I any less holy?\nI choose to puff a blunt and drink a beer with my homies\n(and this is not world peace, we tried and failed) and there is war on the streets!\nMy Ghetto Gospel\n\n[Hook]\n\n[Verse 3: 2Pac]\nI remember grandma's hands used to hold me, mold me, I never forget the things she told me\nBrothers' a butt and played the big shot, cause you know\nGrannies are the only thing that little Ghetto kids got\nMoms work and papa's buried\nShe dropped me over granny's house\nBless her heart cause she worry\nAnd ghetto grannies are like books, we got so many crooks cause so many grannies gettin' shook\nAnd gettin' dropped in the nursing home\nAnd times is hard and even worst alone\nAnd how could you be so cold\nYou'll get your turn as soon as you turn old\nAll they ask of every person\nThey try to figure out what's on the mind of a brother when he's cursing\n9 out of 10 you'll find the problems, time to take a listen and see what you could do to solve them\nCause everybody needs a little help on the way to relying on one's self\nSo think about it... why 2Pac hit cha, hit cha with a little ghetto gospel\nMy Ghetto Gospel\n\n[Hook]\n\n[Verse 4: 2Pac]\nI was a stone cold gangsta man\nUntil you gave me ghetto gospel, I thank you man\nUsed to roll in the back and do drugs a lot\nNow I'm bangin' these tracks, slanging rhymes I got\nIn this world of greed tryin' to succeed on my beliefs\nNow I lay me down to sleep\nLord can you hear me speak?\nCan you forgive me for my sins?\nIf I had it all to do again, I'd still play to win\nI hope the Lord can understand me\nA man's gotta do what he can for his family\nAnd pay the price of being hellbound\nBut I rather see hell later than see hell now\nAnd the devil ain't got nothing on the president, cut back and keep us strapped in our residence and be like animals in cages\nWe can rant and rave about slavery for ages\nOr we can start making positive and hit 'em with a little ghetto gospel\nMy Ghetto Gospel\n\n[Hook]\n\nIt's ok, its ok, it's ok\n(my ghetto gospel)\nIt's ok, it's ok, it's ok\n(my ghetto gospel)\nIt's ok, it's ok, it's ok\n(my ghetto gospel)\nIt's ok, it's ok, it's ok\n(fades)", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}