{"songs": [{"title": "Strangeland", "album": "All 6's and 7's", "year": "2011-06-07", "lyrics": "[Intro]\n[Tech]\nWhere am I?\n[Girl]\nYou don’t know where you are?\n[Tech]\nNo, I don't\n[Girl]\nYou’re in Strangeland\n[Tech]\nStrangeland?\n[Girl]\nYeah, Strangeland\n[Tech]\nWell uhh.. how did I get here?\n[Girl]\nWell that’s simple, Mr. Yates\n[Tech]\nWhat, do you mean?\n[Girl]\nYou’re the creator\n\n[Verse 1: Tech N9ne]\nWhat I saw was amazing after raising up and\nGazing at the babe that said I'm creating nights and days and paving\nThe way for raging Tech-aholics\nMaking havens, next to all this hate and crazing\nDeath, we call it a place of consummation\nOf perfection, fulfillment, the Tech runs the building\nRespect one's resilience, from threats guns and illnesses\nThis place is realness, it feels as if its lifted\nA bit sick and twisted and real wicked, villages\nAnd I'm the main man\nThat made every effort to gain fans\nThrough all my pain I obtain grands\nMillions just cause of my brain and my lane stands\nInsane rands the name brand, call it Strangeland\n\n[Hook: Tech N9ne]\nGetting paid was the game plan\nBut the lane transformed to untamed fans\nEnhanced into Strangeland\n(Can't live up to them)\nPain, and insane land\n(Waking up in a..)\nStrangeland\nWhere everybody know my name man\nCause my blood and veins ran through the mainland\nI am in a Strangeland\n(Can't live up to them)\nPain, and insane land\n(Waking up in a..)\nStrangeland\n\n[Verse 2: Tech N9ne]\nA world filled with Technicians, lets this one, stress\nLifting, mesh kids in sets with them Tech listening vets\nExpression is best written, less hidden, flesh\nWomen, sex driven, that's living, yes been impressed\nBy the way, the Tech is blessin'em\nIt shows\nCause the land it steady grows, and I'm the man with frantic flows\nBut understand he said he knows, but he ran a deadly road\nBut he woke up with a family rose, in a land of uncanny souls\nAnd they adore him, even if they can't afford him\nBe the rich, and be the poor then, really get to be before him\nTo get laced, on mistakes, and big brakes\nQuick pace, lyrics they pick in this place\n\nHe played me some stuff in uh, in L.A., off \"Tha Carter IV\"\nHe has a, he has a record on there with umm\nThis dude named Tech N9ne I don't know if you guys heard of him?\nOh man, he's CRAZY, he's crazy\n\n[Hook: Tech N9ne]\nGetting paid was the game plan\nBut the lane transformed to untamed fans\nEnhanced into Strangeland\n(Can't live up to them)\nPain, and insane land\n(Waking up in a..)\nStrangeland\nWhere everybody know my name man\nCause my blood and veins ran through the mainland\nI am in a Strangeland\n(Can't live up to them)\nPain, and insane land\n(Waking up in a..)\nStrangeland\n\n[Verse 3: Tech N9ne]\nAm I in the Twilight Zone? Cause my mics on\nBut I never thought the world would buy my songs\nCause in my lane I am the highlight inside my dome\nBut now it's my height, they try bite, cause my life long\nIn this hip hop, everybody's lip drops, when I spit the\nGift quickly shifted cause I get props, it's terrific\nThey recognizing me on every level if ya missed it\nIf ya look ya findin' me on a very rebel, this is listed\nTech N9ne a insane man\nHis own lane had the strain and pain, and then became fans\nWhen all the dames glance, he's doin' the rain dance\nBecause the whole world is 'bout to be a Strangeland\n\n[Spoken]\n\n[Hook: Tech N9ne]\nGetting paid was the game plan\nBut the lane transformed to untamed fans\nEnhanced into Strangeland\n(Can't live up to them)\nBane, and insane land\n(Waking up in a..)\nStrangeland\nWhere everybody know my name man\nCause my blood and veins ran through the mainland\nI am in a Strangeland\n(Can't live up to them)\nBane, and insane land\n(Waking up in a..)\nStrangeland", "image": "https://images.genius.com/7d4c4dfa3d56e3cd0f59836ef122ff24.1000x1000x1.jpg"}], "artist": "Tech N9ne"}