{"songs": [{"title": "Something 2 Ride 2", "album": "Street Hop", "year": "2009-08-20", "lyrics": "[Intro: Royce da 5'9\"]\nThis is a little something to ride to\nKick back and just catch a vibe to\nI'd pop me a pill, I'd drink me another drink, if I was you\n\n[Verse 1: Royce da 5'9\"]\nI got the flyest arsenal\nClip filled to capacity, you can call me the fire marshal\nI'm ape and shit, I'm on my gorilla thing-thing\nMe and Preem, you can call us the guillotine team\nWe chop off heads, pop off lead\nIf it pops off, we spending that rockstar bread\nWe doing numbers like the box office\nNigga you ain't tryna box, then stop talking\nI got niggas from Watts to Boston\nFrom New York to the Chi to Austin\nSo even if my eyes is off ya, other eyes is on ya\nThat belongs to them killers that's gon' ride up on ya, boom!\nIt's gasoline in my tongue\nPatron in my kidneys, weed in my lungs\nTrigger on my index finger, handle in my palm\nEars ringing, my animal alarm\nMy mind is on Hannibal Lec, demand the respect\nI'm taking your life 'less you hand me a check\n\n[Hook: Phonte]\nI've been around, seen some things, sexed a lot of girls\nI did my time but in my mind, I'm still thinking it's my world\n\n[Bridge: Royce da 5'9\"]\nI got my finger on the pulse of this music shit\nI'm the truest, shit\nNow tell me who this sick\nAnd you can swallow everythin that's comin through this dick\n\n[Verse 2: Royce da 5'9\"]\nReigning king of the boom-bap\nBomb strapped to my chest askin \"Where ya goons at?\"\nI'm old school like a StarTac\nOn a voyage like Star Trek, me unemployed is far fetched\nI'm hot, I got the corduroy flow\nYou can picture but can't shake it, the Polaroid show\nI book niggas for shows and put niggas in comas\nSo I hope that you niggas is roamers\nCause my niggas is riders like Winona\nBut we just tryna have a good time like Willona\nI'm a zoner, all I do is zone out, like a stoner\nAs far away as Estonia\nI'm a sucker for a good sucking, so tell ya bitch\nThat's it's best if she invest in what it's good luck in\nMami, would you rather fly over niggas heads?\nOr keep your ass in the hood ducking?\n\n[Hook: Phonte]\nI've been around, seen some things, sexed a lot of girls\nI did my time but in my mind, I'm still thinking it's my world\n\n[Bridge: Royce da 5'9\"]\nI got my finger on the pulse of this music shit\nI'm the truest, shit\nNow tell me who this sick\nAnd you can swallow everythin that's comin through this dick\n\n[Verse 3: Royce da 5'9\"]\nPardon my French, talk English\nSteal your job, the discount is the five fingers\nThat's why Preem is the head-nod king\nMy drive's on my toes, I got my Bedrock swing\nStreet Hop is the culture, I rock with the vultures\nTo make bread with the opposite toaster\nI'm Py-reckless, I'm kitchen, the quips sickening\nAnd my neckless is glistening, it's expensive\nSo don't mention your ice whenever you mention my rhymes\n(Why?) Cause my pencil is priceless\nSo what you running for? Nigga I'm coming for you\nIf I'm the hyphen, then you the underscore\nTrue, and I'm lawless packing\nI ain't no designer but I got a flawless jacket, whoa!\nAfter \"Boom,\" this afternoon\nIt's night-night when me and Preem come back for more\n\n[Hook: Phonte]\nI've been around, seen some things, sexed a lot of girls\nI did my time but in my mind, I'm still thinking it's my world\n\n[Bridge: Royce da 5'9\"]\nI got my finger on the pulse of this music shit\nI'm the truest, shit\nNow tell me who this sick\nAnd you can swallow everythin that's comin through this dick\n\n[Outro]\nThis is a little something to ride to\nKick back and just catch a vibe to\nI'd pop me a pill, I'd drink me another drink, if I was you", "image": "https://images.genius.com/13187be577e518c77f5c6ac278ec366a.1000x1000x1.jpg"}], "artist": "Royce da 5'9'’"}