{"songs": [{"title": "Pimping Forever", "album": null, "year": null, "lyrics": "[Too $hort]\nBeotch!\nSomebody say beotch! Say beotch!\nA lemme hear you say beotch! Say beotch!\nSay bitch, bitch, bitch, bitch, bitch..\n\nYour daddy said come back baby, find your life\nIt was wrong before but this time it's right\nIt's been way too long, you've been gone from home\nYou wasn't ready when you left to be grown on your own\nNow deep down inside you're his little girl\nGotta swallow his pride cause you're his little girl\nWouldn't be so bad, if you only stripped\nBut you don't do dancin just lonely tricks\nNow you're hooked - ain't no love\nYou in this game, it's just like drugs\nYour family wrote you off cause you fucked that up\nYou way out of town and you stuck\nNow you're on your own, you've been disowned\nSince you left your hometown all your friends are gone\nIt's girls like you that truly make us\nYou're lost in the world so I moved you to Vegas\n\nBefore you met me you wasn't nuttin\nI fucked wit'cha and I turned you into somethin\nNow fuck J-Lo, be your own woman\nNow take your ass back to work the track jumpin\nSay beotch! I'ma be pimpin forever\nBitch, I'ma be pimpin forever\nSay say say say hoe! I'ma stay mackin forever\nHoe, I'ma stay mackin forever\nSay, say beotch! I'ma be pimpin forever\nBitch, I'ma be pimpin forever\nSay say say say hoe! I'ma stay mackin forever\nHoe, I'ma stay mackin forever\n\n[Too $hort]\nSay beotch! You better get that cash\nOld-ass man wanna hit that ass\nOlder than your daddy, more like your granny\nLet his old wrinkled ass get in them panties\nI show you how to get it, I'm just a dog\nYou had a good thang and you fucked it off\nI'm like the big bad wolf, you better scream\nRun for your life cause I want that cream\nYour father told you, to stay away from me\nAnd now you gotta call me daddy?\nNow let me ask you, you think you've got it together?\nYou're too fine to be broke, you gotta get whatever\nNow I don't give a fuck in any weather\nWhen I see you, you better have a G or better\nLook into my eyes, and say you understand me\nCause now I'm your family (say beotch)\n\nBefore you met me you wasn't nuttin\nI fucked wit'cha and I turned you into somethin\nNow fuck J-Lo, be your own woman\nNow take your ass back to work the track jumpin\nSay beotch! I'ma be pimpin forever\nBitch, I'ma be pimpin forever\nSay say say say hoe! I'ma stay mackin forever\nHoe, I'ma stay mackin forever\nSay, say beotch! I'ma be pimpin forever\nBitch, I'ma be pimpin forever\nSay say say say hoe! I'ma stay mackin forever\nHoe, I'ma stay mackin forever\n\n[Too $hort]\nYour father wants to know, when you comin\nBut you never liked home so you keep on runnin\nNow I got you, you're mine for life\nBitch get your mind right, don't let the limelight\nSteal your soul, and make you old\nMake the happy lil' girl turn bitter and cold\nNow your brain is frozen, your body is numb\nYou're stuck in the hoe-zone, you gotta get home\nYou can go to Oz and won't learn shit\nClick your heels three times and go turn a trick\nBeotch! You better get that cash\nIf you don't got it when I see you I'ma whip that ass\nAnd all of you squares, that hear my flows\nMost of y'all bitches wouldn't make good hoes\nNever talk down on a pimp and his whore\nUnless you know the whole story, broke bitch! (say beotch)\n\nBefore you met me you wasn't nuttin\nI fucked wit'cha and I turned you into somethin\nNow fuck J-Lo, be your own woman\nNow take your ass back to work the track jumpin\nSay beotch! I'ma be pimpin forever\nBitch, I'ma be pimpin forever\nSay say say say hoe! I'ma stay mackin forever\nHoe, I'ma stay mackin forever\nSay, say beotch! I'ma be pimpin forever\nBitch, I'ma be pimpin forever\nSay say say say hoe! I'ma stay mackin forever\nHoe, I'ma stay mackin forever\n\n[Too $hort]\nSay beotch!\nYeah that's right, hoe up if you wanna blow up\nSay say say say hoe\nAnd all you cute broke-ass bitches stop hatin on these real hoes\nSay, say beotch\nYou up there suckin and fuckin all night for free\nSay say say say hoe\nWhen you coulda got in and out there wit'cha money real fast baby\nSay beotch!\nYeah, you need management\nYou need a nigga like me\nTo tell you exactly what you need to be doin out there\nGet your full potential out your pussy baby\nYeah [fades out]", "image": "https://images.genius.com/f7947ca6d18485b4713ba9c89b2980c7.800x800x1.jpg"}], "artist": "Too $hort"}