{"songs": [{"title": "Finding Forever Freestyle", "album": "Under Pressure ", "year": "2014-05-05", "lyrics": "[produced by 6ix]\n\n[Hook: Kanye West] x2\n(Go) go, go, go, go, go and on the count of three\n(Go) go, go, go, go, go and on the count of three\n(Go) go, go, go, go, go, go\nOn the count of three everybody run back to your fantasy, now\n\n[Verse 1]\nFeel like I've been waiting fo ever, for ever ever?\nThrough any endeavour, whatever my hand on the lever ready to go\nReady to go, yeah ready to go, uh, ready to go, ready to\nThis the shit they never know\nI've been dealing with (hey) suits and fans talking about I'm straying from my raw roots\nWell what if I told you some the music you hearing is actually from years ago\nI'm talking long ago\nBut it's funny how the public ain't perceiving a little\nRumors started and everyone wanna believe that I'd just leave it and go\nLeave it and go, leave it and go, leave it and go\nBitch I've been a beast, I'm eating like 10-a-piece\nHomie put your mind to ease, keep enemies on a leash\nShout out to the homie Common, I know I'm redoing your shit\nBut you was fucking with the album so I'm sure it ain't a problem\nA bit under pressure, nothing can measure\nBut all these beautiful women around me's such a pleasure\nShout out to the RattPack\nY'all it's looking like September, I know it feel like forever but we all gon' get that together just\nGo, go, go, go\nI'm writing this record on the back of the tour bus\nSeem like every year that pass man there's been more of us\nMe, Lenny, C Dot and 6ix thought it was the four of us\nAnd the homie QuESt, and the homie Jon Bellion\nThat's my morte fame, you know we gotta goin' on\nOn the roll with the fever yeah I'm still on the mic\nDid a show, sick as hell, but I'm still alright\nYou know we on that Wu-Tang, resurrect it with the band\nScreaming \"money ain't a thang\", Visionary be the gang\nWhen I'm done with the verse just send it to Bobby so the mix great\nAnd when it drops, get the Castro mixtape (If it ever drops... like shit!)\nGoddamn, you know I feel it\nAll the fans want the album, but you know I've gotta kill it first\nHella come up with a muthafucking killer verse\nRest in peace, man I wish I had a Dilla verse\n\n[Outro]\nPeople say the same stuff about rap music\nPeople are just like, “Oh rap music now, oh it sucks. It’s so bad. Rap music now sucks\nNow back in the day that was good rap music\nThat was where the good rap music was at\nThat’s the good rap music”\nNo it’s not! Have you ever listened to rap back in the day?\nIt’s always some dude being like\n“Well I went to the hat store today and I bought myself a hat. Ha-ha-haa”\nNigga, nigga I don’t want to hear your hat stories\nSo lame", "image": "https://images.rapgenius.com/569efce01cb314101359425022547c7d.640x640x1.jpg"}], "artist": "Logic"}