{"songs": [{"title": "On the Grammys", "album": "Kanye West’s Visionary Streams of Consciousness", "year": "2016-02-24", "lyrics": "I would like to sit down with Neil Portnow right now\n\nI think the Grammys are super important!!!\n\nI know so many cool artists whose hearts have been broken by the politics including mine\n\nWe need to fix this\n\nI don't give opinions because they are commonly agreed upon. I say what I feel\n\nI feel the Grammy awarding system is way off and completely out of touch\n\nHi Grammys this is the most important living artist talking\n\nIf I'm not at the show next year then there is no show\n\nI don't want to just fix the awards for me but I want to fix it for Dexter Navy who directed A$AP Rocky’s LSD video\n\nEverybody with any form of taste knows that was the best video of the year!\n\nDexter didn't feel he even had a chance of winning and he was right!!!\n\nYou guys are supposed to be all about taste\n\nYou like your black people a certain way also. You wouldn't have Future perform and that man owned the clubs last summer\n\nHas anyone at the Grammys ever heard March Madness??? Yes I have a problem with the Grammys\n\nAll artists have a problem with it and I am going to fix it for us all starting right now\n\nNeil please reach out as soon as possible so we can make the Grammys culturally relevant again\n\nUs real music guys wanna have fun too\n\nAnd always remember that rock and roll was stolen and don't try to hide behind Jimmy Jam and Terry Lewis 😭😭😭 all positive vibes\n\nFirst order of business. We the people need to see Future at the Grammys\n\nWe need to see Young Thug at the Grammys.  Not just me and Jay in a suit\n\nPeople ask why I speak in a public forum... Well my voice is my power. Freedom of speech. Freedom of opinion. Freedom of dreams\n\nI'm not crazy I'm free\n\nNo slave mindset no more. I'm free. I'm free. I'm free\n\nI wrote Saint Pablo after admitting to my greatest shame my personal debt. But I'm not ashamed anymore\n\nI'm proud as an entrepreneur that I gave everything I had to my dreams\n\nI'm happy and free and proud and confident. I'm not crazy. I'm free\n\nFree from being held back by public opinion\n\nIt's a beautiful time.  I love my friends. I love my family.  I love people. The human race\n\nYou guys will see my heart. You guys will feel my heart. We will make a difference\n\nI just had to start with shoes so that I could be economically empowered enough to have a voice\n\nWhat is your definition of true freedom? There is no true freedom without economic freedom\n\nRespect to everyone working hard to keep a roof over their kids\n\nThat is one of the reasons I respect the paps so much\n\nAnd yes I've talked to Adidas and we gon hook y'all up with free Yeezys and Adidas.  All positive vibes\n\nI'm not even gon lie to you. I love me so much right now\n\nNew album coming this summer\n\nI love being a voice of freedom when so many people are scared to speak up\n\nThe world needs a guy like me. The world needs somebody to not be scared and tell his truth\n\nYou won't always agree with me but I'm gon always be me. I'm woke!", "image": "https://images.rapgenius.com/64f690a1efbb9ca75a69645930e0fa79.498x498x1.jpg"}], "artist": "Kanye West"}