{"songs": [{"title": "Lost Freestyle", "album": "The Lost Tapes 2", "year": "2019-07-19", "lyrics": "[Intro: Angela Bofill & Nas]\nIn our younger days we were so in love\nAnd the thought of losing you was enough\nCan't lose me\n\n[Verse 1: Nas]\nWho be the holy prophet, they watchin’ with all his posture?\nHis Rothstein goggle game be the dopest, he gots to\nBe from the '80s era\nHis tint is shade Carrera, Queens forever\nGreen pipe seats, clean Panamera\nAmateur Hanna-Barbera characters know they envy\nThe illest Hennessy Black sipper with loaded semis\nYou pick of the week, voted-in rappers you go against me\nYou can't tantalize a call girl with just a roll of pennies\nCan’t bait a lion in ya trap without a tranquilizer\nYou enterin' a boxing ring with no trainer beside ya\nMy Panerai watch glows like Avatar\nCaviar black diamonds, can you imagine, y'all\nTakin' from a rich man plate? Kick in his door\n'Cause his war with the bloodsuckers of the poor\nThe first shall be last, that's just universal law\nPop the cork, the Perrier-Jouët pours, like this\n\n[Verse 2: Nas]\nUh\nI tell a story of a prince life and all his glory\nIt's killin' me softly\nSomber like the buildings in Fort Greene\nHood monsters and niggas who walk mean\nHood niggas and they just came home and they grip they chrome\nCan you hear me, is this thing on?\nTest, one, two, gimme some feedback if y’all could feel it\nFor the home invasion dudes that be robbin’ dealers\nPicture me runnin' inside they crib, rollin’ wit' ya\nMask on the face, tyin' up the sister\nLookin' for the bricks to get richer\nSmackin’ up the dude with the gun, take the jewels and the funds\nA dirty game when you servin' 'caine\nGot feds to watch, hoes to watch, checkpoints and roadblocks\nPolice barricades, batterrams\nDoors off the hinges, wake up flinchin', who ratted, man?\nKnew who it had to been, states, feds and housin' added in\nEvery department searchin' your apartment\nRansackin' it, found four ratchets\nDEA jackets, we gotta escape the madness\nHaha, yeah, escape the madness\nYeah, through the eyes of Pablo\nThat's how I'm lookin' at you, there's an obstacle in everything\nIt's all natural, I'm keepin' it pilin'\nKeepin' heat with the silencers\nLearnin' Greek and Italian, speak with kings while dinin'\nGood with hyenas, meanin' it's hood when it's time for ridin'\nTies with suppliers from my days of the projects\nWhere I resided, a phenomenon\nWith the ambitions of a rider\nPretty amazon on my arm, nigga, I'm the flyest\nThe flyest, haha, yeah\n\n[Outro]\nLemme hear that", "image": "https://images.genius.com/91da51c7ed14c805c492a0346f54d465.1000x1000x1.jpg"}], "artist": "Nas"}