{"songs": [{"title": "Two Scoops of Raisins", "album": "Can I Borrow a Dollar?", "year": "1992-10-06", "lyrics": "[Immens] Yo man.. I'm hungry man\n[Common] Ay whatchu want man? You want some breakfast or somethin?\n[Immens] I want a lil lil somethin...\n[Common] Yeah, a lil milk and cereal or somethin?\n[Immens]  Somethin man! Just a little breakfast food, y'know?\n[Common] Mmm I don't know man (ay) let's see what I got in my cabinet\n[Immens] Hold on, let me see what I got in my cabinet\nSomebody hit me with a little, baseline or groove, knahmsayin?\nYeah, breakfast food, UHH!\n\n[C] When you wish\n[I] When you wish\n[C] Upon a star\n[I] Upon a star\n[C] To follow what?\n[I] To follow what?\n[C] And where you are!\n[I] And where you are!\n[C] Party over here, party over there\n[I] Where?\n\n[Common]\nLook! I made ya look, ya dirty crook\nThen picked your pocket, watch me book...\n...like Guinness I'm a Menace, so call me hip-hop's Dennis\nSo open wide, and say (AHHHHH)\nAnd I'mma slide my yolk, in your throat, and watch ya choke\nOn the Uh the Ah the Uh the Daddy Long-Stroke\n\n[Immenslope]\nStroke Long Daddy Money, if my name was Sunny\nI'd share a scoop, Runnin shit like Rebels\nYou can call me Barney, cause I took your Fruity Pebbles\nDibble like an office on Top Cat, top that, I'm fat troop\nDrop the loop, then a scooper hoop ya like a hula\nTo school a fool or be sent a church to repent\nI get you Guess'n like jeans, you're just a hill of beans\nI'm all that jazz, and I kick, kick, kick, kick..\n\n[Common]\nThe razzamatazz oh please oh please just give me just one more blast\nI +Gett Off+ like Prince, but I don't have to show my ass\nPass the rest, like a test, if you slip then you'll get ripped\nWith your handicapped pass rap, and Tales From the Crypt\nI whip on that ass like base ba-bay\nThe Sense is good-GOOBELY-goo, ask Grady\n\n[Immenslope]\nOr Lamont, or Rollo, down at the, Apollo\nCome follow me now (BO! Where's Sue?) I don't know\nEven En Vogue, be tellin me ya don't go\nWhen it's time for show (yea) everyone says\nHo (ho) ho (ho) couldn't be a slider\n'Cause I never slip, kick it like a Damme Van flip\nSo don't come with your judo, cause you're just a Menudo\nEmcee gettin chewed like vegetables\n\n[Common]\nAhhhhh cabbage is a cabbage, a lettuce is a lettuce\nI'mma tear this whole joint into scraps\nI bust raps, perhaps caps, and trap the wack tracks\nGivin the max, for the minimum, not the minimum for the max\nGet more sex than Wilt the Stilt so you can call me the Stiltest\nYou're takin shorts like Arnold, so what chu talkin bout, Willis?\n\n[I] Bout Willis?\n[C] Yeah Willis\n[I] Willis ain't talkin about nuthin!\n[C] It's Different Strokes\n[I] Let's get back to umm, breakfast foods\n[I] because it's, early in the mornin..\n\n[Common] Well you can have your Wheaties\n[Immens] You can have your Flakes\n[Common] You can have your Kix\n[Immens] And you can have your Trix\n[Common] You can have your PANcakes\n[Immens] You can have your Loops\n[*both*] But you still gotta get your Two Scoops!\n\n[Immenslope]\nTo keep the hot raw, I'm rollin, rollin\nBowlin - spare me! Fuss ya hushed mouth mush\nLush alcohol's excessive like a Jefferson\nMovin on up -- progressive\nOne time for your brain, cell\nAnd when I get through, you say -- aww hell man!\nStyles that I free won't, stop til the end\nPaper I go on and go on with the pen\nGet a max of funk, attack or sunk *huff, huff*\nOne blow, and emcees are gone with the wind\nKickin the dumber rhyme, I'm not a prince\nBut I'm fresh, heatin up like the summertime, summer rhyme\nI'm a dime a dozen, but I keep you buzzin\nLike a bee, a dozen attempts is in the toilet\n'Cause I flush the dime and I'm not a Leader\n'Cause I Busta Rhyme, a rhyme\nIf I kick with Rakim, you run for cover brother\nBut I kick it with Petey cause I'm just another mother (sucker)\nBlo Pop time (it's Blo Pop time)\nIt's Blo Pop time (it's Blo Pop time)\nIn the mix, the dimension, J.B., and Chico\nIt's seven, not six, my shirt extra-large\nBut I wear, I wear, I wear it well like DeBarge\nTo the finish, makin ya eye pop, like you ain't spinach\nThen it's, time to let you know\nWe count it up, one two three and fo'\n\n[I] UHH! Count it up\n[C] Nah we gon' count it down\n[I] Nah man, we're gonna count it up\n[C] Mmmm, let's get back to that umm, food tip though, the breakfast tip\n[I] Food tip? Well you just check\n[C] 'Cause you know what we need\n[I] What can I have?\n\n[Common] You can have your Life\n[Immens] You can have your Bran\n[Common] You can have your Puffs\n[Immens] You can have your Pebbles\n[Common] You can have your Krunch\n[Immens] And you can have your Loops\n[*both*] But you still gotta get your Two Scoops!\n\n[Common]\nAround and round and upside down and upside down we go\nWHOAHHHHH! I'mma sneak in the front row\nNot Jethro, I'm not a Jethro, on skid row\nI don't wear Monie's hat, but I was a Monkey +in the Middle+\nHey diddle diddle, you can Kibble a Bit\nI take a squat, and booty MC's be sayin OOOOHHH SHIT!\nYo, I turn Bucktown into Fucktown\nYou're just a field goal kid, and I'm a touchdown\nWith the next point to the next joint, so tell Spike about it\nI'm all that, that your bitch be writin home about it\nShout it out, praise the Lord, hallelujah!\nThis could be love, but umm, don't let em fool ya\n'Cause when I do ya, come down, come down after me come\nYeah sorry Sugar Plums but umm, I gotta run\nRun Jesse Run, keep hope alive\nI'm down with the B-boys, FUCK the Jackson 5\nYou jive-ass turkey, a-pit-apitta-a-aperk be\nYou can get ill, but don't, HURT ME, HURT ME\nOr irk me, cause see I'll outsmart you like the Urkel\nB-boys at the school of hard knocks, in a circle\nPass the sess blunt, yeah stud, you ain't know?\nI wanna go bang, I said, bang-o, bang-oh bang-oh\nOr bojangle, jingle jangle, run the jewel\nHip-hip, hooray, oh now you wanna be a Luvabull?\nDon't push or pull, or you'll see, I'mma wreck it out\nMC's be checkin in but they don't be checkin out\nI leave em out on the canvas\nSo click your heels twice and take your ass back to KANSAS..", "image": "https://images.genius.com/e3b1b8cdac9f386a42441991d28a760b.624x624x1.jpg"}], "artist": "Common"}