{"songs": [{"title": "Up (Freestyle)", "album": null, "year": null, "lyrics": "[Hook: LoveRance]\nI beat the Pussy UP, UP, UP, UP, UP, UP, UP\nI beat the Pussy UP, UP, UP, UP, UP, UP, UP\nI beat the Pussy UP, UP, UP, UP, UP, UP, UP\nI beat the Pussy UP, UP, UP, UP, UP, UP, UP\nI beat the Pussy Up\n\n[Verse 1: Nelly]\nHey, you know what it is\nScorpio, ma’, you know what it is\nFuck advice, ma’, Im only giving dick\nTilt your head back and catch one of these kids\nGive you that facebook poke\nStep up to the place where the poo-hole stroke\nLeave a bitch screaming, now he’s no joke\nCall him \"cocaine\". Why? He’s so dope\nAnd nevertheless, I’m with the best\nAnd some of the best are all of the victims, too\nThat dick\nAnd nevertheless niggas will stress\nTalking the shit like I bet he won’t fuck my girl\nThat’s a bet\nThe pussy fat like sumo\nBeat the pussy up, now the bitch want a sumo\nBetter than me, who you know?\nJust y'all, treat us, what you need me for?\nI like grinding on the pussy\nPeek under in the covers\nSpying on the pussy\nHead all in it, I got my mind on the pussy\nFuck ya in the dressing room, tryin’ on the pussy\nShe know she like it\nEven called a girlfriend over to try it\nNow I’m beating up one, the other biting\nI said I’m beating up one, the other biting\n\n[Hook]\n\n[Verse 2: Nelly]\nYou ain't heard about me?\nIm the Undisputed champ in the B.E.D\nSome call me Sony got plenty HD\nTalking hard dick, I ain’t talking TV\nI hit it from the back if you want\nDick suck, gotta leave if you don’t\nIt won’t get hard if you won’t\nI promise you, I know my dick\nI’m beat it up across the room, across the floor\nTo your core, you want more\nYour head hitting the door, your body aching and sore\nYou’re waving a white flag, I gotta declare war\nI think your body is my enemy, yeah\nBut I believe I should love that enemy\nI don’t know what the hell got into me\nFuck what was, let me say what finna be\nAss smack her poo like ?weight? choking\nAss black and blue, like her booty out here locin'(what up cuz)\nToo late night, Nelly has spoken\nI'mma go down on the pussy; Oakland\nYeah, you heard it right\nI’m built for long days, equipped for long nights\nMy life is like movies\nShowers in Jacuzzis. Shoot dick like Uzis\n\n[Hook]", "image": "https://images.genius.com/8acc2c921ff6defb4a5463597263ff0e.750x750x1.png"}], "artist": "Nelly"}