{"songs": [{"title": "Goin Thru It", "album": "Trap-A-Velli 2 (The Residue)", "year": null, "lyrics": "[Verse 1]:\n(Yeah, 2 Chainz! Yeah. Yeah.)\nHere goes nothing\nI'm suffering neglection\nJust failed the test and got taught me a lesson\nIn first place, steady second guessin'\nYes it's in my second nature, destination for depression\n\n[Hook]:\nI'm goin' thru it, dawg. I'm goin' thru it (x4)\n\n[Verse 2]:\nI use my mental, I don't use a pencil\nCome off the top, comin' from my heart\nThen I made a turn, straight off the lot\nNiggas know my flow, straight out the pot\nAnd the work, straight off the dock\nCross the wrong path, you'll be straight at the doc\nKeisha started crying, \"Mama pray for me\"\nIf my nigga cross me, he a dead homie!\nErase him, cremate him, we made him, replace him\nReplay it like a murder scene\nAnd I pause it\nOn the part where you mothafuckas bleed\nI bear arms, nigga, long sleeves\nRide rims in the winter, nigga, cold feet\nYeah, no safety on the mothafucka\nRun in the bank like Jason in the mothafucka, masked up!\n\n[Hook]:\nI'm goin' thru it, dawg. I'm goin' thru it (x4)\nI get a pat down, I'm goin' thru it\nI get a bitch, dawg, I'm goin' thru it\nGoin' thru it (x4)\n\n[Verse 3]:\nOne blunt, two blunt, three blunt, four\nOne blunt left, somebody go to the store\nGet a two liter, don't forget the cups\nJust bought a eighth, 'bout to pour up\nYeah, and that's about to go down\nJust rushed the cup and I'm about to slow down\nMr. Miyagi you waste wax on the floor\nI ain't happy unless I got stacks on the floor\nNiggas bet with me, racks on the floor\nAnd since I been winnin' I relax on the floor\nFeet up, and my iron cocked\nNigga not grown, they gon' get they mind rocked\nRunnin' shit like a Z28 IROC\nFrom the apartments, dinner I had sack lunch\nAn AK and a UZI, got tattoos to cover up the bruises\n\n[Hook]:\nI'm goin' thru it, dawg. I'm goin' thru it (x4)\nI get a pat down, I'm goin' thru it\nI get a bitch, dawg, I'm goin' thru it\nGoin' thru it (x4)", "image": "https://images.genius.com/c94d17e90b27cde0ec043eac60d61663.500x500x1.jpg"}], "artist": "2 Chainz"}