{"songs": [{"title": "Chiraq", "album": null, "year": "2014-05-03", "lyrics": "[Produced by Allen Ritter, Boi-1da & Vinylz]\n\n[Hook]\nYou fuck around get smoked\nYou fuck around, you fuck around, you fuck around get smoked\nNigga, you fuck around get smoked\n\n[Verse 1: Meek Mill]\nUh, niggas know the rules in my hood\nIf you touch me you get murked\nWe ain't with that back and forth, it ain't no rap, we hittin' first\nG-5, we be at LIV by Sunday when you in the church\nMomma stressin', sellin' dinner platers\nTryna get your casket and get ya hearse\nLast nigga that slid on us got dropped on it, he told on us\nEvery nigga you see with me got ice on 'em, bank rolls on us\nNaw nigga, no 1 on 1's, we don't fight fair, we just roll on 'em\nV-S stones and Cuban links, all that ice wear with that gold on 'em\nWe ain't swingin' no flag, nigga\nWe ain't need no pass, nigga\nGlock 40 with a 30 clip and a laser on it, play tag with us\nEverybody wanna talk bricks\n'Til them feds swoop in and grab niggas\nDream Chasers got into somethin'\nWe don't ever blink 'cause we trash niggas\nI don't know if y'all heard 'bout what my homie do with that 30 out\nDeen Buck still in the cut and the state fittin' to let Ernie out\nI ain't even gotta say nothin'\n'Bout that other homie that you heard about\n'Cause if he heard about that you run your mouth\nHe come to your house and start swervin' out\nCatch me N-Y-C, out Shadyville, I'm in the tank\nOnly time it's Manhattan when I'm in the booth or I'm in the bank\nSummertime in La Marina with Dominicans goin' in the paint\nPullin' up, screamin', \"Eh, Dimelo'?\"\nCatch you in Brooklyn, get pita-rolled, pussy!\n\n[Hook]\nYou fuck around get smoked\nYou fuck around, you fuck around, you fuck around get smoked\nNigga, you fuck around get smoked\nYou fuck around, you fuck around, you fuck around get smoked\n(Yeah! Ayy, Meek, whattup? Bang! Oh, man in Chiraq)\n\n[Verse 2: Lil Durk]\nNiggas say me and Sosa beefin'\nBut we both eatin', but only one keepin'\nTold Law he take 15 years\nEvery crime we did we gon Keep It Secret\nCan't tweet Teyana, corporate nigga lookin'\nSo what I’m on I gotta keep it secret\nThat face no Stevie no Mimi, I promise Teyana that I won't leak it\nGripped the 30, just cashed out\nIf you caught strippin' then you assed out\nI'm the same nigga my city asked about\nWhile you in the cut steady buyin' clout\nFuck the judge, let 9 out, hairpin trigger, let 9 out\nFour birds in the trap like four wings at Harold’s\nWith fries covered in mild sauce\nEverytime a nigga rap beef, get clapped up in a couple weeks\nIG comments and a couple tweets\nLocation on, we can go and meet\nHeadshot, I'm outta town, I'm in Killadelphia with my nigga Meek\nPop a wheelie in N-Y-C, I got the 30 on with my nigga Flee\nHeard Tyga sneak dissin' on me, tell them thot bitches I'm not right\nTyga only got one name, but that nigga ain't got one stripe\nHe backpack, so easy to get the nigga shit snatched\nAsk Mally Mall to get his shit back\nIn Chiraq, don't come here\nYou ain't from here? Don't come here\n'Cause shorty snipin', bag on him if he don't like this\nNo Young Chop, that .40 bangs just like him\n30 punch like Tyson\nBack to the rap flow, hot shit\nFuck I gotta rap for, got bricks\nEvery city I go, got sticks\nPockets Wells Fargo, no bricks\nSay I'm on top now, no shit\nYou can never say I wife shit\nI don't even like shit, I just pipe shit, one night shit\nL.A. with killas and thuggers\nNew York SlowBucks, them my brothers\nA-T-L with Migos and Young Thugger\nWe gon' shoot shit up in public\nAnd they gotta urge to take\nChiraq, look at the murder rate\n500 dead bodies, better go and get money 'fore you be on first 48\n\n[Verse 3: Shy Glizzy]\nYou wear red bottoms and Phillip Lim\nEverybody tryna get a hold of him\nBad bitches they be in Benz\nI knock ‘em down like bowling pins\nFeds snatch me, I don’t know them\nReal nigga on 4nem\nYoung Jefe, the new Soulja Slim\nHangin’ out the tank with Slow and them\nCome take a trip to D.C.\nHear a lot of Me and see GG\nI’m the big dog, I’m ringin’ off\nLike Mambo Sauce on a 3 piece\n“Glizzy, why you ain’t D.C.?\"\nWho said I ain’t D.C.?\nFuck ya bitch to my CD\nShe let me record her like Mimi\nA nigga playin’, it’s lights out\nOoh, shine got me iced out\nStay low 'cause the mice out\nYou only get fly when the Mikes out\nCan't wait 'til it get nice out\nTell Chino bring the bikes out\nGot 50 guns in my trap house\nYou better off fuckin’ with the White House\nI’m the realest youngin' in the fuckin’ world\nI got plenty money, I got plenty girls\nGot a villa for the week, got fifteen freaks\nAnd they all wanna go for a fuckin’ swirl\nHad her come to us with the marble pearls\nGlock 23, treat her like my girl\n357, that bitch just twirl\nMake him catch our shit like Fitzgerald\n\n[Hook]\nYou fuck around get smoked\nYou fuck around, you fuck around, you fuck around get smoked\nNigga, you fuck around get smoked\nYou fuck around, you fuck around, you fuck around get smoked", "image": "https://images.rapgenius.com/6ff2a7bbda0980a47c34867e7dc85b88.600x600x1.jpg"}], "artist": "Meek Mill"}