{"songs": [{"title": "Beautiful Lie", "album": "Black Dollar", "year": "2015-09-03", "lyrics": "[Intro: Rick Ross]\nUh, love that smoke and that fellatio\nAh, she make my dreams come true\nShawty make my dreams come true\n\n[Verse 1: Rick Ross]\nI seen her in the pretty car\nI seen her pretty ponytail\nWhen she pulled up to the crib\nI seen her pretty pair of heels\nSo I hit her with my street game\nNo, I never ever say my name\nI did hit her with the phone number\nBut looking in her eyes, recognize when I run up on you\nPull her shirt, once again, shawty with this work\nI'm a different type of nigga coming from the dirt\nBig truck, bruised up, sucking on her neck\nNeed a nigga to invest so I wrote a cheque\nMy dick rock hard baby seeing your success\nFreaky nigga pull a yacht, fucking on the deck\nShe said I ate her pussy,  if I did then I forgot\n\n[Hook: Rick Ross]\nOr was it a beautiful lie?\nOr was it a beautiful lie?\nOr was it a beautiful lie?\nOr was it a beautiful lie?\nIf I ate her pussy then I forgot\nShe told me a beautiful lie\nShawty told me a beautiful lie\nShawty told me a beautiful lie\nAnd that's something she'd do a lot\n\n[Verse 2: Rick Ross]\nShawty told me she was 22\nI'm the perfect type of nigga just to run into\n305, chillin' for a month or two\nFive star condo to feel comfortable\nCollins Ave, lookin' like the old Birdman\nOr out in Durban, nigga let your fur hang\nBird gang, saw 20 of 'em eryday\nTook her shopping she was slacking on her purse game\nBlowing 20 then I'm out\nNot outta money just let the driver know when to bounce\nStop by Tootsies for the crab cakes\nLap dance by a bitch who still on back page\nWalking through the door and everybody know her name\nDirty game, baby girl, a familiar face\nShe say the way I make her feel, she wanna change her life\n\n[Hook: Rick Ross]\nOr is it a beautiful lie\nShe told me a beautiful lie\nShe told me a beautiful lie\nShe told me a beautiful lie\nNigga name in the sky till the day I die\n\n[Bridge: [?]]\nYou don't gotta lie no more\nBeautiful lie\nBeautiful lie\nBeautiful lie\nBeautiful lie\nBeautiful lie\nBeautiful lie\nYou don't believe yourself, I know that\nYou don't believe yourself\nBeautiful lie, lie\nBeautiful lie\n(We believe in what we wanna believe)\nYou ain't gotta lie no more\nYou ain't gotta lie\n(Lexicon legend, Ralph)\n\n[Verse 3: Wale]\nKick game, ain't the same, what's your name baby?\nDo me a favor, get your legs out the way and uh\nI'm getting chains but I do not change\nOr I got them whips, chains, everything Christ' Grey baby\nFifty shades of black, white and one night\nPut an arch in your back, I'm running in your life, right\nWhen your man don't be right\nWhy have a Coke can, when you can have some Dom P right?\nYeah, it's only right, double M is intact\nNo hyperbole either, it's gonna hurt when I'm working those thighs\nScream like you thinking I'm doing permanent damage\nAnd I leave it, you breathin' like you was running some track\nBreath, breath... something to catch\nKitten catch tongue, while you cum you catching a cramp\nCatch Z's, catch O's, catch 'em again\nThen I wake up in the morning like fuck am I at?\nHuh? Where the fuck am I at?\nHey, yeah, where the fuck am I at?\nWhat the fuck did we do?\nShoulda tell your friend to come through\nMmm, where the fuck am I at?\nWhere the fuck am I at?\nWhat the fuck did we do?\n\n[Bridge: [?] & Wale]\nYou ain't gotta lie no more\nBeautiful lie\nBeautiful lie\nBeautiful lie\n(Beautiful lies to me)\nBeautiful lie\n(Beautiful lies to me)\nIt's alright, beautiful lies to me\nBeautiful lies to me, to me, to me\nYou ain't gotta lie no more\nBeautiful lie\nBeautiful lie\nBeautiful lie\nBeautiful lie\nBeautiful lie\nBeautiful lie", "image": "https://images.genius.com/be2a0055a8996220ec3bf561583cd405.800x800x1.jpg"}], "artist": "Rick Ross"}