{"songs": [{"title": "Westwood Crib Session - Freestyle (2017)", "album": null, "year": "2017-03-04", "lyrics": "[Verse: Hopsin]\nWhen I got the call to come up to Tim's, I couldn't wait to\nDamn it, who let the ape loose? Fuck a cage, I'ma break through\nGhetto, still sipping grape juice, who should I put the flame to?\nIf you hand me the throne just make sure it comes with a cape too\nThe only nigga with shit on lock is Hopsin, it ain't you\nWhen I'm up to bat man, my only option is Babe Ruth\nI never give into you incompetent lame dudes\nI buss you in your fucking head with a bottle of Grey Goose\nAnd I done lost myself, be happy? I don't know how to\nThe sunny days that I forgot to cherish are now blue\nNigga if you were me for while you would understand\nIf money doesn't change you, it'll change the ones around you\nSo I been ducking low, tryna hibernate and just find my way\nI've been gassing, I gotta find the breaks 'til my mind is straight\nI'm showing signs of hate 'cause I'm trapped in a darkness I embraced\nLook me in my eyes, you could tell I'm ready to die today\nIf you see me then don't come over\nI can't control my actions or emotions, the Devil's got the remote control an'\nStyle is cold and vulgar, got no composure\nDefeating me is like tackling a juggernaut with some broken shoulders\nSo don't provoke, this is deadly and isn't user friendly\n'Cause I own up to any truth you try to use against me\nSince high school I've been known to be an abusive MC\nI never stop the madness until I see you surrender\nWelcome to Savageville, where shit ain't average\nIt's madness, imagine a pack a stragglers swinging from chandeliers\nI'm in a Cavalier with a thot who drank a six-pack of beers\nGetting road head and she's driving, the fuck is happening here?\nI ain't calm and peaceful, nah, my small cerebral\nIs often evil, better hide like Doctor Jekyll's alter ego\nCall your people, I'm mad as addicts who lost the needle\nDon't buy my album because it's all illegal, too off to be on\nI'm talking Sméagol, I launch torpedoes, bitch, I'm the dirtbag\nThat ran up on wearing a Purge mask when you got your purse snatched\nHere's your one way ticket to Hell in first class\nY'all all be making my nerves spaz, my word craft will make you disperse cash\nI'm the special ed nigga you ignored, y'all the motherfuckers that I do it for\nWhen I step inside the booth I'm lighting everything on fire like I was the Human Torch\nWhooping ass, kicking through the door, spewing gore, breaking windows of your new Accord\nAnyone who ever left better not be coming back to try to build a new rapport\nI'm wild rude, a foul dude, I prowl through\nI step on the mic and all the sudden my bowels move\nCatching bodies? I'm 'bout to\nI'm the one you should bow to, you niggas is ass, trash, cow poo\nStyle's based off pure vengeance, I'm a fierce engine\nYou'll get rear-ended, there's weird tension, my peers sense it\nI'm a feared misfit, a geared henchman, you scared senseless\nIt's tear-drenching, but you'll be hooked after a mere sentence\n\n[Outro: Hopsin]\nAnd I'm out this bitch. Tim Westwood TV, baby. Yeah. Undercover Prodigy", "image": "https://images.genius.com/0483aa281d8062fc2d59ba81ca7afbee.720x960x1.jpg"}], "artist": "Hopsin"}