{"songs": [{"title": "Overnight", "album": "Bobby Tarantino II", "year": "2018-02-27", "lyrics": "[Intro]\nYeah, maybe this should just be the intro, like this\nThat's it, squad, bitch\n\n[Verse 1]\nAll these bad bitches say they love me, I already know\nCheck the- check the bling that's on my finger 'cause I'm married, ho\nThere he go, everybody know that boy's pockets is swole\nWhat's good? That sound familiar, never been here befo'\nLife good, 'cause I just got quoted two hundred a show\nOh no, oh no, two hundred a show\nOvernight, all this money that I've been makin', I gave it right back\nTo all of the people that made me, you know we like that\nDon't know why your bitch wanna date me, but I can't fight that\nGuess you ain't done shit for her lately, not on the right track\nIf I think that shit sound good, I gotta write that\nWeed man knockin' on the door, I'll be right back\nPass the shit to 6ix, watch him light that\nHit the studio, record the shit, then mix the shit, then master it\nAnd then we do the show and they recite that\nBitch, I'm right back, told 'em 'bout my life, told 'em 'bout my life\nTold 'em I was broke as fuck too many nights\nNow I see my name up on so many lights, but everybody prolly think this shit done happen–happen–happen\n\n[Chorus]\nOvernight, people think this how this shit happened, but they never right\nActing like they got it, they got it, but they never quite seem to understand that this right here deeper than all that\nHustlin' the streets like they trap over–over–overnight\nPeople think this how this shit happened, but they never right\nActing like they got it, they got it, but they never quite seem to understand that this right here deeper than all that\nHustlin' the streets like they trappin' and burnin' (Woo, woo)\n\n[Bridge 1]\nTell me how you really feel, how you really feel\nAll they ever do is hate the boy, but now they know the name\nTell me how you really feel, how you really feel\nAll they ever do is hate the boy, but now I run the game\nTell me how you really feel, how you really feel\nYou can hate now all you want, but shit won't ever be the same\nTell me how you really feel, how you really feel\nYou can hate me, but I'm not the reason that your life is lame\n\n[Verse 2]\nTell me, is it really so hard?\nReally so hard, to be a good person?\nTell me, is it really so hard?\nReally so hard, to stop acting like a bitch? (Woo!)\nI treated everybody with respect and now I'm rich (Woo!)\nI treated everybody with respect\nMaybe you got issues with your daddy, doe\nMaybe you was bullied back in high school\nMaybe you are just a tool\n\n[Bridge 2]\nMaybe you're the reason, you're the reason\nThe reason I don't fuck with nobody, and\nMaybe you're the reason, you're the reason\nThe reason I came up with nobody, and\nMaybe you're the reason, you're the reason\nEverybody think this right here happened\n\n[Chorus]\nOvernight, people think this how this shit happened, but they never right\nActing like they got it, they got it, but they never quite seem to understand that this right here deeper than all that\nHustlin' the streets like they trap over–over–overnight\nPeople think this how this shit happened, but they never right\nActing like they got it, they got it, but they never quite seem to understand that this right here deeper than all that\nHustlin' the streets like they trappin' and burnin' down, shit", "image": "https://images.genius.com/ecca619555735d1ae7b55fc72ec50140.1000x1000x1.jpg"}], "artist": "Logic"}