{"songs": [{"title": "Summer Madness", "album": "The Pursuit (EP)", "year": "2011-06-22", "lyrics": "[Intro: James Fauntleroy + Common]\nIs the sun in your eyes?\nIt's me again, No I.D. again, yeah, uh...\n\n[Verse 1: Common]\nBlack heat on the streets of desire\nSome got rich and some got priors\nMy dogs hop barbed wires and steal cars with pliers\nWanna see more and be more like the wire\nLive Via-Com from the city of Chi\nBut it's never quiet, huh\nThis is the noise of suppliers and buyers\nGangbangers that should've retired, food from deep fryers\nI'm getting high thinking how to reach higher\nBald but these broads is my Delilah\nSamsung pictures, more spit scriptures\nShorties hold liquor, flows get richer\nIt gets thick like my bro's little sister\nHormones got 'em thicker quicker\nPure souls that become boa constrictors\nMixed up like elixirs, trigger happy in the midst of\nSummer madness\n\n[Chorus: James Fauntleroy]\nIs the sun in your eyes?\n'Cause you're missing all the sights\nBut it's gonna be alright\n\n[Verse 2: Common]\nIt's summertime, niggas bring the heat out\nGun talk is how summer start to speak out\nShorties bear arms 'cause don't nobody reach out\nYoung frames leak out, aunties freak out\nThe front porch is sorta like the beach house\nNiggas running bases with their cleats out\nEvery week now I'm getting texts about death\nLeaving me out of breath\nI gotta step to the stairway to heaven, it started on 87\nBarack was playing sermons riding Reverend Clay Evans\nI never really took it in like them youngsters\nIt's how I looked at them, maybe I should look again\n'Cause death and prison sentences ain't how their book should end\nWhen you go outside you still gotta look within\nYou can't scare 'em straight 'cause they keep a crooked grin\nI hate to say it's fate, look at what could've been\nIt's summer madness\n\n[Outro: Common + James Fauntleroy]\nSummertime got you blind\nI prefer your goddamn mind\nYeah, it's summer madness\nBut it's gonna be alright\nIt goes on in Chitown, yeah\nIt's gonna be alright\nIt goes on in Detroit, ATL\nIt's gonna be alright\nTo my peoples up in Brooklyn true, yeah\nBut it's gonna be alright\nOut there in New York, Queens, Harlem\nMy West Coast people out in L.A., yeah\nAll the way to Alabama, you know, up there to Seattle\nYou know you got hoods all over", "image": "https://images.genius.com/472b4faaf0ab545485b553703ded02da.600x600x1.jpg"}], "artist": "Common"}