{"songs": [{"title": "Paradise", "album": "Hy!£UN35 (HiTunes)", "year": "2015-07-04", "lyrics": "[Intro]\nWoo! Woo!\nThugger!\nUh\n\n[Verse 1]\nHeard these niggas sneak dissing\nI don't know how I'ma go about it\nI had a bitch and then I left her\n'Cause she think I like a bitch that used to show her body\nThese silly games ain't nothing serious\nIf she fresh I know she fuck for something on her body\nI swear to God I'm so delirious\nThat a Coke frame would make me empty my pockets\nRollie pollie ollie nigga\nI got three strikes and I ain't bowling nigga, psh\nI been poppin' lots of shit when I was rich\nThe same shit poppin' with a quarter nigga\nPockets are all swollen nigga\nI want that face like a emoji nigga\nI'm the same nigga boolin' on the block\nLike it's never been a cop\nLike my ring ain't worth a solar system\n\n[Chorus]\nCome with me to paradise\nI'll be your king you are my wife\nI've never been in love oh my\nI need you to complete these ties\n\n[Verse 2]\nFuck a lake, I got fish here\nKill him, tell his momma get well\nI'ma pull off watch me fishtail (Skrrrt)\nSpelling YSL\nWhere my lean at, I need potion\nI ride the beat, I never roll it\nI never gave them swag, they stole it\nI transform like I'm in Otis\nLet's play a game, bankrolls on us\nFresh kids, there are never same clothes on us\nWe the slimes, big snakes, can't poison us\nHundos in my pockets and they ain't old as us\nPussy niggas get buried today\nAll my ex bitches might get embarrassed today\nI'm high as all flight attendants today\nMilk carton, your bitch is missing today\n\n[Chorus]\nCome with me to paradise\nI'll be your king you are my wife\nI've never been in love oh my\nI need you to complete these ties\n\n[Verse 3]\nThis nigga talking about this\nAnd this nigga talking about that\nAnd I don't know who to believe\nTo be honest I don't care\nJust keep that lying shit over there\nI don't want that germ on my team\nOne bitch sucking on my dick\nAnother bitch eating her from the back\nTell me who wanna join the scene?\nI said who wants to join the scene?\nBoss up\nB-O-S-S nigga, boss up\nRun that check up and blow a lil' some\nBlow it then you stack it back up to the sun\nYeah, yeah, yeah, yeah, yeah\n\n[Chorus]\nCome with me to paradise\nI'll be your king you are my wife\nI've never been in love oh my\nI need you to complete these ties", "image": "https://images.rapgenius.com/0b361147cf337536627bde10fc6b0b04.600x600x1.jpg"}], "artist": "Young Thug"}