{"songs": [{"title": "The New Workout Plan (Remix)", "album": "College Dropout: Video Anthology", "year": "2004-02-10", "lyrics": "[Intro]\nYou just popped in the Kanye West\nGet Right For The Summer workout tape\nAnd ladies if you follow these instructions exactly\nYou might bear to pull you a rapper, a NBA player\nMan, at least a dude wit' a car\nSo first of all we gon' work on the stomach\nNobody wants a little tight ass!\n\n[Verse 1]\n1 and 2 and 3 and 4 and get them sit ups right and\nTuck your tummy tight and do your crunches like this\nGive head, stop breathe, get up, check your weave\nDon't drop the blunt and disrespect the weed\nPick up your son and don't disrespect your seed\nIt's a party tonight and ooh she's so excited\nTell me who's invited: you, your friends and my dick\nWhat's scary to me is Henny makes girls look like Halle Berry to me\nSo excuse me miss, I forgot your name\nThank you, God bless you, good night I came..\nI came...\nI came..\n\n[Hook]\nIt's been a week without me\nAnd she feel weak without me\nShe wanna talk it out but\nAin't nothin' to talk about\n'Lest, she talkin' about freakin' out\nThen maybe we can work it out\nWork it out (Come on) 4x\nWork it out now\nMaybe we can work it out (Come on, come on)\n\n[Verse 2]\nOh girl your silhouette make me wanna light a cigarette\nMy name Kanye from the Jigga set Twista said \"Get It Wet\"\nOoh girl your breath is HARSH\nCover your mouth up like you got SARS..\n\n[Lil Jon]\nSTOP! IT'S THA MUTHAFUCKIN' REMIX!!\n\n[Beat changes to Lil Jon's version]\n\n[Verse 3: Fonzworth Bentley]\nB-E-N-T-L-E-Y\nYee ain't know, you betta ask somebody\nWhat we gonna do is twirk that body\nAll day, every day fitness party\nLock them doors, don't tell nobody\nGentlemens in the Gentlemen's Club\nAnd hitting them with an interesting dub\nIt's upside down that's for the A-Town\nWhat y'all sayin'?\nF.J. Bentley caught misbehaving\nYes I'm the captain and I'm saving, all my money\nYes I'm just gonna stand and watch you dance from over here\nMatter fact pass the Couvorsier\nBut I will walk you to your car my dear\nCheers\n\n[Hook]\nIt's been a week without me\nAnd she feel weak without me\nShe wanna talk it out but\nAin't nothin' to talk about\n'Lest, she talkin' about freakin' out\nThen maybe we can work it out\nWork it out (Come on) 4x\nWork it out now\nMaybe we can work it out (Come on, come on)\n\n[Interlude: Ladies speaking w/ Kanye in the background]\n[Jill] Hi may name is Jill, I just want to say thanks to\nKanye's workout plan. I was able to pull a NBA player\nAnd like now I shop every day on Rodeo drive\nI just want to say, thank you Kanye! woooo! woooo! woooo!\n\n[Lasandra] My name is Lasandra, and I just want to say\nThat ever since listenin' to Kanye's workout tape\nI was able to get my phone bill paid, I got sounds and 13's\nPut up in my Cavalier and I was able to get a free trip to Cancun\nAnd what's most importantly is that I ain't gotta fuck Ray Ray's\nBroke ass no mo'\n\n(Work it mo' juke it mo' pump it mo, Chi-town mo' let's go mo')\n\n[Ellie Mae] My name is Ellie Mae from Mobile, Alabama\nAnd I just want to say since listenin' to Kanye's workout tape\nI been able to date outside the family, I got a double wide\nAnd I row the plain, row the plain, row the plain\n\n[Girl] Thanks to Kanye's workout plan\nI'm the envy of all my friends\nSee I pulled me a baller man (yeah)\nAnd I don't gotta work at the mall again\n\n*Beat changes*\n\n(Lemme break ya wit' a piece of)\nMy favorite work out plan (oh! oh! oh!)\nI wanna see you work out (yeah yeah yeah yeah, yeah yeah yeah yeah)\n(It's that old Michael Jackson shit)\n\nThat's right put in work, move your ass, go wizzerk\nGet your salad, no dessert\nGet that man you deserve\nIt's Kanye's workout plan\nI said it's Kanye's workout plan (Ladies and gentlemen)\nIt's Kanye's workout plan (Allow myself to introduce myself)\nHis woooorrrrkkoouut plan (This time around I want y'all to clap like this)\n\nThat's right put in work\nMove your ass, go wizzerk\nEat your salad, no dessert\nGet that man you deserve (Stop!)\nIt's Kanye's workout plan (Ok bring)\nI said it's Kanye's workout plan (I know y'all ain't tired)\nIt's Kanye's workout plan (But I hope not, 'cuz on this one I need ya)\nHis woooorrrrkkoouut plan (to give me a soul clap ok? double time)\n\nThat's right put in work (Woo!)\nMove your ass, go wizzerk (Ow!\nEat your salad, no dessert (Ugh!)\nGet that man you deserve\n\nThat's right put in work (Put in work)\nMove your ass, go wizzerk (Go wizzerk)\nEat your salad, no dessert (No dessert)\nGet that man you deserve (You hear, ugh)\n\nThat's right put in work (That's right put in work)\nMove your ass, go wizzerk (Go wizzerk)\nEat your salad, no dessert (Eat your salad, no dessert)\nGet that man you deserve (Woo!)\n\n(Okay, okay, okay, that's, that'd be good) *Applause and cheering*\n(I appreciate your time)\nI want to see you work out for me\nWoah yeah", "image": "https://images.genius.com/cd039262fbee95c9aa27b3639c26fe5f.711x1000x1.jpg"}], "artist": "Kanye West"}