{"songs": [{"title": "Runnin’ (Dying to Live)", "album": "Tupac: Resurrection", "year": "2003-09-30", "lyrics": "[Intro: Rob May & 2Pac]\nBetween you and Biggie it was like, who's going to rule the\nNigga kingdom and shit, basically, know what I'm saying?\nI was like, this is like a fucking election\nIt is that\nYou know what I am saying\nMe and Biggie's situation is smaller than that, it's like…\n\n[Hook]\nAnd I wonder if they'll laugh when I'm dead?\nWhy am I fighting to live if I'm just living to fight?\n(You don't know)\nWhy am I trying to see when there ain't nothing in sight?\nWhy am I trying to give when no one gives me a try?\nWhy am I dying to live if I'm just living to die?\n\n[Verse 1: The Notorious B.I.G.]\nCheck it, I grew up a fuckin' screw-up\nGot introduced to the game, got a ounce and fuckin' blew up\nChoppin' rocks overnight\nThe nigga Biggie Smalls tryna turn into the black Frank White\nWe had to grow dreads to change our description\nTwo cops is on the milk box missin'\nShow they toes, you know they got stepped on\nA fistful of bullets, a chest full of Teflon\nRunnin' from the police, picture that\nNigga, I'm too fat, I fuck around and catch a asthma attack\nThat's why I bust back, it don't faze me\nWhen he drop, take his Glock and I'm Swayze\nCelebrate my escape, sold the Glock, bought some weight\nLay back, I got some money to make, motherfucker\n\n[Hook]\nAnd I wonder if they'll laugh when I'm dead?\nWhy am I fighting to live if I'm just living to fight?\nWhy am I trying to see when there ain't nothing in sight?\nWhy am I trying to give when no one gives me a try?\nWhy am I dying to live if I'm just living to die?\n(It's on me)\n\n[Verse 2: 2Pac]\nBut still I'm havin' memories of high speed when the cops crashed\nAs I laugh, pushin' the gas while my Glocks blast\nWe was young and we was dumb, but we had heart\nIn the dark, will we survive through the bad parts?\nMany dreams is what I had, and plenty wishes\nNo hesitation in extermination of these snitches\nEnvious bitches, they still continue to pursue me\nA couple of movies, now the whole world's tryna screw me\nEven the cops tried to sue me, so what can I do?\nBut stay true, sippin' 22's of brew\nAnd now media is tryna test me\nGot the press askin' questions, tryna stress me\nMisery is all I see, that's my mind state\nMy history with the police will shake the crime rate\nMy main man had two strikes, slipped, got arrested, and flipped\nHe screamed \"Thug Life!\" and emptied the clip\nGot tired of runnin' from the police\n\n[Hook]\nAnd I wonder if they'll laugh when I'm dead?\nWhy am I fighting to live if I'm just living to fight?\nWhy am I trying to see when there ain't nothing in sight?\nWhy am I trying to give when no one gives me a try?\nWhy am I dying to live if I'm just living to die?\n\n[Outro: 2Pac]\nThey wanted a new regime. And my regime includes East coast, includes West coast\n\n[The Notorious B.I.G.]\nI was more shocked than anything\nYou know what I'm sayin'?\nBut I wasn't more shocked of him dying\nI was more shocked of him… Pac is a strong dude, yo\nI know dude, you know what I'm sayin'? Real strong\nSo when they was like he got shot, I was just more like, \"Again?\" you know what I'm sayin'?\nHe always getting shot, or shot at\nHe going to pull through this one again\nMake a few records about it, and it's going to be over\nYou know what I'm sayin'?\nBut when he, when he died, I was just like, \"whoa\", you know what I'm saying? Kinda took me by\nI mean, even though we was going through our drama\nI would never wish death on nobody\nYou know what I'm sayin'?\nBecause there ain't no coming back from that", "image": "https://images.genius.com/6257fe15b02c727932e884339c27b0a5.600x600x1.jpg"}], "artist": "2Pac"}