{"songs": [{"title": "Level 10", "album": "Drift Away ", "year": "2017-08-08", "lyrics": "[Intro: Logic]\nYeah!\nYou're trying to beat this game right now?\n\n[Verse: Logic]\nThis is level 10, it's level 10 y'all\nThis is level 10, it's level 10 y'all\nGotta use your logic, the force\nGotta use your logic, the force to get pass\nTo make it to the end\nMake it to the end, don't pretend\nCome on be my friend\nTell me how you're feeling the second I'll do it\nI've been dealing on that real ish\nI've been dealing on that real ish, uhh\nI'm the boss of all bosses\nNot one to floss but I need it\nThis is how we do it I gotta feel it, right now\nI can feel it from the whole style\n'Bout to kill this whole motherfucking shit freestyle\nUp the top of the dome\nSend them all home\nIf you can't beat this level that's word to the devil\nWhat you gonna do?\nI'm pullin' strings like Geppetto, can you feel me now?\n'Cause I wanna be a real boy\nCan you beat this level? I don't know (Let me hear that)\nI'm gonna make it, yeah, I got the force\nI wish Kan was Obi\nLouis Vuitton dot Kenobi\nThat would make me dot D\nLuke Skywalker 'cause I'm a fly talker, not a death star\nBut they ain't ready for that, that's from the demos right there\nThat's that Damian Lamar Hudson first real project out the game\nElysium, what?\nSee, that's why you gotta wait\nThat's why you're so happy\nYou're at level 10 right now\nCause you're just hearing me mess around giving you all freestyles, check it\nUh, I've been working all night\nWhat you're talking about?\nYou can't give 'em that\nI've been grinding, working really hard\nBut it's gonna be a while\n'Cause I'm taking my time, feel the style\nCan you understand?\nI gotta get it, that's my man\nL-O-G-I-C, I'm reppin' MD to the fullest\nThey push us but never pull us\nAnd we out in LA, yeah\nI've been chillin' on my compound\nThat house going down\nCan you feel the smile? Nah, nah, never frown\nI gotta keep it real good when you come around\nTell me how you feeling right now\nI'm a villain right now\n'Cause I'm the boss of all bosses, said I'm the boss\nCan you make it to Elysium? I don't know\nBut [?] did that's for sure\nAll you other motherfuckers wack as hell\nYou're wack as hell!\nLevel 10\nWoo, Level 10\nLevel 10, yeah, yeah\nAnd if you hear me rapping still it means you ain't make it yet\nWhy the hell you ain't beat this level?\nYou ain't good enough or something?\nYou suck! You suck at playing video games!\nYou're just a lame but I'm not the same\nI'm not the same\nAnd I'm here to kill it gotta do it like I never did it before\nThis is how we do it with the outro\nThis is, this is how we do it with the outro\nLevel 10\nL-V-L one zero\nThis is how we gotta do it\nTell me you the hero (Mhm)\nI don't know if you really is\nBut this is what we gonna do for you kids\nYeah, yeah we gon', we gon\nFeeling like Darth Vader\nThey wonder where my face went\nGod damn I've been doing shit this since the basement\nThat's how we got to do it one time\nAnd if you still here this rhyme\nThat means you still ain't make it\nCause this is level 10\nThis is better than ever\nThis is how we do it, my friend\nWe gotta keep it going, and going, and going, and going\nThey don't understand this is how we do it\nShout out to them girls that be hoein' on the black side nahhh\nI'ma keep going all night now\nI'ma keep rocking in the pocket, in the pocket, in the pocket on that go, go tip\nLike the OG Bobby Smokey Hall that's my daddy\nThis is how we do it riding around the cadi\nGod damn from DC to MD to BG\nI'm back again this is how we do it\nI'm black again the blackest the badest\nYou ain't beat the game yet damn you the madest\nHuh that's my Yeezy flow\nThis is how we get it that's for show\n\n[Outro: Damian Lemar Hudson]\nSinatra", "image": "https://images.genius.com/0c00723271f1986751b2de2c10e31f6d.1000x580x1.png"}], "artist": "Logic"}