{"songs": [{"title": "Malibu", "album": "Faces", "year": "2014-05-11", "lyrics": "[Intro]\nThe good times can be a trap!\nOh yeah? Ha ha ha\nOh hell naw (Yeah, yeah)\nNot here\nCheck myself into rehab\nYeah, um... I might die before I detox\n(You piece of shit)\nNow that's a bar\nI'm gonna save that one for a little bit (You piece of shit)\nNow let me come with- with something else, you feel me? (Here we go!)\n\n[Verse 1]\nIt's Air Jordan on my flip-flops (Woo!)\nAnd kill me now if I did it all for hip-hop (K-ch, blaow)\nI might die before I detox\nThis ain't high-school, no little Asian I can cheat off (Mimimimimimimimi)\nWe keep chiefing while police watch (Woo)\nLoss in vibration sirens blowing up the weed spot (Ha, yeah)\nAnd Heisman hopefuls all growing up to be cops\nChasing after gangsters but they never find the G spot (Ohh)\nI'm recording like I'll die tomorrow (Die)\nAt the rate I'm getting high, it'll be hard for me to find tomorrow (Find)\nBut I just pray that I'll survive tomorrow (Oh my God)\nAs she cries in sorrow (Oh my God), she just needs some time to borrow\nShe'll be smiling by tomorrow\nEverything will be so fine tomorrow (Yeah)\nPut the white away, we can do some lines tomorrow\nCome say hi to Morrow (Hello)\n\n[Interlude]\nWell I’ll be damned if this ain’t some shit\nWell I’ll be damned if this ain’t some shit\nHere I am\nOh... I know you see me\nHere I am\nYeah... and I'll be damned if this ain't some shit but here I am!\n\n[Verse 2]\nI'm the only suicidal motherfucker wit' a smile on (Ching)\nLet’s hold hands and sing the Bible, that’s a violent psalm\nThe high-strung, eyes-low, ride along\nEverybody grab a fucking number, this a dieathon (Mimimimimi)\n(Kill me) Oh, I'm the bomb (Hell yeah)\nLiterally back away, I'm the bomb (Ka-plow!)\nLet me get my lion on (Growl)\nYeah, okay\n85 grand get you a heavy ass wrist (Bling)\nThey ain't killin', they just yellin', that's it (Ahhh!)\nA deadly combination with that ecstasy sniff (Uhh)\nOn the phone probably yellin' at Rich (Come on man!)\nSay, double the money (Double the money!), please, double the money (Double the money!)\nTriple the problems, double the money\nThey was all laughin', wasn't that funny? (Hahahaha)\nI started fucking with drugs and now I'm a junkie\nThe U-S of A, I fuck with my country (Oh)\nBut Uncle Sam could never teach me how to Dougie (Oh, oh)\nI'm thinking till my brain pops\nSpitting is a cake walk (Whoa)\nI'm just a rapper, guess I'm sticking to my day job (Woo)\nWiz getting faded, come and kick it at a bake shop\nEverything is A-1, steak sauce\n\n[Outro]\n(Ohh, thank God)\nGoddamnit (Thank God)\nThank God\nHere I am and I'll be damned if this ain't some shit\nHere I am and I'll be damned if this ain't some shit", "image": "https://images.genius.com/13ce35ef8b892b61cbe71e14f5a9e8f2.1000x1000x1.jpg"}], "artist": "Mac Miller"}