{"songs": [{"title": "2.0 Boys", "album": "Straight From The Vault EP", "year": "2011-03-09", "lyrics": "[Verse 1: Royce da 5'9\"]\nRyan's a homicidal misfit, I write the solution of biophysics\nOn the side of a cliff in some hieroglyphics\nThis my admission to having violent psychotic wit\nDevour, polish it, politics\nBy the way I'm higher than the Eiffel Tower tip\nI like writing, but I will stick this pencil in your ass\nBefore I write your shit, pause, inhaling hella kush\nUs and Yelawolf like a heavy foot gas pedal push\nFelons, crooks, going door-to-door\nLike we selling books, Dolly Parton style, melons mushed\nNow my bitch a dancer, I'm about as sick as cancer\nIf you could swallow my style, you'd probably rip your pants up\nIf you could bottle my style and sell it to somebody\nIt probably will smell like cologne made out of bits of panther\nThey call me Anchorman, I hold down the ship\nLeave you niggas floating in water, then go and drown a fish\nFuck, I'm fucking heinous, I make you fucking famous\nThem lead showers is coming, fuck is you saying?\n\n[Verse 2: Eminem]\nFUCK! It's fucking raining, SHIT! There's lightning, BITCH!\nIt's thundering cause I'm cussing up a storm if you wondering, SHIT!\nSHIT! You couldn't muster up enough thought\nTo take a dump during a brain fart, chump\nIf you want urine in your face, all you had to do was say\nThat you wish you would've just stayed pissed off in the first place\nWe came to monopolize the game, Illuminati is here\nYeah, human oddities, at odds with us, your squad's gotta be\nCause we started out cold in a snowball, we froze\nSoon as we rolled up on these hoes, all's we know\nIs y'all lowered the bar like limbo, you know who you are\nSo quit fucking the dog before we start calling YOU Bizarre\nShit, screw the pooch, y'all done raped a pitbull\nFell in love with the shih-tzu, this missile's directed directly at you\nAnd this for these hoes who don't know me from a can of paint\nYou must be huffing, fuck a ball sack\nIf the taints can't take you on a date, you mistake me for a gentleman\nYou 2000 and late, man, and Will I ain't, I'm the bad guy\nType of guy that will drag five girls up on stage\nPour ice in their pants, and the first one who pees gets a black eye\n\n[Chorus: Eminem]\nMust be outta your mind\nYou think you fucking with us\nSuck on these nuts, bitch, hang it up\nThis game is over\n\n[Verse 3: Joell Ortiz]\nPuffin' loosies, watching \"I Love Lucy\" with Gary Busey\nCrazy, how the fuck could you son me? I'm Shady\nWill there ever come a day when they could slay me?\nI don't know, fifth month, black and yellow insect, maybe\n'Til then I kill the bad man trying to slay me\nEverything you kick weak, your spit kung fughesi\nAll my homeboys, 2.0 Boys\nNickel, I just picked up a Phantom, look how it rolls, Royce\nEven if I wanted to quit, I ain't got no choice\nVerses keep coming, I should invoice my own voice\nYou should see the kind of asses that my pole hoist\nHoes be like diamonds in your chain, man, so moiss\nBang bang, bang bang, House Gang, chainsaw\nHere to kill you pussies, don't ask what we came for\nI write until my right arm veins sore\nForearm feel like Thor's arm in a gang war\nYou hear that? Yaowa, you know who finna fall out\nDefinitively finish you, my fist take out that eyeball\nPiranha mentality with a Jaws bite all night\nComing up, never saw light, but never lost sight\n\n[Verse 4: Joe Budden]\nJets and movers, cesspoolers, meth abusers\nYou step to us, text Rugers to respect the shooters\nMy men think in sync, roll with the best crew\nMove to the beat of the same drum without Lex Luger\nWelcome to Nayhood, big in the 'jects, G\nCheated death multiple times without rigging the deck\nSo I'm well-prepped if you just want war\nThere will be blood everywhere, you be laying on the Louboutin floor\nIt's raw, you keeping acting like you don't know Mouse, nigga\nAnd you going to need the best doctors, House nigga\nGuard your jewels and avoid large tools\nCause after I spill you at the light, you be in a car pool\nKeep your distance from idiots, cause the truth told\nThey food for thought's rotten, they gems are fool's gold\nNeed results from my actions, mistakes I'll exonerate\nI'm Martin King staring at a picture of Obama's face\nTalking funds, niggas ain't never seen stock\nI don't need the key to the game, I pick a mean lock\n\n[Chorus: Eminem]\nMust be outta your mind\nYou think you fucking with us\nSuck on these nuts, bitch, hang it up\nThis game is over\n\n[Verse 5: Crooked I]\nTake off, you invited inside of the mind of\nA psychotic rhymer, I'm kind of a (Dahmer)\nI'm grinding up rappers are lining up jackers, I'm climbing up ladders\nI buy enough clappers to retire you factors, fire at drama\nYou liars and actors, I'm the genuine article\nBut read me wrong, get my gun and split you to particles\n(The gold hand) Tell me when and I'm there\nNot only heir to the throne, but my chair is suspended in air\nStay fly like unlimited fare\nYou got us pegged wrong, my circle don't fit in with squares\nI smell shit and piss, know where it's coming from\nYou stepped on number two just to be number one\nNow I'm a step on you, bring it to your yard\nBogart for arts, we go hard\nYou frauds just blow hard like broads, I coast guard the West\nI'm Mozart, I compose dark shit with no heart\n\n[Verse 6: Yelawolf]\nI got Jim Beam in the liver, getting head like clean clippers\nWith haters on my dick like a jeans zipper\nWhen I throw up 16's like I drink liquor\nYou think you seen sick? Well, bitch, you ain't seen sicker\nThan a cracker that will hop around in a hospital gown\nPopping the trunk, my pump will stay cocking the round\nI shit logs and I piss river brown\nCause I drink creek water and spit the river Nile\nAnd that's as close as I get to a pyramid\nShit, they think I'm Illuminati, so fucking ignorant\nSick with a grin, here with this pen, so innocent\nBut when you win, they say you a sin, but in the end\nThey jump on the bandwagon and dance to the band playing\nSkinny-ass pants sagging, it's only yourself you playing\nCall me a clown, but you love what the clown's sanging\nI'm a freak shows at the county carnival, then you paying\nBitch, I'm on a trapeze with no legs in the dark\nYelling \"Go Shady!\" Driving slower than an old lady\nIn an old '89, no piece if you pay me\nGive me peace sign on my grill, no Mercedes\nI'm getting paid for these shows that I throw lately\nSame shows a year ago would have broken most of you crazies\nThey call me crazy cause I made it\nBitch, you crazy cause you quit, look at my clique lately\nYou ain't fucking with Budden, you ain't got no choice with Royce\nYou don't want to see the Crooked I, well, listen to Ortiz voice\nThat dirt road hit the 8 Mile, the point oh boys\nAnd if Marshall want me to clap, then, homie, I deploy game over\n\n[Outro: Eminem & Yelawolf]\nYo, I don't think they heard you, tell 'em again\nGame over!", "image": "https://images.genius.com/f04bf4430f42f4f9e533c82f03a86692.500x500x1.jpg"}], "artist": "Eminem"}