{"songs": [{"title": "Domestic Violence", "album": "Chase the Cat", "year": null, "lyrics": "[E-40]\nIt be her friends nigga that's who\nIt be your bitch friends nigga they be..\nNigga they be all up in your mix nigga\nI don't even, ay nigga she don't love you nigga\nShe just used to you nigga, oh boy!\n\n[Intro] + (E-40)\nI can't tell but I need to know just how you feel\nI can't hold it inside I've got my pride so tell me what's the deal\n(What's the deal?)\nIs it love, or just could it be, that you're used to me?\n(She used to you nigga!)\nIt's been some time but you're still on my mind\nSo baby talk to me\n\n[E-40]\nYou took her she went from the\nGhetto streets, to executive streets electronic beeps\nTwo-way pagers, Palm 7's, M-11's\nIllegal weapons, mesmerized by the dope game\nSmith & Wesson's, never went back for seconds\nSprung.. SPRUNG?\nNot on yo' dick dick (but what) but on yo' tongue tongue\nJealous (jealous) overprotective (protective)\nE'ry chance you get, you slack bruh\n\n[Too $hort]\nDomestic violence, she got you whylin\nDo yo' thang, I don't understand how you get mad\nCause you fuck around to beat her ass\nAnd she don't wanna be around you\nNow you miss her lil' funky ass breath in the mornin\nCall her up, tell her how you want it\nTo be in love you gotta pay yo' dues\nThe bitch got you singin the blues, nigga\n\n[Chorus]\nI can't tell but I need to know just how you feel\nI can't hold it inside I've got my pride so tell me what's the deal\nIs it love, or just could it be, that you're used to me?\nIt's been some time but you're still on my mind, so baby talk to me\n\n[Too $hort]\nDomestic violence, that's what they call it\nYou don't smoke weed and you ain't a alcoholic\nAin't nothin wrong, with bein in love\nBut you act like a fool when you see her in the club\nIt's like me and my money, \"Can't Stay Away\"\nTogether, twenty-fo' hours a day\nReal love - but can you tell if it's real?\nBitch you better tell me how you feel!\n\n[E-40]\nL-U-V, luv (LUV!) Backwards that spells EVIL (evil)\nConnivin, triflin ass people (people)\nUhh - kinda soda(?)\nWifebeater tanktop, restrainin order\nAll up in her kitchen (in her kitchen)\nBut have you noticed how she fuck different (different)\nIt ain't the crevice that you wanna shank\nIt's me - 'Fat Bank Take Little Bank', BEO-EO-ITCH! .. SHEEEAT!\n\n[Chorus]\n\n[E-40]\nI was in the jun-gle, Marin City\nGet some butt she set me up and never let me fuck!\nIt's about approximately 20 minutes past the hour\nI'm in the Eddie Bauer\n\n[Too $hort]\nIt's so comfortable, we can't fuck around no mo'\nYou makin deals, you need to clown that ho\nBut you forgive her, can't live with her\nCan't live without her - but you doubt her\n\n[E-40]\nLove (LOVE!) Sometimes spells catastrophe\nElizabeth, Marcia, Daphne\nHe wanted mo' sex (mo' sex!)\nThe bitch stole his Rolex (Rolex)\n\n[Too $hort]\nYou know why?  The bitch shouldn'ta been trusted\nDo you wanna love her, do you wanna fuck the bitch\nMakes no difference, handle yo' business\nIf it ain't love, then what the fuck is this?\n\n[Chorus]", "image": "https://images.genius.com/5879836b504c477d7cddacb459c66e7c.776x768x1.jpg"}], "artist": "Too $hort"}