{"songs": [{"title": "The Language", "album": "Nothing Was the Same", "year": "2013-09-24", "lyrics": "[Intro: Drake]\nYeah\nYeah, yeah\nYeah, yeah\nYeah, yeah\nYeah, yeah\nLook, look\n\n[Verse 1: Drake]\nI don't know why they been lyin'\nBut your shit is not that inspirin'\nBank account statement  just look like\nI'm ready for early retirement\nFuck any nigga that's talking that shit just to get a reaction\nFuck going platinum\nI look at my wrist and it's already platinum\nI am the kid with the motor mouth\nI am the one you should worry 'bout\nI don't know who you're referring to\nWho is this nigga you heard about?\nSomeone just talking that bullshit\nMan, someone just gave you the run-around\nNiggas downplayin' the money\nBut that's what you do when the money down\nI don't waste time puttin' money down\nI just go straight to who got it and buy it in cash\nPussy so good that you gotta come see me on tour\nAnd you gotta fly in first class\nThis has been years in the makin'\nIt's all for the city, they know I come right every summer\nCash Money Records forever, I'm always big timin'\nBitch, I came up right under Stunna, you know it\n\n[Chorus: Drake]\nJealousy in the air tonight, I could tell\nI will never understand that, but oh well\nBeen ready, it's real, I don't know 'bout you\nShe just want to smoke and fuck\nI said \"Girl, that's all that we do.\"\nOkay, now you're talkin' my language\nNow you're talkin' my language\nNow you're talkin' my language\nNow you're talkin' my language\nBeen ready, it's real, I don't know 'bout you\nShe just want to smoke and fuck\nI said \"Girl, that's all that we do.\"\n\n[Verse 2: Drake]\nI'm 'bout to roll one and light it\nAnd fuck it, man, no one's invited\nI got to kill off the weak shit\nThat's got all you niggas excited\nI can't even listen, you wildin'\nI'd much rather sit here in silence\nI send all my money to banks in the islands\nAnd eat with Italians, I do\nPeople are funny, you don't even know\n'Bout the shit that I been through\nI just want some head in a comfortable bed\nIt could all be so simple\nTalkin' that shit with you back to me\nJust know it always get back to me\nCome get your girl, she been here for three days\nAnd she way too attached to me\nHate when they get too attached to me\nI got to get on the bus and get back on the road\nGet what I can out the country\nAnd then I just get on the jet and go back to the cold\nCan't even drive with the top off\nI been workin' so hard on the album, I missed the whole summer\nI just might bring in some girls from Miami\nTo heat up the city, and that's word to Stunna, you know it\n\n[Chorus: Drake]\nJealousy in the air tonight, I could tell\nI will never understand that, but oh well\nBeen ready, it's real, I don't know 'bout you\nShe just want to smoke and fuck\nI said \"Girl, that's all that we do.\"\nOkay, now you're talkin' my language\nNow you're talkin' my language\nNow you're talkin' my language\nNow you're talkin' my language\nBeen ready, it's real, I don't know 'bout you\nShe just want to smoke and fuck\nI said \"Girl, that's all that we do.\"\n\n[Outro: Birdman & Drake]\nFamous and dangerous, you understand me?\nShowtime, headlines, big time\nSunshine, tote 9's, bust mines\nFlatline, hard grind, high life\nStay fly, it's jet time – stunt, nigga!\nEvery time you see a nigga – stunt, nigga!\nEvery time you see a nigga – stunt, nigga!\nSwag on head to feet nigga – stunt, nigga!\nI just might bring in some girls from Miami\nTo heat up the city, and that's word to Stunna, you know it", "image": "https://images.genius.com/7f843805fe1e72b35f00f412edd24f8d.1000x1000x1.jpg"}], "artist": "Drake"}