{"songs": [{"title": "Speedin’ (Chris Brown Remix)", "album": null, "year": "2008-01-30", "lyrics": "[Intro: R. Kelly & (Rick Ross)]\nOh, woah, oh, woah\n(Trilla)\nOh, woah, oh, woah\n\n[Verse 1: Rick Ross, R. Kelly & (Chris Brown)]\nEvery dollar that I count can't grow in my account\nMy account can't count up all my money in an hour\n'Cause it's comin' too fast and I'm scared it won't last\nLook that white girl in her face told her this was her last dance\nGoddamn, speed got my heart racin'\nSee I don't have the nominations you can blame it on my occupation (ayy, ayy)\nCeasar salad, Caesars Palace (ayy, ayy, ayy)\nYou not a boss, little nigga, 'cause your cheese is average (oh)\nIn the Benz, AK ridin' shotgun\nIt's a Benz 'cause your broke 'til you got one\nIt ain't nothing, do 100 in the Maybach\nThrowin' money out the roof motherfuckin' brake pads (ballin', I'm a beast)\n\n[Chorus: Chris Brown]\nI'm a boss (I'm a boss), I ball\nStay shinin' on all of y'all\n'Cause I'm speedin', speedin'\nBeen runnin' for years\nBut you could find me just speedin'\nI'm taking off, yeah\n'Cause I'm speedin', (I'm just) speedin'\n\n[Verse 2: R. Kelly]\nSitting in the living room watching the Grammys\nWishing that was me that was on the Grammys\nAll I needed was someone to get behind me (ballin', I'm a beast)\nI was a determined lil nigga, dirty shoes and Hilfiger\nHomie help me out cause this boy is a drug dealer\nNow I'm flyin' high 'cause my gift grew wings\nAnd now I'm flyin' down like the cool crew winds\nKells and Ross on the Hollywood scene\nRed carpet and it's smellin' like green\nNow foss 'cause I got paid off\nCollabo was the hit hip-hop and R&B boss (ballin', I'm a beast)\n\n[Chorus: Chris Brown & R.Kelly]\nI'm a boss (I'm a boss), I ball (I ball)\nStay shinin' on all of y'all (all of y'all)\n'Cause I'm speedin', yeah, yeah, I'm speedin'\nI can't stop, it's all I know\nFrom a youngin' I was taught get dough, oh, oh\nI'm speedin' (I'm speedin')\nI'm speedin'\n\n[Interlude: Rick Ross & (R. Kelly)]\nWe fly, I think somebody followin' (oh, oh)\nWe hear the helipad with ya bitch (oh, oh, oh, oh)\nYou worth fifteen million, baby (oh, oh)\nDon't try to blow it all in one week (oh, oh)\nFuck with me, triple seas (oh, oh)\nBoss, I'ma fly away on you haters (I'm speedin' I'm speedin')\n\n[Chorus: Chris Brown]\nI'm a boss (I'm a boss), I ball\nStay shinin' on all of y'all\n'Cause I'm speedin', speedin'\nBeen runnin' for years\nBut you could find me just speedin'\nI'm taking off, yeah\n'Cause I'm speedin', (I'm just) speedin'\n\n[Verse 3: Rick Ross]\nSee people came lookin for me I got ghosts see the west coast\nClose and up in the lamontrose, big money, boss major\nAmerican Idol, I got fans like fantasia\nRead between the lines or yo ass like fantasia\nGet hit between the eyes, he died they can't save him\nI'm a mosh, I'm weevin' no dope but I'm speedin'\nStaring at the skyline, I got a million on my mind, I'm the best\nAnd these pussy niggas running out of time (Ricky Ross)\nI'm the chill quarter mill for the time piece\nYa I a bought a wheels like deals for the dime piece\n\n[Chorus: Chris Brown]\nI'm a boss (I'm a boss), I ball\nStay shinin' on all of y'all\n'Cause I'm speedin', speedin'\nBeen runnin' for years\nBut you could find me just speedin'\nI'm taking off, yeah\n'Cause I'm speedin', (I'm just) speedin'", "image": "https://images.genius.com/3dce21029cdd8aab73eb473e015807d5.1000x1000x1.jpg"}], "artist": "Rick Ross"}