{"songs": [{"title": "Suicidal Thoughts", "album": "Ready to Die", "year": "1994-09-13", "lyrics": "[Intro: Puff Daddy]\nHello?\nAw shit, nigga! The fuck time is it, man?\nOh, God damn\nNigga, do you know what time it is?\nAw shit, what the fuck's goin' on?\nYou aight?\nAh, nigga, what the fuck is wrong with you?\n\n[Verse: The Notorious B.I.G. & Puff Daddy]\nWhen I die, fuck it, I wanna go to hell\n'Cause I'm a piece of shit, it ain't hard to fuckin' tell (What you talkin' 'bout, man?)\nIt don't make sense, goin' to heaven with the goodie-goodies\nDressed in white, I like black Timbs and black hoodies (Aw, man)\nGod'll probably have me on some real strict shit\nNo sleepin' all day, no gettin' my dick licked\nHangin' with the goodie-goodies, loungin' in paradise\nFuck that shit, I wanna tote guns and shoot dice (You talkin' some crazy shit now, nigga)\nAll my life I been considered as the worst\nLyin' to my mother, even stealin' out her purse (Ah)\nCrime after crime, from drugs to extortion\nI know my mother wish she got a fuckin' abortion\nShe don't even love me like she did when I was younger (Yo, get a hold of yourself, nigga)\nSuckin' on her chest just to stop my fuckin' hunger\nI wonder; if I died, would tears come to her eyes?\nForgive me for my disrespect, forgive me for my lies (You're buggin', B)\nMy baby mother's eight months, her little sister's two\nWho's to blame for both of them? (Nah, nigga, not you)\nI swear to God I want to just slit my wrists and end this bullshit\nThrow the Magnum to my head, threaten to pull shit (Nigga, what the fuck?)\nAnd squeeze until the bed's completely red (It's too late for this shit, man)\nI'm glad I'm dead, a worthless fuckin' buddha head\nThe stress is buildin' up, I can't— I can't believe (Ayo, I'm on my way over there, man)\nSuicide's on my fuckin' mind, I wanna leave\nI swear to God I feel like death is fuckin' callin' me\nBut nah, you wouldn't understand\nNigga, talk to me please, man!\nYou see, it's kinda like the crack did to Pookie in New Jack\nExcept when I cross over, there ain't no comin' back (Ayo, ayo, man, I'm out)\nShould I die on the train track like Ramo in Beat Street? (I'ma call you when I get in the car)\nPeople at the funeral frontin' like they miss me (Ayo, where your girl at, man?)\nMy baby mama kiss me, but she glad I'm gone (Yo, put your girl on the phone, nigga!)\nShe know me and her sister had somethin' goin' on\nI reach my peak, I can't speak (Ayo, you listenin' to me, motherfucker?)\nCall my nigga Chic, tell him that my will is weak (Ayo, c'mon, nigga)\nI'm sick of niggas lyin' (Cut that), I'm sick of bitches hawkin' (Ayo)\nMatter of fact, I'm sick of talkin' (Nigga, yo, yo, Big! Ayo, chill!)\n*Gunshot*\nAyo, Big! Ayo, Big!\n\n[Outro]\nPlease hang up and try your call again\nPlease hang up— Is a recording", "image": "https://images.genius.com/e6cce6ad5c26175653cd5e5590b6e235.1000x1000x1.jpg"}], "artist": "The Notorious B.I.G."}