{"songs": [{"title": "Ackrite", "album": "2001", "year": "1999-11-16", "lyrics": "[Intro: Hittman]\nIt's fuckin ackrite\nQuestion is - can I get some? Know what I'm saying?\nAck-rite, bitch\nWhen I see you in the spot, you just act right, you know what I'm saying?\nWhen I yank you by the fuckin' arm\nDon't be looking at a nigga crazy\nJust give up the digits and be the fuck out, you know what I'm saying?\nLet me break it down for y'all\n\n[Verse 1: Hittman]\nIt was just one of those days\nWhen I wanted to catch sunrays\nIt`s fun to gitt blunted on a Sunday afternoon\nNigga Bathed & got groomed, grabbed the gat for misbehavors\nAnd the chocolate flavored boom, lost in hip-hop tunes\nZoom-zoom like the Commodores\nWonder will we have drama or, end up clowning whores\nRound up four good-to-go girls\nLike them Barbary Coast girls, riding shotgun, baby\nI be postin all-world in the ride\nSipping 151 done gave me too much pride to back down\nSoon as we get to The Beach I'mma put my fuckin mack down\nI'm playin lead, not the background\nIt's time to put Bronson on the map now\nWalk with my hand on my Johnson, crack a smile\nCuties peep my style, if I don't get some ackrite\nI'mma have to ack-wild\n\n[Hook: Hittman]\nBlunt in my left hand, drink in my right\nStrap by my waistline, cause niggas don't fight\nSucker free for life, so you better think twice\n(Aight? And a give a nig' some ackrite)\nI'm the type of nigga playa-haters don't like\nSnatchin' up your honey for some late night hype\nAnd snobby-ass bitches get slapped out of spite\n(Aight? So give a nig' some ackrite, right)\n\n[Hittman]\nUhhhhh.. drink kicking in, I'm stimulated\nFor those that don't know big words: I'm FUCKIN FADED\nEighty-three degrees, ease to a shaded spot\nOur first spot was cool till some gangsters made it hot\nNow we plot and pose\nPlus we watchin hoes, with lots of flesh exposed\nGetting swarmed by those type of niggas\nWith no game but brown-nose\nSo I impose only like pros can\n\"Yo, is this your man?\" \"No.\"\nGrab the bitch's hand, \"I'm Hittman.\"\nBling! Gold chain gleam\n\"You're very eligible for my summer league team.\"\nMaybe too extreme cause the sister got steamed\nThen Miss Thing tried to scream on my brethren\nI got mad, spit phlegm on the name\nStefan, tattooed on her arm\nHo you ain't the bomb, must be a dyke\nGitcho' lips swoll, or give a nig' some ackrite\n\n[Hook: Hittman]\nBlunt in my left hand, drink in my right\nStrap by my waistline, cause niggas don't fight\nSucker free for life, so you better think twice\n(And a give a nig' some ackrite)\nI'm the type of nigga playa-haters don't like\nSnatchin' up your honey for some late night hype\nAnd snobby-ass bitches get slapped out of spite\n(So give a nig' some ackrite, right)\n\n[Hittman]\nFronting on the ack-rite, causing me to act up\nGood Samaritans save that ho from getting slapped up\nMy homies crack up at the scene I made\nYo my actions ain't serene when a nigga's on fade\nIf it wasn't for the one-time brigade\nI woulda sprayed at the hooker tramp\nAs cops parade I'm afraid it's time to break camp\nMake tracks, where else can we go to take hoes\nFrom fake macks? {*CAR HORN*} Aiyyo, chase them girls\nIn that black Maxima, the passenger, almost fractured her\nNeckbone, looking back at us\nPlus, they on the dick cause the Caddy's plush\nThey blush, I bumrush the huss, with the largest crush\nTry to swing an ep tonight so I don't have to keep in touch\nKeep it on hush without the tippin`\nMacking interrupted by some niggas set-tripping\nClip in the strap, I showed these niggas how to act\n\n[Hook: Hittman]", "image": "https://images.genius.com/f9713af0f8164e90022b622002fda842.600x596x1.jpg"}], "artist": "Dr. Dre"}