{"songs": [{"title": "Wake Up", "album": "The Bar Exam 4", "year": "2017-06-20", "lyrics": "[Intro]\nHello, Hip Hop, what are you doing?\n'Cause nowadays you just all seem ruined\nWill you wake up? What are you doing?\nUsing way too much autotune\nHello, Hip Hop, what are you doing?\nWhat's some of that corny shit that you been on?\n(Wake up)\n(Can you wake up?)\nRespect the art\nI got one question for y'all\n(Can you wake up?)\n\n[Verse]\nCompetitive rap is back in effect\nYou niggas out here playing bitchball flapping your neck\nWhat in the fuck is wrong with y'all? Get back to respect\nPut on a shirt, get back to the six-pack on the steps\nAnd everybody can't be motherfucking sexy\nI just wish niggas would understand that\nMan, Instagram just need a dunce button\nNow all the rappers got their hands wrapped in a boxing gym\nYou throw your punches like you ain't ever punch nothing ever\nAnd on the behalf of all men you making us look bad\nI'm sure if we took you to the gun range you couldn't spray the target, fam\nYou couldn't fight your way out a paper bag with Shenaynay from Martin hands\nYou couldn't beat my daughter in a game of basketball in a garbage can in the streets\nIf y'all scared, nigga, call the police\nI wonder if they know how soft they all look today\nFuck a drive-by, I just hop out the car and mush a face\nThey all crooks and snakes, all serpents\nAll part of the large circus mixed with Cirque du Soleil\nThey all purpose, clique jumpers, they all ball-jerkers\nEx-mall workers who text wrong\nShit like the K without the O in front\nGet off the phone, chump\nYour career is like a microwave without the door in front\nLiked today, but you ain't holding none\nYour raps are like just okay, but problem is you're just okay with that\nWhere the fuck did rap get dislocated at?\nI'm just gonna keep spitting 'till this shit's in place\n'till I feel 2008 is back\nFans being way too nice, where all my haters at?\nI spit hiatus raps, I'm just that good\nI never ride the wave 'cause I'm the water, I'm like the rap Suge\nMinus the fade by the barber, and all our thoughts cold\nAnd all y'all thoughts blow, ours is Pearl Harbor\nAnd all my thoughts go in line, they can go inside of a barcode\nI got the violent history of Gotti's polaroid flow, there's only one way to picture me\nInstantly a body\nMy twin barrells I call Tiara and Tia Mowry\nBeing shot at is about as likely as seeing y'all on lean and Molly\nMy mind shuffles thoughts\n'Till hard lines touch the bars\nAnd then I spit it like I'm trying to fill up a couple vaults\nPeople find love and realize that love is love\nAnd they should be the fucking law 'cause love is love even when love is lost\nYou niggas need to be aggressive again\nYou niggas at them labels need to come from the back of them desks and find the next nigga with talent\nAnd quit being so skewed by views and streams\nOr I'll come through and pee in your vegan salad", "image": "https://images.genius.com/2627cc5445030d64606928667383564b.800x800x1.jpg"}], "artist": "Royce da 5'9'’"}