{"songs": [{"title": "Stupid Wild", "album": "The State vs. Radric Davis", "year": "2009-12-08", "lyrics": "[Intro - Gucci Mane]\nOh!\nOh!\nGucci\nBangladesh!\nGucci\nBrr, brr, brr\n\n[Verse 1 - Gucci Mane]\nI'm the fire, you say you more fire then nigga, you a liar\nHomie you and I, know the truth but that's 'tween you and I\nStupid jewelry on me then, stupid jewelry on me now\nIf you think you finna shit on Gucci then just show me how\nSomeone dissed me yesterday, what I'm s'posed to do, go cry?\nWith my money chasin' million dollar mission on the side\nChurch's chicken in my Lambo, bought two drumsticks and a thigh (Nyooom)\nI'm so hood right now they question whats gettin' Gucci high\nStupid wild, super stupid wild, homie that's my style\nGirls fightin', hoes fistfight just to touch my tie\nGet my squad squad, I ain't been this hard in a while\nBlow cha-cha, I ain't been this hard in a while\n\n[Hook - Gucci Mane]\nStupid wild, super stupid wild, homie that's my style\nStupid wild, super stupid wild, homie that's my style\nStupid wild, super stupid wild, homie that's my style\nStupid wild, super stupid wild, homie that's my style\nEvery single night I'm ballin'\nSippin' on that drank, rims crawlin'\nMostly every night I'm count, count\nNiggas wanna fight but I'm shoot, shoot\nNiggas wanna fight but I'm shoot, shoot (Yeah)\n\n[Verse 2 - Lil' Wayne]\nWilder than a jaguar, wildin' in a Jaguar\nPl-Please don't play with me, I'll put that pistol on your grandpa\nI swear I'm so wild I think I just may need a xan bar\nAnd if she on my team I bet that bitch know who she playin' for\nMr. Coach Carter or Mr. Go-Harder\nAnd I like my kush dry like a fish with no water\nSwagger stupid perfect, I might as well surf it\nAnd if she ain't fuckin' she get the voicemail service\nTell it like it be, bitch I do it for the bloods\nAnd every fuckin' time I say soo woo it's for the Bloods\nWhat you dislike I love, man I do just like I does\nAnd if you wanna fight then come on you can fight my guns\nWeezy man, Young Money\n\n[Hook - Gucci Mane]\nStupid wild, super stupid wild, homie that's my style\nStupid wild, super stupid wild, homie that's my style\nStupid wild, super stupid wild, homie that's my style\nStupid wild, super stupid wild, homie that's my style\nEvery single night I'm ballin'\nSippin' on that drank, rims crawlin'\nMostly every night I'm count, count\nNiggas wanna fight but I'm shoot, shoot\nNiggas wanna fight but I'm shoot, shoot\n\n[Verse 3 - Cam'ron]\nLet's do the furs, his and hers\nStarted gettin' on my nerves so I hit her with a \"BURR!\"\nHustlers love me, all the haters hate me\nThey brothers wanna fight me, they sisters wanna date me\nI tell her bust it baby, you could be my bust it baby\nBut stay in your place, I need my space: don't suffocate me (please)\nBack black approach us, clack clack take gats out the holsters\nCops in black the patrol us, treat us like rats and roaches\nBut the blue Benz, Got the blue lamps\nAnd your wifey, well we use her for her food stamps\nAin't no big deal, but she keep the fridge filled\nEggs scrambled, cheese grilled, cold juice the grits kill!\nDon't forget veal, Italiano, Gallardo\nYea the big wheels, like milk your wig spilled\nWe'll rush in ya spot, knock knock, snub of the Glock\nIt Gucci turn, Huh?, You gon' suck it or not\n\n[Hook - Gucci Mane]\nStupid wild, super stupid wild, homie that's my style\nStupid wild, super stupid wild, homie that's my style\nStupid wild, super stupid wild, homie that's my style\nStupid wild, super stupid wild, homie that's my style\nEvery single night I'm ballin'\nSippin' on that drank, rims crawlin'\nMostly every night I'm count, count\nNiggas wanna fight but I'm shoot, shoot\nNiggas wanna fight but I'm shoot, shoot\n\n[Outro - Gucci Mane]\nBitches wanna fuck me mainly\nCause I got the kitchen all famous\nI'm tryna hold my head above water\nStack a billion cash I just oughta\nMy shades cost that cause I'm Gucci\nMy warddrobe Gucci'd out like I'm boostin'\nI shine just all the time your homie shine\nWanna hate me get a ticket and join the line, fine\nIt's Gucci!", "image": "https://images.genius.com/b1d579f919289c4a4498c5418f46bf1c.450x450x1.jpg"}], "artist": "Gucci Mane"}