{"songs": [{"title": "Take One for the Team", "album": "G.O.O.D. Fridays", "year": "2010-10-15", "lyrics": "[Chorus: Pusha T]\nDoin' my thing, pocket full of green\nHand on my dick in my thousand-dollar jeans\nYour girl a queen, my girl a thing\nYou know what, though?\nI'ma take, I'ma take this one for the team\n\n[interlude: Kanye West]\nHehe\nI'ma take this one for the team\nG.O.O.D. Music! Yeah, uh\n\n[Verse 1: Kanye West]\nYou know what? I figured out I'm not a nice guy\nI shook hands, kissed babies, gave it a nice try\nYou know what? I hate pictures of other people kids\nI hate plastic couches in other people cribs\nI hate when other people cribs smell like shit\nI hate when I leave and smell like the crib\nWhat's the cause of the poor smell?\nShe said, \"I just cleaned up, baby, I can't tell\"\nWhy every ghetto bitch gotta smell like Love Spell\nOr that God damn cucumber Bath and Body Works?\nI can still smell the sweat, the shit hardly works\nWhat about Cool Water? That shit probably worse\nThis here a classic like the La-Di-Da-Di verse\nAnd my man probably hollered at the hottie first\nI scored, he took the charge\nOooh, that shit gotta hurt\n\n[Chorus: Pusha T & Kanye West]\nDoin' my thing (Hah), pocket full of green (Yeah)\nHand on my dick in my thousand-dollar jeans (Yeah)\nYour girl a queen, my girl a thing (Ehh)\nYou know what, though?\nI'ma take, I'ma take this one for the team\n\n[Verse 2: Pusha T]\nNever mind me, 'Ye, have fun\nIf the cops ask, that's my gun\nThat's my weed, anything you need\nI'ma take, I'ma take, I'm a take this one for the team\nOne fat ass, one flat ass\nNigga hit the switcheroo on my black ass\nEver seen Joe's Jeans on a jackass?\nAnd my bitch got on tights with a tack ass\nI'm a fly nigga, and I carry on\nWith them bottles of that Rosé and Perignon\nEver seen how a kingpin carries on?\nDookie rope link chain and a herringbone\nThe real shit, gotta feel this\nFirst class flights, baby, that's a field trip\nDouble date, don't cooperate, kill switch\nFuck me and my man, you a real bitch\n\n[Chorus: Pusha T & Kanye West]\nDoin' my thing, pocket full of green (Yeah)\nHand on my dick in my thousand-dollar jeans (Yeah)\nYour girl a queen, my girl a thing (Yeah)\nYou know what, though?\nI'ma take, I'ma take this one for the team\n\n[Interlude: Kanye West]\nLadies and gentlemen\nIt's G.O.O.D. Music in the house\nAnd we got... Keri!\n\n[Bridge: Keri Hilson & Kanye West]\nBoy, I know you the one that I heard about (Hah)\nAnd I know you workin' with it through word of mouth\nLooks like I'ma have to test you in and out\nIt's a dirty job but sometimes you gotta\nTake it for the team (Hah)\nTake it for the team\nTake it for the team (I like your mentality, baby)\nTake it for the team (Hahahahaha)\n\n[Verse 3: Cyhi the Prynce]\n(CyHi!) I'm blowin' on stinky that come in a jar\n(CyHi!) Playin' with her kitty, made her come in the car\n(CyHi!) She a redbone but her cousin is dark\n(CyHi!) A little out of shape but she'll fuck in the dark\nUntil she start complainin' 'bout her feet hurt\nI'm trying to fuck, she talkin' 'bout she want to eat first\nI'm like, \"Why did this bitch have to bring her?\"\nTryin' to get her back to the nest so I could sting her\nSo I hit Big Sean on the ringer\nI said, \"I got a chick for you that look like a singer\nOn a scale of one to ten, she's a fifteen-er\"\nMan, you shoulda seen a nigga face when he seen her\nHe said the bitch wasn't pretty enough to finger\nOn my team, she would be a fifth-stringer\nI said, \"I got the fine one in the Bimmer\nI'm the point guard and I need a wing, take it for the team\"\n\n[Bridge: Keri Hilson]\nTake it for the team\nTake it for the team\nTake it for the team\nTake it for the team\n\n[Chorus: Pusha T & Kanye West]\nDoin' my thing, pocket full of green\nHand on my dick in my thousand-dollar jeans\nYour girl a queen, my girl a thing\nYou know what, though?\nI'ma take, I'ma take this one for the team\nI'ma take this one for the team\nG.O.O.D. Fridays\nI'ma take this one for the team\n\n[Verse 4: Kanye West]\nIt's the nigga they love to hate\nBut all the bad model bitches they love to date\nYou need to check my swag and get up to date\nCheck, check my swag and get up to date\nWe in the bathroom now, she get her back blew out\nShe can't clean but I bet she got a vacuum mouth\nAnd I bet I'm gon' sweat her Vidal Sassoon out\nHer friend bust in, goddamn, who brought the raccoon out?\nFor the team, uh\n\n[Break: Kanye West]\nLike we always do at this time\nLike, like we always do at this time\nI go for, I got to\nLike we always do at this time\nLike we always do at this time\nGo for, I got to\nLike we always do at this time\nHah, like we always do at this time\nSouthside, we gon' set this party off right\nThis time\nThis time\nYeah, yeah\nMike Dean on the keys\nHey, oh\n\n[Outro: Kanye West]\nThey love to hate\nBad model bitches, they love to date\nThey need to check my swag and get up to date\nCheck-check-check my swag and get up to date\nAye, it's the nigga they love to hate\nBut all the bad model bitches, they love to date\nThey need to check my swag and get up to date\nCheck-check-check my swag and get, uh, aye", "image": "https://images.genius.com/a5da3353bfa1345653be83e328338f94.604x600x1.png"}], "artist": "Kanye West"}