{"songs": [{"title": "Vitamins", "album": "Macadelic", "year": "2012-03-23", "lyrics": "[Intro]\nWell, take your vitamins!\n\n[Verse 1]\nWell, I was on my way to meet up with this woman that I met\nThe other day while I was on my break to smoke a cigarette\nI hit her up, she had some weed and told me come through we should smoke\nBring a pair of L’s, don't bring no money, baby, I ain't broke\nSo I'm walkin' up the stairs to the porch\nKnocked against the door, heard some feet against the floor\nThe door had opened up and it was her, she told me, \"hurry come right in\"\nLeave your shoes up by the furnace, cause we just put new carpets in\nShe asked me bout my day then sat me down\nTold me we should have some fun, there ain't nobody around\nShe got this crazy pill the other day while she was on her way to work\nTold me it would make my problems go away and fix the hurt\nThat I had, well, that don't sound bad\nDown the hatch, kinda nervous, just relax, she said rubbing on my back\nWell I ain't really into drugs but fuck it\nI'mma take a trip and I'mma love it\n\n[Hook]\nI don't know what happened to me\nBut as soon as it hit me I was fuckin' free\nIt took me, to somewhere off the map\nAnd I don't think I'll ever find my way back, back\n\n[Verse 2]\nWell, I left right after that and started drivin' to my house where I reside\nI was high and possibly a little fuckin' out my mind\nCan't remember where I live, it ain't like I just bought this house\nI said fuck it, took a breath, opened my door and just jumped out\nAnd it's funny cause I didn't even hit against the road\nI just went right through the ground and started floatin' on my own\nI see colors, different colors, like they glowin' in the light\nThey was glowin' like they glowin' in the dark, but it was bright\nThat's alright, this shit crazy, what the fuck she had me take\nIf this kill me, I'mma come back, haunt her every single day\nAs I wait sittin' somewhere that I never seen\nFeel like I forever dream, just imagine, set a scene\nPower and imagination got all my surroundings changin'\nFound a place to drown my brain, it something like it's outer space\nBut nothin' like the pictures from the astronauts\nThey showed me back at school\nWhen they told me drugs were bad, oh man, oh man, they had me fooled\n\n[Hook]\nI don't know what happened to me\nBut as soon as it hit me I was fuckin' free\nIt took me, to somewhere off the map\nAnd I don't think I'll ever find my way back, back\n\n[Outro: Requiem for a Dream sample: Sara talking to Harry]\nI'm somebody now, Harry. Everybody likes me. Soon, millions of people will see me and they'll all like me. It's a reason to get up in the morning. It's a reason to smile. It makes tomorrow alright", "image": "https://images.genius.com/5c20c657a063eac69a842fc529269744.375x375x1.jpg"}], "artist": "Mac Miller"}