{"songs": [{"title": "(Rock) Superstar", "album": "Skull & Bones", "year": "2000-02-29", "lyrics": "[Chino Moreno talking]\nAlot of a...sharks out there...try'na take a bite of somethin'\nWhat's hot\nLot of chameleons out there...try'na change up\nAnytime somethin' new comes along...everybody wants a bite\nDon't happen overnight\n\n[Chorus: B-Real]\nSo you wanna be a rock superstar?\nAnd live large, a big house, 5 cars, you're in charge\nComin' up in the world don't trust no body\nGotta look over your shoulder constantly\n\n[B-Real]\nI remember the days when I was a young kid growin' up\nLooking in the mirror dreamin' about blowin' up\nThe rock crowd, make money, chill with the honey's\nSign autographs or whatever the people want from me\nShit's funny how impossible dreams manifest\nAnd the games that be comin' with it, nevertheless\nYou got to go for the gusto but you don't know\nAbout the blood, sweat and tears and losing some of your peers\nAnd losing some of yourself to the years past gone by\nHopefully it don't manifest for the wrong guy\nEgomaniac and the brainiac don't know how to act\nShit's deep, 48 tracks\nStudio gangster mack signed the deal, thinks he's gonna make a mil'\nBut never will 'til he crosses over\nStill filling your head with fantasies\nCome with me, show the sacrifice it takes to make the cheese\nYou wanna be a rock superstar in the biz?\nAnd take shit from people who don't know what it is\nI wish it was all fun and games but the price of fame is high\nAnd some can't pay the way\nStill trapped in what you rappin' about\nTell me what happened when you lost clout\nThe route you took started collapsing\nNo fans, no fame, no respect, no change, no women\nAnd everybody shits on your name\n\n[Chorus: B-Real]\nSo you wanna be a rock superstar?\nAnd live large, a big house, 5 cars, you're in charge\nComin' up in the world don't trust no body\nGotta look over your shoulder constantly\nSo you wanna be a rock superstar?\nAnd live large, a big house, 5 cars, you're in charge\nComin' up in the world don't trust no body\nGotta look over your shoulder constantly\n\n[Everlast talking]\nPeople see rockstars, younawhaI'msayin?\nBut you still...try'na...get out more like, like everybody else\nIt's a fun job, but it's still a job\nSave your money man, save your money too\nIt's single don't last very long, younawhaI'msayin?\nI mean...you're lucky in this game too\nThere's gon' be another cat comin' out\nLookin' like me, soundin' like me, next year I know this\nThey'll be a flipside, do whatchu you do\nSomebody'll try to spin off like some series\n\n[Sen Dog]\nYou ever have big dreams of makin' big cream?\nBig shot, heavy hitter on the mainstream\nYou wanna look shanty in the Bentley\nBe a snob and never act friendly\nYou wanna have big fame, let me explain\nWhat happends to these stars and their big brains\nFirst they get played like all damn day\nLong as you sell everything will be O.K\nThen you get dissed by the media and fans\nThings never stay the same way they began\nI heard that some never give full to the fullest\nThat's while fools end up dining on the bullet\nThink everything's fine in the big time\nSee me in my Lex' with the chrome raised high\nSo you wanna roll far and live large?\nIt ain't all that goes with bein' a rockstar\n\n[Chorus: B-Real]\nSo you wanna be a rock superstar?\nAnd live large, a big house, 5 cars, you're in charge\nComin' up in the world don't trust no body\nGotta look over your shoulder constantly\nSo you wanna be a rock superstar?\nAnd live large, a big house, 5 cars, you're in charge\nComin' up in the world don't trust no body\nGotta look over your shoulder constantly\n\n[B-Real]\nMy own son don't know me\nI'm chillin' in the hotel room lonely\nBut I thank God I'm with my homies\nBut sometimes I wish I was back home\nBut only no radio or video didn't show me\nNo love, the phony, gotta hit the road slowly\nSo the record gets pushed by Sony\nI'm in the middle like Monie\nAnd the press say that my own people disown me\nAnd the best way back is to keep your head straight\nNever inflate the cranium\nThey're too worried about them honies at the Paladium\nWho just wanna cling on, swing on, and so on\nGo on, fall off, the hoes roll on\n'Til the next rock superstar with no shame\nGive him a year, he'll be right out the game\nThe same as the last one who came before him\nGained fame, started gettin' ignored, I warned him\nAssured him, this ain't easy take it from Weezy\nSleezy people wanna be so cheesy, the fuckin' lethal\n\"Assassins, assassins\"\n\n[Chorus: B-Real]\nSo you wanna be a rock superstar?\nAnd live large, a big house, 5 cars, you're in charge\nComin' up in the world don't trust no body\nGotta look over your shoulder constantly\nSo you wanna be a rock superstar?\nAnd live large, a big house, 5 cars, you're in charge\nComin' up in the world don't trust no body\nGotta look over your shoulder constantly", "image": "https://images.genius.com/af5085b228c3f1b6bc3a2ac39f6c6be8.1000x977x1.jpg"}], "artist": "Cypress Hill"}