{"songs": [{"title": "Prime Example", "album": null, "year": null, "lyrics": "*Yeah*\n*Talib Kweli*\n*Black Star*\n*Reflection Eternal*\n\n[Hook: repeat 2X]\nI am what you want to be but you can't though\nPrime example\nYou cats can't flow but you get an \"E\" for effort\n[From mah say till efforts we stay?] together reign forever\n\n[Talib Kweli]\nPlease\nYou think I give a fuck about your Clown Posse? You insane!\nYou acting like a journalist and racking my brain\nSince I was tagging my name on the back of the train\nLike my man in \"La Haine\", packing the same\nLittle Gat that put me back in the frame of mind to say \"Fuck the Five-O\"\nLet me explain the rhyme\nYo, cut the nice flow like Bob Marley\nI'm the black star they probably follow my every move\nLike I'm the son of John Gotti\nEscape to Paris like a jazz man round midnight\n[Queen?] banging like Josephine Baker raising the kids right\nAttack the dreaming\nRap through the demons\nSee the situation and extract the meaning\nInternationally known trees actually grown\nThrough the cracks in the sidewalk\nSee it in my walk\nHear it in my talk\nBet you cats feel it in my rap flow\nYou can throw me a spliff but you can keep your tobacco\n\n[Hook]\n\n[Talib Kweli]\nAre y'all with me tonight?\nÊtes-vous avec moi?\nY'all love the children and dance like Elegba\nSay Ma where you goin with that flavor\nThese cats ain't in my league, this here is major\nMind state of the art\nYeah I play my part with razor-sharp words\nShot straight for the heart\nBeautiful like chords played on a harp with trumpets blaring\nAngels preparing for the fate we all sharing at\nOne time or another through sunshine or thunder\nAin't got no time for the blunders\nThen bond with one another to make the classical track\n*What?* The battery in my back\nI'm Eveready already plus magical [adapt?]\nLike mushrooms from the plush womb of the sweet\nThe city workers pushing dust brooms in the street\nWe complete the cipher\nPush up your lighter\nThrow your vanity in the bonfire\n*word*\n\n[Hook] - 3X", "image": "https://s3.amazonaws.com/rapgenius/talib-pic.png"}], "artist": "Talib Kweli"}