{"songs": [{"title": "Bounce (Let Me See Ya Throw It)", "album": "Genesis", "year": "2001-11-27", "lyrics": "[Busta Talking]\nBounce, Bounce, Bounce niggas\nCome on bounce, come on bounce, bounce\nCome on bounce bitches, come on bounce\nCome on bounce, come on bounce\nEverybody bounce niggas, come on bounce\nWhat come on, come on\nI'm sayin bounce bitches, come on bounce now\n\n[Verse 1]\nYes, yes yall, you know we talkin it all\nSee how we bringin the street corner to Carnegie Hall\nIt be so funny to see how badly they want it\nThe fall, fuckin up somethin me and my niggas is ready to brawl (ha!)\nNow I'm ready to call my niggas get off of the wall\nI run up in the club like how these bitches will run in the mall\nWhile we poppin the collar holla you need to folla the scholar (aiyyoo!)\nHustle for dollas and rock it until manana\nMy niggas, KNOW HOW WE DO IT\nI do it for the love and the riches, my niggas hittin them switches\nI got the rent from my bitches\n(You fuck around, youse a goner!); Put this shit back in order\nAnd keep in mind that I might be fuckin somebodys daughter\nMy niggas that be keepin it gully and hang on the corner\nBitches get the strippin and shakin they shit how they wanna\nLet me see it mama, and start showin ya shit\nI love the way you make it bounce and get the throw on ya shit\n\n[Hook]\nBounce, represent where you from (Bounce)\nLet me see ya throw it (bounce), Let me see ya throw it (bounce)\nTo all my ladies (bounce), I love the way you make it (bounce)\nLet me see ya throw it (bounce), Let me see ya throw it (bounce)\nEAST COAST NIGGAZ! (bounce); Now let me see ya throw it (bounce)\nWEST COAST NIGGAZ! (bounce); Now let me see ya throw it (bounce)\nMY DIRTY SOUTH NIGGAZ! (bounce); Now let me see ya throw it (bounce)\nMY MIDWEST NIGGAZ! (bounce); Now let me see ya throw it (bounce)\n\n[Verse 2]\nNow let me warn ya (bounce)\nThe way we comin you we bringin the storm ya'll\nPack the garden up watchin all of my niggas form ya'll\nThe way we always do it, you sayin we wrong ya'll (ah-roo)\nYou still be lovin the way we put it on ya'll\nOH BABY! I know you know I really mean well\nMizzy givin me head all up inside of my V-12\nFemale bitches throwin they pussy at retail\nAll up in ya face seein every intricate detail (ah-hah!)\nNow we rollin wit bigger money we foldin (ah-hah!)\nCrackin (?) in the safe in money we holdin (ah-hah!)\nHold on, pause, these bitches be droppin they drawers\nLayin flat on they stomache and poppin it all on the floor\nComin to get us, we tossin ya niggas like lettuce (uh-auh)\nLeavin you beat up regrettin the moment you met us\nBitches open for bonin' and fuckin they starvin the let us\nSweatin and drippin on niggas and startin to wet us (so!)\nCheck out the way that we reppin we comin to get it (ah-roo!)\nGet the fuck out the club if you ain't rollin wit it\nI be givin you bitches some shit you be wontin to goggle\nHittin these bitches that focus on wantin' to model\nWether you whippin up in the truck or you revin' the trottle\nOr you wlyin up in the club or you throwin the bottle\nJust let me see it mama! and start showin ya shit\nI love the way you make it bounce and get the throw on ya shit\n\n[Hook]\n\nBounce", "image": "https://images.genius.com/4102489ca8934c81cdf553b85cec18fd.1000x1000x1.jpg"}], "artist": "Busta Rhymes"}