{"songs": [{"title": "Old School New School", "album": "Exit 13", "year": "2008-09-05", "lyrics": "Classic, uh, uh, uh\nI'd like to welcome ya'll to Exit 13\nMy name is LL Cool J\nAKA the GOAT\nR. Leslie on the track, uh, uh, uh\n\n[LL Cool J]\nI told ya'll that I would make a killing\nI told ya'll I blow like Mount St. Helen's\nI told ya'll I'm the truth, they paint me like a villain\nSick on paper, the inch to penicillin\nI told ya'll the real, they started catching feelings\nMuthafuck 'em all, throw ya L's to the ceiling\nCool J, still hotter than a helicopter crashing in lava\nStill sweeter to the ladies than a box of Godiva\nMusic industry is like a game of cops and robbers\nToo many Indians, no chiefs to follow\nWhat I'm sowing today, I be reaping tomorrow\nSo here's some joyful bars, to replace your sorrow\nI'm beyond a legend, I'm iconic\nFall off, rebuild, your man's bionic\nPut your trust in me, I never let you down\nI always come up with a way to checkmate these clowns\nI effeminate these clowns, trynna take me down\nAsk Puffy and Nas, who 'hates me now'\nThe Phenomenon, ladies love the don\nI give 'em an ear-gasm, they can't keep calm\n\n(Chorus: LL Cool J)\nOld school, new school, need to learn though\nI burn baby burn like disco inferno\nOld school, new school, need to learn though\nI burn baby burn like disco inferno\n\n[LL Cool J]\nI told ya'll that I was coming back\nI told ya'll I ain't going out like that\nI told ya'll I was the greatest to ever rap\nAnd I built Def Jam and took a piss on the map\nI told ya'll, I wasn't like the other cats\nI'm fresh like a Wii, them niggas playing jacks\nThey all a bunch of a rats, they copying off 2Pac's stats\nWearing tuxedos to hide they tight speedo\nChains is tucked in, I'm incognito\nFuck with your ego, and touch your girl's labito\nThere will never be one flyer, LL Cool J\nTaking you higher and higher\nThe wire, the GOAT, the grand sire\nWho good are 24's if you on flat tires\nTelling your soul and then performing with a choir\nPeople, please, don't listen to these liars\nLadies and gentlemen, these, niggas is selling you up\nBunch of irrelevant shit, it's not intelligent, is it?\nMy shit's exquisite, don't follow the yellow brick road\nThem niggas faking like the Wizard\n\n(Chorus)\n\n[LL Cool J]\nIs it really possible I'm this hot?\nLL Cool J, still on top?\n24 years, I ain't forget the block\nYou can ask my Jay in the shop\nLinden Boulevard, little Coupe, big rocks\nReal estate only, I ain't fucking with the stocks\nWhy not, so our grandkids could feed they grandkids\nAnd they grandkids, can feed they damn kids\nAnd Collin Park throw ya hands in the air\nJump before I turn 'em in a Cool J affair\nMy word is my bond, every summer I'm there\nYa'll can jump double dutch while I'm laying in the cut\nI told ya'll I wasn't giving up\nI told ya'll, I can jump on tracks and switch the rhythm up\nDo work, treat rap like a ripped skirt\nSow it up, rep your hood, nigga, throw it up\nYou'd been standing by my side for years\nSold out concerts, screams and cheers\nFront row T-Shirt, L, we here\nI bought every album, too many to count 'em\nWatch your movies, your the only good thing about 'em\nTodd Smith jeans, I can't live without 'em\nAnd the only thing I want from you\nIs for you to keep doing that shit you do\n\n(Chorus 2x)", "image": "https://images.genius.com/0c13f17b61fb5401ffd0b607a7ca75ab.500x500x1.jpg"}], "artist": "LL Cool J"}