{"songs": [{"title": "Gucci, Louis, Prada", "album": "Twista Presents: Midwest Hittaz, Vol. 1", "year": null, "lyrics": "[Intro]\nPrada\n(Gucci, Louis, Prada [4x])\nUuuh-huh! New Twista y'all\nI sat back long enough\nNow it's time for me to go psycho again!\n\n[Verse 1: Twista]\nRock my Gucci, Louis, Prada\nSuzuki, new Impala\nLike Flukey I get them dollars\nBoogie, you do me nada\nMake your vision decompose\nBe so ridiculous when you’re looking at the clothes\nLike I got a garden I was looking at the hoes\nAnd when they saw the apparel that was when a bitch chose...\nThen she froze, I be looking so fabulous\nNever the one to be tested cause it'd be nothing for me\nTo just go in the closet to show what I’m dressing like\nGet 'em I’m looking impressive and I'm somebody not to be messing with\nHow I do it is a hell of a method\nAnd when I be steppin' up in the vicinity I'mma demolish 'em\nWith the Gucci, Louis and Prada that's on my body\nI'mma hurt 'em with a fit that cost a lil more than your residence...\nGu-Gu-Gucci, Louis, Prada like\nSushi, Benihana's, doushie, do don dadas\nWell tell her come on I got her!\nI be sick of you fucking with raggedy niggas\nAnd looking ridiculous I could be taking you\nShoppin' and poppin' a bottle every time we go in a party\nAnd probably I make it rain a couple dollars in my\n\n[Hook]\nPrada\nGucci, Louis, Prada [4x]\n(In My) Gucci, Louis, Prada [4x]\n\n[Interlude: Twista Talking]\nGucci belt, Gucci shoes, but some days it's all Louie fool!\nWhat up little momma? I see you in them Prada shoes!\nI see you with them bags! Haha, c'mon, let’s go!\n\n[Verse 2: Twista]\nRock my Gucci, Louis, Prada\n'Make a Movie', because I’m a\nBellucci, Lady Gaga\nWho be making them dollars?\nWhen I’m stepping on the set\nHow I be rockin' it be havin' me lookin' wet\nLyric acrobatic I'm in the designer vest\nIf you lookin' at me bogus I’mma take it as a threat!\nWhen you see me I’m the one of a popular\nWhen I be rockin' the fashion I be killin' the minute\nAnd look at the women the way that they be switchin' and walkin'\nAnd workin' the runway I'm checkin' on how astonishin' they be lookin'...\nV.I.P is like a fashion show\nEverybody lookin' the best they can look and when they do it it be\nSwagga on a million and I be feelin' 'em\nSo I'mma tell her that I love how the ass look in her Prada...\nGucci, Louis, Prada\nIn a suit we, pray to the father\nIn a koofi you pray to Allah\nBut mostly the almighty dollar\nDon't know why we so materialistic instead of being a mystic\nBut if I gotta do it I'mma be the best and I'mma shit on my opponent\nWhen I'm on it in the club, they don't want it when I'm in my\n\n[Hook]\nPrada\nGucci, Louis, Prada [5x]\n(In My) Gucci, Louis, Prada [3x]\n\n[Outro: Twista Talking]\nThe last shall be first, and the first shall be last!\nSuccess is the best revenge, so get it how ya live!\nKeep yo swag on a thousand and mojo on a milli!\nLet’s go!\nPrada\nGucci, Louis, Prada [15x]\nGucci, Louis...", "image": "https://images.genius.com/1c52592bba661722429d74164cfb394c.500x500x1.jpg"}], "artist": "Twista"}