{"songs": [{"title": "Only Fear of Death", "album": "R U Still Down? (Remember Me)", "year": "1997-11-25", "lyrics": "[Intro]\nPssst... psssssst... ayo\nAre you afraid to die, or do you wanna live forever?\nTell me, which one?\n\n[Verse]\nThey wanna bury me, I'm worried, I'm losin' my mind\nLook down the barrel of my 9, and my vision's blurry\nFallin' to pieces, am I guilty? I pray to the Lord\nBut he ignores me, unfortunately, ‘cause I'm guilty\nShow me a miracle, I'm hopeless\nI'm chokin' off marijuana smoke\nWith every toke it's like I'm losin' focus\nFallin' asleep while I'm in service, when will I die?\nForever paranoid and nervous, because I'm high\nDon't mention funerals, I'm stressin' and goin' nutty\nAnd reminiscin' 'bout them niggas that murdered my buddy\nI wonder: When will I be happy? Ain't nothin' funny\nFlashbacks of bustin' caps, anything for money\nWhere am I goin'? I discovered, can't nothin' save me\nMy next door neighbor's havin' convo with undercovers\nPut a surprise in the mailbox, hope she get it\nHappy birthday, bitch, you know you shouldn't have did it\nEverybody's dyin', am I next? Who can I trust?\nWill they be G's, and they look at me before they bust?\nOr will they kill me while I'm sleepin'?\nTwo to the head while I'm in bed\nLeakin' blood on my satin sheets\nIs there a heaven for a baller?\nI'm gettin' suspicious of this bitch\nThe line's busy every time I call her\nNow she's tellin' me to visit, who else is home?\nI check the house before I bone, so we all alone\nAfter I nut I hit the highway, see ya later!\nTo all the players, watch the fly way a nigga played her\nThis bitch is tellin' all her homies\nThat I can fuck her like no other\nNow them other bitches wanna bone me\nI'm under pressure, gettin' drunk, somebody help me\nI drank a fifth of Hennessy, I don't think it's healthy\nI see my enemies, they creepin', don't make me blast\nI watch the 5-0's roll, the motherfuckers pass\nBy me like they know me, smilin' as they laugh\nI put up my middle finger, then I dash\nNiggas don't like me, ‘cause I'm thuggin'\nAnd every day I'm a hustler lookin' to get paid\n\n[Verse 2]\nThey wanna bury me, I'm worried—no need to lie\nI pray to God I don't scream when it's time to fry\nNowhere to rest, I'm losin' homies—ain't that a bitch?\nWhen I was rich I had clout, now a nigga's lonely\nI put the pistol to my head, and say a prayer\nI see visions of me dead, Lord, are you there?\nThen tell me, am I lost? ‘Cause I'm lonely\nI thought I had friends, but in the end a nigga dies lonely\nNowhere to run, I'm in terror, and no one cares\nA closed casket at my funeral and no one's there\nIs there a future for a killer? I change my ways\nBut still that don't promise me the next day\nSo I stay thuggin' with a passion, forever blastin'\nI'm bustin' on these motherfuckers in my madness\nThey wonder if I'm hellbound\nWell, Hell can't be worse than this, ‘cause I'm in Hell now\nDon't make me hurt you, I don't want to, but I will\nSeen motherfuckers killed over phone bills\nNever will I die, I'll be back\nReincarnated as a motherfuckin' MAC\n-11, ‘cause in Heaven there's no shortage on G's\nI'm tellin' you now: ''You motherfuckers don't know me''\n\n[Chorus]\nOnly fear of death... you ghetto niggas\nOnly fear of death is comin' back reincarnated\nOnly fear of death... you ghetto niggas\nOnly fear of death is comin' back reincarnated\n(I ain't scared to die)\nOnly fear of death... you ghetto niggas\nOnly fear of death is comin' back reincarnated\nOnly fear of death... you ghetto niggas\n(I ain't scared to die)\nOnly fear of death is comin' back reincarnated\nOnly fear of death... you ghetto niggas\nOnly fear of death is comin' back reincarnated\nOnly fear of death... you ghetto niggas\n(Only fear of death)\nOnly fear of death is comin' back reincarnated\nOnly fear of death... you ghetto niggas\nYou ghetto niggas...\nYou ghetto niggas...\nYou ghetto niggas...\nYou ghetto niggas...\nYou ghetto niggas...\n\n[Outro]\nI ain't scared to die\n(You ghetto niggas...)\nDo you wanna live forever?\n(You ghetto niggas...)\nAre you scared to die?\nOr will you scream when you fry?\nI don't fear death\nMy only fear of death is coming back, reincarnated\nThis is dedicated to Mental, R.I.P\nAnd Big Kato, R.I.P.\nAnd all you other O.G.'s who go down; I don't fear death", "image": "https://images.genius.com/4f924e981b74c6d754d2c9da26f83f15.500x500x1.png"}], "artist": "2Pac"}