{"songs": [{"title": "No More Fun and Games", "album": "The Documentary", "year": "2005-01-18", "lyrics": "[Intro: The Game & Just Blaze]\n3 minutes, my nigga, y'all know what it is\nJust Blaze!\n(No more fun and games!)\n\n[Verse 1: The Game]\nGangsta gangsta, that's already evident\nNigga Wit' a Attitude, check check my residence\nWhether I'm Crip or Blood, homie, that's irrelevant\nI'm with the D.O.C., there's nobody better than\nThe West coast felon when he on that lowrider bike pedalin'\nSomebody tell Eazy they still yellin' it\nI'm wit'cha homie Doc Dre on the television\nWhile these niggas movin' peanuts like a elephant\nI move cars like spinnin' rims\nI'm in a class all by myself like the brown Eminem\nNot to down Eminem, I fuck black bitches\nFuck white bitches, nigga, I like bitches\nThem half-and-half Alicia {Keys} dyke bitches\nIf the head right I might Air Nike bitches\nOr put 'em on the track like Just Blaze\nI look down on hoes and look up to Dre\n'Cause ain't\n\n[Chorus]\nNo more fun and games!\nGangsta, gangsta!\nThat's what they're yellin'\nIt's not about a salary, it's all about reality\nI ain't gotta tell you this but one mo' time\nLeroy!\nNow pay attention\n\n[Verse 2: The Game]\nI'm like Dre, Eazy, Cube, King Tee and Ren rolled in one\nUsed to move birdies 'til I put a hole in one\nNigga that thought I wasn't holdin a gun\nAnd tried to ride up on me like Afeni Shakur's only son\nDre told me he ain't doin' Detox, this his only run\nMa$e comin back, and Hov, he done\nI'm surrounded by legends, sittin' at the round table\nI am The Game, and still niggas tryna play dude\nI'm ruthless, I ain't talkin' 'bout the label\nI'll hook niggas up, and I don't mean free cable\nI mean I'll hook niggas up to them IV's\nThe same way Dre hooked me up to Iovine\nI'm from the gutter, grew up in public housing\nOn the same block with a shack like Yao Ming\nSo if a nigga ever try to Jerry Heller me\nTell Dre put up a mill, cause that's what my bail'll be\n\n[Chorus]\nNo more fun and games!\nGangsta, gangsta!\nThat's what they're yellin'\nIt's not about a salary, it's all about reality\nNigga, I just came out the hole, I done did my time\nNigga, what you know about time?\n\n[Verse 3: The Game]\nI've been rappin' for one year, one month, 17 days\n13 hours, 28 minutes, then I met Dre\n30 minutes after I bought the new Em\nThat was November 18th, 3:09 PM\nAround the same time, \"Wanksta\" got it's first spin\nThat was 32 weeks before they signed Rakim\nEight months, 13 days before I knew a Mike Len\nAnd three years after Mason Betha turned his mic in\nI started writin' 22 months and 20 weeks prior\nTo LeBron shakin' Adidas for Nikes\nI'm right here, six years after Randy Moss\nCaught his first touchdown for the Vikings\nJust one day, seven hours, 14 minutes\n21 seconds before SoundScan got printed\nTwo platinum records 'fore I'm classified with Biggie\nAnd two seconds before the song finish, yeah\n\n[Static]", "image": "https://images.genius.com/395930cce0f4587e3046d2e0a817502c.900x900x1.jpg"}], "artist": "The Game"}