{"songs": [{"title": "Make It Go Right", "album": "Royalty", "year": "2012-07-04", "lyrics": "[Intro: Kilo Kish]\nUmm, okay\nYea, candy\nUhh, where is this song in my Blackberry?\nYea, yea\nAlright cool\n\n[Verse 1: Kilo Kish]\nOkay\nAs my mind run licking cotton candy lipstick\nYou're right here in my room, yeah I wished it\nCandlelight vigil for the one you're texting\nPink sweatpants - hmm, interesting\nNo need, don't explain to me, love\nCause I know how you deal, but I could see us\nIn a different way, don't play me cause we're not the same\nSign on, sees your screen name and misbehave\nSo you're a playboy, you think you're Heff kid?\nHoppin' round town with the bunnies when\nI'm the candy that you need, brush your sweet tooth\nHeard you got me replaced with a statue?\nA veneer, I hear, she's just swell\nIf you want to date a rock, you think I can't tell?\nSo you bored? Are you lost? Was it worthwhile?\nI feel the ice-cold chill in her warm smile\nSaw you last night, you didn't have to act foul\nCome and sweep me from the back room\nFeel my palms heat up on your chest now\nAs the night creeps into bedtime vows\nMarried in a white t-shirt, bed style\nStill, you know that I'm the best ride\nYou deserve what you get: it's called respect\nYou ever heard of it?\n\n[Chorus: Kilo Kish]\nI know what you're missing in your new life\nI can find a way to make it go right\nMake it go right\nMake it go right\nI know what you're missing in the moonlight\nI can fly away and make it go right\nIt go\nIt go\n\n[Verse 2: Childish Gambino]\nWhen I'm alone in my room sometimes I stare at the wall\nAnd in the back of my mind I hear my conscience call\nI used to front somethin' stupid, now I'm makin' them wait\nExcept for you mama, I'm ready, I don't wanna be late\nNever hesitate, you know it, petty cash, we blow it\nExcuse me for imperfect, them halfway looks is worth it\nI watched these niggas lurkin', they just want my leftovers\nWatching Locked Up all day and slept over\nPut your hair back: Afro\nSkippin' after-parties at the last show\nI'mma hold your hand in little Tokyo\nAnd tell you somethin' in your ear that you shouldn't know\nTwo jumps, but the feeling was so gone\nHigh school swag, busy fuckin' with clothes on\nLost a couple words, joke around the reason\nYou can wear my shirt, pretend to let you win that FIFA\nThere was nothing like it...settle down\nYou always hit me when my boo around\nIt's a long walk - we ain't talkin', though\nThat ratchet ho on lock-n-load, I appreciate the offer, though\nI'mma do it right - later, though\n'Cause, either way, you're gonna hate me like you say you won't\nThank God for that - it's called regret\nYou ever heard of it?\n\n[Chorus: Kilo Kish]\nI know what you're missing in your new life\nI can find a way to make it go right\nMake it go right\nMake it go right\nI know what you're missing in the moonlight\nI can fly away and make it go right\nIt go\nIt go\nI know what you're missing in your new life\nI can find a way to make it go right\nMake it go right\nMake it go right\nI know what you're missing in the moonlight\nI can fly away and make it go right\nIt go\nIt go", "image": "https://images.genius.com/587833871590a682c8aed1b739f0cb23.906x905x1.jpg"}], "artist": "Childish Gambino"}