{"songs": [{"title": "Gees - live in london", "album": null, "year": null, "lyrics": "Ignorant-ass white kid\nBut I'm still bicycling and recycling\nAnd I'm still eating Gummy Bear vitamins\nAll my bitches taking Vicodin, huffing nitrogen\nHyper than Williams' middle son, since I was\nA little one, Moms had to put me on the Ritalin\nMade a swisher run, crack the 40 then I lit a blunt\nTold Chuck I had a couple raps, so we kicked the drums\nAll the best rappers are usually dead\nBut I'm the poison that left a widow Juliet\nIn the studio with candles lit and Buddha heads\nComing up with all the coldest shit, take your Sudafed\nContagious, speaking while sedated\nGod shit, make 'em want to add a couple pages to the Bible\nI ain't got nothing left in my will\n'Cept throw it all in the casket, it's mine still\nI need some backpack cast raps\nTook a break just to kill the game half-ass\nSet some rat traps, went to take a cat nap\nWoke up, threw the dead bodies in the trash bags\nAct polite, but I'm nasty on the mic\nYour bitch don't want my dick, then she has to be a dyke\nSlap it but she like, tell me, \"Master, feed my pipe.\"\nI'm the Scotch on the Rocks, you the Appletini type\nBitch\nSuck my dick before I slap you with it\nGees\nSuck my dick before I slap you with it\nGees\nStill fucking with these hoes, though\nOzo on these doppelgänger Jojos\nTake a bitch to Soho for some Froyo\nTell her she gone blow it, Romo\nAnd now I'm out in Cali like Tone-Lōc\nYoung boy, but I'm chilling with some grown folk\nNo joke, most dope, you just bowl smoke\nHow much coke you got to sell to make a boat float?\nHit 'em, hit 'em 'til they tell me \"No more.\"\nI'm a highly difficult ropes course\nPulling up to Rome on a chrome gold horse\nSay \"What's up?\" to the Pope, pull off in a Porsche\nWho you kidding? Your flow's warshed\nI ain't from the street but I grow you from the porch\nI been had hoes, I play sports\nHer ass out the bottom of her shorts\nSuck my dick before I slap you with it\nGees\nSuck my dick before I slap you with it\nGees\nBlack James Bond in a white shaft\nTurned my daughter to a queen, turned a dollar to a dream\nFlashy as high beams, smoking on good weed\nSomething from kush seeds, the only strand to smoke for us OGs\nI'm rich car service, no car keys\nFirst class flight, 'bout to land on a new bitch\nShe fuck me and swallowed every homie I came with\nMCM bag and nigga, bet some weed in it\n200 dollars worth of Backwoods, we all living\nBrought the gangsters back to bucket hat, how real is that?\nI'm getting money, rub my tummy, that's my baller sack\nQuarter million in a safe in case I get a case\nFaggot-ass judge hating on me cause my money straight\nDropped 10 racks in all 50 states\nGone name my next tour Million-Man March\nMake a nun throw it back while I pull her scarf\nShe gave me head, my nuts touched her cross, boss\nFigg side\nSuck my dick before I slap you with it", "image": "https://images.genius.com/70b2ca5e1882a2f184d45a2e6ccb37eb.916x916x1.jpg"}], "artist": "Mac Miller"}