{"songs": [{"title": "Snoop D.O. Double G", "album": "R&G (Rhythm & Gangsta): The Masterpiece", "year": "2004-11-16", "lyrics": "[Intro] (Snoop talking)\nYeah! You know how we do\nA lil' something for the non-believers\nFor the underachievers\nYa'll know what time it is\nBig Snoop Dogg up in this motherfucka one time\nI want ya'll to sing this shit wit me\nIt go like this, check it out\n\n[Hook] 2x\nSnoop D.O. Double G, the way you rip so love-ely\nIt sound so visciously\nWhen the thump in the trunk go, bump, bump, bump\n\n[Verse One]\nEverybody put your hands to the motherfucking center\nBaby girl go on an' pull ya weave back, D-O-G, oh yeah, he back\nAnd I'm steppin' out the all-blue Lee-zac\nWord on the streets, yeah nigga, I got the feedback\nI don't trip off, I get the tip off\nBefo' it rip off, yeah homie, I'm the Biz-oss\nI got them finger-lickin' chickens wit the siz-auce\nAnd one of my hoes known to cut ya dick off\nLeave ya stuck in the land of the liz-ost\nI'm back at the mayn-sion, cold as the friz-ost\nSittin' on ten acres, dawg, wit a kiz-ost\nA whole lot to you, but a lil' nothing to me\nThat's what you get, for fuckin' wit me\nAin't that right, Sha Money from the D-P-C\nG-Unit!\nYou know I'm down with them boys\nI clown wit them boys\nDon't fuck around wit them boys, cause they down wit the\n\n[Hook]\n\n[Verse Two]\nSTOP! Wait! Now let me give it to ya\nThis is the proper hip-hopper, it get into ya\nI know you liking it, loving it, or you feelin' it\nD.O. Double Gizzel, oh yeah, Cuh/Cuzz be killin' it\nWho the only nigga that you can call on?\nWhen ya favorite rapper fall off, the Big Dogg, fall on\n10, 11, 12, or was it 13?\nHow many years a nigga been in the game, and I'm still so clean\nI'm flippin' up the game and shit\nI maintain my thang wit this\nAnd I, never hesitate to bang a bitch\nI'm having millions, and I'm still banging Crip\nUm, um, wouldn't you believe it?\nEven after achievin', got a deal wit the heathens\nBut, as long as I'm breathing\nI'mma keep walking like Jesus\nMy name is\n\n[Hook]\n\n[Verse Three]\n\"Whatchu gone next, how you gone say it\nWhen yo album come out dawg, I can't wait to play it\nTell the truth, my nigga, I love all ya work\"\nWell, from me to you low, welcome to the Church\nMi casa, su casa\nSo, get ya drank on and smoke on nigga, go on an' boss up\nYou can holla at baby, it's ok to me\nThen I love it when them motherfuckers say to me\n\n[Hook]\n\n[Outro] (Snoop talking)\nYeah! Sha Money, representin' G-Unit, good lookin' my nigga\nAs usual, it's a DPG-Unit connection\nYou know how we do it\nA lil' something for the non-believers\nFor the underachievers\n\n*echoes*\nSnoop D.O. Double G", "image": "https://images.genius.com/22daab0632e506300bab596c589dcfb2.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}