{"songs": [{"title": "Tabernacle", "album": "Tabernacle: Trust the Shooter", "year": "2016-03-03", "lyrics": "[Intro]\nYeah\nI wanna share some shit with y'all\nAll truth, all truth\n\n[Verse 1]\nUh, like I'm standing inside a Tabernacle\nI promised not to lie in not one of these verses\nI started out as a battle rapper\nAll I knew was Maxells, ADATs, DATs and gats\nUh, my name is Ryan Daniel Montgomery\nRecovering alcoholic, I grew up on 9 Mile\nUh, I'm not a gangster, drug dealer or thug nigga\nJust an MC who made a name with his rhyme style\nNow, sometime around '95 I found my calling\nAnd that all coincides with the time that I found my darling\nNow later on in the story, I tell you her significance\nBut now let's talk about me, specifically, three brothers and one sister see\nMy daddy taught me consistency with his fucking patterns\nHallelujah I'm the son of a addict\nMy addiction was music, all I would do is go to the studio and The Shelter\nAnd listen to Redman and Heltah Skeltah\n\n[Interlude]\nAye y'all remember that one joint from the Heltah Skeltah album called?\nSean Price be like, \"I'm not sure any—\" yeah, that was my shit\nI used to bump that shit all, day!\nBy this time I knew I wanted to be an artist\nI didn't want to be anything else\nYou know, but my mom had plans for me\nShe wanted me to go to school, so you know\n\n[Verse 2]\nUh, to make mom's happy, I took some general courses in college\nTook the bus until I got hella bored with that\nBecause the bus stop I had to walk to\nWas right across from the first studio I ever recorded at\nNow I would have to assume that it was either meant for me to be rapping\nOr meant for me to be laughing at God's geographical humor\nAs soon as I stepped foot in the open-mic, it was like a reunion\nI was a shoe-in\nI met Kino there too and he asked me to manage me\nAnd that was back in like, let me see\n'97, my girl was pregnant, hurdles was prevalent\nAnd it was therapeutic just for me to breathe into my mic\nStarted learning why the Lord put certain people in my life\nAnd the way he started blessing me, uh\nI guess before my inner demons got the best of me like sneezing was my vice\nNeedless to say that December 29th was the day I became a believer in fate\n\n[Interlude]\nOkay now it's December 28th, my day has gone great\nKino booked me a show under contract to do that night\nI got a call from my girl's people saying she's in labor\nIn the hospital right now, 9th floor\nI get on the elevator, elevator stops on the 5th floor\nElevator opens up, my uncle's standing there crying\nNow I'm caught off guard, I'm like, \"What the fuck?\"\n\n[Verse 3]\nMy uncle standing there like, \"Ryan, they that way\"\nI walk out, I see my momma and that entire side of my family\nLooking like there's some kind of drama happenin'\nI said \"What happened?\" They like \"Granny's been in a bad accident\nAnd it ain't looking good\", I'm like \"Man, what?\"\nI'm having a baby four floors up before I froze up\nI'm trying to figure out why the Lord chose us\nOr maybe chose me, to ride in this emotional rollercoaster\nMy momma said \"The baby here yet?\" I said \"Maybe\"\nShe said, \"Maybe? Baby, go see\"\nI walk away feeling like a good father, the same time as a terrible son\nGet to my girl she 5 centimeters dilated so I waited\nShe got to get to 'bout nine 'til it's that time\nAnd meanwhile I'm more popular in this hospital than the doctors\nNurses watching, whispering like \"That's the one right there\nWho got a lady in labor on 9 and another lady dying on 5\"\n\n[Interlude]\nBy this time I don't even fuckin' remember that I got a show\nSomebody had to remind me, the doors was already open at the venue\nI got emotions runnin' every which way\nAll the nurses and stuff is like, \"We'll keep you posted about the baby\nWe'll keep you posted about your granny.\"\nI didn't like seeing my mama like that, so I had to get out of there\n\n[Verse 4]\nYeah, I hit the stage at 11:50, killed it\nI got off at about midnight with about six types\nOf different emotions floatin' around inside me\nHopeless, tryna find me, hopin' in time God'll guide me\nIn the future, just as I was about to leave out\nI saw Kino talkin' to Marshall and then he introduced us\nWe talked about collaboratin' and how chasin' this rap thing is aggravatin'\nBut I'll get back, I got the family waitin'\nI get to skatin'\nAs soon as I get to the hospital, they tell me that my granny didn't make it\nShe just died, I'm feelin' helpless, it hurt me\nOn the flip side, my little boy is healthy in the nursery\nI picked him up, looked in his eyes for the first time and just cried\nAin't no denyin' this is the power of God\nI said, \"I love you, Granny\" and looked to the sky\nLike even though he just got here, goodbye\n\n[Outro]\nThis is how the story goes\nPowerful day (now you know) powerful day (now you know)\nMost significant day in my life\nI mean aside from meetin' my man Marshall\nMy son bein' born and my granny dying on the same day\nMy grandma didn't live anywhere near that hospital\nI learned a lot this day\nI learned that the universe has this way of balancing itself out\nFor me to lose such a beautiful soul in my granny\nAnd gain such a beautiful soul with my first born son, little Royce\nIt showed me that God is real, God is real\nAnd you know what they say: God giveth, God taketh away", "image": "https://images.genius.com/fe8f1046936cf77234fa0e8a11477d2a.500x500x1.jpg"}], "artist": "Royce da 5'9'’"}