{"songs": [{"title": "Fuck ’Em All", "album": "Better Dayz", "year": "2002-11-26", "lyrics": "[Hook: 2Pac + (singers)]\nYou a what? Bad Boy Killaz\n(That's right, bitch, fuck 'em all!)\nHahaha, yeah, nigga, fuck 'em all!\n(That's right, bitch, fuck 'em all!)\nFuck all you muthafuckers!\nAyo, Biggie, put your hands up!\n\n[Verse 1: 2Pac]\nNow, I can make it happen\nMy rappin' is similar to mothafuckers when they scrappin'\nBlast and watch 'em back up\nNotorious Biggie killer, affiliation with Death Row\nNiggas get their caps pealed back, fool, this the West Coast\nBitch, you misdemeanor, I'm raisin' hell like felonies\nMr. Makaveli straight outta jail to sellin' these\nIntoxicated, we duplicated but never faded\nNow that we made it my adversaries is player hatin'\nGot a Mercedes for these tricks, that thought I quit\nThen got a drop top Jag for these bitches that's on my dick\nGo to a club in a pack, I'm smokin' bud in the back\nI wait for niggas to trip ‘cause, bitch, I love to scrap\nMama raised me as a thug nigga, with love niggas\nI'm a millionaire started as a drug dealer\nI went from rocks to zines, writin' raps and movies\nI went from trustin' these tricks\nNow they all want to sue me, so fuck 'em all!\n\n[Hook: Young Noble + (singers)]\n(That's right, bitch, fuck 'em all!)\nCome put your hands up in the air!\nIt's a middle finger affair, yeah\n(That's right, bitch, fuck 'em all!)\n\n[Verse 2: Kadafi]\nNow, could you picture my criminal status at its fuckin' peak?\nEven the baddest be gettin' murdered in they seats\nI'm addicted to these streets, like crack is to these creeps\nSeein' visions of a prison, wake up screamin' in my sleep\nIs there a heaven in this hell? A possibility of livin' well?\nBut if they killin' me, I get my stripes and whose to tell\nChoosin' to sell, I'd rather die and be deceased\nWorld mob figure addicted to these fuckin' streets\n\n[Verse 3: E.D.I]\nNow, put your muthafuckin' hands up if you's a rider (Ride)\nNiggas ain't killers so they hidin' (Why?)\nFuck 'em all, touch 'em all; that's the way that we do it\nRide up, hop the fuck out, watch that bitch nigga lose it\nMan, I'm as strong as this game, ya'll be knowin' my name\nA young high strung thug nigga created by pain\nLivin' my life in the fast lane, gettin' fucked by the past\nGot my mind on my cash\nAnd my next piece of ass, so fuck 'em all!\n\n[Hook: Young Noble + (Singers)]\n(That's right, bitch, fuck 'em all!)\nCome put your hands up in the air!\nIt's a middle finger affair, yeah\n(That's right, bitch, fuck 'em all!)\nI do my dirt all by my lonely\nDon't need no phony homie to call me\n(That's right, bitch, fuck 'em all!)\nBack off, I hit at everyone of you homies\nSo don't get comfortable, I'm runnin' you\n(That's right, bitch, fuck 'em all!)\nNigga, we Outlaw riders\nDon't give a fuck if you love us, we thuggin'\n\n[Verse 3: 2Pac]\nI got glad bags with enemies, cut up so they remember me\nSoaked up in Hennessy, so they relatives know it's me\nYou can bet your last dollar, I'll dick 'em and holla\nRidin' these hoochies like they some heavy ass Chevy impalas\nJump up and get your ass shot up\nFor my profit pick my Glock up\nI'm bustin' with self-defense, you see\nPoppin' nobody got 'em, holla\nOutlaw riders, mash up on the gas pedal\nVacate the scene, count the cash and stash the precious metal\nHere come the coppers, the S.W.A.T. team and the helicopters\nThem crackers is crazy, why? ‘Cause they'll never stop us\nI watched Arnold Schwarzenegger bust somebody in a movie\nNow I want to do it too, ooh, ooh\nNiggas is too through, true to the game\nI claim Outlaw riders, we give a fuck what they try, I'm…\n\n[Verse 4: Young Noble]\n‘Cause Young Noble behind it\nCan you picture me stickin' niggas for they watch and chain?\nKick back, lil' nigga, and watch the game\nGet your mob rocked and what-not\nWe keep it poppin', like a drug spot\nThe streets know what's hot, trust me\n\n[Verse 5: Napoleon]\nEven my hood call me \"baby Malcolm X\"\nWith the TEC's, shower some slugs on 'em\nI've got a brother, don't rest and he keeps some drugs on him\nAlways in grind mood, hustle to find food\nEver seen Faces of Death? That's what my 9 do\n\n[Verse 6: Kastro]\nI keep my mind on my money, and my money on my mind\nWith my back against the wall, like I'm runnin' outta time\nEven rap with a gat, I must be goin' out my mind\nLike I'm up against the world, this guerilla team of mine\nScreamin', \"Thug Life, bitch, fuck 'em all!\" and die for 'em\nEven if the last nigga left I'ma ride for 'em\nFeel me? Until they kill me, that's how I'm rollin'\n\"Fuck 'em all, let them die!\" – that's my slogan; fuck 'em all!\n\n[Hook: Young Noble + (singers)]\n(That's right, bitch, fuck 'em all!)\nCome put your hands up in the air!\nIt's a middle finger affair, yeah\n(That's right, bitch, fuck 'em all!)\nI do my dirt all by my lonely\nDon't need no phony homie to call me\n(That's right, bitch, fuck 'em all!)\nBack off, I hit at everyone of you homies\nSo don't get comfortable, I'm runnin' you\n(That's right, bitch, fuck 'em all!)\nNigga, we Outlaw riders\nDon't give a fuck if you love us, we thuggin'\n(That's right, bitch, fuck 'em all!)\n(That's right, bitch, fuck 'em all!)\n(That's right, bitch, fuck 'em all!)", "image": "https://images.genius.com/4f7dcd7bb697e66f11fe0520838cb066.1000x1000x1.jpg"}], "artist": "2Pac"}