{"songs": [{"title": "Miss America", "album": "Born Sinner (Deluxe Version)", "year": "2012-11-13", "lyrics": "[Intro]\nThis is a public service announcement\nBrought to you by the good people over at Dreamville Records\n\"And so my fellow Americans\nAsk not what your country can do for you\nAsk what you can do for your country!\"\nExcuse me\n\n[Verse 1]\nLoad the clip in the chopper, flip the script and get Oscars\nAll my niggas is mobsters, all my bitches is doctors\nCole World, this just the tip of the iceberg\nSo talk shit and taste the tip of the Mossberg\nDon't trip nigga, they just words\nThough my words tend to sound like Proverbs\nNiggas don't see the preachers 'til we dead in the hearse\nGranny broke cause she always givin' bread to the Church\nNow pastor Mason Betha in a Lambo\nAnd little niggas holdin' desert eagles like they Rambo\nBumpin' my shit, always wondered why they fuck with my shit\nI hope it's 'bout the knowledge, not about who's suckin' my dick\nBut oh well, I'm gon' sell like I had no bail\nFor my chain and my piece I should've won Nobel\nIll, boy you cold nigga, yeah I know nigga\nOnly young nigga do it better than the old niggas\n\n[Chorus]\nTook chances, slow dance with the devil bitch\nOvercomin' the circumstances, we hella rich\nSince you all in my business, this what I tell a bitch\nIf you ain't fuckin' me, don't fuck with me, this life on the edge\nGreen dollars splurged all on embellishments\nMy fellowship paid, don't need to cop my fellas shit\nScoopin' hoes in the party, some Cinderella shit\nSmash for the hell of it, livin' life on the edge\n\n[Post-Chorus]\nMiss America, petty thoughts\nMiss America, petty thoughts\nMiss America, petty thoughts\nJust to floss pay any and every cost\nHeavy heart as I sit in this Range countin' thousands out\nAm I about dollars or about change?\nAm I about knowledge or about brains?\nFreedom or big chains, they don't feel my pain\n\n[Verse 2]\nBlood on my sneakers, no remorse for the grievers\nHe played the corner like Revis he should've had better defense\nThat's how I'm feelin', blood spillin' I love killin'\nNiggas'll swear that they it, this is as rare as it gets\nRap game changed, this is embarrassing shit\nBunch of bitches posin' on some old Miss America shit\nI was a wilder nigga back on my therapist shit, moving careless as shit\nIn a city where niggas really don't care who they hit\nWho the fuck was I?\nJust a young little nigga tryin' to see the other side\nOf the railroad tracks, where them scarecrows at\nNo brains on a nigga but they'll air your back\nFuck the man, Uncle Sam I won't sell your crack\nI won't fight your wars, I won't wear your hat\nI'ma pass your classes, I'ma learn your craft\nI'ma fuck your daughters, I'ma burn your flag\n\n[Chorus]\nTook chances, slow dance with the devil bitch\nOvercomin' the circumstances, we hella rich\nSince you all in my business, this what I tell a bitch\nIf you ain't fuckin' me, don't fuck with me, this life on the edge\nGreen dollars splurged all on embellishments\nMy fellowship paid, don't need to cop my fellas shit\nScoopin' hoes in the party, some Cinderella shit\nSmash for the hell of it, livin' life on the edge\n\n[Post-Chorus]\nMiss America, petty thoughts\nMiss America, petty thoughts\nMiss America, petty thoughts\nJust to floss pay any and every cost\nHeavy heart as I sit in this Range countin' thousands out\nAm I about dollars or about change?\nAm I about knowledge or about brains?\nFreedom or big chains, they don't feel my pain\n\n[Outro]\nThey don't feel my pain\nThey'll never feel my pain\nAnd they'll never play this shit on the radio", "image": "https://images.rapgenius.com/d2c03228cc81525cf82701eb62367fcf.500x500x1.jpg"}], "artist": "J. Cole"}