{"songs": [{"title": "Neverland", "album": "Any Given Sunday #5", "year": "2011-09-04", "lyrics": "[Chorus]\nIs the whole world gunnin for me\nOr is it just all in my mind?\nIf you want it, come and see me\nI ain't got nothin but time\nOne day youre gonna set me free\nBut first you got to let me shine\nNiggas ain't high as I be\nSee, look mama I’m flying\n\n[Refrain]\nTo Neverland, Neverland, Neverland\nI’ll probably never land\nNeverland, Neverland, no, I’ll never ever land\n\n[Verse 1 - J Cole]\nCheck my fortune cookie, it say Cole World\nCould that mean it's meant to be?\nSo much drive a nigga could've been a chauffeur\nThis life is fuckin with me mentally\nFake niggas try to act like they're a friend to me\nI treat you lames how I see you lames, enemy\nMy good girl say they want to know the inner me\nMy bad girl saying \"fuck all that, enter me\"\nDouble shots, Hennessy, bring out bad tendencies\nTry to cut somethin, need a volunteer, Tennessee\nAnything to take my mind off\nI logged on and made them motherfuckas sign off\nI got them on my dick, they’ll never climb off\nI switch watches yet I never took time off\nI don’t know what's worse, fake friends or fake fans\nBoth kissing ass for the chance to shake hands and damn\n\n[Chorus]\nIs the whole world gunnin for me\nOr is it just all in my mind?\nIf you want it, come and see me\nI ain't got nothin but time\nOne day youre gonna set me free\nBut first you got to let me shine\nNiggas ain't high as I be\nSee, look mama I’m flying\n\n[Verse 2 - J. Cole]\nI’m sortin through this\nOrganized confusion to get my thoughts together\nThis shit is soundin like a movie you can watch forever\nI got to make it to the top, its either now or never\nThese other niggas can't adapt because they're not as clever\nThe shit they talk is more expensive but I doubt it's better\nShe let that nigga make it rain but guess who got it wetter?\nCole World, snow flurries in the hottest weather\nAnd so sick they can’t fix this with modern medicine\nWe at your door and she's got to let us in\nIt’s what you want, I whet your appetite\nCole hit the scene now I’m what everyone rapping like\nShame you feel you have to bite\nStill ain't nobody snapping right\nPedal to the metal as I’m speeding through the traffic lights\nBitch I got to catch a flight, come on already\nStill fight like I’m the underdog, I’m on already\nGot a few niggas we about to prove wrong, yall already already", "image": "https://images.genius.com/305d79b43fb5a9df37794d76ec0bb1dd.500x500x1.jpg"}], "artist": "J. Cole"}