{"songs": [{"title": "Ya Feel Dat", "album": "Kristyles", "year": null, "lyrics": "[Hook]\nYa feel dat? (HO!) Ya see dat? (HO!)\nYa hear dat? (HO!) You believe dat? (HO!)\nYa follow dat? (HO!) Could it be dat? (HO!)\nYa follow dat? (HO!) Can you believe dat? (HO!)\nYa hear dat? (HO!) Ya see dat? (HO!)\nYou believe dat? (HO!) You can feel dat (HO!)\nYa follow dat? (HO!) You believe dat? (HO!)\nYa see dat? (HO!)\n\n[Verse One]\nShow me an MC that think he's too hot\nBring him to KRS-One, I'll show him he's NOT\nBlowin the whole spot up when I spit up\nKnowledge Reigns Supreme, when I walk past, get up\nMy wrists ain't lit up! I don't even live that life\nGold, diamonds, platinum, I give to my wife - you see\nDiamonds are a girl's best friend, not mine\nYou got it, FINE - but what about that rhyme?\nCan you rhyme? Can you spit it quick\nLike watermelon pits at a picnic? Ha!\nOr are you just dressed up with nowhere to go?\nOr is the record company the pimp and you the ho?\nLET'S GO!\n\n[Hook] w/ variations\n\n[Verse Two]\nI write my own books like I write my own hooks\nStep in the spot and these rappers be so shook\nThey don't look here cause KRS is BOOM!\nPlatinum rappers be hidin out in they dressin rooms\nYo, get away from me\nYou got a million dollar video but I'm the one they wanna see\nThe capital E-M-C-E-E\nA repitition of words, I been divorced Melodie\nI'm out, confident, no doubt\nI get what I gotta get when I spit I don't shout\nThis New Yorker, Kris Parker's a quick talker\nYou can get what I spit or get the klik-klocker\nOverseas I got the breeze as a hip-hopper\nWhere they speak eat and drop the beats proper\nStreet doctor, I'm +Brown+ and +Foxy+ like the +Ill Nana+\nWhoever you think is hot, I'm hotter\n\n[Hook] w/ variations\n\n[Verse Three]\nRADIO! These suckers never play me\nOr Chuck - but do you think we really give a...\nSouthside, Westside, Eastside, North\nI spit the hot flame, you get your flesh torn off\nI come from that place where you cats can't face\nWhere cops can't chase or invade my space\nWe turn up the bass, you tremble in the place\nPhones ain't traced and flows we don't waste\nHoes we don't chase or kiss, they know they place\nWith Kris or Christ, they'll lose their life\nYou don't lose if you come in two's, you and a wife\nBut you crews wanna be bruised, so choose your knife\nChoose your gat, choose your rat, when the smoke clears\nYou'll be like, \"God damn - who was that?\"\nLoosen that noose around your neck and back\nEmbarassin blacks, ain't no respect in that!\n\n[Hook] w/ variations\n\n[KRS-One]\nLet's do it! (HO!) (HO!) (HO!) (HO!)\nEverybody up top! (HO!) (HO!) (HO!) (HO!)\nYo, all my cats in the front! (HO!) (HO!) (HO!) (HO!)\nYo, yo, all my cats in the back (HO!) (HO!) (HO!) (HO!)\nYo, we out!", "image": "https://images.genius.com/2333a9607025ac4cc5a6777157dbce5f.220x220x1.jpg"}], "artist": "KRS-One"}