{"songs": [{"title": "Thug N 30", "album": null, "year": "2019-06-01", "lyrics": "[Intro: Young Thug]\nAyy, I'm watching my homie 'nem play pool, that nigga just did a bad ass shot, kid\nYeah, and I also got a young lady in here with me, I think she tryna steal me, 'naam sayin'?\nKnow what I'm sayin'? And heal me from my pain\nSupah Mario\nRain!\n\n[Chorus: HiDoraah & Young Thug]\nSpend a whole lot of cash on me (Yeah)\nMoney, power, that's the plan, homie (Yeah)\nYeah, yeah, you understand, homie ('Stand)\nYeah, yeah, you understand, homie (Yeah)\nYeah, yeah, you understand, homie (Yeah)\nHad a lot of niggas mad, homie (Yeah)\nYeah, yeah, yeah, I'm the man, homie (Yeah)\nYeah, yeah, I'm the man, homie (Yeah)\n\n[Post-Chorus: Young Thug]\nYeah, yeah, yeah, I'm the man, homie (Sheesh)\nYeaaaaahhhhh..... (Swea, ah, ah)\nMa-ma-man, homie (Ah!)\nMa-man, homie (Yeah)\nMa-ma-man, homie\n\n[Verse 1: Young Thug]\nShe diggin' my time like a bezel, ah\nNo Maison Margiela, my diamonds blingin', and my Rollie is gold like a treasure, ayy\nI used to get like ten thousand a show, now my diamonds are bigger than pebbles\nSmokin' on that moonrock, baby, I'ma climb it like I know Khaled\nSpent a hunnid bands on my belt, yeah, yeah\nHey, my slime down in Yo got an F&N and he will chop, yeah\nHe gon' let that bit' ride, dirty a nigga T-shirt and chop down, yeah\nShirt look like swag 'til you seen his ass on Channel 5, yeah\nI took two birds from him, ever since then, I been fly, yeah\n\n[Bridge: Young Thug]\nYeah, yeah, the bullets hit a nigga dome\nThat pussy wet like a sink\nYeah, yeah, nigga know it, can't afford it\nNew Orleans, I'ma go Saint (Woo, woo)\nYeah, yeah, don't talk, yeah, yeah\nTake me to church, I wan' sing (Yeah)\nOh yeah, yeah, yeah, yeah\n\n[Chorus: HiDoraah & Young Thug]\nDiamonds blingin' like I got baptized, yeah\nSpend a whole lot of cash on me\nMoney, power, that's the plan, homie\nI been eatin', she's feeding lies, yeah\nYeah, yeah, you understand, homie\nYeah, yeah, you understand, homie\nI tell y'all on that Vicky powder, yeah\nDon't tell me you boutta eat, then get no fries, yeah\n\n[Verse 2: Young Thug]\nPsych! I'ma take them hoes out for a good bite, yeah\nYeah, that's diamonds on me, and they bling like a knight, yeah\nYeah, I'm the principal, baby, take my advice, yeah\nYeah, baby, I'm the prince, I was gon' take your life, yeah (Boom boom)\nI know who I... (Yeah) Know who I am (I know it)\nDon't like me? (I know it)\nYeah, if you were broke, I wouldn't like me either, yeah\nAh, I set it off like Queen Latifah, yeah (Brrrrr)\nYeah, I'ma serve him like the zebra, uh, yeah (Ice)\nFuck them black and white diamonds on my muhfuckin' lever, yeah, yeah (Ice, ice)\nHey, yeah, a nigga caught runnin', booked, nigga bolt, nigga pleads, ooh\nGot, got books on my muhfuckin' pocket phone book, nigga pagin', yeah (What?)\n\n[Chorus: HiDoraah & Young Thug]\nYeah, hmph, hah, 1500 dollars on some maids, expensive (Yeah)\nSpend a whole lot of cash on me\nAnd I'm, and I'ma tell her like a boss\nMoney, power, that's the plan, homie\nYeah, and I'ma fuck a nigga mom, yeah\nYeah, yeah, you understand, homie\nYeah, and I'ma drink her like a sauce\nYeah, yeah, you understand, homie\nYeah, baby I'm not the father\nYeah, but I'll take care of your daughter\nOh yeah, yeah, yeah\nYeah, yeah, yeah, yeah (Hey)\n\n[Verse 3: Young Thug]\nI know you dig what I'm sayin', and that's coming from the heart\nI know you don't know about it, baby, you know more (What)\nYeah, you goin' slow, but, yeah, you oh so smart (Hey, yeah)\nYeah, they think you dead, but you right on their ass like boy, boy\nBack the fuck up off my big homie like boy, boy (Boy)\nI'ma let that Tommy hit tummies like tuh, tuh, yeah, ah\nBitch, I'm the Presi, fuck Barack, yeah\nYeah, how many businesses was closin' shop? Yeah (Hey)\nNah, we don't care nothing bout no cop, dog\nAh, 15 hunna for these cups, they art, yeah (Woo)\nYeah, ah, ah, hunnid thousand for the art, yeah (Bet)\nYeah, not going steady, Rocko air it\n\n[Chorus: HiDoraah & Young Thug]\nSpend a whole lot of cash on me\nAh, choppa on ready\nMoney, power, that's the plan, homie\nAh, call me the bomb\nYeah, yeah, you understand, homie\nChop, my i over there, yeah\nYeah, yeah, you understand, homie\nBentley\n\n[Verse 4: Young Thug]\nOoh, slatt\nSleep one eye open like I'm a Fetty, yeah (Yeah)\nClimb in a tree and they ready like spaghetti, yeah\nPlayin' with Slime, we Belly, yeah (Yeah)\nI was tryna live, yeah (Yeah)\nShe said she don't wanna play no games, no Anne Jackson (Woo, ayy)\nBaby come with a muhfuckin' dress, yeah (Drippin' swag)\nAh, and I'ma shoot it on your chest, better have a vest, ah, yeah (Eskeddit)\nI'm playin' around with your feelings, yeah (Yeah)\nI'ma take you all of them places (Take you all around the world)\nTurn your ass up 'cause you deserve it, ah (Said I want you, want you girl)\nNo Future, but I'm the future, I'm the teacher, baby, you the tutor, yeah (Yeah)\nAh, money longer than the world's longest ruler, yeah (Swea, swea)\nAh, playin' with YSL, niggas gon' shoot you, yeah (Boom, boom)\nR.I.P. to Bankroll Fresh, bro, yeah (R.I.P. Bankroll)\n\n[Interlude: Young Thug]\nYeah, yeah, yeah, yeah (Hot boy) Ayy (Thugger, ayy)\nYeah, yeah, yeah, yeah (Yeah, yeah) Ayy (Damn)\nYeah, yeah, yeah, yeah (Yeah) Ayy\n(Yeah, yeah, yeah, yeah, yeah) Ayy (Yeah)\nAyy! Ayy! Hey! (Yeah, yeah)\nHey! (Yeah) Hey (Yeah, yeah)\nAyy! (Hey) Hey (Yeah)\nYeah (Yeah, yeah)\n\n[Verse 5: Young Thug]\nMe and Stafa having fun, yeah\n'Cause it ain't no fun when the rabbit got a gun, yeah\nI'ma feed that bitch, then give her trunk (Racks)\nYeah, I'ma put a Rollie on her arm, yeah (Rollie, Rollie)\nPut a iced-out YSL right on her charms, yeah (Swea)\nBaby, told 'em don't need them, I'm the one (One)\nYeah, two door, not the, ah, three, I keep forgettin', yeah\nBut I got four doors, yeah\nFuck cameras, ah, fuck the Po-Po, yeah\nOh no, yeah\nThey coming to the door, flush the shit right now, come on, yeah\n\n[Interlude: Young Thug]\nYeah, yeah, yeah, yeah\nYeah, yeah, yeah\nYeah, yeah, yeah!\nYeah! (Yeah)\n\n[Verse 6: Young Thug]\nBeast mode, yeah (Hey)\nHunnid thousand, ain't no cheat code\nI can't talk cheap, one-twenty-seven on my teeth, uh (On God)\nYeah, bitch, I'm bleedin', look, I'd D-I-E, uh (Swea, woo)\nYeah, nigga, all my partnas rollin' Cs, yeah (Rollin' crip!)\nBig ol' dinosaur Bs (Blatt, blatt!)\nRight behind 'em (What?)\nYeah, all this ice on, baby, heat could find me (I see it)\nJust look where it's light at (Yeah)\nYeah, yeah, I won't buy that, uh (Yeah)\nI just go in and bite that, yeah\nI might wake up wearin' it, yeah (Yeah)\nI don't give no fuck 'bout your past, yeah (Ayy)\nI'm not Lil Wayne, and fuck that nigga, but I gotta take your ass there (Woah, say it)\nI don't care if you fucked the whole world, that's before me and you, yeah\nOh, oh, free Unfunk, Dulu, yeah (Free Unfunk, yeah)\nRide me like a goose, yeah (Like a goose, yeah)\nChicken-limb coupe, yeah (Racks, skrt!)\nDouble-R with no roof, yeah (Woop, woop, woop)\nRacin' down the street, nigga flyin' by high-speed, yeah (Whew, whew)\nYeah, makin' other rappers on time, yeah\nFilm while ridin' with broads, yeah (Yeah)\nAll my niggas here like a beat, yeah (Yeah)\nNoPlug pull up, nigga park, yeah\nPull up to the nine, nigga, blood, yeah\nPull up and it's fire like a pot, yeah (Pot)\nAll a nigga's diamonds gettin' large, yeah\nAll my niggas playin' like a child, yeah, ah (Skrt skrt)\n300 shit, nigga, why I sucked at law? Yeah (What?)\n300 shit like Lil Durk with no tar, yeah (Yeah)\nLyor, you keep playin', I'ma pull your card, yeah\nYeah (Yeah)\n\n[Chorus: HiDoraah & Young Thug]\nSpend a whole lot of cash on me\nLet that breathe\nMoney, power, that's the plan, homie\nLemme talk to the ladies for a minute, yeah\nYeah, yeah, you understand, homie\nYeah, yeah, you understand, homie\nLet's go\n(Yeah)\n\n[Verse 7: Young Thug]\nDon't leave me (Don't leave)\nReceive me (Receive)\nBelieve in me (Believe)\nCome and achieve with me (Achieve)\nYeah, come bleed with me (Come bleed with me)\nGo 'n' dye your hair red (Yeah, dye it)\nYou heard what Gucci said (Free Guwop)\nThese niggas rock how I be (They rock)\nYeah, yeah, yeah, yeah (Yeah)\nOh yeah, yeah, yeah, yeah, yeah, yeah (Ayy, this shit so good, I can't just say that once)\nYeah... yeah, yeah, yeah, yeah, yeah (Yeah, yeah)\nShe grinnin' 'cause she like the way I swag it\nYeah, I just told lil mama I'm not average (Born with it)\nYeah, I got her dead ballin' like a bastard, yeah (Woo, woo, woo)\nPlaid it\nCall her truancy, but baby girl ain't classy, yeah (Hah, hah)\nYeah, you the baddest (Baddest)\nI don't give no fuck if you've got baby daddies\nAyy, I'ma put you in that '16 'cLaren (Skrt)\nYeah, I learned to turn the f... factories off and put on Davins\nYeah, shout out to Migos, they be dabbin' (Dab)\nYeah, shout out to Peewee, man, we trappin', yeah (Yeah)\nI'm drinkin' lean, hey (Lean, lean, lean)\nI don't ball, no dee, yeah\n\n[Verse 8: Young Thug]\nBut I take the Molly, yeah (Wait)\nI told her I would stop, but I'm sorry (I'm sorry)\nI just can't, yeah, that money in the back, yeah (Yeah)\nBae eye on the bank, yeah (What)\nI got like a blank, yeah (How much?)\nWhere the crip? He ain't there\nMy bitch, she'd have banged, yeah (Bang)\nMy bitch, she so dangerous\nMy bitch, she so bad\nMy bitch, she so av' (Huh?)\nOops, I meant no (Yeah)\nNo, my bitch ain't no average hoe\nLeast a classy hoe, oh yeah, yeah, yo\nAnd her circle small like Cheerio, oh, oh, yo (Hey)\nNow you know, niggas, oh no, no, no (Oh)\nI ain't writing now, oh yeah, yeah, yeah (Yeah)\nYou so fine, baby, here, baby, go 'n' have my child (Ooh)\nOh yeah, yeah, yeah (I'm ready, like I'm spaghetti, yeah)\nOh yeah, yeah (So ready, ready, I'm ready)\nYou dig? (R-E-A-D-Y, baby, I'm ready)\nYou dig? (Yeah)\nHaha (Pop a perky and get ready)\nReal spit!\n\n[Chorus: HiDoraah & Young Thug]\nSpend a whole lot of cash on me (Dora)\nMoney, power, that's the plan, homie\nYeah, yeah, you understand, homie\nYeah, yeah, you understand, homie (Talk to 'em, slime)\n(Uh) And she said that was good, on hood, yeah (*sips lean*)\nWoah\nWoo! (Woah)\n\n[Verse 9: Young Thug]\nI wanna see you twerk! Ah (Twerk, twerk)\nI wanna buy them purses, yeah (Purses)\nYou make me mad, I'm gettin' the Birkin, yeah (Yeah, ayy)\n80k, baby, ain't discouraged, yeah (Scheme)\nI can spend it, bae, you're so worth it (So worth it)\nI, know you, baby, you are so perfect (Woah) to me\nFuck what they say, bae, you gon' twerk it (Woah) for me (Me)\nI give that stick you gon' go burst it (Ah) for me (Yeah)\n'N' I eat that pussy like Starbursts (*slurp*) oowee (Yeah)\nWee, oowee\nI know you like to see that, teeth on your lip, yeah (Yeah)\nI eat that pussy 'til it dip, I see that dip, yeah (I can see)\nI, I don't wanna fall asleep, I ain't gon' dip, yeah (I'll never sleep)\nI might pull off and leave some chips, yeah (Skrt skrt)\nI cannot get nervous, ah (Nah)\nI spent ten thousand on a purse, yeah (Fendi, Louis, Gucci)\nI ain't gay, boy, that's a male bag, yeah (Chanel)\nBig ol' bloody red rag, yeah (Blatt, blatt, blatt)\n\n[Verse 10: Young Thug]\nRace the Jag (Woo)\nBought the foreign right after that (And what?)\nThen I break that back, look what caused that (Woah)\nUh, so I'm riding with my driver (Money)\n2017 Cadillac on buyers, yeah (Swea, yeah)\nI go all night like a cypher, yeah (Yeah, yeah)\nI'm 100%, no liar, yeah (Yeah, yeah)\nIf I'm horny, bae, I can buy her, yeah (Oh yeah, yeah)\nI get rid of her when I'm tired, yeah\nBut mostly like, yeah\nI meant, but most likely I won't 'cause I like your donk, yeah\nI like your trunk, yeah\nI put money in your ears, money in your front, yeah\nI put veneers right inside your fuckin' mouth, yeah\nSo you can look like Baby when you fuckin' smile, yeah\nI know I am the truth, I am a wild child, yeah\nYeah, yeah, baby, I'm all yours, yeah (Woah)\nI cannot be all y'all's, yeah (Ah, ah)\nBut I'm a big dog, yeah (Big dog, yeah, cash)\nThis bitch like logs, yeah (Uhh, bitch)\nI came for two and y'all there (I swea)\nOoh, yeah\nI gave a few and y'all in there (Haha, yeah, yeah)\nYeah, G5 I put you in the air (Shh, pfff)\nYeah, tell 'em put a stripper pole in there (Ah, pew)\nShoot a video, yeah, nigga (Ah)\nTouch down like I'm Julio, Falcon, nigga (Brr)\nI just seen him in the Jefferies, these are thousands, nigga (Yeah)\nHe just cashed out, yeah\nAsk that nigga 'bout me (Yeah)\nI spent 50 bands (Ah)\nBitch, I'm not the topic (Woah)\nYeah, pshh, ooh, ah (Do it like that)\nMy bitch the hottest, oh yeah, pshh, ooh (Whatchu tell 'em?)\nWe like Bonnie & Clyde, oh yeah, ooh (Yeah)\n\n[Verse 11: Young Thug]\nOne more time, free them folks, Unfunk! (Yeah)\nI listen to that R. Kelly, \"I Wish\" (I Wish)\nThen I cry like a little bitty fuckin' bitch, yeah\nBut I love my brother, believe I really miss him (Real talk)\nI swear there's no other, I'd give you all this shit, yeah (Yeah, you can have it all)\nI'd give it all up to see him\nI wanna see my mama's face when she gon' see him, ah (Big Duck)\nI know these pussy niggas trippin', they wanna see you, yeah (They wanna see you)\nThey tryna stop you 'cause they know you like the Beatles, yeah (Beatles)\nBut they forgot that your lil brother out, and he Thugger\nYeah, I got that Ruga and a Reega (Pull it)\nI told you, yeah, yeah (Buh)\nI, I'll pop at your top 'bout my soldier, yeah (Pop it)\nYeah, that's my round like I'm from New Orleans, yeah\nYeah, yeah, crack baby, yeah, yeah (What?)\nBut I wasn't born in the '80s, oh, baby, yeah, yeah\nI wasn't even born up at Grady's, no, no, yeah, yeah\nTen thousand dollar couch in the apartment, my mama had me pick, ooh, damn (True)\nI-I came out with a few things, ooh, da-damn (It's true, yeah, ayy)\nYeah, I had diamonds in my skin, yeah, mmh, yeah (Swea)\nElm Elementary, I'm the prince (Thugger, show it)\nYeah, how I got in trouble? I ain't never do this (Man, fuck, yeah)\nI ranned off from 'em, and they say I'm missing (Yeah, bye)\nBut, bae, your son just out here strictly pimpin', ooh (What, chuch)\nYeah, I'm just gettin' 'em digits, yeah (Racks, cash)\nFell in love like I'll fuck that Benjie (Hah, hah)\n\n[Verse 12: Young Thug]\nMy nigga kickin' it, yeah (Kickin' it)\nMy baby girl gettin' it (Gettin' it, gettin' it)\nKnow you want to say her name, hhh\nBut you can't, 'cause that's... pain\nTo these other hoes, yeah (Yeah)\nKick 'em out the door, yeah\nAnybody more, yeah\nI want you for sure, yeah (Yeah)\nI don't want no bitches, yeah (Yeah)\nGive 'em to the bros, yeah (Yeah)\nI just want the money, yeah (Yeah)\nI just buy them clothes, yeah, uh (Racks, nigga, guap!)\nI just buy them cars, yeah (Bentley, blatt, woah, can't stop!)\nI can't stand them broads, yeah (Big, big guap)\nI do it for my girls and broad, yeah (Yeah)\nI do it for my lil girls and my little boy, yeah (Yeah)\nAh, crib and a hunna thousand on toys, yeah (Toys, let's bounce)\nAh, Easter huntin', baby, thousand for you (Twenty bitch)\nCharles Barkley, baby, ballin', oh yeah (Racks)\nAh, Michael Jordan, nigga, no Yeezy, yeah, breezy\nI get them racks, yeah I get cheese, you believe me (Yeah)\nThat fetty, moolah, and the cash, and the cash talk (Cash)\nYeah, hit him in his back, watch his ass walk (Boom)\nPussy nigga gettin' chalked, bring him out his red (Chalk)\nTell my niggas we not done 'fore dumb nigga's dead\nRun up on your closes, he can't even just push weight (On God)\nI wan' see your brains everywhere, then send some pics (Woo)\nYeah, shit get real drastic, nigga, playin' with that red tape\nNigga chickened out, nigga\nFree my muhfuckin' (Ah) dog, and I ain't even nasty, nigga (Woah)\nHe down to Smith, yeah\nClimb in it like wheel', yeah\nHe down to Smith, prison, I'm not talkin' Will, yeah, ah (Woah, woah)\nForeigns need them big ol' fuckin' wheels, yeah (Woah, woah, woah, woah)\nTwenty-eights like a fuckin' ferris wheel, yeah (Skrrrt)\nI be skatin' through your bitches, how'd I deal, yeah (Skrrt)\nWhere that there? Right around my bro got killed, yeah (Bennie, yeah)\nEver since then, motherfuck there, yeah (There, on dead, yeah)\nAh, you niggas know the fuckin' deal, yeah (The dealings, oh yeah, yeah)\nHe killed my brother, then his ass got killed, yeah (I saw my mama cry)\nLocked me up, I got appealed, yeah, ah (Cash)\nI'm on that Molly and a pill, yeah (Runnin' still)\nI don't wan' sign no fuckin' deal, yeah (I don't want no deal)\nI don't be wantin' no more familia, yeah (I want something real)\n\n[Verse 13: Young Thug]\nI want my bitch that ain't familiar (For real)\nI wanna give that bitch a million, ah (Yeah)\nI wanna show that bitch some bread, yeah (Lil bitch)\nBut she gotta be so relentless, yeah (She what?)\nI put them gangstas inside them skinnies, yeah (\"How you a G?\")\nThis beat better stop, I ain't never ending (Yeah)\nI swear (Swea)\nYou better cut it, boy, you know it (Cut it)\nYeah, I bought baby girl a Rollie (Rollie, Rollie)\nYeah, iced out, and I bought it for my homie (Homie)\nYeah, Ice Box got all of my brodies (Buy from him!)\nYeah, Elliante, that's my jeweler, spoil me (Elliante, ayy, hey!)\nYeah, I got that one of one, no shortage (Elliante!)\nYou can't get that, they cannot remake that, yeah\nBut you can go to him and they can fake that, yeah, ah (Yeah)\nBut they know they takin' that shit way back, yeah, ah (They know)\nI was buyin' on Bleveland where them folks flex, yeah\nBleveland slow, they lost Duke and then lil Bukk, yeah, hhh\nPut that bit' right in a buck, yeah, ah (Buck, uh, uh)\nHit this club and throw some bucks, yeah (Throw it, throw it, throw it)\nFuck on me, oh, bae, I'm buff, yeah (I just throw it, throw it)\nTry to play and good luck, yeah (And try to boom)\nI'm so tired, I give up, yeah (Man, I swear to swear)\nBut I don't give up on your love, yeah (Don't give up on your love)\nYou said you can't go too far, yeah (Can't go too far)\n'Cause he got you, but I got you, I can spoil you (Spoil you, I can)\nA little more, and then my bro, but I'm for sure, ah (Fasho)\nYou know I got it on the low, this ain't no hoe (Cash)\nI got a black card, and that muhfucker say, \"Woah,\" yeah (It does)\nI am a Zoe, bitch, I'm a z, ah, eater (Tu, tu, ah, fa, fa)\nI be smoking pounds of that reefer (Ah)\nYeah, diamonds dancing, can't move my speaker\nDiamonds had a nigga loud like a beeper (Beep)\nYeah, Dora got me some loud like a... Yeah (Yeah)\nNigga, Dora got me some loud like a... Yeah (Speak up)\nDora got me some loud like a beeper, yeah (Beeper, yeah)\nI can't wait to see you (See you)\nSlash that, I can't wait to be you (Ayy)\nI can't wait to treat you (Ayy)\nI can't wait to fuck you (I can't)\nI can't wait to suck you, yeah (Oh, I can't)\nPussy out, ah, yeah (Yeah)\nAct up, and I'll (Oh yeah)\nKick you out the spot, yeah ([?])\nWith a hunnid thousand, yeah\n\n[Verse 14: Young Thug]\nGive you the keys to the mansion, yeah (Mansion)\nYou can ride 'round that motherfucker, Marilyn Manson, yeah (Black out the Rollie, on God!)\nYou can call all of your friends, and then they come dancing, yeah (Come party, on God!)\nI pull up with fifteen bills and then throw them bands in, yeah (I wan' party, hey!)\nI throw like twenty thousand bands inside my house like it was the club, yeah (What? Woo!)\nI swear to God, if I'm lying, I can be a dub, yeah (Ooh)\nYou can ask them bitches up at Follies, boy, they love us (Ah, love!)\nYSL, I'm bangin' it 'til I'm in the dust, yeah (Ah, slatt!)\nEven when I'm in the dust, I'm bangin' it (Swea)\nYeah, before this rap shit, bitch, I had some stains in it ('Fore)\nYeah, I was standin' on Bleveland, nigga, bangin' it (On God)\nWe were shootin' at niggas, gettin' shot at, nigga, ranger shit (Brr, brr, brr)\nYeah, but ain't no anger shit (Yeah)\nI stacked it up (Yeah)\nI got a whole lot of free to give away balls, yeah (Let's go)\nI know Lil Chicken on that E, waiting on [?], yeah\nShe smoke that dope, her old man just died of some cancer (R.I.P. M[?])\nI pulled up on her, I remember her, no answer (I remember)\nI gave that bitch a thousand dollars, told her, \"Baptist, ([?])\nTake your ass down there to the church and go get seen'd about (Seen)\nYou just seen your boyfriend get seen'd about, yeah (R.I.P. boy)\"\nBaby, I bring the dream team out, yeah (Dream, dream)\nBaby, I got that tartar mouth, yeah (Tartar)\n\n[Interlude: Young Thug]\nGimme five seconds, let me drink up\n*sips* Hmhm\n*sips* Ayy, let's get it (Yeah)\nOh, my fault, that was four seconds (What?)\nGive me one more, more, muhf-, more second (What?!)\n\n[Verse 15: Young Thug]\nUhh, now we can start rappin' (Start)\nYeah, yeah, I was really rich, I ain't never trappin' (Trap)\nYou been hustlin' for ten years, that means you bad at it\nI just bought my muhfuckin' diamonds straight out a rabbit, yeah (Swea)\nHunnid Xans, I popped up, open up and, yeah (Popped up, Elliot, Elliot)\nAlso, yeah (Elliante)\nThey know wassup, yeah (Icier than a motherfucker, yeah)\nCome give me your whole heart, yeah (Brown like con[?]s)\nI won't stop, give it up, yeah (I got more ho[l]es than Kanye clothes)\nYou don't need no more, you know, yeah (You got me peepin' out the door)\nTriple-R means Really Rich Rebels (You wanna go up on a pole)\nTriple-R means Really Rich Rebels (Really rich, really rich, yeah)\n\n[Verse 16: Young Thug & Karlae]\nYou heard me? (You heard me?)\nI wan' touch your face (Please don't) (You heard me?)\nShe said don't touch her face, nah\n'Cause I dun' had my hands all over the place, yeah (Woah, woah)\nI can respect it, but you better not reject me no more\nOr I'ma beat your motherfuckin' ass, I'm not your hoe, you my hoe, for sure (Fasho)\nYou better know (Remember)\nYeah, write it down, take a fuckin' note (We should FaceTime [?], hahaha)\nTake a picture, I don't give a fuck, yeah (Nah, nah, nah)\nDisrespect me, put your ass in a buck, yeah (Buck, buck)\nFuck you 'til you got the hiccups (Woo)\nAh, ah, ah, and my knees up (Yeah)\nYou don't got no worries, baby, put your feet up (Yeah)\nYou got your Burberry on, baby, I see you (I see you)\nYeah, you be my mamacita (Mamacita, oh yeah)\nI'll leave my girl 'bout you, I'm for real, yeah (I'll leave my girl 'bout you, yeah)\nI do my thing, baby, I know you (I, I do my thing)\nGo 'n' do your thing on the Young Thug, too (Go and do your thing, yeah)\nYeah, would you leave your past and come fuck with me? (I know you will)\n\n[Interlude: Young Thug & Karlae]\nSay you promise (Hahaha, I promise)\nSay you promise on the mic (Haha, I won't)\nSay it... Say it! (I promise)\nYou gotta say it louder (I promise!)\n\n[Verse 17: Young Thug]\nYeah, she promised, ah (She promised)\nTherefore, she ain't gotta worry 'bout none, she ain't bummin' (No way)\nIf she was, oh my god, I'ma run it, yeah (Run it!)\nUp to Neiman's, baby, spend a couple hunnid, yeah (Cash)\nSpend a bundle, get them Versace drawers for me (Cash)\nI'd like to see you walkin' 'round in them drawers for me (Drawers, yeah)\nYeah, I want you cookin', do all for me (Cookin', do all)\nYeah, I want go against all them laws with me (Against all the laws)\n\n[Interlude: Young Thug & Karlae]\nWould you go against on my boss with me? Would you?\nHmhm, what'd you say?\nI got a lil drink, you said, you said [?]? [?]'s not here\nWould you?\n\n[Verse 18: Young Thug]\nYeah, she said it official like some fuckin' tissues (Yeah)\nHah, baby girl, you know I dress to see you (Ah, I do)\nAh, I just did the front cover to GQ (Get it right now)\nIssue, yeah, ah (Get it right, get it right now, get it right now)\nIf he ever hit you (Get it right now)\nBetter not tell me 'cause me and him gon' have some issues (Woo)\nYeah, keep it to yourself, baby (Yeah)\nI know you've heard that in the world, baby (Don't tell nobody)\nI know you wanna have my girl, baby (I'd love for you to)\nI know you want us to get the world crackin', yeah (I'll make love with your body)\nGon' and get the world crackin', yeah (Gon' and get the world crackin')\nLet's gon' and get this thing brackin', yeah (Let's gon' and get this thing brackin')\nCome sleep with me\nI'll take you to the mall tomorrow, spend a lot of Gs (On God, God)\nLike this shit here grow on trees, haha (Bling, bling)\nYou can't believe me, yeah\nUntil you hit the mall, now you can't see me (Trash)\nMoney stacked up (Yeah)\nAhh, I just might ride on the bus (Like damn)\nI might come out with a fuckin' hunnid bucks (How you feel?)\nI might come out with a million dollars up, yuck (Racks, racks)\nI'm not whippin' eggs, baby (Woo)\nIs it white? Lil bit yellow? It's dope instead, baby, yeah (Instead, yeah)\nYou red, baby, yeah (Red, yeah)\nPshh, gimme that head, baby, yeah (Bitch, gimme that head, yeah, yeah)\n\n[Bridge: Young Thug & Karlae]\nLet's do the sixty-nine, and that's the only time that you ain't a dime (Let's do the sixty-nine)\nLet's do the sixty-nine, that's the only time that you ain't a dime (Ain't a dime)\nYou ain't a dime, that's the only time that you ain't a dime (You dig me?)\nYeah, you ain't a dime, you ain't that (I dig you)\nHear me? (With a golden shovel, you know what I'm sayin'?)\nHear me? (And what?) (Hahaha)\n\n[Verse 19: Young Thug]\nWhen we do the sixty-nine, that's the only time that you ain't a dime, yeah (That you ain't a dime)\nYou not his no more, baby, yeah, you mine, ah (You all mine)\nYou're no longer his, baby girl, you're all mine (I swear to God)\nYeah, I treat you the same, baby, know the Lord, mine (I know the Lord, uh)\nHah, buy you everything, flood your bank account with diamonds (All you)\nDo everything to you, beat you up, crying (Crying, baby)\nAh, bangin' red like a strap, uh, yeah (Sing it)\nYeah, riding around the city on a helicopter, yeah (Skrt, skrt, yeah)\nI wan' meet your papa (I wan' meet you)\nYour mama died, I swear to God I wanna meet her, yeah (I swear I wanna meet her)\nMy lil brother can't wait to see you, yeah (I'll sing for your love)\nI'ma ball 'em, they can't dee him, yeah (I'ma take care of you, that's love, yeah)\nI'ma have him ballin', they can't dee him (Don't give us up, yeah, yeah, yeah)\nHe don't got no phone, baby, don't call him, you know you cannot receive him (Can't receive)\nYeah, we going to church to get them demons off him, yeah (Yeah, yeah)\nCome, see by him, God (I pray that the devil go away, God)\nI'ma turn him onto God (Yeah)\nI turned you onto God, how dare you? (How dare you!)\nTurned you onto God (Yeah, I did)\nBaby, bless you (Ah, ah, Jesus)\nNever stress you (Never stressin' it)\nToo beautiful, ah (Beautiful)\nGot your baby hair laying right down, like oh, oh, you pitiful (I'll never be pitiful)\n\n[Verse 20: Young Thug]\nY'all girls, y'all know how to get a nigga, hahaha\nYou gon' fuck 'round and get you a kid from a nigga (Get you a kid, yeah)\nYeah, you gon' fuck 'round and get blessed for the rest of your muhfuckin' life, yeah (Your life, yeah)\nYou gon' fuck 'round and get blessed 'til you muhfuckin' die, yeah (Real pimp)\nI know that ain't the reason why you winded, I'm just tellin' you gon' be winnin' (You win)\nFuckin' with me (Fuckin' with me, yeah)\nYeah, if I'm hot, baby, duck it with me (Duck it, ah, ah)\nYou compare, yeah, yeah, you said, baby, you was rare (Baby)\nYeah, yeah, she say she's prepared (Yeah!)\nShe's so sexy, she got on, oh she don't really rare (She's rare)\nAnd I don't know how to test it, but yeah, yeah, baby, yeah\nI'ma eat it inside, I'ma eat it like a bear, yeah, yeah\nI'ma eat it like a bear, money greener than my pear, uh (Eat, pussy)\nMe and you together, we a pair (We the pair, baby, yeah)\nBaby girl, throw it in the air (On a private jet)\nYour lil girl ain't got to worry 'bout a thing, yeah (I swear to God)\nI'ma buy her a lil Y-S chain, yeah (Chain, yeah)\nShe gon' look my motherfuckin' name, yeah (Like she wearin')\nYeah (Swea, freezin')\n\n[Interlude: Young Thug]\nAyy, somebody call Ice Box, man, lemme get baby girl sum'n, umm\nFloss on the bitch, you know what I'm sayin'? (Yeah)\nYeah, it cost a little digits (Bitch)\n\n[Verse 21: Young Thug]\nYeah, you flossy, you bossy (You flossy, you bossy)\nYeah, they play with you, put 'em in coffins, and they ain't duffles (Ba, ba, ba)\nWoo, yeah, I'm cookin' up fish and a muhfuckin' dolphin (Woo, ah)\nYeah, I put that Dickies suit right in her muhfuckin' closet (Ah, say it)\nYeah, I'm in red Chucks when I'm walkin' on muhfuckin' Slauson (Blatt, blatt, go, baby)\nShe tired of me rappin', but I dare to do this thing walkin' (Do it)\nYeah, I just bought a muhfuckin' Bentley, I'm dealin' with law\nI pulled up a Bentley with forgies, I dare you to leave me to dead and cough (Ahh)\nDamn, I just fucked it up, but I can speed it up, I can get it right back, yeah, yeah\nI can get the right crack, yeah, yeah\nPut the dick right in her, she came back like it was cooked crack, yeah, yeah\nAh, ah, she like, \"How the fuck did you did that?\" Yeah, yeah\nI was like, \"I was smokin' lean and drinkin' me some thrax,\" yeah, yeah (Sheesh)\nI'm different, I said I was smokin' lean and drinkin' some thrax, oh, wait (Yeah, ah)\nI had to slow it down, yeah, 'cause I know that you can't catch that, yeah\nThere you go actin' like a brat, brat, yeah (That's mine)\nTell me what you want, I want a nap sack, yeah, go pshh (Fine)\nBend you over, fuck you from the back, back, pshh (Yeah, yeah)\nPull out your jewel tracks, I can't afford that, yeah (Cash, yeah, ah, yeah)\nBabe, you snorin', yeah (Snorin')\nFuck you so long, I can make you snorin', yeah (Snore, yeah)\nHer lil toes are so sexy (Sexy)\nI'ma lick 'em while she... my lady, yeah (Know she wet, get it right, nigga, yeah)\n\n[Verse 22: Young Thug]\nLooks are deceiving (Yeah)\nThis shit can get freaky (Ayy)\nThis shit can get beated (No, really)\nThis shit can get beated up (Beat)\nThis shit can get nutted in (Yeah)\nThis shit can have strong between us (Yeah)\nThis shit can have all the bees (Ah)\nAnd this bitch don't need no friends (Ah)\nI got so much money on me (Ah)\nYou can call them your friends (Yeah)\nBaby, I'm your friend, yeah\nThem are your hands\nI give it to you, won't take it back, bae, that is your end, yeah\nYou can know it, yeah (Woo, wooh!)\nHow long have I been going Staf? (Yeah, yeah)\nHow long have I been going Stafa? (Please, hey!)\nTell me, but don't stop it, nigga, yeah (Can't stop)\n\n[Interlude: Young Thug]\nHow long I been going bro? (Yeah, yeah)\nThirty minutes? Huh?\nI can't hear you\nThirty minutes? (I ain't do that, but fuck it, let's get it, yeah)\n\n[Verse 23: Young Thug]\nI been rappin' for thirty minutes, and that's why baby girl tired, yeah, ah (I can't tell)\nI'ma see her when she admire me, yeah (When it's light out)\nI'ma accept her apology, yeah (Ah, suck it, yeah)\nFuck her good, and now she be stalking me, yeah (She cookin', she lookin')\nI ain't get killed, nigga, ain't no coffin me, yeah (No way, no way)\nOnly thing I cough is when I smoke some weed, yeah, yeah (*cough*)\nAh, bumble bees in here (Brr, brr)\nMountain Dew spill it bad, ayy\nTwo cups, yeah\nTeflon, what it do, son? Yeah (Ayy)\nI told my bitch I want a coupon, yeah (Coupon, yeah)\nI wanna fuck her on a futon\nI got it out of Lennox, and it was a pretty penny, yeah (It ripped, couple grand)\nI wanna see your body print all in it, yeah (Your print all in it, yeah)\nI wanna see your muhfuckin' bitch in it, yeah (Yeah, I wanna see her)\nI'ma nut, I wanna see babies swimmin' all in you\n\n[Outro: Young Thug]\nYou dig it? I dig it (I dig it, swear)\nWith a golden shovel, yeah (On God)\nWith an iced out, not AP, but the Rollie bezel, yeah (Bling, blaow, yeah, hunnid racks)\nUh, show-n-tell it, yeah (Cash, cash)\nA blind man ain't got business all at the movies, nigga, yeah (Blind man ain't got business)\nA deaf man ain't got no business all in a band, nigga, yeah (Deaf man ain't go no business)\nI'm just tryna count these bands, just gimme some racks, yeah, yeah (Yeah, gimme some bands, bands, bands)\nYeah, ah! (Yeah)\nAgh! (Just gimme some bands, bands, bands, hey!)\nYeah...", "image": "https://images.genius.com/717461618e785def35d07de6484b7ad4.1000x1000x1.png"}], "artist": "Young Thug"}