{"songs": [{"title": "Wings", "album": "Swimming", "year": "2018-08-03", "lyrics": "[Intro]\nYeah\nWell\n\n[Verse 1]\nI got a bone to pick like roses (Roses)\nI ain't feelin' broken no more\nBalled a fist, they gossiping, I notice\nTalkin' shit, I wander through the motives\nWonder who the fuck I'm supposed to be\nI ain't worried now 'til I leave\nI'm just tryna ride and feel the breeze\nWith something bad beside n' next to me\nWind in my face, don't stop now when it feels so great\nYou can run 'til you slip on the sidewalk\nAnd the same bone that you picked gon' break, that's a motif (That's a motif)\nYeah, when it's comin' right back, so familiar, never been realer\nNever felt so damn good where I'm at\nI don't know what it's all about\nRunnin' through too many thoughts to count (That's way better)\nStill ain't addin' up, I'll let you know when I've had enough, yeah\nYeah, well\n\n[Pre-Chorus]\nI'd put some money on forever, but I (Hey)\nDon't like to gamble on the weather, so I\nJust watch while\nThe sun is shinin', I can look at the horizon\nThe walls keep gettin' wider, I just hope I never find 'em, I know\nHey\n\n[Chorus]\nThese are my wings, these are my wings, yeah\nThese are my wings, yeah, well\n\n[Verse 2]\nMovin' so fast, the clock look slow (Slow)\nWater my seeds 'til the flower just grow, yeah\nLove so much that my heart get broke\nI don't really know how the normal shit go, so\nI guess I just play it by ear, silence is all that I hear\nListenin' close as I can\nGrowin' up (One, two, three) jump\nNobody holdin' my hand though\nTrust is a problem, never knew how\nYeah, that's why I just keep to myself\nGet what I need, and I be out (Please tell me)\nWho can surf the universe with me?\nLucifer is human, so are we\nAll I ever want is what I need\nAnd that don't include your time and company\nFollow me, we on the up and up\nRemember when I owed a hundred bucks?\nNow, I look around like, \"What the fuck?\"\nIf you don't fuck with me, you fuckin' up\n\n[Pre-Chorus]\nI know I need to watch my temper, so I\nDon't ever gamble on the weather,but I\nJust watch while the\nThe sun is shinin', I can look at the horizon\nThe walls keep gettin' wider, I just hope I never find 'em, no, no\nYeah, well\n\n[Chorus]\nThese are my wings, these are my wings\nThese are my wings", "image": "https://images.genius.com/f13c236f6f491aaa6321de872722ec5e.640x640x1.jpg"}], "artist": "Mac Miller"}