{"songs": [{"title": "Symphony in X Major", "album": "Man vs Machine", "year": "2002-10-01", "lyrics": "[Verse 1: Xzibit]\nTime to snap out of it, welcome to the real world\nMy life like a Hitchcock flick, stick to the script\nIf she can't stick to the script, stick to this dick\nHow she acting off of the fifth? Ridiculous shit\nWe don't need conversation, just crowd participation\nIf you here on vacation we got, rules and regulations\nSeparate myself from y'all, segregation\nTrying to stop Xzibit and Dre? Humiliation\nPure elevation, got me some inspiration\nTwo bitches in bubble baths, a beautiful invitation\nGot a live occupation, live for the moment\nI'm faced with an altercation manhandling my opponents\nI got eyes in the back of my head\nI never sleep so they bloodshot red\nYo we so far ahead of our time\nIf we can stop life and press rewind\nYou still wouldn't catch up 'til 2K and a dime, so turn it up\n\n[Hook]\nTurn it up! (Turn it up)\nThis is it! (This is it)\nWe the shit (We the shiiiiiiiiiit) Get with it!\nGive a fuck (Give a fuck)\nWho you wit (Who you wit)\nTurn it up! (Turn it uppppppppppp) Get with it!\n\n[Verse 2: Dr. Dre]\nTruthfully speaking, it's lonely up here all by myself\nSo I had to come down and pass around some help\nFrom N.W.A to whatever's next\nMake sure it says ANDRE YOUNG in bold letters on big checks\nYour shit ain't selling? Fuck it, get Dr. Dre on it\nYou got a budget? I'll get down, give me half of it\nOne session, one song, I'm gone\nThe first week, you hit the streets, a star is born\nTo add to my universe - let me show you\nWho can invade who nigga, and who can do who the worst\nWarning from the Surgeon General\nWatch out for fake hits and bullshit that sounds identical\nPick it up, read the credits, who you thought it was?\nTwenty years in the game, with a constant buzz\nPick a year, any year, see how hot I was\nSame shit today, and still don't give a fuck!\n\n[Hook]\nTurn it up! (Turn it up)\nThis is it! (This is it)\nWe the shit (We the shiiiiiiiiiit) Get with it!\nGive a fuck (Give a fuck)\nWho you wit (Who you wit)\nTurn it up! (Turn it uppppppppppp) Get with it!\n\n[Hook 2]\nStay.. in your place (Stay in your place nigga)\nYou can't face, what we bringing\n(What we bring to the game, playa)\nBounce like this (Bounce) Bounce like this\nBlaze your shit, Blaze your shit\nAnd get high for meeeeeeee\n\n[Verse 3: Xzibit]\nLet me give y'all niggas something to hold\nThis product not to be sold\nKnow you can't cook it over a stove\nYou can flip it and come back with a mitt\nDon't make me reach through your limo tint\nI just want my twenty percent\nThis is dedicated to the people that spoke too soon\nI think I'll stop shooting you niggas and shoot for the moon\nMotherfuckers turn respect on and off like a light switch\nI'll never be seen, like Farrakhan fucking a white bitch\nJump I won't flinch, dump I don't miss\nX holding this, I'm never losing faith or focus\nSo say what you gotta say, every day a holiday\nWe don't blow the roof, we blow the whole fucking spot away\nOrganize permission like, organized crime\nOrganized minds, organize they nickels and dimes\nOrganized vocab be organizing my rhymes\nOrganizing my business and organizing my time, so turn it up\n\n[Hook]\nTurn it up! (Turn it up)\nThis is it! (This is it)\nWe the shit (We the shiiiiiiiiiit) Get with it!\nGive a fuck (Give a fuck)\nWho you wit (Who you wit)\nTurn it up! (Turn it uppppppppppp) Get with it!", "image": "https://images.genius.com/857a416f44825b13b2e0155587142ae2.600x600x1.jpg"}], "artist": "Xzibit"}