{"songs": [{"title": "My All", "album": null, "year": null, "lyrics": "Who in the house?\nShouts out to SMG Studios\nFurther proof\nWe gon' switch it up on yall\n\nWhen I ride, late at night\nSay it all\nWhat you bout? What you for?\nEither stand, or you fall\nWith the skill that I'm smokin, and the strength in my hand\nIts a spell, it's a potion, its a part of the plan\n\nCame out tearin' it down on Lyricist Lounge\nLinked up with Mos Def for a serious sound\nPut it down and demanded respect\nGot 41 MC's to spit rounds without cutting the check\nRest in peace Amadou Diallo, [peace] follow me to the front of the lines\nWhere they shoot them hollows\nPainting pictures of a new tomorrow\nMy soundscape sound great, I go hard like the truth to swallow\nIntroduce you to Hi Tek, nothing but the raw\nOn tour with Common sense yelling fuck the war\nWay back in 2004, the democrats here to touch the floor\nAnd we touch the sky\nFirst album with Faith and Mary J. Blige, since my man BI (?)\nBrooklyn til i die, so its in my blood\nThey do it for the club, I do it for the love\nSo what do you want?\n\nI give it my all, how much to they want from me?\nWhatchu, whatchu, whatchu want?\nWhatchu, whatchu, whatchu want?\nI give it my all, how much to they want from me?\nWhatchu, whatchu, whatchu want?\nWhatchu, whatchu, whatchu want?\n\nI get it jumpin' like oh what a feelin'\nFrom the floor to the ceiling\nCatch me illin' on tour at the villain, chillin'\nLyrically I'm hip-hop's Bob Dylan\nStop risen like the body count when they cop killin'\nThe MC known to keep it real\nWatched the Grammys in the D with Dilla when he was nominated\nOn the road with Kanye before Kanye made it\nLife wasn't so complicated\nStated as one of the greatest by one of your favorite MC's\nLiberation gave it straight for free\nMixtapes you gotta pay the fee\nBut looking at me, Jean Grae, and SASG, yeah\nStill waters keep stickin\nSo I keep flowing like a tree in Brooklyn keep growing\nThese other MC's give up, I keep going\nSo my work generate the hate they keep showin'\n\nI give it my all, how much to they want from me?\nWhatchu, whatchu, whatchu want?\nWhatchu, whatchu, whatchu want?\nI give it my all, how much to they want from me?\nWhatchu, whatchu, whatchu want?\nWhatchu, whatchu, whatchu want?\n\n[Talib Talking]\n\nSometimes it feel like, how much more do you want\nI give you blood sweat and tears, for years and years and years\nYou ain't gotta like waht I do, but you gotta respect it\nI guess when you receive a lot of hate, it mean you affecting a lot of people's lives\nTalib Kweli\nLike my man Katt Williams says, if you got fourteen haters\nYou need to work on have sixteen by the summertime rolls around\nSummertime belongs to Blacksmith\nBlacksmith is the music, Blacksmith is the movement\n\n[Talib Kweli, Get Familiar!]", "image": "https://s3.amazonaws.com/rapgenius/talib-pic.png"}], "artist": "Talib Kweli"}