{"songs": [{"title": "Been There Done That (radio edit)", "album": null, "year": null, "lyrics": "I been there - been there\nDone that - done that\nYou got guns? - we got guns...\nYo, I got straps - we got straps...\nA million muthafuckas on the planet Earth talk that hard\nBullshit - 'cause it's all they worth...\n\nNo question, it's all about the D - O - E\nSo if money is the root I want the whole damn tree\nAin't tryin' to stock around for the Illuminati\nGot to buy my own island by the year 2 G...\nSince way back I've been collecting my fee\nWith the 48-tracks and the M - I - C\nGot a palace in the Hills overlooking the sea\nIt's worth 8, but I only paid 5 point 3\nWorldwide, got the triple beam, I slide\nListenin' to yo demo in a stretch limo\nIt's how I ride - cartel style\nFull, stacked to the max now\nA million-dollar smile, people wonder how\n'Dre Day' every day. Trips to Montigo Bay\nWith more chips than Frito Lay\nFlossed jewels in a tire, ain't nuthin' fly\nStraight or illegal - it's still the root of all evil...\nCoz...\n\n(Chorus) x 2\nYoung black Rockerfeller. Hell, a swiss and mozarella\nPockets sweller, gettin' money like a bank teller\n'Cause a fool and his dough soon split\nSo when you come across a fool get all that she be gettin'\nLadies, get your paper too\nDon't expect for no man to support you\nKeep it true\n'Cause most brothers are raised to decide for the pesos\nMy woman is independent, makin' dough by the case loads\nI'mma keep buildin'... make it killing\nKick back, relax, and grow old with my millions\nThat's where it's at. You got drama, I got the gat\nBut we're both black so I don't wanna lay you flat\nInstead let's get paper, while it's paper to get\nPrivate Jet, 600 coupes that I runs if...\nI'm livin' on another level that y'all ain't been yet\nSpend a mill, no sweat, water the line with my wet...\n\n(Chorus) x 2\nThis is for the millionaires\nThrow a stack in the air and watch brothers start plottin'\nHoneys start to stare\n'Cause game is money and money is game\nAnd broke brothers make the 45 flame with no shame\nNow many people die over these dead green guys\nIgnorance and greed take their ass by surprise\nIt's the root of all evil and sins\nYet and still it makes the world go around\nLike my 20-inch rims...\nMoolah y'all\nPlatinum plaques cover my walls\nGrindin', diamonds shinin', and without one flaw\nGet the cash, the grass, the ass will bounce\nLuciano and all amounts, that's all that counts 'cause...\n\nI been there...\nAnd done that...\n\nBeen there, done that...\nThe Aftermath!", "image": "https://images.genius.com/bf3badae49c33b583126057638078bd8.576x576x1.jpg"}], "artist": "Dr. Dre"}