{"songs": [{"title": "Ill Vibe (remix)", "album": null, "year": null, "lyrics": "My rhymes profess life like the birds and the bees\nMake Funk-Master Flex say yo I'm feeling these\nFlows make you shit in your drawers. Change your dungarees\nSmoking trees, getting cottonmouth, wild munchies\nBowed down the block eating food at Luigi's\nConstipated...too much extra cheese\nWell anyway, while I was cooling down at Luigi's\nI met some Siamese twins from overseas...Lebanese\nLet's begin with the friends from New Orleans\nThey had a fifth friend. She was straight Black-Portuguese\nPretty palm-olive-soaped skin, Aloe Vera-lese\nShe looked like the type of chick you only see in fantasies\nThe type of chick you would kill for to get between the knees\nYo. I made time to chill with Miss Portuguese\nWould you believe, the bitch tried to steal my fucking house keys\nAnd rob me for my G's\nHad to show this crazy broad, I mastered my Degrees and my Ph.D.s\nGot your face on camera; motherfucker say cheese\nYou better get with your friends quick, before I start to squeeze\nGetting caught up in that freaky gold-digger Jamborees\n\nI caught that ill vibe, Tip (Word, Bust?) Yo, yo, word\nThat ill vibe, Tip (Word, Bust?) Yo, yo, word\n'Cause when I'm in the place you know my shit be absurd\n(I caught that ill vibe Bust) Word Tip? (Yo, yo, word)\n(That ill vibe, Bust) Word, Tip? (Yo, yo, word)\n(So when I hold the Mic you know my shit be absurd)\n(I caught that ill vibe, Bust) Word, Tip? (Yo, yo, word)\n\nQ-Tip\nI got weight on my shoulders in the form of this beat\nAin't nothing sweet, on the street, for good these I compete\nCome off complete\nAnd you need to get back in your stance\nWe enhance and we're playing the whole world circumstance\nSo do good in your hood even though you puff life\nPositive to comply\nDon't screw up facing that crowd\nProgress don't fall back. We can't have that\nI'll hold your hand Black\nWe can't wind up with scratch\nI put my best foot forward, when I play in life\nCause this world as I live it, chill's like a double edged knife\nIn the jam we regulate, cause we organize\nLogically thinking when along's enterprise\nA lot of brothers from the ghetto got the gift of gab\nPeace to the West Coast and the East, we's fam\nNeed I make mention that the crew we've got\nMake things get hot, like the FoFo shot. Blauw!\nNo we don't promote no guns, but don't turn that cheek\nIn the world that we live calmness is viewed as weak\nSo, we got to stay awake for all these lizards and snakes\nSome of them come as friends; some of them come as Jakes\nWe decipher all the force and build rounds with our friends\nWhy's that?\nSo we can live right until time ends\nYo why's that?\nI estimate, so we can get these ends\nYo true that?\nBusta and Tip, you know we make minds bend\n\n(I caught that ill vibe, Bust) Word, Tip? (Yo, yo, word)\n(So when I hold the Mic you know my shit be absurd)\n(That ill vibe, Bust) Word, Tip? (Yo, yo, word)\n(I caught that ill vibe Bust) Word Tip? (Yo, yo, word)\n'Cause when I'm in the place you know my shit be absurd\nThat ill vibe, Tip (Word, Bust?) Yo, yo, word\nI caught that ill vibe, Tip (Word, Bust?) Yo, yo, word", "image": "https://images.genius.com/54314abfbbbf16253d72455428cc44e6.834x834x1.jpg"}], "artist": "Busta Rhymes"}