{"songs": [{"title": "Pass That Dutch (Remix)", "album": null, "year": null, "lyrics": "[Intro]\nListen up everyone! we have been just informed\nThat there's an unknown virus that's attacking all clubs\nSymptoms have been said to be - heaving breathing\nWild dancing, coughing\nSo when you hear the sound - who-di-whoooo!\nRun for cover motherfucker!\nWoooooo! Ahh daddy! Ooooo! Ah! oh, ooh!\nPass that dutch (ah), pass that dutch (ooh)\nPass that dutch (ah), pass that dutch (ah)\nPass that dutch (ah), pass that dutch (ah)\nPass that dutch (whoo), pass that dutch\n\n[Verse - 1]\nMisdemeanor on the flow, pretty boy here I come\nPumps and a bump make you wanna hurt something\nI can take your man I don't have to sex em\nHang em out the window, call me Michael Jackson (hehehee!)\nI'm a pain in your rectum, I am that bitch y'all slept on\nHeavy hitter, rhyme spitter, call me Re-Run\nHey hey hey, I'm what's happ'nin\nHypnotiq in my drink (that’s right!)\nShake ya ass till it stink (that's right!)\nMr. Mos' on the beat (that's right!)\nPut it down for the streets (that's right!)\n\n[Hook]\n(Who-di-whooooooooooooo!)\nPass that dutch, pass that dutch\nPass that dutch, pass that dutch, pass that dutch\nCome on pass the dutch baby! (ahh!)\nShake-shake shake ya stuff ladies!\n(Who-di-whooooooooooooo!)\nPass that dutch, pass that dutch\nPass that dutch, pass that dutch\nPop that, pop that, jiggle that fat (ahh!)\nDon't stop, get it till ya clothes get wet\n\n[Verse - 2]\nNumber one - drums go bump, bump, bump\nThis beat here will make your pum pum jump\nIf you's a fat one, put your clothes back on\nBefore you start putting pot holes in my lawn\nOh my gosh, oh my gosh\nI'm under attack like my name was Saddam\nI am the bomb from New York to Milan\nAnd I can write a song sicker than Jeffrey Dahm'\n(Woop woop!) Don't touch my car alarm\nBreak in my car you will hear \"Viper Armed\"\nI've been a superstar since Daddy Kane was raw\nI'm live on stage, c'mon and give me some applause\n\"Thank you! oh thank you, you all are so wonderful!\"\n\n[Hook]\n(Who-di-whooooooooooooo!)\nPass that dutch, pass that dutch\nPass that dutch, pass that dutch, pass that dutch\nCome on pass the dutch baby! (ahh!)\nShake-shake shake ya stuff ladies!\n(Who-di-whooooooooooooo!)\nPass that dutch, pass that dutch\nPass that dutch, pass that dutch\nPop that, pop that, jiggle that fat (ahh!)\nDon't stop, get it till ya clothes get wet\n\n[Interlude]\nListen up motherfuckers\nYou have five seconds to catch your breath\nFive - four - three - two - one\n\n[Busta]\nIt would be my pleasure\nIf you just let me knock they ass out for you baby\nLet's go!\nIt's the immaculate, incredible\nMagnificent, unforgettable, unimaginable\nSo that's such a dramatical situation\nSee all the shit you be facin'\nWhile I be in the place\nIn a way that be keeping the party shaking (oh)\nHut one, hut two, hut three, hut four, hut\nGet that thong, shorty, pull it out your butt (what)\nSee a crew of the baddest bitches laying the cut (what)\nIf you ain't saying shit for, we keep your mouth shut\nWhat, shut, what, shut, what, keep your mouth shut\nI brought a couple shorties back and they cleaning my house up\nAlmost forgot to mention I'm one of the most important\nAnd relevant in the street like a genius who speak intelligent, ah\nLook at all of the shades of my diamonds in my bezzle\nWhen light hits, forget it, I court a charge of embezzlement\nMissy, give it to 'em, let's take 'em all on a ride\nJust remember to pass the dutch on the left hand side\n\n[Missy]\nWhooo\nPass that dutch, pass that dutch\nPass that dutch, pass that dutch\nPass that dutch, come on pass the dutch baby\nShake, shake, shake your stuff ladies\nWhooo\nPass that dutch, pass that dutch\nPass that dutch, pass that dutch\nPop that, pop that, jiggle that fat\nDon't stop, get it till your clothes get wet\n\n[Missy]\nPop that, pop that, make that money\nJust keep it going like the Energizer bunny\nShake that, shake that, move it all around\nSpank that, yank that dutch back now\nFreak him, freak her, whatever your choice\nDidn't come to judge, I came to get you moist\nScream (whoo whoo!) now my voice is lost\nCan I get a ride on a white horse *horse*\n\n[Missy]\nWhooo\nPass that dutch, pass that dutch\nPass that dutch, pass that dutch\nPass that dutch, come on pass the dutch baby\nShake, shake, shake your stuff, ladies\nWhooo\nPass that dutch, pass that dutch\nPass that dutch, pass that dutch\nPop that, pop that, jiggle that fat\nDon't stop, get it till your clothes get wet\n\n[Missy]\nPop that, pass the dutch baby, jiggle that fat", "image": "https://images.genius.com/085828b7d79bf8cf068b1557ca7a5e4c.1000x1000x1.jpg"}], "artist": "Missy Elliott"}