{"songs": [{"title": "Flex", "album": "Holler If Ya Hear Me", "year": "1993-02-04", "lyrics": "[Chorus]\nFlex, flex flex\nFlex, flex flex\n\n[Verse 1: 2Pac]\nSlippin' through my shit wonderin' what hits it get\nEven before the flicks I was always hit to flip the script\nLet's play a game, call catch a bitch, how you play?\nWell diss me nigga and catch a fist, you playin'?\nOoo, I know you didn't expect a nigga to catch wreck\nI'm comin' from the west, they all slept (Flex)\n'Cause it's been a long day\nAnd I get with Johnny Q when niggas rub me the wrong way\nTwenty four tracks is fat and all that\nPack smack, jaw crack, after that, can I get my balls back?\nNigga don't front, just pass the blunt\nI freak the funk for the trunks, pop the pump on the chumps\nI make ya jump\nDum diddy dump, love to thump\nLeavin' niggas with Plumps, smokin' blunts and skunks\nSo here it comes, let's have a gun\nOr get done by the worst of our trumps for fun\nPump pump!\n\n[Chorus]\nFlex, flex, flex flex\nFlex, flex flex\nFlex, flex flex\nFlex, flex flex\n\n[Verse 2: Kastro]\nOH! duck, prepare to throw nigga, get that ass dropped\nGive us mad props and get packed I'm mad hot\nSo get that 'caine step to the wrong fuckin' man\nThe crew too, fifty niggas in the wrong clan\nYou fuckin' bitch you better take you snitch ass home\n[?] is up feel his chrome on your damn dome\nBoom boom boom niggas better duck or get bucked\nFuck stuck in the damn gut\nI tryna tell ya but niggas ain't feel me\nThe fuck with dollar wouldn't that, never hail g\nBorn for boner, raise up in the stack\nSchoolin', I'm ready to feel pain bet you ass\nWill be fillin on the\nFoul type, then you say hi when I pass by\nA nigga tryna act fly god bless the nice try\nStraight serve, what a herb, kicked to the curb\nSlammin' dust, he got some motherfuckin' nerve\nSo back fuckin' and get jacked , dont test\nSo get wrecked and it will be a mess\nIf they wanna be a\n\n[Chorus]\nFlex, flex, flex flex\nFlex, flex flex\nFlex, flex flex\nFlex, flex flex\n\n[Verse 3: E.D.I. Mean]\nHey yo, nothin' gets buck quick\nWhen he fuck with, and Thoro Headz stuck\nBet you can't budge with the rough niggas\nSee, it's fifty niggas with me, is hundred head raw\nNot to mention a countless, I'm not ya ammo\nSo why would you wanna play a test\nYou can't fade the best, since you get laid to rest\nYeah, still wreck, you testin' your mic full of check tack it\nRep with\nNiggas wanna flex it\nThey call me Big Mac, you put the fuckin bitch\nAnd I'm outie\nFive dodge and you will never doubt me\nI'm gettin' flammy on this 2Pac jammy\nYo, sittin' and pissin' on a bitch ass panty\nYeah, like it's magic we comin' on that ass massive\nBetter tap in or get your ass kicked\nAnd if you plannin' on rushin', better stomp fast\n'Cause in the flat, I snatch a badge out you mark ass\nAyo, spark, split fifty niggas\nThey should give us motherfucker some of that real shit\nIll shit they keep holes on the deals nigga\nAttackin' niggas like shit list with quick hits\nSo fuck a rhyme if ya feel what I want for tacs\nWatch ya back, nigga, 'cause we ain't quitter\n\n[Outro: 2Pac]\nThoro Headz motherfucker\nBig Malcolm, motherfucker indo boy\nStrictly representin' for the motherfuckin' fuigitive [?]\nThem niggas can't be fucked with\nSo when I keel over and die they gon take the shit\nAll you weak motherfuckers get the motherfuckin' [?]\n'Cause my niggas ain't afraid of flexin' you feel me\nYoung Niggas, Young Niggas", "image": "https://images.genius.com/ef774ce00a20263f0be29fcac6d0b823.600x600x1.jpg"}], "artist": "2Pac"}