{"songs": [{"title": "Relapse", "album": null, "year": "2019-05-27", "lyrics": "[Intro]\nThis bitch, Taz you hear me folk? I'm finna eat! (808 Mafia)\nG-Money you hear me folk? I'm finna eat!\nMax Lord you hear me folk? I'm finna eat! Ha!\n\n[Verse 1]\nMy niggas all in, ballin\nFucking hoes we ain't calling, or talking\nThey follow us, they get to stalking\nShe gonna top me up, right after I park it\nShe asked to hit my blunt, bitch I just sparked it\nThis-this that Kimbo og, this that cough shit\nI bought a zip of that stank, smell like toxic\nHair trigger on that choppa like a off switch\nRed beam on your head, you a target (you a target)\nI walk my shit, I don't talk it\nI'm a dog, bite down, I don't bark it\nOmega Sci-Fi if we fighting\nI'ma get to stomping, I'ma get to stomping\nPack of slimes on your ass like Bompton\nFuck nigga cross the line, then it's slaughter\nOld niggas hold on to your daughters\nCause if she hear one song that bitch a goner\nD-D-D-damn, stutter off the percs like, y-yeah\n.40 make 'em jerk like that Cali dance\nVersace palm trees I'm rocking these Cali pants\nMe and Max Lord taking the Klonopins\nThat's a Benzo Xan for the dumb niggas that ain't never understand\nI done took a lot of Xans\nCut it out for a while, get back on 'em, time to relapse again\n\n[Refrain]\nCut it out for a while, get back on 'em, time to relapse again\nCut it out for a while, get back on 'em, time to relapse again\n\n[Verse 2]\nPassed out at her house, woke up sleeping on the front lawn again\nForeign bitch, I don't know where she from I just call her Mulan, yeah\nI got green like a lime, yeah\nFendi on the design, yeah\nMoncler on me like I crack cars, I used to crack cards, now I just crack broads\nY-R-N right, young rich nigga that's for life\nMy dick all in your wife\nFuck her off the Percs, it's gon' be a long night\n\n[Refrain]\nCut it out for a while, get back on 'em, time to relapse again\n(808 Mafia)\nCut it out for a while, get back on 'em, time to relapse again", "image": "https://images.genius.com/da625002f845a2cd27b4562f9d2cc206.336x336x1.png"}], "artist": "Juice WRLD"}