{"songs": [{"title": "Rare Breed", "album": null, "year": "2010-06-30", "lyrics": "[Intro]\nRare Breed, Kendrick Lamar\nBreed up or speed up\nBreed up or speed up\nBreed up or speed up\n\n[Verse 1]\nThis is for my niggas that be all blacked out\nHit the streets a hundred deep, what Rare Breed about?\nRiding hard, bending corners, the girlies on us\nLeave a hater scarred, big Dressers sit at the stop light\nRoad Glides and Road Kings deep in my hindsight\nYou do it right or don't do it at all\nPut that candy paint on it, ride them twenty-threes homie\nCustom seats, custom brakes, hit the streets and ball\nCentre of attention like Bynum and GasolYou know that killer californication\nWhen you feeling like you sitting on a ceiling, chasing\nDreams, hoping this conglomerate can run the nation\nIt's abomination how we bomb yo' block\nI'm talking Big Punch, K-Dub, Baby Slip Billy\nBad Azz, Rare Breed, we all we got\nSee 'em out, show 'em love, chunk the deuce, give it up\nIt's a lot of bike clubs but they not this hard, nope\n\n[Hook]\nPounding on the highway stretch\nAll blacked out, making sure we on deck\nMight catch us on them Dressers or them Road Glides, yes\nTell the world I'm a Rare Breed baby\nBreed up or speed up (don't stop, don't stop)\nBreed up or speed up (don't stop, don't stop)\nBreed up or speed up, I'm a Rare Breed baby\n\n[Verse 2]\nAnd it's like that to the death though\nTwo-oh-point and seeing decimals, I ain't lying\nPounding on the interstate in the state that shines\nOr we might be in a hood near you\nAround the globe baby, Rare Breed under control baby\nThem pipes loud, the movement entice crowds\nWe heat it up in the cold baby\nIt's three degrees out? Then you should see me out\nOr see bout them kitty cats and how they go meow\nHa-ha, we be the father of Harley drivers, so don't bother\nShow you infants how to whip it, have a bye-bye\nPosers try to hang? Then we hang 'em by the collar\nSilk, lannie, Rare Breed family\nStunting hard like a black circus, voila\nBreed up or speed up, get ahead\nSo with that said, bye-bye\n\n[Hook][x2]\n\n[Outro]\nShouting out the one and only Rare Breed\nNow Breed up!", "image": "https://images.genius.com/25d8a9c93ab97e9e6d5d1d9d36e64a53.1000x1000x1.jpg"}], "artist": "Kendrick Lamar"}