{"songs": [{"title": "Keep It Movin’", "album": "The Coming", "year": "1996-03-26", "lyrics": "[Produced by The Ummah]\n\n[Intro: Busta Rhymes]\nAiyo, where my niggas at?\nFuck, my niggas is at?\nWhere my Leaders Of The New School niggas is at?\nYo, aiyo C Brown, C Brown where the fuck you at, dun?\nAiyo Milo, Milo and the dance, where the fuck you at, nigga?\nAiyo aiyo Dinco, where you at, son?\nWhere the fuck my Leaders niggas is at, man?\nFuck man, I'm ready to grab my niggas\nThem niggas need to go to blow or sometin\n\nKeep it movin', keep it movin' (Runnin faster than the speed of a bullet)\nKeep it movin', keep it movin' along, keep it movin' along\n(Has more rhymes than any other DJ that has craps)\nKeep it movin', keep it movin' (Able to leap sucker MC's in a single bound)\nKeep it movin', keep it movin' (Look at the jam of the mic)\nKeep it movin' along, keep it movin' along (It's the L-the O-the N-the S)\n\n[Verse 1: Dinco]\nWhat three initials blows it up like me?\nBesides TNT, CNN and BET\nMy visionary which is skippin on my D-O-G\nI guess it was a S-O-S from G-O-D\nChaos has arisen interteller space souls (SOULS!)\nCellular, good ridance, like keypads wit ol' bass\nThird planet states while the rest of the world waits (WAITS!)\nJoy to the world, meaning hail, snow and earthquakes\nParticipates, modulates\nIf comets were round plates, bitten names gates\nFor only those involved relates, case after case (CASE!)\nDinco's on the next space\nMovin strategically in the Solar System's waste (RAHHH!)\nSize 25, the lymph still be in place (HAHHH!)\nStretch and extending, for flexin is impending\nIt's not mind-bending or refrain to keep remembering (HMMM!)\nCuz everybody's people gonna doubt, or believe (WOO!)\nWe dispense necessity, to shout and receive\n\n[Hook]\nKeep it movin' along\n\n[Verse 2: Milo]\nPeople in the party, are you really feelin?\nWe ain't seein eye-to-eye so you ain't really seein (SEE!)\nI be hippin all type of niggas, sayin fuck that nigga Blow\nWhen they see me in the party, they better act like they know\nYO, we connectin dots that makes spots hot\nUhh, to the beat'cha (Y'ALL!), ah ya don't stop (STOP!)\nNotice, how many groups can formulate then lose focus\nWith a lot of hocus pocus, concepts that sound bogus\nI'm seein the world and all its different kind of poses (WOO!)\nCrush you like roaches, that's keepin the crowd movin (HAA!)\nMr and the dancers, who said \"Culture consumin?\"\nNever face, he ????? ????? and strength\nCos I can terminate, like a dirty hypodermic needle\nMy vision's clearer than the sights on an eagle\nStop them bustin high, bring the head back to my table\nDon't front, circle circle, dot dot, you catch your speed, not\nFeel that, cos this type of vibe sounds done\n(Far from the...., to the doe-run-run-run to the doe-run-run)\n(YES!) Yes to the beat-boys and your ass accepted\nExclusive, L-O-N-S bringin the ruckus, wild aggressive\n\n[Hook]\nKeep it movin' along, keep it movin' along\nKeep it movin', keep it movin', keep it movin'\nKeep it movin' along, keep it movin' along\n\n[Verse 3: Charlie Brown]\nNow don't get me wrong, CHILL!!!\nLet me out, no question, no doubt\n????? god is a drought\nI've come to wet the party like a tropical depression\n????? mixed with scherm for this musical session\n(STOP!) stressin, testin, second-guessin, who's 'fessin?\nLife is a lesson in disguise like a blessin\nClick in , kickin, better back up chicken\nStickin' stunts, cause I keep it real, front Brown! (BROWN!)\nCos I'm like a ???? hands therapeutic\nMeasurements, square, feet, and cubic\nWe're all makin pennies off a record, so who needs the paper? (WHO?)\nThe man in Manhatten lampin in the skyscrapers\nHow much can a nigga take before he break fool?\nI tell ya cool, with the New School\nAnd the tool to examine my unorthodox pattern\nFrom Mercury, Venus, Earth, Mars, Jupiter and Saturn\nAnd don't forget Uranus, Neptune and Pluto\nFlow deeper than the lava inside a volcano, bro\n(Never snitch, never dominate\nI'll be wild, smokin drowsy)\nFuckin up my economics, is it rather ironic\nSippin gin, juice and tonic\nLike Shawn Kemp with some hemp, super sound and sonic\nBaby, above your head, below your feet and it still wimp\nC-Boogie Brown, my shit is brilliant\n\n[Verse 4: Busta Rhymes]\nYah yah, yah (AHH!)\nMy shit be so gigantic\nAnd I'mma take 4 steps and cross the whole Titanic\nBetter believe I (KEEP!) movin (OVER!) people's heads\nYou know my crew for bringin' it full-fledged\nBringin it back like a fresh out the box, pair of Pro-Keds 69ers\n(LEADERS OF THE NEW!) I'm the house so open up your blinders\nYo, I be the Moses takin poses\nWith a rhyme flow so beautiful like a large bouquet of roses\n(Keep it movin' along, keep it movin' along\nKeep it movin' (get busy, baby), keep it movin')\nKeep it movin' now\nNo need to try to stop it, we gon' wreck shit anyhow\nYo, limitations is somethin I never will allow\nWhen we bake the cake, I be that nigga that brings the icing\nDisregard your whole identity and revoke your driver's licence\nYou know I blast in your ass real fast\nGot your bladder burning, desperate for a bathroom pass\nMonumental, like a Busta Rhymes statue made of brass (c'mon) Hypnotise the mass\nShit so hot, better jump in the water, nigga (SPLASH!)\nBreakin through the party like a fuckin' Sound clash\nSplit the Philly down the back and mix the weed with more hash\nI will wash away your pain like Draino\nErupting like the angriest volcano, or the wickedest whirlwind and tornado\nWe stay up in the streets, cruisin, me and my whole crew, gotta.......\n\n[Hook:]\n\nKeep it movin' along\nKeep it movin', keep it movin', keep it movin'\nKeep it movin' along, keep it movin' along\nKeep it movin', keep it movin', keep it movin', keep it movin'\nKeep it movin' along, keep it movin' along\nKeep it movin', keep it movin', keep it movin', keep it movin'\nKeep it movin' along, keep it movin' along\nKeep it movin'\n\n[Outro:]\n\nThis one goes out\nTo the three brothers that I love the most, in memory of this song\nMy man Ratto, my man Big Joe, my nigga Love\nThem niggas rest, most comfortable\nPeace, L-O-N-S, forever", "image": "https://images.genius.com/e8769bd52f12b0c4930edbc0a93c9cca.1000x973x1.jpg"}], "artist": "Busta Rhymes"}