{"songs": [{"title": "Twilight Zone", "album": "Fahrenheit 1/15, Part I: The Truth Is Among Us", "year": null, "lyrics": "[Talking]\nUh, uh, uh, uh, 1-5 who's more crooked than One-Time?\nSay 1-5 who's more crooked than One-Time?\nYeah, yeah check is my mic on? As I twilight zone?\n\n[Pre-verse]\nMy mindstate rewinds wakes\nAnd fast-forwards bullets makin'a B-line for my face\nMy mindstate\nMy mindstate\n\nMy mindstate rewinds wakes\nAnd fast-forwards bullets makin'a B-line for my face\n\n1-5 who's more crooked than One-Time?\nSay 1-5 who's more crooked than One-Time?\nCheck it, is my mic on, as I twilight zone?\n\n[Verse:]\nMy mindstate rewinds wakes\nAnd fast-forwards bullets makin'a B-line for my face\nThen they stop like Neo\nLaugh at me throw some cash at me then fly pass me\nBut one ricochets off the wall to come back and ask me\nAm I scared of him or the \"nigga that blast me\"\nOr maybe just the hammer that goes to be a hole in an innocent bystander\nMy eye's a camera my ear's a microphone\nMy mind is Pro Tools my head is a stool\nWhats recorded in my dome gets reported when I zone\nMy mouth is a speaker I'm anchoring the misery\nThere's no friends the enemy of my enemy is my enemy\nBeakers and test tubes full of memories\nIn my labatory I create stories\nDoze off then wake up surrounded by Forties\nWit Glocks tucked in they labels\nAnd they caps is baseball hats\nPlayin poker at a table\nCigarettes massage they shoulders in belly tops showin off they navels\nA dime sack side bets, a tech is runnin' for president\nJesus pieces walk around with niggas hangin' from they necks\nMonopoly is playin' chess\nI just picked up an obituary of a bullet proof vest\nPut the headphone on my mouth speak into my ears\nYea microphone check, check, check, check, check\nCheck, a pair of Air Forces told me Rims've been extinct for years\nBeen ethnic cleansed by Jersey's tryna take over the set\nAnd Television is on deathrow for killing BET and MTV over a dice game\nAnd paralyizing CNN by knifing him in the neck\nI hear Clear Channel's been fightin' him in the rec\nWho's in for givin' grape Kool-Aid laced with strychnine to mixtapes and arm robbin' cassettes\nDope told me Weed was a crack fiend but Crack told me that Dope was a base head\nHi-hats told police he was just a soldier he did what the Bass said\nThe Snare and the Kick didn't make it out alive\nThe Sample made it out with some money but he died in the ride\nThe 808 got caught wit some work (He ain't never comin' home)\nSo the MPC's and the MP3's is fightin over his turf\nSean Don just gave birth\nBut she's thinkin' bout leavin it on the doorstep of a church\nCristal can't have kids she plottin' to kidnap it that she orchestrated with a purse\nBut Gucci told Fendi and Fendi turned and around and told Henny\nAnd Henny is Moets baby's father\nBut she tried it anyway disguised as a nurse\nIn the newspapers it says \"Hip-Hop called Rock n Roll racist\"\nThe Six ripped the Five and the Maybach taped it\nA Hundred dollar bill just signed a record deal\nBut he blew all his money on the Braceletes\nAnd givin' the Gold Dollar a face lift\nA Button Up just drove by in a 6-4 Impalla\nAll the Rolex's is hatin' you see the smirks on they faces\nThe Havatampas is defending the Dutchess they keep catchin cases\nBut the judge is a Swisha he just give em iBonds and community service with the Papers\nSo the Newport's is gettin mad at the ZigZags then out come the razors\nSee the Kool's is killers on the creep\nRush up on the Philly, leave his guts spillin on the street\nSome Gold Grills burned down the building of some teeth\nSome Sharpened Tooth Brushes is holding the trampoline cuz some children finna to leap\nI just seen Rocawear rock Sean John to sleep with the same heat that Baby Phat carried\nSprint is pimpin Nextel she just gave head to a Black Berry\nI heard she go two-ways\nBut he was skeetin on her face as it was beepin on my waist\nThis is the mind of Lupe\nJust make sure my mic's on when I Twilight Zone, Zone, Zone, Zone", "image": "https://images.genius.com/9922f7078ce1f910a0541c33e13cce5b.500x500x1.png"}], "artist": "Lupe Fiasco"}