{"songs": [{"title": "Touch the Sky (Live at Abbey Road Studios)", "album": "Late Orchestration", "year": "2006-04-24", "lyrics": "[Chorus: Kanye West]\nHo! I gotta testify\nCome up in the spot lookin' extra fly\n'Fore the day I die, I'ma touch the sky\nI gotta testify\nCome up in the spot lookin' extra fly\n'Fore the day I die, I'ma touch the sky\n\n[Verse 1: Kanye West]\nBack when they thought pink Polos would hurt the Roc\nBefore Cam got the shit to pop\nThe doors was closed\nI felt like Bad Boy's street team: I couldn't work the locks\nNow let's go, take 'em back to the plan\nMe and my momma hopped in that U-Haul van\nAny pessimists, I ain't talk to them\nPlus I ain't have no phone in my apart-a-ment, uh\nLet's take 'em back to the club\nLeast about an hour I stand on line\nI just wanted to dance, I went to Jacob an hour\nAfter I got my advance, I just wanted to shine\nJay favorite line: \"Dawg, in due time!\"\nNow he look at me, like, \"Damn, dawg! You where I am!\"\nA hip-hop legend\nI think I died in that accident, ‘cause this must be Heaven\n\n[Chorus: Kanye West]\nUh, I gotta testify\nCome up in the spot lookin' extra fly\n'Fore the day I die, I'ma touch the sky\nOh! We gotta testify\nCome up in the spot lookin' extra fly\n'Fore the day we die, we gon' touch the sky\n\n[Post-Chorus: Kanye West]\nNow let's take 'em high\n(Top of the world, baby, top-top of the world!)\nEverybody take 'em high\n(Top of the world, baby, top-top of the world!)\nNow let's take 'em high\n(Top of the world, baby, top-top of the world!)\nNow let's take 'em high\n(Top of the world, baby, top-top of the world!)\n\n[Verse 2: Kanye West]\nBack when Gucci was the shit to rock\nBack when Slick Rick got the shit to pop\nI'd do anything to say I got it\nDamn, them new loafers hurt my pocket\nBefore anybody wanted K. West beats\nMe and my girl split the buffet at KFC\nDog, I was havin' nervous breakdowns\nLike, \"Man, these niggas that much better than me?\"\nBaby, I'm goin' on an aeroplane\nAnd I don't know if I'll be back again\nSure enough, I sent the plane tickets\nBut when she came to kick it, things became different\nGirl I cheated on, sheets I skeeted on\nCouldn't keep it at home, thought I needed a Nia Long\nI'm tryin' to right my wrongs\nBut it's funny them same wrongs helped me write this song\n\n[Chorus: Kanye West]\nNow, I gotta testify\nCome up in the spot lookin' extra fly\nYeah, 'fore the day you die, you gon' touch the sky\nYou gon' touch the sky, baby girl, testify\nCome up in the spot lookin' extra fly\n'Fore the day you die, Lupe, touch the sky\nUh, uh, uh\n\n[Verse 3: Lupe Fiasco & Kanye West]\nYes, yes, yes, guess who's on third?\nLupe steal like Lupin the 3rd (Uh-huh)\nHere like ear 'til I'm beer on the curb (Yeah)\nPeachfuzz buzz but beard on the verge\nLet's slow it down like we're on the syrup\nBottle-shaped body like Mrs. Butterworth (Uh)\nBut, before you say another word\nI'm back on the block like I'm layin' on the street\nI'm tryna stop lyin' like I'm Mumm-Ra\nBut I'm not lyin' when I'm layin' on the beat, en garde\nOr touché, Lupe cool as the unthawed\nBut I still feel possessed as a gun charge (Yeah)\nTo come as correct as a porn star\nIn a fresh pair steps in my best foreign car\nSo, I represent the first\nNow let me end my verse right where the horns are, like uh\n\n[Chorus: Lupe Fiasco & Kanye West]\nYou gotta testify\nCome up in the spot lookin' extra fly (C'mon, c'mon, c'mon)\n'Fore the day you die (What?), you gon' touch the sky\nYou gon' touch the sky, baby girl\nCome up in the spot lookin' extra fly (What? What? What?)\nYeah, 'til the day you die, you gon' touch the sky\n\n[Post-Chorus: Both, Kanye West & Lupe Fiasco]\nNow everybody throw your hands up\nUh, I'm sky high, say I'm, I'm sky high\nI'm, I'm sky high, I'm, I'm sky high\n(Everybody throw your hands up)\nI'm, I'm sky high, I'm, I'm sky high\nSky, uh, sky high, I'm, I'm sky high\n\n[Outro: Kanye West & Lupe Fiasco]\nWe back at home, baby! Yeah\nWe back at home? Yeah, yeah\nMake some noise for Lupe Fiasco right quick, yeah\nFeels good to be home\nFeels good to be home\nFeels good to be home\nFeels good to be home\nChi-town\nFeels good to be home\nYeah, woo!", "image": "https://images.genius.com/664fe2cf167d887dd94ca2859078fb37.640x640x1.jpg"}], "artist": "Kanye West"}