{"songs": [{"title": "Real Hip-Hop - Part II", "album": "I Got Next", "year": "1997-05-20", "lyrics": "[KRS-One]\nHah!  They not ready, uhh uhh\nSet it off, South Bronx\nSet it off, uhh, check it\n\nThe real hip-hop, is over here\nThe real hip-hop, is over there\nThe real hip-hop, is over here\nThe real hip-hop, is over there\n\nIt's a demo, it's a demo, it's a demo, it's a demo\nSteppin out the limo, KRS-One, gettin in you\nFrom the get-go kiddo throw em out the window\nFlip em like a nickel\nPeep the hottest single\nHe'll sink them like the S.S. Minnow\nThat same kid that rocks the Benz rocks the Pinto\nWatch my signal, I rock the rap game like Nintendo\nHey diddle, diddle, get played now like a fiddle\nI watch you wiggle, in front of the audience that was fickle\nNow you can't make a nickle, the sour pickle you are\nKRS-One, ninety-seven superstar\nI got one thing to say and let me make this clear\nEverywhere, now throw your hands in the air\n\nThe real hip-hop, is over here\nThe real hip-hop, is over there\nThe real hip-hop, is over here\nThe real hip-hop, throw your hands in the air!\n\n[Mic Vandalz]\nYo, been rockin rooftops, knahmsayin?\nInternat', yaknahmsayin?\nKRS, vandalizin, yaknahmsayin?  With the Mic Vandalz\nBoogie Down, Uptown, yaknahmsayin?\nIt's dope, check it out\n\n[KRS-One]\nWhen I ain't doin a show, or bringin all the money in\nOr at the studio, or home studyin\nI'm checkin out Funkmaster Flex on cassette\nAs he wrecks turntable sets with many subjects\nHuff now that's the Blastmaster connects, the larynx\nTo a high-tech mic set, you get what you get\nTech and Sway, index of singles is complex\nOn Technics sets, he wrecks, collects a fee next\nWhile you rejects practice, suffix and prefix\nHip-Hop I reads it, and mark your album incompleted\nI seen it, saw it, back in eighty-five\nPlatinum rappers yo that can't rock live\nTheir mental facilities, lack the ability\nFor lyric agility -- battle?  You're killin me\n\nThe real hip-hop, is over here\nThe real hip-hop, is over there\nThe real hip-hop, is over here\nThe real hip-hop, throw your hands in the air!\nThe real hip-hop, is over there\nThe real hip-hop, is it over here?\nThe real hip-hop, yo it's over there\nThe real hip.. now throw your hands in the air!\n\n[Mic Vandalz]\nThrow your hands in the air (get loose now)\nThrow your hands in the air (get loose now)\nThrow your hands in the air (get loose now)\n\nAiyyo I'm breakin, in this rap thing, I've been waitin\nReady for the world, rude like awakening\nHomo sapien, ? ? rock every stadium\nScholars and players, here to Las Vegas\nEmbrace the papers, land of money makers\nBrothers hate us cause the brothers ain't us\n\nYo yo, from coast to coast I'mma overdose you and BDP you\nAnd Kris-Kross your mind, wouldn't wanna be you\nA Uptown thing, world premier\nThrow your hands in the air baby it's on\nHow many MC's wanna get they rep torn?\nFrom Joe to Cage and mics in my juvenile days, I abuse\nThe mic get lifted, the crowd gets amused\n\nI got next.. you lose!", "image": "https://images.genius.com/2d8a06de1f39a224dcb05e3e9195e0b4.640x640x1.jpg"}], "artist": "KRS-One"}