{"songs": [{"title": "Protect Ya Neck II the Zoo", "album": "Return to the 36 Chambers: The Dirty Version", "year": "1995-03-28", "lyrics": "[Intro: Ol' Dirty Bastard]\nSee let a nigga come through with that bullshit\nAny time you pop that shit nigga\nI'ma tell you you can suck a dick, you can suck a pussy\nI know, it'll come to what? Say what?\nNow I'ma let all you motherfuckers know\nSee them knows that this is something you can't fuck\nWhether you from Brooklyn, whether you from Manhattan\nYou from Queens nigga\nI don't give a fuck, where you be motherfucker!\nWhere you reside... motherfucker!\nHow you live? How you seeeeeeee\n\n[Ol' Dirty Bastard]\nSort the stack outs, this one's the blackout\nThree-fifty-seven to your mouth, blaow!!\n\n[Buddha Monk - Brooklyn Zu]\nDirty, can you hear me? Rawness I’m inflicting\nIt's that G type slang that makes this real sickening\nIgnite the styles, I got my hand upon the trigger\nStarts from the smallest and hits the bigger nigga\n\n[Prodigal Sunn - Sunz of Man]\nYo, straight out the lava by them hell fires\nA known mental killer, born thriller, assassin of terror\nA hot bloody fatal mixture of carbon and water\nHomicidal manslaughter, death is the order\nStart the mission, travel like the speed of wind\nThrough the valley of sin, I step to ville and murdered many men\nServing justice in my vicinity\n\n[Zu Keeper - Brooklyn Zu]\n(This is, Brooklyn, Zu!!)\nZa-za-za, za-za-za\nZuh-za-zah, z-zz-zz-z-z-zz-zz-z-dah-duh-dnn-duh\n\n[Murdoc - Brooklyn Zu]\nI get down, I get down, I crack your fucking crown\nLay around and watch some real niggas break ground\nI can't shop cause every bro blowing up the spot\nHit rocks and niggas know\n\n[Killah Priest - Sunz of Man]\nYo! Niggas grab the mic like the bites of a scorpion\nNervous, that's why the Zu brought me in\nNow bring em forth, like the tortures at the courts\nBefore the case begin, first break me in\nHis brain! And make sure he can't maintain the calmness\nYa harmless, watch how I bomb this\nStage light now appears to be the Moon\nNow your Posse is your fucking Platoon\nStale sound just flows through the air\nI'm like a ninja, once I send ya cold stares\nThen I get furious, imperious, the lyricist with the clearest rhyme\nErupt to deduct your fucking mind\n\n[12 O'Clock - Brooklyn Zu]\nFuck shit up on the hurry-up\nKnown for burying ducks through more styles than a monk\nWarning you chump, brain is out for lunch\nGiven the power punch, soon to be paid like Donald Trump\nNever fall victim to no bitch\nJerked my dick, but still got more hoes than a pimp\nAnd score more points than Shawn Kemp\nKeeping powerfully strong like the center on the Knicks\n\nHut one, hut two, hut three, hut!!\nOl Dirty Bastard live and uncut\n\n(Shame on a nigga who tried to run game on a...)\n\n[Shorty Shit Stain - Brooklyn Zu]\nGot more props than the President\nMy hardcore represent\nBlowing niggas back who never had this\nCause I'm gifted, so you can gift wrap the shit\nI'm kicking and send it to your moms for Christmas\nAnd tell her Shorty Shit Stain sent it\nSoon to have more green than the Jolly Green Giant\nCause niggas rap styles just down, it's expired\nYou should've stayed home instead of picking up a microphone\nBut if you wanna run on up, like you tough\nI call your bluff and blow you down with my hardcore stuff\nI shine like twenty-four carat, niggas know...\n\n[Ol' Dirty Bastard]\nRoll and stroll with the party scene\nNigga wanna know me as Mr. Clean\nWza-wza-wza-wza-Wu-Tang, flip the script and\nTest my skill niggas, you're tripping\nDrugged up from sniffing, you're the one who's riffing\nI'm not Opie, save that old shit for Andy Griffith\nStart to flip, slip cause you're slipping\nWhile you sleep I be the God on point, with Scottie Pippen\nAs I jump on stage, flip rip a show\nStrip and rip a ho, wayyy like Bo\nJackson while I'm still taxing maxing\nRelaxing sitting back, silly attraction\nAgain and again when I rock the jam\nWanna see em up in the air, throw up your hand\nIntroducing one-man band in town\nIt's wild, more the style couldn't stand nigga\nWhen the jump stepped to the center\nOf the rhyme inventor, MCs' tormentor\nYou get dap slapped, across the MC map\nYour ass that's your ass on a whore shot\nCome on through I black and blue your whole crew\nThen I get Rudy with the Hong Kong Phoo'\nOl Dirty Bastard, MC killer\nMoney maker, Brooklyn, Shaolin style\nThat I lay down like tile, then I get higher\n\n[60 Second Assassin - Sunz of Man]\nHere comes the illlll, type ruffer\nStyle be untouched I'm leavin broken down grammars on the pen\nWho who what? What brings it? Tighter than your anus\nChambers this name is for the deepest trainers\nKeep it stainless, steel, on time it is the windmill\nDeadly venom kills, at the last of the Sam's Mill\n60 Second, nucleus, attack on your set\nHit you with the blast (yo close the door)\nShabazz!!\n*gun blast*", "image": "https://images.genius.com/7985ae9f777e769efe184aff8b763e1c.1000x1000x1.jpg"}], "artist": "Ol’ Dirty Bastard"}