{"songs": [{"title": "Spittin’ in the Whip", "album": null, "year": "2009-01-29", "lyrics": "[Verse 1]\nFuck, watch how I kill 'em with the funky rhythm\nI'll bomb if you don't feel 'em, piranhas in 'em\nFeed my persona as I get deep as Nostradamus\nNo stallin' like the [inaudible], nuh-uh, [inaudible]\nI'm ballin', cut up your pajamas if you're sleepin' on me\nNo promise, no peekin', homie\nYou're tryin' to confiscate the flow, I know\nSo I switch it quicker than my bitches\nIf they want your attention\nOne thing for sure, they gon' get it\nI'm cursed with the world's negatives\nProbably thinkin' I'm hurt, but that's the only way I can live\nWar, money, cash, drugs, got me feelin' like AIDS\nWalkin' inside the club\nPaid in full, it more be like [inaudible]\n.38 snub huggin' my waist like it had arms\nThen I bear it, so I guess it really does\nNo paperwork on this marriage\nHe love when life [inaudible] better than life\n\n[Verse 2: Kendrick Lamar]\nDrunk off Paul, nigga, pourin' by the Rover, bitches\nPourin' hollows over haters, we killin' insecure niggas\nFeelin' like the old Jigga, old Nas, old Big, new 'Pac\nOh my God, he's alive, he dropped bombs on you intellects\nBombin' everythin' from the streets to the Internet\nHear the instrumental wet\nThen I'm a bust a nut, yep, I'm a fuckin' nut\nThat is not an Escalade, that's a damn armored truck\nShoot who? Shot what?\nYou ain't popped shit but some bubblegum and a bump\nWho you motherfuckers want?\nLeave a motherfucker slumped from the fuckin' pump\nHe's a peanut to an elephant, put that nigga in a trunk\nMight be out in Houston, lean in my pimp cup\nRide in '84s, throwed like a shot put\nHoes on my jock like I'm from the ATL\nIn our new block, choppers on the rooftop\nFlip a nigga like he was a NBA mascot\nStrip a nigga from his Wade cap to his two socks\nGot it from them Compton blocks\nRaised from my grandpa's\nEvery day, caught a fade like we like we own the barber shop\nGoons in the parkin' lot\nWho are you to fool if you bark a lot with no bite like an iguana\nGet killed right in front of your momma\nHold tight, coroner comin'\nSummertime, perfect time for dove huntin'\nAnd you a woman want to be at my house with her ass out\nShe climaxed and passed out\nAnd promotional flyers, K-Dot be the flyest\nEat ten rappers a day, that's a hell of a diet\nStraight up like a kangaroo\nPumpin' like a fist do from a pro-black\nThis is automatic rap, made a minute, take a second\nI'm a get it maybe here for a minute when I'm finished\nLet's begin it", "image": "https://images.rapgenius.com/e4e53b7f03232ca6164f65a599807578.1000x1000x1.jpg"}], "artist": "Kendrick Lamar"}