{"songs": [{"title": "Where You At? (The Whole City Behind Us)", "album": "Freshmen Adjustment Vol. 3", "year": null, "lyrics": "[Verse 1: Kanye West]\nYeah, yeah - I used to front when I write songs\nTalk about havin ice on, and I could barely keep my lights on\nAnd my beats was so sick, I shoulda got a medic\nBut my credit was so pathetic I couldn't afford a debit\nWhen The Dropout dropped, I had to cop me a money tree\nTo front on anybody who ever tried to front on me\nWith so much personality, what do you want from me?\nI could be by myself and enjoy the company\nMy life, this year, my career, is the Lord\nBad chick, this award, is for Melyssa Ford\n'94 I could only afford this Accord\nFrom the home of gangbangin and we all outdoors\nSouthside, outside, Westside, let's ride\nEastside, right B-Side, Lakeshore Drive\nAnd I'm (and I'm) Chi-Town's finest\nWhere you at? The whole city behind us\n\n[Hook: Kanye West]\nWhere you at? The whole city behind us\nWhere you at? The whole city behind us\nSouthside, outside, Westside, let's ride\nWhere you at? The whole city behind us\n\n[Verse 2: Ludacris]\nIt ain't nuttin to it but to do it! I came here\nTo shut the place down 'til my body stops pumpin red fluid\nA-Town I've been through it! And we steady gettin tested\nBut ready to fill your bubble when we put the lead to it\nOut West they still bangin, up top it's really gully\nDown South we get buck and turn hearts to Silly Putty\nLudacris I got silly money - you got jokes?\nI'll be laughin all the way to the bank - now that's really funny!\nBig city bright lights - and many pity cause we like fights\nMay be long days but it's fright nights\nLiving out the night life - and people asking 'Where You At?'\nNot the club; I stay in the get right!\nHotlanta home of the booties and the really tight skirts\nWhere if somebody moves then somebody gets hurt!\nFrom Decatur down to CP, and EP\nAdamsville to the battlefield it's D.T.P\n\n[Hook]\n\n[Verse 3: The-Game]\nIt's Compton's prodigy\nObviously I'm from the home of hydraulics\nWhere they tie bandanas around the steerin column\nOf Impalas in to get holla\nWe fightin pitbulls and Rottweilers\nIn the projects the objective is make dollars\n'Where You At?' It ain't a problem to get it there by tomorrow\nCause I got a female friend, with frequent flier mileage\nI ain't never been to college, got the IQ of a Rhodes Scholar\nIf you follow G-Unit throw up your dubs and yell holla\nTo all the Y.G.s in khakis and white tees\nWith And 1's in every color like Ice-T\nI might be the city of Compton's right knee\nThe way I paint pictures with these hip-hop scriptures\nPay attention while The Game shine like a prism\nGlisten, show you how canaries can alter one's vision\nNot to mention I am Dr. Dre christened on behalf\nOf Luda and Kanyeezy, I'm gon' breathe easy\n\n[Hook] - repeat 2X", "image": "https://images.genius.com/e00085bf087c8e35e4d55ae683cbbcd7.500x500x1.jpg"}], "artist": "Kanye West"}