{"songs": [{"title": "Worst Behavior", "album": "Nothing Was the Same", "year": "2013-09-24", "lyrics": "[Produced by DJ Dahi]\n\n[Verse 1]\nWorst...\nMothafucka never loved us\nFucka never loved us\nYou ain't know, now you know now\nStill at it, scrub J's with a toothbrush\nShit...\nNiggas still playing my old shit\nBut your shit is like the police askin' us questions\nNigga, we don't know shit\nFlexin'...\nNigga, I'm just flexin'\nNigga never loved us\nDo it look like we stressin'?\nLook at you, look at you and look at you\nAww, I'm glad that they chose us\n'Cause man it's a mission, tryna fight to the finish\nJust to see am I finished\n\n[Chorus]\nOn my worst behavior, no? They used to never want to hear us\nRemember? Mothafucka never loved us\nRemember? Mothafucka!\nRemember? Mothafucka never loved us\nI'm on my worst behavior! Don't you ever get it fucked up!\nMothafuckas never loved us! Man, mothafuckas never loved us\nWorst behavior! Mothafuckas never loved us\nFucka never loved us! Worst behavior\n\n[Verse 2]\nHold up, hold my phone\nMothafuckas never loved us\nFucka never loved us\nNow you want to roll one\nMothafucka never loved us\nSo everywhere we go now, full cup\nAlways hated the boy, but now the boy is the man\nMothafucka, I done growed up\nYou know me? You know me?\nI'm liable to do anything\nWhen it comes to that you owe me\nYou owe me, you owe me\nBitch, you better have my money\nWhen I come for that shit like O.D.B\n\n[Chorus]\nOn my worst behavior, no? They used to never want to hear us\nRemember? Mothafucka never loved us\nRemember? Mothafucka!\nRemember? Mothafucka never loved us\nI'm on my worst behavior! Don't you ever get it fucked up!\nMothafuckas never loved us! Man, mothafuckas never loved us\nWorst behavior! Mothafuckas never loved us\nFucka never loved us! Worst behavior\n\n[Verse 3]\nWho's hot, who not? Tell me who rock, who sell out in stores?\nYou tell me who flop, who copped the new drop, whose jewels got rocks\nWho else making rap albums, doing numbers like it's pop?\nSame old pimp, Drake, you know ain't nothin' changed\nWith these funny style niggas, we done put on in the game\nI just ask for some blessings at my grandmother's grave\nThen it's back to L.A., open the mail, starin' at the check\nEnough to make you throw up, man, it's gross what I net\nI'm with my whole set, tennis matches at the crib\nI swear I could beat Serena when she playin' with her left\nOh, where I reside it look like a resort inside\nNigga, where your shit from? I imported mine\nBar mitzvah money like my last name Mordecai\nFuck you bitch, I'm more than high\nMy momma probably hear that and be mortified\nThis ain't the son you raised who used to take the Acura\n5 a.m. then go and shoot Degrassi up on Morningside\nFor all the stuntin', I'll forever be immortalized\nYeah, back and forth across the borderline\nHate to leave the city, but I've got to do the overtime\nGone all the time, even the important times\nI should let you know ahead I'm comin' back on my worst behavior\n\n[Outro]\nRemember? Remember? Mothafucka, remember?\nHold up, hold my phone, they used to never want to hear us\nRemember? Mothafucka never loved us\nRemember? Mothafucka, remember? Worst behavior", "image": "https://images.genius.com/7f843805fe1e72b35f00f412edd24f8d.1000x1000x1.jpg"}], "artist": "Drake"}