{"songs": [{"title": "Untouchable", "album": "Revival", "year": "2017-12-08", "lyrics": "Pt. I\n\n[Intro]\nHands up, officer don’t shoot\nThen pull your pants up, promise you won't loot\nWe may never understand each other, it’s no use\nWe ain’t ever gonna grasp what each other goes through\n\n[Verse 1]\nBlack boy, black boy, we ain't gonna lie to you\nBlack boy, black boy, we don't like the sight of you\nPull up on the side of you\nWindow rolled down, 'profile'\nThen we wonder why we see this side of you\nProbably comin' from the dope house\nWe could let you slide but your tail light is blew, out\nWe know you're hidin' that Heidi Klum\nOn you another drug charge, homie, it's back inside for you\nAnd just in case a chase might ensue, we got that tried and true\nPistol drew right at you, we'd be delighted to unload it\nIn your back, then walk up and lay that taser on the side of you\nFucked up, but what the fuck am I to do?\nI keep tellin' myself, keep doin' like you're doin'\nNo matter how many lives you ruin\nIt's for the red, white and blue\nTime to go find a new one and split his head right in two\nNo one's ever indicted you\nWhy? 'Cause you're a...\n\n[Chorus: Eminem & Cheech and Chong]\nWhite boy, white boy, you're a rockstar\nMy momma talkin' to me, tryna tell me how to live\nWhite boy, white boy, in your cop car\nBut I don't listen to her, 'cause my head is like a sieve\nWhite boy, white boy, you're untouchable\nThe world's coming to an end, I don't even care\nNobody can tell me shit 'cause I'm a big rockstar\n\n[Verse 2]\nBlack boy, black boy, we don't get your culture and\nWe don't care what our government's done to fuck you over, man\nDon't tell us your attitude's a result of that\nBalderdash, where’d you get the chip on your shoulder at?\nWhy you kicking that soda can?\nPull your pants up, we 'bout to roll up and\nThrow your ass in the van cuffed\nYou don't have to know our plans or what our intentions are\nOur cards are close to our chest, you better show your hands\nAnd put our minds more at ease\nOr get shot in the thyroid, comply or die, boy\nWe're fightin' a crime war, here come the swine\nTryna clean up the streets from all these minorities\nThat's what we call 'em pigsties for\nThey're like eyesores to police\nTalk to you like just a piece of trash\nFeels like we're stuck in a time warp to me\nAs I kick these facts and get these mixed reactions\nAs this beat backspins, it's like we're drifting back in\nTo the sixties, having black skin is risky\n'Cause this keeps happening\nThroughout history, African-Americans have been treated like shit\nAnd I admit, there have been times where it's been embarrassin' to be a...\n\n[Chorus: Eminem & Cheech and Chong]\nWhite boy, white boy, you're a rockstar\nMy momma talkin' to me, tryna tell me how to live\nWhite boy, white boy, in your cop car\nBut I don't listen to her, 'cause my head is like a sieve\nWhite boy, white boy, you're untouchable\nThe world's coming to an end, I don't even care\nNobody can tell me shit 'cause I'm a big rockstar\n\nPt. II\n\n[Verse 3]\nSeems like the average lifespan of a white man\nIs more than twice than a black life span\nI wonder sometimes if it has a price scanner\nI feel like checking out on life, can't escape this circumstance\nI'd rather hear 'em say \"Die N-word\" than Die Antwoord\nNinja, now it's better disguised banter\nBut that's life, strapped 'cause we're strapped financially\nAnd can't find answers\nWe're applying, but McDonald's\nSeems to be the only franchise that'll hire\nSo how can we have higher standards?\nAs Dallas overshadows the battle for Black Lives Matter\nWe fight back with violence but acts like that are\nBlack eyes on the movement\nWhich makes black lives madder\nAt cops and cops madder\nThat's why it's at a stalemate\nAnd can't arrive at a compromise so it's Black Ops\nI wonder if we hire more black cops, the crap stops\nThe block is our backyards, officers, not the crack spot\nCall the attack dogs off of us, man\nYou always act all pissed off at us at a traffic stop\nAnd bad cops fuck it up for the good cops, and man, stop\nSendin' white cops in the black neighborhoods\nWho ain't acclimated to 'em, like that's the way to do it\nWho seen some fuckin' videos of rappers waving guns\nAnd know nobody black so they act afraid of us\nAnd that's racism, the fear that a black face gives 'em\nA subconscious racist\nWait, why are there black neighborhoods?\n'Cause America segregated us, designated us to an area\nSeparated us, Section-Eight'd us\nWhen we tear it up’s the only time attention’s paid to us\nAnd education sucks, and every day's another\nFreddie Gray for us, a levy breaks or fuzz\nWhy is it they treat us like dryer lint?\nWe just want a safe environment for our kids\nBut can’t escape the sirens\nDon’t take a scientist to see our violent nature lies in\nThe poverty that we face so the crime rate’s the highest in\nThe lowest classes, it's like a razor wire fence\nAnd we’re trapped in these racial biases\nThat plague our society which makes our anxiety levels raise\nEvery time we see a devil’s face\nLions, tigers, and bears, oh my\nIt's more like billy clubs and gats\nAnd we really love it when you think we’re guilty ‘cause we’re black\n\"But you kill each other, facts\nYou peel each other's caps, for silly stuff like hats”\nSingle mother strugglin’ through substance abuse\nWhile people with nothin' to lose shoot each other for shoes\nFuck your Republican views\nPull ourselves up by our bootstraps, where the fuck are the boots?\nAnd streets act as a narrator, don't gotta read comics\nOr be that into characters, just to see that, just to be black\nYou better be strapped with a derringer\nOr be “capped in America” like Steve Rogers\n'Cause no one oversees these cops and\nAll we see is 'em beat charges\nWe done seen 'em beat Rodney King unconscious, and got off\nSo we don't need all you crooked police officers' peace offerings\nJust keep marchin', 'til we reach congress\nBut they're gonna say you're tryin' to take an irrational stance\nIf you try to slander the flag but\nSomebody has to be the sacrificial lamb\nSo they call it a Kaepernick tantrum\nIf you don't stand for the national anthem\nWe raise it, you better praise it\nOr you'll be made to feel like a traitor, we'll\nTreat you like Rodney Dangerfield\nHome of the brave is still racist 'ville\nSo this whole nation feels like a plantation field\nIn a country that claims that its foundation was based on United States ideals\nThat had its Natives killed\nGot you singin' this star-spangled spiel\nTo a piece of cloth that represents the \"Land of the Free\" that made people slaves to build", "image": "https://images.genius.com/edd76153e7ac3ec36be997aea55f32ed.1000x1000x1.png"}], "artist": "Eminem"}