{"songs": [{"title": "Stanky Leg (Freestyle)", "album": null, "year": null, "lyrics": "[Intro: Wiz Khalifa]\nOkay!\nIt's ya boy\nHahaha\nYoung Wiz Khalifa\nWhat up dallas texas\nHouston!\nATL What's smackin'\nMIA yo! Yeah! Hahaha\nI don't do the stanky leg and all that you know what I'm sayin?\nI got a lil' flavor though\nWatch me\nYeah, yeah, yeah\n\n[Verse 1: Wiz Khalifa]\nI never give 'em room keys hoes meet me in the lobby\nAnd bring a set of friends for the niggas that's around me\nBroad from Atlanta\nMy weed came from cali\nBoss of my city on my team I'm a captain\nAll you see is action\nDon't get it smackin' and don't compare us\nMy flow will put faith in you like a prayer does\nI be tryin' shit make it seem fair but as soon as I get ready for my check I yell cut!\nCut ya girl\nCut a song\nAnd my swag is opposite of yours, cut it off\nBeen a minute since I quit writin' in my phone cause I got too many broads tryin' call\nAnd I don't own down time so I don't pick up\nThey wait until they see me at the club or at the mall\nTo run up with their friends wantin' pictures with us all\nI could tell you how it feels to own a team, you just ball\nDog\nSo how could you say you do you when I show up stuntin' making Lauren London - New new\nMy team go out you in the zoo crew\nBlunt stuffed like a new shoe\nAnd my down south girl\nDo da stanky leg\nA nigga at the store look like he makin eggs\nGot a whole loaf so I be breakin' bread\nAnd gettin' so ill the doctor got me takin meds\nKush IV's\nI drink till I think I'm 'bout to throw up\nThen the nurse bring another bottle to pour up\nTold me I'm livin' fast but how do you slow up\nWhen you never learn to use brakes\nHold up\nEveryday I'm in a new state and niggas hate but I can turn that beef to cube steak\nGet a huge plate\nSit 'em down at the table and say grace\nAnd stuff my face\n\n[Outro: Wiz Khalifa]\nHahahaa im jus havin fun on you niggas man\n08 was great but 09 is mine\nOkay! Dumb bitch", "image": "https://images.genius.com/2ba15f623d81eda09cdc07f50dde02ad.400x400x1.jpg"}], "artist": "Wiz Khalifa"}