{"songs": [{"title": "Proteck Ya Neck II The Zoo", "album": null, "year": null, "lyrics": "[Ol Dirty Bastard]\n\nSee let a nigga come through with that bullshit\nAnytime you pop that shit nigga\nI'ma tell you you can suck a dick, you can suck a pussy\nI know, it'll come to what? Say what?\nNow I'ma let all you motherfuckers know\nSee them knows that this is something you can't fuck\nWhether you from Brooklyn, whether you from Manhattan\nAlways\nYou from Queens nigga, I don't give a fuck, where you be motherfucker!\nWhere you reside... motherfucker! How you live? How you seeeeeeee...\n\nSort the stack outs, this one's the blackout\nThree-fifty-seven to your mouth, blaaow!!\n\n[Buddah Monk - Brooklyn Zu]\n\nDunn can you hear me? Raw is how I'm inflicting this\nIt's that G type slang that makes this real sickening\nIgnite my styles I got my hand pon the trigger\nStarts from the smallest and hits the bigger nigga\n\n[Prodigal Sunn - Sunz of Man]\n\nYo, straight actin live about them hellfires\nA known mental killer, or thriller, assassin of terror\nThe hot bloody fatal mixture of carbonate water\nHomicidal manslaughter, death is the order start the mission\nTravel like the speed of wind\nThrough the valley of sin, I step to ville and murdered many man\nServing justice in my vicinity\n\n[Zu Keeper - Brooklyn Zu]\n\n(This is, Brooklyn, Zu!!)\nZa-za-za, za-za-za\nZuh-za-zah, z-zz-zz-z-z-zz-zz-z-dah-duh-dnn-duh\n\n[Murdoc - Brooklyn Zu]\n\nI get down I get down I crack your fuckin crown\nLay around and watch some real niggas break ground\nI can't shop cuz every bro blowin up the spot\nHit rocks and niggas know\n\n[Killah Priest - Sunz of Man]\n\nYo! Niggas grab the mic like the bites of a scorpion\nNervous, that's why the Zoo brought me in\nNow bring em forth, like the tortures at the courts\nBefore the case begin, first break me in\nHis brain! And make sure he can't maintain the calmness\nYa harmless, watch how I bomb this\nStage like, mail, pre hands that be the move\nNow your Posse is your fuckin Platoon\nStale cells, just flows through the air\nI'm like a ninja, once I send ya down stairs\nThen I get furious, imperious, the lyricist\nWith the cleverest rhyme\nErupt to deduct your fuckin mind\n\n[12 O'Clock - Brooklyn Zu]\n\nFuck shit up on the hurry-up\nKnown for burying ducks through more styles than a muck\nWarning you chump, brain is out for lunch\nGiven the power punch, soon to be paid like Donald Trump\nNever fall victim to no bitch\nJerked my dick, but still got more hoes than a pimp\nAnd score more points than Shawn Kemp\nKeepin powerfully strong like the center on the Knicks\nHut one, hut two, hut three, hut!!\nOl Dirty Bastard live and uncut\n\n(Shame on a nigga who tried to run game on a...)\n\n[Shorty Shit Stain - Brooklyn Zu]\n\nGot more props than the President\nMy hardcore represent, blowin niggas back who never had this\nCause I'm gifted, so you can get wrapped\nThe shit I'm kickin, send it to your MOMS for Christmas\nAnd tell her Shorty Shit Stain sent it\nSoon to have more green than the Jolly Green Giant\nCuz niggas rap styles just down is aspired\nYou shoulda stayed HOME instead of picking up a microphone\nBut if you wanna run on up, like you TOUGH\nI call your bluff, and blow you down with my hardcore\nStuff, I shine like twenty-four carat\n\n[Ol' Dirty Bastard]\n\nRoll and stroll with the party scene\nNigga wanna know me as Mr. Clean\nWza-wza-wza-wza-Wu-Tang, flip the script and\nTest my skill niggas, you're trippin\nDrugged up from sniffin, you're the one who's riffin\nI'm not Opie, save that old shit for Andy Griffith\nStart to flip, slip, cuz you're slippin\nWhile you sleep I be the God on point, with Scottie Pippen\nAs I, jump on stage, flip rip a show\nStrip and rip a hoe, wayyy like Bo\nJackson while I'm still taxin maxin\nRelaxin sittin back sellin good tracks and\nAgain and again when I rock the jam\nWANNA SEE EM UP IN THE AIR! Throw up your hand\nIntroducin, one-man band in town\nIt's wild, with the style couldn't stand nigga\nWhen the jump, stepped, to the center\nOf the rhyme inventor, MC's come at the\nYou get dap slapped, across the MC map\nYour ass that's your ass, on a whore shot\nCome on through I black and blue your whole crew\nThen I get Rudy with the Hong Kong Foo\nOl Dirty Bastard, MC killer\nMoney maker, Brooklyn, challenger\nThat I lay down like towel\nThen I get higher!!\n\n[60 Second Assassin - Sunz of Man]\n\nHere comes the illlll, type ruffer\nStyle be untouched I'm leavin broken down grammars on the pen\nWho who what? What brings it? Tighter than your anus\nChambers this name is for the deepest trainers\nKeep it stainless, steel, on time it is the windmill\nDeadly venom kills, at the last of the Sam's Mill\n60 Second, nucleus, attack on your set\nHit you with the blast (yo close the door)\nShabazz!!\n*gun blast*", "image": "https://images.genius.com/d7e323c108da42ed17c2a306b8658e1d.500x335x1.jpg"}], "artist": "Ol’ Dirty Bastard"}