{"songs": [{"title": "Only Fear of Death (Izzamuzzic Remix)", "album": null, "year": "2017-01-13", "lyrics": "[Intro]\n*Gunshots*\nI got shot...\nDear...\nI always felt like I'd be shot\nAre you afraid to die?\nSomebody try to do me some harm\nOr do you wanna live forever\nBecause a lot of people don't like me\nTell me... What's wrong?\n\n[Verse 1]\nThey wanna bury me, I'm worried, I'm losin' my mind\nLook down the barrel of my 9, and my vision's blurry\nFallin' to pieces, am I guilty? I pray to the Lord\nBut he ignores me, unfortunately, ‘cause I'm guilty\nShow me a miracle, I'm hopeless\nI'm chokin' off marijuana smoke\nWith every toke it's like I'm losin' focus\nFallin' asleep while I'm in service, when will I die?\nForever paranoid and nervous, because I'm high\nDon't mention funerals, I'm stressin' and goin' nutty\nAnd reminiscin' 'bout them niggas that murdered my buddy\nI wonder: When will I be happy? Ain't nothin' funny\nFlashbacks of bustin' caps, anything for money\nWhere am I goin'? I discovered, can't nothin' save me\nMy next door neighbor's havin' convo with undercovers\nPut a surprise in the mailbox, hope she get it\nHappy birthday, bitch, you know you shouldn't have did it\nEverybody's dyin', am I next? Who can I trust?\nWill they be G's, and they look at me before they bust?\nOr will they kill me while I'm sleepin'?\nTwo to the head while I'm in bed\nLeakin' blood on my satin sheets\nIs there a heaven for a baller?\nI'm gettin' suspicious of this bitch\nThe line's busy every time I call her\nNow she's tellin' me to visit, who else is home?\nI check the house before I bone, so we all alone\nAfter I nut I hit the highway, see ya later!\nTo all the players, watch the fly way a nigga played her\nThis bitch is tellin' all her homies\nThat I can fuck her like no other\nNow them other bitches wanna bone me\nI'm under pressure, gettin' drunk, somebody help me\nI drank a fifth of Hennessy, I don't think it's healthy\nI see my enemies, they creepin', don't make me blast\nI watch the 5-0's roll, the motherfuckers pass\nBy me like they know me, smilin' as they laugh\nI put up my middle finger, then I dash\nNiggas don't like me, ‘cause I'm thuggin'\nAnd every day I'm a hustler lookin' to get paid\n\n[Intermission]\nIf I know that in this hotel room, they have food everyday\nAnd i'm knocking on the door everyday... to eat\nAnd they tell - they open the door\nLet me see the- the party\nLet me see like them throwing salami all over\nI- I mean just like- throwing food around...\nBut they're telling me \"there's no food in here\"--\nYou know what i'm saying?\nEveryday, I'm standing outside trying to SING my way in-\nYou know what i'm saying?\n\"We are hungry please let us in'\"\n\"We are hungry please let us in\"\nAfter about a week that song is gonna change to...\n\"We hungry, we need some food\"\nAfter two/three weeks it's like, you know...\n\"Gimmie all the food or we're breaking down the door\"\nAnd after a year then you just like\nYou know what I’m saying, I’m picking the lock\nComing through the door blasting\nYou know what I’m saying?\nIt’s like you hungry, you reached your level\nYou don’t want anymore\nWe asked 10 years ago\nWe was asking with the Panthers\nWe was asking with them, the Civil Rights Movement\nWe was asking you know\nNow those people that asked are all dead and in jail\nSo now what do you think we're gonna do?\nAsk?\n\n[Verse 2]\nThey wanna bury me, I'm worried—no need to lie\nI pray to God I don't scream when it's time to fry\nNowhere to rest, I'm losin' homies—ain't that a bitch?\nWhen I was rich I had clout, now a nigga's lonely\nI put the pistol to my head, and say a prayer\nI see visions of me dead, Lord, are you there?\nThen tell me, am I lost? ‘Cause I'm lonely\nI thought I had friends, but in the end a nigga dies lonely\nNowhere to run, I'm in terror, and no one cares\nA closed casket at my funeral and no one's there\nIs there a future for a killer? I change my ways\nBut still that don't promise me the next day\nSo I stay thuggin' with a passion, forever blastin'\nI'm bustin' on these motherfuckers in my madness\nThey wonder if I'm hellbound\nWell, Hell can't be worse than this, ‘cause I'm in Hell now\nDon't make me hurt you, I don't want to, but I will\nSeen motherfuckers killed over phone bills\nNever will I die, I'll be back\nReincarnated as a motherfuckin' MAC\n-11, ‘cause in Heaven there's no shortage on G's\nI'm tellin' you now: ''You motherfuckers don't know me''\n\n[Outro]\nI ain't scared to die... I ain't scared to die\nOnly fear of death...\nOnly fear of death...\nOnly fear of death...\nThe controversy over Death Row Records\nAnd its owner.. being sort of a gangster\nEverybody's asking about Death Row\nSuge ain't no gangsta. He's chilling\nNo? No man, Suge a rider\nI know what good morals are\nBut you're supposed to disregard good morals\nWhen you're living in a crazy, bad world\nIf you're in hell,how can you live like an angel?\nYou're surrounded by devils, trying to be an angel?\nThat's like suicide", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}