{"songs": [{"title": "Who’s Gonna Save My Soul", "album": null, "year": "2013-01-21", "lyrics": "[Intro]\nAw man J Scott why don't you drop that trill ish\n[Verse 1]\nI got some bad news this morning\nI can't sing for ish ya'll\nWhich in turn made my day, yeah\nWhen this someone spoke I listened, yeah\nAll of a sudden has less and less to say, all right\nOh how could this be\nAll this time\nI lived vicariously\nI can't sing for ish\n\n[Chorus]\nWho's gonna save my soul now?\nWho's gonna save my soul now?\nI wonder if I live to grow old now?\nGetting high 'cause I feel so low now\nLemme freestyle\n\n[Verse 2]\nIt made me feel like somebody\nLike somebody else, yeah\nAlthough we were imitated often\nFelt like I was being myself\nOh, how could this be?\nAll of this time I had to keep this shit G\nPardon my language, I'm sorry y'all\nWho's gonna save my dro now?\nWho's gonna blaze my smoke now?\nI wonder if I'll be pretty forever ya'll\nFeeling high now I feel so low down\n\n[Verse 3]\nI need the marijuana where the trees, leave the trees\nYou're chillin' in the Live Lounge and you with me\nA-S-A-P, got a hat to the back\nAnd it's white 'cause I got a white collar shirt to match\nGot a blue trench, chickens on my *ahh\nNever gave her up, 'cause the clock won't tick\nIf my, ,don't stick, all up in your chicken\nEverybody know me, I'm here take your flexin\nAnd I love the UK, shoot at yo toupee\nRiding round, Chicago like Lupe\nAnd it's a Fiasco, your man is an asshole\nAnd I could get busy but they dizzy like Rascal\nAnd this is off the top, when I'm chillin' in the Live Lounge\nYou already know, ain't steppin' in the spot now\nI gotta come, shut it down, up in Londontown\nI need to beat the loop man, I need another round\nOh, how could this be?\nI feel like whining when I'm singin\nI live vicariously\nYa'll ready?\n\n[Outro]\nWho's gonna save my hoes now?\nWho's gonna save my soul now?\nI wonder if I live to grow old now\nThey say I move back so I gotta slow down\nI hope ya'll liked that right there", "image": "https://images.genius.com/105e467fdb22aef51c3c3de3eb00b922.640x800x1.jpg"}], "artist": "A$AP Rocky"}