{"songs": [{"title": "Nun Ah Y’all Can Hang", "album": "Runnin’ Off at Da Mouth", "year": "1992-06-06", "lyrics": "[Hook]\nNone of y'all can hang x16\n\n[Verse 1]\nHype! You better pipe down or a fight's found\nI know you can tear the mic down - huh, sike, clown\nSay I'm phony like Christmas 'cause I twist this\nDiss and hiss this, I'm pissed, come and kiss this\nButt of mine, you ain't but a blind muthafucka\nDuck tail, one tail, dum tail, try to run, snail\nUntangle your dreadlock, I mean deadlock\nI'ma rock and hope your ears get the point like Mr. Spock\nThem sucka wack rappers whippersnappers think I'm new to this\nI been true to this, give me somethin' to chew to this\nLike bubble gum bums that think I can't hum to a slow drum\nDon't think I know where I come from, dumb-dumb, umm -\nI flow to rhythms of all sorts, different sports\nGive me some pants with them hands, I ain't takin shorts\nTired of them tiny turds and nerds, absurd words\nThey think I rap too quick, 'cause at my pace they ain't heard words\nBut I know one thang\nNone of y'all can hang\n\n[Hook]\nNone of y'all can hang x16\n\n[Verse 2]\nMy style I kick, \"You're flowin' too quick\"\nThat's what I hear from the vics\nI bet I don't flow as quick as you lick chicks\nPlease, think I'm sweater than peas? I flick 'em like fleas\nAt ease, and even overseas they flip over these\nScall, I break 'em like a fall, my lead stops 'em all\nI put 'em in headlocks, dreadlocks and all\nI'ma scuff vics with lyrical rough tricks\nTough kicks, put 'em at the end like a suffix\nYou better maxwell and get smart\n'Cause I'ma flow and kill 'em and let the angels play the harp\nI'm sharp, Tung, I be rollin like bicycles, I slice pickles\nShould I say cucumbers, newcomers, I flip 'em like nickels\nAnd dimes, 'cause nickel-and-dime rhymes I find from blind minds\nThis time they all wanna diss mine\nWhy? Because I let the funky lyricals fly like this\nCome get with the lyrical manifest that'll be flowin' and I\nRock, they still wanna diss a pro because of my quicker flow?\nYou suckers get played like a piccolo\nAnd I let you know one thang\nNone of y'all can hang\n\n[Hook]\nNone of y'all can hang x16\n\n[Verse 3]\nCheck, hope you're ready, singers, for steady ringers\nAnd humdingers, bum slingers cut from Freddy's fingers\nSlice, nice, twice: he sliced ice and sliced mics with spice\nSo precise, don't sacrifice, take my advice\nJihad is on the twelves turnin' giants to elves\nPuttin' twelves on the shelves, makin' 'em hate themselves\nCuts like his, you lack that\nRecords were tossed, and then he crossed the fader like a black cat\nHoldin' the beat like a hostage\nThink it's a joke? Try to poke, then suckers get smoked like a sausage\nDJ Jihad be stickin' cats\nTurnin' 'em sucker ducks' cuts into chicken scratch\nGet the catch?\nSuckers' hearts are ripped apart\nFor tryin' to get with the god Jihad\nPunk, that wasn't smart\nYo, ain't it a damn shame?\nNone of y'all can hang\n\n[Hook]\nNone of y'all can hang x16\n\n(Get busy)\n(Get busy)\n(Get busier)", "image": "https://images.genius.com/f451034356ebcc4eb5aa785c572b265f.953x953x1.jpg"}], "artist": "Twista"}