{"songs": [{"title": "My Side", "album": "If You’re Reading This It’s Too Late", "year": "2015-04-21", "lyrics": "[Intro]\nYeah, that's about it\nThis shit sound like what being rich feel like, fo real\nThis life shit is everywhere, you can't control it\nToo much going on\nToo much, too much, too much\nToo much, too much, too much\nYou, you, you\nMake me wanna take you down through there\nMake me wanna take you down through there\nI'll take it there\n\n[Chorus 1]\nWhy you never come to where I stay?\nAlways hiding out in your New York condo\nWhy you never come to where I stay?\nIf anybody knows, girl, you know, I know\nWhy are we wasting our relationship on a relationship?\nWhy are we rushing and forcing it?—this isn't making sense\nWhy are we focused on things\nThat don't even mean nothing, girl?\nWhy can we not find the time\nAnd sit down and discuss it, girl?\nLet me at least tell you my side of things, man\nAw, man, aw, man, aw, man\n\n[Verse]\nMe and you are playing house\nStart thinking that I'm losing touch\nGot a tight grip on you now\nMaybe I should loosen up\nWhen I leave you and I go home\nI start forgetting what it is\nStart to think I got to get it how I live\nWe too busy for a wedding or a kid\nIf I'm working then I know you working\nKeep in touch with other women\n'Cause you make me nervous\nI empower girls that don't deserve it\nI don't mean to do that shit on purpose\nIt's just that when I go home\nI start forgetting what it is\nThe dream is over, I get lost up in the 6\n\n[Chorus 2]\nAnd you don't ever come to where I stay at\nYou just rather stay up in your New York condo\nYou don't ever come to where I stay at\nIf anybody knows, girl you know, I know\nWhy are we wasting our relationship on a relationship?\nYou know how sticky these situations get\nYou go up higher than me some days\nYou know what I think we could be some day\nLet me at least show you my side of things, man\nAw, man, aw, man, aw, man", "image": "https://images.genius.com/bcf01db777c6e5c46eddb1031a2008d1.1000x1000x1.jpg"}], "artist": "Drake"}