{"songs": [{"title": "Leave Me Alone", "album": "Listen To Me", "year": "2010-03-06", "lyrics": "[Intro]\nLeave me alone\nY'all ever heard of that term\nWhat's it called, uh\nFatal attraction\nWell this story right here\nIt's like that\nThin line between love and hate times ten\nYou be the judge\n\n[Verse 1]\nShe sent me one-hundred and fifty letters sayin' we should be together\nAnd how we should meet each other, when are we gon' see each other\nBlowin' up my phone, I ain't even give my number\nLeavin' voicemails to my fuckin' brother and my mother\nPhotoshopping pictures with me and my sister on it\nCut my little sister's head off and stuck her picture on it\nShe tatted Future Joyner on her titties and her stomach\nTellin' me that if we fuck she [? 0:39] for my brothers\nMiddle of the night she was in my fuckin' dreams\nWith a knife tellin' me that \"It ain't really what it seems\nI'll slice your fuckin' throat nigga, don't you even scream\nFuture Joyner don't you love me baby, we can be a team\nStick together, you and me forever, Batman and Robin\nOr I'll cut your fuckin' dick off like I'm Lorena Bobbitt\"\nI woke up, jumped in the whip and tried to leave\nBut she was in the backseat with my keys like \"Uh-uh-uh\nIt's you and me\"\n\n[Chorus:  Future Joyner ]\nUh Uh Uh Uh\nUh Uh Uh Uh\nLeave me alone\nBitch, leave me alone\nUh Uh Uh Uh\nUh Uh Uh Uh\nLeave me alone\nUh Uh Uh Uh\nUh Uh Uh Uh\nLeave me alone\nUh Uh Uh Uh\nUh Uh Uh Uh\n\n[Verse 2]\nShe snuck in my hotel room\nLookin' all seductive, almost fell for it\nPut my phone in her panties, tied me to the headboard\nShoved a pill down my throat and then my body felt sore\nI woke up in the prison right before they shut the cell door\n\"Officer what fuck?\" he said \"Nigga listen\nSince you wanna rape women, you gon' be somebody's bitch\" and\nI was trippin' like \"Nigga what? You got it fucked up\"\nHe said \"Keep your mouth shut, pussy, tell it to the judge\"\nI went to court the next day, she was in the stands\nSlipped the cuffs of my hand, then I ran, goddamn\nTook a right down the alley, gettin' chased by the feds\nMade it to my nigga's house and she was layin' in the bed like\n\"You can't run from me Future, don't you understand\nI'm your number one fan, what about our fuckin' plans?\"\nI said \"Bitch, you a crazy schizophrenic heffer leave\nWon't you let me fuckin' breathe?\" She said \"Uh-uh-uh\nIt's you and me\" *gunshot*\n\n[Chorus:  Future Joyner ]\nUh Uh Uh Uh\nUh Uh Uh Uh\nLeave me alone\nBitch, leave me alone\nUh Uh Uh Uh\nUh Uh Uh Uh\nLeave me alone\nUh Uh Uh Uh\nUh Uh Uh Uh\nLeave me alone\nUh Uh Uh Uh\nUh Uh Uh Uh\nLeave me alone", "image": "https://images.genius.com/2c85e5ff7768da914af18e07c14fca52.1000x1000x1.jpg"}], "artist": "Joyner Lucas"}