{"songs": [{"title": "Player For Life", "album": "Chase the Cat", "year": null, "lyrics": "[repeat 3X]\nGotta be a player for life, gotta be a player for life\n\n(That's right) Gotta be a player for life, I gotta be a player for life\n\n[Too $hort]\nSmob to the tip, I feel no guilt\nShe's young and she's fine and she about to get peeled\nI know you heard why, no need to tell\nYou looking at a certified P.F.L\nYou wanna be like me?  I don't think you can\nYour girlfriend loves you, need to be her man\nShe never told you how she was a Too $hort fan\nShe kept it to herself, you wouldn't understand\nI met her at the mall when she was mad at you\nShe said, \"Gimme a call\", and I was glad to\nThat night, I gave your girl a ex tab..\n.. the best sex she ever had\n\n[Hook: repeat 2X]\nI gotta be a player for life, I gotta be a player for life\n\n[Too $hort]\nIt'd be nice to wake up to some little smiling faces\nSaying, \"Daddy\" - instead of being in wild places\nSmoking fatties, four hoes in my Caddy\nEach one willing to have me\nSometimes you want my life, sometimes I want yours\nI'm trying to find a wife and you trying to find whores\nWhich one of us is looking in the devil's eyes?\nI'd settle down if I could have seven wives\nBut that's illegal, and everywhere we go\nWe roll through the town taking every ho\nAnd of course, we show no remorse\nI'm doing one-twenty with your ho in the Porsche\n\n[Hook]\n\n[Too $hort]\n'Til death do us part, with all your heart\nIt was love - right from the start\nBut could you do it - could you change your life\nAnd get married, stop running game every night?\nEx-player with his wife and kids\nLooking happy; I wonder if he really is\nI would hate to be committed even though I ain't wit it\nStill out in the streets trying to get it\nIt's hard for a man with access to one vagina\nTo be faithful, when she's so much finer\nThan his wife - she seen it comin'\nHe fell in love with another woman\n\n[Hook]\n\n[Too $hort]\nI keep coming back to the same thought\nFalling in love'll throw the game off\nYou let her get to you, you know you still care\nBut I was raised by them real players\nI try to tell the homies fuck the party\nThis player lifestyle ain't for everybody\nYou gotta make your own choice - it's your life\nHow would it be without your kids, and no wife?\nWaking up with a tramp - you don't like\nNigga, you better hear what I'm saying on the mic\nYou wanna be a pimp, you better go back home\nLeave them tramps alone, you know you're wrong\nYou're wrong\n\n[Hook] - 2X", "image": "https://images.genius.com/5879836b504c477d7cddacb459c66e7c.776x768x1.jpg"}], "artist": "Too $hort"}