{"songs": [{"title": "PASS OUT", "album": "QUAVO HUNCHO", "year": "2018-10-11", "lyrics": "[Intro: Quavo]\n22 million dollars in cash left on the street\nThe boy who picked up the cash? Went on a mission\n(Buddah Bless this beat)\nIt's the most money I've ever felt or touched\nBuddah, Huncho, go!\nWoo, woo, woo, woo (Yeah)\n\n[Chorus: Quavo]\nI brought my niggas to the bank, then we cashed out\nI brought my bitch to the bank, then she passed out (Bitch)\nWoo, woo, woo, yes sir\nWoo (Hey!), woo (That's hard), yes sir\nI do not talk about niggas out my damn mouth (No)\nI pull up on you, pull the trigger, then I air it out (Uh)\nWoo, woo, woo, yes sir\nWoo (Hey!), woo, woo, woo, yes sir\n\n[Post-Chorus: Quavo]\nSkrr, skrr, skrr, skrr, skrr, skrr, skrr, skrr (Huncho)\nSkrr, skrr, skrr, skrr, skrr, skrr, skrr, skrr\n\n[Verse 1: Quavo]\nYeah, whip it like I can't stand it (Skrrt, skrrt)\nPull up, park and do damage (Skrrt)\nTrap house to a mansion (Trap)\nI put that on my granny (Grandma)\nGrandma, yeah\nGrandma\nLet me see that lighter (Hey)\nFire a nigga ass up, yerr (Yeah)\nMissed his head so I caught him in the ear (Grrrah)\nI should face tattoo a hundred tears (Huh?)\nAll these rappers wanna make disappear (Woo)\nIn the spotlight lookin' like deers (Deer)\n'Specially when we pull up pressin' (Press 'em)\n'Specially when we pull up flexin' (Flexin')\n'Specially when we pull up checkin' (Check 'em)\n150 cash on a necklace (Ice)\nYoung nigga scrapin' them extras (Skrrt)\nMovin' 'em blocks, no Tetris (Blocks)\nWrap 'em a lot like Texas\n\n[Chorus: Quavo]\nI brought my niggas to the bank, then we cashed out\nI brought my bitch to the bank, then she passed out (Bitch)\nWoo, woo, woo, yes sir\nWoo (Hey!), woo (That's hard), yes sir\nI do not talk about niggas out my damn mouth (No)\nI pull up on you, pull the trigger, then I air it out (Uh)\nWoo, woo, woo, yes sir\nWoo (Hey!), woo, woo, woo, yes sir\n\n[Verse 2: 21 Savage]\nLil' mama fine as hell, but she actin' saditty (Stuck up)\nI'm not Will Smith, but I'm tryna get jiggy (Fuck her)\nI can show you how to make a band like Diddy\nGet up out yo' feelings 'fore this choppa make you dance like Shiggy (21)\n6 God just like Drizzy (Skrait up)\nShoot you in the back like Ricky (Skraight up)\nSeats peanut butter like Jiffy (Skraight up)\nY'all niggas rats like Mickey (Skraight up)\nThick women only, I'm picky (On God)\nYellow diamonds on me, they pissy (On God)\nElliot the one did all my ice, but I'm not talkin' bout Missy (On God)\nPick your side (Yeah)\nOne man army, don't need no side (Yeah)\nRolls-Royce truck (Skraight up)\nYour bitch gettin' down on her knees inside (On God)\nY'all gotta put shit together, 'cause your money short, nigga, like Yeezy slides (Broke ass)\nThe Bentley truck came with them, I ain't even have to put no TVs inside\n\n[Chorus: Quavo]\nI brought my niggas to the bank, then we cashed out\nI brought my bitch to the bank, then she passed out (Bitch)\nWoo, woo, woo, yes sir\nWoo (Hey!), woo (That's hard), yes sir\nI do not talk about niggas out my damn mouth (No)\nI pull up on you, pull the trigger, then I air it out (Uh)\nWoo, woo, woo, yes sir\nWoo (Hey!), woo, woo, woo, yes sir\n\n[Post-Chorus: Quavo]\nSkrr, skrr, skrr, skrr, skrr, skrr, skrr, skrr\nSkrr, skrr, skrr, skrr, skrr, skrr, skrr, skrr\n\n[Verse 3: Quavo]\nYeah, hey! Only God I fear (God)\nIt's ten bricks in the Lear (Bricks)\nDraco came with a mirror (Boom-boom-boom-boom)\nTo watch my back (Uh, uh)\nHeard he got whacked (Huh, huh)\nThe bando back (Uh)\nCookin' from scratch (Uh, whip)\nHeard you the man now\nYou do the dirt with your hands, huh? (Dirt)\nGet it for a lil' bit of change, feel like you pickin' up cans now (Uh)\nSatellites on the plane, think the prezi flyin' (Dope)\nBeep, beep! Fuck it, dead line (Fuck it)\nTook your bitch to the bank, now her head's mine (Toppy)\nIf I ever have kids, inherit my bread line (Oh!)", "image": "https://images.genius.com/39a1f9d0d1403b9749469ec36ad251e9.1000x1000x1.jpg"}], "artist": "Quavo"}