{"songs": [{"title": "Can You Keep Up?", "album": null, "year": "2011-12-08", "lyrics": "[Verse 1: Twista, Busta Rymes and Both]\nNow it's finna be some energy, we got the remedy\nI'm in the vicinity of a nigga that can spit it with me\nFeel the fire whenever we act up\nEverybody else is incompatible with the artillery\nSo forget about it when you hear about it\nCause it's too fast when I pass the baton to Busta\nHit a victim in the middle of the body with a bullet and a rhythm\nEvery murder is a structure\nEvery time I hit you niggers with another jam be blacking\nI be sounding like a nigga full of anger\nNow I'm back to beat you in the head, I'll bring another banger\nWith my nigga Twist, everything we do be up to wanger\nYou don't really, really wanna see the way that I come\nAnd I'll give it to you, get up on the ceiling see a nigga numb\nDo it how I wanna do it 'till I make another nigga drop\nI put my money on it, homie, I'm the one\nGo on here, pick it up, carry it the way you wanna carry it\nDo whatever you wanna do\nShow the competition how we gunning too when we coming through\nBetter never let a nigga never get in front of you\nI wanna be, I wanna pro, wanna get in\nThen racin' so fast, they call me flash\nDon't nobody really wanna\nWe can hit 'em like a couple of millimeters\nWoopin' a niggas' ass\nSkibbedy boop, skibbedy bop, skibbedy beep\nI'm skipping all over on another Just Blaze hit\nNow I know a lot of y'all been sitting, waiting and wondering\nWas we ever gonna do this shit\nAnd then we came to hit 'em with another flow\nPop champagne, celebrate and kill another show\nGotta campaign, the greatest niggas, y'all already know that\nNever do this kinda shit, Twista, get 'em, gotta go\nNow I gotta ask y'all\n\n[Hook Busta Rhymes]\nCan you keep up?\nCan you keep up?\nCan you keep up?\nCan you keep up?\nCan you keep up?\nCan you keep up?\nNow try to catch me if you can\nCan you keep up?\nCan you keep up?\nCan you keep up?\nCan you keep up?\nCan you keep up?\nCan you keep up?\nNow try to catch (Now try to catch me)\n\n[Verse 2: Twista, Busta Rhymes and Both]\nKill everybody cause I'm gunning outta stress\nIf I'm running outta breath, he gonna pick up where I left off\nKeep him with me when he spitting cause the flow be the bidness\nI'm a menace when I bust a lyrical tec off\nGo faster than Ricky Bobby, kill him in Talladega Nights\nNiggas try to get up, when a nigga hit up\nWhen it I come I promise you gotta pay the price\nLook, why don't everybody wanna come and try get a little taste\nOf the shit I got, let me put it all up in your face\nWhen I spit it I got a nigga wilding all over the place\nEverybody better listen here\nCause you know when I bring him I will never, never stop\nMake a nigga rewind and bring it back to the top\nThrow the shit up in the streets and I be running every block\nEverybody better stand clear\nLike a millimeter when I be booking the track up\nMotivated for murder whenever I act up\nA couple of phenomenal niggas can stack up\nGets anybody that wanna live in the back up\nKilling everybody when I bust a clip off\nCause I'mma be attacking them with the insane flow\nThen I be having them calling me Twista Phelps\nAnd my nigga Buss like Usain Bolt\nShocked a nigga like I was a thousand volts\nNow I'm sailing on the beat the way I'm sailing on the boat\nThe way I gotta kill 'em and the way I gotta flow\nYou don't really wanna test me, boy, cause I'll pop ya\nWhen I'm in the spot you know you can't leave\nI spit every word 'till, damn I can't breathe\nYou never heard 'till you nosebleed\nTwista, please\nNow you know I got ya\nNow I gotta ask y'all\n\n[Hook: Busta Rhymes]\nCan you keep up?\nCan you keep up?\nCan you keep up?\nCan you keep up?\nCan you keep up?\nCan you keep up?\nNow try to catch me if you can\nCan you keep up?\nCan you keep up?\nCan you keep up?\nCan you keep up?\nCan you keep up?\nCan you keep up?\nNow try to catch (Now try to catch me)\n\n[Verse 3: Twista, Busta Rhymes and Both]\nYou can talk about it with a bunch of people\nThat say that I'm a lyrical manifestation of rhythem\nThen I come and do the shit I gotta do and then I bang ‘em\nAnd get 'em and do it every single time I hit 'em\nWhen I do it its gotta be accurate\nLike I'm attacking the rhythm with such a vocal tenacity\nSee the way a brother blacking I’m back and infant\nCause every time we in the place you feeling the capacity\nI be coming with it, he be coming with it\nAnd nobody really do it how we do it\nAnd the flow is so fluid I gotta be an anomaly\nGotta be an Odyssey; the prodigy, and I'mma be the one to prove it\nDon’t you ever forget it the way we coming\nAnd they sending somebody, gonna probably be needing a medic\nSo give us the credit and I thought that we should oughta\nBe coming to slaughter so call out the order see the way we do it\n\n[Hook]\nCan you keep up?\nCan you keep up?\nCan you keep up?\nCan you keep up?\nCan you keep up?\nCan you keep up?\nNow try to catch me if you can\nCan you keep up?\nCan you keep up?\nCan you keep up?\nCan you keep up?\nCan you keep up?\nCan you keep up?\nNow try to catch (Now try to catch me)", "image": "https://images.genius.com/54314abfbbbf16253d72455428cc44e6.834x834x1.jpg"}], "artist": "Busta Rhymes"}