{"songs": [{"title": "Roll Up (2015)", "album": null, "year": "2015-11-03", "lyrics": "[Verse 1: B.o.B]\nSometimes I get high to free my mind\nIs that alright?\nRight, right, right, right\nSometimes I get drunk, to pass the time\nIs that alright? Is that alright?\nRight, right, right, right\n\n[Hook (x2)]\nLet’s roll up somethin’, let’s pour up somethin’\nLet’s roll, let’s pour, let’s roll up somethin’\nLet’s pour up somethin’\n\n[Verse 2: B.o.B]\nSometimes I get high to get you off my brain\nIs that alright?\nRight, right, right, right\nSometimes I like to get wasted\nSometimes I like to get faded\nSometimes I... wait, I forgot what I was finna say\nRight, right, right, right\n\n[Hook (x3)]\nLet’s roll up somethin’, let’s pour up somethin’\nLet’s roll, let’s pour, let’s roll up somethin’\nLet’s pour up somethin’\n\n[Verse]\nBefore the hoes was ever noticin’, bank was broken, full of overages\nCrucified for my outspokeness, my heart was cold, it’s so emotionless\nHear, hear, hear, hear, I can’t hear my own thoughts\nHell yeah, yeah, yeah, silence every phone call\nToo much thinkin’ and too much time in the attic\nToo much drinkin’ and too much weed for my habit\nToo much passion and too much swag for the average\nDon’t need to explain if you can’t change what happened\nUh, loose handshakes and fake smiles\nMore knives in my back than a steakhouse\nFeelin’ like Em in Eight Mile\nLose yourself right now, I’m spaced out\nFriends pretendin’ they ain’t enemies\nHaters be whisperin’ cause they envious\nKnow all the pain I got in my memories\nWho got the pill that they had it limitless?\nNow who says, now who says I can’t get stoned?\nNow who cares, now who cares who’s right, who’s wrong?\nIf you find it, be clear, a new life with new air\nA new flight with new stairs, you might move on\nAnd get faded, you might move on and upgrade it\nYou might move on and just get the bullshit out of the way\nRight, right, right, right\n\n[Hook (x2)]\nLet’s roll up somethin’, let’s pour up somethin’\nLet’s roll, let’s pour, let’s roll up somethin’\nLet’s pour up somethin’\nRight, right, right, right", "image": "https://images.rapgenius.com/9dc68caf1f7a138e2391faa836f79cc0.600x600x1.jpg"}], "artist": "B.o.B"}