{"songs": [{"title": "Keep It Goin’", "album": "Rich Gang: Tha Tour Pt. 1", "year": "2014-09-29", "lyrics": "[Intro]\nShow me how to keep it goin'\nTell me how to keep it goin'\nLong as you show me how to keep it goin'\nWe got London on da Track\nI'ma, I'ma, I'ma keep it goin'\nHey, hey, hey, yeah, I'ma keep it goin'\nAs long as you show me, I'ma keep it goin'\n\n[Verse 1]\nUh\nShowing love to these bitches\nAs I take off like a missile, ayy\nThese niggas mugging when they see us\nSo I clutch on all my pistols\nPlus I come through smoking loud like a whistle\nLooking down from the cloud in my rearview\nThese pussy niggas want a slice like Kimbo\nAnd I freeze them all, Sub Zero\nDynasty, Dynasty\nThese bitches climb on me, climb on me\nThat's mine, I want the whole ninety Gs\nAll my niggas feasting, yes, dining please\nI put on my ice and they liking this\nFuck her fast, nitrogen, nitrogen\nRoar, bitch, Lion King, Lion King\nI got more water than Tennessee\nThen I take it off and pour it on her like a coach\nPlaying with my money bitch you fired, you a roach\nStraight up in that vintage, it's just Chanel, no Coach\nPut the little bitch in time out, no spoke\nWhy the fuck a nigga rolling my weed and leave it open?\nAnd I'm cooking all white, nigga, no portions\n\n[Chorus]\nI cannot be worried 'bout no bitch\n'Cause I know a bitch could be somewhere sucking a dick, ayy\nYou like \"Where the hell is yo bitch?\"\nMeanwhile yo bitch like \"Where the hell is yo clique?\", hey\nI can't buy you pearls, buy your shit\nI got three boys, and three girls, with a bitch, hey\nDiamonds yellow like corn on the Cob\nI can't buy you shit unless you got a blow job\nBig Homie show me how to keep it goin'\nI can't be no lick like no motherfucking tongue, ayy\nBig Homie tell me how to keep it goin'\nMilk these lil' bitches like I'm motherfucking farming\nBig Homie show me how to keep it goin'\nI can't be no lick like no motherfucking tongue, ayy\nBig Homie tell me how to keep it goin'\n*Sips Lean*\n\n[Verse 2]\nA nigga riding with the top off (Skrt)\nAnd now I need a new Hairdo (Where she at?)\nBitch, you know my diamonds wetter than a sink\nEvery time I come around them bitches faint\nBaby I'ma sing to you like Tank\nBaby I want you to dry me like I'm paint\nSpl-spl-spl-splat on the other side\nIf you bout to die nigga tell me would you ride\nLet a nigga play, I pull up with a whole tribe\nFlood your wrist with lots of karats 'cause you're Bonnie and Clyde, woo\nHundred rounds on that motherfucker, gah, gah, gah (WOO!)\nI get respect whenever I land in New York\nLike Bobby Shmurda, nigga, ah, ah (Woo)\nIt's a shame how I yell at these niggas and don't lose my voice\nAnd, it's a shame how my ice so cold but I leave these bitches moist (Leave her wet, what?)\nI swear to God, baby, you're the people's choice\nAnd when I get home right before I go to sleep I wake up my little boy, hey\nAnd I tell him\n\n[Chorus]\nI cannot be worried 'bout no bitch\n'Cause I know a bitch could be somewhere sucking a dick, ayy\nYou like \"Where the hell is yo bitch?\"\nMeanwhile yo bitch like \"Where the hell is yo clique?\", hey\nI can't buy you pearls, buy your shit\nI got three boys, and three girls, with a bitch, hey\nDiamonds yellow like corn on the Cob\nI can't buy you shit unless you got a blow job\nBig Homie show me how to keep it goin'\nI can't be no lick like no motherfucking tongue, ayy\nBig Homie tell me how to keep it goin'\nMilk these lil' bitches like I'm motherfucking farming\nBig Homie show me how to keep it goin'\nI can't be no lick like no motherfucking tongue, ayy\nBig Homie tell me how to keep it goin'\n\n[Outro]\nShow me how to keep it goin'\nTell me how to keep it goin'\nLong as you show me how to keep it goin'\nI'ma, I'ma, I'ma keep it goin'\nHey, hey, hey, yeah, I'ma keep it goin'\nAs long as you show me, I'ma keep it goin'\nTell me how to keep it goin'\nLong as you show me how to keep it goin'\nTell me how to keep it goin'\nLong as you show me how to keep it goin'\nAs long as you show me, I'ma keep it goin'", "image": "https://images.genius.com/07e1a913522c1d895f518d7ebf9ad7f0.640x640x1.jpg"}], "artist": "Young Thug"}