{"songs": [{"title": "My Name Is", "album": "No Ceilings 2", "year": "2015-11-26", "lyrics": "[Hook]\nMy name is, my name is\nMy name is, Weezy Baby, and I'm high\nLike maintenance, I'm smokin'\nI'm drankin', leanin' daily, like, hi\nMy name is, you know what my name is\nBitch, I'm famous, like Tom Brady\nAnd hi, your name is? Not important\nWho cares? Not Weezy Baby, uh\n\n[Verse 1]\nWake up, I see bad bitch, bad bitch, bad bitch\nMakeup on my pillows make me mad, bitch\nWithout no makeup, I see that bitch as just average\nUber, Uber, Uber, Uber, Taxi\nLooking at my Rollie, I got boogers on my Rollie\n'Bout to hook up with my whoadies\nGot the hook up on that codeine\nGot the sugar for your nose ring\nGot the blooka, I'm reloading\nAnd according to my darling this dick feels so damn rewarding\nI'm reporting out of shorty, she so naughty, me so horny\nKilo on me like I'm Tony, break it down to Rice-A-Roni\nTake her out, look like she lonely, I'm gon' candlelight the moment\nI'ma vandalize the pussy, she told him \"My phone was roaming\"\nShe be moaning 'til the morning, I be goin' in\nI be on it, I be in it, I'm like Foreman on the grill\nAnd I got doormen at the entrance\nThey got pistols in they trenches\nThey got rituals, religion\nAnd I'm like, bitch, you know I'm sipping\n'Til I die\n\n[Hook]\nMy name is, Lil Wayne, bitch\nWeezy, F. Baby, ha\nHer name went, from whatever-it-was\nTo \"Lil Wayne's bitch\", now that's crazy\nAnd I, I camed in, regained strength\nRebanged it, rotation\nHer guy, he's nameless, he ain't shit\nAlways on the same shit, poor baby\n\n[Verse 2]\nI pour up so much they call me Pour Baby\nKush man, I need a sack like Charles Haley\nSipping to the Big Moe, I'm the Barr Baby\nSip got me moving slow but my thoughts racing, err!\nMy long days give me short patience\nMy heart vacant, awards taken\nWhat in tarnation? No information, no statements\nYoung mula, old mula, mula all ages\nHa-Hallelujah, I'm the Hollygrove 2Pac\nRoc-A-Fella, new rock, hundred K in a shoebox\nAK and a new Glock go wap-ba-ba-loo-bop\nPray the vest you got save you like a coupon\nHustle 'til my dreadlock is grey as some Poupon\nEvery day is my birthday, I'm a newborn\nStay on my toes, ask a shoe horn, I ain't got no roof on\nGettin' my No Ceilings 2 on\n\n[Hook]\nAnd hi, I'm brainless, I'm stainless\nEntertainment, his lady\nAnd, um, if she ain't thick, then she ain't it\nI can't fuck wit' a slim lady\nI tried, but Superhead keep complaining\nBitch ancient, bitch shady and she tired\nOkay then, I'm skatin'\nDoing tricks, call me 'trick Swayze\n\n[Verse 3]\nOkay, In other news and other niggas' hoes\nYour wife taste like Honey Nut Cheerios\nI'm in the mirror, like \"Ooh, baby\"\nWho needs a miracle when I got you, baby?\nPimping in my last life, I'm the shit you ass-wipe\nBeat the pussy, cat fight, my teeth look like a flashlight\nWeed is like a airline, 'cause easily I'm that high\nFistful of money, mix some green in with your black eye\nGreedy like a fat guy, I'll eat a nigga franchise\nI beat him by a landslide, a leader like a rabbi\nI'm leading by halftime, he bleeding, I'm a vampire\nHis body in the trunk with his feet all on my Alpines\nWe the niggas, that's right, we all that and fries\nY'all on standby, my broads got cat eyes\nTraphouse land lines, boom like land mines\nAll my bitches allies with Tune on their backsides\n\n[Hook ]\nSo hi, my name is, on her anus\nOn her cranium, bitch cravin'\nAnd I'm fly, and I'm wavy\nAnd her name is Bust It Baby\nAnd hi, my name is in your mouth, it must be tasty\nGone!", "image": "https://images.genius.com/ed7fb7fe9af1d913b520bf5336619560.800x800x1.jpg"}], "artist": "Lil Wayne"}