{"songs": [{"title": "The Conspiracy Freestyle", "album": "Straight from the Lab", "year": "2003-04-15", "lyrics": "[Intro: Green Lantern, Eminem & 50 Cent]\nOkay (Yeah)\nIt's about that time again (Haha)\nGreen Lantern (That's Right)\nG-G-G-G-G Uni-*burp*\nShit!\nHahaha, Shady\nWe back (Invasion!) Part II\nThe Conspiracy\n\n[Hook: Eminem & Green Lantern]\n'Cause we ain't gonna never stop, you just keep wasting your energy\nOn us, you should find something to do with your time (time)\nAnd quit fuckin' with us 'cause we ain't fuckin' with you\nAnd E must be fuckin' with you so much you must be gone out your mind\n(Shady Records mixtape, let's go Em)\n\n[Verse: Eminem]\nThey say I'm a day away from my entire empire crumbling\nSpeak up, you're mumbling, what the fuck-a you's a\nBibi-bay okay big-bi-bi-baby, this is Shady\nI know you was bi-bi-hoping we be-be-would just go away\nBut weeble mable weeble wobble but we don't fall down like\nJam Master Jay's two turntables, our label is just too stable\nYour magazine's so motherfucking thin you using staples\nTo hold it together it's turning back into a newspaper\nAnd ya'll got somethin' for my ass every issue\nThank you, 'cause I keep runnin' out of fucking tissues\nAnd I could diss you but God I was sick of looking at you\nAt least now I can see when Nike's got a new tennis shoe\nBut-but I guess no good news is always good-good news\nMoving on to bigger and better things (chicka chicka jeera)\n50's blowing up, this year just keeps going up\nWhat the fuck is going on? Who the fuck is Norah Jones?\nShady, wait a minute, baby, leave the whore alone\nJust go up there and be humble and take them awards home\nBush has just declared the world a fucking war zone\nMeanwhile we got a war going on of our own at home\nMy fuckin' mind's blown\nTrying to figure out how to fight my own clone\nRhinestones are so nice, they shine so bright\nEspecially at night\nAfter a hit of ecstasy, ain't that right Ro'oh?\nWait a minute, I'm rambling\nBack to the matter at hand, it's Green Lantern\nWith Elvis Presley the selfish MC\nBack to the ruin rap and destroy the industry\nSingle handedly and oh man did we\nYeah me and 50, Obie, me and Twizzy\nAnd Nelly and Missy and Jigga\nGod damn, it's all a plan devised by the Man\nIt's a conspiracy against fake shit, and anybody who can't make hits\nOr ain't dope lyrically, so fuck what you heard and what you read about\nWe ain't ruining rap baby we're just trying to weed it out\nShady in the place to be see\nAnd I got what it takes to rock the mic, aiight!\nStill keep talking shit to me punk\n'Cause your magazine's over in less than six months!\n\n[Outro: Eminem]\nHaha, Shady Records, still Aftermath!\nAnd don't think we can hear you motherfuckers talking\n'Cause we can't\nWe don't hear y'all\nSo we just gonna sit back for the rest of our lives\nWhile you ride our dicks", "image": "https://images.genius.com/8dd03ebbf724e2b4d4bafbddf8c3c2f1.1000x1000x1.png"}], "artist": "Eminem"}