{"songs": [{"title": "Waiting For the World to End", "album": "The Master", "year": "1999-11-30", "lyrics": "[Produced by DJ Premier]\n\n[Intro]\nYeah, it's the God, Rakim\nWord up, I'm blazin' this out to all my comrades, ya know I mean?\nFrom the slums of New York, to the gutters all over the world\nThis is for y'all\n\n[Verse 1]\nThrough my travels, I try to take righteous steps\nBecause right or left could mean life or death\nNo matter how trife it get, my sights is set\nBut it's twice the threat when the nights is death\nMy mental windows refuse to close, they get exposed\nTo the neighborhood info where the poison wind blows\nA deadly plague spreadin' negativity, viciously\nUnto every city be in ghetto misery\nDon't let it get to me, the writer be left to die\nBut it get mesmerize if it catch your eye\nShines enormous, from pure revered Kool's and garments\nBut it's torment, jealousy drug wars or warring\nTallying, slowly turnin' into barbarians\nMore scary when the whole boulevard's carryin'\nLivin' in the world of sin, my ghetto girls and men\nWaiting for the world to end\n\n[Hook]\n\"Tryin to paint a perfect picture and excel\"\n\"In case you didn't know\"\n\"Never movin' backwards\"\n\"Complicated\"\n\"Know what I mean?\"\n\"Tryin to paint a perfect picture and excel\"\n\"In case you didn't know\"\n\"Never movin' backwards\"\n\"Complicated\"\n\"Know what I mean?\"\n\n[Verse 2]\nI see destruction, even little kids trust none\nThey bust guns, that's what they get a rush from\nWhen I see 'em, we build and have a real discussion\n\"Yo Ra, what's the jewel of the day?\" \"What up, son?\"\n\"You got ambition?\" Shorty said, \"Man listen\n\"I got demands for livin', can't stand division\n\"Make grands on my mission, 'til everything glisten\n\"Women in the Expedition, no plans for prison\n\"In a vision the city get, two milleni G\n\"Sittin' in my embassy, sippin' Hennesy\n\"Gettin' high, and watch life pass me by\"\nSo I asked him why, with a fast reply\nHe said, \"I'm livin just to die without any feelings\nSo I wait here for my maker 'til it's time to go\nWith this dime I know, with all of her girls and all of my men\nWaiting for the world to end\"\n\n[Hook]\n\"Tryin to paint a perfect picture and excel\"\n\"In case you didn't know\"\n\"Never movin' backwards\"\n\"Complicated\"\n\"Know what I mean?\"\n\"Tryin to paint a perfect picture and excel\"\n\"In case you didn't know\"\n\"Never movin' backwards\"\n\"Complicated\"\n\n[Verse 3]\nShorty was taught to keep his head to the sky, and never cry\nBut the streets left him to die, now it's death in his eye\nLivin' in sin'll give men, a sinister grin\nFrom the beginning to end, in it to win\nEvil rebels, doin' what we do in the ghetto\nThinkin' if we was thorough we can deceive the devil\nYou can't win, your life be end, try again\nShorty said, \"Why we born again to die again?\"\nThat's what I said when I realized I had a gift\nTo uplift and be one of Allah's advocates\nTeach the youth and speak the truth\nShow 'em what peace can do when they'll reach for you\nAnd my reward won't be jewels or cheese, it's even better\nI can be one of the greatest MC's ever\nIf I tell 'em they intelligent women and great men\nAnd live, stop waitin' for the world to end\n\n[Hook]\n\"Tryin to paint a perfect picture and excel\"\n\"In case you didn't know\"\n\"Never movin' backwards\"\n\"Complicated\"\n\"Know what I mean?\"\n\"I'm ragin, rippin up the stage an'\nDon't it sound amazin, know what I mean?\"\n\"Don't it sound amazin, know what I mean?\"\n\"Rakim\"", "image": "https://images.genius.com/ed0fa8170b1ec37192ad4e270a004891.500x500x1.jpg"}], "artist": "Rakim"}