{"songs": [{"title": "Return of the North Star", "album": "Only Built 4 Cuban Linx... Pt. II", "year": "2009-09-08", "lyrics": "[Popa Wu]\nSee, the way to evil, balance equality in no man\nFor no man is good and bad at the same time\nEither you good, or you bad\nYeah... damn\nYo, Rae, that's you baby?\nDamn, man, I heard all these things about you, man\nBoy I heard you been doing your thing, man\nWait, wait, let me tap them pockets, man, them pockets fat?\nYou know I'mma get mine, yo, Rae, baby, check this out\nYo, we done went through so many trials and tribulations, man\nIt's a shame, man, but you know, I told you what the devil is, man\nAlways watch them people who lie to you, them people try and cheat you, man\nOut your money, I told you, you ain't let me cheat you out your money\nShit, man, what? You gon' let another nigga cheat you out your money, boy, you crazy?\nAight, watch the tricks, baby, cuz the trick is a lie\nAnd a lie is a thief, trust me, baby\nKnowhatimsayin, now give me a couple hundred, man\nTime to go do my thing, man, I'm going on the road\nWhen you get, when you, yo, I already had the vision\nYo, Rae, I had a vision, I seen you, man\nAt the, at Madison Square Garden, and I just came through\nAnd you said \"Yo\", and it was real, son, and you took the world by storm\nThey didn't understand it, cuz they didn't see that far\nThey couldn't see the forest from the tree\nBut Rae, I'mma tell you, it's your time, man\nGo get that paper, man, you understand?\nGet that paper, man, cuz it belong to you, man\nAllah is the God, trust, keep Allah in your heart, brother\nAnd you won't fail, trust me, always remember\nHow far the thou travel, thou travel as far as the dimension he could see\nWhat you see? That's all I can say baby, watch the liar, watch the cheat\nAnd watch the thief\n\n[Raekwon]\nWe need more time, we need more crime, man\nDamn, stop playing, what up nigga\nYeah, man, chill, stick around for a minute\nThere's alot of money out there\nTrying to get alot of fold ups, captain\nIt's all real, lay the roof, I'll meet you there in a minute\nMonkeys with the AK's is upstairs, stupid\nIt's all good, chill, close the cabinet, stupid\nRelax, man, relax, you got shit showing, nigga\nAiyo, Chef, a nigga got all your jewelry on when you be out of town, my nigga\nWhat the fuck is this nigga problem, son\nChill, baby... a lot of bread...\nAll you gotta do is stick around...", "image": "https://images.genius.com/2691e582dc2839478e49279288d69cb1.1000x1000x1.jpg"}], "artist": "Raekwon"}