{"songs": [{"title": "Mrs. International", "album": null, "year": null, "lyrics": "Yeah, nice\nDedicated to all the beautiful people in the house\nYou know who you are\nYeah, Redman, Method Man, Blackout! 2\nSexy...\nHair and nails done up, girl, you got your act together\nYou get the thumbs up, your raw footage is uncut\nFronting like them goodies is untouched\nWe both knew this money's is young bucks\nMa, you ever take a trip to Shang-a-lot\nToo many hard shames, the hardest one is saying goodbye\nLook here, time is money, let me save you some time\nAnd in your spare time, fully understand I'm a rare find\nYou know, so pick a day and pick a place and we there for sure\nSlow up the pace, this ain't no race, and there you go\nI'm dope money, girl, that mean I got cash to blow\nShe love it though, she so international\nNot around the way, around the world\nAnd you be stunting when you around your girls\nBut you classy, though, I'm feeling your vibe, you feeling the high\nThe G4 is ready to fly, is you ready to ride?\nLet's go\nInternational (Now we can creep, we can lay on the beach, you know\nThen hit the sheets, I'll let you play with my feet, you know\nShe keep it low, she so international)\nInternational {Hey, I like a girl that'll roll me a blunt, you know\nWith pretty feet, cook me something to eat, you know\nYou not a groupie, you're international}\nHey, you know me, girl, who I be, girl\nThe big whale that bailed outta SeaWorld\nWhat's your name, show me I.D., girl\nYou look black and a little Chinese, girl\nHey, wait a minute, where you going, shorty?\nTry to sneak past me like you ain't balling\nYou look sweet like Tweet, baby, c-c-call me\nMatter of fact, wasn't you on Maury?\nI'm just playing, hey miss thang\nHey, hey, miss thang, how you gon' miss me?\nI got tickets, let's roll to the Knicks game\nYou Teena Marie, and baby, I'm Rick James\nExcuse me, where you going, mama?\nI wanna change, I voted for Obama\nBring in the new, kick out the old timers\nLet's talk while we go and meet your mama\nInternational (Hey, I like a girl that's thick in the waist, you know\nThe kind of girl, that'll finish your plate, you know\nYou not greedy, you international)\nInternational {The type of chick I like'll wheelie your bike, you know\nRock the mic, roll a Philly uptight, you know\nI like it though, she so international}\nSeems to me, me, you a queen to be\nYou mean girl, but you don't mean to be\nGot your crown and your throne, little castle you can rest your dome\nAnd we can smoke a little greenery, you know?\nYou getting that dough, let's get it and go on this cruise\nI'm taking it slow, you painting your toes, and it's cool\nF*ck with your dude, I'm f*cking with you\nLike an overnight celebrity, Miss Nothing to Lose\nYo, hey, hey, miss lady, my boricua\nI heard your Applebum like Bonita\nYour accent telling me you from the eastside\nTake off your shoes, you bout five feet high\nI get high, what about you?\nA jungle brother, and baby I house you\nYour feet looking real good in them house shoes\nYou're not a groupie, you international\nInternational...\nInternational...", "image": "https://images.genius.com/fe6629f7a5e6af0aa38ca87547ced96f.1000x562x1.jpg"}], "artist": "Method Man"}