{"songs": [{"title": "Konichiwa Bitches", "album": "4:21... The Day After", "year": "2006-08-29", "lyrics": "[Hook 2X: GZA sample]\n\"Konichiwa bitches\"\n\n[Method Man]\nWhat up, what up, these niggas suck\nThey can't hold a fort, better hold that thought, B\nIf I can't get it off, see my attitude is MSG\nFuck it, I'm salty, the game been loss me\nPay ya dues, it cost me, who acting like I'm past my prime\nHey Carlton Fisk, nigga, pass the nine, who wanna cross me, now?\nAnd put my body in the lost and found\nYou with the business, then bust off a round\nIt's like the passions of Christ, get crucified just for having that ice\nAnd the audacity for having that life, while niggas starving & shit\nThe main reason they be robbing and shit\nThe same reason you've been targeted bitch (these niggas must of forgot)\nThe thin line between a ho and a trick\nGive 'em the clip between the four and the fifth (yea, motherfucker I'm high)\nThere I go again, blowing a spliff\nWhen I exhale, it's like I'm blowing a kiss (konichiwa bitches)\n\n[Hook: Method Man]\nN.Y.C., is all I see\nO.D.B., nigga, R.I.P. (konichiwa bitches)\nThis Killa Beez on ya M.I.C\nYou want it all, well then y'all like me (konichiwa bitches)\nCome on, come on, I think they playing my song\nI came to blow them out the frame, and I'm gone (konichiwa bitches)\nM-E-T, to the H-O-D\nWhy motherfuckers wanna hate on me? (konichiwa bitches)\n\n[Method Man]\nFor every rhyme, there's a hair on my chest\nScared of the Man, you should be scared of the Meth\nNow every damn that I drop, is homicidal, that could dare to be done\nThere's no survival, now who care to be next? (if you don't know me by now)\nKnow where the borough is, doing it for\nThe most thoroughest, you doing the most, pa\nThe French call it Faux Pas when fucking with son, the odds a hundred to none\nToo many flavors, y'all ain't fucking with one\nIt's getting deep, see the plot thicker\nNo place to be, if you bi-atch, nigga\nOutside the Clan, we always got RZA\nI put it down, like I don't give a\nOne in the head, I bet he don't get up, we drinking malt liquor\nOut of your Benz, just to talk slicker\nThen paint a scene that you can all picture\nYou going in? Well, let me walk with cha\nIt's Method Man, but for short Mr., Mef (konichiwa bitches)\n\n[Hook]\n\n[Hook 4X]", "image": "https://images.genius.com/3ddccdf6d7612b941c3c9dfb5048829a.1000x1000x1.jpg"}], "artist": "Method Man"}