{"songs": [{"title": "Lyrical Hitman", "album": "Bar Exam 3: The Most Interesting Man", "year": "2010-05-30", "lyrics": "[Intro: Royce Da 5'9\"]\n\"He murdered sometimes months apart, years apart\nHe used different methods\nHe would go so far as to plan in his crime the actual deceit of law enforcement\nHe would murder someone\nCut their body, wrap them in layer after layer of plastic bags and material\nThen deposit the body many, many miles from the murder scene.\"\nI'm a lyrical hitman\nI'm a lyrical hitman\n\n[Verse 1: Royce Da 5'9\"]\nThis the homicide, sodomy of course\nMobb Deep, like I got Havoc and Prodigy support\nIma' be dope until they find me as a corpse\nYou can roll your weed up in my Toxicology Report\nYou can call me Kuklinsky, Iceman for short\nAnd I got dead rapper's pens in my Icebox\nAfter they act hard I lyrically kill 'em then I bury their notebooks in my backyard\nCheck it out, the lead gonna hit 'em\nI'm so far from positive\nNigga I'm the opposite of Rev Run on Twitter\nI'm a dead wrong, headstrong spitter\nCompared to me you a faggot gettin' fed bone nigga\nI'm pitch black!\nYou a red bone nigga, I'm a trip\nYou're headphone on, I'm sick\nYou a snitch, that like to sing the Fed's songs, nigga?\nOops, I forgot my meds, you the absent minded\nWhen they find ya' body it's gonna be without ya' head\n\n[Hook]\n\"A mind made for murder\"\n\"Expected the man to uh die, but...\"\n*I'm a Lyrical Hitman* x2\n\"It really surprised me it would've took his head off\"\n\"That's something I didn't expect\"\n*I'm a Lyrical Hitman* x2\n\"Richard Kuklinski\"\n\n[Verse 2: Marv Won]\nThis city is murder for hire\nGot word to my supplier\nSnuck up on 'em\nStrangled 'em, he never heard the wire\nThese niggas claim they cold, I swear my words are fire\nMe and you can get it on, I bet that you retire\nI'm from the city of Gators, YDI\nCold men, he own guns, this is not A Country for Old Men\nBoat Guns, sweat socks, don't run, just stop\nPut the needle in his big ego, watch his head pop\nYou little niggas done fizzled out\nNiggas claim they murderers\nIma' show them what this about\nI am doing work, you can't travel here, pick a different route\nGimme twenty beats and I pick 'em off as you pick 'em out\nMy shit is the screen, I'm clicking this heat\nI hit up your peeps, whip up ya' beef\nDuck, spray 'em\nI'm a stuntman by the way I lift ya' Jeep\nThey should throw under the jail for how I'm killin' this beat\n\n[Hook]\n\"A mind made for murder\"\n\"Expected the man to uh die, but...\"\n*I'm a Lyrical Hitman* x2\n\"It really surprised me it would've took his head off\"\n\"That's something I didn't expect\"\n*I'm a Lyrical Hitman* x2\n\"Richard Kuklinski\"\n\n[Outro]\n\"Is one of the most dangerous criminals we have ever come across in the state\nHe murdered by guns, he murdered by strangulation, he murdered by putting poison on victims food\nHe did all of this, the same time while still exhibiting a normal placid family existence.\"", "image": "https://images.genius.com/f26afa0e15f73eb0b5cef561ec304c68.450x450x1.jpg"}], "artist": "Royce da 5'9'’"}