{"songs": [{"title": "Psycho Bitch", "album": "Anghellic", "year": "2001-08-28", "lyrics": "[Intro]\nI want you to quit\nCallin' me, callin' me\nFollowin' me, followin' me\nWhy do you trip with me\nAfter you get through swallowin' me\nNever knew this Bianca would explode (like this)\nNow that I know this I must reload (gat clips)\n\n[Verse 1]\nHow many ever met a psycho bitch?\nDown for the minute but a major twist\nCame with a bit of game\nMet that bitch sickness\nEverybody peep the evil symptoms so you'll know\nWhen sexual activity happens and tears start to flow, it's time to go\nThey come with a big package in back, chest is twice that\nBut the fatal attraction would only get you ice packs\nBetter watch what you do when you sleep\nWith a woman that's on the edge in yo bed\n'Cause you'll be restin' in red (killa killa)\nThey'll find the number through your residence\nNon-hesitant, unprecedented\nAin't no mystery to her steez, she's demented\nAin't ever gonna get myself in another mix-up with a psycho bitch\nMillimeter with a master plan, so you won't be off in the ditch (like this)\nWild child\nRunnin wild, behind the smile is a frown\nThat'll make ya lay it down, quickly, she shifty\nKilla strictly, out to come and get me\nFrom a rose, to .357/.360\nPsycho bitch!\n\n[Hook]\nNever ever do it down low with a (psycho bitch)\nBetter never ever go out with a (psycho bitch)\nEverybody better learn to see a (psycho bitch)\n'Cause your bitch might be her (yeah yeah yeah!)\nWhatchu gonna do when they pop at you Glock at you\nFill 'em with the venom who the fuck are we talking to?\n(Psycho bitches, psycho bitches)\nWhatchu gonna do when they pop at you Glock at you\nFill 'em with the venom who the fuck are we talking to?\n(Psycho bitches, psycho bitches)\n\n[Brigde]\nI was holdin' her, huggin' her\nRubbin' her, suckin' her\nKissin' her, pluggin' her\nBut she thought that I was lovin' her\n\n[Verse 2]\nAll the lovin' was gone when she found out she was wrong\nCallin' my momma's house at 3 AM (Quit playin' on my phone!)\nThey say the Psycho Bitch was made from us (Psycho bitches)\nSome say they get nathan but hate from us (Psycho bitches)\nFrom the Anghellic, you ravenous (Psycho bitches)\nSo stay the fuck away from us (Psycho bitches, Psycho bitches)\nShe got my gas cut off, but I don't know how\nShe got my phone cut off, but I don't know how\nBitch even got my lights cut off, but I don't know how\nWish I knew back then, what a nigga know now (Crazy bitch!)\nFollow me to my main thangs domain\nThis dame brings mo' pain\nDoor chain broke after the door rang\nMust be on cocaine\nInsane 'ianks, will mess up yo thang\nNo brain bitches will have you stressin' using Rogaine\nDidn't chill wit' her, deal wit' her\nN9na had to get ill wit' her\nTrick tried to kill Mrs. N9ne\nSo I had to hit her with a grill splitter\nNever do sex with a psycho Bianc\nAnybody with her better pop yo trunk\nRun, better get a gun, when the bitch come\nBetter know she a psycho (Killa, killa)\nHard, when he hit that piece and then get her up and out with a dis\nScarred, when he knows that he's been up in the mix with a psycho bitch\nHard, when he hit that piece and then get her up and out with a dis\nScarred, when he knows that he's been up in the mix with a psycho bitch\n\n[Hook]\nNever ever do it down low with a (psycho bitch!)\nBetter never ever go out with a (psycho bitch!)\nEverybody better learn to see a (psycho bitch!)\n'Cause your bitch might be her\nWhat you gonna do when they pop at you Glock at you\nFill 'em with the venom who the fuck are we talking to?\n(Psycho bitches, Psycho bitches)\nWhat you gonna do when they pop at you Glock at you\nFill 'em with the venom who the fuck are we talking to?\n(Psycho bitches, Psycho bitches)\n\n[Outro]\nAs the smoke clears\nYou wonder why this woman packs the most fear\nShe keeps a broken heart and a three-eighty close near\nFrom me to you, if you sense she's psychotic\nBetter watch what you do, what they do\nThey say the Psycho Bitch was made from us (Psycho bitches)\nSay they get nothing but hate from us (Psycho bitches)\nFrom the Anghellic, you ravenous (Psycho bitches)\nStay the fuck away from us (Psycho bitches, psycho bitches)", "image": "https://images.genius.com/365df4b783df60dc1a28c15c531795e6.1000x978x1.jpg"}], "artist": "Tech N9ne"}