{"songs": [{"title": "Thinkin bout You (Remix)", "album": null, "year": null, "lyrics": "[Verse 1: Frank Ocean]\nA tornado flew around my room before you came\nExcuse the mess it made, it usually doesn’t rain\nIn Southern California, much like Arizona\nMy eyes don’t shed tears, but, boy, they pour when I'm thinkin' 'bout you\n\n(Ooh, no, no, no)\nI’ve been thinkin’ ’bout you (You know, know, know)\nI’ve been thinkin’ ’bout you\nDo you think about me still? Do ya, do ya?\n\nOr do you not think so far ahead?\n‘Cause I been thinking ’bout forever (Oooh, oooh)\nOr do you not think so far ahead?\n‘Cause I been thinking ’bout forever (Oooh, oooh)\n\n[Verse: 2 Twista]\n(Twista the Remix)\nBeautiful black woman can you accept me?\nI'm hoping you never forget me\nTouch you wrong I never let my hands let me\nFeelings for you as deep as my ancestry\nLookin' at you black as an Egyptian statue\nElegant in stature; got cha; all in my mental\nWhen I feel the energy every memory I still try and capture\nRapture. Beautiful goddess but modest and almost astonishes everybody else that I let you escape my physical\nForm and to be especially cause you were warm I was hoping that we would make a commitment that was biblical\nPivotal situation put us in critical consequences\nI feel like it was all senseless. Now my pain ,when I'm feelin' all defenseless\nCause I shoulda worked harder for you up in the trenches I'm a be Frank;\nOcean's I think about it comparison when I measure-in the depth of our love\nThey'll be nothin' above\nSadder than purple rain memory's got me cryin' like a dove\nWell do you ever think about it, or did you really forget\nI don't think I forgot an hour, What you'd use to look like stepping out the shower\nSuper sexy when you in a position of power\nSpiritual essence of what a real woman is\nLet's get in a time machine, I call it music\nHoping I can jog every memory you get subliminal takin' you back forever the way I use it\nHow I tell the DJ spin it thoughts about you are usually infinite You on my mind is always authentic\nWhen I think about you I be all up in it\n\n[Verse 3: Frank Ocean]\nOr do you not think so far ahead?\n‘Cause I been thinking ’bout forever (Oooh, oooh)\n\nNo, I don’t like you, I just thought you were cool enough to kick it\nGot a beach house I could sell you in Idaho\nSince you think I don’t love you, I just thought you were cute\nThat’s why I kiss you\nGot a fighter jet, I don’t get to fly it, though\nI’m lyin’ down thinkin’ ’bout you\n\n(Ooh, no, no, no)\nI’ve been thinkin’ ’bout you\n(You know, know, know)\nI’ve been thinkin’ ’bout you\nDo you think about me still?\nDo ya, do ya?\n\nOr do you not think so far ahead? (Ahead)\n‘Cause I been thinking ’bout forever (Oooh, oooh)\nOr do you not think so far ahead? (Ahead)\n‘Cause I been thinking ’bout forever (Oooh, oooh)\n\nYes, of course\nI remember, how could I forget?\nHow you feel\nAnd though you were my first time\nA new feel\nIt won’t ever get old, not in my soul\nNot in my spirit, keep it alive\nWe’ll go down this road\n‘Til it turns from color to black and white\n\nOr do you not think so far ahead? (Ahead)\n‘Cause I been thinking ’bout forever (Oooh, oooh)\nOr do you not think so far ahead? (Ahead)\n‘Cause I been thinking ’bout forever (Oooh, oooh)", "image": "https://images.genius.com/f832da8d956be1aa5e9a0ec763dcd481.716x716x1.jpg"}], "artist": "Twista"}