{"songs": [{"title": "Banger (MOSHPIT)", "album": null, "year": "2013-09-25", "lyrics": "[Background]\nBoom, shakalaka, boom-boom, shakalaka\nBoom, shakalaka, boom-boom, shakalaka\n\n[Chorus]\nBanger! (Figg Side!)\nFool, false on your block\nYou get blook 'n block on your block\nYAWK! (Biddy, bye-bye!)\n\n[Verse 1]\nGrab your brownie, sit the party, shake the party\nBreak the party, murder party, leave the body, tell nobody\nPut it down, Figg Side rip ride\nGrooveline wig line shots fired knock-knock, YAWK!\nYou ain't really 'bout that, you don't want to see a Glock out\nYou a pussy ass nigga, you be hoping for a cop out\nGot a nine and a clip, put a nine on your hip\nKeep talking that shit, knock five on your lip\nG-Ride ski masks and colored rags\nContraband in bags, focused on enemigos in jags\nBig sips out our flasks, we faded who next to get famous\nThem bangers get banging that barrell keep changing like click-click\nShit, I wish a nigga would\nFeeling fucking good, crack and scramble up your hood\nGet it understood, I could have cuz leaking blood\nPersonal as fuck at your door drop you on your rug\n\n[Chorus]\nBanger! (Figg Side!)\nFool, false on your block\nYou get blook 'n block on your block\nYAWK! (Biddy, bye-bye!)\n\n[Verse 2]\nAin't nothing sweet 'bout rumbling with B's\nYou don't need water to travel through the seas\nUnravel the backwoods and crumble up the trees\nNigga, please, your skull missing now homie feel the breeze\nThese bullets burning gon' be hard for you to breathe\nThese bullets burning damn near 'possible to bleed\nOff that alcohol, that nozzle flammable\nBeef I prey on my preyer react like animal\nPussy, I split you like camel toe, my shoelaces matching my flannel\nWe be loading up ammo, y'all be making them channels\nYellow tape by them candles, gang members with killing sprees\nOn our agendas, real niggas fingers on nickel-plated 9 triggers\nFacial expressions say surrender\nWhen that iron enter, lay back recline nigga\nAccess denied nigga, refrigerate Ziploc'n\nAnd all genders, rather Crip or Piru, hoes get it too\n\n[Chorus]\nBanger! (Figg Side!)\nFool, false on your block\nYou get blook 'n block on your block\nYAWK! (Biddy, bye-bye!)\n\n[Bridge]\nY'all really into talking, we with that bullshit\nThem shots is steady sparking, we on that bullshit\nYour hood gon' hear them sirens, we did that bullshit\nMy 50 niggas wilding, we 'bout that bullshit\nYou know Atlanta with that bullshit\nNew York to Miami with that bullshit\nYou know Chicago with that bullshit\nKansas City down to New Orleans with that bullshit\nTexas to Alabama with that bullshit\nBoston and cats from Philly with that bullshit\nArizona to Seattle, they with that bullshit\nWarn your momma California, we 'bout that bullshit\n\n[Chorus]\nBanger! (Figg Side!)\nFool, false on your block\nYou get blook 'n block on your block\nYAWK! (Biddy, bye-bye!)", "image": "https://images.genius.com/ffa5a602af15daeb83b02305e711702b.500x500x1.jpg"}], "artist": "ScHoolboy Q"}