{"songs": [{"title": "School Daze", "album": "The Come Up Vol. 1 Mixtape", "year": "2007-05-04", "lyrics": "[Intro]\nYeah...\nTake ya'll back... to them school days, yeah\nFayettenam, what up, man?\n\n[Verse 1]\nWe came a long way from stick and move\nNiggas skipping school, just to scrap over bullshit\nNigga if you lose, it's a wrap, them hoes clowning\nIt goes down in the lunch room\nI'm tryna spit this game nigga, fuck food\nBust moves to the hallway\nMy niggas posted on the wall, always\nAin't thinking about class, dog, my ass tryna parle\nIf we had this shit our way\nWe be standing here all day\nBut look the principal's coming, give pounds then we all escape\nAll late to class with fake passes\nLiving life in the fast lane, but ain't passing\nThey dreaming, tryna be the next Jay-Z and Dame Dashes\nI ain't even open my book and it's time to change classes\nWalk straight past my ex and don't speak\nIt's all good, I'll probably have a new ex by next week\nI just think, the shit we did was silly, yo, I know that\nBut what I wouldn't give to go back\n\n[Hook]\nYeah, back in the days when I was young, I'm not a kid anymore\nBut some days I sit and wish I was a kid again\nYeah, I sit and wish I was a kid again\nYeah, I sit and wish\n\n[Verse 2]\nYo, I walk another nigga girl to her class, with my hand on her ass\nIf he say 'what up' later, I just laugh\nReal sneaky yo, gotta keep it low\nUp in math, let my nigga read this real freaky note Kiki wrote, yea\nHooping up in P.E. you can't see me on this gym flo'\nBut damn Vanessa booty looking sick up in them gym shorts\nUh, we bag 'em up, ya'll niggas gonna have to wait\nSo they passing hate like, 'Damn I can't wait 'til they graduate.'\nBut some of my niggas will probably never make it\nThe S.A.T. shit man I doubt they ever take it, cause\nInstead of tryna send a nigga to a tutor\nThem guidance counselors tryna introduce us to recruiters, it's a set-up\nMomma cut the light on, time to get up\nMake sure the shirt matching the forces then I head out\nAt the time I thought this shit was so whack\nBut what I wouldn't give to go back\nYeah, hey\n\n[Hook]\nYeah, back in the days when I was young, I'm not a kid anymore\nBut some days I sit and wish I was a kid again\nYeah, I sit and wish I was a kid again\nYeah, I sit and wish\n\n[Verse 3]\nI'm a little grown, but still reminisce\nClose your eyes nigga, you remember this?\nFriday night football game, something I'll forever miss\nAfter parties in the gym, grinding underneath the rim\nYou forgot your school I.D? Fuck, nigga, you ain't gettin' in\nIn the hallways acting like some hoodlums\nSee that scrap? Naw, damn I always miss the good ones\nThem rumors spreading fast with that he say she say\nTwenty people on the phone cause everybody did three-way\nMan we played them girls for the fools, but\nWasn't no ladies like them ladies from other schools\nCause seeing them same old chicks got tired quick\nShe was just fucking my boy, now she all on my dick, gossip, damn\nAnother chick pregnant, another nigga gone\nI reminisce on all the chicks a nigga never bone\nPardon me ya'll I'm just flipping through some Kodaks\nSitting, wishing I could go back\n\n[Hook]\nYeah, back in the days when I was young, I'm not a kid anymore\nBut some days I sit and wish I was a kid again\nYeah, I sit and wish I was a kid again\nYeah, I sit and wish\n\n[Outro]\nYeah, this shit is dedicated to all my niggas man\nR.J., Mike Shaw, Jim Brown, yeah\nB. Nasty, Big Joe, Smitty, what's good? Yeah\nTerry Sanford High School, E. Smith\nClass of 2003, that's me\nI know y'all remember this", "image": "https://images.genius.com/bda451f623edd51bf1dcc17564bd3e70.501x501x1.jpg"}], "artist": "J. Cole"}