{"songs": [{"title": "Killuminati Pt. 2", "album": null, "year": "2013-08-23", "lyrics": "[Intro: Joey Bada$$]\nKilluminati all through your body\nLike a 12 gauge shotty\n\n[Verse 1: Joey Bada$$]\nAnd I'm still a beast with these flows\nFeeling real low my tree self esteem roll\nWe drowning out Atlantis can't overflow beast coast\nBe more specific next time you shoutin' loud a-mi-go\nI am not the star? In fact I plan it all\nFuck what the media write, bitch this is a fire bar\nPlease don't leave your comment if you are not up to par\nNo names, putting you in a verse that's too far\nYou're mundane can't obtain, the knowledge in my brain\nMy set told me light you up so this that propane\nIt's Nathan all I gotta do is just spit a flame\nNo escaping, you in a swimming pool of champagne\nYou set yourself up for that one mane. The king of New York?\nHa! we ain't just gon' let that one hang\nLast nigga got dethroned and you ain't from my zone\nThe rest of the real niggas is dead and gone\n\n[Hook: Joey Bada$$]\nBut fuck it I'm Biggie, I'm L, I'm Pun\nI’m God’s Son, I’m Pac, Guru all in one\nI'm what they predicted before I come\nIn fact I do it all for them\nBut fuck it I'm Biggie, I'm L, I'm Pun\nI’m God’s Son, I’m Pac, Guru all in one\nI'm what they predicted before I come\nIn fact I do it all for them\n\n[Verse 2: Joey Bada$$]\nI'm getting a ugh, I'm getting a ugh from the weak shit\nThat I hear, no lyrical style come near me\nHow they gon' try to compare me to what's clearly\nBarely, not nearly as rare as me\nSwank make hands fold like a rare disease\n\"How thou art write this? Yo, it's scaring me!\"\nI got all these rap niggas fucking fearing me\nHeard they was looking for war but ain't declaring me\nI'm well aware, NY not Delaware\nI'm the real king fella here, you more like Prince of Bel-Air\nI'm clearing the air, might fire at will\nThese rap niggas don't want the static for real\nCuz they lines not adjacent to my spectacular skill\nIf you don't fuck with cinematic stand still\nMy life's a movie on the real, you can get shot with your hands on the wheel\nWith your pants at ya heels\n\n[Hook: Joey Bada$$]\nBut fuck it I'm Biggie, I'm L, I'm Pun\nI’m God’s Son, I’m Pac, Guru all in one\nI'm what they predicted before I come\nIn fact I do it all for them\nBut fuck it I'm Biggie, I'm L, I'm Pun\nI’m God’s Son, I’m Pac, Guru all in one\nI'm what they predicted before I come\nIn fact I do it all for them\n\n[Bridge: Joey Bada$$]\nKilluminati all through your body\nLike a 12 gauge shotty\n\n[Outro: Kirk Knight]\nAnd I'm feeling like the realest motherfucker alive\nAnd I'm feeling like the realest motherfucker alive\nAnd I'm feeling like the realest motherfucker alive\nAnd I'm feeling like the realest motherfucker alive\nAnd I'm feeling like the realest motherfucker alive\nAnd I'm feeling like the, like the, like the\nKilluminati, all through your, all through your, all through your\n\n[Skit: Buckshot]\nI love the competition\nGo against the beast coast?\nI retired that level of it\nAnd now you have to deal with a brother like Joey\nWhich is a 45 magnum with a knife at the tip\nAnd a shotgun at the end", "image": "https://images.genius.com/f0ac6a4effa05f26572426ef74c697f0.500x500x1.jpg"}], "artist": "Joey Bada$$"}