{"songs": [{"title": "Letter 2 My Unborn", "album": "Until the End of Time", "year": "2001-06-05", "lyrics": "[Intro]\nTo my unborn child…\nTo my unborn child\nIn case I don’t make it\nJust remember, Daddy loves you\n\n[Verse 1]\nNow ever since my birth, I've been cursed, since I'm born to wile\nIn case I never get to holla at my unborn child\nMany things learned in prison, blessed and still livin'\nTryna earn every penny that I'm gettin'\nI'm reminiscin' to the beginnin' of my mission\nWhen I was conceived and came to be in this position\nMy mama was a Panther, loud single parent, but she proud\nWhen she witnessed baby boy rip a crowd\nWent to school, but I dropped out and left the house\n‘Cause my mama say I'm good for nothin', so I'm out\nSince I only got one life to live, God forgive me for my sins\nLet me make it and I'll never steal again or deal again\nMy only friend is my misery\nWantin' revenge for the agony they did to me\nSee, my life ain't promised, but it's sure gettin' better\nHope you understand my love letter, to my unborn child\n\n[Hook: Natasha Walker]\nI'm writing you a letter\nThis is to my unborn child\nWanna let you know I love you\nIf you didn't know I feel this way\n‘Cause I think about you every day\nI have so much to say\n\n[Verse 2]\nSeems so complicated to escape fate\nAnd you can never understand 'til we trade places\nTell the world I feel guilty for bein' anxious\nAin't no way in hell that I could ever be a rapist\nIt's hard to face this cold world on a good day\nWhen will they let the little kids in the hood play?\nI got shot five times, but I'm still breathin'\nLiving proof there's a God if you need a reason\nCan I believe in my own fate?\nWill I raise my kids in the right or the wrong way?\nDear Mama, I'm a man now\nI wanna make it on my own, not a handout\nMake way for a whirlwind prophesized\nI wanna go in peace when I gotta die\nOn these cold streets, ain't no love, no mercy and no friends\nIn case you never see my face again, to my unborn child\n\n[Hook: Natasha Walker]\nI'm writing you a letter\nThis is to my unborn child\nWanna let you know I love you\nIf you didn't know I feel this way\n‘Cause I think about you every day\nI have so much to say\n\n[Verse 3]\nDear Lord, can you hear me?\nTell me what to say\nTo my unborn seed in case I pass away\nWill my child get to feel love?\nOr are we all just cursed to be street thugs?\n‘Cause bein' black hurts, and even worse if you speak first\nLivin' my life as an Outlaw – what could be worse?\n‘Cause maybe if I tried to change\nWho'm I kiddin'? I'm a thug 'til I die; I'm a rider, mane\nTouch bases, eat lunch in plush places\nRegular criminal oasis awaits us\nIf there's a ghetto for true thugs, I'll see you there\nAnd I'm sorry for not bein' there\nJust know your daddy was a soldier: Me Against the World\nBless the boys and all my little girls\nTo the Lord: I'm eternal, restin' in peace\nPlease take care of all my seeds, to my unborn child\n\n[Outro]\nPlease take care of all my kids and my unborn child\nTo my unborn child…\nThis letter goes out to my seeds\nThat I might not get to see ‘cause of this lifestyle\nJust know your daddy loved you\nGot nothin' but love for you\nAnd all I wanted was for you to have a better life than I had\n‘Cause I was out there on a 24 hour 365 grind\nWhen you get to be my age, you’ll understand\nJust know I got love for you\nAnd I’ll see you if there’s a ghetto in Heaven\nIf there’s a Ghetto Heaven, I’ll be there waitin' for you\nHeh heh, take care, run wild, but be smart\nFollow the rules of the game\nI know sometimes there’s confusion\nRules of the game is gonna get you through it all day every day\nWatch out for these snakes and fakes\nFriends come a dime-a-dozen\nBe an individual, work hard\nStudy, get your mind sharp, trust nobody", "image": "https://images.genius.com/868229d5110df037ce322d82fa923972.600x600x1.png"}], "artist": "2Pac"}