{"songs": [{"title": "Takin’ Over", "album": null, "year": null, "lyrics": "[Intro]\nLatino hip hop music was once a small scene of street rappers\nAnd a handful of hardcore followers\nThe new wave of artists are hitting the musical scene tonight...\n\n[Verse 1: Big Stalks]\nWhen we come through with the takeover, we make the game over\nI'm from the state of lowriders and street soldier\nWe drop like boulders 'cause we hittin' hard\nEvery single playa hater know just who we are\nWe the homies from the LayLow I-n-c\nPer-petrating motherfuckers gon' remember me\nI don't pretend to be, so don't hate on me\nSnitchin' to the cops 'cause they want to get rid of me\nTa-ta-talking about you murder me\nHomie, I know you heard of me\nCreeping through the dark in the Oldsmobile\nDrive-by shoot to kill, so watch your step\nBig Stalks won't stop, I keep the pussy wet\nBreak bread or ??\n1-8-7 on the motherfuckin' cops\nYeah, the streets are hard\nIf we want it, we get it\nHomie, it's like that\nIf you got it, I'll take it\nHomie, we ain't fake\n\n[Hook: Talbox by DJ AK]\nLay Low Inc. t-t takin' over, we takin' over\nI see you trying hard, 'cause we do it better\nI know what you think, when we coming over (I know what you think)\nBut you better not try to play 'cause the game is over\nWe took it over\n\n[Verse 2: 2Pac]\nYou can't break me, never make me busta soft the beats\nThis Outlaw style, got a brother off the streets\nMiss Delores Tucker sue me, I won't stop\n'Til we get justice for these crooked cops, on my block\nTime Warner full of sissies\nTell 'em all to miss me\nA bunch of hypocrites, whistling Dixie\nGood riddance, 'cause you never should've touched me\nYou cowards knew you couldn't take the pressure, I'ma make you sorry\nTrust me\nDid I cry when they dropped me? (nah), can they stop me? (yeah)\nTryna sell 4 million copies\nIf I wasn't spitting, it'd be prison or death\nThis rap game all we got left\nSo try to comprehend where we coming from\nLife as an Outlaw, ain't meant for everyone\nSo here we come\nRecognize how we organize\nStrategize now we unified brothers on the rise\nAnd we don't stop\n\n[Hook: Talbox by DJ AK]\nWe, t-t takin' over, we takin' over\nI see you trying hard, but we do it better\nI know what you think, when we coming over (I know what you think)\nBut you better not try to play 'cause the game is over\nWe took it over\n\n[Verse 3: Snoop Dogg]\nBigg Di-Dogg, push the big hid-ogg\nYou're hoppin' and poppin', how 'bout you hop up off my bid-alls\nGot, dirt on my pid-aws, I, broke a few lid-aws\nIt, really don't matter 'cause I'm only here to spit on\nAnd get on and shit on niggas\nDo it to 'em D-O-double right on, nigga\nI'm saggin' it, baggin' it, slangin' dubs\nYou motherfuckas think The Wash is all soap and suds?\nWhat's up Cuz?\nIf you tryin' to get a dub sack, page me\nThe hoes say \"Dee Loc, you so crazy\"\nPoppin' that shit, don't faze me\nI need my chips and the dip, it's like gravy\n\n[Verse 4: Dr Dre]\nNow back to the lecture at hand\nPerfection is expected and I'm feeling that demand\nLos Ang', broad day gunnin'\nThat ain't no earthquake, it's just Dre comin'\nIf this shit ain't played, the party ain't bumpin'\nIf I don't show up, the hoes ain't fuckin'\n(Real talk) Cali sunshine, come visit\nJust don't stop at stop signs with bullet holes in it\nAll-Star League, you ridin' benches\nI handles my bidness, fuck fake niggas\nI sell game a quarter million a track\nSnoop and the Good Doc back with a brand-new sack\nShit's wrong, money gone, I'll blast\nOut of town, out of bounds, no pass\nRunnin' up, talkin' shit, get smashed\nShoot first, ask questions last\n\n[Hook: Talbox by DJ AK]\nLay Low Inc. t-t takin' over, we takin' over\nI see you trying hard, but we do it better\nI know what you think, when we coming over (I know what you think)\nBut you better not try to play 'cause the game is over\nWe took it over, took it over, we took it over, t-t-took it over", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}