{"songs": [{"title": "Chloraseptic (Remix)", "album": null, "year": "2018-01-08", "lyrics": "[Intro: 2 Chainz]\n2 Chainz!\nYeah, yeah\n\n[Verse 1: 2 Chainz]\nTake 'em to church, I'm talkin' the tabernacle\nIt's the return of the body snatcher\nWalk in the spot, make my woman smack ya (whoo!)\nIn a fruit fight, I aim at your Adam's apple\nPull up in the candy car, eatin' a candy bar\nAnd my girl eatin' a candy apple\nYeah (mm), I line their ass up (up)\nI aim at their goozer (baow!)\nAll of these stones on my neck, uh\nThey must have looked at Medusa\nPockets Rasputia of course\nI drove some rims to court\nI fucked some twins before\nI had a Benz before, this is the sin report\nThis is the murder, murder, pass the burner, Em (uh)\nYour money shorter than an acronym (ayy)\nBig body when I'm backin' in (whoo!)\nLadi-dadi, got a bunch of bodies\nNiggas fakin', niggas human traffickin' (whoo!)\nI'm on the Act' again, uh\nThis ain't a accident, uh\nKing like Ak-Ron\nI run the trap again, you on the treadmill (treadmill)\nNever Neverland, shit came with a Ferris wheel (goddamn!)\nFerris day off, baby, AR in the same car\nMost of y'all my sons, aww, look at little JR\nF12 same color Kate Moss\nUh, I'm talkin' wristin' the pot\nI'm talkin' this and you not\nI'm talkin' bricks and you not\nI'm talkin' straight up and down, nigga, like 6 o'clock\nThis is the equinox, this what the people want\nSomebody at the door, I heard the speaker knock, uh\n\n[Chorus: PHresher]\nI'm at your throat like Chloraseptic, 'septic\nAnd you got strep, I'm too complex with, 'plex with\nThis shit I wrote is on some next shit, next shit\nI'm at your throat, I'm feelin' reckless, reckless, yeah\n\n[Verse 2: PHresher]\nDo me a favor, don't do me no favors\nThese bitches got flavors\nThey all wanna smoke but ain't doin' no labor\nBut they shoppin' at Raleys, they stingin' like tasers\nAct Hollywood like they play for the Lakers\nThey fly on the latest\nCrocs, alligators, say hi to my haters\nPardon my neighbor\nWe eatin' that chicken, lobster, potatoes\nYou must be sniffin' that yayo\nIf you don't think I'm that nigga\nSwagger on ten since a day old\nIt's a-okay though, whippin' up whip like it's mayo\nEvery track is a K.O., technical K.O. \nGo off your head like I'm Ayo\nOut of this world, talkin' NATO\nIt's 'cause of jail, ho, don't be an A-hole\n'Cause I got shooters that shoot when I say so (lay low!)\nWanna be in my shoes, you ain't paid no dues\nReal nigga, you ain't break no rules (hell yeah!)\nHigh school, niggas ate yo' food\nMight dumb it down a little, but I ain't no fool (hell yeah!)\nNiggas hate every day, B (yeah)\nShit is O.C. lately (yeah)\nGotta break 'em off with these Dre beats (yeah)\nOr I might go crazy (hell yeah!)\nThese niggas too goddamn lazy (too lazy)\nDon't ever, ever, ever try to play me (to play me)\nLil' shawty now comin' from BK (BK)\nBut I'm tryna come up like JAY-Z (like JAY-Z)\nNothin' but love for my idols (love for my idols)\nI feel entitled to titles (to titles)\nFuck it, man, I want the title (I want the title)\nSubmission, they goin' all viral\n\n[Chorus: PHresher]\nLike Chloraseptic, 'septic\nAnd you got strep, I'm too complex with, 'plex with\nThis shit I wrote is on some next shit, next shit\nI'm at your throat, I'm feelin' reckless, reckless, yeah (hell yeah)\n\n[Verse 3: Eminem]\nBin Laden with a pen, bodyin' again\nI begin slaughterin' your men, prolly shoulda been\nAli or the Svengali embodiment of sin\nLike a Saudi in the Taliban plotting an event\nIn the lobby of the Intercontinental with an obvious intent\nAnd I would not even relent\nUp on a little like Osama with a bomb under the bin\nAnd down the middle of the Pentagon\nAnd hit a kindergartener with a rental (stop!)\nBack and forth, back and forth\nLike Jack Kevorkian's ass to court\n\"Rap mature! Why can't you be like Macklemore?\" (huh?)\n\"Why you always gotta smack a whore?\" (huh?)\nIt's likely the psychiatric ward's a last resort (huh?)\nSomething's gotta give, that's for sure\nYet you keep comin' back for more\nNot as raw as I was, “'Walk On Water' sucks”\nBitch, suck my dick!\nY'all saw the tracklist and had a fit 'fore you heard it\nSo you formed your verdict\nWhile you sat with your arms crossed\nDid your little reaction videos and talked over songs (chill!)\nNah dog, y'all sayin' I lost it?\nYour fuckin' marbles are gone (wait, Em!)\nBut nowadays, every flow, every cadence sound the same (skrrt)\nBrain's a powder keg, I draw inspiration outta hate\nReal pain in the paper, I don't trace\nBut if I look strange and outta place\nIt's 'cause I'm an alien, that's why I write 'til the page is outta space\nYeah, from 7 Mile in Novara\nTo \"How can I be down?\", all of us tryna pile in the car (yeah!)\nWe shot for the stars (yeah!)\n'Cause we only got so much time in this world (yeah!)\nSo rewind it to your high school dance to the night before\nIf you think you're promised tomorrow (yeah!)\nNow I'm 'bout to fool again\nThis tune is sick, it's luminous, the moon is lit\nA freakin' lunatic, a human computer chip\nAnd I'm soon to stick a broom in the uterus of your Hooters chick\nIf I was you, I wouldn't do nothin' stupid due to the mood I'm in\nI'm losin' it, you get chewed like a Junior Mint\nShow me who to rip, it's time for you to get screwed\nEmpty the lubricant and put super glue in it (woo!)\nHow many fuckin' rappers did I go through?\nDispel doubt, but you won't admit I smoked\nAnd you was spellbound, hellbound in my snowsuit\nBut am I s'posed to sound like everything else out?\n'Cause I don't get compared to it, only myself now\nAnd I can see the fair-weather fans and sales down\nBut the only way I care is if I let myself down\nBut what the fuck have I woke to?\nTime to eat the vocals and shit out Pro Tools\nI know you still want me to ill out, don't you?\nHopin' the old Slim's gonna spill out, open\nFire on your whole camp with this spit, I roast you\nSo chill out, no, you\nHoes couldn't roast me with the shit I wrote you\nThen I took a stand, went at Tan-Face and practically cut my motherfuckin' fan base in half and still outsold you\nYou just called my shit trash?\nThank God, I rap better when the odds are stacked\n\"Revival's wack, I don't like the 'Zombie' track\nAnd when he's talkin' that garbage psychotic crap\nWhere's your content at?\nWhat's with all the conscious rap?\nP!nk, Beyoncé this and Kehlani that\" (yeah!)\nI just add it to the fuel in my rocket pack\n'Til I'm ready to respond, then I'ma launch it at 'em\nIdiotic from the fuckin' embryonic sac\nTo the body bag, I'll be back\nAnd when I am, I'll be at your fuckin' throat like—\n\n[Outro: PHresher]\nLike Chloraseptic", "image": "https://images.genius.com/837b5030b267031d499a2eba12d305ac.1000x1000x1.png"}], "artist": "Eminem"}