{"songs": [{"title": "Save Us", "album": "Starvation 3 ", "year": "2014-01-18", "lyrics": "[Intro]\nYou can’t change the world until you change yourself\nGotta start somewhere\nSave us\n\n[Verse 1]\nThere’s a war going on outside, it’s devastating\nThe hoods segregated by cliques and affiliations\nCity full of satans who facing no limitations\nTurning on the news and it’s poison throughout the nation\nKids being kidnapped, teens getting shot up\nMurder rate higher, continue as bodies pop up\nStreets done got worser, the world done got colder\nMany crying out and they could really use a shoulder\nAmen amen, live a life full of sin\nI inspire the people that boost desire within\nGot a message for students, teachers won’t let me attend\nPaint a horrible image of me, I’m quick to defend\nWhat the fuck am I to do cus I’m simply speakin truth?\nWe gotta guard the youth, no excuses to be in school\nBabies out in Africa prayin for a pair of shoes\nMore food or finer things they never knew\nLord knows I won’t change, life’s better\nGod bless the soul and the spirits of Mandela\nLet’s do it for a cause, we are grateful beyond measures\nMan with a powerful message behind lectures\nDamn\nWe're living in hell, good people\nWe're surrounded by pure evil\nAnd it's easy to see we need Jesus\nPlease…\n\n[Hook]\nSave us\nWon’t you help me? Oh\nSave us\nOh oh oh oh\nSave us\nSave my… baby\nSave us\nHelp me… save my… baby\nSave us\nSave you\n\n[Verse 2]\nWe all soul searching, we destined to find purpose\nLiving in a world with the worse and the non-perfect\nBut women selling piece of their bodies and call it working\nAnd little girls worshiping strippers, getting into twerking\nThese are my assumptions, never cast judgment\nYoungins on the block and they focused on mild subjects\nTrynna please others perspectives that’s in the public\nToo opinionated, I pray that we reinstated\nI wanna be that voice and that pain of them crying babies\nI wanna be that little bit of hope that you find daily\nI know I’m chosen, Lord knows it, my flow golden\nIt's hell here, Section 8’s and welfares\nDrug addicts and bad tragic, so many tears\nBlack hearses, it’s gotten worser throughout the years\nPlease save us, I’m still prayin, God’s will\nInnocence being killed, exactly what I feel\nLord\nAnd this can’t be life\nBob Marley never settled, he would fight for the right\nHands up if you believe you got a purpose in life\nShit\nWelcome to hell, good people\nWe surrounded by pure evil\nPlease keep us\nAnd it's easy to see we need Jesus\nPlease\n\n[Hook]\n\nSave us\nWon’t you help me? Oh\nSave us\nOh oh oh oh\nSave us\nSave my… baby\nSave us\nHelp me… save my… baby\nSave us\nSave you](4832732)\n\n\n[Verse 3]\nSave us from the killers, the demons and cold hearted\nSave us from ourselves, what we listen but disregard it\nKeeping hope alive for the people, them ones who started\nTryna change the world for them legends in which departed\nHow dare you criticize me with lies that you assume?\nBad judge of characters, school in Syracuse\nI am the ghetto, I am the struggle, I am the hunger\nI am the pain, I do inspire, don’t have to wonder\nLord\n\n[Outro]\nSave\nOh, we’ve got to save the babies\nYour babies, my babies, our babies\nOne by one\nOh it’s getting serious, son\nIt’s getting serious\nOh yes it is\nOh we got to do something about it\nWe got to do more than just talk about it\n\nSave us (x4)\nHelp me\nSave us\nWill you help me?\nSave us\nSave… my babies\nSave my… son\nSave my… save my baby!", "image": "https://images.genius.com/155dcdf9038945b022391808dd3f0c60.500x500x1.jpg"}], "artist": "Ace Hood"}