{"songs": [{"title": "A Million More", "album": "The Bar Exam", "year": "2007-04-07", "lyrics": "[Intro: Royce Da 5'9\" & DJ Premier]\nStatik Selektah on the wheels of steel, gettin' it in!\nAy yo Miko, I need you to do me a favor my nigga (a million)\nI need you to reach down in yo pants pocket (a million)\nPut out like a million dollars to put up (a million) against these little niggas\nMothafuckas see you goin' for shit then (a million) start askin themselves a million and one questions like\n\"Is he gon' ever fall off?\"\n\"Okay, I'm reloaded!\"\nNo\n\n[Verse]\nLot of speculation on the moneys I made, honeys I've slaved\nHow is he for real? Is that nigga really paid?\nHustlaz that I've met, or dealed with direct\nIs it true he never sold dope, but he still get respect? (Yes!)\nWhat he doin' in AC with Miko, that boy a pimp\nHow he make his money? Is he really worth 40 Ms?\nYes, to the questions, now give me a minute to rest\nWhile you lookin' at the ice cold, spinnin' on my chest\nUgh, nice chain, does he really have a Range?\nThat's MBs, but in the D, he's the hottest thing\nYou never seen me drive, cause a couple of DUIs\nBut I got a driver, holla at me if you need a ride (Holla at me!)\nWhen I'm in the D, I'm in the B-M\nLeanin' to the anthem, on my way to Phoenix to the Phantom\nI been spittin' shits since '89\nWhat's up with 50? Is he interested in him? Would Shady mind?\nI saw him walkin' up in Daddy's house, what's up with that?\nIf that nigga writin' for Diddy, Puff is back (a million)\nQuestions niggas ask after I made (a million)\nTommy Boy, Sony Records, gave me (a million)\nThat's why every time you see me I'm lookin' like (a million)\nBucks no matter what, no matter the L's, wins, sales, spins\nI'mma hustle on like a sales, man\nAs long as I'm hotter than hell, then\nI'mma stay afloat like a whale's, fin\nWhat's up with him and Premier? Do they really got a group?\nAre they tryin' to replace Gang Starr? What are they tryin' to prove?\nI seen him on Beef 2, was he really tellin' the truth?\nDid he really set up a truce to that thing he developed with Proof?\nI heard he was ballin' out, I heard he just bought a house\nAnd this one is much bigger, cause this one is farther out\nWhat's up with him and Kelis? Is he still cool with her best friend?\n\"That nigga Nas really tryna sign him?\" Is the question\nUgh, he fire, you really can't deny him\nThe only nigga rhymin' harder than Holmes retired\nPut him up against any nigga that's out today (What about 'em?)\nDon't say they names. I already know who you about to say\n(A million) Niggas you think you fuck wit' me 'til\n(A million) Dollars on the line, and then you hear\n(A million) Excuses, I am the truth, it's\n(A million) Ways that I could put you away, Jay!\n\n[Interlude: Jay Z]\nLot of speculation on the moneys I've made, honeys I've slaved\nHow is he for real, is that nigga really paid (Yup!)", "image": "https://images.genius.com/4f966eb73a81b58069fb8aff648de307.700x700x1.jpg"}], "artist": "Royce da 5'9'’"}