{"songs": [{"title": "So You Want to Be a Gangster", "album": "Shorty the Pimp", "year": "1991-12-31", "lyrics": "[Verse 1]\nSo you want to be a gangster, all that shit\nSmoke any motherfucker, don't even trip\nYou be hard as hell, take whatever you want\nPunk suckers wanna front, they get done\n'Cause you a gangster—nothin' more, nothin' less\nPut my boy to the test and catch one in your chest\nSince he was young, homeboy won't back down\n'Cause real gangsters always hold that frown\nUntil you lose control, then you sell your soul\nTo the devil, motherfucker, 'cause you're way too cold\nAnd all the people hide and just run inside\n'Cause you keep usin' yo' gat, committin' homicide\nBoy, I tell ya, life is way too short\nAnother brother just got smoked\nAnd you killed him—ain't that a bitch?\n'Cause it really ain't shit\n\n[Hook]\n(Gangsta, gangsta)\nShoot 'em up! (gangsters)\nThat ain't cool (gangsters)\nAin't that a bitch? (gangsters)\nShoot 'em up (gangsters)\nThat ain't cool (gangsters)\n\n[Verse 2]\nLet me tell you somethin', youngster, you got it all wrong\nGangsters don't live that long\nI had gangster partners get they heads tore off\nFor some of that gangster shit, caught in the cross\nYou want stripes, take yo' ass to the service\n'Cause when it's on, ain't no time to get nervous\nPull the trigger—yeah, you did it\nYou's a gangster and I got to admit it\nBut you's a youngbuck, you ain't learned yet\nKillin' don't make you a vet\nGet out the fast line, stick with the homeboys\nReady-made gangster get gone, boy\n'Cause where I'm from it's the same ol' shit\nYou call them shots when you're down with the click\nNiggas dyin' everyday, but that's a black thang\nYou either sell dope or you gangbang\nBut you got the biggest heart in the click, man\nYou did a murder, and now you're a hitman\nAll your homies tryin' to tell you, that ain't cool\nPlayin' shoot 'em up like a fuckin fool\nBut you's a gangster, one they can't destroy\nDon't even give a fuck about your boys\nYou go for self, you wanna be on top?\nFucked around and now your brother's shot\n\n[Hook]\n(Gangsta)\nShoot 'em up! (gangsters)\nThat ain't cool (gangsters)\nAin't that a bitch? (gangsters)\nShoot 'em up (gangsters)\nThat ain't cool (gangsters)", "image": "https://images.genius.com/f82c145afb5d000ecf7dbe3e66f99782.1000x992x1.jpg"}], "artist": "Too $hort"}