{"songs": [{"title": "LEGENDARY", "album": "ALL-AMERIKKKAN BADA$$", "year": "2017-04-07", "lyrics": "[Intro: Joey Bada$$ & J. Cole]\nYeah, uh\nYeah\nYeah, uh\nYeah\n\n[Verse 1: Joey Bada$$]\nThis is legendary\nAlways been my mission, never secondary\nGettin' better every January, it's very scary\nThey gon' recognize eventually, I take it if they don't give it to me\nSwear all of it was written for me (yep, yep)\nBy a higher conscious spiritually (up, up)\nUp and away, jump on a plane, get on my wave right now\nI want you believe not only in me, but have some faith in yourself\nI wish you peace and good health, happiness and some wealth\nI threw a coin in the well, 'cause I was feelin' so well\nA token of how I felt, never heard if it fell\nNot a noise, not a sound, still no reason to doubt\nQuality what I sell, quantity in the sales\nQuantum physics myself, count a million atoms of cells\nThis life I'm livin' it out, damn right, my vision is now\nDon't let the prisoner cell build a strut to break out\nMy brothers at the brick house, the undercovers stakeout\nCan't you see it's a trap? The type of shit I think 'bout\nI sensed they needed my help, that's why I had to reach out\nWhat you think I do it for? My brothers under a spell\nIt's clear we livin' in hell, the life of a black male\nRight out the womb, you come out, and it's a bunch of blackmail\nJust waitin' for you to fail, a special room in the jail\nWith your name, a number on it so you property now\nI see it properly now, it's what the poverty 'bout\nIt's all a game of Monopoly, tryna cop me a house\nAn elephant in the room until I fit in my tomb\nAnd introduced to my doom, they say the end comin' soon\n\n[Chorus: Joey Bada$$]\nLegends, they never die\nThe niggas only multiply\nSo put your fire up in the sky\n'Cause they won't ever kill the light\nThey say the legends, they never die\nThe niggas only multiply\nSo put your fire up in the sky\n'Cause they won't ever kill the light\n\n[Bridge: Joey Bada$$]\nTables keep turning, which way do I go?\nA fire's burning inside of my soul\nTables keep turning, which way do I go?\nA fire's burning inside my control\n\n[Verse 2: J. Cole]\nLook, ready for whatever comes\nI hope for the best, I taste the peace and pray it never leave my tongue\nBut yet, before long, the feelings done\nPerhaps I was foolish, just like the boy that prays to only see the sun\nMaybe, life happens like tides\nOne minute you're low and feelin' shallow, then all of a sudden you rise\nJust, ride the wave, I say to myself\nFind a way, the weight of my wealth\nIt's honestly a lot to bear\nI play the game of stackin' knowin' that I ought to share\nHow much does a man need? How much can he hoard before his greed?\nHow can a rich father teach humbleness to his seed?\nJust questions, the stubborn all get taught tough lessons\nI look at all I got like, \"What's missin'?\"\nGod is my only guess, 'cause yes, faith relieve the stress\nI find peace again when I find Him and see I'm blessed\nReal blessed, life has always got me wonderin'\n(Wondering, wondering) Am I doin' it right?\nAm I hurtin' myself?\nAm I wrongin' the ones that love me the most?\nWhat a burden to have\nThat ain't no way to live\nOr maybe it is\nWell, maybe it is\n\n[Bridge: Joey Bada$$]\nTables keep turning, which way do I go?\nA fire's burning inside of my soul\nTables keep turning, which way do I go?\nA fire's burning inside my control\n\n[Chorus: Joey Bada$$]\nLegends, they never die\nThe niggas only multiply\nSo put your fire up in sky\n'Cause they won't ever kill the light\nThey say the legends, they never die\nThe niggas only multiply\nSo put your fire up in sky\n'Cause they won't ever kill the light\n\n[Outro: Joey Bada$$]\nThis is legendary, it's never secondary\nI'm getting better every January\nThe idea of it alone is very scary\nI kill my enemies by any means necessary\nI said, this is legendary, it's never secondary\nGetting better every January\nThe idea of it alone is very scary\nI kill my enemies by any means necessary", "image": "https://images.genius.com/84b143545e0338f7b7459bb9ab8ecca4.630x630x1.jpg"}], "artist": "Joey Bada$$"}