{"songs": [{"title": "So Many Tears (OG)", "album": null, "year": null, "lyrics": "[Verse 1: 2Pac]\nBack in elementary, I thrived on misery\nLeft me alone I grew up amongst a dyin breed\nInside my mind couldn't find a place to rest\nUntil I got that Thug Life tatted on my chest\nTell me can you feel me? I'm not livin in the past, you wanna last?\nBe the first to blast, remember Kato\nNo longer with us he's deceased\nCall on the sirens, seen him murdered in the streets\nNow rest in peace\nIs there heaven for a G? Remember me\nSo many homies in the cemetery, shed so many tears\n\n[Hook with Stretch doing backing vocals]\nAhh, I suffered through the years, and shed so many tears..\nLord, I lost so many peers, and shed so many tears\n\n[Verse 2: Stretch]\nWhy would a guy kill for cash?\nBut when a nigga's desperate make way for the pump blast\nOn the news prime time, because its black on black crime\nSo I'll never stay in your mind\nI just dash gotta get the cash all day\nWent from struggling straight to bubbling\nNow I pray that a nigga remains calm\nOh god will I bust?\nWill I fall off or will I still keep kicking dust\nTrust, I get down from the ground\nPlus I pack a pound\nPerpetrators getting shot down\nWe suffered through the years, shed so many tears\nPouring out respect for the homies when we crack beers\nMy fears faded\nA drug related death will make a nigga have to take a deep breath\nAnd bust a left down memory lane\nWhere my nigga caught a teflon slug to the brain\nAnd yo, shed so many tears\n\n[Verse 3: 2Pac]\nNow that I'm strugglin in this business, by any means\nLabel me greedy gettin green, but seldom seen\nAnd fuck the world cause I'm cursed, I'm havin visions\nOf leavin here in a hearse, God can you feel me?\nTake me away from all the pressure, and all the pain\nShow me some happiness again, I'm goin blind\nI spend my time in this cell, ain't livin well\nI know my destiny is Hell, where did I fail?\nMy life is in denial, and when I die\nBaptized in eternal fire, shed so many tears\n\n[Hook with Stretch doing backing vocals]\nLord, I suffered through the years, and shed so many tears..\nLord, I lost so many peers, and shed so many tears\n\n[Verse 4: 2Pac]\nNow I'm lost and I'm weary, so many tears\nI'm suicidal, so don't stand near me\nMy every move is a calculated step, to bring me closer\nTo embrace an early death, now there's nothin left\nThere was no mercy on the streets, I couldn't rest\nI'm barely standin, 'bout to go to pieces, screamin peace\nAnd though my soul was deleted, I couldn't see it\nI had my mind full of demons tryin to break free\nThey planted seeds and they hatched, sparkin the flame\nInside my brain like a match, such a dirty game\nNo memories, just a misery\nPaintin a picture of my enemies killin me, in my sleep\nWill I survive till the mo'nin, to see the sun\nPlease Lord forgive me for my sins, cause here I come...\n\n[Hook with Stretch doing backing vocals]\nLord, I suffered through the years (God) and shed so many tears..\nGod, I lost so many peers, and shed so many tears\n\n[Verse 5: 2Pac]\nLord knows I.. tried, been a witness to homicide\nSeen drivebys takin lives, little kids die\nWonder why as I walk by\nBroken-hearted as I glance at the chalk line, gettin high\nThis ain't the life for me, I wanna change\nBut ain't no future right for me, I'm stuck in the game\nI'm trapped inside a maze\nSee this Tanqueray influenced me to gettin crazy\nDisillusioned lately, I've been really wantin babies\nSo I could see a part of me that wasn't always shady\nDon't trust my lady, cause she's a product of this poison\nI'm hearin noises, think she fuckin all my boys, can't take no more\nI'm fallin to the floor; beggin for the Lord to let me in\nTo Heaven's door -- shed so many tears\n(Dear God, please let me in)\n\n[Final Hook]\nLord, I've lost so many years, and shed so many tears..\nI lost so many peers, and shed so many tears\nLord, I suffered through the years, and shed so many tears..\nGod, I lost so many peers, and shed so many tears", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}