{"songs": [{"title": "Freaky Thangs", "album": "Word of Mouf", "year": null, "lyrics": "[Intro: Faizon Love]\nIt's two a.m. in the morning and its uhh\nLight showers and you're probably hookin up with that girl\nThat's been, two-wayin you all week\nHer baby daddy's out of town so uhh, you can fuck around\nIt's okay to check in that Motel 6\n$59.95, not a cent more for that dirty-ass ho, yeah\nStop by that convenience store and pick up them rubbers--Magnum, I hope\nThis is Faizon Love and uhh, I love hoes\nI just don't pay 'em\n\n[Hook: Jagged Edge]\nCut up! Know we like that, get that cut up\nFreaky thangs, we be bout 'em\nGet that cut up! Oh-whooooooo, cut up\nFreaky thangs, we be bout 'em\n\n[Ludacris]\nI'm kinda hopin that maybe you wanna kick it in the L.A.C\nSo later on we'll be rollin'\nDrop tops, I'm hittin' yo' hot spots, I'm top notch\nMy niggas never listen but I told 'em\nWhen I catch you at the game runnin game at the A.U.C\nThen later on we'd be bonin'\nFat cats, I'm ready to tap that, so back that\nNo wonder why you wakin' up swollen\n\n[Twista]\nI'm feelin you Luda', smokin my buddha, coochie recruiter\nComin at the fatty in a platinum Caddy so back it up fast\nHit it a hour and a half, watch the spectacular splash\nOn the back and leave it drippin down the crack of her ass\nCall me Mr. Magilla-cutty, chasin' booty soft as silly putty\nKilla for money, still a thug get bump\nFrom slow pokin, to locomotion, hittin bunnies, for threesomes getcha buddy\nWhen I'm feelin scummy I love to cut\n\n[Ludacris]\nThick skin so, butter soft I'm rippin the buttons off yo' blouse\nSmell the aroma of a dingaling king Ludacris when I'm in yo' house\nCheck the ratio of men to women and women to men when down south\nHot fellatio, hot jalapenos, holla while they in yo' mouth\nSo we love that c-c-c-c\n\n[Hook: Jagged Edge]\nCut up! Know we like that, get that cut up\nFreaky thangs, we be bout 'em\nGet that cut up! Oh-whooooooo, cut up\nFreaky thangs, we be bout 'em\n\n[Twista]\nNow I got the feelin' we can cut the hell out each other\nAnd I hope we be the same thang - freaks\nWe can get the mattress goin 'eh-err, eh-err'\nHandlin' business while I bang bang - skeet\nWash the dick off and kick off another session again\nI can break 'em off in the shower, kitchen floor or the outdoors\nThe pieces from the East is the shit\nAnd the flesh in the West is the best\nBut Twista love them Chicago and South hoes\n\n[Ludacris]\nCome up out yo' negligee, freak 'em on a regular day\nCum six times, but it's seven today\nLudacris in the back of your Cheverolet\nAhh, ahh! What's my name?\nSo magical I come and touch the game\nYou motherfuckers really lust to gain\nNothin' but hatin and a look of disgust\nAlways a must, stay \"Adrenaline Rush\"\nWonderin why they don't be bustin' the same\n\n[Twista]\nI'm clutchin my thang\nStuffin in it, strokin it down, beat the stuff up\nUh-uh shorty, don't run from it\nShe give me the booty I'm breakin' it off\nI can tell her style by the way that she walks\nFatty flickin' like it was dubs on it\nPeep how this player got skills, get 'em out the gator high heels\nPullin' rubbers and swishers up out your Prada bag\nWanna smoke 'dro I got a bag, take a proper drag before I tap it\nI love the chicks that got a lotta ass, so we love that c-c-c-c\n\n[Hook: Jagged Edge]\nCut up! Know we like that, get that cut up\nFreaky thangs, we be bout 'em\nGet that cut up! Oh-whooooooo, cut up\nFreaky thangs, we be bout 'em\n\n[Ludacris]\nBubble, bubble, bubbles is in the bathtub\nMakin' you stutter from the b-body butters and backrubs\nIt's killin me thinkin about the bottles that pop\nThe models that swallow willin', up under my pillow stayin strapped up\nIf it tickles in the middle from Mr. Pickles you try to escape\nSo give me the rope you gettin' wrapped up\nRooty tooty so fruity and fresh, I'm fresh and fruity\nYa duty's to figure the booty's gettin slapped up\n\n[Twista]\nI love them chicks that be thick as a loaf of bread\nLong as I can still grab her legs, and push 'em up by her head\nHow I dip up in it we can make a video\nBut I got the radio bumpin Jagged Edge by the bed\nWhen you wanna get up witcha cutty buddy\nCome on and dip off through the hideout with Twist'\nBut after we do what we gon' do get ya purse and get together\nBecause now you gots to ride out, bitch\n\n[Ludacris]\nOh 'Cris, can you do it again, that's what they askin' me\nHit skins, causin' catastrophes\nGet pinned, by me and my family\nSip gin, fulfillin' your fantasies\nIn your condition I'm wishin you'll take a lickin'\nAnd keep on tickin' from thicker thighs\nFinger lickin' never get sick and tired, just take a look in her eyes\nAnd you can tell she's a figure five, so we love that c-c-c-c\n\n[Hook: Jagged Edge]\nCut up! Know we like that, get that cut up\nFreaky thangs, we be bout 'em\nGet that cut up! Oh-whooooooo, cut up\nFreaky thangs, we be bout 'em\n\n[Jagged Edge]\nCut up, gettin brains, in the Range\nWe love to cut up cause we like them freaky thangs\nI like it when you let me try, anythang\nCause girl I ain't got nothin but time\nLet a nigga get a little cut up girl\nCut up, gettin brains, in the Range\nWe love to cut up cause we like them freaky thangs\nI like it when you let me try, anythang\nCause girl I ain't got nothin but time\nLet a nigga get a little cut up girl\n\n[4-Ize]\nI come from the eighth planet in the 19th galaxy\nWhere the royal penis is clean, yo' majesty\nCan it be, Sheila E, Apollonia, Vanity, all mad at me?\nI'm the Prince dick of insanity\nI'm good lovin, body-rockin\nKnockin boots all night long, we not stoppin\nI don't care if the kids watchin\nI stir it like motherfuckin coffee and brown sugar\nGirls dem sugar\nWorld class lover, Kama sutra\nPorno music producer\nTallywhacker is a rock hard stormtrooper\nWith a purple helmet, made for crushin pink cookies\nGoonie goo-goo, we cut bigfoots and wookies\nAnd fat women, because they need love too\nSo go on big girl, whatchu gon' do?", "image": "https://images.genius.com/6be5b941352dc17a593995dffd367cec.1000x1000x1.jpg"}], "artist": "Ludacris"}