{"songs": [{"title": "Boyz 2 Menace", "album": "Dedication 6", "year": "2017-12-25", "lyrics": "[Intro: Gudda Gudda]\nTake that shit off at the front\nGudda! Lord\nUh-oh\n\n[Verse 1: Gudda Gudda & (Lil Wayne)]\nSleep on me, I hope you die in your sleep\nNo one's defiant as me\nI know my worth, so when you pay me\nJust know that I am not cheap (I am not cheap)\nOn the road to riches\nTappin' my horn, so watch for the beep (watch for the beep)\nRippin' this shit to pieces\nNo, I will not look out for the beat\nStarted out on the block\nGot on my feet and rose to the top\nI'm the cleanup man with the mop\n50 shots disfigured his top, yes (disfigured)\nI come from the city of God (God)\nI walk around in the city like God (God)\nMade it out and still come back\nSomebody, please tell me, what are the odds?\nOn this mic I am a wizard, but this is not Oz\nCold but hot, I can turn the summer to fall\nI'm sicker than y'all\nDon't talk to me unless you talkin' 'bout paper\nI'm buyin' some acres, no time for a neighbor\nI'm from New Orleans, yes, I am a gator\nI’ll do you a favor, and not do you a favor\n'Cause if I do you a favor\nAnd you don't come back with that paper\nI'ma have to lay hands on you\nLike I'm givin' you prayer\nEastside, we ain't playin' it fair\nYou ever heard of the tortoise and hare?\nI'm switchin' the gear\nStarted off in the back, bitch\nBut now I'm winnin', it's clear\nNigga, I'm here\nGudda!\n\n[Interlude: Lil Wayne]\nFor real\n(Blows smoke)\n\n[Verse 2: Lil Wayne]\nI got my married hoes on single drugs\nGot my fattest hoes gettin' finger fucked\nAnd my trashiest hoes is clean as fuck\nAnd my nastiest hoes is neat as fuck\nTake your shoes off before you walk inside\nTake your shoes off before you cross the line\nI snoozed off on Father Time\nGot my goons to go kidnap Daughter Time\nCome to wet the party up, and whoever in it\nGot one gun that shoot for seven minutes\nI'm done shitting, niggas never spit it\nI'm high class, niggas' elementary\nRepetition, that's the definition\nI'm a Hot Boy under air conditionin'\nShoot the gun with the left arm limpin'\nGeorge Jefferson in all seven minutes\nGot a hot girl off television\nWith a very sticky unhairy kitty\nIn the right position, screamin' \"You're consistent\"\nI sit there and listen like we talkin' business\nI don't need her out here filmin' niggas\nI'd really rather have her steal from niggas\nI really travel like a pilgrim, nigga\nKush loud as Fred screamin' \"Wilma!\", nigga\nI've been takin' time out to count the bands\nBreak a promise in the promised land\nGoing zagga zow off of zagga xans\nFrom the middleman to the Macho Man\nI've been talkin' shit up in Diddy house\nWent to Disneyland, talked to Mickey Mouse\nThen I figured out how to figure out\nWhat I was figurin' out, you figure it out\nGot a trigger man with an extra hand\nMy bitches sleep by my bitch's house\nSo every party is a slumber party\nSky is the limit, head in the clouds\nWhile you runnin' round, I'ma run it up\nYou dumb it down, I ain't dumb enough\nI hit the courtroom and stunk it up\nHigh comin' down, plug comin' up\nYou gon' hold me down, you gon' hold me up\nYou don't know me, but you know what's up\nAnd the coke was cut with some extra coke\nShowed her more than love, she just shoulder-shrugged\nShe don't know it's love, it's not important love\nAs long as we can keep extortin' the plug\nJust let him bleed and ignore the blood\nJust let him be and ignore the buzz\nPour it up, catch a sugar rush\nChopper full of rust, but it still bust\nBust good as fuck, every bullet struck\nLike a hundred holes, got a hole-in-one\nSafe full as fuck, money full of dust\nAnd I'm pulling up in that \"What the fuck?\"\nThat's a muscle car, got me lookin' buff\nIf you look enough, you a mussel, punk\nThat's a Bugatti on steroids\nBugatti on Chevron\nAll-white like an Altoid\nAll these rings on, call me Bellboy\nFrom the Teflon to the Kevlar\nDon't mean shit when your head off\nMake the top dog jump dead off\nThen we keep his head for a memoir\nI sped off with the head off\nGoin' big Bruno on Mars\nSippin' Lone Star, turn a pornstar\nTo a known star with a phone call\n\n[Bridge]\nHold up; murky, murky water, yeah\nPurple, purple rivers, yeah\nFloatin' purple ribbons, yeah\nI'm cursed, but still religious, damn\nI've been poppin' 10s, yeah\n'Cause my bitch pop all the 20s, damn\nWhy you hatin' on the skinnys, damn\nI met Satan, he was chillin', hold up\n\n[Outro]\nMurky, murky water\nPurple, purple rivers\nFloatin' purple ribbons\nI'm cursed but still religious\nDamn\nTake your clothes off bitch\nCall your road dog, bitch\nI feel like O-Dog, bitch\nBoyz 2 Menace", "image": "https://images.genius.com/380dd8ad2dd34e87e19877a3ba6ee494.598x598x1.jpg"}], "artist": "Lil Wayne"}