{"songs": [{"title": "Insult To Injury", "album": null, "year": "2010-07-01", "lyrics": "[Verse 1]\nI'm like a white Michael Vick, psycho enough to stick\nMichael J. Fox in a microwave with a Rott (Ell-ell-elle)\nI might make a little Alizé with a side of NyQuil\nAnd ride a motorcycle right through the side of my high school\nSatan's disciple with a sniper rifle\nAnd a knife and a white diaper\nLiable to shit on you while I snipe you\nSo dope he gets off opiates\nWhat an appropriate way to start off his day\nHe may just smart off to Dre\nHe may be hard to contain\n‘Cause his rage is so hard to gauge\nSee, Hannibal ate his face, and met Jason, gnawed off his leg\nAmazin' hard-on for razors and blades\nAnd anything sharp, even poisonous darts\nIt all plays a major part of his game\nHoly water won't ward him off, crucifixes won't do the trick\nHe's so sick, it's ridiculous\nSawed the crazy part off his brain, he's still insane\nWhy's there bloodstains on his carpet, mane?\nThere's some crazy shit goin' on in Shady's apartment again (woosh)\n\n[Verse 2]\nNewsflash, I'm still trash\nThem pills shoulda killed my ass\nBut they didn't; they just made me stronger\nIt's like they rebuilt my ass\nLike the Six Million Dollar Man after the crash\nIt's Aftermath, bitch! And my milk glass is still half-empty\nYeah, tempt me, Hell isn't enough\nThey need to invent somewhere new to send me\nAs sick as I'm getting\nThey'll stick me in a conventional oven\nWith a rotisserie setting and won't even notice me sweating\nShit, I done made a verse, said some foul shit\nTryna go back fix it, fucked around, and just made it worse\nYeah, I'm back, looking no worse for wear\nGot these haters mad enough to rip off their hair\nAnd start punchin' the air\nFall the fuck out, spill your lunch in the chair (eww)\n\n[Verse 3]\n(Chicka) I'll do a hundred-yard dash just to slash Kim Kardash'\nIn the ass with a shard of glass from Nick Hogan's car crash\nYou may look like the passenger for that, don't be a smartass\nYeah, laugh while you sit there\nThinkin' that the hard part passed\nYou ain't seen pain 'til Leatherface flips mane\nI'll cut your fuckin' balls off, homie, my saw's off the chain\nI chopped the bitch in half with it, sawed off her legs\nAnd the top half of the torso fuckin' crawled off insane\nI ain't seen shit like that since I went to Mike Jack's\nTook the Elephant Man's skull, fucked it, and put it right back\nHanded my dick to Bubbles\nWhile he sucked it and licked my nut sack\nGave him a reach-around\nWhile I fucked him right in his butt crack\nNah, I ain't takin' it back fo.., fuck that!\nI give a fuck about nothin', so here's where you fucked up at\nDon't go touchin' that can\nMan, you don't wanna open up that\n\n[Outro]\nWait a min-ahh, shit… Alchemist, cut that..\n(Laughter, Record Scratching)", "image": "https://images.genius.com/a5ed3580f71504266a9bd91d17e9dbcb.1000x1000x1.jpg"}], "artist": "Eminem"}