{"songs": [{"title": "Tequila Sunrise", "album": "Cypress Hill IV", "year": "1998-10-06", "lyrics": "[Intro: B-Real and Sen Dog]\n— Mira joven… Si busco a alguien, que mueva producto. Pero que lo mueva con madre…\n— Pos sabes que compa? Yo aqui, en el norte yo soy. El que controla yo te lo puedo mover todo... 80, 100 palos a la semana… Te traemos toda la feria y limpio ese…\n— Pues bueno, aqui tenemos un negocio... vamos hacer hombres ricos… Tomamos no? Del gusano…\n— Pa la salud!\n— Pa la salud! Primero yo…\n— Primero usted…\n— Grrrrrah!\n— Mexican yells\n— Hora 'hora… quien está?\n— Cometelo!\n\n[Verse 1: Barron Ricks]\nWord up, Tequila style, eat the worm motherfucker\nTequila spice, hot nice\nFeeling right, sipping on Jose Cuervo\nDown in Tiajuana, Mexico\nThinking of the big score the night before\nMet the connect, who was impressively dressed\nIn high fabrics\nWith troops like Beirut, up on the mezzanine\nBrandishing sub-machine guns, aye-yo\nIt's all about the money, son\nNow that's the only reason\nWe came south of the border, to complete this work order\nWe gotta get it, no looking back, going all out for it\nReady to attack, die in a minute flat for it\nAs God is my witness, we got ditches\nFor all you motherfuckin fake bitches\nIt all boils down to the business\nNothing personal, when niggas acting like they helping you\nI fuckin blast you like Frank Castle, motherfucker!\n\n[Chorus]\nTequila Sunrise, bloodshot eyes\nRealize we're all born to die\nSo get the money nigga!\nTequila Sunrise, bloodshot eyes\nRealize we're all born to die\nSo get the money nigga!\n\n[Verse 2: B-Real]\nI never knew money like this, in the palm of my hand\n'Til I met the man with mad hook-up, and big plan\nEvery where you look'a, he got everybody shook up\nRunning for cover, the big bad WOOF, motherfucker\nHe was like a father figure, show me the bigger picture\nFuck slangin' on the corner, don't let the pigs get you\nNot like these fools who don't comprehend\nYou end up doing a twenty-five bit in the pen\nYou got that? Getting your cup, I took a swig\nThe bitter taste of the 'mezcal', free worm shit\nDroppin' a lesson, he slapped my face, he said listen\nPay attention brotha, you're my ace, but don't ever question\nJust do what I say, and you'll be rich\nAnd keep this in your mind: rats lay in a ditch with no spine\nDon't ever forget that golden rule in the game\nCheers, they all know your name, it's like fame\nWhy, women and money don't mix, like drinking an' driving\nWatch those conniving women and keep your eye out\nAlways be aware of what's around you\nThey wanna down you, and fuckin' clown you\nKeep your shit in order the money won't stop\nPretty soon you'll be on top\n\n[Chorus]\nTequila Sunrise, bloodshot eyes\nRealize we're all born to die\nSo get the money nigga!\nTequila Sunrise, bloodshot eyes\nRealize we're all born to die\nSo get the money nigga!\n\n[Verse 3: B-Real]\nTequila Sunrise, with the bloodshot eyes\nMy, my, my, how time flies and goes by, surprise!\nMy mentor passed on and passed a warn to me, emergency\nFor my enemies who wanna murder me\nEat the worm, mothafucka, while you burn, mothafucka\nBetter kill me, don't let me return, mothafucka\nTrust no man, cause I'll be back, you understand?\nWith a plan, and my ice in hand, I want it all\nI recall the words from Jesus, you are the Juice\nBetter go get it, don't let it get to your head, embed it\nLet these words stick, you better be ready to die\nNow take a fucking sip, caution it, but I never lie\n\n[Chorus]\nTequila Sunrise, bloodshot eyes\nRealize we're all born to die\nSo get the money nigga!\nTequila Sunrise, bloodshot eyes\nRealize we're all born to die\nSo get the money nigga!\nTequila, eat the worm Ese, eat that shit!\nYo, so where is he man? You know?\nHe said he‘d be here, homies\nDamn, he’s a little late but, [?] he’ll be here, just wait\nIs it some good shit, man?\nMan, the dude said the shit was powerful as shit\nI hope he’s got some good shit, man\nBecause he is late it‘s 5'o clock already\nHe is gonna be here, homies, he’s gonna be here, homies", "image": "https://images.genius.com/4f0b9d852eece67bb00fcc4712c945bb.500x500x1.jpg"}], "artist": "Cypress Hill"}