{"songs": [{"title": "Want some more - target version", "album": null, "year": null, "lyrics": "[Hook: Jeremih]\nWant some more\nWant some more\nEven though a nigga been getting to it\nWant some more\n(Still want some more)\nWant some more\nWant some more\nEvery time I end up getting to it\nWant some more\n\n[Pre-Verse: Nicki Minaj]\nWhen they start talking crazy that's when I know that they\n(Want some more)\nI know that I'm getting it, but fuck it cause I\n(Want some more)\nWhen they start talking crazy that's when I know that they\n(Want some more)\nEvery time I end up getting it\n(Want some more)\n\n[Verse 1: Nicki Minaj]\nI'm in this bitch, I'm getting money\nOne minute they hate me then they love me\nAin't got nothing for me, these dudes is funny\nThat's why I'm throwing shade like it's sunny\nWho had Eminem on the first album?\nWho had Kanye saying \"She a problem\"?\nWho the fuck came in the game made her own column?\nWho made Lil Wayne give 'em five million?\nWhy the fuck I gotta say it, though?\nYou niggas ain't know it yet?\nFootball touchdown on the Boeing jet\nYou my son, but I'm just not showing yet\nMiss Icy, but it ain't snowing yet\nYou can tell I'm the illest cause my dividend is the biggest\nBitches ain't sitting with us, all my niggas in Margielas (Oh!)\nIs pigs flying? Is these bitches trying me?\nThey think it's sweet? Oh, these bitches got diabetes!\nYou seen that list? It was me, Baby, Jay Z and Diddy\n\n[Hook]\n\n[Pre-Verse]\n\n[Verse 2: Nicki Minaj]\n(Yo, Yo)\nI'm in this bitch I'm hassadiddy\nI popped a Perc and I said \"thank you\"\nI'm popping tags everyday, it look like my B-Day\nThese bitches suck, so I nick name these bitches BJ\nThey want that union,they want that D. Wade\nI tell a ho \"just be happy they getting leeway\"\nMy name Barbie, bitch (My name Barbie, bitch)\nAlexander, made me Queen\nI'm pulling up with the King, I'm late to my own party, bitch\nWant it, I get it, I don't be wanting for nothing\nI mean, I do what I do and it must be counting for something\nI don't be jumping from topic to topic, stay in my pocket\nI got your rent in my pocket, so can I pay you to pop it?\nCash money, getting six albums\nNo bitch niggas want to bitch out\nYou niggas apologize and a nigga diss you?\nThat's a big problem\n\n[Hook]", "image": "https://images.genius.com/361fbb0a68e9287bdc9eb1ad1f8099a7.640x640x1.jpg"}], "artist": "Nicki Minaj"}