{"songs": [{"title": "Nightmare", "album": "Goblin", "year": "2011-05-10", "lyrics": "[Intro: Dr. TC]\nSo, you tell me that everything just isn't going well\nWell, first off...\n\n[Verse 1]\nMy only problem is death\nFuck heaven, I ain't showing no religion respect\nBrain damage, therapy's the only thing I regret\nTalking to me is like a fucking body missing a neck\nBut, I'm surprised I ain't pop off my top off\nLife is a bitch and my cock's soft, the Glock's cocked\nMy hands tremble, my finger slipped, the wall's red\nHer life is fucked, she's sad now, her son is dead\n\n[Hook]\nI told her I'm her worst nightmare\nThis is hell, you don't ever gotta fight fair\nMy spirit floats around in the night air\nOr in your day dreams, that's how death seems\nI told her I'm her worst nightmare\nThis is hell, you don't ever gotta fight fair\nMy spirit floats around in the night air\nOr in your daydreams, that's how death seems\n\n[Verse 2]\nWhen I was younger, I would smile a lot\nI'm getting older, getting bolder, but a wiser top\nNow I'm drunk driving, lap's full of Budweiser tops\nLife is a movie and you're just a prop\nThey begged me to stop, but I listen like deaf drums\nLove? I don't get none, that's why I'm so hostile to the kids that get some\nMy father called me to tell me he loved me—\nI'd have a better chance of getting Taylor Swift to fuck me\nAnnoying and I'm ugly, most niggas wanna punch me\nI'm surprised the fucking doctor even touched me\nFeel like Humpty, you hoping that I'll fall? Fuck y'all\nI'm Ace, I'm parentless, odd, kinda arrogant\nIgnorant as fuck, offend people for the hell of it\nBecause I am the devil, fucker, get on my level\nDoughnuts and keys and kick-flips, Supremes and markers\nMy life is Ms. Mon-unique Parker, but a little darker\nI'll see you in a couple, OF\n\n[Hook]\nI told her I'm her worst nightmare\nThis is hell, you don't ever gotta fight fair\nMy spirit floats around in the night air\nOr in your day dreams, that's how death seems\nI told her I'm her worst nightmare\nThis is hell, you don't ever gotta fight fair\nMy spirit floats around in the night air\nOr in your daydreams, that's how death seems\n\n[Interlude: Dr. TC]\nTyler, here's some water, man. You seem a little tense. How's Thebe?\n\n[Verse 3]\nAll because a nigga just don't give a fuck\nParents wanna blame me all because their kid is fucking up\nBut fuck that, you're a shitty parent, face it, suck it up\nThat's what you should've did before that nigga bust, huh\nFeel like I missed my little brother growing up\nFeel like my little brother missed his brother growing up\nBut this is Golf Wang, like he missed his family growing up\nI got a little taller since the last time you seen me, bruh\nNow I'm emo, so fuck it, I'm pouring up\nBut I never had a drink— (Sydney, Tyler's throwing up!)\nMy nigga Jasper said if I drink and get drunk enough\nI won't feel the feelings I be feeling when I'm sobered up\nBut that's a fucking lie, why would he say that? I'm\nAs emotionally straight as Travis when he--(Tyler, calm down)\nDon't look at me, I'm 6'5\", about to fucking cry\nAbout another guy, but this is Golf Wang, do or die\nI finally had a family\nDomo's in another state, and where the fuck is Riley?\nNow you niggas wanna be nice because the labels wanna sign me\nBut before the co-signing and you fuckers couldn't find me?\nFuck that! I hope you die in a fiery death\nOne ear I got kids screaming, \"O.F. is the best\"\nThe other ear I got Tron Cat, asking where the bullets and the bombs at\nSo I can kill these levels of stress, shit\nThey say that I'm shock value\nHow about you hop off cock and turn volume down?\nI haven't got around to telling my mom shit (why?)\nCause I don't know how to...(whoa)\nAll I want is her support, but no, it's the fights at home\nWhen mommy cusses out cousin, some knifes get shown\nNow she's really fuckin' pissed, so the knives get thrown\nAnd hit her in her fucking neck, now her throat's all gone\nLooking like a fucking monster from the Twilight Zone\nThen they wonder why I stay at Travis' pad with a backpack\nFor the whole week, full of plastic-wrapped black tees\nAnd deodorant like his house is my home\nI could live with the same hat\nAnd the same flat-screen TV watching Flapjack\nAnd the same bacon and waffles on a nice Saturday\nWhere I skate with the same fucking friends that\nDidn't give a fuck about fame or a name, oh\n\"Message from The GZA, oh, another one from Plain Pat\"\nEmail full of emails, I never write back\nAin't kill myself yet, and I already want my life back\n\n[Hook]\nI told her I'm her worst nightmare\nThis is hell, you don't ever gotta fight fair\nMy spirit floats around in the night air\nOr in your day dreams, that's how death seems\n\n[Verse 4]\nOne shot, two shots, one gun, two cops\nI'm blowin' them flu shots, couldn't kill me with two top rockers\nYou're on the side of faggots and cock blockers\nI'm on the side of bad-ass kids and the top notches\nI'm Barney, dinosaur Harley of a human\nCause I'm shrooming with the bangers and the carneys\nYou niggas can't harm me cause y'all know that\nWe at the fuckin' Dirty like it's laundry (Tyler, calm down)\nNigga, get off me\n\n[Outro]\n(Calm down, man)\nFuck off me man, fuck (what's gotten into you?)\nI don't know, it's like I'm a different person at times\nSometimes I'm fucking mad, sometimes I'm not (yeah, you...)\nIt's like I got a fucking voice in my head\nTelling me to do all this fucked up shit, man (yeah, what's this?)\nI don't fucking know, man (what's this person named then, Tyler, huh?)\nHe tells me to do this shit, that I don't wanna fucking do (what's his name?)\nTron Cat", "image": "https://images.genius.com/fd29e400e2d672aa992f9fda170e9959.640x640x1.jpg"}], "artist": "Tyler, The Creator"}