{"songs": [{"title": "Genocide", "album": "Compton", "year": "2015-08-07", "lyrics": "[Produced by Dr. Dre & Dem Jointz]\n\n[Hook: Marsha Ambrosius]\nStone cold killers in these Compton streets\nOne hand on the 9, all eyes on me\nMurder, murder, murder, murder\nCall 9-1-1, emergency\nHands up in the air for the world to see\nIt's murder, it's murder, murder, murder (Murder)\n\n[Bridge: Candice Pillay]\nMurda dem down, kill 'em dead (Yo!)\nBullet to the dome, to the head\nMurda dem down kill a yout'\nDon fe pull up on de man and\n(Turn me up!) What it look like?\nSee, murda dem down, kill 'em dead (Yo!)\nBullets come down from the air\nMurda dem down, kill a yout'\nDon fe pull up on de man and\n(Turn me up!) What it look?\n\n[Hook: Marsha Ambrosius]\nThere's the stone cold killers in these Compton streets\nOne hand on the 9, all eyes on me\nMurder, murder, it's murder, it's murder\nCall 9-1-1, emergency\nHands up in the air for the world to see\nIt's murder, it's murder, murder, murder (Murder)\nIt's been a 187 in this bitch!\n\n[Verse 1: Dr. Dre]\nMurder this, murder listen, hit a suburban whippin'\nTinted windows, right at your wifey (Brrrat!)\nAnd I bet you miss her\nReload the protools and we throw the clip in both trays\nThat's one on the left and one in the right hand\nScottie Pippen both ways\nBeen doin' drive-bys, got this music industry timeline\nLookin' like Rosecrans when these niggas throw up them signs high\nI'm talkin' about that bottom where it's high crimes\nShit, I’m just tryna get paid and keep ‘em thighs high\nSometimes I feel like I could just bury ‘em, bury 'em\nCause delirium, mass hysteria, scarier area\nI'm very aware hip hop needed somethin' to carry it\nSo I married that bitch and swung down in that chariot\nHangin' way too fuckin' close, beware the barrier\nThis is Hub City, nigga, don't make us embarrass you\nMan, you should be realistic, these niggas 'round here ballistic\nWe did the numbers and you lookin' like another statistic\n\n[Hook: Marsha Ambrosius]\nThere's the stone cold killers in these Compton streets\nOne hand on the 9, all eyes on me\nMurder, murder, it's murder, it's murder\nCall 9-1-1, emergency\nHands up in the air for the world to see\nIt's murder, it's murder, murder, murder (Murder)\n\n[Verse 2: Kendrick Lamar]\nAhh, shit! Recognize what lives inside these eyes\nI'ma ride until the dead has risen\nLive in a project building, dodgin' the module ceilings\nI ride, I'ma ride in a stolen Jeep\nRide with the eyes of five blind men, my vision (Corrupted)\nMama tried counselin', five plans for Kendrick (But fuck it)\nMy family's ties, had sabotaged Rosecrans existence (Abducted)\nMy aliens on surveillance, they paid me a visit (Disgusting)\nOur stadium's packed, Raiders in black\nCurls drippin', silver bullet, palladium in my strap\nI lie on the side of a one way street\nNowhere to go, death all I can see\nI say \"Fuck is up?\", I fuck 'em up\nYour supper's up or something's up\nI hoping all get orthotist, rope it before the double dutch broke\nPlenty ruckus with the weapon I protect it under oath\nMy discretion, fuck your blessing, fuck your life\nFuck your hope, fuck your mama\nFuck your daddy, fuck your dead homie\nFucked the world up when we came up, that's Compton homie!\n\n[Bridge]\nMurder, murder\nMurder... murder\nIt's all murder... murder\nAhh!\n\n[Outro]\nMurder, murder, murder, murder\nIt's been a 187 in this bitch!", "image": "https://images.genius.com/19804ba7a9b6ceb36d0158950514927a.1000x1000x1.jpg"}], "artist": "Dr. Dre"}