{"songs": [{"title": "Pornographic", "album": "All 6's and 7's", "year": "2011-06-07", "lyrics": "[Intro]\nPornographic, pornographic\nPornographic, pornograph-\n\n[Verse 1: Tech N9ne]\nHey. Where the camera at?\nI'm trying to hammer that your glamor got rappers, actors\nEt cetera having a damn attack\nAnd it's that bam and back that's standing fat with your rack\nLet's get candid act like your Janet Jack and mash in the sack\nOr pretend you Nikki Nova while I film and flip it over\nGet me closer to sticky soaking women if the poker\nThis is the culture where we kiss the concha\nAnd if she know to get below the big derover\nLick these soldiers strictly vulgar\n(Look at her go) Watching you on the T.V\n(Like at a show) Actin' like you were Pinky\n(Incredible) Far from nasty and sleazy\n(You're not a ho) Best believe me\nSomething you said made me wanna jump in the bed\nDumping my threads while you spread legs dead on my red cam\nThis ain't a bread scam just wanna bust head jams\nShe said ram me and play it man and I said dwamn!\n\n[Bridge]\nPornographic-o-oh\nDon't make you a ho-oh\nWe can take it slow-oh\nNo one has to know-oh\n\n[Hook: Tech N9ne]\nOh, oh, let's make a porno\nYou can taste me, I'll eat ya up like DiGiorno\nDon't be shy that's a no-no\nMe on you, picture that like a photo\n(Knock, knock, knock, knock, knock it out)\n\n[Verse 2: E-40]\nBack it up like a garbage truck\nAss like Amber Rose\nBouncing up and down like a pogo stick\nI wanna see ya touch your toes\nI'mma lay back and let you do all the work\nTill you reach your climax and spill\nCream on my thing like a wet dream\nPussy juice dripping just like PET milk\nWe on that [?]\nWe higher than Pluto\nShe can't get enough\nShe blowing me like a bugle\nI'm fixing to burst just like a water balloon (water balloon)\nShe took the rubber off and ate my sperm with a spoon\nIf that ain't pornographic I don't know what pornographic is\nBooty checks tatted, pierced pussy lips\nSilicon plastic oral injections is just big hips on my erection\nI don't spend money on hoes, hoes spend money on me\nLike to make them buy me clothes by using my mouthpiece\nI tell them I ain't got no bread, I ain't got no paper\nYou heard what E-40 said, I ain't no Captain Saver\nBig boss macking, hustling is my habit\nI don't play no games, I beat the pussy out the frame\nBiatch!\n\n[Bridge]\nPornographic-o-oh\nDon't make you a ho-oh\nWe can take it slow-oh\nNo one has to know-oh\n\n[Hook: Tech N9ne]\nOh, oh, let's make a porno\nYou can taste me, I'll eat ya up like DiGiorno\nDon't be shy that's a no-no\nMe on you, picture that like a photo\n(Knock, knock, knock, knock, knock it out)\n\n[Verse 3: Snoop Dogg]\nDebbie does Dallas, Doggy does Debbie\nBaby are you ready? This shit is getting heavy\nDipping like a Chevy, hold it real steady\nDouble up, bring in Blowjob Betty\nNow we got it popping loc, hit then I stop and go\nFilm it record it in high definition though\nI got my dick by your ear, do you hear what I hear?\nOh brother, no other, I will fuck your mother\nAnd that's truthfully, see that's how Snoop will be\nSee, 'cause usually, booty free, duty free, it's all the same\nPussy has no name or no face, some love the way it taste\nAnd I know that, see, baby, wanna blow that?\nI take her to the mic booth and let her do a mic check\nDog her like Mike Vick, I'll make dyke bitch like dick\nRight bitch? It took a minute just to write this\n\n[Bridge: [?] & Krizz Kaliko]\nPornographic-o-oh\nDon't make you a ho-oh\nWe can take it slow-oh\nNo one has to know-oh\n\n[Hook: Tech N9ne]\nOh, oh, let's make a porno\nYou can taste me, I'll eat ya up like DiGiorno\nDon't be shy that's a no-no\nMe on you, picture that like a photo\n(Knock, knock, knock, knock, knock it out)", "image": "https://images.genius.com/7d4c4dfa3d56e3cd0f59836ef122ff24.1000x1000x1.jpg"}], "artist": "Tech N9ne"}