{"songs": [{"title": "New Body (Demo Version)", "album": null, "year": "2019-01-01", "lyrics": "[Intro]\nOh my God, Ronny!\n\n[Chorus: Ty Dolla $ign]\nCan't wait to see your new body\nDon't be acting like you don't know nobody\nNo body count on your new body\nI'll be the first one to hit your new body, whoa\n\n[Verse 1: Kanye West]\nNew ass, new tits, new bitch, who this?\nWho else you know this bad with two kids?\nNobody ever, ever gave you shit\nNobody flew to Colombia like you did!\nTrying the new ass out with the new drip\nOnly thing to ask: who first to hit?\n'Cause far as you 'cerned, you is a new bitch\nIn them, we in them, them niggas is too rich\nOld dick don't count, these titties don't bounce\nAll these niggas say they're here, tryna run up your account\nPicked up on a thou', yeah, this summer they were down\nBut they better act like they know who the fuck he now\nThis a new bitch, got a party table at the Ruth Chris\nAll bad bitches take a group pic\nHad to step back 'cause she's too thick\nYou used to twerk to every, every song\nSaved up to buy an ass of your very, very own\nFaceTime, body looks like Dom Perignon\nDon't pay me no attention, go and carry on\n\n[Chorus: Ty Dolla $ign & Nicki Minaj]\nCan't wait to see your new body\nDon't be acting like you don't know nobody\nNobody count on your new body\nI'll be the first one to hit your new body, whoa (Mm)\n\n[Verse 2: Nicki Minaj]\nAyo!\nYou ain't fuck me, you fucked the old body\nYou ain't fuck Nicki, you fucked Nicole body\nAin't no miles on this here new body\nOff with their heads, these bitches is nobodies\nI-I need a new body, now I need some new dick\nNo little wood, tryna stick me like a toothpick\nGot me a new body, now I need some new dick\nI ain't bust shots, don't duck, unless the shoe fits\nCookie game make me the GOAT\nCookie game come with the throat\nPuff, puff, pass\nNo, you do not want the smoke\nB-b-bitches be sleeping on me, but be claiming they woke (Ooh!)\nFuck up a check on my body (Aha-ha)\nThen let them lick on my body out in Abu Dhabi (Grr!)\nYou see me shining, you pissed\nI-I-I think my haters just really be wanting a kiss (Mwah!)\nThey know I'll body you, sis\nOld nigga hit me and I said \"New body, who this?\"\n(Old nigga hit me and I said \"New body, who this?\")\n\n[Chorus: Ty Dolla $ign]\nCan't wait to see your new body\nDon't be acting like you don't know nobody\nNo body count on your new body\nI'll be the first one to hit your new body, whoa\n\n[Verse 3: Ty Dolla $ign]\nNew body, you've been working hard\nI've been on your IG page, lurking hard\nNew boobie job, now they perfect\nSix weeks off, it was worth it\nBaby got that nip tuck, let me titty fuck\nHit it from the back, get my dick sucked\nPut me on the scoreboard, make a new one\nHe said he hit before, not since you got your boobs done\nYou're working on your abs, huh? You got your abs done\nYou better show it off, you better work it\nWhy they body shaming? Baby, I commend it\nDr. Ghavami, I recommend it\nWoo!\n\n[Chorus: Ty Dolla $ign]\nCan't wait to see your new body\nDon't be acting like you don't know nobody\nNo body count on your new body\nI'll be the first one to hit your new body, whoa", "image": "https://images.genius.com/70c6e506a91f6dabdd23cad304812ce3.533x533x1.jpg"}], "artist": "Kanye West"}