{"songs": [{"title": "Bad Guys (Shoopac Mix)", "album": null, "year": "2008-08-17", "lyrics": "DMX:\nUhh, uhh\nIf Im gonna rob, ima rob all night\nIf Im lookin for somethin its probably a fight\nIf Im goin fuck bitches then they better be tight\nIf thats dead, then the head better be right\nIf I gots to play ima play til I win\nSince I gots to be here can't wait to begin\nWanna fuck shorty can't stand shorty friend\nCause honey friend fuck many many men\nStay wit the rats cause the rats is real\nWanna fuck, then we fuck, already know the deal\nShit, fuck what you look like, just show the real\nAnd I keep A spot that we can go to chill\nI love my, get down for the hoes\nOnly reason I come around is for the hoes\nPipework - I lay it down for the hoes\nHit em off with that dark brown, you know?\n\n2Pac:\nWatch me clown\nGive me loving when I'm high\nI'ma outlaw baby I'll be thugging 'till I die\nIn drop-top double r\nLife as a rap star\nHustle like a crack fiend\n'Till they catch me\nGo ask somebody to your show\nWatch them niggas out the sight of mah night scope\nCooking white dope\nGot mah nigga 25 to life stretched out\nTrying to have all the better things in life\nWell Makaveli\nA born leader 10 millimeter\nChanging niggas future like a schizophrenic palm reader\nHeeds from out the bible I read\nSee the meek shall inherit the earth\nAnd the strong will lead\nHittin' weed like it alright\nI'm in the studio\nMaking music all night\nMy enemies cry whenever I rise\nThey hated 'till death\nTry to beat me out my last breath\nWhat cha gonna do?\n\nDMX:\nUhh, uhh\nWhat you niggas want? cause I got it right here\nYall niggas front, then I hit you right there\nNot really impressed by what niggas wear\nFaggots talk shit but I really dont care\nIm the type of nigga thatll die for the cause\nFuck what you heard, I will die for my dogs\nAin't scared of shit - will ride in the fog\nSame thing but a bigger size than yours\nI fuck with drag-on, cause he spits the flame\nDrag-on motherfucker dont forget the name\nAnd we all takin over ain't shit the same\nIf you ain't out that mob nigga quit the game", "image": "https://images.genius.com/1bcf43b1cc0f34db6cd70e1a63c8b84c.464x464x1.jpg"}], "artist": "DMX"}