{"songs": [{"title": "Reporting From The Slums", "album": null, "year": null, "lyrics": "[Intro: Rebecca Raines]\nShould I, could I try to say\nThat I want you every way?\nShould I, could I try to say?\n\n[Verse 1: Yah-Sin]\nAnother pack to sell, another crack that got knocked in jailed\nWhile others layin' with the daffodils\nFuck around and seen the cops was the ones busting\nAt your head, damn, little nigga, you ain't done nothing\nStore trips turnin' into corpses\nMore sips of that Henny spilled, debts are costin'\nOf course it's Yah-Sin again, makin' fans tremblin'\nAnd skin 'em and, known to meditate and count Benjamins\nWord to mommy or whoever maker\nYou've been climbin' up the stairs, I'm an elevator, tell your neighbor\nThat hater attitude is keepin' us down\nThey wanna know my secrets now\nEverybody searchin' for a deeper sound\n\n[Hook]\nI'm reportin' from the slums right now\nAnother mother, someone just shot down\nThe way she cried was a frightening sound\nMan this shit gotta stop somehow\nI'm reportin' from the hood right now\nAnother momma, someone's just shot down\nThe way she cried was a frightening sound\nMan this shit gotta stop somehow\nIt's gotta be a better way out\n\n[Verse 2: Method Man]\nStaten Island is iller, off the island they feel us\nSome people might not get us but they don't doubt that we're killers\nThe system tryna kill us cause they don't doubt we're guerrillas\nHe home after that body then we don't doubt he a squealer\nThe dealers, everybody wants nice things\nThe realest get murdered over money and dice games, I get it\nIf your trap life's a gimmick then everybody a critic\nThat's a nice place to visit but they ain't tryin' to live it\nRaw is how I give it like UG\nCops be askin' questions like, \"Who's he?\"\nBut I ain't sellin' no loosies\nBrother when you walk in that room past, you lose me\nThat's why we never kick it like Bruce Lee\n\n[Hook]\nI'm reportin' from the slums right now\nAnother mother, someone just shot down\nThe way she cried was a frightening sound\nMan this shit gotta stop somehow\nI'm reportin' from the hood right now\nAnother momma, someone's just shot down\nThe way she cried was a frightening sound\nMan this shit gotta stop somehow\nIt's gotta be a better way out\n\n[Verse 3: Spank]\nSufferin' reality, perseverin' my salary\nTrapped inside the drama like lookin' at Grey's Anatomy\nThinkin' of ways to capture the plan the creator have for me\nIt's principles when you the one takin' care of your faculty\nTest tube, baby, the meth lab, the left jab\nRight hook feel like I million dollars in X tabs\nGotta be a better way, llamas with me every day\nIt's goin' down everywhere, I'm laughin' while they let it spray\nReal niggas' mamas cry, real niggas gotta ride\nSome call it revenge, but still it's a homicide\nWonder how their father feel, will real niggas shed a tear?\nOr do they only shed blood? They feel like they're forever feared\n\n[Hook]\nI'm reportin' from the slums right now\nAnother mother, someone just shot down\nThe way she cried was a frightening sound\nMan this shit gotta stop somehow\nI'm reportin' from the hood right now\nAnother momma, someone's just shot down\nThe way she cried was a frightening sound\nMan this shit gotta stop somehow\nIt's gotta be a better way out", "image": "https://images.genius.com/fe6629f7a5e6af0aa38ca87547ced96f.1000x562x1.jpg"}], "artist": "Method Man"}