{"songs": [{"title": "Deep Water", "album": "Compton", "year": "2015-08-07", "lyrics": "[Intro: Dr. Dre (Anderson .Paak)]\nWhere you from nigga?\n(Help me!)\n\n[Skit]\n\"What is going on in Compton? I don't understand it.\"\n\"Well as it relates to this, this is not in my field as the clerk so anything that relates to this, you'll probably have to get an answer from Dr. Dre.\"\n\n[Verse 1: Dr. Dre]\nI heard you talking about respect, I gave you niggas the utmost\nAll you niggas the utmost\nWould you look over Picasso's shoulder\nAnd tell him about his brush strokes?\nThem opinions, I don't trust those\nI apologize, the city made a nigga so cutthroat\nEvery hood love me, but it started on one coast\nCould've stopped in '86 but I knew that you would want more\nI'm on the throne in a place some niggas won't go\n\n[Hook: Justus]\n(Don't get it fucked up!) Been away from home\nBut I ain't been gone that long\n(All they wanna know is: where you from? Where you from?\nWhere you from, nigga, huh? Compton!)\n\n[Bridge: Dr. Dre]\nPsst! This is about where I'm from\nI think it's time to take these niggas to the deep water\nYeah, down in the Pacific (the Pacific), representin'\nWhere them sharks at nigga, down in the deep water\n\n[Verse 2: Dr. Dre]\nListen, listen, listen, all you niggas swimming in the info\nGo fuck around and drown in the specifics\nAlways going overboard, used to be my kinfolk\nNow you sleeping with the motherfuckin' fishes\n(Swimming with the mothefuckin' fishes, what the business?)\nThese niggas won't let up until they all wet up\n(Don't get it fucked up!) Naww, nigga!\nNow everybody wanna visit tryna re-up that prescription\nYeah, re-up\nThat's my nigga, watercolors couldn't even paint the picture\nIf they don't get the picture, fuck them\nYeah, drugs by the dozen\nYou might just wanna go and check the children\n(You might just wanna check your fuckin' children)\nI'm the one that got they ear\nAh, for many years, I been making parents live in fear\nI just wanna make it clear: my influence run deep like the ocean\n\n[Hook: Justus (Dr. Dre)]\n(Don't get it fucked up!) Been away from home\nBut I ain't been gone that long\n(All they wanna know is: where you from? Where you from?\nWhere you from, nigga, huh? Compton!)\n\n[Bridge: Anderson .Paak]\nFeel's like you're drowning, don't you?\nAbout a hundred miles down in that ocean\nIt's over, shoulda never jumped in\nIf you can't swim (if you can't swim, if you can't swim)\nOh my God, where's a lifeguard when you need one?\n\n[Verse 3: Kendrick Lamar]\nMotherfucker know I started from the bottom, vodka baby bottle\nMixin' that with Similac, my momma knew I had a problem\nWasn't thinking 'bout no rapping, I was juuging for a dollar\nPutting quarter pieces in the black Caprice and make it holla\nNo policing me, I got the beast in me, I gotta holla\nKeep the decency and make them TNT my product\nI'm a C-O-M-P-T-O-innovator, energizer\nInner city bullet flyin' 'til that bitch on auto pilot\nAhhhhh, shit! I don't give a fuck about your whereabouts\nAll I care about is wearing out your area\nAnd airing out your upper body\nWhen I catch ya walking out your parents house\n(Don't get it fucked up!) Homie got fucked up\nTryna park his tour bus, not knowing what's what\nOr who's who, living in the L.A. County zoo\nPick them off like a big dog, motherfucker, woof!\nOnce upon a time, I shot a nigga on accident (Boom, boom, boom)\nI tried to kill him but I guess I needed more practicing (Boom, boom, boom)\nThat's when I realized banging wasn't for everybody\nSwitch it up before my enemy or the sheriff got me\nThey liable to bury him, they nominated six to carry him\nThey worry him to death, but he's no vegetarian\nThe beef is on his breath, inheriting the drama better than\nA great white, nigga, this is life in my aquarium\n\n[Hook: Justus (Dr. Dre)]\n(Don't get it fucked up) Been away from home\nBeen away from home all night long\n(All they wanna know is: where you from?\nWhere you from, nigga, huh? Compton)\n\n[Bridge: Cheyenne Lavene]\nThis is about where I'm from\nI think it's time to take these niggas to the deep water\nYeah, down in the Pacific\nWhere them sharks at, nigga, down in the deep water\n\n[Outro: Anderson .Paak]\n(Gasping for Air)\nHelp me\n(Feels like you're drowning)\nI'm drowning\nHelp me, help me, help me\nSomebody help me\n(Shoulda never jumped in\nIf you, if you can't swim)\nHelp me\nHelp me, help me, help me\nI can't, I can't breathe\nI can't wait, help\n(Where's a lifeguard when you need one?)\nGod, please, please help me, please\nPlease help me, please help...\nPlease help, please, please...", "image": "https://images.genius.com/19804ba7a9b6ceb36d0158950514927a.1000x1000x1.jpg"}], "artist": "Dr. Dre"}