{"songs": [{"title": "Locos", "album": "Elephants on Acid", "year": "2018-09-23", "lyrics": "[Intro]\nOrale loco, ponte las pilas wey, eh?\nAquí se va a hacer el jale ahorita de volada\nEstos vatos tienen un chingo de feria\n¿Listo? Ponte la máscara, vámonos\n\n[Verse 1: B-Real & Sen Dog]\nFive, and four, and three, and two, and one\nAnd we smash through the door with the quickness up\nLooking for the crop that I heard you pussies talk about\nDon't try nothin', if you lead me to the crop, anda despacio\nDon't say a word, it'd be over, suicide of the smoked out\nWhere the cash stashed in the room?\nFive, and four and three, and two, and one\nThat's how many seconds left before your ass is done\n(Click-clack)\nNow you heard the sound, tell me somethin' new\nThis homie here won't hesitate to put a hole in you\nDeath threat, get your ass up, that's a good boy\nWould you rather put the cameras out, or we playin' coy?\nDon't even think about the strap up in your backpack\nCooperative, when I leave you're still alive, in fact\nI only want your cash crop, not your life jack\n(You can get another crop), but not your life back\nSo settle down, I don't wanna let the metal spray\nLead the way, give it up and live another day\nTrees and sacks, backpack full of cash, out the door\nHit the ride, hear my tires screechin' in the back\n\n[Chorus: Sick Jacken]\nYeah\nVámonos, dámelo, cáete con ese paquetón\nYo no quiero usar el cuete no\nEs muy baquetón\nEl bote no me asusta a mi\nEs como vacación\nPero yo te asusto a ti\nMiados en el pantalón\nCinco, cuatro, tres, y dos, y uno\nYo quiero la hierba y el nudo\nEs lo que le queda a este cuetazo de budo\nPierde puro verde o pierdes el culo\nTu di\n\n[Bridge]\nAhí esta la otra que te decía loco\nEstos vatos tienen más feria\nAquí vamos a chingar, ¿listo?\nVámonos pues\n\n[Verse 2: B-Real & Sen Dog]\nWeed and dough, and hoes, and hit and run\nAs we graspin' for more with our pockets full\nLayin' down the plot, blueprints for another pull\nSmokin' up the spot while I quit, we're invincible\nJack your spot and we take your shit and run\nGot my eye on the hummus just around the way\nSearchin' for the dogs, no guards, so it's time to play\nJudgin' by the odds we can hit it and lets hondalē\nSomos locos pocos, here we come\nGrippin' outta sight\nTakin' it to other heights\nHomie, go around the back\nGo in when I kill the lights\nSack up everything\nDon't mean nothin' with a fuckin' knife\nFive and four, and three, and two, and one\nNow we in the buildin', take it all until it's done\nFifty pounds, smell it all around, yeah we comin' up\nEasy pickin', don't be tellin' hoes, live fucked up\n\n[Chorus: Sick Jacken]\nYeah\nVámonos, dámelo, cáete con ese paquetón\nYo no quiero usar el cuete no\nEs muy baquetón\nEl bote no me asusta a mi\nEs como vacación\nPero yo te asusto a ti\nMiados en el pantalón\nCinco, cuatro, tres, y dos, y uno\nYo quiero la hierba y el nudo\nEs lo que le queda a este cuetazo de budo\nPierde puro verde o pierdes el culo\nTu di", "image": "https://images.genius.com/c316572f3669ae0751f262cce4a14f17.640x640x1.jpg"}], "artist": "Cypress Hill"}