{"songs": [{"title": "Killing The Game", "album": "Meth Lab Season 2: The Lithium", "year": "2018-12-14", "lyrics": "[Verse 1: Pretty Blanco]\nYeah, nah, nah\nYou ain't never run into a goonie in the boonies, better hope I let my toolie out (Huh)\nBut I ain't never lackin', boy, you actin' when I catch you up in traffic, I'ma put one in your dome (Pop pop)\n'Cause the day I lost my brother, I was sittin' with my mother and she told me I would never be alone (Yeah)\nSo I grabbed that four-five, why should homie be alive when he got my best friend? Now he gone\nNo, this shit just so wrong (Yeah)\nRemember his cousin was callin' my phone (Brrrp)\nLike, Blanco, let's get him, I know where he headed\nHe need to be deaded, let's go\nSo we hit the road, gone off them shrooms like I'm Toad (Whoop)\nHoppin' to Fourth, that four-forty-four close\nIt's on, soon as you see 'em, let go\nReloaded it and dump it some more (B-r-r-r-p)\nSo we posted up by the store\nFreezin', it's twenty below\nBlowin' this weed by the O\nWe just 'bout to leave and then, yo, I think I just seen me that fiend that hit Gene and my bro\nHe's right on the corner with Steven and Joe\nNow it's open season, I'm fiendin' to blow\nSo Lee hop up outta the whip, when he let that shit rip, I saw all of 'em three on the floor, whoa\nBut I guess what can I say?\nI hit JFK and was back to LA (Whoo)\nA thief in the night and a thief in the day\nSo I take what I want, while I'm chiefin' the J\nHuh, while I'm chiefin' the J\nBe careful out here in them streets where you play\nBe careful out here when you speak what you say\n'Cause your ass will get cut up, the meat, the filet, like whoa\n\n[Chorus]\nWe killin' these lames, so my killers insane\nWatch how we killin' the game-we killin' the game\nWe be killin' the brain and got me not feelin' a thang\nWe killin' these lames, so my killers insane\nWatch how we killin' the game-we killin' the game\nWe be killin' the brain and got me not feelin' a thang\n\n[Verse 2: Method Man]\nI'm back in my stash, we back in the lab\nGot killas in back of your pad with ratchets and masks\nWe 'bout to catch us a bag,I'm fire, no matches or gas\nI'm mashin' the gas (Skrt), I done mastered the class\nDo not give these rappers a pass\nThese rappers is trash\nI give these rappers the drag then ask, \"Is you mad or you mad?\" (Rah)\nHaters, I'm flickin' 'em all\nCritics have written 'em off\nTrick, I'ma boss\nI might not be bigger than Ross but still might be bigger than yours\nI smell like the vault\nShe smellin' like Christian Dior\nBut we don't be kissin' them broads, uh-uh, not at all\nI mean it, I seen it before\nTheir momma a queen like Afeni Shakur\nMeth know the meanin' of floor\nThey fiend to be king of New York\nBut why if the kingdom is poor?\nNow we keepin' score\nDon't know what you figure me for\nWho told you the city was yours? (Aah)\nRound of applause and you get around just because (Ha)\nYou wasn't down for the cause\nProvin' the form, hope it ain't you in the morgue\nSee, this what I do when I'm bored\nNothin' to do with the law\nGot nothin' to do wit'cha boy\nThe cops'll put two in your boy\nYour day'll be worn for sure\nSoon as my key in the door and I get my feet on the floor\nBelieve it, I'm eatin' some more\nBeastin' some more\nBeef, it don't need to be thawed (Rah)\nThis is the reason I'm raw", "image": "https://images.genius.com/ed8b9d6333cc29967da88416db3514c8.1000x1000x1.jpg"}], "artist": "Method Man"}