{"songs": [{"title": "RWT", "album": "Detroit", "year": "2012-09-05", "lyrics": "[Intro]\nYup, yup\nI look up\nCause I can't look down on you bitch niggas no mo, man\nIf that casket ain't 24 karat gold when I die\nThen I ain't made enough fucking money man and that's real talk\nGod\n\n[Verse]\nThis my roll weed time\nDon't turn it into dead in the street time\nHer legs do the peace sign\nKnow the hood so well don't need street signs\nYoung rich and iconic\nBig titties I'm signin'\nBurnin' benjies and chronic\nBig white smoke clouds every time I talk, does it look like I'm in a comic?\nEverything I rock I designed it, realer nigga, won't find it\nOkay, I be stackin' that cheddar, bet that shit won't expire\nGot me ballin' so hard, I need me Jerry Maguire\nI made a mil before twenty-five, man and I ain't even no lie\nBitch I ain't sayin' that shit to brag neither, I'm sayin' that to inspire\nI'm like, damn boy, fuck you sayin' boy?\nHatin' on me, knowin' that you is a fanboy\nWhen I'm around you call me Cuz like we fam boy?\nRappin' like me lets me know that I'm the man boy\nOkay, Hennessy and Bombay is a real nigga entree\nI gave her my grande, my food is picante\nMy girls is Beyonce, your boyfriend beyond gay\nI seen him hang with Deandre and they was lookin' like prom dates\nOne time for my hood 'til I go in the ground\nI'm throwin' it up cause they holdin' me down\nI'm perverted as fuck, got a pole in the house\nGot your girl and your girl and they hoein' it out\nBut you standin' outside cause no hoes is allowed\nIf you work like I work, you would throw in the towel\nOnce you get in this life, man, there's no comin' out\nAnd haters look at me like snow in the south\nSurprise nigga\nMan fuck it, I'm on, you off and I hope you die, nigga\nWhy you alive nigga?\nI'm stackin' dough cause my momma addicted to spas\nYeah I'm the one that these hatin' niggas despise\nYou better take off your fuckin' disguise, nigga\nBitch-made is in your eyes nigga\nLies nigga\nShut the fuck up, everything'll be fine\nCause this my roll weed time", "image": "https://images.genius.com/6b6ac4eb55acf7dda757b1f6c6081c31.500x500x1.jpg"}], "artist": "Big Sean"}