{"songs": [{"title": "1997 Rap Olympics", "album": null, "year": null, "lyrics": "[RAP BATTLE 1]\nI'ma tell you this for your own benefit\nYour shit was dope as hell, 'specially when you wrote ninety-percent of it\nWhat you need to do is practice on your freestyles\n'Fore you come up missin', like Snoop Dogg's police files\nThis type of literature that I'm spittin' be hittin'\nYou gonna swear to God this shit was written\nBut it wasn't, I'll kill a dozen rappers when I'm buzzin'\nGuzzlin', beat your ass like a jealous husband\nNow, you boys are about to suffer and see north\nWhen you go in a coma longer than Vladimir Konstantinov\nCut the damn machine off\nGet a clean cloth, and wipe this bloody video screen off\n\n[RAP BATTLE 2]\nI'm movin' in for the kill, plus I got the trap set\nI can tell you're wack as fuck, and I ain't even hear you rap yet\nLook at you thinkin', \"I'm about to whip his ass\n‘Cause I'ma do some written shit, plus I get to go last.\"\nWell, guess what? Even if I go first, it's no worse\nMy shit's still gon' demolish yo' verse\nI'm 'bout to slice you like a Ginsu\nAnd anything you say can and will be used against you\nIn a court of law, I'm short and raw\nTake your fuckin' shit and cut it off\nYo, you wanna be a dope emcee?\nLook, don't get mad and start takin' your period out on me\n\n[RAP BATTLE 3]\nYou wanna represent on the microphone, but you rap sleazily\nI ain't about to battle this fake ass Eazy-E\nThere ain't no way I'ma do this bullshit\nI don't give a fuck, I'm loaded up with a full clip\nTime of the month? You couldn't get the tape of the day\nTake him away, I rip him like a paper mache\nI heard you rap before, you ain't about shit\nThis whole battle was mismatched, like your outfit\nTry to battle me and get your mouth split\nYou sold out, like Ticketmaster Outlet\nHa ha, I bust and I crush\nI don't give a fuck, ain't no way that you can fuck with us\nI'm givin' back with pimp shit\nI laminate that ass in a badge and wear it at the Rap Olympics\n\n[RAP BATTLE 4]\nBlah-badee-blah-da-blah-blah—stop babblin'!\nYou so fuckin' wack I'ma walk away while you battlin'\nFuck that, I'm on a brand new solo mission\nTo make sure that Wendy Day kicks your ass out of the rap coalition\nI throw a switch at an execution\nWith an overdose of devotion\nDon't talk back, I'm the dope, bitch\nSo who you sound like on the mic?\nThere was only one 2Pac, your thug style is just one big sike\nTake a big hike, bitch, you can't catch me\nYour best rhymes still ain't shit, like a patsy\nWhat the fuck you gonna do?\nI'll battle anybody in your crew\nAnd I don't give a fuck, I slaughter boys\nEspecially wack-ass emcees that will wear a fake-ass corduroy\n\n[RAP BATTLE 5]\nI'm 'bout to make this mic short circuit\nThis beat is wack as fuck—this shit fits you perfect!\nI got so many ways to diss you that I'm playful with you\nI'll let a razor slit you, 'til they have to staple-stitch you\nAnd everybody in this fuckin' place'll miss you\nIf you try to turn my facial tissue to a racial issue\nNobody's hearin' you, you're a wack liar\nDamn! All your white jokes just backfired\n‘Cause, bitch, you barkin' up the wrong tree\nNow go tell all your boys that you was beat by a honkey\nI don't give a fuck, I'll kill ya\nBitch, you better recognize me, like I look familiar\nAnything you say, I'ma kill ya\nGrill ya, when I fuckin' drill ya\nI'm Marsh, but you're the one that's mellow", "image": "https://images.genius.com/92aac577ca29ed58f3ebed13295ca7cd.1000x1000x1.jpg"}], "artist": "Eminem"}