{"songs": [{"title": "Original Silence", "album": null, "year": "2013-10-09", "lyrics": "[Verse 1: Lil Wayne]\nI'm so twisted\nMac!\nLil Tunechi in this bitch, tell them ho's I'm ready\nThem nigga's pissed off, call em' R. Kelly\nI'm higher than a bitch, I smoke that Keisha, Frank, and Neffie\nMan all of these broads on my Johnson like Betsey\nGot a card in my wallet, blacker than that nigga Wesley\nLife is a bitch, well my bitch is sexy\nFirst I'm on the jet, and then I'm on the jet ski\nI make these female dogs heel, like Giuseppe's\nMan you be poppin' shit, and I be poppin' off\nI'm full of alcohol, like a cotton ball\nI just pick em' up and Mr. G just drop em' off\nI serve these ho's, Mr. Volleyball\nSpikes on my shoes, that's the Lou B's\nI'm on my P's and Q's, smokin' QP's\nNigga I'm chillin, catch a cool breeze\nI build a tree house, if money grow on trees\nFuck with me wrong, I send your head to your momma\nDeath bed nigga, where the fuck is your pyjamas\nBlood all day, period, no commas\nEverybody tyin' to watch, but I'm timeless\n\n[Hook: Lil Wayne]\nDark ass shades, I can't see them haters\nNow eat these fuckin' bullets, don't forget to tip the waiter\nI don't drink champagne, it make my stomach hurt\nBitch I'm on that Patron, fuck with me wrong and get murked\nGot a silencer on the gun, that bitch go 'pew'\nThat bitch go, 'pew'\nThat bitch go, 'pew'\nGot a silencer on the gun, that bitch go 'pew'\nGot a mean ass swagger, my bitches do too\n\n[Verse 2: Lil Wayne]\nBitch I'm from New Orleans, rest in peace Magnolia Shorty\nAnd I come from Hollygrove, that bitch is wild as a safari\nI go stupid, I go retarded, The grass is greener in my garden\nSwagger meaner than the warden\nPow pow pow, I ain't with arguing\nLeave a nigga' lieakin', if you scared go see the deacon\nGot a silencer on the gun, but them bullets still speakin'\nGot a bunch of bitches tweakin, to tell me all of their secrets\nAnd if I get in that pussy, I'm on her walls like graffiti\nYou's a dead pita bread, you're a fed ass nigga\nI'm on my vampire, bloody red flag nigga\nFuckin' with Lil Tunechi, get your head smashed nigga\nHit you dead on the money, call that dead cash nigga\nAnd it's, party time, excellent, Wayne's World\nParty time, excellent, Wayne's World\nTonight I'll prolly fuck another nigga girl\nParty time, excellent, Wayne's World\n\n[Hook]\n\n[Verse 3: Mack Maine]\nMack in this bitch, tell them ho's I'm bout it\nThese nigga's sweet, bunch of fuckin' brownies\nFuck you talkin' bout, bitch I'm a G like a thousand\nI'm on my one, two, and bitch I'm still countin'\nYou nigga's got problems, well I got bigger problems\nMy guns all black, make me bring the nigga out em'\nYou don't want that homie, Trust I got that blicka on me\nFinger fuck nina she horny, you won't see tomorrow morning, nigga\nWe so fuckin' cold, young money, money old\nLife is full of choices, and your bitch chose, nigga\nI'm so HollyGrove, fuck them other nigga's\nAnd if the gun's drawn, I'll paint a fuckin' picture\nNigga you know what I'm on, a bag of that strong\nNigga you know where I'm going, bitch I'm going going, gone\nNigga holler at your boy, I don't give a fuck\nGot a silence on the gun, make me shut you nigga's up\nMac!\n\n[Hook]", "image": "https://images.genius.com/f903dae2533e450c8d3cb233aa846020.745x745x1.jpg"}], "artist": "Lil Wayne"}