{"songs": [{"title": "Lord Give Me a Sign", "album": "Year of the Dog... Again", "year": "2006-08-01", "lyrics": "[Intro]\nYeah\nUhh\nIn the name of Jesus, spread the word\n\"No weapon formed against me shall prosper and every turn that rise against my judgment, thou shall condemn\"\n(Lord give me a sign)\nFor this is the heritage of the servants of the Lord\n\"And their righteousness is of me,\" said the Lord\nAmen, Lord, give me a sign!\n\n[Verse 1]\nI really need talk to you, Lord\nSince the last time we talked the walk has been hard\nNow I know you haven't left me, but I feel like I'm alone\nI'm a big boy now, but I'm still not grown\nAnd I'm still going through it, pain and the hurt\nSoaking up trouble like rain in the dirt\nAnd I know only I can stop the rain with just the mention of my savior's name, in the name of Jesus\nDevil, I rebuke you, for what I go through\nBeen trying to make me do what I used to\nBut all that stops right here\nAs long as the Lord's in my life I will have no fear\nI will know no pain from the light to the dark\nI will show no shame, spit it right from the heart\nCause it's right from the start, you held me down\nAnd ain't nothing they can tell me now. Lord, give me a sign!\n\n[Hook]\nLet me know what's on your mind\nLet me know what I'm gon' find\nIt's all in time, show me how to teach the mind\nShow me how to reach the blind. Lord, give me a sign!\nShow me what I gotsta do to bring me closer to you\nCause I'ma go through whatever you want me to\nJust let me know what to do. Lord, give me a sign!\n\n[Verse 2]\nPlease, show me somethin'\nI'm tired of talking to him, knowing he frontin'\nCrying about, \"Life ain't nothin\", but you either be the one mad cause you trapped or the one huntin'\nTrapped in your own mind, waiting on the Lord\nOr hunting with the word that cuts like a sword\nThe spoken word is stronger than the strongest man\nCarries the whole world like the strongest hand\nThrough the trials and tribulations, you never let us down\nJesus, I know you're here with us now\nJesus, I know you're still with us now\nKeep it real with us now, I wanna feel, show me how\nLet me take your hand, guide me\nI'll walk slow, but stay right beside me\nDevil's trying to find me\nHide me! Hold up, I take that back\nProtect me and give me the strength to fight back\nLord, give me a sign\n\n[Hook]\nLet me know what's on your mind\nLet me know what I'm gon' find\nIt's all in time, show me how to teach the mind\nShow me how to reach the blind. Lord, give me a sign!\nShow me what I gotsta do to bring me closer to you\nCause I'ma go through whatever you want me to\nJust let me know what to do. Lord, give me a sign!\n\n[Bridge]\nLife or death, live or die\nI will never live a lie\nI'm going there because I try\nI won't give in till I die\nI'm gon' make it, wrong or right\nMake it through the darkest night\nWhen the morning comes you'll see\nAll I have is God in me\n\nLord give me a sign!\nPlease\nLord give me a sign!\nLord give me a sign!\n\n[Hook]\nLet me know what's on your mind\nLet me know what I'm gon' find\nIt's all in time, show me how to teach the mind\nShow me how to reach the blind. Lord, give me a sign!\nShow me what I gotsta do to bring me closer to you\nCause I'ma go through whatever you want me to\nJust let me know what to do. Lord, give me a sign!", "image": "https://upload.wikimedia.org/wikipedia/en/thumb/4/48/LgmasDMX.jpg/220px-LgmasDMX.jpg"}], "artist": "DMX"}