{"songs": [{"title": "The Scoop On Heaven", "album": "I Love Life, Thank You", "year": "2011-10-14", "lyrics": "[Verse 1: Mac Miller]\nI heard they got nice cars up in heaven\nFree liquor out the bar and the brightest fucking stars up in heaven\nHeard that you can chill, not worry about the police\nNot worry about someone fighting cause everything's just at peace\nHeard the streets paved with gold, the women all gorgeous\nYou just float, can’t even feel where the floor is\nI heard heaven got a brand new venue\nNext to that restaurant, you love their menu\nAnd everything free, so everyone cool\nLook out any window, it’s an incredible view\nEveryone you speak to always telling you the truth\nAnd it’s only good shit when you gettin’ all your news\nOoh, ahh, Imagine that, just a place that we can kick it\nAnd be happy at, satisfaction or maybe I’m dreamin\nI’ll tell you what it’s like when I see it\n\n[Hook]\nIf you hear what heaven’s like, can you tell me?\nPlease, I’m really trying to know\nCuz I do what I do, when it’s all said and done\nShit, I’m just tryin' to go\nIf you hear what heaven’s like, could you tell me?\nPlease, I’m really tryin' to know\nCuz I do what I do, when it’s all said and done\nShit, I’m just trying to go\n\n[Verse 2: Mac Miller]\nI heard ain’t nobody famous up in heaven, everybody the same\nJust kick it up there in heaven 'cuz nobody gonna change\nNobody can complain, the parties are all insane\nThe people all know your name, shit you entertain\nSee everybody you want, always keep in touch and\nGo and chill by yourself when everything get too much\nNever a fucking rush, you're there for a million plus\nYou probably got a Mercedes, but always could take the bus\nSo fuck, that's what heaven’s like\nI guess think it is\nCome to think of it, I’ve been drinkin shit\nI don't know the truth\nIt’s what I imagined when I was standin' in the booth\n\n[Hook]\nIf you hear what heaven’s like, can you tell me?\nPlease, I’m really trying to know\nCuz I do what I do, when it’s all said and done\nShit, I’m just tryin' to go\nIf you hear what heaven’s like, could you tell me?\nPlease, I’m really tryin' to know\nCuz I do what I do, when it’s all said and done\nShit, I’m just trying to go", "image": "https://images.genius.com/d940faa6c3d47e521d16a6a9d5088074.275x275x1.jpg"}], "artist": "Mac Miller"}