{"songs": [{"title": "Slide and Rock On", "album": "Dare Iz a Darkside", "year": "1994-11-22", "lyrics": "[Production by Reggie Noble]\n\nIntro:\nYo, this blunt is for all the niggas that was in the holding pen with me in central booking\nWelcome to the system\n\n[Ha ha ha haaaa! Yeahhh! Motherfucker!\nComing to you live from Newark, New Jersey]\n\n[Hey Redman would you roll that blunt and get me fucked up]\nFucked up [all night] all night\n[Hey Redman would you roll that blunt and get me fucked up]\nFucked up [all night] all night\n\n[Yeah! Coming to you live, straight out of Jersey, motherfuckers]\n\n[Verse 1]\nRock on, rock on, yo here comes that Funkadelic\nI come wetter than Purple Rain, I bust brains\nThe Funk Doctor Spot, got the Glock, now I'm smokin out your sess spot\nI rock from here to Bed Stuy, I hit the spot like XY\nWho is that nigga that's comin six billion feet\nI roll my funk and fontum leaf even smoke a blizz with 18th Street\nI come massively with sneaky styles like Dick Dastardly\nLook at the leather coat and afro like my man Shaft would be\nThe new vroom, crisp like chicken and Chinese food\nI'm just like The Whispers here to put you in the mood [Jumpin Jersey]\nYeah you heard me, got more family than a Partridge\nRoll the red carpet for Red from here to corner market\nYou're tryin' me, I'm a menace of society, right\n[Yo, yo, they killed your style] Yo, I ain't lettin shit ride\nDropping the verbs and nouns, antonyms and homonyms\nGovna Mattic plus I'm diesel like Don and 'em\n\nChorus:\nRock rock on, you gotta rock rock on\n[Somebody, help meeeeee!]\nRock rock on, you gotta rock rock on [Slide and rock on]\nRock rock on, you gotta rock rock on\n[Been waitin' for so long]\nRock rock on, you gotta rock rock on\nRock rock on, you gotta rock rock on\n[Somebody, help meeeeee!]\nRock rock on, you gotta rock rock on [Slide and rock on]\nRock rock on, you gotta rock rock on\n[Been waitin' for so long]\nRock rock on, you gotta rock rock on\n\n[Verse 2]\nMy mama used to tell me \"turn that shit the fuck off\"\nSo I had to play like Foxy and get off [get off]\nMy shit was thick, I bought a clip then clocked my own grip, had honeydips\n'Cause moms made enough loot just to pay the bills with, beeyotch!\nSelling bags from uptowwwwn\nMe and Lester put our money together now we got the block locked down\n31 to local A-Train's, Hoboken\nI took the back way, New Jersey transit cops were open\nI'm hopin, that they don't go inside my boots\n'Cause we had everything, from jewelry to Todd 1 suits\nAnd ClienTEL, I'm drinkin Ballentine Ale in hell\nSo Redman rock well before our record sell\nThen my moms crib was jacked by the jealous\n[And they didn't come back] Is what the basehead used to tell us\n[Yo fellaz!] Our whole scheme sinkin like boats\n'Cause Les mixed biz with pleasure when we shoulda stuck to lactose\nBut every good thing comes to a end\nWith no ends, on the block, sellin weed again\nMy moms tried to make me go to school, I just didn't listen\nGot locked up, now I'm all in the system, listen\n\nChorus\nRock rock on, you gotta rock rock on\n[Somebody, help meeeeee!]\nRock rock on, you gotta rock rock on [Slide and rock on]\nRock rock on, you gotta rock rock on\n[Been waitin' for so long]\nRock rock on, you gotta rock rock on\nRock rock on, you gotta rock rock on\n[Somebody, help meeeeee!]\nRock rock on, you gotta rock rock on [Slide and rock on]\nRock rock on, you gotta rock rock on\n[Been waitin' for so long]\nRock rock on, you gotta rock rock on\n\n[Verse 3]\nWhassup! I tickle your putty-cats with my loonie raps\nOn groovy tracks, I make new jacks catch convulsions like groupie acts\nFrom my city I spread it on like Jiffy\nIt's a mystery, my spliff be live like 145th be\nI mold like Clay, and roll Dice just like Andrew\nI stay \"Strapped\" just like Bamboo, my Cruiser got mad handle\nWhatever, the weather be, I got mental telepathy\nSo throw your bombest rapper and watch me intercept MC's\nI keep my car underground just like the Lords\nEven though I'm known like all the four wheels on the course\nSo let me pull up to your bumper like Grace Jones\n'Cause my shit be WAY off the hook like payphones\nAHH! *dial tone*", "image": "https://images.genius.com/d90c906f33a174fa71425b4dd339eb96.1000x1000x1.jpg"}], "artist": "Redman"}