{"songs": [{"title": "I Hear Voices", "album": "Operation: Doomsday.", "year": "2002-01-12", "lyrics": "[MF Grimm]\nTossing, turning, dreams of murder, someone's killing me\nOf changes, there's nights I'm on a killing spree\nAll done cold blood waking up in cold sweats\nThis is such a cold world unconscious getting death threats\nShadows choking me, my last breath lets out my body\nIt's a conspiracy, my mind and my body's not really down with me\nMe against the whole world? It's a little deeper\nMe against my self, I fight the Grim Reaper\nSwing sickle, I got my Glock bust rounds off\nDemented, schizophrenic, I know this sounds off to you\nI do not lie, when I doze off spirits hope I die, whatever\nAngels waste the time, they work together\nScheme and plot on me, cause I'm the son of man\nI hear voices from a dog like Son of Sam\nDon't give a damn if the bullets fill me\nI don't wanna live, I hope they kill me\nPut me out my misery, I live in misery\nI kill all my enemies, cause I love company\nThose who seek me, are called wise men\nOr either wise-guys I pray you comprehend\nAnd realize I'm condemned\n\nNo rest, homicidal dreams\nMy cellmate, all he do is scream\nOut loud how he wants to go home\nThat's funny, I'm here all alone\nLocked, in a single cell\nHis back's bleeding, he's cold as hell\nAnd I'm hoping, they turn on some heat\nI call the C.O. to bring some extra sheets\n\"Where'd he go?\" he walk through walls, run halls, I pray \"teach me\"\nThey don't see him at the health they try to reach me\nI said \"please see how he feels\"\nThey said, \"He's alright but he's not real\"\nEvaluations say I suffer from depression\nHallucinations, self-creations, what they're guessin'\nI'm here doing years, I'm stressin'\nMedicate me, sedate me want me to rest an'\nDon't take it cause he said that won't be best an'\nHe said I need his help and he needs me\n\"Nigga you walk through walls, go home you're free\"\n\nHome, that was far and he was turned off\nCause his wings was burned off\nA lesson was learned, communicate with one\nI was chosen cause I'm God's son\n\n[MF Doom]\nAnd I'm the retarded one!\n(*sings*) Out in the streets\nYou won't survive with, wack-ass beats (\"We can see that!\")\nThese days and times\nWatch as we get ours with rhymes\n\nTo my Metal Face bros with stomachs of cast-iron\nWho been in to win and blast to the last siren\nOn the slow-mo the calm artist with the so-so chick\nChased them all like how he did to Slobodan Milosovik\nAnyhoo, how 'bout them Yankees?\nOnce I leave off-stage the party people thanks mee's\nIf I may speak freely nasty like the freaky-deeky\nAt your local sleazy speak-easy\nFor any fan of the limelight\nIn the mic stand was left a lit stick of dynamite\nIt's risky business like hand-to-hand crack sale\nWith rappers who's better off on the cover of Black Tail\nJumpin Jehosaphat, who's that?\nWho cats who do magic be like \"tell me how you do's that\"\nHeck no, especially those who cop pleas like gecko\nThought I might do techno\nHa ha, betcha bust out laughing at the bet\nFor no reason he get cussed out like Tourettes\nYet tight flow to make her bad-ass stutter\nOr even crack a smile from a mad fast cutter\nButter, word play since third grade age\nBack when we used to play \"Bang! Open bird cage\"\nHip hop's Benny Hill sip Henny straight, get every penny weighed, then he chill, at any rate\nMy metal-face hoes with tongue or (at) least eye ring\nDo yourself, I will continue to do my thing\nLike Kung-Fu fighting everybody was biting\nAnd the super-villain strike again like lightning\nIn the same spot (bzzz!) now what's the chance of that?\nAnd a name-drop like pick the name out the hat\nThat's a no jiver from the, liver conniver\nWho vote players out the rap game like Survivor while I\nDrop through greens like a nerd cat with intended speech from way back\nAnd spin on your back and then freeze\nWhile I play high-ball, low-ball, to zero\nSo called rhymers, go call Cleo\nWhile I, steal the show like thought-so-try-hiking\nSuper-duper stars need Ortho-TriCylin\nSometimes the men, mostly from the women\nI hear voices saying that's the super-villain\n(Uhh, I hear voices)\nMostly from the women, I hear voices... super-villain", "image": "https://images.genius.com/c0a80e3098696bdf600f54a76667c069.1000x1000x1.jpg"}], "artist": "MF DOOM"}