{"songs": [{"title": "Deep Cover", "album": "First Round Knock Out", "year": "1992-04-02", "lyrics": "[Intro: Snoop Dogg + Cop]\nHit this motherfucker, G\nNo, naw, man, I can't fuck with that\nAw, man, I been dealin' with you for three motherfuckin' months, you ain't hit the pipe in front of me yet!\nSo, what you sayin'?\nI think you 5-0!\n5-0? Man, I ain't no motherfuckin' cop!\nWell, hit this motherfucker then\n(Lights pipe)\n\n[Sample]\n\"I can feel it!\"\n\n[Verse 1: Dr. Dre + (Snoop Doggy Dogg)]\nTonight's the night I get in some shit (Yeahhh)\nDeep Cover on the incognito tip\nKillin' motherfuckers if I have to, peelin' caps too\n'Cause you niggas know I'm comin' at you\nI guess that's part of the game\nBut I feel for the nigga who think he just gonna come and change thangs, with the swiftness\nSo get it right with the quickness\nAnd let me handle my business, yo\nI'm on a mission, and my mission won't stop\nUntil I get the nigga maxin' at the top\n(I hope you get his ass 'fore he drop)\nKingpin kickin' back while his workers slang his rocks\nComin' up like a fat rat\nBig money, big cars, big bodyguards on his back\nSo it's difficult to get him\n(But I got the hook up with somebody\nWho knows how to get in contact with him)\nHit him like this and like that\nLet him know that I'm lookin' for a big fat dope sack\nWith ends to spend, so let's rush it\nIf you want to handle it tonight, we'll discuss it\nOn a nigga's time, and a nigga's place\nTake my strap just in case one of his boys recognize my face\n'Cause he's a sheisty motherfucker\nBut I gives a fuck, 'cause I'm goin' Deep Cover\n\n[Chorus: Dr. Dre + Snoop Dogg]\nYeah, and you don't stop\n'Cause it's 1-8-7 on a undercover cop\nYeah, and you don't stop\n'Cause it's 1-8-7 on a undercover cop\n\n[Verse 2: Snoop Dogg + (Dr. Dre)]\nCreep with me as I crawl through the hood\nManiac, lunatic, call him Snoop Eastwood\nKickin' dust as I bust, fuck peace\nAnd the motherfuckin' punk police\nYou already know I gives a fuck about a cop\nSo why in the fuck would you think that it would stop?\nPlot, yeah, that's what we's about to do\nTake yo ass on a mission with the boys in blue\nDre! (What up, Snoop?) Yo, I got the feelin'\nTonight's the night, like Betty Wright, and I'm chillin'\nKillin', feelin' no remorse\nYeah, so let's go straight to the motherfuckin' source\nAnd see what we can find\nCrooked-ass cops that be gettin' niggas a gang of time\nAnd now they wanna make a deal with me\nScoop me up and put me on they team and chill with me\nAnd make my pockets bigger\nThey want to meet with me tonight\nAt seven o'clock (So, what's up, nigga?)\nWhat you wanna do? (What you wanna do?)\nI got the gauge, a Uzi, and my motherfuckin' twenty-two\nSo, if you wanna blast, nigga, we can buck 'em\nIf we stick 'em, then we struck 'em, so fuck 'em!\n(\"I can feel it!\")\n\n[Chorus: Dr. Dre + Snoop Dogg]\nYeah, and you don't stop\n'Cause it's 1-8-7 on a undercover cop\nYeah, and you don't stop\n'Cause it's 1-8-7 on a undercover cop\n\n[Verse 3: Snoop Dogg + (Dr. Dre)]\nSix-fo'-five was the time on the clock\nWhen me and my homie belled in the parkin' lot\nThe scene looked strange and it felt like a setup\n(Better not be, 'cause if it is, they gettin' lit up!)\nOh, here they come from the back in they 'llacs\nI'm checkin' for the gats they strap, so what's up, black?\n(Chill, let's hear the deal\nIf it ain't up to what you feel, then grab your steel)\nRight, so, what you motherfuckers gonna come at me with?\nHope you ain't wantin' none of my grip\n'Cause you can save that shit (Guess what they told me?)\n\"We give you 20 G's if you snitch on your homie\nWe'll put you in a home, and make your life plush\nOh yeah, but you got to sell dope for us.\"\nHmmm, let me think about it\nTurned my back and grabbed my gat\nAnd guess what I told him before I shot it\nIf you don't quit, yeah, if you don't stop, yeah\nI'm lettin' my gat pop, 'cause it's 1-8-7 on a undercover cop!\n\n[Chorus: Dr. Dre + Snoop Dogg]\nYeah, and you don't stop\n'Cause it's 1-8-7 on a undercover cop\nYeah, and you don't stop\n'Cause it's 1-8-7 on a undercover cop\nYeah, and you don't stop\n'Cause it's 1-8-7 on a undercover cop\nYeah, and you don't stop\n'Cause it's 1-8-7 on a undercover cop\nYeah, and you don't stop\n'Cause it's 1-8-7 on a undercover cop", "image": "https://images.genius.com/600dd97ae61d3afb10f31b6fd47d8e85.600x600x1.png"}], "artist": "Dr. Dre"}