{"songs": [{"title": "The Set Up", "album": "It Was Written", "year": "1996-07-02", "lyrics": "[Produced by Havoc]\n\n[Intro: Nas (Havoc)]\nUhh.. (yeah, yeah, yeah)\nQ.B. since 1933 (no doubt)\nTo nine-six (nine-six motherfucker)\nCheck the shit\n\n[Havoc]\nNine-six, Escobar 600\n\n[Verse 1: Nas (Havoc)]\nCheck the shit\nMy mind's set, son got wet, I'm vexed really\nThey snatched off his Rolex, smacked his bitch silly\nWhy niggas actin' illy? Word to Will, he 'bout to feel it\nI feel it, he shoulda been dealt with it\nThem niggas sour, they put to much flour in their coke\nAnd got the nerve to wonder WHY THEY'RE BROKE\nWhile we was gleamin', niggas was schemin'\nSeen the ill Beamers beamin'\nTriple-beam and doublin' cream had 'em fiendin'\nTo get they fingers on the dosa, I called Sosa\n\"Sosa, these niggas hit the God, bring the toaster\nMeet me in the Bridge, I'm bout to go loca\"\nLeft my rat beggin' me to stay and stroke her\nHe came through with two fly bitches, Venus and Vicious\nWith two MACs inside the Volvo, what up God, I'm still sober\nI need some Henn to bend me over, my nigga Hav gotta soldier\nIt's gettin' down, it's goin' down kid (I got this, I got this)\nI heard he might not live, I'm holdin' back tears\nTold these broads to put it in gear\nWith two females that don't smile, diggin' they style, yo\nWhat up son? These niggas done started somethin' wild\nYou know the clique well, Rhamel with the gold in his grill\nTried to get a name, holding the steel\nI paid attention to the females\nMaintained bitches when it get real\nSos' pulled me close and told me the deal\nHe said both hoes'll peel\nSpray shots and reload and still handle the wheel\nPoint 'em out, smoke a Phil' then chill\nI laid back, Escobar status\nKnowin' The Firm got it cornered, we on it, shit we was born with\n\n[Chorus: Havoc]\nSpark the lye, Q.B.C. yo it's do or die\nIn this, business of trifeness\nI finesse this, Boyardee, we chef shit\nPerfect shit, Albert Einstein minds connect wit'\nDangerous sons, step back let the TEC lift\nLift you up, bless you with a shorty then we set you up\nSpark the lye, Q.B.C. yo it's do or die\nIn this, business of trifeness\nWe finesse this, Boyardee, we chef shit\nPerfect shit, Albert Einstein minds connect wit'\nDangerous sons, step back let the TEC lift\nLift you up, bless you with a shorty then we set you up\n\n[Verse 2: Nas]\nHold it right there, pull over\nThat nigga right there inside the Rover\nI knew he'd be right here, I told you\nLet's get him now, look at him smile, ice Bulova\nPolo pullover, big links and rockin' boulders\nHe's stuntin', after he left my man like that\nWithout a fair chance to fight back, but I'll be right back\nHe never seen us, Sos' gave the MAC to Venus\nAnd Vicious, lookin' delicious, handle yo' business\nAnd step to him, shake your ass, try to screw him\nDo what ya gotta do to get to him\nA tight Parasuco with young faces\nCan turn niggas Buttafuoco, of all ages\nThey was amused by the way they walked, way they talked\nOnly if they knew these girls had sprayed New York\nIf they had to, heard him ask Venus, \"Could I have you?\"\nHe jumped out a Jeep, heard her tell him \"Don't grab, boo\"\nThey started chattin', was only bout a minute, flat when\nThey jumped in the back of the Jeep laughin'\nWe followed them pollyin', he thought the hoes were Somalian\nProbably when they hit the Holiday Inn\nI grabbed the phone and called the Mobb and them\nWe laid low about a hour or so, these bitches movin' too slow\nWe both holdin', what if them wild hoes started foldin'?\nSosa said \"Say no more\", we started rollin'\nBefore we got in they must have shot him, security wildin'\nThere the girls go, hurry up we out\nIn the 940, me, Sosa and two shorties\nThe punk niggas got murdered in the orgy\n\n[Chorus: Havoc]\nSpark the lye, Q.B.C. yo it's do or die\nIn this, business of trifeness\nI finesse this, Boyardee, we chef shit\nPerfect shit, Albert Einstein minds connect wit'\nDangerous sons, step back let the TEC lift\nLift you up, bless you with a shorty then we set you up\n\n[Outro: Woman]\nQ.B.C., Queensbridge motherfucker\nRoping niggas up\nCause our clique is thick\nAnother day, another dollar\nMore money, more murder\nFuck this shit, Q.B. up in the house", "image": "https://images.genius.com/525377dd6bd0f221ead9371b7b53d9a8.1000x1000x1.jpg"}], "artist": "Nas"}