{"songs": [{"title": "When the Money Goes", "album": null, "year": null, "lyrics": "[Hook x2]\nWhen the money goes, will the honey stay?\nWhen the grey skies replace the sunny days\nHey, hey, hey\n\nWhen the top back, I know I got that\nBut when I'm locked up...\nShit, Guru, let me get that again\n\n[Hook x2]\nWhen the money goes, will the honey stay?\nWhen the grey skies replace the sunny days\nHey, hey, hey\n\n[Verse 1]\nI got it now...\nWhen my top back, I know I got that\nBut when I'm locked up, and I'm not back\nAnd I collect call, will she accept that?\nWill she stay down, through my setbacks?\nThrough my downfalls, and my downpours\nWhen them FBI boys is coming down for us\nI know you ride with a nigga through the Gucci store\nAll through Prada, but what if I had nada?\nWould the babe even bother if the block got hotter?\nIn the never-ending game that pits the cops versus robbers?\nAm I your Clyde, or are you just along for the ride?\nWhen I'm blasting out the window, will you grab the wheel and drive?\n\n[Hook x2]\nWhen the money goes, will the honey stay?\nWhen the grey skies replace the sunny days\nHey, hey, hey\n\n[Verse 2]\nWhen I fall off, and the drought hits\nAnd it knocks me, out new outfits\nAnd the charm you got gotta hit the pawn shop\nAnd you feel like crying, but be strong and stop\nIt was all good just a week ago\nNow I'm wearing the same clothes a week in a row\nTrying to scratch back\nWould she take a little check from her little job like\n\"Nigga, you can have that\"\nYou have belief in me, or would you beef with me?\nIs the good life the only thing you needed from me?\nWould she roll out? Is she so out, when the stoves out?\nOr will she hold out?\n\n[Hook x2]\nWhen the money goes, will the honey stay?\nWhen the grey skies replace the sunny days\nHey, hey, hey\n\n[Verse 3]\nAnd your friends know what Hov get it in for\nBut let's just say that I didn't ride Benzo\nWould you say, \"Girl, why you still with him for?\"\nAnd if so, babe, why you around them hoes?\nAll they see is paper, not potential\nAnd they don't have a nigga's back when he's in limbo\nAnd I ain't asking you to do a life bid with me\nI don't want you to die for me, baby, live with me\nI'm just saying, when the going gets rough\nDon't forget all the shine at the time I was showing up\nShow me the same love you showed me when blowing up\nYou told me it was Roc for life, then throw it up\n\n[Hook x2]\nWhen the money goes, will the honey stay?\nWhen the grey skies replace the sunny days\nHey, hey, hey", "image": "https://images.genius.com/bf0f68ee56f29c8542ad805c6419682b.676x676x1.jpg"}], "artist": "JAY-Z"}