{"songs": [{"title": "What’s Beef?", "album": null, "year": "2015-05-15", "lyrics": "[Hook]\nWhat's beef? Beef is when you make ya enemies start the Jeep\nBeef is when you roll no less than 20 deep\nBeef is when I see you\nGuaranteed to be in ICU, motherfucker\nWhat's beef? Beef is when you make ya enemies start the Jeep\nBeef is when you roll no less than 20 deep\nBeef is when I see you\nGuaranteed to be in ICU, motherfucker\n\n[Verse 1]\nNowadays it's silly, niggas beef for nothing\nThe type of shit that make the hippies throw up peace for nothing\nBack in my day, there wasn't silencers to hide the 8 up\nSo if it's beef, be sure to order side of baked potato\nI've got amigos on my payroll, Quavo gave me guelo\nFuego, beef up on my plate is no mistake\nHahahahaha, check out the Chopard\nFor sure, I'm Shakur out the window of my car\nSpitting at the cameras and I flood the club with dancers\nI used to roll with hammers back when Sway had all the answers\nNow it's spread like cancers in this German\nAnd these niggas want me gone for certain\nAnd that's what I call beef, you vermin\n\n[Hook]\nWhat's beef? Beef is when you make ya enemies start the Jeep\nBeef is when you roll no less than 20 deep\nBeef is when I see you\nGuaranteed to be in ICU, motherfucker\nWhat's beef? Beef is when you make ya enemies start the Jeep\nBeef is when you roll no less than 20 deep\nBeef is when I see you\nGuaranteed to be in ICU, motherfucker\n\n[Verse 2]\nUh, Puffy swag combs, call me Sherlock Stallone\nDaddy NASDAQ or call me Puffy Dow Jones\nCome fuck with Puffy, dirty money since the scruffy Puffy\nThey want me bloody, hungry, ugly, crusty, musty Puffy\nSee that motherfucking phantom? Then it must be Puffy\nIt's like lately, all the ladies say is \"fuck me, Puffy\"\n80 million records was projected\nMy leverage breaking records, it's like 80 women naked\nHectic, paranoia got me feeling threatened\nSo I'm loading up my weapons up like every other second", "image": "https://images.genius.com/84260afdfa02f8cba4117c80ac6c847b.1000x1000x1.jpg"}], "artist": "A$AP Rocky"}