{"songs": [{"title": "Let’s Grow", "album": "Build and Destroy", "year": "2000-11-28", "lyrics": "[Intro]\nReal niggas only\nFirst of all, what's my name\nFive-Nine\nYeah, I got something for you\nI got something for you, yeah\n\n[Verse 1]\nThey call me Royce 5-9 or Mr. Always Ice Cold Wristed\nOr Mr. None Of Your Business\nMr. Consistant In Conflict, for so dope lyrics\nThe hardest hitting nigga in show business\nCame in this game with a pissy-ass attitude\nArrogant like, shut up\nLaughing that you a trick\nI wasn't happy before but I'm happy today\nI'm rapping today, looking to get a plaque in my day\nSo I met this White boy one night\nWho turned out to be the illest human being I ever heard in my life\nHe took me under his wing and showed me some things\nAnd molded me into a pro until the flow was mean\nTaught me not to do it like this, but to do it like that\nThrew me all types of love and I threw it right back\nThough we don't talk as much, we never let the game consume us\nCause we too real, my nigga Slim, let's grow\n\n[Chorus]\nLet us grow up, now we got here\nWe can't stop here, we too far\nAll my niggas, y'all my niggas\nAnd you all know who you are\n\n[Verse 2]\nRoyce 5-9 or, twelve men in one\nAbout as explosive as them shells in your gun\nMr. Quick To Pull A Thing On You just for your loot\nMr. Mr. Mr. Quick To Swing On You before he shoot\nI'm the finest tuned rapping machine rapping a scene\nSince, way back when there was only rapping in Queens\nSuck my balls if you competing with me homeboy\nI don't dream, I'm the type to just be homeboy\nSucka free is like a religion I honor and serve\nAnd more common in words, a song with you, what's in it\nY'all niggas is all punks and your jewels is rented\nAnd your diamonds is all dark, like they blue but tinted\nI would never kill none of y'all, I ain't that fool\nBut I will stomp the shit out you, I ain't that cool\nYou ain't even gotta greet me when you see, matter of fact\nYou better give me five feet when you see me, where you at\nLet's grow\n\n[Chorus]\nLet us grow up, now we got here\nWe can't stop here, we too far\nAll my niggas, y'all my niggas\nAnd you all know who you are\n\n[Verse 3]\nRoyce 5-9 or, one cent nigga\nBitches know that with me that the cum gets quicker\nMr. Always Got Some Cris' Or A Pistol\nRather diss you than chill wit you and will hit you\nThe insanest monster that came and conquered\nA game that remains to be full of trained imposters\nI will not let you niggas talk to me, no way\nThis is not what I'm here for, give me my money\nFaggots only attract faggots, and that's that\nYou rap rat, you fuckin roaches and black maggots\nFeelin my heat, I talk shit from the moment I wake up\nTurn right around and talk shit in my sleep - let's grow\n\n[Chorus]\nLet us grow up, now we got here\nWe can't stop here, we too far\nAll my niggas, y'all my niggas\nAnd you all know who you are", "image": "https://images.genius.com/d86b45b993cdf0c53559e740521a4bba.500x494x1.jpg"}], "artist": "Royce da 5'9'’"}