{"songs": [{"title": "What If", "album": "Get Rich or Die Tryin’ Soundtrack", "year": "2005-11-08", "lyrics": "[Intro]\nYeah, I'm fuckin' with this\nIt's that classic shit, that gangsta shit, yeah\n\n[Chorus]\nMan I watched the sun go up but come down - sayin' what if?\nMan I watched the tide roll in and roll out - sayin' what if?\nHomie I play the block tryin' to get my packs off - sayin' what if?\nMan if I get a shot, I could make it to the top - damn what if?\n\n[Verse 1]\nIf I got on some pretty boy shit like Puffy\nNiggas in the hood, man they just wouldn't love me\nIf I wore a suit every day like Jay-Z\nNiggas would think I bump my fuckin' head and went crazy\nIf I put diamonds in my teeth like Baby\nI wouldn't stand a chance of tryin' to sell like Shady\nIf I put out bullshit joints like AZ\nEvery chance niggas get, they'd try and play me\nBut I move around with a little .380\nA nigga try to stunt, a nigga get sprayed B\nIf I smoked weed all day like Snoop do\nI'd see the world different through my dilated pupils\nIf I bust dance moves on you like Usher\nNiggas'll say \"50 that ain't gangsta, fuck ya\"\nMan I'ma just keep doin' what I do\nCause niggas can't do me, better than I do, ha ha\n\n[Chorus]\nMan I watched the sun go up but come down - sayin' what if?\nMan I watched the tide roll in and roll out - sayin' what if?\nHomie I play the block tryin' to get my packs off - sayin' what if?\nMan if I get a shot, I could make it to the top - damn what if?\n\n[Verse 2]\nWhat if I had blockbuster flicks like Will Smith?\nAnd all the backpack niggas loved me like Mos Def\nI'd probably be a cool-ass nigga like Ice Cube\nPicture me in this flick right now lookin' so cool\nWhat if I was a low-key nigga, just laid back?\nHustle to keep a homie 'round, somebody to hold the gat\nMan what if Halle Berry was my next baby moms?\nShit I'd give that child support up with no problems\nIf I caught a case and jumped bail I'd get caught\nCause I'm that nigga everybody know from New York\nBut if I was the new rap nigga you didn't know\nYou'd be sayin' \"Damn that kid got a sick flow\"\nWhat if I just cruised through your hood on 22's\nBumpin' Curtis Mayfield or Marvin, somethin' smooth\nAnd if I let the top down on the Azure\nYeah that'd make you sick to your stomach I'm sure, ha ha\n\n[Chorus]\nMan I watched the sun go up but come down - sayin' what if?\nMan I watched the tide roll in and roll out - sayin' what if?\nHomey I play the block tryin' to get my packs off - sayin' what if?\nMan if I get a shot, I could make it to the top - damn what if?", "image": "https://images.genius.com/312964ccc0d0d604db10044f85c36fb0.1000x1000x1.jpg"}], "artist": "50 Cent"}