{"songs": [{"title": "Hellbound", "album": "Off The Wall", "year": "2002-04-22", "lyrics": "[Intro: Announcer from Soul Calibur]\nWelcome back to the stage of history\n\n(Yo, Slim Shady!)\n\n[Verse 1: Eminem]\nYo, I'll fuckin', I'll... I'll puke, eat it, and freak you\nBattle? I'm too weeded to speak to, The only key that I see to defeat you\nWould be for me to remove these two Adidas and beat you\nAnd force feed you 'em both, and on each feet is a cleat shoe\nI'll lift you off your feet so fast with a roundhouse\nYou'll think I pulled the fucking ground out from underneath you\n(Bitch!) I ain't no fucking G, I'm a cannibal\nI ain't tryin' to shoot you, I'm tryin' to chop you into pieces and eat you\nWrap you in rope and plastic, stab you with broken glass\nAnd have you with open gashes strapped to a soakin' mattress\nCoke and acid, black magic, cloaks and daggers\nFuck the planet 'til it spins on a broken axis\nI'm so bananas I'm showing up to your open casket\nTo fill it full of explosive gasses and close it back\nWith a lit match in it while I sit back and just hope it catches\nBlow you to fragments, laugh, roll you, and smoke the ashes\n\n[Hook: J-Black]\nI see the light at the end\nBut every time I take a step it gets dim\nTell me, is this Hell we're livin' in?\nIf so, Heaven's got to be better\nBut if we're hellbound, whatever, let's go down\nI see the light at the end\nBut every time I take a step it gets dim\nTell me, is this Hell we're livin' in?\nIf so, Heaven's got to be better\nBut if we're hellbound, whatever, let's go down\n\n[Verse 2: J-Black]\nAm I the worst because I never go to church?\nI run a red light then sideswipe a hearse\nI'ma drink till my liver rot, see the doc leave the E.R\nThen hit a bar for a liquor shot; fuck the liver spot!\nOne day we all gon' die\nBut when I die, I'ma be so high\nThat I'ma get up and walk, leaving the concrete bare\nWith the chalk outline still there\nI smoke 'til I choke and I sex a lot\nI got a cross on my chain, but it's just to rock\nNow if I pray every night\nDo I still have to hold my tre very tight?\nYou feel me, God? I done did so much shit while on Earth\nI smoke, I drink, I curse, and to make matters worse\nI bust my gun first, and then I chat with your corpse\nSince way back, I was one to never like back-talk\nSee me at the pearly gates in line, wearing a North Face\nNickle 9 at my waist, God done lost faith\nAngels greet me, but I don't reply back\nJust show me to my quarters, and oh yeah, where's Thai at?\n\n[Hook: J-Black]\nI see the light at the end\nBut every time I take a step it gets dim\nTell me, is this Hell we're livin' in?\nIf so, Heaven's got to be better\nBut if we're hellbound, whatever, let's go down\n\n[Interlude: Announcer]\nMaxi was seriously wounded\nBut the soul still burns\nFinal battle, fight!\n\n[Verse 3: Masta Ace]\nAnalyze the strength of my game, like Lee Corso\nCall me a lost soul, with a vest on my torso\nAnd of course, yo, y'all know I'm no stranger to danger\nLike Christ in a manger, feel a whole range of my anger\nI breathe down shit so hard you can see sound\nAnd beat down these rap clowns in like three rounds\nMy pen 'bout as sharp as a dagger, walk with a swagger\nTie your wife to the back of a black Jag and I drag her\nTen blocks, untie the bitch, and I still bag her\nGive her a smack in the ass and a six pack of lager\nMy shit go as deep and as dark as a train tunnel\nMy flows spill, like using the wrong end of a funnel\nEveryday I grow more older and more colder\nFly you to Colorado, roll you over with a boulder\nI know you want to retaliate but you won't dare, ‘cause you fucking with some niggas like this who just don't care\n\n[Hook: J-Black]\nI see the light at the end\nBut every time I take a step it gets dim\nTell me, is this Hell we're livin' in?\nIf so, Heaven's got to be better\nBut if we're hellbound, whatever, let's go down\n\n[Outro: Announcer]\nTime's up! You lose!\n\nGotham!", "image": "https://images.genius.com/e692d6f7a660a6e7088d7c7049764818.300x265x1.jpg"}], "artist": "Eminem"}