{"songs": [{"title": "U.B.R. (Unauthorized Biography of Rakim)", "album": "Street’s Disciple", "year": "2004-11-30", "lyrics": "[Intro]\nThe unauthorized copy\nDedication to my children, my child, Destiny Jones\nTo my niece and nephews, Suree, Malik, Jabari\nThe world is yours\nAcknowledgements: first off I wanna thank God\nAnd I wanna thank everybody for helping me out with this\nCouldn't do it without you. Chapter 1\n\n[Verse 1]\nJanuary 28, 1968\nBorn into this world, William Griffin The Great\nChapter 1, Wyandanch, Long Island\nScientific rhyming invented a new style when\nHe met with Eric Barrier from East Elmhurst\nThe melody they created was the first\nBurst on the scene 1986, with clap to this\n'87 dropped a classic disc\nThe facts is the tracklist was like full\nThe vocals, the beats, according to Marley Marl\nRecorded in my hometown Queensbridge\nThat's why it's so relative\nThis biography was unauthorized\nI spit it how it was given to author Nas\nWilliam changed his name at sixteen to Rakim Allah\nCause Clarence 13X had New York on lock\nGods on every block, jams in every park\nI remember hearing Kurtis Blow saying\n\"It can't get better than this\"\n'Til Run DMC blew my brains to bits\nFrom leather coats to shell toes to the Stan Smiths, to Dapper Dan kicks\nFirst million-dollar deal ever in rap\n18th Letter did that\nFrom 4th & Broadway to Uni to MCA\nWe followed the leader to Harlem's Apollo Theatre\nSupreme, Rap and the 50 that don't rap\nFort Greene, Queens, Long Island wolfpack\nPaid In Full posse, hot they was on\nAnd Ra had his firstborn\nWith the next line I'ma be easy\nHis wisdom's name is Fifi\nEPMD put a record out, was dope\nTension spread, and I quote\n\"Smack me and I smack you back\"\nSounded like the answer to the \"I Ain't No Joke\" track\nFor a second it ain't look good\nLittle tension buzzing from Wyandanch to Brentwood\nMisunderstood, all forgot\nAt sixteen when I met Freddie Foxxx\nToting burners, the whole coast's most concern was\nHow has Rakim's flow made Christians convert with Islamic ways\nLet The Rhythm Hit 'Em was the third LP\nA sophisticated mean one\nBefore similar voices were King Sun\nA few others, but sooner or later, the game was Ra's kingdom\nAt sixteen, son was watching him, mesmerized\nRespect, not jocking him, was so amazing, besides\nHe came on the stage with lasers in his eyes\nWalk with me now\n\n[Outro]\nUnauthorized Biography of Rakim\nEpilogue: Mother was a jazz singer\nNephew to R & B legend Ruth Brown\nDiscography: Paid In Full, Follow The Leader, Let The Rhythm Hit 'Em, Don't Sweat The Technique\nThat's the end of the group, went on for solo\nDropped \"The R\", then The 18th Letter, then I think something, The Master\nWas signed to Aftermath\nScheduled to release an album Oh My God with Dr. Dre\nThe album was dismantled because of creative differences\nThe end\nTo the new beginning, yeah\nNext book, KRS-One. Peace", "image": "https://images.genius.com/65c98702fc773f6dafd41563fe5c5485.500x500x1.jpg"}], "artist": "Nas"}