{"songs": [{"title": "Grand Herbalizer", "album": "SouthMatic", "year": "2019-06-21", "lyrics": "[Intro]\nGlorious\nDecatur Eastside, ATL\nYou can't hotep your way out sissy\n\n[Chorus: Brother Panic]\nGrand Herbalizer, what time is it?\nThe Gods have come, the dark side speaks\nGrand Herbalizer, what time is it?\nB-Bobby in it for the strong, hotep for the weak\nGrand Herbalizer, what time is it?\nWe come from the East to teach in the West\nGrand Herbalizer, what time is it?\nThe masters teach, my science is deep\n\n[Verse 1: B.o.B.]\nIn a light prison doin' a light sentence\nA mix between DJ Scratch and Jimi Hendrix\nNiggas always hang the hero so I'm the villain\nThe bad guy, the Joker, the end, the beginnin'\nI thought slavery was over, it just got remolded\nThey stole what was yours and back to you they sold it\nThe same ones that be sayin' down with the systems\nThe same motherfuckers investin' in prisons\nPrivate free labor, I am the staple\nWent independent and said fuck the label\nThe eyes of these haters say how are you able\nTo do what you want and keep food on your table?\nShe cried when Obama got elected\nShe cried when Trump got elected\nBitch went vegan cause of Netflix\nTell me why she's still a diabetic\nNiggas still rap don't know where rap came from\nSo how the fuck you gon' tell me where slaves came from\nYou don't know where your name came from\nLike the World Trade ain't know where them planes came from\nBefore they give you niggas titles\nBefore they give you niggas bibles\nBefore they give you niggas rifles\nAnd they say it's all cycles\n12 months, 12 notes, 12 tribes, 12 disciples\n\n[Chorus: Brother Panic]\nGrand Herbalizer, what time is it?\nThe Gods have come, the dark side speaks\nGrand Herbalizer, what time is it?\nBobby in it for the strong, hotep for the weak\nGrand Herbalizer, what time is it?\nWe come from the East to teach in the West\nGrand Herbalizer, what time is it?\nThe masters teach, my science is deep\n\n[Bridge: Brother Panic]\nOpening gateways with our mind (Come on y'all)\nThis is an invitation (Come on, come on)\nDark side niggas only\nBob, what you think the government gon' do?\n\n[Verse 2]\nNigga they watchin' your ass to see what you gon' do\nTo see what you gon' say, to see how you gon' move\nAnd hide the truth in books 'cause reading you won't do\nSomething greater than goin' vegan and shea butter\nSomething greater than eucalyptus and face scrubbers\nSomething greater than chem trails and GWEN towers\nSomething greater than Ph.D's and brain power (Come on y'all)\nTrees that you can't uproot\nProblems a computer can't do\nPeople that the cops can't shoot\nThat a bomb can't nuke\nThat the news can't spook\nHuh, but still that bag, I want it\nIs money their god? or the faces that they plastered on it\nHa look, I never blame the other team\nThey live by a book that my oppressor gave me\nThey hit you with a Clinton then they hit you with a Bush\nThen Obama then a Trump, keep you runnin' 'round a bush\nRun around a bush, run around a bush\n\n[Chorus: Brother Panic]\nGrand Herbalizer, what time is it?\nRun around the bush, ru-run around the bush\nGrand Herbalizer, what time is it?\nTime to roll up kush, t-time to roll up kush\nGrand Herbalizer, what time is it?\nThe Gods have come, the dark side speaks\nGrand Herbalizer, what time is it?\nBo-Bobby in it for the strong, hotep for the weak\n\n[Outro]\nRiding the crossroads, this is the [? 3:10] sissy\nVegetables are not the key to enlightenment", "image": "https://images.genius.com/a9a03f89f8f3d7ce8b4db691d6f598db.800x800x1.jpg"}], "artist": "B.o.B"}