{"songs": [{"title": "West Coast Eclipse", "album": "2012's XXL Freshman Mixtape ", "year": "2012-04-10", "lyrics": "[Verse 1]\nWhen I rap, I like to seem wack at first\nAnd rhyme cheap words, like curse and verse\nAnd once it passes like one or two bars\nI turn the switch on and start crushing fools hard\nWho said the west isn't consistent, I'm fixing to fix it\nFor all these niggas who listening and living imprisoned\nI'm thinkin' it isn't missing it's villain, killing them image\nNow I'mma rip this, now witness it as I finish the sentence\nLosing hip-hop was a tragic loss but I found it and glued it right\nTo my dick so if you want it you'll have to jack it off\nRappers acting soft as a fabric cloth, I'mma smash 'em all\nTheir nuts are like berries, mines are the size of basketballs\nI choke MCs out with a strong vice grip\nThen beat them with the sticks from the cross that they hung Christ with\nHead to the club then pull me a sprung white chick\nYou all know how Hop gets down, he one nights it\nI sleep walk at night with a bunch of madness\nMob through the halls and talk with a Russian accent\nReady to kill like I'm a real thug assassin\nWho beat my dad's ass and wake up like nothing happened\nI'm ruthless, and I do drop bombs\nI got fools in the valley like, \"Dude, nuh-uh!\"\nWhen my album drops make sure that you cop one\nWe need a raw fool like me since 2Pac's gone\nWack rappers like, \"Hop, I'll disable you in the booth!\"\nI'm like, \"For real? That's a fatal attempt to do!\"\nYou thinking you spit the truth, I shake you and strip your jewels\nThen hang you up from a roof, and strangle you with a noose\nCremate you with four torches, flame of the torch scorching\nLeaving your corpse tortured of course it's hardcore shit\nAnd if there's ever a day that my pockets hurting\nI'm robbing you, with a Osama Bin Laden turban\nHip-Hop is urging for a new flock of verses to rock the circuit\nAll you flops emerging are pitiful, we did not deserve it\nYour style ain't even worth the fame\nIt's watered down more than New Orleans during a hurricane\nYour whole album was a verbal shame\nI'm Hopsin, don't act like you ain't heard the name", "image": "https://images.genius.com/1e8fdc1687a90eefafe7d0df777a9347.620x620x1.jpg"}], "artist": "Hopsin"}