{"songs": [{"title": "Switch", "album": " Defending The Crown Part 2 - Kiss The Ring ", "year": "2004-10-26", "lyrics": "[Royce Da 5'9\"]\nYeah.. nigga pick up yo', hands and pretend\nJust like if it's a, show - the lyrical cut throat\nHe can and we will show, you BRRTTT, stick up yo'\nMan with his pis-tol, hand over his {HO!}\nLo and behold, plenty soldiers is rollin\nThe road that they own is the one where they go\nWhen they gets me the pinnacle of the nigga\nHold-in the pencil, any flow, nigga pick one {HO!}\nI treat my rhyme like heat my mind\nMight be like keen-eye sight\nI treat y'all like \"Three Blind Mice\"\nYou can't hit what you can't see, the M.I.C. {HO!}\nThis is the shit that you wish you could spit\nWhen you sit and you listen to the clique that is swift with the written\nThe poetry depicted officially blowin you little niggas away\nBout to switch up the flow, soon as you hear me say {HO!}\n\n[Hook: Royce]\nMake, that flow; switch, that flow\nGet, different when you hear me say {HO!}\nMake, It Count; step, yo' game up\nWhen you hear me say {HO!}\nMake, that flow; switch, that flow\nGet, different when you hear me say {HO!}\n.. get wild (whyllllle out!) Whyle out {HO!}\n\n[Cutty Mack]\nLong as I'm breathin I'm street bitch\nCut Throat ain't changin but the flow might switch\n\n... A whole Army with shit\nThat'll hit you in under five minutes, barkin bitch\nStarvin pitt, to the point of do or die\nWhether CRACK-in around or the MAC by my side {HO!}\n... Money to burn, hustle to earn\nBullets return, shots from the curb, dodgin a drought\nMakin It Count, slang in the South, bang out a house\nCoke by the ounce, weighin it out, that's what I'm 'bout nigga {HO!}\n... The call done, hit me\nThe law come, quickly; nerves in a, frenzy\nFlush the work, quickly; room drawers, empty\nTwo heaters, with me; three flow; sickly {HO!}\n\n[Hook]\n\n[Rell]\nLet it touch your brain, what I brung was flame\nPlus my whole gang doin the same thang\n\nTake it and keep movin, homies is straight cruisin\nQuick with the waist movement, go get your eight losers\nHow you take amusement, never fake I shoot it\nA.K. or Ruger, we heavy with them uzi's {HO!}\nFace the facts, y'all spittin basement raps\nI'm on wax with some dangerous cats with a guage attached\nThe rifle the brace attached to the bat\nI pull it back and squeeze until it claps {HO!}\nAmazin vision, I gaze at the days I'm livin\nThe fast life with a rave of women\nToday is givin, I wake without a stay in prison\nAnd I hang with gangsta niggas - muh'fucker! {HO!}\n\n[Hook]\n\n[June]\nAlways on deck, what you expect\nMic is a way of life, he leadin the set\n\nNow, June's up in this muh'fucker\nAnd I want all y'all to know (all y'all)\nYou can go any time, so why waste time?\nAs I get right to my flow, y'all don't hear me though {HO!}\nWhy play yourself? (why?) Why risk your health? (why?)\nWhy waste my time? (why?) Learn how to rhyme (uhh)\nGet you some game (uhh) get you a name\nGotta not be lame, y'all sound the same, yeah {HO!}\nThey back's against the wall now (now)\nI'm came with some bangers who came for the get-down\nMy style, can't take what you can spread 'round\nI'm multiple figures in riches, so what now? (nigga)\n{HO!}\n\n[Hook]", "image": "https://images.genius.com/cd9172649c4be5e25b673a95fee73f73.400x400x1.jpg"}], "artist": "Royce da 5'9'’"}