{"songs": [{"title": "Mike Tyson Flow", "album": null, "year": null, "lyrics": "[Mike Tyson talking]\n\nI'm the best ever\nI'm the most brutal and most vicious, and most ruthless champion there's ever been\nNo one can stop me, I'm the best eva!\n\n[Verse 1]\n\nUhhn! like mutha'fuck all yawl\nMr. Mike Tyson flow, uppercut all yawl\nStep into my ring bitches, ding ding bitches\nClick clack pow pow ping ping bitches\nI'm the Dream machine I mean King vision\nI can see through yo scene like clear screen\nHear me? To a lion you are just deer meat\nFear God, fear me siry us us\nPe pi them try them and die when I say so\nWeezy F hardful red go like Craig go\nIt's all gravy, tryna build like Lego's\nBetta \\\"Let Go My Ego!\\\" with some breakfast on the table\nYeah! And I don't know how fake feel nigga, cuz all my life, I been a real nigga\nFuck ya girlfriend, fuck ya homie too\nI drop bombs I'm in the booth, in a army suit\nAnd I'm armed to shoot, and I'mma marksmen too\nAnd you're the target \\\"oops!\\\"\nAnd everything get better with time, and time is forever\nAnd mutha'fucka its my time and I'm better\n\n[Mike Tyson talking]\n\n[Verse 2]\n\nHo I go so hard\nI'm so gone my I.D is a post card\nI travel like b-ball with no calls\nI play my role and listen out for the roll call\nThis is a movie and every movie must go off\nBut this gangsta doesn't die like O-Dogg\nSay what up blood, what the lick read!?\n5 star general, in the 6 speed\nStill hood like thick cheese, bitch please\nHim squeeze quicker than the wind breeze\nNiggas betta trim trees\nSimply shoot yours empty if b turn dat thick cheese to swiss cheese\nFolla me! A part of me!\nFuck around and see a whole notha side of me\nI separate yo body with them hollow tips; biologist\nPhotographies, picture me in yo bedroom with a mask on\nPistol to yo head while you puttin' yo pants on\nPeyton Manning offense, Singletary defense\nSuper-duper-extra-much-really-very-street shit\nThat is how I keeps it, R.I.P Beepsy\nI do it how I do it cuz I know my niggas see me\nAnd I'mma hold it down bitch, hope that crown fit\nThe boy got a flow, that you can drown in\nWhen you in the water watch them sharks, when you in the water watch dat salt\nYoung Carter no floss that was so raw ohw!\n\n[Mike Tyson talking]\n\nMy style is impetuous\nAnd I'm just ferocious, I want to eat his heart..\n..I wanna eat his children\nPraise be to Allah!\n\n[Verse 3]\n\nHAHAUHWH!\nFuckin' right I'mma monster\nSharper than a blade like Sticky Fingaz or Sonia\nMortal Kombat Street Fightin' like E-Honda\nMurk ya and da dummies dat signed ya, whats really\nAre ya plastic? Gasoline on ya contract\nFuck a pen I need a match, Fuck a bitch I need a batch of bitches\nYawl niggas act like a bunch of bitches, blood bitches leave ya in a tub\nBlood bitches, young niggas, Young Money, young niggas, fuck pistols\nWe at yo window with SCUD missles, Young Carter!\nBig nuts, and they hung further than ya father's\nHahahaha\n\n[Mike Tyson talking]\n\nYou guys can't define me\nI define my work as a father\nI'm many things--\nYou know, I'm many things..\nIma, Ima.. Ima hellraiser, Ima father--a lovin' father\nYeah, yeah I'm pretty much Tyson", "image": "https://images.genius.com/f903dae2533e450c8d3cb233aa846020.745x745x1.jpg"}], "artist": "Lil Wayne"}