{"songs": [{"title": "On Top of the World", "album": "Paper Trail", "year": "2008-09-29", "lyrics": "[Intro: Ludacris and (T.I.)]\nRich by popular demand (The wait is over homie)\nYes, it is! A-Town, connect!\n(Know the city gon' feel this) Damn right!\nSay Toot, I know you see me\n('Cris!) What up, boy?\nI know both our pops lookin at us\nWayne Bridges, what up? Let's go!\n(Big Phil, we made this shit happen, homie)\nHistory in the makin'! (Momma I did it!)\n\n[Hook: B.o.B.]\nI used to dream (I used to dream) ohh-whoa (ohh!)\nAbout the money and the cars and girls (and the girls)\nBut now I see (now I see) ohh-whoa! (ohh!)\nBecause I'm sittin on top of the world! (the whole world)\nAnd now I see (ay) see (ay) see (ay) see (ay)\nCause I'm sittin on top of the world! (ay, ay, ay, ay)\nAnd now I see (ay) see (ay) see (ay) see (ay)\nCause I'm sittin on top of the world! (ay, ay, yeah, yeah)\n\n[Verse 1: T.I.]\nMan, I remember, 'fore I say that, wait, let me issue this statement\nNo way should reflection be mistaken for glorification\nNow, I remember so vivid, me and my niggas was livin'\nSub-standard condition, still handling business\nStill laughin' and trippin', still having the bitches\nI'm rapping now, reminiscing, and goddamn it, we did it\nFrom trappin', standin' & pitchin' with rich we stand in the kitchen\nSplittin' it eight ways, flip it in eight days\nThought that wild and unruly was just the way to behave\nKept the weight and the yay', but most the paper we made\nIn all dimes, I ain't lyin, the pleasure was all mine\nHad big work to move, but we served the small time\nI always outshined the niggas with small minds\nWho woulda thought we'd be arguably the greatest of all time\n'Round here? we develop such a sound down here\nBeen duplicated often, still, can only be found here\nOnly listen to Gs, that other shit I don't hear\nShit, they so far in the rear, why would I even care?\nI'm too busy a player, steering niggas careers\nBeen talkin 'bout it for years, and now we finally here\n\n[Hook: B.o.B.]\nI used to dream (I used to dream) ohh-whoa (ohh!)\nAbout the money and the cars and girls (and the girls)\nBut now I see (now I see) ohh-whoa! (ohh!)\nBecause I'm sittin on top of the world! (the whole world)\nAnd now I see (ay) see (ay) see (ay) see (ay)\nCause I'm sittin on top of the world! (ay, ay, ay, ay)\nAnd now I see (ay) see (ay) see (ay) see (ay)\nCause I'm sittin on top of the world! (ay, ay, yeah, yeah)\n\n[Interlude (Over Hook): Ludacris]\nLuda!\nHear my heart on this one!\nTrue story!\nRest in peace, Wayne Bridges!\n\n[Verse 2: Ludacris]\nThey say what goes up must come down, but I ain't reach my cruisin' altitude (nope!)\nTake a look at what I did, but can you imagine what I'm about to do?\nThe places I'm 'bout to go and the money I'm 'bout to see\nGave Bill Gates some binoculars and said, look out for me\nExceeded expectations, even at Def Jam\nCause I married the streets and Atlanta has been my best man\nMy momma quit her job and now she works with six figures\nCause I'm a self-made, nappy-headed rich nigga!\nPrivate planes help me travel in peace\nTo four cities in one day and four countries in one week, 'cause I\nWork for myself and no one else cause I'm too smart to\nPut one of my partners right through culinary art school\nNow he my personal chef, so that bread, he get it\nPut 'em all in houses, cleaned up all of my friends' credit (true!)\nAnd now they witnessed all the glitz and the glamour\nCatch us eatin' at Straits Atlanta with women with table manners\nOrdering Singaporean lobster, celebrating coming from nothing\nTo winning Grammys, and rappers winning Oscars, yeah\nAnd they say rappers shouldn't act, nah, suckers\nWe see Samuel L. Jackson, like, \"Wassup, motherfucker?!\"\n\n[Hook: B.o.B.]\nI used to dream (I used to dream) ohh-whoa (ohh!)\nAbout the money and the cars and girls (and the girls)\nBut now I see (now I see) ohh-whoa! (ohh!)\nBecause I'm sittin on top of the world! (the whole world)\nAnd now I see (ay) see (ay) see (ay) see (ay)\nCause I'm sittin on top of the world! (ay, ay, ay, ay)\nAnd now I see (ay) see (ay) see (ay) see (ay)\nCause I'm sittin on top of the world! (ay, ay, yeah, yeah)\n\n[Verse 3: T.I.]\nI know them haters don't stop plottin' and wishin' we fall\nCause I'm standin' on top lookin' down at it all\nI know from down there to y'all, it seems like I got it all\nHomie, I ain't get enough, we still tryin' to triple up\nThat's why we got StreetCred and Akoo building up\nSay I'm doing too much, shit I say I ain't did enough\nRemember sayin', \"Damn, if I could just get to a million plus\"\nAnd now I'm like, \"Shit, what the fuck is a million bucks?\"\nTripled that on my bond thanks to Biggs and Run\nBut never mind what I been through, just look at what I become\nAll this shit I've avoided, what I done for my sons\nAnd daughters and momma, just call her, I sold dope\nAnd dropped out of school, seems that's all they can see\nThey don't notice none of my family did that since me\nI broke that cycle, now my family live a life of\nMandatory minimums, but not when the judge sentence 'em\nCousins in college, where you think they get tuition from?\nJust from standin 'round wishin, huh?\nAnd while you standing 'round lookin' dumb, I make it happen\nTakin' action, over time, got damn good at it\n\n[Hook: B.o.B]\nI used to dream (I used to dream) ohh-whoa (ohh!)\nAbout the money and the cars and girls (and the girls)\nBut now I see (now I see) ohh-whoa! (ohh!)\nBecause I'm sittin on top of the world! (the whole world)\nAnd now I see (ay) see (ay) see (ay) see (ay)\nCause I'm sittin on top of the world! (ay, ay, ay, ay)\nAnd now I see (ay) see (ay) see (ay) see (ay)\nCause I'm sittin on top of the world! (ay, ay, yeah, yeah)", "image": "https://images.genius.com/cfd0caa9a36fd23db9dec05ae1a43aed.953x953x1.jpg"}], "artist": "T.I."}