{"songs": [{"title": "Don’t Go To Sleep", "album": null, "year": "2006-11-18", "lyrics": "[Verse 1: 2Pac]\nPictures of plenty, sippin' my glass full of henny\nHands on my semi—automatic kill for pennies\nApproach for contact 'cause I'm live I multiply\nSoon as I open fire niggas die wit' open eyes\nScare to take a nap, it's a trap a long maze\nDreamin' of gettin' stacks, makin' scratch the wrong way\nWhat the song say, we murder motherfuckers daily\nBlack out blow the track out, my lyrics never fail me\n\n[Verse 2: Eminem]\nIt's like a throne that he don't even own\nHe won't sit down give him a crown he just throws it around\nIt's like a joke he's like a king but he don't do a thing\nHe don't want the diamonds, want the gold or want the jewelry\nHe don't want the room or want the loot he's in it for the sport\nRunning circles 'round his competition on the court\nHe appreciates your support but he ain't begging for it\nAnd you can love and you can hate it\nBut you can't ignore it, you can't be that ig-nor-ant\nBut you can try to sell him short\nBut you can't fuck with his last joint or the one before it\nAnd he was born to raise hell like them country boys\nAnd If I'm fronting man you better come confront me for it\n\n[Verse 3: Notorious B.I.G.]\nThe pin stripes and the gray (uh-huh)\nThe one I wore on Mondays and Wednesdays\nWhile niggas flirt\nI'm sewing tigers on my shirt\nAnd alligators\nYa wanna see the inside, huh, I see ya later\nHere come the drama, oh\nThat's that nigga wit' the fake, blaow!\nWhy you punch me in my face?\nStay in ya place\nPlay ya position, here come my intuition\nGo in this nigga pocket\n\n[Hook: 2Pac]\nDon't go to sleep\nYou can get ya cash on nigga if ya peep\nOther niggas close they eyes\nSeein' dreams in they sleep\nBut don't fall asleep\nDon't go to sleep\nYou can get ya cash on nigga if ya peep\nOther niggas close they eyes\nSeein' dreams in they sleep\nBut don't fall asleep\n\n[Verse 4: Dr. Dre]\nOften, it's a young nigga, in a coffin\nTryin blossom, got shot down walkin, heh\nBleek a high to hot guy, turned cold\nBring the body bag, see the bullet hole and a burned soul\nDon't cry, he chose the life\nFast lane, in the brain, he supposed to fight\nHow you smile at a momma when she lost a child?\n\n[Verse 5: 2Pac]\nI inhale strong weed then release the stress\nDeliver the bomb shit from the East to West\nLike yay-yo\nNigga's pull out when I say so\nCommence to poppin' motherfuckers copy it fatal\nEfficiently I delete then flee\nThe art of war, livin' sucka free, get wit' me\nMotherfucker don't sleep\n\n[Hook: 2Pac]\nYou can get ya cash on nigga if ya peep\nOther niggas close they eyes\nSeein' dreams in they sleep\nBut don't fall asleep\nYou can get ya cash on nigga if ya peep\nOther niggas close they eyes\nSeein' dreams in they sleep\nBut don't fall asleep", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}