{"songs": [{"title": "Guilty Conscience (Radio Version)", "album": "The Singles", "year": "2019-02-22", "lyrics": "[Intro: Mark Avery & Eddie]\nMeet Eddie, 23 years old\nFed up with life and the way things are going\n(Goddamn, I'm going fucking insane)\nHe decides to rob a liquor store\n(I gotta take this shit, I can't take it no more, holmes)\nBut on his way in, he has a sudden change of heart\n(Shit is mine)\nAnd suddenly (I gotta do this)\nHis conscience comes into play (I gotta do this)\n\n[Verse 1: Dr. Dre, Eminem, & (Eddie)]\nAlright, stop (Huh?)\nNow before you walk in the door of this liquor store\nAnd try to get money out the drawer\nYou better think of the consequence (Who are you?)\nI'm your mother****** conscience\nThat's nonsense\nGo in, gaffle the money, and run to one of your aunt's cribs\nAnd borrow a damn dress and one of her blond wigs\n(Can I borrow this?)\nTell her you need a place to stay, you'll be safe for days\nIf you shave your legs with Renee's razor blades\nYeah, but if it all goes through like it's supposed to\nThe whole neighborhood knows you and they'll expose you\nThink about it before you walk in the door first\nLook at the store clerk, she's older than George Burns\nBump that, do that sh**, hit that lick\nCan you afford to blow this hit? Are you that rich?\nWhy you care if you scared of death? Are you that chick?\nDo you really think she gives a **** if you have kids?\nMan, don't do it, it's not worth it to risk it (You're right)\nNot over this slit (Stop)\nDrop the biscuit (I will)\nDon't even listen to Slim, yo, he's bad for you\nYou know what, Dre? I don't like your attitude\n\n[Chorus: Eminem & Mark Avery]\nThese voices, these voices, I hear them (Hear them, hear them)\nAnd when they talk, I'll follow, I'll follow, I'll follow, I'll follow\n(All these voices, these voices) Meet Stan, 21 years old\nAfter meeting a young girl at a rave party (I hear them)\n(And when they talk, I'll follow, I'll follow)\nThings start getting hot and heavy in an upstairs bedroom\n(I'll follow, I'll follow)\nOnce again, his conscience comes into play (All these)\n\n[Verse 2: Eminem & Dr. Dre]\nNow, listen to me, while you're kissin' her cheek\nAnd smearin' her lipstick, slip this in her drink\nNow all you gotta do is nibble on this little chicken's earlobe\nYo, this girl's only fifteen years old\nHow could you take advantage of her? She's passed out\nIt's easy, just cut these lights out, that's how\nThen pick this chicken up, get her off Brad's couch\nAnd leave her on the front porch at her mom and dad's house\nMan, ain't you ever seen that one movie Kids?\nNo, but I seen the porno with Sun Doobiest (Doobiest)\nYou wanna get hauled off to jail?\nBump that, drop her off, ring the doorbell, then bail\n\n[Chorus: Eminem & Mark Avery]\nThese voices, these voices, I hear them (Hear them, hear them)\nI'll follow, I'll follow, I'll follow (I'll follow)\nMeet Grady, a 29-year-old construction worker\n(These voices, these voices, I hear them, hear them)\nAfter coming home from a hard day's work\nHe walks in the door of his trailer park home\n(I'll follow, I'll follow, I'll follow, I'll follow)\nTo find his wife in bed with another man\n\n[Verse 3: Dr. Dre & Eminem]\nAlright, calm down, relax, start breathin'\nStart breathin'? Man, you just caught your wife cheatin'\nWhile you at work, she's with some dude tryna get off\nForget gettin' divorced, cut this chicken's head off\nWait, what if there's a good explanation for this?\nWhat, she tripped, fell, landed on his ****?\nTsh, alright, Shady, maybe he's right, Grady\nBut think about the baby before you get all crazy\nOkay, thought about it? Still wanna grab her?\nKick her our the house, get your daughter and kidnap her?\nThat's what I did, be smart, don't be a retard\nYou gonna take advice from somebody who slapped Dee Barnes?\nWhat you say?\nWhat's wrong? Didn't think I'd remember?\nI'ma kill you, you lil mothaf-\nUh-uh, temper, temper\nMr. Dre, Mr. N.W.A, Mr. AK\nComin' straight outta Compton, y'all better make way\nHow in the hell you gonna tell this man not to be violent?\n'Cause he don't need to go the same route that I went\nBeen there, done that\nAw, **** it, what am I sayin'?\nDo 'em both, Grady, where's your gun at?", "image": "https://images.genius.com/40ebb43e7d534ce34282bdc8027ea273.1000x1000x1.png"}], "artist": "Eminem"}