{"songs": [{"title": "Ronins", "album": "Meth Lab Season 2: The Lithium", "year": "2018-12-14", "lyrics": "[Intro]\nCome on\nCh'yeah\nMeth, where you at?\n\n[Verse 1: Method Man]\nMy flow? Everlastin'\nMy lines? Never lackin'\nEven on Christmas Eve, I out rhyme whoever rappin'\nSlime, shoulda tapped in (Uh)\nBut he blind to the facts and, um\nWhat the album, track one\nTime for some action (Haa)\nPast time for the last time I rhymed in this fashion\nTrue Religion, he never thought he'd die in his fashion\nBut I got time today, if you dyin' then ask him (Uh huh)\nBars, forensic science, that's if you tryna catch 'em\nLord, I think I'm over it, I ain't over here actin'\nI say it over and over, I ain't overreactin' (Woo)\nWhat you picture is death, I'm just closin' the caption\nWho knows if I'ma blow, I just got my nose in a napkin (Choo)\nSuper Saiyan, technically, I'm electrifyin'\nTo be specific, what I specifically specifyin'\nSee that's progression and I'm especially rectifyin'\nAny confessions, I don't expect to be testifyin'\n\n[Verse 2: Cappadonna]\nSo pure now, killa, ain't nothin' gon' move\nMeth Lab's back (We're back!), pardon the goons\nBack in the kitchen with it smellin' of fumes (Smell it!)\nCharged water, hard crack wit' a spoon\nStaten Island, straight up, fuck the platoons (Fuck 'em!)\nHeard the meth heads callin' you\nMeanwhile it's mumble rappers soundin' kinda foreign (Soundin' foreign!)\nFind 'em pressed with Molly, tourin'\nThe man deplorin', nah, we never go live\nWe either gettin' live, edit that (Edit that!)\nProtectin' our guys, get it?\nY'all talk about it while we live it\nY'all live stream and think you litted\nAin't seen a face to face in a minute (Nope)\nCall 'em exquisite, come and crumble your waves\nI got that lithium for days\nHomie, sharpenin' blades, yuh\nIt's Mr. Parker, he get sharper wit' age\nBe at your door with the beard, I ain't talkin' no raids, fuckers\nBlack mufflers got the cowards afraid\nWe make the situation grave\nWe'll better dismantle your trades, nigga\n\n[Verse 3: Masta Killa]\nThis is no glove hittin' the bar, bill open hand, callous slap\nRough, ashy knuckles spark, split your face rap\nThe quick loose your tooth jab, the fifty two clap\nA hunnid rounds backin' 'em down, the house trapped (Uh)\nWe still keep a bat in the back, the the bone crack (Uh)\nStill spittin' actual facts for bank stacks\nCue ball in the sock from the pool rack, snap his neck back\nEvery time I think I'm out, I get pulled back\nIt's like I relapse and catch a flashback\nI took the contract to kill an emcee (Uh) so masterfully\nSo who better than me since '93\nGet you tied to a tree as a target if you wanna be\n\n[Verse 4: Hanz On]\nYo, I'm a old young nigga (Uh huh), I do it for sure (What?)\nWhite Filas, white fitted cherry velour (Uh)\nI keep hunnies on my side like Al B. Sure (Come on)\nI throw my chain in the crowd when you see me on tour (Yeah)\nI'm at The Meth Lab re'in-up, I'm ready to score (Get it)\nHanz On, Methical, Cappadonna, it's hardcore (Huh)\nThis ain't a gang sign, naw, homie, it's war (Yeah)\nFatigue Timberlands on, camouflage door\nSniper team on deck, enemies abort (B-r-r-r-ap)\nStaten Island, New York\nHomicide Hillary (Uh huh)\nThe Black X six, heavy artillery (Soo)\nI'm laughin' at y'all, you rappers is killin' me\nPop your wardrobe (Uh), yeah, I do it for love\nIn my block, homie, yeah (What?), they do it for slugs\nSmacks hands with the homeboy, show that thug (Come on)\nAnd never pop nothin' if you can't look 'em in the mug (Homicide)", "image": "https://images.genius.com/ed8b9d6333cc29967da88416db3514c8.1000x1000x1.jpg"}], "artist": "Method Man"}