{"songs": [{"title": "The Chronic (Intro)", "album": "The Chronic", "year": "1992-12-15", "lyrics": "[Intro: Dr. Dre & Gylan Kain]\nThis is dedicated to the niggas that was down from day one\n(Cell door opens)\nWelcome to Death Row\nLike we always do about this time\n\n[Snoop Dogg]\nHahaha, yeah, nine deuce\nDeath Row Records, creeping while you're sleeping\nNiggas with attitudes? Nah, loc, niggas on a motherfucking mission\nWhat up niggas and niggettes?\nThat crazy-ass-nigga is back in the motherfucking hizzouse\nYeah, with notorious Compton G\nD-R-E on a solo tip, fuck them other fools\nWhat up, Ren?\nYeah, dropping Chronic flakes on your ass, biatch\nWest Coast flavor\nNiggas who talk shit get dealt with real quick\nSo if you wanna take a trip to the Row\nLet a nigga like Snoop Doggy Dogg know\nProtected by niggas with big dicks, AK's, and 187 skills\nSo if it's must you test us, we can handle it the streets nigga—fuck making records\nYeah, G's up, hoes down\nIf that bitch can't swim, she bound to drizzown\nPeace to my nigga Drizzae, another platinum hit, nigga\nPeace to The D.O.C., still making it funky enough\nAnd Death Row Records is in full motherfucking effizzect\nOh, yeah, PS: Fuck Mr. Roarke and Tattoo, a.k.a Jerry and Eazy\nSincerely yours, these motherfucking nuts\nI don't love Eazy, I don't love Jerry\nI don't love Ruthless Records!\nFrankly, I don't love nothing they got to do with!\nBut-but-but you know what I want you do for me?\nJerry and Eazy, check this shit right here\nI want y'all to put these bizzalls in your jizzaws\nAnd work them like a strizzaw, tell me what you sizzaw\nYeah, you know what? You know what?\nFuck all y'all! Fuck y'all!\nReally though, it's Death Row, nigga!\nYou better ask somebody, you really better ask somebody!\n\n[Outro: Solomon Burke + Dr. Dre]\nGet out! Get out! I don't love you no more!\nYeah, nigga, you's a penguin-looking motherfucker!", "image": "https://images.genius.com/d97178fbf3fddb4fd72fb8e4988341bb.604x604x1.jpg"}], "artist": "Dr. Dre"}