{"songs": [{"title": "U Gon Love Me", "album": "The Dedication", "year": "2005-12-13", "lyrics": "I'm so sick I go to the hospital\nWhen I don't get fixed I get nicked by the brain surgeon\nIf I'm losing ya, sorry I'm just brain surfing\nMove in ya mind like a five in the lanes twerk it\nBut I'm like a six with ya bitch twerk that\nI'm on the strip with ya bitch working\nAnd I don't like strippers, I like dyke bitches\nThat don't like strippers; that, like bitches\nLike to fight strippers, Weezy F. Baby\nI don't write shit, be on the hype shit\nShe on that white shit\nI ain't talking about cum, put powder on my dick\nThen she suck it til she numb, shit\nI remember back in the day\nWhen an ounce of coke was four hundred\nAnd them bitches was gay\nBut now these niggas is gay\nAnd you could probably get an ounce for eight\nShit, if you spend eleven hundred you straight\nAnd now the niggas with money is the niggas that hate\nAnd bitches want a broke nigga cause them bitch niggas fake\nBut that's why me, and my hooligans debating, ho\nWhich one of these rich niggas we taking?\nI gotta make it, Lil Layla's six now\nMy little brother J.E. wanna cop bricks now\nAnd little Marley, he just hold his chick down\nGet 'em a Benz so he can roll his chick round\nI blow big in a 'Lac like a big dawg\nI keep that sig in my lap like my dick dawg\nShit make me bust a nut in yo face\nTell ya girlfriend, \"Bitch\nWipe the slut off yo face, ho\"\nWhere you from? I'll put you under your state\nThen I go and throw a party at Bungalow 8\nYeah I'm something so straight feared I\nKnock a nigga right up in his queer eye\nI ain't playing nigga this is the year I must excel\nFans sending in cards say you must get well soon\nBecause I'm sick, so sick sick mean\nI be with a cute thing\nAnd she do her lip thing\nWell as a matter fact I think you know her well\nEverytime I'm with the girl you always blowing up her cell\nWhat, would you stop me and shorty tryna chill, man\nShorty tryna feel on my eel\nI shock her like Silk\nI Chaka like I'm managing a Ludacris\nHandling the uzi like a camera\nChoose ya flick, ya strike a pose\nWe pull up-in Bentley\nNiggas on the bikes is hoes\nI'm that cold, nigga\nI'm that cold. Nigga\nThough I'm a hot boy\nI'm that cold nigga", "image": "https://images.genius.com/d5aa064a83b316efd87b4aed4c2a27be.941x938x1.jpg"}], "artist": "Lil Wayne"}