{"songs": [{"title": "Mona Lisa", "album": "The Great Adventures of Slick Rick", "year": "1989-01-01", "lyrics": "[Intro: Ricky Walters & Slick Rick]\nLadies, and gentlemen... and lowlifes\nIt is with outstanding pleasure\nThat we are here to present tonight...\nSlick Rick, the Ruler! And MC Ricky D!!\nDoing their smash hit, \"Mona Lisa,\"\nYou know, like the picture?\nAnyway, I'd like to take this time out\nTo bow before his divine majesty\nOh your majesty...\nHmm\nCan I kiss your hand?\nMm-hmm\n*Kisses his hand loudly*\nEnough!\nCome your highness.. they await you..\n\n[Verse: Slick Rick]\nWell, it was one of those days -- not much to do\nI was chillin downtown, with my old school crew\nI went into a store -- to buy a slice of pizza\nAnd bumped into a girl, her name was Mona -- what?\nMona Lisa (what?) *singing* Mona Lisa, so men made you..\nYouknowhat I'm sayin? So I said, \"Excuse me, dear\nMy gosh, you look nice!\nPut away your money\nI'll buy that slice!\"\nShe said, \"Thanks - I'd rather a slice of you\nI'm just kidding, but that's awfully nice of you\"\nThe compliment showed she had a mind in her\nAnd when I smiled (PING!) I almost blinded her\nShe said, \"Great Scott! Are you a thief?\nSeems like you have a mouth full of gold teeth\"\nHa-ha, hah! Had to find that funny\nSo I said, \"No child, I work hard for the money\nAnd calling me a thief? Please! Don't even try it (Right!)\nSit down eat your slice of pizza, and be quiet\"\nShe almost got cut short -- you know, scissors\nShe tried to disrespect WHO?! The Grand Wizard\nMe! \"Well what's your name, son?\"\n\"MC Ricky D,\" but not to be so harsh I said to Mona Li-hee\n\"I'm.. sorry and I know that's low class (uhh, yeah)\nPlease sit, and tell me a little about your past\"\nShe said, \"Well I got courage, and I don't like porridge (uh-huh)\nI've never been to college, but I've got crazy knowledge (uh-huh)\nOver eighteen and my eyes are green (uh-huh)\nI wear more gold than that man on A-Team (uh-huh, uh-huh)\nTrim, slim, (yeah) and I'm also light skinned\nBest believe Mona's a virgin\"\nA virgin?! Honey needed a slap\nShe tried to tell me she's a virgin -- with her yay wide gap\nI said, \"It don't matter, see, I'm not picky (word)\nLet me spell my name out for you, it's Ricky:\nR - ravishing, I - impress\nC -- courageous or careless\nK -- for the Kangols which I've got\nThat I wear everyday and why? -- Why not?\nTo fight's not right that I recite and I'm..\nQuite polite like Walter Cronkite\"\nWell, just about then, Trevor my friend came in\nHe said, \"Hey Rick, don't you know playing with these snakes is a sin?!?\"\nHe grabbed me by my shirt and pulled me right out the store\nHe said, \"I don't want to see you playing with these lowlifes no more!\nNow come along, we have a party to attend\nWith some real mature women and some more of our friends\"\nHe hailed down a cab and he waited for a minute\nAnd as the cab came, he thrusted me in it!\nAnd as we were leaving and driving along\nI could hear a melody as Mona sang a song\n\nIf you see me walking down the street\nAnd I start to cry each time we meet\nWalk on by, walk on by, foolish pride\nThat's all that I have left, so, let me hide\nThe pain and the hurt that you gave me\nWhen you said goodbye\nYou walked on by", "image": "https://images.genius.com/692d956994503381d61158783482a0f6.593x600x1.jpg"}], "artist": "Slick Rick"}