{"songs": [{"title": "The M.I.C.", "album": "Operation: Doomsday.", "year": "1999-04-20", "lyrics": "[Hook: Pebbles the Invisible Girl]\nFeel the magnetism between us (The mic)\nGrowing stronger and stronger (The mic)\nWhy don't we do it? (The mic)\n\n[MF Doom]\nI was in a case out of state\nShe was thirteen and good, we had a hotter date\nIt was just a number, she never told she was knocked up\nBy the end of the summer chick almost had me locked up\nMy aunt came and got me, and steadied the block\nWe bounced to the yeti, and I'm ready to rock\nWith no attachments, feelin a little loose\nBlowin up in every spot, we had a little juice\nProbably the Dom or the Afghani bud in me\nWe played the stage standin by the speaker and suddenly...\nWho tapped me? I'm bout to get real ill\nAlready ripped the whole club with Metal Face's steel wheel\nWhat a sweet surprise her with the fly eyes\nAnd fine, she pulled me to the sidelines\nThe mystery shot up with strong words\nShe was an intelligent wisdom and a songbird\nI met her last week at the same place\nShe stepped to me, the same way at a no shame pace\nI'm off guard, her game had me choked up\nCheckin me, play testin me, till I spoked up\nSeven whole days and nights and not a word from you (not a word)\nI was worried, I thought I woulda heard from\nStranger, you know I never get enough of you\nHow you be comin through...\nMyself and two a alikes had ran through this crew of three\nIn my earlier days they showed me things new to me\nSo we knew mad brothers who they had hit off\nThey even used to watch each other just to rock they shit off\nWhen slovenly two smile and I'm scopin her\nSwitchin off three times a night made them more opener\nSo you could love Allah, or leave him the hell alone\nMessage from my godfather, solid gold telephone\nMany of my men went up in smoke\nWhile trickin with these chickens, and ended up broke\nYou find out who's ya mans when you broke\nLike a bad joke, it's funny, when you on you got mad folk\nI played the middle man in every little scam\nSome as complex as a hip hop album riddle jam\nI find it's quite intriguing as I think about rappers\nWalk upon me speaking with they stinkin mouth (About what?)\nAbout this and that from sneakers to hats to gats\nFreak chicks with the cooty cat raps\nAnd it's that cool the dice at that\nI'm at a black tie affair with a diva with the fatty fat\nI play the back, steady on the humble\nBut be right up front when we get ready to rumble\nI gave her breath control, ask her who she learned off\nCoulda took her back to the crib, somehow was turned off\nMe and you... was overdue\nFrom gettin together baby\nI always knew our love was meant to be\n\nFeel the magnetism between us (The Mic)\nGrowing stronger and stronger (The Mic)\nWhy don't we do it", "image": "https://images.genius.com/c0a80e3098696bdf600f54a76667c069.1000x1000x1.jpg"}], "artist": "MF DOOM"}