{"songs": [{"title": "The Punisher", "album": "Don’t Sweat the Technique", "year": "1992-06-23", "lyrics": "Kill em' again!\n\n[Verse 1]\nTry to identify the man in front of ya\nBut it ain't the role, the gear, or the money, the\nSwift intellectionist with plenty of bite\nIf it's dark I'll spark every one of ya\nI throw a mic in the crowd, if it's questioned\nI got the answer, it includes directions\nGo manufacture a match, show me after\nA blast of a master that has to make musical massacre\nAttack your rap 'till it's handicapped\nYou'll never hold the mic again, try to hand it back\nFor every rapper that comes, I cut off his thumbs\nPut a record to his neck, if he swallows, it hums\nSlice from ear to ear, so he can hear better\nBefore he bleed to death, hear, hear every letter\nAnd you can see how quick and thick the blood can get\nIf you try to change the style or the subject\nAs I get deep in the rhyme, I'm becomin' a\nMC murderer, before I'm done, I'mma\nPrepare the chamber, the torture's comin' up\nTrip through the mind, at the end you'll find it's The Punisher!\n\nKill 'em again!\n\n[Verse 2]\nI hold the mic as hostage, MC's as ransom\nRhymes'll punish 'em 'cause they don't understand 'em\nI heat up his brain, then explain that I hand him\nA red-hot microphone... that's how I brand 'em\nRhymes fall in formation, unite and ignite\nLike a platoon puttin' bullet wounds in the mic\nIf ya curse me, it ain't no mercy\nGive 'em an autopsy, killed by versin' me\nI took a kid and cut off his eyelids\nKillin' him slow so he could see what I did\nAnd if he don't understand what I said\nI'm pushin' his eyeballs wayyyy to the back of his head\nSo he can see what he's gettin' into\nA part of the mind that he never been through\nA journey is comin' 'cause ya gettin' sent to\nA place harder to find, but it's all in the mental\nI run a brain scan to locate his game plan\nWhen I'm through with his brain, he ain't the same man\nDid he lose his mind or lost in his mind?\nBut this ain't the lost and found because ya can't find\nYour foundation, coastin'\nYour mind is driftin' in slow motion... frozen\nLooks like another murder at the Mardi Gras, B\nToo late to send out a search party\nOnce ya out of ya head, then ya can't get back\nI give him a map, but he still get trapped, so\nPrepare the chamber, the torture's comin' up\nTrip through the mind, at the end you'll find it's The Punisher!\n\nKill 'em again!\n\n[Verse 3]\nDangerous rhymes performed like surgery\nCuts so deep, you'll be bleedin' burgundy\nMy intellect wrecks and disconnects your cerebral cortex\nYour cerebellum is next!\nYour conscience becomes sub-conscious\nSoon, your response is nonsense\nThe last words are blurred, mumbled then slurred\nThen your verbs are no longer heard\nYou get your lung fried so good you're tongue-tied\nHe couldn't swing or hang, so he hung 'till he died\nReincarnate him and kill him again\nAgain and again, again and again\nI leave him in the mausoleum so you can see him\nI got a dead-emceein' museum\nWhen I create 'em, I cremate 'em and complicate 'em\nYou can't save 'em, there's no ultimatum\nMics lay around full of ashes, with the victim's name in slashes\nGot a long list and I'mma get every one of ya\nBeware of The Punisher!\n\nThen I'mma kill 'em again!\n\nWake 'em up... kill 'em again!", "image": "https://images.genius.com/3ad7c18191ad34b84253fef136554c6d.500x500x1.jpg"}], "artist": "Eric B. & Rakim"}