{"songs": [{"title": "War", "album": "Build and Destroy", "year": null, "lyrics": "[Hook]\nThis, means, WAR!\nWanna bring it to, bring it to me? (uhh)\nWanna bring it to me, we in the D (uhh)\nYou, we got you\nSpot him before he spots you\nWAR! Wanna bring it to, bring it to me (uhh)\nWanna bring it to me, we in the D (uhh)\nYou, we got you\nSpot him before he spots youuuu!\n\n[Royce Da 5'9\"]\nYo, yo, I roll with the wildest crew in the game\nNiggas that'll put two in your frame\nWith any one of the guns we carry to cock\nAim, only to use on one of you bums, too scary to box\nGimme mines and mines only, you know\nNigga you only a hole which shows in the tone of your flow\nThe iller the team the iller the regime\nPeelin from the scene in trucks, we gettin cream or what?\nRobbery's the word over extortion\nForce niggas to fork over a fortune\nTakin you cats into a world you probably ain't never even been before\nBefore we can even talk\nThere's money to be made, niggas wanna get paid\nI ain't playin wit y'all niggas, I'm serious\nTry to top the flow or stop the dough\nYou could get shot fo' sho', your whole block could go\nI'm takin the pistol to make it official\nHollow heads make him an issue, makin 'em hit you\nFeel the force of a real nigga in this\nMy niggas'll tear the club up\n\n[Hook]\n\n[Royce Da 5'9\"]\nYo, yo, yo - we attack the last nigga that blast\nTake him for cash; if he broke, we kickin his ass\nSimple as that, either the fifth or the mac\nCripple the cat, you too if you think you could rap\nWho fuckin with me? Gimme one name\nOne nigga with versatility like this\nAbility like this, it's like this\nWith me, my flow, you never know what you might get\nPrime suspect, and I ain't hit you with half of the rhyme just yet\nNiggas wonderin why I be callin myself the King\nShh, I'm the King\nWho you ever seen that's doin it like me?\nWhat new nigga done came that'll spit shit\nThat'll sit in your brain, yeah I'm doin my thing\nA lotta you niggas'll probably be intimidated by it\nWhen my shit gets played, niggas riot\nShit gets sprayed; but you can't change that\nI was doin that in sixth grade\nYou can take it to the streets with us\nAll out war, fuck it, everybody heat could bust\n\n[Hook]\n\n[Royce Da 5'9\"]\nYo, yo, my attitude done changed since I became a king\nI'm a stranger being, rearrangin things\nNow that I can afford a Range and rings\nI sit and think, I remember when it became a dream\nNow I'm livin in it, takin the game\nTo where it's never even been visited, what's my name?\nRoyce 5'9\" (who?) hottest nigga in rap\nHow I'm figurin that? I'm iller than y'all\nPlus all my niggas be more realer than y'all\nMore crooks and way more killers than y'all\nHot with it with goals, tryin to die with over two hundred songs\nReady to go like 'Pac did it\nNiggas is out for the cheese\nThere can only be one King, it's either me or about to be me\nWe bringin heat with us\nReady to shoot, y'all niggas better recruit, you ain't deep enough\n\n[Hook] - 2X w/ minor variations", "image": "https://images.genius.com/d86b45b993cdf0c53559e740521a4bba.500x494x1.jpg"}], "artist": "Royce da 5'9'’"}