{"songs": [{"title": "Penis Song", "album": "The Language of My World", "year": "2005-10-10", "lyrics": "[Intro]\nLadies and gentlemen, introducing\nThe \"Penis Song\"\n(Oh no, he didn't) (Honkey dick)\n\n[Chorus 1]\nThis is my penis song\nI wish that I had a bigger shlong\nOne that was quite a bit more thick and way more long\nOne of those porno king kong dongs\n\n[Verse 1]\nHaha, check it out, yo, uh\nI wish my dick was bigger, yep, I can admit it\nI'm above average on inches but I wanted damn double digits\nIf I had a big ol' cock what would I do?\nI'd probably go to Florida and show it to Trina and screw\nGet butt naked and start streaking at my school\nAnd get arrested but at least the girls would be impressed\nWith my third leg and, and then I'd go to a keg and\nDo a keg stand, get drunk and do the running man\nWith no clothes on just to show off\n\"My dick's bigger than yours when mine is cold and soft\"\nHaha, oh yeah\nI forgot that's not really the cock that I have\nI went out and party-bagged 'em and quickly opened the package\nAnd it fit me like Kriss Kross's old school starter jackets\nTryna convince myself like, \"Size doesn't matter\nAnyways I'd probably just put it on backwards,\" I mean\nI know that God made us all different and special\nBut shit did he really have to invent lopsided testicles?\n\n[Interlude 1]\nI don't have them, I just... I feel bad for, like, you know the guys with like, you know, their left one hangs like lower than the right one, kinda like a—kinda like a lazy eye, like on your, on your balls. I don—I don't know, I just just heard that... I feel bad\n\n[Chorus 2]\nThis is my penis song\nI wish that I had a bigger shlong\nOne that was quite a bit more thick and way more long\nFellas, if y'all feel me sing along (Don't front, don't front)\n\n[Interlude 2]\n[?] Ayo ladies? Yeah? Ladies? Yeah? Do you want a guy with an average dick? Hell no. Then—wait, you don't? No, honkey dick. Okay, that's cool (Whatever) No, that's fine\n\n[Verse 2]\nI promise, I'm so self conscious\nThat's why you never see me skinny dippin' in August\nAlways walkin' around with my hands in my pockets\nTryna pump blood into my guy Alfonso\nI mean, goddamn I don't think you girls understand\nI've had a complex since that song Short Short Man\nAnd even though girls have told me that I'm big\nWhen I watch a porno I feel like a little kid\nI mean, let's take Ron Jeremy\nNow if a girl sees him she'll compare him to me\nAnd every MC in hip-hop has got a huge cock\nOr at least talks about it in every song that they drop\nI mean, shit\nIf I was really hung I'd make a whole album called Me and My Dick\nWith interludes of all the girls that I'd been with\nAnd talk about my package and multiple orgasms\n'Cause all that I see is that size does matter\nWe got Enzite, penis pumps, surgery to Viagra\nBut when it all adds up you can't really change it\nI'm not a porno star, I just gotta face it\n\n[Interlude 3]\nYou know, I mean, what can I do? Nothing, right? This song goes out to, like, all the, like, little bit above average dudes, to, like, the small dudes, medium dudes but all you big guys, man, stop [?]\n\n[Chorus 2]\nThis is my penis song\nI wish that I had a bigger shlong\nOne that was quite a bit more thick and way more long\nFellas, if y'all feel me sing along (Don't front, don't front)", "image": "https://images.genius.com/a341d7269423ec87ff688b91d8b38e47.800x800x1.jpg"}], "artist": "Macklemore"}