{"songs": [{"title": "Knock Knock Remix", "album": "Kon the Louis Vuitton Don", "year": null, "lyrics": "[Intro: Kanye West (Monica)]\nYo Monica, I know you shootin' that video in there\nAw, you just ain't gon' let me in the video, huh?\nNo no, i-it's me, Kanye West (It's funny how the tables turn)\nYou know, th-throw your diamonds up? Through the wire? (turn)\nYou ain't seen my video, heh? (turn, turn)\nYou know, I- like me and Missy we did this song\nTogether whatever\nUm, okay, well\n\n[Interlude: Kanye West]\nI can't keep knockin' and keep rockin' and keep poppin'\nI keep droppin' and keep poppin' and keep rockin'\nBut I can't keep knockin' and keep knockin'\nAnd keep poppin' and keep rockin'\nLet's get it poppin'\n\n[Missy Elliot {*overlaps Kanye West Interlude*]\nSo upset\nThis that hot shit\nUh huh, yeah\nNew Monica!\n\n[Verse 1: Kanye West]\nNow you ain't let me in the video (true)\nPlay me like Semi did Arsenio (true)\nI'm Kanye from the Chi city yo (who?)\nI'm the nigga that did the beat yo\nYou know we too old for this like Holyfield still boxin'\nYa will watch and I look back, ya still watchin'\nWhat he got that I ain't got? I got Benz\nI got rims, not 20s but I got 10s\nReal real clean, come and get your rear wheel cleaned\nShe did what with who? Man I hear things\nLike when I was doin' my dirt and she heard things\nUp worryin' while she wore her ring\nNow she got a fling and where's her ring?\nThat [?VVS?] is in the purse now, feelin's in the dirt now\nSomebody buyin' the bar, quenchin' her thirst now\nSomebody bought her a dress, she in the church now\nAnd what's worse now, she ain' gotta work now\nShe cuffed an NBA player from the first round\nI grabbed her neck and made it hurt to breathe\nShe said \"Security, this jerk could leave\"\nAnd uh\n\n[Verse 2: Monica]\nSo do just what you want anytime that you really like\nI put a payment on my place, you'll be sleepin' alone tonight\nSo don't you come knockin'\n\n[Hook (Monica)]\nKnock knock knock, stop knocking\nDon't come knocking at my do'\n(Don't you come knockin' at, whoa)\nRing ring ring, let the phone stop\nI don't want you calling me no mo'\n\n[Kanye West {*overlaps chorus*}\nYo this the remix, and I'm Kon the Louis Vuitton Don\nOr you can call me Louis XIV\nBy the way cause I dropped out of the fourteenth grade\n\n[Verse 3: Monica (Kanye West)]\nI used to be so gone\nYou were someone I could lean on\nMy life support system (uh huh)\nAnd I thought I couldn't breathe, ah ah\nWhen you used to leave, yep (ye) yep (ye)\nI see you put yo clean on\nBig chains, gold teeth, and yo gleam on (Roc-a-Fella chain)\nAll night wanna be gone\nWanna tell me stay home like I got a [fuckin'] ring on\nNow you say I'm not your wife, right right (you like wifey)\nSo why should I be chillin'? goodnight goodnight (oh)\nNow pack up my things for a flight (ok)\nI got a place and it's fixed up nice\nSo don't come knocking at my do' (aw man)\nI got company comin 'round fo'\nSo whoa whoa, haha, yeah\n\n[Hook (Kanye West)]\nI don't want you callin' me no mo'\nKnock, knock, knock, stop knocking (yeah)\nDon't come knocking at my door\n\n[Interlude: Kanye West]\nAnd I can't keep knockin' and keep rockin'\nLet's get it poppin' and that's stoppin'\n\n[Hook]\nRing ring ring, let the phone stop\nI don't want you calling me no mo'\n\n[Outro: Kanye West]\nWhat up Really Doe, I see you\nHey the [?Loc?] gon' be mad as hell when we go on tour\nYou see I already got GLC up outta there\nAw we finna blow man\nYou know we got the game on smash\nJohn Monopoly, Don C\nPlain Pat what up?\nYeah, you know I got that boogie\nAnd Jay boogie well\nYeah, what up Roc?\nYeah, [?Arrow Stah?]\nWhat up Tiffany, I see you\n\n[Outro: Monica {*overlaps Kanye West*]\nChanged my locks, took my things\nCan't come in\nChanged my locks, took my things\nCan't come in\nI don't want you calling me no mo'", "image": "https://images.genius.com/b7758602aa6883d6e056a8f30703a549.591x591x1.jpg"}], "artist": "Kanye West"}