{"songs": [{"title": "Never Stray", "album": "Planet", "year": "2017-03-02", "lyrics": "[Intro: Tech N9ne & Navé Monjo]\nOh yeah, yeah\nNavé Monjo (ooh)\nI got on this path like (yeah, yeah, yeah)\nI'm gonna one day soon be the best at rap like (yeah, yeah, yeah)\nBut did I lose lots when some people in my life didn't act right? (yeah, yeah, yeah)\nBut now when I rock, every show I see the venue be packed like (yeah, yeah, yeah)\nNueve\n\n[Pre-Chorus: Navé Monjo]\nI've been down that road and I've been thinkin' lately\nThrough it all I made it through the pain, yeah (ayy)\nI been rockin' for a minute, think I'm crazy\nBut they'll never catch me outta line\n\n[Verse 1: Tech N9ne]\nYeah, strange at birth\nBorn to make a difference when I came to Earth\nBut Mama never warned me 'bout the pain, the hurt\nIn the heart and the brain when the game flames ya church\nWhy do they make road blocks, when the flow's hot?\nThey said, my music will never fit in the pro slot\nProbably why I sell out the cities when I globe trot\nNow my wall of records are in platinum and gold box\n(Platinum and gold box, platinum and gold box\nPlatinum and gold box, platinum and gold box)\nThe game can't kill a nigga ego\nWhen they want it from a hundred to zero\nI know the man's plot bury take a below\nBut you can't block Curry at the free throw\nLook how Strange came in the game like Deebo\nIn the beginning, we did a show in a gazebo\nNow we got hits and takin' pics with the people\nBut they won't play me if I don't mix with the Migos\nIf you tell me that my music didn't fit they program (yeah, yeah, yeah)\nSaid, that the music I make wasn't fit for the broham (yeah, yeah, yeah)\nBut now do they wanna hear Ninna bussin' over this slow jam? (yeah, yeah, yeah)\nAnd now is the motto of Strange, we takin' no shit from no man (yeah, yeah, yeah)\nNueve\n\n[Pre-Chorus: Navé Monjo]\nI've been down that road and I've been thinkin' lately\nThrough it all I made it through the pain, yeah (ayy)\nI been rockin' for a minute, think I'm crazy, but they'll never catch me outta line\n\n[Chorus: Navé Monjo]\n'Cause I'm on a straightaway, I'll never stray away (no)\n'Cause I'm on a straightaway, I'll never stray away (no)\n\n[Verse 2: Tech N9ne]\nYeah, I've been down that road\nAt the crib, checkin' out every sound that sold\n'Til I found that soul of a clown that flows\nThen it got her to slither and spin around that pole\nSo many haters were tryna drown Tech's rolls\nAnd stoppin' him from blossomin' nigga, now that grows\nNo blockin' him, lockin' them wit' a frown that froze\nWhen he bossin' then he lost 'em when the underground let go\nThey wanted to hold down Tech's blow\nBut people ain't keepin', they chiefin' a pound that's Dro\nEven seepin' around Death Row\nIncreasin' my releasin' to many towns, that's dough\nBut some people wanna delay the bag\nEven though you kill everything when you display the gas\nSpray the mag, Ninna blast like a laser tag\nTo who paid the cash, thinkin' I'ma stray the path\nAy, did they doubt me often? (yeah, yeah, yeah)\nBut now when they talk about Tech, will they all take caution? (yeah, yeah, yeah)\nFor the price of fame and what you gain, is it worth what it's costin'? (yeah, yeah, yeah)\nAm I gonna be the real deal still 'til I'm laid in the coffin? (yeah, yeah, yeah)\nNueve\n\n[Pre-Chorus: Navé Monjo]\nI've been down that road and I've been thinkin' lately\nThrough it all I made it through the pain, yeah (ayy)\nI been rockin' for a minute, think I'm crazy\nBut they'll never catch me outta line\n\n[Chorus: Navé Monjo]\n'Cause I'm on a straightaway, I'll never stray away (no)\n'Cause I'm on a straightaway, I'll never stray away (no)\n\n[Outro: Nave Monjo]\nI'm on that straightaway (yeah), I'll never stray away\nI'm on that straightaway (yeah), I'll never stray away\nI'm on that straightaway (yeah), I'll never stray away\nI'm on that straightaway (yeah), I'll never stray away", "image": "https://images.genius.com/9512e7de485fe45a8b0365fd80465887.1000x1000x1.png"}], "artist": "Tech N9ne"}