{"songs": [{"title": "Cisco Kid", "album": "How High - The Soundtrack ", "year": "2007-01-01", "lyrics": "[Intro]\nWe gonna get you high\nWe gonna get you high\nWe gonna get you high\nWe gonna get you high\nWe gonna get you high\nWe gonna get you high\nLet's get high\nLet's get high\n\n[B-Real]\nI flow rhymes off just like weed in your chest\nThink you got endo, hold your breath\nSpittin on the track with Red and Meth\nHoldin up a fat, when you smoke a cassette\nOr CDs, we bees the ones with the Ouija's\nSpread it on the arm, come on believe me\nLook who it is, it's the funky feel\nSmokin assassin from Cypress Hill\nWe think she's just resonated?\nFillin my brain till it's saturated\nWhen you get the crushed weed and cultivate it\nGive it to the hoes who love to hate it\nCause blunts get filled like Hershey Highways\nI don't give a fuck who sits where I blaze\nChillin at the rainbow high and faded\nYou saving that bump(??), then isolate it\n\n[Method Man]\nIs there a Doctor in the house?\nWe like fuck that, nut sacks in your mouth\nLemme show you what a thug about\nWe can talk or we can slug it out\nBetter yet, you can bark like a bitch when I thug it out\nThere it is, a better a kid, ahead of his\nTime to settle this, like men\nI'm pipin hot, exciting\nRight in the gym or hype in them, alright then\nAll day I drink and smoke\nShell toe with ankles in ya both\nCent, five cents, ten cents, dollar\nRockwilder blend the track and getting hotter\nAsk your boy, now pass your boy something to smoke\nCause you have had nothing to throat, swallow\nBang the track, bring your bat\nAin't too many that can hang with that\nSo why bother\n\n[Chorus]\nCisco Kid was a friend of mine\nHell yea\nCisco Kid was a friend of mine\nHell yea\nHe drank whiskey, Pancho drank the wine\nHell yea\nHe drank whiskey, Pancho drank the wine\nHell yea\n\n[Senn Dog]\nYea, Senn Dog, and fall back\nAnd who wrote on this track\nI don't really give a fuck\nPut the pen down lets toss them up\nSoul assasins, Latin thugs\nWhole damn world know about us\nRhymes we kick and weed we puff\nGet tus vatos all fucked up\nAnd sing along to my get high song\nHad you choking off of four foot bong\nCypress Hill and weed, can't go wrong\nKeep you smoking like Cheech and Chong\n\n[Redman]\nYo, call me that Doctor\nP-Funk or chronic blower\nPussy smoker, strap toker, back broker\nHash burns in your pull out sofa\nThis is my brain on drugs\nMove out my way cuz, cause I might run you over\nBitches bounce your titties\nI bounce with a pump shotgun\nLook out, the highest man in the world\nWalkin off with my hand on your girl\nCan't drink and can't stand in the world\nNiggas, two puffs and then pass me the L\nWhat you talking about I'm not high enough to start that party\nTriple beater enter the stage with a gauge\nDon't shoot nobody\nWhat you ain't high enough?\nDo I gotta jump out there and tie you up?\nStrap a bomb to your mouth\nTill you wired up\nTill the Park Ranger call the Firetruck\nAnd said \"Hey motherfucker, what you be smoking on?\"\nI said \"Hey motherfucker, why do you want some?\"\nYo, yo, give me the gun, we don't need to fight\nHold that blunt, I'll give you a light\nDon't no nigga want to die tonight\nWith all this weed, get high tonight, bitch\n\n[Chorus]\nCisco Kid was a friend of mine\nHell yea\nCisco Kid was a friend of mine\nHell yea\nHe drank whiskey, Pancho drank the wine\nHell yea\nHe drank whiskey, Pancho drank the wine\nHell yea", "image": "https://images.genius.com/3b318124b84e2e872c43ad421760eabc.500x500x1.jpg"}], "artist": "Cypress Hill"}