{"songs": [{"title": "So Lonely", "album": "The Day After", "year": "2005-04-12", "lyrics": "[Intro: Twista]\nIts ya boy twista[?]\nThat girl Mariah[?]\nThis that fiyah[?]\n\n[Verse 1: Twista]\nYou know I like the way you kick it girl\nYou know I like it when ya in my world\nCome here little momma let me freak your body\nThen roll wit me in the Bentley White pearl\nGirl you know you get me so erotic\nEspecially when I be sipping hypnotize\nGot me feeling like I'm smoking on chronic\nWhen we fucking it be so exotic\nNow I know that I be turning on fiyay Wit Mariah\nAnd she know she be dealing wit a balla\nCan't go fast cause I'm heavy through the wire\nFulfilling desires like a chi shot calla\nDo you love how the twist throw it at you\nDo you love when I hit it from the back too\nLet me feel how you work it that one way\nCome on baby girl let me see what that do\n\n[Chorus: Mariah Carey]\nI wish that we could\nBlow out the speakers\nOver N Over\nTo them Jodeci cuts\n\"Forever your lady\"\nYou act right then maybe\nI have nothing to talk about\nPut the music loud\nSo they won't hear me say\nAh-ha ha ah!\nCome and be my one and only\nTired of being so lonely. come hold me\nAh-ha ha ah!\nI want to wrap myself around you or whenever you want to\nCome make me say\nAh-ha ha ah!\nCome be my one & only\nTired of being so lonely console me\nAh-ha ha ah!\nI want to wrap myself around you or whenever you want to\nCome make me say\n\n[Verse 2: Twista]\nNow we pulling up out the garage\nIn the platinum blue Arnage\nMe and you about to hit that club\nTo the bar so we can sip that bud\nBoth of us together we would be the livest\nIf I had to break it down how would I describe it\n(Ah- ah oh!)\nWe the type of couple when we get up on each other\nWe get it cracking in the kitchen or the bedroom\nIt don't matter where we at we be making noise\nSo play the track so the base will make you head boom\nBreak ya off when here one leg up\nAnd you know I like the way you put it on me\nIt's the east coast queen and the mid west mob boss\nShorty I'mma never leave you lonely\n\n[Chorus: Mariah Carey]\nI wish that we could\nBlow out the speakers\nOver N Over\nTo them Jodeci cuts\n\"Forever your lady\"\nYou act right then maybe\nI have nothing to talk about\nPut the music loud\nSo they won't hear me say\nAh-ha ha ah!\nCome and be my one and only\nTired of being so lonely. come hold me\nAh-ha ha ah!\nI want to wrap myself around you or whenever you want to\nCome make me say\nAh-ha ha ah!\nCome be my one & only\nTired of being so lonely console me\nAh-ha ha ah!\nI want to wrap myself around you or whenever you want to\nCome make me say\n\n[Verse 3: Twista]\nLet me give it to you all night long\nLet me give it to you to this song\nLet me give it to you in the hallway\nLet me give it to you on the balcony, baby!\nGive it to you on the East Coast\nGive it to you on the West Coast\nGive it to you Down South\nLet me give it to you in the Midwest, baby!\nLet me give it to you in the UK\nLet me give it to you through the DJ\nLet me give it to you in the back of the 'Bach\n[?], that's how I freeplay!\nGive it to you however you desire\nAnd I gotta show you that I ain't a liar\nI'mma console you whenever you lonely\nCome and listen to the Twista and Mariah!\n\n[Bridge: Mariah Carey]\nSo just show a girl what it do (What it do)\nAfter this boy I promise to do\nYou got my body lit up like the moon\nYou're too persuasive, I can't take it\nI'm so caught up in you\n\n[Outro: Mariah Carey]\nAh-ha ha ah!\nCould you be my one and only\nI'm tired of being so lonely. come hold me\nAh-ha ha ah!\nI want to wrap myself around you\nFreak whenever you want to\nCome make me say (oh ooooh)", "image": "https://images.genius.com/6e50ebd81ceeb1860beb446ab2cdec8e.1000x1000x1.jpg"}], "artist": "Twista"}