{"songs": [{"title": "On the Road", "album": "M.I.C. (Make it Count)", "year": "2004-10-26", "lyrics": "[Intro]\n(Alright, what would you say is the best part about your career?)\nThe best part about my career is probably being able to\nDo what I love doin all the time, which is, make music\nThe negative side of it\nIs probably just being away from my family so much\nCause I find it, like an MC like myself\nOne of the many ways I can make money, is to pack up\nAnd just, take my show on the road, you know what I'm saying?\n\n[Royce Da 5'9\"]\nTired of the same old hustle\nSame old niggas sayin they is gon' touch you\nFoes wanna act up when they with back up\nSo I pack up and go - yeah, yeah\nNiggas snitchin, niggas hittin nigga's bitches\nThis shit here is gettin ridiculous\nMe and Vishis in here flickin pictures\nNiggas gettin rich and sittin with them trick bitches\nNow picture me locked up for life for\nThe nigga who controllin the drop in the price or\nNiggas askin what I'm in they light for\nLike I ain't got an army behind me to fight for me\nNiggas money gettin glowed, niggas gonna get 'bows\nAnd they gonna get sold, on the road\nCause at home they denyin to feel me\nLabels wishin that they signed with the real me\nCause now that I rhyme with the feeling\nThat I am on, is dyin to kill me\nBut I am a soldier, as I'm gettin older\nI'm takin my show on the road\n\n[Hook: Royce]\nYou can find me, up in a quiet, town\nLike Ohio, tyin it down (on the road)\nIt's nothin, the pump on the block where you come from\nCop and re-up and whyle (on the road)\nLike a show you, go and come back with, dough\nThat's how shit goes (on the road)\nAnd it's nothin to cop or re-up where you come from\nIt's how shit goes (on the road)\n\n[Royce Da 5'9\"]\nYeah, yeah\nI'mma give it to you 'til you leakin\nThe problem with me is that I speak with the nine-millimeter\nThe problem with me is that I ain't equal\nProve it to you, pull you a line out of people\nThat movie you starrin in is rated R\nBecause I am the sequel\nBut I'mma be triumphant at least speakin\nRidin through the Chi or the D or the D.C\nMovin fifty pounds weekly\nLookin at the south region, thinkin about, am I greedy? (nah)\nIf I ain't, I don't eat inspired by Hennessy\nRidin in Tennessee (yeah)\nFuck around and meet me\nShuttin down everything from Uptown to up and down Beat Street\nBut I am a soldier, you know what I'm about\nIn the drop, I don't slow, when I go, on the road\n\n[Hook]\n\n[Royce - talking]\nY'knowmsayin?\nLike I, I see hip-hop goin forward\nY'know you got, people buyin into, basketball teams\nAnd, all types of crazy shit, y'knowmsayin?\nSo, I see a lot of people\nBeing able to provide for they families\nA lot of, Black people who would otherwise be out of work, havin jobs\nI just see everything movin forward.. {*echoes*}", "image": "https://images.genius.com/cd9172649c4be5e25b673a95fee73f73.400x400x1.jpg"}], "artist": "Royce da 5'9'’"}