{"songs": [{"title": "Porn Star", "album": "Paper Trail", "year": "2008-09-29", "lyrics": "[Intro]\nAy, Ay, Ay, Ay\nDamn shawty, look at you\nI'm saying man, is it just me\nOr do you have too much ass in them jeans?\nCome here\n\n[Verse 1]\nAy, I been watching you awhile now\nAnd I just wanna find a way to make you smile now\nWhy you blushing?\nForget about them other guys now\nI know you ain't going try and tell me that you shy now\nI realize that your beauty could intimidate\nThem suckers you ain't got no business wit'em anyway\nWit such a pretty face, big booty, little waist line\nI wanna grind from behind to the baseline\nHave a great time, pour yourself a shot girl\nChase it with a lime, now you feeling like a hot girl\nI know you probably use to dealing with them wannabes\nBut honestly I gotta say I'm who they wanna be\nI promise all I wanna see is you up under me\nAnd we can disappear whenever, when you wanna leave?\nI can guarantee the ride of your life\nAny fantasies on your mind we can try'em tonight\n\n[Hook]\nWe're sittin here\n(I'm lookin at you like damn)\nWe're sippin on Patrãn, something's on my mind\n(You wanna leave wit me tonight?)\nIt's been Killing me all night long and I wonder\n(Listen shawty let me tell you what I'm thinkin bout)\nOh girl, I wonder\n(For real, shawty let me tell you what I'm thinkin bout)\nIt's the end of the night\nI thinkin your might, wanna leave the bar\nPark the car, turn into porn star\n\n[Verse 2]\nYes, I love to hear about your interest\nI gotta say your intellect got me impressed\nSee your panties through your dress like a silhouette\nPatrãn got me thinkin sex, is you feeling that?\nNo disrespect though, a simple yes/no\nHey let yourself let go, shawty let's go\nPull up to the crib, get you through the threshold\nKiss you from your pretty lips to your red toes\nTime tickin it's the end of the night\nAnd you can leave wit your friend if you like\nBut I'm saying though\nWe can ride out, back to my house\nI wanna see you satisfied inside out\nOnce I'm in you ain't gonna want me to slide out\nYou tell your girlfriends they gonna wanna try it out\nA little more of this will loosen you up\nWhat we can't do in the club, we can do in the truck\n\n[Hook]\n\n[Verse 3]\nHey would ya, stay?\nCould ya play wit it with your tongue just a little?\nYou're such a sexy individual, physical and mental\nAnd if you sentimental\nShouldn't the rules bend a little\nLet me start at the top, stop in the middle\nUse a popsicle make shiver, giggle when it tickle\nI can talk to you dirty if you like that\nI finish once, hit a blunt, start right back\nI know you told me you a good girl\nBut shawty you a grown woman not a little girl\nYou can blame it on the Patrãn or the champagne\nBut sometimes being bad can be a good thing, ya now\n\n[Hook - Repeat 2x]", "image": "https://images.genius.com/cfd0caa9a36fd23db9dec05ae1a43aed.953x953x1.jpg"}], "artist": "T.I."}