{"songs": [{"title": "Sound Like", "album": "The Jukebox: Prelude to Class Clown", "year": "2009-06-01", "lyrics": "[Intro]\nDJ Capcom is about to fuck up hip-hop with this joint (Damn straight)\nSo all you haters out there, get back\nThis is a DJ Haze exclusive\n\n[Hook]\nAye yo Mac, what it is?\nWe wanna know what you sound like kid\nSo whatchu sound like? Who you sound like?\nHow you sound like? Why you sound like that?\nAye yo Mac, what it is?\nWe wanna know what you sound like kid\nSo whatchu sound like? Who you sound like?\nHow you sound like? Why you sound like that?\n\n[Verse 1]\nI sound like old, I sound like new\nI sound like me and I sound like you\nI sound like yes, I sound like fresh\nI sound like a bird first flyin' out the nest\nI sound like rap, I sound like rock\nI sound like every single type of Hip-Hop\nI sound like pain I sound like fame\nI sound like water and I sound like flames\nI sound like cash, you sound like change\nI sound like style, and I sound like bang\nSound like trash, sound like ecstasy\nSound like a harmony on a melody\nTo determine what I sound like, please come listen\nThis ain't no ordinary white boy spittin'\nMac Miller, here to give you sound bytes\nSo why do people wanna know what I sound like?\n\n[Hook]\nAye yo Mac, what it is?\nWe wanna know what you sound like kid\nSo whatchu sound like? Who you sound like?\nHow you sound like? Why you sound like that?\nAye yo Mac, what it is?\nWe wanna know what you sound like kid\nSo whatchu sound like? Who you sound like?\nHow you sound like? Why you sound like that?\n\n[Verse 2: Mac Miller]\nI sound like death, I sound like life\nCause good things don't come around twice\nI sound like feathers, and I sound like steel\nYeah, I sound like real\nSound like the next dude up to get a deal\nSound hungry like I never had a meal\nSound like heaven, sound like hell\nAnd it sound a lot better than it smell\nAnd it taste a lot better than it look like\nSo, I'm a make sure it cook right\nSound like Diddy vs. Suge Knight, sound like heat\nSound like the suburbs, sound like the streets\nSound like a bomb, sound like boom!\nSound like a kid writin' raps in his room\nDon't sound like your everyday rap cat spittin'\nYou wanna know what I sound like? listen\n\n[Hook]\nAye yo Mac, what it is?\nWe wanna know what you sound like kid\nSo whatchu sound like? Who you sound like?\nHow you sound like? Why you sound like that?\nAye yo Mac, what it is?\nWe wanna know what you sound like kid\nSo whatchu sound like? Who you sound like?\nHow you sound like? Why you sound like that?\n\n[Outro]\nThese mothafuckers know how I sound\nI sound like fresh, I sound like the new\nI sound like the mothafuckin' future\nSo if you ain't listenin', then don't ask what I sound like\nBut if you know, then you closer to the future\nMac Miller, Eastern Empire\nSounds right, haha", "image": "https://images.genius.com/d258961791ab731cca5aed7ed00e8073.500x500x1.jpg"}], "artist": "Mac Miller"}