{"songs": [{"title": "In the Air", "album": "Sickology 101", "year": "2009-04-28", "lyrics": "[Tech N9ne:]\nSickology 101 futuristic B-Boyz shit\nYour first lesson given to you by (Mr. Smith!)\nKC MO stand up, young niggas represent\n\n[Verse 1: Craig Smith]\nEy, ask me what I wanna be when I grow up, I ain't just gonna blow up\nI'm a star I got astronomers tryin' to get a close up\nTelescopes and cameras, rappers wanna use glamors\nBut I'm gleamin' from the planets, homie, mine is called Kansas City\nThe cloud in my pocket's gotta rain on 'em (Tell 'em!)\nSuch a star I saw Heaven's walls and wrote my name on 'em\nSo comfortable at the top I hopped on a plane and claimed Everest\nYou might as well say the boy is Himalayan\nI rent my rooms on the moon, Mr. Smith is comin' soon\nThe angels feedin' me cereal with a silver spoon\nMy hair line is Craig Smith Airlines\nA ride from Kansas City to LA is as long as a fan line\nI'm high as '08 gas prices, my votes are\nTwice as high as Obama's and I ain't gotta ask nice\nI'm high as Tech's tour bus, the light skinned one\nSo if you're lookin' for me dog look up and try to find the sun\n\n[Hook] (2X)\nI'm in the air\nHigh in the air\n\n[Verse 2: Nesto]\nYeah, don't mean to brag but I froze my piece\nAnd I'm gettin' higher then a nose bleed seat\nDon't bring her to my session, if your ho sees me\nShe'll drop dead in the studio like ODB\nYeah, it's the owner and I'm very cool\nPlus this weed keep me higher than an air balloon\nCopy cat, like what I'm wearing dude?\nI'm so fly, I walk around with a parachute\nAnd even rappers lie too\nBut I'm the only human with an astronaut suit\nSee yo entire verse? Say that your iron squirt\nWhen you only shootin' in the air like fireworks (Pussy)\nIf suckers still on that hatin' shit\nI'll stuff 'em in a bag like potato chips\nI'll bend they ass up like a paper clip\nTech, sign me and see how quick your paper flip\n\n[Hook] (2X)\n\n[Verse 3: Tech N9ne]\nI ain't gotta introduce myself, y'all know what it is\nWhy call me underground when I rock the stars?\nAnd even they can't see me with a pair of binoculars\nMy hip-hoppin' gave a good side swipe to Mars\nOne-Third an extinction hit, which left the limelight ajar\nYou want your scripts to fly, not in my solar system\nCause I'll dismiss 'em like they wished to die\nMack mother-nature and I ripped her, why?\nCivilian ladies love me, so bro, excuse her while she kiss the sky\nCall me master more exalted than a priest, a pastor\nBlasphemy have me blast fags fast with Magma\nIn the air like Dancer and Dasher\nHigh in the sky, above all mountains off in Alaska\nHigher than a million heroin hits if it'll last ya\nSuper-Celestial when everyone's stuck off in the pasture\nThe wack, I will cast ya down below those who get caught up in my rapture\nDon't be callin' me \"dog\" cause I want you to say it backwards\n\n[Hook] (4X)\n\n[Outro: Tech N9ne]\nYour first lesson for today man\nThat was it, Sickology 101\nYaddada mean\nCraig Smith, Nesto, Tech Nina nigga\nIn the air, motherfucker\nSound like a bird flying around\nYeah, Wyshmaster on the track\nWe out this bitch", "image": "https://images.genius.com/081166dc5d132ad1d3549578cac249e0.1000x1000x1.jpg"}], "artist": "Tech N9ne"}