{"songs": [{"title": "Thumbin’", "album": "The Black Bar Mitzvah", "year": null, "lyrics": "[Intro: Rick Ross]\nYeeaahh..!\nYou know I had to fuck with my nigga's shit\nYou know what I'm talking about\nThis is all I do nigga\nTouch money and touch bitches\nTalk shit and swallow spit\nAaahhhhhhhhhhhh..!\n\n[Verse 1: Rick Ross]\nHuuh.. She in love with my hustle, the Lamborghini, the 'Rari\nI put TVs in the back.. Sega, Dreamcast, and Atari\nPlay with it!\nI'm blowing loud, smoking out a trash bag\nTony Montana real estate, go check my lap back\nI'mma back to back like we riding through Bahgdad\nGot them choppas gold plated, bitch nigga back back\nI met her on the pole, I let her ride\nI let her see some cake, I know I'm out of sight\nThumbin' through the check, thumbin' through the check\nThree hundred on my wrist, swear to God I won't confess\nThumbin' through the check, thumbin' through the check\nThree hundred on my wrist, another hundred on my neck\n\n[Hook]\nUp in every early morning man I gotta\nFuck a money machine that's what I do\nI sell a bit then finger-fuck through it\nBet my most everything I do since I was two\nI don't know about you though but I'm gone do it\nThat's all I love to do\nThat's all I wanna do\nAll day, every day (Ayy!)\n\n[Verse 2: Rocko]\nThumb through that check, make sure its adding up\nThumb through that check, rubber band then bag it up\nThumb through that check, I don't know yo ass like that\nAin't no disrespect, make sure it ain't counter-feit\nI gotta thumb through that check, make sure its correct\nYou know these niggas be playin' games but we ain't goin' for that\nThumb through that check, he playin', I pay a bounty\nQuick a picker upper, bitch I'm from Fulton County\nThumb through that check, on everything I love\nI'm shaking booty gov. my favorite club the booty club\nThumb thru that check, I swear this shit so fun\nStack them hundreds, fiftys, twentys spending tens, fives, and ones (Ayy!)\n\n[Hook]\n\n[Verse 3: Young Scooter]\nI just juuged a million dollars, thumb through it all in 60 seconds\nCount it all with one hand, finessing, thrumbin through the check\nBrick fare, I thrumb through it\nFreebands, I thumb through em\nSleepin' thumbin through the check, got money in every room\nFuture up in Pluto thumbin' through checks throwing them down on you\nCheck in my pocket, shit taller than you\nThumb through the check, thumb through the check\nI just fucked yo bitch, I ain't give that ho no check\n70-thousand round my neck, that's another check\nPull up at the dealer, let em thumb through the check\nThumb through the check, finesse, finesse, finesse!\nThumb through it, blow it, juug that shit right back!\n\n[Hook]", "image": "https://images.genius.com/7a562a064cb983f896e86fc8449cc163.658x658x1.jpg"}], "artist": "Rick Ross"}