{"songs": [{"title": "Mad Fo", "album": null, "year": null, "lyrics": "[Intro: Swizz Beatz]\nYou know one thing I hate\nIt’s when a person come up to me\nOr I hear somebody say “it must be nice”\nYou know my answer that\nIs “You must me a hater”\nTell me why you mad for\nListen Luda we gotta keep it real boy\nWe gonna do it like this baby\nListen here you know what I’m saying\n\n[Hook: Swizz Beatz]\nTell me what they mad for\nCome around the hood\nSee us sitting there looking good\nTell me what they mad for\nCause you be on the radio\nSounding like you made a million dollars\nTell me what they mad for\n\n[Verse 1: Ludacris]\nTime to start putting grown-ass men on time out\nGo to the corner and cry somehwere man\nOld insecure ass nigga\nYour heart pump Kool-Aid man\nWhat you mad at me for\nIs it cause I got houses on every coast\nOr that I’m on that Forbes list making rich rappers look broke\nWhile they’re blowing that smoke\nI’m blowing a couple million\nMaking a killing stunting on impostors\nOnly rapper in the game with a grammy and an oscar\n7-figure movie deals, 8 figure bank runs\nAnd I’m still feeding the same hood that I came from\nAny car that you got i’ve altready drove\nAny chick that you hit, nigga I’ve already ho’d\nSay it with your chest like these diamonds on my tongue\nName on my headphones, label tatted on my arm\nAir traffic control say “Ludacris is insane”\nThat niggas daughter’s birthday’s the tail number on his plane\nFuck with me but nobody’s fucking with me\nTake in the sight of my cognac, more millions\nReal G’s chug it with me\nIf I’m happy there’s no reason you should be sad for\nSo will somebody, can somebody please…\n\n[Hook]\n\n[Verse 2: Meek Mill]\nHa!\nIs you niggas hating ’cause you mad\nOr is you mad ’cause you hating?\nChoose one, hater\nNow if these niggas hating on me I’mma kill them dead\nIf I wasn’t rapping I’d be probably be in the fifth\nIn the cell, getting mail, with a million dollar bail\nBut instead of counting blues, I’mma take this YSL\nAnd this Gucci, and this Louis, Prada ’cause I’m hotter\nI used to ball in Philly, with that nina and get dollars\nI beefs up in my Bimmer, check aboard my collar\nAnd when I check my bank account\nI’m checking for them commas\nI’m like all these niggas haters, all these bitches fucking\nAt 24 I went and bought a Ghost like it was nothing\nAt 25 I bought that Aston Martin, now we stunting\nAnd you nigga still talking all this money shit you bluffing\nYou bluffing, you bluffing, I really think you bluffing\n100,000 dollars man them bottles we just crush ‘em\nNow tell me why you hating? You hating ’cause you mad?\nOr is you mad because you hating, boy you sad\n\n[Hook]\n\n[Verse 3: Chris Brown]\nOk, I see why you mad, I’m counting all this money\nAnd I’m popping all these tags\nHopping to it, Fucking bunnies\nReal nigga, One hundred\nYou trying to do it, I done it\nI spit sick on this rap shit\nMake them sick to they stomach\nI’m clean man, you hate\nMad ’cause I’m gonna keep it real with a real nigga\nI got racks on racks, and a black maybach\nCall it black on black, cause I kill niggas\nIn the club all girls, no niggas don’t talk to me\n‘Cause I ain’t really trynna hear niggas\nIn the coupe it’s the truth\nAnd the roof go poof, vamoose\nI can make it disappear nigga\nSee this the type of shit that I be saying\nJust because I’m balling, that don’t mean a nigga playing\nHaters can blow me like a fan\nFlyer than a bitch, I don’t think I’mma ever land\nBut in the meantime, baby what’s your plan\nYou can call me daddy but I can’t be your man\nFiending like the addicts, when I pull it out they panic\nBitch I do damage, you gonna need an ambulance\n\n[Hook]\n\n[Verse 4: Swizz Beatz]\nShowtime\nPut one hand in the air if you know somebody\nThat’s mad at you right now for no reason\nRiding around in my jeep\nBumping that 2pac\nI’m walking around in my hood\nCocked back two Glocks\n98 in my status\nI came back I’m the baddest\nChristian’s on my feet\nI told you I’m the baddest\nAll the way in Paris\nDon’t talk you’ll get embarrassed\nMy watch is fucking…\nYeah you get embarassed\nMy life is just Ludacris\nSucka you just new to this\n430s pulling up\nGod damn we do this shit\nChickens and the waffles\nChilling in the villa\nBumping Ludaversal\nGetting that scrilla\n\n[Hook]\n\n[Verse 5: Pusha T]\nYuck!\nHey Luda, you know why these haters mad for right?\nThe truth shall set you free\nIf you sellin’ all the records and you fuckin’ all the bitches\nAnd you sit a top of the charts and you livin’ out your wishes\nWith your chains all smothered and your watches all glittered\nAnd your ghost and your phantoms all comin’ home to visit\nOr maybe cause your bitches was never really your bitches\nWith your baby mama fucking every rapper in the business\nNiggas saying you was better when the drugs was in your system\nNow your crack swag gone ever since you came from prison\nGot you tweeting all stupid, is you skatin’, is you dissin’\nFound out your Ghost leased and your Phantom just rented\nWon’t need it in your name like Pac when he went missing\nMakaveli lives on so I’m riding on you bitches\nHail Mary be the witness, Lord Willin’ I was dealing\nStupid motherfucking five star, tatted on his ceiling\nBullseye, be the motherfucking target for this killing\nAin’t y’all the motherfuckers with the millions?\n\n[Hook]", "image": "https://images.genius.com/6929169de7116d41676151bdea5cc773.1000x1000x1.jpg"}], "artist": "Meek Mill"}