{"songs": [{"title": "I Don’t Like", "album": "Dedication 4", "year": "2012-09-03", "lyrics": "Girls that don't do girls, that's that shit I don't like\nDick in her mouth, bitch eatin' her out, that's that shit my girl like\nI'm layin' back with my feet up, bad bitch: D cups\nAll I had was one molly, she took half: prenup\nI just licked my thumb and thumbed through that pussy like a catalog\nAll my niggas wanna fuck, and she gon let us like a salad bar\nYeah that's right, real shit, murderer, I kill kill\nCash Money, cash cow that never cry over spilled milk\nI'm way high on the highway, my girl call to get my lies straight\nThat machine gun go \"brrrrr\" like I got that bitch on vibrate\nNiggas think they hot, I cut off the hand they fan with\nCall me DMX, cause I keep me a bad bitch\nT called some of them hoes up, Marley G roll up\nI'm gettin' bread like cold cuts, she suck dick till her nose run, yeah\n\nA rich nigga that that shit they don't like\nAll you niggas pussies, none of you pussies tight\nGettin' head while I drive make me run lights\nThese hoes wanna ride my dick you gotta hitchhike\nNo lie, I'm fuckin' bitches and gettin' paid\nShe suck my dick for 60 seconds and swallow all my Minute Maid\nNo lie, I'm gettin' paid and fuckin' bitches\nThe Feds on me, gotta switch plates\nIn the streets we call that washin' dishes\nLeft hand on that steering wheel, right hand on the nine-milly\nT-roll my blunt long as a lifespan then I kill it\nEatin' pussy, tongue kissin' and all that\nShe ridin' a nigga so fast, my dick feel like it's been carjacked\nTwo guns drawn, art class, what that is that's y'all ass\nMo' money, mo' money, we gettin' mow like tall grass\n\nWe are not one and the same\nBlood is the gang, it run in my veins\nI bagged your bitch then fuck her\nNow come get your bitch from baggage claim, nigga!\nDr. Carter, fuck her harder\nAll my homies bald, nigga\nAnd guess what? I'm the barber\nI'm too high; if I come down my fat pocket's my shock absorber\nLike Hank Gathers I'mma die a baller, you flamin' faggots put him out with water\nUgh! See that's that shit I don't like\nKnock off your whole left side, now you all right\nYeah white diamonds, Vanilla Ice\nMy nigga Tunechi, yeah that nigga nice\nDedication 4, ho\n(My nigga Tunechi, yeah that nigga nice)\nCB fuck with me!", "image": "https://images.genius.com/1cca3a7cb35e2d8b6baa82593cc9844d.525x525x1.jpg"}], "artist": "Lil Wayne"}