{"songs": [{"title": "Triple X", "album": "What’s My Favorite Word?", "year": null, "lyrics": "[$hort] Yeah we ridin... yea\n[woman] Short Dawg\n[$hort] We ridin, just bounce wit me\n[woman] Short Dawg - here to play the game\n[$hort] Yea...\n[woman] Whatch'all gonna do?\n[$hort] And we ridin\n[woman] Short Dawg!\n\n[Too $hort]\nWhat's on yo' mind ho?  That nigga Too $hort\nGot you playin witcho' pussy fo' twenty-fo'\nIn the mo'nin, why I won't call you back\nGot another little freak all on my lap\nShe's been tellin me things that I wanna hear\nSo I hit you on another day, another year maybe\nI still wanna see you baby\nI know I told a few lies, you wanna be my lady\nI let you ride with a player in my new truck\nTake you straight to my house, you can do me up\nAnd back down again, get around your friends\nLet 'em know, e'ry nigga from the town's a pimp\nMy daddy was a player, my grandpa too\nNow what the fuck else am I supposed to do?\nPut my finger on the pussy, rub the nipple next\nShort Dawg's in the house with the triple X\nI'm a hooker's dream, a hoe's delight\nThey prove it, with bankrolls every night\nYou like to kiss her, she like to drink sperm\nGet you high, smokin that pink sherm\nI don't have sex with her, she just give me head\nLike the ex-President, I don't need a bed\nLet it drip down your cheek, get all on your dress\nRinse the evidence or rub it all on your tits\nI don't care - cause I'm cold as ice\nI don't feel nothin for you, think you know I'm nice\nThat's what you heard about Todd when I'm gettin hoes\nLeave a trail of broken hearts when I let 'em go\nIt's not my fault, cause they be all in the club\nBelievin what I say, bitches fallin in love\nWhen all I really wanted was a little sex\nTurn your ass out with my triple X\n\n[Chorus: female singer]\nIt's Short Dawg, he came to play the game\nSo whatch'all wanna do?  He'll make you say his name (Short Dawg)\nIt's Short Dawg, he came to play the game\nSo whatch'all wanna do?  He'll make you say his name (Short Dawg!)\n\n[Too $hort]\nNow what you bouts to do, little prostitute\nI see that sucka in ya ear but I gots to shoot\nSome real game your way, what I came to say\nIs what I did yesterday it ain't gon' change today\nAnd if I cain't knock you I bet I get her\nCause I'm a hard workin pimp, I'm not a quitter\nThese hatin lames, don't even realize\nShort Dawg's dirty rhymes make them fantasize\nI don't dream about pussy cause I get too much\nCan't believe that nasty slut didn't let you fuck\nBut maybe you ain't ready for the skills she got\nNon-stop, hit the cot, the bitch still be hot\nShe's workin tonight, she'll stick to the script\nMy life is so tight, when hoes flip you tricks\nPut a sponge on her pussy and she'll still be wet\nAnother bitch turned out by my triple X\nIt's nothin new - I've ran up in a few\nHit the party had the hardest G's cuffin them too\nCause I'm a mack, the whole world knows that\nI'm in the house, you better hold your hoes back\nFuck $hort - that's what the bitches thinkin\nPut my hand up her dress and her clit was stinkin\nI gotta pass!  Pussy smell like ass\nSo I jumped in my Benz and gave it hella gas\nI can't believe you nasty girls tryin to get some\nSit on my shit and give my dick the runs\nLike the East coast homies they don't slip son\nToo many women in the world, you bound to get one\nThat slick bitch, dressed her up and played the road\nBut all my niggas out in Texas say the bitch is throwed\nShe snort coke, rollin on them triple stacks\nRated X in the back while we dip the 'llac, beotch!\n\n[Chorus]", "image": "https://images.genius.com/5b217fd6496369f950dd5a8a14ae52aa.1000x1000x1.jpg"}], "artist": "Too $hort"}