{"songs": [{"title": "Family Affair", "album": "Disturbing tha Peace", "year": "2005-12-13", "lyrics": "[Shareefa]\nFeel like niggas taking us as a joke\nGotta show 'em who boss\nMy team gotta eat\n\nYou niggas be stupid and come with that beef shit you losin\nMy squad is guerillas no questions don't like us then sue us\nA natural disaster I follow the footsteps of Luda\nIt's my time to shine\nDon't need no co-signer I speak through my music I'm tighter\nThan any female in your camp, see I'm taking the title\nThink I don't see these snakes hatin on me\nTime to expose these chicks soundin like me\n\n[Lil' Fate]\nCheah! Lil' Fate, nigga\nG-Road, Southside\n\nYou niggas can't compete, I do this in my sleep\nDream about money, laying on million dollar sheets\nLook at my feet, Louis, Gucci\nTo me Bathing Ape cheap, truly who he\nThank he is lookin all fruity?\nGhetto-ass nigga got some money and turned bougie\nLook at all them groupies, bopping, jocking\nFuck that shit, Lil' Fate's a problem, and you can't stop him\n\n[Tity Boi]\nI got a buncha shit\nI got a buncha shit\n\nBuncha flows, buncha dough, me and a buncha hoes\nDrop some elbows on to ya, call 'em Dusty Rhodes\nI done bought alot of ice, I don't fuck with clothes\nI was a felon, you see me fail\nNow the truck so big I need CDL's\nOnly child that's poverty stricken\nProject lifestyle, I will get rid of you nigga\nQuicker than a sack off in the trap\nDo it like the dons do it\nI'mma serve the next car that come through here\n\n[Dolla Boy]\nWe defeated the odds, my squad is the realest\nEnd up reaching the stars, they say the sky was the limit\nFrom the start to the finish the hardest that did it\nAnything different is not realistic, we're not listening\nThis is now a intro of a click called DT\nPunch you in your shit folk, get wrong, silencer hit home\nUgly when they hit home\nTell them sucka niggas we from Southside we been on, we been on\n\n[Brolic D]\nNow I'm the hood's best I dun travel the long road up on this rap quest\nStrap vest young'n, North Carolina accent\nDon't act amped, Mac 10 bring truth with its back stance\nBlack bands on the money knots when I'm in the spot\nPosted whipping pigeons in the kitchen for them lemon drops\nI'll fix ya when I hit ya clip hit ya for your lemon pop\nNowadays I ain't on the block pitching but I'm in the spot shifting\nFor the top and the 6 is from the lot\n\n[Perfect Harmony]\nOasis of this desert rap mirage hierarchy\nKN guns play for the your Suns like Barkley\nSo don't bother me, we got choppers like west coast or Orange County\nBorn with that norm about me\nThey be high up like a balcony\nInspiration get it out of me especially when they doubting me\nI'll never go back to the Bedford Drive way of living\nCause I thrive on precision you're high off wisdom\nYes I am a Christian, I make niggas listen\nHow my intermission one time found it's way in prison\nCause I don't act up, make you think\nYou hear that loud beep on a Mack Truck, ya hear me? Yeeeah!\n\n[Small World]\nSince I been wit a DTP, man everything just been better man\nBetter whips, better chains, better grip in the bank\nExtra clips cause the young boy gun got better aim\nYoung veteran, let me spell my name, S-M-A-L-L-W-O-R-L-D\nYou will honor me, cover y'all niggas in dirt like pottery\nMy influence on this earth's surface is certain 4.4 certain to blow\nYou who it's curtains fo' when it's for Kurtis Blows\nThis here for the world to know, we fixing to blow like Merlin's nose\nTwist chicks and curl they toes, then twist and twirl the dro\n\n[Smoke]\nThey say roses are red so is the gold on my neck\nThey say violets are blue and then my diamonds are too\nD.T.P., got me on the bubble like court top\nSince I met Luda I been playing diamond like shortstops\nSportin' rocks whiter than caucasians\nYellower than a coward tar hills in my red chain\nBluer than Smurfette's face, see through like an X-Ray\nThanks to Chak and Jeff lots of wealth\nBlocks and bells and stock and shares, I'm outta here\n\n[Shawn J]\nMan, when it come to getting head I'm the local champ\nThe only male that get licked more than a postage stamp\nIt's a house in my garage, the car came with a green card\nIf you're a peon that means it's Eu-ro-pean\nPunch lines bruise egos, rap Zab Judah\nDon't get *Furious 2 Fast* and *Crash* like Luda\nGet dashed on, Bobby Johnson that ass\nGot potatoes for haters, niggas want beef, they get mashed on\n\nYou ain't know? Shawn mothafuckin' J, D.T.P\nFPI, every mothafuckin..\n\n[I-20]\nIt's the verse that you been waiting on, from the nigga they be hating on\n20 is the anchor every bitch is conversating on\nYour crib got square feet, too much for me to talk about\nYou saving for your car note, my driveway's a parking lot\nEastside OG, they hate it when a nigga leave\nI'm coming up in this world, you niggas dry heave\nThis is my speed I been here from the first day\nY'all niggas can't take our spot, y'all just valets\n\n[Ludacris]\nMotherfuckin right. You betta understand it man, it's a Family Affair\nDisturbing Tha Peace. Ludacris on the microphone\nAnd as I told you before, we just getting started\nThat's right. We don't die, we multiply, nigga\nSo whoever want it, come on and get it\nWhatever you want, we could supply it\nThat's right dammit\nOh wait a second y'all thought I wasn't gonna rap on this motherfucker too?\nI'm the boss nigga, look...\n\nMotherfucker, I'm a monster in this game, I thought I told you before\nFans so geeked up you think I sold them some blow\nThey sold on the flow, this rap game I'm closin the do'\n5 years in a motherfucking row, who want it? I got it\nCuz my raps are chaotic, your face blue like Hypnotiq\nCause I'm a multi-millionaire who still using Ebonics\nOr country grammar we gon' bananas in South Atlanta\nJesus was a carpenter so we're proud about cocking them hammers. Nigga\n\nI'mma leave you with that, think about. Let's go...", "image": "https://images.genius.com/ca7a724b4b53a52595efa79bde19ff2e.1000x1000x1.jpg"}], "artist": "Ludacris"}