{"songs": [{"title": "South Bronx 2002", "album": "Spiritual Minded", "year": null, "lyrics": "This what you call hardcore, fat gospel.. street gospel\n\n[all] South South, Bronx!\n[KRS] Yo where my people at?\n[all] South South, Bronx!\n[KRS] Yo where my heart is at?\n[all] South South, Bronx!\n[KRS] C'mon let's bring it back\n[all] South South, Bronx!\n\n[KRS-One]\nRaw rhymes for raw times\nMy albums are underground, but this blessing is all mine\nAnd when it's tour time, we open more minds\nYou need to rethink who you think is the \"Greatest of All Time\"\nI got this -- I'm raw like Freddie Foxxx is\nHardcore like The LOX is, Scott LaRock is where 2Pac is\nWhere hip-hop is, Digital-ly Underground like Shock is\nOh yes -- I know where the top is\nBut I'd rather rhyme about how crooked some of these cops is\nMy synopsis ain't pretty\nI'd stay, off them plains and, out the city if I were you\nDo what you gotta do\nBut while you wave them flags, remember Amadou .. Diallo\nHere's what we gotta do, follow\nI'll put hip-hop in you if you're hollow\nThose that already filled, STILL take swallows\nGoin over potholes with Tahoes\nYou don't think +I+ know?  Huh!  I'm lookin at you right now\nYou ain't dancin in the club, you in your car, sittin down\nYou in the crib, on the low\nYou got them headsets on the go\nYou just saw me at the show - oh you don't know?\nIt's the Temple of Hip-Hop, comin, with a whole DIFFERENT flow\nYo where them hoes at?  I don't know\nBut wherever God at, I'mma go\nI give 'em a hard rap AND a flow\nThat's why when they call back for the show, with no video\nWe get up and go!\n\n[Hook: repeat 2X]\n[KRS] Yo where it started at?\n[all] South South, Bronx!\n[KRS] Yo where my people at?\n[all] South South, Bronx!\n[KRS] Yo where my heart is at?\n[all] South South, Bronx!\n[KRS] C'mon let's bring it back\n[all] South South, Bronx!\n\n[KRS-One]\nPeep it out while I tell ya like this\nIn every single hood in the WORLD I'm called Kris\nIt's the, truth for ya, it's the proof for ya\nMy Cristal passes more bars than lawyers\nThe underground sound, this is not easily found\nYou don't need no rings to be down\nThis is, past the platinum and gold\nWe already had 'em, it's old\nHere's the truth if it be told, gather 'round\nPhilosopher style is known to be wild\nIf you only holdin them guns, who's holdin your child?\nYou got to be thinkin you KNOW that you shrinkin\nWhen the art of Navigation has been reduced to a Lincoln\nChange the dial!  I was free then and I'm free now\nYou free, runnin to MTV?  I don't see how!\nYou know the real from the fake, you know they stealin they cake\nYou know it ain't about the art, it's all about what they make\nYou know the radio's late, you know they play what you hate\nThat's why you got that Kay Slay tape, tryin to escape\nYou know the love of the cars and the rims\nTattooed arms and Timbs, are also called sins\nYou know you got to pay for these spins\nYou know the rap magazines be wack from beginning to the end\nBO!\n\n[Hook]\n\n[KRS-One]\nI never was a king and I'm not the Pres\nI'm a teacher like that reefer goin straight to your head\nI'm a preacher tryin to bring my people back from the dead\nI'm a leader tryin to keep you all away from the feds\nYou my sister I'll be tryin to get you OUT of the bed\nI'm a philospher sayin what has GOT to be said\nI don't FILL you with lead, I bring that KNOWLEDGE instead\nFOLLOW this dread, I'll take you from A to Zed\nWho am I?  Just a scholar called K-R-S\nYou can spend your money on others but THEY AIN'T BLESSED\nYou can spend your money drugs and STILL BE STRESSED\nLook around for conscious rappers yo there AIN'T NONE LEFT\nI'm holdin it down; better yet I'm holdin up\nWaitin for some young buck to come and sip from the cup\nAnd continue with the menu puttin new knowledge in you\nI got a question and a lesson cause I KNOW what you been through\nBut..\n\n[Hook] - 1/2\n\n{*no beat*}\n[KRS] Yo where it started at?\n[all] South South, Bronx!\n[KRS] Yo where my people at?\n[all] South South, Bronx!\n[KRS] Yo where my heart is at?\n[all] South South, Bronx!\n[KRS] C'mon let's bring it back!!\n\nThe South South Bronx, boyeee..", "image": "https://images.genius.com/d84f73e1b21b8b4dbd679efa191364e4.1000x1000x1.jpg"}], "artist": "KRS-One"}