{"songs": [{"title": "Split You Up", "album": "The Come Up Vol. 1 Mixtape", "year": "2007-05-04", "lyrics": "[Intro]\nYeah, hahaha\nYeah, uh\nYeah, uh\nReal niggas can relate, yeah\nHahaha, Ville niggas can relate, man\nYeah, yeah, uh\n\n[Verse 1]\nI see you looking at me hard shawty, what it's gonna be?\nBut you right next to your man, don't let him run up on me\n'Cause I see him tryna grill, better take his ass home\nBefore I lay his ass out, then I take ya ass home\nI even gon' front man a nigga tryna cut\nI ain't tryna take his place, I just want to hit you up\nWhen that nigga ain't around I just want to pick you up\nBring you back to the crib, sip a little liquor up\nThen I give you a massage, get you wet, get you up\nThen I give you what you want, if it's clean I lick it up\nNow you can do me, if it's right my shit is up\nFace down on your stomach, take that ass and lift it up\n\n[Chorus]\nThen I do my thang, now shawty listen up\nYeah, your pussy do bang, got no problem hooking up\nJust remember why I call ya, and why we getting up\nI ain't tryna be ya man, I ain't tryna split you up\n'Cause I do my thang, now shawty listen up\nYeah, your pussy do bang, got no problem hooking up\nJust remember why I call ya, and why we getting up\nI ain't tryna be ya man, I ain't tryna split you up\n\n[Verse 2]\nI be that nigga on the side when you feel you want to creep\nWhen you in the bed alone why ya man run the street\nAll you got to do is dial, let the phone ring twice\nBaby girl I love your style, I won't even think twice\nI ain't even gonna front, man a nigga tryna beat\nI ain't tryna wife you up, though you is a dime piece\nI just love the way you ride like a certified freak\nHow you throw it right back, got a niggas thighs weak\nSo just hit me when you want it, you know how to find me\nGot no times for no games, you know how the grind be\nBut-I'm a make the time if you bout' it dial me\nI'm a make you say my name like a caller ID\n\n[Chorus]\nThen I do my thang, now shawty listen up\nYeah, your pussy do bang, got no problem hooking up\nJust remember why I call ya, and why we getting up\nI ain't tryna be ya man, I ain't tryna split you up\n'Cause I do my thang, now shawty listen up\nYeah, your pussy do bang, got no problem hooking up\nJust remember why I call ya, and why we getting up\nI ain't tryna be ya man, I ain't tryna split you up\n\n[Verse 3]\nGive you money to get ya hair did-he can do that!\nPay for dinner and a movie-yea he can do that!\nWork you out in the bed-maybe he can do that\nBut I know you much rather call me to do that\nAnd girl I'm with it! Haha, yea\nI'm so with it, babygirl I'm so with it!\nSo let me hit it!\n\n[Chorus]\nThen I do my thang, now shawty listen up\nYeah, your pussy do bang, got no problem hooking up\nJust remember why I call ya, and why we getting up\nI ain't tryna be ya man, I ain't tryna split you up\n'Cause I do my thang, now shawty listen up\nYeah, your pussy do bang, got no problem hooking up\nJust remember why I call ya, and why we getting up\nI ain't tryna be ya man, I ain't tryna split you up", "image": "https://images.genius.com/bda451f623edd51bf1dcc17564bd3e70.501x501x1.jpg"}], "artist": "J. Cole"}