{"songs": [{"title": "Let’s Get High", "album": null, "year": null, "lyrics": "[Intro: Mac Miller]\nYo, what’s up\nRight now this is Mac Miller with my homie TreeJ\nYou know what I’m saying it’s 4/20\nPiff Jar baby getting me fucked up\nHigh as hell, right now, so much weed in my lungs\nI’m really high, it’s like a fucking movie except I can’t see cause I’m so high\nThank you TreeJ for this bomb-ass weed you hooked me up with, peace, love, more weed, blah blah blah!\nMan you kids got some, you got some other stuff, man\nYeah man, yeah man. Sounds like a weed anthem right here\nAnd if you say I make to many weed songs, I say you don’t smoke enough weed! Bitch!\n\n[Hook: Mac Miller]\nLet’s get high, high, lets get high, get high, get high, get high, get high, get high, get high, get high, get high\nI wanna get high\nGrab it break it, roll it up, smoking joints, smoking blunts, grab it break it roll it up, roll it up, roll it up\n\n[Verse 1: Mac Miller]\nFeel good when you go and get an O\nAnd you wanna roll the whole thing up\nA little codeine in my cup with some funk\nGon' take me up I'm trying to get lifted are you\nWith it cause you ain't ever been this high\nBefore I'mma light my weed inhale then blow that\nSmoke gotta bag full of good we can toke no\nAir balloon but lets float we way up in the clouds\nDancing on the stars keep breaking it down then\nRollin up cigars paper or blunt lets roll it\nVaporizer or bong or lets bowl it so gone im feelin\nHome sick this chronic so explosive\n\n[Bridge: Mac Miller]\nI'm so high\nI'm so high\nI'm so high\nAnd I ain't comin down\n\n[Hook: Mac Miller]\nLet’s get high, high, lets get high, get high, get high, get high, get high, get high, get high, get high, get high\nI wanna get high\nGrab it break it, roll it up, smoking joints, smoking blunts, grab it break it roll it up, roll it up, roll it up\n\n[Verse 2: Mac Miller]\nGotta little bit of weed from my homie on the\nCorner but I gotta get more hovering above the\nFloor I can go anywhere no cord more or less I'm\nHigh and you can't catch me\nYeah that bag of fifth dont impress me\nWeed gunna knock me into next week\nWe just tryna get jetskied a bong with ice\nBut no Gretzky you trying to get high with me\nTravel 30 thousand feet in to the sky with me\nSmoke til you feel like you gon' die with me\nI got sour kush and all kinds of weed\nCome fly with me I can sing I just find the\nKey and he know where all the vinyls be so\nHe be makin all kinds of beats\nAnd when I find my tree I'mma roll it up\nNever ever gunna sober up if you wanna come show\nSome love just smoke my drugs\n\n[Hook: Mac Miller]\nLet’s get high, high, lets get high, get high, get high, get high, get high, get high, get high, get high, get high\nI wanna get high\nGrab it break it, roll it up, smoking joints, smoking blunts, grab it break it roll it up, roll it up, roll it up", "image": "https://images.genius.com/366878b883f76791456cd61fd70a9b6c.275x275x1.jpg"}], "artist": "Mac Miller"}