{"songs": [{"title": "I Need a Favor", "album": "The World is Yours", "year": "1993-08-17", "lyrics": "[Intro]\nYeah, that’s how I like it, just like that\nCheck this out\n\n[Scarface & Female]\nHello?\nHey, what’s up?\nHey baby, how you doing?\nWhat’s happening?\nAre you in town yet?\nNah, I’ll be in about 9:30, 10 o’clock—what you up to?\nNothin’ baby, just waiting on you\nOh, like that?\nMmm-hmm…\nAy look here, I got some potnas out here right\nUh-huh…\nThey showed me a real nice time while I was down here\nDamn, that’s good, baby\nYou know me, I’m good-natured, I kinda wanna return the favor\nYou know?\nYeah…\nSo look here, we need to have a little fun tonight\nLet’s do something different\nWhat you wanna do different, baby?\nWhy don’t me, you, and my potna take a ride?\nUh, well, you know, baby, I’m down to take a ride\nWhere we going?\nUh, let’s go out to the water\nMmm, that sound kinda cozy\nYou know what I’m sayin’, go out to the water\nYeah, let’s go to the water, baby\nI want you to do something different with him too, though\nI mean, what you want me to do that’s different?\nI want you to show him a nice time like you show me a nice time\nDamn, baby, you know…\nBut see, if you was really really down with me like you say you is\nYou could respect that coming from me\nWell, baby, you know, I cherish you, you know, and uh…\nYou supposed to\nI’m just willing to do everything you want me to do\nYou supposed to\nWell, what is it then?\nI want you to do what you do to me\nDamn baby, you know, I wanna do it\nBut I don’t wanna do it better than I do you\nShit, I ain’t jealous\nI don’t know, his girl mighta did me better than she did him\nDamn, well, you know, I know I’m a winner, you know what I’m sayin’\nSo I can’t let his bitch outdo me, you know what I’m sayin’\nCan’t let her outdo you, baby\nBut, uh, I just wanna know one thing\nWhat’s that?\nWill you look down on me if I do that?\nLook down on you?\nUh, well, will you still respect me as being your lady?\nShit, if anything, that’ll, you know, make me respect you more, you know\nWell, damn baby, you know, uh, that’s the way I like to see it, you know\nMmm-hmm…\nWell, uh, I think we should do this shit, you know\nYou gon’ have to\nWell, let’s get it on\nShow me that you, you know, really appreciate me the way you supposed to\nYou know\nWell, baby, you know, your wish is my command, baby\nI hope so—ay look here, I’m running up my phone bill\nLet me call you later\nOkay, baby\nBut yeah, just pick me up from the air—nah, nah, don’t do that\nUh, I’ll call you when I get home\nAlright, baby\nAlright\nSee ya\nBye…\n\n[Outro]\nAy, what’s happening in there?\nAin’t shit happening? Ay Mike, Mike, haha, Mike…\nAy, why don’t you put something on I could rap to\nAnd turn that piano shit off\nHold up, cuz, let me do this…", "image": "https://images.genius.com/2c9d70007eb3a5b42d898b73f3ce76f0.936x936x1.jpg"}], "artist": "Scarface"}