{"songs": [{"title": "Virgo", "album": "Street’s Disciple", "year": "2004-11-30", "lyrics": "[Intro: Nas & Doug E. Fresh]\nYeah, what! You!\nUh-huh! C'mon!\nYeah (ugh), yeah, what?\nUgh! Nasty Nas, Virgo\nUh-huh\nL-L-Ludacris, Virgo\nUh, uh-uh\nDoug Fresh (uh-huh-huh!)\nAs we go, somethin like this\nNasir (C'mon! Ugh!)\n\n[Chorus: Nas]\nBaby girl, won't you come and hold my hand?\nWon't you come and chill out with the Virgo?\nHey girl, just come and hold my hand\nWon't you come and just chill with the Virgo?\nWe sippin' on Merlot, you ain't got be my girl, though (huh)\nI drop you off at Willoughby and Myrtle\nSmash with the Virgo, ain't got to take your shirt off\nYou seen me convince your homegirl, though\n\n[Verse 1: Nas]\nUgh, she says her life is too hard\nShe says that she wanna come and build with the God\nPromise me that she gon' play her part (ugh)\nCause what I spit gets straight to her heart\nAnd, she's damn fine, feet Hammer Time, damn, if I mind\nLong as the butt bubblin' back in your waistline\nI don't waste time (ugh), I gotta get-get on it\nJust you and me, two glasses, silver Patronin' (ugh)\nIn the club scene where I met Ms. Green Eyes (uh-huh)\nShe walked by askin' me, \"Are you Nas?\"\n(Why?) \"If you was I'd be totally twi\"\n(What's that?) \"Totally with it, T-W-I\"\nHaha, well, here I am, yep, I'm the man\nBartender, put a Cosmo in that girl hand (ugh)\nSo, here we standin' before I begin\nHomegirl made a knot out of the cherry stem (woo!)\nTongue skills, yeah I like that (yeah)\nNow we on the right track (uh-huh)\nStraight to my Phantom, call Africa Black (brrrp!)\nEver since then she been yappin' a track\nTold her friends, now they hollerin' behind her back, sing!\nC'mon! Ugh!\n\n[Chorus: Ludacris & Doug E. Fresh]\nBaby girl, won't you come and hold my hand?\nWon't you come and just chill with the Virgo? (That's right)\nHey girl, just come and hold my hand (uh-huh)\nWon't you come and chill out with the Virgo? (Tell 'em, tell 'em)\nWe sippin' on Merlot, you ain't got be my girl though\nI drop you off at Peachtree and Myrtle (Ugh!)\nSmash with the Virgo, ain't got to take your shirt off\nYou seen me convince your homegirl though (ooh! ooh!)\n\n[Verse 2: Ludacris &  Doug E. Fresh]\nNow I was, so fresh and so fly in diamonds\nWhen I stepped up in the club even my eyes was shinin'\nLittle cute thing, said, \"What's yo' name?\"\nI put my necklace in her face and told her read the chain (woo!)\nOoh-ooh, so stuck up, told me shut the fuck up\nBLAOW! Ludacris in the how-oooh-ouse!\nThe needle hit the record, they was playin' this song\nAll the ladies hit the floor and it was uh-uh-on (ugh!)\nLive forever like 'Fame,' let the Leroys dance\nWhile I'm laid back, chillin' in my b-boy stance (c'mon!)\nCould be a little pop lockin' if your girl's top droppin' (yeah)\nBut watch for cockblockin' on my coochie stock options (woo!)\nBut later for the ASSDAQ, throw 'em on the fast track\nMake 'em swip-swap; Nasty N-A-S, pass that\nHoney in the black cause I'm feelin' her curves\nHe looked down at what I had and said, \"W-w-word\" (ugh!)\nWhy only serve one when we can serve up two?\nThen at the bachelor pad, doin' what the Virgos do\nAnd these women so shy but get loud undercover\nSo we can have sex but I can't be your loverrrrrr\nBuck! buck! buck! buck! buck! buck!\nAh, ah-ha-ha, ah-ha-ha, ah-ha ah ah-ah, SING! (UGH!)\n\n[Chorus: Doug E. Fresh]\nBaby girl, won't you come and hold my hand?\nWon't you come and just chill with the Virgo? (c'mon!)\nBaby girl, won't you come and hold my hand?\nWon't you come and chill out with the Virgo? (ugh!)\nWe sippin on Merlot, you ain't got be my girl though (that's right!)\nI drop you off at Two-Fifth and Lex-o (rmmmm!)\nSmash with the Virgo, you ain't got take your shirt off\nSeen you convince your homegirl though\nAyo, ugh!\n\n[Outro: Doug E. Fresh]\nThey got my voice for the record and my voice for the beat\nVirgo crew, baby run the streets\nSo let's go (let's go), let's go (for the beat)\nLet's go (Virgo crew), it's the Virgo\nLet's go (Nasty Nas), let's go (Ludacris)\nAnd if you don't know, now you know (Doug Fresh!)", "image": "https://images.genius.com/8c7b48c7e645eb6bd0f7b7378574d67b.1000x1000x1.jpg"}], "artist": "Nas"}