{"songs": [{"title": "Never Hold Back", "album": "Tical 0: The Prequel", "year": "2004-05-18", "lyrics": "[Intro: Method Man (Dooney Boy) {Pinky Phat Phat}]\nCool, okay, I'mma let ya'll take it on your own right now\nWhy don't you do me a favor (What?) {What?}\nTell me a joke (why did the chicken cross the road?)\n{To get five dollars from her baby daddy!}\nEheheheh (hahahahahah) you got that? {eheheh}\nWe gon' roll with that right there, aight then\n-- beat drops --\nGilla House, muthafucka, Gilla House\nGilla House, muthafucka, Gilla House!\nYeah, another Def Jam, where we don't make stars\nWe just sign 'em, uh-huh, that's what's up, Big Sox\n\n[Method Man]\nI'm on the grind... (can't wait to shine)\nFuck that, I pull your blinds, catch you f'ing with mines, no go 'head\nI got no time (hate to be wastin' time), muthafucka know the name\nAnd know that I ain't feelin' ya'll lames, like novacaine\nAin't no way you can (stop the train) or the conductor\nOf the track, muthafucka, that's E3, my love for the game\n(it's just not the same)\nUnless it's Gilla House, and Wu-Tang Clan, in the house, cop them thangs\nLive together and (pop the chain), know your lane\nFuck cocaine, stick up, bout to blow your brains off the map\nThe (Flame is back), it's the amazing\nJ. Blazin' grapes of wrath turn to raisin\nWhat part of the (game is that), we not playin'\nYa'll try'nna raise the price at the door, we not payin'\nSo watcha (watcha want?) You kids are slum\nAnd son got knuckles in his Air Force One's, come on\n\n[Hook: Saukrates (E3)]\nNiggas never seen it this raw (but nothing's gonna hold me back)\nKeep the heat up by the big dog (but I don't wanna hold you back)\nNigga gotta get this dough (I just wanna live my life)\nNigga gotta get this dough (Live your life)\n\n[Method Man]\nYo, yo, on the air (thought you dead?) But I returned\nTo give you what you waited four years, now to burn\nHold your head (and know your ledge) your life flash by\nHey, kid, walk straight, master your high\nMethod Man (Method Man, Man) Whoa, like Black Rob, go\nCatch me in the West Wing, I might \"Rob Lowe\"\nYes, I can (yes, I can can) tap your jaw\nAnd tell whatever chick that I'm with, slap your broad\nThis is it, (I'm stuck with ya'll) and ya'll stuck with me\nIn the lap of luxury, where the hell's cut for free\nAnd the kid (can't fuck with ya'll) Til I got a tree\nOn some new property, at my new pot to pee, have mercy\n(Mercy me) Things ain't what they used to\nSoon as you get your shot on the top, somebody shoot ya\nThese rhymes (ain't nursery) Life's a bitch\nThen you go to court, and she take half your shit, come on!\n\n[Hook 2X]\n\n[Outro: Method Man]\nMy, life, your life, yeah, Mr. Meth, Big John Studd, yo\nYa'll know how I do it, screw it, all day, everyday\nYou know what I'm sayin'? Stinkin', drinkin' and fightin' crime\nStaten Island, stand up, we in the muthafuckin' house\nCome on!", "image": "https://images.genius.com/b570b137bfca42564ca115c745cf3a4c.500x500x1.jpg"}], "artist": "Method Man"}