{"songs": [{"title": "Theodore", "album": "Bulletproof Wallets", "year": "2001-11-13", "lyrics": "[Intro: Twiz (Ghostface Killah)]\nGenerals on deck, what's up, son?\n(Yeah, yeah, yeah... come on!)\nSalut this (Library shit)\n(Rock the belt, uh-huh, you know what time it is)\nThey understand and support us\n(I ain't goin' out) Theodore (Uh-huh!)\n\n[Verse 1: Ghostface Killah]\nAiyyo!\nStark edition, rock Christian's\nThe crystallized rock got the big jewelry dealers on a mission\nWith a slick taste of lace, I done smacked New York City\nThe 450 went poppin' when he tried to dip me\nBalled out in bingo halls, reported skiied out in jury duty\nJudge Judy, big groupie bitch blew me, Beigen rush Cuffies\nBlast the last uzi, ship me to Africa, right? I shit rubies\nDue to the night and on my behalf\nI threw the shotti in the glass so I could have a double blast\nDuffle pass, teams and couples quick with the knuckle clash, fast\nRain, hail, snow, sleet, still bust that ass, uppercut, bad\nYou in the grass slumped up and ya faggot-ass man hauled ass\nSlammed body in the G-Y-M, G-Y-N'\nLove Doctor in the hood, fucked bitches on their friends\nSo, yo...\n\n[Hook: Ghostface Killah]\nParty people, you're the reason we're here\nCuz we love the game and our music is projects\nSo, so, yo, hello! Makin' sure y'all still there\nOn stage here tonight be the almighty Theodore Click\n\n[Verse 2: Trife]\nYeah! Yeah... yo!\nI'm a little dude but I hold guns the size of Europe\nY'all niggas is sweet like pancakes with extra syrup\nWhatever y'all put up, I double that\nStapleton is where I hustle at, 2-12 is where I bubble at\nYeah, I'm talkin' money-wise, you funny guys\nI'm quick to yolk you up like eggs that's cooked sunny-side\nCatch me at the honey hive, runnin' the strip\nGun on the hip, posted for hours, slingin' dope and powder\nCulture Power, throwin' nitros, lettin' the pipes blow\nGot remote control cars and they're not made by Tyco\nThis the Theodore, drunk off Smirnoff\nBit ya ear off, therefore, the drama is what I'm here for\nFrom the block to the stage\nI represent for those locked in the cage\n'Til I'm dropped in the grave\nEvery line I spit is like a shot from the gauge\nMove accordingly, even when I'm actin' disorderly\n\n[Hook]\n\n[Verse 3: Twiz]\nWho you wit?\nSee? See? Yo!\nI'm a Don, dead form, look upon Ezekials\nTo the generals in my click, there'll be no sequels\nThem hot ones'll crease you, the vultures'll feast you\nThe loved ones will shiest you, gorillas will beast you\nJust served fiends walkin' up the block yawnin'\nLate night game, damn, forgot I got a warrant\nGot in, laid down, then start snorin'\nP-O kickin' ya door in, 4 in the mornin'\nYou blockin' my lane-lane like John Stockton\nWith the uttermost disrespect just like Bernard Hopkins\nSimply, it's PC within the verse\nSee we could be peoples later, in business, Money Comes First\n\n[Hook]", "image": "https://images.genius.com/f4093661813b3ac25f7c044e4b1e305d.899x899x1.jpg"}], "artist": "Ghostface Killah"}