{"songs": [{"title": "Confessions of a Dangerous Mind", "album": "Confessions of a Dangerous Mind", "year": "2019-03-22", "lyrics": "[Intro]\nYeah\n\n[Verse 1]\nI can't get no better, can’t get no more cheddar\nI feel like a king and my queen is Coretta\nI been made a livin', I'm never gon’ give in\nI'm just way too driven, that's why I been thinkin'\nI'm scared that I'm sinkin', I'm scared that I’m fallin’\nThe world think I'm ballin’ and maybe I am\nBut don't give a damn, back in the beginnin'\nDid not have a plan, don't know who I am\nOr who I’m becomin' but I'ma do me to the fullest, alright\nBustin' and dodgin' them bullets all night\nTake over the world, yeah I'm thinkin' I might\nGot 'em all in my sight\nI know that I'm strong, I know that I am\nI know I'm the man\nAnd whether you poor or you filled with financial security\nEveryone deal with they own insecurity\nEven the preacher was born with impurity\nScared to go out even with my security\nScared of the world and all of its obscurity\nPray for maturity, hope that I grow\nHope my anxiety stay on the low\nI swear I hope that shit don't fuck up my flow\nWhere do I go? What would you do\nIf suddenly all of your dreams came true?\nWhat would you do if you did it all?\nIf you ain't never have to lift a finger\nWould you linger like, \"Fuck 'em all\"?\nGuess that's your call, but I can't\nThis a marathon, not a sprint\nSwitch up the plan like homie that went from Verizon to Sprint\nCan you hear me now? Does anybody out there feel me now?\n\n[Chorus]\nWhat's your name? What's your game?\nCome now, boy, just spit your flow\nFeel the pain with the gain, what you tryna say though?\nNovocaine to the brain, I can't feel nothing no mo'\nIn my lane, can't refrain from lettin' these people know\nWhat's your name? What's your game?\nCome now, boy, just spit your flow\nFeel the pain with the gain, what you tryna say though?\nNovocaine to the brain, I can't feel nothing no mo'\nIn my lane, can't refrain from lettin' these people know\n\n[Interlude]\nHow I feel (How I feel), yeah that's how I feel (That's how I feel)\nBreak it down, roll it up, that's how high I feel (That's how high I feel)\nHow I feel (How I feel), how high I feel (How high I feel)\nDown, roll it up, yeah\n\n[Verse 2]\nSearchin' for bliss only led me to searchin' for hits\nOnly led me to battle depression\nI done learned my lesson 'cause fame never lessen the pain\nWhat if your life was under a glass?\nAnd people tried to dig up shit from your past\nAnd tell you what's good and what's not\nAnd every time you drop a song, they say that it's wack or it's hot\nAnd don't give a damn that it came from the heart\nThey tear it apart like hyenas, this here for the dreamers\nThis here for the people that know what I'm sayin'\nAll of the people that know what I'm sayin'\nFuck social media\nTellin' me who I should be and just how I should rap\nThey always compare, they always compare me to others\nAnd try to hit me up against all my brothers\nNow, why you think so many rappers be overdosin' at the crib?\n(Overdosin' at the crib)\n'Cause people just won't let 'em live\nAnd the public is constantly thinkin' they know 'em\nBut nobody knowin' what's goin' on inside\nAnd they wonder why we all hide, shit\nMaybe I'm just overthinkin'\nOr maybe I'm just over-smokin' and drinkin'\nAnd when I can't deal with the hate, I self-medicate\nSit in the corner and think of a better day\nMaybe this bullet can help me to get away\nI just cannot seem to think of a better way\nEven though I know there is, that's why I keep goin'\nThat's why I keep flowin', that's why I keep perserverin'\nEven when I'm hearin' I'm a bitch, I'm a fag\nI'm a motherfuckin' hypebeast, I ain't black in the slight least\nI ain't good enough, I should quit, I should kill myself (Kill myself)\n'Cause \"you'll never be Kenny\"\n\"You'll never be better than Drizzy or Cole\"\n\"You're losing your hair, you're too fucking old,\" yeah\nThese are the comments I'm readin' on Twitter right now\nThat make me depressed and they pullin' me down\nI'm tryin' to swim but I think I'ma drown\nSo I'ma turn that feelin' into a sound\nAnd play it when nobody else is around\nWhenever I feel like I'm far from the ground\nGod, give me the power to battle depression\nYeah, round after round\nI wish I was famous, I wish I was rich\nI wish I could just get up out of this bitch\nBut be careful what you wish for\n'Cause it ain't everything that it's cut out to be\nMy life is good but not as good as it's 'bout to be\n'Cause I got vision, don't fuck with division\nAin't God, but I'm rich and I think that I am\nDo what you love and do not give a damn\nFuck all the haters you see on the 'Gram\nJust mind your own business and be a good man\nBe a good boss and be a good friend\nSpread your imagination to the millions\nDon't worry 'bout how to maintain all your millions\nJust spread that positivity for the children\nAnd all the haters that's hatin', just love 'em\n'Cause that's the only way you ever gon' kill 'em\nKnow somebody feel 'em\nLast but not least, put your ego on the shelf\nAnd remember, love yourself\nNah, nah, nah\nPut your ego on the shelf and love yourself\nNah, nah, nah\nPut your ego on the shelf\nAnd remember, love your—'member, love yourself\n\n[Outro]\nNah, nah, nah\nPut your ego on the shelf and love yourself\nNah, nah, nah", "image": "https://images.genius.com/888ae8682f1bd7281c45f0618c3d30c4.1000x1000x1.jpg"}], "artist": "Logic"}