{"songs": [{"title": "Last Kings", "album": null, "year": null, "lyrics": "[Intro: 2Pac]\nDeath Row, that's where motherfuckers is endin' up\n\n[Verse 1: 2Pac]\nDear mama, I'm caught up in this sickness\nI robbed my adversaries, but slipped and left a witness\nWonder if they'll catch me, or will this nigga snitch\nShould I shoot his bitch, or make the nigga rich?\nDon't wanna commit murder, but damn they got me trapped\nHawkin while I'm walkin, and talkin behind my back\nI'm kind of schizophrenic, I'm in this shit to win it\nCause life's a Wheel of, Fortune here's my chance to spin it\nGot no time for cops, who trip and try to catch me\nToo fuckin trigger happy, to let them suckers snatch me\nNiggas gettin jealous (jealous) tryin to find my stash\nWhip out the nine, now imma dime off yo' ass\nPeter picked a pepper, but I can pick a punk\nSnatched him like a bitch, and threw him in the trunk\nThe punk thought I was bluffin, but swear I'm nothin nice\nBefore I take your life, first wrestle with these, mics\nI listen to him scream, Tray Deee went insane\nI guess the little, mites had finally found his brain\nNew Rovers pull me over, I'm sentenced to the pen\nRemember that little, bird, he snitched and told a, friend\nIt's trouble on my mind, I'm with the old timers\nAnd fuck five-oh, blaow blaow. turn em into forty-niners\n\n[Chrous]\nBye bye, I was never meant to live\nCan't be positive, when the ghetto's where you live\nBye bye, I was never meant to be\nLivin like a thief, runnin through the streets\nBye bye, and I got no place to go...\nWhere they find me? 16 on Death Row\n\n[Verse 2: 2Pac]\nDear mama, these cops don't understand me\nI turned to a life of crime, cause I came from a broken family\nMy uncle used to touch me, I never told you that\nScared what you might do, I couldn't hold you back\nI kept it deep inside, I done let it fuel my anger\nI'm down for all my homies, no mercy for a stranger\nThe brother in my cell, is 16 as well\nIt's hard to adapt, when you're black and you're trapped in a livin Hell\nI shouldn'ta let him catch me\nInstead of livin sad in jail I coulda died free and happy\nAnd my cellmate's raped on the norm\nAnd passed around the dorm, you can hear his asshole gettin torn\nThey made me an animal\nCan't sleep, instead of countin sheep, niggas countin cannibals\nAnd that's how it is in the pen\nTurn old and cold, and your soul is your best friend\nMy mama prayed for me\nTell the Lord to make way for me, prepare any day for me (why?)\nCause when they come for me they find a struggler\nTo the death I take the breath from your jugular\nThe trick is to never lose hope\nI found my buddy hangin dead from a rope, 16 on Death Row\n\n[Verse 3: Eminem]\nThey think they're crazy, but they ain't crazy, let's face it\nShit, basically they're just playing sick\nThey ain't shit, they ain't saying shit, spray 'em 50\nA to the K, get in the way I'll bring Dre and them with me\nAnd turn this day into fucking mayhem, you staying with me?\nDon't let me lose you, I'm not trying to confuse you\nWhen I let loose with this Uzi and just shoot through your Isuzu\nYou get the message? Am I getting through to you?\nYou know what's coming, you motherfuckers don't even know, do you?\nTake some Big and some Pac and you mix em up in a pot\nSprinkle a little Big L on top, what the fuck do you got?\nYou got the realest and illest killers tied up in a knot\nThe juggernauts of this rap shit, like it or not\nIt's like a fight to the top just to see who'd die for the spot\nYou put ya life in this, nothing like surviving a shot\nY'all know what time it is, soon as 50 signs on this doc\nShit what you know about death threats, cause I get a lot\nShady Records was eighty seconds away from the towers\nSome cowards fucked with the wrong building, they meant to hit ours\nBetter evacuate all children, it's nuclear showers\nThere's nothing spookier\nYou now about to witness the power of (Death Row)", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}