{"songs": [{"title": "I Want That", "album": "Still Blowin’", "year": null, "lyrics": "[Intro]\nIt's nothin baby\nYou can have that shit\nIf that's what you want\nAll you gotta do is put your hustle down girl\nChoose on some real pimpin you know?\nYou can have that shit if you want it baby\nIt's nothin\n\nIf you want it, then it's yours\nStraight to the top with pimpin $hort\nCause I'm so cold when I'm on these whores\nIf I kick her in the ass then it's gon' be sore\nBut if she listens, we get paid\nI get the money, and she gets laid\nPunk bitches talkin 'bout ain't no way\nBut we look good bitch, every day\nAnd you keep talkin 'bout life is hard\nNever had money or a fly ass car\nOn the low, she's a three-oh-fo'\nWaitin on tables but she should be a hoe\nCause every night she fucks big ballers for free\nIf she tryin to come up, she should be callin me\nMake some money, dip to the mall with me\nAnd buy some new shit so they all can see\n\n[Chorus]\nYou can have that, if you want that\nIf you want that, you can have that\nYou can have that, if you want that\nIf you want that, you can have that\nDo you want it baby? Do you want it baby?\n(I want that, I want that)\nYou gotta make, that, cash, that's it\nAnything you want you can have that shit - bitch!\n\nIt's no fun when you're broke and lonely\nYou cain't even smoke no weed\nYou cain't go out to eat\nYou havin dinner at the house - without me\nI cain't kick it like that\nWhere the steak and the chicken at?\nAin't nuttin worse than a broke-ass bitch\nYou ain't nuttin but a joke, that's it\nIf you wanna be bigger, and have more\nYou've gotta choose on a nigga like $hort\nYou gotta get out that car, and jump in mine\nHe said \"I don't do no pimpin\" that punk is lyin!\nI'ma send you to the front of the line\nIf you gimme somethin cool and you wanna be mine\nSquare bitches write checks and charge it\nBut I only take cash and all you get is hard dick\n\n[Chorus]\n[Outro]\nGet your money\nYou in the mix with Too $hort\nWe're still blowin\nStill smokin that good shit", "image": "https://images.genius.com/cbce7a2bf9547c73552eb8d05ea5f8b2.700x700x1.jpg"}], "artist": "Too $hort"}