{"songs": [{"title": "CHeck 2-1-2", "album": "Gangsta & Soul", "year": "2009-05-14", "lyrics": "[Intro]\nAlright, c'mon, yeah, yo\nYo, Dave, drop that shit, my nigga\n\n[Hook]\nCheck 2-1-2\nWho rock the motherfuckin' microphone better than Q?\nYeah, uh, check 2-1-2\nWho rock the motherfuckin' microphone better than Q?\nYeah, uh, check 2-1-2\nWho rock the motherfuckin' microphone?\n\n[Verse 1]\nUh, back to the boogie, boogie to the bang\nBang to the rhythm, rhythm to the slang\nSlang to the booth, booth to the truth\nSpittin' all these words for the wise and the youth\nYouth to the majors, them to the lasers\nBeams to the cream, crack rock to the fiends\nFiends to the jails, jails to the tails\nAll of your dreams that you thought it had failed\nCalled you by surprise, now the Devil in your eyes\nDevil in your pie, see a coochee, hit the broad\nStupid that you feelin' to live in the crack dealin'\nLook at the ceilin', stuck in prison, the walls peelin'\nHatin' every day in your life, knew wrong from right\nDon't despite, now you payin' the price\nA nigga at your home layin' the pipe, your wife livin' a life\nSon fell in school, punked in a fight\nI keep it real with you, say, I give you a real scripture\nMoney over bitches cause bitches, they will hit you\nMovin' at a good pace, never lose a race\nProvidin' for your family, keepin' food on the plate\nYour money flows, doin' good, stay on your toes\nSell out your rolls, fuck it, let the music control\nAnd take over, it ain't cool to be a street soldier\nJust somethin' to think about, shit, now I'm out\n\n[Hook]\nUh, yeah, check 2-1-2\nWho rock the motherfuckin' microphone better than Q?\nYeah, uh, check 2-1-2\nWho rock the motherfuckin' microphone better than Q?\nYeah, uh, check 2-1-2\nWho rock the motherfuckin' microphone better than Q?\nYeah, uh, check 2-1-2\nWho rock the motherfuckin' microphone?\n\n[Verse 2]\nUh, ayo, word on the street, G.E.D. ain't got spitters\nLike I ain't one of L.A.'s known crack dealers\nKnown cap-peeler, might be the pipe shit\nThe beat beat a price, yo, I guess I'll be the light\nBorn to the flame, dived into 'cane\nDistributed cats to heat, distributed cats defeat\nThe corner like peripheral, sneakin' like I tippy-toe\nEverythin' I write up in my verses, yeah, they fit me though\n'80s with the '90s flow\nMixin' with the gangsta and the soul, I got it under control\nHip-hop is mine, I'm throwin' you niggas signs\nI'm makin' you step your game up\nLyrically, see, I came up from nothin'\nMy back turned from frontin', all about my fetti\nStayin' sharper than machete, eatin' rappers like spaghetti\nWho can fuck with me? That young Nip, 50\nThat Bill Crispy, the Benjamin\nThese niggas softer than a cinnamon roll\nAs I compose, my body arose up from the dead\nEvery since Nas dropped that one album\nPut his flow over my corpse, I came up with a torch\nHit the studio and comin' with force, yep, kaboom\nGuess who stepped in the room?\nNigga been a nut since I shot in the womb\nI blow like balloon, thank you guys for some of your time\nTop five, nigga, dead or alive, Q", "image": "https://images.genius.com/73430f875ce330bebb52280d5c91ac36.500x500x1.jpg"}], "artist": "ScHoolboy Q"}