{"songs": [{"title": "Nickerson Gardens Freestyle", "album": null, "year": "2005-01-01", "lyrics": "[Verse 1: Kendrick Lamar]\nI don't need the hype\nThey call me- fuck it- I don't need no introduction\nNo ad-libing my name 100 times for nothing\nYou already know it's K. Dot, city of Compton\nAnalogy is like Biggie and Bed Stuy, Oakland and 2Pac\nI'm more focused, I'm nothing like you new guys\nStruggling over a few lines thinking you hot\nCause your homey said you you was a few times\nWhich is too many times\nThey lying to you, they telling a lie\nThe only time I lie in the booth is when I sleep in it\nRecord 24 hrs, you niggas better get your bars up\nI bench press this rap stuff, got it locked like handcuffs\nI threw away the key, my cool is on, she love my A/C\nMy juice is on, and I wish one of y'all try to rob me\nI shoot, and have you laying between the sheets with the eyes leased (Isleys)\nI push the coupe like a high speed\nThe helicopters come and realize that nothing's behind me is behind me\nYour honor, I fuck over this beat with no condom\nThis ain't rap it's really a porno, re-wind me back\nFinally the finest of 'em all is back\nTo define the laws of crack, y'all don't obey\nY'all ain't nice, y'all just OK\nYou're nothing more than a little John phrase\nI'm Mike Jordan in his prime, modern day Issac Hayes\nTheme song to Shaft, equivalent to the theme song to your career\nStudy my craft, you ignorant, I do it without a pen and pad\nJust inspiration: something you never had\nIf my pockets is something you trying to grab\nI pull out the rocket and peel you back like scab\nYou old news, you old dudes get out of my way\nLet the young boy come through; don't mention my age\nI'm on a mission for pay, and you astronaut niggas just crowding my space\nYou not in my atmosphere, you can act like you here\nBut actually you ain't accurate fucking with the music biz\nThe industry like, \"Fuck it, let the music be his\"\nNo theme park, I'm not trying to amuse you kids\nSmall shark, jaws is here, jump in the water\nDo he really fuck with President Carter?\nMy reply is that I can't stay away from the bosses\nGot the bidding war popping like an auction\n5 or 10 labels like what he hitting for? 7 zeros or more?\nRemember having Aftermath sitting on my door\nMoney in front of me, couldn't open the door\n\n\n[Verse 2: Unknown rapper]\nBoom! That's that, left him on his back flat\nYou talking like that, jack, spitting\nAbout crack, but never been about that\nI'm real with this rap, I'm just speaking the facts\nRap, but some niggas wack, talent something they lack\nSo gather your whole pack, I'm taking them off the map\nMy pockets is getting fat, their pockets, they staying flat\nSo imma just hollaback, they rocking their tiny J's\nBut niggas ain't getting paid in the spot, like they a slave\n12 hours just for some change, man this shit a shame\nWhen the feds come, who you gon' blame? But that's just\nLearning the game, you niggas should do the same\nThey go as fast as they came, cause passing me you ain't gon' see\nI go bar for bar, and b, you are just a target, b\nSo just call me Muhammed Ali\nEasy shit be hard to do, easy for me and hard for you\nI'm leaving you with the (?), pick up a broad, 'bout three or two\nLife is like a puzzle but my level is some trouble, man, you gotta use your muscle, in the hood I had to tussle\nMan, I'm moving to the shop, (?), man you're not\nNiggas steady talking but barely looking in the spot\n\n[Verse 3: Kendrick Lamar]\nI'm so far ahead of my time, I got people 5 years from now pressing rewind\nI'm hardly a friend with y'all, i hate rappers, where is your artist at?\nIf it ain't a good picture you're draw, don't bring it to the architect\nOften you arguing 'bout who got next, claiming you're running the game\nNiggas are barely walking yet, hopping all over beats without studying training camp\nTry studying a few greats then maybe you'll be where i'm at\nYour songwriting ain't great, your mixtapes mediocre\nYou recycle the same quotes, you're not switching the flow\nYour flow in the same place, just don't rap; elaborate\nTry to expand, try to be more creative perhaps\nMy rap friends, i ain't saying you're wack, psyche\nLike an in-voice, I'm just stating the facts, right?\n(?) metaphores i write, in fact, it's been a factor\nYou've feared your whole life, no TV show\nDon't compare me with them, that's like a shark versus Nemo,  a gorilla to a chimp, Jordan versus Kukoč\nA Tony Montana with blow on his nose to a Nino", "image": "https://images.genius.com/25d8a9c93ab97e9e6d5d1d9d36e64a53.1000x1000x1.jpg"}], "artist": "Kendrick Lamar"}