{"songs": [{"title": "Misses", "album": "Layers", "year": "2016-04-15", "lyrics": "[Intro: Woman & Royce Da 5'9\"]\nI know you see me calling him\nYo what's up, you reached 3-1-3-7-8-9-0-5-0-9\nBe nice bitch, be nice\nI ain't around, leave a message\nHey baby I know you're busy, I just want to see how you were and see what you're doing, I know you're in the studio. I'm about to go out with my girls, but if you need me to do anything, call me. Okay? I love you, muah, muah, muah\n\n[Verse 1: Royce Da 5'9\"]\nMe and my baby started out like two peas in a pod\nMe and my baby, nothing can come between she and I\nThat's my lil misses, little fly, little chick, thick little thighs\nEverything I'm into, she alright with it\nAnd she on tip, she on mine\nI'mma slide right in, get in her mind cause she's a keeper\nAny time she's with me, nah, she ain't gotta lift a finger\nShe ain't gotta spend a dime, she around me all the time\nCause she's so cool, even my friends don't mind\nThat's my lil misses, always so calm, always so kind\n\n[Hook 1: K-Young]\nLil misses on my mind, misses on my mind\nI look forward to her call, I enjoy when you talking\nLil misses on my mind\n\n[Verse 2: Royce Da 5'9\"]\nShe never waste my time when she on my line\nShe stay on my mind\nOh my God when she blow me\nShe blow me good, it blow my mind\nI'm on tour right now, now she texting me saying\nI was out doing ecstasy, molly and coke with four of my girls\nAnd I think I gotta throw up and go and lie down\nI look at my phone like wow\nI think about all the Patron I downed\nMaybe that's your business, no judgement here\nBaby that's your lifestyle\nShe said, \"I'm so glad you not mad\"\nI said \"No my doll, but I gotta get to stage right now\nBut please be careful hanging with the all night crowd.\"\n\n[Hook 2: K-Young]\nMy lil misses on my mind, misses on my mind\nHanging out, poppin' pills, now she sniffin', now she's real\nCaught me trippin' on my line\n\n[Interlude: Woman & Royce Da 5'9\"]\nYou reached 3-1-3-7-8-9-0-5-0-9\nUgh\nI ain't around, leave a message\nBaby, call me, I'm high haha\n\n[Verse 3: Royce Da 5'9\"]\nI came back from tour, she done got skinny with acne\nShe got her hair dyed blond and it's up in a bun\nHer ass is flat and it's gone\nI asked what the fuck was happening\nShe reached up and tried to slap me\n(No, ahhh!)\nI slipped and she missed it\nAnd then ran in the bathroom and slammed the door\nI was like, hell you alright?\nAll I heard through the screaming\nWas something about me following chicks on Snapchat\nAnd her having pics of me and her in the sack last\nAnd she 'bout to go sell it to a site\nShe even told me she already sent an email to my wife\nDamn, my lil misses blackmailing me and shit\nI guess she fell for the hype\n\n[Hook 3: K-Young]\nMy lil misses on my mind, misses on my mind\nYou completely switched into another bitch\nSo now I got a psycho mistress on my line\n\n[Verse 4: Royce Da 5'9\"]\nFor some reason i believed the bitch\nBest thing I could do is\nTell my wife before my wifey see the shit\nMaybe I can loosen her up\nBy taking her on a vacation or skiing trip\nMaybe I can lean in for a kiss and plead the fifth\nDamn, shit was all good just a week ago\nUntil we hit a fever  pitch\nNow I gotta go on my phone and delete the bitch\nThen I get a text saying \"I'm pregnant and I'm keeping it\nI'mma get my child support\nAnd I plan on paying my lease with it\nYou ain't never gotta worry about hearing from me again\"\n\n[Interlude 2: Woman & Royce Da 5'9\"]\nAye what up this is Royce I'm away from my phone for at least two weeks, I'm on a family trip with my wife and kids. Please leave a message\nYou didn't tell me about no family trip. Fuck that bitch, fuck your family, Ryan I need you to call me\n\n[Outro]\nIt was all good, just a week ago, yeah\nI understood and I played my role\nIt was all good, just a week ago, yeah\nI understood and now I am alone, yeah\nAh-ah-ah-ah-ah\nCall me\nWhat would Lincoln's bitch ass do at a time like this?\nShit, I'mma answer my damn phone", "image": "https://images.genius.com/533ac062d389201c4e7eb9a973709ea4.1000x1000x1.jpg"}], "artist": "Royce da 5'9'’"}