{"songs": [{"title": "What’s Going On?", "album": "Don’t Sweat the Technique", "year": "1992-06-23", "lyrics": "[Hook]\nWhat's going on?\n\n[Verse 1]\nWhat's happening, it's been so long, what's going on\nAnd what's going wrong? The good old days are gone\nYou forgot your plot and your plans as a young man\nYou invented a scam even you don't understand\nYou rig the enigma, can't figure it out\nYou change the route, now you're in doubt\nYou use to cut class, smoked grass, still passed\nFigured you was all that but that ain't last\nThe times is harder, the drugs is heavier\nYou say whatever, the more, the merrier\nSmoke chokes your dreams and blurs your scenes\nNow a young man fiend change his plan to schemes\nNo more good times, no more time\nToo far to find, you're almost blind\nYou can't see what spot that the trap is in\n(Hey bruh!) What's happening!\nYou had it mapped out, your plans get torn\nYou stayed up for days and now your dreams are gone\nYou said you quit, stated your word is bond\n(Hey bro) what's going on?\n\n[Hook]\n\n[Verse 2]\nMy neighborhood don't look so good\nI'll find a way out, yeah, I would if I could\nBut the government is doing a project\nSo I live in the projects\nWhere we fight for elbow room to the doom\nTry to live long but you die too soon\nI might not be alive to see 25\nTaught at ten to make money and strive\nI sold tapes at school and made some ends\nMet alot of skins and even made some friends\nCool, cause now I got a crew to run with\nBreak a couple of rules, have crazy fun with\nBut every now and then, they give my knuckle game a test\nBut I won't fess, I just get rid of the stress\nAnd then shake hands like a man\nCause it's a family thing, only the crew would understand\nBut you had a one on one fight with drugs\nWhen we ain't cool no more, we bust slugs\nClip after clip, until one of us is gone\n(Hey bruh) what's going on?\n\n[Hook]\n\n[Verse 3]\nThe crime rate in New York State elevate\nA city filled with hate, more deaths accumulate\nDrug wars daily, alot of blood spilt\nKids on the playground shot down and killed\nNobody wants to live on the first floor no more\nCause stray bullets explore\nWe're killing ourselves off slowly but surely\nAnd at the end of the year, I'm sure many more'll be\nRubbed out in a quest for clout\nThe rest'll be drugged out, this is bugged out\nHalf of the projects is dead or locked up\nKids getting kidnapped and then found chopped up\nHuman abortion create distortions\nAnd that's just a portion, you know that we're lost when\nBabies are addicted to drugs when they are born", "image": "https://images.genius.com/c242f8367734db09ac26eb1c1bbcee98.900x900x1.jpg"}], "artist": "Eric B. & Rakim"}