{"songs": [{"title": "Theme Music to a Drive By", "album": "Lupe Fiasco’s Food & Liquor (Advance/Pre-Release Leak)", "year": "2011-09-13", "lyrics": "[Sample from \"(Do it) No One Does it Better\" by The Spinners]\nNo one does it better\n(I said) Do it, do it, no one does it better\n\n[Intro]\nWhat down Charlie?\nHow you doing? Good, hey what up Joe?\nI'm just chilling, know what I'm saying chilling, ain't nothing, yo\nI said nah man, there's people out there better than me\nI just do what I do, you know what I'm saying? Yeah aight\n\n[Verse 1]\nUh, I can't feel a field nigga pain\nDevious skill that make a strong willed nigga wane\nSince a lil nigga hang with the killers and distributers of 'caine\nThey dismemberers of swishers then refill it with the Jane\nThen they tilt it and they lit it with a flame\nThen they took a pull of killer to the brain like (inhale noise) ah\nEvil minded like Krang they became\nThey deranged like the Rover that I rode\nThat was the Range that I drove when I was a little bit older, mayne\nDeclaring war on the deck like they The Joker\nAll while, ducking from Bruce Wayne\nWhile they polka with the devil in our moonlitten ghetto\nHello My Name stickers on the stickers of the veins\nIn rehab remembering the feelings when they used to get mellow\nWhen they was all back of a nickel like Monticello\nWhen the underworld had to be smarter than Donatello\nNo honor amongst fellows\nIt's harder than sitting with a blind man and\nTrying to describe yellow\nGot me feeling like killer Joe\nMy life the album, know the classics by heart\nAnd exactly how the filler go\nRepeat it on my way to the liquor store, Charlie\n\n[Interlude]\nWhat's up, what's down what down\nYou know, how are you (..) what you in for? (..) stupid niggas\nYou know I'm sayin, it's why I do what I do\nI be aight, we all be aight\nWe just gotta learn how to stay in our lane\nAnd do what we know how to do, you know\n\n[Verse 2]\n'Cause, I can't feel the field nigga chains\nThough I covet mine, so I covered mine in blame\nThen I bumped into a bum and covered mine in shame\nThen I bumped into a hun and uncovered minor game\nDiamonds then under minded mayne\nThey give a nigga with no mack another kinda game\nSee money talks in another kinda slang\nDetectives can't decipher as they listen through the wire\nAs I accept the call and listen to the lifer\nGetting religion, making wudhu in the sink of your cell\nReciting Al-Fatiha in the kitchen\nIndeed on his deen and in addition to doing dishes\nListen as I get schooled to the rules to rule\nThe fuel of fools, the obstacles, the cool\nHad to slow it down homie\nChopped and screwed, he said blow it down for me\nSticks and stones make the homes\nOnly God's words can stop the wolves\nAnd don't fraternize with pigs those kids'll think your stool\nNot at the bar but trying to put him behind the bar like a bartender\nHe laid the law like the bar so I put it in a bar for dude\nHe said, borrow my jewels and bar the fools\n'Cause they'll play ya like the space bar in Tools\nTheme music to a drive-by, put it in your car and cruise, uh, uh", "image": "https://images.genius.com/373c57c9cfddd95f1d232784084809ba.500x500x1.jpg"}], "artist": "Lupe Fiasco"}