{"songs": [{"title": "End of the Road (Y.A. mix)", "album": "Cali Untouchable Radio Pt. 5", "year": null, "lyrics": "[Intro: Kurupt]\nDeath Pentagon like nigga, Gotti Sinatra\nWar zone, it's happenin', it's over\nYeah nigga, it's happenin'\nI've been on that internet watchin' these niggas right?\nY'all got so much to say right?  It's happenin'\nNigga we 'bout to smash on you busta ass niggas\nOh, y'all want somethin' from Kustapo nigga?\nOh we gon' show y'all niggas\nY.A. - Youth Authority\nFirst-round up, first-round draft picks nigga\nWhole squad massive, movin' on these busta ass niggas\nWhat's up Tone?\n\n[Tone]\nWe lookin' for a city bitch, one that I can get it wit\nMove in and move out wit, I'm lookin' for a bout it bitch\nOne to cook the powder quick, that's my kinda bitch\nLet's address the topic, come on let's get it poppin'\nI've been hot since niggas was pop lockin'\nBreak dancin' and beat boxin', been had the block poppin'\nNigga I'm a young prophet, young and had to weigh his options\nThis is big business, this is big Benz's\nAnd my game's official, I ain't playin' wit you\nThis is war time and you ain't got no more time\nAnd I got my niggas on the way, bringin' more .9s\n\n[Roscoe]\nYeah, fury and phrases, from furious phases\nMurder and anguish, we mercilous gangstas nigga\nBurners and bangers, we turn 'em and tangle 'em\nWe drinkin' on syrup nigga, we aimin' for sturnems as curtains\nTuck your shirt in partner, let your pistol show\nDie like a man motherfucker, what you bitchin' for?\nCalifornia days is drinkin', blazin' in the sunshine\nGot a case, now I got a runaway devised\nSpeed chases, I'm blazin' the one-time\nMy barretta on my waist and I never hesitate\nPull it out when it's gun time\nMy O.G.'s corrupted my young mind\n21 on the run with a gun\nYoung, dumb, full of cum, tryin' to get my funds\nAnd I'ma ride to the fullest, duck and dodgin' the bullets\nFo'-fizzle on my side, niggas die when I pull it\nIf I should get wasted, no sad faces\nBury me basic, no jewelry, no Jacob\nEyes blurry and blazed up\nAnd don't be worryin' for me unless I wake up\nAnd don't be pourin' no 40 for me, just drink up\nWe not a bunch of sad, punk ass, sit around and mope ass\nNo class cowards, with limo tinted windows on Eddie Bauer's\nSoft as flowers, all off to chowder\nWe the killa click, nine millis filled with clips\nNo time to chill with flips, my mind on the scrilla flip\nIt's Youth Authority nigga, we shoot for arteries nigga\nWith loaded Rugers, Lugers, and Cougars in the car with me nigga\nIt's Y.A", "image": "https://images.genius.com/32af60ccf1bdf2e6bffcc1bc05f45a29.299x300x1.jpg"}], "artist": "Kurupt"}