{"songs": [{"title": "Fuck What They Say", "album": "What’s the Worst That Could Happen? (Soundtrack)", "year": "2001-05-29", "lyrics": "Yo\nNo matter how much money you make\nBrothers gon talk about you\nYeah, no matter who you are, uhh\nTalk about you..\n\nNiggas gon talk about you (talk about you 2x)\nDon't give a fuck about you (fuck about you 2x)\nYou livin' bout it bout it (bout it bout it 2x)\nJust make em read about it (read about it 2x)\nFuck what they say about me (fuck what they say about me)\nBitches gon love to doubt me (fuck em, yeah)\nI'm livin bout it bout it (bout it)\n\nNigga this, nigga that, we do this, we do that\nTalkin' that shit'll get yo' wig blew back\nYou knew that, we do that, like it's 'sposed to be done\nBack up off me, you gettin too close to me son\nIt'd be fun if you didn't have a gun\nBut if you didn't had one you'd probably run; come come\nNow spit it from the tip of your tongue, a lil wisdom\nGives em somethin' to move to, groove to\nThe next time you see me again gangsta'd up\nChilling wit my beanie again got many of friends\nIn b-ball, football, baseball, the penetentianary, the graveyard\nThe church house and the mess hall\nThat's why I address y'all, express all Big Dogg\nWith no flaws, yiggy yes yall touch y'all from up above\nShow big love, kept the crippin' alive\nAs well as the dub, push come to shove\nY'all know how it all was\n\n(Chorus)\nBut niggas still talk about me (talk about me)\nDon't give a fuck about me\nI made them read about me (read about me)\nDon't give a fuck about it\nI'm livin' rowdy rowdy\nFuck what they say about me\nLong as I'm bout it bout it\nNiggas gon talk about you\nBitches gon love to doubt you\nI make em read about it\nAnd made em write about it\nFuck what they say about me\nI'm livin' bout it bout it\nBig D-O-Double G ya know I'm livin' rowdy rowdy\n\n(Snoop Dogg)\nLemme clear my motherfuckin throat\nThese niggas in the game is sticky as dope (oh no)\nNo joke, even ya own kinfolk\nThey say \"Diff'rent Strokes, it takes\nDiff'rent Strokes...\" Man, fuck that bullshit\nDogg, who you cool with?\nI'm down with Jay-Z, Master P, Nas, Ice Cube\nDub C, Mack-10, DMX, Mobb Deep\nRuff Ryders, Eastsidaz, Warren G, Red and Meth\nUncle L, Naughty and Treach\nThe whole Flava Unit, So So Def\nDJ Pooh, KAM, Solo, and the motherfuckin LA Zoo\nPomona, DJ Quik and Blacktone\nBut them niggas cross the street know it's really on\nNow I can go on and on but I refuse to cause I might lose you\nLet's cruise to the soulful sounds\nI'm tryin to make y'all get down\nAnd put some soul in ya ass Like James Brown (owwww!)\nI feel good now; can you feel that?\nIt's like goin' bare back, I thought I oughta share dat\nCompare dat, an' wear dat 7 days a week\nKeep my name out ya mouth\nAnd my business out the motherfuckin' streets\nYou motherfuckin' geek\nYour freak is a freak, I never crept with the ho\nI shoulda though, but\n\n(Chorus)\n\nYeah\n\nBig Snoop Dogg up in this\nBee-yah\nBee-yah\nYou know da rest\nCan I say it?\n\nBEE-YACH!!!!", "image": "https://images.genius.com/82cbcc295957e3868b2460ac0689de2f.220x220x1.jpg"}], "artist": "Snoop Dogg"}