{"songs": [{"title": "Water", "album": "The Meth Lab", "year": "2015-08-21", "lyrics": "[Verse 1:  Method Man]\nRiding dirty, got a Ruger in your lap\nBlack suit, 7:30, couple shooters from the trap\nThey done killed the homie brother\nWhat you s'posed to do with that?\nWho gon' tell his baby mother that her dude ain’t coming back?\nThat kind of pain is hard to put into a rap\nThe block is hot and can’t nobody move a pack\nWhen you shooting on-site, you aim the Ruger at his naps\nCut his tongue, hog-tie him, things we usually do to rats\nWhat? Who gassed you up and threw a match?\nDon’t want police to line you up and you a match\nFool them clowns into thinking you a snack\nBrought a gun to wash it down and you can drink it through the tap\nThat’s my reaction, now react\nNow try to picture Malcolm X without the strap\nIf Meth Man could navigate the globe without a map\nI could beat the pussy up without a scratch\n\n[Chorus] (x2)\nTime ticking teams quick to get ya\nI’m trying to bury about a trillion\nMeth's Lab bitch catch us on ya\nAnd when we coming, we be flowing likes it’s water\n\n[Verse 2: Chedda Bang]\nI’m so ignorant, spend it before I make it\nPour salt on my food before I taste it\nPour salt in your wounds, right in the basement\nAll of us, statement, one vision, rich dreams\nCouple scars, I heal quicker than Wolverine\nPopulation, pink slips, quarter greens\nHood millionaires hide when the wolves out\nMove with security, hold tight to your jewelry\nUh – that’s my reaction, now react\nOnce your hood pass revoked, you never get it back\nBenzes, Bentleys, nah nigga don’t tempt me\nTrust I got it on me, I’ma squeeze till it’s empty\nLord forgive me, I need that new 550\nWith the cocaine seats, I’m so street\nAnd when the police came, we don’t speak\nFrom my hood to your hood, ain’t nothing sweet\n\n[Chorus] (x2)\nTime ticking teams quick to get ya\nI’m trying to bury about a trillion\nMeth's Lab bitch catch us on ya\nAnd when we coming, we be flowing likes it’s water", "image": "https://images.genius.com/fafd5b6184e352f00d35852ac8b31946.1000x1000x1.jpg"}], "artist": "Method Man"}