{"songs": [{"title": "Let Em Have It", "album": "Until the End of Time", "year": "2001-03-27", "lyrics": "[Intro: 2Pac]\nTe quiero\nTe quiero cojer, te quiero cojer\nI'll let your ass have it, te quiero cojer\nTe quiero cojer, oh real?\nTe quiero cojer\n\n[Verse 1: 2Pac]\nNow you've been actin' like you want it for a long time\nAll up in a nigga face, givin' me them strong vibes\nLook in my eyes and you'll find peace\nA Gemini, so you really blow my mind freak, come on\nI got my clothes off, hard as a nigga in jail\nSkinny niggas throw the dick well\nEverybody get their condoms, brother cause it's time to fuck\nHurry up and put it on nigga, time is up\nWhat's next? - got my mind on some group sex\nWhere you goin', baby? I ain't even through yet\nDo it like a true vet, love it how I threw it to ya\nIn and out make it good to ya, remember me?\nI love fuckin' slow with the lights low\nBlack, Puerto Rican, even White hoes; bellisimo\nQue Linda, dame beso, come to Papi\nFuck until the shit is sloppy, if you really want it\n\n[2Pac + Honey]\n[Honey] Really.. want it\n[Pac] Get your ass up; you know it, if you really want it\nYou really want it, you really want it\nIf, you really want it, if you really want it\nIf, you really want it, if you really want it\n[Honey] Really want it (I really want it)\n[Pac] Really want it\n\n[Pre-Hook: 2Pac]\nAlright all my real niggas and my real bitches\nLet me see you do it like this, c'mon\n\n[Hook: 2Pac & SKG]\nRock, your body body, rock your body body\nRock, your body body, rock your body body\nRock, your body body, rock your body body\nRock, your body body, we came to\nRock, your body body, rock your body body\nRock, your body body, rock your body body\nRock, your body body, rock your body body\nRock, your body body, we came to\n\n[Verse 2: SKG]\nDaddy rock a player body 'til I tell you to stop\nHit the right spot if not leave money and kick rocks\nI'm a thug ho, I need a thug nigga up beside me\nA player that can ride me, a cat that can rob me\nMake a jazzy ho like me bust a sweat\nHit it from the back, grab me by my neck, demand your respect\nI'm not a on my back ho, I ride the dick and hit it 'til it cold\nBustin' fits of nuts, get 'em up\nI'm a Sagittarius freak, my real hoes feel me\nLegs open wide, nigga dick inside\nLike Barry White \"Tonight's the Night\" for you to hit it doggie style\nLay me on my stomach while I'm countin' them hundreds\nFake bitches wanna front like they don't wanna keep it real\nYou know you want a thug nigga just to see how it feel\nHoes wanna rock Gabbana, Dolce and Versace\nLet me rock your body mouth on my [?] call you Papi\n\nRock, your body body, rock your body\nRock, your body body, rock your body\n\n[2Pac]\nYeah, like that? Yeah\n\n[SKG]\nRock, your body body, rock your body\nRock, your body body, rock your body\n\n[2Pac]\nYeah, yeah, yeah, I feel you\nDo it, do it, do it, do it\n\n[SKG]\nYeah, uhh, c'mon, uhh\n\n[Hook: 2Pac & SKG]\nRock, your body body, rock your body body\nRock, your body body, rock your body ..\nRock, your body body, rock your body\nRock, your body (see..)\nYour body body, rock your body body\nRock, your body body, rock..\n\n[Verse 3: 2Pac]\nSee, it all started simple, turned into me lickin' the nipples\nFuckin' you doggie style to this instrumental\nHands up, all up inside ya, hell I can stand ya\nEyes open I don't plan to bust, just hold on\nBaby let me zone in, whaddyou mean?\nCan you scream let it go beotch, how does it feel?\nGot a nigga like steel in ya, to keep goin'\nNow I'm fuckin' like I'm killin' ya, let's go another round\nBaby is you down really, two shots of ecstasy\nLick a nigga down silly, your body next to me\nI could touch you inside, and you'll cry\nSo good when a nigga leave, you'll die\nMy mama told me baby be a man put it on her\nHittin' bitches like, switches comin' around the corner\nI wanna let me get my ride on\nIt's yo' dick baby but it's my song, now if you really want it\n\nRock, your body body, rock your body\nRock, your body body, and if you really want it\n\n[SKG] If you really want it\n[Pac] Yeah, if you really want it\n\n[Outro]\nGots to send this one out to the freaky bitches\nDefinitely all the Scorpios, and the Geminis, and the Virgos\nYou know I know the truth about you Scorpios and you Virgos\nNo doubt gotta give it to the Capricorns\nThey some freaks too on the down down\nThe Libras, they like it even but they still like fuckin'\nNo doubt, Aquariuses, Libras, I said those\nLeos, yeah they some freaks, Leos is freaks\nThey always wanna run shit in bed\nSagittarius, Taurus, Cancer, all you freaky fucks\nI'm a zodiac fucker I'll do you all one at a time\nAnd all down the line, let's get busy", "image": "https://images.genius.com/74b94f4112372859edd6ae711af0df41.1000x1000x1.jpg"}], "artist": "2Pac"}