{"songs": [{"title": "Cusswords", "album": "Life Is... Too $hort", "year": null, "lyrics": "So you motherfuckers thought I was gonna change my style?\n- So what are you saying Todd?\n\nTo all you bitches, hoes, and all that shit\nHere's another rap that I'm ready to spit\nIt goes like this, my name is $hort\nI'm tearing shit up like never before\nPimp slaps, making snaps\nCold cash money and Too $hort raps\nOakland, California that's where I'm from\nThe city where the boys say you don't want none\nBut if you do, I'm gonna tell you this\nTrues and Vogues ain't really shit\nWanna roll so hard, all of the time\nYou and that bitch playing Too $hort rhymes\nIf you ask me what it's all about, I'll say it's about that money\nBut if you ask me could you have some, I'll say it doesn't concern me\nRonald Reagan came up to me and said, \"Do you have the answer\nTo the U.S. economy and a cure for cancer?\"\nI said, \"What are you doing in the White House if you're not selling cocaine?\nAsk your wife, Nancy Reagan, I know she'll spit that game\nLike one night, she came to my house, and gave me a blow job\nShe licked my dick, up and down, like it was corn on the cob\"\nWhat is life? Life is Too $hort\nI play young bitches like it's a sport\nYeah, I play the bitches just like y'all\nLike Dr. J played basketball\nYou can call me Too, don't say it twice\nYou'll get me real mad and I'll fuck your wife\nYou see I'm not proper, I'm rarely polite\nToo $hort, Too $hort, don't say it tonight, biatch\nIt started on a bright morning in 1987\nI was in my drop-top Caddy y'all\nGetting sucked by a bitch named Helen\nNasty bitches, around the world, I wrote this rhyme for you\nYou might not like my rap, but I'm telling you bitch it's true\nSo much death in the Oakland streets\nAm I gonna live till next week?\nWill I get shot by a dope fiend\nTrying to get high, trying to steal my ring?\nI really can't say, 'cause I don't know why\nPeople out here dropping dead like flies\nI used to see a home boy, give him five\nNow I say, \"Man, you still alive?\"\nCold as hell, this town I'm from\nWon't last too long when you're faking the funk\nI'm the master rapper, so unique\nClap my hand when I want my freak\nYou can't deny it, you know I'm right\nI turn any rapper out when I'm on the mic\nAnd I won't kick back, or relax\nTill he knows I'm the best at the MC rap\nTill he knows Too Short, set the trap\nThat got him caught up in my serious cap\nMotherfucker can't spit straight game on the mic\n'Cause he's worse than a fag or a Frisco dyke\nHe's a sucker MC, I call him punk\nTrying to spit that rap, you can scratch that junk\nYou little punk-ass boy, wouldn't listen to me\nThink I'm faking but I'm taking all you sucker MC's\nTo the end of the world and push you over\nGood luck couldn't find you in a four leaf clover\nIf I ever said a rap trying to cap on you\nI wouldn't even sweat it 'cause you'll be through\nLooking so far up, you might fall down\nGetting clowned by the hound from east Oaktown\nAnd the look in your face when you're looking at Too\nCould make a grown man die, laughin' at you\n'Cause you're a no rappin', no rhymin'\nPlayed out fake ass Simple Simon\nI never understood one word you said\nBut you're swearing up and down that you're killing me dead\nThere's only one thing, I wanted to know\nSucker motherfucker, where's the joke?\nI'm the player of players, just call me Pop\nMy name is Too $hort, no I don't stop\nI just don't stop mackin', don't stop cappin'\nDon't stop rappin', now you see what happens\nYour mind is gone, your crew just cut\nSucker MC I'll tell you what\nYour rhymes are weak, your rap the same\nAnd when it comes to game, you are lame\nNever even heard of Too $hort baby\nHit Oakland in 1980\nSinging more raps than a rap could rhyme\nTelling sucker MC's don't waste my time\nThere's a girl I know her name is Betty\nStraight to the head just rock it steady\nShe's so freaky she'll juice you up\nAll the home boys just can't get enough\nShe's a Ph.D., don't even stop\nIn the back like that going chop chop chop\nI won't say white girl, won't say she's black\nShe's the kind of girl that make your knees go crack\nFeel the beat, rock with me\nLet me tell you what I be\nI'm a MC rapper, a MC rapper\nA big bank roller and a cold, cold capper\nHey baby, I got this rhyme\nIt's not gonna stop till the end of time\nLike rock and roll I'll play that song\nTo the beat all day and all night long\nSo listen up, to what I'm saying\nI'm a Oaktown mack, bitch I ain't playing\nTo all the home boys doing time in the pen\nGonna rock this beat for you once again\nIf you can't get out and you're mad as hell\nSay beeatch, now make it sound for real\nI'mma tear shit up if I get the chance\nI could give a fuck less if your ho don't dance\nSee I'm a big mack now, I'm so great\nI was born and raised in the Golden State\nCall me T.O.O.; if you say $hort\nI'mma rap my ass off till you give me some more\nBig bank, now just make me rich\nBitch bitch bitch bitch make me rich\nCheck out my style, baby I don't quit\nI heard this freak say, \"That's the shit\nHe took the cake, fucked the rake\nToo $hort baby damn sure ain't fake.\"\nBut the sucker MC's are screaming loud\nSaying Sir Too $hort, shut your mouth\nHow can you talk about me, and call me weak\nWhen your father smokes coke and your mother's a freak\nSo I keep on rappin' if nothing else\nKeep your jealous ass thoughts to yourself\n[Bitch] Picture this, he's a MC right\n[Bitch] Ain't saying nothing but he's holding the mic\n[Bitch] Fuck with me, and boy you're doomed\nI'll send a trick with a ho to the motel room\n'Cause I'm the coldest MC on a microphone\nLike a .357 pointed at your dome\nI got cap for cap, you never heard\nSo fresh again with cusswords\nMotherfucking shit, fucking with me\nFuck a skank bitch and a sucker MC\nAll you bastards got the claps\nAnd fuck you punk 'cause you still can’t rap\nCusswords, just let em roll\nMotherfucking shit, God damn asshole\nCusswords, just don't quit\nMotherfuck you damn shithead bitch\nIt's Too $hort, on the mic, and it don't stop\nAnd it don't stop, and it won't stop, beeatch\nCheck out my style", "image": "https://images.genius.com/9ed3ca4bcc64d64446ff7e9bea94be4e.600x600x1.jpg"}], "artist": "Too $hort"}