{"songs": [{"title": "Savage Lifestyle", "album": "1992", "year": "2016-10-06", "lyrics": "[Intro]\nBob, you can pan over a little bit. Look at this right here, this is a suburban type Jeep with a sharp shooter peering outside of the sunroof with an automatic rifle. It appears to be a scene you might see in Operation Desert Storm and we've been seeing this all night\n\n[Verse 1]\nIt's a trap, it's a trap\nWhy they ain't tell us red and blue don't matter when you black?\nMatter of fact we in blindfolds, bunch of lost souls\nKids shot dead in the streets, now they eyes closed\nHow you call the angels when it's kings getting beat up?\nAnd Gil Garcetti in his office with his feet up\nNo way to dodge police brutality\nSellin' crack cocaine, makin' a teacher's salary\nMexicans hoppin' the borders in the thousands\nBecome cholos, one button Pendletons, they stylin'\nCrips on the corner in Dodger blue with they gold chains\nBloods sportin' corn rows and Chucks with the red strings\nSun goin' down so them Chevys 'bout to roll out\nFiends scratchin' themselves, stumblin' out the dope house\nNiggas tyin' bandanas, 'bout to put the drum on\nKids tryna make it home 'fore street lights come on\n\n[Bridge]\nThe way we live is savage\nThe way we live is savage\nThe way we live is savage\nThe way we live is savage\n\n[Verse 2]\nSo grab that gun, load that clip\nGrab that torch, light that shit, grab that stick\nGrab that brick, throw it. it's time to riot\nIf you don't see black owned in the window, it's on fire\nStart here, end up over there\nThe smell of gun powder in the air\nAnd just so we clear, this is pain and despair\nWe burn our own shit and we aware and don't care\nTell the national guards to disappear\nWe got guns too and we ain't scared\nSo fuck the man, fuck the President Bush and his legislation\nShit gotta change, we ain't waitin', fuck patience\n'Cause the government corrupt, I can prove it\nMartin, Malcolm, Huey P. Newton\nAnd that's why the whole city out here lootin'\nHow can we stand here and not do shit?\nAll this smoke over the hood lookin' like low clouds\nCars with no miles on fire, they broke down\nWhite people wishin' that they was at home\nAsians frontin' like they business is Black-owned\nFar from stupid, we comin' in the stores trippin'\nRunnin' in swap meets for they Jordans and they Pippins\nCrowbars, bats, anythin' that break glass\nThey fucked Rodney King up and now it's they ass\nSo it's bottle rockets through the window\nKids that was never smokin' endo\nFiends kickin' in doors, stealin' Nintendos\nNiggas robbin' liquor stores with taped up \"Duck Hunt\" guns\nCity burnin' but it's fucked up fun\nNational Guard's on the corner\nThey don't know the hood, they foreigners\nWe was bustin' at the cops before Chris Dorner\nGhetto birds flyin' over the hood, they see us\nShowin' the fuck out, cleanin' the trucks out\nNiggas mobbin' down the streets pushin' big screens and baskets\nStarin' straight into the cameras, no ski mask\nJust pandemonium, niggas lootin' what they homies in\nRunnin' around with Scarface guns like they was Tony and them\nWho, what, where, when, how the fuck they gon' stop us?\nWhen the last 50 years we accustomed to window shoppin'\nSo we takin' lighters to the tip of magazines\nDip 'em in gasoline and set this motherfucker on (fire)\n\n[Chorus]\nThe whole world watchin', Los Angeles is on (Fire)\nYeah, yeah (Fire)\n1992, was you here for the (Fire?)\nUh-huh\n\n[Verse 3]\nStandin' on the corner with a brick in my hand\nWhen my mother told me sit in the van, nah fuck that\nFoot Locker chained up, wire cutters cut that\nNiggas Crip walkin' where Reginald Denny's truck at\nPolice cars, drivin' by niggas in slow mo\nIf you white don't stop at the light, 'cause that's a no-no\nRunnin' through the malls, give us everything Polo\nThe first time niggas ain't have beef with the cholos\n'92, fire lit the skyline, and why we loot?\nTo capture that forbidden truth 'cause Adam never ate the fruit\nFuck your blue suits, your badge, and them high beams\nWe out here sellin' chronic, we ain't have no Jimmy Iovines\nShit burnin', you gon' need more than Visine\nWe makin' a movie better than any one that I've seen\nShould be on Showtime, HBO, Cinemax\nGet a match, we gon' make sure that y'all remember that (Fire)\n\n[Chorus]\nThe whole world watchin', Los Angeles is on (Fire)\nYeah, yeah (Fire)\n1992, was you here for the (Fire?)\nUh-huh\n\n[Outro : Marvin Gaye]\nMake me wanna holla\nThe way they do my life\nMake me wanna holla\nThe way they do my life\nThis ain't living, this ain't living\nNo-no baby, this ain't living\nNo, no, no, no\nInflation, no chance\nTo increase", "image": "https://images.genius.com/5470139be6822474317a28c8796fb0da.1000x1000x1.jpg"}], "artist": "The Game"}