{"songs": [{"title": "​u", "album": "To Pimp a Butterfly", "year": "2015-03-15", "lyrics": "[Produced by Taz Arnold & Whoarei; Additional production by Sounwave]\n\n[Intro: Kendrick Lamar]\n[Screaming]\n\n[Chorus: Kendrick Lamar]\nLoving you is complicated, loving you is complicated\nLoving you is complicated, loving you is complicated\nLoving you is complicated, loving you is complicated\nLoving you is complicated, loving you is complicated\nLoving you is complicated, loving you is complicated\n\n[Verse 1: Kendrick Lamar]\nI place blame on you still, place shame on you still\nFeel like you ain't shit, feel like you don't feel\nConfidence in yourself, breakin' on marble floors\nWatchin' anonymous strangers, tellin' me that I'm yours\nBut you ain't shit, I'm convinced your tolerance nothin' special\nWhat can I blame you for? Nigga, I can name several\nSituations, I'll start with your little sister bakin'\nA baby inside, just a teenager, where your patience?\nWhere was your antennas?\nWhere was the influence you speak of?\nYou preached in front of 100,000 but never reached her\nI fuckin' tell you, you fuckin' failure—you ain't no leader!\nI never liked you, forever despise you—I don't need you!\nThe world don't need you, don't let them deceive you\nNumbers lie too, fuck your pride too, that's for dedication\nThought money would change you\nMade you more complacent\nI fuckin' hate you, I hope you embrace it\nI swear—\n\n[Chorus: Kendrick Lamar]\nLoving you is complicated, loving you is complicated\nLoving you is complicated, loving you is complicated\nLoving you is complicated, loving you is complicated\nLoving you is complicated, loving you is complicated\nLoving you is complicated, loving you is complicated\n\n[Bridge: Kendrick Lamar]\nLovin' you, lovin' you, not lovin' you, 100° proof\n(I can feel your vibe and recognize that you're ashamed of me\nYes, I hate you, too)\n\n[Break: Jessica Vielmas]\n(Loving you ain't really complicated)\nHousekeeping, housekeeping\n(What I got to do to get to you?)\n¡Abre la puerta! ¡Abre la puerta tengo que limpiar el cuarto!\n(To you)\n¡Es que no hay mucho tiempo tengo que limpiar el cuarto!\n(Loving you ain't really complicated)\n¡Disculpe!\n(What I got to do to get to you?)\n(To you)\n\n[Beat Switch]\n\n[Verse 2: Kendrick Lamar]\nYou the reason why mama and them leavin'\nNo, you ain't shit, you say you love them\nI know you don't mean it\nI know you're irresponsible, selfish, in denial, can't help it\nYour trials and tribulations a burden, everyone felt it\nEveryone heard it, multiple shots, corners cryin' out\nYou was deserted, where was your antennas again?\nWhere was your presence? Where was your support that you pretend?\nYou ain’t no brother, you ain’t no disciple, you ain’t no friend\nA friend never leave Compton for profit\nOr leave his best friend, little brother\nYou promised you’d watch him before they shot him\nWhere was your antennas?\nOn the road, bottles and bitches\nYou FaceTimed him one time, that's unforgiven\nYou even FaceTimed instead of a hospital visit\nGuess you thought he would recover well\nThird surgery, they couldn't stop the bleeding for real\nThen he died, God himself will say, \"You fuckin' failed\"\nYou ain't try\n\n[Verse 3: Kendrick Lamar]\nI know your secrets, nigga\nMood swings is frequent, nigga\nI know depression is restin' on your heart for two reasons, nigga\nI know you and a couple block boys ain't been speakin', nigga\nY'all damn near beefin', I see it and you're the reason, nigga\nAnd if this bottle could talk, [gulping] I cry myself to sleep\nBitch, everything is your fault\nFaults breakin' to pieces, earthquakes on every weekend\nBecause you shook as soon as you knew confinement was needed\nI know your secrets, don't let me tell them to the world about that shit you thinkin'\nAnd that time you [gulping] I'm 'bout to hurl\nI'm fucked up, but I ain't as fucked up as you\nYou just can't get right, I think your heart made of bullet proof\nShould've killed yo' ass a long time ago\nYou should've feeled that black revolver blast a long time ago\nAnd if those mirrors could talk it'd say, \"You gotta go\"\nAnd if I told your secrets\nThe world'll know money can't stop a suicidal weakness", "image": "https://images.genius.com/ffb1a13cfda120ba85ab9e2a83a4e158.1000x1000x1.jpg"}], "artist": "Kendrick Lamar"}