{"songs": [{"title": "Wither", "album": "Special Effects", "year": "2015-04-29", "lyrics": "[Intro: Tech N9ne]\nI don't care, they say my angel glow is subsiding\nI'm sliding outside of these high beams and I won't dare\nTry to mend this tear, I love I'm fading\nThe good once there is just dying\nSo I'm withering away and I'ma trigger when I spray\nAnd I'm attacking everybody till the feeling's gone!\n\n[Verse 1: Tech N9ne]\nAll my life I loved with people, so passive back then\nI thought I'd be above this evil, my tolerance level\nThen was up with doves and eagles\nCurrently I've hit ground zero under bugs and beetles\nI'm tilted, inside my head's a lettuce but wilted\nSerotonin, dopamine, and norepinephrine I spilt it\nCould it be how many times I've been ran over and jilted?\nThat makes me wanna totally detach from light and just kill shit\n\n[Chorus 1: Corey Taylor]\nI'll know when the pain is gone\nIt's just a matter of time before my impulses win\nAnd I can feel the wrong\nComing up through the cracks of my heart again\nI'm holding on, I'm going\nStraight into the mouths of makers\nEverything that keeps me calm was taken\nI'm letting go, I'm burning through, reserves are low\nJust pushing on these old restraints\nMy time is up cause it's too late\n\n[Bridge: Tech N9ne]\nI'm about to blow up on anyone in my way\nMy anger's set to show up, at any time today\nI'm about to blow up on anyone in my way\nMy anger's set to show up, at any time today\n\n[Verse 2: Tech N9ne]\nI am lookin' for some fire, yeah, putting on my gang attire\nDrooling and blood I can taste, so get the fuck outta my face\nI'm a killer with a quick switch, yeah, all I ever really wanted was bliss\nLook at me wither to waste, so get the fuck outta my face\nFind another one to get bent, yeah, and it ain't no stoppin' this\nLovin' the thrill of the chase, so get the fuck outta my face\nN9ne's a nigga with the sick-ness, yeah, and it ain't no blockin' this\nIt doesn't matter the race, just get the fuck out my face\n\nGoing, withering away\nGoing, withering away\nGoing, withering away\nGONE\n\nI gotta say, when my mother died, I really did inside\nAnd that's the other thing that did it\nTurning my crazy on a hundred babies gonna plummet\nMaybe I should be committed\n\n[Chorus 2: Corey Taylor]\nWhat am I supposed to do?\nDo I just keep faking? Fucking forsaking everything I am?\nAnother pissed mother fucker with a fist and a plan\nOh but you're making me do this\nI can scream while you stand there clueless\nIf you're listening I've made up my mind\nTake another step but I'm fed up this time!\n\n[Tech N9ne]\nSomething please save me, I'm losing myself\n\n[Verse 3: Tech N9ne]\nI don't think I wanna stop it, but the feeling inside is nauseous\nI get really exhausted off it, gotta find a way to wash it lock it\nProfit nada so I got to drop it, ain't nobody in the cockpit\nToss this lostness, people from the office boxes\nIf you cross this boss live cautious\nDon't make me, don't make me repeat myself\nFor your safety, because a pilly is beneath my belt\nBut I don't wanna do anything bad to anybody\nBut I'll never be perfect\nSo I'mma say to the people that got a little evil comin' at you from me I think they deserve it\n\nGoing, withering away\nGoing, withering away\nGoing, withering away\nGONE\n\nStraight, literally snappin' out\nMy lady backin' out cause I'm becoming really mean and vicious\nWatching me wither, how can I give her\nLove when I been so tainted by these bitches\n\n[Chorus 3: Corey Taylor]\nWe are the arsenal\nChemically imbalanced, completely disposable\nSo butter my knuckles and taste it\nAnother sick delinquent is wasted\nI don't forgive, I don't forget\nI haven't got time to regret\nEverybody else in the world can hate me\nNobody but me can save me!\n\n[Outro: Tech N9ne]\nShit, Yates, hates, this, place\nIf you're close enough to me to hit the switch\nYou better never turn it on\nI get the feelin' I'm gonna be craving a\nKillin I gotta be real and the evil'll\nFill up and sucker the middle man 'till he be\nGONE!", "image": "https://images.genius.com/edd99f73805809fd6bac9dda75c9e951.550x550x1.png"}], "artist": "Tech N9ne"}