{"songs": [{"title": "Out for Fame", "album": "KRS-One", "year": "1995-10-10", "lyrics": "* train whistle *\nYo right here, right here\nIt's right through the fence, right through the fence\nJump! * feet landing *\nYeah.. right there, right there\nThat's the 2s and the 5s\n* bag rustling *\nJoe gimme that, the fat, the fat cap, fat cap\nYeah..\n* train rolls in *\nAight * shaking can up *\nAight, let's do it now, let's do it now\n* spray paint *\nYeah.. yeah..\nNah gi-gimme the other cap, gimme the other one\nYeah right there\n* more spray *\nFront .. Page .. Entertainment .. Group\nYeah..\n\n\"I'm writin my name, in graffiti on the wall\" (repeat 8X)\n* first time, minus \"I'm\" *\nHah! Hahahaha\nAll graffiti artists hold tight, hooo!\nAll graffiti artists hold tight, word\nCheck check check it out y'all\nCheck check check check check it out y'all\n\n[KRS-One]\nI got twenty-five cans in my knapsack, crossin out the wick-wack\nPuttin up my name with a fat cap\nSuckers that want to be in my face I just slap that\nBig respect to Artifacts, Fat Joey Crack and\nMack and, Bio, and Brim come again\nWith B.G. 183, recognize me\nWith the mad colors, I'm a fiend for spraypaint\nLaugh if you wanna, I really care if you ain't\nCause you don't me see, and I don't know you\nBut I do know Cope2, he be hittin' walls too\nIt's the underground community of what we call writers\nWorldwide burners, gettin hotter gettin brighter\nWhattup Nicer, whattup Razor, whattup Chino\nMasta Ace in the place, with the bass\nYou know we know\nMy man Rican, my man Zorro, taught me how to draw\nIn the yards of the 5 train and the 4\nSo when I'm on tour I represent the hardcore\nI'm taggin up your blackbook sure, I'm out for the fame\n\n\"I'm writin my name, in graffiti on the wall\" (repeat 4X)\n* first time, minus \"I'm\" *\nYeah, check it out check it out check it out one time\nHip-hop music in effect one time\n\n[KRS-One]\nWhen I was growin up, I had no butcher baker candlestick maker\nI had rubbing alcohol and carbon paper\nYeah, carbon paper and a blackboard eraser\nGot me chased in the bus yards, with Rican and Nazer\nHistorically speakin, cause people be dissin\nThe first graffiti artists in the world were the Egyptians\nWriting on the walls, mixing characters with letters\nTo tell the graphic story about their life, however\nToday we do the same thing, with how we rap and draw\nWe call it hardcore, they call it breakin the law\nThere used to be a time when rap music was illegal\nThe cops would come and break up every party when they see you\nBut now the rap music's making money for the corporate\nIt's acceptable to flaunt it, now everybody's on it\nGraffiti isn't corporate so it gets no respect\nHasn't made a billion dollars for some corporation yet, so\nIn the name of Phase2, Stay High, Presweet\nGrab your cans and hit the streets, I'm out for fame\n\n\"I'm writin my name, in graffiti on the wall\" (repeat 6X)\nYeah, hip-hop culture in the house one time\nAll graffiti artists in the house one time\nYeah..\nBiggin up the other side things here y'all\nThe visual, not your video (check it out)\n\n[KRS-One]\nI'm livin in the city, inner city not a farm\nSteady bombin til I get fatigue in my arm\nWatchin for the beast cause many artists they shot em\nAnd beat em in the yards, while doin a top to bottom\nSo pass me a can, not of Old Gold\nBut full blue, sky blue, watch me unfold\nWith the cold burner, of names you mighta heard of\nLike Fab 5 Freddy, Sam Sever\nWord to the wise, Futura 2000 recognize\nNation of creation, G Man come alive\nCheckin out Revolt and Zephyr\nMy man Easy, and Rembrandt, Mitch 77\nOh no with the paint we can never dilly-dally\nBig up and respect to Con Art in Cali\nThe Soul Artists, The Rebels, The Rascals, 3YB\nUnited Artists, TAT and Dondi\nYes the other side of hip-hop is representin the visual\nToys we be dissin' you, I'm out for fame\n\n\"I'm writin my name, in graffiti on the wall\" (repeat 10X)\nHip-hop in the house one time\nVideo graf in the house one time\nAll graffiti artists in the house dig the rhyme\nPut up your nine, put up your nine, yeah!\n\nFresh... for nineteen-ninety-five\nYou SUCKERS!", "image": "https://images.genius.com/78316fa7efcf948425107910e5b3a92b.300x300x1.jpg"}], "artist": "KRS-One"}