{"songs": [{"title": "You Fuckin with the Best", "album": "Against the Grain", "year": "2005-08-23", "lyrics": "[Intro: Kurupt and Domination]\nYeah! These niggers acting like bitches again\nRack the niggers up! Hey nigga! Get your ass in here, nigga! It's a rack up homie!\nYeah, Kurupt Young Gotti, check this shit out:\nProud to be among you all here today! Domination, banger, what's cracking?\nThe streets\nYeah, real vicious! Gotti's Adolph Hitler, Gotti's Ben Laden, Neal Paul, Vinnie, Stallone!\n\n[Verse 1: Kurupt]\nI never told these bitch ass niggers before\nToo close gets too [?] shooting off the stage and show\nShooting off the roof of the club, dumping of the back of a [?]\nShooting through your curtains at home!\nHollow, levitating everything that you posses or you own!\nNigga! I'm more than Kurupt, Young Gotti\nI'm the next California governor, you better ask somebody!\nI've got a history of body and bodies!\nGotti and Domination came through to start quaking sections\nOn the sides of mountains, and make streams turn to oceans and waterfalls and fountains\nListen, I'm calling out names,[?] airborne malaria, I'm in this bitch!\nI'ma show the whole team, are you in this bitch?\nWest Coast:\n\n[Chorus: Kurupt, Domination]\nYou fucking with the best\nWith the best, nigga!\nYou run New York, I run the motherfucking West, nigga!\nGet your cash on, get your blast on\nWe're the reason your career doesn't last long!\nI came in this motherfucker with a mask on\nSo lay your ass on the floor, or get blast on!\nYou fucking with the best\nWith the best, nigga!\nYou run New York, I run the motherfucking West, nigga!\n\n[Verse 2;Domination]\nI'm from a different world, like the Wang-Wang\nWhere niggers shoot gang-bangers, sling k and roll dice on the train\nIn the West we ride trucks in the East's Air forces\nBoth [?], guns smoking niggers\nSo be cautious!\nThese streets corrupted the kid\nA lot of murderers is from were I live!\nA lot of [?]\nThese rap dudes act hard until we get on some other shit!\nOur gang is vicious, real militant-minded gangsters\nYoung killers in the middle of violence\nKeep back, you know how niggers in the East act\nMy West Coast niggers [?]\nDomination of course\nBanging had got them balls, fuck you party, so we're starting a war!\nShotties popping, bodies dropping, until the black the shit off\nPolice tape, bloodstains, white chalk on the floor!\nEast Side:\n\n[Chorus: Kurupt, Domination]\n\n[Verse 3: Kurupt]\nPull that nigga out that hoodie he's wearing\nAnd put him back to that hoodie you're wearing\nAnd see if he's gangster, if he's not\nHe's a victim of the block\nGet down, get shot\nQuit rapping like Pac\nShoot him up, bang-bang and gang-bang terrorists\n[?] toss niggers off the terrorists\n\n[Chorus: Kurupt, Domination]\n\n[Bridge]\nI came in this motherfucker with a mask on\nSo lay your ass on the floor, or get blast on!\n\n[Verse 4: Domination]\nI'm this city's nightmare, better watch where your eyes steer\nMy goons will lay you down right here\nYou fake shooters couldn't move us off the block\nHow do six niggers dump and nobody gets shot?\nHow does one get close and then roll his Glock\nStart pumping them boys up till he's certain they're not\nBefore they move, tell them suckers, get their aim up\nHow do you miss from two feet? Pussy, step your game up!\n\n[Chorus: Kurupt, Domination]", "image": "https://images.genius.com/901ee868384c5cb1f3a23f4bff250845.500x500x1.jpg"}], "artist": "Kurupt"}