{"songs": [{"title": "Here I Come", "album": "Anghellic", "year": "2001-08-28", "lyrics": "[Intro]\nI've been around the world and I- I- I don't know\n(Why people what?) Why people go (to the strip club)\nTo spend their dough (Just to see butt)\nTo see these ladies strip and take off all their clothes\n(I do not) know why they choose\n(Such a spot) I just don't know (why we get hot)\nIt's probably 'cause they make it hop and twerk the pole\n(And their headlights) are sittin' bold\n(Makes it look like) it's gettin' cold\n(Can I hold you tight?)\nHop on my lap and do that dance, I come to spend\n(Ones and huns) on lovely skin (Booty weighs a ton)\nLet the game begin ('Cause here I come)\nCha!\nYo, this goes out for all the strip clubs and Montana's putting it down, Bazooka's [?] and yeah, huh, much love for kickin' it with my man Tech N9ne\nYeeaah! Ha ha ha ha, rastafarian [?], cha!\nDrops few lyrics? Aight\n\n[Verse 1]\nTecca Nina swoop down like... Space Invaders, boy!\nPull out the piece like... on you haters, boy!\nForget about the haters, I don't wanna talk about 'em\nOn this right now, I wanna talk about\n(That butt, them breasts, yes, yes, one test)\nNow sanity stops when the fannie g. drops\nFantasy locked on makin' the canopy rock, panties be hot\nWhen we walk in all vanity pops\nIn every glam if she's stocked, make her make it frantically hop\n(We're all at the tittie bar) VIP!\n(And all of the kitties are) sittin' with me\n(They're all knowin' who we are)\nTech N9ne, baby, how you doin'?\nWhat you drinkin'? Caribou is what I'm thinkin'\nKansas City, baby (Hey, yo-yo-yo-yo)\nWe got relish, don't be jealous, that's a (Hey no-no-no-no)\nMe and my fellas travelin', lookin' for them who does what?\nMake it hop in Houston, Texas, ATL, California, whazzup?!\n\n[Hook]\n'Biancs with breasts and big butts (Here I come, baby!)\n'Nough to make the big bucks (Here I come, baby!)\n151 and Malibu rum and\nPineapple juice in my cup (Here I come, baby!)\nFellas in the front, let me hear you grunt\nFellas in the back, watch that booty clap\nLadies in the middle, let me hear you sizzle\nYell \"Tech N9ne is hard as hell!\"\n\n[Interlude]\n(Would you like a lap dance, baby?)\nOoh, I'd love a dance, baby\nBut I'd much rather you give it to your homegirl for me\nVoyeurism... That's my thang!\n\n[Verse 2]\nCatch me on the couch with two stouts mouth-to-mouth\nBounce to the techno festival, see lots of lesbo\nLet's go ghetto or heavy metal, we slam dancing\nBlair witch raves in the woods up in Cameron!\nRollin' (Diggin' the private schoolers)\nSt. Theresa's bishop Hogan (Those are the kind that do ya)\nGet that cerebella explosion\nAll of my homies kick it, pockets ain't no punk\nTrav, Dyno, Grant, Kutt\nSeven, John, George, Monk\n(All at the tittie bar) Drinkin' and laughin'\nMy homie B'zle started this at Bazooka's, booties clappin'\nBlack, Asian, White, Hatian, Mexican and Italian\nDoin' tricks with beer bottles, sexy, mixed, mullato\nI'm comin' to get ya drinkin' liquor off in Sweden\nGermany, London, back to the ATL\nOff in Memphis raisin' hell\nWith a stack of hundreds kick her that\nIn Miami in the Benz Aristocrat\nWhere the strippers at?\n\n[Hook]\n'Biancs with breasts and big butts (Here I come, baby!)\n'Nough to make the big bucks (Here I come, baby!)\n151 and Malibu rum and\nPineapple juice in my cup (Here I come, baby!)\nFellas in the front, let me hear you grunt\nFellas in the back, watch that booty clap\nLadies in the middle, let me hear you sizzle\nYell \"Tech N9ne is hard as hell!\"\n\n[Verse 3]\nWhat y'all doin' after this?\nScat with this back activist, mack miraculous practices\nBlasphemous acts\nHit 'em with a stack that'll distract a bitch\nAll I wanna do is hit the back of this black abyss\nIn the cat for the hat for risk\nIf you really wanna master this\nKnow it's a whole lotta cash to get\nMe and my homeboys will get with your homegirls\nAnd get in our own world\nWe gotta be ready to get up and go\nTo the bedroom or up in the bathroom\nGivin' me and my homeboys a show\nBaby get low\nTo a Tech N9ne tempo, do you know what you're in for?\nRough sex, much sweat\n'Nough flesh, what's next?\nMake her say:\nOh la la la la\nGive it to me Tech N9ne you're the best time\nThat I ever had, give it to me papa\nHit the na na na\nAnd oh oh oh oh yeah\nI love it when you do me like this Tecca Nina\nAnd I like it when you make it do that\nIn Kansas City we scan the tittes\nAnd brand sadities we're handsome hippies\nWho land some quickies we\nComin' to kick it where you from\nPirates come screamin':\nYo, ho, ho, 151 rum\nBitch!\n\n[Hook]\n'Biancs with breasts and big butts (Here I come, baby!)\n'Nough to make the big bucks (Here I come, baby!)\n151 and Malibu rum and\nPineapple juice in my cup (Here I come, baby!)\nFellas in the front, let me hear you grunt\nFellas in the back, watch that booty clap\nLadies in the middle, let me hear you sizzle\nYell \"Tech N9ne is hard as hell!\"", "image": "https://images.genius.com/365df4b783df60dc1a28c15c531795e6.1000x978x1.jpg"}], "artist": "Tech N9ne"}