{"songs": [{"title": "My People", "album": null, "year": "2011-08-16", "lyrics": "[Intro: Kendrick Lamar & Jay Rock]\nMy people don't love me\nWhy we hate each other?\nWhy we kill our brothers, why we hurt our mothers?\nMy people don't love me\nWe can love one another\nWe should stick together because we're all we got\nMy people don't love me\nWhy we ride on another, need to love one another\nWe all we got\nMy people don't love me\nI said we all we got, I swear to God dog we all we got\nMy people don't love me\n\n[Verse 1: Jay Rock]\nThis whole world's spillin' senseless killing\nUniverse beyond evil, one topic to serve\nBe my black people, we be missing the point like Shaq's freethrow\nSean Taylor, life gone because of haters\nA nigga he known tried home invasion, went wrong\nBullet penetrated his leg, femur bone\nDays later, wake arrangements, flowers to be catered\nThat was so impatient, take him from the next man\nCause he ain't got the will to hustle like he can\nNiggas would rather steal than think of a righteous plan\nTo get residuals, kill for dividends\nThis life is critical, we living in a time where\n9-year olds tote 9's\nTurn 10, it's Mac 10's and coke lines\nI wonder why successful black man gotta die from a black man\n\n[Hook: Kendrick Lamar]\nMy people don't love me\nWhy everywhere I go I got to accumulate some hate?\nMy people don't love me\nGenocide all we know shit, we basically in the KKK\nOK-K-K, I'm trying to make my cake\nBut every time I turn around you take it from me\nBlack people don't love me\nHate each other we do each other wrong\nThat's why today, black people let's love we\n\n[Verse 2: Kendrick Lamar]\nCan't be a positive black role model\nLeading the future with no haters to follow\nNow that's fucked up, if I ever wanna see\nSuccess, I gotta see death? Be famous for what?\nHe aiming for higher learning, you aiming to shoot him down\nHe flying straight, you wanna u-turn him\nYou burn your brother's bridges\nHis accomplishments making way for your children\nStill you don't compliment, inconsiderate black pride\nNo never been, never win, gotta lose\nThat's the slope that's for the black heritage\nWe play the fool better than comedians\nDisobediant dude no respect, ethics\nI refuse to be a statistic\nBut changing my community don't seem realistic\nShow me an African American doing right\nI'll show you one that will kill his ass tonight\n\n[Hook: Kendrick Lamar]\nMy people don't love me\nWhy everywhere I go I got to accumulate some hate?\nMy people don't love me\nGenocide all we know shit, we basically in the KKK\nOK-K-K, I'm trying to make my cake\nBut every time I turn around you take it from me\nBlack people don't love me\nHate each other we do each other wrong\nThat's why today, black people let's love we\n\n[Verse 3: Jay Rock]\nWe stuck together back in slavery days\nMartin and Malcolm them dudes paved the way\nThe bullshit we doing, I know they're turning over in their graves\nThe shit need to stop today\nYeah the die for the cause, some like Jesus for us\nTo become better people, think about it\nWe used to run from the KKK\nBut now we running from our brothers that be holding them k's\nMan, never thought there'd be days like this\nCan't trust your homies that you're hanging with\nDamn shame, why you kill a nigga over a chain\nWhen you could get up on your hustle and get the same thing\nUnited we stand tall, divided we all fall\nLet's leave this bullshit behind y'all\nOn the real, the envy and the hate need to stop\nBlack people we all we got\n\n[Hook: Kendrick Lamar]\nMy people don't love me\nWhy everywhere I go I got to accumulate some hate?\nMy people don't love me\nGenocide all we know shit, we basically in the KKK\nOK-K-K, I'm trying to make my cake\nBut every time I turn around you take it from me\nBlack people don't love me\nHate each other we do each other wrong\nThat's why today, black people let's love we\n\n[Outro: Jay Rock]\nY'all better wake up and smell the coffee\nWe all we got man\nIt's black on black killing each other man it needs to stop\nReal talk\nBlack people need to smarten up\nWe all we got", "image": "https://images.genius.com/7aba92d3a44f82ce35570bdf8e9000b7.640x640x1.jpg"}], "artist": "Kendrick Lamar"}