{"songs": [{"title": "In the Long Run", "album": "Hell On Earth", "year": "1996-11-19", "lyrics": "[Intro]\nIn the long run we could be on son\nIt's on son\n\n[Chorus]\nCause in the long run we could be on son\nIt's on son, extra cash just for more guns\nCause in the long run we could be on son\nIt's on son, extra cash just for more guns\n\n[Verse 1: Ty Nitty]\nYo, Ty Nitty, air-force one's call up my dunns\nGot more niggas like seeds on sesame buns\nCaught a body on the run\nYou don't want none, lump some\nExtort niggas for they lump sum, no doubt\nProceed, where that weed indeed?\nHavoc laced the track razor sharp, you bleed\n\n[Verse 2: Havoc]\nMy whole mission, like a platoon take position\nAin't going in if my clique can't get in\nThat's word to mines, have you stressed like jail time\nGet that loot up, no doubt I bail mines\nEasy access, shorty straight up hit the mattress\nHave you role-playing just like an actress\nMy tactics leaving niggas stuck doing back flips\nI black out, take it to the gats, fuck this rap shit\nLet my niggas shine, rate my rhymes like a dime\n\n[Verse 3: Prodigy]\nSwollen bullet wound head ass niggas\nYo, who's the one to be made into example?\nNigga, you pop shit with the wrong guys this time\nWhat? My Mobb will get on top ya, topple ya\nLike a fall guy you fell down clown\nFirst the four-pound sound, my eighty-six style now\nTen years later still holding firm ground\nNigga P thugly, enter the ring with something\nFor anyone who wanna play gun, what up G?\nI clap you, stop you in your tracks, how bout that?\nNow analyze these cats, a live nigga rap\nYou seen strapped, came outside all hype with gats\nGot juiced up, now bishop think he thugging it black pimp\nLet's rap a taste, you get your little head pinched off\nBrooklyn touched you then left you for Queens to finish off\nFuck a [faggot nigga] Keith Murray and his whole clique\nYeah, you snuffed me in front of the cops, that bullshit\nTold you come around the corner, no police and no witnesses\nLittle to your knowledge, you almost got shot\nBut that's aight though, I'ma catch your ass again\nYou fuckin immigrant [I'd murder you and 2Pac] for two cent\nMy Mobb running shit, you fucking Carlton Ave coward\nThe forecast call for grey skies and gun showers\n\n[Chorus] x2\nCause in the long run we could be on son\nIt's on son, extra cash just for more guns\n\n[Outro: Ty Nitty, Havoc, Prodigy]\nWhat? What? Nigga knock your man out boy\nKnock him out cold boy\nLike a motherfucker boy\nYo, know what I'm saying?\nWe gon' be here all night like a motherfucker\nInfamous forever\nKnow what I'm saying?\nHold up, hold up, hold up, hold up, hold up, hold up\nWe got it locked baby\nI'll let you know nigga\nGot it under control\nNiggas ain't ready for us baby\nIt's Mobb style, Infamous Mobb we coming through\nYou know how we do\nWe're like the motherfucking watchtower yo\nStrictly thug\nKnow what I'm saying?\nStrictly thug boy, let ya know\nTo all ya niggas\nStrictly thug boy, The REAL thug life nigga\nPermanent scars, like a []", "image": "https://images.genius.com/cb51383ec91030d5e17e2b134d0e8477.1000x1000x1.jpg"}], "artist": "Mobb Deep"}