{"songs": [{"title": "Lyrics of Fury", "album": "Follow the Leader", "year": "1988-07-26", "lyrics": "[Verse 1]\nI'm rated \"R\", this is a warnin', ya better void\nPoets are paranoid, DJs destroyed\n'Cause I came back to attack brothers in spite\nStrike like lightnin', it's quite frightenin'!\nBut don't be afraid in the dark, in a park\nNot a scream or a cry or a bark, more like a spark\nYa tremble like an alcoholic, muscles tighten up\nWhat's that? Lighten up! You see a sight but\nSuddenly you feel like you're in a horror flick\nYou grab your heart then wish for tomorrow quick!\nMusic's the clue, when I come you're warned\nApocalypse Now, when I'm done, ya gone!\nHaven't you ever heard of a MC murderer?\nThis is the death penalty and I'm servin' a\nDeath wish, so, come on, step to this\nHysterical idea for a lyrical professionist!\nFriday the 13th, walkin' down Elm Street\nYou come in my realm, ya get beat!\nThis is off limits, so your visions are blurry\nAll ya see is the meters of the volume\nPumpin' lyrics of fury!\nIt's a... a fearified freestyle!\n\n[Verse 2]\nTerror in the styles, never error-files\nIndeed, I'm known to exile!\nFor those that oppose to be level or next to this\nI ain't a devil and this ain't the Exorcist!\nWorse than a nightmare, you don't have to sleep or wink\nThe pain's a migraine every time ya think\nFlashbacks interfere, ya start to hear\nThe R-A-K-I-M in your ear\nThen the beat is hysterical\nThat makes Eric go get an axe and chops the wack\nSoon the lyrical format is superior\nFaces of death remain\nMCs decayin', 'cause they never stayed\nThe scene of a crime every night at the show\nThe fiend of a rhyme on the mic that you know\nIt's only one capable, breaks the unbreakable\nMelodies-unmakable, pattern-unescapable\nI haunt if you want the style I possess\nI bless the child, the earth, the gods and bomb the rest\nFor those that envy an MC, it can be\nHazardous to your health so be friendly\nA matter of life and death, just like a Etch A Sketch\nShake 'til you're clear, make it disappear, make the next\nAfter the ceremony, let the rhyme rest in peace\nIf not, my soul'll release\nThe scene is recreated, reincarnated, updated\nI'm glad you made it\n'Cause you're about to see a disastrous sight\nA performance never again performed on a mic\nLyrics of fury!\nA fearified freestyle!\n\n[Verse 3]\nThe \"R\" is in the house, too much tension!\nMake sure the system's loud when I mention\nPhrases that's fearsome, you wanna hear some\nSounds that not only pounds but please your eardrums\nI sit back and observe the whole scenery\nThen nonchalantly tell you what it mean to me\nStrictly business, I'm quickly in this mood\nAnd I don't care if the whole crowd's a witness\nI'mma tear you apart but I'mma spare you a heart\nProgram into the speed of the rhyme, prepare to start\nRhythm's out of the radius, insane as the craziest\nMusical madness MC ever made, see it's\nNow an emergency, open-heart surgery\nOpen your mind, you will find every word'll be\nFurier than ever, I remain the future\nBattle's temptin', whatever suits ya!\nFrom words to sentence, there's no resemblance\nYou think you're rougher? Then suffer the consequences!\nI'm never dyin', terrifyin' results\nI wake ya with hundreds of thousands of volts\nMic-to-mouth resuscitation, rhythm with radiation\nNovocain ease the pain, it might save him\nIf not, Eric B.'s the judge, the crowd's the jury\nHow do I plead to homicide?\nLyrics of fury!\nThey're gettin' furier!\nA fearified freestyle!", "image": "https://images.genius.com/9b590ab143a3ba007bcb44a5bd6af57b.953x953x1.jpg"}], "artist": "Eric B. & Rakim"}