{"songs": [{"title": "Niggaz Can’t Touch Me Kid", "album": "Unleashed & Unreleased", "year": "1998-01-01", "lyrics": "\"Hey yo, let me know I'm saying, if you recording when the beat come in\"\n\"I'm recording right now motherfucker\"\n\"Hey yo, niggas can't touch me kid\"\n\"What was that god?\"\n\"I said niggas can't touch me kid.\"\n\n[Intro: DMX]\nUhhh...aha..\n\n[Hook: DMX]\nNiggas can't touch me kid\nNiggas can't touch me kid\nNiggas can't touch me kid\nNiggas can't touch me kid\n\n[Verse 1: DMX]\nAin't no way for me to say just how deep the flow gets\nStill waking up in cold sweats, over old threats\nAnd I done did more time than a clock, from the hallow to the rock\nI represent on every block\nIts the Dizark! Straight out the Grizound!\nAnd from now on this is how Shizits going Dizown!\nClizown, come through squashing toes\nDon't even breathe cause in jail you was washing clothes\nGet in front of hoes and start fakin' G, as you tell it you getting dough like a bakery\nMaking me Schemin plots at yo, ass like a dream I put that head to bed and you can dream a lot!\nFunny shit is before I shot tha nigga, you shoulda seen how the bitch came up out tha nigga!\nNow I got the nigga but I could run up in 'em made 'em say \"Daddy\" before I put the gun up in 'em\nOne up in 'em, two three, empty the clip, Have his whole head looking like a busted lip\nAnd I skip, cause I can't stand another case\nWent to his wake so I could laugh at the look on his mother's face\nEven though I know it ain't shit funny about knocking a nigga off just to get money\nI still do what I gots to and just be grateful that I never got you cause I woulda SHOT YOU!\n\n[Hook 4X]\n\n[Verse 2: DMX]\nYeah, you know how I'm living nigga\nStraight up ruthless, let's leave yo man toothless, cause ain't nothing giving nigga\nI been cruddy cause just long as I can remember since 1970 the 18 of December\nEarl Simmons, the bastard that nobody wanted was born\nNiggas showed me a joint made 'em run it, it's on\nCan't a bank around the way say I ain't stuck it\nQuick as I cap a body I can be one, so fuck it!\nI ain't got shit to lose but my life\nPlug you in the gut and watch the blood ooze down my knife\nI laugh at death cause to me it's funny\nDon't give a fuck about shit, what matters to me is money!\nSonny, I could teach yo ass a trick or two about stacking the dough, macking a hoe and what the bitch'll do\nI drove a bitch until the bitch is worthless\nHave her sucking my mans dick and make it look good on the surface\nA nigga get the same treatment\nI'm leaving guts on walls, and brains all over the cement\nBut no remorse for the corpse cause I still kick 'em\nHe ain't bleeding enough so I stick 'em\nAnd I will have another body\nKinda like how I feel when I'm blowing up another party\nAnd shit is cracking in the hood now so I'm good now\nTalking bout you good now\nOh, you good\nHahhhh\n\n[Hook 4X]\n\n[Verse 3: DMX]\nPlenty of niggas know dirty is how I do 'em\nPush buck shots from a 30 right through 'em\nCause ain't none of ya'll motherfuckers built for war\nAnd I lay down the law when I spray down ya door\nFuck around and my name'll be 19 5 be 64 11 on the 3 and a half to 7\nBut even up north I put niggas to waste so if you wanna stop the violence\nGET THE FUCK OUT MY FACE!\nThe open door, peeps hit the floor\nBitches is fucking but I sleeps with the sawed off!\nI got shit to do, crews to rake, moves to make\nWait for the news to break, I got dues to take\nI don't joke cuz jokers is cards\nAnd cards are what I pull\nInfrared with the clip full, no leash on my pitbull\nThis shit is hot like the wax off a candle stick\nBut how I handle shit, is to dismantle shit (Dundundundunduhdada)\nLike Popeye and it's spinach time, running through niggas like a tape at the finish line\nWhat ya crew gonna do when I put the pressure on?\nAnd it hurts wanna be gangstas in skirts?\nAnd the bitch is coming all up out the nigga!\nOne false move and they mom's will read about the nigga\nAnd they girls will be without the nigga\nMatter fact, I'm tired of talking money throw ya joints up, let's scrap\n\n[Hook]\n\n\"Can't touch me kid...word up...\nCan't touch me kid...word up...\nThey can't touch me kid!\nWord like can't touch me kid\nWord to mans can't touch me kid\nCuz I get big can't touch me kid\nCuz that's how it is can't touch me kid\nI lives how I lives can't touch me kid\nFresh off a bid can't touch me kid\nGet the body and slid can't touch me kid\nYo I did what I did can't touch me kid\nNow who get big? can't touch me kid!\n\n\"Uhhhhh....HAHA!! AHHHHH!!\"", "image": "https://images.rapgenius.com/c048ed75e001e7462e2f3445177e4821.500x500x1.jpg"}], "artist": "DMX"}