{"songs": [{"title": "T.G.I.F.", "album": "A Kid Named Cudi", "year": "2008-07-17", "lyrics": "[Verse 1: Chip Tha Ripper]\nKnock knock, CuDi open up, it's Chip\nGotta kush pack shells and some Henney we could sip\nKeep a couple dolla's on, give a penny to a bitch\nBut I'm wit a couple ho's who said they really wanna get\nAcquainted with some niggas who ain't the average niggas\nThey just wanna see why all they girlfriends be wanting pictures\nI be flyer then a hundred gnats, worth a hundred hundred-stacks\nI ain't gonna stop shoppin' till I hit a hundred sacks\nPolo that's a given I ain't even gotta mention\nCandy old-school put you niggas in detention\nSlabbed niggas deeped-up tool in the clothes\nI'm just a young fresh fly fool with some gold\n\n[Chorus: KiD CuDi]\nAy-ay, what it do my dude?\nI'm living life, dawg, what about you?\nAnd I ain't even gotta tell a lie\nMy swag, my steez got a nigga sky-high\nSo I'm, watchin' my moves\nFrom the shoes on the coupe\nBe damned if a nigga ain't high to the roof\nPimp tight get it right, homie, more or less\nI gotta thank God I'm fresh\n\n[Verse 2: KiD CuDi]\nOh, I rearrange faces when I drop\nI'm super duper Cudi candy-paint the rag-top\nCan't nobody even tell me I don't sip 'em when I lean\nBut get me to my fans, I'm country to the seas\nPlease, I stay up on my creep so to come up\nGotta look the part superstar, no stunnas\nI'ma say some shit that make you think I lost my mind\nI'm the only nigga that could watch the sun and don't go blind\nShe fine as she wanna be, but she wanna check, though\nDodging and popping pictures like the ho's was working with the law\nBack in Shaker bitches, trynna play me to the left\nNow I pick the hoes that I want and give my niggas what is left\nI don't know if it's the name or the Bape gum bottoms\nKeep them on salute them 501's you can't knock 'em\nUse to have the Honda with the thirty-day tags\nThat was in the past now I'm bout to throw 'em on the Jag\n\n[Chorus: KiD CuDi]\nAy-ay, what it do my dude?\nI'm living life, dawg, what about you?\nAnd I ain't even gotta tell a lie\nMy swag, my steez got a nigga sky-high\nSo I'm, watchin' my moves\nFrom the shoes on the coupe\nBe damned if a nigga ain't high to the roof\nPimp tight get it right, homie, more or less\nI gotta thank God I'm fresh", "image": "https://images.genius.com/4fb504d5b4dda8a236c224bb1cc11e2a.800x800x1.jpg"}], "artist": "Kid Cudi"}