{"songs": [{"title": "Too High (Poly High)", "album": "Death Row’s Snoop Doggy Dogg: Greatest Hits", "year": "2001-10-23", "lyrics": "[Intro: Big Pimpin]\nJust another day in the motherfucking neighborhood\nA pimp's waking up and he's feeling good\nVersace to the flow\nHe didn't even mess with the Taylor made shit today y'all\nSmelling good with his reptiles on for sure\n\n[Verse 1: Snoop Dogg]\nI'm waking up in the morning, man I'm mourning; what's wrong?\nMy Nigga Corleone gone in my Zoning, but I'm boning, out to school\nCause I can't be late, cause they'll lock the gate\nAnd it's damn near eight, that's when the bell ring\nI'm a slide on in, and come right on in\nAnd once I bail through the hallways, giving it up\nFunky fresh stars and khakis, cool living it up\nWhat up? - the same shit trying get paid and stay strong\nLunchtime, I make my way to get my grub on\nTen minutes to one, feeling good like I should for sure\nFourth period; walk through the door\nI'm wreaking and smelling like endo\nBut still the day moves on to 2:44; one minute left to class\nBy Warren G, the Twins and Daz\nNate Dogg finna scoop us up in a blue drop top Brouham\nI hear some bitches from Wilson wanna tag.. along\nAnd get up, for the get-down\nWord got around about the niggas from the Piddound\nWe keep the whores on point, to join on lit\nAnd keep heat discreet, until the shit jump off\nWell we're all from the side, so we won't ask why\nSo you best get high!\n\n[Chorus: X2]\nToo high, so fly, like Snoop is poly high\n\n[Verse 2: Wayniac]\nSee I... took advantage cause I live right next door\nTo the funkhouse, dunkhouse with the whole show\nNiggas know how we go; from first 'til four we don't show\nLunch and then the last whore\nIt's getting dealt with some melt shit I guess\nWe smoke the Stress, cause my quest wasn't chronic yet\nLittle niggas growing up with my dogs\nCause we pack the hogs, exercise for my balls\n\n[Verse 3: Trip Locc]\nStacked bigger than I thought it would be\nMe and the family, working on TV, get paid and fuck their enemy\nMoving on up, like the Jeffersons but quicker\nAll we think about is finding ways to get richer\nHit you like some dodo, got you're begging for more\nIt's a trip, I'm serving on the solo\nLow blow, I had you feeling me\nI got some C-O-N-V-O for your community\n\n[Verse 4: Daz Dillinger]\nI'm still in a fast lane state of mind\nTime is impossible, for me to try to find\nI'm out of school on the line\nHustling here and there, never show no fear\nHosted it up on a watch, I posted it up with a Glock\nPCH in atlantic, is what you see just don't panic\nIt's me, Snoop rocks and when my homies get static\nGot a pistol that blasts like a cannon\nLook out for when we form at the wall, nigga where you standing?\nRaise up, realize, street lights magnify\nLife is giving; don't let it pass you by\nI'm here and there with the bud, conversating with the drink\nShocked in my own zone, got time to think\nCause what would I be, if I wasn't who I am\nMaybe dead or in jail, maybe time'll never tell\nApproach me wrong and you will get chin checked\nTo disrespect my clique, and you will get dealt with\nUhh.. plain and simple, nevertheless with the best shit available\nTest me now, let me see how brave you are\nI'm scott free, so it's on like it used to be\nD-O-G-G P-O-U-N-D G-C, for life, two times 'til I die\nOh why, Oh why, life is a challenge when you die?\nWhat's the peak for me, is the cash and the strap\nSince the 2-1-3 days been like that\n\n[Chorus: X2]\n\n[Outro: Big Pimpin]\nFeeling very playish, ha.. I mean very plash\nAnd the bitches saying: why shouldn't he?\nYeah he should; doing what he does and he does it good\nHe goes to work, yeah, he does it good\nOn pavement or dirt, checking the skirt\nThe story of a Pimp's Life, yeah baby\nYou gotta have the stomach for this shit, Hoo weeee\nTo fuck with this, the story of a Pimp's Life\nOhh yes baby, honey suckle to a berry\nGot to check; the traps, got to check the dollars\nGot a doctorate from the street called: Peace Mack of Diamond Net\nA scholar with my niggas from the underground [Echoes]", "image": "https://images.genius.com/dceebda859a32eb0b992545242936a6f.480x480x1.jpg"}], "artist": "Snoop Dogg"}