{"songs": [{"title": "Who Shot Me?", "album": "Still Brazy", "year": "2016-06-17", "lyrics": "Motherfucker my shit!\n\n[Chorus]\nWho shot me?\nMotherfucker who shot me?\nI don't know, who shot me?\nMotherfucker who shot me?\n\n[Verse 1:]\nI'm like, \"Damn, did the homies set me up?\"\nCause we ain't really been talking much\nI know that sounds sick, my thoughts dark as fuck\nLike the barrel of the pistol I saw when he sparked it up\nProlly was mad as fuck when I walked out the hospital\nStupid ass motherfuckers, thinking they was going to stop Jizzle\nHad my pops mad, my momma sad, my sister feel bad\nMy lil bro still mad, somebody got to pay for that\nMy granny's prayers work cause it could've got worse\nI'm talking pictures on the shirt\nWhen the shots went off, I thought the spot was deserted\nBut nah everybody in the spot was just nervous\nI don't like that, nah I don't like that, we can't go right back\nSo many niggas ready to go, we can go war with Iraq\nThey knew the code to my gate, that was awkward\nAnswer this, I got a million dollars\n\n[Chorus]\nWho shot me?\nMotherfucker who shot me?\nI don't know, who shot me?\nWho shot me?\nMotherfucker who shot me?\nMotherfucker who shot me?\nI don't know, who shot me?\nWho shot me?\n\n[Verse 2]\nMaybe it cause I fucked Jamal bitch and I knew if he found out\nHer scary ass was gon tell him about my hideout\nYeah they really came to the front door\nBut luckily we had something fatter than this 9 out\nOr maybe it was the nigga that I socked out\nWhen he hit me first I shoulda been knocked out\nAll these maybe maybe maybe maybe’s\nI’m about to say fuck it and start squeezing without aiming\nI got trust issues if I don’t fuck with dude\nMy body language gon tell him I don’t fuck with you\nI can’t sleep at night this shit unbomfortable\nHaving nightmares of me coming for dude\nHaving a hard time putting together two and two\nThey was in a brand new truck, somebody sent them dudes\nThey knew the code to my gate that was awkward\nAnswer this, I got a million dollars\n\n[Chorus]\nWho shot me?\nMotherfucker who shot me?\nI don't know, who shot me?\nWho shot me\nMotherfucker who shot me?\nMotherfucker who shot me?\nI don't know, who shot me?\nWho shot me?\n\n[Bridge: Paloma Ford]\nStaring out the window\nSmoking on this indo\nCause I don’t know who did it but I know this\nBullets don’t just go where the wind blows\nSo I'm looking under my nose\nHate always comes from up close\nBut they can’t stand me though\n\n[Outro]\nNiggas ain’t do no damage though\nNigga bounced up that muthafuckin' hospital\nThat same night, walked that shit off\nLike a motherfucker gangsta is posed to, nigga, feel me\nLike my mama asked this nigga\nLike “Boy what’s wrong with you”\nMotherfucker shot me, nah mama\nNone of these motherfuckers can stop me, nah mama\nJust got to walk it off mama\nWho shot me?\n\n[Interlude (Spoken)]\nAfter all the wicked shit I did\nI knew karma was gon catch up with a nigga\nDamn, I ain’t know it was gon' happen like this\nSome nigga really tried to set me up\nI know shit get wicked in the street sometimes\nLike I said “You never know when it might brack off”\nBut I guess God has some other plans for me\nCause that shit ain't stop me", "image": "https://images.genius.com/6d9597606099b223fdd3ad68fa232887.1000x1000x1.jpg"}], "artist": "YG"}