{"songs": [{"title": "Kingdom", "album": "Nobody’s Smiling", "year": "2014-05-30", "lyrics": "[Produced by No I.D.]\n\n[Spoken]\nI do dirt, in search of a clear mind\nMoney talk, somebody's gonna hear mine\nGrind early before 9:30\nGot the nine and the thirty\nKiss of death, you heard me?\nMy world ain't worldly, any time could be my time\nI get high, but still ain't seen Chicago skyline\nIn my prime, stakes is high cause it's beef\nOut here in these streets\nEverybody tryna eat off the same plate\nDead presidents, we want the same face\nAnd to think, me and the president, we from the same place\nFour-hundred and twenty-one murders, ain't tryna be of the same fate\nIf I die and go to heaven, will I make it through the main gate?\n\n[Intro: Common]\nHelp me get, get the keys to the kingdom\nOoh\nHelp me get, get the keys to the kingdom\nOoh\nAh yes, my Lord, Ah, Oh\nAh yes, my Lord, Ah, Oh\n\n[Verse 1: Common]\nSecond row of the church with my hood on\nMy homie used to rap, he was about to get put on\nAt his funeral, listening to this church song\nHis family yelling and screaming, I hurt for ‘em\nA cold world that’s why we pack heaters\nListening to this preacher as he tryna reach us\nI’mma need to go back, I gots to get 'em\nBack and forth in these streets, that’s the rhythm\nRevenge is supposed to be the Lord's but I use my own accord\nWhen I seen him on the porch, cost my man his life, I can’t afford not to hit him\nShots ripping through his True Religion denim\nThese streets was my religion\nI stood over him, his life is over then\nNow these keys got me locked up with older men\nThought these was the keys for me to roll a Benz\nThey ended up being the keys for my life to end\n\n[Hook: Common]\nHelp me get, get the keys to the kingdom (yeah)\nOoh (sing)\nHelp me get, get the keys to the kingdom (yeah)\nOoh\nAh yes, my Lord, Ah, Oh\n(And the streets say)\n(And the people say)\n(And we all say)\nAh yes, my Lord, Ah, Oh\n(And the streets say)\n(And the people say)\n(And we all say)\n\n[Verse 2: Common]\nMy money ain't straight, my fam ain't straight\nAin't wanna push kis, heaven couldn't wait\nI was hurtin', couldn't get no work\nYou created me from dust, that's why I did dirt\nYou said that the last shall be first\nNow I'm in a hearse, what's this cash really worth?\nMy whole life I had to worry about eatin’\nI ain’t have time to think about what I believe in\nWhen the days of the kingdom for Chicago gon' come?\nI’m coming back like the Prodigal Son, and I got a son\nAnd I don’t want my ways following him, the streets swallowing him\nAnd I don’t want no hollows in him, his momma said she see his father in him\nHope it’s the good things, ‘til life was over is when I understood things\nStanding at the gates ‘cause I know you’ve forgiven what I’ve done\nI’m your son, do I have the keys to get in?\n\n[Hook: Common]\nHelp me get, get the keys to the kingdom (yeah)\nOoh (sing)\nHelp me get, get the keys to the kingdom (yeah)\nOoh\nAh yes, my Lord, Ah, Oh\n(And the streets say)\n(And the people say)\n(And we all say)\nAh yes, my Lord, Ah, Oh\n(And the streets say)\n(And the people say)\n(And we all say)\n\n[Verse 3: Vince Staples]\nSweet Lord Jesus, tell the polices to let a nigga breathe\nMy sinning father see, got a shipment by the seas\nSee my niggas tryna eat, eat whatever’s on your plate\nSave some for me, the worst things in life come sitting six feet\nTryna hop the gate to heaven ‘cause I couldn’t get a key\nBut these niggas play for keeps and I gotta hold my own\nTryna watch my back ‘cause these stripes ain’t free\nWe still wading in the water, cocaine, blunts, marinating in the water\nLeina took a puff and then she gave it to my father\nUsed to take the bullets out so I could play with the revolver\nSatan serenading ever since I was a toddler\nTell ‘em talk is cheap, niggas living for the dollar\nSo in God we trust, leave the praying to my momma though\nAnother motherfucker out of control\nJust walking my soles low, lit up with the abuse\nThey wasn’t for show, I promise every pistol was used\nSee I was waking up afraid to see my name on the news\nBroad day, bare faced, giving niggas the blues\nNigga who you? They know me on the streets where I grew\nIf you ain’t from around here you get gunned down here\nMake the best from the least on the quest for the keys\nTo the kingdom\n\n[Hook: Common]\nHelp me get, get the keys to the kingdom (yeah)\nOoh (sing)\nHelp me get, get the keys to the kingdom (yeah)\nOoh\n(And the streets say) Ah yes\n(And the people say) My Lord\n(And we all say) Ah, oh\n(And the streets say) Ah yes\n(And the people say) My Lord\n(And we all say) Ah, oh\nHelp me get, get the keys to the kingdom (yeah)\nOoh (sing)\nHelp me get, get the keys to the kingdom (yeah)\nOoh\n(And the streets say) Ah yes\n(And the people say) My Lord\n(And we all say) Ah, oh\n(And the streets say) Ah yes\n(And the people say) My Lord\n(And we all say) Ah, oh\nHelp me get, get the keys to the kingdom (yeah)\nOoh (sing)\nHelp me get, get the keys to the kingdom (yeah)\nOoh\n(And the streets say) Ah yes\n(And the people say) My Lord\n(And we all say) Ah, oh\n(And the streets say) Ah yes\n(And the people say) My Lord\n(And we all say) Ah, oh", "image": "https://images.rapgenius.com/706b127ba6bf9a36636a877712b5decc.500x500x1.jpg"}], "artist": "Common"}