{"songs": [{"title": "I’m Gone", "album": "Still Blowin’", "year": null, "lyrics": "[Intro]\nThis ain't nuttin new\nI've been doin this shit bitch\nI've been in the same frame of mind since I was 9\nMotherfucker\n\n[Too $hort]\nYou already know, I'm crazy bitch\nI put my foot in the ass of a lazy bitch\nFuck with me you better make somethin\nCause I'll never see a hoe and don't take nothin\nI was raised to break 'em\nYou got a purse full of hundreds? I'ma take 'em\nSquare bitches always fall in love\nI call 'em bitch hoe tramp slut all the above\nAnd when I turn 'em out, and send 'em to work\nIt feels good, knowin I'm pimpin 'em first\nI wear a mack hat, real fly with a tilt\nWhen I was 7, girls used to buy me milk\nIn middle school, I used to get it fool\nLunch money, and they let me hit it too\nCause all I ever wanted was a Cadillac\nAnd some hoes that'll call me Daddy Mack\n\n[Chorus: repeat 8X]\nBitch I'm gone! (Is you gone?)\nBitch I've been gone! (Is you gone?)\n\n[Too $hort]\nI never had only one girl\nIf I wanted I could have any woman in the world\nYou cain't save me from the game\nI'm in it for the money, fuck the game\nBut everybody seems to know my name\nAnd these hoes, know I ain't playin\nBitch I'm gone, and I ain't never comin back\nYeah I'm both - I'm a player and a mack\nYou ain't stupid! You know the business\nYou under new management and gotta go get it\nNext time I see you have a stack of Ben Franks\nGive it all to me, and tell a pimp thanks\nStuff it in the matress, we don't put it in the bank\nHundred thousand dollar car, puttin gas in the tank\nUse my phone, tell your man you chose\nFuck all that old shit and get some brand new clothes\n\n[Chorus]\n[Too $hort]\nYou wanna go with me straight to the top?\nYou gotta check yes or no in the box\nI was tellin hoes that shit in '76\nAll them dreams I used to have I knew I'd better get rich\nI wanted all the bad bitches, and all the cars\nDrop my top at night and see all the stars\nI used to walk down the street daydreamin\nAnd now it came true, these bitches stay creamin\nAnd I still don't give no bitches no slack\nGet involved with me, fo' sho' bitch you know that\nI don't hold back, I put it out there\nDo everything I say and don't doubt a player\nCause if you do - I ain't fuckin wit'chu\nI'm through, I don't want nuttin from you\nJust listen to the song\nWhile I put the pedal to the metal, bitch I'm gone\n\n[Outro]\nToo $hort mixtape\nStill blowin baby\nAlbum comin soon\nYou know you want that shit\nI know you want it bitch!", "image": "https://images.genius.com/cbce7a2bf9547c73552eb8d05ea5f8b2.700x700x1.jpg"}], "artist": "Too $hort"}