{"songs": [{"title": "Threat", "album": "The Black Album", "year": "2003-11-14", "lyrics": "[Produced by 9th Wonder]\n\n[Intro: Cedric the Entertainer]\nYo, what's up, pimp, this threats\nThat's right, that's the, the that's, this threats, pimp\nAnd I'm serious about mine, I'm so sincere\nAnd I, nigga I'll kill ya, I'll chop ya up\nPut ya inside the mattress like drug money, nigga\n\n[Break: Jay-Z]\nYeah, I done told you niggas 9 or 10 times, stop fuckin' with me\nI done told you niggas, 9 albums, stop fuckin' with me\nI done told you niggas with the 9 on me, stop fuckin' with me\nYou niggas must got 9 lives\n9th Wonder\n\n[Verse 1: Jay-Z]\nPut that knife in ya, take a little bit of life from ya\nAm I frightenin' ya? Shall I continue?\nI put the gun to ya, I let it sing you a song\nI let it hum to ya, the other one sing along\nNow it's a duet and you wet when you check out\nThe technique from the two TECs and I don't need two lips\nTo blow this like a trumpet, you dumb shit\nThis is a unusual musical I conductin'\nYou lookin' at the black Warren Buffett\nSo all critics can duck sick\nI don't care if you C. Delores Tuck-it\nOr you Bill O'Reilly, you only rilin' me up\nFor three years, they had me peein' out of a cup\nNow they 'bout to free me up, what you think I'm gon' be, what?\nRehabilitated, man, I still feel hatred\nI'm young, black and rich so they wanna strip me naked\nBut you never had me like Christina Aguiler-y\nBut catch me down the Westside, drivin' like Halle Berry\nOr the FDR in the seat of my car\nScreamin' out the sunroof \"death to y'all\"\nYou can't kill me, I live forever through these bars\nI put the wolves on ya, I put a price on your head\nThe whole hood'll want ya, you startin' to look like bread\nI send them boys at ya, I ain't talkin' 'bout feds\nNigga, them body-snatchers, nigga you heard what I said\n\n[Chorus: Jay-Z]\nI make 'em wait for you 'til five in the mornin'\nPut your smarts on the side of your garment\nNigga stop fuckin' with me\nR … I … P …\n\n[Interlude: Cedric the Entertainer]\nThat's right there nigga, nigga I'm wild\nNigga I keep trash bags with me\nNever know when you gotta dump a nigga out\nThis sincere, this some sincere shit right here!\n\n[Verse 2: Jay-Z]\nGrown man, I put hands on you\nI dig a hole in the desert, they build the Sands on you\nLay out blueprint plans on you\nWe Rat Pack niggas, let Sam tap dance on you\nThen I Sinatra shot ya, goddamn you\nI put the boy in the box like David Blaine\nLet the audience watch, it ain't a thang\nY'all wish I was frontin', I George Bush the button\nFor the oil in your car, lift up your hood, nigga run it\nThen lift up your whole hood like you got oil under it\nYour boy got the goods, y'all don't want nothin' of it\nLike, castor oil, I'll Castor Troy you\nChange your face or the bullets change all that for you\nY'all niggas is targets, y'all garages for bullets\nPlease don't make me park it in your upper level\nValet a couple strays from the .38 Special, nigga\nGod bless you\n\n[Chorus: Jay-Z]\nI make 'em wait for you 'til five in the mornin'\nPut your smarts on the side of your garment\nNigga stop fuckin' with me\nR … I … P …\n\n[Interlude: Cedric the Entertainer]\nYeah I'm threatenin' ya, YEAH I'm threatenin' ya!\nWho you thank you dealin' with?\nThey call me Threats, nigga\nI been makin' threats since I been in kindergarten, nigga!\nHuh, ask about me, see if you ain't heard\n\n[Verse 3: Jay-Z]\nWhen the gun's tucked, untucked, nigga you dies\nLike nunchuks held by the Jet L-I\nI'm the one, thus meaning no one must try\nNo two, no three, no four—know why?\nBecause one's four-five might blow yo' high\nYou ain't gotta go to church to get to know yo' God\nIt's a match made in heaven when I [blaow] 'splay the 7\nPut you on the nigga news, UPN and 11\nWhere you been? You ain't heard?\nGot the word that I'm [blaow blaow] that I'm so sincere?\nI'm especially Joe Pesci with it, friend\nI will kill you, commit suicide and kill you again\nThat's right\n\n[Chorus: Jay-Z]\nI make 'em wait for you 'til five in the mornin'\nPut your smarts on the side of your garment\nNigga stop fuckin' with me\nR … I … P …\n\n[Outro: Cedric the Entertainer]\nWhattup? Motherfucker, I keep three motherfuckers what?\nNigga I'll throw a Molotov cocktail\nThrough your momma's momma's house\nNigga what the, where everybody live!\nUndercover nigga, take your teeth out your mouth nigga\nChew your food up and put the shit back in your mouth nigga\nAnd help you swallow\nNigga I take a mop handle off nigga\nAnd sweep nigga, hold on, I'll be, nigga what?", "image": "https://images.rapgenius.com/db98dd9c59a51c9b6b76f6d6a32cac9f.991x1000x1.jpg"}], "artist": "JAY-Z"}