{"songs": [{"title": "I’m Losin’ It", "album": "R U Still Down? (Remember Me)", "year": "1997-11-25", "lyrics": "[Intro]\nStraight out the motherfuckin' Bay\nHere we go\n\n[Verse 1: 2Pac]\nLord help me, save me, Mama keep prayin'\nFor a young motherfucker tryin' to duck an early grave\nIn the city where ya can't tell the snakes from the fakes\nFakes from the phonies, enemies of homies\nAround the corner there's another nigga waitin' to jack\nHe don't know I got a Glock 'til his ass get shot\nLike a motherfuckin' thug disease\nCravin' beats like they motherfuckin' drugs to me, hey\nWhat's up with bitches tryin' to screw me? Do me cause I did a movie\nThrow the pussy to me but before they never knew me\nRather die then let ya play me for a, buster\nAnd with my Glock I'm a plottin' ass rotten motherfucker, huh\nDon't let the movie fool ya, let me school ya\nScreamin' Thug Life nigga when I do ya\nI'm goin' crazy, gettin' dizzy\nAnd then I snap again a motherfuckin' breather bring me back\nI'm tellin' ya I'm losin' it\n\n[Chorus]\nSaid I'm losin' my mind\nLosin' my mind\nSaid I'm losin' my mind\nLosin' my mind\nSaid I'm losin' my mind\nLosin' my mind\nSaid I'm losin' my mind\nLosin' my mind\n\n[Verse 2: Big Syke]\nI'm goin' crazy, niggas can't fade me\nOn the real I kill when I step to ya fuckin' grill\nSo let me kick it let me flip it let me get wicked\nI'm not a buster from the hood sellin' wolf tickets\nI hang with G's flippin' keys and smokin' weed\nI get the cash and dash and never learn to read\nSo fuck a bitch fuck a ho and I let ya know\nBecause they come and go like the wind blows\nWhat am I givin' how I'm livin' what I'm givin' up\nYou can take my life and I don't give a fuck\nCause I'm the trouble most comin' from the west coast\nWhere the niggas is bangin' 'til the overdose\nKillers and murderers, psychos and lunatics\nNobody knows what makes my mind click\nIs it the demons, screamin' inside of me?\nHell no it's just the Thug Life mentallity\nI'm goin' crazy shit don't phase me\nI'm livin' like a thug 'til six niggas carry me\nDeath is on the trigga so pull it\nI can't take it no more, nigga, I'm losin' it\n\n[Chorus]\nSaid I'm losin' my mind\nLosin' my mind\nSaid I'm losin' my mind\nLosin' my mind\nSaid I'm losin' my mind\nLosin' my mind\nSaid I'm losin' my mind\nLosin' my mind\n\n[Verse 3: Spice 1]\nShit was talkin' to me, my gat screamed fire\nThe bullet told me shoot that motherfucker he's a liar\nI talked to me 3-80 like a bitch on a stroll\nWhen my niggas try to dick me\nNigga, I can't get fucked in this game I'm a psychopath\nMy AK told me to shove him up some niggas ass\nI'm havin' long conversations with Mr. Millimeter\nHe's one of my best friends bitch ass nigga eater\nAnd Miss Mossburg love it in the back trunk\nYou know that old school bitch she like to get it funked\nAnd spittin' motherfuckers by the seems\nMy grand daddy Mr. AR-15\nBy the evil motherfucker\nTalked me into takin' over a dope turf and shootin' cluckers\nSaid he was my only family\nShoot straight, and please don't jam me\nGot in a fight at the club my gat started talkin'\nTold me to shut the fuck up and let him do the talkin'\nI woke up and it was sick to see the guts hang\nI'm goin' nuts man\nShit was talkin' to me\n\n[Chorus]\nSaid I'm losin' my mind\nLosin' my mind\nSaid I'm losin' my mind\nLosin' my mind\nSaid I'm losin' my mind\nLosin' my mind\nSaid I'm losin' my mind\nLosin' my mind\nSaid I'm losin' my mind\nLosin' my mind\nSaid I'm losin' my mind\nLosin' my mind\nSaid I'm losin' my mind\nLosin' my mind\nSaid I'm losin' my mind\nLosin' my mind\nSaid I'm losin' my mind\nLosin' my mind\nSaid I'm losin' my mind\nLosin' my mind", "image": "https://images.genius.com/4f924e981b74c6d754d2c9da26f83f15.500x500x1.png"}], "artist": "2Pac"}