{"songs": [{"title": "Doggy Dogg World", "album": "Doggystyle", "year": "1993-11-23", "lyrics": "[Chronic break]\nCan we get a motherfuckin moment of silence\nFor the small chronic break?\nA-hah, niggas be brown-nosing these hoes and shit\nTaking bitches out to eat, and spending money on these hoes\nKnow what I'm saying?\nI treat a bitch like 7-Up, I never have I never will\nI tell a bitch like this:\n\"Bitch, you without me is like Harold Melvin without Bluenotes\nYou'll never go platinum!\"\nHey Daz, give me a light nigga\n\n[Intro: Taa Dow & Snoop Dogg]\nWe’d like to welcome y'all to the fabulous Carolina West\nI own this motherfucker and my name is Taa-Dow\nY'all niggas know who I am, y'all niggas tearin' up shit\nBut we got somethin' old, and somethin' new for y'all tonight\nPut your hands together for Snoop Doggy Dogg\nThe Dogg Pound, and the fabulous Dramatics\nIt's like everywhere I lizzook\nAnd everywhere I go\nI'm hearing motherfuckers trying to steal my flow\nBut it ain't no thang, cause, see, my homie Coolio\nPut me up on the game when I stepped through the door\n\n[Verse 1 - Snoop Dogg]\nSome of these niggas is so deceptive\nUsing my styles like a contraceptive\nI hope you get burnt\nSeems you haven't learnt\nIt's the knick-knack, patty-whack\nI still got the biggest sack!\nSo put your gun away, run away, cause I'm back\nHit em up, get 'em up, spit 'em up\nNow, tell me, what's going on?\nIt make me wanna holler, cause my dollars come in O-zones\nKnown for break off so take off your clothes\nAnd quit trying to spit at my motherfuckin' hoes!\nSpeaking of hoes, I'll get to the point\nYou think you got the bomb cause I rolled you a joint?\nYou'se a flea, and I'm the Big Dogg\nI'll scratch you off my balls with my motherfuckin' paws\nY'alls niggas better recognize\nAnd see where I'm coming from: it's still Eastside\nTil I die. Why ask why?\nAs the world keeps spinning to the D-O-double G, Y\n\n[Chorus: The Dramatics & Nancy Fletcher]\nIt's a crazy, mixed-up world\nIt's a Doggy Dogg World\n\n[Verse 2 - Kurupt]\nWell if you give me 10 bitches then I'll fuck all 10\nSeen the homie Snoop Doggy sipping juice and gin\nDon't slip, I'm for the set-trip, to get papers\nStyles vary, packing flavor like Lifesavers\nAin't that something?\nTalk shit and I'm dumpin'\nI had your whole fuckin' block bumpin'\nDon't sweat, but check the technique. I'm unique like China\nYou'll never find a bomber rhymer than this nigga behind ya\nSo peek-a-boo, clear the way, I'm coming through\n1, 2, 3: you can't see me\nI'm a G like that, strapped with hit-hard tactics\nA fuckin' menace, using hoes like tennis rackets\nIt's on again, It's on and poppin'\nAll I see is green, so there ain't no stoppin'\nI wanna see some panties droppin'\nI'm coming from L.A\nShe used to chill with Dre up in Compton\n(All I ever did was just use that ho\nShow her my dickies, get with these, and kick flows)\nI’m dishin out blues, I’m upsettin' like bad news\nCut off khakis, french braids, and house shoes\nKurupt, the name’s often marked for catchin' slugs\nAnd I smoke weed for the fuck of it\nRuff and rugged shit, it’s unexplanatory how I gets wicked\nBut it’s mandatory that I kick it\nCheck it, I’m runnin' hoes in 94, now must I prove it\nHoes call me Sugar Ray for the way I be stickin' and movin'\nPrepare for a war, it’s on, I’m head huntin'\nHit the button, and light shit up like Red Dawn\nPeep, the massacre from a verbal assassin\nMurderin' with rhymes packin' Tec-9’s for some action\nYou really don’t know, do you, you fuckin' wit a hog\nYou can’t do me, I’m goin' out looney like O-Dog\n\n[Chorus: The Dramatics & Nancy Fletcher]\nIt's a crazy, mixed-up world\nIt's a Doggy Dogg World\n\n[Daz Dillinger]\nTha Dogg Pound rocks the party (all night long)\nTil when? (Til the early morn')\nAnd it don't stop, and it don't quit\nFor tha Dogg Pound clique to drop the cavi dough\n\n[Verse 3 - Daz]\nDiggity-Daz out of the motherfuckin' cut once more\nSo grab a seat and grab your gin and juice and check out the flow\nI flip-flop and serve hoes with a fat dick\nTil I die, I'm still screaming out: \"bitches ain't shit!\"\nNow I'm the mack daddy, had he not known about\nThe city where I'm from: Dum diddy dum\nAs you groove to the gangster shit\nThe D-O-double G, the P-O-U-N-D\nThe gangster clique\nNow as the Pound break it down with the gangster funk\nI can see and I can tell that's what the fuck you want\nThen I blaze up the chronic so I can get high\nI promise I smoke chronic til the day that I die\n\n[Chorus: The Dramatics & Nancy Fletcher]\nIt's a crazy, mixed-up world\nIt's a Doggy Dogg World", "image": "https://images.genius.com/291a4bae4730034f4a529b0498c6f71f.480x500x1.jpg"}], "artist": "Snoop Dogg"}