{"songs": [{"title": "People Don’t Believe (AKA Hand Of The Dead Body)", "album": null, "year": null, "lyrics": "We got this whole motherfucker on a mission\nNow the whole, entire world's gotta try to come up with a quick decision\nThey claim we threats to society\nAnd now they callin' on the government to try and make somebody quiet\nFor the bullshit they done to me\n\nGangsta Nip, Spice 1 or 2Pac never gave a gun to me\nSo gangsta rap ain't done shit for that\nI've even seen white folks from River Oaks go get the gat\nSo why you tryin' kick some dust up\nAmerica's been always known for blaming us niggas for they fuck-ups\n\nAnd we were always considered evil\nNow they tryin' to bust our only code of communicating with our people\nLet's peep the game from a different angle\nMatt Dillon pulled his pistol every time him and someone tangled\n\nSo why you criticize me for the shit that you see on your TV?\nThat rates worse than PG\nJust bring your ass to where they got me\nSo you can feel the hand of the dead body\n\nNigga don't believe that song\nThat nigga's wrong\nGangstas don't live that long\n\nNigga don't believe that song\nThat nigga's wrong\nGangstas don't live that long\n\nSo now they tryin' separation\nAnd sendin' black folks in white coats to infiltrate our congregation\nTappin' into our conversation\nSaying, the message that they give bring forth or premeditation\n\nSo David's got a silver mag while listenin' to Brad\nDavid gets mad and kills his dad\nDavid Duke's got a shotgun\nSo why you get upset 'cause I got one?\n\nA tisket, a tasket, a nigga got his ass kicked\nShot in the face by a cop, close casket\nAn open and shut situation\nCop gets got, they wanna blame it on my occupation\n\nIf you don't dig me then, nigga, you can sue me\nBecause the shit that I be sayin' ain't worse than no western money\nDon't blame me, blame your man, Gotti\nSo you can feel the hand of the dead body\n\nNigga don't believe that song\nThat nigga's wrong\nGangstas don't live that long\n\nYou best to free your mind\nBefore I free my nine\nAnd stop fuckin' with the void in pop\nOr feel my hot rocks\n\nBang, bang, boom, boom, ping, ping, I'm the black\nWhite boys gat a magazine and don't know how to act\nI'll attack and make you vomit\nDown with Khalid Abdul Muhammad\n\nDo he got a brother, I'm it now\nI'm the illest\nWanna kill this house, nigga, Don Cornelius\nCan you feel this?\n\nYou punk niggas make me sick\nSuckin' on the devil's dick\nScared of revolution\nNeed to start deuchin'\n\nHouston is the place, I caught a case\nThem motherfuckers tried to put a scar on my face\nBut I bust two times to the gut\nTo the Reverend, Calvin Butts, gotta pair of nuts?\n\nI started this gangsta shit in '86\nNow you dissin' me for publicity\nIsn't he a hoe to the third degree?\nWho me?\n\nI'm a G who like to scrap a lot\nDown with Rap-A-Lot\nAnd I can't stop, won't stop\n\nSo fuck, Bill and Hillary\nIce Cube, there ain't no killin' me\nIce Cube, Scarface\nDroppin' on these sellin' out niggas, doing it like this\n\nNigga don't believe that song\nThat nigga's wrong\nGangstas don't live that long", "image": "https://images.genius.com/4a83e0fa554b5f2e5c5acce61362bbe7.1000x1000x1.png"}], "artist": "Scarface"}