{"songs": [{"title": "Queen Radio - The Cardi B Drag", "album": null, "year": null, "lyrics": "[Spoken: Nicki Minaj]\nThe disgusting pig this person is:\nCalling a dead child a monkey, but telling people somebody talked about your child that never talked about your motherfucking child\nSo you can get some fucking sympathy points?\n\nThey can't feed they fuckin’ family\nBecause you mad at what another man sticked his dick inside of\nYou mad... you mad at a woman for what a man is doin'\nAnd that's a problem with so many black women and women, period\nOh, ’cause she's not black, she refers to you black women...\nOh we got the receipts for that too...\nShe refers to black women as monkeys and roaches\nROACHES!\nThese are the women going hard... for her... the roaches... when the lights come out...\n\n[laughing in background]\n\nThey stay scrambling, the roaches! We roaches!\nBlack women is roaches now!\nWe roaches, be clear!\nNow, I'ma say... No!\nSo there are two beautiful women right now...\nWho... who... have been accused of... whoever they slept with, and you know, whatev...\nAnd so they were, you know, allegedly attacked\nAnd they're cut up everywhere...\nBut oh, not by women, men!\nYou sent a man to beat on women!\nLemme tell you... I'ma say it again...\nWhat's sad is that a lot of times a man can hurt a woman so badly\nThat she no longer even knows who she's angry at\nAnd what happens is... first of all let's get on 1-800 number for PostPartum Depression\nBecause, let me tell you something, that’s nothing to joke about\nYou just had the biggest blessing of your life with a child\nAnd in one week you have attacked three women?\nOne at Fashion Week, and left looking the way you left looking so that people could point their fingers at our culture and at our community and laugh at us some more?\n\n[laughing and talking in the background]\n\nLemme tell you something, a woman cannot give your man pussy\nIf he doesn’t stick his dick in there\nWho are you angry at, sweetheart?\nAnd you wanna let your publicist write something about stopping bags?!\nDo you know what the fuck it is to sit in your fucking room for hours and days at the time writing raps?!\nYou came into my fucking culture!\nI've never had to fuck a DJ to play my songs!\nThis is not funny and this is not about attacking\nThis is about getting this woman some fucking help!\nThis woman is at the best stage of her career and she’s out here throwing bottles and throwing shoes?!\nWho the fuck is gonna get her a fucking intervention?!\nGet the fuck outta here with this bullshit!\nYou niggas don't care until somebody is fucking dead!\nYou niggas want somebody to fucking die until y'all stop!\nUntil you stop this bullshit, laughing at this shit, this shit ain't fuckin’ funny!\nYou put your hands on certain people, you gon' die!\nPeriod!\nI'm not the bitches in the strip club\nAnd I'm not a bitch on a reality show\nMy money is very fucking long!", "image": "https://images.genius.com/5997ffd99fd5590dbbe0245527b57250.750x750x1.jpg"}], "artist": "Nicki Minaj"}