{"songs": [{"title": "Un-Hunh!", "album": "Simmz Beatz Presents - The Best Of DMX", "year": "2001-01-01", "lyrics": "Errrr, here we go again\nUh, un-hunh\nUh, un-hunh\nUh, un-hunh\nYeah, yo Kiss\nWhat up dog?\nThese niggas running around here like they controling this shit\nNo doubt\nLet's show these niggas how to take hold of this shit\nThat's what I'm talkin about baby\nFor real baby\nLet's get it on\n\nI only gave you the crown so I could shoot it off your fuckin head\nYall niggas fuckin dead, you heard what the fuck I said\nI talk shit cause I walk shit, start shit, New York shit\nThe hawk shit, spark shit, the dark shit\nAnd it been that way, fuck how a nigga live it's gon' end that way\nNiggas is part of a game that I don't play\nNever catch dog carrying what I don't weigh\nThat's three 45s, one 38, 173 pounds straight out the gate\nI don't hate, got no beef but knock a nigga off quick\nAnd I'm mad like a bitch and a nigga with a soft dick\nGet off this, fucking with X, but on some other shit\nWhy the fuck you fucking with X? You must be fucking with X\nGo catch a chicken, fucking with me you gon' catch a whippen\n\nUn-hunh, here we go again\nUn-hunh, here we go again\nUn-hunh, here we go again\nUn-hunh, here we go again\nUn-hunh, here we go again\nUn-hunh, here we go again\nUn-hunh, here we go again\nUn-hunh, here we go again\n\nLook don't try to apologize on your two way\nSympathy don't amuse me, go get your uzi\nAnd let's make a real movie\nPlay bad guy and good guy til the hood die\nToast yall cowards\nNow I know the reason why Pac ain't really like most yall cowards\nIm'a show you how to swing the chrome for real\nDog this year we gon' bring it home for real\nWhat you wanna bet the llama'll squash you\nI been had a white fan base before the signing of Marshall\nBoy Kiss is thorough, hit your girl\nPut it all up her stomach til she earl\nYall niggas ain't nice ya lucky\nSo fuck it Im'a sell dope long as the price is lovely\nAnd it ain't only the voice it's the bars of death\nDMX and Jadakiss nigga guard ya chest\n\nUn-hunh, here we go again\nUn-hunh, here we go again\nUn-hunh, here we go again\nUn-hunh, here we go again\nUn-hunh, here we go again\nUn-hunh, here we go again\nUn-hunh, here we go again\nUn-hunh, here we go again\n\nWhen is they getting off our dicks, them niggas is clowns\nHow many dogs you let go up, still getting down\nLike 'face said, last of a dying breed\nFor stomach and I feed still trying to eat\nLead by greed that's when you fuck up\nYall niggas gonna know when we hungry, you get stuck up\n(What what?) What's up? Fuck a nigga yelling\nY-O motherfucker for real, yo 'Kiss tell 'em\n\nShoot to kill, stomp niggas out boot to grill\nI'll give you a reason why I'm \"The Truth\" for real\nNiggas can't fuck with Kiss, I mean that\nHad to stop eating red meat cause I ate too many Beanie-Macs\nI'm not one of them niggas and since you so richeous\nDon't make me send your ass to Ala quicker\nNiggas gas you to force your hand\nRealistically you just a worker and your boss is my man\n\nUn-hunh, here we go again\nUn-hunh, here we go again\nUn-hunh, here we go again\nUn-hunh, here we go again\nUn-hunh, here we go again\nUn-hunh, here we go again\nUn-hunh, here we go again\nUn-hunh, here we go again\n\nUn-hunh, here we go again\nUn-hunh, here we go again\nUn-hunh, here we go again\nUn-hunh, here we go again\nUn-hunh, here we go again\nUn-hunh, here we go again\nUn-hunh, here we go again\nUn-hunh, here we go again", "image": "https://images.rapgenius.com/9eeff580f67d1e7a55b22f2a7021d9d7.801x800x1.jpg"}], "artist": "DMX"}