{"songs": [{"title": "Psycho", "album": "Bar Exam 3: The Most Interesting Man", "year": "2010-05-30", "lyrics": "[Intro: DJ Whoo Kid]\nBar Exam!\nBE3!\nWhoo Kid!\nRoyce the five-nine!\n\n[Verse]\nYeah, I call my cannon \"poppa\"\nI'm the shit, smell me? You can't mask it\nThis not the phantom of the opera\nThe cannibal of rap, knock you out on camera\nTurn around and play it back on When Animals Attack\nI'm a psycho like no other I am out my shit\nThe bitch picked up my shot and drank it so I fuckin' shot the bitch\nI'm controllin' lots of shit\nI can go from rock 'n' roll to opposite\nHip-hop and shit, never miss like Stojaković\nPop up on you, pop you quick, run your pockets, pocket it\nKillin' what I'm not feelin', trigger's strung like a violin\nConsignment, tell the buyer, \"welcome to my environment\"\nI'm violent, my rhyme's on fire like dyin' firemen\nThirty-two year-old pioneer\nWho'll leave you lyin' if you usin' iron\nWhere you niggas pink, I am rare\nWhere they're servin' up the drinks, I am there\nTake the cops to water, S.W.A.T. the shore up\nLike somebody saw a fly in it\nAny thing movin', I want in\nUnless it's the skinny-jean movement, I want out\nI don't need nobody else to ride for me, I roll out\nBefore I shoot you say \"'member me?\" You wasn't forgot about\nI got a pocket full of stones\nMy niggas'll be on your head\nFor some money to stay in the prostitutin' zone\nI will let the bully off\nBeef with me is like a lock connected to a bra\nYou be naked, can't pull it off\nImagine murderin' your record company for merging with\nWho gave you a deal cause you ain't deserve it\nI'm not a rapist, bitch, I'm just a pervert\nCrazy dude with a dick full of baby food, now switch to Gerber\nLyrics is murder. Get it and put your gun away\nI whip a \"Pacquiao\" when it's Spring, sell it through the Summer\nYou can call me Money May, your money funny, run away\nTake the K off a fake, leave a nigga Dunaway\nGet it? I go ballistic on your spirit\nThat chopper look like somebody put some scissors to your fitted\nI've been wit' this from the beginnin'\nIf you visual picture me killin' witnesses\nIf I'm the defendent, I was offended\nI rap a lot but I'm not independent\nDrink alcohol a lot, knowin' my only real problem is spendin'\nThe metaphors and them similes is career endin'\nYour melon's soar to infinite's what I intended\nDon't get in trouble, you get me pissed and my fist'll hit ya\nYou hearin' birds and seein' doubles like picture picture\nYou hearin' doubles you heard me say I was sicker sicker\nI'm gonna go get the papers, get the papers\nYour bitch sucked my johnny two times\nPolished me like a hella shoe-shine\nGet your shine box, Ryan got a goodfella coupon\nI fit the description of a killer wit' a ridiculous dick\nWhy is your bitch so mentally into me? Shit!\nBut she can miss me with the sensitive, intimate shit\nAll I do is poke holes like I be fencin' with chicks\nPicture black attitude\nBefore I meet you I'm naturally mad at you\nYou have to be that into gratitude\nIf you like livin' life then kiss my ass and you cool\nI'm hot like your gun'll be after you pass me the tool\nDon't have to be rappin' at your talent show at your school\nTo have the full capacity of my faculty clappin' at you\nWe'll actually get your rap group a casket or two\nNever did a movie cause I'm too busy actin' a fool!", "image": "https://images.genius.com/f26afa0e15f73eb0b5cef561ec304c68.450x450x1.jpg"}], "artist": "Royce da 5'9'’"}