{"songs": [{"title": "BRING IT BACK", "album": null, "year": "2018-04-11", "lyrics": "[Hook: Trouble]\nBring it back, bring it back, bring it back, yeah\nBring it back, bring it back, bring it back, yeah\nDon't wanna have to chase you down 'bout them stack\n'Cause I will blow ya back, bring it back, this ho here throw it back\n\n[Verse: Tyler, The Creator]\nAyo, Converse selling out they got their thumbs tied\nRe-up on my deal, let's make it 1-5\nAnd I ain't talking point, that gorilla if I point\nHe gon' get you, that's the point no lie\nHit the gas and we outta there (skrrt)\nLike it's mountain wear, lately, I've been dolo in this bitch\nShoutout Solo, that's big sis, shoutout Frankie, that's big bro\nYa lil' homie running shit, no question\nCasio the mothafuckin' watch\n800 in a day, my boy, that's just one drop\nInvest in stocks, that's the other plan\nTwo-story bed, I hit the running man\nBaby boy, no photo, long sleeve, my polo\nCasio, no Rolo', Parmesan, my bolo\nVVS my necky, necky heavy flooded\nWe done broke them levees, anything for Fetti\nBut don't let it get to you, these niggas tripping\nThey shoe in the gutter, they gonna ruin their future shit that\nThey doing like, flexin' on the 'Gram about a bank deposit (hmm)\nYeah, that shit addicting, shit is hypnotizing (hmm)\nClaiming that you rich, like, bitch we know you lying (yuh)\nWhat yo backyard look like? What your mama driving?\nMane, call me flame, I'm lighting niggas I'm an animal, fuck is tame?\nYoung wild nigga, it's the WANG (it's them GOLF boys)\nG boy, jeez boy, he that boy, boy, you a decoy (yuh)\nFuckboy, heard you want beef, bitch, you eat soy\nUs and them and we ain't got time, bitch, I'm Pink Floyd, yuh\nSapphire's gelatin, niggas is repetitive\nAmEx 'cause my pockets is what I can't fit my cheddar in\nSleeping on me, sedative, who these niggas better than?\nIs the answer me? Hmm? Uh, no, negative, yuh\n\n[Outro: Trouble & Tyler, The Creator]\nOunces in my mothafuckin' pantry (yeah)\nDiamonds on a young nigga, dancin', yeah\nJust dropped some bandos on some glasses, yeah\n(Golf boys in this shit)\nJust dropped your bitch off, man, that hoe so nasty\n(Shout out to Trouble)\nHuh, all about that paper, can't miss a beat, yeah\n(Shout out to Drake, shout out to Mike WiLL)\nI'ma get some Cho-Cho, one thing 'bout me, yeah\nGossip all that hoe shit, miss me with that\nI could put you front line, just bring it back", "image": "https://images.genius.com/10762725d9ee9836a61a50fbd9bf2d1f.999x999x1.jpg"}], "artist": "Tyler, The Creator"}