{"songs": [{"title": "You Don’t Know", "album": "Hall of Fame (Deluxe)", "year": "2014-03-24", "lyrics": "[Produced by No I.D.]\n\n[Intro]\nYou know what you do\nYou know what you do\nYou know what you see\nYou know what you do\nYou know what you - you don't know what you do!\n\n[Verse 1: Big Sean]\nHow about we pretend all these niggas not around\nAnd get fucked up like we was out of town\nWoah, then get fucked up and go get out of town\nSwerve, swerve\nAnd tell ourselves that one time doesn't count, tell me\nHow fucked up you down to get?\nA pound? A zip? A thousand sips\nRed cup yeah that college shit\nFree liquor got it on scholarship\nBitch act like you don't know what's up\nAct like it ain't my crew blowing up\nLose not to much champagne, no throwing up\nOne time for the set, please go throw it up\nIt's Finally Famous, overbooked, overpaid and overpriced\nBut don't get it twisted, that shit ain't happen overnight\nHad dreams of balling now I'm NFLing\nLet her spend the night, she feel like Cinderella\nAll she tell me is-\n\n[Hook: Ellie Goulding]\nYou don't know what you do!\nYou know what you do\nYou know what you do\nYou don't know what you do!\nYou know what you do\nYou know what you do\nAnd you don't know what you do!\nIt's just a feeling inside me\nAnd you don't know what you do!\nIt's just a feeling inside me\nYou don't know what you-\n\n[Verse 2: Big Sean]\nI know, I know, I know I'm the reason you get dressed up\nI know, I know, I know I'm the reason you get messed up\nHeart breaker, young heart breaker\nWhen you get in the game I swear the whole world commentates you\nBut man, I don't give a fuck what they saying, I don't give a fuck about opinions\nI don't give a fuck about feelings, I ain't no dentist, either I did, I do or I didn't\nYou could try to tell me how to live my life, I ain't hearing it\nI must be doing something right if every mill comes with a spare I guess\nStraight, straight, straight up out that dirt, but my t-shirt clean, ohh\nDo it for the city, that's the 313\nThat's unnecessary, fuck her like she my secretary\nAss and face is hereditary, her momma, shit, legendary\nYou don't know what you do\n\n[Hook: Ellie Goulding]\nYou don't know what you do!\nYou know what you do\nYou know what you do\nYou don't know what you do!\nYou know what you do\nYou know what you do\nAnd you don't know what you do!\nIt's just a feeling inside me\nAnd you don't know what you do!\nIt's just a feeling inside me\nYou don't know what you-\n\n[Outro: Big Sean]\nGo, go, go, go. go\nCan't let that high go to waste I feel high on\nSupposed, supposed, supposed, supposed, supposed\nMan, watch your back I swear man some of these niggas be\nHoes, hoes, hoes, hoes, hoes\nBut I'mma live this like I swear that's all I know\nKnow, know, know, know, know, know", "image": "https://images.genius.com/27fece6af1c9ca0717550d393fff7409.1000x1000x1.jpg"}], "artist": "Big Sean"}