{"songs": [{"title": "Ol’ Dirty Bastard", "album": "SouthMatic", "year": "2019-06-13", "lyrics": "[Intro]\nI won't fuck you, you can't even sing\nYeah, sing you of bitches (Ahh)\nBaby I like it raw (East side shit)\nBaby I like it raw\nBaby I like it raw (East side)\nBaby I like it raw (East side)\n\n[Verse 1]\nAyy, think about the game and what it could be\nIf all these niggas pay producers how they pay for pussy\nSerious what you took me, a quick as how you lookin'\nAll these rappers cookie cutters\nRockin' crop tops, coochie cutters\nLong way from drop tops and coogie sweaters\nI'm in between two different eras though\nYou and you and you and you and you are all identical\nFuck the clone I can't even tell who the original\nMandela effect, I cannot remember you\nAs far as conscious rappers go I do what they pretend to do\nSo what have you assumed? How a pop nigga got the biggest nuts in the room\nHow you, how you conscious runnin' for Congress\nAin't this the system that put your people in bondage?\nAin't this the system that sprinkled diseases on the original people?\nGave us a book and a steeple, got niggas hooked on the needle?\nAnd drug money, casino money\nWe don't ever see no money\nUnless of course you got a degree or somethin'\nFrom the school that the elite funded\nOkay, you need a degree to make digits\nYou work your whole life to pay back tuition\nBy the time you retire, all of your four children have drained all your pension\nNow they need tuition\n\n[Chorus]\nShame on a nigga for tryin' to run game on a nigga\nWho buck wild with the trigga\nShame on a nigga for tryin' to run game on a nigga\nI'll fuck your ass up\nBaby I like it raw\nBaby I like it raw (Ooh)\nBaby I like it raw (Ooh)\nBaby I like it raw\n\n[Verse 2]\nYeah, I put a end to the world you the greatest rapper in (In)\nA rapper is nothing but candy packagin' (In)\nGuess that mean you sweet inside, Laffy Taffy skin (Skin)\nBars too advanced like a graph in calculus (Mm)\nHuh, I thought you guys was felons\nY'all so gangsta in the street but be so nice on Ellen\nI see no lies I'm tellin', spend your life hoteling\nYou bought a mansion in the 'burbs to make the white folk jealous, well\nThe richest slave on a plantation still work on a plantation (Huh)\nRich as a bitch, wealthy indeed\nStill at the end of a very long leash\nIf we inside a cell, I'm the mitochondria\nNiggas steal your style like hypochondria\nReportin' live from the human holocaust\nFuck what the masses do them niggas is dumb lost\nYeah, it's the return of Osiris (Of Osiris? of Osiris, of Osiris)\nLook, they know what clothes you like they know the timin'\nTo peel back layers of your psyche and send you niggas some Nikes\nJust a step away from being an animal\nA food crisis away from being some cannibals\nBest part of my day is the back of my eyelids\nOnly thing better is waking up next to my bitch\n\n[Chorus]\nShame on a nigga, try to run game on a nigga\nWho buck wild with the trigga\nShame on a nigga, try to run game on a nigga\nWho buck wild, wait\nBaby I like it raw\nBaby I like it raw\nBaby I like it raw\nDon't make a biopic about me, bands\n\n[Outro: Ol' Dirty Bastard]\nShame on a nigga, who try to run game on a\nOl' Dirty Bastard, live and uncut\nShame on a nigga, who try to run game on a\nOl' Dirty Bastard, live and uncut\nShame on a nigga, who try to run game on a\nOl' Dirty Bastard, live and uncut\nShame on a nigga, who try to run game on a\nOl' Dirty Bastard, live and uncut\nShame on a nigga, who try to run game on a\nOl' Dirty Bastard, live and uncut\nShame on a nigga, who try to run game on a\nOl' Dirty Bastard, live and uncut", "image": "https://images.genius.com/c2f0c65308ef9f95f6a627d77e707a6d.1000x1000x1.png"}], "artist": "B.o.B"}