{"songs": [{"title": "Go DJ", "album": "STN MTN / Kauai", "year": "2014-10-03", "lyrics": "[Intro]\nYo I want to give a special shout out to DJ Drama, for letting me do this\nI really appreciate it (And it's like this)\nHey go DJ! (That's my DJ!)\nHey go DJ! (That's my DJ!)\nHey go DJ! (Uhh, yeah, uhh)\n\n[Verse]\nStuntin' 101, I'm doing shit that ya'll never done\nTalking from TVs and movies, these the choppers to Uzis\nNothing can bruise me, nigga this is more than a movement\nMy squad is forever, we ain't getting annulments\nNew song on your speakers got me getting enormous\nPlayed a performance, niggas getting paid on performance\nA lot of ya'll hate cause my women is gorgeous\nI mean they a work of art, something out of a portrait\nI mean I'm a work of art, all my verses is poetry\nNiggas is different, you chicken, we ain't fucking with poultry\nBunch of crab ass bloggers got me allergic to shellfish\nIf I fell off in a day, man, these niggas be helpless\nI be bringing on a plane 'till you lames get mailed it\nIt's ROYALTY and, nigga, I'm the king like Elvis\nI don't talk about it, let them niggas conversate\nWhat's the song about it? Give her D and smoke a J\nWe don't play, I'm so on a bench, money is the stench\nLet me vent, I'mma smoke 'em out, circles from her mouth\nWhat's my favorite sound? \"Oh my God I'm cumming\"\nSecond favorite sound? \"Oh that sound like money\"\nOh that sound like freedom\nOh that sound gon' need a feature but he didn't need him\nI'm coming back like Jesus, color Reeces Pieces\nThat's the money down here, we gon' need a Visa\nBread like he Anita\nThat's my DJ, thank you DJ Drama\nCame in this bitch like my baby mama\nI believe in karma so I run the summer\nAll I got is checks, check out all these commas!\nCheck out how I'm eating, it is very cool\nJames White a nigga, man I'm such a fool\nI'm doing me so cold, this nigga spitting so cold\nHis girl 20 years old, she know she 'bout to get choose\nThat rabbit hole, I'm talking shit, but I'm rapping though\nAnd that IRS and I'm taxing hoes and I saw the check\nAnd said \"add some o's, add some o's!\"\nWhy my clique so animal? Why my clique so Set It Off?\nAnd I'm Queen Latifah you know I'm eatin', I fucked it up\nNiggas think we ain't tough enough, niggas think we was born rich\nNiggas thinking a lot of shit, niggas don't know a wars coming\nNiggas don't know I saw something, killing trees, Paul Bunyon\nBunyon foot, foot clan, klans man... Alamo\nStream of conscious, I don't know\nFlow was done a long time ago, and I feel for niggas who save a ho\nI ain't got time and I'm throwing up like gang signs\nBut that was not the case\nYou niggas wish your lifestyle was nice as my place\nI'm eating off these white kids, I don't need their plate\nWe burning down that blue dream, she sitting on my face\nI'd leave it on her backside, but that'd be a waste\nThat be a waste, that be a waste\n\n[Outro]\nFirst I want to give a shout out to DJ Drama\nI really appreciate it\nI wanna give a shout out to DJ rhêtorík\nHe did all the cuts and all the scratches\nFrankie Robinson out there in Chicago\nLeandro Rush, and T in Ohio\nYesi Ortiz, these are all DJs\nE-man, LA Leakers, DJ Reflex\nEverybody out in LA, Felli\nPeter Rosenberg, Cipha Sounds\nEverybody at Hot 97\nEverybody at Power 105\nPeople down at V103\nDJ Iceberg over at Hot\nYou've been fuckin' with me since the beginning\nMelody McCloskey\nRyan Sarver\nOwen Brainard\nKrutal\nMatt Mullenweg\nSergey Brin\nJack Dorsey\nAngela Benton\nThat's about it, I'm sure there's people I forgot\nBut, you're appreciated regardless\nI hope you enjoy the mixtape\nAnd then I woke up", "image": "https://images.genius.com/77a2349de407b4d4690746b19b39f6dc.500x500x1.jpg"}], "artist": "Childish Gambino"}