{"songs": [{"title": "Heartless (Live From VH1 Storytellers)", "album": "VH1 Storytellers", "year": "2010-01-05", "lyrics": "Heartless\nHow could you be so?\n\n[Hook]\nIn the night I hear them talk\nThe coldest story ever told\nSomewhere far along this road\nHe lost his soul\nTo a woman so heartless\nHeartless [x2]\n\n[Verse 1]\nHow could you be so\nCold as the winter wind when it breeze yo\nJust remember that you talking to me though\nYou need to watch the way you talking to me yo\nI mean, after all the things that we been through\nI mean, after all the things we got into\nAyyo, I know of some things that you ain't told me\nAyyo, I did some things but that's the old me\nAnd now you wanna give me back and you gonna show me\nSo you walk round like you don't know me\nYou got a new friend\nWell I got homies\nBut in the end it's still so lonely\n\n[Hook]\n\n[Verse 2]\nHow could you be so Dr. Evil?\nYou bringing out a side of me that I don't know\nI decided we weren't gonna speak, so\nWhy we up 3 AM on the phone?\nWhy do she be so mad at me for?\nHomie, I don't know she's hot and cold\nI won't stop, won't mess my groove up\nCause I already know how this thing go\nYou run and tell your friends that you're leaving me\nThey say that they don't see what you see in me\nYou wait a couple of months, then you gon’ see\nYou'll never find nobody, never find nobody better than me\n\n[Hook]\n\n[Bridge]\nTalk, and talk, and talk, and talk\nBaby let's just knock it off\nThey don't know what we been through\nThey don't know about me and you\nSo I got something new to see\nAnd you just gon’ keep hating me\nAnd we just gon’ be enemies\nI know you can't believe\nI could just leave it wrong\nAnd you can't make it right\nI'm gon’ take off tonight into the night\n\n[Hook]\n\nHow could you be so heartless? [4x]\nHow could you be so? [x2]\n\nIn the night I hear them talk\nThe coldest story ever told\nSomewhere far along this road\nHe lost his soul\nTo a woman so, a woman so…\n\nThere is no Gucci I can buy\nThere is no Louis Vuitton to put on\nThere is no Y.S.L. that they could sell\nTo take my mind out of this hell\nOr my heart out of this jail\nThere are no clothes that I could buy\nThat could turn, back in time\nThere is no vacation spot I could fly\nThat could turn back, a piece of real life\nReal life, I ask you tonight\nWhat does it feel like?\nWhat does it feel like, I ask you tonight\nWhat does it feel like?\nTo live a real life\nI just wanna be a real boy\nPinocchio's story goes, to be a real boy\nPeople say, you keep it too real boy\nPinocchio's story goes, to be a real boy\n\nWith a woman so heartless\nSo heartless\nIs it my fault that I make you heartless?\nMaybe I made you heartless, but regardless\nThat don’t give you the reason to act retarded\nYeah we fall, but you started\nYou started\n\nNo, no, no, nobody knows\nNobody knows\n\nDid it have to go that far?\nDid we have to take it that far?\nYou say things some time that you just can’t take back\nTake back, take back\nYou’re gonna hit me one day, so take that, so take that\nAnd that’s something you just can’t take back\nTake back, take back\nNever do nothing you can’t take back, take back\n\nDoes this hurtful comment have a receipt?\nDoes this staggering piece of truth\nThat was never told, have an expiration date?\nOr can I take that back?\nTake that back\n\nAnd I guess it’s in the nighttime, I hear ‘em talk, talk\nThe coldest story ever told, the coldest story ever told\nThe coldest story ever told, the coldest story ever told\nEver told, never told\nWhen I say the coldest story I mean the voices in my head\nWhen I lay down in my bed, the voices in my head\nWhen another woman is beside me in my bed\n\nIn the night I here ‘em talk\nColdest story ever told\nSomewhere far along this road\nHe lost his soul\nTo a woman so heartless\nHow could you be so heartless?\nDid I make you be heartless?\nDid I make you be heartless?\n\n50, look at me now\nSinging on the ground\nWith my pink shirt on\nDoes this look gay to you?\nWell, I don’t know what else to say to you\nLook at me now\nI’m on the ground\nAnd my heart can still not be found\n‘Cause I’ve looked all around\nAnd my heart will never be found\nI looked all around\nAnd my heart’s nowhere to be found\nWhere is my heart right now?\n\nWith a woman so heartless\nHow could you be so?\nHow could you be so heartless?\nHow could you be so?\n\nIn the night I here ‘em talk\nColdest story ever told\nSomewhere far along this road\nI lost my soul\nTo somebody so heartless\nHow could you be so heartless?\nHow could you be so heartless?", "image": "https://images.genius.com/3c0aee76b72a24d6c01e44a72adb029c.1000x871x1.jpg"}], "artist": "Kanye West"}