{"songs": [{"title": "We Be Clubbin’", "album": "The 24th Letter", "year": "2001-01-01", "lyrics": "What you think gon' happen if I get Ice Cube\nTo do a joint with the wildest dog on the east coast? Man\nThey don't know. Heavy weight Def Jam\nClark world\n\n[Verse 1: Ice Cube, (DMX)]\nOnce again, it's on the motherfucking psycho\nIce Cube the don mega, with my nigga DMX\nHuh, a diamond in the rough\nPunk, he gon' stay in the rough\nEast meets west, it's going down\nYeah, we be clubbing\nWe be clubbing\nWe be clubbing, we be clubbing, we be clubbing\nI'm in the city bitch, we clubbing (nigga, what)\nI'm treated like the presidential motorcade\nTaking out the residential global persperation\nFreaky gyrations close to fornication\nNumbers get passed when asked information\nIntoxication faded inebriated\nDesignated driver liver than Macgyver\nBlocking freaks in all of 'em tens\nStallions get them to pile in\nSitting on 'lacs bitch we write raps\nBackdo' access you getting jealous\nStanding all in line with designer umbrellas\nBad fellas running with the East Side connection\nAny kind of club with a star check they weapons\nWho wanna sex DMX get naked\nFucking to security show us the exit\n\n[Hook: Ice Cube, (DMX)]\nHeavy hitters counting figures\nWe be clubbing\nMixing blunts and heavy liquors\nWe be clubbing\nFor all my live ass niggas\nWe be clubbing\nFucking all them gold diggers\nWe be clubbing\n(we be clubbing, we be clubbing, we be clubbing)\n\n[Verse 2: DMX]\nDMX, Ruff Ryders\nGrrr, grrr\nAll I do is import to export transport to west port\nA nigga still breathing today cause the vest\nCaught them slugs you sprayed at me now\nGet at me if you want more\nPut a fucking hole up in yo' back\nSo what's the front for?\nCome on baby we some noisemakers\nCatching niggas with bricks at am I ? ?\nComing through Las Vegas\nMade us wanted dead or alive\nOn mad niggas hit lists\nBut ain't a motherfucker come & get this\nWitness what's unheard of cold blooded murder\nThis hot shit'll have you smelling like a fucking burger\nAnd the shell from the twelve is all it takes\nTo make a nigga spin like twice & then fall\nYou call for help\nBut ain't none coming\nThe avmen slaughtered the robbery & gun running\nAnd when I'm done gunning we all gon' meet up at the club\nFucking with Cube it's nothing but love\nNigga, what!!\n\n[Hook]\n\n[Verse 3: Ice Cube, (DMX)\nNew York get ya club on\nL.S. get ya club on\nChicago get ya club on\nAtlanta get ya club on\nFuck that shit\nIf the dog's off the leash then the dog's gonna bite (rooof)\nIf the dog's in the ring then the dog's gonna fight (rooof)\nIf the dog's on the west coast then I'm fucking with Cube\nWhere them hoes at nigga keep 'em coming in twos\nLike noah I make it wetter the doubleheader\nHit that ass like I got a vendetta you know it's better\nWith the don mega shake it off shake it off\nTake it off take it off and make it soft, biotch\nUhh, it's all good it's all right\nFuck all day fuck all night\nCall all my niggas cause wherever I go\nY'all my niggas east to the west coast all my niggas\nNow the east to the west\nPiece of the best sick of this shit (grrrrr)\nAdded DMX to add grit in this shit (grrrr)\nAtlantic to pacific spitting this shit (grrrr)\nGot love for my niggas that's getting a grip (grrr)\nWe be clubbing\n\n[Hook]", "image": "https://images.rapgenius.com/a4366ca22169cc286a183e693f3a6ee9.300x300x1.jpg"}], "artist": "DMX"}