{"songs": [{"title": "No Time to Chill", "album": "The Dream Merchant 2", "year": "2007-10-09", "lyrics": "[Rapper Big Pooh - Intro]\nYeah, yeah\nYEAH, WHA\nRAPPER! Uh, Phonte\nMr. Dream Merchant, yeah!\nUh, I know you see me\nYeah, I know you hear me\nSh'yo, I know you fear me\nListen, sh'yo...\n\n[Rapper Big Pooh]\nMy pen packin a venom, heart pumpin the sound\nMa, I'm pimpin the system, my catalogue is the hound\nGot a problem we air 'em, intellegent and I scare 'em\nBeat knockin they hear 'em, why in earth did they pair 'em?\nNiggas spittin that fiction, addicted to my diction\nWanna know what I'm fixin, try peepin the kitchen\nWhat the game's been missin, not a thing if you ask\nBeen here for years, you decided to pass\n\n[Phonte]\nUh, I'm here wit Pooh in the lab, Khrysis on the boards\nStill spittin all the real shit the ladies adore\nWhen he come in the door, all eyes on moi\nFrustrated cause they cain't believe we came so far\nButt dick ridin niggas, it's a big faux pas\nNiggas axein Pooh like, \"'ey, is that 'cho car?\"\nBut I tell 'em to chill, let my niggas just breathe\nCause by that look on your face, you got your heart on your sleeves\n\n[Hook: Rapper Big Pooh] (Phonte)\nYo, it's time to live, and a time to die\nIt's a time to laugh and it's a time to cry\nIt's a time to break, and it's a time to build\nBut no time to waste, no time to chill\nYo, it's time to live, and a time to die (Cause it's the real....)\nIt's a time to laugh and it's a time to cry (Hip-hop, hip-hop....)\nIt's a time to break, and it's a time to build\nBut no time to waste, no time to chill\n\nFo' REAL (fo' REAL), fo' REAL (fo' REAL)\nFo' REAL (fo' REAL), fo' REAL (fo' REAL)\n\n[Rapper Big Pooh]\nI decided to stand, it's all a part of the plan\nBroke free from the suits, no longer part of the scam\nCause you called it a FLIM, but you part of the flam\nThey like, \"Pooh, you fo' real?\" Muh'fuckers I am\nCause I mean what I say, and I say what I mean\nYou either right or you wrong, it ain't no \"in between\"\nThere's no 'us' in machine, still gettin that cream\nStill makin a record, still livin a dream\n\n[Phonte]\nI'm still in your magazines, all your Vibes and Billboards\nStill got the hater niggas sayin they still bored\nStill got the real niggas sayin, \"He still raw\"\nAnd still goin places that you niggas would kill for\nThis rap shit is natural to me, dawg it's like breathin\nIt's like candy to a baby, dawg it's like teethin\nIt's like all you niggas crazy, you are not even\nOn this level, homie stop dreamin!\nFo' REAL! (Fo' REAL!), Fo' REAL! (Fo' REAL!)\nFo' REAL! (Fo' REAL!), Fo' REAL! (Fo' REAL!)\n\n[Hook]\n\n[Phonte - Outro]\n(Cause it's the real...) Let the windows down, niggas\nLet them down...(Hip-hop, hip-hop....)\nLet the windows down, I promise it's gon' sound better...\nLet it GO...", "image": "https://images.genius.com/c79a4d23ca0ae75f715c34ad0ae3825a.492x486x1.jpg"}], "artist": "9th Wonder"}