{"songs": [{"title": "When You Hear The", "album": null, "year": null, "lyrics": "Alchemist, fuck is the deal nigga?\nUh-huh, yeah\nYeah, when you hear the\nYeah\n\nP yeah, you heard of him, big ignorant chains and sports cars\nGallons of Bacardi, been at the awards\nI need a bitch like Christina Aguilera for a broad\nI know I can splack that, she dyin' for a thug\n\nAnd she heard of me, she know about my Infamous life\nShootouts in New York with various types\nFast money, faster guns, we party e'ry night\n'Cause we perform, e'ry day of the week for that price\n\nWho you know got a similar catalogue\nAnd still sound brand new, like we just started?\nThe Carhatt Mobb, Guess jean team\nForty inch chain gang, volume please\n\nSo these people can hear the sounds of Queens\nI make your arm hairs stand up, it had to be me\nMixed with the A L C and H A V\nN.Y.C. to L.A., we do our swing\n\nE'rybody have a ball, e'rybody party\nE'rywhere you turn it ain't nuttin' but phatties and hotties\nE'rything is all love 'til you try to try me\nThat's when I make e'rybody\n\nWhen you hear the, it's on\nWhen you hear the, it's on\nWhen you hear that, it's on\nWhen you hear that, it's on\n\nYo I'ma glow, like a dirty bomb, jux, with the certy arm\nRippin' anything, that you motherfuckin' hear me on\nAdd it to the catalogue, heavy hitters had the song\nNiggas showin' no feelings and me, got 'em camoflauged\n\nYou little babies so emotional\nAnd tip-toe around the beef until that toast to you\nAin't got no problem in smokin' you\nEnemies I could deal with, be the ones that's close to you\n\nAnd do, what I'm 'posed to do, approach Duke\nWhy you fagots only squeezin' from out, the vocal booth?\nKnow my style be that over proof, open the Coupe\nOpen your face was talkin', wasn't talkin' to you\n\nAnd now the medics gotta mind to your face, tyin' the lace\nYou tellin' that a D.A. got 'em tryin' the case, yeah\nBottom line you cowards is ass\nKnow Mobb good in numbers y'all music is trash\n\nWhen you hear the\n\nWhen you hear the, it's on\nWhen you hear the, it's on\nWhen you hear the, it's on\nWhen you hear the", "image": "https://images.genius.com/42d069fe8357b9423abc0b46d79ba08d.398x398x1.jpg"}], "artist": "Mobb Deep"}