{"songs": [{"title": "Come Up", "album": "California Republic", "year": "2012-04-05", "lyrics": "[Hook: Drake]\nYou tryna come up, I am the come up\nI be standin' right here when the sun up\nYou be gettin' done up if you niggas try and run up\nYou livin' good, go 'head and throw your one up\nYou tryna come up, I am the come up\nI be standin' right here when the sun up\nYou be gettin' done up if you niggas try and run up\nYou livin' good, go 'head and throw your one up\nScream out, blat-blat-blat-blatow, blat-blat-blat-blatow\nBlat-blat-blat-blatow, how ya like me now?\nI'm like blat-blat-blat-blatow, blat-blat-blat-blatow\nBlat-blat-blat-blatow, how ya like me now?\nIt go blat-blat-blat-blatow, blat-blat-blat-blatow\nBlat-blat-blat-blatow, how you like me now?\nI'm like blat-blat-blat-blatow, blat-blat-blat-blatow\nBlat-blat-blat-blatow, how ya like me now?\n\n[Verse 1: Game]\nMy nigga Funeral Fab told be back in '03\nRap ain't nothin' but cash, money, bitches, foreign cars and trees\nCristal by the cases, bad bitches by the flocks\nI know I promised my niggas I'd never leave the block\nBut, shit changes\nI done been through six Ranges\nHand on the Eagle, yeah I got them Mike Vick fingas\nThrowin' bullets on par with the accuracy\nHit your whole faculty, like, ain't nobody jackin' me\nBefore you do, you be layin' in a box\nWhile Jay kiss that ass goodbye, *mwuah*, locks\nFirst shot, leave the niggas in shock\nThat second shot, that's when that body drop (Ya heard me?)\nAnd niggas still askin' 'bout Detox\nI'll tell you if you tell me who killed Pac\nAight then, I'm at this Pacquiao fight then, with Tyson\nThe way he's stickin', and movin' the knife, Floyd might win\n\n[Hook]\n\n[Verse 2: Lifestyle]\nTestarossa, keep an extra toaster\nIt's Hub city's finest, they respect the mostes\nMy nigga Game do that, my nigga Tyga do that\nHeard about the new cat, I whipped the Range through that\nI'm in Toronto, DeMar got a condo\nSittin' courtside with Drake, Hector and Rondo\nBitches know my name, it's Lifestyle, she fuck with that\nMy dick's too big, like my lifestyle, you fuck with that?\nPoppin' champagne, we do the damn thing\nStandin' on the couch, it's money Game, that's the campaign\nBig in my pocket, Obama on my wrist\nAt the Ronald Reagan airport, yeah, I'm on my shit\nLouis Vuitton luggage, peanut butter with the red wheels\nStarted when the RED Album dropped, I'm gettin' head still\nIn the club, lookin' past you niggas\nThese bitches gas them niggas, Drizzy, ask them niggas\n\n[Hook]", "image": "https://images.genius.com/e6b76fdc2635fdc0e9d62ceb9907eb3c.750x750x1.jpg"}], "artist": "The Game"}