{"songs": [{"title": "Who Got the Camera?", "album": "The Predator", "year": "1992-11-17", "lyrics": "[Verse 1]\nDrivin down the motherfuckin highway\nThe flyway, \"Hey, bitch, you goin my way?\"\nNow I got a passenger\nI looked at the miniskirt, and I'm askin' her\n\"Would you like to hit the fat bud?\nOr perhaps can I run your name through the mud?\nI mean, Are you giving up the nappy dugout?\"\nShe said, \"No,\" \"Well then, get the fuck out!\"\nCause I know where the hoes be fienin'\nPlus your fat ass got my six-deuce leanin'\nBust a U on the avenue\nWhy oh why there ain't shit to do\nBumping Sir Jinx's latest mix\nAnd you thought that shit played out in eighty six\nLookin for my dogs\nLooked up in the mirror being followed by the hogs\nOne time's on my motherfuckin line\nWhy the fuck the swine had to get behind a nigga like me\nThey must think it's a G(ank)\nThey both walk up with the G-L-O-C\n(Get out of the car! There was a robbery; the nigga looked just like you. All right, put your hands up, take your pants down, spread your cheeks.)\nStarted they investigation:\nNo driver's license no registration\nWhen I stepped out the car they slammed me\nGoddamn y'all who got the camera?\n\n[Hook: repeat 2X]\n\"Oh please, oh please, oh please, just gimme just one more hit\"\n\"Oh please, oh please, oh please, just gimme just one more hit\"\nWho got the camera?\n\n[Verse 2]\nNo lights no camera no action\nAnd the pigs wouldn't believe that my slave name was Jackson\nHe said, \"Don't lie to me\"\n\"I'm looking for John, Matty, or Spike Lee\"\nThe motherfuckers called for back up\nI guess they planned to beat the mack up\nHe called me a silly ass thug\nAnd pulled out his billy ass club\nTearin up my coupe lookin for the chronic\nGoddamn nobody got a Panasonic?!\nFound an empty can of Old Gold\nCame around and put my ass in a choke hold\nFucked around and broke my pager\nThen they hit a nigga with a Taser\nThe motherfucking pigs was trying to hurt me\nI fell to the ground and said, \"Lord, have mercy!\"\nThen they hit me in the face y'all\nBut to them it ain't nuttin but (a friendly game of base ball)\nCrowd stood around I said \"God damn ya\nWho got the camera?\"\n\n[Hook]\n\n[Verse 3]\nI knew when I saw that deputy smirkin'\nThat they was gonna put some work in\nMr. law had to hit me in the jaw\nCause I called them faggots with guns and badges\nThey played rat-a-tat-tat on me head\nBut if I had the gatty-gat-gat they'd be dead\nA victim of a big fat 187\nAnd little devils don't go to heaven\nLast night it was eleven but they wasn't scarin me\nSo they tried the flashlight therapy\nI looked at the black one and called him a traitor\nI don't give a fuck if you got a Beta\nJust take my fuckin picture\nSo I can go downtown and pitch a bitch about\nThe one that called me a spook\nHis name is Officer David Duke\nIf the crowd wasn't around, they would've shot me\nTried to play me out like my name was Rodney\nFuckin police gettin badder\nCause if I had a camera, the shit wouldn't matter (bitch)\n\nUhh, who got my nine\nWho got my nine\nY'all done did it this time, uh\nWho the fuck got my nine?", "image": "https://images.genius.com/aa204256470ef9ed3c3a3fbcc1ee43da.1000x1000x1.jpg"}], "artist": "Ice Cube"}