{"songs": [{"title": "​i (Alternate Version)", "album": null, "year": null, "lyrics": "[Intro]\nWe're livin' in a gold bar (Runnin' to the right law)\nDuckin' in the trap (Duckin' in the trap)\nLivin' in a group (Livin' in a group)\nWatchin' TV (Watchin' TV)\nDedicated to the homies in the pen, hit me\n\n[Verse 1]\n(Hey, hey, hey)\nUh, this is a word premiere, this is a world premiere\n(Hey, hey)\nUh, I done been through a whole lot\nTrial, tribulation, but I know God\nThe Devil want to put me in a bow-tie\nPray that the holy water don't go dry, yeah, yeah\nAs I look around me\nSo many motherfucker want to down me\nBut an amigo never drowned me\nIn front of a dirty double-mirror they found me\n\n[Hook]\nAnd I love myself\nHo, when you're lookin' at me, uh, I tell me, \"What do you see?\"\nI love myself\nAh, I put a bullet in the back of the back of the head of the police\nI love myself\nUh, illuminated by the hand of God, boy, it ain't that high\nI love myself\nUh, one day at a time sun gon' shine\n\n[Verse 2]\nEverybody lookin' at you crazy (Crazy)\nWhat you gon' do? (What you gon' do?)\nLift up your head and keep movin'? (Keep movin'?)\nOr let the paranoia haunt you (Haunt you)\nPeace to fashion police, I wear my heart\nOn my sleeve, let the runway start\nYou know the miserable do love company\nWhat do you want from me and my scars?\nEverybody lack confident\nEverybody lack confident\nHow many time my potential was anonymous?\nHow many time the city makin' me promises?\nSo I promise this, huh\n\n[Hook]\nI love myself\nWhen you're lookin' at me, I tell me, \"What do you see?\"\nI love myself\nAh, I put a bullet in the back of the back of the head of the police\nI love myself\nUh, illuminated hands of God, boy, don't seem shy\nI love myself\nOne day at a time sun gon' shine\n\n[Verse 3]\nWant to say it's a war outside, bomb in the street\nGun in the hood, mob of police\nRock on the corner with a line for the fiend\nAnd a bottle full of lean and a model on a scheme\n(These days of frustration keep y'all on tuck and rotation)\nAw, man, I duck these cold faces, post a fee-fi-fo-fum basis\nUh, dreams of reality's peace\nBlow steam in the face of the beast\nSky can fall down, the wind can cry now\nStrong in me, I still smile\n\n[Hook]\nI love myself\nUh, when you're lookin' at me, uh, I tell me, \"What do you see?\"\nI love myself\nAh, I put a bullet in the back of the back of the head of the police\nI love myself\nUh, illuminated by the hand of God, boy, don't be shy\nI love myself\nOne day at a time sun gon' shine\nEverybody, hit me\n\n[Bridge]\nWalk my bare feet (Walk my bare feet)\nDown, down valley deep (Down, down valley deep)\nFee-fi-fo-fum (Fee-fi-fo-fum)\nMy heart undone (My heart undone)\n\n[Interlude]\nAw, man, ay, check this out\nIt's a real Compton thing goin' on right now\nYou feel what I'm talkin' 'bout? You dig that?\nSometime I just feel a little bit b-beside myself\nYou know what I'm talkin' 'bout?\nThis here's the return of Enoch\nAnd we gon' do it to y'all like this\nHere we go, one, two, three, hit me\n\n[Hook]\nI love myself\nThe world is a ghetto with big guns and Dickies signs\nI love myself\nBut it can do what it want whenever it want and I don't mind\nI love myself\nHe said I got to get up, life is more than suicide\nI love myself\nOne day at a time, the sun gon' shine\n\n[Verse 4]\nI went to war last night with an automatic weapon\nDon't nobody call a medic\nI'm a do it 'til I get it right, war last night\nI've been dealin' with depression\nDuckin' every other blessin', I can never see the message\nI could, I could never take the lead, never bob and weave\nNegative is lettin' them annihilate me\nEvident I'm movin' at a meteor speed\nFinna run into a buildin' there\nMoney in the ceilin', lay my body in the street\nPass me to the buildin' of the holy unseen\nPass me to the feelin' of the holy unseen\nSeen enough, make a everybody scream, \"I love myself\"\n\n[Bridge]\nI lost my head\nI must've misread what the good book said\nOh, woes be me, it's a jungle inside\nGive myself again 'til the well runs dry\n\n[Interlude]\nYG, chicken wings, I love myself\nI love myself, I love myself\nAw, man, ay, ay, homie\nI told you it's straight up a Compton thing\nYou dig what I'm talkin' about?\nAnd this here's dedicated to the homies\nY'all feel what I'm sayin'?\nSometimes I just get besides myself\nThe return of the Enoch is back\nYou hear what I'm talkin' 'bout?\n\n[Verse 5]\nUh, I've been lookin' for you my whole life\nAppetite for the feelin' I can barely describe\nWhere you reside?\nIn a woman, is it in money or mankind?\nSomething's got me losin' my mind\nWhere you at? From the front to the back\nI'm lookin' for you, I react only when you react\nI thought I found you back in the ghetto\nWhen I was seventeen with the dirtiest pistol\nMaybe you're in a dollar bill, maybe you're not real\nMaybe only the wealthy get to know how you feel\nMaybe I'm paranoid, ha, maybe I don't need you anyway\nDon't lie to me, I'm suicidal any day\nI could be your advocate\nI could speak for you if you tell me what the matter is\nI could preach for you with the mighty tongue\nI'm the one, how can I overcome\nNegative energy, more like infinity, and survive?", "image": "https://images.rapgenius.com/eceef24e6238f4b9e2964245744e6068.1000x1000x1.jpg"}], "artist": "Kendrick Lamar"}