{"songs": [{"title": "Purple Coming In", "album": "56 Nights ", "year": "2015-03-21", "lyrics": "[Hook]\nComing in, coming in, coming in, let's go\nYah, yah-yah, yah-yah-yah\nI'm good on that yellow, yellow\nI'm good with that yellow, yellow\nI'm good with that red and yellow, nigga\nI'm good with that red and yellow, nigga\nPurple be coming in\nWe got that purp coming in, we got that purp coming in\nThe purple be coming in, purple, purple, purp, purp\n\n[Bridge]\nI'm good with that yellow, yellow, nigga\nI'm good with that yellow and red, nigga\nI'm good with that yellow and red, nigga\nI'm good with that yellow and red, nigga\nThat purple be coming in, that purple be coming in\nThat purple be coming in, that purple be coming in\n\n[Verse 1]\nThat purple be coming in, yeah\nI poured up a dirty Sprite again\nI pop on these Percs and Vicodins\nThey check on that check like a Yeezy\nCame from straight out them trenches, they greasy\nFuck a bitch I'm the shit, I don't need her\nFell in love with that drank and I need it\nI sip out my cup and I need it\nI grew up in the rut and I seized it\nSip the four of that Tuss' out in Cleveland\nThey can't blame me for takin' these doses\nPoured it raw out the pint in the Fanta\nTryna dodge all these scandalous heathens\nThey never gone doubt me, now they believe me\nThey try to forget about me now I'm kinging\nThe greatest story ever told\nThese pretty hoes gettin' exposed\nGot my styrofoam in my hand\nFuck all these bands up\n\n[Hook]\nComing in, coming in, coming in\nI'm good on that yellow, yellow\nI'm good with that yellow, yellow\nI'm good with that red and yellow, nigga\nI'm good with that red and yellow, nigga\nPurple be coming in\nWe got that purp coming in, we got that purp coming in\nThe purple be coming in, purple, purple, purp, purp\n\n[Bridge]\nI'm good with that yellow, yellow, nigga\nI'm good with that yellow and red, nigga\nI'm good with that yellow and red, nigga\nI'm good with that yellow and red, nigga\nThat purple be coming in, that purple be coming in\nThat purple be coming in, that purple be coming in\n\n[Verse 2]\nWalk into Barney's I'm drinkin' on yellow\nValet the four-door, a hundred at the door tho\nI speak the lingo, they know ‘bout the lingo\nFuck you lil nigga, I'mma fill up arenas\nWashin' the money at the cleaners, it's dirty\nYou drink out my cup and it's dirty, I come from the dirty\nYou drink out this cup and it's dirty\nI got codeine in my bladder\nI get it in like a real one\nYou whip in a Benz and they feel you\nIt's too much finnessin' you feel me?\nI went at that money, no supervision\nThey love me the day they gon' really feel me\nI see how they act when they playin' dirty\nForgivin' me, never forgettin' me\nI know that paper gone be there, I stack it\nA monster, a beast, I'm corrupted, a savage\nThat 2016 gotta have it\nThat bitch want Celiné, she can have it\nPay three for that purple, if you want it, you get it\nTwo dollars a drink, on that purp you can get it\nFuck on me, suck on me, baby lets pour up\nFuck on me, suck on me, baby lets pour up\n\n[Hook]\nI'm good on that yellow, yellow (po-up)\nI'm good with that yellow, yellow (drank)\nI'm good with that red and yellow, nigga (drank)\nI'm good with that red and yellow, nigga\nPurple be coming in (po-up)\nWe got that purp coming in, we got that coming in that Actavis\nThe purple be coming in (Actavis) purple, purple, purp, purp\n\n[Bridge]\nI'm good with that yellow, yellow, nigga\nI'm good with that yellow and red, nigga\nI'm good with that yellow and red, nigga\nI'm good with that yellow and red, nigga\nThat purple be coming in, that purple be coming in\nThat purple be coming in, that purple be coming in\n\n[Outro]\nHa-ha-ha-ha-ha-haaaaa my nigga Es-ko-mo! Got it all. Got ya damn scarf on and shit! oh Shit nigga oh god you know the sauce bruh I'm just tryna get it how you get it baby you backstage nigga. You seen this shit nigga. Man fuck all that I been up 56 nights straight jack! You still got some no-sleep? Man and we just scratched that off the board man fuck fuck man you can have all them zips. I can have all them? So look look you just hold that, that ounce. And then just take this picture for the gram. What the fuck? And then post it on yours man and then niggas, niggas will know the streets will be fucked up. Aight got it Abu I got to go. And you tell me if this shit got you hallucinating, seeing monsters. I got you on the Instagram tho bruh! 56 nights straight! Uh just see if we can lock in an Instagram picture man and you follow me. Uh on my Instagram. Tag me in it tho!", "image": "https://images.genius.com/e155f7e9ea6bfa62e91c597936cf0536.500x500x1.jpg"}], "artist": "Future"}