{"songs": [{"title": "Hit It From the Back", "album": "Juvenile Hell", "year": "1993-03-09", "lyrics": "[Intro: Havoc]\nUhh, yeah\nHow we hit it?\nCheck it out\n\n[Verse 1: Havoc]\nShorty don't front, you better act like you're widdit\nFrontin like you never did it, bitch admit it\nMatter fact, shut the fuck up and turn around\nIf you still got walls I'mma tear the shits down\nJust one of few brothers vigorous with the dick\nPrepare to stay long, cause I don't cum quick\nLittle or big, I tear that ass out the frame\nTalkin like you're ill, but the shit is all game\nYou're weak on top, you can't ride like a stallion\nHit it from the back, then I'm audi 5000\nBut if you're ill we can chill smoke the fat Phil'\nA little somethin just to make shit real\nOff with the light, fuck a invite, just make sure\nYou don't got the period, cause I don't want red lights\nAight? You know my motherfuckin' steelo\nRippin from the back, bitch you know how we go\n\n[Chorus]\nHit it from the back (3X) Like dat!\nHit it from the back (3X) Like dat!\n\n[Verse 2: Prodigy]\nUhh, knowmsayin?\nCheck it out, word is bond\nKnowmsayin, gonna flip it like dis\nRink-a-dink, rink-a-dink dinky dink\nI used to hit raw daddy, but now I carry packs of three\nBulletproof I refuse to let the monster get me\nI'm in, hit it from the back like that\nShorty black never tap no skins that look wack\nI got mad game like Twister, nasty little mister\nQuick to talk dirty to a sister\nI met the shorty at the Skate Key\nWhat's her name? Nevermind, cause she might try to sue me\nJuiced her up, took her to the projects\nSo uh, if she was with it maybe we could have sex\nYou know what happens next, drop to your knees\nBitch caught a bone ? spin I win\nAs she starts to proceed, she said she wanted me\nTo drop a seed, I told her parlay and just be\nCause cunt little stunt with my butter dick shorty\nYou talk too much, so lay back and enjoy the blunt\nI put it in her, she starts to wild\nShe said slow down, I said this is shorty wop style\nA versatile, rough sex, fuck love makin\nFlip the script shorty, and flip yourself over\nOn your hands and knees Cochise\nFrom the back I don't shoot blanks and I'm out black\n\nHit it from the back (3X) Like dat!\nHit it from the back (3X) Like dat!\n\nHit it from the back (3X) Like dat!\nHit it from the back (3X) Like dat!\n\nWorrrrrrrrrd, yeah\nUhh, whoo! Knahmsayin?\nFrom the back\nI like dat (I like dat)\n\n[Hook] x1\n\nHit it from the back (3X) Like dat!\nHit it from the back (3X) Like dat!\n\nHit it from the back (3X) Like dat!\nHit it from the back (3X) Like dat!\n\nShorty don't front you better act like you widdit (2X)\nStrictly back shots you better act like you widdit..\nYeah, knahmsayin? Just buggin out\nStupid bitch\nFrom the back, word up\nUh-huh, check it out\nWhat we gon' do is flip it like this\nCheck it, bust how I do\nYea yea uh-huh", "image": "https://images.genius.com/e2162efbff4db2c3b108ea6c0af96c0c.500x498x1.jpg"}], "artist": "Mobb Deep"}