{"songs": [{"title": "Monster Freestyle", "album": null, "year": "2010-09-15", "lyrics": "[Produced by Kanye West, Mike Dean & Plain Pat]\n\n[Verse]\nNigga tell the world I’m Compton, Compton\nNigga, I’m Compton\nBig ass condom, mothafuck ya problems\nMake sure that you don’t bring ya man to my concert\nI want you to suck my whole band after concert\nCompton, Compton\nNigga, I’m Compton\nBig ass condom, mothafuck ya problems\nI’m killin’ every instrumental and I cosign em\nAnd no 360 deals, see that's advance at McDonald’s\nI spazz like a wino\nTime and time again I often wonder where the time go, my daddy and my mom know\nI stomp a rapper like a Kappa or beat him like a congo\nThen speed off in a Bronco, OJ\nOften reminisce about the old days, Hardaway/Alonzo\nBack then we was wearing LA Gears with the rhinestones\nNowadays I’m coming headfirst like a rhino\nI rhyme like I invented it my wordplay is unlimited\nNow nigga spin my vinyl, club going apeshit\nRap like I ain’t ate shit, shit on any A-list\nArtist you a novice I’m recording on a spaceship\nAnd we never nodded to your sing-le, King K\nD.O.T. is E.T.A. Primetime, new clothes\nCloseminded niggas getting clotheslined, I suppose\nBitch I think I’m 2Pac\nBitch I think I’m B.I.G\nBitch I think I’m Eazy-E, I’m Big L and I’m ODB\nAnd OMG I might OD, yeah that be my new tape\nThat’s appreciation tape, thanks for knowing that I’m great\nMiddle finger to the fake… FUCK YOU!\nI’m the center of attention Hut 1, Hut 2\nAnd my bitch a mutt too, mixed with all types of shit\nGot the keys to her pad like I’m bout' to type and shitt\nGot em all hype and shit, I ain’t even do nothing\nScreaming out “fuck the world”, tell you when I’m through nutting\nCompton, Compton\nNigga, I’m Compton\nBig ass condom, mothafuck ya, momma!\nI go inside the studio and suicide bomb ya!\nI bomb on Obama if that nigga get in my way\nI’m smelling some vagina, ya niggas some clitoris\nMust be already dead, saying I ain’t killing it\nI’m in the lead and winning it, feeling like a stunt double\nI'm convinced we already in hell, pass the blunt devil\nYa talking Illuminati I’m talking eliminating\nEveryone including Satan, Lord knows heaven waiting\nI’m the best rapper alive!\nI’m the best rapper alive!\nI’m the best rapper alive!\nTell Wayne to swallow his pride\nYa niggas talking that jive\nI’m talking that Malcolm X\nMartin Luther hustles through ya ripping through ya fucking set\nI’m the best rapper alive!\nI’m the best rapper alive!\nI’m the best rapper alive!\nJigga man should’ve retired\nI’m going after Kanye, Lupe Fiasco, and Nas\nSnoop Dogg and mister Andre, Eminem, Busta Buss Rhymes\nY'all better bust no more rhymes\nI’ma start busting your ass\nIf you walk with a mac truck, then throw a bus on your ass!\nYa’ll be no action, no pass\nWe gon’ start busting on niggas\nChoppers be bustin’ on niggas?\nChopper be bustin’ on niggas!\nFuck you and fuck you fuck niggas\nI’m do this for Soul-o\nAin’t not countdown fuck with us\nTDE that’s the logo\nAnd your bitch be my promo\nYeah she know my whole tape\nI’ma make a nasty movie and make sure that ho tapes\nThey be like oh no wait, he’s bout' to take the whole cake\nYou goddamn right, gotta big appetite with a big tapeworm every day I yearn another meal, I’m hun-gray\nGive some to my ho-mays\nNigga we made men and cavemen, living in the stone age\nI got this ignorant type shit, from my uncle Tony\nAnd may my nigga rest in peace\nFrom heaven, I know you see I’m Compton, Compton\nNigga, I am Compton\nA big ass condom, mothafuck LAPD, DA, and your honor got pumped up on Alondra\nTrap my body, free my mind\nHoping ya’ll could see the sign", "image": "https://images.genius.com/25d8a9c93ab97e9e6d5d1d9d36e64a53.1000x1000x1.jpg"}], "artist": "Kendrick Lamar"}