{"songs": [{"title": "Freestyle 4 (Remix)", "album": null, "year": null, "lyrics": "[Intro: Kanye West & (A$AP Ferg)]\nThis that rap god shit nigga\nI rip every one of these mothafuckas down\nAye\nRah, (yeah), rah, rah, (uh)\nRah, rah (yeah)\n\n[Verse 1: Kanye West + (A$AP Ferg)]\nClosed eyes (uh), see things\nFire up (yeah), tweaking\nYou in my (uh) freak dreams\nYou in my (yeah) freak dreams\nBad bitch, you dig that\nGet stacks, drive cars\nWhip out, bitch out\nTits out, oh shit (yeah)\n(My dick out)\n\n[Verse 2: A$AP Ferg]\nLately, I been fuckin' thin broads\nWho pussy get wet off in the winter\nYeezy season girls so bad\nMight pull my dick out and fuck the whole cast\nI'm ménage-in' at the garden\nPussy juice on my beard, James Harden\nI'm the meanest don that I walk in (that I walk in)\n(I'm the realest coming out of Harlem)\nMight pull up with Louis Farrakhan\nIn a Bentley coupe blacker than Akon (yeah)\nMight hit the club with The Nation\nIf I make it rain it take a day long (yeah)\nMight fuck your bitch on vacation (yeah)\nNew Gosha all my clothes A1 (yeah)\nI'm the reincarnated Trayvon\nWith a BAPE hoodie that zip up to my face, gone (right)\nSway I got all the answers (right)\nYams, Is chilling with my grandma (right)\nThey can have it with Donda (right)\nR.I.P to Ye mama (right)\nWhy they crucify Cosby? (yeah)\nWhy they scrutinize my peeps? (yeah)\nBlew the noises off my sphinx\nWhy they keep fuckin' with Yasiin?\nWhy they break all of our leaders? (yeah)\nTo make us all non-believers? (uh)\nTo make us all non-believers? (uh)\nThis ain't all for no reason (yeah)\nThey try to fuck up our lineage(right)\nThey think we dumb, they not seeing it (right)\nThe news is bull, I ain't reading it (right)\nHood Pope, I'm the new Jesus (right)\nI'm the new Jesus (right)\nI'm the new Jesus (right)\nI'm the new Jesus (right, yeah)\n(Hood Pope, I'm the new Jesus)\n\n[Verse 3: Big Sean]\nI tell a bitch quit playing\nStick to the plan (uhh)\nThen I take you out the dirt and turn it into sand\nJust trust in what I'm saying (and quit)\nQuit asking what's gotten into me\nYou don't need a nigga with them tender tendencies\nI think you need a lil' more Hennessy\nFuck your man, I'll be your sensei\nI could teach you how to keep the rent paid\nGot the schedule boomin', I mean poppin'\nPoppin' to the point the phone die in mid-day (brrt)\nBut I call you late night just to fall through\nBust a nut and then regret it like a nigga always do\nBut don't I always hit you with the hit back\nAnd if I ever fucked another bitch I pretended it was you\nI admit that, not saying that I did that\nChill, chill, chill, take it easy, Yeezy, don't be going all Kill Bill\nShow respect to the whole squad and Yeezy Yeezy\nI'ma give you everything you fucking needed\n\n[Outro: Big Sean]\nBelieve it\nStraight up\nWhoa, whoa, whoa", "image": "https://images.genius.com/70c6e506a91f6dabdd23cad304812ce3.533x533x1.jpg"}], "artist": "Kanye West"}