{"songs": [{"title": "Animal Instinct", "album": "Hell On Earth", "year": "1996-11-19", "lyrics": "[Intro: Havoc]\nNo doubt!\nYo, yo, y'know how we did on The Infamous album, right?\nAight, we gonna do it again son\n\n[Verse 1: Havoc]\nYo, laid up in the cut, watch these rap niggas fuck you up\nDig in shorty guts, get the bitch to set you up\nIt's the most trifle, 41st Side disciples\nTake kindness for a weakness so I won't be so kind to\nNiggas comin' through, I gave you birth kid, I'm sonnin' you\nThe Infamous got PC for days\nWe runnin' thru townships, fuckin' shit\nKid, we down shit\nHustle mad bricks, Queensbridge no doubt, rep the clique\n9-6 droppin' wild on some Benz's\nSome next shit, crash bar, ask the God\nI remember when loadin' up the gats, beef settlin'\nGhetto peddling the Sonder, shorty dead again\nSongs about 'We all around the NC'\nCop the E series, jealous ones envy\nHate to see me but got the nerve to wanna be me\nI bleach blind em, you can't see like Ste-vie\nI'm on TV, Vidbox and all that\nStill in the Bridge, now what's fuckin' with that?\n\n[Verse 2: Prodigy]\nTo all my Mobb crimey, money-hungry and grimy\nMobb sheisty, Godfather III and Gotti\nRapper Noyd, Ty Maxx and Ty Nitty\nScarface and Gambino, New York City\nIt's P live and direct, stab ya neck\nIce-pick bloodied up ya whole entire shit\nLive shit 1-9-9-6, ask your bitch\nMy crew run wild, snatch chains and bracelets\nYour time's wasted for figuring P\nThere's two sides of me\nSnake niggas obviously, you get lumped somethin' horribly and then we calmly guzzle Spumantely and Dom Pérignonly\nMove the crowds over, cruise the fuck out\nAfter GOD drinks had to shoot our fuckin way out\nSpark flyin' niggas dyin', bitches cryin' and shout\nMobb niggas to the exit, we out\n\n[Verse 3: Ty Nitty & (Gambino)]\n(Ty) 9-6 load up the clips, the Infamous apocalypse\nQBC on the L-I-E an sippin' Hennessey\nAnd Remy, V-S-O-P, Ty Nitty jiggy\nEyes forever chinky, up in the Mariott\nTonnes o' hydro, black tuxedo, lay low\nThe 5-0-migos, the gigolo, what nigga?\n\n[Verse 4: Twin Gambino]\nMy technique, official white meat\nInternal bleeding he felt, heat then cold feet\nQBC committee, Ty Nitty hit the safe\nThe Phillipino's have mad ice and gold plates\nWe escape, ain't no turnin' back to Stat\nPushin back-to-back acs, gettin' cheddar\nDrug smugglin' tri-state, catchin' faith\nWe don't hesitate, we regulate and evaluate, cut the cake!\n\n[Hook]\nMy crew worthy, blood sweat and tears\nAnd thirty years for years, extort niggas and drink beers\nTired of livin' life this way, crime pay\nBut for how long till you reach a downfall\nThug niggas surround Y'all, 4-pound Y'all\nAnimal instinct, these niggas gettin' clapped on instinct\nI'm tired of livin' life this way, crime pay\nBut for how long till you reach a downfall\n\nMy crew worthy, blood sweat and tears\nAnd thirty years for years, extort niggas and drink beers\nTired of livin' life this way, crime pay\nBut for how long till you reach a downfall\nThug niggas surround Y'all, 4-pound Y'all\nAnimal instinct, these niggas gettin' clapped on instinct\nI'm tired of livin' life this way, crime pay\nBut for how long till you reach a downfall\n\n(Nigga) Motherfucker!\nWord up!", "image": "https://images.genius.com/2c1555f27e44bd87876d75ca225fcb3a.600x600x1.jpg"}], "artist": "Mobb Deep"}