{"songs": [{"title": "Street Hop 2010", "album": "Street Hop", "year": "2009-10-20", "lyrics": "[Verse 1]\nI smoke good like a Rastaman\nAll around me, I'm on point like a octogon\nI'm the optimum, I'mma be eating\nUntil my belly stick out as far as the Octo-mom's\nI'm an abomination\nI'm an anomaly in conversation, I'm honoring confrontation\nWith a dime doing dominatrix on her\nDisrespect me – I'll wet you like condensation, water\nI'm a mixture between Chris Brown\nAnd Chris Jericho, where's your daughter?\nI'm more than y'all can handle\nAt the Grammy's I'll send an Indian girl to the podium\nTo say \"No, thank you\"\nLike Marlon Brando for Oscars, \"the Godfather\"\nOur father, you should praise me\nI got some syphilis nunchucks wearing a AIDS gi\nThat mean I'm sick when I kick shit\nCome to my concert get some sars on the tip of your ticket\nI'm super cold\nI don't spit, I shit, on your whole team\nThese niggas think I'm from Cleveland\nIt's something the way I be, dropping the Browns off at the Superbowl\nGame time, nigga let's hit the sto'\nAnd if I gave a fuck, this is where the hook would go\n\n[Verse 2]\nThis is Street Hop, no rules\nThe rest of y'all niggas watered down like O'douls\nI'm willing to do what you won't do, I'm old school\nI'm a mac, I punch rappers cause I'm Pro-Tools\nI hit your Pause button, I cease frontin\nYou don't start nothing, it still might be something\nYou don't want nothing? You might have something\nIf I go over your head, it's cause your ass ducking\nFuck the underground, I rhyme\nFor them fly mothafuckas that's up, that ain't tryna dumb it down\nFuck radio, fuck video\nI live by the Bust' Scenario, what the dealio?\nYou could stop listening, right now\nI'm pussy eating with bitches, I put the dyke down\nCause I'm a diamond, I'm llama rhyming, you Ramadan-in'\nSimon says that in my prime I'm here\nEverywhere I go it's a crime there\nWhile you on-looking at me in the lawn chair\nCocaine, propane\nI'm a living degenerate of the dope game\nRelate to it, though you thought you probably couldn't\nPut a face to the opposite of how the fake do it\nI'm hip hop's savior, the old faithful\nSick shit, stop you off that liquid like brake fluid, this is Street Hop", "image": "https://images.genius.com/13187be577e518c77f5c6ac278ec366a.1000x1000x1.jpg"}], "artist": "Royce da 5'9'’"}