{"songs": [{"title": "Take it to God", "album": "Spiritual Minded", "year": null, "lyrics": "[KRS-One]\nYeah, once again, word up urban inspirational\nKRS-One, Professor Ecks, whattup Dan? Woo\nTemple of Hip-Hop, let's do it\n\nBy the sound of the track, you know who is back\nIt's the teacher, philosopher of conscious rap\nRappers tired of me sayin where hip-hop is at\nCause they know they unoriginal, copycats\nWatch me bump this gospel rap, never wack\nIn fact, I tell you where the tracks is at\nTV is wack, they wanna show us beatin Iraq\nWhen the question is, is where is Chandra Levy at?\n\n[Professor Ecks]\nMurdered God and left for dead like hip-hop\nAnd admit to Condit like conduct, to kill Ecks the dread\nAnd Kris crucified the false prophet\nJohn F. Kennedy to these MC's, I draw and cock it\nCock on cocky cops for the love of the art\nPunish the part, partition\nPardon the pause, poison pens penetrate the mental\nI walk with Kris so my body's a temple\nBody instrumentals and body your squad in the body of a God\n\n[KRS-One]\nJust think, just think, what if Malcolm X returned\nOr Dr. King returned, tell me what have we learned?\nAs we takin our turn, tell me what have we earned\nOr is the ice and the cars our only concern\nMo' money, mo' money, you be yellin it out\nAnd on TV can't you see you be sellin us out\nSo in 2010, look to 2002\nWho you think they gonna respect, me or you?\n\n[Professor Ecks]\nBehold, the God, in the form of the man\nWalkin off water and (?) flesh absorbs in the sand\nMoor gets the land, divorcin the clan, I'm off into sand\nOff and I'm slayin delicate arms from porcelain hands\nSlaughtered the lambs, charge it to the game\nCats take hip-hop's name in vain\nDisrespectin the forefathers who came (uh-huh)\nGoddess hurt 'em right now, like when Marvin was slain\n\n[KRS-One]\nThey don't want it, nope, they don't need it, nope\nJust stay weeded and hope, I don't read what you wrote\nBest believe they ain't dope, they deceivin these folks\nWith they meaningless quotes, I got my feet on they throat\nWhat they speak is a joke, they really weak and they broke\nHave a seat and take notes, on the streets I'm the Pope\nMTV is they hope, they repeat what they wrote\nI'm an MC that won't, let them tempt me with coke\n\n[Professor Ecks]\nNope, flesh of my flesh, blessed by KRS\nUsed to love her, they (?) haven't made a date with death\nFollow no man, enslave the Ecks, Professin the student\nI vibe with the teacher obliged to drop (?) liver than heaters\nLyrics liable to eat us like the survivors of Jesus\nNow the, blind is the leaders, your styles is egregious\nGets now the brow beateth to underground emceeth\nThe game is overheated, overweeded, and misunderstood\n\n[KRS-One]\nWord, just a ride in they boat, with a platinum rope\nNo doubt, they sellin us out, what's happenin loc?\nQuit this rappin I won't, cause MC'n is dope\nIf I can't do it for the love then do it I won't\nHow many times we note when these rappers is dope\nSatisfied, that's why I'm renewin your hope\nBroaden your scope, when cleaned out your mind\nMy rhyme is like a new bar of deoderant soap\n\n[Professor Ecks]\nIn this land of men mice and mimes, I holds right for the laws\nLive life like Christ, makin bread from mics and applause\nThe snakes fight with Tyson like jaws for what's rightfully yours\nI might (?) 'em all, tell me - is it life or it's war?\n\n[*singer*]\nGoooyyyyiiyyyiyyyyod, Goooyyyiyyiyyyiiiod, Gooyyyyiyyiyyyod\nMy God, your God, our God.. is God, is God\nChange is gonna come, where you goin to run, but to God?\nTo God, run to God, run to God\nRun to God, and let him in your heart\nChange is gonna come, the change is gonna come\nMake it your change, run to God, in your heart\nLet God in your heart, he will fillt he part\nGoooyyyyiiyyyiyyyyod, in youuuuuuur heart\nTake it to God, take it to God God\nTake it to my God, your God, take it to God\nTake it to Goooyyyyiiyyyiyyyyod, take it to Goooyyyyiiyyyiyyyyod\nTake it to Goooyyyyiiyyyiyyyyod, take it to God\nJust take it to God, run and, take it God\nTake it to Go-awd", "image": "https://images.genius.com/d84f73e1b21b8b4dbd679efa191364e4.1000x1000x1.jpg"}], "artist": "KRS-One"}