{"songs": [{"title": "Oh No!", "album": "Lyricist Lounge 2 ", "year": "2000-11-28", "lyrics": "[Intro: Mos Def]\nOne for the treble, two for the bass\nWelcome to the great incredible paper chase\nKeep your boots laced if you want to keep pace\n\n[Hook 1: Nate Dogg]\nOh No!\nNiggas ain't scared to hustle\nIt's been 7 days, the same clothes\nAsk them originals cause they know\nMos Def, Nate Dogg and Pharoahe\nStep away from the mic they too cold\nThe funk might fracture your nose\n\n[Verse 1: Mos Def]\nSay my name, say my name\nObserve how I stake my claim, I independently lay it down\nAnd played my game, my own two raise my flame\nCause dickriding ain't my thang\nI earned what they said I wouldn't\nI got it the way they said I couldn't\nBut now I'm getting it and they whole grill is crooked\nMad cause I'm getting caked out from my bookings\nWhen y'all was asking permission I just stepped up and took it\nWhat!? The kid's better buy my rookie card now\nCause after this year the price ain't coming down\nAnd if you got a joint bubbling then get money now\nCause in a minute, there's gonna be some real trouble coming out\nJust a warning, as usual some cats won't heed it\nThe hard-headed always gotta feel it to believe it\nIt's a shame the jealous gaze is too short to see it\nBut when they face hit the cement, they nod in agreement\nWe could play nice and decent, or dirty like the 7-1 Precinct\nCall it a day or make it a long evenin\nYou keep on scheming, man give me some more reason\nTo have the women in your mama's church screaming \"Lord Jesus!\"\nHarder than y'all cause I'm smarter than y'all\nI know that deep down it's got to be bothering y'all\nPay attention, watch Flaco get larger than y'all\nPut your pride on the rocks, make you swallow it all\nThe mathematic problem for y'all, it just get harder to solve\nEvery day that the saga evolve\nThe do or die stay rumbling and bumbling hard\nAnd when we move, we ain't got no discussion at all\nEast coast on your neck and you ain't shrugging it off\nTry to bullyfoot and end up stumbling off\nI'm Daddy Brooklyn, y'all niggas are the sons of New York\nGetting spanked when there's too much trouble to talk\nRespect mine\n\n[Hook 2: Nate Dogg]\nOh No!\nLook at who they let in the back door\nFrom Long Beach to Brooklyn, they know\nWe rock from the east to west coast\nQueens, salute to Pharoahe\nStep away from the mic, they too cold\nThe funk might fracture your nose\n\n[Verse 2: Pharoahe Monch]\nVery contagious raps should be trapped in cages\nThrough stages of wackness, Pharoahe's raps are blazin\nAnd it amazes - me how you claim thug\nBut go two-ways without Skytel pagers\nI'm intellectual, pass more essays\nThan motorcade police parades through East L.A\nMore beef then deli's, thus what I vent is just\nWhat you lust to vent, it's irrele'\nHuh, hallelujah, Pharoahe Monch'll do ya\nMaintain the same frame of mind - screw ya!\nGet the picture, sit ya, seat ya, greet ya with scriptures\nI'm equipped to rip ya, reach ya\nPharoahe and Mos is verbal osmosis\nCoast to coast, we boast to be the most explosive here\nFerocious, the lyrical prognosis\nThe dosage is leaving you mentally unfocused here\nMC's just come on 'round!\nYou're the next contestants on \"Catch-A-Beat-Down\"\nDon't be hesitant, sound cracks the sediment\nIt's evident we medicine for your whole town\nSky's the limit, game's infinite when I'm in it\nAll windows is tinted\nHow you seeing me when I'm in it?\nRap, we got it on lock man, stop that\nPut that mic back down, boy, drop that\nPharoahe's flows blows shows like afros\nWe hate y'all though, that's why Nate Dogg goes\n\n[Hook: Nate Dogg]\nOh No!\nNiggas ain't scared to hustle\nIt's been 7 days, the same clothes\nAsk them originals cause they know\nMos Def, Nate Dogg and Pharoahe\nStep away from the mic they too cold\nThe funk might fracture your nose\nOh No!\nNiggas ain't scared to hustle\nIt's been 7 days, the same clothes\nAsk them originals cause they know\nMos Def, Nate Dogg and Pharoahe\nStep away from the mic they too cold\nThe funk might fracture your nose\nOh No!\nLook at who they let in the back door\nFrom Long Beach to Brooklyn, they know\nWe rock from the east to west coast\nQueens, salute to Pharoahe\nStep away from the mic, they too cold\nThe funk might fracture your nose", "image": "https://images.rapgenius.com/704254bba6be81d7d607f166ee93a864.500x500x1.jpg"}], "artist": "Yasiin Bey"}