{"songs": [{"title": "Lay Low", "album": "You Know What it Is Volume 3", "year": "2005-06-19", "lyrics": "[Intro: Snoop Dogg, Game & Techniec]\nYo, shut the fuck up. Pass me the blunt, bitch hold on\nEy-ey Game what's up nephew it's your boy big Snoop Dogg\nDoin' the loc on the coast on a toast of the Boogie popper\nYou know what it is, I know what it is, they know what it is\nWhile I'm at bitch, I'm over here at chuppa-chuppa yeah\nCountin' this Swiss Cheese, you know I'm talkin' bout?\nDoin' it big, OC, countin' Gs like I'm supposed to\nPut a Black Wall Street list. Gettin' money out that property\nYou know I'm talkin' bout? D.P.G.C nephew. You a real one nigga\nG-G-G-G-Unot, G-G-G-G-Unot\nFuckin, bitch ass niggas lay low and stay low G-G-G-G-Unot\nThe M.O.B. takin' over niggas, Techniec Hahahah\n\n[Verse 1: Techniec]\nIn the rain with the beat, stashed with the heat\nSmashed in the seat, sinkin' and thinkin' ya'll know the way I rhyme\nArmour on shined up, flossed out rhymed up\nGet your wife good and ball it up 'till your time up (west side)\nWant to kill him quick, put him in a filthy ditch\nRather be filthy rich, over a filthy bitch\nWasn't for the flows wouldn't be no hoes jockin'\nAnd breakin' their necks to get yours (Lloyd Banks where you at)\nSo I suppose Rockin' shows, knockin' hoes, Flockin, I'm clocking dough\nI control Rock-n-Roll, with soldiers on lock-n-load\nAnd they come through shoot it up, fist fight, loot it up\nTerrorize the future, it's truly number one who was us\nNo question we gon' bust Glocks in fast cars\nBlocks in Nascars, couple of bad broads\nWe got a feud with us, none 50 trust (money over bitches)\nYou bitches hit the bus, you niggas ease up\n\n[Chorus: Game]\nI heard another nigga from that G-Unit click talking shit\nShe's Tony Yayo\nAnd they kicked him out the house\nThat's the reason why he running his lips, he's on 50's payroll\nYou want to die all you gotta do is keep on fucking with Game\nMr. Yayo, you niggas snitches that's the reason I threw out my G-Unit chain, I ain't the po-po\n\n[Verse 2: Techniec]\nYou rap guys better stick to rap\n'Cause colliding with hood niggas that spit it\nWill get you so called killas clapped (Yayo)\nAnd you'll think it's the fans\nBut my niggas got the M-16, get loose in the stands\nTechniec on the side of the stage with a gauge\nAnd 4-4 long deuce-deuce in his pants So I'ma just fall back\nNigga I could lose you for a grand\nNo gunpowder, residue in the hand (west coast)\nThey want to see Tech fly, they rather see Tech in the can\nI spit grams, 'till the check in the hand\nWhen the Tec in the hand, respect my demand\nOr I'll find your set in a jam when the Tec will go blam (bitch ass niggas)\n\n[Chorus: Game]\nI heard another nigga from that G-Unit click talking shit\nShe's Tony Yayo\nAnd they kicked him out the house\nThat's the reason why he running his lips, he's on 50's payroll\nYou want to die all you gotta do is keep on fucking with Game\nMr. Yayo, you niggas snitches that's the reason I threw out my G-Unit chain, I ain't the po-po\n\n[Verse 3: Game]\nDrive-by violator in the Bentley coupe (where 50 Cent?)\nGhost town outside, ain't nobody to shoot (he at the precinct)\nThey call me Noman for all the heads I shot (haha)\nThey call you state evidence for all the dimes y'all dropped (snitch)\nKeep it realer cause I'm a million dollar killa'\nGot banana clips for you so called gorillas\nG-Unit cap peeling till I D-I-E\nYou lookin' for me, Southern Cali is where I be\n\n[Chorus: Game]\nI heard another nigga from that G-Unit click talking shit\nShe's Tony Yayo\nAnd they kicked him out the house\nThat's the reason why he running his lips, he's on 50's payroll\nYou want to die all you gotta do is keep on fucking with Game\nMr. Yayo, you niggas snitches that's the reason I threw out my G-Unit chain, I ain't the po-po\n\n[Outro: Game]\nYayo stop runnin' from me you bitch ass nigga, haha\nYou ain't go to the jail motherfucker, you went to camp snoopy nigga, yeah nigga\n12 months in the motherfuckin' amusement park you faggot\nThats what PC is to real niggas, yeah\nMy nigga was locked up with you nigga\nSaid he held you down nigga\nGot out of motherfuckin' jail, tried to hit you up nigga\nYour cellphone went \"diuw diuw diuw\" this call has been..\nYou fuckin' faggot, fuck you niggas man hahaha\nG-G-G-G-Unot", "image": "https://images.genius.com/94aac16d9845daeefdcaedcb5eeb289b.360x360x1.jpg"}], "artist": "The Game"}