{"songs": [{"title": "F.U.N. (Fuck U Niggas)", "album": "K.O.D.", "year": "2009-10-26", "lyrics": "[Intro]\nAre you ready for some F.U.N. tonight?\nHa, are you ready for some F.U.N. tonight?\nI wanna have a little F.U.N\nYou wanna have a little F.U.N\nEveryone, let's have F.U.N., the F.U.N.'s begun\n\n[Verse 1]\nI'm different, you can see the Nina from a distance\nMy sixth sense tell me you're hating on me again\nPersistent, jealousy and resistance\nFor my existence, so I gotta go for your chin\nWorkin' out, you can keep on workin' out\nBut your chin ain't workin' out, now your teeth are burstin' out\nBAANG! Fowl thangs lookin' how thou came\nSo I gotta lift up millimeter and eat them like chow mein\nI feel like F.U.N., that's why I will never be thus a real live one\nThe kind of F.U.N. that make them pull a 30 round drum\nYou givin' me negativity and really sound dumb\nWhen you say to me \"You still rappin'? I ain't heard ya since '01\"\nDon't make a nigga beat you down like showin' up the Shogun\nThen have to glow son, I'm like the chose one\nAnd you not knowin' when to respect the Nina makes it like so F.U.N.!\n\n[Hook]\nAny time somebody come and disrespect I say F.U.N\nWhen they trippin', look them in the eye and say F.U.N\nWhen they get the picture they might go for they gun\nThey been hatin' on me from day one!\nF.U.N.'s what ya need to say (Fuck u niggas)\nGot guns on me either way (Fuck u niggas)\nThat's F.U.N. everybody say F.U.N. (Fuck u niggas)\nSay (Fuck u niggas) Hey (Fuck u niggas) Alright\n\n[Verse 2]\nDiamonds on my neck, got diamond on my wrists\nPierced diamond in their lips, so it's diamonds on my dick\nThat's your chick, know when I rock the McRick spits sick\nShe strips quick cause Nina's big shit\nAnd you say you ain't even heard nothin' new played\nSince the Calm Before the Storm and you don't like me today\nThat's the reason I gotta tell you Uck Fay Ou Yay\nAnd I'm off in El Paso fuckin' a bitch named Guadalupe\nI'm straight F.U.N with it, you niggas done did it\nDumb shit is when you compare me to my nigga young with it\nNow ain't that sum shit-it, we two different things\nWith two different schemes, but be off on your ladies tongue with it\nAnd I have her so sprung, when you hate for nothin' nigga\nWe can get to bustin' havin' them puffin' air out of your lung\nThat's how the MO run, I be like so stunned when\nYou don't even rep or respect it so I go F.U.N.!\n\n[Hook]\nAny time somebody come and disrespect I say F.U.N\nWhen they trippin', look them in the eye and say F.U.N\nWhen they get the picture they might go for they gun\nThey been hatin' on me from day one!\nF.U.N.'s what ya need to say (Fuck u niggas)\nGot guns on me either way (Fuck u niggas)\nThat's F.U.N. everybody say F.U.N. (Fuck u niggas)\nSay (Fuck u niggas) Hey (Fuck u niggas) Alright\n\n[Verse 3]\nGive me my props nigga, who you know got them yellin' KC\nMO overseas makin' Europe straight hop nigga\nI need a answer man, you a cancer man\nAnd I'm rockin' strippers in Switzerland and in Amsterdam\nAsk Snoop Dogg, he will tell you all that I'm too tall\nTo be studyin' any of you goof balls\nSo gone you never find Nina like Lou Rawls\nExcept on billboard or Poll-Star so fook y'all\n\n[Interlude]\nI don't care where ya go all around the world, if you tell them, you from Kansas City, the first thing they gon' say is \"Do you know Tech N9ne?\" and you better jeff and say \"That's the Kansas City king, I love him!\"\n\n[Hook]\nAny time somebody come and disrespect I say F.U.N\nWhen they trippin', look them in the eye and say F.U.N\nWhen they get the picture they might go for they gun\nThey been hatin' on me from day one!\nF.U.N.'s what ya need to say (Fuck u niggas)\nGot guns on me either way (Fuck u niggas)\nThat's F.U.N. everybody say F.U.N. (Fuck u niggas)\nSay (Fuck u niggas) Hey (Fuck u niggas) Alright", "image": "https://images.genius.com/de5c12836aa9b9bbb55356aafbf1fa0a.900x900x1.jpg"}], "artist": "Tech N9ne"}