{"songs": [{"title": "World Negatives", "album": null, "year": "2009-11-10", "lyrics": "[Intro: Ab-Soul]\n\n[Verse 1: Kendrick Lamar]\nWatch how I kill them with the funky rhythm\nEmbalming fluid fill 'em\nPiranha's in 'em\nPeep my persona as I\nGet deep as Nostradamus\nYou stalling? Like the '89 I-I-Isiah Thomas\nI'm ballin', cut up your pajamas if you sleepin' on me\nI promise no peekin' homie you tryin' to confiscate the flow, I know\nSo, I switch it quicker than my bitches in mini skirts that want your attention\nOne thing for sure, they gon' get it\nI'm cursed with the world's negatives\nProbably thinkin' I'm hurt but that's the only way I can live\nMore money, cash, drugs, got me feeling like Ace walking inside the club\nPaid in Full, MOB license plates\n38's slug hugging my waist like it had arms\nThen I bear it so I guess it really does\nNo paper work on this marriage, but I'm in love with life corruptions rather than life (woah)\n\n[Hook]\nOh, you ain't know? I need that\nMore money, more drugs I need that\nMore murder, more guns I need that, wondering how I live with the world's negatives\n\nThis the last days my nigga\nWe livin' in the life where crime pays my nigga\nSo all I can say is get paid my nigga\nMoney ,murder, or dope which one you love most?\n\n[Verse 2: Kendrick Lamar]\nMamacita had a bangin' body\nDrove a black beamer, present from her baby daddy probably\nHe knew the nigga from high school\n10th grade? they was cool, fell out over a dice game\nShe knew that but still wanted him to penetrate through that\nShorty wait, me and your man go way back\nShe said so what? He don't need to know what go on between us besides, I just wanna fuck\nShe blew his mind\nKnow what? we can exchange digits\nLets hook up later pay one of them hotels a visit\nShe seemed more than interested, more like desperate to be intimate\nEither she this polite or his lucky night\nGot the champagne sittin' on ice\nRoom 112 fuckin' all night then interrupted by her baby daddy and some niggas that he fuck with\nGot him for everything, pussy's a negative\nAdam & Eve, he should've known\n\nOh you ain't know? you need that\nMore pussy, more hoes you need that\nEven if it's dirty pussy you need that\nWondering how he lives with the world's negatives\n\nThis the last days my nigga\nWe livin' in the life where crime pays my nigga\nSo all I can say is get paid my nigga\nMoney ,murder, or dope which one you love most?\nWe livin' in hell waiting on heaven but you don't know so\nMight as well try to accept it, go with the flow oh\nThis life will never change (rather than try to fix it)\nSo I'm gonna do my thing (Try to continue living)\nSeem's like we never see home, you know?\nSo we screaming\nThis life will never change (rather than try to fix it)\nSo I'm gonna do my thing (Try to continue living)\n\n[Verse 3: Kendrick Lamar]\nGoes out to everybody that know about bad habits\nAnd willing to accept them as a fatal attraction, what a reaction\nRolling with the punches that life gives us and end up like Ke$ha's\nLiver cirrhosis, matches givin' us cancer\nBitches givin' us gono-rrhea\nI promise to practice safe sex, momma, don't cry\nThey say the good die young but a crackhead live a long time\nSo I crack open a beer keg, take that bitch to the head\nSippin' it slow hopin' it prolongs my soul\nAnd that's crazy yo\nWhen heat is on, I put on a coat\nThen take it off when it's about to get cold\nI've adapted to my environment, murder environment\n20 years worth of it so I gotta love it, you can't blame me\nNegative energy, public pulled by evil string\nAs I open a bible I start to sing\n\n[Ab-Soul]\nLiquor's invaded my kidneys\nGot me ready to lick off momma forgive me\nI can't be held accountable that negative's be gettin me down\nGot me rolling with guys, making g's\nGot me tellin' lies that sound true come test me\n\nThis the last days my nigga\nWe livin' in the life where crime pays my nigga\nSo all I can say is get paid my nigga\nMoney ,murder, or dope which one you love most?\nWe livin' in hell waiting on heaven but you don't know so\nMight as well try to accept it, go with the flow oh\nThis life will never change (rather than try to fix it)\nSo I'm gonna do my thing (Try to continue living)\nSeem's like we never see home, you know?\nSo we screaming\nThis life will never change (rather than try to fix it)\nSo I'm gonna do my thing (Try to continue living)", "image": "https://images.genius.com/25d8a9c93ab97e9e6d5d1d9d36e64a53.1000x1000x1.jpg"}], "artist": "Kendrick Lamar"}