{"songs": [{"title": "Trespass", "album": "Featuring... Ice Cube ", "year": null, "lyrics": "[Ice-T]\nHow many bullets can your back hold, suckin from the HK\nThe red dot's on your dome, from the light ray\nBoom bam bust oh shit kid, your head is a pile of puss\nI'm kickin up much dust, the nigga ya can't trust\nThis is my shit, my hood, my turf\nMy gold, my grip, whatever the fuck it's worth\nI don't need nobody comin in my territory\nTryin to rip a nigga off and fuck your fuckin sob stories\n\n[Ice Cube]\nTake a good look at my motherfuckin jacker\nAbout to feel the wrath, of a greedy ass cracker\nPale as snow, so you know the ho stand out\nComin in my hood with his hand out\nTryin to get over on the black, but the motherfuckin mack\nWill put a fuckin slug in his back\nAnd with the boom ping ping, it ain't no thing to blast\nOn greedy motherfuckers that trespass\n\nChorus\n\n[Ice Cube]\nAlli Alli all come free, here come the G\nI'm saggin, and Enter the Dragon like Bruce Lee\nI gots to get mo' money mo' money\nCan't get pussy with no money\nSee I'm kind of greedy, cause all my heroes\nGot zeroes in back of a one\nHere's my gun, about to get paid at last\nBut now I'm gettin covered, in dirt and grass, kick it\n\n[Ice-T]\nThe madder I get, the higher the debt, the deeper you get\nThe thicker the sweat\nCause I'm a nigga with fat clout\nBut ya in, but ya gotta get back out\nNo easy job, for some suckers is out to rob\nCrosshair on your dome and your mind's blown\nYou wanna go home... ain't that a bitch?\nCube, dig the ditch (yep)\n\nChorus\n\n[Ice-T]\nI got a full time job of takin suckers out\nBreakin em off, yea word, I love revokin clout\nTest me, stress me, who could the best be?\nThe teflon nine go through vests G\nBut when you're greedy you don't care about life itself\nYou're chasin extreme wealth\nYou can't be trusted cause trust ain't in the fuckin game\nScandalous is your fuckin name\n\n[Ice Cube]\nI'm the motherfucker you're stuck wit\nIce Cube -- \"Wronnnnnnng nigga to FUCK WIT!\"\nI'm rich, pitchin a bitch about gettin mo'\nThe big fish, swimmin in big dough\nThe G backstabber, I got ta have a\nLexus Coupe, when I troop\nWith the ski mask, gotta get the cash\nMy homeboy ain't home, so fuck it I'll trespass", "image": "https://images.genius.com/3cea3f78903751bf659783f67012fc7b.1000x1000x1.jpg"}], "artist": "Ice Cube"}