{"songs": [{"title": "U Ain’t Gonna Take My Life", "album": "Bootlegs & B-Sides", "year": "1992-11-17", "lyrics": "[Intro]\nBrothers and sisters, this is not a test\nBrothers and sisters, this is not a test\nThe police in your city caught attention purposes\nNot to play open season formed Black Panther\n\n[Verse 1]\nMr. Dirty Harry, you look really scary\nWith your .357, officer Kevin\nSpent 11 years on the force trying to get mine\nHead got the flat top, boots got the spit shine\nDon't give a fuck about my neighborhood\nJust wanna do your eight hours, and then hit the showers\nShoot a brother down and you don't send flowers\nGoddamn sheriff, can't wait to tarriff\nA chunk of a nigga ass, but watch a nigga blast\nAnd get away nigga fast\nYou ain't gonna have me face down no more\nYou ain't gonna get a chance to clown no more\nTo the boys in blue, I got kids too\nAin't going out like a jigaboo, no no no\nOn my way to the store\nYou see me in a Range Rover, now you gotta pull me over\nBut where oh where is the ticket?\nYou got your hand on your gun cause you're wicked\nYou don't like the face of the original man\nBut you gotta treat me like an individual man\nTalk right and I'll talk right back\nShow some goddamn respect to the black\nCause I gotta get back to my wife\nAnd I'm sorry but, you ain't gonna take my life\n\n[Hook]\nNever gonna get it, never gonna get it\nNever gonna get it, never gonna get it\nNever gonna get it, never gonna get it\nNever gonna get it, never gonna get it\n\n[Verse 2]\nJust because you got a badge\nDid you think Ice Cube was gonna wave the white flag?\nCracker please, you can yell freeze\nI'd rather die standing up than die on my knees\nYou think you can do anything you want to do\nTo my crew when you come through, man fuck you\nShooting up South Central\nCatch your ass slipping at a Winchell's\nCould have popped you off, one dead cop\nBut I know you got a wife and a dog named Spot\nI show a little mercy cause I'm civilized\nLooking through a nigga's eyes at a much bigger prize\nBut when I saw Rodney it got me so hot\nMade me wanna go out and pop me a cop\nCause every time you see me sagging\nHere comes the Grand Dragon, in the motherfucking patty wagon\nTryna play me like a trick\nSometimes you act like a dick, Mr. Nightstick\nBack then, I used to throw my MAC-10\nBut nowadays you got the black skin\nBack then you don't like the voice of a nigga named Ice\nBut, you ain't gonna take my life\n\n[Hook]\nNever gonna get it, never gonna get it\nNever gonna get it, never gonna get it\nNever gonna get it, never gonna get it\nNever gonna get it, never gonna get it\n\n[Verse 3]\nYo man let's get an understanding\nI know that your job is demanding\nBut, I only got me one life to live\nYou only got about six shots to give\nAnd I got a big AK with a 50-round clip\nSo why should we trip?\nYou ain't gonna punk me, so what you trying for?\nAin't no job worth dying for, is it?\nMight pay a visit to Petey Wheatstraw\nWhen you stop me on the shore, officer of the law\nAnd if I did something wrong, you can lock me up\nNever never never gonna sock me up\nSo next time you have the urge, all of the sudden\nTo fuck with a nigga for nuttin'\nThink about me, a brother that's 23\nI got a son and a J-O-B\nSo before you pull your gun, you'd better think twice\nPig, cause, you ain't gonna take my life\n\n[Hook]\nNever gonna get it, never gonna get it\nNever gonna get it, never gonna get it\nNever gonna get it, never gonna get it\nNever gonna get it, never gonna get it\nNever gonna get it, never gonna get it\nNever gonna get it, never gonna get it\nNever gonna get it, never gonna get it\nNever gonna get it, never gonna get it\n\nBrothers and sisters this is not a test\nBrothers and sisters this is not a test\nFreeze, freeze, don't ya move you motherfucker or I'll blow your brains out shut the car off slowly", "image": "https://images.genius.com/12530e0ac3cef6640bf6cdf647d97bd0.640x632x1.jpg"}], "artist": "Ice Cube"}