{"songs": [{"title": "I Love My Bitches", "album": null, "year": null, "lyrics": "[Verse 1]\nA month ago, I gave a chick a hundred stacks\nStraight to Neiman Marcus, young bitch had a heart attack\nAww man, I love my bitches\nBottles, Beamers, Brand New Benz's\nBarbies, ballerina's and Britney's\nBarbera Streisand edition Bentleys\nBricks, big face hundreds in bundles\nBoy, I'm a boss, I rose from the jungles\nGod forgives and these killers won't\nIn a room full of heathens, good niggas die alone\nBetter start taking notes as I'm taking tokes\nThe hood wanna see you die and they taking votes\nMy vision always mentioned coke\nMy women never sit in coach\nAww man, I love my bitches\nTongue kissin' a dark skinneded vixen\n50, 60 racks, I might go blow 100 though\nJet owner, G5, where you wanna go?\nFuck your ex's baby, really, that's your past?\nLoad up your carry-on's and all it is is cash\n\n[Hook] x2\nAww man, I love my bitches\nAww man, I love my bitches\nAww man, I love my bitches\nEast coast to West coast, all my bitches\n\nTryna' bring you into my world, baby\nJust stand there, You the canvas, I'mma paint the picture\nYou never met another nigga, you know, fuck it, take it\n\n[Verse 2]\nAm I really just a narcissist\nCause I wake up to a bowl of lobster bisque?\nAnd I wake up on some mobbin' shit\nWith a great view and half my niggas swappin' bricks\nIt's just a way of life\nFor the king of diamonds, so I gotta stay tonight\n50 cash in the Louis for the chicken wings\nStarted in a neighborhood and now we on to bigger things\nLarge clique of my constituents\nCombination to the safe, straight to the Benjamins\nLiving life to the fullest was the emphasis\nMaking love to Mary J's \"Reminisce\"\n\n[Hook]\n\n[Verse 3]\nIt was all good just a week ago\nPaper tag on the Panamera, my speakers blow\nMy bitch sittin' cute, she left her panties home\nSuckin' the dick of the don, I'm talking Miami's own\nMoney like (LeBron James), money like (Dwayne Wade)\n(Play it right) peelin' two off the dealership in the same day\n(Say it right) paid like Mark Clayton, Mark Duper\nSoon as nigga's start hatin', start shootin'\nCome along, money longer than Olajuwan's\nLotta one's, all the bitches gotta model one's\nTongue pierced, dick sucked, said \"I swallowed once\"\n50 million, I'm the only one that got it done\n\n[Hook]\n\nAww man", "image": "https://i.genius.com/65bbafa1499785325450ad7c6d055b838d60c22f?url=http%3A%2F%2Fwww.music-bazaar.com%2Falbum-images%2Fvol3%2F266%2F266354%2F2072836-big%2FI-Love-My-Bitches-Single-cover.jpg"}], "artist": "Rick Ross"}