{"songs": [{"title": "Welcome (Interlude)", "album": "Muddy Waters", "year": "1996-12-10", "lyrics": "(DJ SAYWHAT??)\nOur phone are open for all you high motherfuckers\nAt 1-800-DIKINYABOOTY\n[Redman] Welcome\nThat's 1-800-dick-in-ya-boo-tay!!\n[Redman] Welcome\n\n*ringing phone is answered*\nAiyyo this is Mad Duke callin from Da Bricks\nI'm on the block with Uncle Quilly and Leroy Sweetdick\nGettin my smoke on, for you onionhead motherfuckers\n\nYo this PaceWon from the Outsidaz, dammmn!\n\nWelcome to another nineteen ninety-six Funk Doctor Spock tape\nAs we take y'all minds on another journey, through the darkside\nWe uplift you! Def Squad force comin through with the ruckus\nJammin for all knotty-headed peasy motherfuckers, ahh\nAnd for funky bitches, we got a funky thing for you\n\nI said I gets down like that, who am I (Funk Doctor)\n(as I kiss the sky)\nI said I gets down like that, who am I (Funk Doctor)\n(as I kiss the sky)\n\nBomb traum', funkier than Haitian underarms\nRepresent Jersey, the land of firearms\nHotwired cars, emptying cigars\nAfros, fo' fo's, Omni's with momo's\nAs nasty as I come I should be douche\nI used to be the chief instructor for Bruce\nChoose your weapon -- A FATALITY\nLine your crew up now -- BABALITY\nIn nineteen ninety-six bitch ass niggas all in my mix\nOn some rah rah shit, get my rah rah dick!\nNuts alert, first sound de alarm on de expert\nMy network, operate sharper than a Gilette works\nOff the corner style Blinds in Knightening Armor\nAbout more Facts of Life than Tootie or Blair Warner\nChi-Town where you at (we got your back)\nD.C. where you at (we got your back)\nMy crew Come Strapped like MC Eiht with nickel plates\nGettin mad Dead Presidents ask Larenz Tate\nI'm, gettin loot rollin craps in the yard\nCan't be scarred by media, SO FUCK THE MEDIA\nMost MC's are terrible, unbearable\nCouldn't get stupid if you were sliced cerebral\nAhh no he didn't, act like he's shittin\nMan you're funnier than Ed Griffin, it's Red's kitchen\nMy infrared's missin, damn I'm slippin\nI'm out of ammo, yo Crossbreed, stick the clip in", "image": "https://images.rapgenius.com/0a74fbde446eaf49e1da1f4daae6845a.1000x1000x1.jpg"}], "artist": "Redman"}