{"songs": [{"title": "Wonda Why They Call U Bitch", "album": "All Eyez on Me", "year": "1996-02-13", "lyrics": "[Backing vocals]\n\n[Chorus]\nYou wonda why they call you bitch\nYou wonda why they call you bitch\nYou wonda why they call you bitch\nYou wonda why they call you bitch\nYou wonda why they call you bitch\nYou wonda why they call you bitch\n\n[Verse 1]\nLook here, Miss Thang, hate to salt your game\nBut you's a money-hungry woman and you need to change\nIn the locker room, all the homies do is laugh\nHigh fives ‘cause another nigga played your ass\nIt was said you were sleezy, even easy\nSleepin' around for what you need, see\nIt's your thing, and you can shake it how you wanna\nGive it up free or make your money on the corner\nBut don't be bad, play the game, get mad and change\nThen you wonder why these motherfuckers call you names\nStill lookin' for a way out, and that's okay\nI can see you wanna stray, there's a way out\nKeep your mind on your money, enroll in school\nAnd as the years pass by, you can show them fools\nBut you ain't tryin' to hear me ‘cause you're stuck\nYou're headin' for the bathroom, 'bout to get tossed up\nStill lookin' for a rich man, you dug a ditch\nGot your legs up tryin' to get rich\nI love you like a sister, but you need to switch\nAnd that's why they called you bitch—I betcha!\n\n[Chorus]\nYou wonda why they call you bitch\nYou wonda why they call you bitch\nI betcha\nYou wonda why they call you bitch\nYou wonda why they call you bitch\nI betcha, bitch\nYou wonda why they call you bitch\nYou wonda why they call you bitch\nI betcha\nYou wonda why they call you bitch\nYou wonda why they call you bitch\n\n[Verse 2]\nYou leave your kids with your mama\n‘Cause your headin' for the club\nIn a skin-tight miniskirt, lookin' for some love\nGot them legs wide open while you're sittin' at the bar\nTalkin' to some nigga 'bout his car\nI guess he said he had a Lexus, what's next?\nYou headin' to his car for some sex?\nI pass by, can't hold back tears inside\n‘Cause Lord knows, for years I tried\nAnd all the other people on my block hate your guts\nThen you wonder why they stare and call you slut\nIt's like your mind don't understand\nYou don't have to kill your dreams plottin' schemes on a man\nKeep your head up, legs closed, eyes open\nEither a nigga wear a rubber or he die smokin'\nI'm hearin' rumors, so you need to switch\nAnd niggas wouldn't call you bitch—I betcha!\n\n[Chorus]\nYou wonda why they call you bitch\nYou wonda why they call you bitch\nI betcha\nYou wonda why they call you bitch\nYou wonda why they call you bitch\nI betcha, bitch\nYou wonda why they call you bitch\nYou wonda why they call you bitch\nI betcha\nYou wonda why they call you bitch\nYou wonda why they call you bitch\n\n[Verse 3]\nI guess times gettin' hard, even harder for you\n‘Cause hey now, got a baby on the way now\nMore money from the county, and thanks to the welfare\nYou're about to get your hair done\nGot a dinner date, can't be late\nTrick or treat, sweet thang got another trick to meet\nThe way he did it it was smooth\nPlottin' while he gamin' you so, baby, peep the rules\nI should've seen it in the first case, the worst case\nI should've never called you back in the first place\nI remember back in high school, baby, you was fast\nStraight sex when you moved your ass\nBut now things change, ‘cause you don't look the same\nLet the ghetto get the best of you, baby, that's a shame\nCaught HIV and now you 'bout to be deceased\nAnd finally be at peace\nSo where your niggas at now? ‘Cause everybody left\nThey stepped, and left you on your own\nSee, I loved you like a sister, but you died too quick\nAnd that's why we called you bitch—I betcha!\n\n[Chorus]\nYou wonda why we call you bitch\nYou wonda why we call you bitch\nI betcha, bitch\nYou wonda why we call you bitch\nYou wonda why we call you bitch\nI betcha, bitch\nYou wonda why we call you bitch\nYou wonda why we call you bitch\nI betcha, bitch\nYou wonda why we call you bitch\nYou wonda why we call you bitch\n\n[Outro]\nDear Ms. Delores Tucker, keep stressin' me\nFuckin' with a motherfuckin' mind\nI figured you wanted to know\nYou know, why we call them hoes bitches\nAnd maybe this might help you understand\nIt ain't personal, strictly business, baby, strictly business\nSo If you wonder why we call you bitch\nYou wonder why we call you bitch\nIf you wonder why we call you bitch\nYou wonder why we call you bitch", "image": "https://images.genius.com/f0e663efef180da9b5d259005a1919e3.589x589x1.jpg"}], "artist": "2Pac"}