{"songs": [{"title": "Pass the Bone", "album": "Words From the Genius", "year": null, "lyrics": "[Sample]\nNo stems no seeds that you don't need\nAcapulco gold is… BAD ASS WEED\n\n[Intro: The Genius (Prince Rakeem)]\nYo, this is the Giga-Giga-Genius\nAnd I got the brother Prince Rakeem on the side\nYou know we got the sess bones in the house\nAnd yo, God, I'ma pass you the bone\n(Pass the bone, kid, pass the bone\nPass the bone, kid, pass the bone\nPass the bone, kid, pass the bone\nPass the bone, so I can rule the microphone)\n\n[Verse 1: Prince Rakeem]\nRakeem is feeling lovely, word, a pocket full of dough\nA little drunk, reaction's mad slow\nThinking, should I go to the club scene?\n(And do what?) And bag a rub-a-dub queen\nAnother thing, beyond the cream, I wanted to get ripped\nPut my lips on a blunt tip\nIt's been two weeks, since I last scored (What'd you do?)\nWent down to the club floors\nFive dollar fee, plus ID\nBut a brother like me gassed his way in for free\nWord, took a bar seat\nGot a tall glass of Sex on the Beach\nAnd turned to my left, saw this girl she was slamming, sir\n(Ooh, what ya do kid?) I examined her\nPushed up, I tried to bag her for her name\n(What happened?) I didn't have the game\nOverwhelmed by a scent in the air\nCould it be? Yes, yeah, a potent bag of sess there\nIt was Raekwon and Loungin' Lo\nThey had a bone (You mean a blunt?) A palmetto\nI said, \"Pass the bone, pass the bone\nPass the bone, kid, pass the bone\"\nThey passed it, took one pull, I was blasted\nFelt kind of stimulated, fan-ta-stic\nRe-approached the weak-cypher\n(Did you surprise her?) I tranquilized her\nBagged her for her name and address\nSlid to her rest, achieved mad success\n(But did you bone her?) Did I bone her?\nDid I bone her? You should've heard her moan (uh!)\n\n[Hook: Prince Rakeem & The Genius]\nPass the bone, pass the bone\nPass the bone, kid, pass the bone\nPass the bone, kid, pass the bone\nYo, Genius, flip the microphone\nYo, pass the bone, kid pass the bone\nPass the bone, kid pass the bone\nPass the bone, kid pass the bone\nPass the bone so I can rule the microphone\n\n[Verse 2: The Genius]\nYo, check it\nOutside a nightclub, what? We shine some young bloods\nDrinking forties right down to the suds\nReady to flow inside and rip the mic phone\nHmm, and all I needed was a sess bone\nAnd guess who come down the block stumbling drunk?\n(Who?) Ason, with two bags of skunk\nPull out the blunt, put the weed inside\nRoll it up tight, then the flame was applied\nInhale, but not pertaining to cough\nExhale, you know, like two pulls and off\nStimulated kind of toxie\nSeen a girl who was foxy, yo, but she needed OxyWash\nOh my gosh, yo, to disrespect but back to the subject\nThe brothers rolled up on the scene that I had known\nSmelled the skunk and said \"Yo pass the bone!\"\nI said, \"Lounge, G, there's not enough to pass around\nSo, go get a bag from Uptown\nI gave a pound to the brothers who was sweating me\nWhat about the Wisdoms? Yo, they was stressing me\n\"Hey Genius, Genius, when ya gonna come do me\nStep to me, you know, screw me?\"\nJust another redbone that I had bagged in the red zone\nAnd took home to get my head flown\nForget about the weak-cypher, so I slid to the back\nLeaving tracks of smoke stacks\nThat originated from the sess crops\nGive me the mic and watch me get props\n\n[Hook: Prince Rakeem & The Genius]\nPass the bone, pass the bone\nPass the bone, kid, pass the bone\nPass the bone, kid, pass the bone\nYo, Genius, flip the microphone\nYo, pass the bone, kid pass the bone\nPass the bone, kid pass the bone\nPass the bone, kid pass the bone\nPass the bone so I can rule the microphone", "image": "https://images.genius.com/a2hbqfa2xwvnb8hpdpe5u35cz.300x300x1.jpg"}], "artist": "GZA"}