{"songs": [{"title": "The What", "album": "Ready to Die", "year": "1994-09-13", "lyrics": "[Produced by Easy Mo Bee]\n\n[Verse 1: The Notorious B.I.G.]\nI used to get feels on a bitch\nNow I throw shields on the dick to stop me from that HIV shit\nAnd niggas know they soft like a Twinkie filling\nPlaying the villain, prepare for this rap killing\nBiggie Smalls is the illest, your style is played out\nLike Arnold on that, \"What you talking 'bout, Willis?\"\nThe thrill is gone, the Black Frank White\nIs here to excite and throw dick to dykes\nBitches I like 'em brainless, guns I like 'em stainless steel\nI want the fucking Fortune like the Wheel\nI squeeze gats 'til my clips is empty\nDon't tempt me, you don't want to fuck with the M-E...\n\n[Verse 2: Method Man & The Notorious B.I.G.]\n...T-H-O-D Man, here I am\nI'll be damned if this ain't some shit\nCome to spread the butter lyrics over hominy grit\nIt's the low killer death trap, yes I'm a jet-black ninja\nComing where you rest at, surrender\nStep inside the ring, you's the number one contender\nLooking cold-booty like your pussy in December\nNigga, stop bitching, button up your lip and\nFrom Method all you getting is a can of ass-whipping\nHey, I'll be kicking you son, you doing all the yapping\nActing as if it can't happen\nYour frontin' got me mad enough to touch something\nYo, I'm from Shaolin Island and ain't afraid to bust something\nSo what you want nigga? You won't nigga\nI got a 6-shooter and a horse named Trigger\nIt's real, '94 rugged-raw\nKickin' down your goddamn door\nAnd it goes a little something like this\n\n[Chorus: Method Man & The Notorious B.I.G.]\nFuck the world, don't ask me for shit\nEverything you get you gotta work hard for it\n(Honeys shake your hips) You don't stop\n(And niggas pack the clips) Keep on, bitch\n\n[Verse 3: Method Man & The Notorious B.I.G.]\nVerse two, coming with that Olde E brew\nMeth-tical, putting niggas back in ICU\nI'm lifted, troop, you can bring your wack-ass crew\nI got connections, I'll get that ass stuck like glue\nHuh, no question, I be coming down and shit\nYo I gets rugged as a motherfucking carpet get\nAnd niggas love it, not in the physical form but in the mental\nI spark and they cells get warm\nI'm not a gentleman, I'm a Method Man\nBaby accept it, utmost respect it, and\n(Assume the position) Stop look and listen\nI spit on your grave then I grab my Charles Dickens, bitch\n\n[Verse 4: The Notorious B.I.G. & Method Man]\nWelcome to my center, honeys feel it deep in they placenta\nCold as the pole in the winter\nFar from the inventor, but I got this rap shit sewed\nAnd when my MAC unloads\nI'm guaranteed another video\nReady to die, why I act that way?\nPop duke left mom duke, the faggot took the back way\nSo instead of making hoes suck my dick up\nI used to do stick-ups, 'cause hoes is irritating like the hiccups\nExcuse me, flows just grow through me\nLike trees to branches, cliffs to avalanches\nIt's the praying mantis, deep like the mind of Farrakhan\nA motherfucking rap phenomenon, plus\n(I got more Glocks and TECs than you)\nI make it hot, (niggas won't even stand next to you)\nNigga touch me you better bust me three times in the head\nOr motherfucker's dead, you thought so\n\n[Chorus: Method Man & The Notorious B.I.G.]\nFuck the world, don't ask me for shit\nAnd everything you get you gotta work hard for it\n(Honeys shake your hips) You don't stop\n(And niggas pack the clips) Keep on, bitch\nFuck the world, don't ask me for shit\nEverything you get you gotta work hard for it\n(Honeys shake your hips) You don't stop\n(And niggas pack the clips) Keep on, bitch\n\n[Outro: Notorious B.I.G. & Method Man]\nJunior M.A.F.I.A. clique in full effect (Yeah, what the fuck you want, nigga?)\nAh, yeah, hell yeah (Biggie Smalls and Meth-tical)\nBedford–Stuyvesant the livest one (9-4 coming at you raw)\nMy borough is thorough (Shaolin Island, yeah)\nRecognize (Yeah)", "image": "https://images.genius.com/e6cce6ad5c26175653cd5e5590b6e235.1000x1000x1.jpg"}], "artist": "The Notorious B.I.G."}