{"songs": [{"title": "The New Untouchables (Untouchables)", "album": null, "year": null, "lyrics": "[2Pac talking]\nWest Side (You punk muthafuckaz) UNmuthafuckinTouchables\n(What's up nigga) With the L.B.C. clique nigga (gang)\nBad boy killa, untouchable\n(Hehe, you know what time it is)\nPut your guns down nigga, (West Side) we UNmuthafuckinTouchable (Gang)\nDie, West Side, outlaw, thuglife, M.O. muthafuckin B\nL.B. muthafuckin C\nWhat it be like, what it see like\n(You know)\n\n[Verse 1: 2Pac]\nHuh\nSmooth criminal, individual suffer\nWent to jail, made bail, seein' hell, made me rougher, gettin' money\nFunny it seems, young black teens\nTriple beam dreams make 'em, fiend for crack scenes\nMaybe I'll fuckin' make a million\nBustin' from on top of the buildin'\nA victim addicted to killin'\nI can see it in my eye sight\nYo what's the Hassa?\nIt's a pig that don't fly right, you die tonight\nGet me high I'm a killa, lyrics raise drug dealers\nTurn 'em to muthafuckin' thug niggas\nL.B.C. come and bare with me\nHang with the same niggas go to jail with me\nBang, with the Outlaw clique\nSick since I came out\nPull out my pistol, aim blow your brains out\nPull it, my every word like a bullet\nHollow point style, murder niggas 'til they feel it\nI'm untouchable\n\n[Verse 2: Bad Azz]\nI'm that bottom rock, thinkin' 'bout no limitation\nOn comin' up, (hehe) dealin' wit' anybody runnin' up\nThey get the gat smack, cracks how my gun goes\nHoles in your body and blood all over your clothes\n'Cause money makes earth, what it's worth, gettin' hurt\nDoin' dirt to stay spendin', you can borrow, I mean it\nAny, all confrontation on the currency\nHere in '96, fine chips, stackin' while I'm mackin' no mo'\nIt's L.B.C. and it's a no no\nTalkin' what you don't know and won't know\nHeat hold me down, while I keeps holdin' it down\n'Cause I'm quick to rush and what\nNigga we bust 'em up\nCock it back, ready to blow your block off the map\nThug Life niggas ride wit us\nCops tryin' to get us but they can't\nWe untouchable\n\n(gang gang gang)\n\n[Verse 3: Snoop Dogg]\nHmm\nWhen you're in the fast lane havin' money and fame\nYou got to, always, check, the game\nLook here mane, maintain\n'Cause this game is a cold thing\nCan you dig it mane?\nFo sho' mane, I wish I had your game\nLook here young dog, do your own thing\nThem bitch ass niggas in your clique, buck 'em no\nStay real with yourself and untouchable\nSee that's what's wrong with you niggas now\nBut uh, me and my dawgs from the Thug Pound\nWe just paper chasin', we know nay-thing\nAre you relatin' to the shit we creatin'?\n\n[Verse 4: E.D.I. Amin]\nComin' through colder then Nova Scotia\nMakaveli the Don coast to post it, make sure it's Kosher\nNow we have peeped the scene, it's called the lay out\nDevised a plot, ease the walls, we gotta take out, shit\nSo now it's time to execute, aim for the chest it's you\nNothing's cool, when you die, knowin' you kept it true\nBut if you didn't, broken wings\nLet it be written, we ain't kiddin' to quit and\nMy missions smellin' my menace\nSittin' back, stacked off, spittin' and sippin' yak\nThese fakers play us, gettin' papers so blackjack\nPerhaps, it's what we all, wanna do\nDreamin' and schemin' on livin', Untouchable\n\n[Verse 5: Yaki Kadafi]\nWell it's the O.U.T.L.A.W's, and we untouchable\nBringin' the ruckus to all you fuckin' bustin' bubble crews\n'Cause nowadays spots we blaze\nWith dirty nines and Glocks on Yak's waistline always\nThe crime on these streets of this world is like a maze\nSearchin' for more stunts, and blunts to blaze\nHustlin' to get paid, many different ways\nBodies drop on the other side, and the guns smokes haze\nFuckin' wit' outlawz, it's crazy, these pause don't break me\nThey cut like scissors, who is it, it's Yaki Kadafi\nThe grand wizard trump tight\nTo exquisite, to fuck with cowards\nBest to duck quick, and run for safety\nIf you're shaky, heard about me lately\nBut ain't no jail to straight me\nWe untouchable", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}