{"songs": [{"title": "Tourist (Demo)", "album": null, "year": "2016-01-28", "lyrics": "[Intro]\nHow many times the merry-go-round goes around\nYou come around a whole lot of times\n\n[Chorus]\nBust a trip, come and be my tourist\nPretty bitches walkin' 'round my forest\nHow does it feel, my nigga? Damn it feel great (woo)\nBust a trip, come and be my tourist\n\n[Bridge]\nI might pass that little bitch back to my buddy (pass it, buddy)\nPass that bitch, pass her to my buddy (pass it, buddy)\nHow does it feel, my nigga? Damn it feel great (yeah)\nBust a little bitch, pass her to my buddy (straight up)\n\n[Verse]\nGin and tonic, pass that to my buddies (my buddies)\nOn that lean and soda, I'm not no alcoholic (alcoholic)\nHow does that feel, my nigga? (woo) I said it feel great (woo, woo)\nCome bust a trip and come and be my tourist (straight up)\nAlligator swamp (woo), we pill pop in my hood\nAin't no changin' that, cut that check we all good (straight up)\n9 A.M. clockin', 4 A.M. water whippin'\nJust got to the Mo', my niggas still leanin', tippin'\nHad to bust a bitch I knew back from my old days\nShawty held me down when a nigga had that bald fade (straight up)\n504, my nigga, shout my woadie\nLa Flame killin' you, niggas, damn, I'm sorry (damn, I'm sorry)\nThat's not my kid, call up my nigga, Maury (nigga, Maury)\nDrinkin', drivin', but I wore a condom and I'm stickin' to that story\nI bust a nut like I bust a brick\nBust a band like I bust a bitch\nBust a nigga like I bust a bitch\nBut I pass it like I'm Robert Horry (straight up)\n\n[Chorus]\nBust a trip, come and be my tourist\n(Bust a trip, come and be my tourist)\nPretty bitches walkin' 'round my forest\n(Pretty bitches walkin' 'round my forest)\nHow does it feel, my nigga? Damn it feel great (straight up, woo)\n(How does it feel, damn it feel great)\nBust a trip, come and be my tourist (straight up)\nBust a trip, come and be my tourist\n(Bust a trip, come and be my tourist)\nPretty bitches walkin' 'round my forest\n(Pretty bitches walkin' 'round my forest)\nHow does it feel, my nigga? Damn it feel great (woo)\nBust a trip, come and be my tourist (straight up)", "image": "https://images.genius.com/7b41e116b9ffb96c61ad327500630af7.1000x934x1.jpg"}], "artist": "Travis Scott"}