{"songs": [{"title": "Just Playing (Dreams)", "album": "Ready to Die", "year": "1994-09-13", "lyrics": "[Verse 1]\nAs I sit back relax, steam a blunt, sip a Becks\nThink about the sexy singers that I wanna sex\nI'd probably go to jail for fucking Patti LaBelle\nOoh, Regina Belle, she'd probably do me swell\nJasmine Guy was fly, Mariah Carey's kinda scary\nWait a minute, what about my honey Mary?\nThem jeans, they fitting like a glove\nI had a crush on you since Real Love, huh\nHold your horses\nI'ma show you who the boss of intercourse is\nSex, I'm taking no losses\nEven groups like SWV and TLC can't see B.I.G. with telepathy\nThe recipe, a pinch of hardcore with a gun\nPimpin' ain't easy, but it sure is fun\nWhen I bust my nuts I bust 'em one by one\nSo what's the 4-1-1, hun?\n\n[Chorus]\nDreams of fuckin' an R&B bitch (I'm just playin', but I'm sayin')\nDreams of fuckin' an R&B bitch (I'm just playin', I'm sayin')\nDreams of fuckin' an R&B bitch (I'm just playin', but I'm sayin')\nDreams of fuckin' an R&B bitch (I'm just playin', I'm sayin')\n\n[Verse 2]\nI'll put Chanté Moore pussy in stitches\nI'll fuck RuPaul before I fuck them ugly-ass Xscape bitches\nYou can 76 the 69, try 68\nMake Raven-Symoné call date rape\nOnly 'cause I'm paid, I'm fucking all of Jade\nAnd my DJ Zhané, she likes it when they say\n\"Everybody move your body\"\nGot Whitney Houston boosting from Bobby\nAs I bust the cherry of Monica and Terry\nBack shots to Chaka, I know that pussy hairy\nSade, ooh, I know that pussy tight\nSmack Tina Turner give her flashbacks of Ike\nSmoke a stoge, fuckin' En Vogue because it's four of them\nJimmy hats for Patra, I'm using all of them\n(What about Toni Braxton?)\nIf that bitch give me action, guaranteed satisfaction\n\n[Chorus]\nDreams of fuckin' an R&B bitch (I'm just playin', but I'm sayin')\nDreams of fuckin' an R&B bitch (I'm just playin', I'm sayin')\nDreams of fuckin' an R&B bitch (I'm just playin', but I'm sayin')\nDreams of fuckin' an R&B bitch (I'm just playin', but I'm sayin')\n\n[Outro]\nYou know what I'm sayin', Tim, man?\nI ain't tryna diss the honeys\nYou know what I'm sayin'? (I'm just playin', I'm sayin')\nI just be buggin', you know what I'm sayin'?\nI ain't tryna disrespect nobody, you know?\nI'm just buggin' out, you know? (I'm just playin', but I'm sayin')\nYou know the flavor of the Junior M.A.F.I.A. clique\nKnow what I'm sayin'?\nButtnaked Tim Dawg in the motherfuckin' house\nI'm just playin' (I'm just playin', but I'm sayin')\nWe're just havin' a little fun\nAin't no harm done, B (I'm just playin', I'm sayin')\nBut I would hit all of y'all", "image": "https://images.genius.com/e6cce6ad5c26175653cd5e5590b6e235.1000x1000x1.jpg"}], "artist": "The Notorious B.I.G."}