{"songs": [{"title": "Once Upon a Time", "album": "Fuck A Mixtape", "year": null, "lyrics": "Once upon a time in the apartments, aye\nI damn near had to smoke a J\nHe knocked on the door, what's haapnin'\nIts Jimmy Jam trying to score a little packet frame?\n\nI said the work that we was cooking wasn't dry yet\nBut he could have the residue from the Pyrex\nHe say, he had some niggas with him worth a hundred plus\nBut the niggas up the street was servin' touch and bust\n\nI told him \"Wait a minute it was all good\"\nThat when I seen a nigga hoppin' out the Fleetwood\nWith gold teeth talking about he want a whole ki'\nRight then I'm thinking: \"do this motherfucker know me?\"\n\nHe was with a nigga who wouldn't even buy an oz\nThat's when I said he's either robbing or the police\nEither way I slammed the door in his face\nStarted gathering and collecting all the blow in the place\n\nWent and got the dough out of the safe and .44 and a K\nWhatever he is trying I ain't tripping cause we know where he stays\nAbout 150 grand, three birds in a knapsack\nStashed it in my neighbor's trash then I ran back\n\nI had to keep the tool just in case though\nIf these niggas make a move you already know\nWith the Desert Eagle in my waistband\nI slung the front door open and hollered \"Jimmy Jam!\n\n\"What's up with that nigga that you roll with?\nIn the fake chains and the flea market outfit.\"\nHe said \"Now Tip you know I wouldn't try you.\"\nI said \"Cause if you do he gets killed and you die, too.\"\n\nHe said \"He ain't like that he used to sell weight\nStarted smoking he embarrassed now he's trying to save face\"\nThe conversation was interrupted again\nWhen this country nigga pulled 'bout twenty bands out of his pants\n\nHe said \"I'm in the right place, this enough, ain't it?\"\nI said \"Hell yeah, if you trying to donate it\nShit that get you locked up, I don't sell blow.\"\nThen he said \"I heard you had it?\"\nI said \"Yeah, so?\"\n\nI guess that nigga Boogie from a couple doors down saw his money\nRun up said \"I got it for the low now.\"\nI'm thinking: \"Boogie stupid he don't even know brah\nHe just always wants to take a nigga's customa.\"\n\nThis one he could have\nI said \"I guess that's your man, then.\"\nI was smoking laughing at his ass\nWhen they ran in\n\nThey said Boogie had a quarter mil, over twenty bricks\nShit all I know is I ain't seen that nigga since\nKeep yo' head on the swivel for the nonsense\nEveryday is something when you're trapping in apartments", "image": "https://images.genius.com/6f08c14dfef32114f3f4458805c96968.500x500x1.jpg"}], "artist": "T.I."}