{"songs": [{"title": "Get That Zip Off", "album": "28 Grams", "year": "2014-05-25", "lyrics": "[Intro]\nUh, what is you saying? My money insane\nI’m fresh off a plane, I'm rolling a plant\nGirl why is you playing? Let’s stick to the plan\nThat weed is so good that it stick to my hand\nIt come from the land, I know I’m the man\nBought a few packs so they throw a few in\nI don’t understand, I know what you payin'\nI smoke ‘til it’s gone and grow it again (Huh?)\nIt ain't nothin’ to get that zip off\nIt ain't nothin’ to get that zip off\n\n[Verse 1]\nI was smoking trees at the party acting gnarly\nI got hundred pounds of weed, talkin' shawty, what ya need?\nKush be so strong, hit it once it’s hard to breathe\nHave you coughing up a lung, so much smoke you tryna leave\nBlowing up a nigga phone, what I tell your ass?\nTalking about that pack I ain’t tryna sell your ass\n(God damn) Rollie on my wrist, doobie in my fist\nSipping on that Cris, definitely going to jail if I take a piss\nIt ain’t nothin’ to get that tip off\nArm out the window, it ain’t nothin’ to get that clip off\nIt ain't nothing to knock your clique off\nPut it in her mouth, I swear she tried to suck my dick off (God Damn)\n\n[Hook]\nIt ain't nothin’ to get that zip off\nIt ain't nothin’ to get that zip off\n28 grams in a Ziploc\nIt ain't nothin’ to get that zip off\n\n[Bridge]\nGot one rolled up, you should roll one too\nLet’s get fucked up, girl you know how we do\nWhat time? What place? Drink gin, no chase\nFirst time all out, next time call us\n\n[Verse 2]\nDon’t hit the bong, get the smoke is bad\nSay you smoking strong, but you wrong, you been smoking trash\nIt ain't in my lungs if it ain’t that pressure\nFirst thing in the morning grab my joint from out the dresser\nKeep my OG in a jar ‘cause I like it fresh\nSaid he hit the weed, he ain’t ready yet\nSteady flexin’ on these children like I’m WIllie Nelson\nNo discretion, come to drugs, I got a big selection\n\n[Hook]\nIt ain't nothin’ to get that zip off\nIt ain't nothin’ to get that zip off\n28 grams in a Ziploc\nIt ain't nothin’ to get that zip off\n\n[Outro]\n(Laughing) 28 grams nigga\nThe fuck you wanna do nigga?\nI’m coning the joint while we talk right now nigga\nFuck wrong with you?\nA zip at a time bitch, put that lil’ ass shit away\nFuck wrong with you niggas man\nWe do it big over here man, Taylor Gang\nI’ll be in motherfuckin’ Denver on 4/20 nigga\nWeed’s legal there, so that’s sweet\nY’ll niggas smoke like two joints a day\nAnd you talkin’ bout you gettin’ high motherfucker\nThat’s cool, we gon’ continue to get dumb high\nWe ain’t abusing it, we using it", "image": "https://images.genius.com/e168a843af4516427b50fafd226984ee.990x990x1.jpg"}], "artist": "Wiz Khalifa"}