{"songs": [{"title": "RUN", "album": "BEWARE THE BOOK OF ELI", "year": "2018-05-11", "lyrics": "[Intro]\nAyy, ayy, ayy, ayy\nAyy, ayy, ayy, bitch\nIt's Doktor Avalanche\nHuh, huh, huh\nWater!\nYuh, ayy\nOkay\n\n[Verse 1]\nThink I'm on the Animal Planet with this snake belt buckle\nBut it the Gucci, so don't you dare chuckle\nNot a mechanic, but this tool might clutch it\nNo chicken nuggets, but my sauce been busting\nBitch, it go harder than when Chris Brown krumping\nNo no, bitch, it go harder than bread crumbs in the summer (Bitch)\nHow much of gas do you burn like a Hummer?\nOkay, how many bitches you made wet like a sauna?\nBitch, my feet no Morty, but Rick Owens\nScary side posted like scarecrowin' (Wet!)\nI'm at yo' head like a hair sew in (Hair)\nHide-and-seek, where is your hairline going? (Hair)\nMake the AK sound like some titties I motorboated\nCan't bite my sauce 'cause it's poison coated\nMy flow get you going like locomotive\n\n[Chorus]\nRun motherfucka, run motherfucka, run\nRun motherfucka, run motherfucka (Run, Run)\nIf there’s anyone to fear up under this damn sun\nIn this god-forsaken land, then he is one\nRun motherfucka, run motherfucka, run\nRun motherfucka, run motherfucka\nIf there’s anyone to fear up under this damn sun\nIn this god-forsaken land, then he is one (Get it, Get it)\n\n[Verse 2]\nYuh, made me sick\nKeep one eye at 'em like Slick Rick\nI'm buggin' out like an insect\nFingers on his bitch like Tech Deck\nHer mouth on my wood like go fetch\nFox on my feet, my coat mesh\nHead scratch, how much is that? (Head Scratch)\nIt cost a living like human head, umm\nI'm gone like the wind, high like Peter Pan\nCut like Mr. Clean, but I'm in his head\nLike serial killer, I murdered again (Bitch)\nBut only the track; it's my favorite sin (Water!)\nSo that’s how you know that this song not your friend\nConsider it evil, and this is the end\nBut when in your nightmares, I reappear again (Ayy)\n\n[Chorus]\nRun motherfucka, run motherfucka, run (Ayy Ayy)\nRun motherfucka, run motherfucka (Ayy Ayy Ayy Ayy Ayy)\nIf there’s anyone to fear up under this damn sun\nIn this god-forsaken land, then he is one\nRun motherfucka, run motherfucka, run\nRun motherfucka, run motherfucka\nIf there’s anyone to fear up under this damn sun\nIn this god-forsaken land, then he is one (What?)", "image": "https://images.genius.com/23c23b5f7587f9165e4acb1531892b04.630x630x1.jpg"}], "artist": "Ski Mask the Slump God"}