{"songs": [{"title": "Throw It Like It’s Free", "album": "Napalm", "year": "2012-10-09", "lyrics": "[Chorus: Phats]\nOnly the best of the best around me\nBig coupe, niggas know about me\nStyrofoam cup with promethazine\nGot my body on lean, tell 'em \"Slow it down please\"\nNever play with a nigga\nDrive by, never wave at a nigga\nG-5, real plane/plain on a nigga\nI'ma pray for you niggas and we throwin it like it's free\n\n[Black Milk]\nAmerica's nightmare\nThe American dream\nSounds like the beginnin of the endin\nOf the millenium when you in a storm's lightning\nInner city kid with a pipe dream\nShut down in the blink of an eye\nHandcuffed in the back of a cop car\nOn the block where his best friend just died\nEverything they showed and they know is lies\nEverything we had before it was ours\nLook real deep in the eyes of 'em\nLook real deep in the minds of the blind and\nPut my time in the rhyme and\nDo you by the signs of the time kid\nWhenever I spit that, line for line shit quick, quick\nE'rybody calm down just for a bit\nYo, livin in the land of the dark\nLivin in the land of the lost\n30,000 feet up 'til we landed\nGoin city to city to rock, watch all the fans put they hands up, up\nThis is that realer, iller, killer\nDown for a nigga, I'm standin (yeah!)\nSomethin that's iller, iller, nigga (yeah)\nSomethin that the people are demandin\n\n[Xzibit]\nCheck the background, your rap's not tight\nWe don't fight, we push lead through the pipe\nCame like a thief in the night\nI lean with the left then I follow right behind with the right\nCalifornia term' on sight\nThen I take it back to the D, \"Whatupdoe?\"\nCut up flow the same way I cut up blow\nShut up hoe, abducted, U.F.O\nWalk in a war zone, U.S.O\nI'm at an all-time new plateau, lockin a round let it go\nAnybody get bodied you better know\nCan't do anything about it but get low\nOn the real, before you get the Maybach and the self-made tags\nGet your own lane, fuck tryin to bring the game back\nSlap you out them skinny ass jeans with a back slap\nBetter make change, you them niggas get they chain snatched\n\n[Chorus]\nOnly the best of the best around me\nBig coupe, niggas know about me\nStyrofoam cup with promethazine\nGot my body on lean, tell 'em \"Slow it down please\"\nNever play with a nigga\nDrive by, never wave at a nigga\nG-5, real plane/plain on a nigga\nI'ma pray for you niggas and we throwin it like it's free\n\n[Tre Capital]\nLobster perception, stand at ease with attention\nDid I really even have to mention?\nNow me, X, Black on a pursuit of perfection\nFormulate a plot, man fuck your conception\nBrand new nigga with a flow that's divine\nAll they ever did was write line after line\nKillin time after time and I'm not in my prime\nSo instead of watchin the throne man the glory is mine\nWhere do we go when we conquered it all?\nHow do we feel when there's nothin at all?\nWhy do we walk when we started to crawl?\nBut like King James I was destined to ball\nLike what up, what up, we got one, hot one\nSpit lyrical homicide with a shotgun\nClick clack boom, praise God that we lost son\nTold these muh'fuckers not to mess with the wrong one\nSongs don't wait, welcome to the new edition\nHand-to-hand, eliminate the competition\nWestside to the D, it's a coalition\nThat we grind so hard that we had to give the\nRags to the riches, keys to the business\nWhat is this? Just a young nigga with ambition\nKnock your head off, protect my position\nMan down, man on a mission, listen\n\n[Chorus]\nOnly the best of the best around me\nBig coupe, niggas know about me\nStyrofoam cup with promethazine\nGot my body on lean, tell 'em \"Slow it down please\"\nNever play with a nigga\nDrive by, never wave at a nigga\nG-5, real plane/plain on a nigga\nI'ma pray for you niggas and we throwin it like it's free", "image": "https://images.genius.com/727e047579481405310e18c83d10416c.1000x1000x1.jpg"}], "artist": "Xzibit"}