{"songs": [{"title": "Beat the Clock", "album": "The Pretty Toney Album", "year": "2004-04-20", "lyrics": "[Intro: Ghostface Killah]\nAiyo, Ghost, what's up nigga?\nThis \"Supreme\" talkin' to you and shit\nYou caught me all the way in Staten Island to see you\nBeat the two minute and thirty seven second clock\nSuprise: time started already, muthafucka\nSay that shit, nigga\n\n[Ghostface Killah]\nI'mma say it, don't get mad, y'all, I throw my darts sideways\nShoot 'em up, bang, bang, through me baby\nLovely lady, fuck the spades, drive the kid crazy\nBefore I go to bed, now I lay me\nPeople be talkin', I feed dolphins\nMy defense'll fly the coop off your mean office\nMy skills is a fortune, robbin' leech out a suite auction\nTeach then fall off the greatest, fuck what they say\nCuz we against the abortions, and we\nLay low-oh-oh, silent those clowin' foes\nGot them clothes for his new funeral\nWe them Fat Albert, spot runnin' '86 crack viles and pictures\nLookin' all suspicous, I'm out..\n\n[Interlude: Ghostface Killah]\nAiyo, hold up! What the fuck you stop for?\n(I got somethin' in my--) Nah, you can't be stoppin', g\nWhat the fuck you ain't got -- aiyo, you buggin' and shit\nSon, you gotta hurry the fuck up\nTime is runnin' nigga, come! What the fuck??\n\n[Ghostface Killah]\nI work magic out of liquor store\nGive me a dollar and I turn that bitch into five\nAnd all I need is one more, to get things started\nGet retarded, a one-two -- I'mma fix these artists\nTake 'em one by one, tie 'em up, line 'em up\nTreat 'em like a cigar, fire them niggas up\nThey be up in the club, six/three tree'd up\nWith them young 'keds with their gear all beat up\nThis is how I'mma kill 'em with four lines left\nHold your breath, say my name five times it's take's practice, yo\nDecap' him with sayin' my name, it's like matches, yo\nIt's time to fuck up on account in a house, or blow\n\n[Interlude: Ghostface Killah]\nNa-na-na-na-na, nah, nah, fuck that four-line shit\nYou cheatin' and shit, I ain't come here for all that\n(I'm tired, though lord, what the fuck)\nWhat you mean you tired and shit, g?\nYou suppose to be that nigga, nigga then show me\nIf you that nigga! Then show me, nigga!\n\n[Ghostface Killah]\nI hold a mic like I'm Gale Sayers\nHoppin' over chairs like O.J., my rushin' yards\nThem pen, how the meter spray\nHappy wife-beater day, don't touch my, cheeba hay\nGet off my D-I, then go C the K's (case)\n'Scuse me Mr. D.J., please play \"Fish\"\nOr that Cherchez LaMe, ten four, may day-may day\nCallin' all cars, callin' all cars\nWe have an APB on Starks and Trife the God\nWe left the jewelry store, feelin' like we left the morgue\nWe was frozen, and I brought an iced out Trojan\nThat's for pussies whose golden, who got Toney wide open\nI put my ring up to my man's waves and seen an ocean\nMove like a wolf, kid, in sheep's clothing\nSnatch the money bag off the milk truck and kept boating\nI be potent like ibuprofen, I be coastin'\nWith two shotties on me, in your grimiest lobby smokin'\n\n[Outro: Ghostface Killah]\nThis muthafucka made the clock!\nMutha-- where the fuck?\nYo, you be cheatin', mutha-, you be cheatin'\nThat's that Staten Island, bullshit\nTheodore... you know you might be a Ghost\nBut you ain't Houdini, muthafucka!", "image": "https://images.genius.com/1563d407e670f05603a84947a6af2c41.1000x1000x1.jpg"}], "artist": "Ghostface Killah"}