{"songs": [{"title": "Woo-Hah!! Got You All in Check (Remix)", "album": null, "year": null, "lyrics": "[Intro: Busta Rhymes]\nYaaah Yaaah Yaaaaah Yaahh\nYaaah Yaaah Yaaaaah Yaahh\nYaaah Yaaah Yaaaaah Yaahh\nYaaah Yaaah Yaaaaah Yaahh\n\n[Hook: Busta Rhymes & Ol Dirty Bastard]\n[Busta Rhymes] The Flip Mode is the Squad that controls your set\nWoo-Hah!! Got you all in check\n[Ol Dirty Bastard] We on some outta space shit like you watch Star Trek\nWoo-Hah!! Got you all in check\n[BR] You better keep my music bangin till it disconnect\nWoo-Hah!! Got you all in check\n[ODB] Architects gettin money let me cash my check\nWoo-Hah!! Got you all in check\n\n[Verse 1: Busta Rhymes & Ol Dirty Bastard]\n[BR] Busta Rhymes up in the place with the ODB\n[OBD] Busta Rhymes you rhyme dirty—\n[BR] —You rhyme after me\nThe ODB was nominated for a Grammy\n[ODB] Congratulations Bust with your solo LP\n[BR] Putting scratches in my lyrics like my name was Kid Capri\nBlow up the spot, regardless of your nationality\n[ODB] And I'm the Dirty Dawg can't fuck with me\n[BR] Took Mariah on a fantasy\n[ODB] I had a wet dream that I was bonin Jody Wately\nDoin wild shit-a-nuh, ain't allowed to see\n[BR] But we about to blow up the spot momentarily\nWoo-Hah!! Ran stupid all throughout the country\n[ODB] And for youse to kill me? That wasn't meants to be\n[BR] I know it feel good, motherfuckers want the recipe\n[ODB] And whose the vigilante, in the place to be\n[BR] The ODB—\n[ODB] —Busta Rhymes real quality\n[BR] My top priority, is to be the voluntarily\nNigga that rip your ass for free, ha-hah-hah, hah\n\n[Bridge]\n\n[Verse 1 cont.]\n[ODB] Ohh baby I like it rawww, get with me\nBaby it's pure ecstasy\n[BR] Yo everytime I design a flow, you see in 3D\nFlawless victory—\n[ODB] —Knock a nigguh out, one two three!\n\n[Hook]\n\n[Interlude: Ol Dirty Bastard]\nDibby dabby dibbi dah, then I pass a lot\nLet me get more hot, represent the spot\nA mad Squad when it comes to the art of rapping\nI gotta keep your hands clapping\nWhen you look at me, the type of guy I be\nI'm a dirty dancer, making girlies panties move\nLet them fly so I can blast up the twat\nGirlies watch sayin \"God, stop getting me hot!\"\n\n[Verse 2: Busta Rhymes & Ol Dirty Bastard]\n[BR] Niggas talk shit, yo kill the yapping\nWord is bond baby, tell me how you look so smashing\nNow I got your head hurt, you need an aspirin\nBashin your head in the wall, time for some action\nIf you want a small piece well here's a fraction\nOf shit that will bust your head quick, peep the transaction\nOf how we keep motherfuckers constantly crashing\nThey flyest whips, think no shifts, now whose the champion?\nI bring the wicked flow, like the latest fashion\nSatisfaction baby keep your camera flashing\n[ODB] I was busting the sperm cells mixed with Old Gold\nFungus mold, 'fore-you-should-list...slum gold\nPlayed for a wild Irish rose\nFat ass nigga, slim bitch with no clothes\nIn the backseat of a 'back sixty-nine Oldsmoz\nAre your soles and toes in the windows? Oh my hoes!\nHey believe me when I say so\nYou're in need ofarealnig-c-ca-ca-ca-crambole\n\n[Hook]\n\n[Outro]", "image": "https://images.genius.com/54314abfbbbf16253d72455428cc44e6.834x834x1.jpg"}], "artist": "Busta Rhymes"}