{"songs": [{"title": "Girlz 2 (DMX All Vocals)", "album": null, "year": "1998-01-01", "lyrics": "{Verse 1}\nCause of my profession and affection I place nothing above 'em\n(?) that I'm possessing I (?) truly love 'em\nShort ones tall ones big ones small ones\nWinter spring summer and fall yo I love 'em all\nEspecially the cuties with the smooth complexions and shapely booties\nWith the type of bodies that'll make you say \"Oh boy.\"\nYup but baby if you're ugly I ain't got nothing for ya\nI'm not conceited, I'm convinced that I've been naturally blessed\nTo (?) and irresistible with (?)\nAnd what's that get that breaks down (?) a cutie I bag 'em\nThe instant I see a cutie with a bootie wiggle it just like jello\nTo me being a player approach and say hello but she didn't hear me\nSo I tapped her softly, She turned around screaming on me \"Back up off me!\"\nI said \"Damn, there is no need for hostility, I'm a mellow type of fellow\"\nInstil the tranquillity, She said \"I recognize all of y'all are the same only after one thing\nAnd kinda swift with the game\" I said \"Come on now sweetheart do I look like a player?\"\nShe said \"Of course not, psych.\" (?) let me know the deal I wanna ask you\n\"Are you for real, are you really for real is this love that I can't believe the way you make me feel\nAre you for real?\" As real as it gets my name is not James Brown but I believe you in a cold sweat\nAnd I bet there's no if, ands, and maybes when I'm finished I will have you sayin' \"Do me baby.\"\nShe said, \"(?) I'ma give you a try because I think your kinda fly and you're my type of guy,\"\nShe said her name was Crystal and she kept the pistol on her and if I ever cheated\nBelieve I be a goner, so I played the perfect gentleman ever time I was wit' her\nAnd when I wasn't wit her I was going to get her when I wasn't going to get her she was coming to get me\nThen when she wasn't coming to get me she was wit me\nSo for a while everything was smooth, I waited and contemplated my next move\nMy instinct had told that the time was right for us to get together\nFor a magical night so I called her, she said \"Hello\" I said \"Hey\"\nShe said \"Wait, I already know what you have to say,\" she said \"Baby, I know you're wondering\nWhy I won't go over to your place because I'm not too sure about how you feel\nSo I'd rather go at my own pace, Oh I don't know\nThe way that I feel I'm so afraid of a one night deal\nI--\" Hold up sweetheart, just chill, relax your telling me the answer\nAnd I didn't even ask don't you think that we should be alone this is not the type of thing to\nTalk about over the phone, why don't you \"Come on and go with me\nCome on over to my place.\" Where we can sit down and talk about it face to face\nWhy don't you \"Come on and go with me\nCome on over to my place\"\nWhere we can discuss the (?) of picking up the pace She said\n\"I thought about it and I think that your right but, my parents are home so\nIt won't be tonight but, um why don't you come over tomorrow at 8 my parents leave at 7:30 and won't be back until late.\"\nI said \"Then let me go and get set tomorrow will be a day that you will not forget\"\nSo the next day around 7:54 I picked up like 6 condoms and headed for the door stepped outside\nI was asked where was I going by detectives with nine millimetres that were showing\nI said \"To my girls house.\" They said \"No you aren't,\" I said \"Why not?\"\nThey said because they have a warrant\nI said \"That's impossible how can that be?\" They said \"It's right here\nRobbery, first degree.\" Well anyway to make a long story short I ended up in (?)\nGoing to court so I call Crystal the night around 8 I said \"It's just a mix up\"\nAnd blamed it on fate she told me that she loved me and promised to wait she said \"I'll see you in court\nOn your next court date.\" Despite being locked up things weren't bad\nI still had my girl and for that I was glad\nShe always came to visit didn't mind the (?) and every night I wrote a letter telling her things like\n\n{Bridge}\nI can't feel myself, I don't want nobody else to ever love me\nYou are my shining star, my guiding light, my love (?)\nThere's not a minute, hour, day or night that I don't love you\nYou're at the top of my lips cause I'm always thinking of you\nI still remember in the days when I was scared to touch you\nHow I spent my daydreaming learning how to say \"I love you\"\nYou must've known that I had feelings deep enough to swim in\nThat's when you opened up your heart and you told me to come in\nOh mama!\nA thousand kisses from you is never too much\nAnd I just don't wanna stop\n\n{Verse 2}\nDays turned into weeks, weeks into months\n10 days to 25th and I've only gotten mail once\nWhat had happened to my love life\nWhy do I feel like I've been stabbed in the back with a knife\nI tried to believe I said she loves me, she does but deep down\nI knew what the scoop really was you see\nJody had my girl and now she was gone\nJust thinking about it had me singing every love song\nI'm thinking to my self how could she do me wrong but it's not her fault\nI was away for too long I thought I had a girlfriend but now I know better\nShe told me that she wrote me but I never got the letter\nEvery time I tried to call her nobody was home\nAnd since I had to call collect she put a block on the phone\nShe told me she would visit but damn I haven't seen her\nYou wanna know why because Jody is in between her legs and getting busy\nHe even ate the coochie, yo I bought her everything from Fendi to Gucci\nBut (?) in something that I didn't even have to sweat her\nAnd if it doesn't happen by now it's gonna get her um\n\n{Bridge}\n\"Thrown up in the middle I don't know what to do\nWhat do you do when your girl is untrue\nThere's another man, another man\nIn my life, in my life\nOhh, another man is beating my time\nAnother man is loving mine\nOhh, another man is beating my time\nAnother man is loving mine\n\n{Verse 3}\nBeating my time\nAnother man was loving mine\nI was upset but there were other things on my mind\nI would start trial soon and was facing a lot of time\nAnd on the day of trial I was nervous for a while but when they said not guilty\nI stepped with a smile back to freedom, freedom on the streets again\nWhere I had to go and see what was up with my friend\nSo I called her just to make sure she was home I said \"Hello,\"\nAnd a man's voice answered the phone I was confused at first I didn't know what to do\nSaid who is this he said \"It's Jody and what is it to you?\"\nI turned up the receiver, picked up my gun, and straight for Crystal's crib\nI started running murder, murder my fingers on the trigger murder, murder\nI'ma murder this nigga. So then I thought why should I do him? He wouldn't have no pussy if she didn't give it to him\nI thought about killing him thought about it twice said \"Nah.\"\nWhy because it wouldn't be nice and for the sake of curiosity I had to go see Crystal\nAnd ask her why did it have to be me? I knocked on the door and just like before\nI heard a man's voice saying he couldn't take it any more the door opened up\nBut Jody (?) he looked me up and down and said I guess (?)\nNow here comes Crystal yelling and fussing, hollering screaming, shouting and cussing\nShe looked at me and (?) got quiet in the hall she (?) and why didn't you call\nI turned around to leave and she said \"Please don't go,\" I said \"You used to be my girl\nNow you're nothing but a ho I understand cause I'm a man but there's no (?) in stake\n\"So I spread my wings and fly away, yeah\"\n\n{Outro}\nYou know what I'm sayin?\nDMX's (?)\nFor 91' pushing up no daisies\nCause I'm real", "image": "https://images.rapgenius.com/c048ed75e001e7462e2f3445177e4821.500x500x1.jpg"}], "artist": "DMX"}