{"songs": [{"title": "Womanogamy", "album": "Do What Thou Wilt.", "year": "2016-12-09", "lyrics": "[Intro]\nThe goal is not to, uh, make my cup fall\nThat's the goal, that's the ultimate goal\nOne wrong move in this motherfucker gone fall over\nAyy\n\n[Verse 1: Ab-Soul]\nLook, I got two baby mamas, but I ain't got no kids\nNah, I'm fuckin' with you, them my lesbian friends\nReal shit, they been together for over a few years\nEvery time I smell the sage burning man I think of them\nJade wanna be a surrogate and carry my kids\nI'd probably give Lonnie cash if she'll really let me hit\nWe think she Nefertiti, and I believe it\nUnisex said that she turned gold durin' her DMT trip\n\n[Chorus: Ab-Soul]\n‘Cause I like girls that like girls that's in love with me\nJust promise me you'll remain anonymous\nShe said am I faithful, I said I'm womanogamous\nWomanogamous, womanogamous\nShe asked am I faithful\nWomanogamous, womanogamous\n‘Cause I like girls that like (I like girls that like)\n\n[Post-Chorus: Ab-Soul & ScHoolboy Q]\nFrom the womb to the tomb, nigga\nPut that womb in the tomb, nigga (Womanogamous)\nI said from the womb to the tomb, nigga\nKeep that womb in the tomb, nigga (Womanogamous)\nFrom the womb to the tomb, nigga\nLeave that womb in the tomb, nigga\nAmber Rose taught you how to be a bad bitch\nThis should be your favorite track, bitch! (Turn me up, fool!)\n\n[Verse 2: Ab-Soul]\nI'm a Pisces, I got Aphrodite in my back\nPocket on the ring of my keys\nHope her and her son Eros get where they supposed to go\nThey playin' tug of war with me, and I can't bend no more\nI'm too emotional for that, but I don't show it\nIf I'm two fishes tied by the tail, then where I'm goin'?\nHold that thought, next scene, shit, it would be the moaning\nI give her morning wood, then roll my wood up in the morning\nFinesse this flow from Lucki Eck$\nI’m finger-fuckin' Mother Earth\nPut my thumb up in her butt, then roll like a was bowlin'\nGettin' comatose and high, they on my pole ‘cause I told 'em\nI guess if you was Nuit you would know it\nAnd Christ died at 33, and she at 33\nAnd she was born on two eleven; that’s a robbery\nDamn, she done stole my heart from me\n\n[Chorus: Ab-Soul]\n‘Cause I like girls that like girls that's in love with me\nJust promise me you'll remain anonymous\nShe said am I faithful, I said I'm womanogamous\nWomanogamous, womanogamous\nShe asked am I faithful\nWomanogamous, womanogamous\n‘Cause I like girls that like (I like girls that like)\n\n[Post-Chorus: Ab-Soul & ScHoolboy Q]\nFrom the womb to the tomb, nigga\nPut that womb in the tomb, nigga (Womanogamous)\nI said from the womb to the tomb, nigga\nKeep that womb in the tomb, nigga (Womanogamous)\nFrom the womb to the tomb, nigga\nLeave that womb in the tomb, nigga\nAmber Rose taught you how to be a bad bitch\nThis should be your favorite track, bitch! (Turn me up, fool!)\n\n[Outro]\nWomanogamous\nDidn’t drop the cup, fool! Hahahah\n(YMF, nigga!)", "image": "https://images.genius.com/216d5ad8aa97fe78835ee2f384785ee8.1000x1000x1.jpg"}], "artist": "Ab-Soul"}