{"songs": [{"title": "Freestyle - Da One", "album": null, "year": null, "lyrics": "Verse 1\n\nLyrics make me a menace\nWhen it's in a sentence then it's finished\nMore pure than raw, much more above the law\nI don't go on tour, I go to war\nStompin' COMP perform a similar style\nRhymes attack 91 rap exile\nCause every word I said'll be deadly\nAn MC murderer, science is steadily\nGiving me new ways and methods\nMelodies and medleys, weapons for records\nTactics lethal, perhaps it's illegal\nScorching, I'm torching cause that's how we do\nSet your entire empire on fire\nSo give me a mic without a wire\nCause every dose is highly explosive\nMr. Dynamite, the man with most of\nThe blueprints and master plans, the potential\nData process stored in the mental\nThen I get physical and hit you with another hit\nThe brother's it, and nothing's equivalent\n\nVerse 2\n\nMind of mine so divine, one of a kind\nLife gave lemonade, I made my flavor green lime\nChasing the green light in a hot pursuit\nRockin’  em’ baggy jeans and construction boots\nSoul Survivor, able to put out the fire lit by Cain (Kane)\nIdeas turn to golden weapons, Suddam Hussein\nAlpha to Omega, I was the inventa’ of hip-hop\nPushed in the door with my big toe like I was slippin’ on flip flops\nThe creator, raps initiator since its Genesis\nCheck the First Testament\nThe God who created the worlds elements with precise measurements\nRakim Allah absorbs your detriments, and writes a verse\nSo influential I eliminate your devilish thirst\nThe games been cursed and I’m the magician\nLeave opponents in a hearse for trying to claim first position\nGod incarnate, the marksman sergeant\nTeach em’ where to aim to hit their goals and targets\nI fathered this rap game, plain and simple\nIncorporated hip-hop with poetry and riddles\nMy mind is so deep sharks can’t swim with my thoughts\nWhale (Will) they swim to the shallow with the fishes and lobs.,\nIt don’t matter, the underground still too hard to survive\nI could swim under the sea with the beasts and be the only one still alive\nDo or die if you scuba dive in the league I roam\nTurn hardcore rappers into sponges and Styrofoam\nI stand alone, the messenger to slay the monster\nFrom Moses parting the Red Sea to me, the Godfather\nRakim Allah…..\n\nFirst Verse Written by Rakim. Second Verse Written by Patrick Yousif as if he was Rakim and spoke from Rakim Allah's point of view in the rap game. Just having some fun trying to imitate Rakim's style. Once again, First Verse Written by Rakim himself, Second Verse is written by a fan (Patrick) pretending to be Rakim...", "image": "https://images.genius.com/6699b3c41af3d4ee6ce799b3b558d845.400x400x1.jpg"}], "artist": "Rakim"}