{"songs": [{"title": "I’m Not Introducing You", "album": "Raw", "year": "2010-11-19", "lyrics": "[Intro]\nA lot of you females got me twisted\nYou assume just because I'm a rapper, you can approach me in a ho-ish way and get something out of it\nShit, you'd be lucky if you walk away with an autograph..bitch\nYou better come correct\n\n[Hook]\nI'm a beam just like the shining sun\nBut I'd be a fool if I say you're the one\nAnd I'd be the water that's raining down on the land\nBut I won't be your man\nYou see I got other plans\nYou know what you know what\nI'm not introducing you to mama\nI'm not introducing you to mama\nI'm not introducing you to mama\nI'm not introducing you to mama\n\n[Verse 1]\nMan it's so hard to find a girl who's close to having a mindstate like me\nA lot of you drink and smoke, suck a lot of dick on the low and probably got HIV\nDon't get mad when you get played by me I'ma keep it real til the day I D-I-E\nAnd for you girls who be up in the club that's underage with a fake ID\nListen, I don't give a fuck what you believe most guys don't want you to see\nThat they just wanna get your ass under the sheets fuck you then leave I don't what prompts you to be\nSo stupid now you're crying your eyes out he's long gone and you're trying to find out\nBut I'm telling you why so don't cry baby girl now it's time for you to be back on the right route\nBack to me, actually, I got a lot of girls throwing they ass to me\nI throw it right back at 'em so happily, can't believe that they have the audacity\nTo even do that shit, like I'm that guy\nBitch come down 'cause you're not that fly\nKiss the first night, it's not that time. No hoes hopping inside my ride\n\n[Hook]\nI'm a beam just like the shining sun\nBut I'd be a fool if I say you're the one\nAnd I'd be the water that's raining down on the land\nBut I won't be your man\nYou see I got other plans\nYou know what you know what\nI'm not introducing you to mama\nI'm not introducing you to mama\nI'm not introducing you to mama\nI'm not introducing you to mama\n\n[Verse 2]\nEvery girl I meet, always talking bout \"I don't even wanna know Hopsin, ew\nYeah, he got some skills but every time he put them eyes in it look like he popped some pills\nI just wanna know Marcus, he's a sweet little innocent boy,\nOh god I'd date him with no prob\nAnd if he wanted to I'll let him beat the pussy with no condom\"\nBitch, what's your problem? You expect me to be optim -mistic, for the mischief you bring your senseless bitch you out of\nYour mind I know you like the fact I'm so bad when I spit up on the track\nBlack and I rap with a little bit of swag and happen to have a little money in the back\nWhat the fuck do you got that'll impress me so I can feel half of the magic?\nA loose vaginal passage, uh uh bitch put that back in the package\nI feel so sick and lonely, I want a real girl that will get to know me\nNo charcoal breath who be hitting a stogie and not one that'll say shit to blow me\n\n[Hook]\nI'm a beam just like the shining sun\nBut I'd be a fool if I say you're the one\nAnd I'd be the water that's raining down on the land\nBut I won't be your man\nYou see I got other plans\nYou know what you know what\nI'm not introducing you to mama\nI'm not introducing you to mama\nI'm not introducing you to mama\nI'm not introducing you to mama\n\n[Verse 3]\nI like nature, ah you too? Wow, we got so much in common boo\nDon't be assuming that I'm going to love you because if you do I'll cut you out of my life I promise you\nI'm down to earth and I'm an honest dude\nYou barely be giving me any homage dues\nI would definitely regret it and probably get a big headache if I was stupid and got with you\nHow many guys have you let bone you? (Uhhh?) Let me guess, you don't have no clue huh?\nCould of been 5, could have been 10, could have been a million nigga's that hopped on you huh?\nI ain't trying to be another one on the list, that'll make me a true son of a bitch\nYup I know how you work, you ain't nothing but a flirt baby girl that's one of the risks\nBest believe that I'ma pass on that, ain't got time for no asshole acts\nYou say you a good girl that's no fact, can't roll smooth 'cause your axles cracked\nYou can't find a good man that's so sad, I think it's because you act so wack\nSo don't be trying to blame the world for your nonsense bitch I'll fuck around a smack yo ass\n\n[Hook]\nI'm a beam just like the shining sun\nBut I'd be a fool if I say you're the one\nAnd I'd be the water that's raining down on the land\nBut I won't be your man\nYou see I got other plans\nYou know what you know what\nI'm not introducing you to mama\nI'm not introducing you to mama\nI'm not introducing you to mama\nI'm not introducing you to mama\n\n[Outro]\nBaby, maybe we can meet up tomorrow and we can give it one more try\nBut in the meantime I'ma have to say goodbye baby 'cause right now you're not my type\nNow listen, I'm not introducing you to mama\nI'm not introducing you to mama\nI'm not introducing you to mama\nI'm not introducing you to mama", "image": "https://images.genius.com/511235d7620c5ca1e6b46a485cb180d6.1000x1000x1.jpg"}], "artist": "Hopsin"}