{"songs": [{"title": "Throne Air", "album": "SouthMatic", "year": "2019-06-21", "lyrics": "[Intro]\nThe Grand Wizard, B-O-B\nB, Do you wanna be down with the king? O-B\nThe Grand Wizard B-O-B\nB, Do you wanna be down with the king? O-B\n\n[Verse 1]\nThey try to get under my skin, ingrown hair\nRappers in a box, huh, you belong there\nI cut four holes in the top, you could draw air\nKing, I should start an airline called Throne Air\nNiggas never step but be having long stairs\nFuck your girl like rabbits all night, that's long hair\nAin't talking royalty but I brought the Dutches\nMy blunts is Dublin, you black but your blood be Russian\nI said I showed you niggas how to do gold, I'm a blacksmith\nMy demographic all say my verse demographic\nWish a nigga would, presidential cabinet\nToo much baggage, if you fly I'm gravity\nYour water ain't shit, I control the drip\nShow up with a bitch look like Farrah Fawcett\nMade a couple m's cleaning out my closet\nJust a prophet that make profit\n\n[Chorus]\n(Bands) The Grand Wizard (Bands), B-O-B\n(Bands) B, Do you wanna be down with the king? (Bands), O-B\n(Bands) The Grand Wizard (Bands), B-O-B\n(Bands) B, Do you wanna be down with the king? (Bands) O-B\n\n[Verse 2]\nLooking out the window\nI close blinds but I win though\nBeat drop, rappers barely stayin' alive\nThat's how this go, my disc go platinum like Sisqo\nFirst class nigga, y'all snuck in the cargo\nHad to call an embargo\nI'm the black El Dorado\nI put the fye in WiFi\nYour ex files for divorce, sci-fi\nShe on standby, I land on her cheeks (Huh)\nIn my seats is 30,000 feet\nJoin the mile high club or see 36 deep\nShe gets off at concourse B (Ah)\nThat's why they say I'm deranged\nB-b-b-b I brought my snake on the plane, getting brain\nI step off the plane, terms ill\nTerminology filled with shit to heal the terminally ill\n\n[Chorus]\n(Bands) The Grand Wizard (Bands), B-O-B\n(Bands) B, Do you wanna be down with the king? (Bands), O-B\n(Bands) The Grand Wizard (Bands), B-O-B\n(Bands) B, Do you wanna be down with the king? (Bands) O-B\nYour water, your water, your water ain't shit\nI control drip, drip, drip, drip, drip, drip\nYour water ain't shit, I control the drip\nI control the drip\nYou water ain't shit, I control the drip\nI control the drip, drip, drip\nYou water ain't shit, I control the drip", "image": "https://images.genius.com/a9a03f89f8f3d7ce8b4db691d6f598db.800x800x1.jpg"}], "artist": "B.o.B"}