{"songs": [{"title": "That’s a Lie", "album": "Radio", "year": "1985-11-18", "lyrics": "[ Russell Simmons ]\nYo man, I got this def Rolex watch, man\n$100,000 watch, man\nI sell it to you for 400\n- You got 80?\nDig - dig this, man\nI got a rich, rich, rich, rich girl, man...\n\n[ L.L. Cool J ]\nI'm sick and tired of the stories that you always tell\nShakespeare couldn't tell a story that well\nSee, you're the largest liar that was ever created\nYou and Pinocchio are probably related\nFull of criss-crossed fits, you lie all the time\nYour tongue should be embarrassed, you're a threat to mankind\nThat's a lie\n\n[ Russell Simmons ]\nYou know what my records is about, man\nYou know how much money we get, man\nCome on\n(You're a liar)\nMe and my man Rick got millions of gold albums\n(That's a lie)\nI'm gettin cold money every day\n(You're a liar)\nYou'll need a wheel barrow for all that shit in my office\n\n[ L.L. Cool J ]\nYou lied about the lies that you lied about\nYou even lied to your aunt when you went down south\nYou lied, and a body builder kicked your butt\nIf you was in Egypt you'd lie to King Tut\nYou claim to do things no one could achieve\nYou said you did things Ripley's wouldn't believe\nThat's a lie\n\n[ Russell Simmons ]\nI got this Japanese girl, man\nLee, man, takes good care of me\n(You're a liar)\nYo, she's so def, man\nWipes my butt\n(That's a lie)\nEverybody be beefin, man, about what Rush doin\n(You're a liar)\nYou seen my new Mercedes, man?\n\n[ L.L. Cool J ]\nGiant Jabber-Jaw, biggest liar I ever saw\nYou said you got a mansion, you don't got half a floor\nProfessor of Super Lies, you can lecture at my school\nYou said you liked Felix Unger, sat down at the dinner table and drooled\nYour story's so remarkable, it shouldn't be revealed\nYou said you had a Benz, you don't got four wheels\nThat's a lie\n\n[ Russell Simmons ]\nI got a Maserati, man, what are you talkin 'bout?\n(You're a liar)\nI traded my 1988 Mercedes for it\n(That's a lie)\nMan, don't front, you know what Rush is about, man\n(You're a liar)\nYo, why you be illin, man?\nYou know what time - what time it is\n\n[ L.L. Cool J ]\nThen you start to lie about things you don't have\nYou speak of limousines? You can't afford a cab\nSaid you slapped Rowdy Piper and didn't get a hassle\nYou promised your girl filet mignon, took her to White Castle\nYou said you have a lot of women, you don't even know a few\n'There are 8 million stories' - and they're all made up by you\nThat's a lie\n\n[ Russell Simmons ]\nYo, yo, stick with Rush, man\nI'll get you the biggest medallion you ever saw\n(You're a liar)\nIt's gon' keep the bullets off your back\n(That's a lie)\nYou know why stations don't play our records?\nCause the kids'll tear the station apart\nKids'll rip it down...\n\n[ L.L. Cool J ]\nSaid your grandmother's 20 when your mother's 25\nSaid your father beat Joe Louis, but homeboy took a dive\nYou said you used toothpaste, your teeth are yellow like my gold\nA brand new pair of Lee's, that's the skirt your sister stole\nThat's a lie\n\n[ Russell Simmons ]\nYo man\nAll the girls everywhere talkin about Rush\n(You're a liar)\nWord man, Pretty Tony knocked a ho down the other day\n(That's a lie)\nTalkin so much about 'Rush, Rush,' every time\n(You're a liar)\nThat hoes just be beefin, man\n'Rush this and Rush that'\n(That's a lie)\nWorld's biggest thing, man\nRush is gettin all the money, man\n(You're a liar)\n...wheel barrow full of money, ya understand me?\n(That's a lie)\nThat they be rollin that shit in my office all day\n(You're a liar)\nNothin but money, and it be green\n(That's a lie)\nDon't front, man, you know what Rush is about, man\nRush gets money, man\n(You're liar)\nMy Maserati is bad, man, it's blue and green - and gold\n(That's a lie)\nI just bought this ho this million dollar ring, man\n(You're a liar)\nI just wanna look good, man\nSo I got one\n(That's a lie)\nLike that, we be cold gettin money at Rush, man\nJewels be them thangs\n(You're a liar)\nRings and things, man, all that type of stuff\n(That's a lie)\nMan, I got 900 pairs of Reeboks, man\n...pair of...Adidas\n(You're a liar)\nI got every color of Adidas they ever made, man\n(That's a lie)\nMy man Steve, that's a porno star, man\nAnd he be bringin them hoes to the house\n(You're a liar)\nWord man, they be over my house\n(That's a lie)\nYo, that girl at my house, man\n...Lee, man\nShe cleans up behind me, man\n(You're a liar)\nYo, she cleans up behind me, does everything I say, man\n(That's a lie)\nYo man, sweet little Japanese thing, man\nTakin care of me, man\n(You're a l-)\nYo, man...\n(That's a lie)", "image": "https://images.genius.com/cde9792f845cc4a69fd337bcff0683b5.1000x1000x1.jpg"}], "artist": "LL Cool J"}