{"songs": [{"title": "Go Crazy", "album": null, "year": "2016-02-10", "lyrics": "[Intro: Young Product]\nI mean this for e'erybody who feel like\nSomethin' makin' 'em go crazy\nI know your bills need to be paid\nSomebody passed away\nSomebody ain't wit' you no more\nIt's all making you go crazy\n\n[Hook: Young Product]\nYeah, I'm 'bout to go crazy\nYeah, I'm 'bout to go crazy\nYeah, I'm 'bout to go crazy\nYeah, I'm 'bout to go crazy\n\n[Collision 1: Young Product]\nYou thinkin' your paper ain't straight, you're like\nBills need to be paid, you got to get to where you need to be\n[?] like everything fallin' apart\nBut one thing I know\n[?] next\n\n[Verse 1: Young Product]\nThey try to play with my mind, they tryna fuck with my heart\nI hear that voice in my head that told me shoot from the start\nThe other one's hold me down so I put away [?]\nI gotta do what I gotta do cause these niggas in town\nHomie [?] hit that bitch with a bat\n[?] what is you sayin'? what is they doin'?\nI mean I'm 'bout to go crazy, I'm 'bout to [?] right into it\nR.I.P. to my brother [?] reason he dead\nHe having nightmares about it while I be layin' in bed\nHe be waking me up in cold sweats\n[?] pick up my phone [?] start and send out threats\nSo give me a reason, this is the season\n[?] fuck a nigga up [?]\nIf you play with my bread, no-no-no it will not phase me\nBitch I'm 'bout to go crazy\n\n[Hook: Young Product]\nYeah, I'm 'bout to go crazy\nYeah, I'm 'bout to go crazy\nYeah, I'm 'bout to go crazy\nYeah, I'm 'bout to go crazy\n\n[Collision 2: Young Product]\n[?] out here\nY'all know what's happen', everything\nIt's all hectic, you can't trust a mother\n[?] business\n\n[Verse 2: Young Product]\nThey like my bitch on some bullshit, tryna fuck up the love\nNo I can't pull a OJ, hands can't fit in a glove\nWhy my family disowned me like they left me for dead?\nIt got me spinnin' in circles, I got my hands on my head\nWhat the fuck goin' on? If they right were they wrong?\nThey got your boy feeling weak still I gotta be strong\nGotta keep vision clear and learn to play my position\n[?] think what you don't know, that's the bitchin' tuition\nI'm screaming 'fuck the world,' it's not a game\nAnd they got me going crazy but still I'm sane\n[?] runnin', got me thinkin' 'bout jumpin'\nI mean like right over a bridge, don't give a fuck about nothin'\nSo tired of the bullshit, the critics, the fakes\nAbout to give 'em a full clip, or whatever it takes\nCause these niggas is shady, it never could fade me\nDon't nothin' amaze me, bitch I'm 'bout to go crazy\n\n[Hook: Young Product]\nYeah, I'm 'bout to go crazy\nYeah, I'm 'bout to go crazy\nYeah, I'm 'bout to go crazy\nYeah, I'm 'bout to go crazy\n\n[Collision 2: Young Product]\n[?] out here\nY'all know what's happen', everything\nIt's all hectic, you can't trust a mother\n[?] business\n\n[Verse 3: Royce Da 5'9\"]\nI keep that gun in my gear, who tryna front on me where?\nYou actin' crazy this year, act like there's gum in yo hair\n[?] sick thoughts, eat a dick bitch, get lost\nThe light bulbs ceiling at my crib but piss off Chris Bosh\nUh, yeah I'm 'bout to go crazy\nAt the Gucci store, you 'bout to go to Old Navy\nOn that funny shit, lying on your gun and dick\nI keep it one-hundred, y'all keep it twenty-six\nNickel's the name, grippin' the pistol became\nMy way of life when I came outside of my mommas insane asylum vagina\nI paid dues, the game gave me back my change in diamonds\nIt's ironic I came inside of your dame inside of the Cayman Islands\nI'm one of the greats fool, the only thing\nThat me and Michael Jordan don't got in common is I don't fake moves\nY'all niggas get zero action, the temperature of my chamber's zero\nEverywhere we go we shine: Tito Jackson\n\n[Hook: Young Product]\nYeah, I'm 'bout to go crazy\nYeah, I'm 'bout to go crazy\nYeah, I'm 'bout to go crazy\nYeah, I'm 'bout to go crazy\n\n[Collision 3/Outro: Young Product]\nCan't even trust your own bitch no more mane\n[?] she fuckin' and suckin' on [?]\nAnd you don't even know, [?] all that money on that hoe\nSo when you find out you gon' go crazy nigga\nI feel like 'nigga I told you, I told you nigga'\nAnd [?] shit\nNow you wanna give it all up\nI feel you nigga\nGo crazy", "image": "https://images.rapgenius.com/909cb16c6bdcf0b297ceae5953ba8d60.640x640x1.jpg"}], "artist": "Royce da 5'9'’"}