{"songs": [{"title": "Bad Guy", "album": "The Marshall Mathers LP2", "year": "2013-11-05", "lyrics": "Part 1: Produced by S1 and M-Phazes\n\n[Verse 1]\nIt's like I'm in this dirt, digging up old hurt\nTried everything to get my mind off you, it won't work\nAll it takes is one song on the radio, you're\nRight back on it, reminding me all over again\nHow you fucking just brushed me off and left me so burnt\nSpent a lot of time tryin' to soul search\nMaybe I needed to grow up a little first\nWell, looks like I hit a growth spurt\nBut I'm coming for closure\nDon't suppose an explanation I'm owed, for\nThe way that you turned your back on me\nJust when I may have needed you most\nOh, you thought it was over? You could just close the\nChapter and go about your life like it was nothing?\nYou ruined mine, but you seem to be doin' fine\nWell, I've never recovered\nBut tonight I bet you that what you're\n'Bout to go through's tougher than anything I ever have suffered\nCan't think of a better way to define poetic justice\nCan I hold grudges? Mind saying, \"Let it go, fuck this.\"\nHeart's saying, \"I will, once I bury this bitch alive\nHide the shovel and then drive off in the sunset.\"\n\n[Chorus: Sarah Jaffe]\nI flee the scene like it was my last ride\nYou see right through\nOh, you had me pegged the first time\nYou can see the truth, but it's easier to justify\nWhat's bad is good and I hate to be the bad guy\nI just hate to be the bad guy\n(Follow me, I ruh-uh-un; follow me, I ruh-uh-un)\nI just hate to be the bad guy\n(Follow me, I ruh-uh-un; follow me, I ruh-uh-un)\n\n[Verse 2]\nAnd to think I used to think you was the shit, bitch\nTo think it was you at one time I worshipped, shit\nThink you can hurt people and just keep getting away with it?\nNot this time, you better go and get the sewing kit, bitch!\nFinish this stitch, so you can reap what you sew, nitwit\nThought some time would pass and I'd forget it? Forget it!\nYou left our family in shambles\nAnd you expect me to just get over him, pretend he never existed?\nMay be gone but he's not forgotten\nAnd don't think ‘cause he's been out the pictures\nSo long that I've stopped the plottin' and still ain't comin' to get ya\nYou're wrong and that shit was rotten\nAnd the way you played him, same shit you did to me, cold\nHave you any idea the shit that I've gone through?\nFeelings I harbor? All this pent-up resentment I hold on to?\nNot once you call to ask me how I'm doin'\nLetters, you don't respond to 'em\nFuck it, I'm coming to see you\nAnd, gee, who better to talk to than you?\nThe cause of my problems\nMy life is garbage, and I'm 'bout to take it out on you\nPoof, then I'm gone, voosh\n\n[Chorus: Sarah Jaffe]\nI flee the scene like it was my last ride\nYou see right through\nOh, you had me pegged the first time\nYou can see the truth, but it's easier to justify\nWhat's bad is good and I hate to be the bad guy\nI just hate to be the bad guy\n(Follow me, I ruh-uh-un; follow me, I ruh-uh-un)\nI just hate to be the bad guy\n(Follow me, I ruh-uh-un; follow me, I ruh-uh-un)\n\n[Verse 3]\nI've been drivin' around your side of this town\nLike 9 frickin' hours and 45 minutes now\nFinally I found your new address, park in your drive\nFeel like I've been waiting on this moment all of my life\nAnd it's now arrived, and my mouth is full of saliva\nMy knife is out and I'm ducking on the side of your house\nSee, it's sad it came to this point\nSuch a disappointment I had to make this appointment\nTo come and see ya, but I ain't here for your empathy\nI don't need your apology or your friendship or sympathy\nIt's revenge that I seek\nSo I sneak vengefully, and treat your bedroom window\nLike I reached my full potential: I peeked\nContinue to peep, still bent low, then keep\nTapping the glass lightly then start to crescendo, sneak\nAll the way 'round to the back porch\nMan, door handles unlocked, shouldn't be that easy to do this\nYou don't plan for intruders beforehand?\nSurprised to see me? Cat caught your tongue?\nGag, chloroform rag, dag, almost hack-up a lung\nLike you picked an axe up and swung, stick to the core plan\nDragged to the back of a trunk by one of your fans\nIrony's spectacular, huh? Now who's a faggot, you punk?\nAnd here's your Bronco hat\nYou can have that shit back ‘cause they suck\nIt's just me, you and the music now, Slim, I hope you hear it\nWe're in the car right now – wait, here comes my favorite lyric\n\"I'm the bad guy who makes fun of people that die\"\nAnd hey, here's a sequel to my\nMathers LP just to try to get people to buy\nHow's this for a publicity stunt? This should be fun!\nLast album now, ‘cause after this you'll be officially done\nEminem killed by M and M, Matthew Mitchell\nBitch, I even have your initials\nI initially was gonna bury you next to my brother, but fuck it\nSince you're in love with your city so much, I figured, what the fuck\nThe best place you could be buried alive is right here\nTwo more exits, time is quite near\nHope we don't get stopped, no license I fear\nThat sirens I hear? Guess 90 on the freeway wasn't the brightest idea, as cops appear in my driver's side mirror\n(Oh, God! Police! Aaaghh!)\nHope Foxtrot gets an aerial shot of your burial plot, at least\nNew plan, Stan!\nSlim: \"Chauvinist pig drove in this big Lincoln Town Car\"\nWell, gotta go, almost at the bridge\nHa ha, big bro, it's for you; Slim, this is for him\nAnd Frank Ocean; oh, hope you can swim good\nNow say you hate homos again!\n\nPart 2: Produced by StreetRunner\n\n[Verse 4]\nI also represent\nAnyone on the receiving end of those jokes you offend\nI'm the nightmare you fell asleep and then woke up still in\nI'm your karma closing in with each stroke of a pen\nPerfect time to have some remorse to show for your sin\nNope, it's hopeless, I'm the denial that you're hopelessly in\nWhen they say all of this is approachin' its end\nBut you refuse to believe that it's over, here we go all over again\nBack's to the wall, I'm stacking up all them odds\nToilets clogged, yeah, ‘cause I'm talking a lot of\nShit but I'm backing it all up\nBut in my head there's a voice in the back and it hollers\nAfter the track is demolished, I am your lack of a conscience\nI'm the ringing in your ears\nI'm the polyps on the back of your tonsils\nEatin' your vocal chords after your concerts\nI'm your time that's almost up that you haven't acknowledged\nGrab for some water\nBut I'm that pill that's too jagged to swallow\nI'm the bullies you hate that you became\nWith every faggot you slaughtered\nComing back on you, every woman you insult\nBatter, but the double-standards you have\nWhen it comes to your daughters\nI represent everything you take for granted\n‘Cause Marshall Mathers, the rapper's persona\nIs half a facade, and Matthew and Stan's just symbolic\nOf you not knowing what you had 'til it's gone\n‘Cause after all the glitz and the glam\nNo more fans that are calling your name\nCameras are off, sad, but it happens to all of them\nI'm the hindsight to say, “I told you so!”\nForeshadows of all the things that are to follow\nI'm the future that's here to show you what happens tomorrow\nIf you don't stop after they call ya\nBiggest laughing stock of rap who can't call it quits\nWhen it's time to walk away, I'm every guilt trip\nThe baggage you have, but as you gather up all your possessions\nIf there's anything you have left to say\n'Less it makes an impact, then don't bother\nSo 'fore you rest your case\nBetter make sure you're packin' a wallop\nSo, one last time, I'm back\nBefore it fades into black and it's all over\nBehold the final chapter in a saga\nTryin' to recapture that lightning trapped in a bottle\nTwice, the magic that started\nIt all, tragic portrait of an artist\nTortured, trapped in his own drawings\nTap into thoughts blacker and darker\nThan anything imaginable; here goes a wild stab in the dark\nAs we pick up where the last Mathers left off", "image": "https://images.genius.com/75e03fc4a3fbaf47bf9b219389e7ead4.1000x1000x1.jpg"}], "artist": "Eminem"}