{"songs": [{"title": "Red Byers (Say Som’n Do Som’n)", "album": "Planet", "year": "2018-03-02", "lyrics": "[Intro: Big Scoob]\nSay som'n, do som'n, that's the way that I was raised\nBut we living in different ways nowadays\nBut no matter what you was taught\nEvery man must hold his own\n\n[Verse 1: Tech N9ne]\nPac told me, \"Reach the block, homies\"\nWhen the thot's know me then you get guacamole\nStill gotta watch police even if you got dough these\nHaza's will not scold me, 'cause I am not Toby\nI am a king, I made my mark on this planet, I am cha-ching\nThat's my Asian name, I get dough from rhymin' supreme\nI was poor, now I am a thing, I was low as slime in latrines\nThat's amazin' man, I put the 'woop' on it, a few moments\nThen you gon' get a new song with 'soo-woo' on it\nThe youth want it in groups to use the loop on this\nA bad man, that's what I am, an odd one\nNever ask me what your broad done\nI'ma say to the brethren Wagwan\nSolid as Haile Selassie, so it's nobody to stop me\nPlus I got Maudie to watch me, free from the thottie's debauchery\nStay away from fed's wires, come fake with us and you gonna get lead fired\n'Cause we known to say som'n, do som'n (what?), Red Byers\n\n[Chorus: Krizz Kaliko & Tech N9ne]\nAnd if I ever started to fall\nI'd land with both feet on the ground, makin' me ten feet tall\nLooking like, \"Wassup now?\" Say som'n, do som'n\n\"Wassup now?\" Say som'n, do som'n\nAh me? Say som'n, do som'n\nStill OG Say som'n, do som'n\n\n[Bridge: Big Scoob]\nIf I said it I meant it, this how I live\nI'll die for it, that's how I am\n\n[Verse 2: Tech N9ne]\nYou can't send a suburban black or white cop who never been to the hood, to the hood\n'Cause the perception they get from all the killings on the TV ain't never good, in the hood\nSo it's nervous when they give service, no courage can lead to murders\nThe squirters make them assertive and I heard it can't be refurbished\nWhen the word is \"We deserve it\" 'cause someone alerted\nWe flirted with purges, leavin' us dead and deserted\nPermanently dirted, inserted in a pine box, I'm not dyin' shot\nTryna make my time stop, N9ne got them slimes that mind pop\nAnd they never do dime drop, born on N9ne' block to crime dot\nThen the rhymes locked, where they find bop\nI can still walk on Highland, walk on Wayne, claimin' what I ought to claim\nSoft and sensitive simple suckers, they take the walk of shame\nHeads wire, like if they bled, ours, the dead flyers\nBecause we say som'n, do som'n, Red Byers\n\n[Hook: Krizz Kaliko & Tech N9ne]\nAnd if I ever started to fall\nI'd land with both feet on the ground, makin' me ten feet tall\nLooking like, \"Wassup now?\" Say som'n, do som'n\n\"Wassup now?\" Say som'n, do som'n\nAh me? Say som'n, do som'n\nStill OG Say som'n, do som'n\n\n[Bridge 2: Big Scoob]\nAll I got is my name\nLong as my name is good, I'm good\n\n[Verse 3: Tech N9ne]\nFeel evil, really though, sinister shit for illy blokes\nWho milly tote for silly folks, bustin' 'til they chilly most\nKill these broke enemies, finna be until he croaks\nLeavin' 'em wrapped in a drilly coat\nCrossin' him with a chin like a billy goat\nWe talk this way 'cause we been through so much\nImpossible to have no guts\nAnybody fakin', we say hold up, we got our street and city sewed up\nThat's from all the fightin' and bumpin', we found the light in the sunken\nHole, down is plight and dysfunction, plowed us right into something\nHours frightin' and then funkin' but the cowards pryin' and punchin'\nAnd the pal is tryna trump him, now we flyin' and bumpin'\nFlyin' higher than med tryers, we bred sires and they bed lie-ers\nThey get nothing and we got everything, Fred Meyer\nI salute the triple OG, Red Byers", "image": "https://images.genius.com/9512e7de485fe45a8b0365fd80465887.1000x1000x1.png"}], "artist": "Tech N9ne"}