{"songs": [{"title": "Gilla House Check", "album": "Red Gone Wild: Thee Album", "year": "2006-06-13", "lyrics": "[Intro] Adam F + (Redman)\nGilla fuckin' bleedin' house mate! (Yeah!)\n(Gilla House!)\nUK, Big Ben and all that fuckin' bullshit\n(Gilla House, ya heard?)\nYou fucking Muppets, you fucking cunts!\n(Gilla.. Gilla.. Gilla.. let's go!)\n\n[Redman]\nYo, yo\nMuscle my way in, '07's mine\nTattooed Gilla, feelin in my prime\nPull up a Coupe a color niggas can't find\nPlasma TV on the mirror outside\nI overdo it strong, got chicks that buck ya down\nFrom Vietnam that look like Nia Long\nI'm hot, my collar stand up like The Fonz\nTo hold my guns you need wet and karma bombs\nYou got chubby? I got chubby too\nMe starve in the park, nigga you on ComicView\nYou funny, I flood the area tsunami\nWash out the weak niggas, then I tag 'em _Dry Me_\nI'm married to the game, the bride's my music\nWhen Brick's in the house, there's a problem Houston!\nI guzzle Crunk Juice to the neck\nSo when I walk in the party ain't nobody gon' do shurrr\nRedman in-shurrr, it's the principality\nOven like wurrrm for the lyrics I burrrn\nNigga wait your turrrn, we can battle in a second\nSo I can bankrupt ya like, Chapter 11\nI'm the shit like Janet Jackson undressin\nBelieve it, when I quarterback you receive it\nSame crib on MTV Cribs mine\nI ain't lyin cause my eyes redder than iodine\nI'm back muh'fucker, so up your chain\nI'mma leave the same way I came, that's thorough\nI run up in your hood like 80 deep\nHave it sound like _Drumlines_ at A&T, muh'fucker\n\n[Hook: Redman]\nGilla House - check, Def Squad - check\nWhite tee - check, Goretex - check\nWhen we said we number one - we lied\nWe number one two three four AND five\nGilla House - check, Brick City - check\n89 - check, cash yo - check\n\"They don't give a fuck about what y'all niggas doin\"\n{*scratch: \"Holla at your b-boy-boy!*}\n\n[Redman]\nIf you find a bag of weed on the floor, pick it up\nAnd if you find it I got 10 on the dub\nI'm hard to find like pickin weed out a rug\nI'm worldwide fool, I don't care about a buzz\nDawn of the Red, goin for the bread\nI got pitbulls hooked on to a sled\nMy block'll riot like they shot Cornbread\nThe Pres'll find a missile with a foreign head\nKABOOM! Guess who stepped in the room?\nStreetsweeper out, ready to vacumn\nThen all of a sudden, you get it in the end\nLike Kane from Marlena cousin, I'm a menace\nI was broke as hell, first time I made it\nNow e'rything I own is voice activated\nBoy I'm lyin, I'm just tryin to make cheddar\nCause my doorbell is rubbin two wires together\n\n[Hook: Redman]\nGilla House - check, Wu-Tang - check\nWhite tee - check, Nike Air - check\nWhen we said we number one - we lied\nWe number one two three four AND five\nGilla House - check, Uptown - check\nPurple haze - check, cash yo - check\n\"They don't give a fuck about what y'all niggas doin\"\n{*scratch: \"Holla at your b-boy-boy!*}", "image": "https://images.genius.com/c9b22b0f67bb0481c6e2e207b714ca41.645x645x1.jpg"}], "artist": "Redman"}