{"songs": [{"title": "Nostalgia", "album": "10 Day", "year": "2010-09-15", "lyrics": "[Produced by MF Love]\n\n[Intro]\nHe should try enjoying life, rather than spending his time trying to outsmart me. While he's alive, that is\nI know what you're saying but it's not that simple, it's just human nature\nWhat's that guy doing, I wonder?\n\n[Verse 1]\nI still got orange and white cassette tapes\nTents where my neighbors came to spectate\nNiggas that's tough now used to get little in the dark\nIt's all cool now, we're all little kids at heart\nAccident prone Chance, y'all remember 'bout\nThe time I cracked my head open at Auntie Linda's House?\nFrom diapers to outfits to castles to Elmos\nFrom Santas to Grandmas to Gameboys and cell phones\nRocked your world, fourth grade talent show\nJada and Justin's birthday magic show\nGames of tips taking niggas to school\nTwo quarters and I'll bust your ass at pool, on bull\nRound here we lose best friends like every week\nI like to think we playin' a long game of hide and go seek\nAnd one day maybe I'ma find Terrance and I could lead them\nKids of the Kingdom singing 'bout freedom\n\n[Chorus]\nHeads down, eyes shut, time to play Seven Up\nHeads bowed, hands clutched, bottles gone, Heavens up\nSmile comes through, though my eyes might cry\nWhen they reminisce over you, my God\n\n[Verse 2]\nLet's take it back like Indian givers\nTo Indian burns and Jiminy Crickets\nTo the smell of Pillsbury on biscuit mornings\nTo puffy winter coats and Christmas mornings\nI used to chill with the kids next door\nAnd SpongeBob came around 'bout four\nAnd then I'd hang with Bart's guys\nAround the bend was Smart Guy\nFlipping through the picture books\nChecking through my archives\nRemember the old days, the ones you'll never get back\nAt the end of parties, passing around gift bags\nNow we blow entire O's at one kick back\nMY$FITS and mismatch that get off like wrist slaps, uhh\n\n[Chorus]\nHeads down, eyes shut, time to play Seven Up\nHeads bowed, hands clutched, bottles gone, Heavens up\nSmile comes through, though my eyes might cry\nWhen they reminisce over you, my God\nWhen they reminisce over you, my God\n\n[Verse 3]\nRemember Jeepers and Odyssey Fun World?\nYoung pimpin' like you oughta see one girl\nMama Jann, mama Charlie, and my mama Lisa\nBooster seat used to boost my kitty, Connie's Pizza\nAnd every year we made a Christmas list\nAnd Auntie Linda cooked a Christmas dish\nAnd all of our grandparents made a Christmas wish\nLike \"Lord, let me see another year like this\", uhh\n\n[Chorus]\nHeads down, eyes shut, time to play Seven Up\nHeads bowed, hands clutched, bottles gone, Heavens up\nSmile comes through, though my eyes might cry\nWhen they reminisce over you, my God\nWhen they reminisce over you, my God", "image": "https://images.genius.com/04c687414ea567ebf44f05a92c3e86ff.1000x1000x1.jpg"}], "artist": "Chance the Rapper"}