{"songs": [{"title": "No Snakes Alive (MF EP Version)", "album": "MF EP", "year": "2000-11-28", "lyrics": "MF DOOM ft. King Geedorah, Jet Jaguar, and Rodan - “No Snakes Alive (MF EP Version)”\n[Emcee(s): King Geedorah, Jet Jaguar, and Rodan]\n[Producer(s): MF DOOM (Original Instrumental from Metal Fingers - “Star Anis”)]\n\n[Verse 1: King Geedorah]\nGeedorah has arrived, you guys could take five\nBy the time it’s over, no snakes alive\nTake the dive, I’m telling you, you’re better off\nThen up against the flow that make her take her sweater off\nFrom the setoff, when it came to scripts, he could hardly brag\nIt’s the result of concentration and lollygag\nI said, “Yeah right.”  He pulled a mic out a snotty rag\nWas sealed up air-tight, and tied up in a body bag\nGet an advance and catch chance writer’s block.  After\nSpending the first and last penny, my own worst enemy\nTell me if I’m OD’ing.  Use a flow\nAnd made deals with these cats who keep sending dough, so\nThe Three-Headed set it, never get busted\nHe’s a man of his word who’s yet to be trusted\nBeats encrypted, multi-faceted, encrusted\nSweaty palm, keep mic rusted\nSort of mellow type of fellow\nWho sometimes spaz on wife like Othello\nHell no.  He only works like Illuminati\nOr Gotti.  All shotty, he might use karate\nAzar the Gaza caught cut, I’ll ask why\nA mask with the ball-style caps saying, “That’s fly”\nExact dough ‘til it stack high\nThe white hoes, black guys, the rap game’s black eye\n\n[Verse 2: Jet Jaguar]\nExhilaration, Jet Jag’s accelerations\nTouch speeds minds can’t conceive\nAchieve altered altitudes and angles, angels answer\nAura, illumination, awesome interpretation\nAwkward alarm, ankle house arrest\nWho’s best?  Monster Island Czars\nCrush pawn dreams to be king\nA frank reality, calculation could never be\nQuest destined, distant competition dusted\nDisgusted, race for second, crowded, clouded\nConfusion, conclusion: simple, plain\nSelf-education, self-made millionaires\nSerpents slithering, sidewinds searching\nStalking, heat-sensing, can’t have me\nJet Jag’s Rikki-Tikki-Tavi, superhero\nHit zero to sixty, hot pursuit, pedal to\nThe floor, handling\nLyrics, traction\nSwerving left, right\nMaking head-fakes\nPlaying high stakes\nLevitates\nQuick!  Hit breaks, they fly past, hit wall, parts\nFly loose, killer mongoose\n\n[Verse 3: Rodan]\nFake niggas continue to practice the art of intimidation\nSterile minds conceive thought for artificial insemination\nSyntax the sequence, arranging lessons so deliberate, making\nWise words clear, but population stay illiterate\nConsider it.  Gods define power, fools get rid of it, men build\nDreams on promises but lacking the will to deliver it\nYo, I dissolve connivers like saliva on tic-tacs gone\nAstray, but get the job done like socks that’s mismatched\nFlip tracks, murder snakes, drunk niggas killing six packs\nChoking on venom, suffering tricknological kickbacks\nPoverty-stricken minds with thoughts barely worth two cents\nBuild history through time, linear design on blueprints\nA nuisance lies in disguise, Eighty-Five Percent never knew\nWise men arise, pull files like Internal Revenue\nForever true, opposing self-evidence with leverage\nUpset the beast belly, concoct homogenized beverage\nClever shit, calculated sabotage, Trojan Horse\nGiftwrapped ambush, we put energy in motion that grows in force\nChosen swords strategically aligned throughout the underworld\nGod of Elevation kill Superman, rape Wondergirl\nPolice character decapitated, fake beings susceptible\nTo everyday occurrence, a fatal outcome’s inevitable\n\n[Verse 4: King Geedorah]\nMight as well join the force\nBoss.  Chance?  Take a loss like a coin-toss\nRoll with a double-headed nickel\nWhile the partner Jet Jag with the sickle, you in a pickle\nKing Geedorah, your ass needs to leave him alone\n‘Fore he cold-catch a seizure and then you’re blown\nIf he ain’t the best, he’s the best in\nThe top three out of myself, I, and me", "image": "https://images.genius.com/1cb996b05bf93651b8cfa75da57a2a1a.805x805x1.jpg"}], "artist": "MF DOOM"}