{"songs": [{"title": "Light Another", "album": "Cypress Hill", "year": "1991-08-13", "lyrics": "[Verse 1: B-Real]\nYo light one, ignite one, enjoy me like the buddha\nYou say I'm the joint, but you can call me hooda\nComputer, wizard, the butcher of scissors\nCut me up, then spark me, blow me out like a blizzard\nDwellin' your cells up, lungs start to swell up\nYour pipe's gettin' crowded, yo just forget about it\nMe, is potent, so bring an opponent\nYou could suck on that shit, I know you wanted it\n\n[Hook]\nFeel the effects of the high\nI know you feel the effects of the high\nWanna feel the effects of the high, brother?\n[Sen] B-Real, light another\n\n[Verse 2: B-Real]\nI'm smoother than a menthol cigarette\nHow could you figure, or even, consider that\nI'm, a weak seed, no, I'm the Humboldt weed\nI think that you need this spliff, this tweed\nAny type of stylee, how do you spell it\nTake a hit from LA, New York into Phillie\nHit some Visine, smell the smoke and let out\nNow do you really think you can take the red out it\n\n[Hook]\nFeel the effects of the high\nI know you feel the effects of the high\nWanna feel the effects of the high, brother?\n[Sen] B-Real, light another\n\n[Verse 3: B-Real]\nSpliff, aiyya, get on by ya\nWhy ya, want ta, turn off the fire?\nYou can't get higher, when you turn me off and\n.. aiyyo, pussy stop coughin'\nYou're wastin' the lingo, soon all the sack's gone\nHe'll take this bounty rhyme for you to stack on\nAnyway you have it, you love me like Mary Jane\nOr a 40 to the head, like my brother Kenny Wayne\nYou need to inhale, musical paraphen'\nYes musical, Muggs fixed the trend\nAhhh, just like a head\nBrain cells get lit, but I'm the joint you can't grip\nThrough, your finger, I'll start to sting ya\nSo just hear my words linger and\n\n[Hook]\nFeel the effects of the high\nI know you feel the effects of the high\nWanna feel the effects of the high, brother?\nYo Muggs, light another!\n\n[Verse 4: B-Real]\nPut me in the bambu, with just the tape deck\nAnd the white brother rewinds the cassette\nWas it, because it's funky that ya loves it?\n(Yeah man) Here's another lyric, go puff it\nDon't choke off, the hype or croak off\nWhen you blow the smoke off, hold until I get off\nOr turn off the fat joint, wanna hit that joint\nHere is the flat point, I rob it at gun point\nI'm, the High Times, you get through my rhymes\nSuck on the pipeline, sit back and recline\nYou gotta suck on, the fattie so come on and\n\n[Hook]\nFeel the effects of the high\nI know you feel the effects of the high\nWanna feel the effects of the high, brother?\nI'll just, light another\n\n[Cypress Hill]\nFeel the effects of the high\nI know you feel the effects of the high\nWanna feel the effects of the high, brother?\nYo, light another\n\nYou wanna feel the effects of the high?\nYou wanna feel the effects of the high?\nWanna feel the effects of the high, brother?\nAiyyo, light another\n\nYou wanna feel the effects of the high?\nCan you feel the effects of the high? Can you feel it?\nI feel the effects of the high -- yo can you feel it?\nYo light that motherfucker up man\nI know you feel it", "image": "https://images.genius.com/c219dd3c8a82f4fe8368158d27c1a173.897x887x1.jpg"}], "artist": "Cypress Hill"}