{"songs": [{"title": "Magic (Dedication 4)", "album": "Dedication 4", "year": "2012-09-03", "lyrics": "[Verse 1: Flow]\nAh.. Pop another percocet\nMy flow is retarded, I think I got a birth defect\nHighway to heaven Bow! Where the fuck the chauffeur at?\nThese niggas softer than the pillows on my sofa set\nI'm fighting myself cause I don't see no competition\nI don't write, I draw that pistol make your face a composition\nSo please walk away before we stomp your ass\nEveryday is halloween and you can get your pumpkin smashed\nThe ones you think your friends is really your haters\nSo just do me a favor.. and don't do me no favor\nAll I need is a blunt and a cup of purple\nI put this together, I could've been a construction worker\nNiggas looking funny, well I'm just getting blunted\nAnd everybody's wondering if I'm really with Young Money\nWell is a pig's pussy pork? Do bears be shittin'\nIn the woods and wipe they ass with a rabbit when they finish?\nTurn my swagger super mean but my bitches bad too\nAnd my flag bright red but Lortab blue, Oop!\nIsn't it ironic I tell Tunechi pass the chronic\nPurple syrup, yellow Fanta, you can call it Magic Johnson\n\n[Verse 2: Lil Wayne]\nGone off the shrooms, I'm stoned like tomb\nBitch, I do what I do like the groom\nLooking death in the eyes, kissing fear on the lips\nI'm so faded my nigga I'm 'bout to disappear in this bitch\nLike poof, there go my roof\nPow, there go my hammer\nCome around here stuntin', get jacked like O'Lantern\nTwo times for them haters, head shots for them snitches\nIf the best things in life are free then why the fuck we pay attention?\nUh, pockets on nine-months, I go dumber than a dunce\nToo many pills, too many blunts\nTwo bitches named such-and-such\nIt's Young Money we out chea, we turnt up 'bout that life\nMy pockets fat like Jack Black - If I go broke, I'mma jack whites\nMy bitch bad as fuck nigga, my goons 'bout that trigger play\nMurk one of these soft niggas, now I'm in court for a pillow case\nThis is the magic show but Tune ain't no trick ho\nFuck niggas no Chris Stokes, it's me, Flow, D4\nFishtailing out the parking lot like salmon\nShe swallowed all my kids, bitch we could of had a family\nThe way I make the purp disappear, straight vanish\nSmoke fire, spit fire\nPuff the magic dragon\nTunechi!\n\nD4 ho\nFuture fuck with me!", "image": "https://images.genius.com/1cca3a7cb35e2d8b6baa82593cc9844d.525x525x1.jpg"}], "artist": "Lil Wayne"}