{"songs": [{"title": "MC Hammer vs. Vanilla Ice", "album": null, "year": "1990-01-01", "lyrics": "[Intro: Eminem]\n\n1, 2, 6, 8, 10...\n\n[Verse 1: Eminem in the style of Vanilla Ice but rapping as himself]\n\nYO! I'm Back, to bust another fresh track\nYou say, that I have the ability to fly\nFly right pass ya ass, when I blast\nYa everytime I grab the mic, I crash a-\nNother rhyme it's a crash landin'\nEverytime I grab the mic, I'm kinda outstandin'\nCuz no-one can step to, a single a rhyme\nAnd I say \" Yo, what kept you?\nHolmes, you going too slow\nYou're too slow for the flow \" and I know\nThat Eminem is returning\nTo bust the rhyme and suckers are learning\nThat when I kinda go offbeat a little bit\nI step back to the rhyme and say\nThat I bust a rhyme all day\nMake a sucka say \"Hey!\nI cannot step to you Eminem\nCuz you are so bad, Damn\nYou're the baddest motherfucker in the whole damn land\"\nAnd you're right, cuz I am\nAnd I don't go offbeat, not once\nCuz I grab the mic and bust for months\nAnd I don't give nobody another turn\nCuz everytime I grab the mic, I don't let a brother burn\nBecause he can't step to a single rhyme that I do\nCuz you knew you're through\n\n[Verse 2: Proof (rapping as MC Hammer)]\n\nYeah, yeah, oh yeah\nNow I grab the microphone, you know I am imperial\nIs a production that rocking your stereo\nDon't front with me, cuz I am the boy\nI get on the microphone and I destroy\nNow you can take a body, that's not from Oakland\nHammer, Hammer, Hammer keeps on choking, yeah\nI can do it right and nobody will know\nFor I am the Hammer and I'm running the show\nThey come from West Indies south of California\nI wake you motherfuckers up, early in the morning, yo front!\n\n[Interlude: Eminem (hereafter rapping as Vanilla Ice)]\n\nYo Hammer, that was pretty good man\nI don't think I can step to you man, I don't know\n(Proof:  ... I'm great!)\nI'll just try but it seems like you outdo me, no matter what I do\n(Proof shouts something unintelligible)\nHere I go anyway\n\n[Verse 3: Eminem]\n\nHere I am, back to attack the whole damn land\nYou know that Vanilla Ice is hype\nI grab this mic and I rhyme all night\nMC Hammer cannot step to me\nBecause I got the rhymes and I'm truly\nSo damn hype and the place to be\nI'm rhyming on the mic on the M-I-C\nM-I-C is the abbreviation\nI grab the mic and rock the whole nation\nYou know that Vanilla Ice, is so precise and I get so nice\nGet so nice, I start developing manners\nAnd I whoop your brain like \"Scanners\"\nBecause Vanilla Ice is bad\nNow what you got to say about that dad?\n\n[Interlude: Proof]\n\nYou can't step to me boy\nI sell more records!\nYo. I know here I go.  Yo Manny gimme something yeah!\n\n[Verse 4: Proof]\n\nNow everytime I go, you know I like to start\nMy name is MC Hammer\nI rule hip hop charts\nSeven million seven million seven million sold\nAnd your shit barely even touch gold!\nNow everywhere I go, they know that I'm a star\nI'm the  H -A-M,  the M -E -R\nCuz every time I rock it they know I rock the mic\nI am MC Hammer\nAnd you know what I am like, ROAR!\n\n[Interlude]\n\nEminem:  I don't know man, I think you got me, man. I don't know. I'mma try.  Check this out.  Fallin'...\n(Music speeds up)\nProof:  Ain't no one here you sucka!\n(Music returns to normal)\n\n[Verse 5: Eminem]\n\nFallin' on the concrete real fast\nJumped in the car, slammed on the gas\nBumper to bumper the avenue's packed\nI try to get away 'cause the jackers jack\nSo I step to the rhyme and I just say I'm\nGonna bust a rhyme for the whole damn mind\nThen you say that I cannot bust a rhyme\nBut you gonna get got MC Hammer\nBecause you know you get on the mic\nAnd drop poor grammar\nAnd you can't slam a jam because I know that I am the man\nAnd all the teenagers they like ME\nYou know why? It's a scheme agents\nHave developed to sell me\nBecause I bust a rhyme so cleverly\nAnd you know that I got knowledge\nCuz I'm in show biz\nAnd I bust a rhyme all the time\nSo MC Hammer you cannot step to\nA single rhyme that I do cuz I knew\nThat you are through, you are washed up\nOh, so step to the back room\nAnd I told you that I have to scold you\nBecause I am Vanilla Ice\nI grab this mic and I get so precise\nAnd you cannot step\nSo why don't you get swept?\n\n[Interlude: Proof]\n\nNow you makin' me mad boy\nNow I'm gonna get your ass\nNow you gonna know who's on this motherfuckin' mic! Yo!\n\n[Verse 6: Proof]\n\nIt's about time that I turned out your lights\nNow I see the Vanilla Ice tryin' a chill in my freezer\nYou just don't know that your mama is a geezer\nShe say Hammer, yo Hammer, yo Hammer Hammer Hammer\nBut she jump on me because I'm a bad mamma jamma\nI did your bitch, Hammer don't play\nI got the funky shit and it goes this way\nI wish your whole ass try to step, you can't touch this\nYou fuck with the Hammer you'll be walking on crutches\nYeah that's what I'm sayin', I ain't playin'\nI'm Hammer, I'm Hammer, yes it's the Hammer Man\nMy lips may be big but I can rap better\nThan looking at your ass, you look like a piece of cheddar!\nYo though you steppin' to me, you know it's no dream\nI dig Vanilla Ice and turn his ass into whipped cream\nSo you know who's the best by far\nIt's the muthafuckin' HammeR with a capital R, roar!\n\n[Interlude]\n\nEminem: Now you made me mad.  And you know what happens when you make Vanilla Ice mad Hammer?\nProof:  What?\nEminem:  I don't like it.  So yo! (Pauses)\nProof: You scared boy?\nEminem: I ain't scared of you, Hammer. I'm just thinking. I gotta think of something clever\nEminem whispers: Ice Ice baby, too cold too cold\n\n[Verse 7: Eminem]\n\nWhen I'm through with you\nYou'll be goin' to heaven\nCuz I smash the glasses and fuck 3-5-7\n24/7 they was bangin' my cock\nI said \"yo fuck Hammer\nGet a piece of the rock, yeah\"\nI said yeah. My name is Vanilla Ice, you can't\nStep to me, you thought that you was a champ\nBut I stepped on your ass like a piece of carpet\nAnd rented you for sale like an upstairs apartment\nYo, that's my clever metaphor\nAnd every time I grab the mic you know\nKids like me cuz I'm better for\nTheir ears, because their mothers and parents\nLike to hear the way I rhyme and I make an appearance\nAnd say hey, I got a blond streak\nAnd that's why people like me cuz I'm hard as concrete\nI'm always on beat when I do this show\nYou know that Vanilla Ice has to go cuz I'm so damn fresh!\n\n[Verse 8: Proof]\n\nNow you steppin' to me punk\nThere is no maybes\nYou steppin' to me wrong and I'm gonna ICE ya baby!\nSo you say what's the matter, why Hammer loves to rap\nCuz all that shit you talkin' to Hammer is bullcrap\nNow I know a rhyme every day I'm ready\nI'm down with Dougie Fresh, Van-L is not ready\nNow everywhere I go, on MTV Rap\nThey know I'm the best cuz now I don't take no crap\nNow Vanilla Vanilla he's beaming out Hammer\nThey say yo Hammer don't put me on the slammer\nI said yo sucka, stupid muthafucka\nYou messin with me but I'm no sucka\nI already pumped it up, and already got it started\nSo steppin to me white muthafucka you'll feel broken-hearted\nSo I'm gonna pass the mic and you know about me\nHammer get off the fuckin' mic!!! I'm outie!\n\n[Outro: Eminem]\n\nYou blew me out, man, you beat me", "image": "https://images.genius.com/b379811c1415017b9f3e3a71b9d26060.400x400x1.jpg"}], "artist": "Eminem"}