{"songs": [{"title": "​voice memo 8 - SAD! video concept", "album": "? (Deluxe)", "year": "2019-09-06", "lyrics": "[XXXTENTACION & John Cunningham]\nI'm recording this\nYeah\nJust so I have it for reference\nOkay\nWhat do you want? You know what I mean? This is your video, like you can create whatever you want\nLike remember how I told you, like zoom into my eyes, then have it zoom out of the eyes and then we'll be in a different scene, we can really play on that and do like a lot of things\nWell that it makes it way easier in terms of transitioning and terms of scenes\nYeah, that's what I'm saying, all the-, each scene would zoom out of my eye and zoom into my eye, like I wanna be in the-, like this is gonna be green screen, right? We're gonna have to like, have like a chair, like a chair or a couch, right? And I want everything around me to be blacked out, like remember how in that one scene where I was like-, I was like-, I was like in the, um-, in like this blue place and shit, this time I want it to be all darkness\nLike a massive, big black room where there's-, you don't know where the end is?\nA-, a massive, big black room and you you don't know where-, where it is, and I'm like sitting-, and I'm sitting and there's a masked man in front of me, right? And they don't show his face, but you can see-\nYou said a massive man?\nSorry, I'm sorry, not a masked man, a hooded man and you can-, you don't see his face, it just shows the hood and he has on like, a cloak, and he speaks to me and he says \"They do not understand you. Do you not fear? The worst enemy is yourself and yet you seem unbothered. Although you cannot pretend like you have walked through life unscathed.\" And I'm gonna have him like-, I'm gonna come up with like, his dialog and come up with something crazy for him to say, and then it'll be like me within my own mind, little do they realize like, this is all like, my world, right? So it's like, I'm gonna come up with like, this whole concept of like amounting to the light that I can become, and like understand-, like, bro, the con-, the concept can be like genius\nSo-\nAnd then we can jump-, then we can like jump into the scene where I could say-, where as like-, 'cause then obviously it's like \"Who am I? Someone that's afraid to let go\" and then like-, you can tie those line-, you can tie those lyrics on to like, someone that's a let-, afraid to let go of my previous self in fear that the fact of who I will truly become\nLetting go of someone else, you said?\nLetting go of my previous self, you get what I mean?\nYeah\nBecause that my-, my previous self holds like, my memories hold me to the person that I was, you understand?\nYeah\nSo in the same aspect, like \"Who am I? Someone that's afraid to let go\", you see how you can tie those line-, that tie-, that tie to that concept, what do you feel that's it's missing? Because if-, if it's missing anything 'cause obviously tomorrow is Friday and Saturday is very soon, um, oh-ho, Rufus is so fucking cute, bruh\nLiterally a little leopard\nHowever, I do feel that there is things missing and I'm gonna have to come up with something for that and then prob'\nSo what you wanna do? Go to bed right now?\nNo, I'm not going to bed, I'd would like to go sit in front of my computer so I can remember exactly what I'm doing\nDo you wanna go write it down or something?\nYes\nThen go, go do it, are we done, should I-, should I dip?\nYes, yes-, no, you don't have to dip, I mean-\nI mean if you wanna dip, yeah, then you probably\nI mean, what, what else, do you think you gonna come up with anything else that's worth me staying around for?\nShit, I mean, not-nothing that I can't send to you\nAlright", "image": "https://images.genius.com/1291110191b6552f48f1db25d7cf5134.600x600x1.jpg"}], "artist": "XXXTENTACION"}