{"songs": [{"title": "Kill", "album": "EARL", "year": "2010-03-31", "lyrics": "[Intro]\nAw, nigga thought he killed me?\nAlright, that's cool, we'll see\n\n[Verse 1]\nStrict top of the crop shit\nCrushin' muthafuckas like moths in a mosh pit\nDollar cents since shit, sense I ain't lost it\nIt's in a fuckin' jar with guitar picks and bar spit\nBar spat, past tense, warriors of radness\nFuck lame, get it through your brain like dad's dick\nGo ahead, stab a friend, tell him that I'm back, bitch\nEarl leave bastards with milkiest asses\nTake a firm standin', nine on the tracklist\nEarl half the reason the reviews fantastic\nNiggas gettin' comfy on the couch, I ain't havin' it\nKickin' gluteus maximus, killin' niggas on accident\n\n[Hook]\nJust watch, I'mma kill 'em all\nJust watch, I'mma kill 'em all\nJust watch, I'mma kill 'em all\nJust watch, off 'em!\n\n[Verse 2]\nOff 'em, no off days, no debates, bitch\nBox logo, switchblade and cocaine\nIn my back pocket, take Jade on vacation\nThe hotel switch from Heartbreak to Bates quick\nRippin' out braids with bare hands amazes\nThe crowd, go crazy, hands raised, I'm laced with\nSwag by the eighth in case you wanna taste it\nFaggots wear Prada, Satan wears RMK shit\nHell's angel, crack Christ 'cross the face\nWith erasers and use Based God as his replacement\nSuper Saiyan with ruthless slayings\nEat puss, sweet puss got my tooth decayin'\n\n[Hook]\nJust watch, I'mma kill 'em all\nJust watch, I'mma kill 'em all\nJust watch, I'mma kill 'em all\nJust watch, off 'em!\n\n[Verse 3]\nNow pan the cameras back to me and Pamela's\nAmateur threesome with Hannah Montana's manager\nAnd Miley feedin' me sandwiches for my stamina\nAnd Santa's in the back laughin' cause my back's crampin' up\nMrs. Claus trippin' balls, think she had enough\nAnd by enough I mean we dope as fuck, she had a gram of us\nFlyer than your man because I'm lampin' up\nAt the airport smokin' hash with all the fuckin' baggage handlers\nFlowin' like the mothafuckin' aqueducts\nOdd Future Wolf Gang, fag damagers, bitch, eat a dick", "image": "https://images.genius.com/686e994c9078e4edf012d684e6850747.500x500x1.jpg"}], "artist": "Earl Sweatshirt"}