{"songs": [{"title": "Hercules (Extended Version)", "album": null, "year": "2019-08-15", "lyrics": "[Intro: Swizz Beatz]\nThis that Common, this that Common\nBut none that we do is ever that common (Let's go, woo)\nThis that cold, this that cold (Woo)\nAnd none that we do gon' ever be normal (Let's go)\n\n[Verse 1: Common & Swizz Beatz]\nFree a nigga mind, free a nigga dome\nFreedom is a line (Damn), even if it's long\nKeep it on the stones (Woo)\nPockets full of uh\nRocket full of uh (Damn)\nI'm cold niggas freeze like I'm 'bout to stick 'em up (Geez)\nI'm particular about my vernacular (Yes)\nI'm not particular 'bout what I got off in this cup (Shot)\nThis section man they hate us, man they say we not enough\nUh huh, started from the bottom now we up, up, up, up (Geez)\nTurn a nigga up, up\nWhy you tryna buck up?\nPhotoshop hustler, picture gettin' touched up (Come on)\nI'm a constructor of tearin' down structure\nThey wanna cuff us, really it's just us\nThat's why we kick dust off (Woo)\nNoreaga, what? What?\nLike Jigga, nigga what? What?\nWho? Who? Don't care about what other crews do\nI cruise through, crucial\nBlack like voodoo, a guru of the new, new (Yeah, yeah)\n\n[Chorus: Swizz Beatz]\nThey waitin' on you to come outside (Come outside, oh)\nJust so they can downplay your life (Downplay your life)\nBut I'm never scared (Oh), I'm never scared (Oh)\nCan't move me and I've been there (And I've been there)\n\n[Verse 2: Common & Swizz Beatz]\nNa-na-na-na now nigga now free your mind (Yeah)\nWe keep e-e-e-erupting time\nCut us we gon' bleed up divine (Geez)\nTurnin' that wood, we up and wine\nWe on the grind (Oh)\nGrinding, designing\nLike Virgil Abloh, we shining (Off)\nWe move mountains while climbing (Woo)\nI'm into fine things, like dining with fine things (Common)\nMy dreams found wings on the back of the struggle\nPull a back muscle, back to the hustle\nRap for the duffle and the black couples\nThat lay troubles down and let love do, it's diligence (Geez)\nI'm militant for villages, the villainous they pillage us\nBut will it with the real in us?\n(Talk to 'em, talk to 'em, talk to 'em)\n\n[Chorus: Swizz Beatz]\nThey waitin' on you to come outside (Outside, Goddamn, Goddamn)\nJust so they can downplay your life (Downplay your life)\nBut I'm never scared, I'm never scared (Goddamn, Goddamn)\nCan't move me and I've been there (And I've been there, yeah)\n\n[Verse 3: Common & Swizz Beatz]\nGhost of the past telling me to blast\nTelling me to fast, telling me to go whoop a nigga ass (Oh)\nVast is the task that grasp the mask cast\nOver the mass that dash for cash that last fast (Talk to 'em)\nSlow down, we can hold down\nThe fort of profound, thoughts that go 'round\nThe world is your town, it's my town\nIt's the new wave, we on high ground, come on (Hey)\n\n[Bridge: Swizz Beatz]\nWhat you just heard, was exclusive\nCommon, show team\nSomething, something, something, something\nGod damn it (God damn it, God damn it)\n\n[Verse 4: Marcato]\nRock back swallow [?] you're crazy (yeah)\nMeaning, I'm solid than you made me\nBaby, I'm sorry\nBaby, I'm changing\nNote down [?] what we're facing\nAnd see what their face is\nMy guess is not good but [?]", "image": "https://images.genius.com/aa01b6d699af7d367ff1075b897772ec.750x750x1.jpg"}], "artist": "Common"}