{"songs": [{"title": "The Iceberg", "album": "The Iceberg / Freedom of Speech... Just Watch What You Say", "year": "1989-10-10", "lyrics": "Oh baby, man, this is a funky track. Man, you got it goin' on, Ice-T my nigga, man. Yeah yeah, boy, they gonna go crazy when they hear this one, boy. Album 3, man, we still in effect, man. Yo, Ice, kick some of that pimp shit out there. Throw that fly shit at 'em\n\nI-C-E B-E-R-G\nWhat's that spell? Iceberg, baby, can't you read?\nTime to bleed, slaughter, slice\nTry to say I wasn't nice as we waxed them punks like lab mice\nDice 'em up, slice 'em up, dissect\nPut you in a boilin' pot and let your ass sweat\nCos I rap on game you think I'm weak in a freestyle?\nWell 911 you should dial\nBefore my posse makes a move on your mom's crib\nThink we got knives and guns? We got bombs, kid\nBlow up your whole block, you hear the gunshots\nThrow you in the Syndicate cellar and let your body rot\nCause I'm the coldest motherfucker that you ever heard\nCall me The Ice...or just The Iceberg\n\nOh, baby, [?] Man, you got it goin' on, man, and it's strong, baby. Kick that fly one to me about my man Evil E, aight? Come on, kick it\n\nEvil E was out coolin' with a freak one night\nFucked the bitch with a flashlight\nPulled it out and left the batteries in\nSo he could get a charge when he begin\nUsed his dick, the shit was tight\nBitch's titties start blinkin' like tail lights\nRolled her over to change a connection\nBitch's ugly face cold spoiled his erection\nI'm the Ice rhymer, a big timer\nAnd yes I'm a pimp and a player and a hustler and kinda\nA mack and a poet, impressive I know it\nDon't only rhyme for niggas 'cause I live my life co-ed\nOn the mic it's livin' breathin' hype\nA 1989 type Dolemite\nCool motherfucker, word\nCall me The Ice... or just The Iceberg\n\nOh my god, mercy mercy, man, you's the coldest mother fucker in the world, man. You's a pimp nigga, man, Ice, I love you man. Throw that one at me about Charlie Jamm\n\nCharlie Jamm fucked a freak on a ski-lift\n10 below, gave her the dick\nIt was cold and she said \"Quit!\"\nCharlie Jamm said \"Bullshit!\"\nShe said \"Oh, oh, oh my god!\"\nCharlie's dick was frozen hard\nBut she said she never felt it\nMaybe Charlie's dick melted\nYes, I'm the rhyme kicker, the hard liquor\nParental Guidance Sticker? Yeah, I'm the nigga\nTriple-X is how I rate\nI'm the one your parents hate\nI'm as cold as cold can get\nUnder pressure never sweat\nCool motherfucker, word\nCall me The Ice... or just The Iceberg\n\nOh man, Ice, Johnny Rivers' got this track just kickin', boy, you know what I'm sayin'? Me and that cat Randy Mack up here lovin' this, man. Kick the one about Donald D\n\nOut with the posse on a night run\nGirls on the corner, so let's have some fun\nDonald asked one if she was game\nBack Alley Sally was her name\nShe moved on the car and moved fast\nOn the window pressed her ass\nAll at once we heard a crash\nDonald's dick had broke the glass\nYes, I'm the big wheeler, the girl stealer\nAnd if we play cards don't let me be the dealer\nThe Ice, cool as water, hard as stone\nThe black mack of the microphone\nTalkin' shit the way I do\nRhyme Pays, the posse grew\nDid you like Power? Word\nWell this is The Ice... or just The Iceberg\n\nThat's right baby this is the Iceberg, man, you got it goin' on. Oh man, Beat Master B is in here, lovin' this, you know what I'm sayin'? Got my man [?] in the house, boy, I got my one and only Afrika Islam cold lampin', you know what I'm sayin'? I don't think nobody could fuck with the Syndicate, Ice, you's a mean bad cold motherfucker, man, you my nigga, man. Yo, Ice, could you loan me some money, though, man, 'cause you be talkin' all that pimp shit, man, why don't you just go on and hit me with uh, thirty or eighty thousand, or somethin' somethin'. Give me one of them jewels off your hand, man. Come on, Ice, man, come on man, yo. You's a pimp nigga. Ha ha, yo Ice. You know I like you a lot, man. Yeah, yeah!", "image": "https://images.genius.com/8130dc496c2cedd8004532bb340c7c91.800x800x1.jpg"}], "artist": "Ice-T"}