{"songs": [{"title": "Trouble", "album": "Born Sinner (Deluxe Version)", "year": "2013-06-18", "lyrics": "[Refrain]\n(I said) Set it off on my left, set it off on my right\n(I said) Liquor all on my breath, bitches all in my sight\n(I said) Real niggas tryna fuck, fuck niggas wanna fight\n(I said) Gun shots into the air, but I ain't scared for my life\n(I said)\n\n[Bridge]\nTroubles of this, troubles of this world\nTroubles of this, troubles of this world\n\n[Verse 1]\nYeah, god flow\nPaint a picture like a young Pablo, Picasso\nNiggas say \"Live fast, die young,\" so I drive slow\nAnd pray I die old\nIn the drop with the top low\nMet a bad bitch from Chicago, my hat wasn't cocked, yo\nKept it straight, shit, cause y'all know\nAnd if not, you'll learn how them niggas in the Chi go\nI ain't fuck her, but I'm thinking 'bout it\nMy niggas say why you gotta think about it?\nThe bitch want too much, hit my phone too much\nIf I gotta be frank about it\nAin't worth the stress\nFirst the text, then the draws, see first is sex\nThen it's calls cause the bird's obsessed\nWant flowers, cards, and the purses next\nNah, bitch can't get a dollar\nCole on Twitter, bitch can't get a follow\nCan get a nut, heard \"Can't Get Enough\"\nNow she fuck a nigga thinking that she may have hit the lotto\nNo way, Jose\nCould write a book called, \"The Things Hoes Say\"\nShow a lot of love to my sisters though\nBut these bitches so predictable\nI'm in trouble\n\n[Chorus]\nTroubles of this, troubles of this world\nGetting to the promised land\nYou don't want problems, I promise, man\nTroubles of this, troubles of this world\nI take it to the promised land\nYou don't want problems, I promise, man\n\n[Refrain]\nSet it off on my left, set it off on my right\n(I said) Liquor all on my breath, bitches all in my sight\n(I said) Real niggas tryna fuck, fuck niggas wanna fight\n(I said) Gun shots into the air, but I ain't scared for my life\n(I said)\n\n[Verse 2]\nAnd I'm going back to school\nOnly for the hoes and a class or two\nYoung bad bitch made the pastor drool\nEverybody sweat her like Catholic school\nSat next to her in the back of the class\nCheated off of her test and I'm grabbing her ass\nShe like \"Don't you know this shit already?\nNigga, ain't you rich already?\"\nYeah, but I got dumb as shit\nHanging 'round these rappers cause they dumb as shit\nBut I'm back on track, jump shot wasn't that good\nCouldn't sell crack but I rap good\nThat's one stereotype\nKnow a lot of niggas that'll marry your type\nBad bitch with a degree, I let 'em scoop ya\nI'm Koopa, I never been the Mario type\nNo saving hoes\nI ain't fooled cause a lot of cool bitches that a nigga went to school with is major hoes\nAnd they mans don't know, they mans don't know, fo' sho\nHad a nigga baby, little mans don’t know\nMama, was a freak, got it in on the low\n12 years later when my song come on, he ask\n\"Mama, did you fuck J. Cole?\"\nWhoa\n\n[Chorus]\nTroubles of this, troubles of this world\nGetting to the promised land\nYou don't want problems, I promise, man\nTroubles of this, troubles of this world\nI take it to the promised land\nYou don't want problems, I promise, man\n\n[Refrain]\nSet it off on my left, set it off on my right\n(I said) Liquor all on my breath, bitches all in my sight\n(I said) Real niggas tryna fuck, fuck niggas wanna fight\n(I said) Gun shots into the air, but I ain't scared for my life\n(I said)", "image": "https://images.genius.com/fbfa7c8b3518f456c489c0bc1cf3ffd5.1000x1000x1.jpg"}], "artist": "J. Cole"}