{"songs": [{"title": "Toot It and Boot It", "album": "The Real 4Fingaz", "year": "2010-06-08", "lyrics": "[Hook: Ty Dolla Sign]\nI met her at the club, then I said \"wassup?\"\nI took her to the crib and you know I fucked\nYeah, toot it and boot it, toot it and boot it\nToot it and boot it, that's right I toot and boot it\n\n[Verse 1: YG]\nShe think I'm cute, she wanna have sex\nGirl, knock it off, you know you can't have this\nShe think I'm cute, she wanna have sex\nGirl knock it off, you know you can't have this\nAnd she told me run that I told her run it\nAnd she never seen a trick until she met my magic stick\nGirl, I'm a pimp spit straight game, never no simp'\nAnd after we did it she was walking with a limp\nBust it open, leave it wet, you know I leave it soakin'\nWho next? I don't ever close, I stay open\nI met her in the club, you know I was drunk\nI asked her name and then I said: \"I wanna fuck\"\nAnd I'm YG and you know I fucked\nAnd she fucked back like a little slut\nAnd she fell in love, yeah and she felt stupid\nCause you know, I toot it and boot it\n\n[Hook: Ty Dolla Sign]\nI met her at the club, then I said \"wassup?\"\nI took her to the crib and you know I fucked\nYeah, toot it and boot it, toot it and boot it\nToot it and boot it, that's right I toot and boot it\n\n[Verse 2: YG]\nGirl let me toot that boot that stop actin' stupid\nActing like you don't know me, like \"Who that?\"\nWalked in the club, but I'll fly things\nI'm in the back girl, you know where to find me\nAnd I love how she think I'm cute\nAnd she don't even wanna tell me what she wanna do\nIt's me and my crew, her and her friends\nAnd they all trying to leave with us when the club ends\nAnd she toot it from the back\nAnd you know she made it clap\nAnd you know I run it back like only for one night\nAnd she know I'm on like a switch on light\nHey girl, I can have you feelin' right\nI can supply the pipe, just make sure it's tight\nWe can do it all day, only for one night\nAnd after that you gotta go cause you ain't my wife\n\n[Hook: Ty Dolla Sign]\nI met her at the club, then I said \"wassup?\"\nI took her to the crib and you know I fucked\nYeah, toot it and boot it, toot it and boot it\nToot it and boot it, that's right I toot and boot it\n\n[Versus 3: YG]\nI toot it to the left, I toot it to the right\nFuck with me, we gonna do it all night\nI seen a bad bitch, I swing my hat back\nAnd after I hit, I still on my back\nCause I toot it and boot it\nAnd made her feel stupid\nCause I toot it and boot it\nAnd made her feel stupid\n\n[Hook: Ty Dolla Sign]\nI met her at the club, then I said wassup\nI took her to the crib and you know I fucked\nYeah, toot it and boot it, toot it and boot it\nToot it and boot it, that's why I toot and boot it", "image": "https://images.genius.com/9bd59b1d0369c59b42a0ba101ed5d926.600x600x1.jpg"}], "artist": "YG"}