{"songs": [{"title": "Deep Sleep", "album": null, "year": "2018-08-27", "lyrics": "[Intro]\nNo, no, staying awake\nNo, no, staying awake\n\n[Verse 1]\nShe got a pussy like the Garden of Eden\nI tip-toe through the tulips\nAnd I'ma do me, scratch me off my to-do list\nI got flies all on my new shit\nLoose lips sink the cruise ship\nEven gigabyte get their two chip\nHavin' a pillow fight with a cute bitch\nWith a body like a belly dancer\nShe say you scared of this pussy cat, well if that's a panther\nI hope it's pink, I read her mind, yeah I read every chapter\nSit on this dick, feel like you flyin' on a pterodactyl\nI ain't got time to play no games\nGimme mind, don't play no games\nShe say she'll slit me if I'm vain, I said \"objection, sustained\"\nThis shouldn't affect my affection\nShe say she sent from Heaven\nThat's why all flights were connected\nI still use protection, if she's a blessing in disguise\nBut I swear it's a damn good disguise, because I can't tell\nShe wish she had me on lock\nBut there's so many other niggas doin' time\nIn her brain cells, damn, uh\n\n[Chorus]\nNo, no, staying awake\nAm I sleepin' with the devil?\nHow the hell should I know\nNo, no, staying awake\n\n[Verse 2]\nUh, am I sleepin' with the devil?\nHow the hell should I know\nMy heart beat echoes 'cause my insides are hallow\nIf anyone have a towel, wipe the guilt off my face\nMy high's comin' down like my stilts about to break\nShe tell shit I never heard when I thought I heard it all\nLike you perfect but not flawless but you got the perfect flaws\nAnd what goes around, comes around, out a swirly straw\nThen she put that shit on me, I feel like some dirty draws\nShe say \"just don't leave me Wayne, 'cause life is short\"\nI say \"I'm touched but baby, pimpin' ain't a contact sport\"\nShe dyed her hair, I asked her \"when's the funeral?\"\nShe laughed and said \"you crazy,\" I said \"look who's talking\"\nAnd Gisselle may leave her house without makeup and still be pretty\nBut I wonder if I leave yo' ass, would I still be shitty?\nI pour champagne on her, she put cocaine on mine\nAnd we forget everything and six-six-six nine, alright\n\n[Chorus]\nNo, no, staying awake\nHow the hell should I know, am I sleepin' with the devil?\nHow the hell should I know\nNo, no, staying awake\n\n[Verse 3]\nOh, how well do I know that I'm sleepin' with the devil\nHot pussy loosie, she be goin' at my neck\nBut I be shot, puttin' loosie, and I sweat when I'm around her\nRegret when I'm around her\nAsk me \"would I die for her?\" I say \"dead before designer\"\n'Cause I see through her flames and she see through my snow\nShe gon' be singin' the blues, hope she could hit them high notes\nPour me a drink of some few and let me spit on this ho\nI told that bitch to be cool, like the temperature low\nWith yo' fine ass, she tell me \"gimme some more\"\nLike high grass but I just trim it and go, I'm on my nigga shit\nI call her wifey, she call me a polygamist\nAnd I swear that pussy taste like Devil's Food Cake\nGive me a toothache, I feel like fool's gold on April Fool's Day\nBut I ain't a fool for love 'cause play with love, you get hurt\nPlay with pussy, get wet, play with fire, get burn, the roof\n\n[Chorus]\nNo, no, staying awake\nAm I sleepin' with the devil? Hell if I know\nNo, no, staying awake\nNo, no, staying awake\nNo, no, staying awake", "image": "https://images.genius.com/f903dae2533e450c8d3cb233aa846020.745x745x1.jpg"}], "artist": "Lil Wayne"}