{"songs": [{"title": "Gangsta Shit", "album": "Bad Boys II - The Soundtrack ", "year": "2003-07-15", "lyrics": "[Snoop Dogg - talking]\nOh, yabba dabba doo bobble\nThis is somethin new\nPuff, puff, pass and the Bo$$\nI mean what do you mean, what do you mean\nThis is only the beginnin (Doggystyle, Bad Boy)\n\n[Snoop Dogg]\nIt's a quarter past one, but it feel like two\nEy young Puff, what you want your big homey ta do?\nJust say the word and his head spat out all over the curb\nIt ain't nothin to a playa, it's like rollin some herb\nClick, clack on you fags, now I'm back in the burbs\nI'm ready to splurge, about to put you niggas in perms\nThe first and the third, is the day that I usually reserve\nTo get this money with my niggas that bird the birds\nWord to curb, my nigga you can fuck what you heard\nYou niggas talk shit, pop that bitch, now swerve (take that)\nYeah, I'm a Dogg Pound gangsta for life\nI'm twice as night, yep and I dump on sight\nGet through with ya'll as I catch my flight\nI got a show I gotta do out in Miami tonight\nWith some Colombian friends of mine\nMaybe we'll spend some time\nChoppin up some million dollar shit up outta crime a mine\n\n[Snoop Dogg - Hook] - 2X\nAnd you don't quit\nRide to the rhythm of some gangsta shit\nAnd you don't stop\n(*two gun shots*) Pop Pop nigga what? nigga huh?\n\n[Loon]\nUh, yeah, Loon\nNiggas act like niggas ain't clap at nigga before\nLike Loon never punch nigga in the jaw\nNigga quick to pop shit, never been in a war\nNigga get on my hot chick, start bendin the law\nHe the same chump nigga, used to send to the store\nRan off with twenty dollars, now don't send him no more\nHe them grimey ass niggas with the scent of a whore\nTryin a scheme on a nigga, that's clean\nThink I'm gonna scream, but a...\nLoon on some green nigga Infrared beam, malign nigga, spleen know what I mean\nIt's not a thing now (that's right)\nDo what I say, leave you by the lake, put two in your face (uh huh)\nWith shit I couldn't do around Mase\nYou better check my forte, Loon got all yay\nOn Broadway they givin nigga royal all day\nI ran through the game like Christian Fauria\nHow can the chicks ignore me, when the chicks adore me\n\n[P. Diddy]\nCome on now\n\n[Hook]\n\n[P. Diddy - talking behind Hook]\nThat's right\nC'mon, yeah\nLet's ride\n\n[Snoop Dogg]\nShoot 'em up bang bang, yeah it's a cold thang\nDiddy want Doggy to get in my baby body man\nGet 'im got 'im man, tryin a feel up his body man\nWith a lot of thangs (fuck the nigga ohhh, *gun shots*)\nA matter fact he gettin potty trained\nLivin with his momma man\nStressed and pain, no gain\nNo fame, for a nigga like the D-O\nPut a couple holes in your loud mouth zero\n\nIf you step to us, you'll get fucked up quick\nWe keep a Tek with us, that we bustin bitch\nNiggas be talkin shit, but they be walkin quick\n(P Diddy: This Doggystyle, Bad Boy bitch)\n\nWhen I pull out my nine and pop two times\nWhen you see my clique in this bitch we kickin it\nDogg's be rippin this\nSlip a clip in it, flip the script and then\nI'm the rap nigga bangin that (CRIP)\n\n[Hook] - 6X - w/ ad libs\n\n[Snoop Dogg - talking behind Hook - w/ variations]\nRide, ride ya'll\nRide, ride ya'll\nBad Boy II\n(Fuck the world)\n\nRide on a nigga, like bang on a nigga - repeated until end\n\n[Female voice - harmonizes with Hook and by herself, until the end]\n\n[P. Diddy - talking] - w/ variations\nNigga what? Nigga huh? - repeated\nDoggystyle, Bad Boy\nIt's just the beginning motherfuckers\nYeah, been doin this shit for decades ..\n\n[Snoop Dogg - talking]\nBang, bang\nYa don't quit\nYa don't stop\nPop, pop nigga\n(watch out, watch out)\nShot 'em down, leave 'em on the ground for my homies\nNigga be actin like hoes\n(*two gun shots*)", "image": "https://images.genius.com/3f1933e4953c8ae99c8fd6f8b565e612.220x220x1.jpg"}], "artist": "Snoop Dogg"}