{"songs": [{"title": "Been", "album": "Rise To Power", "year": "2007-09-18", "lyrics": "[Intro:]\nHey Dre I see you nigga, hey tell them niggas this is out man. Tell them how it's never with no (?) we're still standing man, know what I'm saying?\n\n[Bridge:]\nHell naw, they don't want it with us\nHell naw, they don't want it with the squad\nHell naw, they don't want it with the boy\nHell naw, they to go to war!\n\n[Verse 1:]\nThey like - I can't believe you fuck with Dre but\nI heard some shit about him, Jiggolo he gonna rape ya\nAnd they don't even know the half\nA 100% of (?) I look at 'em and laugh\nAnd we deceased, that's the word on the street\nAnd please quit (?) the crown (?) cheap\nAnd what about me man? They in my motherfuckin' business\nBut Suave House started it, you know we gonna finish\nThat's the situation brah, benefits and incentives\nThat means I'm countin' stacks while you niggas gettin' (?)\nGet your motherfuckin' mind right, be about your business\nJiggolo here for the limelight, the flow is so relentless\nThe beat's nasty, somebody call the censors\nPut it in your deck and they gonna beat them 12 senseless\nI driveby on the beat without a witness\nThat's 16 shots without a single apprehension\n\n[Hook:]\nWe been trill, been real, been stuntin'\nBeen pimpin', done, done it, still on that shit\nWe been ridin' big cars, big rims\nThick broads, low (?), cause they on my dick\n\n[Verse 2:]\nSo we was gone for a minute, observe and yea we back\nDre said get that ass, no pity, don't cut 'em slack\nYou, you lukewarm, I'm fire, I'm really that\nI'm so much flyer, Force 1's and fitted cap\nMan up, that's the squad, we hotter than plenty cats\nBut, players like pussies get clapped up like pity-pats\nMan, I'm in the hood, but naw, I ain't in the trap\nYou guessed it, I'm with your bitch, she lives up in my lap\nNaw, I let the speakerbox jam\nShe loves B-E-P, so where I am?\nThen I hop in the Chevy and get ghost\nWe been ridin' 24's, so your (?)\nYea, 26's to be exact\nGot the top down, titties out, 12's in the back\nAnd I'm done hot, spit it while I Jig on the track\nI can show them cool, this is where it's at\n\n[Hook:]\n\n[Verse 3:]\nMan, they see my crockpot I'm in the kitchen\nI mean that literal, cook it up like Emeril\nHip-hop general, get off my genitals\n10 to your bitch because she love to get physical\nReach pinnacle, she swallow all the minerals\nDoes her body good, she love milk, and it's identical\nSubliminal, shots flow criminal\nIf I call you out leave your career condition critical\nHave you feelin' pitiful\nI represent the South where we so hospitable\nBut niggas quick to spit a few\nShots, and they clinical\nThey don't give a fuck man, don't make them niggas get at you\nYou gonna need a miracle\nJust so you can see it through\nSay I ain't the shit, nigga must be sniffin' chemicals\nTell you what the (?)'ll do\nTake over the industry, got these niggas into me\nThat's why (?) middle finger to the enemy\n\n[Hook:]", "image": "https://images.genius.com/29b46b5e6777c0cfddcc1b604d7a2597.600x600x1.jpg"}], "artist": "Rick Ross"}