{"songs": [{"title": "Put Your Hands Up", "album": "Kiss Tha Game Goodbye", "year": null, "lyrics": "[Intro]\nTurn the fuckin beat on!\nHa!! Yeah, we back! S.D.!\nI had to switch back to Dom Perignon in rap baby!\nCock-and-run to stay in the business\nSon of a bitch! Double R, look at me now motherf..\nTwo-thousand-and-one, \"Kiss the Game Goodbye\" - let's get it on!\n\n[Verse 1: Jadakiss]\nIt's the J-A-D-A, I got beef with the feds and the D-A\nI got footage of the game, press replay\nI got bitches in the club all over me, ma take it ea-sy\nAnd y'all scared I can tell\nThat I'mma get Bucks like Milwaukee, cause like Sam, I ca' sell\nI'm that nigga y'all know that\nBang you in tha yard then slide off on the early go-back\nIn the streets I flash the cannon like Kodak\nAnd I spray threes, so say cheese\nI already told you I'm lookin for enemies\nDouble R, so of course it's better\nI love cornrows and Farrah Fawcett feathers\nIt's a message in a glass bottle read the letter\nMoney in the bank, membership, Visa sweaters\nAnd we ride or d-i-e together\n\n[Hook]\nUh uh, come on, put ya hands up\nNah, fuck that, put ya hands down\n[Ahh] Come on, put ya hands up\nNah, fuck that put ya hands down\n\n[Verse 2: Jadakiss]\nY'all know I got the master flow, fast or slow\nY'all wanna know who the best is? ask ya ho\nThe honies don't lie they love it\nAnd they cop for real, so trust me dogg, the thugs will dub it\n'Kiss hit you with consecutive hot shit\nTherefore nobody ever gon' spit like I spit\nGet money just to walk through, off the books\nSo when you mention my name, shit is off the hook\nShirts is off, titties is out\nAnd you know when I'm there, hardest niggas in the city is out\nI'm in the club, ice over the thermal, waitin' for you to try me-\nWhen the lights get low I'mma burn you\nStart with straight shots, and then pop bottles\nFlirt with the hood rats, then pop models\nYou gotta slay two or more, ma, that's our motto\nAnd y'all might get down with the team if y'all swallow\n\n[Hook]\n\n[Verse 3: Jadakiss]\n(Muahh) Kiss the game goodbye, the game is mine\nYou thought wrong? change ya mind\nI'm the nigga that'll pop the king, and scoop the queen\nAnd take over the town with a ruthless team\nNew S-Type wagon, future green\nGun heavy, pants saggin, I'm used to cream\nWho you know can make a million dollar bail on cash?\nNever did a day and got the jails on smash., K-I double\nI move the perico quick, and let the manteca bubble\n'Kiss been a boss, y'all just start workin\nNow put ya hands up 'til ya'll arms start hurtin\nAnd don't put 'em down 'til I tell you\nWhoever wanna be hard headed'll find out what the shells do\nNow you can put 'em down if you want\nBut soon as the hook come back put 'em up!\n\n[Hook]\n\n[Fade Out]", "image": "https://images.genius.com/659c95067dc52688c5cb0888483ceafc.640x640x1.jpg"}], "artist": "Jadakiss"}