{"songs": [{"title": "Let ’Em Have It", "album": "Keep Right", "year": null, "lyrics": "[KRS-One]\nWhat, yeah\nShoutout Minister Server\nWord up Super J\nMy man Byron is goin off\nMarlowe, Inebriated Beats, word\nUhh, you know what this is, word up\n\n[Hook]\nWho be rockin it constantly? (KRS)\nWho be droppin philosophy? (KRS)\nFor the real it got to be (KRS)\nThem niggas ain't stoppin me (KRS)\nWhack rappers they got to go (let 'em have it)\nSo they front on that microphone (let 'em have it)\n\n[KRS-One]\nI be comin in all wild with raw styles\nGoin that long mile, makin 'em all smile\nMake it happen, MC'n no rappin, believe me I'm strappin\nYOu see me I'm slappin, believe me you deceive me\nIt can greasy, I'm cappin, bring the action, ADD the clips\nStart subtractin, multiply them shots, you a fraction\nRaise up, blaze up, get made up\nYou wanna bug out you'll get, sprayed up - NOW~!\n(Bo bo bo bo... yeah!)\n\n[Hook]\n\n[KRS-One]\nIt's the Temple, expandin your mental\nInebriated instrumentals believe me nothin defends you\nWhen I spit, rappers be runnin out really quick\nThey come with that silly shit, but them not really it\nKris is it, them an idiot, if it wasn't for radio programmin\nYou wouldn't be feelin it, or willin it\nOriginal, metaphysical, meta-lyrical\nForever spiritual, really man, I ain't feelin you\n(Yeah! Yeah! Whattup?)\n\n[Hook]\n\n[KRS-One]\nI'm somethin like a phe-nom-enon, fast like ramadan\nYou can never tell what style I'm on\nWise like Solomon, unlike any udda mon\nIf you lookin for that bling bling, go check dat udda mon\nWhat I utter mon be butter mon, straight from the gutter mon\nBoxcutter in one hand, buck in the other one\nLyric I got a ton of 'em, gunnin 'em, not frontin 'em\nBack again, it's KRS-One and them, OHH~!\n(Woooo! ... So)\n\n[Hook]\n\n[Outro: KRS-One]\nFeel it (let 'em have it)\nSo they front on the microphone (let 'em have it)\nY'all better catch up! Ha ha\nY'all better catch up! Word up", "image": "https://images.genius.com/4f300314f4b269cd7479d10c0e1cab7e.1000x1000x1.jpg"}], "artist": "KRS-One"}