{"songs": [{"title": "Where They At?", "album": "You Nasty", "year": null, "lyrics": "Hook:\nWhere they at? Where they at?\nWhere the hoes at? Where they at?\nWhere the bitches at? Where they at?\nWhere they at? Where they at?\nYeah, where they at?\nWhere the hoes at? Where they at?\nWhere the bitches at? Where they at?\nWhere they at? Where they at?\n\nVerse 1: (Captain Save 'Em, Too $hort)\nCaptain Save 'Em:\nYall niggas always talkin bad about a breezy\nTalkin bout that young-ass, rich-ass nigga Too Sheezy\nAlways callin a woman out a name\nCallin her a \"bee-eye-itch\", now thats a shame\nWhat if somebody called your woman that?\nYoud be all up at the century club boy with your stri-nap\nTalkin bout \"I'll never save a ho\"\nThen why you have that breezy drivin your big-body benz for?\nYou say you only out to get some head, and then to stab\nBut I see you up at Monty's feedin her lobster and crab\nThey say that Captain is a playa's worst enemy, so whats next?\nYou just mad cuz I got more hoes than you got diamonds on your rolex\nToo $hort:\nI realize after makin 6 platinums in a row\nThe shit was easy, so I had to get some mo'\nI never did like stiff hoes\nI fuck like a rap, ain't no quick flows\nI'm a California nigga, born and bred\nGot a wild imagination when I'm on the bed\nI love my woman, I love her girlfriend and her sister\nFelt on her mommas booty but never kissed her\nBeen mackin on these hoes since the 8-0's\nIt don't take much for me to break hoes\nYou must be dreamin, if my bitch chose you\nWe in another lifetime, my game is foolproof\nIt won't happen, as long as she's my bitch\nI give a fuck if you fake pimps peep my shit\nCuz I'mma mack these hoes like never befo'\nAnd everytime I grab the mic I gotta better flow\n\nHook\n\nVerse 2: (Too $hort)\nI went from rappin about the clothes I was wearin at a party\nTo all the hoes that let me see their naked bodies\nIt's not an overnight transition thing\nI wasn't born pimpin hoes wearin pinky rings\nNever walked around sayin \"Who am I?\"\nCuz when I seen old movies like \"Superfly\"\nIt was my destiny, to live a pimp legacy\nAnd reach levels other niggas never see\nIn '81 I rapped friendly, but now its on\nOne day I said somethin on the microphone\nAbout sixteen hoes, suckin ten toes\nPeople loved it, thats how the story goes\nIt's true, in 1982\nMe and Freddy B sold the tapes to you\nX-rated, talkin bout bitches and thugs\nAll the dope-dealers gettin rich sellin drugs\nToo $hort bumpin in the background\nYou thought I retired, bitch I'm back now\nLike a house party, or a side show\nI got the spanish, black and white hoes\nAsk an East Oakland nigga, I bet you he know\n\"Is she mixed with japanese or fillapino?\"\nI always spit the game when I rap\nAll I wanna know is where the hoes at?\n\nHook", "image": "https://images.genius.com/96065abbdb6b1c6563ccc77d191b621b.300x300x1.jpg"}], "artist": "Too $hort"}