{"songs": [{"title": "Just So You Know", "album": "OKE: Operation Kill Everything ", "year": null, "lyrics": "[Intro]\nAnybody\nOKE\nI need anybody\nIt's the moment ya'll been waiting for\nAnybody I need\nAnybody I need\nInterscope, we had a good run right?\nHa ha\n\n[Verse 1]\nListening to that Drake album like oh shit\nThis nigga Drizzy got me thinking 'bout my old bitch\nYou know what? Fuck that bitch, fuck that bitch\nYou got some bottles in your section, you can fuck that bitch\nJesus piece was a motherfucker\nGotta thank God like a motherfucker\nInterscope ain't promote that ho\nBut Jimmy Iovine still my motherfucker\nI'm back like Joe Budden hair if he grow it\nI just signed with Cash Money, yeah nigga, you know it\nSpending all my motherfuckin' money in LIV\nLike goddamn bitch, can a motherfucker live?\nCan a motherfucker live?\nCan a motherfucker live?\nBrand new deal, drop top 'gatti\nCoconut grove, can a motherfucker LIV?\nFly as a jet, motherfuckin' lear\nMIA buzzing like a motherfucking beer\nReal nigga here, real nigga career\nBody any rap nigga, I'm so sincere\nSix bottles Ciroc, couple hoes in here\nCouple old niggas from a 4-4 in here\nNigga ain't dolo here\nGot Desert Eagles under niggas' Polo here\nBitch bag back so my logo clear\nIt's Rich Gang. Dollar signs on the big chain\nAin't nothing new, I've been fucking with Wayne\n\n[Hook]\nHanging out that window, throwing West Side up, like Pac and you know\nIn the club with Stunna popping off and you know\n20K at king of diamonds bitch, and you know\nCalifornia king ho, just so you know\nAnd you know\nAnd you know\nAnd you know\nJust so you know\n\n[Verse 2]\nListening to this Big Sean like, \"Oh shit\"\nMy lil nigga Kendrick kills you on your own shit\nBut I fuck with Sean, it's just Compton, nigga\nI helped him get his Jesus piece back from the monsters, nigga\nI've been the middle man for rap niggas and jewelry\nNiggas ask me find they shit like I'm motherfuckin' Siri\nIPhone, S nigga, five homes, yes nigga\nNew coupe snap back with the roof\nHunned 80 proof, gotta throw it back to proof\nAir Jordan Ones, North Carolina\nI'm killing these bitches like Rae Carruth\nThey salute like soldiers, nigga\nBeen woke the game up like Folgers nigga\nTreat em like lawn chairs, fold a nigga\nStill got the West Coast on my shoulders, nigga\nKey to the city, rap polices is watching\nHundred thousand on funerals\nBitches calling me Robin\nCause I'm a hood nigga, doing good, nigga\nI'm God's favorite, I wish you would nigga\n\n[Hook]", "image": "https://images.genius.com/f04f9b2892eac01c8dd7876593883785.500x500x1.jpg"}], "artist": "The Game"}