{"songs": [{"title": "Shot for Me", "album": "Take Care", "year": "2011-11-15", "lyrics": "[Produced by Noah \"40\" Shebib]\n\n[Verse 1]\nI can see it in your eyes, you're angry\nRegret got shit on what you're feelin' now\nMad cause he ain't like me\nOh you mad cause nobody ever did it like me\nAll the care I would take\nAll the love that we made\nNow you're trying to find somebody to replace what I gave to you\nIt's a shame you didn't keep it\nAlisha, Catya, I know that you gon' hear this\nI'm the man, yeah I said it\nBitch, I'm the man, don't you forget it\nThe way you walk, that's me\nThe way you talk, that's me\nThe way you've got your hair up, did you forget that's me?\nAnd the voice in your speaker right now that's me\nThat's me, and the voice in your ear\nThat's me, can't you see\nThat I made it? Yeah, I made it\nFirst I made you who you are and then I made it\nAnd you're wasted with your latest\nYeah, I'm the reason why you always getting faded\n\n[Chorus]\nTake a shot for me\nTake a shot for me\nTake a shot for me\nA shot for me\nA shot for me\n\n[Verse 2]\nOk, look, I'm honest. Girl, I can't lie, I miss you\nYou and the music were the only things that I'd commit to\nI never cheated, for the record, back when I was with you\nBut you believed in everything but me, girl, I don't get you\nShe says \"I know you changed\nI never see you cause you're always busy doing things\"\nI really wish she had a different way of viewing things\nI think the city that we're from just kinda ruined things\nIt's such a small place: not much to do but talk and listen\nThe men are jealous and the women all in competition\nAnd all your friends telling you stories that you often misinterpret\nAnd taint all the images of your \"Mr. Perfect\"\nI could tell that you been crying all night, drinking all summer\nPrayin' for your happiness, hope that you recover\nThis is one I know you hated when you heard it\nAnd it's worse because you know that I deserve it\n\n[Chorus]\nTake a shot for me\nTake a shot for me\nTake a shot for me\nA shot for me\nA shot for me\n\n[Outro]\nMay your neighbors respect you\nTrouble neglect you\nAngels protect you\nAnd heaven accept you", "image": "https://images.genius.com/a50b0608affc94c4dae3d502a65ea390.1000x1000x1.jpg"}], "artist": "Drake"}