{"songs": [{"title": "The Rain/Welcome Back/Party Hard", "album": "Everready [The Religion]", "year": "2006-11-07", "lyrics": "[Intro: Tech N9ne]\nI now pronounce me and music together, from now until the end of time\n\n[Verse 1: Tech N9ne]\nAlways on the road, doing hella shows\nDay to day high and lows, but that's just how it goes\nWhen you grinding, homie, ain't no rewinding\nTime but the family behind in this business that I'm in\nI don't feel anything and it's hard remembering\nPlaces and faces they think I'm what December brings\nThe day is just like moments turned to hours\nAutographs, sound check, radio spots and quick showers\nHit the stage and get so much love from the fans\nKeep it rough with the fellas, but I make the ladies want to dance\nAnd still I don't think you understand what's real\nWhile I'm wit' you with my wife another chance is killed\nAnd my kids all three of 'em suffer in the worst ways\n'Cause last year I missed all three of they birthdays\nSo when you see me with me eyes full of pain\nGive me love 'cause these are three of the reason why I call the road the rain\n\n[Hook]\nSo here we are now (In the rain)\nA superstar now (In the rain)\nSo far now, (In the rain)\nThe Rain (I walk in the rain)\nI live my life like (In the rain)\nJust for the limelight (Is it right, or is it wrong)\n\n[Verse 2: Alyia Yates, (Tech N9ne) and  Reign Yates ]\nMy little girl said-\nDaddy (What's up), me and Reign really miss you\nNot to mention momma always need a tissue\nI saw your picture in the paper and I kissed you\nI heard you won't be home for Halloween, is this true?\n(Right after Halloween baby) Yeah, I'm used to it\nWhy don't you teach me and Reign how to produce music?\nSo we can travel everywhere that you're traveling\nAnd be in the family, me and sissy fighting and tattling\nI know you miss that, I know you dig that\nDo your fans every wonder about where your kids at?\nIs Donny really coming to move with us in L.A.?\nWill mommy still love you and be with you everyday?\nI gotta go now, I love you daddy but slow down\nThere's not enough Tecca Nina's to go around\nReignbow's crying, she wants to talk to you badly\n(What's up Reignbow, baby?)\nI love you, daddy!\n\n[Hook: Tech N9ne]\nSo here we are now (In the rain)\nA superstar now (In the rain)\nSo far now, (In the rain)\nThe Rain (I walk in the rain)\nI live my life like (In the rain)\nJust for the limelight (Is it right, or is it wrong)\n\n[Verse 3: Tech N9ne]\nI love my fans 'cause they make it possible for me to provide for the fam\nThe fact that my life is in shambles, they could give a damn\nWhen it shakes then they chose it, fakes who hate lose it\nThey love my pain because it makes for great music\nBut in the interim this family matter is a tender one of mine\nLeave in January and come back when the winter come like:\nCalling my wife when I'm in the rain and then end up getting into a dumb fight\n'Cause she lonely, you try to console her but you ain't come right\nSo it's about what and what? You give them everything they need\nBut what they need is your presence indeed\nLife yes has been a strainer, it's like if been a stranger\nTo my kids and wife, that's the life of an entertainer\nMore money to gain, more people to change\nSwords deep in the game, the world's peeping my pain\nOut on the road cussing for sure, reaching for fame\nHealthy relationship you can't have them, when you're living life in the rain\n\n[Hook: Tech N9ne]\nSo here we are now (In the rain)\nA superstar now (In the rain)\nSo far now, (In the rain)\nThe Rain (I walk in the rain)\nI live my life like (In the rain)\nJust for the limelight (Is it right, or is it wrong)\nSo here we are now (In the rain)\nA superstar now (In the rain)\nSo far now, (In the rain)\nThe Rain (I walk in the rain)\nI live my life like (In the rain)\nJust for the limelight (Is it right, or is it wrong)\n\n[Outro/Collision: Tech N9ne & wife]\nSo we did twenty shows, I got like thirty six more, you know what I mean?\nSo when you coming home?\nUuuh like October 27th you know\nMy House of Blues show [?]", "image": "https://images.genius.com/03fc1f30c3a9ab069072c2b38b117ffe.999x1000x1.jpg"}], "artist": "Tech N9ne"}