{"songs": [{"title": "Confess", "album": "Everybody", "year": "2017-05-05", "lyrics": "[Verse 1]\nI want what I want how I want when I want it\nI’ma keep it a hunnid, I’m blunted\nI don’t give a damn, I don’t give a fuck about another man\nFuck a brother man\nI’ma make it, make it rain like the weather man\nOld girl shoulda, shoulda got a better man\nAss fat, lookin' good in my letterman\nIn the hood I’m a better man\nWish a mothafucka would, would\nWhole life I been up to no good\nChange it all if I could\nRearrange my heart, the beat good but I can’t\nI’m a sinner, not a saint\nLayers to my life, no I can’t\nCover it up with paint\nKeep on livin', livin'\nLivin' on money and women\nAs soon as I’m in 'em, I’m out\nNow the truth never come out my mouth\nSpeak life when I come in her mouth, like\n\n[Refrain]\nI’m a dirty mothafucka, a waste of life, a waste of skin\nWanna repent, don’t know where to begin\nNext of kin don’t give a damn 'bout me\nI know God don’t give a damn 'bout me\nPeople try but don’t know 'bout me\nBut the Devil said that he want my soul\nBut the Devil said that he want my soul\nGive it to me right now\nGive it to me right now\nGive it to me right now\nGive it to me right now\n\n[Chorus]\nSomebody save me\nI need you to save me\nTo wash away my sins on high\n\n[Verse 2]\nI’d rather be a different man in another world\nThan work for the man in my universe\nWonder what it feel like to take flight\nMomma told me everything gon' be alright\nI mean my life can’t be off right\nBut come to think about it\nEverybody runnin' the world seem to be all white\nCan you mothafuckas see alright?\nI mean, I need it, I want it, I gotta have it\nEvery day tragic\nIf you’re from where I’m from, everyday ain’t magic\nOn this I know\nI been telling everybody I’ma give it a go, I know\nI been there before, feel it in my soul, oh I know!\nLove it or hate it, I made it\nI did it, I lived it\nWhile the whole world lookin' at the boy like whoa!\nBaptized in a ocean of Hennessey\nReally wonder what the remedy\nTell me, how the world gon' remember me?\nGot me feelin like the enemy\nLike I ain’t got no energy\nI been lookin' for an entity\nFeelin' like I need to chill, like I need a new amenity\nFuck all that\n\n[Refrain]\nI’m a dirty mothafucka, a waste of life\nA waste of skin\nWanna repent, don’t know where to begin\nNext of kin don’t give a damn 'bout me\nI know God don’t give a damn 'bout me\nPeople try but don’t know 'bout me\nBut the Devil said that he want my soul\nBut the Devil said that he want my soul\nGive it to me right now\nGive it to me right now\nGive it to me right now\nGive it to me right now\n\n[Chorus]\nSomebody save me\nI need you to save me\nTo wash away my sins on high\n\n[Bridge]\nI know my life was lived the wrong way\nI know I did you wrong in my own way\nBut it was the flashing lights that mesmerized\nThat hypnotized the only\nPart of me you loved\nPart of me that had the strength to rise above\nPart of me you know\nPart of me you love more than to let it go\n\n[Outro: Killer Mike]\nDear God, I just wanna know why\nWhy do you put us here?\nWhy do you put us below?\nWhy do you put us subservient?\nWhy do you put us below these evil motherfuckers?\nAnd then we crawl and we scratch our way out\nWe betray each other\nWe lie, we take from one another\nAnd we told you gon' forgive us at the end\nBut the state don't forgive us\nI'm locked up and half my friends\nAnd then when I get out, or I make it out\nI'm expected to somehow give back\nTo people who never wanted to see me escape\nI'm startin' to hate the man in the mirror\nAnd it's gettin' clearer\nThat society was designed to keep me on the bottom\nSo, if you real, if you're out there for real\nPlease explain to me why\nWhy do we suffer? Why do we die?\nAnd why do the people\nWho go against everything you ever said always get ahead?\nI've done so much wrong, I don't know if I can ever be right\nBut tonight, I am in this church\nAsking you to show yourself, to reveal yourself to me\nBecause I'm tired and I don't know what else to do\nSo black I'm blue, so brown I'm down\nI done been everywhere but up, and when I finally get up\nI am ravaged with guilt and pain and shame\nAnd all I wanna do is believe in you\nThe darker you are, the closer you are to dirt\nAnd they make sure it hurts\nAnd I am tired of hurtin', man\nI'm tired of bein' looked at, second guessed, doubted, feared\nSo if you out there, do something about this\n'Cause I can't take it no more\nHelp me", "image": "https://images.genius.com/1a2c364a06d2844fd9e294ee0ea798ff.1000x1000x1.jpg"}], "artist": "Logic"}