{"songs": [{"title": "Dirty & Grimey", "album": "Dirt McGirt (Bootleg)", "year": "2004-08-23", "lyrics": "[Intro: Ol' Dirty Bastard]\n\"It's the Ol' Dirty Bastard\" - scratched up throughout\nHold on, muthfuckas, ya'll know Dirty?\n\n[Ol' Dirty Bastard]\nIt's the Ol' Dirty Bast'\nCut ya face, with a piece of old dirty glass\nBitch, shake ya dirty ass\nRun up in your stash house, on a dirty mat\nIt's the Dirt McGirt, a/k/a Osirus\nSpread my bullets around like a virus\nNigga, from the Wu-Camp, nigga\nSlap ya face with a wet food stamp, nigga\nI'mma make the world, do my dance\nTry to lock me down, but I'm back in my stance\nWave my gun around, like it's part of my hand\nBout to take this game, like, 'pardon me, man'\nDirt McGirt, I'm a family man\nBut I still hold tools like a handyman\nSay my name three times like Candyman\nIt's the what, what, what...\n\n[Hook: Swizz Beatz (N.O.R.E.) w/ Ol' Dirty Bastard acting wild]\nCuz we can do it like this\n(Yo, yo, yo, yo, Dirt McGirt\nYo, yo, yo, yo, Dirt McGirt\nYo, yo, yo, yo, Dirt McGirt\nYo, yo, yo, yo, Dirt McGirt)\nCuz we can do it like this\n(Yo, yo, yo, yo, Dirt McGirt\nYo, yo, yo, yo, Dirt McGirt\nYo, yo, yo, yo, Dirt McGirt\nYo, yo, yo, yo, Dirt McGirt)\nCuz we can do it like this\n\n[N.O.R.E.]\nWho get drunker than, N.O.R.E., on a Sunday\nAnd on the way to Sunday school, intoxicated\nSee ah, lord forgive me, I'm a ex-coke flipper\nAnd skipped on that good ol' bitch, she got a strip of these\nNiggas is bitch-made, I got a switchblade\nAnd I pack guns, shootin' niggas since the sixth grade\nMac Milli, Millitainment, it's La Familia, now\nGuess it's niggas all in your rap, ain't gotta kill you now\nNore never slack off, I smoke a pack soft\nAnd I run deep in this bitch, and let that mack off\nBing, Nore got a whole lotta bitches\nOut of character, and eating out a whole lotta dishes\nIn my lifetime, sippin' on white wine, caveza\nNore ran twiz, get a whole lotta head\nChing, simple like uno, dos, tres, ah'\nAnd I leave the crib, and grab the tech, cuz I'm the drastic\n\n[Hook 2X]\n\n[Ol' Dirty Bastard]\nOh shit! Oh shit!\nYa'll remember when me and Mariah\nI'm back with the kid, spit fire\nDirt McGirt, I break up the earth\nMy ice is white and blue, like Papa Smurf\nStash niggas like crack, throw them under the earth\nThen past the dirt pound, and ask 'em \"do it hurt, now?\"\nYa'll gonna make me back the truck\nTo the Dash, O.D.B., that's what's up\n\n[Hook]\n\n[Outro: Swizz Beatz]\nCuz we can do it like this", "image": "https://images.genius.com/035d8c96b903707a3cfd550d89c33684.400x400x1.jpg"}], "artist": "Ol’ Dirty Bastard"}