{"songs": [{"title": "Slim Shady (Unreleased)", "album": null, "year": null, "lyrics": "[Verse One: Eminem]\nI'm a pacifist, unless there’s ass to kick\nIt'll be tragic miss, If I don't fuck you bitch\nYou can take the dick you little cunt\nLick it than pass it like a blunt\nBut I’m sober now I'm done with drugs\nThat was the last chapter this is the next one\nMy place in the game is big, son\nI'm somewhere between God, Godzilla, and King Kong\nA Monster, yeah like his dick is\nThey say I'm hung like a bear, so run, run bitches\nThe chainsaw can give you staple stitches\nIf your unfaithful, just kill your wife than rape your mistress\nAnd if that don't work your a fucking retard\nI'm sick of playing games, I'm here for revenge, Dee Barnes\nSlapping up Dre for what he start-\nEd, long time ago and it left him scarred\n\n[Hook: Eminem] x2\nEverybody knows I'm crazy\nThis game isn’t gonna change me\nThere’s nothing else to say, see\nYou already know I'm Shady\n\n[Verse Two: Eminem & (Dr. Dre)]\nI’m assuming you don't want to battle\nThat will be your dying day\nInto your house bullets will rattle\nYou just cannot win this fray\nDon't believe me ask Ray (Cornrows)\n(I heard he thinks he's gangsta), but he’s really not though\n(so don't fuck with Slim), that's the goal\n(he'll burn your house down), and relocate you to the motorhomes\nHoldin' pullin' moldin' chrome\nOldest, dopest, grossest flow\nKiller, father, loving home\nFamily jealous of all this gold\nEverybody wants a million from Shady\nEven the goddamn motherfuckers who hate me\nBut I stays crazy, and sprayz AKs at babys\nMe and Drezy (Yeah Slim your Shady)\n\n[Hook 2: Eminem & (Dr. Dre)] x2\nMothefucker I told you I was (crazy)\nThe game done helped (shape me)\nThe only thing left to (say b)\nIs hey (Slim your Shady)\n\n[Outro: Eminem]\nRelapse 2 mothafuckas\nFuck you and your mothas\nDre grab the gat *gunshots*", "image": "https://images.genius.com/344374d6865ba8463a27b7b76304cb46.1000x1000x1.jpg"}], "artist": "Eminem"}