{"songs": [{"title": "You Know Me", "album": "Culdesac", "year": "2010-07-03", "lyrics": "[Verse 1]\n(Bitch, you know me)\nIf you don't like this shit I'm puttin' out, then you can blow me\nThese dollars in my pocket getting big, I gotta fold it\nIt's Cheezy in the building, more cheese than macaroni\nWhat the fuck is going on?\nI'm in her bush, before I eat, I make her mow the lawn\nMy career is like award shows, it's going long\nI make it look real easy, like I'm showing thong, huh\n(Bitch, you know me)\nI do a shot, and then I'll sip a Sobe\nI'm walking weird 'cause it's Walker that I'm wasted on\nPeople just realizing that I'm awesome, why they take so long?\nSkip around the album, it's not hard to find your favorite song\nPussy and these tracks the only things that I go crazy on\nLet me slow it down a sec, man, I cannot not be sick\nHook me up with Dimetapp\n(Bitch, you know me)\nYou think you better than I am, then show me\nThese niggas don't talk that much shit unless you let them\nAnd I let them, 'cause they know if you reply, then you respect them\nI've been working for a minute, hope this album's a success\nI'm not tryna to do Drake numbers, I'm just tryna do my best\n'Cause let's face it, if I wasn't working with Tina on pitches\nI would probably flood the market, and go Katrina, you bitches, uh\n\n[Verse 2]\n(Bitch, you know me)\nI'm sorry mama, but there isn't an old me\nThat nigga dead, but I promise, he won't die in vain\nAll I trust is money, fuck these niggas like the Crying Game\nThis is not a joke. You won't listen to what I'm sayin'\nAnd I promise to destroy any nigga who think I'm playin'\nKnow my verses can be silly, but I'm choosing not to spray rounds\nMy verse is pedophiles on the playground, okay now?\n(Bitch, you know me)\nHalf-price flat screens, yes, I work for Sony\nI kiss her hard and hit the jet, I make out like a bandit\nThey trying hard to hate me, I just don't understand it\nScreamin' at me, \"When you gonna stick to the right business\nAnd stop making rap music for these White kids-es?\"\nHuh, I make music for these tight kids\nDon't be a fucking asshole, one day, you'll have to wipe his\n(Bitch, you know me)\nI know what I am, and I'll never be hovy\n'Cause I am just different, I'm being what I am, man\nI don't need a Jesus piece, my jacket cost me 10 grand\nI'm going light speed, and I don't care if you can't see us\n'Cause I will never stop, like I am cruising in a Prius\nYou talk from far away because my money's between us\nAnd I'm working hard as hell, until I'm chilling with Aaliyah\nBitch, you know me\nBitch", "image": "https://images.genius.com/0c1ef4069c4c1c948f7d4a700c4be323.555x555x1.jpg"}], "artist": "Childish Gambino"}