{"songs": [{"title": "I Can Feel It", "album": "It’s Dark and Hell is Hot", "year": "1998-05-19", "lyrics": "[Intro: DMX]\nSometimes\nSometimes you just know\nYou just know, that's all\n\n[Chorus: Nardo]\nI can feel it coming in the air tonight\nHold on\nI've been waiting for this moment for all my life\nHold on, hold on\n\n[Verse 1: DMX]\nThe best of y'all niggas remind me of myself when I was younger\nWhen it was hunger that stopped a nigga from goin' under\nAnd you wonder why I pat you on your head and smile\nLook in your eyes and thank the Lord for my child\nMeanwhile, somethin' I gotta show you, and I hope you can take it\nGotta leave you in the desert, and I hope that you make it\nGotta put you on yo' ass to see what it does to you\nWhen you stand up, you see that I'm just showin' love to you\nOther niggas'll put a slug through you, over your ends\nCats I fucked with are real, but hey, those are your friends\nIt's just what you got comin', sometimes you don't know\nWhat you askin' for, yet you ask for more\nShut the casket door, this one here good as done\nThey thought you was a killer, you swore you'd never run\nNigga died with his gun still up in the holster\nIt is comin' in the air? Yeah, it's gettin' closer\n\n[Chorus: Nardo]\nI can feel it coming in the air tonight\nHold on\nI've been waiting for this moment for all my life\nHold on, hold on\n\n[Verse 2: DMX]\nI see life through many shades of grays and blacks\nI could take that and hit 'em with the blazin' tracks\nWhen I make that you fake cats have violent dreams\nIt takes another dog to be able to hear my silent screams\nThe Devil got a hold on me, and he won't let go\nI can feel the Lord pullin', but he movin' dead slow\nLet 'em know that amidst all this confusion\nSome of us may do the winnin', but we all do the losin'\nIt's just who does the choosin', is you goin' up or down?\nWhat have you been provin'? Just that you were a fuckin' clown\nBeen seen the bullshit but never spoke on it\n‘Cause I know that deep down you really don't want it\nI was traded the chance of bein' a child with a father\nFor a talent and bein' able to survive when it's harder\nMy balance on the high beams of life, keep my dreams in strife\nThat's why I hit these motherfuckin' streets at night – come on!\n\n[Chorus: Nardo]\nI can feel it coming in the air tonight\nHold on\nI've been waiting for this moment for all my life\nHold on, hold on\n\n[Verse 3: DMX]\nThere's a lot of shit that I let slide, ‘cause it's outta my hands\nLot of niggas I let ride, but it's not in my plans\nThat a lot of my mans is not seein' through the fog\nFamilies by the truckloads, fleein' to the morgue\nFull moon, (ah-oo) – the howlin'\n(Grr) – the growlin', (shh) – the prowlin'\nDon't know love, can't show love\nThat means you gonna need mo' love than an old thug\nBut hold up, roll up, talkin' out the side of your mouth\nIs what's gonna let niggas know why you died in your house\nWhile they lied to your spouse, told her it was suicide\nBut you and I both knew, the truth'll never die\nListen, nigga, if you scared, get a dog\nBut be prepared for the mob\n‘Cause you dead up in the fog\nAnd that's your head by the log\nI can smell it in the air, I can tell when it's there\nThis is hell and we're both here, can you feel it? Tell me yeah!\n\n[Chorus: Nardo]\nI can feel it coming\nIn the air tonight, hold on\nI've been waiting\nFor this moment for all my life\nHold on, hold on", "image": "https://images.genius.com/8314b41ccd0d9cc7825bc168024bdec2.630x630x1.jpg"}], "artist": "DMX"}