{"songs": [{"title": "Haters", "album": null, "year": null, "lyrics": "[Chorus - B.o.B]\nWe got them going down for the count\nLooking at the ground\nThat's why we got haters, that's why we got haters\nHaters everywhere we go, haters everywhere we go\nHaters everywhere we go, where we go\nHaters going down for the count\nLooking at the ground\nI think you're a hater, I think you're a hater\nHaters everywhere we go, haters everywhere we go\nHaters everywhere we go, where we go\nHaters going down for the count\n\n[Verse 1 - B.o.B]\nYes sir it's the beast from Decatur\nCan't see enemies and the haters\nReal sharp on my thing like a razor\nBlade, come clean like a shape up\nSo guess I got a game of tape up\nBut everybody going to feel the need to say something\nBut can't speak up whenever you face them\nThat's what you call microphone gangsters\nYeah, I got them okie-doke, yeah I'm raw, you know my flow\nBecause folk be acting hard, like a Viagra overdose\nTalking that noise on all them songs\nA bunch of little boys but you all look grown\nThose niggas there, and these niggas here\nIt really don't matter because they all just clones\nGo to school, read a book, be a lawyer\nHell yeah man I'm all for the cause\nAin't trying to get involved with the law sir\nBut a nigga will get caught with the Mossberg\nAnd that just ain't a threat on the song\nDon't get it wrong because this track is my own\nBecause niggas that slip they don't last long\n\n[Chorus]\n\n[Verse 2 - Wes Fif]\nHey, what the lick read homie? Me I'm doing what I always do\nGrinding, if you wasn't steady hating you'd be balling too\nI know you seen us falling through\nAll the rich niggas is on my crew\nFuck it, they can't touch us, if stuck up is what you call it cool\nOh!\nYou should of seen when I came down in that\nBlack on black, custom gator, haters face down on the mat\nSplat!\nYeah I can make a green nigga mad\nQuick, fast, flash like ten cash on his bitch ass\n[B.o.B]\nYou can tell I'm a G by the walk and the stance\nHow I play the game make them talk in the stands\nWatch how you talk when you talk to the man\nIf it ain't about bread you can talk to the hand\nI, I, show you how to get rich\nYou got a weak arm I'll show you how to pitch\nMade it so play I'll show you how to hit\nAnd tell the police I don't know about shit\nAye guy, I'm fly, something like the air\nAin't that something?\nWhen it's stunting man there's nothing like air\nHomie hold it right there, homeboy hold it down\nSpent five at the mall and had the haters going down\n\n[Chorus]", "image": "https://images.genius.com/3252379f345638f5b880f5055e0ca791.540x540x1.jpg"}], "artist": "B.o.B"}