{"songs": [{"title": "Jump", "album": "DROGAS Light", "year": "2017-01-09", "lyrics": "[Verse 1: Lupe Fiasco]\nGold medals, them my role models\nRollin' old models lowered old schools, flowin' cold\nAnd goin' gold follows\nFlower bearin', call it petals to the floor\nPower sharin', call it devils to the door\nPower, power, 'til ain't no devils anymore\nFlower-flowers, they be droppin' at the feet of my sun\nMove a thousand miles per hour down the street of my slum\nAnd who do I meet, to the beat of my drum?\nIt was little Susie Uzi, she sold crack and was a killer\nAll-bitch dope tip, wasn't trappin' with no niggas\nHad a long money minor, do that action for them figures\nHer influence fully automatic, crackin' off the Richter, yeah!\nWalked up to my ride, asked me \"Could she get inside?\"\nShe pointed at her pistol so I properly replied\nTold me, out here in the streets, she ain't have no competition\nAnd with me up on them beats\nThen we shared the same description\nWith a blunt between her lips, she said\n\"Now here's my proposition:\nYou just write a bunch of raps for me and I'ma go and spit 'em\nThen we take 'em to the radio, the DJ better spin 'em\nThen we take 'em to the record store\nAnd sell a couple million,\" woo!\n\n[Chorus: Gizzle & Lupe Fiasco]\nI already got the money, already got the bitches\nI see these other niggas, I'ma do it how they did it\nFrom a trapper to a rapper, trapper to a rapper\nWe gotta gon' do it\nTrapper to a rapper, now nigga, make it happen\n\n[Verse 2: Lupe Fiasco]\nUh, tell me call up Soundtrakk, have him send a couple beats\nNot that \"Superstar\" shit, she wanted somethin' for the streets\nSaid it might take like a month, she said it better take a week\nGave my arm a little punch and then she pointed at her heat\nSaid, \"I saw that thing the first time, you don't gotta do it twice\nBut I need a lil' more info on exactly what I write\nSome details 'bout a female, 'bout your life and what you like\"\nShe said, \"My life is like a bitch, and I'm just like my life\"\nThen pow-pow-pow-pow-pow!\nYeah, them niggas started bustin'\nLike that boycott was over and that \"we\" had overcome it\nShe said, \"Nigga, hit the gas,\" went from zero to a hundred\nNow we runnin' from some killers, I was so sick to my stomach\nShe was hangin' out the window\nWith that thumper she was dumpin'\nHad a look upon her face\nThat made me think that she was cummin'\nWe was swervin', jumped the curb\nAnd ditched the whip and started runnin'\nTried to jump over a wall, but it was a little tall\nSo we ducked behind a bush and that's how we got overlooked\nI was shook and breathin' hard\nAnd she was sittin' there smokin' kush\nThen we both started to glow, we looked around like, \"What is this?\"\nAnd then we looked up and a light\nCame down and pulled us to a ship like, \"What the fuck?\"\n\n[Chorus: Gizzle]\nI already got the money, already got the bitches\nI see these other niggas, I'ma do it how they did it\nFrom a trapper to a rapper, trapper to a rapper\nTrapper to a rapper, now nigga, make it happen (Shit!)\n\n[Verse 3: Gizzle]\nWell, now, this the shit I'm talkin' 'bout, the shit that I've been on\nYeah, lightyears outer space, but still a bitch feel right at home\nNow where the bitches? Get them intergalactic asses to clappin'\nBreak down some of that candy\nAnd roll it up in a wrapper for a rapper\nNah, I could never go back to trappin'\nAnd who needs Atlanta when you're on Saturn gettin' a lap dance\nWith a lit match in your left hand and your right hand is a gas can\nAnd at any given moment, I could burn this shit up\nWhy you standin' there just lookin', nigga? Turn that shit up\nHop in some of this alien pussy, let me know how it work\nI'm just sayin', I'm gon' be there and I ain't in no rush\n(Nah nigga!) Nah nigga, I ain't in no rush\n\n[Verse 4: Lupe Fiasco]\nAyy, I thought you couldn't rap, when you learn how to do that?\nThen what you need me for, if you already know how to flow?\nAyy, fuck that, we gotta go, we'ldn't be in this hoe\nIf you told me from the jump we wouldn't be on this UFO\nBut I think that I can fly us, stole a key so I can try it\nNever thought that I would ever be a flyin' saucer pilot\nBut first thing's gon' be first, when we get back to that earth\nI'ma go back to them raps and you can go back to that work, nigga\n\n[Chorus: Gizzle & Lupe Fiasco]\nI already got the money, already got the bitches\nI see these other niggas, I'ma do it how they did it\nNigga we're goin' home, home!\nFrom a trapper to a rapper, trapper to a rapper\nTrapper to a rapper, now nigga, make it happen\nYou can kill me, I don't care—no!\n\n[Outro: Gizzle & Lupe Fiasco]\nAyy, look, the basic thing is\nYou can do whatever you wanna do\nLike I ain't 'bout to pass up on all this shit, you see this?\nLike we time jumpin' and shit\nYou wanna go back and do what, just rap?\nYou can rap up here!\nYeah nigga, just rap\nNo, you can't, nigga, this is Space\nYou can't, fuck that, we goin' home\nDROGAS!", "image": "https://images.genius.com/df21a5c133cedab6f30681d3578b81a2.1000x1000x1.jpg"}], "artist": "Lupe Fiasco"}