{"songs": [{"title": "Splash Waterfalls", "album": "Chicken-n-Beer", "year": "2003-10-07", "lyrics": "[Ludacris] + (Sandy Coffee)\nOhhhh! Ohhhh! Ohhhh! Say it (make love to me)\nOhhhh! Ohhhh! Ohhhh! What? (fuck, meee!)\nOhhhh! Ohhhh! Ohhhh! Say it (make love to me)\nOhhhh! Ohhhh! Ohhhh! What? (fuck, meee!)\n\n[Hook: repeat 2X]\nI'm bout to throw some game, they both one and the same\nCupid's the one to blame - say it (make love to me)\nI'm bout to shed some light, cause each and every night\nYou gotta do it right - what? (fuck, meee!)\n\n[Verse One]\nThey want it nice and slow, kiss 'em from head to toe\nRelax and let it go - say it (make love to me)\nThey want it now and fast, grabbin and smackin ass\nYou gotta make it last - what? (fuck, meee!)\nTogether holdin hands, you out there spendin grands\nAnd makin family plans - say it (make love to me)\nDon't have to straighten facts, don't want no strings attached\nJust scratches on your BACK - what? (fuck, meee!)\nEx's ain't actin right, and you so glad to fight\nDinner's by candlelight - say it (make love to me)\nShe got a nigga whipped, down to ya fingertips\nTryin that freaky shit - what? (fuck, meee!)\nTurn on some Babyface, just for your lady's sake\nYou call her babycakes - say it (make love to me)\nKnow how to mack a broad, she's on your sack and balls\nYou call her Jabberjaws - what? (fuck, meee!)\n\n[Hook]\n\n[Verse Two]\nYou bout to buy a ring, she needs the finer things\nGucci designer frames - say it (make love to me)\nPurchase a nasty flick, wrap up and tie her quick\nKnow how to drive a stick - what? (fuck, meee!)\nYou both unite as one, you the moon and she's your sun\nYour heart's a beating drum - say it (make love to me)\nYou better not of came, she want to feel the pain\nThen hear her scream your name - what? (fuck, meee!)\nFollow this DICK-tionary, you're both some visionaries\nThen do it missionary - say it (make love to me)\nI hear 'em call da wild, and do it all the while\nDoggy and FROGGY style - what? (fuck, meee!)\nYou in between the sheets, lickin and eatin sweets\nAnd what you find you keep - say it (make love to me)\nYou do it standin up, orgasms hand 'em up\nY'all just don't GIVE A FUCK - what? (fuck, meee!)\n\n[Hook]\n\n[Verse Three]\nYou wanna tell the world, cause she's your favorite girl\nYour diamond and your pearl - say it (make love to me)\nNobody has to know, just keep it on the low\nAnd meet 'em right at fo' - what? (fuck, meee!)\nNothin but fights and fussin, plus there's a lot of cussin\nJust grab ahold of SOMETHIN - say it (make love to me)\nY'all do that BAD stuff, she like it rammed up\nRopes and HANDCUFFS - what? (fuck, meee!)\n\n[Hook]", "image": "https://images.rapgenius.com/5d9257c76abde676f90e459cc1dccc28.203x200x1.jpg"}], "artist": "Ludacris"}