{"songs": [{"title": "Blowe", "album": "I Got Next", "year": "1997-05-20", "lyrics": "[Intro: Redman]\nHey baby bring me something to drink in here\nSit down and watch a little TV\n\n[KRS-One]\n(static) Yo they comin'. It's crazy but I know it they comin'. Maybe not\nLately I feel it coming. I knew it, they comin'. (static) This just in\nPresident (static) I guarentee (static) Jim...Jimmy, Jimmy wake up. Jimmy!\n(static) Only the Lord can save (static) 5.99 no obligation (static) Let me\nStart to rock this mic (static) Now the polar bear hybernates (static) And\nAnd what was going through your mind right now\n\n[Verse 1: KRS-One]\nLook at these weak MC's getting G's\nNever wore BVD's or even bellbottom Lees\nPlease, with these fantisies about you selling k's\nWhen you know you bees in front of the TV eatin' grilled cheese\nOn your knees you know my steez\nKris is nice with theses M-I-Cs\nI'm Poison like BBD the plot thickens when I be hittin'\nAnd lyric lickin', flippin' any mix and over the skippin'\nAnd cable clippin', still sickenin'\nEven though some people ain't admitting\nThrough they system I keeps it kickin'\nAnd tippin' the scale I pay tuiton not bail\nDrink water not ale, MC Hammer hits it right on the nail\nI can't fail with my 7 stripes\nStrike one pierces the lung over the drum MC's become dumb\nLike \"um?\" They numb, bite the tongue over the bass drum\nI am D the MC like Run, spittin' lyrics for fun\nAnd for a sum of the bread crumb\nYou missed when you swung, I connected whole hum\nAnother one done underestimated KRS-1, yeah son\n\n[Hook: Redman & KRS-One ]\nSay blowe\nIf you really want true skill\nSay blowe\nIf you want the hip hop to build\nSay blowe\nI'll be rocking all year round\nYou better cool the F out before we go up in your mouth\n\n[Verse 2: KRS-One]\nIt's just beguuuun, to bubble\nKRS-Onnnne spells trouble\nOn the mic soooon there is no double\nI emerge from under the rumble\nCount the truth poetic construction, audio abduction\nShowbiz production for wack lyric reduction\nAnd fly rhyme instruction keep the party hoppin'\nKeep the DJs buggin' for the orthodox\nNon Xerox hip hop chatter box\nIt was dope first crack out the box with Scott LaRock\nHow MC's are washed up like sweat socks\nKRS-1 makes the heads nod\n\n[Hook]\n\nKRS-One\nYes, my son?\nTweet tweet\n(x2)\nYou know they can't compete, ain't that right\nNo doubt. You better cool the F out before we go up in your mouth\n\n[Verse 3: KRS-One]\nWhen it's my turn kid, look at what you done did\nLike my head is dreadable you edible\nI kick incredible shit, for my poeple\nI'm jackin' these like me so sue and Stretch like Bobbito overloops\nWhile you sittin' on stoops I'm rockin' mics for U.S. troops in group\nYou screwed up, oops, I can read a true crook\nLike I can read a good book\nI'm hooked on hip hop culture\nLook at the tip top lyrical structure\nFloatin' like a soap bubble that you don't wann puncture\nOr rupture, I write what I udder, mother mother mother\nThere's too many of us dying still trying and not doin'\nNot suceeding still pursueing what you doing?\nWhat you doing? What you doing?\nThe session is started departed on schedule\nI beg you please lookover my lyrical menu\nWhat other can't do I can do\nEnhancing 7 levels of your mental\nI dismantel stress, you're listening to the advanced lyrical best\nWorldwide qualified to administer any MC test\nStop guessin' class is in full session\nNow Showbiz show 'em how", "image": "https://images.genius.com/2d8a06de1f39a224dcb05e3e9195e0b4.640x640x1.jpg"}], "artist": "KRS-One"}