{"songs": [{"title": "Two Kings", "album": null, "year": "2013-09-18", "lyrics": "[Hook: Logic]\nEvery time I think I gotta go, uh\nCause if you seek then you gotta know, uh\nBitches they only care 'bout the flow, uh\nCome on you know how the story go, uh\n\n[Verse 1: Logic]\nThis the shit that never runnin', they always pretendin'\nI get condescending, ain't my word I'm bending\nJust imagine like Lennon\nThat we livin' like long division, my vision is risen\nShout out my homie in prison, shit is deeper than an incision\nOn a lower level, word to the devil\nI could feel the trouble inside\nTellin' me what to do, I never abide\nFeel the vibe\nThe second we arrive, you know we know just how to do it\nMy style they can never renew it, I bet they know it!\n\n[Hook: Logic & (King Chip)]\nEvery time I think I gotta go, uh\n'Cause if you seek then you gotta know, uh\nBitches they only care 'bout the flow, uh\nCome on, you know how the story go, uh (Uh)\nEvery time I think I gotta go, uh (What?)\n'Cause if you seek then you gotta know, uh (What?)\nBitches they only care 'bout the flow, uh (What?)\nCome on you know how the story go, uh (What?)\n\n[Verse 2: King Chip]\nShe came with a couple of friends told them come on in\nI was wonderin', do you need someone to fill you in?\nOn the reg nigga not givin' a fuck 'bout why you mad at me\nI'm hittin' that pussy standin' up on the wall like ain't no gravity\nKing Chip is what? Good observation\nHe gon' keep living while you keep observatin'\nIs that even a word? Nah but is you hatin'?\nLanguage is the art so when I talk I'm creatin'\nA whole new way to live, way to think, way to feel\nLet them bitch ass niggas know they fuck with me they gon' get killed\nThey gon' run, put that on my son, nigga don't give no fuck\nAll a nigga know is bad luck, bad luck\nKnowin' a nigga gettin' to these L's while I can doe\nWorking towards more happiness than I can handle\nLight the candle, South Africa after sexin'\nMy doors open. we smokin', chillin', relaxin'\n\n[Hook: Logic]\nEvery time I think I gotta go, uh\nCause if you seek then you gotta know, uh\nBitches they only care 'bout the flow, uh\nCome on you know how the story go, uh (Uh)\nEvery time I think I gotta go, uh\nCause if you seek then you gotta know, uh\nBitches they only care 'bout the flow, uh\nCome on you know how the story go, uh\n\n[Verse 3: Logic]\nI see through these motherfuckers like cat scans\nAnd if they talkin' back, I just give them the backhand\nThink I work for Apple the way I give 'em the Mac, man\nOnly partially ballin', motherfuckers is Pac-Man, God damn!\nI'm just playin', don't pay attention to what I'm sayin'\nEverything just a part of my plan\n'Cause really I ain't shit, I'm just a man\nChilling in my city spending money like Diddy\nHundreds and fifty's I'm spittin' greedy\nWhile you sittin' pretty, who fuckin with me?\nFirst name Bobby, but I spit that crack like I was Whitney\nStarted as a hobby but who knew back then what this shit would get me?\nAnd now they all up on the scrotum\nThe second I told 'em, these lyrics I wrote 'em\nActing like I owe'd em\nNot a lot of people understand my words cause I encode'em\nNow these bitches give me the top of the totem\nAllow me to break it down, I feel like I'm breaking down\n'Til I hit the mic cook up the shit that I'm making now\nKinda like Quentin Tarantino, these only built for cuban links\nWith Gambino's at the casino blowin' my nose with a C-note\nSome people call me Robert cause I'm all about the Dinero\nYou talk a lot of shit that's why you sound like a culero\nYou fuckin' perro my lyricism es fatal pendejo\nAll up in my business while I'm just tryna get the queso\nLife is about the peso, in English that means the money\nAnd if your buzz is as big as mine then you'll get all the honeys like\n\n[Hook: Logic]\nEvery time I think I gotta go, uh\n'Cause if you seek then you gotta know, uh\nBitches they only care 'bout the flow, uh\nCome on you know how the story go, uh (Uh)\nEvery time I think I gotta go, uh\n'Cause if you seek then you gotta know, uh\nBitches they only care 'bout the flow, uh\nCome on you know how the story go, uh", "image": "https://images.genius.com/e6426f1597db3a468b6ed91caedb4cba.500x500x1.jpg"}], "artist": "Logic"}