{"songs": [{"title": "I Just Borrow", "album": null, "year": null, "lyrics": "Okay so what's a Barbie to do, I mean?\nIt's like, it's like I'm the baddest Barbie in the fucking world\nI mean, this is some vintage Nicki Minaj shit, throwback shit\nI mean come on now it's Barbie bitch!\n\n[RU Spits:]\nI don't got a dollar tonight, I'll just borrow\nPlease let me in I'll bring you back tomorrow\nI'm tryna leave here with America's Top Model\nAnd I ain't got to spit no game I pop bottles\n\n[Nicki Minaj:]\nI ain't got a man sometimes I do borrow\nDon't care about your cars, your jewels, or your cash (nope)\nMake my own ends in a bubblegum Benz\nI ain't feeling your style but I'll fuck your friend (whoop!)\n\n[RU Spits:]\nTrick you crazy\nTryna play me\nWay cooler than AC's\nYour boy be cakey\nRoll hard like Stake Key\nDimes embrace me\nLace me, they bring the whip cream to taste me\nIf I buy you a drink you gotta compensate me\nDamn girl you bootyful, I mean beautiful\nMe and you together ain't no telling what we could do\nFlee for a week or two, you can bring your peoples too\nBullshit or not, I ain't even got a reason to\nWhen I smoke clear my dear I'm tryna leave with chu\nSlitho B's the keys, I get the vehicle\nPull up to the front\nI'm a roll another blunt (whoo!)\n\n[RU Spits:]\nI don't got a dollar tonight I'll just borrow\nPlease let me in I'll bring you back tomorrow\nI'm tryna leave here with America's Top Model\nAnd I ain't got to spit no game I pop bottles\n\n[Nicki Minaj:]\nI ain't got a man sometimes I do borrow\nDon't care about your cars, your jewels, or your cash (nope)\nMake my own ends in a bubblegum Benz\nI ain't feeling your style but I'll fuck your friend\n\n[Nicki Minaj:]\nListen play boy, boy\nI don't know why you tryna play the girl like a toy, toy\nI don't care 'bout your ends that you spend boy\nI'm tryna holla at your friend he a ten boy\nLook, you see Christian Dior on my tits\n\nI don't care if you spit, I don't care if your name RU Spits\nNicki you still a brew chick\nBut I rock with cha fella like the S Dot Kidd\nNiggas wanna know her but a bitch so cocky\n\"Miss bow for her\" 'cause my wrists so rocky\nWho gon' top me?\nWho gon' stop me?\nNickname shippy TV that where they watch me\n\n[RU Spits:]\nI don't got a dollar tonight I'll just borrow\nPlease let me in I'll bring you back tomorrow\nI'm tryna leave here with America's Top Model\nAnd I ain't got to spit no game I pop bottles\n\n[Nicki Minaj:]\nI ain't got a man sometimes I do borrow\nDon't care about your cars, your jewels, or your cash (nope)\nMake my own ends in a bubblegum Benz\nI ain't feeling your style but I'll fuck your friend\n\n[RU Spits:]\nSpits the kid that'll hit em' and dodge\nI need a chick that me rip right in my homie garage\nYou know the type?\n\n[Nicki Minaj:]\nNot Nicki Miraj\n\n[RU Spits:]\nYeah right\nLet me bring you to a place we can party all night\n\n[Nicki Minaj:]\nLook family, I don't think you understand me\nHold on a minute tell you what the plan be\nThink it's 'bout time you moved on to plan B\nYou can catch me, where your man be\n\n[RU Spits:]\nAight, listen boo, you ain't gon' be dissin RU\nIf you feeling my dude let's pull a little switch-a-roo\nSend your friend over she get hit with some pimpin' too\n'Bout to make moves, let me know, what you wan do?\n\n[RU Spits:]\nI don't got a dollar tonight I'll just borrow\nPlease let me in I'll bring you back tomorrow\nI'm tryna leave here with America's Top Model\nAnd I ain't got to spit no game I pop bottles", "image": "https://images.genius.com/361fbb0a68e9287bdc9eb1ad1f8099a7.640x640x1.jpg"}], "artist": "Nicki Minaj"}