{"songs": [{"title": "Pepsi MAX NFL Audible - Packers vs. Bears", "album": null, "year": null, "lyrics": "[Lupe Fiasco]\nWhattup, this Lupe Fiasco\nAnd you're watchin the Pepsi Max NFL Audible\n\n[Nick Javas]\nHello sports fans, we're comin down to the nitty gritty\nWho will be representin the city?\nIt's the moment that motivated you back in two-a-days\nAllow me to pass it off to Lupe, get 'em!\n\n[Lupe Fiasco]\nWelcome to Chi-Town, lie down, nah never that\nPackers and the Bears in the battle that, never lacks\nThey go forever back, to the days of Butkus\nAnd Nitschke was simply on this planet just to run blitz\n\n[Nick Javas]\nUp against each other in this\nThe 182nd clash of titans, do the math\nThey're bitter rivals for 10 short of a century\nNo time to be friendly, who's applyin the better D?\n\n[Lupe Fiasco]\nFor Chicago, comin off the end is a beast\nFar as I know, Julius the Pepper to beat\n\n[Nick Javas]\nPut the season on it but Jennings steadily beats\nThe best of the DB's to get him his TD's\n12 on the year like his quarterback wears\nBut he won't be signin any autographs here\nThe cornerback Bears got their hands to a button hook\nLike you ain't got your guard up like when that man pulls\n\n[Lupe Fiasco]\nBut the Packers better punt it out of bounds\nOr Hester's, gonna turn them into clowns and jesters\nAnd 22 be runnin through, they hummin blues\nWhile beat jacks stay outside of the beat gaps\nAnd why would you insist on tryin to split, Brian and Briggs\nSupplyin the hits, denyin them six\nSo cue the violins for the losers, a bruise to the ego\nA Superbowl ring is bein repo'd\n\n[Nick Javas]\nAnd it was right there, but now it lives in your nightmare\nThe pride of a Packer verse the fight of a Bear\nThe lion's share could only go to the king\nSee you next week, or see you in the spring\n\n[Lupe Fiasco]\nDreams of rings that gleam upon the mantle are cancelled\nIf you plan to win it playin timid\n\n[Nick Javas]\nQuite the challenge; who's gonna be tryin their talents\nIn that one final fight in the Palace? ...\n\nPepsi Max\nZero calories, maximum Pepsi taste", "image": "https://images.genius.com/b67b7f5bfbd7eb8c5c334fa8b05a2432.400x400x1.jpg"}], "artist": "Lupe Fiasco"}