{"songs": [{"title": "To Da Break of Dawn", "album": "Mama Said Knock You Out", "year": "1990-06-17", "lyrics": "[Intro]\nYeah\n(To da break of dawn)\nAll my effects involved\nAs we get funky\nProblems will resolve\nEverybody knows\nWhen it come to a situation like this\nLittle more effects\nAnd I can't resist\nSo we get funky in the house\nYouknowmsayin?\nL.L. Cool J style\nBut this ain't on a pop tip\nCheck it out\n\n[Verse 1]\nWhat is a panther? A animal that kills\nI'm like a shark with blood comin out the gills\nYou could never in your wildest dreams\nGet a piece of this gangsta lean straight from Queens\nStrong as liquor, to be seen in a limousine\nNow you're gettin done without Vaseline\nWouldn't bite because your rhymes are puppy chow\nMade another million, so competitors bow\nHomeboy, hold on, my rhymes are so strong\nNothing could go wrong, so why do you prolong\nSongs that ain't strong, brother, you're dead wrong\nAnd got the nerve to have them Star Trek shades on\nHa, you can't handle the whole weight\nSkin needs lotion, teeth need Colgate\nWise up, you little burnt up french fry\nI'm that type of guy\nAnd I slammed you know, just like a sumo\nPut him in Pampers, leave my drawers in his hamper\nWhen I'm through, you need a brand-new identity\nI was scoopin girls before you lost your virginity\nYour jam is just a dreamin MC scheme\nGettin crushed by a L.L. theme\nSomethin like Shaft, put you in a cask' - bo!\nYou little blood-clot boy, you must not know\nThe rep I keep, the MC's I peep, sweep, play cheap\nAnd freak with a chic unique technique\nGet rid of the yukmouth smile\nCause brother, you ain't got no style\n\n[Chorus]\nKeep on\n(To da break of dawn)\n(To da break of dawn)\nYeah\nKeep on\n(To da break of dawn)\nHey yo, that's kinda funky\nBut check this out here\n(Rock that shit)\n(To da break of dawn)\nYeah...\n\n[Verse 2]\nImmaculate styles I use to abuse\nMC's, so light the fuse\nAnd spread the news, you lose\nTo the damager, microphone manager\nCold crush and bruise and bandage a amateur\nThat amateur swingin a hammer\nFrom a body bag, so run and get your camera\nGet a flick of the stiff dead-shot to get swift\nBut I'm the wrong brother to dance with\nCause I don't need a partner to swing\nKeep your eyes on the Cool J ring\nShootin the gift, but you just don't shoot it right\nYou couldn't bust a grape in a fruit fight\nWouldn't throw a rock in a ghost town\nSo don't try to play post, clown\nYou know the L.L.'s back in town\nAnd all the wanna-be sherrifs is gettin shot down\nGimme that microphone\nI'mma show you the real meaning of the danger zone\nStop dancin, get to walkin\nShut your old mouth when young folks is talkin\nHuh, you little snake in the grass\nYou swing a hammer, but you couldn't break a glass\nGimme a lighter - woof!\nNow you're cut loose\nFrom that jherri curl juice\nCool J is back on the map\nAnd when I see ya, I'mma give you a slap\nThat's right, a little kick for that crap\nCause my old gym teacher ain't supposed to rap\n\n[Chorus]\nKeep on\n(To da break of dawn)\n(To da break of dawn)\nYeah\nKeep on\n(To da break of dawn)\nHey yo, that's kinda funky\nBut check this out here\n(Rock that shit)\n(To da break of dawn)\nYeah...\n\n[Verse 3]\nHow dare you stand beside me\nI'm Cool, I freeze I-c-e\nOn your trail and I'mma cut that pony tail\nYou're disobedient with the wrong ingredients\nBut I'mma drink you down over the rocks\nWhile the freak on your album cover jocks\nYou're gonna hear a real ill paragraph soon\nI took the cover right home to the bathroom\nIn the immortal words of L.L., 'hard as hell'\nYour broad wears it well\nShe's the reason that your record sold a few copies\nBut your rhymes are sloppy\nLike Oscar, and you're bound to get dropped\nAnd stopped, I ain't Murray the cop\nNor am I Felix, but I got a bag of tricks\nMr. Pusherman, gimme a fix\nSo I can show you I'm immune to them romper room tunes\nYou little hip-hop racoon\nI'm not Scarface, but I want more beef\nBefore you rapped you was a downtown car thief\nWorkin in a parking lot\nA brother with a perm deserves to get burned\nSo tell me how you like your coat cream?\nOn a cone, in a bowl, or in a wet dream?\nWith your tv on channel fuzz\nUncle L, that's how much damage he does\nHere's 5 dollars, catch a taxi cab\nTake your rhymes around the corner to the rap rehab\n\n[Chorus]\nKeep on\n(To da break of dawn)\nYeah\n(To da break of dawn)\nI say keep on\n(To da break of dawn)\n\n[Outro]\nJust wanted to funk it up a little bit\nMy man Pete Rock is up in the crib, youknowmsayin\nOver here at Marley Marl house\nJust coolin out\nMy man Clash in the house\nSippin on this Bartles & Jaymes premium peach-flavored wine cooler\nLoungin back\nKeep on\nPeace", "image": "https://images.genius.com/bcd1be70ef5ab9c3ff73557123fb8878.602x608x1.png"}], "artist": "LL Cool J"}