{"songs": [{"title": "I Got No Ceilings", "album": "No Ceilings", "year": "2009-10-31", "lyrics": "[Into: Lil Wayne]\nNo ceilings\nHaaa, yeah!\n\nParty on the beach\nP-party on the beach\nParty animal, baby let me off the leash\nI got my weed from the west\nMy pills from the east\nAnd two bottles of Goose, that's geese\n\n[Hook: Mack Maine]\nNo ceilings\n(No ceilings muthafucka!)\nTonight's gonna be a good night\nTonight's gonna be a good night\nTonight's gonna be a good good night\n\nNo ceilings\nTonight's gonna be a good night\nTonight's gonna be a good night\nTonight's gonna be a good good night\n\n[Verse 1: Lil Wayne]\nAhem\nTonight’s the night, I’m high as height\nUh, I’m young and restless, I shines my guidin' light\nAnd umm, I’m livin' right, yeah my health alright\nHuh, my money good, and my girl a dyke\nShit, let’s live it up, no dyin' down\nYeah, let’s shoot the bar, I’ll buy the rounds\nHey, I’ll take the shots, I’m bulletproof\nYeah, Nike just do it, I do what it do\nI was drinkin' before I came, when I got here I did the same\nI don’t like beer I like champagne, so cheers to Lil Wayne\nAnd if she think she get my number, just hope my number don’t change\nGirl stop playin', I got that pussy on a string\nNow let’s do it\n\n[Bridge: will.I.am]\nLet’s do it, let’s do it, let’s do it, let’s do it (No Ceilings)\nAnd do it, and do it, let’s live it up (yeah)\nAnd do it, and do it, and do it, do it, do it (ahaha)\nLet’s do it, let’s do it, let’s do it (Young Mula babbbyyy)\n\n[Hook: will.I.am]\nNo Ceilings (woo, hah)\nTonight’s gonna be a good night (No Ceilings)\nTonight’s gonna be a good night (motherfucker)\nTonight gonna be a good good night (Young Money)\nNo Ceilings\nTonight’s gonna be a good night (Now I’m about to really go in)\nTonight’s gonna be a good night (I’m going in!)\nTonight’s gonna be a good good night (Scoob I see you)\nNo Ceilings\n\n[Verse 2 - Lil Wayne]\nOkay\nKush got my Dutch fat ass fuck, Weezy F. I’m bad as luck\nI’m already at the top, I’m bout a pull the ladder up\nFlow crazy, I need a counselor, I’m Hip-Hop’s announcer\nI’m in the gun club, do you want to meet the bouncer?\nBeen a beast and still I am, now I rock and still I jam\nFew niggas with me got that white girl like Will.I.Am\nLook up bitch, ain’t no ceilings\nSee me at the top controlling things\nAnybody beat, it’s a mothafuckin' murder scene\nI do it\n\n[Bridge: will.I.am]\nLet’s do it, let’s do it, let’s do it, let’s do it\nAnd do it, and do it, let’s live it up\nAnd do it, and do it, and do it, do it, do it (yeah, haha)\nLet’s do it, let’s do it, let’s do it (No Ceilings mutherfucker)\n\n[Outro - Lil Wayne]\nYeah!\nShout out to the Black Eyed Peas\nNo Ceilings motherfucker\nYoung Mula baby\nI’m gone", "image": "https://images.genius.com/4a183c010cf184b2a9fecdfcb8e16142.320x320x1.jpg"}], "artist": "Lil Wayne"}