{"songs": [{"title": "Box Chevy", "album": "Box Chevy - Single", "year": "2013-02-15", "lyrics": "[Skit]\nGo on jump\nNo I don't wanna jump\nYes you do. You smoke crack don't you? You smoke crack don't you?\nLook at me boy, don't you smoke crack?\nYes, sir\nYou know what that does to you? Huh?\nNo, sir\nIt kills your brain cells son, it kills your brain cells! Now when you're destroying your brain cells you are doing the same thing as killing yourself, you are just doing it slower. I say if you wanna kill yourself don't fuck around with it, do it expeditiously. Now go on and jump! Jump!\n\n[Intro: Rick Ross]\nI smell pussy on these niggas man\nC'mon nig, lets do it\n\n[Refrain: Rick Ross]\nI try to let you pussy niggas eat\nIt's time to put your pussy boys to sleep\nPussy niggas always wanna talk\nI'm busy getting pussy like a fucking boss\n\n[Verse 1: Rick Ross]\nI smell a pussy from a block away\nLets shoot them pussies from a block away\nThey wanna see a nigga in a cage\nBaby mama garnishing a nigga wage\nI just went and got the Chevy sprayed\nPussy nigga wanna scratch a nigga paint\nPussy nigga wanna see you fall\nJust know to bring them choppers when you see me call\nI tried to let them pussy niggas eat\nIt's time to make you pussy boys extinct\nI took a quarter Key to Polk county\nAll my central Florida nigga straight 'bout it\nBroke down the brick I'm back in Bartow\nBelle Glade box Chevy on my car phone\nJ-Ville I went and bought a condo\nBack to the crib where I get it by the car load\n\n[Chorus: Rick Ross]\nI started with a box Chevy\nThen I got the blue Lexus\nMy bitch stay down with me\nSo now she got the new Lexus\n\n[Verse 2: Rick Ross]\nI went and got my bitch her very own salon\nGet her hair do everyday do the fuck she want\nI started in a box Chevy\nNow my watch a buck eighty\nI heard the same pussy niggas hatin'\nThe killers comin stay patient\nI made a killing milkin Okeechobee\nI'm talkin millions with that okey dokey\nPop a molly now that bitch sweatin'\nOr is it just a nigga necklace?\nI tried to let you pussy niggas eat\nI pray that all you pussy boys decease\n\n[Chorus: Rick Ross]\nI started with a box Chevy\nThen I got the blue Lexus\nMy bitch stay down with me\nSo now she got the new Lexus\n\n[Refrain: Rick Ross]\nI try to let you pussy niggas eat\nIt's time to put your pussy boys to sleep\nPussy niggas always wanna talk\nI'm busy getting pussy like a fucking boss\n\n[Chorus: Rick Ross]\nI started with a box Chevy\nThen I got the blue Lexus\nMy bitch stay down with me\nSo now she got the new Lexus", "image": "https://images.rapgenius.com/8146956677cdff316ced35e29f102e74.500x500x1.jpg"}], "artist": "Rick Ross"}