{"songs": [{"title": "In the Trunk", "album": "K.O.D.", "year": "2009-10-26", "lyrics": "[Hook: Tech N9ne]\n(Threw her in the trunk)\nWas tryin' to smash, get her cash\nBut her mouth was hella fast, so I threw her ass (in the trunk!)\nAnd even though she had a big plump rump\nI threw her in and let the beat bump\n(Threw her in the trunk!)\n(Threw her in the trunk)\nWas tryin' to smash, get her cash\nBut her mouth was hella fast, so I threw her ass (in the trunk!)\nAnd even though she had a big plump rump\nI threw her in and let the beat bump\n(Threw her in the trunk!)\n\n[Verse 1: Tech N9ne]\n2K11, ridin' solo\nIn the Benz on twins hella low pro\nSlangin' CDs out the trunk for mo' dough\nMy mojo said, \"a thick bitch\" so I go slow\nI pull it over tryin' to get up on her bumper\nWantin' to crunch her so I said, \"baby my new CD is a slumper\"\nIt'll make the trunk thunder, girl your rump give me lumber\nUp under the sheets I can put you in a real deep slumber\nBut she said fuck Tecca Nina didn't feel her\nDid everything within' my power not to kill her\nDisrespectful bitch I really wish that I can grill her\nLight on my head that said put her in the trunk man you can steal her\nI put the hater bitch in a head lock, she flippin' out\nI pop the trunk she crunk but I ain't 'bout to chicken out\nI'm sick and tired of bein' nice and lettin' shit go by\nShe said fuck that Tech N9ne bullshit so I\n\n[Hook: Tech N9ne]\n(Threw her in the trunk)\nWas tryin' to smash, get her cash\nBut her mouth was hella fast, so I threw her ass (in the trunk!)\nAnd even though she had a big plump rump\nI threw her in and let the beat bump\n(Threw her in the trunk!)\n(Threw her in the trunk)\nWas tryin' to smash, get her cash\nBut her mouth was hella fast, so I threw her ass (in the trunk!)\nAnd even though she had a big plump rump\nI threw her in and let the beat bump\n(Threw her in the trunk!)\n\n[Verse 2: Tech N9ne]\nI'm bumpin' everything that beat like gangsta shap\nI bangs the rap, in her ear 'til she gives thanks to that\nNever take a prisoner where you hang your hat\nI'ma roll around with her in the trunk\nPoppin' that Tech N9ne slump 'til the little bitch faint collapse\nI'ma roll to Topeka\nTecca Nina'll reach her if I gotta double back to Eureka\nCrispy flows through my tweeters\nBumpin' this ring when I roll through atita\nWait a minute I think this bitch is trying to kick a hole through my speakers\nGet my gun then I open the trunk and said\n\n[Interlude: Tech N9ne]\nGet out the god damn trunk, get on the ground! Take off your god damn belt!\nPut it 'round your ankles, I'ma tie up your wrist myself! (Okay, okay)\nI just wanted to drink and show you what the dong'll do!\nBITCH! The hell wrong with you?\n\n[Verse 3: Tech N9ne]\nEyy, the hot sex was not slam dunked\nRolled for hours then I stopped right off Van Brunt\nWhen a bitch talkin' crazy like a lost man's chump\nShort say \"I throw a bitch in the god damn trunk!\"\n\n[Hook: Tech N9ne]\n(Threw her in the trunk)\nWas tryin' to smash, get her cash\nBut her mouth was hella fast, so I threw her ass (in the trunk!)\nAnd even though she had a big plump rump\nI threw her in and let the beat bump\n(Threw her in the trunk!)\n(Threw her in the trunk)\nWas tryin' to smash, get her cash\nBut her mouth was hella fast, so I threw her ass (in the trunk!)\nAnd even though she had a big plump rump\nI threw her in and let the beat bump\n(Threw her in the trunk!)\n\n[Verse 3: Tech N9ne]\nHours turned to days, days turned to weeks\nHad to drill holes in the trunk so she can drink and eat\nWhatever I stuffed through the holes hot dogs and ho-hoes\nKidnapped on the low low, spoke no mo' oh no go slow, there the po-po\nI gotta ditch this bitch with the quickness\nMan I just remembered this benzo is lifted\nFrom Swope Park, that's where I'm 'bout to go dart, let her know art\nFor the evil bitch and the brainless witch with no heart, it got so dark\n\n[Interlude: Newswoman]\nPolice are still looking for 21 year old Crystal Nelson\nWho has been missing since last Sunday\nFriends and family told police that they thought this was\nYet another one of Crystal's weekend excursions\nBut after all this time, they're still worried sick\n\n[Verse 4: Tech N9ne]\nIt's been fun momma, fed her my catalog like Adderall\nFucked up in the trunk with rump is how I had her y'all\nIn a ditch, walked back to the trunk, wicked is how I sounded\nWhispered, \"Bet that you love Tech N9ne now, bitch\"\n(Threw her in the trunk!)\n\n[Outro: Police officer]\nI think I've found the missing Mercedes here in Swope Park-uh\nIn a ditch near shelter five\nIt's kinda appears the car is still running-uhm\nMusic playing, I'm approaching the car now\nLet me turn down the music\n(God damn [?])\nI'ma go ahead pop the trunk\nThere's an African-American female [] been shot up and appears to be delirious\nIt could be the girl that's missing from last week\n(Tech Tech Nine Nine Tech Tech Nine Nine)\n(Tech Tech Nine Nine Tech Tech Nine Nine)\n(Tech Tech Nine Nine Tech Tech Nine Nine)\n\n(Threw her in the trunk)\nHeheheheh..", "image": "https://images.genius.com/de5c12836aa9b9bbb55356aafbf1fa0a.900x900x1.jpg"}], "artist": "Tech N9ne"}