{"songs": [{"title": "The Peckin’ Order", "album": "War & Peace Vol. 1 (The War Disc)", "year": "1998-11-17", "lyrics": "[Intro]\n\"In the deep and dark bowels of the underworld\nOrder must be maintained\nWithout a strict and unforgiving chain of command\nChaos is inevitable.\"\n\n[Verse 1: Ice Cube]\nWhassup youngsta?\nSince you the new booty, and don't know nothin\nI got to show you bout the peckin order\nIt's the order in how we do things and move things\nSee, somebody gon' tell you what to do\nAfter I tell that motherfucker what to do\nIt's the peckin order (*echo*)\nIt's the peckin order (*echo*)\nWe got the power to make you niggas sour\nBig fish whale like Ichikowa, steppin out the shower\nIt's the peckin order, ask ya daugther how we peck\nInspect, high class ass to projects\nPush my Lex through the California rain, gutter lane\nInfamous schemes on the brain\nFor my connect gang, put a strain on every link\nIn our chain, that's right - we all get arraigned\nTakin sworn notes to makin c-notes\nKnowin all the while that bullshit floats and niggas don't\nSo nigga don't - gangsta paradise ain't nuttin nice\nYeah we livin so trife we need Je-sus in our life\n\n[Chorus: Ice Cube & Mack 10]\nIt's the peckin order\nIt's the order how we do things\nAnd move things, only fuck with the true things\n\n[Verse 2: Ice Cube]\nHavin heavy intercourse with the world of depression\nMessin with the wrong bitches never learn our lesson\nStressin, no guessin, never question\nEven when we playin, we testin, confession\nDo you still wanna meet where the killers eat?\nHeld accountable for anythang you repeat\nIt's the peckin order, ask your daughter how we peck\nWhen we smoke you, it's your best friend you suspect\n\n[Chorus: Ice Cube & Mack 10]\nIt's the peckin order\nIt's the order how we do things\nAnd move things, only fuck with the true things\n\n[Verse 3: Mack 10]\nNow c'mon, come on potnah, c'mon (it's the peckin order)\nFuck that, I don't wanna hear none of that shit man\nAll that cryin and beggin and shit\nTo be honest wit you that shit really don't even\nAffect me in no kind of way potnah\nYou wastin your muthafuckin time (it's the peckin order)\nLet's get this shit goin, let's get it over with\nC'mon back here, back here\nI can't make no motherfuckin mess right here\nCheck this out homie, make it easy on yourself\nI know you want a motherfuckin open casket\nWhere your peoples can see you and kiss on you\nBut you done piss me off\nAnd I'mma blow noodles out your motherfuckin head\nAnd ain't none of that happenin after that\nSo, c'mon back here, c'mon, right - c'mon, ay\nBut you know, one more thing before I do this {*BLAM!!*}\n\n[Outro: Ice Cube]\nIt's the peckin order (*echo*)\nIt's the peckin order (*echo*)\nIt's the peckin order (*echo*)", "image": "https://images.genius.com/9a92bffe36c691d91a9dd7116941cd17.1000x1000x1.jpg"}], "artist": "Ice Cube"}