{"songs": [{"title": "West Coast Fire", "album": "WAR VOL. 1: Exclusives, Unreleased & New Jointz", "year": null, "lyrics": "[Intro]\nYeah\nLos Angeles, California\n(Fuck y'all niggas)\nYou now rockin' with the West\nStacey Adams, ha ha\nKurupt Young Gotti, Eastwood\nDeath Row, through it all, nigga\nSmashin' on you bustas, for the 'double 0-4\nYeah, I see you, what up homie?\nYou know what time it is - let me do it to 'em\n\n[Stacey Adams]\nNiggas hate me, fuck 'em though, I'm hot like a sauna\nNiggas talkin' shit, get prepared for the - karma\nThirty shot clip, hollow tip's, and a - warmer\n'61 Chevy, chrome D's bend a - corner\nWatch your back when you come to Cali-fornia\nThis the first and the last time I'm gon' - warn ya\nI see you niggas gettin' scared, my gun go 'pop'\nMotherfuckers know I'm aimin' for the head - yeah\nYou motherfuckers actin' like - us\nStacey got the whole spot packed full of - Bloods\nGrowin' purple with the yak in they - cups\nStacey and Kurupt 'bout to go platinum - plus\nYou don't wanna get your boy smacked - up\nBlue and red rags in the club, that's - us\nI'm from the Eastside Pacoma, run up on you\nMotherfucker put your hands up, turn yo' ass around\nI'm in the lab with the big homie - Keeter\nSmash out, beat 12's like - 'see ya'\nTwenty G's when I swipe the platinum - Visa\nBlack Angels cap, all black - Fila's\nSpittin' hot like the boy got the - fever\nI got the shank, Eastwood got the - heater\nI got a pocket full of big faced - bills\nTwenty G's with your bitch ass - skill\n\n[Eastwood]\nI'll step in the party, I got my own dank\nOwn drank, own bank, Bentley Phantom, full tank\nMy persona is top rank - when my heart feel shank\nSo I keep a automatic weapon, goin' hard in the paint\nYou niggas ain't right\nGo soft on a bitch, I'll make some tricks\nSo break bread or fake dead, we the gang bitch, uh\nLet's get it crackin' homie, show me your game face\nI'll put a nigga in his place, see what the game rate\nSixteen balls of fire, it's hot lava\nWith thirty-two balls of heat, I'm on fire\nI like them bad hoes in the wife - beaters\nI only roll with the O.G. - Keeter\nWe in the black Lambourgini, two - seater\nStrapped up with two cannons, some know 'em as heaters\nOriginal gustapo, Death Row's the label\nSo catch a fare when I get jumped like cables\n\n[Kurupt]\nElastic, little plastic imitations\nAnd drastic tactics for blastin', clappin', snappin' nigga\nI like a bitch in a bomb wife - beater\nI'll roll the streets with my O.G. - Keeter\nStraight Crippin' in a blue two - seater\nIf you gotta be the bitch, you don't - need her\nAll hood nigga, neighborhood - Rollin'\nSee faulty and the homies start - foldin'\nEverything in the vicinity from - Rollin'\nI've been runnin' shit since the '9 - fever\nKeeter gunnin' shit with the 'fo - fever\nI humped up the shit quick with the - nina\nLisa Left Eye changed her name to - N.I.N.A\nOne hit record, I'mma fuck - Trina\nStacey Adams in a all red Phantom\nClassic interaction from the nickel's and mack's\nElastic, little plastic imitations\nAnd drastic tactics from blastin' and clappin', snappin'\nSeattle Mariners hat to the left, not the back\nI'mma curse, with a paltered verse of words\nSeperate the whole formula first\nSecond, I'll leave niggas in a coma\nI'm Gotti Adolf Hitler, nigga - boa\nYou ain't gon' show the bitch, let me - show her\n\n[Hook: Keith Roc]\nWe some riders, up in here\nThis straight West Coast, we spit fire\nWe some riders, up in here\nThis straight West Coast, we spit fire\nWe some riders, up in here\nThis straight West Coast, we spit fire\nWe some riders, up in here\nThis straight West Coast, we spit fire", "image": "https://images.genius.com/8d43afcbe036c9cb953800372c505747.355x353x1.jpg"}], "artist": "Kurupt"}