{"songs": [{"title": "He’s a Mental Giant", "album": "All 6's and 7's", "year": "2011-05-31", "lyrics": "[Intro]\nThey said I was a narcissist\nWell narcissist this!\nTrick! Yeah! Strange Music baby!\n\n[Hook]\n(He's a mental giant)\nThat's what they say\n(He's a mental giant)\nTo those who nay-say\nHey, hey\n\n[Verse 1]\nHey! I'm lookin' down on you niggas\nEven though I'm 5'8″ & 195 pound on you niggas\nSo tall I can't even hear any of the sound you deliver\nMe and my partners never see any of the hateful frowning you give us\n'Cause we splat little bitty braggin' wack rappers\nYou happen to be the bastard that got mashed up\nBut down to the simple fact here's a strap past ya, blast at ya\nThat's after the yappin' I put the cash in my last chapter, that's laughter\nHalf path over vast money brag, imagine a black Dracula\nSmashin' 'em with the gats, upper class stature\nIt went to my head as my first time\nTo be cocky I'm just a giant when I burst rhyme\nMy leg is humongous, is y'all's verse mine?\nStomping 'em out, I can't stop my leg like Robert Klein\nGiant robot make you feel very low shank\nI am so hot, in my skills there be propane\nWhy I'm gon' squash them and kill every poor thing\n'Cause I'm a huge Pillsbury dough mane\n\n[Hook]\n(He's a mental giant)\nTech N9ne\n(He's a mental giant)\nTech N9ne\nTech N9ne\n(He's a mental giant)\nThat's what they say\n(He's a mental giant)\nTo those who nay-say\nHey, hey\n\n[Verse 2]\nNarcissistic, hard to grip it\nDark and wicked, arts prolific\nMars with the stars, this is far lifted\nLyrics: quit the Bawitibaw; scriptures are terrific\nGet a spitter with a bit of bitter marketed with\nScrilla then a fifth of Henny liquor, start to twist it\nCritters sit and shiver in the slit of zillas\nPit of killers, gritters hit a clique of silly niggas are fictitious\nOn top of the game, I'm dropping the rain, Godly gifted\nHop in ya lane and stopping yo fame, bark is vicious\nYou got bars to witness, ya submissive\nWhen I get ya brain ya thoughts is shifted\nI'm incredible, highly technical, meant for triumph,  raw intricate\nI need medical then more science, scars and stitches\nAlphabetical gems blow by him, pause a tidbit\nTech N9ne a mental giant!\n\n[Hook]\n(He's a mental giant)\nTech N9ne\n(He's a mental giant)\nTech N9ne\nYeah!\nTech N9ne\n(He's a mental giant)\nThat's what they say\n(He's a mental giant)\nTo those who nay-say\nHey, hey\n\n[Verse 3]\nMentally I'm like Shaq on stilts\nStrange Music Inc. is white and black owned built\nFor keeping rap on tilt\nLike drinking Patrón and Jack prone then yack on silk quilts\nGot a fat dome that'll last long if that's where I'm skilled\nGiant, huge, humongous, gigantic, expanded\nBeen floating for years and I ain't landed\nHaters can't stand it the way that my noggin is big as Kansas\nBut the women that listen wanna know if I'm talking 'bout my damn dick\n\n[Hook]\n(He's a mental giant)\nTech N9ne\n(He's a mental giant)\nTech N9ne\nHahaha!\nTech N9ne\n(He's a mental giant)\nThat's what they say\n(He's a mental giant)\nTo those who nay-say\nHey, hey\n\n[Outro]\nYadda, they think my head big... Ask her if my head big\nHaha, yadda! Yeah, Tech N9ne!", "image": "https://images.genius.com/7d4c4dfa3d56e3cd0f59836ef122ff24.1000x1000x1.jpg"}], "artist": "Tech N9ne"}