{"songs": [{"title": "Looking at My Dog", "album": "Independent’s Day", "year": "2005-06-28", "lyrics": "[Hook]\nWhy you lookin' like that?\nStop lookin' like that\nStop lookin' at my dog, lookin' at my dog\nThat'll get you fucked up\nWhy you lookin' like that?\nThat'll get you fucked up, stop lookin' at my dog\nWhy you lookin' like that?\nStop lookin' like that\nStop lookin' at my dog, lookin' at my dog\nThat'll get yo ass shot\nWhy you lookin like that?\nThat'll get yo ass shot, stop lookin' at my dog\n\n[Yo Gotti]\nYeah! This ya boy Yo Gotti!\nWhy you lookin' at me? Hear a nigga\nI ain't ya bitch\nYou don't want a street nigga that have to get wit this shit\nCuz I ain't gon' quit\nTil 'em choppa bullet flippin\nThey spleens, layin' all lower then yo chest or ya chin\nMan I'm in it to win\nI give a fuck bout a friend\nI care more bout the dough, and even more bout the Benz\nNiggas look at my chain, then they clutchin' they burners\nThey think they got us, we ??? finna get ugly this summer\nYeah I roll with a stunna, I got a lot on the line\nBut still its kill or be killed before a nigga take mine\nI give a pass to niggas, when they look at my bitch\nJust they admire her walk, or just impress that she thick\nI'm reppin' Southside North Memphis nigga, nigga Yo Gotti!\nBricks in the dashboard Benz big body\nRoyce 5'9\" and them hustles out of Detroit\nGet it how we get it cuz they importin' Ex boy\n\n[Hook]\n\n[Royce Da 5'9\"]\nWhy you so hard nigga? Pause\nI done tried so many times\nTo get my violent temper to comply with my mature side\nBut the other side is where the 45 is, hidin'\nAnd I'm fa' sho childish, hi, I'm countin'\n1, 2, seeking you niggas with the peace, with the peek-a-boo trigger\nWhen I come, through, with the honorable spirit\nEyes lighting up with shine like the \"Chronicles of Riddick\"\nNigga forget it\nNine times outta ten, times' on my side\nIf your nines in the car, cuz mines on my side\nWhy you lookin' like dat?\nNigga ain't no hoes here\nI'm about to ask the waitress what she put in yo' beer\nWe can get it on, we can do whatever boy (whatever boy)\nDon't you ever push your pedal, pump your brake\nBetter untwist your face\nSpoken word, mixed with school, mixed with crunk\nThis should hit you, get you pump, if it get you drunk\nIt can get you jump!\n\n[Hook]\n\n[Royce Da 5'9\"]\nBitches trip, niggas quick\nTo pull out they chains on sight\nNiggas flip, soon as they announce my name on the mic\nSo I, gotta kinda watch them niggas\nYou know them niggas roll up beside you\nYou don't know if they like your car, they don't like you\nBy the way they lookin', you can't tell if they grimmin' you or admiring you\nWhether envy you when they see your tires spinnin'\nSo you greet 'em as polite-\nLy as possible, that nine sit on yo lap, be disrespectful then you leave 'em at the light\nHit that window and squeeze that toaster\nPull off fast and I promise\nThat I just put his Regal in 3-wheel motion without havin' hydraulics\nI call it like I see it\nWalk it like I did it\nNigga coughin' up yo kidney\nCough, talkin' bout the kid\nMy people, I came expectin' the same kinda respect that you want\nSome of you steppin' in something by coming and testing it once\nThey won't let you do nothin' unless you cutting a check\nLet me ask you a couple a questions, nigga\n\n[Hook] - 2X", "image": "https://images.genius.com/5296587baa4eefd1b2b1ef7daff66f78.1000x1000x1.jpg"}], "artist": "Royce da 5'9'’"}