{"songs": [{"title": "What We Do", "album": "West Coast Ridah", "year": null, "lyrics": "[Verse 1: Snoop Dogg]\nWhat is a gangsta if he ain't strapped?\nAnd what is a gangsta if he can't scrap?\nAnd what is a gangsta if he can't mack?\nWell I can do it all baby, just like that\nThe grass is greener on the side I live on\nDoggy Dogg went soft, motherfucker you did wrong\nBut why he on peace, If he was a beast he would've took off on the south Midwest and the east?\nChill, y'all niggas don't get it, and you'll probably never will\nIt's hard to be real\nBut it's easy to kill, that's probably why I keep my game on the top of the hill\nThey keep my name on the top of the bill while y'all lost out there, poppin' them pills\nYou could've been with Snoop Dogg, rockin' the bill, hop in the veele\nFor real, I'm out clockin' the meal\n\n[Hook: Snoop Dogg]\nI'm a east side nigga on these west side streets\nIn my G boy stance with my hands on my dick\nWe the best thing goin', got the champagne pourin'\nAnd we put it down, come and do the damn thing goin'\nI'm a self-made millionaire, the boss Big Snoop\nEverything I touch I turn to big loot\nThis the ZU gang and we ride with Snoop\nAll I know is that I make that shit do what it do\n\n[Verse 2]\nIt's the early Berg, it's the grandest anthem\nGood day LA, it's time to get back at 'em\nYea, the west coast renaissance\nYou could smell it in the air, feel the ambiance\nAnd on the road to riches and fancy things\nTo get a little recognition, be the major bling\nGet the ole 6 range, house on the hill, 40 acres in the dollar dollar bill\nBig heads in my pocket, hoes in the VI\nMad dough I stack, get scratched like a feline\nSip on the bottle mack, lick on the matua\nBreak it down, twist 'em up like Chicago rock\nTo the club, hop off, new Jays\nFitted to the back like 7 and 5-8's\nI'm all fly with a fly date\nI'm here to boogie, don't make me add to the crime rate\n\n[Hook: Snoop Dogg]\nI'm a east side nigga on these west side streets\nIn my G boy stance with my hands on my dick\nWe the best thing goin', got the champagne pourin'\nAnd we put it down, come and do the damn thing goin'\nI'm a self-made millionaire, the boss Big Snoop\nEverything I touch I turn to big loot\nThis the ZU gang and we ride with Snoop\nAll I know is that I make that shit do what it do\n\n[Verse 3]\nHoes on my nuts like screws and bolts\nFuck bein' a playa, I'm tryin' to coach\nI will pick advantage if you'll let me\nHave you driblin' balls like Lisa Leslie, test me\nI'm goin' release the heat again\nYou floatin' in the ocean like Lacy Peterson\nRun, cuz you don't want confrontation\nMasturbate, you're just masturbatin' bitch\n\nEy mack we blim big\nCan't be mad at young Einstein, acceleratin' the game\n\nNigga I gotta get mine\nLee, I'mma get mine too\nSlide through with the candy paint\nLight tint\nLike ZU. You don't know the outcome\nGot the whole game locked up like Akon\n\nWe purple urkle, filet mignon\nWe're hittin' everything that we aimin' on\n\n[Hook: Snoop Dogg]\nI'm a east side nigga on these west side streets\nIn my G boy stance with my hands on my dick\nWe the best thing goin', got the champagne pourin'\nAnd we put it down, come and do the damn thing goin'\nI'm a self-made millionaire, the boss Big Snoop\nEverything I touch I turn to big loot\nThis the ZU gang and we ride with Snoop\nAll I know is that I make that shit do what it do", "image": "https://images.genius.com/4acd3e2f6ebd2aa678f989f5f5f82d9b.599x594x1.jpg"}], "artist": "Snoop Dogg"}