{"songs": [{"title": "Young Sinatra II", "album": "Young Sinatra", "year": "2011-08-15", "lyrics": "[Intro]\nYeah, yeah, yeah, yeah\n\n[Verse 1]\nVarious women I'm swimming in like a shark\nHold up, that was the first one, let me run it back and restart\nYoung Sinatra ripping the beat apart\nShining like a diamond when I be rhyming\nBut y'all in the dark\nOn point like a poisonous dart\nI can feel it now, the fame is comin' soon\nHow can sky be the limit when there's footprints on the moon?\nNow, I used to bus tables, now I bust rhymes\nSpitting lines to the illest of dimes just to pass the time\nLiving like a Don, mafietic mind state\nHip-hop heads never die, we multiply then dominate\nNow I been flowin' since a adolescent up until the present\nRehearsin' flows for various shows\nYeah, that's how I roll\nGettin' respected, never neglected\nAs I infect it, they detect it, when I disect it\nRip it and wreck it, now that's on the record\nAs the vinyl spin so slowly\nBringing verses like a Holy\nBible, my flow is tribal\nMeet me in the street homie I'm liable\nTo get it right then and there\nMotherfuckers like, \"Where?\"\nHe come from?\nGot music for days and then some\nThey were stepping confident until I made 'em run\nYou know it's Logic\nIn your vicinity murder evil entities better known as your enemies\nYou feel it now\nSpark the L and you be coolin'\nChillin' relaxin' to this audio satisfaction\nI leave emcees missin' in action, leave you gashin\nFrom a thousand lashes\nWhile I'm laughing with a passion\nStand over you smiling 'til I hear sirens and now I'm dashing\n\n[Hook: AZ & Nas]\nLife's a bitch and then you die\nThat buck that bought the bottle\nCoulda struck the lotto\nLife's a bitch and then you die\nGot rhymes 365 days annual plus some\n\n[Verse 2: Logic]\nThis second verse is dedicated to rappers that never made it\n'Cause they gave up on their dream\nIn other words they hesitated to take it\nBut I swear I'ma make it better than ever before\n'Cause half of y'all don't even know\nSee I be rolling through the streets\nIn a beamer bomber like Hiroshima\nHit you like Katrina 'til they like, \"Damn Gina!\" (Damn!)\nI eat MCs like fast food, hella rude\nI'm the reason that your favorite rapper's in a bad mood\nMy name is Logic, I was born in 1990\nAin't no need to remind me\nThat when you listen you wanna rewind me\nAll the labels wanna sign me for the right reasons\nWe aim to please\nHuntin' dollars and it's buck season\n'Cause\n\n[Outro: AZ & Nas]\nLife's a bitch and then you die\nThat's why we get high\n'Cause you never know when you're gonna go\nLife's a bitch and then you die\nThat's why we puff lye\n'Cause you never know when you're gonna go\nLife's a bitch and then you die\nThat's why we get high\n'Cause you never know when you're gonna go\nLife's a bitch and then you die\nAyo, put the Grants over there in the safe, you know what I'm sayin'? (Yeah, yeah)\n‘Cause we spendin' these Jacksons. The Washingtons go to wifey, you know how that go\nI'm sayin' this is what it's all about, right? Clothes, bankrolls and hoes, you know what I'm sayin'? (Sinatra)\nYou know, then what, man? What- what?\n(Logic)", "image": "https://images.genius.com/6118bfdbbde22320e3c6bc130e1772d3.1000x1000x1.jpg"}], "artist": "Logic"}