{"songs": [{"title": "Little Chicago Boy", "album": "Black America Again", "year": "2016-11-04", "lyrics": "[Verse]\nHow should I begin?\nThis is the story of a boy named Lonnie Lynn\nAs I say it, the spirits enwhip me\nHe was raised in the belly of the city\nChicago, discovered by du Sable\nA Black Frenchman that I had to mention\nExtensions of a young man livin' on a low end\n47th and Michigan, lackin' a little discipline\nKnow Grandma Mable did the best she could\nYou know how young niggas want a testy hood\nThere he stood, taller than most black boys\nOne of the best ballers out of Illinois\nCollege in Ohio, this is like his bio\nTalks that we had, man, they was never idle\nHe talked about readin' the Quran and the Bible\nHe talked how he smoked dope and sold it for survival\nHe talked about the ancestors, in our lives; they're vital\nHe said y'all niggas love the bang 'cause you tribal\nSpiral of life, Chicago to Denver\nAnywhere he went, of attention, he's the center\n6'9\", big heart, big mind\nHe he spent a lifetime tryin' to be big time\nHe did in a way, he made to the ABA\nAnd the things he say on my record\nWhen I was a shawty, he bought me \"The Message\"\nIt was his messages in the life I would step with\nDidn't see him much, spirits are connected\nThe Father creates it, the son can reflect it\nHis perspective: sometimes seemed crazy\nHis perspective: sometimes seemed brilliant\nHis perspective: somehow it shaped me\nHis perspective: undoubted I feel it\nHe'd walk around in them Air Jordans I gave him\nI said, \"Pops, them from Mike, man, you better save 'em\"\nThe fight that he had with cancer was a brave one\nTook Dr. Sebi's herbs instead of medication\nBreathing heavy, he talked reparations\nHe said, \"Son, we live through our generations\"\nOffspring, coughing, Gene Ammons playing\nIn the background, he was talking, I was praying\nOur Father, take care of my father\nAs far as he went, may I go farther\nMay our dreams and legacies live through our children\nThough I can't touch him, I can still feel him\n\n[Pops talking]\nYou know the other day I got a phone call. I got a message says pops you been gon from home too long. So I set my bags down and headed to 87th street. I was just back in the neighborhood ya know cruising the same street that I used to cruise in my long black Fleetwood. Listening to the Minister and Dr. King and my beloved brother Malcolm. First thing is see I'm boundless with spiritual energy. I wanna talk about the moral necessities of human justice. The power and the action of God-given dignity. One can not enter the gate if you hate. You gotta take the lead for the rest of the world, 87th is the street of knowledge. The streets of knowledge are all over the world. We got a possibility again of leading the world. Chi my Chi we gon ask you for safe passage for the kids to walk to school. Alright, my young homies, we got a mission to finish. We got the unborn that we got to provide the truth for\n\n[Tasha Cobbs]\nI gotta be honest it's so much different without you here\nBut I have no fear\nI'll see you when I get there\nTo that city bright and fair\nYou were all I needed you to be\nAnd now I thank you for all you gave for me\nSo Father, I stretch my hands to Thee\nNo other help I know\nIf you withdraw yourself from me\nSomebody tell me where, oh where shall I go?\n\nFather, I stretch my hands to Thee\nNo other help I know\nIf you withdraw yourself from me\nTell me where, oh where shall I go?", "image": "https://images.genius.com/565646b92582d86f0446dc67906334c7.1000x1000x1.jpg"}], "artist": "Common"}