{"songs": [{"title": "Ronald Reagan Era (His Evils)", "album": "Section.80", "year": "2011-06-17", "lyrics": "[Intro: Ash Riser]\nWe're far from good, not good from far\n90 miles per hour down Compton Boulevard\nWith the top down, screaming \"We don't give a fuck!\"\nDrink my 40 ounce of freedom while I roll my blunt\nCause the kids just ain't alright\n\n[Interlude: Ab-Soul]\nOh, shit nigga, somethin' 'bout to happen, nigga, this shit..\nNigga this sound like 30 ki's under the Compton court building\nHope the dogs don't smell it\n\n[Verse 1: Kendrick Lamar]\nWelcome to vigilante, 80's so don't you ask me\nI'm hungry, my body's antsy, I rip through your fuckin' pantry\nPeelin' off like a Xanny, examine my orchestra\nGranny said when I'm old enough, I'll be sure to be all I can be\nYou niggas Marcus Camby, washed up\nPussy, fix your panties, I'm Mr. Marcus, you getting fucked, uh\nYou ain't heard nothin' harder since Daddy Kane\nTake it in vain, Vicodins couldn't ease the pain\nLightnin' bolts hit your body, you thought it rained\nNot a cloud in sight, just the shit that I write\nStrong enough to stand in front of a travellin' freight train, are you trained?\nTo go against Dracula draggin' the record industry by my fangs\nAK clips, money clips and gold chains\nYou walk around with a P90 like it's the 90's\nBullet to your temple, your homicide'll remind me that\n\n[Hook: Kendrick Lamar & RZA]\nCompton Crip niggas ain't nothin' to fuck with\nBompton Pirus ain't nothin' to fuck with\nCompton éses ain't nothin' to fuck with\nBut they fuck with me, and bitch I love it\nWoop de woop, woop de woop-woop, woop de woop\nWoop de woop, woop de woop-woop (California Dungeons)\nWoop de woop, woop de woop-woop, woop de woop\nWoop de woop, woop de woop-woop (California Dungeons)\n\n[Verse 2: Kendrick Lamar]\nLet's hit the county buildin', gotta cash my check\nSpend it all on a 40-ounce to the neck and\nIn retrospect I remember December being the hottest\nSquad cars, neighborhood wars and stolen Mazdas\nI tell you mothafuckas that life is full of hydraulics\nUp and down, get a 64, better know how to drive it\nI'm drivin' on E with no license or registration\nHeart racin', racin' past Johnny because he's racist\n1987, the children of Ronald Reagan, rake the leaves off\nYour front porch with a machine blowtorch (I'm really out here, my nigga)\nHe blowin' on stress, hopin' to ease the stress (Like, really out here)\nHe copping some blow, hopin' that it can stretch\nNewborn massacre, hopping out the passenger\nWith calendars, cause your date's comin'\nRun him down and then he gun him down, I'm hopin' that you fast enough\nEven the legs of Michael Johnson don't mean nothin', because\n\n[Hook: Kendrick Lamar & RZA]\nCompton Crip niggas ain't nothin' to fuck with\nBompton Pirus ain't nothin' to fuck with\nCompton éses ain't nothin' to fuck with\nBut they fuck with me, and bitch I love it\nWoop de woop, woop de woop-woop, woop de woop\nWoop de woop, woop de woop-woop (California Dungeons)\nWoop de woop, woop de woop-woop, woop de woop\nWoop de woop, woop de woop-woop (California Dungeons)\n\n[Refrain: Kendrick Lamar]\nCan't detour when you're at war with your city, why run for?\nJust ride with me, just die with me, that gun store, right there\nWhen you fight, don't fight fair cause you'll never win\n\n[Break: Ab-Soul]\nRight, I had the yapper, and I tore they ass up\n\n[Refrain: Kendrick Lamar]\nCan't detour when you're at war with your city, why run for?\nJust ride with me, just die with me, that gun store, right there\nWhen you fight, don't fight fair cause you'll never win (Yeah, yeah, yeah)\n\n[Bridge: Kendrick Lamar]\nWhoah, whoah, whoah, whoah, whoah\nWhoah, whoah, whoah, whoah, whoah\nWhoah, whoah, whoah, whoah, whoah\nWhoah, whoah, whoah, whoah, whoah\n\n[Outro: Ab-Soul]\nWe really out here, my nigga, you niggas don't understand, my nigga\nI'm off of pill and Remy Red, my nigga, trippin', my nigga", "image": "https://images.genius.com/2fe1806c5f9fa10958d9fb2fc87c874e.500x500x1.jpg"}], "artist": "Kendrick Lamar"}