{"songs": [{"title": "Odd Toddlers", "album": "Bastard", "year": "2008-11-15", "lyrics": "[Intro: Tyler, the Creator]\nUh, yeah, how you doin' today?\nUh, yeah, uh-huh, yeah\nAce the Creator, man, look\nCasey Veggies, uh-huh, Odd Future, look\n\n[Verse 1: Tyler, The Creator]\nHello, the hype is so mellow\nBitch I'm dope but my pipe is so yellow\nThe blue polka dots, pink stripes and it's pink on the title\nNigga, fuck your role model, bitch, I'm my own idol and\nIf you can't face it, my nigga, you can ass it\nMy accessorized accessories bring out my assets\nNigga they sound on acid, tablets\nStussy’s G-Shock with my custom pair of 3D glasses\nI suffer from ADHD\nI should win a fucking award for being me\nBeat banging the tom-toms\nMy producer selection is fresh nigga, fuck Vons\nAce the underdog, thrown them on the back bender\nCause I change my outfit more than transsexuals change gender\nEating Belgian waffles with Italian biscotts\nI sold my soul to the devil for thirty percent off\nAnd to you emo kids who walk around pissed off\nStep one: pull your panties down and start to piss off\nStep two: run to your radio, turn this shit off\nNigga didn't bother, so my father didn't help\nSo when my mom would beat my ass, she would always hit me\nWith Gucci belts, Gucci imprint from leather welts\n\nUh-huh, yea, Ace the Creator, man\nUh, Casey Veggies, yo\nUh-huh, Odd Future, nigga\nGet used to, uh, let me-\nAy, I'mma slow it down, right quick for you\n\n[Verse 2: Tyler, The Creator]\nI'm so dapper man, funky fresh Dapper Dan\nI'm your favorite rapper, fan, it's an honor to shake my hand\nOn award tour, on excursions, I'm a virgin of swap meets\nI'm so pure, so sick it's no cure\nI'm dope, where the fiends at? Aight, where the jeans at?\nThe hat, the crew, the t-shirt is Supreme\n\n[Verse 3: Casey Veggies]\nAnd they see me they play Pictionary\nI got a good way with words like a dictionary\nAnd in that dictionary my name is by \"Fresh\"\nThey at the same spot they making no progress\nBecoming a good rapper ain't that easy of a process\nEargasms they have them\nThe hotels we staying in twelve star\nTyler said, \"yo Casey, just write a twelve bar\"\nIf I'm with twelve people, I'm with twelve stars\nYou haters put up your guards\nThey against us? Oh no\nRed and white diamonds, Supreme box logo", "image": "https://images.genius.com/cb0b25f99dd81109efa8db270a933a38.500x500x1.jpg"}], "artist": "Tyler, The Creator"}