{"songs": [{"title": "Black Man In America", "album": null, "year": "2019-09-13", "lyrics": "[Intro]\nWe will be here forever\nDo you understand?\nForever and ever\nAnd ever and ever\n\n[Verse 1]\nHey, this Black man made it in America\nBasketball and rap attract kids to get the hell out the area\nNowadays niggas kill when you get ahead of 'em\nSo I backtrack and get 'em some act right\n'Cause they confused the rap life for a trap life\nMentally I ain't wrapped tight\nYou fuck wit me the situation turn to Roy Jones' last fight\nThis Muddy music\nThat mean you get offended\nThese words like liquor when I'm bartendin' (Let's go nigga)\nMama taught me well, she hold a hammer for me\nShe pray for me when I get it, it's mandatory (Mandatory)\nCall me Big Unc and I cosign ya\nBankrolls, rollin' blunts I'll be ya role model\nDrug addicts go cold chicken\nThey veins pop out, They say, \"Red, feed me what I ain't gettin'\" (Heeeey!)\nI can get in my car and get out and the same song is on when I get back in and get out (Uh ohhhh)\nCheck my archive\nMy stage show is like a bar fight\nYou want it? Have the right Sean Price (Heeeey!)\nI'm a legend, don't call me old school\nI'll move niggas like they buildin' in a Whole Foods (Yes sir)\nAnd you gotta be ready for drama\nEspecially when Bloods and Crips is livin' by ya mama\nI'm breathless\n\n[Chorus: Pressure]\nReality speaking, dem all baby\nLegendary, man ah bust it from the 80s\nDem fi know me head sicker than rabies\nBlack in America, yeah, don't play me (Heeeey!)\nWhen we ah step, dem swear see ah di navy (True)\nRevolution kick off like inna '80 (Uh ohhhh)\nDem fi know me head sicker than rabies\nBlack in America, yeah, just pay me\n\n[Verse 2]\nHey, this Black man made it in America\nFacts, my blood killed lab rats\nI'm one like a snowflake, abstract\nThat's why I take it to that Mad Max (Heeeey!)\nAnd I grew up across from a cemetery\nThat's why my commentary sound like yo obituary\nGrown man talk\nWe got our Denzel on, I told LL I'm just gettin' warm nigga (Heeeey!)\nThe Tri State where niggas dyin' over bullets in they prostate\nAnd cops against Blacks never gon' migrate\nI ain't gettin' shot, they try to pull me over, I turn it to a car chase (Heeeey!)\nThese little kids into gang violence\nArtists gettin' called hip hop but they ain't rhymin'\nY'all voted for 'em, now they a rockstar\nI feel like a Black film tryna get a Oscar (Heeeey!)\nGod forgive me for my sins\nYou dealt me these cards so I'm gon' play it to win\nAnd I'm tryna get 40 more haters\nSo I can sign 'em on to the Reggie I hate 'em but glad he made it\nI'm breathless\n\n[Chorus: Pressure]\nReality speaking, dem all baby\nLegendary, man ah bust it from the 80s\nDem fi know me head sicker than rabies\nBlack in America, yeah, don't play me (Heeeey!)\nWhen we ah step, dem swear see ah di navy (True)\nRevolution kick off like inna '80\nDem fi know me head sicker than rabies\nBlack in America, yeah, just pay me\n\n[Verse 3]\nHey, this Black man made it in America\nCan you believe how I did it?\nI had faith and had God as my witness\nI couldn't just be a artist, I had to learn the business\nAnd haters on the side, they tried to sell me wolf tickets\nBut I'm still relevant, me and rap we got a life sentence\nSuccess is like a bank loan, it's hard to get\nI worked hard for errything, I wasn't offered it\nAnd it's up to me to show my babies how to be a boss\nI teach 'em how to win but also how to take a loss\nAnd education is key\nBut nowadays I advise you to learn a trade\nAnd not depend on a college degree (Heeeey!)\nI sold drugs but I don't have no story to tell\n'Cause music always was my life, Patti Labelle\nAs long as I live, you'll get honor and dedication\nAnd fuck the media interrogatin'\nI'm breathless\n\n[Outro]\nYou see it on the news\nYou see it on social media\nBut when you a Black man in America, it's very scary and terrifying\nBelieve me!\nSometimes I wonder, \"will there ever be equality for a Black man in America?\"\nI doubt it!", "image": "https://images.genius.com/e9fb3574918f59a2ca4b7283d7aacfc4.1000x1000x1.jpg"}], "artist": "Redman"}