{"songs": [{"title": "Still A G Thang", "album": "Da Game is to be Sold, Not to be Told", "year": "1998-07-03", "lyrics": "[Intro]\nYeah, yeah, yeah, I'm finna up in the corner in my lowrider, dogg. Ya heard me?\nTop dollar with the gold flea collar\nYeah, it's still a G thang\nTop dollar with the gold flea collar\nIt's time for all the lowriders out there\nTop dollar with the gold flea collar\nYeah, all the dippers you like to get ya dip on\nHit a switch or two, bang a corna' sittin' on threes\nTop dollar with the gold flea collar\nYeah, right trip\n\n[Verse 1]\nIt's like 4 & to the 5 & to the 6 & to the 7\nI once was told that all doggs go to Heaven\nWell how ya been where ya been & what it look like?\nMy game trump tight especially when it bump like\nFour DPG's gettin' crazy\nAnd No Limit is the label that pays me!\nRidin' 'round town layin' game down like Goldie\nAnd I remember what my momma showed me\nTold me game recognize game\n& stay true to what ya do & don't be ashamed\nI got all my game from her sometimes I have to wonder\nHow I keep from goin' under I'm a bad muthafucka\nI fall to my knees & thank God before I do my thang\nI don't know why, I love to gangbang\nSee life ain't nuthin' but a twist anyway bitch anyway\nYou can say what you wanna say\nJust don't get in my way cause I'm a mean old\nFiend know C know & P know see loc\nWe make music for the thugs and the bangers\nAnd the bitches. Fuck you R&B singers\nShe want a nigga with his khakis hangin' real low\nIn a black rag Sixty-four hmm\nRollin' down the street lookin' way clean\nBangin' that real shit nigga like Al Green\nI'm headed straight to the LB\nForget it that's what they tell me\nSell me everythang except some bullshit\nAnd when it's time for the gunfight nigga pull quick\nCause ain't nothin' butter but us\nAnd nigga you'll get wet up for fuckin' with my cheddar\nIt's cold outside nigga grab ya sweater\nAnd that bad bitch you fuckin' with\nNigga she get ya set up\nBoy you done put all ya trust in that ho\nDidn't ya see what happened to the President niggaro\nLivin' in a tight house big as the White House\nYou fucked around & stuck ya dick\nIn that white bitch mouth\nWhat you talkin' 'bout? Fool I'm dirty like the South\nAnd to be real I feel that's how I'm comin' out\nBack on the ho stroll highway pimp patrol\nPut ya cuffs on ya girl nigga let her off parole\nMan nigga way cold with his game\nWhat's his muthafuckin' name? Who me?\nI'm the capital S I don't fuck with stress\nN double O-P D-O muthafuckin double G\nColdest entertainer gangbanger since Alphonse Capone\nCount money like Basie police try to chase me\nNiggas try to replace me but you can't\nI'm ridin' in a tank I'm blowin' hella dank\nSo whether ridin' in ya lo-lo or smokin' on some doe doe\nSpread the word and take the fo' door\nThe Last Don done hooked up with the muthafuckin'\nKing of the coast with the most here's a toast\nAnd Snoop Dogg is the representer\nThrough the niggas & G's through the LBC's\nAnd the Calio projects Brooklyn to Queens\nChi-town woe now the Dogg Pound in the house\nEverytime we touch down right next to my hometown\nD-town [Detroit] Eastside St. Louie [St Louie]\nSpokane get ya money man tic-tock\nLittle Rock right next to Houston, Texas\nHome of Rap-A-Lot we like to jack a lot\nGimme what ya got let me get that up out ya nigga\nI got ya somethin' for the summertime while it's hot\nAnd got the bitches posted up in the parkin' lot\nAnd guess what she want the\nNigga with the biggest nuts [Who dat?]\nA nigga who don't give a fuck\nYa see niggas like me all we see is\nMoney, power moves, and a bitch a week\nAnd last but not least my nigga *D-O-C*\nMuch love from the N.O. my nigga Feel me?\nAnd my little cousin D-A-Z forever nigga\nThis DPGC and oh yeah Dr. D-R-E\nYou know where I'm at nigga holla at me\nGet at me holla at me nigga holla at a dogg that's real\nY'all niggas know what's happenin'\nIt's still a [DPG] thang\nIt's still a G thang\n\n[Outro]\nTop dollar with the gold flea collar\nDippin' in my blue Impala [DPG]\nTop dollar with the gold flea collar\nDippin' in my blue Impala [DPG]\nTop dollar with the gold flea collar\nDippin' in my blue Impala [DPG]\nTop dollar with the gold flea collar\nDippin' in my blue Impala [DPG]\nTop dollar with the gold flea collar\nDippin' in my blue Impala [DPG]\nTop dollar with the gold flea collar\nDippin' in my blue Impala [DPG]\nTop dollar with the gold flea collar\nDippin' in my blue Impala [DPG]\nTop dollar with the gold flea collar\nDippin' in my blue Impala [DPG]", "image": "https://images.genius.com/08635ee9967b5452f3ef439ee210c230.600x597x1.jpg"}], "artist": "Snoop Dogg"}