{"songs": [{"title": "Biboa’s Theme", "album": "Searching for Jerry Garcia", "year": "2005-08-09", "lyrics": "[Intro]\nLa-la la-la la-la la-la\nProtect yourself\nDa-da-da\nGoodbye, D12\n\n[Verse 1]\nWeed, no seeds, last year Cannabis Cup\nA druggie that mind hasn't been damaged enough\nWith danglin' nuts, I lust for angels to fuck\nMy cannon is tucked, move fast, I panic and bust\nBrain burnt out like a mechanical clutch\nI'm too schizophrenic to touch\nA scandalous bunch don't gamble with trust\nScammin' for bucks, pink candy deluxe out mishandlin' sluts\nAfter a show bring all my fans on the bus\nNext city, leave 'em dizzy, stranded and stuck\nHangin' in clubs like blacks in slavery\nGats we aim and squeeze at acts of bravery\nMaybe Big is bouncin' off what Shady lead [?]\nCan barely add, but still got A.D.D. (What I say?)\nWork the door, make 'em play for keeps\nI ain't gotta say shit 'til the AK shall speak\n\n[Chorus]\nTo whom it may concern, this planet is fucked\nLife had been hard so far, I just manage to bluff\nScandal and drugs got my hands in some cuffs\nMan, it's been rough, but shit, I don't plan to give up, uhh\n\n[Verse 2]\nSpeakin' at AA meetings while intoxicated\nTrainin' a arm-less fighter to box in Vegas\nPlot with haters, they kill me on my block for later\nHavin' free phone sex with operators\nNext Grammy's, your man P is rockin' Gators\nLeavin' full with rabbit ears, I'm a pocket raider\nEvery block invaders, all cops is traitors\nAny hood thief hands get burnt like hot potatoes\nThe hardest mayor that boycott garbage sayers\nThinkin' outside the box like Harvard Squares\nWild like Ben Wallace hair\nHate the niggas that ain't spitters blow up off market favors (You!)\nSo from now on I'm startin' terror\nAyo, God, here I come, tell 2Pac to wait up\n\n[Chorus]\nTo whom it may concern, this planet is fucked\nLife had been hard so far, I just manage to bluff\nScandal and drugs got my hands in some cuffs\nMan, it's been rough, but shit, I don't plan to give up, uhh\n\n[Verse 3]\nGot young famous that handle any further glory\nFix my son a lunch for school so he'll murder for me\nReadin' Pac and Pun tags up in pergatory\nWaitin' to get in heaven or \"Grimey,\" that's word to N.O.R.E.\nAnything you heard before me\nHah, it's simple like a street life suburban story\nTurn my poor peeps into murkers for beef\nWho the fuck is Jerry? I'm searchin' for weed\nAnd why did God make all these worthless MC's?\nStill tryin' to find out for what purpose they breathe\nMy pops hit the weed and then he birthed a new breed\nI hit bad bitches raw 'cause it's worth the disease\nHate the Ku Klux Klan, they abuse curtains and sheets\nAnd I need 'em at home, but that's a personal peeve\nThe pills is still purple indeed\nAnd I'm screamin' loud as hell \"Fuck the Earth!\" when I leave\n\n[Chorus]\nTo whom it may concern, this planet is fucked\nLife had been hard so far, I just manage to bluff\nScandal and drugs got my hands in some cuffs\nMan, it's been rough, but shit, I don't plan to give up, uhh", "image": "https://images.genius.com/ab9a6517cd52ed1370641d9d44571fdd.500x500x1.jpg"}], "artist": "Proof"}