{"songs": [{"title": "Sanctified", "album": null, "year": "2014-03-03", "lyrics": "[Produced by Kanye West, DJ Mustard, and Mike Dean]\n\n[Intro: Betty Wright]\nThere's a few million angels movin' around me\nI just worship thee, for all he's done for me\nIt's a new day, I have been born again\nI've been born again, I've been born again\nIn His spirit, and His name, I'm sanctified!\nLord I testify, he's right by my side\nI believe it be His word is so clear to me\nYeah, yeah\n\n[Hook: Big Sean]\nAll I want's 100 million dollars and a bad bitch\nPlus that paper chasin', it done turn me to a savage\nGroupies in the lobby they just tryna get established\nGod, I've been guilty, fornicatin' from my status\n\n[Verse: Big Sean]\nOnly real niggas so I know that you still gon' be absent\nI feel like I'm the black Brad Pitt when I wake up to fuckin' an actress\nWe just shot a movie last night on the couch and I swear that that shit is a classic\nIf I want it, I need it, I need it, I have it, hit so much it's a habit\nI'm greedy, I'm greedy, man fuck it, I'm greedy\nHer titties so big that I nicknamed them DeeDee\nI know that the devil is callin'\nMan fuck that weak-ass nigga, let it keep ringin'\nRight now I'm connected with Jesus, on threeway with Yeezus\nWe just signed a treaty, I'm on the couch like \"Free my niggas!\"\nBut niggas cannot get a freebie\nIf I'm in the field then you know that I TD\nOvertime, all the time, man I repeat it\nI need some good pussy and Posturepedic\nStressin' so hard think my hairline receded\nI say how I say and I feel how I feel\nAnd I won't take it back, it's no need to recede it\nYou stuck on a bitch?\nWell I stuck to the script all my life, ain't no need to re-read it\nIf you got my email, you's a millionaire\nIf you got my cellphone, you's a realionare\nI ain't been home in months but bitch I'm still the mayor\nThat Detroit nigga gettin' married but I'm still a player\n\n[Bridge: Betty Wright]\nI can feel his blessings wash away my sins\nI'm sanctified and, I have been born again\nNow I proclaim, hallowed be thy name\nOhhh", "image": "https://images.genius.com/1db10915bf07ae763610bb53d1717887.1000x1000x1.jpg"}], "artist": "Big Sean"}