{"songs": [{"title": "Transformer", "album": "Future & Juice WRLD Present… WRLD ON DRUGS", "year": "2018-10-19", "lyrics": "[Intro: Nicki Minaj]\nNickiHndrxx\nRrrrrrr!\n\n[Chorus: Future]\nTransformer, I just popped a transformer\nLit the room up, all I did was hold my arm up\nWent through Barneys, I spent 20k on Amiris\nGot my weight up, now I'm talkin' back to Siri\nSmashin' foreigners, murder shit at the coroner\nJackie Joyner, racin' racks all summer\nWoke the don up, all I did was hold my arm up\nTop goin' up, it look like I lit the sun up\n\n[Verse 1: Future]\nGoin bonkers, I fuck with her, I'm her sponsor\nGo redundant, everything I do responsive\nOff the continent, everything is out the country\nNo assumption, hit on the gas, start punchin'\nPark my confidence, hit the gas, barely functionin'\nAin't no consciousness, I'm bout to spaz on this stallion\nFuck a casualty, everything we did was lavishly\nFuck a tragedy, all these sticks automatically\n\n[Chorus: Future]\nTransformer, I just popped a transformer\nLit the room up, all I did was hold my arm up\nWent through Barneys, I spent 20k on Amiris\nGot my weight up, now I'm talkin' back to Siri\nSmashin' foreigners, murder shit at the coroner\nJackie Joyner, racin' racks all summer\nWoke the don up, all I did was hold my arm up\nTop goin' up, it look like I lit the sun up\n\n[Verse 2: Nicki Minaj]\nWhat the fuck, I'ma have to pump brakes on these hoes\nReal shooters, I don't ever pump fake on these hoes\nMe—me—me and Pluto pull up in that new Ferrari drip\nAlways eatin' Japanese so I'm a need wasabi dip\nFour—four—four albums in, pull a milli' for a show\nWhile these bitches is servin' Milli Vanilli on the low\nSpent my money on some dope, where my money envelope?\nTransform it to a Billy 'cause I really am the goat (Really am the goat)\nTransformer, I just popped a transformer\nMaster bathroom, two jacuzzis and a sauna\nThey ain't warn her, now she out here facin' karma\nHad a chance, but got at me now she's a goner\nWhere my bad bitches? Fuck these niggas, give them trauma\nCoulda fixed his life but now that nigga need Iyanla\nAll his friends tryna kill it, eat it J.A. Dahmer\nNiggas snakes but, stupid, I'm the snake charmer\nThis a different tax bracket, upper echelon\nI'm still the bad guy, I am a Decepticon\nSome call me Nicki but some call me Megatron\nI'm stoppin' bags and I don't need a red octagon\n\n[Chorus: Future]\nTransformer, I just popped a transformer\nLit the room up, all I did was hold my arm up\nWent through Barneys, I spent 20k on Amiris\nGot my weight up, now I'm talkin' back to Siri\nSmashin' foreigners, murder shit at the coroner\nJackie Joyner, racin' racks all summer\nWoke the don up, all I did was hold my arm up\nTop goin' up, it look like I lit the sun up\n\n[Outro: Future]\nThousand carats, ooh, nigga, Roger Rabbit\nWhere the towel, bitch? Ooh, we just fucked a balance\nCheck my standings, ooh, I just bought a palace\nShawty baddest, ooh, and she from a pageant\nFuck a daddy, ooh, 'cause she call me \"Zaddy\"\n'Cause she call—, 'cause she call me \"Zaddy\"", "image": "https://images.genius.com/d557129806292f16f0d9e41baafb7431.1000x1000x1.jpg"}], "artist": "Future"}