{"songs": [{"title": "Military Minds", "album": "Better Dayz", "year": "2002-11-26", "lyrics": "[Produced by Darryl Harper and E.D.I. (Remix)]\n\n[Intro: 2Pac]\nStand in formation, my motherfuckin' real troopers\nLet's do it like soldiers - all and together now!\nReady? Hell yeah, y'all niggas better get ready\nNo retreat, no surrender, death before dishonor motherfucker!\nDo it to 'em, c'mon never die thuggish, uhh - YES YES YES\nSay what? (Eastside, Westside ride) Where ya at, where ya at?\nWhere my real thugs, where ya at, where ya at?\nWhere my real thugs, where ya at, where ya at?\nWhere my real thugs, where ya at?!\nHehehe, send cases to the drug dealer\nReal thugs, where ya at? You motherfuckin' home\nDo it to 'em, do it to 'em\nThey love the way we do it to 'em, we do it to 'em\n\n[Verse 1: 2Pac]\nSuppress the revolution a premeditated scheme\nIntroduce a drug called crack to us ghetto teens\nGot a law for raw niggas, now, playa what it be like?\nWhen will niggas see they got us bleedin' with three strikes?\nCan't seem to focus hopeless, with violent thoughts I wrote this\nGot these Devils petrified, hidin' from my hocus-pocus\nAnd so I learned to earn my currency and over time\nAffiliated, clearly click of military minds\nMay God forgive us though we dwell inside a paradox\nThugged out and drug dealin', from the womb to the block\nMy live mind got me survivin' five rounds (shots)\nMy forty-five got me fortified with live rounds\nWhen shit's thick we plot hits, when my Glock spits\nAll hail, out on bail, wrath of the 2Pacalypse\nForever ghetto necessary picture food stamps\nOutlaw Thug Niggas never left the Boot Camp\n\n[Verse 2: Cocoa Brovaz]\n\n[Tek]\nThey called us for assignment, one of the squad's finest\nSkills in guerilla warfare and blessed with refinement\nMy rap sheet, contains sections of bomb sessions\nSays I'm responsible for black Smif-N-Wessun\nPuttin likkle yout's in a military state of mind\nDangerous like chronic and yard when combined\nCocoa Brovaz 'pon de borderline\nTest de sound and ye dead same ti-ime\n\n[Steele]\nMan to man, I'm facin' the Devil with a plan\nJudo stance, first glance, I'm makin' my advance\nAnimal instincts, intelligence of an assassin\nMasked men, ninjas that surround me, ready to attack\nI react swiftly, what father taught me sticks with me\nNever forget the method, stick and move strictly\nShit be seemin' like it's closin' in\nWith no regrets I hold position\nCause I suppose I'm one of the chosen men\n\n[Verse 3: Buckshot]\nPicture being put in a position to move\nAnd you can't move cause your move is blocked by the knight\nAt twelve o'clock, that's when the madness begins\nSo I start to focus in, my thoughts on the war\nCause the rule is the law, and the law that we live by\nIs to stay true to self, in this case, BDI\nWhy try if ya body lie\nBy the block true soldier mentality, this is how we rock and roll\n(This is how we ride)\n\n[Boot Camp Clik]\nStick and move, time to show 'em how to make a move\nOr get moved on, let's see who strong\n\n[Verse 4: Cocoa Brovaz]\n[Tek]\nIn the gaze of the strange, where nothin stays the same\nWhere new faces come through with similar game\nNow who you thought was them, really ain't\nThey catchin' deja vu's of the game people play\nIt's a call for readjustment, fine tune yo' position\nYou slippin' and trippin' 'stead of bobbin and dippin'\nBut never let this world of stress get the best of me\nTakin' breathin' techniques, slay you with Tai-Chi\n\n[Steele]\nWhat does it take, to get a break in the world of snakes\nAnd dose who fake\nElimination I'm facin' destruction\nOutlawed, so I duck and down, fo'-fo' is bustin', no one to trust in\nRushin' to the goal line\nCatch a nigga beat him treat him like he stole mine\nNo swine I'm a soldier, soldier I control mine\nTime to, take you, back into time - follow dis here\n\n[Verse 5: Buckshot]\nOne way out, this black hole\nFor this black soul, shit is outta control\nI'm fightin' for my position to be a fetus in this world I'm enterin'\nAnd my face is sentencin' for repentance\nBefore my body was fully formed into a human\nI was already consumin' weed\nCause my moms used to smoke back in the 70's\nMaybe that's why in the 90's I drop G's when I drop degrees\nWhen I ease across the block with 'Pac\nGot all y'all niggas shocked\nYou didn't think Boot Camp Clik would link, with a Outlaw mind?\nIf you do you press rewind\nAnd you can peep guerilla tactics in every line\n\n[Outro: 2Pac]\nYeah, and this is how we do it!\nWhere my real thugs, where they at?\nLet me, see my real thugs, now where ya at?\nWon'tcha, see my real thugs, where ya at?\nLet me, see my real thugs, where ya at now?\nWhere my real thugs, let me see, where ya at?\nTell me where my real thugs gots to see, where ya at?\nWhere's my soldiers - where ya at?\nWhere my, real soldiers - where ya at?\nWhere my soldiers at; where ya at, where ya at?\nGet yo' strap my nigga; where ya at, where ya at?\nWhere my soldiers at; where ya at, what ya at?\nGetcha, thug niggas where ya at, witcha strap?\nWhere my soldiers at, where my true thug niggas\nNo longer drug dealers cause we now, thug niggas\nWhere my soldiers at, no longer drug dealers\nCause we now, thug niggas, let me, where my\nWhere my soldiers at?, put your pistols in the air\nWhere my soldiers at?, put yo' guns up\nTell me where my soldiers at?, put yo' pistols in the air\nWhere my, SOLDIERS, my true thug ROLLERS\nYes, it just doesn't quit, YES!\nThis is that real hip-hop shit YES!\nFuck what you heard\nFrom the ghetto to the 'burbs, know we meant, every word\nWhere my SOLDIERS?, where my soldiers at\nWhere my SOLDIERS?, where my soldiers at\nPut yo' hand on the pistol, put yo' pistols in the air\nWhere my soldiers at?, where my soldiers at?\nWhere my SOLDIERS?, where my soldiers at\nWhere my SOLDIERS?, where my soldiers at\nWhen Bob Dole and Delores Tucker wanna know\nWhere my soldiers at, GO VOTE!!", "image": "https://images.genius.com/4f7dcd7bb697e66f11fe0520838cb066.1000x1000x1.jpg"}], "artist": "2Pac"}