{"songs": [{"title": "Streets Raised Me", "album": "Murda Muzik", "year": "1999-04-27", "lyrics": "[Intro: Havoc]\nYeah, uh huh\nYeah, that true shit\nThat shit to make you feel shit\nTo all my niggas and my bitches\nYo, check it, uh huh\n\n[Verse 1: Havoc]\nIt's kinda bug how I dose sometimes; know they staring\nBrain feels like a wheel lost without the ball bearing\nStuck, contemplating who I can trust\nBut like llello in a bill my feelings just get crushed\nBut thats why I stick with my duns, like I stick with the guns\nDon't get mad, rip your hun, concentrate on my funds\nLift heavy gats concealed by my waist\nNever get patted down when I step in the place\nJiggied up, scope the spot, confirm beef, if it's not\nBally up, after this get followed straight to the crib\nGem star, double edge apply pressure\nShave 'em down, blow marks intruding through your mecca\nWanna be a thug, now you got the thug look\nStick 'em up, leave Medicaid with the bill to foot\nGod-Body, with a rubber grip black shottie\nPump one in that ass make a nigga switch hobbies\nA dosage, hand delivered, without postage\nBring it to your door step quick on short notice\nNiggas get sniped like, clog your bronchite\nShow 'em how to rock right, when bitches are holdin mics\n(Street life)\n\n[Chorus: Chinky (Prodigy)]\nWhy'd you have to raise me this way?\nYou taught me how to survive the concrete\nFor how long only time will say\nForever you a part of me (street life)\nWhy'd you have to raise me this way?\nI'm surprised we alive today, today\nFor how long, who am I to say?\nForever you a part of me\n\n[Verse 2: Big Noyd]\nThis is something you feel nigga, like the theme song from Hill Street Blues\nThis is real, this is ill street news\nHow he gone, and left his moms mind struck\nAnd now his brother not giving a fuck\nLittle sister giving up the butt now, dun don't wet that\nI want you to rest black, 'cause you can believe that Noyd gon' handle that\nCause when I get 'em, I'm gonna have 'em\nPull out the sweeper, and spray it at 'em\nI'm no killer, you know me\nBut I'll be damned if I don't ride for my co-D\nAnd then this OG, scold me, and told me, coldly\nYou keep it up and you will be dead like your homie\nBut I, gotta redeem, get this cream by any means\nI never been clean\nNigga, my whole click got dirty\nFrom the vials, to the trials and the bloodied up syrtie\nNigga you heard me, it's gangsta (and to the block)\n\n[Chorus: Chinky (Prodigy)]\nWhy'd you have to raise me this way?\nYou taught me how to survive the concrete\nFor how long only time will say\nForever you a part of me (and to the block)\nWhy'd you have to raise me this way?\nI'm surprised we alive today, today\nFor how long, who am I to say?\nForever you a part of me\n\n[Verse 3: Prodigy]\nVision the canvas I paint a picture\nSimilar to Ernies Barnes, nigga\nBut mines is more ghetto more guns\nMore drugs, mostly thugs\nAll my dunns, their baby moms daughter and sons\nDark blocks, with streets lamps shot the fuck out\nPark benches is broke, a nigga stretched out\nJumped off the roof and fell to his death, it's real\nHand Ball walls displayed with R-I-P murals\nThose who sling, play the shadows by the building\nDevil's Spring, keep 'em going while the snows blowing\nGrams get dipped, 50's is moked, cookies is broke\nAnd Spliced in large pieces for the fiends to smoke\nThe sun set looks beautiful over the projects\nWhat a shame, its ain't the same where we stand at\nIf you look close you can see the bricks chipped off\nSometimes niggas miss when they lick off, don't get clipped off\n(Street life)\n\n[Chorus: Chinky (Prodigy)]\nWhy'd you have to raise me this way?\nYou taught me how to survive the concrete\nFor how long only time will say\nForever you a part of me (street life)\nWhy'd you have to raise me this way?\nI'm surprised we alive today, today\nFor how long, who am I to say?\nForever you a part of me (and to my dunns)\nWhy'd you have to raise me this way?\nYou taught me how to survive the concrete\nFor how long only time will say\nForever you a part of me (it's real...)", "image": "https://images.genius.com/550b89543b907f703f98597d3c19b1f0.1000x1000x1.jpg"}], "artist": "Mobb Deep"}