{"songs": [{"title": "On the Bible", "album": "Special Effects", "year": "2015-04-01", "lyrics": "[Intro: Tech N9ne]\nNiggas in Mizzou ain't changed\nMake ya have to let loose thangs\n\n[Hook: Zuse]\nHave you ever seen a MAC-11?\nNew TEC-9 with the extension\nHK, AK-47\nMayday, man down, call the reverend\nI put that on the bible boy, count your blessings\nPut that on the bible boy, count your blessings\nPut that on the bible boy, count your blessings\nPut that on the bible boy, count your blessings\n\n[Verse 1: Tech N9ne]\nI felt like they tone said \"I'm comin' to get ya\"\nWell, that's when all of the heavy artillery come in the picture\nAnd luckily cause of your past, you can have someone assist ya\nI was raised a cool brother but these motherfuckers went and summoned a nigga!\nI swore to never let a man's hand take me to my grave nigga\nWith my fortune, I'mma get to torchin', like Orkin I spray nigga\nI know they dyin' to get it with the N9ne\nThat's fine, they wanna make a nigga do the woop\nSo I'mma take the carbine and put it to ya mind\nIt's goin' through you, not around ya like a hula hoop\nPut that on the bible, if ya fuckin' with Tech, get the rifles\nTotally trippin', tryna take my title, lift you right up in the sky with the Eiffel\nIf you psycho, you can do this, if he chooses to be foolish\nThe gun never loses, never give you the deuces\nNigga, this is Su'Wu biz, ahh!\nLet me calm my nerves, I'mma simply put this on the word\nIf ya hella aggravated cause of a song ya heard from the Nina I smoke a nigga like my ganja herb\nI'm on the verge, no life beyond the surge\nWhen I bomb, ya served, what does one deserve?\nBut a head stompin', now put ya teeth on the curb, nigga!?\n\n[Hook: Zuse]\nHave you ever seen a MAC-11?\nNew TEC-9 with the extension\nHK, AK-47\nMayday, man down, call the reverend\nI put that on the bible boy, count your blessings\nPut that on the bible boy, count your blessings\nPut that on the bible boy, count your blessings\nPut that on the bible boy, count your blessings\n\n[Verse 2: T.I.]\nAye, fuck all that goin' back and forth with a nigga\nGot a problem, what he really wanna do?\nIf you know like I know, then you know, true\nAnd niggas make songs but they really don't do\nWhat they say, got guns but they really won't shoot\nHe afraid, I'll lay a nigga down right now\nFace to the concrete, nose to the ground\nDo him in the streets 'fore his prayers hit the cloud\nAnd the flash and a bang, it is rarely allowed\nBut a whole body down and a hole in the ground\nDig one for the niggas who be holdin' ya down\nBetter know I got rounds and they will go around, it's enough\nEat a bullet from the four-pound if ya tough\nAnd then let the choppa spray ya down and get up\nYa pull that off, I'll believe you ain't soft\nOtherwise, nigga you just soft as all them other guys\nI'll kill ya dead and I put that on my mother eyes\nDon't listen to these niggas, they just kick a bunch of lies\nHow they got a bunch of guns? Shot 'em all a bunch of times\nI really do believe Tech got a bunch of nines\nBefore they gave my nigga Meech a bunch of time\nI really know my nigga Young had a bunch of pies\nFor the low, all my niggas headed for the high\nSo you believe them niggas out there talking bout they BMF?\nThat's your business nigga, none of mine\nI know Young Gotti 'bout what he rap 'bout\nI really pulled Meek Millz out the trap house\nJust like I seen Doe B with a OZ\nTurn around, two weeks, had a whole ki\nJust cause I said as a joke that the dope game dead\nLike disco, then a nigga went and showed me\nGuess what I'm tryna say is, nigga, I don't know you\nAnd futhermore, pussy nigga, I don't want to\n\n[Hook: Zuse]\nHave you ever seen a MAC-11?\nNew TEC-9 with the extension\nHK, AK-47\nMayday, man down, call the reverend\nI put that on the bible boy, count your blessings\nPut that on the bible boy, count your blessings\nPut that on the bible boy, count your blessings\nPut that on the bible boy, count your blessings\n\n[Outro: T.I.]\nHaahahahahaha!\nMan, we just killed a small village man\nYou know what I'm sayin'?\nThis hip-hop, aha! Love this shit", "image": "https://images.genius.com/198de8491cab70547cd2c9b1f1803800.521x521x1.jpg"}], "artist": "Tech N9ne"}