{"songs": [{"title": "Wonderful", "album": "Royalty", "year": "2012-07-04", "lyrics": "[Chorus: Josh Osho]\nWe finally made it\nAnd now we sailin’\nI never dreamed we’d get this far\nMy heart keeps askin'\nHow'd it get so wonderful? So wonderful\nHow'd it get so wonderful? (Like we know)\nSo wonderful (Like we know)\n\n[Verse: Childish Gambino]\nYou can call the shots, I’m going to my aunt’s house\nWhat’s it all about? Lookin’ like I’m Millhouse\nWhat’s it all about? I ain’t get my bike back\nI ain’t get my bike back, I know where he live at\nI know what he look like, I know what I live like\nFive to a bed, head to toe, that’s a good night\nFive to a bed, head to toe, with the fan on\nI don’t think these other niggas know what ya man on\nI used to have to sneak just to get my food\nFree lunch made it feel like they don’t approve\nSell a card for a dollar used to be the move\nI wanna be Jabari man, that nigga cool\nI wanna lash out, nigga keep your cool\nAll my friend did was draw something, now he outta school\n‘Cause everything was always “Show me what you made of”\nAnd everybody knew somebody who was laid up\nI didn’t need it, mama said it’s a lesson\nSome people will never like you\nDon’t let ’em catch you stressin’\nYou know a code’s a code, the world can’t stop ’em\nEating out rat holes and Cheerios boxes\nThis nigga think he hot shit, he think he good at everything\nI just didn’t wanna get left out more\nMy little sis’ mom got shot, she in the newspaper\nPrayers couldn’t save her, she died a day later\nLike my cousin got that HIV\nWhen she bust the leg open playing jump rope\nShould I tell them kids what the fuck’s up?\nThey gon' judge her and me\nMan fuck them, we livin’, all is forgiven\nI fucked up royally\nBut now that’s who we are man, you gotta use the royal \"we\"\nThis is royalty, and this is all I ever wanted ‘cause\n\n[Chorus: Josh Osho]\nWe finally made it\nAnd now we're sailin’\nI never dreamed we’d get this far\nMy heart keeps askin'\nHow did it get so wonderful? So wonderful\nHow did it get so wonderful? So wonderful\nWe finally made it\nAnd now we're sailin’\nI never dreamed we’d get this far\nMy heart keeps askin'\nHow did it get so wonderful? (Know) So wonderful (Ohh)\nHow did it get so wonderful? So wonderful", "image": "https://images.genius.com/587833871590a682c8aed1b739f0cb23.906x905x1.jpg"}], "artist": "Childish Gambino"}