{"songs": [{"title": "Fade Me [OG]", "album": null, "year": null, "lyrics": "[Intro/Chorus: Jewell]\nYou can't fade me, you can't fade me\nYou can't fade me, you can't fade me\n\n[Verse 1: Kastro]\nTruly, you're a cutie\nYou know I ain't tryin' to act a fool\nAnd be rude, they call me Kastro\nAnd you; Oh! Storm sound like a cutie too\nWhat's poppin'? with me and you\nJust hit me with the seven\nIt'll be my pleasure to see what we can do\nOh! you ain't alone, got a man at home, answerin' the phone\nBut he ain't the one, 'cause if he is, than why you gone?\nWhat you drinkin' on? - Hennessy with me\nA glass of Thug Passion or just a plain Pepsi\nOh! you're cool? - sure that I assume\nYou ain't too much of a drinker today\nYou was alright, I think I want you right away\nSee, I'm only eighteen, these groupies they just want to sue me\nPush my whoopty, act like they don't spend my dooky\nAnd I could see it'd be\nTwenty-two or so, older soldier on my team\nI put you in my video, and give you plenty of dough\nBy my hotel room, Four fifty four, hope that you go\nBaby, can you fade me?\n\n[Chorus: Jewell]\nYou can't fade me, you can't fade me\nYou can't fade me, you can't fade me\n\n[Verse 2: Napoleon]\nSee girl, I'm laced with game but it ain't similar\nThe shit that I'm talkin' get more deeper\nThan callin' and comin' to visit ya, it's hard to feel ya\nBut I been playin' since I been born\nAnd I moved up in a age strolled the page, turned it, now it's on\nCan't ignore, the way you hit the club and play the floor\nHittin' up every position and that's for sure\nBut I think it's more, than situation that I'm facin'\nYour Shorty was hesitation so I'ma replace her\nPlus to get specific; it ain't no hoochie that's unlisted\nThat the homies that I roll with ain't twisted\nAnd that what makes me diss it\nI ran through cousins, through aunties on down to triplets\nFor droppin' the highest level of game and got no digits\nNow can you dig it? - but you ain't in no competition\n'Cause most conversations you be kickin' you sure to get it\nNow, baby can you fade me?\n\n[Chorus: Jewell]\nYou can't fade me, you can't fade me\nYou can't fade me, you can't fade me\n\n[Collision: 2Pac]\nOh! Mo, you're a little player Napoleon but uhh\n(Let me show y'all little niggas how it really goes)\nI'ma show you how the big dogs do it nigga\nThis is how you get her up\nYou don't know how to rule no bitch nigga\n(Hold up baby! would you get off, thinkin' you can fade me)\nLook how you stutter and shit nigga, watch out\nGet to the side, which one?\nPick all out, pick out nigga, which one?\nThat one? - peep this shit\n\n[Verse 3: 2Pac]\nHold up baby, would you get off, thinkin' you can fade me?\nEvadin' my niggas like radius and then attempt to play me\nOh! yeah, you're crazy thinkin' you can just be Swazy\n'Cause my conversation; gettin' you hot enough for love makin'\nParticipation is needed, yeah, I'm drunk and gettin' weeded\nIn the back of my Jaguar, the life of a rap star\nCompletely freak-able\nI get weak, when I sit and think of shit that we can do\nLet me introduce Mr. Makaveli is who you're speakin' to\nWhat's up with you? - as you can see I love freakin' you (Boo)\nWho, Black, Mexican, Puerto Rican too\nLong as it's ghetto you can bet I'm gettin' deep in you\nBelieve it boo, I got my eyes concentrated on the size of your thighs\nNo I ain't Dre baby, but won't you let me ride?\n'Cause a nigga want the booty cat\nThis Thug Passion so your man can't have it back\nAnd that's a fact, so, how you want to act?\nBaby, can you feel me? - like Run D.M.C. \"It's Like That\"\nTell me, can you fade me?\n\n[Chorus: Jewell]\nYou can't fade me, you can't fade me\nYou can't fade me, you can't fade me\nYou can't fade me, you can't fade me\nYou can't fade me, you can't fade me\nYou can't fade me, you can't fade me\nYou can't fade me, you can't fade me\nYou can't fade me, you can't fade me\nYou can't fade me, you can't fade me\nYou can't fade me\n\n[Collision: 2Pac]\nThat's how you mack to a bitch you little young niggas\nCome on baby, we finna go to my little hotel and shit\nHa ha, to see if you can fade me, feel me?\nHey, don't trip of the 'B' word\nThat's just how motherfuckers talk on my block\nHa ha, What's up though boo? where you want to go?\nNo we can go get a little drama and shit\nDon P., Crystal, Fat ass steak, some lobster and shit\nGo back to the telly\nBump some of that Dramacydal Outlaw Immortal shit\nThat's the type of shit that get me in the mood, you know what I mean?\nHa ha, come and tell you now and uhh\nAnd after a few glasses of this Thug Passion baby\nHuh, it's goin' be like Adam and Eve, feel me?\nEverything stops, puff puff, and you don't stop\nSo tell me baby boo, can you fade us?\nHey one love to that nigga D'Angelo\nNigga, this beat's bad than a motherfucker\nYou know, ain't no disrespect big player\nBut a motherfucker loves this beat so much\nHuh, we have this bitch too, so uhh\nWe're sendin' this one out to you\nOUTLAW!! WEST SIDE!! DEATH ROW!! THUG LIFE!!\nOUTLAW!! WEST SIDE!! DEATH ROW!! THUG LIFE!!\nOUTLAW!! WEST SIDE!! DEATH ROW!! THUG LIFE!!\nBaby, can you fade me?\nWEST SIDE!! THUG LIFE!! WEST SIDE!! THUG LIFE!!\nWEST SIDE!! THUG LIFE!! WEST SIDE!! THUG LIFE!!\nWEST SIDE!! THUG LIFE!! OUTLAW!!", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}