{"songs": [{"title": "Lovestar", "album": "Black America Again", "year": "2016-09-08", "lyrics": "[Hook: PJ]\nYou're my lovestar\nWhat we gonna do, baby?\nYou're my lovestar\nWhat we gonna do, baby?\n\n[Verse 1: Common]\nI'm on what? What you on to?\nI'm the sun god, let me warm you\nOut of my sides the Lord formed you\nPull your dress up, ain't nothin' formal\nOur fragrance is patience\nWe could major in communication\nRelatin' like we cousins, though we kissin' though\nLove can be sick or medicinal\nA doctor of it, you gots to love it\nGod body language I be spittin' while we fuckin'\nIn your ear with somethin' that ain't clear\nOn your inside it appear, so somehow you hear\nI'm sayin' I wanna stay inside\nThey say I'm a deep nigga, I'ma go way inside\nOf everything you are\nCause everything you are is my lovestar\n\n[Hook: PJ]\nYou're my lovestar\nWhat we gonna do, baby?\nYou're my lovestar\nWhat we gonna do, baby?\n\n[Verse 2: Common]\nI ain't the type to be all up on your social\nI'm in your face vocal the way a man supposed to\nA choosy lover, I chose you\nGod's most beautiful creation, let me mold you\nYou already in shape, that's more love to make\nFeel free when I'm with you, it's hard to escape\nWhen we need a break\nWe take it\nWhen two souls connect you can't fake it\nTV shows and cakes, I know your favorite\nCut from the same cloth, let's wear it\nThis ain't about labels, this about fit\nSince God designed, we can start our own line\nOur offspring will be you, me, and He combined\nWe walk the runway like blaow\nBein' in love is never out of style\n\n[Hook: PJ]\nYou're my lovestar\nWhat we gonna do, baby?\nYou're my lovestar\nWhat we gonna do, baby?\n\n[Verse 3: Marsha Ambrosius]\nHeaven agrees you are all that I need down here\nCause you make it all worth it\nWe do this on purpose\nThe love we make is certain\nI'm so caught in your aura, get lost in your force\nI want to be your everything forever, forever\n\n[Hook: PJ]\nWhat we gonna do, baby?\nYou're my lovestar\nWhat we gonna do, baby?\n\n[Outro]\nForever, I wanna be forever\nForever, star\nLovestar, lovestar", "image": "https://images.genius.com/df2659579d57b14f2372fad32ae46f50.1000x1000x1.jpg"}], "artist": "Common"}