{"songs": [{"title": "Friday", "album": "Immobilarity", "year": "1999-11-16", "lyrics": "Yo where this nigga at man\nNigga you a daylight and a dollar short, man its a done deal\nYeah. It's over with, son. It's done!\nAight\nYou owe me 20, 000 big faces for that\nHeh..Who owe you 20??\n..You Al, nigga?\n..nigga I don't owe you shit..\n..aight..\n*sound of a splash as a body hits the water*\n\nFriday nigga\nWhats the word\nYou got something for me\nI'mma see you in 2 seconds\nRight, yo pull my Rover on the side\nRight there police coming man\nHeard me\n\n[Verse 1]\nYo up in the game room 4 in the morning and it's storming and we blitzed\nJust rocked another wig yeah we on it\nGod had blood on his sweat pants\nThe way the tech dance on a nigga face, son ain't have a chance\nSeen him high pitch yellow nigga from outta town\nA young mellow ally trying to run through\nHell, it's on called the dogs to get on him\nAnd we caught him, only thing this nigga was a lord in his forum\nBum nigga fresh outta jail, I used to play baseball with him\n'Til son got large—bought a whale\nAzure by the entrance, guess it's real nigga night out\nHe moving on his own negligence\nYo Lexxy strap up meet you in the back in the Acura\nSpectacular vic, he stackular\nSeen a nigga gem-down, fresh haircut trying to swim now\nAqua green Avias on brim style wild\nWe walked by eyeing 'im\nShorty ain't looked he trying to get fly, my niggas ain't dived on him\nKaze had the Mac in the vest, the way he moving might be dressed\nHe made two rights nigga move left\nStanding by the incinerator, thank God he a generator\nI can tell, bought his lady suede gators\nYo now it's time to move, spin nozzles on the tools\nMight just bust him quiet style rules\nHe walked out the crib, yup draped\nWe on the elevator baked, staring at the nigga chain shape\nWe looked at him, seen all crooked, then we flashed on him\nHe knew we was live, my man Boo spazzed on him\nPulled out, take off the wool, nigga cool out\nWalk you out the bulding, betta run nigga move out\nThis nigga liver than fuck, larger than fuck\nBetter kill me, all y'all niggas is butt, what spray it up\nTuck the chains in, Kaze shot him at point blank range then\nHe started screaming like a cave man\nBlood got a salty taste, I can tell furniture fell out his face\nLaced now it's a case\nThrew up, vomit on my coat piece\nSnatched all his ice now, Chrome T, boatin' off low-key\nDidn't know the kid was large\nHour later call from jail, Mexicans surrounding the gods\nChill you bigga than the ocean, slow motion\nPlay it off no emotion but my man in there grossing\nWhat to do they might kill him\nWe might kill you circulate death, that's how the real do\nWe sat there 3 live macks of the year\nCrack beers one nigga in the back washing off his track Airs\nDon't take it serious, vivid flow luxurious\nI'm hearing this'll, make a real nigga curious\nFriday my day, chill Pop, leave 'em on the highway\nBet he won't never fly my way", "image": "https://images.genius.com/d8508796401925d32124cc47a45641d8.500x500x1.jpg"}], "artist": "Raekwon"}