{"songs": [{"title": "Life We Chose", "album": "Nastradamus", "year": "1999-11-23", "lyrics": "[Produced by L.E.S]\n\n[Intro]\nTo my niggas.. huh..\nWe all we got..\nLet's hold it down though, y'know?\nHowever it's gon' go down\nThis what we gotta deal with, y'know?\nYo..\n\n[Chorus]\nIt's the life we chose (uhh), where friends become foes\nAnd the dough'll get you killed quicker than you know (uhh)\nThis is the life we chose, bring fake snakes and hoes\nAnd the only way out, is death or going broke\nThis the life we chose, ain't too many happy endings\nThat's why there ain't too many happy niggas in it\nAnd I'll admit it, this life is fucked up but yo..\n(But yo..) this life is the only life I know...\n\n[Verse 1]\nUhh, uhh, uhh\nGold bathtubs, making love to my Queen\nGet my back rubbed, Chardonnay, rolling up green\nStatues, marble floors, rare paintings on my wall\nMy lifestyle's like the Forbes Magazine\nClosets, full of rockets and sub-machines\nTake this nigga out the projects, and his thug team\nYo we cruise past street lights, ill rides\nMr. Chow both coasts with the most loud toast\nCalicos roast y'all folks, keep y'all dying\n'Cause it's hard to fuck around when we dealing with science\nMy enemies got money, so y'all should watch how I play it\nThey never know we enemies until they hear me say it\nTil they kid's on the phone saying, \"Please daddy pay it\"\nTil they brain's on the floor, mixed on the pavement\nHigh-class elegance, you respect or you hiss\nYou go against you'd rather piss on an electrical fence\nIt's strategic, how these niggas want you to think\nYou'd be surprised, who'd be the one to put you to sleep\nWhy you stink? Yo these streets don't allow you to blink\nYou get showered by lead, coming out with your mink\nBow ties and tuxedos, bust Eagles\nDump drugs and acid, then they rush with the Rico\nIt's hard fucking with niggas you hope you can trust\nYou a fool if your main bitch is easy to fuck\nAnd you've got money - is these hoes greedy or what?\nShit is devious, ex-friends wanting you stuck\n\n[Chorus]\nIt's the life we chose, where friends become foes\nAnd the dough'll get you killed quicker than you know\nThis is the life we chose, bring fake snakes and hoes\nAnd the only way out, is death or going broke\nThis the life we chose, ain't too many happy endings\nThat's why there ain't too many happy niggas in it\nAnd I'll admit it, this life is fucked up but yo..\nThis life is the only life I know...\n\n[Verse 2]\nUhh, what's love when you don't give your man enough dough?\nHe wanna stick you\nWhat's love, you got beef?\nNobody rolling with you\nWhat's love, you locked up, and your family don't care\nIs love a four-letter word, that deceives the ear?\nWhat's real, when you know your man's girl is a ho\nAnd you don't even let him know, 'cause you fucked her befo'\nWhat's real, when you talk behind a man's back\nThen you see him and give him dap, now explain that?\nWhat's trust, when they separate your case\nWhen you at your court date, your co-de', can't look in your face\nWhat's trust, when you keep your wife away from your man?\nAnd he never crossed you, but you claiming he's fam'?\nWhat's trust, when you get bust, your niggas don't retaliate?\nThey blaze purple haze with 'em the next day?\nGod forbid one of my niggas get hit, I'ma go haywire\nWon't hesitate, I'ma spray fire\nBut everybody's different, you won't know how you react\nTil you in that position, and that's an actual fact\nThe hearts of men change as time goes on, who's wrong?\nYou was hungry when you stuck Duke, he came back to buck you\nWho's wrong? Foul all your life, now you 90\nOn your deathbed you regret being grimy\nWhat's lust, a bust nut? What's a thug?\nA ghetto child raised around drugs 'til he's old enough to bust slugs?\nThen what's jail, to rehabilitate, or to make a nigga worse\nWhen he come home to catch another case?\nLife's about decisions, you choose it, you gotta live it\nYou did it, heaven or hell or prison\nWho knows when your clock'll stop ticking, get your weight up\nSave up before it's over neighbor, I told ya\nYou getting older player, look at those who gave up\n\n[Chorus]\nIt's the life we chose, where friends become foes\nAnd the dough'll get you killed quicker than you know\nThis is the life we chose, bring fake snakes and hoes\nAnd the only way out, is death or going broke\nThis the life we chose, ain't too many happy endings\nThat's why there ain't too many happy niggas in it\nAnd I'll admit it, this life is fucked up but yo..\nThis life is the only life I know...", "image": "https://images.genius.com/d23a600c139bca90fa38b331a4e93acd.1000x1000x1.jpg"}], "artist": "Nas"}