{"songs": [{"title": "Melt", "album": null, "year": "2014-06-19", "lyrics": "[Intro: Mac Miller]\nYeah, right here, or no, never mind\nPete Rock\nYeah\n\n[Verse 1: Mac Miller]\nMy cigarillo bigger than armadillos\nI might go Schizo, pistol under the pillow\nAbysmal, flow hot as fire and brimstone\nSonning these rappers, calling them kiddo, it's simple\nI'm watching movies with the sound off\nIn the dark my shadow colder than a groundhog's\nSo I'm eating Chinese food with the brown sauce\nFuck bitches, nothing but a hound dog\nCount off to a million, do you have time?\nBlast off when you lifted, have you been this high?\nDrifting by, give time a kiss goodbye\nCuz I'm gone, I'll be back as soon as pigs can fly\nI'm the first time Peyton, let the pigskin fly\nIt is I, now that's Tony lifting\nMy shit is addicting, aliens are listening\nListen to this\n\n[Hook: Mac Miller]\nWhy won't you let the rain clouds melt?\nLet the rain clouds melt\nEverybody let the rain clouds melt\nWhy don't you let the rain clouds melt?\n\n[Verse 2: ScHoolboy Q]\nBack with Mac, yeah we mackin' right\nCourt-side looking brain-fried\nBlack and white guy, tie dye\nTwo hoes, tight thighs, no rolls on the ta-ta's\nPre-roll's in my Prada, neck gold, I'm your fa-sha\nSon niggas, I'm the one, here I come\nWhere your tongue came from?\nThe underground like we platinum\nStart the car with my right thumb\nSee me in the ride, Backwood burnin'\nGet green, smoke earnin'\nSo high, spitting on the sky, the extraterrestrial's have arrived\nPassports, we fly by, no court time\nThrow the peace sign, by the Chevy as a Nissan\nNow you acting like a pussy\nFurtherize the level that we took 'em\nBent my dick in your mouth, I'll hush 'em\n\n[Hook: Mac Miller]\nWhy won't you let the rain clouds melt?\nLet the rain clouds melt\nEverybody let the rain clouds melt\nWhy don't you let the rain clouds melt?\n\n[Verse 3: Mac Miller]\nTake you back with medieval, cerebral, assault retrieval\nIf you're trying to get down, better call your people\nFlow like you're walking down a Harlem needle\nSharp as steeples, this is an assault on evil\nAn assault on evil\nSaid this is an assault on evil\nSo get on the mother fucking ground!", "image": "https://images.genius.com/880bfad36ea4699f0bc12885959c88e0.500x500x1.jpg"}], "artist": "Mac Miller"}