{"songs": [{"title": "If I Die 2Nite", "album": "Me Against the World", "year": "1995-03-14", "lyrics": "[Produced by Easy Mo Bee]\n\n[Intro]\nA coward dies a thousand deaths\nA soldier dies but once\n\n[Verse 1: 2Pac]\nThey say pussy and paper is poetry, power and pistols\nPlotting on murdering motherfuckers 'fore they get you\nPicturing pitiful punk niggas copping pleas\nPuffing weed as I position myself to clock G's\nMy enemies scatter in suicidal situations\nNever to witness the wicked shit that they was facin'\nPockets is packed with presidents, pursue your riches\nEvading the playa hating tricks while hitting switches\nBitches is bad-mouth, ‘cause brawling motherfuckers is bold\nBut charge them hoes; the game should be sold\nI'm sick of psychotic society, somebody save me\nAddicted to drama, so even Mama couldn't raise me\nEven the preacher and all my teachers couldn't reach me\nI run in the streets and puffing weed with my peeps\nI'm duckin' the cops, I hit the weed as I'm clutchin' my Glock\nNiggas is hot when I hit the block; what if I die tonight?\n\n[Chorus: 2Pac & Dr. Dre]\nIf I die tonight\nIf I die tonight\nFuck it, If I die tonight\nTonight's the night I get in some shit\n\n[Verse 2: 2Pac]\nPolish your pistols, prepare for battle, pass the pump\nWhen I get to poppin', niggas is droppin' then they done\nCalling the coroner, come collect the fucking corpse\nHe got hit by a killer, preoccupied with being boss\nRevenge is the method\nWhenever steppin', keep a weapon close\nAdversaries are overdosed over deadly notes\nJealous niggas and broke bitches equal packed jails\nHit the block and fill your pockets, making crack sales\nPicture perfection, pursuing paper with a passion\nVisions of prisons for all the pussies that I blasted\nRunning with criminals individuals with no remorse\nTry to stop me, my pistol posse's using deadly force\nIn my brain all I can think about is fame\nThe police know my name, a different game, ain't a thing changed\nI'm seeing cemetery photos of my peers\nConversating like they still here; if I die tonight\n\n[Chorus: 2Pac & Dr. Dre]\nIf I die tonight\nScare to die nigga, is ya, ha?\nIf I die tonight\nNever fear, never worry\nIf I die tonight\nTonight's the night I get in some shit\n\n[Verse 3: 2Pac]\nPussy and paper is poetry, power and pistols\nPlotting on murdering motherfuckers 'fore they get you\nPray to the Heaven's, .357's to the sky\nAnd I hope I'm forgiven for thug livin' when I die\nI wonder if Heaven got a ghetto for thug niggas\nA stress free life and a spot for drug dealers\nPissing while practicing how to pimp and be a playa\nOverdose of a dick while drinking liquor when I lay her\nPistol whippin' these simps, for being petrified and lame\nDisrespecting the game, praying for punishment and pain\nGoing insane, never die, I live eternal, who shall I fear?\nDon't shed a tear for me, nigga, I ain't happy here\nI hope they bury me and send me to my rest\nHeadlines reading 'Murdered to death', my last breath\nTake a look, picture a crook on his last stand\nMotherfuckers don't understand; if I die tonight\n\n[Chorus: 2Pac & Dr. Dre]\nNigga, if I die tonight\nNo fear nigga, never worry\nIf I die tonight\nBury me a motherfucking G, closed casket fuck it\nIf I die tonight\nYou know\nTonight's the night I get in some shit\n\n[Outro: 2Pac & Dr. Dre]\nKill, kill, kill, murder, murder, murder\nKill, kill, kill, murder, murder, murder\nKill, kill, kill, murder, murder, murder\nTonight's the night I get in some shit\nKill, kill, kill, murder, murder, murder\nKill, kill, kill, murder, murder, murder", "image": "https://images.genius.com/aa900ef68a5861f06835ba38e4e6d764.640x640x1.jpg"}], "artist": "2Pac"}