{"songs": [{"title": "Hopeless", "album": "The Red Light District", "year": "2004-12-07", "lyrics": "[Intro: Ludacris]\nOoh.. You feel that?\nAs I take you to them dirt roads deep down in your southern roots, where nobody said life was gon' be easy\nAnd we travel through this emotional rollercoaster called life, and we have our ups and downs\nJust keep in mind, when you hit rock bottom, there ain't nowhere to go but up, baby\nJust all about how you deal with it... ya feel me?\nListen here...\n\n[Hook: Ludacris + Trick Daddy)]\nWhen life seems hopeless, it make a nigga lose focus\nEmpty beer bottles and roaches\nHelps to get it off my chest, 'cause I'm so stressed\nAnd all I hear is \"FUCK THE WORLD!\"\nWhen life seems hopeless, it make a nigga lose focus\nEmpty beer bottles and roaches\nHelps to get it off my chest, 'cause I'm so stressed\nAnd all I hear is \"FUCK THE WORLD!\"\n\n[Verse 1: Ludacris]\nMan, ever since life's been a gamble, my life's been in shambles\nDouble-edge sword, burnin' both sides of the candle\nBut Cris, you can't handle the truth\nDon't wanna face reality, so Lord accept my apology\nPlease, like when police say freeze\nAnd I ain't do shit but I'm down on my knees\nIt's a crooked system, but gin straight take the pain away\nI charge the game and put my problems on layaway\nA black man but I feel so blue\nSo I smoke green and purple till my dreams come true\nThen my eyes turn red, the sky turns grey\nChildren slangin' white in the hood, we call it yay\nDrinkin' Ol' Gold down my yellow brick road\nThen rewrite my script until my story's untold\nSee, I got a little money and my life sped up\nNow I'm fallen and I can't get up\n\n[Hook: Ludacris + Trick Daddy)]\nWhen life seems hopeless, it make a nigga lose focus\nEmpty beer bottles and roaches\nHelps to get it off my chest, 'cause I'm so stressed\nAnd all I hear is \"FUCK THE WORLD!\"\nWhen life seems hopeless, it make a nigga lose focus\nEmpty beer bottles and roaches\nHelps to get it off my chest, 'cause I'm so stressed\nAnd all I hear is \"FUCK THE WORLD!\"\n\n[Verse 2: Trick Daddy]\nI had a dream about a dope fiend\nAnd it's strange 'cause he can barely write or read but seems to get folks just about anything\nCurious about him, I wanted to talk to him\nSaid he was too busy fo' that, but I was more than welcome to walk with him\nSo as we walked, he talked and I just listened\nHe said there's a big difference between crackers and niggas\nHe said white folks look out fo' the white folks, but uhh\nBlack folks blame otha' black folks when it ain't enough black roakz\nWhen you ooh to make a long story short\nWe need pay more attention and do things that's way more convincin'\nAnd he told me, you know, I wouldn't sell you somethin' that wasn't workin'\nAnd I, damn sure wouldn't waste my time, tellin' ya somethin' that'll hurt you\nBut you'll fall for anything, if you don't stand for somethin', that's for certain\nBut niggas don't be listen, and that shit be hurtin'\nNot all of us, but some of us, and if we don't hurry up\nThey gon' to bury each and every one of us\n\n[Hook: Ludacris + Trick Daddy)]\nWhen life seems hopeless, it make a nigga lose focus\nEmpty beer bottles and roaches\nHelps to get it off my chest, 'cause I'm so stressed\nAnd all I hear is \"FUCK THE WORLD!\"\nWhen life seems hopeless, it make a nigga lose focus\nEmpty beer bottles and roaches\nHelps to get it off my chest, 'cause I'm so stressed\nAnd all I hear is \"FUCK THE WORLD!\"\n\n[Verse 3: Ludacris]\nSometimes I can't deal with my daily issues, just bein' sober\nLife's a bitch and I can't control her\nI wish I could and sometimes to cry on we need a shoulder\nThe government stand us up to run us over\nAnd in the hood, they don't seem to understand, goddamn\nWhat's really got me wonderin' if it's part of a bigger plan\nMan I smell something fishy goin' on\nIt's way beyond blowin' away the smoke from all of Swishers goin' on\nIt ain't much I can do about it (No), but preach the word\nTell my people to spend ya money wisely, don't be absurd\nBuy some things that appreciate, (Like what?) like a home\nWake up, and open ya eyes to what the fucks is goin's on\n'Cause they constantly gettin' rid of us (Yup), one by one\nWhether it's drugs or diseases or it's, gun by gun\nI ain't no saint either, I feel I'm even doin' wrong\nBy usin' what's in this chorus just to get through this song\n\n[Hook: Ludacris + Trick Daddy)]\nWhen life seems hopeless, it make a nigga lose focus\nEmpty beer bottles and roaches\nHelps to get it off my chest, 'cause I'm so stressed\nAnd all I hear is \"FUCK THE WORLD!\"\nWhen life seems hopeless, it make a nigga lose focus\nEmpty beer bottles and roaches\nHelps to get it off my chest, 'cause I'm so stressed\nAnd all I hear is \"FUCK THE WORLD!\"\n\n[Trick Daddy]\nYou know, y'all going to mess around and keep on complainin' about slavery, when uhh, that was over 40-50 years ago, you know, black folks need to move on\nStay strong and umm, ya'll keep playin' wit a cracker they gon' have yo ass, somewhere tied up wired up on them back roads of south Florida, Georgia\nAnd they made the laws so them shits can't do nothin' for you\nCan a church get a amen?\nGod for the thugs, too\nAmen", "image": "https://images.genius.com/57e6650f3864beef0e227e02f76d83b0.1000x1000x1.jpg"}], "artist": "Ludacris"}