{"songs": [{"title": "Here Ye, Hear Ye", "album": "Back 2 The Throne", "year": "2011-10-18", "lyrics": "[Intro: Pharrell]\nYup!\nUm\nUgh\nYeah\n\n[Verse 1: Pharrell]\nThere's a rainbow everywhere dependin' on where you stand\nWhether the dashboard of yay or the walls 100 grand each\nDouble R, interior tan, outside is peach\nOh, you trying to make a deal out in Golden Beach?\nOr the Florida Keys, ducking the Florida Ds\nBut you only end up with bricks of sand\nI know niggas that run from they shadows like Peter Pan\nRunnin' like it's a Nike commercial, but he the man\nWhat he don’t like, on sight, he murk like he's the Klan\nEightballs the size of baseballs like Jeter’s hand\nIt's fecal, fam—yeah, it’s the shit\nZip your face up when Skateboard is on the script\nCatch me in the Gap V with some BBC trunks\nFlip flops, sippin' on Qream like it's punch\nI push the spaceship with the chrome lady in the front\nBendin' over like she just puffed Busta’s blunt\nI told y’all muh'fuckas once: I think I’m hungry\nFinna eat y'all niggas' lunch, y'all niggas cunts\nI’m from the commonwealth where wealth ain't common\nWhen niggas roll around with chrome solvers\nLooking for problems\nMouth full of gold, flame when they roll\nArthritic fingers: niggas bang when they stroll\nTradin' in the hats for the cane and the gold\nThe golds for the chain and the 'caine was on swole\nAyo Tip, get these peon niggas told\n\n[Verse 2: T.I.]\nStill stand tall when it all falls down\nWhether Hollywood Hills or a one-horse town\nYou should know better\nThere’s no better than these four letters\nMore than ever, niggas want me dead\n'Cause they're starving and I'm getting fed\nBut fuck 'em anyway\nI’d rather be me on my worst day\nThan to be a sucka nigga on his birthday\nAll cake, no candles, just a living example\nTen toes down, all out, no sandals\nGodfather, young Marlon Brando\nLet me make sure they understand, yo\nHere ye, hear ye, you wise, you fear me\nReal niggas on their shine, much obliged, merci!\nEverybody want to criticize him\n'Bout how bad he ended up; ook how bad he could've been\nI could've caught a body, sold a brick to somebody\nWho volunteered my information to the federales\nI made it out of all of that like I ain't gonna be proud of that\nSo petty shit you sticking to me? Give me all you got of that\nDoing this for all my niggas\nWho'd rather go to prison than to let a nigga kill 'em\nSo we leaving this PO snub-nose in his denim\nTrap or death is waiting 'round the corners that he been in\nOn bended knee, God forgive us, we been sinnin'\nIn our defense, look at the options we was given\nLaying in the prison cell staring at the ceiling\nBack in this bitch again, guess they wasn't bullshitting, huh?\nStill wonder where it all went wrong\nSince Phil got killed, I ain't never moved on\nLike I’m still in the club where the blows got thrown\nWhen my crown fell down and I got dethroned\nBunch of niggas around but I feel all alone\nLike a piece of me is missing; guess it never came home\nProbably died in the van when it all hit the fan\nSave the life of a friend: we don’t all get the chance\nNow, here I stand, with blood on my hands\nTrying hard to explain so his mom understand\nI'm at fault for the loss of the soul of a man\nOnly soldiers know how that'll take a toll on a man\nBurdens of the world on my shoulders: heavy\nVisibly composed, my emotions: buried\nScary, so if I pop a pill\nSmoke a blunt or take a shot, y'all, let a nigga live\nStill baffled how my life unraveled\nIn the meantime, time just travelled\nCan’t see behind the walls of my castle\nOpinionated peon, son, but who asked you?\nI tell you: what you do, take your 2 cents\nKick rocks to a fountain, pitch 'em and make a wish\nShit, if wishes had wings\nThey’d all make it to heaven and we’d all be kings\nHahaha! If wishes had wings\nThey’d all make it to heaven and we’d all be kings\nYeah!", "image": "https://images.genius.com/6e0b92763aa55c2af243643df7b7f24c.475x475x1.jpg"}], "artist": "T.I."}