{"songs": [{"title": "Goner", "album": "Ghostdini: Wizard of Poetry in Emerald City", "year": "2009-09-29", "lyrics": "[Intro: Ghostface Killah]\nThis gonna be one of them shits right here, boy\nYeah baby, let's do it\n\n[Ghostface Killah]\nOh shit, look at miss thing, you done grew into a stallion\nGirl, and still don't got no ring?\nBack then, you was alot younger, now you older\nBroke my heart, on what you had in the stroller\nOn the low, that could of been me, Huggie down\nFly and handsome, talk about little Starksky\nWith little Barkley's, little car seat\nTwo years later, here comes little Sharneese\nI'm saying, are you involved, what's up with you?\nAnd where homeboy at? Oh word, ya'll through?\nEff him, you know how I do, when I come through\nShut the whole block down like I got something to prove\nBut umm, besides the lane, you look the same\nStill blowing beauty marks, sitting under your bang\nAnkle bracelets, that Donna Kay shit\nI saw one rope for your throat, yo, it cost about 8 chips\nHoodrats, they be wearing that fake shit\nLike her, she wear the same bag, like it ain't shit\nPardon me, excuse my French\nJust read my lips, girl, everything's me\n\n[Hook 2X: Lloyd]\nHe's a goner, hey, you just say the word\nBaby girl, I'm on that, hey, anything you need\nAnything you want, want, hey, hey\nCuz he don't know I gotcha\nAnything you need, I gotcha\nOoh, baby girl, I gotcha\n\n[Ghostface Killah]\nYo, look around, everybody sipping on Rosette\nAll in our business, they wanna be nosey\nHe's with her, gonna be all in the streets, like a Jeep, tomorrow\nDon't worry, let's breeze the bar\nAnd in case I ain't tell you, those jeans is hard\nAnd those is the snitches, mean mugging, can't fight\nRun into the po-lice, fuck them niggas\nI pull out, like a tooth, when the back is rotten\nFinish 'em off, like your menstrual, after you spotting\nGhost can't complain, 5'6\", swinging those hips\nAnd my miss got me wanting to sing\nWalking down the street, watching ladies\nI got by watching you, watching you\nI want you, like if I ain't got nothing to do\n\n[Hook 2X]\n\n[Lloyd]\nSomebody better call the cops\nCuz if that thing cock back, it's gon' pop\nOnce me stop moving, it ain't gon' stop\nWhatever that girl wants, you know she got shopping\nSomebody better check the swag\nWe rack up and never check the tags\nWe just stuffed it all in the bag\nOh, you mad? Well, too bad\n\n[Hook 2X]", "image": "https://images.genius.com/ea54fa933d61e534fbf14d9509cc7146.1000x1000x1.jpg"}], "artist": "Ghostface Killah"}