{"songs": [{"title": "Kush & Corinthians (His Pain)", "album": "Section.80", "year": "2011-07-02", "lyrics": "[Intro: Kendrick Lamar]\nCheck, check, check, check, check\nIt go...\n\n[Chorus 1: Kendrick Lamar]\nRide to it, ride to it, 'cause you never know\nWhen a bullet might hit and you die to it, die to it\nDie to it, die to it, live your life, live it right\nBe different, do different things\nDon't do it like he did, 'cause he ain't what you is\nBut we can win, wait, let's get straight to the point\n\n[Verse 1: Kendrick Lamar]\nTo the meaning of life, what's my purpose?\nMaybe this Earth is ain't a good place to be\nHow far is heaven? Let's see\nIs it in the clouds like they said it would be?\nI wonder when I die will he give me receipts?\nI wonder will the eyes of the Lord look at me?\nLook at me, look at me, I'm a loser, I'm a winner\nI'm good, I'm bad, I'm a Christian, I'm a sinner\nI'm humble, I'm loud, I'm righteous, I'm a killer\nWhat I'm doing, I'm saying that I'm human, now people just\n\n[Chorus 1: Kendrick Lamar]\nRide to it, ride to it, 'cause you never know\nWhen a bullet might hit and you die to it, die to it\nDie to it, die to it, live your life, live it right\nBe different, do different things\nDon't do it like he did, 'cause he ain't what you is\nBut we can win, wait, let's get straight to the point\n\n[Verse 2: Kendrick Lamar]\nIt go one (one), two (two), three (three)\nTwo in the front, one in the back seat (seat), seat (seat), seat (seat), seat (seat)\nLooking for a victim of an AK-47 100-round each, each, each\nBut why must we retaliate? Is it human nature?\nI don't know, I look for the answers later\n\"Make a right, there they go!\"\nSometimes you gotta\n\n[Chorus 1: Kendrick Lamar]\nRide to it, ride to it, 'cause you never know\nWhen a bullet might hit and you die to it, die to it\nDie to it, die to it, live your life, live it right\nBe different, do different things\nDon't do it like he did, 'cause he ain't what you is\nBut we can win, wait, let's get straight to the point\n\n[Verse 3: Kendrick Lamar]\nAs I open this book and then burn up some of this reefer\nMy plan is to figure out the world and escape all my demons\nI'm dying inside, I wonder if Zion inside the heavens\nA condom, a Rollie, pain, a fat blunt and a MAC-11\nThat's all I see in my life and they tell me to make it right\nBut I'm right on the edge of Everest and I might jump tonight\nHave you ever had known a saint that was taking sinner's advice?\nWell it's probably you, am I right? If I'm wrong, you a fucking liar\nWhen I lie on my back and look at the ceiling, it's so appealing to pray\nI wonder if I'm just a villain, dealing my morals away\nSome people look at my face then tell me don't worry 'bout it\nI give 'em back they deposit, no money, just total silence\nI'm running, they say I'm wilding, a young'n with lack of guidance\nThat's hundreds of us with problems\nMo' money, mo' drugs and violence\nLook at the soul of an out-of-control artist\nThat's dealing with life the hardest, that's on my life\nBut regardless I'ma\n\n[Chorus 2: Kendrick Lamar]\nRide to it, ride to it, 'cause I never know\nWhen a bullet might hit me and I die to it, die to it\nDie to it, die to it, live my life, live it right\nBe different, do different things\nDon't do it like he did, 'cause he ain't what I is\nBut we can win, wait, let's get straight to the point\n\n[Verse 4: BJ the Chicago Kid]\nYeah, life can please you, but death can tease you\nOn the day Niko had that seizure\nI lost one of my biggest believers, aww!\nClose deaths make you think about your life\nLike if I had that same chance twice, what would I do different?\nI'd tell her I loved her more, do more\nBut tease her 'bout crying on that picture\nNow when I'm done recording\nSwear, I let the beat bang in her name\nMake her shake her head in heaven, saying, \"They at it again\"\nMake them clouds turn to speakers\nDon't take too much smoke from the reefer\nLove being in the room with her peoples\nNow my love life murking it, family having surgeries\nHate it that the truth that chose for they life to be under me\nLord, what kind of life is this?\n\"Momma, I just wanna sing\"\nMomma said, \"According to get everything...\nYou gotta risk everything\"\nSo I'm smoking my kush, reading Corinthians\nSmoking my kush, reading Corinthians\nSmoking my kush, reading Corinthians\nSmoking my kush, reading Corinthians", "image": "https://images.genius.com/1f3cde1d04f886d4d4eb88a2c26a4e4d.1000x1000x1.jpg"}], "artist": "Kendrick Lamar"}