{"songs": [{"title": "Hit ’Em Up (Original Version)", "album": null, "year": null, "lyrics": "[Intro: 2Pac]\nI ain't got no motherfucking friends\nWhat y'all niggas talking about?\nHell yeah I'ma do this motherfucking track\nAnd they know exactly who I'm  talking about, too, you old bitch-made niggas\n\n[Verse 1: 2Pac]\n'Cause uh, niggas talk plenty shit, so many tricks\nI fucked your bitch 'cause I'm true to this, witness the hit\nYou talk bad 'bout a nigga when I got blasted\nHope you made a little money while the funk lasted\nHeard they call you Big Poppa nigga, how you figure?\n'Cause to me you'll always be a phony fat nigga\nI can't be copied even wearing Versace, nigga you run or ruck\nScared as fuck, if the guns would bust\nNow niggas talk I got a list of player haters and fakes\nYou bitch niggas getting blown away\nYou cross-eyed Down syndrome crack baby\nSo you and Puffy are tough? Now that's crazy\nI got your ass in my sight, niggas dying tonight\nWe screaming, \"West Side for life\"\nAnd I can't wait to see you niggas in traffic 'cause we gonna get 'em up\nWhen you see me, you better bust 'cause I'ma hit 'em up\n\n[Hook: 2Pac]\nGrab your Glocks when you see 2Pac\nCall the cops when you see 2Pac\nWho shot me? But you punks didn't finish\nNow you 'bout to feel the wrath of a menace\nNigga we hit 'em up\n\n[Verse 2: Napoleon]\nIt's hard to explain, this wasn't my thang when I was younger\nBefore my shit, I swear to God, I'll leave you stick just to make a come up\nNiggas run up, 'cause more murder for the money\nGot caught up tryna make a harder record, should've been on checked it\n'Cause I bet you and it's for life\nYou'll never gonna see a nigga like me wanting a battle up on T.V\nI'd rather release some of these\nAnd put a slug to you buster ass niggas that continue to squeeze\nI got some niggas back in Jersey that rather be jacking cars\nAnd robbing bitch niggas like y'all for emergency\nLet's take it back to the West Side\nThem niggas sure gonna be riders and plus we Thug Life niggas, so call us multiply\nFinger on the trigger, bitches stand and rise\nBut we don't trust 'em and they might be the first that we gon' bust on\nJust label me a Bad Boy Killer\nDo Mobb Deep bitches gonna feel us when we turn into killers?\nHit 'em up\n\n[Verse 3: E.D.I Amin]\nNow this is me, BBK all day, ain't no Bloodin', ain't no Crippin'\nStrictly Bad Boy killer, shoot that ass like a squealer\nNow let this motherfucka top down, I'm finna drop rounds\nLetting these sounds, pop and then I hop up\nSeeing them shatter, shooting my shit to work a lease go\nWhat's up to the riders in a L.A. Long Beach on up to the East O\nShooting at you, C-Lo, circle, this is yo virtue\nThe beef for the rest of [?] meant to turn you purple\nWanna take no fame for being enemies to the game\nWho'll get that ass tamed, simple and plain, y'all know the name\nDrama, riders, through the whole line up\nNiggas get tired of dumpin' with they gat 4\nThen we mobbin' through they hood slow\nNo need for running 'cause we's don't give a fuck\n'Cause I'm the [?], we gots to hit they ass on up\n\n[Verse 4: Hussein Fatal]\nGet out the way, yo, get out the way yo\nBiggie Smalls just got shot\nAnd I'm a true eagle storming, nigga don't need your fat ass in California\nI catch you on any East Coast corner and you's a goner\nPuffy weaker than fucking block, I'm running through nigga\nAnd I'm smoking Junior M.A.F.I.A in front of you nigga\nWith the ready power, tucked in my Guess under my Eddie Bauer\nYour clout petty sour, I push packages every hour\nMy sons past moon slapping nickels on glass 40s\nSo hand me the cash, you made on the ave\nBut that’s yo ass shorty\nI got a team of simple bout-able souls\nMove my ears like Yoda, quick as a cobra and never sober\n\n[Verse 5: Kadafi]\nI'm on a 12 O' Clock cruise to Brooklyn and I'm looking\nFor the thrill to see in your barrel ready to get his life token\nSo where you killers at? it's bang trick? don't tempt me to\nLeave your coward ass stripped and a full clip empty in your stomach\nChoosin' all, yeah nigga run it\nDropping all you cowards that be jackin' a nigga behind him\nYou done just about made it an impossible to escape\nAnother 'mergency visit to the hospital I can't wait\nTo meet up with all you bitches in the streets\nSo I can leave all you cowards leaking in your fucking seats\nWhen we hit 'em up\n\n[Verse 6: Storm]\nIf you a big bad mothafucker come step to this\nI got points in the clips and [?] of the [?]\nWho wanna test that, to the 1 2 3 pound to bound to get they ass put under\n'Cause the Storm is bringing nothing but thunder (that's right)\nWho's the bomb nigga quick to feel that itchy finger\nSituation on my na-na who's the bigger trigger\nI approached a true G, you thought I was bitch easy\nNow you on your knees shakin' me\n\n[Verse 7: Prince Ital Joe]\nWho fi broke-broke an who fi rich-rich\nOutlaw Immortal will never switch\nPolice informa, di bwoy dem a snitch\nLive the thug life and get buried ina di ditch\nNew York uno better respect 2Pac\nAn di yute Big, dem proud to be black\nJealousy some of them act like idiat\nHangin’ pondi corner an smoke nuff crack\n2Pac a di artical an dats a fact\nSo seh dis an so seh dat\nNew York uno better respect 2Pac\nIf uno diss, u will gonna get a gunshot\nOutlaw Immortal will come an attack\nRadical posse, as we have thug life back\nJamaican posse, yes, we love 2Pac\nWarrior black an di yute nuh smoke crack\nNew York uno better respect 2Pac\nAn di yute big, dem proud to be black\nJealousy some of them act idiat\nHangin’ pondi corner some of dem smoke crack\n2Pac a di artical an dats a fact\nSo seh dis an so seh dat\nRespect to my bredren 2Pac", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}