{"songs": [{"title": "Soul By the Pound (Thump Mix Remix)", "album": null, "year": "1993-07-13", "lyrics": "[Hook: Repeat 2X]\n\"Boom it in your boom it in your boom it in your jeep\" - Q-Tip\n\"Type of shit that hit when you pump it in your trunk\" - Puba\n\"Boom it in your boom it in your boom it in your jeep\" - Q-Tip\n\"Ba-bump, ba-bump, make your speakers pop!\" - Redman\n\n[Verse 1]\nI'm as bad, bad as Leroy Brown, Brown\nI'm a pro p-pro, but not a noun n-noun\nIf you got beef, beef, you get ground, ground\nCut up and sold, sold, by the pound for pound\nI'm going downtown like Julie Brown, I'm the round mound\nNot of rebound, but like a hound, I get down\nNever wore a leash but I'm a show ya\nHow loose is my goose, got more soul than combat boots\n(\"I got soul, you got it!\") That's why I came\nThey keep callin me, man, they keep callin me, they call my name\nEse I can't - give it away, give it away now!\nOr say when, say what?! Or say how\nShh okay between you and me man what's all this white rap?\nI Got the Power! And I just, I just might Snap\nBum ba-bum, bum bum!!\nThink fast... cause I'm the Ramadan\nAhoy-he-hoy-he, I'm Fat Boy\nShibidabibidabee, boom boom, I'll be the bad boy\nHaving a party, but I'm not a Democrat\nSpoiled as a child, but now I'm milk like similac\nDon't have Cinemax, because my cable's pirated\nBug out wit the rhyme, try to swat and I'll get fly wit it\nFor pest control, I suggest some soul\nAs far as dick I got it but I have no breath control\nSo gimme a T.O. baby like umm, Chris Webber\nI got myself together\nNow I'm straight, are you straight, if you straight, then I'm straight\nRock me tonight, just for old time's sake\n\n[Hook: Repeat 2X]\n\"Boom it in your boom it in your boom it in your jeep\" - Q-Tip\n\"Type of shit that hit when you pump it in your trunk\" - Puba\n\"Boom it in your boom it in your boom it in your jeep\" - Q-Tip\n\"Ba-bump, ba-bump, make your speakers pop!\" - Redman\n\n[Verse 2]\nRoll to the rock, rock to the roll\nCan't no A&R tell me that I ain't got soul\nC'mon, can I get a clap?\nCan't you see I'm trapped, and I'm so confused\nDues is gettin' paid but what about the bills\nI wanna make some dough yet I wanna show my skills\nDo you even know where I'm goin?\nI ain't scared of you motherfucker, though I am of the Omen\nI jam like a Cult but make note, I'm not Koresh\nCause I control minds with rhymes\nSo FBI don't test, I got a no. 2 pencil\nAnd I'm a scribble all over your faaaace!\nYou see I don't pack no gat\nI didn't see CB4 cause I heard that shit was wack\nLike Chris, I Rock, I'm strapped like my jock\nPeace to No ID and my nigga Y-not!\nCheck it\n\n[Hook: Repeat 2X]\n\"Boom it in your boom it in your boom it in your jeep\" - Q-Tip\n\"Type of shit that hit when you pump it in your trunk\" - Puba\n\"Boom it in your boom it in your boom it in your jeep\" - Q-Tip\n\"Ba-bump, ba-bump, make your speakers pop!\" - Redman\n\n[Verse 3]\nWhoopee, look at me, I'm hipper than a hippie chick Flyer than the flu, so ill, the MC's say, \"You make me sick!\"\nWell, go see the doctor — in your car, rock my tune\nWit the Boom shak lak lak boom\nI'll fire on a cracker, bayow, watch where the sparks went\nFatter than Dre, a Lover like Ed, super as Clark Kent\nSo gimme the Lane, Lois as I change clothes without a booth\nAnd light high ish like woof\nThe roof is on fire, it's not an L.A. riot\nI got more ho, ho ho's than the Jolly Green Giant\nLarge as the Professor and I'm never faking funk, akh\nFat as heavy metal yet I'm harder than punk rock\nSo take me to a land I know not too far away\nI got skills like Tim, and I'm coming in a Hardaway\nSo keep the crossover, Common is a b-boy\nWhile you be dragging last, I be kicking like Bruce Leroy\nSho' nuff! Yo, I got the stuff that tops the stove\nAnd I am about to explo-o-o-ode\nWho was that masked kid? That's what'cha ask, kid\nPetey Wheatstraw, Cutthroat, Lonnie or Rashid\nBut oh no, this was Common with his soul glow\nComing from Chica- but yo I gotta go-go\nThe go, check, check the go (ha-ha)\nThe go, check check the go (yeah)\n\n[Hook: Repeat 2X]\n\"Boom it in your boom it in your boom it in your jeep\" - Q-Tip\n\"Type of shit that hit when you pump it in your trunk\" - Puba\n\"Boom it in your boom it in your boom it in your jeep\" - Q-Tip\n\"Ba-bump, ba-bump, make your speakers pop!\" - Redman\n\n\"Boom it in your boom it in your boom it in your jeep\" - Q-Tip", "image": "https://images.genius.com/c373c33c35be2bbc253b17152ab16152.600x600x1.jpg"}], "artist": "Common"}