{"songs": [{"title": "My Wrath", "album": null, "year": null, "lyrics": "Yeah...it's the Future...the hawk is out..\nIt's a good look for me man...I'm stronger than ever, I feel great!\nNate Butters, whaddup? It is real, whaddup?\nNemo, I see you, baby! Let get 'em {?} out, YEAH!\nPlatinum, got another one, baby! Let's do it!\n\n[Verse One]\nI'm walkin' this walk, I'm talkin' this talk\nThe boys they got my back up, walkin' wit' a swagga\nSneaks stay fresh, white-tee stay cris-py\nLight crease in my blue jeans, y'all try to stay with me\nNate Butters hook my line up, sharp tape in the sides and the front\nJackie Chan style, I do my own stunts, UH!\nBlack man, watch that, man right thurr\nSo much dough in my back pocket, I gotta front\nI got favor, my back's watched, how bout your front?\nNeighbor relax please, cause trust me this ain't what you want!\nToo many soldiers walk with He, be easy\nThe team gives ghosts the heebie jeebies (brotha please!)\nI ain't scared of nuthin' under the heavens\nI throw wack suckerz, doggy start hoein' and heavin'\nListen, yo' flow is +daffy+, start +duckin'+\nCause my flow is hungry and my bar'll eat your team up, AH!\n\n[Chorus 2X]\nSECULAR RAPPERS, I'm COMING, uh!\nYou hear my footsteps I'm coming..\nAnd I mean this brotha to brotha, man\nI hope you suckerz got your bags packed\nCause if not you're gonna feel my wrath!\n\n[Verse Two]\nMy bible got a lot of +clips+, +baby+ (\"Grind-in'\" *brrrrrrrrrr*) *Birdman call*\nSo relax, boy, before they ask \"What Happened To That Boy?\"\n(Did you catch that one?) Won't hesitate a minute to get at that boy\nI make that sin thing diminish and your flesh could go wit' it, UH!\nFuture's flow quite attractive and dapper\nThe chiropractic rapper, I GETS IT CRACKIN', UH!\nHe's so focused, it's nothing that could distract him\nPut a low jack on his ankle, y'all still couldn't track him\nI'm not braggin', but the flow is proper\nAny bro' close to Future flow probably with Hoffa (uh!)\nMeaning dead somewhere under a field\nI give props to Pac and B.I.G., but, that's about it, UH!\nAnd I'm glad Jay finally retired\nHe got out the game just in time, to miss this fire\nBut the rest of you suckerz get ready\nI'm about to have the whole secular industry, +delirious+ like +Eddie+ (WOO!)\nI'm not heady, I'm just so sure\nThat Jesus writin' and Future flow sick wit' no cure\nChitty chitty bang bang, Future doing his thang-thang\nRappers' movin' they mouth, but ain't saying a DANG THANG\n\n[Chorus 2X]\n\n[Verse Three]\nYou secular Iraqi rappers, it's over for you soldiers\nLike Bush and Sadaam, I push buttons and BOMB\nFlow hits so quick, faster than Islam\nAnd deeper than a Buddhist, I'll show you how to do this!\nMatta of fact, I'll show you how to do it the right way\nThese ain't just bars of stuff I'd like to say\nBut these is bars of stuff you might see\nIf you're even in Vegas (Greenville) or anywhere that I might be\nAnd don't think it's a game!\nI'm twenty-plus years old, I stopped playing around thirteen\nAm I the only one that's seeing the world is hurt-IN'\nAnd willin' to spit with substance, not about slingin' and frontin'\nBars is wack and empty, not rappin' about nothin'\nEmpty barrels making a lot of noise, and listen\nI ain't scared of none of your BOYS\nI got boys too, and we got favor, what chy'all got is na-thin'!\nI'm simply too much for ya!\nYou can't fool with the brotha, if you do he'll bust ya!\nDuck tape your flesh up, doggy, and Bible-butt ya\nYou better chill before it get real and you get touched brah!\n\n[Chorus 6X]", "image": "https://images.genius.com/383bdf7e658c81236926af98a9211465.780x780x1.png"}], "artist": "Future"}