{"songs": [{"title": "Something More", "album": "Napalm", "year": null, "lyrics": "[Hook]\nSomething more, something more than faith\nSomething more, something more than fairytales\nThe story of a little star, looking for a place to shine his light\nAt first he'd gone astray, but now he found his way\nAnd so he shines the brightest in the sky\n\n[Verse 1: Xzibit]\nI designed an oasis, wide open spaces\nButt naked bitches having sexual relations\nMajor operation, let me take conversations\nSensitive intel, pay attention to detail\nYeah, design the flat, not your vital signs\nAC, DC, alkaline, whichever type of battery you got in your back\nGon' be removed when the clips get slapped\nYou and your bitch get slapped, damn, it's good to be back\n\n[Hook]\nSomething more, something more than faith\nSomething more, something more than fairytales\nThe story of a little star, looking for a place to shine his light\nAt first he'd gone astray, but now he found his way\nAnd so he shines the brightest in the sky\n\n[Verse 2: Prodigy]\nMy hip hop is outstanding, outlasting\nAll of these dwarf stars, they fizz a lot fast week\nBurn like the sun and you suck like a black hole\nSuck in my style and get over my flagpole\nThese colors don't run, we attract to\nDrama like madness, you wanna get your head flew\nIncredible bars, I show 'em how to rhyme\nI'm not the average, no in fact I'm\nSuper rap killer, extremely great spitter\nMake a dope, hit a door, solve the queen's riddler\nSinister, ill enough to bang with the sickest\nSo get up and get down with the sickness\nThis is something more than just songs\nI wish upon the stars, pray to God that I come with\nBetter lines than them, to crush their dreams\nAnd attempts at my sport when I do this thing\n\n[Hook]\nSomething more than faith\nThe story of a little star, looking for a place to shine his light\nAt first he'd gone astray, but now he found his way\nAnd so he shines the brightest in the sky\n\n[Verse 3: Xzibit]\nWhat you know about death, money and sacrifice?\nWhat you know about people scheming to take your life?\nI'm tryna tell you, what know about these Cali G's?\nThat mister penitentiary invested movement on a bigger better day\nWhat you know about the harder man?\nWe paint the art of war to decorate the promised land\nYou understand, it's in my nature not to walk away\nCause I'm a beast, my beats'll open up your chest and face\nCall the police, it's not the same and I don't give a fuck\nI speak the truth and now my catalogues are living trust\nNow give it up and get it, take it at gun point\nWe cut-throat niggas in what point\nYou gonna realize we came for\n\n[Hook]\nSomething more than fairytales\nIs a story of a little star, looking for a place to shine his light", "image": "https://images.genius.com/727e047579481405310e18c83d10416c.1000x1000x1.jpg"}], "artist": "Xzibit"}