{"songs": [{"title": "Good Morning Love", "album": "Let Love", "year": "2019-08-30", "lyrics": "[Intro]\nYeah\n\n[Chorus: Samora Pinderhughes]\nWhen we wash all our pain away\nWe say, \"Oh, my Lord\"\nWhen we can't make it through the day\nWe pray, oh, my Lord\nIt's a test coming to my faith\nWe pray, oh, my Lord, mmh\nWill my people ever be safe?\nIn the land that takes us and breaks us, I can't be sure\n\n[Verse 1: Common]\nWalking with the Lord, I see footprints\nMy mama always told me use my good sense\nCommon always looking for the good sense\nSince we all got good in our essence\nIn the hood sense, we all good anyway\nThat's why you always hear another dollar, 'nother day\nI see the day as a new beginning\nMovement of the people, movement of the women\nTo get the Earth spinning in the right direct\nThis movie of life, sometimes might project\nActs, scenes that don't seem serene\nI light palo santo, put on Love Supreme\nAnd get into the being of the great I am\nThat's when I get to seeing just how great I am\nMany many times from mistakes, I ran\nBut I'm just a cake, let me bake, goddamn\nI pray I don't forsake my man\nAnd whenever I fall, on faith, I land\nImperfections, resurrections\nIn the mirror staring at God's reflection\nReflecting on my aggressions\nOn my progressions, on my obsessions\nThere's a lesson in not feeling less\nAnd in seeing life itself as a blessing\n\n[Chorus: Samora Pinderhughes]\nWhen we wash all our pain away\nWe say, \"Oh, my Lord\"\nWhen we can't make it through the day\nWe pray, oh, my Lord\nIt's a test coming to my faith\nWe pray, oh, my Lord, mmh\nWill my people ever be safe?\nIn the land that takes us and breaks us, I can't be sure\n\n[Verse 2: Common]\nYeah\nThe jubilee of a newer me\nGiving my enemies something new to see\nMy community, they be fueling me\nIn the struggle of us, there's a unity\nThe moral universe stay schooling me\nWill the king of kings really rule in me?\nI'm an instrument, stay in tune with me\nThis orchestrated by Karriem, Samora, Boom, and me\nIf agape had a Cupid, she'd be shooting me\nThis rap here is fear's eulogy\nEscape rooms with glasses of wine\nJust another crutch for my brokenness\nA term that I got from my therapist\nAs a black man, I feel I should be sharin' this\nIn the hood they say we crazy and we derelicts\nBut we needed for our kids and our marriages\nThe old folks say we don't do that\nBut taking care of self is the new black\nUnconventional ways, unconditional ways\nMediation, mindfulness, it's just given to praise\nI'm in a phase, all I see is victory\nYou on that wave, then come and get with me\nI only want what's meant for me\nAnd say the things that's sent to me\nIn penitentiaries, I met the most enlightened\nFinding the losses, Heaven's excitement\nI write with a force of a kid that wanted to\nBe in The Source, but that changed, of course\nI maintained the sauce and became a boss\nI apologize if I came across\nAs judgmental, or self-righteous\n'Cause in you, I see his likeness\n\n[Chorus: Samora Pinderhughes]\nWhen we wash all our pain away\nWe say, \"Oh, my Lord\"\nWhen we can't make it through the day\nWe pray, oh, my Lord\nIt's a test coming to my faith\nWe pray, oh, my Lord, mmh\nWill my people ever be safe?\nIn the land that takes us and breaks us, I can't be sure", "image": "https://images.genius.com/edcca611de8a88a9ff0e0173cc02f5a7.1000x1000x1.png"}], "artist": "Common"}