{"songs": [{"title": "This Is Murder, Not Music (Official Remix)", "album": null, "year": "2014-01-31", "lyrics": "[Verse 1: 50 cent]\nI'm on a hard bench, tryna' sleep in a holding pen\nMan, how the fuck did I get here again?\nFirst thing in a morning, it‘s the fuck shit\nThey called the case, I got confronted by a tough snitch\nHe told me do it, 1 click, you ain't tell me to do it\nYou ain't a shooter, you a shermhead, you fuckin' loser\nI fly a kite, my little man cut his sister up\nHe loves his bitch, you snatch her, he'll start switching up\nI'm cool, I just wait ‘til my next court date\nI bet he catch amnesia, then do this shit at leisure\nSurrounded by Bloods, Crips, Kings, and Ñetas\nGemstars open niggas up like barettas\nI'm tryna' be easy\nBut every now and then I gotta put it in, please believe me\nYou get to looking at me strange, I'm prepared Jack\nA buck fifty, keep the change you can wear that\n\n\n[Hook x2]\nThis is murder this is not music\nI had your style 10 years ago\nI just didn't use it\nYou niggas forgot how I do it\nWell I do it like there' nothin' to it\n\n[Verse 2: Young Buck]\nSame night from the Vibe awards\nStill with me looking for some new spinal cords\nFuck your life and see the mind of yours\nConcrete floors, I still feel like I'm behind them doors\nI want war\nI'm Read up for Teed up\nI'm getting fast money but I need to speed up\nThese Niggas kicking their feet up, just smoking their weed up\nWell Ima creep up with my heat up and make em freeze up\nHold up Buck, ease up\nPut some bodies in a box from Maserati fox\nNew York when I get there I need to hear a lot of shots\nA couple chickens on a video vixen,send her on a mission and one cent better not be missing\nI don't listen, I'm hard headed\nJust one but you all get it my niggers all breaded its crum' just to beat the case\nI see death when I see your face\nAnd even at this pace ima still lead the race\nThis Buck\n\n[Hook x2]\nThis is murder this is not music\nI had the style 10 years ago\nI just didn't use it\nYou niggas forgot how I do it\nWell I do it like there' nothin' to it\n\n[Verse 3: YobyDren]\nThis is Music, This is not Murder\nIm Cookin' crack up on the track just so i can serve yah\nIm YobyDren from DeadSea the Cliq you Probably heard of\nPut any beat in front of me and i'll Murder\nWith my Microphone as my Desert Eagle\nThis shit should Just be Illegal\nHaters talk..Can't hear Em' Voice is Smaller than ah Beetle\nLayin' bars Sharper than some Hollow Tips\nMy words My Ammo excuse me while i load this Clip\nWhen my lyrics hit your heart it tears your mind apart\nThis ain't Bullshit Rap homie im speakin Art\nThis music shit im very passionate, this shit is not an accident\nIm drawn to this Hip-Hop Game just like ah Magnet\nYou gotta have ah Open Mind so yall can feel my rhymes\nYou don't have ah Open Mind then im just waistin My Time\nThis Is Hip-Hop Dpn't You Disrespect It\nOr We'll Leave your life lookin like the inside of An Unbought Casket Bitch\n\n[Hook x2]\nThis is murder this is not music\nI had the style 10 years ago\nI just didn't use it\nYou niggas forgot how I do it\nWell I do it like there' nothin' to it\n\n[Outro]\nYeah, all I'mma do is this. I'mma keep countin' money\nI don't give a fuck if it make you sick to see a nigga win\nI'mma make you watch me win over and over again\nYou already know what it is with me motherfucker\nThis shit, goddamn it, you motherfuckers is making me lose count man\nGotta start this shit over, I'm licking my fingers\nI'm gettin'... I got 100 d-dollar bills, for real nigga\nAll I'mma do is this man\nYou hear that sound in the background?\nI'mma do this shit till my thumb get tired\nI'mma take a break when I get past your momma house nigga\nWhen I count more than your momma house\nI'mma take a break. Go get a new stack\nHand me that money over there\nWhat we gon' do? All year long\nIt's back to 50, you already know\nGet the money, and shut the fuck up\nWatch me do what I'm doin', cause niggas can't stop nothin' that I'm doin'\nRight after you get in the way\nWe gon' start shooting again like it's nothing changed\nWe went through that whole\n\"Kumbaya my lord - let's be friends by the fire\"\nIt's over nigga\nBack to the script, you know how this shit go\nHow much is that? Oooh, if you could see me right now\nI got a alligator on nigga!\nYou, you think it should go different? See that's where you go wrong\nWhen you think... Who the fuck asked you to think nigga!?\nNow you stick to writing comments and tweeting\nAnd your hashtags and...\nYou know what the fuck you do nigga\nLet me do what I do", "image": "https://images.genius.com/3ac0369e9af7e95b4d1574832fafebfe.430x430x1.jpg"}], "artist": "50 Cent"}