{"songs": [{"title": "Sadness", "album": null, "year": null, "lyrics": "[Intro]\nWe're laying in bed\nI lock eyes, our eyes lock\n\n[Chorus]\nOur eyes locked, you can see the sadness\nMy heart stops, every time you call my name\nMy jaw drops, you fell from the stars and I'm starstruck\nYou fell from the stars, girl, am I lost?\nWe’re down, we’re sad, is it my fault?\nI apologize for all of the lies, oh\nI won't, treat you like the rest of those guys, oh\n\n[Verse 1]\nI'm of the percs, you don't condone it\nYou say it makes me act atrocious\nBut I can't stand life when I'm sober, take my heart, I'll hand it over\n6 months in it gets colder, I don't want us to be over\nLet's make love until we die, and let's fuck til we slumpt over\nBe my first date, I know you hate to see my bleed\nI don't deserve your love, I tend to fuck up everything\nIt feels like I'm not enough, 'nough, 'nough, 'nough\nThis a conversation, not a love song\n\n[Chorus]\nOur eyes locked, you can see the sadness\nMy heart stops, every time you call my name\nMy jaw drops, you fell from the stars and I'm starstruck\nYou fell from the stars, girl, am I lost?\nWe're down, we’re sad, is it my fault?\nI apologize for all of the lies, oh\nI won't, treat you like the rest of those guys, oh\n\n[Verse 2]\nI wanna know, is it gonna be forever or temporary?\nIf you leave it’ll hurt, keep the tissue ready\nGot the drugs on the table, I’m ready\nPut Rick on your slippers, no Cinderella\nRemember when you went to the fortune teller\nShe told you we need each other\nHa, what if she’s trippin'? I'm just kidding\nBack to the main focus, I think that you’re gorgeous\nYou love the way that I stroke it, signing my name on your neck\nYou use to make potions, play around with witchcraft\nI wonder if you put that in my lean and I drank that\n\n[Chorus]\nOur eyes locked, you can see the sadness\nMy heart stops, every time you call my name\nMy jaw drops, you fell from the stars and I'm starstruck\nYou fell from the stars, girl, am I lost?\nWe’re down, we’re sad, is it my fault?\nI apologize for all of the lies, oh\nI won’t, treat you like the rest of those guys, oh\n\n[Bridge]\nWe met in a Twilight Zone\nI fall apart, but you keep me whole\nWe met on the West Coast\nBut i still see Miami in your soul\n\n[Chorus]\nOur eyes locked, you can see the sadness\nMy heart stops, every time you call my name\nMy jaw drops, you fell from the stars and I'm starstruck\nYou fell from the stars, girl, am I lost?\nWe’re down, we're sad, is it my fault?\nI apologize for all of the lies, oh\nI won’t, treat you like the rest of those guys, oh", "image": "https://images.genius.com/1ff8ab8d3ae5bb47f0797a87d42ddf66.1000x1000x1.jpg"}], "artist": "Juice WRLD"}