{"songs": [{"title": "RED LIGHT", "album": "BEASTMODE 2", "year": "2018-07-06", "lyrics": "[Intro]\nYeah, nigga, this shit real out here\nRunnin' through the red light, lookin' through your rearview\nNigga might just sneak up on the car and try to spray you\nPlayin' for keeps out here in the A\nIt's been a long time comin'\n\n[Chorus]\nAw, they ain't think I'm gettin' my bag, ayy\nRan it up and gave 'em a sad face\nNow anywhere around the globe\nYou rep the gang and you got rank, yeah\nGotta converse with the manager\nWhen I walk inside the bank, yeah\nWho would ever think they was sleepin' on me?\nGoyard with a half a million on me\nR&D's, it's like I'm possessed\nAll these diamonds on my chest\n\n[Verse]\nSleepin' on the floor had made my heart colder\nThey try to make it hard for me, I never falter\nGotta say I'm good, I'm on the ESPY's\nI made millions by the day, check my chest piece\nTry to take care of my family the best I know how\nBought myself a mansion, now I gotta buy everybody a house\nTakin' care of my bitches like the mother of my child\nGod know all my brothers sin, I gotta blow this trial\nYou don't get no guidance out the trenches to make it out\nGod knows I'll never give up on you, never will\nShit gettin' hectic with the niggas that ya kill for\nMoney got me hesitant, what I got to live for?\nAll this fame gettin' terrible\nAll these rings and Berettas\nFlawless victory, change the weather\nHurricane, natural disaster\nPour the lean for the bastards\nTake the jet across the atlas\nGod I pray I forget my dada\n'Cause I didn't grow up to be average\nAll the times he lied to me, ya gave up on my arteries\nI was such a worried child, just wanted you to be a part of me\nFishscale projects made a man out me\nSleepin' on the carpet made a man out me\nFull of medication, I wouldn't change it\nI was once broke but no complainin'\nI finally start to embrace that I'm famous\nIt's hard for me to erase when I was nameless\n\n[Chorus]\nAw, they ain't think I'm gettin' my bag, ayy\nRan it up and gave 'em a sad face\nNow anywhere around the globe\nYou rep the gang and you got rank, yeah\nGotta converse with the manager\nWhen I walk inside the bank, yeah\nWho would ever think they was sleepin' on me?\nGoyard with a half a million on me\nR&D's, it's like I'm possessed\nAll these diamonds on my chest\n\n[Bridge]\nAwww, oh\nAwww, oh\nAwww, oh\nAwww\n\n[Refrain]\nRunnin' through the red light, peekin' through the rearview\nNiggas might just run up on the car and try to spray you\n\n[Chorus]\nAw, they ain't think I'm gettin' my bag, ayy\nRan it up and gave 'em a sad face\nWho would ever think they'd ever sleep on me?\nWho would ever?\nWho would ever think they'd sneak diss me?\nWho would ever?\nAh, these bitches are possessed\nBy these VVS' glarin' off my chest\n\n[Outro]\nAwww, oh\nAwww", "image": "https://images.genius.com/03d2f368df8cc76f69be0bd417210a30.1000x1000x1.jpg"}], "artist": "Future"}