{"songs": [{"title": "Flashing Lights (Clipse Remix)", "album": null, "year": null, "lyrics": "[Intro]\nWe got the remix\nIt's another hot exclusive from the dominators\n\n[Hook: Connie Mitchell + Dwele]\nFlashing lights, lights\nFlashing lights, lights\nFlashing lights, lights\nWhat do I know?\nFlashing lights, lights\nKnow\n\n[Verse 1: Pusha T]\nPharmaceuticals bought me charm like the jeweler jewels\nSquares of ice shed light like the Rubix cube\nI get it mixed up, red with the blues\nAnd she all mixed up, admirin' the hues\nFour years later, niggas admirin' your shoes\nBape year late, we call you Tokyo buffoons\n'Cause stylists admire us, look at how you groom\nKeep runnin' to SoHo, them exclusives in my room\nNiggas is biters, we let you slide with your writings\nWe knew that cocaine talk was not like you\nBut who goes as far as tryin' to dress like him?\nOne sequin glove can never make you Michael\nI moonwalk over tracks and make niggas spiteful\nBut never hear a word 'cause them niggas know\nThat my flow so viper and if Pusha go psycho\nHe'll seance that pen and pull your spirit up out yah, P\n\n[Verse 2: No Malice]\nI'm so literary with it, you can tell how I write\nThe boy such an author, I should smoke a pipe\nRockin' an ascot, the coupe with a glass top\n17 inch rims makin' the ass drop\nI was in the spot from the first to the fifth\nWith a mean comeback like The Return of the Sith\nLike ridin' a bike, never you forget\nStill I got it for cheap, whether you smoke or you sniff\nThe gift is the curse and vice versa\nTo remove me off that horse takes more than a merger\nDurin' that hiatus I was with the natives\nThen back to the States, pass along the savings\nPut it in the street, caterin' the cravings\nLike the second-comin', got the fans awaitin'\nVictory is sweet, even amongst the hatin'\nFind me on that beach, island in the Caymans, gone\n\n[Hook: Dwele + Connie Mitchell]\nAs you recall, you know I love to show off\nBut you never thought that I would take it this far\nWhat do you know?\nFlashing lights, lights\nWhat do you know?\nFlashing lights, lights\nKnow...\nFlashing lights, lights\nFlashing lights, lights\n\n[Outro: DJ Drama]\nWhat up, you know who it is, it's the one and only Mr. Thanksgiving a.k.a. Mr. Gangsta Grillz himself, DJ Drama. And right now you're locked into Benzy's Get Right Radio. Pay attention!", "image": "https://images.genius.com/6384fde66cbab951fb872c21f4a480af.600x597x1.jpg"}], "artist": "Kanye West"}