{"songs": [{"title": "We Could Take It Outside", "album": "When Disaster Strikes...", "year": "1997-09-16", "lyrics": "[Intro: Rampage (Baby Sham)]\nThat's that joint (You know that ain't doin it again)\nUh, do it! Do it!\n\n[Verse 1: Rampage]\nI'm a Natural Born Killa that's Born to Rise\nFlipmode is da Squad so it's no surprise\nNiggas want to advertise about how we get down\nYou fuck around: leave your body in the lost and found\nHow you like me now?\nWe got the industry on lock\nThe world is on shock\nI'm a take a piece of the rock\nYo, you feel it in the heart when we took you to the park\nMidnight after dark, I'm the raider of the lost ark (ark echo's)\n\n[Verse 2: Serious]\nNow na na na na na na, na na nah\nSuper size, super size, right before your eyes\nI bring in treats like giant sweet potato pies\nWise, sword shift and I spit on flies\nKilling all the tips from studio spies\nHead to bed, beddie bye, beddie bye\nDon't ask why. Why? What do you ask as a reply?\nFlipmode's the Squad don't rest, don't try\nPeace to my people in the friendly sky\nPeace to my outer space ties\n\n[Verse 3: Spliff Star]\nI'm in leather like the ladies\nBigger than crack in the 80's {​​​*echoes*}​​​\nDrive the buggy I Mercedes\nBlow up like C-4\nGot so much to live for\nCan't play the game no more\nPick up the cain no more\nBrothers ain't the same no more\nTry to sweat me, what am I aiming for\nGet yourself caught up\nFaggot ass tore up\nIn the worst way, the only way you can stop me\nIs cock your Glock and shot me\nDrop me, pop me, make sure you that you got me\nCause anyhow I live I'm comin back for you poppy\n\n[Chorus: Busta Rhymes]\nWhat y'all niggas wanna do?\n(Yo we can take it outside)\nYa'll niggas want something?\n(Yo we can take it outside)\nWhat y'all niggas wanna do?\n(Yo we can take it outside)\nYa'll niggas want something?\n(Yo we can take it outside)\n\n[Verse 4: Baby Sham]\nPush up in the hot rod, alley cats a rah rah\nAll my flipmode in the backseats with chrome nines\nI'm here to bust mine\nNigga fragile let his brain fry\nPretty boy sliced up feel the contact from this red eye\nYou failed to realize when you macks me you drop the plastic\nRun up in your crib and snatch the heemis from the mattress\nMy crew expanded, QB is where we landed\nYellow strip you crossed it\nNow I'm forcing you to drink this Sham's potion\nShow me were loaded\nThe desert eagle hear it cockin'\nLovin my doggies\nWhile we shinin' continue flossin\n\n[Break: Busta Rhymes & (Lord Have Mercy)]\n(Flipmode, Flipmode) Killa kids\nFlipmode we are, 'mode we are..\n\n[Verse 5: Rah Digga]\nFuck steppin on toes I crush the whole shoe\nPronto like Cru till I'm Triumphant like Wu\nThe shit you talkin crazy like niggas turnin in their hand guns\nI be burnin MC's like Betty's grandson\nSmokin grey poupon boy\nTwo lines, I chew rhymes and make niggas fold like they was futons\nRah Digga, all day Outsidaz, this Squad be Flipmode\nWe get our dick rode a whole shitload\n\n[Chorus: Busta Rhymes]\nWhat y'all niggas wanna do?\n(Yo we can take it outside)\nYa'll niggas want something?\n(Yo we can take it outside)\nWhat y'all niggas wanna do?\n(Yo we can take it outside)\nYa'll niggas want something?\n(Yo we can take it outside)\n\n[Verse 6: Lord Have Mercy]\nWe the official g-u-rilla to lead militias\nThat pillage, americana\nSpit sentences like, venomous iguanas\nReminisce the promise\nBring drama like Nicaragua\nFatigues march, army leaders, they count crooked drug dollars\nAnd sip fresh squeezed milk from the titties of llamas\nLeave cities in carnage\nPretty as farmers that pour whiskey at harvest and hold 16 bananas\nMaintain, maintain, maintain\nI reign like Mussolini's iron fists\nTry on this, you can't see me like vagina lips\nSmugglin diamond chips, bubblin anonymous\nThe dominant will resource and count on script crews and world wars\n\n[Verse 7: Busta Rhymes]\nYo, you better practice what you preach\nI got 7 MC's at 10 G's a show each\nNever interfere and shit, souvenirs for your ears and shit\nClear poetry like William Shakespeare and shit\nWord is bond checkin me out\nHey what you talkin about\nYou lost and you walkin about\nNiggas got beef they really want to chill and start talkin it out\nHey, oh my god, y'all nigga be buggin me out\nWish they could lay me down and have the police start chalkin me out\nNow I zoom in on you and my niggas start stalkin you out\nShut down on bullshit you total recallin' about\nThis one's for my people and my niggas up North\nThe rulership dynasty of Flipmode finally come forth\nExports and imports hittin you with flavors of all sorts\nMy squad comin through, chop off your ear\n\n[Chorus: Busta Rhymes]\nWhat y'all niggas wanna do?\n(Yo we can take it outside)\nYa'll niggas want something?\n(Yo we can take it outside)\nWhat y'all niggas wanna do?\n(Yo we can take it outside)\nYa'll niggas want something?\n(Yo we can take it outside)\nWhat y'all niggas wanna do?\n(Yo we can take it outside)\nYa'll niggas want something?\n(Yo we can take it outside)\nWhat y'all niggas wanna do?\n(Yo we can take it outside)\nYa'll niggas want something?\n(Yo we can take it outside)", "image": "https://images.genius.com/c81a637e4015a2a4f63a6790ebd3ee6f.1000x1000x1.png"}], "artist": "Busta Rhymes"}