{"songs": [{"title": "Layers (The Bar Exam 4)", "album": "The Bar Exam 4", "year": "2017-06-20", "lyrics": "[Intro: Rick Ross sample]\nSometimes I be wanting to say \"fuck the world\"\nI don't give a fuck\nShoot it out with all you bitches\nBitches don't love me\nYoung black nigga, nigga fighting a war nigga\nEverywhere you go bitches throwing rocks nigga\nMan a nigga in a Lamborghini\n\n[Verse 1]\nWhen I pick up a mic I feel like Lorenzo and Ice\nEazy-E, Dre, and Yella guess I'll be a nigga for life\n2Pac's soul hovers right over my board while I record\nPatron enters my blood then it comes right out my pores\nSome of these rappers spazz, some of them choose to serenade\nSome of them need their swag\nSome gon' breathe their last air today\nSome believe that hip-hop police is working with these\nVarious media outlets even pay Vlad to interrogate\nI remember back when I was blacking out without beats\nHoping for better days to focus how I'm gon' meditate\nSeem like everywhere I go, somebody approaches me going\n\"Cole is platinum without features!\" Well, so is Kevin Gates\nActing like you can't be a fan of both, your standards low\nMy flow luxurious like chinchilla mats on the Phantom floor\nI vow to kill the style that you love and write it to keep me poise\nCome at me fly, turn your album cover to the Beastie Boys\n\n[Interlude 1]\nI was telling my brother how you rappers are the new leaders. You're the real leaders of the people. The rapper doesn't think he's a leader, but he's got followers all over the world. The biggest preachers don't have as many followers as one rapper\n\n[Verse 2]\nI represent war, pain, destroyed fame, contort cane\nChess playing rather than board games\nSavages saddling up, grabbing the horse range\nDragging emcees traveling eating like Bourdain\nThe congregation asking me how I be preaching so accurately\nI answer it's actually easy, I'm ordained\nThe name is Luther Campbell, you can call me Luke though\nStanding for what I'm saying like Farrakhan on Donahue's show\nNow they trying to find a loop hole\nThe silence my words, the knowledge I speak\nIs a reflection of the violence I see\nNow the perception's your daughters and nephews idolize me\nNow the objective is call me highly aggressive instead of just successful\nCause my rhetoric highly suggestive\nProbably connecting cause it's honest, refreshing\nOnly way I'm trying express it\nDown to die tonight\nGrabbing his gun and shit like a young Malcolm\nThat'll get me capital punishment like the Pun album\n\n[Interlude 2]\nSo is the question now how can we get you to rap where intelligence is coming through the lyrics with a beat that begins to open the minds of people. Our people want better. And they'll do better if they're shown better", "image": "https://images.genius.com/2627cc5445030d64606928667383564b.800x800x1.jpg"}], "artist": "Royce da 5'9'’"}