{"songs": [{"title": "Thicky Thick Girl", "album": "Country Grammar", "year": "2000-06-27", "lyrics": "[Chorus: Nelly]\nSee now you could be a lady or a bitch, girl\nStill, you're thicky thicky thicky thick\nLookin' like a lolli-pop waitin' for the lick, girl\nYou're thicky thicky thicky thick\nRemind me of my 6-4 waitin' at the switch, girl\nYou're thicky thicky thicky thick\nCould be a crime that I'm waiting to commit, girl?\nYou're thicky thicky thicky thick\n\n[Verse 1: Murphy Lee]\nSo basically I'm a joke right?\nLook me in the eyes and tell me if you don't lie\nWhen I use that, shoes untied before you know it, method:\nFirst step we getting naked, pants gone in 20 seconds\nIt's gettin' hectic, wreck it just like a hooptie with insurance\nBut it seems I'm behind schedule with broad troubles twistin' and pullin'\nI'm like shorty help me (come on)\nHelp me (please) don't blow my high, cause I'm too horny\nShe giggles and gives a horny smile...\nSo I take advantage\nKisses in gentle places tryin' to get myself established\nI'm comfortable, wanna be in that moe with no control\nConcentrating on my every lick her every blow\nYep, I'm still blowed, but cooler than two below\nAnd how I got that rubber on, her ass'll never know\nIT'S ON, put my penis in accurate, just relax a bit\nNow it's my time to party like the lunatics at an after-set\n\n[Chorus: Nelly]\nSee now you could be a lady or a bitch, girl\nStill, you're thicky thicky thicky thick\nLookin' like a lolli-pop waitin' for the lick, girl\nYou're thicky thicky thicky thick\nRemind me of my 6-4 waitin' at the switch, girl\nYou're thicky thicky thicky thick\nCould be a crime that I'm waiting to commit, girl?\nYou're thicky thicky thicky thick\n\n[Verse 2: Ali]\nNow I comes first like the front porch, in a Polo Sport shirt\nSkirts, there they are, gots to flirt cause I'm far\nFrom Average Lame with that \"What's your name?\" game\nI'm stormin' on your brain like a surgeon in the rain\nTake the fame if you can, watch me wrap like Saran\nAll up in these sheets, now you on me like a tan\nLeavin me like a van in reverse, that's the worse\nPlaya curse put up on me now, we spreadin' on my homies\nLike a germ, watch me turn into captain kill a ho\nFill a ho strong watch me last long like a penny broke\nMany motels I got a rich coupon\nI'm doing dismounts on futons, comin' out like Keyuan\nI'm ill like ceramic in a hammock, goddamit\nThat's my words, ooh's and aah's slurred like a verb\nShowin' action like an ass like a metaphor\nNow I'm headed for the highways selling me by's sideways\n\n[Chorus: Nelly]\nSee now you could be a lady or a bitch, girl\nStill, you're thicky thicky thicky thick\nLookin' like a lolli-pop waitin' for the lick, girl\nYou're thicky thicky thicky thick\nRemind me of my 6-4 waitin' at the switch, girl\nYou're thicky thicky thicky thick\nCould be a crime that I'm waiting to commit, girl?\nYou're thicky thicky thicky thick\n\n[Verse 3: Nelly]\nI spit mo' shit off into they ears than dialtones and telephones\nJust to get their ass back home\nCome watch the Bed-rock like Flintstones\nBut son too strong, so I smoke a sack as fat as Santa (y'know)\nDrive me nuts like Planters, hawkin' a nigga like offalana (swish)\nI ban ya from the smoke house, trick, who you think you fuckin with?\nTrying to play me like Jim Carrey and pull some dumber and dumber shit\nStomp me like a step show (grab hold) then I let go\n(Flows) split that ass like g-strings up on these rat hoes\nI pose as a threat, to hit any one of you niggas rattin'\nSpit some game and get a bird, come watch us tag team like free bird\nSay the word, I be at rest with all my partners\nStraight loungin' with a pocket full of rubbers and have it bouncin'\nGo make the announcement, spark more Dynamite than \"Good Times\"\nWant both girls like prime time, want real highs and thick thighs\nTake pride in my stabbin', headboards you be grabbin'\nGot 'em bangin' the walls so hard the neighbors callin'\n\n[Chorus: Nelly]\nAsking you, \"What happened? What's goin' on over there even?\nSounds like you guys are goin' crazy\"\nSee now you could be a lady or a bitch, girl\nStill, you're thicky thicky thicky thick\nLookin' like a lolli-pop waitin' for the lick, girl\nYou're thicky thicky thicky thick\nRemind me of my 6-4 waitin' at the switch, girl\nYou're thicky thicky thicky thick\nCould be a crime that I'm waiting to commit, girl?\nYou're thicky thicky thicky thick\nSee now you could be a lady or a bitch, girl\nStill, you're thicky thicky thicky thick\nLookin' like a lolli-pop waitin' for the lick, girl\nYou're thicky thicky thicky thick\nRemind me of my 6-4 waitin' at the switch, girl\nYou're thicky thicky thicky thick\nCould be a crime that I'm waiting to commit, girl?\nYou're thicky thicky thicky thick\nSee now you could be a lady or a bitch, girl\nStill, you're thicky thicky thicky thick\nLookin' like a lolli-pop waitin' for the lick, girl\nYou're thicky thicky thicky thick\nRemind me of my 6-4 waitin' at the switch, girl\nYou're thicky thicky thicky thick", "image": "https://images.genius.com/7380d9314a012fbb969df4eb6d7ec650.1000x1000x1.jpg"}], "artist": "Nelly"}