{"songs": [{"title": "Dat Bitch", "album": "Malpractice", "year": "2001-05-22", "lyrics": "Yo.. (Fuck that nigga, look at her toes)\nYo! (You know you like toes nigga)\nBitches be talkin too much out here (God DAMN mami, you the one!)\n.. Dat bitch, dat bitch (Nigga that's that bitch right there)\n.. Dat bitch, dat bitch\n.. Dat bitch, dat bitch, dat bitch (Always poppin off at the mouth)\n.. Dat bitch, dat bitch\nTurn it up some! Turn my voice up some\nThat BITCH!\n.. Dat bitch (Where the fuck you at?)\n.. Dat bitch, dat bitch, dat bitch\nFunk Doctor Spock (Where she at yo?)\n.. Dat bitch, dat bitch, dat bitch (There she go, there she go yo)\n(Nigga there she go) Over there that bitch (Nigga there she go)\n(Nigga here we go..)\n\nYo, dat bitch - the one that'll shut her mouth\nDon't give a fuck if not my album out\nDat bitch, that'll hustle too\nPull out the baby .380 ask, \"Who the fuck are you?\"\nDat bitch - that'll go out like +Army Men+\nDat bitch - wrappin her hair in Barbie pins\nWhen the pressure's on, you'll find a bomb in your car\nIn your trunk on the road to Arlington\nYo, dat bitch - the one that'll take control\nBrought me a 2-way when my pager broke\nDat bitch - that'll love to fuck, take it in the butt\nWhen the Doc comes, she won't wipe it up\nDat bitch - that'll whip a car better than me\nYo, dat bitch - splittin cigars better than me\nDat bitch - tattooes on her back and arm\nAnd you see my name when the track is on\nDat bitch - that'll jump out dolo\nWith her toes in a pump with a shotgun pump out\nDat bitch - that'll roll proper, two phones\nOne for tricks and one for callin the Doctor\nDat bitch - that'll give me brain when I'm thinkin\nDat bitch - that's makin me more insane than a ink pen\nDat bitch - that ain't scared to whup her kids\nKnow to bail Doc out when my ass in the precinct\n\n[Hook: repeat 2X]\nDat bitch, the one that'll shut her mouth\nThat'll keep it on the low what I'm all about\nDat bitch, when I'm on the run, she give me a gun\n* 1 - Hide me out at her father's house\n* 2 - Hide me out at her momma's house\nDat bitch, that'll give me brain when I'm thinkin\nDat bitch, that's makin me more insane than a ink pen\nDat bitch, Doc need a real bitch for this\nGo-rilla, rilla, rilla, rilla\n\n[Missy Elliott]\nI'm dat beatch, B-I, T, C-H\nWon't fuck a nigga until it's payday\nMake him think I'm in love, oooh baby\nFuck witcha nigga, makin motherfuckers hate me\nDat beatch - I'm in the classified\nDat beatch - make a nigga go and buy me a ride\nDo you know who, I be?\nI'm the M-I crooked, letter Y nigga\nBad to the Bizzy Bone\nQuick bitch talk shit night long\nI run shit, done done shit\nPop a gun shit, slap a bum bitch\nDat beatch - yo you heard it first from me\nDat beatch - ain't nuttin but the same O.G\nDat beatch - I'm, rollin and strokin\nAnd jokin and workin I'm\n\n[Hook]\n\n[Missy Elliott]\nHeyyyyy, you're the only one for me\nYeahhhh-ahhh-ehhhhhh\nReggie Noble.. keep it gangsta.. eh-hehh, mmmm\nShe's the one, she's the one, only one\nHeyy-eyyy, lives her life, pays the price\nWhen she keeps it gangsta, yeahhh-hahhh\nOhhhhh, yeahhhhahhhh.. {*fades out*}\n\nW... K... Y... A", "image": "https://images.genius.com/109a9fb9c91fad29c7f632fb053de1bf.1000x1000x1.jpg"}], "artist": "Redman"}