{"songs": [{"title": "I’m Illy", "album": "Paper Trail", "year": "2008-09-29", "lyrics": "[Verse 1]\nRebel for the hell of it, hella rich\nNever have to sell a brick again, must I tell a bitch again?\nThe bullshit I'm addressin', check, I'm on some next level shit\nNever been fucked in the game; I'm celibate\nRarely out my element, barely out the ghetto, with\nOne foot out and one foot in, intelligent as fellas get\nListen, let's settle this: be clear, I could fall back\nSeven years, still it ain't no one ahead of me\nConsider it a blessin' if you get to stand next to me\nFive-star general, OG veteran\nCaked like Entenmann's, blowin' that celery\nStack that cash like the U.S. Treasury\nEvery single thing I ever did was done heavily\nRap until you're 70, still ain't no catchin' me\nPut it on my pops, Big Phil, Aunt Beverly\nBe standin' on the top still after they bury me\nNose in the air, so stuck up, arrogant\nAin't got long hot songs, best cherish it\nCool, when I drop mine; that's over, finito\nYou payin' for your foul like a free throw: BAOW!\nNow, how could a nigga think that he could see me\nOther than the magazine covers or the TV?\nKnow I sold more mixtapes than your CD\nYou're waitin' on your big break, prayin' you could be me\nYou ain't made it far as D.C., on the low\nI been all around the globe, like a God how they treat me\nBroads hit they knees, eyes closed when they greet me\nMouth wide open, just beggin' me to skeet-skeet\nYou in a deep sleep, stop dreamin'\nI'm six albums in, for ten years, I been firing hot semen\nThe limelight's mine, I'm gleamin', beamin'\nAsk why I say I'm King, bitch, I got my reasons\n\n[Hook]\nWrist so frosty, neck so chilly (bing!)\nAll on my mind is to get more millies (what?)\nNiggas talk shit, that's silly (HA!)\nShawty, he ain't about that really? (nah) Is he?\nNigga, I'm illy! Haha, haha, haha, hey\nAye, I run this city, clearly (BANKHEAD!)\nTell 'em get lost, I'm busy, really? Nigga, I'm illy\n\n[Verse 2]\nWhere niggas get off? Piss off!\nMe and mine ought to take time to pop a lid off\nShit, all over the whereabouts of me, is y'all\nSick in your fuckin' mind? You figuring I'ma fizzle\nNever cooled off, Tip scorchin'\nMinimal injury, though they wishing me maximum misfortune\nNumber one, hands down, flows paint portraits\nEverybody thinks you stink like horse shit\nHouse full of chicks on some Girl Next Door shit\nA king of oneself,  30 mil' out the store quick\nOf course, this case, lost all my endorsements\nTripled up on real estate, still buyin' more shit\nBut Tip bankrupt, according to your sources\nI'm still caked up along with more reinforcements\nTore shit up from the lobby to the rooftops\nOfficially: the hottest nigga rappin' since 2Pac\n'Fore you rap 'bout me, best ask 'bout me\nI'm out my fuckin' mind, need counselin'\nPlease don't doubt me, trust me, drama ain't nothin'\nIt's all fun and games 'til somebody start bustin'\n'Member my discussion when rappers be battlin'\nI find out about it, better get to skedaddlin'\nPack your family bags, move 'em out to Seattle and\nWe ever cross paths, you'll need ambulance and bandages\nLive life glamorous, so extravagant\nMandarin Oriental, worldwide travellin'\nHip-hop champion, for real though\nYou couldn't fuck with me with a Brazil ho, nigga, but still though\n\n[Hook]\nWrist so frosty, neck so chilly (bing!)\nAll on my mind is to get more millies (what?)\nNiggas talk shit, that's silly (HA!)\nShawty, he ain't about that really? (nah) Is he?\nNigga, I'm illy! Haha, haha, haha, hey\nAye, I run this city, clearly (BANKHEAD!)\nTell 'em get lost, I'm busy, really? Nigga, I'm illy\n\n[Outro]\nHahaha, HEY!\nAye, just remember I do this shit when I want to, nigga\nIt's me, nigga! (Zone One, homie!) Yeah, yeah\nI don't wanna hear shit 'bout I can't rap like this\nWhen I ain't did it that way, nigga, fuck you, partner!\nYeahhhhh\nIt's the King, bitch!", "image": "https://images.genius.com/36ee9bdc8b9095a8e2d3fed2cc9bdb4d.1000x1000x1.jpg"}], "artist": "T.I."}