{"songs": [{"title": "U Ain’t Slime Enough", "album": "Slime Language", "year": "2018-08-17", "lyrics": "[Chorus: Young Thug]\nI slime you out, so I have you on this wing jet\nI slime you out, and split it with the team, yeah\nI slime you out, we pull up with the sting, yeah\nI slime you out, they caught it with a machine, yeah\nI slime you out, I slime you motherfuckers out\nI slime you out, we comin' burnin' up your house\nI slime you out, you can see it in my eyes\n(Yeah, yeah, yeah, yeah, yeah, yeah)\n\n[Verse 1: Karlae & Young Thug]\nOutside lookin' in, there is no comparison (mh-mhm)\nYou put them bitches in a line and I'll embarrass them (mhm)\nMagnificently written, all this shit that I be kickin' (mhm)\nAin't no queens of the jungle, really all these bitches kittens (meow)\nWho they kiddin', they be smitten\nTell 'em bye and then good riddance (good riddance!)\nAnd they freestyles by? I can tell that shit good written (Slime, slatt slatt!)\nExcuse me!\nSee we different, everybody out here braggin' 'bout their dough\nBut when it's time to spend that money, where that bread go? (mhm)\nI beat that shit like congo, I pass hoes Rondo (slatt)\nIf I go inside that Louis purse, run hoe\nRousey I kick shit, with thousands money pilin' up (slatt slatt slatt slatt)\nY'all be on that internet, but money is not dialin' up (slatt slatt slatt slatt)\nYour wild dreams ain't wild enough, so what you come at me for? (slatt slatt slatt slatt)\nI'll invade your lane, I suggest you take a detour (woo, woo!)\nAnd please check the decor, and y'all drinkin', we pour (Hey! Hey!)\nNever say that we poor, y'all can act an ass\nBitch, I'm goin' Eeyore, is it just me or... these hoes need to level up? (Level up, bitch!)\nJust bought a green Birkin, call her 7-Up (slimey!)\nYour reel isn't real enough, so tell me what you fishin' for\n\n[Refrain: Karlae & Young Thug]\nYeah, yeah these bitches ain't slime enough (mhm)\nYeah (slatt slatt) yeah these niggas not slime enough (slimey)\nYeah (slatt slatt) yeah these bitches ain't slime enough (mhm)\nYeah (slatt slatt) yeah these niggas not slime enough (slimey)\n\n[Chorus: Young Thug]\nI slime you out, so I have you on this wing jet\nI slime you out, and split it with the team, yeah\nI slime you out, we pull up with the sting, yeah\nI slime you out, they caught it with a machine, yeah\nI slime you out, I slime you motherfuckers out\nI slime you out, we comin' burnin' up your house\nI slime you out, you can see it in my eyes\nYeah, yeah, yeah, yeah, yeah, yeah\n\n[Verse 2: Young Thug]\nI scream, \"Slime, slime, slime,\" they come in a rush (slatt slatt slatt)\nI got snakes tatted on me and my chains to my nuts  (slatt slatt slatt)\nI slimed out my grandma (slatt slatt slatt)\nDiamonds on my Cartiers, I see farther than Farrakhan (woo)\nI know niggas gettin' extorted, like the common cold (ooo, yeah)\nI done ate cereal out a plate, I done ate cereal out a bowl (ooo, yeah)\nNiggas ain't slimey enough, niggas ain't grimy enough (ooo, yeah)\nI got black diamonds like my grandpa snuff\nWay more money than you, ain't no sympathy, no (ooo, yeah)\nNiggas'll wipe your nose like you're sick, you know? (ooo, yeah)\nAll my niggas shoot first like a damn intro (ooo, yeah)\nI get boxes of dough, Kimbo\nYou a slimey motherfucker Karlae, tell 'em the truth  (slime x9)\nYou'll catch a body for me, motherfucker, tell 'em the truth (slime x9)\nAll of these thotties 'bout to think I'm super slimey for you (slime x9)\nBut you the hottest you lil motherfucka, that's my boo, yeah (slime x9)\n\n[Refrain: Karlae]\nYeah, yeah these bitches ain't slime enough (mhm)\nYeah, yeah these niggas not slime enough (slimey)\nYeah, yeah these bitches ain't slime enough (mhm)\nYeah, yeah these niggas not slime enough (slimey)\n\n[Verse 3: Duke]\nI'll slime you out (slime you out)\nAll these other bitches thirsty, they want clout (they want clout)\nDick in her mouth (dick in your mouth)\nI'm on her hip like a pouch (pouch)\nShe like when I'm beat her down (down)\nName ringin' bells in the town (brrt)\nI was just servin' them ounces (ounces)\nNow we poppin' them bottles\nWe all in the VIP and we standin' on couches (couches)\nSurrounded by nothin' but vultures (vultures)\nI gotta keep it in motion (motion)\nYou see me, you know that I'm totin' (totin')\nPlayin' 'bout none of my bros\nAnd if I see you, I'm wipin' your nose\n\n[Chorus: Young Thug]\nI slime you out, so I have you on this wing jet\nI slime you out, and split it with the team, yeah\nI slime you out, we pull up with the sting, yeah\nI slime you out, they caught it with a machine, yeah\nI slime you out, I slime you motherfuckers out\nI slime you out, we comin' burnin' up your house\nI slime you out, you can see it in my eyes\nYeah, yeah, yeah, yeah, yeah, yeah", "image": "https://images.genius.com/54b22adf2c79e1df9cb61a1db387ed4c.1000x1000x1.jpg"}], "artist": "Young Thug"}