{"songs": [{"title": "Wanna Be Me (Carrots)", "album": "Slime Season", "year": "2015-09-16", "lyrics": "[Intro]\nHey! (And what?)\nTell 'em they wan' be... (They wan' be...)\nI'ma flood the bitch and... be me they wan'\nWe got London on da Track\nThugger! Hey! (Woo!)\n\n[Chorus]\nPlease, tell 'em they wanna be me (Please, tell 'em)\nSomebody tell 'em they wan' be me (Tell 'em)\nOh, oh, tell lil' mama she wanna be me, hey (Wha, hey)\nI pulled up through, you wanna be me (She wanna be me)\nI tried to tell them they won't be me, nigga (Tell 'em they won't be)\nI had to tell them they won't be me (Tell 'em, tell 'em niggas)\nHey! (Skrt, yeah)\n\n[Post-Chorus]\nCity wanna... (Aight)\nCity know they can't be me (The whole bity)\nI'ma see them, no they can't be me, the city know they can't be me (The bity, bity, bity)\nNo they can't... (I swear, I swear, I swear)\n\n[Verse 1]\nI could be servin' it precise, ooh (Sheesh!)\nOh, she cook the Thugger corn and rice (Sheesh!)\nI fuck her fast, within the night (Ah cha!)\nI might pour a lot of pints, a lot of Sprite, a lot of ice (Racks)\nTwo cups stuffed, I need two cups stuffed (Dos)\nRan them bands up, bitch I'm eating, I'm getting bucks (Guap)\nClean a bitch face with the nut, fuck a Puff\nMuddy, muddy\n\n[Refrain 1]\nHey, Young Thugger savage, Thugger savage, Thugger savage\nI'm a savage, I'ma fuck her like a savage (Uh, uh)\nOoh, she left my building, and she fallin' down my steps\nThen she chase a nigga down like a rabbit (Woo, wha?)\nI’m stupid flooded with them karats (Wha?)\nI got some motherloving karats, what?\nI'm a karat (Sheesh, sheesh!)\n\n[Verse 2]\nI paid 150 for the karats in my chains and my rings (Bling!)\nWatches just change, got my ice from Johnny Dang (Blaw!)\nNo comparing your plain, I got mine from Avianne (Woo!)\nEven if you a lame, you bool if you stay in your lane (Stay in your lane)\nYou can feel my pain, and I don't need no T-Pain (No way)\nYou got so much pain that you don't need no T-Pain (No way)\nThugger Thugger pain they ain't gon' play with, no way (No way)\nI'm gon' bust his brain and mail his ass straight outta state (Swoo)\nI'ma pull up right in front your land and take your pint\nI'ma pull up on you, point a beam, ready to bake\nI'ma pull up tryna run for racks and take them digits (Racks, racks)\nI can't find the place, I'm pouring your children down the sink (Damn)\nGraw, graw, kow!\n\n[Refrain 2]\nBitch I'm a motherfucking savage, I'm a savage\nI'm a savage, I'm a motherfucking savage (On God)\nShe see them niggas blicky down and wanna fuck me\n'Cause she fuck with Thugger Thugger like a karat (Sheesh!)\nMy Maisons on her like a carriage, wait! (Huh)\nMy wheels taller than a Ferris, wait! (Brrr)\nGave her the karats (Bling!)\n\n[Verse 3]\nI'ma show her love, and she gon' fuck me like a king (Sheesh!)\nI'ma fuck her friend that said she fucked me in her dream (Sheesh!)\nI'ma make her nut, and, yes, I want that nut on me (Sheesh!)\nI'ma fuck 'em both, and, yes, they want that nut on we (Sheesh!)\nBrought that bitch on tour, they think I'm reppin' D.I.E\nI'ma catch your bitches, yes, she fucking on my team (Oh my!)\nI'ma catch your mama, she gon' fuck me and my team (Hey!)\nI'ma catch 'em both and they gon'... (Skeddit!)\nI'ma catch your bitch and sick her (Cha cha!)\nBitches wanna fuck a nigga, for real (Aye)\nBitches wanna fuck a nigga, for real, who? (Hahaha)\nGuess what? (Hey)\n\n[Bridge]\nI ain't gonna stop, I'ma fuck 'em, I'ma fuck 'em forever\nI ain't got stop, I'ma give 'em, throw up all the cheddar\nI'ma catch on these bitches, spray your bitch with the Beretta\nI'ma fuck on her sister, and she got her groove back like Stella (Damn!)\n\n[Interlude]\nOh my God (Woo!)\nOh, God! (Ahahaha)\nHah! (Ooh, ooh)\nKarat!\n\n[Outro]\nKarats in my watches, in my jewelry, in my chain (Ah)\nKarats on my bosses, twelve-hun' up in my thing (Oh)\nGoing in their mouth, and then we coming out the south (Ooh)\nI'ma fuck that bitch, and then I nutted in her clit ('Skeddit)\nI'ma cuff the bitch if she gon' fuck me in the kitchen", "image": "https://images.genius.com/e7c67a01f872ff7f8c60b34a636ec3f4.500x500x1.jpg"}], "artist": "Young Thug"}