{"songs": [{"title": "The Question (Live)", "album": "Live From Space", "year": "2013-12-17", "lyrics": "[Intro: Mac Miller]\nThis next song one of my favorite to perform its called The Question, alright\n\nSometimes I wonder who the fuck I am\nSometimes I wonder who the fuck I am\nSometimes I wonder\n\n[Verse 1: Mac Miller]\nSometimes I wonder who the fuck I am\nSo I've been lookin' in the mirror and it still don't make no sense\nI'm askin' what am I supposed to do?\nI've done so much in my short lifetime, but I haven't done shit\nI done flew around the whole world\nFirst I shook a million hands and I took a million pictures\nBut I'm a hostage in my own world\nAnd my thoughts my own enemy, got no time for these bitches\nI got too much on my damn mind\nSo if I add some more stress, I just don't see how I'm a cope\nI think they underestimate the grind\nI do, bring this dough, and I'm only 20 years old\nI wonder why I sip this devil juice\nCause it feel incredible, problems, I got several\nThank God that none of that medical\nUgh, I've been blessed with much to be expected\n\n[Hook: Mac Miller]\nWhat am I doing here?\nI wanna know I wanna know\nWhat am I doing here\nSaid, What am I doing here\nSaid, What am I doing here\n\n[Verse 2: Mac Miller]\nI hope this feelin' lasts for fuckin' ever\nI don't want to come back down, let me stay above the ground\nI hope I do what I was meant to do\nCause I've been searchin' for that answer, I just hope I get it now\nPlease, let me find euphoria\nWhen you up above the clouds, like, who goin' to touch me now\nAnd do we ever get to know the truth?\nCause everybody say they have it, but to me it seems they lack it\nNow I'm rollin' and I'm sippin' lean\nSometimes I catch a buzz just to help me picture love\nDrinkin' liquor and I'm smokin' weed\nAnd you can never do too much if you don't ever do enough\nWonder why it's me instead of you\nI'll be there to rescue you, problems you got several\nThank God that none of that medical\n\nWhat I need yall to do put two hands in the air\nWe gon' go slow side to side\n\n[Hook: Mac Miller]\nSaid, what am I doing here?\nWhat am I doing here\nWoah, what am I doing here\nSaid, what am I doing here\n\n[Instrumental Bridge]\n\n[Outro: Mac Miller & Mac Miller and Tay Walker]\nNow one time look before we do this song right here\nBefore we do this song\nAlirght, you gotta say: God damn!\nGod Damn! (repeat a lot of times)", "image": "https://images.genius.com/db53bad96e691f9ab9aec5c0405e2fc5.375x375x1.jpg"}], "artist": "Mac Miller"}