{"songs": [{"title": "Careful What You Wish For", "album": "Relapse", "year": "2009-05-15", "lyrics": "[Intro]\n\"Breaking news: Detroit rapper Eminem cancels his sold-out European tour to check himself into rehab after admitting an addiction to sleep medication. We'll have more on this story as it develops.\"\n\"Shady Records recording artist Obie Trice has apparently survived a gunshot to the head in what appears to be a random drive-by shooting. Meanwhile, Eminem is rumored to be alienated--\"\n\"On again/off again relationship with...\"\n\"This just in, a tour bus involving Eminem's bus...\"\n\"Updating a story we brought you earlier about gunfire at an after-hours club, we've learned that the rapper Proof has been fatally shot.\"\n\"Shady/Aftermath recording artist...\"\n\"Long-time best friend of Eminem and a member of the rap group D12\"\n\"D12, back in the news again today...\"\n\"Is it a sabbatical or the end? The rumors and speculation continue to swirl around Eminem. He insists he's just taking a break, but doubters believe he's retiring, leaving us all to ask, 'Will the real Slim Shady please stand up?'\"\n\n[Verse 1]\nSo this is it, this is what I wished for\nJust isn't how I envisioned it, fame to the point of imprisonment\nI just thought the shit'd be different\nBut somethin' changed the minute that I got a whiff of it\nI started to inhale it, smell it, started sniffin' it\nAnd it became my cocaine, I just couldn't quit\nI just wanted a little bit, then it turned me to a monster\nI became a hypocrite, concert after concert\nI was rakin' in the dough, rollin' in green\nHad the game hemmed up, like a sewing machine\nBut I was losing my freedom, there was nowhere for me\nTo not go and be seen, and just go and be me\nAnd there was no in-between, you either loved it or hate it\nEvery CD critics gave it a 3, then three\nYears later they go back and re-rate it\nThen called The Slim Shady LP the greatest\nThe Marshall Mathers was a classic\nThe Eminem Show was fantastic\nBut Encore just didn't have the caliber to match it\nI guess enough time just ain't passed yet\nA couple more years, that shit'll be Illmatic\nAnd eight years later, I'm still at it\nDivorced, re-married, a felon, a father, sleeping pill addict\nAnd this is real talk, I feel like The Incredible Hulk\nMy back has been broke and I can still walk\n\n[Chorus]\nSo be careful what you wish for, 'cause you just might get it\nAnd if you get it, then you just might not know what to do with it\n'Cause it might just come back on you ten-fold\nI said be careful what you wish for, 'cause you just might get it\nAnd if you get it, then you just might not know what to do with it\n'Cause it might just come back on you ten-fold\n\n[Verse 2]\nI got a letter from a fan that said he's been praying for me\nEvery day and for some reason\nIt's been weighing on my mind heavy\n'Cause I don't read every letter I get\nBut something told me to go ahead and open it\nBut, why would someone pray for you\nWhen they don't know you?\nYou didn't pray for me when I was local\nAnd as I lay these vocals, I think of all the shit I had to go through\nJust to get to where I'm at, I've already told you\nAt least a thousand times in these rhymes\nI appreciate the prayer but I've already got God on my side\nAnd it's been one hell of a ride, hasn't it?\nJust watching it from a opposite standpoint\nMan, boy's got to look\nNuts, and that's the only word I can think of\nRight now, on how to describe the shit\nThis is like a vibe you get, go ahead and bop to it\nJust watch what you wish for 'cause I got the shit\n\n[Chorus]\nSo be careful what you wish for, 'cause you just might get it\nAnd if you get it, then you just might not know what to do with it\n'Cause it might just come back on you ten-fold\nI said be careful what you wish for, 'cause you just might get it\nAnd if you get it, then you just might not know what to do with it\n'Cause it might just come back on you ten-fold", "image": "https://images.genius.com/280d45965a412d7e2a115e2db61d79f2.1000x1000x1.jpg"}], "artist": "Eminem"}