{"songs": [{"title": "As You Already Know", "album": "D.I.G.I.T.A.L.", "year": null, "lyrics": "[Intro]\nNow y'all already know\nI don't care who's first, or who last\nBut even though it's a new millenium\nYou still got to rock this at the drop of a dime baby\n\n[Truck Turner]\nFuck y'all niggas want?! Is it Truck, well you got it\nBet this gunblast, seek your chest and leave your moms brokenhearted\nGet me started, come up against THIS, is you RETARDED~?!\nI ain't shit on you motherfuckers yet, I only farted\nTake the dopest nigga from my borough, that's Kris, put him on my shit\nThe hottest latino rapper Big Pun, up on this fly shit\nG. Rap the sole survivor with Truck, kills all the nonsense\nWith Marley doin the track it's big, I mean jurassic\nLike Coke this is a Classic, from the cradle, to the casket\nGonna blow from Bangkok to Brooklyn\nBeijing to the Boogie Down, then back to my block\nCops follow the trail, that lead back to me\nI'm waitin for 'em with 2 Glocks, blow they balls off like 2Pac\nGo clutch, the holy drawers, can't save you\nStill gonna be a holocaust, Truck TUrner show no remorse\nGo 'head nigga, FLOSS~!\nWe gon' be around when the sun go down to rob you\nThen gun you down, the fo'-fo' make a thunder sound\nRush in like, hug the ground I'ma count to 10 don't turn around\nYou see my face? I'ma blaze you\nLettin in off, another round, and another round\n'Til your family, put your underground\nI told you kid, I lay you down\nSpray you down, claim your town, Bronx bound\nA team player don't play around\nWho am I? Truck Turner, you're learnin now\nNO matter, where you FROM, I'm the arsonist, I burn it down\n(Don't fuck with that boy; NEXT UP!)\n\n[Big Pun]\nSoy, con {?} aqui (boricua - light up the mic for the symphony)\nWhack rappers I humiliate like half a mic in The Source\nBlast you right off of the stage and engrave a butcher knife in your corpse\nWhat'chu writin is soft, I'm Pearl Harbor war\nRun up on your small empire and spray your tires like you Armor All\nWho wanna brawl with the Bronx finest\nTalk your highness {?} thicker force like our monster rhymers\nHate y'all B, I know you hate my stee'\nCause I'm the son of Tony you phony like fake ID\nIt's the S-H-I-T, you can smell it\nGun smoke makin you choke, take a toke and inhale it\nNow you can feel it (what?) Deep inside your lungs\nLike hot pellets when you're shot up, we supply the guns\nNow where you from state your restin zone\nI'm from the BX, B'lawn is where T.S. call home, where KRS was born\nLet it be known if I don't get you watch for our God\nCause when you diss Kris, you disrespectin MY SQUAD\nPut that on my mother, motherfucker\nHow DARE you disrespect, BITCH~!\n\n[Kool G. Rap]\nAiyyo we comin through with the fifth and Glock, rippin shots\nAnd hittin blocks, leavin kids rocked, put in a hidden box\nSplittin tops, leave his face hot, dotted like chickenpox\nCursin cops with bloodhounds, sniffin socks, sniffin rocks\nNo trace, get your clique rubbed, your wigs plugged, the shit blood\nCatch your big mug, topless just like a chick with big jugs\nUp in the strip club, beer is a Bud, no coffee\nBlowtorch like auto mechanics, you ordered to panic\nShe slaughter you bandits, your daughter be planted, inside the ground\nMore than the granite, my gunshots'll make you orbit the planet\n\"Roots of Evil\" peepin up all legal or illegal\nThe four-fours are lethal, cock back the gat to pop the wheelies like Knievel\nFire shots to rented Regals\nLeave all your peoples with palsy in they cerebrals\nDeadly as an addict's needle, let automatics reap you\nSweep you, I'm sendin you to Lucifer to keep you\nHeat you, nail you to the cross on top of the church's steeple\nRed dots cover your face like the measles\nNEXT UP! (I believe that's me)\nAiyyo {KRS} light up the mic for the symphony\n\n[KRS-One]\nYo, yo, yo - BITCH ASS~! Here's a quick class\nI'm the Blastmaster cause I blast and whip ass, this'll be over quick fast\nKeep mixin it, spittin it, bendin it\nDid it like juice with gin in it - ha ha JACKPOT, we winnin it\nYou talk that shit, but you really illiterate\nRead your shit like he he he, teh teh teh teh..\nSound out the word, connect the noun with the verb\nStick with b-b-b-bird-bird cause the battle's absurd!\nDon't let these young kids go soup that ass up\nYou'll get smashed up, you gassed up, you puttin that ass up really?\nI don't even see you in the new milline-um\nI see you like on VH1 with Milli Vanilli an' them\nTalkin about what you used to have, your abusive dad\nOh it's so so sad, cause I'm just so so death defyin, mesmerizin\nEvery time you say you dope that's false advertisin, but it's not surprisin\nYou lyin, you ain't no battle hog\nWhat you got one demo, against my 12 year catalogue?\n(NIGGA) Back up~! This is the Bronx in the house\nTruck Turner, KRS without a doubt!\n\n[Outro]\nNow y'all rippin my damn microphone, down to nothin\nKool G. Rap, Big Punisher, my man Truck Turner\nKRS-One, y'all never get on my damn microphone again\nY'all crazy! ... Get out of here, beat it!", "image": "https://images.genius.com/d939bce0d325273abe25cbd9cbdf5405.455x450x1.jpg"}], "artist": "KRS-One"}