{"songs": [{"title": "Gimme Some More", "album": "E.L.E. (Extinction Level Event): The Final World Front", "year": "1998-10-26", "lyrics": "[Intro]\nYeah, as a shorty, playing in the front yard of the crib\nFell down, and I bumped my head\nSomebody helped me up and asked me if I bumped my head\nI said, \"Yeah\"\nSo then they said, \"Oh, so that mean we gon', you gon' switch it on 'em?\"\nI said' \"Yeah, Flipmode, Flipmode is the greatest\"\nKnowing as a shorty, I was always told\nThat if I ain't gon' be part of the greatest\nI gotta be the greatest myself\n\n[Verse 1]\nC'mon, c'mon, yeah, c'mon\nYeah, nigga, what? What a surprise\nGive ya Some'n, make a nigga close both of your eyes\nAll my niggas gettin' money capitalize\nDie little small guy, we on the rise\nEverything a nigga touch platinumize\nFully equipped, you know we come wit' all the supplies\nGot a big gun, and I'ma show you the size\nYou fuck wit' any of my Flipmode family ties\nMe and my niggas be comin' through stalkin' you out\nKillin' off any and everything you talkin' about\nSee you in the club, now we walkin' you out\nShoulda' thought twice 'fo you went and opened your mouth\nYo, anyway we stay keepin it movin'\nFuckin' with the wrong nigga, hope you know what you doin'\nNow blame me, all the same niggas is lame\nIt's not a game, makin' names still splittin' your frames!\n\n[Chorus]\nY'all niggas had enough? (Gimme some more)\nY'all niggas want the wild shit? (Gimme some more)\nYo, Spliff, where the weed at? (Gimme some more)\nI know ya'll niggas need that (Gimme some more)\nEven though we getting money you can (Gimme some more)\nWith the cars and the big crib (Gimme some more)\nEverybody spread love (Gimme some more)\nIf you want it let me hear you say it (Gimme some more)\n\n[Verse 2]\nFlash with a rash gimme my cash flickin' my ash\nRunnin' with my money son go out with a blast\nDo what you want, a nigga's cuttin' the corner\nYou fuckin' up the order, go ahead and meet the reporter\nYo, she tellin' news on how you switch to a bitch\nLittle fake funny style, nigga chill with a snitch\nSo now I pass you straight up I don't got nothing to ask you\nMake a little room for me and all my niggas to pass through\nCartier, Sidney Poitier, hooray shit\nWhat with all my niggas from around the way shit\nWhen I come through you niggas know I do my thing\nBring more shit that generate money, cha-ching\nArrest you lyrically flow and caress you\nBless you, then a nigga come to your rescue\nWhile you assume a nigga blossom and bloom\nI'm comin' soon, hit you with a boom, gimme some room!\n\n[Chorus]\nY'all niggas had enough? (Gimme some more)\nY'all niggas want the wild shit? (Gimme some more)\nYo, Spliff, where the weed at? (Gimme some more)\nI know ya'll niggas need that (Gimme some more)\nEven though we getting money you can (Gimme some more)\nWith the cars and the big crib (Gimme some more)\nEverybody spread love (Gimme some more)\nIf you want it let me hear you say it (Gimme some more)\n\n[Verse 3]\nYo (Yo)\nLive nigga shit, know what I mean?\nI represent while we gettin' money and reign supreme\nHope you niggas know we comin' through full-steam\nCan't see me—better turn on your high beam\nAll my niggas wildin', ringin' the siren\n(Flipmode!) be the glory niggas on my team\nNever should you ever try to fuck wit' my cream\nI O.D. when my shit get all in your bloodstream\nEvery time we be rippin' it, be blowing it down\nBlowing you off fuckin' wit' the hottest niggas around ('round)\nRuckus when me and my people run through your town\nHoldin' it down takin' a while and then gimme my crown\nAye, (Yo) all my people need to come and surround\nA nigga be hittin' so much it make you fall on the ground\nSure to make you shout that's what I be all about\nTurnin' you out makin' all you niggas fall out!\n\n[Chorus]\nY'all niggas had enough? (Gimme some more)\nY'all niggas want the wild shit? (Gimme some more)\nYo, Spliff, where the weed at? (Gimme some more)\nI know ya'll niggas need that (Gimme some more)\nEven though we getting money you can (Gimme some more)\nWith the cars and the big crib (Gimme some more)\nEverybody spread love (Gimme some more)\nIf you want it let me hear you say it (Gimme some more)\n\n[Produced by DJ Scratch]", "image": "https://images.genius.com/5bda8f3823fbf18ca25b30d657f65a31.990x990x1.jpg"}], "artist": "Busta Rhymes"}