{"songs": [{"title": "Mrs. Perfect", "album": "The Return Of Mr. Perfect", "year": "2015-07-21", "lyrics": "[intro]\nBad bitches only whats happening? my nigga C-Note on the beat man , cut this shit up for me dawg, you know cut it up please, please cut it up (loud)\n\n[hook]\nShe got a slim waist and a pretty face, she perfect\nTwo bad bitches, a double date, and they perfect\nWhy you broke niggas all in her face? She allergic\nBig Guwop call me Mr. Perfect with mrs.perfect\nMr. Perfect, Mrs. Perfect, with Mrs.perfect\nMr. Perfect, Mrs. Perfect, with Mrs. perfect\nShe got a onion booty stanky walking, she know she perfect\nHer boyfriend worth a lot of millions, you know shes perfect\n\n[Verse 1]\nMr. perfect, I drop money on purpose\nIf a bitch pick it up the bitch deserves it\nIf a nigga pickin up ones,the nigga worthless\nTake that monkey shit off , bricksquad is not a circus\nGucci mane hire [?]\nShe sucking on me like a slurpee\n[?] wanna serve me\nHow you a street nigga? still ain't get dirty? bought a birkin bag for my big dick cause' im rich and the bitch still working\nIt's a hundred niggas wanna murk me but I'll carve a nigga like a turkey\nTrap God when I walk in all the bad bitches start flirting\nBouldercrest alum man they need to retire my jersey\nI came up in a slum and love for bad bitches to jump me\n\n[hook]\n\n[Verse 2]\nGucci mane im a trapper b , I give three bad hoes to [?]\nAll my hoes like Pappadeaux, all his hoes like Applebee's\nDont mix me up with no rapper nigga , but you can serve me some rapper weed!\nThat cookie, that  O.G., but that blue dream, you can miss me!\nShe's a bad bitch , dont talk to her, you can fool her but you can't fool me\nGot a fake chain and a fake ring I know that boy fugazi\nA quarter mill on one ring I know that gucci crazy\nPink champange for my boo thang she a bad bitch hope she dont trade me\nLast night mane we went hard mane mane we might just have a baby\nSo wasted drunk a whole pint ima name my new son barney\nThis bitch mane she insane ima drive that bitch mo' crazy\nYou perfect , she perfect , it's your lucky day , you met gucci!\n\n[hook]", "image": "https://images.genius.com/2c83e16a3c46691889e854aa1c917d90.500x500x1.jpg"}], "artist": "Gucci Mane"}