{"songs": [{"title": "Ready 4 Whatever", "album": "R U Still Down? (Remember Me)", "year": "1997-11-25", "lyrics": "[Intro]\n(Rule number one... niggas die, daily, hahahaha)\nHear me! Boo-yaow!\n(Ready for whatever, hell yeah\nWhat type nigga be a Thug Life nigga?\nThem Thug Life niggas be the craziest -- run up nigga!)\n\n[Verse 1: 2Pac]\nThere's no way to survive in the city it's a shame\nNiggas die from my hollow-point bullet to the brain\nWill I survive or will I die is what I wonder\nPuffin on blunts and gettin' drunk to keep from goin' under\nGettin' lost in the madness, blunted gettin' tipsy\nGot my pistol out the window screamin', \"Lord come and get me\"\nAm I sick, or am I just another victim?\nUnloadin' my clip, I'm watchin' every bullet spit when I kick 'em\nNiggas die from automatic gunfire\nYour time to expire, nobody cry every man gotta die\nWhen they bury me, they bury me a G\nRest in peace, to all the homies got to heaven before me\nPour some liquor on the curb for the niggas that's caught\nHad a motherfuckin' warrant but he didn't go to court\nGod damn, and one day we'll all be together\nUntil then I'm ready for whatever, c'mon\n\n[Interlude]\n(Yeah, niggas movin' somethin' in the nine-trey\nIt's all about makin' money, gettin' yours\nAnd knockin' coppers off the motherfuckin' planet\nWord to the motherfuckin' nine nigga\nWe gonna make this motherfucker ours\nIf they don't feel me, they gon' kill me\nSo Syke, get skanless nigga)\n\n[Verse 2: Big Syke]\nAm I going to Hell or will I reach Heaven?\nAfter all this shit I did with my MAC-11\nDid I sell my soul? Mama would have saved me\nThat's the way that daddy raised me\nOh God, help me I'm losing it\nSo fuck it! Take me I'm doing it!\nI need to change and look for a better way\nI got a hundred round clip to my AK\nCommitting sins I might die in vain\nSo fuck it! We'll live off the street fame\nGod didn't send me in the right direction\nI'm getting hit by a diesel in the intersection\nI know you're out there help a young brother\nTil then I'ma smoke motherfuckers\nThings wouldn't be so bad\nIf we got the things that we never had, I'm ready for whatever\n\n[Interlude]\n(Hahahahaha, that's my motherfuckin' nigga there\nBig ballin'-ass Syke\nYeah nigga, you schooled them young bustas\nOn how it is to be a real motherfuckin' G\nIn the nine-trey motherfuckers is dyin' daily so you best be packin'\nIf you ain't, boo-yaow motherfucker!)\n\n[Verse 3: 2Pac]\nDear mama I know you worry cause I'm hardly at home\nEvery other night in jail, got you patient by the phone\nWanna shake it cause I can't take it got me livin' in Hell\nLike I'm walkin' with a secret that'll kill me if I tell\nI live the Thug Life and can't nobody, change me\nNot to the brain, going insane, just a part of the game\nSo much pain in the fast lane, finally a dry eye\nWhen I die, bury me with my fo'-five\nAnd let the devil feel the wrath of a nigga\nGoin' to Hell with my finger on the trigger\nNow everybody's starin'\nGot a nigga losin' hair and they wonder if I'm all there\nWell don't blame me, blame the flame that flickers\nWhen niggas gettin' richer (mo' money)\nNow tell me if you wanna live forever\nNiggas dyin' so be ready for whatever\n\n[Outro]\n(Yeah, ready for whatever\nReady for whatever\nThug Life niggas and we be ready for whatever\nLet me go like this, ready for whatever\nHuh, Big Syke he be ready for whatever\nMy nigga Kato, ready for whatever\nPain, he's ready for whatever\nAnd my nigga Bam Bam, he ready for whatever\nMy nigga Banks just be ready for whatever\nModu, he's ready for whatever\nBig Serg, we ready for whatever\nCharlie Tango, ready for whatever\nMy nigga 'Pac, be ready for whatever\nYeah, ready for whatever\nReady for whatever\nMy big-ballin' ass nigga Boom, ready for whatever fo' sho'\nYeah, you know!\nThis how the player's do it\nI know you standin' there confused\nYou wonderin' -- what type of nigga is a Thug Life nigga?\nYeahehehehe nigga, we be the ballin' player-ass nigga\nAbout gettin' riches, bitches, and plenty loc\nYa hear me?)\n\nReady for whatever", "image": "https://images.genius.com/4f924e981b74c6d754d2c9da26f83f15.500x500x1.png"}], "artist": "2Pac"}