{"songs": [{"title": "Whateva Man", "album": "Muddy Waters", "year": "1997-01-28", "lyrics": "[Production by Erick Sermon]\n\n[Intro: E Dub]\nMicrophone check, one, two\n(I can feel it)\nAyo, you ready to get down man? (Yo, whateva man)\nYou ready to get drunk as fuck? (Whateva man)\nYou, you sayin somethin? (Whateva man)\nAyo (Whateva man)\n(I can feel it)\nCheck it, Kool V\n\n(I keeps it bangin, keep it swangin, Mike type of sangin)\nOoh la la la (So what ya sayin)\n\n[Verse 1: Redman & (Erick Sermon)]\nYo, I'm smokin herbals 'til it hurts you\nI keep your daughter way out past her curfew, hard far from commercial\n(So what cha mean nigga) We don't give a fuck when we smoked out\nIn the land that's doped out (It's like that?) no doubt\nFrom this bomb weed, I cop from the streets\nGet you open like buttcheeks, from girls who be freaks\nAyo, can I be SWV? You the One nigga\nRap Shogun, yes E the one\nYo, I'm rolling with a forty pack of niggas\nGet my weed from Branson cause his sack's bigger, yo give me dap nigga\nWhat I clap lyrically tap call back\nFerocious causing comatoses to collapse\nSo chinky eyed I see people waving on a map\nI make it hotter than your thermostats\nBomb MC's with rough megahertz so call me\nFunk Doctor verbal starburst, lyrical expert\nYour boombox better form a union\nCause I leave your circuits overworked, word bond\nNiggas front like they want it\nBut I be in the five hundred with E steadily getting blunted\nDamn nigga you cool at what you spitting\nSo why you holding the blunt so long politicking\nHuh, I ace them blunts with the technician of electrician\nI don't got a pot to piss in but still spend my last on hydroglycerin\nI keep it live no jive rolling Dutches\nThat's Masters like the Furious Five\nI, keep your crew chinky eyed, for bitches actin dog\n(Can you hit it from the back?) Why not, while we toke on this\n\n[Hook]\n(I can feel it)\n(I can feel it)\n(I can feel it)\nYo, you ready to roll this weed up? (Whateva man)\nYou ready to knock this nigga out? (Whateva man)\nYo, you ready to get this chedda? (Whateva man)\nYou ready to start this shit off? (Whateva man)\n(I can feel it)\n\n[Verse 2: Redman]\nI smoked with a lot of college students\nMost of 'em wasn't graduating and they knew it\nYou know the weed slang? Yeah boy I speak it fluent\nI light your college dorm with my entourage from Newark\nBigger they come, harder they fall\nThat goes for, knuckleheads MCs, pussy walls and all\nI lit my first L before I started to crawl\nI got my ass whupped when I had my first brawl\nBut things changed since I was twelve years old\nI specialize in wreckin mics and area codes\nNow, PPP the kinda niggas that'll bug with ya\nSmoke bud with ya, later on stick a slug in ya\nEverything that's light green ain't the bomb bitch\nI got different forms to make you lose your calm bitch\nRead my lips, you ain't hitting unless you got\nTen on it, get on it, or get the fuck out my cypher\n\n[Hook]\n(I can feel it)\nYou ready to roll this weed up? (Whateva man)\nYou ready to rob this nigga? (Whateva man)\n(I can feel it)\nYou ready to fuck bitch? (Whateva man)\nYou ready to guzzle this liquor? (Whateva man)\n(I can feel it)", "image": "https://images.genius.com/d0be6b133c513a063e20200f23f887ea.800x801x1.jpg"}], "artist": "Redman"}