{"songs": [{"title": "Block Lockdown", "album": "Word of Mouf", "year": "2001-11-27", "lyrics": "[Funkmaster Flex]\nYeah Dirty South baby - Ludacris\nShout to Shaka Zulu, my man Shawn Taylor\n.. it's goin down\n\n[DTP]\nYeah, Funk Flex, Volume Fo'\nDisturbin The Peace, Def Jam South\n'Cris (yeah) you ready?\n\n[Ludacris]\nOh it's my turn? Aiight..\nI got permission to put ya mamma in a headlock (what?)\nShe tried to jook me in a figure-fo' leg lock (ohh)\nShe said she like the way I stick and make the bed rock\nOr how I lick and leave her twisted like a dreadlock, and it's on\nSo stop the sweatin like a wristband\nAnd get some balance like a bike without the kickstand\nI think I changed the definition of a hit man\nCuz I could really give a fuck about that bitch man, c'mon!\nWe puttin holes in your residence\nAnd lose anybody for the right president\nWe thugged out street niggas with intelligence\nSo all that bullshit you yappin is irrelevant\nOh yeah, I represent the Dirty Southside\nI'm a dentist makin women open they mouth wide\nYou be in jail still runnin it on the outside\nThank not then won't ya open up ya mouth riiiight, but who cares?\n\n[Chorus: repeat 2X]\nI got my corner on lockdown\nAbout to hold this whole block down\nLudacris tell em how the South sound\nBOOOO-GRAAA  AH, UH UH UH GRAAA-AAH\nUHH GRAAA AH uh oh uh oh uh oh\n\n[Verse 2]\nComin to Shady Park is like a peep show\nIt's some respectable ladies and there some freak hoes\nI know killers that go to church up in they street clothes\nYou'll end up missin more than Shaq when shootin free throws\nThey packin and bout to open up the dope spot\nMy neighborhood is stoppin cars like a roadblock\nThey movin' weight like Atlanta was movin boat rock\nAnd catchin ums like seeun Muslims eatin pork chops - never happen\nAnd meanwhile I been thinkin man\nNiggas been slangin tapes like they slangin 'caine\nCuz in the hood its gettin ugly like orangutang\nSo if you tryin to stop the hustle get the dangalang\nOkay, we tryin to make our own White House\nPaint it black and start yellin our fuckin pipes out\nYou try to tackle some players and you'll get psyched out\nThey can't fuck with us niggas you think they dyked out, so don't play\n\n[Chorus]\n\n[Verse 3]\nDisturbin The Peace, we do that monkey shit\nHey, what can I say? We got a monkey clique\nSee Dre'll throw on them shades, and make that funky shit\nAnd keep y'all women away if they got funky clit\nUnderstand, we got that dough and it get rolled up\nYou pay the price and still we got the block sold up\nAin't nothin nice a full house don't make you fold up\nYou full of heist and try to jet and I'm like -\nHold up, god damn - I need to say it on a megaphone\nAnd tell your sister get the fuck up off the telephone\nThese fools is tickin me off like fifty metronome\nI'm takin all of ya money just call me Pebbletone!\nAlright? I got the pistol and the safe key\nYou betta tell your bitch to follow you to safety\nHow dare you wanna be heroes and tryna' chase me\nIt's Ludacris won't leave no evidence to trace me, you know why?\n\n[Chorus]\nFunky shit oh\nDo that monkey shit oh\nDo that monkey shit oh\nDo that monkey shit oh\nDo that monkey shit uh\nDo that monkey shit uh\nDo that monkey shit", "image": "https://images.genius.com/6be5b941352dc17a593995dffd367cec.1000x1000x1.jpg"}], "artist": "Ludacris"}