{"songs": [{"title": "The Bluff", "album": "O.N.I.F.C.", "year": "2012-11-26", "lyrics": "[Intro]\nHmm-mmm...\nI got so much\nI got so much\nI got so much\nI got so much\n\n[Verse 1: Wiz Khalifa]\nUh, still the same nigga\nStill walkin' all up on your airplane with all my gang members\nSmellin' like money and champagne\nPart of my campaign\nI'm fuckin' rich, my nigga, some things I can't change\nSometimes I swear I be so fly, I mean I can't change\nSometimes I feel I've got a couple people I can't shame\nStill rollin' weed in a pair of J's\nGettin' ashes all over my favorite jeans\nI ain't mad, my nigga, I'm gettin' paid\nCrib with the maid\nIt's all the same shit, different day\nKeep hearing 'bout what these niggas doin' but them niggas gone and I'm here to stay\n\n[Hook: Wiz Khalifa]\nI got me a whole one\nSo I'm 'bout to roll one\nAs soon as you jump in the ride with me\nNow you gettin' lifted\nAnd you feelin' different\nAs soon as you want, you can try, you'll see\nI got so much, yeah\nI got so much, yeah\nI got so much\n\n[Verse 2: Cam'ron]\nYo, I told her \"Leave and die\" or she can stay and breathe\nShe looked and said \"Cam, you don't know what to say to me\" (Oh really?)\nPaparazzi out, baby girl, no playing, please\nNow point that camera at my pockets cause they saying \"Cheese\"\nPut up your life in gambling\nNext time we out here scrambling\nI'm Killa, he Wiz, but all our checks say \"Cameron\"\nNext chapter, next chapter, fa-fa-fatigues and cannons\nFresh rapper, fresh rapper, right here where I'm standin'\nYou play? We playin'\nDrive by on the way that wavin'\nNew five, that's how we playin'\nWe that wave, I'm just sayin'\n(What you sayin'?) What I'm sayin'?\nMoney, hoes, clothes and mayhem\nAmen! Please, have her on her knees and she ain't prayin'\n\n[Hook: Wiz Khalifa]\nI got me a whole one, so I'm 'bout to roll one\nAs soon as you jump in the ride with me\nNow you gettin' lifted, and you feelin' different\nAs soon as you want, you can try you'll see\nI got so much, yeah\nI got so much, yeah\nI got so much", "image": "https://images.genius.com/33ab790859f8f1a0a8e408ee23962e6c.1000x1000x1.jpg"}], "artist": "Wiz Khalifa"}