{"songs": [{"title": "More 2 a Song", "album": "...And Then There Was X", "year": "1999-12-21", "lyrics": "Uhh.. c'mon!\n\n[Chorus]\n(Dog) It's more to a song than, jewelry and clothes\nMore to a nigga's life than, money and hoes\nThe game is a lot bigger than you, think you know\nAnd if you think you know, then I don't think you know\n\n[Verse 1]\nNiggas - walk around frontin (frontin) talkin bout jewels (jewels)\nHow much you bust tools, y'all niggas sounds like fools (woo)\nWho you really think give a fuck how much your watch cost? (mm-hmm)\nHow much your watch cost? You bout to get your watch lost (aight)\nIf you flashin' it, you must not want it\nSee I fuck with real niggas that done it\nYou know what time it is, run it!\nNiggas got more important shit to deal with\nTalkin' about some 4 wheel shit\nBut my man here is about to kill shit (UH!)\nKeep playin' niggas pussy, and you will get fucked\nWhy don't you cop some more ice dog;\nThen you will get stuck and fucked\nBitch ass nigga, hit my street\nAnd see what happens to that iceberg when it's hit by heat (woo)\nIt won't be a pretty sight, you and your pretty wife\nOh you must have forgot dog, this is the city life (aight?)\nAin't a fuckin thing sweet, and ain't nothing fair\nJust another nigga dead, don't a motherfucker care\n\n[Chorus 2x]\n(Dog) It's more to a song than, jewelry and clothes\nMore to a niggas life than, money and hoes\nThe game is a lot bigger than you, think you know\nAnd if you think you know, then I don't think you know\n\n[Verse 2]\nBorn and raised in the projects and can't forget it\nAnd all that grimy shit niggas do, I done did it (uhh)\nAnd I'm still with it, nigga I stay in the hood\nBut when the cats is out, bet the dog, play in the hood\nYou keep bringin' them fake bitches through\nYou gon' fuck around and make bitches do (WHAT?), we take bitches too (aight?)\nAnd if you comin through my block, it's gon' be the last stop\nWe blast tops, faggot couldn't make it to the stash box (c'mon!)\nBig ass rocks, I want that! Fuck the blood\nAll that shit washes off, the next day I'm like, \"What?\"\nFlossin' yo' shit, what I want for yo' shit? (uhh, uhh)\nGive a nigga like three bricks to feed the dogs with\nCause I ain't really gots to shine (Why?) When they do, I do\nFor me, them niggas'll hide you, where nobody'll find you\nIf you eatin' motherfucker, then your dogs should be eatin too\nNot just four or five niggas, 'cause you know what the streets'll do\n\n[Chorus 2x]\n(Dog) It's more to a song than, jewelry and clothes\nMore to a niggas life than, money and hoes\nThe game is a lot bigger than you, think you know\nAnd if you think you know, then I don't think you know\n\n[Verse 3]\nI will be the voice of the street till I die (die)\nCause I know if I keep my heart real, I'm gon' fly (fly)\nEither let me fly or give me death; if you didn't catch it then\nGet it now, cause it's all that's left\nAnd this will be the last breath (uh) provokin' my niggas (uh)\nTo start choking y'all niggas (WHAT?) and smokin' y'all niggas\nA nigga would never have to say, \"X feed me!\"\nYou'll never hear a nigga say, \"X is greedy!\"\nOnly, \"X believe me! I didn't know it was a setup!\"\nGet up, cocksuckin' motherfucker, shut up\nShut up {​​​​​​​​​*\"pop pop\"*}​​​​​​​​​ Fuck you nigga\nFrom the hood to the wood, fuck you nigga\nThis for my dogs, til death do us part\nI'm still here, cause I been here from the start (aight?)\nIf I'm ever anywhere, anytime it gets ugly (WHAT?)\nThe dog is aight, cause I know the streets love me (grrrrrrrrr)\n\n[Chorus 2x]\n(Dog) It's more to a song than jewelry and clothes\nMore to a niggas life than money and hoes\nThe game is a lot bigger than you think you know\nAnd if you think you know, then I don't think you know\n\n*speaking softly*\nDog..\nJewelry and clothes..\nMoney and hoes..\nThink you know?\nI don't think you know..", "image": "https://images.genius.com/57efb548310ed90e73d9200fd01a3e59.630x630x1.jpg"}], "artist": "DMX"}