{"songs": [{"title": "When Will They Shoot?", "album": "The Predator", "year": "1992-11-17", "lyrics": "[Intro]\n\"Stalkin', walkin' in my big black boots\"\n\"Stalkin', walkin' in my big black boots\"\n\n[Verse 1]\nGod damn, another fuckin' payback with a twist\nThe motherfuckers shot but the punks missed\nIce Cube is outgunned, what is the outcome?\nWill they do me like Malcolm?\n'Cause I bust styles, new styles\nStandin' strong, while others run a hundred miles\nBut I never run, never will\nDeal with the devil with my motherfuckin' steel - Boom!\nMedia tried to do me\nBut I was a boy in the hood before the movie, yeah\nCall me nigga, bigot, and a spook\nBut you the one that voted for Duke, motherfucker\nWhite man is somethin' I tried to study\nBut I got my hands bloody, yeah\nThey said I could sing like a jaybird\nBut nigga, don't say the J-word\nI thought they was buggin'\n'Cause to us, Uncle Sam is Hitler without an oven\nBurnin' our black skin\nBuy my neighborhood, then push the crack in\nDoin' us wrong from the first day\nAnd don't understand why a nigga got an AK\nCallin' me an African-American\nLike everything is fair again, shit\nDevil, you got to get the shit right\nI'm black, blacker than a trillion midnights\n\"Don't Believe The Hype\" was said in eighty-eight by the great Chuck D\nNow they're tryin' to fuck me\n\n[Segue]\n\"With no vaseline\nJust a match and a little bit of gasoline\" Huh!\n\n[Verse 2]\nIt's a great day for genocide (What's that?)\nThat's the day all the niggas died\nThey killed JFK in sixty-three\nSo what the fuck you think they'll do to me?\nBut I'm the OG and I bust back (Boom, boom!)\nBust back (Boom, boom!), peel a cap (Boom, boom!)\nGimme room in the fire of the sun\nHere the mack come, here the Black come, watch Jack run!\nMotherfuckers can't gank me\nFuck a devil, fuck a rebel, and a Yankee\nOverrun and put the Presidency\nAfter needin that, I'm down with OPP, yeah\nI met Farrakhan and had dinner\nNow you ask if I'm a Five Percenter? Well\nNo, but I go where the brothers go\nDown with Compton Mosque, Number 54\nMade a little dough, still got a sister on my elbow\nDid Ice Cube sell out? You say, \"Hell no!\"\nA black woman is my manager, not in the kitchen\nSo could you please stop bitchin'?\n\n[Chorus]\n\"Stalkin', walkin' in my big black boots\"\nYeah, yeah\n\"But when will they shoot?\"\n\"Stalkin', walkin' in my big black boots\"\nYeah, yeah\n\"But when will they shoot?\"\n(Gunshots)\n\n[Verse 3]\nYou missed, and didn't hit Da Lench Mob, either\nGuerillas in the mist without jungle fever\nBut I got the fever for the flavor of a cracker, not a Pringle\nBust the single, here's my new jingle\n(Stalkin', walkin' in my big black boots)\nThe KKK has got three-piece suits\nUsin' niggas like turkey shoots\nMy motto is, \"Treat 'em like a prostitute!\"\nNow if I say no violence, devil, you won't respect mine\nFuck the dumb shit and get my Tec-9 (Yeah!)\nAnd if they approach us\nI, I - I bury those cockroaches\nAnd if you can't deal with my Kill at Will\nHere's a new gift to get, try my Death Certificate\nAmeriKKKa's Most, America's burnt, it's like toast\nLike Jordan, I'm goin' coast to coast\nDribblin' the funk, here comes the nigga with the motherfuckin' monster dunk\nGet off me, punk!\n\n[Segue]\n\"Jordan...\"\n\"Watch Jordan\nAyo, Cube, watch Jordan...\"\n\"Yes!\"\n\"You better eat your Wheaties\"\n\n[Chorus]\n\"Stalkin', walkin' in my big black boots\"\nYeah, yeah\n\"But when will they shoot?\"\n\"Stalkin', walkin' in my big black boots\"\nYeah, yeah\n\"But when will they shoot?\"\n\n[Verse 4]\nDaryl Gates got the studio surrounded\n'Cause he don't like the niggas that I'm down with\nMotherfucker wanna do us\n'Cause I like Nat, Huey, Malcolm, and Louis\nMost got done by a black man's bullet\nGive a trigger to a nigga and watch him pull it\nNegro assassin\nI'ma dig a ditch, bitch, and throw yo' ass in\nWhen they shoot, no, it won't be a cracker\nThey use somebody much blacker\nWhat I do? I called up the Geto Boy crew\n'Cause my mind's playin' tricks on me, too (Yeah)\nNever died, surround my crib\nAnd FOI makin' sure nobody creep when I sleep\nKeep a nine millimeter in my Jeep (What?)\nPeep when I roll, I gots to roll deep\nAin't goin out cheap\nMet the MADD Circle on Cypress Hill 'cause it's so steep\nThey'll never get me, they'll never hit me\nMotherfuck that shit, J-Dee\nNow I'm relaxed\nGrab the St. Ides brew so I can max\nSittin' by the window 'cause it's so fuckin' hot\nAnd then I heard a shot, boom", "image": "https://images.genius.com/aa204256470ef9ed3c3a3fbcc1ee43da.1000x1000x1.jpg"}], "artist": "Ice Cube"}