{"songs": [{"title": "In And Out", "album": "Who You Mad At? Me Or Yourself?", "year": "2013-04-18", "lyrics": "[Intro: Jadakiss]\nYeah yeah yeah yeah.... I just wanna know one thing. Who you mad at? Me or yourself? Sucka...\nYeah, D Block... NYC... Salute. I know what it is. Everybody, no exceptions. Line up\n\n[Hook] x4\nSelling, selling, selling drugs on the dime\nHanging out with young thugs that all carry nines\n\n[Verse 1: Jadakiss & Styles P]\nYeah, what\nFor years we had the best recipe on the market\nHe running 'round like he a soldier (but he a target)\nA lot of your careers was over (before they started)\nIt take a special nigga to notice (where your heart at)\nI'm pulling up to the club, I'm in a spaceship\n(A whole nation of thugs that embrace this)\nThese niggas tucking they tummies and getting facelifts\n(They still trying to ball) I'm James Naismith\nYeah, 12 cylinder pushers\nAnd this bubblegum rap (is just killing the woofers)\nAnd you know I'm blowing the haze, (dealing the kushes\nTech on the dresser,) AK still in the bushes\nSettle it in the street, (we ain't tryna do court)\nNew scratch-offs, (bootleg liquor,) loose Newports\n(City is mine) the home team's who I root for\n(all times) two P89s in the coupe door\n(The dark comes) the sun go\n(I try to be dumb ?) because these crack babies is gung-ho\nFloor seats at your funeral (in the front row)\nGet 'em the new Jordans (they letting the pump go)\nIf they could sell it (they could sell it), put the pressure\nOn, more than likely (they'll tell it), smoking\nOn that loud, (can't see it you could smell it)\nGotta rise with (the same niggas that you fell with)\nMoney in the mattress (guns in the couch here)\nYou thought it was wrong (till you ended up) out here\nWhat...\n\n[Hook] x4\nSelling, selling, selling drugs on the dime\nHanging out with young thugs that all carry nines\n\n[Verse 2: Jadakiss & Styles P]\nIt's bout to get ugly... Don't get scared now!\nYo\nTold you I'm the top five, the other four don't count\n(Catch me on the dope count) nigga ship the dope out\n(Niggas got guns) so go 'head and pull the scope out\n(Tryna get high) so go 'head and pull the smoke out\n(If niggas got bread) then tell 'em to pull a loaf out\n(Y'all ain't murking nothing) y'all the niggas getting moped out\n(You don't want a problem,) you don't want to solve 'em\n(You don't want a pissy ass teen with a revolver)\nRunning in your mom crib (fuck around and rob her)\nNiggas shoot the shot (like they playing for Gonzaga)\nYou don't know the steelo (money off of cee-lo)\nTook the Diddy advance, and went and bought kilos\n(That was in the '96) now we in the '13\n(You ain't getting paid bitch) and I ain't Kris Humphries\n(I ain't Ye neither) I move yay though\nWe just having fun with the money, (play dough)\nWhat up though, (let it bust though)\nM-16 (cause you an emcee gusto)\nLA weed, (Bay weed)\nAlways paper around, everything stays green\n(Big guns) hopping out the van like the A Team\n(Spit artwork) I'll ship hard work\nBefore they deal the hand (take a look at the cards first)\n100 guns, (200 bricks,) that's mob work\n\n[Hook] x4\nSelling, selling, selling drugs on the dime\nHanging out with young thugs that all carry nines\n\n[Outro: Jadakiss]\nWhat? You're all welcome, you know...\nYou're all welcome\nIn case y'all forgot, don't ever forget. Nahmean? Never again\nAll aspects covered\nWe don't gotta explain what's already understood\nCowards. Don't make me tell you again neither\nPoobs! P!\nFlex!", "image": "https://images.genius.com/43cf4f7fb829f88b270853d2534b8f0f.1000x1000x1.jpg"}], "artist": "Jadakiss"}