{"songs": [{"title": "Where’s The Love", "album": "Life Is Good", "year": "2012-07-17", "lyrics": "[Produced by No I.D.]\n\n[Verse 1: Nas]\nAt times I window watch at the Wynn hotel\nLots of thinking happens in life, will I win or fail?\nMind of a shooter, CFO also\nEthiopian food flown in, it's unlawful\nMoney is attractive, honey dress strapless\nAgent Provocateur underwear: she's classic\nStroll up in the party: titanium black card\nRomanian ladies like Casablanca, Casbah\n'Cept we in the VIP area, that's ours\nYou know the real rap gods, typical trap star turned rap star\nThese old heads got stories, the days they was kings\nI pray secret indictments don't take away their dreams\nYou 16, you could do 20, come home young\nCatch 20 years when you 40? Holmes, you're done\nWhat have we become? Rap stars from trap stars\nBlack gods to Ansars to Sunnis back to goonies\nA 360 in the streets real grizzly\nShooters is cold, kid, the old shit was learning\nStudent enrollment to focus, yet hooligans roll with\nToasters to pop your medullas off of your shoulders\nThis ain't The Truman Show; it's the human show\nAsk the F.B.I. agent at his cubicle\nChewing on his pencil eraser with intents to erase you\nIt's U.S.A. against the gangsta, where's the love?\n\n[Chorus: Cocaine 80s]\nLove, I'll trade you love\nI've traded fire with you long enough\nIs that all you brung, without love?\nThat's fucked up, but I saved your soul\nRoll that up\n\n[Verse 2: Nas]\nSometimes I sit on the bench just to watch the game\nFeet on cement, there ain't a mobster living I could name\nWho made it out rich, in his absence I do not proclaim\nTo not have a heart like wild animals not tamed\nMaybe just a typical thug nigga was my rank\n'Cept I had a vision above niggas, what I think\nIt's crazy how many brothers come where I come from\nSome made it out big, some dead, some unsung\nShots for soldiers on 23 hours lock-up\nYounger generation, they want to mimic and mock us\nLaughing, separating themselves like they not us, like\n\"Cops'll look at you like they look at me? That's preposterous\"\nAin't it gangsta how your man made it? I'm humble\nOne gun, one crazy ass nigga, that's Jungle\nNow we having babies, 'cause growing up it was just us\nNo uncles or cousins to fight with us, we was fucked up\nBut still it was beautiful, the love is mutual\nEven though me and Jung ain't show up to your funeral\nI hold your son hand, tell him he the man, we love you\nYour pops was king, you have a whole lot to live up to\nThe G is in your genes, already you tuck\nInherit your dad's swag, his George Jefferson's strut\nStay flyest, they gon' want to know what in your diet\nDon't be surprised if they want to check your shit and your vomit\nTell them you let it marinate, they swear you made them a promise\nNo matter what they do, you just stay a man of honor\nI'm a street corner nigga, New York Knicks loyalist\nCorona sipper, pass it, I'ma blow it with you\nIt ain't The Truman show; it's the human show\nAsk the F.B.I. agent at his cubicle\nChews on his pencil eraser with intents to erase you\nYoung brother go and get your paper, I got love\n\n[Chorus: Cocaine 80s]\nLove, I'll trade you love\nI've traded fire with you long enough\nIs that all you brung, without love?\nThat's fucked up, but I saved your soul\nRoll that up\n... Roll that up", "image": "https://images.genius.com/d77829b400779c24c98b27bec8d6bfda.800x800x1.jpg"}], "artist": "Nas"}