{"songs": [{"title": "Represent Dat G.C.", "album": "Tha Streetz Iz a Mutha", "year": "1999-11-16", "lyrics": "[Intro: DJ Eazy Dick]\nOh y'all just wanna do with out the beat\nUh well fuck it we gon' do it like this\nOn radio station motherfuckin' 187.4 bitch\nW Ballz part two huh?\nPeep game broadcasting\nProvided by mother fucking Emena huh?\n\n(Enema!)\n\nEmena... not Enema... Enema!\nI'm sayin' it baby, I just said it low\n\n(In yo' ass)\n\nIn your motherfuckin' asshole\nOk like this, we gon' clean it up like this, huh punk bitch\n\n[Kurupt]\nMan what a bitch, gangsta shit\nFours scrape up the cement then bend\nI never love me a ho\nJust to remind y'all bitches in case you didn't know\nI breaks fool all niggas, way cool all niggas\nFuck all y'all niggas, sawed off y'all niggas\nAnd I'm quick to pull out\nGangsta shit, tell a bitch to stick a dick in her mouth\n\n[Daz Dillinger]\nAs I skip to my loo, C-Walkin', G talkin'\nI'm a gangsta, cold hearted, sick, dumb and retarted\nCame up this far without a bullet proof vest (yeah)\nRan with the best, sport khaki's again\nAlways stay fresh won't settle for less\nLooped out, satined out -\n\n[Soopafly]\nMan these niggas on deck\nNow it's the pimp of the crew, Soopafly comin' through\nI got a dick and a couple balls just to name a few\nThe D.P. locced out, niggas get choked out\nSmoked out niggas that'll fuck you up no doubt\n\n[Tray Deee]\nGangsta gangsta, tell me how you do it\nIt seems so simple like there was nothin' to it\nRippin', sippin', dippin' on the fluid\nWest Coast nigga, yeah we be the truest\n\n[Hook: computer voice]\nRepresent that Long Beach, Represent that L.B.C\nRepresent that Long Beach, Represent that S.T.C\nRepresent that Long Beach, Represent that D.P.G\nRepresent that Long Beach, Represent that P.A.C\n\n[Jayo Felony]\nI have so much beef I shoulda fucked up my colon\nBut I sent 'em off deprived, with both they fuckin' eyes swollen\nEverything stolen and it's still rich rollin'\nNiggas can't see me cause I kill shit blowin'\nI let loose like ain't no tomorrow with bomb beats\nA-K-47 street, quick to get ya\nMy lyrics like missiles to hit Hitler\nMotherfucker stay up out my Kool-Aid pitcher\nYou don't wanna see my style like click-click pow\nMake you bow to my wicked style, make you my child\nThe enemy wanna diss, nigga but how could he?\nWe hookers and hoodies, with a bag full of goodies, what!?\nNow take that for what it's worth\nI'll terrorize your territory and take over your turf\nAll these niggas is rob, but they was soft as a Nerf\nNasty as after birth, they say \"ooh\" after the verse\n\n[Snoop Dogg]\nI'm commercial, universal with no rehearsal\nAnd when I'm in the hood I'm just so controversial\nNiggas know me homie - the O.G\nWest Coast Don, I'll smash on anyone\nOn my daughter and my two sons, the set and my two guns\nI move the dubs and let D move the 2-1's\nNot to mention all my No Limit niggas now\nWe do it G style like Big C-Style\n\n[Hook: computer voice]\nRepresent that Long Beach, Represent that L.B.C\nRepresent that Long Beach, Represent that S.T.C\nRepresent that L.B., Represent that D.P.G\nRepresent that L.B., Represent that P.A.C\n\n[Snoop Dogg]\nWhat, what, what?\nMy freestyle worth about a ticket now\nSo to kick a style, you gotta kick me down\nEvery nigga from the Pound gettin' paid now\nHey now, big bow wow honey child\nI ran a hundred miles through about a hundred styles\nAnd now I'm through with it, with nothin' else to do with it\nRoll it, blaze it, pass it, now you hit it\nWe's a D.P.G. committee\n\n[Kurupt]\nSnoop fuck that bitch\nDat Nigga Daz fuck that bitch, that trick, that goofy ass bitch\nSoopafly, super high, ruff cap slip, fuckin' gangsta shit\n20 Insane, 60 Crip\n19th Street Crip - where the gangstas hang\nIt's a gang thang, we all gang bang\n\n[Daz Dillinger]\nHold up (Wait a minute!)\nAll my niggas get (Gangsta with it!)\nTick-tock (Crip Walk!)\nAnd prepare to get ill when the gangstas talk\nSaggin' and flaggin' with the '7-trey draggin'\nSmokin' like a dragon with the .4-4 cannon\nBe the last man standin' whoopin' niggas at random\nGray and Blue bandanna's, hoo-ridin' is standard\nSo what y'all wanna say? (Huh, huh?)\nWhat y'all wanna do? (Huh, huh?)\n\n[Butch Cassidy]\nYou niggas trippin', while I'm steady dippin'\nThrow your clip in, since y'all all flippin'\nRollin' capers, while I'm gettin' papers\nTried to shake us, you know they caught the vapors\nEveryone around is soon to see\nAin't nobody comin' close to me\nKeep hangin' 'round and you'll believe\n\n[Hook: computer voice]\nRepresent that Long Beach, Represent that L.B.C\nRepresent that Long Beach, Represent that S.T.C\nRepresent that Long Beach, Represent that D.P.G\nRepresent that Long Beach, Represent that P.A.C\nRepresent that Long Beach, Represent that S.T.G\nRepresent that Long Beach, Represent that D.P.G\nRepresent that Long Beach, Represent that P.A.C\nRepresent that Long Beach, Represent that Long Beach\nRepresent that...\n\n[DJ Eazy Dick]\nLet's kick it off like this bitch... bitch please...you ain't knowin'\nThe broadcast is directed by motherfuckin' Snoop Doggy Dogg in this biznotch\nIf you're not knowin', ya know!\nWe gon' kick it in your colon hole like this though\n1-8-7.4 in your asshole like this\nIf you're not knowin' now your blowin'...\nShabadoo huh?\nWe gon' kick it like this to the Eastside L.B.C\nL.B.C. huh?\nS.D.C.?\nFuck I heard it was uh, D.P.G", "image": "https://images.genius.com/19827b73d665d135cdf903e8afe08997.1000x1000x1.jpg"}], "artist": "Kurupt"}