{"songs": [{"title": "Echo", "album": "Hell: The Sequel", "year": "2011-06-14", "lyrics": "[Chorus: Liz Rodrigues]\nAll around\nThe world there's an echo\nAs he takes\nA bow, and they all know\nAll the girls, the boys\nThey chase the noise\nThrough the highs and through the lows\nThey will follow the echo\nEcho, echo, echo\nThey will follow the echo\nEcho, echo\n\n[Pre-Verse 1: Eminem]\nIt seems like no matter what I do, I just can't get away from them\nGet away from what?\nThe voices\nI can hear 'em callin', callin', callin', callin', callin'\n\n[Verse 1: Eminem]\nI eat rappers, with the rhyme, consume 'em\nThe only fucking thing that you consume is time, I'm super human\nMy world is like a Rubik's Cube, it's too complex girl\nYou assuming, Cupid's looming, my mentality's caveman stupid woman\nMy life is Truman Show, all I have is music, ho\nI stopped chasing every chick under the sun many moons ago, so pretend my dick is a balloon and blow\nBut you better put a fork in it if you think I’ma lay here just spooning, yo\nOh, you think you the shit 'cause I just said you was beautiful?\nDiabolical to my last molecule, down to my last hair follicle and cuticle\nRotten to the core to the bone cold all the way down to my soul from my head to my toe\nEver since I was 13 I learned how to sew and sewed shut my own bootyhole\n'Cause I ain't took no shit since I looked down to my nuts and saw my first pubic grow\nI told these stupid hoes when I come back I’ma set this bitch on fire!\nAnd this time I don't mean I'ma pour gasoline on some chick and light her\n'Cause this time when I fuck this world I’ma put the whole goddamn dick inside her\nI ain't even put my tip in that hole yet, I'ma go get Nickel and try to rip it wider\n\n[Chorus: Liz Rodrigues]\nAll around\nThe world there's an echo\nAs he takes\nA bow, and they all know\nAll the girls, the boys\nThey chase the noise\nThrough the highs and through the lows\nThey will follow the echo\nEcho, echo, echo\nThey will follow\nThe echo, echo, echo\n\n[Pre-Verse 2: Royce da 5’9” & Eminem]\nShh!\nDid you hear that? Somebody just said something\nIs anybody there?\nI can hear 'em callin', callin', callin', callin', callin'\n\n[Verse 2: Royce da 5’9”]\nClassical poems, battle my own demons, I need a glass of Patron\nBad as I need a horn stabbing my clavicle bone, I'm matador prone\nFirst time I seen a desert eagle I was letting the .44 buss, the .44 pop\nThe first time you seen one, you was eating coco puffs, looking at Robocop\nI am not a man, I'm a logo, I'm a such thang\nIn order to clean my veins you need Saleen, I'm never referring to the solution, I’m talking about more like the Mustang\nVroom! Get respect from the get-go, hello! Step to the echo, echo, echo\nPen got a mind of its own, got to write my rhymes with a timer\nOtherwise I’ll probably vibe out to a nine minute song\nAs the echo follows the Maserati, as the petrol swallows\nI'm a thousand bodies away from a skeleton, check your Bible inside it\nIt'll say this guy's an elephant, I’m fly like I’m killing the scene like\nI’m a villain with wings, I’ll sleep when I’m 6 feet deep\nRight now I’m living a dream, though we may be reckless\nThe ladies check us, they whisper Shady Records, baby echo!\n\n[Chorus: Liz Rodrigues]\nAll, around, the world, there's an echo\nAs, he takes, a bow, and they all know\nAll the girls, the boys, they chase the noise\nThrough the highs and through the lows\nThey will follow the echo, echo, echo, echo", "image": "https://images.rapgenius.com/c0c3c7e0aef3d510821c9890e36cf379.400x400x1.jpg"}], "artist": "Bad Meets Evil"}