{"songs": [{"title": "Bang Zoom", "album": "The Meth Lab", "year": "2015-08-21", "lyrics": "[Hook: Eazy Get Rite]\n(Bang Zoom) Them hammers go boom, shoot ‘em up leave ‘em there and clear the room\nNigga all I hear is (chick pow). So give it up now, that’s the type of shit that happens in my town\nNigga all you do is (click clack), listen fuck that. All that bullshit hesitating get you clapped\nAll I know is (zoom bang), letting my nuts hang. Out to get it, best believe I do my thing\n(yo its Staten Nigga)\n\n[Verse 1: Hanz]\nHanz roll. Buzz swoll. Don’t be understanding how these corny niggas bold\nLife told, screenplay graphic when it unfold. Running with them killas made his heart cold\nLights strobe. Cameras on him walking through the threshold\nSpanish bitches yelling dame besos. Watch glowed, earlobes frozen but we seek gold\nMr. Barka. Yup, yup, beast mode. Meth labs, bishop in the city\nGet them grips grabbed, run up do him greasy. You’ll be shot, stabbed, got it looking easy\nHave ‘em zipped, bagged, to the morgue motherfucker\nCash rules, so we berry everything. General smash fumes, dark Henny everything\nPeep the math, jewels yo we built for the struggle\nHanz on, nuff said, bout his bread. Boy trouble\n\n[Hook: Eazy Get Rite]\n(Bang Zoom) Them hammers go boom, shoot ‘em up leave ‘em there and clear the room\nNigga all I hear is (chick pow). So give it up now, that’s the type of shit that happens in my town\nNigga all you do is (click clack), listen fuck that. All that bullshit hesitating get you clapped\nAll I know is (zoom bang), letting my nuts hang. Out to get it, best believe I do my thing\n(yo its Staten Nigga)\n\n[Verse 2: Method Man]\nMeth man, yes Hanz, twenty years of love, they been throwing up them dubs\nThat’s respect, damn, money, sex, drugs, you’ll get stretched, blam, tec nine up in the club\nThat’s a tec jam, can’t wait to see him go, make ‘em hate to see me blow\nI’m a label CEO minus the yes man, Rick Rubin with the spliff\nThat could spit it Ludacris, minus the Def Jam\nMean while, stick ya for ya cream, red beam (chi-ca-bloow), Another John Coffey on that Green Mile\nGet it how I’m living, got an ounce of Steve Rifkind, that’s that green loud\nYes sir, no child left behind, pump your brakes (scrrrrrrrr)\nSnitching in the kitchen you’ll get baked served, my life is like a movie\nAll groovy I mean its all Gucci (burrrr)\n\n[Hook: Eazy Get Rite]\n(Bang Zoom) Them hammers go boom, shoot ‘em up leave ‘em there and clear the room\nNigga all I hear is (chick pow). So give it up now, that’s the type of shit that happens in my town\nNigga all you do is (click clack), listen fuck that. All that bullshit hesitating get you clapped\nAll I know is (zoom bang), letting my nuts hang. Out to get it, best believe I do my thing\n(yo its Staten Nigga)\n\n[Verse 3: Streetlife]\nStreetlife, goon, platoon, locked reloaded, bang zoom. Gee coated, from the womb to the tomb\nI’m married to the game, this my honeymoon. Yes, I do, forever Wu\nLoyalty is royalty, cream blue. Code red, dangerous ground\nStreet I’m heaven sent but I’m hell bound\nTop fie, hands down, Staten popular son, peace lounge\nCrown fitted for the king, I am, I suggest, you play the wing man\nShine like a diamond, like bling blam. God body watch a nigga go ham\nLifestyle episodes of Gangland. Thirty six shots from the chamber blam...\n\n[Hook: Eazy Get Rite]\n(Bang Zoom) Them hammers go boom, shoot ‘em up leave ‘em there and clear the room\nNigga all I hear is (chick pow). So give it up now, that’s the type of shit that happens in my town\nNigga all you do is (click clack), listen fuck that. All that bullshit hesitating get you clapped\nAll I know is (zoom bang), letting my nuts hang. Out to get it, best believe I do my thing\n(yo its Staten Nigga)", "image": "https://images.genius.com/fafd5b6184e352f00d35852ac8b31946.1000x1000x1.jpg"}], "artist": "Method Man"}