{"songs": [{"title": "Warning (Intro)", "album": "Release Therapy", "year": null, "lyrics": "[Intro]\nWarning! This album contains Ludacris material\nParental discretion is advised\nSo kids cover your ears and close your eyes\nOtherwise you're about to witness HISTORY\nThe thoughts and views expressed on THIS album\nAre a direction reflection of the new generation\nSo without further ADIEUX\nI bring to YOU, that nigga named Luda\n\n[Ludacris]\nHEY! I be that nigga named LUDA give a round of applause\nThey say I'm up to no good, I'll say I'm down for the cause\nDown for whatever goes down, I'm strapped down to my drawers\nSo if you up for some stitches then I'm down for some scars\nDown to make 'em GET DOWN, stop playin and pause\nThere's two things I'll never break and that's my word and my balls\nSo here's a temporary fix for your permanent flaws\nThis album helps you to RELEASE cause life is irkin us all\nEnough to make you wanna break shit, no longer will I take shit\nFrom ANY of these clowns cause I'm TIRED of this fake shit\nI'm ready for some action, ready with a passion\nLike pots with the steam I'm ready to get it crackin\nIt's six years and countin if you think I'm a joke\nMe gettin served is like Bill Gates and Oprah goin broke\nIt's 'bout time they gave it to me, I'm the reignin champ\nYour favorite rapper went to Ludacris' trainin camp\nBeotch!\n\n[Outro]\nYeah shawty! (That's right)\nOn the real I feel you on that\nMan I'm tired of all these fake-ass niggas homes\n(Hell yeah shawty) Ay ay, this your boy Lil' Black\nRepresentin that zone-trey you feel me\nAll these niggas ay, I told y'all hoes that I'm the man\nI told y'all homey nigga just need to get to the money man\nStop fuckin with homes man, feel me?\n\nI JUST WANNA KNOW WHAT HE SAID ABOUT OPRAH!\nDON'T NOBODY TALK BAD ABOUT OPRAH!\nYOU JUST LOST A FAN\n\nMan Joe, I'mma tell you what the bid'ness is\nYou fuckin with a true player, true and recognized, ya dig?\nY'all already know the demo, Scary Larry sweet big-ass punks\nIf you ain't fuckin with my guy, What is yo' life about?\nKick rocks, SKEEZER please!\n\nYo God, man Chris can kiss my ass\nHe remember me, I was at the club right there with him\nHe he coulda got me in\nI mean I went to Benjamin Banneker high school with him\nI knew him before all the fame\nThat's how you gonna do your people man?\nThat's how you gonna do your folk?\n\nYup! Tch man I used to cook for this nigga\nSee he done come over to my house the other day\nTalkin 'bout, he don't eat beef and he don't eat pork\nAnd my homegirl was over there and she was like\n\"Girl he look so tall on TV!\"\nI said, \"Girl I told you he was short\"\nMaaaaaaan, I don't give a damn\nI looooove that nigga!", "image": "https://images.genius.com/57825a3687491fdf0e3c4c58b1b7aee5.1000x1000x1.jpg"}], "artist": "Ludacris"}