{"songs": [{"title": "I’m Gonna Ride", "album": "Show and Prove", "year": "2006-09-05", "lyrics": "[Verse: 1]\nSee a nigga well known for switching states\nMacking broads, getting cake\nGlock and mad, cock and blast\nThrown a bitch nigga for a quick escape\nI move with dudes that be dishing weight\nSmooth with the uz that will hit your face\nCame in the game and I'm changing the game\nWith a flow that will run around the crews that hate\nThis guy is a pimp and you know his fam\nI don't hold the grams, I'm a colder man\nAnd I do it for the youngers and the older fans\nNiggas whippin in the kitchen just to hold their grams\nI don't play around, lay em down\nFor the lil' homie wanna' play the clown\nI'm casing pounds, spraying rounds\nFollow the leader cause it's going down\nMoney in the rubber band slangin' crack rock\nTry and find the man in the flat top\nAsk anyone in the streets\nEveryone around knows Wiz a beast\nAnd I'm killing the beef you can chill in the team\nPull the steel and release, I’m up in your brain\nYou bet on me taking the loss, you better be upping your change\nSee this guy here is a nuisance, you talk fire and you can't prove it\nYou just lie up in your music, send my guys to come and shoot shit\nDuke I ride and this is true as you would die if niggas pulling\nI don't know what you fucking see\nWhen you know as well you've been fucking me\n\n[Hook]\nI'm on the move so if you get in my way then\nI'm a ride ride till I die and it should be no suprise\nWe paper chasing man, messing with my cake or fam\nImm ride ride till they die fuck us try\nI'm gonna ride for me ride for me\nDie for me die for me\nBust your 45 for me, face the judge and lie for me\nRide for me ride for me\nDie for me die for me\nBust your 45 for me, face the judge and lie for me\n\n[Verse: 2]\nP. I. T. T. S. B. U. R. G. H. represent to the fullest\nAnd I'm putting cowards back into place when I'm rapping the taste\nYeah crack in the place, laugh in your face\nLay up and chill after you safe that's a mistake\nCause I'm moving with a gang of ill guys looking like\nThe last of the day but why you say\nCause my nigga I could die today lock down\nAnd never see the light of day\nKidnapped trapped in a hide away\nSo I never get the cat to ride away fire inside of\nMay the kid move with da fools that try to take\nThe game back to the rhyming days payback\nFor the fact that your guys a fake and I can't even believe\nYou can spit shit to the people like it\nChips and just leaves you with kids, that leaves\nYou see through you pricks, hand my shit an overdose\nSo you wrote and sold some coke, move some crack\nHow true is that. Front on my cats and you'll lose shit back\nHaters get stacks when I'm through with rap\nAnd I'm filling my tracks with truth and fact\nKill em on wax and I'm moving cats\nWhen they crew in all black yeah I'm doing that\nI gotta flavor that will flow and taste\nAnd I'm doing it till I'm blue in the face\nI'm thinking bigger then any nigga that think\nHe cool in the place which gives me reason\nTo but a tool to his waist\n\n[Hook]", "image": "https://images.genius.com/0cee9f06adc4b497759c94c781db2600.1000x1000x1.jpg"}], "artist": "Wiz Khalifa"}