{"songs": [{"title": "King and Queen", "album": null, "year": null, "lyrics": "(Intro - T.I.)\nAy, ay, ay!\nNow listen to me for a minute\nAy, ay, ay!\nCan ya hear me?\n\n(Ciara)\nYeah, yeah, ye-ah!\nLa-la-la-la-la-la-la!\nHa ha ha, yeah, ye-ah!\nLa-la-la-la-la-la-la-la-la!\nOoh-ooh, ooh-ooh-ooh, ooh-ooh-ooh, ye-ah!\n\n(Verse 1)\nTI\nI know what you be thinkin' when ya hear me tryna holla\nI'm a baller! You don't wanna come near me\nI know ya hear me, but you really ain't tryna be bothered\nCause you probably used to leavin' out the club gettin' followed\nBut listen, shawty, I ain't nothin' like a stalker\nIf I say then I mean it, I ain't just a sweet talker\nI know I want a woman 'fore I ever try to call her\nI know ya first mind tell ya to decline, but you oughta\nCome and chill for a minute, take a load off\nKnow ya heard rumors, plenty hoes say I'm throwed off\nIf ya choose to listen to them then it yo loss\nBut what you wanna do let me know, 'fore I roll off\nI know ya havin' second thoughts, it ain't yo fault\nJust don't let the bling scare ya off, I'm a sure floss\nBut I keep my business to myself, let the hoes talk\nKick it wit da King, be the Queen, it ain't no cost\n\n(Chorus - Ciara)\nI'll be your Queen for a day\nMaybe we can get away\nI do anything you wanna do anytime just pick a place\nI'll be your Queen for a day\nBaby you won't have to chase\nIf ya really want me to be the one, all ya gotta do is say, \"I'll be ya King!\"\nI'll be your Queen, for today\nMaybe you won't have to chase\nIf ya really want me to be the one, all ya gotta do is say, \"I'll be ya King!\"\n\n(Verese 2 - T.I.)\nCome and hang wit me, shawty\nI can change ya life! Not a lil bit, look I'm talkin' major like\nI mean first class flights, not first class seats\nGotta go G4 if ya commin' wit me\nI put you in position broads would be honored to be\nHoppin in the double R right in front of the suites\nTell the driver to drop us off in front of the beach\nSet up a table in the sand, fix us somethin' to eat\nYou'll be surprised whatcha learn sit and talkin' to me\nAs the moon and the stars glisten off of the sea\nYou've hardly ever seen only one woman with me\nAnd if ya did then she probably mean something to me\nI know you know I tote Glocks and I come from the street\nBut I done growed up alot since I was runnin' the streets\nAnd even if that don't change ya opinion of me\nI bet ya glad you got the chance to come and kick it with me, right?\n\n(Chorus - Ciara)\nI'll be your Queen for a day\nMaybe we can get away\nI do anything you wanna do anytime just pick a place\nI'll be your Queen for a day\nBaby you won't have to chase\nIf ya really want me to be the one, all ya gotta do is say, \"I'll be ya King!\"\nI'll be your Queen, for today\nMaybe you won't have to chase\nIf ya really want me to be the one, all ya gotta do is say, \"I'll be ya King!\"\n\n(Verse 3 - T.I.)\nI know ya had a chance to listen to the rest flirt\nFor you give on up the song come and try my vest first\nI can give it to ya slow or I can make the sex hurt\nOoh but no pressure we ain't gotta have sex first\nI know you wanna know that it's a mutual respect first\nBut we goin kick it if ya wanna clear ya head first\nWe can blow on the best purp til ya chest hurt\nTake a couple shots drop the top in a wet vert\nCall up ya homegirl, we can go and get her\nIf she love a good time well tonight might impress her (ha ha)\nSqueeze in ya tight skirt, match it wit ya best purse\nI can show ya both how to ball I'm an expert", "image": "https://images.genius.com/95c6ef80918cf6889fd7292b4763b187.350x350x1.jpg"}], "artist": "T.I."}