{"songs": [{"title": "Sins", "album": null, "year": null, "lyrics": "[Intro]\nLukey baby\n*cough*\nStoner baby\nC4\nFour bombs baby\nHey! Boom! Boom! Boom!\n\n[Verse 1]\nHow can I win?\nI fuck up, we make up, I fuck up again\nI cash out [?] make me cash out on him\nMy bank account stuffed with nothing but them Ms\nThese are my sins\nI nut on her skin\nTaking pictures with her butt in my hand\nDrinking liquor showing out on her friends\nThree quarters, bitch send her straight to my mans, these are my sins\n\n[Hook 1]\nNigga like yeah yeah, yeah yeah yeah yeah yeah yeah\nNut in her damn hair\nYeah yeah yeah yeah yeah yeah\nFuck her dress\nYeah yeah yeah yeah\nLeave 'em [?]\nYeah yeah yeah yeah yeah yeah\n\n[Verse 2]\nYeah yeah we getting plenty money nigga yeah yeah yeah\nNigga like yeah yeah so many sins a nigga get the damn electric chair\nBeen riding in the passenger seat, we see them niggas can't do nothin' but stare\nNigga pourin' out the Rosé, and I ain't Ricky but I'm screaming free Gucci La Flare, yeah\n\n[Bridge]\nI'm in a coupe pullin' up with my bro\nI'm into coming and cum in her throat\nBitches gonna come in and cum and then go\nBitches need [?] when they suck on my nuts\n[?] a four\nTurn around nigga [?]\nI'm in the cold when they see me they froze\nIt ain't a cold world, it's not really cold\nGoing for [?] and then fucking [?]\n[?]\n\n[Empty Instrumental]\n\n[Hook 2]\nYeah yeah, yeah yeah yeah yeah yeah yeah\nNigga like yeah yeah, yeah yeah yeah yeah yeah yeah\nNigga like yeah yeah, yeah yeah yeah yeah yeah yeah\nNigga like yeah yeah yeah\nNigga like yeah yeah yeah\nNigga like yeah yeah, yeah yeah yeah yeah yeah yeah\nWhite boy like yeah yeah, yeah yeah yeah yeah yeah yeah\n[?] boy like, yeah yeah, yeah yeah yeah yeah yeah yeah\nNigga like yeah yeah yeah yeah yeah yeah yeah yeah yeah yeah yeah yeah yeah yeah yeah\n\n[Outro]\nHey, hey, hey, hey\n[?]\nI'm in the car with the [?]\nPull up and aim at the [?]\nShoot at the prison and shoot at the [?]\nShoot out at Cleveland they shoot at the pigs\nShoot at the problem and shoot out the roof\nShoot at the problem and shoot at the booth\nI'm in a booth then I shoot out the booth, woo\n[?] then I shoot at the truth\nI'm in a coupe in a car with no roof, ooo\nHow can I come and [?]\nCash out them bitches I cash out for bros\nI'm in a hey, hundred k for my toes, ooo\nI'm on a boat\nAye let's ad lib it", "image": "https://images.genius.com/717461618e785def35d07de6484b7ad4.1000x1000x1.png"}], "artist": "Young Thug"}