{"songs": [{"title": "Skate It Off", "album": null, "year": "2016-06-16", "lyrics": "[Intro]\nMic check\nThis the motherfuckin' squad man\nYou know how we fuckin' it up...\nMic check\nWe the Fort Knox squad, watch the cream baby\nReal squad shit man\nLet's go, let's go\n\n[Verse 1]\nWait, I just skated off on the plug, skrr, skrr\nI just skated off like T. Pud, skrr, skrr\nI just skated off, on twelve\nWith the work in one hand like Odell\nWith the work, yeah\nI got eyeballs on the roof, on the roof\nI keep nigga's skulls just for proof, nigga oh\nMoney so tall it could hoop, money go\nI'm high on my I.D, my IG and IQ\nYeah, I just touched down, what's the scoop?\nWhat's the scoop?\nI just hear blasé, blasé, blasé, whoop-de-whoop\nWhoop-de-whoop\nYeah, i just touched down, I'm going for two\n(Let's go, let's go)\nYou just hear AK, AK, AK, doo-doo-doo, doo-doo-doo-doo\nI just touched down, what it do?\nWhat it do?\nMe and all my skaters in cahoots, in cahoots\nBitch, I just skated off like Nyjah Huston, switch\nThink I need a cape like superman\nI just skated off on drugs, on drugs\nI just skated off sippin' mud, sippin' mud\nI just skated off on the Xan, on the Xan\nAnd we just skateboard, we don't dance in our Vans, nope\n\n[Verse 2]\nI just skated off on twelve, fuck twelve bitch\nBout to board slide a fucking handrail\nI just skated off in YSL\nAnd I can eyeball work, fuck the scale, fuck the scale\nI got eyeballs on the roof, on the roof\nMy slimer ollie off this fuckin' roof, fuckin' roof bitch\nI got eyeballs on your squad, pop, pop, pop\nI just skated off like a shot, so deep\nI just skated off with Chaz Ortiz, Chaz Ortiz bitch\nI just skated with some SB's, got some SB's bitch\nI just skated off with Theotis\nI got eyeballs on your whoodies, fuck you, got 'em\nKeep your eyeballs off my guap-o, guap-o\nI just skated off like El Chapo, Chapo\nI just skated off when I chop\nA gun in both hands, bitch I'm 'bout to do the Shaba, Shaba\nTreat a Rolls Royce like a Honda, bitch back up off me\nNigga I'm the God, you Godiva\nShe gon' pop it off for a thug, yeah\nI just skated off on her love, deuces\nI just skated off on the plug\nShe just skated off on her hubs\nI just skated off on a thot, thot bitch\nAnd left her thong wetter than my yacht, why not?\nI just skeeted off in your wifey (get a lot of  hoes)\nWhile I got more cards than a psychic, I'm good\nBlack credit card, nigga swipe it, I'm good\nWe them niggas man\nWe good\nStripes in these streets, call me stripey I'm good\nLong Beep....\nFlying in these streets like a pilot\nTissues for the beef they keep crying 'bout the truce\n\n[Verse 3]\nI just skated off on twelve\nEverything that's in my safe that's for bail\nYeah cause I know nigga's turning snake, we turning up\nYeah, I told my hoe I had to turn the page, she turned to drugs\nDouble barrel double dating double cup\nAnd no matter how hard I fall, I get up, man fuck you going bitch?\nI get up and try again, we call that rebate\nOh your bitch just want this D? Okay it's D-Day\nI get flown off on her PJ\nI'm gon' make my skaters rich, we ain't no cheapskates, no, no\nThat AK got that pop like the TJ\nYeah, in the streets we [?] get them sweepstakes\nFuckboi you a hater, what the streets say\nThese bullets turn your tomato to a v8\nYeah we juuging, we finnesin' very easy\nWe get the squad, looking for another squad to cremate", "image": "https://images.genius.com/145b192e35a3b2e29f30cd355d4f5dbf.595x595x1.png"}], "artist": "Lil Wayne"}