{"songs": [{"title": "4 Verses", "album": "The Freestyle Show", "year": null, "lyrics": "[Verse 1]\n(Aight, aight...Uh...Slim Shady...Yo, yo, yo...)\nIt's only fair to warn, I was born with a set of horns\nAnd metaphors attached to my damn umbilical cord\nWarlord of rap that'll bash you with a two by four board\nAnd smash into your Honda Accord with a 4-door Ford\nBut I'm more toward droppin' an acapella\nTo chop a fella into mozzarella worse than a helicopter propeller\nGot you locked in the cellar with your skeleton showing\nDeveloping anorexia while I'm standin' next to ya\nEating a four course meal, watching you starve to death\nWith an IV in your veins, feeding you liquid Darvocet\nPumping you full of drugs\nPull the plugs\nOn the gunshot victims full of bullet slugs\nWho were picked up in an ambulance\nAnd driven\nTo receiving with the asses ripped outta they pants\nAnd given\nA less than 20 percent chance\nOf living\nHave a possible placement\nAs a hospital patient\nStoring the dead bodies in grandma's little basement\nDoctor Kevorkian has arrived\nTo perform an autopsy on you while you scream \"I'M STILL ALIVE!\"\nDriving a rusty scalpel in through the top of your scalp, and\nPullin' your Adam's apple out through your mouth\nBetter call the fire department\nI've hired a arson\nTo set fire to carpet\nAnd burn up your entire apartment\nI'm a liar to start shit\nGot your bitch wrapped around my dick\nSo tight you need a crowbar to pry her apart with\nMotherfucker, Slim Shady bitch! Recognize!\n\n[Verse 2]\nMet a retarded kid named Greg, with a wooden leg\nSnatched it off and beat him over the fucking head with the peg\nGo to bed with the keg, wake up with the 40\nMixed it with Alka-Seltzer and Formula 44D\nFuck an acid tab, I'll strap the whole sheet to my forehead\nWait until it absorbed in, and fell to the floor dead\nNo more said, case closed, end of discussion\nI'm blowin' up like spontaneous human combustion\nLeaving you in the aftermath of holocaust and traumas\nCross the bombers\nWe blowin' up your house, killing your parents\nAnd coming back to get your foster mommas\nAnd I'm as good at keeping a promise as Nostradamus\nCause I ain't making no more threats\nI'm doin' drive-by's in tinted Corvettes on Vietnam war vets\nI'm more or less sick in the head\nMaybe more cause I smoked crack\nToday, yesterday, and the day before\nSaboteur, walk the block with a Labrador\nStrappin' more corral for war than El Salvador\nFoul style galore\nVerbal cow manure\nComin' together like the eyebrow on Al B. Sure!\nMotherfucker!\n\n[Verse 3]\n(Like this, like that, like this\nLike this, like that, like this)\nI'm the illest rapper to hold a cordless, patrolling corners\nLooking for hookers to punch in the mouth with a roll of quarters\nI'm meaner in action than Roscoe beating James Todd Sr\nAnd smackin' his back with vacuum cleaner attachments\nI grew up in a wild hood\nAs a hazardous youth\nWith a fucked up childhood\nThat I used as an excuse\nAnd ain't shit changed\nI kept the same mindstate\nSince the third time that I failed 9th grade\nYou probably think that I'm a negative person, don't be so sure of it\nI don't promote violence, I just encourage it\nI laugh at the sight of death\nAs I fall down a cement flight of steps\nAnd land inside a bed of spider webs\nSo throw caution to the wind\nYou and a friend\nCan jump off of a bridge, and if you live, do it again\nShit, why not? Blow your brain out\nI'm blowing mine out\nFuck it, you only live once, you might as well die now\n\n[Verse 4]\nYo, yo, yo!\nMy mom sent me up to the store with a food stamp\nFor a pack of cigarettes and a book at the news stand (here)\nTwo dudes ran up and jumped out of a blue van\nI looked down at the ground and picked up a huge branch\nI swung it at the first dude, the other one with him\nSeen it snap so fast, it looked like it broke before it hit him\nSo he tried to rush, I swept his legs, pinned him, and bit him\nHe came back with 6 or 7 dudes screaming \"GET HIM!\"\nI grabbed one,  lit him on fire, pinned, and bit him\nThe next faggot gave me his shoes like they didn't fit him\nOne by one I just kept dropin' 'em in a rhythm\nThen I woke up swingin' the middle of the kitchen\n\n(Damn... damn... damn...)", "image": "https://images.genius.com/b379811c1415017b9f3e3a71b9d26060.400x400x1.jpg"}], "artist": "Eminem"}