{"songs": [{"title": "I Got a Story to Tell", "album": "Life After Death", "year": "1997-03-25", "lyrics": "[Intro]\nWho y'all talkin' to, man?\nUhh, check it out, check it out\nThis, here, goes out to all the niggas\nThat be fuckin' mad bitches\nIn other niggas cribs\nThinkin' shit is sweet\nNigga creep up on your ass, hahaha\nLive niggas respect it—check it\n\n[Verse]\nI kicked flows for ya, kicked down doors for ya\nEven left all my motherfuckin' hoes for ya\nNiggas think Frankie pussy-whipped\nNigga, picture that, with a Kodak, Insta-ma-tac\nWe don't get down like that\nLay my game down quite flat\nSweetness, where you parked at?\nPetiteness, but that ass fat\nShe got a body make a nigga wanna eat that\nI'm fuckin' with you\nThe bitch official, though, dick harder than a missile, yo\nTry to hit, if she trippin', disappearin' like Arsenio\nYo, the bitch push a double-oh\nWith the five in front, probably a conniving stunt\nY'all drive in front, I'ma peel with her\nFind the deal with her, she fuck around and steal, huh?\nThen we all get laced\nTelevisions, Versace heaven, when I'm up in 'em\nThe shit she kicked, all the shit's legit\nShe get dick from a player off the New York Knicks\nNigga tricked ridiculous, the shit was plush\nShe's stressing me to fuck, like she was in a rush\nWe fucked in his bed, quite dangerous\nI'm in his ass while he playing 'gainst the Utah Jazz\nMy 112, CD blast, I was past\nShe came twice, I came last, roll the grass\nShe giggle, saying \"I'm smoking on home-grown\"\nThen I heard the moan, \"Honey, I'm home!\"\nYep, tote chrome for situations like this\nI'm up in his broad, I know he won't like this\nNow I'm like, \"Bitch, you better talk to him\nBefore this fifth put a spark to him\nFuck around, shit get dark to him, put a part through him\nLose a major part to him—arm, leg...\"\nShe beggin' me to stop but this cat gettin' closer\nGettin' hot like a toaster, I cocks the toast, ugh\nBefore my eyes could blink\nShe screams out, \"Honey, bring me up somethin' to drink!\"\nHe go back downstairs, more time to think\nHer brain racing, she's telling me to stay patient\nShe don't know I'm cool as a fan\nGat in hand, I don't wanna blast her man\nBut I can and I will, though; I'm tryna chill though\nEven though situation looking kinda ill, yo\nIt came to me like a song I wrote\nTold the bitch, \"Gimme your scarf, pillowcase, and rope\"\nGot dressed quick, tied the scarf around my face\nRoped the bitch up, gagged her mouth with the pillowcase\nPlay the cut, nigga coming off some Love Potion shit\nFlash the heat on 'em, he stood emotionless\nDropped the glass screaming, \"Don't blast, here's the stash!\nA hundred cash! Just don't shoot my ass, please!\"\nNigga pulling mad Gs out the floor\nPut stacks in a Prada knapsack, hit the door\nGrab the keys to the five, call my niggas on the cell\n\"Bring some weed, I got a story to tell,\" uhh...\n\n[Outro]\nYo man, y'all niggas ain't gonna believe what the fuck happened to me. Remember that bitch I left the club with man? Yo, freaky yo. I'm up in this bitch playa this bitch fuckin' run them ol' Knick ass niggas and shit. I'm up in the spot, so. I don't know, I don't know. One of them six-five niggas, I don't know. Anyway, I'm up in the motherfuckin' spot. So boom I'm up in the pussy, whatever whatever. I sparks up some lah, Pop Duke creeps up in on some, must have been rained out or something  because he's in the spot. Had me scared, had me scared to death, I was shook, Daddy—but I forget I had my Roscoe on me. Always. You know how we do. So anyway the nigga comes up the stairs, he creepin' up the steps, the bitch all shook she sends the nigga back downstairs to get some drinks and shit. She gettin' mad nervous, I said fuck that man! I'm the nigga, you know how we do it, nigga, ransom note style put the scarf around my motherfuckin' face. Gagged that bitch up, played the kizzack. Soon this nigga comes up in the spot, flash the Desert in his face he drops the glass. Looked like the nigga pissed on his-self or somethin, word to mother! Ahh fuck it. This nigga runs dead to the floor, peels up the carpet, start givin' me mad papers, mad papers. (I told you that bitch was a shiesty bitch cuz! Word to mother I used to fuck her cousin' but you ain't know that! You wouldn't know that shit. Really though.) I threw all that motherfuckin' money up in the Prada knapsack. Two words, I'm gone! (No doubt, no doubt... no doubt!) Yo nigga got some lye, y'all got some lye? [conversation fades out]\n\n[Produced by Buckwild and Chucky Thompson]", "image": "https://images.genius.com/f4413efc6682e8c2cfa7a01117fc8cd5.1000x1000x1.jpg"}], "artist": "The Notorious B.I.G."}