{"songs": [{"title": "The Glow of a Thug", "album": null, "year": null, "lyrics": "[Verse 1]\nSome friends turn foes over money and hoes\nWhen they family ain't tight, when they money ain't right\nWhen you party with me, you party all night\nCause I ain't with doing nothing if we ain't doing it right\nPlayers hate us when they getting face-to-face altercations\nThey be getting played like Sony Playstation\nWhen the feds having fun, cockblockers try to stop me\nI heard some cats be in the background trying to clap me\nI see them when they start scheming, I know what they thinking of\nMad at us for being players and they can't get no love\nWhat it boil down to, cause my flow's hot, your flow's not\nYou're so-so going against 50 Cent, that's a no-no\nY'all know better than that\n\n[Hook]\nFlowers blooming, morning dew, and the cats just ain't the same\nIt's a pleasure when you treasure all that's new and true in the game\nEasy living while we're pimping what we know we're dreaming of\nWe are one having fun walking in the glow of a thug\n\n[Verse 2]\nFirst it was me and my pistol, but since the last mistrial\nSpin up a Cristal, I'm living it up\nMy lawyer, K.O.'d the case, checked the lawbook for my name\nI sit in courtrooms and throw signs like I'm a Mason\nMoney is power, envy is cash, breed evil\nI could be robbed with the jewels I drop\nCame into the store a year ago\nI decided to stack chips on the whip\nPush the hoot, now I be sitting on Beach Huevo\nContemplating coping the Coupe... Hmm, should﻿ I?\nGhetto as I wanna be, I say \"What up dude?\"\nWhen I breach you serve you bricks, through time to beat you\nSend you back if you headed to your people\nThrew out my chest when I make power moves like I'm right on the L\n\n[Hook]\n\n[Verse 3]\nYou wanna, party with me, come on, party with me\nOh, you don't wanna party with me, it's aight with me\nShorty, what's your favorite champagne, Cristal, Moet or Dom P?\nLighten up, get a bottle boo, but it ain't on me\nI'm caught up, in my ghetto way of thinking\nFrom the ice, to the minks, to the champagne we drinking\nBig boys is playing Benzos with AMG kits and 20 inch Lorenzos\nFollow me, round and round, the club\n3 and a quarter drop-tops with hard tops\n20 whips for chip; that's it. Average joes who flip bricks\nMy team flash keys like they grow on trees\nWhen it's hot, park the whips and ride bikes\nIf you [?] through traffic on the turn-bikes, aight", "image": "https://images.genius.com/3ac0369e9af7e95b4d1574832fafebfe.430x430x1.jpg"}], "artist": "50 Cent"}