{"songs": [{"title": "Spot Rusherz", "album": "Only Built 4 Cuban Linx…", "year": "1995-08-01", "lyrics": "[Intro: Wu-Tang's St. Ides commercial plays in the background]\n(Conversation between Rae and Ghost)\nYou know what I mean, you comin', you comin' lookin' flavorful, you know what I mean? You the whole, you the whole shit of the whole night\nBut I seen it though. I seen it though like a Zenith, you know? My G's too futuristic for that shit, you know what I'm sayin'?\nWord. You just trying to get a little swerve kid on 'em?\nTried to man, know what I'm sayin'. Just couldn't pull it off. Just couldn't pull it off because of the drawers. Fuck that mess though. But yo though, on the real, yo yo, some nights it feel like a nigga get burnt\nYeah, yeah\nIt's like you hear something tomorrow Rae. Something like \"Yo, Flozzy Flozz\"\nIt's the wind, I'm tellin' you. It's the air, I can feel it\nIt feel hot, it feel hot at night and shit, like the sun ain't even out. Sun don't shine though but, you know what I'm sayin'?\n\n[Verse: Raekwon]\nYo! Can you feel me?\nStorytelling rap Magellan I ain't telling\nThem niggas ran in the spot for selling\nWord up, pushed up, man got mushed up\nSeen him at a rap show acting like fat cat though\nGlasses gold, shining like a real big boy\nThis nigga had mega ice on Chips Ahoy!\nCats surrounded, this political brown kid\nAll out the wind yo, my man walked in\nPulling mints out son had mad clientele\nOrder me Cristal twice Kion, chill!\nWatch them niggas, a-yo that clique's from outta state\nThey bubble weight in Far Rockaway with Blake Carrington\nYou know the kid with the most dough getters\nAnd Anteras on fat shit clique they rock Lo sweaters\nThat's my man, that's my man too\nCall him up on the strength of the Wu\nAnd watch me gain duke\nGrab the cell, I got a heist to pull off well\nAt the end of the week, I'm buying you a L\nLexus nigga, I ain't talking bout Hancock\nNo time for weed plus no time to get locked\nThat night, up in the staircase\nCousin had me laced out, skeed all outta my face\nWe gon' get dat crunchy chump for all of his lump\nDon't try to front, you was sweating this Hilfidiger\nGuess who walked in having it, his man from Farragut\nConfront him with the Ruger on his back, walk in black\nWhere's your man, where's the sky blue Land at?\nStop playing Wu in the back, smacked him wit the gat\n(Yo, money said he be here in fifteen!)\nHe's not lying, wait for the Millenia green to pull up\nHe got the Donna Karan shit on, two rings\nSix carats a piece plus the chain swings\nLike anchors on ships flooded with all diamond chips\nBack pockets: two clips - four-fifths wit rubber grips\nLaying, two bottles of brass I was slaying\nMeditating, red dot be waiting for my payment\nHeard the key in the lock, cocked the Glock\nTurn the lights out, dip behind the couch\nKion, gag his mouth\nInfra-red at his head when he entered\nButter soft Perry Ellis leather with Dorinda\nA friend of, Kion's wife, Kenya, the bitch larger than life\nYo, shorty be fucking mad Colombian niggas\nFuck it, get on the floor meet the black Lex Luthor\nStrip fast, the bitch had on Claiborne drawers\nYo Rae I'm about to scrape her, chill Ghost\nThought for a second, turned around\nThrew the nine in his meatloaf\nYo, where's the cash and the stash that's mixed?\nI don't know!\nShot his hand, he started screaming like a bitch!", "image": "https://images.genius.com/e336a632db4d1dd7b6d848646b5d5ffc.876x876x1.jpg"}], "artist": "Raekwon"}