{"songs": [{"title": "The Mind", "album": "The Sneak Attack", "year": null, "lyrics": "[Hook x2]\nFirst thing we must do is make up our - MIND\nThen we must go and really clear our - MIND\nErase the doubt and the fear from our - MIND\nShare our - MIND, speak our - MIND\n\n[Verse 1]\nStand up brother, stand up sister\nI told y'all before, love is gonna get'cha\nLovin that money, lovin that liquor\nLovin that sex without respect you gets no bigger\nI ain't got time to chill, only got time to build\nYou find that in those with skills\nThis a real MC, of the highest degree\nWith no video, my show they dyin to see\nNot whether I'm buyin 'em three\nWhen you watch television just keep sayin they lyin to me\nCause they are - how long you gonna stay at the bar?\nI'm not desperate for money, maybe you are, but listen\n\n[Hook x2]\n\n[Verse 2: KRS-One]\nDon't you think it's time we thought about the future?\nWhether our children they gonna be winners or losers?\nDon't you think it's time to advance the rhyme we spit?\nWhether you know it or not, you deep in politics\nAll inside of it, in fact YOU the issue\nDon't let this government diss you!\nThey really do not want you to vote\nThey really do not want you to hope\nThey really want you sniffin' they coke\nYou look around yo we missin' the boat\nI could've wrote about ANYTHING to get on, but this what I wrote\nAnd what I'm writin', is guaranteed to enlighten\nLike Dr. Cornel West, Michael Eric Dyson\nThis is how we do it today, enough of the crime talk\nKRS got somethin' new to say\nRise up, and put aside childish things\nThis is the message we bring; listen\n\n[Hook x2]\n\n[KRS-One]\nLast verse, KRS, blast first\nIgnorance is bad, but temptation that's worse\nThey hide they purse, cause of the way we spit the verse\nNo one ever told 'em that the style's rehearsed\nAnd even if they did, it wouldn't be new to they mind\nCause all day rappers confess to doin' these crimes\nSo when the cops see you, they're not thinkin' about me\nThey thinkin' about takin' you out of society\nKeep it right, don't lie to me\nYou think it's too much preachin' teachin'?\nHuh, well fine, we'll see\nWhen you're locked up in J.D.C., or even prison\nThe truth shall set you free, just listen\nYou want health, and really that's about prevention\nYou want love, real love, and not depression\nYou want awareness, which come from discipline and will\nYou want wealth, which come from skills\nWhen you really ready to talk, let's build\nYou ain't gotta be a scholar to know the next 4 years gonna be ill\nI believe you already know the drill, don't lie\nDon't steal, seek peace and don't kill\n\n[Hook x2]", "image": "https://images.genius.com/756508fbcbfc3c6ac80f412ee6f089bd.1000x1000x1.jpg"}], "artist": "KRS-One"}