{"songs": [{"title": "Centurion", "album": "Doris", "year": "2013-08-20", "lyrics": "[Intro: Earl Sweatshirt]\n\"Yeah... me? Yeah, yeah, yeah. I'm just tryna say somethin' before... I... I... drop it off.\"\n\n[Verse 1: Vince Staples]\nI feel like the Tom Sawyer for real niggas\nLooking for a problem, revolver under the Hilfiger\nNo bluff needed, we will kill niggas\nSo try me if you want, bruh, I promise I'm with all of that\nLate night shooters, got 'em thinking Johnny Carson back\nTrying to win this white man's game with my heart intact\nAll off a dollar and a dream that I really had\nKind of hard to sleep when your thoughts is in the streets\nNorf norf is the side where my family stay\nBig Baby Jesus, I can't wait\nUntil the money coming in, spend it all on guns and rims\nI ain't nothing but a nigga, ain't no reason to pretend\n\n[Verse 2: Earl Sweatshirt]\nKept his sticky in a Stussy pouch\nSki mask, bloody 'Preme hoodie tossing doobies out\nThe window of the hoopty, night black as Paul\nMooney at the movies but the moon was out\nFood was always optional\nEating nothing but hard punches to that abdominal\nClosed fist chronicles, sold sniff, Momma knew\nBaggies laying 'round, peanut shells at a carnival\nStomping clowns, welcome pussy niggas to the romper room\nBuckshot'll cover a whole torso like a parka do\nIn a park at two, plotting, trying to garner loot\nSplit it with his big road dog, call him Marmaduke\nSearching for a shard of truth and found uh\nCouple bucks bought his cousins lunch\nAnother Dutch, stiff collar on the button-up\nHood, rich, wild, and 'bout to run amok\nRoad to Hell paved with cement\nCovered trussled drugs, toughen up\n\n[Hook: Earl Sweatshirt]\n\"Well, alright. Okay\nIf that's how you truly feel about it, then\nAlright, okay\nIf that's how you truly feel about it, then.\"\n\n[Verse 3: Earl Sweatshirt]\nVinny Stape, they stupid, think the city safe\nUntil that little bindi placed, headshots, red dot\nBlock as hot as Denny plates, fed watch, Fed watch\nOpinions only pity based, deep in the Civic with the\nEvilest niggas this side of the Mississippi\nAll courtesy of Vincent from niggas who plot against\nEar-L-double-S, hear shells from the Tec\nHear in full-effect, eat a dick and cut a check, bitch\nFew niggas I'm on a first-name basis with\nAddress him by the alias, that trunk weighted like he\n'Bout to catch a case again, eighths louder than the voice of\nSatan that be plaguing him, bruh, I'm caking\nWhether Hell or bad weather, high water, I'm a sailor-type\nAssailant for the paper, living like I met the maker twice\nHit it 'til I'm faded right? Mami, take a hike\nOr treat it like you fucking shaking dice, bitch\n\n[Hook: Earl Sweatshirt]\n\"Well, alright. Okay\nIf that's how you truly feel about it, then\nAlright, okay\nIf that's how you truly feel about it, then.\"", "image": "https://images.genius.com/4ffe0cff138a9901c8034b4cf5a92b79.630x630x1.jpg"}], "artist": "Earl Sweatshirt"}