{"songs": [{"title": "You Don’t Eat", "album": "Top 5 Dead or Alive", "year": "2015-11-20", "lyrics": "[Interlude: Diddy & Jadakiss]\nThink I'm talkin' 'bout some money?\nNiggas on my comments page sayin' \"Damn Diddy, leave some for the rest of us.\" (Uhuh)\nNigga you don't hustle you don't eat! (Point blank)\nYou don't hustle you don't eat, nigga! (Fuck that!)\nHustle hard, you ain't never goin' hustle hard as me. (Top 5)\nYou think I do this shit for the money? (HA-HAAAEEH!)\nI do it 'caus-\n\n[Verse 1: Jadakiss]\nWaited for luck it never landed (nah)\nStuck on your block forever stranded (yeah)\nI live by the 10 Crack Commandments\nEither you earn respect or you demand it\nIt’s the liquors vs the reefers\nIt’s the angel versus the reaper (uh)\nYou might not know but it gets deeper\nYou heard my name on the last verse of Ether (woo!)\nYou gotta come to the hood if you want to reach us\nI’ll lay you down in the earth right underneath us\nSame town just the poor parts\n'Cause the beggars will disappear when the war starts\nI’m still out here dog, I got war scars\nYou know me I'm from the bottom where the floor starts\nWhen you street smart money your report card\nI got the deck now I can pull a boss card (Top 5...)\n\n[Interlude: Diddy & Jadakiss]\nJust listen\nJust listen\nI'm giving you the blueprint to get it out here (Uh-Huh)\nAnd you don't want to do what it takes. (Nah)\nYou want to stunt on your Instagram- (These niggas is playin')\n-Takin' your motherfuckin' selfies and you ain't hustling hard (Yeah)\nHA-HAAAEEH! HA-HAAAEEH!\n\n[Verse 2: Jadakiss]\nYeah, by any means whatever it takes (whatever)\nMore or less life or death whatever the case\nIt's all about your stamina it's never the race\nRe the bank back up if you ever ace (uh)\nHate so official they try fending you (uh)\nWhen you die they don’t miss you they just remember you (yeah)\nI sat down with the devil and did an interview (ha)\nI shot rounds with the rebels I'm with the criminals\nI put an end to you (yeah)\nI save all the small talk for the interludes\nI ain't finna lose I’m in a winning mood\nI'm with the winning dudes  (uh)\nWe good in every hood, my niggas been approved\nToo much air, nigga, they gonna pop your inner tube\nThe works A1, yeah nigga and it moves\n40s of coke in the sports bar\nI’m still shining like the North Star (uh)\nYou just another nigga lost pa (yup)\nI got the deck now I can pull a boss card (Top 5...)", "image": "https://images.genius.com/9446bcee74c95e2da1688d832878aa59.1000x1000x1.jpg"}], "artist": "Jadakiss"}