{"songs": [{"title": "Queens Wolf", "album": "The Lost Tapes 2", "year": "2019-07-19", "lyrics": "[Verse 1]\nAt fourteen tried out for the ball team\nJunior high, they denied me\nI shot bricks that made the backboard scream\nFightin' Italian rival gangs, they was sniffin' glue\nI was skippin' school, smokin' green, that was the shit to do\nStole somebody team jacket at practice, slept through my classes\nThe borough Queens, so it's rep the Q to the casket\nAverage student, had illusions of the supernatural\nHorror movie addict, werewolf fanatic and Dracul'\nOne night after school and train hoppin' and snatchin' jewels\nI dozed at midnight, woke up a little after two\nMy hands shook violently\nMy eyes took red\nMy hair spun in ways\nBread was the only word I said\nI heard voices in the nights calling, the Benz engine roaring\nHeard that gin and champagne pourin' and niggas ballin'\nI put the .22 on my waist\nThe face in the moon had a mean look\nI transformed to the Queens wolf\n\n[Chorus]\nYou could hear me growlin' through public housin'\nNo telling, might wake up in Queens house or Rikers Island\nA Queens wolf\nLadies wanna get beside him\nIf haters try bussin' the silver bullet inside him, they dyin'\nYou could hear me growlin' through public housin'\nNo telling, might wake up in Queens house or Rikers Island\nA Queens wolf\nLadies wanna get beside him\nIf haters try bussin' the silver bullet inside him, they dyin'\n\n[Verse 2]\nWaking up is a pleasure though last night I can't remember\nCash up on my dresser, where'd it come from?\nThis is messed up\nWhat kind of fatal drug am I taking? who laced it?\nPrevious night, memories who erased it?\nWasn't even wasted\nI do recall the nightfall, lunar, the stars around it\nThen my man called, said what I did, the goons were talkin' 'bout it\nSingin' me praises, said I lit the corners up\nIt sounded like Vietnam screamin' out \"QBietnam\" the loudest\n\"Homie them dudes is scared you gon' spray 'em, word to Bing\nThey'll do anything, pay you real good to be on their team\"\nSo that explain the money and the chains that's on my dresser drawer\nThat wasn't there a day before, I should press 'em all\nBut I be on some cool shit, nigga, my QU shit\nAudemars watch, burn a peach Swish', new whip\nStoli' vodka, club soda with my new chick\nAh shit, teeth showing, snarling when the moon's lit\n\n[Chorus]\nYou could hear me growlin' through public housin'\nNo telling, might wake up in Queens house or Rikers Island\nA Queens wolf\nLadies wanna get beside him\nIf haters try bussin' the silver bullet inside him, they dyin'\nYou could hear me growlin' through public housin'\nNo telling, might wake up in Queens house or Rikers Island\nA Queens wolf\nLadies wanna get beside him\nIf haters try bussin' the silver bullet inside him, they dyin'", "image": "https://images.genius.com/91da51c7ed14c805c492a0346f54d465.1000x1000x1.jpg"}], "artist": "Nas"}