{"songs": [{"title": "Used to Hate It", "album": "Young Sinatra: Undeniable", "year": "2012-04-30", "lyrics": "[Verse 1]\nYeah, bitches be pressed for paper\nChillin' with my homie SlayDro while he ignites the vapor\nLife is a bitch and you cannot escape her\nUnless you talking suicide\nWhat the fuck you mean that I'm changin'?\n'Cause I finally gotta little bit of money and a range in\nMy drive way with a Rattpack smoking on Zimbabwe\nCrankin' Sinatra, that \"My Way\"\nBitches they love it, Visionary nothin' above it\nGet shorties wet when I rub it, carbon copies they dub it\n\n[Chorus]\nYou used to hate it, now you love it\nSmile in my face? I think nothin' of it\nYeah, I shake your hand, kill em' with kindness\nHomie, this is Young Sinatra at his fuckin' finest\nYou used to hate it, now you love it\nSmile in my face? I think nothin' of it\nYeah, I shake your hand, kill em' with kindness\nHomie, this is Young Sinatra at his fuckin' finest\n\n[Verse 2]\nYeah\nThis is for my independent women that is runnin' shit in high heels\nEducated in business but majored in sex appeal\nMy shorty she gotta, sportin' Gucci, Louis and Prada\nLooking beautiful in it all but I prefer nada\nYeah, low maintenance and high scale\nType of shorty that when you get locked up she pay the bail\nI used to follow my dreams until I caught up to em'\nPeople talking shit but pay attention to what we doin'\nIt's never been done, watch me go platinum just for fun\nFar from materialistic, but let me stunt son\nYou know what I been on, you know where I be at\nThe proof is within the numbers, they slumber but now they react\nI got three tapes, zero tolerance, one of the greats\nPut that shit together and what you get that's where I'm from\nThe 3-0-1, smoking joints with your girl for fun\nStand strong and never run 'less the POPO go for the gun like\n\n[Chorus]\nYou used to hate it, now you love it\nSmile in my face? I think nothin' of it\nYeah, I shake your hand, kill em' with kindness\nHomie, this is Young Sinatra at his fuckin' finest\nYou used to hate it, now you love it\nSmile in my face? I think nothin' of it\nYeah, I shake your hand, kill em' with kindness\nHomie, this is Young Sinatra at his fuckin' finest\n\n[Verse 3]\nYeah\nWe snatch it like interception\nMet the girl of my dreams, her love resembled inception\nHer sign was a leo, me, her, and music, that's the perfect trio\nSpanish hunny we met in Rio, future lookin Cleo\nBitches be braggin', so much money my pants saggin'\nVMG is up-to-date but these businessmen be laggin'\nEve bit the apple and Steve changed the world\nGetting money like Zuckerberg, my bank account is sterol\nI am not defined by that in which I do possess\n'Cause all it takes is riches to get bitches to undress\nI need drive in a lady, not a girl that drive me crazy\nNeed a girl that don't care if I drive a Honda or Mercedes\nSpit fire like Hades, I infect it like rabies\nIt's all that, shout out to them '90s babies\nNever hesitate to supply the heat\nWhat 6ix produces from his chest, we call that shit a heartbeat\nI'm a king, you fuckas my pawns\nShortcut to the desktop, I am your newest icon\nThese bitches they love it, I truly can't stress it enough\nGirl, got them daddy problems that's why she be actin' tough\nInnocent in person, but in the bed she love it rough\nRunning away from reality to sniff coke and puff\nSo, let me get it the second I spit it you know that I did it everybody wanna come around\nThey used to hate it, but now they love the sound\n\n[Chorus]\nYou used to hate it, now you love it\nSmile in my face? I think nothin' of it\nYeah, I shake your hand, kill em' with kindness\nHomie, this is Young Sinatra at his fuckin' finest\nYou used to hate it, now you love it\nSmile in my face? I think nothin' of it\nYeah, I shake your hand, kill em' with kindness\nHomie, this is Young Sinatra at his fuckin' finest", "image": "https://images.genius.com/4cb73fd1e86a44f861bc4ba694c17126.1000x1000x1.jpg"}], "artist": "Logic"}