{"songs": [{"title": "It’s Time", "album": "Kuruption!", "year": "1998-10-06", "lyrics": "[Kurupt]\nDV....\nDV..\n\nYo we trying to make the cash ya'll without a doubt\nRepresenting both coasts what you roaming about?\n\nVerse 1:\n\nYo, yo, yo, yo, yo, yo\nFuck this who wanna bring the ruckus\nYo I know they know they ain't fucking wit' no fucking suckers\nYou's a live ass snitch\nWell shame on the name we might bust your shit\nAnd throw mad game nigga and push your whip\nAnd shake them thangs and hit four, five six\nBelow you ain't know get at me\nSean Donn, Hemp dogg and moe\nIt's a bomb type weed now I'mma count my dough\nThe cops'll watch your do'\nSo let them niggas and now they ain't know it befo'\nAnd if them niggas not swipe\nWe'll grab the 4-4, Mag-num\nCause I hate it when niggas act dumb\nDamn, why they make me wanna pull out a gun?\nFirst name's Camille, Camille's name be on\nWhen you creepin' on the real with my word is bond\nSee catch me out in the night pouring style and form\nAnd that venomous shit is what my bitches be on\nBitches, bitches be on\nMy bitches, bitches be on\n\nVerse 2:\n\nYo, yo, yo\nI'mma give you something in rhythm feel\nYa'll need be loco\nDig a hole in you bolo\nLook out for dolo\nEspecially if you acting brolo down for dolo\nOn the creek and point anything sleep\nYa'll can see it when we roll we coming Mobb Deep\nWe be coming, on the regular we be coming\nBaby what? tearing shit up with your worry\nMaking me deam stacking up that man for CREAM\nTorch the green have you all open like beam\nHear me ya'll so 'n when you gimme yo just gimme\nThat microphone I been the baddest run down your digits\nShorty gettin' played like a midget\nAiyyo, I'm in it you wid it for me and my bitches\nNeed 'em to throw your pitches\nHaving you leaving your misses\nWhat I got to do is this\nHand me your business, step off my premises\nOr things are gonna get serious and devious, WE BRAVE\nAnd we can drive you all insane like Johnny Blaze\nYeah we always Bring The Pain and Misdemeanour\nKnow we can't stand the rain\nLet's bring the pesos stack 'em up by the case load\nCause we can reload, cock back and explode\nCock back and explode\nCock back and explode\nCock back and explode\n\nChorus:\n\nAiyyo, we trying to make the cash ya'll wid out a doubt\nRepresenting both coasts what you roaming about?\n\nVerse 3:\n\nI'm in the south ya'll going all 'bout cha'll\nThe name is the Python you know what I'm about ya'll\nYo, yo, yo\nI pop bras like Bruno\nI take your money from shooting rap to uno\nUsed to rock to minudo one of them was kinda cute though\nI had a crush like a DAT\nNow I try to master phones like that\nCarolina be my home town\nStill living with my parents even though I'm grown now\nTime to roam now\nI don't think that ya'll can handle us\nMade our mark in the East now we hitting Los Angeles\nYou can't delust a man wid lust\nWhen I been up on the mic you can never get enough\nMake you palms wet and I ain't even gettin' calm yet\nClear the premises time to make another bomb threat\n\nChorus\n\nVerse 4: Kurupt\n\nI'm from the West ya'll\nBringing niggas stress ya'll\nForget the strapping now you settle wit the best ya'll\nYo, yo, yo, yo, yo\nThis is one time that I ain't playing wit niggas\nThe homey stomped it and I'm spraying with niggas\nI got the cash to have keys to blast\nYou a sucker nigga\nSucker punk MOTHERFUCKER NIGGA\nI DON'T GIVE A FUCK MOTHERFUCKER NIGGA\nTrying to strip me a my Vans that's all I gather man\nMr. Matter of fact, Calicos and dates\nWhat you want to get your shit lit to Blaze\nLike Johnny you can play like Ricky Davoni\nBut you ain't a player nigga\nAin't got the heart to lay a nigga\nAutomatic spray a nigga\nSoon as I came went like calm in the Grand\nBustin dumb dumbs leaving niggas numb\nI don't give a fuck where the fuck you're from\nIf it ain't about loot then I'mma shoot and run\nWhat you supposed to be, Raw?\nRaw is as raw does it ain't raw dog\nBust a five star dog, I want all ya'll\nI know the niggas know where the weed be\nIt's the live shit need to be\nFucking round in my decent (nigga)\nHitting motherfuckers like a vic (nigga)\nSaturate like a sieve (nigga)\nTake a toke and get blown\nYa'll step up and watch your homey explode 'n unload\n'xplode and unload\n'xplode and unload\n'xpload and unload\n\nChorus\n\nVerse 5:\n\nWe from the East ya'll bringin on the piece ya'll\nDirty kid wanna hit that wid a leash ya'll\nI be the mic wrecker\nSpinner One coming through wid the double decker\nDouble pound in your crew Uhhh\nForced to recognise make arrive\nDon't have to par and block you\nWe just break you down to normal size\nYou couldn't shine if you had the sun in your back\nYou wack, I burn you down like I corner that\nDoggy, QB style you know my steeze\nI'm on the kill now with my Queen Killa Bees\nViper, break more backs than Paul Backland in Kahkland\nNigga deny drama could happen\nFirst test my skills\nI came to rap shit for real\nVenom Squad be the only squad that be ill\nFirst of all I ride your back like a jackass\nJack still loose on the chaka with the L\nComing from the East representing both sides\nKurupt, the Venoms, that's how we keep it tight\n\nYo, we trying to make the cash ya'll without a doubt\nRepresenting both coasts what you roaming about?\n\n[Kurupt]\nYo I'm from the West ya'll\nBusting cuz a stress ya'll\nFuck the best ya'll\nMotherfuck the rest-a ya'll niggas\n\nChorus (3x)\n\nGangsta style...\nUhh, Uhh\nProtect ya Neck\nMassive\nPoison plants", "image": "https://images.genius.com/a7652517cf446c15e882aa0bc85229b3.594x594x1.jpg"}], "artist": "Kurupt"}