{"songs": [{"title": "The Old Fashioned Way", "album": "What’s My Favorite Word?", "year": "2002-09-10", "lyrics": "[Intro is continued talking by \"Pimpin' Ken\"]\n\n[Verse One]\nWhat you rhyme mayne?  You always spend G's\nHow much cash you got that you can lend me?\nThink I'll pay you back, think you flossin hard\nWhen you ridin down the strip in yo' boss's car?\nWith your silver chain on and your fake diamonds\nCain't do it right but you stay tryin\nYou got big dreams, to hit a lick quick\nAnd buy a brand new house, but you ain't get shit\nWouldn't even know what to do if you had bread\nHow to be a baller - can you pass the test?\nThere's more than one way to hit the top\nTrunk full of dope nigga don't get stopped\nTake it to the house and bag it up\nMake that money and stack it up\nOr spend it all in one place, what you want from me?\nI can't tell you how to run yo' company\nAnd don't start bitchin bout Too $hort\nWhat the fuck I wanna listen to you fo'?\nLook at you, you ain't all that successful\nThem plates ain't made out of Cristal\nYou just regular, plain ol' frontin\nYou come from nowhere and you don't claim nuttin\nStop bein phony, actin hella hard\nGirl at the mall, maxin your credit card\nAnswer your cell phone, now you smilin\nTalk to your girl, man it's been a while\nSince she left to go shoppin, girl where you at?\nShe out havin lunch with a player mack\nI'm in the background, don't trip partner\nJust munchin on the lunch that your bitch bought me\nShe don't love you, she just used to you\nGot your mom and them wonderin what she do to you\n\n[Chorus]\nI don't pay hoes, I turn 'em\nI teach hoes, you learn 'em\nHow we get them hoes, don't concern 'em\nThe old fashioned way, we earn 'em\nI been in the game, I did it\nI'm true to the game, I'm so committed\nI got a lot of hoe money, where you get it\nThe old fashioned way, I just spit it\n\n[Verse Two]\nI'm pimpish, I never let hoes pimp me\nI let one bitch get me, and instantly\nShe dipped to Mexico, I'ma get you hoe\nI'ma find you and check you like a physical\nI'm not a doctor, but I cut a bitch open\nWith this game have her broken never quit hoein\nA bad habit, I picked up along the way\nBreak a bitch, and make a new song every day\nI do my own thing, I'm original\nI was \"Born to Mack\" when I came in the do'\nJust so you know, I got the game from the East\nLake Merritt(?) to Sobranny(?) in them East Oakland streets\nTook my game on the road, became a millionaire\nTell the world get ready for a real player\nAnd so it happened, I grabbed the mic and start rappin\nMake that money keep stackin\nI made a new album, fourteen times\nHoes screamin out Too $hort keep rhymin\nI got rich screamin BITCH\nMy favorite word; I hear it on - E'RYBODY shit\nAnd when they say it like me, I couldn't want mo'\nSend a special thanks out to yo' Uncle $hort\nDo yo' thang nephew, y'know I'm down witcha\nStay strapped, watch yo' back, don't let the town getcha\nAnd when you get mad, try to use your brain\nGet some street etiquette, don't abuse the game\nYou know us real ones, you know we never bite\nWhen these hoes start shit you know we never fight\nCause I'd be layin on the ground feelin real silly\nAll I did was fuck his bitch, that nigga still killed me\nAnd even though I know a sucker spent all his cash\nJust so he could fuck and try to get some ass\n\n[Chorus]", "image": "https://images.genius.com/5b217fd6496369f950dd5a8a14ae52aa.1000x1000x1.jpg"}], "artist": "Too $hort"}