{"songs": [{"title": "The Best of Queens (It’s Us)", "album": "The Professional 2", "year": "2001-02-27", "lyrics": "[Prodigy]\n\nUh huh, yeah\nCluminati..\nQ.B. (New Mobb Deep)\nFor the year 2G\n(Best of Queens)\nNiggas know what the fuck I'm talkin bout\nIf they don't hear, how they know?\n(It's the DJ Clue)\n\n[Verse 1: Prodigy]\n\nNigga we don't play that shit, and spray that clip\nYou frontin ass nigga, we slay that kid\nWe never drink champagne in the club we got the Henney up\nWe copped a Chevy truck jew bangs be heavy plus\nWe got the halls poppin\nWe got the dance floor movin back, when we start wylin\nOnly when they play our shit, you reach for my chain\nWe gon bang, we scuff niggas, we cut niggas\nWe slide wit da bitches\nAnd hypnotized by the piece swingin back and forth from Queens niggas\nWe thug ya party out lock down the bar section\nWe never check our coats, cuz we got the toast\nThink about it\nM.O.B. double D. E. double P. kidd, flee 'fore you bleed\nAnd for y'all fagget ass rappin ass niggas\nY'all put out hits, we put out classics\n\n[HOOK: Prodigy]\n\nWe turn bitches out, take turns in that bitch mouth\nCarve niggas up, show niggas what it's all about\nIt's Us, the best of Queens, Q.B. Bailsey 40 D\nWe turn bitches out, take turns in that bitch mouth\nCarve niggas up, show niggas what it's all about\nIt's Us, the best of Queens, Rockaway, A.Q. get attitude\n\n[Verse 2: Havoc]\n\nNiggas gel on the strength talk shit when they bent\nMad can't pay they rent fuck em pardon my french\nMisery love the company that I refuse to offer\nTryna put me in the mix of they petty drama\nDown the dollar if you wanna be a top can't follow\nOnly reason they guh'head I'm went a little harder\nFour starters movin too quick, to live a little large chicks\nOn my dick cuz I be the one that's comin\nNiggas don't play they hands right, fuckin wit they dealt wit\nLeave witout the heater's like four witout the fifth\nEat a dick all you Jherri Curl niggas follow the drip\nThen, maybe you could find what my Mac spit\nLaugh at, half ass wanna be killers make ya gat blast\nThen maybe I repsect ya half ass\nIt's the streets that raised me, mah dudes is pray for me\nI'm layin for them, they layin for me\n\n[HOOK: Prodigy]\n\n[We turn bitches out, take turns in that bitch mouth\nCarve niggas up, show niggas what it's all about\nIt's Us, the best of Queens, Lefrac, Hollis where y'all at\nWe turn bitches out, take turns in that bitch mouth\nCarve niggas up, show niggas what it's all about\nIt's Us, the best of Queens, (41st side)\n\n[Verse 3: Prodigy]\n\nYeah yeah, I ain't rockin witchu neither bitch\nI'm a grimy ass rich nigga\nCatch me bombed out wit the Rolls Royce\nI might drive through a puddle and splash you, you trash is all\nI give a ho what she askin for\nIt be the Dom P., but not the bottle\nI keep broads by the brothelos\nShape and mold em like waffles\nCall em by the palm, get up in they ear like 'Uhh' make a dike wanna turn\nMake a slut act, other than herself like she don't fuck\nLike she don't be gettin stabbed up, I tear that ass up\nThen they wanna know if there's more where I came from\nSo I bring em to my Dunns and spread love.. (40th side, Vernon)\n\n[HOOK: Prodigy]\n\n[We turn bitches out, take turns in that bitch mouth\nCarve niggas up, show niggas what it's all about\nIt's Us, the best of Queens, Lefrac, Hollis where y'all at\nWe turn bitches out, take turns in that bitch mouth\nCarve niggas up, show niggas what it's all about\nIt's us, the best of Queens, Corona south side, Q. Village, my killaz\nMy QB niggas\nM.O.B.B niggas", "image": "https://images.genius.com/967e3d9ee88663c5a43e11adcecd9bcf.500x500x1.jpg"}], "artist": "Mobb Deep"}