{"songs": [{"title": "Paradice", "album": "Rebirth", "year": "2010-02-02", "lyrics": "[Verse 1]\nMoolah babe\nShe was a young girl in pursuit of glory and fame\nShe would do anything she could to feel the flame\nWhen everybody know your move and the things you pay\nShe finally made all her dreams come true and then she screamed\n\n[Hook]\nOh no, this ain't paradise! Oh no, this ain't paradise!\nOh no, this ain't paradise! (Yeahhh)\nOh no, this ain't paradise! Oh no, this ain't paradise!\nYou know, this ain't paradise\n\n[Verse 2]\nHe was a young boy in pursuit of money and fame\nAnd he would do anything he could to kill the pain\nWhen everybody know your moves, they speak of your name\nAnd ohh, all over the late night local news I heard him scream\n\n[Hook]\nOh no, this ain't paradise! Oh no, this ain't paradise!\nOh no, this ain't paradise! (Yeahhh)\nOh no, this ain't paradise! Oh no, this ain't paradise!\nYou know, this ain't paradise\n\n[Bridge]\nI say the sun don't shine forever (oh oh oh oh oh)\nAnd everything that glitter ain't gold (ahhhhhhh)\nI say love don't love forever (oh oh oh oh oh)\nAnd everything that's new gets old (rahhhhh)\n\n[Verse 3]\nSometimes we try to find the road to the riches\nNeed roadside assistance\nBlisters on my knees, from beggin' for forgiveness\nAin't no dollars on my trees, but knowledge on my feet\nCause I been climbin' to the peak, and runnin' from the bullshit\nI'm tired of playin' the same song, who told the DJ bring it back?\nDead Presidents, bullet in Abraham Lincoln hat\nStarin' at big poster I swear that he be winkin' back\nCut school, sell crack, sorry I'm just thinkin' back\nCall me crazy, I've been called worse\nIt's like I have it all, but what's it all worth?\nHa ha, I'm probably better in my afterlife\nI should cherish life but this just ain't paradise\n\n[Outro]\nOh no, this ain't paradise! Oh no, this ain't paradise!\nOh no, this ain't paradise! (Oh, ohh ohh ohh)\n... this ain't paradise; no, this ain't paradise\nThis ain't paradiseeeeeeeee", "image": "https://images.genius.com/9b09ba658e01574285934c93014f48d1.630x630x1.jpg"}], "artist": "Lil Wayne"}