{"songs": [{"title": "The Good Die Young", "album": "Power of the Dollar", "year": null, "lyrics": "[Intro]\nYo, you know what I want?\nI want the beat to drop in, right, like, now\nNiggas be thinkin' I'm crazy right? Yeah, you are crazy\nI ain't crazy - you are crazy - at least I don't think I'm crazy\nI think my shit is hot, I think I'm hot  you hot, but you crazy\nWhy they wanna? I don't know\n\n[Verse 1]\nIt's the money that makes shit get ugly\nIt's the money that makes these hoes love me\nIt's the money that makes niggas wanna slug me\nMan, I thought the money would make it all lovely\nYo, I actually write what I do and see\nThe felonies from day to day make me say what I say\nWhen I die my art will be worth as much as Picasso's\nDon't cry for me, smile for me\nAnd if you see them niggas who wet me wile' for me\nRemember the good times, the chips we stacked, the clips we packed\nAnd all the bricks we cooked from coke to crack\nLet my tombstone read \"I Tried\" and from the start\nEverything I wrote was from my heart\nSo it’s always gon' be number one on my chart\nI get sensitive with my shit, don't fuck with my art\nSometimes it sounds like I'm playing, but I'm sayin'\nThis shit is real, it ain't a game\n\n[Chorus]\nThey say the good die young\nI guess these grimy niggas live a long time\nSit in fancy whips, sip champagne and shine\nKeep your eyes on yours while I keep my eyes on mine\nThey say the good die young\nI guess these grimy niggas live a long time\nSit in fancy whips, sip champagne and shine\nKeep your eyes on yours while I keep my eyes on mine\n\n[Verse 2]\nFirst it happened to Stretch then to Pac and Big\nI'm convinced it can happen to anybody, kid\nSo I get vest up when I get dressed up\nIn the hood it's messed up, niggas running 'round shooting shit up\nIf it's Dom that you drinking fill up my cup\nIf you gossiping about me shut the fuck up\nWhy do niggas act like they hard when they know they butt?\nWhen getting robbed ain't a good time to press ya luck\nDuke listen, if you move I'mma hurt you\nYou'll get your turn to shine later, patience is a virtue\nRight now what you need to do is give me the cash\nForget about your boss being mad, just save ya ass\nBe a good boy now, go and get your stash\nI seen you throw it next to the garbage can like it was trash\nAlright, run along before I shoot ya ass\nI hate to do this to you, but I really need this cash\n\n[Chorus]\nThey say the good die young\nI guess these grimy niggas live a long time\nSit in fancy whips, sip champagne and shine\nKeep your eyes on yours while I keep my eyes on mine\nThey say the good die young\nI guess these grimy niggas live a long time\nSit in fancy whips, sip champagne and shine\nKeep your eyes on yours while I keep my eyes on mine\n\n[Verse 3]\nI know we all gonna go, but I'd hate to go fast\nThen again I don't think it'd be fun to stick around and go last\nMan listen, if you really really like this shit\nNigga, call Steve Stoute and I'll write ya shit\nCall him now before I drop for real cause after I drop\nI'mma be chargin' ya'll niggas like forty a pop\nTo each his own: me? I'd get it while it was cheap\nTypical mentality, I know, I'm straight from the street\n1999's the year of the predator, I'm killing to eat\nNiggas'll treat you like a egg, when you come to cop you get beat\nGive me your dough, oh, you wore your jewels? What a treat\nYou're a generous guy, take 'em off or die\nMan, we hurting 'round here, ain't nobody slinging pies\nLook around, ain't nobody 'round here fly\nWhy you 'round here with this shit anyway? Huh? You high?\nSee, you done made the wrong move, kiss your ass goodbye\n\n[Chorus]\nThey say the good die young\nI guess these grimy niggas live a long time\nSit in fancy whips, sip champagne and shine\nKeep your eyes on yours while I keep my eyes on mine\nThey say the good die young\nI guess these grimy niggas live a long time\nSit in fancy whips, sip champagne and shine\nKeep your eyes on yours while I keep my eyes on mine\nThey say the good die young\nI guess these grimy niggas live a long time\nSit in fancy whips, sip champagne and shine\nKeep your eyes on yours while I keep my eyes on mine\nThey say the good die young\nI guess these grimy niggas live a long time\nSit in fancy whips, sip champagne and shine\nKeep your eyes on yours while I keep my eyes on mine", "image": "https://images.genius.com/f29b6e681d1b1237ec06d01ab616992a.600x600x1.jpg"}], "artist": "50 Cent"}