{"songs": [{"title": "Brick Intentions", "album": "Ill At Will Mixtape Vol. 1", "year": null, "lyrics": "[Redman]\nBricks is ugly! Roll ya blunts up, with the '89\nBricks is partying, dub drop 80 bombs\nGilla House here, we bout to dumb out\nHittin' your halfway house to break (?) out\nIt's a lot of gangsters and a lot of freaks\nThat turn any street beef into potted meat\nFrom Chilltown, Illtown, to New Brunswick!\nI bring it back like your day of first tounge kiss\nPicture looking good, all two of y'all\nYou wanna fuck bitches? Let's get it on!\nI'm like Marvin Gaye, I'm still starvin'\nCrash my car where Garden State Mall is\nTook the jewlery, minx, and the cashmere\nRoll up in Macy's, smack the cashier\nI know you like it hot, that's why I keep it hot\nSo how the fuck, could you not want a piece of Doc?\n\n[Hook]\nWe don't give a fuck, cause we just drink and smoke and straight East Coastin'\nBitches, shakin', ass in motion, psycho, outlaw, smoker, strokin'\nGot a cup? Raise it up! Got a blunt? Blaze it up!\nThat's yo chick? What's yo chick? On these nuts!\nAll I really know is that Gilla House is some crazy niggas\nWe ain't playin', know what I'm sayin'? (Shout out to Dr.Dre!)\n\n[Redman]\nYo, soon as the club close\nI'm at the back do' strapped wit' a Haxso, and a Fo' Five\nMy niggas gassed up, quick to blast up, similar to NASA\nGot chickens in the Bricks with they ass up\nThugs on the block tryin' to get after us\nWhat'd you think nigga? I ain't come prepared?\nWith a big bear grip in my underwear\nHit 'em up, shoot 'em up, head 'em out\nY'all had your turn, Red is up\nDon't be shy now, we hustle thick at it\nYou know a party ain't a party 'less Bricks at it\nGet a mic to the Doc and I'll get it crackin'\nY'all lose focus, we keep stackin'\nDef Sqaud in it, Erick snuck the Mac in\nKeith Murray in the back, chain jackin' (x4)\n\n[Hook]\n\n[Outro]\nYeah, it's Gilla House niggas\nComin through the do' fo '04\nBetter beleive that\nWe told you!\nGet yo smoke on nigga, Gilla House niggas", "image": "https://images.genius.com/269feb9a815361d5df2b9a0fae3113b1.959x948x1.jpg"}], "artist": "Redman"}