{"songs": [{"title": "Can U Dig It", "album": "My Soul", "year": null, "lyrics": "Uh!  Yeah!  What Up?\n\nVerse 1:\nI know y'all wanna take me down\nI know y'all wanna see me get clowned\nI know y'all wanna take my sound\nAnd put a nigga like me in the lost and found\nBut I refuse to fade\nI'll stay this way\nSpreadin venom in the mic till I'm old and gray\nAnd now niggas wanna attack me\nFlip-flop and back me\nBut fool you's a mackey\nI'll starch your ass like some khakis\nYour shit is tacky and you better play the backwoods\nMe and my crew will use your cd for a hackey sack\nImagine that\nAnd it shouldn't be hard\nCause your style ain't large\nAnd you wanna make all the profits with crowbars\nCan U Dig It?\nWhen nothin can save it\nShock your ass like a phaser\nBurn and cut like a laser\nAmaze you, with this flava\nI run with a pack of tennis shoe playa's\n\nChorus:\nCan U Dig It?  *singing* Can U Dig It?\nCan U Dig It?\n\nCan U Dig It?  *singing* Can U Dig It?\nCan U Dig It?\n\nVerse 2:\nThe first law of age is called survival\nThat's why I'm deadly on revival\nAnd it's vital\nTo my basic instinct\nThat all wack mc's become extinct\nBecause we on the brink\nOr, should I say the edge\nLike a schizsophrenic with seventeen personalities walkin on a ledge\nThen you can't see the black cause it's blocked by the blue and the red\nU.F.O.'s\nAnd scandalous ass hoes\nWaist deep in the shit, it's still smellin' like a rose\nAnd I suppose\nYou want me to play superstar\nAnd when I see you on the street act like I don't know who you are\nSo, you can run back and tell that\nBut I won't do that\nSo, fool you can chew that\nTo all sucka mc's you better beware\nI been conjurin up forces way back in my lair\nAnd my crew don't scare\nAnd we don't care\nWe act, we wear, I swear\n\nChorus\n\nVerse 3:\nIt's the thrilla\nStraight outta Compton, not Manilla\nGot a chokehold on the mic like I was M.C. Gorilla\nTake this to the heart for real a\nDon't you ever try to steal a\nLike AIDS this shit came like gin a\nMight fuck up your liva\nCall me Pharoh cause I'm floatin bustas up the river\nWhen I deliver\nMake your sister and your grandma shiver\nTop feelin steadily rakin up the scrilla\nKickin back in my easy chair sippin on some Henna\n?Exol? cause my whole crew is locin\nAnd fools always tryin to fix shit that ain't broken\nI'm down with pixies so you don't wanna see me\nSo, grab everyone in your crew and disapeer like a genie\nNever said I was the best but I ain't the one to be testin\nCross the line and in pieces you'll be destined\nDon't stop, get it, get it\nCause I blow up the spot everytime I grab the mic and hit it, hit it\n\nChorus, Repeat 3X", "image": "https://images.genius.com/8b2afc0b2ec12b84597cab495ffdf0e1.600x600x1.jpg"}], "artist": "Coolio"}