{"songs": [{"title": "What You Sayin’?", "album": null, "year": "2017-12-27", "lyrics": "[Chorus]\nI know you dig 'cause I dig, oh no\nI don't give no fuck what you sayin', oh no\nDon't give no fuck what you sayin', oh ho\nYou play with me, then I'm sprayin', yo, ya\nYou play with me, I'm gon' spray it, oh ho\nI don't give no fuck what you sayin', oh no\nDon't give no fuck what you sayin', oh ho\nYou play with me, an' I'm sprayin'\nI pull up with dirty sticks an' I'ma spray it\n\n[Verse 1]\nShe was so fine (she was so fine)\nSo I let her push the foreign ride an' sit in it (skrrt)\nI'm starin' at the toilet like I wan' go shit on niggas (what?)\nI'd rather kill a nigga (oh boy) before I squeal on niggas (on God)\n(Know I'm sayin', man? Real dripset shit, man, give it to 'em, ya dig?)\nCopped her a coupe and now she say I'm the best\nI taught her, she ain't gon' tell, you can put her to the test\nI flood with her Chanel whenever she get upset (what?)\nI bought a gold rope and I flex it on the v-neck\nBeat her like Funkmaster Flex\nLock on that knit like a bitch\nThat pussy pink like a pig\nR.I.P. to OG double D, bitch I dig\nDrink on that lean until it's [?]\nI'ma leak that sauce and fill the world with slimes\nFilled it with slimes and then we slimed up the streets\nThat pussy nigga tellin' looks so sloppy to me\nOh no\n\n[Chorus]\nI don't give no fuck what you sayin', oh no\nDon't give no fuck what you sayin', oh ho\nYou play with me, then I'm sprayin', yo, ya\nYou play with me, I'm gon' spray it, oh ho\nI don't give no fuck what you sayin', oh no\nDon't give no fuck what you sayin', oh ho\nYou play with me, an' I'm sprayin'\nI pull up with dirty sticks an' I'ma spray it\n\n[Verse 2]\nIf you a G, say \"fuck tha police\" (fuck 'em, fuck 'em)\nPop, lock, and drop it on my gold teeth\nI'ma run inside that pussy, dropped my codeine\nGet it, drunk it, hit it, hit it, like Ginobili\n(Like I said the first time, man, real dripset shit, y'know what I mean? Pay attention. I ain't through. Get it)\nPussy nigga starin' with his snail face\nTwenty-fives, thirty-eights, fuck a shell-case (brrr)\nOld hunnids, small head on a big plate (what?)\nEatin' good, vegetarian niggas actin' crazy\nAll these foreign cars, nigga, know we racin' (skrrt)\nGot lots of foreign broads that I never chase\nI swear it's five stars every time I eat\nI swear it's five broads stuffin' in my face\nYou can have it, whoa, whoa, you can have it\nThese niggas sad and, we just livin' lavish\nI went in the rabbit myself and picked out some carats\nShe know we not average and all of my niggas happy\nOh no\n\n[Chorus]\nI don't give no fuck what you sayin', oh no\nDon't give no fuck what you sayin', oh ho\nYou play with me, then I'm sprayin', yo, ya\nYou play with me, I'm gon' spray it, oh ho\nI don't give no fuck what you sayin', oh no\nDon't give no fuck what you sayin', oh ho\nYou play with me, an' I'm sprayin'\nI pull up with dirty sticks an' I'ma spray it", "image": "https://images.genius.com/717461618e785def35d07de6484b7ad4.1000x1000x1.png"}], "artist": "Young Thug"}