{"songs": [{"title": "Too Deep For The Intro", "album": "Friday Night Lights", "year": "2010-11-12", "lyrics": "[Produced by J. Cole]\n\n[Verse 1]\nPartially functional, half of me is comfortable\nThe other half is close to the cliff like Mrs. Huxtable\nThese boys got them hoslters and clips they pack like Lunchables\nLike white boys in grade school, while we ate school made food\nJust eyeing they shit, wish I was trying they shit\nKnowing when mama hit the store she wasn’t buying that shit\nNo I ain't crying a bit man, that's just life that's how that shit work\nYou reach your hand in fire, you pull it back when you get burnt\nGotta learn when you get hurt, even if it's with cupid\nHe beat you and you went back, who's officially stupid?\nOh yeah I understand that's your man, you had a plan\nYou been together for some years, you sticking with him for the kids\nSo you overlook the tears, but we both know that's a bad look\n'Cause 20 years from now your daughter probably get her ass whooped\nLook, if this too deep for the intro I’ll find another use\nBut just in case its perfect let me introduce\nCole\n\n[Hook: Erykah Badu]\nTime to save the world, bearing the world is all the time\nSo many things I still don't know, so many times I've changed my mind\nGuess I was born to make mistakes, but I ain't scared to take the weight\nSo when I stumble off the path, I know my heart will guide me back\n\n[Verse 2]\nYea, man, is this too deep for the intro? If so I’ll find another use\nBut just in case its perfect, let me introduce\nIt’s Cole, I had a dream and so I made a move\nA ill ass nigga who just so happened to stay in school\nStill rap for hustlers and mothafuckers that hated school\nSaid \"that's for busters,\" then heard my shit and I made it cool\nIt's safe to say that I’m gifted as if I’m Christmas shopping\nI got gangsta niggas lining up in admissions office\nAyy, possibly cause all the hoes a nigga scraped\nA lot of shit up on my plate so you know a nigga late to my first class\nI’d much rather sit up in first class\nShould I admit that a slutty bitch was my first smash?\nWasn't experienced, so nah I didn't wear it out\nAlways thought my first time would be someone I cared about\nBut being a virgin was something to be embarrassed 'bout\nI used that ass for practice, so I wasn't scared out my mind\nYou call it rhymes I call it clearing out my mind\nWas just a young boy starin' out my blinds\nTill I got free from my mama leash\nRunning loose through the streets\nLike a stray dog in heat\nAnd we looking for some freaks can you play, pardon me\nWhats your name, don’t mistake me for no lame, no not me\nShe knew I was on the team cause she seen how tall I be\nIn the club dappin’ niggas, even-tu-ally R-I-P\nDamn, you win some, you lose some, that just how its happens\nAnd if a nigga step up to ya, then you gotta scrap em\nYour name is all you got, throwing hands by the bathroom\nIts funny I barely told nobody I started rapping\n'Cause see some niggas was haters that I just viewed as clowns\nAt 14 I knew I was the nicest dude around\nI gotta make a move, I gotta do this now\nIf they don’t know your dreams, then they can't shoot em down\n\n[Interlude]\nHa, yeah nigga\nHell yeah, I felt that one in my fuckin' soul\n\n[Outro: Erykah Badu]\nOoh, hey, I'm trying to decide\nWhich way to go, think I made a wrong turn back there somewhere\nOoh, hey, I'm trying to decide\nWhich way to go, think I made a wrong turn back there somewhere", "image": "https://images.genius.com/ae722fa8fa10d75fe4b25dfeb4b8d8d6.1000x1000x1.jpg"}], "artist": "J. Cole"}