{"songs": [{"title": "See You", "album": "Rich Gang: Tha Tour Pt. 1", "year": "2014-09-29", "lyrics": "[Intro]\nHey, YSL\nYeah yeah yeah yeah\nYeah\n\n[Hook]\nI got the streets in a head lock\nI got your bitch in leg lock\nI do not fuck with the fed cops\nF-150, I bed her\nAll of my niggas gon' get it\nWe gon' bust it down and split it\nFast food I want the chickens\nIgloo I freeze the city\nI can see you in a Bentley\nIn the back like Oprah Winfrey\nUmbrella like Mr. Bentley\nMy dick be sniping these bitches\nI'ma make it rain on her forehead\nFuck you pay me just like Uncle Sam said\nHo this ain't no fur this a lamb head\nYou can't get the picture but the Cam did\n\n[Verse 1]\nPull up in nuthin' but big bodies\nOn top like Scotty 2 Hotty\nLoad up the fire then I light it\nShootin' shit get me excited\nDouble C cups, fuck the titties, I try it\nPiece of me inside her mouth call it trident\nNigga having sex on a boat\nI got my water on, I need me a float\nI am, the black kid where is all my folks\nI slimed them out then I left 'em on the shore\nI got bands on me, yes I meant plural\nI am, so fresh man I feel like I'm a tourist\nAnd I want 50 whole bands for a chorus\nEverytime I ball you know that I'ma score\nPlease take off them drawers man you making Thug bored\nI'ma hit the showroom and make a damn flood\nMan, I wonder why all them niggas important\nMan my ice is water like a cosa nostra\nI swear to swear to god baby I'm a big slime, already told you\n\n[Hook]\nI got the streets in a head lock\nI got your bitch in leg lock\nI do not fuck with the fakers\nF-150, I bed her\nAll of my niggas gon' get it\nWe gon' bust it down and split it\nFast food I want the chickens\nIgloo I freeze the city\nI can see you in a Bentley\nIn the back like Oprah Winfrey\nUmbrella like Mr. Bentley\nMy dick be sniping these bitches\nI'ma make it rain on her forehead\nFuck you pay me just like Uncle Sam said\nHo this ain't no fur this a lamb head\nYou can't get the picture but the cam did\n\n[Verse 2]\nI won't lay down 'til there's ice in my ears\nI won't drink it unless it syrup don't want beer\nAin't in no prision but when I appear\nYou see my diamonds from far but I'm near\nBlingin', I'm blingin', my chopper gon' ring, yes I ring it\nOff em' no reason, I kill em on spot at Four Seasons\nIce skating like Lupe Fiasco\nIma stack them hundreds tall no Rango\nAnd I'm only 23 but I got stains though\nWhen we kill em we won't hold any remains though\nI'm the fucking Randy Savage\nRiding with the karats and the bad bitches\nNigga must be a crip cause he drinking so much red, it ain't Actavis\nIma start from the middle then I'm headin' to the top then I'm going deep all in that pussy\nLil baby want all of my cream and you know its all white I'm mushy\nAnd you know her old man be a pussy ass nigga like a bookie\nPlus T.I. took it but I ate the cookie!\n\n[Hook]\nI got the streets in a head lock\nI got your bitch in leg lock\nI do not fuck with the fakers\nF-150, I bed her\nAll of my niggas gon' get it\nWe gon' bust it down and split it\nFast food I want the chickens\nIgloo I freeze the city\nI can see you in a Bentley\nIn the back like Oprah Winfrey\nUmbrella like Mr. Bentley\nMy dick be sniping these bitches\nI'ma make it rain on her forehead\nFuck you pay me just like Uncle Sam said\nHo this ain't no fur this a lamb head\nYou can't get the picture but the cam did", "image": "https://images.genius.com/07e1a913522c1d895f518d7ebf9ad7f0.640x640x1.jpg"}], "artist": "Young Thug"}