{"songs": [{"title": "What Can I Do? (Remix)", "album": "Bootlegs & B-Sides", "year": "1994-11-22", "lyrics": "[Sampled announcer]\nIn any country, prison is where society sends it's failures\nBut in this country, society itself is failing\n\n[Ice Cube]\nHellll yeah! Uhh..\nTa-dow! Uhh..\nTa-dow! Uhh..\nTa-dow! UHH!\n\nTa-dow, how ya like me now I'm in the mix\nIt's nineteen-eighty-six and I got the fix\nWith the chicken and a quota, got the bakin soda\nLet the water boil, workers all loyal\nDropped out the twelveth cause my wealth is shorter\nThan a midget on his knees, now I slang ki's\nInfest my hood with crack, I'm the mack\n+It Take a Nation of Millions to Hold Me Back+\nToo big for my britches, and I got bitches\nNow I'm hittin switches, niggas want my riches\nUsed to get 18, when my G was alive\nNow a ki' is 13-5\nEighty-nine's the number, another summer\n(Get down!) Police ain't get no dumber\nStreets dried up, used to think it would last\nBut being a kingpin is a thing of the past\nThey tried to blast me for slangin a boulder\nNow I got my ass in Minnesota\nGot my own crew, it's on brand new\nDamn, what can I do? Oooh\n\nTa-dow, what can I do?\nTa-dow, what can I do?\nTa-dow, how ya like me now?\nTa-dow, what can I do?\nTa-dow, what can I do?\nTa-dow, how ya like me now? Fool\n\n[Ice Cube]\nAlready done stacked me half a meal ticket\nBought a house next to Prince, now I can kick it\nNow I got ends, wavin to my friends\nRollin in a Benz, goin to see the Twins\nPlay at the 'dome; police are tappin my mobile phone\nI'm almost home\nGettin excited, indicted\nSpent a grip and a year tryin to fight it\nLawyer got paid; plea, no contest\nCause everything I own, got repossessed\nNow take a look at the dunce\nAnd I'm happy cause I only got 36 months\nI never picked up a book\nCause, my arms are 16 inches, nigga look (OOOH)\nCan't wait for ninety-two so I can get with my crew\nAnd see, what can I do\n\nTa-dow, what can I do?\nTa-dow, what can I do?\nTa-dow, how ya like me now?\nTa-dow, what can I do?\nTa-dow, what can I do?\nTa-dow, how ya like me now?\n\n[Ice Cube]\nFucked up in the pen, now it's ninety-fo'\nBack in L.A., and I'm bailin through the do'\nEverybody, know I gotta start from scratch\nSo where the work at, and niggas smirk at\nMe sayin ain't nuttin poppin from here to the L.B\nWhat you tell me?\nNo it ain't crackin, everybody's jackin for a Coupe\nSince, they sent in the troops\nEven though I got muscle, that ain't my hustle\nTakin a nigga's shit in a tussle\nNo skills, to pay the bills\nTalkin about education to battle inflation\nNo college degree, just a dumb ass G\n(Yeah you fool..) Who me?\nI got a baby on the way, damn it's a mess\nHave you ever been convicted of a felony? Yes\nTook some advice from my Uncle Fester\nAll dressed up in polyester\nWelcome to McDonalds may I please help you?\n\n[Mack 10]\nYeah you can help me punk\nGive me all of the money, or I'm dumpin\nThat's on my momma\nAy homeboy, while you at it\nGimme large fries, a strawberry shake\nA Big Mac, cause this Mack 10 fo' life\n\n[Ice Cube]\nCan I roll wit you? What can I do?\nNow I'm on the run, with a gun\nAnd this fool I don't know, pedal to the flo'\nSwervin, servin all of the pigs\nJust because they tryin to split my wig\nI'm in custody, L.A.P.D\nOne more felony, strike number three\nTwenty-five to life in cell block two\nIt's true, that's what I gotta do, oooh\n\nTa-dow, what can I do?\nTa-dow, what can I do?\nTa-dow, how ya like me now?\nTa-dow, what can I do?\nTa-dow, what can I do?\nTa-dow, how ya like me now?\nWesssssyde! What can I do, what can I do?\nIce Cube.. what can I do, what can I do?\nWhat can I do, oooh\n\n[Sampled announcer]\nIn any country, prison is where society sends it's failures\nBut in this country, society itself is failing", "image": "https://images.genius.com/bd986178756b67188db2d06a77696b78.1000x1000x1.jpg"}], "artist": "Ice Cube"}