{"songs": [{"title": "Go For Dat", "album": "Never Die Alone Soundtrack", "year": null, "lyrics": "[Intro: DMX]\nOk! Uh, yo, yo, grrr, yo, uh huh\nYou know how we do, (Talk to 'em baby) nahmean\nSmack niggas around (Talk to 'em baby) nahmean\nLet 'em know, (Talk to 'em baby) it's my motherfuckin house nahmean\n(Talk to 'em baby) Let these motherfuckers know aight\n\n[DMX]\nAiyyo, don't fuck with dog, dog is a beast\nX, only nigga get love in the streets\nShit done fell off straight from the horse\nBullshit, gettin four mics in the Source\nI can't respect that, it's just how I feel\nYou know the truth when you hear it, it's for real\nCome on, what the deal? Like it don't show\nWooo! Yall niggas gon' feel it when you comin back\nMan, you niggas play too many games\nToo many jokes, what I said? Too many names\nProvoke situations, but do me the same\nAnd I'll show how a nigga stay true to the game\nYou gots to be more careful, like Terry Woods\nI'm a nigga that can pass through every hood\nUp to no good, that show you wool\nBitch, X got pull, that's how I get down, pitbull\n\n[Chorus: Lil' Scrappy]\nWatch that nigga; get stomped the fuck down\nWatch that ho; get dragged the fuck out\nDamn that nigga; get knocked the fuck down\nBitch ass nigga; get laid the fuck out\nDo somethin nigga; to get you stomped down\nDo somethin bitch; to get you dragged out\nDo somethin nigga; to get you knocked out\nStep up bitch, get laid the fuck out\n\n[DMX]\nStop the bullshit cause ain't nothin funny\nYall cats is only in this for the money\nIt's all good when the check drops\nBut it's back to the hood when the check stops\nYou never left, you ain't gots to worry about comin back\nWooo! Yall niggas gon' feel it when you comin back\nAnd I'll be there doin my thing\nFuckin wit cruddy niggas keep pumpin the game\nAsk around, difference between me and you\nIs I get at 'em, my friends you know what I do\nListen, don't play with me that way\nCause faggot, I can end it all today, fuck what you sayin\nPlay fair with men, act like one\nTalk like a bitch and get smacked like one\nGot rabbit in 'em, get jacked like one\nMake the call, hit me back like done\n\n[Chorus: 2x]\n\n[DMX]\nYou always been the son type nigga\nScared to pull a gun type nigga\nTalk shit and run type nigga\nSeek through the fake shit and sniff out the bullshit\nFrom a mile away so put the smile away\nX gon' give it to ya, I go hard\nBitch, my name rings bells in the yard\nCheck my resume, track record is offical", "image": "https://images.genius.com/00486cfe0f5db5139867dd85b53e9ced.297x440x1.jpg"}], "artist": "DMX"}