{"songs": [{"title": "I Shot Ya", "album": "Mr. Smith", "year": "1995-11-21", "lyrics": "[Intro]\nBlaze this one, word up!\nI'ma blaze this one\nNo doubt! Uhh, check it, check it, check it\nUhh, uhh, check it, check it, check it\nI'm Uncle L, check it, check it, check it\nThe Trackmasters, check it, check it, check it\nNow everybody now, check it, check it, check it\nAll my niggas now, check it, check it, check it\nYeah, we 'bout to serve this one off nice, y'nahmean?\nWord up, check it!\n\n[Verse 1]\nI shot ya!\nI'm splittin' brothers open like a doctor\nYa fell asleep, the vampire teeth got'cha\nI drop ya down in boilin' acid\nYa melt like plastic, elastic, is drastic\nViolations, room vibrations, son\nCock the hammer let the Uncle give em one\nDone take a flick of a wicked lunatic\nPuttin hits on your clique, got'cha wife in turnin' tricks\nWhat? You don't wanna, I thought that you was bawlin'\nNow watch cos I cock ya love, ya girlies fallin'\nUh, what's my function? Lyrical injection\nBlazin' niggas, hittin' 'em raw with no protection\nI take advantage\nYa fear me, I'm doin' damage\nYa hear me\nThe whole scenario is dreary\nMC's is gettin' wet up in the game\nI meet you up in Memphis, just call my name\n\n[Chorus]\nI shot ya\nYa wanna (uhh)\nYa wanna (uhh)\nYa wanna hit, give me a hour (uhh)\nPlus a pen and a pad (uhh, check it, check it, check it)\nI shot ya\nYa wanna (uhh)\nYa wanna (uhh)\nYa wanna hit, give me a hour (uhh)\nPlus a pen and a pad (uhh, check it, check it, check it)\nI shot ya\n\n[Verse 2]\nI got ya strapped to the stage and\nTrapped in a cage and, tongue kissin' a Gauge and\nYa mob's locked down underneath the surface\nYa gettin' nervous for talkin' shit with no purpose\nLaced up, mind charmer, mad drama\nWhat goes around comes around, not around farmers\nSilence, shhhh, very deadly\nCome and battle, let me add you to my medley\nPossessin' power, takin everything I can grasp\nGo get it now, why you always dwellin' on the past?\nBaby boys reminiscin' old school shit\nYoung fools get dicked, LL rules the shit\nWith a platinum fist, the relentless abyss\nI take you to a land where piranhas like to kiss\nMassacre, mmuh, blowin' up the tour bus passengers\nChuckin' the color outta cartoon character\nYa get serious\nReal niggas recognize what my theory is\n\n[Chorus]\nI shot ya\nYa wanna (uhh)\nYa wanna (uhh)\nYa wanna hit, give me a hour (uhh)\nPlus a pen and a pad (uhh, check it, check it, check it)\nI shot ya\nYa wanna (uhh)\nYa wanna (uhh)\nYa wanna hit, give me a hour (uhh)\nPlus a pen and a pad (uhh, check it, check it, check it)\nI shot ya\n\n[Bridge]\nI shot ya!\nWord up, I'ma lace this shit crazy, y'nahmean?\nWord up, we're gonna blow the spot up, kid\nNo doubt about it\nYeah, yeah, I ain't through, I ain't through, I ain't through\n\n[Verse 3]\nUh-uh-uh-oh, lookin' kinda leary\nYa clique thought I fell off, they didn't wanna hear me\nOh really, now teel me how long have you been whinin'?\nSixteen years, twenty million albums, yeah you're climbin\nI love your joint Rock The Bells, it was mad hot\nYa record 'bout the Radio was blowin' up my spot\nMy girl was on your chip when you flipped I Need Love\nYour backseat countset was mad butter, son\nI loved your boomin' system it was wicked as could be\nYou bad, now I'm writin' on your pink cookies\nAnd you had me screamin' Mama Said Knock Ya Out\nYa jinglin', baby, no doubt\nUh, talk to me (what, what, uhh, uhh) become a zombie, walk to me\nAin't a MC alive who fought with me\nY'nahmean? Mad rugged\nEasy does it\nI got em flockin' like buzzards\n\n[Chorus]\nI shot ya\nYa wanna (uhh)\nYa wanna (uhh)\nYa wanna hit, give me a hour (uhh)\nPlus a pen and a pad (uhh, check it, check it, check it)\nI shot ya\nYa wanna (uhh)\nYa wanna (uhh)\nYa wanna hit, give me a hour (uhh)\nPlus a pen and a pad (uhh, check it, check it, check it)\nI shot ya\nYa wanna (uhh)\nYa wanna (uhh)\nYa wanna hit, give me a hour (uhh)\nPlus a pen and a pad (uhh, check it, check it, check it)\n\n[Outro]\nWhat, what, what, what, what\nUh, what?\nY'nahmean? This is how we gettin' down for crizzown\nNo diggity, y'knowI'msayin?\nTrackmasters lace me, y'knowI'msayin?\nAnd I take care of mines, y'knowImean?\nThat's it son!\nPeace!", "image": "https://images.genius.com/aba57f7703e47dacfcd5243398922d01.500x500x1.jpg"}], "artist": "LL Cool J"}