{"songs": [{"title": "Bonfire", "album": "Camp", "year": "2011-07-22", "lyrics": "[Verse 1]\nOkay, it's Childish Gambino, homegirl drop it like the NASDAQ\nMove white girls like there’s coke up my asscrack\nMove black girls 'cause, man, fuck it, I’ll do either\nI love pussy, I love bitches, dude, I should be runnin’ PETA\nIn Adidas, with some short shorts, B-O-O all over me\nMy green is where it's supposed to be, your green is in my grocery\nThis Asian dude, I stole his girl, and now he got that Kogi beef\nMy dick is like an accent mark, it’s all about the over Es\nHot like a parked car\nI sound weird, like \"nigga\" with a hard 'R'\nFly like the logo on my cousin’s 440\nEatin’ Oreos like these white girls that blow me\nVodka for my ladies, whiskey for a grown man\nHangin’ in the islands, lookin’ for Earl like Toejam\nI made the beat retarded, so I’m callin’ it a slow jam\nButcher and I know it, man, kill beef, go ham\nThese rappers are afraid of him\nCause I’m a beast, bitch, \"grrr\" - Invader Zim\nGambino is a call girl: fuck you, pay me\nBrand new whip for these niggas like slavery\nTold me I was awful and that shit did not faze me\nTell me how I suck again, my memory is hazy\n“You're my favorite rapper now!” Yeah, dude, I better be\nOr you can fuckin’ kiss my ass: Human Centipede\nYou wanna see my girl? I ain’t that dumb\nYou wanna see my girl? Check Maxim\n\"Man, why does every black actor gotta rap some?”\nI don’t know, all I know is I’m the best one\n\n[Hook]\nIt’s a bonfire, turn the lights out\nI’m burnin’ everything you muthafuckas talk about\nIt’s a bonfire, turn the lights out\nI’m burnin’ everything you muthafuckas talk about\n\n[Verse 2]\nYou know these rapper dudes talk shit, start killin’\nFuck that, got goons like an archvillain\nI’m from the South, ain’t got no accent, don’t know why\nSo this rap is child’s play, I do my name like Princess Di\nYeah, they say they want the realness, rap about my real life\nTold me I should just quit: “First of all, you talk white!\nSecond off, you talk like you haven't given up yet\"\nRap's stepfather, yeah, you hate me but you will respect\nI put in work, ask Ludwig\nPut my soul on the track like shoes did\nPlayed this for my cousin, now he can’t even think straight\nBlack and white music? Now, nigga, that’s a mixtape\nShoutout to my blerds, they represent the realness\nShoutout to Gambino Girls, my dick is in the building\nI know you hate me cause your little cousin play me out\nI like black girls who nerdy but when they dance they be sayin' \"Owwww\"\nI'm sorry for who followed me\nChillin’ with a Filipina, at your local Jollibee\nYeah, I’m in her ass like sodomy\nSo if you see my hand under the table, don’t bother me\nI don't talk soft, that's that other guy\nI’m screamin’ “What the fuck is up?” like I ain't seen the sky\nThe shit I’m doin’ this year? Insanity\nMade the beat then murdered it: Casey Anthony\nThese rappers don’t know what to do\n'Cause all I did was act me, like a Looney Tune\nAnd I’ll give you all of me until there’s nothing left\nI swear this summer will be summer Camp, bitch", "image": "https://i.genius.com/6e8a9efd2c1c8fbe7f2afd2464c8bf9662598740?url=https%3A%2F%2Fcdn.pastemagazine.com%2Fwww%2Farticles%2Fbonfire.jpg"}], "artist": "Childish Gambino"}