{"songs": [{"title": "Just Watching", "album": "One Nation (Bootleg)", "year": null, "lyrics": "[Intro: 2Pac Talking]\nBitches be paranoid looking at a nigga all crazy\nI'm just looking, SHIT!\nI'm just looking baby, ha ha ha\n\n[Kurupt] All I need is some Henni'\n\n[Verse One: 2Pac]\nTo me it's hard to tell what you really want\nQuit acting mean to me, you're teasing me the way you flaunt\nBut you ain't hearing me, sincerely, I'm so attracted\nPictures of target practice making love on my mattress\nVisions getting graphic\nSo realistic you could grab it, it's a proven fact\nBaby gotta have it, my love making quite magic\nTricks is for kids bunny rabbit, let a man have it\nBet you'd be satisfied if you tried my habit\nHigh performance is hard to handle\nNaked in the bubble bath while I'm burning candles\nSex me like a slow song\nIf fucking you was bad baby then I'm so wrong\nMy feeling's so strong\nI keep staring like you can't see me\nI never planned to scam, my thoughts ran freely\nThere is no need to be paranoid, ain't nothing popping\nI ain't worried about your man baby girl cause I'm just watching\n\n[Chorus:]\n[Snoop:] WATCHING!!\n[Wilson] Just watching\n[Kurupt] JUST WATCHING!!\n[Wilson] Not buying anything\n[2Pac:] You know, I ain't worried about your man baby girl, I'm just watching\n[Wilson] Just watching\n[Kurupt] Just watching!\n[Wilson] Not buying anything\n[Snoop:] Baby girl, baby girl, do you wanna go to my place?\n[Wilson] Just watching\n[Kurupt] JUST WATCHING!!\n[Wilson] Not buying anything\n[Kurupt] For real, this is how we do it, what's up Dogg?\n\n[Verse Two: Snoop Doggy Dogg]\nYou know what? - You know what?\nI'm taking trips to Cabo, with my Death Row family\nWe're out on the road, we're sporting Diamonds and Gold\nWe're pushing Yachts and Jet Skis, smoking on hell of weed\nWe're trying to have millions man, y'all can have them Gs\nBitches flocking up eying nothing, all about them papers\nWe're standing away from the player-haters and the impersonators\nBut we're sporting Gators and we don't cater to no hoe\nFrom San Diego to Vallejo and all the way down to Idaho\nYou know, you wonder why this game don't change\nThey say you gotta have a way from the very start\nSo when I step into a club like Magic Cities\nThey be greedy with passion and the whole Atlantic city\nAnd pull up to a seed that had never sparked\nAnd post up, just like the Double R\nDon't get mad; cause a nigga ain't spent shit\nI'm just watching it and besides I'm a pimp, bitch!\n\n[Chorus:]\n[Wilson] Just watching\n[Kurupt] JUST WATCHING!!\n[Wilson] Not buying anything\n[2Pac:] You know..\n[Wilson] Just watching\n[Kurupt] JUST WATCHING!!\n\n[Wilson] Not buying anything yeahhh!\n[Kurupt] I ain't buying shit\n[Wilson] Just watching\n[Kurupt] JUST WATCHING!!\n[Wilson] Not buying anything\n[Kurupt] That nigga Daz\n[Wilson] Oohh baby, yeah\n\n[Verse Three: Daz Dillinger]\nNow tell me how you feel about me, the whole world know about me\nDon't doubt me, you got me hardship, your pussy all on my dick\nI sleep with Dubs down your drawers\nTake it from my dogs, where your ass be at, bitches all their ass\nShaking asses and titties but you they say don't touch\nI wanna fuck, that's all I wanna do to suck\nAll in the guts (What's up?) quick and fast\nWatching and clocking, ain't no stopping when the music popping\nHomie having fun with no gun (Ha ha What's up baby?)\nDeath Row got the party off the hook\nI take the Chronic, I take a book (What up Kurupt?)\n\n[Verse Four: Kurupt]\nAs soon as my eyes open, the first thing hits\nMe and the homies on the strip, fuck around with some Swiss\nAs soon as I hit the corner I'm on ya, eyes on scope\nI'm about to soothe on my way to see Daz, 'Pac and Snoop\nThere's something cute about five foot six\nAnd no sweat, I'm on set for the triple double twist\nThat's why I trip, I got to clear my mind\nTake a couple hits of this bomb\nNate Dogg hit the switch to say fuck you bitch\nCause if I spent I'm taking two pussy, I just wanna fuck\nEven though deep down I know she got some bomb ass pussy\nSo what would you do? roll, pass and just stop\nOr coast up on the corner like a dog and just watch\nWATCH!! WATCH!! WATCH!! WATCH!! WATCH!! (Watch out!)\n\n[Chorus:]\n[Wilson] Just watching\n[Kurupt] JUST WATCHING!!\n[Wilson] Not buying anything\n[Kurupt] It's a Dogg Pound Thing\n[Wilson] I'm not buying you anything yeah!!\n[Wilson] Just watching\n[Kurupt] JUST WATCHING!!\n[Wilson] Not buying anything\n[Kurupt] It's a Thug Life Thing, Thug Life!\n[Wilson] I'm not buying anything\n[Wilson] Just watching\n[Kurupt] JUST WATCHING!!\n[Wilson] Not buying anything yeahhh!\n[2Pac:] You, rat house bitches\n[Wilson] Just watching\n[SnoopD] Straight Up!!\n[Wilson] Not buying anything ooohhh!\n[Wilson] Just watching\n[SnoopD] Just like a player\n[Wilson] Not buying anything\n[SnoopD] Strictly for the players\n\n[Charlie Wilson] Just watching, not buying anything\n[Snoop Doggy Do] I'm just watching, just watching, just watching\n[Charlie Wilson] Just watching, not buying anything\n[Snoop Doggy Do] Ummmm, just peeping out the window, watching, just watching", "image": "https://images.genius.com/a1a90553105ad6af8fac203ba73284bf.480x360x1.jpg"}], "artist": "2Pac"}