{"songs": [{"title": "Brown Sugar", "album": null, "year": null, "lyrics": "(if you invited me)\nYeah, Cav Love, brown sugar\nBout to set it like, yeah yeah y'all (uh huh)\nYeah yeah y'all (uh huh) yeah yeah y'all (uh huh)\n(if you invited me)\nAdjust my mic so I can touch it up right quick\nShow 'em how Brooklyn do, you know what I mean? (no doubt)\n\nListen, yo\nLet's start it up (start it up)\nLet's get it flowin (get it flowin)\nLet's make a move (make a move)\nLet's get it goin (haha)\nI know it's feelin like everything you want, don't it?\nAnd you been waitin your whole life for one moment\nWell baby here it is (here it is)\nYou better step to it (step to it)\nI know you ready right (ready y'all)\nThen baby let's do it (let's do it)\n\nPut your neck to it, put your arms and legs next to it\nThen put whatever else is left to it\nSee you're all in (all in) now you about to rock 'em\nGot your focus man, now they got a problem\nWho you talkin to? son right there\nThe man in the mirror, I see him quite clear\nDo your thing Cav (yeah son)\nWork it out dog (work it out)\nOpen up their minds (open up)\nBe about yours (bout yours)\nSilence everyone who ever try to doubt yours\nGet your mind right (mind right)\nKeep your sound raw (sound raw)\nHeavy bass man (bass man)\nMake it bounce more (bounce more)\nMake 'em feel it from to the ceilin to the ground floor\n(if you invited me)\n\nHow it sound y'all? I know it's crazy, right\nI know it's crazy tight, don't ever take me light\nIt's Cav Love y'all (Cav Love y'all)\nAnd that's what's up y'all (sup y'all)\nI peeped in, I know exactly what you want y'all\nI make it jump y'all (jump y'all)\nSo put 'em up y'all (up y'all)\nBrown Sugar, Brooklyn, it's bout to jump off\n\n(Hook: Mos Def and singer)\nYou got to (give it to me)\nYou need to (give it to me) (uh huh)\nYou better (give it to me)\n(give it to me) ha ha, brown sugar\nLeave the ground shook up (uh)\nGot the world sweatin like fiends without cook up\nCome on, you know you really wanna (give it to me)\nYou better (give it to me)\nYou got to (give it to me)\n(give it to me) brown sugar, ha\nLick your lips to it\nWork your hips to it (ha)\nAnd steady rockin like this to it\n\n(Mos Def)\nIt's like one, two, three, and to the four\nThe brother Cavvy Cav is here so let him know\nThis for my hustlers (my hustlers)\nThis for my scramblers (scramblers)\nThis for my sexy mamis (sexy mamis)\nThis for everybody (everybody)\nBang it at any party and watch 'em rock to it\nBounce some pop to it, this here's hot music\nDuke I'm not losin, you need to stop foolin\nI know the game very well boy I'm not stupid\nSharp and smart movement, applyin a heart to it\nCame here to get the ghetto blocks movin\n(if you invited me)\nAnd after rockin in the porch and backyards movin\nKeep it crackin cuz I love the way that y'all do it\n\n(Hook: Mos Def and singer)\nYou got to (give it to me)\nYou need to (give it to me)\nYou better (give it to me)\n(give it to me) ha, brown sugar\nLeave the ground shook up\nObserve the way how we make it sound hit up\nLike you got to (give it to me)\nYou need to (give it to me)\nYou got to (give it to me)\n(give it to me) Brown Sugar\nLick your lips to it (huh)\nWork your hips to it (yeah)\nAnd steady rockin like this to it like\nDamn baby, damn baby, damn baby, damn\nOoh ahh, ooh ahh ooh ahh\nOoh ahh, ooh ahh ooh ahh\nDamn baby, damn baby, damn baby, damn baby\nOoh ahh, ooh ahh ooh ahh\nOoh ahh, ooh ahh ooh ahh\nDamn baby, damn baby, damn baby, damn baby\nOoh ahh, ooh ahh ooh ahh\nOoh ahh, ooh ahh ooh ahh\nDamn baby, damn baby, damn baby, damn baby\nIf you invited me\nIf you invited me", "image": "https://images.genius.com/4d1a9757d430776710118a3e0ba4658f.1000x667x1.jpg"}], "artist": "Yasiin Bey"}