{"songs": [{"title": "Tony Montana", "album": "Pluto", "year": "2011-09-19", "lyrics": "[Intro: Future]\nFuckin' cockroaches\nMuthafuckin' Freebandz\nWant me to be the bad guy?\nWanna fuckin' play?\nYa know?\nCome on!\nIt's the Cartel, nigga!\n\n[Chorus: Future]\nTony Montana, Tony Montana, Tony Montana, Tony Montana\nCheck up on my ends\nTony Montana, Tony Montana, Tony Montana\nI'm about to cop the Porsche\nTony Montana, Tony Montana, Tony Montana\nYou leave me no choice, take 'em to\nTony Montana, Tony Montana, Tony Montana\n\n[Verse 1: Future]\nI take over the streets, fresh off the banana boat\nI come straight from the east, where niggas split your cantaloupe\nYou tell me where you wanna meet, I'm comin' with a gang of dope\nMy cigar full of loud, I'm laced up to the fuckin' fo'\nA Porsche Carrera, Panamera, 911\nI do the whole dash, droppin' all cash (Woah)\nGutter to the death of me, I'm stickin' to the recipe\nPlugged in with Colombians, I know Sosa\nAll I got is my balls and my word, fuck the roaches\nEverything we do, we put Versace on the sofas\nThe money got me geeked like I took a hit of coca\nMy life is a movie, I gotta stay focused\n\n[Chorus: Future]\nTony Montana, Tony Montana, Tony Montana, Tony Montana\nCheck up on my ears\nTony Montana, Tony Montana, Tony Montana\nI’m about to cop the Porsche\nTony Montana, Tony Montana, Tony Montana\nYou leave me no choice, take em to\nTony Montana, Tony Montana, Tony Montana (Who you)\n\n[Verse 2: Drake]\nOn the hood you see the Stallion, passenger a stallion\nNiggas gettin' nervous, I’m passin' out the Valium\nI suggest you pop it, but please don’t get too sleepy\nUsed to have them bitches twerkin' up in 400 West Peachtree\nBet you those same hoes’ll see me, be like that's how you feelin'?\nUsed to stay up at The Twelve, now you're worth like 12 million\nBoy, you did it, boy, you did it, you did the unexpected\nI say fuck the unexpected, I just did what I projected\nI swear young women are lost these days while older women dig me\nFuckin' women that knew Biggie, so it really ain't no biggie\nIt’s just OVO and XO, and Freebandz the committee\nAnd shout out to Toronto, bitch, I’m Tony in my city, huh\n\n[Chorus: Future]\nTony Montana, Tony Montana, Tony Montana, Tony Montana\nCheck up on my ears\nTony Montana, Tony Montana, Tony Montana\nI’m about to cop the Porsche\nTony Montana, Tony Montana, Tony Montana\nYou leave me no choice, take em to\nTony Montana, Tony Montana, Tony Montana\n\n[Verse 3: Future]\nAnother shot of Quelo, she'll be comin' back to pesos\nWhen you're plugged in with Pedro, it’s hard for hoes to let go\nSee AK’s ain't no bitch, nigga, I’ll split your tato\nAin’t nothin' about me ordinary, I come with the yayo\nI move like a mob boss, it’s gonna take an army\nThe world is mine, nigga, you get it if you want it\nYou fuckin' with me, you’ll move to Alaska by the mornin'\nYou want me to be the bad guy? Okay, it's on then\nChampagne spillin', crab cakes everywhere\nMy white bitch trippin', she say I ain't playin' fair\nI’m about to cop a tiger, and put it in the car seat\nFreebandz a company, so, nigga, it don't matter, aye", "image": "https://images.genius.com/5bb731fa3b9558a527c09fe4d76fdace.500x500x1.jpg"}], "artist": "Future"}