{"songs": [{"title": "Look What You’ve Done", "album": "Take Care", "year": "2011-11-15", "lyrics": "[Produced by Chase N. Cashe and Noah \"40\" Shebib]\n\n[Verse 1]\nIt’s like ’09 in your basement\nAnd I’m in love with Nebby\nAnd I still love her but it fell through because I wasn’t ready\nAnd your back hurt and your neck hurt\nAnd you smoking heavy\nAnd I sit next to you and I lecture you\nBecause those are deadly\nAnd then you ash it and we argue\nAbout spending money on bullshit\nAnd you tell me I’m just like my father\nMy one button, you push it\nNow it's, \"Fuck you, I hate you, I'll move out in a heartbeat!\"\nAnd I leave out and you call me, you tell me that you sorry\nYou love me and I love you\nAnd your heart hurts, mine does too\nAnd it's just words and they cut deep\nBut it's our world, it's just us two\nI see painkillers on the kitchen counter\nI hate to see it all hurt so bad\nBut maybe I wouldn't have worked this hard\nIf you were healthy and it weren't so bad\nUh, maybe I should walk up the street\nAnd try and get a job at the bank\nCause leave it up to me, J, and Neeks\nWe'll probably end up robbing the bank\nThen Wayne calls up my phone\nConversation wasn't that long\nGets me a flight to Houston in the morning\nOh it's my time, yeah, it's on\nHe's thinking of signing me, I come home\nWe make a mixtape with 17 songs\nAnd almost get a Grammy off of that thing\nThey love your son—man, that boy gone\nYou get the operation you dreamed of\nAnd I finally send you to Rome\nI get to make good on my promise\nIt all worked out, girl, we shoulda known\nCause you deserve it\n\n[Chorus]\nIs this shit real? Should I pinch you?\nAfter all the things that we been through, I got you\nLook what you've done, look what you've done\nLook what you've done for me now\nYou knew that I was gonna be something\nWhen you're stressed out and you need something, I got you\nLook what you've done, look what you've done\n\n[Verse 2]\nIt's like '06 in your backyard\nI'm in love with Jade\nAnd I'm still in love, 'cause when it's that real\nIs when it doesn't fade\nAnd my father living in Memphis now, he can't come this way\nOver some minor charges and child support\nThat just wasn't paid, damn\nBoo-hoo, sad story—black American dad story\nKnow that I'm your sister's kid\nBut it still don't explain the love that you have for me\nI remember sneaking in your pool after school dances\nDamn, your house felt like the Hamptons\nFor all of my summer romances\nI never really had no one like you man this all-new, shit\nMade the world I know bigger\nChanged the way that I viewed it\nHad all this fighting going on at the crib\nYou would calm me down when I lose it\nTold you I think I'm done acting\nI'm more in touch with the music\nYou said, either way, I'll be a star, I could go so far\nTalked to me, you got to me\nThen you’d toss the keys and loan me your car\nYeah, just a young kid in a drop top\nLexus hopin' that I don't get arrested\nJust another kid that's going through life\nSo worried that I won't be accepted\nBut I could do anything, you said that, and you meant that\nYou took me places, you spent that\nThey said no, we went back\nChecks bounced but we bounced back\nI put all the money in your accounts back\nAnd I thank you, I don't know where\nI'd really be without that, it worked out\nMan, you deserve it\n\n[Chorus]\nIs this shit real? Should I pinch you?\nAfter all the things that we been through, I got you\nLook what you've done, look what you've done\nLook what you've done for me now\nYou knew that I was gonna be something\nWhen you're stressed out and you need something, I got you\nLook what you've done, look what you've done\n\n[Outro: Drake's Grandmother]\nHi Aubrey, I'm here sitting with my son having a little talk—and he knows how to get in touch with you now, to let you know how grateful I am for your help in keeping me in this—in this comfortable place. All I can say, Aubrey, is I remember the good times we had together, and the times I used to look after you. And I still have wonderful feelings about that. So God bless you, and I hope I'll see you...", "image": "https://images.rapgenius.com/a5c861fff630191d052a200b7dfa7e95.500x500x1.jpg"}], "artist": "Drake"}