{"songs": [{"title": "Memories", "album": "Finally Famous Vol. 3: BIG", "year": "2010-08-31", "lyrics": "[Verse 1]\nSometimes I dream bigger than I live\nSometimes I think better when I’m lit\nSo go head and light it\nRoll it up, ignite it\nOne time for all my niggas that dreamed it then real life’d it!\nI swear I’ve been through everything in life but a coffin\nThey say sky’s the limit, how bitch? I’m moonwalking!\nAnd my middle name Michael ho\nSuccess is my idol and being broke is my rival\nBut it’s cool because I got the title ho\nSee I just want my fantasies in real life\nYou got everything tell me what it feel like\nMuthafuck the radio if I can’t hear mine\nThey give the wrong niggas more airtime than airlines\nIs you feeling me?\nIf not you feel my energy\nSee I know I’mma make it, but even if I don’t\nDon’t feel bad cuz honestly all these times that I had\nThose will be the best memories\n\n[Hook]\nBe the best memories\nI hope that you remember me\nThese will be the best memories\nOoooh ohho ooooooooo\nCause in the end all you really have is memories\nOoooh ohho ooooooooo\n\n[Verse 2]\nAre you willing to give up what you love for who you love\nOr lose your girlfriend to groupie love\nEverywhere I go I get a group of hugs\nThat's what happens when they need connections and you the plug\nHow many trends you gotta set til' you considered great?\nHow many missed calls til' you considered fake?\nHow many dreams before its considered fate?\nI’m eating in a world where I’m considered bait\nA workaholic addicted to bills\nPeople addicted to me cuz they addicted to real\nMy best friend got addicted to pills\nI can’t look at him in his eyes, you don’t know how that shit feels mentally!\nI ain't trying to rock no shirts that say “in memory”\nI’m praying that he make it, wishin' we could go back\nCause honestly all the times that we had\nThose be the best memories…\n\n[Hook]\nBe the best memories\nI hope that you remember me\nThese will be the best memories\nOoooh ohho ooooooooo\nCause in the end all you really have is memories\nOoooh ohho ooooooooo\n\n[Verse 3]\nSometimes reality checks are too big to be cashed\nWas mailed one when I heard Nique had died in that crash\nSeemed like yesterday I just seen him smile and laugh\nI’m stressing over little shit\nWhen I should be happy I can\nThey say my music beating, cause I follow my heart\nI always have faith, like who swallows the darts\nAnd with my Mama looking at cribs that we can’t purchase\nHouses bigger than a palace\nBut she a queen, so she deserve it\nSo I’m focused, they try to throw me off track\nBut they just hurdles\nI’m marathoning to the money and you just running off in a circle\nMan, I’m huddled up with my team, in other words my inner circle\nFast forward a few years later\nNow we the fucking winner’s circle\nRemember the first time I was rhyming for Kan’\nAlmost as nervous as the first time I rhymed for my mom\nSold out the theater downtown, she said it was perfect\nBut I already dreamed it\nSo it felt like I rehearsed it\nMuch as my grandma took care of me since I was birthed\nSad I used to steal $20 bill right out her purses\nNo I ain’t perfect, tryna make a gift out of a curse\nLife out of a hearse\nAnd if I die, of course I have the memories..\n\n[Hook]\nBe the best memories\nI hope that you remember me\nThese will be the best memories\nOoooh ohho ooooooooo\nCause in the end all you really have is memories\nOoooh ohho ooooooooo", "image": "https://images.genius.com/77c8c4775e5c1d31fe5ab3d65845291d.500x500x1.jpg"}], "artist": "Big Sean"}