{"songs": [{"title": "Stay In Ur Lane", "album": "Show and Prove", "year": "2006-09-05", "lyrics": "[Intro]\n(Alright, testing, testing, testing\nHey, is this thing on!?\nTesting! Test... Is this thing on?\nCan you hear me back there?\nYeah, well, then shut up!\nAlright? Hey, listen)\nIs that him in the studio?\n\n[Hook]\nThese dudes better stay in they lanes\nAnd keep they brains on the right track\nNow you got a check that you can't cash\nAnd you let your mouth write that\nWe ain't playing, man, the shit get real\nTalk slick, get your life snatched\nAnd don't rest, better guard ya grill\nThat's how it is, cause it's like that\n\n[Verse 1]\nYeah, I move blocks to rude pops and dude drops\nI'm too hot; mix J, Big, and 2Pac\nSo move not, I'm way big and dude shot\nYour crew watch, I'm hot bitch and you not\nI'm not a fake, not a\nNigga that'll pop shit about my cake, holla\nMake dollars\nBut you perp, and you make nada\nNot a man, not a cent, ho I stay propa\nFake scholar, they can let the tre 8's holla\nAnd punk nigga, play dumb, get your face swallowed\nYou not a hustler, dogg\nYou don't know what a half a brick means\nIn rap, you'll get ate, like half of sixteen\nI'll bash your team, dang I'm sickening\nI'm dope, plus coke that'll smash your trip beam, man\nBefore them boys come and lump your face\nWith all that tough talkin', pump your brakes\nEase back shorty\n\n[Hook]\nThese dudes better stay in they lanes\nAnd keep they brains on the right track\nNow you got a check that you can't cash\nAnd you let you mouth write that\nWe ain't playin, man, the shit get real\nTalk slick, get your life snatched\nAnd don't rest, better guard you grill\nThat's how it is, cause it's like that\n\n[Verse 2]\nUh, your rhyming's a waste can\nI mean that it's basic, look\nThe Nin' to your face\nIt'll eat through your face, and then\nI breeze through the place\nNo heat on my waist, but still\nWill eat through your face\nWith knees at his face and grill\nI'm on the move now, high price, big places\nLeave a nigga like them hunneds, with the big face, and\nNiggas try to act bad in them rare cases\nTil that metal's in they mouth, like a pair of braces\nBig bro talk slick up in them fake lines\nSame time, he just another fruit up in the grapevine\nYou see I laugh, clock math, cause I take time\nAnd you trash, bust ass than a waistline\nAnd don't test, cause dude you'll be losing your breath\nGot respect like I'm moving a Tec\nAnd I advise you and your crew be doing your best\nTry and get your mind right, or we'll be moving it left\nNigga\n\n[Hook]\nThese dudes better stay in they lanes\nAnd keep they brains on the right track\nNow you got a check that you can't cash\nAnd you let your mouth write that\nWe ain't playing, man, the shit get real\nTalk slick, get your life snatched\nAnd don't rest, better guard your grill\nThat's how it is, cause it's like that\n\n[Verse 3]\nYou see it's rare that a nigga say he ball\nAnd really got dough\nRare that he say he push coke\nAnd really got blow\nCommon that he claiming that he thug\nBut he not though\nAnd when do a nigga say he spit\nAnd really got flow?\nI ain't playing around\nNot a gangster\nBut if you cross mine, I'll be laying 'em down\nAnd you talk about poppin' your heat\nBut when the beef's on the real OG's\nWill come and rock you to sleep\nCoward\nIn my advice you should think twice\nBefore you cross the path of a real nigga, live the street life\nWho pull cards, and they reach for they heat, right\nAnd you'll get smoked, like the trees in the peace pipe\nMan, they put you in the dirt here\nYou steady throwin' up the set\nBut you ain't never put in work there\nSo all that talk about the gang you bang\nJust stay in your lane\nBefore a shot lay in your frame\n\n[Hook]\nThese dudes better stay in they lanes\nAnd keep they brains on the right track\nNow you got a check that you can't cash\nAnd you let your mouth write that\nWe ain't playing, man, the shit get real\nTalk slick, get your life snatched\nAnd don't rest, better guard your grill\nThat's how it is, cause it's like that", "image": "https://images.genius.com/0cee9f06adc4b497759c94c781db2600.1000x1000x1.jpg"}], "artist": "Wiz Khalifa"}