{"songs": [{"title": "Takeover", "album": "The Blueprint", "year": "2001-09-11", "lyrics": "[Produced by Kanye West]\n\n[Hook]\nR.O.C., we runnin' this rap shit\nMemphis Bleek, we runnin' this rap shit\nB. Mac, we runnin' this rap shit\nFreeway, we run this rap shit\nO & Sparks, we runnin' this rap shit\nChris & Neef, we runnin' this rap shit\n\n[Verse 1]\nThe takeover, the break's over, nigga\nGod MC—me—Jay-Hova\nHey lil soldier, you ain't ready for war\nR.O.C. too strong for y'all\nIt's like bringin' a knife to a gunfight, pen to a test\nYour chest in the line of fire with your thin-ass vest\nYou bringin' them boys to men, how them boys gonna win?\nThis is grown man B.I., get you rolled into triage, bi-atch\nYour reach ain't long enough, dunny\nYour peeps ain't strong enough, fucker\nRoc-A-Fella is the army, better yet the navy\nNiggas'll kidnap your babies, spit at your lady\nWe bring knife to fistfight, kill your drama\nWe kill you motherfuckin' ants with a sledgehammer\nDon't let me do it to you dunny ‘cause I overdo it\nSo you won't confuse it with just rap music\n\n[Hook]\nR.O.C., we runnin' this rap shit\nM Easy, we runnin' this rap shit\nThe Broadstreet Bully, we runnin' this rap shit\nGet zipped up in plastic; when it happens, that's it\nFreeway, we runnin' this rap shit\nO & Sparks, we runnin' this rap shit\nChris & Neef, we runnin' this rap shit\n(\"Watch out! We run New York\")\n\n[Verse 2]\nI don't care if you Mobb Deep, I hold triggers to crews\nYou little fuck, I got money stacks bigger than you\nWhen I was pushin' weight back in '88\nYou was a ballerina, I got the pictures, I seen ya\nThen you dropped \"Shook Ones,\" switched your demeanour\nWell, we don't believe you, you need more people\nRoc-A-Fella students of the game, we passed the class\n‘Cause nobody can read you dudes like we do\nDon't let 'em gas you like \"Jigga is ass and won't clap you.\"\nTrust me on this one, I'll detach you\nMind from spirit, body from soul\nThey'll have to hold a mass, put your body in a hole\nNo, you're not on my level, get your brakes tweaked\nI sold what your whole album sold in my first week\nYou guys don't want it with Hov\nAsk Nas, he don't want it with Hov, no!\n\n[Hook]\nR.O.C., we runnin' this rap shit\nB. Sigel, we running this rap shit\nM Easy, we runnin' this rap shit\nGet zipped up in plastic; when it happens, that's it\nO & Sparks, we runnin' this rap shit\nFreeway, we runnin' this rap shit\nChris & Neef, we runnin' this rap shit\n(\"Watch out! We run New York\")\n\n[Verse 3]\nI know you miss it Nas the (fame)\nBut along with celebrity comes about 70 shots to your frame\nNigga, you a (lame)\nYou's the fag model for Karl Kani, Esco ads\nWent from Nasty Nas to Esco's trash\nHad a spark when you started, but now you're just garbage\nFell from top 10 to not mentioned at all\nTo your bodyguard's \"Oochie Wally\"'s verse better than yours\nMatter of fact, you had the worst flow on the whole fuckin' song\nBut I know: the sun don't shine, then son don't shine\nThat's why your (lame) career's come to an end\nIt's only so long fake thugs can pretend\nNigga, you ain't live it, you witnessed it from your folks' pad\nYou scribbled it in your notepad and created your life\nI showed you your first TEC on tour with Large Professor\nThen I heard your album about your TEC on the dresser\nSo yeah, I sampled your voice, you was usin' it wrong\nYou made it a hot line, I made it a hot song\nAnd you ain't get a coin, nigga, you was gettin' fucked then\nI know who I paid, God – Serchlite publishin'\nUse your (brain) – you said you've been in this 10\nI've been in it five; smarten up, Nas!\nFour albums in 10 years, nigga? I could divide\nThat's one every… let's say two, two of them shits was doo\nOne was \"nah,\" the other was Illmatic\nThat's a one-hot-album-every-10-year average\nAnd that's so (lame)\nNigga, switch up your flow, your shit is garbage\nWhat you tryin' to kick, knowledge?\nYou niggas gonna learn to respect the king\nDon't be the next contestant on that Summer Jam screen\nBecause you-know-who did you-know-what\nWith you-know-who, but let's keep that between me and you\n\n[Hook]\nR.O.C., we runnin' this rap shit\nM Easy, we runnin' this rap shit\nThe Broadstreet Bully, we runnin' this rap shit\nGet zipped up in plastic; when it happens, that's it\nFreeway, we runnin' this rap shit\nO & Sparks, we runnin' this rap shit\nChris & Neef, we runnin' this rap shit\n(\"Watch out! We run New York\")\n\n[Verse 4]\nA wise man told me don't argue with fools\n‘Cause people from a distance can't tell who is who\nSo stop with that childish shit, nigga, I'm grown\nPlease leave it alone, don't throw rocks at the throne\nDo not bark up that tree, that tree will fall on you\nI don't know why your advisers ain't forewarn you\nPlease, not Jay, he's not for play\nI don't slack a minute, all that thug rappin' and gimmicks\nI will end it, all that yappin' be finished\nYou are not deep, you made your bed, now sleep\nDon't make me expose you to them folks that don't know you\nNigga, I know you well, all the stolen jew-els\nTwinkletoes, you're breakin' my heart\nYou can't fuck with me; go play somewhere, I'm busy\nAnd all you other cats throwin' shots at Jigga\nYou only get half a bar – fuck y'all niggas!", "image": "https://images.genius.com/1aebfd816914351eb7010bd441822da8.1000x1000x1.jpg"}], "artist": "JAY-Z"}