{"songs": [{"title": "The Recipe (Remix)", "album": null, "year": "2012-10-22", "lyrics": "[Produced by Scoop DeVille]\n\n[Sample]\nSmoking weed with you\nCause you taught me to\n\n[Intro]\nFuck Black hippy nigga, I invented the recipe\n\n[Verse 1: Ab-Soul]\nIt's a beautiful day I guess\nFor a bitch to roll with Ab-Soul I guess\nPretty Chick let me see them breast\nE.T. OG from the weed clinic (Soulo)\nSolo but I'm never alone (That's Right)\nI stay high and I'm powerful (Soulo)\nWestside (easy call) I got three eyes man I see y'all\nAll I do is kill shit ICU\nParty with a few girls at USC\nIt's 82 degrees and my top off, and they top off\nI'm getting topped off, Top Dawg\nWomen, weed, and weather what more can I say\nTo live and die in LA\nSpend a week on Venice beach\nI'm 2Pac and Biggie Smalls\n\n[Verse 2: ScHoolboy Q]\nEvery morning nigga I get blazed, aye\nWomen, weed, and weather nigga if you bored come and join the wave, aye\nGirl what is your name cause I'm feeling your frame, can I see what you bout, uh\nA little something in your rear, little something in your mouth, little something on your couch, uh\nKnow what I'm talking about, Bring the coffin out\nCause I killed it, I done drilled it\nShe said she like it from the back like a real bitch, uh\nShe swallowed my pride, I damn near cried\nYo I can't reply, she curled my toes and crossed my eyes\nBut when you got the recipe its no surprise\nBad hoes panties get left behind, I want your behind\n\n[Pre-Hook: Kendrick Lamar]\nYou might catch me in Atlanta looking like a boss\nNew Orleans and then Miami, party in New York\nTexas I be screwed up, Chi town I be really pimping\nBut nothing like my hometown I’m forever living\n\n[Hook: Kendrick Lamar & Dr. Dre]\nWomen, weed, and weather\nThey come for women, weed, and weather\nFor the women, weed, and weather\nFrom all around the world for the women, weed, and weather\nGot that women, weed, and weather\nDon't it sound clever, come and play\nWhat more can I say? Welcome to LA\n\n[Verse 3: Kendrick Lamar]\nUhh, my nigga said he wanna fly out to get him\nSome, three W's only for a three-day run, bitch\nTake them mothafuckin' panties off, you ain't no nun, shit\nI be living in the sky every time I ride by them hoes\nRibbon in the sky on the radio cause Stevie know I control\nLet it breathe, I control, California living 'til I am old\nYou want to be on, to peak on the charts\nSo the peons can be gone and pee on their hearts\nShe in the coupe, she in the Neon\nCause she on the BS before we can start\nFuck with a nigga, ride with a nigga\nLet 'em know I'm priority, order me\nHennessey and for my niggas\nOG Killa, call it Jason Voorhees\nBoy he's on his job\nBoy he sure be having the marks on they mark\nPretty bitches and tire marks\nLet 'em inhale them pipe exhausts\nLet 'em reveal how much it cost for this life controlling my vice\nNo way hell no, uh uh\nIf I'm wrong I don't wanna be right\nWe want to be on, to peak on the chart\nSo the peons can be gone and pee on their hearts\nWomen, weed, weather, it's not my fault\nThat it's 82 degrees and my top peeled off\n\n[Pre-Hook: Kendrick Lamar]\nYou might catch me in Atlanta looking like a boss\nNew Orleans and then Miami, party in New York\nTexas I be screwed up, Chi town I be really pimping\nBut nothing like my hometown I’m forever living\n\n[Hook: Kendrick Lamar & Dr. Dre]\nWomen, weed, and weather\nThey come for women, weed, and weather\nFor the women, weed, and weather\nFrom all around the world for the women, weed, and weather\nGot that women, weed, and weather\nDon't it sound clever, come and play\nWhat more can I say? Welcome to LA\n\n[Verse 4: Jay Rock]\nJay Rock got the recipe\nFly hoes wanna roll I guess (I guess)\nEverybody know I got that Yola\nAsk Keisha she'll confess\nI wake up then I bake up with a bad bitch she ain't got on no makeup, uh\nMedicated, please my nigga no telling where the high gonna take us, uh\nThree w's, I'm at the W, She got double D's bout to bring trouble through\nOG, Hennessy get their panties wet, I'm trying to dive in the swimming pool\nLeft stroke, right stroke, whats the best stroke\nThat stroke can smoke all down her throat\nAnd we blows all kinds of dro\nCali got the best so act like you know, nigga\n\n[Pre-Hook: Kendrick Lamar]\nYou might catch me in Atlanta looking like a boss\nNew Orleans and then Miami, party in New York\nTexas I be screwed up, Chi town I be really pimping\nBut nothing like my hometown I’m forever living\n\n[Hook: Kendrick Lamar & Dr. Dre]\nWomen, weed, and weather\nThey come for women, weed, and weather\nFor the women, weed, and weather\nFrom all around the world for the women, weed, and weather\nGot that women, weed, and weather\nDon't it sound clever, come and play\nWhat more can I say? Welcome to LA", "image": "https://images.rapgenius.com/by8dnoiat5fe4tp8eugoagwpv.300x300x1.jpg"}], "artist": "Kendrick Lamar"}