{"songs": [{"title": "Auditorium w/ the Ruler", "album": null, "year": null, "lyrics": "[Intro]\nPeace\nAh\nPeace, peace, peace, peace, peace, peace, power\nMad Liberator, Def Operator\nRock the data, amazing flavor\n\nYo\nThe way I feel sometimes it's too hard to sit still\nThings are so passionate, times are so real\nSometimes I try an chill mellow down blowin' smoke\nSmile on my face but it's really no joke\n\nYou feel it in the streets, the people breathe without hope\nThey goin' through the motion, they dimmin' down, they focus\nThe focus gettin' clear and the light turn sharp\nAnd the eyes go teary, the mind grow weary\n\nI speak it so clearly, sometimes ya don't hear me\nI push it past the bass, no nations gotta feel me\nI feel it in my bones, black, I'm so wide awake\nThat I hardly ever sleep, my flows forever deep\nAnd it's volumes or scriptures when I breath on a beat\n\nMy presence speak volumes before I say a word\nI'm everywhere, penthouse, pavement and curb\nCradle to the grave, talk'll lead you on a shell\nUniversal ghetto life holla black, you know it well\n\nQuiet storm, vital form pen pushed it right across\nMind is a vital force, high level right across\nShoulders the lions raw voice is the siren\nI swing round, ring out and bring down the tyrant\n\nShocked, a small act could knock a giant lopsided\nThe world is so dangerous, there's no need for fightin'\nSuttins tryna hide like the struggle won't find 'em\nAnd the sun bust through the clouds to clearly remind him\n\nEverywhere, penthouse, pavement and curb\nCradle to the grave, talk'll lead you on a shell\nUniversal ghetto life holla black, you know it well\n\nWhat it is? You know, they know\nWhat it is? We know, y'all know\nWhat is is? Ecstatic, there it is\nHuh\n\nWhat it is? You know, we know\nWhat it is? They know, y'all know\nWhat it is? You don't know? Here it is\n\nWhat it is? You know, we know\nWhat it is? They know, y'all know\nWhat it is? You don't know? Here it is\n\nPeace, power, fantastic, original\nAnd always on time, and rocking your mind, it's like\n\nSit and come, relax, riddle off the mac, it's the patch\nI'ma soldier in the middle of Iraq\nWell, say about noonish commin' out the whip\nAnd lookin' at me curious, a young Iraqi kid\n\nCarrying laundry, what's wrong G, hungry?\nNo, gimme oil or get fuck out my country\nAnd in Arabian barkin' other stuff\nTill his moms come grab him and they walk off in a rush\n\nDistrust, bitter like I's pissed off on moon\nI'm like \"Shorty, hope that we can fix our differences soon! Bye!\"\nBuying apples, I'm breaking 'em\nBrooklyn take everything, why not just take the damn food Black bastard\nI don't understand it, on another planet?\n15 months of this stuff, how I'm gonna manage?\nAnd increasing the sentiment, gentlemen\nGetting down on their Middle-Eastern instruments\nRealized trapped in this crap\nWalk over, kicked one of my fabulous raps (La-dee Da-dee)\nArab jaws dropped, they well wished, they glad wrapped\nNow the kid considered like an Elvis of Baghdad\n\nWhat it is?\n[?]\nWhat it is?\n[?]\n\nWhat it is? You know, they know\nWhat it is? We know, y'all know\nWhat is is? Ecstatic, there it is\nHuh\n\nWhat it is? You know, we know\nWhat it is? They know, y'all know\nWhat it is? You don't know? Here it is\n\nWhat it is? You know, we know\nWhat it is? They know, y'all know\nWhat it is? You don't know? Here it is\nParapapa parapapaparapa\nParapapa parapapaparapa\nZazaziru papariziru papariziru papari keep on...pa\n[Inaudible]", "image": "https://images.genius.com/4d1a9757d430776710118a3e0ba4658f.1000x667x1.jpg"}], "artist": "Yasiin Bey"}