{"songs": [{"title": "Drexel University Performance", "album": null, "year": null, "lyrics": "[Verse 1- Childish Gambino]\n\nPlease text me, text me, and emoji me\nText me, just want emoji, just so I can see what you thinking\nI don't know what you thinking\nI texted you like five hours ago and I don't know what you thinking\nDo you hate me? Do you love me? Do you think I'm stupid?\nAre you saying we should be together; we should move in together?\nOr should you say you have my babies?\nAnd be my baby mama, I fell in love with you to be my baby mama\nFrom a like a day and a half\nI needed you when I asked\nI'm grabbing you after class\nWe dancing together, we used to go out like every single Friday\nKissing you in your mouth, we make out in the hallway\nI'm so in love with you\nI think about you every day I'm so in love with you\nAin't no one above you\nAin't nobody telling me I'm acting like I'm feeling\nWhen I'm freestlying out my mouth, and I don't know what to say\nEvery time I see your face, I don't know what to say\nA lot of girls in the audience think I'm talking about Jhene\nI don't think about (?)\nGet it together my head, I'm doing what I'm doing\nScrewing up from the top, man I'd like to make you mine\n\n[Hook]\n\nBut, you're so far away\nSo far away\nNo no\nAnd I'd wish you'd come back, come back, come back (x2)\n\n[Verse 2- Steve G. Lover]\nI be looking with a flashlight\nEspecially if cute with her ass right\nI met her at the Drexel, spread it like a pretzel\nYou know Steve is the best though\nMove it like I normally do\nMy crew, we so sick like we all had the Flu\nThat's swine, you know I be taking my time\nI love a young lady and she (?) too fine\nWith a hat to the front that's cool, or glasses\nYou know me, I skip classes\nBut I'm still high, like high school\nStill so fly, like flight school\nI'm a young jet, plus a young vet\nA nigga young (?) he go New York Nets\nRoyalty forever\n\n[Hook]\nEvery time I see you girl, you're so far away\n\n[Verse 3- Childish Gambino]\n\nBring it down for a second\nJust bring it down a second\nBring it down for a second\nBring it down for a second\nTalk about the movies that we hate\nI used to kiss you and be like 'Pete's sake'\nFor Pete's sake, I got that money in my wallet like a fucking Philly cheese steak\nI got a million and a half\nThey used to tell me I wouldn't get a million and a half\nBut you knew me back when I ain't have enough to ride the subway\nNow you call me all day saying like 'why you saying that them girls or them girls'\nI though we supposed to get married when we both turned thirty\nAnd when you said that, that shit really kinda hurt me\nBecause, I made that promise. I broke that promise\nI'm tryna get back, but that's behind us\nBut now I wanna see exactly where you going, or where you coming\nYour boyfriend telling you that you be jamming\n\nYou're so far away\nIf you hold my hand, we can be together forever\nBut you don't wanna say that no more\nYou just wanna say I'm on tour\nSo now I'm sitting here on the floor\nBecause you're so far away\n\nYo, ayo but fuck that, you told me not to call you all the time\nAnd now you mad I'm your mind and I'm on your mouth motherfucker, my god\nGonna kick that shit, pop that pop\nGonna get down till that drop\n(?) bitch\nYou gonna talk that? Talk that? Talk that shit behind my back?\n(?)\nTold me that I'm not that but I'm on that, and I rock shit\n(?)\nBut they know me here, walking around with your hands in the air\n\nSo. Far. Away. (x2)\nI'm so far away", "image": "https://images.genius.com/5a9c598da4e86fefcb845cbbe74706aa.1000x1000x1.jpg"}], "artist": "Childish Gambino"}