{"songs": [{"title": "Get High", "album": "Block Wars Original Soundtrack", "year": "2016-07-24", "lyrics": "[Verse 1]\nI'm like Method Man and Red Man with the swishers\nBlowing chronic out my mouth while they taking pictures\nI tell that bitch drop that ass like she hit the switches\nI take the phone and take a selfie while I'm fuckin' bitches (take that heat, yeah)\nNow bounce to a nigga that know Dre and O'Shea\nI kill that pussy like OJ and no way a nigga gonna outsmoke me\nI smoke more than B Real and that nigga Snoop D-O-double G\nThrow up the Westside, even if your fuckin' rag on the left side\nTonight I'm fuckin' with you, two ice cubes in my cup\nA little Henny, nigga with an attitude, what's up?\nYeah, 6-4 Impala and I'm outta there\nBitch riding shotgun, looking like a bobble head\nWait, wait, wait for a minute and let a nigga roll his blunt (get high)\n\n[Hook]\nIf you still fuck with Dr. Dre (get high)\nIf you miss 2Pac and Nate (let's get high)\nI mean, every time you come to LA (get high)\nAin't it good to you? (yeah, yeah)\nThe doc said I had a weed addiction\nSo I'm smoking this chronic with no prescription, (get high)\nBreak it down, get a blunt and twist it\nGame got his own strain, Doc 2 edition\n\n[Verse 2]\nWhen I say roll it up, roll it up trick\nIt's Aftermath, let 'em know who you fuckin' with\nAll we do is smoke and get high\nWe be having zips, let 'em smell this shit\n35 Million and I still might sell this shit\nGray smoke, elephant\nLook around this party, ain't this motherfucka hella lit?\nThese niggas is zeros, we came with pre-rolls\nSame niggas used to moving kilos, (get high)\nYeah, all fuckin' day nigga\nSee me bouncin' in the six-six-tre\nLike I won't let this motherfucking terror destroy\nThree-wheeling with a cloud of kush in my jaw\nThousand dollar blunts, what a nigga want?\nPistol grip pump, ride with it in the fuckin' trunk\nCalifornia skunk, nigga this the funk\nTop of the Roscoe's with the front, my Impala, (get high)\n\n[Hook]\nIf you still fuck with Dr. Dre (get high)\nIf you miss 2Pac and Nate, let's (get high)\nI mean, every time you come to LA (get high)\nAin't it good to you? (yeah, yeah)\nThe doc said I had a weed addiction\nSo I'm smoking this chronic with no prescription (get high)\nBreak it down, get a blunt and twist it\nGame got his own strain, Doc 2 edition (get high)", "image": "https://images.genius.com/e3f4fc097719794050d92c29bcdec825.1000x1000x1.jpg"}], "artist": "The Game"}