{"songs": [{"title": "The Heart Part 4", "album": null, "year": "2017-03-23", "lyrics": "[Hook]\nDon't tell a lie on me\nI won’t tell the truth 'bout you\nDon't tell a lie on me\nI won’t tell the truth 'bout you\n\n[Verse 1]\nThirty millions later, my future favors\nThe legendary status of a hip-hop rhyme savior\nTravel 'round the atlas in this spaceship\nCandy-coated, my day shift's\nBeen devoted to fuckin' up bundles of paper\nPi equals three-fourteen\nThe devil's pie is big enough to justify the whole thing\nWait up, lampin' in Jamaica\nThe clouds turnin', my thoughts turnin’\nBurnin’ castor oil, yo I been determined to make an earnin'\nThis seed in this soil is classified\nI’m satisfied when I strategize my kid's future\nI ain't sanctified enough to say that I won't shoot ya\nI done vandalized the industry full circuit\nThe earthiest slash thirstiest nigga you know versus this\nScum of a land that transcend two surfaces\nThe richer the poorer, the bigger the picture\nThe more blood pours, but—\n\n[Hook]\nDon’t tell a lie on me\nI won't tell the truth 'bout you\nDon't tell a lie on me\nI won't tell the truth 'bout you\n\n[Verse 2]\nMy fans can't wait for me to son ya punk-ass\nAnd crush ya whole lil' shit\nI'll Big Pun ya punk-ass, you a scared lil' bitch\nTiptoein' around my name, nigga, you lame\nAnd when I get at you, homie\nDon't you just tell me you was just playin'\nOh, I was just playin', K-Dot\nC'mon, you know a nigga rock with you, bro\nShut the fuck up, you sound like the last nigga I know\nMight end up like the last nigga I know\nOh, you don't wanna clash? Nigga, I know\nI put my foot on the gas, head on the floor\nHoppin' out before the vehicle crash, I'm on a roll\nYellin', \"One, two, three, four, five\nI am the greatest rapper alive\"\nSo damn great, motherfucker, I've died\nWhat you hearin' now is a paranormal vibe\nHouse on the hill, house on the beach, nigga (facts)\nA condo in Compton, I'm still in reach, nigga (facts)\nI'm fresh out the water, I'm 'bout to breach, nigga\nThe five-foot giant woke up out of his sleep, nigga\nOh yeah, oh yeah, mo' cars, mo' lears\nMo' bars, no peers, no scars, no fear—fuck y'all, sincere\nI heard the whispers, I curved the whispers\nYou know what the risk is\nEarthed in ditches, your body revertin' to stiffness\nThe whole world gone mad\nBodies is addin' up, market's about to crash\nNiggas is fake rich, bitches is fake bad\nBlacks that act white, whites that do the dab\nDonald Trump is a chump\nKnow how we feel, punk—tell him that God comin'\nAnd Russia need a replay button, y'all up to somethin'\nElectorial votes look like memorial votes\nBut America's truth ain't ignorin' the votes\nIt's blasphemy, how many gon' blast for me?\nI prophesized on my last song, you laughed at me\nBut when the shit get brackin', don't you ask for me\nHow many leaders gon' tell you the truth after me?\nG Malone, big bro, kudos to him\nI was two O's from a M, tryna be big as Em\nThirty millions later, my future favors\nThe legendary status of a hip-hop rhyme savior\nSalmon and capers, fame and lawsuits\nYou lookin' at me in Chucks, I'm lookin' at y'all suits\nMe and Top Dawg playin' rock-paper-scissors in court\nA real hustler lose money just to go get some more\nI said it's like that, dropped one classic, came right back\n'Nother classic, right back\nMy next album, the whole industry on a ice pack\nWith TOC, you see the flames\nIn my E-Y-E's—it's not a game\nAnd the whole world is goin' mad, daddy, it's sad, daddy\nMy only advice? Go and get you a bag, daddy\nLee Baca on trial tryna portray a boxer\nBeatin' up on my niggas while the CO's watch him\nTables turned, lesson learned, my best look\nYou jumped sides on me, now you 'bout to meet Westbrook\nGo celebrate with your team and let victory vouch you\nJust know, the next game played I might slap the shit out you\nTechnical foul, I'm flagrant, I'm foul\nThey throwin' me out, you throw in the towel\nLook at the crowd, they— (Naw, I don't like that)\nLook at my smile, I'm smirkin'\nCalm but urgent (That ain't the style, fuck!)\nSo many verses, you live in denial (Fuck!)\nSo many verses, I never run out (What?)\nYou makin' him nervous, the music is loud\nHo, JAY-Z Hall of Fame, sit yo punk-ass down!\n(Sit yo punk-ass down)\nSo that means you ain't bigger than rapping (What else?)\nSo that means no more playin' the back scenes (What else?)\nMy spot is solidified if you ask me (What else?)\nMy name is identified as \"That King\"\nI'll let y'all worry about a list, I'm on some other shit\nA difference between accomplishments and astonishments\nYou know what time it is, ante up, this is in forever\nY'all got 'til April the 7th to get y'all shit together\n\n[Outro]\nLet's get it!\nLook, look!\nOn foenem", "image": "https://images.genius.com/c8fc429c3dc3b82b2b27b274debff4e1.1000x1000x1.jpg"}], "artist": "Kendrick Lamar"}