{"songs": [{"title": "Pac’s Life", "album": "Pac’s Life", "year": "2006-11-21", "lyrics": "[Intro: L.T. Hutton]\nUh oh, uh oh, oh! Oh! Oh!\nThey ain't ready for this\nL.T. Hutton, T.I., Ashanti\nIt's that new 'Pac, y'all\n\n[Chorus: Ashanti + (2Pac)]\nPac's life (Everybody needs to chill)\nEverybody talkin' 'bout Pac's life\n(It's 2Pac the king)\nWhat do you know about Pac's life?\nWhat do you know? What do you know?\n(Only real niggas stay on top)\nEverybody talkin' 'bout Pac's life (Outlawz)\n\n[Verse 1: 2Pac]\nStarted with five shots, niggas plottin' to kill him\nNever figured that that same nigga sell five million\nHit the charts like a madman, nothin' but hits\nCourt cases got a nigga facin' multiple digits\nDodgin' cop cars, look at how we come so far\nPicture a high school drop-out roll in a double R\nHouse full of happiness, weed and drank\nWay out, so when trouble tried to find me – can't\nNever visioned livin' longer than my twenty first\nThought I'd be locked down, cracked out, or in the dirt\nAnd though it hurts to see the change, it comes with the fame\nWatch them gossip in this silly game\nTo all the motherfuckers speakin' down on me, this is the night\nWhy's everybody caught up in Pac's life?\nTo all y'all niggas conversatin' on my life\nMind your motherfuckin' business!\n\n[Chorus: Ashanti + (2Pac) & T.I.]\nPac's life (Everybody needs to chill)\nEverybody talkin' 'bout Pac's life\nWhat do you know about Pac's life?\nWhat do you know? What do you know?\n(Only real niggas stay on top)\nEverybody talkin' 'bout Pac's life (Outlawz)\nI remember that, ayy\n\n[Verse 2: T.I]\nWhat's happenin', Pac? Yeah, I know we never got to meet\nBut we know all the same people so we got to speak\nYou taught me first: fake niggas can't stop a G\nAnd all the shit you went through meant a lot to me\nBut when they locked you up for nothin', it was a shame to see\nYou know the crackers came, they did the same thang to me\nI get along with real niggas, it's the lane to be\nTalkin' loud out of pocket tryna bang with me\nAnd so I pull it out my pocket, let it rain, you see\nNow they all in the courtroom, blamin' me\nSee, we ain't live the same life but represent the same struggle\nPower to the real niggas, death to the suckers\nMoney over bitches, get to know 'em for you love 'em\nDeath before dishonour, never talk to undercovers\nLive by the same rules, so minus the tattoos\nWe the same sort of dude with the same short fuse\n\n[Chorus: Ashanti + (2Pac)]\nPac's life (Everybody needs to chill)\nEverybody talkin' 'bout Pac's life\nWhat do you know about Pac's life?\nWhat do you know? What do you know?\n(Only real niggas stay on top)\nEverybody talkin' 'bout Pac's life\n\n[Verse 3: 2Pac]\nI want money in large amounts\nMy garage full of cars that bounce\nMovin' my tapes in major weight 'cause every dollar counts\nBusters is jealous and half these niggas is punks\nThey runnin' off at the mouth 'til I fill it up with my pump\nThey jump, my automatic keep 'em weary\nWhile you frontin' like you Billy Badass, nigga, you scary\nI been knowin' you for years, we was high school peers\nIn Junior High I was itchin' to kill, and you was ready to die\nWhile you bullshittin' niggas was dyin' and catchin' cases\nBustin' my automatics at motherfuckers in foreign places\nLeavin' no trace, they see my face and they buried\nBitches die in a hurry, still I ride, I'm never worried\nMr. Makaveli tell me to ride, and I'ma ride\nPick my enemies out the crowd, and motherfuckers die\nIt's not the way I wanna live, my nigga, it's how it is\nOnly real niggas stay on top, word up!\n\n[Chorus: Ashanti + (2Pac)]\nPac's life (Everybody needs to chill)\nEverybody talkin' 'bout Pac's life\n(Why y'all niggas all up in my shit?)\nWhat do you know about Pac's life?\n(Tell them motherfuckers!)\nWhat do you know? What do you know?\nEverybody talkin' 'bout Pac's life\n(Outlawz, fuck all y'all!)", "image": "https://images.genius.com/7f0e7d35c3475ff32f884c7f54e6de7d.1000x1000x1.jpg"}], "artist": "2Pac"}