{"songs": [{"title": "Big Fish", "album": "The Big Day", "year": "2019-07-26", "lyrics": "[Intro: Gucci Mane]\nUh\n\n[Verse 1: Chance the Rapper]\nBirdman handrub\nThis shit fit me like a damn glove\nShit cleaner than a hand scrub\nFeel better than DJ Khaled fan love\nThis the rock that gave pride to a man cub\nAin't no love in hip-hop\nThere ain’t no keepin' up with the Bennetts\nAin't no diamonds in the chain but it’s in the pendant\nI only own fishbowls, but my rentals tinted\nYou know I'm used to movin' units like rental tenant\nReal lieutenant, God's army\nHe like a doctor, he'll never let a shot harm me\nI'm a force in the field, I never take damage\nI create panic 'cause niggas wanna act fake satanic\nAnd the labels get straight frantic\nTheir boardrooms look like eight Channing Tatums and a Peyton Manning\nAnd they all been married\nThey celebrate anniversaries and nurseries and try to play Santa\nBut they don't sell marriage no more\nGuess bein’ all alone ain’t so scary no more (Guess not)\nGuess our lives ain't for sharin’ no more\nGuess the tale can't end like a fairy no more, but...\n\n[Chorus: Chance the Rapper & Gucci Mane]\nI swear my story just like big fish\nI've seen hoes, I was always just like \"Which? Which?\"\nOne day, big catch, hit the bait and switch switch\nI was on the line, I became the big fish, yeah\nI swear my story just like big fish\nI've seen hoes, I was always just like \"Which? Which?\"\nOne day, big catch, hit the bait and switch switch (Uh)\nI was on the line, I became the big fish, yeah\n\n[Verse 2: Gucci Mane]\nAnything is possible if Gucci can do it (It’s Gucci)\nTractor trailer full of kush, bet Gucci could move it\nUsed to drive a Buick, now a Rolls Royce (Right)\nI'm the young hoes' choice that make the old hoes moist\nAll these millions separate all the men from the boys\nAll these wars I went through, felt like a soldier deployed\nI'm the trap god but I give the glory to God\nIt's a knife on my K and my tongue is a sword\nI'm the plug and the cord, get it all in accord\nWhite rings seasick, Gucci went overboard\nHublot surfboard, brought sand to the beach\nAll white tux on, brought the church to the streets (It's Gucci)\n\n[Interlude: Gucci Mane]\nYeah, Chance the Rapper, Guwop the Trapper\nHuh, we just out here leadin' by example\nYeah, stand for something and fall for anything\nKings and Queens\n\n[Chorus: Chance the Rapper]\nI swear my story just like big fish\nI've seen hoes, I was always just like \"Which? Which?\"\nOne day, big catch, hit the bait and switch switch\nI was on the line, I became the big fish, yeah\nI swear my story just like big fish\nI've seen hoes, I was always just like \"Which? Which?\"\nOne day, big catch, hit the bait and switch switch\nI was on the line, I became the big fish, yeah", "image": "https://images.genius.com/102754ce389c900531057dd11508c674.1000x1000x1.png"}], "artist": "Chance the Rapper"}