{"songs": [{"title": "Hustle & Ball", "album": "Da Game is to be Sold, Not to be Told", "year": "1998-08-04", "lyrics": "[Intro]\nYo whats up P\nYeah man these niggas think that I done fell off man\nThink my shit done got weak I guess\nShit nigga I been hustlin' grindin' like a motherfucka\nI ain't went nowhere knowwhatImean?\nShit guess I got to let these niggas know who I am\nWhat I stand for and what I'm about huh\nYou feel me check this out BITCH!!\n\n[Chorus]\nWhat's my motherfucking name? Snoop Dogg\nWhat I like to do? You like to hustle and ball\nHold up, what's my name? Snoop Dogg\nWhat I like to do? You like to hustle and ball\nSay what? What's my name? Snoop Dogg\nWhat I like to do? You like to hustle and ball\nYeah, what's my name? Snoop Dogg\nWhat I like to do? You like to hustle and ball\n\n[Verse 1]\nI get up early in the mourning and begin my mission\nBrush my teeth then I creeps to the kitchen\nCook some bacon and eggs and put some braids in my head\nStash this pound, put the shit down then I head\nTo the spot that's hot, fuck a fed\nI gotta clock this knot ya heard what I said\nI'm taking penitentiary  chances, dancin with the devil\nI'm in it to win it for No Limit nigga next level\nA whole lot of y'all niggas out there walk around dead here take this\nShovel\nDig your own grave, your pushin on them pebbles\nStand out there on that corner long enough and watch what happen\nQuit yappin about what you ain't got and get crackin now that's what\nHappenin\nAin't nobody give me shit I took it\nNigga straight now but I started off crooked\nNow look at all the shit I been through and I'm 'fen to\nGet what I gotta get cause I'm just straight down for this shit\nNow\n\n[Chorus]\nWhat's my motherfucking name? Snoop Dogg\nWhat I like to do? You like to hustle and ball\nHold up, what's my name? Snoop Dogg\nWhat I like to do? You like to hustle and ball\nSay what? What's my name? Snoop Dogg\nWhat I like to do? You like to hustle and ball\nYeah, what's my name? Snoop Dogg\nWhat I like to do? You like to hustle and ball\n\n[Verse 2]\nThey say money is the key to end all your woes\nThat's probably why I love it and can't stand them hoes\nI chop trees with G's and take trips overseas\nAnd pack a nine all the time and that's for all my enemies\nWhat y'all thought, I can't get caught\nIt ain't my mothfucking fault they call mister seasoning salt\nI'm bringing Gangsta shit to this No Limit click\nI'm way down south in a house and I'm bangin this shit\nI got gold around my neck that will never ever fade\nRolex watch on my wrist nigga getting paid\nThat's all I live fo , you dig it\nGame is to be sold not to be told that what my nigga P said can you\nFeel it\nWhat y'all niggas knockin me fo and watching me fo\nWhile your bitch jocking me and clocking this doe\nBoy that sound like the old Snoop Dogg, shit I'm trying to get paid\nPapered up and trying to ball y'all feel me\nAvoiding the snitches and the and the bitches too\nAnd the fake ass snake ass niggas which is you nigga fuck you\nI buck you you I stick you I stuck you\nI love making that music that y'all niggas say y'all drugs to\n\n[Chorus]\nWhat's my motherfucking name? Snoop Dogg\nWhat I like to do? You like to hustle and ball\n\n[Outro]\nBow-wow\nGame recognize game\nNow you know how a gangsta gangsta\nYou how a hustler hustle\nAnd you know how a baller balls\nThat's what you get when you fucking with Snoop Dogg\nStraight up '98 No Limit records\nYou feel me that's real ha ha yeah\nHustle & Ball That's all we do\nAll the real hustlers out there gone and give it up\nYeah get your money money get your money\nKeep your heat get your money money", "image": "https://images.genius.com/cc7312525ce26f443efc158446aeedc3.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}