{"songs": [{"title": "For All My Niggaz & Bitches", "album": "Doggystyle", "year": "1993-11-23", "lyrics": "[Verse 1: Kurupt]\nWell it's that slow flow, D-O-double-G, nigga\nSee these other fools but you can't see me, nigga\nWho am I? [It's Kurupt motherfucker]\nDo or die [We gives a fuck motherfucker]\nSo slow your roll, I'm In Control like Janet\nThe loc-est twenty-one year old nigga that's on this planet\nTake it for granted, if ya wanna, cuz I'm gonna\nGrab my strap then clear the corner, beeotch!!\n\n[Chorus: Snoop Dogg]\nSo all my bitches and my niggas and my niggas and my bitches\nWave your motherfuckin hands in the air\nAnd if you don't give a shit like we don't give a shit\nWave your motherfuckin fingers in the air\nTo all my niggas and my bitches and my bitches and my niggas\nWave your motherfuckin hands in the air\nAnd if you don’t give a fuck like we don’t give a fuck\nKeep your motherfuckin hands in the air\n\n[Verse 2: Daz]\nNow on a one, two, three who could it be\nComin with a grip of gangsta shit for ninety-three\nSo ninety-four's arrived nigga, back on up\nAnd let me and my Dogg Kurupt fuck shit up\nNow can't nobody see me here or there\nWherever I bails, I put it down all around\nCuz ain't shit for sale in the Coupe\nWith the beat flossin off gold D's\nAnd my cousin Snoop packs well, you know what I mean\nAnd it don't take much, for the Dogg Pound to bust a cap\nIn your ass, for gettin us all fucked up\nNow check it, it's a callin for niggas like Doggs\nWho supposed to be the shit, but steadily bitchin like hoes\n(Yes y'all) other Doggs (yes y'all) Yiggy y'all\nStay full of that gin and juice and have a ball\n\n[Verse 3: Kurupt]\nI packs a strap, like that, I kicks it like this\nNow how many bitches must get dicked?\nBefore they say, that Daz is that nigga from back in the day\nYa never ever thought I'd see him bustin with Dr. Dre\nCuz I grips mics, I rips mics in half\nHoes be comin to my flat so I can tap that ass\n\n[Chorus: Snoop Dogg]\nSo all my bitches and my niggas and my niggas and my bitches\nWave your motherfuckin hands in the air\nAnd if you don't give a shit like we don't give a shit\nWave your motherfuckin fingers in the air\nTo all my niggas and my bitches and my bitches and my niggas\nWave your motherfuckin hands in the air\nAnd if you don’t give a fuck like we don’t give a fuck\nKeep your motherfuckin hands in the air\n\n[Verse 4: Kurupt]\nYou're headed my way, nigga you best to hit a U-turn quick\nSo what's happenin? I'm cappin shit up like a Western flick\nThe kingpin of the clique, top notch\n17 shot Glock cocked, so all nigga drop\nThe run of the mill fool get broke off for tryin to serve\nThe best Kurupt's era, peep the terror, cuz it's a murder fest\nI smoke chronic every day, so what have we\nAnother motherfucker, gettin served like some cavy\nNow who, drops (ruff rhymes) I got the juice like 2Pac\n(plus I'm) rollin with two Glocks\nFly motherfuckers can't see Kurupt\nHellraisin like Pinhead, beware I'm tearin shit the fuck up\nSlow your roll, like your legs was broken\nWho's jokin? Rakim never joked, so why should I loc?\nNow that's my idol, check the vital rhyme flow doe\nRunnin em like Flo Jo, stranded on Death Row\nMediocre motherfuckers die cuz I'm servin and\nThey can't fuck with or see me I'm mass murderous\n[Smokin indo, look out my window I suppose] Yeah\n[Niggas don't understand how we kicks diffrent flows]\n(I'm raw like news footage) I'm rugged like a BF Goodrich\n(Bring your whole set and get your hood lynched)\n[Drop to your knees like a dog in heat]\nPeep the murderous styles and the poetical techniques\n\n[Chorus: Snoop Dogg]\nSo all my bitches and my niggas and my niggas and my bitches\nWave your motherfuckin hands in the air\nAnd if you don't give a shit like we don't give a shit\nKeep your motherfuckin fingers in the air\nTo all my niggas and my bitches and my bitches and my niggas\nWave your motherfuckin hands in the air\nAnd if you don’t give a fuck like we don’t give a fuck\nKeep your motherfuckin fingers in the air\n\n[Verse 5: Lady of Rage]\nCheck it out, it's Rage, ready for the breakdown\nTake down, when it comes to the mic I'm puttin my weight down\nAnd that's 175 pounds of beef\nBeatin' yo' ass down to the concrete\nFool, act like ya know\nI'm stranded on Death Row with no where to go, so\nWhat's a girl to do\nTake out a crew, or two, a few, what you wanna do?\n\n[Outro]\n[Snoop] Throw your guns in the motherfuckin air, we don't care\n[Dogg Pound] Niggas don't give a fuck nigga\n[Snoop] About nuthin at all, just my Doggs and clockin the grip bitch\n[Dogg Pound] Niggas don't give a fuck nigga\n[Snoop] That's why I can kick it so tuff, cuz when times get ruff, my\n[Dogg Pound] Niggas don't give a fuck nigga\n[Snoop] The clique I'm with, don't give a sheeit, ya know why?\n[Dogg Pound] Real niggas don't give a fuck\n\n[Chorus: Snoop Dogg]\nSo all my bitches and my niggas and my niggas and my bitches\nWave your motherfuckin hands in the air\nAnd if you don't give a shit like we don't give a shit\nWave your motherfuckin fingers in the air\nTo all my niggas and my bitches and my bitches and my niggas\nWave your motherfuckin hands in the air\nAnd if you don’t give a fuck like we don’t give a fuck\nKeep your motherfuckin hands in the air", "image": "https://images.genius.com/d31a03639b8f8f4259b9b9da07972d52.996x1000x1.jpg"}], "artist": "Snoop Dogg"}