{"songs": [{"title": "I Got This Beat In My Head", "album": null, "year": "2015-05-14", "lyrics": "[Verse 1]\nWell, off the walls with these raps\nBetter call ya homies off, cause we back\nHad it locked all along, I'm not falling off\nI'm too smart to fall for these traps\nSitting in the parking lot, my seat back\nGetting topped off some mornings, freeze that\nGotta be a God with all of these racks\nI don't wanna talk to y'all, the flow Alcamo\nAnd I'm finding this hard to relax\nWonder where my mind has gone, I've seemed sad\nWhen you try'na hide from us, I'm the final boss, and the chance for y'all to feed Mac\nBitches started, wanna be that\nHomie you be lying wanna be all I spit facts\nThese motherfuckers wanna hold me back\nAnd they got me blinded all I see's fact\nTalking 'bout a rematch, I be in the belly of the beast playing Dreamcast\nTell me where the weed at\nGet that up, little homie don't need that\nI forgot my head, skip to my lou bitch\nI jumped off the ledge\nI like to geek by myself, this is no cry for help\nI jumped off of the deep end\nMe and my homies we out here\nThere's not much around here\nCome jump off the deep end\n\n[Bridge] (x2)\nWe really do this (music, music, music, music, music, music) yeah\n\n[Hook]\nThese motherfuckers can't fuck with my style\nHuman like me though, you don't come around me\nVerses get buried six feet underground\nI been waiting so long for what's coming now\nAnd fuck what you heard\nYou want to see realness then come to the 'Burgh\nIt's up in the air, but be sure that everything we do is pure\nWhen will these motherfuckers learn?\nWhen will these motherfuckers learn?\nWhen will these motherfuckers learn?\n\n[Verse 2]\nY'all is boring, I've been scoring with a foreign-born model\nShooting porno then I fall asleep\nAll the Z's Zorro, I'm not sure though\nWhy did Lizzie McGuire never fuck Gordo?\nEating sushi, copping Toro\nWe surviving, it's a war zone out here\nSee, I'm far from normal out here\nRocking fleece when I'm on the beach, I snorkel out here\nYes I'm weird, do not fear the other world that I revere\nAnd stay clear of all the bad guys, cool you in the clear\nIn the rain, I ain't scared, shit I really can't complain\nI don't like what's down the drain, but it's cool, let me explain\nI'm alive, I'm okay, do not entertain the lies that they say\nYou gon' find your way, we just take up space here", "image": "https://images.genius.com/70b2ca5e1882a2f184d45a2e6ccb37eb.916x916x1.jpg"}], "artist": "Mac Miller"}