{"songs": [{"title": "You Know Who", "album": "King", "year": "2006-03-28", "lyrics": "[Intro]\nAlright man, y'all win\nI won't say it,...at least for this song, hey\n\n[Verse 1]\nSaid they lookin for the realest, well I'm real as it get\nRap to the nigga dealin hard who livin in jets\nTil some better nigga wit her, ain't delivered 'em yet\nMy mouth big but I got a pistol bigger than that\nI live and die by my respect so I honor the code\nPeep niggas who be out here flexin, stuntin for hoes\nAnd if you ain't never chose to remember nothin before\nJust know the game is some you win, it's somthing ya know\nBut if you already begin again, start, it go\nLearn to shoot a pistol, flip a O or its hard to grow\nMan if you ain't ever heard of Pimp Squad before\nYou better ask a real nigga or a broad you know\nCause you ain't ready for the pros, get it outta ya brain\nYou in over your head, way out of your lane\nI'd be insane I'm filthy rich and got it from caine\nSo would you say them niggas know if they done got it the same, right?\n\n[Hook]\nCause you know who, you know what\nOf the you know where, goin against us, too unfair\nCause everywhere you do a show, we got kinfolk there\nAnd now you know I ain't no more, not a tinfolk there\nIt's you know who, you know what\nOf the you know where, beef now don't you go there\nAnd if you do, don't use our copy producers, he won't care\nIf he leave the hood alone, pimpin he won't share man\n\n[Verse 2]\nI know you think you out there gettin it in\nBut whatcha doin, I don' done it once and did it again\nI had a trap between runnin while living in sin\nHe done settled down, turnin nine millin or ten\nI give a damn if I never sell a million again\nI gotta thank you a million for just lettin me in\nBut now I'm settlin in, gettin used to the view\nOn top, won't stop til I'm huger than you\nDon't flop? Who? Me, pimp you losin your screws\nWhat kinda dope have you been lettin niggas shoot into you\nNo, you ain't ready for the shit I'm introducin to you\nThe roof in the back of the Bach ain't translucent as you\nSo now your nigga dressin up, man do what you do\nI got style, pimp, it's more than just the suit and the shoe\nThis been proven, I'm the truth, stamp government seal\nI'm what it is. These other niggas, just suckers with deals, for real\n\n[Hook]", "image": "https://images.genius.com/757a45da6a6e4106770d36a71b9d8b5b.300x300x1.jpg"}], "artist": "T.I."}