{"songs": [{"title": "Wheaties", "album": "Killer", "year": "2008-07-01", "lyrics": "[Intro: Krizz Kaliko]\nI-I-I-In the mix\nYou're in the mix with your boyfriend, baby\nBobby Bang and it’s that time for the hot 9 at 9\nWith Tech N9ne featuring Shawnna\n'Bout to wear that ass out ten ways to Sunday\nSo you better eat your Wheaties\n\n[Verse 1: Tech N9ne]\nMy energy's pumping, it's finna be something to see\n'Cause when I be drunken, it's sin to be humping with me\nIf women be crunk and authentic we jump in the B\nThen I'm in it, we bumpin' to the finish, T punching the V\nLike a prize fighter, eyes light up, when I glide by the thighs\nTry the size, why the cries? 'Cause I be the pied piper\nWide or tighter, I like her pie-diver, prize swiper\nRider all night to the hide hiker\nI been away for a long while, sick of just being your phone-pal\nYou might be needing your long towels, when I get to you, it's on now, wow!\nBetter gas up when you with the King Kong, gal\nGet it, pivot, women dig it, lick it, then I hit it\nGirl, that's my grown style!\nI'm really gonna be living in what you're giving\nI'm all over you like I'm Pepé Le Pew\nGive me the goodies, I wanna know if you wanna get on top of me, no I gotta be when I'm stepping to you\nGiving it what It needed repeated I fill it up when I beat it\nYou never want me to leave it, you gotta please me thorough\nIf you wanna piece of a gorilla, you want it with Tecca N9na\nBetter eat your Wheaties, girl!\n\n[Hook: Krizz Kaliko]\nBaby, I hope you ate your Wheaties\nWhen you see me, it won't be easy, yeah\nI hope your intention ain't to tease me\nYou wanna please me, better eat your Wheaties, girl\n\n[Verse 2: Shawnna]\nI know you want me baby, do I make you horny, baby?\nI can tell by your eyes, you want me to ride you, like a horsey, baby\nBetter back up off me, baby, oh, you're not the type to be scurred\nIf you feel this, we can do it real big, maybe you can meet me in the back of the G4\nWe can do it in the 'Lac, on the D-low,we can do it on the track for the people\nSeen you looking at the ass, we do it for the cash, I throw it like craps at the 'sino\nNever had one like me, shorty, when I'm done when the wife is shouting\nMaybe thinking that she's like me, but you see, it's just unlikely, shorty\nWhen I get him, I'ma get in the rhythm, and have him feeling like he never ever felt befo'\nGet up in him and I fill him with venom, and have him chillin' and drilling me, from the night to the morn'\nBaby, you gotta be taking over me, part of me, pardon me, I think he got me in the zone\nLove it when he call me on the phone, he never been in love so much, but see the body in a thong\nHe like to put the nookie in his face, and every time I get out of line, he like to put me in my place\nHe put me in the A, or should I say the 745, gotta .45 chillin' in the safe\nSo what'cha wanna say? Your boy wanna see me, trying to meet me 'cause I'm on TV\nBetter believe I want you, and I'm finna come through, 'cause I ate my Wheaties\n\n[Hook: Krizz Kaliko]\nBaby, I hope you ate your Wheaties\nWhen you see me, it won't be easy, yeah\nI hope your intention ain't to tease me\nYou wanna please me, better eat your Wheaties, girl\n\n[Verse 3: Tech N9ne]\nSince I gotta super label, and\nI got a big amount to pay the hand\nSo can a nigga get a table dance?\nYou looking hotter than Zatarain's\nAnd I'm thinking of getting laid again\nI don't- give a damn about who that belong to\nDon't- keep the N9na waiting any longer\nWant- to be the lucky one to get up on you\nC'mon, shake your booty, baby, do that conga!\nYou don't wanna miss it, 'cause I'ma hit it terrific and I be so\nRugged, ya love it, I'm cock diesel\nMe so horny, but don't be thinking I'm evil\nPlease your body 'cause baby, it's 'squisito\nDon't get it twisted when you get with a nice cat\nGive me what you want, because ya know when you like that\nBut get up in the sack, you won't be able to fight that\nBrace for your neck and in the panties, an ice pack\nEat them Wheaties, and really you can get power\nCome in and get at you every motherfucking hour\nGive you a lot of it, then we get up in the shower\nThen hit Roscoe's on Sunset and Gower\nI'ma leave for a minute, but I'ma be back\nYou can videotape it, can't nobody see that\nEat your Wheaties, 'cause everyday I'ma need cat\nSo if you looking to see me, you better eat that\n\n[Bridge: Tech N9ne]\nI'm coming to get it just so you know\nAin't no prison in the system that can hold a bro, no\nAnd I'm gon' hit it like I told you so\nDon't be actin' like you forgot it, you're s'posed to know, yo\n\n[Hook: Krizz Kaliko]\nBaby, I hope you ate your Wheaties\nWhen you see me, it won't be easy, yeah\nI hope your intention ain't to tease me\nYou wanna please me, better eat your Wheaties, girl\nBaby, I hope you ate your Wheaties\nWhen you see me, it won't be easy, yeah\nI hope your intention ain't to tease me\nYou wanna please me, better eat your Wheaties, girl\n\n[Outro: Krizz Kaliko]\nYeah, you better eat your Wheaties, baby\nAnd get the big ol' bowl of 'em too: the breakfast of champions\nAnd if you ain't got that get you some Powerade, some Gatorade,  some something-ade\n'Cause if you ain't ready I'ma be like: neh'mind", "image": "https://images.genius.com/ce6124bde0d76994fd0d3a8ddb1d4e97.1000x994x1.jpg"}], "artist": "Tech N9ne"}