{"songs": [{"title": "24 Freestyle", "album": null, "year": "2014-01-27", "lyrics": "[Hook: Logic]\nFeeling this villainous vibe\nFeeling, feeling this villainous vibe\n(Fight!)\n\n[Verse 1: QuEst]\nChip on my shoulder, fuck is you sayin' ?\nSwear to God our fathers were playing nigga relay the message\nBreathless, every morning was forced to skip on breakfast\nMama told me don't let these peasants throw rocks at the king\nPawns tend to carry on with no conscience\nStraight non-sense, pay homage or K's vomit, verbal\nFucker wanna know Biggie was making certain while niggas was getting iffy\nHeart is bigger than derrières of Vicky and Nicki\nBut fuck up and diss me, this shit will 360\nAnd must I mention my body count?\nIt's murderous, to be humble\nMurder is to be humble?\nEver heard of me stumble?\nI was born in the jungle where niggas belly's will rumble\nGet checked for thinking or mumble\nBut y'all still stuck on rap\nFuck all that\nI do this in my slumber, merely ventilation\nTryna stay afloat be on a boat shit\nI swear that I'm lost inside of the spirit of Biggie back in his lumberjack\nOr Nasir with the fatigue, I felt stifle, street's disciple\nMy raps are trifle, I shoot slugs for my...you get the picture\nI was raised in Miami, niggas'll smack your coofie\nJust for acting coochie, your goofy actions'll never move me\nNo sir, needy no, all my homies is ready to roll\nNever the matter the chitter and chatter\nI did it 'cause I can machete the flow\nAnd comeback, here's a fun fact\nI'm not a dumb act, run that\nLittle punk rat, fuck it, Pun's back\nIn the middle of Little Havana\nHolding a hammer outside with pajamas\nBetter watch your grammar around me\nThese haters surround me, I swear it's unnecessary\nGambino, you childish niggas could never see the shit that I do\nVMG, yes nigga VMG\nOnly competition that we see is TDE\n\n[Hook: Logic]\nFeeling this villainous vibe\nFeeling, feeling this villainous vibe\n\n[Interlude: C Dot Castro]\nHappy birthday to my nigga doe\n(Fight!)\n\n[Verse 2: C Dot Castro]\nI'ma be the guy that rap slow, sike nah\nDictating bitches and smoking Cubans, I'm Castro\nMy life is like the movie, and I'll be the director\nAnd just to get a small role, got bitches acting extra\nI wrote this verse in one minute 'cause Bobby said that he wants rhymes\nIntelligent, but I'm getting brain from bitches that's dumb fine\nGot punchlines like prom with the, world on my palm\nI knew that we would blow up 'cause bitch, we be the bomb\nRattPack out to get the cheese, drop a verse, get fifty Gs\nHit the studio drunk as fuck but still drop a verse with ease\nI don't give a fuck\nBitch you know the flow is second nature\nWith no pen and paper break it down disintegrate a hater, wassup\n\n[Hook: Logic]\nFeeling this villainous vibe\nFeeling, feeling this villainous vibe\n(Fight!)\n\n[Verse 3: Jon Bellion]\nLet's have a money conversation\nFour hundred thousand from Eminem that's a payment\nKennedy Reagans presidential arrangement\nPlease don't let this Pop kid take it back to the basement\nI'm still here screaming Beautiful Mind\nSick of the noodles of rhyming all my cubical grind\nSo I just grew and decided to put you in your spot\nOoodles and boodles of blue bags from Louis Vuitton\nGetting money with lawyers we have a Jew of a time\nWith liquor in a Poland Spring like a Junior at prom\nYes I chose to pop charts I'm doing the crime\nAnd that just means I'm fucking dope to you and your mom\nWorking in the summer, AC on freezing\nWorking in the winter like I got no heaters\nSpring rolls at the damn four seasons\nIn the Red Octobers screaming thank you Yeezus\n\n[Hook: Logic]\nFeeling this villainous vibe\nFeeling, feeling this villainous vibe\n(Finish him!)\n\n[Verse 4: Logic]\nFeeling this villainous vibe\nChilling with me and my Tribe\nGotta spit this to survive\nHow long have I been alive?\nTwenty-four years and counting not including my momma womb\nI'm here in the lab, and I'll be here until the tomb\nAlbum coming soon watch the Rattpack consume\nAye, yo, yeah\nI've been on that real shit\nThat fun shit\nSpit artillery, like a gunship\nV's up we run shit\nDon't come around with that dumb shit it's scandalous\nIn the studio in Los Angeles\nAt No I.D. spot hit you with the heat rock goddamn\nWith Bobby on the board everybody on the floor\nHold up let me take a breath here come more\nThis a freestyle let me redirect my intellect\nDrop this shit just for fun, it's all over the internet\n'Cause bitch I'm in effect\nWait hold up, y'all did get the Memo?\nYou Lumbergh rappers is Initech\nBitch I've been a fact\nHit you like Hiroshima then intercept\nCheck it yo\nSee now all the real fans know the album goin be crazy\nSpit it off the top and get dirty like Pat Swayze\nFrom the cover of XXL\nFuck around and then propel\nTour coming soon man I know the tickets finna sell\nReally, coming for everybody's Achilles\nPut my own money into this album, like half a milli\nIt's Logic, coming for their neck no disrespect\nI did this shit in two minutes or less\nSpent a year on the album, who knows what to expect (Sinatra)\nSpent a year on the album, who knows what to expect\nThis is Logic\n\n[Bridge: Logic]\n(Flawless Victory)\nHappy birthday to me motherfucker\nIt's my birthday!\n\n[Hook: Logic]\nFeeling this villainous vibe\nFeeling, feeling this villainous vibe", "image": "https://images.rapgenius.com/00b4eaa7f66d06a778bbff5232db5f50.640x640x1.jpg"}], "artist": "Logic"}