{"songs": [{"title": "Smoke Weed by Cypress Hill", "album": null, "year": null, "lyrics": "Weweweweweeeeeeed (smoke weed)\nBlazin up on them indo, for my, khmai empire to ride\nSpit my rhyme about my life on this M.I.C. tonight\nRippin through this show you know\nTil all of your speakers blow\nBass stickin up so high like me\nWe need time to smoke the seed [repeat]\nBlazin up on this buddha leaves\nWhen you get ready to blow\nIm about to start this shit off\nLettin all you suckas know\nWhen i'm comin down with the green and shock my own Khmai yeah we roll\nFo sho we the braziest Khmai pride up inside Chi-town say ho\nWhen I bust my flow, I let it off on a roll, fo sho\nWe the truest blooded khmai pride up inside yo studio\nCreepin fo my enemy, you know what I really need\nBust them fo, get high, my seed, my game is about the red and green\nWe cruisin up and down the street, hittin up on some grubs to eat\nRollin up the windows, so the weeeed, will proceed\nKeep kick inside my mind, every..time I wanna breathe\nFallin back up on the seat, no one made much plans for weed\nLet my peeps go up in smoke, took me seven years to choke\nMy rhymes comin up tonight, my homeboy Mecc right by my side\nRemind me of the time when we was, up on the roof\nBlazin up on them leaves blowin back and forth, proceed\nMy homeboy smokin a big ol' blunt, me and Mecc went ridin crunk\nWeeeeed, up on in the trunk, blazin up on this flamin blunt\nHappy anniversary, my true Khmai Empirety\nWe gettin messed up tonite, thats right, dont wanna fight, lets ride\nLater up the side, gettin, radiator all the night\nThe partys jumpin up and down Mothina nigga u gettin high\nMy homegirl Jenny makes me laugh, when I'm feelin low thats right\nI wanna give you sumthin, but ill wait til after the show tonight\nBlazin up on them indo, for my, khmai empire to ride\nSpit my rhyme about my life on this M.I.C. tonight\nRippin through this show you know\nTil all of your speakers blow\nBass stickin up so high like weed\nWe need time to smoke the seed [repeat]\nKeep my game, one time, my rhyme, my lyrics explode\nTo the end of time my skills will never end until the world is rewind\nRe-incarnation sends me back to live this life\nWhen my rhymes explodes 3 universe, then I shall die\nThe kingdom of Cambodia, my peeps im really feelin ya\nThe pain remains, but time won't stay, so best be on yo way today\nMove up on the head and get the rights a client needed\nPlay along wit the game of the world and then you proceed\nTo smoke weeeeeeed\nBlazin up on them indo, for my, khmai empire to ride\nSpit my rhyme about my life on this M.I.C. tonight\nRippin through this show you know\nTil all of your speakers blow\nBass stickin up so high like weed\nWe need time to smoke the seed [repeat]\nWeeeeeeeeeed [smoke weed] [repeat 4X's]\nBlazin up on them indo, for my, khmai empire to ride\nSpit my rhyme about my life on this M.I.C. tonight\nRippin through this show you know\nTil all of your speakers blow\nBass stickin up so high like weed\nWe need time to smoke the seed [repeat]\nWeeeeeeeeeed smoke [until fade]\n---\n.", "image": "https://images.genius.com/2615919eb0bcef9d55421080ab3b10b1.860x860x1.jpg"}], "artist": "Cypress Hill"}