{"songs": [{"title": "I Am Not a Human Being", "album": "I Am Not a Human Being", "year": "2010-09-27", "lyrics": "[Intro]\nI-I-I, am-am not a human being!\n\n[Verse 1]\nUhh, pussy for lunch\nPop all the balloons and spit in the punch, haha\nYeah, kush in the blunts\nI ride through your block, see a foot in the trunk\nI don't know why they keep playing, they better re-plan\nI'm giving 'em the blues, Bobby Blue Bland\nTogether we stand, and fall on y'all\nBalling with my Bloods, call it B-ball\nThese dames ain't shit, Young Money is\nI got Mars bars, 3 Musketeers\nCome through, coupe same color as veneers\nAnd you know I'm riding with the toast, cheers\nYeah, now I'm back on my grizz\nAnd y'all's a bunch a squares like a mothafuckin' grid\nShit, fuck with me and get hid\nI finger-fuck the Nina, make that bitch have kids\nJust do it? My nigga, I just did\nAin't a motherfucker deeper than me, bitch, dig\nYou dig? This here, this big biz\nAnd I scream, \"Fuck it!\" Whoever it is\n\n[Hook]\nI am the rhyming oasis\nI got a cup of your time, I won't waste it\nI got my foot on the line, I'm not racing\nI thank God that I am not basic\nOww! I-I am not basic\nI-I-I, am-am not a human being!\n\n[Verse 2]\nUhh, rockstar baby\nNow come to my suite and get lockjaw baby\nRich nigga looking at the cops all crazy\nThat's that mob shit, nigga, Martin Scorsese\nHeater close range, cause people are strange\nBut I bet that AK-47 keep you ordained\nYou can't see Weezy nor Wayne, I'm in the far lane\nI'm running this shit, hundred yard gain\nUhh, swag on infinity\nI'm killing 'em, see the white flag from the enemy\nShoot you in your head and leave your dash full of memories\nFather forgive me for my brash delivery\nI-I-I would try you, I wouldn't lie dude\nI must be sticky cause them bitches got their eyes glued\nYoung Money, baby, we the shit, like fly food\nY'all can't see us, like the bride's shoes\nI stand tall like I'm motherfucking 9'2\"\nI scream \"Motherfuck you and whoever designed you!\"\nAnd if you think you hot then obviously you were lied to\nAnd we don't die, we multiply, and then we come divide you\n\n[Hook]\nI am the rhyming oasis\nI got a cup of your time, I won't waste it\nI got my foot on the line, I'm not racing\nI thank God that I am not basic\nI am not basic\nI-I am not basic\nI thank God that I am not basic\nI-I-I, am-am not a human being!\n\n[Verse 3]\nRe-re-re-re-reporting from another world\nMagazine full of bullets, you can be my cover girl\nBless got the weed rolling thicker than a Southern girl\nStrong-arm rap like a nigga did a hundred curls\nRockstar biatch, check out how we rock\nAnd if this ain't hip-hop, it must be knee-hop\nI'm higher than a tree top, she lick my lollipop\nI still get my candy from your girlfriend's sweet shop\nSpitting that heat rock, I'm smooth, not Pete Rock\nAnd my, and my money on et cetera, three dots\nStill get a stomach ache every time I see cops\nYou better run motherfucker, cause we not\nYou better run 'til your feet stop\nYou ain't even a fucking alphabet in my teapot\nColder than a ski shop, holding on to the top\nAnd even if I let go, I still won't d-rop\n\n[Hook]\nI am the rhyming oasis\nI got a cup of your time, I won't waste it\nI got my foot on the line, I'm not racing\nI thank God that I am not basic\nI-I-I-I, I, I am not\nI-I-I, am-am not a human being", "image": "https://images.genius.com/4961f298812e90e0d45e2664f95cfcd7.1000x1000x1.jpg"}], "artist": "Lil Wayne"}