{"songs": [{"title": "Talking to My Diary", "album": "Compton", "year": "2015-08-07", "lyrics": "[Produced by Dr. Dre, DJ Silk & Mista Choc]\n\n[Intro]\nI just need y'all to try to bear with me for a minute\nWhile I talk about the pages of my diary, listen up\n\n[Verse 1: Dr. Dre]\nI remember when I got started my intention was to win\nBut a lot of shit changed since then\nSome old friends became enemies in the quest of victory\nBut I made a vow, never let this shit get to me\nI let it pass, so I consider that part of my history\nAnd I'm strong; financially, physically\nMentally I'm on a whole 'nother level\nAnd don't forget that I came from the ghetto\nSold a new house for my moms, that's special\nI let you going shopping 'til your feet get tired\nThen a new Benz just for you to ride in\nWhen I didn't have it, you provided\nDon't be surprised that I built an enterprise\nAnd my house got a view of the city like a highrise\nI'm just talking to my diary\nI'm just talking to my diary\n\n[Hook]\nWhen I open up my book, I think about the world later\nNo ink in the pen, no lines on the paper\nI'm just, I'm just, I'm just talking to my diary\nI'm just, I'm just, I'm just talking to my diary\nSometimes when I got a lot of shit on my mind\nI'm just staring at the sky, you probably thinkin' I'm high\nI'm just, I'm just, I'm just talking to my diary\nI'm just, I'm just, I'm just talking to my diary\n\n[Bridge]\nNow puff-puff-pass got a nigga having flashbacks\nI remember how it used to be\nNow my money like NASDAQ, my checks you can cash that\nI remember how it used to be\n\n[Verse 2: Dr. Dre]\nI used to be a starving artist, so I would never starve an artist\nThis is my passion, it's where my heart is\nIt gets the hardest when I think about the dearly departed\nLike the nigga I started with\nI know Eazy can see me now, looking down through the clouds\nAnd regardless, I know my nigga still proud\nIt's been a while since we spoke but you still my folks\nWe used to sit back, laugh and joke\nNow I remember when we used to do all-nighters\nYou in the booth and Cube in the corner writing\nWhere Ren at? Shout out to my nigga Yella\nDamn, I miss that... shit, a nigga having flashbacks\n\n[Hook]\nWhen I open up my book I think about the world later\nNo ink in the pen, no lines on the paper\nI'm just, I'm just, I'm just talking to my diary\nI'm just, I'm just, I'm just talking to my diary\nSometimes when I got a lot of shit on my mind\nI'm just staring at the sky, you probably thinkin' I'm high\nI'm just, I'm just, I'm just talking to my diary\nI'm just, I'm just, I'm just talking to my diary\n\n[Outro: Trumpet]", "image": "https://images.genius.com/19804ba7a9b6ceb36d0158950514927a.1000x1000x1.jpg"}], "artist": "Dr. Dre"}