{"songs": [{"title": "Bad Guys Always Die", "album": "Music Inspired By the Motion Picture Wild Wild West ", "year": null, "lyrics": "[Intro]\nThe Wild, ha-ha\nThe Wild West\nHa, ride\n\n[Verse 1: Dr. Dre & Eminem]\nAll you see is the sun reflectin' off of the gun\nReady for the showdown to go down at one\nSweat on my brow, let's settle it now\nI'ma show you how real cowboys get down\nI'm polishin' gold, waitin' for this drama to unfold\nI got a blunt rolled\nFeelin' bold, gangsta's blood runs cold\nIt's time to reload this old .45 colt\nThe wind's gusty, it's hot, muggy and dusty\nBust a couple shots, make sure I'm not rusty\nIt's past noon, he should be here soon\nSip a little moonshine inside a saloon\nAll of a sudden I can hear the sound of hoofs\nSounds like a thousand wolves\nI cock back, put the toast in the holster and froze\nI pose like a poster, he's closer than close\nI hold the heat sturdy, I heard he fights dirty\nBut I'ma put 30 inside him and leave early\nAnd just when I went to fill him with hot lead\nI put the gun to his head, and this is what he said\nYou never met me, you'll probably never see me again\nBut I know you, the name's Slim, you want revenge?\nThen don't shoot, I'm in the same boots as you\nI'm telling the truth, I got a price on my head too\n'Cause when you-\n\n[Chorus]\nYou ride like a cowboy toward the sun\nAnd life ain't fun when you're on the run\nGot your gold and you got your gun\nBut life as an outlaw just begun\nGot your shotgun by your side\nGot your horse and you got your pride\nYou ride 'til there ain't no place to hide\nIt's sad 'cause the bad guys always die\n\n[Verse 2: Dr. Dre & Eminem]\nHe was shady, I seen by the look on his face\nHe said, \"Take ten paces,\" shit, I took eight\nSpun around and I aimed straight for the brain\nMy shit went bang but it only fired a blank, he said\nYou need bullets, hurry up, run\nI put a clip in the gun and pointed at his lungs\nWe both drew at the same time and stood stunned\nGo ahead, shoot me, but I'm not the one you want\nI figured he was tellin' the truth, that's why I didn't shoot\nSo what we gon' do? It's on you\nDo you recall when you and Snoop was a group?\n(The Chronic)\nWell, all we gotta do is find a map to part two\nAnd plus I know who's got it\nWho?\nSome old dude who's got 26 plaques\nAnd he already sold two\nLoaded up my saddle, got ready for battle\nHid two pieces of gold inside of my satchel\nWe rolled two miles until we hit the spot\nAn old ghost town that everybody forgot\nA place where they used to smoke chronic a lot\nSlim grabbed the shotgun\nDre, here's the plot\nThis is the spot, they call him Doc Loveless\nHe's going around saying he took the game from us\nLet's shoot him in his kneecaps, he'll never see it comin'\nHe ain't got no legs, they cut them off at the stomach\nHe's got mechanical legs, he spins webs\nPlus he's well-respected by the hip-hop heads\nOur mission is to get him to stop layin' eggs\nAnd we can put him on his back down a flight of steps\nI drew two guns, spun them on my fingers\nKicked the swingin' doors in, started gun-slingin'\nI could hear somebody singin', it sounded like a \"G Thang\"\nAnd a verse from \"Keep Their Heads Ringin'\"\nI said, \"It's Dre's day,\" and started to spray\nIt's 1800, he pulls a AK\nHollow tips started flyin' every which way\nThat's when I seen Dre in trouble and came with the gauge\nI fired the first shot, spun his body around\nHe hit the ground and landed upside down\nDre grabbed the map, the plaques and the gold\nI grabbed two girlies and a blunt that's rolled\n\n[Chorus]\nYou ride like a cowboy toward the sun\nAnd life ain't fun when you're on the run\nGot your gold and you got your gun\nThe life as an outlaw just begun\nGot your shotgun by your side\nGot your horse and you got your pride\nYou ride 'til there ain't no place to hide\nIt's sad 'cause the bad guys always die\nYou ride like a cowboy toward the sun\nAnd life ain't fun when you're on the run\nGot your gold and you got your gun\nBut life as an outlaw just begun\nGot your shotgun by your side\nGot your horse and you got your pride\nYou ride 'til there ain't no place to hide\nIt's sad 'cause the bad guys always die (Always die)\n\n[Outro]\nThe Wild, ha-ha\nThe Wild West\nHa-ha, ride, ha", "image": "https://images.genius.com/67be58a5622b416a7f512d91c9ee314c.1000x979x1.jpg"}], "artist": "Dr. Dre"}