{"songs": [{"title": "Do Sumthing Strange", "album": "1.21 Gigawatts: Back To the First Time", "year": null, "lyrics": "[Verse 1: Ludacris]\nWell, well\nWhat do you we have here\nStill getting pussy from the gift I gave her last year\nBut it's a new day\nShe want a MacBook\nSo I showed her how the backseat of the 'Lac look\nShe talking hand bags and Gucci slippers\nShe served me like a waiter and all I can do is tip her\nShit talking bout she need gas money\nYou better hop up on that pole and shake that ass for me\nHo stop acting all bougie\nKnowin you'll give it up fo churches chicken and a movie\nBig bucks I got em\nIt's amazing what they'll do for a pair of them red bottoms, ahhhh!\n\n[Hook:Ludacris]\nYeeeeah\nShe said she need some rent money\nI told her hop up on this dick for me\nShe said she need to pay her car note\nUhhhh well I need some daddy long stroke\nShe asked me bout her phone bill\nI asked her to show me how that throat feel\nShe said she need to pay tuition\nWell drop down to the floor and assume the fucken position ugh!\n\n[Hook:4x]\nDo sumthing strange\nFor a lil piece change\n\n[Verse 2:Ludacris]\nI told her, ooh ooh Jerome is in the house bitch\nFuck the bed we bout to stay right in this couch bitch\nI told her if she hit it right\nId buy that iPhone with 32 gigabytes\nBut now you say you want an iPad\nWell get nekkid and bring yo ass over to my pad\nNeed some help moving out your old place\nI need some help showing you my 'oh face'\nNow you need a back stage pass dog\nWell I need some back stage ass ho\nYou ain't wid it?\nWell keep your stingy tail then\nBut a little head will get yo hair and yo nails did\n\n[Hook: Ludacris]\nYeeeeah\nShe said she need some rent money\nI told her hop up on this dick for me\nShe said she need to pay her car note\nUhhhh well I need some daddy long stroke\nShe asked me bout her phone bill\nI asked her does yo (something) how that throat feel\nShe said she need to pay tuition\nWell drop down to the floor and assume the fucken position ugh!\n\n[Hook:4x]\nDo sumthing strange\nFor a lil piece change\n\n[Verse 3: Rick Ross]\nShe super sexy so I treat her to my wing stop\nI'm trynna wet my dick and shoot off like a slingshot\nWe run the game so my whole fucking team hot\nMy top down in that same whip you dream bout\nI keep a pocket full of Franks, time to work my magic\nMy section similar to a bank, better check the balance\nSpray the Chevrolet red, likes it's from Cincinnati\nBaby be giving me head, with superior talent\nI pay for that pussy like its a rent-a-car\nI ring the phone like 'baby oye ven aca'(baby come here)\nTake her to a spot she never been a lot\nThem niggas lossers, me and Luda in the winnin' slot\n\n[Hook: Ludacris]\nYeeeeah\nShe said she need some rent money\nI told her hop up on this dick for me\nShe said she need to pay her car note\nUhhhh well I need some daddy long stroke\nShe asked me bout her phone bill\nI asked her does yo (something) how that throat feel\nShe said she need to pay tuition\nWell drop down to the floor and assume the fucken position ugh!\n\n[Hook:4x]\nDo sumthing strange\nFor a lil piece change", "image": "https://images.genius.com/5482bdd9a892ee8a85e236881855cbce.320x320x1.jpg"}], "artist": "Ludacris"}