{"songs": [{"title": "You Know What It Is", "album": "T.I. vs T.I.P.", "year": "2007-07-03", "lyrics": "[Intro: Wyclef Jean and T.I.]\nAy boy, don't spill my drink boy, ba-lip!\nNow listen (Grand Hustle homie)\nEverybody report to the bloodclaat dance floor (ay, ay, ay, ay)\nWyclef, \"All Hands on Deck\" you love the beat?\n(Boy you know what it is, ay, ay, ay, ay, ay)\nYo Tip, talk to me bloodclaat\n\n[Chorus: T.I.]\nI'm a real nigga, homie, tote six figures on me\nGot a pistol you don't want it, boy, you what what it is\nAy, I'm way flyer, my pay's way higher\nIf they ever mention sire, boy, you know what it is\nI'm 'bout that drama, you don't want no problems\nI'll up that llama, boy, you know what it is\nAy, I get money, all I count is big money\nDick is all she get from me, boy, you know what is\nAy, ay, ay, ay, ay, ay, boy, you know what it is, nigga\n\n[Post-Chorus: Wyclef Jean]\nYo T.I.P., let them likkle rap boys know how you livin\n\n[Verse 1: T.I.]\nThe wait is over, here we go again, I'm back into play\nGon' sell another couple mil' and take it back to the A\nGon' take that other couple mil' and put it back in the safe\nFive cash for the crib on the back of the lake\nI'm up in Crucial two-steppin with the gat in the waist\nT.I. ain't in the street no mo', fo'-fo', is that what they say?\nDon't even try him when you see him boy you have to be great\nCause this pistol hit you in your face, your teeth they'll have to replace\nThat's if you lucky nigga trust me, it don't hurt me to take\n100 thousand to them Haitians you'll be murdered today, nigga\n\n[Chorus: T.I.]\nI'm a real nigga, homie, tote six figures on me\nGot a pistol you don't want it, boy, you what what it is\nAy, I'm way flyer, my pay's way higher\nIf they ever mention sire, boy, you know what it is\nI'm 'bout that drama, you don't want no problems\nI'll up that llama, boy, you know what it is\nAy, I get money, all I count is big money\nDick is all she get from me, boy, you know what is\nAy, ay, ay, ay, ay, ay, boy, you know what it is, nigga\n\n[Post-Chorus: Wyclef Jean]\nYo T.I.P. some boys wan' playa hate\nLet them know who the King of the South is, talk to them!\n\n[Verse 2: T.I.]\nWell, they sweatin' when they see me, I'm apparently hot\nHad the album of the year, nigga, Grammy or not\nRemember all day I used to stay in the spot\nWith two revolvers in my pocket, pitch a hand of that rock\nAnd now, chart toppin', ain't a car I ain't got\nI'm the number one customer at my own car lot\nYou wanna know how much I'm makin', just imagine a lot\nYou know I'm probably gettin' more that you'd imagined I got\nListen close, I need to know if you understand me or not\nBecause you disrespectin' me, you and your man'll be shot\n\n[Chorus: T.I.]\nI'm a real nigga, homie, tote six figures on me\nGot a pistol you don't want it, boy, you what what it is\nAy, I'm way flyer, my pay's way higher\nIf they ever mention sire, boy, you know what it is\nI'm 'bout that drama, you don't want no problems\nI'll up that llama, boy, you know what it is\nAy, I get money, all I count is big money\nDick is all she get from me, boy, you know what is\nAy, ay, ay, ay, ay, ay, boy, you know what it is, nigga\n\n[Post-Chorus: Wyclef Jean]\nWhy y'all take shot, cause I'm movin?\nWe'll pop you in your chest boy\n\n[Verse 3: T.I.]\nWent from the King of the South to the King of the States\nRidin' in a car you probably never seen in the states\nNo idea how much yay I can bring in the states\nHey, you can get a hundred on 'em for a million today\nFrank Lucas ain't the only one who made a million a day\nBut it's a American gangsta right here in your face\nAnd you don't wanna see P$C on the scene with a K\nYou think you runnin' up and robbin', that ain't even the case\nAnd just because you get away, that don't mean it's okay\nYou a dead man walkin' and I mean it, okay?\nHey\n\n[Chorus: T.I.]\nI'm a real nigga, homie, tote six figures on me\nGot a pistol you don't want it, boy, you what what it is\nAy, I'm way flyer, my pay's way higher\nIf they ever mention sire, boy, you know what it is\nI'm 'bout that drama, you don't want no problems\nI'll up that llama, boy, you know what it is\nAy, I get money, all I count is big money\nDick is all she get from me, boy, you know what is\nAy, ay, ay, ay, ay, ay, boy, you know what it is, nigga\n\n[Outro: Wyclef Jean and T.I.]\nSome of them boys wan' talk 'bout they have done\nThey guns sound like popcorn, yeah\nWhen the King of the South (boy you know what it is)\nGet with the King of Haiti, big up Jamaica\nExpect this (boy you know what it is)\nBloodclaat gorillas a-come out (ha, ay, boy, you know what it is)\nAnd when that fire don't pop, come and gone\nWe have big long machine guns then\nAnd when we pull them back (choppers'll hang you)\nBlap, blap, blap, blap, bap, bap, bap, bap, bap\nYou like the beat? (ha, they better)\nWe can sell you one, y'know (well, bop your head then, okay?)\nYo big up to Haiti! (hey!)\nI'm the king, all the way to the ATL (Bankhead, okay)\nYo, big up the whole South, East West North (Grand Hustle homie)\nYo, London, Japan, hey, yeah (P$C)\nYo, Tip, respect (ha, yeah)", "image": "https://images.genius.com/63db088c5d86b88aa10bbaa3f5513a0b.220x221x1.jpg"}], "artist": "T.I."}