{"songs": [{"title": "Am I Next", "album": "Picture My Pain", "year": null, "lyrics": "They wanna bury me, I'm worried -- I'm losin my mind\nLook down the barrel of my nine and my vision's blurry\nFallin to pieces, am I guilty? I pray to the Lord\nBut he ignores me unfortunately cause I'm guilty\nShow me a miracle, I'm hopeless -- I'm chokin off\nMarijuana smoke, with every toke it's like I'm losin focus\nFallin to sleep while I'm at service, when will I die?\nForever paranoid and nervous because I'm high\nDon't mention funerals I'm stressin, and goin nutty\nAnd reminiscin bout them niggas that murdered my buddy\nI wonder when will I be happy, ain't nothin funny\nFlashbacks of bustin caps, anything for money\nWhere am I goin I discovered, can't nothin save me\nMy next door neighbor's havin convo with undercovers\nPut a surprise in the mailbox, hope she get it\nHappy birthday bitch, you know you shouldn'ta did it\n\nX2\nEverybody's dyin am I nextx3\nI see my enemies they creepin, don't make me blast\n\nEverybody's dyin am I next, who can I trust?\nWill they be G's, and they look at me before they bust?\nOr will they kill me while I'm sleepin, two to the head\nWhile I'm in bed, leakin blood on my satin sheets\nIs there a heaven for a baller? I'm gettin suspicious\nOf this bitch the line busy everytime I call her\nNow she's tellin me to visit, who else is home?\nI check the house before I bone, so we all alone\nAfter I nut I hit the highway, see ya later\nTo all the players watch the fly way a nigga played her\nThe bitch is tellin all her homies -- that I can fuck her\nLike no other now them other bitches wanna bone me\nI'm under pressure gettin drunk, somebody help me\nI drink a fifth of Hennesey I don't think it's healthy\nI see my enemies they creepin, don't make me blast\nI watch the five-oh's roll, the motherfuckers pass\n\nX2\n[Everybody's dyin am I next]x3\nI see my enemies they creepin, don't make me blast\n\nThey wanna bury me, I'm worried -- no need to lie\nI pray to God I don't scream when it's time to fry\nNowhere to rest I'm losin homies, ain't that a bitch\nWhen I was rich I had clout, now a nigga's lonely\nI put the pistol to my head, and say a prayer\nI see visions of me dead, Lord are you there?\nThen tell me am I lost cause I'm lonely\nI thought I had friends but in the end a nigga dies lonely\nNowhere to run I'm in terror, and no one cares\nA closed casket at my funeral and no one's there\nIs there a future for a killer? I change my ways\nBut still that don't promise me the next day\nSo I stay Thuggin with a passion, forever blastin\nI'm bustin on these motherfuckers in my madness\nThey wonder if I'm hellbound... well Hell\nCan't be worse than this, cause I'm in Hell now\n\nX2\n[Everybody's dyin am I next]x3\nI see my enemies they creepin, don't make me blast\n\nI ain't scared to die\nDo you wanna live forever?\nAre you scared, to die?", "image": "https://images.genius.com/fc0e6befb957fcdfa49f5bb3915e344c.500x500x1.jpg"}], "artist": "2Pac"}