{"songs": [{"title": "Keep In Touch", "album": "I Came From Nothing 2", "year": "2011-12-02", "lyrics": "[Chorus]\nWon't you keep in touch with me?\nDon't lose it, don't lose it\nWon't you stop beatin' up on me?\nAyy, don't abuse it, don't abuse it\nWon't you fall in love with me?\nI say, stop losing, stop losing\nYou gon' end up winning with me\nAyy, don't lose it, don't lose it\n\n[Verse 1]\nAyy, I'ma ride it like a Kawaski bike\nWhen you feel down, I'ma be the one that make you feel right\nIf he gon' have you riding, I'ma be that one that make you catch flights\nI'ma flood you in the black diamonds, they gon' think you a knight\nAyy, I got them dark blue true's with the buttons like pendants\nWalkin' down Rodeo, your real hair like Indian remy\nMix match bottoms, pockets fat but the true's will fit it\n'Cause I got pounds of the kush, and I sold tons of the midget\nAnd everytime I think about you, I, I want sex baby\nDancing down the pole, you the best baby\nI know you kinda busy but I want next baby\nI-I want next baby, have my next baby, yeah\nFuck what they saying about me and you\n'Cause I'm on garden food, and you on garden food\nAnd I done did so much wrong in these streets\nGod gave me back, 'cause I'm miss you and you ain't missing me\nBut try to just\n\n[Chorus]\nKeep in touch with me\nDon't lose it, don't lose it\nWon't you stop beatin' up on me?\nAyy, don't abuse it, don't abuse it\nWon't you fall in love with me?\nI say, stop losing, stop losing\nYou gon' end up winning with me\nAyy, don't lose it, don't lose it\n\n[Verse 2]\nAyy, I'ma fuck you like I never did tonight\nChoppas everywhere, you have no reason to fright\nIf I try to talk to you, you were mad we had skype\nYou gon' get the text I sent said \"everything gon' be alright\"\nAyy, I'ma come to you right home when I get back\nGirl, you know your loving got Young Thugga like crack\nGirl, you know you kill me when you act like a brat\nYou said the only noise you wanna hear when they rub is br-aaaat\nAyy, and I'ma treat it like it's never ever been treated\nI say I'ma beat it like it's never ever been beated\nI say I'ma feature like it's never been featured\nAnd I'ma eat it like it's never been eaten, yeah\nAyy, and I'ma come back for it\nOh, that roadblock? I'ma ride past for it\nOh, I will bust my ass for it\nI ran my money up, now I can afford\nBut you should\n\n[Chorus]\nKeep in touch with me\nDon't lose it, don't lose it\nWon't you stop beatin' up on me?\nAyy, don't abuse it, don't abuse it\nWon't you fall in love with me?\nI say, stop losing, stop losing\nYou gon' end up winning with me\nAyy, don't lose it, don't lose it", "image": "https://images.genius.com/05e3961a9ac62f65057356629bb5559c.500x500x1.jpg"}], "artist": "Young Thug"}