{"songs": [{"title": "Blow Your Mind (Remix)", "album": "Whut? Thee Album", "year": "1992-08-27", "lyrics": "A-hem.. hit me\nThis is goin down\nWhat's goin down?\nYo yo yo Reggie Noble, drop that beat in, hah!\nYeah, uh-huh, uh-huh\nGive it to me, give it to me\n\n[Verse 1]\nAHHHH!! Look out, it's the Funkadelic funk for chumps\nWho don't be knowin' my name, I tear the frame out ya punks\nI make ya slide, make ya slip, make ya wanna backflip\nI get biz with the skit, I DJ like Quik\nThe topnotch of the block, cause I carry a Glock\nOnly hot rocks, I'm hot, so give up the props\nMy style is HUMMIN CUMMIN ATCHA, duck or get backed up\nDispatcher: 'Red, get freaky to the rapture'\nSo come on light the buddha, check your honey while I scoop her\nThe Superfly Jimmy Fly Snuka rips the roof off\nThen hook off on your crew, to the checka one, two\nIt's you! AHHHHHHHHHHH! Funky fresh in the flesh, troop\nCome on and get down and boogie oogie with the ruffneck\nHit women like Madonna all the way down to Smurfette\nBut first get your tables, I roast your whole record label, kid\nYo, Red! (Whassup, G?) Briiiiiidge!\n\n[Hook 2X]\n\"Ooh, you blow my mind\"\n\"All around the world for the funk\"\n\"On and on and on and on\"\n\nLook out.. AHHHHH!\n\n[Verse 2]\nCan I tear the roof off this mother? It's the Funkdafied brother\nThen I laugh, because I burn ya like Backdraft\nSo call the fire engine 'cause I'm flamin' up your buildin'\n_One Life to Live_ so the funk is in _All My Children_\n'Cause I can get wicked like the witches from Eastwick\nAnd freak the type of funk to make all y'all teeth grit\nAnd crumble, my style is more flyer than the Brundle\nFly from The Fly part one, The Fly part two\nPsychoBetaP-Funk, got styles hard as tree trunks\nFor real punk, you got a blunt, light it 'cause I need one\nAnd get down with the irrelevant funk to make ya jump\nWith the fly human being, watch me freak it in Korean\n\nChu ri ka pi kyura mulla kara\nNu gu nya nada na na nun Redman\nNa bo da challan nom hana do upda\nYi sae sang cheil eu na nun Redman, my man\n\nI rip shop in hip-hop, I get props, my lip rocks\nThe rap stuff's more spooky than movies from Hitchcock\nSit back, relax, let me rip to the funk track\nAnd press rewind if I haven't blown your mind, AHH!\n\n[Hook]\n\"Ooh, you blow my mind\"\n\"All around the world for the funk\"\n\"On and on and on and on\"\n\"All around the world for the funk\"\n\"On and on and on and on\"\n\n[Verse 3]\nERRRK! Let me get busy with the funky fly stuff\n'Cause I cut your freakin' eyes out\nFuck Bruce Willis because I die rough\nIt's the Funkadelic Redman and I hit ya with the\nFunkadelic level, the P-Funk, the devil\nThe spectacular, Blacula, bust holes like Dracula\nLoaded, of course, more Legend than Acura\nI'm swift, I like big spliffs so I tisk tisk a tasket\nPlus keep the Glock in my basket.\nI cough up a lung 'cause I freak it with the tongue\n'Cause I can 'Wax on! Wax off!' like Daniel-san.\nDo the yea yea, boogey say up jump the boogey\nTo the boogey to the boogey\nThanks to E 'cause he hooked me\nSo fuck what ya heard, word to herb\n'Cause I mac-frama-lama\nPlus I kick the grammar, straight from NEW JERZ\nIt's the renegade rap Redman, really who rip rhymes in rough mode\nYo, hold your breath while I explode! HAH!\n\n[EXPLOSION]", "image": "https://images.genius.com/4777980c203a480ca8ff52db78697ec1.300x300x1.jpg"}], "artist": "Redman"}