{"songs": [{"title": "Schemes", "album": "Pharaoh Height 2/30  ", "year": "2015-08-28", "lyrics": "[Intro]\n(Uncle Lupe)\nAlright it's time to go to sleep\n(Hey Uncle Lupe)\nWhat?\n(Can you please tell us a bedtime story?)\nUgh, it's late man\nOkay, okay okay, check this out, listen\n\n[Verse 1]\nCold killer, bold old guerrilla\nBold as a font with the thickness\nOld as yellow gold in a Chevrolet with a stick shift\nThe story goes his mother left him on a church step\nFirst step was out the front door then the first left\nDown the block to the spots where the worst kept\nThirty years later got a thirty tier caper\nTo shoot up the scene and scheme\nPlot, broken all down to two rounds of scotch\nA pound means now and we too down to stop\nSay ya got enough round for two thousand cops\nMilitary grade, these things shoot round the block\nShh threat, check\nThe dame will hang out like chains round the neck\nHe ever seen her before, her face don't connect\nNo, so keep it on the low, go\nSeizes her by the arm\nLooks right into the eyes cause these be the charms\nSheba, King Tut suite at the Khalifa\nTied to a chair getting burned by Cohibas\nA well dressed thug who run clubs in the Koreas\nThe room smells like fresh hand made tortillas\nHe recognized the tattoos of a real big Maui brother\nKnown for bad news when his cash rules\nAre you familiar with the shell of the cashews?\nAs he holds the needle up to the light bulb\nWhite girls enter drunk, he stands up runs to the window and jumps\nAim for the pool... splash\nThe impact from that almost split him in half\nVoice from the past asks did he enjoy the bath\nLaughs with his arm in a cast, hold up\n\n[Hook]\nNever what it seems, everybody wanna be seen\nOn the cover of a magazine\nEverybody want big things\nEverybody want big dreams\nEverybody want bling bling\nEverybody wanna be the king\nEverybody bling\nEverybody sings\nEverybody wanna big thing\nIn the valley of kings and pyramid schemes\nIt's never what it seems, everybody wanna be seen\nOn the cover of a magazine\nEverybody wanna sip lean\nEverybody want a big dreams\nEverybody want bling bling\nEverybody want C.R.E.A.M\nEverybody wanna have a team\nEverybody wanna be the king\nEverybody want a big scheme in the land of pyramid schemes\n\n[Verse 2]\nAs he tried to do the math with Smearcon the fed\nThe contract states from here upon you're dead\nThe girl at the bar is an underworld star\nSettling on debts with north Zanzibar\nYour name's on the list, kitsch\nA hundred million dollars worth of high grade fish\nTuna, Tokyo cartels worlds biggest consumer\nA rumor bout a schooner off the coast of Montezuma\nThey say you slit the throat of a well known kahuna\nThen torched the boat and fled into the Dunya\nYou’re hated more than a Kalua pig at a Jumu'ah\nThey want your head on a platter, not right now but sooner\nI got you a .45 and a Mitsubishi tuner\nWait, wait I've never been to Costa Rica\nAnd then it all comes back\nJust as Smearcon falls with a ninja star in his head like..huh\nThen they slowly enter the room\nI grabbed a .45, the ninja stars resume\nI catch him in the cast and answer them with a blast, blow\nThree more shots for good measure\nOnly exit is another window, pfft, whatever\nShort fall to the roof of the car\nThen I get in, left arm covered in ninja stars\nThen a zero to a hundred baby real quick\nLook around the car for something else to kill with\nLamborghini headlights in the rear view\nThese Parisian streets not meant to veer through\nEspecially with just one hand\nI let go to shoot back but the gun jams\nMitsubishi not built to outrun Lambs\nSo they gaining, heavy raining\nRear view explodes from deadly aiming\nArm paining, blood draining\nPains, head for the Louvre\nDrive right through the glass pyramid with dope moves\nA little shook from the landing\nDriving through the Louvre in a rally car with great handling\nWas at the Mona Lisa\nStop the car right in front of the Delacroix and have a breather\nPress play on the radio, voice from the speaker\nSays get to Belgrade and take an ad out in the daily Politika\nThey says for a good time call this Ecuador slash Venezuelan chica\nNext day at the airport meeted by a greeter who looks Corsican but Greeker\nA little older wearing Michael Jordan sneakers\nBut I follow the leader\n1995 S. Class, in the back seat is a dead man whose car I just crashed\nSmearcon's alive, audience now wonders how Smearcon survived\nLet alone not be hurt, he taps a metal plate in his head from his Afghanistan work\nWhat Visine for red retinas, what else would you expect from head predators\nEx-lecturer, at Exeter, the dean too secular\nSo now I'm totes hecklers, everywhere\nNow Smearcon's on the team, so everybody's down for the scheme\n\n[Interlude 1]\n(The final chapter in the incredible ape saga)\n(Smearcon's back!)\n\n[Verse 3]\nNow it's time to finish this, getting too late for international syndicates\nTo which the driver reveals his membership\nThis won't end well, he pulls out a grenade and says\n(Damn you all to hell!)\n\n[Interlude 2]\n(Wait, what happened? Uncle Lupe what's going on?)\nGo to sleep\n(But what happened? I don't understand)\nNope\n(Please finish the story please)\nStorytime's over\nYou asked for a story I gave you one\nTake it, just take it\n(This is the worst bedtime story ever)\nBye\n\n[Verse 4]\nPsych sucker, Smearcon is back\nYou really think that he would go out like that?\nThey're under attack, MAC under the back...\n\n[Outro]\nI'm just playing, it's really over\nIt's the end of the tape\nThank y'all man\nPharaoh Height two thirty, Yeah\nShout to DJ Busy\nYou know how we do\nUhh Uhh hah\nHope you all enjoyed it man, Yeah\nScott what up\nWhat you thought I couldn't do this no more, huh?\nMan listen, lets let this play out\nBogglin' Giblets", "image": "https://images.genius.com/bef4cf108208bb4604a6547581b0aaf0.500x500x1.jpg"}], "artist": "Lupe Fiasco"}