{"songs": [{"title": "One Spliff", "album": "Reefer Party 2", "year": null, "lyrics": "[Intro: Wiz Khalifa]\n\nThe gang in this bitch...\nYoung Wiz Khalifa man\n\n[Verse 1: Wiz Khalifa]\nCalifornia grapes, I'm breaking fine wines\nMe I'm sky high, my bitch down to earth\nMoney in the bank, weed roller in her purse\nAnd I ain't slackin on the job, my dog I been alert\nBeen gettin cake, bank being the verb\nBig numbers on the net so niggas show love\nAnd the diamonds on my neck should make these hoes trust\nOn the road, at the venue filled with model hoes\nCollege shows, smokin grade a honor roll\nBad broad, light skin, hood niggas, white friends\nAnd I ain't gotta talk much, it's in your face\nGive me brain, cause she say she got expensive taste!\nLet her rub my tattoos, now she flyin'\nSmokin' zig zags too, nigga rap like crack so I\n\n[Hook]\nOne spliff a day keep the ill away\nOne spliff a day keep the ill away\nOne spliff a day keep the ill away\n\n[Verse 2: Malik MD7]\nMalik...Md7\nToo Mucking Fuch lets go\nTurn off my BB and my HTC\nPlease don't interrupt me when I'm smoking THC\nI'm out to prove, what I'm about to do with this ounce of food (what?)\nFirst class flights, higher altitude\nLead astray by the hash tray\nI am half baked\nIf there's no smoking sign I'mma eat my hash cake\nOnly with my back up, I'm out to get paid\nAnd I roll my spliffs backwards, the Amsterdam way\nHey, hey!\nGot mental health problems, forget it!\nI will give you two draws, you will turn schizophrenic\nThis smell of your police, pull us over for the hell of it\nBut fine often, cause we smoked out for the evidence\n\n[Hook]\n\n[Verse 3: S.A.S]\n[Mega]\nInhale, exhale, on smoke...\nThere was big on... then I used to roll spillfs\nGet the whole sip, now I'm in the days\nOn the... 'till I drift away\nI'll be on it, on it all night\nYeah, that's super strong\nDown to the last...\nI don't know, should I roll, should I hit the bong\nPaint the town red like the soles on the loboutins\n[Mayhem]\nHydroponic (hah!), home grown (hah!) (hah!)\nWe're playing chronic, this is a smoke zone\nRolling flower power joints, nose cones\nIf I light this shit up I'm fucking up the ozone\nI smoke that... is legit\nJust a hit make you twitch like smoking on friday\nLive your life, that's what I say\n... while we speed, that's the highway!\n\n[Hook]\n\n[Verse 4: Calliko]\nLet's go!...\nYou can smell it through my pocket\nCountry boy from illinois yea im a pothead\nHyrdoponic you can smeell it through ya pocket\nIt ain't tricking if you got it, girl I got bread\nAnybody feel like rolling up a blunt of kush?\nI would, but she got me sleeping, feeling good\nSick of position body stiffer than a brick of wood\nThat's me feeling like a real nigga should\nI'm addicted so consistent lets roll up another\nLight green swisha sweet casa loma suites in the d\nYou know the ones wit the upstairs\nWhen im powered up I devour blunts doing what I gotta do until a mothafucka\nUp there, up where in the air you can't come up here\nReal players do whatever that they want here...\nMoving quicker than jamaicans in the fast lane\nI'm babysitting, don't forget to tell em pass mane\nBreak it down, roll it up\nBreak it down, roll it up\nBr-break it down roll it up\nCalliko, Wiz Khalifa, roll up in there!\n\n[Hook]", "image": "https://images.genius.com/ae2da92c2cbf9125a998b750252683d6.600x600x1.png"}], "artist": "Wiz Khalifa"}