{"songs": [{"title": "Harvard Design Speech", "album": null, "year": null, "lyrics": "So after walking through here I decided that I wanted to make sure for anyone that didn’t have tickets tonight that you all could have tickets to the show. So anybody who wants to come tonight, you can have tickets for the entire office!\nBut I just wanted to tell you guys: I really do believe that the world can be saved through design, and everything needs to actually be “architected.” And this is the reason why even some of the first DONDA employees were architects that started designing t-shirts instead of buildings. But just to see the work actually be actualized\nIf I sit down and talk to Oprah for 2 hours, the conversation is about realization, self realization, and actually seeing your creativity happen in front of you. So the reason why I turn up so much in interviews is because I’ve tasted what it means to create and be able to impact, and affect in a positive way\nAnd I know that there’s more creativity to happen. And I know that there’s traditionalists that hold back the good thoughts and there’s people in offices that stop the creative people, and [who] are intimidated by actual good ideas\nI believe that utopia is actually possible—but we’re led by the least noble, the least dignified, the least tasteful, the dumbest, and the most political. So in no way am I a politician—I’m usually at my best politically incorrect and very direct. I really appreciate you guys’ willingness to learn and hone your craft, and not be lazy about creation\nI’m very inspired to be in this space. Tonight, this show, if you come see it—um, I’m a bit self conscious because I’m showing it to architects. So the stage does have flaws in it. It’s an expression of emotion so give me a pass on that. And that’s basically all I have to say so thank you very much", "image": "https://images.genius.com/70c6e506a91f6dabdd23cad304812ce3.533x533x1.jpg"}], "artist": "Kanye West"}