{"songs": [{"title": "Form Follows Function", "album": "Food & Liquor II: The Great American Rap Album, Pt. 1", "year": "2012-09-25", "lyrics": "[Intro]\nI'mma just go... And then we'll figure it out from there\nThey say form follows function\nAnd if you just function properly things will form themselves\nYeah, that's kind of what it is\nSo on that note... America's most\n\n[Verse 1]\nFirst off gotta send shout outs to my niggas\nThen shout outs to my inner demon that be creepin' around my temple\nReady to set me off like Vivica or make me cross like a crucifix\nOr the legs on a Buddhist sitter deep in thought\nThinking as deep as the sea of salt\nAnd they sink in the same sea that we walk\nNot that we Jesus, we just don't wait until it thaws\nBut you can hold my hand like applause, pause\nWith no homophobia involved\nNow if I would've said that you can hold my balls like VFW Halls\nThat would've been the call, but naw\nYou can't see in ours, but we can see in yours\nYou can't see in ours cause ours is Kingdom Hall\n\nYeah, just like that, we just let it roll, you know?\nYeah, and check it, check it\n\n[Verse 2]\nSo when that pond thaws and it's no longer Gretzky\nThat's when we jetski\nI gotta catch up to myself, I kind of left me\nAre the windows still blocked up? Let's see\nMaybe see something we couldn't view before\nBeen in the stu all day cooking food for thought\nNow out the soup du jour for you and yours\nMight find sushi for your soul, we call that moving raw\nLions won't cross the line\nCougars won't move a paw\nChickens won't cross the road\nDogs won't roof at all\nAlways had flow, just added a front door, roof, and walls\nHotter than the fire that into which Koopa falls\nBut that's only if you super dawg\nSicker than when you use your dog to do assaults\nYou can never really tell just who's the fraud\nTruth might still be alive like true and false\nThat's why I never really trust unless it's Lu endorsed\nSponsored by me and of course you know who enforced\nNow that's three mis, like you warming up your vocal chords\nAdd a fourth if your vocals hoarse\nLike Mister Ed\nGet out of pocket have a horse's head in your bed\nNow that's what I call a good night's rest\n\nYou know? You know, just plays like that\nWhen you just let it flow\nWhen you sit back and just let it go, you know?\n\n[Verse 3]\nAnd now my vocals warm\nAdd a fifth and a sixth now I'm ready to perform\nThe Buddhist said that I am not reformed\nIf I ever be reborn I keep coming back as me\nWell don't forget the other five as we\nWeave the most wanted Angelina Jolies\nAnd Morgan Frees\nSend it around the room like we smoking trees\nBut it's no purple in the circle then there ain't no rolling b's\nJust spoken words, thought provoking reeds\nHydro, I'm still strolling on the seeds\nEye low, like the lotion from the leaves\nAnd to achieve it took a lot of token like Chuck E. Cheese\nAll without touching weed\nBut I'm still hungry and I'm having lunch for three\nThis is my form, now what the function be\n\nAnd art what I draw\nAnd ooh, what I say like Imogen Heap\nGood night niggas, go to sleep\nYou know? It's like form follows function\nAnd if you function properly then\nThe form will come out of it\nAnd whatever it is, it\nIt just be what it is, you know?", "image": "https://images.genius.com/379173777569ae56b01f75924aa6ba0d.500x500x1.jpg"}], "artist": "Lupe Fiasco"}