{"songs": [{"title": "Detroit vs. Everybody", "album": "SHADYXV", "year": "2014-11-11", "lyrics": "[Produced by Statik Selektah]\n\n[Hook: Dej Loaf]\nTell 'em, if they want it\nThey can come get that (static)\nI swear I love my city\nI just want less (static)\nSee me, they salute me\nThey ain't ready for that (static)\nDetroit vs. Everybody\n\n[Verse 1: Royce Da 5'9\"]\nUh\nI took a bite out the rotten apple by the poison tree\nAll these females need to email to make noise\nAnd now things changin' a lot, he fuck with my authority\nThen he shall see shells, but not by the seashore if he gangbangin' or not\nIt's simple as the alphabet, he F with me\nThat G shall surely see, he definitely as 'bout it\nAs retail fraud, he's weak, the honest gesture\nThe trigger finger round the diamond tester, we tell flaw with heat\nThe same soldier, it's me, myself and I\nRidin' round shootin' my biopic in my autobiography Range Rover\nThis ain't the squash beef state\nYou thinkin' make-up, we thinkin' Lark Voorhies face\nThe twin Eagles'll air his coupe, might as well ride by in an ambulance\nMy pair'll shoot, like skydivin' in Hammer pants\nSo call it siblin' rivalry\nTake his life; call it the unforgivable robbery\nA wise man told me that holdin' a grudge is like\nLettin' somebody just live inside of your head rent-free (Real talk!)\nI don't got time to evict these clowns\nY'all niggas been bitches, that's none of my business, but I don't sip tea (That's Nickel)\nRidin' round his block\nAll he know is pitfalls, that's why he always climbin' out his drop\n(I got a question) Do you wanna ride or die?\n(Welcome to Detroit, motherfucka!) (Sean Don)\n\n[Verse 2: Big Sean]\nBoy, I need no halves and halves, I want the game in entirety\nHundred percent cut; no stitches required\nWelcome to Detroit, where if you get that promotion\nDon't worry, man, them bullets will still be at your ass firin' (Brr, brr)\nI still call it safe, I would suck if I was umpirin'\nBoy, I hit the beat, and just treat that shit like a diary\nI'm offended if you hear my new shit and you ain't rewindin' me\nSelf-made, I never needed your bail or a wire, see\nI'm never callin' collect, I call to collect\nMy homie wanted a Chevy, so I put my dog in the 'Vette (Swerve)\nAhh! Plus I'm so loyal that that paper, boy, is all that I fetch\nIf the ball in my hand, then the ball in the net (Net)\nBitch, I'm the D, can't no offense dunk on me (Me)\nI'm Mr. Big Shot, these hoes get drunk off me (Me)\nI'm over-respected\nMy mama gated community's overprotective\nSo futuristic, I'm already over my next bitch\nReminiscin' on listenin' to 50 fifty times a day\nBack when tenth grade was like fifty days away\nTryna get paid fifty ways a day\nUsed to put fifty on the layaway\nNow my closet fifty shades of grey\n26, and I done lived a lifetime a few times\nFrom futons to Grey Poupons\nIn church, tryna get a little savings, yeah, a coupon (God)\nI spit that A1 every day, I'm hittin' new primes\nNow the stakes high, niggas surprised at the new lines\nTakin' down my number, like, \"You still ain't got a new line?\"\n(You still ain't got a new line?)\nNah, it's the same, we been laborin' for years\nI know it took way longer than nine months\nBut fuck it, it's all in due time\nI turned a blunt to a roach, with dreams of bein' a Beatle\nDon't want to, I need to, ya gotta learn to keep it cerebral\nWhen you come up in a place\nWhere everyone got a piece but ain't peaceful\nThis is just part one, wait 'til the sequel (Let's go,) lil' bitch!\n\n[Hook: Dej Loaf]\nTell 'em, if they want it\nThey can come get that (static)\nI swear I love my city\nI just want less (static)\nSee me, they salute me\nThey ain't ready for that (static)\nDetroit vs. Everybody\n\n[Verse 3: Danny Brown]\nComin' from them streets where they thirsty, starvin' to eat\nJust a step away from failin', that's why they call it the D\nArguably the whole reason for all of this honesty\nHonestly no honor roll, but honored up in them streets\n‘Cause I'm a Linwood nigga, them young niggas hit ya\nPut a stack on your head, you'll bleed a lake on Grand River\nIf you think your hood harder, then I might beg to differ\nKnow some killers pull the trigger for a Swisher and Miller\nIf the blicka hit ya kisser, bet yo' ass not rememberin'\nThey say my city's tougher than two fat bitches scissorin'\nSo, nigga, I'm a veteran, retire my letterman\nHave K's in front of your school, but I ain't goin' to Kettering\nCough up a lung, 313 where I'm from\nXan got me cross-eyed like Bernstein’s son\nAny nigga try to copy, put a hole in his top\nIt's us vs. them, Detroit vs. Everybody\n\n[Verse 4: Eminem]\nLately it seems as if it's me against\nThe world, like it was before my life became a movie and they used to use my mothafuckin' trailer to tease me with\nBut I flipped that script like a refill of\nPainkillers to pop the lid off that safety seal\nIt made me feel amazing, Navy SEAL of bravery\nAnd if I may reiterate, I ain't even need a script\nAin't bein' conceited, but I made it to radio—eat a dick!\nI still never ABC this shit\nMainstream appeal, but the skill is what made me iller\nSince before they called Jay Dee Dilla\nI was daydreamin' one day I would be the shit\nAnd if I ever end up escapin' these streets\nI swear that I would stay here still\nAnd if I'm crazy, I'll always be real\nDon't make me steal an eighteen-wheeler\nBreak all of my friends out of here\nAnd take 'em straight to the Mercedes dealer\nPeel off back to the same block that we came from\nOn a rampage too crazy for me to flip\nWhat's makin' you think I need a switch?\n‘Cause I'm Adrian Peterson\nWhen he's ragin' and heated and\nOn the way to go beat his kid?\nOn a track get spanked like he just did\n(Detroit!) I can't never leave this bitch\nSick of bein' treated like we ain't shit\nBut Jesus, I can see just why people quit callin' me to do features and them cyphers on BET, ‘cause if\nI wasn't me I prob'ly wouldn't\nWanna play with me neither, shit\nSeems to be reachin' its fever pitch\nHundred and eighty degrees in here\nShoulder blade full of cedar chips\nMC's just bit off more than they can chew\nLike a face full of Swedish Fish\nOr Lorena with two penises\nHateful and geniusness inconvenience\nAnd for the record, you don't want this type of static\nIn your life, when I'm makin' you cling to it\nMay consider tryna reinsulate your windows\nMay be in for another crazy winter\n‘Cause so cold in the D, it is\nAs days begin to tick away, but ain't this really\nWhat made me into the angry bitter blonde?\nBut ain't we sick of bein' underdogs?\nDon't make me unleash this shit, release this pit\nMay even seem as if I'm yankin' your chain a bit\nOr maybe the way in which I'm sayin' shit\nIs playin' with you, but ain't shit changin'\nIt's still the same shit and Shady's still a lady killer\nSince the day I went insane and then attacked the babysitter\nWith a potato peeler\nAnd mushed her face into the entertainment center\nIt's like another plane just entered into Ukraine again\nOr the Bermuda Triangle and\nAttempted to make a safe descent\nAwaiting anyone who ain't affiliated, it could be danger\nDid you make arrangements with the gangsters 'fore you came here? And if they mention us…\n\n[Hook: Dej Loaf]\nTell 'em, if they want it\nThey can come get that (static)\nI swear I love my city\nI just want less (static)\nSee me, they salute me\nThey ain't ready for that (static)\nDetroit vs. Everybody\n\n[Outro: Trick Trick]\nWhat up though? It's the godfather Trick Trick\nYou either ridin' with us or gettin' rolled on\nThat means Detroit vs. Everybody!!\nHey, Em, let me get that instrumental\nTake it down to the hood\nLet the little homies get this remix crackin'!\nDetroit! Okay!", "image": "https://images.genius.com/c7603f84738974b523c47a2fe28cc2db.320x320x1.jpg"}], "artist": "Eminem"}