{"songs": [{"title": "Throw Ya L’s Up", "album": "10", "year": null, "lyrics": "Uhh, hot, fire, hot, uhh\n\n[Chorus]\nL!!!  Who bring you the hotness?\nL!!!  Yo, you don't wanna start with\nL!!!  Forever keepin it locked\nIt's now time to rock with - L!!! - throw your L's up\n\n[LL Cool J]\nDon't ever underestimate the Jack the Ripper\nBe clear, every time he reappears, it's sicker\nListen here, the mind expanded, the vision is slicker\nI'm long range like a miss-ile, many styles to getcha\nTear ya out the frame so the hood can get the picture\nBut I'd rather break bread, kick knowledge and get some money witcha\nI'm willin and able, to smooth pounds out like Witch Hazel\nThe legend is real, I'm not a fable\nCaptivated the screen, I'm Queens' Clark Gable\nIf it ain't a joint, bet your label, don't put it on the table\nI'm out for the moolah, throw better hooks than David Tua\nWho's the nicest?  (L, YOU ARE!!)\n\n[Chorus] - repeat 2X\n\n[LL Cool J]\nYou don't want it with L, b'ship cats'll get banged out\nPut your flow throw a filter boy - shake the old slang out\n23's in the building, watch my tongue hang out\nMakin MC's scatter like multiple shots rang out\nDay one since I came out, they can't put the flame out\nMy temp seizin, perfect reason to blow the game out\nSkatin off in the Navi, naw baby you can't have me\nBut I know cats will pay for that 'n lace ya - yeah, gladly\nWarning, young rappers, you don't want a career?\nY'all wanna keep goin platinum, y'all don't wanna disappear?\nStop boppin backstage like you causin me fear\nCause you startin to get on my nerves, and that's a problem\nThe vet's in here\n\n[Chorus] - repeat 2X\n\n[LL Cool J]\nTension on the mic, halftime highlights\nL Boogie bangin on 'em, jumpin through the skylight\nYou stand corrected, I'm hot, so get it riddight\nI'm just spittin, when the middick is gripped, I spit it tiddight\nAight?  Oh, these various rappers is so hilarious\nWho put the mic down but y'all ain't qualified to carry this\nYour, tracks are garbage and bars are miscellaneous\nSo, throwin your joint at my car was spontaneous\nOh!  I can't take it, why, must they fake it\nFlows is fully dressed, yours is butt naked\nForever I will be, the one they came to see\nBlowin mics in half baby, who else could it be but\n\n[Chorus] - repeat 4X\n\n[LL Cool J]\nUhh, I'm so hot (yeah)\nWe so hot (yeah)\nUhh, uhh, you so hot (I'm so hot)\nUhh, uhh, feel it hot (yeah)\nUhh, uhh, are you hot (you make me hot)\nUhh, uhh, I know I'm hot (oooh)\nUhh, uhh, are you hot (yes I'm hot)\nUhh, uhh, I know I'm hot - feel it! (yeah)", "image": "https://images.genius.com/4f8b990045f8d7f5532831376c6d5cbc.500x500x1.jpg"}], "artist": "LL Cool J"}