{"songs": [{"title": "The Club", "album": "The Unplanned Mixtape", "year": "2009-09-07", "lyrics": "[Verse 1]\nThank God it's Friday\nGot my paycheck and I'm going home\nLeaving my job, on the highway, turn up my stereo\nBecause last weekend sucked\nBut this one's gonna be different\nBecause it's fucking Friday, I'm getting drunk and we gonna kick it\nThen my friend's like, \"Hey man, what's going on?\" (\"I don't know\")\nWe all know though that we're gonna get drunk at the club\nGet it crunk to the same shit we did the week before\nMeet at the store\nFree funking in my house\nIn high school it was drinking games\nBad house parties in Ike's house\nBut now we go on the town\nWe gotta hit the club\nWe gotta spend them bucks\nAnd we gotta get it crunk\nSeven for a drink and fifteen cash at the entrance\nAnd thank heavens Wells Fargo's got overdraft protection\nWe walked up in\nYes, they're spinning R.Kelly's remix to the remix about a chick and skeeted on her belly\nThe females (woop, woop) they're done and there're plenty\nI got two dollars... ah, charge it, bartender a round of Henny!\n\n[Hook]\nWe're going to the club, club\nPour me another one, gotta get numb, numb\nHopefully end up with a girl I can fuck, fuck\nOops, baby you know that I meant love, love\nWho's coming with me back to my tub, tub?\n\"Now, Macklemore, you know you ain't got no hot tub, man,\" tub, tub\nShut up man, she don't know us, us\nEverybody toast your glasses, tonight's the best night ever\nNow who's getting hammered?\n\n[Verse 2]\nI'm on the wall drunk as fuck\nLike this sucks, I'm hella bored\nDecided to cut the rug with a female, like stellar on the floor\nBreak her off her stiletto, sore\nThought she was Puerto Rican, started talking\nI'm like, \"Woops, it's a honky, she's just hella orange\"\nMy homie's like, \"Mack, what you tell her for? She was feeling you\"\n\"Dawg, I could peel her foo, this is Washington not Florida\"\nThe white girls are looking for some big black dick\nThe black girls are all, \"Yeah he's cute for a white guy, but that's about it\"\nAsians kicking with Asians\nAnd the Latinos are too beautiful\nWish I could confidently be like, \"Girl you don't know what I could do to you\"\nGet her back to the pad and probably bust in my pants\nShe'd be like, \"Ooh, ah, pappy,\" I'd be like... sorry\nThink I'mma buy you a drink? Better find you a shrink\n(\"I'm rich bitch, psych\")\nI sling CDs and grind tapes, bet your boyfriend can't spit\nGet the clit to vibrate\nI should have stayed home, I get more chicks on MySpace\n\n[Hook]\n\n[Verse 3]\nThere's that sweaty girl (sweaty girl)\nIn the corner on e-bomb\nThinking she's in a Missy video but really looks like a retard\nAnd there's the wall muggers (wall muggers)\nThat shout just to seem hard\nAnd there's the ball suckers (ball suckers)\nThat fight and just seem odd\nI spent seventy-five dollars and these drinks don't work\nWho the hell's this ugly, taint skank?\nWhy are my friends in pink shirts?\nMy hat's too big\nMy air-force's were clean when I came here\nNow they're stained in beer\nAnd who peed on my white tee?\nI thought this was the spot, I was supposed to get jocked\nThere's a dude talking on chickens and they're clucking for cocks\nFunny thing is, we're all insecure\nThat's why we call the bartender and tell him to give us a beer\nUntil our judgement is blurred and little voices slush and they slur\nWe getting faded, waking up hungover and going to work\nDo it every weekend, this is the life\nYou better peep it\nAnd it ain't no secret the club sucks, but do we go?\nBetter believe it!\n\n[Hook]", "image": "https://images.genius.com/271e7551d2ccbead25e01c36162352d0.900x900x1.jpg"}], "artist": "Macklemore"}