{"songs": [{"title": "Monster (Creatures Lie Here)", "album": null, "year": "2012-01-07", "lyrics": "[Hook: Meg]\nMonster, how should I feel?\nCreatures lie here, looking through the window\nMonster, how should I feel?\nCreatures lie here, looking through the window\nMonster, how should I feel?\nCreatures lie here, looking through the window\nMonster, how should I feel?\nCreatures lie here, looking through the window\n\n[Verse 1: Tech N9ne]\nTech's in the place, everybody gettin' mainy\nPunks better cuff your lady, can't nobody tame me\nBlame me, for keepin' her runny eyed rainy\nLadies used to hate me, now they comin' out their panties\nGirls on the jock (check), pocket full of socks (check)\nGot a fat knot (check), somethin' going squat (yeah)\nDown, dopa-dopa-do, down for the block? (yes)\nTryin' to be hot, but you flop\nWanna be shot to the top but you not dwamn!\nI ain't never seen so much green\nThan when I seen when my team hit the scene\nIt must be a dream\nHit the stage, everybody holler\nGettin' throwed, rippin' shows for a bigger dollar\nFather, I don't wanna leave nobody toothless\n'Cause they greedy in the middle of what I do best\nYou finna see me in the TV with a few guest\nWe 'bout to bubble, baby, get your waterproof vest\n\n[Hook: Meg]\nMonster, how should I feel?\nCreatures lie here, looking through the window\nMonster, how should I feel?\nCreatures lie here, looking through the window\n\n[Verse 2: Hopsin]\nI'm the rap maniac with the hooligan eyes\nWho's cooler than I? Wack niggas, move it aside\nWhen you heard I was a big deal you were surprised\nWest coast, bitch, put ya w's in the sky\nI spent my days as a refugee\n'Til the rap game came to rescue me\nAnd left my wrist paved in accessories\nA dangerous necessity, I came here to wreck MCs\nYou're wrong if you thinkin' Wayne was the recipe\nNah, he ain't worthy of that, the controversy is back\nGet off the kool aid, stir me a batch\nSee, I prefer to relax, but I can't and God knows it\nGotta stay raw with the flow that I'm diagnosed with\nOh shit, niggas, keep fuckin' with my emotions\nMaybe that's the reason I suffer from psychosis\nShocking as high voltage, fuck it, my life's hopeless\nSo I had to make sure I killed it when I wrote this\n\n[Hook: Meg]\nMonster, how should I feel?\nCreatures lie here, looking through the window\nMonster, how should I feel?\nCreatures lie here, looking through the window\nMonster, how should I feel?\nCreatures lie here, looking through the window\nMonster, how should I feel?\nCreatures lie here, looking through the window", "image": "https://images.genius.com/6032d93aedc422d84439e06b07e59af0.600x600x1.jpg"}], "artist": "Tech N9ne"}