{"songs": [{"title": "My Ego", "album": null, "year": "2016-06-12", "lyrics": "[Verse 1]\nTell Theresa May to let me in\nI've been going in since 2010\nIt gotta be the color of my skin\nCause there's nigga's there\nThat doing more damage than my pen, man\nSaid some old lines was offensive\nI was young, I can't apologize for that shit\nThey took my fiction literature for literal\nI ain't no motherfuckin' criminal\nThe fuck is the problem, my record ain't got no smudges\nShit is clean as a whistle, and they just blow in them grudges\nLet the kids see a show, that's what they waiting to see\nIt ain't no drugs on my bus, boy, my edges are straighter than me\nSo what the fuck is the problem? That lil Black boy made it\nHe's got a little bit of power and these white niggas hate it\nAnd now he talking shit again, his stupid ass should have waited, fuck\nThey said I was a bad influence to who?\nThe camouflage following niggas like you?\nOr all the free thinkers that know what it do?\nCause I'm one of them\nSee Ace is a king, I don't need your respect\nSo I made my own shoes, fuck that royalty check\nI don't need your opinion, keep a mirror on deck\nSo don't you talk to me\n\n[Hook]\nIt might just be my ego\nIt might just be my ego\nIt might just be my ego right now\nClancy you should calm me down\nIt's my ego\nOr maybe it's my ego\nIt might just be my motherfuckin' ego\n\n[Verse 2]\nWell maybe it's my motherfuckin' ego when I'm ruling the world\nAnd I ain't proving shit to niggas who just want me to fail\nNiggas is fronting saying we distant cousins\nWhile y'all pants was always flowing, all my trousers was flooded\nMad niggas be watching my moves, I never copped my props\nFor everybody and they momma got a problem with shock\nY'all niggas trash, y'all niggas trash (Goddamn lies is over niggas)\nSame niggas laugh when you making shit\nThen three years later wanna emulate the shit you did\nY'all pay the price\nAsk some old friends, that shit is over and finished\nLook around in the crowd, them niggas not even attendance\nThat shit is done, and Lionel  my witness\nBut I had to move on cause I can't fuck with them niggas\nI shut it down\nNow wow, now he's saying that one day\nHe found his wings, now he using 'em on his runway\nPink yellow, blue and orange, shit is dark\nDifferent pattern, you say the same shit from the start\nNiggas I am a wave, y'all just fuck with the sharks\nAnd I got flames on my pants cause I walk how I talk\nSo keep them comments, keep them comments, keep them comments, boy\nWhen it's said and done my pockets gon' be filled with commas, boy\nY'all [?], y'all saying this\nY'all niggas say that shit is gross, that shit is nasty, eww get away boy, I'm good\n\n[Outro]\nAnd if you see my old friends, tell 'em that I really miss 'em but I'm good\nAnd if you see some bad times, tell 'em I don't really miss 'em, boy I'm good\nAnd if you see my old self, tell him not to worry cause he'll be good\nSorry my feelings is running, GOLF 2016, thank you niggas for coming\nI'm out, I'm out", "image": "https://images.genius.com/44ccb52546160e786d44a73092431a6c.600x600x1.jpg"}], "artist": "Tyler, The Creator"}