{"songs": [{"title": "Swerve", "album": "OKE: Operation Kill Everything ", "year": null, "lyrics": "[Intro:]\nAye Pops\nThey love that soulful shit\nOKE\nI mean we do this shit cause we love it\nI mean we did this shit cause we couldn't find Just Blaze\nWe good\nIt's The Firm, nigga\n\n[Verse 1:]\nI'm back, open the door nigga\nAll this bout the verse, what is it for nigga?\nI ain't Jay-Z nigga, I'm still poor nigga\nAR, Stat, walk with me to the store nigga\nMy baby mama hurt my feelings, got me sore nigga\nBut that's cool cause I'm back to my core nigga\nSup? 40 Glock you want some more nigga?\nGame don't fall off, Game get bored nigga\nCompton, got it coming out my pores nigga\nI'm like Cassidy with 25 million\nStack it up, that's like a project building\nGet back with 50 but I can't cause I killed him\nWait, have you seen him?\nNada, papa, nigga live on that milk carton\nAnd my nigga Boosie still ain't got a pardon\nSwerve!\n\n[Hook:]\nSaid my nigga Boosie still ain't got a pardon, swerve\nMy lil nigga Boosie still ain't got a pardon, swerve\nSay my nigga Lil Boosie still ain't got a pardon, now swerve\n\n[Verse 2:]\nSo take a shot at any of my little niggas, it's war nigga\nFuck a gun, we bring hammers, like we Thor nigga\nMy nigga Pops got beats you can't ignore nigga\nSaid my nigga Pops got beats you can't afford nigga\nWake up double the kush, we by the shore nigga\nIt's 3:40 now, back in Compton by 4 nigga\n105, doing 105, shell slides like doves in it\nI'm so good with the razor\nTake the hard brick of soap and carve dove in it\nI got your bitch no glove in it\nI went raw, bust a nut in there\nDisrespect intended however you spend it, disect your rent\nCause none of ya'll from out here\nYou think you run out here, have your ass on a run out here\nYou a bum out here, and no don't call Big U\nCause we in the Phantom and we bout to bust a big U, swerve\n\n[Hook:]\nSaid my nigga Boosie still ain't got a pardon now, swerve\nMy lil nigga Boosie still ain't got a pardon nope, swerve\n\nAnd all these lil niggas rockin' Boosie flat top fuck that, swerve\nTil my lil nigga get his ass a pardon we gon' swerve\n\n[Outro:]\nHey Pops, you a motherfucker for this shit\nI tell you what I'm a do\nI'm a talk to you motherfuckin for about\n4 and a half more bars\nAnd I'm a let that bitch breathe\nSo when my nigga Boosie get out the motherfucking joint\nHe can catch some shit on one these motherfuckers\nSoulful shits\nBreathe\nBreathe\nBreathe\nBreathe", "image": "https://images.genius.com/f04f9b2892eac01c8dd7876593883785.500x500x1.jpg"}], "artist": "The Game"}