{"songs": [{"title": "Run The Night", "album": null, "year": "2017-01-20", "lyrics": "[Verse 1]\nAy\nHow you spell America?\nM-O-N-E-Y, hey\nA million ways to win, a million ways to die\nThey ain't teach you how to make it, gotta improvise\nA fight to get the biggest slice out the biggest pie\nWars for peace, wars for freedom, ha ha ha\nBut war don't really got a finish line, hey\nIs it really gentrified or just genocide?\nIs it for the civilized or assembly lines?\nCorporate enterprise, eat off all your prison time, hey\nWhen you commit a crime, now it's dinner time\nIt's not the money it's the greed that conceals ya\nThey say it's not the cancer it's the chemo that kills ya\n\n[Hook]\nWhat a sight, what a sight, what a sight\nWhen the fire has started to rise\nAnd then the people would say\nShoutin' \"We run the night\"\nSayin' \"We run the night\", yeah\nWhat a sight, what a sight, what a sight\nWhen the fire has started to rise\nAnd then the people would say\nShoutin' \"We run the night\"\nSayin' \"We run the night\", yeah\n\n[Verse 2]\nLook, who put the con in economy?\nProbably the same ones that put the sun in astronomy\nCommon sense ain't as common as one would think\nTo program you they do it subconsciously\nYou such a patriot\nDown for your country but your country never gave a shit\nAm I citizen here or am I just paying rent?\nI think I finally understand just what the matrix is\nWhat my location is\nAnd niggas all anti this and anti that\nWell you so anti everything that you anti black\nAnd you so anti violence that you anti strap\nNow you look hella unprepared when it's time to attack, bands\n\n[Hook]\nWhat a sight, what a sight, what a sight\nWhen the fire has started to rise\nAnd then the people would say\nShoutin' \"We run the night\"\nSayin' \"We run the night\", yeah\nWhat a sight, what a sight, what a sight\nWhen the fire has started to rise\nAnd then the people would say\nShoutin' \"We run the night\"\nSayin' \"We run the night\", yeah", "image": "https://images.genius.com/21f8f556b7942d7a41fe5040265566f6.600x600x1.jpg"}], "artist": "B.o.B"}