{"songs": [{"title": "It’s a Thin Line Between Love and Hate", "album": "36 Seasons", "year": "2014-12-09", "lyrics": "[Verse 1: The Revelations]\nIt’s a Thin Line Between Love and Hate\nIt’s a Thin Line Between Love and Hate\nIt's five o'clock in the morning and I'm just getting in\nI knock on the door and a voice sweet and low says\n(Who is it) She opens up the door and lets me in (let me in)\nNever once did she say where have you been?\nShe said, (are you hungry), are you hungry honey, (did you eat)\nYeahhh, let me hang up your coat\nThe woman says, pass me your hat\nAnd all the while she's smiling\nNever raises her voice\nIt's five o'clock in the morning and I don't give it a second thought\nIt’s a Thin Line Between Love and Hate\nDon't think you can keep breaking your woman's heart\nIt’s a Thin Line Between Love and Hate\nAnd you should sit back and enjoy it\n(It’s a Thin Line), Yes it is, yes it is, (Between Love and Hate)\nShe gonna fool you one day\nThe sweetest woman in the world, can be the meanest woman in the world\n(If you like her that way)\nYou keep hurting her, she keep being quiet\nShe might be holding something inside, she gonna hurt you one day\nNow I'm laying in the hospital, bandaged from feet to head\nIn a state of shock, just that much from being dead\nI didn't think my woman can do something like this to me\nI didn't think the girl had the nerve\nHere I am, I guess actions speak louder than words\nIt’s a Thin Line Between Love and Hate\nDon't keep thinking you can keep treating your woman bad\nIt’s a Thin Line Between Love and Hate\nShe won't ever get mad\n(It’s a Thin Line), Yes it is, yes it is, (Between Love and Hate)\nShe's gonna fool you one day\n(It’s a Thin), It's a line thin, (Line Between Love and Hate), between love and hate\nIt’s a Thin Line Between Love and Hate\nShe's gonna fool you one day\n(It’s a Thin Line), Yes it is, (Between Love and Hate)\n\n[Outro]\n*Sounds of loading bullets into a gun\n[Voice of 2 men]\nHey Tone!\nWhats the deal?\nThey wanna play?\nLet's get these motherfuckers!", "image": "https://images.genius.com/b7e8d5889ca7a25f1f186a54b799b1ab.1000x1000x1.jpg"}], "artist": "Ghostface Killah"}