{"songs": [{"title": "Popped Off", "album": "Fuck Da City Up", "year": "2012-01-01", "lyrics": "[Intro: DJ Drama]\nWe back at it, the wait is over\nDr. Dre, T.I.P.,\nThis shit is special\n\n[Verse 1: T.I.]\nSee a party ain't a party 'til the Doc walk in it\nIt's hard to get it started 'til I hopped off in it\nThen it got so crunk one minute\nSince you didn't get to witness, just listen\nI came in hot, and then I saw\nAs soon as I arrived then the shit popped off\nThe shit popped off\nIt's officially a gangsta party\nYou can leave, if she came to party\nThen the shit popped off (popped off)\nShit popped off (popped off)\nNiggas hands in the air, bitches takin' tops off\nPut the chronic in the air, and the shit popped off\n\n[Verse 2: Dr. Dre]\nIt's been awhile since you've heard these beats\nYou're malnourished\nBut he's back now, to flood these streets\nThey shall flourish\nOthers try but they lack courage\nIn fact, this track was on the back burner, it leaked\nSo back to the lab I had to go\nBut it was too magical, so\nHere, doctor smack a ho's back, ask if it's tactical, (sure is)\nGirl, I hope your vaginal has endurance\nCause I'm about to do somethin' tragical\nRest assure this\nCause homie hit the OE flow, you know me from before\nBut you don't know me like this, so do see do\nGet on top of me and ride it like a rodeo, ho\nI'll have you OD'ing on dick, this belong to your soul\nFelonious, I'll kill your loneliness\nBut only just for, one night\nYeah that was fun, right? But I gotta go\nI got a bottle of Mo and fo' mo' lil' mommy's\nLookin' like models, waitin' at the do' inside of my ho-tel\nAll ready to swallow and yo, follow the flow and traffic to the top flo'\nAnd you gonna smell a lot of Merlot, a lot of chronic for sho'\nGin and tonic sold from the top to the bottom, let's go\n\n[Hook: Unknown and (Dr. Dre)]\nOrder some more bottles, come on momma\nWould you like a drink on me?\nTo me it's no problem if you wanna, baby come and drink with me\n(She take it off at the do', she take it off for the do'\nGet that ass on the flo', go, go)\nTo me, there's no problem if you wanna, baby come drink with me\n\n[Verse 3: T.I]\nBright lights, late nights\nDrop auto-mobiles outside hotels with a lot of hoes\nBottles poured, blow a lot of dro, no powder though\nEverywhere you tryin' to go, I been a long time ago\nSwag done surpassed, my style is so spazz, I pop tags daily\nDrop Phantom, four eighty\nWalk up in the place, and all the ladies go crazy\nWant to get impregnated but all they need is throat babies\nThey runnin' up and askin'\n\"Is it true you know Shady\nDr. Dre be hangin' out with you, for real?\" Ho chill\nLike a magnet attracted to a nigga gettin' money\nI tell 'em, \"Kneel down, suck a nigga dick or somethin'\"\nRubberband poppin' off the bank roll\nHoppin' out the champagne Rolls, with the automatic do's\nPockets on swoll, both wrists so froze\nKing of the South, balls out on the West Coast\nLet's toast\n\n[Hook: Unknown Dr. Dre]\nOrder some more bottles, come on momma\nWould you like a drink on me? (drinks on me)\nTo me it's no problem if you wanna (baby come and drink with me)\nShe take it off at the do', she take it off for the do'\nGet that ass on the flo', go, go\nTo me, there's no problem if you wanna, baby come drink with me\nYou can have the time of your life, it's alright\nMake it a night to remember (remember), how couldn't you remember? (remember)\nYou can have the time of your life, it's alright\nMake it a night to remember (remember), how couldn't you remember? (remember)\n\n[Outro: DJ Drama]\nYes, yes\nThink about it\nWho brought the gangsta shit to the party\nAftermath, better than ever", "image": "https://images.genius.com/c4a42649ba1a4f401f2ed78317e312fc.1000x1000x1.jpg"}], "artist": "T.I."}