{"songs": [{"title": "Recently", "album": "Writings On The Wall 2", "year": "2011-07-05", "lyrics": "[Verse 1: Gucci Mane]\nShe want to sex me of course\nCause I pull up in a Porsche\nI make love to the money\nBut she can’t one stop my voice\nGot a shit load of hundreds\nGot a bag full of loud\nGot a hand full of 20’s\nI threw that shit in the crowd\nI’m playing 50 and Gucci\nDon’t play with 50 or Gucci\nCause they got goonies that do you\nThat hit your ass with the uzi\nAll my fans protest at my most recent arrest\nI smoke nothing but the best\nHere a toast of success\nAnd little mama want to creep with me\nI know she want to sleep with me\nIt gotta be the g in me\nCause ain't no R&B in me\nMr. Icecream man call me Mr. TMZ\nLike a blindfolded man niggas ain't seeing me\nIt’s Gucci\n\n[Hook: Gucci Mane]\nI just brought a drop just recently\nI killed the parking lot just recently\nI just brought a whip just recently\nI made another flip just recently\nI just bust a check just recently\nI bust a bad bitch just recently\nI’m screaming out “who want a piece of me?!”\nI just got a deal just recently\n\n[Verse 2: 50 Cent]\n50 and Gucci nigga this shit equals bread\nHomie fuck with the paper, I'm trying to take off your head\nWe get the check from the music, we get the cash from the trap\nWhen it comes to the money nigga we right where its at\nWhere it at! where it at! where it at! where it at! here it is!\nThe sickest shit, we filthy fucking nigga rich\nAlways on some crazy shit, blame it on some baby shit\nLambo round that autobahn, speeding like I bought a lot\nAin't got to talk to get a bitch, what you think we bought it for\nCatch me riding solo, you know I got the strap\nThat pistol like them pills ho you know im popping that\nI hit that button on your block and drop the top on my convertible\nI’m known to find a nosey rat but ain't nobody heard of you\nThey call me king, cha-ching that money coming in\nMan everything I seen is over cause I’m hood\nMy pinky ring, thats stacks, man thats a hundred racks\nThe way it bling makes dope boys want to move crack\n\n[Hook: Gucci Mane]\nI just brought a drop just recently\nI killed the parking lot just recently\nI just brought a whip just recently\nI made another flip just recently\nI just bust a check just recently\nI bust a bad bitch just recently\nI’m screaming out “who want a piece of me?!”\nI just got a deal just recently", "image": "https://images.genius.com/99f53129285385ae9b5b886965d9b2a0.320x320x1.jpg"}], "artist": "Gucci Mane"}