{"songs": [{"title": "I Can’t Swim", "album": "Tha Last Meal", "year": "2000-12-19", "lyrics": "(Sir Dogg)\nI am Sir Dogg, DPG fuck... and I hate water\nI never learned to swim....\nAAAAH! PUT ME DOWN!!!! Let go of my leg!!!\nI HATE WATER!!!! I CAN'T SWIM!!!! AAAAH!!!!!\n\n(Snoop)\nNow matter where I go, you got'cha eyes on me\nAnd everybody sittin' around waitin' on me\nShow us how you do it Uncle Snoopy\nSo fluid wit' your technique, y'all niggas gon' respect me\nMan, I been doin' dis' shit before I even learned how to crawl though\nGettin' interviewed by mothafuckaz like Geraldo\nAnd niggas wanna know if I smoke Newports or Marlboros?\nMan, I'm fuckin' wit' dat real shit, nigga can you feel dis'?\nI make dat shit for the realest of millions\nWhile I'm wheelin' and dealin' and feelin the feelin'\nHmm... and oh what a relief it is\nThat Snoop is back in dis mothafucka handlin' his biz\nTakin' care of his kids and makin' hits, oh shit\nThere it is again, you never know if your career might flop, fizz\nSo, stay on your toes and keep a pair wit'cha foes\nAnd keep a set of new hoes and floatin' and tie da bow\nFuck these niggas and peep out Whitey Ro (?)\nSomebody told? Well then, somebody gettin' rolled on\nAnd that's usually how the scenario rolls on\nBaby girl said she wanna keep her clothes on\nShe either fuckin' gettin' stole on or gotta stroll home\nWell number one, keep your hand on your gun\nAnd don't (don't) trust (trust) anyone (anyone, one, one.....)\n\nOhh... you can't trust nobody baby.... you can't even trust your own Mama!!!\nThis is Snoopy Collins.... trust no one.... especially a bitch....\nOr even a bitch-ass nigga.... Yo Ha!!!!\n\nT-R-U-S-T in me, I'm sexy but I'm pussy\nThe homies in the hood call me Lil' Bo Peep\nAnd you da type a nigga I been dyin' ta meet\nSo Snoopy, what'chu tryin' to do?\nNow hold on lil' mama, ain't no reason for me to lie to you\nNow what I'm tryin' to do, and what I'm gon' do\nIs hit this bud, I got a wife at home\nBitch I ain't lookin' for none, you might got kids for cuz, or down wit' bud\nPushin' them dubs, look here cuz\nLemme tell you how it's gon' be\nIf I was broke loc, these bitches wouldn't want me\nI'm tellin' you the good-god truth, you want proof?\nAsk them hoes over there, \"Y'all wanna fuck Snoop?\" (yeah!)\nWe'll take the money and the game away\nI bet they won't say the same that day\nBut it's okay, cuz I don't trip\nCuz \"Bitches ain't shit but hoes and tricks\"\nI thought I told you, bitch I'm a soulja\nEast side, long beach, gang-bang roller\nFrom the solar, cuz this, is it\nCan ya dig it? (I can dig it!!!)\nJelly Roll pulled a rabbit out his hat\nI pull a strap out my mothafuckin' back (Aaah!), cuz I know it's like dat\nI'm in a meetin' wit' these white folks talkin' bread\nThey want a contract on a nigga till' I'm dead\nIf I don't sign they gon' turn me over to the feds\nThey struck me out, now I'm pinch-hittin' for the Reds\nBut I'm a Dodger blue, so I gotta keep it true\nI gotta home-run, nigga we long gone\nI'm realizin', justizin', visualizin'\nRip-ridin', put mines in\nTakin' this game to the next level\nTrustin' no one, especially them Red Devils\nKeep ya head level, hand on my get-up\nStay on the red-up, pimpin' ain't easy, but there's a whole lot of fed-up\nAnd like I told you from the get-go, don't trust no one (no one, no one)\nAnd like I told you from the getti, don't trust no one...\n\n(Alien)\nOH NO!!! YOU DID IT AGAIN!!!! PUT ME DOWN!!!!\nI HATE WATER, I CAN'T SWIM!!!! I NEVER LEARNED TO SWIM!!!!\nI SHOULDN'T HAVE TRUSTED YOU!!!! I PUT ALL OF MY TRUST IN YOU!!!!\nAND YOU TOOK ME TO THE WATER..... OH NO!!!!", "image": "https://images.genius.com/1abc5e5fc609da0014a0675d49a1a15f.953x953x1.jpg"}], "artist": "Snoop Dogg"}