{"songs": [{"title": "What You Ride For?", "album": "Kiss Tha Game Goodbye", "year": "2001-08-07", "lyrics": "[Fiend] WHOMP! WHOMP!\n\n[Hook: Fiend]\nWhat you ride for? What you die for? BOUNCE!\nI got some bitches that'll ride for me, die for me (WHOMP!)\nWhat you ride for? What you die for? BOUNCE!\nI got some bitches that'll ride for me, die for me (WHOMP! WHOMP!)\n\n[Fiend]\nCornbread by the ki, the language when you call on a G\nPrices cut (?) when you ballin on me\nSleepy I'll fuck all over your jones, holla at my cousin for zones\nHe don't communicate with Fiend unless you're buildin a home\nHustler kill on his momma, before he short me\nShoot him in his heart then go take it to heart, see gon' mob me(?)\nGhetto red hot, seventeen ward block\nYes I issue more shit for you to cop, then store it by the docks\nHide the fun if you can't afford cops\nSo ain't no tellin where your boy rots\nI employ Rotts that be wildin off the rocks\nSpeak in fives - like gimme what you got\nAnd still pop a nigga ass from the rooftop\nAnd still catch the 'Kiss performance later with The L.O.X\nWe real raw - my dog collar signin with the R and R\nFuck with me you blow up with your car, light a 'gar\n\n[Yung Wun]\nHow come I don't stop in this\nYou wanna ride get in and get gone, gotta get my thug on\nYou wanna war? Okay.. alright.. bring it on\nTouch me, you ashes (boy) I'mma leave you gaseous (uh-huh)\nI'm a ghetto bastard if I want it let me have it (woo!)\nYou play the game raw, I make a fuckin mess (BLAOW!)\nYou play thug in the streets I'm wavin at your chest (nigga)\nYou heard about me boy, you don't want no drama\nI make it hard for you to breathe in the streets\nWalkin next to your baby your baby momma - get your mind right shawty\nWhile you poppin that X, I'mma pop yo' chest\nAnd leave you dead in the party like soakin wet\nThat's what happens when you flex\nIn the A-T-L shawty don't be caught in the hype\nI make two phone calls from a pay phone and there go your life\n\n[Hook] - 2X\n\n[8Ball]\nYeah\nI, lock shit like a, big pimp nigga\nEight mackin with no, fake shit nigga\nCoast to coast tossin hoes with my clique nigga\nStick my clip in, and do a hit for 'Kiss nigga\nDirty money - the only way for this nigga\nHustle after hustle - tryin to be a rich nigga\nIf I get caught up, I'll never be a snitch nigga\nWe pimpin hard charge it all to a bitch nigga\nUnder my denim is a big fo'-fifth nigga\nFuckin with me is like, jumpin off a cliff nigga\nAnd I don't practice I was born with this gift nigga\nPure pimpin from my brain to my lips nigga\nSticky green takes my mind on a trip nigga\nIn A-T-L I get my Gucci down at Phipps nigga\nWe call 'em slabs in New York they call 'em whips nigga\nOne hundred baby - 8Ball gotta dip nigga\n\n[Jadakiss]\nUh, uh, uh-uh-uh\nUh, uh - yo when I'm loadin the clips, niggas I hate, face be on 'em\nThat's why I stopped coppin the guns with safeties on 'em\nWhen I touch down, call me up, I'm on the porch\nWith the mac, servin niggas 8Balls and up\nYou wanna know why niggas is broke, because they hate money\nThe rims that I'm sittin on is in they late twenties\nBitches wanna see me holla at 'em, throw a dollar at 'em and\nIf they hustle throw some hard or some powder at 'em\nThis is for my South niggas\nGold and platinum ice in they mouth niggas\nLET'S RIDE OUT NIGGAZ\nEverybody gon' follow the bitches\nUntil they realize, bullets gon' follow the stitches\nOn the other hand, shit is real low, it's a fact that\nNine out of ten niggas mouths get 'em killed though\nWhat you ride for? What you die for?\nCause I got some niggas and some bitches that's my word that I kill for\n\n[Hook] - 2X", "image": "https://images.genius.com/659c95067dc52688c5cb0888483ceafc.640x640x1.jpg"}], "artist": "Jadakiss"}