{"songs": [{"title": "Blackout", "album": "Flesh of My Flesh, Blood of My Blood", "year": "1998-12-22", "lyrics": "[Intro: Sheek Louch & Jadakiss]\nJay!\nFuck that\nThis is it right here, baby!\nYou know what it is\n\n[Verse 1: Jadakiss]\nYo, I used to have bad luck\nNow you might see me in a Jag truck\nMad stuck, either with a dime or a bad duck\nDouble-R tee with the matching bandanna\n.38-snub, blue steel with no hammer\nAnd I see y'all niggas tryna glance at the 'Kiss\n'Cause I walk around with your whole advance on my wrist\nBoning your women, drunk off Coronas and lemon\nAnd you know I'm still writing the mean, lighting the green\nI need the bucket, even though I look, right in the beam\nJudge find out it's my team, he boost they bails\nNiggas throw us on they album, try to boost they sales\nWe put our pies on the table and our eyes on a label\n'Cause them rednecks up in the mountains'll try to slay you\nThey call me raspy, tell you what I want you to know\nFuck what you ask me, you probably don't want me to blow\nI got a lot of horsepower so I'm able to skip\nUsually a good nigga, even though I'm able to flip\nYou pay 30 for the 'Kiss (Uh-huh) a 100 for The L.O.X. (Yeah)\nAnd if we cool, then I write a hook for a drop\nWhatever's in the bank is my bet, a z-bull's my pet\nAnd you can bet he'll get the legs and the neck\n\n[Verse 2: Sheek Louch]\nUh-huh, yeah, aiyyo\nYo, when my gun bust, send niggas to the fish like Swanson\nNew York's youngest Bumpy Johnson, I put fear in y'all heads\nSheek Louch, type of nigga gasoline y'all beds\nAnd that's warning, if you all alive in the mornin', that's fine\nNow I suggest you hit the block and get what's rightfully mine\nI want PC, see me? Tuck in your chains\nI got niggas my pops' age that lifestyle ain't changed\nIt's like, wake up, move a brick, half of it slow\nMake car money, check with Sheek, go fuck with a ho (ha!)\nI rock a waist length mink, do-rag under my fitted\n(Style on these niggas!)\nAnd I don't even want waves, Timbs be halfway new (Huh?)\nThat's Sheek in the dress-up club cause I don't fuck with shoes\nAnd for my nigga's life, I swear to the Bible, let it be told\nI put thirty in your head, all in the same hole\n'Cause we got the same goal, and you try and tamper with mine?\nDon't make me motherfuckin' leave you with some shit in your spine\nFuck with me, you be a \"was nigga\": \"Nigga WAS dope\"\n\"Nigga WAS gettin money\" 'fore I extorted your coke\n'Ju crazy?\n\n[Verse 3: Styles P]\nAiyyo, catch me with a .38, box and shells\nIn a '98 Lincoln, eating pasta shells\nOrder to go, always got a box of Ls\nBlow, stay on the low, get a Heine and swig\nI'm Pinero, so I hate a snake, rat, or a pig\nI pop shit 'cause I'm the second-best; the first was B.I.G\nY'all niggas is sonned out, let me speak to your father\n'Cause I like to play chess and I swing the revolver\nIf I don't like a nigga, I don't even be bothered\nI spit, I'm just a crooked nigga going legit\nYou hold your nine if you holding a brick, common sense\nFed drama, you hit the Bahamas, get bent\nL.O.X. get respect like Sonny from Bronx Tale\nUs and DMX: the Ruff Ryder cartel\nThirsty to live, or y'all niggas eager to die?\nI tell all my niggas ride, you won't leave with a dime\nMotherfucker!\n\n[Verse 4: Jay-Z]\nYeah, yeah, I'm a monster\nI sleep whole winters; wake up and spit summers\nGhetto nigga, putting up Will Smith numbers (Ugh!)\nSurrounded by Sixes and Hummers, bitches among us\nTrying not to let this bullshit become us\nIt started from hunger, 'til it all went insane\nNow bitches notice the chains now that I hit my number\nThe chickens I twisted (Ugh) see the digits unlisted (Yeah)\nThe beeper done changed\nYou dead, bitch; the Reaper done came\nI suggest niggas stop speakin my name\n'Cause trust me, y'all can still feel the heat in the rain\nI keep creeping, streets keep watching, I keep popping\nNiggas is hotheads and the bullets is heat-seeking\nJay flow for pesos; chase hoes, NOT\nI just circle 'round the block in a drop\nTell 'em jump through the top (Uh-huh)\nWhere the sun roof used to be\nI can see y'all not used to me\nNigga flows like none other (Ugh!)\nI'm the meanest, toughest Don Dada to gun-butt ya\nYou the type that bust a lot of shots and none touch ya (Fuck)\nI'm the type that get excited, when the gun touch ya\nMotherfuckers! Ugh\nY'all niggas bout to witness a dynasty like no other\nUh uh-uh uh-uh\n\n[Verse 5: DMX]\nUh-huh-uh-huh uh, grrrrrrrrrrrrrrrrrr...\nI'm headed nowhere fast (Ugh), runnin' in place, gat in my waist\nNiggas wanted a taste, but wouldn't come to my face (Ugh)\nSo what that mean? You cats is playin' games again\nSo now what I do? Start namin' names again (WHAT!)\nAll you motherfuckers know that I speak from the heart (UH!)\nPlay like you don't know, L.O.X. is gon' bark\nWe can take it there, but to make it fair, get some more niggas\nStyles, Sheek, Jay... We comin' with like four niggas (AIGHT!)\nY'all niggas best to stop playin'\nIt'll be the ones you forgotten about\nThat'll get you shot in your mouth\nARF! ARF! Got my dogs covered (UH!)\nPlus it's all gravy, like chicken when it's smothered (WHAT!)\nIt's Dark, and I LOVE IT! (UH!)\nGet him, boy, let him loose (C'MON!)\nYou want it with the dog or the gun? Let him choose (C'MON!)", "image": "https://images.genius.com/236ac8cb125196c489579b947c3b2fb8.945x945x1.jpg"}], "artist": "DMX"}