{"songs": [{"title": "Campaign Speech", "album": null, "year": "2016-10-19", "lyrics": "Jumped out of the 2nd floor of a record store\nWith a Treacherous Four cassette and a cassette recorder\nIn Ecuador with Edward Norton\nWitness the metamorphosis\nOf a legend growin' like an expert swordsman\nFrom the Hessian war and\nHence the origin of the Headless Horseman\nBorn with the endorphins of a pathetic orphan\nEndless source and reservoir\nOf extension cords in dresser drawers\nAnd deadbolts on the bedroom doors\nAnd sexual torture kits kept in a separate storage bin\nExcellent boyfriend\n\nUse intercourse to settle scores\nWith women who have vendettas towards men\nDickhead is forced in 'til there's shredded foreskin\nReddish torn and they're only bein' fed a portion\nBed sores and sore shins\nPregnant whores can get abortions\nFetish for stickin' metal forks in, self-absorption\nSkeletor, I went to Hell and fell a floor\nA predator, I'm headed for competitors\nBetter warn 'em, what I lack in tact and a set of morals\nI make up for in metaphors like a cosmetic store\nStegosaurus, Chuck Norris with a thesaurus\nYes, of course, a mess of warrants\nYou want some? Come and get some, boys!\nI'm givin' Daniel Pantaleo a refresher course\nOn excessive force and pressure points\nAnd dressin' George Zimmerman in a fluorescent orange\nDress and four inch heels to address the court\nWith a bullseye on his back, his whole chest and torso\nAre left on the doorsteps of Trayvon's dad as a present for him\n\nIn my present form I'm Desert Storm\nAppetite for destruction there's no suppressant for\nAggressive, forceful, and less remorseful in every morsel\nUnpleasant, horrible; hello, gorgeous!\nThe rebel with devil horns just fell off the yellow short bus\nMet a contortionist, said, \"When you wanna get sexual?\"\nShe said, \"However I fit in your schedule. I'm flexible.\"\nExpired tags on the Saturn, got Catherine Bach\nIn the back in Daisy Dukes with the hazards on\nAt a traffic stop gettin' harassed, sign an autograph\nFor this asshole cop's daughter\nLaugh 'cause I called her a brat on it\nHe spat on it and brought it back lookin' half in shock\nHad a heart attack and dropped dead\nStarted fallin' back with it\nAnd got slapped with a Colin Kaepernick practice sock\n\nOne ball and half a dick, Apple Watch\nCrack front axle, walked in a Bass Pro Shop with David Hasselhoff, pulled Tabasco sauce out of my satchel\nKnocked over a fisherman's tackle box and *crash sound*\nAsked if they had a laugh in stock\nThat was fuckin' stupid…\n\nYou got it twisted, all 'cause I offered this bitch\nA doggie biscuit, you call me misogynistic\nBitch, get to massagin' this dick!\nLike spas in this bitch, slob on it with gobs of lipstick\nGot a shoppin' list for you to run some odds and ends with\nIt's not a bitch on this earth I can be monogamous with\nShe's non-existent\nRobin Thicke with a throbbin' dick on some suave and slick shit\nBut I shout derogatives at bitches like fuckin' missile launches\nMisfit, blond and nitwit\nLike I've gone ballistic, with a frostin' tip kit\nScreamed, \"I hate blondes,\" and became one, I'm optimistic\nLove to start shit\nShovin' Clark Kent's undergarments in the glove compartment\nOf the bucket, bumpin' Bubba Sparxxx\nI'm double parkin' up at Targets, trouble causer, a double crosser\nShadiest mothafucka you'll ever come across\nOlympic gymnast, been known for some assaults\nA couple lawsuits, enough to cause a stomach ulcer\nSame damn brain scan results as Rainman's is\nSomething's off, but when Dustin Hoffman's\nDressin' up in your mummy costume\nOn stage dancin' to \"Brain Damage,\" what's the problem?\nNothing's wrong, the name brand is back to reclaim status\nRun the faucet, I'ma dunk\nA bunch of Trump supporters underwater\nSnuck up on 'em in Ray-Bans in a gray van with a spray tan\nIt's a wrap, like an ACE bandage\nDon't-give-a-fuck persona, to my last DNA strand\nE&J in the waistband, at the VMAs with the stagehand\nShe wants kielbasa, pre-arrange an escape plan\nThree-inch blade on point, like a See-and-Say\nConsider me a dangerous man\nBut you should be afraid of this dang candidate\nYou say Trump don't kiss ass like a puppet\n'Cause he runs his campaign with his own cash for the fundin'\nAnd that's what you wanted\nA fuckin' loose cannon who's blunt with his hand on the button\nWho doesn't have to answer to no one—great idea!\n\nIf I was president, gettin' off is\nThe first order of business, once I get in office\nSecond thing that'll make me happy's walkin' up to Uncle Sam\nNaked, laughin', dick cupped in hand\nScreamin', \"Fuck safe sex!\"\nThrow a latex and an AIDS test at him\nTell Congress I run this land\nAnd I want the rubber banned, and make it snappy\nAddiction to friction and static\nAddict who can't escape the habit\nContinue to chase the dragon\nBut as fate would have it, I walked up in Major Magics\nDressed as the maintenance man\nIn a laser tag vest and a racin' jacket\nWith a gauge to blast it\nAnd sped away in the station wagon\nStacey Dash's and Casey Anthony's\nCrazy asses in the backseat\nThrowin' Stayfree pads at me\nDead passenger in the passenger seat\nUnfasten the safety latches\nAnd slam on the brakes in traffic so hard\nI snapped the relocation brackets for the monster tires\n'Finna get a murder case and catch it\nLike you threw it at me encased in plastic\n\nAnd send Dylann Roof through the windshield of the Benz\nUntil he spins like a pinwheel and begins feelin'...\nLike a windmiller with a thin build while his skin's peelin'\nAnd skids 'til he hits a cement pillar\nSwing for the fence like Prince Fielder\nKnock it into the upper peninsula\nYou wanna go against 'zilla? The Rap God\nWhen will I quit? Never been realer\nThe in-stiller of fear, not even a scintilla of doubt\nWhose pens iller than Prince in a chinchilla\nOr Ben Stiller in a suspense thriller\nRevenge killer, avenge syllable binge\nFill a syringe, 'til I\nDraw first blood\nEven pop shit on my pop shit, and it's popular\nCouldn't be more awkwarder\nCause you're innocence I robbed you of\nIt's my fingers that got stuck up\nTaught ya ta, not give a\nSlapstick, hockey puck\nThe broad hunter with the sawed off\nLike an arm when it's lopped off of ya\nBut I'm not gonna, get the shotgun\nOr the Glock, I'm gonna opt for the ox\nCause I'm into objects that are sharp when I shop\nAnd it's not a shock, I'm such an obnoxious fucker\nThe Rock Hudson of rock 'cause who would have thought\nThis much of a cocksucker to go across the buttocks of Vivica Fox with a box cutter\nThat was for 50, little slap on the wrist be warned\nI'm unravelin' quickly\nMy squabbles, I'm grappling with your time traveling with me\nTry and follow, as I wobble, relapse into history, with a flask of the whiskey\nTip it back then I'm twisting wine bottles\nLike what happened to Chris Reeve's spine column\nThat's the plan of attack when I'm fixing my problems\nWish my chest wasn't having to get these rhymes off 'em\nBut the fact that I have so many rappers against me mind boggles\nAnd why I haven't come back on these faggots who diss me is\nMore of a spectacular mystery than a fucking Agatha Christie crime novel\n\nBut my patience is wearing thin\nSwear I been contemplatin' rubbing shit in your face 'til I smear it in\nDiss you in every lyric until you fear the pen\nAnd never appear again\nIf you actually had fuckin' careers to end\nBut then I think of Molly Qerim and I steer 'em in that direction and forget my ideas for them\nMolly, I'm gone off you\nMan, light some kush\nYou're my first take, I'll nail you\nCan't lie, I gush\nIf I won you over, you would be the grand prize\nI'm entranced by your looks, come and give the Shady franchise a push\nYou can get it in the can like some Anheuser Busch\nJeans too small, least three pant sizes tush\nMushed against your damn side, your puss\nAnd thighs are squished\nWhat kind of attire's that?\nI'm ready to be rode\nPsychopath, bet you we'll get it poppin' like a flat\nLight the match to ignite the wrath\nGot knives to slash and slice hermaphrodites in half\nPiper Chapmans might just have to picket me\nLike a scab\nHard to describe in fact\nStartling violent perhaps\nAre things that come to mind as soon as I start spitting rhymes like that\nAnd you aren't really surprised at that\nBut as far as these lines I rap\nAnd these bars, wouldn't dial it back if I star 69ed the track\n\nWhy am I such a dick?", "image": "https://images.genius.com/fca2a60dbc9ab36b62daa809a7405eb3.640x640x1.jpg"}], "artist": "Eminem"}