{"songs": [{"title": "I Need More", "album": "508-507-2209", "year": "2017-06-16", "lyrics": "[Pre-Chorus]\nI need more hoes, more, more, more, more, yeah\nI need more clothes, more, more, more, more, yeah\nI need more dough, yup, yup, yup, yup, yeah\nI need more blow, wha, wha, wha, whoo, whoo\n\n[Chorus]\nI need more hoes, wha, wha, wha, wha, yeah\nI need more clothes, yup, yup, yup, yup, yeah\nI need more dough, wha, wha, wha, wha, yeah\nI need more blow, uh, uh, uh, uh, yeah\nI need more hoes, wha, wha, wha, wha, yeah\nI need more clothes, yup, yup, yup, yup, yeah\nI need more dough, wha, wha, wha, wha, yeah\nI need more blow, uh, uh, uh, uh, yeah\n\n[Verse 1]\nYou got some scary intentions\nYour brain is clouded with too many possessions\nYou think you rich but you depressing yourself\nIt's just so pathetic and materialistic\nAnd all you do is flash your money and fortune\nYou ride around in that Ferrari and Porsches\nAnd all you talk about is Bugatti and foreigns\nYou walk around like you somebody important\nYou surrounded by leaches and beggars\nAnd none of them niggas wanna see you do better\nI bet they plotting, wanna see what you got\nCause you brag a lot and make it seem like they jealous\nSo what the fuck you even see in the mirror?\nYour future couldn't really be any clearer\nAnd when it rains, you gon' need an umbrella\nBut you don't listen, you don't see it or hear it\nAnd all you ever say is...\n\n[Pre-Chorus]\nI need more hoes, more, more, more, more, yeah\nI need more clothes, more, more, more, more, yeah\nI need more dough, yup, yup, yup, yup, yeah\nI need more blow, wha, wha, wha, whoo, whoo\n\n[Chorus]\nI need more hoes, wha, wha, wha, wha, yeah\nI need more clothes, yup, yup, yup, yup, yeah\nI need more dough, wha, wha, wha, wha, yeah\nI need more blow, uh, uh, uh, uh, yeah\n\n[Verse 2]\nI think you really aggressive\nYour brain is clouded with too many possessions\nYou think you rich but you depressing yourself\nIt's just so pathetic and materialistic\nI really think that all them drugs got you tripping\nYour brain is ruined and your logic is different\nI know that syrup got your body in shivers\nIf I was you, I'd get that out of my system\nAnd I think that you bugging and stuff\nYou just shit on everyone who's stuck in a rut\nAlways flash your money out in public and stunt\nAnd we all just look at you in fucking disgust\nMaybe you're just insecure with no luck\nAnd deep down you're a dub without nothing to love\nAnd I wonder if you'll ever realize what's up\nAnd be humble and just say enough is enough\nBut for now you just wanna say\n\n[Pre-Chorus]\nI need more hoes, more, more, more, more, yeah\nI need more clothes, more, more, more, more, yeah\nI need more dough, yup, yup, yup, yup, yeah\nI need more blow, wha, wha, wha, whoo, whoo\n\n[Chorus]\nI need more hoes, wha, wha, wha, wha, yeah\nI need more clothes, yup, yup, yup, yup, yeah\nI need more dough, wha, wha, wha, wha, yeah\nI need more blow, uh, uh, uh, uh, yeah\nI need more hoes, wha, wha, wha, wha, yeah\nI need more clothes, yup, yup, yup, yup, yeah\nI need more dough, wha, wha, wha, wha, yeah\nI need more blow, uh, uh, uh, uh, yeah\n\n[Verse 3]\nYeah, I must be really possessive\nMy brain is clouded with too many possessions\nI think I'm rich but I'm depressed and I'm selfish\nI'm so pathetic and materialistic\nLike how the fuck I let the money do this\nMan I swear to God that I would never be tripping\nI promised that I would have respect and be different\nBut now I make it rain on plenty of strippers\nI'm surrounded by leeches and beggars\nAnd none them niggas wanna see me do better\nI bet they plottin', want to take what I got\nCause I brag a lot and make it seem like they jealous\nAnd I never had nothing\nI just wanna live like them rappers on TV forever\nBut what have I become? Maybe I'm one of them\nMaybe I just don't know any better\nAnd now what I'm sayin' is\n\n[Pre-Chorus]\nI need more hoes, more, more, more, more, yeah\nI need more clothes, more, more, more, more, yeah\nI need more dough, yup, yup, yup, yup, yeah\nI need more blow, wha, wha, wha\n\n[Voicemail]\nYo what's up? This is Joyner\nI'm unable to take your call right now\nLeave me a brief message and I'll get back to you, peace\n\n[Brief Message]\nHello, yo, nigga you fuckin' serious?\nAre you fuckin' serious? Yo, I swear to God\nYo, I knew I should have never fuck with you\nYou're fucking dirty, you're dirty and you're fuckin', yo\nYou're gonna be dead nigga, yo are you serious?\nYou gave me fuckin' Chlamydia? Chlamydia?!\nYo, nigga, I swear to God, wait 'til my brother comes home\nYo, Dom is gon' fuck yo shit up", "image": "https://images.genius.com/895cf32a9779b29f3e18b6c7cb55b3e2.500x500x1.jpg"}], "artist": "Joyner Lucas"}