{"songs": [{"title": "Who You Wit II", "album": "In My Lifetime, Vol. 1", "year": "1997-11-04", "lyrics": "[Intro]\nUh-huh, yeah hah\nNever sprung huh?\nJigga, Roc-A-Fella y'all\nNever sprung huh?\nYeah, peep the repertoire\nPa-Pause, feel me on this one\nPa-Pause, feel this\nNever sprung huh? Know my style\n\n[Verse 1]\nI love bitches, thug bitches, shy bitches\nRough bitches, don't matter you my bitches\nGold diggers witcha eyes on my riches\nCan't knock your hustle for real, it's a'ight bitches\nI'm game tight, see it all through the platinum french frames\nWith the french name in the same night\nPull you and your tight friend\nLift your little dress like light wind, hah, then I slide right in\nYou know the whole repertoire, U.S. to the U-S-S-R\nSexin' in a Lexus car\nMatch wits with the best of y'all, the rest of y'all\nIs like vege-tables in my presence, check it\nReminiscin' to nothin' you ever heard\nIceberg Slim baby, ride rims through the suburbs\nFunds come in lump sums never ends deferred\nGet money like I'm down South, Wednesday the third, it's on\n\n[Chorus]\nMore, dough to get, more shows to rip\nI suggest you all roll with the clique, who you wit\nFrozen wrists and it's flows that's sick\nMore O's than you know exist, bitch who you wit\n\n[Verse 2]\nCan't scheme on 'em, Roc-A-Fella got a team on 'em\nChicks dream on him, trick cream on 'em\nLose it when dudes think it's just music\nLean on 'em, flash green on 'em and diamond rings on 'em\nSexin' around the way girls down to miras\nI'm something every girl gotta have like Levi's\nChiquita, mi amor, see how raw\nYou can love me or hate me, either or\nI'ma stay winnin', rock the custom drop Bentleys\nNever eat at Denny's and party like Lil' Pennys\nCan he live? Trick or main chick but if she leave\nJust as quick, Indian give, ha-hah\nNow what I look like? Givin' a chick half my trap\nLike she wrote half my raps, yeah, I'm havin' that\nYou be the same chick when you leave me\nThe bankbook and the credit cards\nAnd take everything you came with (it's on)\n\n[Chorus]\nMore, dough to get, more shows to rip\nI suggest you all roll with the clique, who you wit?\nFrozen wrists and it's flows that's sick\nMore O's than you know exist, bitch who you wit?\n\n[Verse 3]\nYeah, here's somethin' niggas gon' find, not at all funny\nWe takin' all ya bitches, takin' all ya money\nJay-Z rated A.G. baby that's All Good\nI sink this ball in your hole, I'm Tiger Woods\nIf the money was the grass and your ass was a tee\nWhen I hit it with this club love you comin' with me\nGrip you right up under your ass, put your back on the wall\nKinda tipsy, seein' triple, so I'm fuckin' y'all\nYou remind me of this dream I had the night before\nI'm kinda hopin' the condom break to have a reason to go raw\nI'm playin', hit the showers, hit the money spot\nWhere all the models play and big money is dropped\nDrop the top, let her feel the moonlight it entranced her\nShe jumped all in my seat like some private dancer\nI tell you somethin' new, if you don't hop down off that\nButter soft shit with your shoes, I'ma step on the gas\nShe laughed, put her ass back in the proper place\nShe said, 'I played my cards right and look, I got the ace'\nI told her *beatboxes*, 'slow down baby'\nYou dealin' with a baller, who, hold ground crazy, it's on\n\n[Chorus]\nMore, dough to get, more shows to rip\nI suggest you all roll with the clique, who you wit?\nFrozen wrists and it's flows that's sick\nMore O's than you know exist, bitch who you wit?\nMore, dough to get, more shows to rip\nI suggest you all roll with the clique, who you wit?\nFrozen wrists and it's flows that's sick\nMore O's than you know exist, bitch who you wit?\nMore, dough to get, more shows to rip\nI suggest you all roll with the clique, who you wit?\nFrozen wrists and it's flows that's sick\nMore O's than you know exist, bitch who you wit?\nMore, dough to get, more shows to rip\nI suggest you all roll with the clique, who you wit?\nFrozen wrists and it's flows that's sick\nMore O's than you know exist, bitch who you wit?\n\n[Outro]\nBeyatch! Fucka\nJigga, '9-7 shit, next millennium\nRecognize, realize, it's on\nRoc-A-Blok y'all\nHuh, haha, I'm laughing\nIt's on\n\n[Answering Machine]\n\"Hi Jay-Z this is (beep). I just wanted to call and apologize\nFor the things I was sayin to you. Y'know, that was kind of, y'know\nRidiculous the things I was sayin and I just wanna thank you for\nGiving \"Ta-Ta\" the message for me. We could still be cool\nIt was nice meeting you. Bye.\"", "image": "https://images.genius.com/5d943fdf8e012d844a1b587b79e29b3d.1000x1000x1.jpg"}], "artist": "JAY-Z"}