{"songs": [{"title": "The Kids (Unreleased Demo)", "album": null, "year": null, "lyrics": "[Verse 1]\nHey there, little boys and girls\nHey there, little boys and girls (Mmkay?)\nToday we're gonna to learn how to poison squirrels\nBut first, I'd like you to meet my friend Bob\n(Huh?) Say hi Bob! (\"Hi, Bob!\")\nBob's 30 and still lives with his mom\nAnd he don't got a job\n'Cause Bob sits at home and smokes pot\nBut his twelve-year-old brother looks up to him an awful lot\nAnd Bob likes to hang out at the local waffle spot\nAnd wait in the parking lot for waitresses off the clock\nWhen it's late and the lot gets dark\nAnd fake like he walks his dog, drag 'em in the woods\nAnd go straight to the chopping blocks\nAnd even if they escaped and they got the cops\nThe ladies would all be so afraid, they would drop the charge\n'Til one night Mrs. Stacey went off the job\nWhen she felt someone grab her whole face\nAnd said not to talk\nBut Stacey knew it was Bob and said: \"Knock it off!\"\nBut Bob wouldn't knock it off\n'Cause he's crazy and off his rocker\nCrazier than Slim Shady is off the vodka\nYou couldn't even take him to Dre's to get Bob a doctor\nHe grabbed Stace' by the legs as chopped it off her\n(AAH!) And dropped her off in the lake for the cops to find her\nBut ever since the day Stacey went off to wander\nThey never found her, and Bob still hangs at the waffle diner\nAnd that's the story of Bob and his marijuana\nAnd what it might do to you\nSo see if the squirrels want any—it's bad for you\n\n[Hook]\nThe kids, the kids!\nDon't forget about the kids, the kids!\nShady, what about the kids, the kids?\n(?) The kids, the kids!\nShady, what about the kids, the kids?\nYou gotta save the kids!\n\n[Verse 2]\nMy penis is the size of a peanut, have you seen it?\nFuck no, you ain't seen it, it's the size of a peanut (Hehehehe!)\nSpeakin' of peanuts, you know what else is bad for squirrels?\nEcstasy, it's the worst drug in the world\nIf someone ever offers it to you, don't do it\nKids, two hits'll probably drain all your spinal fluid\nAnd spinal fluid is final, you won't get it back\nSo don't get attached, it'll attack every bone in your back\nMeet Zach, twenty-one years old\nAfter hangin' out with some friends\nAt a frat party, he gets bold\nAnd decides to try five, when he's bribed by five guys (C'mon!)\nAnd the peer pressure will win every time you try to fight it\nSuddenly, he starts to convulse\nAnd his pulse goes into hyperdrive\nAnd his eyes roll back in his skull {​​​*blblblblblb*}​​​\nHis back starts to look like the McDonald's Arches\nHe's on Donald's carpet, layin horizontal, barfin' {​​​*BLEH*}​​​\nAnd everyone in the apartment starts laughin' at him\n\"H- hey Adam, Zach is a jackass, look at him!\"\n'Cause they took it too, so they think it's funny\nSo they're laughing at basically nothing\nExcept maybe wasting the money\nMeanwhile, Zach's in a coma, the action is over\nAnd his back and his shoulders\nHunched up like he's practicin' yoga (*gasp*)\nAnd that's the story of Zach, the ecstasy maniac\nSo don't even feed that to squirrels, class\n'Cause it's bad for you\n\n[Hook: Teacher]\nThe kids, the kids!\nShady, what about the kids-\nDon't forget about the kids, the kids!\n\n[Verse 3]\nAnd last but not least, one of the most humungous\nProblems among young people today is fungus\nIt grows from cow manure\nThey pick it out, wipe it off, bag it up\nAnd you put it- put it- put it- put it- put it-", "image": "https://images.genius.com/b379811c1415017b9f3e3a71b9d26060.400x400x1.jpg"}], "artist": "Eminem"}