{"songs": [{"title": "T.D.M.T.L.T.A.", "album": null, "year": "2015-12-16", "lyrics": "[Verse 1]\nUh, they say the clock's tickin'\nMines is under my bed, yeah, that's where I keep it\nI'm just layin' next to some edible vagina\nI'm tryin' to show this bitch that I get better over time\nI hope you know a gentleman issue dependin' on his mood\nHe'll throw a few scraps to his ratchet fam\nThen get in a suit, hat and go clap at you\nWhile you at your dinner, oh, that's classic, man\nI'm givin' passes in exchange for weight\nAnd by \"passes\", I mean gastric, fam\nBy \"pass\", I mean I'll pass cause these niggas groupies, tran\nThey givin' roofies to fans\nI'd rather invite over Karrueche Tran\nAnswer the door wit' some Lil' Boosie playin'\nWe ain't really hearin' you niggas sittin' on dubs\nI got my ear to your car window\nI still don't understand what do you be sayin'\nCould you please move that lil' piece of shit out the way\nSo I could take the piss?\nBy the way, what are y'all competin' for?\nIf I could just be honest, my wifey fuckin' gorgeous\nAnd if I ain't fuckin' Rihanna, then what the fuck I'm cheatin' for?\nIf this movie I'm living's for your viewin' pleasure\nThen I can't really be no whore\nCause they don't make 'em like me no more\n\n[Chorus]\nThey don't make 'em like me no more\nYeah, that's opportunity knockin'\nI'm standin' where it might be your door\nTo say to you that they don't make 'em like me no more\n\n[Verse 2]\nMay God bless anyone against this conquest\nY'all hire muscle like I'm pressed\nLike I ain't out here walkin' 'round like I'm a one-man arm press\nI'm just in the zone\nI said, \"Less talk\", not \"Let's talk\", let's just get it on\nWho the best out right now? Just get 'em on the phone\nTell him I don't want much\nI just want to tell him that I plan to come and kill him\nI'm a probably talk to him soft like Liam Neeson\nLike I'm bein' decent\nI'm PRhyme, I'm Slaughterhouse, I'm BME\nI'm sort of like 'Pac in the vest, I got no fear in me\nCause I done been to hell and back so many times\nThat I think I'd seen the smile on the face of the reaper\nSo don't waste your time prayin' to your creator\nToo late, he can't make ya like me, bruh\n\n[Chorus]\nNah, they don't make 'em like this no more\nThat's opportunity knockin'\nI'm standin' there like this your door\nTo say to them that they don't make 'em like this no more\n\n[Verse 3]\nThis ain't the standard ops you niggas done ran across\nI'll send my little man across the street\nHe'll stop squeezin' 'til somethin' pops into your head\nLike a random thought, I don't care for drama\nI'd rather terrorize you, chase you 'round your city\nLike you Sarah Connor and I'm the Terminator\nI'm wearin' Ferragamo the same time that the devil's wearin' Prada\nWhy would you and I compare albums?\nI got your life in the palm of my hands\nLayin' it down is all I'm thinkin' 'bout\nAnd newsflash, niggas is frauds, it's all an act\nWhen he tough wit' the talk\nHe don't go out in traffic, he know I'll slap him\nHe know I'll snatch him out of that box he lives in he calls Abby\nYou know I'll stuff him back in that box\nThat I put niggas in called casket\nIt ain't nothin' to squash, don't call my line wit' that wack shit\nYou want to get to the bottom of that? Call catfish\nNow let me get back to what I was doin'\nThis hundred-round drum turns around time in mixed months\nSame Valentine's day massacre, March Madness\nWrapped in a big blunt, let's smoke the niggas who really live it\nWho know what beef really is and don't speak if it really isn't\nGot niggas doin' life in the prison on the iPhone and the corrlinks\nAnd I live in the no-fly zone\nAnd more digits is all that I got my eyes on\nI see you clowns through the eyes of the Lord\nI'm lookin' down knowin' I'll be around for your rise and your fall\nYou rhyme, what's more mind-blowin' than a 9 to your jaw?\nEven a weak flow could be nice\nI'm takin' penitentiary chances\nWe roll the dice like the Migos in Vice\nYou want these hoes and likes\nMe? I'm the one there'll be no one like", "image": "https://images.rapgenius.com/eefd9f831b681a8540aa8c915adbfc10.1000x1000x1.jpg"}], "artist": "Royce da 5'9'’"}