{"songs": [{"title": "Tooken Back", "album": "The Pretty Toney Album", "year": "2004-04-20", "lyrics": "\"Take me back, take me back, take me back...\"\n\n[Ghostface Killah]\nYo, yo, yo, aiyo you brought me on Jerry just to take you back\nAfter that bullshit you put me through a couple months back\nThat wasn't right, call the cops on me, and told them I had it like\n\"Yeah, pop the trunk, he got dope and guns\"\nCheck for warrants, that son of a bitch on the run, I know\nThree of his niggas got life, he use to roll with\nAnd told 'em I bodied an upcoming basketball star\nOnce I heard that, I fell out the cop car, real hard\nYou bugged out, and thugged out, wanted me to take you back\nThat could never happen, I'm sorry\nNo disrespect, but you a psycho, honey\nGot that S.S.I. money, and you start actin' funny\nShrimp's every night, ordering steaks\nThem jumbo joints, them shits cost a buck 50 for eight\nAnd when you told me your Merlot, need more grapes\nI said \"Honey, you never had wine before!\"\nAnd if you did, that's not how you act at all\nAnd no... that's not how we rock in Theodore\n\n[Hook: Ghostface Killah (Jacki-O)]\nPlease, babe, I love you\n(Take me back, I'll never do it again)\nAlways want you\n(You know that you my lover and my best friend)\nYes, darling, it's true\n(Come on, home, where you belong, let's get it on)\nPlease, babe, I want you....\n\n[Jacki-O]\nBack to them days, when the yay' was bein' frontin' to you\nHundred thousand dollar shopping sprees wasn't nothin' to you\nWhen three was a crowd... but I dealt with it\nAnd your sex wasn't wild.... but I dealt with it\nI always felt shitted, you should of take me back\nThe girl that introduced you to boy, and helped you open your stacks\nI got you in South connects, for the hard grind\nThat's why I took mine off the top, for the hard time\nYou know you need me in the streets, to help you run things\nAnd if you catch a case, you got it wrong, I'mma pawn rings\nI'm your lady boo, that's what I'm suppose to do\nI know when you was coppin' my Coupe, that you was coppin' two\nI know when you got me the red one, that she got the blue\nBut the way I chew on you, you should of got me two\nNow you got me in the kitchen, with your fryin' on\nTell me that you gon' move with me, I know you lyin', dog\nWho loves you baby? Nobody like Jacki-O\nCook, clean, break up your weed, and I give you nasty throat\nWhat you actin' for? Get back in the door\nCome on, home, where you belong, let's get it on\n\n[Hook]\n\n[Ghostface Killah]\nYo, you know I always love you, I never meant to hurt you\nEven the stress'll work you, I miss your old perfume\nPromise never curse you, I want you in my circle\nHoney right by my side where I keep my herbals\nWe both agree on no more fighting, we'll just have a verbal\nThe man'll treat you like a queen, I will bird you\nMother and father birthed you, if I have to hit you\nThen damn, I might as well leave, cuz I don't deserve you\nWatch from you face, when you sleep, let the heat disturb you\nFiendin' from the magic wand, when she 'nique and serve you\nTake me please, take me with ease\nTake me back, God damn, and scrape marks on my knees\n'Member the first time you made my key\nYou was drunk, you went behind a tree and pee'd\nI miss shit like that, and all of the times\nWe played cops, I'll arrest you in bed\nPolice brutality, I'll leave the side of your ass red\nGod damn it, is sex for real girl? Girl, we in special ed\nUh-huh... fuck that, take me back, pretty please, with you on top\n\n[Hook]\n\n[Outro: Ghostface Killah]\nYeah, yo this goes for everybody all across the world\nWhether you got fired or your lover dropped you and all that\nYouknowhatimsayin? Everybody wanna get tooken back\nYouknowhatimean? Don't be afraid to ask, if you wanna see--\nYo, take me back, fuck it, everybody wanna get tooken back and shit\nThis is your man, Big Ghost, your host, signing off and shit\nTheodore, I understand", "image": "https://images.genius.com/1563d407e670f05603a84947a6af2c41.1000x1000x1.jpg"}], "artist": "Ghostface Killah"}