{"songs": [{"title": "The Apple", "album": "Straight from the Lab Part 2", "year": "2011-12-18", "lyrics": "[Intro]\nI'm a little nutty and I know it but if you go back and take a look at my history\nYou will see that I am not the only one who's off his rocker, there were many before me\nI was always labeled the black sheep of the family, what a bad seed I'd grow to be\nBut if you take a look at us now you'll see the apple didn't fall too far from the tree\n\n[Interlude]\nAlright look, I'mma tell you the story from my side\nMaybe you'll understand, check it out\n\n[Verse 1]\nYou done witnessed unexplainable shit\nToo insane to explain, people run from what they just don't get\nMaybe Shady should have just hit 'em with a little bit\nDid I spit too soon? Should I have spoon fed 'em it?\nBut I was just so eager to prove I was even\nWorth bein' in the same league or the room\nOf the people of whom I was in\nEvery now and then, I look up like I was seekin' approval\nWas it because of the pigment of my skin?\nOr was it a figment of my imagination?\nMaybe it bothered me more than it did them\nMaybe it wasn't a big deal back then\nBut to me it was, see what it was\nWas I had developed a complex from being judged\nProof spit his verse, now I'm next, let's see who balks\nI'm in the booth staring back to see whose mugs\nI get a reaction from, usually the first thumb\nWas from Proof and the rest of the crew backed him up\nAnd no one lied to each other 'cause none of us had deals\nIt was real, we just wanted tickets for that meal\n\n[Chorus]\nSometimes I feel like it's just me\nSometimes I feel like I'm goin' crazy\nBut take a look at my family\n'Cause the apple don't fall too far from the tree\nI said sometimes I feel like it's just me\nSometimes I feel like I'm goin' crazy\nBut take a look at my family\n'Cause the apple don't fall too far from the tree\n\n[Verse 2]\nEver since my mother was pregnant with a second egg\n'Cause she said that I had a baby sister\nWho fell outta the window, I was too young to remember\nKansas City projects, I was like 5-6\nAnd how come, I remember Malcolm, Isaac, and Boogy\nIf it was the projects in Missouri?\n'Cause those were my best friends until Isaac\nTook my tricycle and my Uncle Todd went to try to go get it back\nAnd ended up gettin' jumped and cut in the gut\nWith a switch and 70 some stitches\nWhich is, to this day, why my mother still tries to show me\nSome old fake pictures\nOf a fictitious little sister who never existed\nAnd this is why part of my life's so twisted\nBut I can never be as sick as that bitch is\nAnd by the way, that pictures one of my relatives\n\n[Chorus]\nSometimes I feel like it's just me\nSometimes I feel like I'm goin' crazy\nBut take a look at my family\n'Cause the apple don't fall too far from the tree\nI said sometimes I feel like it's just me\nSometimes I feel like I'm goin' crazy\nBut take a look at my family\n'Cause the apple don't fall too far from the tree\n\n[Verse 3]\nYou probably have to peel back layers upon layers of pain\nTo see why everything I say is so insane\nWhat's different about my brain\nThat separates me from other players in this game?\nOn the surface it may seem like a scheme\nOr some sort of scam for me to get some damn sympathy\nBut that's the last thing I need\nIs for people to walk around feelin' sorry for me\nAnd I am not a G, never claimed to be\nI gave my vest to Cashis, just hope he don't need it more than me\nBut we'll see, 'cause we ain't lookin' for beef\nBut if it comes our way, what do we turn the other cheek? Come on\n\n[Chorus]\nSometimes I feel like it's just me\nSometimes I feel like I'm goin' crazy\nBut take a look at my family\n'Cause the apple don't fall too far from the tree\nI said sometimes I feel like it's just me\nSometimes I feel like I'm goin' crazy\nBut take a look at my family\n'Cause the apple don't fall too far from the tree\n\n[Outro]\nYeah, and I'm the crazy one right?\nWhatever, then let me be the crazy one!\nCuckoo, cuckoo, tweet", "image": "https://images.genius.com/92a4caddb38548f811a9d5b5599e4304.1000x1000x1.png"}], "artist": "Eminem"}