{"songs": [{"title": "Kansas City", "album": "The Storm", "year": "2016-12-09", "lyrics": "[Intro: Tech N9ne]\nPeople jeffin' my checks be nice sums\nBy the way the way that I talk you can guess where I'm from\n\n[Hook:]\nKansas City! Kansas City!\nKansas City, Kansas City, Kansas City\n\n[Verse 1: Tech N9ne]\nHell yeah, I was born in Wayne Miner, projects\nMost people carry them waistliner, objects\n904 Michigan Imma grow kickin' them rhymes and flow quick 'n in time that's what made N9ner progess\nThis is history Young Rich and Dun-deala team up with Mr. T\nEven though none of our names are listed, we grew up with\nOllie, Ollie, Ollie, Ollie Gates and I got all my jolly and gaudiness from Maudie Yates\nCity staple like \"Go Chicken Go\" get dough, the most dickin' flow\nWhen I'm rollin' all around the globe I be fo' sure missin' MO'\nIn my city man I really love the fitties though they gritty\nHow bad is talkin' down like we itty-bitty, pretty\nYou better be, wrapped up when the weather freeze\nThreat in the dead of summer, super sweat on your head degrees let it free\nThat is me on the home I put cheddar cheese\nTech'll be reppin' definitely I betcha I never leave...\n\n[Hook:]\nKansas City! (Born) Kansas City! (Love)\nKansas City, Kansas City, Kansas City (Hell yeah)\n\n[Verse 2: The Popper]\nWe bring the energy, the electricity to volts\nWe the Kansas City hearbeat, we Kansas City pulse\nThis past post day, Jordan got us crispy\nTruce was a slave owner Google up that history\nKansas Citian's out of town, root hearted\nIn Dallas at Wizards in Atlanta at U-Bar\nIn my blue car, rollin' with that merch on me\nI'm K.C. till I'm 6 in the dirt homie\nKansas City it'll make you or break you\nShortcut through the hood 7-1 straight through\nStay true to the turf rep it like Shane Ray\nTatted on his back with the towel in his game day\nStrange laid the foundation landmark major factor\nName's raised sky high now they raise the rafters (Raise the rafters)\nA victory for our hometown if they didn't know me (Who's The Popper?)\nNow they know me\n\n[Hook:]\nKansas City! Kansas City!\nKansas City, Kansas City, Kansas City\n\n[Verse 3: Rich The Factor]\nK.C.'s the town, home of the go-getters\nI've been stackin' for years we gettin' more skrilla\nChiefs on Sunday, we tailgate and root for em\nI'm like a young Andy Reid that's how I move on em\nCoastin' through town, stayin' mostly through the town\nPush a foreign through the turf I be floatin' through the town\nYeah, when a deal go down I'm probably in on it\nWe like the Royals we hustle until we win\nWe need some goggles all these champagne bottles poppin'\nCampaignin' with Tech N9ne and the homie Popper\nK.C. brims and shirts you know we stay reppin'\nPeachtree or Niece's for a big breakfast\nClub Empire standin' on the club sofas\nRockin' fresh Force Ones like they some Gucci loafers\nBlockstars and rockstars like the Doobie Brothers\nHolla at our city come on go head and say it for us\n\n[Hook:]\nKansas City! Kansas City!\nKansas City, Kansas City, Kansas City\nKansas City! Kansas City!\nKansas City, Kansas City, Kansas City\nKansas City! Kansas City!\nKansas City, Kansas City, Kansas City\nKansas City! Kansas City!\nKansas City, Kansas City, Kansas City", "image": "https://images.genius.com/dac1cf83fc6c83ed086fa8adde3a8bc2.1000x1000x1.jpg"}], "artist": "Tech N9ne"}