{"songs": [{"title": "You’re Nobody (Til Somebody Kills You)", "album": "Life After Death", "year": "1997-03-25", "lyrics": "[Produced by Jiv Poss, Puff Daddy, Stevie J and DJ Enuff]\n\n[Intro: Puff Daddy]\nYea though I walk through the valley of the shadow of death\nI will fear no evil, for you are with me\nYour rod and your staff, they comfort me\nYou prepare a table for me, in the presence of my enemies\nYou anoint my head with oil, my cup overflows\nSurely goodness and love will follow me all the days of my life\nAnd I will dwell in the house of the Lord forever\n\n[Verse 1: The Notorious B.I.G.]\nNiggas in my faction don't like askin' questions\nStrictly gun-testin', coke-measurin'\nGivin' pleasure in the Benz-ito\nHittin' fanny, spendin' chips at Manny's\nHope you creeps got receipts, my peeps get dirty like cleats\nRun up in your crib, wrap you in your Polo sheets\nSix up in your wig-piece, nigga decease\nMuah, may you rest in peace\nWith my Sycamore style, more sicker than yours\nFour-four and fifty-four draw\nAs my pilot, steers my Lear; yes, my dear\nShit's official, only the Feds I fear\nHere's a tissue, stop your bloodclaat cryin'\nThe kids, the dog, everybody dyin', no lyin'\nSo don't you get suspicious\nI'm Big Dangerous, you're just a Lil Vicious\nAs I leave my competition, respirator style\nClimb the ladder to success escalator style\nHold y'all breath, I told y'all\nDeath controls y'all, Big don't fold y'all, uhh\nI spit phrases that'll thrill you\nYou're nobody 'til somebody kills you\n\n[Chorus: The Notorious B.I.G. & Faith Evans (Puff Daddy)]\nYou're nobody 'til somebody kills you\n(I don't wanna die, God tell me why)\nYou're nobody, 'til somebody, kills you\n(I don't wanna die, God tell me why)\n\n[Verse 2: The Notorious B.I.G.]\nUhh, uhh\nWatch Casino, I'm the hip-hop version of Nicky Tarantino\nAsk Nino, he know\nGreen with envy, the green tempts me\nTo make the rich the enemy, and take their cheese\nTake their spots, take their keys, make my faculty\nLive happily ever after in laughter\nHah, never seen Cristal pour faster\nAnd to those bastards, knuckleheads squeeze lead\nThree of mine dead, nothin' left to do\nBut tear they ass to shreds, leave 'em in bloodshed\nIncidents like this, I take trips\nLay up in Miami with Tamika and Tammy (huh)\nSome Creole C-O bitches I met on tour\nPush a peach Legend Coupe, gold teeth galore\nTold me meet 'em in the future later\nThey'll take me shoppin', buy me lavender and fuschia Gators\nIntroduce me to playa haters and heavy weighters\nRich bitch shit, drinkin' Cristal 'til they piss the shit, uhh\nThorough bitches, adapt to any borough bitches\nBe in spots where they were no bitches, you feel me\nReminisce on dead friends too\nYou're nobody 'til somebody kills you\n\n[Chorus: The Notorious B.I.G. & Faith Evans (Puff Daddy)]\nYou're nobody 'til somebody kills you\n(I don't wanna die, God tell me why)\nYou're nobody, 'til somebody, kills you\n(I don't wanna die, God tell me why)\nYou're nobody 'til somebody kills you\n(I don't wanna die, God tell me why)\nYou're nobody, 'til somebody, kills you\n(I don't wanna die, God tell me why)\n\n[Verse 3: The Notorious B.I.G.]\nUhh, uhh\nYou can be the shit, flash the fattest five (that's right)\nHave the biggest dick, but when your shell get hit\nYou ain't worth spit, just a memory\nRemember he used to push the champagne Range (I 'member that)\nSilly cat, wore suede in the rain\nSwear he put the G in game, had the Gucci frame\nBefore Dana Dane, thought he ran with Kane\nI can't recall his name (what was his name?), you mean that kid\nThat nearly lost half his brain over two bricks of cocaine?\nGettin' his dick sucked by Crackhead Lorraine?\nA fuckin' shame, duke's a lame, what's his name?\nDark-skin Jermaine, see what I mean?\n\n[Chorus: The Notorious B.I.G. & Faith Evans (Puff Daddy)]\nYou're nobody 'til somebody kills you\n(I don't wanna die, God tell me why)\nYou're nobody, 'til somebody, kills you\n(I don't wanna die, God tell me why)\nYou're nobody 'til somebody kills you\n(I don't wanna die, God tell me why)\nYou're nobody, 'til somebody, kills you\n(I don't wanna die, God tell me why)", "image": "https://images.genius.com/f4413efc6682e8c2cfa7a01117fc8cd5.1000x1000x1.jpg"}], "artist": "The Notorious B.I.G."}