{"songs": [{"title": "Sorry 4 What", "album": "The Last of a Dying Breed", "year": "2000-10-03", "lyrics": "Is there anybody out there...\n\n[Scarface]\nI swear I feel so all alone, back down on my knees again\nHoping you can keep me strong, cause I can't hardly sleep tonight\nI took too many sleeping pills, I drunk too many Miller Lites\nAnd I can feel the Reaper near, so please forgive me for my sins\nI am just another man, sorry for the pain that I've caused\nI know you'll understand, but these demons are driving me insane\nI've been going mad, probably oughta blow out my brains\nCause I'm hurting bad but I'm fighting... blast, on the other day\nThese problems got me using more drugs, along with the other things\nI'm slowly fading into my thoughts, (come against me, bring it on!)\nAnd I'm drifting in and out of space, and I don't believe I'm waking up\nWith the alcohol, demerol, drifting into another world\nWith the sunshine shinin, and I think I'm finna url\nMomma, can ya look at me? This ain't what I used to be\nTomorrow, I'll be somebody else, cause I ain't been me\nAnd I can't seem to shake these things, I'll put that there on every thing\nThe more I try to figure me out, is like the more I've changed\nBut my childhood was fucked up - raised rowdy by a single moms\nShe told me my daddy didn't give a fuck, she ain't let him do his job\nSeparate the family, and I don't know my next of kin\nThese days in these fucked up ways, who the fuck are them?\nMy daddy had three other kids, but I ain't never seen him so\nAin't no sense in coming around now, you ain't been here before\nIt's sad but I ain't feelin him, my whole life's been a fuckin maze\nAnd when I tried to locate my siblings, they were gone away\nLost inside they other things, fucked me then, fucked me now\nQuick to tell me \"Show you some love\" nigga show you how?\nAin't no love I'm feelin here, I ain't never felt this vile\nMomma - did you really love me, or was I just a child?\nSad on the outside, I knew you seen it in my face\nI wasn't really happy here, but I was forced to lead the way\nCopped me a Chevrolet, drift away to the other side just to think\nIf I get to see Heaven, I can thank you for the ride\nAnd thank you for my other kids and even though\nThey mommas won't admit that they can't make it but bad\nLow on the child support - always been bad boo, tryna make me out to be\nThe bad guy that I really ain't, bitches quick to hassle me\nCause I don't see my kids enough, but I make the time to pick 'em up\nBut you find somethin to stick in my face - it ain't me fuckin up\nIt's bad enough, face to face, hoes who wanna catch a case\nSo bad they'll try to give me they baby - and what takes the cake\nIs the whole ward is fucking her, daddy know where the weakness at\nAnd you spoke lies to ya old mans eyes, how could you sleep wit that?\nJeopardizing everything, desperate, searching for larger life\nSacrificing the entire family, with no regards to Christ\nFunny how people look at life - can take this shit for granted, right?\nBut then reality strikes, and changes things overnight\nI thank the Lord for watching over me, though I'm prone to doin wrong\nI repent religiously, hoping that the weak get strong\nWhen the heat gets on {*wind blowing*}\nHoping that the weak get strong, when the heat get's on\n\n[Talking - echo after each pause]\nYa know... it's three different... stages of life...\nEither, you're headed into a storm... ya in a storm...\nOr ya just got out of a storm... (yeah) think about it...\n\n*music until fade*\n\nNews clip: \"I got my double-barreled shotgun, the one I call Molly\nAnd I crawled out of the house Army-style, with the rifle cradled in both arms\nAlright, I said, just hold it right there, I said 'don't move'\nAnd I walked up on him with the shotgun\nAnd I cocked both barrels of the shotgun on him cause I had double-oughts in it\nAnd (Gunshot)\"", "image": "https://images.genius.com/2361572b4ea20d3eff0b970b4f5f5a1e.1000x1000x1.jpg"}], "artist": "Scarface"}