{"songs": [{"title": "You and Me", "album": "G.O.A.T. (Greatest of All Time)", "year": "2000-09-12", "lyrics": "[Intro: LL Cool J & (Kelly Price)]\nYeah, uhh, uhh\nWord up\nAnd you say New York City\nA-ha-ha, word up (Take me away, baby)\nUhh, uhh, uhh.. uhh\n\n[Verse 1: LL Cool J]\nDamn, you and your man had beef\nSo he left you Uptown, teary-eyed, on the back streets\nFor me to scoop up in the Bentley drop\nLong as God hold me down you know I had to stop\nWhat the deal ma?  You wanna use my cell?\nYou runnin' solo?  This block foul as hell\nYou said my ex be beatin' on me\nHe mad jealous even though he be cheatin' on me\nMmm, I said miss, let me tell you somethin'\n'Bout who's makin' major moves and who's frontin'\nHuh, who's talkin' loud but ain't sayin' nothin'\nAnd those who get the one they want but keep frontin\nHe don't appreciate the well 'til it run dry\nLove is blind, it's hard to say goodbye {goodbye}\nBut smart birds choose to fly\n'Cause we livin' in the hood girlfriend, it's do or die\nHere's my definition, of love everlasting\nI would trade all my cash in, for passion\nTiffany jewels and designer fashions\nTo hear happiness is mine for the askin'\nEvery day on my knees I pray\nThat I would run into someone that make me feel this way\nWhat you think, you wanna ride with L?\nSome things are meant to be baby, you never can tell\n(I wanna ride, with you baby)\n\n[Chorus: Kelly Price]\nEvery night, every day\nI just sit and dream about you\nYou and me, you and me\nHold me tight, ecstasy\nMakin love 'til ever after\nBaby, you and me, yeah, you and me\n\n[Verse 2: LL Cool J]\nNow we dippin' on the FDR\nIt's one of them lucky nights when you can peep out the stars\nWe speak without talkin' and the world is ours\nWhen I glance over at ya I can feel your power\nYou schemin', L want a one-night stand\nI'm schemin', she probably in love with her man\nBut we keep on rollin', hopin' there's somethin' more\nDreamin' about tomorrow and what life got in store\nLivin, no drama, we can chill, relax\nSex all night in the morn' count stacks\nSip Grand Marnier and maybe puff a dime sack\nBut only in moderation, we ain't livin' like that, y'know?\nWe jetted up the tavern on the green\nTo talk about love cause the game's extreme\nDomestic abuse and everything in between\n'Cause I want you to think of me\nWhen you need a shoulder to lean on\nI'm from Queens, I'ma rep to the fullest\nBut I'd rather chill with you, 'stead of dodgin' bullets\nGlock in the stash I don't really wanna pull it\nOn some so-called thug cat, that's faker than acrylics\nHe said your fam be ridin' your nerves\nAnd you hate him for never given you the life you deserve\nRemember, the one who hold a grudge is foul\nAnd everything you ever wanted is in front of you now\nWhassup?\n\n[Chorus: Kelly Price]\nEvery night, every day\nI just sit and dream about you\nYou and me, you and me\nHold me tight, ecstasy\nMakin love 'til ever after\nBaby, you and me, yeah, you and me\n\n[Verse 3: LL Cool J]\nI promise you, dreams do come true\nThere's trials and tribulations that we all go through\nWhen your heart's bleedin', how could the sky seem blue?\nBut listen up shorty, this is what I wanna do\nBe there for you, baby care for you\nWhen my dogs stare at you never sharin' you\nAnd to my ex-girlfriend, never comparin' you\nAnd do the things that your ex never dared to do\nTime to bounce baby, I'm takin' you home\nLook at the moonlight sparkle on the 20 inch chrome\nThe rocks on my hand got a life of they own\nPlus the blend tape's bumpin' and it's settin' the tone\nShould I jet to the hotel, is now the right time\nOr should I be patient and explore your mind?\nYou said you grew up in the ghetto and it hurt your heart\nTried to live smart but your dreams fell apart\nYou dated hustlers and brought 'em customers\nThey totally destroyed whatever trust there was\nNow you hate men and everything they stand for\n'Cause you wanna be treated like a queen, not a whore\nClose your eyes, don't be afraid to dream\nOpen your heart to this cat from Queens\nWhatever you wanna do, however you wanna do it\nBack to back baby, we can get each other through it\n\n[Chorus: Kelly Price]\nEvery night, every day\nI just sit and dream about you\nYou and me, you and me\nHold me tight, ecstasy\nMakin love 'til ever after\nBaby, you and me, yeah, you and me\nEvery night, every day\nI just sit and dream about you\nYou and me, you and me\nHold me tight, ecstasy\nMakin love 'til ever after\nBaby, you and me, yeah, you and me\nEvery night, every day\nI just sit and dream about you\nYou and me, you and me\nHold me tight, ecstasy\nMakin love 'til ever after\nBaby, you and me, yeah, you and me\n\n[Outro: LL Cool J]\nKnahmean?  Word up\nYeah, yeah\nC'mon, c'mon\nC'mon, c'mon\nYeah, I just want you to think about that, y'knahmsayin?\nLate at night when you layin there\nAnd you feel like the whole world is fallin' around you\nRemember these words that I said\nThere's somebody out there for you baby\nMight be me, you never know, ahahah\nWord up, stay strong shorty\nKeep your eyes up to the sky, knahmsayin'?\nDon't let nobody tell you you can't make it\nAnd don't let nobody around you tell you\nThat it ain't possible to make your dreams come true\nWord up, uhh\nKnahmean? That's real\nQueens represent, rock on", "image": "https://images.genius.com/7d9009021acaa20a396f75cbd74c2360.1000x1000x1.jpg"}], "artist": "LL Cool J"}