{"songs": [{"title": "LVL", "album": "LONG.LIVE.A$AP (Deluxe Version)", "year": "2013-01-15", "lyrics": "[Produced by Clams Casino]\n\n[Intro: A$AP Rocky]\nClams Casino, nigga\nA$AP\n\n[Verse 1: A$AP Rocky]\nMr. Pistol Popper, Flacko locked and loaded\nLife's a bitch and she pussy pop, know why? Cause I got her open\nThat pussy soaking, fuck is you promoting?\nYeah, you claim you rage, you hating like you live in Oakland\nAll my rap town niggas with the roof back\nIntroduce you niggas to the new swag\nMake you say a nigga blew up too fast\nFuck I'm 'sposed to do with all this new ass?\nFuck I'm 'sposed to do with all this new cash?\nThousand dollar drawers just to hold my balls\nAll I ever do is let my jewels sag\nPac gone, but the \"Juice\" back\nGet your popcorn, juice, snacks\nIt's a movie nigga, with a new cast\nGet the news flash, that the truth back\nThis is boom bap, mixed with new raps\nLook at all the niggas that I blew past\nHood by Air, to the do-rag\nNigga make way for the new jacks\n\n[Interlude: A$AP Rocky]\nYea, uh\nYea, uh\nUhh\nYea, yea\nUhh\nUh, uhh\n\n[Verse 2: A$AP Rocky]\nIt's Mr. Pistol Popper screaming, \"Fuck a copper\"\nI just bought a crispy choppa, finna fuck your block up, blocka!\nEven cracked the pavement that's for niggas hating\nI been impatiently waiting to show you niggas Satan\nAll this talk of Illuminati ain't got a clue about me\nBitch, I'm Trillmaluminati and got my crew behind me\nShooters round me, keep them looters round me\nKeep a tool around me, it'll keep you fools from round me\nCouple of them dudes surround me\nWith a gat, with a strap in a backpack\nWhen they cap cap, leave you flat, better back back\nOn a fast track, ratatat, nigga that's that\nNigga pass that, finna ash, where the hash at\nGot a Kat Stacks with a ass, finna smash that\nMake 'em catch that, A$AP, then I pass that\nOff to my niggas then she ask, \"Where the cash at?\"\nI see dead people, I need dead people\nLord Pretty Flacko, bitch, I behead people\nKneel and kiss the ring, all hail the King\nLong Live A$AP put that on everything\n\n[Outro: Haim]\nAlright, mothafucka\nAlright, A$AP\nAll you need is love\nAll you need is love\nAll you need is love\nAll you need is love\nAll you need is love", "image": "https://images.genius.com/75621d1119a70043aadbe3fbf4387d88.640x640x1.jpg"}], "artist": "A$AP Rocky"}