{"songs": [{"title": "Hit ’em High", "album": null, "year": null, "lyrics": "(intro)\nGreetings, earthlings\nWe have now taken over your radioooo.....\n(b-real)\nGoin' straight through the hole\nYou ain't got no game\nI'm breakin' ya out the frame\nComing through like a train\nLooking to take over the world is my goal\nWith my unstoppable crew takin' all control\nYou can't get none of this, we're runnin' this\nWell taker, earth shaker, 3 point gunnin' this\nGet out the lane, I'm comin' through\nAnd if you don't wanna move then I'm comin' right through you\n(coolio)\nIt's like inch by inch and step by step\nI'm closing in on your position and destruction is my mission\nThough eight is not enough, your whole squad better duck\nIt's like switch when I bust\nNow you're whole crew is dust\nComin' through my area, i'ma have to bury ya\nThe real scream team on your scream scene\nIt's like showdown on the range\nGo tell me who wanna tangle with the\nGhetto witch-doctor neighborhood superhero?\n\nChorus:\n(b-real)\nWe want it all (want it all!)\nUnstoppable, we run the floor (run the floor!)\nYou can't take none of this hardcore (hardcore!)\nIn the game we take you to war (war!)\nYou ain't seen nothin' like this before\n(all)\nIf I hit 'em high, hit 'em high, hit 'em high\nAnd you hit 'em low, hit 'em low, hit 'em low\nIf I hit 'em high, hit 'em high, hit 'em high\nAnd you hit 'em low, hit 'em low, hit 'em low\n(method man)\nInsane like a runaway train I'm in your lane\nLike it's only 3 seconds to score to win the game\nCame to bring the ultimate pain upon the brain\nUntamed, you won't like it when I change\nAnd you are type strange\nMake room, manaical monster in the game\nAnd I got my eye on you\nDeadshot aim, as free throws keep comin' down like rain\nYou feelin' me, I'm feelin' you\nThe monstar again, I'm tellin' you\nPass me the rock, now I'm headed to the basket\nGet up out my way is what you better do\nMy tactics is unsportsmanlike conduct\nYou better ask it\nDon't get no better than this, you catch my drift?\nYou get stripped by ballhandlers ruled by swackhammer\nDanger, you're dealin' with offical hoop-bangers\nWith hang time like a coat hanger\nJump, with thunderous 360-degree type dunks\nWhat up doc? the monstar funk\n(ll cool j)\nLightning strikes and the court lights get dim\nSupreme competition is about to begin\nAbove the rim, finessin' and moves is animated\nOnce I get to ballin', I can't be deflated\nI'm rugged raw, my monstars is gettin' money\nWhen clicks get to buggin', I'm snatchin' up their bunnies (uhh!)\nEvery step I take shakes the ground\nI'll make you break your ankles, son, shakes you down\nThis is my planet, I'm bout business\nThe best that ever done it, can I get a witness? (uhhh!)\nCumulus clouds bring darkness up above\nYou in it for the money?\nOr in it for the love, m.j.?\n23 ways to make a pay\nLoungin' in the mothership back around my way (uhh!)\nI'm 28 light years old\nIf the refs get political, dribble like bob dole\nAm I gettin' lyrical?\nDaddy, I think so\nMonstar droppin' flavor fluid so drink slow\nChorus\n(busta rhymes)\nYo, God bless!!\nPick up your chest\nHere's an example of how I can stress your full court press\nWith finesse, I bench-press your stress whenever you test\nWe're speed ballin', on the fastbreak just like the pony express\nI'm gonna mingle in your face and take the lid off\nJust use your head and forfeit the game\nYou and your team just need to back off!!\nGet off my block, gimmie the ball, I said it's my rock!!\nI'm startin' a line-up by gettin' y'all to bring the livestock\nThrow all your money in the pot\nAnd make sure you bet all your money on my bank shot\nWhen we come right through tell me what you really gonna do?\nWe'll leave your team name in shame and take your talent from you\nWhile you abandon your ship, we take your championship\nWith nothing left for you to see except the instant replay clip\nMoney spending, goal tending, stay-bending teams like crash cars\nWho do they be?\nThey be the monstars!!!!!!\nChorus", "image": "https://images.genius.com/2615919eb0bcef9d55421080ab3b10b1.860x860x1.jpg"}], "artist": "Cypress Hill"}