{"songs": [{"title": "Problems", "album": "Brass Knuckles", "year": "2008-09-16", "lyrics": "* Wal-Mart online bonus track\n\n[Intro: Nelly]\nLet's go, ay\nThis story we about to tell you, is all true\nThe names may have been changed to protect some of those close to me\nUhh, uhh, true story, but if not\n\n[Nelly]\nThey say money is the root of all evil\nAnd I'm really startin to see what it do to people\nCheck it (c'mon) mo' money, mo' problems\nWell e'rybody got problems, but they expect me to solve 'em (hey)\nAnd I can barely solve my own\nGot me lookin at 'em like, \"You supposed to be grown?\"\nAnd I done said this shit in four different tones\nTo they face, e-mails mayne and over the phone\nI done said that shit calm, I done said that shit loud\nI done pulled 'em to the side, I done tried to sit 'em down\nBut some just don't get it\nCause they mind only focused on (hey) shit what I got\nWhat they ain't got, and what they can't get\nGot me lookin at my albums like \"Who wrote this shit?\"\nBelieve me man, I hope this get\nJust a tad bit better but I doubt that shit (it's like hey!)\n\n[Chorus: Nelly]\nI can hear these people say, \"Damn that boy done changed\"\nBut they don't understand the pressures I'm goin through\nOh how I wish there was a way, to change places for a day\nJust so they can see what it's like to walk a mile in my shoes\n\n[Nelly]\nYo, listen\nC'mon, I love Dave Chappelle\nBut I don't know too many turn down 50 mil'\nSee that's talk for real\nBesides, you know what I had to go through to get this deal?\nHow many brothers I done seen get killed\nFor 50 bucks and a few of them pills? Y'all don't feel me\n(Man please) Damn right I sing all them songs\nSo I can buy my pops a car and my momma a home\nSo she can sit up on the phone with her best friend Joan\nTalkin like on and on how her baby done grown\n\"How my baby make his own through the microphone\nAnd how my baby been my baby since my baby was born\"\nBut uhh, I ain't sayin man it's all about the money\nBut let's face it, you can't make a record for free\nI'll be damned if I watch 'em make a mil' off me\nAnd I just sit back and take it, for minimum wage\nAnd I done gave 'em e'rything but my D and my A\nI say hey, that's what the contract say (contract say)\nThey make it seem like you can't get away\nIt's like you owe these niggas three more days\nY'all don't feel me (hey!)\n\n[Chorus]\n\n[Outro: Nelly]\nWoo! Uh, uh...\nShout out to my nigga Polow\nWoo! A knocker right here O.G\nUh, uh, uh, yea", "image": "https://images.genius.com/c4d8605dff947c8e53f29c6880512a28.645x645x1.jpg"}], "artist": "Nelly"}