{"songs": [{"title": "We Right Here Dirty", "album": null, "year": null, "lyrics": "Uh, uh, uh, uh\n\nBring it! What? We right here\nWe're not goin' anywhere, we right here\nThis is ours and we don't share, we right here\nBring your crew 'cuz we don't care, we right here, uh, uh, uh\n\nOne mo' time, I gots to hit the streets off, make the streets talk\nLet 'em know it ain't a sweet walk\nThis gone be the only joint made this year that'll knock 'til 2003\nAnd y'all gone see that the hottest nigga out there\n\nWas, is, and will be me, just like that I can go away for a minute\nDo some other shit, but bounce right back\nAnd when it's on I'm comin' strapped, with some shit\nThat'll spit from dusk 'til dawn, and when you gone\n\nAin't no comin' back in the morning, like that shit was a dream\nNigga you gone that's for real, creep niggas like a seal, totin' steel\nStick a nigga make him squeal, oh, my God\nThose can't be the last words of ya man\nDamn ya man was so hard, come on!\n\nBring it! What? We right here\nWe're not goin' anywhere, we right here\nThis is ours and we don't share, we right here\nBring your crew 'cuz we don't care, we right here, uh, uh, uh\n\nHere we go again, how many million did my last one sell?\nFuck it, I'm goin' for ten, it's never gone stop\nAnd ever fuckin' time I hit you, it's goin' straight to the top of the charts\nThe champion, I'm a thoroughbred, my blood is strong\n\nAnd I scratch 'til you done, cross the line\nAnd ain't no more scratches after that, straight up\nNiggas is dyin', yo, what the fuck, is you cats doin' runnin'\nAround like this? Like you won't get stuck, yo, that's my word\n\nI stay givin' it to niggas, and I stay not really being heard\nBut, y'all gone see that the same things thou done to them\nWill be done to thee, and then you'll know that sometimes\nThough you come thru the front, you leavin' out the backdo', come on!\n\nBring it! What? We right here\nWe're not goin' anywhere, we right here\nThis is ours and we don't share, we right here\nBring your crew 'cuz we don't care, we right here, uh, uh, uh\n\nBring the noise, and you better come with niggas\nYou don't give a fuck about, 'cuz you gone lose your boys\n'Cuz we don't play and the silencer will silence any cocksucker\nWith somethin' to say, dog for life\n\nWhether I'm on or off the leash I bite, streets are my life\nClick, click, boom, another life taken too soon\nAnother mother had a funeral, still waters run deep\nAnd the pain is forever alive inside, makes it hard to sleep\n\nBut I keep goin', goin', shit, I'm always careful when I walk\nI'm always seein', knowin', the dog gone live, stay walkin' the wire\nOver the fire, when I can I give the dog is good and how it's stayin'\nDog gone fuck with the hood, the dog fuck with the wood\n\nBring it! What? We right here\nWe're not goin' anywhere, we right here\nThis is ours and we don't share, we right here\nBring your crew 'cuz we don't care, we right here, uh, uh, uh\n\nBring it! What? We right here\nWe're not goin' anywhere, we right here\nThis is ours and we don't share, we right here\nBring your crew 'cuz we don't care, we right here, uh, uh, uh\n\nWe right here\nUh, uh, uh", "image": "https://images.genius.com/1bcf43b1cc0f34db6cd70e1a63c8b84c.464x464x1.jpg"}], "artist": "DMX"}