{"songs": [{"title": "Diggy Doc", "album": "Malpractice", "year": "2001-05-22", "lyrics": "It's the Diggy Diggy Doc y'all, pumpin it yes y'all\nD.O.C. on the system, we kick it fresh y'all\nLettin the bass thump on and strong and hard for PPP\nEngineerin the cut is E Double E\n\nYo, it's the Diggy Diggy Doc y'all! ..\nYo, yo yo, when I hear a \"BASS\"\n\nThis goes out to my niggas and y'all bitches\nThe Benzes, Range Rovers, and sixty-four switches\nThe C.I.A., Feds and even dogs sniffin\nI plant a bomb right by the bar when it starts kickin\nDoc stompin ground, Brick City hound WHAT?\nGuerillas out the jungle get gritty now WHAT?\nI'm walkin barefooted over loads of hot coal\nCuts from the snot-nose keep your barbershop closed\nWhen it goes, Flex don't have to drop the bomb on it\nI keep my speech, +Bleek+, and my right mind on it\nSo when it's time, I'm heard in the streets\nMy mammal animal skin, excitin all the birds in your Jeep\nI'm crazy nigga, when I was young\nI spread and shaved both legs to my babysitter\nRan into Bebe's Kids in a baby pickup\nShot up Toys R Us and robbed Kay-Bee nigga!\nThis is +Def+ poetry far beyond my control\nFuck your teflon, we body-armed like the Toad\nUnload from my Girbauds and make it hot for homey\nI puff so much of that green I BLEED guacamole\nIt's like Shaq and Kobe, I beef for four quarters\nCallin veternarians to get the doggs off ya\n\"Animals Attack - Part Four,\" people starin\nI'm not the type of Focker that'll go and _Meet_ your _Parents_\nI'm outside trick or treatin, fuck if my chick is cheatin\nI'm hungry as FUCK, and I hope you niggas sick of eatin\nIt's like the fourth letter, tenth letter, third letter\nChickenhawk bird-getter, holla if you heard better\nI got a chick with no-ass-a'tall\nI fuck her for the love of that money, not basketball\nAnd when my man comes home, and the Def Squad is back\nYO, GIMME THAT RAP GAME, WE'LL TAKE CHARGE OF THAT", "image": "https://images.genius.com/109a9fb9c91fad29c7f632fb053de1bf.1000x1000x1.jpg"}], "artist": "Redman"}