{"songs": [{"title": "Follow the Leader", "album": "Follow the Leader", "year": "1988-07-26", "lyrics": "[Verse 1: Rakim]\nFollow me into a solo, get in the flow\nAnd you can picture like a photo\nMusic mix, mellow maintains to make\nMelodies for emcees, motivates the breaks\nI'm everlasting, I can go on for days and days\nWith rhyme displays that engrave deep as x-rays\nI can take a phrase that's rarely heard\nFlip it - now it's a daily word\nI can get iller than 'Nam, I kill and bomb\nBut no alarm - Rakim'll remain calm\nSelf-esteem makes me super, superb and supreme\nBut for a microphone, still I fiend\nThis was a tape, I wasn't supposed to break\nI was supposed to wait, but let's motivate\nI want to see you keep following and swallowing\nTaking and making, biting and borrowing\nBrothers tried and others died to get the formula\nBut I'mma let you sweat, you still ain't warm, you a\nStep away from frozen, stiff as if you're posing\nDig into my brain as the rhyme gets chosen\nSo follow me and while you're thinking you were first\nLet's travel at magnificent speeds around the universe\nWhat could you say as the Earth gets further and further away\nPlanets as small as balls of clay\nAstray into the Milky Way, worlds out of sight\nFar as the eye can see not even a satellite\nNow stop and turn around and look\nAs you stare in the darkness, your knowledge is took\nSo keep staring, soon you suddenly see a star\nYou better follow it, 'cause it's the R\nThis is a lesson if you're guessing and if you're borrowing\nHurry hurry step right up and keep following the leader\n\n[Verse 2: Rakim]\nThis is a lifetime mission, vision a prison\nAight, listen\nIn this journey you're the journal, I'm the journalist\nAm I eternal? Or an eternalist?\nI'm about to flow long as I can possibly go\nKeep you moving 'cause the crowd said so\nDance! Cuts rip your pants\nEric B on the blades bleeding to death, call the ambulance\nPull out my weapon and start to squeeze\nA magnum as a microphone, murdering emcees\nLet's quote, a rhyme from a record I wrote\n(Follow the leader) Yeah, dope\n'Cause every time I stop it seems you're stuck\nAs soon as you try to step off you self-destruct\nI came to overcome before I'm gone\nBy showing and proving and letting knowledge be born\nThen after that I live forever. You disagree?\nYou say never? Then follow me\nFrom century to century, you'll remember me\nIn history, not a mystery or a memory\nGod by nature, mind raised in Asia\nSince you was tricked, I have to raise ya\nFrom the cradle to the grave\nBut remember - you're not a slave\n'Cause we was put here to be much more than that\nBut we couldn't see because our mind was trapped\nBut I'm here to break away the chains, take away the pains\nRemake the brains, rebuild my name\nI guess nobody told you a little knowledge is dangerous\nIt can't be mixed, diluted, it can't be changed or switched\nHere's a lesson if you're guessing and borrowing\nHurry, hurry step right up and keep following the leader\n\n[Verse 3: Rakim]\nA furified freestyle - lyrics of fury\nMy third eye make me shine like jewelry\nYou're just a rent-a-rapper, your rhymes are minute-maid\nI'll be here when it fade, I'll watch you flip like a renegade\nI can't wait to break and eliminate\nOn every traitor or snake, so stay awake\nAnd follow and follow because the tempo's a trail\nThe stage is a cage, the mic is a third rail\nI'm Rakim, the fiend of a microphone\nI'm not him, so leave my mic alone\nSoon as the beat is felt, I'm ready to go\nSo fasten your seatbelt, 'cause I'm about to flow\nNo need to speed, slow down and let the leader lead\nWord to daddy...indeed\nThe R's a rolling stone, so I'm rolling\nDirections is told then the rhymes are stolen\nStop buggin' a brother said dig him, I never dug him\nHe couldn't follow the leader long enough so I drug him\nInto danger zone he should arrange his own\nFace it, it's basic, erase it change your tone\nThere's one R in the alphabet\nIt's a one letter word and it's about to get\nMore complex from one rhyme to the next\nEric B. be easy on the flex\nI've been from state to state, followers tailgate\nKeep coming but you came too late, but I'll wait\nSo back up, regroup, get a grip, come equipped\nYou're the next contestant, clap your hands, you won a trip\nThe price is right don't make a deal too soon\nHow many notes, can you name this tune?\nFollow the leader is a title/theme/task\nNow you know, you don't have to ask\nRap is Rhythm and Poetry, cuts create sound effects\nYou might catch up if you follow the records E wrecks\nUntil then keep eating and swallowing\nYou better take a deep breath and keep following the leader", "image": "https://images.genius.com/9b590ab143a3ba007bcb44a5bd6af57b.953x953x1.jpg"}], "artist": "Eric B. & Rakim"}