{"songs": [{"title": "Take It Off", "album": "Sickology 101", "year": null, "lyrics": "[Intro: Tech N9ne]\nAnd I ain't trying to be no husband\nI'm just trying to get your loving\nAin't no time for you to be stubborn\nHey! And I ain't that kind that just be hovering\nOver no blind bianc that's suffering\nIn the mind she got a lot of flustering\nListen, I got this thang\nI wanna do bang all over you\nStrange what I'm a do\nI wanna put you in the lane that get sweet pain\nI really wanna put you in the car\nGet you at the house\nI get aggressive nigga I'll throw you on the couch\nReady to give it you, the bigger, the fatter\nThe better, the filler before I take it out\nTake it off!\n\n[Hook: Tech N9ne & Lady Q (2X)]\nTake it off\n(Here's my shirt baby)\nLet me take it off ya, get if off!\n(Here's my skirt baby)\nLet me take it off ya, take if off!\n(Put in work baby)\nI'm about ta off ya, get if off!\n(Do me, do me)\nGive it to me and I gotcha, take if off!\n\n[Verse 1: Tech N9ne]\nYou looking like you really need somebody\nTo come please your body, to complete your naughty\nHey! I'm tellin' you you need to seize my Johnny\nIt won't tease ya nanny, excuse me so irisy\nI'm digging you, yes I wanna get in ya dress\nThe N9ne licking ya breast then I'm fixing to\nHit it to the people that thinking I had a cook out\nIf you got a pretty punani it's gettin' took out\nTake it to the crib then I rip ya off\nA good guy with the jungle love so baby look out\nOh! I'm lookin' for a ho E-O-E-O\nIf she wanna know me low she go\nBaby gotta blow me slowly though\nHit it real slow for a minute then stepped up the pump\nHit it from the back and I pepped up the rump\nBut I beat it of a nigga that messed up the cunt\nSo I ain't gonna smell it if that's what you want\nHow many really wanna know about Tech\nGotta give a women that psycho sex\nIf she got a best friend we all have sex\nAnd if she first then I go next\nHere I come baby to break it off\nWhen I'm done they gotta tape it off\nNever defeated the better lover the heated\nIf I'm a give her the business then I'm a tell the baby\n\n[Hook (2X)]\n\n[Verse 2: K-Dean]\nI been really tryna get witcha baby let me\nTouch every little bit and part of your frame\nCan't nobody give it to you like I can\nI'mma give it to you like a nigga went insane\nNiggas all in my ear yelling (Who that?)\nWhen you so fat nigga gotta (Move back!)\nShe be telling me nigga you gotta kill\nThe cat from the back if you really wanna (Do that!)\nOh, oh stop playing with a nigga, I'm a beast when I run it to that\nShe be callin' me T-pain a little when I do it so I had to (Chop and screw that)\nIf you really looking ready I'm put you in the back in my lap in the Chevy\nPick ur ass up in put it deep in yo belly\nWhen we get throughyou u can't breathe, I'm so heavy (Hah!)\nI'm the little bitty nigga that'll kill any woman\nThat wanna give it to me cause I'm packing\nAin't nobody like me and my motherfuckin' G's\nTell them other niggas stop their acting\nT-t-t-take it off, I'mma b-b-break it off\nI'mma f-f-f-f-fuck you until you make it soft!\nToo bad I popped the pill, now my dick is hard as steel\nSee I treat the pussy like Samuel when it's time to kill\nAll I wanna do is get you up in the bed\nAnd we can do it all night while u giving me head\nSo little mama don't tease, I'll be giving you bread\nSo let me see everything that you willing to share!\n\n[Hook (2X)]\n\n[Verse 3: Lady Q]\nI be losing my mind putting the work and the time\nNigga waiting for your ass to get home\nThink about you all day, all the kids gone away\nMothafucker be bringing the patron, probably on the phone\nNigga be touching himself making a nigga want to moan and groan\nNigga I'm about to do something wrong\nGrab a camera and make my self cum\nIf you wanna be invited to the party nigga all you gotta do is bring the dick\nTake my shit off any where that you wanna\nNigga I don't even care who's looking, shit!\nMothafucka do me how up really want to do me\nAll you gotta do is tell me how you really want to do me\nOnce you're giving loving to me bring the dick and never leave me\nTake it off like a new motherfucker (Just do me!)\nNow, I want you to take it and just work the shit\nMake my toes curl and my eyes roll back\nMothafucka be off and ready to lick that shit\nNigga go down and taste the bit, flip me over and smack that shit\nNigga do me right make me cum all night\nMotherfucker be off an ready to lick that shit\nLittle nigga be coming and try to do what he wanna\nWhen he know he gonna be-be the king\nLittle nigga be coming and try to do what he wanna when you know\nI'mma suck ya like a lollipop queen\nGet me real hot nigga be hitting the spot\nLittle nigga be coming and tryna gimme what he got\nHere's my shirt, here's my skirt, here's my panties and my bra\nMotherfucker come quick I'm about to take it off!\n\n[Hook (2X)]", "image": "https://images.genius.com/081166dc5d132ad1d3549578cac249e0.1000x1000x1.jpg"}], "artist": "Tech N9ne"}