{"songs": [{"title": "Moet", "album": "Welcome to tha Chuuch, Vol. 3", "year": "2004-09-14", "lyrics": "[Intro: Uncle Junebug]\nBitches, bitches, bitches\nYou love Moet?\nBring some of that shit\nBring it to me!\nSkeet, skeet, skeet, skeet, skeet, skeet, skeet\nI love Moet\nEverybody that's in this place love Moet!\n\n[Verse 1: RBX]\nFlossy bitches in leathers\nSmellin' like Prada, shakin' their tailfeathers\nI hit the event with the hydro glow\nNever party pooper, super rhyme pro\nI can feel hatred when I step through the door\nWhy you talkin' bout me?  You best watch your hoe\n'Cause she is watchin' me, I'm watchin' her watch me\nShe clockin' the Versace, eyes locked to the watch-y!\nI move to her pimpin', step it up a notch-y\nThe 'Zine play pimpin' like a 50-inch Hitachi\nWith a body like a bottle, is your name Jeannie?\nYou need to be with me, why you chillin' with that weenie?\nDude get mad like he gon' blow a fit\nNigga, don't you know the Glock ready to spit?\nLord have his mercy, get this, nitwit;\nIt's nasty in the cut and don't make the Glock spit!\n\n[Hook: Snoop Dogg]\nYeah! We just sippin' on some Moet\nTo get the hoes \"mo' wet,\"\nYou hoes better know it!\nYeah! We sippin' on some Moet\nTo get the hoes \"mo' wet,\"\nYou hoes better know it!\nYeah! We sippin' on some Moet\nTo get the hoes \"mo' wet,\"\nYou hoes better know it!\nYeah! We sippin' on some Moet\nTo get the hoes \"mo' wet,\"\nYou hoes better know it!\n\n[Verse 2: Wayniac (Bishop Don Magic Juan)]\nLet's get it poppin'; homie, put some Mo' in my cup\nMan, the way this bass bangin', I'm buzzed, ready to fuck!\nTryin' to get my duck sucked, let her massage these nuts\nLike the Bishop say, (STEP YOUR GAME UP!)\nWe dem niggas that they wanna hang with, do they thang with\nDon't mind me, just vibe off this gangsta shit\nHootie-Hoo in the house gon' get some!\nFeelin' good 'cause she wet but we tryin' to get her \"mo' wet,\"\n\n[Verse 3: Trip Locc]\nPour it 'till it's all gone, you might get the suds\nWhen you sip it, make sure you finish, then you get a buzz\nWe don't love nan' one of you's, hope you soak it up\nUnderstand how we do it, cashin' in and gettin' sucked up\nFor real, we don't play, takin' breaks when we can\nHit the glow like the strobe, puttin' bitches in a jam\nScram!  We on to the next destination\nPimpin's how we do it, puttin bitches in their places!\n\n[Bridge 1: Bishop Don Magic Juan]\nIt's up to you, playa\nTo make sure them bottles multiply but not out YOUR pocket!\nDig, it's the new Mack-illennium now\nAnd chicks not gonna get away with that game no more!\n\n[Hook: Snoop Dogg]\nYeah! We just sippin' on some Moet\nTo get the hoes \"mo' wet,\"\nYou hoes better know it!\nYeah! We sippin' on some Moet\nTo get the hoes \"mo' wet,\"\nYou hoes better know it!\n\n[Verse 4: E-White]\nDrunk as fuck but still sippin', I'm stuck in this position\nWhere the rest of all my niggas I came up in here with?\nTalk to the bitches like I won't, I'm tryin' to roll a blunt\nAin't got no time to sit and holla, come swallow me or somethin'\nSince tomorrow wasn't promised, I'mma party 'til I die\nBig glass of Moet, share with my niggas in the sky!\nTipsy on a fifth, I'm gettin' frisky with a bitch\nOh yeah, I used to hit her sister, but that was in '96!\nLeave a tip with the bartender;\nYou little slender, fine ho, I'm comin' home wit'cha\nYa boy slizzard, they be touchin' on my dick, I'm rushin' to get a fix\nAnother shot'll set us off, it cost to get with this!\nI'm just a hop and a skip around the way from where I say I'm from\nMy dick back in my pants and I'm finished for the day!\nI ain't sayin' it no more, the glass get it poppin'\nAss is what I'm lookin' for, she got it, got it!\n\n[Hook: Snoop Dogg]\nYeah! We just sippin' on some Moet\nTo get the hoes \"mo' wet,\"\nYou hoes better know it!\nYeah! We sippin' on some Moet\nTo get the hoes \"mo' wet,\"\nYou hoes better know it!\nYeah! We sippin' on some Moet\nTo get the hoes \"mo' wet,\"\nYou hoes better know it!\nYeah! We sippin' on some Moet\nTo get the hoes \"mo' wet,\"\nYou hoes better know it!\n\n[Bridge 2: Snoop Dogg]\nYeah, we got 40 hoes in here so we gonna need about..\nYou know, lemme see how many bottles we gonna need\nLemme add this shit up real quick\nGimme one second, hold on, let me see...\nOK, all right, here we go!\n\n[Verse 5: Snoop Dogg]\nLook, ten times five plus four minus three\nBitches'll bring bottles, and they all for free!\nI go hard on 'em, guard on 'em, pourin' my glass\nI want the little yellow bitch with the big ol' ass\nMy young homeboy shot some drag and he put out a bag\nNow she drinkin' and she thinkin' that she gon' get some cash!\nLook, fill it up one more 'gain, get that shit crack-a-lackin'\nTell her to back it up, suck a nigga like Dracula\nAnd now she feelin' good, I'm feelin' good, it's so spectacular\nThis ain't no actin' here, but you'll be actin' up\nLaughin' and crackin' up, talkin' to your peoples 'bout\nHow it rolls, you call it Mimosa, let's toast to\nThe hood life, the good life!\nYou could, might be livin' the good life if you do it right, do it right!\n\n[Bridge 3: Bishop Don Magic Juan]\nWhen you see a playa chargin' a chick\nDig, playa, pat him on the back\nDon't playa-hate, congratulate!\n\n[Hook: Snoop Dogg]\nYeah! We just sippin' on some Moet\nTo get the hoes \"mo' wet,\"\nYou hoes better know it!\nYeah! We sippin' on some Moet\nTo get the hoes \"mo' wet,\"\nYou hoes better know it!\nYeah! We sippin' on some Moet\nTo get the hoes \"mo' wet,\"\nYou hoes better know it!\nYeah! We sippin' on some Moet\nTo get the hoes \"mo' wet,\"\nYou hoes better know it!", "image": "https://images.genius.com/abd923354acbbe05340e9488c4adde55.665x1000x1.jpg"}], "artist": "Snoop Dogg"}