{"songs": [{"title": "Sugar Cane", "album": "Paperwork: The Motion Picture", "year": "2014-10-21", "lyrics": "[Hook:]\nCharms 'em with some all of that and all of this (ay look at this)\nEmpty the bottle nigga let the Dom drip (there they go)\nWe leanin on these brick, this is all God give (ay, ay, ay)\nCuts and charms all on my wrist nigga (ay, ay)\nHotel linen (yeah) R.L. demin (yeah)\nPropeller spinnin (yeah) nigga hella women (hey!)\nBig money mayne (hey) get it how we livin mayne (hey)\nHow we did it mayne (hey) sweet sweet sugar cane\nTrappin hard with the yay all times of the night\nAll times of the night, all times of the night\n(How we did it mayne, sweet sweet sugar cane)\nTrappin hard with the yay all times of the night\nAll times of the night, all times of the night\n(How we did it mayne, sweet sweet sugar cane)\nTrappin hard with the yay all times of the night\nAll times of the night, all times of the night\n(How we did it mayne, sweet sweet sugar cane)\nTrappin hard with the yay, trappin hard with the yay\nAll times of the night, trappin hard with the yay, ay\n(How we did it mayne, sweet sweet sugar cane)\n\n[Verse 1:]\nListen shawty I'ma tell you how it go\nQuarter ki', seven G's\nAnybody want it tell 'em pull up on me at the store\n.45 in my jeans, super clean\nYou ain't never seen a nigga like this\nSun shinin on my wrist\nCouple dimes in the whip, give a damn 'bout a bitch\nHuh, but I will take yours if I wanna\nYou a sucker, you ain't goin' do shit\nBut just run yo' mouth\nBe in front of yo' house with them goons, bet you won't come out\nAnd you a scary ass nigga\nHold these, your homeboy to the Fed ass nigga\nHey I'm certified, better recognize\nFore you end up a dead ass nigga\nI got a check, you can tell how my neck is shinin'\nTell 'em\n\n[Hook:]\n\n[Verse 2:]\nThis life we live we do not care\nIf you at your momma house we'll have a shootout there\nHey, ain't gon' be no playin with the crew out there\nThem animals on the loose and it's a zoo out there\nOut here rollin where you at, we'll move out there\nNetwork in no time, get a few out there\nI got the chopper at the do', \"Shawty who out there?\nAight, get your fuckin brain blew out now!\"\nNow I ain't playin where I stay, to take a life ain't shit\nGet murked for a brick if your wife ain't shit\nBankrolls are us, we'll buy that shit\nI keep it on me homie, rob and I will try that shit\nMan you can ask about Tip on Simpson Road\nWe was ridin in the city; really gettin busy\nNow a nigga wanna kick it like some thugs in the city\nWhen they really wasn't sellin any drugs in the city\nFor real\n\n[Hook:]\n\n[Bridge:Tameka \"Tiny\" Harris]\nWhat you want we got for you (hey, we got it)\nYou're not the rule, we not for you (nah shawty)\nWonder why we shut your door\nYou're not from here, do not go through\n\n[Verse 3]:\nI told you this\nShawty this as real as it get\nHow many times I done showed you this?\nIn the trap run a chick through the roof right now\nI can show you this\nPick the rap with your bitch in the coupe right now\nAnd I know you pissed\nHow many times I done told you this?\nThis life we 'bout it\nThis life we 'bout it\nYou can't do shit 'bout it, this life we 'bout it\nThis life we 'bout it\nYou can't do shit 'bout it, can't do shit 'bout it\nHa ha, ay", "image": "https://images.genius.com/0aedeee6f38d44bf87bbee70cb36cca3.640x640x1.jpg"}], "artist": "T.I."}