{"songs": [{"title": "The Bitch in Yoo (Havoc version)", "album": null, "year": null, "lyrics": "[Produced by Havoc]\n\n[Intro]\n\"Let it\" [5x]\n\"AKA Black, Black, Black, Black, Black\"\nHave they lost they fuckin' mind man?\nKnow what I mean?...\n\n[Verse 1]\nA bitch nigga with a attitude named Cube\nTried to step to the Com with a feud\nWhat the fuck I look like dissing a whole coast!?\nYou ain’t made shit dope since AmeriKKKa's Most\nWanted deceased, from the Midwest to the East\nOn the, dick of the East for your, first release\nYour lease is up at the crib, house niggas get evicted\nIn videos with white boys talkin' you get \"Wicked\"\n\"Natural Born Killa\", nigga you natural born God\nRead, rich, got the nerve to say you rob\nHypocrite, I’m fillin' out your death certificate\nSlangin' Bean Pies and St. Ides in the same sentence\nShoulda repented, on the 16th of October\nGet some beats besides Parliament, to rock over\nRap career is over, better of actin'\nWhat trouble I see, in managing WC and Wack 10?\nYou backed into a four corner hustla\nLyin' on your dick, said you was fuckin' her\nUse higher learning, don't take my words out of 'text\nWent from gangsta to Islam, to the dick of Das EFX\nIt’ll take the nation of millions to hold me back from giving you mouth shots or hit, with the pipe that Ralph got\nChris Tucker ain’t around, it's your Friday, it was good\nWasn’t salty she was with the Boyz N the Hood\n\n[Chorus]\nI see the BITCH IN YOU, when you don't speak your mind\nTHE BITCH IN YOU, lookin' me in my eyes lyin'\nI see THE BITCH IN YOU, to be hard you tryin’\nTHE BITCH IN YOU, it's comin' out, check it\n\nI see the BITCH IN YOU, when you don't speak your mind\nTHE BITCH IN YOU, lookin' me in my eyes lyin'\nI see THE BITCH IN YOU, to be hard you tryin'\nTHE BITCH IN YOU, yeah, check it yo (yeah)\n\n[Verse 2]\nThe ump of this rap shit!\nCube I'm callin' out\nI break in and smack niggas that's in the Slaughterhouse!\nThis ain't no East Coast, West Coast, none of the above\nI'm from Chi, I went to Cali, niggas gave me love\nThere's a thin line between, the fake and the real\nGrafted ass nigga, I see through you glass shield\nHAD SKILLS, once upon a time on this project yo (hop on dudes son, hop)\nI'ma have to wreck a HO'Shea\nI heard a ho say you favorite rapper...\nSo I had to slap her!\nAnd violate you, a \"Muslim\" drinkin' brew\nYour nigga ain't no Mack 10, he's a 22\nI seen you (Mack 10), you ain't say shit in ATL\nCube, I like that diamond charm, I might cuff it then sell-\nIt out, like you sold Kam and Threat...\nA year ago, you wasn't talkin' shit about the West!\nGuess you knew your shit was done plus the one got you cable\n\" Hoo-Bangin' \", you ain't bangin' shit but the table\nAnd the Circle mad, ain't got no choice but to fight (know what I mean?)\nAin't none of y'all motherfuckers got a chance on the mic! (no wayyss...)\nAny time you come out, joe, I'ma talk about you\nUntil you let that bitch in you, walk up out you\nAny last words before I hit the switch?\nFrom the immortal words of one: \"A BITCH IS A BITCH!\"\n\n[Chorus]\nI see the BITCH IN YOU, when you don't speak your mind\nTHE BITCH IN YOU, lookin' me in my eyes lying\nI see THE BITCH IN YOU, to be hard you trying\nTHE BITCH IN YOU, it's comin' out yo\n\nI see the BITCH IN YOU, when you don't speak your mind\nTHE BITCH IN YOU, lookin' me in my eyes lying\nI see THE BITCH IN YOU, to be hard you trying\nTHE BITCH IN YOU, chill, check it\n\n[Outro]\n(uh) Aight so that's cool...\nKnow what I'm sayin'?\nIt's all good baby, you can get it over here too\nNYC, to Chi-Town (\"Yeeaah!\")\nLettin' niggas know when are we gettin' down\nKnow what I mean?", "image": "https://images.genius.com/1bf97cad3c073fb404767d2c74f4cc36.214x300x1.jpg"}], "artist": "Common"}