{"songs": [{"title": "Loyal to the Game", "album": null, "year": "1994-03-22", "lyrics": "[Hook: Sample]\nYeah, yeah, yeah, ah, ha\nYeah, yeah, yeah\nYeah, yeah, yeah, ah, ha\nYeah, yeah, yeah\nYeah, yeah, yeah, ah, ha\nYeah, yeah, yeah\n\n[2Pac]\nNow I've got task on a nigga's ass, tell me will they blast me?\nI think of an alias in case these crooked bitches ask me\nNow, it's gettin crazy after dark, these narcs\nBe like tryin to shut me down but I'm too smart\nNow picture me scared of the penitentiary\nI've been movin these things since the days of elementary\nNow tell me what you need when you see me\nI'm stackin G's, buyin all the things on TV, believe me\nI got some killas on my payroll, and they know\nWhen it's time to handle business, nigga lay low\nAlthough I'm young, I'm still comin up\nI'm gettin paid, pullin raises on niggas when they runnin up\nThe first to pull a strap when there's drama\nBusta, you ain't heard?\nI've been slicin motherfuckerss since I lost my momma\nThere ain't a cop that can stop me\nMy posse is cocky, G, and they don't quit until they drop me\nI'm loyal to the game\n\n[Hook: Sample]\nYeah, yeah, yeah, ah, ha\nYeah, yeah, yeah\nYeah, yeah, yeah, ah, ha\nYeah, yeah, yeah\nYeah, yeah, yeah, ah, ha\nYeah, yeah, yeah\n\n\n[Treach]\nWithout no doubt I ain't no slouch and it ain't time to back down\nSo I jumps in and try to stop-a and watch-a\nSlap you cock-eyed like Popeye fucks spinach\nForgotten more shit than most crews ever know, or ever knew\nWas born with 7 flows and only heaven knew\nFor beat the boot sex, the news breaks, the you shakes\nWorse, they heard we got more nerve than a 2-fake\nYoo-hoo to you crew and you too so you knew\nI'm from Jersey and I'm a teen so your block more than you do\nWhose the new crew?\nShow me your neck brotha, and here's another\nSmack your mother's mamma's mother\nIn the first mob of all those other crack lovers\nBack was bitch-ass, trick ass, cluk-clow-cluk-clow\nHow ya like me then, how ya like me, hey-ho, how ya like me now?\nOw, pow, hurt, don't it? Bow, bow, don't run up on it\nThe same thing minus \"P\" hangin possies like an exponent\nOh yes, rock in slums, ya gots to run it\nIt makes no sense to smell like shit\nIf old ass George could be Washing-tons\n\n[Hook]\nYeah, yeah, yeah, ah, ha\nYeah, yeah, yeah\nYeah, yeah, yeah, ah, ha\nYeah, yeah, yeah\nYeah, yeah, yeah, ah, ha\nYeah, yeah, yeah\n\n[Riddler]\nNow I be loyal to my niggas on the blocks, just buckin the shots\nAnd packin the Glocks\nAnd dodgin the cops, and takin over niggas spots\nPoppin after poppin the fools be droppin, the hoes be hoppin\nOn my thing cause it hangs like the nets from Above the Rim\nYou lookin grim, is it me or him or him\nOr be with me, we be together\nSo what's up? We can do whatever\nCause real niggas stick together\nTill they make it up to heaven\nThrough the stress, through the hell, through the 1-8-7\nThe shorter the nigga, the bigga the trigga\nThe deeper they dig the ditch-a\nThe Naughty the Treach\nThen through to the Pac I brings the Glock I wets up\nYou fuckin body, I'm like, Oh my Gody\nDid I really shoot him? Yo I shot him\nSo I got him, now I puts the crime behind me\nAnd finds me, a place to lays my head low\nI lives doin my rap, but I dies for my hood row\nSo all you fuckin fools better recognize, and know my fuckin name\nI be Riddler to my niggas and I'm loyal to the game\n\n[Hook: Sample]\nYeah, yeah, yeah, ah, ha\nYeah, yeah, yeah\nYeah, yeah, yeah, ah, ha\nYeah, yeah, yeah\nYeah, yeah, yeah, ah, ha\nYeah, yeah, yeah\nYeah, yeah, yeah, ah, ha\nYeah, yeah, yeah\nYeah, yeah, yeah, ah, ha\nYeah, yeah, yeah\nYeah, yeah, yeah, ah, ha", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}