{"songs": [{"title": "The Storm", "album": null, "year": "2010-01-01", "lyrics": "[Verse 1]\nMy man, Shawn, from around the way, son, been down from day one\nNever been known for mistakes but was bound to make one\nHer name was Nina, see he was all about the cash flow\nTil she came and had this man pussy whipped to the max yo\nA true dime piece describin her, brown eyes\nCaramel skin, thick thighs, goes beyond speech\nBut besides looks her mind's lost\nKnown for kickin cats to the curb, leaving their hearts on the sidewalk\nShawn was one of them, she said she was lovin him\nBut only fucked him because he had some funds comin in\nHe couldn't see it though\nShe was cheating and he didn't even know\nHe even bought a crib with this schemin ho\nIn the ride, mad jewels, mad clothes, mad shoes\nAnd to show his commitment he got her name tattooed\nI gotta hand it to her, she had the stuff planned out\nBut watch what happened when her luck ran out\n\n[Hook]\nWhat goes around comes around\nWhat goes up must come down\nYou up now but you'll get yours\nSome how\nSome day\nIn some way, shape, or form\nRevenge is coming\nNo way to escape the storm\n[x2]\n\n[Verse 2]\nTime passes, Shawn is thinking about wedding rings\nBut he knows the signs of cheating and doesn't wanna believe them\nHe disregards them, goes out for diamond ring shopping\nNow the big question is when is he gonna pop it\nWaiting for the right time\nMeanwhile Nina's the same ho\nLike a snare drum but bangs way more\nFor Shawn up to this point shit's going well\nTil one day his homeboy hit him on his cell, like\n\"Yo son you won't believe this, I just seen your chick.\" (\"Where?\")\n\"In the mall with this cat, he was palming her ass\nI swear to God son. Need me to run up on him and drop him?\"\n\"Nah, chill I got this, I'll hit you back if it's poppin\"\nHe hung up, I called Nina, \"Where you at? What you doing?\"\n\"At the mall with some friends buying new Timbs.\"\nSomethin sounded funny\nShe was lying for sure\nBut Shawn had a little plot of his own\nCheck it\n\n[Hook x2]\nWhat goes around comes around\nWhat goes up must come down\nYou up now but you'll get yours\nSome how\nSome day\nIn some way, shape, or form\nRevenge is coming\nNo way to escape the storm\n\n[Verse 3]\nI missed you (Aw)\nMissed you so bad I followed you (What, where?)\nFollowed you all the way to your boyfriend's rendevouz (What?)\nYeah bitch you caught now\nSo don't even try to give me that shit you thought how it wasn't you who I saw now (No it wasn't)\nYou trifling ho, I gave my whole life to you yo\nAnd now you basically shove a knife in my throat (It's not like that)\nBut it's alright though, the same cat you was fucking with then\nIs currently laying dead in the trunk of my Benz (Oh God)\nYeah get to crying, in a minute you'll be there beside him\nAnd by the time the cops find you I'll be in the islands (No, I'm sorry)\nVisualizin what could have been between me and you\nIt was just just a dream, you fucked up the thing between us two\nSo now it's speak your peace before you leave this earth bitch (We can work this out)\nI hope that shit was worth it\nAnd now I pray that God is merciless\nWith this said, goodbye to the reason I lived this life (Shawn)\nPointed the gat to her mouth, long kiss goodnight (No)\n\n[Hook x2]\nWhat goes around comes around\nWhat goes up must come down\nYou up now but you'll get yours\nSome how\nSome day\nIn some way, shape, or form\nRevenge is coming\nNo way to escape the storm", "image": "https://images.genius.com/099e9154a59571ad9674471a3b565cce.700x700x1.jpg"}], "artist": "J. Cole"}