{"songs": [{"title": "Dubai", "album": null, "year": null, "lyrics": "[Intro - Young Thug]\nThis is just like, some YSL takeover typa shit, know what I'm saying?\nI got diamonds everywhere on me too\nOn God, yeah\n\n[Pre-Hook: Young Thug]\nI'm saucing on everyone\nI cost more than everyone\nReal bad bitch she don't play, today\nMy jeans made by Saint Lauren\nBig up, big up to everybody balling\nBig up to everybody tryna fall in\nBig ups to niggas that be flossing\nBig ups, ayy\n\n[Hook: Young Thug]\nTake a trip and land in Dubai\nAll of us are livin' like a star\nAll my diamonds dripping like a star\nBig dog status baby roar roar roar!\nGoing brazy, Tasmanian\nI ran it up for a better life for my son\nTake a trip and land in Dubai\nTake a trip and land in Dubai\n\n[Verse 1: Young Thug]\nI got money on my mental\nI used to live in the projects over (?)\nTryna stack the money way taller than Frisco\nTryna put all my niggas in them Benz Os\nGot my hair grey like my mental\nSo you know my mental got me Cisco\nDiamonds on my neck, this cold\nPop shit yes, big balls\nI see all these bitches screaming \"Get some!\"\nI see all these niggas tryna get some\nNow all these bitches in my bed, ehh\nAnd now these niggas wish they was the kid, ehh\nYellow diamonds on me, fuck the critics, ehh\nLong as all the critics know I'm getting it\nBefore I die, wanna be like Money Maid\nBitch I'm getting cheese like cottage, ayy\nComment on the boy like I'm Ben Wallace\nCheck us out the foreign I went and on got it\nWassup with my lil boy they like Foamposites\nSo I filled the closet up with like Foamposites\nBounce and make it wobble on the dick\nSlurping sloppy toppy 'front the kids\nGot to peel the top that's what I did\nI give that (?)\nMix kid, pop him with the cig\nFuck around and rob him with the wig\nI bought some ice and fuck if imma ski\nI really fucked the bitch, big D\n\n[Pre-Hook: Tyga]\nI'm saucing on everyone\nI cost more than everyone\nReal bad bitch she don't, today\nMy jeans made by Saint Lauren\nBig up to everybody balling\nBig up to everybody tryna fall in\nBig up to niggas that be flossing\nBig up, ayy\nBig up, ayy\n\n[Hook: Tyga]\nTake a trip and land in Dubai\nPlane so long I see days in the stars\nAll of us are livin' like a star\nBig dog status baby roar roar roar!\nGoing brazy, Tasmanian\nI run it up for a better life for my son\nTake a trip and land in Dubai\nTake a trip and land in Dubai\n\n[Verse 2 - Tyga]\nStepping out the Jiggy G5\nWhen you the shit you just do shit on the floss\nBulletproof vest, got me shooting in designer\nFrames, Christian Dior model\nGucci to my boot like a fucking big timer\nAMG coupe you know my nigga just got it\nMy son like Ferraris, we may got Ferraris, I threw him a party, 200\nWe, fuckin, winning, Tyga, blood, dripping, dripping\nChop the dope, got it snowing like Christmas\nGet so high, she costs birds, she a Christian\nDon't play yourself, we even ball off-season\nHad to cut some niggas off, them niggas can't believe it\nI know, I know you want a better life\nTrade lives for my tie just to get away I, I\n\n[Hook: Young Thug]\nTake a trip and land in Dubai\nLens so long I see days in the stars\nAll of us are livin' like a star\nBig dog status baby roar roar roar!\nGoing brazy, Tasmanian\nI run it up for a better life for my son\nTake a trip and land in Dubai\nTake a trip and land in Dubai\n\n[Outro - Young Thug]\nI'm gon land in Dubai\nLet's take a trip to Dubai\nI see the daytime in the stars\nI took my bae to Dubai\nI took my homies to Dubai\nYeah, we was on the plane so long\nWe seen day and we seen stars\nAll facts", "image": "https://images.genius.com/717461618e785def35d07de6484b7ad4.1000x1000x1.png"}], "artist": "Young Thug"}