{"songs": [{"title": "Out of This World", "album": "LIVE.LOVE.A$AP", "year": "2011-10-31", "lyrics": "[Verse 1]\nGet money addict, I'mma get \"Money\" tatted\nMoney in the attics, money in the stashes\nMoney in the cabinets, stuffed in the mattress\nSafe full of guns, more money up in that shit\nTaz Arnold TI$A, Jeremy Scott Adidas\nMaison Martin Margiela, three strap sneakers\nRiding with a leecher, student and a teacher\nIt's money over bitches, no room for a skeezer\nThinking of a Lambo, Bathing Ape camo\nPlay with the money, turn Rocky into Rambo\nPatience is a virtue, life is a handful\nFriends, they'll hurt you, learned that from my grandfolks\nMe under a lamp post while I got my hands closed\nHaze to my brains like eggs, got it scrambled\nYeah I feel Rihanna and I understand Hov\nWhat you think I rap for? To push a fucking Land Rove?\nNow I'm looking back when you said I shouldn't rap\nSome slept on me, other niggas took a nap\nNow I'm in the basement, probably cooking crack\nGave you teaspoons full but instead, you took a cap\nThey say Tyga and Diggy but Rocky been Jiggy\nCurren$y from the Wiz ain't enough to get me home\nCan't really hate when they compare me to Drake\nCould have been J. Cole if I met J-Hov\n\n[Chorus]\n(Who dat? ASAP) But I'm fly like I never left\nYou's a lie, like fly without the letter F\nIf hip hop is dead, fuck it, let it rest\nReincarnated through me when she resurrect\nLong hair, Blue jeans, live on U-Stream\nHigh top boots like Pac in a Juice scene\nNo, it ain't a movie, diamonds in by new gleam\nDead tone cause the redbones is my new thing\n\n[Verse 2]\nNigga, I do things, let the coupe sing\nNiggas say I'm insane, Saddam Hussein\nNiggas still jokers, me, I'm on my Bruce Wayne\nFly kicks, my shit, yeah, I'm on that Liu Kang\nI ain't bragging but I do this, my shoes is Bermudas\nI'm bougie in that Gucci but my nudies is my newest\nAnd your foolishness and rumors, I give two shits\nI only hear the money, save the bullshit for the q-tips\nSwag is the coolest, my bitch is the rudest\nMy jeweler is Jewish and my wrist is the bluest\nAnd I get it poppin' on the block like Whoo Kid\nASAP standing on the block like the new kids", "image": "https://images.genius.com/5fb9bbbba50174ef41a0dd1f68902363.500x500x1.jpg"}], "artist": "A$AP Rocky"}