{"songs": [{"title": "Girls Gone Wild", "album": "Release Therapy", "year": "2006-09-26", "lyrics": "[Intro]\n10, 9, 8, 7\n6, 5, 4, 3\n2, 1 (uhh)\n\n[Ludacris]\nNever scared to be different\nThe impossible's put into existence\nFor in-stance, this is me\nWhat did you expect from the 5th LP\nGone for a minute now I'm back again\nBack to back, back to break backs again\nPut 'em in the back seat of the 'Llac again\nAnd rip off the Magnum packagin\nWhat's happenin, I'm lookin for some girls gone willllld (gone willlld)\nI'm just tryin to make these girls all smilllle (all smilllle)\nAnd I'm gonna make 'em dance, so I\nCan see 'em shake they ass, then I'll\nPut 'em in a trance, 'til I\nGet 'em out them pants, then I'll\nTake 'em to a level that they mighta never been befo'\nWe gon' hit the do' and then hit the flo' you'll get hit below\nI got somebody I want you to get to know - ME!\nFearless like Jack the Ripper\nHip-Hop needs help so I'm back to flip her\nFlip and run 'em back cause I'm back to stick her\nAnd throw up on the track like it's full of li-QUOR!\n\n[Hook: Ludacris]\nYou're feelin kinda warm, like you was havin (sex)\nYou're wetter than a storm, like you was takin (X)\nYour mood intensifies, it's time for a surprise\nSo baby close your eyes, are you ready for what's (next?)\n\n[Ludacris]\nYou lookin at rap's most consistant\nMan, whatever they can't do, I can\nWhat they wanna be in the future, I am\nA hip-hop mogul's right where I stannnnd\nGod damn I'm good!\nStretchin out the limits of music, I should\nDo it like I know and how only I could\nDo it like a pro and how only I woullllld\nStill I'm lookin for some girls gone willllld (gone willlld)\nI'm just tryin to make these girls all smilllle (all smilllle)\nAnd I'm gonna pour Patron, 'til I\nGet 'em in the zone, then I'll\nGet 'em all alone, 'til I\nMake 'em wanna bone, then I'll\nTake 'em to a level that they mighta never been befo'\nWe gon' hit the do' and then hit the flo' you'll get hit below\nI got somebody I want you to get to know - ME!\nL-U to the D-A-C\nTo the R-I-S and yeah that's me\nA gift to read minds, got E.S.P\nHottest thing on the go since PSP's\n\n[Hook]\n\n[Ludacris]\nWow, MC's I bake 'em\nPut me in a circle of homies and I'mma break 'em\nMighta took your brain a minute to process\nCould take the whole game a minute to top this\nJust figured out that I'm ahead of my time\nWith a flow so fast I'm ahead of my rhyme\nYour clock is off-beat, better set it to mine\nWith a six-year run havin a hell of a time\nCauuuuse I'm always lookin for some girls gone willllld (gone willlld)\nI'm just tryin to make these girls all smilllle (all smilllle)\nAnd I'm gonna get 'em high, 'til I\nMake 'em touch the sky, then I'll\nMake 'em wonder why, why\nWhy am I so fly, cause I\nTake 'em to a level that they mighta never been befo'\nWe gon' hit the do' and then hit the flo' you'll get hit below\nI got somebody I want you to get to know - ME!\nA millionaire with extra paper\nIf you haven't heard, go and ask a neighbor\nI'm like hot sauce with extra flavor\nSo put it on your tongue for your mouth to SAVOR!\n\n[Hook]", "image": "https://images.genius.com/57825a3687491fdf0e3c4c58b1b7aee5.1000x1000x1.jpg"}], "artist": "Ludacris"}