{"songs": [{"title": "The Wormhole", "album": "Gravitas", "year": "2013-11-02", "lyrics": "[2Pac interview]\n\"Niggas is tellin' me about this Illuminati shit while I'm in jail - that's another way to keep your self-esteem low, that's another way to keep you unconfident. And I'm putting the 'K' cause I'm killing that Illuminati shit. Trust me. These motherfuckers wanted to kill you, why the fuck they gonna tell Farrakhan, why they gonna tell the Nation of Islam, why they gonna tell this nigga in jail about the plan? How did he know? How'd it leak to him? Who told him? Who told him, the Pope? Who? Cause they like, 'the Pope' and 'the money', aw c'mon man, get the fuck outta here.\"\n\n[Intro]\nOh you niggas wanna get deep?\nNiggas wanna kick knowledge? Y'all niggas ain't deep man\nY'all niggas lost me\nSoon as you steady tryna tell me which rappers in the fuckin Illuminati\nThen I'm like, show me the proof right?\nNiggas start talking about the anti-Christ and aliens and shit\nSave the ghost stories for the kids nigga\nI'm a grown ass man. Let's go, let's go\n\n[Verse]\nYou can lead a man to a drink but you can't make him take a sip\nYou can lead a man to a link but that don't mean he gonn' click\nWhat's this? Y'all ain't really on no deep shit, I peeped it\nScared of a motherfuckin' secret, society\nAnd only bein' with people you agree with, you scared of a\nChalice, scared of death, only thing worse is your silence\nIlluminati's enlightened, the OWL see in the darkness\nMasonic roots still survive from the book of dearly departed\nEgyptologist and scholars, symbologists at the college\nWill all acknowledge that ancient Kemet is where it started\nWay farther back than the knights or the Rite of the Scottish\nYou need to wake up, no new Bugatti (Yes)\nMy enemy tryna stop me\nBut I don't stand a chance if I can't identify 'em properly\nIlluminati as we know it started in Bavaria\nYears before it landed on the shores of America\nThe mission: abolishment of government and religion\nThey were enemys of the state, and they was hated by the Christians\nThey was Poets, they was Scholars, early Illuminati was\nSorta like the students in Victor Hugo's Les Miserables\nThe modern day politicians would diss 'em, turning them into martyrs\nThis in turn inspired the founding fathers\nThe vast majority Masons who were the subject of the Illuminati\nFound this fascination the order was insipiration (Keep it goin')\nAnd ain't no disrespect to the masons\nBut you try to keep secrets then it leads to speculation\nOnly those in league with Satan need to hide infomation\nThat's how you catch a ride to your final destination\nWhere the proof, show 'em proof put it all on the table\nWhen the facts are intact, ain't no need for a fable\nGood versus evil is primitive\nReal life's more complex, what's your context?\nThey put the symbols on the dollar bill, the monument, the obelisk\nThey honouring Columbia the children of the colonists\nYou can trace it back to the root trace it back again\nIt's really just another case of stealin' from the African\nRacism and vanity justify the sale of flesh\nYou property like cattle or produce but are you still as fresh?\nPopulation control is real (word), you know the deal but still\nPerpetuate the cycle of violence, we known to hold the steel\nNo, I don't need no fuckin' chorus\nUsed to read so many books, thought I was a hoarder down at Borders\nLike Behold the Pale Horse or The New World Order\nBut you really don't know what you reading if you really don't know the author\nA lot of Satan worship is just government propaganda\nUnsubstantiated lies with no proof: a bunch of slander\nOf course there are forces against you and that's a fact\nDon't get caught in the distraction, it's bigger than any rapper\nThe truly oppressed ain't got the luxury of inventing a monster\nThe devil incarnate is much realer than the devil in concert\nWhat they doing so sinister, worse than any blood sacrifice\nYou can imagine, iller than any cinema\nThe Federal Reserve, the World Bank and the IMF\nHelping the poor get poorer you in debt until your dying breath\nFood, vaccines, humanitarian aid\nThey want control of the region, they really tryna get paid\nObey thy consumer make a product out of man\nWhere's the conspiracy? It's always been the plan\nY'all niggas scared of one world currency but still paying your\nTaxes, it ain't the Illuminati that worry me\nLack of spiritual energy, suicidal tendencies\nUnwitting soldiers in the armies of your enemy\nI'm leaking information so follow me down the wormhole\nSame reason that they called Bradley Manning a turncoat\n\n[Outro]\n(Man, we supposed to be brothas!)\nOh what you tryna get smart?\nNigga you tryna kick some knowledge?\nNigga fuck that give me your muthafuckin jewelry nigga\nTake that shit off\n(Beeping)\nOh you got a pager too huh?\nYou a balla huh? You a balla huh?\nGimme that muthafuckin' shit\nBetter me than the muthafuckin cops nigga", "image": "https://images.genius.com/54775ab17c42667fc0aa1f24ca5154f5.500x500x1.jpg"}], "artist": "Talib Kweli"}