{"songs": [{"title": "The Game Iz Mine", "album": "Creative Control", "year": null, "lyrics": "[Intro] [announcer talking]:\nWe're back at center court here at Reebok invitational brought to you by Jay-Z's S. Dot Carter tennis shoe set\n\n[Announcer #2]:\nThat's right John. I hear they're available June 18th\n\n[Announcer #1]:\nIt's a great match. (Out!) Just barely out. Things seem to be heating up on the court\n\n[Jay-Z]\nYoung. Turn the music up, turn the lights down, I'm in my zone\n\n[Verse One]:\nProduct of determination\nOne who made it through like the sperm who made him\nI represent strength like the black mom who didn't terminate him\nBut in turn gave him her all\nNow discussing barbershop back rooms\nOnline chat rooms and on the bathroom on the wall\nRecall\nI came from the bottom but the talent God gave him got him by\nY'all can hate him but that only made him stronger than\n[?] Hov end his sentence\nKnow you wanna roll when the Rolls comes 20 inches nigga\nStandard I speak Spanish to these hoes and they know\nDame peso, my peso is large than The Lakers' Payroll\nBut I'm the proud new owner of the Nets, no diploma\nNo regrets don't even talk about no Ruckers motherfuckers\nI am set like a tennis match\nSee where your interest at\nY'all don't get the big picture yet, nigga get\nGo get yourself a flat screen, not only on the rap scene\nLast seen on ESPN rapping\nBoy Hov got a hell of a pen\nHe don't put it to paper he just write in the wind\nI know you hate him now you wasn't likin' him then\nHis paper gettin' long like IBM\nEy bien\nIt's all good, I see them\nTryin' to make a little fame off the name again\nAdvantage Carter\nYoung fuck try to catch up\nYou know the score nigga, half a Billi, love\nHaha\n\n[Scratches]:\nS Dot talkin' off, come walk with me\nIf not, sit back and watch me do me\nJust side line ballers\nI thought I told ya\nIt's the undisputed champ-ion\nLookin' at them S. Dots it's about that time\nThe number one sellers since they first designed\n\n[Interlude] [Announcer talking]:\nMan, if things keep going like this...tennis will never be the same after June 18th!\n\n[Verse Two]:\nI'm ready\nLookin' at them S. Dots it's about that time\nTo do Michael Jordan numbers, the sneaker game is mine\nI didn't make 'em for the ball court I made 'em to shine\nSo you can score big when you courtin' a dime\nWhen niggas see me, shit they see the grind\nYou gotta be blind, you only see the shine\nI dropped them S. Dots and in record time\nThe number one seller since they first design\n50/50 you know how I handle mine\nA nickle for you, give me my dime\nTell Paul Fireman, I got 'em on fire man\nHe ain't been this hot since A.I. was signed\nNow a nigga talkin' to Kenyon Martin\nShawn Marion, shit I might be startin'\nS Dot NBA niggas\nWent from being in VA to signing NBA niggas\nI hurdled every hurdle\nEvery nigga that was out of a nigga's reach with my figure of speech\nOpen the door, with my niggas with me\nOpen it more for niggas I don't know", "image": "https://images.genius.com/619ad93c3cf9c827ec15407a81735374.500x500x1.jpg"}], "artist": "JAY-Z"}