{"songs": [{"title": "Tonight", "album": null, "year": "2018-07-15", "lyrics": "[Intro]\nM-M-M-Murda\n\n[Chorus: Juice WRLD]\nAre you feeling yourself tonight?\nDo you feel like yourself tonight?\nDo you wanna talk about it?\nOr put it up on the shelf tonight?\nWe got a lot to bite into\nGood thing I got overbite\nGood thing my love over nice\nYou put my heart over ice, right\nBut I don't feel like myself tonight\nTake a pill off my shelf tonight\nI think that I may melt tonight\nNo, I don't feel alright, over high\nToo much hate, over drive (Ya digg?)\n\n[Verse 1: Valee & Juice WRLD]\nLive on a Sunday, I think God want me to do that\nSqueeze in a lunch date with your boo, might be what I wanna do\nMy shoes cost 3 racks, can't use tissues 'cause I'm removin' the scuffs\nAdderall too potent, it takes two, yeah, yeah (Wake up)\nThese brand new Balenci's, I don't do layaway (Geek, geek)\nAnd these hoes suckin' me up, day to day (Ya digg, yeah)\nAnd she know I'm not gon' let her stay today\nShe can't stay here, dumb bitch, you can't stay here\nI'm in a straight A, still took too long, but I'm not missin' no exes (Straight, straight)\nMy bitch in a 2 door mini X, don't got more than two Xs (Two door, yeah)\nWe keep a gun on us, it feel like they let us (Keep a gun on us, they feel like they let us)\nDrippin' with no problem, like somebody wet us (Yeah)\n\n[Chorus: Juice WRLD]\nAre you feeling yourself tonight? (Feel)\nDo you feel like yourself tonight? (Do you feel?)\nDo you wanna talk about it? (Huh?)\nOr put it up on the shelf tonight? (Do you feel?)\nWe got a lot to bite into (Agh)\nGood thing I got overbite (Ya digg?)\nGood thing my love over nice (Ya digg?)\nYou put my heart over ice, right (Right)\nBut I don't feel like myself tonight (What else?)\nTake a pill off my shelf tonight (What else?)\nI think that I may melt tonight (What else?)\nNo, I don't feel alright (Feel alright), over high (Over High)\nToo much hate (Too much hate), over drive (Over drive)\n\n[Verse 2: Juice WRLD]\nHmm, knew it wasn't love\nDidn't know what it was\nThought you were on drugs\nYou say that I am, don't say shit, I shrug\nWho am I to judge? Who am I to judge?\nWho am I gon' love with you gone? Like, uh\nThis shit got me feelin' all alone like no\nIt's to the point where I would want to hit your phone\nEmotional, unavailable\n\n[Chorus: Juice WRLD]\nAre you feeling yourself tonight?\nDo you feel like yourself tonight?\nDo you wanna talk about it?\nOr put it up on the shelf tonight?\nWe got a lot to bite into\nGood thing I got overbite\nGood thing my love over nice\nYou put my heart over ice, right\nBut I don't feel like myself tonight\nTake a pill off my shelf tonight\nI think that I may melt tonight\nNo, I don't feel alright, over high\nToo much hate, over drive", "image": "https://images.genius.com/1ff8ab8d3ae5bb47f0797a87d42ddf66.1000x1000x1.jpg"}], "artist": "Juice WRLD"}