{"songs": [{"title": "2 Minutes & 21 Seconds Of Funk", "album": "My Soul", "year": null, "lyrics": "[Intro]\nYeah, yeah\nFuck all these niggas\nYou know what I'm talkin' about Wino\nYeah, yeah, yeah\nTwo minutes and twenty-one seconds of funk\nAnd I ain't no punk\nThat's right, that's right\n\n[Verse]\nA tisket a tasket\nThat's all you ask it\nSnap your cd and drop the pieces in your casket\nLike little Jack Horna', I'm still bendin' cornas'\nBuckin' shots on your block, I'm sippin' on Corona's\nUh, your McDonald had a farm wit' a six-fo on suicide\nSittin' in the barn wit' no alarm\nStraight up collected it, cool and calm\nCrowbar in my hand and my skeleton brick still works like a charm\nWho's the rawest?\nMy shit is flawless\nHad to be passin' out bruises\nLacerations and broken jawses\nEmcees wanna floss you better understand who's the boss\nBefore I do a Michael Jackson and \"Cut your shit off!\"\nPart of the penitentary still, penetratin' your grill\nI keep on keepin' it right, while you keep on keepin' it real\nI'll bring the treble and the bass to delapatate your waist\nCoolio's on the case, get yo ho out my face, fool\nLodi Dodi, I don't know karate, but I know ka-razor\nAnd none of y'all can't fade me\nI know you wanna try to play me\nAnd busta's wanna playa hate me\nI'm one of the dopest niggas out I\nGuess that's why they hate me\nCause I slang hits like niggas slang cavi\nI remain like khakis, I guess that's why they mad at me\nOn a record you might outgat me\nBut you can't outrap me\nMy shit is fatta'\nAnd yo shit need a little bit mo batta'\nFreestyle in unrestricted manner or method\nFree funk text readily selected, so check it\nUh, dip diver, socializer, I've been rockin'\nThese motherfuckin' microphones since nineteen seventy-niner\nAnd by the time that this little nappy head nigga retire\nI'ma be at the ripe ol' age of forty-eight or forty-niner\nMy shit is wise, CPT M.C. for hire\nMy name ain't Rick James but I'll burn your ass with a fire\nSo, what's your desire baby love?\nIs it hands wrapped around mics\nOr fingers wrapped around triggas?\nEitha' way it go I'm dumpin' and I'm dippin'\nStill tennis shoe pimpin', 40 Thevz in position\nFee-Fi-Fo-Fum, now nigga I'm a giant\nAnd yo ass is like Jack\nBut yo magic beans is wack\nSkills is what you lack\nI'm like a Benz, you ain't even like Cadillac\nYou mo like a Regal\nI'ma pit bull, and you's a Beagle\nI'm set to strangle hangin' emcee's at all angles\nAs their legs start to dangle\nDance around everybody like Mr. Bo Jangles\nLos Angeles, Compton, Long Beach, and Carson Hawthorne\nLivin with the Watts\nI'm sendin' out shout outs\nI used to drink Ol' Gold\nNow I just stroll\nStraight to the X.O. section of my neighborhood liquor store\nHuh, and you know what make me laugh, bitch?\nEven your mama want my autograph, autograph, autograph\nAutograph, autograph", "image": "https://images.genius.com/8b2afc0b2ec12b84597cab495ffdf0e1.600x600x1.jpg"}], "artist": "Coolio"}