{"songs": [{"title": "Things is About to Change", "album": "Prophets vs. Profits", "year": null, "lyrics": "Word.. we stand out, word\nWe don't wanna sound like that bullshit\n\n[KRS-One]\nLet 'em all be aware, not at all will I care\nYou gotta know it's about the flow when you comin in here\nNot how long is your hair, but how long were you here\nHow many dues you paid, crews you slayed, yeah\nHow many clubs you done rocked, f'real\nYou ever rocked outside with cats poppin they steel?\nYou fake like Ma-Ma-Ma-Max Headroom\nYou go from the bedroom to the studio back to the bedroom\nWe be on the front line, pavin the way\nFor you to do what you do, get what you get, say what you say\nFlip what you flip, play what you play at the Grammy's\nBut you don't represent our family, you a thief!\n\n[Hook: KRS-One]\nAll up and down the East coast\nTHINGS IS ABOUT TO CHANGE\nAll up and down the West coast, down in the South\nTHINGS IS ABOUT TO CHANGE\nAll up top and in North Canada, make some noise\nTHINGS IS ABOUT TO CHANGE\nAll my cats in London, Birmingham, Brixton, word!\nTHINGS IS ABOUT TO CHANGE\n\n[KRS-One]\nJoin the campaign to rearrange the rap game\nDon't look at me like I'm insane, the facts remain plain\nYou to blame, when you take it in vain\nThe gains and struggles and pains of those that already came\nFrom the beginning we tried to attain, the money and fame\nThat's not new to the game, it's still the same\nBut what seems to change is the loyalty\nRappers degrade hip-hop for a royalty\nIt's all about me and my click and we ballin G\nBut we fallin, stallin our callin to be free\nYou can't see, they're gonna judge our poetry\nIn two-thousand and twenty-three, where will your money be?\nWhere will your Benz be?  Your friends be?\nYour beginnin be?  Your end be?  Gently\nYou tell me to my face my style you envy\nBut behind my back you condemn me, you a thief!\n\n[Hook: KRS-One]\nAll out in Germany, Africa\nTHINGS IS ABOUT TO CHANGE\nWord up, hip-hop, join the nation, movin!\nTHINGS IS ABOUT TO CHANGE\nWord up, all them fake-ass whack rappers, word up!\nTHINGS IS ABOUT TO CHANGE\nTell 'em, go to they shows and let 'em know it's like this\nTHINGS IS ABOUT TO CHANGE\n\n[KRS-One]\nFor sure, it's the people that defend me\nYeah you on MTV, but did you know Ted Demme?\nWhat about Fab 5 Freddy, Red Alert?\nYou not ready.. ready.. ready.. {*fades*}\n\n{*ends with sound of glass shattering*}", "image": "https://images.genius.com/32bf9790e346029d7cf0897f83ab18fa.1000x1000x1.jpg"}], "artist": "KRS-One"}