{"songs": [{"title": "Onaroll", "album": "Pink Slime", "year": "2012-06-05", "lyrics": "[Intro: Mac Miller]\nYeah, I be eatin' that Pink Slime\n\n[Verse 1: Mac Miller]\nGot my chick makin' drinks with that cream, while I'm takin' sips of that lean\nLife ain't a bitch if you make a wish, you might break a record like me\nGot a mill at the age nineteen, but I may just give that back\nTo show my friends I could do it again if I started all from scratch\nAll I do is rap, run and tell them hoes that\nPipe like a plumber, It's nice with no rubber, she like when I fuck her like that\nThis raps what I do but I been fly, been fly\nYou're now inside of my sick mind, that Pink Slime, that Pink Slime\n\n[Hook]\nShe get good grades, suck good dick, what more could you ask for?\nBig ol' butt, love to fuck, what more could you ask for?\nFuck with drugs, fall in love, what more could ask for?\nWhat more could you ask for, w-what more could you ask for?\n\n[Verse 2: Mac Miller]\nGo a hundred miles an hour, ride around the city\nSmokin' on that Sour, couple bad ones with me\nUsed to rock all my brother's clothes\nNow designer brands, got a bunch of those\nGot a bunch of diamonds and a bunch of gold\nRidin' by the cops, I'm like fuck em' though\nHoes turn bent for that Hermes, I'm bustin' nuts on her fur vest\nMy life's like a circus, my heads a little unfurnished\nShe honor roll, she Dean's list, her ass round like Venus\nMy penis, her cleavage, that freaky bitch need Jesus\n\n[Hook]\n\n[Verse 3: Mac Miller]\nI'm switchin' up my flows, sellin' out these shows\nPop a bottle of Dom P, then spill it all on my clothes\nDamn Mac, your so grown, made a business all on my own\nThese labels callin' my phone, but I made this business all on my own\nGive me that bass bitch, I'm a bass head, let it break shit til it make a mess\nI wrote myself another blank check, I'm fuckin it', need a AIDS test\nWin the Heisman, I'm MVP, Dan Marino, you Sandusky\nMC Hammer, they can't touch me, Skateboard P, he be on that beat\n\n[Hook]", "image": "https://images.genius.com/5d1d6d26857b77f28648cd6d9b8ec479.500x500x1.jpg"}], "artist": "Mac Miller"}