{"songs": [{"title": "I Am The Man", "album": "B.o.B Vs Bobby Ray", "year": null, "lyrics": "[Chorus]\nI am the man, I am the man [4X]\n\n[B.o.B]\nGeah; up in this booth, so let me introduce\nMyself to all the haters that debate on what I do\nYeah, they in my face but I fade away and shoot\nI - beat up the basket that's the way I do\nYuh! Just like a bottle of vodka, I'm Absolut\nThe proof is in the product, I'm hotter, and that's the truth\nI squish the competition with the bottom of my shoe\nBut competition is none, so what am I to do?\nAnd I was worth it, yeah - since they birthed me\nBut now I've murdered these verses put 'em in hearses\nI, ate all the food on my plate but I am thirsty\nFrom open mics, the flashing lights, I learned it\nAnd what I learned is the game ain't for certain\nSo I live my life, I ain't worried\nWhile I fly my high behind curtains\n\n[Chorus]\n\n[OJ Da Juiceman]\nDown South hustlin, came up from nothin\nTrap in the apartment, with a controlled substance\nLivin with my momma, 'til I got busted\nDown on my dick, maybe start back hustlin\nMoto' crack workin, so I'm bailin money\nSick cell phone, distributin to the junkies\nMcDonald trap got me gettin to the money\nTurn the warm water then I count up the hundreds\nMurder by trap, hand it down for the zombie\nOne trap car and it was mainly for the junkie\nBeen a damn man ever since I was a young'n\nBlue color chain like it came from Yonkers\nCandy colored jewelry like my name was Willy Wonka\nCame to the club, truck tall like a Tonka\n\n[Chorus]\n\n[Bun B]\nI, am the man, makin jumbo\nKeep the game hot like a big pot of gumbo\nDo dumb shit, but don't be thinkin that I'm dum, bro\nWatch what you say, I hear it all like I'm Dumbo\nYou say you wanna rumble? Is your dumb ho?\nToe to toe you're bound to stutter or stumble\nTake your tough talk down to a mumble\nIt ain't goin down in my house, like Mutumbo\nBut it's definitely an honor\nTo light your scaff' up for the money like I'm a brawner\nBrother, brother I consider it a pleasure\nTo break you down to minimum measure, just for the leasure\n(The leasure?) Oh shit, my bad, I mean the leisure\nForgot who I was talkin to like I got amnesia\nDamn, back on the track again, the mack is back again\nGet the word out to them boys and tell 'em pack it in\n\n[Chorus]", "image": "https://images.genius.com/43ec171838184bac0a8baa89f9e6d0a9.600x600x1.jpg"}], "artist": "B.o.B"}