{"songs": [{"title": "Super Duper Fly", "album": "Gazing at the Moonlight", "year": "2009-10-27", "lyrics": "[Intro]\nUh, yeah\nUh, uh, uh, yeah, turn me up\nYo, just leave this shit up to me, pal\n\n[Verse 1]\nThey call me Hop, the king of this hip-hop\nThe moment that I hopped in the game it got hot (Okay)\nRappers thought that they would be ruinin' my plots\nIn this industry but homie I'm doing it voila\nSoon as I step up the flow, niggas know I'm untouchable\nWith the mic I'ma cut ya throat, guess it's 'cause I'm so rugged, yo\nI'm keepin' it real, fuck the dough\nI'm lying, homie, I love it, yo\nI'm a beast at this, I ain't really unleashed it yet\nObviously I have, I'm just bad at keepin' it secretive\nIf you do wanna piece of this, buddy you can receive it quick\nYeah, I know that you sayin' fuck Hopsin, he's a dick\nI give the sheets a clip of how I metamorphed the game\nI'ma wreck it off the chain, 'til my records often played\nSpread a web across ya name, make sure you stuck in it\nGrab ya belt and buckle it, time to end all this fuckin' shit\n\n[Chorus]\nI got some flows and they super duper nice\nJust gimme a dope beat and I'll be super duper tight\nLace it up, sell it for a super duper price\nWhy? Why? 'Cause I'm super duper fly\nHey, I'm so fly (Fly)\nLook at me flyin' away (Ooh)\n(I can fly, I can fly) Hey\n(I can fly, I can fly) Hey (I can fly) Uh-huh\n\n[Verse 2]\nNow the bomb is lit, flow is one word: astonishing\nBecoming different, changin' it up is what I’m promising\nYeah you got potential and all a that but you not as sick\nSomeone tell these low, down, and dirty fuckers who Hopsin is\nIt's been awhile, feels like five hundred years\nBut the apocalypse is finally here, a lot of these queers\nJust run around thinking that they hot but they cold as fuck\nWhen I drop that shit gon' be over and y'all gon' know wassup\nNiggas acting like that they hate to show love\n'Til they find out what I'm capable of\nI'm finna fizz up like baking soda, put so much pressure on you niggas you'll be forced to exit the game, 'cause my games is so tough\nBut you muthafuckas is probably gon' keep on coming back like roaches\nBut I have the potion, I'll eat you just like a pack of vultures\n'Cause I rap ferocious, y'all lack emotion that's needed in this\nI bees the business so what can I say, I just need to win it\n\n[Chorus]\nI got some flows and they super duper nice\nJust gimme a dope beat and I'll be super duper tight\nLace it up, sell it for a super duper price\nWhy? Why? 'Cause I'm super duper fly\nHey, I'm so fly (Fly)\nLook at me flyin' away (Ooh)\n(I can fly, I can fly) Hey\n(I can fly, I can fly) Hey (I can fly) Uh-huh\n\n[Verse 3]\nMy image doesn’t appear to be vicious\nBut just by hearin' me rip this\nI'm sure that you could tell I'm lyrically gifted\nIt's a conspiracy, is it?\nDefinitely, if you step to diss me\nI'll make sure you restin’ in peace, switch a mic, I wreck an emcee\nEvidently I'm known to killers, the devil in me\nYou can tell it's in me, my flow has been mastered elegantly\nIf you fellas tip me it's 'cause you feelin' the jealous envy\nNext I put more thought in it before you sell ya cd\nI wouldn't say that I'm the father of rap, but raps father died so I just adopted his ass\nSince none a y'all will take him in, watch what I'ma make of him\nThe nigga finna be the muthafuckin' hottest thing again\nY'all been treatin' the game wrong, man Hopsin ain't ya friend\nI ain't taking back none of my words, fuck who they offend\nY'all claimin' that y'all niggas from the hood and the streets\nThen why's the motherfuckin' game Hollywood as can be?\n\n[Chorus]\nI got some flows and they super duper nice\nJust gimme a dope beat and I'll be super duper tight\nLace it up, sell it for a super duper price\nWhy? Why? 'Cause I'm super duper fly\nHey, I'm so fly (Fly)\nLook at me flyin' away (Ooh)\n(I can fly, I can fly) Hey\n(I can fly, I can fly) Hey (I can fly) Uh-huh", "image": "https://images.genius.com/fb33e7a89a5050dc08095e21c220cc15.1000x1000x1.jpg"}], "artist": "Hopsin"}