{"songs": [{"title": "DSL (Da Special List)", "album": "Rejex", "year": "2012-09-06", "lyrics": "[Intro]\n(Damn, UH! I make the whole place warm then)\n(Damn, UH! I make the whole place warm then) I make the whole place\n(Damn, UH! I make the whole place warm then) I make the whole place\n(Hit you with some shit that make you niggas look deformed, now) Yeah\n(Damn, UH! I make the whole place warm then) Bust, bust one time\n(Damn, UH! I make the whole place warm then) Bust, bust two time\n(Hit you with some shit that make you niggas look deformed, now) Check\n\n[Verse 1]\nPuffing on that Eucalyptus\nYou can lift this dick in between your lipstick\nIf your eyes ain't low like Ralph Lipschitz, you dipshits\nEven the polices want me cause I rip shit\nPuffing that piff shit, Blow out five O's like the Olympics\nEvadin' on a RipStik yellin' \"Eat my dust\"\nWhen cars for breakfast and lunch don't get ate 'til dusk\nI spit it hotter than the days it don't get dusk 'til eight\nAnd when you born in a maze, you learn to duck those strays\nI know gang homies who wait around to buck those Tre's\nBut me, I chose to skate around, ya know, Bust those tre's\nThey get bucks, get paid, They get butt, get laid\nNiggas who ball and shine hard, they get cut, catch fades\nYou see, I was one of those kids who stayed up passed late\nSo when it's time for school, I got up but still passed, great\nGet passed- I forgot my line\nI do it nonchalant, Spit it through the wire like I'm Chaka Khan\nI been killing 'em, Your bitch been feeling 'em\nYa'll can't be serious like films Ben Stiller in\nNobody iller than him at the top of his adrenaline\nFlow sweet like cinnamon, Name a chick that I ain't swimming in\nUh, got flow for days, I'm sure to get paid if\nThey hate the price on son's life, it's sure to get raised\nBut there's no break when I got you pinned in\nSaid it uno, dos, tres then fin, I let him swim with like\nMad fishes, In the cut like mad stitches\nI know you mad bitches mad how my style switches\nSo, frequently be freaking MC's with these frequencies\nThese freaking trees got me soaring over freaking seas\nToo many freaking G's claim they make that deus pop\nPlease, the only thing you ever squeeze was your juicebox nigga\nAnd you know it, cause real G's don't have to show it\nGot your head in the clouds, big homie gotta get you focused\nBut know, it's all a part of the business, don't take it personal\nIt must be hurting you to know I could be merkin' you\nAt will, whenever I feel, this shit get realer\nFoe squealers give the beats out to the nigga Dilla\nI shine like crystals, Never held a pistol\nNever packed a tool, but that don't mean that I won't fix you\nWho is you? I don't give a F, I do it effortless\nTell your messengers, they can get opened like beverages\nDa fuckin' specialist\n\nI bet all you mother fuckers gonna remember this, yeah", "image": "https://images.genius.com/f19a23d547500fb2fba75dfe154e60cb.500x500x1.jpg"}], "artist": "Joey Bada$$"}