{"songs": [{"title": "Surviving The Times", "album": "Greatest Hits", "year": "2007-11-06", "lyrics": "[Intro]\nBut that's the whole, tragic, point my friends!\nWhat would I do if I could suddenly feel\nAnd to know once again that what I feel is real?\nI could cry, I could smile\nI might lay back for a while\nTell me what, what, what would I do if I could feel?\n\n[Verse 1]\nI was young, I was survivin' the times\nWaitin' for my moment, I was destined to shine\nLittle Ray had an NSX, I was hopin' I'm next\nWantin' bracelets, never hada rope on my neck\nUnless I was holdin' Taiyeh chain – Rest In Peace\nEven though that night you flipped on us, you warned us\nIf you came back and we still on the corners, we goners\nMovin' on to move your arm in your watch\nTo another time on the block\n‘Cause this 40 Side where they say shorty rhyme\nTragedy, he used to come through all the time\nI'm talkin' Juice Crew, not what the word define\nHe had a sister named Erin, for sure was fine\nThat was my first crush, I bought my first mic\nI wrote my first verse, I was about nine\nI was about mine, fantasize house buyin'\nMet Paul, he wore some big glasses\nHim and Melquan took me where G Rap lived\nI was happy just gettin' some answers\nI ain't even know what a record advance was\nI'm seein' hoes sex in the studio bathroom\nWith rap dudes, thinkin', \"Wow, she moved me!\"\nSame girl then right now's a groupie\nBack then she was like the star in a movie\nLarge jewelry and expensive Gucci\nNext stop, Paid In Full posse recruits me\nKnew they were some millionaires, their ropes were dookie\nEric B man lookin' like touch it, he shoot me\nYou see, every time Ra didn't show\nI get to record demos at attempts to blow\nI wonder, could they tell? How did they know?\nSixteen years later, here I go\n\n[Chorus: Nipsey Russell]\n\"What-what, what-what, what would I do?\"\n\"What-what, what-what, what would I do?\"\n\"What-what, what-what, what would I do?\"\n\"What-what, what-what, what would I do?\"\n\n[Verse 2]\nI'm with Akinyele in the street, tryin' to get us a deal\nG Rap tried to get us to sign to Cold Chill\nBut Fly Ty didn't have the contract we wanted\nClark Kent just signed Das, he didn't want us\nRussell said I sounded like G, the nigga fronted\nReef and Matty C offered me a little money\nShit a little funny, feel a little laughter\nRebel of Hip-Hop comin' through a white rapper\nMy boy MC Serch, nevertheless\nTook me to Columbia, back then CBS\nChris Schwartz, RuffHouse, he was the best man\nNow buggin' because the label had just dropped Def Jam\nCould you picture Russell needin' a check, man?\nBut he smart, he plotted a plan for Polygram\nLife is ill, again life's a movie\nThen the roster's Cypress Hill, Nas and Fugees\nBefore I sold records, no promotion\nThe rap world like, \"What's all this commotion?\"\nWent plat, mad bottles I'm toastin'\n20/20 hindsight, but how did they know then?\n\n[Chorus: Nipsey Russell]\n\"What-what, what-what, what would I do?\"\n\"What-what, what-what, what would I do?\"\n\"What-what, what-what, what would I do?\"\n\"What-what, what-what, what would I do?\"\n\n[Verse 3]\nInvincible, lyrical, miracle man, huh\nUh, but back to the matter at hand\n‘Cause 10 years ago we all strived to be 25\nSome cats didn't make it alive\nDated some stars but respect their privacy\nCopped mad cars, layin' back in the driver's seat\nHeld myself down, just steerin' the wheel\nHere I am, completed my whole record deal\n\n[Chorus: Nipsey Russell]\n\"What-what, what-what, what would I do?\"\n\"What-what, what-what, what would I do?\"\n\"What-what, what-what, what would I do?\"\n\"What-what, what-what, what would I do?\"\n\n[Outro]\nWhat would I do\nIf I could reach inside of me\nAnd to know how it feels\nTo say I like what I see?", "image": "https://images.genius.com/038790d40d68aaf12c0d9698f2196a23.1000x1000x1.jpg"}], "artist": "Nas"}