{"songs": [{"title": "Wonderful Life", "album": "Trouble Man: Heavy Is the Head", "year": "2012-12-18", "lyrics": "[Intro: Akon]\n1, 2, 3 - ooh yea\nOoh oh-oh...\nI hope you don’t mind, I hope you don’t mind\nThat I put down in words... how won-der-ful life is\n\n[Verse 1]\nHey TIP, lemme holla at ya...\nMaking yo momma proud, looking in yo daughter’s eyes\nKickin' it with your sons, trippin', never realize\nHow good you got it, been so wrapped up in yo losses\nYou couldn’t see the profits, could still be in the projects\nInstead releasing projects just poppin when niggas floppin\nSo you went back to prison, TIP? It could've been a coffin\nNow since we talkin', you been trippin' ever since I died\nAppreciate you missin' me but G, you still alive\nI’m lookin' down at you, and sendin' smiles to you\nI checked the wedding out, oh tell Tamika hi would you?\nTold you she would get you, that’s good cuz shawty ride with you\nKids getting big, seen King riding a bicycle\nSee Niq Niq drive a car, see Bubba big as you\nI see Domani rappin, and he’s spittin too\nLittle Deyjah beautiful, and Major supercool\nMy life is over with dawg, your life is good to you\n\n[Hook: Akon]\nAnd you can tell everybody, this is your song\nAnd you can tell everybody, this is your song\nI hope you don’t mind, I hope you don’t mind\nThat I put down in words... how won-der-ful life is\n\n[Verse 2]\nSit down, son...\nAnd listen to me son, and pay attention to me\nSeems like I’m the only one that you would listen to\nI never knew the time that I ain’t get to spend with you\nWould ever result in you making yourself miserable\nYou gotta let it go, it’s painful, I already know\nThe past is the past, just learn from the grown\nSo you got crystal wit you? And your sister Precious too\nI’m proud of you, did better than I expected you to\nAlthough I knew you was special when you was smaller\nThat’s why I was so much harder on you, knew you were smarter\nNot much convo to offer, I wasn’t much of a talker\nGreat to see you doin better than me, even as a father\nTaking care of yo mama, overcoming the drama\nYour life is wonderful son, don’t let em take it from you\nKeep living it to the fullest, treasure it, it’s a blessing\nBe thankful for all this beauty, when it’s over with forget it\n\n[Hook: Akon]\n\n[Verse 3]\nDamn...\nWhat up, Phil? So good to hear from you, we missing you (f'real)\nRemembering all of our conversations, daily reminiscing you\nThe hood, today they lost, can tell they don't know who to listen to\nToday I watch over Jeanette like she was my own and that could missing you\nI swear it’s so unfair that I’m right here and you up there\nI miss you so much now to the point I call your name but you not there\nNow I can’t rest and I can’t do shit off my mind, I’m so upset\nIt wasn’t your time to beat me there, broke my heart to see you dead\nShot with bullets that were meant for me, familiy's never forgiving me\nI know, but all I could do was follow your memory\nBut pops I thank you so much for leaving, I had to grow up\nSlanging crack on the corner ain’t quite the future you wanted for me\nWas it? And this pain I feel it never goes away\nDoes it? This load I carry get no lighter\nI grew up all on my own with a broken heart and a broken home\nTaught me everything I’ve known, owe you everything I own\nI must admit you raised a warrior, my life could be a story book\nHope you proud of me, didn’t graduate from college but\nThanks for listening to me, so long, had this bottled up\nTil we meet in person let’s keep speaking through my verses for life\n\n[Hook: Akon]\n\n[Outro: Akon]\nThis is your song...", "image": "https://images.genius.com/6c270013a37f81fa5c7f0606f8824d12.300x300x1.png"}], "artist": "T.I."}