{"songs": [{"title": "Gimme the Light freestyle", "album": null, "year": null, "lyrics": "Now I'm the newest member of the rockafella team\nAnd I'ma bring Dame and HOV mad more cream\nHooks galore\nLeave your city shook for sure\nAnd I'ma bring 'em back where Beans took 'em before\nFor the last time it's 'Kanye' and not Kane\nEverybody mispronouncing the name\nSo I spell it over and overlike my dog Fab in the game\nPick a bad chick up like a cab in the rain\nAll the girls that I had was the same\nCuz all they seemed to care about is what I had in the chain\nNevertheless, I'll say it again\nDrop the bad bitch off take a cab in the rain\n\nGo! Why she wanna say 'hello,'\nCuz my Rock-a-fello piece is all yellow?\nYeah! She tryna get nice\nGet a crib, get a ring, throw rice\nNo, keep that raggedy chick\nShe's so masculine and I ain't on that faggoty shit\nMy diamond ornaments help me fornicate\nGirls that look like they on a porno tape\nMy dogs is warning me 'bout girls is wanting me\nFor child support, this money born to make\nThey stick safety pins in my magnums\nSteal my condoms, I swear that's a problem\n\nIt's like gettin' robbed without a pistol\nFor 18 years the job is not an issue\nCuz I made a mil off instrumentals\nClassify me as husband potential\nNiggas ain't think I rhyme for real\nI got a 'You Hear It First' 'fore I signed a deal\nYeah, now it's time to bail\nCuz five years from now I'm tryna chill\nPeep the wordplay, I'm kinda ill\nI don't rap about guns dog I'm kinda real (I only rap about what I do and that 50 Cent's hot)\n\nThat's how I feel\nTo be down you must appeal\nTo the crew, we're rated R\nOC, OG Bobby Johnson's son\nAsk me \"Ray Ray is that your car?\nI seen MTV I know who you are\nYou did Takeover, do you got beef with Nas?\"\nI DID take-over the game, brought back the Soul\nGot tracks to go, got plaques that's gold\nPlatinum and gold, yeah that's the flow\nAll I, know, I gotsta blow\nAnd I don't play 'pause', I'm from Chica-GO", "image": "https://images.genius.com/70c6e506a91f6dabdd23cad304812ce3.533x533x1.jpg"}], "artist": "Kanye West"}