{"songs": [{"title": "Soundcheck", "album": "The Meth Lab", "year": "2015-08-21", "lyrics": "(Intro - Hanz On)\nOne more time, not again\nDo it again. Hanz On music. check check code red\n\n(Verse 1 - Method Man)\nMr. Meth check check\nHouse gang check check\nPlayers get ejected out, the game that’s a tec tec\nMayweather fight night homie, I’m still you best bet\nI’m like the homie 2 chains on’me\nProtect your neck, neck\nOpposites attract, I got you standing opposite, the mack\nCops pursuing, now I am swallowing the crack\nThis ain’t your role model on the track, simple fact\nThis is call of duty, watch my gun nozzle through the map map\nIt’s all about survival where we at\nThat’s the reason why my father kept the rifle plus a bible on his lap\nHallelujah, I am playing my position, karma sutra\nAnd anybody play me out position ima shoot ya\n\n(Chorus - Hanz On)\nYo it’s mic check, check\nGet the Henny bottles check check\nLock load, bout to body niggas holla check check\nHanz On, is he up & ready, holla check check\nBig fisk trigger finger steady, holla check check\nStreetlife, is he bout that feddy holla check check\nMeth man, is he rollin heavy holla check check\nHanz On music, i you with us, holla check check\nHanz up, if you bout that dollar, holla check check\n\n(Verse 2 - Carlton Fisk)\nTake it back to Gucci mocks, polo rugby Glocks\nWith 21 shots, I am very dirty money\nCarlo consigliere, an I’ma cross the Verazzano\nWhere they made a lucky man out of Charlie Luciano\nI cut from a different material\nI scratch off the serial numbers, for its time to get rid of you\nRevenge of Big Den, cocksucker, check check\nAim for the face, but his neck next\nPromises promises, well baby boy, this is not a death threat\nOrganized crime is back with black suits on\nYou know that its on, when i hashtag Hannibal voice (get your boots on)\n\n(Chorus - Hanz On)\nYo it’s mic check, check\nGet the Henny bottles check check\nLock load, bout to body niggas holla check check\nHanz On, is he up & ready, holla check check\nBig fisk trigger finger steady, holla check check\nStreetlife, is he bout that feddy holla check check\nMeth man, is he rollin heavy holla check check\nHanz On music, i you with us, holla check check\nHanz up, if you bout that dollar, holla check check", "image": "https://images.genius.com/fafd5b6184e352f00d35852ac8b31946.1000x1000x1.jpg"}], "artist": "Method Man"}