{"songs": [{"title": "Light Day", "album": "DIME TRAP", "year": null, "lyrics": "[Intro]\nHey, check me\nI ain't-I ain’t gon' go back and forth\nYeah\n\n[Verse 1]\nWent insane in the Nineties and then I bounced back\nCould of this year, lookin' like I lost my mind again\nNow, did I find it (No?)\nLife is all about timin’ (It is)\nGotta know the devil's in the details\nThat why when you doin' deals, I would wanna read the fine print\nI'm the king, nigga, no denyin' that (Uh uh)\nBut nevermind that, just a solid nigga tryna find solutions to the generation problem\nMake a couple hundred million dollars in the process (What wrong wit' dat?)\nAnd my mind set, it fluctuate from gettin' a bunch of paper to the revolution to a six shooter\nFuck the President and fuck politics (Fuck 'em, yeah)\nI’m just a family man, former dope boy\nSo you know I ain’t goin' for no bullshit, no\nThey stay cappin’ I make happen, shit\nMuh'fucka think can't happen\nThey shit talkin', I’m face slappin'\nNo convo, I'm talkin' straight action like the old days\nMet the forty cal, spin 'em 'round like the O-Jays\nHit 'em four time with the four-four bumpin' Jay shit, yeah\nNever tolerated disrespect, I ain't the one to play with (Nah)\nWay a minute, now\nCross that line; he wouldn't dare\nIn shark water, way deep out there, yeah\n\n[Chorus]\nI ain't never lived in the moment\nBusy tryna find another way to feel that rush\nMan, fuck the celebration, concentrate on gettin' bigger\nI'm tryna find a way to feed all these niggas\nCan you carry that load?\nWanna live that life?\nThe shit you doin', homie, I done all that twice\nThat's a light day\nThe shit you doin', homie, I done all that twice\nThat's a light day\n\n[Verse 2]\nOkay\nDeath before dishonor amongst us thieves is honor, okay\nWith y'all it's me and mine, with us it's we and ours\nOkay, okay, with us we hit a lick and bust it up\nYou hear the lick, kill your homie, and keep from splittin' it\nSee, treachery will never be cool\nWhatever we do, we straight up\nTuck no tail, take no shit\nConsider your decisions, the consequences and benefit\n'Fore you just go out, gettin' into shit\nGone be some real when the sentence hit\nThen a cold penitentiary, said you gon' be gone a quarter century\nSay, when they mention your name, nigga go to forgettin' shit\nYour co-defendant singin', was on some Boyz 2 Men shit\nFundamentals, move work and rental\nHustlin', business to attend to\nBroke shit, I wasn't into, couldn't do it\nOperation by any means make it outta the hood\nLove to see my momma doin' good, uh\nLove to see my niggas stackin' money, gettin' to it, shit\nBut when the light don't shine and the ice don't glow 'cause your window closed, you know\n\n[Chorus]\nI ain't never lived in the moment\nBusy tryna find another way to feel that rush\nMan, fuck the celebration, concentrate on gettin' bigger\nI'm tryna find a way to feed all these niggas\nCan you carry that load?\nWanna live that life?\nThe shit you doin', homie, I done all that twice\nThat's a light day\nThe shit you doin', homie, I done all that twice\nThat's a light day\n\n[Outro]\nThat's a light day, oooooh\nThat's a light day\nThat's a light day\nOooooooh, that's a light day", "image": "https://images.genius.com/762209f629de50995145f116f95b5ea9.750x750x1.jpg"}], "artist": "T.I."}