{"songs": [{"title": "Cheerz", "album": "Redman Presents... Reggie", "year": "2010-12-07", "lyrics": "[Ready Roc]\nI said I'm..\nI'ma.. great white on the mic, servin fishscale\nLivin life like I co-star with Denzel\nHip-hop been my life since kids meals\nLee jeans, label blocks and Big Wheels (uhh)\nEver since then I've been a FUCKIN problem\nFeelin like Bruce Wayne, and this is Gotham\nNow I got them haters watchin\nWaitin for my next hit like a nigga boxin\n(And the NEWWW~!) On this mic you can see I'm blessed\nSome say I'm the One like KRS\nShoutout to Clue, Flex and Doo Wop\nR.I.P. Big L, Pun, Biggie and 2Pac\nFlow so sick somebody give me a flu shot (achoo)\nI'm well done, overcooked, too hot\nA booth, ProTools and a MP\nThat's all I need to show you that I'm a emcee (yessir!)\nSo you can chase the fame, cause simply\nDifference is, you a Beamer, I'm a Bentley - dummy!\nNow wonder where I'd be without Funk Doc\nSo this toast goes to Redman and hip-hop (yo)\n\n[Hook: Ready Roc] + (Redman) + {Melanie}\nWhattup Big Unc? (Whattup nephew?)\nWHATTUP JERSEY? {Jersey, Jersey-ayyyyy}\n(Check mic one) Check mic two\nYEAH THEY HEARD ME..\nHow y'all feel? (Drinks on me!)\nNOW WHO THIRSTY? {whoahhh-ohhhh}\n(Cheers! This ones her for hip-hop)\nHI-HI-HIP-HOP\n\n[Interlude: Melanie Rutherford]\nThis is my life - this is my life baby\nWe gon' do it like this nigga\n\n[Redman]\nYo, watch out now I talk like a old man\nBut still got that UHH like Jor-dan\nCall in, anywhere I go it's CHEERS\nCause they yell my name like Nor-man\nWalk in, look cool\nFlow like the ink pen got Red Bull\nFeel like I'm school, back to the basics\nHandcuffin hip-hop, niggas start rapin (yessir)\nAnd I faced it, it's a new ballgame\nIt's like when +Baby Boy+ met Ving Rhames\nNow that's so appealin, the veteran\nStill trappin, I'm back in the building\nYeah I laugh when I'm yakkin to children\nBut it's hard when ya boy lackin a million\nI'm so brilliant, cause I work the Eastside\nAnd do the same damn thing on the Westside (West coast!)\nFor hip-hop I'mma die - you fuck with it?\nI'm O-Dog, I ain't lettin that shit ride!\nWhoever outside with a eardrum\nOld people, young people, here it come\n\n[Hook]\n\n[Interlude: Melanie] + (Redman)\nThis is my life (yo, watch out now)\nHip-Hop (yessir, yo neph' I got it nigga)\n\n[Redman]\nYo, aiyyo neph' you can tell I love hip-hop\nAnd me stoppin any time? I think not\nWhip, the opposite of a hard top\nSummertime, my rhyme's in your droptop\nYeah, the LP is \"Reggie\"\nI got the goods baby, I'm Don Ready\nReady, for any hip-hop freak\nEven white chicks want black in 'em like Pernelli\nYeah, the rap game is star studded\nIt's like the NBA, you gotta love it\n\n[Ready Roc]\nWhattup Big Unc? Watch nephew\nSell more records than Wyclef crew (ill)\nHaters watch me ball like the ref do\nAnd still can't get it right like a left shoe (hahahaha)\nI'm 'bout to bubble like a Lex Coupe\n\"What's my motherfuckin name?\" like I'm Big Snoop\nReady Roc hear the crowd scream\nNow my name hold weight like a triple beam\nWu-Tang showed me how to get the C.R.E.A.M\nI'm a microphone, I'm a microphone fiend\n\n[Hook]\n\n[Melanie Rutherford]\nThis is my life, this is my life\nHip-Hop, until I dieeeeee\nUntil I die, whoaaaaaa-ohhhhhh\nOoooo-hooo-hooooo\nCause this is my life, my life\nHip-Hop, until I diiiiieeee\nYeah yeah yeah", "image": "https://images.genius.com/4d4f1e8f8a259cccb95855c51037a514.600x600x1.jpg"}], "artist": "Redman"}