{"songs": [{"title": "Search 4 Barney (Freestyle)", "album": "Ill At Will Mixtape Vol. 1", "year": "2004-01-01", "lyrics": "[Verse One]\nEverybody move, everybody up\nSpit like a tommy gun, Tommy Chung\nOn a safari hunt for Barney Funk\nWhat chick next to get they punani punk\nRedman, the Brick Picasso\nTo the Mexicans I'm a ruthless vato\nOut in L.A. selling weed and tacos\nEven keep the Rasco inside the Waffle\nHouse; one shot turn power out\nI don't do biz I [?] out\nGet your weight up or prepare for the drama\nI'm never scared and y'all shake like Muhammad\nAli; I smoke the irie out in Raleigh\nBeef and broccoli make me slur like Ozzy\nBoy I'm grimey and still got my mojo\nY'all never rap like me, y'all flow So So\nAsk Jermaine if I'm Def, call the po-po\nHit the Japanese go-go out in Tokyo\nTell 'em Doc is in the fucking building\nKonichiwa, now give me all your shilling\nOops, the wrong country, I meant yen\nI beat up the bouncer if he don't get me in\nFour years ago I had the rims that would spin\nWhen they were alloy before chrome was built in\nYou don't know about it cause you wet behind the ears\nStill picking up your Easter clothes out of Sears\nBoo biddy blah blah talking all hard\nWhere I feel I'm the new nigga stepped in the yard\nD.O.C., get it C.O.D\nMade the book on how to be a real MC dawg\nI keep the shine, where my neck at\nI need a loan from Jay to buy the Nets back\nWhile you headcrack I'mma roll a double\nMy hands is hot I box with golden glovers\nWe bring the ruckus, you stay quiet\nI.C.U. make you look like you on a diet\nX-Box Counter Strike when I cross fire\nMy aunt still turn the TV with the pliers\nBoy I'm ghetto, y'all in denial\nYour weak ass style wouldn't make it one mile\nIn every [?] I'm the talk of the town\nCause with this mic I'm the crown of the underground\nEverybody get up, it's not a drill\nCause my kitchen cabinet filled with no frills", "image": "https://images.genius.com/269feb9a815361d5df2b9a0fae3113b1.959x948x1.jpg"}], "artist": "Redman"}