{"songs": [{"title": "Starsky & Hutch", "album": "Phenomenon", "year": "1997-10-14", "lyrics": "Uh.     (Ha!)\nUh.     (Ha!)\nUh.     (Ha!)\n\nUh.     (Ha!)\nUh.     (Ha!)\n\nYes y'all throw your hands up real high\nLet's see where the people in the world is at\nWhere you at shorty?\nWith LL, Busta Rhymes, Check it out...\n\nTwo big ballers keep the juice blending\nFuck Black Ceaser, I didn't like the ending\nWhy?, cos we two jiggy niggas always making\nToo many million dollar affilliations\nAbbreviation, LL, period\nI'm platinum every time, it's serious\nAeiyo, we serious when we experience millions\nHigh, rolling to the max, extra big willying\nUh, huh, with a third of my deposit\nI'll buy your whole crib plus the clothes in the closet\nTake your current chickens then take your ex-chickens\nShake it down for papers\nHey, now she jump shaking...\n\nGotta keep on making it high\nGotta keep on making it high (Yes, yes Mr Smith)\nGotta keep on making it high\nGotta keep on making it high\n\nWhy you ice-grilling, I'm far from a villian\nTwo hundred and twenty pounds, you're half shilling\nYo, ice-watery lyrics flow like water spilling\nYou know the rules of the giz-ame, milk and top billing\nAeiyo, I think your empty-ass cup needs some refilling\nLet me bust my milk on your back, watch you start illing\nYou know she's willing, cos' honey's a Star Trekker\nClothes coming off like jewels in front of Mecca\nAeiyo, cock diesel baby girl, bigger than Chubby Checker\nIn the process of the jolt she might feel the Black'N'Decker\nReason being, I work my tool right\nHandcraft the cake till it's baked just right\n\nGotta keep on making it high (Uh)\nGotta keep on making it high (Uh) (Yeah, that's right)\nGotta keep on making it high (Uh)\nGotta keep on making it high (Uh) (Just spark my L)\n\nJust lean left, lean right\nLean front, lean back\nC'mon, you gotta ride it baby\n(You gotta shake it, shake it all night baby)\nJust lean left, lean right (right)\nLean front, lean back (lean back)\n(C'mon shake it, just shake it)\n(C'mon shake it, just break it)\nYou gotta ride it baby\n\nBusta Bust      Mr Smith\nFlipmode        Yo, lets sing a little something for the song...\n\n*LL Cool J + Busta Rhymes together*\nLadies get up out your seat, seat, seat\nC'mon and chill with me, me, me\nC'mon baby, you know I'm audi\nFellas get up out you seat, seat, seat\nDon't be ice-grilling me, me, me\nUh, you jealous niggas - change your ways\n\nBusta Bust\nMr Smith\nWe on the track, I always spark the lah\nI always catch a contact\nAeiyo, stimulation make a nigga wig (wig) push back (push back)\nLike he gotta touch...\nA bottom here for Mencap\nHe went from Dreadlocks\nTo Ceasers\nNow he called\nCash\nBrothers shaving bums is nasty\nKid so watch that...\nI be the B, U, S, T, A, R, H, Y, M, E, S full of finesse, lyrically complex\nAnd I'm the double L, C dash O, dash O, L, period J my leers waiting on the runway, Bust\nYo, aeiyo, yo, I'm Mr You, God\nIs it the bashment?\nAeiyo, yo, yo, yes we is a rude bwoy\n\n*Together*\nMizzy gizzy busy for bissi\nMizzy kizzi let the rhythm dizzi\nJust a leeson for you sucker MC's\nCos y'all don't make no rhymes like these, period\n\nWord is bond\nAh man\nI had a good time working with you Mr Smith\nDo you think they'll ever recover?\nI have no idea, I'm seeniggas is in comas and concussions\nIt's ridiculous, word up - throw your hands in the air\nJust have a good time and wave them around\nThrow your hands in the air, word up\nMr Smith and Busta Rhymes get down\n\n*LL Cool J + Busta Rhymes together*\nLadies get up out your seat, seat, seat\nC'mon and chill with me, me, me\nC'mon baby, you know I'm audi\nFellas get up out you seat, seat, seat\nDon't be ice-grilling me, me, me\nUh, you jealous niggas - change your ways son\n\nAh man\nSplash a little bit of flossing on niggas\nAh man\nIn a happy and fun loving way\nYou know, splash!\nYeah, you know that\nLike a little bit of ice waters and shit man\nYou niggas need to chill down\nPut your shades on kid\nCool the fuck off\nPut your shades on baby\nAight?\nShine, nigga put them shades on\nNiggas leaning\nLeaning like they deformed or something\nHa, fix your neck\nYou like like Shaq in that commercial\n\n(Laughter to fade)", "image": "https://images.genius.com/5234ac9d05aa49d6d1b6cc3b58801cac.500x500x1.jpg"}], "artist": "LL Cool J"}