{"songs": [{"title": "My Young Niggaz", "album": "PRO ERA", "year": null, "lyrics": "[Produced by Kirk Knight]\n\n[Bridge 1]\nPlease enter my trap now\nThese niggas enter my trap now\nIt’s too late to back out\n\n[Hook]\nBet I could do this in my sleep\nMy young niggas stay with the heat\nFuck yo bitch, then hit the yeet now\nThese niggas lie through their teeth now\n\n[Bridge 2]\nThrough their teeth, niggas lyin’ all through their seat\nNiggas lying all through their teeth\nAnd that's the word on all these streets\nNiggas lying all through their teeth\nNiggas lying all through their teeth\nAnd that’s the word on all these streets\n\n[Verse 1]\nTell me, which man are you?\nDo we gotta sell dope, or bang them hammers too?\nDo you got to prove it all for the cameras too?\nBlack men, more like caged animal\nI’m from the Brooklyn Zoo\nWhere my dogs at?\nFor the pigs in the blue\nFor the project rat, in the trap with the snake, but they’re both going to bite you\nProbably won’t strike, but they goin’ try to\nBut they both gonna spite you\nGet a text from the [?], come fight you\nFollow me, follow me, follow me\nTo a fuckin’ death trap of my forced reality\nDon’t forget to paint my picture when I’m gone\nRead ‘em scriptures, read the motherfuckin’ Palms\nMight want to take this literature, with ya\nTo the after-life, where it's probably gonna hit ya\n\n[Hook + Bridge 2]\n\n[Verse 2]\nIs this the American dream? Or is this what the American seem to be?\nLooking at the messages that my heaven has sent really make life feel so evanescent\n'Til every single cent is spent every [?] better breath all this reefer in\nMaybe then they can understand it, we'll damn near damage every single aspect in plain\nEverybody coming all out in vein, when they screaming shit out they call out his name\nIt seems everybody want someone to blame, remembering 9-11, who forgot Hussein\nIt's a shame, cause I don't feel like calling no more\nI should go to Italy so I could roam some more\nAcross city simile, microphone control\nFeel it in yo' body probably go chromosome\nShawty head [?] give me dome or something\nStick it in till you feel it in yo' ribs or something\nSame spoiled brat in a bigger crib or something\nAfter all that I could say I lived through something\nFuck all that noise something big to come\nSay you loved the people what you ever did for them?\nHeater on my lap probably took the pig\nRep B-K like the second coming of BIG or something\n\n[Hook + Bridge 2]\n\n[Bridge 1]\nYou done entered my trap now, it's too late to fucking back out\nYou done entered my trap now\n\n[Verse 3]\nMy brothers banged, I was a scholar\nI knew them Crips but couldn't die for them blue colors\nThem niggas murking, they murking, young nigga put a little bit of church in\nPut God above my purchase, been the martyr before I was birthed\nThey say that I'm too young to be out thugging\nBut I know it's in my blood, cause all these niggas my cousin\nMight pop the gat if you budging, hating you gotta love them\nStaging up out in public, making loud noise with the bullet\nBut fuck it, fuck it, niggas still hugging the block\nContraband stay tucked it my sock, coppa mans they loving the watch\nMaybe cause it's [?] let us go, knowing that I'm out for my gold\nSold out shows across the globe until my story is told, nigga\n\n[Hook +Bridge 2]\n\n[Bridge 1]", "image": "https://images.genius.com/04d0b6e6105201632be0a45e1968ba75.1000x1000x1.jpg"}], "artist": "Joey Bada$$"}