{"songs": [{"title": "Highlife", "album": "Skull & Bones", "year": "2000-04-25", "lyrics": "[B-Real]\nI rolled you up like my Rizla\nCut you up, with my scissors\nYou wanna get us - yeah, the venom spitters\nYour style's trash: don't litter\nYou got the jitters the hardhitters\nNo quitters your soul quivers\nWhen you see the gats blazin, get out the street now\nThere ain't no use for you beggin to turn the heat down\nYou label me coldblooded\nYou wanna warm me up with hot lead the gat thudded\nYou can't cut it\nYou wack, but it's - no use your mouth shut it\nShootin arrows diamond-studded, and still budded\nYou got to love it, you better chase the paper all day\nSo you can walk down the long platinum hallway\nBut now the fools are minutemade;\nThey get played for a minute\nThen played out they never get back in it\nGun park I bring chalk for your body outlined on the floor\nYou got hit by the 4-4!\n\nChorus: B-Real\n\nYou're in the game called life, son - how you're livin it\nStreet corner kids growin up blowin up\nYou chase dreams you want the highlife, with the skylights\nBut in the end your soul's lost, you lost the shine right\nNever turn your back ever, on niggas true to you\nStand alone for the cheddar - and they'll be through with you\nThe highlife; yeah, the highlife\nThe highlife; yeah, the highlife\n\n[B-Real]\nYou gotta hang out with B. Reezy, and take it easy\nIt's gettin greasy, I had to learn how to beat me\nThat's when you go for dolo, and get your meal ticket\nAnd still kick it hardcore I'm runnin real with it\nNiggas getting softcore, the people want more\nHardcore shit that's why I give them an encore\nCurtains opened, you see the people applaud feelin it\nYou can't figure out the formula so you're stealin it\nCan't stand unoriginal cats with minimal\nSkills that's criminal - you fake bitches!\nYou're lookin for riches, in the wrong places\nThe faces of death look you in the eye cut off your breath\nWhen you fall feel your knees shatter\nThe bones breakin with your weak blatter\nPissin on yourself it don't matter\nDead weight, the bed waits for you on the set date\nDreams gone instead fate didn't hesitate\nTo put you away, close the gates now you're locked out\nYour life: cable, with all the porn channels blocked out (damn!)\nWhat you good for? Nothin, so be gone suckers\nHave a nice trip see you motherfuckers!\n\nChorus\n\n[Sen Dog]\nI live for the highlife, get my mind right\nFuck the fame, the game and the limelights\nFools that be out there tryin to duplicate\nBut they can't match the aura, can't impersonate\nSee the first things that comes to pass, is the blast\nOf the Cypress Hill weed funk blazin up a path\nYou can't help, but inhale and get strong\nYou need that good shit all up in your lungs\nI live fast, and keep energy in motion\nJah bless, so I feel I been chosen\nBut I know, (?) of he who conquers\nYou gotta come strong and sound off like thunder\nI check myself and make sure I'm comin real tight\nRhyme for my fam, the G's and the highlife\n\n[B-Real]\nThe highlife - hah, hah\nThe highlife yeah\n\nChorus", "image": "https://images.genius.com/af5085b228c3f1b6bc3a2ac39f6c6be8.1000x977x1.jpg"}], "artist": "Cypress Hill"}