{"songs": [{"title": "Rocket Ships", "album": "Prisoner of Conscious", "year": "2013-05-07", "lyrics": "[Intro: RZA]\n\n[Verse 1: Talib Kweli]\nMoving at the speed of a solution\nBleeding in the streets as we're breathing the pollution\nThey're saying that we need a revolution\nBut their passion is reduced to all-caps on a computer\nHey, every sixteen I make a sick scene\nBlood splattered all on you shirt like a Miskeen\nY'all niggas trippin' like mescaline and mixed greens\nMy flow cleaner than the Sistine, pristine\nYou going green like Al Gore with 'em\nI make algorithms that got Malcolm in 'em\nGod's favorite, I'm sick as a doctor's patient\nWe live in a cold world, my job is to rock nations\nMy occupation? Elation, a celebration of rebels\nRaise the levels and the decibels flagrant\nIt's too amazing how we be blazing, son\nOur flowers is the loudest, they crowd around us\nBut cower in the shadows of the towers, boy\n\n[Chorus: Talib Kweli]\nTake a tour with it, bake the raw\nWhere the beats so savage\nThat it's knuckles gon' scrape the floor\nMake a call, all the rocket ships taking off\nJah, Wu, gun music playin' when we facing off\n\n[Verse 2: Busta Rhymes]\nYo, I plaster the nation, causing evacuation\nMy manifestation got 'em patient from how I keeps it amazing\nSee, I'm the reason niggas need some training\nWhile I'm inflicting the pain and making it suitable for any occasion\nI'm very engaging soon as I'm awaken\nQuickly back you up and bag your bitch\nShe's reminding me of Sanaa Lathan\nRely on the hating while I'm smiling and waiting\nThat's when I embrace 'em\nIf you try to front, you'll be highly mistaken\nThe mightiest making of a classic, alrighty, I'll face it\nMy psyche is ancient and I'm hiring, so try me, I'm patient\nSorry, I'm lying, face it, I'm back for the taking\nI'm urgently giving niggas the courtesy of smashing their face in\n(Damn, can you cut his mic off?)\nSee how we got 'em buggin'\nCause they can't believe what we have in the making\nShit so historic, got me goin' for it while I bang the nation\nAnd do niggas greasier than a slab of bacon\n\n[Interlude]\nBitch, you still cooking this pork in this house?\nStop cooking that damn pork in this house\nThe hell going on in here?\n\n[Chorus: Talib Kweli]\nTake a tour with it, bake the raw\nWhere the beats so savage\nThat it's knuckles gon' scrape the floor\nMake a call, all the rocket ships taking off\nJah, Wu, gun music playin' when we facing off\n\n[Verse 3: Talib Kweli]\nThese rap niggas is bitches, nothing but suckers to me\nSacrifice myself for the music and let them suffer through me\nYour weak product is nothing to me\nI only feel effects when I fuck with Louis\nYep, I get buck in the studio like I'm Evil Dee\nPulling strings like the Muppet movie\nShining my light like Mos calling his mother Umi\nWho's the hottest regardless of who's flaming?\nWe ain't talkin' 'bout the best until you mention my name\nWho're you kidding? The truest spitting\nI'll break you like a mirror so it's clearer\nThat we don't believe in superstition\nThese new additions need supervision\nThinking that they can spit it in the booth like me\nWhat are you stupid? Listen\nI've been official, it's been official, I'm too consistent\nI make a claim cause I'm too official for euphemisms\nStaying in the cut like a new incision\nI'll put you on your ass like True Religion\nSo give it up for the truest living\n\n[Chorus: Talib Kweli]\nTake a tour with it, bake the raw\nWhere the beats so savage\nThat it's knuckles gon' scrape the floor\nMake a call, all the rocket ships taking off\nJah, Wu, gun music playin' when we facing off", "image": "https://images.genius.com/70850ebf7e5891df63851f2a86ecec08.936x936x1.jpg"}], "artist": "Talib Kweli"}