{"songs": [{"title": "Drippin (How U Luv That)", "album": "Purple Reign", "year": "2016-01-17", "lyrics": "[Intro]\nIf Young Metro don't trust you I'm gon' shoot you\nDJ EscoMoeCity, the coolest DJ on the motherfuckin' planet\nAyy, ayy, ayy\n\n[Chorus]\nGot a money counter on me, baby, how you love that?\nI'm a big timer, baby, how you love that?\nGot a money counter on me, baby, how you love that?\nGot bottles on me right now, how you love that?\nI'm drippin' on 'em, baby, how you love that?\nI'm drippin' on 'em, baby, how you love that?\nI'm drippin' on 'em now, how you love that?\nI'm drippin' on 'em now, how you love that?\n\n[Verse]\nI'm drippin' flavor, you just a traitor\nNo sports agent, I am a player\nI'm at the Four Seasons like I'm on vacation\nTryna count some paper everyday I wake up\nI can't get no sleep, I'm runnin' these bands way up\nLouboutins on my feet gettin' laced up\nHublot wrapped around my wrist, it's perfect timer\nHublot wrapped around my wrist, I'm tryna find her\nI got fine bitches on me just like Chyna\nHere's a chance for you to prove it girl, line up\nAin't no pressure, got a drapper bustin' diamonds\nIf you care about her, put her in designer\n\n[Chorus]\nShawty want a taste of the high life\nShawty want a taste of the high life\nTussin' up right now, how you love that?\nWe toastin' up right now, how you love that?\nI could pay your rent right now, how you love that?\nI could pay your bills right now, how you love that?\nI buy you a brand new car, how you love that?\nI'm standin' on the bar, how you love that?\nWe came in VIP, how you love that?\nWe came in VIP, how you love that?\nGot a money counter on me baby, how you love that?\nI'm drippin' on 'em now, how you love that?\n\n[Bridge]\nForeign automobiles, spinnin' these wheels, yeah-yeah-yeah\nTake the top off a seal, take the top off a seal and pour it\nMake me some Codeine I want it, make me some bars I want it\nI got a feelin' she want me like I want her\n\n[Chorus]\nShawty want a taste of the high life\nShawty want a taste of the high life\nToastin' up right now, how you love that?\nWe toastin' up right now, how you love that?\nActavis and red, how you love that?\nActavis and red, how you love that?\nAce of Spade Rosé, how you love that?\nAce of Spade Rosé, how you love that?\n\n[Outro]\nYou need that drip, you wanna drip\nI show you drip, I'mma get on that drip\nLike to drip, they like to drip\nYou wanna drip, you know we drip\nI'm drippin' on 'em, baby, how you love that?\nI'm drippin' on 'em, baby, how you love that?\nI'm drippin' on 'em now, how you love that?\nI'm drippin' on 'em now, how you love that?", "image": "https://images.genius.com/ec698cda4f9c3539728583373a72b3c6.500x500x1.jpg"}], "artist": "Future"}