{"songs": [{"title": "Murder Ink", "album": "2001", "year": "1999-11-16", "lyrics": "[Verse 1: Hittman]\nWhen darkness be closin' in\nI motivate, with the howlin' wind\nWith a list of chosen men, frozen in sin\nKnowin' that your end is beginnin', swift silent and deadly\nThere's no defending my plots, I know your every movement\nFor six months I watch\nCould've got you at your baby's mother's house\nEven at your down-low weed spot\nBut the backdrop, wasn't flattering enough\nI didn't want people gathering and stuff ​\nSnapshots of blood splattering from the snuff\nHere - puff this here, while I figure which way, to split yo' wig\nRight now you as nervous, as a Farmer John pig\nAs I dig into my tragic bag, take out the HK\nTwist on the silencer, insert the 30 shot mag ​\nBullet stuck to his brain like a magnet\nSkull in fragments, I leave the cleanup to Dragnet\n\n[Hook: Hittman]\nThis is anybody (Murderer)\nTo fuckin everybody (Murderer)\nNigga all y'all (Murderer)\nUh, uh, for real, you'll fuck around and get killed\nThis is anybody (Murderer)\nMotherfuckin everybody (Murderer)\nYeah nigga all y'all (Murderer)\nUh, uh, for real, you'll fuck around and get killed\n\n[Verse 2: Ms. Roq]\nPeeped all the stash drop and exchange of the dough\nLurkin through the turf, thinkin' how much it's worth\nGive 'em chase to the crib and yo he properly laced\nStepped out the car, put my steel, to the side of his face\nMurder is the fuckin Case, rob this nigga and shake\nThe fuckin spot cause in a few it's gon' be crawlin with cops!\nWho's the bad bitch now, you crept on, paid the piper\nWho'd've thought a sexy bitch could be a murderous sniper\nDetrimental to your health, should've learned yo' lesson\nBut it's too late nigga bye-bye, better count yo' blessings\nI been watchin you watchin me, yeah you ballin\nWas, nigga now you finger fucked and steady fallin\nA thug wit no love, but bitch niggas die fast\nThug niggas die young - oh what you thought you would last?\nBlast two shots to the dome, slide back to the pad\nAnd jack my nigga off, til his dick get soft\nResume the wifey boo shit, cause yo my man don't know\nThat his bitch is straight ill, servin ass with po'-po'\n\n[Hook: Ms. Roq]\nI'm a motherfuckin (Murderer)\nBitch this is anybody (Murderer)\nYeah nigga all y'all (Murderer)\nUh, uh, for real, you'll fuck around and get killed\nI'm a motherfuckin (Murderer)\nUhh bitch this is anybody (Murderer)\nYeah nigga all y'all (Murderer)\nUh, uh, for real, you'll fuck around and get killed!", "image": "https://images.genius.com/f9713af0f8164e90022b622002fda842.600x596x1.jpg"}], "artist": "Dr. Dre"}