{"songs": [{"title": "Do My Thang", "album": "I Can’t Feel My Face-Off", "year": null, "lyrics": "[Introduction: Lil Wayne]\nWell, alright, I can't feel my face, I'm going first\n\n[Verse 1: Lil Wayne]\nAnd my grill is ill\nIce bright white like Jaleel\nDid I do that?\nThrowing up signs, like I'm in a frat\nEagle Street, bitch\nSee me when you want to, find me, I'm the owner\nThem yellow diamonds looking like a fridge full of Coronas\nOwn us, you see through like cubic zirconias\nAnd me I keep it funky like pubic aroma\nHit em' with the Glock\nPut em' in a coma\nNow what that boy got? Umm, glaucoma (Haha)\nMy weed is stronger, I smell great\nI like promethezine, I'm in a snail race\nAnd my watch reminds me of '88\nBecause I got crack rocks in the watch face\nBitches stick to me like scotch tape\nPlenty colors in da chain nigga fuck Bape\nYea, bitch I'm cold like up-state\nSo icy like a motherfuckin' cupcake\nYa, these hoes feel my feng shui\nAnd wanna eat me alive I'm like an entrée\n\n[Hook]\nEverytime I do it, I do my thang\nDo my thang, my motherfuckin' thang\nAnd everytime I do it, I do my thing\nI does my motherfuckin' thing\nEverytime I do it, I do my thang\nDo my thang, my motherfuckin' thang\nAnd everytime I do it, I do my thing\nI does my motherfuckin' thing, ya dig\n\n[Verse 2: Juelz Santana]\nSantana bandana on tilt\nBack seat with the heat, I'm warmer than a quilt\nThey lookin at me like they drink spoiled milk\nMoney tall: Jack and Jill\nLike they sittin' on a hill\nIce on the neck of me, ice on the wrist of me\nIce in both hands bitch I'm lit like a Christmas tree\nDifferent color stones you could call it a mystery\nBig dookie rope, you would think they was lynchin' me\nChain on top of chain man I look like Mr. T\nI pity the fool the day he try to get with me\nFresh Prince, got banks like Hilary\nAnd I hit docks with the hickory dickory\nI make the girls run fast like Benny Hill\nRims go round and round you can call them my Ferris wheels\nPockets full of bank rolls, money long as train smoke\nAnd it come faster than a nigga fuckin' J-Lo\nI don't play games I shoot it up like Halo\nGot more paper than your job's got payroll\nStill I'm ghetto like no frills\nI clean the dirt out my nails 100 dollar bills\nCause\n\n[Hook]\nEverytime I do it, I do my thang\nDo my thang, my motherfuckin' thang\nAnd everytime I do it, I do my thing\nI does my motherfuckin' thing\nEverytime I do it, I do my thang\nDo my thang, my motherfuckin' thang\nAnd everytime I do it, I do my thing\nI does my motherfuckin' thing, ya dig", "image": "https://images.genius.com/7e80836d9d36eb85fb42f74377c9bcbf.500x500x1.jpg"}], "artist": "Lil Wayne"}