{"songs": [{"title": "Gotta Get Me One", "album": "Category F5", "year": "2017-11-20", "lyrics": "[Intro: Twista (Static Major)]\n(What happened to the slow jams in the club?)\nCategory F5, Twista, Static\n\n[Hook: Static Major] (2x)\nYeah, gotta get me one, gotta get me one, yeah\nSo I can creep up on her\nSo I can ease up on her\nSo I can get touchy feely (touchy feely)\nPut a dip in your back\nAnd get me one slow jam\n\nYeah, gotta get me one, gotta get me one, yeah\nSo I can creep up on her (creep up on her)\nEverybody's trying to get with somethin'\nCan I get one slow jam\n\n[Verse 1: Twista]\nWhen it come to ballin I do it with no hands\nLeft the Lamborghini home and took the Brougham (damn)\nI think the club finna close man\nBut I be the Twista; you know how I be doing it with the slow jams\nTake a look at the shawty chilling by the door man\nI'm really into her persona cause she don't be taking drama\nBut she thick; when I ask her where she get it then she say she get it from her mama\nSo I think I'mma (what)\nPop champagne cause the glass tall\nThe bartender said it was the last call\nI told her give it to me fast so we can slow dance\nAnd I can put my hands on her ass (yes)\nAnd she like it when I hold and grip, control them hips\nAnd you know I like it when she get low and dip\nPlenty swagger when she move slow and sip\nWhen they cut the lights on you gon roll with the Twist\nLookin so lovely in the fit you got on\nBut it don't matter if you was in a dress or you was in some jeans (nope)\nFragrance by Adidas, purse from another country, look at you, girl, you doin your thing!\nEverybody leaving with somebody and I gotta get me somebody so I be doin' what I do\nGotta get me one too; before the night go I tell the maestro \"that's your cue!\"\n\n[Hook]\n\n[Hook 2: Static Major]\nWhen I get on my way to the floor\nBaby, hold on to my shoulders\nGirl, I won't let you fall\nJust hold on to my shoulders\n\n[Verse 2: Twista]\nShe was lookin nice\nToo hot for the Cardi, yeah, she'll melt the ice\nLil mama kinda like Rihanna, she was livin the life\nShe be givin advice\nBut just to have an orgasm she gotta get a device\nWhat's that for?  Is your man a boy?\nCause he don't know how to give you what you're here for\nI think I gotta show you what the pilot gear for\nAnd the question is \"What I'll whisper in your ear for?\"\nYou nasty, love to be on top\nMad if I pop, if you miss the drop\nYou nasty, how you made me choke you\nTold me I can put it anywhere I want to\nSex so good she do it with no hands\nI met you while the DJ was playin the slow jam\nAs soon as we got into it (into the slow dance)\nIs the beginnin of when I was feelin the romance\nNow I be Twista with the super tight flow, one might go, that's so true\nI gotta get me one; before the night go I tell the maestro \"that's your cue!\"\n\n[Hook]\n\n[Hook 2]\n\n[Outro: Static Major] (2x)\nWhat happened to the slow jams in the club?\nThe DJs don't play them anymore\nI used to meet the ladies on the floor\nAnd wait for the DJ to play one", "image": "https://images.genius.com/ab06dbf0ce99f56ef5472a2ab819fd5f.675x675x1.png"}], "artist": "Twista"}