{"songs": [{"title": "You Can’t Dance", "album": "Radio", "year": "1985-11-18", "lyrics": "He man, I've seen ya, think ya rockin' it on the floor...\nYou look like a moron! Who let you in the door?\nTo put the question bluntly: maybe your feet's deformed\nThey should slap you in the teeth when you put your dancing shoes on\nYou can't dance!\n\nWhy don't you just nail your feet to the floor?\nHomeboy, what's the use?\nAnytime you wanna step inside a party\nFirst think of an excuse\nYou dance like a fat old lady\nNot sayin' that fat old ladies ain't nice\nBut every time you try to get one move right\nThe old lady done did it twice\nYou can't dance!\n\nYou big no dancin', disco disaster\nThe worst I ever saw\nThey should drop kick you in the neck\nAnd drag you off the floor\nIn every discotheque, I see you there\nIn the middle of the crowd\nLooking like you got eight or nine left feet dragging all around\nYou can't dance!\n\nTake my advice, don't move!\nYou'll never get the knack\nIf I danced like you I'd sneak out the party\nAnd wouldn't be coming back\nOn the floor you're a dinosaur, yeah boy, that's how you move\nYou look like Ralph Kramden or a Donald Duck cartoon\nYou can't dance!\n\nYou wanna come to my party?\nI wouldn't give you a chance\nYou tried to take breakdance lessons\nEnded up in an ambulance\nWouldn't it be funny if they put you on Solid Gold?\nYou dance like you got arthritis already\nWhat'll happen when you get old?\nYou can't dance!\n\nWhy are you so stiff?\nIs it something that your mother did?\nMaybe you grew up around \"can't dance\" people\nWhen you were a \"can't dance\" kid\nYou live in a \"can't dance\" house\nWent out in a \"can't dance\" car\nYour doofy \"can't dance\" father\nGot drunk in a \"can't dance\" bar\nYou take a \"can't dance\" bath\nPut on your \"can't dance\" cologne\nGo out to a \"can't dance\" party\nSo you wouldn't have to \"can't dance\" all alone\nYou can't dance!\n\nHomeboy, will you please get off the floor, you moron?", "image": "https://images.genius.com/cde9792f845cc4a69fd337bcff0683b5.1000x1000x1.jpg"}], "artist": "LL Cool J"}