{"songs": [{"title": "OOOUUU (Remix)", "album": null, "year": "2016-09-18", "lyrics": "[Intro: Takbar]\nPussy\nYou's a bitch ass nigga, nigga\nNever did nothing in your fucking life\nWhat's your resume, you's a male stripper nigga\nNone of the real niggas in Cali fuck with you nigga\nYou know I'm plugged in and you know who this is talking pussy\nYou always showed me the utmost respect nigga\nYou's a bitch nigga\nNever did nothing in your life how dare you play with niggas like us\nWhat the fuck is your resume?\n\n[Verse 1: Omelly]\nIts Osama Twin Llamas and I'ma fuck around\nWhy you worried about Meek? Sit your gay ass down\nActin' like you that nigga when you a fuckin' clown\nYou wanna rumble? I got the 30 on me right now\nSwing a punch, bop, bop, you goin' right down\nBarkin' up the wrong tree, it's time to bite now\nAin't no more coppin' pleas, it's on sight now\nTrigger finger itchin', fuck the wait, strike now\n\n[Break: Takbar]\nNigga, you was a stripper, nigga\nYou copped a plea in every beef you been in nigga\nYou can't be fuckin' serious\nYou bumped your fuckin' head, you joke\nNigga you's a fu-, I can't believe this nigga, man\nThat'll push up like this\n\n[Verse 2: Omelly]\nMurder, murder, murder that be the case\nMan this nigga outta pocket, man he softer than Drake\nDrum on my lap, I'm strapped when I hop out the Wraith\nSwing a punch on cuz, I knock a chunk out your face\nHad a glass pot Pyrex, cookin' the flour\nYou had a thong up you ass, male hooker for dollars\nI got enough clips, bitch, we can shoot up for hours\nGet it jumpin', hit the switch like a '64 Impala\nClip fully auto whole strip'll get showered\n\n[Break: Beanie Sigel, (Omelly) & Meek Mill]\nOne phone call I'm in LA in three hours\nThe bully, please don't bring me out of retirement\nAye Mac chill let me do my thing I got him\nOoouuu, ooouuu\nOoouuu\n(You was a stripper)\nPhilly shit\n(Nigga you trippin'\nYou was a stripper)\nB Mac in the building, Omelly in the building\nDeuce in the building\nDC in the building, Yay in the building\n\n[Verse 3: Meek Mill]\nI can never lose, chess or checkers make a move\nDrippin' in them jewels like I just got out the pool\nSkinny nigga sittin' on that money like the jews\nOnly time we make it to the TV if it's the news\nWe was tryna make it out them trenches, you dig?\nYoung niggas trappin' out them benches, you dig?\nYou gon' be a felon or a witness, you dig?\nAll this money, murderin' is senseless, it is\nFuck 'em and tell 'em if I ain't gon' feed 'em\nAll this money I'm gettin', prolly ain't gon' need 'em\nNiggas said that we beefin', prolly ain't gon' see 'em\nI'm just pushin' them buttons on 'em and they gon' leave him\nDurk checked you, Thug sonned you (what else?)\nFif dropped you (what else?), Mac oned you (what else?)\nStrippers turned rappers look what we come to\nYou a faggot, my lady'll never fuck you\nG-A-M-E, please don't tempt me\nFour pound with the lemon squeeze like simply\nRidin' dirty sippin' on the eighth like Pimp C\nLand at the Clearport, truck my Bentley\nComin' down Sunset, I'm not done yet\nI've been to Bompton, you don't run that\nShout out to YG, where my bloods at?\nCall my eses, where them guns at?\nI'm with them 40 niggas, I'm never with 40 niggas\nPromo your album they got you making up stories, nigga\nStripper to rapper, rapper to stripper you corny, nigga\nA sucka\n\n[Break: Meek Mill]\nThat's what you do to sell you album\nYou only gon' sell like 15 thousand the first week\nI put a mil' on it\nDC4 on the way\nHeh, y'all niggas is crazy talk to the D's I got lawyer money\n\n[Verse 4: Meek Mill]\nYou was signed to a rat, you a mouse nigga\nI'm sittin' on that money like a couch, nigga\nMake me crumble you cookie, you Girl Scout nigga\nMake me move to Calabassas, buy a house, nigga\nCalabassas, Mac 10 the masks\nWaiting on that red Bentley just to fly past us\nHollow tips ripple through the window, shatter glasses\nMac just landed at the port he want some action\nCatch you at the drive-through, hit 'em and wax 'em\nDesert eagle Sigel hit your body, slide you backwards\nMake a nigga moonwalk, talkin' Michael Jackson\nI don't let my goons talk, they be only clappin'\nMenace to society, got guns by varieties\nTeardrops on your face, you ain't got no bodies\nSon you like you Ray Ray, nigga you ain't Bobby\nTreat you like you Day Day, Deebo on a Friday, pussy\nSomebody touch me then somebody die\nBeat the body, throw a party like its Mardi Gras\nI'm from Philly, nigga, all we know is homicide\nThrowing millis tryna make a nigga momma cry\nBrace yourself double barrel pipe\nDo him like Caine's cousin Harold at the light\nWeigh like 170, nigga, I don't fight\nDo it with the guns or we can do it with the knife\nDo this shit for fun, we could do this shit tonight\nCause we was never cool, nigga, you was just 'aight\nNew Jack City me and Chino on the bike\nI'm sittin' back with the uzi that's your life\nI'm gone\n\n[Outro: Takbar]\nPussy\nThis ain't about East or West neither nigga\nIts about niggas and bitches, power and money\nRiders and punks\nNigga you been a bitch nigga\nYou don't do nothing that we do nigga\nYou don't get down like we do\nWe applying pressure on you bitch ass nigga\nYou know what I'm saying\nNiggas already know man Tak, Bossilini, a underboss", "image": "https://images.genius.com/4f4a8c69a4e08b3c545c1cc99cda2666.500x500x1.jpg"}], "artist": "Meek Mill"}