{"songs": [{"title": "Transylvania", "album": "Goblin", "year": "2011-05-10", "lyrics": "[Intro]\nLeft Brain, Wolf Haley\nGolf Wang, Free Earl, uh\n\n[Verse 1]\nGoddamn I love women\nDaydream about penis being in 'em\nMeet them with a big grin with a Mac-10\nRope, katana, and then I skin 'em\nAll beige suit made out of white women\nWith the red lipstick, dancing to John Lennon\nWith the red splattered jeans made out of blue denim\nThey can catch me in the spot where the sun don’t shine\nBitch don’t mind me, shake your hiney\nThe only motherfucking Wolf here that spit venom\nYou’re a bad bitch with a real good kitten\nAnd I got the appetite of them fat black women\nWolf Gang in this bitch with a bunch of rats with 'em\nLookin' like the holocaust with Supreme hats with 'em\nI am tryna get Miss Piggy by the motherfucking hairs of her chinny chin chin\nUmm, what’s that? The cock of a black dude\nMad cause his daughter got the swag of a vacuum (aww, fuck it)\nI’ll take her to the back room dungeon, fighting and punching\nAnd now the slut is under the fucking assumption\nThat I will be fucking and munching her muffin\nCunt will be bleeding, but that’s not from the time signature of the month, umm\n\n[Hook]\n(It’s because) I’m Dracula bitch\nDon’t got a problem smacking a bitch\nKidnapping, attacking, with axes and shit\n'Til I grab them throats and start smacking them shits\n(It’s because) I’m Dracula bitch\nDon’t got a problem smacking a bitch\nKidnapping, attacking, with axes and shits\n'Til she decides to take Dracula’s dick\n\n[Verse 2]\nGoddamn I love bitches\nEspecially when they only suck dick and wash dishes\nCook and clean and grant my wishes\nAnd make me and the Wolf Gang sandwitches\nTransylvania crypt let's take a, tour\nBitch try getting through that black trap, door\nKeep yelling and working them vocal chords\nAnd that’ll be more of a reason that you'll get slapped up, for\nIs that Ford trunk's comfy? (Fuck you!)\nFuck me? No, fuck Buffy\nThat little bitch keeps trying to hunt me\nJumping over gates, what the fuck she want from me?\nShe keeps sending me garlic\nHow many times I gotta tell her I’m allergic\n(I like your cape) Oh this Bathing Ape cape?\nBitch, I got it for a bargain at the neighborhood Target\nFangs are sharp and I hope you know\nThat all I really want from you is that throat\nI can’t eat pussy cause I might leave cuts\nThen there’s blood on my sheets, but that might be a plus\nOn the channel, a fucking animal, leaking like pairs of candles\nBitch, is it hard to handle?\nI don’t want a bride, I just want bone marrow\n\n[Hook]\n(It’s because) I’m Dracula bitch\nDon’t got a problem smacking a bitch\nKidnapping, attacking, with axes and shit\n'Til I grab them throats and start smacking them shits\n(It’s because) I’m Dracula bitch\nDon’t got a problem smacking a bitch\nKidnapping, attacking, with axes and shits\n'Til she decides to take Dracula’s dick\n\n[Outro]\nBite her in her fucking neck, bite her in her fucking neck\nBottom of the fucking lake, bottom of the fucking lake\nCall my gang of wolves and bats, call my gang of wolves and bats\nIt’s a full moon tonight, and these hoes ain’t acting right\nIt’s because I’m Dracula bitch, (swag, swag, swag)\nIt's because; Left Brain, Wolf Haley, Free Earl, Golf Wang...", "image": "https://images.genius.com/fd29e400e2d672aa992f9fda170e9959.640x640x1.jpg"}], "artist": "Tyler, The Creator"}