{"songs": [{"title": "I’m Wit It", "album": "Pimpin’ Incorporated", "year": null, "lyrics": "[The Game]\nUhh\nHey yo $hort, they ain't ready for this one nigga\nYeah\n\nWhatever you want I got it, ammos, cars and chips\nYards of sniff, flood the boulevard with bricks\nHard or soft, raw get flipped, B.I. slash O.G\nKnow about hoes, broads and strips\nHatchback I stuff 'em all with dicks, nasty nigga\nWhup mo' ass than Steven Seagal in flicks\nLike, it's a Spike thing, I do the right thing\nSmack ass silly, bitches call me Sweet Dick Willie\nCause my cum, tastes like Now or Laters\nSo it attracts like strawberries and crocodile gators\nOn backs like a scout for the Raiders\nTurn wifes into hoes so if your girlfriend blow, then she go\nIf she ain't legal, she can't mob at Teddy's\nWe can't bump and grind and I ain't Robert Kelly\nSo act like the broad in _Belly_, face down\nAss up, that's how I like to fuck\n\n[Chorus: unknown female]\nWhatever you want I got it\nIf there's money to make, let's spend it\nWhatever you need, come get it\nAnd it feels so good to me - I'm wit it\n\n[Too $hort]\nI'm lovin life, what'chu want me to say?\nI'm tryin to tell the whole world, they goin dumb in the bay\nThey don't care if you don't like it, it's fun anyway\nWe smoke bomb in the bay on a sunny day\nIt's rainin buds, comin straight from Humboldt\nGot a blunt rolled, a trunk full and still want mo'\nIt's not enough, light it up and get fucked up\nYou got a rat in the hood, 'bout to get sucked up\nYeah bitch, shut up and swallow the nut\nOr turn around, and let me shoot it all in yo' butt\nCause I'm a freaky nigga when I get these sluts\nAnd you a nasty girl, you like to lick these nuts\nSo when you call my phone and say pick me up\nCause you want me to shove this dick in yo' gut\nI'ma do it, fold you like a 50 dollar bill\nFuck you real good and say, \"Bitch how's it feel?\"\n\n[unknown female]\nFeels so good to me {*3X*}\nFeels so good to me - I'm wit it\n\n[someone]\nAy 'Face man why don't you let these punk-ass niggas know what time it is\n\n[Scarface]\nI don't wanna let these niggas know what time it is\nBecause if I let niggas know what time it is\nThen niggas is gon' tryin to use they clocks to try to set they time to mine\nDig that\n\n[The Game]\nUhh\nHey yo $hort, they ain't ready for this one nigga", "image": "https://images.genius.com/b06c57cf2cfd6ca6f1870496190e3b04.700x700x1.jpg"}], "artist": "Too $hort"}