{"songs": [{"title": "The Other Side", "album": "Dedication 3", "year": "2008-11-14", "lyrics": "[Intro: La the Darkman]\nAww, yeah\nL.A.D.!\n\n[Verse 1: La the Darkman]\nI'm all about that cheese, swiss or mozerella\nMuenster, Colby, American or cheddar\nWhen it come to robbery, nobody do it better\nNotorious L.A.D., fresh Coogi sweater\nThe cleanest, lyrics is the meanest\nUnderstand my English, nigga I'm a genius\nIce like a snow cone, writin' in my iPhone\nWent from sellin' crack to sellin' ringtones\nStraight out the projects to million dollar homes\nInside the Carter, cookin' 36 zones\n36 O's and I break them all down\nIn and out of every trap, all through the A-town\nThe Embassy A.M.G, Young Money merger\nI'm a Young Champ Like Ben Roethlisberger\nS.S. Chevy with the big block engine\nRims and paint cost me a whole pension\n\n[Verse 2:Jae Millz]\nI don't need none but my niggas and enough weed to go around\nA tinted sedan, some grams and a loaded pound\nFuck what another nigga think of me\nI'm thinkin' multi-millions, he thinkin' Gs\nNigga please, get your mind right\nFuck tryna be fresh, get your grind right\nCuz I'm like, so in another league\nI throw my pitches at different degrees\nAnd I spiril my pigskins at different speeds\nAnd I hit threes cuz at different times I release\nMy shot cold, nigga, I'm hot, don't be tight cuz you not\nJust be happy I'm lettin' you breathe\nI'm the good, I'm the bad, I'm the devil, I'm Jesus\nIt's Young Money, bitch, the game needs us\nGudda Gudda, what it is nigga?\nKidd-Kidd, Chi, get it how you live nigga\nMy nigga Mack Maine just left the dealership\nAnd Weezy just ripped the drop Phantom so they feelin' sick\nDiamond rings, diamond chains, royal suites, private planes\nPalm trees, big change, I can't complain\nI made a promise to myself that I'll never be have-not\nNigga fuck being broke, shit\nBefore that day come, I'll A.K. stamp ya\nWhen there's beef, I'm in the center like Tyson Chandler\nFuck what you heard, in the booth I goes off\nLike the lights if you ain't payin' us the third\nAnd you already two months late witcha bill\nClown nigga you's a lame, bitch nigga, I'm Millz\nYoung Moola\n\n[Verse 3: Gudda Gudda]\nIf you didn't, now you know\nIt's the million-dollar nigga with the million-dollar flow\nIcicle chain got a million dollar glow\nQuarter mill for the gang if you tryna book a show\nTemp plates on the Bentley, ridin' through the 'jects\nGot a pocket full of money nigga, Hand on my tech\nI'm demandin' respect, I'm a man to respect\nDisrespect your man, put my hand 'round his neck\nIts no other than Gudda Gudda man\nStill bout my money nigga, fuck another man\nI'm on the paper chase, all about the hustle man\nI be climbin' through your window like I'm fucking Bruh Man\nLook, I'm Shady/Aftermath, put your head in a scope (Interscope)\nA bank roll with bucks is what these young niggas killin' for\nThe game dirty on the streets tryna deal Yayo\nFifty clips at his hat leave a peeled potato\n\n[Verse 4: Lil Wayne]\nI call my nina bay like San Diego\nGet me twisted and I'm a turn into a tornado\nAnd all my riders ridin' like a Winnebago\nYou stay, but I'ma let that A.K. go\nRawer than a qualo, shoot you like Halo, give ya ass a halo\nThese bitches walk around actin like they J.Lo\nBut man, I remember when these bitches was just \"hey, ho\"\nHey ho, how you doing? Me, I'm doing every fuckin' thang\nSmokin' them dykes, I'm on that Mary fucking Jane\nThis shit so Tom and Jerry to Lil Wayne\nAnd you MC's are just milk and cherries to Lil Wayne, ha\nAnd bitch I'm greedy\nBut if I keep eatin' you rappers, I'll get sugar-diabetes\nSweetie, I'm a different species\nI'll crush your two fingers into a million pieces\nWhat the fuck do I be thinkin?\nKill, kill, murder and Benjamin Franklin\nYour girlfriend is into them gangstas\nAnd me being a gangsta, I get into your girlfriend\nI stay still when the world spins\nAnd ain't nobody flyer than the Birdman\nYou heard me? You heard him? Him being me\nAnd we are better than all you y'all bitches, niggas, hoes\nEnemies, foes, threes, twos, ones\nBut these dudes won\n\n[Outro: Lil Wayne]\nWon\nThe South, for real\nShout out the Dunk Ryders\nSpcial shoutout that red flag\nAll the time\nYoung Moola, baby", "image": "https://images.genius.com/9f2858c8807f57c343ffb883015a0a14.220x220x1.jpg"}], "artist": "Lil Wayne"}