{"songs": [{"title": "Panorama City", "album": "No Shame", "year": "2017-11-24", "lyrics": "[Verse 1]\nI built this empire off rebellion\nNiggas seem to have a problem with what I be sellin'\nAll I got is dope and I just make the world inhale it\nBitch, I am the GOAT, you're blind as fuck if you can't tell it\nI dropped out of school so I could focus on my mission\nPrincipal is callin', Mama sayin' that I'm missin'\nI check in to homeroom and then after that I'm ditchin'\nStart off bumpin' Dirty Dozen in my fuckin' system\nMom and Dad would look at me and knew my mind was missin'\nI look in the mirror, my reflection was my bestie\nThat's just how it was since crystal took my nigga Jesse\nIt's me against the planet, motherfuckers gon' respect me\nShit, but I ain't trippin', got a mighty reflex\nStronger like I'm a feisty T-Rex\nMobbin' the streets with a white T 3X\nThe mic is 'bout to be how I relieve stress\nNiggas blowin' up left and right and it might be me next\n\n[Pre-Hook]\nMotherfucker, look me in the eyes\nAnd you can see it's no surprise\nThat I've been livin' like there isn't a tomorrow\nAll I got is grindin' on my mind\nMiddle finger to the sky\nFuck the planet or you'll end up with your heart broke\n\n[Hook]\nIn Panorama City, nigga!\nYou know where to find me at\nYou know where to find me at\nIn Panorama City, nigga!\nYou know where to find me at\nYou know where to find me at\nIn Panorama City, nigga!\n\n[Verse 2]\nBefore the paper\nWay before these groupies ran the world and caused the vapors\nI was rockin' fat Osiris’s out with the skaters\nVandalizin' spots until security would chase us\nYoung and fuckin' clueless as the homies that surround me\nDoin' hoodlum shit they got me locked up in the county\nFights are poppin' left and right, these motherfuckers rowdy\nThey gon' whoop my ass if they find out I'm from the Valley\nMy whole crew is cocky, homie, nobody could stop us\nChillin' on Tobias Avenue sippin' horchata\nShootin' pellet guns at cars until we saw the coppers\nOnce we got confronted we would lie and say it's not us, gotcha\nA decade later I only grew worse\nNiggas say they hate me, that's cool, I hated you first\nThe truth hurts, I guess it's just a few perks\nFrom all my crazy mood spurts\nThe power of my mind can fuckin' move earth\n\n[Pre-Hook]\nMotherfucker, look me in the eyes\nAnd you can see it's no surprise\nThat I've been livin' like there isn't a tomorrow\nAll I got is grindin' on my mind\nMiddle finger to the sky\nFuck the planet or you'll end up with your heart broke\n\n[Hook]\nIn Panorama City, nigga!\nYou know where to find me at\nYou know where to find me at\nIn Panorama City, nigga!\nYou know where to find me at\nYou know where to find me at\nIn Panorama City, nigga!\nYou know where to find me at\nYou know where to find me at\nIn Panorama City, nigga!\nYou know where to find me at\nYou know where to find me at\nIn Panorama City, nigga!\n\n[Outro]\nFind me in the P.C., baby!\nFind me in the P.C., baby!\nFind me in the P.C., baby!\nYou know where to find me\nIn Panorama City, nigga!", "image": "https://images.genius.com/83e2e79cbd5dfc092f858f9c8505579b.1000x1000x1.jpg"}], "artist": "Hopsin"}