{"songs": [{"title": "Innermission", "album": "The Incredible True Story", "year": "2015-11-11", "lyrics": "[Verse 1: Logic]\nSometimes I fantasize about traveling space and time\nI think about specific moments that I could rewind\nNot to redo it, but relive it, I could give it one more go, abide\nAnd truly understand the deeper things\nThat I don't know about\nNow take a trip with me and vibe\nI'm on this interstellar mission, is you down to ride?\nHold up, I know this innermission feeling like the tribe\nLife is beautiful I'm so lucky to be alive\nI'm gonna take this moment right now\nHere and school them people\nI know deep in my heart everyone is created equal\nI truly wish that I could see the sequel of our people\nTruly wish that I could, check it\nNow, when I hit the road and tour the world\nI see like different light, this music shit just ain't the world\nBrothers and sisters from different mothers and misters\nAll different colors and creeds all come together for me\nBoy, I'm blessed to be free, uh\n\n[Chorus: Lucy Rose]\nThis is our time\nStill I'm looking back, let me rewind\nThis is our ride\nDon't let me lose my faith, let me rewind\n\n[Verse 2: Logic]\nDoing 70 on this highway\nOn the front of this bus, I'm busting my mind open\nHoping these lyrics will keep me coping\nOn the grind like copin', no time to bring the dope in\nBut this Nyquil got me feeling lit\nIt's been like 3 months since I've been home\nSometimes it feel like forever just how long I been gone\nYeah, you know that's the shit that I been on\nYou know I love it, feel like there's never enough of it\nLet me bring 'em back\nChilling, watching Tarantino, we know I've been on it forever\nMy endeavor like a feature film\nStep into the realm of the realest, do you feel this?\nI'm in it, my limit the chillest\nLet me bring 'em back, yo\nYeah, I woke up early on my born, 25, it's a blessing\nProgression everyday, lesson's got me stressing\nBut I'm testing, reminiscing\nWhen I would listen to my intuition\nAnd now I made it, resurrecting\nYoung Sinatra I created, I'm elated\nIt seem like everyone's somehow related\nLetters back and forth from my homie\nThat's locked up in prison\nDoing 14, it's been 5, I know my heart's with him\nI've been so busy, it feel like forever since I hit him, man\nI think about how I wasn't shit when he went in\nWhat if the tables was turned\nAnd I was the one that been in, damn\nHe said he's seen me in the magazine\nHe said he's seen me on Fallon and Kimmel\nThat's been my dog from the kennel\nI never thought that out the millions watching, he was one\nIt makes me reminisce about the times when we begun\nSkipping class with all of my homies\nOn a constant search for who I was\nI rarely went to school, they wonder why and that's because\nMy situation at home was alcoholics and drugs\nI never graduated but I made it to the summit\nDon't get me wrong, so many times\nI thought that I would plummet\nFelt like I didn't have the heart and couldn't seem\nTo stomach all of the beef around my way\nI mean, I never wanted to live a life\nWhere all you're truly living is a lie\nI knew I always wanted more\nAnd so they wonder why, I said they wonder why\n\n[Chorus: Lucy Rose]\nThis is our time\nStill I'm looking back, let me rewind\nThis is our ride\nDon't let me lose my faith, let me rewind\n\n[Skit]\nSo what do you think about space?\nUm, space is called the galaxy...\nDo you know planets?\nWhat are—can you name some planets off?\nYeah, there's a one named Saturn and Earth\nMars—and the planet Paradise\nYou've never been there before?\nUm, no. I was little a long time ago with my mom riding in the coolest ship. My TV showed us where we are in space—\nBut there was droid ships everywhere...\nWell, thank you for your time, sir\nI appreciate the interview...", "image": "https://images.genius.com/b9b6844bdd8ebfbe10235ad54d885cfa.960x960x1.jpg"}], "artist": "Logic"}