{"songs": [{"title": "Real Niggaz", "album": "Malpractice", "year": null, "lyrics": "[Intro: Icarus]\nYeah, now, now—is you motherfuckers ready for this? (C'mon)\nDo you really think you ready for this? (C'mon)\nDo you know that you ready for this, huh?\nWe gon' see if you ready for this\n\n[Verse 1: Scarface]\nI be the street sweeper nigga\nQuick to leave your whole block shook and shot at\nFrom fuckin round with the mi-dack\nEleven, twenty-four, act 47\nFuck who's standin around them get close up and down and\nI done came here to get brains\nShoot you twice in your stomach\nThen leave your boxin shorts full of shit stains\nYou're bitch-made, you ain't a gangsta you a sucker ass\nThese niggas scared of your bark {*barkin*} but bitch I touch ass\nAnd bust back, what's that? It's Face-mob in effect\nWith Icarus, Reggie, Jamal and Treach\nI told you that talkin wasn't shit to me\nSo bitch be more specific when you spit for me\n\"It ain't shit to me,\" you a ho in fifth degree\nA discharge from a dick disease\nYou lil' maggot, part time thug for a faggot\nPlastic-ass chump, you don't want no static\n\n[Hook: Redman]\nReal niggas—louder\nReal niggas—louder—louder!\nReal niggas—yo\nReal niggas\n\n[Verse 2]\nYo, yo, yo\nIt's Funk Doc—I thought you knew\nPPP in the back, and they parkin to, jump\nThorough borough, Bricks, ashy elbow kid\nI fuck chicks off Elmo flicks\nMy tape is off safety, tongue the gun\nMouth to barrel, I spit, it numbs the front\n(So, what'cha—what'cha want?) Yo, my boys is beasty\nWe grew up untamed, unemployed, and eatin'\nYou sharks in the water, avoid the deep end\nWe only fuck chicks that enjoys the beatings\nYoung Ike Turners, disco infern-ers\nConcentratio camp, nobody turn up\nI roll up a 'X' that came with kits\nLeave you with \"Nightmares\" Dana Dane was with (niiight-marrres)\nI can train yo' bitch, with a chain and whip\nIt, blow the block down while I change the clip\n\n[Verse 3: Icarus]\nYo, don't approach me wrong, little kids call me Smokey-mon\nCause the blunts that I light set off smoke alarms {*beep beep*}\nAnd I stand on the corner 'til my coke is gone\nNiggas wanna get they ice picks, poke the don\nBut they know I got a gun big as Oprah's arm\nAnd I know a old lady that'll choke they moms\nA attitude, that's what I don't walk without\nNigga I'mma time for it, you just talk about\nIc' is the man, and I never been to Japan\nGot a Japanese bitch with my dick in her hand\nThis is the plan, I'm about to get in the van\nGo and get rid of the man, I done did it again\nSkunk I blow, then off to the trunk I go\nPull the pump out slow, dump out fo'\nI'm the nigga that the streets raised\nI'm the nigga that'll make 3-ways outta nigga PJ's\nThe nigga, that'll smack the shit out the DJ\nIf he don't give Icarus shit a replay\nPoker flush, y'all niggas joke too much\nAnd my gun got cancer, it smoke too much, we\n\n[Hook: Redman]\nReal niggas—louder\nReal niggas—louder—louder!\nReal niggas—yo\nReal niggas\n\n[Verse 4: Jamal]\nFirst of all you gotta have balls unlike some who act hard\nI was real ever since I shot out my pops black balls\nI'm real, I can sense danger and tap calls\nI'm real, I feel when haters wanna clap 'Mal\nI look a nigga eye to eye when I speak\nI'm transparent, I can see if you a killer or a freak\nOr a bitch that'll do anything to get rich\nOr a snitch that'll drop dime on the click\nOr a fake, that'll rather see me at my wake\nOr a Jake tryin to infilitrate, give me a case\nI'm real like, BITCH, get the fuck out my face\nI'm real like let me stick my dick in ya mouth, give you a taste\nI'm a real nigga if I don't get no bigger\nI'm five-five, still knockin out tall niggas\nWe real niggas plottin on dummies with tall figures\nReal niggas hands on forty caliber triggers\nBullets hummin, real like Redman's fifth comin..\n\n[Verse 5: Treach]\nTrigger Treach\nBastards blunts, buddhas bullets black gats is the lingo!\nFuck a jolly jingle, old bitches break for Bingo\nChristmas time I crack yak and Kris with Kringle\nGettin funk from nymphos and scratch my nuts witcho' single\nWho's the gay scratcher minus the rap masters\nName is Kay, with the gay G after\nMy thugs on the street with the heat, listen to me\nSee them diamond D.M. medallions—snatch! You give 'em to me\nMally G's a part of me, Icky slips his ownself mickies\nIn crowded armories, fuck with Redman you're a dead man at the robbery\nYou'll be (?) Adebisi greasy put him on to me, fuck that\nI'm a throwin' flames fanatic, bashin' brains, come at it\nBeat you with the shit that they used to frame the attic\nYour skank-ass go voo-doo, poodle-wig wearin rashy\nRusty and trusty, musty-wack-nasty", "image": "https://images.genius.com/109a9fb9c91fad29c7f632fb053de1bf.1000x1000x1.jpg"}], "artist": "Redman"}