{"songs": [{"title": "Got it Twisted (Remix)", "album": "Amerikaz Nightmare", "year": "2004-03-30", "lyrics": "A-A-A-A-A-A-A-A-lchemist\nYeah, once again, and we have - the remix!\nYeah, uh-huh, what we got?\nTwista I see you my nigga! C'mon now\nYeah yeah, yeah, uh-huh\n\"Oh my gosh! The music just turns me on!\"\n\n[Havoc]\nYo.. yo.. ain't no party once we crash the party\nShorty, I'm only here for one night\nMeet me in the lobby take a sip of this get nice\nI'mma get you bent, but fuck it it's only right\nThe martinis, them Belvy's, the Hypnotiq's\nTurned you out, wanna see what's up in your closet\nYou got a man, that's cool, I just wanna be friends\nI ain't tryin to get hooked like phonics\nWe on the low so you won't be spotted\nFront window tinted so you safe in the cockpit\nFools wild in the club, I just play the wall\nMy niggas pray and pray for my downfall\nMan how I scoop them broads and get that groupie love\nOne look and your chick is dug\nY'all ain't real, y'all some homo thugs\nPlease don't make me show you what I snuck in the club, yeah\n\n[Hook: Havoc]\nY'all niggas got it twisted, huh?\nThat liquor up in you, you charged\nThat truth come out when you drunk\nYo' ass won't make it to see tomorrow\nY'all niggas got it twisted, huh?\nThat liquor up in you, you charged\nThat truth come out when you drunk\nYo' ass won't make it to see tomorrow\nWe step up in the club with one thing (one thing)\nOn our mind, that's leave with something (something)\nGet rid of that ring, get rid of those cuffs\nWe about the.. girl\nWe about the.. girl\nWe about the.. girl-girl (\"The music just turns me on!\")\nWe about the.. girl\nWe about the.. girl-girl\n\n[Twista]\nThey call me Twista but homey don't get it twisted\nFuck specifics, or the ballistics hollows'll get you rifted\nFuck with the gifted, take a look at what my machines did\nThat I got from my niggas from Queensbridge, you ain't seen shit\nTake a shot of my liquor, then I pull on the trigger\nRollin in with the Mobb Deep, and we steady gettin thicker and thicker\nFor the lords and the gangsters, thugs and the killers\nWe got too many toolies floatin between us, you can't get wit us\nIt's that killer Twista in the house, and I'm\nQuick to put the pistol in your mouth, and uh\nGot pounds like got seventy-five to cop twenty\nBut I'm only spendin sixty, the rest is new Glock money\nDistribute 'em to the click that we steppin up in the club\nWhere the freaks pop that ass on the dick, showin us love\nTryin to get out of line, you gon' get hit with the biscuit\nYou got Seagram's in front of you, so get twisted, don't get it twisted\n\n[Hook]\n\n[Prodigy]\nIf you really wanna party with P\nPut your hands where my eyes can see\nAnd shorty right there she come with me\nAnd I hope she got friends, cause we Mobb Deep\nNo bullshit, Timb boots and gangster clothes\nWe don't follow trends - we set those!\nYou see us gettin dressed up, ain't nuttin\nBut some fresh white on whites and that ol' folks\nInfamous a new label\nDon't confuse our shit with no other labels (fuck up outta here)\nCome through that bitch just force, and lay shit down\nWe don't gotta send people, we bang for real\nYou won't know if I did sum'n, I won't tell\nOr rap about it songs, cause that's goin to jail\nBut come fuckin with me, that's goin to hell\nYou rap about me? That's how I can tell!\n\n[Hook]", "image": "https://images.genius.com/b2028bc5336e13af3d91919e570f79e6.1000x1000x1.jpg"}], "artist": "Mobb Deep"}