{"songs": [{"title": "I’m On the Mic", "album": "Life", "year": null, "lyrics": "(Intro)\nWhen you least expect it\n(This is just one style)\n\n(Verse One)\nWe back up in this piece like yeast to bread\nUnderground you gotta find me like an Easter egg\nNo need to beg, I hit the club hard on the red\nWhile you check for CDs I'm sellin' books instead\nI travel the country by car, by foot and leg\nWhat's worse than being behind is being ahead\nProphetic visions of President Jeb\nFive storms hit Florida on his head and nobody said\n\"What's the meaning of this? It's like God is dead\"\nIn the minds of the people hanging onto a thread\nYou gotta go where your heart is led\nI spit truth but some cats, they just got the hardest head\nAs you can see, I'm artist-led\nI take it to the black, to the green, and to the darkest red\nI write, recite and of course go off the head-top\nKnowledge Reigns Supreme, man -- don't forget that\n\n(Chorus)\nKRS and I'm on the mic\n(Class is in session, so you can stop guessin')\nKRS and I'm on the mic\nThis is just one style\nKRS and I'm on the mic\nKnowledge Reigns Supreme Over Nearly Everybody\nKRS and I'm on the mic\nListen\n\n(Verse Two)\nHere's the mission, plain and straight\nWe gotta nurture and develop what we create\nHip-hop is our activity on the planet\nToday it's just an album; tomorrow they examine it\nIn the future, someone's crammin' fast\nCause they want at least a B in their hip-hop class\nI ain't even askin' you how\nIf our ancestors built nations, why you ain't buildin' one now?\nTechnology is not civilization\nCivilization is not about the tools that you're making\nYou have an opportunity, at a new stop\nTruly living hip-hop is a chance at a new park\nYou can play a new part: Develop new DVDs, new books, new art\nOpen new food marts with hip-hop food charts and food carts\nPlaying 2Pac while you shop (Do it)\nWhat's the sense of being a recording artist\nAt a recording company for a year or two\nIf after the third or fourth year they can't even hire you?\nIn fact there is really nothing there for you\nIf your life is not a can of goo\nHip-hop is not a product; hip-hop is me and you\nWhat I spit will see you through\nI'm freein' you with knowledge of G-O-D in you\n\n(Chorus)\n\n(Verse Three)\nFoot soldiers, let's go - we got this\nThe freedom to be really you that's what hip-hop is\nWhat can we really do? Reach for the top, kid\nThose that seek the bottom they shot stop and lock, kid\nWe the inevitable, most credible\nAnd most are leaning back with the terrible squad\nHere to beat knock hard, this is the real truth\nEverything I spit be backed up with real proof\nWelcome to the underground\nDon't look for me in the mainstream, this is a whole 'nother sound\nSound set we rock music in the streets\nIn the schools and over the Internet\nFeel it yet? You ain't hear me yet\nYou ain't really ready to get near me yet\nY'all fear and fret\n\n(Chorus)", "image": "https://images.genius.com/12162bd5dc20dab4c0cbb67190522d80.500x493x1.jpg"}], "artist": "KRS-One"}