{"songs": [{"title": "Fuck My Brains Out", "album": "Independent’s Day", "year": "2005-06-28", "lyrics": "[Ingrid Smalls]\nRight there, right there?\nRight there, right there?\n\n[Royce Da 5'9\"]\nIt goes up, down, side to side\nThat's how a real bitch ride, ride\nWith the whole thing inside, side\n(Ahh, ahh) Don't be shy\nBoom, show you where the liquid is\nBlow and your lipstick smears\nLick that tip that meet mine then\nYou might meet my liquid kids\nYou don't gotta pay your physician big\nAnd put that glaze on your glistenin chin\nWhat? Baby I'm listenin\nI know what your favorite position is\nI know I'mma lick that if I have to\nHit it like a pack of zigzag wrappers\nHit it from the back then give it back to her\nIn the mouth then give a bitch a tic-tac after\n\n[Hook: Ingrid Smalls]\nI, wannnnt you, fuck my brains ouuuut\nI, wannnnt you, sweat my weave ouuuut (mmm)\nI, wannnnt you, fuck my brains ouuuut (just like that)\nI, wannnnt you, sweat my weave ouuuut (yeah!)\n\n[June]\nNo mistake, June the great\nFucked the most hoes at Michigan State\nTechnique should be in the textbook\nLove to have the ones that like to look\nAt their reflection, while we're sexin\nWanna smoke while we fuck? No question\nBitch yeah, is it cool for three?\nCause two girls just don't do it for me, I'm a beast\nHit it from the back, let me grab her ankles\nThumb's in the asshole, take the pain slow\nJump back on that cock, keep rockin\nHundred milligram pill, bitch no stoppin\nKeep poppin, energy droppin\nNeighbors complain, say we too loud often\nAnother world - you love it\nDon't you? My favorite nasty girl\n\n[Hook]\n\n[Interlude: man talking]\nYeahhh bitch, yeah take this sugar dick bitch\nTake it, yeah, take this jackhammer\nYou ain't know I had that jackhammer, did you?\nYeah say M.I.C. bitch, say Vishis\nCall me Vishis bitch, yeah (Vishis! M.I.C.!)\n\n[June]\nIt goes up, down, once again\nI fuck and make hoes confess they sins\nGotta make sure what's ya age again\nWish she had me on tape to show your friends\nHave a king size bed when I fuck hoes over three times after sex\nI don't even wanna smell your breath\nMy roommate peeps in\nAnd uh (what's happenin) we both hit that again\n\n[Royce Da 5'9\"]\nGet 'em in a rental, get 'em in a Range\nGive a nigga brain; let my nigga watch, keep him entertained\nIt's a wonderful thing\nDon't you go gettin all sentimental with game, let a nigga bang\nRide the Titanic\nMost niggas go from small to large, I go from wide to gigantic\nLet a nigga call in\nAs soon as I'm caught in, I'mma try to make a nigga fall in\nDig a deeper hole in it when I hit it\nPut her on feet patrol, send her to the sto'\nNever let her tell a nigga \"no\"\nCeiling or the flo', you dealin with a crimin-iminal\n\n[Hook]", "image": "https://images.genius.com/5296587baa4eefd1b2b1ef7daff66f78.1000x1000x1.jpg"}], "artist": "Royce da 5'9'’"}