{"songs": [{"title": "Lyrical Swords", "album": "Think Differently Music: Wu-Tang Meets The Indie Culture ", "year": "2005-10-18", "lyrics": "[Intro: Ras Kass]\nUh, Dreddy Kruger, what up, my nigga?\nYeah, GZA, you know, uh, Rassy, you know\nShouts out to my nigga Wreckonize, all my MIA\n\n[GZA]\nFormed in very a strong advanced post, east to west coast\nAhead of time, competition not even half close\nLet's say, by no means, an equal value\nPrematurely brought to play, I'll never allow you\nTo strike first, so precautions must be taken\nAnd what's worst? When you're just fronting and faking\nIt's a shame when the sixteen bars are just a waste\nAnd every line or word, is badly placed\nEven dealing with the narrow window of time\nMy arrangements are quick, shutting down your power lines\nOn a bunch of small puppets, with a wack ass team\nThat only move, at a push of a button that pull strings\nBad boys move in silence, secretly fading in\nUnlike fake gangstas and ya wannabe made men\nActing like they carry the gun that killed Lincoln\nOr they rolling with two hundred murderers from Kingston\n\n[Ras Kass]\nOur goal is to learn y'all niggas, about this new world order\nBut I'm still try'nna run up in the president's daughters\nHe the author, ain't let the NARC's see this sparker\nStick to bitches walls like I'm Peter Parker\nThe Vida Guerra sidekick hacker\nFive naked flicks, on the Internet jacked her\nDog, I'm not a rapper, I'm the black Dracula\nNosferatu, spitting darts at you, out of black Acura\nHomies is gat packers, rat packer\nFly nigga, I'm the Benjamin stack attractor\nMack attacker, pimp slapper, the track cracker\nEpitome of nice, after Rainbo press the lacquer\nAnd y'all niggas is the worst, like fat chicks with little tits\nIf your names not YKK, then get off my dick\nBitch, I hang with the trillest, and that's why 5 percenters\nCollege kids and ex-felons feel us\nI'm sick with the words, Waterproof and Liquid Swords\nThe world never heard this before, call me Mr. More\nMore money, more murder, and more spit to serve", "image": "https://images.genius.com/fdaae778f17618a8923c863eba5f5c52.1000x1000x1.jpg"}], "artist": "GZA"}