{"songs": [{"title": "The Waitress", "album": "Killer", "year": "2008-07-01", "lyrics": "[Intro: Waitress]\n(Hi, may I take your order?)\n\n[Bridge: Tech N9ne]\nDwamn!\nHey, that's all I'ma say right now\nI'm at a loss for words, girl, you, girl, gon' take that bow\nYou lookin'... boy, my lady would hate this\nIf she knew that I was out with her but I'm trippin' off the waitress\n\n[Verse 1: Tech N9ne]\nWoo shit! Who's this? Baby, why you do this?\nI'm sittin' here with another female and it's 'posed to be exclusive\nBeauty, fully loaded booty hips and thighs\nI want a raspberry lemonade, baby, and whatever yo name is on the side\nYou speak unique, beautiful teeth I just peeped\nIt's makin' me weak to the point I can't even eat\n'Cause you give me butterflies, them butter thighs need to be publicized\nA wonderful face and waist that's great and there's no mistake that I love the eyes\nNever like them other guys, 'cause when I want it I'm on it\nThe way I'm watchin' you feel uncomfortable, don't it?\nBut I'm thinkin' you should be in movies and this you need to quit\nThen suddenly under my table I got a kick\n\n[Hook: Tech N9ne]\nI'm with my girlie but I'm lookin' at the waitress\nI'm at a business meeting trippin' off the waitress\nCan't think of eatin', man, my girl will really hate this\nI'm sittin' here with her but starin' at the waitress\nAnd I like the way the waitress (work that, work that)\nCome get your money, girl, and (work that, work that)\nI really like the way you (work that, work that)\nCan I get you on the floor? (Work that, work that)\nThe waitress got it goin' on\n\n[Verse 2: Tech N9ne]\nTake my order anytime, I come here many times\nA week so she can give me mine, baby girl is plenty fine\nBusiness meeting, Capital Grill, was sippin' when she caught my eye\nWhen she came over to us I said, \"Can I get yo number on the fly?\"\nSmell like no other, look like she strip undercover\nWish I could follow her home and just say thank you to her mother\nAnother interested brother who'd love to become your lover\nBurn rubber to the spot to tell my dogs how much I dug ya\nOutta here but I'm not gonna leave this place without gettin' in yo face\nI'm not a disgrace so I gotta see how you taste\nAnd I move at a puma's pace\nSo baby please if you find the time to get up out the weeds\nI wanna make you my squeeze 'cause these other chicks you supersede\nI call her waitress and homie, I call him server\nThe waiter's a bloody murder, I never wanna hear no murmur no further\n'Cause she's bliss, I'm tryin' to get in yo mix\nI want you so my order you can 86\n\n[Hook: Tech N9ne]\nI'm with my girlie but I'm lookin' at the waitress\nI'm at a business meeting trippin' off the waitress\nCan't think of eatin', man, my girl will really hate this\nI'm sittin' here with her but starin' at the waitress\nAnd I like the way the waitress (Work that, work that)\nCome get your money, girl, and (Work that, work that)\nI really like the way you (Work that, work that)\nCan I get you on the floor? (Work that, work that)\nThe waitress got it goin' on\n\n[Verse 3: Tech N9ne]\nAnd don't be tippin' her below 20 percent\nShe need plenty for rent, leave her with pennies, then see her vent\nTo get money's her purpose, you don't tip, go get burgers\nBelieve her's is for TEPS meaning Tuition Ensuring Prompt Service\nI'm nervous 'cause I'm gawkin' mom's curvage\nI'm beyond flirtish, us hookin' up we both concerted\nWhere you get that smell from? She would never tell one\nBut she told me this, she say me she liked me 'cause I'm well done\nNow your girl lookin' real, real stanky, ain't she?\n'Cause she know you lookin' at the waitress thinkin' hanky-panky\nHer attitude is wonderful, even got the strength to thank me\nEven though she a single parent breakin' her back but ain't so cranky\nI had to make her my girl, now she gon' eat with me\nSouthern booty, mane, I truly never need to flee\nI'm stayin' focused, the waitress got me posted\nBut dwamn, look at that booty on the hostess...\n\n[Hook: Tech N9ne]\nI'm with my girlie but I'm lookin' at the waitress\nI'm at a business meeting trippin' off the waitress\nCan't think of eatin', man, my girl will really hate this\nI'm sittin' here with her but starin' at the waitress\nAnd I like the way the waitress (Work that, work that)\nCome get your money, girl, and (Work that, work that)\nI really like the way you (Work that, work that)\nCan I get you on the floor? (Work that, work that)\nThe waitress got it goin' on\n\n[Outro]\nWork that, work that-that-that\nWork that, work that-that-that\nWork that, work that-that-that\nWork that, work that-that-that", "image": "https://images.genius.com/ce6124bde0d76994fd0d3a8ddb1d4e97.1000x994x1.jpg"}], "artist": "Tech N9ne"}