{"songs": [{"title": "How Many Drinks", "album": null, "year": null, "lyrics": "Frustration (watching you dance)\nHesitation (to get in them pants)\nCome closer baby (so I can touch)\nOne question, am I moving too fast?\nCause' I ain't leaving alone feel like I could be honest babe\nWe both know that we're grown\nThat's why I wanna know\nHow many drinks would it take you to leave with me?\nYeah you look good, and I got money\nBut I don't wanna waste my time\nBack of my mind, I'm hoping you say two or three\nYou look good, we came to party\nBut I don't wanna waste my time\nTemptation (is calling your name)\nSweet persuasion, oh (baby this is a game)\nCome closer baby (if you like what you hear)\nImpassioned (is what I'm making you feel)\nCause' I ain't leaving alone, I feel like I could be honest babe\nWe both know that we're grown\nThat's why I wanna know\nHow many drinks would it take you to leave with me?\nYeah you look good, and I got money\nBut I don't wanna waste my time\nBack of my mind, I'm hoping you say two or three\nYou look good we came to party\nBut I don't wanna waste my time\nAha, and what do we have\nYour empty heart and my empty bottle and yellow cab\nThat you are likely to catch but your latest ex made you mad\nSo I figured the perfect catch would be you if I made the pass\nPool full of liquor then we dive in it\nKnowing if I lick her I might die in it\nThen reincarnate as a fly gymnast\nJust to flip my tongue on you\nThis the Olympics\nState your name, live in the moment\nIt's your time to own it, I see it in you baby\nShe tell me that she never get a first let away\nAnd life is a bitch, but every dog has its day\nHolla pull up, pull up, bring it back, come rewind\nPull up them bittracks, that pack come behind\nPool full of liquor then we die in it\nPull 'em to the side, let me slide up in it\nOr waste your time, or waste your time\nOr waste our time, baby it's alright\nBaby it's alright, baby it's alright yeah\nOh it's alright now\nAlright oh yeah\nI don't wanna waste my time, no\nI don't wanna waste no time, oh no\nI don't wanna waste your time, babe\nI don't wanna waste our time, oh my time, oh whoa, now\nHow many drinks would it take you to leave with me? (oh yeah)\nYeah you look good, and I got money\nBut I don't wanna waste my time (come with me baby)\nBack of my mind, I'm hoping you say two or three\nYou look good, we came to party\nBut I don't wanna waste my time, waste my time\nNo no no, I ain't judgin' if you do decide that you might be ___ing tonight\nWhat? More power to you if you do decide that you might be ___ing tonight\nI ain't judgin' if you do decide that you might be ___ing tonight\nWhat? More power to you if you do decide that you might be ___ing tonight", "image": "https://images.genius.com/25d8a9c93ab97e9e6d5d1d9d36e64a53.1000x1000x1.jpg"}], "artist": "Kendrick Lamar"}