{"songs": [{"title": "Not Your Average Girl", "album": "Ghostdini: Wizard of Poetry in Emerald City", "year": "2009-09-29", "lyrics": "[Intro: Shareefa]\nWhoa... oh, whoa...\nShareefa... oh\n\n[Ghostface Killah]\nFrom the blocking, to the dropping\nI need a girl that's stacking and popping\nWhen I come in late, she's not clocking\nNot in the crib, throwing 'round pots and\nNice girl, that's clean, that was raised to cook\nBe on the couch chilling, shorts on, reading a book\nBiting on a pen, thin glasses on\nFrench type frames by Yves Saint Laurent\nSay hey pretty mama, do you fit the bill\nDo you got what it take for you to fit in my wheel?\nWould you bust that steel if, niggas came to kill me\nProtect that safe, baby, dag, that's filthy\nWhoa, somebody let her know up in here\nHe like Papa Smurf, I'm like Papa Bear\nI'm just looking for a queen, so I can rock her ear\nTell her P. Tone in here, I got her locked this year\n\n[Hook: Shareefa]\nI'm not your average girl\nI be your Bonnie right beside you\nNo need to worry, boo, I got you, yeah\nI'm not your average girl\nSee me without you is unlikely\nThem other bitches they not like me, oh, wow\n\n[Ghostface Killah]\nYou can have keys to the boat, money follow me\nI got the cheese and the yolk, plus the juice\nThat's fresh squeeze with the pulp, mama got a big butt\nTiffany chain, the stones freeze in the throat\nLove to hold my hand, stepping off planes from D.R\nLuggage with a big black tan\nWhatcha gonna do? You or him, me or you?\nFucking with him, you look mad pitiful\nBoo, I'm not the type that be slobbing down hoochies\nLooking at these hoes, eyes low like Droopy\nTugging on my jacket til the lights come on\nWe run trains on them bitches, never ice they arm\nThat's a no-no, chicken heads looking for a come up\nIn the club, 'oh my God', now they wanna run up\nNagging til the sun up, shut up, I'm not a double-up, boo\nGo get your feet done, your toes, cuz they knuckles up\n\n[Hook]\n\n[Hook: Shareefa]\nBaby, baby, don't waste your towel\nLooking any further cuz the girl is ours\nHolds it down for you, any place, any time\nYou already know, I'm the one, yeah, I'm that\nFly girl, rider, just say the word\nAnything pop off, it's us against the world\nSuch a hood girl, with that dirty loving that'll make your toes curl\n\n[Ghostface Killah]\nYo, relax and chill, analyze the story\nLove, your boy Tone got mass appeal\nAll them other little players ain't as half as real\nThey just wanna get up in you like Massengill\nBut me, I need a wisdom, play it like wifey\nWell mannered, understand the kid and not bite me\nAll my real ladies, put your hands up\nHolla at your boy, if you ain't a groupie, right now, stand up\n\n[Hook 2X]", "image": "https://images.genius.com/ea54fa933d61e534fbf14d9509cc7146.1000x1000x1.jpg"}], "artist": "Ghostface Killah"}