{"songs": [{"title": "The Razor", "album": "The West Coast Blokk Monster", "year": null, "lyrics": "[Intro]\nAye yo dis be da reason why I do dis shit\nStright da fuck outta Compton\nReapin' that muthafuckin' N.W.A\nI got a lot of love fo' Dre\nNo Dre beats on da Album\nBut it ain't no love loss nigga, thats ma nigga\nWe do it fo' da muthafuckin' WESTSIDE NIGGA WHAT!!!\n\n[Verse 1]\nSoon as the breaks hit da snare\nMy Dodger Fitted in da air\nI graduated form da school of Hard Knocks like yea\nSo what da fuck you niggas rhymin' about\nIf Hip-Hop was a pussy I'll knock the linin' out\nThen I get low like they ride in da South yea I'm dirty\nI shine without da diamonds in my mouth say..Cheese\nTake a picture of da gold D's\nThen picture me rollin' with da top back on a 6-4 please\nGet da fuck up off my ass\nFor I put ma foot on da break den slam on da gas\nBurn rubber like the Daytona 500\nWhere I'm from you get Daytons fo' 500\nGet a casket fo' free\nHow da fuck could I stay off MTV News when niggas askin' fo' Beef\nTalkin' bout' they gon Kill Game when they say these thing\nI where da 4-5 in L.A. like I'm A.C. Green\n\n[Hook]\nI'm da rawest most Gutter\nIn da street with da fiends and da Coke Cuttas'\nDisrespect yo whole click and I don't stutta'\nWestside til' I die Compton Muthafucka!\nYea I'll be da rawest most Gutter\nIn da street with da fiends and da Coke Cuttas'\nDisrespect yo whole click and I don't stutta'\nFuck da World Straight Outta Compton Muthafucka!\n\n[Verse 2]\nI shine fo' niggas behind bars I ain't got that Diddy glow\nBlack Rows in da cement I got that New Jack City flow\nBlack Rows sittin' low 22 dippin' gold bangin' Friend or Foe, feel me\nYea when from a young and dumbin'\nTo da second comin'\nNiggas can't see in da Phantom I call them Stevie Wonder\nIt never rained Southern California everyday is Summa'\nEven when da skys grey its still hot fo' da Block Runnas stop frontin'\nI told niggas da same day Dre signed me, I'll come back in 2Pac numbas\nI drop classics when otha' rappas makin' hits\nI stay hard cause all you niggas hangin' from my dick\nLouie Vuitton bandana on my face, Jesse James of da Rap game\nI'm takin Hovas place, if life was a crap game and I was delt da Ace\nNever wanted to be King just wanted to meet Dre\n\n[Hook]\nI'm da rawest most Gutter\nIn da street with da fiends and da Coke Cuttas'\nDisrespect yo whole click and I don't stutta'\nBring da crown back to Compton Muthafucka!\nYea I'll be da rawest most Gutter\nIn da street with da fiends and da Coke Cuttas'\nDisrespect yo whole click and I don't stutta'\nPolishin' da thrown in Compton Muthafucka!\n\n[Verse 3]\nI can't forget about da Hustlers in da hood same Sean John Jeans as yesterday\nWaitin' fo' da Customas , nigga I us to be them all black B.M\nFrom da A.M. to da P.M. fiends call me da G.M\nI was da General Manager watchin' them baggin' Grammys up like John Legend and Black Eye Peas\nBlack hoody on\nBlack Chuck Taylors, HaHa\nWatchin' fo' da Black Van\nSome niggas call them Pac-Man know watch me get Ghost\nIn that white on white 550, 55 on da dash\nGotta' drive slow homie, Kanye in da dash\nLet da sun roof back and da Cronic smoke out\nLow Pro Pirelli so da Giovannis poke out\nGwen Stefani ridin' shotgun yea I'm high No Doubt\nBut not to high to Nextel Chirp and have them boys roll out\nSee I'm that 1 rappa' gun clappa' compared to da unstaba'\nLyrically Insane Muthafucka' and when I'm done plow!\n\n[Hook]\nI'm da rawest most Gutter\nIn da street with da fiends and da Coke Cuttas'\nDisrespect yo whole click and I don't stutta'\nWestside til' I die Compton Muthafucka!\nBreak it\nI'll be da rawest most Gutter\nIn da street with da fiends and da Coke Cuttas'\nDisrespect yo whole click and I don't stutta'\nFuck da World Straight Outta Compton Muthafucka", "image": "https://images.genius.com/6730545d4fc86390c34b936f6e9045f8.500x500x1.jpg"}], "artist": "The Game"}