{"songs": [{"title": "Yes", "album": "The Best Out Mixtape Vol. 2", "year": "2009-01-30", "lyrics": "[Verse 1: Pharrell]\nYou can catch me riding down on the fucking Verrazano\nAss out just like Diallo Diablo\nHi-ho silver, call that motherfucker Tonto\nLeave a smoke trail back in Jersey in my condo\nYou can run up like you're Rambo\nBut you better hit me nigga if you know what I know\nCause I got some supersize guys that'll hit you with a combo\nPronto, you won't see the morning like Alonzo\n\n[Verse 2: Lil Wayne]\nCamo shorts no socks with the red Bapes\nWalk in to my closet fuck around and get a headache\nFuck you so good shawty you gonna need a bed break\nRed viper slither through the street like a red snake\nRed diamonds in my chain looking like a red snake\nFuck with me wrong man, you gonna need some yellow tape\n\"All them awards, Wayne, do you need a medal case?\"\n\n[Refrain: Pharrell]\nYou got that mean mug grill, that red in your eyes\nThat ace of spades baby talking big-boy size\nGet a stack in each hand and hold it like you're fresh\nThey say man it's like that\nSay yes nigga, yes nigga, yes\nYour money and your girls, chilling in the VIP\nStop for a second and gyrate them hips\nGet a stack in each hand and hold it like your fresh\nIf they say man it's like that\nSay yes nigga, yes nigga, yes\n\n[Verse 3: Lil Wayne]\nYes I make money, I'm a paper machine\nAnd you can catch me in the newest, not the latest machine\n\"Now, Weezy, why you drive so fast?\" Because I'm chasing a dream\nAnd when I catch that motherfucker, I'm a rape it and leave\nYea, Its Young Tunechi, now give me some pussy\nI ain't gotta paper chase 'cause my paper come to me\nI know money look good\nBitch I know that why you looking huh\nRiding by myself in that all-red Enzo\nSmoke make it look like I got tinted windows\nYoung Money, bitch, but for short it's YM, ho\nLove that shit so much I went and iced out the symbol\nAll my niggas scaring you, all your nigga's scarier\nScarier than a cat in a cage with a terrier\nPet cemetery, Wayne, are you the veterinarian?\n\n[Refrain]\n\n[Verse 4: Lil Wayne]\nYes I do it big, call me Lil Astronomical\nWeezy F baby and the 'F' is for phenomenal\nType of nigga go and get his hood 'cross his abdominal\nYou could check my watch, I been rich a long time ago\nI'm so tired of balling, man, I sleep all night\nBed sheets so nice, bed bugs don't bite\nI ask her do she wanna fuck, before I ask twice, she say\nYes I am a beast, I swear I needs to be tranquilized\nYes I am a giant, next to me you are just ankle high\nYes I eat that pussy, oh, how do I love that panty pie\nKeep my hair shampooed and yes, I keep my hands sanitized\nNew Orleans baller, ask ESPN\nJust kicking it with the Bruce Lee-esbian\n\"Do you really think you're better than the rest?\"\nHaha, bitch, I'm the best", "image": "https://images.genius.com/099fb1f49588cf8e931c6be12622459a.500x500x1.jpg"}], "artist": "Lil Wayne"}