{"songs": [{"title": "Second Chance", "album": null, "year": null, "lyrics": "Eminem:]\nYeah\nIt's my life\nMy own words I guess\nHave you ever loved someone so much, you'd give an arm for?\nNot the expression, no, literally give an arm for?\nWhen they know they're your heart\nAnd you know you were their armour\nAnd you will destroy anyone who would try to harm her\nBut what happens when karma, turns right around and bites you?\nAnd everything you stand for, turns on you to spite you?\nWhat happens when you become the main source of her pain?\n\"Daddy look what I made\", Dad's gotta go catch a plane\n\"Daddy where's Mommy? I can't find Mommy where is she?\"\nI don't know go play Hailie, baby, your Daddy's busy\nDaddy's writing a song, this song ain't gonna write itself\nI'll give you one underdog then you gotta swing by yourself\nThen turn right around in that song and tell her you love her\nAnd put hands on her mother, who's a spitting image of her\nThat's Slim Shady, yeah baby, Slim Shady's crazy\nShady made me, but tonight Shady's rocka-by-baby\n\n[Hook x2:]\nYou look like you're in another world\nBut I can read your mind\nHow can you be so far away\nLying by my side\n\n[Ludacris:]\nThings ain't always what they seem or cracked up to be\nLike all these fakin' ass rappers in this industry\nTalkin' bout what they got, and they ain't got a damn thang\nHow you own three cars, but you don't own ya own name?\nGet ya business right boys, the first class is in session\nGet a entertainment lawyer in the music profession\nStart up ya own company, trademark the name\nThat's gon' run ya bout a grand so start savin' ya change\nOpen a bank account quick, and then follow these steps\nSign yourself to yourself and start signin' ya own checks\nHit the booth and start recording at the speed of need\nWhatever gets ya juices flowin' could be speed or weed\nGet it mixed and mastered, pressed up and plastered\nSell it to ya whole hood out the trunk, ya bastard\nShow all the non-believers what you destined to be\nAnd in just a couple years you could be rich like me\nBut I can't hold my tongue\n\n[Hook x2:]\nYou look like you're in another world\nBut I can read your mind\nHow can you be so far away\nLying by my side\n\n[Lil Wayne:]\nMoney to be made best believe a nigga clockin\nI run it myself like a quarterback option\nI pitch a 10 g's tell a bitch to go shopping\nShe buy herself some clothes, and she bought me back a chopper\nSee niggas tryna kick it, but no I don't play sucka\nI'm all about my cake I'm tryna marry Betty Crocker\nA package on the way you know my whip game proper\nAnd enough for one key I see seventy thousand dollas\nNow I was shootin dice, smokin on a joint\nI bet with Yo Gotti, he hit five straight points\nWe ova here hustlin, we ova here grindin\nYou rap about money and nigga might sign ya\nYou rap about me and a nigga might find ya\nBanana in ya ass with ya head right behind ya\nDOPE GAME BITCH let his mamma worry bout him\nYou can holla at me for a fee\n\n[Hook x4:]\nYou look like you're in another world\nBut I can read your mind\nHow can you be so far away\nLying by my side", "image": "https://images.genius.com/b379811c1415017b9f3e3a71b9d26060.400x400x1.jpg"}], "artist": "Eminem"}