{"songs": [{"title": "The Bomb", "album": "AmeriKKKa’s Most Wanted", "year": "1990-05-16", "lyrics": "[Intro]\n\n(The police set up barricades, there was a scuffle)\n(This turned into a riot and it spread through Central Park)\n(Negroes threw bottles at the police)\n(Orders to disperse were ignored and huge crowds swarmed through the streets)\nThe Bomb!\n\n[Verse 1]\nIt's like a holocaust to the boss when I toss\nToo much knowledge kicked then you're lost\nIn a shuffle of feet, Jinx the fiddler\nAnd I control your mind like Hitler\nYou bow and vow to authority\nSee now, a sucker with a style just boring me\nSo I show K.N.O.W\nL.E.D.G.E. it might trouble you\nThen I transform like a Decepticon\nWith a mic as a bomb\nIn my right palm\nBut I don't stay calm\nSo panic\nOthers can't flow so they go schizophrenic\nYou thought I dropped a dud in your face\nUntil you taste the blood of the bass\nThen you faint, or better yet pass out\nWhen I'm on the mic, believe it's ass out\nYou think you're raw so you draw\nYou lose, you're hung, you bite your tongue\nThe whole town saw in awe as you strangle\nA noose on your neck, and you dangle\nFrom side to side in the blazing heat\nYou're beat, you're dead, the boots fell off your feet\nYou're turning red, it's said\nThat your head burst\nAnd this is only the first verse\nOf the bomb\n\n(Break)\n\n[Verse 2]\nDon't break up the fight let them rumble\nOver the years I've watched some go super-bad quick\nNow the smell of the pen has got them sick to the stomach\nNow ask yourself, who's stupid?\nI take funky funky beats and I loop it\nAnd pimp slap you in the face with the bass\nAnd the boom from the bomb that I drop\nStop\nYou have a flat top as a fashion\nI love Black women with a passion\nBut when they gotta go and show their ass in\nI gotta clown the hoes, yeah\nYou gotta watch the ones with the big derrieres\nThey'll steer you wrong\nIce Cube's got it going on, hit me\nFor the gangster boogie two times for the gangster rhyme\nThe sister ain't wholesome\nThey want to put a young brother in Folsom\nAnd others see me on lockdown\nBut I come up foul then they get knocked out, word\nTo the brother that rolls the herb\nEverybody getting knocked to the curb like that\nJinx got the gat, and it's a fact\nHe'll kick a funky beat to peel your cap\nNow who's the mack?\nWho's the ho?\nWho's the trick?\nI got many, many styles won't you take a pick\nBut don't be alarmed\nWhen I trip and stumble and fumble\nAnd drop the (rewind)\nDrop the bomb\n\n(Break)\n\n[Verse 3]\nI'm solo, you ask how I'm living\nStill dropping more shit than a pigeon\nWith the L, the E, the N, the C, the H\nThe M, the O, the B, the great\nLyrics that make the beat swing and I gotcha\nIt's the hip-hopper that don't like coppers\nAnd if you try to upset the pot son\nYou get kicked in the chest like a shotgun\nI make the beats, I make the breaks\nI make the rhymes that make you shake\nMake you find\nIce Cube never caught in the middle\nI make shit to kick you in the ass a little\nAnd still never hesitate to stutter step\nOr bust a repitition on the mic\nStill dissing all the hype\nFrom left to right\nHow many left to fight?\nSo what that Lench Mob like?", "image": "https://images.genius.com/1cb382d2d9fb4a9bfa94e3074c1aa220.1000x1000x1.jpg"}], "artist": "Ice Cube"}