{"songs": [{"title": "The Potion", "album": "The Red Light District", "year": "2005-04-20", "lyrics": "[Intro]\nWhattup? Hey shawty, what it is?\nWhattup? Hey shawty, what it is?\nWhattup? Hey shawty, what it is?\n\n[Chorus]\nLil' buddy what you want? Some violent shit!\nTwo-step and lay back, still wilin' shit\nWhattup? Hey baby, I got the potion\nTake a sip of this and put your back in motion\nLil' buddy what you want? Some violent shit!\nTwo step and lay back, still wilin' shit\nWhattup? Hey baby, I got the potion\nTake a sip of this and put your back in motion\n\n[Verse 1]\nMan I'm like a needle in a haystack, so face that\nGo back to the drawing board, connect dots, but can't trace that\nMatter fact, erase that, 'cause on this great track\nGet your face slapped, and I'm straight so don't take that\nTry somethin' different and shit, so listen and shit\nSpeakin' about what hip-hop is missin and shit\nI'm about to fill a void, Ludacris born in Illinois\nRaised in Atlanta, tote hammer since I was a little boy\nAin't nobody like me, so they wanna bite me\nFight me, step to me now but it ain't likely\nPeople swear they sight me, just cause he's light-skinned\nWith braids in his hair don't mean that nigga looks like me\nTrick get your mind right, livin' in the limelight\nSo picture what they'll do for my jimmy and a Klondike\nBar, bar, hardy-har\nTell yo' momma I'm a ghet-to su-per-star\n\n[Chorus]\nLil' buddy what you want? Some violent shit!\nTwo-step and lay back, still wilin' shit\nWhattup? Hey baby, I got the potion\nTake a sip of this and put your back in motion\nLil' buddy what you want? Some violent shit!\nTwo step and lay back, still wilin' shit\nWhattup? Hey baby, I got the potion\nTake a sip of this and put your back in motion\n\n[Verse 2]\nOnly standin' five eight but still a big shot, plus I got a big\nClean everyday, stay fresher than what's in a Ziploc\nTell your man to kick rocks, when I make my pitstops\nI'm in, then it's hard to get me out like I'm a slip knot\nBorn to be a leader and not, no not a follower\nOnly hang with chicks that got mo' twists than Oliver\nNot much of a hollerer, but I'd like to borrow her lips\nBringin out the best in me 'specially if she a swallower\nFreaky deaky yellow man, and I'm sayin hello man\nTo all the lovely ladies that like to jiggle like Jello man\nBigger booty, small waist, put 'em in a small place\nAnd if it ain't no ass where I'm at, then I'm in the wrong place\nBail like a bondsman, but keep 'em dancin'\nGot pop potential, stay black like Bob Johnson\nWho the hell is that in that fancy car?\nTell yo' momma I'm a ghet-to su-per-star\n\n[Chorus]\nLil' buddy what you want? Some violent shit!\nTwo-step and lay back, still wilin' shit\nWhattup? Hey baby, I got the potion\nTake a sip of this and put your back in motion\nLil' buddy what you want? Some violent shit!\nTwo step and lay back, still wilin' shit\nWhattup? Hey baby, I got the potion\nTake a sip of this and put your back in motion\n\n[Breakdown]\nAnd jump down turn around, pick a bale of cotton\nJump down turn around, pick a bale of hay\nOh lordy, pick a bale of cotton\nOh lordy, pick a bale of hay\nJump down turn around, pick a bale of cotton\nJump down turn around, pick a bale of hay\nOh lordy, pick a bale of cotton\nOh lordy, pick a bale of hay\n\n[Verse 3]\nStill working like a slave, learning tricks of the trade\nIn a ghetto state of mind, say I'm rich and I'm paid\nPickin' records like cotton in the thick of the day\nTill I'm spoiled and I'm rotten in a sinister way\nLife no different than those on minimum wage\nMore money but still locked in a similar cage\nEither losers of tomorrow or we winners today\nDigest that and there's really nothin' missin' to say but\n\n[Chorus]\nLil' buddy what you want? Some violent shit!\nTwo-step and lay back, still wilin' shit\nWhattup? Hey baby, I got the potion\nTake a sip of this and put your back in motion\nLil' buddy what you want? Some violent shit!\nTwo step and lay back, still wilin' shit\nWhattup? Hey baby, I got the potion\nTake a sip of this and put your back in motion", "image": "https://images.genius.com/57e6650f3864beef0e227e02f76d83b0.1000x1000x1.jpg"}], "artist": "Ludacris"}