{"songs": [{"title": "Magnificent", "album": null, "year": "2015-11-16", "lyrics": "[Intro: Young Thug & sample]\nWhat the fuck, you ready?\nAlright, alright\nWhat the fuck, you ready?\nWe got London On Da Track\nWhat the fuck, you ready?\nAlright, alright, alright!\nThugger!\n\n[Verse 1]\nMy birth certificate say I'm so magnificent\nSkoob done tinted cause them dykes they so magnificent\nHead bigger cause my bitch say she magnificent\nHundred percent I cashed out when I bought my Bentleys\nI've been grinding since I came up out the porch\nShe want me to pull the string and see if I'm so important\nNot a toy, baby girl, I got a little boy\nAye (woo, woo, woo, woo, woo!)\nI am magnificent, I could get chickens and my neck is red like a hen\nI told that little bitch that she not gon win and I told her to go hit it in\nChoppers gon' chop and I swear to God I am a slime I'ma shoot at your spin\nWatches on watches got timing on timing I just might bring Flav Flava in\nCaught me a big ol' lil' body, lil' bitch and you know it's the Benz\nSuck on my dick, baby suck on my dick 'til you got a big chin\nSoon as I fuck on your ho, boy you know I'm gon' make her back bend\nCookies, I roll it, I roll it, got fish scale but I don't got baits\nThese little bitches know that I'm the future plus I'm holdin' weight\nI pulled up, hop out the 'Rarri now they tailgating\nI might keep my hands down, let my jewelry wave\n\n[Hook]\nBling, bling, bling I iced out my team\nIf you ain't sayin' that nice, my nigga, what the fuck you mean?\nI live it up, it's not the same\nI like my bitch brown like sugar cane\nWoah, woah, hey!\n\n[Verse 2]\nEat that pussy 'til I throw up\nI got water out in Florida\nLittle Mama know I can't cuff her\nFuck cleaning I'm a buffer\nMy diamonds black like a muffler\nMy bitch a nat and I trust her\nFuck nigga you're pie a custard\nHe got lames rhymes no Busta\nI'm like nigga bitch I'm too fly for this shit\nGot a lot of niggas on the block that'll do or die for this shit\nGot a lot of bitches out in Folies that'll come around with my clique\nNutted on the bitch panties she told her old man it was spit\nBaby little girl you know YSL is the realest they get\nBitch I'm on fire I fire the best fire like a Bic\nI want to know where it's at and I swear to God I'mma go get it\nTurnt up my birds in my words and now I'm 'bout fly as a pigeon\nHop in my coup and brrrp the ceiling\nMy bitch she rich and black like Oprah Winfrey\n5-4-3-2-1, there go both her pimps\nI like white meat, baby pass me a little sugar\nThirty two on my hip, whoa\nNo hole but I'ma let it rip\nOr you could throw it off of the ship\n\n[Hook]\nBling, bling, bling I iced out my team\nIf you ain't sayin' that nice, my nigga, what the fuck you mean?\nI live it up, it's not the same\nI like my bitch brown like sugar cane\nHey, hey, woah!\n\n[Outro]\nMonica, I like you and I love your persona\nCome with me I buy you hair by the bundle\nWe go back and forth just like a runner\nLay beside you keep you warm like your mama\nI don't want to keep discussing none of these lil' numbers\nI just want to feed you this candy like a Mamba\nBahh kaww... backaw kaw!", "image": "https://images.genius.com/717461618e785def35d07de6484b7ad4.1000x1000x1.png"}], "artist": "Young Thug"}