{"songs": [{"title": "Scooby Doo", "album": null, "year": null, "lyrics": "Chorus (repeated several times):\nScooby-Doo, y'alllllll....\nScooby-Dooby-Doo, y'alllllll....\n\nVerse 1:  B-Real\nI remember the time them niggas tried to get me (I ain't havin' it)\nThrow your hands in the air, the Hill's live and direct, see\nSo let me put my clip in, watch this nigga start flippin'\nMy, why must they always be trippin'?\nShut up, what up, fool tried to nut up\nDropped the gat, riccocheted, the fool got cut up\n(Why'd you drop the gat, G?)  I got hit from behind\nNow a nigga like me, I gotta go for mine\nBring it on, bing, make ya bells ring\nWhen ya hit that pavement, what a feeling\nIt's on, cracked like a baseball bat\nOh shiiiiiiiit, out the boot came a gat\nPointed (aimed) the nigga said \"You're through!\"\n[laughs] Scooby Doo!  'Cause I had a boy too!\n\nChorus\n\nVerse 2:  B-Real\nI remember the time them niggas tried to get me (I ain't havin' it)\nThrow your gats in the air if you wanna come test me\nSo let me just run through, as I pull out my Scooby-Doo\nI get the chills when I see that dead man's crew\nI got to get up, let's go head up, dead up\nI'm loc'ed like that, punk, that's why you're gettin' wet-up\nWant me to let up, but I ain't tryin' to hear that\nBullshit cryin', punk, let me just clear that\nBuck a shot, lick a two shot, lick a three shot\nRan out of ammo, damn, I ain't tryin' to get got\nTwo niggas standin', dirty under-handed\nLighter shade of fire, check my slug expanded\nNow tell me what the fuck are you gonna do\nWhen I pull out my Scooby-Doo?\n\nChorus\n\nOutro:  B-Real (Mexican dialect?)\nTake a good look ... 'cause this is the last time you're gonna see\nFat bell like this again, you fat piece a chit!  Kid muchacho\nMuchacho kid, get flabby - (oh - choot that piece a chit.)  You\nFuckin' lobsta piece a CHIT!  I'll stomp you like a duck.  And you ...\nYou with your little happy chain of lighters ... you wanna fuck with\nMe, you fuck with the best!  And you ... you with the burly haircut\nThe Stawberry Quik guy ... you around the way, main.  I know where\nYou at", "image": "https://images.genius.com/2615919eb0bcef9d55421080ab3b10b1.860x860x1.jpg"}], "artist": "Cypress Hill"}