{"songs": [{"title": "Screwed Up", "album": "Chicken-n-Beer", "year": "2003-10-07", "lyrics": "(*Man coughs*)\n(*Man talking*)\nAh yeah, we sending this one out\nFrom everybody I mean to everybody from the H-Town to the A-Town to worldwide\nSo get your lighters, get your drink\nAnd I tell you what I'm so fucked up, and screwed up\nIf anybody try to blow my high, you know what I'mma tell 'em\n\n(Chorus)\n[Man] Ludacris\n[Fuck you!] Fuck you!\n[Fuck you!] Fuck you!\n[Fuck you!] Fuck you!\n[Fuck you!] Fuck you!\n[I'm screwed up]\n\n[Ludacris]\nI feel better than I've ever felt before, Ah!\nIntoxicated but maintaining self-control, Ah!\nI took a swig, I had a jug, chug-a-log, I'm loud and clear\nI had some bud, I lit it up, and then I made it disappear\nCause my magic tricks, are so fabulous\nThis shit's hazardous, got amateurs smoking canibus\nIf you mad at this, damn it then\n\n(Chorus)\n\n[Lil' Flip]\nI made a, call to my dog, time to split the blunt and break it up\nThree-wheel motion, purple potion, I gotta shake it up\nI tried to kick the habit, but it keep calling me\nAbracadabra, here's a magic trick, I smoked up all the weed\nZig-Zag's and golden wraps got my mind gone\nDrugs don't affect my work, I still get my grind on\n\n(Chorus)\n\n[Ludacris]\nI'm leaning like the Tower of Pisa, the syrup squeezer\nCome close to my stash, and get treated as if I'm Ebeneezer\nI'm throwed, blowed, matter-of-fact let's call this the thrower potion\nI'm screwed up, so no wonder things are in slower motion\nI gots to have it,can't kick the habit, I've tried to shake it\nThe drug experiment stage if you mistake then\n\n(Chorus)\n\n[Lil' Flip]\nI'm from Screwed Up Texas, we drive reckless, and then we peel off\nYou ain't had shit until you smoke Sweet Tooth and Jack Frost\nHit it twice but don't cough, you gotta take it man\nIf it's a record for smoking I'm 'bout to break it man\nMe and Luda puffing budda, we in a black Cougar\nOn Zap Judas, you try to jack us we grab rugers\n\n(Chorus)\n\n[Ludacris]\nHow can I say it plain?\nThat I'm off that Mary Jane\nAnd if it's true what they say\nThen I don't know how many cells is left in my fucking brain\nBut I'mma keep on writing and lighting\nMinds of these hungry rappers\nAnd tell the hood that I've hired niggas and fired crackers\nOn the Fourth of July, opens your eyes I'm joking stupid\nI love all races but if you hating my music then\n\n(Chorus)\n\n[Lil' Flip]\nI love my\nI get patient we never have to take a piss test\nFuck a 9 to 5 cause I'm always getting rest\nI wake to breakfest and head\nYou wake up to breakfast in bed\nShould I drive my H2? Hmmm?\nI'mma take the Lexus instead\nPimping ain't dead but I'll leave you niggas\nDead from all this pimping\nI'm riding spinners like a pimp\nThat's why I'm limping\n\n(Chorus)\n\n[Ludacris]\nOff substances that's controlled\nThat's how this story goes\nI popped the cap, broke the ice\nAnd Lil' Flip done broke the mold\nI'm so cold I think I, see dead people\nNah, that's just my homies passed out in the Regal\nBelieve it, the potency is so strong, if you notice me\nI'm calm, cool, and collected and if you, disrespect it\n\n(Chorus)\n\n[Lil' Flip]\nWe doing this for them players that bank screw music\nWe don't pass out after 8 blunts, because we used to it\nMe and Cris like cheech & chong\nSo hurry, break out the weed and the bong\nCause if it ain't Grade A trees, we gotta leave it alone\nAnd to my homie screw, you know I gotta hold it down\nAnd if they want it then they gotta come and take the crown\n\n(Chorus)\n\n(*Man talking*)\nHahahahahaha So there you have it\nSending this one out to all my drinkers and all my smokers\nUnited and lighted we stand inebriated we fall\nAnd if you wanna pass the sobriety and breathalyzer test\nHere's a quick Luda tip some packets of mustard in your car\nKeep mustard god damn it and whoever said the south can't rhyme\n\n(Chorus)", "image": "https://images.genius.com/1498cf277a7dc50ffc916ca191c3608f.1000x1000x1.jpg"}], "artist": "Ludacris"}