{"songs": [{"title": "Bad Husband", "album": "Revival", "year": "2017-12-15", "lyrics": "[Verse 1: Eminem]\nWe never saw from each other's sides, or eye to eye\nJust eye for eye, lie for lie, fight or flight\nSo much baggage, need a luggage rack\nBut we carry on with our public spats and our feuds\nUp back in the news, love taps when I dissed you\nLike it was fun, actually used to run back to the booth\nJump back in the studio, give you a tongue-lashing, then you\nLaughed at the stomach tat with the tombstone\nIt was funny back in our youth\nBut then it wasn’t after we knew\nThat we were done and actually through (And actually through)\nBut if there's one fraction of truth\nIf it could be spun back I would do\nSo many things different (Things different)\n'Cause it was such a dumbass excuse\nYou hit me once and that I would use\nTo continue the pattern of abuse\nWhy did I punch back? Girls, your dad is a scumbag, I’m confused\nBecause—\n\n[Chorus: X Ambassadors]\nHow come you can be a lord and a loser?\nHow come, how come, you can be a liar and a good father?\nA good dad, but a bad husband\nWhy are you a good father?\nA great dad, but a bad husband\n\n[Verse 2: Eminem]\nYou were the beat I loved with a writer's block\nThe line that's hot, that I forgot\nWe laughed a little, cried a lot\nI'll never forget when you came home and you held Hailie\nDay before you went to jail and daily\nHow we'd wait for that mail lady\nOr by the phone for Mom to call\nAnd I watched you pull yourself up and we decided on\nGivin' it one more try despite it all\nYou're my lightning rod when my sky gets dark\nI'm your shiny rocks in that tiny box\nWhen we tied the knot, when we broke the knot\nEvery line we crossed we were supposed to not\nEvery time we fought, the insults they got… thrown too far\nWords that we said that we didn’t mean\nThe words that we meant that we didn’t say\nThe ones that we thought that we shoulda said\nLetters written that we coulda read\nWhich maybe woulda lead to some good instead\nAnd had this put to bed\nBut I'd be lyin’ still if I said I wasn't sittin' here askin' myself\n\n[Chorus: X Ambassadors, Hailie Jade & Eminem]\nHow come you can be a lord and a loser?\nHow come, how come, you can be a liar and a good father?\nA good dad, but a bad husband\nWhy are you a good father?\nA great dad, but a bad husband (Dad) (You said)\nForever be a hero in my eyes (I reply)\nBut there’s always another side to a good father\nA great dad, but a bad husband\n\n[Verse 3: Eminem]\nWe brought out the worst in each other\nSomeone had to make the sparring end\n'Cause I loved you, but I hated that me\nAnd I don't wanna see that side again\nBut I'm sorry, Kim\nMore than you could ever comprehend\nLeavin' you was fuckin' harder than\nSawing off a fuckin' body limb\nOnce upon a time we're all we had\nMaybe that's what drew us\nTo each other, it was true love\nShit, we never knew was possible\nWe might have loved each other too much\nAnd maybe that's what made us do what\nWe did to each other, all the screw-ups\n'Cause you always thought that you was\nMore in love with me\nAnd I was thinkin' I was more in love than you was\nFor all the times that we thought it worked\n'Til we saw how wrong we were\nWhen the dust settles now and all the dirt\nIf I touch the rawest nerve\nAll I want is for us not to hurt\nAnd it's been an exhaustive search to find the words\nBut I just heard \"Mockingbird\"\nAnd got the urge to jot some verses and thoughts\nThe purpose was not to stir up or open wounds\nI've caused a few and so have you\nOr argue whose fault it was\nPartly yours, partly mine, but really no one's\nThis is so tough, I'm gettin' choked up\nOh fuck it, we both suck\nWe broke up, got back together\nWe both thought we had forever\nNot bad people, just bad together\nWe were so nuts, backstabbed each other\nAnother blow struck, but there's no duckin' this blow\n'Cause it's over and it's closure\nBut I'm not so sure how to close this\nI just don't know how some people can be so good\nAt one thing and so fucked at a whole nother\nShit, it's no wonder\n\n[Chorus: X Ambassadors, Hailie Jade, Eminem]\nHow come, how come, you can be a lord and a loser?\nHow come, how come, you can be a liar and a good father?\nA good dad, but a bad husband\nWhy are you a good father?\nA great dad, but a bad husband (Dad) (You said)\nForever be a hero in my eyes (I reply)\nBut there's always another side to a good father\nA great dad, but a bad husband", "image": "https://images.genius.com/edd76153e7ac3ec36be997aea55f32ed.1000x1000x1.png"}], "artist": "Eminem"}