{"songs": [{"title": "Killin’ Fields", "album": "Tical 2000: Judgement Day", "year": "1998-11-10", "lyrics": "{intro, some lady, whatEVA}\n\n{Method babbles for a bit about Wu affiliates}\n\n[Method Man]\nShoes full of dirt, kicking sand on your works\nSomething gotta hurt, catch a case off a verse\nLive in concert, kids coming out they shirts\nI'm hyped now, jumping in the crowd, feet first\nMeant it when I said it, lungs bring the pain son\nWithout the anesthetic, make em look pathetic\nNeeding help from paramedic, Hot with the Nickel\nBust back take em with you, survival of the fittest\nAnd the world out to get us, I feel it in my bones\nI can feel it in my testosterone when it's on\nStat' bring it back, hard rap for your pussycat\nCognac, off the meat rack, where the pussy at?\nJohnny, got these niggas mad at they mommy\nJumping on my hard salami, say what you like\nIn the heat of the night, I crash individuals\nSplash on the mic airtight with the lyrical\n\n[Chorus: Cho-Flo & Method Man]\nNigga run with it, have fun with it\nBlow your gun with it, and be done with it\nWelcome to the killing field where Johnny Dangerous\nHeadbanger Boogie niggas going through changes\n\n[Method Man]\nIt all starts with the pad and pen, my special blend\nOf herbs and spices on mic devices, murder men\nMake em mices I recommend, something that's priceless\nFor you rap hooligans, claiming you nicest\nCall it what you like kid.. you can even call\nA psychic for all I care, still ain't got a prayer\nAmongst the righteous, Blazini, cheat death like Houdini\nWord to Bad Bird that fucked nerds in bikinis\nObserver, lyrical flares, you being served\nFrom the gizzard, plucking yo' nerves with nouns and verbs\nFrom the ghetto to the suburbs, I must be heard\nNiggas get what niggas deserve\nYou can put that on my Clan logo, Wu-Tang group or solo\nBloody up my next promo\nWith the blood of the next bozo, clown-ass niggas be loco\nPuffin on lye, cuckoo for cocoa\n\n[Chorus: Cho-Flo & Method Man]\nNigga run with it, have fun with it\nBlow your gun with it, and be done with it\nWelcome to the killing field where Johnny Dangerous\nHeadbanger Boogie niggas going through changes\n\n[Method Man]\nYo yo, shit be hot in the kettle pot\nTwisted metal bust shot til the beef settle, forget me not\nCity nights get a nigga hype, scar of life\nSend em back now we Poltergeist, ghost, tell em\nWho the number the one rap host? Huh?\nVerbal overdose leave em comatose, huh?\nThe nigga with the golden throat is out to get you, Hot Nickel\nBust back and take em with you, eye for eye\nNever lie, crossing my heart, hoping you die\nSomebody pat the engineer down, I think he wired\nI'm off the meat rack, quick to react, my niggas need that\nThey need gats, cocking heat back, be out like Freejack\nThe heat's on, you think one-eight, and Johnny's blamed\nWho that nigga burn biscuits, and spit flame\nLeave no witness, in the fast lane with shady bitches\nThat only want me for my riches, I know your steez\nTerror Fabulous, caution, biohazardous degrees\nFrom this ravenous, MCs be yapping\nMeth be the co-captain, on Def Jam's that's close captioned\nFor hearing impaired, to get a share, now what's happening\nMoney to share, that's why we here\nAnd y'all actin, like we can't eat, like y'all eat\nNow we scrapping, out in the street\nI know your crew's hardheaded motherfuckers\nAnd I'm just like you\n\n[Chorus: Cho-Flo & Method Man]\nNigga run with it, have fun with it\nBlow your gun with it, and be done with it\nWelcome to the killing field where Johnny Dangerous\nHeadbanger Boogie niggas going through changes\n\nWelcome to the killing field, where Johnny Dangerous\nHeadbanger Boogie niggas, going through changes\n\nI been in the ghetto all my life\nI swore to take that bitch for better or for worse, yaknowhatI'msayin?\nThat's for life nigga y'know? Til death do us part..", "image": "https://images.genius.com/7bb2fc25db22a3900f489969a9537f35.954x951x1.jpg"}], "artist": "Method Man"}