{"songs": [{"title": "Tha Block is Hot", "album": "Tha Block is Hot", "year": "1999-10-23", "lyrics": "[Intro: Lil' Wayne]\nWha wha, wha wha, wha wha, wha wha, what\n\n[Verse 1: Lil Wayne]\nStraight off the block, gold nuts in my hand, trustin' no man\nGot my Glock cocked, runnin' this thing, ya understand\nWe be steamin', blazin', nines, pumps and K's and\nHollygrove 17th the hood where I was raised in (what, what, what)\nNiggas bustin' heads and, runnin' duckin' Feds and (what)\nRocks under they tongues and, ki's under they beds and\nHood fulla real niggas, twenty-four seven hustlers\n(Ughhh) Until we shove a barrel down ya pipe suckers\nAin't no love for no busta, no fear for no coward\nNo respect for no slut, and no money without power\nWe keepin' niggas hotter, ughhh, nasty and sour\nPile up in the Eddie Bauer and \"blocka\" at every hour\nSome niggas like that powder, foldin' up what they drain\nSome like that weed or that dope and some shoot it up in they veins (oh)\nFrom the home of that 'caine, jackin' and crackin' brains\nBroadcastin' live from Tha Block, it's Lil' Wayne (who it is?)\n\n[Chorus: Juvenile, (B.G.) & Lil' Wayne]\nNigga, you got that yayo? (Well cook something, nigga)\nNigga, you let them K's go? (Well bust somethin, nigga)\nAre you duckin' that law? (You better run from 'em, nigga)\nAre you playin' with that raw? (Well won't you front somethin', nigga)\nTha Block is hot, Tha Block is hot, ha, ha-ha\nTha Block is hot, Tha Block is hot, ha, ha-ha\nTha Block is hot, Tha Block is hot, ha, ha-ha\nTha Block is hot, Tha Block is hot, ha\n\n[Verse 2: Lil' Wayne]\nSee where I'm from we keep our guns out\nDodgin' cops and burnin' blocks so we be thugged out\nIt's time to floss, bring the big bodies on dubs out\nAnd they got quarters, halfs and birds in that one house (I got it, I got it)\nIt's all good in the hood hustlin' like it's legal\nSoon as you get it, hot (skrrt!) there go them people\nBreak up the block and hit the cut by the corner sto'\nEnd up in Ms. Taylor backyard, be quiet, she on the porch\nThis everyday, at the spot where niggas murder off top, boy\nIt's the spot where they got fire girls and hot boys\nWe don't know what be goin' 'cause we so blunted from trees\nAnd we'll be round ya all day 'til we \"400 Degreez\"\nAnd you see when it get dark, nobody be on the porch\nThey got a nigga got on a scarf, he flippin' out off that raw\nBetta stay in yo' car, and make sure (*beep beep*) your door is locked\n'Cause this ain't nothin' proper, 'cause Tha Block issss hot\n\n[Chorus: Juvenile, (B.G.) & Lil' Wayne]\nNigga, you got that yayo? (Well cook something, nigga)\nNigga, you let them K's go? (Well bust somethin, nigga)\nAre you duckin' that law? (You better run from 'em, nigga)\nAre you playin' with that raw? (Well won't you front somethin', nigga)\nTha Block is hot, Tha Block is hot, ha, ha-ha\nTha Block is hot, Tha Block is hot, ha, ha-ha\nTha Block is hot, Tha Block is hot, ha, ha-ha\nTha Block is hot, Tha Block is hot, ha\n\n[Verse 3: Lil' Wayne]\nSee watch your step on my set, gotta walk like, talk like\nWe done shot out all the street lights, so you can't see who we be like\nAnd we like, to dress in all black up in my residence\nAin't got on no suits, cause we ain't tryin' to be presidents\nAnd ever since the coke drought, niggas been on a trip y'all\nSo you better watch what y'all playin' with cause a nigga will try to flip y'all\nThey hit y'all, jam you up and put a gun to your jug\nHahhhh, catch your breath, now shhhhh, catch a slug\nIt's street smarts, plenty niggas that keep spots\nWhen the heat starts, ain't nobody got sweethearts\nCallin' weak shots, you could come try to cheap talk\nWe cut your week short, them lil' boys don't give a damn\nGo all out for that cake, won't hesitate to kill a man\nRun in his house and kidnap the nigga, him and his fam\nTie em up, put em in the vans then put a gat in his jaws\nOne move blow his cactuses off\n\n[Chorus: Juvenile, (B.G.) & Lil' Wayne]\nNigga, you got that yayo? (Well cook something, nigga)\nNigga, you let them K's go? (Well bust somethin, nigga)\nAre you duckin' that law? (You better run from 'em, nigga)\nAre you playin' with that raw? (Well won't you front somethin', nigga)\nTha Block is hot, Tha Block is hot, ha, ha-ha\nTha Block is hot, Tha Block is hot, ha, ha-ha\nTha Block is hot, Tha Block is hot, ha, ha-ha\nTha Block is hot, Tha Block is hot, ha\n\n[Outro: Lil' Wayne]\nWHOOT! Some people call me 'cause Tha Block is hot\nShk-a-BLAOW! Bust ya guns 'cause Tha Block is hot\nNigga ch-shhhhh, cook it up, 'cause Tha Block is hot\nSay look daddy, just hook it up, 'cause Tha Block is hot\nNigga WHOOT! Some people call me 'cause Tha Block is hot\nShk-a-BLAOW! Bust ya guns 'cause Tha Block is hot\nNigga ch-shhhhh, cook it up, 'cause Tha Block is hot\nSay look daddy, just hook it up, 'cause Tha Block is hot\nNigga, my block hot, nigga, my block burn\nMy block on fire, nigga, what about yours?\nNigga, my block hot, nigga, my block burn\nMy block on fire, nigga, what about yours?\nTha Block is hot, ha ha ha ha", "image": "https://images.genius.com/c152fa72e2736b6dc0da30cce6d29d6d.1000x1000x1.png"}], "artist": "Lil Wayne"}