{"songs": [{"title": "Sharp Shooters", "album": "Lyricist Lounge 2 ", "year": null, "lyrics": "[Intro – stic.man]\nEverything is politics.  I Ching.  Kweli.  People Army.  You know it…\n\n[Verse 1 – M-1]\nThe white man came to Africa with rifles and Bibles\nHeard the name, started changin’ the titles\nNow instead of Chaka, call me Nat Turner with the burner\nFreedom fighter for this revolution, fuck a wage earner\nSee, I be what John Wilkes Booth was to Lincoln—blam!\nSirhan Sirhan, peepin' through the curtains with my eyes on a Kennedy\nDead prez, politic, know your enemy\nKeep your toast close\nBecause political power come from the barrel of it\nWe in a war, nigga—leave it or love it\nSince they got us in a scope like a P.E. logo\nI watch for the po-po (woop woop) and train at the dojo\nNot a gun Deniro but a working class hero\nTakin’ a stand, like a Panther with an M-1 Garand\nScreamin', “Know your gun laws, self-defense is a must”\nWhen we set it off I'mma be the first to bust\n\n[Hook – stic.man]\nYo, I'm one with my gun, I love it like my first son\nIt protects me and makes sure the jakes respect me\nI'm one with my gun, I love it like my first son\nIt protects me and makes sure the jakes respect me\n\n[Verse 2 – Talib Kweli]\nWhat do you do?\nWhen the police kick in your door like, “Get on the floor”\nShoot you in the back ‘cause who you are and where you at's against the law\nYou try to protect your home with the illest arsenal possible\nLearn how to heal yourself and stop fuckin’ with them hospitals\nGet with brothas down for the cause, givin’ it all they got\nBut every brother ain't a brother (word), fuck around and get shot\nBy these black kings that pack Gatlings\nTo make a rat sing like Nat King before they start blasting (blow!)\nWith no accuracy, handling they beef in the public\nNow an innocent child got a bag for a stomach\nProperty value plummet every time a shot is fired (c'mon)\nPeople feelin’ betrayed, so they take the street to riot\nCops fire shots and try to stop the spirit, takin over the entire block\nPoliticians say it's time to march\nBut people is past that, ready to blast at whatever comin’\nFrom the master or for office, niggas is sick of runnin’\n\n[Interlude – Talib Kweli]\nYeah, all my soldiers raise it up.  C'mon.  Now\n(Bust ya guns)  Yeah, Kweli with dead prez.  C'mon\n(Blow blow)\n\n[Verse 3 – stic.man]\nI'm deep in the runs\nWhere all that niggas give a fuck about is stackin’ funds\nThe black and young type that's packin’ automatic guns\nIf any static comes, sporadic shots'll ring out\nYou get caught up, you get your fucking brains blown clean out\nThe killers reign supreme, survival of the illest brain and scheme\nFor cream, you know the game in my vein\nI feel the pain for all the niggas that passed away\nTryna get cash the fastest way we know how, the old fashion way\nBlastin’, we actin like cock Tecs and tenements\nMy squad flex if any shit pop, and put an end to it\nIt's like hell.  This planet I'm from consist of diligent crack sale\nAssisting off the backs of young black males\nIt's innocent, suspending in packed jails that benefit\nWhite well-being when niggas catch hell just for being\nYou might as well have a life of crime\nAin't nothin’ free in this life.  I stick a nine in ya spine for mine\nNo time for talk ‘cause I walk when I talk\nStalkin’ sidewalks, of course, with the eyes of a hawk\nCrack a quart to get away from this trife world and thought\nPuffin’ Newports ‘cause life's a bitch, and it's too short\nMy crew sport leather, gold, camouflage, rugged denim\nDeadliest venom, totin’ buckets with nothin’ in 'em\nBut ruckus, some ill muthafuckas for real\nStraight hustlas with nothin’ but a taste for kill\n\n[Hook x2 – stic.man]\nI stay one with my gun, I love it like my first son\nIt protects me and makes sure the jakes respect me\nI'm one with my gun, I love it like my first son\nIt protects me and makes sure the jakes respect me\n\n[Outro – Talib Kweli talking]\nYeah, c'mon.  All my soldiers.  Brooklyn, where you at?  Florida, Cincinnati, where you at?  Africa, where you at?  Yo…", "image": "https://images.genius.com/bb2a12043d5bed3ffa2d2b0d3814b69b.600x600x1.jpg"}], "artist": "Talib Kweli"}