{"songs": [{"title": "Perfect World", "album": "Tical 2000: Judgement Day", "year": "1998-11-10", "lyrics": "[Intro: Method Man]\nFirst, they dropped the bomb\nThen came the disease, then death\nThis our world, your world, my world\nI like this world!\n\n[Verse 1: Method Man]\nOn foreign land keep your toast up, hot rocks\nCatch a close up, your snot box broke up\nLand shark tryna post up, reptiles\nTryna throw cub with crooked smiles\nTake your kindness for weakness, they foul\nNew York niggas be loving how the gun talk, \"Pow!\"\nAnother underboss pull a doublecross\nNiggas ain't ready for the holocaust here and now\nWant them games people play, catch these bullets over Broadway\n25 to life up in Rahway get caught\nLook deep into the black thought\nA holy war is being fought on Allah's court\nMy perfect world (if you will!)\n\n[Chorus: Method Man]\nMr. Sandman bring 'em a dream\nInfrared light beams, homicide scene, perfect world\nBy any means get cream\nJust don't let it come between you and I, seen\nEverything is everything in this three ringed circus\nPeoples is swift, tryna work us Lord\nWith Devil worship and satanic verses\nIt takes place in the world perfect, mine and yours\n\n[Verse 2: Method Man]\nHeard when it rains, it pour\nI came to bring the pain once more\nPedal to the floor peep the Jim Crow Law\nThe Big Apple rotten to the core, these niggas want war?\n(Give 'em war)\nThey scheming and eye-beaming\nHitmen like Crying Freeman, they need cleaning\nKeep it coming 'til they all running, screaming\nBloody murder at war with them inner demons, it's going down\nInvasion USA, spitting rounds\nIf these shells hit the battleground\nPave the way for birth of a Generation X\nSpoken with a project dialect\nBomb threat to the airwaves, hit the deck\nPressed for time in a world lacking sunshine\nGot love for my family cause they mine\nSee niggas dying in the streets over petty crime\nWe gon' eat or die trying, got my mind made up\nYoung buck, just don't give a fuck\nPressing they luck when they best best to give it up\nPerfect world, baby, what? Nigga head or gut, them or us\nWelcome to the dark ages\nDirty pages of filth, fine filth flavors\nDust to dust and ashes to ashes\nLife flashes right before his eyes, then he passes\n\n[Interlude: Cho-Flo]\nWhile the 666 got more tricks than the PD's got bricks\nFrom Bloods and Crips to pimps with mints\nWe still licking the scars from whips on slave ships\n\n[Chorus]\n\n[Outro: Method Man]\nThe children are the future\nAnd Wu-Tang is for the babies!", "image": "https://images.genius.com/7bb2fc25db22a3900f489969a9537f35.954x951x1.jpg"}], "artist": "Method Man"}