{"songs": [{"title": "Dollar Day", "album": "True Magic", "year": "2006-12-29", "lyrics": "[Intro]\nSo there's a story about the lady in Louisiana\nShe's a flood survivor and the rescue teams\nThey come through, and they, I guess tryna recover people\nAnd they see this women she's wadin through the streets\nI guess it'd been some time after the storm\nAnd I guess they were shocked that you know she was alive\nAnd rescue worker said, \"So, oh my God h-how did you survive\nHow did you do it? Where've you been?\"\nAnd she said, \"Where I been? Where you been?\"\nHah, Where you been? You understand?\nThat's about the size of it\n\nThis for the streets, the streets everywhere\nThe streets affected by the storm called... America\nI'm doin this for y'all, and for me, for the Creator\n\n[Hook]\nGod save, these streets\nOne dollar per every human being\nFeel that Katrina clap\nSee that Katrina clap\n\n[Verse 1]\nListen, homie, it's Dollar Day in New Orleans\nIt's water water everywhere and people dead in the streets\nAnd Mr. President he bout that cash\nHe got a policy for handlin the niggas and trash\nAnd if you poor you black\nI laugh a laugh they won't give when you ask\nYou better off on crack\nDead or in jail, or with a gun in Iraq\nAnd it's as simple as that\nNo opinion my man it's mathematical fact\nListen, a million poor since 2004\nAnd they got -illions and killions to waste on the war\nAnd make you question what the taxes is for\nOr the cost to reinforce, the broke levee wall\nTell the boss, he shouldn't be the boss anymore\nY'all pray amen\n\n[Hook]\nGod save, these streets\nOne dollar per every human being\nFeel that Katrina clap\nSee that Katrina clap\nGod save, these streets\nQuit bein' cheap nigga freedom ain't free\nFeel that Katrina clap\nSee that Katrina clap\n\n[Bridge]\nLord have mercy\nLord God God save our soul\nA God save our soul, a God\nA God save our souls\nLord God God save our soul\nA God save our soul soul soul\nSoul survivor\n\n[Verse 2]\nIt's Dollar Day in New Orleans\nIt's water water everywhere and babies dead in the streets\nIt's enough to make you holler out\nLike where the fuck is Sir Bono and his famous friends now\nDon't get it twisted man I dig U2\nBut if you ain't about the ghetto then fuck you too\nWho care bout rock 'n roll when babies can't eat food\nListen homie man that shit ain't cool\nIt's like Dollar Day for New Orleans\nIt's water water everywhere and homies dead in the streets\nAnd Mr. President's a natural ass\nHe out treatin niggas worse than they treat the trash\n\n[Hook 2]\nGod save, these streets\nOne dollar per every human being\nFeel that Katrina Clap\nSee that Katrina Clap\nGod save, these streets\nQuit bein cheap nigga freedom ain't free!\nFeel that Katrina Clap\nSee that Katrina Clap\nSoul survivor\n\n[Bridge 2]\nGod God God save our soul\nA God save our soul\nA God, a God save our soul\nLord God God save our soul\nA God save our soul a God a God save\n\nLord did not intend for the wicked to rule the world\nSay God did not intend for the wicked to rule the world\nGod did not intend for the wicked to rule the world\nAnd even when they knew it's a matter of truth\nBefore they wick-ed ruling is through\n\n[Hook 3]\nGod save, these streets\nA Dollar Day for New Orleans\nGod save, these streets\nQuit bein cheap homie freedom ain't free\n\nGod save these streets\nOne dollar per every human being\nFeel that Katrina Clap\nSee that Katrina Clap\nGod save these streets\nQuit bein cheap nigga freedom ain't free!\nFeel that Katrina Clap! Ha\nGhetto Katrina Clap! Ha\n\nSoul survivor\nLord God God save our soul\nA God save God save our soul\n\nFeel that Katrina Clap\nLet's make them dollars stack\nAnd rebuild these streets\nGod save these streets\nGod save these streets\nGod save the soul!\nFeel that Katrina Clap\nSee that Katrina Clap\nSoul survivor\n\nDon't talk about it, be about it\nPeace", "image": "https://images.genius.com/50acba8e30cec066c838d6f22dd475e3.500x500x1.jpg"}], "artist": "Yasiin Bey"}