{"songs": [{"title": "Sydney Freestyle", "album": null, "year": "2014-07-27", "lyrics": "[Verse 1: Childish Gambino]\nThey used to think that I was dumber and dumber\nI use to give a rubber, I'm from Australia like 5 Seconds of Summer\nThese niggas know what I be doing I run with, I run it\nNiggas act like they stunting, niggas know that I'm stunning\nI hip hop with that OK\nNiggas know that I don't play\nNiggas know that I come through\nNiggas they be like \"fuck you!\"\nFuck you, I'm like \"fuck me?\"\nFuck ya girl, fuck ya bitch\nFuck ya girl, hold my dick\nAll I do is run that shit\nAh la la la I oh\nI still get that dough\nThese nigga know, know, know, these niggas don't even know?\n(They don't know) what?\nI be surfing off the Gold Coast\nLooking like the popo, niggas like a goal post\nMaking so much green, niggas calling me the [?]\nAnd all I do is sing\nI got this million dollar bet, Steven, speak out the name\n\n[Verse 2: Steve G. Lover]\nThese bitches love me to death\nYou know that we fresh, I can't do culture, can't stop my ass\nThese niggas mad at [?] with all my [?]\nThese niggas know that we mean, royalty be the team\nSmokin' that hella green, spending a lot of cream\nSpending a lot of green on bitches with these green eyes\nYou that I'm a dream guy, a dream girl\n[?] me in dream car, dream house, dream money, dream sleep\nNah, I don't sleep never\nMy weed light like a fuckin' feather\nAnd Sydney I know I had to\nCome with my own shit, your shit don't smoke\nI'm sorry, I'm keepin' it real\nYou know me I feel like I be doing what I do for deals\nRoyalty the shit put your hands up\nIf you that Gambino is the shit, put your hands up\n\n[Verse 3: Childish Gambino]\nYou niggas think that I'mma ride\nAll I do is do it inside, keep it inside\nI'm the best rapper, definitely top 5\nIf these other rappers think they boy they fuckin' not alive\nI cut their head off, that's every rapper living\nThat's Kendrick, that's Drake, that's Schoolboy, that's everyone\nI don't give a fuck, I'll fucking kill you niggas (I'll fucking kill you niggas)\nThese niggas think I'm bigger, uh\nGod damn, motherfucker, I'm ill\nAll I do is freestyle, take a fuckin' pill\n'Cuz you about to be sick, nigga I'm so sick\nI came in your girls face, she don't know what got hit\nShe gotta close her eyes, she gotta close her eyes\n\"Donald Glover, why you cum in my eye?\"\nI'm like \"sorry boo, I gotta come up inside\"\n\"And if you wanna feel that [?] kick in your thighs\"", "image": "https://images.genius.com/5a9c598da4e86fefcb845cbbe74706aa.1000x1000x1.jpg"}], "artist": "Childish Gambino"}