{"songs": [{"title": "Slimed In", "album": "Slime Language", "year": "2018-08-17", "lyrics": "[Chorus: Nechie]\nWhat's your kind then, yeah my slimes in\nAll these diamonds, fuck you thought? (fuck you thought?)\nWipe your nose clean, fuck your whole team\nWe don't spare a thing, knock 'em off\nWhat's your kind then, yeah my slimes in\nAll these diamonds, fuck you thought?\nWipe your nose clean, fuck your whole team\nWe don't spare a thing, knock 'em off\n\n[Verse 1: Nechie]\nFuck you thought? (fuck you thought?), we want war (we want war)\nTake 'em down, knock 'em off (knock 'em off)\nYeah my slimes wit it, I was born tinted\nYou can see who in it, presidential living\nYou can see we winnin', fuck you thought? (fuck you thought?)\nI put VVS' in my mouth (in my mouth)\nStraight out the south (out the south), I got clout\nI was chain gang bound, now I'm out (now I'm out)\nYou ain't gang gang gang, take 'em out (take 'em out)\nI got game for a lame, fuck you thought? (bitch you soft)\nBitch, I'm slicker than da oil, get it out the soil\nInsane with them cutters, who want war with the boy? (it's Nechie, bitch)\n\n[Chorus: Nechie]\nWhat's your kind then, yeah my slimes in\nAll these diamonds, fuck you thought (fuck you thought?)\nWipe your nose clean, fuck your whole team\nWe don't spare a thing, knock 'em off\nWhat's your kind then, yeah my slimes in\nAll these diamonds, fuck you thought? (fuck you thought?)\nWipe your nose clean, fuck your whole team\nWe don't spare a thing, knock 'em off\n\n[Verse 2: Young Thug]\nI'm in Balmain, it didn't cost a thing\nI'm not 2 Chainz, I got forty (I got forty)\nI bust your brain, since we speakin' of brain\nMake your hoe give brain then get lost (then get lost)\nI paint her face, you can call me Cosey\nFuck a Ric Flair, I got 70 Rollies\nI rock big Shaq, Chinchilla minks, when she cozy\nYou ain't gang gang gang gang gang, why you talkin'?\nI bought 20 cars for every year that I was walkin'\nMade her get an abortion, she ain't nothing but a thottie\nAnd I got way better bitches 'round I can lock in, I'm so bossy\n\n[Chorus: Nechie]\nWhat's your kind then, yeah my slimes in\nAll these diamonds, fuck you thought? (fuck you thought?)\nWipe your nose clean, fuck your whole team\nWe don't spare a thing, knock 'em off\nWhat's your kind then, yeah my slimes in\nAll these diamonds, fuck you thought? (fuck you thought?)\nWipe your nose clean, fuck your whole team\nWe don't spare a thing, knock 'em off\n\n[Verse 3: Nechie]\nNechie slang slang slang (it's Nechie), ain't gon waste no time (slang)\nBoy you ain't my kind, I get cheese, you drop dimes\nPrezi diamonds on my neck, my wrist, my ear (yeah)\nNechie Houdini, I make him disappear (oh yeah)\nGet you knocked out (nah), cut the top off (off)\nFuck twelve, yeah we smashin' on a cop car (cop car)\nI'm out on bail sippin' clean, yeah that real raw (raw)\nI'm a thug, I don't give no damn about no DA or no judge\nI get it out the mud (yeah yeah)\nStep off in your club and throw a dub (yeah yeah)\nGive 'em hell (hell), I might call Lil Baby for a bale, don't need no scale (scale)\nSouthside, youngin' on my side on the mayor", "image": "https://images.genius.com/54b22adf2c79e1df9cb61a1db387ed4c.1000x1000x1.jpg"}], "artist": "Young Thug"}