{"songs": [{"title": "FUCK 12", "album": "QUAVO HUNCHO", "year": "2018-10-11", "lyrics": "[Intro: Malcolm X]\nWe are denied not only civil rights, but even human rights. So the only way we're going to get some of this exploitation away from us, or aside from us... Who taught you to hate the race that you belong to? So much so that you don't want to be around each other. Who taught you to hate the texture of your hair? Who taught you to hate the color of your skin?\n\n[Verse 1: Quavo]\nFabrics, fabrics (Whoo)\nExpensive, linen (Linen)\nPut that bitch in the kitchen, in the kitchen whippin' (Yaa)\nBack in the days, I was doin' lord willin' (Hey)\nMama gonna kill me, double cup spillin' (Spillin')\nEvery time I get the hundo, Will I'm trippin' (Trippin')\nEvery time your bitch phone rings she workin' (brr-brr)\nGet no playin' time, Kendrick Perkins (Ayy)\nRockin' Timbs like I'm in New Jersey (Jersey)\nDubs versus Hawks, took off KD jersey (KD)\nAnd he scored a 30\nUp real early (Early), servin', servin', servin'\nFuck that bitch, she a virgin (Smash)\nSaid she had to go to work, she was nursin' (Nursin')\nI can turn the pot to the armed service (Armed)\nI declare war on your whole 30 (30)\nChoppa hold a hunnid\nIf I wasn't real, I would be a hunnid (Hunnid)\nSo that mean everything authentic ('Thentic)\nEvery car I get, windows presidented (Presidented)\n\n[Chorus: Quavo & Offset]\nFuck 12, fuck 12 (Woo woo)\nFuck 12, fuck 12, fuck 12 (Woo woo)\nFuck 12, fuck 12, fuck 12 (Woo woo)\nFuck 12, fuck 12, fuck 12 (Woo woo)\nFuck 12, fuck 12, fuck 12 (Woo woo)\nFuck 12, fuck 12, fuck 12 (Woo woo)\nFuck 12, fuck 12, fuck 12 (Woo woo)\nFuck 12, fuck 12, fuck 12 (Woo woo)\nFuck 12, fuck 12 (Yeah, hey!)\nFuck 12, fuck 12, fuck 12 (Woo woo)\nFuck 12, fuck 12, fuck 12 (Woo woo)\nFuck 12, fuck 12, fuck 12  (Woo woo)\nFuck 12, fuck 12, fuck 12 (Woo woo)\nFuck 12, fuck 12, fuck 12 (Woo woo)\nFuck 12, fuck 12, fuck 12 (Woo woo)\nFuck 12, fuck 12, fuck 12 (Woo woo, Offset)\n\n[Verse 2: Offset]\nKnocking at the door, bail (12, 12)\nCookin' up the dope, Ro-tel (Dope, dope, cookin')\nYou can get a whole wholesale (Wholesale)\nFuck 12, 12 on my coattails (Fuck 12)\nThey hatin', contemplatin' on the money (Hey), I'm makin'\nFirst niggas trappin' out the bando (Bando), you fakin'\nKarate chop the brick, cut it up, Ninja Gaiden (Waa)\nGo and get the re-up, out the buck, not later (Go)\nKickin' my feet up, the J wanna eat up (Kick)\nYour bitch addicted to this drip like a needle (Addict)\nDetective on my back, just took my money, I'm illegal (12)\nShootin' at the pigs, they been killin' all our people (Pig)\nYoung, rich, black, got my mama on my back (Mama)\nDaddy disappeared when my mama took him back (Grandma)\nYou shot him 'cause you thought he had a gun or he black (Woo)\nYou better watch out for the boys when you're black (Woo-whoo)\n\n[Verse 3: Quavo]\nI'm doin' just what I wanna (For real)\nDon't believe me, bet a hundred (Bet it)\nBet a nigga won't go under (Bet it)\nHuncho realest out the jungle (Huncho)\nI got the bricks from Wakanda (Bricks)\nThem boys did the block over yonder (Skrr)\n12 tried to pull a young nigga over (Brrt)\nOne call to my mama\n'Cause I'm black (Mama), I don't know how to act (Nah)\nFuck the front seat, I go sit in the back\n'Cause I'm black (Black), I don't know how to act\nDouble my cup and pour yak (Martell)\n'Cause I'm black, I don't give a fuck about that\nYou judging me off the face tats (Whoa)\nAnd I'm black (Black)\nWhips on my back (Whip), got me the whips out back (Whoo)\n\n[Chorus: Quavo]\nFuck 12, fuck 12\nFuck 12, fuck 12, fuck 12\nFuck 12, fuck 12, fuck 12\nFuck 12, fuck 12, fuck 12\nFuck 12, fuck 12, fuck 12\nFuck 12, fuck 12, fuck 12\nFuck 12, fuck 12, fuck 12\nFuck 12, fuck 12, fuck 12\n\n[Outro: Quavo, Malcolm X & others]\nHands up, don't shoot\nHands up, don't shoot\nHands up, don't shoot (Fuck 'em)\nHands up, don't shoot (Fuck 'em)\nHands up, don't shoot (Fuck 'em)\nHands up, don't shoot (Fuck 'em)\nHands up, don't shoot\n(Fuck 'em, fuck 'em, fuck 'em, fuck 'em)\nWe are being killed every day\nThis gon' be your life every day\nYou gon' get tired of this shit before we do\nYou can ask yourself who taught you to hate being what God made you\nFuck 'em\nFuck 'em", "image": "https://images.genius.com/39a1f9d0d1403b9749469ec36ad251e9.1000x1000x1.jpg"}], "artist": "Quavo"}