{"songs": [{"title": "Keep On ’99", "album": "Doc’s da Name 2000", "year": "1998-12-08", "lyrics": "Intro: Dave Rockin' Reel\n\nIt's about 40 degrees out there\nI know all you out there listenin to these sounds\nHumpin and a bumpin out in your Jeeps\nWell, ahh.. you tell em Moe (*fart sound*)\nThat's right, and right now, we're gonna hit you off\nWith one from Redman, and uhh, it's about uhh\nWell.. OOH OOH AHH AHH, he's gon', LET THE MONKEY OUT\n\n[Redman]\nHa, Chi-Town in the house\nYo, yo-y-yo-yo\nNow first of all I be the Doc smokin blocks of hash\nAlert your fag ass commisioner when I harass because\nHood regulation is, no infiltration\nIf it's hot to your crew, then it's hot to the next patient\nI'm in The Bricks like backspins on the mix\nI'm not a playa, but y'all hatin me like I'm a pimp\nThese cars y'all talk about, the Doc already whipped\nYou bout to go downtown bitch, like Tha Shiznit\nOverseas bangin cot in the parkin lot\nI'm overdosin in a Amsterdam coffee shop\nAnd when you lust for hardcore music to bust\nTrust that nigga who bubble mo' than Alka-Seltzer Cold Plus\nStatic, niggas actin all dramatic\nI'd rather smoke cabbage, in the chair gettin tatted\nMy P.O. tried to violate me for the habit\nBecause I walked in the office rockin straight karats\n\n[Hook]\nGonna ride in the hoop' with a freak tonight\nHope to God I don't have to pull the heat tonight\nBut uhh, light up a L cause I'm a nigga fo' life\nHustlers, got the shit that'll keep you high!\n[N.W.A. sample from 'She Swallowed It']\n\"Gently place the balls, into the mouth, and .. HUMMMMM\" (2X)\n\n[Redman]\nYo, I'm in your local ghetto rollin' a Corona De Luxe\nBitch you better hit the 40, fuck a margarita!\nShit I still scam change out the parkin meter\nAnd get a bunch of pussies wet overfloodin peanuts\nYes, smoke a quarter-sacks, hut one two\nMy cerebral will keep the white boys sniffin glue\nHotter than Champagne Rump Shaker Part II\nGet dap like the Mad Rapper, \"Who da fuck are you?\"\nThe Loaded Desperado, I'm cooler than Rollo\n(Aiyyo, what you hittin Doc?) I'm hittin hoes up in the Tahoe\nGettin chickens fightin in the back of the Apollo\nSay, \"Fuck dat!\" if I'm a tough act to follow\n(\"Fuck dat!!!\") Disagree I bring the beef gyro\nOnly right I spiral the hot shit that I roll\n\n[E Double]\nThen buy a six shot Eclipse with plastic grips\n\n[Redman]\nAnd get a gangsta bitch who love robbin shit!\n\n[Hook]\n\n[Redman]\nIt don't stop y'all, it don't stop nigga\nYou don't stop y'all, it don't stop nigga\nI turn an independent woman back into a HOOCHIE\nMake a Jew rock a Dashiki and a KUFI\n\n[E Double]\nI be the, Nutty Professor, style aggressor\nPut rappers under pressure, with no cooker\n\n[Redman]\nRock it to a T. like Booker, you're straight shook up\nI can't hang with pussy niggas who be scared as hell to push up\nToo much money and, not enough time\nIt be, too many thugs and not enough nines\nHey ho, here come five-oh, stash the blow\nStop suckin on my dick and slide on your Kenneth Coles\n\n[E Double]\nAnd everytime we look around them niggas on my block\n\n[Redman]\nAiyyo them Def Squad motherfuckers keeps it hot\n\n[Hook] (2X)\n\n\"HUMMMMM\" (2X)", "image": "https://images.genius.com/ff1bcd7d83855df13cac08a00e033052.594x594x1.jpg"}], "artist": "Redman"}