{"songs": [{"title": "Warriorz (MF Doom Special Blend)", "album": "Special Blends Volume 1 & 2", "year": null, "lyrics": "[Produced by MF DOOM]\n\n[ Verse 1 : Lil' Fame ]\nWhy y'all niggas is sis' to fuck with Lil' Fame\nI analyze the streets, spit real game\nI'll blast on you as you pass on through\nCatch you right where you stand put your ass on you\nI remind niggas with that blue steel that you rip\nAnd the rush that you felt from the nigga that you hit, now\nHow many niggas wanna ride with me, collide with me\nBe accesoires to homicide with me [ First Family! ]\nWho I hang with, bang with, spit flames with\nThe hand full of niggas that I came with\nI ain't tripping, I know you got a hell of a plan\nFor the man if you ever caught me slipping\nYou will stop me, won't you, pop me, won't you\nBut you know I'll whoop ya motherfucking ass bitch, don't you\nMy family strong, your mams don't need so stop breathing'\nBefore you cats and you ass get deleted\n\n[ Chorus 2x]\nLook, ain't nobody stoppin' this here\nYou'll see it, it's on and poppin' this year\nMound up (Mound up!) Pounds up! (Pounds up!)\nWe build this foundation, from the ground up nigga\n\n[Verse 2 : Billy Danze ]\nStand up faggot, I'll let you have it where you post at\n(William Berckowicz!) Back with my golden fiend and Womack\n(BLAOW!) Nigga hold that, Juliani can't control that\n(We buss outta clutches on Magnum triggers) He know that\nWith the same cats that blaze DAT's on the boulevard\nWe remain strapped, then came back, doin' it hard\nSo send your soldiers cobra and I will send everyone of 'em back\nWith holes under they' hat, falls of through they' back\nDamn with it motherfucker (BK!) All day real with it motherfucker\nI'm not your average, I'm from a block where they trap cops\nAnd made 'em holler ten-thirteen\nIt's the commander, Danze, hands, down\nYou need to know who you fucking with now\nNow kill-a-kill again, with an unusual will to win\nAn unusual will to sin, stop fucking with me\n\n[ Chorus 2x]\nLook, ain't nobody stoppin' this here\nYou'll see it, it's on and poppin' this year\nMound up (Mound up!) Pounds up! (Pounds up!)\nWe build this foundation, from the ground up nigga\n\n\n[ Verse 3 : Lil' Fame ]\nIt's an every day thing in a every day game\nMore day every day, motherfucker bang (BANG!)\nIt's the streets in me, and me, I'm staying tuned to this shit\nIt's music to my ears, I'm immune to this shit\nI'm suffering, from a disease called 'Leave me the fuck alone'\nIn this full blown (blown), bitch\nM.O.P., prepare for the ruckus\nAnd we murder-murder-ma-murder-murder you motherfuckers\n\n[ Verse 4 : Billy Danze ]\nAllow me the way out, down out, pull my gun out\nRun out in the middle of a street light (Bum, bum bum)\nAh, there you go, bastard, murder international, custom main caskets\nNow could any of you cocksuckers turn to me\nThe way this streetgame is going is concerning me\nWhatever happened to the old days\nWe all blaze, we all study criminal ways\n\n[ Chorus 2x]\nLook, ain't nobody stoppin' this here\nYou'll see it, it's on and poppin' this year\nMound up (Mound up!) Pounds up! (Pounds up!)\nWe build this foundation, from the ground up nigga", "image": "https://images.genius.com/fe984b3368b9e8464fe6eac0d564c44d.500x500x1.jpg"}], "artist": "MF DOOM"}