{"songs": [{"title": "Get At Me Dog (Remix)", "album": "Unleashed & Unreleased Vol. 2", "year": "2002-01-01", "lyrics": "(Yea I'm right here dog) Where my dogs at\n(We right here dog) Where my dogs at\n(I'm right here dog)\n\nWhat must I go through to show you shit is real\nAnd I ain't really never gave a fuck how niggas feel\nRob then I steal, not cause I want to cause I have to\nAnd don't make me show you with the Magnum\nIf you don't know by now then you slippin\nI'm on some bullshit thats got me jackin, niggas flippin\nI got my man and them stay pretty like I'ma stay shitty\nCrimey it's all for the money is you wit me\nHit the bitches, went out I could make the crime\nAnd when it's on we transform like Optimus Prime\nI'll form the head, roll out let's make it happen\nIf we ain't gonna get it wit them we'll take the cap down\nBust it off, gust it off on the softest niggas\nMoney with the biggest mouth, yo let's rob this nigga\nA novice nigga never made a sound\nBreath too fuckin hard like you gettin bust down\n\nYo, yo ya niggas wanna be killers (get at me dog)\nYa niggas wanna feel us (get at me dog)\nYa niggas want the real (Get at me dog)\n\nRrrrrr arf arf what the deal\n\nY'all niggas fucking with the L.O.X\nYour stuck on a rock\nGot that Alcatraz flow\nYou just don't know\nLifetime kid caged in blazin'\nAny type of rapper or federal agent\nPaniro the made man, blade man\nStand up type of guy, your living a lie\nNiggas wanna be pretty and fly but kiddies will die\nThe dogs run the city, bet fifty on mine\nTwo grams for you to sniff, how silly am I\nGot a lot of jokes don't, kill yo ass won't I\nMaybe not if the spot is filled up with po 9\nMany niggas get it confused, blame the rules\nOnly ask the how's not the who's\nBetter off busting your tool, then we might get the crew\nBut as far as rap goes, you a motherfucking fool\nIf you don't want chips, you should have stayed in school\nYou and 8-ball nigga, you wanna play pool\nI'll put you in the side pocket, look at the size of my rocket\nStyles don't lie, cop the work then clock it\nBoxes full of boots, jeans, suits and watches\nNiggas don't pump if they can't make a profit\nStop it, before we pull it back then cop it\nVacant lot niggas come through then we\nYeah, what? what? what?", "image": "https://images.rapgenius.com/1434e8ee824f41e765821605650b321b.500x366x1.jpg"}], "artist": "DMX"}