{"songs": [{"title": "The Wrong Nigga to Fuck Wit", "album": "Death Certificate", "year": "1991-10-29", "lyrics": "[Verse 1: Ice Cube]\nGod damn, it's a brand new payback\nFrom the straight gangsta mack in straight gangsta black\nHow many motherfuckers gotta pay\nWent to the shelf and dusted off the AK\nCaps gotta get peeled\nCause \"The Nigga Ya Love to hate\" still can \"Kill at Will\"\nIt ain't no pop cause that sucks\nAnd you can New Jack SWING on my nuts\nDown wit the niggas that I bail out\nI'm platinum bitch and I didn't have to sell out\n\"Fuck you, Ice Cube!\", that's what the people say\nFuck AmeriKKKa, still with the triple K\nCause you know when my nine goes buck\nIt'll bust your head like a watermelon dropped from 12 stories up\nNow let's see who'll drop\nPunk motherfuckers tryin' to ban hip-hop\nFuck R&B and the runnin' man\nI'm the one that stand, with the gun in hand\nMake sure before you buck wit duck quick\nPunk, cause I'm the wrong nigga to fuck with\n\n\"I'ma let y'all know one thing man..\"\n\n[Verse 2: Ice Cube]\nHell yeah it's on, you better tell 'em\nIce Cube and I'm rolling with the motherfuckin L.M\nIt's the number one crew in the area\nMake a move for your gat and I'll bury ya\nAshes to ashes, dirt to dirt\nPunks roll when I put in work\nCause Lench Mob niggas are the craziest\nAnd y'all motherfuckers can't fade my shit\nSouth Central, that's where the Lench Mob dwell\nHittin fools up with the big ass L\nOne time can't hold me back\nSweatshirt, khakis and crokersacs\nStop givin' juice to the Raiders\nCause Al Davis never paid us\nI hope he wear a vest\nIt's all about the L-E-N-C-H y'all know the rest\nMuthafuckin' crew, muthafuckin' mob\nDo a muthafuckin' job in a muthafuckin' squad\nIn '91 Ice Cube grew stronger and bigger\nAnd I'm the wrong nigga to fuck with\n\n\"One-and-two, ah-three-e-and-ah-four-and..\"\n\"Wait a minute, wait a minute, wait a minute\"\n\n[Cube] Drop a old school beat!\n\n[Verse 3: Ice Cube]\nLike I said, it's a brand new payback\nNow in '91, let's see whose beats get jacked!\nSir Jinx grew a little bit taller\n(Keep the wack beats out)\nTrue motherfuckin' baller\nAnd hoes can't roll on\nEven bitches looking like En Vogue gotta \"Hold On\"\nDon't let me catch Daryl Gates in traffic\nI gotta have it, to peel his cap backwards\nI hope he wear a vest too, and his best blue\nGoin up against the Zulu\nBreak his spine like a jellyfish\nKick his ass til I'm smellin shit\nOff wit the head, off wit the head I say\nAnd watch the devil start kickin'\nRun around like a chicken\nGrand Dragon finger lickin'\nYo, turn him over wit a spatula\nNow we got, Kentucky Fried Cracker\nMess with the Cube, you get punked quick\nPig, cause I'm the wrong nigga to fuck with!\n\n\"Last person in the world you wanna fuck with\" (x3)", "image": "https://images.rapgenius.com/89a02ab603eae95e0d380fcd08eda589.1000x1000x1.jpg"}], "artist": "Ice Cube"}