{"songs": [{"title": "Say Hi To The Bad Guy", "album": "The Predator", "year": "1992-11-17", "lyrics": "[Intro: *guy talking*]\nGood evening. Police, do not try to adjust your radios. There is nothing wrong. We have takin control over this city as to bring you this special bulletin and we will return this motherfucker to ya as soon as the National Guards move in\n\n[Verse 1:]\nThe cops wanna catch the nigga that won't fetch\nBut I'll blast ya, never call ya master\nWho is that kickin up shit much faster?\nRollin on a scooter, you know I might do ya\nSee a black cop and my buckshots run right thru ya\nI never knew ya\nCos I'm not a trick\nYou can suck the biggity-dick, I'm not the piggity-pig\nI get away quickity-quick\nOn the plane to South Central\nNever get played by the monkey wrench ho\nSteady mobbin' I'm just like Robin Hood\nUp to no good, so many bitches on my wood\nTo the right of me and to the left of me\nBitch, I got so much game I need a referee\nThrow a penalty of ass interference\nDamn, y'all over me, so bitch get on the bench\nHere comes the cops so I better hit the fence\nBetter run fast cos the dobermans pinch\nAnd I won't play mine in the daytime\nGoddamn, here comes the canine\nFour legged copper that wants to use Ice Cube as a whopper\nBut who's the first nigga to outrun a chopper?\nNo lie say hi to the bad guy\n\n[Interlude: *Cube talkin with officer*]\nFuck! (Hey guys, where ya headed?)\nNowhere, man (Got your licence and registration?)\nYeah, hold up, right here (Hey, what's in that box back there?)\nNuttin, aah, nuttin (They happen to be donuts?)\n(Ya got a glazed donut? How bout a bearclaw?)\nAaah... (If you don't have one, I got ta gaffle ya)\nWhat? You gon' gaf... Yeah!\n\n[Verse 2:]\nSee one-time, hit em up\nCos you know the Lench Mob is down to get em up\nPeople think Ice Cube roll with the gangs\nCos I'm in a coupe dat' sittin' on thangs\nAin't gotta tell me twice about the jack\nSee a got a 9 in my lap ta take care of that\nCaps get peeled on the regular\nCos niggas try to get me for my cellular\nKnick knack paddy wack, the mack daddy's back\nKidnappin hoes like the Patty Hearst jack\nHave the white ho with a fo'-fo'\nGo rob a liquor store, they can't blame it on a Nigga-o\nBring the money to the rooster\nHad the bitch and the Mob bein the booster\nDamn, can't stand when the bitch get sent to Sybil Brand\nAnd come back a man\nYou wanna point the finger at me cos the OG\nIs souped like Chef Boyardee\nHumpin, jumpin, had the place jumpin\nGoddamn, gotta break you off somet'in\nYou wanna know why I bust and how\nNow look at you now\nHuh, and I'm out real fast\nGet the paper out yo' ass, baby\nYo, here we go, listen to the pro\nShoot the bo-bo and act like ya know, ho\nFuck with the flow and die\nWhen I walk by say hi to the bad guy\n\n[Interlude:]\nAi yo man, there's just one left (I'll make a deal with ya)\nWhat? (Aah, ya got one of those powdered donuts?\n(How bout that twister? If it have cream in the middle, I'm gonna have to\nGaffle ya!)\nYou gon' gaffle us? (Hey, can I reach back there and get one?\nAaah yeah homie, go on and reach ahead here\nTuck ya head in there, man\n*gun shots*\n(What kind of a cop killer are you?)", "image": "https://images.genius.com/aa204256470ef9ed3c3a3fbcc1ee43da.1000x1000x1.jpg"}], "artist": "Ice Cube"}