{"songs": [{"title": "Basically", "album": "Dare Iz a Darkside", "year": "1994-11-22", "lyrics": "[Basically] (24X)\n\n[Verse 1]\nOh shit! Hey dudes my interludes\nMore fatter than most niggas LP's, so don't sell me the stale cheese\nI'm more nicer than Little Red Robin Hood's grandmama\nPuffing on ganja, sipping on a, Cherry Bianca\nMy grand finale's like an alley when it's rowdy\nKick more bars than the penile G and let my nine cock loudly\nClick click, bee-yow, bang, booyaka, what am I do to ya?\nIt's something new to ya, like screwing ya, all over my studi-ah\nRide on my MP-60 and let the S-950 squeeze your titties\nThat quickly I hooked you, now fix me with your lips b\n-atch, unloosen my belt thinking to grab the crotch\nBut before you do move my Glock before it shoot my cock\n\n[Bridge]\nAnd see basically them trick bitches get no dap (word)\nAnd see basically Redman album is no joke (word)\nAnd see basically I don't get caught up at my label (word)\nCause I kill when they fuck with food on my dinner table (word)\n\n[Verse 2]\nI drop a punchline at lunchtime, cause I'm a Close Encounter\nOf the None Kind with dumb rhymes, I battle all of y'all at one time\nSo fuck all you fools out there with the large vocabulary\nIn your sentence, I don't need that shit to pay my rent with, huh\nAnd to the nosey snake-ass hoes I ask you\nWhy you be acting all fly when your monkey-ass work at fast food?\nAnd why is it everytime that a multi-platinum artist\nAlways use the underground to make a comeback?\nIs it fair to the hardcore niggas that rap?\nThat don't give a fuck about the radio plus the next bitch at that?\nAnd being hardcore and mad about wearing high-tech boots and black skully hats?\nAnd making fake-ass frowns because your best buddy packs?\n\n[Outro]\nThink about it\nSip on a chocolate thai, and let your brain fall out of focus\nThis is another episode, coming live from the Funkadelic man himself", "image": "https://images.genius.com/d90c906f33a174fa71425b4dd339eb96.1000x1000x1.jpg"}], "artist": "Redman"}