{"songs": [{"title": "Big", "album": "Death Race for Love", "year": "2019-03-08", "lyrics": "[Intro]\nHmm, uh-huh\n(Hit-Boy)\nBitch\nMan, this life shit gettin' crazy, crazy\nI done, I done made it\nI done made it, made it, yeah\nI'm sick and tired of these hatin' ass niggas, though\nLet my dick breathe for a couple seconds, man, shit\nFuck nigga\nUh, yeah\n\n[Chorus]\nI'm on a Percocet, yeah, I just had to relapse\nEven at my worst, I'm feeling like I am the best\nI done Metta World Peace to myself like I'm Ron Artest\nI never been a referee but I still got a Tec, Kel-Tec\nShoot you in your stomach, make this shit hard to digest\nRockstar, listening Jimi Hendrix in the projects, yeah\nI'ma turn a nigga block to an art project\nPicasso, I paint that, where the fuck is the bank at?\nArmy sergeant, no rank, yeah, okay\n\n[Verse]\nIf you ain't payin' a hundred thousand, get them features out my face\n50K to install a codeine fountain in my new estate\nI got that pump, it's ironic how that pump made him pump his brakes\nI ain't Lil Pump but I got double Glocks on me like Gucci Gang\nWe ball like Wilt Chamberlain, like the name of them old Gucci tapes\nYeah, I'm talkin' 'bout Gucci Mane\nThat lil' bitch like, \"Burr,\" why she so insecure?\nWho got the pills in here? How do you live in here?\nI got my crib in here, havin' some kids, yeah\nI do it big, yeah, big big, yeah\nI do it big, yeah, big big, yeah (Let's go)\nShe saw me in the club, how did you get in here?\nFuck is you doin' here? Why is you shootin' here?\nDoin' it big, yeah, big big, yeah\nDoin' it big, yeah, big big, yeah\nYeah, away, away, away, away, away\nYou want bullshit, I hit you with that olé\nTold my shooter I gotta prove myself no lame\nEven when I stand up and hit it from the back I'ma still get laid\nYour bitch a dragon, she run up on me, she get slayed\nI took a piss in your dead homie grave, uh (Let's get it)\nChicago shit, Chicago nigga\nFuckin' with a Philadelphia bitch\nYeah, I'm super rich, I could pay your rent, Rollie doesn't tick\nChopper with the tints, pull up with the tints, clip is extended\nNever gave a fuck, never gave a shit, only gettin' rich\nLimb by limb, forgive and forget, man, I don't forget shit\nYou don't know when to stand\nYou got it bad, man, come in, oh\nOh, baby, come in\nMan, I don't forget shit\nUh, yeah\n\n[Chorus]\nI'm on a Percocet, yeah, I just had to relapse\nEven at my worst, I'm feeling like I am the best\nI done Meta World Peace to myself like I'm Ron Artest\nI never been a referee but I still got a Tec, Kel-Tec\nShoot you in your stomach, make this shit hard to digest\nRockstar, listening Jimi Hendrix in the projects, yeah\nI'ma turn a nigga block to an art project\nPicasso, I paint that, where the fuck is the bank at?\nArmy sergeant, no rank, yeah", "image": "https://images.genius.com/7b4c1752ee0b9e8c17d6c36d558560d4.1000x1000x1.jpg"}], "artist": "Juice WRLD"}