{"songs": [{"title": "The Motto (Remix)", "album": "Take Care", "year": "2011-11-15", "lyrics": "[Produced by T-Minus]\n\n[Verse 1: Drake]\nI'm the fuckin' man, y'all don't get it, do ya?\nType of money, everybody actin' like they knew ya\nGo Uptown, New York City, bitch\nThem Spanish girls love me like I'm Aventura\nTell Uncle Luke, \"I'm out in Miami, too\"\nClubbin' hard, fuckin' women, there ain't much to do\nWrist bling, got a condo up in Biscayne\nStill gettin' brain from a thang, ain't shit changed\nHow you feel how you feel how you feel?\n25, sitting on 25 mill\nI'm in the building and I'm feeling myself\nRest in peace, Mac Dre, I'm-a do it for the Bay\nOkay, getting paid, we'll holler whenever that stop\nMy team good, we don't really need a mascot\nTell Tune, \"Light one, pass it like a relay\"\nYMCMB, you niggas more YMCA\nMe, Franny, and Mally Mall at the crib-o\nShout goes out to Niko, J and Chubbs, shouts to Gibbo\nWe got Santa Margherita by the liter\nShe know even if I'm fuckin' with her, I don't really need her, aw\nThat's how you feel, man? That's really how you feel?\nCause the pimpin' ice cold, all these bitches wanna chill\nI mean maybe she won't but then again maybe she will\nI can almost guarantee she know the deal, real nigga, what's up?\n\n[Chorus: Drake]\nNow she want a photo, you already know, though\nYou only live once: that's the motto, nigga, YOLO\nAnd we bout it every day, every day, every day\nLike we sittin' on the bench, nigga, we don't really play\nEvery day, every day, fuck what anybody say\nCan't see 'em cause the money in the way, real nigga, what's up?\n\n[Verse 2: Lil Wayne]\nOne time? Fuck one time\nI'm calling niggas out like the umpire\nSeven grams in the blunt\nAlmost drowned in her pussy so I swam to her butt\nIt's Eastside, we in this bitch\nWish a nigga would, like a tree in this bitch\nAnd if a leaf fall put some weed in that bitch\nThat's my MO, add a B to that shit\nI'm fucked up, tore down\nI'm twisted, door knob\nTalk stupid? Off with your head\nNigga, money talks, and Mr. Ed, yeah\nI'm so Young Money\nGot a drum on the gun, Energizer bunny\nFunny how honey ain't sweet like sugar\nAin't shit sweet, niggas on the street like hookers\nI tongue kiss her other tongue\nSkeet, skeet, skeet, water gun\nOh my God, Becky, look at her butt, Tunechi!\n\n[Chorus: Drake]\nNow she want a photo, you already know, though\nYou only live once: that's the motto, nigga, YOLO\nAnd we bout it every day, every day, every day\nLike we sittin' on the bench, nigga, we don't really play\nEvery day, every day, fuck what anybody say\nCan't see 'em cause the money in the way, real nigga, what's up?\n\n[Verse 3: Tyga]\nT-Raww, skinny nigga, big balls\nFuck around and get dragged: RuPaul\nYou funny little nigga, Duval\nOut of this world, Total Recall\nCall a bitch, ride dick like a seesaw\nSorta like a donkey, act a ass nigga hee-haw\nRidin round in the ‘rarri wit the top off\nWhile you in the window, man I’m probably on my next car\nAight, mighty duck with the ice on\nReal LA nigga, chucks with the gun drawn\nDrawing on your face you’re a clown jack in the box\nBoy that’s your bop, she my new pum pum star\nStars in the back, them my homies, they don’t act\nActing brand new, fuck her never call her back\nMatt Forte got the bitch running back\nDamn, That’s the motto you don’t know it’s like that\n\n[Chorus: Drake]\nNow she want a photo, you already know, though\nYou only live once: that's the motto, nigga, YOLO\nAnd we bout it every day, every day, every day\nLike we sittin' on the bench, nigga, we don't really play\nEvery day, every day, fuck what anybody say\nCan't see 'em cause the money in the way, real nigga, what's up?", "image": "https://images.rapgenius.com/124331e091c6f0f0922fb7848f3ae89d.1000x1000x1.jpg"}], "artist": "Drake"}