{"songs": [{"title": "Sh!t (ATL Remix)", "album": null, "year": null, "lyrics": "[Intro: Future]\nOh, you know you ain't got all them guns\nAnd you ain't killed nobody yet\nHow many times you shot that muhfucka?\nAin't nobody popped up dead\nShit!\n\n[Hook: Future]\nTalkin' bout ya poppin' tags, nigga, you ain't bought shit\nTalkin' bout 100 bottles, nigga, you ain't pop shit\nAll you talk nana clips, nigga, you ain't shot shit\nSpendin' money on these hoes, nigga, you ain't fuck shit\nShit, shit\n\n[Verse 1: Pastor Troy]\nY'all ain't crunk like me, y'all ain't bout shit\nAK-47 and that Ruger and some other shit\nPT Cruiser, nigga, do a nigga, who the nigga?\nI'm so ratchet with that plastic\nShit get drastic, leave him in the casket\nNow my nigga Mike WiLL giving me a chill pill\nBut a nigga crunk still, plenty niggas got killed\nI don't give a fuck though, still got some ammo\nDressed in camo, represent Atlanta, ho\nPastor Disaster back like the rapture\nDon't let me catch ya, ho, I'm coming at ya\nBap on my shoulder, pocket full of doja\nKeep my composure, fuck pulling over\nBrrrrr, stick 'em, fuck the niggas with them\nI'm gonna get them, promise I'mma hit them\nPastor Disaster, get off my dick\nI be clean from my cup to my kicks\nForeign! How I like my bitch\nY'all, niggas, ain't, shit!\n\n[Hook]\n\n[Verse 2: Jeezy]\nMade the Forbes and I'm straight up outta projects\nStill running with them niggas with that work check\nIt go \"Brrrrrrrr\" with the choppa\nThat's the only way the pussy 'posed to stop ya\nPour out a little liquor, one in every got a ghetto\nStack a 20 bill, nigga, tall as Carmelo\nWinter olympic games and the categories caine\nBet ya one fuckin' thing, I'll win a gold medal\nWhy ya actin' like a bitch? Lil Jon, my nigga\nDon't you ever doubt me, I'm like LeBron, my nigga\nI ain't takin' no shorts, bitch, I hit it with the fork\nFuck a wrist game, use my whole arm, my nigga\nSnowman, bitch, y'all know me\nFourth quarter pressure on 'em like Kobe\nAct like my shit don't stink, pocket feel like a bank\nNeck lookin' like a 40 ounce of O.E\nTell me why my album selling, they ain't murder me yet\nIf they do, bury me in a burgundy 'Vette\nTalk behind my back, you could hate me all ya want\nBut them same fuck niggas ain't shot shit yet\nYeah, you see me on Gangland, as real as it get\nThey just rappin' about it, I was livin' that shit\nStraight up\n\n[Hook]\n\n[Bridge: T.I.]\nThis for my niggas when they walk up out the house, they (turn it)\nFuck what ya mouth say (turn it, turn it)\n\n[Verse 3: T.I.]\nFully automatic rifle, 100 round drum on it with a scope\nI done had that, nigga (Brrrrrrr, stick 'em)\nI ain't playing with these niggas, just kill 'em, turn it\nNigga talk shit, I'll blast that nigga\nShoot his ass right in front his homeboys\nKill the party, drove off and then stab that nigga\nEveryone vicinity hear the boy ho noise\nI'm the Zone 1 king, from a whole one thing\nThrew a 100 on it, shawty, I was doing my thing\nYou tryna get a million, I done did that\nAye, keep it pimpin', keep a ticket where I live at\nAye, listen, sucka, I got nothin' for ya but a new coffin\nI'll shoot you walkin' 'fore you get through talkin', nigga!\nCatch me walkin' in ya hood, trench coat swingin'\nMask on, step up on ya front porch bangin'\nThem Bankhead niggas, they a muhfucka, ain't they?\nI'm the realest, richest nigga that you know today famous\nCatch ya flaggin' in ya hood and ya wanna be a gangsta\nIn ya skinny jeans in arenas entertainin'\nNo matter how you paint it, better see the big picture\nI'll get ya, nigga, wit' ya, then hit ya nigga!\n\n[Hook]", "image": "https://images.genius.com/383bdf7e658c81236926af98a9211465.780x780x1.png"}], "artist": "Future"}