{"songs": [{"title": "Shake It", "album": "Who You Mad At? Me Or Yourself?", "year": "2013-04-18", "lyrics": "[Intro: Future]\nOh yeah, oh yeah, oh yeah, oh yeah\nShake, shake.. oh yeah, oh yeah\n\n[Hook One: Trey Songz]\nAss so fat with an ass like that (shake it, shake it) {*2X*}\nShake it, shake it, shake it\nShake, shake, shake\n\n[Busta Rhymes]\nMake that ass clap (clap), let me hear it loud (ay)\nShake that ass for me (yup), make your momma proud\nShawty do that shit again, a nigga want to see somethin' (come here)\nPull a trampoline, the way she let a nigga see you jumpin' (slow it)\nBaby gonna ride it fast, get this money, bitch hide your stash (HAH)\nI don't give a fuck about your ass shot bitch - bounce that with your lopsided ass (hahaha)\nWe in a higher class - my shit knock 'til you wanna drive and crash\nCause when I get high and laugh, I keep hitting niggas with the fire (splash)\nWhy you really in here fronting lookin' funny nigga? (What's up?)\nWhy you dudes just in here stuntin', where's your money nigga? (Where it at?)\nGet to spendin', my bitches they keep me kicked back\nFuck the chit-chat, get to throwin' them big racks\n\n[Hook Two: Busta Rhymes] + (Future)\n(Oh yeah, oh yeah) You know what I came for {*2X*}\nCame to see you shake it (shake), came to see you naked (shake)\nThrowin' so much paper (oh yeah), you gonna have to rake it (oh yeah)\n\n[Hook One]\n\n[Trey Songz]\nAss so fat with an ass like that, think a nigga like me\nGonna let a bitch like you walk past like that - I'm a big dog, I'm gonna kill that cat\nSend that pussy to heaven, I click-clack that shit\nShe said she love my present like I gift wrap that dick\nWhat you doing girl with all that?\nEverybody getting money huh? Who's frontin'?\nAll around the world, these bitches love me\nYou trying to find your girl, she tryin' to fuck me\nShake that ass, stop and go, shake that ass, yeah pop it ho\n+Girl On Fire+, Alicia Keys, girl on fire, drop and roll\nGushy gush, I pussy push, blow it down like kushy kush\nPussy chant that's pound for pound, told y'all like Reggie Bush\nDolphin, I swim in it (swim in it), +Dive In+, no fins in it (fins in it)\nYou talk shit while I'm diggin' in it, and if I kiss then my chin in it (nasty)\nSay she wanna bring her friend in it, my mind lost but my dick winnin'\nAnd you found love, but your bitch missin', I found her and she clique kissin' (shady)\n\n[Hook Two] + [Hook One]\n\n[Future]\nI'm a +Rolling Stone+, Mick Jagger swagger\nThen I play with drums like I'm Tommy Leezy\n+Bang Bang+, like Chief Keezy\nShe turnin up for me for no reason\nFrom New York City to the Bay\nThat's how these bitches they like to play\nSome big booty freaks\nPop it on a handstand, that how she eat\nWord to my mother yo, word to my mother\nIf she fuck me like she dancin', I'mma love her undercover\nI met a diamond in Miami like a month ago\nIt ain't an A-town bitch that won't do what I tell her to\n\n[Hook Two] + [Hook One]", "image": "https://images.genius.com/43cf4f7fb829f88b270853d2534b8f0f.1000x1000x1.jpg"}], "artist": "Busta Rhymes"}