{"songs": [{"title": "K.U.S.H.", "album": "Rise Up", "year": "2010-04-20", "lyrics": "[Intro]\nChong: Hey man! Check this out. I got the best KUSH ever man!\nCheech: Aw, man... I've been so out... You got sent from heaven!\nAll right, man, light it up, holmes!\nChong: Ok, check it out man!\n\n[Verse 1 - B-Real]\nI'm the original Dr. Greenthumb the rest are liars\nI'm the one with the prescription to get you higher\nI got every type of weed that you might desire\nGo ahead, fire it up, maybe you can get inspired\nAny kind of flavor you savor\nI can do you the favor\nJust as long as you share with your neighbor\nSome like the Sour D, that's an east coast swing\nBut on the west coast we all know KUSH is queen\nSome of y'all will smoke anything, but me, I'm picky\nI throw it out if I don't see that it's green and sticky\nNo stress, no bush, I'm pushing the KUSH\nWhen I harvest put a K on the bag like the Nike Swoosh\nI'm over the world, in case you wonder\nI smoked everywhere I went, they call me the weed hunter\nBut no one does it better like we do in Cali\nJust ask one of my patients cause they always tell me that the...\n\n[Hook]\nK.U.S.H. keeps us so high\nThe K.U.S.H. keeps us so high\nThe more I smoke, the higher I get\nThe better I feel, I can't quit\nThe more I smoke, the higher I get\nThe better I feel, I can't quit\n\n[Verse 2 - B-Real]\nKottonmouth Kings are down with us\nSnoop Dogg and Dre are down with us\nCheech and Chong, they're down with us\nBut the DEA, they can get the nuts\nOn a high times cover, you might see us\nTaking hits from the bong with the eight-foot Zong\nWith weed so strong, that knockout King Kong\nHit it one good time... Your mind's gone\nYour eyes get red, and your mouth goes dry\nJust get me when you want more and I'll supply\nRed and meth said, \"let's gets stoned\" I said \"How High\"\nThey said \"high enough to touch God and kiss the sky\"\n\"That's a tall order But I think I got what you need\"\nI got the food for though and I'm ready to feed\nSo, follow my lead I got some gifts to bring\nIt's an everyday life for the Reefer King\n\n[Hook]\n\n[Verse 3 - B-Real]\nI got the cream of the crop\nMy crop means cream\nWhen it's time to bag it up I assemble the team\nWe're like the Yankees, most winning, grand champs of the herb\nNothing gets you like the type of medicine I serve\nLawyers, teachers, actors, street cleaners\nNo matter what they are, they all come to see the Reefer\nThey stay high 24 like Keifer\nI tell 'em don't hit too hard, this is a Creepa\nWoody Harrelson is down with us\nBruce Willis smokes all, he's down with us\nYeah, Willie Nelson is down with us\nWho the fuck you think drives the ganja bus?\nDionne Warwick, she's down with us\nShe got caught at the airport with joints and such\nSo if anyone asks, she's down with us\nAnd you don't wanna enter more weed in the Cannabis cup\nI'm Greenthumb, I reign supreme, son\nA strain better than mine, I've never seen one\nThe K.U.S.H. keeps you so high that you can't concentrate\nDave Chapelle, is down with us\nHalle Barry, too, but don't tell no one\nKRS-One is down with us\nHe's a blunt getting smoked and he can't wake up\n\n[Hook]", "image": "https://images.genius.com/f469b84836527dfec52206e182dfacce.220x220x1.jpg"}], "artist": "Cypress Hill"}