{"songs": [{"title": "Backpackers", "album": "Camp", "year": "2011-11-15", "lyrics": "[Verse 1]\nAlright it's Childish baby, Mr. Talk-About-His-Dick-Again\nNerdy-ass black kid, whatever, man, I'm sick of him\nThat well-spoken token, who ain't been heard\nThe only white rapper who's allowed to say the N-word\nI buy a bunch of 'em and put it on my black card\nNow I got some street cred, use it 'til it's maxed out\nI got a girl on my arm, dude, show respect\nSomething crazy and Asian, Virginia Tech\nShe too fine, I do dimes\nIf not that, I'm walking out with two fives\nChange my ID for the cops, it's not enough yet\nBlack male in short shorts, I'm double suspect\nBallin' since '83, half of 'em say he gay\nMaybe that's the reason I like Lady What-babies-say\nI'm a problem, I'm lame as fuck homie\nBut I rap like these niggas ain't got shit on me\nFuck the cool kids, not Chuck Inglish\nBut people who think that hatin on me makes them distinguished\nLike, \"What is this nigga doin? Rap is for real blacks\nI hate that fucking faggot, man, he think that we feel that\"\nOr \"I wrote on rape culture my junior year at Brown\nSo I'm allowed to say what all his raps are about\"\nYou better shut your mouth before I fuck it\nYou really hate my lyrics now or Kid Cudi's? Nigga\n\n[Hook]\nRunnin this thang, money insane\nBusy getting brain like Krang\nWhat, what's my name?\nIn the woods, got these niggas usin' Mapquest\nMan, fuck a backpacker\n\n[Verse 2]\nNiggas with OCD, N-W-O\nAll white like my clothes, CW shows\nNigga got signed, it's an anomaly\nNo cosign: trigonometry\nMan these niggas hate me\n\"Man, fuck you nigga...fuck you nigga!\"\nThey real black like won't show up on your camera phone\nThey real black like turn the flash on your camera on\nThey real black take shit, turn it into gold\nI'm real black I survive when the pressure on\nUpper echelon, bit my lip when I'm kissin' her\nClash of the Titans, baby your tits is titular\nListenin to some Kiss FM, she wanna hear Nicki Minaj\n\"Super Bass,\" super face inside a garage\nIt's not a massage, spa rap with a happy ending\nOld niggas wanna assassinate me\nIt's a shame, these kids was supposed to save rap\nFuck that, boat shoes and a wave cap\nHe don't give back, how the fuck a nigga say that?\nSummer in November I gave everyone a Maybach\nComin' on that payback, comin' on that mace took\nI'm comin' on that real shit, I'm comin' on her Facebook\nFuck a backpacker with a rhino's dick\nI do me like a gyno chick, uh\n\n[Hook]\nRunnin this thang, money insane\nBusy getting brain like Krang\nWhat, what's my name?\nIn the woods, got these niggas usin' Mapquest\nMan, fuck these backpackers\nFuck these backpackers\nFuck these backpackers\nFuck these backpackers", "image": "https://images.genius.com/00196af444633a4108e6dc544358985e.630x630x1.jpg"}], "artist": "Childish Gambino"}