{"songs": [{"title": "Brothaz at Armz", "album": "One Nation (Bootleg)", "year": null, "lyrics": "[Intro: 2Pac]\nHey\nWatch me\nWipe em scared\nOh\nWhy is it that we gotta be\n(Watch your back)\nContactin niggas in the cemetery\nFuneral homes\nBuried\nSeein' all my homiez burried\nMoms all worried and shit\nWhy is so many black brothaz dyin\nOne day we can all be together smokin weed gettin high\nMaybe in our dreams over sheds is reality\nWheres your family at?\nNiggas say one love\nFuck one Love nigga\nOne Nation\n\n[Verse 1: 2Pac]\nNow it's time for\nRetaliation, perpetrating get you punished, how could you\nCross the nigga that put food inside your stomach?\nWatch me\nPoint the pussy out the crowd time to pay for\nPast discretions, never learned your lessons in this deadly war\nLet's explore the possibilities, them niggas killing me\nHead all busted\nOver this trick nigga I trusted, now it's\nHard to figure knew this nigga for eternity\nAnd, never in my deepest thoughts figured he could turn on me\n\n[Verse 2: Buckshot]\nSo many to choose from\nNiggas close to me I wonder how I lose them (How I lose one)\nMaybe because I put them on the podium before me (Oh yes)\nI use to think that's how it should be\nUntil them niggas cross me, it's different now (Different now)\nBitches wait until I got cold (Turn it up)\nAnd told a boldfaced lie (Lie)\nBut still I never asked why (Turn it up) (Why?)\nI keep stepping with my weapon on queue\nCause now I got my eye on you (Got my eyes on you)\nBefore my crew, remember how you do\nNow you want to pursue\nThe B.D Buck just because your jealous as a motherfucker (Jealous as a\nMotherfucker)\n\n[Chorus: Smif-N-Wessun & 2Pac]\nEvery man has a right to decide his, own destiny\nIn the end it's\nAnd in this judgment there is, no partiality\nSo arm in arms (Arm in arms)\nWe fight to live and struggle (Fight to live and struggle)\nOvercome all the troubles\nYour fight is my fight (Your fight)\nYour fight (Your Life)\nYour fight (Your fight) (Your fight is my fight)\nYour fight (Your Life)\nWhat you gonna do?\n\n[Verse 3: 2Pac]\nNow if my memory serves me justly\nI showed you love but you the same one that tried to fuck me\nAnd now I got this pistol pointed at your mouth, ready to squeeze\nYou see, snitching is an epidemic killing disease\nExit\nThrow your gun away, take your time, free your mind\nForget about the crime, and it will all go away in time\nMy information strictly based on niggas faces\nPast cases with the law, plus a life of living raw\nBrothaz at arms\n\n[Chorus: Smif-N-Wessun & 2Pac]\nEvery man has a right to decide his, own destiny\nIn the end it's\nAnd in this judgment there is, no partiality\nSo arm in arms (Arm in arms)\nWe fight to live and struggle (Fight to live and struggle)\nAnd that's the only way to\nOvercome all the troubles\nYour fight is my fight (Your fight)\nLet's get it on now\nYour fight is my fight (Your fight)\nLet's get it on now\nYour fight is my fight (Your fight)\nLet's get it on now\n(What? Say what?)\nLet's get it on now\nUh\n\n[Outro: Steele]\nMy fight is your fight, we could do this all day and all night\nSo I tell you what, One Nation, we gon' set up this plantation\nThis foundation, and we gon' take it to the real enemy\nThe one who ain't a friend of me\nThe one, the war continues, the struggle continues\nAll solider's be friends of me", "image": "https://images.genius.com/a1a90553105ad6af8fac203ba73284bf.480x360x1.jpg"}], "artist": "2Pac"}