{"songs": [{"title": "Who’s the Mack?", "album": "AmeriKKKa’s Most Wanted", "year": "1990-05-16", "lyrics": "[Produced by Sir Jinx & The Bomb Squad]\n\n[Intro]\nOne of these motherfuckers is different\nStraight gangsta mack\nStraight gangsta mack\nStraight gangsta mack\nStraight gangsta mack\n\n[Verse 1]\nWho's the mack? Is it some brother in a big hat\nThinking he can get any bitch with a good rap?\nRolling in a fucked-up Lincoln\nLeaning to the side so it looks like he's sinking\nInto that leopard interior\nThis nigga think every girl's inferior\nTo his tongue, get a dumb bitch sprung\nAs she's selling more butt and don't even get a cut of the money\nHis name is Sonny and he know the play\nAnd hope to god that he don't find a runaway\nThat's looking to become a star\nHe'll have your ass in and out of every car\nWith every Ron and Rick, sucking every John's dick\nCome short of the money, get your ass kicked\nYou don't like it but you still call him hunk\nLast night the nigga put yo' ass in the trunk\nYou wanna leave, but Sonny started talking fast\nAnd it make you wanna go and sell more ass\nHe's getting rich, you his bitch and it's like that\nNow ask yourself, who's the mack?\n\n[Verse 2]\nWho's the mack? It is that fool that wanna pump the gas\nGive you a sad story and you give him cash?\nHe start macking and macking and you sucking\nQuick to say I'm down on my luck, and\nYou give a dollar or a quarter and he's on his way\nThen you see his sorry ass the next day\nAre you the one getting played like a sucka?\nOr do you say, \"Get a job, motherfucka?\"\nEvery day, the story gets better\nHe's wearing dirty pants and a funky-ass sweater\nHe claims he wants to get something to eat\nBut every day you find yourself getting beat\nHe get your money and he run across the street\nDon't look both ways 'cause he's in a daze\nAnd almost get his ass hit for the crack\nNow ask yourself, who's the mack?\n\n[Verse 3]\nWho's the Mack? Is it that nigga in the club\nAsking \"have you ever been in a hot tub?\"\nI know the game, so I watch it unfold\nWhen I see a boy pinned to your earlobe\nHe's talking shit and you crack a smile\nWhen he tell you that he can go buck wild\nFor a girl like you and make it feel good\nYou know it's drama, but it sound real good\nHe started dragging and hopefully he can start tagging\nThe pussy so he can keep bragging\nHe say, \"I'm 'a leave baby, can you go with me?\"\nYou wanna do it but you feeling like a H-O-E\nYou grab his hand, you leave and it's over\nCause the nigga ain't nothing but a rover\nYa knew the game and you still ended up on your back\nNow ask yourself, who's the mack?\n\n[Verse 4]\nMacking is the game and everybody's playing\nAnd as long as you believe what they saying\nConsider the a M-A-C-K and with no delay\nThey are gonna get all the play\nBut when it comes to me, save the drama for your mama\nIt's Ice Cube and you know that I'm a\nMack in my own right when it comes to rhyme and rap\nCause all I do is kick facts\nUnlike Iceberg Slim\nAnd all of them be claimin' be P-I-M-P\nNo, I'm not going out that way\nI'm just a straight up N-I-double-G-A\nNext time, you get over on a fool\nAnd you did the shit like real smooth\nThank Ice Cube for giving up the facts\nAnd ask yourself, \"Who's the Mack?\"\n\n[Outro]\nStraight gangsta Mack\nStraight gangsta Mack\nStraight gangsta Mack\nStraight gangsta Mack\nStraight gangsta Mack\nStraight gangsta Mack\nStraight gangsta Mack", "image": "https://images.genius.com/1cb382d2d9fb4a9bfa94e3074c1aa220.1000x1000x1.jpg"}], "artist": "Ice Cube"}