{"songs": [{"title": "Do You Hear the Bells?", "album": null, "year": null, "lyrics": "* limited release as the b-side of a Stress Magazine CD insert\nAnd the European release of the LP\n\n[RZA]\nYea, What's happening women? What's happening women?\nYea I got it now, yea yea yea, Yo Bobby Digital, point 'em out\nPoint 'em out watch me sort 'em out\nCan you hear the bells?, I hear bells, can you hear the bells?\nWe hear the bells, yo the B the O the B the B the Y\nThe D the I the G the I the T the A the L\nCan you hear the bells? Digital digital\nBobby, Bobby, Bobby, buh-Bobby, buh-Bobby\n\n[RZA]\nYo fucking up the microphone be my hobby\nAll you crab motherfuckers out who want to rob me\nYou best to slob the knob G\nYou could never catch the great Bobby, indestructible\nHigh producer production\nSuck to the wall like suction cups\nYea what the fuck is up you duck\nYou better slip\nOr get your wrist slit\nUltimate legit, can't quit when it comes to making hits\nA phat ass track I quickly program it\nFor others could see me, its like Smothers brothers\nYou get spread on bread like the butter\nPeanut, what, see what, B what, razor blade cut from\nYour neck to your gut\nHave no shackle\nEasy for me to tackle\nBest to watch back cause my razor sharp style\nGrapples MC's\nWith the eagle claw clutch\nI'm just to much to touch\nKeep the mike beside me like Starks and Hutch\nWord Up quick to roll a dutch and puff it up\nBlunts everyday in the month\nNo need to front\nWe cause the blood to gush\nOperation push, it's the Wu!\nYou scarecrow, jump off the road\nYou best to reload, your gat black\nAnd get your whole shit back phat\nDon't step to me with that\nWe can't have that weak that\nBob Digital inside your citadel\nShit is critical, word it's gonna take a miracle\nFor MC's fall to the fallacy\nHere's my rhyme policy\nAcknowledge me\nI keep the high quantity plus quality\nEqual make you see the sequel\nDefiant eagles can't match me or royal regal\nLethal eagle techniques\nWord up when I speak the dialect\nIt makes girls' pussys get wet\nWhile niggas hit the rewind on my casette\nWe could make a thousand dollar bet\nBobby never failed yet\nBout to strike gold\nGot Big Free on the ones and two\nBreak it down for them one time\n\nChorus:\nDo you hear the bells?\nI hear the bells\nCan you hear the bells?\nBobby, can you hear the bells?\nI hear the bells!\nBuh-Bobby, Buh-Bobby\n\n[RZA]\nFucking up the mike be a hobby!\nCrab motherfuckers try to step up to rob me\nBitch you must be stupid, slob the knob Z\nB-O-B-B-Y D-I-G-I-T-A-L, Bobby Digital\nServed well keep the phat clientele\nI watch you crab niggas fail\nTry to sail the boat but couldn't stay afloat\nI float on a note like a Staten Island ferry boat\nKeep my rhyme chocolate coat\nBitch you know when you bite my shit it taste sweet\nGoing down your throat\nPoint 'em out let me sort em out\nThe fattest links we sport 'em out\nNuts bubbling boosted from extra scouts from Dublin\nI could fuck a dozen birds and watch a dozen hatch\nI bake my cake from scratch\nKeep the cream inside the middle\nMake you dribble\nThat's when I scribble on the paper\nTo write this script I had to cut down forty acres of trees\nProcess the wood to make the notebook sheets\nBlinded from the steel spiral imported from Ohio\nDelivered like the spin whirlwind kick Morio\nBitch you best to read my bio\nFirst chapter the back breaker chiropractor technique\nWord up dislocate your shoulder blade joint\nWe striking every pressure point\nThe high priest solid gold diamond fang teeth\nWith the high tech brief around your neck\nI still breach your skin girlfriend\nLet me enter your zone\nMicrophones get cast like stone\nNiggas can't never bone how I bone\nWord you soft as a shell\nYou ain't worth one skin cell\nBig broiler crack your back and your head like an eggshell\nAnd Bobby will scramble you\nBitch you want to make a bet all right we'll gamble too\nQuick to roll see low\nCatch the loop like Niko\nDuck watch out for Roscoe Pico train\nSee Sirus with the great dame\nTryin to infiltrate the game\nWu-Tang Clan, Wu-Tang Clan\nSpecial brand name slang\nFrom the book of the Ichang\nThe world changed once Bobby came\nYou better go and check your storage\nWait a minute Goldilocks who the fucks been eating my porridge?\nSomebody been sitting in my chair\nSomeone been sleeping in my bed\nIt ain't Goldilocks!\nSlope down the ice with bobsleds\nBobby smoke 'til his eyes get red\nWord up you best to turn your head and don't look\nInside my rhyme book\nYou might get your whole soul took\nI make the world shake, I make the world shake\nThen the whole universe quake and then it shook\nBobby fishy fishy was caught inside my brook\nDaddy caught him with a hook\nMoma fried him in the pan\nAnd Bobby ate it like a man\nWu-Tang Clan special brand\nGet the logo\nBounce on your head with the pogo stick\nRock the wild horse with the Polo\nWord up we speaking wild\nQuick flash like a photo\nYea, yea Dorothy you better go find Toto cause we\nAin't in Kansas anymore\nIt's the killa bee shores, all out war\nBefore you go here you best to go there\nAnd see it clear\nThrough your third eye\nWith a curb, with the high post up most\nDon't play up close\nRazor blade technique that strikes you\nOverdose MC's quickly, strictly, hip hoply\nYou could never stop me, rock me, mock me or pass me\nCause I'm fast like Kawasaki\nAnd when you see me coming through\nWith the vroom vroom vroom\nThat means your bitch ass is doomed\nSo give me room\nAnd stand back and hand that mike back to the man Jack\nUnfair black\nI slam that track on trains like Amtrak\nGo to shaolin isle, that's where my fams at\nWhat you doing you can't ripple the gripple son\nYou get dipped up like Lipton's tea bags\nOr you get spit on like the sea hag\nAnd I smoke a fat tray bag of equality\nDon't bother me\nYou probably never really heard of B-O-B-B-Y\nD-I-G-T-A-L\nSupreme Clientele served well\nBuh-Bobby fucking up microphones is a hobby\nBuh-Bobby, buh-Bobby, buh-Bobby\n\nChorus:\nDo you hear the bells?\nI hear the bells\nCan you hear the bells?\n\n[RZA]\nBuh-Bobby, fucking up microphones is my hobby\nYou get tossed like cracks locked down inside the lobby\nSucker motherfucker stepped up and tried to rob me for my Cuban link\nWhat did he think? What did he think?\nWhat was he thinking? What the fuck was he drinking?\nBitch you be blast in the head like Abe Lincoln\nHave you whole body shrinking\nDid you believe the killa bees always swarming\nAlarming, calming sound that makes MC's feel how I feel\nYou best to chill bitch and eat a booger\nWord up or get cut up by the juga\nRazor blade sharp RZA\nWord shame on a nza\nWho try to run game on a nza\nYou get broken down like a puzzle with to many equal prisms\nPositions, oppositions\nHere's the transmissions\nWord up I raid the phat sample without the glitching\nWhy you bitchin'? Why you bitchin'?\nBuggin out cause my style it keeps switchin', it keeps switchin'\nOh shit I'm itchin', I'm itchin' for a scrap can't catch that\nWho could be the match?\nWho wanna match palms?\nI remain calm\nLike the 18 bronze man\nCome to the shaolin chamber of danger feel the anger\nThe mad stranger\nWu-Tang Clan keep a finger\nTucked inside the back pocket\nBlast like a rocket\nWord up knock your eyes out the socket\nHere's my new topic\nI don't give a fuck if you had a whole neck full of garlic\nAround you my fangs will puncture your jugular veins\nAnd you'll be in deep, deep, deep, deep pain\nWhy oh why oh why do they try?\nTo B-O-B-B-Y D-I-G-I-T-A-L\nBobby Digital fucking up mikes a be my hobby\nPoint 'em out, puh-point 'em out\n\nRZA: Yo this just a little freestyle for ya'll niggas\nWord up, type shit\nYou could smoke a blunt to this\nYou could smoke a blunt to this\nYou could smoke a blunt to this\nYou could smoke a blunt to this\nWord up the main main main main main main main main\nMain superhero\nWord up superhero type shit, my niggas\nCan you hear the bells?", "image": "https://images.genius.com/0050e4b1c52ecca6d63818331b489e2a.683x683x1.jpg"}], "artist": "RZA"}