{"songs": [{"title": "Spit Game (GTA Mix)", "album": "Build and Destroy", "year": null, "lyrics": "[Pretty Ugly]\nYeah, uh-huh\nPretty Ugly, Royce Da 5'9\n1, 1-2\nWe spit game nigga...\nWe spit game nigga...I'm here now..\n\n[Pretty Ugly]\nNow take a look at me, how it fell [feel] to see me balling?\n(P.U.!!) Yeah, y'all heard what the callin'\nPretty Ugly, that Philly cat wit the chipped tooth\nThat wear low shirts, Guess jeans, and Tim boots\nI only drink 1-51 Rum Passion\nNo Cris, I'm a thug, I don't like flashin'\nI can get a bad bitch wit something a lil' cheaper\nAnd my whole body smelling like reefer\n'Dro or Babbage? I don't care, I got a bad habit\nTry to fight it? I ain't even took a jab at it\nWhy quit? I love to talk shit\nI love them dick licks, when I'm taking a big hit\nI spit game all night, my mind ain't been right\nY'all dudes ain't that tight, I put it in black and white\nI'm sick of rappers tryin' ta sign me, stop makin' offers\nI ain't here to see y'all, I come to talk to your bosses\n\n[Hook]\nMa-MI, don't you hear my name?\nI'm tryin' ta get you to try ME, so you can play my game\nBOOM BOOM... La La La La La Laaa La La La La La La\nBOOM BOOM... La La La La La Laaa La La La La La La\nBOOM BOOM... La La La La La Laaa La La La La La La\nBOOM BOOM... La La La, Laaaa La La La La\n\n[Royce Da 5'9\"]\nI said, he wanted a piece of me, I won't break, nigga\nHere is a piece of my heat that I won't take\nHe's been, sold a dreamer\nHad the privilege, ta hold the nina\nYou've been exposed ta peanuts\nGrown niggas speak wit their hands, they know how to bring it\nDown to fold they fingers, slingin' as Ol' as English\nMy gold feet, smokin' it rolled, that's how it be\nWhen a ho scope, smokin' the coal, she eye me\nShe probably sip on a nutta, it's probably\nWhy these chickadees love us, we still slip on the rubbers\nWhy is it that bitches would be sensitive lovers\n(We keep you bitches fly) We keep a bitch on the cover\nNiggas heard it's our label so snap out\nNiggas try to cover the card table, they crap out\nIn Japan like I'm the man you lucky to know\nCause I be fuckin' these hoes like, yo touchi yo toes\n\n[Hook]\n\n[Pretty Ugly]\nI spit game, it's real shit no riddles\nGirls at the bar, meet me in the middle\nBack that ass up, shake it jus a little\nCome on, show me something, make yo titties jiggle\nYou gotta love the way I spit it cause my game is tight\nIts Pretty Ugly, I'm the same boy yo friend like\nAin't nuffin changed, I'm the shit baby, it's my time\nSpit game, the boy papes, Royce Da 5'9\n\n[Royce Da 5'9\"]\nWhat in yo mind'll make you think my click would be trickin'?\nBoom, I'm the bomb, bitch, coz my dick'll be tickin'\nWe can split 50-50 stitches, paying for bitches\nMy lips strictly for sippin', they ain't for lickin'\nGame - came for bitch now you swallow the doe\nGlow - 'til I holla, 'til it 'aha' fall on the flo\nI'm takin' this action, but you oughta know\nThat I'm sorry Ms. Jackson, but yo daughter's a ho\n\n[Hook]", "image": "https://images.genius.com/d86b45b993cdf0c53559e740521a4bba.500x494x1.jpg"}], "artist": "Royce da 5'9'’"}