{"songs": [{"title": "Steps Back Radio Freestyle", "album": null, "year": "2012-09-28", "lyrics": "[Verse 1: Logic]\nLyrically I murder you quicker than Lamborghini drive-bys\nWho knew one man could handle more beef than five guys\nI’m a motherfucking lyricist, bitches they fearin’ this\nBack in the day they wasn’t hearin’ this, now I’m the one who’s steering this\nI’m self-driven, will he kill it? – That’s a lyrical given\nNew school style but the 90’s is where my lyrics livin’\nMy flow is like another Earth\nSecond nature I disintegrate ya’, migrate ya’, then lightsaber decapitate ya’\nIn the beginning they said it was fabricated, as soon as the numbers escalated\nBut these fuckers just mad that I made it\nMore chains then when a slave trader, check it\nI’m under MC’s skin like muscle tissue, what’s the issue?\nIf you talkin’ shit then Im’a hit you\nGrab a pistol then whip you, then dip you in lava, ain’t no one ‘liver\nSecond I arrive I murder it, no you never heard of it\nSo sick my lyrics I don’t spit – I regurgitate em’\nAs listeners chronologically study my words, verbatim\nAssassinate em’, the second I raid em’ like five-0\nWe pull off the heist and flee to Cabo now\nI mask emotions like a robbery, cause when it comes to matters of the heart\nWomen will clog your arteries\nRattpack, V’s up – Visionary\n\n[Verse 2: Mikkey Halsted]\nSee the truth through the eyes of the childen that’s born in poverty\nWhere their chances of breaking that cycle is like the lottery\nNot about black and white – you’re rich or you’re poor\nSo the poor trying to get rich till they stiff in the morgue\nI’m the embodiment of ‘real’, I body niggers with skill\nIf I up it Ima’ bust it, somebody bout’ to get killed\nSmoke em’ like Black and Milds, bringing lyrics back in style\nThese suckers don’t want to battle, they ducking like Pacquiao\n8 blocks of bodies, I’m ahead by a mile\nSucker thought he could rap, I fuck up nigga’s morale\nI got the clarity of Jay, the complexity of Nas, Lines like Big L, I go against all odds\nLike Pac did, I pop shit with the best of them\nThey got to much estrogen to F’ with him\nIma’ changa like the nephilim\nI flood the market till there’s no more left of them like the days of Noah\nI split the brick and dip my blade in coka\nTake a sniff and see there’s nothing doper\nThis Coke-eighty shit, they soft as baby shit, pussy as chocha\nThey better deuce before the whole world smell the aroma\nListen, I want it all, Charlie I’m born to ball\nIm the machine-gun preacher and this is my alter call... Bang!\nIm the machine-gun preacher and this is my alter call... Bang!", "image": "https://images.genius.com/75b9fd3705271c3c10d64dfb3139caf7.900x900x1.jpg"}], "artist": "Logic"}