{"songs": [{"title": "Letcha Go", "album": "Playtime is Over", "year": "2007-07-05", "lyrics": "[Verse 1:]\nBaby boy, you must got Nicki twisted\nI would've left, before but you insisted\nSaid that I was your all and I believed you\nThat's why it hurts to the core, I gotta leave you\nHow could you love me, and humiliate me?\nYou ain't my man, don't affiliate me\nWith all your plans cause you really made me -\nA lil' bitch, when that really ain't me\nMondays was the fun days, from -\nThe slum to the runway, runs in the Hyundai\nNiggas didn't have your money, it was gun play\nUsed to tell me to listen, to what a thug say\nAt night, I would sleep on you\nAnd I guess I did sleep on you\nCause when they said it, I said \"Creep on who?\"\nNo, not myboo,ain't what he gon do\n\n[Hook:]\nOh now you wanna be with me\nBut you can't be with me\nBoy leave me alone\nYou know you did me wrong\nSo I gotta letcha go\nIf you wanted me in your life\nYou shoulda treated me right\nBoy leave me alone\nYou know you did me wrong\nSo I gotta letcha go\n\n[Verse 2:]\nWhy you saying you ain't feel her? You was in  -\nThe villa, she was in the white chinchilla\nYou was sippin' on a Miller, my bitch -\nPam' had the hidden cam, like Killa\nFunny how ya win some, ya lose some\nNever worry where your income, would come from\nCause no matter, where you was I held you down\nUp north, to uptown, so how you sound\nNow you all up in my face, 'bout you make mistakes\nIf I'da known you was fake, I'da laced your steak\nStrychnine, one time, in your Welch's Grape (wine)\nQuit lying, why you lying? I watched the tape, nigga\nNow get up out my dressing room, give me some f'ing room\nGo get your mind right, and take it as a lesson learned\nJust like Usher nigga, you gon' have to, let it burn\nTo the left, and I ain't talkin about Jigga girl\n\n[Hook:]\nOh now you wanna be with me\nBut you can't be with me\nBoy leave me alone\nYou know you did me wrong\nSo I gotta letcha go\nIf you wanted me in your life\nYou shoulda treated me right\nBoy leave me alone\nYou know you did me wrong\nSo I gotta letcha go", "image": "https://images.genius.com/b256017f3b831150266cf5131d761bfe.600x599x1.jpg"}], "artist": "Nicki Minaj"}