{"songs": [{"title": "Whateva U Do", "album": "Ego Trippin’", "year": "2008-03-07", "lyrics": "{*scratch*}\nKids get your parents' permission befo-fore, fore-fore, fore tryin this\n\n[Snoop Dogg]\nCar full of hoes and the music gon' bang\nEverybody everybody, yeah we all doin everythang\nSo you know what's happenin, ain't no need to pitty-pat\nDogg in this motherfucker, yeah I get the kitty cat\nSwervin on the 110, blowin on some purp'\nOne hand on the steerin wheel, the other up her mini-skirt\nTryin to get some pussy while I'm pushin my whip\nFunny thing about is that I'm fuckin yo' bitch\nOkay yo, ho lay low\nGet mayo, like O.J. yo, say ho\nPlug it in, pull it out\nPut it in, what it is, that's what it's all about\nNow what would I be\nIf I let a punk motherfucker run up on me?\nI play chess, checkmate him in the streets\n32 feet off glass, that's threes\nSwish swish, fresh fish\nAin't that a bitch? Like Ray J, I got +One Wish+\nLook at the plates I'm in\nI never fucked Superhead or Kim Kardashian\nIt's a disgrace to yourself\nDogg is the champ, to the face with the belt\nI'm undefeated, undisputed, persecuted\nSpaded and neutered, faded and booted\n\n[Hook]\nWe got that chronic chronic\nWe got that 'gnac 'gnac for you\nWe got that chronic chronic\nWe got that 'gnac 'gnac for you\nWe got that chronic chronic\nWe got that 'gnac 'gnac for you\nWe got that chronic chronic\nWe got that, whatever you do\n\n[Snoop Dogg]\nPut your hands in the sky\nStick up, pick a piece of American pie\nWhat kind of car do you drive?\nSuicide doors on the passenger side\nDo the windows roll down? Do the doors lift high?\nDo the car change colors when that bitch drift by?\nI don't really know and I don't really care\nCause me and my money's like Sonny & Cher\nSpend dough at the Gucci sto'\nI never spend dough on no coochie though (stop lyin)\nYou can check it, I got a record\nIn Brazil for runnin out and not payin a bitch (see ya)\nJuvenile delinquent, see when I speak this\nMove and I'll bleep this, lil' nigga peep this\nNo secret this all exposed\nIf you grew up on my music, your momma one of my hoes\nYour daddy one of my foes\nYour granny been to one of my shows\nIt is contrary, that my literature-y is very necessary\nYou feel me? And you can try to rewind it, define it\nAssign it to a whole nother groove\nPlay it to another move, hope you go through\nCause you on strike two\nWith 12 jurors of your peers, you better hope they like you\nAin't no tellin what they might do\nSo I'mma just stay out they motherfuckin white view\nDippin in and out of town, got to get a hundred thou'\nEven if it's just for a sit-down\nI've been blessed by kings and kissed by queens\nEven got a homie named Prince Akeem\nYes I mean, Black Diamonds, I can have anything\nYup, this 20 Gang\nEven if I could've I would've, never stop\nI started on the bottom now they got him on the top\nSensation - Bigg Snoop Dogg\nRanked #1 in the nation\nTop draft pick, always got a top bad bitch\nEvery time you see me, niggas wanna be me\nIt ain't that easy\nIt's still hard bein Snoop D-O motherfuckin double G, believe me\n\n[Hook]\n\n\"Do-do-do... whatever you do... do-do-do\" {*scratched to fade*}", "image": "https://images.genius.com/fd5ace5214e5da1f374653720da7d1c1.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}