{"songs": [{"title": "Max B", "album": "AT.LONG.LAST.A$AP", "year": "2015-05-26", "lyrics": "[Intro: Max B]\n… Through the spot\nEveryday was like a beef to me\nLittle nigga said he’d make it hot\nYou don’t wanna draw heat with me\nI got niggas that’ll run up in your spot\nCooly nigga, you don’t really want beef\nI’m Biggaveli, I could do this in my sleep\nMy bitch now tryna comfort me\nAnd baby I wonder, baby I wonder\n\n[Verse 1: A$AP Rocky]\nUh, buccaneers of rugged gear, nigga fuck a fair\nOne, since year one, I've been thuggin' here, yeah, uh\nWhole shit is ours, you in awe, please don't get involved\nThis is war, walk around a frame with blaze up in this jawn\nBehind prison walls, niggas lickin' balls, pause\nDifferent cause, stricted laws\nDamn if I don't break up in the mall, prison yard, prison guard\nNo principal, detention on your friends and all\nCommissary missing like your sibling's paw\nUncle Tom, please don't make my sentence long\nGranted what I did was wrong\nPigs don't show remorse if you admit it all\nMissing ma, hope that she don't miss the call\nAdmitted that she'll never visit\nLike the hard-headed never listen, Lord\nSo tell me how the fuck I'm supposed to eat? (nigga)\nIf the richer's getting richer, the poor's growing weak (nigga)\nMy brother died up in the streets, may he rest in peace\nNiggas got heat like Pusha T, get it cheap\nFlacko how you been, where you at? I've been kickin' back\nRelax place down my favorite thinking cap, scratch my nigga neck\nHitta chit and chat, this and that, A$AP diplomats\nI'm missing Max, wish that they could bring the nigga Bigga back\n\n[Chorus: Joe Fox]\nAnd I wonder, laying in my bed\nAm I still too young? Am I still too young?\nAnd I hold back, thoughts running through my head\nDid I fuck it up? Did I fuck it up?\n\n[Verse 2: A$AP Rocky]\nIt's like I lace up my boots and call my troops lately\nTraded all my hoodie rap for all my suits lately\nI'm 26 but I've been living in my youth lately\nPull my wisdom, but I still spit it like my tooth ache me\nDuck shots, motherfuck cops, what's up blood clots?\nAll I gots my words and my balls and my one cock\nPause, buckshots fly, my young buck died\nPassed away from a stray, from some fake tough guy\nNow this the kind of story that should make doves cry\nFuck that, this the story that should make thugs cry\nDry your eyes older sis, held 'em close, watch 'em twitch\nGave 'em kiss in the midst of all of this\nAin't too late to pause or skip...\n\n[Chorus: Joe Fox]\nAnd I wonder, laying in my bed\nAm I still too young? Am I still too young?\nAnd I hold back, thoughts running through my head\nDid I fuck it up? Did I fuck it up?\n\n[Bridge: Max B]\nI'm Biggaveli, I could do this in my sleep\nBaby I wonder, baby I wonder\n\n[Chorus: Joe Fox]\nAnd I wonder, as I'm laying in my bed\nAm I still too young? Am I still too young?\nAnd I hold back, thoughts running through my head\nDid I fuck it up? Did I fuck it up?\nAnd I wonder, as I'm laying down in bed\nAm I still too young? Am I still too young?\nAnd I hold back, thoughts running through my head\nDid I fuck it up? Did I fuck it up?\n\n[Outro: Joe Fox]\nSorry guys", "image": "https://images.genius.com/3054c642a320e82b70b35c53ad1cc8d5.1000x1000x1.jpg"}], "artist": "A$AP Rocky"}