{"songs": [{"title": "I Ain’t Shit Without My Homeboyz", "album": "Tha Streetz Iz a Mutha", "year": "1999-11-16", "lyrics": "[Daz Dillinger] (Soopafly)\n(A Soopafly/Daz production) Suckas!\nHow many real homeboys y'all got out there?\nCan y'all count on one hand?... I can\nStraight up, Dogg Pound Gangstas\nFunky fresh in the flesh\nYeah, that's what I'm talkin' bout\nYo Kurupt, kick that\n\n[Kurupt]\nI ain't shit without my homeboys, although at times it seems\nTryin' to make it to different stages, lifes and dreams\nDifferent mistakes that was made during the time of the struggle\nTwo pits unleashed but held by one muzzle\nIt's complicated like a puzzle, puzzle pieces and money double\nThe royal rumble, fools really in trouble\nI'mma hit the spot and snatch all the knots and pots\nThen get ghost while the most of y'all get gots\nTo get the fuck outta here, ain't nobody else I can call\n(Who that?) Besides my motherfuckin' doggs\nI ain't shit without my homeboys\n\n[Daz Dillinger]\nWhen there's trouble who the fuck can you rely on\nTo die on onsite, me and niggas do it wrong or right\nI ignite the fire, marijuana gets me higher\nAll this drinkin' and smokin' really gettin' a nigga wired\nGettin' paid, that's my only desire\nBig Style, Lil' Floss, Tray Deee and me\nK-U-R-U-P-T, Soopafly and Crooked I\nUntil then, I hope God don't pass me by\nEveryday I work harder to try\nNever to fall but I hope to rise\nEveryday before I open my eyes\nTo my cousin Big Flip locked down in the pen\nTo my other homeboys I won't ever see again\nLife gone in the wind, like a lottery spin\nWhen it comes down to it nigga who's ya foe and ya friend?\nAnd I ain't shit without my homeboys\n\n[Crooked I]\nSo what could make a crook stay down for his troop?\nCould it be the gunshots we ducked as a youth, huh?\nWhat about the cops we hid from on the roof\nOr the shootouts we survived without wearin' a bulletproof\nWe fruits from a tree that was rotten to the root\nWe wasn't 'posed to make it, our survival don't compute\nI had to chase the paper cause the loot would run from me\nWe had Navigator dreams and only bus money\nWe rise and we fall together, all together\nWe crawl and we ball together, doggs forever\nLike uh (and ya don't stop!)\nFuck around with one of the homies, watch the Glock pop\nOne love and keep hollerin' back\nWe can split my last dollar in fact, pop your collar to that\nCrooked I need the whole click\nAnd like frozen chitlins, that's some cold shit\nMy nigga, some cold shit\n\n[Soopafly]\nCold shit when you elevate and get into some more shit\nWhen we ride together niggas be like \"Oh shit!\"\nDogg Pound in the house rockin' the party, all night long\nGettin' high to the break of dawn\nChipped up like a cellular phone\nBack up, watch it shine like chrome\nIndividually we the shit\nBut together we can't be fucked with, we crush shit\nNever settle for less than the plush shit\nBut still don't forget when we was broke\nAbout 9 or 10 locs with only one joint to smoke\nMan, I can count on both hands the different stands\nAnd plans niggas took to make it better for the fam'\nWe made our first five grand, was like \"god damn\"\nNew khakis and Cortez\nWe learned the essential meaning of what a whore is\nStill clockin' more biz\nAlways lookin' up cause if you look down you're fucked\nSoopafly, Taylor'd up like Chuck's\nBut I ain't shit without my homeboys\nAnd that's real shit\n\n[Baby S]\nI ain't shit without my homeboys...\nTrue thuggish Capone's, real niggas I knew before I was grown\nA lot of motherfuckers died, but I'mma still ride\nAnd represent the evil motherfuckin' Westside\nIt ain't nothin' but trues, real niggas who paid they dues\nPicture me rollin' with gay dudes\nNigga please, we G's and dress like we serve ki's\nOn the block where we chop rock, re-cop and make G's\nDown to die for each other, it's you and I for each other\nIn a gangsta matrimony we brothers\nCan't nothin' seperate game, we game from initiation\nMarks fuck around and catch heat sparks\nCasino Gang's the gang that a motherfucker claim\nRump Segal, Lonnie Mack, E-Mack, it's you mayne\nI ain't shit without my homeboys", "image": "https://images.genius.com/19827b73d665d135cdf903e8afe08997.1000x1000x1.jpg"}], "artist": "Kurupt"}