{"songs": [{"title": "One Beer (Madlib Remix)", "album": "Mm...LeftOvers", "year": "2004-01-01", "lyrics": "[Intro]\nI get no kick from champagne\nMere alcohol doesn't thrill me at all\nSo tell me why should it be true?\nI get a kick out of brew\n\n[Verse]\nThere's only one beer left\nRappers screaming all in our ears like we're deaf\nTempt me, do a number on a label\nEat up all they MC's and drink 'em under the table\n\"It's on me. Put it on my tab kid.\"\nHowever you get there, foot it, cab it, iron horse it\nYou're leavin on your face, forfeit\nOf course the mic, hold it like the heat, he might toss it\nTold her tell him they stole it - he told her he lost it\nShe told him, \"Get off it,\" and a bunch of other more shit\nGettin money, D's be gettin no new leads\nIt's like he eatin watermelon, spittin seed after seed\nIt's the bleed, give me some of what he's droopin off\nSoon as he wake up, chokin like it was whoopin cough\nThey group been soft\nFirst hour at the open bar and they're troopin off\nHe went to go laugh and get some head by the side road\nShe asked him autograph her derriere, read\n“Too Wide Load, this yard bird taste like fried toad turd\nLove, Villain.” Take pride in code words\nCrooked eye mold nerd geek with a cold heart\nProbably still be speakin in rhymes as a old fart\nStudy how to eat to die, by the pizza guy\nNo he's not too fly to skeet in a skeezer eye\nAnd squeeze her thigh, maybe give her curves a feel\nThe same way she feel him when he flow with nerves of steel\nThey call the super when they need some back... uhh... plumbing fixed\n\"How it's only one left? The pack come in six!\nWhatever happened to two and three?\"\nA herb tried to slide with four and five and got caught\nLike, \"What you doing G?\nDon't make him have to get cuttin like truancy\nMatter fact, not for nothin, right now, you and me!\"\nLooser than a pair of Adidas\nI hope you brought your spare tweeters\nMC's sound like cheerleaders\nRappin and dancin like Redhead Kingpin\nDOOM came do the thing again, no matter who be blingin'\nHe do it for the smelly hubbies\nSeeds know what time is it like it's time for Tellie Tubbies\nFew got it, even fewer can sell it\nTake it from the man who wear a mask like a 'tarded helmet\nHe plot shows like robberies\nIn and out, one, two, three, no bodies, please\nRun the cash and you won't get a wet sweatshirt\nMic the shotty: nobody move, nobody get hurt\nBring heat, like your boy done gone to war\nHe came in the door, and \"Everybody on the floor!\"\nA whole string of jobs, like we on tour\nEvery night on the score, comin to your corner store", "image": "https://images.genius.com/25c7ff92f916794aced182b3b1ef49fb.500x500x1.jpg"}], "artist": "MF DOOM"}