{"songs": [{"title": "Die This Way", "album": null, "year": "2016-05-31", "lyrics": "[Intro: Announcer]\nDue to some violent content, parental discretion is advised\n\n[Pre-Verse Ad-Lib: Hopsin]\nHmmm\n\n[Verse 1: Hopsin]\nMy vision has always been golden\nThat's why I see the pearly gates starting to open\nI ain't got no friends\nBecause I've been an omen, oh man\nHmmm, take a look at the enemies blood I am soaked in\nYeah, staring back at my reflection thinkin'\n'Bout the hand of cards I've been holdin'\nWhen I'm upset it's hard to control it\nSoon as I'm fully charged, I unload it\nThis shit is keeping Marcus so devoted\nTo writing these crazy bars and you know it\nI'm too steady with the juice\nGet the booth ready, when I barge in I'm Hulk'n\nI'm no longer with Avengers\nHeart is frozen with some vengeance\n8 years old, I was a menace\nCan't get lost in all the critics\nThey judging when they ain't crawled up out the trenches\nLook bitches, I'm making doe from all the bitchin'\nYou'd think I whip baking soda in the kitchen\nIts U.P and taking over is the mission, the realest\nAnd they should know the shit's encrypted, listen\n\n[Pre-Chorus: Hopsin & Matt Black]\nI debate\nShould I smile like everything's good and pretend that life is great\nOr should I let the world see the real me and not hide this pain\nI tried to be like the rest of y'all, sorry I just can't\nI'ma probably die this way (I'ma die this way)\n\n[Chorus: Matt Black]\nAh yeah, ah yeah\nAh yeah, you know I'ma die this way, I'ma die this way\nAh yeah, ah yeah\nAh yeah, you know I'ma die this way, I'ma die this way\n\n[Verse 2: Hopsin]\nWhere did my mind go?\nTell me why am I letting these bombs blow\nI'm stubborn and even my mom knows that\nAm I lonely? Yes\nI'm on one, that's why my homies left\nI live with no regrets, motherfuckers I won't repent\nMan, the other day I cussed my girlfriend's parents out\nIt is apparent now\nThey tryna justify their daughters bullshit?\nWhelp, I am raw enough to air it out\nI'm intense at times, in my mind\nThere's a grinch inside that tells me to write offensive lines\nIf the shit I do doesn't make sense in your head\nNigga fuck you 'cause it makes sense in mine\nYeah, I think I got a little ego\nIf you cut me open, you would see I'm full of it\nFrom the 818, a motherfuckin' Panorama City hooligan\nI see the whole world and everybody looking like a duplicate (that's true)\nBitch I do me, and that's the only way you'll ever see me doin' it\n\n[Pre-Chorus: Hopsin & Matt Black]\nI debate\nShould I smile like everything's good and pretend that life is great\nOr should I let the world see the real me and not hide this pain\nI tried to be like the rest of y'all, sorry I just can't\nI'ma probably die this way (I'ma die this way)\n\n[Chorus: Matt Black]\nAh yeah, ah yeah\nAh yeah, you know I'ma die this way, I'ma die this way\nAh yeah, ah yeah\nAh yeah, you know I'ma die this way, I'ma die this way\n\n[Bridge: Joey Tee]\nI don't feel no shame\nWhy should I hide this pain?\nI'm sorry\nI'm sorry\nSorry we're not the same\n\n[Verse 3: Hopsin]\nThere isn't much that anybody else can tell me\nI'm the only nigga living in my shoes and this shit is overwhelming\nI travel earth like a lost soul\nFires burning as I rot slow\nThere ain't many I can vent to in this world\nI got family but we're not close\nSo I tell my story through a hot song\nYou all know to get your popcorn\nWhen I hit you with the Ill Mind\nNeverland? That's a place you know we're not goin'\nThis is struggle and pain\nAbout me always being stuck in the rain\nTo be honest, I don't want it to change\nI'ma take it to my death bed up until nothing remains\n\n[Chorus: Matt Black]\nAh yeah, ah yeah\nAh yeah, you know I'ma die this way, I'ma die this way\nAh yeah, ah yeah\nAh yeah, you know I'ma die this way, I'ma die this way\nAh yeah, ah yeah\nAh yeah, you know I'ma die this way, I'ma die this way\nAh yeah, ah yeah\nAh yeah, you know I'ma die this way, I'ma die this way", "image": "https://images.genius.com/2d0ff87fa8ef4ae4944eee871e41b18e.996x1000x1.jpg"}], "artist": "Hopsin"}