{"songs": [{"title": "What’s a Pimp?", "album": "Married to the Game", "year": "2003-10-21", "lyrics": "Damn\nSometimes we lose some good ones mayn y'know?\nThey don't really understand this playerism\nJust gotta break it down to 'em, keep it real y'know?\nI'm a P-F-L, sworn to the P.I\n\n[Verse One]\nI spent so many days with you, so many nights\nIt's nice, I wanted you to be my only wife\nWe didn't make it, I couldn't take it\nI tried to square up, it's too hard I couldn't fake it\nAnd now I see why, since I was knee high\nI swore to live and die by the P.I\nAnd I'm stayin true, born in this game and it's payin too\nI wish I could have stayed witchu\nBut it's over, I love you and I still care\nWe can kick it any time, but I'm still a player\n... damn you got that look I like\nI tried to settle down it felt like you took my life\nI left town, I got women all around\nWhile I was out soul-searchin, guess what I found?\nThe more hoes the merrier, you think I wanna marry her?\nBitch that sounds scarier and scarier\nI need to have a few wives\nCause I don't wanna come home and tell you lies\nIn my heart I think I found her if she feels the same\nYou think I've changed, think I'd play her if I'm still in the game?\nHell yeah!  One woman, I don't think so\nI let the game be my wife, and I'm faithful\nI never do her wrong, I never cheat on her\nAnd if the game was baseball, I'd be on first\n\n[Hook]\n(I see you watchin this) I see you watchin\n(I know it looks real hot up in here) It's pimpin baby\n(But what's a pimp?) Oh you know\n(I say but what's a pimp?)\n(They wanna be like this) They wanna be like this\n(I know it looks real fly up in here) It's real fly\n(But what's a pimp?)\n(I say but what's a pimp?)\n\n[Verse Two]\nIt's like this\nI don't lie, I told you what I felt at the time\nI wasn't high, I know you see yourself in my rhymes\nA lot of women I dealt with, could hear these words\nAnd realize there's no way I could still be hers\nUnless you wanna share me with a hot one named Tarrie\nAnd don't get mad at me when I'm out poppin cherries\nI know some ladies they just wanna have babies\nCollect child support from rich men in Mercedes\nIt's cool, but that's not what players do\nGet with me, those days are over, I swear it's true\nYou're through, havin sex for nothin\nHopin some day some man'll give you somethin\nYour own bank account - don't laugh, it's not funny\nYou only fucked with him cause he got a lotta money\nBut you never get paid, don't lie to me\nYou just look good, and you get to ride for free\nWhat you eat and what you drink, you trade for sex\nPick you up in the Benz, next day in the Lex\nAre you happy?  Do you think you're, on a roll?\nDo you love your life?  Are you achievin any goals?\nOr are you sad, mad cause it ain't your way?\nCall mom and dad they'll be glad that you ain't gon' stay\nOr call me, I got a solution\nChoose me and then hit the top with your new man\n\n[Hook] w/ variations\n\n[Verse Three]\nI don't have fantasies, just needs\nI need more than one woman to please\nAnd she's like a love roller coaster, the thrill never lasts\nAnd I always seem to find some better ass\nSome bitch that can suck better, get wetter\nShe got them super skills to do anything you let her\nSo I'm done with you, I still care\nI love you baby but I'm still a player\nI always been aware and I never been scared\nFound some magazines on the top they said Player$\nI was young but I was old and I wanted those hoes\nFound out playin with girls was mo' fun with no clothes\nYou can call it what you want to, Doctor or House\nHide and Go Get It, then I'm knockin it out\nIf she ain't widdit, I find another little chick\nI'm quick to switch, even when I was six\nI had a backup bitch, when my bitch would trip\nI'd go play with my other girlfriend and get me a kiss\nAnd at the age of thirty-six I'm to the same old tricks\nToo $hort baby no the game don't quit\nI'm playin games with these lame brains\nTreatin superstars, like some plane Janes\nI wanna get new thangs, so I used the game to maintain\nBitch I refuse to change\n\n[Hook] w/ variations\n\n[unknown singer from Hook]\nMinks and pinky rings and them\nSome so why should you begin\nLivin, the world that they are perceivin\nHo-ohhh, is everything that you see\nReally good enough to be\nPart of the pimp life, ohhhhhh\n\n[Hook] w/ variations to fade (quickly)", "image": "https://images.genius.com/ed8e96dec66a7ff4b3234c0368a7f843.1000x1000x1.jpg"}], "artist": "Too $hort"}