{"songs": [{"title": "Do My Thing (remix)", "album": null, "year": null, "lyrics": "Hahahhahhhhhahhhh, ah!\n\n(in background:) Watch me get down and just do my thing baby (8X)\n\nWhoooo! Yes yes y'all\nBusta Rhymes in the place to be, in the place to be\nHah, Flipmode is the place to be, in the place to be\nHah, party people it's me, let me do my thing\nLet me do my thing, let me do my thing\nBaby doll follow me baby\nLet me do my thing, just, check me out now\n\nOpen up your door, let me on in\nI just be wonderin' -- if I could \"do my thing baby\"\nY'all think fast, before I get, all in your ass\nBend your frame like plexiglass\nYou motherfuckers, be actin like you, don't know the half\nYou and your whole staff, make me laugh\nHah-hah-hah, hoh, y'all, you need to sing my song\nWith your similar features like Olivia Newton-John\nDamn, OHH! I make the whole place warm, then\nHit you with some shit that make you niggas look deformed\nNow, stay tuned to every Busta Rhymes, coming soon\nI will King Kong on niggas like guerrilla monsoon, soon\nWhoaahhh, what seems to be the whole analysis?\nBusta Rhymes just be rippin' shit, type miraculous\nBang you on your head so hard, shit be formin' callouses\nLet me get this loot so we can move up in these palaces\n\n(in background:) Watch me get down and just do my thing baby (8X)\n\nWord is bond\nLet me do my thing, let me do my thing\nLet me do my thing\nFlipmode is the Squad, let us do our thing\nLet us do our thing, hah\nYes yes baby, Busta Rhymes\nLet me do my thing!\nLet let let me do my thing, hah!\n\nWhen I step in the place you should keep your mouth closed\nTake your fat finger out your nose\nYou should just pay attention, and watch how I wild on records\nMake you sing, \"The Lord is my shepherd!\"\nIn the process I do away with all nonsense\nHit you with magic like my name was Pocahontas\nThe dread, gon' make you party til you dead\nNiggas quick to talk shit.. OOPS! Upside your head\nPut your head to bed -- let me do my thing -- nuff said\nShit so hot make your chickenhead do the spread\nTell me what you said -- I said I never leave you misled\nWhile you bullshit, I'd rather get the Lucci instead\nHah-huh-hah-hee-hah! Flip until you fall\nWhylin in your whip, til you crash into a brick wall\nThrough the nine-six, I be that nigga that be priceless\nAlways blowin up your spot, bringin more surprises\nYou, you know you really need to come clean\nLet me do my thing, don't you even try to intervene\nI will endanger your species like an ostrich\nHold you hostage, and crazy feed you swine sausage\nHAH! I be the number one chosen just to keep you open\nChill with your thoughts I got your brain frozen\nPay the prices made the needed sacrifices\nTo present the grand opening of Flipmode Enterprises\n\n(in background:) Watch me get down and just do my thing baby (8X)\n\nHah hah, hahhahhh!\nWhohh, let me do my thing!\nLet me do my thing, please!\nLet me do my thing - Flipmode is the Squad y'all!\nLet us do our thing, please, let us do our thing\nOh yes it's me, yes it's the Squad\nFlipmode, we gon' do our thing\n\nLet me do my thing for nine-five, nine-six, suck dick\nYes I got the bag full of brand new tricks\nDead in the face, yes I'm gon' hit you with hits\nOh my God, me and my niggas..\n\n(drowned out by:) Let me get down, do my thing (4X)", "image": "https://images.genius.com/54314abfbbbf16253d72455428cc44e6.834x834x1.jpg"}], "artist": "Busta Rhymes"}