{"songs": [{"title": "Don’t U Know", "album": "Return to the 36 Chambers: The Dirty Version", "year": "1995-03-28", "lyrics": "[Intro]\nGirl 1: Oh cutie got it goin' ON!\nGirl 2: Cute? What? That dirty motherfucker?\nGirl 1: You buggin'!\nGirl 2: Ain't no buggin', he's some ugly motherfucker\nGirl 1: You buggin', yo -- look at his disposition, shorty gotta stride!\nGirl 2: What stride? Bummy motherfucker, he ain't shit\nGirl 1: See, that's my flavor, rough, you don't know nothin' about that\nGirl 2: You got mad sour flavor on girl, cuz that ain't shit at all...\nGirl 1: I'm -- yo G, I don't think he really realize. Look at him!\nGirl 2: Look at what? Dirty motherfucker, he ain't shit\nGirl 1: Hahaha, you don't see what I see, B\nGirl 2: I don't see nothing. You wear glasses so...\nGirl 1: Hahaha, True, true. Just look at him, personally-\nODB: (I like that mothafucka!)\nGirl 1: Just look at him...Homie's just dispositioned...\n\n[Verse 1: Ol' Dirty Bastard]\nApproach the school nine thirty, you're late\nThe time happy the solution was my date\nGet in your class, walk to your chair\nPop is all you see and then occasionally stare\nAt the teacher, or students who were clockin' you\nLean back at this girl who kept clockin' you\nStimulated from a sensimilla blunt\nTell the young girl \"Baby, you're the one I want.\"\nShe doesn't respond, pretends to ignore\nSo you say to yourself, it be her cold and sore mentally\nVisualize the aim on the board\nAs how to buy pussy you cannot afford\nThis girl who, was slim and trim\nWhispered in her friend’s ear quietly ‘I want HIM!'\nI took out my books to write the notes for my class\nBut I Kept fantasizing my dick in that ass\nSo I turned around to arrange a date\nSwinging episode, baby number one's gotta say it\nShe popped a gum, cold twist to come\nI said \"Baby, how you feel?\", She said \"chill\"\nThen I said \"chill\", I just found my thrill\nWear it in the classroom, know I'm Blueberry Hill\nCause what I said just bottled her hate\nShe put her face on the chest, this is what the bitch said:\n\"Because of you I ain't hurting, but within my within my heart\nCause no, I'm not right to be flirtin, but our relationship has to start\nYou're the one that I'm clocking, time for you could stop mockin'\nDon't want you to see me cry, this is why, this is why, this is why!\"\n\n[Verse 2: Killah Priest]\nI met a girl named Chandra, from way down yonder\nThe apple of my eye had a Snapple and some fries\nForgot the ketchup, that's when I pressed up\n\"I've been watching you mowing your lawn\"\nThe thoughts were flowin', while I'm holding her palm\n\"Hey what's that on your menu?\", from there we continued\nAnd talk about this and that we chit and chat\nSipped on the Coke then I stroked her back\nAs she giggled and I wiggled to the bra\nShe said \"nah!\", that's when I noticed her Pa\nBig Tank, who did nothing but the spank\nAt parties, drink Bacardi and didn't think\nJust act silly, with his brother Willy\nAnother hillbilly gettin' ill with the Philly\nAnd moonshine, but it's a new time of day\nOn the stoop doing the Patty Duke\nOK, it's like that old flip flaps through the shower caps\nThe platform shoes to Apple Jacks\nChub chub!!\n\n[Interlude: Ol' Dirty Bastard]\nYo, you niggas, niggas be actin like\nThey be lovin' them, them them fancy bitches\nI, I likes me a nasty bitch\nBitch that's willing to do anything at any given time\nBitch gotta be nasty cuz I'm a nasty nigga\nI do anything baby, I wouldn't give a fuck what it was\nI'll, ah, anything - I'm a nasty motherfucker girl\n\n[Verse 3: Ol' Dirty Bastard]\nI'm just sittin' right, in my class at a quarter to ten right?\nWaiting patiently for the class to begin right?, teacher says\n\"Open up your texts and read the first paragraph on oral sex!\"\nI said \"Oral sex!, what kind of class is this?!\"\nThe girl next to me said \"what's wrong with you miss?\nThis is a lesson that makes you feel fine\nKinda ease your nerves and relax your mind!\"\nI said \"Don't try to use no hypnotic spell!\"\nShe said \"Be my assistant, I'd sure rather tell!\"\nMy knees buckled heart started to drop\nMy dick grew to a size that my nerves couldn't stop\nI tried to run! She yelled out \"freeze!\"\nPulled down my draws, dropped to her knees\nRipped off my draws as if she had claws\nBroke the rules that defined sex laws\nShe responded quick, with a slick, welcoming kiss and a ice cream lick\nOh, I begged, I begged, \"Easy on my balls, they're fragile as eggs.\"\nPart 2 coming up...", "image": "https://images.genius.com/7985ae9f777e769efe184aff8b763e1c.1000x1000x1.jpg"}], "artist": "Ol’ Dirty Bastard"}