{"songs": [{"title": "Quit Hatin’ Pt. 1", "album": "What’s My Favorite Word?", "year": "2002-09-10", "lyrics": "[Intro: Lil' Jon]\nYea, yea, e-YEAHHHH!  O-kayyyyyy - what, what?\nWha', what, what?\nLil' Jon and the motherfuckin Eastside Boyz! (Yeahhhh)\nShort Dawg! (YeahHHH) Once again at yo' ass (YEAHHHH!)\nBitch!! (Yeah!) This go out to all the pussy niggas (listen here)\nThat see us when we walk in the club (whassup)\nAnd just be mean muggin!\n\n[Hook: Lil' Jon - repeat 2X]\nQuit hatin motherfucker, quit hatin!\nQuit hatin pussy nigga, quit hatin!\nGod damnit MOTHERFUCKAHHH\nGod damnit MOTHERFUCKAHHH\nQuit hatin motherfucker, quit hatin!\nQuit hatin pussy nigga, quit hatin!\nGod damnit MOTHERFUCKAHHH\nGod damnit MOTHERFUCKAHHH\n\n[Verse 1: Twista]\nHigh cause I'm tokin the choke and smokin on Purple Haze and I'm coughin\nGot some new Nike's on my feet, even my Caddy wear Jordans\nNow bitches be on my dick when I pull up in a platinum blue 'llac\nThey come and spread they ass crack, let me hit it from the back\nOn the flo', they bend over, shake them titties and twurk them hips\nWith them lil' ol' thongs on, I can almost see they coochie lips\nAnd she backin that thing up on me, so I do the damn thing and pop her\nWith a lil' curl that ha-hangin proper, drunk off champagne and vodka\nJust cause it's us in the club they krunk, it's $hort and Twista\nAnd I know the ladies know we love to cut, I can tell it when they whisper\nThey say -\nSee the ballin niggas in the party\nThey came in new Escalades\nAnd I got a single, wanna get up in the lobby\nI'm with that, come freak all in my body, it's on\nWe about to break your back and your hip\nSmoke a sack and just sip\nSit back and eat some immaculate shrimp\nStackin chips as a mack and a pimp, in the club you gon' bounce\nBut on the streets, my dro' goin for, six hundred a ounce\n\n[Hook: Lil' Jon - repeat 2X]\nQuit hatin motherfucker, quit hatin!\nQuit hatin pussy nigga, quit hatin!\nGod damnit MOTHERFUCKAHHH\nGod damnit MOTHERFUCKAHHH\nQuit hatin motherfucker, quit hatin!\nQuit hatin pussy nigga, quit hatin!\nGod damnit MOTHERFUCKAHHH\nGod damnit MOTHERFUCKAHHH\n\n[Verse 2: Too $hort]\nShow me love when you see me, don't hate\nIf you take my woman from me, what you gon' say?\nCharge it to the game, if I lose, I lose\nYou never know when a ho is wearin choosy shoes\nYou must be a magician cause you're nothin but a trick\nTryin to give her all your money, but whatchu gon' get?\nI get 'em all, suited at the player's ball\nUp against the wall, just got another number to call\nY'all see me I'm a real player, I do this nightly\nYou wanna fight me, cause you can't be like me\nAll you hatin ass suckers in the place\nYou better stop starin in my motherfuckin face\nToo many jealous thoughts goin through yo' mind\nYou mad like you guilty, goin to do some time\nPay yo' pussy bill nigga if you want a date\nBut you just talkin shit I figure you just wanna hate\nYou hater!\n\n[Hook: Lil' Jon - repeat 2X]\nQuit hatin motherfucker, quit hatin!\nQuit hatin pussy nigga, quit hatin!\nGod damnit MOTHERFUCKAHHH\nGod damnit MOTHERFUCKAHHH\nQuit hatin motherfucker, quit hatin!\nQuit hatin pussy nigga, quit hatin!\nGod damnit MOTHERFUCKAHHH\nGod damnit MOTHERFUCKAHHH\n\n[Verse 3: V. White]\nNow you can catch me I-80 in the diamond lane gettin head\nIn the rearview, make a wrong move and I gotsta have your head\nI put 23's in the game on the Avalanche and give you the blues\nAnd blow white smoke up out the sunroof while we keep it on cruise\nI ride with a hog in the back and the vogue in the back and you hatin on that\nIt's just V. White, T. $hort, Twista boy we blazin on track\nIt's just that Eastside psycho-chronological mind-stopper\nKeep a burner at yo' waist while we serve these haters proper\nYou better get up, get out, get somethin; nigga, and stop frontin\nIf I had no car and stayed with my momma then I'd be hatin on somethin\nNah but nope, not me, I give 'em out, above the knee\nYou could catch one in the torso, b-2-1-2, fuckin with me\nNow you can hate me all you want to cause I ain't hard to find\nI got hitters on payroll and parolees dyin to shine\nThat'll leave a hole in your dome like Rogaine, old school like road games\nYou can't stop me from shinin, I'm highly flammable like propane\n\n[Hook: Lil' Jon - repeat 2X]\nQuit hatin motherfucker, quit hatin!\nQuit hatin pussy nigga, quit hatin!\nGod damnit MOTHERFUCKAHHH\nGod damnit MOTHERFUCKAHHH\nQuit hatin motherfucker, quit hatin!\nQuit hatin pussy nigga, quit hatin!\nGod damnit MOTHERFUCKAHHH\nGod damnit MOTHERFUCKAHHH\n\n[Outro: Too $hort]\nYeah we got some real players in this motherfucker\nToo $hort, Twista, V. White, Lil' Jon, Eastside Boyz, Delinquents\nYeah we see you haters up in this motherfucker\nTryin to kick it like us real players\nBut you know what we gon' do?\nWe gon' sift you motherfuckin haters out\nAnd we gon' beat yo' motherfuckin ass\n\nYeah that's right, whup that hater's ass\nBeat his ass!\nLike he stole somethin..\n\n[Lil' Jon] Quit hatin motherfucker, quit hatin!\n[$hort] Now slow it down for the retarded people", "image": "https://images.genius.com/5b217fd6496369f950dd5a8a14ae52aa.1000x1000x1.jpg"}], "artist": "Too $hort"}