{"songs": [{"title": "Dope Boys", "album": "LAX", "year": "2008-06-24", "lyrics": "[Produced by 1500 or Nothin']\n\n[Intro]\nYeah, gangsta gangsta, yeah\nWassup? Yeah\nWassup? Wassup?\nWassup? Yeah, yeah\n\n[Verse 1]\nComing fresh out that Pyrex pot\nBlack Air Force 2s and the White Sox\nFitted on my forehead, try me, go 'head\nI'll bring out them polka dots, put Kwame on your forehead\nYeah, it's the new king of everything\nAnd bitches don't say no to me, I'm like a wedding ring\nMaybe it's how I pour that Patron\nMaybe it's how I smell of Paris Hilton cologne\nMaybe it's how I write shit when I'm in the zone\nAnd I'm sick of blow jobs, bitch leave me alone\nAnd tell Dr. Dre to pick up a phone\nBefore I climb through his window like, \"Nigga, I'm home!\"\nRunning the rock like O.J., nigga it's a throwback\nFuck a Aston Martin, show me where the stove at\nGet a jar, some baking soda, nigga hold that\nThe world is my grandma's kitchen, time to cook crack\n\n[Hook]\nThe dope boys in the building (wassup?)\nThe dope boys (wassup?) the dope boys (wassup?)\nThe dope boys in the building (yeah, wassup?)\nThe dope boys (wassup?) the dope boys (wassup?)\nThe dope boys in the building (people, wassup?)\nThe dope boys (wassup?) the dope boys (wassup?)\nThe dope boys in the building (wassup?)\nThe dope boys (wassup?) the dope boys (yeah)\nThe dope boys in the building (haha)\n\n[Verse 2]\nYou couldn't smell that crack coming out that motherfucking Porsche truck\nI stop traffic with the rims that I'm sitting on\nThem ain't high beams, bitch my wrist is on\nThe same shit that Ludacris is on\nDisturbing the peace if my stash missing stones\nYeah, count that work like a paycheck\nNiggas couldn't play The Game in a tape deck\nA boss never touch work if it ain't taped yet\nThat's how you get fucked, I practice safe sex\nAnd I take ya boy Curtis' bitch with my tongue\nLick lick lick like Shawnna and have her sprung\nShow her my anaconda and have her sprung\nAnd put it all in her stomach and just \"Ughh!\"\n\n[Hook]\nThe dope boys in the building (wassup?)\nThe dope boys (wassup?) the dope boys (wassup?)\nThe dope boys in the building (yeah, wassup?)\nThe dope boys (wassup?) the dope boys (wassup?)\nThe dope boys in the building (New York, wassup?)\nThe dope boys (L.A., wassup?) the dope boys (Chi-Town, wassup?)\nThe dope boys in the building (yeah, Detroit, wassup?)\nThe dope boys (ATL, wassup?) the dope boys (MIA, wassup?)\nThe dope boys in the building (yeah, wassup?)\n\n[Verse 3]\nSo roll that coke white carpet to the hood\nIt's the Dope Boys reunion, the dress code's strictly:\n\"White tee, Air Force 1s and some Dickies\"\nI'm from the city where the skinny niggas die\nOnly birds and Nextels chirp in the sky\nAnd we ride for the letters on our fitted cap\nNiggas hit the stash, get a strap and go get it back!\nThat's for the gangstas, the hustlas, the ballas\nFrom Downtown L.A. to Uptown Harlem\nAnd D-Boy money ain't raining, it's storming\nSo stop the music when the champagne pouring\nAnd hold them glasses high (yeah)\nAnd when a nigga ask you why, you tell them\n\n[Hook]\nThe dope boys in the building (wassup?)\nThe dope boys (wassup?) the dope boys (wassup?)\nThe dope boys in the building (yeah, wassup?)\nThe dope boys (I'm back!) the dope boys (I'm back!)\nThe dope boys in the building (yeah, wassup?)\nThe dope boys (nigga, wassup?) the dope boys (motherfucker, wassup?)\nThe dope boys in the building (tell 'em I'm back!)\nThe dope boys (cause I'm back!) the dope boys (it's a wrap!)\nThe dope boys in the building\n\n[Outro]\nThe dope boys, the dope boys\nThe dope boys in the building\nThe dope boys, the dope boys\nYeah, wassup? Wassup?\nHahaha, yeah\nThe King, is back!", "image": "https://images.genius.com/a6867892ea83a0cbc1ea7ac77469d0e1.420x420x1.jpg"}], "artist": "The Game"}