{"songs": [{"title": "Right About Now", "album": "Right About Now: The Official Sucka Free Mix CD", "year": "2005-11-22", "lyrics": "[Intro]\nYeah, this that new Kweli\nI'mma give it to you before the bootleggers get hold of\nIt\nYou know what I'm sayin'?\nI figure I put it out first, make some money wit' it\nWhy not, right?\nOkay, 1-2\n\n[Verse]\nYo I'm Brooklyn like the '90s\nBrownsville and Bushel keep it grimey\nWhen I'm from flatbush that's where you'll find me\nIn Brooklyn, Tek wit' Justin and Sadat\nAnd Free and Sid from ???\nAlways catch me wit' Juju and Rubiks, we was truant kids\nDollar band nooseses\nJump bell, run, and never look back\nMr. Man kept the hammer in his bookbag\nRubiks introduced me to Black and Forte\nDJ Enuff on Avenue K I go back a long way\nWit' Super Nat in Washington Square freestylin' everyday\nPeformin' at Lyricists' Lounge who ate off Jean Grae\nFuckin' wit' Mood is how I met Hi-Tek\nBlack Star came in effect when Elijah gave my tape to Mos Def\nReflection Eternal was next on deck\nMy crew the best and we proved it\nWe knew our music was the Vanguard of a movement\nEvery Rawkus release was bangin', they on the come up\nThey was like fuck the radio 'til Pharoahe said \"Get the fuck up\"\nFlex listened, jabbin' at Bryant\nThe next position was right about now we need the\nRadio hit written\nWhile I hit the road\nOn tour to support the records since the day it was sold\nCorey had me followin' the example of De La Soul\nCommon and The Roots to me these the sickest niggas\nGet my figures wit' the Okayplayers and the Spitkickers\nRawkus got a deal with MCA, this the gray area\nThe letters stand for Music Cemetery of America\nThey tried to fool you by switchin' the name to Geffen\nNow they Interscope's bitch and every artist who had a chance left 'em\nAin't no big surprise, wasn't no love there\nJimmy Iovine never signed me, I just kinda ended up there\nBut fuck that, literally it was my way or the highway\nHit the road with the Beastie Boys and toured Europe with Kanye\nGotta thank 'em for the love on the album\nI knew out on \"Electric Circus\"\nHe'd get it by any means necessary like Malcolm\nI dropped a single, shot a video, took control of my situation\nGot a label poppin', it's a celebration (bitches)\nYo boy Free I had to get out\nI put you on, that's where I'm at right about now\n\n[Hook]\nAnd if you're sayin' it's my time, you right about now\nThis what's goin' through my mind right about now\nHey yo, hey yo, it's time to write about now\nAnd if you lookin' you can find it right about now\nI put you on, that's where I'm at right about now\nThis what's goin' through my mind right about now\nYo, hey yo, it's time to write about now\nAnd if you lookin' you can find it right about now\n\n[Outro: Dave Chappelle {*DJ cutting*}]\nThat's right bitches, Talib Kweli\nOne of the baddest motherfuckers you've ever seen\nThat's right bitches, Talib Kweli\nYou're now rockin' with the best! I said it\nThe best! The best!\nThat's right bitches\nYou're now rockin' with the best! The best!\nTalib Kweli\nWhere's-Where's my snares? Talib Kweli\nWhere's-Where's my snares?", "image": "https://images.genius.com/4cbfcd6a620fb2422b1cc731af78e5d9.946x936x1.jpg"}], "artist": "Talib Kweli"}