{"songs": [{"title": "The Champ", "album": "Fishscale", "year": "2006-03-28", "lyrics": "[Intro: Just Blaze, (Ghostface Killah)]\nThis guy is a bulldozer with a wrecking ball attached. He’ll leave a ring around your eye and tread marks on your back. He’s an animal, he’s hungry. You ain’t been hungry, since Supreme Clientele. Remember what you first told me when I took ya in. You wanted to be a fighter (Yeah). You wanted to be a killer (New York, stand up). You wanted to be the Champ! (Got your boy in the booth, nigga). You ain’t hungry. Matter of fact I don’t want you in my gym. Get out of my ring, you disgust me…\n“Just Blaze!”\n\n[Verse 1: Ghostface Killah]\nGodzilla bankroll, stones from Sierra Leone\nYo I ain’t got it all, that means I’m barely home\nTrailblazer stay balling with vengeance\nMy arts is crafty darts, why y’all stuck on Laffy Taffy?\nWondering, how did y’all niggas get past me?\nI been doing this before Nas dropped the Nasty\nMy Wallos I did ‘em up, them bricks I sent ‘em up\nMy raps y'all bit ‘em up, for that now stick ‘em up\n10-4 good buddy, Tone got his money up\nWorth millions, still bag your bitch looking bummy what\nY‘all staring at the angel of death\nLiar liar pants on fire, you burning up like David Koresh\nThis is architect music, verbal street opera\nPop a Tec mad fluid, got the projects booming indeed\nI ran through the Tunnel, terrorized speed\nThat’s when I was still in the jungle, slinging that D\n\n[Interlude: Just Blaze]\n*Bell rings* Get out my face! No you ain’t got no mo? Don’t need no has been messin’ up my corner. And you better get that mad look off your face for I knock it off. Hey, fool, you ready for another beating. You should have never came back. Look here man after I crucify him, you next! And you better have a good doctor to rearrange your face. I’m the Champ!\n\n[Verse 2: Ghostface Killah]\nWho want to battle the Don?\nI’m James Bond in the Octagon with two razors\nBet y’all didn’t know I had a fake arm\nI lost it, wild and raw before rap, I was gettin’ it on\nTook a fat nigga out in like 40 seconds\nMy gun get hard wit a 45 steel erection\nEagle on, Kangol half-slanted, Coconut Ballys from Morocco\nGuerilla medallions like Flavor Flav clock, yo\nNiggas want me dead but they scared to step to me\nRip they guts out like a hysterectomy\nWhen beef collide look on the flip by the penitentiary kite\nOr get you bumped off from the inside\nJaws is hanging, frauds is left in they draws on the floor complaining\nBird ass nigga resemble Keenan Ivory Wayans\nStay in your place dirt poor rappers get shadow boxed for training\nY'all still eating bacon\n\n[Interlude: Just Blaze]\n*Bell rings* Think nobody can. Don’t give this sucker no statue, give him death. I told y’all I wasn’t going away. You had your shot no give me mine. Now why don’t you tell these folks why you been ducking me, politics man. You think you going to keep me down. They don’t want me to have the title. Because I’m not a puppet like that fool up there. Ask his woman she get more pipe from the plumber than in bed. I’m the Champ!\n\n[Verse 3: Ghostface Killah]\nI’m like the deuce of diamonds cutting spades on a glass table\nHalf a mil’ on my left ankle\nTerrycloth Guess shorts, robes is comfortable\nBring me a nice bitch, that means I’ll fuck with you\nMy swagger is Mick Jagger, stones is rolling\nPrestige is cut to a T, spark when weed went up\nThe coca leaf is slightly damp\nSprouting in the backyard next to Gram Dukes’ tomato plants\nAnd jets get chartered, marquee shit with the cars on it\nThe haters, they earl, run to the toilet and vomit\nBack East, I’m a MC king since Cuban\nPretty Tone, Iron Man, Bulletproof and Supreme\nKufi on, double deuce in the jeans\nMy man shape was on the floor with the mother lode, both of them green\nIBF, WBC, cruiserweight, title shots, and rap belts belong to D.C. \n\n[Outro: Just Blaze, (ODB sample)]\nListen, I am bad, I said I am bad. I’m a bad man. I’m so bad sometimes I’s scare myself. Sometimes I look in the mirror and want to kiss myself I’m so pretty. Now who am I? (The man) Now who am I? (The man) Who? (The Man) That’s right and don’t y’all forget it…\nLadies and gentlemen!. The winner by consecutive knockout and still champion of the world…\n(Ghost… face… Killah)\n*Cheering in the background*", "image": "https://images.genius.com/61b48fa7fe972c473dc1c20c9489e45f.1000x1000x1.jpg"}], "artist": "Ghostface Killah"}