{"songs": [{"title": "Wherever I Go", "album": "Birth of a Prince", "year": "2003-10-07", "lyrics": "[Intro: ShaCronz]\nYeah, uh, it's dark outside\nWe still in the hood with this one, ya'll\nYeah, from the projects, slums, Fort Greene\nHuh? Ain't no sun outside, never sunny where I'm from\nAlways grimy, yo, yo, yo, yo\n\n[ShaCronz]\nEveryday is a struggle, but you can catch my team hustlin' till the late night\nTakin' risks, playin' dice, screamin' \"We hate life!\"\nGettin' this money, but we want more\nI see a lot of niggas beefin', but they don't want war\nI heat targets, anything you see, rob it, got beef like the meat market\nI'm clappin' captains, lieutenants, and police sergeants\nI got two hoes named Denise and Margaret\nThey come through and finish drama after we start it\nAll my chicks major, I rep N.Y. like a Knick player\nGet paper, split haters, I still spit and shit razors\nGot eight pair of sick 'gators, five watches\nSwitch flavors, 50 red and blue rocks around the wrist, player\nMy vision is deep the Division will creep\nRun up on you, start hittin' your peeps\nNigga, we ain't playin, our mission's discreet\nI'm clippin' your peeps, have you missin' for weeks\nTo let you know we ain't playin'\n\n[RZA]\nOlive oil and fried tomatoes and basil\nI stepped in flared nasal from Hazelnut Amaretto\nMy watch 80 G appraisal\nPlus they drop 50 G's for a RZA beat\nCherry wood, hickory seats, presidential suites\nIce cold bottles of Cristy 'til my eyes misty\nComplainin' to my lawyer how this rookie tried to frisk me\nJealous of my jeep, I gave his badge to the chief\nAnd got his ass directin' traffic in the heat for a week\n\n[Freemurda]\nKeep comin' out your gums like loose teeth\nYou gon take 40 to the mouth and it ain't no brewski\nThat monitor gonna show straight lines like looseleaf\nGot Up North niggas straight out the box like Loosies\nWanna shoot me? know you get a kick out of that just like Bruce Lee\nYa'll don't wanna lose teeth\nComin' all out of your face just like pimples\nThat thing comin' out of my waist, gotta hit you\n'Cuz ya'll niggas ain't with it, better quit it\n'Til you catch one through that man dribblin' on your fitted\nThat mean one through the front, through the back of the cap\nLike the great Pun packin' a Mac in the back of the Ac'\nYou could take one, not talkin' bout a Ac'\nI get cake from the fat crack bag with them packs, what?\n\n[Allah Real]\nWherever I go, I pack my 44\nWherever I go, I always have dough\n\n[Outro: Daddy-O (RZA)]\nYo, peace, yo, Bobby! What up?\n(What up, O? What up fam?)\nWhat up cousin, how you (nothin' just trynna sling this shit)\nWhat's goin' on (You know I made that drop good off, right?)\nOh, word? (Guaranteed, we made all this shit, man)\nThat's what's up, yo, but check this out\nI got something new here for you, right here (what?)\nSupposed to give me some lesson (Lesson?)\nYeah, lesson (what you talkin' bout, nigga?)\nStraight (know, how to what, cook the shit up, nigga?)\nNah, nah, Knowledge, Wisdom, Understanding, Culture, Freedom..\nIt's right here (son, what's that all about, though, yo?)\nYo, God, it's the new way of life, knowhatimsayin? It's the truth\nIt's the way it's gonna set you free\nI think you an intelligent brother, you should check this out\nYouknowhatimsayin, Supreme Mathematics, youknowhatimsayin\nCheck this out, and let me know... (let's see what you talkin' about)\nYouknowhatimsayin, I know you'll respond good\nThis could take you to another level\n(Now hold on, man, you an O.G., you trynna tell me you trynna read, man, nigga?)\nListen, brother, I've been readin', man, without this man I wouldn't be here right now\nYou know? (You know what, god? Youknowhatimean?\nI'mma trust your word on this, I'mma pick this up, I'mma read this, aight\nI'mma get back at you, if I can relate, we'll relate\nIf not, you still gonna have those pounds for me though, right?!?)\nYeah, no doubt, but yo, right now, these the pounds right here, g\nThis is Math right here (yeah, it's like that, for real, fam?)\nFor real (aight) aight, peace (Peace fam)\nThis nigga, talkin' peace, man, this nigga's the wildest' nigga I know, yo!", "image": "https://images.genius.com/0b55b2ec40b427a658f9839bb61bb1e8.600x600x1.png"}], "artist": "RZA"}