{"songs": [{"title": "Out Of Your Mind", "album": "Freshmen Adjustment Vol. 1", "year": null, "lyrics": "[Hook: John Legend]\nWe can't even sit and talk, without you arguing\nYou're the one who started it\n\n[Verse 1]\nI got a girl at home but she don't cook\nI have my condoms in the stove cause she won't look\nAnd she never ever go to the grocery store\nSo I figure its safe to pull a grocery ho\nShe was buyin Alize out the liquor isle\nShe said \"I hope its not too ghetto\"\nRocked all gold force back in style\nI kept her number on file for my girl be actin wild\nLike last week I told her take me to the mall\nBut she don't drive\nMy other girl picked me up at 3:05\nShe got a brand new car, 16\nNow the car only 1 years old, oh\nMan but the body look grown, whoa\nBefore I catch a case I better take my ass home\nWhere the problems is, arguments be Daly like Carson is\nBut the problem is..\n\n[Hook]\nWe can't even sit and talk no more, without you arguing\nGirl you must be out of your mind, no no no\nYou're the one who started it\n\n[Verse 2]\nHold up, wait a second man\nThat's that thrift store info, that's all second hand\nWhy don't you talk to the mouth of the horses 'bout my Porsches\nCondos in front of the golf courses\nInstead you stay up, countin every second like a fake Roley\nI'm real, so you know I move real slowly\nThe way the censorship'll go off, you know me\nI ain't call you, you wanna know why?\nIm in Noha, Hon aloha, pushin jet skis so I\nCouldn't return the pages on my Motorola\nNextel, my cell, it don't work down there\nWhat happened in Cancun? Stays down there\nWhat's happenin here? Made me wish I stayed down there\nTake a seat, why you always makin a beef?\nYou know these walls too thin in this apart-a-ment\nNow everybody hearin our arguments\nBut the problem is..\n\n[Hook]\n\n[Verse 3]\nMan, boo you know what I do\nSo don't trip when I come home after 2 or 3 or 4\nI ain't messin with them girls no more\nIt's weak, the benz coupe is so sweet\nWhen I roll down the street, tears roll down her cheek\nShe said, \"You must love that car more than me\nAnd nigga I was with you before the cheese\nSo you need to work on your pri-or-ities\nIf she went with Fabolous I bet that she would be\nA-R-G-U-I-N-G and please\nI'm not actin like this cause I'm getting spins on\nW-K-R-P in Cincinnati\nYou think I'd get my voice so deep like\nW-K-R-P in Cincinnati\nThat's how much of a fuck I give\nYou seen cribs? That's how the fuck I live\nAs far as this?\n\n[Hook]", "image": "https://images.genius.com/11b5c3bdc828bc9942f2c195f9ffa76c.300x300x1.jpg"}], "artist": "Kanye West"}