{"songs": [{"title": "Serial Killa", "album": "Doggystyle", "year": "1993-11-23", "lyrics": "[Intro: Cutty Ranks]\nSix million ways to die, choose one\n\n[Verse 1: Kurupt]\nIt's time to escape, but I don't know where the fuck I'm headed\nUp or down, right or left, life or death\nI see myself in a mist of smoke\nDeath becomes any nigga that takes me for a joke\nWe hit a five dollar stick, now we putting in work\nUnaccountable amounts of dirt, death becomes all niggas\nAnybody killer, you know what the deal is\nNigga, you know what the real is\n\n[Verse 2: Daz]\nI see some mark brand niggas on the corner flaggin me down\nSayin, \"Yo Daz, what's up with the Pound?\nIs that nigga Snoop alright? Aiyo what's up with the crew?\nIs them niggas in jail, or are them niggas through?\"\nI said, \"If you ain't up on thangs\nSnoop Dogg is the name, Dogg Pound's the game\"\nIt's like this they don't understand\nIt's an everyday thang, to gangbang\nMake that twist, don't be a bitch, let these niggas know\nWhat's up witchu? I represent the Pound and Death Row\nAnd can't no other motherfucker in L.A. or Long Beach\nAnd Compton and Watts see D-O-G's\nNow, you can't come and you can't run, and you can't\nSee long to the G of the gang\nOne gun is all that we need, to put you to rest\n(Pump pump!) Put two slugs dead in your chest\nNow you dead then a motherfucker creeping and sleeping\n6 feet deep in, fucking with the Pound is\n\n[Hook: The D.O.C.]\nSuicide, it's a suicide\nSuicide, it's a suicide\nSuicide, it's a suicide\nSuicide, it's a suicide\n\n[Verse 3: Snoop]\nThe cloud becomes black and the sky becomes blue\nNow you in the midst of the Dogg Pound crew\nAin't no clue on why the fuck we do what we do\nLeave you in a state of paranoia, oooh\nDon't make a move for your gat so soon\n'Cause I drops bombs like Platoon\nWalk with me, hold my hand and let me lead you\nI'll take you on a journey, and I promise I won't leave you\nI won't leave you until you get the full comprehension\nAnd when you do, that's when the mission\nOr survival becomes your every thought\nKeep your eyes open 'cause you don't wanna be caught\nHalf stepping with your weapon on safety\nNow break yourself motherfucker 'fore you make me\nTake this 211 to another level\nI come up with your ends, you go down with the Devil\nNow roam through the depths of Hell\nWhere the rest your busta-ass homeboys dwell, well\n\n[Hook: The D.O.C. & Snoop Dogg]\nSuicide, it's a suicide\nSuicide, it's a suicide\nSuicide, it's a suicide\nNow tell me, what's my motherfuckin name?\nSerial killa! Serial killa! Serial killa!\n(Wake up in the morning, eat your Lucky Charms cereal)\n\n[Verse 4: RBX]\nDeep, deep like the mind of Minolta\nNow picture this\nLet's picnic inside a morgue\nNot pic-a-nic baskets, pic-a-nic caskets!\nAnd I got the machine to crack your fuckin chest plates\nOpen and release them guts\nThen I release def cuts\nBrutal, jagged edged, totally rough-neck!\nNow everybody scream, 'nough respect to the X\n'Nough respect given\nDisrespect and you will not be living\nWord to momma, Emma, drama, dilemma\n\n[Hook: The D.O.C., RBX, & Snoop Dogg]\nSuicide, it's a suicide\nSuicide, it's a suicide\nSuicide, it's a suicide\nNow tell me, what's my motherfuckin name?\nSerial killa! Serial killa! Serial killa!\n(Wake up in the morning eat your Lucky Charms cereal)", "image": "https://images.genius.com/d31a03639b8f8f4259b9b9da07972d52.996x1000x1.jpg"}], "artist": "Snoop Dogg"}