{"songs": [{"title": "The Way It’s Going Down", "album": "Adventures in Emceein", "year": null, "lyrics": "[Intro: KRS-One]\nYeah, yeah\nAdam Dice, how you get hardcore like this?\nYou better watch out\nThey all lookin for you now\n\n[KRS-One]\nK-R-S, O-N-E, comin back for y'all\nI do a little more than videos and rap for y'all\nI been in many cars, known by almost every star\nNew rappers, old rappers, this'll rock for any y'all\nThe edutainment from the pavement, Kris'll flatten y'all\nI'm like a fitted to my enemies, I'm cappin y'all\nWhat happened y'all? Them corporations backin y'all\nYou're so desperate you can't see that they be stabbin y'all\nThis that realness, come on you can feel this\nWhether fresh fruit or tax{?} my raps you can peel this\nThem conscious lyrics; hear it, it ain't new to me\nI see my influence done flipped the whole industry\nEverybody's conscious now and it's great\nAin't nuttin gon' stop us now y'all but the hate\nAnd wait - hate can't stop us either\nCause Knowledge Reigns Supreme, KRS the Teacher\n\n[Chorus 2X: KRS-One]\nDa-dee-dee, da-dee, dee-dee-dee-dee-da-dee-day\nKRS, son come'll back most every day\nYou have got to understand that we don't play\nThrow your hands up if you like the way it's goin down\n\n[KRS-One]\nLook at this, look at this, LOOK~!\nGrown men on the TV still jiggy\nStill on the television, holdin up they pinkie\nLittle children lookin at 'em thinkin that it's pretty\nBut let me introduce you to that gritty inner city\nWhere the cops be +Kurupt+ like my man from dogtown\nIf I unite with +Daz+ we could shut 'em all down\nHip-Hop, East West, North South we lovin it\nIt's time for new leadership, time for self-government\nPut a fist up! Every real club we rip up\nI spit raw conscious lyrics to lift Kris up\nNever give up, see the real O.G.'s know me\nBut these young'uns be buggin they think they can hold me\nI'm holy! I'm livin a different dimension\nI keep the crowd jumpin like hydraulic suspensions\nReleasin your tension with every lyric I mention the truth\nEight years, ain't that enough PROOF?!\n\n[Chorus]", "image": "https://images.genius.com/ad42a510e6be3523569fba6178f6bcf5.419x382x1.jpg"}], "artist": "KRS-One"}