{"songs": [{"title": "Little Death", "album": "Tetsuo & Youth", "year": "2015-01-20", "lyrics": "[Verse 1: Lupe Fiasco]\nNow bring it out like a finger in the back of your mouth\nCherubs and cerebellum\nTara at Sarah's wedding, Sam marrying Sam\nBand pushed upon the finger of Sam's hairiest hand (OOOH!)\nIf that sickens you, you a bigot\nIf it doesn't, well then you're wicked\nSuch is life, odd as Egg McMuffins at night\nNo answers, so let us watch these dancers\nStructure reformed gracefully being born\nOn the pallet of dark grays, concaves and spirals\nKaleidoscope into a Eiffel\nIt ripples then it tidals, vacillates then it virals\nBabylons then it Bibles and others\nAnd tell me of the spinning mothers\nAnd today's mathematics for beloved\nAnd beasts' bellies covered like the cummerbunds of butlers\n\n[Hook: Nikki Jean]\nHow was your day?\nCan I make what you say what I wanna hear?\nCause I want you here\nThe hell that we raised\nTo the heavens do anything for\nLa petite mort, la petite mort\n\n[Verse 2: Lupe Fiasco]\nThey keep the bottles just to make glass houses\nThen climb up to the second floors and throw rocks out it\nThen expect not a volley in reply\nSome place vulnerable like probably in the eye\nWhat of the chicken? What is it missin'? Is it dry?\nDid it die in some inhumane conditions so it didn't go relaxed\nAnd the tension from its demise\nPulled all of the flavor from the fat and made it flat\nAnd rather lifeless, well there's a place\nThat has a stunning turbot and more mercifully murdered Pisces\nBut barbaric are still the prices\nIt's rather niceless, apricot in dices and fromage slices\nMy son will call risotto rices\nIf and when he's left to his own devices, well\nHow is your memory? Is it returning like a lemon tree\nTo bear bitter fruit of what you meant to me?\nOr was it slippin' like permission? Am I trippin' like field\nI feel I'm grippin' but maybe the transmission\nStill left out the life, also left out the will, grief\nWill cheese never touch your teeth\nMaybe like kosher beef\nIs it real? Is it real? Is it real? Ha, hah!\n\n[Hook: Nikki Jean]\nHowl at the day\nCan I make you my prey?\nCause I want you dear, ooh, I want you dear\nThe hell that we raised\nTo the heavens make symmetries for\nOur petite mort, our petite mort\n\n[Verse 3: Lupe Fiasco]\nSo glad you're back\nBut not glad at that you're glatt\nWhere is the glamour in collapse?\nWhere in the shatter of the facts shoves one back to a pattern of stab wounds?\nSwoon ridden goons consumed and driven mad soon\nThe atelier slowly fills with baboons\nAnd other monkey business\nWhere killers go free cause the junkie's a funky witness\nRunny mascaras from the cunning mask wearers of death\nBygone errors, sittin' like two oil derricks\nSeparated by a sea of cooling num nums\nReminiscing of an every day playing hum drum\nWhere recognition went unnoticed\nAnd then solidified till it was stoic\nWe should've been poets\nSomewhere between amateurs and grandmasters of iambic pentameter\n\n[Hook: Nikki Jean]\nHow are your chains?\nDo they make you behave?\nKeep you over here, by your overseer\nFallen from grace\nDown from Heaven to memories' floor\nLa petite mort, la petite mort", "image": "https://images.genius.com/8c9f45d15475bdce48998bef15fad39d.1000x1000x1.jpg"}], "artist": "Lupe Fiasco"}