{"songs": [{"title": "Research", "album": "Dark Sky Paradise (Deluxe)", "year": "2015-02-24", "lyrics": "[Intro: Big Sean]\nAh-huh\nAh-huh\nWhoa\nThese ho's be doin' research\nI swear, she like:\n\"This piece of hair off in the sink ain't come from me first, no, no\"\n\n[Verse 1: Big Sean]\nThe way you stressin' got me blowin' indo outdoor\nEvery time you intro that's my cue to outro\nAnd I know all my niggas call you crazy, you just misunderstood, though\nThrough all the evil in your eyes swear I can still see the good, though\nBut you unlockin' my cell like you is a cop, how you decode\nAll my V-mails, G-mails even P.O. boxes got me P.O.’d\nYou saw my emails with CeCe when you wasn't CC'd\nI'm on my way to halfway, my baby, I need you to meet me (straight up)\nYou, you talkin' 'bout I had the key to your heart\nThen I got my first European, you took that key then you keyed it\nWhat type of shit do we be in? Blowin' up TNT'n'\nHella drama, TMZ'n, bitch, I'm leavin' then she switched the shit like\n\n[Pre-Chorus: Ariana Grande (Big Sean)]\nWhat you got to hide, hide, hide, hide? (uh-huh)\nLying next to me at night, night, night, night (uh-huh)\nYou text me all the time, time, time, time (whoa)\nSee, I know what you like, like I did the last time (whoa)\n\n[Chorus: Ariana Grande]\nDo you remember?\nDo you remember?\nDo you remember?\nWhen you had nothing to hide, hide, hide, hide?\n\n[Post-Chorus: Big Sean]\nWatch out, these ho's be doin' research\nI swear, she like:\n\"This piece of hair off in the sink ain't come from me first, no, no\"\nI swear (God)\nYou hang around too goddamn long, it's like you need work\nDo ya, do ya, do ya got a job, I mean, for real\nI swear (oh God)\nMan, these ho's be doin' research, doin' research\nWatch out, these girls be doin' research\n\n[Verse 2: Big Sean]\nOkay, I know you did some research\nWell shit, I did too\nI saw you wearin' Drake's chain, like you were part of his crew\nI saw you chillin' with Meek Mill up at the Summer Jam, ooo\nI hope my eyes the one that’s lyin' to me girl and not you\nI know we all got a past, but there's shit that I can't pass\nSeein' you at the Soho House, I know you can't afford that tab\nWhen I run into Chris Brown and he laugh, 'cause he know\nWhat you know, what I don't, it make me feel like I don't know your ass\nNow you saying shit like\n\n[Pre-Chorus: Ariana Grande (Big Sean)]\nWhat you got to hide, hide, hide, hide? (uh-huh)\nLying next to me at night, night, night, night (uh-huh)\nYou text me all the time, time, time, time (whoa)\nSee, I know what you like, like I did the last time (whoa)\n\n[Chorus: Ariana Grande]\nDo you remember?\nDo you remember?\nDo you remember?\nWhen you had nothing to hide, hide, hide, hide?\n\n[Post-Chorus: Big Sean]\nWatch out, these ho's be doin' research\nI swear, she like:\n\"This piece of hair off in the sink ain't come from me first, no, no\"\nI swear\nYou hang around too goddamn long, it's like you need work\nDo ya, do ya, do ya got a job, I mean, for real\nI swear\nMan, these ho's be doin' research, doin' research\nWatch out, these girls be doin' research", "image": "https://images.genius.com/740ca6fe7862ad174446f7794050b7a4.1000x1000x1.jpg"}], "artist": "Big Sean"}