{"songs": [{"title": "We’re Gonna Make It (feat. Mary Mary) (main version)", "album": null, "year": null, "lyrics": "[Mary Mary]\nI know the Lord, will make a way\nHe will make a way, yessssssss he will\nYessssss, he willlllll\n\nOhhh, I do believe that we will make it\nYeahhh, yeahhh, yeahhh, yeahhhh\n\n[LL Cool J]\nUhh uhh\nI was at rock bottom, my whole life was mo' problems\nReincarnation of a slave pickin cotton\nStress beamin down like the sun I felt rotten\nTo the core, was at war, cause the enemy is plottin\nI hear him knockin, sayin that we got him\nHot like solar, he wanna burn my soul up\nWorld on my shoulders but I roll back ya boulders\nWords have a funny way of comin back to scold ya\nWatch what come out of your mouth, you crack a molar\nI tried to told ya, hehehe\nEnemies gunnin, true believers ain't runnin\nOr duckin, we ain't scared of nuttin, ya feel me?\nThey wanna test me and press my buttons, oh really?\nAllow Uncle L to hip y'all to somethin, uhh, uhh\nYeah, uhh, check it out\nThere's a living power, make a man out a coward\nRebuild your strength like the new Trade Towers\nI thought that I was over, my life got devoured\nNow I'm on top and I pray for all the doubters\nTime to shout it, sing it louder\n\n[Chorus: Mary Mary]\nYeahhhhh, we're gonna make it\nWe're gonna make it (we're gonna make it)\nThank God we made it (yeahhhhhhhhhhh)\nAnd I mean it, yeah yeah, oh yeah\n\n[LL Cool J]\nI was feelin like my whole world was spinnin and spillin\nOn the ground and that God wasn't willin\nIt seemed like the only ones ballin was the villains\nDollar signs in they eyes, lyin to our chill'un\nI wanna kill 'em, I'd rather God hit 'em\nThey sellin venom and we buyin it like denim\nThese world wide webs they weave, we caught in 'em\nOld folks is dyin and CEO's skimmin\nThe bat's in your hand and this is the 9th inning\nKeep your eyes on the ball when you swingin\nDon't be confused, don't be fooled by the wind-up\nStart switchin your position, make your mind up\nPull your bootstraps tight, get your grind up\nGet your life lined up before time's up\nYo, yo, you know what?\nTake ten percent of that, dough you tryin to stack\nSend it up to God, I guarantee he send it back\nMultiply it by a hundred times, y'all remember that\nThat's just a little jewel to get the monkey off your back\nUhh, yeah, sing it out now\n\n[Chorus] w/ ad libs\n[LL Cool J]\nIn the darkest valley, through the loneliest alley\nNever give up, press on through the storm\nWeepin man fall, for the night seem long\nBut if you stand strong joy come within the morn'\nAnd it goes, on and on and on and on and on and-ah\nI know it feels like your back's to the wall\nWho's sittin in the crib, and you don't know who to call\n(Jesus!) Hangin on a tight rope, fingers slippin off\nBut you ain't by yourself dawg, we all been lost\nStay on your course, carry your cross\nAin't no stoppin, got to keep it poppin\nYou want it, you can get it, believe me the king did it\nNothin gonna hold you back, there's no limits\nI'm sent to bring truth to rap, not gimmicks\nAnd I'm not finished, man listen\nHere's the moral to the thesis, y'all cats need Jesus\nHe put your life back together, pick up the pieces\nWord to the masses, I heard God asked us\nFor less fake rappers, and more real pastors\nUh-huh, uh-huh, so hereafter\n\n[Chorus] - 2X w/ ad libs\n[Mary Mary] + (LL)\nWe made it, we made it\nThrough the storm and rain, yeahhhhhhh\nYou can make it, yes you can\nYou can make it, you got me\nI know you can, I know you can\nI know you can, yessssss, yeahhhhhhhhhhhhhhhhhhhhhhhhhhh\nI do believe we'll make it (Hallelujah!)\n(Glory! Glory!)", "image": "https://images.genius.com/9e00cf56336ec8915e2fa3b2b2e7502d.377x377x1.jpg"}], "artist": "LL Cool J"}