{"songs": [{"title": "Kiss the Ring", "album": "Only Built 4 Cuban Linx... Pt. II", "year": "2009-09-08", "lyrics": "[Intro: Raekwon, (Inspectah Deck), {Masta Killa}]\nSuga, come here, ayo man, tell ya man\nHe better bring that fucking money here tomorrow, man\nYou, walk up in the joint with me, man\nIt's all real, yo, what up son?\nYo, hold the bottle, it's your night, nigga!\nIt's your night!\nYeah, mad bottles! Playboy! We out of here, man\n(Step inside, kiss the ring — so salute, and toast to the best who done it)\n{Give it up for the Wu-Tang Clan!}\n\n[Chorus: Inspectah Deck]\nWhen I step inside, kiss the ring, Wu Familia\nLa Cosa Nostra, it's our thing\nSo salute, and toast to the best who done it\nMurder rap shit, I spit, for the vets who love it\nWhen I step inside, kiss the ring, Wu Familia\nLa Cosa Nostra, it's our thing\nSo salute, and toast to the best who done it\nMurder rap shit, I spit, for the vets who love it\n\n[Verse 1: Raekwon]\nBy the time you read this letter\nYour head gon' fly off your shoulder for lying\nAnd I'mma be in bed like holders\nBlood from a horse on your spread, you tried to play me now\nI'm coughing up, dough on your head, you just a baby\nSee me in the flick in Zurich, I had to maybe with me\nAll these niggas stay in the 90's, getting rich\nRick Ruler robe on with rings, walking to the throne\nFronting like I know I'm the king, I live alone though\nBuying up, China's Beemers, taking it to Simon's in Medina\nOnly just to blind you and leave ya\nThese young boys is crafted with aim, I bought 'em all\nFly ranches, cuz they all stand beside me with flames\nRegardless, yo, to making the classic\nYou gon' witness some of the tactics\nSome died, live in the action\nA live general when he walk, if he died, then we slide\nNinety thou' in the coffin, and take the child\n\n[Chorus: Inspectah Deck]\nWhen I step inside, kiss the ring, Wu Familia\nLa Cosa Nostra, it's our thing\nSo salute, and toast to the best who done it\nMurder rap shit, I spit, for the vets who love it\n\n[Verse 2: Inspectah Deck]\nBlack Jesus, check my walk, check my talk\nLegend in the flesh and I rep New York\nCrowned king, been down to bang, I'm House Gang\nKnockout specialist, in and out the ring\nGot dinner tables long as boats with old kitchens\nAnd Wu-Tang logos splashed on all the dishes\nYou know how I speaks the truth, how I teach the youth\nI'm an animal, I beast the booth\nBeen grinding, banging out for food to eat\nYour boy still eating good, check my new physique\nSince the world is mine, I'mma write my name on the clouds\nSo that ol' yee faithful, can praise it and bow\n\n[Verse 3: Masta Killa]\nNow he's an old Mafia don, from back when\nHe managed to survive the game, ducking fame\nIt's how he maintained, the State of Grace, kept his lab laced\nLadies of a fine taste, kept his place guarded\nWhile the young charted, found acquitted, all charges\nAnd his heart loss and, marksmen take the contract\nFrom the contact, waiting for the right event, it all made sense\nHe left no prints on the weapon, and he was blasting\nCame home from prison stashing, still stacking\nHis whip still matching his kit, steel flashing\nHands quick, nice with his shit, three holy foods drops jewels\nFrom a street corner level, young brother, I'mma rebel\nHere to instruct private soldiers to buck arms\nYa'll rap cats had your last win, toast the kings\nIt's Wu-Tang, it's our thing, kiss the ring\n\n[Chorus: Inspectah Deck]\nWhen I step inside, kiss the ring, Wu Familia\nLa Cosa Nostra, it's our thing\nSo salute, and toast to the best who done it\nMurder rap shit, I spit, for the vets who love it\nWhen I step inside, kiss the ring, Wu Familia\nLa Cosa Nostra, it's our thing\nSo salute, and toast to the best who done it\nMurder rap shit, I spit, for the vets who love it", "image": "https://images.genius.com/2691e582dc2839478e49279288d69cb1.1000x1000x1.jpg"}], "artist": "Raekwon"}