{"songs": [{"title": "On MediaTakeout", "album": "Kanye West’s Visionary Streams of Consciousness", "year": "2016-02-13", "lyrics": "Now - Media Takeout - always remember that you dissed the collection that changed the world\n\nYou seem like the type of organization hired to always keep dreamers down. when certain things in history happen you just got to respect it\n\nRespect the struggle. respect the hustle. respect the dreams.  respect the movement\n\nI had an album listening and clothing presentation and Madison Square Garden\n\nPeople were crying. people were throwing up the fist. people were dancing\n\nBut Media Takeout couldn't say one thing positive knowing damn well you'd love to be on the YEEZY 350 list\n\nYou probably got bootleg Yeezy's on right now\n\nI'm a human being. I'm an artist, bro\n\nYour site is entertaining and hilarious but certain things are just too far. you have no idea what I've had to go through\n\nSo many people didn't make it and gave everything they had for me to stand on their shoulders and break through fashion\n\nFashion ain't no joke for me. It's a way of life. creative expression and industry\n\nI've given everything I had for this moment. a lot of people feel it's the paradigm shift\n\nAnd I'm proud of this picture with me and Caitlyn. She gave the most heart felt speech at my wedding\n\nAnd was there in full support to see me realize this dream\n\nWow the paradigm  has shifted, She killed it. everything is changed now!!!! Lil Sis kiiiiiiiilled this shit!!!!!!!\n\nHAAAAAAAAAAAAAA FUCK ALL THE HATERS   PUT YOUR MIUTHERFUCKING FIST IN THE SKY RIGHT NOW!!!!!!!!!!!!\n\nI'M SO HYPE RIGHT NOW    EVERYTHING HAS CHANGED  . HAVE YA'LL EVER SEEN TRON? THE END OF THE TRON WHERE EVERYTHING LIGHT UP!!!!\n\nHAD TO ALL CAPS THIS!!!!!! NO MORE RULES.. MAKE YOUR OWN RULES.   ok now back to finishing Pablo\n\nThank you my brother Ricardo", "image": "https://images.genius.com/9fa6626ebb7cecda3ba692c1c80f52bf.1000x664x1.jpg"}], "artist": "Kanye West"}