{"songs": [{"title": "Ice Cream", "album": "Only Built 4 Cuban Linx…", "year": "1995-08-01", "lyrics": "[Produced by RZA]\n\n[Intro: Method Man]\nMa, Ma! Throw down some money!\nThe ice cream man is coming!\n\n[Hook: Method Man]\nWatch these rap niggas get all up in your guts\nFrench-vanilla, butter-pecan, chocolate-deluxe\nEven caramel sundaes is getting touched\nAnd scooped in my ice cream truck, Wu tears it up\n\n[Verse 1: Ghostface Killah]\nYo honey dip, summertime fine, Jheri dripping\nSeen you on Pitkins with a bunch of chickens how you're clicking\nI kept shooting strong notes as we got close\nShe rocked rope, honey throat smelling like Impulse\nYour whole shell baby's wicked like Nimrod\nCaught me like a fresh-water scrod, or may I not be God\nAttitude is very rude boo, crabby like seafood\nIt turns me on like Vine's Cee Allah Rule\nThey call me Starky Love hon, check the strategy\nBy any means, Shirley Temple curls was done by Billie Jeans\nBlack Mrs. America, your name is Erica, right true\nLazy eyeball, small feet, six shoe\nCaramel complexion, breath smelling like cinnamon\nExcuse me hon, the Don mean no harm, turn around again\nGod damn, backyard's banging like a Benzi\nIf I was jiggy, you'd be spotted like Spuds McKenzie\nI'm high-powered put Adina Howard to sleep\nYo pardon, that bitch been on my mind all week\nBack to you Maybelline Queen let's make a team\nYou can have anything in this world except C.R.E.A.M\nSo what you wanna do, what you wanna do\nLet's go ahead and walk these dogs and represent Wu\n\n[Hook: Method Man]\nWatch these rap niggas get all up in your guts\nFrench-vanilla, butter-pecan, chocolate-deluxe\nEven caramel sundaes is getting touched\nAnd scooped in my ice cream truck, who tears it up\n\n[Verse 2: Raekwon]\nShaolin's finest, what up boo, peace your highness\nYo I'm lounging, big dick style y'all niggas is the flyest\nMoves you're making too fly jewels are shaking\nNot a rape patient, you're looking good fly colored Asian\nGhettoes, them is your hometown\nWe can go the whole round\nAfter that, I'm shooting downtown\nI'm rocking hats and your wig is all intact\nWho's that queen bee chick, eyes pearly black\nFreaks be moving in fly sneaks\nTwo-finger rings and gold teeth and ain't afraid to hold heat\nSo when I step in the square dear\nYou better have C.R.E.A.M. to share, Ricans, ven aqui yeah\n\n[Hook: Method Man]\nWatch these rap niggas get all up in your guts\nFrench-vanilla, butter-pecan, chocolate-deluxe\nEven caramel sundaes is getting touched\nAnd scooped in my ice cream truck, who tears it up\n\n[Verse 3: Cappadonna]\nBlack chocolate girl wonder, shake ground like Thunder\nPolitic to your deficit step, gimme your number\nYour sexy persuasive ta-ta's and thighs\nCatch my eyes, like pies, I want your bodily surprise\nDouble down some time, Ice Cream you got me falling out like a cripple\nI love you like I love my dick size\nOoh baby I miss you, your sweet tender touches\nTake pulls off the Dutches\nOrgasm in my mind state, masturbate in your clutches\nI want you for self like wealth, so play me closely\nBitches paranoia for the sting, who want the most of me\nOnly a hard dozen wanna be calling me cousin\nThirsty for my catalog, baby shopping spree you're loving\nCall me if you want to get dug like the pockets\nI jizz 'em like a giant, break wombs out of the sockets\n\n[Pre-Hook: Method Man]\nWu-Tang in the cut, for real niggas, what?\nIt's the afterparty and bitches want to fuck\n\n[Hook: Method Man]\nWatch these rap niggas get all up in your guts\nFrench-vanilla, butter-pecan, chocolate-deluxe\nEven caramel sundaes is gettin touched\nAnd scooped in my ice cream truck, who tears it up\nIce cold bitches melt down when in my clutch\nAnd want their titties sucked, ice cream\nYeah...  your guts\nFrench-vanilla, butter-pecan, chocolate-deluxe\nEven caramel sundaes is getting touched\nAnd scooped in my ice cream truck, who tears it up\nIce cold bitches melt down when in the clutch\nThey want they titties sucked, ice cream\n\n[Outro: Method Man]\nOne love to my chocolate deluxes, keep your nails done\nAnd your wigs tight, word up\nOne love to my butter-pecan Ricans for calling me Papi\nThat's for real\nOne love to caramel sundaes, with the cherries on top\nYeah and big up to my French Vanillas\nParlez vous, francais, mi amor, merci, oui oui, bon bons\nAnd all that good stuff, that good stuff", "image": "https://images.rapgenius.com/4d25c9d2752ae4e2152832f93cf00b25.600x600x1.jpg"}], "artist": "Raekwon"}