{"songs": [{"title": "Pencil", "album": "Pro Tools", "year": "2008-08-19", "lyrics": "[Verse 1: GZA]\nThe echo chamber enhance the flow with the block party\nKeep an MC head spinning like Dark Bacardi\nThis B.A.C. is 2.3\nNow the liver's damaged, but his lungs are joint free\nSo inhale, exhale, breathe and get well\nKick something live stop chirping like Nextel\nI'm All In Together, a swordsman forever\nI paint the town red, with many heads are severed\nR-A-W, I still bring trouble to\nThrow your raps in the sleephold, quick to smother you\nDart hit your breastplate, meet ya death date\nRook down a E4, look, it's checkmate\nNo other way describe it but catastrophe\nThe plan was drawing blood and displayed it graphically\nDirect order, hit the border, then slaughter\nHorrific torture, by prolific authors\nShape and mold MC's, like I'm playing the skelly top\nIt's getting 'hot in here' like the single that Nelly dropped\nSo take ya clothes off, the track is so soft\nA little vodka turn 'em into Ivan Koloff\nWhy do the Gods make MC's study from\nThirty five, and fifty year, then try to become\nUnder the study with the sword above the head\nSo he would keep in mind under the open pledge\n\n[Verse 2: Masta Killa]\nFierce glisten, something so sharp\nPiercing, swords cling, the vigilante intimate\nClose combat, this is emceeing at its best\nBut there is no contest, sent I'm this\nSpeaking of a test, this and try to question this\nHe so different with the swiftness, godfather civilization\nShell casing, universal nation\nCould he be the one predicted, presidential sent in\nOld school soul survivors, we the wildest\nAsiatic Arctic flow is so frigid\n\n[Verse 3: RZA]\nIs it, the Zig Zag, I'ma pay you a visit\nSomehow mistake me as an old wise wizard\nWord? I'm not the same\nI go somewhere, don't remember how I came\nIs it the weed, the hash or the 'caine?\nOr the Digi being stained on my brain\nAppear from a cloud of smoke, your throat is on choke\nIf surrounded, seven men drop from one stroke\nEven if my feet was shackled down to one handcuff\nTo defeat me, ten demons wouldn't be enough\nI sleep in the lion's den, without the steel iron\nAscended like Musa coming down from Mt. Zion\nSuperlogical this, superlogical that\nDigital, take it back with superlogical rap\nHave a shootout, at midnight, the sequel's quicker\nForty four colt jolt, all you seen was the flicker\nYou distress like the damsel, lost like little 'Hansel'\nYour flame couldn't generate the heat of a candle\nMe, I be a Killa Bee, keeping exilery\nOl' play the desert e, shoot ten millime'\nMaster the millipede, you try to end the sea\nYour body being found in the naval yard artillery\nA black blind governor, a rich white mayor\nMan, this whole city ain't got a prayer\nBobby has invaded, now the whole town's slated\nYour decapitated head is being tooken out paraded\nUp and down the avenue, I drive a shatterproof\nBenz, and all my men's are tattle proof\nMy mic is a dyke, my life is a light\nA Day to God is a Thousand Years, how long is a night?\nYou get trapped in my shadow of dark, hark, who goes there?\nPower-U smells like carp, don't put your nose there\nDrop you to a tank of sharks, your wound's bleeding\nAnd it's been two weeks since they had their last feeding\nAny leftover bones, we grind into sand\nAnd spread it out, over 20 acres of land\nSome call me Steels, 'cause it's hard to bend me\nSee Cipher Pigs can't apprehend me\nIn a no smoking zone, I smoke bones of hash\nNiggas see me, then I disappear in the flash\nNext time I'm spotted, I got the fatter wallet\nMoving with a clique that stick like dry porridge\nSomeone's been sitting in my chair, who goes there?\nTo sub zero cold, your words can't flow here\nGlaciers of ice, plus layers of spice\nSay your prayers at night, 'fore you touch that mic", "image": "https://images.genius.com/aec3826e892d3ad57deb62e63fed42c5.940x940x1.jpg"}], "artist": "GZA"}