{"songs": [{"title": "OG Beeper", "album": "TESTING", "year": "2018-05-25", "lyrics": "[Intro: A$AP Rocky]\nUh, posted on the corner like a trapper, uh\nWhy he move his hands all around like a rapper? uh\nWhy he move his pants up and down like a scrapper? uh\n(Testing, testing, uh-huh, listen)\n\n[Chorus: A$AP Rocky]\nMy whole life I just wanted to be a rapper\nThen I grew'd up and the boy became a rapper\nAnd my older sister made me wear the golden wrapper\nShe said, \"Watch out, 'cause you know the hoes will trap ya\"\n\n[Break: A$AP Rocky & BlocBoy JB]\nTo the block—to—to—to the block\nTo the block, ayy, ayy, ayy\nDon't know why\nTo the block—to—to—to the block\nWord, word, word, word, word, word\n\n[Verse 1: A$AP Rocky & BlocBoy JB]\nGot my first pager, that was 1998\nSneaking, talking to my girlfriend way up late (Hello)\nMama on the mothafuckin' line, \"Boy, you cray\"\nI was trappin' since a young nigga by the way\nBack, way back then, boy, I was a different dude (Dude)\nStanding on the corner like I ain't got shit to do (Do)\nNowadays (uh-huh) feelin' like I ain't got shit to prove (To prove)\nAll the beef is lookin' minuscule (Yeah, yeah, yeah)\nAnd I modeled Dior, but I'm still a rapper (Yeah)\nTook a little detour, but I'm still a rapper (Yeah, yeah, yeah)\nUsed to be a D-boy but I'm still a rapper\nMy whole life I was livin' like a trapper (Trapper)\nShacked next to Casanova, locked up on the island\nI don't brag about it 'cause it never really matter\nKnew that I would never go back, don't hold back\nJust shine my golden teeth\nJust throw my dubs sack, that boof pack\nThat specimen, I could beef with OG beepers, nigga\n\n[Chorus: A$AP Rocky]\nUh, posted on the corner like a trapper, uh\nWhy he move his hands all around like a rapper? Uh\nWhy he move his pants up and down like a scrapper? Uh\nUh, uh, uh-huh\n\n[Verse 2: A$AP Rocky & BlocBoy JB]\nAll I ever wanted was some money and some jewels (Jewels)\nPray my YouTube reach a hundred million views (Million)\nPray I make a little extra cash for my dues (Dues)\nLike all she ever wanted was some ass for her boobs\nSneaking, uh, why she freak you? (Freaky) uh, why she geeking?\nUh, when she see me (See me) why she kinky? Uh\nWhy she wanna be my—\nTwenty years later and God still ain't make no errors (Make it)\nYou could be authentic, it's just living trial and error (you gotta take it)\nSitting in the cell, just from snitching on your cello-phone\nBut cozy beeper all I needed (Hello) OG beeper all I needed (Hello)\n\n[Outro: A$AP Rocky & BlocBoy JB]\nMy whole life I just wanted to be that nigga (Nigga)\nAll my ex-hoes, they was turning into strippers (Bitch)\nThen the whole time they was fucking other niggas (What)\nI paid no mind, I'm like fuck them other niggas (Fuck 'em)", "image": "https://images.genius.com/cb7817d0158c7503d7b035899b0f70c7.1000x1000x1.jpg"}], "artist": "A$AP Rocky"}