{"songs": [{"title": "Glaciers of Ice", "album": "Only Built 4 Cuban Linx…", "year": "1995-08-01", "lyrics": "[Intro]\nYeah, yo son you gotta take me to get them Clarks, man\nYo, check it out, yo\nYo, I got a new, yooo! Niggas don't even know son\nYo check the joint, boom\nYo I got a crazy idea how to do Clarks now\nCheck it out, boom, this is how you freak 'em, boom\nYou go get you go get the cream joints right? Boom\nNow now, all you all you dye, is this shit right here, boom\nAnd this, you know what I'm saying? Any color you want\nBut it'd be like, blue and cream, you know what I'm saying?\nShit like that, niggas don't even know\nBut son word is bond I'ma rock niggas this summer\nOn the real, know what I'm saying?\nYo son, I had crazy visions\nCheck it out check it out check it out, boom\nJust imagine if you buy, woo! Check it out\nJust imagine you bought navy blue, right\nA navy blue, a navy blue pair right, boom\nOf this, of this shit, know what I'm saying?\nBut dyed get this dyed cream on top\nJust imagine that color like\nBut you got it dripping like it's marble cake like...\n\n[Verse 1: Raekwon]\nStand on the block, Reebok, gun cocked\nAvalanche rock get paid off mass murderous services\nChef break 'em, watch the alley cats bake 'em\nPo-nine made 'em, drop grenades and take 'em\nQuick fast we reflect like the sky be blue true\nWu-Tang saga continue\nRap Meyer Lansky crash your fantasy\nGetting high fellas stand by, here's the plan, see\nSit back collecting Tecs and cheques and\nFlowing slow in a Montero flexing\nBeats break heavily word to INS bless me\nThrow me like three bags of cess\nFor real from the Killah Hill locked and caged in\nWe're sworn representatives, we acting like made men\nStrive for wives, nine lives and lies\nMax, sell and enjoy the highs, what?\n\n[Hook: Raekwon and Ghostface Killah]\nThe treasure is the glaciers of ice, original man\nPossess the power to hold G's guns and grams\nBaker baker, pull off a keystone kaper\nPoint out the baddest bitch in the crowd and watch me scrape her\n\n[Verse 2: Masta Killa]\nProceed with caution as you enter the symphony\nDegrees of punishment increase intensely\nSyndrome was caused by the deadly drums\nBut the battle was won by swords being swung\nSlicing with a vocal, from the international vocalist\nYour style is too local to fuck with this\nOffensive antagonist\nNo assistance, moving motionless\nMysterious swiftness\nThoughts roll down the shaft of the brain\nMental gives the signal to the physical\nWhirlwind kicks and hits from every angle\nViolent temperaments left continents dented\nPoison vintage wine rhymes I invented\nDrunk by the drunken puncheons that punctures the heart\nVital sparks from the arteries stopped\n\n[Hook]\nThe treasure is the glaciers of ice, original man\nThe treasure is the glaciers of ice, original man\nPossess the power to hold G's guns and grams\n\n[Verse 3: Ghostface Killah]\nStraight up and down it's all good\nPeace to them cheque cashing, chain snatching, gun flashing\nNiggas in the hoods bubbling good\nAnalyze Starks, who be buying lion heads and Clarks\nTo all my house bitches, Starks'll be home soon\nI'm on tour chill, catch me '96 in June\nBut until then my ten-man team be safe\nChill on the whips for seven months, we can all get laced\nTake a boat cruise, sip daiquiris and max\nSwimming pools, fly jewels, Wally shoes, blow stacks\nRelax kids, black kids got a craving for Cris\nUntil we get back, unpack, leave the Mac with your Wis'\nBut whatever, I gotta hit other sides of the Earth\nSpread Wu-ness, rule this, civilization's cursed\nBut luckily I'm born to be wild and then be out\nMove crowds collect twenty thou and then be out\nHeavy convoys my crew keep pretty boys paranoid\nBuilt like a steroid pat down Dan Aykroyd\nMy seeds, grow with his seeds, marry his seeds\nThat's how we keep Wu-Tang money all up in the family\n\n[Hook]\nThe treasure is the glaciers of ice, orginal man\nPossess the power to hold G's guns and grams\nBaker baker, pull off a keystone kaper\nPoint out the baddest bitch in the house and watch me scrape her\n\n[Break: Ghostface Killah]\nMy seeds, grow with his seeds, marry his seeds\nThat's how we keep Wu-Tang money all up in the family\n\n[Outro: 60 Second Assassin]\nIt's been a long time since the Father left in '69\nIt's been a long time since Wu Tang had the chance to shine\nIt's been a long time since we had diamonds, gold and drink Cristal wine\nIt's been a long time of walking around here dumb, deaf, and blind\nIt's been a long time since you had the Son of Man chant like golden wine\nIt's been a long time...\n\n[Outro: Raekwon]\nRespect heat holders\nRespect heat holders", "image": "https://images.rapgenius.com/b1286801fc8ac5ba6728904b53e0492f.500x427x1.jpg"}], "artist": "Raekwon"}