{"songs": [{"title": "She’s A Bitch", "album": "Raw, Uncut and X-Rated", "year": null, "lyrics": "You know what i think?\nShe's just a bitch\nMotherfucking [?] can't tell me nothing in the world\nShe's just a bitch, bitch, bitch, bitch, bitch...\nShe's a bitch, bitch, bitch...\nShe's a bitch\n\nWherever i go, it's the same case\nSame old thing all over the place\nFreak freak bitches, i can't forget\nAnd all i give 'em is no respect\nFigure this out while i say\nToo Short baby will play by play\nFour homeboys on a corner\nA bitch walks by and one jumps on her\nWalking with the bitch for about three blocks\n[?] turn to grind a [?]\nNo matter how the game goes with the rap\nShe's a bitch and [?]\nMan, that bitch ain't talkin' 'bout shit\nHomeboy, homeboy, is the bitch the tip?\n\nWherever i go, it's the same case\nSame old thing all over the place\nNiggas on the bus on the Oakland town\nTrying to catch bitches 'cause they are down\nLooking out the window, trying to peek\nFine young bitches walking down the street\nSee a woman about twenty-five\nThick as fuck with the [?]\nSome motherfucker all by himself\nSaid \"She's a bitch, but she's fine as hell\"\n\nWherever i go, that's what i see\nAny female is a bitch to me\nShe's a bitch, that's what i say\n99 times, every day\nShe's a bitch, that's the name of this rap\nListen, homeboy, Too Short got caps\nHomeboys roll, tos and fros\nGoing everywhere just pimping hoes\nHitting the strip with a fine girl\nDon't know nobody, you're on the world\nThe next day, the caps come through\nYour homie say \"fool, is that girl with you?\"\nHomeboy, homeboy, you're so damn down\nYou say \"That was my bitch from the Berkeley town\"\n\nShe's a bitch, all females are\nShe's a bitch, man that's hard\nThe next dumb bitch who hears my rap\nGonna grab a pen and bite her cap\nTalkin' about me like i'm a punk\nBut all that shit will sound like junk\nFake ass broad wanna rap about me\nYou're a bitch and the homies agree\nBitch, i'm talking to you\nYou's my bitch ad you know it's true\nBitch, you hear me speaking?\nNow Too Short is really tweaking\nYou're a bitch in stereo\nYou're a bitch and the homeboys know\n\nCool down, girls, it ain't that bad\nI only say bitch when i'm rapping or mad\nIf you know me, you are up\nI won't call you a bitch till my dick gets sucked\n'84 is now gone\nSee me singing a brand new song\nTalking about bitches, that's my style\nI'll keep doing that for a long while\nI'm T-O-O- S-H-O-R-T\nAll females are bitches to me\n\"Fuck Too Short\", that's what she said\nTwo days later she gave me head\nShe's a bitch, she's a bitch, bitch bitch bitch make me rich\n\nToo Short, i fuck your mind\nToo Short, baby, spit your rhyme\nIf i mack [?], i rap a party\nAnd see a bitch with a lot of body\nI tell my homie i'm moving fast\n[?]\n[?]\n[?]\nLet's go outside, without the noise\nAnd talk real dirty like girls and boys\nAnd if you don't suck Too Short\nYou ain't the bitch i'm looking for\n\nSo much game when the homies tough\nI make a bitch blow who never sucks\nIt really ain't a lie, but I just met her\nNow I'm saying, \"Bitch, suck better!\"\nSlapping that bitch, roughing her up\nI got her [?] and she can't get fucked\nSoon as i'm through and bust my nut\nOne minute later, i kick her butt\n\nToo Short, baby, i'm no sucker\nLiterally, i'm a motherfucker\nAnd bitch, you're just a bitch\nYou work fast food and think you're rich\nToo Short, baby, got playboy songs\nHomeboys just sing along\nSay she's a bitch, she's a bitch, bitch bitch bitch bitch make me rich\nShe's a bitch, bitch, i'm rich\n\nToo Short, baby, i can handle her\nDisrespectful with no manners\nBitches don't care, not no more\nBitches lay up with Sir Too Short\nAll of them say, back to back\n\"You're talking about me when you sing your rap\"\nWherever i go, that's the case\nFreak freak bitches all over the place\nShe's a bitch, you can't forget\nAnd all you give 'er is no respect\nShe's a bitch, remember that\nShe's a bitch, that's a Too Short rap\n\nRollin' [?], you see a freak\nStopped your car in the middle of the street\nYou so damn down, you know you hard\nYou say \"come on, bitch, get in the car\nWhat's wrong with you? are you lazy?\n'Cause you're just standing there looking crazy\"\nShe don't move and you start to yell\nYou call her a bitch and [?]\nBurnt up rubber all over Oakland\nTwo base rock cabbies, that's what you're smoking\nYou big old nigga, so damn rich\nAnd all you're saying is she's a bitch\nBitch, bitch, bitch bitch\nAll you're saying is she's a bitch\n\nGonna sing a rap about a freak\nFucking a different nigga every day of the week\nShe's so nasty, she's so fast\nAll you gotta do is grab that ass\nYou game ain't even gotta be tough\nTo take her home for a nice quick fuck\nI'm telling you people, she's a freak\nThe bitch even fucks when she starts to bleed\nFive days straight, what's the tip?\nSome nigga limping with a burnt dick\nOne day baby came out of class\nSome old nigga grabbed her ass\nThe nigga was happy, so damn cool\nThat old ass nigga couldn't be in school\nBaby didn't care, she's still with it\nShe fucked that nigga, didn't know he was a pimp\nGame goes on in the big Oakland\nOne down pimp, one bitch [?]\nLook\n\nSo much death on the Oakland streets\nEveryody fucking with OPD\nSlanging cocaine, knocking it off\nKilled some nigga and never got caught\nRunning from the police, every day\nYou can't make no money no other way\nJust kinking back, getting high\nYour homie got killed and you don't know why\nA bitch [?], that ain't true\n'Cause you lay down and she fucks you\n\nSo much game in a Too Short rap\nHer money was short and the bitch got slapped\nSo much game on the microphone\nHer money was long and i went to the [?]\nBitch, i'm that man\nIt ain't that hard to understand\n\nI can front myself with this beat\nI bet you hear it and you still love me\n'Cause you're my bitch, my freaky broad\nYou sucked my dick 'cause game is hard\nTalking on the phone, Too Short said\n\"Tell me, young girl, do you suck head?\"\nYou said no, but wouldn't you know?\nMy big fat cabbies made you blow\nTwo days old, what do you know\nFreaky little bitch, she's now my ho\nTwo days ago, i didn't know she exists\nBut now baby is my bitch\nToo Short, baby, and his women\nI heard my homie say \"Man i'm [?]\"\nI fuck bitches every week\nAnd i ain't never caught VD\nBut if i do, i swear to God\nI'mma kill that bitch or my name ain't Todd\n\nAnd you know that's right\n\nShe's a bitch, she's a bitch, bitch bitch bitch bitch make me rich\nI'm Too Short, baby, what do i say? she's a bitch, every day\n\nOne, two, three, here i go\nFuck a bitch and fuck a ho\nI'm that nigga on top of life\nSmoking on cabbies, don't smoke no pipe\nEighteen years i have lived\nAnd i still love a young bitch\nFourteen, fifteen, all the way up\nIf she can bleed, then she can fuck\nHomeboys, do you agree?\nStatutory rape ain't shit to me\nI'm Sir Too Short on the microphone\nGot [?] young freaks all alone\n\nAnd if my rap makes me rich\nI'll still say she's a bitch\n\nBitch bitch bitch bitch\nToo Short said that\n\nYou think you're down, but you ain't hard\nSee a girl, say \"Hi, sweetheart\"\nThe young girl stops, you started to spit it\n\"How you doing, baby, do you have a minute?\"\nShe said \"No, i never would\nI have a man and he treats me good\"\nYou're a mark, you ain't tough\nYou called her a bitch when you couldn't get sucked\nYou coulda got sucked in your room\nBut you said \"Bitch, way too soon\"\nI'mma tell you, mark, they way it works\nYou's a bitch, just like her\n\nWherever i go, that's the case\nSame old thing all over the place\nFreak freak bitches, i can't forget\nAnd all i give 'em is no respect\nFigure this out while i said\nToo Short baby done the play by play\n'Cause the wait it be, 'cause the way i see\nAll females are bitches to me\nShe's a bitch, that's what i said\n99 times, everyday\nToo Short, baby, gonna spit it to you\nShe's a bitch, man i'm through", "image": "https://images.genius.com/5596228ae8537847e97db188cbe62640.1000x952x1.jpg"}], "artist": "Too $hort"}