{"songs": [{"title": "Livin’ In A Movie", "album": "Freshmen Adjustment Vol. 1", "year": "2005-03-21", "lyrics": "[Intro]\nYo, this sound like some movie shit, right?\nGet your popcorn, get your condiments\nYou don't wanna miss nothing, okay, listen\n\n[Verse 1]\nThey call me Edward Scissorhands 'cause I'm trying to cut\nShe claim she got cramps, I'm gon' get you to suck\nAnd you not gon' use your teeth, you hear?\nYou gon' find out What Lies Beneath right here\nThe Preacher's Wife don't give head, get a divorce, man\nThe Kids been calling you the headless horseman\nLike Sleepy Hollow, see she swallow\nSuck like ol' girl, got booed at Apollo 13, Ghosts\nUse my Hollow Man for Friday 13th\nYou be Ghost, Backdraft from the toast\nNiggas who drop names is oh so shameless\nGet a chain that's stainless, they Almost Famous\nMy bling got 'em calling me Lord of the Rings\nThe Shining make it hard for her to Do The Right Thing\nBut I Don't Say a Word, I'll never tell\nUntil you get a Kanye beat, you'll never sell\n\n[Refrain]\nAnd I'm living a movie, not living by rules\nIt's just a movie, don't lose your cool\nOne, two, Ye coming for you\nThree, four, better lock your door\nFive, six, seven, eight, nine, ten, never sleep again\n\n[Verse 2]\nShit's deeper than the Sleepers\nThe Jeeper Creep up on your block and cops Clock-us\nTry to Baller Block-us, use Absolute Power\nYou gave him 9½ Weeks, why you trying to Rush Hours, huh?\nAnd in The Cell don't drop soap in the showers, huh\nThey try to give me Life, I'm out in an hour, huh\nBack on the block with more Juice than Pac\nMaking mo' money 'cause of The-The-The-The Roc\n\n[Refrain]\nAnd I'm living a movie, not living by rules\nYo, what you talking about, man?\nOne, two, Ye coming for you\nThree, four, better lock your door\nFive, six, seven, eight, nine, ten, never sleep again\n\n[Outro]\nI said some shit like, umm\nIf you in my things, you Suicide Kings\nThere's only Three Kings, Me, Myself and Irene\nYou know what I'm saying?", "image": "https://images.genius.com/11b5c3bdc828bc9942f2c195f9ffa76c.300x300x1.jpg"}], "artist": "Kanye West"}