{"songs": [{"title": "Str8 Like That", "album": null, "year": null, "lyrics": "We just too turnt up\nTurn up to the max\nWe be gettin zooted\nDo it straight like that\n\n[Chorus]\nWe do it straight like that, get money straight like that\nWe run it straight like that, who want it straight like that?\nWe do it straight like that, get money straight like that\nWe run it straight like that, who want it straight like that?\nWe just too turnt up\nTurn up to the max\nWe be gettin zooted\nDo it straight like tha\nWe just too turnt up\nTurn up to the max\nWe be gettin zooted\nDo it straight like tha\n\nDJ turn me up! Please don't turn me down\nThese niggas ain't hear me then, these niggas gonna hear me now\nI got bad hoes in my section, these niggas wanna burn me down\nSo I'm gon' make it sparkle, tell the waiter come serve me now\nJust Ciroc bottles and top models, all real niggas that pop hollows\nI pulled up and I drop-topped, and my bad bitch just popped out\nAnd like Alakazam! This shit way out of my hands!\nAnd I'm with black card shawty, vroom-vroom jumpin out of that Lamb\nWell damn, it's YSL in my shirt, fly as hell off Earth\nY'all niggas smoking on dirt, I'm on probation poppin on Perc\nWe sippin that lean, the fuck y'all mean\nMy money so long and my bitch so mean\nWe smokin on strong and I'm with my team\nAnd We turned up, got your bitch tryna fuck\n\n[Chorus]\nAll I do is turn up, I'm about to show y'all\nEarly bird get the worm, I'm up way before y'all\nI don't even know y'all, riding with the doors off\nFuck her on the lean, then I fucking doze off!\nThe dope man is my role model, I had a TV on top of my floor model\nThat bitch would show, fiends used to smoke dope out the antenna\nCloset full of amphibians, aim at it and hit it\nDifference between me and your girl: my girl, ass thicker\nLife sentence my trunk, real niggas respect it\nDumb charm on my necklace, stupid watch on my left wrist\nI ain't have a lot so I brag a lot, when I got a lot, I pop a lot\nI bought a drop, bought some pussy, get head in the parking lot\nMy rhyme style's unorthodox, my weed stank no Tic-Tac\nAsking me where I get that, Gucci sat on my flip flap!\nPaint job cost 10 stacks, rims cost me another ten\nSo tell a friend to tell a friend to tell a friend to tell a friend\n\n[Chorus]\nStraight like that nigga, straight like that\nNo birthday get cake like that\nAnd I ball hard niggas hate like that\nCause I drop that work, come straight right back like whoa\nI peeled off in the Bent, came straight right back in a Rolls\nPeeled off with ya bitch, came straight right back with y'all\nNigga we share that bitch, 10 big chains I don't wear that shit\nBig Glock 9, I air that shit\nAnd a big V12, I steer that shit like skurrrt\nAnd they be like word, I'm with a bad bitch, but I wouldn't wife her\nMy neck all froze and my wrist like burr\nAnd my shit so cold, Ima need a light fur\nWe turned up to the max, turned up on them racks\nGot shorty all on that pole and she gon turn up for these stacks\nCause I'm ballin, like Spalding\nMy wrist flooded, New Orleans\nAnd I'm shittin on 'em, no toilet\nAnd no referee, I called it\n\n[Chorus]", "image": "https://images.genius.com/6929169de7116d41676151bdea5cc773.1000x1000x1.jpg"}], "artist": "Meek Mill"}