{"songs": [{"title": "You Won’t Tell, I Won’t Tell", "album": null, "year": null, "lyrics": "[Greg Nice] Hella hella hella 1997 style, hey hey hey hey\nWhat what? Hey hey hey hey\nHey hey hey hey hey hey\n[Busta Rhymes] Greg Nice, Busta Rhymes in the place to be\nAnd for the whole entire world to see\nFuckin up your whole entire par-ty\n\nChorus: Greg Nice, Busta RHymes\n\nBusta Rhymes and Greg Nice we never fa-il\n(You won't te-ll, I won't te-ll)\nMy shit stay fresh never ever ever stale\n(You won't te-ll, I won't te-ll)\nFoot shock to your ass just like the third ra-il\n(You won't te-ll, I won't te-ll)\nSnitches get stitches when they go to ja-il\n(You won't te-ll, I won't te-ll)\n\n[Verse One: Greg Nice]\nSometimes I feel like Bobby's World\nRocked the mic, before jheri curl\nSingle, mingle, no main girl\nOn the low, like Secret Squirrel\nUhh! It's time to Patti Duke\nSo shake whatcha mamma gave ya like Luke\nIt's Greg N-I always down to juice\nToo much Hennesey make ya puke\nNow I bust on indo dreams\nUhh, I don't be fuckin with keys\nRock the shell-top, or pin-striped Lee's\nI could write a song make a hundred G's\nYou went back to high school, nuthin but a tease\nKnow I got stones, call me Mr. Please Please\nWalkin down the street wit yo'\nBox in your hand... hot damn!\nI never drove a Lex dog, never drove a Land\nOr a Testarossa, rather puff L's\nAnd I sip on mimosa, bedroom wall\nHomegirl have my poster, I'm not surprised\nThat's the way it's supposed to, makes ya hot\nMuch hotter than a toaster, style elevates\nLike a roller coaster\n\nChorus\n\n[Verse Two: Busta Rhymes]\nYo, the greatest unsolved mystery\nOf how I rotate your chicken golden rotissiere\nFreak the cheesecake flow from here to Sicily\nYou really need to get offa my, hickory-dickory\nThe main attraction, even freaks the close caption\nSnap break a piece off, a little small fraction\nI still fulfill your dissatisfaction\nI'm in the process, of completing a transaction\nHuh, Carnegie Hall, like a opera singer nigga\nStill doin the yes y'all, uhh!\nToday we bust guns in the future we bustin lasers\nOut of range in case you tried to reach me through my pager\nI'm bout to blaze ya, with the flows that will amaze ya\nHot to death nigga, call me Smokin Joe Frazier\nSeal up the box and present the closed casket\nBusta Rhymes got the boombastic fruit basket\nBend your ass back, stretch you like elastic\nMore drastic when I be feelin fantastic, uhh!\nCaught the chills stack the large bills barbeque on the grill\nMe and my niggas grant wills\nNiggas talkin shit but they ain't got no skills\nLookin like they full of shit your niggas named you no frills\nDon't let me catch you takin for granted\nWhen my lyrical cause will leave y'all niggas stranded\nDistributed by, Warner Elektra and Atlantic\nNiggas thought they could fly, but really crash landed\nHah, when I'm in the place I'm up in your house\nAll y'all corny motherfuckers need to shut your mouth!\n\nChorus\n\n[Greg Nice]\nIf you won't te-ll, I won't te-ll\nIf you won't te-ll (I said that I won't te-ll)\nI say if you won't te-ll...", "image": "https://images.genius.com/54314abfbbbf16253d72455428cc44e6.834x834x1.jpg"}], "artist": "Busta Rhymes"}