{"songs": [{"title": "Toca Tuesdays Freestyle", "album": null, "year": "2014-06-09", "lyrics": "God Blesser\nWord Processor\nI'm in the nerd I professor\nLike confessions but I never snitch\nI'm never this\nI never swerve off the road and fall into a ditch\nBut if I did like my car accident I kid\nKhalifa, I see ya\nAnd two things I'll never be, I never been a repeater\nAlways solo, no no, I live like a hobo\nWork for billions, maybe millions, not a trillion\nMaybe like a trillionaire, have you seein' things that aren't really there\nAnd have you searching for it, this, look\nLike my homie thought drug dealing, Kick, Push, how so?\nOn the outro, so long, on my first shit without 'cha\nI'm still the shit, without hoes\nWithout toilets never spoil it\nRoyalties trying to oil me\nThe royal penis is clean your highness\nI look down at my finest\nBlinded by the shininess of my dick\nThat's how good she do it\nI had it, but I lose it\nLosing, that's Lu, that's still my name\nI still got fame and no shame, uh\nMy shit is wild, it's never tame\nYour shit is child, your shit is trash, I'll take your chain\nLike 50 on stage, Summer Jam shit got me going in the rage!\nBut then I turn another page\nI don't smoke, but I sure do blaze\nBlaze niggas like I'm Just Blaze on the beat\nMPCs bangin' in the streets\nI'm too deep for these niggas to weak\nNever sweet and no hurt shes\nI'm no Hershey's but her shes love me so\n[?] niggas like \"Wurd!\"\nYours is not better than mine\nI ain't gotta curse, fine\nShit, fuck, damn, pussy, other expletives\nI never rest, you gonna need sedatives\nShit don't registers\nI am like a teller with propellers, I fly\nAnd I count cash fella\nI bounce pass shout to Dame Dash, yella\nYes sir, it's like a MC for NWA NGs mp3s\nI keep 45 calibre's, HKs and MP3s for these Gs\nShout to GDs, shout to BDs and MC and Mickey Cobras\nWe need the peace treaty for the summer\nFree Rondo! By him a condo, shout out to Lil Durk\nOTF Nunu rest in peace\nHope you just was a lil hurt, nothing you need to get snubbed over\nPut the guns down like Chance say\nYou see Beyonce on the knees, yea\n[?]\nYou see me ride through the hood in the Maybach, stay back\nGlocks shootin' way back my aim's too far\nI'm too far gone, [?] my arms, yea, they reach\nLike I'm Mr Fantastic, you sit down, lil bastard\n[?] snatch purses offa these girls\nNigga dontchu know, I run these worlds\nFrom Pluto back to Mars\nBack to back with these cars I got Cobras, Ferraris\nEverything you can't follow me\n[?] your doors, sit up\nAnd I ain't e'en got them bitches what!\nShout out to Nipsey Hussle, shout out to my boy Ty Dolla\nGon' make 'em holla\nEverything look better with a bitch next to it\nThat's the next single, nigga, watch 'em play the music\nI might go platinum or I might go plutonium\nI don't even know\nAny plaque you know I'm holdin' [?]\nI'm from the 'Go, never stop, on the row\nGettin' dough on the low\nLupe Fiasco", "image": "https://images.genius.com/b67b7f5bfbd7eb8c5c334fa8b05a2432.400x400x1.jpg"}], "artist": "Lupe Fiasco"}