{"songs": [{"title": "Upgrade", "album": "The Incredible True Story", "year": "2015-11-13", "lyrics": "[Produced by Logic & 6ix]\n\n[Intro]\nAye, let me just rap...\n\n[Verse 1]\nI've upgraded while they've waited\nWill they love it?, Will they hate it?\nNever faded I evade it\nCause I never really want to complicate it\nThink I've made it, yes I did\nI'm giving them bars like a bid\nLet me rewind it like a vid\n\"Did he just say that?\" Yes, I did\nAnd they really wanna get it like I live\nGod damn mother fucker what I gotta give\nWay back in DC, at Liv\nOn the way to that everlasting life\nWill they rob you? Yeah, they might\nHold up, wait a minute, veer to the right\nOn this road to success, I've faced my fears\nThen hop on that flight\n\n[Hook]\nI've upgraded\nI've upgraded\nI've upgraded\nI've upgraded\nI've upgraded\n\n[Verse 2]\nMy bitch bad got a sick figure\nPlay 1 show and get 6 figures\nWe build bigger, money tall as a mountain, bitch\nI've got Hilfigers, like goddamn\nYes sir, I know who I am\nI'm that main man Martin, out here kicking out Pam\nJust riding 'round with my Gina in that all-black Beamer\nAll the way from Maryland whipping out West Covina\nHold up, now check my demeanor\nYeah, your girl bad, my girl meaner\nI've upgraded\n\n[Bridge]\nI've got the Akira on the wall\nI just can't follow their law\nSwear to God that they know me\nThey don't know me at all\nAnd its all right, it's alright\nI've upgraded\n\n[Verse 3]\nLet me bring in them new kicks like Timbaland\nI gotta reboot with this upgrade\nMy metaphors on Cloud 9\nAnd the meaning behind them is so vague\nBefore I created this universe\nI had to fly through the Bermuda first\n6ix on the beat, then we queue the verse\nNow I'm in another world when the flow emerge\nFeel like I'm in a Fifth Element\nI'm in my element lost in paradise\nIts me, you and Leeloo, Korben Dallas in Fhloston Paradise\nNever by chance like a pair of dice\nI don't give a fuck about their advice\nI'm on another planet, no I'm not manic\nBitch I'm decompressed, know they can't stand it\nCause I pilot it and manned it the best\nAll they demanded was I gave up and laid that dream to rest\n(God damn!) Hold up, wait a minute; fuck all that shit\nI left Earth ages ago to avoid and duck all that shit\nYou know when we on\nMaking music that's gon' survive for eons\nBloodshed from America to Sierra Leone\nThat's that shit I can't be on, that's the reason I be gone\nYes, I keep it professional like Luc Besson and Leon\n\n[Hook]\nI've upgraded\nI've upgraded\nI've upgraded\nI've upgraded\nI've upgraded", "image": "https://images.genius.com/b9b6844bdd8ebfbe10235ad54d885cfa.960x960x1.jpg"}], "artist": "Logic"}