{"songs": [{"title": "This Is Why We Can’t Have Nice Things", "album": "reputation", "year": "2017-11-10", "lyrics": "[Verse 1]\nIt was so nice throwing big parties\nJump into the pool from the balcony\nEveryone swimming in a champagne sea\nAnd there are no rules when you show up here\nBass beat rattling the chandelier\nFeeling so Gatsby for that whole year\n\n[Pre-Chorus]\nSo why'd you have to rain on my parade?\nI'm shaking my head and locking the gates\n\n[Chorus]\nThis is why we can't have nice things, darling\nBecause you break them\nI had to take them away\nThis is why we can't have nice things, honey (Oh)\nDid you think I wouldn't hear all the things you said about me?\nThis is why we can't have nice things\n\n[Verse 2]\nIt was so nice being friends again\nThere I was, giving you a second chance\nBut you stabbed me in the back while shaking my hand\nAnd therein lies the issue\nFriends don't try to trick you\nGet you on the phone and mind-twist you\nAnd so I took an axe to a mended fence\n\n[Pre-Chorus]\nBut I'm not the only friend you've lost lately (Mm-mm)\nIf only you weren't so shady\n\n[Chorus]\nThis is why we can't have nice things, darling (Yeah)\nBecause you break them\nI had to take them away\nThis is why we can't have nice (Nice things) things (Baby), honey\nDid you think I wouldn't hear all the things you said about me?\nThis is why we can't have\n\n[Bridge]\nHere's a toast to my real friends\nThey don't care about the he-said, she-said\nAnd here's to my baby\nHe ain't reading what they call me lately\nAnd here's to my mama\nHad to listen to all this drama\nAnd here's to you\n'Cause forgiveness is a nice thing to do\nHaha, I can't even say it with a straight face\n\n[Chorus]\nThis is why we can't have nice things, darling (Darling)\nBecause you break them\nI had to take them away\nThis is why we can't have nice (Uh-uh) things (Oh no), honey (Baby, oh)\nDid you think I wouldn't hear all the things you said about me?\nThis is why we can't have nice things, darling\n(And here's to my real friends)\nBecause you break them\nI had to take them\n(And here's to my baby)\nNice things, honey\n(He didn't care about that he-said, she-said)\nDid you think I wouldn't hear all the things you said about me?\nThis is why we can't have nice things", "image": "https://images.genius.com/5c8131af7d5d20f3c8f296538af74308.1000x1000x1.jpg"}], "artist": "Taylor Swift"}