{"songs": [{"title": "Talk to Me", "album": "Grow Season", "year": null, "lyrics": "[Hook]\nTalk to me, I talk back\nLet's talk money, I talk that\nTalk to me, I talk back\nLet's talk money, I talk that\nTalk to me, I talk back\nLet's talk money, I talk that\nTalk to me, I talk back\nLet's talk money, I talk that\n\n[Intro]\nYeah! It's Young\nWiz Khalifa man\n412, Pittsburgh, Pistolvania and all that\nUh-huh\nBut right now we gon' talk money\nSo talk to me\nYa kno? Yeahhh!\n\n[Verse 1]\nIf she wanna talk to me, I'mma talk back\nSaid she love my music and she think I'm all that\nTold me I be on her mind like a fitted ball cap\nLove the way I blow money, and get it all back\nCup full of that Patron, swisher like a ball bat\nSkinny lil nigga but my pockets all fat\nAnd I'm lookin for a dime, or better yet a dub\nSo if that pussy good go on and show a nigga love\nYeah, I'm posted in the club and there's freaks errywhere\nBottle after bottle, good weed up in the air\nI see a bad bitch look at me when she stare\nSo I'mma go and say a couple things in her ear\nI tell her I'm the man, and that I run the town\nYou think about it, I could change your life right now\nAnd if your nigga trip, then best believe it's goin down\nIf shit get outta line, there ain't no need to go around\nJust come and...\n\n[Hook]\n\n[Verse 2]\nAy, ay\nGrippin on this honey while I'm puffin my reefer\nYoungin talk money, get a homie bilingual\nIf she lookin like a hungry ho that's how I treat her\nNo I don't need her, go on off the meter\nI don't chase hoes, chase cheese like the cheetah\nYou be all polite, sayin please when you meet her\nI don't even greet her, just look her in the face\nPull her to the side, let her give my blunt a taste\nAsk her what she drank, a little this, alotta that\nForget about a shot cause we got bottles in the back\nShawty, swallow some of that, and get low\nAnd move that thing around like a certified pro\nCigarillo full of 'dro, so what you wan' do?\nYour girls know the biz, you can bring your friends too\nAnd you can do you, cause they gon' do me\nI'd rather do y'all, I'm down for all three\nJust come and...\n\n[Extended Hook]", "image": "https://images.genius.com/b0673dfc8e451f01ab36cb28e28673e6.500x498x1.jpg"}], "artist": "Wiz Khalifa"}