{"songs": [{"title": "Good News", "album": null, "year": "2019-09-01", "lyrics": "[Verse 1]\nI spent the whole day in my head\nDo a little spring cleaning\nI'm always too busy dreaming\nWell, maybe I should wake up instead\nA lot of things I regret, but I just say I forget\nWhy can't it just be easy?\nWhy does everybody need me to stay?\nWell I hate the feeling, when your high but underneath the ceiling\nGot the cards in my hand I hate dealing\nGet everything I need then I'm gone\nBut it ain't stealing can I get a break?\nI wish that I could just, get out my god damn way\nWhat is there to say? Ain't a better time in the day\nMaybe I'll lay down for a little\nInstead of always trying to figure everything out\nAnd all I do is say sorry\nHalf the time I don't even know what i'm saying it about\n\n[Chorus]\nGood news, good news, good news\nThat's all they wanna hear\nNo, they don't like it when I'm down\nWhen I'm flying it make 'em so uncomfortable\nSo different, what's the difference?\n\n[Verse 2]\nWell it ain't that bad\nIt could always be worse\nI'm running out of gas\nHardly anything left\nHope I make it home from work\nSo tired of being so tired\nWhy do I gotta build something beautiful just to go set it on fire?\nI'm no lie but, sometimes the truth don't sound like the truth\nMaybe 'cause it ain't, I just love the way it sound when I say it\nSo what I do? If you know me it ain't anything new\nWake up to the moon, haven't seen the sun in a while\nBut I heard that the skies still blue\nHeard they don't talk about me too much, no more\nThat's a problem with a closed door\n\n[Chorus]\nGood news, good news, good news\nThat's all they wanna hear\nNo, they don't like it when I'm down\nWhen I'm flying oh, it make 'em so uncomfortable\nSo different, what's the difference?\n\n[Verse 3]\nThat there's a whole lot more for me waiting on the other side\nI'm always wondering, if it feel like summer\nI know maybe I'm too late I could make it there some other time\nThen I'll finally discover\nThat there's a whole lot more for me waiting\nThat there's a whole lot more for me waiting\nI know maybe I'm too late I could make it there some other time\nThen I'll finally discover\nThat it ain't that bad\nAin't so bad, when it ain't that bad\nAt least it don't gotta be no more\nNo more, no more, no more, no more\n\n[Instrumental]", "image": "https://images.genius.com/70b2ca5e1882a2f184d45a2e6ccb37eb.916x916x1.jpg"}], "artist": "Mac Miller"}