{"songs": [{"title": "Runaway", "album": "Absolute Power", "year": "2002-09-24", "lyrics": "[Intro: Tech N9ne]\nYo, wassup baby?\nHow you been?\nIt's been a long time since I talked to you last\nI got a question, you still with homeboy?\nY'know homeboy don't matter to me\nI'm interested in you baby\nWe can creep\nY'know what I'm sizzlin'?\nJust think about it baby, I'm tryin' to get with you for real\n\n[Hook: Erica Hugunin]\nMight be some fun to runaway\nThis game is one I wanna play\nI'm done, he's gone and run astray\nNo fun, the sun has gone away\nMight be some fun to runaway\nThis game is one I wanna play\nI'm done, he's gone and run astray\nNo fun, the sun has gone away\n\n[Verse 1: Tech N9ne]\nWassup?\nThis ya boy Tech Nina\nIt's good to hear ya, but it's been a minute since I seen ya\nFox demeanor, gots to dream ya\n'Cause you stay blocked and locked with hops between ya\nI know you got a man, I know you got a little on the side\nBut I was thinkin' if you down for creepin' then we can slide\nYou's a hot one, and you look like you need a top notch one\nYa boy couldn't win it with Johnnie Cochran\nI know he with you when it's cool, but I'm still tryin' to get you to cruise\nThat ill behind and your lips and your boobs\nCome get with a fool\nWe can take any trip that you choose\nForget that your dude is waitin' while you twistin' in the nude with this\nBoss villain ghetto true mafia\nFeel you from here to Czechoslovakia, what's stoppin' ya?\nI need it and I don't think that I can deal without it\nStrictly being real baby tell me what you feel about it\n\n[Hook: Erica Hugunin]\nMight be some fun to runaway\nThis game is one I wanna play\nI'm done, he's gone and run astray\nNo fun, the sun has gone away\nMight be some fun to runaway\nThis game is one I wanna play\nI'm done, he's gone and run astray\nNo fun, the sun has gone away\n\n[Verse 2: Tech N9ne]\nI know you got time with dude and I'm new\nBut I'm a true, and I'm tryin' to get into you\nI know he probably give you big love, but I don't trip Cuz\nDude's cool, I met him at the strip club\nYa he's good for you, he keeps you grounded\nWhile I pound it, soft and wet is how it sounded\nLeave you astounded, from the tongue dancin' around it\nThat's the angle, search for an angel and then I found him\nRight between those eyes baby\nI know it gets heated at home\nBut your homie Tech Nizzle can hear your cries baby\nI know it's hell, I put out fires with this\nGot him cussin' on your pager and slittin' tires and shit\nYou don't need that, you need positive feedback\nLift you're skirt up and throw you on the counter and eat that\nL-E-G's back, pull it out and I tease that\nWe release that, have us a drink and repeat that\nWhat you think?\n\n[Hook: Erica Hugunin]\nMight be some fun to runaway\nThis game is one I wanna play\nI'm done, he's gone and run astray\nNo fun, the sun has gone away\nMight be some fun to runaway\nThis game is one I wanna play\nI'm done, he's gone and run astray\nNo fun, the sun has gone away\n\n[Verse 3: Tech N9ne]\nYo, yo, check\nI need a hardcore chick who can chill on the rap side\nLove, money, and keep her scratch-tied\nSo when your homeboy don't act right\nJust remember my face\nIs a permanent sittin' spot, for your backside\nI'm just tryin' to kick it\nMake up your mind you want N9ne to stick it\nI'm diggin' you because you fine and wicked\nDon't want to miss it, I'm psycho sick wit' it, dig it\nI sop you like a biscuit, and I'll hop ya like a cricket\nThis is a - decent proposal don't ever hate on it\nWhen I see somethin' I want baby, I'm never late on it\nYou ain't gotta answer now, you can marinate on it\nBut before I go I got to throw this serenade on it\nIt goes when it rains and when it thunders\nIf he treat you like a cheap and he runaway from ya\nYou can call me on the under\nWhen you need someone to run to just dial my number\n\n[Hook: Erica Hugunin]\nMight be some fun to runaway\nThis game is one I wanna play\nI'm done, he's gone and run astray\nNo fun, the sun has gone away\nMight be some fun to runaway\nThis game is one I wanna play\nI'm done, he's gone and run astray\nNo fun, the sun has gone away\n\n[Outro: Tech N9ne]\nSo what you think baby?\nYou think you can do this?\nYou think you got the borders to do this with me? (Hehehe...)\nI know you're thinkin' about it\nI know you're thinkin' about it\nI see how you look at me\nYou and me exchangin' looks over his shoulder at the restaurant, remember that? (Heh)\nYa, I know you remember that\nJust creep with me baby, it's cool\nWe can kick it, y'know what I'm sayin'?", "image": "https://images.genius.com/478a9ba0370b10241e03f91f6e741b36.1000x986x1.jpg"}], "artist": "Tech N9ne"}