{"songs": [{"title": "Game Recognize Game", "album": "Legit Ballin’", "year": null, "lyrics": "[Man talking]\nSup pimps? Pimps ain't pimpin now that's why they got to get out the game\nWomen have mo' money than the pimp, ain't that cold?\nHoe have mo' money than the pimp\nHoe have mo' money than the pimp\nAmen, Amen\nHoe got mo' money than the pimp\n\n[1st verse] Twista\nDo a playa like Twista got game I do declare\nAll these niggas out here claimin they pimpin truly there\nLike new rhymes I got to feel these hoes I'm in there like booty hair\nThat's my duty there\nAnd I got a public announcement for all you mufuckas worldwide\nWord to me shit for Keenbean all let her pimp a dream team\nIf you ain't got paper your girl tight\nYou let that girl slide\nIf it was me she would have to be out straight humpin\nShit she would have to do something\nI was pumpin big back in 96' I need a new lick\nBut I got on a handle that function Legit Ballin or nuthin\nI got it down kinda like dreadlocks\nSmackin like Red Fox\nStrollin slow\nSmokin dro\nCould you ever tell me how these ladies out here coulda flow\nPaper than a pimp that's the way the game go\n\n[Chorus]2x\nThat's the way the game go\nThis shit done changed\nNiggas done switched roles\nPimps ain't got more money than the old hoes\n\n[2nd verse]Ms. Kane\nHmm, hmm, hmm ,hmm\nGuess the po pimp need him a hood rat\nCause a chick like me want a house on a hill can you buy that\nWhere my ride at\nIts type come out 99' stats\nLet my ins, stack while you still po pimpin up in a old Lac\nYou got to school me though\nGot me everything down to my kings so you owe it to dough\nTreat a trick like flow it to dough\nDon't be ashamed if your game fall short for the love of this hoe\nThe name Cane and I'm lovin the dough\nNigga holla all night if your talking bout given me mo'\nGot a song that'll make you fall like a body like a bottle of Glyphs on shape\nWhen I'm touchin the toes\nGot you touchin the moves hittin the store\nType of daddy getting dollars from the block ha\nBet you pimpin in the block bringin me gifts furs and rocks\nBan Prada out of stock ha\nMotion competition locked on\nGetting Twista NBA droppin hot ones\nI'm a chick and gotta clock ones\nGet yo' game tight\nYou found it vic then you pop one\n\n[Chorus]\n\n[3rd verse] Twista\nSteady pimpin in the cream dog\nSip on some Hen\nGimme the flame\nShow me the bud\nNow I'ma pull a call\nBut its difficult when these lames all call bout\n\"Baby girl I don't wanna break your heart\"\nSteady drinkin off\nTakin her out\nPickin her up\nCome up off in the club offerin love\nAnd softenin up\nWhere you get that game from huh bruh?\nYou comin weak and can't be pimpin her on the daily and leavin the dubs\nBaby know you a scrub\nYou gotta be more like the pimps in the industry\nMuch love to Eightball and MJG, Too-Short and Ice-T\nPimp C, Bump B, and Suga-free\nPlaya exact is what you couldn't be\nCause you a lame used to have game but shit done changed\nCouldn't take the reign caught up by these busy dames\nAnd I heard you let em' the 6 and the Range\nIf you can't mack don't attempt to\nCause all women ain't lame\nMatter fact the hoes pimp too\nMs. Kane will fuck around and pimp you\nCoulda had control of her but they way you trick her she meant to\nYou the type of pimp that's strange yo'\nHave your girl flip the script on you or beat you out yo' change dough\nI hang low smoking the furry cango\nWhile these sucks looking for love somewhere over the rainbow\nCause that's the way the game go", "image": "https://images.genius.com/5060d4ef55ecae336f25c132a4f941f2.496x500x1.jpg"}], "artist": "Twista"}