{"songs": [{"title": "Tonight’s Da Nite (Remix)", "album": "Dare Iz a Darkside", "year": null, "lyrics": "[Intro]\nWho wanna have a motherfuckin' orgy?\nWord is bond, word is me\nSmokin' mad blunts, and all the fronts and\nCheck it out, whatcha want and\nGo on with slang, boogie da bang, rockin' my thang\nFunkadelic hit you with irrelevant, heyyyy\n\n[Verse 1]\nMicrophone check, I walk around the street with black TECs and knapsacks\nI'm known for smokin' ass-cracks 'til I get ass flashbacks\nSo all my niggas up your fuckin' jammies let me hear ya lick 'em\n*bo bo bo bo bo bo bo* Now did you catch the victim? HELL NO\nCome back in to fatten to funky tracks\nBlast a motherfucker until you're peekin' through his back\n'Cause my brain is twisted, funky realistic on the ill shit\nI rock it 'til, bitches start givin' up that punany\nPut jammies up the coochie, pass the clit, pass the loose shit\nThen BOO-YAA, I gave you another shot of the good shit\nDon't believe me? Why your pussy breathin' hard and on tilt, bitch?\nYour clitoris, danglin' from my cock, I don't feel shit\nSo check me, the original Joe Pesky freak the sexy\nI got more Gadgets than the Inspector, go-go jet-skis\nThen swoop through your troops, knock the boots on your groups\nRob ya for your loot, wrap my fuckin' chain around your tooth\n'Cause, that's the way it goes when Tonight's Da Nite\nThe music feelin' Funkadelic and the mood is right\nI stick the nine between your eyes and blast you outta sight\n'Cause that's the way the knotty-headed niggas rollin' right\nBlunts by the boxes, I smuggle in Chocolate Thai to get me high with\nI ran through more niggas than any kid that was adopted\nPlus an ostrich couldn't swallow my cock, quick 'cause it's stock which\nMakes the Soopaman Luva get stockings by the flocks, bitch\nHOOAHH...So on and on and let me kick the wrath\nThat light skinned brother with mad shaft up your fuckin' ass\n\n[Chorus]\n(\"I can't wait to get it on\")\n(\"Tonight's da night, and me and my niggas ain't playin'\")\nOn with slang, boogie da bang, rockin' my thang\n(\"I can't wait to get it on\")\n(\"Tonight's da night, and me and my niggas ain't playin'\")\nOn with slang, boogie da bang, rockin' my thang\n(\"I can't wait to get it on\")\n(\"Tonight's da night, and me and my niggas ain't playin'\")\nOn with slang, boogie da bang, rockin' my thang\n(\"I can't wait to get it on\")\n(\"Tonight's da night, and me and my niggas ain't playin'\")\nFunkadelic hit you with the irrelevant\n\n[Verse 2]\nYou wanna see me get cool\nThe original rude bwoy, fuck with the new toys\nLike pistols, I dismiss crews, so order some new boys\nBlast the funky buddha's lockin ash up in my body\nFuck Fonzie, Potsie, I bring Sad Days to niggas constant...ly!\nFreak Funkadelic phrases 'cause I choose to\nI'm fuckin' Madonna down to Smurfette down one down to M'fufu\nFunks formatic, the fat shit, the wicked basket from caskets\nPlus I'm rollin' blunts with niggas ashes\nSmoke on the choke, light a toke until it's proper\nI deserve an Oscar for pullin' Glocks out niggas mouths 'cause\nI kill like that, plus I roll like that\nI'm that guy with cerebral palsy, even Bo knows that\nBut FUCK THAT, we jumped in the new Runner to get some ganja\nGoin' Uptown, we check Benny Red out, he pulls the smack out\nThen roll up the bills-nilz, or better yet the pute\nThe loo-pay, rank near my knots to rock the block\nHittin' niggas upside the head with rocks in socks, Glock on cock\nBack, trigger-hap, P P P rockin' in unity\nMotherfucker! Yeah yeah motherfuckers, it's on it's on it's on\n\n[Outro]\nThrow your hands in the air, and wave 'em like you just don't care\nAnd if you haven't been fucked by the Soopaman Luva\nLet me hear you say, oh yay-yuh! (That's only for the hoes!)\nCome on, oh yay-yuh! (That's only for the hoes)\nFunkadelic hit you with the irrelevant\nFacts and max, and on and on my crew pull gats\nFlick slaps 'em back, come on and fuckin' up tracks\nKick the mad wicked, Bricks to stick it\nCome on and, I get Wilson like Pickett then stick it\nShe wanna check me when I'm lickin' your ass\nAnd lickin' ya down to your clitoris\nDo you remember this, bitch? I know you're kinda hearin' this\nStyle that I'm kickin', yes I'm mad wicked\nFunkadelic runs the mad train up your anus!\nBaby, 'cause I'm famous!\nNope, I didn't mean that\nThe mean fat black fat tracks and on teams that\nI'm on team strapped, sports a bean hat\nWant to rhyme to be down, but homey ain't gon' mean that\n(\"Ba-bump, ba-bump\") (\"Ba-bump, ba-bump\")\n(\"Ba-bump, ba-bump\") (\"Ba-bump, ba-bump\")", "image": "https://images.genius.com/d90c906f33a174fa71425b4dd339eb96.1000x1000x1.jpg"}], "artist": "Redman"}