{"songs": [{"title": "Underground", "album": "Kristyles", "year": null, "lyrics": "[Hook]\nWhat does it mean to be underground?\nIt means you gotta be free to be underground\nYo, you got your own key when you're underground\nIf you're listening to me yo you underground\n\n[Verse One]\nIt's time that I open with a thunder sound\nNow look around your own town for the underground\nYo, you rhymin for the TV, or a million CD's?\nYou ain't a MC, you ain't underground\nYou could be platinum or gold, hot or cold\nBut it's the respect you hold that's underground\nWhen the critics don't get, that for the streets you spit it\nWhen your lyric they fear, that's underground\n\n[Hook]\n\n[Verse Two]\nYo, white kids, black kids, skinny kids, fat kids\nThem Asian cats be underground\nChicanos, Palestinians, Milanos, fuck the Lone Ranger\nWhere's Tonto? That's underground\nFreddie Foxxx, Blackalicious, Kweli\nM.O.P., GangStarr that's underground\nMad Lion, Smif-N-Wessun, Buckshot\nArmageddeon T.S. that's underground, UHH!\n\n[Hook]\n\n[Verse Three]\nYo, the t'cha returns, I told y'all I went to Cali to learn\nAnd that shit was underground\nIf the cops be eyein you, cause survive is what you try to do\nYo I'm wit you, you underground\nIf it's justice you want, and you protest the ice they flaunt\nYou want skills that's UNDERGROUND\nYo it's not about a rugged rapper, or an actor\nIt's about your subject matter, that's underground\nLOOK!\n\n[Hook]\n\n[Verse Four]\nChevonne Dean from Ruff Ryders, all the Outsidaz\nYoung Zee, that's underground\nWhen all your money's spent, and you're still hangin on\nTo 50 Cent (get it) you underground\nWhen you rep the collective consciousness of hip-hop\nNot hip-pop, you underground\nYo it ain't about jewels, bitches and cars\nIt's about Nas, that's underground, yo!\n\n[Hook]\n\n[Verse Five]\nTo be underground simply means that you're down\nFor the struggle, get 'em up, that's underground\nYou could be a classy lady or a whore\nBut if you protest the war, for sure, you UNDERGROUND\nIf the government can't see you, or deceive you\nYou love your people, believe you underground\nIf you refuse to play the game, you go against the grain\nYou ridin the train, you underground - get it!\n\n[Hook]\n\n[Verse Six]\nYo, yo, that blast from the past, like Grandmaster Caz\nBam and Flash, that's underground\nDoug E. Fresh, Lord Finesse, KRS\nIf you listenin to this you underground\nTurn it up now KRS about to show you how\nThey go wow, BLAOW for the underground\nMr. Walt, Evil Dee, KRS, BDP\nKenny P, that's underground - do it!\n\n[Hook]\n\n[KRS-One]\n(Alright!) Turn it up ah, turn it up ah\nTurn it up ah, turn it up ah\nTurn it up ah, turn it up ah\nTurn it up if you underground - Listen!", "image": "https://images.genius.com/ac03aceebeb9534bc61a89a14f6162c1.495x495x1.jpg"}], "artist": "KRS-One"}