{"songs": [{"title": "This Ring", "album": "Anghellic", "year": "2001-08-28", "lyrics": "[Intro]\nDa da da da da da da\nDa da da da da da\nDa da da da, come on\n\nDo you take this man to be you lawfully wedded husband\nIn sickness and in health, for richer or for poorer\nFor better or for worse, ‘til death do you part? I do\nDo you take this woman to be your lawfully wedded wife\nIn sickness and in health, for richer or for poorer\nFor better or for worse, ‘til death do you part? I do\nFrom the words of a patriot\nI often fear that the sins in my past\nWill come back to haunt me\nBut the consequences are more than I can bare\nI feel that shit, this piece right here\nIs about what comes with fame\nAnd the struggle to keep family within a family\nI give you, this ring\n\n[Verse 1]\n(This ring)\nGot me a top notch straight hot fox\nWe sought rocks and the ewok slot was caught\nGot dropped two playing hopscotch on the block\nOught not twat plot yo' for hops knot I brought dots (This ring)\nHelp me remain sane, no damn games\nCame from bane to a changed mane\nNo cane thang refrain from gang bang\nSlang a praying brain reigns family fame, then came pain\n(Say hello to Tech N9ne!)\nEverybody wanna be down with a nigga\nWomen get a whiff of the money\nThinking of taking it from me\nThey get up in the club, giving the love\nThrowing the pussy full of liquor and bud\nBooty hopping around up in the mo\nGet to looking around\nEvery ho wanna lick a nigga low\nInfatuated with niggas with dough\nGet 'em in the sack and try to make 'em let it go (Tech N9ne)\nBe autographing bitches in front of rapping niggas\nWho think of having figures they get to grabbing triggas\nThey can't imagine villains when they come back and get us\nWe get to whacking niggas\nI ain't never wanted no parts of this\nI don't never want to break another heart for this\nWhy the devil gotta make it, why the Lord\nWanna make something that'll kill something so marvelous\n\n[Hook]\n(This ring)\nBrings demeaning demons in (G-strings)\nSongs we sing make 'em fiend semen and (Green things)\nClinging, dreaming, thinking of being (Mrs. thing)\nWith this ring\nBut if I wasn't Tech N9ne\nBitches wouldn't even wanna be with Tech N9ne\nIf I did no music then would you respect mine\nThis wedding band and music\nDraws a line between life and Tech N9ne\n\n[Verse 2]\n(This ring)\nWas supposed to protect a nigga, best for niggas\nWho couldn't stop having sex with bitches\nBless the missus, who stress to kiss us\nEven though we spend our checks with strippers\nObsessed with clitorises (This ring)\nMade a nigga feel macho\nCry for, lie for, die for, my ho\nNigga I go face diablo with a hostile gospel\nIf I can't have tres or cuatro, little vatos\nI'ma let a lot flow what they sell, up in osco, up a nostril\n(That sound like Tech N9ne)\nNigga where the weed where the\nMuthafukin' blow and the hoes? (Yes, yes!)\nNext to me is ecstasy asking me if I wanna roll (Yes, yes!)\nBitches never gave a fuck about a fling, makes it exciting\nWhen a married nigga wanna fuck around\nAnd bitch know he's down for the fling (Yes, yes!)\nI've been tested and a lot of times been invested\nDidn't know this Tech's shit\nWould constantly get a nigga molested\nBeen approached by some of the best tricks\nIn the game and they came strong but I hanged on\nTo this ring and I hope my son don't sing the same song\n\n[Hook]\n\n[Verse 3]\nQuincy J. told me, superstars are good providers\nBut two times out of ten when we're on tour family's not beside us\nWhat can a nigga do when he makes ends\nAdd more to the time they spend\nWhile he make ends, everything else breaking\nAnd the bond at the house may end\nAnd your wifey steady yellin' 'bout quality time\nAnd you think, with all the fame and fortune shit oughta be fine\nBut what happens when the divorce papers just gotta be signed\nAnd you lose half and your children 'cause you gotta be N9ne\nI wanna relax with them and spend time to the maximum\nBut if silence is golden, then me making noise is platinum\nI gotta be Tech and daddy and hubby\nBut music, women mixed with family's ug-aly\nI know and you know that hella be\nHot for a nigga's infidelity, but until then (What)\nGod, forgive me for any promises that I broke\nFamily, can I be forgiven for all the liquor and weed that I smoke?\nWhen I succeed, will I cope\nWill I still breathe without both\nThis ring (Tech N9ne)\nI don't know but when I go I'm leaving out dope\n\n[Hook]", "image": "https://images.genius.com/365df4b783df60dc1a28c15c531795e6.1000x978x1.jpg"}], "artist": "Tech N9ne"}