{"songs": [{"title": "Really Doe", "album": "Lethal Injection", "year": "1993-12-07", "lyrics": "[Intro]\n*Gun shot* \"Ain't nobody talkin when I'm talkin fellas so shut the fuck up!\"\n(\"And who the fuck are you?\")\nOhh.. steppin up in my motherfuckin uhh..\nChuck Taylors, Knick kickers, Wallabee's\nOn my ass I got the umm.. um.. khakis, 501's\nOn my back I got the uhh.. sweatshirt\nYou know, with the fat three creases\nUhh, my t-shirt, Slingshot, uhh.. khaki shirt\nUmm, and I got the Cake cutter in my—in my pocket\nUhh, got the afro, the braids\nMotherfuckin uhh, rollers\n\"You got to believe in somethin\"\nAnd I just ask my motherfuckin self, uhh\n\"Why not believe in me?\"\n\n[Verse 1]\nTo G or not to G, is the question\nAnd like Smith told Wesson\nI'm shady with the .380 old school diploma\nI'll leave that ass in a coma, so\nIf you got a herringbone, Welcome to the Terrordome\nTwo-eleven, sorry Reverend\nOh my god, gettin robbed\nReach for the smog, \"Atomic Dog\"\nHard to swallow, janky as Rollo\nCount to ten, and don't try to follow\nCause just like Waco, I can take fo'\nATF, to they death\nBust a left on Western, go and get a room\nDon't want to be a felon like Stacey Koon\nGet the right bitch, hit the light switch, here we go\nTap that ass like this - really doe\n\n[Chorus]\n\"You got to believe, somethin..\"\nWest Side Lynch Mob\n\"I got to believe in me..\"\nCause I'm a motherfuckin G\nCause I'm a mother-fuckin..\n(\"And who the fuck are you?\")\n\n[Verse 2]\nThirty in a holdin tank, catch the vapors\nMake me a pillow out of toilet paper\nConcrete bench kickin' off the hemorrhoids;\nEses deep, don't fuck with dem boys\nPhone check, collect call from the baller\nHer mama said please don't call her\nDo-Wah-Diddy, far from New Jack City\nSeen one of my peers, \"What the fuck you doin in here?\"\nHe said, \"One-eighty-seven on the enemy\nAnd they treat me like I just shot a Kennedy!\"\nDeputy bitch thinks she's the Queen Bee\nInk on my thumb, index, and pinky\n\"Sir, what set you from?\" Play dumb\n\"General popu-la-tion\"\nMama put your house up, and I can bounce up\nOut this motherfucker, that's why I love ya\nOut like a boss, with a half-pint of sauce\nGot the shit sewed up like Betsy Ross\nWhat a friend know? Buy some indo\nNever fuck with a silly ho - really doe\n\n[Chorus]\n\"You got to believe, somethin..\"\nWest Side Lynch Mob\n\"I got to believe in me..\"\nCause I'm a motherfuckin G\nCause I'm a mother-fuckin..\n(\"And who the fuck are you?\")\n\n[Verse 3]\nKnock you out like NyQuil, I'll kill you quick\nYou sucker-for-love-ass trick\nSo don't run up, wit ya gun up\nCause I got the back breaker, double pump rump shaker\nCause we can play hookie in the Aqua Boogie\nWith concrete Nikes, ya gets no stripes\nLivin unforgiven with the mic on\nAnd punks runnin like roaches with the light on\nAnd that's all the shit I'm startin\nBust a cap (ka-kow-POW) like Jerome on Martin\nYou lookin for a punk with benefits\nCause you got a baby, that take many shits\nAnd you know I got a grip like a baby on a tit\nScopin', hopin', thighs open\nBut I kick back, six-pack, and hit the Phillie slow\nHooker ho - really doe\n\n[Chorus]\n\"You got to believe, somethin..\"\nWest Side Lynch Mob\n\"I got to believe in me..\"\nCause I'm a motherfuckin G\nCause I'm a mother-fuckin..\n(\"And who the fuck are you?\")\n\n\"You got to believe, somethin..\"\nWest Side Lynch Mob\n\"I got to believe in me..\"\nCause I'm a motherfuckin G\nCause I'm a mother-fuckin..\n(\"And who the fuck are you?\")", "image": "https://images.genius.com/d285cdee971ccf939f58e3ec2fef1d31.763x760x1.jpg"}], "artist": "Ice Cube"}