{"songs": [{"title": "Wu-Gambinos", "album": "Only Built 4 Cuban Linx…", "year": "1995-08-01", "lyrics": "[Intro: ‘The Killer’ sample]\nAnd in our line of work we need all the help we can get\nTony Wing’s the name. He works for a drug ring in Central America\nWho wants to kill him? No information, say yes or no\n1.5 million\nAll right, you get what you want, money's no object. They’re all clean\nNo serial numbers. Untraceable. And they're explosive head bullets, your favorite\nI felt someone walk over my grave. You want to change your mind?\n\n[Rae]\nYo son criminal is blowin' the fuck up\n[?] iced out?\nYeah 'cause you know what I'm sayin'? You know how we roll on this shit\nYo diamond\nYo you know your people's flipped on them niggas last night\nWord word word it's super sad\n[Rae] Yo man shit happen man, what up man\nYo yo yo yo yo yo yo-yo here come the cop, man\nStarks come here, come here Sun come here for a minute\nHold up hold up hold up\n[GhK] shit we should stop by the store for some more baking soda\nYO yo yo get your fuckin, that’s made of glass nigga\nGet your big Adidas off my mom’s table man\nWhat the fuck is wrong with you man\n[Mef] Nah nah yo chill man, pass the crystal\nNiggas is greedy man, damn\n[GhK] big ass shits\n[Rae] Yo man you ain't smokin no more weed in here man\nChill man\n\n[Rae] Bobby Steels!\nSomebody go to the store, man. fuck that\nSup kid? the baking soda\n[Mef] Yo!\n[Rae] Let’s cut the pie 5 ways\n[Mef] Hmm…\n[Rae] We came off with 2 mill’s, kid\nNoodles!\n[Mef] Rollie Fingers!\n[Rae] Noodles!\n[Mas] No Doubt, comin through\n[Rae] La costra nostra\n[Mef] Johnny Blaze! Lou Diamonds!\n[Mas] Represent for my peoples\n[Mef] Tony Starks!\n[Rae] Universal frontier\n[Mas] Original bloodclat bad boys\n[Mef] Check it out boy…\n\n[Hook: Method Man]\nWho come to get you, none, they want guns\nI be the first to set off shit, last to run\nWu roll together as one\nI call my brother Son cause he shine like one\n\n[Verse 1: Method Man]\nScriptures hit the body like sawed-off shotties\nLike my hair knotty and my nosepiece snotty\nFuck a nigga hottie, that ho pussy probably\nBurn like the deserts of Mogabi, for real\nAin't nothing fraudulent here, we pioneer\nCommandeer a new frontier, this be the Wu yeah\n36 Chambers of fear, huh you lost it\nInformation leaking out your faucets, hmm\nTime to forfeit your crown and leave the grounds\nThere's a new sheriff in town holding it down\nIt's the two holster, six shot smoker\nWanted dead or alive, bounty on the poster\nWild in the West, a student of my culture\nAnd life is the test, hold up\nLet a nigga catch his breath\nI'm still paying dues and the last one is death\nBack to the essence with that shit you stressing, this rap profession\nNow peep Tical, the son of the Shaolin Isle\nBless my style, criminology pays\nThe last times and days, Johnny fucking Blaze\n\n[Verse 2: Raekwon]\nThis goes for niggas who know\nWu will grow like yayo, lay low\nPlus cooling in Barbados\nRicans be giving me much shit to touch shit\nStay cool Papa, see you with enough shit\nBack at the lab a, crack's bagged up\nYo niggas act up, what blow up their workers if they have to\nSeñoritas, fucking up a storm buying Gods margaritas\nSucking his dick, up in the whip long\nDesigned for rhyme crime nigga jail time jiggas\nThem niggas up in hype Vigors lighting niggas\nSilks Wally wear Figaro chain yeah\nJakes beware of black rap millionaires\nRock Airs, leather goose, bears blowing this year\n1-800-GAMBINO niggas, yeah\n\n[Hook: Method Man (RZA)]\nWu roll together as one (Solid gold shinin'...)\nI call my brother Son cause he shine like one (Solid gold)\n(Nigga, son, yo)\n\n[Verse 3: RZA]\nSolid gold crown is shining, we're blinding like some diamonds\nI'm reclining in the sky on a cloud with silver lining\nDouble breasted, bullet proof vested, well protected\nThe heart, the rib cage, the chest and solar plexus\nCasting stones, cracking two-hundred and six bones\nAnd watch your ass get blown to a sea of fire and brimstone\nHow dare you approach it with them poems\nThe overfiend like noah bean green souls with a soldier mean\nThe grand exquisite imperial wizard or is it\nThe RZArector come to pay your ass a visit?\nLocal bio-chemical, universal giant, the black general\nLicking shots at Davy Crockett on the bicentennial\nHappy Millennium two thousand\nMicrochips, two shots of penicillin goes up your Adrenalin\nSon it's time for bouting\nIt's a model you're resembling the niggas who like following\nTrapped inside your projects like a genie inside the bottle and...\n\n[Verse 4: Masta Killa]\nGod stepping forth upon holy ground of the track\nIt's the sound that surrounds and hurts me like I'm under attack\nSo I decided to bite down on the mic\nSo the pain of the track won't deny the fact that I'm the master\nFor what lurks, is an expert that hurts\nThe individual who tries to visualize under\nCause I strike, like thunder\nNiggas couldn't stand my heat, it's unbearable\nMy wisdom fucks up your respiratorial\nSystems are fractured by the killer tactics\nStyle is ragged and thoughts are mad jagged\nEnter the entity, my vicinity\nIs three hundred and sixty degrees of humidity\nRepresent the school of hard knocks and Glocks my\nClan is hostile and got mad moss for blocks so\nFeel the force of impact from the iron side of\nThe gat as I attack the track\nFrom the blind side of the pack, Starks pass the chrome\nWatch a nigga get blown out his motherfucking dome-piece\nDeceased, laid to rest\n\n[Hook: Method Man]\nWho come to get you, none, they want guns\nI be the first to set off shit, last to run\nWu roll together as one\nI call my brother Son cause he shine like one\n\n[Verse 5: Ghostface Killah]\nYo, aiyyo I got this under my wing, move give me room\nHolding up your saloon, clean sweep, like a broom\nFull moons make me howl like a wolf out of breath\nSold only new vocal cords you heard Genius on Gef\nSo step back, to the lab at, high velocity\nMy team make hand-to-hand sales, we're like a pharmacy\nFuck Geraldo, Pablo's plan bro is Bravo\nGoodfellas we know, best sellers become novels\nThe man rocking head bands, silk scarves and jams\nEarly 80s British Walkers, playboys, mocks and shams\nThe laser beam vocalist does well at symphonies\nBad days, watch me snatch ice right outta Tiffany's\nRemember them kids that came off with eight million\nRobbed the Brinks and I labelled in royal pavilions\nThem flour heads must have been stupid\nTell me how the fuck black niggas get caught with all that loot kid\nThere's jet money, underground money\nSubmarines and rings, too bad you fucked up, dummies", "image": "https://images.genius.com/e336a632db4d1dd7b6d848646b5d5ffc.876x876x1.jpg"}], "artist": "Raekwon"}