{"songs": [{"title": "Strangeulation IV", "album": "Strangeulation", "year": "2014-05-05", "lyrics": "[Verse 1: Rittz]\nI am, too hot to cool off\nBlew Atlanta up like Eric Rudolph, and starving in pursuit of moolah\nFloss and get your crew robbed, my crew'll shoot at you like \"hoorah\"\nI be on tour and shit, you get on stage and you get boo'd off\nYou throwing jabs at me but we ain't in no boxing gym\nI'll stab you and have you inside of a hospital hooked up to oxygen\nSo who the hottest? Conversation my name get brought up in\nI'm Woody Harrelson, this industry is Zombieland\nYou wanna fuck with us, you must've had no common sense\nI'll kill you then your guts get eaten up by Brotha Lynch\nIt's Strange Music so the competition nonexistent\nAll them other record labels fallin' off like rotten limbs\nI'm making some money, it's making their stomach cringe\nI'll never forget it, a couple of summers ago, I was cooking and scrubbing pans\nDrink 'till I get drunk and spin\nPuffing something with a lovely scent behind the Cutlass tint\nFloating in the Strange stream, who jumpin' in?\n\n[Verse 2: Prozak]\nMy brain is full of thoughts that are darker than Samhain\nThat span across the Great Lakes and vast Midwest Plains\nSpreading coast to coast like a virus you can't contain\nNow a global pandemic, panic courtesy of (STRANGE!)\nThe biggest independent label, pop the champagne\nWe don't need no head now, homie you can keep the change\nComing through your speakers, receive us into your blood vein\nWe the truth like Nostradamus' prophecy quatrains\nSnake Bat, Praise that, part of rap since way back\nSince the days of 8 tracks and 808's and adaps\nAnalog cassette decks, steady grinding, what's next?\nStarving artist 'til Trav and Tech cut me that advanced check\nStrange outcast step child, call me Damien\nFive Finger Death Punch straight to the cranium\nFlow so sick, could be enriched with uranium\nExtraterrestrial, lyrics labeled alien\n\n[Verse 3: Big Scoob]\nAppetite destruction, never been no punk shit\nMy voices give me choices, just to spite me I choose dumb shit\nChoppers all around me, I mean lyrical and literal\nSpit it through this microphone and pull up at ya mami's home\nJump out on the dumb shit, speaking through this drum clip\nTearin' flesh, rippin' hips, watch me kill shit\nCypher without the villain, that's appealin' but it's silly though\nAn army without it's general, an octopi no tentacles\nNot trying to be subliminal, nothing I do is minimal\nHeavy hitter, heavy words, push a nigga, pushin' verbs\nSquish my button, you push my nerves, ten toes in the turf\nNot the last or the first, gutta nigga, stomp the Earth\nGrippin' metal, I ain't special, on the level\nSmack your temple with the barrel, not complying, I'm a rebel\nAnd I'm fresh up out the ghetto, puppet master, I'm Geppetto\nTake a minute, you'll get it, nigga, Scoob did it\n\n[Verse 4: Krizz Kaliko]\nKali Baby! 'Ight man, I'mma do this! I'm kinda nervous\nThe purpose of having a cypher is so you can sit here\nWide-eyed, listen, look at me in this position\nNow, I coulda just left you sitting there\nBut Nina told me to pick 'em apart, you're a victim of art\nK-R-I to the double crooked, look at him\nHe pudgy like they took a ugly stick and frickin' shook at him\nAnd I don't stay Gucci down to the linens\nI'll let you trick off, she jerking my dick off and grinnin'\nYou can see him, but he just a figment\nYou wanna be him, better get your pigment gone\nTry to beat him with deliverin'\nI get belligerent and that's the end of the song\nAnd I get a little bit ahead of myself, feel like I'mma melt\nAnd I feel like I'm better than everyone else\nI guess I be rappin' ahead of my wealth\nI'm the coldest thing since the ice cube\nOnly thing missing from this beat back in the day was Ice Cube\nYeah, I said I'm the best in a minute, nigga what?!\nOnly niggas that could contest it is rested, dig em up!\nOkay! Hahahaha! Whatever, nigga...", "image": "https://images.genius.com/a97c6b9421fc6142eef43b7f37277096.500x501x1.jpg"}], "artist": "Tech N9ne"}