{"songs": [{"title": "When I Get You Home (A.I.O.U.)", "album": "The Day After", "year": "2005-10-04", "lyrics": "[Intro/Interlude: Pharrell]\nWhen I get you home (home) {*3X*}\nWhen I get you home\nWhen I get you home (home) {*3X*}\nI'm gonna... HIT IT!\n\n[Hook: Jamie Foxx]\nYou keep on talking all that shit\nUp on your two-way and your phone\nGirl, but when I get you home (hit it, hit it)\nYou and I alone (hit it, hit it)\nIn the house it's (A, A), the bed it's (I, I)\nBathroom it's (O, O), in the kitchen it's (U, U)\nWhen I get home\nYou and I alone... Hey!\n\n[Twista]\nNow come and tell me where you get that from\nNow Twista be out here messin' with all the ladies\nAsk me what I wanna hit that for\nCause you sexy and I'm a baller baby\nAsk me why I got a nasty mouth\nYou the one that's steady trippin' with the sassy mouth\nBut when I get you up in the apartment that's when we get to sparkin'\nAnd that's when we let the passion out\nLike the way you walk in slow in the room and smelling sweet as a rose\nAn looking good in that red thong\nLookin' thick as hell do it to me well\nGot me sprung and I know I got your head gone\nEven slow or faster girl\nWhen I'm gone how you trip is a disaster girl\nWhen I'm steppin' to the tunes of Neptunes you wanna bring drama\nAnd that's when I gotta ask you girl, why?\n\n[Hook]\n\n[Twista]\nWhen you was 'sleep last night\nAfter rubbing you down and making passionate love\nI put on a pair of Air Force Ones\n6 figures of jewellery and met my guys at the club\nPulled up out front, yeah we had to stunt\nHomey was sittin' on 26s\nWe about to do the dummy finna blow a little money\nSteady gettin' scummy with these bitches\nThat's about when you started to call\nThen my whole mutherfuckin' high started to fall\nCause you started trippin' on me when you was in the crib 'sleep\nBut you don't even need to get started at all\nYou know I'm in the VIP lookin' at all this ass\nAnd I finna leave I finna cut you as soon as I'm out\nBut you steady yada yada with the motherfuckin drama\nGirl shut up what the fuck is you talkin' about?\n\n[Hook]\n\n[Pharrell]\nHey, hey, hey, hey\nGirl don't you worry about me fallin' asleep, girl it's early\nI kiss you up from your head to feet, don't you worry\nMy appetite is nothin' sweet, and nothin' could curb me\nI grab you like we don't have all night, even though it's early\n\n[Twista]\nTrippin' on me when I go to the mall\nTrippin' on me when I go to club\nTrippin' on me when I kick it with my boys\nYou be trippin' on me when I'm on the tour bus\nYou don't trip when I get you gone\nYou don't trip when I get you chrome\nYou be trippin' when I'm away from you\nBut I bet you don't trip when I get you home\n\n[Interlude] + [Hook]\n\n[Outro]\nA-A, I-I, O-O, U-U", "image": "https://images.genius.com/6e50ebd81ceeb1860beb446ab2cdec8e.1000x1000x1.jpg"}], "artist": "Twista"}