{"songs": [{"title": "Beef", "album": "Death is Certain", "year": "2004-02-24", "lyrics": "[Verse 1]\nHa ha ha ha ha, check out this bizarre mixture\n5'9\", 6 July, and Asar hits'll\nLeave the side of your car door with more\nSmokin' more holes than the Swiss cheese\nBitch please, I'm postponin' yo' homies\nOlder moments like I stole his future\nHoes know me, I'm no phony\nFemales'll tell you, \"Yeah he cute, but he sure'll shoot ya\"\nMy heart bleeds the blood of felonies\nThe blood of Superman, the blood that I've never seen\nYou seem like the shook type\nYou ain't a thug so I wanna see what your brains and your blood look like\nFuck is you sick? 'Pac should be pissed\n'Cause fifty percent of them niggas suckin' his dick his bitch\nI'm against all this name-callin' shit\nNegro please, listen to Chris Wallace bitch\n\n[Hook]\nWhat's beef? Beef is when these rappers be believin' they rhymes\nAnd a nigga like me just take it one day at a time\nBeef is when you die because of your CD\nWhen I come from your blindside before you see me\nBeef is when I get jumped by niggas\nAnd come back and kill 'em one by one\nBeef is the reaper, patiently pacin' outside of your pretty house\nToday you figured out what's beef\n\n[Verse 2]\nYeah\nGangsta, ain't this?\nStarvin' artist that comes with the guns he paint with\nAll you sorry street rejects\nY'all about to go up in smoke, seats ejectin' (boom)\nHouses come down, drastic murders is happenin'\nMake a nigga momma mouth come down\nThe precinct's heated, the cops is mad\nBecause they know who shot yo' ass\nAnd they know who can beat it\nAbove the law, run up on y'all\nSo quickly and show you what only you and a slug saw\nThe silence is screwed in front of the .9 Ruger\nQuietly shootin' what'll hush y'all\nI will leave you lying down in a street\nEverything around you will be dyin' down but the beef\nPlease believe - my guns'll take you punks\nTo your maker from my freezin' sleeve\n\n[Hook]\nWhat's beef? Beef is when these rappers be believin' they rhymes\nAnd a nigga like me just take it one day at a time\nBeef is when you die because of your CD\nWhen I come from your blindside before you see me\nBeef is when I get jumped by niggas\nAnd come back and kill 'em one by one\nBeef is the reaper, patiently pacin' outside of your pretty house\nToday you figured out what's beef\nBeef is when these rappers be believin' they rhymes\nAnd a nigga like me just take it one day at a time\nBeef is when you die because of your CD\nWhen I come from your blindside before you see me\nBeef is when I get jumped by niggas\nAnd come back and kill 'em one by one\nBeef is the reaper, patiently pacin' outside of your pretty house\nToday you figured out what's beef", "image": "https://images.genius.com/2e15d971471dc5a14cf09f1d638b3456.1000x1000x1.jpg"}], "artist": "Royce da 5'9'’"}