{"songs": [{"title": "Dogged Out", "album": "The Trials & Tribulations of Russell Jones", "year": "2002-03-19", "lyrics": "[Intro: Too $hort (Ol' Dirty Bastard)]\nBitch you knew I was a dog when you met me\nHow you gonna get mad at me now?\nCause I got bitches.. everywhere\nBitch I'm a player, y'know\n(Y'know, killa, y'know'I'msayin'\nI said shit, I said, that's dat monster dog shit, y'know'I'msayin'\nThis is all dedicated to all you hoes)\nAnd bitches\n\n[Verse 1: Ol' Dirty Bastard]\nShame on a nuh, who tried to step TUH\nThe Ol' Dirty Bas, put my foot up your UHH\nBitch, you walk around with your bra too tight (beitch)\nIt's alright, you still gon' get fucked tonight\nHoeeeeee! (bitch fucky) Stinkin ass ho!\nYou're the type of bitch don't appreciate shit\nNever had shit, so you won't be shit\nThat pussy there, couldn't satisfy a hair\nOn my body, treat me like a lolli and slob me doooooown (beitch)\nAnd Doo Doo Brown! (beitch) Hehahahaha\nTossed salad, oh you in some shit now\nCallin' me a dog, well leave a dog alone\nCause nothin' can stop me from buryin' my bones\nIn the backyard, of someone else's house\nOl' Dirt Dog, but I'm not dogged out\nHere comes Rover, sniffin' at your ass\nPardon me bitch, as I shit on your grass\nThat means ho, you been shit-ted on!\nI'm not the first dog that's shitted on your lawn\n\n[Hook: Ol' Dirty Bastard]\nCallin' me a dog, well leave a dog alone\nCause nothin' can stop me from buryin' my bones\nIn the backyard, of someone else's house\nOl' Dirt Dog, but I'm not dogged out\nCallin' me a dog, well leave a dog alone\nCause nothin' can stop me from buryin' my bones\nIn the backyard, of someone else's house\nOl' Dirt Dog, but I'm not dogged out\n\n[Verse 2: Big Syke]\nRight behind my pitbull, full grown\nThat wanna make the cat moan all night long\nPuppy don't take me wrong, but it's on\nBe monkeys up, so call me king kong\nGet gone with the thong, crew comin' through\nBig Syke daddy with the Brooklyn Zu\nYou know what to do, freaky sucky sucky\nWon't you show the crew how you play wit' the monkey\nLet him see you don't fake it, and you can take it\nIt's only the bigger bone, gotta make it\nBaby shake it in the worst way, OK\nUp in you in the parle\nMy forte is a freakyness, look at this\nI don't kiss anythin' that I don't miss, runnin' sense\nTo get licked from the nuts to the crack of my butt\nI'm a dog, so what, but you still give it up, Wu/woof\n\n[Hook]\nCallin' me a dog, well leave a dog alone\nCause nothin' can stop me from buryin' my bones\nIn the backyard, of someone else's house\nOl' Dirt Dog, but I'm not dog out\nCallin' me a dog, well leave a dogged alone\nCause nothin' can stop me from buryin' my bones\nIn the backyard, of someone else's house\nOl' Dirt Dog, but I'm not dogged out\n\n[Verse 3: Too $hort]\nBeitch, this is what I tell these hoes\nDon't sweat it baby, you'll never be my lady\nTake this bone, straight to the dome\nAnd get on (get on), cause I don't wanna talk\nShut the fuck up if you done wanna walk\nWe on the same page? I thought so\nYou know them big dogs hit you wit' their paw ho\nBig pimp (pimpin') jump the fence\nHoppin' all night it don't make no sense (na na)\nFrom New York to Cali', whylin' (wild)\nI got the bitch in the alley howlin' (beitch)\nAnd she don't wanna go nowhere\nShe got love for a player she don't know no better\nThat's why I tell her (tell her)\nI'd be wid you forever if I could find time to put you\nIn my schedule (beitch)\nBeitch, $hort Dog in the house\n\n[Hook]\nCallin' me a dog, well leave a dog alone\nCause nothin' can stop me from buryin' my bones\nIn the backyard, of someone else's house\nOl' Dirt Dog, but I'm not dogged out\nCallin' me a dog, well leave a dog alone\nCause nothin' can stop me from buryin' my bones\nIn the backyard, of someone else's house\nOl' Dirt Dog, but I'm not dogged out\n\n[Verse 4: Ol' Dirty Bastard]\nShe flew in like calm breeze\nTall brown skin, her weave like palm trees\nI went coconuts\nDipped my dunkin' between your Donut\nDon't want it if it ain't no slut, bitch!\nFathership touch ground, like fly on soup\nDon't invite me I tear the fuck down\nWhite boys cut my toupee!\nSeventh day raster, or scream play\nI slump MC slay, it ain't nuttin' to bust ass\nBullet him, get him fast\nBitch I don't break out, blast to the next rash\nThe dog piss on MC's like trees\nGot meals but still grill that old good welfare cheese\n\n[Hook]\nCallin' me a dog, well leave a dog alone\nCause nothin' can stop me from buryin' my bones\nIn the backyard, of someone else's house\nOl' Dirt Dog, but I'm not dogged out\nCallin' me a dog, well leave a dog alone\nCause nothin' can stop me from buryin' my bones\nIn the backyard, of someone else's house\nOl' Dirt Dog, but I'm not dogged out", "image": "https://images.genius.com/8aae5961ee3d6894e7d2abaab7f8fc11.772x768x1.jpg"}], "artist": "Ol’ Dirty Bastard"}