{"songs": [{"title": "Pinocchio Story (Freestyle Style Live At Hollywood Bowl)", "album": null, "year": "2015-09-26", "lyrics": "Wise man say, wise man say\nWise man say\nDo you think I sacrificed, real life\nFor all the fame, and flashing lights\nDo you think I sacrificed, a real life\nFor all the fame, and flashing lights\nThere is no Gucci I can buy\nThere is no Louis Vuitton to put on\nThere is no Y.S.L. that they could sell\nAnd take my mind, out of this jail\nAnd my heart, out of this hell\nThere are no clothes that I could buy\nThat could turn, back in time\nThere is no vacation spot I could fly\nThat could bring back, a piece of real life\nReal life, I ask you tonight\nWhat does it feel like, What does it feel like\nI ask you tonight, What does it feel like\nTo live a real life\nI just wanna be a real boy\nPinocchio's story goes, to be a real boy\nPinocchio's story goes, to be a real boy\nI just wanna be a real boy\nThe funny thing is\nPinocchio, lied, and that's what kept him from it\nI tell the truth, and I keep running\nIt's like I'm looking out there, tryna find something\nI looked on the TV, and I see me, and see nothing\nSo what does it feel like, to live real life, to be real\nNot some facade that no one can really feel\nDo you really have the stamina?\nFor everybody that sees you that say, \"Wait a second, where's my camera?\"\nFor everybody that sees you to say, \"Can you sign an autograph?\"\nFor everybody that sees you crying, say \"you oughta laugh\nYou oughta laugh!?\"\nThere is no Gucci I can buy\nThere is no Louis Vuitton to put on\nThere is no vacation spot I could fly\nThat could bring back, a piece of real life\nReal life, Real life\nReal life, Real life\n\nNigga don't miss, better not miss\nBetter not miss... Better not miss\nBetter not miss...(Just pianos)\nBetter not miss, better not miss, better not miss...\n(Just pianos)\n\n[Freestyle:]\nDon't miss, don't miss...\nThe camera's on, you gotta do it like, this...\nAnd move your other leg like, this...\nAnd uh, don't get nobody pissed\nAYE NIGGA, AYE NIGGA DON'T MISS!\nEveryday's the super bowl...\nYou better not miss!\nEveryday is the playoffs, or the championship, (aye)\nNIGGA DON'T MISS!\nBecause uh\nIf you miss one step we gon', we gon' treat you like this...\nWe gon' talk shit about you like this\nWe gon' beat you up like this\nWe gon' say that people don't like you\nWe gon' try to make the whole world hate you...\nDon't tell, don't never say what everybody else is thinking...\nNigga, nigga don't miss...\nWalk perfectly, in this town...\n\nAnd I feel down again, when I'm down again...\nAnd I'm down again...\n\nCan you imagine how many times they told me\nThat I would never work in this town again?\nIn this town again...\nAnd I felt down again, and I felt down again...\nAnd I felt down again...(Do you get it?)\nCan you imagine how many times they told me\nI'd never work in this town again\nBut now, 2 nights at the Hollywood Bowl, sold out!\nAYE, Don't let 'em bring you down, don't let 'em bring you down, down...\nIt's more ways than they way to do it\nAnd I'm here to prove it...\nI'm here to prove it, I'm here to prove it...\nI'm here to prove it...\nNigga don't miss, nigga don't miss\nWalk like this, do it like this\nDon't get nobody pissed\nWalk like this, or we gon' beat you, (aye, aye, aye, aye...)\nAnd they told me, told me...\nFor 6 years that ain't nobody love me\nAnd they told me, they told me...\nYou better not show your face in public boy\nThey told me\nBetter stand still Emmett Till, better stand still Emmett Till\nThey told me, they told me, they told me...\n(they told me, they told me, they told me, they told me...)\nLike Pinocchio, they must have lied\nCause I feel so much love tonight!\nThey must have lied, 'cause I feel so much love tonight!\nOh, they must have lied, 'cause I feel so much love tonight!\nThey must have lied, 'cause I feel so much love tonight!\nThey must have lied, lied...\n\n[Outro:]", "image": "https://images.genius.com/70c6e506a91f6dabdd23cad304812ce3.533x533x1.jpg"}], "artist": "Kanye West"}