{"songs": [{"title": "Vegas", "album": "SHADYXV", "year": "2014-11-24", "lyrics": "[Chainsaw revving]\nHa-ha-ha-ha-ha-ha-ha-ha\n\n[Verse 1: Eminem]\nGot a shit-eating grin\nBitch, show me them itty-bitty titties again\nWe're in Sin City, since when did we begin to get dignity?\nNo diggity, bitch, you need to run and go get your figgity-friends\nI'm lookin' at your bum-stiggity-bum, hun\nThe miggity mack's biggity back, don't act wiggity-wack\nYou can get the figgity-finger: the middle\nYou little dizzy bitch, sit and spiggaty-spin\nGot a 6 o'clock cravin', stop, get Cîroc\nIt's 'bout to be an unbelievable night\nI'll call it surreal, Sir Mix-a-Lot tape in\nHit the spot, spot my next victim\nI'm picky like I missed a spot shavin'\nCame to sip vodka, shit, yeah, that little chick is hot\nBut if she got rabies I wouldn't give the bitch a shot\nI'd poke her in the rear, but I bet if I lick her, she'll try to chase me\n(Ha ha!) What are you: pit, rott, mixed?\nOh, you just got fixed, well shit, then let's lip-lock\nIf not, then trick, piss off, you snobby little pig snot nose\nYou think you're hot shit 'cause you're in heat\nWell, bitch, if you're solar, then I'm your polar opposite, dog\n'Cause I'm colder than popsicle sticks, poppin' shit\nTalkin' it, walkin' it, spit boxin'\nMy sick thoughts are 'bout to lick shots, like the shit's sobbin'\nAnd drip-droppin' in chocolatey whip-toppin'\nSo whether you're hip-hop, Slipknot, B.I.G., Pac\nKid Rock, Kris Kross, Rick Ross\nYou'll dig this; if not, then kick rocks in flip flops!\nAnd I produced the track\nSo you don't have to ask who it is when this shit knocks (Turn up!)\nSo crank the volume 'til it's bangin' and I'ma keep on sayin'\nAll the shit I should be hung for and probably killed for sayin'\nAnd I probably will, but not until the day I pop a pill again\nLike Joplin 'til I drop, and still\nIf that don’t do the job of killin' Shady, then the karma will\nThey sayin' I must bring it as Mohammad\nUntil the Parkinson's done ate away my brain\nAnd made me Robin Williams crazy\nOr I end up with dementia, but you rockin' with a sadist\nHate to say this, but if the thought is entertainin'\nI ain't stoppin' til we explain it\nOh my god, for real, man, not again, I'm shakin'\nBut before I tie a rope around this nob\nIf they don't like it, got a knob that they can slob on until it's—\nWait, I just forgot what I was thinkin'…\nWhat's it called again? I'm blankin'\nThe thing above the balls between my legs\nAnd I think that I can feel it dangling, it's throbbing and it's veiny\nWait, I think that I got it, okay\nBitch, I got you, Robin Williams hangin'\nBitch, don't hang in the lobby unless you came to slob me\nCome on, kemosabe, it's past time like your favorite hobby\n'Cause of the way that I spit she remains on my dick\nThen she grab me by the nuts\nAnd try to take my sausage as a hostage\nAin't it obvious? Pretty much a no-brainer\nOr should I say Cobainer?\nThat she's plain addicted to my dick like Lorena Bobbitt\nGotta weiner off it, wean her off it\nLike she took my fucking penis, chopped it\nAnd stuck it up between her armpit\nAnd she begun to swing a karambit knife and paint the carpet\nAt least that's what her train of thought is\n'Cause I came, saw, conquered it\nHit it, quit it, and made her plain b-bonkers\nAnd I always end up giving these bitches a complex\nAnd I don't mean apartment\nSo spread your feet apart\nAnd let me see you do some yoga stretches, splits\nNow grab this Cuisinart\nAnd make me breakfast, bitch, that's a prerequisite\nAnd that's just to get in this bedroom, bitch\nWalked up to that Ke$ha chick (what up?)\nSaid my name is Booger, wanna catch a flick?\nI'll even let you pick, make her fetch a stick\nBet you if you give this old dog these new tricks\nTo get familiar with I learned extra quick\nKick a pregnant bitch, oops, I guess the shit\nTook an unexpected twist like the neck of the freaking exorcist\nCha-cha-cha\nBitch, I said that this mask ain't for hockey\nHate Versace, Versace, I got Münchhausen by proxy\nI'm making you sick, don't pretend you can't hear me\nYou deaf, girl, I said you was foxy\nI'll tell a bitch like Bizarre\nBitch, shut the fuck up and get in my car!\nAnd suck my fucking dick while I take a shit\nAnd I think with my dick, so come blow my mind\nAnd it tastes like humble pie, so swallow my pride\nYou're lucky just to follow my ride\nIf I let you run alongside the Humvee\nUnless you're Nicki, grab you by the wrist, let's ski\nSo what's it gon' be? Put that shit away, Iggy\nYou gon' blow that rape whistle or me?\n(Squee!) I love it, love it, love it\n'Fore I get lost we're gettin' off\nLike this is our exit, now let's hit the highway\nAnd try not to get lost 'til we get to Las Vegas\n\n[Bridge: Eminem]\n(Party, do it 'til tomorrow)\nVegas\n'Til we get to Las Vegas\n(Party, do it 'til tomorrow)\nVegas\n'Till we get to Las Vegas\n(Party, do it 'til tomorrow)\nVegas\n'Til we get to Las Vegas\n(Party, do it 'til tomorrow)\nVegas\n\n[Chorus: Eminem]\nWhatever happens here, stays here\nSo let's go all the way dear\n'Til we get to Las Vegas\n\n[Verse 2: Royce da 5'9]\nWhatever happens in my room, it stays in my room\nLike movie night like cable\nTreat every women in my stable like flavors\nLick her like she kryptonite and I get weak after like 7 days\nAnd 7 nights in the Days Inn, it's Hot Vegas\nWe roll in circles and packs, we the lifesavers\nShe got a boyfriend, I got a toy then\nI'll bring it with me when I show up to her crib wavin'\nAnd I ain't tryna meet a nice neighbor\nI'm so Jay Electronic, I'm cut like I'm all out of razors\nAnd all I got is a gun left with a bayonet on it\nNeck so frozen it look like I walked in a jewelry store\nWith about a million dollars with your mama\nAnd sat down and did an ALS challenge\nHaaaan! I stole that adlib from French\nBad & Evil back at it again\nAbout to get my back tatted again\nAbout to get a pic of a backstabber with an axe in his hand\nSittin' on a bike in the sand\nIf you ain't been through nothin'\nThen that shouldn't mean nothin' to you like likes on the 'Gram\nIf she current, I keep her pussy purrin' like the pipes on a Lamb\nWeed got her so chinky-eyed\nLook like she been gettin' high on a flight to Japan\nI keep my jewelry on while I'm fuckin'\nSound like I'm shakin' up dice in a can\nListen, though this ain't Christmas\nI make you my ex miss if this is my passion\nI learn to give those who don't appreciate my presence\nThe gift of my absence\nI don't know who you been listenin' to\nGot me fucked up like Pookie in the chicken coop\nBitch, I don't give a two shits\n(Bitch, get the fuck out of my face!)\nTo make a long story short, I don't really gotta stand there\nAnd listen to you while you throw a silly tantrum\nEven though I have an affinity for a witty banter\nStartin' to feel like foulplay like Billy Laimbeer\nHold up, she misunderstood me, I said say, por favor\nThought I said the Wraith had four doors\nI knock a nigga face off\nGive him the bottom of the 9 like a baseball scoreboard (whatever)\nI leave the club with my tab still open\nWon't even get a cab for you and yo' friend\nThe only fear I have is of loathin'\nAnd I won't even kick in 'til we get to Las Vegas\n\n[Bridge: Eminem]\n(Party, do it 'til tomorrow)\nVegas\n'Til we get to Las Vegas\n(Party, do it 'til tomorrow)\nVegas\n'Till we get to Las Vegas\n(Party, do it 'til tomorrow)\nVegas\n'Til we get to Las Vegas\n(Party, do it 'til tomorrow)\nVegas\n\n[Chorus: Eminem]\nWhatever happens here, stays here\nSo let's go all the way dear\n'Til we get to Las Vegas", "image": "https://images.genius.com/acc348ccdf6bd18c7aee7ae7c6c3d865.1000x1000x1.png"}], "artist": "Bad Meets Evil"}