{"songs": [{"title": "Missing Watch", "album": "The Lex Diamond Story", "year": "2003-12-16", "lyrics": "[Intro: Raekwon (Polite)]\nOh shit! Fuck is my watch at?\nShit... what the fuck?\nNah man, nah man, hell nah\nThese bitches is frontin\nThe fuck the shit go?\nThem drug gangstas\nYo son, you got my shit?\n(Nah, son, I ain't got ya shit)\nSon you ain't got my shit?\n(Nah, nigga, I ain't got ya shit)\nYo, son, my shit is gone\n(Pah listen, I ain't got ya shit\nLex you sure you ain't leave it in the..)\n\n[Raekwon]\nI started buggin out, fell in the zone, half the bone lit\nPassed off, rubbin on my ski hat - oh shit!\nMy blunt fell, my watch, you seen it?\nGleamin little young fella, he just had the stupidest look, weeded\nYo, I'm tired and stressed, hungry and I'm vexed\nAnd I'm flippin cause these niggas wanna play me for test\nShit fell off ya hand Lord? Stop it, I'm eyein niggas in they faces\nAfter that I'm goin at niggas pockets\nThe watch, faggot yeah, y'all niggas got my shit\n\"Yo Lex we family, I helped you cop yo' shit\"\nThen help me find my shit!\nEye-ballin every fake Frankie Lymon in the joint\nBreak out, find my shit!\nYeah, yo now I got robbed, I smell it\nMad bitches walkin' by the fella tryin' to crochet, bitch spell it!\nListen trick, be out, bounce\nBlew an ounce off of weed in the bitch face, she pulled out two white owls\n\"Everybody back the fuck up, move!\nChef, you actin' like a loose cannon, Pah, with you and your dudes\"\nIf my shit come up, cool\nMatter of fact, clack-clack-clack-clack, niggas pulled out tools\n\n[Hook: Polite]\nYo yo yo yo turn the fuckin' lights off\nPass the illumin' Lord, tell the DJ turn the fuckin' music off\nWe got announcements, we want y'all to listen clear\nWe just lose about mansion in here\nAnd yo eh yo if we don't get it back it's gon' be a problem\nThen my niggas gon' react and that'll be a problem\nEighty-five thou' gone we got a fuckin' problem\nAin't nobody leavin' alive until we find 'em\n\n[Ghostface Killah]\nExcuse me, Miss, no I ain't havin' it\nI smacked him with the four pound, bitch hit the ground\nThen I stepped off, dry mouth and shit\nEquipped with the dipped courdouroy Bailey's with the cream stitch\nPowerhouse biscuits that blow roofs off\nRae watch is missin', you take ya boots off\nAnd take off those chaaaaaiiiiiiinnnns\nThe fat fuck thought I was playin' so I started sprayin\nChicks hit the floor, bottles broke\nThe owner slid through beefin', duke threw the toast to his throat\nWe brought the noise like we here to promote\nMy man don't get his shit in four or five minutes yo we're leavin' with the vote\nA gangsta's lotto, thirteen bodies and still climbin\nBig shotties, bodied when they sniff body\nWe did our thing too we got to the Envy lobby\nOur last four or five shots we see nobody\n\n[Hook]\n\n[Polite]\nEh yo shit got real that night\nPower grabbed him, 'Vine smacked him dead in his head\n(Oh shit, nigga he got a magnum!)\nYo we all holdin', rollin\nGrab a nigga, search him if he front, fuck it, blow him!\nWatchin' niggas foldin\nThe bartender got a shotgun in his hand\nLet off, the wheelchair nigga got up and ran\nSurround the Don, full body armor automatically on\nThe faggots passed off the watch and gone\n(yo y'all niggas ain't searchin' shit!)\nYo where the big mouth at? Niggas step up\nMatter of fact nigga, lie the fuck up\nNigga tried to swing on G's but he a gentleman\nSon, he dropped the dead arm but failed to see it\nTwo shot G's pealed his meat {*starts to fade out*}\nLet's see, niggas tried to front like my niggas is weak\nCorey pulled the truck up, C-4ed this bitch, blew it the fuck up!\nNiggas'll use and niggas'll die in this mothafucka! {*explosion*}", "image": "https://images.genius.com/8703b73c19201fea3baccb6c300ec07e.1000x1000x1.jpg"}], "artist": "Raekwon"}