{"songs": [{"title": "Sky Boy", "album": null, "year": null, "lyrics": "[Verse 1]\nI got dreams of gleaming wings and Beamers\nCream so obscene\nAin't gotta clean my sneakers no mo'\nA closet full of Polo\nA pocket full of mo' dough\nI'm knocking in the fo' door\nNever stopping for the popo\nI can't forget to send my momma to the Acapulco\nYou laugh what, can't a nigga dream big\nA swimming pool, big screen, mint-green Benz\nMe and Christina Milian with sixteen kids\nYeah, I joke but a nigga mean biz'\nLemme tell you how it is, nigga\nI got this feeling man, a nigga finna hit the ceiling fan\nFayettevillain killing, fishing for that scrilla, reelin' in\nI'm leaning\nThat mean I'm chilling\nI'm feeling like Gilligan\nNigga what is this a barbecue?\nSo why the fuck you grilling then\n\n[Verse 2]\nIf I'm back in the 'Ville, haters smack in they grills\nLadies like 'em; got that '80s Michael Jackson appeal\nHomie curiosity, all these cats getting killed\nNiggas caps gettin' peeled, for that cash niggas\nWill run up on yo' ass in that mask flash and the steel\nNiggas laugh when they steal\nI just brag cause I'm real\nMotherfucker I'm the shit\nI pass gas when I feel\nShit is trash bag, it's all about the last laugh\nMad I got yo' girl turned over like a bad pass\nShe know I rap, so I ain't even have to bag that\nCash that? Probably not how I design rhymes\nThe dick got 'em singin'\nI could get yo' dime signed\nA Don Juan type armed with a strong pipe\nI even put it on dykes\nI'm smashing like it's Prom Night, bitch\n\n[Verse 3]\nYou niggas must've got your marijuana laced\nI know some magicians make you disappear without a trace\nOut-of-state speedin' through New York with Carolina plates\nI'm the God mother fucker, and how dare y'all try to hate\nYou'll never shine like me, you could wear your hottest Bapes\nI'ma show y'all how to cake\nI can tell your Prada's fake\nI understand you think fly\nBut nigga you ain't got a cape\nI understand you think you gangsta\nNigga you ain't shot a thing\nThem niggas bring it to you point-blank range, ain't gotta aim\nYeah, you see some players shooting, but this shit is not a game\nBadda boom, badda bang\nLot of goons, lot of lames\nOld groupie-ass niggas like the clan\nTryna hang, yeah\nBy the way, since ninety-seven I been nice\nI'm finna get it crackin' like fat niggas on thin ice, wooh", "image": "https://images.genius.com/2cd936e786e1ab454043327d585c7702.1000x1000x1.jpg"}], "artist": "J. Cole"}