{"songs": [{"title": "Gurls Wit Da Boom", "album": "Searching for Jerry Garcia", "year": "2005-08-09", "lyrics": "[Produced by Young RJ]\n\n[Intro]\nYo' collar, pop yo' collar\nPop yo' collar, pop yo' collar\n\n[Hook]\nWe like the girls, the girls that go boom\nI like the girls, the girls that go boom\nThat's all I want so fellas make room\nI want the girl, the girl with the boom\nWe like the girls, the girls that go boom\nI like the girls, the girls that go boom\nThat's all I want so fellas make room\nI want the girl, the girl with the boom\n\n[Verse 1]\nParty and bullshit the night away\nFind a little hole for the hideaway\nLiving every second like a holiday\nThe fun don't stop her nowadays\nEspecially since I hooked up with Dr. Dre\nNow bitches \"Lean Back\" and they rock away\nHella game plus sex, she got the play\n\"BRRING BRRING!\" (Can I suck your cock today?)\nYes you may babe, do lots of things\nWhat good is having a head and not no brains?\nShe asked me if I know 50 and who made \"Tipsy\"\nQuick to get with me, quicker to get busy\nShe dizzy cause the Issey smell good on me\nPlus she love to fuck, I mean the hood won't leave\nHeaded out the door and she pulling on my sleeve\nRubbing on my dick, bitch feeling that E\n\n[Hook]\nWe like the girls, the girls that go boom\nI like the girls, the girls that go boom\nThat's all I want so fellas make room\nI want the girl, the girl with the boom\nWe like the girls, the girls that go boom\nI like the girls, the girls that go boom\nThat's all I want so fellas make room\nI want the girl, the girl with the boom\n\n[Verse 2]\nSipping the Moet Rose mixed with pu-ssy\nPuffin the loosey, our frames by Gucci\nShe wanna roll with me cause I got major dough\nTell every ho up in here, you my favorite though\nI know you suck dick, well that's my accusation\nI'm really wondering if you accepting applications\nI like them facing forward chicks with the bar bellies\nI pass them young hoes off to Mr. R. Kelly\nGimme a bad bitch, that can make her ass shake\nI don't want you nasty, I want you nas-tay\nMy last day on earth I'll be fucking a freak\nThat spend a half an hour just sucking my meat (yeah)\nShe don't even know me, said she love me so\nShe a dimepiece, so far from an ugly ho\nIf you drop-dead gorgeous I won't stand you up\nYeah you shake it like Beyonce but can you fuck?\n\n[Hook]\nWe like the girls, the girls that go boom\nI like the girls, the girls that go boom\nThat's all I want so fellas make room\nI want the girl, the girl with the boom\nWe like the girls, the girls that go boom\nI like the girls, the girls that go boom\nThat's all I want so fellas make room\nI want the girl, the girl with the boom\n\n[Verse 3]\nI been doing the Earl Flynt since about '88\nA lot of people here wanna trade my place\nGot a extra room where your babe can wait\nThese ain't Air Force Ones, these are Bathing Apes\nStraight from the (Shop) got the (Candy) sex\nI'm a (Hot Boy) on beats like Mannie Fresh\nHer lips real big, hips real big\nTits real big, everything's real big\nI'm rich BITCH, and these are real diamonds\nShe ain't even keep up with the cars that I'm driving\nKnow what you like so I'mma give it a twist\nYou hypnotic baby when you swivel them hips\nI'm the game in the physical so listen to this\nNever catch feelings when I'm dissing a bitch\nAin't tipping a trick cause I'mma bone for free\nAll I'm saying right now who going home with me, cause\n\n[Hook]\nWe like the girls, the girls that go boom\nI like the girls, the girls that go boom\nThat's all I want so fellas make room\nI want the girl, the girl with the boom\nWe like the girls, the girls that go boom\nI like the girls, the girls that go boom\nThat's all I want so fellas make room\nI want the girl, the girl with the boom\n\n[Outro]\nPop yo' collar, pop yo' collar\nPop yo' collar, pop yo' collar\nHey that's gonna wrap it up\nLet's hear it for Big Proof, our special guest today\nHey, we gonna get up out of here\nGotta change the name of this town back to where we found it\nWe found it at Motown, that's where we gotta leave it!\nMotown, and like we always say\nSugar is sugar, salt is salt\nIf you didn't get off today, it's not our fault", "image": "https://images.genius.com/ab9a6517cd52ed1370641d9d44571fdd.500x500x1.jpg"}], "artist": "Proof"}