{"songs": [{"title": "ER", "album": "Success Is Certain", "year": "2011-08-09", "lyrics": "[Verse 1: Royce da 5’9”]\nStop, picture me in scrubs in a room with hip-hop\nOperating on it with my instruments\nI'm the doc, it's crunch time\nLine up rappers I don't like and call that shit a punch line\nThese niggas e-beefing, that ain't what wars about\nAin't nothing dying but the game, pull the organs out\nThese niggas dissing like they wondering where Malcolm's at\nTill I split em where they're scalp is at, where my scalpel at?\nI ain't been hearing heart, I'm bout to check his pulse\nWith my stethoscope, pressed against the records tho\nWe ride in, we gonna W-I-N\nI will check a bitch ass like a O-B-G-Y-N\nI'm respected like a killer, a record like thriller!\nI will keep a tab on you like Twitter!\nNow feel the hating grow, Nickel give em oxygen and shock em with\nThat that defibrillator flow!\n\n[Chorus: Royce da 5’9”]\nAs long as I'm alive the game gunna be breathing\nEven though it's, wheezing hit him like like clear clear\nWake his ass up he was sleeping\nI said as long as I'm alive the game gunna be breathing\nEven though it's, wheezing hit him like like clear clear\nWake his ass up he was sleeping\n\n[Verse 2: Kid Vishis]\nI'm alive, they almost killed me but I survived\nHip hop has been revived\nSurprise (Ok doc!) Ow, stop shocking me now\nTell your nurse that she can put this scalpel down\nI'm back ready to rap took a little nap ready to go off\nStick to my pen, never again will I ever dose off\nNo more bozo rap it hurt me\nThe new dojo in beast mode, I'm John Cleese, no mercy!\nMy saliva and spit could fly through a brick\nPut your ass by a light and spit gas at the fire flick\nGave up homie huh? I was worse than the racists and rapists\nNow I', feeling like Kobe 'fore he scored 81\nReally feeling new! missed me with the skinny jeans and uggs\nFuck outta here, I ain't feeling you!\nFucking incredible! I can dig a hole to hell\nJust to beat the devil over the head with a fucking shovel!\n\n[Chorus: Royce da 5’9”]\nAs long as I'm alive the game gunna be breathing\nEven though it's, wheezing hit him like like clear clear\nWake his ass up he was sleeping\nI said as long as I'm alive the game gunna be breathing\nEven though it's, wheezing hit him like like clear clear\nWake his ass up he was sleeping", "image": "https://images.genius.com/7ef2ea2d0242f3b7c5b03da3554a04b1.640x640x1.jpg"}], "artist": "Royce da 5'9'’"}