{"songs": [{"title": "Through the Wire (Remix)", "album": "Kon the Louis Vuitton Don", "year": null, "lyrics": "[Intro]\nThrough the wire\nTo the wall\nAll my rhymes is raw\nAll these beats beats beats beats beats\nAll of 'em coulda been lost\nI always got to floss\nI almost paid the cost\nSo before I go...\n\n[Verse 1]\nEvery sunset feel righter, sunshines feel brighter\nPlease light ya lighter for the producer and the writer\nFeel like God wrote this, I'm just here to quote this\nI don't know if you noticed, them accident pictures is bogus\nDoctor, doctor, would you please say somethin'?\nI know I almost was the final destination\nI musta had a blessin' from Pastor Mason\nCause that trip to L.A. coulda been my last vacation\nAnd, man, I know I can\nDrop a down payment on that Porsche Cayenne\nBut, what, I went along with the plan\nPaid for my own video, directed by my man\nI know God was holdin' my hand\nWouldn't let me go before I went before Def Poetry Jam\nWouldn't let me throw in the towel 'fore I got to throwin' some vowels\n'Bout what we goin' through now\nOut the blue girls got a crush on me like I did beats for Mr. Cheeks\nAnd since the accident, they tellin' me that it's the cheeks\nBut if you look at history, the last rapper that almost died\nSold 6.5 'cept I'm comin' from the Chi\n\n[Hook]\nThrough the wire\nTo the wall\nAll my rhymes is raw\nAll these beats beats beats beats beats\nAll of them coulda been lost\nI always got to floss\nI almost paid the cost\nSo before I go to sleep sleep sleep\nAlways thank the Lord\nFor this mic and my keyboard\nHecky naw that boy is raw\n\n[Verse 2]\nNow even though I ain't wired up\nWe-we-we fired up\nYou ain't seen my concerts lately, they be linin' up\nYou ain't seen my girls lately, they be tryin' to cut\nAnd they heard about my girl so I still chill\nCause Monica Lewinsky already killed Bill\nAnd that girl that was with Kobe tried to go for the kill\nI think he put it in the wrong Holyfield\nCan I take a minute with y'all to be totally real?\nFar as my jaw and all, it ain't totally heal\nIf I would have died, 10/23 of last year\nThat would have threw a monkey wrench in my whole career\nBut me, I took the worst thing, turn it into the best thing\nI'm from the Chi, I guess it's just a Midwest thing\nTimes like this make life interesting\nTimes like this make me count my blessings\nCause you could run around like King of the Chi\nBut God could take that in a blink of a eye\nI remember Cedars-Sinai and all those cryin'\nMama, I'm sorry for almost dyin'\nTell Alwe G and Hip Hop man\nTell Don I'ma John Monopolize the game\nAdd on Benny Medina, we gon' take 'em to the cleaners\nI'm Kanye West, the college dropout slash genius\n\n[Hook]\n\n[Outro]\nNow if the Roc is in the building say, \"Hell yeah!\"\nThrow your diamonds in the air\nIf the Roc is in the building say, \"Hell yeah!\"\nThrow your diamonds in the air\nIf the Roc is in the building say, \"Hell yeah!\"\nThrow your diamonds in the air\nThrow your diamonds in the air\nThrow your diamonds in the air\nNow keep 'em in the air\nYeah yeah yeah yeah\nYeah yeah yeah yeah\nWe outta here\nCollege Dropout", "image": "https://images.genius.com/b7758602aa6883d6e056a8f30703a549.591x591x1.jpg"}], "artist": "Kanye West"}