{"songs": [{"title": "Trust", "album": "Life Is Good", "year": "2012-07-13", "lyrics": "[Intro]\nIt's like a cold story.. repeated over and over\nIn the winters of my mind, yeah\nThis shit be real, man..\nShit's crazy out here..\nYo yo, yo what up y'all?\nThat's my niggas over there, word\n\n[Verse 1]\nIf you scared to take chances, you'll never have the answers\nI could tell the future of a dude how his stance is\nWonder will he shoot then you should study where his hands is\nIs he gon' cock it and pop it? His waistband big\nBut he don't have that thing in him, slangin just ain't in him\nBody language is off, he's soft\nBut soft niggas all a sudden start dumpin', frontin'\n'Cause he feel a way: my niggas say the eyes is a giveaway\nOne look could tell me if you really came to kill me\nBe the quiet nigga lookin' lame with the milli\nWho that over there creepin'? Who homie by the tree?\nBetter safe than sorry, look at p-noid me\nFew machine guns close, we could squeeze all three\nBe a cold day in hell 'fore they creep on me\nIt’s a lesson every premonition\nLot of niggas killed 'cause they wasn't payin' attention, listen\n\n[Chorus]\nI want a bitch I can trust, some niggas I can trust\nAccountants lookin' over my figures I can trust\nA lawyer that's fightin' for my decisions I can trust\nDamn my nigga, trust, I can never get enough\nOr Rugers I can trust, shooters I can trust\nGoons that know how to spot out a Judas I can trust\nAnd if I can't trust you, the fuck is you here for?\nSome of you niggas' true colors becomin' clear more\n\n[Verse 2]\nIt's been so long, can’t remember how we begun this war\nThis is a ever-lasting thunderstorm, 'cause guns went off\nI see your moms, she still speak\nShe don't know I ain't cool with her son no more\nIt’s old shit, see forever we holdin' this grudge\nTakes real men to squash beef, end it with hugs\nWe buried our dead, been years, why should I worry 'bout him?\nConstantly watchin' my back, plus niggas tellin' I dread\nAnother day I put a family in black\nThough I be calm and relaxed\nThough I know somehow it will come back\nEven if I'm in the right, 'cause still a life is a life\nWhat was it worth to see you covered in dirt?\nIt’s quite redundant, whether you the hunter or the hunted\nMothers cry, no statute of limitation on a homicide\nJust tattoos of my niggas' names\nI wonder, will it change? Let's ride…\n\n[Chorus]\nI want a bitch I can trust, some niggas I can trust\nAccountants lookin' over my figures I can trust\nA lawyer that’s fightin' for my decisions I can trust\nDamn my nigga, trust, I can never get enough\nOr Rugers I can trust, shooters I can trust\nGoons that know how to spot out a Judas I can trust\nAnd if I can't trust you, the fuck is you here for?\nSome of you niggas' true colors becomin' clear more\n\n[Verse 3]\nIt's rare I listen to niggas who never been in my position\nA caterpillar can't relate to what an eagle envisions\nFrom the mind of a man who went at it with killers\nSit down, little man, let me school you in hood business\nSeen a lot of niggas blow, lot of dreams folded\nSome wasn't humble, ate too much, got bloated\nAin't too much left to buy, bought it, I'm loaded, I guess\nLear jets, I ask myself: do I need love or success?\nThey say the artist that truly suffers, his stuff is the best\n'Cause his heart bleed on his sleeve: pain, pistols and sex\nRemember spray paintin' the word \"fresh\" and then starin' at it\nOlder folks angry, pointin', swearin' at it\nBuildings I sprayed, nowadays drive the McLaren past it\nSame old man from years ago told me life is short\nSo from infant to geriatric, trust your own judgment\nLive with it and love it\n\n[Chorus]\nI want a bitch I can trust, some niggas I can trust\nAccountants lookin' over my figures I can trust\nA lawyer that's fightin' for my decisions I can trust\nDamn my nigga, trust, I can never get enough\nOr Rugers I can trust, shooters I can trust\nGoons that know how to spot out a Judas I can trust\nAnd if I can't trust you, the fuck is you here for?\nSome of you niggas' true colors becomin' clear more", "image": "https://images.genius.com/d77829b400779c24c98b27bec8d6bfda.800x800x1.jpg"}], "artist": "Nas"}