{"songs": [{"title": "Last Day", "album": "Life After Death", "year": "1997-03-25", "lyrics": "[Chorus: Jadakiss]\nCan I live 'til my last day?\nHittin' honies that be na-sty\nGettin' money in the fast way\nAnd I only care halfway\nBut I still can't let you pass me\n\n[Verse 1: Sheek Louch]\nYo what's beef to you, three niggas with hoodies and bats\nThat ain't shit compared to one small cat with gats\nWhen we came here we cut off all kind circulation\nBreathin', eatin', the whole situation\nWhen we do our shit we do our shit for real\nWhile you take your money for your deal and make your own beats\nCompose your own sheets, that's aight but chill\nI'ma spend that mil and cop only hot shit\nRock top shit you know how The LOX get\nThen you can see me flyin' in the Bentley cockpit\nLOX and B-I, hold our grica down for years\nGang not, but we been had our black tears\nNiggas under the stairs only understand what we got\nUnderground, all above must get shot\nYou couldn't book me Dano, Sheek Luciano put the burners\nTo all y'all, what nigga bring it I'm callin' y'all\n\n[Verse 2: Jadakiss]\nYou already know what it's about when I run up in your house\nPut the gun up in your mouth and get the money out the couch\nHearin' you out is senseless, perhaps for instance\nI give this faggot a french kiss\nBlack gloves, no prints, dark tints\nWord on the street they ain't heard from him since\nYou know about life after kickin' the kid in\nSince me and my mi-dan can flip seven gri-dams\nScri-dam, the flow is forbidden\nEither you ridin' or you dyin' 'cause we swingin' iron\nLOX and Poppa,turning niggas into Jim Hoffa\nWho gon' stop us? Your last joint double copper\nYou gettin' money or your runnin' from the Feds\nAin't nothin' over here but 16 with one in the head\nAnd I solemnly swear\nThat all y'all niggas out there got a problem this year\n\n[Chorus: Jadakiss]\nCan I live 'til my last day?\nHittin' honies that be na-sty\nGettin' money in the fast way\nAnd I only care halfway\nBut I still can't let you pass me\nCan I live 'til my last day?\nHittin' honies that be na-sty\nGettin' money in the fast way\nAnd I only care halfway\nBut I still can't let you pass me\n\n[Verse 3: Styles P]\nBefore you think of keepin' me down, heatin' me down\nThe flow like water get deep and you drown\nWith no soul, many niggas roll with no goal\nEven the small gun got a little black hole\nYour destiny is something you can never figure out\nNiggas is never happy 'til there's blood up in your mouth\nThere's a lot of killers, but who the hell are you to blame\nThere's a lot of dead, how the hell you take the pain?\nLive with it got money you better give with it\nMy man had the thug in him did his bid with it\nGet married to the game but never have a kid with it\nAdvice from the wise, slice the pies\nToo many schemes devised when dreams collide\nTeams provide war for the street to absorb\nYou stashed in the ceiling and you slept on the floor\nOnly a blind thug'll fall in love with a whore\n\n[Break: The Notorious B.I.G.]\nUhh, uhh, uhh\n\n[Verse 4: The Notorious B.I.G.]\nWho the fuck wanna squeeze?\nMy Desert E's make MC's freeze\nYou wakin' up in cold sweats, they just dreams\nYou still apologizin'\nAnalyzin', my size and your size and\nRealizin', a fist fight would be asinine\nYou just pop wines, I must pop nines\nGenuine steel piece, nozzle in your grill piece\nYou're shook up, two bricks, every cook up\nWe can hook up, all I see is the future\nDisrespect, I shoot ya\nBy the way, them bricks get flipped weekly\nSold by soldiers that mix weed with the leak leak\nDie for a dollar, nigga, life ain't sweet\nPlay for keeps, wet shirts with experts on the creep\nOur beef is my fiancé, about to marry it\nIllegal transactions in Farragut with Arabics\nWhy not, they fit twelve up in the bedroom\nImagine what they stash is like, make you a classic like\nMy first LP, beef with me is unhealthy\nFuck around and get an ulcer, loose your pulse or\nCollapsed lung, look how many gats I brung\nFor them homos, still doin' promos\nBreak both your legs you're movin' slow-mo\nGot shine to glow mo'\nNine hundred and ninety six grams, you need four mo'\n\n[Chorus: Jadakiss]\nCan I live 'til my last day?\nHittin' honies that be na-sty\nGettin' money in the fast way\nAnd I only care halfway\nBut I still can't let you pass me\nCan I live 'til my last day?\nHittin' honies that be na-sty\nGettin' money in the fast way\nAnd I only care halfway\nBut I still can't let you pass me\nCan I live 'til my last day?\nHittin' honies that be na-sty\nGettin' money in the fast way\nAnd I only care halfway\nBut I still can't let you pass me", "image": "https://images.genius.com/f4413efc6682e8c2cfa7a01117fc8cd5.1000x1000x1.jpg"}], "artist": "The Notorious B.I.G."}