{"songs": [{"title": "Mad Russian", "album": "Evil Genius", "year": "2018-12-07", "lyrics": "[Intro: Gucci Mane]\nWop\nM-M-M-Murda\n\n[Chorus: Gucci Mane]\nI still fuck her like a mad Russian, she mad crushin'\nAt least she hit the sad button, she mad blushin'\nDiamonds got her head huntin', she head huntin'\nAre you scared? 'Cause you ain't saying nothin', we been fuckin'\n\n[Verse 1: Gucci Mane]\nYeah they lookin' and they been lookin', they been lurkin' (Wop)\nEscortin' down her leg, flirtin', she been flirtin'\nI pull up in a four-seater, one person (One)\nFiji diamond bracelet on, they so thirsty\nBaby got an ass on her, it's so perfect\nShe tryna make me glance at her, and it's workin'\nGucci keep them bands on him, he Mr. Perfect\nNo feeling, no ceiling, he so verted\n\n[Verse 2: Lil Skies]\nAyy, ayy, ayy\nBig bands on me, I'ma throw it on the floor\nRun it up and hit the mall, I spend it at the Gucci store\nShawty know I'm in designer from my head down to my toes\nOh, you say you wanna cuff me? I ain't trustin' in no ho\nWhy you say I do too much when you know you do the most\nIt's a celebration, I might have to make a toast\nI just did it for my city, now they calling me the GOAT\nLooking for the right direction, I ain't have nowhere to go\n\n[Refrain: Lil Skies]\nShe a bad girl, she catching mood swings\nShe wanna stay the night, and drink the D'usse\nShe said, \"I follow you, and do what you say\nThis can be forever boy, master, you're my sensei, ayy\"\n\n[Chorus: Gucci Mane]\nI still fuck her like a mad Russian, she mad crushin'\nAt least she hit the sad button, she mad blushin'\nDiamonds got her head huntin', she head huntin'\nAre you scared? 'Cause you ain't saying nothin', we been fuckin'\n\n[Refrain: Lil Skies]\nShe a bad girl, she catching mood swings\nShe wanna stay the night, and drink the D'usse\nShe said, \"I follow you, and do what you say\nThis can be forever boy, master, you're my sensei, ayy\"\n\n[Outro: Gucci Mane]\nFuck her like a mad Russian\nFuck her like a mad Russian\nFuck her like a mad Russian\nFuck her like a mad Russian", "image": "https://images.genius.com/4f3deff165261badc2f2958b01df3902.1000x1000x1.jpg"}], "artist": "Gucci Mane"}