{"songs": [{"title": "Wanna Play", "album": null, "year": null, "lyrics": "Verse One:\nYo, the Lord is my shepard\nThe sword is my weapon\nReward is a blessin', that comes from the struggle\nShoes been scuffled, blood's been shed, another Mother loses a son\n'cause where I'm from the young chooses a gun\nBefore they choose an education\nBut once dead their ain't no awakenin'\nSo like once said, life ain't for fakin\nYo, you wit' me when I say duct tape 'em?\nFuck waitin'\nGot the truck outside, Benz jeep for navigation\nEverything in position, they'd rather be fuckin' wit' Satan\nWhen I aim I ain't missin', master of assasination'\nI heard he call himself Esco, drive a Lexo\nRocks his hat sideways, showin' off his waves with a chipped tooth\nIs this the truth?\nThis is what we do, sip a brew\nWait around his crib until it turns around two AM\nAs soon as he walks in the door we slay 'em\nYou guys got fat while I was away, so start payin'\n\nChorus - Okay, you wanna play rough?!\n(gun shots) (scratching - a thug changes, and love changes) repeat 3X\nOkay yo, we could play rough!\n\nVerse Two:\nOkay now, drive up to my crib, am I high enough?\nWho these niggas tryin' to hide in their truck\nI ain't order cable, why in the fuck these niggas\nDucked in they seat? are they lookin' for me?\nBut I ain't do shit, could it be that niggas thought\nI slept like B.I.G. and Pac did\nMay they rest in peace, but while I'm alive I pop shit\nP-11 Glock spits 17 shot clips\nPut these niggas in boxes, where they Moms and Pops is\nPull the strap from under the seat\nBack up in the street\nWatch these niggas thats tryin' to watch me, I carefully creep\nTake off my shoes, barefoot nigga poppin' my heat\nEmpty every shell in their direction\nIts you, I should've guessed it!\nSame niggas that I was connected wit', I know sent you\nNow I'm'a take you off here, you dont know what you got into\n\nChorus\n\nVerse Three:\nWalked in his house, smackin' him up, \"what you talkin' about?\" he said\nShut-up nigga! knocked him in his head with chrome\nNever thought I'd be in his home\nWith his wife taped up for my niggas to bone\nFuckin' with me, you should've known\nI'll have 'em write \"stupid nigga\" on your tombstone\nWhat money can do, get you hit for less than a G\nFor threatenin' me\nI'm'a do it myself, take you to Hell, this ones for free\nKillin' you niggas with nothin'\nLeft him dead, engine runnin'\nYou the only I'm makin' sure that gets whats comin'\nLook at your Woman, anal ripped out, its your fault\nThey gang banged your bitch out in your face and you saw it\nBut before I let you have it I'm searchin' your crib\nFor pictures of relatives, addresses to where they live\nShit like that, incase a nigga wanna strike back\nI'll be right up in his ass to blow 'em out with the Mac\nNiggas treat you like Fam, and you on it like that?\nNow you gotta lay flat, gettin' eatin' by rats\nGettin' even's never wrong, its only right to react\nEye for an eye, 'cause the sweetest part is payback\nSomebody kncokin', who dat?\n\"a cop man\", let him in\nAnd give that mothafucka one under the chin\nCan't believe this nigga down with the Feds!\nThe copped screamed out your government before he dropped dead\nDont explain, I put the pound on his head\nBlew 'em! before that I can't remember the last time I said......\nOkay, so we gonna play rough!\n\nChorus", "image": "https://images.genius.com/23061dd2dc7e863127db561906debd27.434x434x1.jpg"}], "artist": "Nas"}