{"songs": [{"title": "Hip Hop Vs. Rap", "album": "D.I.G.I.T.A.L.", "year": "1993-01-01", "lyrics": "You you can't can't be be ripping the mic the mic like do re me me\nMeasles are contagious like my lyrical pages\nRipping and flipping the mic\nFrom back in the back in the days, these days it's kinda hectic, hectic\nWhen these suckers don't respect it, check it\nFlame on, I know the light is bright but keep on watching me\nI'm stolen property, kicking the flavor to society\nPolice be clocking me, but logically they got to be\nCause they were taught that serious poetry would come from Socrates\nBut that ain't it, in 94 I'll kick the hit\nIf I was in front of Shakespeare, I'd battle the punk and take his shit\nI'm not having it\nBust the narrative I come to give, listen\nRap is something you do, Hip Hop is something you live\nThe difference is kids nowadays, they got the video\nRappers don't need skills to build so they don't really know\nHear me yo, I'm four times on Arsenio\nGot ten videos, but does that help me flow? No\nThat's why when I come to the show MC's act like they don't know\nCause they were too young to rock up in the disco\nFrisco Disco, the disc is like a Nabisco\nChocolate chip cookie, don't fuck with me rookie\nI'm rocking beats and with death defying feats\nAnd I'm never squeaking, I'm always freaking when I'm speaking\nInside I'm keeping a statement for police and\nI'm down for peace and but not turn the other cheek and\nSo this DJ, he gets down\nMixing records while they go...\nRound and round, round we go\nTwo years ago a friend of mine\nAnd Flash is gonna rock your mind\nWelcome to the terror dome, the terror dome\nI wonder if I take you home\nE-F-F-E-C-T\nA cool operator operating correctly\nBut back in the days I knew rap would never die\nToo late baby bye bye in a batty boy head, head, head\nInsane in the membrane\nTake the train, take the train\nM-E-T-H-O-D man...\n...Hattan keeps on making it, Brooklyn keeps on taking it\nWe keep coming back with more and more hits\nParty people\nI came through the door, I said it before\nTwo years ago, super ho\nIf my train goes off the track\nPick it up, pick it up, pick it up back, back\nBack to the grill again, the grill again\nFriends\nHow many MC's must get dissed?\nBefore somebody says don't fuck with Kris\nHey! Ho! Keep on moving don't stop no...\n...Body beats the Biz\nLet's do the dance called the Pee Wee Herman\nHey, Erick Sermon, hey\nYou you get off my cloud\nGo down baby, go down baby\nThe gods must be crazy\nYou ain't fresh, you ain't fresh, yeah", "image": "https://images.genius.com/d939bce0d325273abe25cbd9cbdf5405.455x450x1.jpg"}], "artist": "KRS-One"}