{"songs": [{"title": "American Royalty", "album": "Royalty", "year": "2012-07-04", "lyrics": "[Produced by Childish Gambino]\n\n[Intro: RZA]\nDigital, Childish Gambino\nMixtape demonstrations\n\n[Verse 1: RZA]\nThis Oxycontin carbon monox' and toxic concoction\nCollapse your brain cells, they swell from lack of oxygen\nLeave the opposition stuck, without a pot to piss in\nHockin', spitting up blood, shark by sharp precision\nDart incision, darkness imparts your vision\nSparks infliction, (Poof) I'm a mad magician\nVerbal plasma, verbal scatter, words that shatter\nEvery atom in your body, now you're anti-matter\nRipping through the data, checked into the doctor\nTook his rhyme splatter, cause my mind's faster\nYou falling down to ground, while I climb the ladder\nToo much garbage in your gallbladder, fall flatter\nOn your face, now you carry by the pall-bearer\nOr wear the black suit, eyes all teared up\nOh no, when your ho make a boss lit up\nWe in the rib with a smirk nigga, all geared up\nChildish Gambino or Bobby Digi'lino on the tracks\nWe breaking more backs that Sammartino, Bruno\nWe saw more baselines than Juno\nChange more law in New York than Mr. Cuomo\nGodfather novels I write like Mario Puzo\nMaster time fix the clocks like I'm Hugo\nHold the weight like nine sumos\nBust shots like John Lugo\nYou know how the Wu go\n\n[Verse 2: Childish Gambino]\nLook sharp, homie give yourself a facelift\nHigh brow, eyebrows on a spaceship\nTake sips of that Ace of Spades-es\nSaving all my money just to waste on a bracelet\nCan't see them haters, we don't give a fuck though\nCharge it to the game, keep a lame so cutthroat\nNever slip a fast one, the game is so in front of me\nTravel 'round the globe, spend and make 'bout a 100 G's\nPack them crowds up, boss like Bowser\nDeep pocket poetry, my custom trousers\nThank God they found us, the game was starvin'\nI'm clean and concrete, you ass and Charmin\nBobby Digital, do you really think these niggas know shit?\nShopping in Manhattan and I ran into my old chick\nPride is a bitch, I am not a grown up\nTweetin' when I'm 70, these half-dead followers\nShe look like she Spelman, secretly she Hofstra\nPut her in the club, all she wanna hear is Waka\nPut her in the crib, all she wanna hear is Waka\nShe jerk when I move like her old boy popped her\nHome is that Outkast, soul like I'm Phonte\nOld-school J's like Beyoncé's fiancé\nBack on my dumb shit, nigga we the stupidest\nGave them niggas real shit, don't know what to do with it\nI did what I did man, did you really see it though?\n'Bino hard and fast, niggas Sweet'N Low\nAmerican Royalty, family loyalty\nWe cream of the crop why the fuck would we stop?\nShe had two sons: both of 'em good grades\nBoth of 'em rap songs\nWhere did she go wrong?\nNowhere mama, we just go where the money at\nBlack Kennedy, where the fuck you niggas at?", "image": "https://images.genius.com/587833871590a682c8aed1b739f0cb23.906x905x1.jpg"}], "artist": "Childish Gambino"}