{"songs": [{"title": "Sweet Love", "album": "Tical 2000: Judgement Day", "year": "1998-11-10", "lyrics": "[Produced by True Master]\n\n[Intro: Streetlife]\nExcuse me gorgeous..\n\n[Verse 1: Streetlife]\nJust maxing, looking for hoes, y'know, relaxing\nMet this redbone Jasmine, midtown Manhattan\nShot a verb, that tranked her nerves, calm words\nMassaged the mentals, made her pussycat purr\nSweet Love you look miraculous, brown-eyed passionate\nHigh cheek-boned, Tommy Girl cologne you smashing it\nJump in, take a spin, destination Staten\nI have you home by ten, shorty started laughing\nShe replied, \"Street, you ever ride while you drive?\"\nI looked puzzled, and said, \"Nah baby, why?\"\nShe pressed up, grabbed my dick, threw her dress up\nCocked her legs, cold fucked my head up\nNow I'm deep in it, flying past the speed limit\nOut of control, still whipping it, steadily hitting it\nDeep stroking, one hand on the wheel, blunt smoking\nLoving how it feel, sweet Love you got me open, what?\n\n[Verse 2: Cappadonna]\nLove is love, love, love is love, love\nLove is love, love, love is love, love\nWe connected like a train from the first ordeal\nI stepped to her with the passion as I kept things real\nBut like, sex was on my mind like, cum was in my pants\nI flashed my fronts on her, like if I had a chance\nShe said, \"Ain't you Cappadonna from the Wu-Tang Clan?\"\nI said, \"Yeah, mad gear plus the small white band\nSweet Love, I want your pussy can I be your man?\nStripped to the bare essentials let me fuck you if I can\nSweet Love, from your nipples to your pussy nub\"\nSweet Love, love is Love, love is love Love\n\n[Verse 3: Method Man]\nIt's a full moon, we in the bedroom\nThoughts consumed by the passion\nSlow jam tunes and body action\nMy finger's on the clit splashing\nYour pussy lips got you spazzing\nLove juices, marinating in your satins\nSexy ass, I gets 'em like my old dad I love my women bad\nWith just a little touch of class\nYou'se the star by far, look at you ma\nShake your thang-thang girlfriend, you cherchez la femme\nWhattup, went to beat it up, I'm not the one to eat it up\nBut the type to hit it raw dawg and seed it up\nWe talk without sayin nuttin'\nYou told me if I came through you'd gimme som'thin'\nNow we locking ass, pulling hair and talking trash\nHow you like it, slow or fast?\nShe said, \"I like it when it last\"\nNo doubt, you got the best trout there can be\nNot an everyday, average, Chicken of the Sea\nCandidate for H.I.V, you'd rather deal with monogamy\nQueen to be held, Black Mahogany\nYou're 'bout to bust damn it\nSugar walls coming down, now you can't stand it\nYou've been touched\nThat's when I felt the blood rush\nGetting closer and closer with every thrust, take me there\nVolcano's about to erupt, I love you much\nWatch these rap niggas get all up in your guts", "image": "https://images.genius.com/7bb2fc25db22a3900f489969a9537f35.954x951x1.jpg"}], "artist": "Method Man"}