{"songs": [{"title": "Rip", "album": "I Came From Nothing", "year": "2011-06-08", "lyrics": "[Intro]\nThis one's for the beautiful people, all the beautiful people\nShout out to DeAnna, RIP to Bennie man\nWhat the fuck?\nFree Unfunk, free Dulu, free Zukrew\nSwamp tell these folk man, can't do nothin' wit me I promise you\nFree Unfunk, RIP to Bennie man, what's up big bro, I love you nigga\nI'm grown, I'm gettin' money now nigga\nHow you doin' up\nShouts out to all my niggas\nLil Zuk keep goin', know you goin' to the top now\nBig Duck I love you, I love you, I love you\n\n[Verse 1]\nMy brother just got life and ten\nIt got me hatin' all the niggas that got out the pen\nAnd that's a sin but he ain't gettin' out the pen\nSo I don't give a damn, I don't give a damn\nWhat you talkin' bout? I take your lungs out\nAt your mom's house, on your mom's couch\nCause I'm from the south and you're not from the south\nAnd the funeral homes? It's my fun house\nNow I'm killin' myself cause I didn't get help\nI got my mind right and started remakin' myself\nTill I dreamed of gettin' killed, now I'm fakin' myself\nNow I be movin' extra slow, like I'm makin' myself\n\n[Interlude]\n(It's all on me)\nYea, yea, yea, yea, yea\nI love you, RIP to Trey man\nI love my Rock family, no homo\nI love Jonesboro South, no homo\nI love all my fans, no homo\nYea, yea, yea, yea, yea\n\n[Verse 2]\nYour folk and your folk and RIP to Bennie\nSippin' on this mud got me leanin'\nI'm thinking like I'm dreamin'\nSell dope, it's the only way we eatin'\nSo, therefore we keep them fiendin'\nAnd the pots what we keep on steamin'\nAnd RIP to Man and RIP to Tre\nFree my nigga Qua, free Lil T Jay\nDon't worry 'bout what they say, nigga you'll come home one day\nAnd I'm up but my partner got bricks put up for me\nAnd I lost three people in three years\nBut to Big Duck it feels like seconds\nShouts out to 9-11, but I'm a Blood, shouts out to five\nRecord tell me eat you alive\nAnd the Rock crew may eat you alive\nAnd Jones Bridge South may leave you tied, no jive\n\n[Interlude 2]\nRIP to Bennie, free Ripman, free Edgar, Free Unfunk, free Dulu, Free Zukrew\nIf you lost somebody close nigga, you a street nigga, nigga\nI know how it feel, this verse right here for ya'll, ya dig?\n\n[Verse 3]\nLet's go to Pool Creek, RIP Damian Weezy\nJones Bridge south, rest in peace O's and Neezy\nLet's go to Cleveland\nLil Tre and Lil Man, let's go to Four Seasons, Lil Chug and Nana\nLet's hit the west side, Lil Roody and Duke\nBoulevard, McCannons Ville, Cheese and Nunny\nSummerhill back to the north\nLil Nick and Quez, let's go to boulevard ave, free all the feds\nI will leave you dead, put some on your head\nHave your mama scared, have your family scared\nPut yo' ass to bed, and this one bout the dead\nSo I'mma ride this bitch like a bike with pegs\n\n[Outro]\nTo all my niggas dead and gone\nGo back home, got me in the zone all week\nIt's all on me, it's all on me, it's all on me\nGotta keep my head up strong cause life goes on\nDo my mission here it's complete\nIt's all on me, it's all on me, it's all on me", "image": "https://images.genius.com/ac0b77a35fdb3726c0ed9766d648c354.500x500x1.jpg"}], "artist": "Young Thug"}