{"songs": [{"title": "Groundhog Day", "album": "The Marshall Mathers LP2", "year": "2013-11-05", "lyrics": "[Intro]\n\"What is a nightmare?\nThe dictionary tells us it is a terrifying dream, a nightmare.\"\n\n[Verse 1]\nI used to think I had bad luck, but I wasn't superstitious\n'Til one day I grew suspicious\nWhen I stepped on a crack on Aunt Edna's stoop\nAnd got pooped on by a group of stupid pigeons\nThen we flew the coop to Michigan to start anew, but ditchin'\nMissouri for Michigan didn't work\nSo we moved back to Missouri from Michigan\nFrom Missouri back to Michigan\nSomeone, put me out my misery, I can't do this again\nMom, please stick to a decision\nDiscipline, last thing I wanna do is listen\nShe's like Lex Luthor, bitchin’, her rules are Krypton-ite\nSo the walls, I done lost my power to see through them bitches\nBut I run into 'em, runnin' through the kitchen\nPretendin' to be blind Superman, 'cause I had no supervision\nBut I did have a super power though, I could turn into Invisible Kid\nDisappear out of sight like a true magician\nAnd one day Uncle Ronnie brought over this new but different\nMusic into the picture, and it became my new religion\n\n[Interlude]\n\"I remember it clearly, even today.\"\n\n[Verse 2]\nMove back to Michigan again, to live with my Grandma Nan\nAlways itchin' for somethin' to do, was flippin'\nThrough the radio stations one day\nAnd discovered this DJ who was mixin'\nI say it to this day, if you ain't listened to The Wizard\nYou ain't have a fuckin' clue what you was missin'\nI'd zone out with my headphones\nAll I remember doing's wishin' for shoes\nFuck them stupid Pumas, bitch!\nIt's all about them new edition Troops\nYou get them LL Cool J coolin' system\nMade that final manoeuvre to 8 Mile and Hoover\nAnd somehow I saw my future is in this\nThat's how I knew my mission\nLittle boom box boomin', spittin'\nPracticin' numerous writtens\nWhen I'd sit in my room, envisionin' my dreams come to fruition\nI remember Proof would visit\nCouldn't wait to play him my new shit\nHe'd go cuckoo ballistic, go through the roof for his shit\nIt's like we knew the instant\nWe touched a mic that both of us two existed\nTo do this shit; never quit, too persistent\n\n[Interlude]\n\"Carved an underground empire.\"\n\n[Verse 3]\nStarted a group of misfits, Proof had a proposition\nIf we all band together, there ain't no stoppin' this shit\nCome up with aliases, bipolar opposites and\nBe ready to come off the top as sharp precision\nIf you got dissed at the Shop, 'cause if they caught you slippin'\nThey'd take your spot if someone got to rippin'\nYou, and you forgot your written\nOpportunity knocks once, it ain't knockin' again\nIt tried ding-dong ditchin' shit, I fuckin' got that bitch in\nA headlock, cut off its oxygen, Slim\nIs not budgin' like cocksuckin' cinder blocks in the wind\nNow I got a pot to piss in\nSpot in that top position, koppin' over the opposition\nLookin' like a dog that's pissin', leg up on the competition\nPromisin' complete dominance, Sugar Ray Robinson\nI'm in a league Muhammad's in\nAli's my colleague bombin' 'em\nProbably end up on top of 'em\nStompin' 'em like Ndamukong\nI'm Russian like a Ukrainian, LaDainian Tomlinson\nFlow vomits in your face, competitors fall at my waist\nYou spit a rhyme, I spit in a rhyme's face\nSo name the time, place\nTo battle, bitch, I'm still in that mind state\nDon't make me step on you and make you wine grapes\nCry babies, maybe my way that I use words\nIs loose, but you turds better be careful how you choose yours\n'Cause feelings scar but egos bruise worse\nAnd the truth hurts – shit, no wonder you're sore losers!\nNow where's your poo, birds?\nOoh, no more trippin' in bird shit\nSongs of self-empowerment surgin'\nWords of encouragement, but discouragin'\nThe rappers, the rap game's god\nBut the name's not James Todd, I'm just a wordsmith\nSo let these words lift\n'Cause all I got is bars for you dumbbells\nSince yours ain't workin' out, each verse is\nMore merciless than the first is\nAnd you ain't got to wear no shoes and shirt in this bitch\nTo get served, bloodthirst revenge of the nerds, chka\n\n[Interlude]\n\"That you'll not escape my vengeance.\"\n\n[Verse 4]\nBut the dumpy kid with them ears like Dumbo's gone\nWord to Uncle Ron, I'm turnin' into a non-humble Don\nYou blonde dumb hoes, all I got is dick for you to come blow on\nSo start the show, but I need a drum roll 'fore I go on\nBetter back away from the front row, get launched\nShow you I'm bigger than Dikembe Mutumbo\nOn the fuckin' Jumbotron\nI'm a juggernaut, you do not wanna rumble, you bomboclaats\nI'll leave you stretched out like a fuckin' yawn\nSo mow the fuckin' lawn, your asses are blades of grass\nAnd I'm fuckin' up this whole landscape of rap\nThe G.O.A.T. just ate eight acres, an eighth of that\nWas just to make a path\nAnd take it straight to your favorite rapper\nOh, look, my notebook looks smoke-cooked\nLike the flow stood a foot over the flame on the stove, soot\nCharred debris floatin' like Oakwood\nWas burnin', return of the no good and I won't quit\n\n[Interlude]\n\"And the next thing I know\nSomething came crawling up from below\nSomething that made Godzilla look like a blamed...\"\n\n[Hook]\nAnd I don't quit, won't change\nIt's like a Groundhog's Day\nSo crowd around, y'all, 'cause you may\nSee if I popped your head\n\n[Bridge]\nI'm a monster, mutt\nI'ma turn into a monster\nI'm a monster, mutt\nWith my dick in your mouth all day!\n\n[Outro]\n\"I'm not so sure I want to know from whence it came\nBut the white flesh creature's trail is easily followed\nThere, before that shimmering veil of light, the ivory skin slug thing.\"", "image": "https://images.genius.com/a24c8428273f315c50a002663b515ffb.1000x1000x1.png"}], "artist": "Eminem"}