{"songs": [{"title": "From Tha Chuuuch to Da Palace", "album": "Paid Tha Cost To Be Da Bo$$", "year": "2002-10-15", "lyrics": "[Intro]\nFa shizzle dizzle, it's the big Neptizzle\nWith the Snoopy D-O-Double Gizzle!\n\n... (Snoop Dogg!)\nC-walk to this (Snoop Dogg!)\nHehe, yeah, C-walk to this (Snoop Dogg!)\nA-ha-ha! C-walk to this (Snoop Dogg!)\n\n[Verse One: Snoop Dogg]\nBam! Boom! Whatchu gon' do cuz?\nGuess who rollin in, with them baby blue Chucks?\nAnd I've still got my khakis creased\nI'm still loc'n on these beats and keep a bad bitch on the streets\nIt's the S-N-double-O-P'n\nBiggest dogg of 'em all, and youse a flea'n\nAnd since I got time to drop it for you I guess I must\nAnd give it to you motherfuckers like Busta-Bust\nI keep the heat on deck, but in God we trust\nAnd can't none of y'all fuck with us\nBut you can run up on the G but that's not thinkin' wisely\nThese thrillers are \"Contagious\", just like Ron Isley\nWhat the hell is goin on? Someone's sleepin in my home\nSnoop to the D-O-Double G (uh-huh)\nGet in where you fit in, follow me (ooh!)\n\n[Hook: Neptunes]\nWho's the man with that dance? (Snoop Dogg!)\nWho keep the khakis for all his pants? (Snoop Dogg!)\nKeep the low-low in a three-wheel stance (Snoop Dogg!)\nStill got the \"Gin and Juice\" in hand (Snoop Dogg!)\n\n[Verse Two: Snoop Dogg]\nI do it for the G's and I do it for the hustlers\nHere to annihilate you mark-ass busters\nEff the police cause all they wanna do is cuff us\nThe world is fuckin' chilly as if his name was Usher\nBut I'm still ridin' them 'llacs, makin them G stacks\nAnd got them cornrows to the back\nI ain't really tryin to be picky\nBut if you give me somethin, it's got to be the sticky\nGreen by the ounces, low-lows bouncin\nSandy Fay and Annie Mae kissin on my couch and\nOoh to the ouch and, Moet fountain\nThat's how we get down at the Doggy Dogg House'n\nThis year we ain't fuck with thousands\nWe clean with millions that get fly as a falcon\nPull up to the Doggy Dogg palace\nWith a car fulla bitches cookin grits like Alice (ooh!)\n\n[Hook]\n\n[Interlude: Snoop Dogg]\nThree 14 inch rims is running on the side\n(They're riding on the side?) Yeah they running on the side!\nThree 14 inch rims is running on the side\n(They're riding on the side?) Yeah they runnin on the side!\nThree 14 inch rims is running on the side\n(They're riding on the side?) Yeah they runnin on the side!\nThree 14 inch rims is running on the side\n(They're riding on the side?) Yeah they running on the side!\n\n[Verse Three: Snoop Dogg]\nTake two and pass it, it will not burn you\nFrom the Long Beach Chronicles to the Wall Street Journal\nThey all know the G with the Cutlass Coupe\nAsk Bill Gates, \"Yeah I know the homie Snoop\"\nYeah, I'm straight loc'n, hangin wit my folk and\nFollow Rakim cause \"I Ain't No Joke\" and\nCuz, I done seen so much (like what?)\nEnough to have your feelings touched\nWhen the gunshots ratta, all your boys scatter\nCheck up on your homies but they gave ya bad data\nMake a nigga stop BREATHIN, have his soul relievin'\nAnd now you niggas believe in\nWhat I say cause what I say is so real\nHomie you don't wanna see the steel!\nYou dont wanna catch a body, you came here to party\nNow that's what you should do, now where's my baby boo? (ooh!)\n\n[Hook]\n\n[Outro: Bishop Don Magic Juan]\nYeah, no introduction, is needed\nBut for those who STILL, refuse to accept\nThe reading on the wall, for the new Mack-allenium\nThis is the Archbishop Don Magic Juan\nChairman of the Board, of famous players EVERYWHERE\nAnd I'm puttin it down with Big Snoop Dogg, the legend\nThe King Player, my friend, yo' friend\nThe L.B.C. SAVIOR!\nAlso known, in this new Mack-allenium, as DA BOSS", "image": "https://images.genius.com/020258c5b50e382d2763d8439947dad4.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}