{"songs": [{"title": "Who Rotten ’Em", "album": "The Art of Storytelling", "year": "1999-03-25", "lyrics": "One of the greatest rapper, walk - I'm sayin'\nIn the field makin' my brick without hayin'\nMad busy kid, nah whip cut here\n\"You, Boy, drop your bundle bring your butt in.\"\nA soldier, what I do to that hood?\n\"Are you that slave everybody tellin' me rap good?\nCalm down, not goin' ta murder ya\nClean yourself, Pharoah said he wanna have a word with ya\"\nMy mom, pop, look concerned\nAfter takin' a shower, dress and returned\nThe soldier, kinda on the dark end\nBrought me and the motherfucking palace was barking\nIn the midst, a poet, dryin'\nPharoah and his girl being entertained by him\nMotherfucker got some nerve\nSaid \"Bring slave forward, let me observe\"\nHe asked me my name and start badger me\n\"Ricky, what?\", 'Ricky, your majesty'\nAnd bowed because I had to\n\"Kick a rap that shit better sound fat too.\"\n\nWho rotten 'em\nPlaits swing, but have you forgotten 'em\nBiggest big shouts since King Tut and 'em (who rotten 'em)\nKids ville, motherfucker couldn't sit still\nAll bitches is open off Rick's grill (who rotten 'em)\nDefinetly exort, any stalkin'\nHawk gawkin' at silk fabrics when I'm walkin(who rotten 'em)\nFondle with right, yet, spec get delighted\nAll a that jungle shit, whites rap\n\n\"He's fat\" queen said to the pharoah excited and\nDid seem obvious the rap delighted him\nThen start banging on the plate (Yes your honour?)\n\"Send this other rapper to the lions\" (Please, no!)\nPleaing with merit, if you kill him for my sake\nMy raps will lose spirit\n'Please let him live, I prefer that'\n\"OK, well, send him where this slave used to work at\"\nDo or die jammin' me into\nEven was allowed to move the family in too\nAny beat better rap good on\nEven gave me mad nice outfits to put on\nKnowing that my rap stlye bumped many\nAnd expecting some important company\nThe king visits where I was put to write\n\"Slave, you're behind, better rap real good tonight\"\nIn other words, lay your mack down\nCause these cats not the one to sound wack round\nSo that night, when they summers be them clapping\nTook a deep breath and then began rapping\n\nWho rotten 'em\nTryin' a find out what excite, what I write\nWhat ignite with\nLion never once tried to bite Rick\nExcusely, assumed to meek, refuse to greet\nA smoother geek, just move ya feet\nShocked all dippin' and stoppin'\nEven slave owner wanted me to whip a man, fucker\nShakin' any prison, kickin' back, sick of crap\nAnd sista breakin' when a nigga rap\n\nWell it was obvious the raps unpluggin'\nDignitaries spat wine out they mouth, buggin'\nThis they never heard that type a tactic\nGold sandles all over their fat steps\nOne dignitary overwhelmed me said\n\"I'll give you half the eastern border if you sell him\"\nBack at the rest spot to nap a bit\nMom! Pop! They delighted with the rap i did\n\"Son\", my mom said sweepin' up\n\"That lunatic'll kill you if you don't keep it up\"\nWhat's wrong with you, \"Son, I'm not scornin' you\nLeave your best for a rainy day, I'm warnin' you\"\nRipped my ego apart\nSo I set upon a mission to change the king heart\n'Sire, whippin don't pay off\nA lot more done you give a nigga one day off'\nHe took my advice, steady elegance\nSir noticed that my input was accurate intelligence\nThat type meant ta stripe, kids\nEven after he died, I still write raps like this\n\nWho rotten 'em\nAll teacher and scholar try proceed me, believe me\nI am all culture that you need be\nAnd superior juice to abuse, I choose\nUse words racist slave owner used to\nSandwich known crook, redbone hook too\nGot his own land, which you're known look to\nNot only ass wipes, swept side kick\nShocker and them niggas even try to dress like Rick", "image": "https://images.genius.com/73539fff4e6ebc470e6cab73853f0ac6.1000x1000x1.jpg"}], "artist": "Slick Rick"}