{"songs": [{"title": "Gang Related", "album": "The Documentary 2.5", "year": "2015-10-16", "lyrics": "[Intro: The Game]\nSometimes I pull up on Brazil and Wilmington\nLike 3 o'clock in the morning, stop my car, let the top down\nDon't nobody know I'm there, just reminiscing 'bout the days when we used to be in Larry Nickel's crack spot, with my brother Fase\nKing Frog, Squid, Big Dan, D-Bo, B-Los\nBack when Lil' Frogg and Badass they was lil niggas\nLil wild niggas running round the hood\nMy nigga Slim 'Ru is in the joint doing ten\nThat's my solid nigga, on Bloods, my nigga Peanut, he in jail now\nMy lil' cousin Damo and my homeboy Buddha-Ru, this Cedar block\n\n[Verse 1: The Game]\nI remember days like this, my nigga\nWe was tripping 'cause we hated Crips, my nigga\nShooting out of six trays and shit, my nigga\nHe was slipping so we sprayed his six, my nigga\nI done seen some brazy shit, my nigga\nA kid shot cause he raised his fist, my nigga\nFiends stealing 'cause they can't get a fix, my nigga\nSharing needles, passing AIDS and shit, my nigga\nIt's fucked up but I was raised in this, my nigga\nBeen smoking purple haze since six, my nigga\nAnd my moms wasn't no lazy bitch, my nigga\nI seen her hustle that's what made me rich, my nigga\nBut all this shit is overrated that's why I don't give a fuck no more\nI don't want this Benz or this truck no more\nI started off doing this shit 'cause I love this shit, Blood\nSeeing the homie slap box, I love this shit, Blood\nSitting in my Impala like I love this shit, Blood\nWeren't never 'bout a dollar, I just love this shit, Blood\nScrapping after school, Compton High wasn't bool\nCould have went to Centennial but I love this shit, Blood\nUsed to bang Quik, yeah I love this shit, Blood\nMausberg was sick and I love this shit, Blood\nThen I gave Wacko my demo outside of Food 4 Less\nHe came back in ten minutes like \"I love this shit, Blood\"\nWest side Piru, I love this shit Blood\nElm street to the Fruits yeah I love this shit, Blood\nCrip neighborhoods too, even though they blue\nCompton is where we grew and I love this shit, Blood\n\n[Bridge 1: The Game]\nI seen some brazy shit, my nigga\nI done seen some brazy shit, my nigga\nI done seen some brazy shit, my nigga\nI done seen some brazy shit, my nigga\nI done seen some brazy shit, my nigga\nI done took some fades with Crips, my nigga\nMy own homies did some shady shit, my nigga\nBut that's the shit that made me this, my nigga\n\n[Chorus: Asia Bryant]\nAll my life's been so complicated\nBut I will never turn my back on Compton\nOur shit is so overrated\nBut I will never change who I am\nSo I'm riding for Compton\nI ride, I ride, I ride, I ride for Compton\n\n[Bridge 2: The Game]\nI done seen some brazy shit, my nigga\nI done seen some brazy shit, my nigga\nI done seen some brazy shit, my nigga\nI done seen some brazy shit, my nigga\nI done seen some brazy shit, my nigga\nI done took some fades with Crips, my nigga\nMy own homies did some shady shit, my nigga\nGot a voicemail from Braze, what's this my nigga?\n\n[Outro Voicemail]\nBlood! Chuck, you know what it is, Blood!\nYou know I only call you when its on some real shit, homie\nI gotta tell you, stay the fuck up out them streets, Blood\nYou done came to motherfucking far to be playing with these bitch-ass niggas out here, on Westside Bompton Piru\nNigga you know I been holding you down ever since you was young, Blood\nYou know, niggas out here getting killed\nAll the motherfucking homeboys, and nobody doing shit!\nBut nigga, you got a way up outta this motherfucker, Blood\nNigga, you a real Bompton motherfucker\nNigga Cedar block, you already know how I do it, nigga\nMotherfucking O.G. Westside Bompton Piru Brazy\nAka Frank Pace, niggas know me, y'all know how I get down\nThat's my lil' motherfucking homeboy\nBlood done made it up outta here\nLooking out for his kids, looking out for his family\nAny nigga get in his way gon get it, on Bompton!\nChuck, Blood, don't let them do you like they did my nigga 2Pac\n2Pac, 2Pac, 2Pac, 2Pac...", "image": "https://images.genius.com/72a00bceccb1bffdad5f44c0094145dd.1000x1000x1.jpg"}], "artist": "The Game"}