{"songs": [{"title": "Drug Test", "album": "Hoodmorning (No Typo): Candy Coronas", "year": "2011-08-01", "lyrics": "[Verse 1: Dr. Dre]\nI’m in this mothafucker doing what I wanna\n10 bottles, 10 bitches go with my persona\nPull up in that Enzo then I do donuts\nI’m that cool, cashews, make 'em all go nuts\n(Baby got ass, I need me a shot of that\nLil mama get gangsta for me, stuff it in your Prada bag)\nThat's right, she's got something that I wanna see\nThat's right, so if she leave, she fucking with me\nThat's life, twerk something, work something, hurt something\nShe wanna check, check this shit out like a verse coming\nThey rip their neck and run their mouth when they heard something\nDre dropped another one and fucked around and murdered something\nClub filled with dead bodies\nIf not then you a zombie, I'm not gonna feel sorry\nYou pass out from it, get drunk, get blunted\nDo what you wanna do, drug test on you\n\n[Game]\nLotta money when I talk\nBig mills, big deals ‘bout a hundred in a vault\nSit still, that real, lotta haters throw salt\nThey lost big Game give a fuck how you feel\nI fear she just might just pop that pill\nAnd feel on me all night till the tip spill\nTip scales with her waistline, sex with the bassline\nShe gon' fuck a snare drum one drink at a time\n\n[Dr. Dre]\nBlow right, hoes fight over my name\nI got my dough right, hustle running all in my veins\nIt’s forty days, forty nights if I’m making it rain\nI reign supreme, a bottle and some bomb-ass weed then we good\n\n[Hook: Sly]\nIf you got drugs in this motherfucker\nLet me see your hands in the air\nNarcotics in the club and the ladies love us\nSo let's get high off something\nHigh off something, high off something\n'til your mothafucking brain don’t function\nHigh off something, high off something\nWhat I supply taking you high?\n\n[Verse 2: Game]\nFireworks when I spark, yellow tape\nLotta chalk thought you said you a boss\nBig deal, bitch chill, pulling out that black card\nShowin’ off big spendin’, letting alcohol spill\nI feel she might just get too faded\nX-rated that's what I like glad that you made\nTo this ceremony at hand, take a sip lets plan\nFor the future, introduce you to Snoop get you right and\n\n[Snoop Dogg]\nMay I, kick a little something for the G's and\nMake a few ends as I breeze through?\nThe shit on my hip is a fucking preview\nAnd guess what it lead to\n\n[Hook]", "image": "https://images.genius.com/5f5301fa46a1afd76d0d034e80d23434.1000x1000x1.jpg"}], "artist": "The Game"}