{"songs": [{"title": "Lullaby", "album": "508-507-2209", "year": "2017-06-16", "lyrics": "[Verse 1]\nI wonder if you often think about what you became\nOr do you ever wonder if you ever truly changed?\nCause honestly I'm lost and I don't know who to blame\nI need some help cause I don't know what else to soothe the pain\nI watch you raised me as a baby so over protective\nSmiling at me, blowing kisses while you hold me restless\nWhen you told me that you loved me I can tell you meant it\nAnd it never took for you to try to ever show your efforts\nBut we was connected through the heavens though, I felt your soul\nAnd that alone is just a feeling some will never know\nI bumped my head and you consoled me as you held me close\nAnd I wonder where went wrong but I guess I'll never know\nCause ever since I grown I felt like you been kind of giving up\nAnd it seems like everything I do is just not good enough\nShit, we don't have the type of bond we used to have before\nAnd I ain't mad at all, I just wonder if you recall the day that I was born\nWhen you used to sing to me like\n\n[Chorus]\nLa la la la la la la la la la la la la la la\n(Yeah, you used to sing to me like)\nLa la la la la la la la la la la la la la la\n(You used to sing to me)\nLa la la la la la la la la la la la la la la\n(Yeah, you used to sing to me like)\nLa la la la la la la la la la la la la la la\n\n[Verse 2]\nI wonder if you often think about what you became\nAnd do you ever wonder if you ever truly changed?\nCause honestly I'm lost and I don't know who to blame\nNigga I need some help cause I don't know what else to soothe the pain\nMy father died when I was five and I ain't cry at all\nI never knew him he just disappeared and I'm not sure if he knew I would grow up to be ruthless, I don't hide my flaws\nA young woman with a body and a mind like yours cause we a lot alike\nI mean that's prolly' why I felt connected\nAnd when we met I was so innocent but slowly tempted\nWhen you told me that you loved me boy I know you meant it\nYou sucked the soul out of my body with your own intentions\nNow I'm stuck inside a life of prostitution, no discretion\nAnd all you do is beat my ass and leave me slowly breathless\nBut we don't have the type of bond we used to have before\nAnd I ain't mad at all, I just wonder if you recall when I laid in your arms\nAnd you used to sing to me like\n\n[Chorus]\nLa la la la la la la la la la la la la la la\n(Yeah, you used to sing to me like)\nLa la la la la la la la la la la la la la la\n(You used to sing to me)\nLa la la la la la la la la la la la la la la\n(Yeah, you used to sing to me like)\nLa la la la la la la la la la la la la la la\n\n[Verse 3]\nI wonder if you often think about what I became\nAnd do you ever wonder if I ever truly changed?\nCause honestly I'm lost and I don't know who to blame\nListen, I need some help cause I don't know what else to soothe the pain\nI used to watch movies about you a whole lot before\nI read about you back in school when I was kind of bored\nNow I'm ashamed and embarrassed I truly got involved\nCause you gave me a feeling some shit that I never felt before\nAnd I ain't trying to make excuses but inside I'm torn\nAnd you was there for me at times I couldn't find the Lord\nAnd all I had to do was inject you and lock the doors\nSo I can feel some type of peace while I dream and go watch the stars\nAnd that alone is just a feeling some will never know\nBut now I'm rotten, it's not the same as I felt before\nWe don't have the type of bond we used to have before\nBut I ain't mad at all, I just wonder if you recall sticking you in my arms\nWhen you used to sing to me like\n\n[Chorus]\nLa la la la la la la la la la la la la la la\n(Yeah, you used to sing to me like)\nLa la la la la la la la la la la la la la la\n(You used to sing to me)\nLa la la la la la la la la la la la la la la\n(Yeah, you used to sing to me like)\nLa la la la la la la la la la la la la la la\n\n[Voicemail]\nYo what's up? This is Joyner\nI'm unable to take your call right now\nLeave me a brief message and I'll get back to you, peace\n\n[Brief Message]\nAyo, I'm really tryna figure something out\nAnd you really gotta give me the chance to put my finger on this shit\nCause I'm really confused, man\nI let you crash on my couch because you told me\nYou ain't had nowhere to sleep last night\nAnd you stole from me, my G? On some G shit, man?\nBro, what kinda shit is that, man?\nReally, my nigga? Yo, you a little bum ass nigga, man\nWhen I see you, I need a fair one, G, facts", "image": "https://images.genius.com/895cf32a9779b29f3e18b6c7cb55b3e2.500x500x1.jpg"}], "artist": "Joyner Lucas"}