{"songs": [{"title": "Band of Gypsies", "album": "Elephants on Acid", "year": "2018-08-03", "lyrics": "[Intro: Sadat]\nياعم يابتاع الحشيش، انا عايز حشيشة طرية\nأستنى يا بي ريل، دا الواجب دا عليا\nالحشيشة اللي في جيبه غير الحشيشة اللي في ايديا\nالحشيشة اللي في جيبه غير الحشيشة اللي في ايديا\nونصطبح أنا وأنت ونولع الدنيا\nونشرب سطفا حلوة ونسميها: كايروفورنيا\n\n[Verse 1: B-Real]\nYou're lookin' at the last of a dyin' breed\nWeeded up, please, speed it up\nSittin' in the Cali sun heated up\nInked arm needled up\nRocket style, Don Cheadle'd up\nI put the fear of God in people, what\nPeople lookin' at me sideways like I'm on the verge\nLike them on the purp that's blazed, I don't say a word\nYou don't wanna follow me, son\nYou ain't got the nerve\nYou just wanna swerve with a little herb, absurd\nGot you paranoid in the paragraph when I paraphrase\nGot a pair of Jordan's dancin' on your fuckin' face\nParalyzed, see the paranormal paratroops\nSummoned by the Grandmaster as he prepares to loose\nTemple doors open up, smoke billows out\nNow you hoping, what, for mercy? Get your soul brilloed out\nFrom another hood, you ain't really fuckin' with our brotherhood\nEven if another could, I wish a motherfucker would\nClip it up or sip it up\nListen, I prefer to trip it up\nChem skippy ya'll bitter fucks\nI can take a bigger chunk\nAnd if I'm callin' dark figures up\nDon't make a move, they light triggers up\nMuggs, cut 'em up, chka-chka, what, huh\n(This is for the-)\n\n[Chorus: Alaa Fifty]\nوعنينا قفلت ودماغنا سافرت، سافرت في حتة تانية\nوسجارة ولعت وسجارة لفت، ولع سوجارة تانية\nعصابات السموكات، يلا نرول الجوبات\nعصابات السموكات، يلا نرول الجوبات\nيا رايق\nخليك سايق\nخليك رايق\nقولوا قولوا\nبتقولوا ايه\nقولوا قولوا\nبتقولوا ايه\n\n[Verse 2: Sen Dog]\nEver heard of me?\nWicked as you ever seen\nHeavy on the throttle\nSmoke when we hit the scene, rollin' unseen\nUnder the cover of night\nSpirit flying free, niggas higher than a kite\nYou got nothing on me, we some nomads\nAnd my clan goes way back to the Cro-Mags\nRun together, unbreakable bloodline\nToo much to fuck with when all the brothers combine\nEverything you ever heard of is not a myth\nCrazy dogs you don't ever wanna deal with\nWhich smell? It's the hash that we left around\nSmoke a whole pound when I feel myself comin' down\nLive how I wanna live and answer to no one\nSimilar to the ways of the shogun\nThink again before you try and come and get me\nOr you'll be shot up by a gang of gypsies (shot)\n\n[Chorus: Alaa Fifty & Sadat]\nوعنينا قفلت ودماغنا سافرت، سافرت في حتة تانية\nوسجارة ولعت وسجارة لفت، ولع سوجارة تانية\nعصابات السموكات\nعصابات السموكات، يلا نرول الجوبات\nعصابات السموكات، يلا نرول الجوبات", "image": "https://images.genius.com/622b1c82bfeabfeb6faa1cb042eb9214.640x640x1.jpg"}], "artist": "Cypress Hill"}