{"songs": [{"title": "260", "album": "Ironman", "year": "1996-10-29", "lyrics": "Cat I got to take him off of here, that's right\nI got to take him off of here\nCause there's only one, and that's me\nYou understand? 'fore all that fighting, you understand\nThat sucka think he good, that sucka think he can whoop me\nAnd I know he can't whoop me, I...\nAy boy, the nigga whole style is chump\nYou understand?\nLet me get mines first\nThen after I get mines, you can do what you want to do...\n\n[Intro: Ghostface Killah]\nYeah, scandalous\nYeah miraculous, the arsonists\n\n[Verse 1: Ghostface Killah]\nYo, kicked down the door in the spot, 260\n2L, I heard they had O's for sale\nI heard the same shit, money drive a burgundy whip\nKeep a low fade, license plates engraved \"PAID\"\nWhere's the cat from, think he's from New Jerusalem\nPretty Rick did his thing for him, but he was using him\nBoss Sun's younger physical, you know the God\nHe go with Tip, the one who called Lover of God\nWhy Equality Self, I know the Master Allah Now\nIt's time to get the God U and blow like mines\nBut on the low I heard he got Born Original sent\nBack in a drive-through Kentucky Fried shot up his Ac\nWe got to get him dunn, aliens is snatching our bread\nUFOs moving in with bigger plans than Feds, yo\nKnock on Daddy-O's door get the scope\nHe's not home, he took Ishmael to Park Slope\nThere go the the dreads yo, swindle two bags of that skunk\nThat get you crashed out had you laid out like bums\nPeace Kiana, what's up with your girlfriend Wanda\nShe drive a cream Honda, with legs like Jane Fonda\nI just left her, she took Regine to Pathmark then\nJetted to Canal to get her man some Clarks\nShe should be back in ninety minutes, Ghostface\nGod forbid she safe, BCW was watching the kids\n\n[Verse 2: Raekwon]\nTwo hours later, scheming like DeNiro in Casino\nSon better have more coke than Al Pacino\nKiana ain't telling no lies, last year she did a sting and a half\nWith Tymeek bought him a aircraft\nBut anyway, yo, Daddy-O home, we need the shotties nid-ow\nWhen we get back, throw you a thid-ou\nLater that night, stay mesmerized yo\nGo get the green 5, meet you on the corner of Now Why\nYou ready, you got the E&J and the machete?\nWe going upstairs, I hope one nigga is heavy\nWe walked in, both of us, looked like terrorists\nMasks on, second floor, dun yo, I handle this\nKick in the crib, the whole shit looked graphical\nNatural, fucking a white bitch, actual\nFiends chanting, \"Do your thing Chef, handle it\"\nI shot him in the neck, it ricocheted and hit Carolyn\nRan to the back analyzing, much disguising\nSurprise is coming in their eyes and tranquilizing\nBugging, throwing the twin cousins at his nugget, fuck it\nMeet shottie waddy slug body hobby\nWhere the drugs, where the ounces you be bouncing\nFake cats announcing on the block, you lounging\nWhere the blow at, I ain't got shit, stop fronting\n(Yo Chef, throw the joint in his mouth, money'll stop stunting\nBitch, hold that pit, before I push your wig back\nChef stop waving that, show him where the paper at)\nCome here Valerie, you know the God he need a salary\nPut down the pipe here's two tickets to a coke gallery\nIt's in the kitchen in the ceiling\n(Baby girl kept squealing\nOnly found a white block of cheese from New Zealand\nOhhh shit! Yo, yo where that shit at yo?\nYo Chef, where that shit? What? What? Aiyyo...)", "image": "https://images.genius.com/86aaa4a25c81fd34a671c2db7083cc80.800x800x1.jpg"}], "artist": "Ghostface Killah"}