{"songs": [{"title": "The Soul Controller", "album": "Ironman", "year": "1996-10-29", "lyrics": "[Intro: The Force MD's]\nWhoaahhhoahhh, oahhhohhhhh\nIt's been a long, long\nA long time coming\nA change gon' come\n\n[Verse One: Ghostface]\nYo, yo these streets got me backed down how can I escape?\nHow can I survive without bubblin weight?\nIt's prepared for the stand off, once you hand off\nThat white rock, and then give birth to a knot\nYour biggest dream was to rock your 850 and beam\nYou and the Gods buy a crib in the white part of Queens\nBut at the same time, niggas on the block is ill\nSome'll rock you to sleep, hap, for selling cross pills\nBeing watched all day like enemy's prey\nFaces, you never seen before is in your hallway\nBrothers you knew for years is mad pussy and scared\nBack in the days U.F.O.'s couldn't walk up in here\nIt's time to motor, travel like a foul order\nClear my head, stay sober, the soul controller\n\n[Hook: The Force MD's]\nOahhhh, it's been a long, long\nA long time coming\nA change gon' come\nOh, yes it will\nSaid I'm too, tired of livin\nBut I'm, but I'm afraid to die\nCause I don't know what's up there\nIn that great big ol' sky\n\n[Verse Two: Ghostface]\nSink deep into the fog, big buffalo large\nTaj Mahal just got banged, shanked for eighty large\nIt's hard to keep up, with these key-ons, that smoke dust\nIn the U.S. Mint they went to rock the place and call the rush\nAll these shameless niggas armed with cherry-red Bally's\nOn the twenty-fifth, everybody rich is gettin married\nKilled for power beans, your brother own schools in Medina\nVaseline lips is cracked cause they all had dreams\nThey overdue, these Gods own a mosque in Peru\nTropical trees and weaves where they grew bamboo\nOlympic minds quick flash like a leak on\nA hundred shares short to own Nissan, watch em get they feast on\nRoyal blue lies inside the eyes of heaven\nCurse the head, who speak foul and jinx number seven (seven)\nClear my head and stay sober, the soul controller...\n(Stay sober, the soul controller)\n\n[Hook: The Force MD's]\nOahhh, been a long time comin\nOh yeah\nA change gon' come\nWoooaahh, yes it will\n\n[Verse Three: Ghostface]\nYo, yo we sit and play the wall like nine super heroes\nLate for the man choose and hit socks and stereo\nThe kid's nice, warnin you twice, run your garmets\nJet to Providence, switch up and bag down your Parliament\nIronman is laced with a plate inside the dome piece\nGo off in airports, biographies, prophecies\nWatch me set it, real key-ons hold down the desert\nAnd walk with a famous name like Supreme Magnetic\nCarbon copy, I love my Akai snare choppy\nMelachi off the funky pen with the wax poppy on instrumentals\nNiggas get lost like S.S. Minnows\nTurned out like rentals, keep gold around the denim\n\n[Outro Part One: The Force MD's]\nA change gon come\nYes it will\nIt's been a long, long\nA long time coming\nA change gon come\nWooo, yes it will\nSaid I'm so\nTired of living\nBut I'm, but I'm afraid to die\nCause I don't know what's up there\nIn that great, big ol sky\nOh my, oh my, oh my\nIt's been a long, long time\nA long time coming\nChange gonna come\nWooo, yes it will\n\n[Outro Part Two - from the motion picture \"Carlito's Way\"]\nSorry boys\nAll the stitches in the world can't sew me together again\nLay down, lay down\nGonna stretch me out in Fernandez funeral home on hun and ninth street\nAlways knew I'd make a stop there\nBut a lot later than a whole gang of people thought\nLast of the Mohicans\nWell, maybe not the last\nCan't come with me on this trip, Loaf\nGettin the shakes now\nLast call for drinks\nBar's closin down\nSun's out\nWhere we goin for breakfast?\nDon't wanna go far\nRough night\nTired, baby\nTired...\n\n[Outro Part Three - from the motion picture \"The Usual Suspects\"]\nGreatest trick the devil ever pulled\nWas convincing the world he didn't exist\nAnd like that, he's gone", "image": "https://images.genius.com/86aaa4a25c81fd34a671c2db7083cc80.800x800x1.jpg"}], "artist": "Ghostface Killah"}