{"songs": [{"title": "Get At Me Dog", "album": "It’s Dark and Hell is Hot", "year": "1998-02-10", "lyrics": "[DMX, (Sheek)]\n(Yea I'm right here dog) Where my dogs at\n(We right here dog) Where my dogs at\n(I'm right here dog)\n\n[DMX]\nWhat must I go through to show you shit is real\nAnd I ain't really never gave a fuck how niggas feel\nRob and I steal, not cause I want to cause I have to\nAnd don't make me show you what the MAC do\nIf you don't know by now then you slipping\nI'm on some bullshit that's got me jacking, niggas flipping\nLet my man and them stay pretty and I'ma stay shitty\nCruddy it's all for the money, is you wit' me?\nGet the bitches, and I'll commit the crime\nAnd when it's on we transform like Optimus Prime\nI'll form the head, roll out let's make it happen\nIf we ain't gonna get it wit them we'll take your cap\nBust it off dusting off the softest niggas\nMoney with the biggest mouth, yo let's off this nigga\nUp North this nigga never made a sound\nBreathe too fucking hard and you're getting bust down\n\n[Hook: Sheek, DMX]\nYo, yo y'all niggas wanna be killers (get at me dog)\nY'all niggas wanna feel us (get at me dog)\nY'all niggas want the real (Get at me dog)\n(Rrrrrr arf arf, what the deal)\nYo, yo y'all niggas wanna be killers (get at me dog)\nY'all niggas wanna feel us (get at me dog)\nY'all niggas want the real (Get at me dog)\n(Rrrrrr arf arf, what the deal)\n\n[DMX]\nNowadays it ain't looking too good for certain niggas\nI'm hurting niggas\n(What you doing?) Robbing niggas, jerking niggas\nSticking niggas 'cause they deserve it; when money got murdered\nThey know he died slow cause they heard it\nThe nigga ain't blew up the spot a while\nAnd the mother fucker ain't got shot in a while\nIt just takes a light up to fuck the night up\nBlow everything in sight up, fuck around and I'll have your ass right up\nWhen you mention some shit you wasn't able to stand\nI got shit that'll disable a man with the wave of a hand\nThe days are longer and seems like I'm facing time\nI've got a lot of dreams but I'm not really chasing mine\nI soak it all up like a sitting fly\nCause nowadays getting by, nothing more than an occasional meal and getting high\nI live to die, That's where I'm headed\nLet your man hold something, now it's all about you can get it\n\n[Hook]\nYo, yo y'all niggas wanna be killers (get at me dog)\nY'all niggas wanna feel us (get at me dog)\nY'all niggas want the real (Get at me dog)\n(Rrrrrr arf arf, what the deal)\nYo, yo y'all niggas wanna be killers (get at me dog)\nY'all niggas wanna feel us (get at me dog)\nY'all niggas want the real (Get at me dog)\n(Rrrrrr arf arf, what the deal)\n\n[Verse 3: DMX]\nOne in the back wit ya faggot ass face down\nLucky that you breathing, but you dead from the waist-down\nThe fuck is on your mind? Talking that shit that you be talking\nAnd I bet you wish you never got hit cause you be walking\nBut shit happens and fuck it, you done did your dirt\nNiggas is wondering how the fuck you hid your skirt\nRight under their eyes like a surprise to the guys\nThat one of their mans was a bitch in disguise\nFucking with cats that order more hits and slaughter more kids\nLet me holla at you yo Baltimore shit (ah-oh!)\nKnahmean? I'm just robbing to eat\nAnd there's at least a thousand of us like me mobbing the street\nWhen we're starving, we eat whatever's there\nCome on you know the code in the street; whatever's fair\nBlood stains and chalk, means your man couldn't walk\nAfter the talk, about him not being 11-33 to New York\nTransforming-ass niggas'll get it quick\nAnd yo for real that nigga K can suck my dick\nAnd it's gon' take all these niggas in the rap game to barely move me\nCause when I blow shit up, I have niggas falling like white bitches in a scary movie\nAHHH! You know I don't know how to act\nGet too close to niggas it's like: \"Protected by Viper, stand back\"\nWhat's this? I thought you niggas was killers, demented\nThe fuck you want me to do with this coward? Finish him, it's ended\n(*EXPLOSION*)", "image": "https://images.genius.com/aa4292fcbc78c40a1fbb190198451006.220x218x1.jpg"}], "artist": "DMX"}