{"songs": [{"title": "Get at Me", "album": "Infamy", "year": "2001-12-11", "lyrics": "[Man talking]\nI saw him, I saw him\nThere he is right over there, over there(I see him)\nOkay...I got a message for you infamous\nYou tell that son-of-a-bitch he's made a big mistake\nAnd you tell him personally...from me!\nAnd stay outta here!\n\n[Havoc]\nYeah, that's what I'm talkin about...\nReal loaded, in the flesh\nAnd we know where we aimin\nCheck me out...\n\nYo, you'se a baby boy rapper, breast-fed nigga\nI'm a quiet murderer, in front the feds type nigga\nDo my dirt quicker from my early days swifter\nWith the gat, I'm like Basquiat paintin that picture\nListen to the words, take it as a jewel\nIf I'm fuckin your 'burb, just maintain cool\nCause I won't take a L, whether in your crib or the outside world\nCause the pound clap well, like fan mail\nChoose to ignore me, the warning that I gave 'em\nGet at me, you and what army?\nThe fashion-ass niggas you hang with, have a plate of graveshift\nMan down, nigga it's the same shit\nNiggas like kids and I don't play with 'em\nGo get your father, nigga, the smart decision\nAnd I'm picking niggas off with the sharp precision(pow)\nNiggas need to see the wis' because they heart is missin\n\n[Hook]\n[Havoc (Prodigy)]\n(Get at me)\nNiggas wanna clap me\nSnitches wanna rap me\nPut it right where they back be\n(Get at me)\nNiggas wanna clap me\nSnitches wanna rap me\nPut it right where they back be\n(Get at me)\nNiggas wanna clap me\nSnitches wanna rap me\nPut it right where they back be\n(Get at me)\nNiggas wanna clap me\nSnitches wanna rap me\nPut it right where they back be\n\n[Prodigy]\nYeah, nigga what's beef?\nShotties and macks, little two-shots\nFour pounds and techs, arms and chest\nBag your strength, nigga them bombs and fists\nKnives and forks, ain't no time to think, it's on\nJust move on them niggas with excessive force\nAnd don't stop 'til them niggas don't move no more\nBroken hands, nuckles and gun handles\nDunn got his gunshot wounds through his mantle\nInformers tell when snitches snitch\nFuck them, buck more shots, get out that bitch\nCribs is found, careful when the kids is out\nTorch your house, stalk your kin, bitches and friends\nIt get deeper than deep, dirty and foul\nFuck liquor, for my nigga, we gon' pour some blood out\nIt's fucked up how it goes down, innocent people blown down\nMy niggas is here, brace yourself\n\n[Hook]\n\n[Man talking]\nNow we all get to know what it's like...\nWhen some asshole's gonna step out of the dark\nAnd blow your head off...\nI want you to know what it's like to live that way\n\n[Prodigy]\nFirst of all, we the one and only...infamous\n(It's a dirty job but somebody's gotta do it)\nFirst of all, we the one and only...\n'Til the name wear out", "image": "https://images.genius.com/1e1ebfd1f79138a02b3cbced2c28bcf7.800x800x1.jpg"}], "artist": "Mobb Deep"}