{"songs": [{"title": "No Games (Remix)", "album": null, "year": null, "lyrics": "[Intro: Rick Ross]\nSay no names, play no games\n(Ain't no bottles on yo table, pussy boy go hey yo gwalla)\nREMIX! Untouchable Empire, yours truly\n(We some rich ass niggas and surrounded by these models)\nMasterMind, Meek Milly, Wale\n(My vehicle foreign, I'm buried in foreign)\nThree rich young niggas, and Future, rich young niggas\n(And I go hard for that paper)\n\n[Hook: Future]\nCan't play no games with these niggas\nCan't play no games with these hoes\nThey treat us like the Goodfellas everywhere that we go\nNo games, no games\nNo games\nCan't play no games with these niggas\nCan't play no games with these hoes\nThey treat us like the Goodfellas everywhere that we go\nNo no no no no no no no no no no noooo, no no no no no no - no games\n\n[Verse 1: Rick Ross]\nHUH! Remix! Remix! (WHOOP!)\nWe got the streets screamin' God loose\nGame on base, no sitter (HUH!)\nLook we the shit! We the shit (HUH!)\nWHOOP! WHOOP! WHOOP! WHOOP!\nAin't no bottles on your table, pussy boy go get your gwolla\n(Niggas slide, niggas ride, huh?)\nHustlin' is a habit and we might not see tomorrow\n(Niggas wanna take mine? Check)\nThe world is yours, I've got them calling me Tony\nDouble M on the top, nigga we bigger than Sony\nIf you step on my toes, I write your name on my wall\nHe claim that he a soldier, fold up a flag for his momma\nI've got gold in my blood, born a son of a king\nI'm as real as they come, oh it's a wonderful dream\nOn the phone Farrakhan gave me my first Quran\nWe joined hands, said a prayer, may Allah bless the don\nAin't nowhere to run, already sold out the seats\nWe been them niggas, better go ask them freaks\nLipstick on my cheeks, extortion all through my vows\nThey say it's suspicious all this money I found\nGo give me the crown, you niggas been in denial\nWe the hottest niggas out, my nigga Kanye'll vouch\nThe devil in a dress, Rozay in the chest\nPush it to the limit it's a OG in the flesh\nCountach on the prowl Lamborghinis I fiend\nFerrari addiction bitch it's a wonderful thing\nI need me a needle cause Double R like to lean\nMastermind on the way, top of 2014\n\n[Hook]\n\n[Verse 2: Meek Mill]\nOkay! Petticoat is in that Rafe, heard her say I look like steak\nAll these fuckin' ass fish, nigga take a look at my face\nI was never known for rentin', nah, gon' and take a look at my plate\nPaper taggin' when I mash, glide, do it like a nigga on skates\nI don't even think they see me, hoes disappear, Houdini\nI get what I wanna, you would think I own a genie\nIf I ain't on my corner, probably on your TV\nPimping these hoes like Joseline, \"why you do that Stevie?\"\nPlay no games with these bitches, they treat me like I'm Tony\nI put cheese on you rats, get hit with that macaroni\nBout them collard greens all these rappers be acting phony\nYou sold your soul for some food and went broke, now you salty\nYou want your cornbread?\nGive me that, give me that, get me that, niggas that's old bread\nSpending that, flipping that, get it back with my old heads\nSmall face hundred, my nigga we call that more bread\nYou don't want me goin' in! Meek Milly\n\n[Hook]\n\n[Verse 3: Wale]\nUh.. niggas talking reckless, but they barely moving records\nNiggas talking Rayful, but can't even move a pebble\nBANG, BANG, BANG, BANG, BANG! WHOOOO~! (Duck!)\nBANG, BANG, BANG, BANG, BANG!\nThey shooting at whoever\nLook, I ain't tryna be no killer\nBut I know I got beaucoup of 'em that's with me\nD'Ussé on that Rémy, quit 'em if they linger\nYou get them Jordan feet, I give these hoes Mutumbo fingers\nBANG, BANG, BANG, BANG, BANG!\nToo raw for these niggas\nWale Folarin, I'm playing them all\nLike A-Rod to these niggas\nAnd I pick 'em apart with that flow\nAnd my car beyond what y'all drove\nAnd I got a few top optional, every night is Marti Gras, ho!\nAnd I heard your boy this scared ho\nSo we down in Florida Joe we ain't playing no more\nI'm finna bully you artists, being Incognito\n[Outro: Future]\nAin't no bottles on your table, pussy boy go get your gwalla\n(Remix! Remix! Remix!)\nHustlin' is a habit and we might not see tomorrow\n(DJ's all around the world, Double MG, le'go)\nAin't no bottles on yo table, pussy boy go hey yo gwalla\n(MasterMind, Double M, Tracy T, Fat Trel, Stalley - WHOOO!)\nWe some rich ass niggas and surrounded by these models\nMy vehicle foreign (we the richest) I'm buried in foreign (WHOO! Let get it, get it)\nI put all that on ery'thang (get it, get it), my niggas is some savages (WHOO! Get it, get it - BANG!)", "image": "https://images.genius.com/6929169de7116d41676151bdea5cc773.1000x1000x1.jpg"}], "artist": "Meek Mill"}