{"songs": [{"title": "State Your Name, Gangsta", "album": "Westside Story", "year": "2004-09-28", "lyrics": "[Swizz Beatz (Game)]\nState your name, gangsta (The Game)\nWhere you from, nigga? (Westcoast)\nYou gon' hold it down? (Like we always do around this time)\nEnough said, nigga!\n\n[Game verse]\nI ain't leavin' mothafucka I'm back\nYou been away too long, I can't do nothin' 'bout that\nThe 'hood askin' me \"why do Bleek a tragedy?\"\nAnd drive over Brooklyn bridge with Cassidy\nI drove down Flushing, in the Rove down Flushing\nThe 'hood show me love like I was Hov down Flushing\nCompton's most with the Yonkers flow\nAnd I got love for Queens and the Bronx, fo' sho'\nGot Swizz blowin' that Cali dro, mo' fucka\nAnd I get off shots like Alimoe at the Rucker\nYeah, the bird flipper in Houston with the syrup sipper\nI'm nice around mics, word to Pippen\nGot a mean knuckle game, I learned my dippin'\nIn '87 when Tommy Hearns was stickin'\nI hear niggas dissin', why you have to use Jay\nLet that man retire mothafucka it's a new day\n\n[Swizz Beatz (Lil Flip)]\nState your name, gangsta (Lil Flippa)\nWhere you representin'? (Houston)\nYou gon' hold it down? (You damn right)\nEnough said nigga!\n\n[Lil Flip verse]\nI'll take you back to the block, them automatics are cocked\nTry to snatch my watch, your dumb ass gettin' shot\nI got the block on lock and when the shit get hot\nI'ma switch up spots, oh boy\nI'm breakin' bread with my homies, I'm bustin' lead at you phonies\nFuck your bitch when she lonely that's every other night\nI'll flip your wife with a dream, they call me Hustle Man\nNigga my money too big for a rubba band\nI'm a veteran, givin' fiends they medicine\nI'm in Compton with Game bumpin' \"Let Me In\"\nMy nigga Will in the pen, he 'bout to come home\nHey tell these niggas I made a million off a ringtone\nI got a Spring home down in Tampa Bay\nI was raised off of Scarface and UGK\nNow it's my turn, I want that Puff money\nMatter fact, that ain't even enough money\n\n[Swizz Beatz (Cassidy)]\nState your name, gangsta (Cassidy, nigga)\nWhere you representin'? (Philly, Pistolvania)\nYou gon' hold it down? (You already know)\nEnough said, nigga!\n\n[Cassidy verse]\nThe streets wave ahead Cass cause they know the industry fear Cass\nI got these chicks cryin' like tear gas\nUsed to sell dirt weed, couldn't even put it in clear bags\nBut years passed, now my thugs puffin' like air bags\nYou might see me out in Houston, on Flip' block\nWith a sick watch, in an old school drop with a ripped top\nForget it, I got shit locked, nigga my shit hot\nI'm the best that did it since Big Pop\nOut in the west coast with Game I let the toaster bang\nOr cut you more times than the cards in a poker game\nCause most you lames wanna solve my battle with Free\nAll y'all wanna battle for free\nSee if you ain't got millions to bet or put your deal on the desk\nYou ain't real and I don't feel you a threat\nSo I suggest you get off my dick and go vote or somethin'\nBefore you get the sawed off and tossed off a boat or somethin'", "image": "https://images.genius.com/1ad09183037387ba5cd65b9cf8ed83e7.500x500x1.jpg"}], "artist": "The Game"}