{"songs": [{"title": "Take it Off Part 2", "album": "It Ain’t Safe No More...", "year": "2002-11-26", "lyrics": "[Busta Rhymes - talking]\nYeah .. Come fuck wit us ..\nYeah, ya'll know what to do to this shit\nYeah, haha, streets\nWe bout to do it again\nWe bout to do it again\nWe bout to do it again niggas\nI hope ya'll ready\nCheck it, check it, c'mon, WOO\n\n[Busta Rhymes]\nCheck out the technique\nC'mon, spit flow and bag up the next freaks\nSoldier wit a quicker ho that a live on the next street\nOver playa then do this shit again next week\nGettin this paper, phat chicks up in the next Jeep\nProbably listen closer if you let the check speak\nI keep fire cause niggas respect heat\nLook, I spit fire then come up the best beats\nI said I pull the spot from here way down on South Beach major\nGlobalize, then blow down a South Beach ager\nCheck it, banana yellow G wagon for the whole saggin\nFeel the fox mink draggin on the floor watch it\nYou really need to stop\nJust copped the rob blueberry Lamborghini drop\nC'mon, stay struntin with the mini bop\nNiggas know when we step in the place, the whole city stop\n\n[Hook - Busta Rhymes] (Meka)\nBetter tell 'em if they ain't know, put 'em on shorty\n(We know how you be doin it baby) How we be doin it baby\n(We know how you be takin it off) How we take it from 'em\n(We know how you be killin 'em baby) How we killin 'em\n(We know how you be ready to ball) c'mon, c'mon, you know we ready to do it\n(We know how you be drivin 'em crazy) Make 'em crazy now, c'mon\n(We know how you be breakin if off) You know we breakin it off, let's go\n(So come and get it down for me baby) Put it down now\n(And make it hot 'til they take it off)\n\n[Busta Rhymes]\nThis is a shake down (c'mon)\nWeakin your whole shit ' til it break down (uh huh)\nSpeak to the whole clique 'til we take down dudes\nPut the heat to 'em make them put the cake down dude (dude)\nScrape down food (food), niggas stay hungry 'til the shit is over\nSpit and make the tape sound rude\nHa, niggas get screwed, see they ain't really worth not a thing\nBut only gettin on the stage to get booed\nKennedy loft hoes mackin at the top of the Trump Towers\nRockin fly Versace, cherry cloth robes (robes)\nLike ghostface the most ready just for the glow\nShowcase the most, them niggas sure to blow\nNo waste a time, you know we sure to grow\nI'm sayin no place a mine, is for them corny hoes\nC'mon, with all this paper and the shit we copin\nWe keepin it gully and know we always keep it poppin\n\n[Hook]\n\n[Break - Busta Rhymes & Meka]\nHa, get that money\nCome fuck wit us\nHands in the sky\nKeep on livin\nDo your own thing\nAll my people holla and let me hear ya reply\nSay take it off (TAKE IT OFF)\nSay take it off (YOU BETTER TAKE IT OFF)\nSay take it off (TAKE IT OFF)\nSay take it off (BETTER TAKE IT OFF)\n\n[Busta Rhymes]\nC'mon, ha, we hold a rock boy\nThe way we on fire call a nigga hot boy\nHot, we raise the level to we blow the spot boy\nAnd watch the water boil and spill over the pot boy\nListen, I hope you know you need to stop boy\nFrontin and tryin be somethin you not boy\nListen again we keep on bangin and pissin 'em off\nSpazzin on niggas until we silence or finish 'em off\n\n[Hook]\n\n(*skit after the song is over*)\n\nMale: Yeah\nFemale: Wait, wait, wait hold on\nM: Come on let me put it right here, what you doin? What you doin?\nF: Hold on, hold on, wait, wait, wait, got a rubber?\nM: I don't need no rubber, you look clean, wait the fuck you ain't go no pimples or nothin\nF: Na, na, you ain't runnin up in here without no jimmy\nM: Ah, you fuckin actin like that\nF: You better find one\nM: Aight so, aight so, hold on, hold on, don't yo\nM: Just stay, just like that, don't even, just stay\nF: I'm not leavin\nM: Aight cool, hold on, hold on\nM: I knew I had a condom what the fuck man (*crinkling noises*)\nM: Where the fuck is a condom when you need one?\n(*sounds of a horse galloping*)\nTrojan Man: It is I, Trojan Man! (*echo*)\nM: Oh shit, oh thank God it's you, you got a condom man?\nTM: No, I only have one trick cover left, and my hormones are risin\nTM: And I want your bitch to taste it (*echo*)\nTM: Trojan Man! (*humming sound*)\n\n[Man talking]\nThis has been a paid advertisement by Flipmode and Company\nAnd I don't give a fuck what you say\nCause I still believe you could catch AIDS from tongue kissing a bitch\nSo remember always strap your shit up (*echo*)\n\nTrojan Man!", "image": "https://images.genius.com/cc9251ac994bbe401044c52cb51d1e49.1000x1000x1.jpg"}], "artist": "Busta Rhymes"}