{"songs": [{"title": "I am who am (killin’ time) - live in london", "album": null, "year": null, "lyrics": "I'm posing a question, how many been empty and holding aggression?\nClose to depression, open your eyes and just focus a second\nFucking recession my brother my mind's always moving I'm letting it go\nKnow that I'm pointing at negative energy, telling me stop\nThey're telling me no, don't\nYour aura is something you ain't even sure of\nExplore the core of California, hoes got more to snort up\nI've had a smorgasbord pornographic thought\nThat's a lot, the feeling come after the shock\nPraise me I'd rather you not, cause\nIt's driving me crazy the fact that you pay to make me into something I love\nYou come to the club searching for drugs, drunk\nFucking these sluts\nGod loves me, what if he does, what does it mean?\nYou're wasting away doing nothing, you're fronting\nWhy ain't you chasing your dreams?\nWe wonder 'bout life but none of us wanted to learn\nThe money we earn is something to burn\nWhy won't they give me a turn--out?\nFeed the hungry and clothe the naked\nYou're mistaken the world is cold and it's lonely ain't it\nWhen 'em high roller homes in Vegas\nRaid them with some home invasions\nContaminating the place with plague, we just saved the day\nI waste away in a room spitting these raps\nYahweh put the world in my hands and I'm giving it back\nForfeit in the war, he lays a sword down and walks away\nGrabs a 40 from the corner store and begins to contemplate\nDealing with death like you work in the morgue aborsving the souls\nForgotten, he lost his way\nStarring down that barrel, thinking not today\nLife's so precious, Lord knows life is so precious\nFight to the death, til' there's nobody left\nYou're holding your breath because you might get infected\nI'm animalistic, is mentally thinking I'm going ballistic\nBe specific, to those who in control we all statistics\nMisogynistic with a twisted mind, I'm intertwined\nMy trigger finger itching, all I kill is time\nInitial symptoms is schizophrenic behavior\nThe mind is like religion, can't agree on who's its savior\nThe newest flavor of superhero, I'm shooting lasers\nExcept I'm cool with Vader and blowing up rooms that's full of strangers\nA news anchor, the youth can relate to, it's nature\nIf you're a hater, I'll deal with you later, no thank you\nI'm just your neighbor, please don't do me no favors\nReally doe, come on homie we major\nI waste away in this room spitting out raps\nYahweh put the world in my hands and I'm giving it back", "image": "https://images.genius.com/70b2ca5e1882a2f184d45a2e6ccb37eb.916x916x1.jpg"}], "artist": "Mac Miller"}