{"songs": [{"title": "Tha Truth (Quavo Speaks On Robbery)", "album": null, "year": "2014-11-24", "lyrics": "[Intro]\nI understand, but this is my proposition for y'all. When you came out that mothafuckin' studio, that was one time I almost got killed. (Yup) Yup, I know that. So it's 5 other times that I almost got killed and listen here, my blood brother...\n...And I know who got the 3 piece, Fat Trel, he got that 3 piece chain (We know, we know who got that too, we know all that) So do [?] got that or no?\n\n[Chorus]\nLil' boy don't play with me, lil' boy, lil' boy don't play with me\nLittle boy, never been a gangsta, lil' boy don't play with me\nSmall, lil' boy don't play with me, wipe that lil' baby\nLil' boy don't play with me, small ball, fuck nigga\nDo you know who I am? Lil' boy don't play with me\nHead honcho, you think you can come up off me\nDon't you dare play with me\nPeon, you thinkin' that you can come up off of me\nLittle boy, don't you play with me\nDon't play with me, lil' boy don't play with me\nDon't play with me, don't you dare, lil' boy don't play with me\n\n[Verse]\nLil' boy, can't handle the pressure\nCause the world know you got the QC pendant\nLook at him scared in the interview\nGot him shakin' out his britches\nI'ma tell 'em how it went down\nNigga jumped off the stage, started walkin' through the crowd\nI'm the last one walkin' through the door\nSo they took the opportunity to hit the lick now\nOne nigga tried to go snatch it\nHit him with the Hennessy, broke the glasses\n'Nother nigga grabbed my chain, then he ran to the left\nWhat type of real street nigga leave his partner by himself?\nMy chain gone, it's all good though\nYou just made me re-up on pot of gold\nBut don't think this shit is all good though\nYou might as well hide in a spider hole\nPotato on the snub nose\nCall my niggas Migo Idaho\nYou fuckin' with the wrong rappers, mane\nWe know your address and we got your name\nAll this for a QC chain?\nLike your mama say, boy you in hot water\nPut him on the menu, put him on the plate\nCause Quavo wanna make an order\n\n[Chorus]\nLil' boy don't play with me, lil' boy, lil' boy don't play with me\nLittle boy, never been a gangsta, lil' boy don't play with me\nSmall, lil' boy don't play with me, wipe that lil' baby\nLil' boy don't play with me, small ball, fuck nigga\nDo you know who I am? Lil' boy don't play with me\nHead honcho, you think you can come up off me\nDon't you dare play with me\nPeon, you thinkin' that you can come up off of me\nLittle boy, don't you play with me\nDon't play with me, lil' boy don't play with me\nDon't play with me, don't you dare, lil' boy don't play with me", "image": "https://images.genius.com/2f422412bdb2b9b9e064a6a557063c45.260x260x1.png"}], "artist": "Quavo"}