{"songs": [{"title": "The Phuncky Feel One", "album": "Cypress Hill", "year": "1991-08-13", "lyrics": "[Intro]\nAre you ready? Ladies and gentlemen, all ready to get down?\nAre you ready? Ladies and gentlemen, y'all ready to get down?\nLadies and gentlemen\n\n[Verse 1: B-Real]\nWell I'm the Real one, yes the phuncky feel one\nCypress Hill has come, any questions ask them\nCause we are answerin', any brothers that've been\nOn the dick swingin', and straight gatherin'\nEnter all the info, cause yo what you're in fo'\nIs a crazy day, strapped in a pimp mode\nTrapped like a prophet, but I still profit\nEven when you're off it, bank's in my pocket\nCause of my music, what you call me chumpy?\nIn my trade, the Tribe is known to get funky\nHif is here to hack you down, Son is here to buck you down\nJoke's on you, cause you're the biggest duck in town\nYou've got to relax, we got to kick back\nBrothers just sit back, enjoy me like a six pack\nAs I let the rhyme flow into the hook, yo\nWhere you gettin' took, but that's another story black\n\n[Hook: B-Real]\nCause I'm the real one, yes the phuncky feel one\nI'm the real one, yes the phuncky feel one\nI'm the real one, yes the phuncky feel one\nYou know I'm the real one, yes the phuncky feel one\n\nPhuncky, phuncky, phuncky, phuncky\n\n[Verse 2]\n[Sen Dog]\nNight in a stiff lock, hangin' up the pimp's jock\nUsed to call me Pimp Poppa, specialize in hip-hop\nCause I'm down with Cypress, illin well I might\nBegin to take your girl, your girl she's the flyest\nFlyer than the other broad, hookin' on the fish rod\nIsn't that odd, instead of sayin' my dick's hard\nIt's not about knockin' you, do you feel like clockin' loot?\nForget it, act stupid little sucker I'll be clockin' you\n\n[B-Real]\nWith the right or left hand, duck they was still stand\nTroopers on the side step, bucks him down to death man\nWith the greater lyric, if you can spare it\nJust an ass kickin', is what you inherit\nSo don't try to snake off, you know I can't be shook off\nWhy the suckers took off? Well that's another story black\n\n[Hook: B-Real]\nCause I'm the real one, yes the phuncky feel one\nI'm the real one, yes the phuncky feel one\nI'm the real one, yes the phuncky feel one\nYou know I'm the real one, yes the phuncky feel one\n\nPhuncky, phuncky, phuncky, phuncky\nPhuncky, phuncky, phuncky\n\n[Verse 3: B-Real, Sen Dog]\nStandin' on the corner, close to the real estate\nHomes I really feels it get when brothers try to imitate\nMeanin' when they simulate, but they can't stimulate\nLike a fatty joint, straight from the breath I take\nMake me act loco, then switchin' up my vocal\nOut to catch you so-called MC's with a roll call\nThen you gotta close your eyes, you can't stand the sunlight\nThere is just one light, the Tribe's buckin' heads tonight!\nBuck buck buck ya head! Sorry that Fred is dead\nDeader than a doornail, someone cold made his bed\nDidn't just break out, the sucker got cracked out\nHit the pipe and blacked out, with the shit from back down\nSo much more integrity, greatest deal I hook up\nWas a funky looker\nBut that's another story black\n\n[Hook: B-Real & Sen Dog]\nCause we're the real ones, yes, the phuncky feel ones\nWe're the real ones, yes, the phuncky feel ones\nWe're the real ones, yes, the phuncky feel ones\nYou know we're the real ones, yes, the phuncky feel ones\n\nPhuncky, phuncky, phuncky, phuncky\nPhuncky, phuncky, phuncky, phuncky", "image": "https://images.genius.com/13fe06627cbf207bcab92ad1a06d9aa2.1000x967x1.jpg"}], "artist": "Cypress Hill"}