{"songs": [{"title": "Thank Me Now", "album": "Thank Me Later", "year": "2010-06-15", "lyrics": "[Hook]\nYou could thank me now, go 'head\nThank me later, yeah I know what I said\nBut later doesn't always come so instead\nIt's okay, you could thank me now\n\n[Verse 1]\nMahalo from the hardest act to follow\nLately I've been drinking like there's a message in a bottle\nAlohas to women with no ties to men\nThat I know well, that way there are no lies\nYou can thank me now for all the info I give to you niggas\nI'm on the brink of influential, I'm here for you niggas\nI guess a hit doesn't add up to a career for you niggas\nI must have been hard to watch, what a year for you niggas\nIt's December 31st and we in Miami just meditating\nYou got your resolutions, we just got reservations\nLiving out a dream it feels like I stayed up\nAnd we just want to party, Patron straight up\nFuck that old shit, I'm on new things\nOVO Clique, Red Wing Boot Gang\nYeah we want it all, half was never the agreement\nWho would have thought the route we'd chosen\nWould ever end up the scenic?\nI can relate to kids going straight to the league\nWhen they recognize that you got what it takes to succeed\nAnd that's around the time\nThat your idols become your rivals\nYou make friends with Mike\nBut got to A.I. him for your survival\nDamn, I swear sports and music are so synonymous\nCause we want to be them, and they want to be us\nSo on behalf of the demanded and the entertainment\nThat you take for granted, you can thank me now\nAnd oh my goodness you're welcome, you're welcome\nAt this point me is who I am trying to save myself from\nRappers hit me up and I never know what to tell them\nCause they think that I can help them\nGet back to where they fell from\nBut drink up, cause everyone here is good tonight\nExcept the niggas that I came with, they good for life\nThat's how you know it's going down\nIn case another chance never comes around\n\n[Chorus]\nYou could thank me now, go 'head\nThank me later, yeah I know what I said\nBut later doesn't always come so instead\nIt's okay, you could thank me now\n\n[Verse 2]\nShallow nigga but deep enough to have gone swimming\nI think I'm spending all my time with the wrong women\nI think I'll have a chance at love and knowing me I'll miss it\nCause me dedicating my time just isn't realistic\nMan, the good girls went silent on me\nThey got a boyfriend, or left for college on me\nAnd all the bad ones I used to hit are friends now\nThat make me wish I had a little less mileage on me\nBut do I ever come up in discussion\nOver double pump lattes and low fat muffins?\nDo I? Or is missing what we had out of the question?\nI'm probably just the reason that you learned your lesson\nI got flows for the Marilyn Monroes\nWho was there before it all, I guess that's how it goes\nThey hear about your cons, but focus on your pros\nAnd love you for who you are from the bottom of their soul\nBut those same ones from your area will grow into women\nThat are ready to get married at hello\nBecause of what they allowed, where are they all now?\nI know they're somewhere watching\nSo I'm trying to make them proud\nSearching for the meaning, you'll find it next to me\nThey tell me I'm the hottest, guess we finally get to see\nI'm feeling like Nas, who am I to disagree?\nThey say the doors will open up\nSoon as you find the missing key\nThat's probably why I'm in this bitch shining\nJump up in the sky and put the stars into alignment\nI rep the ATF in case you need to be reminded\nAnd the bandwagon's full\nBut you can try and run behind it, I'm sorry\nPoolside drinking, Margarita rounds\nShout out to my city though I hardly be in town\nI'm the black sheep but Chris Farley wears the crown\nAnd I know life is just a game\nIn which the cards are facing down\nI'm in a world where things are taken, never given\nHow long they choose to love you will never be your decision\nAnd I'm aware that this could be the last time you listen\nSo while I'm still here in this position\n\n[Chorus]\nYou could thank me now, go 'head\nThank me later, yeah I know what I said\nBut later doesn't always come so instead\nIt's okay, you could thank me now", "image": "https://images.genius.com/f0994c69f0994bc6b307070ecb02d6cd.1000x1000x1.jpg"}], "artist": "Drake"}