{"songs": [{"title": "Money (Remix)", "album": "Room for Improvement", "year": "2006-02-14", "lyrics": "[Produced by Frank Dukes]\n\n[Drake talking]\nSouthern Smoke\nIt's Southern Smoke baby!\n(Money) Frank Dukes\n(Money) My man Nickelus F\n(Money) Ho! It's Drake. Southern Smoke\n(Money) This is the remix right here\n(Money) So if you got some (Money)\nPut ya hands in the air\n(Money) Southern Smoke\n\n[Verse 1: Drake]\nNow-a-days you sayin' that I should go Jermaine, I should go Pharrell\nEither or my nigga, make sure you don't get shelled\n(Right) Make sure your money's right and they do a promotion well\nSo you could get checks cut like Benedict in Ocean's Twelve\nThis ain't Brad Pitt, I gotta admit\nI'm sick of seeing chicks in that Louis V and that Plaid shit, cause it's a bad fit\nThey say my father lives through me, so this is just basically how my dad spit\nI know my cash come quick when it's sunny\nYou know a girl is special if I stick with her honey\nIf it wasn't for dummies chick would still have money\nAnd if it wasn't for money Nick would still have Skummy\nSo, guess it's kinda like a gift and a curse\nTo jip money is easier than liftin' a purse\nIf you pick the wrong mother who'll snatch you, run for cover\nA week later you might find ya click in a hearse, boy!\n\n[Hook]\nI, take time arrange that (Money)\nSome, kill just to claim that (Money)\nSwitch countries exchange that (Money)\nYou cannot get jack for freeee\n\nAnd my, proceeds and cash right (Money)\nThere's, no need to stash right (Money)\nGot the same, four G's from last night (Money)\nYou cannot take that from me, homie\n\n[Verse 2: Nickelus F]\nMoney’s the reason my best friend got murdered\nSo with that and my amounts tryin to make it just to burn it\nMilk the game, turn it to butter, look how I turned it\nNo chick shall get any of dis unless she earns it\nTake that dick, put to your lips and insert it\nWhere the hell is self-respect go when them checks show?\nYou sleep with them anywhere, hell is your bed for?\nYou always on your back, what the hell is your legs for?\nI know, walk that strip, get my grip\nThat new Benz’s comin out, put some 'umph' in your switch, trick\nPlus I need rims, diamonds and gems\nSo get up, do the hand job, and some head for him\nI got my mind on my money, and my money on your mind\nI’ll blow your mind all over the money that’s on your mind\nSo keep my dough off your head, fuck with do on your head\nNow you really got money on your mind, nigga!\n\n[Hook]", "image": "https://images.genius.com/c85f36c02060316fcec1ed423c60f0da.1000x1000x1.jpg"}], "artist": "Drake"}