{"songs": [{"title": "The Stretch Armstrong and Bobbito Show on WKCR October 28, 1993 (previously unreleased freestyle)", "album": "Illmatic XX", "year": "1993-10-28", "lyrics": "[Nas]\nAiyo, this is big Nas\nI wanna give a shout-out to my man Premo, you know?\nFrom Gang Starr, no doubt\nLil' Dap, Jeru, Melachi, the whole crew (Foundation)\nQueensbridge Crew, forty busters, shorty busters\nVernon Posse, Good Fellas, you know how that go\nMy man Ill Will rest in peace forever, God\nTragedy, MC Shan and the whole crew, you know how that go\nMarley Marl, and my man Big Bo locked up in the piece\nAnd my man Drawz, you know\n(Big Mayo chillin', loungin' at the crib, check it out now)\n\n[Bobbito]\nThe, the mic is open, yo\nOn the Stretch Armstrong showw, hosted by Bobbitooooooo\n\n[Verse 1: Nas]\nHow should I start this?\nHow should I begin, to sin?\nGrab the microphone and my rhymes'll win\nWheel of Fortune, spin, around\nCheck it out, I'm not a rap clown\nGet smacked down by the fuckin' four pound in your dome\nHit you with the nick plate chrome\nQueensbridge, that's my motherfuckin' home\nOff the top of my head, yo, I'm a blunt head\nPolice... Police want a nigga dead\nBut I'm not goin' out like that, black\nI kick the actual facts in solar\nCold as a Polar Bear, I swear, word to Will\nBut I'mma chill, rhymes'll kill\nNiggas know the style when I freak the profile\nAsiatic Child, yo\nGrand Wizard on the side of me\nGet on the mic and bless the M-I-C\n\n[Grand Wizard]\nAyio, but I'mma pass it off to my man Six-Nine\nKick it one time\n\n[Verse 2: Six-Nine]\nHey, yo, Six-Nine a true to life nigga\nYo, my style is iller, iller than Halle Berry's figure\nNiggas don't fuck with the Six-Niner\nShorty, watch your mouth, I smack you back in your vagina\nHere's the reefer, crack the Sunrise Tequila\nKill the Margarita, here's a 50, get some more cheeba\nThe ghetto trooper, so spark up the Bu-Buddha\nMy thoughts'll stay nasty like the underground sewers\nTo be the man, you gotta beat the man\nIt ain't nothin' startin' over here but nothin' mark my Timberlands\nYou want static? Let's have it\nNiggas who flow like the Atlantic will sink like the Titanic\nSince birth, I was thinkin' too fast\nMy first beef was with the doctor when he smacked me on my ass\nThe trigger man, I'm crazy like Sam\nMy skill's so ill like a white chick with a suntan\n\n[Verse 3: Nas]\nCheck it out now\nOne for the money, two for pussy and foreign cars\nThree for Alize, niggas deceased or behind bars\nI rap divine, God, check the prognosis: is it real or showbiz?\nMy window faces shootouts, drug overdoses\nLive amongst no roses, only the drama, for real\nA nickel-plate is my fate, my medicine is the ganja\nHere's my basis: my razor embraces many faces\nYour telephone blown, black, stitches or fat shoelaces\nPeoples are petro, dramatic, automatic .44 I let blow\nAnd back down po-po when I'm vexed, so\nMy pen taps the paper then my brain's blank\nI see dark streets, hustlin' brothers who keep the same rank\nPumpin' for somethin', some'll prosper, some fail\nJudges hangin' niggas, uncorrect bails for direct sales\nMy intellect prevails from a hangin' cross with nails\nI reinforce the frail with lyrics that's real\nWord to Christ, a disciple of streets, trifle on beats\nBut, chill! Bless the microphone and say peace\nSo, Sudan, take the microphone in your hand\nKick the flim flam\n\n[Sudan]\nSo, check it out\nI'm gonna give a strong shout-out, this is to my man Will\nA little somethin' I done wrote up for my man Will\nIt goes somethin' like this, it's called Rock-a-bye Homeboy\nCheck it out\n\n[Verse 4: Sudan]\nQueensbridge, when will the drama ever cease?\nI'd like to say peace, Willie, and rest in peace\nA cool brother who's all about justice\nI still can't understand how he left us\nWell... he's gone and life goes on, you know\nWe had a crew, but one by one we go\nMemories of his face that was full of joy\nRock-a, Rock-a bye, Rock-a bye homeboy\nReminiscin' with the brothers standin' on the block\nNever talked a lot, never was a big shot\nIt's so hard to say goodbye, a sad song\nAnd damn, I can't believe my man's gone\nDiggin' back in the days when we used to laugh\nNow its a memory that's haunted from the past\nPoor Willy, its a shame how the ghetto got him\nAnd word is bond - I wanna cry when I think about him\nThree bullets to his back on his own block\nNot a way to go, killed by the buckshot\nQueensbridge, wake and up and smell the air\nAnd stop killin' like a villain, like you don't care\nRemember Willie and the times we had with joy?\nRock-a, Rock-a bye, Rock-a bye Homeboy\nRock-a, Rock-a bye, Rock-a bye Homeboy\nQuensbridge style!\nRock-a, Rock-a bye\n\n[Verse 5: Jungle]\nMy skills are ill like the prez with a plan\nMy brothers run from Sudan then the Ku-Klux-Klan\nLike a kamikaze, Saddam Hussein then won\nFeel the buns of a nun, put tricks for funds and chill (Wooo-ooooh)\nI spill a verse so you can understand\nI kill rappers off quicker than a motherfuckin' Mic Man\nAnd when it comes to a battle, I stand out tall\nLike the man who played the man on The White Shadow\n\nOne two, one two\n\n[Nas]\nWhat you gonna do when the flavour's comin' after you?\nGrand Wizard, take my side\nGrab the microphone and I'mma rock it up like...\n\n[Verse 6: Nas]\nTo my man Jungle, dwellin' in the jungle\nWhere must we go? Where must we wander?\nDeep out the skies come the MC Nas\nNot to surprise, but to civilize\nAll the dumb men wanderin' around the streets\nListenin' to a nigga rappin' on fly beats\nI just kick the mad Phillie style\nGet buckwild 'cause you know my style\nI could run a word, kick it to a herd\nMake 'em turn into a rich man, increase the plan\nThe master plan, yo, I'm buggin' out\n'Cause the weed got me buggin', plus the Guinness Stout\nGrand Wizard, yo, you my physical\nWhy don't you mic the make, make the microphone miserable?\n\n[Verse 7: Grand Wizard]\nIt's the G, the G, the G, the G, the Wiz\nYou know that our culture's gone get theirs\nI got my man Nasty on the side of me\nMy man Six-Nine, you know we're not hidin', G\nI am the man that'll break it down\nI'll break it all down 'cause I got the sound\nI got Queensbridge backin' me\nThe Tec and everythin', I'm comin' strapped, G\nIt's like that, check it out, uh huh\n\n[Verse 8: Nas]\nYo, check it out, y'all\nMoney and murder, money and murder\nThe sick shit you heard comin' from my motherfuckin', my swerve\nThe words are poetic\nI sound energetic when I'm blunted or Moët'd\nMy microphone's upsetted 'cause I'm crazy\nNow you know, never lazy\nYo, I'm gonna get all the cash I can\nDon't give a fuck if I gotta shoot a policeman\nPluckin' a church and snatch a fuckin'...\nNah, can't be flippin' like that\n'Cause you niggas try to jock the style\nBut I left that shit to get the new shit to flow like the Nile\nNow you can't catch up, G\n'Cause I got the new styles on the M-I-C\nI keep gettin' newer, can't step to a\nNigga from the Bridge, so, you keep that shit\nAnd I'mma flip the script next year\nAnd my real name is Nasir\nCan't spell it 'cause I say it too clear\nThe alphabets are not enough words or letters to use\nWhen it comes to mics, I bruise\nI just go with the magical mystic flow\nNiggas don't know, that's word to the man Bo\nI get Illmatic with the style that's insane\nComin' out a fuckin' murderer's brain\nGrand Wizard, please take this mic from me\nBefore I bug the fuck out and wind up D-A-E-D\nWait, D-E-A-D, I'm buggin', fuck that shit\n\n[Various shout-outs]", "image": "https://images.genius.com/5e57ceaf08c8b768ebc49ce32f6b566e.514x509x1.jpg"}], "artist": "Nas"}