{"songs": [{"title": "Most Wanted", "album": "The Bar Exam 4", "year": "2017-06-20", "lyrics": "[Intro]\nLike, what are you supposed to do? Like you put your hands up, you tell 'em that you don't have a gun. The thing that America is telling our children, and this is the sad part, that black folks if you don't make me comfortable we will kill you\nAmerica's most wanted, don't try to apprehend him\nAmerica's most wanted (Ice Cube is back on the set)\nDon't try to apprehend him\n\n[Verse]\nYes, the rhythm, the rebel\nI'm broadcasting live on behalf of the glisten\nThat appears in y'all bezel, I've risen to level\nSo large, on my level with B.I.G\nI really mean it when I tell you \"get on my level\", you dig?\nGet it however you live\nThis is for censorship, pick a flow, switch the shit\nAlien, rapping at a packed-out stadium\nI'm prolly 'bout to sin like I got a late DM\nIf anybody or they friend try to flow against me\nPut some dollars on your pen like an ATM\nEvery window tinted, every minute look like 8 PM\nI'm so hip hop, I shit deluxe boombox\nI nut tunes, I spit Kurupt Moonrocks\nShell toe-top tens, watch the bus zoom by\nListen, if I ain't on your Mt. Rushmore of top spitters\nNigga, I am not with it, Ryan Rock different\nI ain't 'bout riches, I ain't Scott Disick\nI'm largely blessed, I'm always dressed\nI'm not fresh though, I'm Godly, don't call me less\nListen, chump, I spit it to pyramid, switch the front\nThe spirit of Egyptian ankhs, call me Neph\nNigga, my every alcoholic breath\nIs heavy like imagine tryna carry all this stress\nYour floss just preparing y'all for death\nSo God won't bury y'all bearing y'all regrets\nCarry on, I tote Goyard\nMy humble approach will boast for y'all\nMy hoe got more junk in the trunk than most tow yards\nAnd if I don't know y'all\nI'ma turn yo' voyage to bon voyage to bone lawyers\nThis one's for y'all niggas thinking you really big\nTie you up and give you the busy sig\nMy future wasn't always just so Truman\nTo produce checks, I have my little metro booming\nNever lose bets when it's time to shoot death\nI am G Money and Nino, I got the goose neck, now who's next?\nLavar Ball doing battle for my boys\nPlaying hardball with them crackers like I'm Floyd\nYou would never know that I'm annoyed, that's 'cause I'm a poet\nGrab a nigga neck and snap it just to add it to my story", "image": "https://images.genius.com/2627cc5445030d64606928667383564b.800x800x1.jpg"}], "artist": "Royce da 5'9'’"}