{"songs": [{"title": "Splash!", "album": "Members Only, Vol. 2", "year": "2015-10-31", "lyrics": "[Intro]\nBeatsbyasia\nYeah (get it)\nMembers Only, Volume 2 (Bitch)\nBitch, lil' bitch\nKnow we vool\nYeah\n\n[Pre-Chorus]\nYoung nigga just been waiting\nYour bitch Uber on the way - patience\nI came with the water (Water!)\nI done slid upon your daughter\n\n[Chorus]\nSplash, splash, splash, splash (Water)\nSplash, splash, splash, splash (Voot it, water, water)\nSplash, splash, splash, splash\nSplash, splash, bitch\nVoot up, voot up\n\n[Verse 1]\nSucky bloody bitch I'm Dracula baby\nPoppin' acid while I'm in the Mercedes\nFuck these bitches, bitch I'm all 'bout my payment\nFlow so hard like it was born from the pavement\nAnd she give me toppy sloppy like Joe\nMop that pussy - water wet like the floor (Ayy)\nLike a password bitch I go by the code\nCoca yielding, love to play in her nose\nHey, I just wanna sit up on that propeller boat\nHey, I just wanna rap and ship it coast to coast\nHey, smoking on fruity, call it the cantaloupe\nHey, made your bitch come here without a fucking robe\nHey, that bitch not an animal but got camel toe (Ayy)\nHey, I slurp it, I spoon her just like some Danimals\nHey, she poppin' for daddy now where her panties go (Ayy)\nHey, a nigga leaning like the Pisa Tower hoe\n\n[Pre-Chorus]\nYoung nigga just been waiting\nYour bitch Uber on the way - patience (Yuh)\nI came with the water (Water!)\nI done slid upon your daughter\n\n[Chorus]\nSplash, splash, splash, splash\nSplash, splash, splash, splash (Voot up, Voot up)\nSplash, splash, splash, splash\nSplash, splash, splash, splash (Whoo!)\n\n[Verse 2]\nChain on me swang like a swing (Swing)\nI just be doing my thing (Thing)\nJohnny Dang my jewelry bling (Bling)\nLike I'm Jordan, need a ring (Ring)\nPussy glazed , no Krispy Kreme (Kreme)\nFuck a triple, need a beam (Beam)\nHit a stain like Mr. Clean (Clean)\nBathing Ape or with the 'Preme\nBad lil bitch she a gook\nWhen she pop a xanny she don't give no attitude\nShe tryna suck my dick under water right in the pool\nShe told me it was easy, I told her lil baby vool\nLet's get it\nGripping on her neck like a noose (O)\nDirty daughter pull up like a Panamera coupé\nTold her splash down and she wet like soup\nTold her find the booth, blunts laced no boof (Hey)\nBoot up, pockets on fat just like a Buddha\nPull up on your hoe up on a scooter\nIt's Mr. Freeze no cooler\nApple iWatch with the ruler (Ruler)\nMosh pit throwing balls luda (Luda)\nFender bender call me Larry Hoover\nBoot up, boot up, boot up, tell 'em voot up\nHeadshot straight at the medulla (Pew)", "image": "https://images.genius.com/b81f00d2505729cc11f19a679e13a2cd.500x500x1.jpg"}], "artist": "Ski Mask the Slump God"}