{"songs": [{"title": "Stop Skeemin’", "album": "Keep Right", "year": null, "lyrics": "[Intro]\n{\"Stop scheming!\" - Milk Dee}\n{\"What more can I say?\" - Milk Dee\"}\n{\"Stop scheming!\"}\n{\"What more can I say? - Stop scheming!\"}\n{\"Stop scheming!\"} (x2)\n{\"What more can I say?\"}(x2)\n{\"Stop scheming!\"}\n\n[Verso 1: KRS-One]\nYo I'm, I'm here to see a friend\nHe came here last night about 12:10\nThe charge?  Well he killed his girlfriend\nHuh?  Fill this out - yo you got a pen?\nWhat time did I come in?\nYes, yeah I'll follow you\nOh there he go - yo whassup?  Man you went OUT yo!\nTchk, yo how you shruggin' your shoulders?\nYou lookin' at double life here soldier!\n\n[Joe - singing #1]\nTell me what was on your mind\nYou should've thought a second time\nNow you gotta leave your dreams behind\nFor life.. {\"What more can I say? - Stop scheming!\"}\n\n[Verse 2: KRS-One]\nSee that's what I'm sayin', you gots to change your attitude G\nListen to me, the judge seein' your case is a thirty-three degree\nMaybe you can find your pops, a thirty-three degree\nAnd see if you can be free by no later than three\nYo why you lookin' at me like that?  What'chu mean it's whack?\nYou got a six figure bail and not a dime in the sack\nSee I told you, one day you'd caught her last time creepin'\nYou shoulda just let her go but you couldn't stop schemin'\n\n[repeat 2X: Joe - singing #2]\nShoulda just walked away, walked away\nWalked away..\nNow they got you locked away, locked away\nLocked away.. {\"What more can I say?\"}\n\n{\"Stop scheming!\"}\n[Joe] Whoa-ohhhh!\n\n[Verse 3: KRS-One]\nNah nah, na nah nah nah yo listen man you ever heard of\nThe fact that you get one time for premeditated murder?\nUm, don't argue man just yesterday y'all were kissin and huggin\nWhat you lost your temper or somethin?\nHuh?  Yeah well killin a lady WORSE\nYou should always think FIRST!\nYo I'mma try to.. tchk here comes the C.O\nYo whassup time's up!  Yo I'll say whassup to your P.O\n\n[Joe singing #1]\n[Joe singing #2] - 1/2\n\n{\"What more can I say? - Stop scheming!\"}", "image": "https://images.genius.com/4f300314f4b269cd7479d10c0e1cab7e.1000x1000x1.jpg"}], "artist": "KRS-One"}