{"songs": [{"title": "For Nothing", "album": "Dedication 6: Reloaded", "year": "2018-01-26", "lyrics": "[Intro: DJ Drama & Lil Wayne]\nGangster, gangster\nDatPiff dot com, world premiere\nOkay\nYeah\nI'm reloaded (gangster grizzils)\nTrill outchea\nSo after D6, I text Weezy\nIt's rough\nI say, now it's time for a vacation\nGuess the iPhone autocorrected\nAnd he thought I said \"now it's time for a Dedication.\"\nNow you want it?  'Cause we gon' bring it y'all\nSo now y'all got a twenty pack\nWhat's your address?\nYou're welcome\nAnd not your email address neither\nD6: Reloaded\nFront door, leggo\nA Dedication!\n\n[Verse]\nLooking in the mirror, all I see is money\nBop-bop, but if I was blind, all I hear is runnin'\nPlug went to jail Saturday, 'posed to meet him Sunday\nHe said his bitch flushed the work, time to do some plumbin'\nGotta love the way we comin' though, we keep it comin'\nWolves never cry wolf and you could feed us onions\nPledge allegiance to the region that's beneath and under\nThe southside from your blind side, Stevie Wonder\nHunger Games, ain't no games when we speakin' hunger\nWe greedy fuckers, eat your supper, pick our teeth, and mug you\nThe pockets bustin' out the muscle, bitch, I'm bleedin' blubber\nAnd I been drunk and I can't trust you 'cause I'm seein' double\nAnd I been ballin' like the Rucker, nigga, triple-double\nAnd now it's war, and they want peace, but it won't fix the puzzle\nYou drop the ball, if you a beast you won't be quick to fumble\nIf I'm too deep then get a bigger shovel, dig a tunnel\nIf you a beast then that bitch can't get a nickel from you\nI'm the only one that speak when we in the huddle\nMake a pussy nigga leak, then jump in the puddle\nWe comin' deep to your street, 'bout to rent a shuttle\nEvery day of the week, if I hit the streets, I gotta hit a hustle\nEvery day of the week I gotta get loaded-loaded, skip the bufferin'\nI got it made, and with that said, I gotta tip the butler\nI like my bitches mustard, business hushed, and Bentleys custom\nBitches sufferin' 'cause the system fucked 'em, now they fuckin'\nThey can't hide their battle scars but they can hide their stomachs\nNiggas like Niagara Falls how their mouths are runnin'\nBut we making caviar out of flounders, guppies\nStand tall, but I'm a munchkin to my pile of money\nGot down and dug it, found a nugget, made a mountain of it\nDon't need a crown, gown, or nothing; I'm the king of subject\nChocolate, brown, cream, and fudgie, and I'm peanut buttery\nFuck the fuckery, I go skullduggery, it get ugly\nNiggas thuggin', we got babies smugglin' in their Huggies\nNiggas jugglin' different kind of drugs, Feds strugglin'\nSippin' Actavis, activist like Fred Douglass\nGoodnight, sleep tight, watch the bed buggies\nShe give me ass, she give me head, I call it head-buttin'\nWalk in a room full of buttons, press the red button\nBlow this bitch to shreds, get my skateboard and shred somethin'\nLead pumpin', you dead, pumpkin\nGo 'head, dump 'em, redrum 'em\nGoin' hard in the paint, Andre Drummond\nHeadhuntin', Good Will Huntin', still stuntin'\nAll or nothin', Warren G to Warren Buffett\nStormin', floodin', lightnin', thunderin'\nCarter comin', like karma comin'\nMy bitch pussy's the warmest oven\nNeed morning lovin'\nShe foreign, Donald might bomb her country\nThick as fuck, no panties when she got on her onesie\nWhoa\nTime to get this paper though\nYou ape or ho?\nBitches in line to get this snake fo' sho'\nWe take the dough\nIf they don't pay the dough, and that's fo' sho'\nWe make 'em vegetables, and we don't even like vegetables\nThese niggas extra broke, we break a nigga down to decimals\nWe up in México to see the plug, and not electrical\nHigh cholesterol, you niggas salty, I'm the pepper though\nYour bitch ain't half a ho, she wanna be in my next episode\nI'm a steppin' stone\nAnd that .380, that's my chaperone\nIt blow like saxophone\nAnd when the smoke clear I'ma stand alone\nI'm from the terrordome\nYeah, that's New Orleans, home of methadone\nCops on megaphones\nIt's so much bad luck, ain't no leprechauns\nI been called a stone, pocket full of stones\nOn the corner moving stones, Papa was a rolling stone\nI'm so stoned, in this bitch, waitin' on Babylon\nBible on the dresser, next to the gun and Tylenol, silence off\nSpike a bitch drink, like volleyball\nOlive Oyl skinny bitches can't get in the ride at all\nNot at all\nI'm involved in a real private war, time to brawl\nNiggas don't want Lil Tune to take these diamonds off\nI'ma talk crazy to a deaf nigga, these niggas blind\nI'ma still throw up my set, nigga, steel toe in your chest, nigga\n\"Hell no\" to a yes-nigga, \"Fuckin' right\" to a bad bitch\nShe can fuck around and get her ass licked\nStill can't get her ass kissed\nBlack fist, middle finger to taxes, the police and their actions\nI'm still pickin' out mansions\nStill dickin' down such-and-such, still fuckin' with so-and-so\nStill fuckin' my bitch's friends, never fuck my woadie ho\nStill talkin' about Hollygrove, still talkin' about coke and dope\nOn the set in that OVO, on the jet in that OVO\nI don't threaten, I go for broke, wanna step and go toe to toe?\nNo bullshit at this rodeo, and all my clips Pinocchio\nTunechi, bitch, for nothing, drops mic\n\n[Outro: Lil Wayne]\nWell, I can't technically 'cause it's connected\nBut, but, you get the expression, Mula\nWelcome, thank you for joining\nDedication 6, this some sick shit\nUmm, first of all, I wanna thank Drama for doing this shit again, and always doing this shit for his dawg. My nigga, one time. Thank everybody involved, everybody involved. My team, my team is my fam. Everybody who put they fingerprints on this shit, 'preciate everybody\nSo the definition of Dedication has changed for me since the first one, since the second one, since the third one, whatever. It's because, umm, whenever I put it out, umm, it's life. And since I don't write none of my shit, I'm coming from the head. And what happens is, when you rap so long or when you do it so long, all the things in your head, you done used up. So what happens is you gotta start using something else and coming from somewhere else, and that somewhere else is ten times out of ten your heart. And, umm, that's what this Dedication 6 project is\nBut, uh, yeah, the definition is always different because I'm always going through something at that time of my life, you know what I mean. I prolly was fucking your bitch on Dedication 4, and the whole fucking shit was dedicated to her, you know what I mean. I dunno. Whichever one that wasn't, that didn't do as well as all of the rest of them, that was definitely the one that was dedicated to her", "image": "https://images.genius.com/3622689a5172c789024942436b11dce2.800x800x1.jpg"}], "artist": "Lil Wayne"}