{"songs": [{"title": "10,000 Bars", "album": "SQ7/10,000 Bars", "year": null, "lyrics": "[Intro: Lil Wayne]\nGo\nWeezy Wee, bitch\nS-Q-A-D Siddeven, holla at us, underground\nMuhfucka, what you know bout Weezy huh? Holla at me dawg\nI got it, it's right here, listen\n\n[Verse 1]\nHolla\nI'm off the rocks squat the box dont rock the spot\nThe Sqad pop 'em I'ma fuck with the hottest\nDiamonds droppin’ temperature, bitch I'm one of the finest\nAnd to be honest, I got all these hoes stocked up like sinus, now who you fuckin'?\nIce shining colorful, like a sack of fruit or something\nWith no heart for bitches like ??? or something\nI be the true to nothing thorough nigga, young, raw, and famous\nGet money 'til I'm dead or 'til the day of my arraigning\nSpittin' game through the platinum smile\nYou can see the fuck I be saying from half a mile\nHow I hop out of the colossal Tahoe filled up with models\nPoppin' bottles with pussy poppers that gobble until they swallow\nSee I'm a pimp Playboy when it come to these hoes\nCause all I give is cum to these hoes and run from these hoes\nI comfortably roll in the latest sleepy eye Mercedes\nHeat up for the haters speed up for the ladies\nMiss, so watch your back, and watch your mouth cat\nWeezy shit, this our click\nYou 'bout that? I send my Sqad to where your house at\nAll of a sudden niggas gs, why the fuck is you trippin'?\nI cock and shoot up one of your knees, why the fuck is you trippin'?\nYou listening? I'm official pimpin'\nBe lowkey dippin', Range Ro' be twistin' on blades\nI'm O. J. Simpson, pretty limpin'\nBig fucking cannon, holding me back\nWith some shit from off the Discovery Channel on my back\nMy niggas drowned in smoke, underground, pound daily\nMy hoes like Nelly cause they go \"Down, down baby\"\nI used to dog chickens, cluck 'em, fuck 'em, and duck 'em\nBut now I'm more mature, I fuck 'em, fuck 'em, and fuck 'em\nStuck inside of the game for damn near two decades\nAnd I'ma make you see the insides like a x-ray\nAww fuck...\nHuh? Drunk off Cris', mami on e\nWeezy on e, mami cummin' on me\nThe diamond long links sparkle, tough in the light\nYou do a lil' something tonight, I buy you something with ice\nAnd I ain't stunting a price, shawty I can afford it\nI been had dough before I was recorded\nStarted to order you a Mercedes C 240\nBut I thought it would be more nice for you in a Ferrari, peep me\n\n[Interlude]\nIt's whatever, holla\nI ain't stopping, I ain't stopping\nCheck it, check it\n\n[Verse 2]\nMuhfucka bet' not fuck with this nigga\nI'm itching, clutching the trigger\nMuhfucka you can end up in a river, shit\nI'm like a tornado I’m twisted off of shit\nAnd my pistols off my hip but I give a shit about who I hit, fuck\nI'm fucked up, I'll fuck you up for fucking up\nGuns up like \"What's up?\", get your fucking guts cut\nTough luck bruh\nWonder why your bitch act stuck up?\nCause the slut got Weezy nuts stuck up in her fucking butt\nYung mack flip crack quicker than acrobats, get at me man\nLook call me Wayne a. k. a. Big Daddy Kane\nNigga can't tell me nothing 'bout the game\nBeen in that deep shit, every year I'm M. V. P\nIt's just in me\nRims on the 'Lac like 22 inches\nPlay with me, I open up your back like 22 inches\nGuerrilla pimpin'\nAnd it really isn't wise for niggas to start poppin'\nAt any given time them niggas could start droppin', peep it\nI'm off the strip muhfucka what you want?\nThis a freestyle coming from off the top out the trunk\nNiggas be like Mase and go to Church\nBut I go to the trunk and then I go to your shirt\nHolla at me, I'm the don bitch\nLook we can get it on bitch\nGotta get another rap to flow on bitch...\nHold up, aight, aight, aight\nListen, playa, all I do is get bread, I'ma head to them cowards\nAnd if they ever try me, I'll bring y'all the head of them cowards\nThis big spending, see the heads on them dollars\nIt's big pimpin', you see your bitch lipstick red on my boxers\nChoppers pop at any time for any given reason\nLeave 'em not breathing under cement for one disagreement\nFreedom, we ride on them bitches, rollin' through sittin' high on them inches\nMy mission's to make sure Squad get expensive\nAnd if anyone of you niggas better get defensive, your care will get intensive\nShot put humps on top of your head like Bart Simpson\nI spark instant, now who want it? I'll light your set\nCause I'm all about money cocksucker, my life a check\nI'm spectacular, I let the Tec tackle ya\nI spit 16 after ya like I rap with y\nPut your chest in the back of ya\nYou would think a truck hit 'em, it's Weezy, don't fuck with him\nBetter lock me up or get me to the graveyard quick\nCome and get me I spray, spark, spit, it's straight war bitch\nNiggas is hoes, like they take long dick\nI wave chrome shit at home, shit, make domes split\nAnd may I say these fake niggas on some Ray Charles shit, blind to the fact\n9 to ya cap, blat, put your mind in your lap\nI ride with the gat for hard times, crimes, and rats\nIt’s rhymes of the crack, my Sqad, I'll die for that\nI climb in the 'Lac, drunk off 190 ?\nDon't try me cat, I take this shit beyond the rap\nAnd this Ecstasy is why my eyes are black\nDon't like baby moms but the X make her thighs look fat\nBut fuck the bullshit I grind for scratch, I scrape and scruff, bake and cut\nYou hatin' us? We tape you up\nI spin ya corner make you duck from blazin’ bucks\nBandanas, braids, and cuts, I'm gangsta'd up\nMuhfucka\n\n[Interlude]\nOh, oh shit, oh shit\nWhat they want?\nI dont think they want Weezy. Do you think they want Weezy?\nCheck it, check it\n\n[Verse 3]\nLil' nigga pass slow in a S 430, ya ho be like \"That's so purty\"\nFuck with me I'll show your chest no mercy\nSqad get so dirty, but still we do it clean\nBring action to these fake ass niggas like movie scenes\nI pop so much X man I feel like Wolverine\nWake up in the morning, lips burning, can't move my spleen\nSee this lil' dude is mean, strapped up with tools and things\nI'll get you different drugs mixed up like Smoothie King\nThe heavy platinum jewelry bling over the white tee\nWatch your wifey, she's mostly likely to blow me pipey\nI'm so exciting\nMoney, murder, steal, kill, rape\nYou should do like the Internet and start to Bill Gates\nThis whole world gon' end up with some bad fucking tumors, listening to these Cash Money rumors\nI'll blast, bust, and shoot you, hit your block without the mask, fucking screw you\nTreat you like a bitch, bitch look at me while I do you\n\n\n[Interlude]\nOk, ok, homie, ok\nPeep it out, Squiddad\nLet me catch my breath, let the Danger track roll\nAnd let me holla at you, now let me holla at you, check it out\nS-Q-A-D\n\n\n[Verse 4]\nDon't fool with any niggas like me\nWe pull triggers like weeds\nSwigger off the Piña Colada\nDreams of having cream and the power\nYou need a problem? I'm the meanest to start with\nAnd got grams the size of the head of Gina on Martin\nFor any discomfort the Ninas is sparking\nBe in your apartment, many assault men and semi-revolvers\nKeep it clean, I'm a young Sqad street teen, only into green\nIf you intervene I'll leave your ass colder than Winter\nAnd y'all just look like bitches\nYou get fucked then I nut up\nAnd just like bitches, I leave you face down and butt up\nNigga what up? I just bought a record to say fuck Hip-Hop\nI spit it for them niggas who grip Glocks\nDip cops, flip rocks, and when the bricks drop\nWe fix blocks, suddenly watch the income\nFuck with me, watch the outcome\nNiggas don't wanna hear the Glock rung\n\n[Interlude]\nThat's that real shit, that's-\nK, ok, ok\nYea, holla at me, holla at me\nThis for all these niggas, you know me\nListen, let me tell you who the Sqiddad 7 is, bring it\nIt's Weezy Wee, Lil' Jay, Lil' Tez, Lil' Fee Fee, Lil' Yo, Lil' Sammie, T-Redd\nHolla at us, holla at us, holla at us\nCan't forget Bidd-Ugg-G, don't forget it\nCheck it, check it\n\n[Verse 5]\nPlayboy I pimp huge\nSee the whip cruise on big shoes\nSlide out the shit, cool, frostbit jewels like igloos\nSee Weezy gets loot, that be why your bitch choose\nBut dude, I ain't got nothing for her but some dick juice\nI stick tools in the pocket of the S. Q. leather\nThey gon' have to rescue this fella if he stress my pleasure\nI tells you once, I'm the don, you can trust my word\nI say with a Herpes dick, nigga fuck the world\nI be with niggas that could get me years\nI be with hoes and bitches that favor Britney Spears\nListen here, you see the Sqad Minked up, Platinum S. Q. linked up\nWith a freak that drink nut ‘til my dick shrink up\nYou think it's soft? Let the thing bust 'til I'm seeing pink guts\nNiggas watch them pigs come, they trying to sink us\nYou know who I be, Weezy Wee muhfucka\nI ain't gon' stop the flow until the end\nK we got a new game, I'm running, punting, I ain't passing the ball\nYou other niggas just be crashing the boards\nWith a team full of great players, but I'm a veteran, all-star\nAnd let's be real man, I'm better than all y'all\nI'm the truth, I'm the reason, I'm the meaning, I'm the shit\nI'm the alleged convict in any Sqad incident\nLast name Carter like Vince and shit\nBut I don't slam balls and goals, my life's money, cars, and hoes\nCadillac white walls and 'Bauds, pimpin' partna\nPlus I can get more work out than a fitness doctor\nLet's get this partna, I'm the young don these niggas honor\nAnd those of you who ain't cheap can't buy a vowel\nIt's cause the child's mom will eat me up like Jeffery Dahmer\nLibel to find my condom inside of dry vagina\nI'm kinda calm, drama goes with my persona\nA minor with intentions to harm ya, holla\n\n[Interlude]\nOk, ok\nSwitch it up right here, switch it up, switch it up\nListen, listen, take this money, make this money, get this money\nPuff holla at me\n\n[Verse 6]\nHomeboy it's Sqad shit\nIt's gon' be Sqad shit, swallow it\nHe who disrespect, hollows follow him\nFlash the pistol, watch 'em stop and pose like they modeling\nBlast 'em, watch em stop, drop, and roll like they firemen\nSeriously man, I got enough money to buy ya men\nTurn 'em against you and make 'em kill ya mom and them, don't fuck with me\nBuck 50 on the dash of the box but that's only approximately cause it really do like two ?, blue fire\nWrist looking like blue fire\nPiña Colada got me spiked like barb wire, Weezy Wee, Sqad rider\nHolla at me, you know you know me\nGot out the streets and start hustlin', there's still some fiends who owe me\nBlow me some dro, nah I ain't smoking I stopped that\nMy niggas still get puffed out, I catch the contact\nI'm kinda fucked up, fuck with me and I ain't gonna leave you kinda fucked up\nI leave you fucked up, believe this stuff bruh, it's Sqad shit, bitch\n\n[Interlude]\nOh shit, I ain't finished\nOh shit, I ain't finished\nI ain't finished Duke\nCheck it, listen\n\n[Verse 7]\nI come up from a shit deep town, where you hear sounds like \"Click\", \"Squeak\", \"Pow\"\nGet down or you dying, niggas tote iron\nGot that coke flying like birds, not the ones with feathers, I'm talkin' weight like birds\nAnd you might get served if it’s proper enough\nOr find your nerves on the curb if you a cop or something\nA baller blocker or something, I'll send your noggin a hundred\nHave the whole block sprinting, dashing, jogging, and running\nType of life I live, Gotti would love it\nSqad property buddy, some young niggas with a mafia budget\nCan't nobody put nobody above it\nAnd if they do, they find they body with your body above it\nFuck it, let's take it public, nah leave it the gutter\nFuck it, let's go and dump 'em, nah leave 'em in the gutter\nHustler, keep it thuggin', why the fuck you niggas buggin'?\nThe hot 9 slug it, dug inside of your fucking jucket (jacket)\nCall me Weezy you bitch\n\n[Interlude]\nOk, ok\nThe d. j. just informed me that I got 20 more minutes to rap\nHow the fuck I'ma do that?\nHolla at me, if you feel me holla at me\nSqad, I gotta talk to make some of the raps look more long, you know, holla at me\nI'm a real nigga, you know, you know me\nD. J. Riddaj Smoove\n'Bout to blow your head smoove off, cool off, dude you soft\nYou know me, let's go\nIs y'all ready? Check it out, check it out\n\n[Verse 8]\nListen, I keep the pistol hidden in the big pockets, hear shit cockin'\nBetter get flocking or get gotten\nDawg I speak with the gun, nigga's holla in the street like \"What's up?\"\nI tell 'em \"Chika buck buck chika, get the fuck\"\nThe droughts come bring the pots out, let's do what we do\nYou fuck with me I send more shots out than D. J. Clue\nNow who seeing me? Not a person\nGot a personal grudge with these commercial thugs\nNo studio with me, true\nI shine hard and I be flossin' very sweet\nBut I'm like Iverson dawg, I be ballin' but very street\nKeep my name out your yapper, or you gon' have to try to keep my flame out your cappa\nI ride around with like two bodies framed on the clapper\nThe tool cocked for he, do pop for beef, move out for chiefs\nSupply two blocks a piece two blocks a piece\nMy crew watch for cheese and I do stock my cheese\n\n[Interlude]\nDude, dude, who you know fucking with me man?\nCheck it, check it\n\n\n[Verse 9]\nWhat up world? This here your people Weezy, holla at the don\nReal nigga dude, I promise that to God\nWhen I swallow half the Dom I go loco, stressed, hoping I'm not cursed\nWalk around with TECs poking out my shirt\nNiggas show off for them hoes, try play hard, with they chest poking out they shirt\nTry me and I send shots, leave they chest poking out they shirt\nYes, expect the worst when you fuck with the Squad right\nPull you out your car at a stoplight\nCatch you in the waist, make you my height\nThis shit's not nice, I'll have you chopped twice for a hot price\nOr I can take off my ice and hit your block and stop life\nCan you see that?\nProperly under my seat is where the heat at\nDirectly in your head is where the bullets meet at\nI be that cat who make sure my Sqad ball gracious, 'til the Lord take us\nWe gon' all get paper, just stay faithful\nCross the gate bitch and we rape you\nAin't nothing sugar nigga we all salt\nFuck y'all and that's y'all fault\n\n[Interlude]\nHolla at us\nMan this Sqad shit is real, real biddig\nOoo shit\nI ain’t - oh, oh, oh\nCheck it, check it, check it\nFollow me\nListen\n\n[Verse 10]\nHomie I speak for the streets, scream for the ghetto, and holla for my folk\nDie for my Sqad, kill for my dough\nMy attitude is fuck bitches, fuck haters, fuck cops\nMy real father is a ho, my attitude is fuck pops\nI'm living it up in a nice home, riding in trucks, tough drops\nAnd I'm a young nigga, I don't even know how to do the bus stop\nBut I got my money right\nWhen I hit the club, make it a sunny night\nSee the fake flossers, bum ballers, is a funny sight\nWatching dudes front for these hoes in they Chevy right?\nPull up next to 'em in a 500 bumpin' Betty Wright\nKeep my shit spaghetti tight\nPlayboy put the hood on that\nWe buy sports cars and put the fuckin' hood on that\nMy bank got too hot to sit on so I stood on that\nAny place, you be careful cause I could own that\nMoët and E, I'm good on that\nYour bitch looking at me, I should bone that\nY'all niggas know where the fucking don at, holla\n\n[Interlude]\nHolla at me, Weezy Wee, holla at me, Weezy Wee\nYeah, yeah, yeah\nCheck it, check it, check it\n\n[Verse 11]\nS-Q-A-D S-H-I-T, that's what I represent 'til I die\nMuhfucka bust one in your eye\nFlip pies, I used to do that shit in like '95\nBut I'ma switch it up to '99, 2000, 2001\nI ride cars that's 2000 and fun\nYou know the motherfucking whip be cruising on shit, 22's\nAnd hoes be losing they mind, boy\n\n[Interlude]\nIt's about to come, it's about to come\nWhat y'all want? What y'all want?\nCheck it, check it\nFee Fee Favorite\n\n[Verse 12]\nFlippin' in a whippa\nPeel the top back like a zipper\nSkippin' on them chrome dip slippers\nRippin' on the lips of a stripper\nIf that's your bitch mister don't kiss her\nIf so you might as well kiss a pistol\nCause all I do is shoot off in her whistler\nShe finna get my name on her shitter\nAnd I ain't even hit her\nMy nigga Fat did her, and slid her to the rest of the Squidda\nForget her, another bitch just paged in\nWeezy blazing, come through in something amazing\nI ball so good I need a sports agent\nLook at me and squint your eyes like Asains, what's wrong?\nMy jewelry's like a white boy, always stoned\nI got a big home but I'm always gone\nThat's why your bath towels is always gone\nHoes I meet nowadays panties always gone\nAnd baby after I fuck I'm always gone\n\n[Interlude]\nI mean I got a wife at home, you know me, holla, ha, holla\nBitch I can't love you\nHolla, hahaha\nListen\n\n[Verse 13]\nHomie I go hard, push a whip with no hair on its head\nSo all I'm feeling is air on my head\nWith some ho that you might know, she sucking all the air out my head\nMeet you close to knock you square out your head\nSip the Cris’ to clear out my head and try to get my loot up\nIn Cuba with a translator ?? coke newer\nPlus the prices is cooler\nI come back through the hood with that dirty\nAnd tell 'em I'm like Tiger Woods, all I got is birdies\nGot bitches in they 30s calling Weezy poppa\nBut Weezy not daddy bitch, cause Weezy in and out ya\nWeezy never spouse ya, Weezy give shit about ya\nAnd Weezy don't Master Suite, Weezy living room couch ya\nHow about you be a good bitch, and take these pies I just cooked up\nAnd tape 'em to the pelvis, arm or your thighs\nI gets high 'til I can't focus\nBut a main focus to remain focused, they ain't focused, muhfucka\n\n[Interlude]\nHolla, shit, holla, oh shit, oh shit\nBoy, boy, boy\nOk\n\n[Verse 14]\nI spit it for them niggas who run the corner, palm the revolver with honor\nAny beefs involving homie, your momma\nHomie we swarm out the Eddie Bauer, thoughts to devour\nSpark and shower, we get more stupid than Austin Powers\nSmell the aroma of marijuana, Coronas when upon us\nWe do just what the neighborhood have shown us\nWe murder opponents and don't think about it, forget about it\nNiggas won't do shit about it\nWave the pistol, get the bitch up out 'em\nI'm off the hinges, chicks on my dick, proper than Cindy Crawford\nAny problems I pop the chopper and knock the appendix out him\nHit the block with bricks of powder\nWhat you know 'bout doing that?\nAnd splitting a key with flour, making it two in fact\nDawg I'm all street, if you want Hip-Hop, here's what I give you instead\nI'll make you hip out when them fuckin' bullets dig in your leg\nPositive niggas talking spooky, y'all ain't scaring nobody\nY'all love Mos Def, I love fucking John Gotti, holla\n\n[Interlude]\nYeah, yeah, yeah\nAight\nListen\n\n[Verse 15]\nI wish that there was no taxes, no cases, no police, and no racists\nNo rapists, wish they had a 700 Mercedes\nWish my Sqad live happy\nI wish my kids grow stronger than me\nI wish my momma live longer than me\nI wish the cops stay off the corner this week\nI wish the gutta, ghetto neighborhood hunger would cease\nI wish them niggas who ain't got shit would stop hating on niggas who got shit\nAnd you know I wish for Pun, Biggie, and Pac shit\nI wish that I could get high but when I'm high I wish I wouldn't get high\nSometimes I wish I wasn't alive\nI wish for Heaven gates to enter\nWish for Lakers' tickets at the Staples Center\nMy seats, floor me\nWish Chris Childs wouldn't of hit Kobe\nWhen I see Lauren, I wish I knew why my heart burns\nWish 22 inch rims wouldn't rub on sharp turns\nI wish these hoes stop lying\nI wish these niggas stop lying\nWish dope heads stop using, as if they not dying\n\n[Interlude]\nFuck it. That's just some shit I wish for, fuck it\nAight. That what you want?\nAight, listen, listen\n\n[Verse 16]\nI wish I ain't have to go on tour to sell records\nI wish I ain't have to sell records\nFuck, I wish I ain't have a jail record\nWish every bitch gave head\nI wish I could've saved Dad\nI wish I make money 'til I'm a dead man\nI wish my chain wasn't heavy around my neck\nWish hoes wouldn't suck dick and try to kiss down my neck\nWish I ain't have to get locked up for slapping her to the ground for that\nBitch I wish you wouldn't wanna be down for that\nI wish there wasn’t no droughts\nI wish there wasn’t no fucking coke ??\nI wish Shyne, Suge, and fuckin’ – oh shit\n\n[Interlude]\nDon’t stop it though\nShit, boy\nFuckin’ D. J. Raj Smoove haha\nListen\n\n[Verse 17]\nNigga respect Weezy\nI leave everyone of you bustas to suffer\nFuck with me I’ll touch any fucker you got love for\nThe Sqad’s a motha – shut your dicksuckers\nKick up the ruckus, find your mother stuffed in nature\n\n[Interlude]\nOh I can’t do that one\nOk, ok\nWhat you know about Weezy dawg?\nWhat the fuck y’all know about Weezy?\nHolla at me, holla at me, holla at me\nLet’s switch it up\nHolla at me, Weezy is the muhfuckin’ don\nDon’t get it tangled or twisted\nYour head will get splitted\nTell the whole world that I did it\nYou bullshitted\nWe don’t front; is Sqad shit exactly what you want?\nWe bring it to your head and your -\nBoy, boy, check it\n\n[Verse 18]\nNigga we peel guns, and homie we fear none\nIntentions to kill some, from bitches to children\nFor real we will come inside of your buildings\nWith Glocks and M-1s, and pop and then some\nLet them 4s blaze\nMy niggas blows haze\nGuzzled Belvedere ever since we heard Jay\nBe dying the worst way\nWho want it? Your bitch, you\nSqad is the official shit\nPistols spit behind little shit\nI get a bad bitch who lick\nAnd keep her posted up on the low\nShe never cook pork but only cook coke\nDie for respect and hope, look beyond I’m a celebrity\nHold minds for ransom, head sold separately\nI’m a ape dawg\nTrapped in the jungle, can’t escape dawg\nBut I bet you be the last man standing like a 8-ball\nAnd I ain’t worrying ‘bout ballin’ no more, I’m past that stage\n18 years old, I got cash that age\n\n[Interlude]\nWho fuckin’ with me?\nI’m 18 years old and I got cash that age, muhfucka\nShit, ok, ok, listen\nThis how we gon’ do it\nS-Q-A-D-S-H-I-T\nOk, yeah, yeah, hahaha\nI like that, I like that\nLay low muhfucka\n\n[Verse 19]\nI can’t live forever\nAnd so forever I’ll forever be thuggin’\nAnd if there’s ever any trouble then the metals be bustin’\nI swear to God, let ‘em be fuckin’ with me and see something\nMy Sqad ride, I bet we be up on the street to heat somethin’\nWe peace nothing cousin, this here is war and we battle\nBig guns with deep barrels, bullets leap and leap at you nigga\nBricks go for 10 gs on street value\nPatience is fragile, niggas be glad to come smash you\nThe S Class is casual for the summer\nLet me re-deal, I bring out the 64 on three wheels\n\n[Interlude]\nHolla at me dawg, holla at me, holla at me\nNigga we gon’ be here for a long time\n‘Cause we done been here for a long time\nNow who want it – some problems?\nUhh, uhh, oh shit\nI ain’t finished\nCheck it, check it\nI’ma free’ ‘til the bars’ gone, free’ ‘til the bars’ gone\nHolla at me\n\n[Verse 20]\nReady for the track to switch up\nBitch play with me I’ll smack your bitch up\nBitch suck my dick up\n‘Til she get the hiccups\n*Hiccups*, excuse you ho\nNow I got to lose you ho\nYou know how Sqad dos you ho\nMove you through the shit smooth and slow\nNow you gotta do the whole clique\nYou know how to fuckin’ go, suck the whole dick\nCatch the whole nut until you never don’t spit\nThis some freestyle shit until the track gone\nBitch I’ll fuck you ‘til your back gone\nI shoot the gun ‘til the Mac gone\nRap on\n\n[Interlude]\nOh, I’ma rap on\nOh, I’ma rap on\nOh, we gon’ take it back to the streets with this one\n\n[Verse 21]\n17th Ward nigga\nMy balls thicker, scars and hard liquor\nRevolve quicker if I’m involved in war nigga\nFuck the laws and fuck peace\nWe all live raw\nAnd we duck them boys and run streets\nThis shit won’t cease\nYou got a problem when you fuckin’ with Weezy the don nukka\n‘Cause this shit that I palm in my arm is going blucka\nAnd I’m young but a wise nigga\nBut in the meanwhile I’m wild going at it\nFuck it, tryna join my daddy\nAutomatic weapons, pow\nYou can call the paramedics now\nAnd if any test the child he stepping on deadly grounds\nI’m repping Hollygrove to my fucking grave woa’\nAnd chase dough, slave hoes, and keep my head low\nWe can’t let the feds know nothing\nWe keep it quiet as kept\nIf someone frontin’ you find him dest\n\n[Interlude]\nI’m sorry\nWhat the fuck is “find him dest”?\nI meant, “If someone frontin’ you find his death”\nDeath\n7, S. Q\nHolla at us, check it\n\n[Verse 22]\nPistols burning\nPop the barrel, turning\nIt got the faggots squirming\nWe closing any open shop we ain’t concerned in\nCoke the size of Sherman Klump we flipped and doubled\nAnd dropped the whip on dubs and dipped in Bubble\nGet a bad bitch to hustle and move product\nAnd split them niggas quick as fuck if them dudes try her\nNot behind the ho, but only behind the dough\nAnd behind the dough I kill whoever stand behind the door\nYou ain’t tryna go that route with the Sqad, it’s rough, I promise\nWe kidnap your mommas and sit our johnsons on her tonsils\nWe reside inside the S. Q. bombers\nAnd we leave families emotional like Carl Thomas\nSo stay from ‘round us\nAnd to be honest, ain’t nothing for me to do away with you\nI be the same nigga that blow a Tre with you\nThen let a K hit you\nFuck you nigga, I ain’t got no love for none of y’all\nMake you my underdog, put you under dawg\n\n[Interlude]\nUnder dawg, holla\nThis shit we doing is under dawg\nMan, listen\n\n[Verse 23]\nBitch I’m explosive\nAll this niggas know this\nWeezy, I’m your woadie\nHolla, guns is toted\nNever fucking loaded\nBut I keep more E\nYou know how I do it bitch, I do it for me\nI do it for the streets, I do it for my peeps\nI do it for Sqad\nI do it ‘cause I ride\nI do it ‘til I die\nI never gets high\nI’m always on my toes\nI never fuck bitches, I never fuck hoes\nBut I only gets my dick sucked\nThat’s because I got a real bitch that’s on my siddide\nDown with the Squiddad\n\n[Interlude]\nOh, oh that my nigga Six Shot\nYeah, bout to run it\nUh oh, uh oh, uh oh\nCheck it, check it\nListen\n\n[Verse 24]\nI do just what I motherfuckin’ want\nI never live with regrets\nI speak from the shit that bleed on the left side of my chest\nTake heed to the shit that gleam on the left side of my waist\nOr take three to the left side of your face\nA multiplatinum artist still riding with TECs and 3-8s\nA hustler, you can see the crack residue left on them plates\nThey fucking with me, I’m predicting death on them snakes\nI ride in a frenzy\nRide in a Benzy\nFuck it, tryna fire my enemies\nFire a sack, recline back, and feel me\nI spit that filthy shit\nThat gutta, guilty until proven guilty shit, get back at me\nLet’s just spit rapidly at chests, you better fucking halt\nOr the Glocks with the thunderbolts make you do somersaults\n\n[Interlude]\nHolla at me mothafucke, holla at me\nHolla at me muhfucka, holla at me\nHolla at me muhfucka, holla at me\nThat’s my nigga, yeah\nListen, listen\n\n[Verse 25]\nThis is for the Sqad I sip Moët with\nThis is for the Sqad that I pop X with\nThis is for the Sqad I be in the house of blues with\nThis is for my Sqad that I usually fools with\nThis is for Lil’ Jay, this is for Lil’ Yo\nThis is for Lil’ T-Redd, this is for Fee-Fee though\nThis is for my nigga Sam, all call him Supa\nThis is for my nigga Tez, stupid ass nigga\n\n[Interlude]\nHaha holla, holla\nI was feeling that one, that was real nice\nWas real nice\nOk, ok\nListen\n\n[Verse 26]\nWe carry automatic machine objects in jean pockets\nAnd clocks with beams cocked and fuck with me - seeing doctors\nThe Sqad be in monster trucks with screens and bobbers\nPassing green and brown chocolate like John Stockton\nWho stopping these lil’ niggas? Nobody, it’s impossible\nFind me in a Benz – aqua blue\nRims colossal dude\nAnd right under the seat’s a Glock or two\nDon’t make me pop at you\nAnd got two Hawaiian tropical bitches that will swallow you\nPeople ask me “Weezy, why you do it so big?”\nI pop my collar, drop the roof off the 6, then shoot up the bridge\nListen, I’ve had loot since a kid\nI ain’t just start having dough\nAs a matter of fact, I started having dough\nI’ma be fancy, send some warnings at folks\nBe very cautious or them Glock 4s get pointed at throats\nI bet he choke\n\n[Interlude]\nWhat you don’t know?\nIt’s Weezy the Squiddon squiddy\nGet with it\nHolla at us\nOh shit, holla at me\nYa, ya, ya\nWhat these niggas know about that nigga Weezy?\nWhat these niggas know about that nigga Weezy?\nFat, I got us\nIs you ready?\nWhat these niggas know about that nigga Weezy?\nNot a muhfuckin’ thing\nThey don’t know that I got a muhfucking thing right up inside my pants and I’m ready to make a bitch dance\nHolla at me listen\n\n[Verse 27]\nNigga fuck with me, get washed away\nGlocks and revolvers spray\nCats get they corners blazed\nBlast with enormous Ks\nUnderstand Weezy be the don and ain’t no fading him\nPlay with him, shots turn him dome into a stadium\nBeef with me and my gun immediately bust repeatedly\nUnleash this pop one in your bitch Victoria Secre-\n‘Atures creepin’ without the lights on\nDoo rag, G Nikes on\nHope the choir sing your ass a nice song\nNiggas ain’t tryna collide with the Squiddad\nIt is not wise\nI’m robbing your block with Glock 9s\nPull out, cock, pop moms\nDrop bombs\nYou niggas ?????????\nSqad bitch, ain’t no replacing me\nCome to take shit\nWe be on some money make shit\nSimply basic, you hate I put more designs in your head than Anthony Mason\nHave you parents in the front emergency room pacing\nCrying an waiting for the doctor to come out and say\n“Miss your motherfuckin’ son didn’t make it”, holla\n*Moans* all y’all better know no disrespecting Weez’\nCome to your fucking street and kill families\nHolla at this muhfuckin’ nigga\nYou know me\nAnd ask your bitch, she blow me\nYou know I’m in love with Kobe\nAnd Hovi\n\n[Interlude]\nOk, ok\nWhat they want?\nCheck it, check it\n\n[Verse 28]\nNigga it’s pistol play regardless of the matter\nI’m a heartless lil’ bastard\nSince Rabbit died my life’s been darkened and shattered\nFuck all of you faggots\nRegulator, warrior, bandit, gun busta\nSpit the cannon make you fall to the canvas muhfucka\nIt’s Lil’ Weezy in the flesh nigga, Hollygrove candidate\nRunning with The Sqad scavengers, we on some family shit\nNiggas ain’t understanding it but they will in a minute\nOr my K peel in a minute, make your head drill to your tennis\nI’ma stay trill for the spinach\nTremendous when I’m on that green shit\nMenace when I’m on that green shit for that green shit\nI’ma a soldier, some Army, Navy, Marine shit\nMy appearance is ? shit, but I got Korean chips\nFuck with me I blast you idiots\nLet the Mac and Semis spit like Pakistinians muhfucka\n\n[Interlude]\nMuhfucka, ok, it’s real time\nIt’s real time\nI know what song next\nI fuckin’ know what song next\nCheck it, check it\n\"Nigga I crash parties crash-\"\nOh I ain’t know that was next\nI ain’t know that was next\nI really didn’t know that was next\nSorry. I’ma freestyle to it\n\n[Verse 29]\nOk ain’t no nigga like this nigga Weezy\nAin’t no clique like the Sqiddy Sqeezy\nYou know how we do it, we dos it easy but we gets loot\nAnd if a muhfucka fuck with us we shoot\nWe do the things, we do it big, we ride big\nAnd if a muhfucka fuck with us he die quick\nI make your momma and your child spit up blood\nI make shit come up to your thighs\nThis the Squad\nI don’t fuck with niggas\nI only fuck with six niggas\nI only fuck with rich niggas\nI only fuck with C. M. B. dawg\nAnd they only fuck with Weezy Wee dawg\nI’ma freestlyle ‘til the beat’s gone\nI’ma freestyle ‘til the cheese gone\nI’ma do this shit ‘til I’m gone\nAnd I’ma rhyme on, muhfucka\nHere’s my dick, you can climb on\n\n[Interlude]\nFuck, holla at me, holla at me\nFull of that Mo’\nNow I’m full of that dro\nYeah, yeah; what’s next Smoove?\nOh, oh, oh, oh, oh, shit, shit, oh, oh, oh, shit, shit\nCheck me, check me\nListen\n\n[Verse 30]\nI’m a outlaw\nI’m quick on the draw\nI’m from the motherfucking graveland 17th Ward\nI go hard, these niggas can’t play with me\nI got a whole bunch of guns, you can’t spray with me\nI spit this shit like a K spit rapidly\nI make your fucking family live unhappily\nWho the fuck wan’ fuck with Weezy?\nThey know what I’m fucking ‘bout\nThey know I run up in they house, gun up in they mouth\nI keep it ‘bout it, ‘bout it, not like No Limit\nBut this fucking shit I roll with ain’t got no gimmicks\nThis Sqad shit ‘til the motherfucking end you bitch\nAnd I’ll kill your motherfucking best friend you bitch\nI put the -\nOh shit, I ain’t ‘bout to finish spittin’\nI ain’t ‘bout to finish ripping it up\nI’m about to giving it up to my nigga motherfu -\nOh, oh, we living it up\nWe doing it real fucking big\nWe will kill fucking kids\nIf you ever fuck around with these mill’ fucking ‘ions\n\n[Interlude]\nYou get it? Mill’ fuckin’ ‘ions\nUh huh, uh huh, uh huh\nWhat they know about me? Listen\nGot some shit coming\nY’all niggas, if you listening to this, sit down and prepare\n‘Cause here it come, ok\nLet’s do it\nOh shit, oh shit\nWhat you know about that nigga Lil’ Weezy?\nOh shit, oh shit\nWhat you know about me?\nListen\n\n[Verse 31]\nNigga I crash parties, crash shorties, crash Bacardis, crash Ferraris\nCrash authorities, crash sororities, crash quarter kis\nInfected with a raw disease, call it H. I. V\nThat stands for Hoes, Incoming Violence\nThat’s what I die with\nI pop shit, don’t fuck with Sqad shit\nWe on some mob shit\nSome lil’ niggas who seem harmless, but nah bitch\nGlocks spit behind anything\nBitch lick anything\n‘Cause I got plenty change like Bill Gates’ piggy bank\nGot a young pretty thing sitting beside me in the whip\nWith Limo tints to hide me in the whip\nTold mami you can keep your clothes on, I wan’ see where your head at\nIn other words I don’t wanna fuck, I wan’ see where your head at\nYou can catch me laid back in the cut with ounces and bundles\nBouncing from hustles, doubt me I’ll fuck you, fuck it\nLounging in bubble\nRocky watch resemble mountains or something\nFronting get your body found behind some mountains or sum’n\nAye, when you fuckin’ with me you fuckin’ with cheese\nYou fuckin’ with Streets, you fuckin’ with heat\nYou fuckin’ with Sqad, you fuckin’ for free\nYou touching your knees\nAnd if you hate, you’ll be lucky to breathe\nNow how you like lookin’?\nWhen the double gauge is ???? you get your fuckin’ life token\nDespite the business, fuck rap\nPicture block on a motorcycle wheeling\nBut the Glock ain’t right for kidneys\nI don’t like you bitches, I hate you hoes\nDate you hoes, bust nuts in your facials hoes\nThen replace you hoes, that’s the type of shit that makes you hoes\nAll the women in this nation hoes\nHot since my creation woa’\nWho the fuck want him?\nBitch niggas with no nuts on ‘em\nI got pistols with blood on ‘em\nWhips with dubs on ‘em\nNiggas with chips and drugs on ‘em\nGot bitches with hips and tits on ‘em\nLips with dicks on ‘em\nChicks with bricks on ‘em\nChicks with chicks on ‘em\nI’m big shit homie, wide body chrome 6\nGet dome while driving home, shit, shit, shit\nThis shit, Weezy Sqad shit, shit\nSome chicks can make a hit the way they tongue twist, shit\nPimp shit, no spit shit, raw shit\nA bunch of Lil’ Waynes in your fucking jaw shit\n\n[Interlude]\nHolla at me, I’m still not done\nHolla at me, check it, I’m still not done\nNigga holla at me, holla at me\nListen, listen, listen\n\n[Verse 32]\nDon’t get it twisted ‘cause I’m younger than most\nI come with the toast\nGet it hot like summer was close\nI’m hanging out the Hummer with Sos’\nExploding missile Glock ringing at the front of your door like Jehovah Witness’\nSober? Forget it\nThis C. M. B. thing, I’m over committed\nThe youngest soldier come with it\nCock back, guns put holes in your fitted\nNigga I told you to quit it\nI load it with 50\nI blow ‘til it’s empty\nThe dro and Henny got me lokin’ and limpin’\nRopin’ up when I drink ‘til I’m over the limit\nHoppin’ out the Rover with Semis\nWildin’ out, go straight to your momma’s house\nWith a rag on my face with more 9s than dialing out\nNow who hating?\nNiggas cheapskating, underestimating\nThe heat take him, put him under extra pavement\nSome one week in Jamaica, come back with a accent like -\n\n[Outro: Lil Wayne]\nWhoo, whoo, fuck it\nThat’s 10000 bars for y’all bitches\nHolla at me\nWeezy Wee, Raj Smoove\nAnd that’s the end of that story\nOne\nShit\nMan, man", "image": "https://images.rapgenius.com/a38223733ff3d601c7fb187eaedb65fb.500x500x1.jpg"}], "artist": "Lil Wayne"}