{"songs": [{"title": "The Infamous Prelude", "album": "The Infamous", "year": "1995-04-25", "lyrics": "Yeah yeah yeah\nYeah yeah yeah\nHold the fuck up\n\nWe gonna take this little intermission to listen\nTo what the fuck I got to say, you know\n\nI been doing this shit for years:\nHolding heat, selling\nUsing, abusing all kinds of drugs;\nRobbing niggas, running up in niggas' cribs\nYou know, the whole shit\n\nSo don't ever in your life get me confused\nWith some of them other niggas that you might see\nOn TV\nOr hear on the radio and such\nKnow what I'm saying?\n\nI mean, this is me: P\nI'm speaking for my fucking self\n\nWhen you see me:\nAt the show\nOr on stage\nOr on the street\nI DEFINITELY got the gat on me\nYou know what I'm saying?\n\nAnd it ain't like I'm trying to be a tough guy\nOr trying to make people think I'm crazy\nBy sayin' all this shit\n\nBut what it is, dat:\nI know how niggas gets down, alright?\nI used to be in the clubs:\nThe Muse, The Tunnel, whatever the fuck\n\nNiggas get they little drink on\nHavin'\nFun with they little crew\n(You know what I'm saying)\nStart cuttin' / shootin' / whatever\nThings like that\nA lot of these so-called \"rap niggas\"\nAin't never seen no parts of that shit\nYou know what I'm saying\nYou dig where I'm coming from?\nWord up, yo\n\nAnd I know a lot of y'all niggas —\nMatter of fact, all y'all niggas\nIs right now listening to this shit\nIs like:\n\n\"We gonna see them Mobb Deep niggas\nWe gonna see what they about\nKnow what I'm saying, touch them niggas\nWe gonna see where they head is at.\"\n\nSo yo\nI'm gonna let you niggas know right now:\nYou ain't gotta waste your time\nOr your money\nOn your hospital bills\nAnd if you step to me on a personal level\nI don't back down easy\nThere's a good chance your ass is gonna get\nShot, stabbed, or knuckled down\nOne out of the three\n\nSo don't gamble with your life, duke\nWord up\nAnd believe me:\nI know very well I could get shot, stabbed or fucked up too, whatever\n— I ain't \"Super Nigga\" /, I'm a little skinny motherfucka\nIt's all about who gets who first, though\nYou know what I'm sayin?\n\nSo therefore, say no more\nTo all my niggas: Get the money\nFrontin' niggas get deceased\n\nAnd, oh yeah, to all them rap-ass niggas\nWith your half-assed rhymes\nTalking about how much you get high, how much weed you smoke\nAnd that crazy space shit that don't even make no sense:\nDon't ever speak to me when you see me, know what I'm saying, word\nI'ma have to get on some ole \"high school\" shit\nStart punching niggas in they face just for living\n\nYo, I'm finished what I had to say\nYa'll can continue on", "image": "https://images.genius.com/b07e53ad94c52f45245db1c1d49e6b00.1000x1000x1.png"}], "artist": "Mobb Deep"}