{"songs": [{"title": "Try Me (Remix)", "album": null, "year": "2014-09-10", "lyrics": "[Chorus: Dej Loaf]\nLet a nigga try me, try me\nI’ma get his whole motherfuckin’ family\nAnd I ain’t playin’ with nobody\nFuck around and I’ma catch a body\nLet a nigga try me, try me\nI’ma get his whole motherfuckin’ family\nAnd I ain’t playin’ with nobody\nFuck around and I’ma catch a body\n\n[Verse 1: Dej Loaf]\nBitch I got the Mac or the 40\nTurn a bitch to some macaroni\nTell me how you want it I’m on it\nI really mean it I’m just not recording\nStill a blow the choppa, for all you actors\nLeave a bitch nigga head in pasta\nYou are an impostor, ain’t got no money\nPut the burner to his tummy, and make it bubbly\nI really hate niggas I’m a Nazi\nLove wearin’ all black, you should see my closet\nRock that all white, when I’m feelin’ Godly\nPop out like Coke, I ain’t gotta park it\nFuck is y’all saying, bitch my hood love me\n48214 real niggas know me\nI been out my mind since they killed my cousin\nFree my cousin Devin, man he just called me\nAll these niggas love me, can’t get ‘em off me\nFuck around gave him my number, he won’t stop calling\nIBGM, we the clique bitch you see us scoring\nV.I.P in the club, while your section boring\nGot a bitch that Set it Off like Jada Pinkett, Queen Latifah\nYou rollin’ around with your nieces bitch you TeeTee\nMind full money, got a heart full of demons\nMobbin’ like Italians, we really take yo fingers\nTurn yo face into a pizza, no acne\nHave you singin’ like Alicia, fuck with my family\nThey be like you little, but got damn she spazzing\nDo the whole crew, my bitches freak nasty\n\n[Chorus]\n\n[Verse 2: Wiz Khalifa]\nI got multiple chains, a gang of old school\nThat I swear I don’t drive ‘less it don’t rain\nShow you how to get the million, both lanes\nWhen I switch, we gon’ blow the whole thing\nThat's a zip, bitch keep talking about\n\"Whats my favorite strain?\nWhat’s my favorite part of the game?\nThe grind, or the fame?\"\nI told her as long as my nigga straight\nWe plotted this for less, now is number one albums\nNiggas wasn’t sure, speculations about the outcome\nNow what? More award shows, more oz's\nMore niggas tryna find out where I shop, when I get my clothes\nGet a buzz and I put you on a roll, got a hundred rolled\nHear my car coming from the lobby\nTaylor Gang over anybody\n\n[Chorus]\n\n[Verse 3: Dej Loaf]\nBitch I got the Tommy no Hilfiger\nLil Dej ain’t about it, bitch how you figure\nI don’t do no drugs, I be off liquor\nSo lifted, flyer than your girl, baby gone and take my picture\nSee I gotta get this money, my palms itchin’\nNiggas gossip like hoes, most of ‘em bitches\nI don’t wanna do no songs, I don’t wanna kick it\nAnd I ain’t signing to no label, bitch I’m independent\n\n[Chorus]", "image": "https://images.genius.com/2ba15f623d81eda09cdc07f50dde02ad.400x400x1.jpg"}], "artist": "Wiz Khalifa"}