{"songs": [{"title": "Who Your Around", "album": null, "year": null, "lyrics": "[Intro: Meek Mill]\nOne night I prayed to God (I prayed to God)\nI asked could he please remove the enemies from my life (from my life)\nAnd before you know it I started losing friends (losing friends)\n\n[Hook: Mary J. Blige]\nSomebody who you're around wants to clip your wings and shoot you down\nBut its okay to keep enemies close\nAs long as you know, just make sure you know who you're around\n\n[Verse 1: Meek Mill]\nY'all was like my brothers\nI considered y'all as folks (folks)\nAnd I remember nights sipping liquor making toasts (toasts)\nTalking about the life, trying to get it slinging dope (yeah)\nNiggas say I changed, but you niggas changed first (first)\nAnd fuck all this money nigga, we was fam first (family)\nLooking at me balling, know that Instagram hurt (hurt)\nCause you was supposed to be that nigga in that damn ghost (yeah)\nI would have rolled for you even in the same hearst (whoah)\nSame cemetery, bury me in the same dirt (dirt)\nWe had a plan, but I guess it ain't work (work)\n\"B.H we straight,\" that was the motto my nigga\nI got rich first, you was supposed to follow my nigga\nI'm gone\n\n[Hook: Mary J. Blige]\nSomebody who you're around wants to clip your wings and shoot you down\nBut its okay to keep enemies close\nAs long as you know, just make sure you know who you're around\n\n[Verse 2: Meek Mill]\nAnd Dat Nigga Lil\nShit I can't believe you (not you)\nThat's what that syrup and that weed do? (weed do)\nAnd when I came home I tried to feed you (feed you)\nAnd every song I was screamin' free you (Free Dat Nigga Lil)\nAnd if you bled I was down to bleed too (bleed too)\nNow when I ride by I breeze through (breeze through)\nI don't even stop, ain't a need to (not to)\nAnd you the one that left nigga, I ain't leave you (you)\nShit got realer (realer), niggas got richer (richer)\nI said the money train coming (coming), niggas missed it (I missed)\nI even tried to spin back around to come and get you (get you)\nBut niggas wanted more from me then my own sister (damn)\n\n[Hook: Mary J. Blige]\nSomebody who you're around wants to clip your wings and shoot you down\nBut its okay to keep enemies close\nAs long as you know, just make sure you know who you're around\n\n[Verse 3: Meek Mill]\nThey want more than my mother (mother)\nMore than Omelly, and that nigga like my brother (brother)\nGreedy motherfucker (fucker)\nCrazy thing about it, I don't hate em, I still love em (love)\nI might have said things, I never said fuck em\nBut I'm a live my life, get the money, ball hard (ball hard)\nStill sending earned money for his calling cards (calling cards)\nRick ain't complaining, he got life behind bars (Ricks at)\nAnd he still calling me, bet you he ain't calling y'all (nah)\nCuz none of y'all niggas ain't send him shit yet (nah)\nNone of y'all niggas send him pics yet (yeah)\nI'm still writing money orders, sending big checks\nAnd remember when it rains, niggas get wet\nGone\n\n[Hook: Mary J. Blige]\nSomebody who you're around wants to clip your wings and shoot you down\nBut its okay to keep enemies close\nAs long as you know, just make sure you know who you're around", "image": "https://images.genius.com/6929169de7116d41676151bdea5cc773.1000x1000x1.jpg"}], "artist": "Meek Mill"}