{"songs": [{"title": "Open Letter", "album": "Tha Carter V", "year": "2018-09-28", "lyrics": "[Intro]\nAh-em\n\n[Verse 1]\nSometimes I feel like I ain't shit\nSometimes a nigga feel like shit\nTalkin’ 'bout some real life shit\nGoodbye letter, \"Dear Life\" shit\nSo if a nigga kill me, hope he mean it\nI just hope I die for a reason\nThey probably won't miss me ’til they need me\nHave problems with admittin' that they need me, Lord\nI'm talkin' 'bout some real life shit\nGoodbye letter, \"Dear Life\" shit\nWay too concerned to be conceited\nI live and I learn, then die tryna teach 'em, Lord\nDie tryna reach 'em\nThey care more about how much I leave than\nWhere I leave it\nI hope I leave more of an impression on my kids\nTo be destined to have blessings to believe in, Lord\nJust got off the phone with my son\nTold him, \"You're a son of a gun\"\nJust got off the phone with my daughter\nTold her, \"I won’t hesitate to fuck a young nigga up\", Lord\nA few bitches left me, yhat only got a new bitch elected\nMy old bitch was too disrespectful\nAnd only get my new bitch respected\nThat’s power, yes, it's now or next\nCan’t lie though, I tried though\nI'll die tryin', that's a common death\nWe was such a team, we was chasin’ our dreams\nThen it stopped, now I'm outta breath\nNow they try to tell me I need rest\nAnd I'll find love again, I ain't find it yet\nOh, but I guess it is what it is as it appears, oh shit\nThe object in the mirror is more near than it appears, oh shit\nAnd sometimes I fear who in the mirror, that nigga weird\nHe done died so many times but still here, why am I here?\n\n[Chorus]\nDear Life\nWhat is my meaning? My reason?\n\n[Verse 2]\nNaked bitches really love ones\nSometimes our loved ones don't love us\nI'm fuckin' more than I'm makin' love\nSometimes I make my rubber wear a rubber\nI just tell my lady, \"Nothing's easy\"\nEven though I make it look easy\nBut understand looks are deceiving\nLookin' like I'm lookin' for some grievance\n'Cause I been through way too much, don't wanna think about it\nCranky 'bout it, gotta drink about it\nGotta synchronize it, tranquilize it\nDoctor ain't prescribin' what he ain't realizin'\nPain inside me got me thinkin' 'bout me\nTryna hang my body, sanctifyin'\nI'm a gangsta dyin' 'cause all gangsters die\nI can't deny it, you can't tame my lion\nI'm a angry lion hangin' by a string, I can't describe it\nFeel like a anchor tied to my finger\nGot me sinkin' to the bottom of my drink\nI know a lotta niggas think I got a lotta niggas\nThere's strength in numbers but there's honor over strength\nI talked to God the other day, he say he got a nigga\nSo, I look death up in her eye and then I wink\nIt's way too real, the shit I'm talkin' way, way too real\nI hope it gave you chills\nThe dirt under your feet could be the grave you fill\nYou don't know how dead you feel 'til you're dead for real\nGettin' high after I paid the bill, lower than a Navy SEAL\nShow up with them Navy guns, I hope somebody prayin' for 'em\nPrice tags on mistakes, somebody payin' for 'em\nIce bath when my face numb, no expression\nWhat's the life expectancy when you don't expect shit?\nMama told me, \"Fuck the world and be so aggressive\nBe so fluorescent, watch these hoes 'cause they so obsessive\nDon't get too high to look over blessings\nNever come in second, make the most of your seconds\nThey so precious\"\n'Cause if we could buy time, every store would sell it\nIf you want me to read your mind, need correct spelling\nI keep it real, niggas better keep it copacetic\nWhere the weed? I feel like I'm gettin' sober-headed\nLookin' in the mirror at the one that know me better\nI was too busy to talk, I wrote an open letter\n\n[Chorus]\nDear Life\nWhat is my meaning? My reason?\nThat's the question I ask the reader, God bless the reader\nDear Life, what is my meaning? My reason?\nThat's the question\n\n[Outro: Jacida Carter]\nYou know, when he told me Toya was havin' a baby, I say, \"Y'all young. You know y'all young.\" But I said, \"Be the best father you can be,\" you know. And truly, he is that.", "image": "https://images.genius.com/9e2d71d269b2971975d5d9ca36deb943.1000x1000x1.jpg"}], "artist": "Lil Wayne"}