{"songs": [{"title": "Shine On", "album": "Young Sinatra", "year": "2011-09-19", "lyrics": "[Hook: Joanna Newsom]\nWe should shine a light on, a light on\nAnd the book I write on, write on, it was right on\nWe should shine a light on, a light on\nAnd the book I write on, write on, it was right on\nWe should shine a light on, a light on\nAnd the book I write on, write on, it was right on\nWe should shine a light on, a light on\nAnd the book I write on, write on, it was right on\n\n[Verse]\nUh, now, they lost it I found it, we leave 'em astounded\nAsking me how you so fly, yet you still so grounded?\nI replied, I died inside, resurrected a beast\nLeave 'em deceased, music's in my genes like a crease\nGot it, capisce? Hungry as hell trying to eat now\nSuccess is the only thing that can complete us\nGrinding to free us, the beat knocking like a fetus\nClose your eyes, open up your ears so you can see this (Logic)\nNow I've accepted I'm not from the hood\nCause sellin' crack and bustin' gats don't make my raps good\nSee this is me, L.O.G.I.C. reppin' MD to the fullest\nPush us to the limit but never pull us, now\nI can't wait 'til I see my name in neon\nThat fly shit I be on flowin' for eons\nEvery day I take chances, Celine Dion\nSaid every day I take chances, Celine Dion, let's get it\nI'm a diamond in the rough, but I shine like disco\nSurrounded by greasy people like I doused them in Crisco\nI haven't shined yet, so tell me where does the rest go?\nUp a million percent until they finally hear this though\nBumping up in they city like, \"oh my God, this go\"\nMy business getting better every year like fiscal\nFuck a pad and a pen, a mic my only utensil\nI'm a original see but they trace like stencil\nA stain in the game, but you fade like pencil\nBiting off of my rhymes, that ain't even an insult\n'Cause you couldn't produce, and in the end that shit's your fault\nIt takes 3 millions years for a diamond to shine\nI did it in 21, see I'm ahead of my time\n'Cause when I flow the crowd never roll 'cause I rock\nOn the road to success, haters in my blind spot\n'Cause I got no time to bullshit\n\n[Hook: Joanna Newsom]\nWe should shine a light on, a light on\nAnd the book I write on, write on, it was right on", "image": "https://images.genius.com/6118bfdbbde22320e3c6bc130e1772d3.1000x1000x1.jpg"}], "artist": "Logic"}