{"songs": [{"title": "Accessories (Nina Breeda)", "album": "Same Day,  Different Shit", "year": null, "lyrics": "[Chorus][x2]\nAK-47 macking every hoe accessories next to me and BAC and Nina Breeda\nBaggers for any endeavors bend over what ever weather you're in and whatever\nI'm shooting them for whatever, ever, ever\n\n[Verse 1]\nStop niggas. What you got on my 40 homie I got a 40 homie with two of our homies shooting for me\nDon't be shy now nigga. Don't ask the homies why now nigga. Get to stripping for get a pistol whipping\nI'm coming to your block. I gotta settle what's gone. I got to medal in stoke. Let off the metal and go\nHigh pocket rockets knocking limbs out of socket.i'm not just litle mu fuckas ask watching and watch\nI got busy up in new ride and I'm going senate. I pushed the front line furiously macking the clapicals\nI practically looking at me there's a hog in bedded. Most birds flying pump nigga all eleven\nCheck twice to make sure it's ready for shell shedding. It's Halloween nigga. Yeah the monsters loose\nWith them machines nigga infrared beams nigga. Coming from the front and back A's and 16's nigga listen\n\n[Chorus][x2]\n\n[Verse 2]\nWatching fly... Watching em fly. I'm in the strip club. Bout to scoop me up a bitch and get my dick sucked\nYeah, you see the G's up in the corner. Certified Los Angeles ready ride city. I'm on the side long as California we on ya\nStay heated like saunas, spas and beaches. You'll suck the life out my balls like spiders and leeches\nThere's always a busta around looking for bustas around. Every time you see the bustas around\nI'm going smashed every single busta pound Kurup and DAS\nYou want war or sure? Little confused? You need to choose? I'll choose for ya\nI help niggas empty out your shoes for you ignorant mu fucka. Beat it! Before I fly something through that ass\nGot a fracture and restructure your pigment mutha fucka. Cock and spitting mu fucka. Just listen mu fucka\n\n[Chorus][x2]\n\n[Verse 3]\nOne and gunning pushing. Crushing a little liquor. High profile nigga. Hostile nigga\nSociopathic for A crocodile nigga. Silent but deadly mutha fucking West Nile nigga\nI'm afraid to that I'm gonna have to raid and invade. Stomp stampede squash mob come and get your homies mob parade\nI'm going have to main in flame. I came to obtain all the obtain and oxygen. And leave this whole room draining can and gauge\nMe and my school of piranhas, looters and shooters. Got different lasting bitches from Magic City to Hooters\nComplicated like IRobot and computers. Massive the size of the Atlantic Ocean posting pistols and holsters\nPosting West Coast and ferocious. You know it's me. I can make corner half post mortal\nAnd all the mourning and all by the morning. Listen...\n\n[Chorus][x2]", "image": "https://images.genius.com/c251b0b346b28a8f4079b3f901685705.1000x1000x1.jpg"}], "artist": "Kurupt"}