{"songs": [{"title": "Don’t Know", "album": "Slime Season 2", "year": "2015-10-31", "lyrics": "[Intro: Young Thug]\nLondon on da track, bitch!\n\n[Chorus: Young Thug]\nMy newest bitch say that she got it, ya digg?\nShow me your mill, I put my sig in, ya digg?\nI want that pussy, 'cause it's as tight as a kick\nLook at my Rollie, it's as cool as a fridge\nPush your top back 'cause I feel like it a wig\nI don't know why, I don't why, but I did\nI don't know why, I don't why, yeah\nBut can you hurry up and buy, yeah\n\n[Verse 1: Young Thug]\nGraduated from Howard I'm the shit no bowel\nBeat it up for an hour, she's wet as a shower\nHoppin' out on them cowards with nothing but 'em whoppers\nI'm a level 5 goblin\n30 deep, all them lil' niggas be mobbin'\nHave you ever seen a street geek barbarian\nR.I.P. Monroe no Marilyn\nGive my mama everythin' nigga, evident\nAyy, I ain't goin' steady, but I'm ready\nLet 'em bitches hit just like your necklace\nWe got blocks and we treacherous\nTake your necklace, you neckless\nPlease stay outta my section, yeah\nPullin' out that choppa that moment that nigga get her, yeah\n\n[Chorus: Young Thug]\nMy newest bitch say that she got it, ya dig?\nShow me your mail, I put my stick in, ya dig?\nI want that pussy, 'cause it's as tight as a kick\nLook at my Rollie, it's as cold as a fridge\nPush your top back 'cause I feel like you the wig\nI don't know why, I don't why, but I did\nI don't know why, I don't why, yeah\nBut can you hurry up and buy, yeah\n\n[Verse 2: Shad Da God]\nGod, got this gas, blowin' so hard\nCall a nigga shrimp, that's a po'boy\nThey gon' make us let the windows down on a Rolls Royce\nHustle hard, I keep that .44, got a dick\nBitches get round me they sneezin', jewelry game sick\nI love mud, I done poured the deuce up so slick\nHop up in my car, now lick and go sit on the stick\nPut the marker on 'em niggas and see if they real\nI'm out in Texas, buyin' pint, keep this shit trill\nI got ashes droppin' on the Bentley steerin' wheel\nXan got me feel like I'm on a Ferris wheel\nThey came 'round the neighborhood with that fire paint\nHe got 'em on drop-top just like a stingray\nMy nigga came with 'em bails, that shit was green day\nI play the star role juggin' like in a screenplay\nGod\n\n[Chorus: Young Thug]\nMy newest bitch say that she got it, ya digg?\nShow me your mill, I put my sig in, ya digg?\nI want that pussy, 'cause it's as tight as a kick\nLook at my Rollie, it's as cold as a fridge\nPush your top back 'cause I feel like it a wig\nI don't know why, I don't why, but I did\nI don't know why, I don't why, yeah\nBut can you hurry up and buy, yeah", "image": "https://images.genius.com/2b1dcde62657935e97ccf20a99636263.1000x1000x1.png"}], "artist": "Young Thug"}