{"songs": [{"title": "Magic", "album": "Dedication 3", "year": "2008-11-14", "lyrics": "[Intro]\nI'm ready, I'm ready, ahh-ahh-ow!\nRest in peace, Pimp C, yeah!\nLemme spark up first\nI'm ready, ahh-ahh-ow!\nRest in peace, Pimp C, yeah!\nLemme spark up first\nLet you know what the fuck is going on\nThe Dedication 3\nCount it: 1, 2, 3\n\n[Verse 1: Lil Wayne]\nYeah, money make Weezy; Weezy makin' money\nI keep my dick in my pants but them hoes take it from me\nI go to sleep on Monday and I wake up Sunday\nI go to sleep with money and wake up with money\nMan, I'm on about 5 of 'em\nMy girl so thick, you can see her ass from the side of her\nYo girl just came in her booth\nSomebody better get her a flammable suit\nI got that bitch jumping like a kangaroo\nAin't a thing to do but bang and screw\nI live in the cloud like the angels do\nHey, traffic, let my Vanquish through\nHey ma, this what I think of you\nI wanna fuck yo head off and fuck yo ankles loose\nThen drink the juice, I'm danger-oose\nI got her clothes falling off like the hanger loose\nI be the monster in her closet\nShe wanna go to Mars, I tell her, \"Hop on top my rocket\"\n\"5, 4, 3, 2, 1, take-off\"\nJohn Travolta with the head, I suck yo face off\nTell your man, \"Take that cape off\"\nI put his ass in the pocket like the 8 ball\nWait, yall, I've never been tall\nBut if I stand on my money, I'll be with God\nLike \"Hallelujah, baby!\"\nIt's, it's Young Moola, baby\n\n[Verse 2: Gudda Gudda]\nYoung Gudda, put the gun to ya head, make ya pop like a bubble\nWhen I pop off, you in trouble\nGat to yo waist, click-clack, niggas' fuckin knees buckle\nLook at these suckas (Gudda!)\nTalkin this bullshit, they don't know Gudda got a full clip\nAnd I pull shit, leave yo stupid ass wet like a pool bitch\nI don't bullshit, no, leave a bitch nigga stinking like bullshit\nGudda ain't the nigga you should fool with, no\nThese niggas know me nigga, knife like Shinobi nigga\n\n[Verse 3: Lil Wayne]\nHa, your mother owe me, nigga\nYour brother pay me, nigga, your sister lay me, nigga\nAnd I made your wife suck my Weezy F. babies, nigga\nI'm still a crazy nigga, fuckin right, I'm wildin'!\nNigga, I just made a hundred fucking million dollars!\nNigga, I ain't even gotta rhyme!\nNigga, I just made a hundred fucking million dollars!", "image": "https://images.genius.com/9f2858c8807f57c343ffb883015a0a14.220x220x1.jpg"}], "artist": "Lil Wayne"}