{"songs": [{"title": "She on My Dick", "album": "Rather You Than Me", "year": "2017-03-13", "lyrics": "[Intro: Rick Ross]\nWho at the door? Put the money up\nI'ma been done kilt one of these niggas 'round here, man\nWho dat is? Uhhhhh\n\n[Verse 1: Rick Ross]\nI had to wet the donkey, get some pillow seats (huh)\nPork n' bean projects is where the killers be (woo)\nCan't be talkin' all loud or niggas gettin' shot\nHomicide, died in the line of hip hop\nAll my niggas out the scott let the wicks lock (huh)\nSwear to God, I'ma die for this wristwatch\nGrowin' up at risco, they called us piss poor\nRealest nigga in the city, let a bitch know (woo)\nRed bottoms, all white just to shoot dice (huh)\nRick Brown leave ya, do it like I'm Big Mike (huh)\nJabar home, goin' on his fifth Rolls Royce\nI drop the top and let him wave at the dope boys (woo)\nFake golds, niggas front with these Dracos (fuck 'em)\nWalk up on 'em with the forty and the case closed (woo)\nDouble M the label with the most pesos (woo)\nI bought a condo and that bitch got eight floors (woo)\n\n[Chorus: Rick Ross]\nShe on my dick, she on my dick (woo)\nRichest nigga in the city so she on my dick (boss, woo)\nIt make sense, she on my dick (woo)\nMakin' moves in the city so she on my dick\nShe on my dick, she on my dick (woo)\nShe on my dick, she on my dick (woo)\nShe on my dick, she on my dick (woo)\nI'm makin' moves, she on my dick\n\n[Verse 2: Gucci Mane]\nI get a rush when I see these bitches watchin' me\nIt's like a high when I see these bitches jockin' me\nShe on my dick like she heard what I'm orderin'\nDrop top Mulsanne, it's just one of these\nShe on my dick like she seen some' she shouldn't've seen\nTwo hundred thou', one hundred's crammed in my Givenchy jeans\nAnd she just wanna make a scene, tryna join the team\nAnd I just wanna paint her face like it's Maybelline\nBill Belichick, I just got another ring (ring)\nBust another check and I just bought a new machine (huh)\nAnd like the Chargers I'm about to move the team (go)\nYou bought a Charger, well Gucci bought a Lamborghin' (It's Gucci)\n\n[Chorus: Rick Ross]\nShe on my dick, she on my dick (woo)\nShe on my dick, she on my dick (boss, woo)\nShe on my dick, she on my dick (woo)\nRichest nigga in the city, she on my dick\nShe on my dick, she on my dick (woo)\nShe on my dick, she on my dick (woo)\nShe see my moves, she on my dick (woo)\nThe richest nigga, yeah, she on my dick\n\n[Verse 3: Rick Ross]\nBaby girl, do your thing in your Vera Wang (huh)\nEver dealt with a nigga still dealin' cocaine? (huh)\nNever made it to the game before it's halftime (no)\nTen stacks for the seats, so you can have mine (haha)\nNever seated by a snitch, they give me bad vibes (woo)\nPop a bottle every time you niggas flatline (bang)\nLot of bitches but I focus on my Fab Five (uh)\nMade her count a half a ticket on the cab ride (woo)\nBitch hair nappy girl, you need that rich shit (huh)\nIt take real heart to wanna be a rich bitch\nShe was the youngest and her mama had six kids\nCalled her a dummy but she turned into a rich bitch (haha)\nRun with a nigga with some money out in Memphis (I see)\nShe was postin' pics of the gifts that he would gift her (I see)\nBut the pussy goes to the richest nigga (I see)\nAnd guess what? Rozay is that nigga!\n\n[Chorus: Rick Ross]\nShe on my dick, she on my dick (woo)\nShe on my dick, she on my dick (boss, woo)\nShe on my dick, she on my dick (woo)\nRichest nigga in the city, she on my dick\nShe on my dick, she on my dick (woo)\nShe on my dick, she on my dick (woo)\nShe see my moves, she on my dick (woo)\nThe richest nigga, yeah, she on my dick\nWhoo! Whooo!", "image": "https://images.genius.com/d1373df4002267ed5d5750cb5b473c41.1000x1000x1.jpg"}], "artist": "Rick Ross"}