{"songs": [{"title": "Fucked Up", "album": "E.P.I.C. (Every Play is Crucial)", "year": "2011-10-25", "lyrics": "[Intro]\nI've lost control\nAnd I've lost my soul\nMy heart's turned to cold\nCause I've lost control\n\n[Hook]\nIs that why you think I'm cool\nBecause I get fucked up, fucked up\nIs that why you think I'm cool\nBecause I get fucked up, fucked up\nIs-is that why?\nIs that why?\nIs that why? (Why, why, I, I, I)\nIs that why you think I'm cool\nBecause I get fucked up, fucked up\n\n[Verse 1: B.o.B]\nWell way too fucked up but obviously\nBut hey,that's just what happens when the bottles are free\nPrestige like an alderman\nI'm laid up in the suite like Solomon\nY'all just following\nI'm half way across the world, it just occurred to me\nI look down, wallet full of foreign currency\nTable full of shots, that's courtesy\nBroke niggers fake ballin', that's perjury\nI do my thing certainly\nOne black, one Asian, diversity\nI got a girl, she got a girl, we doing both concurrently\nI wanna see 'em lips move, and I ain't talking verbally!\nI'm at the peak, man\nI'm Hong-Kong high\nYou wanna see me falling, I don't know why\nI'm getting wasted at the Hong-Kong spot\nAnd the room keeps spinning, but I don't know why\n\n[Hook]\n\n[Verse 2: Playboy Tre]\nHa!\n(Shout out to my dog Shawty Slim)\nFirst class on my ass, don't know how to act\nTell the broad with the big rack bring a shot of Jack\nI need a lot of that, I should wear a party hat (damn)\nI can't see you fuck boys, call it cataracts\nHong-Kong, nice girls, interracial speaking\nGoose with the hen, call that interracial drinking\nLiving life, stocks soaring, make her pour in\nHit a freak on one leg call her Captain Morgan\nYa'll all haters while we all in\nYe ain't heard we the truth fuck've y'all been?\nBaby take them clothes off, I need all skin\nAnd don't be stingy with that stuff, cause we all friends!\nTell me something freaky\nNow kiss my home girl, we're out of here Tre, boy in my own world!\nCall it Planet Hangover no fat Jesus\nYours truly, Mr. Potbelly, good evening\n\n[Hook]", "image": "https://images.genius.com/e5a4565350f88e7eb8d8b6e1a5b364fb.500x500x1.jpg"}], "artist": "B.o.B"}