{"songs": [{"title": "Memories (Part II)", "album": "Finally Famous (Super Deluxe Edition)", "year": "2011-06-28", "lyrics": "[Verse 1: Big Sean]\nSometimes I dream bigger than I live\nSometimes I think better when I’m lit\nSo go on and light it\nRoll it up, ignite it\nOne time for all my niggas that dreamed it than real life’d it\nI swear I’ve been through everything in life but a coffin\nThey say sky’s the limit, how bitch?\nI’m moonwalking\nAnd my middle name Michael, ho\nSuccess is my idol and being broke is my rival\nBut it’s cool because I got the title, ho\nSee I just want my fantasies in real life\nYou got everything tell me what it feel like\nMotherfuck the radio if I can’t hear mine\nThey give the wrong people more airtime than airlines\nIs you feeling me?\nIf not you feel my energy\nSee I know I’ma make it, but even if I don’t\nDon’t feel bad cause honestly all these times that I had\nThose will be the best memories\n\n[Refrain: John Legend & Big Sean]\nLet's reminisce on the good times and the bad\nBe the best memories\nI hope that you remember me\nReflect on everything we missed\nCause you know we'll never get it back\nThese will be the best memories\nWoah woah, woah-oh-oh, woah-oh-oh, the memories\nCause in the end all you really have is memories\nWoah woah, woah-oh-oh, woah-oh-oh, the memories\n\n[Verse 2: Big Sean]\nAre you willing to give up what you love, for who you love\nOr lose your girlfirend to groupie love\nEverywhere I go I get a group of hugs\nThat's what happens when they need connections and you the plug\nHow many trends you gotta set til you considered great?\nHow many missed calls til you considered fake?\nHow many dreams til it's considered fate?\nI’m eating in a world where I’m considered bait\nA workaholic addicted to bills\nPeople addicted to me cause they addicted to real\nMy best friend got addicted to pills\nI can’t look at him in his eyes\nYou don’t know how that shit feels mentally\nI ain't trying to rock no shirts that say in memory\nI’m praying that he make it, wishing we could go back\nCause honestly all the times that we had\nThose will be the best memories\n\n[Refrain: John Legend & Big Sean]\nLet's reminisce on the good times and the bad\nBe the best memories\nI hope that you remember me\nReflect on everything we missed\nCause you know we'll never get it back\nThese will be the best memories\nWoah woah, woah-oh-oh, woah-oh-oh, the memories\nCause in the end all you really have is memories\nWoah woah, woah-oh-oh, woah-oh-oh, the memories\n\n[Verse 3: Big Sean]\nSometimes reality checks are too big to be cashed\nMailed one when I heard Unique had died in that crash\nSeems like yesterday I just seen her smile and laugh\nI'm stressing over little shit\nWhen I should be happy I can\nThey say my music beating, cause I follow my heart\nI always have faith, light will swallow the dark\nHurtin' with my Mama looking at cribs we can't purchase\nHouses bigger than the Palace\nBut she a queen, so she deserve it\nSo I'm focused, they try to throw me off track\nBut they just hurdles, I'm marathoning\nTo the money and you just running off in a circle\nI'm huddled up with my team, in other words my inner circle\nFast forward a few years later\nNow we the fucking winner's circle\nRemember the first time I was rhyming for Kan\nAlmost as nervous as the first time I rhymed for my mom\nSold out the theater downtown, she said it was perfect\nBut I already dreamed it\nSo it felt like I rehearsed it\nMuch as my grandma took care of me since I was birthed\nSad I used to steal twenty dollar bill right out her purse\nNo I ain't perfect, tryna make a gift out of a curse\nLife out of a hearse\nAnd if I die first then I have the memories\n\n[Refrain: John Legend & Big Sean]\nLet's reminisce on the good times and the bad\nBe the best memories\nI hope that you remember me\nReflect on everything we missed\nCause you know we'll never get it back\nWoah woah, woah-oh-oh, woah-oh-oh, the memories\nWoah woah, woah-oh-oh, woah-oh-oh, the memories\n\nLet's reminisce on the good times and the bad\nReflect on everything we missed\nCause you know we'll never get it back\nWoah woah, woah-oh-oh, woah-oh-oh, the memories\nWoah woah, woah-oh-oh, woah-oh-oh, the memories", "image": "https://images.genius.com/74dafd89a1fed6671db23bd241b486e5.1000x1000x1.jpg"}], "artist": "Big Sean"}