{"songs": [{"title": "Ill Vibe", "album": "The Coming", "year": "1996-03-26", "lyrics": "[Verse 1: Busta Rhymes]\nMy rhymes create life like the birds and the bees\nMake Funkmaster Flex say 'Yo, I'm feeling these'\nFlows make you shit in your drawers. Change your dungarees\nSmoking trees, getting cottonmouth, wild munchies\nBounce down the block, eat food at Luigi's\nAss constipated... too much extra cheese\nBut anyway, while I was cooling down at Luigi's\nI met some Siamese twins from overseas.. Lebanese\nLesbians with the friends from New Orleans\nThey had a fifth friend, she was straight Black-Portuguese\nPretty palm-olive-soaped skin, Aloe Vera leaves\nShe looked like the type of chick you only see in fantasies\nThe type of chick you would KILL for to get between the knees\nYo. I made time to chill with Miss Portuguese\nWould you believe the bitch tried to steal my fucking house keys\nAnd rob me for my G's\nHad to show this crazy broad I mastered my degrees and my Ph.D's\nGot your face on camera; motherfucker say cheese\nYou better get with your friends quick, before I start to squeeze\nGetting caught up in that freaky gold-digger Jamborees\n\n[Hook: Busta Rhymes & [Q-Tip]]\nI caught that ill vibe Tip [word Bust?] yo yo word\nThat ill vibe Tip [word Bust?] yo yo word\nCause when I'm in the place you know my shit be absurd\n[I caught that ill vibe Bust] Word Tip? [yo yo word]\n[That ill vibe Bust] Word Tip? [yo yo word]\n[So when I hold the mic you know my shit be absurd]\n[I caught that ill vibe Bust] Word Tip? [yo yo word]\n\n[Verse 2: Q-Tip]\nI got weight on my shoulders in the form of this beat\nAin’t nothin' sweet, on the street, for good deeds I compete\nCome on complete, and unique, so get back in your stance\nWe enhance and we're playing the whole world circumstance\nSo do good in your hood even though you puff lah\nPositive to comply\nDon’t screw face and act rah\nProgress, don't fall back. We can't have that\nI'll hold your hand, Black\nWe can't wind up with scratch\nI put my best foot forward as I play this life\n'Cause this world is bound to get ya like a double-edged knife\nIn the jam we regulate, 'cause we organize\nLogic-a-lly thinking when along's enterprise\nA lot of brothers from the ghetto got the gift of gab\nPeace to the West Coast and the East, we fab\nNeed I make mention that the crew we've got\nMake things get hot, like the FoFo shot. Blaow!\nNo, we don't promote no guns, but don't turn that cheek\nIn the world that we live, kindness is viewed as weak\nSo, we got to stay on point for all these lizards and snakes\nSome of them come as friends; some of them come as Jakes\nWe decipher all the frauds and build grounds with our friends\nWhy's that?\nSo we can live right until time ends\nYo, why's that?\nAmalgamate, so we can get these ends\nYo, true that\nBusta and Tip, you know we make minds bend\n\n[Hook] - performed in reverse order", "image": "https://images.genius.com/e8769bd52f12b0c4930edbc0a93c9cca.1000x973x1.jpg"}], "artist": "Busta Rhymes"}