{"songs": [{"title": "Ghost & Giancana", "album": "Put It On the Line", "year": "2005-11-18", "lyrics": "[Intro: Ghostface Killah]\nYea, yea\nIt's like rap pa', huh? What?\nY'all bitch-ass niggas, what? What?\nLeave a mark on your face, duke\nWord, uh-huh, you fake fucks\nEh-yo, eh-yo, eh-yo..\n\n[Ghostface Killah]\nI bathe in a tub of guns, dry off with the clips\nNow I'm automatic Jack, that's what I've become\nGangsta lean leanin, peach cobbler pockets fit the graham cracker\nOutfit you still Dream of Jeanie in\nKings, stay 'greein, nightly prince Of Egypt\nPlenty of days I read up, skiied up, whips all beat up\n7:30, the sky is fallin, the most of this dyed with dirty urines\nIt's the dark-skinned Kris Kringle\nCrisp bangle material, boggle minds how I popped up in your cereal\nRocks the eagle beat with the rocks pushed in\nPediatric wildin, grippin the floors like cushion\nSamuel Jackson, Action Jackson, Mike Jackson, Staten\nDusthead niggas that'll have you laugh, you call\nQuicker, and we brawl in big arenas, G&C\nCatch me in the spot with a guillotine\n\n[Hook 2X: Ghostface Killah]\nIn the back of the church, my book be the Book of Life\nDonated nothin, hit the preacher wife\nThis go to all real niggas that be shootin dice\nStashin ya cracks and maggots stick to me in life\n\n[Kool G. Rap]\nEh-yo we pot of soil, shot our nines of chrome\nJust watch how many minds get blown\nWhen I cock mines behind your dome\nThey gon' find your bones\nWith your top popped behind your home\nHavin a stumb' runnin to find ya phone\nB.G.F. and when we the kind to roam\nRoll through ya hood and we shine the stones\nBlind every dime in the zone\nShit on every line in the poem\nAnd drop a jewel like a diamond in Rol'\nB.G.F. war ones, let the fours dump in the forefront with your horse ones\nYour body found inside of a Ford trunk, smellin like four skunks\nBlast up and cut into four chunks\nShot down and not found for four months\nWho playin outfield without a chest shield?\nWanna move? Choose ya weapon of steel\nNigga we 'bout reppin for real\nOnly take a second to peel\nShould've known there was a Tec in the deal, nigga", "image": "https://images.genius.com/b7b55998d5f43c353e2149b260e48a8f.700x700x1.jpg"}], "artist": "Ghostface Killah"}