{"songs": [{"title": "Window", "album": "Goblin", "year": "2011-05-10", "lyrics": "[Intro: Dr. TC]\nTyler, we, ah, I know it's short notice but I brought all your friends here\nFor some reason I couldn't get a hold of Taco and Jasper\nBut, I just brought all your friends to talk to you\nBecause, they're really worried about you\nI thought it would be better if, they could talk to you\n\n[Verse 1: Domo]\nIt was all a dream, I used to read Complex magazines\nWhen I rhyme, I'm tryna get pictures in High Times\nSmoke trees and see my dreams hanging in the skyline\nSwanton bomb off the bed into a fine dime\nIn my mind, I'm just tryna smoke the finest\nAnd get high sticking bad heinas in vaginas\nI'm the flyest when it come to this, fire when I come to spit\nI am getting higher when the lighter comes in front of this\nI'm a stoner, yeah, yeah, yeah, you get the picture now\n30 thousand feet gon' make it hard for me to simmer down\nAnother flight, another beat, another city, wow\nThus another couple bitches crying when I kick 'em out\nWhere we at? We on top of the world\n\n[Verse 2: Frank Ocean]\nAnd five minutes from suicide, I biked it to the park\nI walked onto the block, met a guy, burgundy 'Preme snap-back\nHurling himself at cars, and flirting with blonde Cadillacs\nAll was gray, all was gray, Frankie had the blues in fact\nBunch of pale hipster girls, pretty, but they booty flat\nTeenage males, couldn't tell I was going through it\nHad a wallet full of cream, Amex Green, Bimmer almost black\nParked in front the studio Bastard's recorded at\nEarl, Gilbert, Tyler, Hodgy, Domo, Left, Taco, Nakel\nSydney, Lionel, Juan, Michael, Jasper, Hal and Matt\nBet I'm missing several but I had to bring that pattern back\nWe live inside a house that says fuck 'em on the welcome mat\nDeep inside the ear canals of Bill O'Reilly's daughter that's where I'm at\nNow where we at? Wolf Gang, where we at?\n\n[Verse 3: Hodgy]\nSwell motions get promotions, to my whole team\nHell yeah, I smoke weed 'cause I like to go green\nProfessor Beats educates niggas, let me proceed\nShine chandelier bright might make your nose bleeds\nWe at Randy's ordering that 306\nMilk and glaze is the greed gold mix me\nYour bitch is coming along, yeah, she hum to my song\nSinging like they were for her, but they were for the blur\nNo longer, but we were in premature, immature\nShe's unsure, I'm for sure, blouse and dress and my shirt\nOn the floor then pick it up, out the door, door\nChased, an imaginary friend, a reverie absorption\nImpregnate the dream 'til it has an abortion\nWhere we at? We on top of the world\n\n[Verse 4: Mike G]\nEverything they say I'd never have, I'm seeing\nNow, I bet they see that we balling like All-Star Weekend\nAlways been the most cool, they chase our shade\nThey say life switches pace when you got shit made\nSo I'm just tryna get paid, don't you remember the days\nWhen your dreams were the only thing that kept you sane\nAnd too often they think that they could stop me\nNow every show we makin' half a Maserati\nAnd the only thing blocking me is paparazzi\nNow it's gold Rolex's if they try to clock me\nEverything stays in the box like fighters in hockey\nMiss me if you're thinking we slack, work hard\nI got the world saying every single Friday is black\nTook your bitch, you ain't getting her back, cause she know\nWhere we at nigga? We on top of the world\n\n[Interlude: Tyler, The Creator]\nWhere we at, niggas?\nWhere the fuck we at, man? You niggas don't know me, huh\nWhere we at?\n\n[Verse 5: Tyler, The Creator]\nDown to fucking Earth, huh, down to fucking Earth, huh\nFuck everybody, here goes some extra girth, Sir\nYou fucking critics are making my nerves hurt\nSince I'm saying fuck everybody I guess that I'm a fucking pervert\nMy window is a book and I'm a fucking crook\nStealing phones to call home but the line is off the hook\nMy mom ain't paid the bill, guess I can't pay it either\nI ain't signed a fucking deal yet\nBut when I do, Clancy and Dave are taking percentages\nThat could pay the whole fucking city's mortgage\nHopefully, I make a lot of porridge from touring in fucking Oregon\nFrom playing piano organs and hopefully, I can pay the bill\nShit is getting real, people begin to feel\nLike I'm changing, but their complaining, making big fucking deals\nAbout some shit, they bitch and pout\nCan we get backstage, man? No, faggot, it's sold out\nCome on, why you holding out? I thought we was boys\nWithout me, you wouldn't be Tyler, The Creator, you're from the Dirty\nI can tell whenever you perform, a leopard can't change it's spots\nBut I'm a fucking unicorn Whatever, man\nLook, you can't stop me, I'm going full Monty\nFuck that, I'm Hitler, everyone's a fucking Nazi\nWolf Gi-di-dang you be roaming where the fox be\nAnd I be where, anybody cares\nI try to preach \"Fuck age, live dreams and have fun\"\nHere’s some give a fuck cake Oh, maybe I should have some\nAsshole, have none\nHow can I wake up on the wrong side of the bed, when I don't even fucking have one?\nWhen I'm on that stage, I feel important\nA whole fucking assortment of children that's taking Ritalin\nBecause the teacher said that the therapist wasn't feeling him\nYou gotta be fucking kidding me\nIn school, I was a zero, now I'm every boy's hero and they fear it\nYou can hear it when that little fuck is reciting my lyrics, yeah, I'm rebel nigga\nCheer it, dead parents everywhere, it's smelling like teen spirit\nOkay, fuck it, Elvis has left the building\n\n[Gunshots]", "image": "https://images.genius.com/fd29e400e2d672aa992f9fda170e9959.640x640x1.jpg"}], "artist": "Tyler, The Creator"}