{"songs": [{"title": "Light Your Ass on Fire", "album": "The Neptunes Present... Clones", "year": "2003-08-19", "lyrics": "[Intro: Pharrell Williams]\nWhat you say your name was?\nWell, um, lookin' real sexy right now\nYou and your girls are lookin' good\nLook, why don't y'all take off y'all jackets?\nWhat's your name, baby? Word? Okay\nTell your friend right here, this, this my man Busta\n\n[Verse 1: Busta Rhymes]\nHa, I know you starving for this shit\nBaby, I'm feelin' your hunger\nI'm so clean, call a nigga Felix Ungar\nSo what if I said it? Baby, I'm still gon' tell ya\nI hope your ass bigger than Willona and Thelma\nListen, it's Busta Rhymes, bitch, I ain't never fail ya\nYour ass all over like paraphernalia, hmm\nSee, the police gon' jail ya\nFor walkin' around with the kind of ass that'll kill ya now\nDon't worry 'bout it, I got money to bail ya\nShorty stackin' like a mule, type of shit that'll scare ya\nHeadboard bang, bump the side of ya head\nWatch how ya ass spread spill all off the side of the bed now, hmm\nNow what you do to the dread? Baby, your ass really changed\nWhat he initially said, because a nigga dead\nBut fuck 'em, 'c-c-c-cause now we vibin' and talkin' and shit\nI love to hear your ass go (ga-ga-goon) when you walkin' and shit\n\n[Chorus: Pharrell Williams]\nMove, girl, like your ass on fire\nLike your ass on fire\nMove, girl, like your ass on fire\nLike your ass on fire\nMove, girl, I'll light your ass on fire\nI'll light your ass on fire\nMove, girl, I'll light your ass on fire\nBitch, I'll light that ass on fire\nMove, girl, I'll light your ass on fire\n\n[Verse 2: Busta Rhymes]\nBust it, baby, I know you probably really\nNeed a tablecloth to cover yo' ass\nDiggin' in your pocket while you're rubbin' yo ass\nShit so big, just put the club in yo' ass\nPrep the H2, park it right in front of yo' ass\nI see your little gap between your cunt and yo' ass\nAnd make you jump inside the whip and smoke a blunt with yo' ass\nI'm sayin', hmm, the shit'll spread like a rash\nThe way they ass wiggles, see I got the shit on a smash, now listen\nI light the L, smell a whiff of the hash\nAnd bag all the bitches, now watch you see me zip in a flash\nI'm sayin', hmm, now I'ma put you on blast\nJust like a tint window when you put your shit on the glass\nBust right through the window then it sit on the dash\nAnd have a nigga drivin' reckless 'til you makin' him crash\n(Ha, c'mon) We makin' money and shit\nNow pop your muffin while we be watchin' you shakin' your shit\n\n[Chorus: Pharrell Williams]\nMove, girl, like your ass on fire\nLike your ass on fire\nMove, girl, like your ass on fire\nLike your ass on fire\nMove, girl, I'll light your ass on fire\nI'll light your ass on fire\nMove, girl, I'll light your ass on fire\nBitch, I'll light that ass on fire\nMove, girl, I'll light your ass on fire\n\n[Bridge: Busta Rhymes]\nWelcome to Hot-and-Hazyville\nIt make you wanna dance 'til you break your heels\nI know you love the way the God make you feel\nNow watch me get deeper than a Navy Seal (Navy Seal?)\nIt got a crazy feel, shit feel like you in a danger field\nHypnotize, stuck it in her, daze for real\nThat's exactly why we call this one Hazyville (Hazyville)\n\n[Verse 3: Busta Rhymes]\nBaby, just shake ya ass 'til you spread on the floor\nI noticed that your ass too big for your drawers\nYou need a, a chiropractor just to marry yo' ass\nTo tell the truth, you need a tractor just to carry yo' ass\nFo' real-a, you motherfuckers probably think that I'm playin'\nAll bitches love to talk and all that other shit I be sayin'\nAnd goin', hmm, see how you puttin' it down\nI love the way you shake it, throw it around\n\n[Chorus: Pharrell Williams]\nMove, girl, like your ass on fire\nLike your ass on fire\nMove, girl, like your ass on fire\nLike your ass on fire\nMove, girl, I'll light your ass on fire\nI'll light your ass on fire\nMove, girl, I'll light your ass on fire\nBitch, I'll light that ass on fire\nMove, girl, I'll light your ass on fire\n\n[Outro: Busta Rhymes]\nWelcome to Hot-and-Hazyville\nIt make you wanna dance 'til you break your heels\nI know you love the way the God make you feel\nNow watch me get deeper than a Navy Seal (Navy Seal?)\nIt got a crazy feel, shit feel like you in a danger field\nHypnotize, stuck it in her, daze for real\nThat's exactly why we call this one Hazyville (Hazyville)", "image": "https://images.genius.com/520dc207b133251d7295351bc1623695.1000x875x1.jpg"}], "artist": "Busta Rhymes"}