{"songs": [{"title": "W.R.O.H", "album": "These Days…", "year": "2014-06-24", "lyrics": "[Intro: Ab-Soul]\nAll my life\nAll my life\n\n[Bridge: Ab-Soul]\nI say all my life, all my life\nAll my life I knew I was tight\nI say all my life, all my life\nAll my life I knew I was sick\nI say all my life, all my life\nAll my life I knew I was ill\nI say all my life, all my life\nAll my life I knew I was I'll be here\n\n[Verse 1: Ab-Soul]\nI'll be there, everywhere, tell the truth you wouldn't dare\nCross me like the gold you wear\nSoulo flow like the solar flare in the open air\nSo much smoke that I'm comatose, but I still want mo'\nTDE generals, she ain't spiritual, but she still on Soul\nGod bless, God body, no fear in nobody, no thing\nCan I proceed? Collect all of my proceeds?\nDon't I flow like I don't bleed? Every cut is just dumb\nAfter me there will be none\nI told you there is only one (Soul!)\nYeah, and I just might be in your hood\nCausin' havoc with my bros, and it's still all to the good\nHorse and carriage when I roll, it's over, hope it's overstood\nI'm in Hollywood, ‘cause I remember when\nI had 50 cent up in da club\nAll my life I knew I was major, I don't need no major\nI don't even write rhymes\nI really shouldn't have to sign paper to dominate the\nGame y'all praise on hand and knee\nJust waited 'til it came to me\nI just kept it real with y'all, keepin' it real with me\n\n[Hook: Ab-Soul and JMSN]\n‘Cause I ain't got no fear, under the atmosphere\nTryin' to stay high, as long as we down here\nListen closely, see what we 'bout here\nWho really 'bout that, you'll see when the smoke clears\n‘Cause we really out here! (We really out here!)\nWe really out here! (We really out here!)\nWe really out here! (We really out here! Yeah, yeah, yeah!)\n\n[Verse 2: Ab-Soul]\nUh, and it might not be such a bad idea\nIf I never went home again\nFuck on the same hoes again\nBumpin' \"Druggies Wit Hoes Again\" with my bros again\nNo, I want the world chico and everything in it\nEvery beverage with codeine in it\nHow the fuck you say I sold my spirit?\nI'm still takin' blows at the Senate\nClaims of Illuminati, I'm just tryna illuminate\nPraise to the most high; God, Jah, Allah, Yahweh\nSelassie eye, and I'm proud to say\nI never need a 9 by my waist\nNiggas still respect my gangster, celestials respect my space\nAnd I just might be in your hood\nCausin' havoc with my bros, and it's still all to the good\nHorse and carriage when I roll, it's over, ho, it's overstood\nI was overlooked, I went overboard, now I'm overbooked\nAb-Soul-Lute just, my life is like an open book\nRead between the lines, nigga\nI did this shit legally blind, nigga\nYeah, Soulo, ho, Carson arson with Del Amo\nTell your folks I said hello, I ain't never scared, ‘cause…\n\n[Hook: Ab-Soul and JMSN]\n‘Cause I ain't got no fear, under the atmosphere\nTryin' to stay high, as long as we down here\nListen closely, see what we 'bout here\nWho really 'bout that, you'll see when the smoke clears\n‘Cause we really out here! (We really out here!)\nWe really out here! (We really out here!)\nWe really out here! (We really out here! Yeah, yeah, yeah!)\n\n[Bridge: Ab-Soul]\nI say all my life, all my life\nAll my life I knew I was tight\nI say all my life, all my life\nAll my life I knew I was sick\nI say all my life, all my life\nAll my life I knew I was ill\nI say all my life, all my life\nAll my life I knew I was I'll be here\n\n[Break: Ab-Soul (Interview)]\nThese days, at this point in my life, I kinda really wanna use music to help people get through their days instead of just staying in the dumps, just keep going. Bring light to the situation. Maybe, you know, try to find your own personal message in that incident, that experience, and try to move forward…\n\n[Battle Verse 1: Ab-Soul]\nY'all got me? Everything good? Y'all can hear me?\nBefore we start, let me just say this, let me just say this\nI'm datin' you, Day… wait, wait, pause, no gay shit\nWhat's the difference between a date and a day anyway, Day? A date is a day that's marked\nI'm smart, and just ‘cause I know you love 'em so much\nI came with name flips for days, tailored just for Day\nI'm expecting Day to base his verse on data based on turds\nMy database said Day the basehead that date a basehead\nIs he dope? No. Who gave Day the base?\nBall is what we do best\nFlock his projects; that's a home run\nDay, the baseball is what we do best\nCarpe diem, that's how you say \"seize the day\" in French\nI stand behind these bars for the rest of my life\nI will never see the light of Day again\nNow witnessing this rare occasion\nI bear fruits of my labor, this Grape is green\nI gotta eat on the go, Day\nI hope they told you that everything that Soul say don't go a long way—don't go a long way, what?\nA ho in Chipotle, no, this is food for thought\nFrom a dog on top\nWe been nuts, there was a fool who thought we was new to this, but who knew this would end up\nA glow stick in a uterus; that's Lyt in a box\nAnd that's light, that's light\nBut Lyt like to lick twat a lot, so that's right\nThat's what y'all call street?\nNo tales from the Crip this evenin'\nHe slip, seems he forgot what the C meant\nIt's your dumbass' fault that last part was so concrete\nBut I guess you'd have to be kin to get that bar, b\nPardon me, I bet right about now\nYou feelin' like Jordan down in the Jordan Downs\nIn fact it's crazy that you even play ball\nTo clear your thoughts before raw backwards\nAnd that's cool, but for this round, save the bull\nBefore you let the Jordan Downs and Jordan down\nNow, as for the crew\nWell, uhh, the villain been itchin' to skin a dog\nAnd this nigga bought\nWhat, a hundred and three dalmatians?\nIt's safe to say your mob of dots won't make it\nAnd I'm a fan first, but it won't take too many seconds\nTo leave you in a damn urn\nYou deserve this disservice\nI put this man in ER's if he don't got no manners\nMan, word, I'm expectin'\nSome etiquette in your segment, kid\nI brought you to the 'Stu to show how we do\nSo all them antics and funny shit you do for the cameras don't get aired here, they can't see you\nWave your title to this tidal wave, we do\nAnd you don't appear to be a peer to me\nFor real, you should kneel to me or somethin'\nFuck it, to keep it hundred, you're nil to me, that's nothin'\nHeard they been raisin' raisins down on Grape Street\nThat's crazy, right? That's what happens when you expose them Grapes to too much Daylyt\nSo your chances of standin'\nMuch smaller than my plan to defeat you\nWait, what, do I gotta put it in photosynthesis or somethin', son? Shed some light on Day? 'Til he's cropped out\nNo, not now, I won't need a plant to defeat you\nThe sequel, this movie, won't need to be continued\nYou finally encountered somethin' you can't counter\nCoward, you're counterfeit\nYou ain't gotta be in a Walgreen's pharmacy\nTo see Quill drug over the counter\nAfter your mother consumed you\nYou were the fruit of the womb\nAfter you were born, I'm sure you wore Fruit of the Loom\nNow I'm tryna figure out, is you from Grape Street, Crip\nOr just another fruit in this room?\nIt's crucial, you choose\nI'm sure you don't want me to assume\nI should be against the law to run into\n‘Cause we all know in L.A. I'm double you\nAll so true, today is the day I split Day in two\nWhat the fuck has battle rap turned Day into?\nAre you from Gotham or from Watts?\nAre you Batman, Spawn, or Devone?\nDid you really think \"Paul Walker\" was a dope song?\nIf so, you were wrong\nBut hold on, I got one more, and don't lie to me\nDo you really have a Batmobile outside, my G?\nDon't be so transparent, this nigga Lyt through\nIf you don't know what transparent means\nLet me enlighten you\nIf it's transparent, that means that it lets the light through\nSo I should smack this trans' parents for lettin' Lyt through\nLike, the nerve of this cat\nLyin' with a motionless emotion, this nigga Day all bitch\nSomebody get Quill a quilt before Quill get killed\nDo Quill got skill at all, homie?\nIt was some Braveheart shit; all I heard was nah's, homie\nDid you really expect to last, Day?\nYou know Revelations say that we livin' in the last days\nI mean, I see you skimmed through Genesis and Timothy\nBut did you get to that page? You got gats?\nYou think your little arm'll get in the way of Armageddon?\nForget it, Day! No, really, forget this day\nIf I had a time machine, I'd go back in time to see\nJust how many people would say yes to Day\nNobody, fam, nobody, fam, that's why I'm ahead to Day\nNo, no body, fam, that's why I'm a head today\nNo, nobody fam, that's why I'm ahead of Day\nSomebody check the clock, I think I'm ahead a day\nSend him to the choppin' block, off with the head of Day\nIt's only right I be blunt to Lyt\nI only gave Lyt a match to light a blunt\nI see I should have used the lighter instead\nChill, Loc, we ain't smokin' no purple\nWe need the fire instead\nWhen I think of daylight, I think of shit like… breakfast, morning, birds singin', kids playin'—see where I'm goin'?\nThat means you better break fast\nOr I'll have your family mourning'\nWhen that bird sings, kid, I ain't playin' and you know it\nBut you know what? Hold on, hold on\nLet me get you right, we have this shit\nTake this 500 before you clap this shit up\nSay this, let me say this, let me just say this\nThese flashin' lights got Lyt flashin', nigga, for the glory\nYour buzz lightyears from here\nQuill, and you tellin' toy stories\nYou boys bore me, that's why I'm hoggin' all lanes\nAll your bars Häagen-Dazs, that's on everything\nDay a dairy queen, Deluxe; bless, King!\nDearly beloved, all first verse, all first verse\nYou know I brought a hearst\nFor the sausage you brought worst\nDearly beloved, here lies this little light of mine\nThat tried to let it shine\nAnd I hate that we have to hear lies\nFrom this little light of mine that tried to let it shine\nBut I'm ill, you men ate when I finished Lyt\nYou get it, Lyt? That's how you ILL-u-min-ate\nAnd finish Lyt, good night\nHold on, hold on, hold on\nLet me get you right, you got that for me?\nBrought you some complimentary TDE ski masks\n\n[Battle Verse 2: Daylyt]\nQuestion, you know how many copies The Matrix sold?\nIt don't matter, The Matrix's old\nI double cats, I ask 'em if they seen the glitch\nNo, no, no, face it, I got it covered\nPrevail, they say the sail was a thread to hell\nThe gravitational stitch, ‘cause some niggas seem down\nThey come up with this perfectly clean round\nBut I hope you not doin' this cause of fear\nOf the pen, I'ma prove you pussy within\nBut I guess it's up to you to risk your career\nI retire niggas, I'm the slow leak crew\nI could OD too, and even the odds some\nHe thought he could least get a baby victory\nBut all he got was \"Nah, son.\"\nCheck this out, he not ready\nEither you fight back or I Ether you\nThought you could face what I hand you\nWell, this is isn't peek-a-boo\nSoon as I took a peek at you, you looked shocked\nPeep it, you put everything at stake\nWell done, this is beef, right?\nJesus, holy cow, cut the bull, Soul, before you get meatsliced\nI'm from the third, I gotta try you\nGuy, you play Ryu, lose a ken in a street fight\nNice slow guidance with both sirens\nYou still couldn't see Lyt\nDivision, I got it covered, I'm so eye lit\nPilot, fly, I be the goblin; we battle for a stack\nIn fact they had to get a cataract, ‘cause I be the problem\nBut it's useless, use less filler, excuse the excuses\nBut, but, but… these asscheek niggas dead\nYou said you would fry Day previously\nBut that's what the last weak nigga said\nBut, but, but keep cool, Joe, ‘cause dog crazy\nGet down, we turn niggas vegetable if they don't let us up\nHe know the heat blowers like Daffy at the casino\nNigga, you better duck\nBut I tell them tails we never tuck, we gon' line that ass up\nI from the Watts block for decision\nMy profession is stompin' squares the fuck out\nWe played hopscotch for a livin'\nBut that's def, that's just plain old def\nIt's funny how we're all in here but bro don't listen\nHave a seat, pick chairs\nPicture this photo, this a Soulo, is it?\nHold up, is it because he 'bout to get smoked?\nCommon roll the physics, so exquisite\nThought I was in here dolo\nNo, bro, somebody tell Soulo this not a solo mission\nThe deal closed, SoHo is it\nThought you could fuck with me, gal? I gotta Cotto-split him\nLook at your girl dead in her eyes\nAnd say \"Fuck Dorothy, dog!\"; I'm toto dissin'\nBut at this moment, everybody in the room should be scared as hell, as I release bars, they better bail\nObjects that I process is parallel\nLet's get this aligned, minus sinus\nThe stuff he knows flew overhead, it's cold, redemption\nStay still, as I apply DayQuil, ‘cause you look like you need medical attention, don't mind me\nSee where mind be is a mine, explosive, interior is inferior\nThis is a hobby probly, y'all see I got the drop on everybody\nThat's why I reign superior\nWhether you like or not, it's Hell for you, ice plate\nThese blister niggas still can't overshadow a nice Day\nRemember, you did say you would fry Day?\nBut you don't realize you're on the weak end to the streets\nPreacher for they peeps, you asshole\nYou in the motion to grab toes, you're reachin' for defeat\nI tell 'em I got the four in\nCut the sheep, it's all for the woolish\nGame I play is death, get sword for the hoodish\nActin', it's Tinactin, it's all for the footage\nI'm dope, I'm practical, crack to you\nI need a lot of space; the galactic crew, the actors knew\nYou feel it it's Felix, see what the old cat could do\nBut you got the roots stirred up, gelatin dropped and slide\nThis game is stormchasin'\nBased on whether you got the drive\nWin rounds, destroy their whole city—will they get tore?\nNay, do you realize I still got a break, brother?\nWhen I quake in action, think of blanket jackin'; take cover\nThat's lightwork, Soul\nCut your lights switch, see how the light works, Soul\nI cut the light switch off and your light switch off, Soul\nSomebody get this nigga help! I mean, like, Soul, assist him\nGet him help, I'm sendin' this nigga out the solar system\nI mean, it's simple, Aretha Franklin; you a Soul, sister\nThat's enough, man, I'ma have to throw one of these masks on, man, should I finish him off?\nAnd I told you once, I gotta give 'em the Quill\nAnd I gotta give 'em the skill\nI be on my tip, like I tried to give him the bill\nNew approach, Bull coach; I tried to give 'em the feel\nFor Watts, starvin', gotta get us a meal\nBein' modest, this is modern astrology for the real\nYou can't back up defeat, but I try to get up the hill\nCold, rack up the heat, but I'm tired of niggas that grill\nChicago in my blood, but I used to be the shyest\nCat form, but now I'm back searchin' for the highest\nPlatform, see where I come from? It was sirens, blackboards\nEyelids see the violence, what is that for?\n.44 shoot, they screamin', \"Who's that guy?!\"\nJesus, his face, they screamin', \"Who's that?! God!\"\nWe be on the top, careers gettin' too high\nThey knew I would get a million dollars, what I do buy\nThat pink kid in the cup, that Majin Buu fly\nTragic, twin maggots; I grew up too fly\nThey askin', \"Who I?\" in front of that triangle black\nThat's that guy that come with the side kangol hat\nWe take it back from slangin' packs to the stars mission\nOlder now, I'm in the Rover, but it's not a Mars mission\nSettle down, one child, merry; feel like I'm Marge pimpin'\nBitches wanna eat my shorts; feel like I'm Bart Simpson\nI feel this a full moon, chocolate, dreams puddin'\nThey be likin' everything I do, they're teen wolfin'\nBut you got it, you got it bad\n2Pac, don't watch the world sad, come back\nTwo watches, that's pocket change\nDude coppin' that clock exchange\nCredit good, I'ma pull the card out\nBetter be hyesterectomy, show 'em how to ball out\nCough, they can show that they're stomach so they fall out\nWhip, double roof, dog barkin' in the dog house\nAnd I gotta give 'em the light\nMy people in the struggle, I gotta give 'em a fight\nAin't no equal piece of puzzle, hope God'll give us the mic\nAin't no sequel to this puzzle, I gotta give us the life\nWow, they say the Bugatti went up in price\nWow, that's a million, I'm done\n\n[Outro]\nCes jours-ci, je suis très concentré", "image": "https://images.genius.com/077bbd628ad3b7383f095afde8670b76.560x560x1.jpg"}], "artist": "Ab-Soul"}