{"songs": [{"title": "Last Call", "album": null, "year": null, "lyrics": "[Ol' Dirty Bastard]\nThis recordin is Dirty and it's Stinkin\nFunkier than Peppi Le Pew so I was thinkin, about\nDroppin this single on the charts, lettin ya know\nHey, the kid has heart, I never deny myself as being\nDope, but in my last jam, niggas slept on my notes\nYou thought that I was weak? Huh? Let me speak\nMy rhymes come funkier than ya grandfathers feet\nSo listen mister, don't you ever forget\nThe rhyme is dirty, you couldn't even clean it\nWith Comet, for even Wolrex, some tried Ajax\nOnly mix with the best, forty-eight tracks\nYo, I get down with the Ason sounds\nLyrics that be flowin from miles around\nSo let the music shut ya ass up, then feel the uppercut\nNow I make ya fall to ya butt\n\n[Master Fool]\nHo-ho-hold up, Master Fool\nTakin' it on down, jugga-jugga-ju\nFall on ya butt, ya ass gon' hurt\nThey call us WINGWORM cuz we mastered this dirt\nI act like a drunk but I'm out for the dough\nI mastered the funk, Dirt mastered the ho's\nOnly Master play the Fool, I worked hard and paid my dues\nTony Snatcher played the fool\nAnd man meater eater played the bone\nI come in the club with no ID\nThey gon' have to close the club up messin wit me\nUp.. Dirty and Stinkin stuff\nIt's that Dirty dick NUH with the Stinkin nuts\nLast Call now drink it up\nMe and Dirt want a pound for some Stinkin stuff\n\n[Hook x2: Master Fool]\nLast Call for alcohol, everybody out the bar\nGet ya back up off the wall\nPeople.. ohh.. ohh.. people.. ohh.. ohh\n\n[Ol' Dirty Bastard]\nYo, let me continue, verse number two\nStyle is wild, dirty and stinkin like doo-doo\nIf ya hangin around, ya changed ya mind\nIt is a bad influence, but yo it's my rhyme\nI sit down and I say to myself, \"Self\nYo, are you rated top the shelf?\"\nI drop the single for you to get a dose of\nAs I lay back like a pillow on a sofa\nGettin paid? Yeah right, Willy\nWhy askin me, G? What? What? What? What? You know me\nMy mouth is sugar, sweet as a honey bee\nTaste like a forty, Stinkin like Old-E\n\n[Master Fool]\nFool in this bitch, where the fuck is the drinks?\nNo open bar!?! Where the fuck is the drinks?\nThat bitch over there with her man tuckin his link\nAll strip club bitches straight clutchin his mink\nNiggas official, big guns, wavin the pistol\nMy dogs lookin for the brew now we bitin the gristle\n(Stop fuckin with them guns son you playin too much)\nCatch a charge drinkin bro', I ain't playin too rough\nFucks! Lay in the cuts and hug the butts\nGrab a big five whether you a scrub or not\nRobbery, robbery, pop, pop, poppin like a Glock\nRobbery, robbery, drop, drop, drop it like it's hot\n\n[Hook x4]\n\n[Outro: Ol' Dirty Bastard]\nDoo-doo, doo-doo, doo-doo, doo-doo\nHeard Master singin that shit?\nStinkin blue Palmaid..\nDoo-doo, doo-doo, doo-doo..", "image": "https://images.genius.com/d7e323c108da42ed17c2a306b8658e1d.500x335x1.jpg"}], "artist": "Ol’ Dirty Bastard"}