{"songs": [{"title": "Ima Boss (Remix)", "album": "Back 2 The Throne", "year": "2011-11-09", "lyrics": "[Intro: DJ Khaled]\nRemix!\n(One two, one two)\nThis the I'ma Boss Remix\nMeek Milly\nLet's go!\n\n[Verse 1: T.I.]\nI'm ride or die as I'm ridin’ by, holla Westside right inside of my\nBimmer 760i, try me let off sixty shots\nAgain we got the city hot and popping like it ‘posed to be\nHoes who not ménaging got no business standing close to me\nSo cold, a ferocious G, niggas ain't as dope as me\nMind your fuckin’ business, watch your mouth when you approachin' me\nI fuck with hoes who fuck with hoes, do pills and powder socially\nI like 'em, I don't love ‘em though, cold heart emotionally\nCaptain where the ocean is, riding in the Ghost again\nSlap you with a lot of spit until she swallow all of it\nCall the shots, run the shit, on some big money shit\nSerious 'bout my hustle all these cowards on that funny shit\nRapping 'bout a bunch of shit and you ain't even done it yet\nYou the one they gunning at, how I'm ‘posed to honor that?\nYou all talk dawg, flaw and I ain't having none of that\nI'm big boss dawg, floss all day and run it back\n\n[Hook: Meek Mill]\nBitch, I'm a boss\nBitch, I'm a boss! Bitch, I'm a boss!\nI play the shots, I call the calls\nWe in this bitch, it’s going down\nYeah, I'm the king, now where my muhfucking crown?\n\n[Bridge: Swiss Beatz]\nYou a boss, she a boss, you don’t care what it cost\nYou just buy that motherfucker and you throw that shit on\nYou be popping them tags, we just throw it in bags\nAnd then we hit the fucking block, we be droppin' them rags\n\n[Verse 2: Meek Mill]\nStarted with a dollar, turn it to a M\nUsed to ride Impala, turn it to a Benz\nNiggas used hate me, turn into my friends\nYou should see how people treat you when that money coming in\nBad bitches calling cause I'm balling\nAnd these niggas hatin’ on me cause they starving\nAnd I'm parking Aston Martins where they walking, these niggas ain't important\nThey informants really talking when the people get to honking\nI'm a boss really, Nino or Al Pacino\nHundred racks on this Rollie, it light up like a casino\nNiggas really be fraud, I’ma keep it a C-note\nGot shooters down in Miami, they throw it like Dan Marino\n\n[Verse 3: Rick Ross]\nHad a couple seizures, call 'em minor setbacks\nEverybody praying for me, I respect that\nWoke up in the hospital, where my checks at\nThen I put eight chains, where my neck's at\nHopping in the Ghost, I feel I'm dead set\nWorth 40 M's so respect that\nI put all my jewels on just to bone your chick\nYou know the boss well known for leavin' bonuses\nWe making money, may it marinate\nWhen the work clean, cut it like it’s carrot cake\nD-boys love the way I narrate\nI still whip it like it's Anna Mae\nRemember Momma had a Cavalier\nNow she living like a Cleveland Cavalier\nBetter check the stats, we fillin' arenas\nAnd I got the gats, Gilbert Arenas\n\n[Hook]\nBitch, I'm a boss\nBitch, I'm a boss! Bitch, I'm a boss!\nI play the shots, I call the calls\nWe in this bitch, it’s going down\nYeah, I'm the king, now where my muhfucking crown?\n\n[Bridge 2: Swizz Beats]\nYou a boss, you a boss\nSeven five, seven showers on her\nSpend about thirteen hours on it\n7-57 with the showers on it\nWe spent about thirteen hours on it\n\n[Verse 4: Lil' Wayne]\nLook, I be probably on my skateboard, tryna learn a new trick\nI just fucked an Avatar, now I got a blue dick\nMoney talks, bullshit walks if the shoe fit\nYou pushing up daisies, daffodils, tulips\nI'm in my zone, I'm Angie Stoned\nI point the pistol at you like a camera phone\nI'm Young Money, Cash Money, I'm not human\nI’m tryna get money, money like Mark Cuban\nIf she don’t respect me, she gon' respect this dick\nThe world is an asshole and we the next big shit\nDamn right I gang bang, tell 'em blood up slime\nFuck! I had to say fuck one time, get it\n\n[Verse 5: Birdman]\nWhen I came up in this bitch I was shining every summer\nTook the whole thing, the young nigga doing numbers\nTote two nines, bitch, iced out stunting\nCandy on the Ave, candy on the slab\nHundred Gs nigga, Cash Money millionaires\nHundred mil nigga, how we flipped it off the ave\nBlood rich gang, you know we filthy nigga\nThe money do swang, behind a killer nigga\nCatch me uptown putting it down\nMoving all around, new fleets with my round\nTouch another town, putting it all down\nPop a hundred bottles bitch, we wear the crown\n\n[Hook]\nBitch, I'm a boss\nBitch, I'm a boss! Bitch, I'm a boss!\nI play the shots, I call the calls\nWe in this bitch, it’s going down\nYeah, I'm the king, now where my muhfucking crown?", "image": "https://images.genius.com/bc34559b8a83f2cdd618a7aa819c9fdf.316x316x1.png"}], "artist": "Meek Mill"}