{"songs": [{"title": "Musical Massacre", "album": "Follow the Leader", "year": "1988-07-26", "lyrics": "[Verse 1]\nHow could I keep my composure?\nWhen all sorts of thoughts fought for exposure?\nRelease, then veins in the brains increase\nWhen I let off, make a wish and blow the smoke off my piece\nUnloadin', unfold and the rhymes are explodin'\nAnd the mic that I'm holding's golden\nCordless 'cause the wire caught fire like a fuse\nGunpowder and the slightest bruise is a friction\nThe outcome is near, so listen, here's a brief description:\nA boom and flame and smoke, ashes are dust to dust\nContact is compact when I bust\nMC's are now in a massacre, a disaster, a master at fashion, I\nBeat to death, to a pulp 'til it can't pump\nSpeakers ain't sayin' nothin', now the ball can thump\nAs I'm lookin', I stand like brick buildings in Brooklyn\nThen the stage is took, then\nHavoc struck that could product a holocaust\nKeep in touch the mic when you're holdin' yours\nHuffin' and puffin' and slobbin' and droolin'\nNothing's pumpin', who do you think ya foolin'?\nTommy Tucker? The neighborhood sucker?\nWhat you oughta do... is pick up a tempo\nFrom what I invent, so hard not to bite, but you can't prevent, so\nYou start to kidnap, I watch a kid rap\nWhen he get off, he know he shouldn't have did that\nMinor, old-timer, weak rhymer, stay in liner\nYou won't be inclined to go so, yo\nMaybe later, you're gonna be\nBut for now, you're almost one of me\nNow, the immature imitation's taken from originations\nMade by changin' and a little arrangin'\nSo, perform, if ya still ain't warm, maybe after a roast\nBy the host with the most, it's a Musical Massacre\n\n[Verse 2]\nNever tired, don't even try it, keep quiet\nLike a storm, you could rain, but I riot\nRemains and gains power just like The Towering Inferno\nThe beat's gonna burn, so\nDistance is kept, you better watch your step\nVolunteers go from here and get\nYa out of the flames, pre-heat, the temperature change\nAnywhere within the range of Celsius\nFahrenheit on the mic might melt, see it\nBurns soon as it's felt, see, it's\nTorchin', scorchin', mic's pipin' hot\nSteamin', who's schemin'? Nah, ya not\nJames Brown must've been dusted, disgusted\nNow he can't be trusted\nEmbalmed with fluids, static can cause explosion\nIn fact, impact's closin' in\nTime was up, so I release a time bomb\nBeat gives me a heat-stroke, but I rhyme calm\nPull out the tool, sometimes I wanna break fool...\nBut I was cool like one in the chamber\nLet's play a game of rhymin' roulette\nThen put me up to your brain, then name a rhyme about ya clout\nOne mistake... ya out\nIf this is demonstration, it can't be the same show\nMaybe you're too fly, somewhere over the rainbow\nCourage, heart, and brain, you need rhymes\nTurn on your mic, snap your fingers three times... you're gone\nOr the story won't end the same, and you'll feel the flame\nThe potion was weak, make another antidote\nWhat's the science? Why can't ya quote?\nElements for musical intelligence, rhymes are irrelevant\nNo development, and that settles it\nGo manufacture a match, send me after a blast\nOf a master that has to make Musical Massacre!", "image": "https://images.genius.com/9b590ab143a3ba007bcb44a5bd6af57b.953x953x1.jpg"}], "artist": "Eric B. & Rakim"}