{"songs": [{"title": "You Da Shit", "album": null, "year": "2011-04-12", "lyrics": "[Hook]\nShow em what you got baby\nShow em you the shit\nGo on throw it to the wall, baby something gonna stick, believe that\nFuck these other bitches don’t trip\nYou’ve been working too hard, tell em niggas cut the check\n\nI know you hustle baby, I ain't gotta tell ya\nYou can give it everything but they take it if you let em\nBut bills don’t stop so you keep the money coming\nCause you taking care of mama, lil brother, baby cousin\nDamn the way you move you’re body girl you know your gonna get it\nHow the fuck you else you going where the shoe ain't fitted?\nSay hi to every hater, take a picture screen saver\nThrow the middle finger, tell em bitches see ya later\n\n[Hook]\nNow show em what you got girl\nShow em you the shit\nGo on throw it to the wall, baby something gonna stick, you know\nFuck these other bitches don’t trip\nYou’ve been working too hard, tell em niggas cut the check\n\nThen pick up all this money, I know you don’t mind\nGo on take it to the back and count every single dime\n\nGo on show em what you got girl\nShow em you the shit\nGo on throw it to the wall, baby something gonna give\n\nWith your pretty little buttons you a pretty little flower\nSo when they talk money, baby tell em talk louder\nCause all that bullshit is smoke signals to the rider\nYou in it for the commission\nEvery muthafuckin dollar\n\nThe way that body movin’ it’s hard to understand\nYou ain't never been a bitch to execute without the plan\nI ain't never seen a market supply without demand\nFuck credit baby tell em broke niggas stop playing\n\nGun snooze off, just take them shoes off\nLet me get that all, how that body so soft\nCause you know it’s gon count baby if you gon give it\nAnd know it ain't a life if we don’t live it\n\n[Hook]\nBaby go on show em what you got girl\nShow em you the shit\nGo on throw it to the wall, baby something gonna stick, yaa diiig!\nFuck these other bitches don’t trip\nYou’ve been working too hard, tell em niggas cut the check\n\nAnd pick up all this money, I know you on your grind\nGo on take it to the back and count up every single dime\nGo on show em what you got girl\nShow em you the shit\nYeah throw it to the wall, baby something gonna give, ya dig!\n\nYou the shit, you the shit\nYeah mami\nYou the shit, you the shit\nUh huh\nYou the shit, you the shit\nYeah mami\nYou the shit\n\n[Hook]\nShow em what you got baby\nShow em you the shit\nGo on throw it to the wall, baby something gonna stick, ya dig!\nFuck these other bitches don’t trip\nYou’ve been working too hard, tell em niggas cut the check\n\nAnd pick up all this money, I know you on your grind\nGo on take it to the back and count up every single dime\nGo on show em what you got baby\nShow em you the shit\nGo on throw it to the wall, baby something gonna give\n\n[Hook]\nShow em what you got baby\nShow em you the shit\nGo on throw it to the wall, baby something gonna stick, ya dig!\nFuck these other bitches don’t trip\nYou’ve been working too hard, tell em niggas cut the check\n\nAnd pick up all this money, I know you on your grind\nGo on take it to the back and count up every single dime\nGo on show em what you got baby\nShow em you the shit\nGo on throw it to the wall, baby something gonna give\nHear that", "image": "https://images.genius.com/f903dae2533e450c8d3cb233aa846020.745x745x1.jpg"}], "artist": "Lil Wayne"}