{"songs": [{"title": "Look What You Made Me Do", "album": "508-507-2209", "year": "2017-06-16", "lyrics": "[Intro: Joyner Lucas]\nMake sure you take that number down\n508-507-2209\nJoyner (hold up a sec)\nJoyner (yeah, drop that shit)\nWoo, woo!\n\n[Verse 1: Joyner Lucas]\nPoison\nYou say that I'm toxic, I ain't had lots of choices\nJust give me brains in the projects, baby, I am not your boyfriend\nLook I ain't got time, but you can book by the appointment\nAnd I ain't gon' lie, I used to be shy, believe me\nShimmy shimmy ya, shimmy yay, bitch, I feel like Ol' DB\nBitch I'm so awesome, even Ray Charles can see me\nHoe stop crying, nobody said life would be easy\nAnd I'ma get mine, yeah, I'ma get mine, yeah\n\n[Chorus: Joyner Lucas]\nNow you see what you just made me do?\nLook what you made me do nigga\nLook what you made me do nigga! Woo!\n\n[Verse 2: Joyner Lucas]\nReady to what? Never been giving a fuck, living it up\nPutting 'em, putting em up, think it's a game if you want, niggas'll front\nI'ma deliver the tons, I'ma just kill em and run, word to my son\nNiggas they never been wrong, I'ma continue to do what's ain't never been done\nBitch you ready or what? Bitch I've been ready to thump, hit it or not\nI bet you taking the fun, I bet you prayin' I fall and I never get up\nBitch I will never give up, killin' em dead in the middle my ghetto and uh\nNiggas ain't never been wrong, I'ma continue to do what ain't never been done\n(Joyner) Holla!\nLot of niggas envy, you just want every dollar\nI'm trying to be friendly, I don't want any drama\nSo please don't tempt me, then I have to empty the barrel\n\n[Chorus: Joyner Lucas]\nMy nigga you crazy, look what you made me do\nNigga you crazy, look what you made me do (Joyner)\nNigga you crazy, look what you made me do\n\n[Verse 3: Stefflon Don]\nThis the flyest shit I ever heard in my life\nThis the type of shit that make you pull up outside\nLike bitch, why you bending my line?\nI ain't tryna fuck your nigga, he ain't even my type\nTold my brother that I love him then I put the phone down\nGotta be rollin' with the burners that be in the ghost now\nTalking about making money and I'm spending your money\nBut spending hella money is the only way you're going now\nYo these private conversations got me thinking out loud\nUsed to queue up out front, I come through the back now\nDear mama, all I wanted was to make you proud\nThat's why I never fucked a broke nigga on the rebound\nAll my daughters know is hustlin' shows\nKill off a pussy in a eight-inch boat\nMaura, I can fly in the sky, my yodes\nChop coming, don't wanna look like you\nFuck with me nigga, I've been putting London on the map\nAin't it funny I'm the first female ting mad?\nI'ma do it, watch me fuck it up and go ham\nGettin keys oversea just so I can bring it back\nI ain't talking bout no coke bitch, I'm all about the crack\nI ain't even have to pay, all I had to do was rap\nI'ma let that line breath, mute that\nGettin keys overseas just so I can bring it back\n\n[Verse 4: Joyner Lucas]\n(Joyner) Poison\nYou say that I'm toxic, I ain't had lots of choices\nJust give me brains in my ride, and baby I am not your boyfriend\nAnd I ain't got time, but you can book by the appointment\nAnd I ain't gonna lie, I used to be shy, holla\nLot of niggas envy, you just want every dollar\nYeah I'm tryna be friendly, I don't want any drama\nPlease don't tempt me then I have to empty the barrel\n\n[Chorus: Joyner Lucas]\nGoddammit you crazy, look what you made me do\nMy nigga you crazy look what you made me do\nNigga you crazy, look what you made me do...\nNigga you crazy, look what you made me\n\n[Voicemail]\nYo wassup, this is Joyner\nI'm unable to take your call right now\nLeave me a brief message and I'll get back to you, peace\n\n[Brief Message]\nHello... hello? (*sighs*) Joyner", "image": "https://images.genius.com/895cf32a9779b29f3e18b6c7cb55b3e2.500x500x1.jpg"}], "artist": "Joyner Lucas"}