{"songs": [{"title": "I’m So Focused", "album": "Poindexter", "year": "2009-09-17", "lyrics": "[Intro : Childish Gambino]\nIt's Childish Gambino, y'all know who it is, how it is and what it do\nMr. Jens Lekman on the track, ladies and gentlemen\nFor those of you wondering for whom the sample is\nAlright. Let's do this. Uh-huh\n\n[Verse 1: Childish Gambino]\nI'm the sickest Nigga ever, go and tell your ma!\nAnd I got a little liquor like a St. Bernard!\nNiggas hold onto Cliffs, like Phylicia Rashad!\nCause I'm always on the edge, but I don't fall off!\nI's a boy in the hoodie and a hat to match!\nAnd the shit bright orange like a pumpkin patch!\nAnd they call me Guy Ritchie cause I work with snatch!\nAnd I'm rich, and a guy. Whatch'all think of that?\nAnd the cops stay on me cause I'm young and black!\nAnd the boy stay crazy like a pound of crack!\nAnd I'm all that jazz like my name was scat!\nCollege dudes like me too love my name Borat!\nAnd I like my girls thick like chocolate, fat like my wallet\nI'm tellin' y'all the truth, like a prophet\nAnd if Gambino on the track, you should cop it\nAnd all y'all Niggas totin' guns need to stop it\n\n[Hook]\nI'm so focused. Yeah\nI'm so focused. Yeah. (We don't play around like that. Listen.)\nWe ain't scared a you! Tell them other mutherfucker we prepared for you! Ungh!\nWe ain't scared a you! Tell them other mutherfuckers we prepared for you! Ungh!\n\n[Verse 2: Truff Syrum]\nBefore you even know how long this song lasts\nYou'll be reelin' and feelin' so flabbergasted\nLike a fast pass that you can't catch, I'll leave you blasted\nLambasted, like I doused you in acid\nI could be takin' some comedy and I'm makin' that tradic\nLike I spin, cause I hocus, I focus, I'm flippin' it back and now it's magic\nAnd the beat go from cool, like plan is to janet, to dammit!\nCuties cute in to inspect my go-go gadget\nWhy? Cause I spit in split time. It's a sign of a double wear prada I'm reachin'\nI'm teachin' 'em for a while that you can't deny I'm alive\nSo existential, my rhymes are quinessential\nI'm an educated black and that's a fact. I'm presidential\nOne riff, and I'm siftin' through n*ggas lies\nGot a gift to keep my eyes on the prize, you best move to the side\nCause I'm goin' for the gold, I'm a stone soldier\nGambino told you Jokers that I'm so, so, so foc- I'm so FO-cusssssssed\n\n[Hook]\n\n[Verse 3: Childish Gambino]\nI'm all grown up, but I'm still Childish\nIt's crazy to think that all them days is behind us\nI remember when niggas tried to stop us\nNow them same niggas on my dick and try for profit\nThis is what I asked for. It comes with the territory\nThis isn't a cry for help, ain't no pinnochio story\nI'm in it just for the glory - I'm in this to win it, babe\nSorry that I came home late", "image": "https://images.genius.com/78bea76bf210cec3130c214f2a4ab5f7.800x800x1.jpg"}], "artist": "Childish Gambino"}