{"songs": [{"title": "How Dare You", "album": "Food & Liquor II: The Great American Rap Album, Pt. 1", "year": "2012-09-25", "lyrics": "[Hook: Bilal]\nYou shine like the lights of Las Vegas\nYou feel radiant and outrageous\nYou're confidence and appeal, so sexual\nHow dare you? How dare you? How dare you?\nHow dare you come do me like that that\n\n[Verse 1: Lupe Fiasco]\nI got my eyes on like the fire zone\nLet's be bygones\nWon't you come and be a line in one of my songs?\nMaybe a whole verse, baby the whole Earth my home\nSo let me show you around the crib\nTell you what I do, I show you what I did\nFlow is on the stove, I'm cooking for the kids\nWrist is in the freezer, heart is in the fridge\nBut we can warm it up, plug the Foreman up\nOpen the oven door, turn the saunas up\nStretch the Benz out, if it ain't long enough\nGet lost in the feeling, they're no longer us\nHop up out the coupe, hop up on the bus\nGive you 'get to the backs', code name for Rosa's sons\nWe're in a better place, give us condolences\nIt's like a player's mate, and like a coma love\n\n[Hook: Bilal]\nYou shine like the lights of Las Vegas\nYou feel radiant and outrageous\nYou're confidence and appeal, so sexual\nHow dare you? How dare you? How dare you?\nHow dare you come do me like that that\n\n[Verse 2: Lupe Fiasco]\nAnd I hope it's all up to your standards\nCause babies really need to be pampered\nI'm behind these tents like a camper\nCause you're out there shining like chandler\nLike a chandelier standing there in your radiance\nI think we all need some shadiness\nOr some vision care, oh no, you didn't dare\nWhile I sitting here like Huey in his wicker chair\nYou know that isn't fair, how you just entered here\nGetting their hopes up, that they can interfere\nYou're so insincere, you know I got you\nHave you looked in the mirror? You know that's not cool\n\n[Hook: Bilal]\nYou shine like the lights of Las Vegas\nYou feel radiant and outrageous\nYou're confidence and appeal, so sexual\nHow dare you? How dare you? How dare you?\nHow dare you come do me like that that\n\n[Verse 3: Lupe Fiasco]\nLet's have a cease fire, be some peace tryers\nLet's negotiate, because my cheeks tired\nFrom smiling all day\nEmotions need a motrin, a tylenol break\nI know you see my strategy, if flattery's a battery\nThen I'm a rabbit with a pack of 'D's in the back of me\nPause on all levels, everybody settle\nI know it sounded weird, I'm just trying to impress you\nI step forward with my best two\nIf all that fails, open swag to the rescue\nI said swag, and I'm sorry\nDon't mean to offend your sensibility I meant dress smartly\nJust trying to get you out this party\nCan you dig that? Ologist-Archae\nPlease be the Ferrari to my car key\nAnd I'mma hold my baby down like a car seat\n\n[Bridge: Bilal]\nYou know what you're doing to me\nYou got that firepower?, baby\nI just can't get enough\nNo, I can't get enough\n\n[Hook: Bilal]\nYou shine like the lights of Las Vegas\nYou feel radiant and outrageous\nYou're confidence and appeal, so sexual\nHow dare you? How dare you? How dare you?\nHow dare you come do me like that that", "image": "https://images.genius.com/379173777569ae56b01f75924aa6ba0d.500x500x1.jpg"}], "artist": "Lupe Fiasco"}