{"songs": [{"title": "No Talent Rappers", "album": "M.I.C. (Make it Count)", "year": "2004-10-26", "lyrics": "[Intro: Juan]\nWhoo! Whattup Billy Nix?\nYeah, it's your man Juan!\nYeah (yeahhh yeahhh yeahhh) Street Lord Mafia\nIt's your man Juan, \"The Real Me\"\nGo get that, in stores everywhere\nThis a monster kid (yeah) whattup Kino?\n{\"No, talent, rappers!\" [- KRS-One, repeat 4X}\nWhattup Bo? Yeah, yeah, spit sixteen\nYeah, alright.. yeah\n\n[Verse One: Juan]\nI fell in love with hip-hop, I wanna rap cousin\nThat's when he gave me a brick, told me wrap some'n\nCrack some'n, act some'n, pack some'n, stack some'n\nGat some'n, back stuntin, don't make me clap some'n\nI tell niggas once, then I'm back bustin\nGats dumpin, that's nothin, pass me the bag young'n\nI beat niggas bloody - weak niggas swear they thugs\n'til they mugs full of blood, they say J nutty\nWe never rock bottom, I'm on the block whylin\nFlock niggas stock pilin, squads out the drop clownin\nOn my 7-digit, bitch you will never get it\nSpittin like that, I'm in the kitchen writin raps\nWith the cheddar sittin, by the Glocks and the grams\nAnd the box of seran, in the bakin soda vision\nWhere pots and the pans, rockin a slab\nNiggas swear they the shit 'til they rottin in a bag\n\n[Hook: Royce]\n{\"No, talent, rappers!\" - repeat 8X}\nYou hearin the beat nigga\nReal niggas here witchu Juan\nCutty, Mack, me, Five, Nine\nNigga streets is mines...\nRide out! C'mon, c'mon\nYeah, the M.I.C.! Yeah, regardless\nYeah, yeah, street BOYS!\n\n[Verse Two: Royce Da 5'9\"]\nYeah, I'm in the drop with the top up with cash\nMashin the pot with the Glock in the stash\nYou boxin you possibly got you a shot in yo' ass\nDropped in a box in the trash\nChopped into pieces, stabbed with the top of you leakin\nFeet from the opposite half of you reekin\nCops with they badges, keep 'em\nI stock 'em for cheap (yeah) charges get dropped\nQuick as I could get knocked then I'm back on the streets\nThe untraceable track, mop and the bleach (yeah)\nIt's a check if he gets on it, spits on it\nWreckin the next nigga destined to flip on it\nFor that paper with the dead presidents on 'em\nBest flow nigga put yo' neck and your wrist on it\nA soldier be rollin for dolo, for dollars\nYo' flow to mines is, like a Rover to and Impala\n\n[Hook]\n\n[Verse Three: Cutty Mack]\nIn a spot in a lab - and killin niggas\nIs somethin that's probably tagged on a block with the mag\nWhile the track spittin mad, killin whole staffs\nWhip opponents, I'm choppin the whole car in half\nI'm a gangsta nigga, if I can't care nigga\nShank a nigga, make a nigga shakin 'til he skatin in a\nAmbulance with the sirens off, in the Benz whippin off\nLet my little young'ns take the tires off\nReal hip-hop (snitches get dropped)\nCocaine, get rock, operation skip watch\nI spit it street cause it's in me\nI know \"Death is Certain\" so I merk a nigga 'fore he merk me\nNiggas act silly, 'til you catch 'em sizzling\nPut the semi-slugs in 'em 'til he shit and pissin Remy\nI'm a nut punk, bust pump, snatch trunks\nMashed up, smack chumps, look at 'em like \"AND WHAT!\"\n\n[Hook]\n\n{\"No, talent, rappers!\" - repeat 4X}", "image": "https://images.genius.com/cd9172649c4be5e25b673a95fee73f73.400x400x1.jpg"}], "artist": "Royce da 5'9'’"}