{"songs": [{"title": "F*ck Wit Dre Day (And Everybody’s Celebratin’)", "album": null, "year": null, "lyrics": "Ha, yeah, hell yeah, ha knowhatI'msayin\n(Sssss)\nYeah, Mista Busta, where the f*ck ya at?\nCan't scrap a lick, so I know ya got your gat\nYour dick on hard, from f*ckin your road dogs\nThe hood you threw up with, niggas you grew up with\nDon't even respect your ass\nThat's why it's time for the doctor, to check your ass, nigga\nUsed to be my homey, used to be my ace\nNow I wanna slapped and sexed out yo mouth\nNigga bow down to the row\nF*ckin me, now I'm f*ckin you, little hoe\nOh, don't think I forgot, let you slide\nLet me ride, just another homicide\nYeah it's me so I'ma talk on\nStompin on the 'Eazy'est streets that you can walk on\nSo strap on your Compton hat, your locs\nAnd watch your back cause you might get smoked, loc\nAnd pass the bud, and stay low-key\nB.G. cause you lost all your homey's love\nNow call it what you want to\nYou f*cked wit me, now it's a must that I f*ck wit you\nYeah, that's what the f*ck I'm talkin about\nWe have your motherf*ckin record company surrounded\nPut down the candy and let the little boy go\nYou knowhatI'msayin, punk motherf*cker\n(We want Eazy, we want Eazy)\nBow wow wow yippy yo yippy yay\nDoggy Dogg's in the motherf*ckin house\nBow wow wow yippy yo yippy yay\nDeath Row's in the motherf*ckin house\nBow wow wow yippy yo yippy yay\nThe sounds of a dog brings me to another day\nPlay, with my bone with ya jimmy\nIt seems like you're good for makin jokes about your jimmy\nBut here's a jimmy joke about your mama that you might not like\nI heard she was the 'Frisco dyke\nBut f*ck your mama, I'm talkin about you and me\nToe to toe, Tim M-U-T\nYour bark was loud, but your bite wasn't vicious\nAnd them rhymes you were kickin were quite bootylicious\nYou get with Doggy Dogg oh is he crazy?\nWith ya mama and your daddy hollin' Bay-Bee\nSo won't they let you know\nThat if you f*ck with Dre nigga you're f*ckin wit Death Row\nAnd I ain't even slangin them thangs\nI'm hollin' one-eight-seven with my dick in yo mouth, beeyatch\nYeah nigga, Compton and Long Beach together on this motherf*cker\nSo you wanna pop that shit get yo motherf*ckin cranium cracked nigga\nStep on up. Now, we ain't no motherf*ckin joke so remember the name\nMighty, mighty D-R. Yeahhh, MOTHERF*CKER!\nNow understand this my nigga Dre can't be touched\nLuke's bendin over, so Luke's gettin f*cked, busta\nMusta, thought I was sleazy\nOr though I was a mark cause I used to hang with Eazy\nAnimosity, made ya speak but ya spoke\nAy yo Dre, whattup, check this nigga off loc\nIf it ain't another ho that I gots ta f*ck with\nGap teeth in ya mouth so my dick's gots to fit\nWith my nuts on ya tonsils\nWhile ya on stage rappin at your wack-ass concerts\nAnd I'ma snatch your ass from the backside\nTo show you how Death Row pull off that who-ride\nNow you might not understand me\nCause I'ma rob you in Compton and blast you in Miami\nThen we gon creep to South Central\nOn a Street Knowledge mission, as I steps in the temple\nSpot him, got him, as I pulls out my strap\nGot my chrome to the side of his White Sox hat\nYou tryin to check my homey, you best check yo self\nCause when you diss Dre you diss yourself, MOTHERF*CKER\nYeah nigga...\nYeah, nine-deuce\nDr. Dre, dropin chronic once again\nIt don't stop, Punishing punk motherf*ckers real quick like\nCompton style nigga\nDoggy Dogg in the motherf*ckin house, yeah\nLong Beach in the motherf*ckin house, yeah\nYeah, straight up, really doe\nBreakin all you suckaz off somethin real proper like\nYouknowhatI'msayin?\nAll these sucka ass niggas can eat a fat dick\nYeah, Eazy-E Eazy-E Eazy-E can eat a big fat dick\nTim Dog can eat a big fat dick\nLuke, can eat a fat dick, yeah...", "image": "https://images.genius.com/bf3badae49c33b583126057638078bd8.576x576x1.jpg"}], "artist": "Dr. Dre"}