{"songs": [{"title": "I’m a Go and Get My...", "album": "Back on My B.S.", "year": null, "lyrics": "[Intro: Mike Epps]\nYeah, they call me P-Shake, I'm a number runner\nAnd I just wanna let you know I'm getting that Arab Money\nI'm getting that Chinese money\nI'm getting that motherfucking British Columbia money\nNigga basically what I'm saying, your dollar ain't shit!\nYou feel me? And bullshit ain't nothing but chewed up grass\nAnd that's a big black ball that come out of a cow's ass\nSo the next time you see that annointed bitch you know\nBend her, spin her, and go up in her, and let her know\nBitch, there is no dinner\nThese are the reasons and these are the numbers that I got for ya\nAnd it's 13.. 20.. 27.. 38\n25, 27, 13, 20, 27th, 38's\nDoo doo do do dooooooo\n\n[Hook 2X: Mike Epps]\nI'm a go and get my *25* over on *27*\nBe back in *13* minutes or even *20*\nBe back with *27* niggas with them *38's*\nDoo doo do do dooooooo\n\n[Verse 1: Busta Rhymes]\nSee there was this situation with a couple niggas I was peeping\nThe way they was moving analyzing the shit they was doing in the club Grilling and screwing they faces up\nFront like they chilling and moved a couple paces up, playing me close\nBut I'm saying we most...ly be in a spot\nCelebrating something and probably making a toast\nParty till we probably shaking the coast\nAnd hardly ever start a problem unless you gotta\nI'm sayin we supposed to be enjoying ourself nigga\nCause we entrepreneurs and gwop connoisseurs employing ourself nigga\nExploiting my wealth with the company I'm keeping\nUntil a hater came and got to annointing himself to be\nThe one to come in it, and had a couple dudes to support him\nActing all extra like he had the thing on him\nThen after we finish beating on him, now he know we ain't playing\nThat's when he walked away saying\n\n[Hook]\n\n[Verse 2: Busta Rhymes]\nShit is really bug to me how some of these niggas they be coming\nAnd setting theyself up till you hit them and getting theyself up\nIn these altercations they don't really be needing\nUntil it's too late, then they realize that a body part is bleeding\nInstead of being out and enjoying the people\nThey be acting all tough, yapping and bluffing instead of being peaceful\nThese partially thugs be spreading like cancer\nFronting like gangsters until you bust they head now they looking like dancers\nWhile they leaning and they rocking with after\nYou could've avoided *BEEF!* The shit is annoying, *CHIEF*\nCause now you got the bouncer stopping the door, killing\nNobody else is getting in cause we mopping the floor with you\nInstead you could have came to party and BS and deaded the fronting\nBag you a chick, while you sipping on something\nBut instead you chose to do something that made us lump your shit up\nFor playing, now what the fuck is he saying?\n\n[Hook]\n\n[Outro: Mike Epps]\nWho did it?\nWhich one of y'all niggas hit me in my motherfuckin..\nWhere my earring at? Where my keys?\nWhy y'all them niggas hit me in my motherfuckin jaw like that?\nWhere my keys at? Where my shoe?\nI can't find my shoe, you hit me in the jaw nigga?\nIs that the one? Nah, whassup though - how you doin?\nWhich one of y'all niggas hit me in my jaw man?\nHow y'all conceal it? Somebody go call my girl\nSomebody hit me in my jaw\nI got Medicade nigga that's alright\nY'all hit me in my motherfuckin jaw like that\nI tell y'all, y'all pussy, don't feel it\nNigga I got a brother that's a Crip\nNigga I got another brother that's a Blood\nWe gon' tear this motherfucker up y'all niggas hit\nY'all done hit the wrong nigga now!!\nY'all hit the wrong nigga!!\nY'all gon' sit there and let.. I'mma sue this club!\nI'm suin this muh'fuckin club cause y'all security guards\nSit there and let them niggas jump on me like that!\nBitch-ass...\n\n[Hook]", "image": "https://images.genius.com/39d2d4f1bba15212af6b346af49c7ff2.1000x1000x1.jpg"}], "artist": "Busta Rhymes"}