{"songs": [{"title": "No Good", "album": null, "year": null, "lyrics": "[Intro]\n[?]\nAin't nothin' but a-\nUh, no good, bad woman\nNo good, diamond watchin' woman\nUh\nHey, Rvssian\n\n[Chorus]\nShe ain't nothin but a no good, diamond watchin' woman\nOnly love me 'cause she see Versace on my linens\nBaby I'm not God, so your sins are not forgiven\nI can never lose, every day I wake up winnin'\nMomma told me cut the bad hoes off with the scissors\nMake 'em disappear, call me Juice WRLD wizard\nBae, I'm high off narcotics, so your name I cannot remember\nUsing Opiates overly, openly fuckin' up my image, yeah\n\n[Verse 1]\nOne thing you need to know about me is\nAll I ever wanted was love and money, yeah\nOne thing you need to know about me is\nThis rockstar life turned me to a junkie\nAnother thing you need to know about me is\nI'm full of addictions, this is just vindictive\nSubject a lil' sensitive, maybe I should just shallow it\nWent from talkin' depression to money-makin' prerogative\nStill a smart guy, could've got a scholarship\nSayin' fuck college, I'ma tell you how I started it\nIt took one phone call from G-Money, that's my dawg\nTurned me from a twenty dollar nigga to millions in my drawers\nThis song's about all my talents and vices (Oh-oh)\nListen repeatedly, scream it, recite it (Oh-oh)\nUntil it piss your father off, he already pissed though (Oh-oh)\nI know, 'cause his daughter on my tour givin' deep-throat (Yeah yeah yeah)\nThis song's about all my talents and vices (Oh-oh)\nListen repeatedly, scream it, recite it (Oh-oh)\nYo' girl give me fellatio, you should be excited (Oh-oh)\n'Cause when she come back to you, that's a million dollar night (Oh-oh)\n\n[Chorus]\nShe ain't nothin but a no good, diamond watchin' woman\nOnly love me 'cause she see Versace on my linens\nBaby I'm not God, so your sins are not forgiven\nI can never lose, every day I wake up winnin'\nMomma told me cut the bad hoes off with the scissors\nMake 'em disappear, call me Juice WRLD wizard\nBae, I'm high off narcotics, so your name I cannot remember\nUsing Opiates overly, openly fuckin' up my image, yeah\n\n[Post-Chorus]\nI grew up on all types, I'm talkin' 'bout music and girls, right?\nI grew up on all types, I'm talkin' 'bout drugs, the weed and the pills\nI grew up on all types, I'm talkin' 'bout music and hoes, right?\nAnd clothes, I was overly exposed\nNow I'm bearing the fruits, my momma planted they done growed\n\n[Verse 2]\nHell yeah, I done glowed up, I done glowed up\nOxycodin got me so'ed up, gotta remain focus\nAnd these groupie hoes bogus, everybody knows it\nBut they turn me to a poet, with the love commotion\nBlood, sweat and tears, money parted it Moses\nUsed to roll mids, now it's gas, what I'm smokin'\nLike I farted, hit the gas, I'm in motion\nOut, departed, wrist hangin' out the window, cost yo apartment\nThis the brightest that my life ever been, I need diamonds all over for when it get dark again\nI call my momma up and tell her that the devil marchin' in\nShe sent me bible verses, then I got distracted by some news from a sex worker\nWho am I to not text back? That's networking\nWho am I to lie about my life? I know the truth hurts\nWho am I to say that this ain't one of my best verses?\nUh-oh, too bad\n\n[Chorus]\nShe ain't nothin but a no good, diamond watchin' woman\nOnly love me 'cause she see Versace on my linens\nBaby I'm not God, so your sins are not forgiven\nI can never lose, every day I wake up winnin'\nMomma told me cut the bad hoes off with the scissors\nMake 'em disappear, call me Juice WRLD wizard\nBae, I'm high off narcotics, so your name I cannot remember\nUsing Opioids overly, openly fuckin' up my image, yeah\n\n[Post-Chorus]\nI grew up on all types, I'm talkin' 'bout music and girls, right?\nI grew up on all types, I'm talkin' 'bout drugs, the weed and the pills\nI grew up on all types, I'm talkin' 'bout music and hoes, right?\nAnd clothes, I was overly exposed\nNow I'm bearing the fruits, my momma planted they done growed", "image": "https://images.genius.com/1ff8ab8d3ae5bb47f0797a87d42ddf66.1000x1000x1.jpg"}], "artist": "Juice WRLD"}