{"songs": [{"title": "Handle My Biz", "album": "28 Grams", "year": "2014-05-25", "lyrics": "[Produced by Metro Boomin]\n\n[Intro:]\nHey Wiz, they tryna lock a nigga up\nHow many grams they asked you you had?\nWhat you tell 'em?\n28 right?\n\n[Hook: Wiz Khalifa]\nBad bitch come to my crib, handle my business\nLet a nigga know shit's real, handle my business\nHandle my business, nigga, I handle my business\nHandle my business, nigga, I handle my business\nSmokin' pounds of kush, handle my business\nRidin' in a brand new car, woosh, handle my business\nHandle my business, handle my business, handle my business\n\n[Verse 1: Wiz Khalifa]\nSmokin' on the kush, ridin' in a brand new whip\nFeelin' like a pimp\nDamn my money good\nI wish a bitch nigga would, I wish a bitch nigga would\nHandle my business, I'mma handle my business\nHandle my business, I'mma handle my business\nHandle my business, got a handful of Benji's\nHand on the strap, I'mma handle that witness\nI'mma handle that car, I'mma handle that bitch\nShe gonna handle this dick\nAfter that, roll some weed up\nChill with my feet up\nYa'll some hand-me-down niggas\nPosted in the car with the top down smokin' on the shit that'll paralyze niggas\n\n[Hook: Wiz Khalifa]\n\n[Verse 2: J.R. Donato]\nHigh as fuck and it's 28 grams later\nKeep the Ruger, I'mma shoot it in a damn skater\nI'm from the Chi but Atlanta where I'm gonna take her\nIf I put her on the corner then I'm gonna break her\n(Make her handle my business, straight up out the trenches\nYoung nigga tryna double my digits while I'm kickin' this pimpin')\nTwo white cups sippin', ride around piped up gettin' it\nChain so bright that it might cause tension\nRock the Benz all Spring, so they know it ain't rented\nFeelin' like a Beatle, god damn, John Lennon\nPut my finger on the trigger, I be sprayin' for a minute\nI tell 'em, wait, wait, let me handle that\nLittle steak, Little eggs, let me scramble that\nTwo guns, two clips, finna Rambo that\nTell their hoes I'm bouta fire, where they candles at?\nWhere they candles at?\nCause I be sippin' on somethin'\nNever been a Goofy, shootin' a movie\nTable full of shroomies while I'm rollin' the doobie\nYou starin' at me like you wanna hit it or somethin'\nYour bitch lookin' like she want the dinik or somethin'\nI prolly give her the somethin' in addition to somethin'\nCookin' like I'm in the kitchen or somethin'\nYou lookin' broke boy, get you some money\nDonato\n\n[Hook:]", "image": "https://images.genius.com/e168a843af4516427b50fafd226984ee.990x990x1.jpg"}], "artist": "Wiz Khalifa"}