{"songs": [{"title": "Say What You Want", "album": "B.o.B Vs Bobby Ray", "year": null, "lyrics": "[Michael Jackson]\n\"Say, say, say, what you want\nBut don't, play, games...\" {FURY}\n\n[B.o.B - with Michael Jackson sample in background]\nGo right ahead, say whatever you want, please\nThat's it? Go ahead, I'm here all day\n[yawning] Ahhh\nYup! Ha ha, yup, well\n\n[B.o.B.]\nSay what you like, but I just, take a little knife, and then I\nMake a little slice, and then I, take a little bite, yum!\nSo miss me with all that doubt, what they all talkin about?\nTalkin 'bout I ain't dope? What the hell are y'all bloggin about?\nI'm the authority now, and I'm the priority now\nSo if you ain't on my side, might as well just throw in ya towel\nOh how cocky of me! To speak so highly of me\nThey say I'm crazy now; I guess I'll hire a shrink\nAnd this is just how I feel - why would I lie on a beat?\nBut y'all be sleepin on me, so I guess y'all (lie) on the beat\nHeh! Well that went over yo' head\nAnd I'm B.o.B a/k/a Bobby Ray so don't you ever forget, yeah\n\n\"Say, say, say, what you want\" [4X]\n\n[Playboy Tre]\nYeahhhh\nIt's Playboy Tre bitch I'm back, once again where the fuck we at?\nStandin strong and you can run and tell them sucka niggas that\nGimme my Henn', gimme my cup, play my beat and leave me 'lone\nAnd you can bet, I'ma bring that fuckin trophy back home\nYellin hoo-ray, hoo-rah; either way I want my moolah\nLike it's payday, and I ain't leavin the game until I say say\nIt's (Tre Day), I fuck Deltas to the AKA's\nTo ghetto ass hoes who name they bad-ass son Tay-Tay\nRay-Ray, and Day-Day, I'm bustin like a AK\nFuck around and find yo' ass in a motherfuckin melee\nSo say what you will nigga, you can talk it, or blog it\nLike diarrhea to toilet stools, I ain't comin off it - naw!\n\n\"Say, say, say, what you want\" [4X]\n\n[Killer Mike]\nWestside O.G. everybody know he can not be held back\nIt's Killer Kill from the 'ville don't mess don't chill\nBeen buckin since that crack\nFat boy, fly boy, fly boy, fat boy\nKnow these hatin ass niggas hate that\nI prevail in spite of Hell and now I'm boss hoggin in a 'llac\nActually, it's a Benz my friend; I just rhymed this shit for a rap\nAnd - actually I got businesses; I ain't really gotta motherfuckin rap\nI'm talkin barbershops and corner sto', independent label GTO\n'Bout to open a studio, bet'cha y'all'll love me then\nGet yo' ass a record deal and buy yo' fonky publishin\nSay what you like, but don't fuck with Mike\nI'm a lot of J Prince and a little Suge Knight\nI'm throwed in the game like a basketball\nI'm a big dawg, you're a flea on my balls\nWhat you say don't pay so sincerely I say\nMotherfuck yo' mommas and alla y'all!\n\nYeah lil' bruh, y'knahmsayin?\nThis the big dawg right here, man it's ya big dawg\nMike Bigga is bigga y'know?\nKnown as Killer Kill from the 'ville\nI just wanna say lil' bruh man\nI'm proud of you lil' bruh\nY'knahmsayin, with \"Who is B.o.B?\"\nAnd now you sayin man it's Bobby Ray\nI respect it bruh!\nNo I respect it like\nWhen Muhammad Ali came out of Cassius Clay man\nSo I'm happy to meet Bobby Ray lil' bruh\nAnd let me tell you somethin lil' bruh\nANY HATER man, any hater, that come up against you bruh\nHe don't wanna see the crystal\nHe don't love the 'coustic guitar\nHe want you to AutoTune\nTell him to suck TEN THOUSAND WEE-WEE man\nAnd big bruh said that man!\nKnahmsayin? Tell him to play booty hole games\nAt the motherfuckin... at at\nTell him to play at the at at at\nAs the bulldog do, y'knahmean? But\nDon't play with Bobby Ray man I'm fuckin with ya hard man\nGrind Time rap game bang bang bang man\nUm he dope cause I said so, holla at me\nWestside O.G., everybody know me, fo'real!", "image": "https://images.genius.com/43ec171838184bac0a8baa89f9e6d0a9.600x600x1.jpg"}], "artist": "B.o.B"}