{"songs": [{"title": "?", "album": "Operation: Doomsday.", "year": "1999-04-20", "lyrics": "[Produced by MF DOOM]\n\n[Intro: Dr. Doom]\nMy servants began to forge what was to become\nThe most dreaded costume on the face of the earth\nThe last thing to fit was the mask\nWill it conform to my twisted features in comfort\n\n[Verse 1: MF DOOM]\nHe cleans his metal mask with gasoline, they after him\nLast seen pulling chicks like a fiend pull a fast one\nCan't put shit past him\nGot niggas on his own team mad enough to blast him\nRetarded in real life, on the mic Rain Man\nStand close to his main man like a chain gang\nWho give a fuck about who or they fancy crew\nThat's no mystery that Hardy Boys do with Nancy Drew\nSaw her with her drawers down, caught her\nThe extorter bring slaughter like \"Well I oughta\"\nI suggest you hand over the formula doula\nA villain in your land, in his land a ruler\nHard hitting like puffing a woola with Lieutenant Uhura\nEvery day feel like it's an off day with Ferris Bueller\nBrother pull heat to prove they not sweet\nNo matter how you spell it, we still got beats\n\n[Verse 2: Kurious + MF DOOM]\nDon't question how we live, question what we give\nTake it to the next leave 'em where they can't see me\nStill they judge, but they be butt ass\nTwist that wig like a muppet, keep it simple, can't truss it\nLight's the fuel, mic is the tool\nDrink Jack, kick back, drop jewel, finish what I start\nMastered the art, living hell can't explain it\nInhale confuse it more, cop the .44\nContemplate, meditate, dictate\nI direct my direct fate, coming of late\nKurious, can I say, \"Shit?\"\nDo it for CottleRock, do it for K.Nit\n(RIP)\nK-N-I-T, Sub R-O-C\n(Eternally for M-I-C)\nOnly we save we\n\n[Interlude: MF DOOM]\n\n[Verse 3: MF DOOM]\nBy candlelight my hand will write these rhymes 'til I'm burnt out\nMostly from experience, shit that I learned about\nTopics and views, generally concerned about\nWith different ways to come up and earn clout\nI take a look at my life and pace the trails\nFrom Tablik and savage females with fake nails to face veils\nYou out your frame but still bagging 'em too\nYou know I know, these hoes be asking me if I'm you\nLike my twin brother, we did everything together\nFrom hundred raka'at salats to copping butter leathers\nRemember when you went and got the dark blue Ballys\nI had all the different color Cazals and Gazelles\nThe \"SUBROC\" three-finger ring with the ruby in the \"O\", ock\nTruly the illest dynamic duo on the whole block\nI keep a flick of you with the machete sword in your hand\nEverything is going according to plan man", "image": "https://images.genius.com/c0a80e3098696bdf600f54a76667c069.1000x1000x1.jpg"}], "artist": "MF DOOM"}