{"songs": [{"title": "Booby Trap", "album": "Digi Snacks", "year": "2008-06-24", "lyrics": "[Intro: RZA]\nHahaha, Digi, yo, yo\n\n[RZA]\nWhen I was young, I slept with a battery on my tongue\nSo when I spit, the impact with the sting of a stun gun\nAt full blast, rock your cradle, fatal razorblades graze you\nSplit you open, stitch you back wit' a staple\nI'm football head, I put your head\nInto a brook, all four, your momma wouldn't look at ya'll\nGold from the Panama canal, Alabama gal\nGot me laid up, on my nuts like kapow\nB-O-B Boy's fast as Bruce Leroy\nMeet the rap Galactus, blow planets off his axis\nMy Glock is plastic, my dick *sniff* is magic\nStretch up the power you like Mr. Fantastic\n\n[Chorus: Dexter Wiggles]\nStop, it's a booby trap\nWouldn't you rather have a Digi or a Scooby Snack?\nDigi Snack, yeah, while we living in a booby trap\n\n[RZA]\nYo, when it comes to this mic device, you get ate\nLike the gingerbread man tryna cross the lake\nOr the Winchester, call my white son, Lester Poindexter\nTell 'em bring back the black mack, strapped with two extra\nClips, where's the natural, words inside the apple\nPotholes in the street, it cracks the Jeep axle\nShrivel your heart to a raisin, shorty star gazing\nYeah, he got steeper than dunce, once he start blazing blunts\nBeef, and get drowned in Hunt's\nYour flame get toast, your best bet to punt\nI lounge like a hungry jaguar, into agua\nTrying to catch a fish that multiply like the magua\nPocket fat like Jabba the Hutt, Clan gallops up\nFeel the force of my steel, but you can't count the caliber\nDigi, Digi, Digi, all inside your city\nMicrophone on the roam, like Capone and Frank Nitty\n\n[Chorus: Dexter Wiggles]\nStop, it's a booby trap\nWouldn't you rather have a Digi or a Scooby Snack?\nDigi Snack, yeah, while we living in a booby trap\nStop, it's a booby trap\nWouldn't you rather have a Digi or a Scooby Snack?\nDigi Snack, yeah, while we living in a booby trap, yo, yo\n\n[RZA]\nI don't got a taste for blood or flesh skin\nMy mind, like Professor X from the X-Men\nOne line, cause MC's to write their albums down\nDevils only come amongst you, if you allow them now\nDue to trading, they infiltrate with persuasion\nThat desire to rob and steel and make slaves of all\nLiving luxury, destructively, conductively\nImproper nature, privately and publicly\nMan so stupid when confronted by something he don't\nUnderstand, he shoot it, the whole world's polluted\nMy earth gave birth to a universal change us\nScribes reflect the child born in the Bethlehem manger\nDevils try to steal me of my intellect, rob me of my culture\nLike they whitewashing sculptures\nLike they snatching down my posters\nBut it's been caught through the eyes of Minolta\n\n[Chorus: Dexter Wiggles]\nStop, it's a booby trap\nWouldn't you rather have a Digi or a Scooby Snack?\nDigi Snack, yeah, while we living in a booby trap\nStop, it's a booby trap\nWouldn't you rather have a Digi or a Scooby Snack?\nDigi Snack, yeah, while we living in a booby trap, yo, yo", "image": "https://images.genius.com/6aad59336cc99fabe2197eafab36fc0e.500x511x1.jpg"}], "artist": "RZA"}