{"songs": [{"title": "Rush Hour", "album": "GO:OD AM ", "year": "2015-09-18", "lyrics": "[Intro: Mac Miller]\nWoo!\nOkay, woo!\nYeah (Okay)\nYeah\n\n[Verse 1: Mac Miller]\nI give a fuck less and less everyday (Okay)\nThe more you give a fuck, I guess the less you make (Money)\nHomie we just out here tryna elevate\nHeaven is a crime scene, stay behind the yellow tape (Whoop whoop)\nI started making money in eleventh grade\nSoon as I learned that the more you do, the less you wait\nGot a bigger crib, always use the extra space\nShit was so different in 2008\nGrowing pains, fill the open veins with Novocain\nRelapse, I eat that, I don't complain\nI'm just rambling\nYou want war? It’s N64, Blitz Champion (Sucker)\nOut of space channeling, brain damaging\nHeavy rain game cancelling, proud to be American\nThey tell me \"Get yourself straight\nHow much more money can you make?\"\n\n[Chorus: Mac Miller]\nI'm just tryna grow up old and rich\nMaybe get married to a local bitch\nI be, I be, I be, I be over shit\nThe world don't give a fuck about your loneliness\nI'm just tryna grow up old and rich\nThe world don't give a fuck about your loneliness\nI be, I be, I be, I be over shit\nThe world don't give a fuck about your loneliness\n\n[Verse 2: Mac Miller]\nI'm a deranged motherfucker, took too many uppers\nNow it's rush hour, Jackie Chan, Chris Tucker (50 million dollars!)\nI stuck around for the past six summers\nKarma is a bitch and that bitch don't love ya\nWe was in the attic you could smell the weed\nBitches getting naked, we was selling E\nBitches kissing bitches just like Ellen D\nIn the kitchen whipping biscuits, giving generously\nI thank the lord I made it out, no STD\nLost a few too many brain cells, I'm special needs\nThey tell me \"Get yourself straight\nHow much more money can you make?\"\n\n[Chorus: Mac Miller]\nI'm just tryna grow up old and rich\nMaybe get married to a local bitch\nI be, I be, I be, I be over shit\nThe world don't give a fuck about your loneliness\nI'm just tryna grow up old and rich\nThe world don't give a fuck about your loneliness\nI be, I be, I be, I be over shit\nThe world don't give a fuck about your loneliness\n\n[Outro: Vinny Radio]\nLadies and gentlemen in attendance, good morning\nIt's the baby face Don Dada checking in\nAnd I want you to know\nIt ain't about complaining, it's about maintaining\nKnow what I'm talking about\nDon't ever become content because you will repent\nFeel that, go get it\nThat's your life, go live it\nPass me my Hennessy and my Grand Marnier\nIf you will", "image": "https://images.genius.com/3fafe062032c4ec3d42f4b11c25a02a1.375x375x1.jpg"}], "artist": "Mac Miller"}