{"songs": [{"title": "Ill Mind of Hopsin 4", "album": "Ill Mind of Hopsin Saga", "year": "2011-07-18", "lyrics": "[Produced by Hopsin]\n\n[Hopsin]\nCheck it, I used to be the goofy man you hounded\nThe Special Ed kid at lunchtime\nThe bitches wouldn't stand around with\nI would jack off so much back at my parents' house\nAnd now my dick has a permanent imprint\nOf my hand around it\nLife was lame, I had to pay money to fuck a whore\nI couldn't pull a damn anorexic bitch in a tug o' war\nBut then I made enough money for me to fund a tour\nNow the ladies show me the goodies under their wonderbra\nI'm goin' door to door, with foreign swords\nCausin' more than war\nSlayin' rappers, commercial or horrorcore\nSo, hold your head, 'cause I'ma torture yours\nLeavin' morbid sores\nI promise you it will be hard to ignore the gore\nHip-hop's dead, and I'm the lucky savior\nI'm kinda mad and I don't wanna pile up the anger\nAll these no-flow, gimmicky-ass, fired-up behaviors\nWith wack beats and gap teeth like Tyler, The Creator\nMotherfucker, you not dope\nSo you tryna get some attention by cussin'\nAnd eatin' a fuckin' cockroach?\nIn \"Goblin\"? You get no props on it\nIt sucks so much I get blowjobs from it\nI been told you niggas, \"I'm real!\"\nIf you wack and no one's confronted you\nOn your bullshit, then I will\nHate on me, but you can't deny skill\nI crush all the momentum that you guys build\nWith my eyes sealed\nYou faggots got me cussin'\nAnd only reason you probably buzzin'\nIs 'cause you slave as an Illuminati puppet\nY'all really on one, beat it, you're gone, done\nYou think real niggas feelin' your shit? C'mon, son!\nI'm the illest and that's fo' shizzle\nMy flow sizzles, your boy Hop go hard like some cold nipples\nYou niggas are makin' it so simple\nMy swag makes the ladies wave\nLike fat stomachs with bold ripples\nI know you niggas wish you could prevent it, 'cause I get buck like my Kool Aid's got way too much sugar in it\nYou better run like I'm booger-flickin'\nHomie, I've been good at rappin'\nNow I'm tryin' to get gooder with it\nSo I'ma just go beast, and bring that West Coast heat\n'Cause I'll be damned if you flex on me\nThe radio is filled with garbage over techno beats\nAnd all these songs about cash are what we just don't need\nYo, nobody care about how much money you stack\nI murder everything I touch, buddy, move back!\nGot enough guts to sew trash and bust up your fluke act\nAnd leave your fans sayin', \"How the fuck does he do that?\"\nMy rankin' is vicious, you thinkin' it isn't?\nCome pay me a visit if you feel that you may be offended\nBaby, I'm wicked, crazy and sick\nAnd with the face of a nimwit\nI be callin' out names, but I ain't takin' attendance\nSome bitch was like…\n\n[\"Some Bitch\" (Hopsin)]\n\"Hop, you got me cryin'\n'Cause you said I could call you\nWhile you out on tour, shit, and I be tryin'\nI even text you, but you not replyin'\nSo when your new shit finally drop\nThat's one album I will not be buyin'\nWhat, you're too Hollywood?\nAnd you don't even have two minutes?\nEver since you got your buzz\nYou don't know how bad you trippin'\nYou went to that ho's house last night\nAnd you said that you didn't\nI seen your pic on Facebook\nThe skank bitch done tagged you in it!\"\n\n[Hopsin]\nI got put on with the beastie flow\nNow the sluts, they wanna bone when they see me, whoa!\nSo I must, I take 'em home, let the wee wee grow\nThen I bust from different strokes, like the TV show\nSee, when I be comin' through\nKickin' it raw, niggas like, \"Gee, he's dope!\"\nIf there's anyone throwing dirt at my name\nThen you know he be toast\nFor all of you rappers who bringin' me drama\nHomie, please be ghost\nThe only reason I'm bein' aggressive is 'cause we need hope\n\n[Hopsin groupie (Hopsin)]\n\"Hey yo, Hopsin, I fuckin' love you\n'Cause you supply the best rhymes\nSince your flow is kinda strange\nYou should sign with Tech N9ne\nYou design erect lines, who am I to just lie?\nEvery single night I play your music right at bedtime\nAnd usually I'm not into dark dick\nI wanna do somethin' freaky enough to win your heart with\"\nI say, \"What you wanna do?\", she say, \"It's simple, Marcus\nI wanna blow it before you put it in like a Nintendo cartridge\"\n\n[Hopsin]\nBitch, I'm hotter than a UV ray\nHotter than the thought of Nicki Minaj naked\nMakin' her booty shake\nHot enough to pull up to yo' show and steal yo' groupie date\nHot enough to melt the ice cream that's on Gucci's face\nAnd now you havin' hot flashes\nAll the shit that you ever wanted in one MC, Hop has it\nDon't rap if you do not practice\nI cockblock wack shit, now get ready for Knock Madness!", "image": "https://images.genius.com/e5543001b7b3e3b54dddd47bc8c5c150.800x800x1.jpg"}], "artist": "Hopsin"}