{"songs": [{"title": "Let’s Do It", "album": "My Soul", "year": null, "lyrics": "Let's do it! Get to it!\nLet's do it! Get to it!\nLet's do it! Get to it!\nLet's do it!\n\nVerse 1:\n\nAnother Saturday night, and I'm feelin kinda slothy\nI'm down with the forty, but I don't want no forty\nEven though I'm thirsty and I'm hungry, I need some Kurathers\nPeep this, but not up in my stomach\nI wanna chop your cherry tree, I can't tell a lie\nSomethings on the rise, what a surprise\nI called up the homies and said, \"Let's go the spot!\"\nWhere the drinks are cold, and the girls ain't too hot\nNow we in the house, but the house is kinda empty\nRats run around the room\nBut, wait, I spoke too soon\nAh, damn, look what done walked in\nPumps and a bump, breath smellin like gin\nBaby, you look good with that blue dress on\nMaybe some day me and you can be as one\nLet's get to know each other better\nI can sing you a song, and you can write me a love letter\n\nChorus:\n\nBaby, you can do it, take your time, do it right (Let's do it, get to it)\nYou can do it, baby, baby (Let's do it, get to it)\nBaby, you can do it, take your time, do it right (Let's do it, get to it)\nYou can do it, baby, baby (Let's do it, get to it)\n\nVerse 2:\n\nDamn, I'm feelin frisky\nCome and sit down wit me\nConversate about hanky panky\nAnd a little dranky wanky\nTell me bout your innermost thoughts, wants, neeeds and your desires\nAnd I'll tell you about mine\nWe can spend some quality time\nYou want a man with vision, who ain't afraid to listen\nI wanna mention I can hit that ass in thirty-six positions\nAnd, I just want a regular old fashion high hoochie mama\nWith love for her daddy, anytime he want it\nBring home the turkey bacon and fry it in the pan\nOr, some filet minon and still let me know I'm the man\nI'm the doctor, and you can play the nurse\nBut we got to have patience\nEven though we hella anxious\nLet's take it slow and procede with caution\nCause love just don't come round here too often\nSo take my number, and we'll get together later\nAnd I'll take yours, I'm out like the L.A. Raiders\n\nChorus\n\nVerse 3:\n\nA few months went by with phone calls and some dinners\nMoonlit nights with Marvin Gaye, Dramatics, and The Spinners\nTop down on the Vette watching California sunsets\nAnd pretty soon we developed that respect\nThat we needed so we was here to get the relationship heated\nAnd hot and bothered, no what I'm meanin?\nIt started slow with some kisses and some touches\nA few more weeks went by cause we didn't wanna rush it\nThey say a fast horse don't win no races\nAnd I'm a witness cause real winners always take steady paces\nHand in hand, woman to man\nI know everything about her and she know everything about me and\nWe made love for the first time\nIn the right way, in the perfect state of mind\nIt's a whole lot mo than your average bump 'n grind\nYou better get yours, cause I got mine\n\nChorus: Repeat 2X\n\nBridge: Repeat 2X\n\nTake, take your time (Take, take your time)\nTake your time (Take your time)\nTake your time (Take your time, get to it)\n\nChorus: Repeat 2X", "image": "https://images.genius.com/8b2afc0b2ec12b84597cab495ffdf0e1.600x600x1.jpg"}], "artist": "Coolio"}