{"songs": [{"title": "Fuck the World", "album": "Me Against the World", "year": "1995-03-14", "lyrics": "[Verse 1: 2Pac]\nWho you callin' rapist?\nAin't that a bitch\nYou devils are so two faced\nWanna see me locked in chains, dropped in shame\nAnd gettin' stalked by these crooked cops again\nFuckin' with the young Black male, tryin' to stack bail\nAnd um, stay away from the packed jails\nI told the judge I'm in danger\nAnd that's why I had that .45 with one in the chamber\nFuck the world!\n\n[Chorus: Shock G & 2Pac]\nThey tryna say that I don't care\nI woke up screamin' \"Fuck the world!\"\nThey tryna say that I don't care\nJust woke up and screamed \"Fuck the world!\"\nThey tryna say that I don't care\nUhh, I woke up and screamed \"Fuck the world!\"\nThey're tryna say that I don't care\nJust got up and screamed \"Fuck the world!\"\n\n[Verse 2: 2Pac]\nWhen I was comin' up rough that wasn't even what you called it\nThat's why I smoke blunts now and run with alcoholics\nI'm gettin' flex to me, comin' from my enemies\nAnd in their dreams it's hell where they sendin' me\nHave I lost control or just another soul?\nA car full of motherfuckers when we roll\nSippin' on yak as I sit back\nLife as a big mack\nBrothers come up and say \"you did that?\"\nNever take your eyes off the prize and even if you gettin' high\nDon't ever hesitate to try\nCause you can fall off or stay ballin', niggas we all in\nAnd them my motherfuckers callin'\nFuck the world!\n\n[Chorus: Shock G & 2Pac]\nThey tryna say that I don't care\nWoke up screamed \"Fuck the world!\"\nThey tryna say that I don't care\nJust woke up and screamed \"Fuck the world!\"\nThey tryna say that I don't care\nI got up and screamed \"Fuck the world!\"\nThey're tryna say that I don't care\nI woke up and screamed \"Fuck the world!\"\nThey're tryna say that I don't care\n\n[Verse 3: 2Pac]\n(Man, Fuck the world)\nDamn, they wanna label me a menace\nCause I'm sittin' here sippin' on Guinness\nWeighin' 165 and these tricks should die\nFor being jealous of a brother when he rise\nI can see it in your eyes, you wanna see a young playa fallin'\nThey hate to see a nigga ballin'\nSome of you suckers is rotten, plottin' on what I got\nAnd then you wonder why I shot him (Booyeah)\nStop givin' game for free, you wanna hang with me\nLike being a thug is the thang to be\nBut I got love for my homies, the G's and macks\nAnd if you're black, you better stay strapped\nNigga, Fuck the world!\n\n[Chorus: Shock G & 2Pac]\nThey tryna say that I don't care\nI woke up screamed \"Fuck the world!\"\nThey tryna say that I don't care\nI woke up and screamed \"Fuck the world!\"\nThey tryna say that I don't care\nI got up and screamed \"Fuck the world!\"\nHaha, Fuck the world!\nFuck it\nI hear my niggas screamin' \"Fuck the world\"\n\n[Verse 4: 2Pac]\nThey wanna know if I claim the clique that I'm hangin' with\nAnd if I'm down with this bangin' shit\nWell homie I don't give a fuck if you Blood or Cuz\nLong as you got love for thugs\nBut don't try to test me out, stall that\nHomie this is Thug Life nigga and we all strapped\nI been through hell and back and if I fail, black\nThen it's back to the corner where we sell crack\nSome of you niggas is bustas, you runnin' round\nWith these tramp-ass bitches, don't trust her\nBut don't cry, this world ain't prepared for us\nA straight thug motherfucker who ain't scared to bust\nFuck the world!\n\n[Chorus: Shock G & 2Pac]\nThey tryna say that I don't care\nI woke up screamed \"Fuck the world!\"\nThey tryna say that I don't care\nI woke up screamin' \"Fuck the world!\"\nThey tryna say that I don't care (They tryna say that I don't care)\nI woke up and screamed \"Fuck the world!\" (Yeah what’s goin on y’all?)\nUhh, uhh, uhh.. Fuck the world!\n\n[Outro: Shock G]\nI don’t care.. I don’t care, I don’t care!", "image": "https://images.genius.com/6da8d76824c2ad71d2eb9f68bf31d9d7.640x640x1.jpg"}], "artist": "2Pac"}