{"songs": [{"title": "U Know", "album": "Freshmen Adjustment Vol. 3", "year": null, "lyrics": "[Intro: Kanye West]\nI just got off the plane, Chicago\nIt's ya boy Kanye West on the beat\nAy, White Boy\n\n[Hook 2x: Kanye West and John Legend]\nI just want you to know, I just want you to know\nI just want you to know, this boy here finna' blow\nSouthside up in here, Westside up in here\nEastside up in here, throw your hands in the air\n\n[Verse 1: Kanye West]\nKanye the best in the game, now we got that, that thing clear\nKanye West is the name, Southside up in here\nY'all niggas stole the soul, y'all niggas all some clones\nY'all need to change y'all tone, nigga, I control the 'go\nMotherfucker close the do', light the weed and let the douja blow\nWhy you keep bawlin' though girl, you ain't been around niggas before?\nWhy my chain rosey gold, why my wrist below zero?\nHow the hell I know B-Lo, why them girls tell you no means no?\nNo means no just as sure as green means go\nGreen means paper, dream team caper\nWe see haters like shorty on the 'Sixth Sense'\nY'all finna' see some dead people\nCome through ya block and air people\nMy people ain't scared people, only FIG-I-AIR people\n\n[Hook]\n\n[Verse 2: Whiteboy]\nWhite Boy back in the mix and I'm in the atmosphere\nCrunkin' for stackin' the fifth and we got them gats in here\nThis is not a game, Cris is not a lame\nChi-town drop the flame, White Boy got them thangs\nWhite Boy a hot damn shame, White Boy hot like mars\nY'alls flow hot like March, y'all can't stop these bars\nWhite Boy drop these charts, White Boy got the ball\nLyrics gon' shock you all, Cris gon' cop them cars\nGet a couple foxy broads, out they shoes socks and bra\nThis is not so hard, Cris got a rocky heart\nPimp wit' a monster walk, Cris got hostile thoughts\nY'all better watch it dawg, me and West rock you dawg\n\n[Hook 2x]\n\n[B-Lo]\nRap profit, plat Gothic, slash convict raps jock it, phat\nPockets mac, hopin' crack, poppin' stacks\nDroppin' cakes, stoppin' wakes, knockin' hate\nAnd you fakes, watchin' base, on relate\nGossip fakes and I make, opt, yeah\nIn case I catch a case gots to pay, confrentrate\nNeed ya way, from this place cause it ain't common (nope)\nIf this ain't the way, Kanye, then it's straight\nColleges in ya veins cause you spit what you came from\nStraight knowledge, I was raised in the street\nPraised in my heat, holdin' on my Nextel\nHopin' for the next cell, focused on the best cell\nSmokin' on a fresh L, posted like FedEx mail\n\n[Hook 2x]", "image": "https://images.genius.com/e00085bf087c8e35e4d55ae683cbbcd7.500x500x1.jpg"}], "artist": "Kanye West"}