{"songs": [{"title": "Like I Died (Remix)", "album": "The Lost Scripts of K.O.D.", "year": "2010-03-30", "lyrics": "[Intro: Tech N9ne]\nPlay my records like I've taken the big ride!\nLike a deadly virus killin' me inside!\nI know you sucker DJs got a lot of pride\nAll jokes aside, even though I'm still alive\n\n[Hook: Tech N9ne]\nPlay my music like I died! (To the DJ)\nLike the Nina ain't alive! (Quit the replay)\nLike I took the long ride! (My D-Day)\nLike everybody loved my music and the whole world cried\n\n[Verse 1: Tech N9ne]\nLike I was hidin' in a cave keepin' all my soldiers enraged\nGet em' all to the USA for mo' drama!\nBut the U.S. soldiers were brave and they found my cave, did a raid\n.50 calibers sprayed and the grave said Osama!\nCause of death: severe frontal lobe trauma!\nWhen I resurrected, neglected to go rama!\n\"Gone I'm sho gone a\" show that you has no honor\nHaunt the White House, but I got ectoplasma from Obama!\nLike I snatched a lady up in my old Honda!\nThen it turned out to be it was Kimbo's mama!\nGet her back to the crib where I kill and I grow ganja\nShe flipped and stuck a nigga then beat me to death with my chrome llama!\nLike I'm a gangsta rappin' with no monetery gain\nAin't no fame or no nanna, no genre!\nLike I broke into cots to get lyrics\nAnd got murked by Sinéad O'Connor!\n\n[Hook: Tech N9ne] (x2)\nPlay my music like I died! (To the DJ)\nLike the Nina ain't alive! (Quit the replay)\nLike I took the long ride! (My D-Day)\nLike everybody loved my music and the whole world cried\n\n[Verse 2: Craig Smith]\nPlay my music like\nLike I was Michael in the ICU\nProbably be watchin' the news\nHopin' that I'll be cool\nPaintin' pictures of my album covers\nRemember where you was the day you heard\nI was in the grave being played number 8\nHe was the hero\nIn the air, The Untamed\nMost imaginative renegade\nNever got played\nFeel like I'm Superman, but nobody's in danger\nDie for the salvation of music, born in a manger\nHypothetically ready to get up and set it off\nOn a stage, but a hater ran up and let it off\nSo every time I'm, brought up online\nChange your statuses to commemorate the young one\n\"Mr. Smith, the late, great, the bomb\"\nBe sad when you realize the best is gone\nAnd when it happens, you probably gon' be rapping along\nI massacred them other rappers with songs\nSo play my music like I died\n\n[Hook: Tech N9ne] (x2)\nPlay my music like I died! (To the DJ)\nLike the Nina ain't alive! (Quit the replay)\nLike I took the long ride! (My D-Day)\nLike everybody loved my music and the whole world cried\n\n[Verse 3: Krizz Kaliko]\nLike I got Herpagonasyphilaids (Gone!)\nWrists slit, with a razor blade of my (Own!)\nLike I was in a car wreck couldn't stop my neck from snappin'\nRun up in the dope spot and try to stop 'em from trappin'\nTry to make niggas and Aryans brothers\nRun up on Crips n' Bloods\nTell 'em they both wearing the wrong colors\nLike I let a mass gunman approach me\nWent to Michael Jackson's doctor and asked him if he can dose me\nTold Shauntay Henderson that I love her\nDead, from hittin' superhead without a rubber\nCavose and overdose and hits of X pills\nWas in Brother Lynch's kitchen when he plotted his next kill\nLike I frequently vacation in Haiti\nRaped a Vegas hooker, told her pimp he should pay me\nAt OJ's house and creepin' out with his Lady\nBefore he shaved me I'd holla, \"Kali Baby!\"\n\n[Hook: Tech N9ne]\nPlay my music like I died! (To the DJ)\nLike the Nina ain't alive! (Quit the replay)\nLike I took the long ride! (My D-Day)\nLike everybody loved my music and the whole world cried\nPlay my music like I diiiiiiied! (To the DJ)\nLike the Nina ain't aliiiiiiiive! (Quit the replay)\nLike I took the long riiiiide! (My D-Day)\nLike everybody loved my music and the whole world cried\n\n[Outro: Tech N9ne]\nPlay my Music like I died...\nLike the Nina ain't alive...\nLike I took the long ride...\nLike everybody loved my music and the whole world cried", "image": "https://images.genius.com/a60b8f8bf0c0ca59207263aceaeea442.220x220x1.jpg"}], "artist": "Tech N9ne"}