{"songs": [{"title": "Real Soon", "album": "Bigg Snoop Dogg Presents... Welcome to tha Chuuch: Da Album", "year": null, "lyrics": "[Snoop]\nSpecial dedication from the D.P.G.C\nTo all the homies locked down\nHope that we could be together soon\nOn some real talk\nWe used to do it big out here, my nig\nYou should see how we doin' it out here now\nCheck it out...\n\n[Daz]\nIt's been eighteen years since I seen you on the streets\nYou're up for parole heard the word this week\nMy cousin Flip comin' home damn it's been so long\nKeep ya eyes on the prize, homie keep ya head strong\nSendin' ya packages, kites keep you straight\nDeep in this caleseri, fat 'till it date\nSo we can chop it up, so we can spread the icin'\nEnticing OG's fo' surely, you know I like it\nThis is a D.P.G. dedication\nIt's for my homies on parole or probation\nAnd you can catch a case homie on vacation\nIt's for the radio, so ya'll just bang it\n\n[Snoop]\nTo my young homeboy, who ain't never gettin' out\nHere's a record for you homie, cause I know you got clout\nOne love, Eastside, that's how we do right\nD.P.G.C. we do or die\nOh yes we fresh to death, nonetheless\nWhen we was out, we was rockin' Guess\nBut guess what?, now we rockin' Snoop Dogg clothin'\nAnd every nigga in the click straight rollin'\n\n[Hook: Nate Dogg]\nHope that, we can be, be together real soon...\nI hope that, we can be, be together real soon\nReal soon...\n\n[Kurupt]\nJust a little bit of game ain't a damn thang\nLet the heater rang, bang, Dogg Pound gang swang\nRide wit me, let me show ya how the D.P do\nG.C. Dat Nigga Daz, Kurupt, Nate, Snoop\nThe homies might flash\nKick back, send about five of 'em past\nAll I wanna do is D.P.G\nAnd keep it like that and hit donuts in the streets\nRidin' by, gettin' high, do that one-two step\nMake the whole spot stop, then hit the vogue(?) next\nMe and Daz ridin' side by side\nNate and Snoop ridin', one in front, one behind\n\n[Snoop]\nTo my young homeboy, who ain't never gettin' out\nHere's a record for you homie, cause I know you got clout\nOne love, Eastside, that's how we do right\nD.P.G.C. we do or die\nOh yes we fresh to death, nonetheless\nWhen we was out, we was rockin' Guess\nBut guess what?, now we rockin' Snoop Dogg clothin'\nAnd every nigga in the click straight rollin'\n\n[Hook]\n\n[Nate Dogg]\nNigga out up on the streets tryin' to come on up\nGot caught slippin', and got caught the hell up\nJust tryin' to make some money wit my rhymes\nCheddar for my baby, then live right\nGot me a room and a couple of rocks\nRaised on the streets, yes, the school of hard knocks\nNigga betta pay me, ready or not\nFindin' dead bodies all on your block\nNigga gotta get paid, and that's on the real\nBroke on the smoke, then you know how I feel\nI miss the real gangsta's, and that's on the real\nGot locked up while chasin' the scrill...\n\n[Snoop]\nTo my young homeboy, who ain't never gettin' out\nHere's a record for you homie, cause I know you got clout\nOne love, eastside, that's how we do right\nD.P.G.C. we do or die\nOh yes we fresh to death, nonetheless\nWe was out, we was rockin' Guess\nBut guess what?, now we rockin' Snoop Dogg clothin'\nAnd every nigga in the click straight rollin'\n\n[Hook]", "image": "https://images.genius.com/8e8aba874cbc18527cb38b22cc853b6c.220x218x1.jpg"}], "artist": "Snoop Dogg"}