{"songs": [{"title": "Kool Kid Freestyle", "album": null, "year": "1999-01-01", "lyrics": "[Eminem]\nI'll leave your blueprints covered in shoe prints\nPoppin' Nuprin\nNeighborhood nuisance\nMurder your family for two cent\nMakin' your crew tense\nBrain's too dense\nLeave the mic with two dents\nFresher than a whole mouth full of chewed mints\nGivin' you rude hints\nCause if you're wack I'm gonna tell ya\nI got the issue where they diss you in next month's Source I'm gonna mail ya\nYou're a failure\nYou're style's staler than a bowl of hardened rice\nScarred and sliced\nI flunked kindergarten twice\nBut you ain't hard and nice\nAnd you sure ain't servin' no bids\nSayin' you did is like seein' a damn virgin with kids\nCreepin' like a phantom\nHoldin' my dick like the Player's Anthem\nHoldin' this microphone for ransom\nBitches ask me why do I talk nasty?\nGrab an ass of every trashy whore that walks past me\nMy crew's on drugs, lookin' like zombies\nSmokin' bomb trees\nRacin' police in Dodge Omnis\n\n[Royce Da 5'9\"]\nLock, cock and explode\nWay beyond bitin' a nigga\nGet hungry, disconnect my jaw and swallow you whole\nI'm probably gonna blow\nGo to hell holdin' a mill\nStreet smart, under educated, over skilled\nI'm tight to the vest\nYou wanna rip me off? Then try\nI fight to the death, who wanna piss me off, then die?\nCurse niggas that try, I'm the first nigga to bust\nYou the second nigga to pull, and the first nigga to die\nHow dare you think that you gleam like the rest of my team\nYou a bitch, you like a chip off a berget in my ring\nStick to my words, so I don't threaten niggas no more\nIf I make you a promise, then it's safe to say that it's honest\nMy guns is tired from being fired\nWhile yours sits on the shelf\nI'm like a song concept in itself\nTotin' my weapon, burnin' your vest\nIn '99, wack niggas learn from the best and hope to be second\nNigga\nKool Kid nigga\nWhat? Royce 5'9\", Slim Shady, motherfucker", "image": "https://images.genius.com/f0f2030a7d12ee23ba97a04eee47b21a.355x355x1.jpg"}], "artist": "Bad Meets Evil"}