{"songs": [{"title": "Canal Street", "album": "Only Built 4 Cuban Linx... Pt. II", "year": "1995-09-08", "lyrics": "[Intro: Raekwon, (Unknown)]\nAyo, ya'll ready, right? (Professionals) Aight\nNone of that fronting shit, neithers, nigga, it's broad day (immediatly, nigga)\n(What the fuck nigga talking bout?) Word up, the store is over there\nNigga, let's go\n(Have I ever fronted on you nigga? Yo, you grab the three from him\nYou grab the heatholders)\nYeah, we got the big jewelry in the window (you grab the watches, nigga)\nYou seen that shit? You seen that other shit? (You better come out and\nDo something, nigga)\nRight, good good, that's me right there, aiyo you, everybody come out\nAll you gotta do is just come with the bricks, son\nI got a big brick in the muthafucking little bag, nigga\nTake that, just smash the shit out\nBout four-five niggas gon' spit it ---- *gunshots*\nMove! Let's go. police, come on son! They right down the block, nigga\nYa'll got that? You check the train station, one son (Good!)\n\n[Verse 1: Raekwon]\nAll of our fathers is bank robbers holdin' TECs\nEighths of heroin, shooting in the steps\nIn the 60's, niggas was poor, check the revelation\nNow we rock six fifties in the snow\nAK's, AR's, wire jaws, say ours\nYSL frames in the rain, Marvin Gaye on\nGoose bubbles on, stuck in the huddle, tryna transform\nEvery gram action to a sandstorm\nFly through my block you live, make a bitch stop\nHave your shit cocked yo, niggas might dive on you\nAll we wear is Filas, Guess, suede fronts, beehives\nBally sneakers, big jewels, Levi's\n\n[Hook: Raekwon]\nBack to slinging every 45 minutes\nG's fleeing, fiends is in the building OD'ing\nThe drugs is in the ground, burners on the side of our legs\nIt's gonna happen so you know we low keying\nYeah, can't sell in here, yup, I said it\nYeah, can't tell in here, they won't credit niggas\nJust a lifestyle, the holders with the drugs is dreaded\nJust a typical day to get wiped out\n\n[Verse 2: Raekwon]\nBroad day jungle, living with the rodents\nThe goons'll run through, blow a bag and hunt you\nAlways flaky, calluses hands my mans\nCome through the avenue, Swiss cheese patrons\nBlood that flood the hall, every head'll drop\nJump in the Maybach, switch the station\nThese rap niggas is wash, hang 'em on the pole, no head\nPajama top, handcuff with a gosha\nWe realer than the Spanglers Rep Posse squad that's dangerous\nTake it back to the Lee's and Wranglers\nTake what we want, explain this\nFamous for my kitchen knives, rings and the fifths are stainless\nGun down your trooper, grenade your coupe up\nPlain and simple niggas is poo-putt\nFuck with my crew, what? Either you shot or you cut\nReal nigga to real nigga man, you know how we get down, man\n\n[Hook: Raekwon]\nBack to slinging every 45 minutes\nG's fleeing, fiends is in the building OD'ing\nThe drugs is in the ground, burners on the side of our legs\nIt's gonna happen so you know we low keying\nYeah, can't sell in here, yup, I said it\nYeah, can't tell in here, they won't credit niggas\nJust a lifestyle, the holders with the drugs is dreaded\nJust a typical day to get wiped out", "image": "https://images.genius.com/2691e582dc2839478e49279288d69cb1.1000x1000x1.jpg"}], "artist": "Raekwon"}