{"songs": [{"title": "Nas Is Coming", "album": "It Was Written", "year": "1996-07-02", "lyrics": "[Produced by Dr. Dre]\n\n[Intro: Nas & Dr. Dre]\nMotherfucking Dre, whassup my nigga\nSup Nas\nChilling God\nNiggas is up in here hittin' some of this chronic, nigga\nYeah and this chocolate over here, they mixed this shit up\nNigga, hit some of this shit, nigga\nYeah, lemme get that, I'm tired of these niggas\nNiggas stealin' beats and niggas is stealin' your whole techniques and shit, niggas wanna take everything from a nigga man\nYeah yeah yo Nas it's like this man\nNiggas can't do it like I do it, d'yaknahmsayin'\nJust like niggas can't do what you do\nRight, right\nYou know, can't nobody fuck with this\nYou know all these niggas out here just\nTalkin' this East coast West coast bullshit\nNiggas need to kill that shit\nAnd make some money, y'know\nWord\nFuck it\nWhat is it, what is it God\nLet's get together, make some fuckin' music\nRight, that's what I'm sayin', that's what I'm sayin'\nAnd get paid, and just, let that be it\nAll these niggas talkin all this bullshit\nBetter sit back, and watch what happens\n\n[Verse 1: Nas]\nThe Golden Child chop that ass up, you was holding out\nLet the streets be the court and corners hold the trial\nFatal not fictitious\nI rock the cable '86 shit\nForeign cars young with crazy bitches\nMad smoke makes me able to quote\nSoliciting ill editions of that Murder I Wrote\nA provocative plan can bring a knot to my hand\nAs the pyramids that stand on top of the sand\nIn the heat of the moment\nLike Farrakhan said we need atonement\nBulletproof glass, S-classes chrome kitted up\nCalicones lit it up\nI didn't get touched checking my nuts\nI stood up and lit a Dutch\nClutching gats quick to bust\nBut knowing how these niggas tattle\nI sneak move get the drop, one shot without the gun battle\nSo when you run the lead travel\nI come through it's taboo\nNinety-six ways made to clap you\n\n[Chorus]\nNas is coming\nNas is coming\nNas is coming\nNasty Nas is coming\nNas is coming\nNas is coming\nNas is coming\nNas is coming\nNasty Nas is coming\nNas is comin\n\n[Verse 2: Nas]\nIn the black limo, Jack Daniels through the cracked window\nI spot the fake, red dot his face like a Hindu\nSnatched the symbol, tied his hands to make examples\nSubstantial amounts you owe to the firm\nCrew, Firm affliation, paper chasing\nChips glossy, rich Pablo Escabano\nSophisticado, blazing hollows like Saddles\nRap apostle, nacho cheese, I'm Castro\nCompared to these niggas who swear to be real\nBut impostors to Hoffa\nNas plague kills\nCounting bills to send to all my jail niggas who fell\nFrom New York to LA, QB to CPT for GP\nA hundred G cars\nGarcia Vegas cigars\nKani shit, mad jiggy\nThe clout, murder material serial scratched out\nMy name's passed out like it's something venereal\nBut back in stereo\n\n[Chorus]\nNas is coming\nNas is coming\nNas is coming\nNasty Nas is coming\nNas is coming\nNas is coming\nNas is coming\nNas is coming\nNasty Nas is coming\nNas is comin\n\n[Verse 3: Nas]\nFrom childbirth to hearses, flow like the Nile cover surface\nI bit the fruit from the Serpent\nApocalyptic, get bent stay splifted\nControl the rap game you got it twisted\nDr. Dre way, the Bridge say, shake dice and kiss it\nSip Cris' push the six with biscuit\nJeep full of chickens, pull up beside, have a listen y'all Nas y'all\nFly gangsta wavy hair teeth chipped in\nMy shit bump in the courtroom drunk, links truck\nRocky bracelet, cognac kernel never chase it\nRap hero black DeNiro\nFederal Bureau tapped my line and got zero\nRap pro diamond roll, hustling low\nPro-file white gold style, raking bloody dough by the pile\nShot down still alive he struggling for the phone\nFo-fo blow him, when homicide comes\nThese three words are sung\n\n[Chorus]\nNas is coming\nNas is coming\nNas is coming\nNasty Nas is coming\nNas is coming\nNas is coming\nNas is coming\nNas is coming\nNasty Nas is coming\nNas is comin\n\n[Outro: Dr. Dre]\nCheck this out, it's Nasty Nas, and Dr. Dre\nEast meets West\nThat's how we making it happen\nThat's how it goes down for the nine-six\nAyo Nas let's get this money\nLet's get paid\nSit back and watch all these motherfucking clowns out here\nRiffing and beefing about this bullshit\nYo while they doing all that\nWe just gon' kick back with these honies\nThis Cristal and party to the year 2G\n\n[Chorus]\nNas is coming\nNas is coming\nNas is coming\nNasty Nas is coming\nNas is coming\nNas is coming\nNas is coming\nNas is coming\nNasty Nas is coming\nNas is coming", "image": "https://images.genius.com/525377dd6bd0f221ead9371b7b53d9a8.1000x1000x1.jpg"}], "artist": "Nas"}