{"songs": [{"title": "14 Emcees", "album": "Return of the Dozen Vol. 2", "year": "2011-04-12", "lyrics": "[Intro: DJ Young Mase]\nI go by the name of DJ Young Mase\nD12 representor\nGood to be back\nBut this time, I brought fourteen friends\nMatter of fact, fourteen emcees!\n\n[Verse 1: Fatt Father]\nWell what do ya know? Fatt Father done showed up\nBreak out the blunts and a couple boxes of doughnuts\nNo time for stunts, I'm one militant grown up\nDrunk, willing to hold up chumps to get exposure\nFat Michigan soldier, cats itchin’ to fold ya\nTrapped in this ridiculous culture, fuck Oprah\nNo hope, my brain is broke, I'm bipolar\nYou microwave shit, I pop tarts with the toaster\n(3Six!)\n\n[Verse 2: 3Six]\nBeef with the beef, guarantee the whole crew will ride\nHang you, make your homicide look like suicide\nSo nigga, you decide\nEither you run with the squad, or you can keep playing God and get crucified\nUse the nine, I don't ride when it's Valentine\nSend you to the angels like you been traded to Anaheim\nBring the caskets out whenever I'm spazzing out\nTo find you in the woods somewhere, like [?]\n(Shakia Snow!)\n\n[Verse 3: Shakia Snow]\nBody bag ‘em, toe-tag ‘em\nLyrically, I beat these beats up like a Magnum (Get ‘em)\nYou getting fucked tonight, you better grab something\nFuck boy, I can hire you to go bag something\nMy money long, I don't even need a bank account\nBig bank take your little bank, what your bank about?\nMine read whole numbers plus six zeroes\nI be turning sixteens into a pocket full of Euros\n(Kid Vishis!)\n\n[Verse 4: Kid Vishis]\nYeah, Kid Vishis the Prince, sickest in Michigan since\nI've been spittin’, rippin’ niggas is a tradition\nI spaz, I can box, but I ain’t jabbin’\nI’ma pop his light bulb like a good thought gone bad\nThen get his chick, give her the hit stick like Madden\nFly as Aladdin, higher than Saturn with stilts\nEvery time I hit your white bitch twat, I get a gift\nCall that shit my Cracker Jack box\n(Shim E. Bango!)\n\n[Verse 5: Shim E. Bango]\nShim Bang’, F.K., the boy, it’s me\nMy goal is to be as high as Charlie Sheen\nIt’s hard to take MCs serious on screen\nWhen they prancin’, dancin’ harder than Ben Vereen\nIll skills, I spill fo' real\nOne shot put him in the chair like, “Chill”\nI’m in the sky rollin’ up ‘cause he be like, “Blill”\nI know your momma won’t but yo' main bitch [?]\n\n[Verse 6: T. Dot]\nI’m a drug mover and a rider, big wheel Blata\nBeef like Kobe, I’m the shooter and the driver (T. Dot!)\nShoot ‘till you see straight through your marauda\nThen slide off feelin’ like Hakuna Matata\nI don’t have lady drama\nStick her with seven pounds, six ounces like baby mama, .380 llama\nYeah I even got one wit’ me, ‘cause I ain’t tryna let ‘em do me like they [?]\n(Let’s go Beez!)\n\n[Verse 7: Beez]\nI’m blowin’ ganja smoke, packin’ all kinds of toast\nThat’ll make you change your lifestyle like the condom broke\nGet rid of work, I’m on the turf move slabs often\nI’ll push your shit back like a bad barber\nI lines ‘em up well, aim sharp Steve Harvey\nI’m Cheech and Chong, blowin’ hong like three Marleys\nI know they hate me\nI ain’t in low definition so I’ma be the first to do murders in HD\n\n[Verse 8: Reddbone]\n(Reddbone!) Who the fuck is she?\nThe [?] of these wolves, is that bitch a beast?\nI eat the weak, chew ‘em up, floss my teeth\nYou hoes is sweet, Willy Wonka [?]\nYo, regurgitate ya, [?] low like Terminator\nStomp rat bitches like roaches, exterminata\nWig split up, kush hit a [?]\nA rhyme spitta, you want it? Niggas can come hither\n(Seven the General!)\n\n[Verse 9: Seven the General]\nUgh, guess who’s next to bat?\nThe Warith Dean Fard Muhammad of the beans and crack\nOC’s, stick weed, coke, speed and smack\nLow speed, no keys in an egregious Lac\nLook, filipicus bone, fallopian tube\nThat’s one to the face and one to the boob, no interlude\nI’m, a regular dude with metals and jewels\nThe Veteran, General on you letterman noobs\n(Korona!)\n\n[Verse 10: Miz Korona]\nIt’s Korona, the sixteen queen, spit sick things, six sixteen\nSince I split sixteen, I’ll use eight to show you I’m a problem\nIf X marks the spot hand me the problem now\n‘Cause I ain’t movin’, it’s gruelin’ how I murder beats\nYou must be deaf, if you niggas ain’t heard of me\nDetroit’s most wanted, the queen, head honcho\nBitch get out of line I’m puttin’ hoes [?]\n(Mae Day, come on!)\n\n[Verse 11: Mae Day]\nThese niggas ballin’ [?] all them babies\nYou ain’t in my league, JV, maybe, I NBA in HD\nDOAO break beats, break bread, lay cheese\nOn a nigga head like he [?]\nStay clean, not a speck of dust on me\nFlow so cold could ride a Zamboni on it\nMy green yawnin’, meanin’ the money stretchin’, good morning\nAnd this ain’t Egypt, dethrone you niggas\n(Moe Dirdee!)\n\n[Verse 12: Moe Dirdee]\nI don’t answer questions, I ask ‘em\nCame from the bottom, just ask ‘em, ask ‘em\nMy name’s Moe Dirdee, what you know about me?\nWhat you know about work? Beef come, I’ma squirt\nChief blunts got purp, boat loads of hoes with throat action\nSniper rifle, thirty thirty, bolt action\nMoe knows pros from zones\nI’m runnin’ through the green till I’m retired, vault Jacksons\n\n[Verse 13: Chacity]\nIllest in the city, I’m your number one draft pick (Chacity!)\nAnd most them bitches actin’ like they never had shit\nA1 and them hoes a C, average\nHand ware, like tags on a mattress\nI hit the track with more crack than B Mo\nYour rhymes foul, you don’t even get a free throw\nEverybody might dig ya, but me know\nPut the Tommy gun to him, bleed slow\n(Calicoe!)\n\n[Verse 14: Calicoe]\nThese rap niggas a disappointment\nThis shit I got stick like tats, so get your ointment\nThe shit I got fire, it probably could keep your joint lit\nMy gun’s pointin’ like the refs ended the coin flip\nIt’s Calicoe, if you don’t know me better check the net\nThe only young nigga to stand out when he next to vets\nDisrespect? You can get your whole section wet\nWhen shit shakin’, niggas disappearin’, Etch A Sketch\n\n[Outro: DJ Young Mase]\nDamn!\nThere you have it, fourteen emcees\nD12, Young Mase!\nYou know what time it is, pay attention!\nWe back muthafuckas!\nShady Records!", "image": "https://images.genius.com/78a2dd37bee3129adb21d5fac55f009d.1000x1000x1.jpg"}], "artist": "D12"}