{"songs": [{"title": "Untitled ACL Song (10/10/2015)", "album": null, "year": "2015-10-10", "lyrics": "[Intro]\nNa nana na na na na nana\n(And what they say?)\nJust bounce to it\n(And what they say?\nWhat they say?!?)\n\n[Hook]\nAnd they say\nNanananana nananananana (Huh!)\nNanana nanana na na na\nNa nana na nanana nana (Igh! Igh!)\nNanana nanana na na na (Huh!)\n\n[Verse 1]\nI know the words (Igh! Igh! Igh!)\nI know the words, haven't you heard?\nNew album alert, shit's loud as the purp\nI'm out in the burghs\nOut in the streets, we was out on the curb\nFrom out of the dirt a mountain of merch\nI woke up with [?]\nIt's alright\nI wept, I prayed on it, I slept on it, wait on it\nJust flame up the Tunechi and know that you Gucci\nJust something to say on it\nSmoke like a sailor, curse like a chimney\nMy pops in the mirror, Mufasa is in me\nI ain't no goofy (I ain't no goofy!) I ain't no goofy\nI am the re-up, I am the plug, you can introduce me\nThis ain't no movie, I don't need jewelry, I don't need groupies\nI need my money, I need my money, I am the movement\n\n[Hook]\nAnd they say\nNanananana nananananana (Huh! Huh!)\nNanana nanana na na na\nNa nana na nanana nana (Igh! Igh!)\nNanana nanana na na na\n\n[Verse 2]\nMan I ain't no lame (Huh!)\nI know the game, I know my daddy\nYou can tell when I speak, I got his name\nI'm on my business (I'm on my business!)\nNot in the business, I'm not a prisoner, I got my soul (I got my soul!)\nI flaunt it, I wear it, I'm still a Christian, I still got hittas (I still got hittas)\nReesey and Justin a phone call away (That's right)\nThey say don't delay, and andale, they on the way (Igh!)\nCatch me in my city on the daily with the kiddies givin' tours to the tourists (Mhmm)\nGivin' our city to the kids, like givin' flowers to the florist\nPay the little skirt with the torn stitch, [?] with a pot of gold tourist\nGrab a couple bucks, take some more with ya\nYou ain't know Open Mic's open doors, did ya?\nI ain't no stain, I am for free\nI am a promise, capital \"P\"\n\n[Hook]\nAnd they say\nNanananana nananananana\nNanana nanana na na na\nNa nana na nanana nana\nNanana nanana na na na\nAnd they say\nNanananana nananananana\nNanana nanana na na na\nNa nana na nanana nana\nNanana nanana na na na", "image": "https://images.genius.com/9db1a9643a028d62543e44c90da3a6ad.1000x1000x1.jpg"}], "artist": "Chance the Rapper"}