{"songs": [{"title": "Own It", "album": "Nothing Was the Same", "year": "2013-09-24", "lyrics": "[Produced by Noah \"40\" Shebib & PARTYNEXTDOOR]\n\n[Intro: PARTYNEXTDOOR]\nOwn it\nIt's yours\nIt's yours\n\n[Verse 1: Drake]\nYours... You're still the one that I adore\nAin't much out there to have feelings for\nGuess whose it is? Guess whose it is?\nGuess whose it is? Guess whose it is? Yours\nA few bottles on the table, a few waters\nIt ain't a secret, baby, everybody saw us\nGuess whose it is? Guess whose it is?\nGuess whose it is? It's yours\nNext time we fuck, I don't wanna fuck, I wanna make love\nNext time we talk, I don't wanna just talk, I wanna trust\nNext time I stand tall, I wanna be standin' for you\nAnd next time I spend I want it all to be for you\nPeakin', I'm peakin'\nWake up with me this weekend, we can, oh\nGuess whose it is? Guess whose it is?\nGuess whose it is? It's yours\n\n[Hook: PARTYNEXTDOOR]\nOwn it, own it, own it, own it, own it, own it, own it, own it\nOwn it, own it, own it, own it, own it, own it, own it, I said\nGo own that shit, own that shit, own that shit, own that shit\nGo and own that shit, own that shit, own that shit, you own that shit, go and\nOwn it, own it, own it, own it, own it, own it, own it, own it\nOwn it, own it, own it, own it, own it, own it, own it, I said\nGo own that shit, own that shit, own that shit, own that shit\nGo and own that shit, own that shit, own that shit, you own that shit, go and\n\n[Verse 2: Drake]\nNiggas talk more than bitches these days\nJust let that shit sink in, ha!\nNiggas talk more than bitches these days\nWho could get the pussy quicker these days\nStill straight with the weed and the liquor these days\nCause the new drugs got the kids trippin' these days\nBunch of journalists been searchin' for a story\nMy ex-girl been searchin' for a \"sorry\"\nCouple bitches tryna have me on the Maury\nLike nigga it's yours, you should be supportin'\nBut where you been at? On tour, gettin' money\nY'all don't even really check for me\nYou ain't even hit me when that nigga had threats for me, girl\nYou don't love me, you just say that shit to get to me, girl\nCause you got the Batphone and my workline, you should call\nWhen the last time you did somethin' for the first time?\nYou done done it all\nI swear to God, niggas talk more than bitches these days\nGot you thinkin' that I'm different these days\nBroken telephone for every single conversation\nBy the time it gets to you, shit switches these days\nIt's yours, it's yours, it's yours, it's... it's always gonna be yours\n\n[Outro: PARTYNEXTDOOR]\nOwn it, own it, own it, own it, own it, own it, own it, own it\nOwn it, own it, own it, own it, own it, own it, own it, I said\nGo own that shit, it's yours, it's yours, own it, own it, own it, own it\nOwn it, baby, own it, it's yours, own that shit, own that shit, own that shit", "image": "https://images.genius.com/84ad5364b68fe10c7405ba894802736d.1000x1000x1.jpg"}], "artist": "Drake"}