{"songs": [{"title": "To All My Niggas", "album": null, "year": null, "lyrics": "[P.Diddy]\n{*gunshot*}\nShadyville Entertainment, Bad Boy collaboration\n\n[Intro] (50 Cent)\nI love niggas! I love niggas!\nCause niggas are me!\nAnd I should only love that 'presents me\nI love to see niggas go through changes (Whoooo!!)\nI love to see niggas shoot through shit (Did it again)\nAnd to all niggas that do it I love\n\n[B.I.G.]\nTo all my Brooklyn (Niggas!)\nTo all my Uptown (You niggas understand?!)\nTo all my Bronx (It's war nigga)\nTo all my Queensbridge (I'll blow you away)\n\n[Verse: B.I.G.]\nBack up chump, you know Biggie Smalls grips it quick\nAnd kicks it quick, you know how black niggas get\nWith the hoods fatigues with the boots with trees\nSmokin weed, flippin ki's, makin crazy G's\nHittin' buckshots at niggas that open spots\nOn the avenue, take my loot, and I'm baggin you\nPimpin hoes that drive Volvo's and Rodeos\nFlash the Roll, make her wet, in her pantyhose\nDamn, a nigga style is unorthodox\nGrip the Glock, when I walk down the crowded blocks\nJust in case a nigga wanna act out\nI just black out, and blow they motherfuckin back out\nThat's real\n\n[Chorus: 50 Cent] (2x)\nWe the realest nigga\n50 Cent and B.I.G. my nigga\nDon't try to act like you don't feel a nigga\nBiggie yo nigga, 50 yo nigga\nSqueeze the trigga' leave a nigga fa' sho!\n\n[Verse: B.I.G.]\nWhen we smoke spliffs, we pack four-fifths\nJust in case dread wanna riff\nHe get a free lift to the cemetary, rough very\nNot your ordinary, we watch you get buried\nThat's a real nigga for ya\nGet mad do a quarter flip the script, and rip your lawyer\nSpit at the D.A. cause fuck what she say\nShe don't give a fuck about your ass anyway\nUp North found first stop Watertown\nOf fist-skill, where the hand skills are real ill\nYou'll be a super Hoover doo-doo stain remover\nHa hahhh, yo Chief, pass the Buddha\n\n[Chorus]\n\n[Verse: 50 Cent]\nWhen I was young my M.O. was to go hand-to-hand\nAnd even my P.O. she called me the Ginger Bread Man\nI catch a new case, and tell her ass \"catch me if you can\"\nDon't let your people fill you up wit octane I'm not playing\nGet gassed up to get blast up\nReal B.I.G. style watch the kid break it down\nCheck it, thou shalt not fuck wit North C. Papa\n50 Cent, I'll break yo ass off propa'\nThere's no place like home, New York - New York\nI run this city, I don't dance around like Diddy\nNiggas is giddy, till they act smack silly\nOr spray wit the Mack Milly, they don't want drama really\nPussy niggas get hard lip syncing my lyrics like Milly Vanilly\nEven the hood they feel me {*gun cocked*} hah! I'm on fire!\nNiggas out in Philly they feel me, they bump my shit\nEvery bootlegger you know, bump my shit, bitch!\n\n[Chorus]", "image": "https://images.genius.com/3ac0369e9af7e95b4d1574832fafebfe.430x430x1.jpg"}], "artist": "50 Cent"}