{"songs": [{"title": "Gotta Pose", "album": null, "year": null, "lyrics": "[Intro]\nKanye to The, yeah, you heard the name\nChecks plus raps finna murder the game, uh\nCan y'all get it? Fuck y'all\nUh, uh, uh, uh, uh, uh\n\n[Verse 1]\nAll these niggas believe\nThey breathe the same air that I breathe and bleed like I bleed\nOnly difference though, I fuck better hoes\nIceberg clothes, I got to pose\nEvery whip with the studio in a hospital\nThis nigga flow is very sick\nPlus very rich hoes, very thick chain, very thick\nFeel like I could fuck every bitch\nTwenties at the bottom, carry the six\nIf I cop back, then shot him, I buried him six\nYou can't hate this nigga with the platinum braces\nI rather need new teeth than a whole facelift\nPlus your taste is rather tasteless\nTest my aim and watch me ace this\nYou wack rap cats need a replacement\nSo I hit the basement, took it back to basics\nReach down to my Timbs, grab my laces\nGot loops on niggas, y'all want a tight noose on niggas\nIf I ain't holler at you for (?), niggas\nWhat the fuck I got to do, another truth for niggas?\nSee, it don't really matter what y'all prove to niggas\nY'all ain't satisfied 'til we shoot some niggas\nSo if somebody got to die, tell me who want it\nThat Chi-Town, South Side bullshit, we on it\n\n[Hook]\nWho you know twenty-five that rolls?\nFifteen carats on top of the white gold\nPull up in the drop, then froze\nI got to pose\nGo on 'head, baby, you could pose\nGettin' naked at Go-Getter shows\nThen she drop, then froze\nI got to pose\n\n[Verse 2]\nMan, bitch, I ain't finished with your ass\nHeavy all night, spendin' cash at the ball\nAt the show and before we got back\nAt the gas station buyin' your ass snacks\nAt the liquor store buyin' act right juice\nSo when we get bid-ad, you know how to hit that\nNext time, bring some friends for me to get at\nBut no fat hoes, you expect me to hit that?\nMolly set me up like, \"K got scratched\"\nRun up in the crib mad, stuck with that\nY'all niggas talk that, but y'all don't really lit that\nSo I had to hit them with the flat out, get your ass out\nYou tuned in with the boss of the bosses\nNFL, no fuckin' losses\nChain flossless, fuck with it cost us\nWe go broke, we take y'all for hostage\n\n[Hook]\nWho you know twenty-five that rolls?\nFifteen carats on top of the white gold\nPull up in the drop, then froze\nI got to pose\nGo on 'head, baby, you could pose\nGettin' naked at Go-Getter shows\nThen she drop and froze\nI got to pose\n\n[Verse 3]\nYou see me rollin', smokin', coastin', boastin'\nPlus a little gone off the potion\nOh, and known for flossin' a little too often\nMight end up in a coffin\nI'm floatin' cause I don't smoke like that\nY'all niggas want to plot, we don't joke like that\nFaggot-ass niggas get approached like that\nMatter of fact, murder gettin' wrote like that\nI'm finna take these niggas back to the streets\nBack to hoppin' out the 'Lac with the heat\nBack to the fifty, posin' with some bitches\nIn front of that airbrushed 2Pac picture\n\n[Hook]\nWho you know twenty-five that rolls?\nFifteen carats on top of the white gold\nPull up in the drop, then froze\nI got to pose\nGo on 'head, baby, you could pose\nGettin' naked at Go-Getter shows\nAnd then she drop and froze", "image": "https://images.genius.com/70c6e506a91f6dabdd23cad304812ce3.533x533x1.jpg"}], "artist": "Kanye West"}