{"songs": [{"title": "Fa Ha", "album": "10", "year": null, "lyrics": "\"Don't you knowwwwww, don't you knowwwww..\"\nSee this is worldwide baby\n\"That it's wrong..\"\nGermany, Italy.. France, Japan\n\"To take what is given..\"\nMany foreign lands..\nTalkin bout {HA!} Queens\nI'm talkin bout, Brooklyn\nI'm talkin bout, Uptown\nI'm talkin bout, downtown\nOh y'all with this too {HA!} Jerz!\nThe girl like, Strong Isle (oh they wild)\nThe girl like, Neticut\nYo they get them, they need to get more shoutouts up there, word up\n\"To take what is given..\" {HA!}\n\n[LL Cool J]\nBreaker breaker one-nine, I had a rendezvous\nPop vintage wine with this dime, hot as a barbecue {HA!}\nShe was young, too wild without a curfew {HA!}\nSmile I hurt you, had me goin berzerk too\nI'm guaranteein she'll be leanin in the coupe\nFiendin for your loot, little demon schemin for Tiffany hoops {HA!}\nYeah, her right there, Dominicans is doin her hair\nThe jewels and gear, it's all there, fully equipped\nBody sick, she never played fair, yeah {HA!}\nFar from classy, walk real nasty\nTalk real sassy, why you frontin?  Come smash me\nI can't do it baby-girl, your man might blast me for {HA!}\nI can't die for American Pie\nHypnotized cause somebody combined thighs and lies, but it's {HA!}\nNo surprise, your pipe will rise\nDon't bounce with her, puff a ounce with her, not wise, not with {HA!}\nPapi chill, get sloppy, get killed by {HA!}\nBlood streams the guillotine f'real, yeah {FA HA!}\nPop bottles with hot models and rock throttles\nI guess your motto is I'm a desperado\nLeave {HA!} alone, end up like Castellano\nBelieve me, she flap her gums like Sammy Gravano\nIt's easy, child barely an Italiano\nBut don't do it, she'll have your eight by ten on every channel\n\n[Hook]\n{HA!} No honey can set your body on fire like\n{HA!} Make you wanna get higher and higher with\n{HA!} Put your muder game down so you can buy it for\n{HA!} Street dreams, you gon' hustle and retire with\n{HA!} Walk in the crib, filled with desire for\n{HA!} SL, the rims and the tires for\n{HA!} Third strike, and all of your priors for\n{HA!} Gave up your whole empire for {FA HA!}\n\n[LL Cool J]\nShe do it so fluid it's hard to see through it, 'til it's too late\nYou wanna time travel and re-do it, but wait\nYou a inmate, or worse at the pearly gates\nDamn, all because you and {HA!} had an early date\nClose your eyes, recognize, visualize\nWhat's the real reason you really freezin them pies, huh? {HA!}\nTan lines, strawberry oil on the thighs\nGot you subconciously contemplatin suicide\nShoulda learned, remember how your man died? {HA!}\nGrabbed his iron, it was time to ride for {HA!}\nMultiple homicides, takin lives for {HA!}\nHe's dead and gone, the next man's deep inside {HA!}\nCheck one-two, I select a few\nJewels for those of you, who are still confused\nShe's an obstacle, hot and tropical\nFatty so rockable, that anything's possible with {HA!}\n\n[Hook]\n\n[LL Cool J]\nCheese fantasies, dodgin the D's to please {HA!}\nLivin life on a flyin trapeze to keep {HA!}\nWho's the one you want? {HA!} Who you wanna flaunt? {HA!}\nShe haunted, but who's the only bird you ever want? {FA HA!}\nWhy you sell drugs? {HA!} Why you a thug? {HA!}\nWhy do fools always seem to fall in love with {HA!}\nMore advances than technology\nEvery day I stack chips, whether music or flicks\nAll these transparent cliques full of devilish politics\nWish they could take my longevity and bottle it for {HA!}\nBut they can't so they kill for Grants\nSmuggle iron in the party, pop {ex} for hot sex with {HA!}\nLove's an illusion, mental and emotional confusion\nInstant gratifacation oozin\nExotic temptress, eyes just like a empress\nSpilt game relentless, I had to represent Miss {HA!}\n\n[Hook] - repeat 2X (skips at start of second repeat)\n\n[LL Cool J]\nYeah, oh yeah {HA!}\nIt's my 10th album, ha ha {HA!}\nHeh, and you don't stop {HA!}\nI said this my 10th album, uh-huh, oh yeah yea yea, yeah {HA!}\nAnd you won't stop, knahmean? {HA!}\n10 baby {HA!}\nEasy\n\"To take what is given..\"\nWe right baby, huh", "image": "https://images.genius.com/4f8b990045f8d7f5532831376c6d5cbc.500x500x1.jpg"}], "artist": "LL Cool J"}