{"songs": [{"title": "Clap Your Hands", "album": "Walking with a Panther", "year": "1989-06-09", "lyrics": "[Intro]\nYeah..\nYeah I like that guitar man, yeah\nYo E-Love I like the way you flipped that guitar, man\nKnahmsayin? It was a good idea man, knahmsayin? Yeah\nIt's kinda like freakin me, yaknahmsayin?\nI wanna get hype man, I wanna do this, yaknahmsayin?\nJust gon' chill, check it out\n\n[Verse]\nSlick as Vasoline, smell good as cologne\nI'm like a muscle man in jail -- they leave me alone\nI rhyme like Superman, you rap like Jimmy Olson\nI'll break you like a bottle of green Golden Molson\nYou ain't a real rhymer, you look like a actress\nHow you gon' sleep on me, holmes? Do I look like a mattress?\nAm I that old? Do I walk like Grady?\nI'm 150 proof, Smirnoff is only 80\nDon't you EVER try to rock my house\nI'm a real cool cat, know what I'm sayin Mickey Mouse?\nThe poetry specialist, so take a dose of this\nNow think about it -- can you really come close to this?\nYou soft as powder, weak as a cabin cooler\nUgly as work shoes, messin with the Ruler:\nThe ultimate writer, reciter and def entertainer\nI work myself harder than a boxer's trainer\n\n[Chorus]\nClap your hands everybody (aiyyo)\nAnd everybody just clap your hands (aiyyo)\nClap your hands everybody (aiyyo)\nAnd everybody just clap your hands (aiyyo)\nI said, clap your hands everybody (aiyyo)\nAnd everybody just clap your hands (aiyyo)\nClap your hands everybody (aiyyo)\nAnd everybody just clap your hands (aiyyo)\n\n[Verse]\nYou'll end up underneath my sneaker\nYou're dog doo-doo, I'm watchin you get weaker\nYou can't believe, the skill and dexterity\nLL Cool J, and the J is for Jeremy\nSo buff me, James Todd the earthquaker\nThat's right my brother, you're goin out like Sega\nScrewed and chewed, so whassup dude?\nOne of my ballads'll get your girlies in the mood\nSucker MC's really make me sick\nI'm so bad, I can suck my own dick\nIf you go to your girl's house and I'm there already\nDon't go Crazy cause my name ain't Eddie\nRhymes so rough, it's like a course in trigonometry\nWhen Einstein was talkin, he was talkin about me\nThe Prince of the Earth, and I'ma give birth\nTo a rhyme so hard you'll look soft as a Smurf\nGigglin and wigglin, so how we goin out?\nLOVELY, and that's without a doubt!\n\n[Chorus]\nClap your hands everybody (aiyyo)\nAnd everybody just clap your hands (aiyyo)\nClap your hands everybody (aiyyo)\nAnd everybody just clap your hands (aiyyo)\nClap your hands everybody (aiyyo)\nAnd everybody just clap your hands (aiyyo)\n\n[Verse]\nRappers are my servants, they serve me like an emperor\nWhen I'm through, you'll need a nurse to take your temperature\nAnd cool you down, cause you're cold as leftovers\nNot the ones on the table, I'm talkin about RUFF rovers\nYou can't get over, what's my name, Goofy?\nYou smoke I'm no joke, so my brother break out the looseys\nAnd take a pull, cause the buck stops here\nI get swift as a magician, wreck shit and dissapear\nDon't cross me, or lose your loyalty\nTo the Prince of the Rap Court, I'm royalty\nAnd it ain't no puzzle, it's a shame how rappers guzzle\nParagraphs I put together so I carry a muzzle\nTo shut em up and cut em up and make em be quiet\nI'm a one man RIOT, so don't even TRY IT\nThe Prince of special tactics, plus I'm athletic\nBefore you play your hand you better do some calisthenics\nJumpin jacks, squats, push-ups, the whole nine\nSpeak your piece, then I'mma go for mine\nAnd I guarantee you, I'm gonna strike again\nI recommend my friend you drop the pen and give in\nCop out to one rhyme cause you're facin ten\nI ain't Sidney Poitier but we can \"Do This Again\"\nI'm nice wit mines, and I gotta admit it\nYou don't really wanna battle, why don'tcha just forget it!\n\n[Chorus]\nClap your hands everybody (aiyyo)\nAnd everybody just clap your hands (aiyyo)\nClap your hands everybody (aiyyo)\nAnd everybody just clap your hands (aiyyo)\n\n[Verse]\nBut if you're hard-headed and you still don't understand\nHere's a little sample - ahem, my man\n\n*BRRRRRRRING* \"Hello?\"\n{*cut n scratch \"Cool J\"*}\n\".. takes everything you've got\"\n{*cut n scratch \"pushin a broom\"*}\n\".. sure would help a lot\"\n\nCheck my stats, how we livin, I thought so\nI'm fresh, oh yes. But can they flow? Hell no\nMy rhymes are up to date, excellent, on point\nI'm tellin you, they're the serious joint\nI eat my steak fast, I drink my brew slow\nMy voice is milky with a nice clear flow\nI eat like a fat man, and walk like a gigolo\nI'm not a ballplayer, so now Y'KNOW!\n\n[Chorus]\nClap your hands everybody (aiyyo)\nAnd everybody just clap your hands (aiyyo)\nCuz I'm in the house, everybody (aiyyo)\nAnd everybody just clap your hands (aiyyo)\n\n[Outtro]\nKnowhatI'msayin?\nAnd I'mma be straight til the year 3000\nThat's word to 'muvva', yaknahmsayin?\nAnd I say 'muvva' with a V cuz the V is for Victory, yaknahmsayin?\nCuz I'm the victor in this game, word up, knahmsayin?\nThat's what time it is\nPeace\n\n{*crew applause and chatter*}\n\n[Member of crew]\nThat man, he sure is FUNKY FUNKY FUNKY FUNKY! Funky, he sho' is! You best believe he's FUNKY! You didn't KNOW??? FUNKY!", "image": "https://images.genius.com/35b951a9c90707d0d03de9bebbadefc6.999x999x1.jpg"}], "artist": "LL Cool J"}