{"songs": [{"title": "What’s Your Number? (clean album version)", "album": null, "year": null, "lyrics": "Let's go!\n\nI met her at the club, her friend liked me but she didn't\nShe noticed a lot of girls giving up their phone digits\nShe didn't want to be one of those ho's whose clothes\nExploiting their body's from head to toes. She had glossy lips\nShe was swaying her hips on the dance floor and every nigga's\nFlashing the grips trying to impress her in vain\nShe gave no play, Niggas hit her up for numbers and she said no way\nI thought to myself let it go the girl on beat\nBut like Smoky said she really had a hold on me\nI couldn't stop staring I started to fantasize with her\nVoices in my head said she's tantalizing ya. Even if I\nMoved to the other side of the party I had pictures in my\nHead of her moving that body. I was beside myself with conquer\nPain so I slowly walked over and I asked her name\n\nChorus 2x:\nWhat's your name? What's your number?\nI would like to get to know you\nCan we have a conversation?\nThe night is young, Girl\nGive me a chance\n\nShe gave a smile but I got no answer though it took a while\nBefore she could gave a chance she sat too cool. I offered her\nA drink she turned me down flat she said If you want my name\nYou gotta do better than that. I said, Okay, now your shit\nDon't stink, I'ma walk away, only tried to buy you a drink\nAs I began to walk away she said I'm sorry for reals, but every\nGuy in the club tries slipping me pills, I don't trust that each\nAnd everyone would lie to you I said I understand but that's\nNot what I tried to do, I wasn't even gonna go to your table but\nIf I didn't, I knew that I'd regret it later. I go after what I\nWant but I got class. For me no need to slip a pill if I want\nShe gave me a funny look, I couldn't tell what it meant. She let\nHer guard down and on the conversation went\n\nChorus 2x:\nWhat's your name? What's your number?\nI would like to get to know you\nCan we have a conversation?\nThe night is young, Girl\nGive me a chance\n\nLets go!\n\nShe said: I want a man with the plan and ambition, not an immature nigga\nOn a pussy-hit mission. I'm too good for that, I've got so much to offer\nGot a good job, working at my mom and dad's law firm. You got\nGoals? that's what she asked, Yeah, I want to fill my home with\nPlatinum plaques. It takes hard work but you know it's coming\nAfter. She said Oh My God! You must be a famous rapper. I do\nAlright, but I'm never satisfied. I'm told 'when you still love\nWhat you do it never gets old'. I strive for more but that's enough\nAbout me. Why don't we skip out the club, take a walk on the street?\nWe slipped outta the club with no worries, seemed she wanted to get\nOut in a hurry. We hung all night, and we lost our friends...'til\nThey caught us banging in the back of a Benz\n\nChorus 4x:\nWhat's your name? What's your number?\nI would like to get to know you\nCan we have a conversation?\nThe night is young, Girl\nGive me a chance\n\nLet's go!", "image": "https://images.genius.com/2615919eb0bcef9d55421080ab3b10b1.860x860x1.jpg"}], "artist": "Cypress Hill"}