{"songs": [{"title": "Jefe", "album": "DIME TRAP", "year": "2018-09-09", "lyrics": "[Intro: Dave Chapelle]\n(Oyy papi, Meek apurate, fuck!)\nNo more apologizing for being excellent\n(No se me importa. ¿Puedes apurarte?)\nFrom now on man, fuck it, I'm just gon' be dope\n(Quiero la plata, nada más)\nAnd not apologize for it\nI'm sorry I'm dope, nigga (Dámelo todo, lo quiero ya)\nWrap your mind around it and embrace it, this is a fact of life\n(Mmm, papi)\nBangladesh\nGod, I'm so good\n\n[Verse 1: Meek Mill]\nYeah, fuck up that money, then make it again\nI fuck her twice, then I make her my friend\nShit, look at these haters, they hatin' again\nI know they don't like it, they takin' it in\nFuck up a check, then we makin' it back\nShe like Chanel, I'ma drape her in that\nShe want the D, I've been waitin' on that\nI've been doing my thing, they've been hatin' on that\nAnd I meant what I said, I ain't takin' it back\nWe get you chain, we ain't takin' it back\nReach for my chain, catch a facial for that\nOnly speak on my name when you statin' the facts, please\nI know we ballin' too much\nAnd all of these pretty hoes fallin' for us\nI say, \"Ven aquí mami,\" and call her to us\nIf I give you my number, don't call me too much, comprende?\nCity to city, bad bitches and titties\nShe jump on the jet with me, she on the tour\nI'm in Balenci', Laurent and Givenchy\nMy pockets on Benji and she in Dior\nFlex on the 'Gram just to look like you got it\nBut really you broke (But really you broke)\nSeen suckas pop shit on their Twitter\nLike killers and really get smoked (Really get smoked)\nKnow niggas that used to be trappers on Twitter\nJust tellin', this jokes (Tellin' this jokes)\nWhile we gettin' money, just burnin' this bread\nTryna turn it to toast, for real\nThey say we talk about money too much\nBut maybe they ain't gettin' money enough\nI say, \"Dímelo, papi,\" he come with a truck\nHe gon' make me a tab and I'm runnin' it up, gracias!\n\n[Verse 2: T.I.]\nLet me welcome you, get introduced to the king\nBentleys, Ferraris, brand new and they clean\nSo disappointed when niggas talk shit on their records\nYou see 'em, don't do anything\nOkay, killin' these niggas with more than before\nBeen stuntin' and shinin' since back in the 90's\nI'm 'bout it, forgot the Glock in my pocket\nRemind you and plus the whole city behind me\nSpent hundreds of thousands, no millions on diamonds\nIn Philly, they go ask Meek Milly about me\nI'm solid and thorough, stand up as fuck\nSee these niggas, I just be like, 'What the fuck?'\nAin't no way in hell you can fuck with us\nLike a bad bitch with no furniture, I can't do nothin' with her\nStill hit her and them bad bitches who hung with her\nThat's how I do, ay, can't give you the formula\nDon't stop me now, I'm just warmin' up\nNiggas be actin', the fuck they performin' for\nLeave 'em right there for the coroner\nMan, my bitch look so bad, she a foreigner\nAston Martin, the attire is formal\nHow we kick it, ain't shit 'bout us normal\nWe Grand Hustle, an schemin' and chasin' our dream\nStackin' that paper\nHearin' my raps, you see me, you see what I mean\nDrippin' that flavor\nFuck niggas hatin', don't try me, I split that potato\nThen go sit and eat with the mayor\nSkiin' in Vail, David Chapelle told me\nYou niggas is funny as hell\nRun to the smoke and then runnin' and tell\nOpen the vault, put you under the jail, damn!\n\n[Outro: Female voice & T.I.]\nComo dice Pablo 'Plata O Plomo'?\nAsí es como es\nQue te vaya bien, bitch!\nHey, que pasa, mi amigo\nYou know that nigga?\nAy, tranquilo\nWhat'd he do?\nHahahaha\nAsk him if he got some weed\nYo quiero grande mota\nMan, what'd you just say?\nCómo se dice a lot of weed\n(Yeah) Yeah yo quiero grande mota\nOkay (Huh?)\nCocaina? (Hell yeah)\nMucho (We want that)\nAhahahahaha\nYa dig?", "image": "https://images.genius.com/5a8de714fbcd76f3fee3ca5e9386b395.1000x1000x1.jpg"}], "artist": "T.I."}