{"songs": [{"title": "I Go Off (Freestyle)", "album": "Return of the Dozen Vol. 2", "year": "2011-01-01", "lyrics": "//**NOTE: INCOMPLETE**//\n\n[Intro]\nYeah, Yeah!\n(Bust these niggas man!) Yeah\nI see y'all bitch ass niggas man (Put hand on these niggas)\nGuess what man? We Baaack (For Real)\nOff some freestyle shit man, D12 man\nMan you should see the clip on this bitch man\nMan touch one of these niggas souls man\nIt's for real\n\n[Verse 1: Kuniva]\nNiggas are brave until they cross that gun line\nBust 9s, come through like Jordan in clutch time\nPlay the streets if we have to that we bust rhymes\nAin't enough stabbin' nigga up in the lunch line\nShow stopper, fo-fo popper, so proper\nD-12 criminal operations, no doctor\nLiving...\nSitting high up in the ranks like a booster chair\nWake you up in the morning, ain't no roosters here\nJust a nigga with a gun and mask you should fear!\nWake up bitch!\nI'll hit in the head with a hammer\nFucking mom's is got her doggy style, adjusting the camera\nGoing loco, we tucking the Mac and grabbin' the ratchet\nKnife or a gun, either way will start tragic!\nGo and tell my black pack they don't know what rap is\nBullets hit this quick ...\n...\nAnd you throw my mood swings like women on their menstrum\nTommy gun smoking like an old exhaust pipe\nHeart below zero touch me and you're cross bite\nLet a couple shots break you up and your stop light\nDon't hang up enough to make it to top...\nYou and me is like comparing...\nTalk tough, but wouldn't spill a drink in a bar fight\nDirty Dozen back on that bullshit for real\nDeath to anybody before the clips could seal\n(Bang, Bang)\n\n[Verse 2: Swifty McVay]\nThe Grim Reaper\nWalk streets and apply heater\nThe street sweeper to pop nigga out of their sneakers\nI strangle anybody ya main boss a diva\nI sprinkle and bleaching your cannabis sativa\nThese buck shots can turn your face into a pizza\nLeaving them slump like the Leaning Tower of Pisa\nI treat my heat like a Visa I never leave without it\nI bust heavy metal with steady body countin'\nA scoundrel, dirty rotten, my beat is unforgettable\nThe niggas I fought young are still in the hospital\nI'm conquering the missions that you find impossible\nLike breaking in the woman's locker room with my iPhone\nThe walls of my nostrils are damaged for crushin' Oxycontins\nSniff it, walk up the cops an ask them to lock me up\nI belligerent so fuck cases!\nI'm not the type to conversate with the corpse in my basement\nI’m wasted daily, I BATHE in my drink\nI be ARGUING with my shrink everyday of the week\nNigga's hiding until they face look like taco meat\nAnd nothing change with the shell in my chamber in a (?)\nIt's Genghis Khan slash satan, nuts dangling\nSo heavy that I drag bitches on the pavement\nThey don't say shit!\nI'll saran wrap your family\nI’m lyrically anthrax, I’m passin out Tampax\nThe bitch niggas gotta vendetta ...\nI'm a gorilla, ...\nYou ain't a gangster, you're a lab rat\n...\nAfter I stab them\n\n[Verse 3: Bizarre]\nMass murder without the mass\nA poker night without the cash\nA stripper without a ass\nA slut without a dad\nYou're crazy!\nLive from Saint Louis, Missouri\nTwo murder cases left a hung jury\nThey ban Bizarre from MTV\nJumping on the stage like Lil Mama did to Jay-Z\nWhen I'm gonna get up on stage I'm gonna do a whole song\nYellow thong with a sign saying 'Can we get along?'\nWhen I went to L.A. a hundred niggas tried to jump me\nRocking shoes that put me over the table and tried to fuck me, (aha!)\nKuniva snuffed me, D-12 dumped me\nFuckin' fag go get your ass a piece some company (Fag!)\nFly down sunset, driving real fast\nWatchin' Kim Kardashian gettin' in a sick car crash (Watch out!)\nThat's too fucking bad, someone call her dad\nAnd tell him Reggie Bush is a fag\nRaping little girls, taking all they lunches\nHit them in the face with fuckin' Pacquiáo punches\nA hundred crunches, a hundred lunges\nRound off kick, hit them with a fuckin'...\nBomb shit, bomb quick\nI got the bomb so bitch, I'm the bomb, bitch!\nBomb whips, bomb on Rick (I'm gonna bomb on you)\nBitch you ain't gonna bomb on shit!\nBomb dick, bomb click\nEver since I've been a bomb\nBitch you ain't been the bomb since\nNonsense, stop this shit\nHey, yo yo stop this shit", "image": "https://images.genius.com/78a2dd37bee3129adb21d5fac55f009d.1000x1000x1.jpg"}], "artist": "D12"}