{"songs": [{"title": "Statement on Barneys Controversy", "album": null, "year": null, "lyrics": "This collaboration lives in a place of giving and is about the Foundation. I am not making a dime from this collection; I do not stand to make millions, as falsely reported. I need to make that fact crystal clear. The Shawn Carter Foundation is the beneficiary and the foundation is receiving 25% of all sales from the collaboration, 10% of all sales generated in the store on November 20th and, an additional donation from Barneys. This money is going to help individuals facing socio-economic hardships to help further their education at institutions of higher learning. My idea was born out of creativity and charity… not profit.\n\nI move and speak based on facts and not emotion. I haven’t made any comments because I am waiting on facts and the outcome of a meeting between community leaders and Barneys. Why am I being demonized, denounced and thrown on the cover of a newspaper for not speaking immediately? The negligent, erroneous reports and attacks on my character, intentions, and the spirit of this collaboration have forced me into a statement I didn’t want to make without the full facts. Making a decision prematurely to pull out of this project, wouldn’t hurt Barneys or Shawn Carter, but all the people that stand a chance at higher education. I have been working with my team ever since the situation was brought to my attention to get to the bottom of these incidents and at the same time find a solution that doesn’t harm all those that stand to benefit from this collaboration.\n\nI am against discrimination of any kind, but if I make snap judgements, no matter who it’s towards, aren’t I committing the same sin as someone who profiles? I am no stranger to being profiled and I truly empathize with anyone that has been put in that position. Hopefully this brings forth a dialogue to affect real change. – Shawn “JAY Z” Carter", "image": "https://images.genius.com/bf0f68ee56f29c8542ad805c6419682b.676x676x1.jpg"}], "artist": "JAY-Z"}