{"songs": [{"title": "Happy Birthday", "album": "508-507-2209", "year": "2015-12-02", "lyrics": "[Verse 1]\nDon't you stare me down, you know I'm rude\nWhy the fuck you looking at me like you so confused?\nYou really make me sick my nigga if you only knew\nI swear to God I wish you wasn't born and there was no excuse\nCause I don't want to raise you\nI really fucking hate you\nI wish I ain't have to take you, I ain't trying to educate you\nYo, this really fucking sucks, and your mothers fucking nuts\nI had my whole life figured out, leave it to you to fuck it up\nMan shut the fuck up! What you crying for?\nLooking at me like you love me\nWhat you lying for?\nWhy you want to try me for?\nBlow your fucking candles out\nEnjoy that cake I got you, for your stupid little birthday that everyone's so excited for\nExcept me\nShit I dare you to disrespect me when you grow up\nThat's gonna be the last time you ever swell up\nFuck you thought\nEverything was perfect, now its fucking lost\nAnd its all your fault\nHappy Birthday Nigga\n\n[Chorus]\n(Happy Birthday to you)\n(Happy Birthday to you)\n(Happy Birthday to you)\n\n[Verse 2]\nSometimes I wanna kill myself so I don't have to deal wit' you\nI know it sounds harsh but I'm just being real wit' you\nAnd I ain't looking forward to none of that father shit\nI ain't got time for that type of shit\nAnd your mom ain't gonna like this\nBut we ain't\nShooting no hoops\nFlying kites\nWe ain't riding bikes\nI hope you get your ass beat\nI ain't teaching you how to fight\nI ain't here to kiss you goodnight\nI don't care to give you advice about girls\nI hope you get your heart broken for dear life\nI fucking hate you!...\nAnd I know that its wrong\nSometimes I wanna explain but I don't know where to start\nCause you won't understand even if I told you my thoughts\nCause even when its light\nI feel like i'm alone and its dark\nMy mind keeps racing fast\nI can't bear with this pain I have\nI can't stand you\nAnd I hate the fact that you just a mistake\nAnd that's just what the fuck you was\nEverything was perfect\nNow its fucking lost\nAnd its all your fault\nHappy Birthday Nigga\n\n[Chorus]\n(Happy Birthday to you)\n(Happy Birthday to you)\n(Happy Birthday to you)\n\n[Verse 3]\nShit I wanted to be a father so bad, I would give it all\nJust to have my baby sit in my arms while I'm holding on\nAnd to feel that beautiful feeling of love for my first born\nEven play you the first song, that you hear when you first come\nI loved your fucking mother so much I would give my heart\nTo be down to death do us part\nTill I drown in a fucking pond, till I burn in a blazing building\nApartment fire with bombs\nTill I crash a Mercedes car, by a drunk drive on broad\nWith seven heaters on me\nAnd then she fucking cheated on me\nDrinking with her friends and they didn't wanna leave the party\nGot drunk and had sex, I ain't even see it coming\nAnd then we find out she was pregnant, and she keeping secrets from me\nThis don't make sense and I felt my fucking heart cave in\nThe baby not mine, the paternity test came in\nAnd the love is gone\nEverything was perfect, now its fucking lost\nAnd its all your fault\nHappy Birthday Motherfucker", "image": "https://images.genius.com/97a9da8ce3ad1467f20c1d7bbc241741.630x630x1.jpg"}], "artist": "Joyner Lucas"}