{"songs": [{"title": "The Sneak Attack", "album": "The Sneak Attack", "year": "2001-03-27", "lyrics": "[April S. Williams]\nWe keep it tight.. we keep it right..\nWe're comin strong.. we're movin on.. (yeah)\nIt's time to rise.. and unify..\nKeep comin strong (uh-huh, uh-huh, uh-huh!)\nJust keep movin on..\n\n[KRS-One]\nYo, where's my people at?\nWe be where the elite be at\nWe really never need the gat, we comin with a sneak attack\nIn fact, best believe we back\nWhat we rap it heats the track\nKenny Parker sees to that, my job is to teach these cats\nPresent the clear speech they lack\nAnd show 'em how to eat from rap\n\n[April S. Williams]\nWe keep it tight.. we keep it right.. (that's right)\nWe're comin strong.. (uh-huh, yeah) we're movin on.. (tell 'em again!)\n(Uhh) It's time to rise.. and unify.. (yeah, yeah)\nKeep comin strong (uh-huh, uh-huh, uh-huh!)\nJust keep movin on..\n\n[KRS-One]\nYou know why the devil can't get with me?\nCause he's a liar, I've got victory\nYou can stick with me, my click is free\nNegativity, that doesn't live with me\nThese rappers on one, I've skipped to three\nThese rappers on A, I've skipped to C\nMy image, heads ain't quick to be\nSo I thank you for pickin me\nI know why people got to know, these wack rappers got to go\nLet a MC rock the show\nI'll show 'em how it 'posed to go\nWe forgot simply what we supposed to know\nWe still must defeat the foe\nSo what you got the dough? Your words don't make us glow\nIn fact they make us slow\nHow long this gonna take to know you ain't gotta be a ho?\n\n[April S. Williams]\nWe keep it tight.. we keep it right.. (yeah)\nWe're comin strong.. (yeah, yeah) we're movin on.. (uh-huh)\n(Tell them again!) It's time to rise.. and unify.. (yeah)\nKeep comin strong (uh-huh, uh-huh, uh-huh!)\nJust keep movin on..\n\n[KRS-One]\nLook at the teacher, I stay attuned\nPeople are blessed when I walk in the room\nSnakes(?) don't stop me, and if they did\nThey'd be askin for a tag 'fore they kids\nMedical students lose it when I enter any hospital\nDoctors wanna talk music and whatever's topical\nIt's all logical, I perform the impossible\nThrough words I put hip-hop in you; listen\nHere's what we got to do, unify\nDefeat the flesh, defeat the beast in you and I\nWin or lose I never shout, believe in yourself and never doubt\nDiscipline is simply a better route\n\n[April S. Williams]\nWe keep it tight - we keep it tight\nWe keep it right - we keep it right\nWe're comin strong - comin strong\nWe're movin on - movin on!\nIt's time to rise - it's time to rise\nAnd unify - unifyyyy\nKeep comin strong - comin strong\nJust keep movin on - keep on movin on\nWe keep it tight - we keep it tight\nWe keep it right - we keep it right\nWe're comin strong - we're comin strong\nWe're movin on - movin on!\nIt's time to rise - it's time to rise\nAnd unify - it's time to unify\nKeep comin strong\nJust keep movin on - keep on movin on\n..\nJust keep movin on - keep on movin on\nJust keep movin on - we gotta keep on movin on\nJust keep movin on - wake up and realize\nJust keep movin on - that you just keep movin on\nJust keep movin on - it's time to realize\nJust keep movin on - that you gotta keep movin on\nJust keep movin on - keep movin on, keep movin on\nJust keep movin on - you gotta keep movin on, you gotta take that time\nJust keep movin on - you gotta realize, that it's time\n- keep on movin on, keep on movin on", "image": "https://images.genius.com/756508fbcbfc3c6ac80f412ee6f089bd.1000x1000x1.jpg"}], "artist": "KRS-One"}