{"songs": [{"title": "Panda (Remix)", "album": "Panda (Remix)", "year": "2016-04-17", "lyrics": "[Intro]\nYeah, Joyner\nWoo\nAyo I'm tired of this fucking beat\nAyo, how many of y'all niggas\nHow many of y'all niggas gotta do this beat?\nI'm gonna kill this fucking panda, man\nI'm done\n\n[Chorus 1]\nI'm tired of this fucking panda song\nI don't stand alone\nI just wanna wrap my fucking hands across\nStab the head, and break the fucking panda's jaw\nBurn em up and turn the fucking candles on\nChoke em, beat em, put a couple hammers on em\nDab on a nigga while I'm standing on em\nKick him, punch him, throw him, make him slam the wall\nTie him to a cannon, make him a cannon ball\nInto the ocean, make him suffer too\nNigga this is fucking animal abuse\nAnimal cruelty on the fucking news\nI'mma kill the panda till he bloody too\n\n[Verse 1: Joyner Lucas]\nI'll make him black and blue, fuck the black and white\nI don't fuck with niggas like a pack of dykes\nEat the panda bitch, I got an appetite\nI'm out this world, I swear that I'm a satellite\nHow many rappers gotta try to pay me?\nTired of hearing niggas on the same beat\nTime to kill the panda in my old pajamas, flying to Atlanta in the same week\nWhat's a panda to a fucking polar bear?\nA gorilla to a monkey, tiger to a puppy, lion to a kitten, wolf to a pigeon, shark to a fish and snake to an infant\nAlligator in the water wet\nJoyner Lucas to a dinosaur and pet\nThey ain't know that I'm Tyrannosaurus Rex\nCut the panda up and rip apart his neck\nI ain't doing interviews and autographs\nI don't like the way you talking all of that\nI should fuck your bitch and never call her back\nI'd go down in history as an artifact\nBut...\n\n[Chorus 2]\nI'm tired of this fucking panda song\nI just wanna wrap my fucking hands across\nStab the head, and break the fucking panda's jaw\nBurn em up and turn the fucking candles on\nChoke em, beat em, put a couple hammers on em\nDab on a nigga while I'm standing on em\nKick him, hit him, make him slam the wall\nTie him to a cannon, make a cannon ball\nInto the ocean, make him suffer too\nNigga this is fucking animal abuse\nAnimal cruelty on the fucking news\nI'mma kill the panda till he bloody too\n\n[Verse 2]\nThat's a bloody mess, that's a bloody death\nTell them niggas hating on me, \"suck a dick\"\nI ain't satisfied until I get to smash J-Lo and give her ass a couple kids\nI’ve been on Animal Planet, I got my hands on the phantom\nI kill it again, and nobody gotta hand me a Grammy\nGod damnit I barely don’t even want to hear what they planning\nI sit in a Pana' again and then I blam with the hammer\nThe man with a plan, you looking at the man in the mirror\nThe man with a killer that drill a nigga straight in the building\nI hang with realest, I really wanna handle my business\nI get it, I get it. I gotta get it. Damn it, I did it\nI’m out of this commodity\n‘Bout'a be outta there, hotter than riding inside of a driver seat at Leh and Ladakh\nHow did we get out of them out of a prodigy, nigga\nAll I ever wanted was to hit the lottery, nigga\nAll eyes on me and they gotta be, nigga\nSwear to God, 2Pac could be proud of me nigga\nAll I know is the fire burning inside of me, nigga\nAll I ever could be is real as I gotta be, nigga\nBut why you all wanna act hard?\nWhere I'm from we get it popping in the backyard\nNow everybody wanna run up on the back door\nHalf pussy half bitch, you a cat-dog\nLet me see you do the cat daddy on a black Caddy\nShorty got a fat fattie and flat belly\nAll she do is lap giving if she act petty\nI'll kill a panda, throw that nigga off a balcony for running his mouth to me\nAnd y'all done got me mad\nI'mma put the panda in a body bag\nWhat you doing 'round here? Why you standing 'round?\nWhy you niggas tryna lollygag?\nYou ain't got a life and you proud of that?\nAll you wanna know is where the molly at\nAll you hoes think about is Prada bags\nI done killed the panda, where Desiigner at? (Nigga)\nBut this is not a diss, don't call it that\nI'm just giving all you pandas hepatitis, cancer, HIV and a heart attack\nAll you broke bitches need to call a cab\nCause I ain't (laughs)\nYo, stop rapping over this Goddamn beat cause I ain't too fond of that\nLook\n\n[Chorus 3]\nI'm tired of this fucking panda song\nI don't stand alone\nI just wanna wrap my fucking hands across\nStab the head, and break the fucking panda's jaw\nBurn em up and turn the fucking candles on\nChoke em, beat em, put a couple hammers on em\nDab on a nigga while I'm standing on em like\nLike, like this (brrraaaa)", "image": "https://images.rapgenius.com/789d6597fbfde3f3b4be8a15c0665392.1000x563x1.jpg"}], "artist": "Joyner Lucas"}