{"songs": [{"title": "On Achievement and Creativity", "album": "Kanye West’s Visionary Streams of Consciousness", "year": "2014-07-04", "lyrics": "Don’t let nobody tell you what you can do, what you can believe, what you can achieve. Don’t let nobody but you\n\nYou know, people be looking at me like I got a problem or something. Like I’m uncontrollable or something. Like I don’t do what I’m supposed to do. You know it’s like they want to have everybody so brainwashed. They want to control everybody, you know, rumors, lies, media, marketing. It’s like they want to steal you from you, and sell you back to you after they stole it. They want to make you feel like you less than who you really are\n\nCuz as far as I’m concerned everybody’s a star. See they want to make you feel like you less than you really are. Cuz as far as I’m concerned everybody’s a star\n\nYou know, uh, the first thing they do is crush your dreams. Crush your dreams. Then add a couple drops of low self-esteem. And then I don’t think everything is what it seems. And control you with lies. And control you with lies\n\nYou know Imma tell you something, first thing they do is crush your dreams. Then let’s add a couple, a couple of drops of low esteem. And they control you with lies. And they control you with lies. And they control you with lies. We goin’ out of control tonight. We goin’ out of control tonight. Ahh\n\nHow many people tonight with a show of hands think they are fucking awesome? [Crowd cheers]\n\nNow with a show of hands: How many people tonight have had people tell you your whole life that you wasn’t fucking awesome? [Crowd cheers]\n\nSee this is what I’m talking about.This is what I’m talking about. This is what I’m talking about. I mean, this is what I’m talking about, this is what I’m talking about\n\nHow many people tonight have ever talked to somebody right, that you know they’ll say, I don’t know what’s wrong with Kanye or make it seem like I’m a bad person in some way, right? Now what have I ever done that was so wrong other than believe in myself? Now believing in yourself is so, so, so wrong that the other side is so, so, so, so strong, they’re trying to beat down and demonize and dishumanize — I don’t know if that’s a word or not, but it’s now a word, cuz I said it’s a fucking word — and try to dishumanize people who believe in themselves. Cuz then what happens? Then you believe in yourself. And then you believe in yourself and you believe anything is possible. How many people believe that what they dream about, what y’all want to do, whether you want to be a doctor or lawyer, a designer, a musician, video-game programmer, a lighting guy, a manager … how many people want to contribute something to the world?\n\nYou see, I know you all might have seen some of my interviews and seen me on TV, but what I was saying the whole time is, what I was saying the whole time is, cuz I’m not — [to stagehand] making it lighter, make it lighter, the second, the second light — I’m not particularly angry or anything like that, but what I’m saying is, they taking the idea of celebrity and trying to make me seem I was stupid or something. You know, when I take these meanings and shit, [crowd chants “Kanye”] people they talk to you like you’re stupid or something. And then you look back and say, you know, like I’m not gonna call no names out, I’m not going to mention Nike or nothing like that. I’m not going to say no names or anything\n\nBut if you’re a creative and you want to create, and you just want to create more, this is exactly what I’ve been fighting for. So if you hear me talking about Louis Vuitton or the Gucci Group or anything like that. I’m not dissing Louis Vuitton, I’m not dissing the Gucci Group and shit. I’m just saying, don’t discriminate against me, because I’m a black man or because I’m a celebrity, and tell me that I can create, but not feel. Cuz you know damn well there aren’t no black guys or celebrities making no Louis Vuitton nothing. They let Pharrell make those glasses, and we liked them, right? They let me make those shoes, and we liked them right?\n\nAnd they say, “No, no, no, nigga. Not no more. That’s too much. That’s too much. No, no, no, no, no, no, nigga not no more. That’s way too much. That’s way too much. Stay in your place. Sit in the front of that show and wear this jacket I made you. Stay in your place. Do what you get paid to do. Stay in your place. Don’t embarrass yourself trying to chase your dreams. Save face. Save face.”\n\nThat’s why I got this fucking mask on, cuz I ain’t worried about saving face. Fuck my face! Let’s set ‘em off. Pause. Now they finally got a headline. But fuck whatever my face is supposed to mean! Fuck whatever Kanye is supposed to mean! It’s about my dreams. It’s about everybody’s dreams. It’s about creating. It’s not about the idea of being a fucking celebrity, it’s not about the idea of a black man trying to do fashion and shit. Cuz these walls that I break down, these walls that I break down and we will\n\nAnd I’m arguing with my friend Spike Jonze in the car cuz he said, Kanye, what you need to say is you’re gonna try. You’re gonna try to break them down. Don’t say you’re just going to do it. And I said, I am gonna do it! I told Kim seven years ago, I’m gonna marry you! And I’m telling you right now as I stand on this stage, all this shit that you heard me talking about, I’m gonna come and back all that shit up. You don’t know how hard it was to get the Nikes, that wasn’t my fault. They try to control y’all and try to control me. And when I was in my negotiations, they told me, “We don’t negotiate with celebrities.” That’s like a terrorist. They talk to you like it’s fucking terrorist\n\nYou know, I just want to make something awesome. I just want to be awesome, and I want to hang around my awesome friends and change the fucking world, and that’s exactly what I plan to do. And if you plan to do the same, put your hands in the air right now. If you just want to be awesome and make awesome shit and change the fucking world and this is what you plan to do\n\nLet’s have a toast for the douchebags\n\nSource: Vulture", "image": "https://images.genius.com/9fa6626ebb7cecda3ba692c1c80f52bf.1000x664x1.jpg"}], "artist": "Kanye West"}