{"songs": [{"title": "Nuthin’ But a ‘G’ Thang (Freestyle Remix)", "album": "Death Row Greatest Hits", "year": "1992-11-19", "lyrics": "[Snoop]\nNow I be mobbing like a motherfucker every single day\nMaking funky shit with my nigga Dr. Dre\nThe niggas who talk shit get put on they back\nBy my nigga named Suge and his black for black\nNow check facts for a second, I'm checking my record's dope\nIt's Snoop, he goes for broke, so what's up, Loc?\nYou wanna provoke, try to step, break your neck real quick\nReal fast, blast, I'll outlast and shoot ya, take your cash\nAs I dash with the homies from the Dub\nNow as we fly through the sky getting love\nWe how high, real high, how high, I'm higher than you\nSo whatchu wanna do, whatchu wanna do?\n\n[Interlude: Snoop]\nHa ha, yeah, and you don't stop\nAnd you don't stop\nThis ain't nothing but a motherfucking freestyle worth your while\n(This is for the Dogg Pound, this Daz, the nigga of all niggas!)\n\n[Snoop]\nCheck it out\nBow wow wow yippy yo yippy yay\nThe Dogg Pound's in the motherfuckin' house\nC'mon, bow wow wow yippy yo yippy yay\nThe Dogg Pound's in the motherfuckin' house\nAyo stepping through the front door, stealing the show\nIt's the youngest motherfucker on the hood Death Row\nHe's called Daz, stepping on your ass\nMaking big cash, time to move real fast, blast\nCheck it out, next in line\nIs the diggy diggy DOC dropping funky classical rhymes\nThat shit that just don't hit\nSnoop Dogg and Dre, dropping funky manuscripts\nMy lip hits the microphone\nBreaks you, shakes you, takes you, awakes you\nKurupt the Kingpin of killing is straight chillin'\nStep into the house and start revealing your skills\nChill, do you need the microphone\nOr do you need some help to drop some shit like stones?\nAl Capone was a hero of mine\nI shot plenty niggas and cops so fuck one-time\nI'm, the irrelevant, intelligent\nBrother from the hood that they call Long Beach\nEastside where the brothers ride, slide\nSlippidy slide, the Eastside's got pride\nHere we go, stole the show as I flow\nI gots to give the microphone to my homie on the Row\nHis name's Kurupt, he fucks it up\nOn Crenshaw and Slauson, so commence to flossing\n\n[Kurupt]\nWhen I step I come straight from the under\nLyrical rhymes will flex, but yo, here's my cover\nKingpin, murderer, etcetera, I flex\nWhen I flow I let 'em know that I'm quick to snap necks\nCheck me out, one two, don't disrespect (Boom)\nThe way I flow I go and show you'll get chin checked\nAnd if you ever feel you got the wrath, what can you say?\nSpray the AK, produced by Dr. Dre\nMy niggy niggy nigga by the name of D.O.C\nMy homie Snoop Dogg and Daz is next to me\nThe D-A to the Z, the D-R to the E\nAnd when we like to flex down with the S-H-U-G\nI break 'em off when I flow I go and now they know\nThe Row will kill with skills, I'm real for real\nAnd caps I peel from my steel\nSo nigga, you figure that you're bigger, and pass\nI'll whip your ass, it's a classical rhyme from Daz\n\n[Daz]\nYo, I bust through the hood, I bust through the fog\nMy nigga D-O-G, um, Doggy Dogg, but if they play\nBut if they wanted to say \"Pow Pow!\" goes another\nHit from my um nigga Dr. Dre\nThe Chronic, which they get up on it\nAs the niggas be saying that it's ahhhhhh, bionic\nBut I'm trying to go as I play and then I say\nNever underestimate the nigga Dr. Dre... (fades out)", "image": "https://images.genius.com/f861efbb96dd844d8cb6f719fef7dd5d.332x300x1.jpg"}], "artist": "Dr. Dre"}