{"songs": [{"title": "What She Gonna Do?", "album": "Married to the Game", "year": "2003-10-21", "lyrics": "[Too $hort]\nIt's just a little mo' game (ye-yeah ye-yeah)\nYou might need to learn some (make me say ohh)\nListen and learn (Yeahh-yeahhhhh)\n\n[Verse One]\nShe's all about that get rich\nTreat a nigga like the lotto, he's a quick pick\n... it's nothin to a boss bitch\nWhat happened to his cash flow?  He lost it\nShe don't give a fuck about none of you guys\nShe make you look so bad, I bet you want a disguise\nI knew the day and time would come\nWhen she went out in the world and had to find her one\nHe sponsors all her daily, activities\nI'm not her pimp, she don't pay me or give me fees\nI just laced her with the game, so she could shake those lames\nAnd try to take her change, I told her make yo' name\nAnd turn the tables on 'em, I call her DJ Break-a-Trick\nCause all your money she'll be takin it\nPut her on the pedestal, your queen on the throne\nAnd she's still gon' bring the money home\n\n[Hook: Too $hort]\n(Make me say ohh) What she gon' do?\n(Ye-yeah ye-yeah) What she gon' do?\n(Make me say ohh) What she gon' do?\nPlayers better ask a bitch - bitch whatchu gon' do?\n(I'll be the one to come runnin - be the one to come runnin)\n(Ohh, home to you.. home to you)\n(You're givin me - loooooooooooove, with a nigga like you)\n(It's no need to play around, ohhhhhhh)\n(You're more than just big pimpin)\n(You're blowin my mind with the love that you're givin)\n(That's what you'll hear me say, boy every dayyyyyyyy)\n\n[Verse Two]\nI knew she had potential, to be a real player\nGet paid up the ass by a millionaire\nShe ain't tradin sex, like these broke hoes\nHer shit is worldwide, these bitches loco\nShe took the show on the road, for the fun and the thrills\nNow it's nothin but hundred dollar bills\nShe got a lot of G's, spend 'em how you please\nAll you broke-ass hoes, get up off yo' knees\nDon't go to Ho College if you want some mo' knowledge\nCause bitches graduate and end up with fo' dollars\nYou can be a hustler, and never be a baller\nHe tried to bread her up whenever he would call her\nBut the bitch was too dumb, to ask for a thang\nI try to teach 'em when they young, so they don't pass on the game\nAnd when you get your thang on\nRemember where you got your game and where you came from\n\n[Hook]\n\n[Verse Three]\nIt's obvious, we don't come from the same world\nBut you still fell in love with the game girl\nNow you're, dedicated since you elevated\nAnd you, you never hated, just celebrated\nYou can't play with the game, you gotta go get it\nIt's fire - stop drop and then roll with it\nLet a baller finance your brand new car\nAnd if he can't do more, you better kick him out the door pimpin\nTell him how you like diamond rings\nSo fine, that's why he wanna buy you things\nNow you spendin and shoppin, like you playin a sport\nCause you listened to the game that you got from Uncle $hort\nI'm proud of you - what you grown to be\nDon't tell him nothin - you always belong to me\nYou can travel the world and get your stack on\nJust don't be broke when you come back home\n\n[Hook] - to fade", "image": "https://images.genius.com/ed8e96dec66a7ff4b3234c0368a7f843.1000x1000x1.jpg"}], "artist": "Too $hort"}