{"songs": [{"title": "Back at You", "album": "Sunset Park (Soundtrack) ", "year": "1996-04-23", "lyrics": "[Intro: Havoc]\nNo doubt\n\n[Verse 1: Havoc]\nAshes to ashes, dust to dust\nStainless steel gats, they never rust, fit to bust\nYou get touched, blessed with the real side of life\nJust enough, you couldn't fight it with your strongest mic\nLaid down nigga eyes, visualize bad reception\nMajor interference shoot your upper body section\nI travel like a two-two bullet, throughout your body\nRepped to the fullest, Queensbridge representin'\nPresentin', the hollow tip crew\nLoose lips sink ships, you talk shit I follow through\nOnce the kite is sent, I might get bent but still planted\nNo second thoughts, 'cause my conscience is demandin'\nFor the bloodshed (bloodshed), I leave that mug red (mug red)\nI'm like cancer can't catch me cause I done spread (done spread)\nDoorknob dead, enough said from the scene I fled\nWith the paranoid thoughts runnin' round my head\nIt's like that, war, project niggas strike back\nIt's on, what the fuck you said? I'll be right back\nWith the gat, and temper, end your motherfuckin' era\nYour shorty set you up you better dead her\nHunger for the cheddar, big Benz or better\nArmeretto sours, alcohol assumption\nWhile you, runnin' we thumpin'\nDue to the fact The Infamous is bumpin'\nIce grill, son you frontin'\n\n[Chorus: Mobb Deep]\nIt's like that, war, project niggas strike back\nIt's on - what the fuck you said? I'll be right back\nIt's like that, war, project niggas strike back\nIt's on - what the fuck you said I'll be right back\nIt's like that, war, project niggas strike back\nIt's on - what the fuck you said I'll be right back\nIt's like that, war, project niggas strike back\nIt's on - what the fuck you said I'll be right back\n\n[Verse 2: Prodigy]\nWelcome to the fact that, here take that\nRight back at you, I'm goin at Duke, already ran through\nWasn't hard to capture, what is it that your goin' after?\n(What is it what is it?) My forty-fifth'll make your clothes damper\nPut in the hamper, the fabulous Infamous movin' stainless\nCrimes heinous, to all my niggas hold your bangers\nLive in action, if you were dapped then relax then\nThe fuck you said? I'll be right back with MACs then\nBlastin', tearin' up your Fila fashion\nGive him what he askin', fill you in on what happened\nBack at the cabin, be at the round table plannin'\nTo spread team across planet, expand shit\nSlap a nigga open handedly style, somethin' foul\nFor tryin' to slow down, my cash pile a hundred miles (so what)\nI can recall the days, juvenile crime pays\nFourteen years old, shorty from round way\nBrick-ass cold, still pump from night to day\nBut why did my life have to be this way?\nI rock Velour suits, flavors like mixed fruits\nMy loot give recoup, razors in my shoe\n'Case they try to troop me to the Island\nI'm known for start whylin'\nBack in New York, my soldiers got the cash pildin'\nPeep this, throwin' blows on some nose and teeth shit\nSo much drama, who the fuck knows we got beef with?\nLift you up off your feet like ski lift\nPull back the big fifth for niggas who riff, them niggas you with\nThen I'm on the next flight, gettin' bent in the clouds\nOn my way down South for international crowds\n\n[Interlude: Prodigy]\nWord up, word up son, we gotta get this motherfuckin' money kid\nKnahmsayin? What up kid? Fuck that son\n\n[Chorus &  Prodigy  ]\nIt's like that, war, project niggas strike back\nIt's on - what the fuck you said? I'll be right back\nIt's like that, war, project niggas strike back (fuck that, yo)\nIt's on - what the fuck you said? I'll be right back (word to mother yo)\nIt's like that, war, project niggas strike back (infamous, nigga)\nIt's on - what the fuck you said? I'll be right back (infamous)\n\n[Outro: Prodigy]\nBlack Mac word up, word up, yo the maxin', pump relaxin'\nCheck it out son, word up, project niggas strike Back", "image": "https://images.genius.com/9a6318eb2b4c4b2291ba23d1d9b64857.762x762x1.jpg"}], "artist": "Mobb Deep"}