{"songs": [{"title": "Redman Meets Reggie Noble", "album": "Whut? Thee Album", "year": "1992-09-22", "lyrics": ">[REGGIE NOBLE]: RRRRAHHHHH! LOOK OUT!\nYOU MUST HAVE GOT HIT WITH SOME BULLSHIT\n[REDMAN]: Yo, where at?\n> SMACK DEAD ACROSS YOUR LIPS\nCAN YOU TALK?\nAhm ahh ill uhh ahm no em no menna no vat\n>YO-YE-YO REDMAN, WHAT THE FUCK WAS THAT?\nI don't know but it's on my top lip\nDon't crack jokes, or pop shit\nJust get it off my top lip\nOr Reggie, you'll get drop-kicked\n>OAH-OK BE STILL, CHILL, I'M GETTIN' IT OFF YOUR GRILL\n>SOME OF THAT PUSSY YOU AT THIS MORNING FROM THAT BITCH JILL\n>BUT COME ON, CHECK IT\n>LET'S GET BUSY ON THIS RECORD\n>SO WE CAN MAKE THE DOUGH\n>AND MAKE GIRLS LIKE KIKI SHEPARD GET NAKED\nOn the strength!\n>PARTY WITH MACHINE AND OPRAH WINF'\n>FIRST CLASS TICKETS, HOTEL BITCHES PUFFIN' MAD BLUNTS\nBlunts?\n>BLUNTS\nBlunts don't don't rhyme with Oprah Winf', chump\n>WHO CARES WHAT RHYMES WITH IT LONG AS THE FUNK PUMP THROUGH MY BENZ TRUCK\nNow you know you don't own a Benz\n>YES I DO, AND CHROME'S THE TRIM\n>BLACK WITH A SYSTEM\n>WHEN IT'S HITTIN' I'M PULLIN' MAD SKINS\n>WITH OLD E SITTIN' IN BETWEEN MY LAP\n>AND WHEN BROTHERS ACT UP, A GUN MACHINE I PACK\n>THE ORIGINAL P-FUNKER, THE JEWEL TRUNK, A FUNKER\n>WHEN I'M SEXIN', MY BAT IS BIGGER THAN EDDIE MUNSTER'S\n>LIKE MAXIN'\nWait wait wait, could we get on with the tape?\nLights, camera, hahh, action\n>WELCOME TO RED'S TAPE, MAY I TAKE YOUR ORDER?\nIt's a slaughter if you order the hit without the water\nAnd if swallowed without the damn water to follow\nYou might be doin' a stupid dance and win a grand at the Apollo\nI'm rough, snap necks, drink Olde E, but crack Beck's\nWreck anything that's wet, when I have sex\nFor instance, I mix with, a style that make you shit bricks\nTsk tsk, I'm musically gifted, terrific\nBoom-shaka-lak, Red got crazy knots\nAnd knots in the pots, got props from here to George Washington Bridge\nI get biz, I use hats, so no kids\nFuck, I took out more suckers, than a...\n>WAIT WAIT, HOLD UP! I DON'T THINK I CAN FREAK THE FUNK LIKE THAT\n>I MIGHT HAVE TO MACK, BECAUSE MY AFRO IS LIKE SHAFT\nPuffy, fade it quite lovely and to snuff me\nGet your gang, 'cause I'm Fightin' with more Power than Chuck D\n>CHUCK D, FROM PUBLIC ENEMY?\nYeah, he's a friend of me\n>THE ONE THAT SAY \"BROTHER AND SISTERS?!\"\nYeah, but he's no kin to me\nI'm strictly negro, I freak the style and there it goes (BOOM!)\nIf a stitch in time saves nine, then I got shit sewed\n>>>PUT PINS IN NEEDLES, AND NEEDLES IN PINS\n>>>A HAPPY MAN IS A HAPPY MAN, THAT, WHEN I'M HITTIN' SKINS\nFuck skins, I'm hittin' puss' when it's douched\nThen eat it when the puss' is well cooked\nLOOK!\nUp in the air?\n>NO THE CAB\nWho's in the cab? Whut The...??!!\nIt's Superman!! (WHY?)\nBecause it's hot as a motherfucker out here\n\n>OH WORD, YO RED, I'M GETTIN' THE FUCK OUT OF HERE, MAN\nYeah me too\n>OH, I FORGOT TO TELL YOU, WILLIA CALLED FOR YOU\nWillia who?\n>WILLIA SUCK MY DIIIIICK! {​laughing}​\nAiyyo fuck you! Big nose bitch!\nI hate your stupid ass. You a stupid motherfucker!", "image": "https://images.genius.com/851b0a63d63f6c8548a17f295b615296.1000x991x1.jpg"}], "artist": "Redman"}