{"songs": [{"title": "Pink Cookies In a Plastic Bag Getting Crushed by Buildings", "album": "14 Shots to the Dome", "year": "1993-03-30", "lyrics": "[Intro]\nThe act of makin' love is\n\n[Hook]\nPink cookies in a plastic bag, gettin' crushed by buildings\nPink cookies in a plastic bag, gettin' crushed by buildings\n\n[Verse 1]\nI'll take thirty electric chairs and put 'em in a classroom\nThirty MC's and set 'em free from their doom\nJust like a tomahawk cuts through the wind when we begin\nThe wheel of fortune, it spins\nHoldin', the rhythm like elastic moldin'\nYour whole body like plastic\nSo why try to deny what you already know ya love\nUp above\nCause the mania, hysteria in the streets\nWhile ya lovers gettin' merrier in the sheets\nI met this lady named sweet young thing and\nShe gave me that feelin' that sunshine bring in\nHoardable, sportable, totally affordable\nSilky smooth, voice was real audible\nI said your cool as Ice Cube-a\nShe said, \"you're that Public Enemy I seen on the tube-a.\"\nNah, I'm like your Uncle, baby\nThe style of your beautiful face drives me crazy\nWell can we do ya so Heavy, I'm D?\nShe said, \"You tried to play me like Big Daddy\"\nI said, \"I know your Tribe I Called and re-Quested\nFor you to be manifested\"\nShe said, \"You know the Same Gang and my Flava Unit too?\"\nI said, \"You only knew the certain things I wanna do, do you?\"\nRub ya down with warm Ice-T\nMake ya feel Brand Nubian instantly\nBoogie Down and check this Production\nGimme them lips, they look good for suction\nShe said, \"Sweet Tee's cool with a little almond joy\nOn the side just doin' the fly\"\nYou like pound cake? Come to my house\nTurn on the lights and see me on the couch\nI said, \"You're jinglin', you're from around the way\nI like your earrings: two L's, but anyway...\nYour grand-daddy is here to spread cheer\nSomethin' nice and smooth with my tongue in your ear\nGive me a snack some salt and pepper on a burger\nIce Cream Tea or if you prefer the\nTaste of honey Kid, ride in my Capri and\nThat's the joint they got the real clear CD in\nShe said, \"Stars couldn't get me in a car\nI don't know what type of man ya are\nYou might know karate, do me and get away\nI got a glimpse of your license plate, N-W-A\"\n\n[Hook]\nPink cookies in a plastic bag, gettin' crushed by buildings\nPink cookies in a plastic bag, gettin' crushed by buildings\nPink cookies in a plastic bag, gettin' crushed by buildings\nPink cookies in a plastic bag, gettin' crushed by buildings\n\n[Verse 2]\nShe was chubby and ready to rock and Naughty By Nature and\nPart of my private stock and\nRidin' in the relax\nFrame of mind and\nHmm...\nHammer time'\nIncredible\nSo edible\nAnd unforgettable\nSoft like a Q-Tip, I'd love to get with you\nCause I'm the type of guy that got props due\nFeel it in mo and more\n(Flushing) Ugh...\nWhen I get ready for a showcase\nPut together well\nI go deep and have an oil well, show and tell\nI said, \"Yo-Yo! You're so intelligent\nAnd elegant.\"\nI neh never Run to be D with another MC\nI got what I want right in front of me\nI know a kid named K, he's a MD\nLast time I heard Yo, was gettin' real friendly\nBelly to belly and chest to chest\nThigh by thigh, leg by leg and I guess\nAin't no way to get ya out\nYour so caught up S-E-X-U-A-L - sort\nOf a freaky situation with a peppermint twist\nRicky or Mike is next on the list\nNastified and all-funkified\nCome on, come on, come on, ride\nCan you hear?\nNever fear\nWhat ya hear\nWhat ya hear\nIs it clear?\nUnderstand\nAnd love ya big dear\nAnd I will appear\nMy dear\nWith a beer\nAnd bags full of cheer\nAnd waterbed... YEAH!\nCause I rumble and groan\nShe said, \"You got to be bad to make the Monie moan.\"\nAin't no reason to front\nOn the way your life shown\nBooyaa! How I'm jumpin' your bones\nLike a Grandmaster in a Flash\nPut out your cigarette and rest your tired ash\nAll I wanna do is make whoopie\nYour my pink cookie\nNot a wookie\nWhen you take it off, I'd love a lookie\nCause I'mma mix it up toss style\nPeace out, you got the sexual profile\n\n[Hook]\nPink cookies in a plastic bag, gettin' crushed by buildings\nPink cookies in a plastic bag, gettin' crushed by buildings\nPink cookies in a plastic bag, gettin' crushed by buildings\nPink cookies in a plastic bag, gettin' crushed by buildings", "image": "https://images.genius.com/e280045bd851825ad1c5570d3eb2a6f6.999x999x1.jpg"}], "artist": "LL Cool J"}