{"songs": [{"title": "Love Song", "album": "Finally Famous Vol. 3: BIG", "year": "2010-08-31", "lyrics": "[Verse 1: Suai]\nTrying to write a love song\nI wanted it to be just right\nTried to make it beautiful\nBut all I can think about is our last fight\nI was gonna play it on piano\nHad the drums come in real bold\nBut I couldn't think of anything good to say\nSo the big ballad strings will never get played\nPretty melody I wrote will never get sang\nPiece of paper that I started with got thrown away\nA song about our love will never see the light of day\nWhy? cause you made it that way\nYea you made it that way\n\n[Hook:]\nI was gonna write you a love song\nBut you screwed it all up\nPlaying games now you're just\nA lame who's shit out of luck\nI almost wrote you a love song\n\n[Verse 2: Big Sean]\n(Crazy ass bitch)\nShe threw my watch out the window\nChain in her hand\nShe running through the crib\nFinding anything she can\nOur relationship is not the only thing that's out of hand\nShe even called my momma like\n'you need to get your man\nCause your son lying on me\nI ain't trying to get a tan\nAnd this the last time he'll have me crying in my hands\nSo I'm heading to the club trying to find a man'\nBitch you headed to the club trying to find a man?\nWhat is you saying?\nHoes and passionate night gowns\nBut you the only one I imagined in white gowns\nSo with your left hand you should let me add a ring to it\nSince mr and mrs anderson just has a ring to it\nShe like 'why you act like that to me?\nThen walk right back, mike jack to me?\nEverytime we fall out I throw your ass out'\nBut you just end up boomeranging right back to me\n\n[Hook]\n\n[Verse 3: Big Sean]\nI think you crazy, crazy\nYou need medication\nYou should calm down\nYou need meditation\nSending me a text with a hundred exclamations\nAbout how I'm wrong without any explanation at a ll\nBefore you say another nigga next up\nI should call the maid down cause I messed up\nI gave you what you need\nEven on those shopping sprees\nI would throw you paper like extra extra (read all about it)\nShe said 'what if we reverse roles\nAnd you was front row cheering at my first show\nAnd a couple dollars later and some Louis vuitton clothes\nI could fuck a couple niggas thinkin that you said I know\nAnd since I had no feelings for them then it shouldn't hurt yours\nAnd since you thought id never do it, it even hurt more\nAnd I would lie about it but you found out from a source\nWhos word was more truthful than yours'\n\n[Verse 4: Suai]\nI'm so glad I didn't ever pen it\nNow you ain't got nothing with your stupid name in it\nAnd if I would've did it I probably would've stay with you\nListening to the lies you were constantly telling\nYou did me all wrong\nWhat would even make me wanna write you a song\nSo glad I moved on\nCause now I gotta new guy that's turning me on\nAnd the big ballad strings about to get played\nPretty melody I wrote about to get sang\nA song about his love is gonna see the light of day\nWhy? cause you made it that way\nYea you made it that way\n\n[Hook]", "image": "https://images.genius.com/77c8c4775e5c1d31fe5ab3d65845291d.500x500x1.jpg"}], "artist": "Big Sean"}