{"songs": [{"title": "Thank You", "album": "Full Circle", "year": "2006-12-11", "lyrics": "[Xzibit] Yo, listen, huh\n\n[Hook: Xzibit]\nI just wanna thank you, for bein around\nAnd patiently waitin and holdin me down\nIt's easy to see, for Mr. X to the Z\nThat without no you, there could be no me\nI just wanna thank you, for bein a fan\nAnd watchin me grow from a boy to a man\nIt's easy to see, for Mr. X to the Z\nThat without no you, there could be no me\n\n[Xzibit]\nYou 'bout to hear some words, that you ain't probably heard\nWith all of these rappers pullin' triggers and flippin' birds\nI know it sound absurd, cause they don't tell the truth\nThey prostitutes, fuckin' contaminate the youth\nBut yet I'm guilty of, the things I said above\nNo matter my faults still continue to show me love\nNaw I ain't perfect mayne, but yet I stay the same\nI play chess not checkers but this is not a game\nAnd this is not a song, and this is not a verse\nIt's not conceived, or simulated or been rehearsed\nSpent the first half of my life, thinkin that I was cursed\nCould have been hit with a hollow, follow behind my hearse\nThat wasn't meant for me, I spent a decade\nMakin it what it's 'sposed to be, hopefully brought you close to me\nAll these people approachin me, don't even know the half\nI could be facin life but X is signin autographs, damn\n\n[Hook]\n\n[Xzibit]\nMy son's 11 now, I got to see him grow\nMakin his free throws, the way he laughin at the show\nYo he remind me of me, when I was ridin bikes\nHe gon' be taller than me, he got my mother's height\nBut yo you know the difference, between me and them others\nThey say you buggin when I call you my sisters and brothers\nI coulda missed it all, I coulda dropped the ball\nMind of Metallica, motherfuck 'em and \"Kill 'Em All\"\nI used to hustle raw, I used to run the streets\nI used to hustle heats, I grinded all my beef\nMost of my homies is gone, restin in peace\nSome'll never see release from custody of police, but me\nBut nah my little dude get to go to private school\nAnd I can do the things my father couldn't afford to do\nThat's what it's 'sposed to do, this is from me to you\nSupport from you and yours, thank you for gettin me through, true\n\n[Hook]\n\n[Xzibit]\nWe buried Proof today, it really broke me up\nTo see my brother in that casket, maaan what the fuck?\nMedia made me angry, I had to soak it up\nThe future is fragile never promised to none of us\nHittin so close to home, but what I focused on\nIs how he lived, the lives he touched, the cornerstone\nWe never walk alone, although sometime it seems\nThat nightmares go hand in hand with livin out dreams\nSo let me take this time, from my struggle my grind\nTo let you know that I appreciate you by my side\nIt's been a long ride, a lot of long nights\nA lot of long flights, worth every sacrifice\nA soldier of fortune fearless fightin the good fight\nI never had a plan B, I never lost sight\nThat's why I hit the stage, that's why I kill the mic\nIt's for my fans that's ridin with Xzibit for life, RIGHT!\n\n[Hook]\n\n[Outro]\nThank you, for lettin me breathe\nFor lettin me be who I am, huh, yeah, huh\nTwo little words, y'all never get to hear enough\nKnahmsayin? Yeah that, hehe..\nYes.. the return\nUh-huh.. breathe!", "image": "https://images.genius.com/9bc78de515a998eed4e40863e21c20b6.1000x1000x1.jpg"}], "artist": "Xzibit"}