{"songs": [{"title": "Calm Down", "album": "Calm Down: The Clash EP", "year": "2014-07-01", "lyrics": "[Intro: Busta Rhymes]\nTurn my mic up\nTurn my mic up\n\n[Hook: Busta Rhymes]\n(Ready on the right) Ayo, calm down, nigga\n(Ready on the left) Ayo, calm down, nigga\n(Ready on the right) Ayo, calm down, nigga\n(Ready on the left) Fuck it, blackout, niggas!\n\n[Verse 1: Busta Rhymes]\nOh, my Lord! Lower the casket down (Down!)\nSprinkle the ash, or get your ass kicked, pow! (Pow!)\nFrown while I shit on your crown, skip town (Town!)\nGround zero, Shapiro the king cash cow (Cow!)\nDo I make 'em say \"Wow!\"? Strip! (Ow!)\nBow! I sit with the pound, Click, (Blow!) Blow!\nClick, click, (Blow!) Click, (Blow!)\nStop traffic, dropping them classics, flip now\nBitches, I’m making them skip with thou\nArt, you don’t really want start, when I growl\n(Rawr, rawr, rawr!)\nLet me come and mop up the knockoffs​\nWhen I pop off and never stop, 'cause\nWhen we do come through, you better lock doors (Pause!)\nThe wolves wanna eat, peep how they lock jaws\nNo need to cook up the coke, you see we cop raw\nAnd if you ain’t had enough—\nWhat—in the fat fishes of a phenomenal\nFahrvergnügen fuck—is going on?\nBack with the B.A Baracus, callous bang, on another song\nI’mma have these niggas nervous\nAnd clipping they nails and dribbling\nAnd witness them, nibble them, like sunflower seed shells\nSee these scales, got my weight up heavy, like three whales\nAnd I shit on these males, till it's stinkin'\nFouler, than a weed smell,nigga, your tree fell\nSee how they Twitter, Facebook and Instagramming an email?\nTalking I'm sick, I got them shook and I bang 'em at retail\nUntil they cripple, see I cook, like I’m slanging a weed sale\nUntil I triple bread, and whoop ‘em and drag 'em, like females (Sfu-ahe! Gasp!) Oh, see well, these niggas already know\nThe way that I fuck shit up, minus the details, the case is shut\nYour bitch remind me of replacement butt\nKind of an ancient slut, it's going down\nLike she was a basement fuck\nSwell up this shit, like I’m sticking steaks in they gut\nSo gracefully and graciously, I painfully wake niggas up\nRagdolling these niggas, and attacking\nLike apes in the cut, I’m waiting for the taking\nWhile I break niggas neck, like a bracelet (fuck!)\nIt’s kinda like, me having a case in the truck\nAnd drinking ‘til I’m blasted\nHarassing and erase a nigga (What!?)\nKeeping 'em open and blacking until I’m leaving ‘em stuck\nAnd got ‘em happier, than a child in a park chasing a duck\nWhile I’m chasing a buck\nThese funny niggas be chasing they luck\nI be lacing them up, like boots\nWhen I’m pushing they face in the mud—\n(Ahgah!) Missiles I fling, while I spit live wire\n‘Til this shit circling back around\nWith more fire for me to melt a brick surfacing back a sound\nWhile I light up shit that'll cause a quick worship\nAnd gather around, it's certain this shit'll splatter cliques\nPainful and make ‘em scatter (Blink!)\nShameful, the way I shatter (Split!)\nShit apart, it doesn't matter (Rip!)\nYour head up off your shoulders (With)\nBullets bigger, than a boulder\nAnd they break ‘em and they know it's (Classic!)\nAnd the way it’s going, you could easily get your (ass-kicked)\nSee, me and Shady together; we’re crazy\nLike baking a vomit and rabies cake, like a pastry bitch\n(We that sick!) like I come from Haiti\nI’m suggesting you pay me, don’t make me wanna spaz\n(Al-la-la!) Like I’m a crazy Israeli (Bastards!)\nWhile I bite the beat up, and I'm starting to heat up (Yack!)\nI’m chopping your foot off\nNow it’s mine, and I’m putting my feet up (Black!)\nBack to the hood and off to the wild\nAnd I’m hoping you protect your child\nAnd I been blacking out so long\nNiggas is asking if the hook had died, nah\nBut the beat is fried!\n\n[Hook: Busta Rhymes + Sample]\nYo\n(Ready on the right) Ayo, calm down, nigga\n(Ready on the left) Ayo, calm down, nigga\n(Ready on-)\n(\"Yo, chill, man—chill!\")\n(Ready on the right) Ayo, calm down, nigga\n(Ready on the left) Ayo, calm down, nigga\n(Ready on the right) Ayo, calm down, nigga\n(Ready on the left) Fuck it, blackout, niggas!\n\n[Verse 2: Eminem]\nApparently, there's a light contagiousness to this tirade\nIt just might make you sick, so irate\nWith this my brain is just like a fucking fried egg\nIs my mind scrambled? 'Cause I'm lit—narrow minded\nBut go through such a wide range of this emotion\nThat my rage has gotta squeeze through it sideways\nI just pulled up, in Clive Davis's driveway\nWith his personal memoir, saying \"He's bi!\"\nWaving a nine, a picket sign, egging his ride\nMaking him cry, \"Rape!\"—then arrive naked\nAnd drive straight through the gay pride parade\n\"Yay! Yippee-Ki-Yay!\", 'cause here I—\nWait, did the world just pee on my leg?\nAnd should I take it as a sign\nMaybe to take 'em back into time? (Shady!)\nI stuck out like a sore thumb, so I gave 'em the finger\nTo take the attention away\nFrom my stinking face it was bringing\nChanged the whole complexion of the game\nBut just in case you was thinking an inkling of replacing\nThe kingpin of crazy, you're wasting your ink then\nSo if this is any indication, of what you may be facing\nYou better make a distinction, 'cause you fake imitations\nAre leaving a bad taste, fuck making a bad impression\nThat's the worst impersonation I've ever seen\nWho raps nasally? Eyes hazely?\nRhymes crazily, but sounds like he may\nNeed some Flonase when he's speaking?\nWhat kind of stupid question is that?\n\"Hey, Mrs. Abraham Lincoln!\nOther than your husband's fucking brains that were leaking\nHow'd you think that play was this weekend?\"\nYou ain't the real Slim Shady, sit your ass down, faggot\nSee me on a ballot, I'm running for class clown\nRich Democrat bitch, so I'm just the candidate\nTo come fuck up the whole party\nMe and Flipmode starting a campaign\nTo have every campus, on a fucking rampage\nAct my goddamn age? I am—eight!\nSo let's get smashed and wake up the next day\nWith the room trashed, covered in Band-Aids\nGlass ashtray smashed\nChampagne splashed on the lampshades\nBut this ain't up for debate, this is undebatable\nShady for president ho, don't make me go take it back\nTo the days of old, with Sway & Tech radio\nWhen I was taking so much NoDoz and LSD\nI almost fell asleep on the Wake Up Show\nFuck you telling me, fools?\nI was rippin' shop, raisin' hell up in Drew's\nWhen Penelope Cruz was still developing boobs\nMe and Bus put it down, like a sick pet\nYou're fucking with vets, dog, fucking internet bloggers\n\"I sit in front of my computer all day\nAnd comment on everything, I'm an expert on everything, Everything sucks—play the next song!\"\nGuess if I hopped out your freaking laptop, you idiot prick\nWith Biggie and kicked the living shit out you, I'd be dead wrong\nSon of God; I'm the S.O.G\nLike a wet log, pores never get clogged\n'Cause I'm so full of self-esteem, that I sweat fog\nYes, yes, y’all (Wah!)—steady on the left, y’all\nStep off, 'fore you get stepped on\nSoft? 'Bout as commercial as my fucking Learjet\nJealousy’ll get you green as a Chia Pet\nI can see that you’re visibly upset, dog\nAlert, alert, girl—alert\nOnce you enter in my house of pain, you're in a world of hurt\nSo (\"Jump around! Jump! Jump!\")\nGet that ass shaking (\"Jump around! Jump!\")\nCame to hit you, with a fan favorite\nBut if you too fly for coach better get them arms\nAnd freaking hands flailing and (\"Jump!\")\nLike Van Halen and pray for a damn tailwind\nMore afraid of success, than I am of failure\nSo what does that tell ya?\nThat on a grand scale, I don’t give a fuck about nothing\nLike Stan mailing his last piece of fan mail\nBefore he ran straight into the damn railing\n\n[Outro: Sample]\n\"Yo, chill, man—chill!\"\n\n[Produced by Scoop DeVille]", "image": "https://images.genius.com/a2b432c2f6c35eb41ac44513c8d3337b.1000x1000x1.jpg"}], "artist": "Busta Rhymes"}