{"songs": [{"title": "Kill ’Em Part 2", "album": "The Bar Exam 2", "year": "2008-09-20", "lyrics": "\"It's killin' me\"\nPlease be clear. This is an invasion\nGreen Lantern in the lab\nThe invasion. The Bar Exam 2\n\"Green Lantern\"\n\n[Kid Vishis]\nLast of the spitters\nHall of dope niggas from the past to present is saying, \"Next is Vishis\"\nI'm, one of the illest, the realest feel it\nCompetition isn't existence because I got venomous diction\nYou should toss your mic is my advice\nYou expect me to be scary cause you talkin' hype?\nI'm like, how you gonna pump me up with no shottie then\nHow you gonna fist fight Floyd when you Gotti ?\nI'm the nice right hand Ruger specialist\nTurn 'em into twins and I'll appear ambidextrous\nSimultaneous, back and forth trigger movements\nHe bleeding profusely\nI've executed my execution\nI got knowledge but I like violence and loot\nType to go to college\nNot to learn, just to shoot a student\nKid Vishis\nNothin' fictitious\nTalked your bitch into believing my seed is nutritious\n(Delicious ha ha ha)\nYep, then you went and kissed her like it don't matter\nShe went and swallowed my baby batter\nYou sick!\nI know you been a bitch\nI hate you worse than fans hate Joe D. for pickin' Darko Milicic\nI got a killer spit\nRiver current flow\nI'm as vicious as a pit\nYou a reappearing ho\nSho' nuff I gotta go\nBruce Leroy to these decoys\nDeep speech, each beat I seek and destroy\nD-Boy\nThe city's prince, I'm really convinced\nI'm up\nTo being as sick as Two Girls In A Cup (yuck!)\nI leave these wack MCs alone\nThey won't be in it long\nThey only got so much time like a minute phone\nBring your lyrics home\nFind you with your spirit gone\nOutlined and scribbled\nMy nine spiral period\nIdiot\nI'm on some Frank Nitty, big willie shit\nBout his bread\nBout he get you dead and I'm serious!\n\n[Royce Da 5'9\"]\nDelirious\nBeats be the eeriest\nHand on my balls\nThe Boyz N The Hood know my style like Furious\nI fight dirty\nI'm Ike scurvy\nI'll slap a bitch\nIt's obviously like blood on a white jersey\nDon't go and have an accident\nChrist Passion-ate\nYou little boys invite me to spaz\nI'm right on your ass\nI Mike-Jackson-it\nMy bitch Nina Ross constantly looking for pussy\nYou don't push me that pistol is dyke accurate\nThe lights flashin' in the night from the chain\nLike it's lightening\nBitches suckin' up to me\nMy life is a Dyson\nThe chicken with me is a knockout like she a Tyson\nBut like she enticing\nBright like the ice in a Breitling\nThe Feds buggin' like I'm lice\nWhenever we chop it up\nLike I'm dicin\nAnd I gas like I'm nitrous\nI'm on top like I'm icing\nWhat you not nice is\nThe block price is higher than the rock pipe is\nGeorge Bush that button like the Iraq crisis\nI'm Ted Dibiase\nI cop it\nIt's not priceless\nInsane in the membrane\nI'm sittin' on top of Sugar Hill like AZ but I'm not Cypress\nYou got a light for the blunt?\nFire up\nCall me Poppa Big Willie/pop a big wheelie like the bike front tire up\nMe and Vish nigga\nWe in tip top shape\nMyspace\nI stay in a bitch top eight\nThe only question I ask you bitch niggas is, \"Why hate?\"\nThe handle on the pistol is pearly like God's gate\nY'all niggas sound fishy but you're really squad bait\nThese Gucci's, these ain't Chuckies/Chuck E's but this is Child's Play", "image": "https://images.genius.com/5b0c99ea857e85f30c22aa344281f869.320x320x1.jpg"}], "artist": "Royce da 5'9'’"}