{"songs": [{"title": "Ooh La La", "album": "My Soul", "year": null, "lyrics": "Verse 1:\nUh, I sneak a forty like a cheetah\nAnd give a call to the wild when I greet her (Meow!)\nThe coochie leader\nBend on over and touch your toes\nAnd I can jump up on a dresser and strike a pose\nUh, if you want it then you're ready and you're able, girl\nPull up your skirt and we can do it on the pool table\nYour nipples look so tender\nCan I twirl 'em in my mouth like a blender, surrender\nCause ain't nothin but freakin\nI can keep it all day, all weekend\nAnd have you tweekin\nI be strokin, that's what I be doin\nAnd every position you assumin\nUh, all night, all day\nIf you stay\nI can rub you the right way (Hey!)\nIf he go one time, I go three\nCause that's how it is in the CPT\n\nChorus:\nOoh la la doo-wa-diddy (Woo-woo!)\nCause I got the key to the city\nOoh la la doo-wa-diddy (Woo-woo!)\nCan we go somewhere and get busy?\nOoh la la doo-wa-diddy (Woo-woo!)\nYou're lookin kinda pretty\nOoh la la doo-wa-diddy (Woo-woo!)\nCan I get close to the kitty?\n\nVerse 2:\nAre you sure that we alone, all alone? (Yeah!)\nLock the door and unplug the telephone (Telephone!)\nLight some candles let me get a look at your handles (Ooh-wee!)\nYou got a body like a sex scandal\nSo, I puts the cotton ball in the Q-Tip patch\nTurn around and let me see you from the back, ah shat! (Damn!)\nYou know you bring out the freak in me\nI go deep in the peak, I hope you think of me\nWhenever you need some sexual healing\nWe like two in a million\nDon't fight the feelin\nYou ain't dealin with no rookie\nYes I got a lot of nuts in my Tollhouse cookie\nCall up your bookie, put your money on the cement\nI'm puttin in work like a tag team free man\nI spark through the woods like a Recon\nAnd we can do it all night with the lights on\n\nChorus:\nOoh la la doo-wa-diddy (Woo-woo!)\nCause I got the key to city\nOoh la la doo-wa-diddy (Woo-woo!)\nLet's go somewhere and get busy?\nOoh la la doo-wa-diddy (Woo-woo!)\nI hope you ain't the kind that acts a ditty\nOoh la la doo-wa-diddy (Woo-woo!)\nI'm tryin to get close to the kitty\n\nBridge:\nWhat's up on some lovin, babay?\nWe can roll in my sixty-three\nAnd drink Hennessy\nWhat's up on some lovin, babay?\nDon't you wanna roll with me?\nYou and me can cream\n\nVerse 3:\nWe can put it on a platter, girl, it don't matter\nI make it hot and you can pop it like a firecracker\nIn the bedroom, bathroom, livin room\nOutside in the yard, it's a full moon\nIn the car, in the front seat, back seat\nOn the trunk, on the hood, and it's all good\nI'll be the piece and you can be the booty\nAnd I'll work extra duty to please your coochie\nYou can lay me on the bed and cuff me up\nSpread honey on my chest, but don't rough me up\nDig your nails in my back, girl, play yo game\nYou never come the same if we say yo name\nIs it real or a dream\nYou make me scream\nWhen you rub my body with shaving cream\nStick your tongue down my throat and give me a kiss (Mmm-waah!)\nCause you know it don't get no better than this (That's right!)\n\nChorus:\nOoh la la doo-wa-diddy (Woo-woo!)\nCause I got the key to the city\nOoh la la doo-wa-diddy (Woo-woo!)\nCan we go somewhere and get busy?\nOoh la la doo-wa-diddy (Woo-woo!)\nDamn, you're lookin kinda pretty\nOoh la la doo-wa-diddy (Woo-woo!)\nCan I get close to the kitty\nOoh la la doo-wa-diddy (Woo-woo!)\nGirl, I got the key to the city\nOoh la la doo-wa-diddy (Woo-woo!)\nCan we go somewhere and get busy?\nOoh la la doo-wa-diddy (Woo-woo!)\nCome and get a taste of the ribby (Ribby!)\nOoh la la doo-wa-diddy (Woo-woo!)\nNow, the kitty's kinda friendly\n\nBridge, Repeat 1.5X\nWhat's up on some lovin, babay?\nWe can roll in my sixty-three\nAnd drink Hennessy\nWhat's up on some lovin, babay?\nDon't you wanna roll with me?\nYou and me can cream", "image": "https://images.genius.com/8b2afc0b2ec12b84597cab495ffdf0e1.600x600x1.jpg"}], "artist": "Coolio"}