{"songs": [{"title": "Lost Ones", "album": "Cole World: The Sideline Story", "year": "2011-09-27", "lyrics": "[Intro]\nUh-uh, uh-uh\nOne, two, one, two, one, two, one, two, yeah\nUh-uh, uh-uh\nOne, two, one, two, one, two, one, two, yeah\nUh\n\n[Verse 1]\nBaby girl, I can't imagine what it's like for you\nI got you pregnant, now inside there is a life in you\nI know you wonderin' if this is gon' make me think 'bout wifin' you\nLike, if you have my first child\nWould I spend my whole life with you?\nNow, I ain't tryna pick a fight with you, I'm tryna talk\nNow, I ain't tryna spend the night with you, I'm kinda lost\nSee, I've been givin' it some thought lately\nAnd frankly I feel like we ain't ready and this—\nHold up now, let me finish!\nThink about it, baby, me and you, we still kids ourself\nHow we gonna raise a kid by ourself?\nHandle biz by ourself? A nigga barely over twenty\nWhere the hell we gon' live? Where am I gon' get that money?\nI refuse to bring my boy or my girl in this world\nWhen I ain't got shit to give 'em, and I'm not with them niggas\nWho be knockin' girls up and skate out\nSo, girl, you gotta think about how the options weigh out\nWhat's the way out?\nUh\n\n[Hook]\nAnd I ain't too proud to tell you\nThat I cry sometime, I cry sometimes about it\nAnd girl, I know it hurt, but if this world was perfect\nThen we could make it work, but I doubt it\nAnd I ain't too proud to tell you\nThat I cry sometime, I cry sometimes about it\nAnd girl, I know it hurt, but if this world was perfect\nThen we could make it work, but I doubt it\n\n[Verse 2]\nShe said: \"Nigga, you got some nerve\nTo come up to me talkin' about abortion\nThis my body, nigga, so don't think you finna force shit!\nSee, I knew that this is how you act, so typical\nSaid you love me, oh, but now you flippin' like reciprocals\nIt figures though, I should've known\nThat you was just another nigga\nNo different from them other niggas\nWho be claimin' that they love you just to get up in them drawers\nKnowin' all the right things to say\nI let you hit it raw, mothafucka!\nNow I'm pregnant, you don't wanna get involved, mothafucka?\nTryna take away a life—is you God, mothafucka?!\nI don't think so! This a new life up in my stomach\nRegardless if I'm your wife, this new life here, I'ma love it\nI ain't budgin', I just do this by my mothafuckin' self\nSee, my mama raised me without no mothafuckin' help\nFrom a man, but I still don't understand how you could say that\nDid you forget all those conversations that we had way back\n'Bout your father? And you told me that you hate that nigga\nTalkin' about he a coward and you so glad that you ain't that nigga\n‘Cause he left your mama when she had you and he ain't shit\nAnd here you go doin' the same shit… You ain't shit, nigga!\"\n\n[Hook]\nAnd I ain't too proud to tell you\nThat I cry sometimes, I cry sometimes about it\nAnd boy, this shit hurts, and ain’t nobody perfect\nStill we can make it work, but you doubt it\nAnd I ain't too proud to tell you\nThat I cry sometimes, I cry sometimes about it\nAnd boy, this shit hurts, and ain’t nobody perfect\nStill we can make it work, but you doubt it\n\n[Verse 3]\nThey say everything happens for a reason\nAnd people change like the seasons, then grow apart\nShe wanted him to show his heart and say he loved her\nHe spoke the magic words and on the same day he fucked her\nNow she wide open\nShe'd put a ring up on his finger if she could\nBut he loved her ‘cause the pussy good\nBut she ain't no wife though\nUh-oh! She tellin' him she missed her period, like typos\nHe panickin', froze up like a mannequin, a life grows\nInside her, and now he askin': \"Is it even mine?\"\nWhat if this bitch ain't even pregnant? Dog, could she be lyin'?\nAnd she be cryin', ‘cause he actin' distant\nLike, \"Ever since I told you this, nigga, you actin' different.\"\nAnd all his niggas sayin', \"Man, these hoes be trappin' niggas\nPlayin' with niggas' emotions like they some action figures.\"\nSwear they get pregnant for collateral, it's like extortion\nMan, if that bitch really pregnant, tell her to get a abortion (Uh)\nBut what about your seed, nigga? (Uh-uh)\nBut what about your seed, nigga?\nBut what about your seed, nigga?\nBut what about your seed, nigga?\n\n[Outro]\nAnd I ain't too proud to tell you\nThat I cry sometime, I cry sometimes about it\nAnd I ain't too proud to tell you\nThat I cry sometime, I cry sometimes about it", "image": "https://images.genius.com/40e3a5c128f6db9b27cebe6606882165.1000x1000x1.jpg"}], "artist": "J. Cole"}