{"songs": [{"title": "One More Chance", "album": "Ready to Die", "year": "1994-09-13", "lyrics": "[Intro]\nAll you hoes calling here for my daddy, get off his dick\nLike that, mommy?\n*Beep*\nHi, daddy, how you doing? This is Tyiest\nI was thinking about you last night, mm\nYou actin' like you can't call me no more 'cause you busy and all of that\nBut you trying to tell me it wasn't good?\n*Beep*\nThat shit is real fucked up what you did\nI hooked you up with my girl and shit\nYou fucked her every time you see her\nYou don't even say shit to her, you know what I'm saying?\nAnd all that bitch do is call me all day talking about you\n\"Why the fuck B.I.G. don't want me?\"\n*Beep*\nYo, B.I.G., this is Quita\nKenya told me she saw you and Shanie at the mall and I know you ain't fucking her\nYou fucked with me last night\nThat's my best friend and we don't get down like that\n*Beep*\nYeah, motherfucker, this is Stephanie\nI was waiting outside for your ass for like a fucking hour\nI don't know what's going on, motherfuckers trying to rob me\nYou be disappearing and shit, I'm waiting in the cold\nWhat the fuck is going on?\nWhen you get in give me a fucking call, alright?\n\n[Verse 1: The Notorious B.I.G.]\nWhen it comes to sex, I'm similar to the Thrilla in Manila\nHoneys call me \"Bigga the Condom Filler\"\nWhether it's stiff tongue or stiff dick\nBiggie squeeze it to make shit fit, now check this shit\nI got the pack of Rough Riders in the back of the Pathfinder\nYou know the epilogue by James Todd Smith\nI get swift with the lyrical gift\nHit you with a dick, make your kidney shift\nHere we go, here we go, but I'm not Domino\nI got the funk flow to make your drawers drop slow\nSo recognize the dick size in these Karl Kani jeans\nI wear thirteens, know what I mean?\nI'll fuck around and hit you with the Hennessy dick\nMess around and go blind, don't get to see shit (See shit)\nThe next batter, here to shatter your bladder\nIt doesn't matter, skinny or fat or light-skinned or black\nBaby, I drop these Boricua mamis screaming ¡Ay papi!\nI love it when they call me Big Poppa\nI only smoke blunts if they rolled proper\nLook, I gotcha caught up with the drunk flow\nFuck tae kwon do, I tote a four-four\nFor niggas getting mad 'cause they bitch chose me\nA big black motherfucker with G, you see\nAll I do is separate the game from the truth\nBig bang boots from the Bronx to Bolivia\nGetting physical like Olivia Newt\nTricks suck my clique dick all day with no trivia\nSo give me a ho, a bankroll and a bag of weed\nI'm guaranteed to fuck her 'til her nose bleed\nEven if your new man's a certified mack\nYou'll get that H-Town in ya, you want that old thing back\n\n[Chorus: Total & The Notorious B.I.G.]\nOh, Biggie, give me one more chance\nI got that good dick, girl, you didn't know?\nOh, Biggie, give me one more chance\nI got that good dick, girl, you didn't know?\nOh, Biggie, give me one more chance\nI got that good dick, girl, you didn't know?\nOh, Biggie, give me one more chance\n\n[Verse 2: The Notorious B.I.G.]\nIs my mind playing tricks, like Scarface and Bushwick\nWillie D, having nightmares of girls killing me?\nShe mad because what we had didn't last\nI'm glad because her cousin let me hit the ass\nFuck the past, let's dwell on the 500SL, the E&J and ginger ale\nThe way my pockets swell to the rims with Benjamins\nAnother honey's in the crib? Please, send her in\nI fuck non-stop, lick my lips a lot\nUsed to lick the clits a lot, but licking clits had to stop\n'Cause y'all don't know how to act when the tongue go down below\nPeep the funk flow\nReally, though, I got the cleanest, meanest penis\nYou never seen this stroke of genius\nSo take off your Timb boots and your body suit\nI mean the spandex and hit my man next\nSex get rougher when it come to the nut buster\nPussy crusher, black nasty motherfucker\nI don't chase 'em, I replace 'em\nAnd if I'm caressing 'em I'm undressing 'em\nFuck what you heard, who's the best in New York?\nFulfilling fantasies without that nigga Mr. Roarke\nOr Tattoo, I got you wrapped around my dick\nAnd when I nut I got to split\nShit, backshots is my position\nI got you wishing for an intermission, fuck the kissin'\nLickin' you down to your belly button, I ain't frontin'\nThey don't call me big for nuttin' all of a sudden\n\n[Chorus: Total]\nOh, Biggie, give me one more chance\nOh, Biggie, give me one more chance\nOh, Biggie, give me one more chance\nOh, Biggie, give me one more chance", "image": "https://images.genius.com/45300c7691fe6bbf9c3664d1c532d261.900x893x1.jpg"}], "artist": "The Notorious B.I.G."}