{"songs": [{"title": "The Come Up", "album": "The Come Up Vol. 1 Mixtape", "year": "2007-05-04", "lyrics": "[Verse 1]\nI'm on The Come Up\nChill nigga, don't run up\nA yellow nigga, finna rise and shine like the sun up\nMy mind on that paper, I ain't trying to wife the slut up\nI'm dying for this cake and I ain't trying to wipe a crumb up\nThey ride with the gun up, kill you and light the blunt up\nUh, don't shed a tear if a nigga might get done up\nBut, just say a prayer if a nigga might confront us\nCause his life is summed up, the medics wipe his lungs up\nYou coming to the 'Ville? You need to get a license from us\nCity on my back, I feel like I'm holding Big Pun up\nNo pain no gain, my nigga, I just numb up\nI blow brains, Cobain a nigga if he jump up\nWith no shame, don't blame a nigga if you shot up\nThis is cocaine on flame, baking soda and water\nAnd if you feel that then I guess I sell crack, get it?\nFall back, man, a nigga feeling crazy\nShitting on niggas like a nigga was still a baby\nCarolina nigga shout-out to the 'Ville that raised me\nSo many hoes whipped, you would've thought we still in slavery\nAnd niggas still sleepin' they feelin' lazy\nUh, a killer maybe, you make me I will\nCheat me on my scrilla, I send you to meet Dilla\nFrom them NC streets where the beef they deliver\nAnd the clip is on E cause your chest got a fill up\nWhile a nigga like me is just getting head like a pillow\nBread like gorillas getting bred\nSo long as my momma and my niggas getting fed\nFuck what a nigga said, man, I'm Fayettenam bombing\nCause hatred is flattery you bitch niggas is charmin'\nWho the fuck you harmin'? Boy, ya'll niggas is charmin'\nAnd I'm armed and waiting for a target\nYou fucking with the best like Carmen\nAw shit, pardon a nigga for departing\nI'm just getting green like a yard or a garden\nA nigga finna blow while you niggas is false alarmin'\nAnd just think, man, I was raised on ramen -- chicken noodle soup\nNow I'm filet mignon-in'\nI promised my momma I was coming to make this money\nAnd I swear I'm going to kill the nigga that try to take it from me\n\n[Outro]\nYeah, that's real talk, nigga\nIt's J. Cole, nigga\nTherapist whatever the fuck you wanna call him, it don't matter\nYou know, I'll make y'all niggas understand man\nI know you can't believe yourself right now\nYou thinkin' this niggas from the south, hahaha\nHe can't spit, how the fuck is he so good?\nOpen your eyes motherfucker, can you see? Niggas on top\nYup, we on top", "image": "https://images.genius.com/bda451f623edd51bf1dcc17564bd3e70.501x501x1.jpg"}], "artist": "J. Cole"}