{"songs": [{"title": "Stuff To Never Rhyme (The Don’ts)", "album": null, "year": "2018-07-06", "lyrics": "(These are the rules)\nThis is brought to you by Alchemist\n(That's right)\nMr. Porter\nUmm...\nThese are the hip-hop don'ts\n(Royce is here. Royce is absolutely here)\nStarting now, yes\nRoyce da 5'9\" is here\n\nIf you have an emergency it cannot be with an urgency\nAnd if it is with an urgency in your rush to emergency surgery\nYou cannot be burned in third-degree\n(At all) At all\nAnd if you're gonna murder me\nIt cannot be like you never heard of me\nYou gotta know it's you have to know me\n(You can go to surgery for a burn but it just can't be third degree)\nYeah yeah you could go if it's\nIf it's a second-degree burn okay\nYou can be rushed to emergency surgery\nBut there can be no urgency\nAbsolutely not\nNo urgency\n\n(If you want to be a pimp) you cannot have a limp\n(No, straight walk he must walk straight line, straight line if you want to be a pimp, in your rhymes. This is a fact)\nYes you you know\n(No wounded pimps!)\nYou can be either or\nYou can be a pimp, and if you are a pimp and that's what you choose to do that's fine\nIt's all good, just do not have a limp\n(Absolutely not)\n\nYou cannot be a mobster and eat lobster\n(At all. You better be allergic to shellfish)\n(Eat something else, Goddamit)\nIf you are a mobster\nStay the fuck away from lobster\n\n(And, and for anybody that want to start a war\nAnd you want to drop a bomb\nIt cannot be on Vietnam\nVietnam's already over you can't drop bombs)\nYou cannot drop a bomb like Vietnam\n(You cannot drop a bomb like anything. Fuck that. No more bomb dropping)\nIf it's gonna be a missile it cannot be a SCUD missile\nIt cannot be a SCUD missile\nIf you're gonna freestyle it cannot be 'til you're senile\nSo, you can freestyle that's fine, but do not do it until you're senile\nJust before you're about to push to the point of senility\nYou cannot die hard\nYou cannot die hard like Bruce Willis\n(Yes, yes)\nNo more no more\n(Your poems can't be popular\nThey can't be popular\nCan't be off of the dome)\nIf it's off of the dome it cannot be a popular poem\n(Nobody can know it okay)\nNo more off the top of the head\nOff the top of the dome\nOff the cerebellum\nNone of that shit\nNo more, no more\n\n(Now if you're getting brains from a girl\nThere's no way you can become smarter from that\nYou cannot become smarter from brains\nYou can, like she gave me brains and I'm fucking genius? No. No)\nIf a girl gives you brain it cannot make you smarter\n(You gotta be dumb as fuck)\nYou can get brain that's fine\nJust do not come out of it a smarter person\n(No, no)\nSpeaking of smarter person: knowledge and college\nYou are not allowed to, you can have knowledge\nBut it better not be from college\n(You better be in high school)\n(No, no)\nYou cannot manage to do damage\nNo more\nNo more manage to do damage\nIf you're gonna manage something it cannot be damage\nStay away from damage\n(If you have, if you have\nFor anybody that's got one skill\nDo not use it for any means, by any means to pay bills\nYour skills cannot pay the bills)\nIf you have skills you cannot use them to pay the bills\n\n(You think just because you're in the booth it's the fucking truth?\nNo! You can lie in the booth too)\nFrom now on, lie in the booth\nBecause you cannot be in the booth to spit the truth to the young youth\nNo more\nIf you're in the booth you have to stay away from truth\n(You can lie in the booth)\n\nYes you can have have a backpack\nThis is serious, this is serious\n(Listen to this)\nI don't care if you have a backpack in your first verse\nYou got three verses and you try to have a knapsack in the third verse?\n(Uh uh. Absolutely not!)\nNo! You cannot have a backpack and a knapsack!\n(Get the fuck outta here. Pick another song)\nYou pick one or the other\n(Pick another song. Go to hell)\nPick a fucking fanny pack, I don't care\nBut you cannot have a backpack and knapsack\n(What is wrong with you)\n\nAnd if there's gonna be violence it cannot rhyme with silence\n(No, no no)\nIn advance we're telling you that\n(It's gotta be loud. It's gotta be loud, screaming, horrible violence)\nYou cannot have a riot and be quiet\n(No)\n(Royce: I hate to break it to you bro, but that shit gotta be 1 minute long...)\n(We gonna break it up!)\n\n(You cannot hit the block at all by any means with a Glock, you cannot...)\nYou can't wait, be on the block with the Glock\nAnd make it cock\n(No no no. It's too much, it's too much)\nNo block Glock cock\nNo more of that\n\n(You know what ? I'm gonna just go out there and say this\nNo more jewelry temperature\nI don't care how cold, what temperature degree your fucking jewelry\nJewelry doesn't have a temperature)\nYes no, it cannot be frozen below 400 million degrees\nLike it just has to, if you're gonna-\nIt cannot be a temperature\n(It's true. What if it's 90° outside and you got jewelry on? You fucking hot. Stop lying. You ain't cold 'cos you got jewelry. That's a lie. Stop lying to the people)\n\nYou cannot be on the level with the devil\nYou cannot -\n(Party. You can't party, don't party with a lil Bacardi)\n\nYou're gonna be, if you're gonna be lyrical\nYou better not -\nYou better stay the fuck away from miracles\n(That's it. No miracles)\n(You just a regular mortal human you don't perform miracles if you lyrical)\nNo no no\nNo more love in the club\nNo more\nIf I go in VIP they don't need to see ID, right\n(No more come on )\n(They know who you are if you're going to VIP they know your face, you paid for it)\nIf you're gonna get buried it cannot be in the cemetery\nIf you are in the cemetery you cannot be buried\nNo more\n(Leave it alone)\n\nAnd you can't, you cannot\nIf you go to jail you cannot make bail\nIf you're gonna have swagger\nYou cannot be like Mick Jagger\n(You gotta be like Lou Ferigno or someone like that)\nYou can be like Mick Jagger but you... it's one or the other\nYou have to have one or the other\nNo more rhyming Mick Jagger with swagger, no\nNo more spectacular with vernacular\n(You got to stay away from that one)\n\nWhy do you feel that you have to say that a pencil is a utensil\nA pencil is a fucking utensil! Right or wrong?\nIt's already a utensil you don't have to make\n(It's a double negative!)\nOnce you got the pencil you already have the utensil\nThe utensil is the pencil so you don't need to\n\nYou cannot use a vest to protect your chest\n(Come up with some other shit\nCome up with something else for it to protect. Get creative)\nMaybe the vest protects your abdominals\n\n(If someone's gonna murder you they obviously heard of you right? How do you...?)\nI think we went we went over that but  I do think that is important to stress\nBecause if I murder you like I never heard of you\nWhat is the difference?\nDo I not feel as bad because I murdered you because I never heard of you?\n(It's fucking stupid)\nAnd if I did hear of you I might actually feel bad, it my weigh on my conscious or something?\n(Royce: ...What kind of gratitude do you get from murdering a person you don't know anyway?...Yeah you wanna know...)\n(You get no points. It makes no sense)\n\nIf you're gonna be near death it cannot be on your last breath\nYou cannot\nYou can't be on your last breath near death\nBut if you've got bodies it's not like John Gotti\nYou cannot have bodies like John Gotti\nYou cannot rhyme casket with basket, no more\nMoney, funny, honey, bunny, no more\n(Static, attic, no, it's over)\nIf you like static, you cannot be an addict for it\n(Moderation. Static in moderation. No addictions)\nModeration, static in moderation, static in moderation\n(You cannot be addicted to static. Forget it. Those days are over)\nYou can't you can't\nYou can start static, if you start static just you cannot get addicted to it\nIf you become an addict for static, it's automatic\n(Ooh you can't be automatic either. It has to be manual)\nIt cannot, yeah, yo\nManual and it cannot be -\nThe static has to be...\nThe static cannot be automatic\n\nI think this is- I think this is good\n(It's a good start)\nYeah\n(I think they'll be a better MC if they follow these rules)\nYes, this will make you\nIf you really want to be if you really want to be considered one of the greats\n(Mmm-hmm)\nYou can't do any of this shit\nAnd if you're gonna keep it real, you cannot pack the steel\nYou can pack the steel but you probably shouldn't keep it real\nKeep it fake\n(Royce: Be a fake ass motherfucker)\nYep be fake with the steel or be real without the steel\nYou cannot keep it real and pack the steel\nYou cannot rip shop in hip hop to the tip-top, you just can't\nYou can't\n(Stay ground level stay ground level)\nGround level\nIf you're gonna make me drip drop cuz I flip flop\nI cannot be in flip flops\n\nIf you're a new up-and-comer right in hip-hop and you don't understand the history of hip-hop, that these things have been rhymes way too many times by now, we're just giving you, you know what I'm saying, “The Don'ts”\n\nListen I'm telling you something, I'm trying to talk to you, I'm telling you something I'm telling you something young 'un. You're coming up in this game? These are the fucking rules, like it or not. You cannot say this shit, and if, (Facts! Big facts!) and if you come up missing it cannot be like Hoffa. No. No more missing like Hoffa. I think they found Hoffa anyways, didn't they? Yeah they found Hoffa. So you can't. No more missing like Hoffa", "image": "https://images.genius.com/c8d040ce4e79e6080f23fb3c7952838f.1000x500x1.jpg"}], "artist": "Eminem"}