{"songs": [{"title": "1999", "album": null, "year": "2009-07-17", "lyrics": "[Intro]\nHi kids, do you like Kim's bullshit? (No!)\nWanna see me stick her fucking eyeballs right in to my anus?\n\n[Verse 1]\nI got a fucking time traveling machine to go back all to this\nAnd see all the piss that she gave me, bitch\nShe made me fall on my ass\nThe walls are caving in and I gotta go ham on this bitch\nLike, woah, so we never fell in love so I didn't have to\nGo through that shit no more\nIt's like a nugget, I'm hugging these sluts\nThat are bothering this fucking chick when I murder\nAnd spit on the beat like the drugs I was taking\nJust a bit of it\nAnd stop slurping the blood off her face, or I'll murder you too with a bag full of mace and if Kim comes to my house and says \"Wanna get back together?\"\nAnd I say \"No, get out before I [slit your throat] and splatter the blood on this sweater!\"\nBlue eyes, red eyes, green eyes, bloody eyes\nHi Mom, you're back again, rock climbing my dick to see how famous my fucking life is?\n\n[Chorus]\n1980, still feeling shady, 1983, bitch never leave me\n1987, met this bitch in heaven, 1999, my life was very deprived\nI said hey, do you want me? I'm still feeling kinda shady\n1999, we got 3 babies, 1999, will you ever leave me?\nBecause back then, I was kind of shady\n1980, still feeling shady, 1983, bitch never leave me\n1987, met this bitch in heaven, 1999, my life was very deprived\nI said hey, do you want me? I'm still feeling kinda shady\n1999, we got 3 babies, 1999, will you ever leave me?\nBecause back then, I was kind of shady\n\n[Verse 2]\nRing around the rosie, pocket full of posie\nKim, Kim, be shady like me, I'm trying for the 4th\nStop being a bitch, please, walking across the highway\nPlaying Chicken, while brains splatter all over the road like\n\"ricken, ricken\", my phone's dead, now how can I call the bitch?\nI'll use the payphone, this bitch is calling my dead phone, she won't leave me alone\nSpent 75 cents on her, and she didn't answer\nNow I'll come to her house and [slaughter her ancesters]\nBoo! I'm a ghost, you happy to see me? I'm taking your soul\nWell shit, you don't believe me? Boom, I did it, do you believe me now? Shit whatever, I'm the king so hand me the crown\n\n[Chorus]\n1980, still feeling shady, 1983, bitch never leave me\n1987, met this bitch in heaven, 1999, my life was very deprived\nI said hey, do you want me? I'm still feeling kinda shady\n1999, we got 3 babies, 1999, will you ever leave me?\nBecause back then, I was kind of shady\n1980, still feeling shady, 1983, bitch never leave me\n1987, met this bitch in heaven, 1999, my life was very deprived\nI said hey, do you want me? I'm still feeling kinda shady\n1999, we got 3 babies, 1999, will you ever leave me?\nBecause back then, I was kind of shady\n\n[Outro]\n1999, the slut's pussy is so dry, I said 1999, the slut's pussy is so dry, no other faggot can control my life", "image": "https://images.genius.com/b379811c1415017b9f3e3a71b9d26060.400x400x1.jpg"}], "artist": "Eminem"}