{"songs": [{"title": "Lay It Down", "album": "I Am Not a Human Being II", "year": "2013-03-22", "lyrics": "[Intro: Lil Wayne]\nCut the music up\n\n[Verse 1: Lil Wayne]\nYMCMB, bitches call me Tunechi Li\nI be with niggas that shoot police\nI keep that iron, you can get creased\nAnd if she say she didn't fuck, bitch ya lying through ya teeth\nThey say it cost to be the boss, the ones in jail wish they were free\nNiggas call me Hi-C because I'm high as you can see\nNiggas say they paid they dues, well I'm checkin' your receipt\nMight as well go stupid since this is a stupid beat\nGrab the owl out the tree, and ask that bitch, who but me?\nGot ya bitch bent over nigga, hands to her feet\nTell that pig and that cow I'll go ham if it's beef\nCause all my niggas well rounded\nDon't fuck with none of these square niggas\nMask on, Ghostface Killah, draw down and erase niggas\nI'm a Blood, is you a blood donor? Swisher full of that California\nI hit it sideways, caddy-corner\nThen she catch that nut like pneumonia, Lil Tunechi\n\n[Hook: Lil Wayne]\nLay it down ho, lay it down bitch\nLay it down ho, lay it down\nLay it down, lay it down, you hoes lay it down\nLay it down, lay it down, you hoes lay it down\nPut the money on the couch nigga\nGimme everything up in yo house nigga, shut yo mouth nigga\nPut the money on the couch nigga\nGimme everything up in yo house nigga, shut yo mouth nigga\n\n[Verse 2: Cory Gunz]\nStart it up, vroom vroom\nUppercut a bitch out the bus, boom boom\nUnless I get the brain, poom poom\nShe let a nigga run and get the gang, run a train, zoom zoom\nTryna get paid too soon, one deep, one sweep away in a room room\nWe getting money over here, talking shit and fucking bitches\nI don't know what the fuck they doing Tune\nMy syrup purple, my turf Earth, my birth circle, I'll dirt surf you\nI'll squirt murk you, my verse hurtful\nMy shooters still got curb curfews\nY'all bout as hot as Von Dutch, y'all not gone harm much\nHijack y'all some prom busts; ain't no retreat but my arms up\nNo graffiti, my bombs up, it's Young Money in this shit\nUntil a nigga dead and gone\nIf you wanna set it off, what you wanna bet it on?\nI'm betting the wedding's off when everything is wetted on\nPoint 'em out, Truk ya life, fuck ya style, fuck with me\nYou a bucket foul, niggas'll buck ya smile for a dunkin pile\nYou better duck it, pal\n\n[Hook: Lil Wayne]\nLay it down ho, lay it down bitch\nLay it down ho, lay it down\nLay it down, lay it down, you hoes lay it down\nLay it down, lay it down...\n\n[Verse 3: Nicki Minaj]\nUh, yo\nShawty, what's yo, name? Is you trickin'? Is you payin'?\nIs you sniffin' on that caine? What the fuck, is you saying?\nIf you getting it, then you getting it, it's my money I ain't splitting it\nI ain't tripping it, if she got a fat ass, then I'm tipping it\nCame out the bank, bye teller, give a bum money, hi fella\nBad lil' ho, high yellow, Brand new Rolie, Sky Dweller\nJust left from Dubai, flew private eye\nI made a million dollars, swear to God that ain't no lie\nI said, them niggas was poppin', fake niggas be watchin\nMy black glove be drippin wet, but I got my Cochran\nLosing ain't no option, I'm teaching bitches my doctrine\nThe Maybach ain't poppin, if it ain't got no partation\nOops, I mean partition,it's all a part of my vision\nI sit and count this money, while I watch you bitches audition\nI said oops I mean partition, it's all a part of my vision\nI sit and count this money while I watch you bitches audition, hehehe\n\n[Outro: Nicki Minaj]\nFuck wrong with you bitches?\nI don’t give a fuck; you don’t hear me, you don’t see me\nBitch you gon' feel me ho\nYoung Money, Young, Young Money nigga\nYoung, Young, lay it down, lay it down, you hoes lay it down\nLay it down, lay it down, you hoes lay it down", "image": "https://images.genius.com/025852747d34bfec09080ad4c10b07b6.1000x1000x1.jpg"}], "artist": "Lil Wayne"}