{"songs": [{"title": "Ride Out", "album": "Blank Face LP", "year": "2016-07-08", "lyrics": "[Chorus: ScHoolboy Q]\nRide out, get smoke\nRe-up, get dough\nGs up, hoes blow\nFreeze up, eyes closed\nRide out, get smoke\nRe-up, get dough\nGs up, hoes blow\nFreeze up, eyes closed\n\n[Bridge: ScHoolboy Q]\nYoung nigga and I'm proper, like\nCouple hundred thousand on me, nigga, yeah, I'm baller-like\nBitch, I think I'm Dolemite, bitch, I'm goin' Poltergeist\nWho said this was overnight? Album four is really like (Yeah)\n\n[Verse 1: ScHoolboy Q]\nCrippin' on my minibike (Oh), either hoop or sellin' white\nBrillo pad, the smoker's pipe, my pistol cocked, you tryna fight?\nSay he wanna be a cuz, put his brains to the right\nBruh, this ain't the eighties, mayne, niggas shootin' everything\nEverything! You know the gang we represent\nSpecialize in pistol grips, shootin' out my momma's whip\nAlways got an empty clip, Top Dawg in this bitch\nNiggas puttin' dicks inside your baby momma's momma's lips\nShootin' all the witnesses, it ain't no fuckin' murder scene\nCrips don't fuck with Crips so now his jeans look like the rival team\nWrong hat and shoes, put your ass on a forever-dream\nHeatin' up the summer 'til the winter fall, spring clean\n\n[Chorus: ScHoolboy Q]\nRide out, get smoke\nRe-up, get dough\nGs up, hoes blow\nFreeze up, eyes closed\nRide out, get smoke\nRe-up, get dough\nGs up, hoes blow\nFreeze up, eyes closed\n\n[Bridge: ScHoolboy Q]\nYoung nigga and I'm proper like\nCouple hundred thousand on me, nigga, yeah, I'm baller like\nBitch, I think I'm Dolemite, bitch, I'm goin' Poltergeist (Yeah)\nWho said this was overnight?\nMe and Vince, we crackin' like, crippin' in our afterlife\n\n[Verse 2: Vince Staples]\nYeah, 'cause at Ramona Park\nWe beef with everybody\nLight or dark, I'll spark, don't fuck with narcs\nSo don't be talking 'bout me\nMy big homie named me \"Get Em, Kill Em\"\n'Cause if I got 'em I'ma kill 'em, I ain't playin' with 'em\nI'm from the bottom, that's the top of the town\nWe on the border, so they cliquin' up for knockin' us down\nMy burner tucked, I learned from Chuck so I ain't turnin' it down\nGet to bustin', know you bluffing, nigga\nIf that bitch can't make me rich\nThen ain't no need in fucking with her\nTurn around and fuck her sister\nHeard that bitch got EBT\nLong Beach ain't seen shit like me since Tracy D and DPG\nI went and got a burner on the day they murdered Baby D\nI'm in that Benz with Lil Boy, so, lil boy, don't play with me\n\n[Verse 3: ScHoolboy Q]\nHuh, I'm ridin' cycs through Hoover Street\nMy knuckles full of teeth\nTry to creep on me, you're dyin' in your homie seat\nKeeping to my gun in reach, for later beef\nClip reach from Figg Side to Norfolk Beach\nIn a stolen Expedition, in your hood, 'cause you the mission\nBeen a mathematician, load nine, subtracting eight\nI'm keepin' one for just in case, don't cover face but I ain't trippin'\nBlunt was laced, niggas know I'm 'round the way\nSo ain't no liquor stores today\n\n[Chorus: ScHoolboy Q]\nRide out, get smoke\nRe-up, get dough\nGs up, hoes blow\nFreeze up, eyes closed\nRide out, get smoke\nRe-up, get dough\nGs up, hoes blow\nFreeze up, eyes closed\n\n[Bridge: ScHoolboy Q]\nYoung nigga and I'm proper like\nCouple hundred thousand on me, nigga, yeah I'm baller like\nBitch, I think I'm Dolemite, bitch, I'm goin' Poltergeist\nYou said this was overnight\nMe and Vince, we crackin' like, crippin' in our afterlife\n\n[Outro: ScHoolboy Q]\nRide, ride, ride, ride\nRide, ride, ride, get dough\nGs, Gs, Gs, Gs, Gs\nEyes closed\nRide, ride, ride, ride\nRide, ride, ride, ride\nRide, ride, ride, ride\nRide, ride, ride, ride\nRide, ride, ride, ride", "image": "https://images.genius.com/4387645fa58bf58f64c2e4f8733125be.1000x1000x1.jpg"}], "artist": "ScHoolboy Q"}