{"songs": [{"title": "Mama, I’m In Love Wit A Gangsta - Mix [feat. LeShaun]", "album": null, "year": null, "lyrics": "Hey, baby, how you doin'? What's goin' on?\n\nI'm sittin' in my motherfuckin' cell, it's the same song\n\nTell my kids that I love 'em\n\nBut don't tell 'em that I'm through\n\nKeep cryin' an' tell 'em I'll be home soon\n\nOh, baby, I'm goin' crazy\n\n'Cos I keep seein' shit that amaze me\n\nStill, I had to kill a motherfucker last week\n\nHe thought I was a punk\n\nAn' tried to creep up on me in my sleep\n\nI just think that I could hold or squeeze or touch\n\nOr buck ya but I can't, so fuck it\n\nI'm behind these bars an' it's burnin' like nitro\n\nI might go psycho, the man on the tower got a rifle\n\nAw, shit, there the lights go\n\n{Hello}\n\nMama, I'm in love wit a gangsta\n\nMama, I'm in love wit a gangsta\n\nMama, I'm in love wit a gangsta\n\nAn' I know he's a killer but I love dat nigga\n\nHey baby, what's happenin', honey?\n\nHow you doin'? I miss you\n\nThe kids keep askin' where's their papa?\n\nI had to tell 'em Daddy got caught by the coppers\n\nIt's time for me to raise 'em up proper, by myself\n\nIt's a goddamn struggle when a bitch ain't got no help\n\nNow, everybody tellin' me that you ain't shit black\n\nAn' when you get out, you'll jack\n\nAn' probably go right the fuck back\n\nDamn, the pressure's gettin' hot an' heavy\n\nAn' yeah, I'm gettin' sweated by your homey\n\nIn the blue an' white Chevy\n\nBut now he's got a condo an' a brand new Lexus\n\nWants me to take a trip with him down to Texas\n\nThe ends don't justify the means\n\nAn' in another life he might've been the man of my dreams\n\nBut you know I got your back to the motherfuckin' end\n\nBut a bitch can't even trip like she doesn't need a friend\n\nMama, I'm in love wit a gangsta\n\nMama, I'm in love wit a gangsta\n\nMama, I'm in love wit a gangsta\n\nAn' I know he's a killer but I love dat nigga\n\n{Hello, you have a collect call from, Coolio\n\nIf you choose to accept this call, please press 5 now}\n\nWhat the fuck you mean you need a friend?\n\nI can't be havin' no niggas 'round my kids\n\nDon't you make me break up outta this motherfucker\n\nAn' start killin' motherfuckers, shit\n\nI know it's rough, I know it's tough\n\nBut when you fumble in the game, sometimes you get locked up\n\nYou better stay away from that punk ass bitch\n\nHe ain't shit, I don't wanna have to kill him\n\n'Cos think about the times that we used to have\n\nDon't make me reach out an' touch that ass\n\nYou put yourself in danger when you fuck with a buster\n\nLike shootin' dice without a pistol, in a circle of murderers\n\nYou got more class than the average type hooker, bitch\n\nDon't switch, he gotta grip but he ain't rich\n\nNow I gotta check but if you've got the check\n\nGive a nigga a look an' put somethin' on my books, peace\n\nMama, I'm in love wit a gangsta\n\nMama, I'm in love wit a gangsta\n\nMama, I'm in love wit a gangsta\n\nAn' I know he's a killer but I love dat nigga\n\nAiyo, remember the homey with the Lexus\n\nHe took the trip to Texas\n\nNow he's wearin' the fuckin' Lexus like a necklace\n\nSo tell me, what's the drill, baby pa? What's a bitch to do?\n\nMy nigga's stretched in the pen since '92\n\nThem visits ain't doin' the trick, drop fucks make me sick\n\n'Cos this po' puddy tat needs a cat nip\n\nAn' that motherfucker representin' you, I think he resents you\n\nHe got evidence he never presents to\n\nThe people in court, I heard witnesses abortin'\n\nWhat's he doin' about gettin' you out to hold the fort?\n\nI got some ends, I'ma send you a dime an' two doves\n\nMama hates you but damn, I got love for a gangsta\n\nMama, I'm in love wit a gangsta\n\nMama, I'm in love wit a gangsta\n\nMama, I'm in love wit a gangsta\n\nAn' I know he's a killer but I love dat nigga\n\nMama, I'm in love wit a gangsta\n\nMama, I'm in love wit a gangsta\n\nMama, I'm in love wit a gangsta\n\nAn' I know he's a killer", "image": "https://images.genius.com/80e7d4d7290ea57cc76b3c5e101a8d2f.755x755x1.jpg"}], "artist": "Coolio"}