{"songs": [{"title": "Should I", "album": null, "year": "2014-12-11", "lyrics": "[Intro]\n*lighter flick & inhale*\nHmm\n\n[Hook]\nI was sittin' in the dark\nWaitin' on the lock to unlock\nBut it never unlocked\nOh no, no, no\nShould I leave? Should I leave?\nShould I stay? Should I go?\n\n[Interlude]\nMind playing tricks on me right now\nI don't know what to do (*lighter flick*)\nI miss you, Imma leave you, but I’ll be right back\nI wish I could fly like Michael Jordan\n\n[Verse 1]\nSpace cadet, flyin' on the jet, unexpect\nThat Texas tea, spillin' on my jeans, outfit\nBitch, lean on me\nRidin' through the hood, no ski on me\nSnake life, a whole lotta skeets in me\nBlood like a vampire teeth in me\nJumanji on my feet (aye! damn!)\nRidin' through the hood in the Jag or the Jeep (skrt skrt skrt!)\nShe know Young Thugger gon' spit (what?)\nShe know Young Thug got bitches\nThen I come back to my senses like\n\n[Hook]\nI was sittin' in the dark\nWaitin' on the lock to unlock\nBut it never unlocked\nOh no, no, no\nSee, I was sittin' in the dark (no, no)\nWaitin' on the lock to unlock (nooo)\nBut it never unlocked (nooo)\nOh no, no, no (noooo)\nI was sittin' in the dark\nWaitin' on the lock to unlock\nBut it never unlocked (what?)\nOh no, no, no\nShould I leave? Should I leave?\nShould I stay? Should I go? (yeahh...)\n(Then I come back to my senses like)\n\n[Verse 2]\nGet the fuck up out that YSL sofa (what?)\nGet on the floor-oor (hey)\nI-I would like for you to know (what?)\nYour popcorn poppin' (yeah)\nI'm like, \"Rich Homie, stop it\" (yeah)\nYeah your boy trending topic (hey)\nI'll go stompin' like Kunta la Kinte (what)\nFuck, trap spots tucked down with the mouses\nNo not a club but her booty is bouncin' (bounce)\nI live my life stoned, no mountain\nI'm gon' drink you like a Fanta (drink)\nThen she switch up like Hannah Montana (woah)\nCouldn't ever understand her (hahaha)\nCome back to your senses Thug! (huh?)\n\n[Hook]\nSittin' in the dark\nWaitin' on the lock to unlock (why?)\nBut it never unlocked (damn)\nOh no, no, no (dirty bitches)\nShould I stay? Should I stay? (dunno)\nShould I go? Should I go? (hahaha)\nShould I stay? Should I stay? (that's my bro)\n(Hey!) I was sittin' in the dark\nWaitin' on the lock to unlock (should I stay? swear I don't know)\nBut it never unlocked (should I stay?)\nOh no, no, no (I swear I don't know)\nShould I stay? Should I stay? (swear I don't know)\nShould I go? Should I go? (swear I don't know)\n(Swear, life goes... goes...)", "image": "https://images.genius.com/681e1a56fda3847e164e810f73636a28.500x500x1.jpg"}], "artist": "Young Thug"}