{"songs": [{"title": "Untitled", "album": "Untitled", "year": "2008-07-15", "lyrics": "[Sample]\n\"They did not have the power to stop Louis Farrakhan\nThey were trying to touch on and thieve envy within the leadership\nBut as a general and a man that rose through the ranks through discipline\nHis presence inspired those men with the discipline he imposed on his own life\nLouis Farrakhan\"\n\n[Verse 1]\nUhh, yeah, wow..\nNo revolutionary gets old or so I'm told\nYou're left full of bullet holes when you tell the people go free\nOh, it's a matter of days before they try to take me\nI heard gun shots rang; his bullet's got my name\nI ain't see 'em take aim, I dreamt this day came\n'Cause I stood in the face of damnation\nSatan spat at 'em, flat out disgraced 'em\nHe want my blood, why me?\nWhy not the fake ones who deserve death, man?\nFuck it, I'll take one, 'cause stop me\nBut can't stop a whole nation of millions who feel you deceived them\nThey believe in reparation makes it even\nSo I'm deadly now because of one reason, they listening\nIn Budapest, Japan, China, and Switzerland\nWe getting it in son\nAnother bullet pass by, missed me\nWondering who plotting to get me?\nAlphabet boys still plotting against me\nTo hush me and stuff me in the pockets of history\nYou won't remember why they came to clip me\nWhen time go by you'll soon forget me\nThey say he was the king of bling, jewels, and Bentleys\nThen they use one of my lines just to prove I'm guilty\nDon't let 'em kill me...\n\n[Sample]\n\"They did not have the power to stop Louis Farrakhan.\"\n\"They did not have the power to stop Louis Farrakhan.\"\n\"They did not have the power to stop Louis Farrakhan.\"\n\"They did not have the power to stop Louis Farrakhan.\"\n\n[Verse 2]\nSome revolutionaries do live long\nAm I one of them? Guess we'll know in due time\nEverybody has rights, can I use mine?\nCan I rock shine? Can I have a girl that's too fine?\nGot a swell life, tell me will I lose mine?\nEvery time I turn around somebody new dying\nLet's start living, À la carte, Escargot\nEscobar, invest my millions\nMansion for the wife, the rest for the children\nKnowing that they coming anytime\nBut until then, i'm at large till they shoot me\nMillion dollar stones in my camouflaged Gucci\nGiving you this crack like Pookie\nTo question the system, be the resistance\nNo matter what color you are, everybody niggers\nOr you can stand by or watch or you can march on with us\n\n[Chorus]\nSome revolutionaries get old although I'm told\nYou'll get a left full of bullet holes when you tell the people go free\nOh, it's a matter of days before they try to take me\n\nSome revolutionaries get old although I'm told\nYou'll get a left full of bullet holes when you tell the people go free\nOh, it's just a matter of days before they try to take me...", "image": "https://images.genius.com/b494ca4151f14803123849b4f34be37f.700x700x1.jpg"}], "artist": "Nas"}