{"songs": [{"title": "Grind Hard", "album": "The Last Kiss", "year": "2009-04-07", "lyrics": "[Intro: Mary J. Blige]\nOooh! Ooh! Ooh! Ooh!\nOooh! Ooh! Ooh! Ooh!\nOooh! Ooh! Ooh! Ooh!\n\n[Hook: Mary J. Blige]\nNow we shinin' hard just like we wanna do\nGrindin' day and night, so we can kick off our shoes\nAnd there's the glamorous life; look what we made it to!\nWe some real live bosses, got 'em lookin' at you\nWe grind hard (oooh-ooh!) To play harder (oooh-ooh!)\nWe touch the stars (oooh-ooh!) That's what they call us (oooh-ooh!)\nWe grind hard (oooh-ooh!) To fight 'em all off (oooh-ooh!)\nWe grind hard (oooh-ooh!) To play harder (oooh-ooh!)\n\n[Jadakiss]\nHa-ha! Yo!\nTwenty-four seven, three-six-five\nIf we ain't breaking 'em down, then we lettin' 'em fly!\nNah - never I, always we\nI came in the game dividin' the pies by three\nThen we got famished, so we set standards\nVery similar to the +Ten Crack Commandments+\nSome couldn't take it, others got lost and couldn't make it\nWe wanted to floss, but couldn't fake it!\nThe Hood embraced it, the rest is basic\nNo need to rush, be extra patient!\nThe new four-door Porsche is extra spacious\nSame entourage, no extra faces!\nHands down, the best - no explanations!\nAnd to the top is the next destination!\nAnd ain't no time-outs! Death is the only time\nWe gonna sign-out! So we gonna grind out!\nWhat?!\n\n[Hook]\n\n[Jadakiss]\nHa-ha! Ugh! Yeah! Yo!\nTop 5, Dead Or Alive's what they consider him!\nSoon as them things come in, we get rid of 'em\n+Mo Money, Mo Problems+ - gotta live with 'em!\nOnly thing they care about is what you givin' 'em!\nNot the energy that you wasted in the game\nOr the tears that trickled down your face from the pain\nThe time your jaw cracked, you wasted the 'caine\nHad to do two shifts to make it the same!\nThat all changed, as soon as you tasted the fame\nAnd it was all worth it, after you made you a name\nThanks to Our Heavily Father\nWe fly on the jet now, 'stead of the charter\nLeave a nice tip in the front for the gardener\nDo a lot of listenin', so we stay smarter\nEverybody's a hero, when they get scarred-up\nIt's my ball - check it up, y'all better guard-up!\nLet's go!\n\n[Hook]\n\n[Mary J. Blige]\nWhen we step up out that car\nThe whole damn world's lookin' at us\nCause they knew what's from before\nNow we ain't hurtin' no more\n\"You can bring me the bill, I'll sign my name!\"\nNow we're flyin' private planes and such\nLookin' like a million bucks\n+You Can't Tell Me Nothing!+\n\n[Hook]", "image": "https://images.genius.com/74f6cb8e37420dc73fd4019537e3cbd1.953x953x1.jpg"}], "artist": "Jadakiss"}