{"songs": [{"title": "Hot 107.9 Freestyle, Pt. 1", "album": null, "year": "2012-11-19", "lyrics": "[Verse 1]\nUh, now tell me who it is\nK-Dot, young kid runnin' the music biz\nYou tell me what's worse\nMe bein' the best rapper or rappers dyin' of thirst?\nI'm just like a gun-clapper with these words\nAnd you know I'm packin'\nAnd that word is meant for Janet Jackson\nI'm a black hippy, that's what I know\nI wear a heart black, I love peace, that's my clothes\nAnd so, and I don't know this name\n(Steve Buscemi, he's the actor, man)\nThank you for that ad-lib, G\nNext thing you know, I google him up, it might be me\nI hope he's rich, I hope he's contra\nBand in my pocket, no, I don't have sponsors\nDon't want the police to come in this place\nBecause I might run and I run this race\nThat's in the rap game\nYou got some more words, I go absurd\nI got nouns, I got more verbs, this is the curb\nI swing, my nigs, I flip flows\nI come from the West, I do it the best\nI don't stress, no contest\nAny rapper want to come see with Rickey Smiley?\nYou can't see me, we creep up back of the alley\nAnd beat they ass and take they cash\nAnd then we stab, off in that Jag\nI'm in, uh, celebrity crushes\nI give 'em, they see me, I give them blushes\nI'm talkin' Halle Berry, Stacey Dash\nBut she vote for Mitt Romney\nNo, I don't want that ass\nI'm talkin' Obama, I'm talkin' more drama\nThis another word, your momma\nNah, that's Ebony Steele, that's me, for real\nShe got them long hairs, but she don't wear high heels\nThat means she's confident, that means she's beautiful\nThat mean she got no dirt in the cuticles\nThat means she got that watch\nI mean, she got the shades\nShirley Caesar, left seat, man\nAfter forty years, they'll sweep her in through the city\nThat's like me, that's like Jay Z, Pac and Biggie\nThat like me, that's like rappers don't know where I'm from\nThat's Compton, everybody don't want none\nI got the people in the back straight cheerin'\nI got the eyes wide open just like the deers in front of the", "image": "https://images.rapgenius.com/eceef24e6238f4b9e2964245744e6068.1000x1000x1.jpg"}], "artist": "Kendrick Lamar"}