{"songs": [{"title": "F’n Do It", "album": "N9NA", "year": "2019-04-19", "lyrics": "[Intro: Tech N9ne]\nWhat's with it?\nYeah, yeah, yeah\nYeah, yeah, yeah\nTech N9ne, big shit\nI wasn't planning, no, no\nThis thing is jamming so I can feel it\n\n[Refrain: Tech N9ne]\n(In the air)\nI can feel it, I can feel it (In the air)\nI can feel it, I can feel it (In the air)\nI can feel it, I can feel it (In the air)\nAyy, tonight I wasn't gonna drink, but I'ma do it\n\n[Verse 1: Tech N9ne]\nDo it, do it, 'cause I elevate\nDo it to it 'cause I sell estates\nDo it fluid, I'ma celebrate\n'Cause I rock a lot and pocket hella cake\nIf I don't do it then I delegate\nThen you do it while I get my fella ate\nThen I gel her face\nDamn, the Tech is undetected like when you don't smell a vape\nWe the party\nSmoke a lot of weed, B. Marley\nIf you meddle with the cheese, he tardy\nTime to kill, indeed, see Carly\nI don't be playing, I'ma be spraying\nFuck with the N9na, your body decaying\nHold up, we talking 'bout drinking, yo, what am I thinking?\nThis 'Bou Lou thing is really paying\nI knew it (Hell yeah), I pursue it (Fuck yeah)\nHit the hammer, have 'em hit a Howard Hewett (Huh, huh)\nDon't misconstrue it, at first I said I wouldn't drink no fluid\nBut I couldn't resist, I blew it\n\n[Chorus: Tech N9ne]\nTonight I wasn't gonna drink, but I'ma do it\nAyy, ayy, fucking do it\nTonight I wasn't gonna drink, but I'ma do it\nAyy, ayy, fucking do it\nTonight I wasn't gonna drink, but I'ma do it, do it, do it\nWhat you waiting on?\nDo it, do it, do it\nWhat you waiting on?\nDo it, do it, do it\nWhat you waiting on?\nDo it\nTonight I wasn't gonna drink, but I'ma do it\n\n[Verse 2: Futuristic]\nWhatever I wanna do\nSwimming in liquor like pools\nI get to the business, my digits, I flipped 'em\nNo really the kid making moves\nI do it like checks on my shoes\nI don't notice when checks coming through, yeah\nShe give me long neck like giraffes\nI swear that they head from the zoo\nTold Tech gotta keep up\nShots to the chest, goddamn, make it heat up\nSomebody talking I put 'em right in the carpet\nIf they starting a problem, I call Muggs, they get beat up\nTold him he got four more for sure\nFlow cold, snow-globe\nMore slope out my mag, that's how I treat them\nHit 'em with a Speedom\nHe didn't wanna do it, but I got a little fluid in me, so a nigga eat 'em\nI'm on Ciroc or the Henny, yeah\nHow much you got? I got plenty, mmh\nShe from the block just like Jenny, yeah\nSwear that I'm on with no penny, mmh\nThat's a fact or a Vinnie (Yup)\nHit it from the back when I'm cracking a jimmy (Yup)\nAss look fat, then I smack when I'm hitting, get it?\n\n[Chorus: Tech N9ne & Futuristic]\nTonight I wasn't gonna drink, but I'ma do it (Do it)\nAyy, ayy, fucking do it (Do it)\nTonight I wasn't gonna drink, but I'ma do it (Do it, yeah)\nAyy, ayy, fucking do it (Do it)\nTonight I wasn't gonna drink, but I'ma do it (Do it), do it (Do it), do it (Do it)\nWhat you waiting on?\nDo it (Do it), do it (Do it), do it\nWhat you waiting on?\nDo it (Do it), do it (Do it), do it (Do it)\nWhat you waiting on?\nDo it (Do it, do it)\nTonight I wasn't gonna drink, but I'ma do it\n\n[Verse 3: JL]\nI'ma just have one, make it a double\nI'ma just sip mine, I'm tryna stay out of trouble\nHere's to humble beginnings, then I'm done after this\nOr I'm having mixed drinks about feelings now, damn, ain't that about a bitch?\nSaid they cut off of all beverages\nRight back at it like a bad reader\nGet shitfaced like an ass eater\nYou can tell that I'm blown like a bad speaker\nHappy to sag with it out, savvier\nGot bad habits, I'm a gas leaker\nHad a half from 'em, looking magnesia\nBut don't have what she's had, 'nother bag eater\nCan I get a cold 'Bou Lou in a coozie?\nJack D, back to back shots of Coolie\nThen chugging the backwash of a brewski\nGet the crew, we grouping with a doobie\nWith the shits, bro, get to it\nGet twisted with the whole hood\nOnce it hits your lips, it's so good\n\n[Chorus: Tech N9ne]\nTonight I wasn't gonna drink, but I'ma do it\nAyy, ayy, fucking do it\nTonight I wasn't gonna drink, but I'ma do it\nAyy, ayy, fucking do it\nTonight I wasn't gonna drink, but I'ma do it, do it, do it\nWhat you waiting on?\nDo it, do it, do it\nWhat you waiting on?\nDo it, do it, do it\nWhat you waiting on?\nDo it\nTonight I wasn't gonna drink, but I'ma do it", "image": "https://images.genius.com/8ebb9cdb1a785ebf6dcf120453e6e9aa.1000x1000x1.png"}], "artist": "Tech N9ne"}