{"songs": [{"title": "Announcement", "album": "Universal Mind Control", "year": "2008-12-09", "lyrics": "[Intro x3: Common]\nI'm finna take you to the tip-top, baby\n\n[Hook: Common]\nEverybody, I'd like to announce\nThrow your hands up when we in the house\nYeah, this is hip hop, baby\nI'm finna take you to the tip-top, baby\nAnd tell your girl that the tickets is out\nAnd we gonna do this 'til they kickin' us out\nCause, this is hip hop, baby\nI'm finna take you to the tip-top, baby\n\n[Verse 1: Common]\nLive from the south side, this one, hide your gun\nRepresenting Chi Town to the fullest, raps are bullets\nSee them rappers? They be duckin'\nWhen Comm be buckin' in the kitchen, fuckin'\nOn the sink, got my momma a mink\nThink Common is the link\nThought the game was extinct\nLady, them jeans is as slim as Shady\nBrought them back from the 80's\nNow, let's make some babies\nFreestyle paid off so Lincoln paid me\nNow we can push more whips than slavery\nAlex Haley of this rap shit, my roots is deep\nYou heard the bitch in you, yeah I know what's beef\nLet it cook and I pop like grease\nYou thirsty niggas can't shock my feast, ugh\nI still love her, she be needin' the dick\nWhen it comes to hip-hop, it's just me and my bitch\n\n[Hook]\n\n[Verse 2: Pharrell]\nBaby, you're like, \"What the-- fuck? There is no other\"\nValet crashed my Rolls so quickly I bought another\nSorry, Mr. Williams moved out the building\nSpot to the top, 50 feet was the ceiling\n(Slow down, son, you're killin' 'em) Well funded it was not gangsta\nCame to shitty deals, reminiscing gives me chills\nWhen Puff was with Biggie, Versace on every niggie\nThe backpacker copped the Porsche and drove through his city\nNow, all the little bitties, from ugly to pretty\nI was the magician, mesmerize 'em, made 'em listen\nMy dick is like a blow-pop baby\nAnd it get stiffer than some Botox baby\nBut show out baby, and show me you gon' act right\nAnd I'll be pedaling backwards like a track bike\nShe don't know the Casio cost a hundred\nIt's been two years since I done it, now all the rappers want it\nWhat?\n\n[Hook]\n\n[Verse 3: Common]\nAs I sit back, relax with Chicago on my back\nUnzip the backpack, pull out a fifth of 'gnac\nI probably go to jail but naw, that ain't me\nI style crazy and net like Jay Z\nThe black Kojak \"I get money\" and want more stacks\nThe rap photographer, the way the flow snap\nBroads say, \"Are you a philosopher?\"\nYea yea, I'll philosophize on top of ya\n\n[Hook]", "image": "https://images.genius.com/5e77fbc81fc58bc396f33872fc1ec855.1000x1000x1.jpg"}], "artist": "Common"}