{"songs": [{"title": "I’m Drunk", "album": "Streetlights  ", "year": "2010-04-20", "lyrics": "[Intro]\nHi whats up girl its oh its craking up in here girl what ?\nLook at him there\nLet me put the titties out a lil bit\n\n[Chorus:J. Black]\nI think that I’m drunk (girl :is that kurupt over here? gurlll)\nI think that I’m drunk\nI think that I’m drunk\n\n[Verse 1:Kurupt]\nBitch I think I’m drunk\nGirl: I don’t think he with nobody\nI’ve been drinking all nite and I think that I’m bout to fall down\nI think that I’m drunk\nIts been shot after shot and I think that I am feeling them all now, bitch I think I’m drunk\nI think that I’m drunk\nHalf a bottle to the face fore I feel in\nMy insides yellin\nI think that I’m drunk\nI need to get to the bathroom room check my pocket for my money feeling nutty its cashew damn\nBitch you got a fat ass smack it like Fat Al fuck it bitch I think I’m drunk\nAnd now don’t give a fuck about nothing\n\n[Chorus:J. Black]\n\n[Verse 2:Kurupt]\nAnd this room won’t stop moving I'm going in circles off a purple with two shrooms\nCall a chick that I know tell her and her two roomies to do me O E. If they ain't down fuck it\nPlenty of chicks and slucking tonight when the patron is up  in them right rope em to a bar she  like\n(nigga what’s wrong witchu) bitch i think I’m drunk\nThen get the fuck out my way\n\n[Chorus:J. Black]\n\n[Verse 3:Kurupt]\nI think that I’m drunk\nA couple steps closer to the end of the nite the feeling is right is right\nI think that I’m drunk\nThe fat  girl look like Janet Jackson with yo thick as girl shit\nI think that I’m drunk\nI must be outta my mind she ain't fine but fuck it shit\nOnly thing I give a fuck about about fuck\n\n[Chorus:J. Black]\n\n[Outro:Snoop Dogg]\nThis is a public  service announcement from the dpgc", "image": "https://images.genius.com/48a18f242c2b2fb8c91b44110a454db4.600x600x1.jpg"}], "artist": "Kurupt"}