{"songs": [{"title": "Rain", "album": null, "year": "2011-11-21", "lyrics": "[verse 1]\nI hate when it rains\nAll I really do is sit on my ass\nThinking about the next scheme just to double my cash\nIf I ain't thinking about cash, nigga\nI'm thinking about life\nMaking a change, no winners do the same shit twice\nRainy days are a pain just rest on my veins\nCan't go to sleep somebody's looking through my window pane\nMan, I swear I'm going catch em'\nBut maybe I'm trippin\nLike Scarface, my mind's playing tricks on me homie, will it\nRain, shit! I just wanna know where Do is\nIs he safe, warm and out the elements, mommy let him come home\nI think a niggas done doing wrong\nI get scared of the day when the soul will be gone\nThe spoken words to thoughts, never be spittin' in vain\nSeems like the only way to sunshine is through the hard rain\nI need to find a path leading to change\nAsk God if he feels my pain\nAnd please, won't you stop the rain?\n\n[Hook]\nPlease Stop The Rain\nAsk God If He Feels My Pain\nPlease Stop The Rain\nAsk God If He Feels My Pain\n\n[verse 2]\nRain clouds started forming\nGathered around my father's homecoming\nWhen his soul on this earth was summoned\nI remember a white church\nAnd my lips had a salty taste\nFrom the tears running down my face\nCan't erase the hurt\nWatchin' my father's body lowered in dirt\nWhile my uncle and cousin passed too\nWhat's life worth?\nIf it rained\nSometimes I would just sit there and cry\nAt recess, didn't wanna play, I just wished I would die\nThings\nRushed through my head back when I was eleven\nPraying and hoping that my dad had made it to heaven\nIt was hard being the youngest\nAnd no one helped me\nEverybody seemed happy\nAnd no one felt me\nBut regardless of the fact\nI did the best that I can\nMaking the transition from boy\nStraight to a grown man\nBut understand, I felt the shame\nAnd I feel the same, that God just needs...\nTo stop the rain\n\n[Hook]\nPlease Stop The Rain\nAsk God If He Feels My Pain\nPlease Stop The Rain\nAsk God If He Feels My Pain\n\n[verse 3]\nBack then I was young\nNow I'm grown here to fend on my own\nI'm speaking and bringing the truth through this lyrical poem\nAnd it's hard cause these niggas can't see...\nOpen up your eyes you can recognize me\nI felt the rain like every other nigga did\nNigga always slip and stand up so I slid\nIt's part of the life\nWhile every thing seems trife\nAnd everything wrong very well may be right\nIt's just confusing and some people can't handle\nThere mind breaks down, and their hearts start to dismantel\nBut I'm that boy to use to have the evil dreams\nNow I realize that this life is way more then it seems\nIt's just somthin you learn on the daily as your mind matures\nCan't ruin the life with a heart so pure\nAnd since I realize that things won't change\nGod you can keep with the same\nCause I'm a just deal with the rain!\n\n[Outro]\nI'm a Deal With The Rain\nTell God Just To Keep It The Same\nI'm a Deal With The Rain\nTell God Just To Keep It The Same](3113461)\n\n[Kid Cudi: Mumbles]\nOk. Whys that? You know in Cleveland it rains, not all the time but, to a kid who wants to go out and play, it seems like it rain everyday. Kids expect it too rain sometimes but, one kid it rained to much", "image": "https://images.genius.com/57fc91d7548f4e591a971ea7f5443a88.355x355x1.jpg"}], "artist": "Kid Cudi"}