{"songs": [{"title": "Higher", "album": "The Documentary", "year": "2005-01-18", "lyrics": "[Bridge]\nIt's not that I can't stop, it's that I won't stop\nI'll make it hot (I do it)\nI'll be on top, as soon as the beat drop\nI'll make the whole club rock (I do it)\n\n[Verse 1]\nLace my Air Ones up, put my gun up\nI don't need that, I'm ridin wit Dre\nWho don't love us, every hood throwin they dubs up\nWho the fuck y'all thought was comin' after Young Buck?\nHip-Hop's worst nightmare\nMr. Gangsta Rap is back in black Nike Airs\nYou want war, we can settle it right here\nI got a squad, E-V-E and Busta Rhymes yeah\nOr you could give me ya bitch, her with the light hair\nSit her next to these yellow bottles, yeah right there\nMatter fact I'll take you in the back\nYou in the hat, and you in the blue and the black\nLet's have a gangsta party\nSomebody lean over and tell Banks to order another case of 40's\nYo Doc give 'em a Coke with that\nWake up the West coast is back\n\n[Hook]\n(I can take you higher)\nShow you how that low rider bounce off the flo' - You ain't know?\n(I can take you higher)\nIt's the motherfuckin chronic nigga that's whassup - roll that blunt\n(I can take you higher)\nG-Unit, Shady, Aftermath I'm the motherfuckin Game and\n(I can take you higher)\n\n[Bridge]\nIt's not that I can't stop, it's that I won't stop\nI'll make it hot (I do it)\nI'll be on top, as soon as the beat drop\nI'll make the whole club rock (I do it)\n\n[Verse 2]\nLike Dre did\nI created a buzz without a single like N.W.A. did\nFrom the hood liquor store to the state pen\nThis is Gin & Juice to Doc\nMake the club R.O.C. without Timberland boots\nFirst nigga to put 'draulics on a Bentley Coupe\nYou wanna pimp? I'll perm my shit up like Snoop (Ah, Westside)\n\"Chronic 2005\" muh'fucker\nPut the purple in the dutch \"Let it Burn\" like Usher - girl\nDrop down, do the eagle, fuck that\nReal niggas just pull up they pants and lean back - girl\nMake 50 spill his Crist', he'll call you a bitch\nI'mma call you and hit\nYou can call ya girlfriend, we can make it a flick\nI got the lollipop if you wanna lick\nOr you can take a ride on the magic stick\n\n[Hook]\n(I can take you higher)\nShow you how that low rider bounce off the flo' - You ain't know?\n(I can take you higher)\nIt's the motherfuckin chronic nigga that's whassup - roll that blunt\n(I can take you higher)\nG-Unit, Shady, Aftermath I'm the motherfuckin Game and\n(I can take you higher)\n\n[Bridge]\nIt's not that I can't stop, it's that I won't stop\nI'll make it hot (I do it)\nI'll be on top, as soon as the beat drop\nI'll make the whole club rock (I do it)\n\n[Verse 3]\nPut 25's on a Hummer, why not?\nI'mma be here for the next 10 summers\nDrop me in the 4th quarter I'm fuckin up they money\nI don't need SoundScan I'm doin my own numbers\nWhen that Impala bounce you can see the chrome under\nI got 'em in every color, yeah I'm a known stunner\nWhen I hit a switch I get higher than long jumpers\nLowridin with a hood rat or a grown woman\nI'll do anything - but I won't fuck Mariah\nEven if she had Ashanti butt naked in bed\nCause she got a fo'head just like Tyra\nI can say what the fuck I want\nYou thought Dre retired, left me a six-fo' and his Dayton wires?\nThese niggas is a waste of rhymin\nDoc got somthin to say be quiet\n(Look out for Detox)\n\n[Hook]\n(I can take you higher)\nShow you how that low rider bounce off the flo' - You ain't know?\n(I can take you higher)\nIt's the motherfuckin chronic nigga that's whassup - roll that blunt\n(I can take you higher)\nG-Unit, Shady, Aftermath I'm the motherfuckin Game and\n(I can take you higher)\n\n[Bridge]\nIt's not that I can't stop, it's that I won't stop\nI'll make it hot (I do it)\nI'll be on top, as soon as the beat drop\nI'll make the whole club rock (I do it)", "image": "https://images.genius.com/22cd8590c857561376ad7ae9f6ac4caa.300x300x1.jpg"}], "artist": "The Game"}