{"songs": [{"title": "Thug Nature", "album": "Too Gangsta For Radio", "year": "2001-09-26", "lyrics": "[Intro]\nOne, two\nTo a nigga nature\nHehe\n\n[Verse 1]\nNo need to cry now, go wipe your tears\nBe a woman, why you actin' surprised?\nYou showed the bullshit; commin' fake hair\nFake nails, fake eyes too\nSo why you bound to fuck wit fake guys too\nAin't nothin' hard about it\nWhy you lookin' sad, should'a though about it\nSay you learn, I truly doubt it\nI guess you got a problem with affection, kinda loose with the love\nGettin' freaky with the thug niggas up in the club\nAsk to buy you a drink, you holla \"Dom Pérignon\"\nKnowin' I'm a cash dealer, still I, remain calm\nLet you chill with me\nPlus you was smilin' 'til the bill miss me\nThat's what you get for trynna dick me\nMissed me with that \"buy me this, buy me that\"- syndrome shit\nBitch get a job if you wanna be rich\nGettin' mad 'cuz I cursed and I screamed I hate ya\nIntroduced you to a nigga nature, feel me\n\n[Hook]\nWhy, why, tell 'em that it's my good nature\nWhy, why, when I do that way\n\n[Verse 2]\nProbably too nice at first\nI lettin' you kiss where it hurts\nMe and you gettin' busy, slangin' dick in the dirt\nMet you at a pool party it was cool to kick it\nSee us, toungkissin', you was truly with it\nLittle Ecstasy, Hennessey, mix with me\nPicture me pray for pussy when the dick's for free\nHey now, where my niggas at? Tell these hoes\nBefore I pay; I jerk off, word to Moses\nVisions of you sittin' there sweaty and wet\nPointin' at the places that you want me to hit\nGive me room all up in the room, call the cops\nNigga, hit them walls til the bastard drop\nLabel me: Makaveli - Thug Nigga with pipe\nLivin' life as a Rock Star friday nights\nMake money, get pussy\nAlways keep a pager, cell-phone in the ride\nTo complete my Nature now!\n\n[Hook]\nWhy, why, tell 'em that it's my good nature\nWhy, why, when I do that way\n\n[Verse 3]\nStarted as a seed from the semen\nStraight outta Papa's nuts, lustin' for creamin'\nBitches wit big butts, curves make a nigga cry, tits and shit\nWhen I'm locked down beggin' you for porno fleeks\nSneak weed in, helped a nigga passed the time\nWith my name tattoo'd so that ass is mine\nTell everybody; 'Pac put it down for good\nA local legend through the whole hood\nFollow me, I got a gun on me\nGoin' for nun on the run baby\nYou know a nigga need some, is my son crazy?\nWhy I cry, when I be thuggin' til I die\nPicture of nigga in heaven high, of weed I fly\nGot me missin' dead homies with the phonies that died\nHit the weed and hope it get me high\nDear God, understand my ways, livin' major\nBlessed with a thug's heart\nIn a realla nigga nature!\n\n[Hook]\nWhy, why, tell 'em that it's my good nature\nWhy, why, when I do that way\nWhy, why, tell 'em that it's my good nature\nWhy, why, when I do that way\n\n(Just be a nigga nation)\n(It ain't my fault, that's a nigga nature)\n(A nigga nature)", "image": "https://images.genius.com/14e984aec88403a945fccc38301ef8be.500x500x1.jpg"}], "artist": "2Pac"}