{"songs": [{"title": "Lord Knows", "album": "Me Against the World", "year": "1995-03-14", "lyrics": "[Intro: 2Pac]\nDamn, another funeral, another motherfucker\nLord knows\n(Coughing)\nLord knows\n[Coughing harder]\nLord knows\n[One final cough]\n\n[Verse 1]\nI smoke a blunt to take the pain out\nAnd if I wasn't high, I'd probably try to blow my brains out\nI'm hopeless, they should've killed me as a baby\nAnd now they got me trapped in the storm, I'm goin' crazy\nForgive me; they wanna see me in my casket\nAnd if I don't blast I'll be the victim of them bastards\nI'm losin' hope, they got me stressin', can the Lord forgive me\nGot the spirit of a thug in me\nAnother sip of that drink, this Hennessey got me queasy\nDon't wanna hurl, young nigga take it easy\nPicture your dreams on a triple beam, and it seems\nDon't underestimate the power of a fiend\nTo my homies on the block\nSlangin' rocks with your Glocks put this tape in your box\nWhen you're runnin from the cops—and never look back\nIf they could be black, then they would switch\nOpen fire on them busta-ass bitches, and Lord knows\n\n[Hook]\n(Lord knows, Lord knows, Lord knows!)\nLord knows\n[Coughing again]\n(He knows! Lord knows, Lord knows, Lord knows!)\nThe Lord knows\n[Still coughing]\n(He knows! Lord knows, Lord knows, Lord knows!)\nThe Lord knows\n(He knows! Lord knows, Lord knows, Lord knows!)\n\n[Verse 2]\nI wonder if the Lord will forgive me or bury me a G\nI couldn't let my adversaries worry me\nAnd every single day it's a test, wear a bulletproof vest\nAnd still a nigga stressin' over death\nIf I could choose when a nigga die, figure I'd\nTake a puff on the blunt, and let my trigga fly\nWhen everyday it's another death, with every breath\nIt's a constant threat, so watch yo' step!\nYou could be next if you want to, who do you run to?\nMurderin' niggas, look what it's come to\nMy memories bring me misery, and life is hard\nIn the ghetto, it's insanity, I can't breathe\nGot me thinking, what do Hell got?\nCause I done suffered so much, I'm feelin' shell-shocked\nAnd driveby's an everyday thang\nI done lost too many homies to this motherfuckin' game\nAnd Lord knows\n\n[Hook]\n(Lord knows, Lord knows, Lord knows!)\nLord knows\n[Coughing again]\n(He knows! Lord knows, Lord knows, Lord knows!)\nThe Lord knows\n[Still coughing]\n(He knows! Lord knows, Lord knows, Lord knows!)\nThe Lord knows\n(He knows! Lord knows, Lord knows, Lord knows!)\n\n[Verse 3]\nOne-time! One-time!\nFuck the 5-0 cause they after me\nKill me if they could, I'll never let 'em capture me\nDone lost too many niggas to this gangbangin'\nHomies died in my arms, with his brains hangin', fucked up!\nI had to tell him it was alright, and that's a lie\nAnd he knew it when he shook and died, my God\nEven though I know I'm wrong man\nHennesey make a nigga think he strong, man (heh heh)\nI can't sleep, so I stay up, don't wanna fuck them bitches\nTry to calm me down, I ain't givin' up\nI'm gettin' lost in the weed, man, gettin' high\nLivin' every day, like I'm gon' die (gon' die, gon' die)\nI smoke a blunt to take the pain out\nAnd if I wasn't high, I'd probably try to blow my brains out\nLord knows\n\n[Outro]\n(Lord knows, Lord knows, Lord knows!)\nLord knows!\n(He knows! Lord knows, Lord knows, Lord knows!)\nLord knows.. Jesus..\n(He knows! Lord knows, Lord knows, Lord knows!)\n(He is listening! Lord knows, Lord knows, Lord knows!)\n\n(Lord knows.. Lord knows.. he he.. he.. he.. heeee...)\n(Lord knows, Lord knows, Lord knows!)\n(Lord knows, Lord knows, Lord knows!)\n(Lord knows, Lord knows, Lord knows!)\n(Lord knows, Lord knows, Lord knows!)", "image": "https://images.genius.com/aa900ef68a5861f06835ba38e4e6d764.640x640x1.jpg"}], "artist": "2Pac"}