{"songs": [{"title": "Can’t Go Wrong", "album": "Space Boogie: Smoke Oddessey", "year": "2001-07-17", "lyrics": "[Verse 1: Kurupt]\nThe reason that I'm here, I'mma drop 'til it's clear\nLet off...K's to front, middle and rear\nSwitches couldn't switch like these switches a day\nJust to sit and sippin' and dippin' all over the ways\nThat they ears and chairs, dis on this years\nCokes drippin' off juice and gins\nAs a matter of fact, takes matter of fact\nTo duplicate the great, y'all get played like a sax\nTrumpet or trombone...\nToo shotty Young Gotti, millennium bone\nIf she raggedly, I'm sendin' 'em home\nPuttin' 10 in the chrome, lettin' all ten to the dome\nIt don't quit (don't quit), it don't stop (don't stop)\nLet the beat knock (the beat knock)\nLet the beat knock (the beat knock)\nPull up at the spot, pull up at the stop\nIn a drop top gettin' what I got, I just...\n\n[Hook: Butch Cassidy]\nCan't go wrong, releasing all my thoughts through songs\nDon't give a damn on the real, I'll say just what I feel\nDon't matter what you say, I'll never stop, I'll bust all day\nNo time for delay, I'll do it my way\n\n[Verse 2: Kurupt]\n(Kurupt, what up?) I'mma drop 'til it's clear\nIn these ravines and ponds, it's Vietnam time\nTossin' C-notes, the \"Magnificent Magneto\"\nDippin' through, comin' like ay!\nDon't expect nothin' less, D's gleam on the tray\nAll night and all day, it's the best in a 2001 SS\nIt's the prince of the West\nI ain't tryna do much, tryna do too much\nI ain't even really trippin'\nIt's just me, Snoopy and Quik and\nSomeone like you with the biggest mouth to put a dick in\nMost of y'all malfunction like faulty equipment\nShifted, drifted, different, uplifted\nKurupt Young Gotti, just call me Paul Vitti\nWith the skirts from Tahiti workin' at the mall\nWith young Roscoe, you fool and hostile\nI just tuck my roscoe, the Apostle's colossal, I...\n\n[Hook: Butch Cassidy + (Kurupt)]\nCan't go wrong, releasing all my thoughts through songs\n(Just don't stop)\nDon't give a damn on the real, I'll say just what I feel\n(Bounce them switches)\nDon't matter what you say, I'll never stop, I'll bust all day\n(Cause I'mma bust all day)\nNo time for delay, I'll do it my way (Yeah)\n\n[Verse 3: DJ Quik]\nYes\n1, 2, fuck wit my crew\nAnd we won't stop poppin' 'til ya body turn blue\n3, 4, look at that whore\nWith the fat ass, but without the cash, hit the door\nThe reason that I'm here: Kurupt done bought the beer\nI'mma lush, lookin' for the kush\nLookin' for the bush to push and mush back\nI'd hump the ho if she ain't been needin' a douche bag\nNo, must've been the coochie with hair that's pushed back\nIn a bun lookin' fun\nGettin' silly with my celly from Philly\nBrought to you by way of 2-1's\nWe smuggle in and out of the place our two guns\nCourtesy of Q-U-I, Dogg Pound collabos, yup\nWe stab hoes in the bladder actin' bad with the mad hoes\nGet out! Yeah! Look here!\nWe started this pussy shit (No shit)\nAnd these the mothafuckin' hoes we get? Come on!\n\n[Hook - 2x: Butch Cassidy]\nCan't go wrong, releasing all my thoughts through songs\nDon't give a damn on the real, I'll say just what I feel\nDon't matter what you say, I'll never stop, I'll bust all day\nNo time for delay, I'll do it my way\n\n[Intro to On, Onsite: Xzibit]\nAight y'all this a mothafuckin' public service announcement\nFrom Mr. X to tha mothafuckin' Z Xzibit\nMy homeboy Kurupt, to all you half ass mothafuckas comin' around\nPussy ass niggas! tryin' to see what's up wit my homboy\nAnd see what's up wit me, nigga is he this, is he that\nNigga I'm a mothafuckin' killa and it's like this nigga\nIf I had a doller fo' every time you bitch ass niggas\nCame around and didn't do shit, I'll be a billionaire right now\nPut up or shut up mothafuckas, it's like this, it's on, onsite\n\n[*Xzibit scrieking*]", "image": "https://images.genius.com/32f5907a0f69c52bd9d20ec857b3f90c.944x944x1.jpg"}], "artist": "Kurupt"}