{"songs": [{"title": "Everywhere I Go", "album": null, "year": null, "lyrics": "[Voice sample from Star Trek V]\nI couldn't help but notice your pain\n[My pain?]\nIt runs deep\nShare it with me!\n\n[Verse 1: 2Pac:]\nThey'll never take me alive\nI'm gettin' high with my four-five\nCocked on these suckas, time to die\nEven as a youngster causin' ruckus on the back of the bus\nI was a fool all through high school kickin' up dust\nBut now I'm labelled as a trouble maker who can you blame?\nSmokin' weed helped me take away the pain\nSo I'm hopeless\nRollin' down the freeway swervin, don't worry\nI'm about to crash up on the curb, cause my visions blurry\nMaybe if they tried to understand me\nWhat should I do?\nI had to feed my fuckin' family\nWhat else could I do?\nBut be a thug\nOut slangin' with the homies\nFuck hangin' with them phonies in the clubs\nGot my mind on danger\nNever been a stranger to homicide\nMy city's full of gang bangers and drive-bys\nWhy do we die at an early age?\nHe was so young\nBut still a victim of the 12 gauge\nMy memories of a corpse\nMind full of sick thoughts\nAnd I ain't goin' back to court\nSo fuck what you thought\nI'm drinkin' hennessey\nRunnin from my enemies\nWill I live to be 23?\nThere's so much pain\n\n[Hook]\nEverywhere I go\nI see the darkness\nCovering skys\nEverywhere I go\nEverywhere I go\nTrouble seems to find me\nBlood in my eyes\nEverywhere I go\n\n[Verse 2: Game:]\nWhat would you do, if you couldn't make it to the NBA?\nWhat would you do, if you couldn't sing, like a Mary J?\nWhat would you do, if you couldn't hit a white ball, like Tyga?\nIf you wanted to model, but you wasn't skinny like Tyra?\nWhat if you wanted to be Eminem\nBut the closet thing to him, was a pack of M&M's?\nYou can be Eminem, and I got proof\nOr you could be Obama, and bring back troops\nOr you could be Osama, and tear off roofs\nOr be Corporate America, and reject all youth\nBe the fly on the woodgrain, inside my Coop\nOr be the sole, inside my shoe\nSo you can see where I walk, you can see where I been\nSee my father raping my sister when she was just ten\n9, 8, 7, 6, NASA take me away, life's a bitch\n\n[Hook 2]\nEverywhere I go\nTrouble seems to find me\nBlood in my eyes\nEverywhere I go\n\n[Verse 3: 2Pac]\nThey got me mobbin' like I'm\nLoc'ed and ready to get my slug on\nI load my clip and slip my motherfuckin' gloves on\nI ain't scared to blast on these suckas if they test me\nTrust, I got my Glock cocked playa if they press me\nBust on motherfuckers with a - paaassion\nBetter duck cause I ain't lookin when I'm - blaaastin'\nI'm a nuttin, drinkin' Hennessey and gettin' high\nOn the lookout for my enemies\nDon't wanna die\nTell me why cause this stress is gettin' major\nA buck-fifty across the face with my razor\nWhat can I do but be a thug until I'm dead and gone\nKeep my brain on the game and stay head strong\nThese sorry bastards\nWant to kill me in my sleep but will they can I see\nAnd everyday it's just a struggle\nSteady thuggin' on the streets\nAnd I'll be ballin' loc\nDon't let 'em make you worry\nKeep swingin' at these suckas till you buried\nI was born to raise hell\nA nigga from the gutta\nWord to mutha I'm tough\nI'm kickin dust up\nReady to bust\nI'm on the scene steady muggin' mean\nUntil they kill me\nI'll be livin this life\nI know you feel me\nThere's so much pain\n\n[Hook 2]", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}