{"songs": [{"title": "D.O.G.S.", "album": "Doc’s da Name 2000", "year": "1998-12-08", "lyrics": "Ha ha ha\nTokin on my indo..\nSmokin on a indo..\nLookin through your window.. (chi-chi, blaow!)\nDoin what I win doe, ha ha, ha.. it goes\nWho that tokin on my indo? Pow!\n\nFragile niggas get mashed out\n(Who dat?) The Funk D-O-C Spock hash mouth rhymer\nThe Prime Timer, sharper than barber shop liners\nLook at my chin - ninety degree bent\nWhen I spit I make devils come out Yves Saint Laurent (Djinn)\nI spend so much money on chalk and the indo\nMy weed supplier need to build a drive through window\nMy form of art rock, jewels with Clarks\nWhen my bass sparks for fiends it disturbs the NARCs\nFreak pattern after pattern to leave Angeles Los\nThe roughest rapper a DJ needle came across\nKnock it in your Hummer; if it's too hot dial 9-1-1\nHook off on you like I Know What You Did Last Summer\nYour dog is my dog, we dogs when it's thug time\nWhen the fuckin hoes keep that drow in your bloodline\n\nYo, I send this to all my DOG\nTo my real niggas that are true DOG\nNiggas who will bust guns for they DOG\nNiggas who will spit ones for they DOG\nNiggas who be rollin deep with they DOG\nNiggas who blaze blunts with they DOG\nNiggas who would do time for they DOG\nNiggas who would diss a bitch for they DOG\n\nYo I'm a dog\nI piss on the wall in airport bathroom stalls\nGrab the intercom and yell, \"Fuck you!\" in the mall\nI drop it with the holocaust force, I got balls\nI get my pants fitted twelve inches bigger than y'alls\nI went to college, rockin' Taiwan velour outfits\nDropped out, but stuck my friends for college deposits\nNigga, get a country nigga gun bustin\nLike they saw 2Pac with two Glocks still thuggin\nFuckin with a dog like me, I call your name out\nWhile you pussy niggas Call ID, when I blaze\nYou step life your wifee got a baby on the way\nThe way I flex son you think I'm made out of clay\nI'm illin, my lyrics on the blocks make the killings\nI string your moms out until DYFS take the chillen'\nI don't like to toot my own horn but I'm the shit\nAnd if you hearin me I see you paid that twelve cent\n\nSo peace to homey $hort DOG\nPeace to that funky nigga Snoop DOG\nPeace to that old nigga Dirt DOG\nPour some beer out on the curb for your dead DOG\n\n...\n\nYou can call a female a dog too (true)\nYou can feed they stinkin ass u-canu-bu, DOG\nThey fuck your enemies and bring the beef to you\nYou got me, I left a couple in your Fubu\nA real raw dog never get jealous\nThey keep they shit cocked if niggas try to dead em\nSo ask 'Face, keep your mind on your money\nI keep the stinkin ass hoes doin laundry DOG\n\nCause I'm a dog", "image": "https://images.genius.com/ff1bcd7d83855df13cac08a00e033052.594x594x1.jpg"}], "artist": "Redman"}