{"songs": [{"title": "Sugar", "album": "Back on My B.S.", "year": null, "lyrics": "[Intro: Busta]\nYeah, ay baby\nPut your hand on my heart\nTell me if you ever felt a heartbeat like this, like this (like this)\n\n[Hook: Jelly Roll]\nBoom boom boom boom boom!\nIs the sound that you hear from my heart beatin hard like a bass drum\nZoom zoom zoom zoom zoom!\nAs my blood starts to race through my veins, all I want is to be close to you\nI like you in those boots, you know just what to do\nGirl let me see those tattoos, I'm gon' ride with you\nRight here's the perfect place, for me to kiss and fuck you\nI can't wait to taste your, sugar!\n\n[Busta Rhymes]\nI wanna taste your body (yeah) I wanna taste your face\nWanna taste your breasts, taste below your waist (uh-huh)\n{*slurps*} That's some of my many wishes\nFresh out the bubble bath girl, you taste so delicious\nFrom when you leave to go to work and how you blow me kisses (yes!)\nThe way you come back to the crib and cook and wash the dishes (right)\nIt's kinda hard to fight it, once the fire is ignited\nYou feel my heartbeat baby? You got me so excited\n\n[Hook]\n\n[Busta Rhymes]\nI can't explain the feelin, it's such an amazin thing\nYou're like a prize possession (man) a gift to any king\n(Aw shit girl) My wings, is only here to protect us (uh-huh)\nNo matter what we go through (no matter what) and how it might affect us\nTired of the lectures, a piece to tell me chill\nBut they don't really understand, what I'm tryin to build (I got you)\nBut I brush it off as nothin, baby let me tell you somethin (listen)\nEvery single time I see you my adrenaline be rushin\n\n[Hook]\n\n[Jelly Roll]\nYou're body's smokin' like a Newport, better yet a Backwood\nYou like it in the backseat cause baby girl you're that hood\nI've never had it how you put it on me (on me)\nThe way you move is makin me horny (horny)\nBut I just wanna kiss ya, all over your body\nStretch you like Pilate's, baby let's get naughty\nDoin how we do, fuckin all around the house\nStarted on the bed and ended up on the couch\n\n[Busta Rhymes]\nDamn, I touch you and you touch me, we get closer\nAnd ya hold me like you're holdin on for dear life, boldly\nAnd we go out on the balcony and let our bodies wrap up\nAnd we fuck until the sun come up, housekeeping come and catch us\nI don't care though, you takin it, I'm givin it and breakin\nEverything up in the room like a tornado in the makin\nAnd I'm lovin and embracin baby let me take you down\nAnd while you give it to me let me give it back girl listen to the sound\nAs it goes\n\n[Hook]", "image": "https://images.genius.com/39d2d4f1bba15212af6b346af49c7ff2.1000x1000x1.jpg"}], "artist": "Busta Rhymes"}