{"songs": [{"title": "Ladies", "album": "The Warm Up", "year": "2009-06-15", "lyrics": "[Intro]\nYeah, hey, look\n\n[Verse 1]\nWhen she talk she so closed-minded\nAll she wanna do is shop, she so clothes minded\nWanna cop the latest 'fore them other hoes find it\nMaterial girl yet somehow I don't mind it\nProbably 'cause she so fine it'll blow your mind\nShe black and Pocahontas, laid back and blow that chronic\nAss so fat, wanna tat my logo on it\nSo any other nigga that a tap will know it's mine\nI put in work overtime\nLet me cut, mow the lawn, guarantee I blow your mind\nShe tried to play me 'til she learned I wrote a rhyme\n\"That's that nigga from the Ville that I heard that Hova signed\nThe rap form Lebron, oh girl, that boy the bomb\nNo chain around his neck, but better watch out for the charm\"\nYou're not my daughter, um, but you can be my baby\nSummertime, wintertime, anytime we looking for them ladies\n\n[Chorus: J. Cole & Lee Fields (Sampled)]\nLadies, yeah\nAyy with your fat ass booty and your perty ass weave!\nBeautiful ladies, yeah\nNow I ain't tricking, but I got a couple tricks under my sleeve\nLadies, yeah\nNow clap your hands one time if you know you look good\nAll you ladies, yeah\nNow if you from the suburbs or the hood (Yeah, ayy, look)\nBeautiful ladies\n\n[Verse 2]\nShe said \"I got a man\", well, baby I don't give a fuck\nSee me I understand, and I ain't tryna split you up\nOkay, give me your number and later I'ma hit you up\nIf you sleep I get you up, ride over and pick you up\nIf it's clean I'll lick you up, yeah, do you research\nI'll rock that ass to sleep and have you sleeping in my t-shirt\nJust came home from getting my South Beach on\nYou know I ran the streets like a dog without a leash on\nShe tryna get her freak on, come hop up on this ski jet\nYou scared of that water or you just scared to get your weave wet?\nBarely got your feet wet, yes, I know where we headed\nTryna see you throw it back, let's check your reflexes\nGood Lord, didn't know what I was in for\nYou could be my cuddy buddy, baby, what are friends for?\nI speed up the tempo, them other niggas lazy\nCan't fuck with nuttin' younger than the eighties\nI'm grown and I'm looking for some ladies, ladies, yeah\n\n[Chorus: J. Cole & Lee Fields (Sampled)]\nLadies, yeah\nAyy with your fat ass booty and your perty ass weave!\nBeautiful ladies, yeah\nNow I ain't tricking, but I got a couple tricks under my sleeve\nLadies, yeah\nNow clap your hands one time if you know you look good\nAll you ladies, yeah\nNow if you from the suburbs or the hood (Yeah, ayy, look)\nBeautiful ladies\n\n[Outro: Lee Fields & Ladies]\nHey girl, what's your name?\nOh wow, you look so nice\nI know you man is satisfied\nAyy, young lady, what's your name?\nOh wow, I know your man is pleased\nAll the way down to his knees\nAnd what's your name?\nTell me, I know yo man is worried\nAbout where you are tonight, huh\nWell ladies, all you ladies\nAll over the world\nI want you to help me sing this, here we go\nLadies\nBeautiful ladies\nOh\nLadies\nAll of you ladies\nBeautiful ladies", "image": "https://images.rapgenius.com/bbedb619df51d7c751c886dc70dfc60c.1000x1000x1.jpg"}], "artist": "J. Cole"}