{"songs": [{"title": "T9X", "album": "Absolute Power", "year": "2002-09-24", "lyrics": "[Intro]\nGirl: Hey\nTech: Wassup?\nGirl: You wanna get high?\nTech: What you got?\nGirl: Whatever\nTech: Let's do it\nGirl: You feel it yet?\nTech: Yeah... (yeah... yeah...)\n\n[Verse 1]\nFall into a spell way deeper than hell\nSensation was given to me from my homegirl Chelle\nShe told me since I was in pain and I like to rebel\nThis Motorola I'm givin' you will suit you real well\nTen minutes, twenty minutes, thirty minutes, feelin' funny\nButterflies, my eyes dilate another size\nOverwhelming sense of love, got these nuts so sprung\nWalk up to a stranger baby: \"Can I suck your tongue?\"\nTinglin' baby got me feelin' like minglin' baby\nThis is a hella higher learnin' than Singleton, baby\nOne minute I'm cold, next one I'm heat\nGive me some, Big Red so I don't grind my teeth\nThis is deep\nI take another one and another one\nAnd another one, uh-oh, here comes the other one\nI'm simulated man, I'm hella blown away\nAnd all my problems that I had've all gone away\nI pop another pill and I'ma take a sip of Caribou to wash it down\nYou thinkin' I'ma overdose I never had a moment that'll turn a nigga 'round\nI really wanna give you what I got under my dickies in the bed I wanna start\nI feel I wanna fuck you but my dick is really numb and I don't see me gettin' hard\nShe told me \"Take this cap' of GHB\nWith a gulp of Mountain Dew with glee\"\nSo I could possibly end my existence\nGHB, ain't no need for resistance\nEcstasy, yeah!\n\n[Hook]\nEcstasy (I love you very much)\nGHB (I love you very much)\nShrooms and weed (I love you very much)\nThis is the Tech N9ne experience\nA-C-I-D (I love you very much)\nPCP (I love you very much)\nCaribou-Lee (I love you very much)\nThis is the Tech N9ne experience\n\n[Verse 2]\nI'm on five pills and a cap of date rape\nOne Caribou Lou and it ain't even late, great\nI feel good, let's go to the ex house\nThat's where Heather and Marty got everybody x'ed out\nWalkin' the crib, my homegirl say Tech's with me\n'Cause she know all the bitches wanna get next to me\nI'm a star and ladies wanna have sex with me\nBut the bitches still get jealous off of ecstasy\nIt's like thirty people in the house\nRave bitches, massage and glow sticks in the mouth\nI take another cap of G with my Mountain Dew\nI'm higher than the top floor of the Fountain Blue\nSomebody said they got the chronic, light it up, man\nLet's smoke it all 'til we fall then get up again\nI wanna fuck but I'm numb 'cause I'm fizzled up\nSkip to the Lou, I tried to piss, dick is shriveled up\nMy nigga Kutt got the blunt, nigga pass it\nI didn't even know you was here\nSo he passed it with a couple hits of acid\nLike I refuse to stay alive\nIt's pills and mo' thrills, I'm lucky if I survive\nI'm high!\n\n[Hook]\nEcstasy (I love you very much)\nGHB (I love you very much)\nShrooms and weed (I love you very much)\nThis is the Tech N9ne experience\nA-C-I-D (I love you very much)\nPCP (I love you very much)\nCaribou-Lee (I love you very much)\nThis is the Tech N9ne experience\n\n[Verse 3]\nDipped out the ex house, it's right around two\nOff to Westport to kick it with the Hurricane Crew\nSaw my niggas C and G after party at the room\nMy homegirl Aiesha slipped me a couple grams of shrooms\nDamn, it don't stop, Embassy suites, three o'clock\nWith my niggas C and G, they got hella G and E\nI get two more hits of that ecstasy shit\nI don't wanna come down off that ecstasy trip\nBitches in the room lookin' so fresh so clean\nA couple hella high panties and bra, no jeans\nMy nigga said that he got codeine\nMixed it with cherry Robitussin and juice\nI took a sip of his lean\nIn the bathroom to bust a shit\nI couldn't do it so my bitch came to suck the dick\nIt was hard and soft but hard enough to penetrate the slit\n'Bout twenty minutes, damn near fainted when it was time to spit\nFive o'clock in the morning and we still zoned\nSeven o'clock in the morning pill is still on\nThis life I live, I might not die\nIf let 'lone, love my experience\nThis is my fucked up life, don't try this at home\nYeah!\n\n[Hook]\nEcstasy (I love you very much)\nGHB (I love you very much)\nShrooms and weed (I love you very much)\nThis is the Tech N9ne experience\nA-C-I-D (I love you very much)\nPCP (I love you very much)\nCaribou-Lee (I love you very much)\nThis is the Tech N9ne experience\n\n[Outro]\nGirl: What's up for today?\nTech: Whatever\nGirl: Wanna get high?\nTech: Let's do it", "image": "https://images.genius.com/478a9ba0370b10241e03f91f6e741b36.1000x986x1.jpg"}], "artist": "Tech N9ne"}