{"songs": [{"title": "Who Datt Pt. 2", "album": "What’s Poppin Volume 1", "year": "2011-09-07", "lyrics": "[Intro]\nWho dat who dat?\n\n[Verse 1 - SD]\nBack up on my 1, 2, 3 metaphors\nI'm rhyming with CD, you would think I'm in stores\nAnd y'all know me, I'm D-O-P-E\nScreaming skins all day, no MTV\nI see a girl giving out blows like a prize fighter\nI'm on top of the words: call me a highlighter\nOral sex in the morning: that's a head start\nWords like bullets, yeah I'm shopping at a Lead Mart\nState of the Tar Heel, fuck how y'all feel\nYoung but I'm good, I got that fuckin John Wall feel\nWhile y'all pissed off, I sit and sip Cristal\nHornet's nest flow, I assist like Chris Paul\nFlow like a quick river, lines like a stick figure\nSo many drinks, I'll probably borrow someone else's liver\nAnd I'm warming up just like a fireplace\nI know I'm an acquired taste, go ahead and try to hate\nBut I'm just a brainiac who don't know where his brain be at\nI'm smoking Huckleberry so I guess I'm Mark Twaining that\nThey told me I was insane, in fact\nI'm tryna get my train on track\nSo you should probably counteract\nThe fact that you attacked the Datt\n\n[Verse 2: J. Cole]\nWho dat who dat? You know what you been waiting for\nI mean, the game was all bad just a week ago\nRappers was bullshit - listen, I ain't hating, no\nNow a brother, hot enough to fuck with one of satan's hoes\nAnd she can't tell the difference, I been through hell conditions\nWishing for air conditioning\nFeeling god would never listen\nNow I'm on television, and did I fail to mention\nYour bitch is tired of missionary, boy you failed the mission\nMan, just look at how I elevated\nReal niggas celebrate it, finger fuck whoever hate it\nMy life accelerated, but had to wait my turn\nThen I redecorated\nThat means my tables turned\nLive life, might as well, only way to learn\nJust try and fail, clientele the only way to earn\nSo if you're selling crack or if you're selling rap\nMake sure it's mean so the fiends keep on yelling back\n\n[Hook]\n\n[Verse 3 - Childish Gambino]\nI won't steal your girl? Test me\nI stay Childish, watch me breast-feed\nGrandfather ran numbers a criminal in Harlem\nThe only thing he used to make was trouble and my father\nFather had me, said \"Stay away from cocaine!\"\nBlood stained gangster, my swag screams dope game\nI talk real nigga, this is what you ask for\nI shit green like vegetarian assholes\nLouder than Wayne's pants at the VMA's\nStick to what you good at nigga! Oh, everything?!\nNiggas want me everywhere, I'm yelling out \"Sorry!\"\nThere's only one of me like white girls with black Barbies\nNiggas mad that I ain't do shit too\nI got a fly Asian bitch, that's a Shih Tzu\nThrowing out your jazz man, but you don't look like Uncle Phil\nFucking girls from TV shows, my DVR is on the pill\nShake it on Youtube, yeah that's a VEVO ho\nBlack guy with a white voice, Cleveland Show\nI don't know, all I wanted was different things\nHope these hood niggas don't blow me off when they're listening\nAll I do is wear what white guys wore in the '50's\nAnd for some reason these white people think that it's interesting\nToo many girls, that's still not enough for me\nI love pussy like that old lady up the street\nEverything I spit is compilated and best of\nBlack nerds run shit, go and ask Questlove\nI'mma hit it twice, retail\nI got a package like a gansta, G-mail\nGoogle and a penis reference, same sentence, goody goody!\nI love my dick so much they let a nigga host the Woodies\nGot a whole barbershop like, \"Oh man, this shit is tight!\"\nSolid shit.. one wipe..", "image": "https://images.rapgenius.com/8zlcn04yow1pu64vzrhsrtpbv.750x750x1.jpg"}], "artist": "J. Cole"}