{"songs": [{"title": "From the Hills", "album": "Shaolin vs. Wu-Tang", "year": "2011-03-07", "lyrics": "[Hook: Raheem DeVaughn]\nFrom the Hill to the Shaolin\nAll the rules that came, from foreign part\nFrom the Hills, of the Shaolin\nWith an iron fist of fury and the mighty sword\nTo fulfill the prophecy of the Wu-Tang, of the Wu-Tang\n\n[Verse 1: Raekwon]\nIn the Polo store, fronting in war clothes, it been like this\nFrom right in time when I was nine years old\nI was a hot mess, smoking cheeba, running with stolen speakers\nDropped beepers, even wore a victory vest\nI run with niggas, digging knots from niggas, running out the school\nStunting, back of the bus, flashing the ox\nRock the V-Gooses, everything we wore was name brand\nSold three lucy's, just to get on call plan\nR.E.C. Poss' Rockers, the Blip Brothers\nEven the Spin Doctors, sat and smoke blunts, I been bopping\nAll my kins blew up, we grew up with\nWe used to do what? Running through the sewers and then shopping\nPick pocket, deuce baby, take it in truce, baby\nYou know how we do, come run in my boots, baby\nThe niggas came through, touch the God, here Shallah\nEver since went from ninjas to gem stars, sing Rah\n\n[Hook]\n\n[Verse 2: Method Man]\nReunited, another LP, we're all excited\nThat wreckless eyeballing'll get your girl indicted\nMy touch like Midas, I cramp your style, arthritis\nThese niggas is food, I eat they food, nigga-ritis\nYour man don't snooze, insomniac\nThis The W, the Clan don't lose, you putting hands on who?\nHands down, I can handle you, you half man, half animals\nIf you are what you eat, and eat pussy, you'se a cannibal\nAnd stopping me, is what you can not do\nEither get in the game, get out the way, or get ran right through\nI ain't different Method Man like you\nBut you ain't like us, we play rough, my community tough\nAnd little kids in my community cuss\nYa'll be showing your guns, but the ones in my community bust\nAnd when they do, you get a jewel re-up\n\n[Hook]", "image": "https://images.genius.com/bd1e2ea326f22bdcaa7332457249e1c5.1000x1000x1.jpg"}], "artist": "Raekwon"}