{"songs": [{"title": "Beautiful", "album": null, "year": null, "lyrics": "[Yasiin Bey, Talib Kweli, Mary J. Blige]\n\n(yes you are, you're so beautiful)\nFantastic\n(on your knees)\nAbsolutely fantastic\n(in my life)\nAbsolutely fantastic\n(on my feet)\nAll the world fantastic\n(beautiful)\nAbsolutely fantastic\n(come to me)\n*quietly*(scientifically, scientifically)**\nFantastic\n(down again, so we'll wash it over me)\nFantastic\nFantastic\nFantastic\n\n[Kweli]\n(Tell the world)\n\n[Yasiin Bey]\nI dreamt that I could paint you in words\nBut there were no colours, bright enough\nBlack or white enough\nBlue or green enough\nIt didn't mean enough\nYou are the star to touch the earth\nShine bright for all eyes to see\nRadiate and touch me\nNow I'm shining like you do\nIt was dim before I knew you\nBright light for weeping eyes to get used to\nTrust who? that's some shit I had to adjust to\nSoon as you relax they ease back and cold bust you\nLove murdered in Brooklyn, sound the alarm\nBut you sit remain calm\nMy passion is unarmed\nI try to practice my warlike tactics\nBut in your clutch, in your touch\nMy armour, just collapses\nSuch bliss breeds obliviousness\nI recollect sweet breath still wet on my lips\nMy prayers this:\nGod protect my beloved\nAnd keep her covered\nFrom the valley to the summit\nLike the land undiscovered\nLike the stars unnumbered, you are so beautiful\n\n\n[Mary J. Kweli & Yasiin]\nBeautiful\n[im doing my best so I can be true to you]\nNow you're near\n[ain't nothin in this world I wouldn't do for you]\nIn my life\n[you're my everything more than ever and usual]\nAll my fears\n[like the stars unnumbered you are so beautiful]\nBeautiful\n[you shine so very far from where I stand]\nCome to me\n[from a distant land understand who I am]\nDown again, someone watching over me\n\n(Talib Kweli)\nYou know what\nThey say that beauty's in the eye of the beholder\nSo I use my third, and now our love is solid like a boulder\nWanna build with you as I get older, and thats my word\nSure as I stand on my ancestor's shoulders\nYou see through my drama and my world like a stage\nNot the same years but livin in the same age\nIts the kwelity not the quantity\nFollow me?\nDef-in-ate-ly\nFar from probably\nGot to be\nYou and me, beautifully, fit like pieces of the man I used to be\nNow I'm back cause of what you do to me\nYou like my reflection, better half to my whole\nLike lyrics to the beat, you the mate for my soul\nThe breath for my life, my sister and my lover\nUsed to have cold feet, now you the warmth under my covers\nI can't ignore your aura cause it grabbed me by the hand\nLike the moon pulled the tide and the tide pulled the sand\n\n[Yasiin]\n(Go ahead, Mary, baby, sing your song)\n\n[Mary J. Blige]\nOh, so beautiful\nThat dream that it would be so beautiful\nI wanna say that I love you\nAll the love you give, all the love you give to me\nAll my days and nights were lonely\nAnd it's so beautiful\nAnd now I have a friend that I can talk to, yeah\nBoy, you're so beautiful\n\n[Yasiin & Talib]\nBecause you're fruitful, beautiful\nSmart, lovable, huggable, doable like art\nSuitable to be part of the cosmos\nWith my eyes closed, I see you clearly\nCombined lifetimes with like minds, your lovelight shine\nBright the apple of my eyesight\nThe tender kiss that whet my appetite\nMy mighty Aphrodite, the flame that ignite me\nYour name just excite me\nYour eyes so alive they invite me\nCause you are so beautiful\nYou don't even know the length I would go\nTo make absolutely sho' you is respected and protected\nAnd never neglected, I hope my prayers is accepted\nThat you always will be watched over\nAnd never rocked over\nAnd if you need me to, I'll stop over\nTo check on you, I'd never jet on you\nI know a lot of foolish cats that slept on you\nBut what I'm gon' do is be totally committed\nIf you need me I'll be hotter than a New York minute\nWith a hundred percentage, from the start to the finish\nCause the vibe you give leave me so replenished\nIt's a new beginning, this is serious business\nGot my heart and soul in it\nIt's the way that I'm living\nLet it be noted the devoted is gon' always prevail\nThe newly risen, true and living Universal for real\nIt's like that y'all, and ya don't stop\n\n[Mary J.]\nYou're the only love I know, Beautiful\nYou're the only love that knows, Beautiful\nYou're the reason why I live, Beautiful\nYou're the reason why I want to give you everything\n\nSince you came into my life...", "image": "https://images.genius.com/4d1a9757d430776710118a3e0ba4658f.1000x667x1.jpg"}], "artist": "Yasiin Bey"}