{"songs": [{"title": "Smoke Sumting", "album": "Killer", "year": "2008-07-01", "lyrics": "[Intro: Krizz Kaliko & Tech N9ne]\nTech N9ne, Killer, July 1st\nMake me wanna smoke something, ya know what I mean?\nYa, that's huge man, in his head, don't call me back!\n\n[Krizz Kaliko]\nDo you wanna light tonight? (Strange Music)\nPut your lighters up to the sky (C'mon)\nWanna hit it once or twice? (Tech N9ne, baby)\nPut your lighters way up high\n\n[Krizz Kaliko]\nStrange Music, '08\n\n[Verse 1: Tech N9ne]\nHello, the name's Tech, hello, polite fellow\nFrom the height Mr. Righteous and I'm nice and mellow\nBut when I introduce myself, the least you niggas can do is jeff\nI swallowed my tongue so much for punks, that I ain't got no juices left\nYou tell them your name, they like, \"I know you, you ain't gotta tell me\"\nOff in the club, full of Patron, and hella Belve, tell me\nDo you need a light? 'Cause your spite's not right\nYou looking to fight, I'm ready to smoke something tonight\nAnd I ain't talking about no pipe to smoke, this get you nice and soaked\nSteamin' meanin' demon, your life's a joke\nI'm an animal, he think he cocky, but he soft as Barry Manilow\nCan a bro go Hannibal so Bozo, then he pop ten shots? He flammable\nYou like the ganja, we like ya gone for\nPlease don't make Tech Neez squeeze like anaconda\nPleads, and owe me weeds, you'll see, because you under\nFreeze 'cause KC G's breathe bringin' the thunder (July 1st)\n\n[Hook: Krizz Kaliko]\nI'm the one that you love when it sing (Yeah!)\nThe evil make the angel wanna smoke something\nBrraa! Brraa! Good tidings I bring\n'Til you cross the line and make me smoke something\n\n[Verse 2: Tech N9ne]\nYou bless buddha, we get gouda\nYou envy us, then we get 2s to shoot that fool up\nOoze, when he bust and who's that shooter, steppin' with the Ruger?\nLeft him twitchin', let this be a lesson to you losers\nRidiculous how you spit at Misses is sick wickedness\nHis in this, this again, his twisted, this is specific\nDismiss a trick if he slip, no need for the fist 'o' brick\nProceed with a pistol-grip, go deep into a bitch for this\nHe demon, he shifty, quick to rid me like hicks in Mississippi\nGifted he to no hippie that's iffy-iffy with me\nVividly, visit T and get sticky icky-icky\nTrip with me, 'cause bitches dig me like this is Pretty Ricky\nPissed at me? Clip is free! I'ma put that in your life and hope it\nBe a little better for the player-hater, just sit in your fright and focus\nTake a millimeter to the mouth and get red in your sight and posted\nOne-hitter-quitter with a trigger, nigga put that in your pipe, and smoke it\n\n[Hook: Krizz Kaliko]\n(Killer, July 1st, Strange Music all day)\nI'm the one that you love when it sing (Yeah!)\nThe evil make the angel wanna smoke something\nBrraa! Brraa! Good tidings I bring\n'Til you cross the line and make me smoke something\nI'm the one that you love when it sing (Yeah!)\nThe evil make the angel wanna smoke something\nBrraa! Brraa! Good tidings I bring\n'Til you cross the line and make me smoke something\n\n[Verse 3: Tech N9ne]\nAnd for your shooby-dooby I got Scooby-Dooby to give that groovy\nUzi tooly to me, shoot the booshy bulley through the booty\nThen \"Hiyah!\" I'm gunnin' you with the Glock brick in the dash\nScreamin' \"Aaah! You son of a bitch you shot me in the ass!\"\nDiablo got the hollow, never trust us kids\nThat'll leave you lost, laying limp, instead of fluffed up jigs\nNow the reason that I ever have to come home to a fucked-up crib\n'Cause I'm creepin', but the haters see my lady and they never have a hushed up lid\nNow the reapin' gotta come down rough, like wife ain't enough, just live\nBut they speakin' hella hated to my ladies because they seductive\nNow we beefin', why you do a nigga shady, like selling me crushed up Thizz?\nGet to chiefin', put the barrel in your mouth, take a hit nigga, puff-puff give\n\n[Bridge: Krizz Kaliko]\nSome just smoke the Hookah, others hit the pipe up\nSo when me says you smoke with me, you got to give your life up\nStart to runnin' Mr. Gunman, come to see you smokin' something!\n\n[Hook: Krizz Kaliko]\nI'm the one that you love when it sing (Yeah!)\nThe evil make the angel wanna smoke something\nBrraa! Brraa! Good tidings I bring\n'Til you cross the line and make me smoke something\nI'm the one that you love when it sing (Yeah!)\nThe evil make the angel wanna smoke something\nBrraa! Brraa! Good tidings I bring\n'Til you cross the line and make me smoke something\n\n[Outro: Tech N9ne]\nYeah, show 'em\nReal, back up\nI'm serious, no joke\nLike that, yo\nHow is it that being polite get you in a fight nowadays?\nYou tell them your name like, \"Wassup, I'm Tech N9ne\"\n\"Nigga, I know who your are\" Nigga\nI can't assume that everybody in the world know my name\nI can't be big headed like that, nigga\nJust because you feel bigger, nigga\nThe name is Tech N9ne, suck a dick ahahaha", "image": "https://images.genius.com/ce6124bde0d76994fd0d3a8ddb1d4e97.1000x994x1.jpg"}], "artist": "Tech N9ne"}