{"songs": [{"title": "Rollin’", "album": "Muddy Waters", "year": "1996-12-10", "lyrics": "Nineteen ninety mother fuckin six\nPack that shit up\nGet the motherfuckin Squad packed\nWe got to pull these shoes out like carpet, word is bond\nTest the crew with the guns and let's get this shit on\n\n[Verse 1]\nWhyyyyy must I be like that?\nWhyyyyy must I pack the gat?\nAll my loud, niggas be rollin with the ruckus\nReady to get deep bust rounds upon some suckaz\nHeard P.P.P. and L.O.D. is a bunch of crazy motherfuckers\nJourney to the land is on\nThe winner of the spittin bomb marathon\nThe fuck you up lyrathon, whatever you choose\nPrepare to lose that title\nTurn a vital situations suicidal, my idols, is my Uncles\nWho started smokin weed outta bibles\nGave me a puff when I bust my first rifle\nMen-estration cycles, I give bitches\nBring your craziest nigga, I'll give stitches\nWhateva, go crew for crew, blow for blow\nBang your headpiece and sniff the snow off your ho\nI keep it rollin...\n\nI kick a hole in the speaker, pull the plug, then I jet\n\n[Verse 2]\nHow ugly do you have to be to be a hardcore MC?\nNiggas be fooled by my plaques and my light skin complexture\nMy whole texture is bombin, destroyin da schools of the wack\nFrom the Land of the Lost, you get tossed\nListen to my veloc(ity), my crew's comin off\nYeah, more sneaky than casino switches\nDiggin ditches for all Moskino bitches\nClockin decimal figures, I'm gettin out diggers\nNow my choice of truck is a Land\nCause a Landcruise much bigger\nIt pack two to three more niggas\nDamn I hate a golddigger\nYeah, gimme that microphone\nI make opponents shit bricks like Tyson's home\nI keep the jacked cellular phone blown in three zones\nLove seafood and keep my nine millimis chrome\nSo it can shine up your dome\nWhen I proceed to give you what you need and clear spots like Sea Breeze\nWreckin your ass armaggedeon style\nTwenty four seven while\nMy crew chin check your profile\n(Rollin...)\n\nI kick a hole in the speaker, pull the plug, then I jet\n\n[Verse 3]\nI'm the master of disaster, super rhyme maker\nGrimy by nature, database maker\nPlay em out like Sega, Saturn\nBlow your blocks in patterns for about nine acres\nTestes, crew wearin bulletproof and double S's\nKarl Kani down, camoflouge can't hide the sounds\nOf a fo' pound (boo-yaa)\nGivin you Six Flags, bustin merry go rounds\nBut my crew stay ill with that unreal appeal\nI be the raw water, my cheek bones outta have gills\nBelow like the opera\nSmooth on the trigger for all you block cockers\nI be the key to criminology\nBlast and rotate enemies at three buck sixty\nPick me, as your Senator\nTake the love from your battlefield son, fuck Pat Benatar\nRun, head for the hills\nBack in the day, these niggas rolled up on me with\nThe trunk filled with Bomber Brooklyns, sheeps and quartervilles\nAiyyo take that shit, aiyyo Money snap the grill\nBody caught chills as he ate this nine mil\nMine kills two but my nine was sign sealed\nAnd ready to deliver, but Money had me too close\nTo reach for toast, soon as that nigga blink I broke ghost\nDash back to South Orange Ave with dollar bill to smoke dope\nI keep em rollin...\n\nThis is DJ SAY WHAT?? on this motherfucker\nSayin the dick is long, but my time is short\nBefore I go, just remember\nIf your box ain't on FDS radio, you're fuckin up", "image": "https://images.rapgenius.com/0a74fbde446eaf49e1da1f4daae6845a.1000x1000x1.jpg"}], "artist": "Redman"}