{"songs": [{"title": "Knock Yourself Out", "album": "Kiss Tha Game Goodbye", "year": "2001-08-07", "lyrics": "Uh-huh, you know where I'm taking this\nI'm taking it right there, they leave me no choice\n\n[Verse 1 - Jadakiss]\nShe said she was a model for a year and a half\nAnd if she took her pins out\nThen her hair would drop down to her calf\nI knew her man, he was just up North\nAnd would've got left up North, but he was the chef up North\nAnyway I'm K-I-double\nAll I do is get dough, spit flows, try to stay out of trouble\nIf you ready we could move, just lose your man\nOr hit the dance floor, I'll show you how to do my dance\nOr I might let you play in the garden\nOr sit up in that white thing and listen to the greatest of Marvin\nThe estate got 6 locations\nTake so long to get to the front once I missed probation\nAnd I hate to brag\nI know ya man really wouldn't like the Beretta but he'd hate the Mag\nAnd yeah here go a blank check, rock yourself out\nBut in the mean time girl - knock yourself out\n\n[Hook - Pharrell]\nOh you modeling momma? (knock yourself out)\nWanna let ya hair down? (knock yourself out)\nOh you ready to move? (knock yourself out)\nWhat you wanna sit in the Coupe? (knock yourself out)\nWanna keep on dancing? (knock yourself out)\nWanna run in my mansion? (knock yourself out)\nSit in V.I.P.? (knock yourself out)\nBitch you just wanna be seen (knock yourself out)\n\n[Verse 2 - Jadakiss]\nNow you can knock yourself out like you boxin yourself\nOr you can get real freaky, start popping yourself\nAnd my watch got so many rocks, when you look at the time\nIt's sorta like you watching yourself, uhh\nFront if you want, I puff a few blunts\nAnd take a cruise in a Porsche with the trunk in the front\nShe had the Jocko Broshure sandals, told her hop in\nThe coupe blew her mind when she couldn't find the door handles\nAttitude very high maintenance; check this out ma\nI'm running out of my patience\nDon't sleep with me? Then don't speak with me\nAnd never talk bad about niggas that eat with me\n\n[Hook]\nOh you modeling momma? (knock yourself out)\nWanna let ya hair down? (knock yourself out)\nOh you ready to move? (knock yourself out)\nWhat you wanna sit in the Coupe? (knock yourself out)\nWanna keep on dancing? (knock yourself out)\nWanna run in my mansion? (knock yourself out)\nSit in V.I.P.? (knock yourself out)\nBitch you just wanna be seen (knock yourself out)\n\n[Verse 3]\nAyyo, honey know I'm waiting to leave\nKeep dancing, cause I like how that ass shake in them capris\nI'm like Big with the murder mamis up in Belize\nBut I'll still fuck a chickenhead like Lil' Cease\nI don't care if they model, bet they all goin' chill\nFirst nigga to cook base on a Foreman grill\nAnd you might win some, but you just lost one\nKiss miseducates 'em like Lauryn Hill\n\nOh you modeling momma? (knock yourself out)\nWanna let ya hair down? (knock yourself out)\nOh you ready to move? (knock yourself out)\nWhat you wanna sit in the Coupe? (knock yourself out)\nWanna keep on dancing? (knock yourself out)\nWanna run in my mansion? (knock yourself out)\nSit in V.I.P.? (knock yourself out)\nBitch you just wanna be seen (knock yourself out)\n\nOh you modeling momma? (knock yourself out)\nWanna let ya hair down? (knock yourself out)\nOh you ready to move? (knock yourself out)\nWhat you wanna sit in the Coupe? (knock yourself out)\nWanna keep on dancing? (knock yourself out)\nWanna run in my mansion? (knock yourself out)\nSit in V.I.P.? (knock yourself out)\nBitch you just wanna be seen (knock yourself out)\n\nOh you modeling momma? (knock yourself out)\nAre you ready to move\nWanna keep on dancing? (knock yourself out)", "image": "https://images.genius.com/659c95067dc52688c5cb0888483ceafc.640x640x1.jpg"}], "artist": "Jadakiss"}