{"songs": [{"title": "We Run This", "album": "The Cookbook", "year": "2006-02-21", "lyrics": "[Missy Elliott]\nMy style can't be duplicated or recycled\nThis chick is a sick individual\nSICKTATE, VOLUME TWO, BELIEVE IT!\n{*\"Apache\" breaks start*}\nHO!! HO!!\nLet me switch up the game\n\nI drink that co-gnac\nStep back cause I might put it ON ya\nI go deep, so deep 'til you sleep\nCount sheep, wake you up from [fuckin'] all week\nYou don't want me have to SHOW ya\nHow a freak bitch act when I ain't SO-ber\nWhattup, I'm to' up, sho' nuff\nAin't scared to take it out, tell the freak to take it off\nTipsy and I feel, good\nBlack dudes got big woods\nInto it, I do it, I did it\nIf you really really want it then nigga stop frontin\nAiy boy you know I'm yo' type\nFive two I wear my jeans real tight\nMy curves, they swerve, so superb\nMy word is my word and I came to serve\n\n[Hook]\nWE RUN THIS, run this, WE RUN THIS, run this\nWE RUN THIS UH-OHH, OHH!\nIt don't matter where you're from it's where you're at\nAnd if you came to freek-a-leek better bring ya hats nigga\nEast, coast, West, coast\nDown, South represent ya coast\nYEAH WE RUN IT, AND YEAH WE RUN IT\nY'ALL DON'T WANT IT, CAUSE MY COAST RUN IT\nUh-ohh, we run this shit, uhh, WE RUN THIS SHIT\n\n[Missy Elliott]\nWICKED! Wanna pull my hair, break my back\nFor the right money might sit in your 'llac\nBack to back, and can't even keep track\nIt's a fact the freaks love to get slapped\nSuck my toes and then the backrub\nI don't come to do it, I just wanna be touched\nLook at how y'all makin me blush\nI'm enough to go around so people don't push\nDon't push - when I run that tush in the bush\nDon't my diamonds look real good\nAnd they shine so hard, that he glitters\nSo many karats they look like critters\nAnd we can do it all night\nTake a flashlight to see up in my windpipe\nI like to keep a nigga hype\nI wanna know can you handle my mic\n\n[Hook]WE RUN THIS, run this, WE RUN THIS, run this\nWE RUN THIS UH-OHH, OHH!\nIt don't matter where you're from it's where you're at\nAnd if you came to freek-a-leek better bring ya hats nigga\nEast, coast, West, coast\nDown, South represent ya coast\nYEAH WE RUN IT, AND YEAH WE RUN IT\nY'ALL DON'T WANT IT, CAUSE MY COAST RUN IT\nUh-ohh, we run this shit, uhh, WE RUN THIS SHIT\n\n[Missy Elliott]\nAny hustlers in the party y'all - HELL YEAH\nIf youse a pimp lemme see you party hard - HELL YEAH\nOhhhh strippers take yo' clothes off - HELL YEAH\nY'all superstars, y'all don't need no bodyguards - HELL YEAH\nNigga I bo-gart\nA lot of rappers fakin way too hard\nPull up at the club in a rental car\nWhere them freaks at, the freaks at the bar where the hard drinks are\nDon't, start\nYou don't want beef, don't take it that far with a superstar\nI got my foot on the clutch, see me bounce my butt\nMisdemeanor too much and I don't give a fuck\n\n[Outro Hook]\nWE RUN THIS, run this, WE RUN THIS, run this\nWE RUN THIS UH-OHH, OHH!\nIt don't matter where you're from it's where you're at\nAnd if you came to freek-a-leek better bring ya hats nigga\nWE RUN THIS, run this, WE RUN THIS, run this\nWE RUN THIS UH-OHH, OHH!\nRepresent ya coast and act like ya know\nKnow how to act 'fore you step your two feet in the do'\n\nVOLUME TWO, HOLLA!\nWICKED! THIS SHIT IS SICK!\nBIG SHOUT OUT TO MOBB DEEP\nG-UNIT!", "image": "https://images.genius.com/727d0a8c92ca1aa0e56d786d947390ec.600x600x1.jpg"}], "artist": "Missy Elliott"}