{"songs": [{"title": "I’m So Wavy", "album": null, "year": null, "lyrics": "Niggas pop tags, I pop the four-five\nNiggas got swag, I got the Tek-9\nNiggas got cash better run it\nOnly dubs and hundreds, I don’t do fifties, nigga\nAnd I don’t do 50-year-old Jiggas\nOff that boss black Lamborghini, interior soft crack\nLouis V golf hat, feelin’ like a Tiger\nI made something out of nothin’ like MacGyver\nStarted from an eighth, flipped it to a key\nI got ‘em like ay, trappin’ like Gucci\nPlus I get more green than bleu cheese\nAnd I keep a red bandana in my blue jeans\nSo, nigga calm your nerves, with all that absurd\nFar from the curb bullshit slash spoken word\nYou nerd I’m from the same city as Venus and Serena\nSo don’t get served I’m so wavy, I don't need no yacht\nAin’t no Big Pimpin' on my block\nBut I’m an underground king, peace to Pimp C, yeah\nCatch me ridin’ through the hood, 20-10 Bentley\nYou got cheese and I kill rats\nTranslation: I still trap now do something with that\nOr respond to this and with them big-ass lips\nYou got my name in your mouth I hope it tastes like this—Ahh\nNo homo, one more time—Ahh that’s your promo\nAnd I been hard to the core since I went solo\nOnly man on my horse like my all-black Polo\nAnd where I’m ’bout to go is usually a no-no\nBut I’m loco, got the camel in a chokehold\nTryna son me, I’m not from NYC\nYou can’t even have a child by your Destiny\nAnd I ain’t mean to take a shot at B\nI blacked out like you did Free\n‘Cause I’m so wavy\nToo hardcore to be a Jay-Z\nRock more red than Weezy Baby\nPlease say the Baby\nBeen around for years, so bitch, don’t Drake me\nAnd this is not a diss\n‘Cause I was just out in LA with Drake, bitch\nAnd no disrespect to G and Hip-Hop\nBut nigga I’m a G and I’m doing this for hip-hop\nAnd that’s ‘Ye’s brother, and ‘Ye my nigga so\nI’mma give him some advice: Get rid of Amber Rose!\nI’mma tell you how she get down\nI was at Dig’s afterparty, sippin’ Cris\nShe was whisperin’ to Chris Brown\nI seen Chris turn his head like “No!”\nThen Gold Digger came on, I pointed like, “Hoe!”\nBut this ain’t ’bout her, this about Hov\nI’mma chop down the Roc and take it to the stove\nI apologize to B, ’cause this about Hov\nI’ma chop down the Roc and take it to the stove\n“D.O.A.?” No! T-Pain stays, old nigga goes\nI’m so wavy too hardcore to be a Jay-Z\nAll up in your ear like Drake beats\nSo the nigga that cut ‘Ye couldn’t fade me\nYou took a shot and the shit grazed me\nI wet up your block just like the Navy\nPut a label on the shit and write “Play Me”\nDJs go in, DJs go in\nCause I'm so..\n\nFunk Flex, you my nigga. Clue, what up? DJ Enuff. I know y’all can’t play this shit. It’s too wavy. And Jay your boy, it’s all good though, y’all still my niggas. DJ Drama, Kay Slay, lock in. I mean, this shit so hot DJ Whoooooo Kid might spin this shit at 50’s birthday party. DJ Skee! Khaled know we the best! Yo, Don Cannon, Cannon! I know y’all niggas locked in\n\n\nDJ Chris Styles! Young Legend, Nu Jerzey Devil. DJ Felli Fel! Ed Deluxe, D Man, ride this shit straight through Big Boy Neighborhood! Kid Capri, tell Hovi Hov leave that young nigga alone! I mean, DJ Red Alert, what up OG? RED Album comin’ soon\n\n\nI see you downloadin’ my swag, camelface. Blueprint 3 gon’ sell more cigarettes than it do records, nigga. Now I know why the taxes went up on tobacco, motherfucker\n\nHeard ’bout your little fight backstage with Kanye, too. I got a million dollars say Kanye knocked that nigga the fuck out. Just tryna make good music, is all he tryna do. Shit, ‘choo fuckin’ with ‘Ye for? “D.O.A.” nigga? Please. I love 808s and Heartbreaks, nigga Love Lockdown my shit\n\nAnd tell the world why Chris Brown wasn’t at the BET Awards? This nigga told BET if they let Chris Breezy, him and Beyonce stayin’ at home, ol’ bitter ass nigga\n\nNigga, Dame, man, that’s your man. You and Dame was mans and ‘em. You and Dame used to be tighter than giraffe pussy and shit. You know your man having financial problems and shit. You number one on the Forbes list, nigga, you make 35 million and shit. Give a nigga a milli or sum’. I’d give it to him myself, but shit, I was only #13, nigga, on the list, way down there with Jeezy and shit, earned 7 million this year so far. But I’m on tour, nigga, Lamborghini Tour, live from Switzerland, I gets it in. Shit, I could use 28 more million. But I wouldn’t trade spots with you on the motheruckin’ Forbes list for that nose and them lips, nigga. My nigga Jay\n\nAnd last but not least, peace to M.I.A., cause the Roc about to be MIA\nNo one on the corner got a swagger like you, ’cause no one on the fuckin’ corner is 42", "image": "https://images.genius.com/9c29ee407cd2d88f01ce08743e61d3b1.614x614x1.jpg"}], "artist": "The Game"}