{"songs": [{"title": "Video Girl", "album": "Room for Improvement", "year": "2006-02-14", "lyrics": "[Drake: talking]\nUh, yea, get in my Slick Rick mode\nN'a mean?, I'm a tell ya a Story real quick\n\n[Verse 1: Drake]\nLook, she got a saying theres no alice without the tin man\nCrib was 2 mil, plus I just bought a couch for ten grand\nEven if the house was ten grand\nAnd there was no pool\nWould I still be without my swim fan?\nThe ceiling could be higher\nShe making requests\nDon't know if she feeling me or she be feelin what I buy her\nAnd purses are light now\nShe use 'em all the time\nSo she smilin to the the point that it hurt when she bite down\nAnd she simply a new model\nStay spendin dollars\nBut she got less sense than a empty perfume bottle\nAt times she a solid chick\nAnd I'm a sucka for the cuties\nSo she always lookin good when my wallet's thick\nChillin on the linen, she all up in the closet so much\nGot a hunch thats shes feelin other women\nWant the diamonds on the face in the center\nNice guys finish last so I'm winnin every race that I enter and she a\n\n[Hook]\nVideo girl\nEh yo you have to listen\nI'm in a bad position\nI fell in love with a...\nVideo girl\nI wouldn't call her name\nI got the feelin that they all the same\n\nAnd she a\nVideo girl\nTo the fullest extent\nSo I wrote you a song\nCuz I can't stay with a\nVideo girl\nAnd you betrayed your wealth\nGot a feelin you shoulda stayed yourself\n\n[Verse 2: Drake]\nMy old girl would say\nLook at Vida Guerrera\nThere's no need to compare her\nI bet she smiles cuz she loves what she sees in the mirror\nI bet she's out meetin' directors instead\nAnd frustrated cause shes already been undressed in they head\nBe a teacher, open up shop if you can do nails fine\nApply for a business loan and I'll bet you that they'll sign\nIf you a real dime\nPoppin as if its your only option\nGirl there's things to do\nOther than jail time\nLook this ain't a song dissing half of these rappers\nOr pasha and sasha, esther baxter\nMelyssa ford, or katy or anyone after\nI just give my opinion for laughter\nOr maybe to think on\nSo next time you out at the club\nAnd a brother offers the whole table something to drink on\nYou just take in fact he got a stack with a mink on\nNow he got you doing everything that you think wrong\nLook, you tell your parents that its cash at an easy pace\nYa dad screaming take ya ass outta jeezy face\nAnd as ya man I won't back down first\nBut they got you doing soft-core background work\nThat messed up like an officer that pulls you over\nAnd he ask questions later and pat down first\nBut you ain't thandie newton, and this ain't crash here\nThe resolutions passed baby, this ain't last year\nLook, I got a message, I'll say it\nI got some beats still\nRegina Hall and Garcelle and Elise Neal\nYoung girls these here women with big dreams\nRole models that you can watch on the big screen\nIf you refuse to change and you that chick still\nRespect yourself, don't be convinced that these tricks will\nYou got an audience believe it or not\nMy cousin who can't speak know the lyrics to tip drill\n\n[Hook]\nVideo girl\nEh yo you have to listen\nI'm in a bad position\nI fell in love with a\nVideo girl\nI wouldn't call her name\nI got the feelin that they all the same\nAnd she a\nVideo girl\nTo the fullest extent\nSo I wrote you a song\nCuz I can't stay with a\nVideo girl\nAnd you betrayed your wealth\nGot a feelin you shoulda stayed yourself\n\n[Drake: speaking]\nAnd I ain't trying ta generalize every video girl, you n'a mean?\nSay that ya all one way man its just that sometimes man you gotta\nAccept the fact that there's times that you gotta better yourself\nYou know as a person man. I love to see my black women strong, single\nIndependent. doing they thing without popping they booty in some rappers\nVideo you n'a mean? its a wonderful thing baby. so uh, don't hate me for\nThis one ladies. just take my advice you n'a mean? cuz its like uh\nAnd she beautiful and honey dances\nAnd you always downtown making money transfers\nAnd anything the color of braces she get excited\nShe always showing up at these places she get invited\nShe a video girl", "image": "https://images.genius.com/c85f36c02060316fcec1ed423c60f0da.1000x1000x1.jpg"}], "artist": "Drake"}