{"songs": [{"title": "Another Body Drops", "album": "Till Death Do Us Part", "year": "2004-03-23", "lyrics": "You ready holmie?\nYup\n\n[Verse One: B-Real]\nMy first mission runnin' through the head to smoke jack\nWith memories poppin' in my head recall that\nLate night creepin' through the alley with six deuce\nStrapped up everybody focused no mixed views\nA sawed off pumped in my hand with two shells\nThe other four holmies on the scene with cocktails\nOne nigga lookin' for popos and foes hell\nSomeone lookin' through windows the door bells\nGoes off followed by the punk you gas bomb\nAdrenaline pumped up still I remain calm\nHouse lit up you could see it for eight blocks\nRunnin' through the hood run in front of the fade cops\nThe game chase but they couldn't cover the streets up\nRolled out ran into the spot to meet up\nStrapped down covered up the tracks and back home\nLaid low earned me a stripe perfect no\n\n[Hook]\nShoot 'em up\nBang bang\nAnother body dropped\nYou can't stop the head nod\nSoot 'em up\nBang bang\nAnother body dropped\nYou can't stop the hip-hop\nShoot 'em up\nBang bang\nAnother body dropped\nYou can't stop the head nod\nShoot 'em up\nBang bang\nAnother body dropped\nYou can't stop the gunshots\n\n[Verse Two: Sen Dog]\nYeah I'll hit your block up better lock up\nFuck the gang and shit don't stop uh\nA mad dog with a bob in the reagle\nGo into mode and just kill all your people\nCoast to coast ain't a nigga more evil\nNow made me act a lot and call Sen Diesel\nRock the block with the M one six\n.44 mag like a east war fit\nThis here granadilla break you off right quick\nBe prayin' up to Jesus and all that shit\nUh niggas be jackin' when they see my bucket\nRoll down they block they hide and say fuck it\nCome back in form of an assassin\nThree hundred yards with the infrared action\nTroop is the layer black Doc Holiday\nCuancho raider the modern day huh\n\n[Hook]\nShoot 'em up\nBang bang\nAnother body dropped\nYou can't stop the head nod\nSoot 'em up\nBang bang\nAnother body dropped\nYou can't stop the hip-hop\nShoot 'em up\nBang bang\nAnother body dropped\nYou can't stop the head nod\nShoot 'em up\nBang bang\nAnother body dropped\nYou can't stop the gunshots\n\nYeah, now shooting up your town. Them bad ass assassins, boy. Thought you knew. Check this out, you better be packin', fool. Hyeah\n\n[Verse Three: B-Real]\nI manned all missions when I was a youth so thoughtless\nG ride no fingerprints it's spotless\nSix bows hittin' all the Gs and we got this\nRag top down like a stripper that's topless\nSee me hittin' the corner you meltdown\nSlugs fly thugs die moment ya fell down\nSomebody's screamin' you hangin' the hell down\nI'm certified nigga when you're sittin' there spellbound\nNo thoughts barkin' just hearin' the hellhounds\nBurn you with the heaters spittin' out twelve rounds\nIt's life in the hood no escapin' the gunplay\nBuy one day I'm out gotta figure out some way\nRats in the park all scatter when guns spray\nGot you locked in now where do the slugs stray\nI found ways out but the street be one way\nGot a dark mind no thoughts blacker than Sunday\n\n[Hook]\nShoot 'em up\nBang bang\nAnother body dropped\nYou can't stop the head nod\nSoot 'em up\nBang bang\nAnother body dropped\nYou can't stop the hip-hop\nShoot 'em up\nBang bang\nAnother body dropped\nYou can't stop the head nod\nShoot 'em up\nBang bang\nAnother body dropped\nYou can't stop the gunshots", "image": "https://images.genius.com/bbdbef4d71e94241d00e6cf766f68925.640x640x1.jpg"}], "artist": "Cypress Hill"}