{"songs": [{"title": "Planet 50", "album": "The Lost Tape", "year": null, "lyrics": "[Intro]\nIf he’s your number one, and he’s your everything\nWhy would you pick up the phone when I call to talk to me?\n\n[50 Cent - Verse 1]\nYou know you won’t play with a nigga\nI fly out to spend the day with a nigga\nFirst flight, first seat and first class\nFirst pair of Giuseppes, first Birkin bag\nI’m Street King, so you’ll be fit for a king\nWhen we step out on the scene it’s Alexander McQueen\nIt’s a ghetto fairy tale, I’ll be your night in shining armor\nAnd retro Jordan’s, Giselle’s and a leather bomber\nBright lights, city life, I’ll show around New York a bit\nFrom hot dogs and pretzels to the expensive shit\nCause we can shop till my nickname Saks Fifth\nMadison Ave mindframe, baby I stack chips smile\nMe cell phone’ll capture the moment\nWhen your emotions start to shift\nI’ma just shoot that over your brown eyes\nTo chocolate thighs\nMake me wanna sing good lord\nIs this Adam and Eve happening again?\n\n[Hook]\nWe could get all day, all night, twisted up, get right\nLet me know if you’re with it\nThat kush in my hood so good, roll it up, back wood\nCan’t wait to let you hit it\nNow you’re in my world\nNow you’re in my world!\nPlanet Fifty\n\n[Verse 2]\nListen shawty, this is my foreplay without the touching\nYou can say it’s my forté, I feel you coming\nMindsex I make you wanna take your clothes off\n2020 golden Benz, I’m feeling that concept\nI want the best, now can you be the best for me\nCan my vision and your ambition make the perfect recipe\nLet’s take a walk on the wild side and chat til your body language is saying, boy come get this cake\nIn my mind ten times, I done took off your clothes\nSo if you’re thinking what I’m thinking, let me know it’s a go\nI’m a gambling man, talking ’bout life not dicing\nAnd that look in your eyes say it’s going down tonight\nYou can show me what you’re into\nAs I get into, kissing, licking, switching positions\nActing like a nympho\nRound after round, I show you how I put it down\nJet set, mile high club\n\n[Hook]", "image": "https://images.genius.com/ec16b41f3ee318d52d31bf3312db8b9c.1000x1000x1.jpg"}], "artist": "50 Cent"}