{"songs": [{"title": "Under Pressure", "album": "The Players Club (Music From and Inspired By the Motion Picture) ", "year": null, "lyrics": "Check it out check it out\nKurupt & 'Cat live live live...the Road Dawg Assassins\nBlaze on...yeah who dat who dat who dat?\nKurupt...Young Gotti back again with my nigga 'Cat\n\nI got a plot for about a half of key of coke\nHeater stowed in my coat me & D Lo\nWhat's up loc? Hit a stick then trip a flow\nStick him for his notes roll hundred spokes\nRaw dogg it's all about the money now\nThis ain't no riddle don't giggle like it's funny now\nWhat you got my cash?\nWhat I got'll pop the stash\nGet the Glock stop cock pop & dash\nMove where the homies got they end they coulda had\nAnd everybody's down for the muthafuckin' mash\nWhat you 'bout to blaze up?\nOh it's like that all of the homies is posted up in the back\nYou comin' to the gangsta reunion Kurupt & 'Cat\nWonderin' where all the muthafuckin' G's at\nAll I see is switches niggas hittin Swishers\nNiggas high as the sky & niggas gettin bitches\n\nChorus\nLiving my life hustlin' strugglin' & partyin'\nUnder Pressure (we all are) Under Pressure\n[Repeat]\n\nI'm a bet I'm not a rookie like Mack 10 said\n\"Gangstas don't dance we boogie\"\nOff to another corridor & that's for sure\nDrop a nigga to the floor I'm spectaculaur\nAy girl, seen you lookin' at me from afar\nWhile I'm over here just wonderin' who you are\nI'm a tan khaki wearin' blue khaki wearin'\nBrand new khaki wearin' muthafucka from the Pound\nHop in the MC (Monte Carlo) chrome M3\nCase niggas is comin' after me burst then flee\nI seperate the real from the fake\nAs easy as it is to make mistakes I'mma give it all it takes\nI'mma hit ya spot like shell shock\nAnd take all there is to take\nTurn & make his fuckin' chest quake\nLife is simple just get yo' cash\nAnd don't do shit unless ya down to blast\n\nChorus\n\nViolence needs to silence\nThey call it no sense we call it self defense\nThey makin' all the cash but we ain't makin' none\nAll they got is bullshit but we ain't takin' none\nThey said the panties dropped\nDo 'em nigga what's poppin'?\nIs it mines or yours?\nNigga it's all of ours\nPlay everyday holla at my nigga Dre\n(Yo we about to bounce?)\nNaw blaze up a ounce\nWhat's up my name's Kurupt\nThey call me Young Gotti\nYou wanna party I'm out to catch a body\nThey say I shine but I don't feel like a star\nAlways tryin' to play niggas like guitars\nJust do it baby do it baby do it\nIt ain't nothin' to it I spit it like fluid\nSpit fluently fluent\nFluent enough for you to understand\nWhat the fuck a nigga was doin'\n\nChorus\n\nThat's my nigga 'Cat he knows where it's at\nUnder Pressure (we all are) Under Pressure\nThat's my nigga 'Cat he knows where all the G's at\nUnder Pressure (cause we all are) Under Pressure", "image": "https://images.genius.com/2a5d705e0441adc709539108dcb0c399.586x530x1.jpg"}], "artist": "Kurupt"}