{"songs": [{"title": "Cum on Everybody", "album": "The Slim Shady LP", "year": "1999-02-23", "lyrics": "[Produced by Bass Brothers]\n\n[Intro]\n(Ha-ha-ha-ha-ha) Yo, mic check\n(Woo, shit) Testing\nOne, two, um, twelve\nWhat up? What up? What up? (Outsiderz)\nThis is my dance song, can you hear me? (Outsiderz)\n(Rah Digga, Young Zee, bust it, bust it)\nAlright, ayy, turn my headphones up\n\n[Verse 1]\nMy favorite color is red like the bloodshed\nFrom Kurt Cobain's head when he shot himself dead\nWomen all grabbin' at my shish kabab\nBought Lauryn Hill's tape so her kids could starve\n(“I can't stand white people”)\nYou thought I was ill and now I'm even more so\nShit, I got full-blown AIDS and a sore throat\nI got a wardrobe with an orange robe\nI'm in the fourth row, signin' autographs at your show\nI just remembered that I'm absent-minded\nWait, I mean I've lost my mind, I can't find it\nI'm freestylin' every verse that I spit\n'Cause I don't even remember the words to my shit (Um, one, two)\nI told the doc I need a change in sickness\nAnd gave a girl herpes in exchange for syphilis\nPut my LP on your Christmas gift list\nYou want to get high? Here, bitch, just sniff this\n\n[Chorus]\nCum on everybody (Get down tonight)\nCum on everybody (Get down tonight)\nCum on everybody (Get down tonight)\nCum on everybody (Get down tonight)\nCum on everybody (Get down tonight)\nCum on everybody (Get down tonight)\nCum on everybody (Get down tonight)\nCum on everybody (Get down tonight)\n\n[Verse 2]\nYo, yo, yo, yo, yo\nI tried suicide once and I'll try it again\nThat's why I write songs where I die at the end\n'Cause I don't give a fuck like my middle finger was stuck\nAnd I was wavin' it at everybody, screamin', \"I suck\" (I suck)\nI go on stage in front of a sell-out crowd\nAnd yell out loud, \"All y'all get the hell out now\"\nFuck rap, I'm givin' it up, y'all, I'm sorry\n(But Eminem, this is your record release party)\nI'm bored out of my gourd, so I took a hammer\nAnd nailed my foot to the floorboard of my Ford\nGuess I'm just a sick, sick bastard\nWho's one sandwich short of a picnic basket (I ain't got it all)\nOne Excedrin tablet short of a full medicine cabinet\nI feel like my head has been shredded like lettuce and cabbage (Oh)\nAnd if you ever see a video for this shit\nI'll probably be dressed up like a mummy with my wrists slit\n\n[Chorus]\nCum on everybody (Get down tonight)\nCum on everybody (Get down tonight)\nCum on everybody (Get down tonight)\nCum on everybody (Get down tonight)\nCum on everybody (Get down tonight)\nCum on everybody (Get down tonight)\nCum on everybody (Get down tonight)\nCum on everybody (Get down tonight)\n\n[Verse 3]\nGot bitches on my jock out in East Detroit\n'Cause they think that I'm a motherfuckin' Beastie Boy\nSo I told 'em I was Mike D\nThey was like, \"Gee, I don't know, he might be\"\nI told 'em, \"Meet me at Kid Rock's next concert\" (Oh really?)\nI'll be standin' by the Loch Ness Monster\" (Okay)\nPeace out (Bye)\nThen I jetted to the weed house, smoked out\n'Til I started bustin' freestyles, broke out\nThen I dipped quick back to the crib, put on lipstick\nCrushed up the Tylenol and ate it with a dipstick\nMade a couple of crank calls collect (Brrrt)\n\"It's Ken Kaniff from Connecticut, can you accept?\"\nI want to make songs all the fellas dub\nAnd murder every rich rapper that I'm jealous of\nSo just remember, when I bomb your set\nYo, I only cuss to make your mom upset\n\n[Chorus]\nCum on everybody (Get down tonight)\nCum on everybody (Get down tonight)\nCum on everybody (Get down tonight)\nCum on everybody (Get down tonight)\nCum on everybody (Get down tonight)\nCum on everybody (Get down tonight)\nCum on everybody (Get down tonight)\nCum on everybody (Get down tonight)\nCum on everybody (Get down tonight)\nCum on everybody (Get down tonight)\nCum on everybody (Get down tonight)\nCum on everybody (Get down tonight)\nCum on everybody (Get down tonight)\nCum on everybody (Get down tonight)\nCum on everybody (Get down tonight)\nCum on everybody (Get down tonight)\nCum on everybody (Get down tonight)\nCum on everybody (Get down tonight)\nCum on everybody (Get down tonight)\nCum on everybody (Get down tonight)\nCum on everybody (Get down tonight)\nCum on everybody (Get down tonight)\nCum on everybody (Get down tonight)\nCum on everybody (Get down tonight)", "image": "https://images.genius.com/18fd7ff1ba2db7ae16a26498fc58bb64.600x600x1.png"}], "artist": "Eminem"}