{"songs": [{"title": "How U Like Dat", "album": "Red Gone Wild: Thee Album", "year": "2007-03-27", "lyrics": "[Intro]\nWKYA Gilla House Radio\nYeah niggas, I'm back\nAnd the weather outside is hot than a motherfucker\nBut we cold chillin in the Brick City\nSo kick back, light some blunts\nPut your hands on a big fat greasy ass and turn the music up\nAs we take yo' ass on a ride as Redman Goes Wild on WKYA!\n\n[Redman]\nGilla House, yo, yo\nCome see the sideshow, nigga how it go?\nWith my eyes closed I can hit nine folks\nYou want the beef nigga? Here the prime roast\nMy mic's the gun, the bullet's the 9-volt\nFuck the convo, here go the pyro\nG.I. Joe, mixed with Desperado\nI ride low, with a bomb in the armrest\nPrepare to snipe a fucker like John F\nConnect ya like Nynex, nigga holla\nI'm on the corner like Hollywood with a Starbuck\nBring it to ya like the Japs in Pearl Harbor\nRed is to blunt like redneck is to Marlboro\nThis is our world, join the effect\nClean your ears for Doc Donald Goines with a pen\nWhat more can I say, Doc billin\nGilla general, Def Squad lieutenant\nIll at will, thought you knew\nI'm in the hood, you +Most Wanted+ up in +Malibu+\nI don't co-sign shit that ain't hundred percent\nTryna blow money-wise like Bubba Gump Shrimp (Gilla!)\nI feel I'm young, out for the crumbs\nShutgun warrior with a Wu-Tang tongue (Gilla!)\nHow ya like that, tell me how ya like that\nHow ya like that, tell me how ya like that\nDon't fuck around or walk around with an icepack\nI test your gangsta, didn't wanna fight back\nThis for niggas, Jews, and white trash\nI deliver them punchlines with a nice jab\nSmokin weed on a go-cart at Bo Craft\nBC-4, straight out of Low Cash\nLow Cash, Low Cash (WKYA!)\nLow Cash, yeah!\n\n[Gov Mattic]\nThe new Brick City, low down, gritty\nFo'-pound semi, minds I leave 'em empty\nKeep the fo'-pound round the nine-milli with me\nSo when the Feds run up, they likely not to hit me\nLike J-Kwon everybody, in the club tipsy\nYou be on the mixtapes soundin like 50\nBut this is Brick City, Gilla House we comin through\nSmokin blunts, sippin Henny too\nGirls is bouncin, niggas bouncin too\nOn the blocks, new whips we drivin through\nWe gettin money, CD's is pay-per-view\nAt the go-go girls come up into\nSo listen up as we tell y'all what to do\nCome holla at my motherfuckin crew (yeah!)", "image": "https://images.genius.com/65aa1591ac947b9397141766462ac089.465x465x1.jpg"}], "artist": "Redman"}