{"songs": [{"title": "GUMMO (Remix)", "album": null, "year": "2018-04-13", "lyrics": "[Verse 1: Omelly]\nI'm strapped, I'm slidin' in the whip, in the Bentley with two sticks\nNiggas squawking, lot of talking, I'ma park him on the strip\nI chase that bag, I stack that cash, I'm quick to take a nigga's bitch\nThat pussy good, her ass fat, I fuck around and pay her rent\nOMG this AMG, bitch it's MMG, squad\nRun down on them niggas, catch a body, slide\nAny these niggas play with Ross, they know that I'ma ride\nScreaming free Meek Milly, that's my fuckin' slime\nSixty on my wrist, sixty on my neck (lit)\nI keep it a bean twenty, you niggas in debt (shit)\nNiggas said they gon' do me, ain't finish me yet (nah)\nNext time I'm on, I'm leavin' candles in front of the step\n\n[Verse 2: Rick Ross]\nFuck you niggas waitin' on, who the fuck you playin' with?\nI was busy countin' money, penthouse layin' with a bitch\nNiggas tried to kill me twice, voodoo may have made 'em miss\nAll black but the jewelry bright, heard you live so scandalous\nI see you live a double life, pussy never on the list\nShow me what's your body count, nigga where your courage at?\nI'm not in to suing niggas, maybe take another route\nGive me all them diamonds on you, snatch 'em out a baby's mouth\nHitters know me in the city, see you for the right amount\nWhere the realest DJ's at, for someone I might buy a house\nSummertime, lumber timer, two door, yeah that's one of mine\nDapper Don, Gucci talk, one of one, so hard to find\nPussy where my money at? smoke him like a hundred sack\nShooters go the first round, sign him like a running back\nIs it that my flows hard or these niggas' beats weak?\nAs I get a blowjob, bitch I'm screamin' free Meek\nWalk up in the dope spot, niggas give me free weed\nAll that cappin' in your captions make me wanna kill a bitch\nHustlin' and real estate, and I keep it militant\nBitches must've thought I died, heard I'm still on life support\nRims on every car of mine, fuck you think I bought 'em for?\nDMX on IRS, really ain't no time to rest\nHomicide investigatin', name be in all kind of mess\nHahaha, hahaha, studied like I'm Farrakhan\nBitch I'm in the 305, call it little Lebanon\nAnd I know you always slippin', hit you and whoever on\nCaught him leavin' top golf, time to knock his top off\nSometimes I know times hard, but the Maybach top soft\nCalling plays like Brett Farve, double-M is not lost\nShe see niggas pockets fat, while she bein' forcefed\nShawty think I'm gang banging 'cause my newest Porsche red\n\n[Verse 3: Koly P]\nI heard they plottin' on a murder\nThat forty waistline, free Meek Mills and Bobby Shmurda\nNiggas hatin', so I went and bought a bracelet\nAnd bust down my Rollie, bought a store and made a statement\nHave you heard of me? came a long way from doin' burglaries\nLast week I got shot and counted sixty after surgery\nRap game messiah, every beat I spit that poetry\nMight give that ho some money, she can't never have my loyalty\n'Bout a dollar, I'ma take the lead and watch 'em follow\nThank God Lil Koly rappin' 'cause he used to be a robber\nKilled my nigga Nola, from the time, know I had that black Impala\nI'm really with the shits and hittin' licks out with them choppers\n(I'm Koly P)\n\n[Chorus: 6ix9ine]\nI'm on some rob a nigga shit, take a nigga bitch\nDo the dash in the whip, count the cash in the whip\nI pull up with a stick, I let that shit hit\nShout out ******* but I fucked that nigga bitch\n\n[Verse 4: 6ix9ine]\nNiggas iffy, uh, Blicky got the stiffy, uh\nGot the blicky, uh, drum it holds fifty, uh\nMove milli', all my niggas on fifty, uh\nTalk down, pew pew pew, you silly, uh\nHit a stain, fifty bands, all hunnids\nSpinnin' through ya block, like a pop shove-it\nShoot at me I'm shootin' back, I'm gettin' buckets\nI ain't wanna take his life, but nigga, fuck it\n\n[Chorus: 6ix9ine]\nI'm on some rob a nigga shit, take a nigga bitch\nDo the dash in the whip, count the cash in the whip\nI pull up with a stick, I let that shit hit\nShout out ******* but I fucked that nigga bitch\nI'm on some rob a nigga shit, take a nigga bitch\nDo the dash in the whip, count the cash in the whip\nI pull up with a stick, I let that shit hit\nShout out ******* but I fucked that nigga bitch\n\n[Outro: 6ix9ine]\nScum Gang!", "image": "https://images.genius.com/3dce21029cdd8aab73eb473e015807d5.1000x1000x1.jpg"}], "artist": "Rick Ross"}