{"songs": [{"title": "Next Universe", "album": "Soundbombing II", "year": "1999-05-18", "lyrics": "[Intro]\nYes yes yes yes\n(Whoo-woo-woo-woo-woo-woo-woo-WHOO!)\n\nLight up the sky like the 4th of July\nEverything in this life son, they've got two sides\nIt's part one (part one) part two (part two)\nGet together with my crew, and we gon' do\nWhatever we've got to do, uh-huh-UH!\nFeast for Hi-Teknological, neurological\nIt's unstoppable, check it out..\n\n[Verse 1]\nI'm fantastic, FURIOUS like the Five from B'lawn\nBrooklyn phenom'\nDiss all peons, flow for eons\nMos Def is beyond, in fact most cats can agree on\nCause we on the same frequency, if not\nChange your dial and get on it, I flip on this here beat\nThen the re-bonics keep heat like, Hamid's weed speech\nHit the deep street sonnets, who want it?\nHoppin dancin so sonic, you need tonics\nDon't get yours from your schoolboy comets, all blazin\nOn your man chronic, I twist the hard caps back\nTo blue bonnets, I repeat -- WHO WANT IT?\nDaytime on the list of time on the tradition, of combustion\nIgnition, propulsion, put MC's on expulsion\nThe principle, YOUR academics inadmissiable\nYou're indefensible, my style is so comprehensible\nCats take it to heart like a ventricle\nYou temporary like a weather pattern\nForgot I'm like you never happened\nDon't never say whatever happened to Mos?\nMy light shine boast from the East to the Left Coast..\nNorth and South both, cause it sound DOPE\nBoy your boy sound CHOKED with the next man's style\nBetween your teeth tongue and throat like *SOUND EFFECT*\nGot to wash your mouth out with soap\nMy penstroke, is leavin other men broke\nWhat I invoke is never asleep, ever woke\nIt controls the soul of your foes and kinfolk\nMaintainin my scope from beginnin to end quote\nLike ba-biti-dabi-dida-da-dah-dah\nPretty High Noon riders get clipped and shot down\nReach behind, Teknological, neurological\nUnstoppable, title wave in this shit, we powerful\n\n[Hook]\nNow raise your hands in the air now everybody get with it\nThe Universal, Magnetically\nB-Boy Scientific, you don't stop\nIt go ON to the rhythm you don't, bust it!\nSo raise your hands in the air now everybody get with it\nThe Universal, Magnetically\n\nYou see I'm comin to the party in the b-boy stance\nI rock on the mic.. on the mic, yo\n\n[Verse 2]\nSon it's in my chromosomes to rock this, I got this\nWatch this! Assemble mo' raps, tap your pockets\nKnock this, stimulate nerve ends and shock wrists\nSmart art breakin apart hearts in darkness\nDown for the longest, son peep the songlist\nRadiate enormous, pure peak performance\nVocal chords the strongest, acapella or cordless\nHit town, draw crowds like space shuttle launches\nWHOO! How Def flow -- we gone and\nBrooklyn New York make the world moonwalk like John Glenn\nSon I'm sendin it out, for the short to long haul\nEarth sky, left right inbetween it and all y'all\n\n[Hook]\nNow raise your hands in the air now everybody get with it\nThe Universal, Magnetically\nB-Boy Scientific, you don't stop\nIt go ON to the rhythm you don't, bust it!\nSo raise your hands in the air everybody get with it\nThe Universal, Magnetically\nB-Boy Scientific, you don't stop\nYou see I'm comin to the party in the b-boy stance\nI rock on the mic make your girl wanna dance\nFly like a dove, that come from above\nFrom rockin on the mic and you can call me Mos Love", "image": "https://images.genius.com/1b2973861d4ebfd4d3c6cd339de361e2.640x640x1.png"}], "artist": "Yasiin Bey"}