{"songs": [{"title": "Speed Bumps", "album": "Trap God 3", "year": "2014-10-11", "lyrics": "[Intro: Gucci Mane]\n(Mike Will Made It)\nBURR!\nIt's Gucci!\nMike Will\nBURR!\n\n[Hook]\nI'm in the kitchen cooking babies in my long johns\n3 Swishers put together, that's a long one\nI got a Bankhead bitch\nThat bitch from Zone 1\nI said the trappin' gonna catch up in the long run\nI'm in the kitchen tryna make it do the long jump\nBig knots in my jeans, look like speed bumps\nLook like speed bumps, look like speed bumps\nBig knots in my jeans, look like speed bumps\n\n[Verse 1]\nI swear I seen it\nYou never seen it\nI really seen it\n1017 and what’s the meanin\nY'all really mean it\nThe cleaners\nBlocks in your tires and you can’t peek the meters\nWhen I scream it\nI really mean it, won’t see the evening\nMan, I’m freezing\nSo fuckin cold that it got me sneezing\nThere Four Seasons\nThese stripper hoes will suck me till I'm sleepin’\nLeaving Magic, I’m drunk as fuck, so you know we weavin’\nAin’t no secret\nYou niggas know that i don’t fuck with Jeezy\nIt was tragic, wars everywhere, they say the boy was bleeding\nIt was easy\nI eat yo crew up like some Reese’s Pieces\nThis is street shit\nSo once you say this shit you can’t delete it\nTwice a week, bitch\nMy plug would pull up, and drop me off the pieces\n\n[Hook]\n\n[Verse 2]\nI bought all of the sessions, ain’t no sessions left\nA 150 bottles, but I’m by myself\nI’m fresh as hell\nPocket full of dollar bills\nOn the real, I buy the deal\nI push weight like I’m in the gym\nYou better chill\nBefore I kidnap and ransom one of your relatives\nAnd when that pistol in your face\nYou have no choice, you better kill\nNone of y’all niggas got better dope\nNone of y’all niggas got better pills\nY’all don’t know about popping seals\n[?] re-rocking squares\nIt's Gucci Man and Mike Will\nSo you chillin’ with a bunch of players\nSay that you a gangsta bitch\nBut came in with a bunch of squares\nLouboutin's with pony hair\nIn magic with money bear TIP Kuntry Mac Boney there\nI’m wasted standing on furniture\nAll wasted standing on furniture\n\n[Hook]", "image": "https://images.rapgenius.com/72ba3c8c580face7c768303ea8961753.500x500x1.png"}], "artist": "Gucci Mane"}