{"songs": [{"title": "The Remedy", "album": null, "year": null, "lyrics": "Yo, we all got different things we got to deal with. we always are trying\nTo put the blame on something else rather than sometimes looking at\nOurselves, recognizing a lot of the stuff that happens...but if we look\nWithin ourselves, we could prevent a lot of this nonsense. it's about\nRelating back to the essence, where it all stems from. i'm-a do my thing\nOver this drum, like a native tongue\n\nVerse one\nQ-tip:\nDo what you will, if you feel that your steeze is real\nComplicated with the skills over reel to reel\nBrown skin is what I feel, my mind and body's appeal\nIs to the no-frill mills, who hear the beats to chill\nConstantly, I'm hearing black americans just sneering\nLooking for a leader who can fill us up with either\nHitting us up with great emotional chat\nAbout the fact\nThat the black\nIs constantly held back\nLike 50 tracks back in a relay race\nAnd the white team's ahead\nSo let's keep up the pace\nAnd I be needing something\nTo feed my logical taste\nAt the end of the race is there a paradise place?\nYo, we can't get involved in what the next man is doing\nMaterial gain we put too much in persuing\nYo duke, I need this dough so we can step to this party\nBut we can all mardi grati\nMinus that shit in our body\nWhat that got to do with that\n'cause kid that's the essence\nYour physical presence\nEmbodies every lesson\nYou can't run the rolls royce if the engine is busted\nCan't even life the knife to cut the mustard\nWhat we need to do first\nNow listen to this verse\nLet's concentrate on our spiritual plate\nRecognize your existence in this vast blue space\nFrom a tiny cloud of blood\nTo the human beings with taste, sight, touch, smell\nAnd sound\nLet's deem it profound!\nAnd prioritize this cause it was allah's wish\nAllah? I'm god\nNo I ddon't believe that. that's a mystery\nIf God is so good why does shit be happening to me?\nThere's divinity within\nBecause we come from the divine\nA froce that's not seen but you feel it every time\nWhen the wind blows, and the world turns\nAnd the rain drops, and the baby cries\nAnd the bird flies, and the ground quake\nAnd the stars gleam\nSo many things are eident of it's existence\nWhat we need to do is link it with persistence\nOnce we recognize that, we can move ahead\nNative tongue, common sense yo he's hip-hop bred...\n\nCommon:\nFrom the spiritual world my former life has developed\nFirst person I lost close to me was stella\nSome of my mellows\nLost their mothers and their brothers\nFor them I feel empathy\nBut I ain't pouring out no liquor for no niggas\nI pour my heart out when I see dot out on the deck\nKnowing two weeks ago he slapped-box with death\nI hear of niggas dying in the wind-in the news\nBut when it's somebody you know it hits you\nAnd emotions get bruised\nI ain't been in your shoes\nI won't judge you for knocking\nBecause the spirit of the ghetto says you gotta!\nThey snatch you again from rock flippin'\nGive back into the neighborhood, you better start kickin'\nStickin' stores\nOn the strip\nI'm tired of arabs giving me my change back\nDevil bomb my yesterday\nMy tomorrow he never gave back\nI lay back, looking at the ceiling\nWonndering what can I do\nSo my homie won't have to be dealing\nNot cause you serving and I'm rapping I'm better\nJust different pieces to the puzzle of black life\nThat we have to put together, better ourselves\nCause families we gotta raise\nNo matter how long the money\nShorter become the days\nMen become like women\nAnd no difference in the season\nIf you got popped five times\nYou breathing for a reason\nLet's put the five tenure plan into progression\nBefore we count our paper\nCount our blessings", "image": "https://images.genius.com/334bd07941665eb5b381fb51bced319d.1000x1000x1.jpg"}], "artist": "Common"}