{"songs": [{"title": "Pimplikeness", "album": "Searching for Jerry Garcia", "year": "2005-08-09", "lyrics": "[Intro: Proof]\n[?]\n\n[Verse 1: Proof]\nAiyyo, she a freak and I love the way she move to the beat\nAss and titties bouncin, she ain't movin her feet\nPut 20 in her bra, stiff dick had many in her jaw\nProbably hit plenty in the raw (nasty bitch)\nI wanna see this bitch naked on my livin room flo'\nAnd yo bitch, I ain't givin up no dough, fo'sho'\nYou can be my best friend but Em might get mad\nDon't call me Daddy bitch, I fuck better than your dad\nLet me get up in that ass like I'm ridin horseback\nFuck a sponge, I need a tool to clean my ball sack\nI pop my collar, don't pop your bra strap\nIf you hang up the phone then bitch don't call back\n18's on ice, you ain't seen that befo'\nActin like you ain't seen my bling through the do' (bling)\nI move to a ho, just for one reason\nCause bitches need 9-1-1 for no reason\n\n[Chrous: Proof & Eminem]\nI'm somethin like a pimp\nA diamond eyed trick, but you ain't seein no chips, young ho\nI'm somethin like a pimp\nCan't go on trips, so you could suck my dick, yes bitch\nI'm somethin like a pimp\nYou could swallow or spit, and make me rich, oh girl\nI'm somethin like a pimp\nGet that money witcha switch, I walk with a limp, big P\nSaid I'm somethin like a pimp\n\n[Verse 2: Kuniva]\nI never treat 'em like they wanna be treated, bitch beat it\nYour purpose'll be defeated if you think that you're needed\nNow what do you tell a chick who has two black eyes?\nYou ain't gotta tell her nothin, you just told her twice\nAnd I don't wanna put my hands on ya, I got a plan for ya\nGet with my mans, he gon' lay a couple grand on ya\nSo fresh and so clean, she know the routine\nIt's such a - wonderful thing, money flow like ravines\nThey say \"Kuniva, get a clothin line\" but I'mma chill\nCause when cotton ain't sellin pussy always will\nAnd these women they be knowin the deal\nThat's why these niggas be blowin a mil' just to keep a ho in they grill\nAnd I ain't never been a pimp, I'm somethin like one though\nI fuck 'em and leave 'em, you always love or like that ho\nCashin 'em out, they never get ahold of my chains\nThey only get that swollen up thang, I'm showin 'em game\n\n[Verse 3: Swifty McVay]\nHah, you was a sucka when you met her, she dogged you cause you let her\nSee I tell a bitch quick, if you knew better you'd do better (bitch)\nThey realizin I ain't havin that shit\nDon't be surprised, I'm hypnotizin every tramp that she with\nI send 'em out like Vanity 6 and I mean that\nI'm doggin they ass, I'm in joggin pants and a V-neck (hah!)\nI put my foot up in her ass so fast\nThat she'll forget how to spell \"cash,\" she ho'in with a cast on\nAnd I'm knowin just what happened that day\nHe didn't pay cause you let him take you to a matinee (I saw you)\nYou get slapped that way, you can't dodge the drama\nI'm pimpin aunts and mamas, I collect from massage parlors (want my change)\nMenage-a-trois is really second nature\nI have 88 bitches straight takin it to the face {AHH!}\nAnd uh, I can give a fuck about a relation\nEither open your legs, or get the play, stupid bitch\n\n[Chrous: Proof & Eminem]\nI'm somethin like a pimp\nA diamond eyed trick, but you ain't seein no chips, young ho\nI'm somethin like a pimp\nCan't go on trips, so you could suck my dick, yes bitch\nI'm somethin like a pimp\nYou could swallow or spit, and make me rich, oh girl\nI'm somethin like a pimp\nGet that money witcha switch, I walk with a limp, big P\nSaid I'm somethin like a pimp\n\n[Verse 4: Eminem]\n(Hey, you know I gotta say somethin on this track)\nWell I'm not a pimp or a player, see I'm more like the mayor\nGrab a bitch up by her hair like I just don't care\nAnd swing her in the air (AHH!) I'm talkin major ass kick\nToss a bitch out the house like Kwame Kirkpatrick\nI'm a PIMP, so I give a fuck about a BITCH\nBut I don't make 'em trick, I'm RICH (whoo!)\nI don't need the chips, they don't walk the strip\nBut I could spit some game and I could talk some shit\nI'm somethin like a pimp, similar to a mack\nI ain't makin the news, I make my baby mama pick up the slack\nDrop Cadillac, truck {*phone rings*} fuck, I gotta go\nThat's my bottom ho pagin me back - I'm a pimp\n\n[Verse 5: Bizarre]\nIt's 7 o'clock, bitch you ain't got my money?\nI'mma beat yo' ass {*girl giggles*} you think it's funny?\nBitch get on the block in some dirty tube socks\nAnd get shot by a cop in some Reeboks (yeah!)\nBitch I'm the man, you know I'm the man\nKeep suckin dick, 'til you get a hundred grand\nBitch you insane if you think I'm your mayn\nHere's 2 G's, go fuck LeBron James\n\n[Chrous: Proof & Eminem]\nA diamond eyed trick, but you ain't seein no chips, young ho\nI'm somethin like a pimp\nCan't go on trips, so you could suck my dick, yes bitch\nI'm somethin like a pimp\nYou could swallow or spit, and make me rich, oh girl\nI'm somethin like a pimp\nGet that money witcha switch, I walk with a limp, big P\nSaid I'm somethin like a pimp\n\n[Outro: Proof & Traci Nelson]\nHah, been gettin this money off these bitches\nHeard me? That's what I do, you know me\nCheck me out anywhere, anybody tell you about Proof\nGot that, a.k.a. The Young Legend\nThe Human Fly, y'knowmsayin?\nAiyyo, I got bitches in Michigan on Michigan\nYo' bitch is on Woodward nigga, next to them faggot ass niggas\nI got bad bitches cause you gon', you think it's a cop\nYeah, that ain't cop that's my bitches\nI got the top notch bitches, y'knowmsayin?\nI'm more than a pimp, I'm somethin like a pimp\nCause I'm a Thundercat at the same time, Wonder Rat{?} baby\nBig pimpin, you heard me? P.I.M.P\nProof Is My Poppa, let's keep it goin\nProof Is My Poppa, P.I.M.P\nY'knowmsayin let's go, c'mon y'all let's go\nOoh, hey... ooh, hey... ooh, hey...\nOoh, hey... ooh, hey...", "image": "https://images.genius.com/ab9a6517cd52ed1370641d9d44571fdd.500x500x1.jpg"}], "artist": "D12"}