{"songs": [{"title": "Heartless (Remix)", "album": null, "year": "2008-11-28", "lyrics": "[Hook: Kanye West]\nIn the night I hear 'em talk\nThe coldest story ever told\nSomewhere far along this road\nHe lost his soul\nTo a woman so heartless\nHow could you be so heartless?\nOh, how could you be so heartless?\n\n[Verse 1: Rick Ross]\nLife is like a long love song so I vibe\nYellow brick road on 24's as I ride\nShorty is a winner, when I'm in her I get lost\nMake her tremble like the middle of December on the frost\nUGG boots in a coupe dual exhaust\nAs I fall deep in love, Mr. West check my pulse\nPaintings on the wall, Basquiat is her favorite\nBlack Maybach way trilla than a slave ship\nHow can I not spazz, questions that I'm asked\nHome owner at nineteen, yo I done learned fast\nMy first love cheated on me, she was heartless\nShe fucked the quarterback and seperated partners\nI took my quarter back and played another cartridge\nI took my locket back and threw it in the garbage\nI sang a melody, it sounded nice as T-Pain's\nOkay I'm playing follow me, just to peep game\nWe party hard and fall asleep on the airplane\nIf she flirty in the dirty, then she fair game\nCheckerboard luggage as they holler all aboard!\nPortishead in the iPod until I reach a snore\nIn the clouds of the lear, thinking of Shakir\nRun the game like my nigga still was here\nIn the clouds of the lear thinking of Shakir\nWe run the game like my nigga here, Baous\n\n[Hook: Kanye West]\nIn the night I hear 'em talk\nThe coldest story ever told\nSomewhere far along this road\nHe lost his soul\nTo a woman so heartless\nHow could you be so heartless?\nOh, how could you be so heartless?\n\n[Verse 2: Kanye West]\nHow could you be so Dr. Evil?\nYou bringing out a side of me that I don't know\nI decided we weren't gonna speak, so\nWhy we up 3 AM on the phone?\nWhy do she be so mad at me for?\nHomie, I don't know, she's hot and cold\nI won't stop, won't mess my groove up\nCause I already know how this thing go\nYou run and tell your friends that you're leaving me\nThey say that they don't see what you see in me\nYou wait a couple of months, then you gonna see\nYou'll never find nobody better than me\n\n[Hook: Kanye West]\nIn the night I hear 'em talk\nThe coldest story ever told\nSomewhere far along this road\nHe lost his soul\nTo a woman so heartless\nHow could you be so heartless?\nOh, how could you be so heartless?\n\n[Verse 3: Kanye West]\nTalk, and talk, and talk, and talk\nBaby let's just knock it off\nThey don't know what we been through\nThey don't know bout me and you\nSo I got something new to see\nAnd you just gonna keep hating me\nAnd we just gonna be enemies\nI know you can't believe\nI could just leave it wrong\nAnd you can't make it right\nI'm gonna take off tonight into the night\n\n[Hook: Kanye West]\nIn the night I hear 'em talk\nThe coldest story ever told\nSomewhere far along this road\nHe lost his soul\nTo a woman so heartless\nHow could you be so heartless?\nOh, how could you be so heartless?", "image": "https://images.genius.com/70c6e506a91f6dabdd23cad304812ce3.533x533x1.jpg"}], "artist": "Kanye West"}