{"songs": [{"title": "Me Against the World", "album": "Me Against the World", "year": "1995-03-14", "lyrics": "[Chorus: 2Pac]\nIt's just me against the world\nNothin' to lose\nIt's just me against the world, baby\nI got nothin' to lose\nIt's just me against the world\nStuck in the game\nMe against the world, baby\n\n[Verse 1: 2Pac]\nCan you picture my prophecy?\nStress in the city, the cops is out for me\nThe projects is full of bullets\nThough bodies is droppin' there ain't no stoppin' me\nConstantly movin' while makin' millions\nWitnessin' killings, leavin' dead bodies in abandoned buildings\nCan't reach the children, 'cause they're illin'\nAddicted to killin' and the appeal from the cap peelin'\nWithout feelin', but will they last or be blasted?\nHard-headed bastard, maybe he'll listen in his casket\nThe aftermath: more bodies bein' buried\nI'm losin' my homies in a hurry, they're relocatin' to the cemetery\nGot me worried, stressin', my vision's blurry\nThe question is will I live, no one in the world loves me\nI'm headed for danger, don't trust strangers\nPut one in the chamber whenever I'm feelin' this anger\nDon't wanna make excuses\n'Cause this is how it is, what's the use?\nUnless we're shootin', no one notices the youth\nIt's just me against the world, baby\n\n[Chorus: 2Pac & Puff Johnson]\nMe against the world\nIt's just me against the world\nIt's just me against the world\nMe against the world\n'Cause it's just me against the world, baby\nMe against the world\nI got nothin' to lose\nIt's just me against the world, baby\nI got nothin' to lose\n\n[Verse 2: Yaki Kadafi]\nCould somebody help me? I'm out here all by myself, see\nLadies in stores, Baby Capone's, livin' wealthy\nPictures of my birth on this Earth is what I'm dreamin'\nSeein' Daddy's semen, full of crooked demons\nAlready crazy and screamin', I guess them nightmares as a child\nHad me scared but left me prepared for a while\nIs there another route for a crooked Outlaw?\nVeteran, a villain, a young thug, who one day shall fall\n\n[Verse 3: E.D.I. Mean]\nEveryday there's mo' death, and plus I'm dough-less\nI'm seein' more reasons for me to proceed with thievin'\nScheme on the schemin' and leave they peeps grievin'\n'Cause ain't no bucks to stack up\nMy nuts is backed up, I'm about to act up\nGo load the MAC up, now watch me klacka\nTried makin' fat cuts, but yo, it ain't workin'\nAnd evil's lurkin', I can see him smirkin' when I gets to pervin'\nSo what? Go put some work in and make my mail\nMakin' sales, riskin' 25 with a L, but oh well\n\n[Chorus: 2Pac & Puff Johnson]\nMe against the world\nWith nothin' to lose\nIt's just me against the world\nIt's just me against the world, baby\nMe against the world\nI got nothin' to lose\nIt's just me against the world\nIt's just me against the world, baby\nWith nothin' to lose\nIt's just me against the world, baby\nMe against the world\nMe against the world\nI got nothin' to lose\nIt's just me against the world, baby\n\n[Verse 4: 2Pac]\nWith all this extra stressin'\nThe question I wonder is after death, after my last breath\nWhen will I finally get to rest through this oppression?\nThey punish the people that's askin' questions\nAnd those that possess steal from the ones without possessions\nThe message I stress: to make it stop, study your lessons\nDon't settle for less, even the genius asks his questions\nBe grateful for blessings\nDon't ever change, keep your essence\nThe power is in the people and politics we address\nAlways do your best, don't let this pressure make you panic\nAnd when you get stranded\nAnd things don't go the way you planned it\nDreamin' of riches, in a position of makin' a difference\nPoliticians are hypocrites, they don't wanna listen\nIf I'm insane, it's the fame made a brother change\nIt wasn't nothin' like the game; it's just me against the world\n\n[Chorus: 2Pac & Puff Johnson]\nMe against the world\nNothin' to lose\nIt's just me against the world, baby\nMe against the world\nGot me stuck in the game\nIt's just me against the world\nNothin' to lose\nIt's just me against the world, baby\nMe against the world\n\n[Outro: 2Pac]\nHahaha, that's right\nI know it seem hard sometimes\nBut, uh, remember one thing\nThrough every dark night, there's a bright day after that\nSo no matter how hard it get\nStick your chest out, keep your head up, and handle it", "image": "https://images.genius.com/8e5403b2ff8b0baf1f2e3b75849742be.300x300x1.jpg"}], "artist": "2Pac"}