{"songs": [{"title": "Till the End", "album": "Under Pressure (Deluxe Version)", "year": "2014-10-21", "lyrics": "[Verse 1]\nIt's the type of shit that they read about\nLike Chris said, I gotta bleed it out\nI've been in the zone, I can't be without\nThis real shit that I be about\nI'm a visionary, that's long term\nBut Def Jam, said they need it out\nIf I rush this shit, I might be without\nBut I need a vision, can't see without\nI've been patient, never complacent\nLeft the underground when I left the basement\nThat's renovation, I spit this verse like a revelation\nOn the road with Kid Cudi and B-I-G\nConversations with No I.D\nWho made hits with Ye, got hits with JAY\nNow he wanna fuck around and make hits with me\nIf it's meant to be, then it's meant to be\nCan't express what that meant to me, what it mean to me\nMan, I swear the shit like a dream to me, what it seemed to be\nIt's so different now, everything is so different now\nI've been there and I've done that\nTell 'em all that I run that, that's a fun fact\nAnd I'm back again cause I love this shit\nWrite it down and they publish it\nI went 5 years without a publicist\n'Cause the word of mouth, they in love with this\nI've been dreaming, I've been scheming\nWent away a while but I've been fiending\nI've missed the fam, but they know the deal\nBeen at it way before the deal\nNow the  music got mass appeal\nMy main girl got ass appeal\nLike I feel the vibe, that's the main thing\nLittle fish, that went mainstream\nNow I'm big as fuck\nMy whole city, they know what's up\nI'm unseen and I'm in the cut about extra shit\nI don't give a fuck\nWhen I'm on the phone, don't interrupt\nIf I'm talking business, I might erupt\nIf you're at the show, put your lighter up\nFuck with me if you're really 'bout it\nOutsiders, I could do without it\nI crept in, got slept on\nSold out shows, no one knew about it\nWhen it comes to fucks, I give two about it\nYour cosign, I could do without it\n\n[Interlude: Dria]\nNa, na, na, na, na, na\nNa, na, na, na, na, na\n\n[Verse 2]\nOkay, last verse I gotta make it count\nWon't speak on my bank account\nSo many commas I'd have to pause\nAnd I can't afford to just waste the bars\nEvery day, boy, I thank the Lord\nI got a lot of problems but could have more\nWish I spoke to my dad more, my jeweler less\nI been hungry like Budapest\nTell me who the best, don't give a fuck\nI just know I'm blessed\nLove life even though I'm stressed\nThis business boy, I swear a test\nTell Def Jam if they don't cut the check\nI'll send Chris to go cut they neck\nI love the building, no disrespect\nBut y'all better ride when I'm in effect\nThat's radio, that's TV, but Visionary got the internet\nIf y'all fuck around or try to throw the ball to another artist\nI'ma intercept, It's my time\nPut half a mil' of my own money in this album\nThat's my dime; no rap features, just my rhymes\nMy story, it's all mine, from the basement to the stadium\nFrom the Roxy to Palladium\nI've been there and I've done that, yes I run that\nWith this pretty girl on my floor\nHalf naked playing Connect Four\nBut I've been trying to throw sex out the window\nJust to connect more\nShe so fine, type of girl I wanna fuck her mind\nAnd then unwind with some slow head\nAll my homies like, \"go 'head\"\nAnyway, it's been a long time\nAnd this here has been a long rhyme, so I gotta go\nIt's Logic, the one nobody would vouch for\nHow's that shit for an outro?\n\n[Interlude: Dria]\nNa, na, na, na, na, na\nNa, na, na, na, na, na\nThis is my story, 'til the end\nNa, na, na, na, na, na\nNa, na, na, na, na, na\nThis is my story, 'til the end\n\n[Break]\nYeah yeah, yeah, yeah, yeah, yeah\nY-Yeah, yeah yeah, yeah, yeah, yeah\nYeah yeah\n\n[Sample]\n\"Every day that they live and breathe is extended to them!\nThey may be misinformed about the truth, they may be misguided— somebody has led them on the wrong path!\nA path of corruption and destruction! But yet, God's mercy every day that they live is extended to them and they have another opportunity to be saved!\"\n\n[Break]\nYeah yeah, yeah, yeah, yeah, yeah\nY-Yeah, yeah yeah, yeah, yeah, yeah\nYeah yeah\nYeah yeah, yeah, yeah, yeah, yeah\nY-Yeah, yeah yeah, yeah, yeah, yeah\nYeah yeah\n\n[Outro: Thalia]\nThis concludes the Under Pressure program...", "image": "https://images.genius.com/6d3ae39514ef99749706fb3ccdc22dd2.1000x1000x1.jpg"}], "artist": "Logic"}