{"songs": [{"title": "When I Pop The Trunk", "album": "The Lost Tape", "year": "2012-05-22", "lyrics": "[Produced by !llmind]\n\n[Intro]\nNigga no wait, no pine box, no funeral\nJust 9 shots, take Pac 5, plus Big 4\nYou got 50, I love war\n\n[Hook 1x]:\nWho wanna box, with my ox\nYou wanna thump, I wanna dump\nIt's click clack pop pop when I pop the trunk\nIt's click clack pop pop when I pop the trunk\n\n[Verse 1 - 50 Cent]:\nI think I got him, 10 shots, follow the trail of the blood drops\nFuck the police, better talk to Allah arc\nNigga you bleeding bad, yeah, you bleeding bad\nYour Rolex soaked, like the kotex\nYou know next, it's gonna get dark\nWhere the cops when you fucking need them?\nThat blood filling your lungs boy, I see you weezin'\nThe harder you tryna run, the more you leakin'\nYou could have found something better to do this weekend\nI got an arsenal, poison tips in my archery\nBattery acid, I burn your face off properly\nGuns ammo, knife Rambo\nNightmare, wake up I'm right there\nYou're hellbound, hell yeah!\n\n[Hook 2x]:\nWho wanna box, with my ox\nYou wanna thump, I wanna dump\nIt's click clack pop pop when I pop the trunk\nIt's click clack pop pop when I pop the trunk\n\n[Verse 2 - Kidd Kidd]:\nRider.. Gang!\n\nHaaaaa!\n\nTalk that shit now, I love it when you frontin´\nEating all that pussy, guess cat got your tongue\nOpen up your mouth when say it to the pump\nBuckshot come out the back of your neck like razor bumps\nI'm too small to fight you can swing all you want\nI box with the ox, you drop, I swing once (haaa!)\nThis a sad scene, at least you die happy\nNext lick eater, it look like you was smiling at me\nDamn Kidd Kidd, snuck me after he just dap me\nTell a nigga I'm grimy, bitch I'm from Mays am street (?)\nIf you holler gangsta shit, come get at me\nI sprint like athletes in a track meet\n\n[Hook 2x]:\nWho wanna box, with my ox\nYou wanna thump, I wanna dump\nIt's click clack pop pop when I pop the trunk\nIt's click clack pop pop when I pop the trunk", "image": "https://images.genius.com/ec16b41f3ee318d52d31bf3312db8b9c.1000x1000x1.jpg"}], "artist": "50 Cent"}