{"songs": [{"title": "Peace of Mind", "album": "SpitKicker Presents The Best of Talib Kweli", "year": "2004-08-04", "lyrics": "Talib Kweli - “Peace of Mind”\n[Emcee(s): Talib Kweli]\n[Producer(s): Madsol-Desar]\n[Background Vocals: A. Mike]\n[Sample (Melody): Dee Dee Bridgewater - \"My Lonely Room\"]\n\n[Intro (Overlapped with Hook): Talib Kweli]\nUh.  I haven’t seen it.  I haven’t seen it.  Uh.  Uh, come on and, come on and\n\n[Hook: Sample from Dee Dee Bridgewater - \"My Lonely Room\" with Background Vocals by A. Mike] (x2)\nI haven't seen that look in such a long time\nI've yet to feel what could be called peace of mind\n\n[Interlude 1: Talib Kweli]\nUh.  One, two, and uh.  One, two, and uh.  Yo.  All those shorties around my way, I see y’all.  Do y’all thang, do y’all thang, come on.  Ah.  Uh.  Come on.  Ah.  Do y’all thang, do y’all thang, come on.  Ah.  Yeah.  Let me run it down.  Yo, yo\n\n[Verse 1: Talib Kweli]\nSitting on a stoop, watching chickens fly the coup\nPeople troop through the night in groups.  I got dice to shoot\nWay too late to see this youth hanging on the ave\nPlus my little man's mama just told me he skipped the class\nHe on the corner smoking a stog', looking broke in the blow\nHe opened his soul, said he came to a fork in the road.  \"Son\nI’ve never seen that look in your eye.  What's wrong, kid?\"  He replied\n\"What they’re teaching me in school ain't helping me to live\nIt ain't relevant to me.  Word is bond, the class\nIs so overcrowded, they don't even notice when I'm gone\"\n\"Hold on, shorty.  You're speeding.  Take what they got you reading\nApply it to your life and give it your own meaning\nThere's nothing out here for you, so stop running from school\nYou'll only defeat yourself—that's what they want you to do.  It's that\nSimple\" is what I told him.  \"No one’ll hold your hand\nCount your blessings—not your problems—and stay focused, man\"\n\n[Hook: Sample from Dee Dee Bridgewater - \"My Lonely Room\" with Background Vocals by A. Mike] (x2)\nI haven't seen that look in such a long time\nI've yet to feel what could be called peace of mind\n\n[Verse 2: Talib Kweli]\n“What’s up\nKeeba?  I heard you’re moving down south to\nAtlanta to be with your family.  That’s what it’s about, right?\nSelling your house and quitting your job, not\nWishing on a star.  Just getting with God.  I’m missing\nYou hard already (Word).  You used to be hooking us up, cooking\nFor us.  It was love.  You was Brooklyn to us\nI’ll remember the tragic loss of the baby’s father\nBeing eight-months pregnant was hard—that made it crazy harder\nPlus I know he loved you, and you felt like you would lose it\nThat’s why it’s good you start again and focus on your music\nI got your back on a plane that’s two hours away, and it’s like\nGoing to Queens and taking the A.  Today\nYou sound stressed out.  I know you’re ready to lead, ready\nTo be free and keep a home steady for your seeds, but you’re\nThere already.  If you thought it, it could happen\nThe hands God works with his hours.  You took action”\n\n[Interlude 2 (Overlapped with Hook and Bridge 1): Talib Kweli]\nHoller.  Yeah.  I haven’t seen ya, haven’t seen ya.  Uh.  What?  Come on.  Come on and, come on and.  Brooklyn, y’all.  Yeah.  Yeah, yeah.  Yeah\n\n[Hook: Sample from Dee Dee Bridgewater - \"My Lonely Room\" with Background Vocals by A. Mike] (x2)\nI haven't seen that look in such a long time\nI've yet to feel what could be called peace of mind\n\n[Bridge 1: Talib Kweli]\nStay focused, man.  Stay focused, uh\nStay focused, man.  Stay focused, true\nStay focused, man.  Stay focused, uh\nStay focused, man.  Stay focused, uh\n\n[Verse 3: Talib Kweli]\nBig Tobacco targets your children.  Ghetto youth marked\nFor killing, buildings fallings.  We’re just starting the healing\nLight up the truth, make a spark in the dark that’s so appealing that it\nGives sight to the blind and sound to the hard-of-hearing\nWe’re all looking for the truth.  Now look in your eyes for proof\nOr recognize no time to lie to the youth, so I slide\nIn the booth and provide you the soup for your soul, food\nFor your whole body when you feel you’re losing control\nTo some corporation, TV station, or occupation, another\nForeign value system that kill your sensation.  Feel the\nElation of knowing life—you got a lot to live\nStay true and focus on the positive.  Come on\n\n[Hook: Sample from Dee Dee Bridgewater - \"My Lonely Room\" with Background Vocals by A. Mike] (x2)\nI haven't seen that look in such a long time\nI've yet to feel what could be called peace of mind\n\n[Outro (Overlapped with Hook): Talib Kweli]\nSee, that’s what I’m talking about.  I haven’t seen it.  I haven’t seen it.  Uh.  Peace of mind.  I haven’t seen it, I haven’t seen it.  Peace of mind", "image": "https://images.genius.com/b5c63b3d86ca35481f0df6c67cd81d2e.789x789x1.jpg"}], "artist": "Talib Kweli"}