{"songs": [{"title": "Silent Night", "album": "Rejex", "year": "2012-09-06", "lyrics": "[Intro]\nThe force will be with you....always\n\n[Hook]\nShe left and broke my heart like twice\n(twice twice twice twice)\nNow everything is dark and it's fucking up my life\n(life life life)\nAnd I just wanna make it right\n(right right right)\nBut I won't make it through the night\n(night night night)\n\n[Verse 1]\nCause suicide is painless, so I'm about to aim this\nWeapon of steel right to my brain and just bang it\n32 in the clip but one is in the chamber\nClick clack, hope it freeze me from my anger\nIf you don't plan on staying, I'm saying\nI'm better off just laying\nSix feet deep underneath the fucking pavement\nAt least you work the grave-shift for treating me like ape shit\nI even wrote you love songs but money was your language\nJust look at all the damage that you did\nChuckin' up the deuces to the suicidal vital motherfucking nuisance\nI knew it, and now I'm about to lose it\nBlood splatter on the wall recognize what you did\n\n[Hook]\n\n[Verse 2]\nI mean I just don't understand\nThought I was the better man\nAnd we had a fucking plan just to make it all work out\nTurned out, you not the one for me and it wasn't meant to be\nBut I still can't see, need to face reality\nCause your everything i wanted, a goddess\nI said that on your behalf just trying to be modest\nTo be honest, but if I can't have you nobody can\nLet me see you with another man and it's done for him\nCall me fucking crazy but baby\nHow you gon' play me? I mean, have you seen me lately?\nWent from elated to a swayze, ghostin'\nTaking my life the only escape from you potion\n\n[Hook]\n\n[Verse 3]\nCause homicide is painful, bitch you should be thankful\nI turned that fucking anal licking nigga into an angel\nFuck you mad at me for? Because I put the C4 in the car\nAnd blew that motherfucker up, swerving off the Detour\nWell hee haw, boo hoo; Now it's just we two\nWhat you propose that we do?\n(You hate me bitch?) Well me too\nYou turned me to a reject, dejected\nBut that presidental keeps me free stressing, I should be elected\nI bet I'll win but I'm lost without you\nMe minus her wonder what I'd amount to\nPerhaps the suicidal bridal nigga I am currently\nShe ain't with my loving, she just only wanted currency\n\n[Hook]", "image": "https://images.genius.com/f19a23d547500fb2fba75dfe154e60cb.500x500x1.jpg"}], "artist": "Joey Bada$$"}