{"songs": [{"title": "On Fire", "album": "Muddy Waters", "year": "1996-12-10", "lyrics": "[Production by Erick Sermon]\n\n(Them bitches swear they fly...)\n\n\"We on fire tonight, and the place is lookin' steamy..\"\n\n[Verse 1: Redman]\nHahha\nNow everytime I grab the mic I always start shit up\nSharper than your double-edger, watch me carve shit up\nLive and direct, respect it to the underground connect\nPah!! I'm wreckin any MC you select\nYo E, load me in your gun, light the flares\nGive me forty-eight bars, and I go out like Ganz and Billy Bear\nWear and tear, I'm wreckin for the Bricks I swear\nJump in my way and get your body splattered everywhere\nConjunction junction what's your function\nIt's that nigga who's so swift I could lose a compass\nStep into jams, with seven niggas in a Land\nAnd forty motherfuckers in some fucked up caravan\nDrop the Fahrenheit back down to zero\nBring Heat to the streets like Al Pacino and DeNiro\nRaw dog material, grand imperial\nTalk to my shotty nigga, my ears ain't hearin' you\n\n[Hook]\n\"We on fire tonight, and the place is lookin' steamy..\"\n(\"We on fire tonight, and the place is lookin' steamy..\")\nSo take heed to what I'm saying\nCause tonight's the night, and me and my nukkas ain't playing\n(\"We on fire tonight, and the place is lookin' steamy..\")\n(As we proceed)\n(I'm on fire)\nRockin' on, Redman rockin' on\n\n[Verse 2: Redman]\nNow do I look crazy? Deranged, maybe?\nYou shot first, your Glock burst, but it graze me\nNow time for lyrics, put up your guns\nAnd watch me get this shit hoppin like the West was won\nGot that lyrical chicken feed, for all chicken heads\nCrowd your Rap City committee like I'm Big Lez\nMore sicker than them Menendez brothers\nYou need Cochran when you're fuckin with Judge Dredd\nPut your fingers up if you love hash and cash\nI been that way since Ike Turner was kickin Tina ass\nHookers ridin dick, like I'm a motorcycle\nYou wanna shine bitch? Let me Simoniz you\nI make sure your vision blur, till you don't know what occurred\nUntil I black out every nerve\nFoul women get served as chicken head hors d'ouerves\nI drop your tops like your heads was convertibles!!\nHah, if you still look up in the sky I'm still high\nAll the way live like Lakeside\nWann die? E (whattup son), you got this beat bumpin'\nThe way I feel niggas ain't leave until they up in somethin'\nPack my dutch like the niggas in the county\nDayrooms, stay tuned, for Doc Illuminati\nUp around them big butt freaks is where you find me\n(Martini and Rossi, Asti Spumante)\n\n[Hook]\n(\"We on fire tonight, and the place is lookin' steamy..\")\n(As we proceed)\n(\"We on fire tonight, and the place is lookin' steamy..\")\nSo take heed to what I'm saying\nCause tonight's the night, and me and my nukkas ain't playing\n(\"We on fire tonight, and the place is lookin' steamy..\")\n(As we proceed)\n(I'm on fire)\nRockin' on, Redman rockin' on\n\n[Verse 3: Redman]\nTo my people in the back, if you're not the wack, say\nDon't stop, the body rock\nTo my people in the front, if you're tokin on blunts, say\nDon't stop, the body rock... aoowwwwwowwwww\nI'm too strong for you to listen\nI started spittin, that's why the brick niggas be lickin\nThey stay on magazine printing equipments\nAnd lyrics I got em by the shipment, where your bitch went\nI'm smokin leaky out the Lec-y, fatal\nMy Squad steps with the ultimatum, true dat\nMy muzak, move crowds, like down the hill moved crack\nFor those who stepped on toes, I want my shoes back\nBuddy, bringin money to your girl\nFor your little daughter like I'm Cutty\nTwenty dollars a pop to dub me, I bug G, quote it\nI see you noticed how I leave microphones corroded\nHahahahaha, your staff not up to par\nYou raw? You more like Zsa Zsa Gabor\nCall deep niggas, keep the gas pedal floored\nAnd I pump the funk to keep a room and board\n\n{​​​​​​​​​​​​​​​​*record scratches, rooster cackles*}​​​​​​​​​​​​​​​​", "image": "https://images.rapgenius.com/0a74fbde446eaf49e1da1f4daae6845a.1000x1000x1.jpg"}], "artist": "Redman"}