{"songs": [{"title": "November", "album": "Flower Boy", "year": "2017-07-21", "lyrics": "[Intro]\nSay some more, never want to talk about it\nFeel a way, woah\nFeel a way, woah\nFeel a way, woah\n\n[Chorus]\nTake me back to November\nTake me back to November\nHawaiian shirts in the winter, cold water, cold water\nYeah, take me back to November, wassup\nCan we go back to November?\nTake me back to November\nHawaiian shirts in the winter, deep thoughts, deep thoughts\nNaw, take me back to November, wassup\n\n[Verse 1]\nWhat if Clancy fuckin' me over?\nWhat if 'Who Dat Boy' is rhetorical and this shit is over?\nWhat if I'm hustling backwards?\nWhat if my accountant ain't payin' my taxes?\nFillin' his pockets and IRS show up asking me questions\nI couldn't answer 'cause I was too busy tryna make classics\nBoy ain't got no motherfucking classics\nWhat if my music too weird for the masses?\nAnd I'm only known for tweets more than beats or\nAll my day ones turn to three, fours 'cause of track seven\nFuck, what if I get stuck?\nWhat if I got comfortable? I gotta keep it buck fifty\nWhat if I lost it all and ended up back in Ladera\nAt them shitty apartments that's across the Bank of America\nDamn, I would be hurtin'\nWriting all of these songs cause Wi-Fi wasn't working\nLast year in total, I put out two verses\nBut five-seven figures since then, life's kinda perfect\nOh is it really? Oh is it really? Bitch you know the dealy\nReally hilly willy tilly silly, hold that billy how I Milly Rock\nWhen they can't relate him, when they start to hate him\nThey don't drive these cars so what's their ultimatum?\nTell me, what's your November? Is it a person?\nMine was the summer '06, I remember the... (horn)\nWhat if I thought the brake was the gas? What if I crashed?\nWhat if these deep thoughts was my last?\nLet me pull over, quick!\n\n[Chorus]\nAnd drive back to November\nTake me back to November\nHawaiian shirts in the Winter, cold water, cold water\nYeah, take me back to November, wassup\nCan we go back to November?\nTake me back to November\nHawaiian shirts in the Winter, deep thoughts, deep thoughts\nNaw, take me back to November, wassup\n\n[Interlude: scattered voices]\nMy November was those Odd Future Sundays, where we used to just skate all day\nMy November, and I was performing and Lil Wayne rapped with me, I think I cried that night\nMy November was awesome, I booked my first feature film\nMy November was when I was gifted this Getz and Gilberto album\nMy November was seeing Erykah Badu perform\nMy November was when my brother took me to first concert ever...\nMy November was summer 2015 when I fell in love with someone who fucked my whole world up, showed me life through a different\n2014, Miami 43rd Street, every day was November\n\n[Bridge]\nTake me back, take me back\nTake me back, take me back\nTake me back, take me back, take me back\nTake me back, take me back\nTake me back, take me back\nTake me back, take me back\nTake me back, take me back, take me back\nTake me back, take me back\nI ain't doin' fine, lost my mothafuckin' mind\nTime travel back and help me find\nTake me back, take me back to November, this I know\nTake me back, take me back\nTake me back, take me back to November, this I know\n\"My November is right now\"\n\n[Verse 2]\nI wrote a song about you, I want your opinion\nOpposite of my heart rate, it slows down at the ending\n'Cause the love I got for you has exceeded appearance, the lyrics are\nMatter of fact, I'ma just call you, so you can hear it\nIf you do answer, I'll play it to state facts\nAlthough I already know the response you gon' say back\nAt that point I'll hang up, disappear and just stay back\nAnd if you don't I'll leave a voicemail with the playback\n\n[Outro]\nHello, no one is available to take your call\nPlease leave a message after the tone\n[beep]", "image": "https://images.genius.com/e5b95d25e33a42d9bc28cde9f3c2930e.1000x1000x1.jpg"}], "artist": "Tyler, The Creator"}