{"songs": [{"title": "Beat Up on Yo Pads", "album": "Tha Blue Carpet Treatment", "year": "2006-11-21", "lyrics": "[Intro]\nWho ride? (We ride!)\nWho ride? (We ride!)\nWho ride? (WE RIDE!)\nOn three \"We ride\"\nOne two three - WE RIDE!\nOne two three - WE RIDE!\nOne two three - WE RIDE!\n\n[Mr. Porter] Mr. Porter! {*echoes*}\n\n[Snoop Dogg]\nBeat up on yo' pads\nC'mon little homie go on and beat up on yo' pads\nYeah, beat up on yo' pads\nHa ha (Steelers Steelers)\nYeah, beat up on yo' pads\nC'mon little homie go on and beat up on yo' pads\nYou love football? Well beat up on yo' pads\nIf you down with Snoop Dogg go on and beat up on yo' pads\nAll my little homies beat up on yo' pads\nC'mon little homie go on and beat up on yo' pads\nIf you're runnin the ball then speed up on 'em fast\nAin't no need to play with 'em, go on beat up on yo' pads\n\nThey bang every Saturday and Sunday loc\nSYFL, man it ain't no joke\nHelmets and shoulder pads, ain't no bulletproof vests\nSee ain't too many options on the wild wild West\nSee I've been blessed, so I guess that I can give back\nFootball in the hood dog, you dig that\nI brought the demos back and that's just one\nI'm in Pomona with the Steelers, come and get some\nWant some'n bad enough take it\nThem runningbacks dippin, cuttin and shakin, you ain't gettin none\nInside-out, hit the eight gap\nI love it when they say that - who's house?!\nC house, G house, P house, D house\nWell, we house wherever we go, blowin 'em out\nLettin 'em know, never know that you could shine\nIt's all for the kids and plus they havin a good time\nAnd as long as I live\nI'mma stay doin positive and helpin the kids\nSo when you see me on the football field\n\"I need to holla at you Doggy Dogg!\" Homie chill (chill nigga!)\n\nNow what you need to do is read up on my past\n'fore I have my little homies go and beat up on yo' ass\nMatter fact, little homie go and beat up on yo' pads\nShow 'em how we get out ball on, beat up on yo' pads\nYeah, go on and beat up on yo' pads\nAll my little homies go ahead and beat up on yo' pads\nIf you a, ball player, then beat up on yo' pads\nSYFL, homie beat up on yo' pads\nYeah, go on and beat up on yo' pads\nAll my little homies go and beat up on yo' pads\nAw yeah, beat up on yo' pads\nAin't nuttin to it but to do it, beat up on yo' pads-pads\nYeah, go on and beat up on yo' pads\nC'mon little homie go on and beat up on yo' pads\nCelebratin just beat up on yo' pads\nAll in together now just beat up on yo' pads\nYeah, go on beat up on yo' pads\nAll you football players go on and beat up on yo' pads\nAll in together now, c'mon y'all (beat up on yo', beat up on yo')\nGo on beat up on yo', beat up on yo', beat up on yo' pads-pads\n\n[Outro: Snoop]\nFor all my little homies in the Snoop Youth Football League\nYeah, you know Coach Snoop love y'all\nAin't nuttin to it but to do it, uh\nFor all my future NFL stars (yeah)\nYeah from the SYFL to high school (get it)\nOn to college, on to the big leagues\nThat's what it does\nYeah (run little homies, run run little homies, run!)\nFor the kids man, it's for the kids man!\nIt's for the kids, hold on hold, back up {*fades out*}", "image": "https://images.genius.com/9eeff8d4aa3579798c6d6f74d21fad47.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}