{"songs": [{"title": "Fucked Up", "album": "Life", "year": null, "lyrics": "[Intro]\nYEAH! YEAH!\nC'mon...\nLet me tell you cats {get what I'm sayin}\n\n[Hook]\nSnitchin and squealin and the underhand dealin\nThat's how you get fucked up!!\nRobbin and stealin like you ain't got feelings\nThat's how you get fucked up!!\nGettin head in the bed with another man's wife\nThat's how you get fucked up!!\nYou better always think twice how you're livin your life\nThat's how you get fucked up!!\n\n[Verse 1]\nPeople walk around just, in a daze and oblivious\nTo them demons that live in us\nWho can you really trust\nIs it them demons that got us schemin or is it really us?\nPeople really fuss, and them guns really bust\nBrothers dyin over silly stuff\nThem streets can get really tough\nThey ain't playin man, you better {get what I'm sayin}\n\n[Hook]\nWhen you can't forgive and all you spit is negative\nThat's how you get fucked up!!\nWhen you're dissin your elders and cheatin your relatives\nThat's how you get fucked up!!\nMessin with a man's crib, kids or wife\nThat's how you get fucked up!!\nYou better think twice how you're livin your life, cause\nThat's how you get fucked up!!\n\n[Verse 2]\nYo, I'm a true school cat, just a cool cool cat\nGot security tellin these people to move back\nI got two new tracks, somethin new from DAT's\nTunnel Rats with Proper and Triune in the back\nI don't move with a pack, I move membership\nHip-Hop we livin it and what I'm doin is rap\nBut cats wanna talk that crap\n'Til they see that I'm not playin, you better {get what I'm sayin}\nEveryday more betrayin, more lyin, and from friends\nMore crime and more revenge - HUSH\nThings are really rough; cause there's really no one out there\nThat I doubt that you can really trust\nThem guns bust - how many hustlers gotta die\nGo to jail for a fiend to get a rush?\nFrom ashes to dust, that man of lust\nIs decayin, you better {get what I'm sayin}\n\n[Hook]\nTalkin that crap behind another man's back\nThat's how you get fucked up!!\nSpittin gossip and scandal and don't have facts\nThat's how you get fucked up!!\nBein caught in the hype, flashin off your ice\nThat's how you get fucked up!!\nYou better always think twice how you're livin your life cause\nThat's how you get fucked up!!\n\n[Verse 3]\nI'mma close it out, cause all my foes they doubt\nI'm rollin out, they know what I'm all about\nI don't roam about, I appear and shout\nI wear 'em out, then we clear 'em out\nI steer the route to where the end be at\nWhere the peace, where the love, where my friends be at\nWhere the jealous ones envy that\nAnd they start betrayin, that's right you better {get what I'm sayin}\n\n[Hook]\nIf you schemin a lot on what another man's got\nThat's how you get fucked up!!\nDreamin up a plot for another man's spot\nThat's how you get fucked up!!\nIf you live by the knife then you die by the knife\nThat's how you get fucked up!!\nYou better always think twice how you're livin your life cause\nThat's how you get fucked up!!\nFlashin what you got cause you think it's cool\nThat's how you get fucked up!!\nYou better watch yourself cause when you ACT A FOOL\nThat's how you get fucked up!!\nWhen you act like you better, treatin men like mice\nThat's how you get fucked up!!\nYou better always think twice how you're livin your life cause\nThat's how you get fucked up!! {get what I'm sayin}\n.. {get what I'm sayin}", "image": "https://images.genius.com/12162bd5dc20dab4c0cbb67190522d80.500x493x1.jpg"}], "artist": "KRS-One"}