{"songs": [{"title": "Striving For Perfection - Raekwon", "album": null, "year": null, "lyrics": "Yeah yeah I'm tired of doing this shit\nAight word, aight I'ma set it\nTell me how you feel man\nYo son, check the fly shit son\nSup cousin how you doin?\nYo baby check it man\nI got a new connect son, for real man\nFuck all this twenty-four brick shit man\nNo doubt\nMy man got out of state for fifteen\nYeah\nYouknowhatI'msayin?\nYo know my man's gonna represent PA, politickin to death so\nRight right\nIt's all good, what's up? What you wanna do?\nWe gotta move God, we gotta move God, we gotta migrate\nGet the fur, get the fuck outta New York, yaknowhatI'msayin?\nBounce man, start fuckin with bigger and better shit\nSo you tellin me no more big eights strictly breaks\nNo more no more no more man\nThen I'm with you, I've been waiting\nNo more God\nWHASSUP?\nIt's the pot of gold right here man this is it, man this is glory\nYouknowhatI'msayin?\nSo yo, the first thing we gotta do man\nIs just know what we gonna do with this cream when we get it man\nRight\nCause I'm not trying to just be, sitting on motherfucking two-hundred thou\nAnd acting like I'ma just be a\nNah\nA drug dealer all my life\nNah\nSon I got bigger and better plans Son\nNo doubt, we gonna move on man\nAnd you know I be fuckin with anybody man\nSon, long as the love and the trust is there Son\nWe gonna grow God\nYou know it Tony\nWe gonna grow like a plant Son\nYo you coming at me like that Son?\nFor real Son, come on you know me man\nYou know my style Son\nYou know how my heart feels though God\nNo doubt\nBut yo God, for real, this is my last time God\nI'm hangin this shit up man if this shit don't work right here God\nYouknowhatI'msayin?\nWord up, I feel the same way\nI feel the same way kid\nYo God, yaknowhatI'msayin?\nI got shot at man, my moms windows got shot the fuck up man\nYeah\nYo God, my baby's in here God, see I gotta take time man\nAnd raise my family man\nYeah yeah yeah\nYaknowhatI'msayin? Sit around man, my grandkids man\nBut yo Son, it's like this man\nWe all livin man, we here now man\nWord man\nYouknowhatI'msayin? Let's not think like we gon be stagnating man\nLet's keep movin ahead man, keep our head up man\nTake care of our families man\nGod, word is bond, I'm your eyes that's in back of you kid\nLet's do it then", "image": "https://images.genius.com/32fabf2b8b2eb256a0e1d6a14a76852f.500x500x1.jpg"}], "artist": "Raekwon"}