{"songs": [{"title": "Doomsday", "album": "Operation: Doomsday.", "year": "1999-04-20", "lyrics": "[Intro: Pebbles the Invisible Girl, MF DOOM]\nMic Check\nWhen I was led to you\nI knew you were the one for me\nCome through dig the sound\nI swear the whole world could feel you MC\nCrowd around\n\n[Verse 1: MF DOOM]\nI used to cop a lot, but never copped no drop\nHold mics like pony tails tied in bobbalobs\nStop and stick around, come through and dig the sound\nOf the fly brown 6-0 sicko psycho who throws his dick around\nBound to go three-plat, came to destroy rap\nIt's a intricate plot of a b-boy strap\nFemstat cats get kidnapped\nThen release a statement to the press, let the rest know who did that\nMetal Fist terrorists claim responsibility\nBroken household name usually said in hostility\nUm... what is MF? You silly\nI'd like to take \"Means to the End\" for two milli'\n\"Doo-doo-doo-doo-doo!\" That's a audio daily double\nRappers need to fall off just to save me the trouble, yo\nWatch your own back came in and go out alone, black\nStay in the zone—turn H2O to Cognac\n\n[Hook: MF DOOM]\nOn Doomsday!, ever since the womb ‘til I'm back where my brother went, that's what my tomb will say\nRight above my government; Dumile\nEither unmarked or engraved, hey, who's to say?\n\n[Verse 2: MF DOOM]\nI wrote this one in B.C. D.C. O-section\nIf you don't believe me, go get bagged and check then\nCell number 17, up under the top bunk\nI say this not to be mean, wish bad luck or pop junk\nPop the trunk on Cee Cipher Punk, leave him left scraped\nGod forbid, if there ain't no escape, blame MF tape\nDefinition \"super-villain\": a killer who love children\nOne who is well-skilled in destruction, as well as building\nWhile Sidney Sheldon teaches the trife to be trifer\nI'm trading science fiction with my man the live lifer\nA pied piper holler a rhyme, a dollar and a dime\nDo his thing, ring around the white collar crime\nGet out my face, askin' ‘bout my case, need toothpaste\nFresher mint, monkey-style nigga get dentadent\nAnd dope fiends still in they teens, shook niggas turn witness\nReal mens mind their own business\nThat's the difference between sissy-pissy rappers that's double-dutch\nHow come I hold the microphone double-clutch\nC.O.'s make rounds, never have ‘ox found\nOn shakedown, lock-down, wet dreams of Fox' Brown\n\n[Hook: MF DOOM]\nOn Doomsday!\nEver since the womb ‘til I'm back where my brother went\nThat's what my tomb will say\nRight above my government; Dumile\nEither unmarked or engraved, hey, who's to say?\n\n[Bridge: MF DOOM]\nDoomsday\nEver since the womb ‘til I'm back to the essence\nRead it off the tomb\nEither engraved or unmarked grave, who's to say?\n\n[Verse 3: MF DOOM]\nPass the mic like \"Pass the peas like they used to say\"\nSome M-er F-ers don't like how Sally walk\nI'll tell y'all fools it's hella cool how ladies from Cali talk\nNever let her interfere with the Yeti ghetto slang\nNicknames of nimble and tip of nipple metal fang\nKnown amongst hoes for the bang-bang\nKnown amongst foes for flow without no talking orangutans\nOnly gin and Tang\nGuzzled out a rusty tin can, me and this mic is like yin and yang\nClang! Crime don't pay, listen, youth\nIt's like me holding up the line at the kissing booth\nI took her back to the truck, she was uncouth\nSpittin' all out the sunroof, through her missing tooth\nBut then she has a sexy voice, sound like Jazzy Joyce\nSo I turned it up faster than a speeding knife\nStrong enough to please a wife\nAble to drop today's math in the 48 keys of life\nCut the crap far as rap\nTouch the mic, get the same thing a Arab will do to you for stealing\nWhat the Devil? He's on another level\nIt's a word! No, a name! MF - the Super-Villain!\n\n[Outro: Pebbles the Invisible Girl]\nWhen I was led to you\nI knew you were the one for me\nI swear the whole world could feel you MC", "image": "https://images.genius.com/c0a80e3098696bdf600f54a76667c069.1000x1000x1.jpg"}], "artist": "MF DOOM"}