{"songs": [{"title": "Love Don’t Live Here", "album": "Dreamchasers", "year": "2011-08-11", "lyrics": "[Chorus]\nYou abandoned me\nLove don’t live here anymore\nJust a vacancy\nLove don’t live here anymore\nYou abandoned me\nLove don’t live here anymore\n\n[Verse 1]\nHeart colder than Chicago\nMiddle of December because my life is like a slideshow\nAs fast as its coming, is as fast as its going\nMy friends and my woman like money\nJust blowing in the wind\nDamn, I thought they was rolling 'til the end\nMy mama told me them niggas wasn’t rolling to begin\nSo its blood over water, family over a friend\nToo much of water will drown you that blood will run through your skin\nThat blood flow from your heart\nTold me to go from the start\nAnd if you turn off my lights I bet I will glow in the dark\nI bet you I will shine bright\nAs bright as the Prime Night\nThem youngins tryna murder and them niggas ain't tryna fight\n'Cause Mama was never there, his father they never met\nSo love don’t live there so they shooting or better yet\nThey scheming instead of dreaming, murking instead of working\nThey locking them in them prisons\nBut really them youngins is hurting\n\n[Chorus]\nYou abandoned me\nLove don’t live here anymore\nJust a vacancy\nLove don’t live here anymore\nYou abandoned me\nLove don’t live here anymore\n\n[Sample]\nGuy 1: You want to take care of that business?\nYou want to smoke old Willie since your punk ass daddy here ain't got the heart to put in the work?\nGuy 2: Spent ten years of my life in prison for putting in work!\n\n[Verse 2]\nShawty 16, fucking everything moving\nGot raped by her step-dad, he told her \"Just do it!\"\nNo job, selling the pussy to get to it\nDrinking and smoking anything to get through it\nAnd love don’t live there, struggling she been there\nShe ain't got no heart, shawty like the tin man\nTell her anything she won't feel it’s like thin air\nShe done heard everything, you can drop a pin there\nAnd she probably hear it, looking in the mirror\nStaring at her reflection and it scare her\nEvery time she cry she feel nobody hear her\nDevil all in her ear and he whispering that he dare her\nShe hear him\nEverybody fronted on her like she was Rosa Parks\nTried to push her in the back where it was dark\nShe like a gold fish, they got her swimming with the sharks\nYear later found her murdered slayed in the park\n\n[Chorus]\nYou abandoned me\nLove don’t live here anymore\nJust a vacancy\nLove don’t live here anymore\nYou abandoned me\nLove don’t live here anymore\n\n[News Reporter: Monica Malpass]\nPhiladelphia police are still trying to piece together the death of teenage girl found partially clothed in Fairmount park today\nAction news reporter Vernon Odom following developments, he joins us live at police headquarters tonight with the very latest", "image": "https://images.genius.com/444ab187fd5c557d6d65efc6fb8931ea.320x320x1.jpg"}], "artist": "Meek Mill"}