{"songs": [{"title": "I’m Nice", "album": "No Ceilings 2", "year": "2015-11-26", "lyrics": "[Intro]\nNo ceilings\n\n[Verse 1]\nWait a minute\nWait a minute, where you going?\nAin't my business where you going\nI just want some before you go and\nWait why you in your feelings when I wanna feel something?\nWhy you in your purse when I'm tryin' to tell you something?\nWhy you on your phone after 2 in the morning?\nWho the fuck you talking to at 2 in the morning girl?\nI swear I'm wit my side bitch baby\nCuz I ain't got time for your main tricks\nYeah-yeah-yeah-yeah-yeah\nAnd if the side bitch start acting crazy\nI'mma run to the next side bitch\nAnd tell the last bitch \"Come chase me, baby\"\nYeah, feel like it's over, you know it's over with\nYou get my feelings and time and shit\nI'm in my feelings cause it's over\nAnd you know right is right, so come over tonight\nDon't want fuss and fight, let's get right\nRight now a nigga feeling so nice\nAnd I feel like I owe you something\nLet me show you something girl\nAnd it's gon' be nice\nRight now a nigga feeling so nice\nFeel like I owe you something\nLet me show you something girl\nI'm nice, T I'm nice\nE I'm nice, Hood I'm nice, Steve I'm nice\nHold up, I think these pills give me extra emotions\nHold up, I think they kicking in, I'm going through the motions\nYeah-yeah-yeah-yea\nI feel like celebrating, what you doing, I'm bout to come over\nYour homegirl there, I really feel like I can take both of 'em\nOh my\nCan I ask why\nYou give me that eye\nEvery time we Facetime?\nThat's cause you know I\nI'mma come back, reply\nWith \"Don't you move a muscle, I'm bout to come by\"\nEvery time, like we on rewind\nBack it up, rewind\nLike (Missy Elliot Reference)\nWe fuck on Versace\nYou watch me\nCause I got the mirror on top me\nAnd I be just going in like Rocky\nThat dick got you snoring, I record you, send you a copy\nYou be so embarrassed, you say don't mock me\nAnd I be like that's our secret that I keep\nAnd I feel like pouring some lean in this styr-e\nSaid I feel like pouring some lean in this styr-e\nHold up\nYou know I'm the nicest, this dick need a license\nBut why did you leave me, I swear it's a crisis\nIf you ever need me, I come quick as lightning\nDon't give him no pussy if he cum quick as lightning\nJust saw your sis and I got so excited\nShe tell me you just celebrated sobriety\nBut you didn't invite me\nThat's that bullshit, I need a lighter\nYou should be nicer\nI swear I'm wit my side bitch baby (hold up)\nCuz I ain't got time for your main tricks\nYeah-yeah-yeah (hold up)\nBut that's OK cause I'm nice\nHey Manny, I'm nice\nNo ceilings", "image": "https://images.genius.com/ed7fb7fe9af1d913b520bf5336619560.800x800x1.jpg"}], "artist": "Lil Wayne"}