{"songs": [{"title": "The Documentary 2", "album": "The Documentary 2", "year": "2015-10-09", "lyrics": "[Intro: Samples]\n\"—The Documentary\"\n\"—two!\"\n\"—The Documentary\"\n\"—two!\"\n\"—damn it, I done did it again\"\n\"—Game's still in Cali—\"\n\"—Game's still in Cali, eatin' off The Documentary\"\n\"—The Documentary\"\n\"—two!\"\n\"—damn it, I done did it again\"\n\n[Hook]\nYo, what it do, Blood? Talk of the town\nPremo, Doc Dre, still holdin' it down\nAftermath, do the math, nigga, you know the sound\nDoc 2, thought you knew, still holdin' the crown\n\nYo, what it do, Blood? Talk of the town\nPremo, Doc Dre, still holdin' it down\nAftermath, do the math, nigga, you know the sound\nDoc 2, thought you knew, still holdin' the crown\n\n[Verse 1]\nLast ten been on ten\nMake it look easy, my pen been on Ren\nMy niggas been on kush, my bitches been on X\nKing of California give a fuck who got next\nI'm right now\nBump your gums and the ratchet’ll shoot ya\nSend your ass back to the future\nNo Delorean\nAventador and shit, bumpin' Future\nWhy your girl pullin' on my hookah\nMoney stretch like Kama Sutra\nStarted with the roosters\nThen I start spittin' clean the money like a loofah\n6'5, tall like a hooper, ball like a hooper on the floor like a hooper\nSo I must be Clay with the .38, Thompson with the Thompson\nEverything about me Compton—I mean—everything about me Bompton\nI ain't never had shit, I grew up like Magic Johnson\n\n[Hook]\nYo, what it do, Blood? Talk of the town\nPremo, Doc Dre, still holdin' it down\nAftermath, do the math, nigga, you know the sound\nDoc 2, thought you knew, still holdin' the crown\n\nYo, what it do, Blood? Talk of the town\nPremo, Doc Dre, still holdin' it down\nAftermath, do the math, nigga, you know the sound\nDoc 2, thought you knew, still holdin' the crown\n\n[Verse 2]\nI taught myself how to spit from listening to It Was Written\nMy first bars wasn't dope but I had that in the kitchen\nSuge wouldn't listen, Irv wouldn't listen\nSo I ran around with Diddy, Aftermath in the Mission\nI would never ask another man for permission I do me\nFuck the Illuminati, I'd rather ride around in hoopties\nBut now it's the Ghost, my gold Ds is two threes\nStill hop in the freestyle, kick it like two Bruce Lee's\nCut open the noose leaves\nForeign on the hill like it's Lauryn\nSmoking la la like the Fugees\nThinking to myself, is it God or Lucy?\nPrada or Gucci, popping Cris', Rihanna, Karrueche\nHomie I ain't gotta gas I'm so ahead of you fags\nThe shit I spit off Premo tracks burn confederate flags\nTake the roof off roof, gimme Proof back and 2Pac\nWestside, but you already knew that\n\n[Hook]\nSo, what it do, Blood? Talk of the town\nPremo, Doc Dre, still holdin' it down\nAftermath, do the math, nigga, you know the sound\nDoc 2, thought you knew, still holdin' the crown\n\nYo, what it do, Blood? Talk of the town\nPremo, Doc Dre, still holdin' it down\nAftermath, do the math, nigga, you know the sound\nDoc 2, thought you knew, still holdin' the crown\n\n[Verse 3]\nI've been rapping for 12 years, 6 months, 16 days\nNow I'm a veteran, spit a 16 sixteen ways\nSixteen in a clip, spit it 16 ways\nI know six teens, pull up to a sweet sixteen and spray\nI'm like sixteen Jay's but the beat I can manage\nSo every sweet 16 is like Duke and Kansas\nYou bout to lose advantage, I will come through crews and bandits\nBruise and damage, fuck you rules and manners\nI kick back, click clack, bump the Wu in Phantoms\nFuck rap, I only respect Ja Rule and Hammer\nMaybe the old Em, I'm Slim and I'm shady\nMaybe the old him or Rakim\nYou niggas keep bullshittin' like Joakim\nYou so him, I'm so not, you so bitch, I sold rock\nMy four-four cocked, I been a Top Dawg, I know Dot\nBack in '06 I pulled up in that gold drop\nFive million sold livin' in the dope spot\nBack when my first album was the—\n\n[Hook]\n—talk of the town\nPremo, Doc Dre, still holdin' it down\nAftermath, do the math, nigga, you know the sound\nDoc 2, thought you knew, still holdin' the crown\n\nYo, what it do, Blood? Talk of the town\nPremo, Doc Dre, still holdin' it down\nAftermath, do the math, nigga, you know the sound\nDoc 2, thought you knew, still holdin' the crown\n\n[Scratches]\n\"—The Documentary\"\n\"—two!\"\n\"—The Documentary\"\n\"—two!\"\n\"—damn it, I done did it again\"\n\"—Game's still in Cali—\"\n\"—Game's still in Cali, eatin' off The Documentary\"\n\"—The Documentary\"\n\"—two!\"\n\"—damn it, I done did it again\"\n\n[Outro: DJ Clue + DJ Envy + Funkmaster Flex]\nCheck it out, man, I go by the world-famous DJ Clue, desert storm, shoutout to my nigga, Game. When I first came to the West Coast, and me and Game hit the studio up, and he rapped for me, I knew he had all the key ingredients to become a legendary rapper\n\nHere's DJ Envy from that Breakfast Club—I remember the first time hearing The Game, I just knew he was gonna be one of them niggas, one of them legendary niggas. That boy Game, he's a problem, I got my money on it\n\nFunk Flex, baby! I dropped the bomb on every one of them joints off The Documentary!", "image": "https://images.genius.com/f5bd9dcb51fd19e06b10b2ae0e3620cf.1000x1000x1.jpg"}], "artist": "The Game"}