{"songs": [{"title": "Itty Bitty Piggy", "album": "Beam Me Up Scotty", "year": "2009-04-18", "lyrics": "[Intro]\nUh-huh, uh-huh, yo, a-yo\n\n[Verse (false start)]\nI was on the plane with Dwayne\nYou can call me Whitley, I go to Hillman\nListen, I'm the baddest in the school, the baddest in the game\nExcuse me, honey, but nobody's in my lane\nWhen you was in New York, you was fuckin' the Yankee\nI was fuckin' with base, I was pitchin' to Franky\nThese bitches so cranky, get 'em a hanky\nM-mommy, I'm cold, gimme my blankie\n\n[Spoken]\nWoah, woah, woah, woah, woah, woah, woah!\nOk, ok, woah, woah, Holiday\nWait, hold on, hold on, Holiday!\nYou can't give it to 'em dry like that\nYou gotta get that shit wet first, nigga, like, come on now!\nYou gotta prep them for shit like that (I got you!)\nThey can't just get that shit right off the top\nLike, you gotta bring that shit back\nBring that shit the fuck back! (Let's go!)\n\n[Verse]\nUh-huh, uh-huh, yo, a-yo\nI was on the plane with Dwayne\nYou can call me Whitley, I go to Hillman\nListen, I'm the baddest in the school, the baddest in the game\nExcuse me, honey, but nobody's in my lane\nWhen you was in New York, you was fuckin' the Yankee\nI was fuckin' with base, I was pitchin' to Franky\nThese bitches so cranky, get 'em a hanky\nM-mommy, I'm cold, gimme my blankie\nFlyer than a kite, I get higher than Rapunzel\nKeep the Snow White, I could buy it by the bundle\nStep your cookies up 'fore they crumble\nDon't be actin' like the Cardinals and gon' fumble (fumble)\nCause I'm a Steeler, fresh up out the dealer\nAll the dope boys gon' feel her\nFlow so sick I need a healer, fuck is my MAC\nConcealer? I be out in Queens on the back of four-\nWhee-whee-whee-whee-whee-whee-wheelers, I'm a big deal\nThat's why I get more head, than a pigtail\nPut some ranch out, I’m gettin' the munchies\nI think I'll have a rap bitch for my entree\nCause, they be thinkin' they can spit, spit-shine my shoes\nYou know I keep a bad bitch, let me sign your boobs\nI'm the only thing hoppin', like a kangaroo\nI mean the only thing poppin', like a can of brew\nListen, you should buy a sixteen, cause I write it good\nThat 808 WOOF WOOF, cause I ride it good\nAnd bitches can't find they man, cause I ride it good\nI'm the wolf, where is Little Red-a Riding Hood?\n\n[Chorus]\nNow, if you see a itty-bitty piggy, in the market\nGive that bitch a quarter and a car, tell her \"park it\"\nI don't fuck with pigs, like \"As-Salaam-Alaikum\"\nI put 'em in a field, I let Oscar Mayer bake 'em\nAnd if you see a itty-bitty piggy, in the market\nGive that bitch a quarter and a car, tell her \"park it\"\nI don't fuck with pigs, like \"As-Salaam-Alaikum\"\nI put 'em in a field, I let Oscar Mayer bake 'em\n\n[Interlude]\nIt's like I just single-handedly annihilated, you know, every rap bitch in the building\nLike, like, I'm Nicki Minaj, Nicki Lewinsky, Nicki the Ninja, Nicki the Boss, Nicki the Harajuku Barbie\nLike I mean I don't even know why you girls bother at this point\nLike, give it up, it's me!\nI win! You lose Hahahahahahaha\nOh shit hahaha, yo\n\n[Refrain]\nI'm a bad bitch, I'm a, I'm a bad bitch\nI'm a bad bitch, I'm a, I'm a bad bitch\nI'm a bad bitch, I'm a, I'm a bad bitch\nI'm a bad bitch, I'm a, I'm a bad bitch\n\n[Outro]\nHahahahahaha\nI told you, I told you before\nI told you y'all was gonna have to pick my fruit out\nNow listen, in addition to pickin' my fruit out\nI want y'all to start going to the boutiques\nKnow what I'm saying?\nGet some get some get some crazy shit for me\nI want, I want, you know, leopard-skin, and you know?\nI want, I want all that crazy lizard-skin shit, like, you know?\nMake sure you...\nYou can be my personal shopper!\nHahahahahahahahahahahaha\nAaaaayyyyooooo!\nWOO!\nUh-huh, uh-huh, uh-huh, UGH!", "image": "https://images.genius.com/c17abde454a1facc06d3ca87d02b8f7c.263x263x1.jpg"}], "artist": "Nicki Minaj"}