{"songs": [{"title": "No Competition", "album": "Fuck A Mixtape", "year": "2010-05-27", "lyrics": "[Intro]\nAy, ay! Young Jeezy, let's get it, my nigga!\nRubber Band Man & Snowman in this bitch!\nAy! Ay! Y'all already know, man, y'all can't fuck wit us, man!\nIt's the King and the Killa, nigga!\nC.T.E., P$C, what's happening?\n\n[Verse 1: T.I.]\nFrom the trap shit to all the rap shit\nGave you numbers on the bricks and all of that shit\nThey run up on the team, I bet they be fallin' back quick\nStack the magazine, I'm giving 'em all of that clip\nY'een heard the latest? Ho, ya fuckin' with the greatest\nI know the pussy niggas and the sucka niggas hate us\nBut the lames can't fade us and ain't any way to rate us\nTook the train when they see us 'cause there ain't no way to play us\nThe fame didn't make us and the Feds didn't take us\nSo we flamin' out in Vegas, private plane-ing in Jamaica\nWe the top two crews so it ain't a way to spray us\nLay us, down, nigga who, nigga where?\nDream about our deaths then wake up and say a prayer\nGrab some tissue for this new asshole we finna tear\nAin't a handgun made for man that could prepare ya\nSay what? Buck on us? I dare ya\n\n[Chorus (sample)]\nThere is no competition!\n\n[Interlude: Young Jeezy]\nYeah! Ay! You already know what it is, nigga!\nC.T.E., U.S.D.A. for life nigga!\nU.S.D.A is the clique, nigga! Ha-ha! Yeah!\nTip, what up, nigga? You already know what it is, nigga!\nA-Town firehouse, nigga!\n\n[Verse Two: Young Jeezy]\n(Young Jeez!) Who me? I'm a coupe-driving, bird-flipping\nO-serving, gun-toting, set-tripping, chicken-flipping\n(Jeah!) Range-Roving, gat-toting, hay-smoking\n(Let's get it!) You know I'm sack-holding (Ay!)\nYou could save the hating 'cause I do not need it\nGod damn, I'm so conceited (Ha-ha!)\nYou was rapping, I was trapping, I was busting, they was ducking\nI was gunning, they was running, first nigga said something\nPolice-ass niggas, yeah they so suspicious (Ay!)\nBlowing Cali kush, yeah, so delicious (Ha-ha!)\nGrand Hustle and Corporate Thuggin'\nYou can ask ya girl, I'm the one she's loving\nFour-four pound, my Cannons been Aphilliated (Damn!)\nDamn right, nigga, A-Town's own\nMr. 17.5, I really got 'em for that\n\"Them niggas getting money\", got a problem with that?\n\n[Chorus]\n\n[Outro: DJ MLK]\nHold on, hold on, hold on, hold on. This DJ MLK! Y'all know I don't talk too much on no goddamn mixtape. Nah, I got too much shit to be damn doin'. You know what I'm sayin'? I DJ seven-plus days a week in the damn city. You know! I just wanna shout out my [?] fam, I see ya! [?] H-Town in the goddamn building! Shout out [?]! Mars, I see ya!", "image": "https://images.genius.com/6f08c14dfef32114f3f4458805c96968.500x500x1.jpg"}], "artist": "T.I."}