{"songs": [{"title": "They’re Gonna Laugh At You", "album": "The Worst", "year": "2000-09-12", "lyrics": "[Verse 1]\nHit 'em up with a big fat M-W for the Midwest\nThem who come and test then end up with a big mess\nThey laughing at you, not me, 'cause if so they have no clue\nWanna happen let loose the Kraken when I'm all on that Caribou Lou\nMisery's arisen, misery's arisen\nThievin' cheesin' bitches wanna listen\nTo me get my quota, now that I'm older\nMy shit is colder, then circle city Minnesota\nI can flow to kingdom come, bring them some things\nThat sling rings around fiends unseen we from\nShow me foreign like Mitsubishis\n'Cause we are the species, those who be rollin' up in Niecie's\nProspect check, 5-7 and 20 minus 11\nN9ne crushin' niggas who said I wasn't bustin'\nThey said I couldn't flow and now I'm a sinner bust\nTo those who said I shouldn't hold my breath because\n\n[Chorus]\n(They're all gonna laugh at you!)\nDr. Giggle stuck in the middle\nYou don't wanna make me have to blast at you\n(They're all gonna laugh at you!)\nNnutthowze dwelling, pockets swelling\nBecause I'm doing what I have to do\n(They're all gonna laugh at you!)\n816 ways to die, it's up to you\nWhat you wanna do?\n(They're all gonna laugh at you!)\nWhat? The M-W said to trouble you\nHit 'em up\n\n[Verse 2]\nI've got problemos, them hoes tripping with me demos\nFuck it, when those dollars coming in with them limos\nThey think not 'cause they think we at homes like the Wizard of Oz got\nSo we throw up the opposite of shazbot\nLet 'em know, Missouri ain't the green acre and hickish wallpaper and town that you're savoring\n[?] niggas with lyrics\nIf you ain't real I mob ya\nCan't stop a real niggaragua\nIt's all delicious, no need to be suspicious\nThis is not a fictitious song full of glitches\nThis is neglected rapping with flows perfected\nBrown complected nigga who's dropped from Perspective\nMuch love to Jimmy J and Terry Lew\nGave me the chance to do my witchcraft my trickery, my voodoo new\nLyrics now, we used to lay 'em down In L.A\nEvery single day at least them niggas didn't say\n\n[Chorus]\n(They're all gonna laugh at you!)\nDr. Giggle stuck in the middle\nYou don't wanna make me have to blast at you\n(They're all gonna laugh at you!)\nNnutthowze dwelling, pockets swelling\nBecause I'm doing what I have to do\n(They're all gonna laugh at you!)\n816 ways to die, it's up to you\nWhat you wanna do?\n(They're all gonna laugh at you!)\nWhat? The M-W said to trouble you\nHit 'em up\n\n[Verse 3]\nI can give a tihs\nIf a aggin wanna spit about that Tech en9N\nThat making his way to the top [?]\nPermanent not tihs\nLike chasing them clocks\nThey don't understand that [?] dog [?]\nNOFX, flex like chapped lips on Blistex\nTurn female restrooms unisex\nGetting relish, no matter, whatever I gotta do\nHad a few Caribous, got the dribbles like Syracuse, tear a fuse\nComing up out my trap like that, laugh at this\nBetter really come with it when steppin' into my vast abyss\nMaster this if not laugh at them\nHave 'em off in the trunk with a rat pack and I'll be like slim\nDr. Giggles ain't even heard the last of me\nYou say I'm country so you think they gonna laugh at me\n[?] have a blast with me\nI'm ripping ass, nigga, that's the way it has to be, has to be\n'Cause we the party people night and day, bianc\nLiving crazy is the only way, bianc\nIf you ever diss these licks that I spit\nWe can flow any day, wack or even tight, either way\n\n[Chorus]\n(They're all gonna laugh at you!)\nDr. Giggle stuck in the middle\nYou don't wanna make me have to blast at you\n(They're all gonna laugh at you!)\nNnutthowze dwelling, pockets swelling\nBecause I'm doing what I have to do\n(They're all gonna laugh at you!)\n816 ways to die, it's up to you\nWhat you wanna do?\n(They're all gonna laugh at you!)\nWhat? The M-W said to trouble you\nHit 'em up", "image": "https://images.genius.com/87934aebc9ee54de45c58f2e2bede516.369x369x1.jpg"}], "artist": "Tech N9ne"}