{"songs": [{"title": "Gimme Whutcha Got", "album": null, "year": null, "lyrics": "Kurupt:\nYo Barshawn\nGimmewhutchagot nigga\nCome and drip into the realm of the X-files\nGimmewhutchagot nigga\nGimmewhutchagot nigga\nGimmewhutchagot nigga\nGimmewhutchagot nigga\n\nGet your position correct\nGet your ammunition correct\nThe tactful tech technician effect(Bitch!)\nI got a quarter-key\nYou wanna to try to stick me for it?\nPut the loot up, the shoot up, and hit me for it?\nNiggas hang for, do the same thang for it\nPenetrate like, uh, poor the gas, blast and then bang for it\nY'all supposed to be some type of raw doggs, nigga\nFuck around and get your shit spit like laws, nigga\nFantasies never formulate\nSo when you get the formula to format\nRestructure and reshape\nRelax or we take all\nWe make sure we shake all\nWe shake tame or aim or flame all\nA bitch tried to play me like nothing's really real\nLike I ain't really real and I ain't really got skills(Bitch!)\nI make you hot like ten tons of lava rocks\nThe Juggernaut crackin niggas like cinder blocks, nigga\n\nChorus:\nGimmewhuthcagot nigga\nGet blazed, get shot nigga\nWe make it hot nigga raw\nMy nigga Barshawn\nKurupt with the auto-metal cock and draw\nI ain't got time to see what you saw\nBeat back mothafucka before I crack your jaw\nThis ain't about nothin but life and law\nNiggas killin me\nWhat you ice-grillin me for?\n\nBarshawn:\nNow how you gonna let my looks deceive you?\nMy raps is lethal\nI kicks shit that would amaze you, they daze you\nY'all think my rhymes is voodoo\nFor the first time comin through\nAin't been a minute yet\nAlready, cats wanna eye-screw\nPlottin to pop you\nYou don't know me duke\nThe one that shoot\nYou all mad cuz I'm spendin loot\nThat you all broke ass niggas been tryin to scoop\nSee I done paid my dues\nDon't be fooled by the pretty boy image\nCuz you'll get blasted up in less than a minute\nIt's Barshawn and Kurupt, y'all gonna feel it\nCuz when I bless a track, I spit venom in it\nSo how you wanna do it, rappin or gun-clappin\nEither or, it could happen\nKurupt, move the Glock to his mouth for they gappin\nI bet next time you stay in a child's place\nThis is Rome folks talkin, you don't relate\nIf you can't hold the weight, then don't debate\nKurupt: Pushin crates, headed upstate with chrome plates (check it out)\n\nChorus:\nGimmewhuthcagot nigga\nGet blazed, get shot nigga\nWe make it hot nigga raw\nMy nigga Barshawn\nKurupt with the auto-metal cock and draw\nI ain't got time to see what you saw\nBeat back mothafucka before I crack your jaw\nThis ain't about nothin but life and law\nNiggas killin me\nWhat you ice-grillin me for?\n\nBarshawn:\nYou all fiend, daydream for cream I've seen\nEyes gleam for the drop-top I be in\nYou wanna end my life, my niggas ain't seein\nIf so happen you did that\nWhere the fuck you expect the rest at?\nWe got that too comin through a quarter to two\nBlazin they duct-tapin you and your boo\nAll at the revenue stand, we was once a crew\nMad tight, but that's life\nI learned the game\nSame cats that you roll with will split your game\nSee I'm in it for the cheese nigga\nFuck the fame (nigga, fuck the fame, mothafuck the fame)\n\nKurupt:\nI play the nickel-plated position get penetrated\nPopes just pause, I rise with my doggs\nAnd collar clothes impact and enthrone\nGone, zone the dome and then blown\nI heard raw before I saw raw before\nMack milli's, mack 11's and four-four's\nMe and my nigga Shawn\nWhat you got weight on your shoulders\nThe freons gettin colder\nMe and my nigga Deion's hittin corners\nI got a beam on you chest-high\nFuck around and get your fuckin chest right\nI spreads like bad news\nBitches get played like the blues\nBlowin dicks like whistles\nLaunch like missles\nPop like pistols\nAnd confuse, misuse, enthuse, abuse, buy the twos\nCuz I refuse to chill like EP\nI prefer to get high live with the DP\nYou ain't raw nigga You more like subtle\nFuck you and your rebuttal You laid in a puddle\nIt's a storm, form reform your label form\nKeep calm or keep drippin in the twist of the swarm\n\n(Chorus)\nKurupt, young Gotti\nWest Coast, East Coast nigga\nRaw doggs\n\n(Chorus)\nGimmewhutchagot nigga\nGimmewhutchagot nigga", "image": "https://images.genius.com/e051ff42cc180d489d4e1b4e3e2906cd.333x333x1.jpg"}], "artist": "Kurupt"}