{"songs": [{"title": "Hold Me Back (Remix)", "album": "Cops & Robbers", "year": "2013-01-18", "lyrics": "[Intro: Rick Ross]\nUntouchable empire: double MG\nRich, young niggas you hear me? (yeah)\n\n[Verse 1: Rick Ross]\nI swerve in my Porsche, I cruise in my Chevy\nHer pussy deep as my voice, my Cuban links heavy\nI just bought out the bar, got these bitches so thirst\nEntertainment for women, my niggas ride for a verse\nI'm hustling global, I stunt like a champ\nAll these boy scouts soldiers, fuck you and your camp\nGot on all of my jewels, don't fall for the trap\nI got one of my fools, he don't listen to rap\nBut he listen to me, so listen to me\nWhen you listen to me, I get you this in a week\nPut a hater to sleep, the sky’s the limit\nI got R. Kelly money, when Fiesta was winning\nI got my back to the wall, can I handle my business?\nAnd I'm ready for war, niggas killing for pennies\nSee my focus was M's, my chances were slim\nCounting multiple millions, we should get this on film\nWhen you lean on the state, then you label the rat\nOn my feet so long, I won't fuck on my back (Rah)\n\n[Hook: Rick Ross]\nThese haters can't hold me back\nThese haters can't hold me back\nThese haters can't hold me back\nThese haters can't hold me back\nThese haters can't hold me back\nThese haters can't hold me back\nThese haters can't hold me back\nThese haters can't hold me back\nNo!\n\n[Verse 2: Gunplay]\nThese niggas want to hold me back, these hoes want to hold me down\nJail cells want to hold me in, my bond paid who finna hold me now?\nI'm tap toes on my square, 'til they flip the switch on my chair\nThese niggas be fake as fuck, but this official right here\nBlack Cadillac, scrap back could handle that\nBaka fa fly fly, till that barrel melt like candle wax\nDrop a sack: Geronimo, I ain't counting; gotta go\nEverywhere that dollar go, put more gold on my collar bone\nYou say you're thuggin', you say you're real\nYou say you're gangsta', so call\nSlide up with that oak out, everybody like \"Oh God!\"\nCut the deck, deal it out, bet I'll pull your ho card\nShit real, oh yah, thought it was a joke, huh?\n\n[Hook]\n\n[Verse 3: French Montana]\nThese dummies can't hold me back, these hoes can't hold me back\n3 banks can't hold these stacks, pin them hoes like goldie mack\nSmoke till I vanish, I got rich like I planned it\nIf there's a price on your head, on your roof, choppers we land it\nI used to play on that block, dark liquor and candles\nNow you look in my lot, rose Ferraris and Lambos\nTalkin South Bronx: Al Qaeda, Rozay, Meek Mill, Wale\nBlow mills like a ball player, Magic to Bird, Isiah\nShorty trying to kick it, looking for that meal ticket\nDiamonds splashin' goin flip it, on that Juicy J they trippin'\nI done came up off lick? boy, got you on a list, boy\nYour life on my wrist, boy, niggas need a fix, boy\n\n[Hook]\n\n[Verse 4: Yo Gotti]\nThese niggas trying to hold me back, these niggas trying to bake me in\nThese niggas ain't putting in work, these niggas gotta hate to win\nUs niggas don't play no games, my niggas gonna shoot them thangs\nReal life in that 901, real niggas we don't mess with lames\n305 all about that life, million dollars I spent that twice\nDope boy yea that my life, crack kids I spit that white\nThese niggas tryna study my grind, these niggas wanna see me shine\nThese niggas wanna take my spot, fuck boy you done had your time\nThese niggas act just like hoes, these niggas ain't got no heart\nThese niggas ain't fly like us, million dollars in my garage\n2 million house on the list, 5 million in real estate\nGreen slips in them D's boy, that maybach right on the way\n\n[Hook]\n\n[Verse 5: Lil Wayne]\nTurk came home, BG in the feds\nYour ho on my list, it's longer than Craig's\nMy bitch got cramps, she on the edge\nBall on these niggas, like I cut off my dreads\nOk I'm so so sew me, like needle and thread\nHit your ass with the chopper, all it leave is your legs\nMy cousin fighting a case, I hope he beat it like eggs\nYou niggas thinkin' you fly, that flight delayed\nAnd then I look at my bitch, I tell her wake up\nShe sleep butt naked, I sleep in my truks\nI smoke when I fuck, I fuck when I want\nBetween her legs, five star restaurant\nMan my life is a porn, leave your head on your horn\nYou niggas honey dijon, my weed loud as alarms\nI'm on the beach nigga, where the hoes be at\nGot street niggas to hold that gat, them niggas gon hold me down\nAnd these niggas can't hold me back (Tunechi)\n\n[Hook x2]", "image": "https://images.genius.com/9709cfbdc474bacbb5ec307760028dfc.500x500x1.jpg"}], "artist": "Rick Ross"}