{"songs": [{"title": "Friends Zone", "album": "Odd Future Unreleased Volume 3 ", "year": "2011-04-09", "lyrics": "[Verse 1]\nI'm Ace, what's your name? (Britney)\nOh that's nice, do you wanna hang out some time\nThat time on the clock, we could either go to Rosco's or Wingstop\nUnless, you wanna see a flick, my homie work at pacific\nThat means I could get a ticket for a couple six bucks\nBut that's priceless compared to getting my dick sucked girl\nI'm just playing, I'm not really hanging out with you for laying\nI'm tryna mold a relationship I'm claying\nSo I can hear your thoughts and see what your saying\nFavorite color, AP Government, this conversation I'm loving it\nWe can talk about your favorite music, talk about politics\nI got an open mind I'm into all type of shit\n\n[Hook]\nI just wanna be your friend girl (you're so respectful Tyler)\nI just wanna be your friend girl (we could be friends)\nWe could go to the movies, you don't gotta kiss me\nI could pull my pants down, you don't gotta lick me\nEven if we go to the bathroom, I'll help you, we don't have to getta quickie\nWe could have study groups, girl just hang with me\n(Best friends) yeah, (forever)\n\n[Verse 2]\nLook bitch (yeah) I'm not here to conversate, and listen to all your feelings, aight?\nI got things to do, my daughter hungry, bills to pay, and games to watch (what are you talking about?)\nI don't feel like listening to your feelings and how you feel and your favourite colour and all that (*gasp*)\nIf I can't put nothing in you, I shouldn't put no time in you (*gasp*), you understand what I'm saying? (no!)\nHolla at your boy, here's a lesson to all men (what are you talking about?)\nYo, if she trying to stay in that friend zone, zone her ass to her friends (gasp!)\n(I cannot believe you) N-no, don't give me that, don't give me that\nBitch, roll up\n(Aww, I thought you were different)", "image": "https://images.genius.com/35828591043ba6da2878295fc509cf11.500x500x1.jpg"}], "artist": "Tyler, The Creator"}