{"songs": [{"title": "Groovy Tony / Eddie Kane", "album": "Blank Face LP", "year": "2016-07-08", "lyrics": "[Part 1: Groovy Tony, Produced by Tae Beast]\n\n[Chorus: ScHoolboy Q]\nBlank Face, tre eight, kill everybody, fuck an AK\nSell narcotics and step my dollars up to Bill Gates\nPush all limits, you lookin' timid, need to back off\nPunk-ass cops, them crackers want us with our black off\nThug life, nigga since '96 I wanted to gang bang\nFew years later I'm really from it, we were still kids\nCrack off nigga, I'm squeezing empty 'til the shell break\nFuck my image, I need the drop, I need the Blank Face\n\n[Verse 1: ScHoolboy Q]\nCause brain damage from my mechanics, keeping two ways\nSell narcotics, I'm slanging diamonds with your pack then\nStack large commas, you with your riders with your backbone\nCan't fold figures, I make deposits with the gold grin\nJeans look dirty, I lift the Chevy with the rims on\nAll bad bitches, they wanna fuck me with the cap gone\nReal life nigga, I'm in the stu' 'til all the weed blown\nWait long, long, I hid the dope behind the cellphone\nY'all don't hear me, I want the money right, ugh\nGroovy Tony, no face killer, I see the money right, ugh\nBlank Face, clear everything out the safe\nCrack the pig bank, robbin' your kids too\nMy heart an igloo, the devil in all blue, huh\nDie now, go to Heaven, or bring 'em through\nLot of brown 'round here, got that white girl for you\nAnd she swimming in fire water, could be double digits\nPistol through your Civic\nMost die before they hear it, turn a nigga to a spirit\nDrive slow, oh, hey, hit the curb with shattered mirrors\nLook around now you're hell bound, boogie down\nBullshit I won't allow, slang a bird every hou'\nSmack a nigga with the heat, contradicting, now you peace\nLeave you triple six laying in defeat, can you dig it?\nStruck a match, they won't finish\nDrop a nigga off, get a nigga whipped\nSqueezing fingertips, aye\n\n[Chorus: ScHoolboy Q]\nBlank Face, tre eight, kill everybody, fuck an AK\nSell narcotics and step my dollars up to Bill Gates\nPush all limits, you lookin' timid, need to back off\nPunk ass cops, them crackers want us with our black off\nThug life, nigga since '96 I want the gang bang\nFew years later I'm really from it, we were still kids\nCrack off nigga, I'm squeezing empty 'til the shell break\nFuck my image, I need the drop, I need the Blank Face\n\n[Verse 2: Jadakiss]\nExactly what I'ma have when the cops come\nBody language's the same as when the shots rung\nHolding a .38 and a shotgun\nReal nigga, we all know you are not one, nah\nRunning with the rebels\nIt's a three-man weave with the Lord and the devil\nReally all I need is a pitchfork and a shovel\nIf I can't proceed then I resort to the metal (Blank Face)\nGetting high watching NBA League Pass (Who winning?)\nWith your family at the re-pass (My condolences)\nMy heart's getting colder\nWhen I hug your mom and look over her shoulder\nYou notice I got the (Blank Face)\nI ain't heard nothing, I ain't seen nothing\nI ain't in the middle with nothin', no in between nothin'\nEff y'all, forever hate me\nAs I sit here while they interrogate me\nI'm staring at 'em with the (Blank Face)\n\n[Part 2: Eddie Kane, Produced by Dem Jointz]\n\n[Verse 1: ScHoolboy Q]\nTop rack nigga and the money came with it, huh\nNew bitch with me, Hope the booty came with it\nCame with it, uh, yeah, rims flying down the road, huh\nFive in the morning, feds knockin' on my door, huh\nToilet full of dope, while my burner knee high, huh\nTell me put the gun down, I'm probably gonna die\nI know, I know, big guns sell dope\nEddie Kane's little bro, hundred k, one whip, hah\n\n[Bridge 1: Dem Jointz]\nOpen Eddie Kane for hire, huh!\nBeen tryna get rich for hours\nNights like this I wish\nCocaine drops would fall, woo, woo, woo, woo...\n\n[Verse 2: ScHoolboy Q]\nYo, uh, yo, uh, need a car with no mileage\nKristoff on my palate, my cigar full of cabbage\nCame from the dirt to the carrots\nGetting dirty dollars, four different baby mommas\nDope between the speakers, so fuck you, Mr. Teacher\n'Cause the paper, I ace it, lead, they tried to erase it\nBut I'm still standing, they mad and everything\nNothing given, I'ma take it first\nOn the trees like a hammock, flip the work behind the campus\nYoung Groovy turn your hood into a movie (into a movie...)\nGang bangin', dope slangin'\nGTA-ing, shoot the whole club up\nFuck tryna sneak the K in, on the road to riches\nThank you Mr. Reagan, you helped them dollars rake in\nAnd to my uncle that fucked up the family\nThat shit that you was smokin', I was pushin', residue lie on the cushion\nI'ma blame it on your ass cause I ain't gettin' whoopings\nAnd your proof is in the pudding\nI'm just grandma's baby, Eddie Kane\n(Eddie Kane, Eddie Kane) Uh\n\n[Bridge 2: Dem Jointz]\nStanding in the white light\nAnd we on! And is there any other smokers in here? Huh!\nAnd we on! And is there any other smokers in here?\nAnd we on! And is there any other smokers in here?\nKeys open doors on the road to my heart\nDreams on the floor, bet a nigga stay high, and I know\nWhat makes the world go 'round, go 'round? Woohoo\nWhat makes the world go 'round, go 'round? Woohoo\n\n[Outro: Candice Pillay]\nWalk right into the light\nGetting a feeling in the night\nVengeance comes, spite for spice\nYou're my only Christ\nI have only eyes for you\nI have only eyes for you\nYour soul is mine\nYour soul is mine\nMine, mine, mine, mine", "image": "https://images.genius.com/c736625d94d5fbe76ca35e9a3138bceb.600x600x1.jpg"}], "artist": "ScHoolboy Q"}