{"songs": [{"title": "On Our Way to L.A.", "album": "The Calm Before the Storm: Part 1", "year": "1999-11-09", "lyrics": "[Verse 1: Don Juan]\nI'm all about the cash, down to get the ass\n5-6 the spot homie smoking grass\nPass me the drink watch a nigga get towed down\nTech gave the low down\nNow it's time to put the hoes down\nI came and questions got the bitch\nGuessing 'bout the dick fucked the white too quick\nNothin' but a trick bitch now I'm on another journey\nHad no rub', hope the bitch don't burn me\nTen hours away, then I'm on my way to Cali L.A\nTo make Gs, pretty bitches and palm trees\n35 south 40 going west\n15 the opposite of north on a quest\n\n[Verse 2: Tech N9ne]\nHittin' prospect straight bro\nLooking for some Kansas City hoes to poke\nBut rellish floats my boat\nKeep a nigga for live in my pocket I gotta get mine\nKeeping suspicious mitch in niggers behind my line\nRewind my rhyme, Nina with many dope styles\nPack my bag now I'm out pal\nKick it with some biancas up in Oklahoma stayin' over for one night\nHit it right then I'm out, no diggity no doubt\nRich man suites, had her face off in the pillow\nThe next morning dippin' met some biancs in Amarillo\nGive me the number bianc so that when we come back through\nPlay some questions with you two, off in the poo-poo, ooh-ooh\n40 west, to Alberquerque on through the\nArizona hittin' corners who can see me who, 3DQ\nIs down with us, you can say what you say\nKansas City all day, offer rellish on my way to L.A\n\n[Chorus: Tech N9ne & Don Juan]\nOn our way to Cali\nAll we want is the palm trees a pretty bitch\nAnd become rich\nRogue dogs we come to bring the fury\nMake it dash to L.A., turn Cali to Missouri\nOn our way to Cali\nAll we want is the palm trees a pretty bitch\nAnd become rich\nRogue dogs we come to bring the fury\nMake it dash to L.A., turn Cali to Missouri\n\n[Verse 3: Don Juan]\nWe hit the highway, the fly way\nDoing 89 niggas waste no time\nMake a pit stop bumpin' old school hip-hop\nMidwestside never flip-flop\nNiggas get dropped, all about the rellish when we creep\nStopped in Oklahoma City got us a suite\nGave niggas much love, passed much bud\nCome here baby get at me show what you made of\n12 20 north-west, a little get together\nBeautiful ladies, nobody shady\nDown-ass homies, nobody phony\nEverything was dandy\nSo wassup to my homegirls Tammy\nTachey and Tez, right too thick\nMisery niggas, right too sick\nWe gotta make that group\nWe gotta jet, seven forty seven style\nOh shit, eleven hundred mo' miles\n\n[Verse 4: Tech N9ne]\nL.A. two-way my on\nThe chronic up in L.A. we stayed high gone\nWake up show flows see hoes on the 405\nAlready hell alive when I arrive\nMidwest style no Cristal just Caribou Lou\nFeel like I'm an alien like Mr. Sulu a new crew but who?\nThem road dog niggas from Mizzizy\nWe rollin' on Sunset mobbin' like we on prospect dizzy\nWhat's the real dough, we got that real flow\nYou other busters coming fake like a dildo\nAnd if you wanna try a nigga from the misery get with me\nAnd me show you what the Tecca Nina kill fo'\nI'm out for stacks baby, creating plaques baby\nAfter I'm making the rellish we can hit the sack maybe\nBillboard live, rockin' hella heads at the Roxy\nI'm off and can't a motherfucker stop me I'm off nigga\n\n[Chorus: Tech N9ne & Don Juan]\nOn our way to Cali\nAll we want is the palm trees a pretty bitch\nAnd become rich\nRogue dogs we come to bring the fury\nMake it dash to L.A., turn Cali to Missouri\nOn our way to Cali\nAll we want is the palm trees a pretty bitch\nAnd become rich\nRogue dogs we come to bring the fury\nMake it dash to L.A., turn Cali to Missouri\n\n[Outro: Tech N9ne & Don Juan]\nYeah, ey, call the nigga Don and tell that nigga to get the van ready we 'bout to roll to Cali\nWe got everything, hey just make sure we got everything you know?\nYeah that's right I got the camcorder Rogue Dog niggas\nCall the nigga Q and tell 'em uh- we arrive uuh- five o'clock memorial day man\nThat's right that's right ey\n(Tell the nigga to have some biancs ready for us)\nTell him to have the motherfucking 151 ready 'cause we got plenty of Caribou Lou ready for bitches in the Jacuzzi\nAnd play some questions with you hoes hahahaha\nHey, tell the nigga Rock Money quit bullshit and give the twens to Law, c'mon everybody\nWhere the fuck is LeJo at man? Time to roll man", "image": "https://images.genius.com/1d4a12a154c6cf30e77857bb018ab602.1000x1000x1.jpg"}], "artist": "Tech N9ne"}