{"songs": [{"title": "Intro (World War 3, Vol. 1: Lean)", "album": "World War 3, Vol. 1: Lean", "year": "2013-08-13", "lyrics": "[Intro]\nHello world\nYeah this your ?\nYou know, it's amazing what's going on out here in these streets\nYou know, you got these boys out here playing\nThey come off the porch not ready\nI come to find out what it really is\nThey ain't mama's baby, they mama's boy\nSee if they was mama's baby they could learn something, but they mama's boy\nThey don't know when to shut up, they don't know when to get out the way they don't know how to stay in they lane\nWhen you come off the porch you got to already be ready\nBecause when you hit these streets...\nIt's on the job training\n\n[Verse 1: Peewee Longway]\nI been juugin', I been makin' plays in exclusive J's\nFuck ya bitch and let her rub my waves, I'm stuck in my ways\nPoppin' molly I've been up for days vampin' wit' the Js\nLongway, longway, jumpin' off the stage, bitches grabbin' my chain\nMachine Gun Kelly ride the wave, Guwop fuck up the stage\nDiamond hittin' neon like a rave, leave a bad bitch in a daze\nUno dos cups I'm dazed, ? I blaze\nMake a big juug at Blaze, John Dillinger still come for your safe\nFN 20 shots still on my waist\nGas bags still comin' in from the bay, E-40 holla back at ya ???\nLet's see how many bags she can flip in a day\nMakin' juug, makin' juug wit' my people\nGriselda Blanco, El Chapo, clean bricks in, bring nacho\nPablo Esco', Gucci Tarantino, makin' juug, compadre, vato\nLongway!\n\n[Gucci Mane]\nLong, yeah that was Longway man\nWhat's happenin'?\n1017's finest nigga, Guwop\nAll we do is goddamn make legends nigga (Everything red this summer)\nWe make nothing but classics nigga\nStreet niggas, Trap music fuck nigga\nDon't get this shit confused wit' no Hip-Hop nigga\n2013 nigga, everythang red on my end\nRed Phantom, red 'rari, red Bentley, red Charger sucka\n\n[Verse 2: Gucci Mane]\nVVS crystals all over me, dope covered with crystals\nSticky purp need some scissors, lean so dark look like liquor\nSo I just pulled up in the Enzo ho, Guwop came back in a Bentley on 4s\nPoured me a 4 and forgot where to go, and I'm dope but I'm lost just like Weezy and Zoe\nGucci and PeeWee - new Eazy and Dre, Wee got the uzi and I got the K\nLike Birdman and Wayne and we hoggin the lane, we sippin and spillin codeine on the plane\nFuck the champagne I'm in love with the drank, smoke on some dank because cigarettes stank\nFresh prince of the six ? Hillary Bank\n? bought me a pint\nWoke up today a decision to  make, I skeet on her chest  or I skeet on her face\nThese worrisome-ass bugs keep sucking my blood I need some spray to keep these mosquitoes away\nI follow the leader, my plug was a teacher\nHe showed me the roads now I'm leading the way\n458, this ain't a date, so ho you get dick and Doritos today\n\n[Verse 3: Young Thug]\nBaby I'm not president, I ball like George Jefferson\nHer teeth whiter than a peppermint\nI buy her a maid, this and that so therefore she ain't coming back\nBabygirl chasing her a sack\nYoung Thugger Young Thugger, Young Stack is my brother\nI fuck her, I love her, but I cannot cuff her\nI pull up on donuts, they take all my orders\nThat lean is my drank and that pussy my supper\nI like my bitch brown like dumped in Coca Cola\nHer ass keep clapping, Magnolia Magnolia\nShe walk down that runway, she coming she coming\nAin't talkin' no gun but she don't got no tummy\nGot bricks like a mummy\nI tell ya father, I slaughter ya daughter\nI'm with that lay, ain't talkin' to stay, I fuck the yay yay\nAy Bloody Jay, you know we go harder\nWe ridin' on Bentleys, we started from MARTA\nWe come from the street, I'm full, I can't eat\nAin't nobody starving, Monique Parker\n\n[Outro: Peewee Longway]\nStraight like that baby\nBitch, ho, slut, whatever you wanna go by\nLongway! Longway! Longway! All blue on my end nigga\nMPA, 1017, if you ain't know fool\nFuck you sayin'?!\nFuck you mean?! (Waaaaann!)\nJohn, engineer, go ahead man\nTurn up! Turn up! Turn up!\nTurn down for what?!\nTurn up...", "image": "https://images.genius.com/2363c8d759c5b9334226a57823c9c00e.894x896x1.jpg"}], "artist": "Gucci Mane"}