{"songs": [{"title": "Warning", "album": "Ready to Die", "year": "1994-09-13", "lyrics": "[Produced by Easy Mo Bee]\n\n[Verse 1: The Notorious B.I.G. & Pop]\nWho the fuck is this, pagin' me at 5:46 in the morning?\nCrack of dawn and now I'm yawnin'\nWipe the cold out my eye\nSee who's this pagin' me and why\nIt's my nigga, Pop from the barbershop\nTold me he was in the gambling spot and heard the intricate plot\nOf niggas wanna stick me like flypaper, neighbor\nSlow down, love, please chill, drop the caper\nRemember them niggas from the hill up in Brownsville\nThat you rolled dice with, smoked blunts and got nice with?\nYeah, my nigga Fame up in Prospect\nNah, them my niggas, nah, love, wouldn't disrespect\nI didn't say them\nThey schooled me to some niggas that you knew from back when\nWhen you was clockin' minor figures\nNow they heard you're blowin' up like nitro\nAnd they wanna stick the knife through your windpipe slow\nSo, thank Fame for warnin' me, 'cause now I'm warnin' you\nI got the MAC, nigga, tell me what you gonna do\n\n[Chorus]\nDamn, niggas wanna stick me for my paper\nDamn, niggas wanna stick me for my paper\nDamn, niggas wanna stick me for my paper\nDamn, niggas wanna stick me for my paper\n\n[Verse 2: The Notorious B.I.G. & Pop]\nThey heard about the Rolexes and the Lexus\nWith the Texas license plates out of state\nThey heard about the pounds you got down in Georgetown\nAnd they heard you got half of Virginia locked down\nThey even heard about the crib\nYou bought your moms out in Florida, the Fifth Corridor\nCall the coroner!\nThere's gonna be a lot of slow singin' and flower-bringin'\nIf my burglar alarm starts ringin'\nWhat ya think all the guns is for?\nAll-purpose war, got the Rottweilers by the door\nAnd I feed 'em gunpowder so they can devour\nThe criminals tryin' to drop my decimals\nDamn, niggas wanna stick me for my cream\nAnd it ain't a dream, things ain't always what it seem\nIt's the ones that smoke blunts with ya, see your picture\nNow they wanna grab they guns and come and get ya\nBet ya Biggie won't slip\nI got the Calico with the black talons loaded in the clip\nSo I can rip through the ligaments\nPut the fuckers in a bad predicament\nWhere all the foul niggas went\nTouch my cheddar, feel my Beretta\nBuck what I'ma hit you with, you motherfuckers better duck\nI bring pain, bloodstains on what remains\nOf his jacket, he had a gun, he shoulda packed it\nCocked it, extra clips in my pocket\nSo I can reload and explode on your asshole\nI fuck around and get hardcore\nC-4 to your door, no beef no more, nigga\nFeel the rough, scandalous\nThe more weed smoke I puff, the more dangerous\nI don't give a fuck about you or your weak crew\nWhat you gonna do when Big Poppa come for you?\nI'm not runnin', nigga, I bust my gun and\nHold on, I hear somebody comin'\n\n[Skit]\nC'mon, motherfucker\nMan, I'm comin' as fast as I can\nJust g— bring your motherfuckin' ass on, come on\nAre we gettin' close, huh?\nIt's right over here\nYou sure it's Biggie Smalls crib, man?\nYeah, I'm sure, motherfucker, come on\nMan, fuck, this better be his motherfuckin' house\nFuck, right here\nTsk, this better be this motherfucker's house\nOh shit\nWhat? What's wrong?\nWhat's that red dot on your head, man?\nWhat red dot?\nOh shit! You got a red dot on your head, too\nOh shit!", "image": "https://images.genius.com/e6cce6ad5c26175653cd5e5590b6e235.1000x1000x1.jpg"}], "artist": "The Notorious B.I.G."}