{"songs": [{"title": "Poppa Was a Playa", "album": "D.O.E. Limited Edition - Volume 1 (Death of Escobar)", "year": "2002-09-23", "lyrics": "[Produced by Kanye West & Mad Rapper]\n\n[Intro]\nTo my nigga\nWho brought me in this world\nHa, that's right nigga\n\n[Verse 1]\nMy ol' dad important to the family structure, provider, a God\nMy moms a queen, that universal team civilized us\nMy pops maybe was late but always came home\nMy moms would put us to bed and she would wait on\nSoon as he walk in the door she barking\nI turned down the Johnny Carson\nJumped out the bed, we grabbed both his legs\nMe and my brother, not knowing the pain he gave my mother\nNight after night, fighting, yelling at each other\nMy poppa played the street all day, mama was either home\nOr at work, while we played inside the hall way\nShe sacrifices all she got to feed us\nWhen she was alone she cried by the phone peeping out the window heated\nBut still I didn't see it, mama hid it from us\nWe was kids younger, 'til we got bigger, on to\nBigger things that we knew what the time was\nThat daddy was leaving his crib and mom's love\n\n[Chorus]\nPoppa was a playa, playa was in poppa\nPoppa loved the ladies, never got enough of\nThe pretty brown round, running round town\n\"(Shhh!) Don't tell your mother what's going down\"\nPoppa was a playa, playa was in poppa\nPoppa loved the ladies, never got enough of\nThe pretty brown round, running round town\n\"(Shhh!) Don't tell your mother what's going down\"\n\n[Verse 2]\nSo many kids I knew, never knew who pop was\nThat's why I show my pop love\nHe was still around when I popped up\nHe could have left my moms pregnant, shook to death\nBut stayed, watched me crawl 'til I took my first step\nTo the first grade, to my first fistfight\nRight behind me he would stand\nNo matter how big or tall, he made me fight you like a man\nThrow dirt in ya eye, swing my right, scoop your ass and slam\nHe watched me so I wouldn't get jumped by shorty's fam\nRoaches of weed all over my crib, him and moms relaxing\nNext thing you know he packing, so then I asked him\n\"What's this white shit on that plate and your face?\nAnd, Poppa, why you butt-ass from the waist\nAnd, who's this lady I'm facing?\nDark skin, you're not my mommy!\"\nHe grabbed me up to run some smooth words by me\nPromise me things that he would buy me\nIf I kept my mouth closed and don't tell mommy\nHe said one day I'll understand, \"Little me\nWhat's in you is inside me\"\n\n[Chorus]\nPoppa was a playa, playa was in poppa\nPoppa loved the ladies, never got enough of\nThe pretty brown round, running round town\n\"(Shhh!) Don't tell your mother what's going down\"\nPoppa was a playa, playa was in poppa\nPoppa loved the ladies, never got enough of\nThe pretty brown round, running round town\n\"(Shhh!) Don't tell your mother what's going down\"\n\n[Verse 3]\nUhh, my nigga\nPops told me hold my own\nPops told me value home\nCould I help it poppa was a rolling stone?\nWho loved the pretty brown round, outta town bound\nTrumpet in his jazz band, he touring\nAt home I play his latest recordings\nAnd it's strange now how I do my thing now, I'm in the game now\nInherited his brainpower, to pull strings and gain power\nFrom weed habits are the same now\nNo white lines, no trumpets, just tight rhymes\nAnd beats that be pumpin, 'fore he left, he taught me something\nA child's young years the most important time to be there\nThat's why he stayed 'til we grew up, respect is still here\nI'm older now, see what having a father's about\nOne day they can be in your life, next day, they be out\nIt's not because of you, you know the deal\nHim and your moms feel\nIf they stay together then someone will get killed\nI love you still, always will, 'cause that's my nigga\nAlthough you felt you was wrong, I still feel you kid\nLife goes on...", "image": "https://images.genius.com/6438e249e54997f8504fca57219b4738.1000x1000x1.jpg"}], "artist": "Nas"}