{"songs": [{"title": "Welcome to the World", "album": "No Mercy", "year": "2010-12-07", "lyrics": "[Intro: T.I]\nYeah, ay 'Ye\nWhy don’t you let me welcome these niggas\nTo the world they ain't welcome to, you understand?\nIt bring me great pleasure to welcome the real and banish the fake\nNo bigmouthed ho caked fag bait ass niggas allowed\nBut to everybody else\n\n[Hook: Kanye West, T.I. & Kid Cudi]\nI would like to welcome (you) to the world of (world of)\nFast money, fast cars\nBig diamond rings, teeth, chains and the girls of (girls of)\nFake smiles, broken hearts\nAnd if you looking (what) or your real love (well)\nYou won't find it here\nIf you looking (what) for your real love (who)\nWell goodnight my dear\nOooh, if you looking for real love\nDon’t come around here\nOooh, if you looking for real love\nIt ain't here my dear\nMmm mmmm, move on\n\n[Verse 1: T.I]\nIt’s my pleasure to welcome you to the world of\nFast money, flashy cars, big guns\nUndone, threw away for the love of\nThe game, I don't need a chain or the fame, still shine\nSpend time with the girls of\nFake smiles, broken hearts trying hard in the club\nLooking for her real love\nYou won’t find it here\nAll I got is hard dick and conversation for you\nI was just high, even lying when I say I love you\nMy mind saying it were both, I just wanna fuck you, her too\nBlowing lyle, smelling like a bubba kush perfume\nShe coming home with me, she finna meet her doom\nShe ain't saying I’m the greatest finna change her tune\nThe coldest and the hottest call me December, June\nDeliver euphoria straight to your room\nI hit that ass and away, I zoom\nMake it rain nonstop call me Young Typhoon\nTop spot already filled up no room\nThought I would put some paper and your purse so soon?\nWell wrong she is and mistaken she was\nTip broke, never heard such thing of\nI’ll fuck you up, don’t touch me cause\nJust trust me bruh, It must be\nLi-li-li-living my dreams, don't wake me up\nYo-yo-you fake it till you make it, must suck\nAll th-th-th-the haters hate us for the flav of the paper\nTh-th-that's why I can't love my neighbors\nDa-da-da-da-dangerous, stalk, kick, cut you\nIf you ain't welcome in my world bitch fuck you\nDa-da-da-da-dangerous, stalk, kick, cut you\nYou ain't welcome in my world bitch fuck you\n\n[Hook: Kanye West, T.I. & Kid Cudi]\nI would like to welcome (you) to the world of (world of)\nFast money, fast cars\nBig diamond rings, teeth, chains and the girls of (girls of)\nFake smiles, broken hearts\nAnd if you looking (what) or your real love (well)\nYou won't find it here\nIf you looking (what) for your real love (who)\nWell goodnight my dear\nOooh, if you looking for real love\nDon’t come around here\nOooh, if you looking for real love\nIt ain't here my dear\nMmm mmmm, move on\n\n[Verse 2: Kanye West]\nI would like to welcome you to the world of\nFake bitches, no love\nWhat the fuck you take me for? Show love\nI hate haters in the club\nYou must not really know where I come from\nExactly where my heart\nOr you would never, never, never!\nUhh, where do I start?\nPeople ask me shit about Illuminati\nFirst off, fuck that mean?!\nHe loved Jesus when he he he was worse off, oh I see\nWhen they, think a nigga is, stupid rich\nPeople just start coming up with stupid shit\nMan, shit I could never predict\nHold up, let me hit you with this\nRolling in a Bugatti with fo’ chains is some foolishness\nYea yea yea, that’d be the shit\nThey’d rather see a nigga locked up, why? For stupid shit\nLook how they did my nigga Tip\nSoon as Wayne get out, Tip go in\nWonder why the nigga wanna make the clip go in\nWonder why it so hard when it get going\nHold ya head, my niggas the system is\nMade to make niggas fall, made to make niggas fail, uhh\nEspecially if you ball, they don’t take niggas well\nHell nah, you can't come through flying\nIn a, in a Bentley shining\nI’m in the back, backseat driving\nScreaming on a nigga like I’m actually driving\n\n[Hook: Kanye West, T.I. & Kid Cudi]\nI would like to welcome (you) to the world of (world of)\nFast money, fast cars\nBig diamond rings, teeth, chains and the girls of (girls of)\nFake smiles, broken hearts\nAnd if you looking (what) or your real love (well)\nYou won't find it here\nIf you looking (what) for your real love (who)\nWell goodnight my dear\nOooh, if you looking for real love\nDon’t come around here\nOooh, if you looking for real love\nIt ain't here my dear\nMmm mmmm, move on", "image": "https://images.genius.com/f55abc725080eb05147e45ce3cd406a8.1000x1000x1.jpg"}], "artist": "T.I."}