{"songs": [{"title": "Gangsta’s Paradise", "album": "Gangsta’s Paradise", "year": "1995-08-08", "lyrics": "[Recording Info]\n\n[Verse 1: Coolio]\nAs I walk through the valley of the shadow of death\nI take a look at my life and realize there's nothin' left\n‘Cause I've been blastin' and laughin' so long\nThat even my momma thinks that my mind is gone\nBut I ain't never crossed a man that didn't deserve it\nMe be treated like a punk, you know that's unheard of\nYou better watch how you talkin' and where you walkin'\nOr you and your homies might be lined in chalk\nI really hate to trip, but I gotta loc\nAs they croak, I see myself in the pistol smoke\nFool, I'm the kinda G the little homies wanna be like\nOn my knees in the night, sayin' prayers in the streetlight\n\n[Hook: LV]\nBeen spendin' most their lives livin' in the gangsta's paradise\nBeen spendin' most their lives livin' in the gangsta's paradise\nKeep spendin' most our lives livin' in the gangsta's paradise\nKeep spendin' most our lives livin' in the gangsta's paradise\n\n[Verse 2: Coolio]\nLook at the situation they got me facin'\nI can't live a normal life, I was raised by the street\nSo I gotta be down with the hood team\nToo much television watchin' got me chasin' dreams\nI'm a educated fool with money on my mind\nGot my ten in my hand and a gleam in my eye\nI'm a loc'd out gangsta, set trippin' banger\nAnd my homies is down so don't arouse my anger\nFool, death ain't nothin' but a heart beat away\nI'm livin' life do or die, what can I say?\nI'm 23 now, but will I live to see 24?\nThe way things is goin' I don't know\n\n[Bridge: LV]\nTell me why are we so blind to see\nThat the ones we hurt are you and me?\n\n[Hook: LV]\nBeen spendin' most their lives livin' in the gangsta's paradise\nBeen spendin' most their lives livin' in the gangsta's paradise\nKeep spendin' most our lives livin' in the gangsta's paradise\nKeep spendin' most our lives livin' in the gangsta's paradise\n\n[Verse 3: Coolio]\nPower and the money, money and the power\nMinute after minute, hour after hour\nEverybody's runnin', but half of them ain't lookin'\nIt's goin' on in the kitchen, but I don't know what's cookin'\nThey say I gotta learn, but nobody's here to teach me\nIf they can't understand it, how can they reach me?\nI guess they can't, I guess they won't\nI guess they frontin'; that's why I know my life is out of luck, fool!\n\n[Hook: LV]\nBeen spendin' most their lives livin' in the gangsta's paradise\nBeen spendin' most their lives livin' in the gangsta's paradise\nKeep spendin' most our lives livin' in the gangsta's paradise\nKeep spendin' most our lives livin' in the gangsta's paradise\n\n[Bridge: LV]\nTell me why are we so blind to see\nThat the ones we hurt are you and me?\nTell me why are we so blind to see\nThat the ones we hurt are you and me?", "image": "https://images.genius.com/36aeeb24116d49eb3b70065cd802d0e0.600x600x1.png"}], "artist": "Coolio"}