{"songs": [{"title": "Hard Times", "album": null, "year": null, "lyrics": "[Intrp]\nThey don’t seem to want me but they won’t admit\nI think I’m some kind of creature that they are\nHaving fear of Hard times\nTheres no love to be found\n\n[The Game]\nI’m feeling like a black democrat\nBarack Obama, the only nigga that can catch Osama\nSpray lamas, get good head and fuck fly bitches with no covenant\nOnly the kitchen oven in and rules to the government\nAsk the republicans how crack cocaine get smuggled in?\nWatch them throw they hands up and say it wasn’t them\nAs for rap, this is my lyrical asthma attack\nIt’s all I know, the guns, the cash, the dro\nFidel Castro on my own right, Capone like\nMafioso, Ben Franky on the low pro\nDrop top Bentley, chromed out semi\nTwo grand in popular demand like the first pennies\nMy Audemars Piguet wrist say it's time to dethrone Jay quick\nTell 'em other niggas to take six\nCoupe a buck fifty, what’s coming out the speakers?\nGot every video bitch scared to fuck with me\n\n[Hook]\nHaving hard times\nThere’s no love to be found\nHaving hard times\nThere no love to be found\n\n[Lil Wayne]\nShit gangster to the core\nAin’t no rap flame paint your kitchen floor\nWhat you, you can’t ignore\nThings you endure went up against the board\nAll I heard was easy don’t fill me no more\nI hear your bullshit, I play matador\nI’m outta category I ain’t there with you\nI got a positive vibe, but I ain’t scared of ya'll\nHit the kid nigga dip, never that at all\nThen red attack the wall, that black-ack-ack-ack-ack\nI got a girl so fine her name Perignon\nShe know how to get them things in her carry on\nI blow outta town Grants when I'm outta town\nUptown in the building how that sounds\nCause killas don’t get heard about\nThey get whispered about and you get murdered out, boy\n\n[Hook]\n\n[Lil Wayne]\nYou got it on your mind look daddy say something\nAll that play buckin' get your face buttoned up\nAnd now when you smirk you look like Jay Z’s shirt\nSteppin' on the turf\n\n[The Game]\nGive 'em hard dick and tampons\nA shot of Patron and Don\nThe ones trained get ran on, my crew hard\nLouis V sweaters on the boulevard\nPull niggas cars throw up signs and bang Nas\n\n[Lil Wayne]\nThey call me J.R. I tell 'em come holla\nI tell my poppa put away your dollars, your son got choppers\nAnd if you got enemy’s, your son got enemies, that uptown energy\n\n[The Game]\nNiggas ain't gon' never be on my level\nGet a shovel, dig a hole\nBitch and poly with he devil you or I, quiet hustler\nI’m a 80’s baby for real born in '79 and bread to kill\n\n[Hook]", "image": "https://images.genius.com/9c29ee407cd2d88f01ce08743e61d3b1.614x614x1.jpg"}], "artist": "The Game"}