{"songs": [{"title": "My Life", "album": null, "year": null, "lyrics": "Yeah..\nI got some shit I need to get off my chest\nSo just shut the fuck up and listen!\n\n[Hook]\nThe realest shit I ever wrote in my life, in my life, in my life\nIn my life… in my life, in my life, in my life…\nThe realest shit I ever wrote in my life, in my life, in my life\nIn my life… in my life, in my life, in my life…\nIn my life, my life, my life…\n\n[Verse 1]\nTime and time again, I ask myself\nWho’s listening?\nWho feels my pain?\nWho feels my thoughts?\nWho’s on the road that I’m travelling?\nBut I can’t complain\nThese are just my words\nYou would feel the same if you was in my skin\nIf you was in my shoes\nAnd you went all the days that I went struggling and hustling\nIf you spent all the nights that my momma cried\nThose endless nights, those weary eyes\nEveryone in the house would just fuss and fight\nFlipping over furniture, grabbing knives\nWe’d call the cops, here they come again\nAll the things in life I couldn’t comprehend\nWe ignored our problems, we’d just pretend\nThat they wasn’t there, like they didn’t exist\nIn Eastside Decatur our situation made us\nReact the the way that we did\nAll the nights that we had to freeze\n“Oh no, huddle up, here comes the wind!”\nOn a stormy night in a flooded house\nI can still hear the raindrops pourin’ in\nAnd they pourin’ in, it’s pourin’ in\nI can still hear the raindrops pourin’ in\n\n[Hook]\nThe realest shit I ever wrote in my life, in my life, in my life\nIn my life… in my life, in my life, in my life…\nThe realest shit I ever wrote in my life, in my life, in my life\nIn my life… in my life, in my life, in my life…\nIn my life, my life, my life…\n\n[Verse 2]\nThat’s why my attitude is “fuck the world”\nI see most these rappers as a bunch of girls\nScary-ass niggas, this a poltergeist\nKick these niggas offstage like an open mic\nNiggas know who I am behind the music\nEven when they gone, I’mma still be here\nI done made more money off a single album\nThen you’ll probably ever see throughout your whole career\nY’all ain’t boss, y’all lightweight\nWe smoke pounds, y’all pound cake\nThat’s why real niggas don’t fuck with y’all\nY’all sweet to the air like soundscapes\nAnd the crazy thing about it\nI ain’t gotta do this rap shit\nI could make a million off of royalties\nAnd turn around and buy the rights to your masters\nI ain’t gotta feel the fake persona\nFull of goons in my squad who appear to be bolder\nI’m from the ‘hood, man, I ain’t from the streets\nI took a different path, the one that lasted longer\nAnd now I’m straight for life, and my team is eatin’\nAnd that’s all I owe, and that’s the way I see it\nSo leave me the fuck alone\nAnd let me smoke this blunt to myself this evening\n\n[Hook]\nThe realest shit I ever wrote in my life, in my life, in my life\nIn my life… in my life, in my life, in my life…\nThe realest shit I ever wrote in my life, in my life, in my life\nIn my life… in my life, in my life, in my life…\nIn my life, my life, my life…\n\n[Verse 3]\nWhat am I supposed to be?\nAm I supposed to smile, am I supposed to grin, huh?\nFor White America to let me in\nShould I assume a role that’s none threatening?\n“Oh, Bobby Ray, you so cool in your raps”\n“All that other garbage, you don’t talk like that”\nMeanwhile, I just left the strip club an hour ago\nNow I’m thinkin’ bout turning back\nTell me who’s the author that writes the script\nI’m what it means to be, to be a lyricist\nObviously, I’m in a league of my own\nSo I don’t get offended if I ain’t on your list\nThis takes me back, back in the day\n? when I was broke as shit\nFailed every test, every class I skipped\nI was in my zone with a pad and pen\nI didn’t understand, I was just a kid\nSo misunderstood, never had a friend\nI was so depressed, always upset\nHere I go, contemplating suicide again\nI was all alone, I was out of touch\nLittle did I know that I was out of sight\nSo I kept my headphones all the way turnt up\nWaiting for the moment when the time was right\nNow the time is right\nNow the time is right, yeah..\n\n[Hook]\nThe realest shit I ever wrote in my life, in my life, in my life\nIn my life… in my life, in my life, in my life…\nThe realest shit I ever wrote in my life, in my life, in my life\nIn my life… in my life, in my life, in my life…\nIn my life, my life, my life…", "image": "https://images.genius.com/2a942b4b8155a25105df5924260974fa.1000x563x1.jpg"}], "artist": "B.o.B"}