{"songs": [{"title": "On Hurricane Katrina", "album": "Kanye West’s Visionary Streams of Consciousness", "year": "2005-09-02", "lyrics": "[Mike Myers]: With the breach of three levees protecting New Orleans, the landscape of the city has changed dramatically, tragically, and perhaps irreversibly. There is now over twenty-five feet of water where there was once city streets and thriving neighbourhoods.\n\n[Kanye West]: I hate the way they portray us in the media. If you see a black family, it says “they’re looting.” If you see a white family, it says “they’re looking for food.” And you know, it’s been five days because most of the people are black and even for me to complain about I would be a hypocrite because I’ve tried to turn away from the TV because it’s too hard to watch. I’ve even been shopping before even giving a donation.  So now I’m calling my business manager right now to see what’s… what is the biggest amount I can give and… and just to imagine if I was… if I was down there and those are… those are my people down there. So anybody out there that wants to do anything that we can help. With… with the setup, the way America is set up to help the…uh the uh, the poor, the… the black people, the uh… the less well-off as slow as possible. I mean, this is, Red Cross is doing everything they can. We… we already realize a lot of the people that could help are at war, right now, fighting another way, and they’ve… they’ve given them permission to go down and shoot us.\n\n[Mike Myers]: And subtle and but in even many ways more profoundly devastating is the lasting damage to the survivors’ will to rebuild and remain in the area. The destruction of the spirit of the people of Southern Louisiana and Mississippi may end up being the most tragic loss of all.\n\n[Kanye West]: George Bush doesn’t care about black people.", "image": "https://images.rapgenius.com/8b5f5a318cd4a4a8b25ed75c79526a22.452x300x1.jpg"}], "artist": "Kanye West"}