{"songs": [{"title": "I Get So Get So High", "album": "Trapology", "year": "2015-01-01", "lyrics": "(Intro)\nHuh huh, Smoke some of that Gucci Gas, huh\n\nGucci!\n\n[Verse 1]\nMy diamond wrist, and diamond neck, kick like Jackie Chan wrist (Whoa)\nGot that money, I can flex, I got Jackie Chan bitch (Turn up)\nNot the rubber ban' man, but the rubber ban' clique (Brr)\nI can nut all on ya bitch, call her the body paint bitch (You nasty)\nCan I buy your stove today, because my stove need to be fixed (woah)\nCan I borrow your safe today, because my safe don't got a cent (Skirr)\nThere's a stitch comin' out my 'partment, and man it smell like 40 bricks (Damn)\nThey used to call me 40 shawty, now they call me extra clip (Ba)\nYou can call me Carbon-15, when you see me let it rip (Uhh)\nYou a crip I'll leave your crippin', and you a blood I'll leave ya bleedin (*Thdadao*)\nDrop camaro ridin Cleveland, now they call it Bleveland (Woo)\nGucci Mane's a gangster but these niggas not believing (Wha?)\nTill I put that fire, make them niggas start retreatin (*Pew*)\nYo girlfriend's a komoto dragon, keep a nigga skeetin (*Ah-ah-ah*)\nAll my rims are stamped with dragons, man them fuckas leavin (Woo)\nYo brother was disloyal to me, man that nigga treason (Sucka)\nHe was insubordinate, I had to hit the heathen (Ba)\nFo-fo 2 on 24's I'm ridin through 4 season (Low)\nHard top rarri boulevard, an I don't see no pleasin\n\n[Hook]\nLord, I get High-ahah, I don't know why-ay\nIf I don't drank to day-y I rather die-e\nLord, I get High-ahah, I don't know why-ay\nIf I don't drank to day-y I rather die-e (Woo)\n\n[Verse 2]\nPopo pull me over in a blue and black Bentley\nBlue Forgi's thought that I was Crippin like Nipsey\nI ride 24 like Vos-Vos\nIf you a bad bitch then vogue pose\nYou come to Gucci house bring no-clothes\nMs lady can I put this in yo ass-ho?\nGucci in the club where the phat ho? (phat ho)\nAll I wanna know is where the phat ho, phat ho\nI don wan a red, I wan a black ho, black ho\nI don wan that ho, I want that ho, that ho\nGucci in the club where the phat ho? (phat ho)\nAll I wanna know is where the phat ho, phat ho\nI don wan a red, I wan a black ho, black ho\nI don wan that ho, I want that ho, that ho\n\n[Hook]\nLord, I get High-ahah, I don't know why-ay\nIf I don't drank to day-y I rather die-e\nLord, I get High-ahah, I don't know why-ay\nIf I don't drank to day-y I rather die-e", "image": "https://images.rapgenius.com/3aaa066bc125206eff46a0853bc7ec3a.640x640x1.jpg"}], "artist": "Gucci Mane"}