{"songs": [{"title": "No More Pain", "album": "All Eyez on Me", "year": "1996-02-13", "lyrics": "[Intro]\nHey, DeVante\nNigga, don't you know we're gonna sow up\nEvery bitch in the country?\nMe and you, up in the same motherfuckin' room, on the same level\nThis shit here, hahahaha\nPlease, no more pain\nThat's right, nigga\nHey, drop that shit, boy\n\n[Verse 1]\nMy adversaries cry like ho's\nFully eradicate my foes\nMy lyrics explode on contact, gamin' you hoes\nWho else but Mama's only son? Fuck the phony niggas, I'm the one\nSay my name, watch bitches come\nNow fire when ready, stay watchin' our figure\nIncrease speed, make you motherfuckers bleed from your mouth quicker\nPlus all these niggas that you run with be on some dumb shit\nTrickin' on hoes, I ain't the one, bitch\nHolla my name and witness game official, it's so sick\nHave every single bitch that came witchu on my dick\nPlus this alcohol increases the chance to be deceased\nI'm movin' you stupid bitches, this is telekinesis\nAm I reachin' your brain? Nigga, how can I explain?\nHow vicious this thug motherfucker came\nWhen I die, I want to be a living legend, say my name\nAffiliated with this motherfuckin' game, with no more pain\n\n[Chorus]\nI came to bring the pain, hardcore to the brain\nLet's go inside my astral plane (No more pain)\nI came to bring the pain, hardcore to the brain\nLet's go inside my astral plane (No more pain)\nI came to bring the pain, hardcore to the brain\nLet's go inside my astral plane (No more pain)\nI came to bring the pain, hardcore to the brain\nLet's go inside my astral plane (No more pain)\n\n[Verse 2]\nLine up my adversaries, blast on sight\nAnd fuck your boyfriend, bitch, I want some ass tonight\nYou know my steelo\nAlizé and Cristal, weed\nSure you heard of all the freaky shit they say about me, huh?\nPlus all you busters is jealous\nPull your gun out and blast\nI dare you niggas to open fire\nI'll murder that ass\nAnd disappear before the cops come runnin'\nMy Glock's spittin' rounds, niggas fallin' down, clutchin' they stomach\nIt's Westside, Death Row, Thug niggas on the rise\nBusters shot me five times, real niggas don't die\nCan ya hear me? Laced with this game, I know you feel me\nSpit the secret to war, so cowards fear me\nMy only fear of death is reincarnation\nHeart of a soldier with a brain to teach your whole nation and feelin' no more pain\n\n[Chorus]\nI came to bring the pain, hardcore to the brain\nLet's go inside my astral plane (No more pain)\nI came to bring the pain, hardcore to the brain\nLet's go inside my astral plane (Yeah, nigga, no more pain)\nI came to bring the pain, hardcore to the brain\n(What? What, nigga?)\nLet's go inside my astral plane (No more pain)\nI came to bring the pain, hardcore to the brain\nLet's go inside my astral plane (No more pain)\nI came to bring the pain, hardcore to the brain (No pain, nigga)\nLet's go inside my astral plane (No pain)\n\n[Verse 3]\nBury me that's what they all say\nIt's time to make a killin', sure to make a million with DeVante\nBitch, I know you want me, what your mouth say?\nNow, watch your eyes\nYou don't wanna get with me, that's a lie\nI got my hands on your hips\nNo time to bullshit\nFreaky bitch, come give me kiss\nTell them niggas from other areas, brothers from here\nSo obsessed with this money makin', it ain't nothin' we fear\nNow they label me a troublemaker 'cause I'm a rider\nDeath to you playa haters, don't let me find ya\nMama made me rugged, baptized the public\nNow you all thugs, nigga, don't you love it?\nIt's similar to multiple gunshots, retaliation is a must\nWasn't too sure what you facin' so watch the guns bust\nYou niggas will bleed, fuckin' with me, you'll be deceased\nNever restin' in peace, nigga, with no more pain\n\n[Chorus]\nI came to bring the pain, hardcore from the brain\nLet's go inside my astral plane\nI came to bring the pain, hardcore from the brain\nLet's go inside my astral plane\n\n[Outro/Collision]\nHahahahaha, yeah, nigga, yeah! Hahahaha, no more pain\nIt's just like that, nigga, like that, yeah, no more pain\nMotherfuckers can't handle that shit\nMuch too much for these bitches, no more pain\nFeel me, nigga? Feel me?\nHow you figure you can fuck with me? No more pain\nFully automatic type shit, no more pain\nCoward-ass niggas, cowards\nCome put your mouth on this pistol, nigga\nCome put your mouth on the pistol, no more pain\nClose your eyes, nigga, do it\nDie in the dark, no more pain\nSay Thuuuuuuuug Life, baby\nDeath Row, so what you motherfuckers do? Hahaha\nHey, that's DeVante droppin' that beat like that, biatch!\nIn case you wonderin'\nAnd jealous niggas\nHahaha, see y'all niggas, motherfuckin' niggas are shit, hey\nWestside! Death to everybody that ain't down with me\nThat's on, feel me? Hahaha\nOh yeah, to the cowards\nYou know who I mean, it's still Bad Boy Killa\nJust feel that, Thug Life, shit don't stop\nFat motherfuckers got Downs Syndrome, motherfuckers\nWeak-ass niggas, dancers turned fuckin' CEOs\nPut your mouth on this pistol, nigga\nPut your mouth on the pistol!\nHahahaha, yeah, nigga, no more pain\nPrison ain't changed me, nigga, it made me worse\nFeel me, nigga, hahaha, no more pain\nHey, DeVante, I'm givin' these motherfuckers choices\nNiggas can roll with us, or they can be rolled up under us\nThat's on you, nigga, what you wanna do?\nLast year we was lettin' these niggas kick up dust\nThis year you motherfuckers gon' be dust\nThug Life, nigga, Westside!", "image": "https://images.genius.com/f0e663efef180da9b5d259005a1919e3.589x589x1.jpg"}], "artist": "2Pac"}