{"songs": [{"title": "Adults Swim", "album": "STOKELEY", "year": "2018-11-30", "lyrics": "[Intro]\nYeah, yeah yeah, ooh, hah\nYou woke? Yes sir\nYes, sir\nChaseTheMoney, ChaseTheMoney\nOkay, what you say?\n\n[Verse]\nYeah, yeah, common sense is to compromise\nWhen everybody 'round you talking nice\nThat is a yes man, recognize\nYeah, uh, I am appalled by the battles I fight\nI let them all think a nigga too nice\nLike when a nigga say his dog don't bite\nYeah, uh, I shake shit like a lime in a coconut\nSmoking dark green weed, my bitch call it ogre nut\nForbidden fruit in my diet, get your wisdom up\nYeah, huh, I'm like shucks, shit, shawty got a big butt\nClout is a hell of a drug, that's why she give suck\nBitch, I think I'm MC and Hammer because you can't touch\nOoh, what you do?\nPour the Henny like a soup (Uh)\nPsst, black lagoon, where I'm from, animal\nNickelodeon, with my slimes, let 'em ooze\nLike when Stella, bought Margiela, I got back my groove\nYou is a square like in a Rubik's\nAll on my dick like the hair on my pubic\nShe said, she ready, look at her stupid\n'Cause she got a diaper booty like Cupid\nWater how I move, liquid, let's do it\nMoney how I talk, bitch, I speak fluent\nSmokin' on stank, you smell like a sewer\nHow was you feeling, vro? Bitch, like the Four\n\n[Chorus]\nLike haiku, I speak smooth (Ooh)\nBut they tryna fuck up my mood (Ooh)\nThought we cool, but when you round (Ooh)\nYou fuck up the cool in my mood (Ooh)\nLike say moo, black white fur\nDesigner jacket cover my nude, uh\nTake it serious, that's it period (That's it)\nDon't fuck up my groove (That's it, that's it)\nLike haiku, I speak smooth (Ooh)\nBut they tryna fuck up my mood (Ooh)\nThought we cool, but when you round (Ooh)\nYou fuck up the cool in my mood (Ooh)\nLike say moo, black white fur\nDesigner jacket cover my nude, uh\nTake it serious, that's it period (Ooh)\nDon't fuck up my groove (Yeah)", "image": "https://images.genius.com/66707e67245fd5b934257c15027ab096.1000x1000x1.jpg"}], "artist": "Ski Mask the Slump God"}