{"songs": [{"title": "Unsolved Mystery", "album": "Adrenaline Rush", "year": "1997-06-24", "lyrics": "[Verse 1]\nI know a whole bunch of motherfuckers that's prepared to whoop\nLeave a body bloody, red' to scoop, poppin' off lead for loot\nShot the pussy up from head to boot\nJust for talkin' dramatic when it was static you was scared to shoot\nPolice prepare to swoop to catch a nigga on the runway\nBut don't none stay for the white chalk\nIf you aired out the tip watch your lip, because hypes talk\nIf you wasn't seen then you might walk\nEven if it ain't the time of day these niggas will find a way like locos off of NoDoz\nCareful when you servin' yo blows, because those hoes got the Po-Pos posing as hobos\nTake a photo but please tell the Chi Town, he freeze\nThey don't give a fuck if it was DT's\nThey be up like the sea breeze on CC's\nAnd they handin' out these murders like free cheese\nCould you pass me the B please?\nI got intricate shit to kick even though I campaign with a gang\nBumpin' the dough in different denominations in nations and embracing' every word, because I'm slangin' the same\nIf you can hang at my town up at K-Town\nIf you dissin' them then you dissin' me\nNiggas actin' like they glad to die, so if you had to try\nIf they faded you it wouldn't mean shit to me, just an unsolved mystery\n\n[Hook]\nBefore I saw his body lyin' down\nI heard a motherfucker crying loud\nHave you ever seen a bitch nigga get put to misery\nAnd left an unsolved mystery?\nBefore I saw his body lyin' down\nI heard a motherfucker crying loud\nCaught him up and wasn't wearing a vest, shot up his head and chest\nPut to rest, now the rest should be history\nBefore I saw his body lyin' down\nI heard a motherfucker crying loud\nNow have you ever seen a bitch nigga give put to misery\nAnd left an unsolved mystery?\nBefore I saw his body lyin' down\nI heard a motherfucker crying loud\nNiggas actin' like they glad to die, so if you had to try\nIf they faded you it wouldn't mean shit to me\n\n[Verse 2]\nIn a hoopty the shorties'll design a spot\nSo when they get pulled over, them people wouldn't find the spot\nBut if you ain't got it hid, you have the floor it if you can throw it\nAnd motherfucker it's a nine to knot\nJust go back to where your thang lay\n'Cause lowkey niggas they started out in the gang way\nBut if you wild when your aim spray\nThem niggas that you aired out is gonna be comin' back the same day\nIn the middle of a war you ain't on the tip\nIf you get the guns and clips to keep doin' what you doin'\nIs it the same chiefs that got the same beef?\nClaimin' they ain't been doin' the bruh be givin it to 'em\nFlamboyant niggas must be slow\nIf your bitch ain't get popped then it's a blessin', she a lucky ho\n'Cause no matter where the fuck he go\nIn K Town they will dress him in a casket and tuxedo\n'Cause you can't be actin' thug roof\nBecause of Hennessy and drug use these niggas love juice\nSome don't even consider gettin' caught\n'Cause when you talk up some shit\nThey gonna be quick and let the slugs loose\nThese motherfuckers heart is love boo\nEspecially like them niggas up at ghost town Windy City snipe\n'Cause it's a city when hype for niggas wanna get witty\nFor comin' too pretty and be chilli filled and decipher\nTo pay the piper and bow to viper, twice is rough\nNow is what I'm kickin' hype enough?\n'Cause every time I puff and write this stuff\nI kick a frenzy facin' fuck in fury, 'cause I don't like to bluff\nIf we ever get into it and let the static get to me\nLet's squash it and make it history\nNiggas actin' like they glad to die, so if you had to try\nIf they faded you it wouldn't mean shit to me, just an unsolved mystery\n\n[Hook]\nBefore I saw his body lyin' down\nI heard a motherfucker crying loud\nHave you ever seen a bitch nigga give put to misery\nAnd left an unsolved mystery?\nBefore I saw his body lyin' down\nI heard a motherfucker crying loud\nCall the popo the man and mess, shot up his head and chest\nPut to rest, now the rest should be history\nBefore I saw his body lyin' down\nI heard a motherfucker crying loud\nNow have you ever seen a bitch nigga give put to misery\nAnd left an unsolved mystery?\nBefore I saw his body lyin' down\nI heard a motherfucker crying loud\nNiggas actin' like they glad to die, so if you had to try\nIf they faded you it wouldn't mean shit to me\n\n[Verse 3]\nNow listen they be kickin' hocus-pocus\nI done said shit to put your motherfucking eyes out of focus\nSo writing what I wrote is hopeless\nIf you see and base something you said then you better be ferocious\nAnd matter fact I hope the dopest\nFore you to try to cope this is hopeless, 'cause my lethal rhymes\nIs the kind that can beat you blind, and pre-design\nI peep through mines like a see through lines\nCheck the brain and see defined\nThe reason I'm gunnin' I tried the runnin'\n'Cause I should have let you know\nI don't give a fuck who you fronted because you was blunted\nWest side to the Hundreds you can't step to ho\nIn the state of emergency urgently the ambulance will come\nAnd then the law will come demand the gun\nBut bullshit is irrelevant, they need evidence\nOr trippin' on elegance they be holdin' out they hands for some\nIf anything they'll hand 'em some\nOr get with him, here come the victim\nHe be shot up in his pants and lungs\n'Cause he actin' hard and ran his tongue\nDoesn't mean another nigga he meet in the street gon' be the man to run\n'Cause a prison is some shit to see\nMatter of fact fuck the talkin', my lip, let me hit the B\nNiggas actin' like they glad to die, so if you had to try\nIf they faded you it wouldn't mean shit to me, just an unsolved mystery\n\n[Hook]\nBefore I saw his body lyin' down\nI heard a motherfucker crying loud\nHave you ever seen a bitch nigga give put to misery\nAnd left an unsolved mystery?\nBefore I saw his body lyin' down\nI heard a motherfucker crying loud\nCall the popo the man and mess, shot up his head and chest\nPut to rest, now the rest should be history\nBefore I saw his body lyin' down\nI heard a motherfucker crying loud\nNow have you ever seen a bitch nigga give put to misery\nAnd left an unsolved mystery?\nBefore I saw his body lyin' down\nI heard a motherfucker crying loud\nNiggas actin' like they glad to die, so if you had to try\nIf they faded you it wouldn't mean shit to me", "image": "https://images.genius.com/d3d24875934a3f4e43760767e5f7584d.1000x1000x1.jpg"}], "artist": "Twista"}