{"songs": [{"title": "Everything I Am (Alternate)", "album": null, "year": null, "lyrics": "[Hook]\nHere we go again\nPeople talkin' shit, but when shit hit the fan\nEverything I'm not made me everything I am\nHere we go again\nPeople talkin' shit, but when shit hit the fan\nEverything I'm not made me everything I am\n\n[Verse 1]\nI'll never be picture perfect Beyoncé\nBe light as Al B. or black as Chauncey\nRemember him from Blackstreet?\nHe was as black as the street was\nI never be as laid back as this beat was\nI never could see why people'd reach a\nFake ass facade that they couldn't keep up\nYou see how I creeped up?\nYou see how I played the big role in Chicago like Queen Latifah?\nI'd never rock a mink coat in the summertime like Killa Cam\nOr rock some mink boots in the wintertime like will.i.am\nLet me know if you feel it, man\nCause everything I'm not made me everything I am\n\n[Hook]\nDamn, here we go again\nPeople not sayin' what's not for him\nBut everything I'm not made me everything I am\nDamn, here we go again\nPeople talkin' shit, but when shit hit the fan\nEverything I'm not made me everything I am\n\n[Verse 2]\nAnd I'm back to tear it up\nHaters, start your engines, I hear 'em gearin' up\nPeople talk so much shit about me at barbershops\nThey forget to get they hair cut\nOkay, fair enough, the streets is flarin' up\nCause they want gun talk or I don't wear enough\nBaggy clothes, Reeboks or Adidos\nCan they add that he just spazzed out at that show?\nSo say goodbye to the NAACP award\nGoodbye to the India.Arie award\nThey'd rather give me the Ni-Nigga Please award\nBut I'll just take the I Got A Lot of Cheese award\n\n[Hook]\nDamn, here we go again\nPeople talkin' shit, but when shit hit the fan\nEverything I'm not made me everything I am\nDamn, here we go again\nEverybody talkin', but when it hit the fan\nEverything I'm not made me everything I am\n\n[Bridge]\nKeep the pianos goin', goin', goin', goin', goin'\nAnd I'll keep flowin', flowin'\nI got to keep it goin', goin', goin'\nAnd I'm a keep flowin', flowin'\nAnd I'll keep flowin', flowin'\nAnd I'll keep flowin', flowin', flowin'\n\n[Verse 3]\nWhen I wrote this dope shit, what I noticed was so bogus\nA lot of people talk about you when you growin' up\nBut you got to stay focused\nPeople who was number one in school end up like smokers\nPeople you talk the most about\nNo doubt, sometimes end up the dopest\nAnybody know they can't touch the way I flow\nI guess it was the way I run from school to school\nAnd sometimes wasn't treaten cool and broke all the rules\nAnd always ended up in the office like Michael Scott\nNow I got rings like Michael got\nThat's Jordan, let me tell you somethin' more important\nYou think I wrote this, no, it just comes off the top of my\nWhatever topic I\nStop it, I'm probably the best out, Mr. West out\nYo, don't nobody want to bout\nI knock people out in the first round. the first down\nHear the touchdown, y'all don't even want to clown\nWith the red shoes on just to let you know I'm freestylin'\nYes, ill, I'm wilin'\nI see you, uh, at the mall to show this is my mornin' flow\nSo imagine my midnight sight when I ignite lyrically\nI just might, everybody just bite\nWhen I wrote this, I was picturin' a little girl in high school\nWith people pickin' on her, tellin' her what she not\nThen she'd grow up to be model, so they'll be hot\nAnd everything she not made her slam it\nEverything she not made it everything she am\nThat's incorrect English, but I'm way too distinguished\nCan understand this, I rock the planets\nCameras be candid, on, I was lookin' at my prior image\nMy wire image, this week has been a bad massage\nI need a happy endin', get it?\n\n[Hook]\nDamn, damn, here we go again\nPeople talkin' shit, but when the shit hit the fan\nEverything I'm not made me everything I am\n\n[Bridge]\nAnd I'm a keep goin', goin', goin'\nAnd I'm a keep flowin', flowin', flowin'\nAnd you just keep goin', goin', goin'\nAnd I'm a keep flowin', flowin', flowin'\n\n[Outro] (x3)\nNow when they get hard, I need you to keep goin', goin', goin'\nAnd I'm a keep flowin', flowin', flowin'\nAnd one day you gon' show them, show them, show them\nAnd one day you gon' show them, show them, show them", "image": "https://images.genius.com/70c6e506a91f6dabdd23cad304812ce3.533x533x1.jpg"}], "artist": "Kanye West"}