{"songs": [{"title": "Say What?", "album": "Runnin’ Off at Da Mouth", "year": null, "lyrics": "(Say what, say what, say what - what?)\t(4x)\n\n[ VERSE 1 ]\nI'm rockin a rhythm, and I'm never wick (what?) wack\nI'm rockin a rhythm, and I'm never wick (what?) wack\nI'm rockin a rhythm, and I'm never wick (what?) wack\nI'm rockin a rhythm, and I'm never wick (what?) wick wack\nIt's the Mr. Twista comin to twist the (what?) tongue\nI make the melody go dum diddy (what?) dum\nI crush a rookie like a cocky cookie (what?) crumb\nI twist the words to leave the nerds sayin (what?) uhm -\nMy lyrical flowin'll make em cry boo- (what?) -hoo\nI tick a tock to make the clock coo- (what?) -coo\nYou think I'm wack, then black, I flow for you (what?) too\nThe crew was through as if I knew voo- (what? -doo\nNever say hello, that makes hell (what?) low\nI flex a funky tongue like it was jell- (what?) -o\nComin to flow against a funky fell- (what?) -ow\nAre you afraid, or should I say yell- (what?) -ow?\nWhat I bring will swing like ping (what?) pong\nTryin to copy this, I bet you swing (what?) wrong\nI ring the bells just to hear the ding (what?) dong\nI'm throwin a style that be breakin em up in the flow of the song\n\nThe Tung will twist and make the people say (what?)\t(3x)\n\n(Say what, say what, say what - what?)\t(4x)\n\n[ VERSE 2 ]\nI know the time, I kick the funky tick (what?) tocks\nI flow forever, never to quit, be non- (what?) -stop\nTo boost the juice I used to flow upon (what?) blocks\nYou couldn't manage if your name was Don (what?) Knots\nI sliced a victim up like Han (what?) Solo\nAs sure as Dorothy's puppy's name was To- (what?) -To\nToe to toe I'm never to give a low (what?) blow\nI'm kickin sorta funky like a ho- (what?) -bo\nSissy chickens, I call the fag a he- (what?) -she\nJust scope the funky tongue, I flow in 3- (what?) -d\nThe phrase wick wick if you think it be (what?) me\nMy tip be glowin as if my name was E. (what?) T\nShe sells seashells by the sea- (what?) -shore\nHave you heard a flow like this be- (what?) -fore?\nGettin deeper than the deepest sea- (what?) -floor\nCheck the style, that's only one, there'll be (what?) more\nOh Salem, went to hip (what?) hop\nTo see just what he could hip (what?) hop\nAnd all that he could hip hip (what?) hop\nWas the Mister Twista funky hip (what?) hop\n\nThe Tung will twist and make the people say (what?)\t(3x)\n\n(Say what, say what, say what - what?)\t(4x)\n\n[ SHOUT OUTS ]\nTo moms and pops and my whole family (what?) peace\nTo Rashida B and Johnny I say (what?) peace\nTo my man Eric The Wiz I say (what?) peace\nTo DJ Rhythm and Lower Level I say (what?) peace\nTo the Ansaars and Chicagods (what?) peace\nTo Dr. York and Abdul Mallik I say (what?) peace\nTo Bobby Price and my man Bay Bay I say (what?) peace\nI'm pumpin em up in a funky rhythm and I'ma say (what?) peace\n\nThe Tung will twist and make the people say (what?)\t(3x)\n\n(Say what, say what, say what - what?)\t(repeat and fade)", "image": "https://images.genius.com/f451034356ebcc4eb5aa785c572b265f.953x953x1.jpg"}], "artist": "Twista"}