{"songs": [{"title": "BUFFALO", "album": "Cherry Bomb", "year": "2015-04-13", "lyrics": "[Intro: Bunny Sigler]\n\"Yeah!\"\n\"You feel alright?\"\n\"Yeah!\"\n\n[Verse 1: Tyler, The Creator]\nGod, goodness gracious\nI can't wait to see the look on y'all niggas faces\nThat boy T nuts, surprised his thoughts isn't chafing\nAnd fuck them crackers up at Mountain Dew, them niggas is racist\nCabbage was made, critic faggots was shook\nSo I told 'em that I'll exchange the word \"faggot\" with \"book\"\nAnd all them \"books\" is pissed off and had they page in a bunch\nFucking attitude switched just like a \"book\" when it struts\nBut I'm a fraud, I pray to God when the six triple \"book\" bashing\nWhile me and my favorite author's lips tickle\nPeter Parker pick a pack of peppers when the plot thickens\nTyler, The Creator fucking kill you with a popsicle\nCold blooded, so we rock mittens so they won't find him\nNot kidding, keep the Tommy on me; bitch, I'm Ms. Pickles\nSaid I seemed off, last time that team talked\nSick of making niggas cabbage so I took the 'Preme off\nShould've bought some stock in it (Yo, it's fucked up, I get it, put a sock in it)\nNot Golf when the little homies don't—wait, let's weigh my options\nI bought me a mansion, and bought some attention\nAin't give none to Hopsin, and dear Boyce Watkins\nWhy you mad? It's the slave in me\nIt's facts, boy, I'm back like Rosa Parks's least favorite seat\nVideos, stage dives, popups, they watching T\nWhile y'all niggas watching the throne, the throne be watching me\n\n[Interlude: Shane Powers, Tyler, The Creator, Bunny Sigler]\n\"If you fuck this up... There are so many fucking kids right now, listening to this guy.\"\n(\"Yeah!\"—\"You feel alright?\"—\"Yeah!\")\n\"Get those wings flapping, motherfucker! 'Cause this kid's ready to fucking fly.\"\n(\"Yeah!\"—\"You feel alright?\"—\"Yeah!\")\nEenie, meenie, miney, mo, nigga, nigga on the wall\nRap bars, jail bars, die or shoot a basketball\nTyler, the dark skin arrested in Austin\nCops know who I was cause their kids said the show was awesome\n(\"Yeah!\"—\"You feel alright?\"—\"Yeah!\")\n\"Tyler, Tyler, I swear to—I swear to fuck! If you fucking... Do not fuck this up! You have the whole world in your fucking hands.\"\n(\"Yeah!\"—\"You feel alright?\"—\"Yeah!\")\n\n[Verse 2: Tyler, The Creator]\nHow many leaders in the house?\nWell can somebody bring the mirrors out? I'm getting lonely\nLikes and apologies and snaps make it obvious\nThat everybody on this fucking planet lacking confidence\nHow many leaders in the house? (Do not fuck this up!)\nWell can somebody bring the camera out so I can film me?\nT a great director, niggas' vision must be blurry\nBoy, I get them epic shots like jaywalking in Missouri\nWait, how many leaders in the house?\nWell can somebody bring my album out so I can hear one?\nPour me a drink, shit, I don't know what to think\nCause all these niggas leaning like they Forest Whitaker's blink\nWait, how many leaders in the house?\nSee why nobody got they hands up? See, that's the issue", "image": "https://images.genius.com/d363c1a1794946fc7054c2d292e6abcf.640x640x1.jpg"}], "artist": "Tyler, The Creator"}