{"songs": [{"title": "Leave Me Alone", "album": "Tha Last Meal", "year": "2000-12-19", "lyrics": "[Snoop]\nYo.. uh-huh\nI'mma try somethin different on this right here\nBut I know y'all gon' feel it\nCause I know y'all feel me\nIt's some real shit right here, y'knahmsayin?\nI ain't never did it like this before\nCheck this out..\n\n[Snoop - singing]\nI'm the kind of G that everybody knows\nBut I'm so low-key, when it comes to hoes\nI never break the rules and that's just how it goes\nAll my friends and foes - know that's just how it goes\nI can flip the script but I chose not to this time\nThere's so much to say with so little time, but I like it\n(Yes I like it)\nI'm gon' dip dive socialize and get high\nI wish my people had, other ways\nI'm thankful, that a brother's paid (that a brother's paid)\nBut how can I be happy? My hair is still nappy\nI miss my grandpappy\nI wanna do right but the world is wrong\nThat's why I'm singin this song\n\n[Hook]\nI'm tryin to stack a dollar pop my collar while I'm singin my song\nY'all niggas better leave me alone (I think you better leave me alone)\nI think y'all betta leave me alone (I think you better leave me alone)\nI'm tryin to stack a dollar pop my collar while I'm singin my song\nYou bitches better leave me alone (I think you better leave me alone)\nI think y'all betta leave me alone (I think you better leave me alone)\n\n[Snoop - singing]\nThere's so much goin on out there in the world today\nAll these - ladies, players, gangsters, and suckers\nI get caught up sometimes, some of the people I hang with\nThey turn out to be snitches, bitches, yeah they switches\nBut you know like I know I can't stop doin, what I got to do\nI'mma keep doin what I got to (I'ma keep doin) y'know!\nEverywhere I go, the game is the same\nPeople lookin at me want me to say somethin\nWant me to do somethin, but I don't know nuttin\nIf I ain't gettin paid, I can't drop no rhymes\nI can't do nothin for you no mo', I ain't got that kinda time\nAnd they know..\n\n[Hook] w/ minor variations\n\n[Snoop - singing]\nI try to be to myself, and try to stay.. away from the world\nBut the world just keeps runnin after me (runnin after me)\nI try to shield myself away from all the wickedness\nBut somehow, the wickedness is in my circle - what am I to do?\nI try to ask God to help me get through this\nWhat am I to do to this? Just do this, let's do this\nSo I, continue to mash, day by day (day by day)\nI continue to play, play by play\nAnd I con-tinue to spit my manuscript (spit it)\nAnd say what I want to say (say it)\nAnd I do it to ya ev-ery-day\n\n[Hook] w/ minor variations\n\n[Snoop Dogg]\nLeave me alone, I think you better leave me alone\nLeave me alone, leave me alone - better leave me alone\nIf it don't pay you wrong, leave me alone\nI think you better leave me alone, leave me alone\nLeave me alonnnne, leave me alonnnne\nIf it don't pay you wrong..", "image": "https://images.genius.com/1abc5e5fc609da0014a0675d49a1a15f.953x953x1.jpg"}], "artist": "Snoop Dogg"}