{"songs": [{"title": "The Worst", "album": "The Worst", "year": "2000-09-12", "lyrics": "[Intro]\nThis is dedicated to my kids\nAliya Renée Yates and Dontez Antonio Yates\n\n[Verse 1]\nAs I blaze the PM, I inhale with the scent of a million men\nI exhale with dumpin' .17 up in the front, I am\nIn the midst of a crisis God knows all the sacrifices I made\nMight have to heist to get paid despite\nBut can't just the price that a nigga played bitch made\nNiggas think they know me, they don't know me\nThey phony, funny but they don't know\nThat I'm that ill type nigga that'll open that gut\nNot much luck\nI'm feelin' stuck with a capital S\nHit the cess, killed the stress\nRottin' away in the Midwest, I guess\nThey was right when they said I was such a psycho sight\nSick inside a slight\nDeliver that makes me want to go Master P at night, right?\nNo more pain I complain and pray to God, and stuffs\nIt was unbearable until I tried Cocoa Puffs\nThat Chocolate Thai got me willin' to fly up in the sky\nBut when I lose altitude that high\nMakes me wanna just come down and die\nWho's responsible for this madness, me?\nWho's responsible for this sudden strike of sadness, me?\nI can see\nI can look into your eyes\nSmile and then to your surprise\nI'll be yellin', \"Die, nigga die\" when all the bullets fly\nDon't know how much longer I'll be on this Earth\nBecause I'm the worst type of nigga on this here turf\nSo disperse\n\n[Chorus: Paul Law]\nLiving in misery\nThe worst, the worst, yeah\nThey keep tryna pull me under\nBut I been too long tryna make it over\nThe worst, the worst, yeah\nAfter all that I been through\nI just don't know what the hell to do\n\n[Verse 2]\nWhat it is, what it was and what it shall be\nYou tell me\n'Cause this nigga ain't livin' healthy\nBitches think I got money from here to Sri Lanka\nSo I'm thinkin' of killin' you when I'm makin' love to you Bianca\nCan't you see I ain't you seein' what I mean\nI got plenty of mean streaks, my team tweaks\nSo my future seems bleak\nTake a peak at me, I ain't happy she got me\nUnder child social services and shit for bein' a slacky pappy\nMy khakis are low saggin' from illegal tight little baggies\nPush it to them on top of the world like James Cagney\nFeel that agony\nPeople naggin' me\nMy raggedy life ain't worth livin'\nSick of my aunt and uncle draggin' me\nSee me drink my life away, smokin', tokin' my life away\nTryin' to put this trife away in the deepest darkest hide away\nIf I could fly today to the Golden Gates\nI could get away from this place of hell and fakes\nBut it might be too late\nWhat it gonna be? D-E-A-D\nAnother S-T-A-T-I-S-T-I-C, that's me\nPuffin' that stronger W-double E-D that hunger\nDon't know how much longer I'll be on this Earth\nBecause I'm the worst type of nigga on this here turf\nSo disperse\n\n[Chorus: Paul Law]\nLiving in misery\nThe worst, the worst, yeah\nThey keep tryna pull me under\nBut I been too long tryna make it over\nThe worst, the worst, yeah\nAfter all that I been through\nI just don't know what the hell to do\n\n[Verse 3]\nThat's why I say F-A-H-Q if you ain't crew\nSome busters on my hit list betta hope it ain't you\nMy pockets thin, about to sin\nI got to spend about like 10\nTo get that Henn, to make that blend\nTo make that fool come up out his ends\nDevilish thoughts, hell is feelin' kinda of crellish\nGod tell us what we got to do to make the motherfuckin' relish\nSpell it out to me 'cause broke is embarrassin'\nI'm psycho like Woody Harrelson\nI can make a comparison\nLike Aaron Yates, Norman Bates, perfect mates\nDippin' up in Ollie Gates\nBitches yellin', head is swellin'\nThinkin' of goin' to hell and bakin' with the beans\nGot me fiend, murder for my green\nSeems, I'm cursed not first\nThe last verse\nI burst, into a blood thirst, but what is it worth?\nNo hearse, nobody's turf\nFuck planet Earth, disperse\nBecause you're dealin' with the worst (the worst)\n\n[Chorus: Paul Law]\nLiving in misery\nThe worst, the worst, yeah\nThey keep tryna pull me under\nBut I been too long tryna  make it over\nThe worst, the worst, yeah\nAfter all that I been through\nI just don't know what the hell to do\n\n[Outro: Paul Law]\nThe worst\nI know that it can't get no worst\nThe worst, the worst, yeah\nAfter all that I been through\nI just don't know what the hell to do", "image": "https://images.genius.com/87934aebc9ee54de45c58f2e2bede516.369x369x1.jpg"}], "artist": "Tech N9ne"}