{"songs": [{"title": "One More Joog", "album": "Dark Horse", "year": "2014-01-01", "lyrics": "[Into: Don Juan and Twista]\nOne more joog, one more\nJoog (one mo')\nNigga, I'm turnin, turn up!\nOne more joog (guap)\nAy (money)\nDrank, turn up!\nOne more joog (count what?)\nOne mo', one mo' drank, drank (this ain't for the rappers)\nNigga, drank (this for the ones that be joogin, Twista)\n\n[Hook: Don Juan]\nOne more joog\nMy niggas be trappin, straight out the land though\nRed bandanna, lookin like Rambo\nUsed to be walkin, now I'm in Lambos\nStill pullin joog after joog, light yo' black out like a candle\nAll I need is one mo', all I need is one mo'\nE'rybody lay down, what you think that I come fo'?\nJoogin, ridin 'round just lookin (one mo' joog, gimme one mo' joog!)\nI'm joogin, ridin 'round just lookin (one mo' joog, gimme one mo' joog!)\nOne mo' joog\n\n[Verse 1: Twista]\nTwista, I'm a winner\nJoogin in a city full of motherfuckin killers\nFuckin with them niggas on the corner servin pillars\nAnd they get it every morning from the summer to the winter\nWith a pocket full of figures and I got the hood of niggas\nAnd a banana clip for the gorillas\nThrow up a middle finger for whoever don't feel us\nMatter fact, if we have to we'd be comin after your dinner\nI'ma drop a joog on you niggas right now\nWhat you spendin 35 hundred for a pound?\nI'ma take it 35 hundred joog 35 times\nMake it 35 muh'fuckin pounds\nC-c-city full of niggas that be misunderstood\nAnd I might come and stick you up if you got the goods\nCome in here talkin that shit, I wish a nigga would\nYou wanna know what they on when you in the hood\n\n[Hook: Don Juan]\n\n[Verse 2: Twista]\nI could joog your tax\nI'll make a quick hundred racks with that wire\nThen flip it and bring it back\nAnd make a few hundred stacks with that fire\nPut the K roll in the Ac'\nI roll one and sit back because I'm waitin on a hundred units\nAnd if I don't come up off of that\nI'm servin the dummy pack and face the drama when I run into it\nAin't nothin like us\nGotta send a shout to the lifers\nRoll in the Camaro with the car crackers\nIn the club poppin bottles with the swipers\nShoutout to my plug\nLet's get it - shoutout to my shooters\nMy shooters got shooters\nMy hitters got hitters and they got bazookas on\n\n[Hook: Don Juan]", "image": "https://images.genius.com/5a82462c7648c262cd242217da588ea0.500x500x1.jpg"}], "artist": "Twista"}