{"songs": [{"title": "II. Worldstar", "album": "Because the Internet", "year": "2013-10-23", "lyrics": "[Produced by Childish Gambino & Ludwig Göransson]\n\n[Intro]\nOooohh (damn)\nFuck outta here dog (oohh) wassup, wassup\nDon't, don't try to jump me\nDon't try to jump me, fool\nYou got it, I ain't even wanna fight homies\nYou got it, cuz (damn!)\nYou got his-\n\n[Verse 1]\n(Blow up...)\nWorldstar before rap, you already know that\nSo Fresh Prince, they about to bring the show back\nListening to Kilo, weekend cost a kilo\nHair so long, I'm about to bring the fro back\nPhone call gotta say \"Moshi moshi\" (Moshi moshi)\nGirlfriend actin' all wishy-washy (wishy-washy)\nIt's your birthday, make it earthquake\nFell in love with a nigga like a mermaid\n(Daddy, I love him!) That's a first date, uhh\nNobody think about it, worst case, uhh\nBest case, we the front page, uhh\n10K on the first day, uhh\nYeah, mothafucka, take your phone out\nTo record this, ain't nobody can ignore this\nI'm more or less a moral-less individual\nMaking movies with criminals, tryin' to get them residuals\nWhen it all go crazy\nWhen I hear that action, I'ma be Scorsese\nMy nigga hold it horizontal man, be a professional\nDamn my nigga, be a professional, what you doing man?\n\n[Interlude]\nGet up, get up\nGet the man right here (*screams*)\nWorldstar!\nWorldstar! (Worldstar) Worldstar! (Worldstar)\nWorldstar! Worldstar! ('star!)\n\n[Verse 2]\nMy girl ain't bad, she more like evil\nWhen I'm lookin' in the mirror, how fly's this negro?\nShe on Hollywood and Vine, thinkin' that she Hollywood on Vine\nMakin' movies with her friends all the time\nShowin' off her ass, that's a net twerk (twerk)\nBut I saw through it like a wet shirt (hol' up)\nDrive slow 'cause you might swerve off it\nStill eat and the hate so salty\nPut shrooms in my roommate's coffee\nAnd got more likes than a white girl talking\nMore hits than a fight comp\nWhere they fight cops 'til they stop, when I heard shots\nWatching dude drop from a Glock at a—(shots fired)\nOhhh, Worldstar!\nLet me flash on 'em, we all big brother now\nLil' sis, let her run around\nMoney talking, you know the sound (brrrr!)\nMoney counter (brrrr!) AK (brrrr!)\nCell phone (brrrr! Hello?)\n\n[Interlude: Steve G. Lover]\nYo, bro man, check out that video I just sent you, man\nThis shit is hilarious, man, it's like this kid, man, he got like sh-\nHe got like hit on the side of the head, man, he's like freakin' out\nLike, heh, it's like he think he completely lost blood and shit\nHahahah, it's hilarious, man...\n\n[Outro]\n(Worldstar! Worldstar! Worldstar!)\nWe don't wanna be on (Worldstar! Worldstar!)\nAnd all I wanna be is a (Worldstar! Worldstar!)\nWe don't wanna be on (Worldstar! Worldstar!)\nAnd all I wanna be is a (Worldstar! Worldstar!)\nWe don't wanna be on (Worldstar! Worldstar!)\nAnd all I wanna be is a-", "image": "https://images.genius.com/b8c1f5981bc77ffd06580a1f2e693cf3.300x300x1.jpg"}], "artist": "Childish Gambino"}