{"songs": [{"title": "Get Up Get Down", "album": "Gangsta’s Paradise", "year": "1995-10-02", "lyrics": "Verse One: Malika\n\nSteppin up out the shadows I comes equipped to wreck\nHold up just a sec Coolio I'm on deck (Malika)\nYeap the diction is on point\nCausin, friction when I flex up the jaw to hit the joint\nThat can actually give a blood mob like Gotti\nLike the body cool, keep the strap up by the naughties\nNiggie trippin why you beam us I don't step up with no bullshit\nSee that there it's clip for this stickup on the hip\nPeep the correct way to get your pimp on\nLet me hit the bong oh and my mind's quite strong\nWreck it nice and proper if it's on I'm finsta to stop her\nIf I'm swingin for the knockout, best believe I'm fits to drop her\nNinety-five's on poppin, representin I keep stompin\nThrow up my fists just like this when I'm mobbin\n\nVerse Two: Shorty\n\nI killed the last, killed the ass, with my ninety-five drive\nI'm deep like Denzel with my Crimson Tide, nigga\nLike Chaka Khan, I tell you something good\nI'm Hi-C like Spike Lee within Tales From the Hood\nYou need it, I'll feed it, baby check the size\nHave you Goin' Down like Mary J. Blige\nWhen it's poppin like this, you can't be a coward\nShorty freaks fuckin beats like Adina Howard\nMy squad is hard, with players, and hustlers\nNo toleration, for fakers and busters\nFuckin with me with all honesty\nYou get bombed rap songs comin constantly\nBumpin G-15's, Westside scene\nKillin the competition, while making a fuckin green\nSo ring, around the rosie, and mosey to the Rosie\nAnd I want you to know G\n\nChorus:\n\nWe bust and cuss and kick up dust\nDon't none of y'all niggas want to fuck with us\nSo what's the time?  It's time to get real\nWhy you bust your rhyme?  Cause I got skills\n\nWe bust and cuss and kick up dust\nDon't none of y'all niggas want to fuck with us\nSo what's the time?  It's time to get real\nWhy you bust your rhyme?  Cause that's how I bail\n\nVerse Three: Leek Ratt (of 40 Thevz)\n\nWatch me, swallow this nickel and shit five pennies\nI'm the loc'est of them all though the rat is kinda skinny\nHow many linny and squidgy think they can see me?\nI'm from Compton where even in the summer niggas wear beanies\nBustin lyrics sharper than razor blades catch it from head to toe\nIf you're shocked, then amazed, when you see me at my stage show\nFor my stage show beat em up\n40 Thevz gettin busy rockin coast to coast\nDogs the most rap the hoes then rocks em up\nGivin it up for hip-hop vicitims how should I drop em and then pop em\nFor poppin like to get what I got, and I ain't got a whole lot of nuthin\nCuz I been ruffin and scuffin so give it up when I'm bustin or get to duckin\nCuz I ain't given em nuthin\nFools can't get none, so fuck em!\n\nVerse Four: PS\n\nLet me rock the motherfuckin mic\nSmoke a whole stick of dynamite, then fight all night\nI got jabs like a welterweight champion\nThe pocket-pincher purse-snatcher pistol-packin\nQuick to get it crackin\nWent from jackin to rappin to runnin with a pack of mad men\nPull a trick out my sleeve like Aladdin\nSome fool tried to play me for a punk I had to have him like\nLunch or dinner, he's just a beginner\nFuckin with a winner, number one contender top dog\nHead nigga in charge runnin with a group of hogs\n40 Thevz, MAAD Circle, Cat, and Crowbar\nBest to put your daughter\nWack ass rappers get tossed up\nTrying to come in here with that garbage\nMy crew see the dopest and the hardest\nSo clear the path or get your punk ass Bogart-ed\n\nChorus 1/2\n\nVerse Five: Ras Kass\n\nI peep game and get recognized, buyin all the hard liquor\nToothpick and beedy-dyin\nBitch you got dealt, peeled your cap the other way\nLike a reversible Louis-Vitton Gucci belt\nAnd ain't nothin crackin\nFor them niggas steppin up with the funk I'm packin Tinactin\nCause I be earnin stripes in tight bunches\nAll the homies carry nines I carry rhymes in sucker punches\nWhat?  Tootsie, my knees don't bend\nJust like that actor Hoffman I be Dustin off men often\nJaywalkin over your coffin with an eleven shot loss and\nJohn wrecked that Austin won't soften you're lost and\nSee arson, to exterminate the flyest nigga like Orkin\nStalkin lofts men to New York and in between\nSo take caution, leave the flossin for dental hygeine\nMental plus my gene equals nasty young bastard\nThe raps be lung mastered takin vinyl's virginity\nCoincidentally I run shit like Walter Payton\nNiggas player hatin cause I spoke like a Dayton\nI kick the bass like Ron Carter at the Carter when\nCMB came strollin\nBlowin niggas up like when Mookie's stupid ass got caught smokin\nFigure, your stigma is lack of enigma\nSo bitch-ass niggas better step, like the Delta Sigma Thetas\n\nVerse Six: Coolio\n\nWe don't give a fuck, fools better duck\n39 deep in the back of Wino's truck\nLike robbin in the paint, fool think I ain't?\nYour crew is on stank, that's why I'm pullin rank\nI rev like a motor float ON like a boat to\nKick a style like Tical from here to North Dakota\nThe ambassador of funk with amps in the trunk\nAnd when it's time to rock a mic I won't be no punk\nI bring death to the evil and power to the people\nMy name ain't Steve Miller but I Fly Like an Eagle\nDon't play me for a chump, I get around like Gump\nAnd I, got more con in my verse than Chuck\nAnd you don't want no motherfuckin problems here\nCuz I can round up a posse like Paul Revere\nYour whole crew'll get took out, turned out, shook out\nBurned up like a cookout, so fools better look out\n\nVerse Seven: WC\n\nFresh out the penalty box\nSportin a stockin cap, cut off dickies, and some high-top striped socks\nThe freestyle finatic pyschosomatic back at it causin static\nWith lyrics still as tight as a straight jacket\nThe last in line but one of the first to get wit cha\nBringin more terror to MC's than a Michigan militia\nClick click boom, nigga fuck your crew\nIt's the chanky hip-hopper, takin over pissin in your stage monitor\nSocket you think that you can fuck with mine in your wildest dreams\nYou best to wake up and apoligize\nNiggas penetentiary yearn me cuz I, burn like Parker\nBut anyway, half of y'all couldn't see me with a pair of Blu Blockers\nThe lyrical night stalker stalkin at night in a pair of creased Khakis\nChuck Taylors, my pistol grip tight\nDub-C, that nigga from Westside MAAD Circle\n\nAy man!  Ay ay\nWhat's up Wino?\nUh like loc, it's like late, let's get the fuck up out of here\nAre we out?\nYeah yeah fuck it\nFuck it, MAAD Circle bitch!", "image": "https://images.genius.com/bd2e6c4ceafdecadc8f1ece3f595f617.1000x1000x1.jpg"}], "artist": "Coolio"}