{"songs": [{"title": "Fkn’ Science Bro", "album": "E.A.R.T.H (Educational Avatar Reality Training Habitat)", "year": "2016-04-22", "lyrics": "[Intro: Teacher]\nStop running in the halls! Stop! Slow down, sir! Slow down, sir! Stop running in the halls, sir! Anthony get to class! You're never going to become a college student at that rate!\n\n[Hook]\nFuckin' science\nFu-fuckin' science, bro\nLabcoat, check, goggles, check\nNodules, check\nFu-fu-fu-fu-fuckin' science, bro\n\n[Verse 1: B.o.B + Teacher]\nHi-yah lads! Welcome to science class\nBob quit writin' raps in your log sheet, nobody's gon' sign your ass\nOkay let's get scientific\nFossil fuels come from years and years of bio-decomposition\nIt's really just scientific\nWhy didn't all the fossils turn to oil?\nSome did, some didn't\nAnyway...\nDidn't Rockerfeller pay the scientists off the year of the Geneva Convention?\nWait? What was that?\nYou wanna come up here in front of class?\nWhat? You wanna teach?\nYou really think you're smarter than me?\nNo sir, sit down\nHere's your homework on the atom bomb and the World War\nHow it affected us then and now\nWell uh... I seen the footage and uh, I really just want some answers\nHow does someone film an atomic bomb and it doesn't destroy the camera?\nI mean...\nI was just...\nBRO!\nBro, I'm just sayin'... I don't know\n\n[Hook: B.o.B]\nFu-fuckin' science, bro\nLabcoat, check, goggles, check\nNodules, check\nFu-fu-fu-fu-fuckin' science, bro\n\n[Verse 2: B.o.B + Teacher]\nWelcome to history, we evolved from neanderthalsThat is no mystery!\nWell why are there no monkey fossils anywhere?\nWhat, are you kidding me!?\nI'm just sayin'... I just\nShoulda learned that way back in elementary\nMan this nigga don't know what the fuck he talkin' about\nI have a diploma, do you have a diploma?\nOr a learning disorder?\nMy wife is a lawyer, we both have a daughter\nShe's doin' fine with the things that we taught her\nYeah I'm just usin' the scientific method\nDid we evolve from electronical boy or homo erectus?\nAnd all of the fossilized footprints in the fossil records\nDon't show a line of thrust, that's not consistent with compression\nWhat the fuck did he just say??\nYeah, okay smartass\nThis is real knowledge, save all that hippie shit for art class\nIt's really startin' to bug me on this one\nGonna have to trust me on this one\nI have done the studies on this one\nYou're a little rusty on this one\nI mean why can't you just answer my question on the subject?\nIt's not in the fuckin' book\nIt's not up for discussion\n\n[Hook: B.o.B]\nScience, I fuckin' love science!\nI fuckin' love science!\nI love science\nLabcoat, check, goggles, check\nNodules, check\nFu-fu-fu-fu-fuckin' science, bro\n\n[Verse 3: B.o.B]\nDamn, must have been a hell of them stegosauruses\nOver a century burnin' fossil fuels, still ain't no shortages\nI ain't sayin' I'm Neo, but I'm nothin' short of a morpheus\nFuck, thought this was a globe, I gotta check my coordinates\nYou can blame my disorderly conduct on my subordinance\nIf it ain't no Coriolis who's to blame for New Orleans?\nWhy the poorest people always get extorted by corporate giants\nWe don't boycott, we buy in and I find it unfortunate, yeah\nMe plus you plus her plus her, that's four (Math!)\nBring your worst and I'm gon' bring much more\nLeave your nerves, your skirt, both at the door\nIn case you didn't know\n\n[Hook: B.o.B + Scientist]\nFuckin' science bro!\nWell Earth shine is much brighter than moonshine\nFu-fuckin' science, bro\nLabcoat, check (moonshine)\nGoggles, check (moonshine)\nNodules, check (moonshine)\nFuckin' (moonshine)\n\n[Verse 4: B.o.B.]\nHow many fingers am I holdin' up?\nCome and compete him if you're bold enough\nNo Bobby Ray don't give an ounce of fuck\nYour team is weak, you beat your bouncer up\n\n[Outro: Teacher + Neil deGrasse Tyson]\nStudent loans await you all! God I hate my life. Hey you! You! Stop making out! I know your mother, Susan! I'm gonna tell Susan about this! Debrah! Is that coke???\n\nI'm Neil deGrasse Tyson, bitch!", "image": "https://images.genius.com/288c59f28a4e9c1559eae1f7558abb79.600x600x1.jpg"}], "artist": "B.o.B"}