{"songs": [{"title": "Take the Pain Away", "album": "Gangsta & Soul", "year": "2009-05-14", "lyrics": "[ScHoolboy Q Talking]\nWassup nigga?\nWhere you bout to go nigga?\nOh yeah? To the store?\nAite here nigga, bring me some Doritos\nYou can't put 50 cent more to it?\nYou know a nigga doing bad, look out for your young nigga one time\n\n[Hook]\nI'm just hoping for a better day\nPrayin' to the Lord, hope to call me up today\nSell dope for a rainy day, but the pigs love to keep the boy afraid\nSo I... smoke to take the pain away\nSo I... smoke to take the pain away\nHell yeah I'm feeling made tonight\nJust got 20 dollars getting blazed tonight, right\n\n[Verse 1]\nI'm just happy just to wake up\nWithout a dime can't put the folgers in the cup\nTried to get a buck, so I hit a little slut\nPhone turned off, can't even hit her up\nA nigga feeling kinda stressed out\nWalk down the block see my nigga stretched out\nCan't even pout, more to reminisce about\nPaying my condolences up at his sister house\nHeading to the laundromat to wash a little clothes\nInstrumental playin' kick a little flows\nSay whats up to my bro's\nWhatup groove, cuz all of that\nAnyway I'm headin' to the drier after that see my supplier\nShit, hopefully a nigga come up on some fire\nBut remember not a dime on me\nTryna get a dime homie\nI swear to God, I ain't lyin' homie\n\n[Hook]\nI'm just hoping for a better day\nPrayin' to the Lord, hope to call me up today\nSell dope for a rainy day, but the pigs love to keep the boy afraid\nSo I... smoke to take the pain away\nSo I... smoke to take the pain away\nHell yeah I'm feeling made tonight\nJust got 20 dollars getting blazed tonight, right\n\n[Verse 2]\nSometimes I wanna call my momma up\nBut every time I call seems she don't give a fuck\nI guess its just the luck, people always leave me stuck\nWanna break down but gotta keep pushin' up\nWhat the fuck a only child can do\nGramds passed away, mom's said go on through\nOnly thing I got is my girl and my dogs\nSwear to god i don't wanna lose it all\nI got homies, I don't think they ridin' to the end\nNiggas fake as fuck lookin' past all they grins\nJust tryna get some ends, hopefully can get a Benz\nAnd I'll do this shit just to keep them niggas in\nI just need a lil bread bro\nTryna pay my momma hopefully get a kiss yo\nThis shit can really make you sick though\nI just wanna go....\n\n[Hook]\nI'm just hoping for a better day\nPrayin' to the Lord, hope to call me up today\nSell dope for a rainy day, but the pigs love to keep the boy afraid\nSo I... smoke to take the pain away\nSo I... smoke to take the pain away\nHell yeah I'm feeling made tonight\nJust got 20 dollars getting blazed tonight, right\n\n[Verse 3]\nI don't see how you niggas do it\nSaying cuz/blood, little nigga sound foolish\nLittle nigga murdered, hangin' out at Fatburger\nAnother tattoo, time to take the beef further\nRan down the block, thought I heard a couple shots\nMade it to the scene, another nigga off the team\nBack to gettin' cream, still relyin' on the fiends\nWish I could take it back to when a nigga had a dream\nBut gangbangin' love to enter nigga's lifes\nSo your life ain't right\nYoung gauge earnin' strips (?)\nStarted puffin drugs then you start sayin cuhz\nDidn't have a choice that's the way shit was\nI swear I need to set it to the side\nBut when I hear Pac make a nigga wanna ride\nI guess I'm a hypocrite, still hangin' with the hypo-crips\n\n[Hook]\nI'm just hoping for a better day\nPrayin' to the Lord, hope to call me up today\nSell dope for a rainy day, but the pigs love to keep the boy afraid\nSo I... smoke to take the pain away\nSo I... smoke to take the pain away\nHell yeah I'm feeling made tonight\nJust got 20 dollars getting blazed tonight, right", "image": "https://images.genius.com/5be8aea8d73e30772a3a8919cc421f1f.500x500x1.jpg"}], "artist": "ScHoolboy Q"}