{"songs": [{"title": "Slap", "album": "Release Therapy", "year": "2006-01-01", "lyrics": "[Hook - 2X]\nI know it's strange\nBut my brain's gone really insane\nAnd I'm off the chain\nSipping on a fifth of the Golden Grain\nI feel like slapping a nigga today (slap slap)\nSlapping a nigga today\nI feel like slapping a nigga today (slap slap)\nSlapping a nigga today\nSlapping a nigga today\n\n[Verse 1]\nThis morning, I woke up on the wrong side of the bed (bed)\nI'm sick of people putting lies in my head (head)\nI don't really wanna work, I'm tired\nI hate my 9 to 5\nAnd I'm thinking bout killing my boss today\nKilling my boss today\nI'm thinking bout killing my boss today (it's just a thought man)\nKilling my boss today (yeah)\n\nYesterday my best friend died (died)\nSomebody came and took his life (life)\nNow I'm looking up at the sky\nHave you ever seen a grown man cry?\nAnd I'm asking why did you take him away?\nWhy did you take him away?\nI'm asking why did you take him away? (why'd you take him?)\nWhy did you take him away? (hey)\n\nI need some money please (please)\nI can barely make it on these streets (these streets)\nCause I got a couple mouths to feed\nMy baby's in dire need\nSo I'm thinking bout robbing a bank today\nRobbing a bank today\nI'm thinking bout robbing a bank today\nRobbing a bank today (real talk)\n\nBaby mama's at home and fussing (fussing)\nCalling up my mobile cussing (cussing)\nAlways yapping about this and that\nBut she really don't be talking bout nothing\nSomebody take my pain away (Take my pain away)\nTake my pain away (please)\nSomebody take my pain away (hey)\nTake my pain away (I can't take it)\n\n[Hook]\n\n[Verse 2]\nSomebody just broke in my ride (ride)\nSnatched up everything inside (inside)\nEven got my 45\nHow am I supposed to survive\nWhen I know that my stereo's taken away?\nStereo's taken away?\nWhen I know that my stereo's taken away? (I need my music, man!)\nStereo's taken away? (hey!)\n\nGas prices are way too high\nRich people are way too fly\nAnd I'm where I wanna be in my life\nBut why am I so behind?\nIs it cause I'm wasting my time away?\nWasting my time away?\nIs it cause I'm wasting my time away? (too lazy)\nWasting my time away? (I can't help it!)\n\nMy grandmama's nerves are bad (bad)\nAnd everybody in the hood is mad (mad)\nCause President Bush could give a damn about our ass\nSo I don't wanna hear shit that he has to say (don't say nothing!)\nShit that he has to say\nI don't wanna hear shit that he has to say\nShit that he has to say (woo!)\n\nTroops gone and we still at war (war)\nNobody even really knows what for (what for)\nEven more I'm scared to find what the world really has in store\nCause you know that tomorrow's not promised today (it's not promised, man)\nTomorrow's not promised today\nCause you know that tomorrow's not promised today (live like today could be your last, man!)\nTomorrow's not promised today (hey!)\n\n[Hook 4X]", "image": "https://images.genius.com/57825a3687491fdf0e3c4c58b1b7aee5.1000x1000x1.jpg"}], "artist": "Ludacris"}