{"songs": [{"title": "Tha Next Episode", "album": null, "year": "1993-11-23", "lyrics": "[Produced by Dr. Dre]\n\n[Verse 1: Snoop Dogg]\nYou thought it was gone, but it's on once again\nLight up the chronic, while I take a couple of sips of the gin\nIs it, is it Dre? (uh huh) If it, if it's you (uh huh)\nBack on track as we roll like a 7-8 coupe\nDe Ville, you chill on the funk 'cause\nGuess what? (What up?)\nWe still loccin' up\nSo those who oppose will get smacked up nicely\nBy the smooth macadamian who's awfully shiesty\nSome thinking that I would switch, but I’m never to ever switch\nStill clockin' the grip and I give a fuck about a bitch, baby\nI gotta have it you see, and so does my diggy-dog\nThe motherfucking Doctor D-R-E\n\n[Verse 2: Dr. Dre + Snoop Dogg]\nI'm still Slauson\nCause I'm the boss and\nSay they flossin'\nCause it’s costin'\nEvery baddest bitch who wants to get broke off\nThats how I do it, get into it\nWith the fluid, and I thought you knew it\nDoing it like this and doing it like that\nAnd, uh, when it comes to gats but I ain't have but no (?)\nWhy try to put up a fight when I can just grab my chrome and put it to your dome?\nOnly make ya day, so before you start a gang\nWould you ask your stank about my bang of the slang\n(The 1-5-1)\nCause that's what you're dealing with\nMy 9 double-m, that's what I kill 'em with\nIf you keep coming at the Doc like he's (crazy)\nFucking with Dre, you’ll be pushing up daisies\nNiggas who talk shit really don't (faze me)\nCause ain't nothing but a 'G' thang (baby)\n\n[Verse 3: Snoop Dogg]\nNow Gs, not BGs, but OGs\n\"What about the women Snoop?\" bitch, please\nI ain't got time to be sucker for a ho\nEven if she giving up dope\nYo ho, no\n(Baby)\nYour love is so out of reach\nYou must've forgot that I was born and raised in Long Beach\nWhere the hoes come a dime a dozen\nYou start fronting on the pussy then I fucked your cousin\nI ain't buzzin'\nI'mma get mine straight up\nI'm still Doggy Dogg\nThrowin' the pussy at a nigga like me\nCause I’m shakin' ‘em, bakin’ ‘em, takin’ ‘em, fakin’ ‘em\nMaking 'em brake they selves, G\nAnd your pooh-butt nigga bet nine trips\nSo you know I got a grip on my shit\nAnd I'll bust a cap if he approaches me\nJust to let him see how a real motherfuckin' G\nCan turn into murderer with just one switch\nDie (?) for your ugly-ass bitch\nNow you're put to rest and there's no coming back\nAs I go about my life just to show you where it's at\nSo get a glimpse of a pimp who kicks back\nIt's still like this and like that (Hell yeah)\nAnd you say that I'm crazy\nBut ain't nuthin' but a 'G' thang baby\n\n[Verse 4: Dr. Dre]\nFor one of forty-four ways\nThe motherfuckin' D-R-E is getting paid\nCause I fade, the shit's made, I lay real shit\nNever let no motherfucker feel shit\nThat's something Dre can never deal with\nI don't want no motherfuckin' bitches on my roster\nCross the road when you know we're gonna cross ya\nYou don't want no problems then\nSo get my motherfuckin' nuts (?) rocks (?)\nSo what's the deal?\nAs I reveal\nThe true feeling that I know you wanna feel\nStill do it like a motherfuckin' nigga for life\nIf you flipping with your bitch then I'll be fucking your wife\nThey call me Dre but also the notorious (?)\nDre G, thats why I'm always holding my gun\nGun days that went months and soul blunts\nThat made it back fat\nOn top of that, they don't know where my stash at\nYo, so business was as usual\nAin't no trippin' because I know you know what I do to you\nThe O-N-E, the A-N-D-R-E\nYou'll never make it to tomorrow\nIf, you come at me like I'm crazy\nTake a look at how the streets straight raised me\nAnd how your whole motherfuckin' city plays me\nCause ain't nothing but a G thang (baby)", "image": "https://images.genius.com/8c99dd335733f9c3cf16f57c9f589cfb.361x361x1.jpg"}], "artist": "Snoop Dogg"}