{"songs": [{"title": "Palace", "album": "LIVE.LOVE.A$AP", "year": "2011-10-31", "lyrics": "[Chorus]\nGoddamn, how real is this?\nI know them Harlem niggas gon' be feeling this\nEast Coast nigga, but how trill is this?\nStill don't give a shit, my ignorance is still a bliss\nGoddamn, how real is this?\nI know them Harlem niggas gon' be feeling this\nEast Coast nigga, but how trill is this?\nStill don't give a shit, my ignorance is still a bliss\n\n[Verse]\nStone cold love, rose gold slugs\nI could afford it, I imported stone cold drugs\nStone cold, rolling stone, I'm a stoned nigga\nWrite it on my tombstone, I was stoned nigga\nDon't remember me as a wannabe New Orleans nigga\nSlash lean sipping, Tennessee nigga, nah\nInfluenced by Houston, hear it in my music\nA trill nigga to the truest, show you how to do this\nMy all gold grills give her cold chills\nSaid she's got a coke feel cause I'm so trill\nTwo dope boy scales, but I sold pills\nNo deal, put her on her feet, toenails\nThem vampires, them bloodsuckers, them thirsty killers\nWe 'bout it 'bout it, we rowdy rowdy, that Percy Miller\nFor really real, we chilly chill, don't sport Chinchilla\nNo bounty hunters, I'm 'bout to killa, I'm bout my skrilla\nGive me the title, then give me the cash\nFold it then bag it then move to the trap\nFollow my stash, stealing my swag\nNiggas is wickity wickity wack\nLike Kriss Kross, her lip gloss\nSlip-ons get slipped off\nMy bitch boss, Cristal\nWe smoking then thinking then burning that hash\nPuff it and pass, making it last\nWalk in my shoes and then cross in my path\nGame was for grabs, making 'em crash\nTook in a section ain't giving it back\nFuck the money, fuck the fame, this is real life\nAn insight to my trill life\nClams\n\n[Chorus 2]\nGoddamn, how real is this?\nI know the whole world gon' be feeling this\nEast Coast nigga, but how trill is this?\nStill, don't give a shit, my ignorance is still a bliss", "image": "https://images.genius.com/5fb9bbbba50174ef41a0dd1f68902363.500x500x1.jpg"}], "artist": "A$AP Rocky"}