{"songs": [{"title": "Raw", "album": "T.I. vs T.I.P.", "year": "2007-07-03", "lyrics": "[Hook]\nYou niggas ain't raw\nI don't buy none a that bullshit you tellin' me\nKing you'll never be, I can see you niggas ain't raw\nHell naw, give a damn who you go and get\nReal niggas know it we can notice that you niggas ain't raw\nEven know now you 'posed to be down with so and so\nStill the same lame from a year ago, I know you ain't raw\nYou ain't graduated with the gladiators, you just practice for the young assassinators\nYou know you ain't raw\n\n[Verse 1]\nFuck that shit you tellin' us\nI know you ain't shit as us\nYou ain't no competitor, that shit there ain't scarin' us\nYou bought ya self a slaughterin' a coffin's what you headed for\nYou ain't wanna die well nigga what you pull a weapon for?\nJust cause we the niggas all of yo ho bitches checkin' for\nAnd ain't nobody real niggas rather hear instead of us\nYou ain't out shinin us, you ain't out sellin' us\nA lot of niggas do it don't nobody do it well as us\nHater wanna flex with us\nLet em get vested up\nHit em with the choppa chest and up, bet I wet cha up\nLet cha partna get cha up, ain't nobody catchin' us\nBut this some shit I'm bound to receive a lethal injection for\nKing of the whole thing, fuck whoever steppin' up\nGive a damn whoever behind him, care about who catchin' up\nLong as I'm alive the second best you have to settle for\nCome on now you really think you betta, bruh\n\n[Hook]\n\n[Verse 2]\nI got 44's glowing on a boat just goin'\nThis bitch, his bitch, and yo bitch blowin'\nYoung pimpin' get dough like his last name Cohen\nMy fan base spread and the shit kept growing\nThat what got me getting head in the vessel\nOf the G4 again hook a hustle up with investors\nNow there he go again\nTwenty million later I guessin' it finally soakin' in\nUnless you just a hater who mad at me cause he broke again\nSellin' all his jewelry considerin' sellin' dope again\nCuz he was ballin' out of control and posed to be focusin'\nWanna be the king by default they hopin' for openin'\nPray they see the day they hear me say I never flow again\nBut au contraire I guarantee one year after another they'll suffer as long as I'm here\nFear no man alive I don't care, you don't run shit nigga be clear\n\n[Hook 2x]", "image": "https://images.genius.com/2f70d0ed3d87a3cc476cfb530ff86686.600x600x1.jpg"}], "artist": "T.I."}