{"songs": [{"title": "To Pimp A Butterfly Medley (The Late Show with Stephen Colbert)", "album": null, "year": "2015-09-09", "lyrics": "[Intro: Kendrick Lamar]\nYou know once upon a time, not long ago\nThere was a caterpillar that lived life slow\nAnd a couple inches he stood\nAnd he said to the butterfly, \"What's good?\"\nAnd the butterfly told him one day he gon' make him rich\nAnd then they said something else\nI don't remember what they said\nBut I think it was something like the lines of:\n\nWesley's Theory:\n[Verse 1: Kendrick Lamar]\nWhen I get signed, homie, I'mma act a fool\nHit the dance floor, strobe lights in the room\nSnatch your little secretary thing for the homies\nBlue-eyed devil with a fat old monkey\nI'mma buy a brand new Caddy on fours\nTrunk the hood up, two times, deuce-four\nPlatinum on everything, platinum on wedding ring\nMarried to the game and a bad thing chose\nWhen I get signed, homie, I'ma buy a strap\nStraight from the CIA, set it on my lap\nTake a few M-16s to the hood\nPass them all out on the block, what's good?\nI'mma put the Compton swap meet by the White House\nRepublican run up, get socked out\nHit the Pres with a Cuban link on my neck\nUneducated, but I got a million-dollar check hold on\n\n[Pre-Hook: Kendrick Lamar & Thundercat]\nWe should've never gave\nWe should've never gave brothers\nMoney go back home, money go back home\nWe should've never gave\nWe should've never gave brothers, money go back home, money go back home\n\nMomma:\n[Verse 2: Kendrick Lamar]\nThis feeling is unmatched\nThis feeling is brought to you by adrenaline and good rap\nBlack Pendleton ball cap\nWe don't share the same synonym, fall back\nBeen in it before internet had new acts\nMimicking radio's nemesis made me wack\nMy innocence limited the experience lacked\nTen of us with no tentative tactic that cracked\nThe mind of a literate writer, but I did it in fact\nYou admitted it once I submitted it wrapped in plastic\nRemember scribbling scratching diligent sentences backwards\nVisiting freestyle cyphers for your reaction\n\n[Interlude: Kendrick Lamar (Anna Wise)]\n(Kendrick Lamar) Oh, what's going on?\n(Something's on my mind) I think something on my mind, too\n(I think it's about that time) I think it's about that time\n(Put a little pimping in my pocket) Hit me!\n\nKing Kunta:\n[Intro 2: Kendrick Lamar]\nI got a bone to pick\nI don't want you monkey-mouth... sitting in my throne again\n(Hold up)\nI'm mad (he mad!), but I ain't stressing, noo\nTrue friends, one question\n\n[Hook: Kendrick Lamar]\nTell me, where you when I was walking?\nNow I run the game, whole world talking, King Kunta\nEverybody wanna cut the legs off him, Kunta\nBlack man taking no losses, oh yeah\nTell me where you when I was walking?\nNow I run the game, whole world talking, King Kunta\nEverybody wanna cut the legs off him\n\n[Verse 3: Kendrick Lamar & (Anna Wise)]\nWhen you got the yams (What's the yams?)\nThe yam is the power that be, be, be, be, be\nYou can smell it when I'm walking down the street\n(Oh yes we can, oh yes we can)\nI can dig rappin'\nBut a rapper with a ghost writer, tell me what happened to you?\n(Oh no!)\nNo, I swore I wouldn't tell\nBut most of y'all sharing bars like you got the bottom bunk in a two man cell (A two man cell?)\nSomething's in the water (Something's in the water)\nAnd if I gotta brown nose for some gold\nThen I'd rather be a bum than a dumb, dumb baller\n\n[Hook: Kendrick Lamar]\nTell me, where were you when I was walking?\nNow I run the game got the whole world talking, King Kunta\nEverybody wanna cut the legs off him, Kunta\nBlack man taking no losses, oh yeah\nTell me where were you when I was walking?\nNow I run the game, whole world talking, King Kunta\nEverybody wanna cut the legs off him\n\n[Verse 4: Kendrick Lamar (Anna Wise)]\nWhen you got the yams... (What's the yams?)\nThe yam brought it out of Richard Pryor, R.I.P.\nManipulated Bill Clinton with desires\n24/7, 365 days times two, I was contemplating getting on stage\nJust to go back to the hood, see my enemy and say\n\n[Hook: Kendrick Lamar]\nTell me, where were you when I was walkin'?\nNow I run the game got the whole world talkin', King Kunta\nEverybody wanna cut the legs off him, Kunta\nBlack man taking no losses, oh yeah\nTell me where were you when I was walkin'?\nNow I run the game, whole world talkin', King Kunta\nEverybody wanna cut the legs off him\nWhen you got the yams... (What's the yams?)\n\n[Verse 5: Kendrick Lamar]\n(You goat-mouth, mammy f-)\nI was gonna kill a couple rappers but they did it to themselves\nEverybody's suicidal, even need my help\nThis is elementary, I'll probably go to jail\nIf I shoot at your identity and bounce to the left\nStuck a flag in my city, everybody's screaming \"Compton!\"\nI should probably run for Mayor when I'm done, to be honest\nAnd I put that on my Mama and my baby boo, too\n(Twenty million walkin' out the court building, woo woo!)\n\nu:\n[Verse 6: Kendrick Lamar]\nAahh, aahh, aahh!\nI place blame on you still, place shame on you still\nFeel like you ain't it, feel like you don't feel\nConfidence in yourself, breaking on marble floors\nWatching anonymous strangers, telling me that I'm yours\nBut you ain't it, I'm convinced your tolerance nothing special\nWhat can I blame you for, I can name several\nSituations, I'll start with your little sister baking\nA baby inside, just a teenager, where your patience?\nWhat was your influence, where was the influence you speak of?\nYou preached in front of 100,000 but never reached her\nI tell you, you damn failure — you ain't no leader!\nI never liked you, forever despise you — I don't need you!\nThe world don't need you, don't let them deceive you\nNumbers lie too, buck your pride too, that's for dedication\nThought money would change you, made you more complacent\nI hate you, I hope you embrace it\nI swear\n\n[Hook 2: Kendrick Lamar]\nLoving you is complicated, loving you is -mplicated\nLoving you is compli-, loving you is complicated\nLoving you is complicated, loving you is complicated\nLoving you is complicated, loving you is complicated\nLoving you is complicated\nLoving you, not loving you, one hundred proof\n\n[Bridge]\n(I can feel your body recognize that you're ashamed of me)\nYou're afraid of me\n(Yes I hate you too)\nYes I\n\n[Outro]\nWhen you look in my eye\nTell me there's more inside\nTell me you're feeling high\nTell me you're here tonight\nTell me you hear my pain\nHear my soul, how you feeling?\nNow you know\nIf you see it, if you would, God\nNow get the gold yeah\nWooh!", "image": "https://images.rapgenius.com/42029bf8702dd713eb808d728b042002.550x309x1.jpg"}], "artist": "Kendrick Lamar"}