{"songs": [{"title": "Hot 97 Freestyle", "album": null, "year": "2009-04-21", "lyrics": "[Verse 1]\nYoung Money till the young boy dyin' out\nYou hear me cryin' out\nYou see me ridin’ out\nAnd if your man get to stuntin’\nWe’ll buy 'em out\nCause we be livin’ what these other rappers lyin' bout\nDrizzy Drake, what\nFunk Flex, uhh\nHot 9-7, I’m so far gone\n\nFeelin' good, feelin' great, how you though?\nBet you hear my name every single place that you go\nSippin’ on pink shit, but nah it ain't Nuvo\nSlow the F down 'fore yo ass is on Pluto\nTell me what it do\nI belong to the youngest Grammy nominated crew\nMy city love me, but I got Toronto haters too\nThat sit around and talk about\nWhat they’d have done if they was you\nBut know I ball without a sphere in sight\nClub owners give me reasons to appear at night\nAnd just know thatIbe in the mirror like\nAre you listenin’? I hope you hearin' right\nI’m in the Aston doin' doughnuts\nI will kill the game and never send it my condolence\nTaught to never love a chick and only love the moments\nNew York City, I can tell the people want it\nUhh, what you got for me flex, uh\n\n[Verse 2]\nVacuum interiors and shined wheels\nWhat's ya life like? This how mine feels\nI like my seat back, I like my wine chill\nI look good, smell better, and I rhyme ill\nI say I’m at these girls neck and head\nYou and your girl sleep in separate beds\nI killed this, tell Flex it's dead\nYou got birthday cake, mines weddin' tall\nY'all lemon small, y'all never ball\nI get the girl of your dreams and I never call\nNY, I got it, I'm bout whatever y'all\nYeah, 40 hears my interviews, tone it down\nI’m at your girls condo gettin' shown around\nYeah, why you takin' everything personal?\nThis that in-ya-face, all-offensive-on-purpose flow\nMy city, never F’n need me\nYeah, oh wait no they really need me\nOh wait, hold up, Young F’n Weezy\nHolla at me when you done F’n Weezy", "image": "https://images.genius.com/e8e4af9d70633a1703ccd3faf671871c.640x640x1.jpg"}], "artist": "Drake"}