{"songs": [{"title": "Deez Nuuuts", "album": null, "year": null, "lyrics": "Let me call this old bitch\nSee what this bitch doin'\nCall this bitch\nRaggedy-ass, shit man\n\nHello? Whassup?\nNothin', whatchu doin?\nNuttin', just kickin it\nAre y'all done?\n\nNah, whatchu gon' do today?\nUmm, pick up my stuff from the cleaners\nMight go get my nails done, seriously\nWhy whassup?\n\nAy did, did, did whats-a-name done\nGet at you yesterday? Who?\nDeeez nuuuts\nAw, shut up nigga\n\nI wanna ask you one question\nIf I had some nuts, hangin' on the walls\nWhat did I have honey?\nI said, \"Darling, you'd have some walnuts\"\n\nShe said, \"Well, daddy, if I had some nuts\nOn my chest, would those be chestnuts?\"\nI said, \"Hell, yes\"\nShe said, \"Well, daddy, if I had nuts under my chin\nWould those be chin-nuts?\"\nI said, \"Hell no, bitch, you'd have a dick in your mouth\"\n\nChiggie check\nMicrophone, check one\n(Chiggie check)\nMicrophone, check two\n(Chiggie check)\nMicrophone, check three\nCheck game from the notorious Compton G\n\nBack with some shit that gots to bump\nAs you pull up in the park, you pops the trunk\nJust to floss it like a motherfuker, clownin' an' shit\nGot the Dana's on your hooptie and your fly-ass bitch\n\nThrow off, go off, show off, I take that hoe\nIf she proper, I'ma pop her, the hole hopper\nIt's back on the track\nWith big money, big nuts and a big fat chronic sack\n\nSo Daz, step up on they ass\nAnd give these motherfuckers a blast from the past\nDiggidy Daz out of the cut with some shit that I wrote\nWith my nigga D-R-E, so you know I must be dope\n\nBut uh, rat-tat-tat-tat that ass\nStartin' static with Dre, make way for the AK\nThat I bring as I slang like cavi\nNot from Kris Kross but they call me Mac Daddy\n\nHad he, not known about the city I'm from Long Beach\nTic tac, grab your gat, watch your back\nHere I come, stompin' in my kahki suit\nB.G. from the hood, kinfolk Eastwood\n\nGoddamn, I ripped up, flipped up and skipped up\nOn top of things as they swing towards my ding-a-ling\nBut could you raise up off his nuts?\n'Cause Dr. Drizze's about to rizzip shit up\n\nChiggie check\nMicrophone, check one\n(Chiggie check)\nMicrophone, check two\n(Chiggie check)\nMicrophone, check three\nYou're tuned to the sounds of the D-R-E\n\nNow check me out, it's back to the old school\nWhere the niggas get they strap on, don't nobody cap on\nSlap on some D-R-E\nOr some funky ass shit by the D-O-double-G-Y D-O-double-G\n\nReal G's who drop ki's\nProtect these, N-U-T's, so nigga please\nPeep out my manuscript\nYou'll see that it's a must I drop gangsta shit, beotch\n\nSo recognize game from the gangsta\nThangs will remain the same until I change 'em\nIt's real easy to see\nSo you can check sounds from Nate D-O-double-G\n\nI can't be faded\nI'm a nigga from the motherfuckin' street\n(I can't be faded)\nI'm a nigga from the motherfuckin' street\n(I can't be faded)\nI'm a nigga from the motherfuckin' street\n(I can't be faded)\nI'm a nigga from the motherfuckin' street\n\nI heard you wanna fuck with Dre\nYou picked the wrong motherfuckin' day\nHere we go, toe to toe, flow for flow\nLet me know if you think you can fade Death Row\n\nI heard you wanna fuck with Dre\nYou picked the wrong, motherfuckin' day\nHere we go, toe to toe, flow for flow\nLet me know if you think you can fade Death Row\n\nI can't be faded\nI'm a nigga from the motherfuckin' street\n(I can't be faded)\nI'm a nigga from the motherfuckin' street", "image": "https://images.genius.com/bf3badae49c33b583126057638078bd8.576x576x1.jpg"}], "artist": "Dr. Dre"}