{"songs": [{"title": "Finesse", "album": "Ether", "year": "2017-05-12", "lyrics": "[Intro]\n30, you a fool for this one\nYeah, yeah, yeah, yeah\n\n[Verse 1]\nI ain't been this fucked up in a while\nDon't know how I made it to the house\nWoke up with two bitches in my house\nTalkin' 'bout they wanna have my child\nShawty, then the next thing (Finesse, finesse)\nShe tried to finesse me (Finesse, finesse)\nSay, say, say she like it rough, she like it wild\nI say who am I to let her down\nNow she running in and out the shower\nAt the same time, running out of towels\nYes, if she can hold a couple thou'\nIf I give it to her, she gon' run her mouth\nShe tried to finesse me, finesse me (Finesse, finesse, finesse, finesse)\n\n[Chorus]\nIf I had a son, would you lie for me?\nIf I had a Honda, would you ride for me?\nIf I ain't make it home, would you cry for me?\nMotherfuckin' liar\nShe tried to finesse me, finesse me (Finesse, finesse)\nSay, say, say she like it rough, she like it wild\nI say who I am to let her down\n\n[Verse 2]\nThe fountain of youth, I think I done found it\nHow you say your name? I can't pronounce it\nFly and a bitch you can go out with\nThey probably gon' ask me to buy them outfits\nShe know the promoters and all the bouncers\nShe's watchin' my money like an accountant\nShe said I'm about to make an announcement\n\"Bob, I think I deserve an allowance\"\nAnd then the next thing\nI woke up in the west wing\nShe say she like it rough, she like it wild\nGhetto bitch, I think she wet the towels\nNow she runnin' in and out the shower\nAt the same time, fuckin' up the couch\nShe wanted me to hit it for a hour\nIf I give it to her, she gon' run her mouth\nShe tried to finesse me, finesse me (Finesse, finesse, finesse, finesse)\n\n[Chorus]\nIf I had a son, would you lie for me?\nIf I had a Honda, would you ride for me?\nIf I ain't make it home, would you cry for me?\nMotherfuckin' liar\nShe tried to finesse me, finesse me (Finesse, finesse)\nSay she like it rough, she like it wild\nI say who am I to let her down\n\n[Outro]\nIf I had a someone, would you lie for me?\nIf I had a Honda, would you ride for me?\nIf I ain't make it home, would you cry for me?\nMotherfuckin' liar\nShe tried to finesse me, finesse me (Finesse, finesse)", "image": "https://images.genius.com/8503048adb15531893faed024074601e.1000x1000x1.jpg"}], "artist": "B.o.B"}