{"songs": [{"title": "Ghost Unit Intro", "album": "Ghost Unit", "year": null, "lyrics": "The following is a DJ Skee presentation\nNu Jerzey Devil\n\n[Kid]\nWho's under there? (it's 50 Cent)\nMom, there's ghosts under my bed!\n(G-Unit, G-Unit, G-Unit, G-Unit, G-Unit, G-Unit, G-Unit...)\nAw, shit nevermind, it's just the Ghost Unit\nFuckin' faggots\n\nThere's somethin' strange in your neighborhood\nWho you gonna call? Ghost Unit\n50, Buck and Banks in your neighborhood\nWhat are they called? Ghost Unit\n\n[Game]\nIt's time to put a end to the bullshit\nWanna scrap with young homie? Jump in the bull pit\nFake ass wanksta, you ain't no crook and\nI got G-Unot all over Queens and Brooklyn\nCompton and Watts, ATL and Chi-town\nAfter 300 Bars your whole crew locked down\nAnd all you gon' do is sing about me\nCause you can't do a motherfuckin' thing about me\n\n[Kid]\n(It's 50 Cent) I ain't afraid of no ghost\n(Young Buck!) I ain't afraid of no ghost\n(Lloyd Banks) I ain't afraid of no ghost\n(Talk of New York, Tony Yayo) I ain't afraid of no ghost\n\nIf you guys are still under there I got the Documentary on my iPod, bitches\nOnly little wiggers listen to that Massacre shit\nMan, no ones scared of you guys, just shut the fuck up\nWhat the fuck is Yayo doing with his hands and shit\nThe motherfucker looks like Castro fabulous\nFake ass Flavor Flav and shit\n\nThere's somethin' strange in your neighborhood\nWho you gonna call? Ghost Unit\n50, Buck and Banks in your neighborhood\nWhat are they called? Ghost Unit\n\nMan, I won this fuckin' G-Unot contest (I ain't afraid of no ghost)\nAnd I got to bring Olivia to my school for show-and-tell (I ain't afraid of no ghost)\nAnd the bitch whipped out her fuckin' dick, man (I ain't afraid of no ghost)\nThat was the hottest fuckin' shit in school history, man (I ain't afraid of no ghost)\nNow I got all these bitches on my dick and shit (I ain't afraid of no ghost)\nEven black chicks man, they love me (I ain't afraid of no ghost)\nAnd Game told me, I'm the only white kid in the world (I ain't afraid of no ghost)\nThat can call you a punk ass nigga! (Game: I approve that) (I ain't afraid of no ghost)\n\n[Game]\n50' punk ass ain't never in the streets\nSo he poked his chest out and signed Mobb Deep\n50 you a bitch, when it's time for beef\nAll he gon' do is hide behind M.O.P\nAnd I can respect that, they just gettin' they cheese\nThey thugs, but what about M-A-dollar sign-E\nEven worse what the fuck you gon' do about me\nPush Yayo back to Christmas Eve", "image": "https://images.genius.com/8024cdd6806066555424f236d22aa443.641x640x1.jpg"}], "artist": "The Game"}