{"songs": [{"title": "Stand Up (Remix)", "album": "Kon the Louis Vuitton Don", "year": null, "lyrics": "[Intro: Kanye West] + (Ludacris) + (*Shawnna*)\nNow, blaze that!\n(Stand up!) (*uh*) (stand up!) (*yeah*)\n(Stand up!) (*uh*) (stand up!) (*uh*)\n\n[Hook: Ludacris & Shawnna]\nWhen I move you move (just like that?)\nWhen I move you move (just like that?)\nWhen I move you move (just like that?)\nHell yeah!, hey DJ bring that back!\n(When I move you move) just like that?\n(When I move you move) just like that?\n(When I move you move) just like that?\n(Hell yeah!, hey DJ bring that back!)\n\n[Verse 1: Ludacris]\nHow you ain't gone fuck?, bitch I'm me\nI'm the goddamn reason you in V.I.P\nCEO, you don't have to see ID\nI'm young, wild, and strapped like Chi-Ali\nBLAOW, we ain't got nothing to worry about\nWhoop ass, let security carry them out\nWatch out for the medallion, my diamonds are reckless\nIt feels like a midget is hanging from my necklace\nI pulled up with a million trucks\nLooking, smelling, feeling like a million bucks, ahh\nPass the bottles, the heat is on\nWe in the huddle all smoking that Cheech & Chong\nWhat's wrong? The club and the moon is full\nAnd I'm looking for a thick, young lady to pull\nOne sure shot way to get them out of them pants\nTake note to the brand new dance\nLike this\n\n[Hook: Ludacris & Shawnna]\nWhen I move you move (just like that?)\nWhen I move you move (just like that?)\nWhen I move you move (just like that?)\nHell yeah!, hey DJ bring that back!\n(When I move you move) just like that?\n(When I move you move) just like that?\n(When I move you move) just like that?\n(Hell yeah!, hey DJ bring that back!)\n\n[Verse 2: Ludacris]\nGo on with your big ass, let me see something\nTell your little friend he can quit mean mugging\nI'm lit and I don't care what no one thinks\nBut where the fuck is the waitress at with my drinks?\nMy people outside and they can't get in\nWe gon' rush the back door & break them in\nThe owner already pissed cause we sort of late\nBut our time and our clothes, got to coordinate\nMost girls looking right, some looking a mess\nThat's why they spilling drinks all over your dress\nBut Louis Vuitton bras all over your breasts\nGot me wanting to put hickeys all over your chest\nAhh, come on we gon' party tonight\nY'all use mouth to mouth bring the party to life\nDon't be scared, show another part of your life\nThe more drinks in your system, the harder the fight\n\n[Hook: Ludacris & Shawnna]\nWhen I move you move (just like that?)\nWhen I move you move (just like that?)\nWhen I move you move (just like that?)\nHell yeah!, hey DJ bring that back!\n(When I move you move) just like that?\n(When I move you move) just like that?\n(When I move you move) just like that?\n(Hell yeah!, hey DJ bring that back!)\n\n[Bridge: Ludacris]\nStand up! stand up!\nStand up! stand up!\n\n[Verse 3: Kanye West]\nNow, uh, me and Luda wasn't good at computers\nSo we dropped out of school cause we tried to fuck the tutor\nHer ex man drove a Mercury Cougar\nI hit him with this maneuver he just couldn't recooper'\nWe got vouchers to stand on these couches\nJames Brown couldn't tell me, \"get down!\"\nWe got foreign cars and houses\nWe got porno stars and spouses\nYou trying to stab one like Jack The Ripper\nTrying to get two like Jack \"The Tripper\"\nMy nigga Tone been locked for a minute\nHe come home from the street he gone want those strippers\nAnd I'm a big tipper I don't even be tripping\nThis my first real Rolex, it don't even be ticking\nThis my first pair of earrings I can wear in the shower\nWithout'em clouding up in a half an hour\nSo that basically mean my paper getting mean\nFour G's in a paper denim jeans\nThe pink rocks red hot like Anthony Kiedis\nYou see these, these is the sweetest Adidas\nWe FIRE, y'all RETIRE\nAll ugly people please!, be quiet!\nHov ain't get a beat from me in a minute\nHe heard \"Just to Get By\" and I was rehired\nI got a track right now that could save my ass\nIt ain't a song it's a video, call Dave Meyers\nY'all drop 20 G's on the Sprewell rims\nI give that money to another to get some real spins\n\n[Hook: Ludacris & Shawnna]\nWhen I move you move (just like that?)\nWhen I move you move (just like that?)\nWhen I move you move (just like that?)\nHell yeah!, hey DJ bring that back!\n(When I move you move) just like that?\n(When I move you move) just like that?\n(When I move you move) just like that?\n(Hell yeah!, hey DJ bring that back!)\n\n[Outro: Ludacris] + (Shawnna)\nStand up! (uh) stand up! (yeah)\nStand up! (uh) stand up! (uh)\nStand up! (just like that?)\nStand up! (just like that?)\nStand up! stand up!", "image": "https://images.genius.com/b7758602aa6883d6e056a8f30703a549.591x591x1.jpg"}], "artist": "Ludacris"}