{"songs": [{"title": "Love Life", "album": "Psycadelik Thoughtz", "year": "2015-08-14", "lyrics": "[Hook: Sevyn Streeter]\nLove the way you're livin' baby, never wanna waste your time\nLove it when you touch my body, makes me wanna give you mine\nIt's so wrong, but it feels so right\nCause I love this feeling, and I love this life\nSaid I love this life, life, yeah\n\n[Verse 1: B.o.B]\nThis is craziness, addicted to the pain of love and hate relationship\nOr can I break a heart or can we argue breakin' shit?\nI guess I take the fault for what my occupation is\nThe more the money come, the more bizarre the day can get\nBizarre the day can get\nIt cost bread to join the game but even more to escape the shit\nI see calculated cowards taking calculated risks\nThis the art or making music or the art of faking shit?\nThis the truth, I give these boys the blues this is proof\nBut it's nothing they can tell me, tt's nothing they can do\nTo take my touch away, take my love away, I play to win\nBackstage, first we say the prayer, then we say amen\nBands!\n\n[Hook: Sevyn Streeter]\nLove the way you're livin' baby, never wanna waste your time\nLove it when you touch my body, makes me wanna give you mine\nIt's so wrong, but it feels so right\nCause I love this feeling, and I love this life\nSaid I love this life, life\nIt's so wrong, but it feels so right\nCause I love this feeling, and I love this life\n\n[Verse 2: B.o.B]\nThis is craziness, this is craziness\nSpending money before I make it, never learn to wait for shit\nTryna pack a stadium, you tryna catch the latest trends\nThe line between the good and bad is paper thin\nGoodness gracious, I might have enemies in high places\nThey surveillance but can't keep up with how my mind races\nHow I'm steppin' on these niggas like I've got my own rep\nNigga be omega, beta salutations to the haters, chuck the deuce\nYou say what's up with me, what's up with you?\nIt's nothing they could tell me, it's nothing they can do\nTo take my touch away, to take my love away, I play to win\nSwagger woodstock status, guess that's why they call me Bands\nBands!\n\n[Hook: Sevyn Streeter]\nLove the way you're livin' baby, never wanna waste your time\nLove it when you touch my body, makes me wanna give you mine\nIt's so wrong, but it feels so right\nCause I love this feeling, and I love this life\nSaid I love this life\nSaid I love this life\nIt's so wrong, but it feels so right\nCause I love this feeling, and I love this life", "image": "https://images.genius.com/281de9284971d81ea2dee5cf7ec294a9.600x600x1.jpg"}], "artist": "B.o.B"}