{"songs": [{"title": "Life Goes On", "album": "All Eyez on Me", "year": "1996-02-13", "lyrics": "[Chorus]\nHow many brothers fell victim to the streets?\nRest in peace, young nigga, there's a heaven for a G\nBe a lie If I told you that I never thought of death\nMy niggas, we the last ones left, but life goes on\nHow many brothers fell victim to the streets?\nRest in peace, young nigga, there's a heaven for a G\nBe a lie If I told you that I never thought of death\nMy niggas, we the last ones left, but life goes on\n\n[Verse 1]\nAs I bail through the empty halls, breath stinkin' in my jaws\nRing, ring, ring — quiet, y'all, incomin' call\nPlus this my homie from high school, he gettin' by\nIt's time to bury another brother, nobody cry\nLife as a baller: alcohol and booty calls\nWe used to do 'em as adolescents, do you recall?\nRaised as G's, loc'ed out, and blazed the weed\nGet on the roof, let's get smoked out, and blaze with me\nTwo in the morning and we still high, assed out\nScreamin', \"Thug 'til I die!\" before I passed out\nBut now that you're gone, I'm in the zone\nThinkin' I don't wanna die all alone, but now you gone\nAnd all I got left are stinkin' memories\nI love them niggas to death, I'm drinkin' Hennessy\nWhile tryin' to make it last\nI drank a fifth for that ass when you passed, 'cause life goes on\n\n[Chorus]\nHow many brothers fell victim to the streets?\nRest in peace, young nigga, there's a heaven for a G\nBe a lie If I told you that I never thought of death\nMy niggas, we the last ones left, but life goes on\nHow many brothers fell victim to the streets?\nRest in peace, young nigga, there's a heaven for a G\nBe a lie If I told you that I never thought of death\nMy niggas, we the last ones left, and life goes on\n\n[Verse 2]\nYeah nigga, I got the word it's hell\nYou blew trial and the judge gave you 25 with an L\nTime to prepare to do fed time, won't see parole\nImagine life as a convict that's gettin' old\nPlus with the drama, we're lookin' out for your baby's mama\nTakin' risks, while keepin' cheap tricks from gettin' on her\nLife in the hood is all good for nobody\nRemember gamin' on dumb hotties at yo' party\nMe and you, no truer two, while schemin' on hits\nAnd gettin' tricks that maybe we can slide into\nBut now you buried — rest, nigga, 'cause I ain't worried\nEyes blurry, sayin' goodbye at the cemetery\nThough memories fade\nI got your name tatted on my arm\nSo we both ball 'til my dyin' days\nBefore I say goodbye\nKato and Mental, rest in peace! Thug 'til I die!\n\n[Chorus]\nHow many brothers fell victim to the streets?\nRest in peace, young nigga, there's a heaven for a G\nBe a lie If I told you that I never thought of death\nMy niggas, we the last ones left, but life goes on\nHow many brothers fell victim to the streets?\nRest in peace, young nigga, there's a heaven for a G\nBe a lie If I told you that I never thought of death\nMy niggas, we the last ones left, 'cause life goes on\n\n[Verse 3]\nBury me smilin' with G's in my pocket\nHave a party at my funeral, let every rapper rock it\nLet the hoes that I used to know\nFrom way befo' kiss me from my head to my toe\nGive me a paper and a pen, so I can write about my life of sin\nA couple bottles of gin, in case I don't get in\nTell all my people I'm a Ridah\nNobody cries when we die, we Outlawz, let me ride\nUntil I get free\nI live my life in the fast lane, got police chasin' me\nTo my niggas from old blocks, from old crews\nNiggas that guided me through back in the old school\nPour out some liquor, have a toast for the homies\nSee, we both gotta die, but you chose to go before me\nAnd brothers miss you while you gone\nYou left your nigga on his own; how long we mourn? Life goes on\n\n[Chorus]\nHow many brothers fell victim to the streets?\nRest in peace, young nigga, there's a heaven for a G\nBe a lie If I told you that I never thought of death\nMy niggas, we the last ones left, but life goes on\nHow many brothers fell victim to the streets?\nRest in peace, young nigga, there's a heaven for a G\nBe a lie If I told you that I never thought of death\nMy niggas, we the last ones left, but life goes on\n\n[Outro]\nLife goes on, homie\nGone on, 'cause they passed away\nNiggas doin' life\nNiggas doin' 50 and 60 years and shit\nI feel you, nigga, trust me, I feel you\nYou know what I mean?\nLast year we poured out liquor for ya\nThis year, nigga, life goes on, we're gonna clock now\nGet money, evade bitches, evade tricks\nGive playa haters plenty of space\nAnd basically just represent for you, baby\nNext time you see your niggas, we gon' be on top, nigga\nYou gon' be like, \"Goddamn, them niggas came up!\"\nThat's right, baby, life goes on\nAnd we up out this bitch\nHey, Kato! Mental!\nY'all niggas make sure it's poppin'\nWhen we get up there, man, don't front\nLife goes on\nHold me no more, hold me no more\nYes it do, yes it do, yes it do", "image": "https://images.rapgenius.com/fa53de0de2303d68c5e191568ce755c9.500x500x1.jpg"}], "artist": "2Pac"}