{"songs": [{"title": "Ghetto Gospel", "album": "Loyal to the Game", "year": "2005-01-25", "lyrics": "[Intro: 2Pac]\nUh, hit 'em with a little ghetto gospel\n\n[Chorus: Elton John]\nThose who wish to follow me\n(My ghetto gospel)\nI welcome with my hands\nAnd the red sun sinks at last\nInto the hills of gold\nAnd peace to this young warrior\nWithout the sound of guns\n\n[Verse 1: 2Pac]\nIf I could recollect before my hood days\nI sit and reminisce, thinkin' of bliss and the good days\nI stop and stare at the younger\nMy heart goes to 'em, they tested with stress that they under\nAnd nowadays things change\nEveryone's ashamed of the youth 'cause the truth look strange\nAnd for me it's reversed\nWe left 'em a world that's cursed, and it hurts\n‘Cause any day they'll push the button\nAnd all good men like Malcolm X or Bobby Hutton died for nothin'\nDon't it make you get teary? The world looks dreary\nWhen you wipe your eyes, see it clearly\nThere's no need for you to fear me\nIf you take your time to hear me\nMaybe you can learn to cheer me\nIt ain't about black or white, ‘cause we human\nI hope we see the light before it's ruined; my ghetto gospel\n\n[Chorus: Elton John]\nThose who wish to follow me\n(Ghetto gospel)\nI welcome with my hands\nAnd the red sun sinks at last\nInto the hills of gold\nAnd peace to this young warrior\nWithout the sound of guns\n\n[Verse 2: 2Pac]\nTell me, do you see that old lady? Ain't it sad?\nLivin' out of bag but she's glad for the little things she has\nAnd over there, there's a lady, crack got her crazy\nGuess who's givin' birth to a baby?\nI don't trip or let it fade me\nFrom out of the fryin' pan we jump into another form of slavery\nEven now I get discouraged\nWonder, if they take it all back, will I still keep the courage?\nI refuse to be a role model\nI set goals, take control, drink out my own bottles\nI make mistakes but learn from every one\nAnd when it's said and done, I bet this brother be a better one\nIf I upset you, don't stress\nNever forget that God isn't finished with me yet\nI feel His hand on my brain\nWhen I write rhymes I go blind and let the Lord do his thang\nBut am I less holy\n'Cause I chose to puff a blunt and drink a beer with my homies?\nBefore we find world peace\nWe gotta find peace and end the war in the streets\nMy ghetto gospel\n\n[Chorus: Elton John]\nThose who wish to follow me\n(Yeah, ghetto gospel)\nI welcome with my hands\nAnd the red sun sinks at last\nInto the hills of gold\nAnd peace to this young warrior\nWithout the sound of guns\n\n[Outro: 2Pac]\nLord, can you hear me speak?\nTo pay the price of bein' hellbound", "image": "https://images.genius.com/bf6913906feb6720f2a43eadaf36aa2d.300x300x1.jpg"}], "artist": "2Pac"}