{"songs": [{"title": "Take Yo Bitch", "album": "Burn After Rolling", "year": "2009-12-13", "lyrics": "[Intro]\n(Cuff yo' chick)\nYeah\n(You are now in tune with your wifey's favorite DJ\nYou ever just know that you was finna splack\nAnother nigga's bitch off\n(DJ Ill Will)\nLike, you see a bitch\nShe be with a nigga\nAnd you be knowin she be thinkin to herself, like\n\"I wish I was with *that* nigga\" hahah yeaah\n(DJ Rockstar)\n\n[Hook: Wiz Khalifa]\nIf you at home letting her go out alone\nThen I'mma take yo bitch\nAnd if she keep jocking me\nStopping me every time she hear my song\nThen I'mma take yo bitch\nSaid she getting tired of fighting\nAnd running around with the same nigga\nAnd plus, she know I ain't no lame nigga\nAnd I ain't pressin her just to see if my numbers in her phone\nBut I'mma take yo bitch\n\n[Verse 1: Wiz Khalifa]\nYeah\nYo bitch like me\nAnd I dont know her\nAll up on me at the shows trynna control her\nYou hatin from afar, she tryna get closer\nMeet me at the bar and tryna be sober, no sir\nSo you come and kick it with my clique\nAnd you nigga somewhere heated screamin thats my bitch\nIm tatted up rich\nThem bitches understand when you makin money talk\nEveryone know you the man\nWith my hollywood hoes somewhere by the sand\nFuckin shit up with yo nigga tryna fit me in your plan\nTell him your a fan\nEven though you were at my crib\nUsed to like my music now he sayin \"fuck young wiz\"\nThats how I live, and I won't change for the world\nMake your man feel like he gone need a chain for your girl\nSays she been searching around for some change in the world\nI'm doin shit that you not, so I'm lookin like Barack to her\n\n[Hook]\n\n[Verse 2: Neako]\nJerz, Wizzle, Neako\nTell you a story\nI see you stressing my nigga\nNow tell me what is going on?\nSomebody took your bitch?\nI guess you wanna grab the ratchet\nGo hit his hood\nAnd do him wrong\nAll over your chick\nLook at Lil Reak baby bro nope\nHe ain't comin' home\nBecause the nigga straight flipped\nA nigga hit his bitch\nReak tripped\nThen he hit him in his dome\nHe got a life sentence\nYou might wanna think about what you're doin'\nBefore you do it wrong\nWhen you shoot don't miss\nCause if you do niggas'll catch you\nAnd baby bro they wrong\nIf they put you in the ditch\nI'mma tell you like this\nLife is priceless\nBecause you took a shot don't mean it gon' miss\nYou never knew another nigga slid your wife the dick\nAnd now you sitting back with a chick\nLike this\nLike this, ay\n\n[Hook]\n\n[Verse 3: Young Jerz]\nI could do my thang If I wanna\nForecast change I make it rain in the summer\nLet the chain hang\nScoop ya dame for the fun of\nIt baby you be with a lame that's a bummer\nShit I'll be somewhere where the planes like to hover\nI be up there I can't hang with the others\nBaby be my lover\nI could be your anything\nYou can be my lady friend\nBut you gon' need some Henny\nYeah, to get up with a brotha\nNah, cause ain't no one cooler than me\nWhen I moved them ludies with me\nThrow your dude up in a frenzy\nAh, nea neak and wizzy\nHata don't be mad man we get busy\nYes we are the princes of our city\nYour chick get with me\nHah so if for any reason you forget, forfeit\nAnd call me Mr. I'll Take Your Chick\nHaha, nah, call me Mr. Upgrade, or Mr. Front Page\nCall me Mr. Fast Lane - no front brakes\nCause she gone\nShe outta here mane\nFrom Jersey to the Burgh\nNeako\nYoung Jerz\nWiz Khalifa\nYeah", "image": "https://images.genius.com/1e8831442ad841a375254e84828c989e.320x320x1.jpg"}], "artist": "Wiz Khalifa"}