{"songs": [{"title": "D.O.A.", "album": "No Ceilings", "year": "2009-10-31", "lyrics": "[Verse 1]\nFiji water, grandaddy purp\nExcuse me, I let the semi-automatic burp\nBlood gang mothafucka, call me Red Alert\nYoung Carter kill in order, who get it first\nStuff that girl with dick 'til her head burst\nYoung Weezle flow needles, I can thread shirts\nBoy you ain’t did shit, I done said worse\nFlip your fitted cap back like Fred Durst\nFiji water, OG kush\nYeah, I drink verses and eat hooks\nGot the stove on my waist, and we cooks\nI'm in the way, you can’t pass, like Aaron Brooks\nPresident, ride the car slow\nI let my driver drive, I'm on par 4\nSpit hanging from my mouth, retard flow\nAnd I say what I won like an award show\nI'm on some shit ain’t even came out the ass yet\nSit back and watch the green grow like the grass wet\nYoung or old, there ain’t no comparin' me\nI just cleared that up, moment of clarity\n\n[Verse 2]\nI'm about to go almonds\nYoung head buster, get your helmets\nYou niggas real soft, what is that, velvet?\nI get big chips, you get Alvins\nI'm about to go walnuts\nWe get 7-digit money, you could call us\nHit 'em with the chopper, watch 'em ball up\nPaint your face red, you all dolled up\nYeah, Young Nino, nigga\nDo it for my team, Tim Tebow, nigga\nI'm killin' this shit, Grim Reap' flow, nigga\nGettin' swallowed by the Maybach, deep throat, nigga!\nI'm about to go Planters\nI’m still in my prime, Deion Sanders\nWe all gamblers, I will not lose\nFlow precious as diamonds, I drop jewels\nGive me mine or I'mma take mine\nSmoking purple, I heard it through the grape vine\nWeezy Baby, AKA Your Highness\nI just killed this shit, moment of silence\n\n[Interlude]\nBut I ain't finished, uh-uh\nNo Ceilings motherfucker! Yeah\n\n[Verse 3]\nI'm in the zone like a fastball\nAnd I fuck the game up like a bad call\nLet the money stack, don’t let the cash fall\nBars all day, no last call\nI'm in the Red Zone nigga\nWake up in the morning with your head gone nigga\nBirdman Jr., wings spread on niggas\nLeave the beef in the streets and bring the bread home nigga\nYeah, tell the doctor \"Step aside, please\"\nDr. Carter got some lean in your IVs\nStrong dry weed, make my eyes bleed\nStrong arm rap, I rock an iron sleeve\nI'm in the zone like the secondary\nNo lie bitch I’m flyer than a pet canary\nI’m a dog on the beat, fuck the veterinary\nTwo women praise me like Mary Mary\nI'm in the zone like college ball\nSpit fire like I’m sipping on a Molotov\nLoose bowels, this shit is so easy\n(I might send this to The Mixtape Weezy)", "image": "https://images.genius.com/4a183c010cf184b2a9fecdfcb8e16142.320x320x1.jpg"}], "artist": "Lil Wayne"}