{"songs": [{"title": "Crime & Medicine", "album": "True Magic", "year": "2006-12-29", "lyrics": "[Talking]\nIt was so beautiful. It was almost unfair\nIt's cold but it's true. It was so cold it got warm\nKids out in the schoolyard and playing\nIt was nice and calm. It was dangerous\n\n[Hook]\nWhen the MC's came, live out the name and to perform\nSome had to snort cocaine to act insane before Pete Rocked it on\nNow on to the mental plane, spark the brains with the building to be born\nCrazy is on the track\nCheck em check chicka icka etta UHH\n\n[Verse 1]\nStrange Times\nEverybody got their get high (Oh my)\nTheir get right, their get nice, they get by (Oh my)\nThey get open, get ready, get primed\nThe national pastime is victimless crime\nYou want your thrill and I want mine\nAs long we can get it we ain't got to say why\nI don't mean to pry, you ain't got to lie\nWe ain't got to speak when it's written in the eyes\nWhenever she was high off the sparkle in her palm\nShe had a young girl's smile and a hustler's charm\nDying from the city where the hustler's are born\nMade, traced, murdered, replaced\nLife-long residents barely feel safe\nAnd the street's offer plenty taste and little faith (Break it down)\nLittle face, soft lips, little waist (Break it more)\nTiny hands (Oh god) fat ass (Oh more)\nBig eyes like birthday surprise\nSuper dupa fly, born in 85\nRepeat it to yourself: This is a victimless crime\nPsyche your mind there's a victim every time\nYour tasty little pill, your freaky little thrill\nPray won't leave you still, you wonder how it feel\nIt's real, pussy like some money that you steal\nEww\n\n[Hook]\n\n[Verse 2]\nCrime and medicine\nDead wrong and live in America\nOff the block and right in your area\nFresh apples and peaches for the president\nHA HA\nCrime and medicine\nDead wrong and live in your area\nFrom the street corner, right in your residence\nFresh apples and peaches for the president\nCrime\nFresh peaches and apples for the president\nCrime\nFresh chocolates and apples for the president\nCrime\nFresh linens and apples to the president\nCrime\nFresh", "image": "https://images.genius.com/50acba8e30cec066c838d6f22dd475e3.500x500x1.jpg"}], "artist": "Yasiin Bey"}