{"songs": [{"title": "Yeah Ya Can", "album": "Misery Loves Kompany", "year": "2007-07-17", "lyrics": "[Intro: Krizz Kaliko]\nYeah, you can\nYeah, you can\nWill you go with me, don't leave me lonely?\nWill you go with me, don't leave me lonely?\n\n[Hook: Krizz Kaliko]\nWould you go with me, baby\nIf I tell you I can do you good tonight, say\nYeah, you can?\nCan we get lost mama if I promise\nI can break you off tonight, say\nYeah, you can?\nWould you go with me, baby\nIf I tell you that I'll do you good tonight, say\nYeah, you can?\nCan we get lost mama if I promise\nI can break you off tonight, say\nYeah, you can?\n\n[Verse 1: Tech N9ne]\nCan I holla atcha, yo holla holla?\nCan I holla, holla you liking the way\nI throw these dollas at you?\nThey say your kitty cat\nIs one hell of a dog catcher\nCan I take to my kennel and make it all better?\nCan I get you in the parking lot, I mean?\nCan I get you out the parking lot\nThen we can bend the corner and find a darker spot\nBaby can I let the seat back, so I can bark a lot?\nYeah, you can\nI see why you at the silver slipper\nCause that ass fat, baby, pass that\nLet me smash that, want me jizzum\nBut I holds 'em back, them courtesy of my player partner\nTrojan Magnum, think you pimping your broads\nYou'll be hold like tagnum first night like I'm mad\nI don't know these hoes from Adam\nDeep as I'm deep down diamond Joes, I jabbed 'em\nCan I come back again and repeat this with you madam?\n\n[Hook: Krizz Kaliko]\nWould you go with me, baby\nIf I tell you I can do you good tonight, say\nYeah, you can?\nCan we get lost mama if I promise\nI can break you off tonight, say\nYeah, you can?\nWould you go with me, baby\nIf I tell you I can do you good tonight, say\nYeah, you can?\nCan we get lost mama if I promise\nI can break you off tonight, say\nYeah, you can?\n\n[Verse 2: Shadow]\nCan I tell you a secret before you get to answer?\nShadow done already peeped it\nIt's the freak with reason, the ladies wet in they bed\nAnd she'll probably get orgasmic just from giving me head\nCan I bring a couple of my closest friends, get a telly\nPlay some music prolly, throw you some mens?\nOh, you wanna keep me all to myself\nYou wanna cum a couple times well mami, can I offer some help?\nCan I see the way your body look from the back\nShe shook form the fact that my tongue motions did it like that\nHad her walking like she had a camel hump on her back\nAnd since they say we only mammals I'm the king of the cat\nAnd as long as your ass is fat can I give it a smack\nAnd record the whole thing and play it on track\nIf you telling me you good with that\nI'mma handle some things but is it cool\nIf I come right back?\n\n[Hook: Krizz Kaliko]\nWould you go with me, baby\nIf I tell you that I'll do you good tonight, say\nYeah, you can?\nCan we get lost mama if I promise\nThat I'll do you good tonight, say\nYeah, you can?\nWould you go with me, baby\nIf I tell you that I'll do you good tonight, say\nYeah, you can?\nCan we get lost mama if I promise\nI can do you good tonight, say\nYeah, you can?\n\n[Verse 3: Krizz Kaliko]\nI know you heard of me baby\nI'm one they talk about\nThey call me Kali Baby\nSay it while we walking out\nAnd next let's hit the exit, go get naked\nDo them things you know will get you pregnant\nOr can it be just a fantasy planned to have you panicking\nIt's your pantin' that's bringing out the man in me\nAnd I'll be gentle at first\nAnd then frantically I'ma damaged the back-a-you\nAttacking where your pants be\nAnd I just want to love you now\nCan you tell me how I get you home tonight?\nBaby let me turn you 'round, look you up and down\nLet me see every part I like\nAnd maybe it's the drink making you look better\nOr maybe it's my voice making you get wetter\nIf you like me like I like you girl\nDon't hesitate, don't make me wait, tell me\n\n[Hook: Krizz Kaliko]\nWould you go with me, baby\nIf I tell you I can do you good tonight, say\nYeah, you can?\nCan we get lost mama if I promise\nI can break you off tonight, say\nYeah, you can?\nWould you go with me, baby\nIf I tell you I can do you good tonight, say\nYeah, you can?\nCan we get lost mama if I promise\nI can break you off tonight, say\nYeah, you can?", "image": "https://images.genius.com/d568b86ce102e78c9c49f201c1a48234.953x953x1.jpg"}], "artist": "Tech N9ne"}