{"songs": [{"title": "O.C.B.", "album": "B4.DA.$$", "year": "2015-01-20", "lyrics": "[Hook]\nThese are the only-child blues\nThe only-child blues\nThe only-child who? Yo, yo, yo\n\n[Verse 1]\nBack once again, hello it's yo' favorite mellow schizo\nThe pavement on this yellow brick road fuckin' up my mental\nMy mood just like the tempo\nHeartbeat, that instrumental\nI never lack potential, every track is essential\nEvery project is special, abundant and fundamental\nGive a fuck about hundreds as long as it's for my mental\nWith wisdom from what I've been through\nKnowledge that some can't get to\nUnderstanding that college is only out for a nickel\nWe could all be so simple, tune it to the metronome\nThis how I used to feel back on the metro home\nFresh outta class I knew these days, they wouldn't last\nJust a stepping stone I gotta pass, another story for the lap\nBut fuck it, give him glory when he crash\nHe gettin' revved up, heads up and he's coming fast\nHe paved the lane before the cash\nThey tryna swerve me out of that\nBut I don't just got speed, nigga, I handle my ass\nPedal to the gas, life is but a getaway dash\nMy mama stash guarded by my pen and pad\nI'm drawin' weapons with the raps\nYou shoot, I shoot back—no questions asked\nRaise your hands for the realest cat alive\n(Cat alive, cat alive, cat alive, cat alive...)\n\n[Hook: Joey Bada$$ + crowd-goer]\n(That's that boy, right there—that's Joey Bad'!)\nThe only-child blues (Joey for the money, man—yo, Joey, man!)\nThe only-child who? Yo (Yo, Joey!)\n\n[Verse 2]\nAnd I remember sittin' in my room all alone\nStaring at my ceiling fan, getting in my zone\nMama was never home\nWoke up one morning, papa was gone\nYoung and lost so I ease my mind to popular songs\nAnd of course I sold my mind to music\nWriting everything I thought\nStarted openin' my mind, then I send it abroad\nThey don't know what my ascending has caused\nMy third eye been blinking since\nIrv Gotti been inking murderous thoughts\nAt least that's how Irv gotta be thinking\nIf I'm takin' a loss and I'm better next week\nAnd I'm never weaker\nNever sinking on the fucking deep end\nAny shit I missed I prolly peeped it\n\n[Hook: Joey Bada$$ + Joey's mother]\n(Like you know, it's fast living)\nThese are the only-child blues (It's not necessarily living)\nThe only-child who?\n(You can also speak on the facts that, hey, you're a teenager)\nThe only-child blues\n(How me and you, we go back and forth with it all the time)\n(Like, you know) What, the only-child blues\nThese are the only-child who?\nThe only-child blues\n\n[Bridge]\nYo, only-child blues, OCB, OCB\nJo-Vaughn clean your room, OCD, OCD\nI used to wanna be like ODB, ODB\nNow I'm a rap star, OMG, OMG\nOnly child-blues, OCB, OCB\nYo Jo-Vaughn clean your room, OCD, OCD\nI used to wanna be like ODB, ODB\nNow I'm a rap star, OMG, OMG, what\n\n[Outro: Joey's mother]\nEverything is perception\nYour perception of yourself or who you are is not what other people think that you are\nSo like for instance, you might say \"I'm cool, I don't wear jewelry, I don't this, I don't that\"\nYou don't have to, to, to,", "image": "https://images.genius.com/314e5f2acb3d276d4b374900e64b4c42.1000x1000x1.jpg"}], "artist": "Joey Bada$$"}