{"songs": [{"title": "Poisonous Darts", "album": "Ironman", "year": "1996-10-29", "lyrics": "[Intro: sample, Ghostface Killah]\nLet's see you try the water technique! Hai! Ha, ha!\nThe sky is high, the cloud is low, yeah, word up\nBut my water technique is hard to beat\nBut the earth, can absorb water, hai! Hai! gotta zip my coat\nThe sky is high, the cloud is low fuck him\nBut my water technique is hard to beat yeah, check the live shit\nBut the earth, can absorb water, hai! Hai!\"uhh\n\n[Verse 1]\nSo what the fuck I got to lose ha? Word to God let's get it on\nClap your heels three times, grab the magic wand\nNameless, these stonewashed cats, leave 'em brainless\nSomewhere out of this world, stranded on Uranus\nWith coke and a dollar bill, stems and crack capsules\nTake a blast boo, booby trap a cruise it's natural\nLike soybean, burn like a laser beam\nMy vaccine, I shoot it firm and it connects like sideburns\nThe segment, rap fragment comes together like magnets\nAttract heads captured like Dragnet\nGoing through mad phases, of all ages\nKilla Beez locked the fuck up behind cages\nThe Genovese swallow this line and caught a freeze\nPress caller ID for me to quote more degrees\nThe fortune teller tuck a sleeping gas umbrella\nAward winning dining in the back of Armanbella\nNow who, don't believe that cash must rule\nI don't eat meat, I slap blood out of Perdue\nKeep a wireless mic, mics on strike the session\nIs over, I file this and glow like fluorescent\n\nPeace to y'all, let's get our rhyme on\nYeah peace to y'all, let's get our rhyme on\n\n[Verse 2]\nYo yo, mountains of blow like snow constant cash flow\nRocking a Shaft afro, Tony got mad glow with hoes\nMega powder dripping from they nose\nFucking Jet magazine bitches with wide pussy pose\nCentrefold the whole night, deadly venom horror snake bites\nOnly Built 4 Cuban Link kings who shoot dice\nHolding money bags, convertible Benz with feathered bags\nWith the mongoose your man's got two seeds down in Baghdad\nYou onionhead niggas spread out and parley\nYo, Rae these ick days get crashed with ash trays\nI pull stings like, guitar strings down in Spain\nI'm so hyped Jakes label God \"crack cocaine\"\nY Equality Self God, yeah yeah you know it kid\nRicky fucked up a G-Pack, blow his wig\nHe's rocking Wu Wear, the latest in fleece uniform\nHe's a newborn, look at money swearing like he on\nBut anyway back to furry Kangols, Jamaican Wallabies\nMy back is on the wall, bombing devils with tricknology\nMy heart is cold like Russia, got jerked at The Source awards\nNext year two hundred niggas coming with swords!", "image": "https://images.genius.com/86aaa4a25c81fd34a671c2db7083cc80.800x800x1.jpg"}], "artist": "Ghostface Killah"}