{"songs": [{"title": "Drama", "album": "Digi Snacks", "year": "2008-06-24", "lyrics": "[Intro: RZA]\nI wanna dedicate this song to the young god, Kareem\nThe Genius... Digi...\nSay it to 'em roof angel\n\n[Hook: Thea]\nLearn to keep my head up to the sky\nAnd ask myself why, it has to be this way\nI'd like to live my life in peace\nAnd health, not to worry about\nAll the dramas of the day\n\nAs we strive for luxury\nAnd try to feed our families\nIt always seems that someone's in your way\nI'd like to live my life in peace\nAnd health, not to worry about\nAll the dramas of the day\n\n[RZA] (Monk)\nI met a young brother, about 28\nWho seemed intelligent and rather quite straight\n\nI greeted him, and struck up conversation\nTo see if the youngster had some self motivation\n\nPeace brother, whats your name? How you be?\n(I'm Rugged Monk and I'm all about the currency)\n\n[Monk] (RZA)\n(You mean gettin' paid?)\n\nYeah like my man's brother\nWho has a condo, he shares with his baby mother\n\nYou know a condo beats my apartment\nWith no lights, no gas and backed up rent\n\nNo hot water or heat, infested with plenty rats\nThat'll eat up the average alley cat\n\n(I'm like damn, homey, thats poverty)\n(He's like) Word O.G. that bothers me\n\nPlus I'm about to be a new father, G\n(We need to wise up and change the hood policy)\n\n[Hook]\n\n[RZA] (Monk) {both}\nYo, why you fear the devil, as a grown man?\nWhy you not out there trying to make your own plan?\n\nSee we are a victim, of a situation\nWhere a wicked man, separated the nation\n\nAnd got us killin' off one another\nBlack on black, they pit brother on brother\n\nIt's gettin' hot, hotter than July\nSee the murder and crime rate is risin' to the sky\n\n(For example, in my neighborhood it's so hot\nI'm often woke up, from the alarming sounding of a shot)\n\n(So I'm thinking what), Is your neighborhood a trap?\n{Could this be the place marked X on the map?}\n\n(And I'm spotted like a target in a shooting gallery\nSo I strive to seek for a better salary\n\nSo I can escape from where? From this ghetto life area\n{Cuz everyday it gets scarier}\n\n[Hook]", "image": "https://images.genius.com/6aad59336cc99fabe2197eafab36fc0e.500x511x1.jpg"}], "artist": "RZA"}