{"songs": [{"title": "When I Get Free III", "album": "R U Still Down? (Remember Me)", "year": "1997-11-25", "lyrics": "[Skit]\n-[Prison Gaurd:] Inmate 'Pac, C57797, you got a visitor\nRight there, star three\n-[Girl:] Hi baby\n-[Prisoner:] What's up honey?\n-[Girl:] Hey you know it's just only one more week until family visit\n-[Prisoner:] Yeah I'ma rock them drawers. Yeah but you did you take care of that business I asked you to do?\n-[Girl:] I made those deposits\n-[Prisoner:] Okay that's cool you bring that shit?\n-[Girl:] Yeah I got it\n-[Prisoner:] Alright see that guard over there?\n-[Girl:] Mmm-hmm\n-[Prisoner:] When you get done just hand him the shit, he know whassup\n-[Girl:] Alright, hey you know E just got cracked, he's in jail now\n-[Prisoner:] What?\n-[Girl:] Yeah, Go-Go's out. I just saw him running around the other day\n-[Prisoner:] Ahh, fuck that fool. But anyway, what's happening with my moms?\n-[Girl:] She gave me a message for  you. She said she's sorry she couldn't be here today, but she'll be here next week\n-[Prisoner:] Alright well check this out, I got something real important I want you to tell her\n-[Guard:] C'mon c'mon this shit's over with\n[commotion breaks out:]\n-[Guard:] C'mon boy, back to your cell\n-[Girl:] I'm not done talking to him\n-[Guard:] Shut that shit up bitch! He's outta here, c'mon\n-[Prisoner:] Don't be calling my woman no bitch! Nigga I'll fuck you up!\n-[Guard:] Yeah yeah fool, what?\n-[Prisoner:] Let me out these chains....with your broke ass sucka\n-[Guard:] Yeah yeah, that's what they all say fool\n-[Prisoner:] Yeah what! Let me out then\n-[Guard:] Institutionalized, and this is your home...\n\n[Verse]\nGuess who's back, and ready to knock off a cop or two\nCause me and the crew could still get our rocks off\nThe Penitentiary don't stop a nigga cause he's in jail\nHell I'm makin' more money on the street from here in a cell\nI'm livin' proper, the coppers is havin' fits\nI just made the profit, you punks ain't stoppin' shit\nI still remember my momma told me\nFind the cop who killed your brother\nSend him to Hell lookin' homely\n'Cause a real nigga love the law\nWhat's raw is a nigga that's above the law\nKeep pressin' your luck and get fucked, huh\nThink a nigga don't know what's up 'cause he's locked up\nBut in the meantime, it's get swole get clean time\nConcentrate on gettin' green time\nAnd as the years go by, they forgot\nAbout the small time soldier from the block, huh\nTo kill the crook they threw the book at me\nDon't worry be nappy, don't even look happy\nPut me in the hole, gave me cold cuts\nDid push-ups until I swole up\nAnd then they offer me a furlough\nBut what they don't know as soon as I get free I'm killin' five mo'\nThey asked me if I changed much\nI told 'em 'Yeah' even though I'm still the same nut\nThey started askin' me questions about my brother\nAnd makin' remarks about my mother, hmm\nWait a minute, hold up\nMakin' jokes about my folks'll get yours blown up\nThey sent me back to the hole for what I told 'em\nI guess he didn't believe me, so I showed him\nHe went home to find a tragedy\nNigga, that's what you get for tryin' to badger me\nAnd anybody else that wanna sweat me\nI'm already in jail so you punks can't get me\nYou better pray they never see me\n'Cause if they let me free, prepare for trouble on the streets\n\n[Chorus]\nWhen I get free, huh\nWhen I get free, huh\nWhen I get free\nWhen I get free, huh\nWhen I get free, huh\nWhen I get free\nWhen I get free", "image": "https://images.genius.com/4f924e981b74c6d754d2c9da26f83f15.500x500x1.png"}], "artist": "2Pac"}