{"songs": [{"title": "Don’t Like", "album": null, "year": null, "lyrics": "[Intro]\nFirst of all shout and respect to ?\nShout and respect to Lupe Fiasco\nShout out to Mr. West\nShout out to Rasheed Lonnie Lynn\nKing Louie, L.E.P Bogus\nWhole Chicago movement\nReal Recognize Real\n\n[Verse 1]\nWhite supremacy is what I don't like\nSucka ass crackas, what I don't like\nThe Bank of America, what I don't like\nWhen they mention cynicism, I don't like\nI don't like, I don't like\nThe way the ghetto living, I don't like\nGot us trapped up in the system, I don't like\nAin't to different from a prison jacket, ain't right\nAin't no freedom in the trap, hustlers everywhere\nYou can feel it in the air, pure despair\nHungry hands only take when they reaching out\nCampaign slogan, geek up, gun Pow\nUgly politicians, new election year\nCon'd by their care, they are not sincere\nIts the greedy and the rich ones that make war\nThat the hungry young and poor once payed for\nLittle homie stretched out in a coffin\nThey die younger and they dying more often\nThe rent to high, the wage too low\nTop 5 stupid songs up on your radio\n\nI don't like\nAll this cackling and caring on I don't like\nAll this suckerness and scared shit I don't like\nAll these African Americans it ain't right\n\nAnd that goes for crazy ass crackers\nSmall claim court clowns and strip club rappers\nOut in broad day with they nipples out\nWith they stretch marks, back hairs and pimples out (yuck)\nYou suck, go away\nYou always talking but and ya never got much to say (yuck)\nYou suck, go away\nYou always caught in space, fix your thirsty face\n\nThe way these jokers look and sound I don't like\nThe way I see them getting down, I don't like\nMake me wonder how they get around it ain't right\n\nIn the land where crooks get the Riker laws\nBut people hide their eyes, and shut their jaws\nWho the realest? never mind\nWho the winner for the best arranged lies?\nWhat they wearing? who is there?\nAsk yourself, why you care?\nSomebody going ham on a gossip cite\nCatching feelings over rumors that are not your life\nAnd I don't like, sometimes I even hate\nBut not the people, they ?? Race\nI don't like, sometimes I even hate\nLord forgive us, let us pray!\nFor pussy posers, dummy creed\nPolluted seeds, them wacky weaves\nNazi polites, waste of time\nCuz I ain't be recruitment, waste of time\n\nI don't like, and you don't neither\nWe forgive and pray for these Fake niggas", "image": "https://images.genius.com/4d1a9757d430776710118a3e0ba4658f.1000x667x1.jpg"}], "artist": "Yasiin Bey"}