{"songs": [{"title": "The Sexorcist (Infomercial)", "album": "Killer", "year": "2008-07-01", "lyrics": "And now a word from our sponsor\n\n[Intro: *Girl Voice*]\nDo you have a problem bringing the freak out of your girl?\nIs sex with her so boring that you think of other women during?\nWell, all your bedroom problems can be solved\nWith the new freak extraction technique\nJust call area code 668-884-6993 to order the freak extraction technique\nAll procedures performed by the sexorcist\n\n[Chorus: Krizz Kaliko]\nCan I suck your tongue?\nI can hardly wait... to taste you\nCan I suck your tongue?\nPlease don't make me wait... to recreate you\nCan I suck your tongue?\nLet me be the one... to please ya, I need your tongue\nThe sexorcism's done... baby don't turn me away\nI want to taste your... tongue, tongue, tongue\nTongue, tongue, tongue\nTongue, tongue, tongue\nTongue, tongue, tongue\n\n[Verse 1: Krizz Kaliko]\nCome close to me\nCan I touch you there?\nYou're right here, where you're supposed to be\nAnd hopefully\nWe can spend the night\nAnd give me what you owe to me\nBeen eying you for quite a while and now I want some\nGo down on you, but now I think it's time you owe me one\nThings we can do baby, I know we'll have a lot of fun\nNow that were close, I wanna taste your tongue, tongue, tongue\n\n[Verse 2: Tech N9ne]\nI'm here to get it up out ya\nThe sexorcist, that bring that freak out when I mouth to mouth ya\nAnd yes, it will arouse ya\nI feelin' a bit of nostalgia\n'Cause I'm thinkin' about about my past procedures\nEnding up out of my trousers\nStick your tongue (what) stick your tongue out\nI guarantee\nThe minute you let me baby girl, you'll be strung out\nI promise your panties will need to be hung out\nBut first\nBefore I begin this freak extraction technique\nSpit your gum out\nAnd let me show you how I can do that cleezy\nIt's so easy, how I get beezy's to appease me\nThrow in a ice breaker\nThen let my eyes face her\nThen wrap my lips around her tongue and walah!, I taste her\nOn your ecstasy trip\nYou wanna get next to these lips\nYou wanna continue on, it's best to be stripped\nAnd don't you worry, I'm a master\nFor this you won't need no pastor\nBefore I begin there's somethin' I have to ask ya...\n\n[Chorus: Krizz Kaliko]\nCan I suck your tongue?\nI can hardly wait... to taste you\nCan I suck your tongue?\nPlease don't make me wait... to recreate you\nCan I suck your tongue?\nLet me be the one... to please ya, I need your tongue\nThe sexorcism's done... baby don't turn me away\nI want to taste your... tongue, tongue, tongue\nTongue, tongue, tongue\nTongue, tongue, tongue\nTongue, tongue, tongue\n\n[*Girl Voice*]\nMmmmmmmmmm... the sexorcist, satisfaction guaranteed\nCall now at 668-884-6993 for the freak extraction technique\n\n[Outro: Krizz Kaliko]\nFreak extraction technique, performed only by sexorcist\nDo not try this at home or at least without the sexorcist\nExtraction may result in salivating, throdden loins\nAnd uncontrollable urge to say the number n9ne\nAnd women attempting to go ass to mouth\nUse only as directed, Big Krizz Kaliko now included", "image": "https://images.genius.com/ce6124bde0d76994fd0d3a8ddb1d4e97.1000x994x1.jpg"}], "artist": "Tech N9ne"}