{"songs": [{"title": "The Believer (Remix)", "album": "The Dreamer/The Believer", "year": "2011-12-20", "lyrics": "[Hook: John Legend]\nI believe in the light that shines and will never die\nOh I believe the fire burns, we stay alive\nThey will talk about us\nLike they talked about the kings before us\nThey will talk about us\n\n[Verse 1: Common]\nThese are the words of a believer\nAchiever, leader of the globe\nFeeding souls of those in need\nI bleed the blood of the struggle\nWalking over troubled puddles\nHustles in my chest, no hustle no progress\nExtremities of life and it's process\nBirth of a son, death of another\nWith love I caress both mothers\nAnd told 'em, who’s in control is the one that's above us\nI walk where money talks and love stutters\nBody language of a nation going through changes\nThe young become dangerous, pain gets spent into anger\nAnger gets sent through the chamber\nIt’s tough when your own look like strangers\nWe are the sons of gangsters and stone rangers\nIf he could how would Ernie Barnes paint us?\nLook at the picture, hard not to blame us\nBut time forgives in the Chi where the young die often\nDo they end up in a coffin because we haven’t taught them?\nIs it what we talking, we really ain't walking?\nDues hustlers pay, how much did it cost 'em?\nFind myself on the same corner that we lost ‘em\nReal talking, in they ear like a walkman\nThoughts spin around the corner to the world\nWhen I see them, I see my baby girl\nBelieve!\n\n[Hook]\n\n[Verse 2: Common]\nThe lord lives among us, the younguns hunger\nBecome a means to get it by any ways nece-\n-ssary, under pressure, children feeling lesser\nWith the steel up on the dresser killin' will aggressors\nDestiny’s children survivors, soldiers\nIn front of buildings they eyes look older\nHard to see blessings in the violent culture\nFace against weapons, sirens, holsters\nThat ain't the way that Langston Hughes wrote us\nSoul controllers on the shoulders of Moses and Noah\nWe go from being Precious to Oprah\nCultivated to overcome ever since we came overseas\nToday and the way that you can see we determined\nSolar keeps burning, shawty’s know to keep learning\nLesson’s in our life are like stripes that we earning\nTook gramps' advice that Christ is returning\nLike a thief in the night, I write the beacons of light\nFor those of us in dark alleys and parched valleys\nStreet hits spark rallies of the conscience conquerors of a contest\nThat seems beyond us, even through the unseen\nI know that God watches\nFrom one King's dream, he was able to Barack us\nThe prophets, nothing can stop us\nBelieve!\n\n[Hook]", "image": "https://images.genius.com/c8aea6a11c5d9bc44d2a6101d96d5aed.1000x1000x1.jpg"}], "artist": "Common"}