{"songs": [{"title": "They Don’t Care", "album": "Flamers 3: The Wait Is Over", "year": "2013-01-01", "lyrics": "[Verse 1]\nMy bars first degree, yours to the third\nMy niggas runnin round wit 33 like larry bird\nOr more like scott pippen, camaro, dippin\nBout to buy some louie luggage, shit, cuz I be trippin\nListen. I remember back when I was down on my dick\nI ain't even have a dollar. down to my last 50 cent\nCouldn't even buy a dutch, had to buy a fuckin blunt\nJust to roll up on some reggie thinkin how im gon get up\nWhat! what!\nNow im feelin like a million dollars\nMake me go to Neiman Marcus buy about a million pradas\nAll the real niggas dead, its like a million cowards\nRunnin round. first rap check, buy a million choppers\nI dun seen a nigga rat and get a nigga life\nAnd still walkin round the street like that nigga\nClub partyin, rose garglin, catch em wrong time\nWe puttin hollow heads all im em\nJust imagine I was dead broke\nThem bitches wouldn't give a fuck if I was dead, croaked\nThats why I grind hard so I can get a lambo\nClip full of ammo, more shots than rambo. damn tho\nWhy the D.A try to give me 5 to 10, locked me up\nHad me upstate with ????? and them\nTry again. I be out gettin to the paper\nTryna catch a million like, maafuck a hater\nSittin here contemplating if im gonna murder them\nNiggas always talk that gangster shit but never hered of em\n20 grand to get em all wet. I could service them\nPussy niggas talkin rat, the motherfckin nerve of them\nAs the night falls the lil shells in my glizzy\nCause many men was [?] upon me like 50\nShoot me nine times in thinkin unh uh\nLadder on me, waitin to explode, time bomb\nEver since like 99, livin in my prime time\nGot the money, respect and power came like\nAin't I ain't talkin f.m. we ride fn\nThey same guy talking [?]\nThey just sent my nigga [?] upstate for a direct hit\nCouldn't even catch bail, [?]\nRather have a walkie before he talkie Nextel\nAnd I ain't trying to do it big I'm trying to do it XL\nMatter fact double X, [?] trying to re-up I ain't even bubble yet\nNor double yet\nBut you can smell the white fuming and all the oils burning\nLaid back counting money as the world's turning\nAll my dawgs strapped, ya their steel's German\nAnd I ain't talking Shepard spot you like a Leopard\nIf I ain't in the hood I'm in the lab like I'm Dexter\nTrying to make them oils [?] then bring me back some extras", "image": "https://images.genius.com/d76ee1acc13d517c9a1ca16cf95a42ba.500x500x1.jpg"}], "artist": "Meek Mill"}