{"songs": [{"title": "High", "album": "E.P.I.C. (Every Play is Crucial)", "year": "2011-08-15", "lyrics": "[Verse]\nSo high, what's beneath me, I can't even call it, high\nLike ticket holders when the season started\nIt ain't much to say when actions speak for themselves\nSo just the fact that I'm in this motherfucker means I'm balling\nSo next time you take shots keep an extra cartridge\nNiggas handcuffing hoes like the police department\nYou think you flying but you really falling\nYou just ain't hit the concrete yet nigga, you're stalling\nThey say pop means being popular to the population\nSo excuse me for being the topic of your conversation\nI just keep banging verses and rocking your mama's braces\nWhat you blaze in a week, Psh that's what I start my day with\nMy checks worth more than your net worth\nI got a network about the size of the next earth\nI'm laid up, so much head that my neck hurt\nI'm living a dream, I never once went to bed first you dig\nSo what should I do with so much hate?\nFuck it, I turn crabs in the bucket to a buffet\nAnd beef to a filet that's a full-course entrée\nAnd girl I turn that avocado to some guacomole\nSo Spanish girls Ole, we can skip the foreplay\nRoll up some good haze and stay high for 4 days\nWe can do it 4 ways, left right, up down\nMy cup runneth over but I won't put my cup down\nYou haters cheer leading while I'm out here running touch downs\nBut I won't be ran down, I run shit, you run down\nFrantic blowing whistles like \"Please get sun down\"\nMeanwhile I'm globetrotting from sun up to sun down\nBut still I'm straight, penthouse took all kinds of space\nNo time to play 'cause I know they don't want me on top: Anchovies\nBut still I'm blaze, so many trees don't need no shade\nLiving that stamp life, I think my passport need more space\n\n[Outro]\nHaha, it's B-o-B-o bitch!\nSo don't, don't get mad when your girl come up to me in public like...\nJust keep it movin' brah\nAll you hater, I don't even wanna hear no\nI don't even know why I gotta smoke for man\nIt's like I just can't even get (high), not even a little bit, (high) at all!\nBut still man, you know how I do it\nGrand hustle in the building\nTip coming home soon so you know it's a problem!\nI'm gone... I'm finna go get (high)", "image": "https://images.genius.com/e5a4565350f88e7eb8d8b6e1a5b364fb.500x500x1.jpg"}], "artist": "B.o.B"}