{"songs": [{"title": "Tree", "album": null, "year": null, "lyrics": "[Hook - Kid Cudi]\nEverything I'm having\nNo, they ain't necessity\nThough I'm shining, keep on grinding\nWhat you see ain't all of me\nThough I keep them hoes, don't love them hoes\nThe code in which I roll\nIt's so simple what I need\nYou know I keep my fam, but I can't forget that tree\n\n[Verse 1 - Kid Cudi]\nI got fam, dogg, I got my niggas\nGot a little money y'all, and I ain't trippin\nMost things are faded, feeling x-rated\nSteady want them freaky hoes, then I want a lady\nHolding the fam down, and my close homies\nThe peoples that were there\nWhile some suckers left me lonely, phoney\nWhen you see a nigga, don't approach me\nMade it to the top, baby, it's all me\nCats trying to claim that they made me\nHowever you feel, I know the real fugazi\nI keep it hundred, never frontin', no need be\nWhen I'm in the zone, no place for pussy, my nigga\nConyo to haters who don't know\nLoco, how a nigga like the postal\nThe ones fans love, who was always approachable, yo\nAnd I rep the double O's, double O's..\n\n[Hook - Kid Cudi]\n\n[Verse 2 - Wiz Khalifa]\nThousand pounds of weed\nDriving in my car so fast I won't turn down the speed\nThem hoes don't use their feet\nThey break down to their knees\nAnd suck me like a king. Rosé in my champagne glass\nAnd diamonds in my ring\nRoll something\nThat's your bitch on my dick?\nWell, I'mma let her hold something\nYou niggas smokin' seven I'mma need a whole onion. Woah youngin'!\nSame ones that hate same ones that tag along\nThem black dreads that make them lame niggas call my phone\nCall me \"World Wide Wiz\" cause I'm never home\nEver leave me 'round your bitch, I'mma get her stoned\nAnd you know that I rock camos and brought fros back\nAnd go download some of my old tracks\nAnd go play somewhere songs at\nFuckin high, fuckin high, fuckin high\n\n[Hook - Kid Cudi]", "image": "https://images.genius.com/57fc91d7548f4e591a971ea7f5443a88.355x355x1.jpg"}], "artist": "Kid Cudi"}