{"songs": [{"title": "Coming From", "album": "Flesh of My Flesh, Blood of My Blood", "year": "1998-12-22", "lyrics": "[Intro: DMX]\nBelieve me when I say\nBefore light, there was dark\n\n[Chorus: Mary J. Blige]\nWhere you going, where you going?\nWhere you going, where you going?\nWhere you going?\nIf I don't know where I'm coming from\nWhere would I go?\nIf I don't know where I'm coming from\nWhere would I go?\nIf I don't know where I'm coming from\nWhere would I go?\nIf I don't know where I'm coming from\nWhere would I go?\n\n[Verse 1: DMX]\nPlaces that I've have been, things that I have seen\nWhat you call a nightmare, are what I have as dreams\nBad as that may seem, I know it's only gonna get worse\nLove, or a slug, which one am I gonna get first?\nMy journey's been a rough one, I'm not sure when it begins\nBut the way it's looking, I kind of know when it's gonna end\nHold me down baby, it's gon' be a rough ride\nNiggas give us plenty of room, 'cause I guess enough died\nLet me travel, 'cause my intentions are to travel in peace\nFuck around I lay you down, you hit the gravel and cease\nI could be a beast, or I could be a gentleman\nBut if you ain't my dog, you gonna be like \"Oh, it's him again\"\nNiggas will never win, this whole rap game is mine\nHot as you ever been, I was that in '89\nSeek and you shall find, look within and you will know\nWhere you coming from, and where you gotta go\n\nCome on!\n\n[Chorus: Mary J. Blige]\nIf I don't know where I'm coming from\nWhere would I go?\nIf I don't know where I'm coming from\nWhere would I go?\n-Gotta keep it real with me\nIf I don't know where I'm coming from\nWhere would I go?\n-So the hell with you\nIf I don't know where I'm coming from\nWhere would I go?\n-I think I'm going to the top\nMe and DMX\n\n[DMX]\nI will spend mad time in one spot, plottin' my next move\nTryna figure out - why is it, that X do what X do\nSome questions go unanswered (why?), that's what I'm afraid of\nSometimes I can't show, but I know what I'm made of\nThey made love, or should I say they made lust\nBound, there didn't have to be love there, but they made us\nI got quite a few sisters, I was the only boy\nBut bein' with my dog, was my only joy\nLike a kid with a new toy, I forgot about the grime\nEscaped the misery, didn't think about the crime\nLost all track of time, was in another world\nEverybody knew Earl, but there was another Earl\nLighter side of the dark, fight in the park but wouldn't wanna\nStayed and fought, but when they jumped me, became a good runner\nOne by one they all went under, so I had the last laugh\nThey all thought it all was a joke; I had the last laugh\n\n[Mary J. Blige]\nHa ha ha ha ha ha\n[DMX]\nCome on!\n\n[Chorus: Mary J. Blige]\nIf I don't know where I'm coming from\n-If I don't know, I don't know\nWhere would I go?\n-Where would I go?\nIf I don't know where I'm coming from\nWhere would I go?\n-Where we going, where we going, where we going?\nIf I don't know where I'm coming from\n-Where I'm going\nWhere would I go?\n-But I know where I'm going\nIf I don't know where I'm coming from\n-Do you know, do you know\nWhere would I go?\n-I go, I go\n\n[Verse 3: DMX]\nI feel the ghost from within, comin' back to haunt me\nStay lovin' my peoples, even though they don't want me\nWhen I was bad, I was forgotten, like I was dead and rotten\nShould've been gettin' love, but instead was plottin'\nShit wasn't right, and it was all blamed on me\nDidn't know that I was special 'til this rap shit came to be\nGave me a way out, showed me it was better to teach\nThan bust niggas with the 4-4, leave 'em dead in the streets\nOver beef that was worth less, than the cost of the slugs that I bought to kill them\nAnd that's because I thought I ought to kill 'em\nLittle did I know, death wasn't right\nDidn't always show every breath was a life\nIt was to be captured in suspended animation\nTo be felt by all, understood by every nation\nWhat's the sense of hatin', when I can show love\nWhat's the sense of fakin', when I can show blood\n\n[Mary J. Blige]\nNow what's the moral to this story?\n[DMX]\nCome on!\n\n[Chorus: Mary J. Blige]\nIf I don't know where I'm coming from\nWhere would I go?\n-Where would I go?\nIf I don't know where I'm coming from\n-If I don't know, I don't know\nWhere would I go?\nIf I don't know where I'm coming from\n-I don't know\nWhere would I go?\n-But I know where I'm coming from\nIf I don't know where I'm coming from\n-Do you know where you're coming from?\nWhere would I go?\n\n[Outro]\nYonkers is where we grew\nTrials we got through\nOn top is where we'll stay\n'Til the end, as long as we'll pray\n[?]\n[?]\nOn Hot97 ya hear\nDMX all through the year", "image": "https://images.genius.com/236ac8cb125196c489579b947c3b2fb8.945x945x1.jpg"}], "artist": "DMX"}