{"songs": [{"title": "Intro", "album": "It’s Dark and Hell is Hot", "year": "1998-05-19", "lyrics": "Interviewer: Yo I'm sayin, these Ruff Ryder Niggas\nDMX: Dog\nInterviewer: I heard these niggas is for real\nDMX: Dog. That's my mans and them\nInterviewer: But I heard these niggas is like\nSuppose to be locking down the industry on\nSome shit, on some power shit\nDMX: Dog that's my mans and them\nInterviewer: Eh\nDMX: So what I'm doing\nInterviewer: right, right\nDMX: my mans and them is doing, because\nInterviewer: right\nDMX: that's my mans and them, ya know\nInterviewer: I feel ya\nDMX: Now ya feel me?\nInterviewer: I feel ya\nDMX: So you know when you fucking with me\nInterviewer: right, right\nDMX: you fucking with\nInterviewer: Uh-oh, what have you done now?\n\n[Intro]\nTold y'all niggas\nYou just don't listen\nWhy must you be hard-headed?\nTried to explain, but you didn't hear me, though\nYou know\nGrrrrrr\n\n[Verse 1]\nOne-two, one-two, come through run through\nGun who? Oh, you don't know what the gun do?\nSome do, those that know are real quiet\nWhen you think you wanna try it, fuck around and start a riot\nNiggas gonna buy it, regardless\nBecause I'm the hardest rap artist and I'mma start this\nShit up for real, get up and feel\nMy words, I make herbs split up and squeal\nIll is all I've been hearing lately\nNiggas hate me, wanna duct tape me and make me\nPut their brains on the wall, when I brawl\nToo late for that 9-1-1 call\nNiggas stay beefing, but a lot of them bluff\nBut not me because I'm a nigga that can get out of them cuffs\nYou think a lot of them's tough, that's just a front\nWhen I hit them niggas like 'What you want?' The battle turns into a hunt\nWith the dog right behind niggas chasing them down\nWe all knew that you was pussy, but I'm tasting it now\nAnd never give a dog blood, because raw blood will have a dog like what\nBiting whatever, all up in your gut\nGive it to them raw like that, and ain't no love I do 'em all like that\nFour right up in they back; clack-clack\nClose your eyes baby, it's over, forget it\nHappened in front off your building, but nobody knows who did it\n\n[Bridge]\nWhat\nWhere my dogs at?\nWhat what\nWhere my dogs at?\nUh\nWhere my dogs at?\nWhat what\nWhere my dogs at?\nUh\nWhere my dogs at?\nWhat what\nWhere my dogs at?\nUh\nWhere my dogs at?\nWhat what\n\n[Verse 2]\nNiggas is puss, keep on running from the werewolf, owww\nHowling at the moon on the roof (uh oh)\nEh, ah, no, get em\n10 niggas on him, hope God's with him\nGive me the bat, let me split him\nI'll have em where the pillow and the casket won't fit him\nOnly reason I did him, he wouldn't fight back\nTried to strike back, left him like that, laying up with the white hat\nGetting right back atchya when I snatch ya\nUp out the grave, nothing but bones and ashes\nHittin' niggas with gashes to the head\nStraight to the white meat but the street stays red\nGirls gave me head for free cause they see\nWho I'ma be, by like 2003\nThat Nigga D took it there, he thought it was a joke\nHe went through like 20 G's and thought that I was broke\nStupid, that's what you get for thinking\nAnd eventually found that's what you get for stinking\nBlowing up the spot when you rot\nPlus, if it gets hot, they know you dead for four squared blocks\nHit em with the ox to the grill\nEh, ah, kill nigga kill\nYet and still you don't know that I'ma rob 'em\nThat nigga DMX is a mothafuckin' problem\nAight?", "image": "https://images.genius.com/8314b41ccd0d9cc7825bc168024bdec2.630x630x1.jpg"}], "artist": "DMX"}