{"songs": [{"title": "LIKE A SOCCER MOM", "album": "SLAPS FOR MY DROP-TOP MINI-VAN", "year": "2016-07-14", "lyrics": "[Intro]\nAyy, ayy, ayy, ayy, yuh, vitch\nWe are very much in this vitch (Codename for what?)\nWe are really glad (Ayy!), sitting on the swag (Bitch!)\nAnd I popped a Xan (Am I? Yuh), it's a whole 'nother land, ayy!\n\n[Chorus]\nPull up, drop top minivan, what the fuck? (Like hey)\nCandy paint wet, Hubba Bubba gum (Yuh, yuh, yuh)\nSeats with the sheep fur, peach fuzz (Look at it)\nWhen I whip it, Fat Joe, lean back, stunt (Ha)\nPull up drop top minivan, what the fuck? (Wet flex, ayy)\nCandy paint wet, Hubba Bubba gum (Look at it, look at it, look at it)\nSeats with the sheep fur, peach fuzz (Ayy)\nWhen I whip it, Fat Joe, lean back, stunt (Ayy, ayy)\nLike, why my roof look like a T-Rex done bit it?\nMy minivan got the Jigglypuff linen (Yuh)\nWhy my roof look like a T-Rex done bit it? (Yuh)\nMy minivan got the Jigglypuff linen (Yuh, uh)\nPull up, drop top minivan, what the fuck? (Mm)\nCandy paint wet, Hubba Bubba gum (Hey)\nSeats with the sheep fur, peach fuzz (Ayy)\nWhen I whip it, Fat Joe, lean back, stunt (Yuh, ayy)\n\n[Verse 1]\nAyy, Heard from a bird that Nyora got licked bitch, hold up (Wet, flex)\nHold up, drop this shit (Bitch!)\nThen should shout out to whichever savage took his shit (Flex in the flesh)\nTiffany Co. on the diamond-cut necklace\nMy precious like Lord of the Rings (In the flesh)\nBadman a new to di ting, rude boy (Ew)\nNeed a 'Preme Raf Simons vaccine (Ow, okay)\nI never care 'bout the clout (Drip)\nOnly care 'bout her mouth (Water), it relax me like namaste\n(Watch the sauce)\nMi casa, you know, es su casa\nIs the intel that I shared with your bitch today (Look at my jacket)\nThey gon' think Ski popped a laxative\nOr need some Pull-Ups, hoe I am the shit today, mm\nMy diamonds wet like some Gatorade (Bitch!)\nIt is the same percent water as Powerade, hm (Hoo!)\nSwag on my back like a backpack\nNeed a paper towel, spilled sauce on my 'Preme rag, hm\nRingworm pockets how they get fat\nAnd I'm being honest, kinda wanna fuck Kat Stacks, hm\nDirty with the dick, got the minivan\nBlastoise wrist like I’m mega-mega-felon-man, hm\nFantastic 4, I'm the Human Torch\nSlaps for the minivan, Oprah colored Gucci band, hm\nWhip it, whip it, whip it, wrist built like a GoPro\nThis Good Burger cook your beef slow, hm\nG, no unit, like a nigga Tony Yayo\nEvery grandma said my music fuego, hm\nLeggo my dick no Eggo, hm\nForeign money, colors on Legos, hm\nFlow on float Winnebago, hm\nShe need milk like I miss the hoe, ayy\n\n[Chorus]\nPull up drop top minivan, what the fuck? (Mm)\nCandy paint wet, Hubba Bubba gum (Mm)\nSeats with the sheep fur, peach fuzz (Mm)\nWhen I whip it, Fat Joe, lean back, stunt\nPull up drop top minivan, what the fuck? (Mm)\nCandy paint wet, Hubba Bubba gum (Mm)\nSeats with the sheep fur, peach fuzz (Mm)\nWhen I whip it, Fat Joe, lean back, stunt\nLike, why my roof look like a T-Rex done bit it?\nMy minivan got the Jigglypuff linen\nWhy my roof look like a T-Rex done bit it?\nMy minivan got the Jigglypuff linen\nPull up drop top minivan, what the fuck? (Mm)\nCandy paint wet, Hubba Bubba gum (Mm)\nSeats with the sheep fur, peach fuzz (Uh)\nWhen I whip it, Fat Joe, lean back, stunt", "image": "https://images.genius.com/00ba9d291fcf1d87be9c45952c7d8dad.1000x1000x1.jpg"}], "artist": "Ski Mask the Slump God"}