{"songs": [{"title": "Work in Progress (Intro)", "album": "Mr. Davis", "year": "2017-10-13", "lyrics": "[Intro]\nMurda on the beat so it's not nice\nHah\nIt's Gucci\nHah\n\n[Verse]\nI was piss poor, sleeping on the dirt floor\nAnd we couldn't pay the rent so it's a notice on the door\nThe neighbors been noticed so what I'ma front for?\nUsing pennies for the bus like what I'ma stunt for?\nMama workin' like a dog but we still broke\nWe lighting candles in the house 'cause the lights off\nThe best thing that ever happened, I got kicked out\nBought me a Chevy, got a grill, now I'm gold-mouthed\nI lost my daddy last year, I couldn't even cry\n'Cause it's so hard to shed a tear, he didn't even try\nThe only person in the world I could fully trust\nWas my older brother Vic, that's just how it was\nTop in the trunk, this for Bankroll and Slim Dunk\nI miss that girl Beasley, she was a real one\nI had an artist that I treated like my own son\nGave him the shirt off my back and my own gun\nR.I.P. to Shawty Lo, Mister Don Don\nIt's been rainin' so long, when the sun comin'?\nI'm drop top but put the top up when the storm comin'\nSometimes I think about my past, it make me start tripping\nI was gifted with a talent that was God-given\nBut I was so hard-headed I would not listen\nSometimes I sit and I reflect about that cold prison\nAnd doin' pull-ups with a nigga got a life sentence\nThey gave my nigga Grant life, he only gained on me\nFive years later, how we in the same room?\nYou go to jail, that's when you see who really love you\nI don't think nobody love me like my auntie Jean do\nR.I.P my auntie Jean and uncle Goat too\nHow you gon' judge me? You don't know what I been through\nI think these killers need a hug, I need a hug too\nYou send a slug, I'll send a slug, you know how thugs do\nBut I forgive, I been forgiven, I hold grudges too\nI'm just a work in progress, I'm not even through\nBut I forgive, I been forgiven, I hold grudges too\nI'm just a work in progress, I'm not even through\n\n[Outro]\nWop\nHah\nWoo", "image": "https://images.genius.com/0397c2080a940a534b5b50af5863be90.1000x1000x1.jpg"}], "artist": "Gucci Mane"}