{"songs": [{"title": "Ho’s a Housewife", "album": "Kuruption!", "year": "1998-10-06", "lyrics": "Yo, this is for the bitches!!\n(Beoch)(nigga, just blaze the weed)\n(conversation in background)\nHe just can't tell em apart\nSo, I hollered at the lil' homey Marl\n(Snoop Dogg) I said what the fuck? man\nLet's spit this nigga some game\n\nI had a dream of hoes, I had to screen my hoes\nI've seen my hoes in all kinds of clothes\nLil' almond joy, I'd sure enjoy\nIf you blew my balls, right through my drawers\nCome up to the mansion, chill at the stop\n]From the way she be blowing, I know she does it a lot\nI have a eight and a half, nine and three quarters\nThe hoes starting callin, when I start boss ballin\nGive me some head, give me some cash, give me some ass\nPass it to Daz, pass it to Snoop, or pass it to Nate\nHoes eat dick like eggs and steak\nAnd ain't shit new, I thought you knew\nI knew you would, you wish you could\nBreak a G down, break me down\nBut I'mma see you on the rebound, DP style\n\n(Chorus)\nNow this, this, is, one of them occasions\nWhere the homey's not doing it right\nI mean he found him a ho that he like\nBut you can't make a ho a housewife\nAnd when it all boils down you go find in the end\nA bitch is a bitch, but a dogg is a man's best friend\nSo what you found a ho that you like\nBut you can't make a ho a housewife\n\nNow there's bitches of all kinds, races and creeds\nBitches ain't shit, bitches eat dick\nTake a second look, I can't stand a ho that can't cook\nWhile you betting on niggas, setting on niggas\nAnd you tell 'em all this bullshit, you so in love\nHo please, I know you didn't think I didn't, no tease\nI'm a G, ho, you should have know now\nI'mma holla at you, feena get my dick blown back\nAnd you can do the same thing, the homies don't mind\nJust give 'em the word, and they'll be waiting in line (I'm next)\nI can see right through you, do you, cause you want to do me\nBesides right now I'm in the bitches eating coochie\nPsychadelic high, bitch!\nReal G's do it like this, and I'm coming through with\nA fifth of some bomb ass sticky\nJust to get a bomb ass quicky\nNiggas like fucking hoes that give 'em hickies\nReally? Nigga that's silly, you can't make a ho a housewife\nAnd I ain't got to tell you twice\nHow could ya respect ya bitch, before you check ya bitch\nNiggas like me and the homies might connect ya bitch\nGot diamond studded pimp rings, hoes on the strip man\nLots of cash to get man, lots of game to spit man\nIt's a pimp thing\n\n(Chorus)\n\n(Kurupt talkin)\n\nI mean, man, I found so many hoes, yuo know\nI ran across so many hoes you know\nI said 'Yo, baby' 'Yo, my lady' 'Yo, my bitch'\nYo, check it out, yo\nAll you hoes (All you hoes)\nAll these bitches now a days\nI been noticing motherfuckers, man, I mean\nIt's like they want to set it off (set it off)\nBut don't set it off on me, motherfucker (Why?)\nI ain't did nothing to you (Did you?)\nI want to make you better\nI want to include you, baby, in the program (seclude you)\nOh!(oh) But yet in still (yet in still)\nYou wanna act like a bitch, bitch!(bitch)\nLil' bitch! (Lil' bitch!)\nYo, if you goin' be a bitch, be a bitch\nBe a bitch (dont' be no bitch) Be a bitch, bitch!\nLil bitch, I've met so many hoes, so many bitches\nWhat's wrong with these hoes? What's wrong with these bitches?\n( I met a skank-ass, skallywag, trick, tramp, hussy, heffer)\nI'mma feena let my homeboy Joe Montana speak to the hoes\nSpeak to the hoes man\n\n(Joe Montana)\nOh my god, oh my god, Joe Montana\nYou know me, Joe Montana, eh listen!(Eh listen!)\nJoe Motherfuckingtana got the hoes man\nI got the fucking coochie\n(singing)\nI got the coochie and the loochie and I'm fucking em all night\nWoke her up again, bitches Godi rollin you up(Bitches!)\nI'm fucking hoes up, yeah\n\nAyo listen, I'm spittin game\nLook, eh listen\nThe only thing I want is you\nAnd if I can't have you, then you can't me\nAnd me is the world, and if you want the world\nThen roll, and if you can't roll throught the worst break\nThrough the worst pop, then you's a fucking ho, really though\nBitch", "image": "https://images.genius.com/a7652517cf446c15e882aa0bc85229b3.594x594x1.jpg"}], "artist": "Kurupt"}