{"songs": [{"title": "Ima Maniac", "album": "You Know What It Is Vol 4 - Murda Game Chronicles", "year": "2007-04-08", "lyrics": "[Intro]\nDamn it's 1 A.M. already huh\nShit E.P, you ain't lost a motherfucking beat since that Doctor's Advocate intro, shit sound crazy, piano keys, 808 drums\nOh shit what the fuck was that? Ray Charles on some gangsta shit\n\n[Chorus]\nI'm a maniac niggas tryna steal my shine\nI gotta warn you not to cross that line\n'Cause I'm a motherfucking maniac\nNigga, it's about that time to introduce em to that new tech nine\nMy momma told me I'm a maniac\nDon't trust me nigga, 'cause I don't trust me nigga\nI'm motherfucking maniac\nSo don't trust me nigga, cause I don't trust me nigga\n\n[Verse 1]\nI'm fucking insane, Glock 45, put it to my own brain\nBlow the shit out, come back, that's why they call me Game\nYeah I'm loco, got you rap niggas in a choke hold\nJermaine Dupri-ass-niggas always rappin so-so\nAlways on my dick, jockin' my car, jockin' my bitch\nWestside, I'm on that gangsta shit\nAfter Snoop there will be no more, except for me\nI snuck in Dr. Dre's kitchen and stole the recipe\nCook crack on these dope ass beats\nI got heat like Pacino, lyrical assassin, there will be no\nMore beefin' with these corny ass rap niggas\nKill a nigga on your song never bust a gat, nigga\nYelling out CeeLo never shot a crack, nigga\nHeard one Jeezy verse now you a trap nigga?\n2 classic albums, 8 times plat, nigga\nHip hop's new blood, check the stats, nigga\n\n[Chorus]\nI'm a maniac niggas tryna steal my shine\nI gotta warn you not to cross that line\n'Cause I'm a motherfucking maniac\nNigga, it's about that time to introduce em to that new tech nine\nMy momma told me I'm a maniac\nDon't trust me nigga, 'cause I don't trust me nigga\nI'm motherfucking maniac\nSo don't trust me nigga, cause I don't trust me nigga\n\n[Verse 2]\nI only been gone 5 months\nNow Ray J fucking Whitney and Bobby with Superhead\nCall Nas tell him hip hop is super dead\nI had to fall back, try to desolve rap\nMix a classic with bakin' soda what you call that?\nNiggas cut my legs off and watch me crawl back\nHip-hop king with a LA Dodgers ball cap\nWho can fuck with me, go buck for buck with me?\nListenin' to my rhymes waitin on me to say fuck [50], haha\nIt ain't gon happen nigga, Hip hop done went soft\nA million dollars every time I slap a nigga\nYou niggas know me, to take it from a OG\nNo more fuck you, back to sayin' fuck tha police\nI stay on that motherfuckin' Straight Outta Compton\nNWA shit, Hip-Hop need a facelift\nFace it, take em' back to the basics\nEspecially since I rode in on Dr. Dre hits\n\n[Chorus]\nI'm a maniac niggas tryna steal my shine\nI gotta warn you not to cross that line\n'Cause I'm a motherfucking maniac\nNigga, it's about that time to introduce em to that new tech nine\nMy momma told me I'm a maniac\nDon't trust me nigga, 'cause I don't trust me nigga\nI'm motherfucking maniac\nSo don't trust me nigga, cause I don't trust me nigga\n\n[Outro]\nShit man, I'm dope as a muthafucker\nI'm so dope niggas should put my skinny ass in one of those fucking bottles and put a red top on it and sell me\nName yo' price, fuck it, I'm crack\nSkee! E.P\nBlack Wall Street niggas, shit\nThe next fuckin' album gon' be crazy as shit\nListen, shoutout to DJ Khaled, Cool & Dre and 'em\nThese my niggas\nAnd you, you? You dirty fuckin' rat?! You a bitch", "image": "https://images.genius.com/fd823b680b687dac4f58ed6122bbab9b.500x500x1.jpg"}], "artist": "The Game"}