{"songs": [{"title": "Neva Neva", "album": null, "year": "2010-01-01", "lyrics": "Intro (Twista):\n(Neva neva neva) Twista y'all, the Perfect Storm\n(Neva neva neva) I know you think that you gonna have it forever, I’ma tell you right now\nYou can't never say ever\n(Neva neva neva)\n\nVerse 1 (Twista):\nPimps up, hoes down, mo' Kush, mo' rounds\nYou feel like the permanent living is never gon' end\nUntil some shit, go down\nNever say never it’s not like predictin' the weather\nYou say that I’m trippin' you say that you different\nAnd you like \"Whatever\"\nYou feel like you better cause you makin' cheddar Instead of realizin' the one that you might of cut off could go through an endeavor\nFluent as ever in my thing and I keep it real\nI know they be hatin' and trippin' so I keep the steel\nI know that the devil is coming so I keep a shield\nDon't wanna go out of my mind so I keep the kill\nWhy are you saying that you could not ever be broke?\nWhy are you saying that there could not ever be hope?\nWhy are you saying that you can not get what you wanna get when I be making that money from flowin' on heavenly notes\n\nChorus:\nWhat am I to do? (What am I to do y'all?)\nMy mind is in a whirlpool (Man I’m going crazy)\nGive me a little hope (I need hope)\nOne small thing to cling to, yeah\nNeva, neva, neva\n\nVerse 2:\nNever let the haters say that you ain't up to par\nNever should you be believin' you are not a star\nNever should you ever think that you can't get that far\nNever should you ever think that you can't get that car\nNever be thinkin' the shit you be doin' will come back around and bite you in the ass, especially if you on woppy (??)\nAnd when you be flowin' then never be using the words I be using if you rappin' fast especially if you gon' copy\nBut that be the reason when I flow I gotta switch it up\nCause I gotta give it to 'em in a way they won’t pick it up\nBut never say never cause when they get the acappella there’s somebody gon' do it better but until then give it up\nSo never say that you can't win if they say you gon lose\nAnd never think you can come up if you don’t make a move\nAnd never believe that you are below anybody because of yo' looks\nYou are the shit, as long as you choose\n\nChorus:\nWhat am I to do? (I don't know)\nMy mind is in a whirlpool (Know I'm talk'n 'bout?)\nGive me a little hope (Yeah)\nOne small thing to cling to, yeah\nNeva, neva, neva\n\nVerse 3 (Twista):\nI see hard crime, a child was runnin' around in the streets\nAnd got caught in a murder now he ain’t gon' never come home\nNever be thinkin' you helpin' by doin' whatever they want\nCause life is hard and he ain't gon' never be strong\nNever believe that the the only way you can stop it\nWhen you take a look at the drama\nPlease take a look at the lama\nNow what you gon' do when you have to look at your Mama?\nNow you can do better than that homie, look at Obama\nAnd then sit, in the back, of the bus, if they don’t, give it up\nOn the way, to the joint, cause you, think you can come up\nYou feelin' like you was invincible until they struck\nWith the right to remain silent, fuck\nNever think that you’re so hard that you can’t get crossed\nAnd never think that you’re so hard that you can’t get soft\nAnd never think that you’re so smart that you can’t get taught\nAnd never think that you’re so smart that you can’t get caught\n\nNeva, neva, neva, oooooooooooh (Sing it, baby!)\nAaaaaaay (Tell ’em girl)\nWhat am I to do?\nMy mind is in a whirlpool (feel me?)\nWhat am I to do? (Tell 'em)\nMy mind is in a whirlpool (Know I'm talk'n 'bout?)\nWhat am I to do?\nMy mind is in a whirlpool (Uh)\nGive me a little hope, (That’s all I need)\nOne small thing to cling to\n\nOutro:\n(Oooooooh) Never say never, y'all already know the real, Y'all shawties gon' understand some day (Aaaaaaaaaay)\nGotta live for today, fight for tomorrow\n(Neva, neva, neva, oooooooh, aaaaaaaaaaaay,)", "image": "https://images.genius.com/f832da8d956be1aa5e9a0ec763dcd481.716x716x1.jpg"}], "artist": "Twista"}