{"songs": [{"title": "The Question", "album": "Macadelic", "year": "2012-03-23", "lyrics": "[Intro: Mac Miller]\nSometimes I wonder who the fuck I am\nSometimes I wonder who the fuck I am\nUhhhhhh\nYeah, want you to feel it\nI want you all to feel it\nSo step up on the mic and uhh\nShow them what you got tiger\n\n[Verse 1: Mac Miller]\nSometimes I wonder who the fuck I am\nSo I've been lookin' in the mirror and it still don't make no sense\nI'm askin' what am I supposed to do?\nI've done so much in my short lifetime, but I haven't done shit\nI done flew around the whole world\nFirst I shook a million hands and I took a million pictures\nBut I'm a hostage in my own world\nAnd my thoughts my own enemy, got no time for these bitches\nI got too much on my damn mind\nSo if I add some more stress, I just don't see how I'm a cope\nI think they underestimate the grind\nI do, bring this dough, and I'm only 20 years old\nI wonder why I sip this devil juice\nCause it feel incredible, problems, I got several\nThank God that none of that medical\nUgh, I've been blessed with much to be expected\n\n[Hook: Mac Miller]\nWhat am I doing here?\nI wonder what am I doing here\nWhat am I doing here\nWhat am I doing here\n\n[Verse 2: Mac Miller]\nI hope this feelin' lasts for fuckin' ever\nI don't want to come back down, let me stay above the ground\nI hope I do what I was meant to do\nCause I've been searchin' for that answer, I just hope I get it now\nPlease, let me find euphoria\nWhen you up above the clouds, like, who goin' to touch me now\nAnd do we ever get to know the truth?\nCause everyone seems to have it, but to me it seems they lack it\nNow I'm rollin' and I'm sippin' lean\nSometimes I catch a buzz just to help me picture love\nDrinkin' liquor and I'm smokin' weed\nAnd you don't ever do too much if you could never do enough\nWonder why it's me instead of you\nI'll be there to rescue you, problems you got several\nThank God that none of that medical\nUgh, I've been blessed with much to be expected\n\n[Hook: Mac Miller]\nWhat am I doing here?\nI wonder what am I doing here\nWhat am I doing here\nWhat am I doing here\n\n[Verse 3: Lil Wayne]\nUh, sittin' in my Bentley,  thinkin' bout these hoes\nAll I do is kill them, I kill them like Nicole\nSimpson, flag crimson, smoke em' like Winstons\nI just bought a new chopper, I treat it like an infant\nI'm lightin' up a stogie, It's longer than a hoagie\nSituation's gettin' fishy and I don't eat anchovies\nFuck the world, kill em' all, she answer when I call\nIf the cops pull us over, she gon' hide it in her drawers\nSee I come from a place where stars never shine\nAnd drama is accepted, credit cards are declined\nEverybody gotta die, but I ain't everybody\nIf that ho play with me, I whoop that chick like Terrence Howard\nI'm a pimp, I ain't lyin', but that is not important\nI'm just tryna to buy time, but can't really afford it\nSayin' ain't that a bitch, but I hope that bitch is bad\nI feel like money in the trash, like—\nWhoa! Yeah, Young Mula Baby!\n\n[Hook: Mac Miller]\nWhat am I doing here?\nI wonder what am I doing here\nWhat am I doing here\nWhat am I doing here", "image": "https://images.genius.com/5c20c657a063eac69a842fc529269744.375x375x1.jpg"}], "artist": "Mac Miller"}