{"songs": [{"title": "Pick Ma Balls Up (Drop the World Freestyle)", "album": null, "year": null, "lyrics": "I done been through the ups\nBeen through the downs\nSharpened the flow\nGinsu'd the sound\nI was tossed in the game\nThen thrown out\nYou know you in\nWhen your friends want out\nFans get cocky tryna visualise my pockets\nReally y'all should stop it\nQuit criticising my topics\nThey say he rap about dick so much you could predict his lines\nBut the hits they listening to is all about bricks and shine\nAnd this is fine\nWait, let me pick your mind\nEverybody's a rapper now into it to get em signed\nY'all with em fakin' rap\nWhat's the use in speaking how you truly feel\nIf you gon have to turn around and take it back\nJoey taught me don't make your life an open book to them trust me\nCause it will fuck your shit up plus them niggas is touchy\nBut the race I'm running is against rappers touchier than Rihanna and Kanye in London\nOk I'm done and\nI'm guilty for rappin about thuggin' and not about lovin\nI'm deeper and darker\nFor me beef is easier to talk a-\nI'm a beast when I'm deep in thought\nDiss me you reachin, I ether the author\nFly as a bitch leavin the park\nBefore I'm demonstrating\nYou talking loud like Mystikal in '98\nI'm here, you talk soft like Ray-J in elimination\nBack off to the brothers\nHats off to the others\nWhite fans is mad, they red like hacksaw jim-duggan\nYeah, I will stick you up\nI spit barbiturates\nMy triggers will lift you up\nThey say I talk about my dick too much\nI'm about it, I done went a whole verse without talking bout it\nI'm a pick my dick up and I'm stick it in your bitches head\nYeah I'mma pick my nuts up and I'm a drop 'em on your fucking head\nYeah, say I can die now and rebirth muthafucker\nHop up on the spaceship and leave Earth muthafucker\nI'm gone, yeah I'm gone\nUhh\nNow which one of y'all is going home with a trigger\nRuin your figure-er? Haha\nNow which one of y'all is going home with a trigger\nRuin your figure? Er?\nOw", "image": "https://images.genius.com/892233b049a8da052593a9b4030be708.988x988x1.png"}], "artist": "Royce da 5'9'’"}