{"songs": [{"title": "Odd and Twisted", "album": "What’s Poppin Volume 1", "year": "2011-09-07", "lyrics": "[Intro: Tyler]\nHey guys (Golf Wang!)\nI'm Peter Rosenberg, super-underground\nYou know me, uh, you see my laptop, yeah, I mean\nApple is pretty mainstream but I have underground stickers\nSo it levels out..\n\n[Verse 1: Domo]\nY'all niggas got it twisted, we ain't the Misfits\nWe the sick shit, make the competition slit wrists\nBodybag, beats get rapped like it's Christmas\nPopping tags, I stay in Dior cause I'm Christian\nNigga listen: I been killing shit since I was the\nAge of the face that R. Kelly pissed in\nIn the booth, I'm brawling to be like the Pistons\nOnly smoke flight, you can't hit if you ain't pitched in!\nAnd bitch stop talking, let the marijuana sink in\nAnd when that chauffeur roll up, you better get in\nYou and your 6 friends, even your big friend\nGot a gang of wolves that slay hoes like henchmen\nO.F. kill someone, yeah nigga we shipped it\nLocal ass nigga, we overseas on you dipshits\nWalking flex tweet, motherfucker take a Twitpic\nKidnapped the game and it won't quit bitching\n\n[Verse 2: Tyler]\nDuct tape, bow knife, now I’m breaking in homes\nAnd now I’m in the closet with Kelly, we’re watching The Throne\nAnd 'till I get that mothafucka I'll be watching ya home\nAnd gonna tryna go harder than me hiding a boner\nWith lights on it, see I was the loner\nNow I got a bunch of fucking Lindsay Lohans\nThat don’t even know me, tryna get me that old hand\nJob, fuck that ho blow me\nThe G.I. Joe of O.F. is slowly\nSolely running shit his toes is swollen\nGoblin left the bridge, no more patrolling\nStick my finger in any hole I can find, fuck bowling\nI’m making that bread, jabronni, and the green shit that’s growing is stuck\nMy Bank account is molding\nMe and Wanda Sykes was holding hands 'till I eat her cooter\nLike a fresh bowl of Ravioli, Chef Boyar-T\nOn tour, had to make a couple pit stops\nEnded at this fucking hipster club called the Pin Drop\nWhere they said they hated on me and Odd Future kids\nAnd how much they really love underground hip-hop\nWe don’t give a fuck like a virginized dick cock\nAfter being tickled by a couple Eddie Bishops\nYoung niggas OF, got this\nCome to my show and see niggers in the moshpit\nCat on my cotton, zebra print 5 panel from Jebbia\nNow I’m flyer than an ostrich\nVMA nom, yes! Video my set\nHarder than Nakel not nolling a nine set\nThrasher, billboard, cover of them issues\nBoy flow colder than O'Shay stuck in an igloo\nI'mma fuck the game till my herpes-covered dick's bruised", "image": "https://images.rapgenius.com/8zlcn04yow1pu64vzrhsrtpbv.750x750x1.jpg"}], "artist": "Tyler, The Creator"}