{"songs": [{"title": "Luv U Better Freestyle", "album": "Freshmen Adjustment Vol. 2", "year": "2013-01-01", "lyrics": "[Intro] [Kanye West talking]\nYo it's your boy, super pro-huhum, I mean super RAPPER Kanye West\nI want to shout out all my Heavy Hitters. Yo, G & Hop what up?\n[Verse 1]\nWas it because of the Roc\nThat she wanna rock with West?\nBecause after the Blueprint I got lots of checks\nShe don't play X-Box but got a box of X\nThat make her tongue move faster than Das EFX\nUh, white Benz, dyke twins\nI ain't gon' lie they only fives but together they tens\nAnd would I do them again?\nHummm, it's like old folks pissin' cause it all Depends\nAnd there's no coke sniffin', just juice and gin\nGrey Goose will get you loose then hit the nigga producin'\nThe track that got you movin'\nI never hit a lady but my game might abuse them\nBuyin' boots just to tell 'em that I Jimmy choose 'em\nAnd take 'em back to confuse 'em\nSee she don't know if she's comin' or goin'\nCause mommy after I'm cummin' I'm goin'\nBack to the show\nJust frontin' and flowin'\nJewelry stuntin' and glowin'\nIt's like somethin' outta nowhere\nYeah, and I've been known to have a ho or two\nCause my diamond's yellow like a smoker tooth\nI tell 'em, \"Step into the vocal booth\"\nRoll a joint, smoke a few\nAfter that I'm pokin' you\nAfter that it's over boo\nBaby grab your coat and peeeeuuuun\nShe said, \"I love you K.\"\n\"I know you do. If I was you I'd love me too.\"\nYoooooooou\nNot used to what I got to offer\nPlease get up off me baby, you can't boss me\nI wish I would let her dictate\nAll she can tell me is how the dick taste\nHow she gonna tell K about L.A.?\nWhen I got three hoes that stay in Marina Del Ray\nWell paid, they don't park it, just valet\nWaist small like the Motorola Cingular cell-y\nVoice high like Mich'elle\nI step back like, \"Haha\nYou ever ran for Miss L.A.?\"\nCause you holdin' down the city officia-lly\nNext time you fuckin' your man, just yell, \"K\"", "image": "https://images.genius.com/96319570be9d2165984a99be5ecf2edf.500x500x1.jpg"}], "artist": "Kanye West"}