{"songs": [{"title": "Looking for a Baller", "album": "Chase the Cat", "year": null, "lyrics": "[Jazze Pha 2X]\nWe, roll dubs\nBall, in clubs\nDimes, no scrubs\nIf you're lookin for a baller, baller\n\n[Jazze Phe]\nFrom the yay, from the yay\nPoppin my collar\nIf you're lookin for a baller, baller\nFrom the yay, from the yay\nPoppin my collar\nIf you're lookin for a baller, baller\n\n[Too $hort]\nWhassup baby? Still dreamin?\nFor a rich man, you still fiendin?\nWell I hope he got skills if you know what I mean\nEverything from oral sex, to cookin and cleanin\nRich niggas want it all, just like you\nAnd when I ball don't ask me what I do\nYou wanna be kept, keep yo' mouth shut\nBut youse a golddigger and you go out too much\nIf I choose you, it'll be the wrong choice\nI'm sayin fuck you loud, with a strong voice\nOne rainy day and yo' ass is out\nNo money to spend, you start passin out\nSo dramatic, even though it ain't yo' cash\nBitches like you I wanna thank yo' ass\nFor bein shallow, I know you a bad ho\nI wouldn't let yo' punk-ass stand next to my shadow\n\n[Jazze Pha]\nWe, roll dubs\nBall, in clubs\nDimes, no scrubs\nIf you're lookin for a baller, baller\n\n[Too $hort]\nI like a Cinderella story, but most of the time\nThese nothin-ass golddiggin hoes are fine\nA nigga frontin, you wanna have sex with a star?\nHe drive a Benz, but it's the next nigga car\nThe only thing he own is that outfit\nBut he still stuck his dick in yo' mouth bitch\nAnd after all that gettin fucked on the floor\nHe called a taxi to take you home in the mornin\nDumb bitch, you just got fucked by a flunkie\nSee you at the club and you actin like you want ME\nDon't make me laugh\nWe get married, and you take half\nI don't think so, see you at the bank ho\nYou wanna walk down the aisle but I cain't go\nI got her number, but I never call her\nYou better look around and find another baller, beotch!\n\n[Jazze Pha]\nWe, roll dubs\nBall, in clubs\nDimes, no scrubs\nIf you're lookin for a baller, baller\n\n[Too $hort]\nI don't want yo' key, you ain't gettin mine\nAsk to use my car, you commitin a crime\nLeave yo' panties or yo' bra, I throw 'em away\nCain't find the door? I show you the way\nHope you come back, but you just cain't stay\nWe can get together on another day\nI come get you, when I miss you\nCause if I see you every day I'd probably diss you\nWhat'chu gon' do when you get you a baller?\nRich man, what she gotta do to get you to call her?\nBetter talk about, might like what you hear\nSay it right in her ear, every night of the year\nYou can be together, beotch!\nYou better get a job if you wanna be rich\nGo to school or somethin, get a degree\nI know you wanna baller but it can't be me\n\n[Jazze Phe]\nFrom the yay, from the yay\nPoppin my collar\nIf you're lookin for a baller, baller\nFrom the yay, from the yay\nPoppin my collar\nIf you're lookin for a baller, baller\n\n(\"Pimpin Ken\" outro bleeds over to skit on next track)", "image": "https://images.genius.com/5879836b504c477d7cddacb459c66e7c.776x768x1.jpg"}], "artist": "Too $hort"}