{"songs": [{"title": "Alphabet Bitches", "album": null, "year": null, "lyrics": "[Intro]\nSantana I see you, haha\nCitas's son!\nMama please don't be mad at me for this one\nBut I gotta tell my story...\nI had to do it\nCheck, my name is Weezy baby\nPlease say the baby\nIf you're not, don't say it at all\nThis is my story\n\n[Verse 1]\nWell, the A is for Ashley, she always ask for me\nTo take it out her pussy, put it right in her ass\nAnd the B is for Brittany, she right in the class\nShe be hating on Ashley, 'cause she tight in the ass\nThe C is for Christina want me to big screen her\nThe way she dick Kiss should be a misdemeanor\nSo if you seen her, I been searchin but can't find her\nEver since I been with Diamond with Diamonds in her vagiña\nAnd the E is for ever-elegant Erika\nSweet red bitch, we used to call her Miss America\nI ain't gon' lie, now, Erika is a dog\nAnd to them Magnolia niggas, she done fucked 'em all, Slim!\nSpeaking of Slim, the F is for Fat\nA real skinny ho so you know why they call her that\nAnd the G for Gabrielle, you can call her Gabby\nBut all my homeboys seem to call her \"Nasty,\" man!\n\n[Hook]\nThese are my bitches, my Alpha Bitches\nThese are my bitches, my Alphabet Bitches\nThese are my bitches, my Alpha Bitches\nThese are my bitches, my Alphabet Bitches (Geah!)\nI get bitches (say what), I get bitches (say who)\nI get bitches (say huh), I get bitches\nYou got (oh), you got (oh)\nYou got (oh), you got-oh!\n\n[Verse 2]\nH is for my H-town homegirl Heather\nHead, haze, purple, pussy, pills, forever\nMy mami's dedicated, aww, yeah\nShe neva tell me n\"o,\" the most she say is \"Not here\"\nAnd then, uh, I is for Isis, mami a Pisces\nShe fuck rappers for free, but hit them actors with prices\nThey always pay 'cause her body the nicest\nBut I hit that everyday, back when I had the wife-ahhhhh\nJ for Joanessa, kinda sexy with light eyes\nShe didn't make the band but she still doing quite fine\nThe K for Kia, I hate that bitch\nBecause she super fucking fine but she can't take that dick\nAnd then the L is for LaKia, that's Kia's twin\nNight and day, every time we fuck, I fall right in\nAnd the M is for Maria, María, Mariá\nShe hangs out with NeCole whose fucking Olivia, well!\n\n[Hook]\nThese are my bitches, my Alpha Bitches (Geah!)\nThese are my bitches, my Alphabet Bitches (Geah!)\nThese are my bitches, my Alpha Bitches (Geah!)\nThese are my bitches, my Alphabet Bitches (Geah!)\nI get bitches (say what), I get bitches (say who)\nI get bitches (say huh), I get bitches\nYou got (oh), you got (oh)\nYou got (oh), you got, oh!\n\n[Verse 3]\nP for Paulina she go all night\nIf I don't fuck her once a week, she pro'ly go on strike\nAnd the Q is for Queen 'cause she is my Queen\nNo, she can't ride it like Renata, but her body is mean\nAnd the S is for Shayna, a sucker in bed\nShe take advantage of the fact that I'm a sucker for head\nAnd the T is for Tara, too much mascara\nTone down on the blush, like you tryna scare us\nU for Ursula, she with Vicky\nThey both come over and work out with me\nThe W for Wanda, she kinda remind ya\nOf that game Street Fighter, hands like E. Honda\nThe Y for Yvette, she get wetter than most\nShe always tryna get high, but I just let her get low\nAnd last, but not least, the Z goes to Zara\nShe get high off zinfandel and masturbate to The Carter\nYeah!\n\n[Hook]\nThese are my bitches, my Alpha Bitches (Geah!)\nThese are my bitches, my Alphabet Bitches (Geah!)\nThese are my bitches, my Alpha Bitches (Geah!)\nThese are my bitches, my Alphabet Bitches\nI get bitches (say what), I get bitches (say who)\nI get bitches (say hanh), I get bitches (OH!)\nYou got (oh), you got (oh), you got (oh), you got oh! Ah!", "image": "https://images.genius.com/f903dae2533e450c8d3cb233aa846020.745x745x1.jpg"}], "artist": "Lil Wayne"}