{"songs": [{"title": "We Can’t Tell", "album": "Freshmen Adjustment Vol. 2", "year": null, "lyrics": "[Intro: Kanye West]\nEverywhere I go I'm a star, I'm a star\nDamn, Kanye, is that your car?\nEvery-everywhere I go I'm a star, I'm a star\nDamn, Kanye, is that your car?\n\n[Hook 1: Kanye West]\nNiggas reppin' the 'Go, but we can't tell\nYou claim you got hoes, nigga, we can't tell\nYou claim you got dough but we can't tell\nYou bought one pair of 1s at a two-for-one sale\n\n[Verse 1: Kanye West]\nPolitics kept me at the end of the mixtapes\nSo I dropped my own get-well-soon-from-sick tape\nThe drug game bulimic, it's hard to get weight\nSo niggas' money is homo, it's hard to get straight (Uh-huh)\nI'm trying to do numbers like Pac did\nBut it ain't Shakur, it's the brand new Roc kid\nNiggas wanna get me like they got B.I.G\n'Cause I moved up out the city and got big\nThat's the poison, that runs through their veins\nAnd attacks they soul and just start to tear 'em up\nNiggas talk so much shit about me in barbershops\nThey forget to get they hair cut (\"Where you goin'?\")\nOkay, fair enough, the streets is flarin' up\n'Cause they want gun talk, and I don't go there enough\nBut don't get it fucked up, you can still get your head bust\nI'm making way too much dough to be playing\n(I ain't playing with y'all niggas)\nAnd this is a classic in the making, history repeats itself\nHe do the rhymes and the beats himself\nThe only-child syndrome, make hits on his own (Uh-huh)\nAnd I'mma look in the mirror if I need some help\n\n[Hook 2: Kanye West]\nY'all bout to blow, man, we can't tell\nYou claim you got hoes, man, we can't tell\nYou niggas getting dough, dawg, we can't tell\nYou copped one pair of 1s on a two-for-one sale\n\n[Verse 2: Kanye West]\nI cop Ides by the case like Dirty\nI made it to the Power 30 a whole hour early\nI'ma pull out the shank and bang ya\nI'ma cut a nigga up like LL trainer\nThis is the future of the Chi\nThis is the legacy of Twista, the Flic' , and Do or Die (What up!)\nSo first of all who am I? (The fuck is you?)\nMy-my-my name is Kanye and not Kayne, bitch\nAt home like Cambridge, look at what I came with\nNo, none of that same shit, that new and improved\nNow, I don't know if it's me\nOr how yellow my Roc-A-Fella chain is\nBut I'm so live/smooth, there's nothing to prove (Ooh-OOH!)\n\n[Hook 3: Kanye West]\nYou niggas 'bout blow, man, we can't tell\nYou claim you got hoes, man, we can't tell\nYou niggas gettin' dough, dawg, we can't tell\nYou copped one pair of 1s at a two-for-one sale\n\n[Outro: Kanye West]\nEverywhere I go I'm a star, I'm a star\nDamn, Kanye, is that your car?\nEvery-everywhere I go I'm a star, I'm a star\nDamn, Kanye, is that your car?", "image": "https://images.genius.com/96319570be9d2165984a99be5ecf2edf.500x500x1.jpg"}], "artist": "Kanye West"}