{"songs": [{"title": "Scoop", "album": null, "year": null, "lyrics": "[Intro]\nI got a text message\nFrom one of my new hoes, she say she gotta go to New York\nThen after that she free\nThugga, Thugger!\n\n[Hook]\nMy lil mama say she know I stay G fresh (I'm G Fresh)\nWhen I get home she lay on my chest like a vest (Lay on my chest)\nShe like \"I was so clean but I'm a mess\" (I'm a mess)\nAnd I'm like \"Yeah you the best and that's a bet\" (That's a bet)\nI wanna go with you, you G fresh\nShe leavin' him for me like so what?\nI'm coming for you like I'm a vet\nI just might scoop up all of the rest\n\n[Verse 1]\nI might scoop her up like I'm a pooper scooper (Scoop!)\nI be like \"Girl stop playing, baby you know I knew ya\"\nI just might put my glasses on when I pursue ya\nShe got me going to church, now I say hallelujah\nBring that ass to the Thugger, bring that ass baby\nAnd you know I see straight through that ass like glass baby\nI turn into a monster without a mask baby (GAR!)\nYou know I'll be ya sponsor, I'll help you pass baby\nRollie Rollie, girl suck up my woadie\nI am loaded, there's no need to show it\nMy trap spot rolling like roly polys (Rollie Rollie)\nAnd I'll buy her a Focus cause she's focused (Thugger!)\n\n[Chorus]\nMy lil mama say she know I stay G fresh (I'm G Fresh)\nWhen I get home she lay on my chest like a vest (Lay on my chest)\nShe like \"I was so clean, but I'm a mess\" (I'm a mess)\nAnd I'm like \"yeah you the best and that's a bet\" (That's a bet)\nI wanna go with you, you G fresh\nShe leavin' him for me like so what?\nI'm coming for you like I'm a vet\nI just might scoop up all of the rest\n\n[Verse 2]\n(Instrumental)\n\n[Chorus]\nMy lil mama say she know I stay G fresh\nWhen I get home she lay on my chest like a vest\nShe like \"I was so clean, but I'm a mess\"\nAnd I'm like \"Yeah you the best and that's a bet\"\nI wanna go with you, you G fresh\nShe leavin' him for me like so what?\nI'm coming for you like I'm a vet\nI just might scoop up all of the rest", "image": "https://images.genius.com/717461618e785def35d07de6484b7ad4.1000x1000x1.png"}], "artist": "Young Thug"}