{"songs": [{"title": "When I Was Gone", "album": "My Krazy Life", "year": "2014-03-18", "lyrics": "[Hook: YG]\nWhen I was gone\nI heard you was fucking on whoever\nLove you again? I can never\nWhen I was gone\nYou tried to take advantage of a nigga\nHad me pull a hammer on a nigga. (on a nigga)\nThass' why you don't love these hoes\nThass' why you don't love these hoes\nThass' why you don't love these hoes\nThass' why you don't love these hoes\n\n[Verse 1: YG]\nI was....in jail wit' all niggas\nYou was waiting to exhale fucking wit all niggas\nMy momma said I should accept yo apology\nBut fuck that, that's just reverse psychology\nI don't love you no more, and I think you a ho\nYou let a nigga go too long, without no sto\nFor all my niggas doing time, I know how it get\nYo homies disappear, and yo bitch turn into a flip\n\n[Verse 2: RJ]\nOnce upon a time, I thought I found love but then she played me...\nI was gone..came back now my baby, having a baby...\nI know you was cheating, I was outta town eating\nBut real players we don't get mad, we get EVEN\nBut this is why I lost feelings, cause if these hoes ain't fully flipping, then they cartwheeling\n\n[Hook: YG]\nWhen I was gone\nI heard you was fucking on whoever\nLove you again? I can never\nWhen I was gone\nYou tried to take a advantage of a nigga\nHad me pull a hammer on a nigga. (on a nigga)\nThass' why you don't love these hoes\nThass' why you don't love these hoes\nThass' why you don't love these hoes\nThass' why you don't love these hoes\n\n[Verse 3: Tee Cee]\nShe got a nigga in here, dumb hot (dumb hot)\nTell a bitch, hurry up and send that green dot (aye)\nLeft a nigga in the dirt, now she like 7-Eleven giving free slurps\nI bought a celly from my cellmate, she don't even text a nigga no kind of sex-play\nAye fuck that bitch, I'ma have the lil home girls rush that bitch\n\n[Verse 4: Charlie Hood]\nI say my bail too high, my hopes too low\nMy case too slow, Violation from my P.O\nI just got out I shoulda just stayed on the couch, 3-way now my ho tryna cuss me out\nAnd my lawyer say the witness coming to trial, on top of that I heard my main bitch fucking around\nI'm banging and shit, my lady prolly selling her clit, no money on my books\nA nigga taking L'S wit this bitch!\n\n[Hook: YG]\nWhen I was gone\nI heard you was fucking on whoever\nLove you again? I can never\nWhen I was gone\nYou tried to take a advantage of a nigga\nHad me pull a hammer on a nigga. (on a nigga)\nThass' why you don't love these hoes\nThass' why you don't love these hoes\nThass' why you don't love these hoes\nThass' why you don't love these hoes\n\n[Verse 5: Reem Riches]\nIf I put my trust in a bitch, i'll always be hurt\nShoulda known you wasn't shit from that fake louie purse\nYou broke, dumb and goofy\nReally tried to boof me, you gone end up like ya mama a old ratchet hoochie\nYou couldn't stay down if you was nailed to the floor, three baby daddy's I ain't tryna be fo' (uh-uh)\nThass why I got no love for these hoes, sucka duckin', you be suckin all the bros...\n\n[Verse 6: Slim 400]\nWhen I was gone, I heard you was fucking on budda, hoein in the hood getting gudda\nWhen I was gone, heard you was hanging on the block...BITCH I don't like you on da block\nWhen I ain't home, you be doing hella ho shit\nThinking I ain't heard up in this bitch?\nRun my door, or I'ma pull a blade on you BITCH\nPen it 'till she blast on you BITCH\nAnd I ain't wrong...\nMy telly went big on the sto and you ain't even answer yo phone\nAnd now a nigga on, lost all respect for you bitch\nYou can burn, I ain't gonna spit on you bitch\n\n[Outro: YG]\nWhen I was gone..........", "image": "https://images.rapgenius.com/2282f97e6c03f2e3c9f2b1b983ce035f.600x600x1.jpg"}], "artist": "YG"}