{"songs": [{"title": "Queens", "album": "After Curtis", "year": "2007-12-07", "lyrics": "[Hook - 50 Cent]\nYou know for sure we ain't playin'\nWhen you hear us sayin'\nIt's a Queens thing, mayne\nIf ya ask us what zip we claim and what hood we from\nWe say Queens! Queens! Queens!\n\n[First Verse - Prodigy]\nNow we're tuned with the sounds of the best\nNiggas that ever do it and still doin' it the best\nThis is what it sound like, over in QU\nThe projects is haunted houses, real demons and ghouls\nYa shakin' in ya shoes, get some henny, light a dutch\nSmokin' back to back bogies, you scared to death son\nOut here is real tough, niggas'll line you up\nReal sharp like the barber, get your hair cut!\n\n[Second Verse - 50 Cent]\nI bang bang and boogie, ya blood on my hoodie\nYou outside stuntin' with ya jewellery all goodie\nIs easy, mayne, believe me mayne\nWhen I heard of a jux that'll ease the pain\nI'm the shittiest nigga, I cut the prettiest nigga\nFrom his ear to his chin, I don't care if you his friends\nYeah, I did it back then, and I'll do it again\nI catch a flashback on ya jack and wave the Mac 10, \"Man, Take That Shit Off!\"\n\n[Hook - 50 Cent]\nYou know for sure we ain't playin'\nWhen you hear us sayin'\nIt's a Queens thing, mayne\nIf ya ask us what zip we claim and what hood we from\nWe say Queens! Queens! Queens!\n\n[Verse 3 - LL Cool J]\nI don't slide like Usher, I don't make no bands\nI ain't a frontin' ass coward, I don't rinse soundscans\nI wish Rick 'n' Russell was back, I miss tha old Def Jam\nCos them new monkies act like they don't know who I am!\nThe promotion and marketing wasn't worth a damn\nNow they on the balls again, cos Fifty my man?!\nIt's a Queens thing, doofy, this is how we do\nWe rep our hood, goofy, how bout you?\nThis is L talkin' not some Patrón and trees\nLook at the calibre of playas that roll with me\nNow I'm back on top where I'm 'posed to be\nAnd ya'll payin' the respect that niggas owe to me\nQueens, nigga!\n\n[Hook - 50 Cent]\nYou know for sure we ain't playin'\nWhen you hear us sayin'\nIt's a Queens thing, mayne\nIf ya ask us what zip we claim and what hood we from\nWe say Queens! Queens! Queens!\n\n[Verse 4 - Kool G]\nYeah we Queens dude, ya know what it is pap\nThey walk upon you force you in the whip, barrels poked in ya ribs pap\nGlare from a six shot, bills wallin' the hiccup\nApes with a shaper from C76 block\nQueens home of the gulliest goons fuzzy the goon\nWith fifty calibre gun smoke, mac 1 and 1 toast\nBack when I slung dope, sling a batch\nStainless gat packed it back to the D.O.C. and the Run crew\nPlayed the P.E. logo, put in front of the gun scope\nQueens hear me boy boy, bring it here where they slump folks\nDizzy with the cateridge -n - ready on your marks you spin\nGot their hands shakin' like parkinson ya feel me?\n\n[Hook - 50 Cent]\nYou know for sure we ain't playin'\nWhen you hear us sayin'\nIt's a Queens thing, mayne\nIf ya ask us what zip we claim and what hood we from\nWe say Queens! Queens! Queens!\n\n[Verse 5 - Tony Yayo]\nMy seat laid back\nFinger on the trigger\nTints on the hoopty, listenin' to Thriller\n\"Mama se, mama sa, Mama coo sa\"\nI got sixteen shots in my Ruger\nI put one in ya brain, ya medulla\nI'm in Southside Queens with my Luger\nI'll turn ya dreams into nightmares like Kruger\nBut I'm not from Elm Street, I'm from GUY BREWER R\nYeah!\n\n[Hook - 50 Cent]\nYou know for sure we ain't playin'\nWhen you hear us sayin'\nIt's a Queens thing, mayne\nIf ya ask us what zip we claim and what hood we from\nWe say Queens! Queens! Queens!", "image": "https://images.genius.com/1eb2de96e05dcd13adf5f43852179122.953x953x1.jpg"}], "artist": "LL Cool J"}