{"songs": [{"title": "Real Bad Boyz", "album": null, "year": null, "lyrics": "[Intro]\nThug Life! Comin' straight out the West Coast\nReal Boy Killaz!\n2Pac with the Assassin, and we ridin' for the West Side!\n\n[Chorus]\nBad boy, bad boy, what you gonna do?\nWhat you gonna do? Watch out, we comin' at you\nBad boy, bad boy, what you gonna do?\nWhat you gonna do? We're comin' after you\nBad boy, bad boy, what you gonna do?\nWhat you gonna do? Watch out, we comin' at you\nBad boy, bad boy, what you gonna do?\nWhat you gonna do? Watch out, we comin' at you\n\n[Verse 1: 2Pac]\nI got these bustas on my block and they after me\nRunnin' 'round tellin' these niggas, how they gon' capture me\nIt's gettin' crazy, it's hard to make my mind up\nNow should I, buck 'em down, or put my nine up?\nYou see, I ain't a bad boy, just a boy who had it bad\nI graduated from 22's to 3-57 mags\nRunnin' on these marks 'fore they stashin'\nI ain't askin', give it up, or get to blastin'\nThe penitentiary don't scare me\nA straight thug nigga, the whole set'll take care of me\nAnd tell me, who the fuck you gon' find\nRough enough to tear these bitch-niggas, this is mine\nNow busta, meet my nine, 24 on the grind\nI'm sick about mine, and uh, ain't nothin' wrong with gettin' high\nA hustlin'-ass nigga from the projects, I'm makin' loot\nAnd screamin' Thug Life, nigga, when I shoot\nThey made me a (bad boy)\n\n[Bridge]\nBad Boys can't stop Thug Life, West Side when we ride, one time!\nBad Boys can't stop Thug Life, we gotsta keep on thuggin'!\nBad Boys can't stop Thug Life, West Side when we ride, one time!\nBad Boys can't stop Thug Life, we gotsta keep on thuggin'!\n\nFuck Bad Boy!\n\n[Verse 2: DJ King Assassin]\nI'm screamin' West Side ridah when we ride in a hoo ride\nSuicide 'til the day we die, gettin' high!\nFrom the Bay to LA, drinkin' Tanqueray and da Alize\nWhen we stay on the blocks, slangin' rocks, runnin' from cops\nWhen we runnin', we hummin', now gunnin' and you get done and\nIn the city wit' no pity, down wit' Thug Life, we doin' it live!\nEvery time we side on you trick made bitches\nPackin' a .45, recognize the game in yo' set\nBetta jet when I get you wet, wit' intention a' do or die\nHomicide, genocide to the other side\nWhen we glide wit' my nigga Pac we bustin' 'em niggas\nOn the block wit' Gangsta-D back up me you real OG\nComin' up outta the 7 Trees strick, .9 to the LHD\nWe claimin' to bring, we make 'em fiend\nFor the fact we havin' 'em stack on the map\nFor the city of Sac all the way to the ho' when we stroll\nPoppin the mos, outta killa California, straight loc' West Coast!\nThey made me a (bad boy)\n\n[Bridge]\nBad Boys can't stop Thug Life, West Side when we ride, one time!\nBad Boys can't stop Thug Life, we gotsta keep on thuggin'!\nBad Boys can't stop Thug Life, West Side when we ride, one time!\nBad Boys can't stop Thug Life, we gotsta keep on thuggin'!\n\nHahahaha!", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}