{"songs": [{"title": "Steel Ill", "album": "The Devil’s Night Mixtape", "year": "2015-10-30", "lyrics": "[Intro: Denaun]\nYeah, I said hospital bills, that's really real\nUh, uh, hospital bills, Kuniva's really ill\n\n[Verse 1: Kuniva]\nSomebody tell Mr. [?] to get the chains off the door\nYour highness, stupid and lower, and lower she on the floor\nI'm feeling her, Mr. [?], here for the nutter\nBrown paper bag pimpin' and I'm looking like \"what up?\"\nBoss hogging, shady niggas who's known for keeping it [diddly?]\nCutter's eyes, finger popping bitches on the steely\nWe get to cutting up like some Puerto Ricans\nYou can smell the stank on us like we outta Sequin\nPeep it, squeeze the heat to frequent, why not\nWhy blow up my spot? Cause y'all both got shot\nNow check it, feeling Nancy, still in the pantry, until I'm manly\nThat's not a punchline, I'm really feeling Nancy\nMe and the clique, we mobbing, performing Kama Sutra\nAll on your broad, while you in the booth sounding like Future\nWe fucking with condoms, we fucking with condoms, yeah\nWe fucking with condoms, we fucking with condoms, yeah\n\n[Hook: Denaun]\nAyo, hospital bills, that's really real\nWe actually still, clumsy with the bullets, man\nIs Mac really stale? (Yeah!)\nDoes nine really spill (Yeah!)\nI said, hospital bills, that's really real\nActually still, clumsy with the bullets, man\nDoes mine really spill\nI said Denaun's really ill (Yeah, yeah)\n\n[Verse 2: Denaun]\nAyo, niggas keep popping off\nBet I get his fam hit, lightning with the hands\nCredit it to the Shazam shit\nCrowds come from miles out just to see the man spit\nI can't send dick pics, the shit won't fit the bandwidth (whoo!)\nThe 19's backpack, fuck who you stand with\nPlay a couple jams that make you two [?] sit\nPack gats bigger than Shaq in a Kazam flick\nWe ran out of body bags, I'm hoping the Saran fit\nCall Olivia Pope, and Fitz, they won't get you damn wits of this hell sandwich\nI'm trying to learn to speak Español, yo\nMe and Han Solo went to a Bon Jo show\nWearing bucket jackets with Decepticon logos\nTransformer with the Upper Ashelon flow though\nThe nine's more sorta like Alonzo\nHead honcho, you're more like Gonzo in a poncho\nI am Carlito Brigante you are Donnie Brasco\nI am now with the Illuminati\nThey want me to sacrifice Ashanti\nWith the dagger of Asante, fuck it, uh, what, I got the knife\n\n[Hook: Denaun]\nAyo, hospital bills, that's really real\nWe actually still, clumsy with the bullets, man\nIs Mac really stale? (Yeah!)\nDoes nine really spill (Yeah!)\nI said, hospital bills, that's really real\nActually still, clumsy with the bullets, man\nDoes mine really spill\nI said Denaun's really ill (Yeah, yeah)\n\n[Verse 3: Bizarre]\n(Hahaha, yeah) Sexy male dancer\nBut I'm hardly working, Adidas and Nike suit on\nBut I'm steadily burping,  handicapped ugly bitch\nBut I'm steadily flirting, jacking off in the Walmart\n(Bitch, close the curtains!) Smoking dope with cab drivers\nI'm past tired, black [?] fire, the fat Michael Myers\nI'm at the bar, buying a lot of drinks, she said \"fuck Bizarre\"\nBut she eating a lot of shanks, be scared as hell\nShe think I'ma shoot, I ain't tryna get your number bitch\nI'm trying to get a booze\nBefore we fuck, I told her \"you owe me Slim Shady\"\nAfter I bust a nut? Bitch, you must be crazy!\nI'm on couple's therapy, popping pills and drinking gin\nI know it's a sin, but I'm attracted to men (Pause!)\nNo pause, a lot of balls, in my dirty ass jaws\n\n[Hook: Denaun]\nAyo, hospital bills, that's really real\nWe actually still, clumsy with the bullets, man\nIs Mac really stale? (Yeah!)\nDoes nine really spill (Yeah!)\nI said, hospital bills, that's really real\nActually still, clumsy with the bullets, man\nDoes mine really spill\nI said Denaun's really ill (Yeah, yeah)", "image": "https://images.genius.com/66678b06c44c6843cfd77955e8887e02.500x500x1.jpg"}], "artist": "D12"}