{"songs": [{"title": "Loco-Motive", "album": "Life Is Good", "year": "2012-07-02", "lyrics": "[Produced by No I.D.]\n\n[Intro: Kaye Fox & Hannah Sidibe]\nOooooh-ooooh-oooooooh\n42nd Street Terminal\n\n[Sounds of a subway train]\n\n[Verse 1: Nas]\nYo, yo, I live it and I speak it, my religion is reefer\nBig money and the most uninhibited freak to sleep with\nMy visions are realistic, nothing is figurative\nI can wish it into existing, God want this nigga to live\nBlunt big as a dread, I get high and forget who bled\nWho we stomp-kicked in the head and who we left for dead\nWho are you niggas? Why argue niggas?\nThe truth is the truth, I really put my scars on niggas\nThey wear them lifetime, they tell they hoes, Nas did this\nPointing to they scars like, right here, baby, really Nas did this\nLike a badge of honor, not bragging I'm just honest\nWar stories we tell them, nothing's realer than karma\nSip prohibition liquor, prohibition whiskey\nRap Jack Dempsey, matte black Bentley, pimply\nShattering your silence, passing round the chalice\nDue to my Indian ancestry at the weed dispensery\nOfficial kings and gents is who I mix and mingle with\nFuck your ice, I rock rubies, amethyst\nI'll fuck your wife 'cause she a groupie, scandalous\nThis for my bad hood bitches, ghetto glamorous\n\n[Break: Large Professor]\nYo, what we talking 'bout niggas?\nWhat we talking 'bout niggas?\nThis is Nas, what, Nas\nWhat, Nasty, what, recollect motherfucker\n\n[Verse 2: Nas]\nUhh, uhh, uhh\nAt seventeen I made seventeen thousand living in public housing\nIntegrity intact, repping hard\nThey asking how he disappear and reappear back on top\nSaying Nas must have naked pictures of God or something\nTo keep winning is my way like Francis\nAs long as I'm breathing, I'll take chances\nA soldier coming home, twenty years old with no legs\nSayin' there's no sense to cry and complain, just go 'head\nSo much to write and say, yo I don't know where to start\nSo I'll begin with the basics and flow from the heart\nI know you think my life is good 'cause my diamond piece\nBut my life been good since I started finding peace\nI shouldn't even be smiling, I should be angry and depressed\nI been rich longer than I been broke, I confess\nI started out broke, got rich, lost paper then made it back\nLike Trump being up down up, play with cash, huh\n\n[Break: Large Professor]\nMy nigga's like a locomotive\nNas, we pushed it, mush it\nQueensbridge to Bushwick\nHarlem, Bronx, all that\nYou ain't even supposed to be here\nYou know where you at?\n\n[Verse 3: Nas]\nAt night, New York, eat a slice too hot\nUse my tongue to tear the skin hanging from the roof of my mouth\nShit was felicissimo melting pot, city sweltering hot\nStaggering, drunker than those cops that 2Pac shot\nI was a crook by the train with that iron thing, concealed reaching\nSoon as I heard them iron wheels screeching\nWhen it came to a halt whoever walked off got caught\nToken man safe behind a locked door for sure\nMinor thief shit, minor league shit, beasting\nLooking for the juks young, but now we older chiefing\nIn my truck, play The Greatest Adventures of Slick Rick\nBugging on how his imagination was so sick\nIt's ghetto beef, sinister niggas snicker through yellow teeth\nAlcohol aging my niggas faster than felonies\nHow dare I, must be, something in the air that corrupts me\nLook at my upkeep, owned and sublease\nI'm here y'all\n\n[Outro: Nas]\nThis for my trapped in the 90s niggas\nFor my trapped in the 90s niggas\nHa for y'all niggas", "image": "https://images.genius.com/42dfcbed0061be8bd9c5bd7ae33a25c9.600x600x1.jpg"}], "artist": "Nas"}