{"songs": [{"title": "Mercy Me", "album": "A.I.R. (Art Imitates Reality)", "year": "2016-08-29", "lyrics": "[Verse 1: B.o.B]\nYo, I don't care who listening\nI find it kind of sickening\nWe send billions to Israel\nBut shit on Flint, Michigan\nA country, a country founded off of immigrants\nNow we wanna build a wall to keep out all the immigrants\nWhat, what, what, what you witnessing\nMilitary exercises demonstrated on citizens\nAnti-war petitioning, drone strike incoming\nHomeless vets decorate the street, can't get no income in\nHow do you save a world that can't be saved, uh?\nHow do you raise a child that won't behave? (Preach)\nWaking up from the lies, I feel betrayed\nI'm guessing the rabbit hole we dug was actually just a grave\nSkeletons in the closet, they fossilized\nNiggas want the truth sugar coated and caramelized\nLife is like a science fiction book where the author dies\nWell I ain't dead yet 'cause the hit ain't been authorized\n\n[Chorus]\nI hear freedom ringing but I won't answer the phone\nBecause the people on the other end will not leave us alone\nMr. Officer I come in peace, just know I brought my piece\nAnd if we can't settle this peacefully, the violence will increase, yeah\nI don't condone racial divide, I won't be cloned\nI will survive, I walk alone look in my eye\nSo give me justice give me peace\nOr give my freedom back at least\nSo we can meet up in the street, you decide\n\n[Verse 2: B.o.B]\nWho you bow to?\nElected councils, full of scoundrels\nWho now rule the world around you\nWhile wearing house shoes\nThey clown you\nYou wear your house, or your whole house full\nRegimes don't die; they change they name and the accounts move\nLife goes on with or without you\nWords fall on deaf ears, I think they soundproof\nThe sound of justice makes us cringe\nBut how can we stand the sound?\nYou can't even stand your ground\nA noose around your neck, the sharpest minds will cut it down\nCaught inside the web, the internet is tightly wound\nEvery day a hundred K? Feel more like a couple thou'\nWhat's a dollar to a pound? What's a pound to the crown?\nLook, ay\nI'm sick of waiting, man this flag I'm sick of waving\nNo more participating, time to form our own nation\nYou call it integration I call that discrimination\nThey say it's risk I'm taking, I call it decision making\n\n[Chorus]\nI hear freedom ringing but I won't answer the phone\nBecause the people on the other end will not leave us alone\nMr. Officer I come in peace, just know I brought my piece\nAnd if we can't settle this peacefully, the violence will increase, yeah\nI don't condone racial divide, I won't be cloned\nI will survive, I walk alone look in my eye\nSo give me justice give me peace\nOr give my freedom back at least\nSo we can meet up in the street, you decide\n\n[Verse 3: B.o.B]\nYou not an activist, you're more like a re-activist\nFalse flags, crisis actors trying to re-enact some shit\nStories don't match, I never believe half the shit\nWhile they're sneaking pass a law we're easily distracted, ay\nTrying to get through to these dense fucks\nYou're too stupid to insult\nI say the shit anybody can prove\nI don't know, guess if it rhymes it's got to be true\nLook, cheap tricks and fabricated speeches\nBlonde hair, blue eyes - they even fabricated Jesus\nJust look at the salary paid to teachers\nIt's obvious they don't want us to graduate into leaders\nClearly, in court videos don't prove much\nWhy is news cameras in the courtroom, huh?\nEven if it's just a game, I hear the signal louder\nI think I got the message, they don't really care about us\n\n[Chorus]\nI hear freedom ringing but I won't answer the phone\nBecause the people on the other end will not leave us alone\nMr. Officer I come in peace, just know I brought my piece\nAnd if we can't settle this peacefully, the violence will increase, yeah\nI don't condone racial divide, I won't be cloned\nI will survive, I walk alone look in my eye\nSo give me justice, give me peace\nOr give my freedom back at least\nSo we can meet up in the street, you decide\n\n[Bridge (x4)]\nOoh, ooh, ooh\n\n[Outro]\nFuck you Farmer Jim!\nYou're all alone out here on the frontier\nNo friends, no family, no cops, no help at all\nThis is the Wild West son, the Wild fucking West\nThere ain't no guards coming out here to save your ass\nIt's just you and me and a murder of crows\nWaiting to pick over our dead bones\nSo you take a breather\nYou let that sink in, don't take too long, yeah?", "image": "https://images.genius.com/3ae2b526282d97c82d4157e6d6a42e57.680x680x1.jpg"}], "artist": "B.o.B"}