{"songs": [{"title": "Throw Away", "album": "Monster", "year": "2014-10-28", "lyrics": "[Part I]\n\n[Intro]\nNard & B\n\n[Chorus]\nIt's gon' be okay, okay, oh it's gon' be okay (ok!)\nWell, my nigga we don't play but you gone be okay (FBG)\nI want no relations (no!), I just want your facial (right)\nI want no relations, I just want your facial (yeah)\nPour some alcohol and drank it baby, go and taste it (drank it)\nPour some alcohol and drank it baby, go and taste it (okay!)\nI want no relations (okay), I just want your facial (okay)\nGirl you know you like a pistol, you a throw away\n\n[Verse]\nWe gon' drank girl\nWe gon' drink like it’s Cinco De Mayo (and smoke!)\nI won't ever tell you anything your heart desires (aw nah)\nIt's gon' be okay okay girl it's gone be okay (wild-wild)\nI don't want no confrontation it's too complicated (fa sho)\nPour my lean for me baby you a hottie thottie (okay)\nI'ma fuck you in Atlanta like we on an island (yeah!)\nI can't lose my concentration girl\nI can't go on no dates (I can't go)\nIf we have a conversation gotta fuck today (woo!)\nI ain't disrespectful never\nI ain't disrespectful (I ain't disrespectful)\nGot a black girl and a white one\nCall em salt and pepper (aw gon')\nI copped one of em a Bimmer and one a Kompressor (skrr)\nI told her I would call her back and I forgot to text her\n(Free Bandz!)\n\n[Chorus]\nIt's gon' be okay okay oh it's gon' be okay (okay)\nWell, my nigga we don't play but you gon' be okay (FBG)\nI want no relations (no!), I just want your facial (right)\nI want no relations (no), I just want your facial (hey)\nPour some alcohol and drank it baby\nGon' and taste it (drank up)\nPour some alcohol and drank it baby, gon' and taste it (okay)\nI want no relations (okay), I just want your facial (okay)\nGirl you know you like a pistol, you a throw away\n\n[Outro]\nDJ Esco Moe City, the coolest DJ on the motherfuckin' planet\n\n[Part II]\n\n[Intro]\nDeep down\nI believe you know you're a monster too\n\n[Refrain]\nGo on, fuck that nigga, get it over with\nGo on, fuck that nigga, get it over with\nGo on, fuck that nigga, get it over with\nGo on, fuck that nigga, get it over with\nYeah-yeah, yeah yeah yeah\n\n[Spoken]\nFuture Hendrix\nI know your true feelings ain't...\nThey couldn't be here, you hear me?\nThey gotta be somewhere else\n\n[Chorus]\nBut I ain't worried 'bout no fucking\nI ain't worried 'bout no fucking\nDoes sexing on the late night mean that much to you?\nMy love don't mean that much to you\nFucking these hoes mean too damn much to you\nI just hope when you fucking on that nigga\nWhen you finished, he gon' say that he love you\nNow do you feel better 'bout yourself?\nDo you feel better by yourself?\nDid you feel better when I left?\nMark my words I'ma ball without you\nI came home last night to a ménage, ayy\nGot my dick sucked I was thinking about you\nI was fucking on a slut and I was thinking about you\nWhen you fucking on that nigga, hope you thinking about me\nWhen you laying with that nigga, hope you thinking about me\nCause I'm thinking about you\n\n[Refrain]\nGo on, fuck that nigga, get it over with\nGo on, fuck that nigga, get it over with\n\n[Verse]\nI want you to fuck him in paradise\n'Cause I wanna be in your head tonight\nIf loving me in public ain't safe\nYou can take my love in private\nDon't give up on me today\nHold on to me like a true love\nI told you it was a true love\nI ended up with temptations\nYou going out the country, you posting up on IG\nI'm laid up with my side-piece\nThe one that text while you was right there\nLaying up beside me\nNow tell me you don't want me\nTell me that your pussy ain't mines no more\nTell me your moving on, you don't love me no more\nMonster\n\n[Chorus]\nBut I ain't worried 'bout no fucking\nI ain't worried 'bout no fucking\nDoes sexing on the late night mean that much to you?\nMy love don't mean that much to you\nFucking these hoes mean too damn much to you\nI just hope when you fucking on that nigga\nWhen you finished, he gon' say that he love you\nNow do you feel better 'bout yourself?\nDo you feel better by yourself?\nDid you feel better when I left?\nMark my words, I'ma ball without you\nI came home last night to a ménage, ayy\nGot my dick sucked and I was thinking about you\nI was fucking on a slut and I was thinking about you\nWhen you fucking on that nigga, hope you thinking about me\nWhen you laying with that nigga, hope you thinking about me\nCause I'm thinking about you\n\n[Refrain]\nGo on, fuck that nigga, get it over with\nGo on, fuck that nigga, get it over with", "image": "https://images.genius.com/adc81ddb71fc3b8fc301fb13d3cb2324.500x500x1.jpg"}], "artist": "Future"}