{"songs": [{"title": "Mr. Nigga", "album": "Black on Both Sides", "year": "1999-10-12", "lyrics": "[Intro]\nSay ho, everybody say ho\nBy the way yo\nI said take it slow like way back in the day-yo\nBy the way yo, everybody say ho\nEverybody say hooooo- hooo\nEverybody say ho\n\n[Hook: Mos Def & Q-Tip]\nAnd check it out now\nWho is the cat eating out on the town\nAnd make the whole dining room turn they head round\nMr. Nigga, Nigga Nigga\nHe got the speakers in the trunk with the bass on crunk\nWho be riding up in the highrise elevator\nOther tenants who be prayin that he ain't the new neighbor\nMr. Nigga, Nigga Nigga\nThey try to play him like a chump cause he got what they want\n\n[Verse 1: Mos Def]\nHe under thirty years old but already he's a pro\nDesigner trousers slung low cause his pockets stay swoll'\nCould afford to get up and be anywhere he go\nV.I.P. at the club, backstage at the show\n(Yes y'all) the best crib, the best clothes\nHottest whips on the road neck and wrists on froze (say word)\nChecks with Os, o-o-o-o-ohs\nStraight all across the globe, watch got three time-zones\nKeep the digital phone up to his dome\nTwo assistants, two bank accounts, two homes\nOne problem; even with the Os on his check\nThe po-po stop him and show no respect\n\"Is there a problem officer?\" Damn straight, it's called race\nThat motivate the jake (woo-woo) to give chase\nSay they want you successful, but that ain't the case\nYou living large, your skin is dark, they flash a light in your face\n\n[Hook: Mos Def & Q-Tip]\nNow, who is cat dining out on the town\nMaitre'd wanna take a whole year to sit him down\nMr. Nigga, Nigga Nigga\nHe got the speakers in the trunk with the bass on crunk\nNow, who is the cat at Armani buying wears\nWith the tourists who be asking him, do you work here?\nMr. Nigga, Nigga Nigga\nNigga Nigga\n\n[Verse 2: Mos Def]\nYo, the Abstract with the Mighty Mos Def\nWhite folks gotta mumble the chorus beneath they breath\n(I didn't say it!)\nBut they'll say it out loud again\nWhen they get with they close associates and friends\nYou know, sneak it in with they friends at the job\nHappy hour at the bar, while this song is in they car\nAnd even if they've never said it, lips stay sealed\nThey actions reveal how their hearts really feel\nLike, late night I'm on a first class flight\nThe only brother in sight, the flight attendant catch fright\nI sit down in my seat, 2C\nShe approach officially, talking about, \"Excuse me\"\nHer lips curl up into a tight space\nCause she don't believe that I'm in the right place\nShowed her my boarding pass, and then she sort of gasped\nAll embarrassed, put an extra lime on my water glass\nAn hour later here she come by, walkin' past\n\"I hate to be a pest but my son would love your autograph\"\n(Wowwww.. Mr. Nigga I love you, I have all your albums!..)\nThey stay on nigga patrol on American roads\nAnd when you travel abroad they got world nigga law\nSome folks get on a plane, go where they please\nBut I go over seas and I get over-seized\nLondon, Heathrow, me and my people\nThey think that illegal's a synonym for negro\nFar away places, customs agents flagrant\nThey think the dark faces smuggle weight in they cases\nBags inspected, now we arrested\nAttention directed to contents of our intestines\nUrinalyis followed by X-rays\nInterrogated and detained 'til damn near the next day\nNo evidence, no apology, and no regard\nEven for the big American rap star\nFor us especially, us most especially\nA Mr. Nigga VIP jail cell, just for me\n(If I knew you were coming I'd have baked a cake)\nJust got some shoe-polish, painted my face\nThey say they want you successful, but then they make it stressful\nYou start keeping pace, they start changing up the tempo\n\n[Hook: Mos Def & Q-Tip]\nNow, who is cat riding out on the town\nState trooper wanna stop him in his ride, pat him down\nMr. Nigga, Nigga Nigga\nHe got the speakers in the trunk with the bass on crunk\nNow, who is the cat with the hundred dollar bill\nThey gotta send it to the lab to make sure the shit is real\nMr. Nigga, Nigga Nigga\nNigga Nigga.. Nigga\n\n[Verse 3: Mos Def]\nYou can laugh and criticize Michael Jackson if you wanna\nWoody Allen molested and married his step-daughter\nSame press kicking dirt on Michael's name\nShow Woody and Soon-Yi at the playoff game (holding hands)\nSit back and just bug, think about that\nWould he get that type of dap if his name was Woody Black?\nO.J. found innocent by jury of his peers\nAnd they been fucking with that nigga for the last five years\nIs it fair, is it equal, is it just, is it right?\nDo you do the same shit when the defendant face is white?\nIf white boys doing it, well, it's success\nWhen I start doing, well, it's suspect\nDon't hate me, my folks is poor, I just got money\nAmerica's five centuries deep in cotton money\nYou see a lot of brothers caked up, yo straight up\nIt's new, y'all livin off of slave traders' paper\nBut I'm a live though, yo I'm a live though\nI'm puttin up the big swing for my kids, yo\nGot my mom the fat water-front crib, yo\nI'm a get her them pretty bay windows\nI'm a cop a nice home to provide in\nA safe environment for seeds to reside in\nA fresh whip for my whole family to ride in\nAnd if I'm still Mr. Nigga, I won't find it suprisin'", "image": "https://images.genius.com/7e6832cab470314ffb530b255928573d.600x600x1.jpg"}], "artist": "Yasiin Bey"}