{"songs": [{"title": "Dead Wrong (Original Version)", "album": null, "year": null, "lyrics": "[Hook]\nThe weak or the strong, who got it going on?\nYou're dead wrong\nThe weak or the strong, who got it going on?\nYou're dead wrong\n\n[Verse 1]\nRelax and take notes while I take tokes of the marijuana smoke\nThrow you in a choke, gun smoke, gun smoke\nBiggie Smalls for mayor, the rap slayer\nThe hooker layer, motherfucker say your prayers\n\"Hail Mary, full of grace\"\nSmack the bitch in the face, take her Gucci bag\nAnd the North Face off her back, jab her if she act\nFunny with the money, oh you got me mistaken, honey\nI don't wanna rape ya, I just want the paper\nThe Visa, kapeesha? I'm out like The Vapors\nWho's the one you call Mr. Macho\nThe head honcho, swift fist like Camacho\nI got so much style I should be down with the Stylistics\n\"Make up to break up\" Niggas need to wake up\nSmell the Indonesia, beat you to a seizure\nThen fuck your moms, hit the skins to amnesia\nShe don't remember shit, just the two hits\nHer hitting the floor and me hitting the clit\nSucking on the tits, had the hooker begging for the dick\nAnd your moms ain't ugly, love, my dick got rock quick\nI guess I was a combination of House of Pain and Bobby Brown\nI was humping around and jumping around\nJacked her then I asked her, \"Who's the man?\" She said, \"B-I-G\"\nThen I bust in her E-Y-E (Yo Big, you're dead wrong)\n\n[Hook]\n\n[Verse 2]\n\nCheck the pain I inflict, like a convict, the Fulton digger\nJump in the Acura Vigor, after I stick ya\nRip ya like a razor, straight up Henny with no chaser\nWatch me erase ya, misplace ya\nPut you in the back with the derelicts, yeah, I pop plenty shit\nChump, I'm making hits, no time for the crack rock and shit\nTook it to another level\nNow I'm getting crazy papes, getting paid from the devils\nAnother amateur trying to damage the pedigree\nOf the B-I-G-G-I-E, you know it's me\nHoes, I thought you know I'm smooth as a baby's ass\nSmooth as Teddy Pendergrass, smoke the grass, get in your ass\nThe Brooklyn-born Teflon Don, wrecking shop\nGetting props, proving nobody drops\nWords as potent as the blunt smoking Bed-Stuy bandit\nAnd niggas just can't understand it\nI bust a cap for the brothers in Nap Nap, Comstock, and Clinton\nYou know my shit is hitting\nYeah, ya'll, a fly nigga, Biggie Smalls\nKicking flavor, make a nigga wanna dig up in their drawers\nFor the burner, catch a body, I got styles like karate\nJiu-jitsu, when I hit you then I split you\nLike a cantaloupe, hope you got a rope to hang yourself\nI rob for self; from Brooklyn, where else?\nFat like a Lexus coupe, I ripped your troop\nNot even Lois Lane could get the scoop\nWhat you think, I'm stupid? My crew is mad deep\nI hope you niggas sleep, huh, yo, Big, you're dead wrong\n\n[Hook]", "image": "https://images.genius.com/accf2df97375292b16f399ff6ec71e6e.500x500x1.png"}], "artist": "The Notorious B.I.G."}