{"songs": [{"title": "Whut I’ma Do Now", "album": "Malpractice", "year": "2001-05-22", "lyrics": "(We be kickin yo' fat funky ass, on WKYA)\n\nWhat I'mma do now, huh? What I'mma do now, huh, huh?\nWhat I'mma do now? It's all fucked up now..\n\n[Verse One]\nYo.. excuse me muh'fucka, I'm tryin to get through\nWhen Doc loaded, I'm like a STUD missile\nA STUD six-two, I'm huntin down hoes with\nNo drawers on and, buttoned down clothes\nDon't brownnose just join it\nEcstasy pills, with Buddha Man signs stamped on it\nJam on it, the +Blair Witch+ wouldn't camp on it\nI block and shine like suntan ointment\nYou do a dance when the lead is clipped in\nOnly dude with a bike with air conditionin\nFuck the Feds your door, Red'll kicked in\nSo prepare to wear SCUBA gear equipment\nI wet it, my tape underground leakage\nIt hit the air and you'll swear you found Jesus\nThe man who turned out the Summer Jam\nNot with a mic, I brrrrrrrrrrrr, tuck it in\nThe noise keep the helicopter hoverin\nYour boys is dead weight when I muscle in\nI need a +Hot Girl+, a +Ryde or Die+ chick\nMainly a hot chick ridin Funk Doc dick\nSmell it, when the odor airs in\nThe gorilla shit, hoes in polar bear skin\nThe chronic stink up the overhead bin\nWhen I.. yo, Redman struck again!\n\n[Hook]\nWhat I'mma do now, huh? What I'mma do now, huh, huh?\nWhat I'mma do now? It's all fucked up now..\n(\"Can y'all hear me out there?\" -] Puffy)\nWhat I'mma do now, huh? What I'mma do now, huh, huh?\nWhat I'mma do now? It's all fucked up now..\n(\"Can y'all hear me out there?\" -] Puffy)\n\n[Verse Two]\nNigga, we go - oops, upside your head\n+Simon Says+ leave you hogtied instead\nOn the floor with ya shirt like I dyed it red\nWild wild Bricks, eighty foot spider legs\nDoc in, double-oh, learned to drive it\nI'm, on the roof, guns under the armpit\nYellin out, \"Yo sawed off, hand on the pump\nAnd I'll pump a cannon first man that jump\" {*clik-clik, BLAM!*}\nI got a punch that'll cut your beard up\nDoc is like warm when you touch my earmuffs\nI wild out, throw blows\n_Somethin about Mary_ rode me in a Ford Explorer\nThe pressure at time five remind me\nThat y'all can't eat like it's Ramadan week\nMy mascot was built for kamikaze\nIf it fails, L.O.D. right behind me\n\n[Hook] - 2X\n\n(\"Can y'all hear me out there? Huh?\" -] Puffy)\n(\"Can y'all hear me out there?\" -] Puffy)\n(\"Can y'all hear me out there?\" -] Puffy)\n(\"Can y'all hear me out there?\" -] Puffy)\n\nI need some weed muh'fucka..\nWe need to smoke muh'fucka..\nWe need weed muh'fucka..\nWe need to smoke muh'fucka..\nLight it, roll it, light it up\nSay light it, roll it, light it up\nSay roll it, light it, light it up\nSay roll it, light it, smoke it up\nSay roll it, light it, smoke it up\nSay roll that, light it, smoke it up\nSay roll it, light it, smoke it up\nSay roll it, light it, smoke it up\nSAY ROLL IT, LIGHT IT, SMOKE IT UP\n{*farting noise* .. *track fades*}", "image": "https://images.genius.com/109a9fb9c91fad29c7f632fb053de1bf.1000x1000x1.jpg"}], "artist": "Redman"}