{"songs": [{"title": "Soopaman Luva 3", "album": "Muddy Waters", "year": "1996-12-10", "lyrics": "[Part I]\n\n[Intro]\nLook, up in the sky (SOOP-soop...)\nIt's a bird (SOOP-soop...)\nIT'S A PLANE!! (SOOP-soop...)\nNah motherfuckers (SOOP-soop...)\nHahaha\n\n[Verse 1]\nI was, flyin through the motherfuckin sky\nWith my blunt full of lye, boom-ba-zee on fire\nCode name beez the Soopa-Man cock my Luger\nBlast your state trooper, I'm on the run G\nI've got these hoes spreaded, from Japanese to diabetics\nToes stay painted because of my foot fetish\nYou damn right, they had to ban me from eatin pussy all night\nW-W-F'n bitches\nSlammin em in the rope like Shawn Mike\nI can't be touched bitch, I disco in kryptonite\nShit I'm broke as hell\nI had to buy all my girls fifty-fo'-eleven Reeboks at wholesale\nAlmost got caught boostin out of Modell's\nBitches on my coattails like they coat rails\nCan't even go in a jam without a bitch grabbin my hand\nAnd squeezin my ass sayin \"Youse the man!\"\nThat's who the fuck I be\nI got a, college degree, on bomb-zee and wreckin MC's\nMakin shit happen like Lil' Cease\nI come from a land of fonto leaf, bark from trees\nThat stick in your hand, and lakes rollin sea-weed\nCriminals be up to no good\nSo I tuck a heater\nBulletproof suit still in the fuckin cleaners, but anyways\nI bumped into my neighbor Johnny Blaze\nTold me there's a bitch up the block who got more cock than AK's\nThe bitch just moved in, in building 210\nRight next door to the Fantastic Four, and the Penguin\nGood lookin Johnny, five-oh's right behind me\nLet me act like I know and get ghost\nTuck in my Nina-Ross, get my cape and shades\nNow I'm off with the Soopaman Three antidote\n\n(\"While the planets and the stars and the moons collapse\")\nCause I am so cool\n(\"When I raise my trigger finger all y'all niggas hit the deck\")\nCause I am so cool\n(\"Cause ain't no need for that, hustlers and hardcore\")\nCause I am so cool\n(\"Raw to the floor, raw like Resevoir Dogs\")\nCause I am so cool...\n[Part II]\n\n[Verse 2]\nAiyyo word up *cough cough cough hack*\n*sniff* to make a long story short\n*cough cough cough* and shit, I went\nTo the bitch house, and this what the fuck happened\nAiyyo\nKnock knock, \"Who is it?\"\n\"It's the Soopa, here to pay that ass a visit heard you wasn't givin up\nYour pussy, so I got the right dick to get with\nWhere yo' man at bitch?\" \"He's out of town flippin biscuits\"\n\"Well open up the do' then, before I start unloadin\nOn your pussy from here and leave it swollen\"\n\"Aiyyo how I know it's you?\" \"Aiyyo check my credentials\"\n\"I eat yo' gun lead and shit out number two pencils\nI ate a ton of dog shit ain't never got sick\nBitch I even know how many keys your man flip\nI'm low down and dirty, but not ashamed\nI know all these pussy ass cops by their first name\nSmoked a pound of Purple Rain and kept control\nBitch I was the third nigga on the grassy knoll\nAnd you askin me, how you know it's the Soopa\nOpen the door, I just blast on state trooper\"\nShe opened up the door, and I walked in\nShe grabbed the hammer, and nailed it till I'm locked in\nI said, \"Yo whassup bitch? You must be trippin\nYou must wanna see how this thirty-eight be spittin\"\n\"Nah nah boo, it's my ex-boyfriend, he be buggin\nHe can't take it no more that I don't wanna fuck him\nI was gonna get this nigga Faride to snuff him\"\n\"Well if he come back through, I'm not talkin I'm bustin\nZip my zipper down bitch and start suckin\nGet your anus wet for long dick fuckin\"\n\"Oooh, I like the way you talk, just Put It In My Mouth\"\n\"Yeah, and I'mma keep that shit in when I'm comin\"\nFucked for thirty-six minutes and twelve seconds\n\"Can you hit it from the back?\" oh yeah bitch no question\nTurn that ass around, she had tattoos of names on her back\nShe said, \"I keep track\"\nI started readin her back I couldn't believe\nI read one name it said EPMD\nI turned her ass around I said no it couldn't be\nIt was the J-to-tha-A-to-tha-N-to-tha-E\nHer pussy walls grabbed my dick so I'm stuck\nSo I burnt that ass from that blunt hash that I lit up\n\"Owwwww!!\" She jumped up, puffed up, started yellin\nI smacked her, cracked her, put her in a full nelson\n\"Okay, okay, okay, okay, I give up\nBesides Soopaman Luva, I think I hear my nigga\"\nAiyyo car pulls up, he steps up *skreech* and stick his keys in\nThe door opened, I snatched him up for no reason\nGave him a two piece with a biscuit, laid him out\nOh shit, it was that nigga Parrish Smith!", "image": "https://images.rapgenius.com/0a74fbde446eaf49e1da1f4daae6845a.1000x1000x1.jpg"}], "artist": "Redman"}