{"songs": [{"title": "Violence", "album": null, "year": null, "lyrics": "[Intro: Proof]\nViolence\nTake one\nIf you hearing this, this a rough draft\nGot no business listening to us\n[talking]\n\nOn the real, listen\n\n\n[Verse 1: Proof]\nPut the streets in a niggas eyes\nPut the beef in a niggas mind\nPut his teeth on a killers nine\nNo remorse when i kill his mom, illest rhyme\nHit the panic button, keep the whole planet ducking\nStand for nothing, but fall from slugs\nI give it all for bugz\nDont make me call my thugs\nYeah, i'm a lady hitter, hit your moms and a babysitter\nA crazy killer\nSpit the house on your favourite nigga\nMy techs loud, slugs at your chest hard, through your vest guard\nGet your thresh and your neck scarred\nFeels the fire, your hear \"pop, pop\"\nAnd squeal and tire, run for the hills and higher\nGet your brand new gun, no you's (?)\nTalk loud, but get snuffed out\nBy hired men\nThat's what we do to you cowards\nI'm rolling off E, at your wake, smelling your funeral flowers\n\n[Hook: Proof]\nKill, smash, murder shoot\nRob, steal, hurt her, loot\nViolence, violence, violence, violence\nKill smash, murder, shoot\nRob, steal, hurt her, loot\nViolence, violence, violence, violence\n\n[Verse 2: Proof]\nPut your fingers in the blender, make them finger food\nBreak off a wing and chew, and drown you in a swimming pool\nI'm not a criminal, i haven't been caught, LAUGH!\nYou not a corner draft, chewing [?]\nMy pants down to my calf when i walk\nUntil the [?] kick my fucking ass when i talk\nDon't love nothing, dirty harry scare kids\nFuck work, school, shit and marriage\nA perilous terrorist, don't believe in sharing spit\nLike the sun and moon, and your air and shit\nOpen your score, like the glove my gun run out of\nClutch the 40, fuck a closet ain't got shit to come out off\nOne out of every nine MC's is sleeping with him\nFucking faggots, all savages beefing with Em\nBringing the D, and my hood is grimey\nY'all running like motherfucking shooks behind me\n\n[Hook]\n\nI miss happy birth, what?\nI live, so i'm back grabbing my privates\nScreaming \"DIE BITCH!\"\nI'm rough hided like nymphos with dry clits\nCan't none of ya'll see me like the back off my eyelids\nI'm why kids rebel and act up\nAnd all i wanted was a dick sucked and my back rubbed\nFlavor flav, shoulders with [?]\nI'm the resorter, sex, whiskey and mad drugs\nRaised by macks and pimps\nSmack a bitch on purpose (smack) shit then by accident (smack)\nUnload my gat and clips, i'm the imacculate\nYour vertebrae break bitch, when your back get bent\nCrack the fifth, and roll the hydro\n\"Slow down P!\"\n\"Bitch, i wanna die slow!\"\nSince kinder garden, wanted to be a [?]\nTo give my loving ass mama something to cry for\nI pack this violence and vile shit\nLove it when mature people call me childish\nGet your eyebrow ripped, \"throw in a [?] quick!\"\nToss a brown brick\nThrough your fucking moms crib\nAin't shitted on you in a while\nNow i'm about it\n\"do you know where hell is?\"\nI'm a kamikaze pilot\nDeath, i'm on a mission to find it\nPlus i'm half blinded\nSwallowing pills, i'm absent minded\nTaking E, vitamin C, until my spine split\n\"I DON'T SUCK DICK!\"\nQuit lying bitch\nI'm high as shit\nAnd the headphones ain't buzzing\nIt's the dirtiest shogun from Dirty Dozen\n\n[Hook]\n\n\n[Outro: Proof]\nWhat, what?\nShut the fuck up, Proof\nThis is Dirty Harry style\nWe ain't going nowhere", "image": "https://images.genius.com/a168ce2b6c86a86cfb53a6d996cdc8ca.304x400x1.png"}], "artist": "Proof"}