{"songs": [{"title": "​untitled 02 | 06.23.2014.", "album": "untitled unmastered.", "year": "2016-03-03", "lyrics": "[Intro]\nPimp-pimp! (Hooray!)\nPimp-pimp! (Hooray!)\n(Hooray!)\nPimp-pimp! (Hooray!)\nPimp-pimp!\n\n[Bridge 1]\nI'm sick and tired of being tired\nCan't pick a side, the Gemini\nProphesize if we live or not\nPromise momma not to fear nobody\nSeen black turn 'em Burgundy\nHundred of them, I know I'm greedy\nStuck inside the belly of the beast\nCan you please pray for me?\n\n[Verse 1]\nGet God on the phone\nSaid it won't be long\nI see jigaboos, I see Styrofoams\nMy hood going brazy\nWhere did we go wrong?\nI see jigaboos, I see Styrofoams\nGet Top on the phone\nTell the squad come home\nWe gon' ball again 'fore he call us home\nWorld is going brazy\nWhere did we go wrong?\nIt's a tidal wave, it's a thunderdome\nGet God on the phone\nI just got a raise (I just got a raise)\nSpent it all on me (I spent it all on me)\nDiamonds all appraised (Diamonds all appraised)\nAnd I'm bossing up (And I'm bossing up)\nBitch, get out the way (Bitch, get out the way)\nI'm the only way, we can fornicate\nAh, pimping and posing, look what I drove in, ah\nHaving these hoes and I know that I'm chosen, ah\nI live by the code and me and my bros and, ah\nMy dollars ain't foldin', you was never the homie\n\n[Bridge 2]\nSeen black turn 'em Burgundy\nHundred of them, I know I'm greedy\nStuck inside the belly of the beast\nCan you please pray for me?\n\n[Verse 2]\nGet God on the phone\nSaid it won't be long\nI see jigaboos, I see Styrofoams\nMy hood going brazy\nWhere did we go wrong?\nI see jigaboos, I see Styrofoams\nGet Top on the phone\n(What's up, my nigga?)\n\n[Verse 3]\nCornrow Kenny, he was born with a vision\nAll morning with the mixed dashboards, triple digits\nParallel park like an alien came visit\nSlideshow for the night show, ten bitches\nFind hoes with a blindfold, King Kendrick\n(Hello Billy)\nSo many plays on me I finesse\nPalisade views with some sex\nI lost a lot of love for missionary\nThis the first time I confess\nMe and Top is like a Kobe and Phil\nA father figure fuck with him, you get killed\nFuck with me and he will kill you himself\nTDE the mafia of the west\nMove in silence, yeah, we juggin’ like that\nAct of violence, yeah, we juggin’ like that\nI did a lot of dumb shit in my past\nLord forgive me, hoping I don't relapse\nDave just bought a new nine eleven\nAlmost thought I’d seen another plane crash\nQ just bought a brand new McLaren\nRock-a-lack about to buy the projects\nMoosa got his son dripping in gold\nAli 'bout to let his hair down on hoes\nMe, I'm 'bout to let my hair down on hoes\nTop billin', that’s a million a show\nMight blow the whole no whammy on Soul\nMight tell Obama be more like Punch\nSounwave caught a Grammy last year\nMack wop, bet he do what he want\nFuck you niggas, level two, I'm not done\n2Teez told me that I'm the one\nI can put a rapper on life support\nGuarantee that's something none of you want\nTen homies down and they all serving life\nWhat is like twenty-five hundred a month?\nWhat if I empty my bank out and stunt?\nWhat if I certified all of these ones?\nBitch I get buck, I'm as real as they come\nShit is amazing, I'm feeding my cravings\nYou know that you want me come here now lil' baby\nI'm fuckin, I'm crazy\nServing it like I belong in the basement\nOr live at the Days Inn\nYan Yan my relative, black cherry soda\nPistol and poverty, come get to know us\n(Get Top on the phone)\n\n[Outro]\nWho doing the drums?\nMan put that nigga on the drums man\nYep all day, Mortal Man and Kunta\nAlright, from the top!\n\n[Produced By Yung Exclusive & Cardo]", "image": "https://images.genius.com/45790022edf45dc9796e781a40cabb42.1000x1000x1.jpg"}], "artist": "Kendrick Lamar"}