{"songs": [{"title": "Paper Problems", "album": "Brick Factory: Volume 1", "year": "2014-05-26", "lyrics": "[Intro: Gucci]\nIt's Guwop, what's happening baby, what's going on?\nYea, 1017 MPA with me\nI got Thugga PeeWee know what I mean\nI ain't trippin' 'bout that shit, I'll pay for it\nRent it, how much it cost?\nTurn up, yeah you and your buddy\nGot a little something for ya\nIt's Guwop\n\n[Verse 1: Gucci]\nI'll pay for it, I'll pay\nI don't give a damn about\nI'll pay for it, I'll pay for it, I'll pay\nI don't give a damn, I'll pay for it\nIf you work real late, I'll stay for it\nNo problem 'bout it, I'll pay for it\nShe been working all day, working all week\nShe wanna freak with me\nAin't no problem cause I'm not cheap\nI got money all week I give her\nI got the money, I'll buy somethin'\nCall your friend, let's try somethin'\nShe like girls and boys, so she trisexual\nShe eat pussy, don't eat vegetables\nThat ass fat, it irregular\nIs it an ass shot, or did God bless her?\nShe a bad student on the 10th semester\nBut she give good head like the damn professor\nRed bottom pumps like Cinderella\nRed bottom pumps like Cinderella\nButt naked on some damn suspenders\nAin't gotta catch her out to impress her\nGucci Man, I'm getting money, got bad bitches on my itinerary\nBorn on the 12th of February\n12 diamond chains and they all canary\nAnd you're not a virgin, so don't act scary\nCause I'm not the one to bust your cherry\nIt's Gucci Man and I hip-hop\nBut I smoke guap like I got dreadlocks\n\n[Hook: Young Thug]\nI ain't really have a paper problem\nM-P-A in the building, I pay for it\nI ain't really have a paper problem\nIf you workin' overnight then I stay for it\nI ain't really have a paper problem\nIf I really, really, like it, I wait for it\nI ain't really have a paper problem\nI turn into a Christian like Ma$e for it\nI ain't really have a paper problem\nI ain't really have a paper problem\nI ain't really have a paper problem\nI ain't really have a paper problem\n\n[Verse 2: PeeWee Longway]\nI ain't really have a paper problem\nRock this shit the long way I'm talkin' about U.S. currency\nHell yea, I give you two hunna, give your ass three\nJust to make this shit a guarantee\nPayin' for the pussy ain't a problem\nBitch, you finna get a beatin gone off the seeds and molly\nI ain't really have a paper problem\nI tote a FN if I'm short damn right I'm robbin\nNo ski-mask, I already look like a goblin\nTake the guap, leave the work, boy give me the dollar\nLoad the cash up, smash off, in the Impala\nThugger, thugger, mad Max had to catch him a body\n(?) guap you know we having them dollars\n480 drop, I'm talking about the fuckin' Ferrari\nForgiato feet you know we had to shit on them people\nI'm (?) pockets full while I'm havin' (?)\nFuckin' up strip clubs, tryna lay on the (?)\nThey know I'm havin' real paper, suck like a mosquito\nBlowin' OG gas we don't smoke on Diesel\nGet (?) the ho back, (?)\nGot bricks down 10, sell (?)\nPlace your order, we'll pull up, stash spot in the Regal\nYou're havin' paper nigga, make sure you're straight my nigga\nCause them young nigga toting Desert Eagle\n\n[Hook: Young Thug]", "image": "https://images.genius.com/d65a023cc756026019052ee1eeb88c31.591x591x1.jpg"}], "artist": "Gucci Mane"}