{"songs": [{"title": "Throwdown 2000", "album": "My Soul", "year": null, "lyrics": "Chorus:\nAre you ready to throwdown?\nYes we are!\nWell, get on down like your 'posed to\nAnd shake your ass on the carpet like the old school\nAre you ready to throwdown?\nYes we are!\nWell, get on down like your 'posed to\nAnd give a loc a little dap when he walks through\n\nVerse 1:\nIf there be a dope beat then all y'all see\nGet up out your seat and let me see yo technique\nFreak yo physique and you betta not compete\nMake it hot and sweaty like twenty deep in a jeep\nNever comin' cheap, forty creep\nAnd I hope you don't mind if I borrow a few things while you go to sleep\nI steal money from the rich\nAnd give it to the poor, it's\nCoolio loco and ghetto witch doctor super, you are\nBring it from the back and bring it to the front\nCause you gotta give the people what they want\nNow hump, do the stomp to the butt\nBig homie shake your gut\nAs long as you get your ass up\nIt's a party over here\nAnd let me make it clear\n40 Thevz is the crew\nSo you better come anew\nAin't a damn thing change since the first one\nAnd if you didn't hear the album go get one (One)\n\nChorus:\nAre you ready to throwdown?\nYes we are!\nWell, get on down like your 'posed to\nAnd shake your ass on the carpet like the old school\nAre you ready to throwdown?\nYes we are!\nWell, get on down like your 'posed to\nAnd give a loc a little dap when he walks through\n\nVerse 2:\nHere come the thief on the old school beat\nAnd I never knew the meaning of the word \"defeat\"\nThe master of disguise wanna see the people's eyes\nYet, fools try to deny that the ?man? can fly\nJust cook 'em all up like gumbo\nAnd block their ass like Mutumbo\nCause your album dropped off the charts like Dumbo\nWe are new and improved to make you put on your boogie shoes\nLike K.C. and the Sunshine Band, or the Wu-Tang Clan\nI go way back like Vegas, Nixon, Noreaga\nIt's the tennis shoe players fat box on the quiet station\nNow what if hip hop was like Humpty Dumpty sittin' on the wall\nAnd what if hip hop had to take a great fall\nAnd what if rhyme was a crime\nAnd each and every time\nThat you spit a dope line\nYou might have to do some time\nMost of these clowns will be tryin' to skip town\nBut Coolio will be ready for the showdown\n\nChorus:\nAre you ready to throwdown?\nYes we are!\nWell, get on down like your 'posed to\nAnd shake your ass on the carpet like the old school\nAre you ready to throwdown?\nYes we are!\nWell, get on down' like your 'posed to\nAnd pass a joint to the loc when he roll through\n\nVerse 3:\nIf the shoe fit, put it on and stick\nAnd if your ass uncash don't let your mouth write no check\nFools be in the bars unadvanced with a switch\nUppercuts and fight kicks with Weird Al Yankovich\nFrom Tokyo to Sojo, rollin wit the 4-0\nThis hip hop that I'm holdin' I'll make it move your ho\nIt's the Vandino, everything but rhyme's broken\nBreakin' a nigga with first position at the open\nYou can't understand how I do it\nI'm just true to it\nI let my pen flow across the paper like it was made affluent\nUh, let it ring, let it rip\nEverybody holler like Marvin Gaye, but don't you let the record skip\nSynchronize the watch, cause the party don't stop\nTill the neighborhood watch call the cops\nIt's the wild ass festival, coast line veteran\nOnce again droppin' bombs on yo section (On yo section)\n\nChorus:\nAre you ready to throwndown?\nYes we are!\nWell, get on down like your 'posed to\nAnd shake your ass on the carpet like the old school\nAre you ready to throwdown?\nYes we are!\nWell, get on down like your 'posed to\nAnd pass the brew to the loc when he roll through\nAre you ready to throwdown?\nYes we are!\nWell, get on down like your 'posed to\nAnd shake your ass on the carpet like the old school\nAre you ready to throwdown?\nYes we are!\nWell, get on down like your 'posed to\nAnd give a loc a little dap when he roll through\nFool!", "image": "https://images.genius.com/8b2afc0b2ec12b84597cab495ffdf0e1.600x600x1.jpg"}], "artist": "Coolio"}