{"songs": [{"title": "Can I Live", "album": "Oz: The Soundtrack", "year": null, "lyrics": "[Intro:]\nCan I make money motherfucker? (Yeah)\nIs that alright wit'chu? (No doubt)\nCan I travel? (Word, Skull & Bones)\nCan I have a nice motherfuckin car? (Hell yeah)\nThank you (KnowhatI'msayin)\n\n[Hook]\nCan I live? (Yeah)\nCan I live - can I live?\nCan I live - can I live? (Yeah)\nCan I live - can I live?\nCan I liiivve?\n\n[B Real]\nCan I live, who willin to give me applause?\nHalf note, gotta get mine and open the doors\nI want a FAT crib, on the hill, after my tours\nI need a fine woman, cuz I ain't fuckin wit yours\nCan I live? I wanna take care of my fam\nAll the haters can't fade us, they don't know who I am\nYou gonna learn soon baby, when my heat'll expand\nWhen I slay suckers everytime, I foil the plan\nCan I live? Why not? I'm makin it hot\nLike the rubber gets when I start rockin the spot\nDAMN! She gotta have it in the parkin lot\nBetter come get her cuz she's still in my knot\nCan I live? Get your hand out of my pockets\nI'm buck-nutty, tear your arms out of the sockets\nPeople wanna talk no matter how much I rock it\nPull my dick out, run about for niggas who jock it\nCan I live? -- Can I live? [--[4x]\n\n[Hook]\n\n[Sen-Dog]\nCan I live? Livin life under the scope\nTryin to hang with the leader, let me give you a rope\nAll them Mexicali niggas always lookin for hope\nAfter one turns, bitch-niggas learn not to coke\nCan I live without any battles to face?\nHell no, I gotta war when there's paper to chase\nThe story for the glory's never without a race\nI'm like an animal huntin blood, I need a taste\nCan I live? Critics never leave me alone\nIn my hood, I was always taught to go for the dome\nI'm the Dog never show you where I bury my bones\nTake your title then I leave your ass without a throne\nCan I live, how come you don't show me your love?\nGotta catch yo' ass slippin like I'm wearin a glove\nSuckers wanna push me and I'll give 'em a shove\nCuz busters always act brave up in the club\n\n[BR] Can I live -- Can I live? [--[4x]\n\n[Hook]\n\nNa-na-na -- Na-na-na\nNa-na-na -- Na-na-na\nNa-na-na -- Na-na-na\nNa-na-na -- Na-na-na\n\n[B Real]\nCan I live? I know you won't give me the freedom\nCuz your kids come, but you don't want me to lead 'em\nWhen I spit words for refrain people will heed 'em\nWanna find ways to shut me up and get me to eat 'em\n\n[Sen-Dog]\nCan I live, is it an impossible mission?\nI break it down for all those who ain't seein my vision\nAll you suckers gotta live with, every descision\nYou a train wreck, comin up on the collision\n\n[B Real]\nCan I live? Basically I'm tired of games\nYou wanna walk around talkin, tryna fuck up my name\nBut when the scandal comes though you can't handle the shame\nWhen you see me, know your thinkin how to explain\n\n[Sen-Dog]\nCan I live? I bring yo' ass over the hump\nWe tryna get money so we can be livin like Trump\nYou can't slap that cuz you fall into a slump\nDon't test me I still got my \"Hand on the Pump!!\"\n\n[Hook] 2x {*second hook w/ B Real in background*}\n\nNa-na-na -- Na-na-na\nNa-na-na -- Na-na-na\nNa-na-na -- Na-na-na\nNa-na-na -- Na-na-na\n[Repeat]", "image": "https://images.genius.com/f54811c2c7f54daa594c3e3b8adb0293.200x196x1.jpg"}], "artist": "Cypress Hill"}