{"songs": [{"title": "Real Hip Hop", "album": "Bar Exam 3: The Most Interesting Man", "year": "2010-05-30", "lyrics": "[Intro: Robot Voice]\nMr. Porter has asked me to warn you that this next joint may harm your speakers\n\n[Verse 1: Royce Da 5'9\"]\nIf this ain't real hip hop nigga tell me what it is then\nWalking sci-fi cyborg, my image is\nNapalm, translation, you tampon bleed\nLike the opposite of mankind\nTryna put your hands on my damn rod\nYou might as well handstand on a land mine\nIf I ain't bout that, let adversity hurt me\nLike if I ain't bounce back, all I do is count stacks\nYou can't put me and flames in the same quote\nBeast on the track, me and Usain Bolt in the same boat\nMention me and lightning in the same volt\nCrqckers amphibian, I'm a handful\nGuns give you suntans like a Pakistan Indian, pop shit\nQuick enough to snatch a fly out the air with some fuckin' chopsticks\nUh-uh-uh, nigga, who hotter than me?\nI'm on a million dollar-AK-hollering spree (Nickel!)\n\n[Verse 2: Black Milk]\nIf this ain't raw shit, then nigga, I'm lost in the game\nAnd that means everyone remains comin' with that soft shit\nThis is that dark flow, caught up in the alley walking\nLike Losing Out Pt. 2 without Alan Parsons\nTake precaution, the percussion is danger\nThese niggas feelin' anger, like ever since we came up\nMy circle always come prepared\nWhile other cats is like a plaid shirt, all I see is a bunch of squares\nHave a bunch of Leers out in London on stage\nWatching hands to the ceiling while rocking in front of fans\nYeah we so in here, so advanced, so far into the future\nCopping grands these nigga won't comprehend\nThis game looks wide open in my eyes\nSo of course I took it and ran with it like a baton\nAnd passed it to my fam, the legacy lives on\nFuck bein a hundred deep, we're trying to be a mil strong\n\n[Verse 3: Elzhi]\nIf this ain't hip hop, like Dickies and flip-flops\nOr Phillies and Timbos, the Willies with trimmed fros\nYa'll silly as bimbos and hillbillies, still illy with them flows\nMy skill really shine like gem stones\nIn Beverly Hills, feel me?\nNew sheriff in town, the flair with the sounds\nSince rap was lost in the mainstream\nBut who care if it drowns\nMy brain scheme is complex like the magazine\nSwagger's mean like gang related rags and jeans\nTag a scene, smack machines, make the maggots lean\nI drag machines like blunts from outta bags of green\nOn Dud's stash! So playa I pull the stud's math\nThose in power get golden showers and bloodbaths\nIn shitstorms, I spit thorns and pierce through\nThe nearest crew, who never knew I was fierce, but\nFear is true with the clearest view\nThey grim and hate, and imitate what they hear us doin'\nImmolate, I'll demonstrate how their spear flew\nTo higher ground and came down like a parachute\nFor fucking with me, Royce, Black, and June\nWe'll lay you on your back in black lagoon\n\n[Outro: Royce Da 5'9\"]\nIf this ain't real hip hop\nWhat the fuck is it then?", "image": "https://images.genius.com/f26afa0e15f73eb0b5cef561ec304c68.450x450x1.jpg"}], "artist": "Royce da 5'9'’"}