{"songs": [{"title": "Tree of Life", "album": "These Days…", "year": "2014-04-18", "lyrics": "[Part I: Produced by Curtiss King]\n\n[Intro: Audra the Rapper + Ab-Soul]\nQuiero vivir como los árboles\nBreathe easy!\nTrees, trees, trees\nSoul!\nI just wanna—I just wanna—\nLT3 shit, nigga, look\n\n[Verse 1]\nI just wanna live like the trees\nShoot the breeze, stay around some leaves, you nah mean?\nBut I'm about to go on tour\nCan't wait for wind, pollination to plant my seeds in the soil\nAround '07 TDE struck oil\nIt's my turn, Mr. LongTerm of turmoil\nI'm holdin' up the terminal takin' flicks\nI'm irritated but they're the reason that I'm gettin' rich\nCheese, give me an upgrade, see\nThen I'll be on my way, I'm on my way to NYC\nLast time I was there I swear I sold out SOBs\nIn Times Square with my circle of G's, you nah mean?\nYou shoulda never gave us niggas money\nWe comin' for everything, you nah mean?\nFuck you niggas with your hands out\nSuck my third leg while I branch out\n\n[Hook]\nCause I just wanna live like the trees\nShoot the breeze, stay around some leaves, you nah mean?\nBut this money got me on the run\nAnd it don't grow on trees, I'm tryna get me some\nGet me some, get me some, some, some\nGet me some, get me some, some, some\nGet me some, get me some, some, some\nShit don't grow on trees, breathe easy!\n\n[Verse 2]\nI got most of you mothafuckas stumped\nRap like I go to church with work in the trunk\nLord forgive me but my pennies turnin' into dubs\nI'm losin' my sense, they say I changed up\nAnd I don't feel no different, I'm still the same nigga\nMaybe my brain's bigger, gettin' brains quicker\nUsed to cop a little deuce\nNow I cop a whole case of Actavis to give Sprite stock a boost\nAb-Soul, yeah I'm gettin' loot\nBitches walkin' bow legged out my dressin' room\nWas at the Travelodge but now we at the W\nJust to shower, be out in an hour, I got shit to do\nPlenty empty Backwood packs in your face\nAnd my backpack more OG than your hood, dang\nHey, can't live without the Benjamins\nBut I'm interested in photosynthesis\n\n[Hook]\nCause I just wanna live like the trees\nShoot the breeze, stay around some leaves, you nah mean?\nBut this money got me on the run\nAnd it don't grow on trees, I'm tryna get me some\nGet me some, get me some, some, some\nGet me some, get me some, some, some\nGet me some, get me some, some, some\nShit don't grow on trees, breathe easy!\n\n[Bridge]\nMe and she sittin' in a tree\nK.I.S.S.I.N.G\nFirst comes love, then comes marriage\nFuck that! I'm just tryna get up in your panties\nWhere the trees, trees, trees\nWhere the trees, trees, trees, trees\nBurn the mothafuckin' trees, trees, trees, trees\nWith the trees, trees, trees, trees\n\n[Interlude: Joey Bada$$]\nIt's still world domination\nKeep a Backwood and a mothafuckin' eighth and\nAlways got the trees, so what the fuck you mean\nI ain’t about to rise to the top with my fuckin' team\nNigga it's still world domination\nKeep a Backwood and a mothafuckin' eighth and\nAlways got the trees, so what the fuck you mean\nI ain’t about to rise to the top with my fuckin' team\n\n[Break: Ab-Soul]\nHeaven ain't far Curtiss, it ain't far at all my nigga\n\n[Verse 3: Ab-Soul]\nCheck, Joey I know I told you, quote it in a verse\nBut we called it the third eye when it could really be the first\nWha gwan Jah no rassclat me\nI took it to heights these parasites can't see\nRarely do I bark, hope you get the analogy\nTop Dog embarkin' on the whole industry\nNiggas get to bitin', I be like breathe easy!\nYour cardiovascular isn't fast enough\nI'm Canibus smokin' cannabis, sippin' Actavis\nBefore the Mathers diss I used to work at Magic Disk\nWith a dollar and a dream, why you think money is green?\nColor of vegetation, the most important thing\nTrees\n\n[Outro]\nGimme some, gimme some\nGimme some, gimme some\nGimme some, gimme some\n\n[Part II: Produced by DJ Dahi]\n\n[Intro:]\nAyo, Dahi, what' up, my nigga? Drop that shit!\n\n[Verse 4: Ab-Soul]\nUh, I feel like I'm finished Soul searching\nI feel like I know my sole purpose\nColder than a Winter Solstice\nYou're a dope dealer if you sold this\nYo, Soul everywhere if you ain't notice! (YEAH!)\nSolar power, solar system, told you so\nYou was a compartment in your car, you couldn't console (YEAH!)\nKnown to consolidate hope into those listenin'\nNothing but facts and tracks I'm solicitin'! (YEAH!)\nSoul Plane, Soul Train, those are no-brainers\nSoul so thick, to defeat me would be amazing\nA day and a half, in these 8 and a halves\nI solidify why I’m the greatest to rap (Soulo!)\nTop Dawg soldier, hoes call me Soulo (YEAH!)\nI left America with a bottle of Soul Glo\nSo everywhere Soul go? Soul gon' shine\nEverybody knows like Beyonce and Solange!\nUh, what the fuck is Soul on?\nWe really out here but we ain't at the Salon\nLook, a pair of Persols that cost like fo'\nKid from Del Amo, with a flow that's so universal... Soul!\n\n[Outro]\nOh-oh yeah and I'm the soul-lution nigga!\nSoul-lute me!\nThat was a stretch...\nI'm Ab-Soul-lutely the best\nYeah!", "image": "https://images.rapgenius.com/cb1bb40f9887286c25594887ebdb5daf.600x600x1.jpg"}], "artist": "Ab-Soul"}