{"songs": [{"title": "The Finest", "album": "Operation: Doomsday.", "year": "1999-04-20", "lyrics": "[Intro: MF Doom]\nAs the life cycle goes on ... goes on\nAnd you learn to hold on (hold on)\nTo things like the mic ... the mic\nAnd you learn to appreciate who is the nicest on said device\nBut who is (The finest)\n\n[Verse 1: Tommy Gunn + MF Doom]\nTommy Tashuma, too much drama, blind behind the rumor\nTime and time and time, my mind, I'm trying to find a tumor\nTommy Tashuma, no time for humor\nAs soon as one of ya' men's dead in Hempstead, you trying to find Pumas\nSooner the better, even knitted a sweater already\nKeep your leather, we coming through the brutal weather\nWe ready to do whatever, yo' Doom you with it?\nYou know it like a poet, my brother\nHey, Gunn you wit it? Whatever... [the finest!]\n\n[Verse 2: MF Doom]\nI know about going paid to broke, to next day well-off\nTo bust a shell off, to dick-riders: \"Get the hell off\"\nMade a call to a client, he must've had his cell off\nA show-off, he has the same bike Puff fell off\nI tell off the bat, from science to pure facts\nWhich niggas is wack 'til they last two tracks\nMatter fact, y'all could wait for the rep to tell\nThe tall-tale, how he escape from out the depths of hell\n\n[Verse 3: Tommy Gunn]\nWhen die, he gon' die like a soldier die:\nHolding a swollen eye, drinking Olde Gold\nSmoking a stog, watching po-po patrol the beach\nBlowing my high, rolling by, when Gunn die\nHe gon' try to preach the streets then go to the sky\n\n[Verse 4: MF Doom]\nYup! That hold water, like drizzle in a paper cup\nThis one etched in stone, the chisel with the paper up\nI need a cut: a taper-up, edge-up\nNiggas can't measure up, I'm here to get the treasure up\n\n[Verse 5: Megalon]\nStands up and hold 'em high, do or die\nHe got heat, no surprise, stop the beat, close your eyes\nGot the weed, rolling lah\nNot sweet, so no demise, all the guys drops seeds so multiply\nWithin the prophecies hold the lie\n\n[Verse 6: MF Doom]\nHe bled my mother and my father, but can't bleed me, OD\nGhetto misery, he bled my brother, my sister, but can't bleed me\nA OG, ghetto misery, bled my mother, my father, but can't bleed me\nSci-Fly, whole style stuck up\nUsed to talk to myself, I told him, \"Shut the fuck up!\"\nBuckle up, cause it's about to be rough\nHe said, \"Keep talking that shit, you 'bout to be snuffed\"\nThen we squashed it, I let em know: \"Watch it --\nWe only met a time to join these rhymers in the mosh pit\"\nGosh, it feels great just to increase the chance\nFor a pussy nigga face to hit the dance floor\n\n[Verse 7: Megalon + MF Doom]\nI pull ya' top up, got clout, crack rock, what?\nNow it's all good business, and so this bitch is locked up\nOn the dance floor: you got knocked out, your bitch got knocked up\nBaby-face, and hey can you brand you, brand new machete\nDamn, I just shook your hand and can't stand you already\nCan't stand you, understand you deadly\nBut my hammer's like a band, my man, it's Brand New and Heavy\nYo' Doom, you ready?\nYeah! Yo' Gunn, you with it?\nWhatever\n\n[Verse 8: MF Doom]\nCome on stay, I wrote this rhyme on my born-day\nRemind me of the same style I flipped on \"Hey!\"\nYikes! Who can fuck with the likes\nOf one such who scores touchdown and spikes mic's\nMetal grill, with many styles, better still\nFeel like number 26 on a roulette wheel\nAnd deal, and run rings around rhymers\nAnd run rings like number runners whose old-timers\n\n[Verse 9: Megalon]\nShorty in the all black, she think she all that\nI called her, she said, \"Don't call back!\"\nShe called me, now what you call that?\nLet's go back, I sold crack\nHold gats, smoke that, drink that, toke that\nFuck! Where that ho at? Where that dough at?\n\n[Verse 10: MF Doom]\nSuffering succotash! This hooker broke into his last buck of cash\nHe love her, motherfuck her ass\nMetal feet dented your car fender\nMy agenda up in the basement party tipping the bartender\nIs unbeknownst to you -- who could get body blown?\nMF like Mike Fran Corleone\nAnd got it sown, maricon, like to know what you staring at?\nAn invisible cat, who pull off a disappearing act\nRaised by a pack a wild womens like Sweetback\nFront? I'mma be back! (Like brothers in the street act)\n(Surrounded by a bunch a bad bitches like Sweetback)\n(Fuck with me I'll be back)\nLike niggas in the streets act (streets act!)\n\n[Outro: Sample]\nOf black misery\nThe finest", "image": "https://images.genius.com/c0a80e3098696bdf600f54a76667c069.1000x1000x1.jpg"}], "artist": "MF DOOM"}