{"songs": [{"title": "Mainstream Ratchet", "album": "B.O.A.T.S. II #METIME", "year": "2013-09-09", "lyrics": "[Intro]\nLast night I fucked a supermodel\nGot head on the way home\nShe left her other friends at the club\nGot home, and I fucked her with my J's on\n\n[Chorus]\nAnd that's ratchet, huh?\nHer ass so big it look like she trying\nTo walk backwards bruh\n(Woah, bring it back)\n\n[Verse 1]\nTake your bitch like I'm the dog catcher\nTake your ass to the mall after\nSpa day, shawty, kill that pussy, pallbearer\nYou from that RuPaul era, I'm from that hell nah era\nReal niggas say tru, real niggas ain't you\nI ride around with that yapper on me\nGun-clad with my Glock up on me\nSurround your ass with so many shots you'll be claustrophobic\nCrib so big a dinosaur can run through that shit\nI'm a shark, and you a tuna fish\nMy paper up, got your girl with her ankles up, gangsta boy\n\n[Bridge]\nShe got her T-shirt and her panties on\nShe trying to smell my cologne\nI can fuck her anywhere I want\nI even fuck her on the floor\n\n[Chorus]\nAnd that's ratchet, huh?\nHer ass so big it look like she trying\nTo walk backwards bruh\n(Woah, bring it back)\n\n[Verse 2]\nI'm on top like a toupée, you on the side like a toothache\nBox your ass, suitcase; I'm real, you ain't\nCalamari, crab cakes, my closet the size of your dad's place\nYou lookin' at a star, I wish that they could add space\nI'm getting money, fast pace\nMy hoes gay and my cash straight\nHe can't ball, he castrate, she the opposite of last place\nDo it, bust it open, slow it down, Robitussin\nMy girl got a big ass, your girl got back pockets touching\n\n[Bridge]\nI want it all, I want everything\nBalls out, I let 'em hang\nWindow shopping for a wedding ring\nWent on a double date with Molly and Mary Jane\n\n[Chorus]\nAnd that's ratchet, huh?\nHer ass so big it look like she trying\nTo walk backwards bruh\n(Woah, bring it back)\n\n[Verse 3]\nIf you pat your weave that's ratchet, my last album was classic\nShawty on my dica, backwards spells acid\nShe pop a P like a Xanny, she'll use no hands and no panties\nShe rock like nose candy, you fuck with me, ain't no plan B\nI'm a D boy with a degree, I sold dope in my momma's home\nMy girl pussy deep deep, so right there is my comfort zone\nBorn alone, die alone, mud in my styrofoam\nShe got on top of me like a stage, I said use my dick as a microphone", "image": "https://s3.amazonaws.com/rapgenius/UMG_cvrart_00602537507474_01_RGB72_1500x1500_13UAAIM70647.1200x1200-75.jpg"}], "artist": "2 Chainz"}