{"songs": [{"title": "Wall Street", "album": "The Bar Exam 2", "year": "2008-09-20", "lyrics": "[Intro] [Royce talking]\nYou are now rocking to the sounds of my dawg. DJ Green Lantern\nBar Exam 2 nigga. It's a motherfuckin' holiday bitches\n\n[Verse One] [June the Great]\nI slang hope to the world like my name was Obama\nShakin' hands with your father while I'm fuckin' yo momma\nDrama\nBut I'ma say I'm in a league of my own\nBlowin' my own horn\nHorns of my cousin, Chevy in Texas\nI had to shout him out he's from the south\nGot pussy with me for my brother when he get out\nNo doubt\nIt goes one for the money\nTwo for the show\nThree for the M.I.C. now let's go\nJune's flow is pro\nTurn my speakers up louder\nLearn my shit\nThen recite it up in the shower\nNo homo\nYeah, peep my promo on behalf of the Bar Exam 2\nThis is my message from me to you\nThey'll probably be happy when I'm long gone\nBut that'll never happen cause I got way too many songs\nMC's take note, but don't quote too much\nFind your own style and get 'mo in touch\nPlus\nPussy make the world go round and mine spinnin' out of control\nWhere I'ma stop, nobody knows\nYou don't want me close to ya\nScared I might roast ya\nBut if I should stop, then who these streets gonna toast to?\nHere's the book of life, I just wrote you a new page\nInspired by the beat, by the smell of my purple haze\nHey, Grand River niggas up to no good\nJune 1st\nI bring you all closer to my hood\n\n[Chorus]\nWall Street\nWall Street\nYeah, yeah\nUh huh\n\n[Verse Two]\nMy appetite for destruction\nMy type to do the bustin'\nI eat the beat up like I got an appetite for percussion\nLighten the mood like it's night and there's moonlight\nPlatoon, high on them shrooms but this ain't no food fight\nWitch\nI could fly on a broom stick to my rude type\nMy crew don't be 'bout no excuses, gesundheit\nGod bless you, sneeze\nI'll wet you, sleeves\nYour arms ain't like ours yet, our recipe is...\nBeef on a platter\nGo on and chatter, it don't matter\nMy cheese, I'm eatin' like I'm obese but only fatter\nI only know how to do it the Harriet Tub way\nI'm Underground like the Railroad, I'm prepared to get ugly\nMy narrative thug day, can only compare me to drugs\nI take a nigga way from him like Jared from Subway\nYou, could, never ever be on my level\nYou don't know what you're in\nBut you're in/urine guns like I took a pee on my metal\nJust me and my shuttle\nWe fly\nWe go together like my feet and my petal\nWe ride\nHow could I not be greatest?\nWhen I got Muhammad Ali boxin' inside me in Vegas\nAye\nHaters\nI just wanna say this\nI know I'm underrated\nBut I ain't under paid when it comes to makin'\nMoney\nI'm so hot I feel like the son of Satan\nI'm so hot I feel like the sun is hatin'\nYour bitch\nHhhhuhhhhuhhhh\nBreathin' like a hundred H's\nI am the reason for your under takin'\nThere's only one equation\nAnd it equals I am the sum of greatness\n\nYeah, yeah\nUh huh", "image": "https://images.genius.com/5b0c99ea857e85f30c22aa344281f869.320x320x1.jpg"}], "artist": "Royce da 5'9'’"}