{"songs": [{"title": "Your Life’s on the Line (Alternate Version)", "album": null, "year": null, "lyrics": "[Intro]\nNobody likes me\nNobody likes me, but that's okay\nCause I don’t like y'all anyway\nMan, I don't like y’all anyway\nFuck all y'all\nI let my watch talk for me, my whip talk for me\nMy gat talk for me, blow, what up, homie?\nEven bitches who don't know me, they wanna blow me\nCause the shit I floss with is saying a lot for me\n\n[Verse 1]\nI came in the rap humble, I don't give a fuck now\nI'll serve anybody like niggas who hustle uptown\nCoke price go up, capsules come down\nThe D's run in my crib, I'm nowhere to be found\nNiggas who hustle for me they don't even stash crack\nThey keep it on ’em, right there in they ass crack\nThe way these cats move confuse me, but it’s all good\nPuffy ran up on Steve, why you ain't ran up on Suge?\nI’ma ask you these questions cause I don't understand\nCheeks, why you ain't show to Ty's wake, I thought he was your mans\nJigga stay away from Ja before he get on some bullshit\nTalk to police on that Sammy the Bull-shit\nHey pussy Ja, why you get juxed in ya own hood?\nWhy niggas who rob you walk around like it’s all good?\nDamn, why you ran to 'Preme to get your shit back?\nWhy you won't approach me? cause you know I'll push your shit back\n\n\n[Hook]\nScream murder, I don't believe you\nMurder, fuck around and leave you\nMurder, I don't believe you\nMurder, murder your life's on the line\n\n[Bridge]\nY'all niggas don't want no parts of me\nI'm trying to figure out how y'all started me\nYou gon' make me catch you on the late night\nPop shots with the fifth and slide off in the six\n\n[Verse 2]\nJa, when I don't like a nigga, I don't pretend to\nI'll have the paramedics wrappin' ya fuckin' head like a Hindu\nNas said he half-man, half-amazin'\nYou half-X, half-Pac, that ain't hot\nNigga, I ain't goin' nowhere so get used to me\nOGs look at me and see I'm what they used to be\nI'm the nigga that sell coke, the nigga that sell dope\nThe nigga that shot dice, went broke and sold sope\nThe thug that pop shit, the thug that pop clips\nThe thug that went from three and a half to a whole brick\nNigga ain't in his right mind going against me\nMy picture's painted the words that make a blind man see (bitch)\n\n[Hook]\nScream murder, I don't believe you\nMurder, fuck around and leave you\nMurder, I don't believe you\nMurder, murder your life's on the line", "image": "https://images.genius.com/00e54097cf27e0d3ebe9f07785101c68.440x440x1.jpg"}], "artist": "50 Cent"}