{"songs": [{"title": "Rapp Snitch Knishes", "album": "MM.. FOOD?", "year": "2004-11-16", "lyrics": "[Intro: Mr. Fantastik & (MF DOOM)]\nYo! (Yo!)\nMF DOOM (Mr. Fantastik)\nMr. Fantastik (Villain)\nWhat up, nigga? (Ain't nuttin; what's the word?)\nWhat's cracking, boy? (Same ol' shit, kid)\nMan (Different day, you know?)\nThese rap snitches, man, shit is bugged out, man\nWhat the fuck, man? (Shit, you telling me)\nNiggas running their mouth, telling e'rything, e'rything (critical)\n\n[Hook: Mr. Fantastik]\nRap snitches, telling all their business\nSit in the court and be their own star witness\nDo you see the perpetrator? Yeah, I'm right here\nFuck around, get the whole label sent up for years\nRap snitches, telling all their business\nSit in the court and be their own star witness\nDo you see the perpetrator? Yeah, I'm right here\nFuck around, get the whole label sent up for years\n\n[Verse 1: Mr. Fantastik]\nType profile low, like A in Paid in Full\nAttract heavy cash cause the game's centrifugal\nMr. Fantastik, long dough like elastic\nGuard my life with twin Glocks that's made out of plastic\nCan't stand a brown nosing nigga, fake ass bastard\nAdmiring my style, tour bus through Manhattan\nPlotting, plan the quickest, my flow's the sickest\nMy hoes be the thickest, my dro the stickiest\nStreet nigga, stamped and bonafide\nWhen beef jump niggas come get me cause they know I ride\nTrue to the ski mask, New York's my origin\nPlay a fake gangsta like a old accordion\nAccording to him, when the D's rushed in\nComplication from the wire, testimony was thin\nCaused his man to go up north, the ball hit 'em again\nLame rap snitch nigga even told on the Mexican\n\n[Hook: Mr. Fantastik]\nRap snitches, telling all their business\nSit in the court and be their own star witness\nDo you see the perpetrator? Yeah, I'm right here\nFuck around, get the whole label sent up for years\nRap snitches, telling all their business\nSit in the court and be their own star witness\nDo you see the perpetrator? Yeah, I'm right here\nFuck around, get the whole label sent up for years\n\n[Verse 2: MF DOOM]\nTrue, there's rules to this shit, fools dare care\nEverybody wanna rule the world with tears for fear\nYeah, yeah, tell 'em tell it on the mountain hill\nRunning up they mouth bill, everybody doubting still\nInformer, keep it up and get tested\nPop through your bubble vest or double-breasted\nHe keep a lab down south in the little beast\nSo much heat you woulda thought it was the Middle East\nA little grease always keeps the wheels a-spinning\nLike sitting on twenty threes to get the squealers grinning\nHitting on many trees, feel real linen\nSpitting on enemies, get the steel for tin men\nWhere no brains but gum flap\nHe said his gun clap, then he fled after one slap (pap!)\nSon, shut your trap, save it for the bitches\nMmm, delicious, rapp snitch knishes\n\n[Outro: Mr. Fantastik & (MF DOOM)]\nYou know what I'm saying? (It's terrible)\nCrazy, man, I'm just analyzing this whole game\nThis is bugged out, man, niggas is snitching\nTelling on they own self (it's a horror, yo)\nFuck around and get everybody bagged, man\n(Atrocities) Fuck around and get yo mama bagged, nigga\nYou know your grandmama used to be bootlegging\nFake hustling nigga, heheheheh, haha\nPerpetrator? Yeah, I'm right here...", "image": "https://images.genius.com/f67af5eb94d7101171adfff4ca96a76c.1000x1000x1.jpg"}], "artist": "MF DOOM"}