{"songs": [{"title": "SOPA", "album": "Control System ", "year": "2012-05-11", "lyrics": "[Produced by Nez & Rio]\n\n[Intro]\n(Soulo taught me...)\nSee, yeah, my nigga, see\nSee yes this where sci-fi meets swag, my nigga\nLike, like, like the Holy Bible in a Gucci Bag, my nigga, swag\n['Cause I'm swagging on 'em]\n\n[Verse 1: Ab-Soul]\nOh you the kid, I'm Joseph Kony\nChip off the block, since puffy socks in my Saucony\nI touch stock, she suck cock\nShe dancing Secret Sundays and I'm 'bout to prey\nI'm smoking dope, I'm smoking dope\nShe got that magical vaginal, let me hocus poke\nRow, row, row my boat gently down your stream\nShe into Alexander McQueen but she ain't met the king\n(Soulo, Soulo, Soulo, Soulo) kiss the fucking ring ho\nTDE we got the belt, hold it down if nothing else\nAnd this is my new single, cut the cheese it's bout to melt\nLean in my cup, pinky up like Dr. Evil (zip it)\nCurrently we seeing deeds like Adam Sandler\nScHoolboy Q, OG, and dirty pineapple Fanta\nAnd I ain't never been a mothafuckin' lick\n'less I'm right around the clit, druggys with hoes, O's and 4's\n\n[Hook]\nI'm smoking dope, yo, could smell it on my clothes\nSOPA tryna censor internet, we tryna get this dough\nI said look back at me when you hit the pole\nSwag so mean, on them fucking hoes\nI'm smoking dope, yo, could smell it on my clothes\nSOPA tryna censor internet, we tryna get this dough\nI said look back at me when you hit the pole\nSwag so mean, on them fucking hoes\n\n[Verse 2: Schoolboy Q]\nOh, that's your bitch? Well, bruh, she on me\nI made her lick my sack, then work the top, then fuck the homies\nGot the block hot, cause I set it off\nNo I'm not Weezy, bitch, I'm wheezy from that chronic cough\nYeah, I'm smoking dope, you can smell it in my beard\nHave no fear, saviour of the gangster rap is fucking here\nWord around town, SOPA tryna shut it down\nHow that sound? I'm from the underground\nThey gon' make me slang a pound\nFigg Row (Figg Row) Figg Row (Figg Row)\nBitch, what you know about Figg Row? (Figg Row)\nThis is original gangster, uh, uh, uh, yeah\nSmoke it, shoot it, sniff it, smell it, inhale it, sip it, whatever\nJust mix dope with your flavor uh, uh, uh, yeah\nIn interviews they always asking me about a list\nKnowing damn well I'm looking like I'm slinging bricks\nEver see an ex-student get a half a ticket\nThink I'm lying, just ask Jimmy\nThat check was mine as soon as we signed\n\n[Hook]\nI'm smoking dope, yo, could smell it on my clothes\nSOPA tryna censor internet, we tryna get this dough\nI said look back at me when you hit the pole\nSwag so mean, on them fucking hoes\nI'm smoking dope, yo, could smell it on my clothes\nSOPA tryna censor internet, we tryna get this dough\nI said look back at me when you hit the pole\nSwag so mean, on them fucking hoes\n\n[Verse 3: Ab-Soul and Schoolboy Q]\nSoulo ho! Groovy Q!\nI'm high as fuck, nigga me too\nWon't pass the weed, but I'll pass a bitch\nFendi on, I might throw a fit\nDeadline, hoodie on like Trayvon\nHeard it through the grapevine\nWe got extra pills, lean and shrooms\nLife for me is just weed and brews\nDon't stop! (Get it, get it) Don't stop! (Get it, get it)\nDon't stop! (Get it, get it, get it, get it)\nDon't stop! (Get it, get it) Don't stop! (Get it, get it)\nDon't stop! (Get it, get it, get it, get it)\n(Soulo taught me...)\n(Soulo taught me...)\n(Soulo taught me...)\n(Soulo taught me...)\n(Soulo taught me...)\n(Soulo taught me...)\n(Soulo taught me...)\n(Soulo taught me...)\n(I, I don't smoke, I, I, no, no, no)\n(Soulo taught me...)\n(put that camera down)\nPuffy just walked in damn\nAww damn homie shut it down damn nah nah (ay don’t smoke) nah nah (put that shit down)\nNah shut down with that lean homie that shit nah\nThe camera’s off ay gimme three cups cuz shit gimme some shit I ain’t quit nigga\n(Ay the camera's on, give me some, ok, yeah)\n(give me some)\n(Yeah, I ain't quit nigga)\n(Oh what the fuck... )", "image": "https://images.genius.com/36147c3e9b6fcfa747233bb1c340f424.500x500x1.jpg"}], "artist": "Ab-Soul"}