{"songs": [{"title": "On And On", "album": "On and On and Beyond - EP", "year": null, "lyrics": "[Intro]\nUh-huh! Hey, 'scuse me son, can I see your identification? Hey\n\n[Hook]\nI wanna walk into the mall\nTell the man, \"I'll take it all\" (Hey)\nDrop it from the rooftop, (Hey) what’s gon' break my fall? (Hey)\nI think I might go on and on forever (I might go on and on)\nI think this could go on and on forever (Hey, hey, it go)\nI wanna walk into the store (What?)\nBuy everything and more (More)\nTravel around the world (Yeah)\nTo places I ain’t been before (Mac Miller)\nI think might go on and on forever (ID Labs)\nI think this could go on and on forever (Ah-ha!)\n\n[Verse 1: Mac Miller]\nI’ve been ridin' in my car with the music all the way up\nSee me shinin', I'm a star, take a picture, see you later\nI’ve been dreamin' of some crazy shit and every time I wake up\nGotta head back to reality but reality is greater\nThan you could ever imagine, you say that you cooler\nBut I'm more better at rapping, I'm forever the captain\nI'll be making music out of joystick, thumbs up\nJoint lit, y'all get what the point is\nBaby, I'm here, I ain't going nowhere\nAll these haters say I'm fakin' but I really don't care\nGot my teammate right beside me, you know where to find me\n'Burgh representative, I need y'all behind me cause it's all about the\n\n[Hook]\nI wanna walk into the mall (Mall)\nTell the man, \"I'll take it all\" (All)\nDrop it from the rooftop, what's gon' break my fall? (Fall)\nI think I am going on and on forever (On and on)\nI think this could go on and on forever (On and on)\nI wanna walk into the store (Store)\nI'll take everything and more (More)\nTravel around the world in places I ain’t been before\nI think might go on and on forever (On and on)\nI think this could go on and on forever (On and on, hey, hey, hey, hey)\n\n[Verse 2: Mac Miller]\nOne day I'm gonna get mines too\nAnd I think that's sometime's soon\nWhatever you got in your crib, I'm gonna get it times two\nIf I win or lose, what the fuck I gotta prove?\nI've been livin' out my dream everything I saw came true\nTravel on a tour bus for screamin' fans\nI got a stellar reputation, girl be who I am\nI'ma be the man, son, connectin' people everywhere\nLike Samsung, gotta shoot around the back, alley-oop and one\nThis the championship game, you ready, yo?\nYou don't sound ready, better scream it just to let 'em know\nMy teammate right beside me, you know where to find me\n'Burgh representative, I need y'all behind me 'cause it's\n\n[Hook]\nI wanna walk into the mall (Mall)\nTell the man, \"I'll take it all\" (All, hey)\nDrop it from the rooftop, what's gon' break my fall? (Hey, hey, hey, it goes like, hey)\nI think I am going on and on forever (And it goes like that)\nI think this could go on and on forever (On and on, uh, uh)\nI wanna walk into the store (I wanna die with my thumb real high)\nBuy everything and more (Said I'ma die with my thumb real high)\nTravel around the world, places I ain’t been before\n(Said I'ma die with my thumb real high)\nI think I might go on and on forever\nI think this could go on and on forever (Hey, can I see ya ID? Hahahahahaha)\n\n[Outro]\nThis how it goes... gotta make sure everybody knows... when it comes to the flow... fuck y'all, man", "image": "https://images.genius.com/3dbc59f7d6090f2f7e786fc2a26fb245.953x953x1.jpg"}], "artist": "Mac Miller"}