{"songs": [{"title": "Grateful", "album": null, "year": "2018-11-16", "lyrics": "[Verse 1: Snoop Dogg]\nNo more wrong and I'm tryna do right\nThank God for my kids and my lovely wife\nThe life I used to live, I had to leave it alone\n'Cause my backbone was 'bout to get it alone\nWhat's a man to gain the world and not share?\nEverything I went through helped me prepare\nFor the day that I talk like this\nAnd I'm sure that Jesus walked like this\nIt's a fact though, exacto\nRewriting my rap flow\nCome as you are, I'm posted up at the backdoor\nChurch panic, I'll be making the plans\nKissing their babies and shaking their hands\nMan, God gave me my life back then He brought my wife back\nI'm suited and booted, praising His name\nThrough my trials and tribulations, I'm grateful for everything\n\n[Chorus: Tyrese]\nI'm so grateful\nI'm so humbled by Your love\nOh why\nWhere would I be without Your love?\n(Where would I be without Your love?)\nSaid I, said I owe it all to You\nSaid I, said I owe it all to You, Father\n\n[Verse 2: E-40]\nUh\nYou the truth\nYou always have had my back like a masseuse\nWhen I was funkin' on the gravel\nYou would always fight my battles\nThe beginning, and the end, the most high\nI'm hoping I get to meet You when I die\nYou the only one make me cry\nEspecially when we don't see eye to eye\nWhen I hear the choir sing and the preacher preach\nAnd the missionaries speaking in tongues, my aunties, uh\nTrials and tribulations\nAll you need is the faith of a mustard seed, be gracious\nAnd Lord, I'm grateful for my kids\nAnd my soulmate, my rib\nGotta be strong, never be weak\nGet on your knees and thank God you on your feet\nTalk to 'em Tyrese\n\n[Chorus: Tyrese]\nI'm so grateful\nI'm so humbled by Your love\nOh why\nWhere would I be without Your love?\n(Where would I be without Your love?)\nSaid I, said I owe it all to You\nSaid I, said I owe it all to You, Father\n\n[Verse 3: Tyrese]\nI thank God for my life\nMy wife and my children\nI thank God\nSaid I owe it all to You\nOh, I thank you, Jesus\nOh, I thank you, Jesus\nFor protecting my whole family, yeah\nLord, I know I could've been dead and gone\nBut You're not done with me\nOh, baby\nThank You for sparing my life, Jesus\nIt means that You're not done with me, yeah, oh\nOh, baby\nOh, whoa, whoa\n(Where would I be without Your love?)", "image": "https://images.genius.com/6ab56e822b070f85a1f0a9f7207bf8cd.256x256x1.jpg"}], "artist": "Snoop Dogg"}