{"songs": [{"title": "Rewind That", "album": "Nobody’s Smiling", "year": "2014-07-22", "lyrics": "[Produced by No I.D.]\n\n[Chorus]\nRewind that one time please\nRewind that one time please\n\n[Verse 1]\nShould it be, can it be simple?\nLife is like the tempo of a No-I instrumental\nThings that we been through define who we are now\nSince \"Can I Borrow a Dollar?\"\nOoh, I'm a star now, coming from Chi-town\nWe was the first to do it\nMe, No I.D., Twilite Tone on the music\nThe city on our back, we was the opening act\nThrow our tapes in the crowd, they throw 'em right back\nBut we stayed on track, they stayed on the tracks\nI stayed on the raps 'til we made it on the map\nBy then, No I was my main guy\nHe and I was like Chi-town's Gang Starr\nWe had came far together, with a long way to go\nSeeing a bigger picture, but now from different angles\nTangle of the hustling, survival in the game\nFelt I had to leave home to be a household name\nShow money low, needin' to stack fast\nCity did have my back, now it's a backlash\nWas I a slave to the cash and wanting it so bad?\nI just became a dad, rap was all I had\nSo I moved to New York, to make it pop\nDid Like Water for Choc, that album changed a lot\nBut my man who I started with, wasn't a part of it\nAnd his presence I didn't even acknowledge it\nKnew I was wrong, he shoulda at least had a song\nIt wouldn't be me without No I.D., and Twilite Tone\nWishin' I could get that time back\nOh I can, yo man, rewind that\nMe and Dion back in the zone, I'm doing shows with Tone\nFor the future of the Chi we gon' bring it back home\nRewind that and we could do it again\nNo I.D., Twilite Tone, where the story begin\n\n[Chorus]\nRewind that one time please\nRewind that one time please\n\n[Verse 2]\nThis one's for my man J Dilla\nAs I say these words, my eyes fill up\nCuz wasn't non' realer than James  Dewitt Yancey\nSo I'mma dedicate this to Dilla and his family\nIn Q-Tip's basement, I first met Jay Dee\nI still remember the first beat he played me\nHe came to the Chi laid three that was crazy\nDidn't even know me and gave 'em to me for free\nI got the the D, \"peace yo, big love\"\nCook up some hot shit, then go to the strip club\nThen we made \"The Light\" and times got brighter\nI said \"turn it up\" Jay'll take it higher\nOne day, I noticed he was tired quick\nThat's when I found out, Jay Dee was real sick\nThings got worse before they got better\nI said, \"Come to L.A. for peace and good weather\"\nWe got an apartment just so we could spark it\nMP in the front room, records in the closet\nThe beats got iller, but the sickness was still there\nI'm wishing I could will him out of his wheelchair\nIt was hard for me to come home every day\nAnd see my homie Jay's life fade away\nI stayed away some times, in other words I ran\nTil one day J brought me this TV stand\nIt was a gift so I couldn't refuse it\nIt came from his heart, I regret I didn't use it\nThe lupus got worse and, for what it's worth\nI wanted him to have a Grammy before he left this earth\nWishing we could have that time back\nOh we can, yo man, rewind that\n\n[Chorus]\nRewind that one time please\nRewind that one time please\n\n[Verse 3]\nYou never gone, you live forever through song\nI feel it when I seem 'em with them Dilla shirts on\nI know you're still shining, from heaven you watch me\nWatch me put this Grammy on the stand you got me\n\n[Outro]\n(Common)\nThat's the infinite team right there, me and Jay Dee, I'mma work with him whenever I can, cause he's just like, constantly progressing and growing. He's one of the greatest producers... greatest musicians of our time. For real, I really know that\n\nLike, I used to be able to wake up in the morning and hear J Dilla beats being made. You know, I really, really used to walk by and be like, \"Man, I'm blessed.\" I really felt that, like, during the time when he was making it, not like, I don't look back and have to say \"I was blessed, I know I was blessed.\" But during that time I looked and say man, I'm gonna see Jay Dee make beats every day, you know, as long as he was healthy, he was making music\n\n(J Dilla)\nCommon, ok for me, ok it's definitely not a Common album\nBut, it's Common", "image": "https://images.genius.com/e188205739dfac1fc84a3288836b46ff.640x640x1.jpg"}], "artist": "Common"}