{"songs": [{"title": "How many drinks", "album": null, "year": null, "lyrics": "[Intro: Rick Ross]\nUh, you know what it is\nI'ma make sure everywhere you go you see me, baby\nYou hear my voice?\n\n[Verse 1: Rick Ross]\nI never had a problem with your old nigga\nIt's just how we mob, we don't know a nigga\nShe put me in her past and she moved on\nBut I keep her sexy ass in my new songs\nWe all make mistakes, we gone fight\nThere to wipe a nigga tears in the late night\nShe wanna cum before me, tell her, \"Wait a minute!\"\nNow we on the water, elevators in it\nDancing to another artist, I'm the one who pin it\nGhost, with the most, see no competition\nWorking in the club and guess who gotta tip out\nLong money, I'ma show you just what Rick 'bout\nRims on the coupe, baby, haters wanna sue\nMe and you against the world, what you wanna do?\nWhat you wanna do? What you wanna do?\n\n[Verse 2: Miguel]\nFrustration (watching you dance)\nHesitation (to get in them pants)\nCome closer baby (so I can touch)\nOne question: Am I moving too fast?\n\n[Bridge: Miguel]\nCause' I ain't leaving alone- feel like I could be honest babe\nWe both know that we're grown\nThat's why I wanna know\n\n[Hook: Miguel]\nHow many drinks would it take you to leave with me?\nYeah you look good, and I got money\nBut I don't wanna waste my time\nBack of my mind, I'm hoping you say two or three\nYou look good; we came to party\nBut I don't wanna waste my time\n\n[Verse 3: Miguel]\nTemptation (is calling your name)\nSweet persuasion, oh (baby this is a game)\nCome closer baby (if you like what you hear)\nImpassioned (is what I'm making you feel)\n\n[Bridge: Miguel]\nCause' I ain't leaving alone- feel like I could be honest babe\nWe both know that we're grown\nThat's why I wanna know\n\n[Hook: Miguel]\nHow many drinks would it take you to leave with me?\nYeah you look good, and I got money\nBut I don't wanna waste my time\nBack of my mind, I'm hoping you say two or three\nYou look good; we came to party\nBut I don't wanna waste my time\n\n[Verse 4: Kendrick Lamar]\nAha, and what do we have\nYour empty heart and my empty bottle and yellow cab\nThat you are likely to catch cause your latest ex made you mad\nSo I figured the perfect catch would be you if I made the pass\nPool full of liquor then we dive - in it\nKnowing if I lick her I might die - in it\nThen reincarnate as a fly - gymnast\nJust to flip my tongue on you\nThis the Olympics\n\n[Bridge: Kendrick Lamar]\nState your name, live in the moment\nIt’s your time to own it, I see it in you baby\nShe tell me that she never get a first let away\n\n[Verse 5: Kendrick lamar]\nAnd life is a bitch, but every dog has its day\nHolla pull up, pull up, bring it back, come rewind\nPull up them big trucks, that pack come behind\nPool full of liquor then we die - in it\nPull 'em to the side, let me slide up in it\n\n[Vamp: Miguel]\nOr waste your time, or waste your time\nOr waste our time, baby it's alright\nBaby it's alright, baby it's alright yeah\nOh it's alright now\nAlright. Oh yeah\nI don't wanna waste my time, no\nI don't wanna waste no time, oh no\nI don't wanna waste your time, babe\nI don't wanna waste our time, Oh my time, Oh whoaaa, now\n\n[Hook: Miguel]\nHow many drinks would it take you to leave with me? (oh yeah)\nYeah you look good, and I got money\nBut I don't wanna waste my time (come wit' me baby)\nBack of my mind, I'm hoping you say two or three (yeah it's just a short drive home from here)\nYou look good; we came to party\nBut I don't wanna waste my time\n\n[Vamp 2: Miguel]\nNo-no-no. I ain't judgin' if you do decide that you might be ___ing tonight\nWhat? More power to you if you do decide that you might be ___ing tonight\nI ain't judgin' if you do decide that you might be ___ing tonight\nWhat? More power to you if you do decide that you might be ___ing tonight\n\n[Outro: Miguel]\nLet's go, shit we only live once right?\nI mean, where's the fun in forever anyway?", "image": "https://images.genius.com/3dce21029cdd8aab73eb473e015807d5.1000x1000x1.jpg"}], "artist": "Rick Ross"}