{"songs": [{"title": "High Powered", "album": "The Chronic", "year": "1992-12-15", "lyrics": "[Intro: Dr. Dre]\nYo, yo, what's up?\nYo, man, give me some of that old, gangsta-ass shit, you know what I'm saying?\nSome shit I can just kick back and smoke a fat-ass joint to, you know what I'm saying?\nHell yeah, know what I'm talking about?\nI like that old gangsta shit\nCause you know it's a lot of niggas out there\nWoofing all that bullshit talking 'bout they got this and got that\nTalking louder than a motherfucker but ain't saying shit\nYou know what I'm saying?\n\n[Dr. Dre]\nYeah, nigga, I see your lips quivering\nBut you ain't saying a motherfucking thing\nBut my niggas, I got my niggas in the motherfucking house\nAnd they gon' tell you what's really going on\nGot my motherfuckin' nigga RBX—definitely in this motherfucker\nI got my nigga Daz in this motherfucker\nReady to kick some real shit, know what I'm saying?\nAnd that little shit you hear in the background? That's my homegirl Rage\nSo RBX kick this shit\n\n[The Lady of Rage]\nCome, come, come again\nCome, come, come again\nCome with the wickedness\n(Repeats)\n\nCome, come, come, come\nCome, come, get with the wickedness\n[Verse: RBX]\nSeven execution-style murders\nI have no remorse cause I'm the fucking murderer\nHaven't you ever heard of a killer? (Explosion)\nI drop bombs like Hiroshima\nSo now I walk around strapped\nOne-time bust they caps and watch niggas collapse\nSnap, adapt to this, but you need no adapter\nThis is just the first chapter\nIn a book from a crook\nYou get caught slipping, your ass gots to die\nNigga, tell me what the fuck you figure?\nTrigger, happy RBX to cap you\nPump, pump, and I can't wait to bust a round\nPump, pump, my hollow point smacks the clown\nCause what I said split his head\nAnd now they got me running from the Feds\nBut I refuse to go alive\nIt's kill or be killed, that's how real niggas survive\nI'm high powered\n\n[Outro: Dat Nigga Daz]\nYeah\nIt's Daz that mass-murdering motherfucker\nSo what you feel like you wanna get caught up?\nFool you better recognize\nDeath Row came to chastise\nSo if you cross the Row\nRemember the first name is Death\nNo love for the other side", "image": "https://images.genius.com/f069b7a57cd614d79e5dba8ee92f08f8.944x937x1.jpg"}], "artist": "Dr. Dre"}