{"songs": [{"title": "Funky Lil Nigga", "album": "The World is Yours", "year": "1993-08-17", "lyrics": "[ 2Low ]\nYou can call me T double o to the L-o-double - yo\nI'm 2Low, that funky little niggaroe\nComin back with a brand new cut\nAnd you can new jack swing on MY nuts\nCause I got the shit so tight\nA young nigga doin damage to the mic (you sho' right)\nI'm 13, but I ain't dumb\nSo bring it on if you muthafuckas want some\nCover your dome because it's on once again\nAnd I'm a young nigga that's known to win\nI got my street sense from these muthafuckin streets, bitch\nAnd I'm comin real, cause I ain't fuckin with that weak shit\nPass me the joint and let me kick it for the old folks\nAll the O.G.'s back in the hood that once sold dope\nJammin-happy villains, I'm leavin on the next train\nRunnin the game, so when I'm gone I be set, mayn\nGot a bank account, so I can stack some g's\nAnd have nice things like Cutlass on d's\nFresh candy paint, kickin shit live\nAnd fuckin with this whip before I'm old enough to drive\nMy teacher can't stand me cause I give him no respect\nI ain't sayin \"M'am, yes M'am\" until you're signin me a check\nSo you can miss me with that muthafuckin bum shit\nI'm gettin paid makin maze, fuck the dumb shit\nYou ain't my mother and I ain't your fuckin son\nSo in reality, bitch, you gets none\nI'm gettin busy on this muthafuckin track for ya\nFunky - cause I'm the funky little nigga\n\n(Nigga, nigga)\nCause I'm the funky little - nigga\n(Nigga, nigga)\nHe-he-he\nCause I 'm a funky little nigga\n(Nigga, nigga)\n\n(Nigga, nigga)\n\n[ 2Low ]\nHere we go once again with the real shit\nThrow your hands in the air if you can feel this\nI bring styles after styles after styles, dukes\nI can't be faded with the shit, cause I'm a young troop\nI sport them Nikes, not the Reeboks or K-Swiss\nAnd while I'm on the subject of feet, let me say this\nI kick ass like I'm Bruise Lot\nAnd let me squash this shit: real niggas do die\nGive it to me, baby, let me show you what that Deuce like\nLet me hit the swisher and let me show you what my juice like\nRippin up shit in '93 like a chainsaw\nMakin niggas say, \"Goddamn, that little nigga raw!\"\nAnd I can square the shit off right\nI'm straight from ?Warm Cloth? where these niggas don't fist-fight\nThey got they muthafuckin pistols shootin shit up\nTust enough to get your punk ass lit up\nIt's not about the set I claim, cause I don't bang\nI'm just a nigga from the hood who let his nuts hang\nAnd I can give a muthafuck about a nigga if he's bigger\nI'm 2Low, biatch, the funky little nigga\n\n(Nigga, nigga)\nHe-he-he\n[ Scarface ]\nYou'se the funky little what?\n[ 2Low ]\nThe funky little - nigga\n(Nigga, nigga)\n[ Scarface ]\nYou'se a funky little nigga\n(Nigga, nigga)\nHe-he\n[ 2Low ]\nThe funky little nigga\n(Nigga, nigga)\n\n[ Scarface ]\nLet me see if you can fuck with this since you're so funky\nWhere is Cedric?\nWhere is Cedric?\n[ 2Low ]\nHere I am\nHere I am\n[ Scarface ]\nHow are you today, Sir?\n[ 2Low ]\nVery high, I thank you\n[ Scarface ]\nSmoke one, fool\n[ 2Low ]\nYou smoke one, fool\n\n[ Scarface, (2Low) ]\nWell, it's Face kickin shit with the funky little nigga\n(I'm the funky little nigga and I'm steady gettin bigger)\nPass the killer, little nigga, let me hit me some dank\n(Pass the bottle, muthafucka, let me hit me some drank)\nI passed the forty to my partner, now he's ready to roll\n(Crank it up, damn fool, cause I'm ready to go)\nI be the Face (I be the Low) and we the real deal\nKnockin niggas on they ass like we Evander Holyfield\n(Fuckin up the beat is what I'm known for)\nAnd the funky little nigga is who this muthafuckin song's for\nOnce upon a time there lived Lucky\nLucky got fucked because Lucky tried to fuck me\n(Tried to fuck you how?) Hey yo, I gave the boy some shit\nHe came up short, then he got his ass sidekicked\nHad to cut him up like a tractor\nPick-pick-pick muthafucka, I holler atcha\n(But you ain't gotta fuck with that snow no mo')\nWhy you say that, Low? (Cause I'm the funky little niggaroe)\n\nI couldn't hear you\nYou'se the funky little what?\n(I'm the funky little - nigga)\n\n(Nigga, nigga)\nI'm the funky little - nigga\n(Nigga, nigga)\n(Nigga, nigga)", "image": "https://images.genius.com/2c9d70007eb3a5b42d898b73f3ce76f0.936x936x1.jpg"}], "artist": "Scarface"}