{"songs": [{"title": "Everything", "album": "4:21... The Day After", "year": "2006-08-29", "lyrics": "[Intro: Method Man]\nYeah... yeah... Allah Math...\nYeah... yo... yo...\n\n[Method Man]\nY'all ain't never stopping the kid, why y'all knocking the king?\nWould ya like a shot of liquor or like a shot to the rib?\nPlus you stay on top of they grills, stay on top of they biz\nThinking niggas plotting on hairs, think they not when they is\nThis is Staten Island gully, you dig? It's getting ugly\nAnd I ain't found a court that can judge me, the block love me\nLike nines to the side of the skully, popping they top\nI'd rather pop bubbly, one for B.I.G. and one for Pac\nNigga, trust me, I'm hot as they get, like Al Green\nGetting hit by a pot of them grits, yo, nahmeen?\nY'all don't really want no parts of this, soon as a nigga\nStart shining, niggas start some shit, my guard lit\nLike a boss, head nigga in charge, get in these drawers\nFitted, nine inches bigger than yours\nThis Meth dude got that food, and he serving it raw\nTold you before, I bring the pain, and now I'm hurting them, pa\nHurting them, pa...\n\n[Hook 2X: Streetlife]\nUp from the 36, back on that bullshit\nOkay, I'm reloaded, strapped with a full clip\nStaten Island's the borough, Park Hill, we still click\nWu-Tang, Wu-Tang, that's the Clan, we run shit\n\n[Inspectah Deck]\nAiyo, you fucking with some capital G's, Allah Math\nStreetlife, Meth Man, plus the Masta and me\nSoldier I, make it happen, indeed, my sick gift\nHad the highest paid ho, get it cracking for free\nWorldwide, still trapped in the P's, Pioneers\nLike the twenty inch woofers, that's in back of the V\nLeave ya brain, like you spazzing on E\nIt don't matter who you happen to be, nothing swagger like he\nKeep a dirty cop close, never talk with no feds\nTear the roof off the mother, right along with ya head\nAnd I ain't talk unless she talking bout bread\nYou would swear that I'm rocking New Balance, how I'm walking the ledge\nSon, I'm just a little off of the edge, as I stalk\nThe mean streets, for paused types, callers are read\nKilla Hill where the warriors bred, I'm a Resident\nPatient, it's gonna take more than the meds\n\n[Hook 2X]\n\n[Streetlife]\nSpecial invited guest, I came to put the rumors to rest\nRip the rest of the slugs through your chest\nPut the chest to the back of your vest\nTrap your packet, take the money and jet\nNiggas posted, but you posing no threat\nPunk, you pussy like the opposite sex\nFront, see how many shots you will get\nI'm not asking, I'm demanding respect\nI'm just a man to respect\nWatch your step, son, your funeral's next\nStreetlife is the man in the flesh, I got one hand on your neck\nThe other hand is attached to the tech\nYour next move could mean life or death\nMake move, take baby steps\nHold that thought, nigga, save your breath\nWe hold courts, in the streets, we rep\nFor Cash Rule, and we came to collect, cock sucker\n\n[Hook]", "image": "https://images.genius.com/3ddccdf6d7612b941c3c9dfb5048829a.1000x1000x1.jpg"}], "artist": "Method Man"}