{"songs": [{"title": "That’s Where I B", "album": "Redman Presents... Reggie", "year": "2010-12-07", "lyrics": "[Intro: Redman + (DJ Kool)]\n(YEAH BOY!) Gilla House in the buildin', nigga\n(DJ Kool, eh-HEH) You already!\n(Rrrah, rrrah) AOWWWW\n(Ten seconds) They said I don't belong up in here and shit\nYou know what I'm talkin' 'bout?\n(AYO! Five seconds)\n(EH-HEH, EH-HEH, EH) We gon' do it like this, nigga\n\n[Verse 1: Redman]\nThis that syrup niggas got lean on\nYou wan' be like Reggie? Dream on\nYou pissed off, baby? Don't get peed on\n'Cause mayne, I run thangs like creamed corn\nI'm like Kee-nan, Wayan, 170\nHeavy on the black like Ebony\nMoney in the bank? Yeah boy, it better be\n'70s baby, check out my melody\nPlaces I be at, y'all don't be there\nToo busy up in the club drinkin Pierre\nHoods love me, and the pilot in the Lear\nOnly way you get through the hood is through e-mail\nNumber one, boy, on the charts, I rank on it\nI'ma keep it hood and Tyra can Bank on it\nAnd where I be, you niggas gotta think on it\nSpit hot shit like the mic got a mink on it\n\n[Chorus: Redman + (DJ Kool)]\n(Jersey, my nigga) That's where I be\n(L.A., my nigga) That's where I be\n(New York, my nigga) That's where I be\n(Miami, my nigga) That's where I be\n(Hands up) That's where I be all day\n(Hands up) That's where I be all day\n(Brick City, I got you)\n(Hands up) That's where I be all day\nThat's where I be\n\n[Post-Chorus: DJ Kool]\nEH-HEH, EH HEH!! Aiyyo\nCheck this out ch'eah\nI'm just here to let 'em know\nWe the kind of guys who get rowdy y'anmean?\nListen, wherever you be, we be aight?\nWhatever you ready to do, we ready to do\nWherever you party at? We party at\nWherever you be, I be, let's go!!\n\n[Verse 2: Redman]\nYo, when I'm in N.Y., I'm Uptown\nOn 1-4-5, fresh pair of Uptowns\nI just scored me a mami, touchdown\nOriginal Gunn Clappah, Bucktown\nOh! I love to kick it in Cali\nMy Compton girl tattooed me on her fatty\nShe said, \"I know you've got hoes in the Valley\nKris Kross me you gon' see the Mack Daddy\"\nI said \"Yo, I gotta go to Miami\"\nBut my boy Zo Pound so I'd feel a little milli'\nI bagged me a XXL, +Eye Candy+\nA little bling bling got me +Fresh+ like +Mannie+\nI ride through the A with a chick, dirty\nSouthside Philly know I get it on early\nAny hood I'm in, I'm never in a hurry\nI stand there, chest out, and I rep Jersey\n\n[Chorus: Redman + (DJ Kool)]\n(Boston, my nigga) That's where I be\n(D.C>, my nigga) That's where I be\n(ATL, my nigga) That's where I be\n(Overseas, my nigga) That's where I be\n(Hands up) That's where I be all day\n(Hands up) That's where I be all day\n(Hands up) That's where I be all day\nThat's where I be\n\n[Outro: DJ Kool + (Redman)]\nLADIES!! If you in the club right now\nPosted up at the bar (Tell 'em)\nGettin' yo' FULL drink on\nAyo, that's where I be, UH-HUH! (Tell 'em)\nAyo fellas, now you in the club\nPoppin big bottles\nMakin' it rain ALL OVER THE PLACE (Tell 'em)\nAy nigga let me tell you somethin' right now\nThat's where I be!!\n(Gilla House)", "image": "https://images.genius.com/4d4f1e8f8a259cccb95855c51037a514.600x600x1.jpg"}], "artist": "Redman"}