{"songs": [{"title": "Stuck at a Standstill", "album": "Balls and My Word", "year": "2003-04-08", "lyrics": "These niggas is fuckin with a dangerous game\n\nHey Joe, what's up baby?\n\nYeah, I like the beat\n\nHahaha...\nHey, when you drop drums I'mma drop rhymes, aight?\n(Drop rhymes)\nNah, I don't need no count-off\nJust drop the beat and I'm on it, aight?\n(2-3-4)\n\n[ VERSE 1: Scarface ]\nI took my chances when I did my dirt\nAnd my advice to any nigga if you crimin, you do it worse\nJust get enough and step the fuck back\nCause in this game when you get fame\nYou gotta start dumpin these agents off your nutsack\nI'm just a nigga out the hood tryin to have things\nBut when I got up on my feet you're screamin \"Brad changed!\"\nAnd your excuse was that the money came\nBut my excuse was that you missed the plane, simple and plain\nI got to show my homies love, though\nI just don't fuck around with niggas that I don't know\nAnd you can take that how you wanna take it\nI'm from these muthafuckin streets\nAnd the same rules apply in this game, don't ever break it\nAin't my muthafuckin luck I'm all alone at the crack\nAnd you niggas don't wanna try to attack\nWe steady dyin over dumb shit, and me, I'm steady losin my sleep\nCause niggas ain't familiar with the rules of the streets\nYou're stuck\n\nStuck at a standstill\n\nOn the beat one time, come on\n\nIt don't stop\n\nGive it to em\n...3\n\n[ VERSE 2: Scarface ]\nAnd to my niggas on the streets crimin (watch for haters)\nStop sittin on the sidelines and (get your paper)\nToo many niggas complainin pointin fingers at the problems\n\"That's why I hate my baby mama\"\nI'm just a nigga from the very bottom\nSkippin classes, goin 8 balls or the white powder\nTryin to get it while the muthafuckin gettin good\nThe possibilities of movin out my neighborhood\nDon't get me wrong, I had them dreams too\nBut the only thing you do is get your cream, fool\nGet your muthafuckin green, fool\nNiggas ain't knowin 'bout the ins and the outs\nFirst get in, then you get out\nDon't be stuck at a standstill\n\n(You know...\nTo the 2, ah 2-1\n(...I was thinkin)\nRock the mob shit for niggas, come on y'all\n(...need to, I don't know, maybe findin new hustles\nLike niggas is runnin out of hustles, you know?)\n\n[ VERSE 3: Scarface ]\nWhen it's over don't nobody cry\nJust enjoy it while you live life cause everybody gotta die\nSo when you see me I'll be hella high\nBendin corners with my top down checkin out the changes in the sky\nShootin paper clips at Jupiter\nThe mo' I learn it's like I'm gettin stupider, and stupider\nTryin to make the best out of a fucked up decision\nI'm just a nigga with a vision, which is\nGettin up, gettin out, gettin my profits\nTryin to stay away from these bitches that jock dick\nMovin up to move on, gotta stay true to it\nThat's just the way you gotta do it\nAnd these niggas here is renegades, don't give a fuck\nBut if you're real, then you like it rough, nigga what?\nYou know it, you know what I'm sayin is real\nNow step the fuck off all those standstills\nCause you're stuck\n\nStuck at a standstill\n\nStuck\n\nTo the beat one time\n\nYeah\nMy nigga Mike Dean", "image": "https://images.genius.com/c4214083902775e5126f0ba4f0770c9a.969x969x1.png"}], "artist": "Scarface"}