{"songs": [{"title": "Sup Mate", "album": "So Much Fun", "year": "2019-08-16", "lyrics": "[Intro: Future]\n(DY Krazy)\nYellow tape, I put that on (Yeah, yeah)\nHold up, wait, life's great (Yeah, yeah)\nHold up, wait, ice skate (Yeah, yeah)\nHold up, wait, crime pay (Yeah, yeah)\nHold up, wait, slatt, slatt (ATL Jacob, yeah, yeah)\n20 cars, matte black (Yeah, yeah)\nSurfin' at a Ritz Carlton (Yeah, yeah)\nTwo pink toes (Poof, poof, yeah, yeah)\n\n[Verse 1: Young Thug & Future]\nOxycontin what I piss\n(Yeah, yeah, yeah-yeah, yeah, yeah, yeah, yeah)\nFlip it to the dog like a dish\n(Yeah, yeah, yeah-yeah, yeah, yeah, yeah, yeah)\nAccept the loss before I quit\n(Yeah, yeah, accept the loss before I quit, yeah, yeah)\nShe slept at the house, I bought her Ruth Chris\n(Yeah, yeah, yeah-yeah, yeah, yeah, yeah, yeah)\n\n[Chorus: Future & Young Thug]\nWhat's up, mate? Got cake, mate (Yeah, yeah)\nGot cheese, mate, got bread, mate (Woo)\nGot cups, mate (Woo, ooh), no fucks, mate (Woo, mate)\nGive no fucks, mate (Woo, geeked, mate), I'm up, mate (Woo, outta shape, yeah, yeah)\nIt's up, mate, I buck, mate (Yeah, yeah)\nI bleed, mate, he bled, mate (Woo, yeah, yeah)\nGot cups, mate, (Woo) no fucks, mate\nLet's fuck, mate (Woo)\nFucked my classmate (Woo), fuck, shit, let's splash, mate (Woo)\nOr suck that shit, let's splash, hey\n\n[Verse 2: Future]\nSmokin' on loud, we don't fuck around with y'all\nWanna try this shit, let me know\nWe prepare first and then Columbine\nTrenchcoat, under a nigga's sleeve\n\n[Refrain: Future & Young Thug]\nWipe his nose, wipe his nose (Pussy ass nigga)\nWipe his nose, (Slatt) wipe his nose (Wipe your nose)\nWipe his nose, (Wipe your nose, slatt) wipe his nose (Slatt, wipe his nose)\nWipe his nose, (Wipe your nose), wipe his nose (Yeah, yeah)\n\n[Verse 3: Future]\nDoubled the cups and then doubled it up and I doubled it up (Yeah, yeah)\nJump in the Bentley, I jump in the truck and I trucker the truck (Woo, yeah, yeah)\nChuggin' it down, I'm smokin' a pound, I'm fuckin' around (Yeah, yeah)\nSmokin' on loud, we don't fuck around with y'all\n\n[Chorus: Future]\nWhat's up, mate? (Woo) Got the blicky, featherweight (Woo)\nGot the cash, I bake the cake, (Woo) ayy, what's brackin', mate? (Woo)\nI just sniper, mate, (Woo) chain on hydrate, mate (Woo)\nGet no sleep, mate, (Woo) I'm geeked, mate, pushin' weight, outta shape (Yeah, yeah)\n\n[Verse 4: Young Thug & Future]\nRed wings, red bottoms, I'm a fuckin' devil (Yeah, yeah)\n20 tennis chains on, not no Ric Flair medal (Woo, yeah, yeah)\nI don't gotta run it back, you heard what Gunna tell 'em (Yeah, yeah)\nPut my diamonds in a bowl, that look like Fruity Pebbles\n\n[Verse 5: Future]\nYeah, yeah, yeah, yeah\nBitch wanna hit her a lick, yeah (Yeah, yeah, yeah, yeah)\nBitch wanna suck on the dick, yeah\nBitch wanna get her a brick, yeah (Yeah, yeah, yeah, yeah,)\nBitch wanna fuck on a bitch (Yeah)\nBitch wanna fuck on the clique (Yeah, yeah)\nEuros on euros, I'm gettin' it (Uh)\nStep on the floor, now I'm lit (Woo)\n\n[Refrain: Young Thug & Future]\nWipe his nose, wipe her nose (Woo)\nKick a door, keep the Ruger (Woo)\nPut the pole in his ho, bend her over (Woo, woo, woo)\nThen you buy that bitch a brand new Range Rover (Woo, woo, yeah, yeah, yeah, yeah)\n\n[Verse 6: Future & Young Thug]\nI'm so high, all I can say is \"Woo, woo, woo\"\nI can't talk, I barely could say, \"Woo, woo, woo\"\nCount a M and count another one, ooh, ooh (Ooh)\nFuck that shit, I enter the lotto, woo, woo (Fuck it, yeah, yeah)\n\n[Verse 7: Young Thug & Future]\nCount a half and another\n(Woo, woo, yeah, yeah, yeah, yeah, yeah)\nI can never be a facade, relative\n(Woo, woo, yeah, yeah, yeah, yeah, yeah)\nUp to the sky with my mom, brothers\n(Woo, woo, yeah, yeah, yeah, yeah, yeah)\nThey let it hit from the side, they were all cudders\n(Woo, woo, fuck it, yeah, yeah)\n\n[Verse 8: Future]\nOh, okay, fuck her good, make her try voodoo\nOkay, my plug put me on, I call him Lou Lou\nHood nigga, pay it in full, I'm a black Jew\nWhat's population? I come from the trenches, we pray for a brick\nWhat's poppin', lady? Bitches love a nigga's accent (Woo, woo)\nPain pills, codeine, hydro, acid (Woo, woo)\nI hang with some slimes, pullin' kick doors (Woo, woo)\nOutchea, outchea, quit your reachin'\nGucci socky on my feet\nSloppy toppy, keep it neat\nOne, two, three, I got freaks\nOoh, four girls on fleek\nOoh, bad and saditty\nOoh, ass and her titties\nOoh, that ting litty\nAnd my Spanish ting, she bad like J. Lo (Ooh, ooh)\nI crushed up an X pill in her asshole (Ooh, ooh)\n50 round clip, got my Draco (Ooh, ooh)\nI should, I should teach drug classes (Ooh, ooh)\nI stay on my grind, Margiela ten toes (Ooh, ooh)\nMoney on my mind, I'm a nympho (Ooh, ooh)\n\n[Outro: Future]\nOoh, ass and her titties (Ooh)\nOoh, that ting litty (Ooh)\nOoh, ass and her titties (Ooh)\nOoh, that ting litty (Ooh)\nOoh, ass and her titties (Ooh)\nOoh, that ting litty (Ooh)", "image": "https://images.genius.com/33c52a00b694afff704c64a80dad42c2.1000x1000x1.png"}], "artist": "Young Thug"}