{"songs": [{"title": "Pain", "album": null, "year": "1994-03-22", "lyrics": "[Intro: Sample from Star Trek V: The Final Frontier]\nI couldn't help but notice your pain\nMy pain?\nIt runs deep – share it with me!\n\n[Verse 1: 2Pac]\nThey'll never take me alive, I'm gettin' high with my four-five\nCocked on these suckas, time to die\nEven as a youngster causin' ruckus on the back of the bus\nI was a fool all through high school, kickin' up dust\nBut now I'm labeled as a troublemaker – who can you blame?\nSmokin' weed helped me take away the pain\nSo I'm hopeless, rollin' down the freeway swervin', don't worry\nI'm 'bout to crash up on the curb ‘cause my vision's blurry\nMaybe if they tried to understand me – what should I do?\nI had to feed my fuckin' family – what else could I do\nBut be a thug? Out slangin' with the homies\nFuck hangin' with them phonies in the clubs!\nGot my mind on danger, never been a stranger to homicide\nMy city's full of gang-bangers and drive-by's\nWhy do we die at an early age?\nHe was so young, but still a victim of the 12 gauge\nMy memories of a corpse, mind full of sick thoughts\nAnd I ain't goin' back to court, so fuck what you thought!\nI'm drinkin' Hennessy, runnin' from my enemies\nWill I live to be 23? There's so much pain\n\n[Hook]\nOhhhh…\nTired of the strain and the pain\nOhhhh…\nTired of the strain and the pain\n\n[Verse 2: Stretch]\nYears and years of that rough life\nRunnin' crazed and wild as a kid and growin' tough with a knife\nAnd livin' trifed on the regular, buckin' out competitors\nSee 'em fake a move and chase 'em down like the fuckin' Predator\nGet in trouble every day in school, act a fool\nAnd you know I had to break every rule\nShowin' off for the bitches ‘cause I had the mad rep\nSo I had to watch my back when it was time to step\nBut my grimies is the grimiest with love for me\nPop, pop, pop, and send a chuckle up above for me\nAyo, currency kept passin' me by, but I didn't cry, broke\nGot hit off with the pack and started sellin' coke\nAnd now the money's lookin' lovely\nPop the drop top and now the bitches wanna rub me\nKick 'em the game, it's all the same\nI kick it back yo, give 'em slack yo\nAnd now they label me the mack yo, people check it\nGet disrespected if you front on the Birdman, you heard, man\nCatch a couple shots from the Glock in my hand\nDamn! At least I'm realistic with my biscuit\nYou know you get yo' ass twisted, so run for cover\nMe and my man got a plan, kickin' major dust\nSo if you owe, nigga, look for the gauge to bust\nA lot of pressure with the street fame, it's a deep game\nAnd my mama always cryin' yo, there's so much pain\n\n[Hook]\nOhhhh…\nSo tired, so tired...\nOhhhh…\nSo...so...\n\n[Verse 3: 2Pac]\nThey got me mobbin' like I'm loc'ed, and ready to get my slug on\nI load my clip and slip my motherfuckin' gloves on\nI ain't scared to blast on these suckas if they test me\nTrust – I got my Glock cocked, playa, if they press me\nBust – on motherfuckers with a passion\nBetter duck, ‘cause I ain't lookin' when I'm blastin'\nI'm a nut and drinkin' Hennessy, and gettin' high\nOn the lookout for my enemies, don't wanna die, tell me why\n‘Cause this stress is gettin' major\nA buck 50 across the face with my razor\nWhat can I do but be a thug until I'm dead and gone?\nI keep my brain on the game and stay head strong\nThese sorry bastards wanna kill me in my sleep\nI'm real, they cannot see\nAnd every day is just a struggle, steady thuggin' on the streets\nAnd I'll be ballin', loc, don't let 'em make you worry\nKeep swingin' at these suckas 'til you buried\nI was born to raise hell, a nigga from the gutta\nWord to mother, I'm touched\nOut kickin' dust up, ready to bust\nI'm on the scene, steady muggin' mean, until they kill me\nI'll be livin' this life, I know you feel me; there's so much pain\n\n[Outro]\nOhhh…\nTired of the strain and the pain\nOhhh…\nTired of the strain and the pain\nOhhh…\nTired of the strain and the pain\nOhhh…\nTired of the strain and the pain\nOhhhhhh…", "image": "https://images.genius.com/bcf903e4d2db55c6707e98084174eb03.320x320x1.jpg"}], "artist": "2Pac"}