{"songs": [{"title": "Clipse of DOOM", "album": "Fishscale", "year": "2006-03-28", "lyrics": "[Intro: Ghostface Killah]\nAiyyo, turn those lights down while I'm recording!\nMatter 'fact y'all niggas get the fuck out the room, G!\nStraight up! Sipping on that bullshit Budweiser!\nNah'mean yo.. what? Fuck you too, nigga!\n'Kind of pants you got on motherfucker, Capris?!\nBitch ass nigga, go get ya feet done!\nEat a dick nigga!\n\n[Verse 1]\nCatch me in the 80's drop\nOld school Mercedes with a brand new baby Glock\nRight from my Lady's sock with two bodies on it\nCapricorn, Aquarius\nLost so much blood, these bitch niggas in they periods\nThey say I be living the role, like 'Pac in Juice\nAnd only fuck with cute bitches that can fly and boost\nAnd they ears be chandeliers, lit up like a lamp, Who cares?!\nThey cooch is fierce, the only thing loose is hairs\nThat's right y'all, if a rap nigga say my name I'm a fight y'all\nFuck a state, light charge\nMy predicate status, irrelevant\nMy man got the big rap sheet that's outweighing two elephants\nJumbo shits from New Orleans\nPlayers and Pimps that bit off Fiends\nQuick, switch with the hands, Powder blue wally's is dyed, Vanilla Bally's is mean\nCan't none of y'all motherfuckers fuck with my team, Uh!\n\n[Hook: Trife Da God]\nAiyyo we the live niggas holding heat on the street corners\nSic the beasts on you, turn mothers to mourners\nMoney launderers, neighborhood coroners, place bodies in bags\nTango with dirty Cash, Cocaine jacks\n\"Kings of the Hill\", out to blow like propane gas\nPackage the raw, Theodore, We got the game on smash\nCause we cut from the same cloth\nBig guns ready to bang off\nSlide off the cables and take the rings off!\n\n[Verse 2]\nWe hold the weight of four Synagogues\nJelly'd uptown in them beat down rented cars\nGoing mad wetting 'em\nMilk cash, heavy tecks, hood rats, sexing 'em\nParis crew, little dudes, please! I was repping 'em\nNiggas couldn't come through (word)\nThat's when the block was like wallpaper, loved sticking niggas like crazy glue\nBlackouts happened, God forbid don't be around!\nThe Bag Lady will murk you and let off in the next town!\nShe struck two times, get caught, good luck blood, it ain't no Heinz\nBlow a hockey puck hole in the back of your spine\nShe put two cut up mirrors in the place of your eyes\nSo when the cops look they see theyselves, they all gonna die\nIts the tale of the Crips and Bloods, pimps and thugs\nGet your face bashed in on the concrete rug\nOn that note I'm a say peace!\nTheodore! Word to Darryl Mack's teeth!\n\n[Hook]\n\n[Verse 3]\nYo, Ayo I'll break every bone in your wrist\nSmack you in the back of your head on the block while you holding your dick\nMy semi, they call it the crouching tiger\nA hundred bowls of Total is trash, because my lead eat through fibers\nPeel your potato like Ore-Ida\nOn the day of your death people had candles but couldn't find no lighter\nFuck your mural! Fuck your hood!\nYou ain't a street legend like me!\nBlake Carrington holding the Dynasty\nI muffle motherfuckers up like Meineke\nAnd write a thousand bar verse that all rhymes with \"E\"\nJewel thief, Shizzam bangles, in the vault deep\nAnd cruising deserts mad heavy into salt treats\nI'm the taste in Bush's mouth, nasty\nAfghanistan missions, gun training in the grassy fatigues\nPicking niggas off by the Red Sea\nAnd did it all for Ghost, sniffing on caffeine!", "image": "https://images.genius.com/61b48fa7fe972c473dc1c20c9489e45f.1000x1000x1.jpg"}], "artist": "Ghostface Killah"}