{"songs": [{"title": "#ImSippinTeaInYoHood (Remix)", "album": "ITSOKTOCRY ACT.1", "year": "2016-03-17", "lyrics": "[Intro: XXXTENTACION]\nHehe, yeah\nYou know I'm posted in the booth with the booth with Ronny J\nGotta get in the mood, hehe\nYou know how I'm rockin'\nGang, gang, gang\nHehe, yeah, yeah\nRonny J produced it!\n\n[Verse 1: XXXTENTACION]\nBoy, I'm sippin' tea in yo hood, what the fuck is up, you buttercup?\nPurrp in that blunt, smoking suicide bloody blunts\nPussy boy you talkin' shit for Twitter, it ain't addin' up\nHow these pussy niggas movin' day to day? I had enough\nPost with that fucking blade, bitch I'll skin your face\nDick on that fucking gun, I love it when they run\nFuck all that talkin' shit, do that shit for fun\nFuck 'round with these niggas, ayy\nStab a body, fuck do you mean\nComes with that Glock and that beam\nPut that shit right in yo spleen, ayy\nRun through yo hood, ayy\nFuck nigga, what's really good, ayy\nMy niggas wish that you would, ayy, ayy\n\n[Chorus: XXXTENTACION with ITSOKTOCRY]\nBitch, I'm sippin' tea in yo hood, what the fuck is up?\nBitch, I'm sippin' tea in yo hood, what the fuck is up?\nBitch, I'm sippin' tea in yo hood, what the fuck is up?\nBitch, I'm sippin' tea in yo- ayy, ayy\nBitch, I'm sippin' tea in yo hood, what the fuck is up?\nBitch, I'm sippin' tea in yo hood, what the fuck is up?\nBitch, I'm sippin' tea in yo hood, what the fuck is up?\n\n[Verse 2: ITSOKTOCRY]\nBitch, I'm sippin' tea in yo hood, you a fake fuck\nI don't need parental supervision, I just need drugs\nWe just smoke purp, who the fuck Purrp be fallin' off\nArizona tea on his corpse in a parking lot\nAll you do is talk, stop, get my dick sucked\nPull up with a dick, finna fuck you up\nPut 'em in your mouth, got you choking out\nPull up 20 deep, it's still not enough\n\n[Verse 3: ITSOKTOCRY]\nSkinny but I'll bang it with the blade\nNot afraid to die and you looking like a stain ok\nYou afraid of X you need ego death\nYou afraid of death, horror movie, triple X\nYou a fake fuck boy, yuh, yuh, yuh\nYou a fake fuck boy, yuh, yuh, yuh", "image": "https://images.genius.com/a4a4a18c581ac753743de06b9bcbad11.500x500x1.jpg"}], "artist": "XXXTENTACION"}