{"songs": [{"title": "The Realest", "album": "J Prince Presents Realest Ni@@as Down South", "year": null, "lyrics": "The real,  for real       ,   Rap-A-Lot  Mafia     Aaaaaahhhhh\nIt-wa it-wa it  wa  it was......\nIt was once said by your man who wouldn't quit\nStop bullshittin' and make another hit\nI looked him in his eyes and told him that ain't shit\nGimme 30 minutes and i'mma wreck this bitch\nSo I wrote this rhyme i'mma bout to say\nTo tell him how it went down back in the day\nSee most niggas give they props to Run DMC\nBut dem' niggas in the south gotta give it to me\nYou see I was wrecking shit when they was doin' the worm\nParachute pants coming through with the perm\nI ain't never been a pussy I was all day rough\nBitches try to rap like they was always tough\nBut thats bullshit cause niggas know my name ring bells\n]From M.C. J.H.  ?????????\nGot much love for most cities but i'mma S.A. fool\n7th Graders shouldn't bring the scraps to school\nSo when you say you only listen to the real M.C.'s\nLet me spell it out for you,  for real M- E  its the same Mista Scarface from\nThe 1980's\nYou bitches tried to bring out'cha best but cha' can't fade me\nCause I was rockin' shit when ????? was still living\nAnd you niggas was hangin' on the corner bullshittin'\nNow you wanna jump in the game on both feet\nSell a few tapes and forget that you know me\nBut remember the one you got the idea from\nSee I'mma real artist so my ideas come\nBut you sounded like I sounded on The World is Mine\nI catch you style-stealin' time after time\nNow you on the mission trying to sound like Puff\nGet cho' own shit and stop riding the jock\nThe realest nigga down south? I gotta say thats J\nY'all muthafuckas don't deserve that name\nAnd let me break it down to you one more time\nThink about it before you start out your rhyme\nI'm one of the coldest M.C. to ever touch the mic\nSo I apply the pressure til' I bust the pipe\nAnd niggas always ask why I keep changing my style (why)\nCause i keep hearing muthafuckas claiming my style\nAnd then they got the nerves to say they colder than me\nThen why the fuck you niggas can't go gold before me\nI see you on your videos on B.E.T\nIt makes me wanna kick a hole in my T.V\nCause i hate an individual who is fake as that\nI gotta dropped Bentley with a Ranch to match\nNigga I finish with my shoot, my shit it can't go back\nYou back in yo' chevette ?????????\nI started making records at the age 15\nAffiliated with the game at age 16\nAn honorary member of the whole???????\nCut dem' blocks in half and continued to flip\n[In droning voice]\n[And now I got you figured that I'm not to old\nNever will i fall off cause i'm wasn't too old]\n??? to the seminar and shit went cool\nStarted talking bout they bitches and the boys got booed\nHeart-broke packed up shit and headed for home\nThen I spoked to Lil' James on the telephone\n\nWhere the real niggas come from(repeats to end)\n(Scarface talking to end)", "image": "https://images.genius.com/c20249656f384001f10bb6881020ea0b.1000x1000x1.jpg"}], "artist": "Scarface"}