{"songs": [{"title": "Brimstone", "album": "Hood Billionaire", "year": "2014-11-24", "lyrics": "[Intro]\nWe'll never been no gain dog, we always been self made men you feel me? (I better believe)\nSo you know what I'm sayin', Ross could stand on his own you feel me?\nSo just keep goin' dog hit that billionaire status\nAnd you know when I get there dog, you know what I'm sayin', we're gonna sit back and eat fish dinners\nNo crab meat, you know what I mean?\n\n[Hook: Big KRIT]\nI say lord, lord lord lord lord\nI pray I don't be here\nWhen it all goes down, when it all goes down\nI say lord, lord lord lord lord\nI pray I don't be here\nWhen it all goes down, when it all goes down\nThere'll be hard times, and then song\nFire, and brimstones\nDevil world from which you came\nI pray that God will know my name\nThere'll be hard times, and then songs\nFire, and brimstones\nDevil world from which you came\nI pray that God will know my name\nI say lord, lord lord lord lord\n\n[Verse 1: Rick Ross]\nLord lord lord lord\nI remember hard times always found a way to smile\nIt was quiet, Christmas time, no pretty lights around the house\nThey told me I was loud, didn't fit into they crowd\nMama need a spouse, Daddy always in and out\nAge 15 so the caged bird sings\nOne year later seen a straight bird clean\nAll glitters ain't gold\nThese evil niggas prayin' for your soul\nWalkin' through the fire, Hell on God's green Earth\nTake a seat, close your eyes, bow your head, say church\n\n[Hook 2: Big KRIT]\nLord, lord lord lord lord\nI pray I don't be here\nWhen it all goes down, when it all goes down\nThere'll be hard times, and then songs\nFire, and brimstones\nDevil world from which you came\nI pray that God will know my name\nI say lord, lord lord lord lord\n\n[Verse 2: Rick Ross]\nLord lord lord lord\nI'm sittin' in the trap and I done did it with the best\nPull a double shift its time to get your boy some rest\nMoney on my mind, alcohol on my breath\nOn the road to riches as I stumble every step\nGold on my arm, gold on my neck\nBut whats in my heart I will cherish till the death\nSame rainy days, but things never change\nPrayin' to my maker just to take away this pain\nWalkin' through the fire, Hell on God's green Earth\nTake a seat, close your eyes, bow your head, say chuch\n\n[Hook: Big KRIT]\nI say lord, lord lord lord lord\nI pray I don't be here\nWhen it all goes down, when it all goes down\nI say lord, lord lord lord lord\nI pray I don't be here\nWhen it all goes down, when it all goes down\nThere'll be hard times, and then song\nFire, and brimstones\nDevil world from which you came\nI pray that God will know my name\nThere'll be hard times, and then songs\nFire, and brimstones\nDevil world from which you came\nI pray that God will know my name\nI say lord, lord lord lord lord\nI pray I don't be here\nWhen it all goes down, when it all goes down\nI say lord, lord lord lord lord\nI pray I don't be here\nWhen it all goes down, when it all goes down\nThere'll be hard times, and then song\nFire, and brimstones\nDevil world from which you came\nI pray that God will know my name\nThere'll be hard times, and then songs\nFire, and brimstones\nDevil world from which you came\nI pray that God will know my name\n\n[Outro: Kenneth \"Boobie\" Williams]\nAnd I'd love to see that movie man, I know your only gonna get bigger\nYou know so, when y'all see me in the pictures on the yacht though\nWhen I'm lookin' at the pictures on the yacht and I'm seein' my homies on yachts\nThat they own you know what I mean? Its like   okay, this what the movies been about from day one\nYou know a lot of times people misinterpret it, as far as the Carol City Cartel\nThe Matchbox and think it was just violence\nIt wasn't never about violence, it was all about survival and gettin' that position\nSo now, you know this the platform we had to use - this call is from a federal prison -\nNow dudes get in position and we love that position because we love to win\nAnd we gonna continue to win, as long as we breathin'\nYou know what I'm sayin'? And our kids gon' win, and they kids gon' win because this what its bout'\nYou know what I mean?\nSo you already know fam, the big homie, its just, you know what I'm sayin', a product of his environment\nWho used his environment to get in position and if a person don't like that\nThen they don't like success dog\nBecause, you know, we ain't gon' never stop\nYou know, and thats what I like about Rick Ross and all his music - beep beep - picture with words\nTell everybody I send my love man, and Carol City, Matchbox, for live dog. Carol City Cartel too, you hear me?\n\nGood Man! (good man, good man, good man, good man, good man)", "image": "https://images.genius.com/bef9a0948252c91da2c707ba7803fcfd.1000x1000x1.jpg"}], "artist": "Rick Ross"}