{"songs": [{"title": "Intro", "album": "4:21... The Day After", "year": "2006-08-29", "lyrics": "[Intro: sample]\nMake marijuana legal, make marijuana legal\nMake marijuana legal, make marijuana legal (well speak your mind then)\nOk, I will, no one has the right to tell me what I can do with my own body\nWhat I can eat, drink or smoke, this is a free country\nAnd no one can take away my constitutional rights\nHey man, can you put me on and I can say anything I want\nIs that what I need to do? (Yea)\nThen why isin't alcohol made illegal? Why isin't that\nWhile you drinking it, it hang on and disposes your liver\nBesides that, it's a habitat for alcohol\nBesides that, cigarettes are much worse than pot\nNo one ever got killed by pot (you tell 'em, you tell 'em)\nGod damn it, man, everything, you can get us anything you want\n(Anything you want, marijuana legal\nMake marijuana legal, what's so bad anyway\nWhat's so bad about feeling good?\nThere's nothing wrong with blowing crack, yea!)\n\nStop, look & listen, guess who coming up?\nAnd y'all was dumb enough to think that Method's number's up\nPockets so fat, they need a tummy tuck, you hungry fucks\nCan sum it up, I give my money up, spit at a honey\nThen split a honey Dutch, roll it up, can't roll with us\nIf you can't hold your liquor, throw it up, y'all know what up\nSee we them niggas, ain't no ho in us, the flow is nuts\nI'm off the meter, momma wished that I was off the reefer\nBut, for now, I got this game up in the cobra clutch\nPlus, the silverback gorilla swigger, shot of Tequila to the gut\nNigga, trust, I got that Killa up\nWhat y'all ain't feelin' us? Ain't feelin' ya\nWhen half ya niggas posing similar, yea\nLadies and gents, I think this game need a enema, yea\nIt's \"common sense\", I Used 2 Love H.E.R., now they pimpin' her, yeah\nBut if you Enter the Wu-Tang, you tripping\nLike somebody tied together your shoestring, now listen\nI'm the, real deal, come on, come back to get ya like bad karma\nY'all niggas is throwing rocks with glass armor\nFuck the court system, pleading the fifth\nAnd if Def Jam is deaf, start reading my lips\nI'm cocky, possibly I got my reasons and shit\nThey ain't built a man that can stop me from feeding my kids\n\n[Hook: Method Man]\nAnd if you don't know where I'm coming from, never know where I be in\nMost likely, where ya start at'll be the place where you eating\nAnd anybody hating on him, hating on them\nThat's right, anybody hating on him, hating on them, motherfuckers\n\n[Outro: Method Man]\nHow could you ever say that I'm washed up\nWhen I'm the dirtiest thing in sight\n4:21... The Day After", "image": "https://images.genius.com/3ddccdf6d7612b941c3c9dfb5048829a.1000x1000x1.jpg"}], "artist": "Method Man"}