{"songs": [{"title": "Have You Seen Me?", "album": null, "year": "2013-11-07", "lyrics": "[Intro]\nToday's Thursday November 7th, 2013\nAnd I'm fed up with doin' all of this business Hopsin Knock Madness shit, man\nFuck this rap game\n\n[Hook]\nI swear to God I'm feelin' so sick (so sick)\nIt's like I don't know where my home is (home is)\nA nigga gone, you can see it in my eyes\nI ain't even got the strength to fucking cry\nSo tell me if you can find me\nWhere'd I go? Have you seen me?\nI don't know\nYou see I used to think that my money would bring me happiness and\nNow I can't believe this is happening, where did I go?\n\n[Verse]\nA nigga feel gone, lost, ain't got no purpose\nSpent a year locked in churches\nTrying to jot the verses\nBut I'm stuck with these rotten curses\nEvery time I rap you can hear the pain burn through\n'Cause I never had a real family to turn to\nI got shit on my nerves\nTo give me the urge\nTo yell curse words but I'm really tryin' to learn to keep it all under control\nBut I can't 'cause I'm stuck in a hole\nThe devil tryna puppet my soul\nMaking me a slave to the game, taking away my joys and then handing me a bucket of gold\nNo! I don't want it no more\nTake these groupies, I ain't fucking your whores\nImagine being fed when your stomache don't roar\nI wake up every morning and in a rugged cold war\nFuck my life, the fuck am I doin', man?\nHopsin, you're the man, I love all your songs I'm like a really big fan\nIssues occured and started back in high school when I used to get beat on\nNow I hide myself with contacts and the fame's a drug I O-D'd on\n\n[Hook]\nI swear to God I'm feelin' so sick (so sick)\nIt's like I don't know where my home is (home is)\nA nigga gone, you can see it in my eyes\nI ain't even got the strength to fucking cry\nSo tell me if you can find me\nWhere'd I go? Have you seen me?\nI don't know\nYou see I used to think that my money would bring me happiness and\nNow I can't believe this is happening, where did I go?\n\n[Outro]\nThis is not on my album...\nI just made it today 'cause I just needed to vent...and talk\nSittin' in this fucking basement, it driving me crazy...\nSigh...I'm weird now, I can honestly say that I'm fucking weird, I have changed\nBut I didn't go Hollywood...I don't know what the hell I - I don't know, man", "image": "https://images.genius.com/1620b55458e423f96bf6316d13418223.1000x1000x1.jpg"}], "artist": "Hopsin"}