{"songs": [{"title": "Droppin Em", "album": "Walking with a Panther", "year": "1989-06-09", "lyrics": "[LL Cool J]\nJust like Paul Lynde, you're all in...\n\nBrace yourself, I'm the ace with grace\nI'm a win the race and make you feel disgrace\nIn any case, yo, I'm movin like a steeplechase\nMC soldiers: about face\nNow step off, I need room for my takeoff\nMy custom made lyrics slay, yours are soft\nI think you better tape this, yo, you can't escape this\nYo, I planned it out just like a landscapist\nWhipper-snapper back up for comin' crap up\nI plan to trap a MC and kidnap a phony\nSo skip the baloney\nYou and your cronies need to jump on a pony\nAnd roll, cause you're just a rookie\nWhen it was time for rap school, you must have played hooky\nI'm the show-stopper, your rhymes are improper\nI'ma teach you like the master taught the grasshopper\nJust gettin warmer, I'm a transform a\nRegular rhyme into a barnstormer\nTry to jump, I'll pump you, chump, my job is thorough\nAny MC, state, city or borough will get ragged\nI drop like a sandbag\nSerious as the mob, I don't play tag\nBest of the batch, no man can catch up\nHoles can't be patched, our battle's a mismatch\nI flip lyrics like a acrobat\nAnd avoid combat like a diplomat\nBut when it's time for back-crack, or Jack to kill\nIt's a thrill to drill, a run-of-the-mill bill\nWith my skill, I'm the lord of rhymes\nAnd I be writing at a rapid pace way past my bedtime\nI rock the mic unlike some brothers I know\nI guess they flow, PSYCH!\n\n[Hook]\nI'm droppin 'em\nDroppin 'em\n\nYo, you're all in, stiff as a mannequin\nI'm sharp as a pin, and I'ma teach discipline\nI get busy like it's two of me\nEvidently, I'm hated by a few MCs\nBut so what? I just max like I'm playing the sax\nAnd take the crowd to the climax\nYo, Cool J, I never go astray\nI'm funky, you can hear me at the Milky Way\nYou're weak, wet grass, I'm cool as jazz\nGot razamatazz, ask my man Shabazz\nI know you're afraid because I'm self-made\nI invade, and blow up like a hand grenade\nMCs are terrorstruck, I'ma run amok\nCause your rhymes suck, you made a record on potluck\nJust a toyboy, can't stop my convoy\nRhymes I said last year were just decoys\nI'm like a fox, you annoy me like chicken pox\nI'm back with a style that's unorthodox\nYou must've had a teaspoon full of bull\nI'm like The Hulk, with more bulk, I'm powerful\nThey try to get with this, to me that's an insult\nBoys shouldn't mess with an adult, that's too difficult\nI enter like a giant saying \"fee fi foe fum\"\nThen rock the auditorium until there's pandemonium\n\n[Hook]\nI'm droppin 'em\nDroppin 'em\n\nDon't sleep, cause I'ma go deeper\nAll you sleepers, I'm the Grim Reaper\nMy rhymes are rising, the angle's getting steeper\nI hated Mussolini, Martini so I'ma sweep a\nEmcee, like he's one of the two\nBreak him into fragments right in front of you\nMic check, one, two, is too fundamental\nMy rhymes are monumental over an instrumental\nIn the center, I had to enter\nTormentor mentor experimenter and inventor\nOf lyrics, so all you nonbelievers\nIt'll echo in your dreams at night when you receive a\nRude awakening, you can't do anything\nYou enter my kingdom and you cry as men bring\nGifts to the prince of excellence and magnificence\nAlarm clock rings, you wake up, and you're convinced\nThat the crew invader, soloist exterminator\nGreater evader of ducks, concert crusader\nIs bad, my nickname's the circuit breaker\nEating up the world, acre by acre\n\n[Hook]\nI'm droppin 'em, word to motha\nDroppin 'em\n\nKnowhatI'msayin? Straight 'til 1999, droppin' 'em!\nYo, year 2000, yaknahmsayin?\nAudi man\nYo, I'm droppin' 'em", "image": "https://images.genius.com/35b951a9c90707d0d03de9bebbadefc6.999x999x1.jpg"}], "artist": "LL Cool J"}