{"songs": [{"title": "Cuttin’ Headz", "album": "Return to the 36 Chambers: The Dirty Version", "year": "1995-03-28", "lyrics": "[Verse 1: Ol’ Dirty Bastard & RZA]\nHere it is. Where’s it at? In the back. Got a stack\nThe Dirty Bastard. Yo, you Bastard flip the phat track\nHere I go, here I go, whether friend whether foe\nLet them know that I flow over the rainbow\nHit the deck. Aw, yep, *ch-ch plow* from the Tek\nTakin’ heads, takin’ necks. What the fuck they expect?\nI don’t know! I don’t care! I won’t fall! I won’t stare\nAt a ho, ’less I know that I’m going to the mo-\nT-t-tel, ’cause I’m lousy, my technique is drowsy\nStop tryin’ to foul me, sayin’ that we're lousy\nBut I’m a tyrant, defiant, walkin’ New York Giant\nPresident of the Wu, but I’m also a client\nIt’s the Wu, what, you knew what, you do what, what, who, what, what\nI don’t give a flying fuck about a chump\nCause his heart only pumps Kool-Aid\nSnatch a kid by the braids, and cut his head off\n\n[Verse 2: Ol’ Dirty Bastard & RZA]\nRhymes is rugged like burnt buildings in Harlem\nThe Ol’ Dirty Bastard from the Temple of Shaolin\nDirty to the brain like drops of acid rain\nClang, clang, clang, rhymes pluckin’ at your brain\nSo take a sip from the cup of death\nAnd when you’re shaking my right hand, I’ll stab you with the left\n*Whirr, whirr, whirrr!* Red alert, red alert!\nAson comin’ straight from the dirt\nOnce I go berzerk, mad brothers got hurt\nNuthin’ new in ninety-two, it’s time to go to work\nTrills, watch them scream once I hop on the scene\nThey fear the return of the fatal flying guillotine\nMr. Milli, that means I’m also militant\nDon’t wear no suit and tie, I’m no gentleman\nGettin’ laid, takin’ heads, that’s my hobby\nPunch a brother in the face who call me Robbie\nI be the RZA, call me that cuz-I\nNever liked the name I received from my poppa\nDirty deluxe, yo, I’m huntin’ for ducks\nSnatchin’ devils up by the hair, then cut his head off", "image": "https://images.genius.com/7985ae9f777e769efe184aff8b763e1c.1000x1000x1.jpg"}], "artist": "Ol’ Dirty Bastard"}