{"songs": [{"title": "Satisfiction", "album": "Compton", "year": "2015-08-07", "lyrics": "[Chorus: Marsha Ambrosius]\nSimple pleasures, rock star livin'\nDrugs and mansions, hit the ceilin'\nCars expensive, blow this action\nTrue revealin' - satisfiction\n\n[Verse 1: Dr. Dre]\nYeah, I mean, I listen to these rap records\nHalf the time I'm suspicious\nYou niggas sound so fictitious\nBelieve me, I know the difference\nI got some words for you niggas\nYou're the definition of (satisfiction)\nListen up, I been where you goin' three times and plus\nBig houses, cars, jewelry, bad bitches all around this motherfucker, uh\nI seen it all and guess what?\nIt's the (Satisfiction), you feel me?\n\n[Verse 2: King Mez]\nOh yeah, oh I see what you sayin'\nI know some niggas just like that\nFrontin' ass niggas, man, really ain't got no bucks like that\nStuck like that, its cool if you cool with gettin' love like that\nFlashin' down to Southside Raleigh\nYou'll be runnin' outta luck like that\nWhat I mean by that is why your name always in these rental records?\nSpendin' rent money gettin' that bottle service into your section\nYou leased your car, leased your house, leased your spouse\nKnow she leavin' if you run outta paper\nAnd might be smashin' your neighbor\nI know you think you a star 'cause followers clickin'\nGuess your ambition is to keep up with social tradition\nLike sneaker shoppin' some of you niggas is fuckin' sickenin'\n'Cause you'll take your soul out, just so you could fit in\n\n[Chorus: Marsha Ambrosius]\nSimple pleasures, rock star livin'\nDrugs and mansions, hit the ceilin'\nCars expensive, blow this action\nTrue revealin' - satisfiction\nSatisfiction\nSatisfiction\n\n[Verse 3: Snoop Dogg]\nCuz, fuck wrong with these niggas?\nThese labels always askin' me to do a song with these niggas\nDoc, I think its time for you to open up the pharmacy, nigga\nAnd change this fuckin' music shit, my nigga, you should consider\nNah, I've been doin' me lokin, keepin' these bad bitches open\nAnd keepin' 'em wet, yep, see 'cause Long Beach right by that ocean\nStill sippin' that gin and juice, my nigga, yep I'm still on that potion\nAnd all these random niggas fake as fuck and I'm still gettin' noticed\nGod damn, man, how we 'sposed to handle this shit, cuh\nEverything we built these niggas done dismantled this shit, cuh\nWe gotta get back to that real, that's on the dub\nAnother lesson from your uncle Snoop, what, what, what?\n\n[Bridge: Marsha Ambrosius & Dr. Dre]\nI'm just statin' the facts\nDon't get no realer than that\nSatisfiction, attention, listen, play your position, player\nShouldn't be too hard, my nigga\nIt's supposed to be like a lay up\nShouldn't be so hard to be yourself\nMy nigga, wake up\nStay up, pay up, straight up, cake up\nThat's what I'm made of, high? Yup\nMy life is all authentic, that's why I'm goin' way up\nYour satisfaction fictitious, your happiness is made up\n\n[Chorus: Marsha Ambrosius]\nSimple pleasures, rock star livin'\nDrugs and mansions, hit the ceilin'\nCars expensive, blow this action\nTrue revealin'\nSatisfiction\nSatisfiction\nSatisfiction", "image": "https://images.genius.com/19804ba7a9b6ceb36d0158950514927a.1000x1000x1.jpg"}], "artist": "Dr. Dre"}