{"songs": [{"title": "Keep Marching", "album": "The Unplanned Mixtape", "year": null, "lyrics": "[Verse 1: XP]\nStill trying to figure out what I find comfortin'\nAnd who's gonna take account for all this sufferin'?\nIt's not always gloomy, I'm assuming if you sing too\nIt might give me the power to wake up a-gain\nLet's be honest, it's kind of hard to find beauty here\nAnd a cobweb of a long leg, solace it would appear\nSolid, Mr. blockhead with a wooden spirit\nTell the doctor we're all dead and it's looking serious\nI've been at shows where the acted like they couldn't hear it\nSo I substituted my saliva for truth serum\nThis crooked look is piercing, it could burn a hole through you\nI see through your two-faced ways despite the both of you\nAskin' for a penny in a mechanical city\nBlack phantom of the back alleys, poet of the square smokers\nRappin' filthy where the animals with guilty pasts\nRation out their fat yellow bellies or the share holders\n\n[Hook]\nDamn it's cold here\nWill the people start dancing when the smoke clears?\nI need a reason to keep walkin'\nDay dreamin' of the evil in my walkman\nSay a prayer for the people in the audience\nSay a prayer for the people in their coffins\nAnd keep walkin'\n\n[Verse 2: Macklemore]\nVanish through the alleyways (ghosts)\nPast the green room\nAnd have drink tickets to the point where I can't perceive truth\nIf God is in the building then I can't see you\nEven if they put their hands up in the air that won't redeem you (shows)\nIt's the place where they start fables\nThey spend money on jack and coke but are flat broke when they hit the merch table\nNow we hand out for the wolves and the people that are hungry\nAnd won't sacrifice records to get some cheddar with their lunch meat\nI just pray for that some day, but around here we get more rain then we ever get a sun break\nIt's never enough to get something and I wish I could say that I was humble enough to be blessed at some king\nBut it feels like hip hop's dead, I don't know who killed it\nThe poison in the pen or in the heads of who built it\nIf I don't know the ledge how can I expect that the children won't jump to their death when they question what real is?\n\n[Hook]\nThe air is cold here\nWill the people start dancing when the smoke clears?\nI promise that I'll leap first\nJust a starving artist surviving off eating my words\nSay a prayer for the people in their coffins\nSay a prayer for the people in the audience\nKeep walkin'\n\n[Outro Talking]", "image": "https://images.genius.com/271e7551d2ccbead25e01c36162352d0.900x900x1.jpg"}], "artist": "Macklemore"}