{"songs": [{"title": "Undertaker", "album": "King", "year": "2006-03-28", "lyrics": "[Intro: DJ Drama]\nY'all niggas really thought we wasn't gonna do it again?\nCome on man, grand Hustle nigga, you know what it is\nT.I.P, DJ the fuck Drama, Young Dro, Young Buck\nI said P-$-C-what's-happenin'-nigga\n\n[Verse 1: T.I.]\nYo Khao!\nI'm a pimp type, nigga ridin' clean after midnight\nReady for the gun play, prepared for a fist fight\nRoll up on yo bitch and ask her what that pussy hit like\nFirst she acting funny, in a minute she gon' get right\nGet down, got her fuckin' with another bitch now\nI'm king of all that I survey, remember this is T.I.P. town\nHey, you ain't ready? pussy nigga better sit it down\nWe Mac-90, rock steady nigga spit rounds\nTurn yo stomach to spaghetti when it hit the ground\nToss the choppers in the Chevy, then we mashing down Campbellton counting all your Benjamins and Hamiltons\nAs far I'm concerned you just a job for the janitors\nDon't disregard I'mma God you a amateur\nHide behind ya bodyguards and ya manager\nI pimp hard throughout all the pages in the calendar\nBitch it's Pimp Squad: all action no cameras\n\n[Hook x 2: ALL]\nYou know what it is, you know what it do\nAnd you know what it is, and you know what it do\nYou know what it is, you know what it do\nAnd you know what it is, and you know what it do\nShorty we bury niggas, shorty we bury niggas\nShorty we bury niggas, shorty we bury niggas\nThe undertaker\n\n[Verse 2: Young Dro]\nHey, stand in on the trap with me\nMention me is blasphemy, 1000 round magazine\nMy partnas say no attackin' me\nI'm aged to the average beef, respiratory crushin beats\nFruit Chevy H.I.C, my lyrics hit like HIV\nSpray by me, Sniper Dro, murder come today by me\nBullet chip yo L I P and dirty all yo H I Ps\nShot both of yo homies, now they feedin' them through a I.V\nThe tray I be from the west side, where they say I be\nMay I be the ruler over all that I survey I be\nLaid back, yay's black, triple kiwi Maybach\nWeed match the Benz, kush triple kiwi 80 pack\nOld school baby crack. I'm tryin' to bring the 80's back\nHaitians get me Haiti crack, plus my momma hated crack\n'Til we got a evicted and I came through with them 80 stacks\nPlay it back, rewind where I live\nI'm a zone 3 hustla, niggas know what it is\n\n[Hook x 2]\n\n[Verse 3: Young Buck]\nMay we all bow our heads and pray for this nigga\nThe undertaker's comin' any day for this nigga\nThey hate him in the hood, for the dreams he been sellin'\nI read the paperwork and it seems you was tellin'\nYou know what it is and you know who I'm talkin' bout\nWhen the feds came, I didn't open up my mouth\nWhat you scared fo'? niggas know you been a ho\nIt's like....homey shit was all good just a week ago\nGet the goons ready, start up your vehicle\nAnd shoot at any fuckin' car you ain't seen before\nPick up the shells if ya use a automatic\nThey gave 50 years to my nigga Lil' Travis\nSet a booby-trap, let him trip over the wires\nThen he gon' be laying....right by the preacher and the choir\nAnd if u catch him 'fore I do, T.I. go and handle yo biz\nWhen you see me holla at me homie, you know what it is\n\n[Hook x 2]", "image": "https://images.genius.com/757a45da6a6e4106770d36a71b9d8b5b.300x300x1.jpg"}], "artist": "T.I."}