{"songs": [{"title": "Tunechi’s Back", "album": "Sorry 4 The Wait", "year": "2011-07-08", "lyrics": "[Intro]\nMan, fuck these niggas\n\n[Hook]\nTunechi's back, Tunechi’s back\nThat's all these bitches screaming\nThat Tunechi’s back\nAll eyes on me, nigga, picture, I’m rolling\nStrapped up with that Mac, masked up like a goalie\nMan, my bitch on that coke, she snorted four and a baby\nNow the bitch owe me; she sell that pussy and pay me\nThey saying \"Tunechi’s back! Tunechi’s back!\"\nAnd I brought them twins with me, nigga, Click and Clack\nLet's go\n\n[Verse]\nOut on bail, work on the scale\nPut some change on your head, boy, you on sale\nYeah I'll see you in hell, pop-pop, get well\nMake breakfast\n'Cause I got you walking on egg shells\nXan with that lean\nI ain't a begging motherfucker, but, nigga, please!\nAnd I aim this motherfucker at your memories\nAnd all my niggas Bloods, but we make you niggas bleed\nYeah, Bloody Mary\nI’m the one with the money, so I ain't the one with the gun\nAll I do is give the word to the one with the gun\nI’m triple OG, Fuque's splitting the Sweet\nFuck bitches, get money: mission complete\nMan, fuck these niggas, I ain't worried 'bout 'em\nThese niggas pure pussy, pull a pearl out 'em\nYeah, I got a virgin, I call her Madonna\nBut I ain't trippin', her head is a monster\nYeah, we do this for real\nSwear to God, I never shoot unless I’m shooting to kill\nYoung, wild motherfucker, pop you and a pill\nBoy, instead of writing raps, you should be writing your will\nYou a dead man\nI get to poppin’ this bitch, watch where your head land\nI ain't right, I swear to God, I need my head scanned\nStand up and eat that pussy while she on a headstand\nI’m a dog, ho\nCamo cargos, semi-auto\nMy bitch sniff more lines than a barcode, yeah!\nWish I could take a shot of Ciroc with Pac\nSorry for the wait, 'til my album drop", "image": "https://images.genius.com/a22efe31e108ac84ea44f489ff2716f3.320x320x1.jpg"}], "artist": "Lil Wayne"}