{"songs": [{"title": "See Me Now", "album": "My Beautiful Dark Twisted Fantasy", "year": "2010-08-11", "lyrics": "[Chorus: Charlie Wilson & Kanye West]\nI know you see me now, right now (You see me now, right now)\nI know you see me now, right now (You see, you see)\nI know you see me now, right now (Haha, yeah)\nI know you see me now, right now\n\n[Bridge 1: Beyoncé & Kanye West]\nI got my suit and tie, and I don't know if y'all know\nWell maybe y'all do, or maybe y'all don't\nBut I don't really care, it's how we on it all the time\nSo I'ma get my money, let's go\n\n[Verse 1: Kanye West]\nNow I'ma need you to kill the hypocrisy, this is an aristocracy\nI'm Socrates, but my skin more chocolatey\nWhat's up with who? That's old news\nI'm in a speedboat, in my boat shoes\nHuh? I swear my whole collection's so cruise\nI might walk in Nobu with no shoes\n\"He just walked in Nobu like it was Whole Foods\nThat nigga crazy, I told you\"\nImmature adult, insecure asshole\nIf you fall on the concrete, that's your ass fault\nIf you pass on a Kan' beat, that's your last fault\nGet what you ask for, I swear that your ass slow\nShe got a big booty but she couldn't drop it as low\n'Til you take your last ho and rope up all the cashflow\nWhen you gettin' money they be all up on your ass, yo\nWhen you gettin' money cops don't let a nigga pass, go\nStraight to jail yo, in a hellhole\nRight next to Lucifer, tell 'em I said \"Hello\"\nAsk if I'ma be there soon and tell him I said \"Hell no\"\nYo what you say when your people get outta jail, huh?\n\n[Bridge 2: Beyoncé & (Kanye West)]\nMy niggas is home\nI guess I got everything, everything I want\n(Let's go shopping, dog, let's celebrate)\nBut I don’t, no matter how good it gets, it’ll never be like before\n(Free Weezy though)\nNo women in the crowd, screamin' and it’s loud\nDoin' things not allowed and I swear it’s going down right now\n(You know what it is)\nI know one thing, my mama would be proud\nAnd you see me lookin' up\n'Cause I know she’s lookin' down right now\n\n[Chorus: Charlie Wilson]\nI know you see me now right now\nI know you see me now right now\nI know you see me now right now\nI know you see me now right now\n\n[Verse 2: Kanye West]\nPour the champagne, let your watch show\nShorty got a man watch, wrist look colossal\nI admit my first watch was a Fossil\nNow I’m in the Louvre, lookin' for fossils\n'Tention to detail is so uncanny\nAnd the whips on the Sprewells, it’s so un-Camry\nSomebody need to put us on camera\nThe world of Rollies and everyone families\nStay Jordan fresh, suits and Ferraris\nCute, your shorty watch Barney's, we head to Barneys\nEnd up at Marni, Giorgio, service from Sergio Tacchini\nLamborghini, the chain throw off the vertigo\nI know the flow just hit a hellified vertical\nThis the Christ year, last year was magic: 32\nLyrically, can’t none of y’all murder Ye\n'Cause y’all raps ain’t got no vertebrae\nI got style, ask June if she heard of me\nI killed the fur last Paris, raised the murder rate\nFirst of all, we all know the beats is\nLike a mix between Fergie and Jesus\nImagine the direction of this immaculate conception\nEvery one of His Majesty’s swim parties is pageantries\nCannonball off the divin' board when I am bored\nAll my homies GDs, but I am Lord\nRap god, Greek mythology\nAnd this life too crazy to think logically\nHere’s somethin' that you could use as an analogy\nMy life is like a child’s illusions become reality\n\n[Bridge 3: Beyoncé & Kanye West]\nNow go get my throne, 'cause I don’t wanna stop\nI just go in my zone, and I’ma make it hot 'til it’s time to go\nWhen it’s time to go, where you tryna go?\nYou better act like you can see me now\n\n[Interlude: Kanye West]\nExactly\nRosewood\nAha, aha\nI know you see me, I know you see me\nI know you see me, it's like I'm 3D\nI know you see me, I know you see me\nI know you see me, it's like I'm 3D\n\n[Verse 3: Big Sean]\nMan, today I am the freshest in the world, but that's the obvious\nDamn, I look so sexy, and you look like a pile of shit\nWhen I told my ex I love her, she went and married another\nAnd changed her whole name up, you a Yugoslavi' chick\n\"Be successful,\" that's what Dad told me\nSo everything I D-O, now I OD\nThey say G.O.O.D. Music like the new Miami Heat, shit\nComparin' them to us, man they gotta add Kobe\nWhoadie, holy moley went, from G-Shockin' to Rollie\nFrom the D, coppin' in Beverly Hills, I'm Axel Foley\nNah, nah, baby boy, you Jody, in the party, they all know me\nYeah, I saw your ass in line, boy, you was lookin' like the old me\nPresidential suit, my girls Michelle and Chanel\nShe gave me designer, uh, she keep it au natural\nI say it again, I'm chasin' cheese, dodgin' rat traps\nChasin' pussy you might end up with a Kat Stacks\nNasty trick, you's a nasty chick\nOoh, you know I like that nasty shit\nGot it made in every way, gettin' paid every day\nWhat Sean sound like, 'Ye protégé?\nHe sound like he a pro to me\n\"I know Kanye a jerk,\" how could you say that?\nHe rode me and my mama 'round in his Maybach\nWhat kind of jerk is that? What kind of jerks is y'all?\nFuck it if he a jerk, I bet you jerk him off\nBet you take it off or chase him through the mall\nWe workin' twice as hard, so everything come in twos\nDouble drinks, double girls\nWe be gettin' paid like W-2\nRep Westside, throwin' up Ws\n\"We love you Sean,\" I love you too\nOoh-ooh, you know I do\n\n[Outro: Kanye West]\nHey, feel like one of those old R. Kelly joints, right?\nI bet they put me back on the cover of Ebony now\nI know Jet magazine calling right now\nYou looking good today too, I like that\nYou got your new suit on and she got the extra cute on\nI know you thinking, “This that Yeezy we all love”\nI’m back, baby, we back, baby\nUncle Charlie, by the way\nAnd I’ma let you finish, but I got Beyoncé on the track\nThat’s what it is\nBlack excellence, baby\nThis is the elite\nWe the greatest in the world baby, we the greatest in the world!!!\nHahahahaha\nYeah, Lex Luger, No ID, Yeezy\nUh", "image": "https://images.genius.com/f3df8f5e72bd83774636e4ae647f1142.1000x999x1.png"}], "artist": "Kanye West"}