{"songs": [{"title": "The World Is Filled...", "album": "Life After Death", "year": "1997-03-25", "lyrics": "[Chorus: Carl Thomas]\nThe world is filled with pimps and hoes\nWe'll just talk about those I knows\nThe world is mine, can't you see?\nI'm just tryin' to be all I can be\nOhhahhoahh, yeah\n\n[Verse 1: Puff Daddy]\nNow first come the cash, then come the ass\nThen come big blunts with big chunks of hash\nWhen I score with a whore, she be game for sure\nPimp so hard a nigga drag his mink on the floor\nWon't you admit it? I ain't gotta talk because I live it\nAny chick fuckin' with me, believe me, that's a privilege\nI won't be satisfied til all my niggas get it\nSee, you hit it then I hit it, we get it back to split it\nAnd Big be that nigga, we be flyin' through your hood\nAnd hood rats scopin' with their eyes on my goods\nSee, we date 'em like we hate 'em, see 'em like we don't need 'em\nTreat 'em like we beat 'em, and never give up freedom\nAnd we only give our number to selected few\nAnd it's best that you never knew what good head'll do\nTurn a freak to a bisexual\nAnd if she's flexible, fuck the nigga next to you\n\n[Chorus: Carl Thomas]\nThe world is filled with pimps and hoes\nWe'll just talk about those I knows\nThe world is mine, can't you see?\nI'm just tryin' to be all I can be\nOhhahhoahh, yeah\n\n[Verse 2: The Notorious B.I.G.]\nUhh, uhh, uhh\n\"When the Remy's in the system, ain't no tellin'\nWill I fuck him? Will I diss him?\", that's what these hoes yellin'\nI'm a pimp by blood, not relation\nY'all still chase 'em, I'll replace 'em\nDrunk off Dom, silk and gators\nSpittin' words, make a bird tell they flock see you later\nWhether, drunk or high, skunk or Thai\nNigga play against some playa shit, slugs gon' fly\nAin't gon' lie, pimped out her SSI\nNigga don't ask why, just respect it\nShe bought me the necklace, the bracelet\nThe Benz-o - she laced it\nCrib-o, got it, interior decorated\nNow my popularity grew in each state\nNow I got 2 in each state\nUsed to drink brew and eat steak\nNow I pop bottles with models, larger steaks on large estates, shit\n\n[Chorus: Carl Thomas]\nThe world is filled with pimps and hoes\nWe'll just talk about those I knows\nThe world is mine, can't you see?\nI'm just tryin' to be all I can be\nOhhahhoahh, yeah\n\n[Verse 3: Too Short]\nI had a whole lot of bitches in my lifetime\nI been blessed with the game, always say the right lines\nHad a few prostitutes, and if you knew the truth\nThey're like pimps, you can't let em do it to you!\nShe ain't no sucker, I know that bitch, man\nShe wanna be a Pretty Woman lovin' a rich man\nNow here you come, drop top ridin'\nYou ain't no pimp, fake nigga, stop lyin'\nPussy makes money, stick to the business\nThink about the real motherfuckers that lived it\nStreet life, pimp shit, make the ho respect the game\nYou bought her diamonds and cars, trick, that's a shame\nSay what you want, but I still figure\nShe left you 'cause you couldn't be like them real niggas\nShe was a hustler by nature and you was just faker\nThan the average simps, found a badder pimp\n\n[Outro: Too Short]\nCrazy ass man\nI never would have bought that bitch all them cars\nAnd all that shit you bought that hoe, man\nAfter I heard about what the bitch did nigga, knew the hoe!\nMan I'm 30 years old, nigga\nAnd that bitch was hoein' when I was in 9th grade and shit\nThink about that: she been around then right?\nShit, you just a rest haven for hoes, man\nJust the first nigga that came along when the bitch got out the pen\nBitch only fuckin' with you cause you had a good ass job, nigga\nNerd...treat the bitch better than anybody ever treated her\nStupid ass nigga, she ain't nothin' but a hoe!\nBet you fell in love with her man!\nYou can't turn a hoe into a housewife, fool\nEvery time you turn your back, that bitch is fuckin' with them gangstas\nEastside, Westside - these are my partners\nDo that shit, you know what I'm talkin' 'bout nigga\nI tell you about some real pimps and hoes\nTell you about these pimps and these hoes man\nYeah I know a few, shit\nBeyotch!", "image": "https://images.genius.com/f4413efc6682e8c2cfa7a01117fc8cd5.1000x1000x1.jpg"}], "artist": "The Notorious B.I.G."}