{"songs": [{"title": "A Minute to Pray and a Second to Die", "album": "Mr. Scarface is Back", "year": "1991-02-28", "lyrics": "[Verse 1]\nLife goes on in the streets of my hood when you die\nBut some cry, and gets by, while others choose to wonder why..\nHis life was took at such an early age\nA young nigga who lived in a rage died by the gauge\nHe used to hustle on the street corners\nHis mom would always beg him to quit, but he didn't wanna\nAs he got older, he got even worse\nTil a real nigga showed him the purpose of a hearse\nA cold night in his hood, he had a tangle\nThe brother he was squabblin with, had broke his ankle\nLaid him out in the driveway\nSome people knew he wouldn't survive, but hey\nI ain't the one to speak up on another's\nAll I can do is try to open his eyes and help the brother\nHe chose the wrong way and that's the route he took\nBorn and brought up as an angel but he died as a crook\nHe had a baby that he couldn't raise\nAnd she will never see her father again, cause he's in a grave\nHey yo, let's think about it, nilla\n\"My daddy was a dopeman, so I'mma be a dope dealer\"\nHow will the family explain it?\n\"My daughter had a baby for a 'caine head!\"\nHe ain't around to see her walk\nDry her eyes when she cries, pick her up when she falls\nJust the thought of a kid livin fly fucks me up\nWhen his girl has to raise a BASTARD child\nIt gets deeper, he used to punch her and beat her\nShe was loyal to his ass but accused as a cheater\nShe had a good deck but she picked the wrong card\nHad a kid, now she's realizin life is hard\nA big time dope dealer's all she wanted\nWho drove a Jag or a Benz so she could flaunt it\nThe situation's got me guessin..\nBut the answer remains to be a question\nHe lived his life in a lie\nI guess you only get a minute to pray, and a second to die\n\n[Verse 2]\nIt was crazy how it happened\nSome niggas rolled by in the Riviera cappin\nAll I could see was a pistol spittin rounds\nAnd the boy was just screamin as he fell to the ground\nA woman yelled - get an ambulance\nBut I knew he was dead, he didn't stand a chance\nYou shoulda seen him, he was scared\nA bullet goes to his chest, and one to his head\nHe just laid there in silence..\nAnd all I heard was the sirens\nParamedics pulled up..\nFollowed by a law man and then came a firetruck\nPut his ass on the stretcher..\nBut if he survives, I'm willin to betcha\nHe'll be out for revenge\nThey patched him up within a week he was back at it again\nWent to his brother on the Northside\nGrab your shit, it's a hit, we're gonna take a long ride\nPacked it up in the trunk\nAK-47, M-11 and a pump\nRolled by Worthing on Scott Street\nSchool was lettin out\n\"Yo you ain't gonna shoot yet?\" \"WATCH ME!\"\nOpened his trunk and grabbed a shotgun..\n.. he shot him\nPut his tooly on the front seat\nContinued his mission, as he headed down the street\nThe kids was just starin at each other\nJ.D. rolled by and smoked Black’s brother\nReached in his coat and grabbed a 'port\nFull speed down Reed, shot his mom on the porch\nOn his way down Cullen\nHis brother was just dazed in a shock, \"Why you do it?\"\n\"Why you shot his moms Jay? Shit\"\n\"Hehehehehe.. hah man fuck that bitch\"\nWent to the store to use the payphone\nCalled up Mack, \"Aiyyo J.D. homey\"\nHung it up and rolled down Dacca\nHeadin for the nigga he was after\nBy the time he arrived at the scene\nMalcolm was ready for anything\nHe tried to sneak around the back way\nNever thought of bein taken out on that day\nBlack boy, black coat\nStood around the corner as he passed slit his throat\nHe didn't fall so he fired\nOne to the middle of his skull, he's expired\nA whole army came out\nTwenty-seven niggas all strapped out of one house\nThat how it happens in the Acre\nOne nigga died in the park in the paper\nShit gets deeper but why?\nI guess you only get a minute to pray\nAnd a second to die", "image": "https://images.genius.com/bfc55f1e39dab482dd5f87425202cda6.453x450x1.jpg"}], "artist": "Scarface"}