{"songs": [{"title": "It’s Personal", "album": "Year of the Dog... Again", "year": "2006-08-01", "lyrics": "[DMX]\nWe all got guns, we all got dogs\nWe all gon' make that trip to the morgue\nWe all find it harder to see through the fog\nWe all know the difference between right and wrong\nWe should all live life by one fact\nBefore you doin dirt, the dirt gon' come right back\nI seen cats go out like suckers\nI seen cats get down like, \"Yo, them some bad motherfuckers\"\nI see fake niggas and the games they play\nAiyyo, I deal with that bullshit e'ry day\nBut that ain't gon' stop me from doin what I'm doin\nI got things beside bullshit to be pursuing\nIt's that craft for me, the half of me\nLet through niggas in the door after me\nYo, somebody stop me; please, somebody come and get me\nIf I go, I'm taking niggas with me!\n\n[Hook: Styles P.] - repeat 2X\nDog nigga, Ghost nigga\nHop the bar with the toast nigga\nIt's like the Lord getting close nigga\nIt's personal, now we gotta smoke niggas\nIt's personal, now we gotta host niggas\n\n[Styles P.]\n(Dog nigga, what up!) Nigga fuck the cop and the warrant\nYou get a chance, pop an informant\nAll I need is a Glock and I'm touring\nHit every hole in the wall, have me a ball\nAnd then slide the fuck out in the top of the morning\nIf you hear me cockin it on 'em, I'm poppin it on 'em\nI don't fuck around nigga, better stop it and mourn 'em\nAnd who the fuck asked you to rhyme?\nI'm the Ghost, when I come around, they throwing up the hazardous sign\nAnd you ain't around chemicals, just around generals\nWho spend, passing they time, blasting they nine\nRather die with my man then the five for ya livewire\nSpend half of ya time, smashing ya spine\nOther half we getting money and more money\nYou think about cars, I got \"goin to war\" money\nThat P and that dog money, we still in the front of the store, money\nAnd if anybody slip, they getting sent to the morgue, money\n\n[Hook w/ Jadakiss adlibs] - repeat 2X\n\n[Jadakiss]\nIt's like lately I've been feeling so weak at the knees\nAnd speaking to niggas is just like speaking to thieves\nSo I keep the hawk ready to eat 'em\nGuess already? Then meet 'em\nI'm fair game, but I'm ready to cheat 'em\nThe streets ain't right now, the Colgate White is light brown\nThese niggas ain't nice, they nice clowns\nThat's why I'mma start layin them right down\nAnd have 'em there layin in the casket, ice down\nJacob watch on 'em, mortician must've been hazed up\nCause you can see the makeup spots on 'em\nThis is way beyond ya Avion\nThe Golden King, more like Polo Spring\nAnd what makes it even worse, aiyyo it's that it's personal\nMaybe even ya Earth can go\nI'll make it where they can never find the bitch\nRight outta the bar, with all kind of shit\n\n[Hook] - repeat 2X\n\n[Outro: Styles P.]\nYeah, y'all niggas can get caught up in the hype if you want\nBodies drop over here, this is not a game man\nYou wanna get caught up in the hype again? Then you can fall in the hype again\nThis is a movement, Double R, nigga you know what's up\nAnd if you don't, you gon' get to know what's up\nYeah, we ain't playin wit' y'all niggas this year\n'06, '07, and on, nigga what's up?\nPop off! You know how I work!", "image": "https://images.genius.com/3843bd8bdb5f681116b197d8a9226af4.300x300x1.jpg"}], "artist": "DMX"}