{"songs": [{"title": "Love 2 Dislike Me", "album": "Something Else", "year": "2013-07-30", "lyrics": "[Intro: Liz Suwandi]\nI am your fool\nLoving you, I shouldn't\nYou take me, chain me\nI have nothing anymore\n\n[Verse 1: Tech N9ne]\nYou want a regular dude, but you think that I'm what you need?\nYou gonna get in your mood, wanna bitch in every text you read\nSometimes I think I wanna let you breathe, but I'm the enemy if I set you free\nI gotta let you know that it gets to me, ready or not like a refugee\nYou complaining when I see you\nThat I never have time, that I'm busy as a beaver\nFoul face when i feed ya\nReally need hennessy, that be my fucking reliever\nWhy you wanna stand and cry the most\nAre you thinkin' that I’m for you to try the coke\nTo knot the hole, really wanna tie the ropes\nSay by default and hang Nina by the throat\nYou must really like my imperfections\nCause you stay on dismay, temper detections\nAnd thats nightly, too much messing with my psyche\nThat enough hurts, but you fight me\nSo you must love to dislike me\n\n[Hook: Tyler Lyon]\nWhat did you ever see in me?\nWas I only what it needed be?\nI'm running away from your judgement\nDon't you try to find me\nI won't let you change me anyway, anyway\n\n[Verse 2: Tech N9ne]\nYo, I'm feeling stoned now\nSick of having those breakdowns, they gone now\nIt's on now, I've grown foul, it's wrong how we've shown clouds\nYou keep your tone out of my dome, gal\nI'm sick of this shit\nAll the picking and the pulling, I don't dig it a bit\nLiving and learn what I want and what I'm giving 'em living 'em digging a ditch\nDick I wanna fit up in this\nYou stayed out of my premises\nBut you ain't supposed to be my nemesis\nWanna be in to kiss, never to finish it\nWhat happened to close friends with benefits?\nI'm mad as hell\nCause I wanna be back when we had it well\nAll this static's problematic like grabbing a rabbits tail\nAnd thats nightly, too much messing with my psyche\nThat enough hurts, but you fight me\nSo you must love to dislike me\n\n[Hook: Tyler Lyon]\n\n[Bridge: Liz Suwandi]\nInside I wanna find somewhere I can hide\nAway from all the faded dreams and tainted lies\nI wanna tear you up and love you all at once\nYou quit and score so give me more\nGive me more, give me more\n\n[Outro: Tyler Lyon]\nDon't tell me everything's okay\nI'm only dying just to be\nYour one and only everything\nAnd all you do is kill me\nDon't tell me everything's okay\nI'm only dying just to be\nYour one and only everything\nAnd all you do is kill me\n\n[Outro 2: Tech N9ne]\nYou point out all my imperfections, but yet you stay\nThat's nervewrecking\nI can't live this way", "image": "https://images.genius.com/ae74b38ee85ff63c76433b31ae507a23.1000x1000x1.png"}], "artist": "Tech N9ne"}