{"songs": [{"title": "No Fucks Given", "album": "Pound Syndrome", "year": "2015-07-24", "lyrics": "[Verse 1]\nYo, you ever had a homie you did everything for?\nBut when it comes down to helping you, they barely support?\nWhen you around them you feel like you stuck with various chores\nThey dead weight, but you love 'em too much to bury their corpse\nSo you keep 'em around, hoping that the sun gon' shine\nAin't no harm and I'mma give this nigga one more try\nAnd then they screw you again and you like, fuck no, why?\nAnd that's the second you know that you gotta cut those ties\nMan they been taking advantage of you, aiming they madness at you\nYou can't even tell 'em, they unable to handle the truth\nThey full of shit, you gotta spend a day scrambling through\nTelling me you sorry, I'm like uh uh, that isn't new\nThat's when you gotta turn your back and put your foot down\nIf you put up with it, you gonna get put out, nigga don't you wuss out\nSee I've been boxing with this issue for some good rounds\nMy circle is smaller, come take a look 'round, I'm good now\n\n[Hook]\nIf you never gave a fuck about me\nThen tell me why I should give a fuck about you\nOooh, y'all never gave a fuck about me\nNever gave a fuck about me, oh no\nI said if you never gave a fuck about me\nThen tell me why I should give a fuck about you\nI'll never, ever, ever, ever\nEver, ever, ever give a fuck about you\n\n[Verse 2]\nYou ever dated a woman that held you back?\nShe ain't making no moves, you like, yo where the hell you at?\nLife is valuable girl, I shouldn't have to tell you that\nCause you grew up with some bums who knew nothing but selling crack\nShe'll tell you that she'll do better and convince you\nYou move her in with you to fix the issues, you assuming it's gonna be simple\nBut shit didn't change, now there's something deadlier emerging\nAnd her situation just became a heavier burden\nNow your life is more than crazy, you fighting on the daily\nMan it's time for her to go, you done decided, no debating\nCause there ain't no light shining on the future\nShe wasted all my time and all my mula\nAnd she ain't even grateful for the cheddar I blew\nEff it, I'm through, bitch, I'm no longer messing with you\nYou ain't nothing but good for nothing, that's what evidence proves\nAnd now you're just another topic when I step in the booth, bitch\n\n[Hook]\nIf you never gave a fuck about me\nThen tell me why I should give a fuck about you\nOooh, y'all never gave a fuck about me\nNever gave a fuck about me, oh no\nI said if you never gave a fuck about me\nThen tell me why I should give a fuck about you\nI'll never, ever, ever, ever\nEver, ever, ever give a fuck about you\n\n[Bridge]\nSee life's just a crazy cycle\nWhat repeats itself, I know\nAs I grow, I learn from all the mistakes I made\nShit, I'm better on my own\nYou've got a lot of niggas around and they'll cut you\nIt's important that you learn to say fuck you\nYeah, they never gave a fuck about me, oh, na, na, na\nThis is the last laugh, ha, ha, ha, ha, ha\n\n[Verse 3]\nMan I don't get involved with these phonies no more\nI just open the door, and kick 'em all out, I don't keep 'em close\nBeen through this shit too much, you don't even know\nDamn, you used to be the trophy of my life, but now that trophy is broke\nAnd now you're wondering why I don't text back or call you\nI deleted you out of my phone, bitch, who are you?\nPay attention close, I hope I come clear\nBitch, if you looking for a fuck, you won't find one here\n\n[Hook]\nCause if you never gave a fuck about me\nThen tell me why I should give a fuck about you\nOooh, y'all never gave a fuck about me\nNever gave a fuck about me, oh no\nI said if you never gave a fuck about me\nThen tell me why I should give a fuck about you\nI'll never, ever, ever, ever\nEver, ever, ever give a fuck about you\n\n[Bridge 2]\nI got no more fucks to spare\nI got no more fucks to spare\nNigga what is the purpose?\nWhat is the purpose?\nIt is not worth it\nI got no more fucks to spare\nI got no more fucks to spare\nNigga what is the purpose?\nWhat is the purpose?\nIt is not worth it\nI got no more fucks to spare (things coulda been so cool with us)\nI got no more fucks to spare (so cool with us)\nNigga what is the purpose?\nWhat is the purpose?\nIt is not worth it\nI got no more fucks to spare (things coulda been so cool with us)\nI got no more fucks to spare (so cool with us)\nNigga what is the purpose?\nWhat is the purpose?\nIt is not worth it\n\n[Hook]\nIf you never gave a fuck about me\nThen tell me why I should give a fuck about you\nOooh, y'all never gave a fuck about me\nNever gave a fuck about me, oh no\nI said if you never gave a fuck about me\nThen tell me why I should give a fuck about you\nI'll never, ever, ever, ever\nEver, ever, ever give a fuck about you", "image": "https://images.genius.com/e4079e5e3fa49647b0a22cad37ceae57.1000x1000x1.jpg"}], "artist": "Hopsin"}