{"songs": [{"title": "Hot Wheels", "album": "Fuck Da City Up", "year": "2012-01-01", "lyrics": "[Intro: Young Dro & Travis Porter]\nTP: Hey, hey, hey, hey, hey, hey, hey, hey\nYD: Okay. Aye they ain't gon like this shit right here\nTP: Whoa, whoa, whoa, whoa, whoa, whoa, whoa\nYD: Aye Tip, check this out, aye, push it. Travis Porter what's hannin', push it!\n\n[Hook: Travis Porter]\nI'm in at Hot Wheel and I'm driving real fast\nAnd I'm smashing on the gas, I'm tryna do the dash\nHot Wheel: got 200 on the dash\nMan I'm driving real fast, I'm tryna do the dash\nPush it! (hey, hey, hey, hey, hey, hey, hey)\nPush it! (whoa, whoa, whoa, whoa, whoa, whoa, whoa)\n\n[Verse 1: Strap (of Travis Porter)]\nI'm in a hot wheel til I light this here\nTap my bitch she switch my gear\nDiamond shining they all clear\nPHMG they all here\nTattoos they all over me\nShe see me kissin all on my tip\nHe say I'm a rookie nigga, I been doing it for years\nHe say I'm a rookie nigga, I been doing it for years\nBetter take a look at me, better check my booking fee\nI been cooking shit off in the kitchen but I ain't Lil' B\nPull up in a Hot Wheel, bitch need a green card\nAll-red candy paint, nigga this your dream car\nI'm that muthafuckin nigga all the bitches scheme for\nWhen she with me, she be hoping all her girlfriends seen her\nShe suck a dick so good, but why you think she on my team for\nI got her dancing slow, in slow mo like she on lean or something\nSmoking on that dro, got that ho drinking semen\nHear me coming down the street: 'Rari, screaming\nPinky ring doing numbers, shining, blinging\nInk all on my body and I'm hotter than a demon\n\n[Hook]\n\n[Verse 2: Young Dro]\nHold on let me rip this ho\nCar so fast I flipped that ho\nTell them boys don't play with Dro\nPause that bitch, skip that ho\nBlack coat let my coupe in here\nDecapitate my roof in here\nThe reason why they ask for Dro cuz they wanted the truth in here\nJust like Star, I'm rockin ya\nRoll up wrong I'm poppin ya\nI knew something was fishy going on like tilapia\nYou ain't fuckin with pimpin though\nMy wrist blow up like indigo\nI like a model bitch but I would rather Oprah Winfrey though\nThe richest bitch up in this bitch\nMy paint flop and then flip in this\nMy Glock it got a clip in it\nMy car so wet it's drippin shit\nThey copy me like Kinko do\nDiamond chain, one pink one blue\nCar so fast, my speakers on blast\nDon't race me boy, I'm shittin on you\nHold up they can't take this shit\nI spaz out with no brakes and shit\nI'm Bosco with this cake and shit\nCongo dro, ape and shit\nI saw yo broad and took that bitch\nWassup with all that liquor shit?\nYou see these horses on my car\n'Rari bitch I'm pushin it\n\n[Hook]\n\n[Verse 3: T.I.]\nI'm mindin mine, in 599s\nNew Ferraris, know that I'm ballin ho\n400,000 in public housing, This is all louder than a blunt of dro\nThrough Atlantic station I'm pushin\nEvery corner I'm hookin\nBad bitches just lookin\nTryna throw me that pussy\nSay what happened baby I can't\nCause them niggas cool, but they ain't shawty\nWrist froze and I can't thaw it\nHundred mil well that ain't hard, I'm hard\nAs a muthafucka, swear to God, I'm God\nTo the trap niggas and dope boys...pause\nBlow a half a mil just cause, ball\nMoney ain't a thang, not at all\nDrink the lean and get kool-aid\nGet high on pills for like 2 days\nFresh to death in that Louis\nDiamonds clearer than Blu-ray\nAye! Ain't no fugazi, I'm too major, I'm super paid\nSay 30 mil, you better double that\nThat money short then we double back\nGot rubber bands around 30 racks\nI'm trouble man so where the trouble at?\nI got a truck load of them hood rats\nI'm pushin' through, where your hood at?\n\n[Hook]", "image": "https://images.genius.com/c4a42649ba1a4f401f2ed78317e312fc.1000x1000x1.jpg"}], "artist": "T.I."}