{"songs": [{"title": "Pray 4 Love", "album": "Rodeo (Deluxe Edition)", "year": "2015-09-04", "lyrics": "[Chorus: The Weeknd]\nOh-ohh, don't pray for love\nOh-ohh, say it loud\nJust ask the lonely, oh-oh\nJust ask the lonely, oh-oh\n\n[Verse 1: Travis Scott & The Weeknd]\nPray for who lost they fate and died too young\nPray for the ones I hate, the ones I love\nPray for my liver when I'm off in this club\nI pray that the demons go away, they hauntin' us\nMan, I can't take no more of this lifestyle we been living\nMan, I can't take no more of the white powers in position\nGotta grab up J-Will, gotta scoop up J-Rich\nTold Chase we ain't going back, you know we gotta hitch\nI mean, I'm aggravated, agitated, I admit\nIntoxicated, animated, got me feeling kinda lit\nContemplating fornicating, might as well fuck up some shit\nThey looking at me way too crazy, got me feeling communist\nBut I'm just trying to save the throne, pray for Bones, pray for Stix (Just ask the lonely)\nIf my album never sell, then we gon' hit that lick\nTell Lamar, call up Cash, tell him buzz me at the Ritz (Just ask the lonely)\nIt's the weekend, we off the deep end, you need to pray for us\n\n[Chorus: The Weeknd]\nOh-ohh, don't pray for love\nOh-ohh, say it loud\nJust ask the lonely, oh-oh\nJust ask the lonely, oh-oh\n\n[Bridge: Travis Scott]\nPills (Pills, pills)\nHave you ever been through life's (Through life's)\nChallenges? Promises? Promises? (Challenges? Promises? Promises?)\nGet down, heartbreak (Get down, heartbreak)\n\n[Verse 2: Travis Scott and The Weeknd]\nLet me tell the lost tale about Jacques\nLet me tell you how I turned Scott\nHow I went down on the block\nWaterfall around ten o'clock\nAnd how we came up getting all the knots, dodging cops, yeah\n'Fore a nigga had the locks (Just ask the lonely)\n'Fore a nigga had the chain, 'fore I had the bops\nAlways kept my city on me like it was a swatch (Just ask the lonely)\nEvery time we in the party, took it up a notch\nNow I'm thinking 'bout this new girl, and she doing pop (Oh-oh)\nWanna know my dick longer than a Pringle box\n(Don't pray for love)\nTired of seein' these black kids on the face of FOX (Oh-oh)\nAnd fuck CNN, they don't wanna see us win (Say it loud)\nMama, don't you worry no, no more, worry no, no more (Just ask the lonely)\nI'ma take you from the first to the ninetieth floor\nYou always told me what I plant, that shit gotta grow (Just ask the lonely)\nAnd anything I detonate, that shit gotta blow\nPray for love\n\n[Bridge: The Weeknd & Travis Scott]\nNo, ooooh\nWe don't pray for love, no more, no more\nWe don't wanna see you on the cover of a carton, no more\nWe don't wanna see you on the news, no more\nAll alone\nHm, no, no, no, no, no, no\nHm, no, no, no, no, no, no\n(Just ask the lonely)\nHm, no, no, no, no, no, no\n(Just ask the lonely)\nHm, no, no, no, no, yeah\n\n[Verse 3: The Weeknd]\nUnderrated is an understatement\nThey tryna test greatness, a nigga tryna get paid\nThese niggas fiends watching all of my moves\n'Cause the music like crack, got me cooking all day\nI'm right here, you know where I stay\nAnd if you don't, then ask your girl, she probably know the way\nShe like my show lights, she want to be wife\nShe know that if she got me that she gon' be good for life\nSo I pull out for the climax faster than a hi-hat\nSorry baby, I don't play\nAnd if I did, you know my kids would be ballin'\nAnd my daughter gon' never meet a nigga like me\nMy niggas pull up in that Rolls-Royce\nLike they sell that coke, boy, shout out to the Coke Boys\nThey never pray for us, nobody pray for us\nNobody pray, no, no, no, no, no\n\n[Chorus: The Weeknd]\nOh-ohh, don't pray for love (Oh, oh)\nOh-ohh, say it loud (Oh, oh)\n(Just ask the lonely)\nJust ask the lonely, oh-oh\n(Just ask the lonely)", "image": "https://images.genius.com/937ebfe41ce59f14c6ecff9976182911.600x600x1.jpg"}], "artist": "Travis Scott"}