{"songs": [{"title": "The Do Wop", "album": "Bigger and Deffer", "year": "1987-05-29", "lyrics": "L.L. Cool J\nServin em well\nAnd as you all know..\nI AM - HARD - AS HELL\n\nWoke up at 9:30 on a Saturday morn'\nHemmed my remote control, turned my stereo on\nThen I reached for a brush since I don't use the picks\nAnd the floor was kinda cold, so I put on my kicks\nWalked to the kitchen and ate some cornflakes\nAs I bop to a tape of Cut Creator's breaks\nWith hardcore - heavyweight - b-boy blast\nConnoisseur of hardcore, and Cut Creator's fast\nJumped in the shower, it was boiling hot\nSo I stayed there a hour, cause I like it a lot\nJumped out, dried off, put on the Devin cologne\nThen I called up Earl on the telephone\nHe told me 'bout a jam that I could do later on\n10 g's plus a limo for one strong song\nSo I said, yeah, I was with it, hung up and got geared\nGot a magnfying glass, then I brushed my beard\nRewound some tapes of some Def Jam tunes\nAs I waited for this freak to ring my bell at noon\n12 o'clock came, left the door crack\nThe freak walked in, a mink on her back\nPut her coat on the rack, threw my [sess robe?] on\nThen I threw in a tape of the quiet storm\nWe drank Round Hill Cabernet Sauvignon\nShe said, \"L.L., when you're gonna let me taste your tongue?\"\nMy skin got pale, I wam-bammed the tail\nDid it so hard I shoulda went to jail\nShe left, Earl came over and we went outside\nJumped in the BM to bust a joyride\nWent up to A.J., in my fresh black wheel\nI'm not a sucker on the corner tryin to scrape up a meal\nThe girlies want sex, the fellas try to plex\nBut those who flex end up with broke necks\nSigned some autographs for a posse of freaks\nSaid, \"It's L, baby, I ain't down with Chic\"\nConversated with the skeezers for 10 minutes more\nThen I jumped in my ride and the freaks slammed the door\nDue cause I'm a gangster people think I do crimes\nThey don't know I'm just a connoisseur of hip-hop rhymes\nSome smile, try to call L.L. a hoodlum at times\nBut he don't know my autograph's on his wife's behind\nL.L. has iced all the washed up slobs\nVigilante of rap, so to hell with the mob\nDon't run from the cops, makin suckers jock\nAnd I'm only 18 makin more than your pops\nTormentor of toys and boyscout boys\nAnd I dare any critic to call it noise\nPeeped at the clock, it said 6:03\nSaid 'later' to Creator and broke out with E\nWent up to White Castle for a chocolate shake\nThinkin 'bout a 100,000 that I'd soon make\nFinished up the snack, jumped up, out my seat\nE-Love hit the table and he made up a beat\nKicked a few lines, stepped out the door\nSaid \"Tonight is a bore, I'm in the mood for more\"\nWe jumped in my ride, I took a peek at the time\nIt was almost 7:30 and the show was at nine\nL.L. Cool J will soon stand at a jam\nWith thousands of people screamin, \"Touch my hand!\"\nBut since I had a hour plus a half attached\nI was searchin for the cutie who's my perfect match\nHer name was Renee, her face was okay\nBut she had the kinda body that made Jay wanna play\nI said, \"No need to rehearse,\" then I made my approach\nSaid, \"You got a good team, girl, but you need a new coach\"\nSaid, \"My name's L.L. - Cool, if I may introduce\nBut I'm not here for conversation, I'm here to seduce\nWanna mix it up, baby, wanna feel you grind\nCause it ain't 5th grade, and these ain't nursery rhymes\nAnd I know that you adore my sure side hardcore\nCheck out the real L.L. behind closed doors\nSo tell your buddies you're busy, tell your boyfriend beat it\nForget the silk dress,cause you ain't gonna need it\nUnplug your clock, do away with the light\nAfter five minutes or more you hear me say, 'That's right!'\nYour body is bad and I heard you got a Caddy\nWhen we make love you can call me daddy\nI'm L.L. Cool J, say hey, Renee\nI'm not a toyboy, but I still wanna play\nPromise you I'm not wack when I'm in the sack\nAfter that I leave you starvin for me to come back\nBut in the meantime, put your digits down\nAnd the next time I see ya I'm goin to town\"\nStepped away from the freak, it was a quarter to nine\nWhen I rolled to the jam I saw the crew on line\nTook a trip around the side, so I could get backstage\nIf you call me a tiger, then the stage is my cage\nI rip, stomp and crush, heavy metal bands rust\nThem flaky knuckleheads I crumble up like crust\nWalked in my dressing room, and then I heard four knocks\nThey said, \"L.L., you're runnin late and it'is time to rock\"\nTold Cut Creator what the order would be\nThen I said \"Lord have mercy\" and slapped hands with E\nWent onstage, I heard the girlies scream\nAnd that's the very moment I woke up from the dream\nAahh!", "image": "https://images.genius.com/360d16b8aeb2fd205516a7b8c96f11b2.1000x1000x1.jpg"}], "artist": "LL Cool J"}