{"songs": [{"title": "Bad Intentions", "album": "The Wash (Original Motion Picture Soundtrack)", "year": null, "lyrics": "[Verse 1: Dr. Dre]\nPut your cups up, get your smoke in\nBaby, we partying, ain't nobody loc'n\nWho you provoking, what you want now?\nTake a look around, it's pimp shit goin down\nIt's a lot of bitches, a whole lot of freaks\nTop notch hoes, they flock in every week\nWhat you wan' do, get your next thrill\nTake an X pill, how the sex feel?\nDamn you lookin good, all ten of y'all\nWanna roll (yeaaah!), I'm dicking y'all\nKeep your face down, keep your ass up\nYou know what your doing, keep that shit moving\nKeep them titties jumping, keep the Henny coming\nEvery bitch in here need to be touching something\nI know they like it hot, that's why I keep it hot\nSo how the fuck could they not want a piece of Doc?\n\n[Chorus: Knoc-turn'al & (Dr. Dre)]\nI don't give a fuck cause I'm just\nDrinkin, smokin, straight West-coasting\nBitches puttin ass in motion\nPussy poppin, sex promotin\nGot a cup? (Raise it up)\nGot a blunt? (Blaze it up)\nThat's your bitch? (On these nuts)\nReally I don't (Give a fuck)\nAll I really know is your ho wants to be with me, and she ain't playin'\nAnd what I'm sayin'\nShe creeps with me\nAnd sleeps, between the sheets\n\n[Verse 2: Dr. Dre]\nSoon as the door close\nI make 'em curl toes, they all wanna get chose\nWe never love y'all, my niggas all macks\nWe sip a lot of Yak, fuck and never call back\nPack women in the club until it's pitch black\nThugs on their block wonderin where their bitch at\nWhere you think nigga? She with the Aftermath\nCalled her house, she ain't home, she with Aftermath\nNo talkin, fuck how your day go\nYou want dick (yeeeaah!), will bitch say so\nDon't be shy now, probably the best at it\nThey say a party ain't a party until the west at it\nGravitate to the Doc like it's automatic\nTake your clothes off, make me wanna grab it\nTurn around with it, make me wanna stab it (yeaah)\nTime to get it crackin, show me them bad habits (oooh)\n\n[Chorus: Knoc-turn'al & (Dr. Dre)]\nI don't give a fuck cause I'm just\nDrinkin, smokin, straight West-coasting\nBitches puttin ass in motion\nPussy poppin, sex promotin\nGot a cup? (Raise it up)\nGot a blunt? (Blaze it up)\nThat's your bitch? (On these nuts)\nReally I don't (Give a fuck)\nAll I really know is your ho wants to be with me, and she ain't playin'\nAnd what I'm sayin'\nShe creeps with me\nAnd sleeps, between the sheets\n\n[Post-Chorus: Knoc-turn'al]\nWhen she's all alone she sneaks out to be with me\nAnd what I'm sayin is she ain't playin (she creeps with me)\nAnd sleeps, between the sheets\n\n[Outro: Dr. Dre]\nYeah, Aftermath, Doc Dre, 5-star surgeon general (yeaaah!)\nNocturnal, L.A. Confidential (yeaaah!)\nWhat up Infinite, Mahagony droppin the instrumental (yeaaah!)\nDo the math, Aftermath gets the last laugh (yeaaah!)", "image": "https://images.genius.com/71713f35a286e25db5f4bd313e61759a.300x300x1.jpg"}], "artist": "Dr. Dre"}