{"songs": [{"title": "Dear God", "album": "Young Sinatra: Undeniable", "year": "2012-04-30", "lyrics": "[Intro: Monsters of Folk (Sampled)]\nDear God, I'm trying hard to reach you\nDear God, I see your face in all I do\nSometimes it's so hard to believe in\n\n[Verse: Logic]\nDear God, I think it's time we had a conversation\nThese lonely nights is getting to me so my mind is racin'\nI think about this life I live and all the shit I'm facin'\nMore secrets in my mind than a Freemason\nI get lonely at times, and then I write these rhymes\nI'm only human, I want to hit the club and fuck a dime\nBut I know that's not the answer to my problems\nLord help me solve them, disintegrate and dissolve 'em\nLayin' in bed with a girl I'm pretty sure is my next\nContemplating the sex while I think about my ex\nAm I wrong? Yeah\nDear God, am I wrong? Uh (Dear God)\nDear God, tell me, am I wrong?\nFor livin' the life of a king surrounded by these pawns\nFans telling me I'm the greatest but I never hear 'em\n'Cause I ain't hit the pinnacle, yeah, I'm still persevering\nDemons whispering in my ears, but no, I never fear them\nPeople thinking they on his level they ain't even near him\nI just want to spread positivity through lyrical ability\nThey call it selling out but I just call it versatility\nYeah, it's my life, my wrongs, and my rights\nMy battle, my songs, and my fights\nNow everybody want to come around?\nTell me where was you last year when a brother was down?\nNot a single one of you motherfuckers believed in the brand\nExtended a hand, and now you wanna be my man?\nI think not, you quick to shape shift like ink blots\nThe real Dilla, we cut classic, no fitters\nWhat about the time I was nine and my mama almost murdered me?\nDon't think I forgot that shit, it still burdens me\nHer bare hands tight around my throat\n\"I can't breathe\" I screamed, \"I can't breathe, Mama\nDon't you want me, Mama? Don't you love me, Mama?\" What the fuck\nWhere was you then God? Tell me now\nHow's a brother supposed to stay sane? Tell me how\nWhy you let me live but let another die?\nWhy you dry my tears but let another cry? Gotta know\nSet to detonate, I gotta blow, that shit fo' sho\nI used to wonder why in the hell you would make me suffer\nBut now in the end I understand that it made me tougher\n\n[Outro: Logic]\nI get up when I'm down, had enough, almost drowned\nWhen shit rough, I get tough and when I'm beaten to the ground\nI get up, yeah\nI get up, yeah, yeah\nI get up when I'm down, had enough, almost drowned\nWhen shit rough, I get tough and when I'm beaten to the ground\nI get up, yeah\nI get up, I get up\nGet up", "image": "https://images.genius.com/4cb73fd1e86a44f861bc4ba694c17126.1000x1000x1.jpg"}], "artist": "Logic"}