{"songs": [{"title": "The Lingo", "album": "Now Hear This", "year": "2015-11-24", "lyrics": "[Intro]\nLing, ling ling, ling, ling, ling, ling\n\n[Hook]\nI got the lingo, ling ling, the lingo\nThe lingo, ling ling, the lingo\nI got that lingo, ling ling, the lingo\nThe lingo, ling ling\n\n[Verse 1]\nI got that lingo, the street lingo I bring yo\nAcronology now the society to bring to\nToo many people think so\nI'm not just an O.G., I'm an Original Hustler, you like, \"OH!\"\nFollow Life's Outcome Willingly, that's FLOW\nWISDOM, When I Simply Decide on Moe, or More\nI'm bringin' it to raw like a razor\nFAITH, Focus And Ignore These Haters\nAcronology is dope\nHere is another one for FAITH, write it down, \"For All It Takes, Hope\"\nBroaden your scope, it's Tha Teacha', you heard of me\nI represent the struggle in the 'hood most certainly\nBut STRUGGLE's more than a word to me\nHere's a Situation That Reminds Us God's Grace Lasts Eternally\nLADY, Love And Develop Yourself\nHLAW, Health, Love, Awareness, and Wealth\nAcronology is not just BRB or Be Right Back\nYou gotta check the words you usin'\nLike RELIGIOUS\nIt could mean Realizing Every Life In God's Image Offers Useful Solutions\nSo why you cruisin' lookin' for a snack\nThink DIET, \"Did I Eat That?\"\nPut down the cake, Seek Help And Proper Exercise\nRewind that, that spells SHAPE\nThese definitions go beyond the intellect\nLike MIND, \"May I Now Direct?\"\nA new philosophy called acronology\nI say it the word, the word inside of me, oh!\nThe heat is on, you can't leave it alone\nThis whole thing's created by G. Simone\nEven KRS is a acronym\nIt means, \"Knowledge Reigns Supreme,\" spin it back again\n\n[Hook]\nI got the lingo, ling ling, the lingo\nThe lingo, ling ling, the lingo\nI got that lingo, ling ling, the lingo\nThe lingo, ling ling\n\n[Verse 2]\nYou can have so much fun with this\nYou can even take offensive words and give it a twist\nLike BITCH, offensive to the ear\nNow switch it, \"Because I Take Charge Here!\"\nWith acronology, you gotta win\nHere's another one for BITCH, \"Because I Totally Challenged Him\nOr Her,\" you can't stop the edutainment\n'Cause these types of rhymes keep you out of your enslavement\nIt might not hit you or overstand\nI'm takin' you HOME, \"Here Our Mind Expands\"\nSo before Departin'  Earth Aimin' for the Heavens\nWhich spells DEATH, you need to check these life lessons\nThey like weapons, the foundation is under me\nI open up your mind to see how others see\nLike GOSSIP, Givin' Out Someone's Secret Information Publicly\nOr MUSLIM, May U See Love In Me\nI see the CROSS and ask my wife\nShe says, \"it's a Constant Reminder Of Self-Sacrifice\"\nThis is acronology, brothers and sisters\nYou FAMILY, For All My Intelligence, Love Ya\n\n[Hook]\nI got the lingo, ling ling, the lingo\nThe lingo, ling ling, the lingo\nI got that lingo, ling ling, the lingo\nThe lingo, ling ling", "image": "https://images.genius.com/9eb45e1010209bf241fbd5aca5dd1516.600x600x1.jpg"}], "artist": "KRS-One"}