{"songs": [{"title": "Saturday Night Live", "album": "Weapons of Mass Destruction", "year": "2004-12-12", "lyrics": "[Intro]\nAhhh! We bout to go this motherfuckin club tonight, y'knahmean?\nPoke some motherfuckin hoes, y'knahmean?\nMake sure them hoes, y'knahmean? Gon' act accordingly, y'knahmean?\nSome nigga over there tryin to love one hoe\nY'knahmean? You got one hoe!\nNigga youse a stone motherfuckin Jackson\nNigga youse a stony Jackson, you can't fuck with us\nSo nigga, tuck your tail and hide your hoe nigga\n\n[Jelly Roll]\nWe parked our rides, in front of club\nAll these niggas started givin us love\nSayin I'm the shit, Xzibit you the shit\nJelly Roll get 'em, can I be for real?\nIt's Strong Arm and Jelly Roll, cool for real\nYeah motherfucker, why don't you just chill\nCause I'm just coolin at the spot\nAin't much wrong plus you're makin it hot\nI like shinin from all the grindin\nGirl's best friend, man I'm just like diamonds\nI like khakis and Air Force Ones\nGangsters in the hood with them air force guns\nWe poppin them tags, our pockets fat\nWe fin' to put the world in a shopping bag\nNigga X the man, and I'm the man\nWe tryin to make you love it, don't you understand?\n\n[Chorus]\nIf you're with Strong Arm, you're really down with us\nIf you get high, then get a blunt and roll it up\nYour hood's gon' ride, then let me see you throw it up\nIf you ready I'm ready see really we don't give a fuck\nGet'cha ass up if you're really down with us\nGirl you ain't cute, get on the floor and move your butt\nThe bar is open everybody's gettin drunk\nIf you're ready I'm ready see really we don't give a fuck\n\n[Xzibit]\nAnother night in L.A., the homies all valet\nWe got it lookin the dub show in front of the place\nStrong Arm + 75, we so deep we arrive\nAnd then we swarm like you fucked with the hive\nGotta look a nigga right in the eyes, to tell the truth and the lies\nEven the strong find it hard to survive\nAnother day another dollar we can walk on water\nBetter, drop your tone, you ain't nobody's father\nHotter than about a buck shot your carne asada\nX burn down the town like a path of lava\nPathological drama so we got it inside\nIs it the wine or the women it's so hard to decide\nLook alive it's crackin; this is organized street hustlin\nWith corporate backin promotin interstate traffic (traffic)\nClassic, smash out right\nCause live from Los Angeles it's Saturday Night\n\n[Interlude]\nCause I, can get yo' ass on the floor\nCause this, is this the funk that you want?\nThe hand, it comes way up in the air\nAnd wave 'em all around like you just don't caaaaaaaaare\nBitch, come off of those pots\nStop, shake that junk in your trunk\nSee you, can move this groovyville shit\nThe shake that makes the whollllle club flip\n\n[Chorus]\n\n[Xzibit]\nYou might get shot in the face if you don't stay in your place\nYou ain't a soldier like me you a fuckin disgrace\nX move like a shark in the water, I'm dodgin death and disorder\nI'll get you hit it won't cost me a quarter\nI was sent here to strangle and slaughter in no particular order\nYour big mouth might endanger your daughter\nAnother day another digit I'ma speak it and live it\nBetter get yourself a gun 'fore you fuck with Xzibit\nPockets shorter than a midget, you can fuckin forget it\nX green light the target and easily hit it\nGrab the zone and split it so we smokin them woods\nSteady givin niggas the business and keepin it hood\nFirearms we packin, this is military mindstate\nThat's ready for action we mercenaries and assassins (blastin)\nClashin, smash out right\nCause live from Los Angeles it's Saturday Night\n\n[Jelly Roll]\nLet's hit the club and get it on tonight\nLet's get drunk this is Saturday Night\nJust got paid, shine my chrome up tight\nTime to get it crackin, off the Henn' tonight\nX is here, the gang is here\nJelly Roll production bangin crystal clear\nI've been low, now check my highs\nMillion dollar niggas right before yo' eyes\n\n[Xzibit]\nIn Los Angeles, homey (it's Saturday Night)\nIn Houston, dogg (it's Saturday Night)\nIn Miami, mate (it's Saturday Night)\nIn Atlanta, shorty (it's Saturday Night)\nIn St. Louis, dirty (it's Saturday Night)\nIn New Orleans wodie, yo (it's Saturday Night)\nIn New York City, yo (it's Saturday Night)\nAround the world baby, yo (it's Saturday Night)\n\n[Outro]\nOn some straight motherfuckin pimpin shit, y'knahmean?", "image": "https://images.genius.com/cebafeb87cd3844c18012605b852ac2b.500x500x1.jpg"}], "artist": "Xzibit"}