{"songs": [{"title": "Feel Me", "album": "Tha Carter II", "year": "2005-12-06", "lyrics": "[Interviewer:]\nSo \"Little Wayne,\" what's your motivation?\n\n[Lil' Wayne]\nIs that really a question?\nDo you really have that written down in your notepad?\nYou should be ashamed of yourself\nYou smell me girl\nI smell like money\nSee, thats what they don't understand (Tell 'em a god damn thang)\nTo me it was always get money or die\nI come up under Birdman, the Number One Stunna\nYou know what I mean I'm Stunna Jr. thats all I know thats all I ever knew\nGet money or get nothing you know what I'm saying\nAnd I feel that way\nForeal\n\n[Verse 1]\nSo hard I go I keep pushing\nThe game so crazy I'm in it like deep pussy\nI got chip from trying to get the whole cookie\nUsed to make a thousand dollars everytime I played hookie\nDwayne Carter absent keep looking\nI'm present on the block\nI'm a legend on the block\nIce so bright like heaven on the watch\nYea nigga I done dropped one eleven on the watch\nSo watch and see what I do\nBreeze by you so fast got you sneezing hachoo\nThey got the shivers 'mayne I got the fever\nI got to bring the hood back after Katrina\nWeezy F Baby, now the 'F' is for FEMA\nSick nigga bitch I spit that Leukemia\nYea no cure no help\nSo me so good so hard so felt\nFeel me\n\n[Lil' Wayne]\nAnd that's just my point right there\nThat's what I'm always trying to stress know what I'm saying\nIf you don't understand me if you don't feel me then you ain't real\nIn my eyes, and that's all that count to me you know\n\n[Interviewer]\nSo, is your music considered the voice of urban America or America period?\n\n[Lil' Wayne]\nI mean, I would say the voice of the hood cause thats who I speak for\nAnd myself, you know what I mean, my family thats who I represent\nMy homies, my girl, my life you know\n\n[Verse 2]\nC'mon, bang this shit nigga pump my shit\nYou gotta bang that wimp and go and dump that bitch\nYou gotta claim that strip and go and flood that bitch\nYou gotta aim that shit and straight bust that shit\nLike motherfuck them niggas what they wan-do I'm ready\nTevin Campbell, no homo, black Rambo\nFucking with the boy baby that's a gamble\nIf he won in Vegas leave him on the crap table\nI'm willing and I'm able to come run up in your stable\nLike nobody make a sound where the paper where the paper\nGotta get it gotta have it\nOnce I got it I'mma spend it\nThen its back to doing any damn thing just to get it\nThe re-ups be like birthday parties\nNo room to park the cars in the garages\nSo outside the cribs all you see is arayis\nIf I ain't say it right fuck it I ain't foreign\nFeel me\n\n[Lil' Wayne]\nAnd see thats where everybody get me wrong at, you know what I mean?\nI got that heat rock, foreal\n\n[Interviewer]\nWhy do you think other rappers lack the impact of your music?\n\n[Lil' Wayne]\nThats because they ain't got that heat rock like me you know what I mean\nThey ain't spitting like me\nThey spitting, but, know what I mean, they ain't got colds\nI got the flu over here man, foreal\nI need relief, y'all help me\nI know y'all sick of me, cause I'm tired of y'all foreal\n\n[Verse 3]\nAnd based on the bank, I'm doing much better than alot of these niggas\nI'm tired of these niggas\nYawning when I see them make me stretch and pull the burner\nI'm cocking back and passing\nThey catch 'em in they sternum\nOoh ooh that gone probably burn ya\nThat gone probably learn ya\nTo never ever ever - ever ever ever come around here no more\nRich gangsters over here you gotta die with the broke bitch\nI'm the God I should ride with the Pope\nBut the boy so hood I just ride with my ho yeah\nYeah, and tell 'em bout Hollygrove\nTell 'em bout my last show\nTell 'em bout my last ho\nYou know, just born to mack\nCall me Deion Sanders, bring the corner back\nI'm in my prime, niggas falling back\nThat's right I'm coming baby yeah hard as crack\nFeel Me\n\n[Lil' Wayne]\nAnd thats just what it is nigga\nIf you don't like my shit then fuck you and your shit man straight up\nThat's how I was taught, that's how I was brought up\nAnd that's how I'mma go down\nCash-Money Young-Money in your motherfucking throat bitch\nSwallow slow\nWeezy F. Baby this interview is over, go to the next song\nBitch", "image": "https://images.genius.com/98c56aa11e01a9c25b7485cc3a25c78f.300x300x1.jpg"}], "artist": "Lil Wayne"}