{"songs": [{"title": "How it is", "album": "NAGA", "year": "2018-07-05", "lyrics": "[Verse]\nYeah yeah\nLook\nShe said her ex wasn't shit, one before that wasn't shit, one before that wasn't shit, one before that wasn't shit\nHow you navigate to the same shit?\nYou always gravitate to the same dick\nShe said I'm just like every guy, how you know 'bout every guy?\nMaybe only all the niggas you've met\nLook, she wanna be a housewife, but don't know what a home is\nShe want a soul mate, but don't know where her soul is\nNow, what are we supposed to date or procreate, shit?\nWell, I guess, I suppose that ass supposed to shake\nWhat is love?\nHow many dates? How many texts? How many compliments does it take?\nYou know this, you know this world ain't shit, but still, you smile even with a fake grin\nMaybe it's something in your mind you can't shape\nMaybe it's something in your heart they can't break\nNow, look she know how I feel about her, she do what she wanna do\nI know how she feel about me, I move how Mohammed move\nCouldn't leave if I wanted too\nYeah, look\nYou want love? What the fuck is that?\nLove is how you feel, regardless how they treat you back, yeah\nFrequencies above anything negative\nBig up yourself, the same you did the 44th president\nYou can't love the culture and hate the people\nEmbrace the flaws, elevate what you call evil\nNigga, I mastered the shit, I mastered the shit\nLike when Pac shot them cops that was attacking his camp\nWould you let your bitch look through your phone? Alone?\nFuck all that pretentionship, get you a real nigga with no censorship\nTough conversations to have, type of conversations make you pack all of your bags\nWell if it's meant to be, then it'll be\nThe truth will come to the light, eventually\nSo quit up, all that fake shit, quit all that flaw shit, quit all that fluke shit, get off that tough shit, let's have a talk shit\nWe on this art shit, yeah, owning boss shit\nAnd we ain't gotta have a baby\nI like it being me and you\nWhen you weep, you kinda cute\nWhat we watching, season one, season two?\nAnd I don't really want no fairytales\nStill, I wanna fall in love like the fairytale, still\nWe can do this shit without no training wheels, real\nOn some Kemet shit, Heru take the wheel\nThat bitch, my bitch, that's my bitch\nI feel like I got the baddest bitch in Atlanta\nI feel like I got the baddest bitch in the world\nI feel like, I feel like that's my queen, not a girl\nI feel like, I feel like I'm the king of the world\nI feel like, I feel like that's my queen, not a girl\nAnd if you feel like how I feel, then you're lucky as me\nBut what the fuck is luck? This shit was destined to be, yeah\nNow, what is love? Now, what is love? So, what is love? Yeah, yeah\nYou can tug, you can tug, but jealousy ain't love\nJealousy ain't love\nJust 'cause you feeling reckless, don't mean that it's really love\nThe tendency for dysfunction eventually breaks up, it breaks up\nYou can tug, you can tug, jealousy ain't love\nJealousy ain't love\nJust 'cause you feeling reckless don't mean that it's really love\nThe tendency for dysfunction eventually breaks up, it breaks up\nBandz", "image": "https://images.genius.com/a0370f3b55eb19a51f991675764cc669.1000x1000x1.jpg"}], "artist": "B.o.B"}