{"songs": [{"title": "I Ain’t Throwin’", "album": "The Sex Tape Playlist", "year": "2018-05-04", "lyrics": "[Intro: Mowii]\nI ain’t throwin’ no money\nI ain’t throwin’ no money\nI ain’t throwin’ no money\nI ain’t throwin’ no money\nYou know what? I give a fuck about a bitch\n\n[Verse 1: Mowii]\nNigga, who is that?\nShe ain’t nothin’ but a ringtone (Why?)\n‘Cause she everybody theme song\nI let it rain, bitch, leave me ‘lone\nI ain’t broke, I’m in the green zone\nI just touched down on a hoe, look\nIf she fuckin’ up, I throw the flag on the floor\nIf she bad, get her number, call a blitz on that hoe\nAnd then I add up everything that I get from that hoe, let it go\nLet it go, stop swingin’ on the pole\nLine it up, free throw, two shots, let it go\nTen-hut, ten-hut, baby, either right or left\nThey don’t give you no money mean you don’t wanna fuck?\nPop that pussy like a cork\nMade it motor for the sport\nGot her comin’ out her shirt when she twerk\nAnd cat daddy go to work\n\n[Chorus: Mowii + Too $hort]\nI ain’t throwin’ no money\nShe wanna smoke, you wanna eat and drank?\nI ain’t throwin’ no money\nYou wanna fuck then count my bank?\nI ain’t throwin’ no money\nLittle bitch, I don’t care if you strip\nI ain’t throwin’ no money\nYou know what? I give a fuck about a bitch\n\n[Verse 2: Too $hort]\nThey ain’t gon’ play this at the strip club\nBut I don’t give a fuck if the bitch fuck\nI ain’t got nothin’ on the pussy\nStop asking for shit, you too pushy\nNo, I don’t need no ones\nI’m wondering why this bitch ain’t giving me no funds\nYou want me to throw all my money at her?\nI ain’t giving her shit, I ain’t giving her…\nI’d get some money with a bitch\nIt’s some hoes out here getting chips\nThis other bitch got her hands out\nI said, “Bitch, stop pulling your pants down\nStanding there looking like you wanna cry\nYou wanna sell me something I don’t wanna buy\nI don’t want a discount, and I don’t want it for free\nYou selling pussy? You better sell it for me”\n\n[Chorus: Mowii + Too $hort]\nI ain’t throwin’ no money\nShe wanna smoke, you wanna eat and drank?\nI ain’t throwin’ no money\nI ain’t throwin’ shit, I don’t care what y’all think\nI ain’t throwin’ no money\nLittle bitch, I don’t care if you strip\nI ain’t throwin’ no money\nI give a fuck about a bitch\n\n[Verse 3: Too $hort]\nThe game, that’s what I represent\nSo if you see me, just say, “What’s up, pimp?”\nYou ain’t gotta tell me what you spent\n‘Cause these bitches, they nicknamed “Your rent”\nAnd that’s cool, if that’s how you feel\nYou like to help a bitch out with her bills?\nIt’s all in the name of fun, she gon’ give you some\nIf you throw a few thousand ones\n\n[Chorus: Mowii + Too $hort]\nI ain’t throwin’ no money\nShe wanna smoke, you wanna eat and drank?\nI ain’t throwin’ no money\nYou wanna fuck then count my bank?\nI ain’t throwin’ no money\nLittle bitch, I don’t care if you strip\nI ain’t throwin’ no money\nYou know what? I give a fuck about a bitch", "image": "https://images.genius.com/c714b91c4bc45bdec04b6c2a9315f86f.1000x1000x1.jpg"}], "artist": "Too $hort"}