{"songs": [{"title": "At Least a M", "album": "Everybody Looking", "year": "2016-07-21", "lyrics": "[Intro: Gucci Mane]\nAt least a M\nMike WiLL Made It\nZaytoven\n\n[Verse 1: Gucci Mane]\nI'm a walking lick, I look like a robber\nYou niggas ain't mobbin', you know you got a problem\nYou niggas ain't legit, see Gucci with the shit\nYou keep on talking slick then I'mma go and get the stick\nGutta as it get, still the talking brick\nUsed to have them ninety-six impalas sitting on blades chopped\nAnd that was ninety-six, they treat me like a prince\nWhen I was behind the fence you was acting like a bitch\nSo I might slap you like a pimp, my chef is cooking shrimp\nThe haters tryna' knock me off my throne but they can't do it it's like the thirtieth attempt\nAnd you look like a wimp, and I don't even associate with niggas\nWho associates don't have at least a M\n\n[Chorus: Gucci Mane]\nHave at least a M\nI don't even associate with niggas who associates don't have at least a M\nHave at least a M\nI don't even associate with niggas who associates don't have at least a M\nHave at least a M\nI don't even associate with niggas whose associates don't have at least a M\nHave at least a M\nI don't even associate with niggas whose associates don't have at least a M\n\n[Verse 2: Gucci Mane]\nI love the letter M, Gucci Mane a G\nI'm from BC, Bouldercrest and I be skrapped up to the T\nI used to have them P's, I got em' from AZ\nAnd I used to pay like one for em' sell em' for the three\nRIP to E\nHow you let a nigga in a motherfucking wheelchair beat you to the cheese\nYou deserve a D\nY'all ain't really flunk but you punks gettin' a lil' money but ain't get money like me\nI'm steady pushing three\nOr you can call it age, but ain't no need to call me unless you got ninety G's\nI'm tryna' make a B\nYou tryna' make a play but get the fuck up out my face cause nigga you the F.E.D.'s\n\n[Chorus: Gucci Mane]\nHave at least a M\nI don't even associate with niggas who associates don't have at least a M\nHave at least a M\nI don't even associate with niggas who associates don't have at least a M\nHave at least a M\nI don't even associate with niggas whose associates don't have at least a M\nHave at least a M\nI don't even associate with niggas whose associates don't have at least a M\n\n[Interlude: Gucci Mane, Zaytoven & Mike WiLL Made It]\nI mean like, would I need a nigga around me whose associates don't have at least a M\nYou ain't got to be rich to talk to Gucci, but you gotta' be part of something!\nSo you mean to tell me your daddy, your momma, your brother, your partner\nAin't nobody getting no money?\nSo everybody around you broke? (ha ha ha)\nNah! I ain't fucking with that man! (Oh hell no)\nNah for real, I'm with you Gucc'\nI thought, you know I thought your uncle or something played for the Hawks\nAin't nobody play no pro ball or nothing? Ain't nobody got nothing?\nOh shit my phone's ringing, this gotta' be some money right here\n( Hello! )\n\n[Chorus: Gucci Mane]\nM\nHave at least a M\nI don't even associate with niggas who associates don't have at least a M\nHave at least a M\nI don't even associate with niggas who associates don't have at least a M\nHave at least a M\nI don't even associate with niggas whose associates don't have at least a M\nHave at least a M\nI don't even associate with niggas whose associates don't have at least a M", "image": "https://images.genius.com/617f679ecf3e40194443f9c9117e6712.1000x1000x1.jpg"}], "artist": "Gucci Mane"}