{"songs": [{"title": "Radio Silence", "album": "Radio Silence", "year": "2017-11-17", "lyrics": "[Intro: Talib Kweli]\nI know, we back\nWe home, let’s go\nI know, we back\nWe home, let’s go!\nCheck it out\n\n[Verse 1: Talib Kweli]\nBorn this way\nThe universe wasn’t formed in a day\nPraise the Lord and pray\nWe the children of God, better learn how to walk this way\nTry to walk with faith but it’s hard, what more could I say?\nI feel I’m cursed so I talk this way\nGotta write what I’m livin’ in graffiti\nIt’s the hood hieroglyphics so I’m lookin’ for a wall to spray\nYou could picture me rollin’, you could picture me holdin’\nYou could never picture me foldin’\nRefuse to beholden to your racist image of a Black man\nKiss my entire colon\nGreat mind, even though the legacy is stolen\nIt’s all for the silver and gold\nYou can tell you in the ghetto from the litter in the road\nMan this middle-of-the-road shit really getting old\nWhich one is the real you? I don’t know, it’s still you\nHow can I tell if you under a spell? Did the fake you kill you?\nBetter pass the mic in the afterlife\nIf so, let me spit flows, good enough to offer to God as a sacrifice\nBorn again like I passed away, castigated for being honest\nCaught bail like a castaway, cause I feel like I’m swimmin’ on an island\nWhen I’m gettin’ introspective: that’s radio silence\nWhen I’m fuckin’ up program directives: that’s radio violence\n\n[Chorus: Amber Coffman]\nYou were the one who wants to slow me down\nI’m a criminal when you’re around\nWhat makes me think you would love me?\nWhat makes you want to unplug me?\n\n[Verse 2: Talib Kweli]\nBorn this way, woke up like this\nThe midpoint between science and religion\nIs tryna find out what the meaning of life is\nOctober 3rd, '75, my birth is a blessing\nAin’t no spoken word could ever describe how the flow get better\nI live on the edge, I’ll send you a postcard\nFuck a phone, I got a chip on my neck that’s a close call\nTurn the lights off, see how we glow in the dark\nOr we growin’ apart or tryna survive the flood like we in Noah’s Ark\nWe battin’ down the hatchets and we set sail\nTryna get far away from inhalin’ them chemtrails\nMy intel says they makin’ people out of the stem cells\nThe gun's our sunflower seed, we love to spit shells\nWhen them super soakers get let off, it don’t end well\n\"I ain't know you like to get wet, dawg\", like Denzel\nThey hype it up like marketers, sparklin’ like a fish scale\n'Til you chasin’ a high like Captain Ahab after that big whale\nIt’s criminal\n\n[Chorus: Amber Coffman]\nYou were the one who wants to slow me down\nI’m a criminal when you’re around\nWhat makes me think you would love me?\nWhat makes you want to unplug me?\n\n[Instrumental Break]\n\n[Verse 3: Myka 9]\nBorn this way, Capricorn, L.A. on the day of January 15\nDr. King, his dream torn from a warm womb formed from the clay, existing\nShifting from the essence, uplifting in the presence, just drifting, gifting\nThrough this mortal coil, with mystic lessons from the sage\nCalifornia spoiled a blessing, blissed up, my first breath in outer space\nI kissed death in the face, no identity complex, it gets left in its place\nI’m proud to say, no aborted torment to my rejection\nMiffed, dismayed and somewhat befuddled\nI struggled to hustle and come up when the blood corpuscle boils\nI'm pressin' issues, it's business that's mixed with pleasure\nIt's plizness to play and get paid during this clone war for DNA\nYou should know more about the donors confessing my doula from prenatal\nI'm off fire, water, elixir of liquor with soft or hardcore drugs in my system\nSicker desire to be delivered wisdom, pour black, white sexy texture of lovers\nLike jungle fever, wild zebras to make this fetus, brother\nThe son of my father, I want to hear my one Shawki and my daughter Aja\nLecture selections in musical meters in physics, you should explore and visit more\nExquisite shores and districts, take a breather\nBelieve in your epic eye memory, you are descendant of natural leaders\nExtended from before the Nephilim, Bethlehem, even Eden\nAnd new testaments, Heaven-sent, energy, books, messages read them\nScriptures, look at the various sizes of giants in Egyptian pictures\nStonehenge endured the mathematics of Mayans and megalithic structures\nEvidence frequencies Vedas, we're just the latest reproduction\nCreated out of pure star dust and made in his image but God is greatest!", "image": "https://images.genius.com/25f545688171433c422bdbaf45bd1392.1000x1000x1.jpg"}], "artist": "Talib Kweli"}