{"songs": [{"title": "Cock and Squeeze", "album": "The Underground EP", "year": "1997-03-02", "lyrics": "[Intro: Bugz]\nYeah, y'all faggots..\n(Hear me? Yeah.. ready set.. then take shit)\nY'all, the fuck? Who wanna battle, what?\nNone of y'all, do you? (no)\nDirty Dozen, Outsidaz (what?) bitch\nWho wanna battle?\nSong dedicated to Geeney....\n\n[Bugz]\nGimmie some hash, and when I trip nigga give me a mask\nThen after that lend me your mag and gimmie yo' cash\nThat precious pen you call the life, I put it in too fast\nGet in your ass if you unhappily leave Eagle Man (yeah)\nYou wanna see through glass, don't pay much to breeze through class\n(bitch) You broke as fuck and on the bus because your evil smash\nThis shit is lethal fast, battle me, I keep you mad\nPut you in a sleeper drag, your ass to the reepers pad\nEither blast, or feel the wrath of my heater lad\nLyric punches makin meters blast, turn your speaker out\nRear, club, or anywhere where there's people at\nThey love my day, couldn't care where they leave's you at\nYour girl's a rat, tell that ho I'm not gon' beep her back\nDon't need her Glock, got too many other neater rats\nWho heater fat? I bet your gat ain't fuckin wit my gat\nI'm on the lyrics, sayin the vocals that you almost clap\n(clap clap) Don't clap, you mo' wack than a cold sack\nYou showin that when you blow, that's a known fact\nClone rap, suck a MC broad, need to pick another fued\nWhat? And find you a job, or either go out and rob because\nRappin ain'tcha function, you outta place\nLike a two of hearts and two of diamond in a game of spades\nWhile my inovative ways, shootcha lyrics to a blaze\nPut a grimace on your grade, I'mma guiness on the page\nThe history, puttin, suckin niggas out they misery\nIt's not a mystery, my victorys are bodacious (hah)\nIt wouldn't matter if the judge is racist\nAnd I was battlin your aces in your bitches basement\nI'm unfuck-witable, thats literal, face it, the general\nThe sisters of a senate-al, holdin on my genetals\nRight before I send the blows, down to earth like minerals\nEven after centerfolds (grr arf!) the videos, my evil goes\nIncognito hoes, I'mma skitle bros, Meena biter\nI hope you niggas catch a case of arthrit-ah\nYou ain't no riders, and still don't even have a slider\nI D her when you need me, we gon' burst in into fighters\n(yeah, yeah bitch!) You motherfuckin tighter\n\n[Hook]\nCock, and, squeeze, bust, Dirty Dozen, don't fuck wit us\nDetriot niggas roll deep, ho heat, and fuck Slick\nYeah, yeah bitch - stay off my dick!\n\n[Verse 2: Kon Artis]\nThat's the time that you up and cuttin you wit a knife\nThe situan, the alcohol bath for the night\nThen watch the strugglin, you squeal for your life (uh-huh)\nDump a radio bumpin your demo in the bath wit the light\nThat's what I take from you, meet you and fake humble\nAttack your foundation until it crumble\nSo me and my dawg be on stumble\nCome off 'gnac but stayin in the right mind\nIt's the blazin track and we're back, for fake individuals that rap\nScreamin out they group name like they scared and shit\nKnownin that the Kon Artis come prepared wit clips\nFull of them male scritches (what?)\nYou watch and take pictures (how you do that?)\nNotes and write down poets and 'bout how I rap and get witcha\nTold you niggas before we got much the game\nNuttin to lose, corruptin the lives of all groups\nTie 'em up and put 'em in situations to hurt 'em\nTie 'em up to trees, you was throwin darts at 'em\nWit venom in 'em, then murder 'em, servin 'em right\nHe be, the Kon Artis {*screech*} swervin the night\nWe rock from state to state (uh-huh) and city to city\nYou make us sick like a faggot tryin silicon titties\nAnd already want a size D bra, I wanna die wit tight shit\nGive it to y'all bleek raw, raw, raw, raw, raw\nYeah, yeah, yeah, yeah, yeah\n\n[Hook]\n\n[Proof]\nGimmie a sicker than (?), check it out\nI turn a hard nigga yellow, and bake his ass faster than a cheetah\nDon't blaze no blunts (uh-huh) but I blaze them thangs\nAmaze your gang, wit bullets, I rattle your frame\nWho's that, bustin at, Big Suburban, hustle that\nPlay wit three bitches alias and four hustlers\nBustin three Glocks, on your block\nYellin my name loud, puttin bombs inside your mailbox\nAnd prepare docks - punch your dreadlocks, wait for the cops\nAnd tell 'em that yo' ass had beef wit Biggie and 2Pac\nI lit the flesh (uh-huh) shot bled to death (what?)\nLike Red and Meth, you need the hoop-a, shoop-a\nFor battlin boards, got on a moyer, I sat on your horse\nGot battled thanks to your tours, show up at you\nBattlin your eyecore, pure wit this shit\nOn your mic rip, you might slip, fall, hang it up\nLike Sonny (?), peace to (?)\nRock 'til the early morn', shit is on\nGotta a problem fiend, fiend problems\nMy crew mug shot D-12 uglier than the green goblin\nI bring fear too, horror, near you\nA fact why nobody wanna hear you, you wack BITCH!\nWhat the fuck you thought what happened\nWhen bullets start collapsin your frame\nMaintain to bring pain, freestyle fanatic named Pete\nFirst is off the paper, this one turn your auto vapor\nMe, MC, the extraordinar', steppin on your (?)\nScreamin \"7 Mile bitch, come from Runyan\"\nHold down your fort, snort like cocaine\nRichard Pryor, I clap more clips than (?)\nYeah, yeah bitch, what the fuck you thought?\nYa niggas get caught short, I'm incredible like the hulk\nWatchin the facet nigga, P-R, the letter O\nMy sex is hetero, cash checks like federal\nYour hetero, bitch! Hahahaha", "image": "https://images.genius.com/7a40a5dcf4af48c56e2c80bf3d485197.900x900x1.jpg"}], "artist": "D12"}