{"songs": [{"title": "I Don’t Give A Fuck", "album": "2Pacalypse Now", "year": "1991-11-12", "lyrics": "[Intro: Skit]\n— What's up?\n— Yo, this scene: rollers tried to jack a nigga 'cause a nigga with a pearl rollin' on a Coupé with goldens\n— Yo, man, what's up? This riding motherfucker, jack me at rollin' 'round bumping, ’cause music's too loud, you know what I'm sayin'?\n— Yo, this is P-O to the G-O\n— Motherfuckin' cop just jacked me, 'cause I was drinking beer in Mill Valley\n— What's up, man?\n— A'ight, man, fuck 'em\n\n[Verse 1: 2Pac]\nI don't give a fuck\nThey done pushed me to my limit, I'm all in\nI might blow up any minute, did it again\nAnd now I'm in the back on the paddy wagon\nWhile this cop's bragging about the nigga he's jackin'\nI see no justice, all I see is niggas dyin' fast\nThe sound of a gun blast, then watch the hearse pass\nJust another day in the life, G\nGotta step lightly, 'cause cops tried to snipe me\nThe cabs, they don't wanna stop for a brother, man\nBut damn near have an accident to pick up another man\nI went to the bank to cash my check\nI get more respect from the motherfuckin' dope man\nThe Grammys and American Music shows\nThey pimp us like hoes, take our dough, but they hate us, though\nYou better keep your mind on the real shit\nAnd fuck tryin' to get with these crooked-ass hypocrites\nThe way they see it, we was meant to be kept down\nJust can't understand why we gettin' respect, now\nMama told me there'd be days like this\nBut I'm pissed, 'cause it stays like this\nAnd now they're trying to ship me off to Kuwait?\nGive me a break! How much shit can a nigga take?\nI ain't going nowhere, no how\nBush wanna throw down?\nYou better bring the gun, pal\n'Cause this is the day we make 'em pay\nFuck bailing hay, I better spray with an AK\nAnd even if they shoot me down\nThere'll be another nigga bigger\nFrom the motherfuckin' underground\nSo, step but you better step quick\n'Cause the clock's going tick and I'm sick of the bullshit\nYou're watching the makings of a psychopath\nBut you sit and laugh before the wrath and aftermath\nWho's that behind the trigger?\nWho do you think? A motherfuckin' 90's nigga\nReady to buck and rip shit up, I had enough!\n(Yeah) And I just don't give a fuck\n\n[Verse 2: Pogo]\nNigga, it ain't just the blacks\nIt's also a gang of motherfuckers dressed in blue slacks\nThey say niggas hang in packs and they attitude is shitty\nSo, tell me, who's the biggest gang of niggas in the city?\nThey say we niggas like to do niggas\nSo me and a cop are just two niggas\nA street-walkin' nigga and a beat-walkin' nigga\nWith a badge, I end his future and his past\nWith a blast, take his cash before I dash, I bash his head in\nDump him at the dead end and that's just his luck\n'Cause a nigga like P don't really give a fuck\n\n[Verse 3: 2Pac]\nWalked in the store, what's everybody staring at?\nThey act like they never seen a motherfucker wearing black\nFollowing a nigga and shit—ain't this a bitch?\nAll I wanted was some chips\nI wanna take my business elsewhere, but where?\n’Cause who in the hell cares\nAbout a black man with a black need?\nThey wanna jack me like some kind of crack fiend\nI wonder if he knows that my income\nIs more than his pension, salary and then some\nYour daughter is my number one fan\nAnd your trife-ass wife wants a life with a black man\nSo who's the mack? In fact, who's the blackjack?\nSit back and get fat off the fat cat\nWhile he thinks that he's getting over\nI bust a move as smooth as Casanova\nAnd count another quick mill'\nI'm getting paid for my trade, but I'm still real\nAnd if you look between the lines you'll find a rhyme\nAs strong as a fuckin' nine\nMail stacked up, niggas wanna act up\nLet's put the gats up and throw your blacks up\nBut the cops getting dropped by the gun shot\nUsed to come but he's done, now we run the block\nTo my brothers: stay strong, keep your heads up\nThey know we fed up\nBut they just don't give a fuck\n(They just don't give a fuck)\n\n[Outro: 2Pac]\nI gotta give my fuck offs\nFuck you to the San Francisco Police Department\nFuck you to the Marin County Sheriff's Department\nFuck you to the FBI\nFuck you to the CIA\nFuck you to the B-U-S-H\nFuck you to the Ameri-K-K-Ka\nFuck you to all you redneck prejudice motherfuckers\nThat wanna fuck with me, fuck y'all!\nPunk-gay insensitive little dick bastards\n2Pacalypse motherfuckerin' now\nY'all can all kiss my ass and suck my dick\nAnd my Uncle Tommy's balls\nFuck y'all\nPunks!", "image": "https://images.genius.com/839619da9eb2d92ecf5367044a1fb2ba.500x500x1.jpg"}], "artist": "2Pac"}