{"songs": [{"title": "Frum Da Tip Of My Tung", "album": "Runnin’ Off at Da Mouth", "year": "1992-06-06", "lyrics": "[Introduction: Instrumental]\n\n[Verse 1]\nDroppin' a flow like this be breakin' the suckers\nAnd rippin' the rhythm and showin' I'm bringin' the feel of my tongue\nAnd be makin' 'em manifest that I be rockin' the young\nFlowin' this style I be singin' and bringin'\nIt's breakin' the people and go in the mind of a teen\nBe makin' 'em hear it and manifest up in him that I'm a star to become\nQuick the lyrical style I'mma kick\nYou better catch the rhythm of it\n'Cause hip-hop is becomin' complicated, never be left hung\nBringin' a style like this kinda quick and crisp\nA lyrical twist be comin from Chi-Town\nI know that hip-hoppers all over will be stung\n\n[Chorus]\nHow was the rhyme brung?\nFrum the tip of my tung (x7)\nHow was the rhyme brung?\nFrum among the tip of my tung\n\n[Verse 2]\nRock the style of my second verse like that of my first\nBe showin' the hip-hop hypes my types of flowin', but not the best of T\nFrom an imagination this was took, a mental crook\nStirring this up like a chef or cook\nI hear them say give me the recipe\nBreakin' this off in the fashion of an erection of an adventurous style\nThat I'mma use to just confuse and smart people then go dumb\nYou say me style be wack 'cause y'all can't manifest what I be sayin'\nThink I'm a lyrical midget, watch me then say fee-fi-fo-fum\nFlowin' this like a veteran that I'm incredible is what they be stung by\nWhen I'mma give in a flow of the funk I erect like a wee-wee\nThen see me gee, we be DJ Jihad and T.T\nSteppin' and then I'mma find a lyrical line that'll flow from me like peepee\nRockin' and me stylin', rockin' and me stylin', wildin'\nThem say me tracks be wack, I just sip them like them coco\nLoco, a lyrical thing I sling and cling like Sing-Sing, merciless like Ming\nWatch me come and stiff in 'em like a photo\nFunky, funky, funky stylin', wildin'\nI'mma drop in a flow that breaks and takes a lyrical wiz to wax a funky scholar\nFlowin' a hyper type of song that I sung from the lung\nBreakin' 'em up in a snap, I think that I better thank Allah\n\n[Chorus]\nHow was the rhyme brung?\nFrum the tip of my tung (x7)\nHow was the rhyme brung?\nFrum among the tip of my tung\n\n[Verse 3]\nFace the lyrical rhythm of this lick\nI throw in a blister of a body\nBreaking 'em up so quick that I can even bruise hair\nRhythm will rock blocks and funky track drops\nDon't wanna come in the door but when you're hearing\nDo I hear a \"knock-knock who's there\"?\nTwista breaking 'em off in a magical rhythmous manifestation\nOf a lyrical racing chasing suckers that my funky rhythm elects\nWrote this, quote this, notice how I wreck\nMy funky hocus pocus broke his neck\n\n[Chorus]\nHow was the rhyme brung?\nFrum the tip of my tung (x7)\nHow was the rhyme brung?\nFrum among the tip of my tung\n\n[Outro: Instrumental]", "image": "https://images.genius.com/f451034356ebcc4eb5aa785c572b265f.953x953x1.jpg"}], "artist": "Twista"}