{"songs": [{"title": "Horns", "album": "K.O.D.", "year": "2009-10-26", "lyrics": "[Intro: Tech N9ne]\n\"They say the lust is of the devil\nAnd around the night time I get very horny\nThat's why they call it horny, 'cause the devil's 'supposedly' supposed to have horns\nBut, who knows if any of that bullshit exists.\"\n\n[Verse 1: Tech N9ne]\nI'm a nice guy... My life's a light sky...\nSo much love I might cry... Daah! Nice try!\nI'm an evil seed, in the day I sleep and the night fly\nG.A.Z.E. in my E.Y.E.Z. and you might die\nI'm a horn dog, got a lot of that porn y'all\nWarned y'all, I was straight born raw like Orenthal\nBut I'm way worse because he was cornball\nI remember keeping him in my dungeon with a leather suit and a\nOrange ball in his mouth, I had some foreign broads in his house\nHow did they get twisted and torn claws when in bout?\nNine inches then I stuffed they dorn draws in his couch\nFor now I let 'em suffer in the morn' all then it's ouch\nI have a devil's haircut in my mind\nThat's why I be sucking blood and bustin' nuts in my rhymes, I'm horny\nSo don't ignore me if you're semi-fine\nMe and Gordy, Prozak love orgies and we in our prime and we\n\n[Hook: Tech N9ne]\nCan't hide the (Horns!) And I won't hide the (Horns!)\nI live with the (Horns!) So I'll die with the (Horns!)\nIf you fuck with the (Horns!) Then you'll get the (Horns!)\nSo if you want the (Horns!) Then I'll give you the (Horns!)\nCan't hide the (Horns!) And I won't hide the (Horns!)\nI live with the (Horns!) So I'll die with the (Horns!)\nIf you fuck with the (Horns!) Then you'll get the (Horns!)\nSo if you want the (Horns!) Then I'll give you the (Horns!)\n\n[Verse 2: Prozak]\nSchizophrenic thoughts spin around my mind sorta like rotisserie\nSpittin' this wicked ministry to the beat of this Rebeck symphony\nWith a sin for me, separated by 6 degrees of greed for centuries\nAnd hatred engulfs my sensories like hallow screams from penitentiaries\nThis perpetual cycle of depression intention remains bottomless\nEven my psychologist said suicide may be the only option out of this\nAnd while the name Prozak and insane seem to sustain synonymous\nOne half of me wants to engage in the fame while the other half subsides monogamously\nA vigilante who sends deadly packages through the mail\nConfusing law enforcement agencies 'cause I write death threats in Braille\nWith somewhat of a God complex sending the Arabs to the depths of hell\nI warned you, you were forewarned, now witness thy horns unveiled\nI'm taking you on a hell ride so grab those safety belts and fasten 'em\nThrough the screams of tortured souls and eternal flames crackling\nRefusing to reap what you sow and wanna stop this all from happening?\nThis madness will continue until all of Stran-ge goes platinum\n\n[Hook: Tech N9ne]\nCan't hide the (Horns!) And I won't hide the (Horns!)\nI live with the (Horns!) So I'll die with the (Horns!)\nIf you fuck with the (Horns!) Then you'll get the (Horns!)\nSo if you want the (Horns!) Then I'll give you the (Horns!)\nCan't hide the (Horns!) And I won't hide the (Horns!)\nI live with the (Horns!) So I'll die with the (Horns!)\nIf you fuck with the (Horns!) Then you'll get the (Horns!)\nSo if you want the (Horns!) Then I'll give you the (Horns!)\n\n[Verse 3: King Gordy]\nI'm in the desert sands of Bethlehem\nTrying to get Jesus to mate Mary in the manger and molest a lamb!\nDon't jerk yourself off Jesus, use someone else's hands\nSo where's those damn disciples he'd like to have some sex again!\nI guess Young Peter's receiving 'cause Jesus felt his ass\nChrist is an effin' fag, he likes to dress in drag\nBut hey, I guess his dad is just as mad\nGod woulda never had a sissy for a son, bet he's regrettin' that!\nBut yet we still ain't accept the fact\nThat he's fuckin' his mother and at the Last Supper he confesses that\nHe's an undercover male-lover and oh yeah Heaven's wack!\nHe don't want the Light, now I got Christ wearin' black!\nSee, I'm the Devil on his shoulder, yeah I'm that scary fat\nDemon that'll turn all you heathens into scaredy cats\nKing Gordy, the Anti-Christ, God Killer\nI am before and after Christ, I'm called a sinner\nMotherfucker!\n\n[Hook: Tech N9ne]\nCan't hide the (Horns!) And I won't hide the (Horns!)\nI live with the (Horns!) So I'll die with the (Horns!)\nIf you fuck with the (Horns!) Then you'll get the (Horns!)\nSo if you want the (Horns!) Then I'll give you the (Horns!)\nCan't hide the (Horns!) And I won't hide the (Horns!)\nI live with the (Horns!) So I'll die with the (Horns!)\nIf you fuck with the (Horns!) Then you'll get the (Horns!)\nSo if you want the (Horns!) Then I'll give you the (Horns!)", "image": "https://images.genius.com/de5c12836aa9b9bbb55356aafbf1fa0a.900x900x1.jpg"}], "artist": "Tech N9ne"}