{"songs": [{"title": "Drug Free (Remix)", "album": null, "year": null, "lyrics": "[Ol' Dirty Bastard]\nKids, don't get high\nMothafuckas had me up in this mothafucka, last night and shit\nI'm cocained the fuck up\nParanoid as a motha.. yo I'm paranoid as a fucka\nYeah, fuck that.. yo I fuck around and shit\nI sprained both of my fuckin' fingers\nThis shit.. man a nigga need to get.. I'm tired of gettin' high like that\nAin't nobody came in my mothafuckin' school with no mothafuckin' drugs\nStop fuckin' wit me niggas, stop fuckin' wit me\nNigga, that shits all in my family, nigga\nStop fuckin' wit me, the fuck is you talkin' bout?\nOn the strength, what the fuck is you talkin' bout?\nWe've been here too many years to stop fuckin' wit me\n\nNigga I'm scared of the trigga\nWhile I'm the life giver and the life taker\nI'm your father-in-law, married to mother-in-law\nGot the universe movin' in the form of the sea-saw\nYou killed 2Pac and Biggie, you know they was rollin' wit me\nYou paid for your stupidity\nYou can't do nothin' to me! I let your fuckin' eagle fly free\nNigga, I'm pioneerin' all the sound ya hearin'\nEarth from steerin', high mountaineerin'\nI sincerely fuck you up severly by the yearly\nKeep the sky clearly\nI'm straight from the seventies\nMockneck colors wit ya bitch ass disappearance\nGive me clearance, I don't want no fuckin' interference!\nI'm the Big Black Jesus!\n\nThrow ya hands in the air! And wave 'em, fuckin' Wu don't care!\nAnd if ya +'Bout It, 'Bout It+\nLike we're +'Bout It, 'Bout It+, let me hear ya say, \"Oh yeah!\"\nOh yeah! Well, oh yeah!\n\nI smoke woolers too, I majored the dust\nUh, it's legal for me\nI drink everything, I don't give a fuck\nIt's part of the universe\nHey, what else I do? I do what I do\nMan, fuck that! I stays high!\nI don't give a fuck!\n\n[Trigg'nomm]\nYo yo yo I don't stop at the booze, no not, can't drop the tool\nSo no to C.Rules and go to these schools\nNow who thinkin' elementary, class\nI be see no to ecstacy and hash\nHeaded to the penitentiary one way\nBlackin' out sippin', dust plus gun play\nKnucklehead nigga in a stolen Hyundai\nSip this two, a one-to-three on Monday\nIf I'd have stayed in school and said no to drugs\nI'd probably just be what my moms thought I was\nI probably wouldn't be here pleadin' with the judge\nAnd bitchin', it's silly, hope the God forgive it\n\n[Ol' Dirty Bastard]\n(Yeah) Kids, don't use drugs! (What what what what? M.M.O!)\nDurg Free! Drug Free! Drug Free!\nDurg Free! Drug Free! Drug Free!\nDrug Free! Drug Free!\n\n{*beat cuts off*}\n\nDun-dun-dun, dun-dun-dun\nDunh, do-do-do-duh-duh-duh\nDun-dun-dun\nMaybe I was a fool, dun-do-na-na-na\nWhen you say gettin' high wasn't cool, do-na-na-na\nWhen I got used to this stuff, dun-duh-na-na-na\n{*snorting*} Wasn't enough..\n\n{*beat comes back in*}\nDrug Free! Drug Free! Drug Free!\n\n[Itchy-Fingas Sha]\nEh-yo, we worldwide, Drug Free but we all hide\nPumpin' adrenaline through all sides\nMost guys need coke to cope, the only smoke I choke\nIs when I burn niggas verse for verse\nMy drug caper, stoppin' ya heart just like a pacemaker\nWe hold weight so we cross trainers\nAnd headbangers with these black Rangers\nFeds tryin' to contain us\nCuz we live dangerous, drug paraphanelias\nMy life changes, switch up frames in different angles\nCrack'll leave ya dead or with shackles on ya ankles\nLoves and thank yous, but it's a privelage for me\nGivin' 'em Drug Free style, M.M.O., O.D.B\n\n[Outro: M.M.O.]\nBaby.. Baby Jesus, Baby Jesus\nDeadly Venoms - Chameleon, Poison, Scorpion, Viper\nChameleon, Poison, Scorpion, Viper", "image": "https://images.genius.com/d7e323c108da42ed17c2a306b8658e1d.500x335x1.jpg"}], "artist": "Ol’ Dirty Bastard"}