{"songs": [{"title": "My Closest Roaddogz (OG)", "album": null, "year": "1996-02-13", "lyrics": "[Intro: 2Pac]\nMe and my closest road dog (To my nigga Big Mussolini)\nYou know what's up (Big Syke)\nWest side (Thug Life baby)\nOutlaw (the return of the mashes)\nYou know how we do it\nHaHaHaHa\n\n[Verse 1: 2Pac]\nShit half the times we fought and caused trouble\nMy closest road dog, it was cool 'cause I love you\nFuck what they talkin' 'bout\nLet me take you back in time, rewind to eighty-nine\nIntroduced me to this life of crime, but we was blind\nLittle nappy-haired juveniles, livin' wild\nNo smiles on our faces, thirteen catchin' cases\nIndeed, it was misery driven by my own demons\n'cause they was killin' me\nHow can I be sure I'll be saved soon?\nCatch me dip into the light, of a stray moon\nIt's gettin' deeper now, let me get yo' mind right\nFuck yo' enemies, nigga grip yo' nine tight\nTonight's the night, murder murder Mr. Lucifer\nPictures of the devil DUCK when he shoot at ya\nIt's all political, runnin' from the future\nEscapin' in the fog, live yo' life like a hog nigga\nMe and my closest road dogs\n\n[Collision: 2Pac]\n[Track 1]\nAll my enemies scatter, it don't matter\nThey can't see me\nThese niggas wanna see me dead\nBullets in my head\nThey can't see my closest road dog!\nJust me and my closest road dog\nYou know how we mash these motherfuckers\nThey can feel it!\nTo the realest motherfuckers: you know me, Big Syke\n\n[Track 2]\nMe and my closest road dog!\nMussolini, Makaveli, true to the belly, fuck 'em all!\nMe and my closest road dogs\nUntouchable motherfuckin' worldwide mob figures\nDeath Row, westside, when we ride, our enemies die\nYou know what time is\nMussolini!\n\n[Verse 2: 2Pac]\nHold my Glock, my mind's in jeopardy\nMy thoughts in pass, I know I'll die soon\nSo there's no need to add, \"How will my homeboys remember me\"\nBury me a G, casket full of Hennessy\nWe Thug Life niggas, watch for a second comin'\n'Cause I can see the sun\nAutomatic gunfire makin' all them niggas run\nRun from the future, escapin' from the fog\nLivin' life like a hog nigga, me and my closest road dog\n\n[Verse 3:  Mussolini]\nFuture has been dark, since little locs in the park\nWe kept it tight, searchin' for a light but none in sight\nI know God see a nigga in this turmoil suspense\nTrapped in this gutter, residence I'm convinced\nWe commence to smash, hit the cash is all we wanted\nWith the desire expired, 'cause every hood is haunted\nBy killers and jackers, tryin' to make it as a street hog\nBustin' out a coupe in the smog, just—\n\n[Hook: Mussolini]\nMe and my road dog\nNigga, just me and my road dog\nMakaveli just me and my road dog (road dog, nigga)\nJust me and my road dog\nJust me and my road dog\n\n[Verse 4:  Mussolini]\nEverything we did as kids was for the turf\nTryin' to make it work, and my women is gettin' her feelings hurt\nSee that's my road dog, and you my road pup baby\nNot likin' him and sweatin' me is makin' shit crazy\nHazy days with penitentiary ways, don't make me choose\nCemetery days escalates, so you know you lose\nI'm cruisin' through chaos, drivin' through her county\nDisappear off the earth, only my road dog could find me\nAlways on the side of me, and danger parleyin' ain't no better days\nTook off to stay down forever to our dyin' days\nI pray to Yahweh every night to leave this white across\nWhoever go first, don't let the other get lost\nPlaya Boss is what we call ourselves, soon as we got a taste of wealth\nNow we sound like niggas with a bigger arsenal on our shelf\nTrain this group of G's, death before dishonor\nShakin' fleas, fuck with these you a goner, my age partner\nOn my side when we ride and synchronize information\nMakin' hits, pullin' licks buildin' our reputation\nIn the hood, from a tiny to a G hog\nNothing comes close nigga, than me and my road dog\nJust me and road dog\nLivin' on the mutherfuckin' edge\nJust me and road dog\nNigga, just me and my road dog\nJust me and my road dog", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}