{"songs": [{"title": "Déjà Vu", "album": "Relapse", "year": "2009-05-15", "lyrics": "[Intro: Matthew St. Patrick]\nDMC, we have a mid-thirties male found down, unresponsive\nPossible overdose, substance unknown\nPulse is 60 and thready\nRespiration is eight\nHe's intubated and we're bagging him now\nUh, BP 90 over palp\nPatient is cool, pale, and diaphoretic\nHas aspirated, uh, GSC is 3\nWill update en route, ETA: ten minutes\n\n[Verse 1: Eminem]\nAs I fall deeper into a manic state\nI'm a prime candidate for the gene\nTo receive the drug addict trait\nBlood pressure climbs at a dramatic rate\nI seem to gravitate to the bottle of NyQuil then I salivate\nStart off with the NyQuil, like, \"I think I'll just have a taste\"\nCouple of sips of that then I gradually graduate\nTo a harder prescription drug called Valium\nLike, \"yeah, that's great\"\nI go to just take one and I end up like having eight\nNow I need something in my stomach 'cause I haven't ate\nMaybe I'll grab a plate of nachos and I'll have a steak\nAnd you'd think that with all I have at stake\nLook at my daughter's face\n\"Mommy, something is wrong with Dad I think\nHe's acting weird again, he's really beginning to scare me\nWon't shave his beard again and he pretends he doesn't hear me\nAnd all he does is eat Doritos and Cheetos\nAnd he just fell asleep in his car eating 3 Musketeers in the rear seat\"\n\n[Chorus: Eminem]\nSometimes I feel so alone, I just don't know\nFeels like I been down this road before\nSo lonely and cold, it's like something takes over me\nAs soon as I go home and close the door\nKinda feels like déjà vu\nI wanna get away from this place, I do\nBut I can't and I won't, say I try, but I know\nThat's a lie 'cause I don't\nAnd why, I just don't know\n\n[Verse 2: Eminem]\n\"Maybe just a nice cold brew, what's a beer?\"\nThat's the devil in my ear, I've been sober a fuckin' year\nAnd that fucker still talks to me, he's all I can fucking hear\n\"Marshall, come on, we'll watch the game\nIt's the Cowboys and Buccaneers\"\n\"And maybe if I just drink half\nI'll be half-buzzed for half of the time\"\nWho's the mastermind behind that little line?\nWith that kind of rationale, man, I got half a mind\nTo have another half a glass of wine\nSounds asinine, yeah, I know\nBut I never had no problem with alcohol\nOuch, look out for the wall, aim for the couch, I'm 'bout to fall\nI miss the couch and down I go, lookin' like a bouncy ball\nShit must've knocked me out 'cause I ain't feel the ground at all\nWow, what the fuck happened last night? Where am I?\nMan, fuck, am I hungover, and goddamn, I got a headache\nShit, half a Vicodin, why can't I?\nAll systems ready for take off, please stand by\n\n[Chorus]\nSometimes I feel so alone, I just don't know\nFeels like I been down this road before\nSo lonely and cold, it's like something takes over me\nAs soon as I go home and close the door\nKinda feels like déjà vu\nI wanna get away from this place, I do\nBut I can't and I won't, say I try, but I know\nThat's a lie' cause I don't\nAnd why, I just don't know\n\n[Verse 3: Eminem]\nSo I take a Vicodin, splash, it hits my stomach, then (Ahhh!)\nCouple of weeks go by, it ain't even like I'm gettin' high\nNow I need it just not to feel sick, yeah, I'm gettin' by\nWouldn't even be taking this shit if DeShaun didn't die\nOh yeah, there's an excuse; you lose Proof, so you use\nThere's new rules, it's cool if it's helpin' you to get through\nIt's twelve-noon, ain't no harm in self-inducin' a snooze\nWhat else is new? Fuck it, what would Elvis do in your shoes?\nNow here I am three months later, full-blown relapse\n\"Just get high until the kids get home from school, homes, relax\"\nAnd since I'm convinced that I'm an insomniac\nI need these pills to be able to sleep, so I take three naps\nJust to be able to function throughout the day, let's see\nThat's an Ambien each nap, how many Valium? Three?\nAnd that will average out to about one good hour's sleep\nOkay, so now ya see the reason how come he\nHas taken four years to just put out an album, B\nSee, me and you, we almost had the same outcome, Heath\n'Cause that Christmas, you know the whole pneumonia thing?\nIt was bologna, was it the methadone, ya think?\nOr the hydrocodone you hide inside your pornos?\nYour VCR tape cases, with your Ambien CR\nGreat places to hide 'em, ain't it? So you can lie to Hailie\nI'm going beddy-bye, Whitney, baby; good night, Alaina!\nGo in the room and shut the bedroom door\nAnd wake up in an ambulance\nThey said they found me on the bathroom floor, damn\n\n[Chorus: Eminem]\nSometimes I feel so alone, I just don't know\nFeels like I been down this road before\nSo lonely and cold, it's like something takes over me\nAs soon as I go home and close the door\nKinda feels like déjà vu\nI wanna get away from this place, I do\nBut I can't and I won't, say I try, but I know that's a lie\n'Cause I don't and why, I just don't know", "image": "https://images.genius.com/280d45965a412d7e2a115e2db61d79f2.1000x1000x1.jpg"}], "artist": "Eminem"}