{"songs": [{"title": "Feel the Pain", "album": "Words From the Genius", "year": "1991-02-19", "lyrics": "[Verse 1]\nYes, yes y'all\nI feel I'm a threat to high-powered MCs\n'Cause when I roll up on their live shows they kinda freeze\nFrom being approached by the Genius of rap\nWhose poetry makes hands on a clock clap\nYou see, I be coming with strong rhymes galore\nThat even a stubborn MC can't ignore\nThat trying to defeat me brings about danger\nLike a child speaking to a stranger\nSoft MCs, I see more and more\nWith an ancient style, the prehistoric bore\nYes, they scream and roar 'til your throat get sore\nNow you're running to the neighborhood drug store\nTo buy the cough drop, for what? The wrong hip hop\nNow you swear you're on the good ship lollipop\nBut it's a sweet trip to the candy shop\nBlaow! Now it's a six foot drop\nFor stealin' rhymes which is incorrect\nBiting was the cause, death was the effect\n'Cause the action affects reaction\nThere's more like you, yo, you just the fraction\nOf those who speak on how others are weak\nYou wanna sneak peek of the hype technique?\nDon't make me run up and start flipping like I'm insane\nOr you'll feel the pain\nYou'll feel the pain\nFeel the pain\nFeel the pain\n\n[Verse 2]\nI appreciate your compliments of my creation\nYour standing up followed by your standing ovation\nYour kindliness to listen to the true MC\nThose who know me make me number one 'cause they agree\nI rock on and on past the break of the dawn\nAsk Rakeem, Unique Ason or even Melquan\n'Cause I be flowing, at the same time showing\nHard headed individuals who don't be knowing\nThat I wrecked it, 'cause my style is perfected\nAnd injected into a dope beat selected\nBy who? Easy Mo Bee, the engineer\nBut don't forget the hypest in the Northern Hemisphere\nThe G, the- the G, the- the Genius\nFrom Earth, not Mercury or Venus\nOr Mars, 'cause then I'll be a Martian\nBut even in that world I'll still be squashin'\nBrothers who feel they have the heart\nTo battle me, then I'll just trip them apart\nDon't make me run up and start flippin' like I'm insane\n'Cause you'll feel the pain\nYou'll feel the pain\nFeel the pain\nFeel the pain", "image": "https://images.genius.com/a2hbqfa2xwvnb8hpdpe5u35cz.300x300x1.jpg"}], "artist": "GZA"}