{"songs": [{"title": "Beef Rapp", "album": "MM.. FOOD?", "year": "2004-11-16", "lyrics": "[Produced by Metal Fingers]\n\n[Skit 1]\nNow I haven't eaten all day. How am I gonna do this man?\nYeah don't wait for her man, don't wait for her\nI'll tell you what man: come with me now and you know\nI'll get you some lunch, I'll hook you up with something\nI got a little bank, y'know, no problem\nI hear you, that's cool (alright? It's cool)\nMan, can't you guys just wait here about a half hour, man?\nYo I'll be back man, I'm just gonna munch up a little bit man, I'm pretty hungry\nYo let him come back\n\n[Skit 2]\nHere you will find food for your body\nAs well as comfort for your troubled mind\nI'd really like some soup (bread and butter)\nOf course my friend. What happened to your hand?\nOh, food at last!\n\n[Skit 3]\nHow did they get here?\nRegular storage procedure, the same as the other food\nWhat other food?\nFish (food) protein (fast for ya)\n\n[Skit 4]\nNow what happened?\nWell, the cop got\nThe next morning I went to the store to get some food\n(Bread and butter) They arrested me\nI'll save you (thank you)\nWould you like a snack?\nThanks for the drink\n\n[Skit 5]\nOperation Doomsday complete\nAll your intercoms casualty and damage testing\n\n[Skit 6]\nEnough! you talk of the people's rights\nThe people have only those rights which I choose to give them\nAnd that's for their own good, believe me\nI do, DOOM\nThey disappoint me, they must work faster\nWhat about the prisoner?\nAh yes, the young traitor who has tried to turn my people against me\nWatch him. I have special plans for that one\n\n[Verse 1]\nBeef rap, could lead to getting teeth capped\nOr even a wreath for mom dukes on some grief crap\nI suggest you change your diet\nIt can lead to high blood pressure if you fry it\nOr even a stroke, heart attack, heart disease\nIt ain't no starting back once arteries start to squeeze\nTake the easy way out phony, until then\nThey know they wouldn't be talking that bologna in the bullpen\nSo disgusting, pardon self as I discuss this\nThey talk a wealth of shit and they ain't never seen the justice\nBust this, like a cold milk from out the toilet\nTwo batteries some Brillo and some foil, heat'll boil it\nHe be better off on PC glued\nAnd it's a feud so don't be in no TV mood\nEvery week it's mystery meat, seaweed stewed\n(Food, we need food!)\n\n[Verse 2]\nHe wears a mask just to cover the raw flesh\nA rather ugly brother with flows that's gorgeous\nDrop dead joints hit the whips like bird shit\nThey need it like a hole in they head or a third tit\nHer bra smell, his card say: aw hell\nBarred from all bars and kicked out the Carvel\nKeep a cooker where the jar fell\nAnd keep a cheap hooker that's off the hook like Ma Bell\nTop bleeding, maybe fella took the loaded rod gears\nStop feeding babies colored sugar-coated lard squares\nThe odd pair swears and God fears\nEven when it's rotten, we've gotten through the hard years\nI wrote this note around New Year's\nOff a couple a shots and a few beers, but who cares?\nEnough about me, it's about the beats\nNot about the streets and who food he 'bout to eat\nA rhyming cannibal who's dressed to kill and cynical\nWhether is it animal, vegetable or mineral\nIt's a miracle how he get so lyrical\nAnd proceed to move the crowd like a old Negro spiritual\nFor a mil', do a commercial for Mello Yello\nTell 'em devil's hell no, sell y'all own Jello\nWe hollow krills, she swallow pills\nHe follow flea collar three dollar bills\nAnd squeal for halal veal, if y'all appeal\nDig the real, it's how the big ballers deal\nTwirl a L after every meal (food!)\n\n[Verse 3]\nWhat up?\nTo all rappers: shut up with your shutting up\nAnd keep your shirt on, at least a button-up\nYuck, is they rhymers or strippin' males?\nOut of work jerks since they shut down Chippendales\nThey chippin' nails, DOOM, tippin' scales\nLet alone the pre-orders that's counted off shippin' sales\nThis one goes out to all my peoples skippin' bail\nDippin' jail, whippin' tail and sippin' ale\nLight the doobie 'til it glow like a ruby\nAfter which they couldn't find the Villain like Scooby\nHe's in the lab on some old Buddha Monk shit\nOverproof drunk shit, but who'd'a thunk it?\nPunk, try and ask why ours be better\nCould be the iron mask or the Cosby sweater\nYes, you, who's screwed by the dude on the CD, nude\n(We need food!)", "image": "https://images.genius.com/f67af5eb94d7101171adfff4ca96a76c.1000x1000x1.jpg"}], "artist": "MF DOOM"}