{"songs": [{"title": "Vizine", "album": "RGB 2", "year": "2018-03-04", "lyrics": "[Chorus: Lil Wayne]\nWhy me? Oh-why oh-why-oh why me?\nWhy do I look up and see my feet? Am I rising?\nBut why do my peak look like it's out of my reach?\nWhy can't I trust what I see?\n\n[Verse 1]\nMy-my scene just a crime scene\nGot the high beams and the sirens, yeah\nMy team, we divide teams\nTalkin' dirty money? Check the hygienes\nAll the dirty money get dry cleaned\nTalkin' dirty money, Sam Rothstein\nHad my goons kidnap your offsprings\nWhile I was working on my golf swing\nOoh, sweet dreams, sour nightmares\nIt's a cold world, I got an ice grill\nNo one man should have all that power\nIf he can't afford to pay the light bill\nI got a forcefield over my heartbeat\nThe window seal with no door key\nI'm poppin' pills to feel more me\nCut off the wings now I'm soaring\nAnd I never feel like poor me\nI'd rather feel like the old me\nI was born with wheels and I roll deep\nI could make the devil get cold feet\nDon't light the clove unless it's four leaf\nGet a pussy wetter than a coral reef\nOn my face, I tatted me a Fleur de Lis\nShould I get it covered with a coca leaf?\nI could tell you better than you showed me\nI could show you better than you told me\nI'm an OG up in OT and it's no sleep till it's roast beef\nI better not hear a Little Bo-Peep\nBetter go figure, better go deep\nPass no judgement, pass your weed\nI'm the GOAT nigga, no goatee\n\n[Chorus]\nWhy me? Oh-why oh-why-oh why me?\nWhy do I look up and see my feet? Am I rising?\nBut why do my peak look like it's out of my reach?\nWhy can't I trust what I see?\n\n[Verse 2]\nMmm,sippin' on purple like it's herbal\nBad brown bitch, Lisa Turtle\nOn turbo, you don't wanna disturb him\nMomma put too much sugar in my Gerber\nDamn, I done dropped too many ashes on my turban\nI done seen so many titties on Bourbon\nLive a different kind of lifestyle\nDifferent color diamonds, got a nigga lookin' like sherbert\nStepped to the plate, knocked it out the park\nEat a nigga face like a tiger shark\nDressed in all red like Olajuwon\nMy niggas hit your safe like the Holocaust\nMy niggas catch a case, feel like I got Moss'd\nMy nigga treat the K just like a love\nGot a lawyer and an agent but I'm the boss\nAnd my heart always racin' but never lost\nHello? I was the illest nigga on child support\nNow I'm lookin' at the riot report\nWent and looked at the final score\nBedroom got revolvin' doors\nBitches in and out smilin' more\nThan children smilin' at a carnival\nAin't got nothing in common but the common cold\nBig Bs nigga, honor roll\nHold up, I think I found the flow\nStarted from the bottom bitch\nNever been monogamous, never been monotonous\nNever been anonymous, money is unanimous\nAlways had accomplices, always had conglomerates\nAlways let the chopper clip stick out like a bottom lip\nYou runnin' out of time, so you better know what time it is\nYou runnin' out of tears and you runnin' out of volunteers\nYoung Mula bitch, I die for the logo\nCocaine price low, call that a low blow\nTunechi like Pablo, kis in the rowboat\nTunechi in the yacht though, still don't showboat\nSippin' on the slowpoke, movin' like a tugboat\nSmokin' like a steamboat, fuckin' on a love boat\nBetter read the ransom note before you read the love note\nDon't know if it's sore throat, deep throat or cut throat\n\n[Chorus]\nWhy me? Oh-why oh-why-oh why me?\nWhy do I look up and see my feet? Am I rising?\nBut why do my peak look like it's out of my reach?\nWhy can't I trust what I see?\n\n[Outro]\nOh why am I so kamikaze\nWhy can't I stay in my seat?\nI'm so hyphy try me\nWhy do I see these bloody bodies?\nWhy do I love what I see?\nWhy me? Oh-why oh-why-oh why me?\nR.I.P., if you can't live in peace, then you can die in peace\nAs your eyes close and mines bleed, I need Vizine", "image": "https://images.genius.com/04bcfe81cfd5089e604c8d82f2ff778a.996x996x1.png"}], "artist": "Lil Wayne"}