{"songs": [{"title": "Long Kiss Goodnight", "album": "Life After Death", "year": "1997-03-25", "lyrics": "[Intro: Puff Daddy & Notorious B.I.G]\nMmmmmmmmm-HMM\nSee.. [echoes]\nI told you.. [echoes]\n\nSee, I told y'all muh'fuckers\nYo yo.. that stupid nigga man\nI told y'all to stop!\nHe fucked up, yo..\nI pray for you to stop\nYo, yo yo yo, yo.. yo.. yo..\nYo, yo yo yo, yo..\nBut no, you didn't stop\nYo.. yo..\nAnd now, we won't stop\n\n[Chorus: The Notorious B.I.G.]\nTime, time for you to die\nAs I kiss.. yo'.. ass.. goodnight\n\n[Verse 1: The Notorious B.I.G.]\nI make your mouthpiece obese like Della Reese\nWhen I release you lose teeth like Lil' Cease\nNigga please, blood floods your dungarees\nAnd that's just the half of my warpath\nLaugh now cry later, I rhyme greater\nThan the average playa hater and spectators\nBuy my CD twice, they see me in the streets\nThey be like, \"Yo he nice, but that's on the low though\"\nBe the cats with no dough, tried to play me at my show\nI pull out .44s and go up in they clothes\nShort-change niggas, snort 'caine niggas\nExtortion came quicker, bought the Range nigga\nYa still tickle me, I used to be as strong as Ripple be\n'Til Lil' Cease crippled me\nNow I play hard like my girl's nipples be\nThe game sour like a pickle be, y'all know the rules\nMove from BK to New Jeruz\nThinkin' 'bout all the planes we flew, bitches we ran through\nNow the year's new, I lay my game flat\nI want my spot back, take two\nMotherfuckers mad 'cause I blew, niggas envious\nToo many niggas on my dick, shit's strenuous\nWhen my men bust, you just move with such stamina\nSlugs missed ya, I ain't mad at cha (we ain't mad at cha)\nBlood rushin', concussions ain't nothin'\nCatch cases, come out fronting, smokin' something\nSippin' White Russians, bitch in the Benz bumpin'\nI laced it with the basic, six TVs a system\nKnockin' Ma$e shit, face it, we hard to hit\nGuard ya shit, 'fore I stick you for your re-up\nWipe the pee up, lick shots, woke your seed up\nGo in the ashtray, spark the weed up, long kiss\n\n[Interlude: Puff Daddy]\nHell, we don’t give a fuck\nWe just absolutely don’t give a fuck\nBecause there ain’t no love here\nThere ain’t no love here\nYou know, we gon' keep doin' what we do\nWe gon' keep fuckin' you up\nI'ma keep stomping your motherfucking head in\nYou fucking bitch\n\n[Chorus: The Notorious B.I.G.]\nTime, time for you to die\nAs I kiss.. yo'.. ass.. goodnight\nTime, time for you to die\nAs I kiss.. yo'.. ass.. goodnight\n\n[Verse 2: The Notorious B.I.G.]\nUhh.. I'm flamin' gats, aimin' at\nThese fuckin' maniacs, put my name in raps\nWhat part the game is that? Like they hustle backwards\nI smoke Backwoods and Dutchies, you can't touch me\nTry to rush me, slugs go, touchy-touchy\nYou're bleedin' lovely, with yo' spirit above me\nOr beneath me, your whole life you live sneaky\nNow you rest eternally sleepy, you burn when you creep me\nRest where the worms and the weak be\nMy nine flies, baptize rap guys\nWith the Holy Ghost, I put holes in most\nYou hold your toast shaky, slippin' tryna break me\nLook what you made me do, brains blew\nMy team in the marine-blue Six Coupé\nSkied it out, weeded out, cleanin' out\nThe block for distances, givin' long kisses, bitch\n\n[Interlude: Puff Daddy]\nOnly I can do now, I say a prayer for you\nYou know, that’s the only thing I can do, just pray for your mind\nBecause, see your mind is in control of your heart\nWhere it's supposed to be the other way around\nYour heart has got to control your mind\nSo now, I have no feelings for you\nYou have made me cruel\n\n[Chorus: The Notorious B.I.G.]\nTime, time for you to die\nAs I kiss.. yo'.. ass.. goodnight\nTime, time for you to die\nAs I kiss.. yo'.. ass.. goodnight\n\n[Verse 3: The Notorious B.I.G.]\nFrank White the menacin', Chron Chron's the medicine\nI got the lettuce and you turn green like cucumber skin\nGot the new Hummer in the summer when\nI was a newcomer then, drugs and MAC-10s\nHugs from fake friends, make ends they hate you\nBe broke, girls won't date you\nThat's why I relate to, choke your ass out 'til your face blue\nMake you, open the safe too\nNo matter how you call it (how you call it), this brolic alcoholic\nLike his weed greened out, like his brick solid\nDistribute to kids who take heart like Valentine\nDrink Ballantine all the time\nSlugs hit your chest, tap your spine, flatline\nHeard through the grapevine, you got fucked four times\nDamn that three to nine, fucked you up for real though\nSling steel slow, as for remorse, we feel no\n\n[Chorus: The Notorious B.I.G.]\nTime, time for you to die\nAs I kiss.. yo'.. ass.. goodnight\nTime, time for you to die\nAs I kiss.. yo'.. ass.. goodnight\nTime, time for you to die\nAs I kiss.. yo'.. ass.. goodnight\n\n[Outro: Puff Daddy]\nSee the fucked up thing is that I love you\nYou know what I’m saying\nIt’s just in my nature to love you\nI can’t hate you\n‘Cause its not in my nature to hate you\nYou know, I don’t know\nMaybe I’m a different type of individual\nBut you have me on a line\nAnd there’s a thin line between love and hate\nAnd God-forbid I cross that line\nCause I’m not gon’ give a fuck\nI’m telling you right motherfucking now\nThe shit that ya’ll done started\nIs never gonna stop!\nWe are never gonna stop!\nAnd we’re not talking about no other rappers\nWe’re talking about you, motherfucker!\nYou know who I’m talking to\nWe comin' for you\nWe comin' for you\nLaughs\nFeels so good\nI'ma make you love me baby, baby", "image": "https://images.genius.com/f4413efc6682e8c2cfa7a01117fc8cd5.1000x1000x1.jpg"}], "artist": "The Notorious B.I.G."}