{"songs": [{"title": "Pimp Nutz", "album": "Red Gone Wild: Thee Album", "year": "2007-03-27", "lyrics": "\"How many motherfuckers that smoke?\"\n(Inhales)\nWho got some chronic in this motherfucker?\nGilla House!\n(Barking)\n\"That sounds good\"\nOne-Deuce\n\nYo yo well it's the Soopaman Luva nah bitch Reggie Noble\nMiddle finger up in photos\nYour flow? Eh, so so\nCall me that nigga that got the bounce\nAnd I'll pull up to the party witta half a ounce\nI got them niggas in the back and they yellin' \"HO!\"\nPunk niggas start runnin' like panty hose\nGot the Sour Dies' waving up high in the sky\nThey're saying, \"Redman roll up and let's get high\"\n\n[Hook]\nWell it's the Soopaman Luva nah bitch call me Pimp Nutz\n(Who?) P-P-Pimp Nutz (Who?) P-P-Pimp Nutz\nRollin' through your muthafuckin hood in the big truck\n(What?) b-b-big truck (What?) b-b-big truck\nWell it's the Soopaman Luva nah bitch call me Pimp Nutz\n(Who?) P-P-Pimp Nutz (Who?) P-P-Pimp Nutz\nRollin' through your muthafuckin hood in the big truck\n(What?) b-b-big truck, b- b-b-big truck\n\nWell you can tell how I spit, I don't really give a fuck\nI be rollin' through your neighborhood middle finger up\nLike \"Yo wussup nigga, what happened to my weed? (I on't know)\nLast time I seen yo' ass you gave me some chicken feed!\nI had to roll on you and show you how it go\"\nYou know how Bricks flow\nWe pullin' da fo'-fo'\nHang out the sunroof and I'm yellin' out \"YO!\nWhat happened to my weed and what happened to my dough?\"\nMy motion real slow\nWhen I start to bust\nAnd I get the party bubblin' like Alka Seltzer Plus\nYou niggas smoke dust\nIf my flow ain't tight\nCause I'm tight like a jewish wife\nI'm that nice\nNigga you know Red, I be at the party\nLike drinking Bacardi\nWith somebody\nHad to smack a chick for touching my face\nI'm like, \"Bitch don't you know there's a gun in my waist?\"\n\n[Hook]\n\nNow you don't have to ask nigga who got the bomb\nI shotgun like the arm\nOr Roger moms\nWhen I pull it ya ask, \"What's Happening?\"\nWe ain't talking, we doin' the gavelin'\nIt's Reggie Noble on the scene\nCall me Mr Green\nI got my P.O. thinking that my system clean\nBefore I seen her, I gargle with the Listerine\nSo she can turn my felony to a misdemean'\nI'm like, \"Bitch don't you know who I be?\"\nI could go cash a check without no ID\nI'm a East Coast legend, you should know 'bout me\nThis is for my 'hood bitches and real OG's\nIf you're really unaware\nThat we insane then tell us\nI'm in my underwear\nLike Damon Wayans in Colors\nWhite tee, Air Force got 'em different colors\n550 S Benz make a nigga jealous\n\n[Hook]\n\n[Redman as WKYA DJ ad libs until end]", "image": "https://images.genius.com/65aa1591ac947b9397141766462ac089.465x465x1.jpg"}], "artist": "Redman"}