{"songs": [{"title": "Big Boy’s Neighborhood Freestyle", "album": null, "year": "2014-10-23", "lyrics": "[Verse 1]\nI say, “hey now, brother,” sike, nah\nL-O-G-I-C, all up in this vicinity, you know it's me\nThis is how we do it all day\nGoddamn, can you feel it\nAll up in the spirit\nI can get it, I can do it\nL.A, hell yeah, let me get it for the bay\nFor the M to the D, to the N.Y.C\nThis is how we do it, 'bout to kick this free off the top\nThis is how we do it all the time\nI just kicked Nikki in the fucking face\nGoddamn, can you feel it when I'm all up in the place\nGotta do it right now, gotta do it right now\nWhen I spit it, no, you know I'm never lost\nHold up, tell me big, how much is a pie cost?\nLet me get it, let me spit it, let me bring it back like this\nWe having a good time, design this rhyme\nI spit, random thought off the top, of my mind\nGoddamn, can you feel it, yes, I got it, feeling hella good\nAin't got no driver's license, but you know I'm driven\nThe second I spit it, everything that's what I'm giving\nYeah, I get it off the top, T-O-P, I gotta say it\nI spray it, never delay it the second I mayday it\nGoddamn, I’ma get it on, gotta get it on\nGotta spit it, I get it, I rip it, can you feel it now\nLike I'm Jamaican, I'm spittin’ off the top, brudda!\nGoddamn, let me get it, word to your mother\nI'm having fun, gotta do it\nNever, never pack the gun\n‘Cause I spit it off the top like a ton\nGoddamn, yeah, I gotta do it one time\nDef Jam, V's up, this is how we do, it ease up\nPlease up, can you feel it all up in my spirit\nIt doesn't even matter, random thought\nThese, these, this decision I get it, second incision\nAnd spit it and this is how we do it, yeah, I gotta get it\nNever regret it the second I said it, it's so fucking pathetic\nYour etiquette murder your predicate\nBring it back again\nHalf-white, half-black again\nThis is all they want to talk about, and yeah, I'm mac'ing in\nI got Krystal Bee to the right, Louie G to the left\nEverything is out of sight and I'm going off\nUnder Pressure, October 21, already came out\nGotta spit this free verse\nStrictly off the top, I never drop, never stop\nOh, goddamn, go to Best Buy and fucking cop, get the physical\nThis is how we do it so medicinal\nNo, I'm never smoking, but your girl is chocking on this — whoo!\nSorry 'bout that, let me bring it back\nCan you feel it, goddamn, goddamn\nI could go on for days and days, never delays and laze\nThis is how we do, spit it, think I need some sun rays\nI've been in the house too long, just spitting this\nLet me change up the beat, yeah, I'm ripping this, I got it\nYou know you got it on the one's and the two's\nMy man's in there, doing what it do's\nI'm from Maryland, in your system like heroin\nThis is how we do it, can you feel it when I'm staring in\nI'm just going and going, I'm flowing and flowing, why?\nI'm ripping and living and striving to kill it\nTo rip, I gotta get it right now when I do it\nWhen I got it, when we crewin’, uh\nYou want me to stop, should I stop, should I keep going?\nShould I keep flowing?\nNever knowing the direction in which I'm going\nI spit it, I got it, I gotta get it, goddamn\n\n[Hook: Big Boy]\nAnd you don't, and you don't, and you don't\nAnd you don't, and you don't, and you don't\nAnd you don't, and you don't, and you don't, and you don't, and you don't stop!\n\n[Verse 2]\nMy favorite, my favorite song of all time is what?\nSomething by Wu-Tang, or maybe Ice-Cube \"It Was a Good Day\"\nThis is all I gotta say, yeah, you know the deal\nYeah, you know the deal, how I feel\nI could keep going and going and going and going and going on\nThis is how we do it 'til the break of dawn\nGoddamn, I was in New York yesterday, now I'm in L.A\nI just don't know what to say\nI'm feeling so damn good\nFeeling so damn fine like Mos Def in Brooklyn in a park\nWest Deer Park, come out after dark, that's where the murder start\nDon't let me stop, let me stop, let me keep it going\nThis is how we do it\nSwitch the beat up again, switch the beat up again, come on\n\n[Hook: Big Boy]\nAnd you don't, and you don't, and you don't\nAnd you don't, and you don't, and you don't\nAnd you don't, and you don't, and you don't, and you don't, and you don't stop!\n\n[Verse 3]\nCheck it, check it, let me keep it up\nThis is how we do it, let me beat it up\nI'm feeling this villainous vibe, this shit is hella crazy\nYou never amaze me, I'm never feeling lazy\nLike I said, this is random thought, the shit that can't be tought\nIt's just emotional\nI never provoke it, I spit it, never choke it\nGoddamn, this ain't, no 8 Mile, B-Rabbit\nThe second I spit it, I gotta have it, I gotta do it\nNever dab it like my homie Slay Dro at the crib\nThis is how we do it, put it in the bitches' rib\nEverything I got is what I'm finna give\nBut my queen, she's a beauty\nThis is how we do it, goddamn, such a cutie\nUh, let me spit it, yeah, she's sweet like 5 stars\nI gotta get it right now\nI'm kinda hungry, 'bout to hit Five Guys, pause\nSike, nah, I'm just fuckin’ around\nLet me get it, no beef\nNah, we squash that, this is how we do it\nWe 'bout the lettuce, we toss that, uh, goddamn\nIt's so crazy, such a particular case\nMy man Louie G looking like he just came back from outer space\nIt's just much more than a hare race, you're moving at a snail's pace\nGoddamn, I'm just switchin’ the flow\nNever know, half-white, half-negro\nYou know we gotta spit it, that's for sure\nI love who I am, love who I ain't\nThis is how we do it, let me spit it\nJust let me paint, the picture, the second I get richer, I get bigger\nCan you feel it, the second I got it, I got six figures and commas\nI never pause though, unless I need it, this is how we do it\nThat's word to Anita, we need to bring it back\nI love the beat, let's go again\nLet's go again, let's go again, come on\n\n[Hook: Big Boy]\nAnd you don't, and you don't, and you don't\nAnd you don't, and you don't, and you don't\nAnd you don't, and you don't, and you don't, and you don't, and you don't stop!\n\n[Verse 4]\nLet me spit it like this it's, so ridiculous\nGoddamn, I know you feel it\nWu-Tang, hit you with the killer B\nGoddamn, that's my thing when I spit it, when I sing\nOh my God, going crazy, it never does amaze me\nNever lazy when I spit it off the top\nThe topic is hella awesome\nYo, it's like freestyle, the art of a rhyme\nThe second I spit it, in my mind, I design\nI bring it back, I might say some of the things twice\nOr three times in a row, but it doesn't matter, that's for sure\nWe just having a good time\nThe second I rhyme, I spit it divine\nGoddamn, it's so crazy, it's off the top of my mind\nI'm from Maryland, how many times must I say it\nI spray it, never delay it, I bring it back like this\nUh, I look around, I see a lot of beautiful people\nWhat's next after Under Pressure, the sequel?\nMaybe a prequel, we take it back, even before my birth, where hip-hop started\nThis is how we do it, damn, goddamn\nI never farted, but this shit's stinking\nThis is how we do it\nSecond that I get it, you're probably thinkin’ I'm drinkin’\nBut I never touch this stuff\n‘Cause the only thing I need to succeed is this money in my pocket, goddamn\nWanted to greed, unless we want to talk gluttony\nAnd even something else from the seven deadly\nHow we get it, yeah, I'm ready, just the medley\nI be on, goddamn, it's crazy, this is when I'm going\nGoddamn, I just feel it, I love it, I gotta get it\nThis is how we do it, switch it up, speed it up\nLet me get it, that's enough\nGoddamn, can you feel it\nCan we go one more time, come on tell 'em, let's go\nOne more time, come on, tell 'em, let's go\nHow we go now\n\n[Hook: Big Boy]\nAnd you don't, and you don't, and you don't\nAnd you don't, and you don't, and you don't\nAnd you don't, and you don't, and you don't, and you don't, and you don't stop!\n\n[Verse 5]\nNow this, this right here is the finale\nIt's never written, that shit is forbidden\nIs you kiddin‘, you gotta see me now\nThis is how they do it when they see me, yes, I smile\nAll the time, spit it off the top, when I do I rhyme\nI gotta keep it going, gotta, gotta keep it flowing\nI just love it, nothing above it the second I touch it\nThe second I got it, it's ever enough\nI'm like a human dictionary, paint pictures like pictionary\nIt's hella scary, these motherfuckers think that they can see me\nBut, I see right through y'all\nSee, I see the bigger picture like I work at the movies\nThese motherfucking groupies wanna get next to me\nI'm like nah, bitch, don't touch me, you need to understand\nI'm an actually, I'm a nice guy, so, I don't fuck with hoes\nYou understand what I'm saying?\nI'm all about my money, all about this shit\nAll about my team, all about the hits\nThis is what I gotta do, this shit is legendary, it's never scary\nThe second I spit it, it's what?\nIt's like an obituary\nWhat I'm spitting isn't written, ‘cause I murder you motherfuckers off the top\nThis is how we do it, yeah, I bring the ruckus\nI'm a good motherfucker, and I represent hip-hop\nSo, all this other extra bullshit, please stop\nThis is who I am, I am just a man, I am, who I am\nMotherfucker, that's me\nThe L-O-G-I-C, repping V, Visionary off the top\nShoutout to the R-A-double-T-P-A-C-K, everyday\nHow we get it, and the BobbySoxers, yeah, I know y'all, love ya\nI gotta get it, yeah, I gotta get it\nYeah, I'm not kidding like I ain't have a rubber\nGoddamn, can I get it, word to your mother\nI'm just a man, I be loving it, loving it, rubbing it, rubbing it\nCome on, baby girl, tell me how you feel, let me get it, let me get it\nLet me get it, let me get it, can you feel it?\nI'm just loving it, loving it\nBring it, bring it right back, this is hella cazy\nMaybe half on the sack, used to smoke a little tree, back in tenth grade\nHoneys, honeys, I could never evade\nI was just skipping school, breaking all the rules, coming from a broken home\nFelt like I was, I was all alone in, in, all up in a different type of zone\nI would close my eyes, and then I hit the microphone\nGoddamn, I was writing in my past, just a young man\nIt's kinda crazy, I feel like you could just keep going forever, forever, forever-ever?\nLike my name was Andre 3k\nGoddamn, that's what I gotta say\nBut I’ma stop it right here, right now, understand\nNo other MC could measure\nOctober 21st, it was done, Under Pressure\nIt's Logic", "image": "https://images.genius.com/75b9fd3705271c3c10d64dfb3139caf7.900x900x1.jpg"}], "artist": "Logic"}