{"songs": [{"title": "Sunshine", "album": "Lupe Fiasco’s Food & Liquor (Advance/Pre-Release Leak)", "year": "2006-08-09", "lyrics": "[Verse 1]\nFresh to def she is\nFrom her steps to her set she is\nSo death might not let me live, ya dig?\nFresh, uh-huh—yes, she is\nHad a feeling that it would be a day like this\nThe orchestra in my mind, don't play like this, naw\nBut I'm prepared for it, got a little rare for it\nBrushed off my Airs, even cut my hair for it\nCause normally I don't care for it\nDon't even be looking for light like that, then there go it\nYeah, right over there, so I prepared to pour it\nLittle scared, my stare lowered, momma said have no fear\nPlus I'm already out of my chair\nGather up my Airs on my square from here forward\nIt's nothing, right\nSo here go it, whispered in her ear\nIt's kinda crowded in here would she care to blow it\nAnd she said, \"Yeah.\"\n\n[Hook]\nYou're my sunshine\nYou're my moonlight\nYou're the starry skies above me\nWon't you please come down and hug me\nThink I found love in this club tonight\n\n[Verse 2]\nNever met her before\nBut I think I like her like a metaphor—it's hard to get\nIn the car we sit, from the intro\nShe rolled down the window, just in case I was a schizo\nI compliment her on the common sense\nI'm calm, a little more confident\nUh huh, and then we lose consciousness\nShe says that I've been waiting for you\nAnd I know you've been chasing me too, since they kidnapped\nMe from a castle, I've been thinking of you\nI told a fire-breathing dragon he better not harm me\nOr be sorry when he meets my one man army\nAnd thou has come to rescue me\nMy knight in shining armor, yes, you be\nWoken up by the horn of an SUV\nI said, \"See? Too beautiful to let you sleep\nYou're my sunshine\"\n\n[Hook]\nYou're my sunshine\nYou're my moonlight\nYou're the starry skies above me\nWon't you please come down and hug me\nThink I found love in this club tonight\n\n[Verse 3]\nRelationship is just thirty minutes long\nIt's kinda heavy, maybe a little strong\nGonna take much more than once\nCan't trust what each of us say at least for a month\nOr two, before I bid you adieu\nDo this one thing for me: out of the trillions\nOf numbers that's in the world just leave me a few\nThat lead to you\nWon't be long then, I'll see you in the morning\nCool?\n\n[Hook]\nYou're my sunshine\nYou're my moonlight\nYou're the starry skies above me\nWon't you please come down and hug me\nThink I found love in this club tonight", "image": "https://images.genius.com/373c57c9cfddd95f1d232784084809ba.500x500x1.jpg"}], "artist": "Lupe Fiasco"}