{"songs": [{"title": "Give It All", "album": "Special Effects", "year": "2015-05-04", "lyrics": "[Hook: Krizz Kaliko]\nI wanna give, give it all\nI said, I said, I said, I said\nI wanna try to kill everything in my way\nEverybody say, hey, ey, ey, ey, ey!\n\n[Verse 1: Tech N9ne]\nYep, I'm the one ya heard\nReppin rojo on Jimmy Kimmel had some disturbed\nBut niggas know that we ruff and rugged so mum's the word\nTech Ninna face painted look like he come ta purge!\nReal Scorpio, shoot this thing like a torpedo\nRock the rip, no remorse we go\nDummy like Mork from Ork, we know\nAnd I say that with the utmost respect\nI bust flow to death, I must blow the check\nIt's never enough dough for Tech\nSo I get sick with it, I make a bitch dig it\nEven when I wanna speed it up and I quick-spit it\nI get a bit wicked up in a battle\nTry to bite I buck a blammer in his fitted\nKillin' music get me stiff sitted, I can't piss when it become hard\nSo I need a chick to hit it when I kick a lyric\nAnd I'mma murder 'til I'm on the yard (Murder)\nMy verse are like burst that jerk up and merk the weak twerp\nYou cannot hurt the Gurkha\nFirst ta', insert the work, the son of the earth\nI disperse the curse to reverse ya to the worst of ya\nThen I'mma squirt ya MRSA (Ugh)\nTrip not, you see I got the advantage in hip hop\nCause rappers sound identical so when Ninna's shit drop\nI do numbers, I'm the pinnacle so never will this stop\nY'all can't beat me doin' nothing, except for\nStalkin' these thoughts I spew and suckin'\nWe run this independent game, it ain't no screwin' us\nWhen we runnin' everything except our mouth while they blue and sufferin'\nThis on the Bible, I kill any life with a script from this rhyme\nMusic's done - divine\nThis is my rifle, there aren't any like it cause this one is N9ne\nThis a gift from his mind\n\n[Hook: Krizz Kaliko]\nI wanna give, give it all\nI said, I said, I said, I said\nI wanna try to kill everything in my way\nEverybody say, hey, ey, ey, ey, ey!\n\n[Verse 2: Price]\nYo, I Got the call from Tech N9ne\nHe needed assistance from the group with the best rhymes\nThat spit that get up off of yo ass and grind\nFuck all of them flex lines\nI get love in every city I sack in cause I rep mine\nAround the world, the girls give me head on tour cause I headline\nI gotta get fed, I'm fed up, my homies is doin' fed time\nI look at that clock and all I see is \"Go get that bread\" time\nLost too many soldiers so tears, I gotta shed mine\nTurn on the radio, hear yo shit, and oh, it's bedtime\nI fall asleep, it all is weak, most y'all shouldn't be called MCs\nBurnt ya discography, you ain't sale cause all of ya talk is cheap\nSmoke up all the tree, my whip look like it got a fog machine\nMy crib look like a pharmacy, that's prolly why you wanna halt my team\n\n[Verse 3: Oktane]\nLivin' facetious, bobbin' head while the weed lit\nI make change where I see fit\nI don't play like I don't see shit\nYeah, one hunnit, one hunnit, keep it that way and it's potent\nAnd stay away from the hate and keep all yo plays right in motion\nBust it, I'm down after the sun and up before it, better know it\nMVP, most valuable poet, been the coldest, kept it focused\nCause you miss every goal that you don't shoot for\nAnd every time you cut a corner, you make two more\nPut richness in my life so I don't have to half at things\nAnd listen for the whispers so I don't have to hear the screams\nAnd I go hard for what I want, so it's just colors when I dream\nAnd then you realize, it's not as scary as it seems\nNormal is for pussies\n\n[Hook: Krizz Kaliko]\nI wanna give, give it all\nI said, I said, I said, I said\nI wanna try to kill everything in my way\nEverybody say, hey, ey, ey, ey, ey!\n\n[Verse 4: Tech N9ne]\nAin't nobody handle me, heated like a candle be\nKissin' dirt, ya man'll be for tryin' to dismantle me\nMusic is my weapon, true, loud enough to deafen you\nNever trip with Tech and crew, be careful who you steppin' to\nI remember when I was young and I got scars through\nRight in back of the paddy-wagons and cop cars too\nNow that I'm flyin' high from a rockstar view\nSecurity level let Allahu Akbar through\n\nHey, ey, ey, ey, ey!\nHey, ey, ey, ey, ey!\nHey, ey, ey, ey, ey!\nHey, ey, ey, ey, ey!\nI wanna try", "image": "https://images.genius.com/edd99f73805809fd6bac9dda75c9e951.550x550x1.png"}], "artist": "Tech N9ne"}