{"songs": [{"title": "No No No (The Splash)", "album": "Hidden Darts: Special Edition", "year": "2007-03-13", "lyrics": "[Intro: sample (Ghostface Killah)]\nWe-we-we sound and tell the people\nAbout the musical disc coming your way!\n(Buck-bu-bu-buck! Brrr-bu-bu-buck!\nGhostface Killah!)\n\n[Ghostface Killah]\nI'd love to make you happy, buy an island off Miami\nFeed your mother and your family, my wildest fantasies\nTake place, overlooking real high mountains\nThey wrote our name in the sky, see baby, we bout it!\nThis is all us, Adam and Eve if you want\nThis time, we respect God's work from the jung'\nThat's all you ever said, Ghost fed, many heads\nBroke dead, I'm going bald, girl, I can't grow dreads\nKiana told Deb, on the moped\nCiCi Vet on the beach steps give me slow neck\nShe's lyin', she be on X\nShe's tired, she a house wreck (that's right)\nDon't buy it, tell me why you said that (\"Cause you left me...\")\nI never left you, you left me\nYou thought if you break out from the kids, you'll be stress free\nTalkin' bout it, baby, you my first lady\nYou let me suck up on them nipples\nWhen I get cranky, and taste your kitty\nSo girl, won't you on come back down to Earth\nOnce you land on the Rock, you gonna always see a dirt\nFace first, they the worst, they searched and searched\nAnd the worst, don't it hurt, my love, stay alert\n\n[Hook: Ghostface Killah]\nTwo things that you can't touch: My money, my girl\nThe he-say and she-say could fuck up your world\nPlaya-haters, perpetrators, house-breakers\nCan you see the fact that nigga try'nna live life?\nI was raised in a jungle, and stumbled on hills\nAnd didn't nobody ask me on how did I feel\nBut that sugar and my spice, that's wife\nShe's my lady, and we just wanna live right, uh\n\n[Outro: sample (Ghostface Killah)]\nTell the people, tell the people...\nTell the people, tell the people...\nTell the people, tell the people...\nTell the people, tell the people...\nNo, no, no... you don't love me and I know now...\nNo, no, no... you don't love me, yes, I know now...\nTell the people (I see you)\nTell the people (I see you)\nNo, no, no... I'll do anything for...", "image": "https://images.genius.com/7e5a18091d3e0f8ca0dd24fa1536f363.500x500x1.jpg"}], "artist": "Ghostface Killah"}