{"songs": [{"title": "My Carz", "album": "Coolaid", "year": "2016-06-28", "lyrics": "[Hook]\nMy cars, they hot, my paint is wet\nMy bitches, they bad, thats probably why y’all mad\nMy cars, they hot, my paint is wet\nMy bitches, they bad, thats probably why y’all mad\nMy cars, they hot, my paint is wet\nMy bitches, they bad, thats probably why y’all mad\n\n[Verse 1]\nYou see I’m mean with the 16, yes you are\nGot a big old house, bout 50 cars\nAnd the ones I drive, what a hell of a ride\nBuilt for a player when I lean to the side\nMy shit so dank, my paint is wet\n‘Lacs, Impalas, and Corvettes\nWagoners, saggin’ here\nNigga not braggin’ here, but lets be clear\nMy cars, they hot, my paint is wet\nSo I figured the funk, point blank man this nigga a hoe\nLook around, smash down, sit your ass down little class clown\nLet me get back on the highway, try my way\nThis is the fly, way, Mass appeal, cash the deal\nNever will I motherfuckin’ crash the wheel\nPass the feel, the tank with the drank in the cup\nLook baby girl, thats whats up\nSlide by my side bitch house in the cut\nWith my 9 by side when I side in the cut\nI shake I shook in, peep out the window, niggas still lookin’\nWhen in doubt, flash that 9 get in and out\nTake my time while dippin’ out, then bang my set while spinnin’ out\n\n[Hook]\nMy cars, they hot, my paint is wet\nMy bitches, they bad, thats probably why y’all mad\nMy cars, they hot, my paint is wet\nMy bitches, they bad, thats probably why y’all mad\nMy cars, they hot, my paint is wet\nMy bitches, they bad, thats probably why y’all mad\n\n[Verse 2]\nLet me raise mine, bang for the Fo’\nPop that shit nigga break it down low\nThey say the stage with more lights\nCan the nigga re-write the whole game\nShe tried to dodge the blue ride\nBig race tires we ride the whole ride\nWe bringin’ it live to your side\nYou gonna stand outside or you gonna jump inside?\nShe said cool can my girls come?\nWe gon’ drank, smoke then fuck some\nIt was 2, 3, 4, then 5, tall short thick and fine\nAnd they all enjoyed the ride, Dogg could you bring us all back again\nI love it when you put it in my back again\nFill up in your car then you back again\nCause your cars are hot, your paint is wet\nYour bitches, they’re bad, thats probably why they’re mad\nYour cars, they’re hot, your paint is wet\nYour bitches, they’re bad, thats probably why y’all mad\nYour cars, they’re hot, your paint is wet\nYour bitches, they’re bad, thats probably why y’all mad\n\n[Outro]\nNow look here mane\nI got variation mane\nI got a white one,  a black one, a yellow one\nA green one, a blue one, a red one\nI mean I mean mane, I even got a space ship, you dig\nYou could even float with me if you want to\nCause thats how a real player ride\nWe ride like we ride\nYou wanna get inside, well lets ride\nYou wanna get inside, well lets ride\nYou wanna get inside, well baby lets ride\nYou ever made love in a car? You don’t like when I talk to you like that?\nYou ever been fucked in a car? That sounds better don’t it", "image": "https://images.genius.com/a417abe2f61213b3db18f28de7cdbc86.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}