{"songs": [{"title": "Never Told", "album": "Cole World: The Sideline Story", "year": "2011-09-27", "lyrics": "[Intro]\nYeah, what's up girl?\n\n[Verse 1]\nAngel eyes, long hair, I see you cryin', what's wrong there\n\"He did what? He fucked who?\", we know the story, what's new?\nSee I could probably rush you, tell you that he shoulda loved you\nTake advantage, fuck you, tell you I'll do all the shit he wouldn't do\nBut the truth is, we all the same, on different teams, but it's all a game\nThe objective, tryna score, you got a wife, you find a whore\nYou fuck her fast, she find her drawers, pull up her pants, you find the door\nYou drive her home, she mop you off, you bust again, and drop her off\nThen repeat like an episode; why we cheat, I'll never know\nIs it cause we rap? Heavens no, lotta niggas rap though, never blow\nLike heterosexuals, girl you fine, from head to toe\nCould it be cause my father let me know that he cheated and somehow\nI never told, I never told\n\n[Interlude 1]\nFather: Hey you wanna be a man?\nSon: Yeah I wanna be a man\nFather: A man don't run and tell his mama everything he see\nSon: I ain't gon' tell\nFather: Alright, alright then man, be a man then\nSon: Alright\n\n[Verse 2]\nOk, that's what it is, I see the game, the hoes come, the seasons change\nThe hoes go, we rearrange, fuck up her life, she'll never be the same\nThe OG's that beat the game, forever young, Peter Pan\n35? Still playing; Child support? Still paying\nJuggling, bill paying, been running round, field daying\nWine and dine, meal paying, with hopes that she'll lay in\nThe bed and, get wet then, give head then, you bet man\nThe same girl who said we just met man, game colder than the fucking dead man\nOne night stands, no best man, no bridesmaids or Reverends\nCause Wolverine's depressed and don't wanna be your ex-man\nCause Cupid aims and throw the darts, there go the sparks and broken hearts\nWho wanna build Noah's Ark just to have that shit torn apart?\n\n[Interlude 2]\nWife: You know what? I need to talk to you\nHusband: About what?\nWife: I don’t think this is, working out for us\nHusband: Why?\nWife: I mean, I need some space. I mean no, I just wanna find myself, that’s all\nHusband: What the fuck?!”\nWife: You know?", "image": "https://images.genius.com/40e3a5c128f6db9b27cebe6606882165.1000x1000x1.jpg"}], "artist": "J. Cole"}