{"songs": [{"title": "Because the internet Screenplay - Part 4", "album": "because the internet Screenplay", "year": null, "lyrics": "RAP GENIUS NOTE: This is Part 4 of the script, read Parts 1-3 if you have not already\n[VISUAL PLAYING \"DEATH BY NUMBERS\"]\n\n*******[PLAY SONG \"FLIGHT OF THE NAVIGATOR\" AT THIS POINT]*******\n\nINT. HOSPITAL - DAY\n\n[VISUAL]\n\nThe Boy wakes up. He's in a gown. His eyes feel heavy. The TV is on in his room. \"Golden Girls\" to be specific. One of the ladies just said something funny cause there's a lot of laughter\n\nSitcom laughs always freaked him out. Because most of those people are dead. Those are ghost laughs. Laughs that are supposed to be gone forever linger on earth after every mid 90s joke about teenage sex or someone saying \"don't go there\". Looking for their mouths, never finding them because they're gone. The laughs don't feel good because they're dead laughs. Those laughs aren't what they stood for anymore. They've been reappropriated. Now they're just sounds monkey descendants make when amused to cue other monkey descendants when to make the sounds at home\n\n...my eyes feel heavy\n\nA nurse comes in\n\n       WHITE GUY NURSE: Hello Mr.[EDIT]. How are you feeling?\n       THE BOY: Like I'm about to get talked to by someone about- (gestures) All this\n\nNurse gives a \"yep\" look\n\n       WHITE GUY NURSE: You're friends brought you in-\n       THE BOY: They're not my friends\n       WHITE GUY NURSE: I don't think they'd like you saying that\n       THE BOY: Doesn't matter. It's the truth. But also, they know. We're not friends. There's a mutual benefit to our relationship, but I can't trust them for shit\n       WHITE GUY NURSE: Then why save you?\n       THE BOY: Cause their lives are far easier with me around. It's survival\n       WHITE GUY NURSE: I think you should talk to someone\n       THE BOY: We're talking\n       WHITE GUY NURSE: A professional\n       THE BOY: Why? You don't care. You're not gonna make sure I do. (then) Our lives aren't precious, man\n\nSilence. The Nurse begins to clean up\n\n       WHITE GUY NURSE: You done?\n       THE BOY: I was trying to be\n       WHITE GUY NURSE: No you weren't. Cause, guess what? It's not hard to do\n\nNurse leaves\n\nINT. WAITING ROOM - LATER THAT DAY\nThe Boy walks out of the double doors. Steve, Swank, and Fam are sitting there. They look up wearily\n\n       THE BOY: I don't wanna talk. Let's just go be awkward and quiet together at Chipotle. Alright?\n\nThey all just stare. Swank gets up slowly and walks over\n\n       SWANK: Man...we didn't know if we should wait or tell you later, man\n\nThe Boy makes a [\"WHAT?\" EMOJI] face\n\n       SWANK (CONT'D): Man...your pops died, man. Got the call\n\nSilence\n\n       THE BOY: Okay\n\n(hum of a jet engine...)\n\n*******[PLAY SONG \"ZEALOTS OF STOCKHOLM\" AT THIS POINT]*******\n\nINT. JET PLANE - EVENING\nThe Boy lays his head against the plane window, the oil from his hair leaving grease smudges all over the window\nHis father died in Stockholm. A family member was needed. Didn't realize that they were each other's only family til this very moment. When you lose that, you basically lose most of your memories, at least the accuracy of your own memories\nHe wanted to be cremated\nThe Boy didn't really know anyone in Stockholm, but he also didn't want to be in his hotel room with his father for a day. Even if he was just ashes. So he decided to search through his followers for someone from Sweden\n\nSome girl named \"Hello_Pity_\" Dm'd him back and they were supposed to meet up after all the whatever he had to do. Her profile bio said she was half french. She looked pretty in her avi: an inverted Hello Kitty. But that really doesn't mean anything at all, especially since her instagram was blocked, which is something he's learned not to trust at all\nSo he looked through her tweets, figured out a night she went to a club, used one of his dummy profiles and pretended that they'd met at the club that night. She had trouble remembering because, according to her feed, she was \"fuckin turnt, [CRAZY TONGUE OUT EMOJI] lol\". She added this made up dude as a friend on Facebook. Now The Boy could see her pictures\nThe rest of her pictures confirmed she was indeed pretty\nThis girl loves Justin Bieber though. New Justin Bieber. The \"fuck you\" Bieber. She loves Justin Bieber in the way you love that girl on Maury who's like \"my favorite flavor popsicle is DICK!\", which is close to sincere love, but nowhere near it at the same time\n\nINT. STRANGE OFFICE - NIGHT\nThe Boy is sitting at a desk, across from a solemn man. An urn sits on the left side of the desk\nThe man slides it over to The Boy\n\n       SOLEMN MAN: I'm sorry for your loss\n\nSilence. Don't you have to ask someone before you cremate their father? I don't know how these things work\n\n       SOLEMN MAN (CONT'D): These were found with him\n\nHe gives The Boy a large brown paper bag\n\nINT. HOTEL ROOM - NIGHT\nThe Boy vapes on the foot of his bed. He's DMing back and forth with \"Hello_Pity_\" whose real name is Alyssa\n\n       thegoldmolar: where u at\n       Hello_Pity_: bar called box. meet u here?\n       thegoldmolar: yeah\n       Hello_Pity_: u should meet my boyfriend. he loves you\n\nWeird\n\n       thegoldmolar: sure\n       Hello_Pity_: [CRYING LAUGH EMOJI] LOL. Don't worry. It's not like that\n       thegoldmolar: wdym\n       Hello_Pity_: [CRAZY TONGUE OUT EMOJI] see u soon\n\nHe puts his phone down\n\nEXT. STOCKHOLM STREETS - NIGHT\nThere's a buzz going on. Very pretty people walk hand in hand on the street. There are people saying things, giving opinions, feeling interesting. Everyone has a purpose tonight. It's a great time\nA couple walk by:\n\n       SUPER HANDSOME GUY: Swedish blah blah blah roscoe's wetsuit hahahaha!\n       SUPER PRETTY GIRL: blah blah, swedish blah blah roscoe's wetsuit!\n\nThe Boy walks up to a pink, glowing, but very discreet sign that says \"box\". There's a big bald guy standing outside with no hat. There's steam coming off his head\nA girl is standing outside smoking, at least trying to. She can't seem to get the cigarette lit. It's Alyssa\n\n       THE BOY: Hey\n       ALYSSA: Ah! It's you\n\nShe gives him a kiss on both cheeks\n\n       ALYSSA (CONT'D): Fancy meeting you like this, huh?\n       THE BOY: I don't know what you mean\n\nShe puts out her cigarette. After two big puffs\n\n       ALYSSA: Let's go\n       THE BOY: Didn't you want me to meet your boyfriend?\n       ALYSSA: Who? That guy?\n\nShe points to a corner of the building, a few steps from the front. A guy with long blonde hair (her boyfriend?)is making out with a girl in the cold\n\n       THE BOY: What am I getting into?\n       ALYSSA: Nothing. You're getting into nothing\n\nCUT TO:\nEXT. STOCKHOLM STREETS - CONTINUOUS\nThe Boy and Alyssa walk slowly through the streets. It's very cold, so they're the only ones doing that\n\n       ALYSSA: What made you DM me?\n       THE BOY: I don't know anyone here\n       ALYSSA: Then why are you here?\n       THE BOY: My dad died. I have to pick him up\n       ALYSSA: R O U G H. How?\n       THE BOY: Doesn't matter at this point\n       ALYSSA: I know right? It's always \"how'd he die?\" Like if you know all the ways, you'll avoid it. Silly\n\nShe shivers\n\n       ALYSSA (CONT'D): I don't believe in small talk. What's the longest relationship you've been in?\n       THE BOY: Five years\n       ALYSSA: Wow. What happened?\n       THE BOY: I'm still in it\n       ALYSSA: Oh?\n       THE BOY: She does private web shows. We're not together. But it's a relationship, for sure\n       ALYSSA: I don't get it\n       THE BOY: I used to watch her online a while back. Then she quit and started doing private shows. Then it just started turning into talking. Mostly\n       ALYSSA: Wooooaah\n       THE BOY: Wha?\n       ALYSSA: You're paying her to be your girlfriend or friend or whatever\n       THE BOY: Yes. But most people are paying for friends one way or another\n       ALYSSA: No\n       THE BOY: Your boyfriend is making out with another girl right now. You don't really have room to judge\n       ALYSSA: I trust that I can never trust him. We're clear on that\n       THE BOY: Then why have him at all?\n       ALYSSA: Because he's honest. And I like that. He doesn't lie to either of us. That's special to me\n\nINT. HOTEL ROOM - NIGHT\n\n[VISUAL]\nThe two are sitting on the bed staring at the urn on the table\n\n       ALYSSA: So that's your dad\n       THE BOY: That's my dad. That's what's left of him\n       ALYSSA: You guys close?\n       THE BOY: No\n       ALYSSA: You wanna talk about it\n       THE BOY: No\n\nSilence\n\n       THE BOY (CONT'D): I'm going to make a drink\n       ALYSSA: Alright\n\nThe Boy gets up and goes into the living room. While he's in there, Alyssa gets up, takes the urn, and walks out of the room. The Boy hears the door slam\n\n       THE BOY: Alyssa?\n\nCUT TO:\n\n*******[PLAY SONG \"URN\" AT THIS POINT]*******\n\nEXT. HOTEL - NIGHT\nThe Boy runs out of the front doors. His breath, clouding in the night. He looks both ways and catches Alyssa turning a corner. He runs to the corner and meets her on the other side\n\n       THE BOY: What's going on\n       ALYSSA: Let's get rid of it. It's just bad for you\n       THE BOY: You have a TON of nerve judging me and my father's relationship, so much so, you just walk out with his ashes? I feel like what you're doing is against the law, but much like the fact he was cremated before I arrived, I don't know if it's illegal. I'm still pissed though\n       ALYSSA: We're gonna do this together\n\nThe Boy is pissed. He's trying not to blow up\n\n       ALYSSA (CONT'D): I had a sister. I did this when she died\n       THE BOY: Yes. That gives you the right\n\nAlyssa digs in her pocket and pulls out her phone. She turns it on and the background is Alyssa and a girl that looks exactly like her. The Boy takes the phone\n\n       THE BOY (CONT'D): Twins\n       ALYSSA: Yes\n       THE BOY: I know we agreed that it's dumb to ask since we're all headed that way anyway, but-\n       ALYSSA: Brain cancer. It was bad\n\nSilence\n\n       ALYSSA (CONT'D): So crazy\n\nShe LOLs. They're still walking this entire time. They stop at the water. They stand there making small clouds for a moment\n\n       ALYSSA (CONT'D): You want to say something?\n\nThe Boy shrugs\n\n       ALYSSA (CONT'D): Alright-\n       THE BOY: Wait\n\nThe urn almost tips over the edge. She waits for him. He walks over and takes the urn and just holds it for a moment. Then he kinda hugs it. Laying his head on it, but turning his head so she can't see what he says:\n\n       THE BOY (CONT'D, whisper): I'm sorry we're alone\n\n[VISUAL]\n\nHe pours out the ashes. He's gone\n\n       ALYSSA: How do you feel? Better?\n       THE BOY: I feel...the same\n       VOICE: HEY!\n\nAlyssa and The Boy turn around. It's Alyssa's boyfriend\n\n       BOYFRIEND: What the fuck, bro?\n       ALYSSA: Oh, so you now you give a fuck\n\nShe pushes him back as he takes swipes at The Boy. The Boy is mildly annoyed. They're all yelling at each other\n\n       BOYFRIEND/THE BOY/ALYSSA: You're dead ass-hole!/ Relax, nothing happened/ Would you stop!\n\nThe boyfriend breaks free from her\n\n       BOYFRIEND: Do you know who the fuck I am?\n\n       ALYSSA: Please don't. Please don't do this\n       THE BOY: Nah, man. I don't know who you are\n       BOYFRIEND (CONT'D, scream): WHAT DOES THE FOX SAY! (silence) I. Wrote. That. That's my shit. I'm the nigga dressed like a fox. That's all me\n       THE BOY: What?\n\nThe boyfriend starts making the noises a fox makes in the song\n\n       BOYFRIEND: That!\n       ALYSSA (resigned, to The Boy): Like the song and video\n       THE BOY: I've never heard of it\n       ALYSSA AND BOYFIREND: What/wha?\n       ALYSSA: I thought you \"were the internet\"?\n       THE BOY: That's a tagline. No one is the actual internet. I just must've missed it when it was popular\n       BOYFRIEND: Uh, by \"when it was popular\" do you mean, uhhh, RIGHT THE FUCK NOW?!\n       THE BOY: Relax\n       BOYFRIEND: Two hundred and twenty million views on Youtube. Two hundred and twenty million. That's most of the earth\n       THE BOY: Not true\n       BOYFRIEND: An African village wrote to me-\n       THE BOY: The whole village did?\n       BOYFRIEND: -and told me that my song taught them about foxes. They don't have foxes there. I introduced the idea of a fox to an entire continent...(then) And you wanna fuck my girl?\n\nSilence\n\n       THE BOY: I do not wanna fuck your girl. I don't want to be here. I am going home now\n\nThe Boy walks away. Alyssa and her boyfriend start a boring argument in the cold as he disappears\n\nCUT TO:\nINT. LA VEGAN RESTAURANT - NIGHT\nFam, another girl, and The Boy sit in a booth at the restaurant. Fam and the girl are talking. The Boy is silent. Don't know if he's just bored or jet lagged from Sweden. Either way he's bumming everyone out\n\n       ANOTHER GIRL: My friend should be here soon\n\nThe Boy doesn't say anything. Fam and the girl look on\nA girl walks up to the table. The Boy looks up. It's the girl from the party\n\n       NAOMI: Hi\n\nThe Boy doesn't say anything\n\n       ANOTHER GIRL: This is Naomi. (then) Hello?\n       FAM: He's dumb. You should just sit and ignore him\n\nShe sits down\n\n       NAOMI: You're the guy that almost hit my arm\n       THE BOY: Yes\n       NAOMI: You guys order?\n       THE BOY: No. I hate vegan. I think she's making us eat here\n       NAOMI: I'm the vegan. I asked to eat here\n\nSilence\n\n       THE BOY: I hate vegan\n       NAOMI (saying it dumb): Duhh, \"I hate vegan\"\n\nIn his head, he was lol-ing. In real life, he just kinda looked down\n\n       NAOMI (CONT'D): What's the deal. Why you always act like your parents died\n\nThe Boy smirks\n\n       THE BOY: They did\n\nAwkward. Silence\n\n       ANOTHER GIRL: I'm so sorry\n\nFam and The Boy stare at each other for a moment. Then laugh. Another Girl and Naomi do not\n\n       FAM (to The Boy): Your parents are dead, man\n       THE BOY: My parents are dead yo\n\nThey slowly stop laughing. Naomi thinks The Boy is weird. But she doesn't run\n\nINT. MANSION - NIGHT\nFam and Another Girl are sitting on the swings smoking and talking about something they will never remember and don't really care about\nNaomi and The Boy sit in the living room\n\n       NAOMI: What did he do?\n       THE BOY: I don't know\n       NAOMI: How'd he afford all this?\n       THE BOY: I don't know\n       NAOMI: Then how can you afford all this? He leave you a lot?\n       THE BOY: Creditors were after him. I don't know if he had anything left. I'm not concerned. (serious) I'm gonna sell drugs\n\nNaomi LMAOs\n\n       NAOMI: Whaaaaaat\n       THE BOY: Fam can hook me up. I've been watching him for a minute. He runs out of here already\n       NAOMI: I don't think you need me to tell you you're an awful dealer\n       THE BOY: How would you even know?\n       NAOMI: You make everything feel awkward. You can't connect with anyone. How is anyone supposed to feel like they can trust you?\n       THE BOY: Yeah, that's what drug dealers are known for. Their comfort\n       NAOMI: They are, dumb-ass. You gotta know how people work. You're only good with people online\n\nHe slowly turns to her. \"how does she know that?\"\n\n       NAOMI (CONT'D): I looked you up\n       THE BOY: After the party or just now\n       NAOMI: Just now. I'm a writer too\n       THE BOY: Oh really\n       NAOMI: Yup. And I know I'm good cause people keep stealing my shit\n\nShe hits the vape\n\n       NAOMI (CONT'D): I tweeted this. (holds up her phone) Is that not my poem verbatim? I posted them together. This nigga just rapped this like it was his\n       THE BOY (looking at her phone): Your first mistake is being a poet past the year 1974, by the way\n       NAOMI: That's how good my shit is. I'm bringing the whole form back\n       THE BOY: You're cocky when you're high\n       NAOMI: No. I'm talkative when I'm high. I'm cocky all the time, but I'm silent for most of it...like you\n\nHe looks up. She lifts an eyebrow. He doesn't smile. She goes cross-eyed. No response. She stops, then sighs\n\n       NAOMI (CONT'D): You ever think we're in hell? This is all hell. Living on earth and being the only ones aware that it's all ending slowly\n\nSilence\n\n       THE BOY: No\n       NAOMI: I read something that said more than likely we all just do this all again. It's all a cycle\n       THE BOY: I like that theory\n       NAOMI: Yeah. (then) See? You're not such a lonely boy\n\nShe LOLs and mushes his face with her hand. The Boy smh, but smiles\nRAP GENIUS NOTE: This is the end of Part 4, continue on at Part 5", "image": "https://images.genius.com/85529bbeef5d1dc890a832d5d3953daa.600x600x1.jpg"}], "artist": "Childish Gambino"}