{"songs": [{"title": "Bridge Boys", "album": "Meth Lab Season 2: The Lithium", "year": "2018-12-14", "lyrics": "[Intro: Method Man]\nRockness, what up?\nRon Browz, what up?\nStaten Island, what up?\nHanz, what up?\nApple, what up?\nTime to go in, hah\nCh'yeah\n\n[Verse 1: Method Man]\nFeel the tension when I walk into a room\nWatch your step and watch your tone, boy, you talkin' to a goon\nBeen a problem since them oldheads was snortin' off the spoon\nHalf you rappers gettin' short bread and offered Lorna Doones\nPut a ratchet on your forehead, I'm talkin' to baboons\nI remain a Major Payne if you ain't part of my platoons\nI'm a warhead, you know, big explosion with the 'shroom\nIt's the sandman, they hopin' I dont show up with the broom\nThat's a sweeper\nThey knockin' at your door, that's the reaper\nWith lead arms all around your head, that's a sleeper\nRappers paranoid, that's the reefer\nI mean if she a bad broad and let you raw dog, that's a keeper\nMy sisters, they don't rock with my dad, my moms either\nNow I'm here with Rock, I'ma dad with mom's features\nIronic, I never make a threat that I couldn't promise\nBe honest, I'm dope and I ain't never spoke ebonics\n\n[Chorus: Kash Verrazano]\nThe players might change but the game don't stop (Woo)\nTryna move some 'caine, get it Range or a drop\nForbes sayin' I made it (Sayin' I made it)\nBut tell 'em I'm hood famous (But tell 'em I'm hood famous)\nThe players might change but the game don't stop (Woo)\nTryna move some 'caine, get it Range or a drop\nOne more blunt 'cause I'm faded (Blunt 'cause I'm faded)\nJust for the niggas that hate it (Niggas that hate it)\n\n[Verse 2: Rock]\n1010 WINS, hindsight's 20/20\nThirty-thirty up in 40/40, light somethin' ugly\nIt's a fifty-fifty chance niggas gon' die over nothin'\nGet hit, sit calm, nigga, try somethin' funny\nRoad warrior, Musa almost got locked up abroad\nHeard you snitchin' on bitches, dude, you locked up a broad\nMaybe Jamaican fakin' but you would not, no reward\nClass by myself but I am not no schoolboy\nI'm not a mama's boy but I am my mama's boy\nFor her, I would gladly go nuts, that's my Almond Joy\nI ain't no boy scout but your boy scout your boy like a scout and report\nPut one in your boy's scalp (Boom)\nMeth'll manhandle your man and you\nI ain't even gon' let him do that, bo-blap, blam dude\nDon't get your hands dirty, son\nSon gon' do his whole fam dirty\nWord to P and Dirty\n\n[Chorus: Kash Verrazano]\nThe players might change but the game don't stop (Woo)\nTryna move some 'caine, get it Range or a drop\nForbes sayin' I made it (Sayin' I made it)\nBut tell 'em I'm hood famous (But tell 'em I'm hood famous)\nThe players might change but the game don't stop (Woo)\nTryna move some 'caine, get it Range or a drop\nOne more blunt 'cause I'm faded (Blunt 'cause I'm faded)\nJust for the niggas that hate it (For the niggas that hate it, yeah)", "image": "https://images.genius.com/ed8b9d6333cc29967da88416db3514c8.1000x1000x1.jpg"}], "artist": "Method Man"}