{"songs": [{"title": "All Night (Louis The Child Remix)", "album": null, "year": "2017-01-01", "lyrics": "[Chorus: Knox Fortune]\nAll night, I been drinking all night\nI been drinking all night, I been drinking, ay ay\nAll night, I been drinking all night\nI been drinking all night, I been drinking, hey\nAll night, I been drinking all night\nI been drinking all night, I been drinking, ay ay\n\n[Verse 1: Chance The Rapper]\nEverybody outside, everybody outside\nWhen I pull up outside, all night, no\nEverybody high five, everybody wanna smile\nEverybody wanna lie, that's nice, no\nOh, now you wanna chill, oh, now you wanna build\nOh, now you got the bill, that's cool though\nOh, now you got the gas, oh, now you wanna laugh\nOh, now you need a cab, that's true though\nAll you do is talk, I ain't got shit to say\nCan't no one get in my car, I don't even valet\nLong discussions, oh, you my cousin?!\nNo you wasn't, you just wanna ride!\nYou just wanna talk about politics, Chicago shit and rocket ships\n(You just wanna, you just wanna, you just wanna, you just wanna, you just wanna, you just wanna)\nShut up! Start dancing, hoe!\n\nStart dancing, hoe\nStart dancing, hoe\n\n[Chorus: Knox Fortune]\nAll night, I been drinking all night\nI been drinking all night, I been drinking, ay ay...\n\n[Verse 2: Chance The Rapper]\nYou just went and spilt fries in the seat\nIt's fried on the seat, come ride on the seat, ay\nLast girl, she'll lie on the seat, she'll fart on the seat\nNow she jog in the streets, say\nI don't trust no one faking like a fan, asking for a pic\nYou should use your phone, call a Uber\nYou a goofy if you think I don't know you need a lyft\nIs you is or is you ain't got gas money\nNo IOU's or debit cards, I need cash money\nSo back up, back up, I need space\nNow, I need you to slow down, it's not a race\nNow I can't really hear what you gotta say now\nShut up! Start dancing, ho\n\n[Chorus: Knox Fortune]\nAll night, I been drinking all night\nI been drinking all night, I been drinking, ay ay\nAll night, I been drinking all night\nI been drinking all night, I been drinking, hey\nAll night, I been drinking all night\nI been drinking all night, I been drinking, ay ay...", "image": "https://images.genius.com/3f3d9b0ab0702dfa84a55de9dd6ba0dd.960x960x1.jpg"}], "artist": "Chance the Rapper"}