{"songs": [{"title": "Industry", "album": "Def Poetry Jam", "year": null, "lyrics": "[Intro]\nYea, (another gutter...) you know we had to do it this time baby! Nah-mean?\nMy nigga D, we walk through the motherfucking' doors\nOf the industry together baby! Nah-mean? (Gots to tell the truth)\nYou gave that shit dog, Ya know what I'm sayin?\nMe like yo, go hard on these niggas baby, Nah-mean? (Gots to tell the truth)\nGo hard just let niggas know\nWhat the fuck is really going on\nNow that's what the fuck I did! Aight!\nArf, Arf. What!\n\n[Verse 1]\nThe industry; man its not the same\nThe industry; its not a fucking game\nThe industry; real niggas is dying to get in\nThe industry; just define they don't fit in\nThe industry; ain't what it used to be\nThe industry; trying to control the way you MC\nThey want you to dress like that this and talk like that\nBut I'm gon' dress like this and talk with the bat\nThe industry; got y'all word meaning nothing\nThe industry; fuck what you heard cause he's bluffing\nThe industry; money, bitches, hate\nBut I dare you to try to take a fucking thing off my plate\nThe industry like \"Wait!\", but in the streets we like \"Get 'em\"\nSeventeen up in that thing, catch 'em sleeping and hit 'em\nAnd Ima pop whoever with 'em, the coroner is coming to get 'em\nIndustry niggas, so that's how I did 'em\n\n[Hook]\nThe industry; mad niggas is full of shit\nThe industry; mad niggas is sucking dick\nThe industry; bitches keep thinking its a game\nThe industry; don't mention my fucking name\nThe industry; mad niggas is full of shit\nThe industry; mad niggas is sucking dick\nThe industry; bitches keep thinking its a game\nThe industry; don't mention my fucking name, nigga\n\n[Verse 2]\nThe Industry; if you ain't got a strong mind\nThe industry; will break you down its a matter of time\nThe industry; vultures with nothing to feast on\nThe industry; see me I'm getting my beast on\nThe industry; staying in the dirt, playing in the dirt\nTouch the wrong one in the industry and you will get hurt\nI'm not an industry artist, I'm an artist in the industry\nThat's why I do what the fuck I want, cause nobody can finish me\nThe industry; wanted dead or alive\nNew artist to sell they souls, the way they survive\nThe industry don't give a fuck about you\nBut the industry couldn't make a dime without you\nThe industry; I'm sick of this industry shit\nThe industry; playing you like a industry bitch\nThey try to finish me quick but I am long, so I stand strong\nFuck a beat, listen to the words of the damn song\n\n[Hook]\n\n[Outro (over hook)]\nUh huh, uh huh, uh huh (2X)\nShit is crazy yo\nThey loaning you money to make a album\nYou pay 'em back the money, they still on the album\nWhat part of the game is that? (I tell you the truth, I don't lie)\nYou write your own shit, but they hold on to your shit\nWhat part of the game is that?\n(I don't try to hurt nobody, I mind my business)\nYou know what, the average nigga makes like\n(All these industry niggas could suck a fucking dick!!)\nTwenty-six cents over a motherfucking record\nWe need a motherfucking union baby!!!\n\n__________________________________________________________\n\n[Outro from performance on Def Poetry Jam]\n\nOften, my words fall on deaf ears\nMotherfuckers be listenin' but don't hear\nTalkin' to 'em and they be sittin' right here\nI be like \"Where you goin'!?\", nigga be like \"Yeah\"", "image": "https://images.genius.com/2ba45279dc14611f186ea61531cb027f.331x331x1.jpg"}], "artist": "DMX"}