{"songs": [{"title": "MMG The World Is Ours", "album": "Rich Forever", "year": "2012-01-06", "lyrics": "[Chorus: Pharrell]\nHere we are\nThe world is ours\nFrom the block to boulevards\nThe rain is gone\nThe rain is gone\nThe rain is gone\nFrom the block to boulevards\nThe rain is gone\nThe rain...\n\n[Interlude: Rick Ross]\nThis shit make me feel a certain kind of way\nThis shit feel good\nThis shit feel like... some Carol City shit right here\nMy nigga Peanut rest in peace\nSee you would felt this right here\nI'm on my Convertible Burt shit...\n\n[Verse 1: Rick Ross]\nI'm feelin' myself, hope you feelin' me too\nGod forgives and I don't, unforgettable dude\nI'm ballin' my nigga, and that's word to your mama\nI want you to ride, definition of honor\nHonor thy brother, but murder these hoes\nAlways pay your taxes, never pay these hoes\nAlways making moves, I didn't make the rules\nI'm just making ends meet with this plate of food\nWent from Spaghetti-O's to a new set of Vogues\nBack to square one, we still was selling those\nMy Tribe Called Quest, shit was nice dogg\nGucci was Q-Tip, I was Phife Dawg\nOn the world tours with all the wrong whores\nHad the right ideas, and all the wrong stores\nTiming is everything, rhyming is everything\nGeechi Liberace, put diamonds in everything\n\n[Chorus: Pharrell]\nHere we are\nThe world is ours\nFrom the block to boulevards\nThe rain is gone\nThe rain\n\n[Interlude: Pharrell]\nYeah man, ya heard?\nI rock Chanel nigga, yeah, Skateboard, heh\n\n[Verse 2: Pharrell]\nThey say \"Skateboard, you racist\nYou only hang with white Cubans\"\nNonsense, that's the necklace nigga, the light's moving\nThis is jewelry, that shit is foolery\nFrozen water on my neck nigga, who cool as me?\nUp in mansion like the black Kurt Cobain\nMy nigga Ross said he's the boss, 'cause he works cocaine\nAnd under no certain circumstances\nWill the facets of the diamonds not be disrespectful\nAnd hurt your chain, and your feelings\nYeah they villains but I'm chilling, I'm still a N.E.R.D\nMillions and millions and millions off of verbs\nWell my niggas be stealing and killing and thrilling for the birds\nMaking deals, squeezing the life out of them Nextel chirps\nI'm on my iPhone (uhh)\nBitches put their naked pictures on my iPad\nThe doors go up and I gone\nBlack boy scoring his life, I'm scoring the Oscars (I'm really am, nigga)\nRemember I used to want a Pasha and eat some lobster\nBut now I eat the apple with my A-P\nYour life and your wrist got the wrong timing, you hate me\nSays the little boy that loves you, who had the ashy feet\nNow I wear that ashy white suit out in Fashion Week\nWhere the upper-classes meet, that's just me\n...I smash the beat\n\n[Chorus: Pharrell]\nHere we are\nThe world is ours\nFrom the block to boulevards\nThe rain is gone\nThe rain\n\n[Verse 3: Meek Mill]\nUhh, dedication to motivation, gave 'em motives to hate me\nOld homies betrayed me, running around saying they made me\nBut when I had a quarter, they had, four and the baby\nIt was a whole different story, but fuck them niggas is shady\nNow I'm self-made, self-paid, and I give myself a raise\nWhole circle shining nigga, never had no selfish ways\nNever had nobody tell me 'go and get it' tell me 'save'\nHad to learn on my own, ask my Mama I was gone\nPuffing purple getting stoned, trying to take the pain away\nNow its Rolls Royces, umbrellas for a rainy day\nOld heads told me \"young fella, this ain't the game to play!\"\nHad to take the chance, told the dealer, \"deal my hand\"\nAnd now that nigga's getting murdered, shit is getting scary\nI put mirror tint all in the Ghost, I'm screaming Bloody Mary\nNigga Bloody Mary, Bloody Mary, Bloody Mary\nLet 'em cross the line of scrimmage, they get fucking buried\nThey had me cutting through that field just like a rushing Barry\nSlammers play with hammers\nHad them birds but we don't fuck with Larry\nI was just trying to ball, ducking D's and grinding raw\nBut now I pull up in that thing\nThem niggas gon' need some Tylenol, I'm gone!\n\n[Chorus: Pharrell]\nHere we are\nThe world is ours\nFrom the block to boulevards\nThe rain is gone\nThe rain\n\n[Verse 4: Stalley]\nI'm staring at my notepad like goodbye to my broke past\nWords full of money, use dollar signs as my periods\nI'm gettin money - period!\nThey said I got a old soul and I'm rich nigga spirited\nSo one time for the old-timers and two for the new school\nThree for my Geechi niggas with big Rollies in that new coupe\nBlowing on loud, sipping on that dirty juice\nWith a tre deuce living life like they ain't made loot\n'Cause what's here today could be gone tomorrow\nSo I'ma get it myself\nI ain't known to ball make sure my kids is straight\nIn case I'm gone tomorrow\nYoung Bonaparte, I'm noble dog like Drew Ali\nDark shades like Kool Moe Dee, cool fly nigga is who I be\nBig chain with a bigger charm\nLeave with a bad chick under my arm\nUhh! Geechi Liberace\nDiamonds on everything, even my posse\n(Diamonds on everything, even my posse)\n\n[Chorus: Pharrell]\nHere we are\nThe world is ours\nFrom the block to boulevards\nThe rain is gone\nThe rain is gone\nThe rain is gone\nFrom the block to boulevards\nThe rain is gone\nThe rain...", "image": "https://images.genius.com/5903bd99ee5e7d63a99dda93648f4272.1000x1000x1.jpg"}], "artist": "Rick Ross"}