{"songs": [{"title": "Hero vs. Villain (Epilogue)", "album": "Operation: Doomsday.", "year": "1999-04-20", "lyrics": "[Intro]\n\"And that ended Doom's plans for world destruction!\"\n\"And how did you manage to stop him?\"\n\"Simple, I [..] rearranged the circuits\"\n\"Once he threw the switch\" {*bang*}\n\"My ability to attack is faster than the cobra...\" {*dialogue fades*}\n\"Very helpful.\"\n\"And I will be careful, not to make the same mistakes as Doom!\"\n\n[Verse: E. Mason]\nWhat's the hero, who's the villain?\nDead or livin, killed or killin, who the fuck should remain chillin?\n(Doom) Webster says, wicked and evil, but yo who's Webster?\nNihilation and outcast, equals freedom that's so fast\nCulture in chains, that be the rolls villain plays\nAll these are just metaphors, they describe symbols in folklore\nBut who knows why it's like this?\nHero? Hit or old miss? Maybe it's all good\nReally of God, but who should, determine the real\nEvil, what's the deal\nFools rush in, they don't know the yin, from the yang\nAnd are ashamed to deviate, or act sane\nFrom the norm, they are slaves, forced to conform\nTo really find your essence, take this as a lesson\nBreak away from the rest of them\nGet from the form ending, like the villain in the song\nFind truth, who determines wrong\nFrom right, without a fistfight\nDifferent from day than from night {Operation... Doomsday}\nIt's just a simple play on words\nDelete all these punks ass herbs\nWho's the hero, what's the villain?\nThe question still remains chillin\nListen to the music, try very hard to use it\nOpen up and research, and that's the end of this verse\nBut y'all niggas keep y'all minds open out there\n\n[Outro]\n\"So like fuck you, fuck the newspaper, fuck all that shit man!\"\n\"I'm leavin\" {\"Good evening\"}\n\"Yo why you want to be leaving man?\"\n\"Man don't worry about that sucker, yo man listen\"\n\"Yo I'm not gonna finish my piece man, not with this lady around man\"\n\"Yo what the fuck is this shit man?\"\n\"I don't like that shit man, I don't want no fuckin pictures taken of my shit man\"\n\"Yo relax!\"\n\"Nah man, that shit is fucked up man, that shit can get us busted over here man!\"\n\"Relax man it's for the paper\"\n\"NAH NAH I'm not gonna relax, I'm gettin the fuck out of here\"\n\"Look, we got a car! She's got a car parked right over there man!\"\n\"Let's get the fuck out of here!\"\n\"Well come on let's go then!\"\n\n\"Doom, wears body armor to conceal his own mangled form, right?\" \"Yeah\"\n\"So like fuck you\"\n\"Do yourself a favor.. do yourself.. trust me\"", "image": "https://images.genius.com/c0a80e3098696bdf600f54a76667c069.1000x1000x1.jpg"}], "artist": "MF DOOM"}