{"songs": [{"title": "Back to Sleep", "album": "Dedication 6: Reloaded", "year": "2018-01-26", "lyrics": "[Intro: Lil Wayne]\nBeep beep, beep beep, beep beeeeep\n\n[Verse: Lil Wayne]\nYeah, woke up to niggas sounding like me, damn\nI smoked one and went my ass right back to sleep, okay\nThese rappers need some law and order, Ice T, god damn\nThey can't touch you Tunechi, Poison Ivy, man\nI roll up, I'm smoking like some hot tea, yeah\nI woke up and couldn't believe I got sleep, damn\nYou woke up and then you try to live the dream\nBut before you check yourself, check my history\nI ain't never been a stormchaser, or just a fly on the wallpaper\nI ain't never been a tailgater, always been a bail-maker\nIf it heaven sent right now, she gon' give a nigga hell later\nIf you don't get the shit right now\nYou gon' love to hate the smell later\nI tell her hold up, your pictures don't entice me\nShe told me pull up, and then she heard a light screech, yeah\nI woke up with a white bitch under white sheets\nShe got a black heart, telling white lies through her white teeth\nBlack eyes from always tryna fight sleep\nRan into your wifey, she say, \"Tunechi, wife me\"\nHello, I'm so spicy, I got her sweating like Keith\nThough our time brief, she be on me like briefs\nEthika, Ethika, Ethika\nHeffanie calling me Hefner\nF-ing her all in her exiter\nIf he textin', I'm killing the messenger\nAll hail the death in America\nYour ex be hatin' like eczema\nThat nigga fake as a wrestler\nI poke him straight in his retina (Pssh)\nAnyway baby, I'm feeling ya\nFeel like I slipped and I fell in ya\nBut that nigga slipped and he fell for ya\nGotta be way more careful-er\nThese niggas no one to everyone\nThey play too much and never won\nHe got you a room at the Sheraton\nI can get you your own area\nHelluva, helluva, helluva\nGirl the way you be taking this D from me\nYou act like you spelling something\nMan this D put a spell on her\nI'm deadly as my cellular\nMy diamonds sing like Mahalia\nYou gotta make a name for yourself\nBut these niggas fake as an alias\nI don't see no comparison, no barbarians\nI am not a human being, and you a humanitarian\nI ain't trying to get booked again\nDon't fuck with no librarians\nFell asleep in her wet pussy\nI woke up in that aquarium, hold up\n\n[Hook: Lil Wayne]\nWoke up to niggas lookin' like me, damn\nThrow up and go my ass right back to sleep, ugh\nYou woke up connected to some IV's\nBeep beep, beep beep, beep beeeeep (That's some sick shit)\n(Bahh!) I'm a shooting star\nBut your bitch got me shooting porn, yeah\nI've been trying too hard\nWow, wow, I'm a shooting star, yeah\nGoing too far, yeah\nI've been trying too hard, yeah\nTo fuckin' hide these two horns, damn\n6-6-6\n\n[Outro: Lil Wayne]\nMy friendship with Mack Maine is far, far, far, far, far, far more than a friendship. That's my fuckin' brother. I've known Mack since the hood, Hollygrove. He had the biggest house in the hood, it was right on the corner. I'm not sure if the whole house was theirs but it was huge, and he had a big ol' basketball court on his backyard and everybody used to play ba-, ball in his backyard. And umm, since he lived on the corner, like, you can always go and chill and play basketball on his backyard and then, like, always be right there on the corner in case some shit pop off. So yeah, me and Mack been down since the hood. He went to a good school, I didn't go to a too good school but then we ended up goin' to the same school, the school is actually called Mack Maine, know what I mean, and then, umm, he got known for fuckin' over niggas freestylin'. You know I mean, you know, Mack is cold at ribbin', I don't know if y'all call that roastin' or what all that shit y'all call it, but uh, he cold at that, period. He could tear your ass up, make you cry, make you wan' kill him. That type of shit. He one of them nigga, you know what it is? Still be laughing overtime and actually have you laughing but still mad, that's one of them niggas. So yes, when you know how to do that don't Lord don't let you know how to rhyme and he knew how to rhyme, so he used to kill niggas on that shit so that's how we really jammed up with the music shit. Shout out my nigga Mack", "image": "https://images.genius.com/3622689a5172c789024942436b11dce2.800x800x1.jpg"}], "artist": "Lil Wayne"}