{"songs": [{"title": "5 Year Plan", "album": "The Big Day", "year": "2019-07-26", "lyrics": "[Verse 1: Chance the Rapper]\nYou gotta schedule vacations in your five-year plan\nYou gotta schedule celebrations in your five-year plan\nYou gon' have several revelations in your first five days\nIn your first five minutes, have your first five fans\nFor like 45 minutes, take your first shift break\nThere's no time for impatience in your five-year plan\nYou got time for hesitation in your five-year plan\nA lot of shit came at you in a five-year span\nIf you followed your flight plan, you'd be right here prayin'\nEyes closed, right now sayin', Lord of Lords\nI know you gave abundantly, even gave up your son for me\nNo need for sacrifice in my plans\nAnd I love to say your name, it come from my diaphragm\nI just had to scare 'em off and draw a line in the sand\nAnything you gave to me, they couldn't pry from my hands\nAnything you gave to me, I know it's right for my brand\nI know shortcuts cut short long runs\nI seen niggas on one try to wrong one\nGet drunk, sing the same song, Kung Jong Swon\nGiant mistakes on fee fi foenem\nProbably keep both, um, you got time for missteppin'\nTime for them weapons, form but not prosper\nTime for them lessons, time for them blessings\nTime for first, second, third, fourth impressions\nTime for reflection, time for confession\nTime will heal all, let's get a good stretch in\n\n[Chorus: Chance the Rapper]\nThings that's in the way of my goal\nThings that eat away at my heart\nThat's just, just the way of the art\nI know that I had a good start\nI wish I could play a guitar\nI, I  know that I'm gonna be\nBetter than I ever was\nI told 'em they gonna see\nI just want everybody ta\nLove, love, love\n\n[Interlude: Randy Newman]\nTime has, time has come\nTime has, time has come\nTo be who you are\nBe who you are\nTime has, time has come\nTime has come\nTo take it all in, take it all in\nTake it all in\nThe time has come\nTime has come, time has come\nKnow who you are\nKnow who you are\nThe time has come\nTime has come, time has come\nTo take it all in\n\n[Verse 2: Chance the Rapper]\nWho's that in the back of the back?\nYou deserve a plaque and a pat on the back\nI see y'all in your Seuss like the Cat in the Hat\nWith the clean black slacks and the jacket to match\nFound your way back like a Cadillac with the flats\nCame around like satellite, down like a battle axe\nWhy do you word insure me like it's Aflac?\nI don't know, why do birds Burt Bacharach?\nWhy do worms prefer habitats?\nWhy did it occur where it happened at?\nWhy ain't no apples in Apple Jacks?\nAre you ready for The Big Day?\nI don't know, but you're well on your way\n\n[Outro: Randy Newman]\nSomebody hurt you really bad\nAnd you don't know what to do\nAnd you think how so many people live through things like this\nSounds crazy but it's true\nYou can get over anything, almost\nI'm telling you the truth\nThe one thing left to say is...", "image": "https://images.genius.com/102754ce389c900531057dd11508c674.1000x1000x1.png"}], "artist": "Chance the Rapper"}