{"songs": [{"title": "Paperbond", "album": "O.N.I.F.C.", "year": "2012-12-04", "lyrics": "[Intro]\nYup, yeah yeah\nOh, hahahaha\nYup yup yup yup yup yup yup yup yup\nYup yup yup yup yup yup yup yup yup\nI got enough weed to last me for the rest of my motherfuckin' life\nAin't gon' ever run out\n\n[Verse 1]\nUh, get the cork out the bottle\nGet that money up and make your style a lil' harder to follow\nI've been hustlin' all the time, that's the only thing I know\nNow my watch is worth 30 thousand\nGot Cuban links and Italian\nBoy, I'm gettin' it\nRidin' in my ride, lookin' filthy rich\nKillin' these niggas, I ain't innocent, my bad\nAin't paid the cost, see they just watch me, then copy my swag\nSay I fell off, that's where you lost me\nHow's that when my name is in my upholstery?\nI'm rollin' up and goin' places across seas\nHopin' the neighbor don't smell the shit I bake\nAnd every day I'm on another plane\nI hardly sleep but hey\nI wouldn't have it any other way\n\n[Hook]\nNow here we are, now there we go\nYou holdin' on to it, we we smoke it all today\nNow here we are, now there we go, now there we go\nNow here we are\nI wake up and I bake up, get my things and catch a plane\nBut I'll be back again (Now there we go), back again (Now there we go)\nNow here we are\nI wake up and I bake up, get my things and catch a plane\nBut I'll be back again (Now there we go), back again (Now there we go)\n\n[Verse 2]\nUh, so much money that when I pull up\nHop out and walk in the bank, teller look at me funny\nKnow how much I get\nKnow I'm liable to walk up in this bitch\nLike Tony with big blue bags of this shit\nAnd tell 'em \"Count it up\"\nRidin' 'round in that Cali\nGot OG Kush in my body\nMy nigga, I keep it G and that's Gucci or that Gianni\nI'm gettin' dressed for the airport to pose for the paparazzi, huh?\nMo' money, mo' problems, not how I see, huh?\nMo' money, mo' Roberto Cavalli, bruh\nDamn, ain't it funny how time pass\nOnly nigga in first class\n\n[Hook]\nNow here we are, now there we go\nYou rollin' on to where we smoke it all today\nNow here we are, now there we go, now there we go\nNow here we are\nI wake up and I bake up, get my things and catch a plane", "image": "https://images.genius.com/33ab790859f8f1a0a8e408ee23962e6c.1000x1000x1.jpg"}], "artist": "Wiz Khalifa"}