{"songs": [{"title": "The Transporter", "album": null, "year": null, "lyrics": "One time for the niggas that’s huggin’ the block\nTwo times for the boys thats bubblin’ rock\nThree times for the G’s including myself\nFour times for the brothers that’s reachin’ the wealth\nFive times for the hustle I taught it myself\nTransporter I bought it myself/\nI bought it myself/\n\n[Verse 1: Rick Ross]\nNiggas major, tailored suits, the newest gators/\nGangsta, I’m muthafuckin’ Albert Anastasia/\nMichael Corleone, presidential Rolly on/\nNet worth unknown, closet full of Skull and Bones/\nSilver spurs come his and hers, just live and learn/\nSnipers on the roofs like troops, that’s for whom it concerns/\nApplaud the whores abroad, awaiting my return/\nRessurected like Makaveli, pray my soul burns/\nSole supplier for cocaine in Southern states/\nSending sack city to city, back in a couple days/\nDon’t get me started, I make triple in fickle markets\nMy profit margin’ll have all you local niggas starving\n\nOne time for the niggas who huggin’ the block/\nTwo times for the boys who bubblin’ rock/\nThree times for my borhters who reachin’ the wealth/\nFour times for the G’s including myself/\nThinking back when a nigga never had a quarter/\nMuch love for the bitches wearing something shorter/\nFive times for the trap, got a nigga ballin’/\nBut I gotta take my hat off to the Transporter/\n\n[Verse 2: Rick Ross]\nWhen I’m looking for a certain feeling, gotta hit her raw/\nLook up to my ceiling ladies, chandeliers galore/\nLook into my closet then you know I love couture/\nEven more, shoe collection too fly for the fucking floor/\nShelves, Louis V in jails/\nShoot the fucking stylist we gon’ find this shit ourselves/\nAudemar was designed by Swizz Beatz/\nBlack face, black band, orange stitching, it's a beast/\nTo say the least, I am extraordinaire/\nTransporter yeah I bought it, pistols in the air/\nSole supplier for cocaine in Southern states/\nSending sacks city to city, back in a couple days/\nDon’t get me started, I make triple in fickle markets/\nMy profit margin’ll have all these local niggas starving/\nI got them thangs, I’mma tell ya once/\nBetter have your money right, you won’t see me for months/\n\nOne time for the niggas who huggin’ the block/\nTwo times for them boys who bubblin’ rock/\nThree times for my borhters who reachin’ the wealth/\nFour times for the G’s including myself/\nThinking back when a nigga never had a quarter/\nMuch love for the bitches wearing something shorter/\nFive times for the trap, got a nigga ballin’/\nBut I gotta take my hat off to the Transporter/\n\n[Talking: Rick Ross]\nWhooooo!\nI love it when a plan comes together\nHow was your ride baby?\n\n[Talking: Female Drug Mule]\nIt was great daddy\n\n[Talking: Rick Ross]\nYeah…I like that\nLong as you like that\n\n[Talking: Female Drug Mule]\nI love it!\n\n[Talking: Rick Ross]\nTeamwork make the dream work\nYa feel me?\n\n[Talking: Female Drug Mule]\nFa sho\n\n[Talking: Rick Ross]\nI love you baby\n\n[Talking: Female Drug Mule]\nI love you dadddddy\n\n[Talking: Rick Ross]\nI love you babbbby!\n\n[Talking: Female Drug Mule]\nI love you dadddddy!\n\n[Talking: Rick Ross]\nWhooooo!\nWhooooo!", "image": "https://images.genius.com/3dce21029cdd8aab73eb473e015807d5.1000x1000x1.jpg"}], "artist": "Rick Ross"}