{"songs": [{"title": "Doh’ Doh’", "album": "Snoop Dogg Presents... Doggy Style Allstars Welcome To Tha House Vol. 1", "year": "2002-08-13", "lyrics": "(Chorus)\nDoh' Doh'(Doh')\nSmoking on that Doh' Doh'(Doh')\nMe and my niggas smoke Doh' Doh'(Doh' Doh')\nSmoking that Doh' Doh'\nSmoking on that Doh' Doh'(Doh')\nWe smoking that Doh' Doh'(Doh')\nMe and my niggas smoke Doh' Doh' (Doh' Doh')\nSmoking on that Doh' Doh' (Doggy Doh' Doh')\n\n(Snoop Dogg)\nHere we, here we go again\nYeah I'm 'bout to flow again\nMy shit at the record store\nGo ahead and blow it in, tell a friend\nAnd don't be afraid about it, brought a couple homies with me\nMan, forget about it\nFrom dawn to dusk to run with us\nYou must bust, cuss and fuss, now\nWow, how now thou\nThat nigga bow down to the new motherfucking sheriff in town\n\n(Soopafly)\nYou niggas better watch out\nCause Soopafly's the most anticipated talked about nigga that is not out\nFucking up your whole rep\nWith the Coast-step, got them bitches shook up\nThey just coming right to left\nI'mma shine when it comes down\nTo it, if it calls for that shit Soopa don't fuck around\nI'm something, else\nWith my bad self\nHot's the game, but cold is the breath\n\n(E. White)\nMost of the niggas on the block know what I'm talking about\nYou get, put on the set and ain't no walking about, shit\nWe shoot dice, skip school every day\nOh yeah that back gate is my smooth get away\nMy niggas Sherm'd out and high as fuck\nWell is you down to ride or what? Fuck it!\nHop off inside the bucket\nI need some heat nigga, run and tell\nCuz won't you let me know who got a gun for sale?\n\n(Snoop Dogg)\nShit, I'm trying to sell everything\nBang on any gang\nThat's the way the Chitty-bang\nEast-side Longbeach City thing\nGet it man, rich rollin' 20's gang\nYeah we getting gritty man\n\n(Chorus)\n\n(Soopafly)\nIf I'mma choose: ya'll lose\nWe just fucking up your program, giving ya'll the blues, I cruise!\nTried to keep up and blew a fuse\nBitches know the deal because they know the rules, get bruised\nI keep 'em paired up in twos\nIf they don't have my money: bare butt no shoes, dues\nDon't give me nothing but good news baby, right now\nDon't make me come down\n\n(Snoop Dogg)\nGoldie Loc' you got me high as a motherfucker\nBig-Snoop, blithe as a motherfucker\nI do the do, cause I'm about that peanut-butter\nMay-day, may-day\nBaby what you say that Take-take?\nA whole lot a, they got a pot of fetti'\nA nope notta, fo' shotta' Harlem Globetrotter\nEast-side rip rider\nI like to hide up insider her, then I light up\n\n(E. White)\nCheck it out:\nShit I really been to jail (really?)\nAnd I really sold dope (really?)\nAnd I really got a strike (really?)\nAnd I still can't vote\nBut I knuckle up with all you niggas\nShut the fuck, and nut up on that white boy that called you nigga\nWhy the fuck should I get patriotic?\nStop the war on the cops so we could talk about it?\nI probably might not make it through the night\nBut that alright with E. White\nCause I'm smokin' on that Doh' Doh'\n\n(Chorus)\n\n(Mr. Kane)\nWe smoke this bomb for you ca-rum-pum-pum-pum\nWe roll this dank for you ca-rum-pum-pum-pum\nNo sticks, no stems, no seeds ca-rum-pum-pum-pum\nWe puff on nothing but chron' like rum-pum-pum-pum\nDoh' rae me fah so la tee smoking on that Doh'!\n(mumbling)\nDoh' rae me fah so la tee smoking on that Doh'!\nIt's just the way that I can't help myself when it comes to this Mary-Jane\nIt's just the way that it makes me feel when it comes inside!\nComes inside! In my mind!\n\n\n(Inhale followed by coughing)", "image": "https://images.genius.com/b5bc4a34c4d389ec4f5e8cfa1460e41f.800x800x1.jpg"}], "artist": "Snoop Dogg"}