{"songs": [{"title": "Givenchy", "album": "Rich Gang: Tha Tour Pt. 1", "year": "2014-09-29", "lyrics": "[Intro: Birdman & (Young Thug)]\nThat Rich Gang lifestyle\nMarble floors, gold toilets and chandeliers\nBig money nigga take the jet\nL.A. hit the bity boolin’ in the bondo\nWith a few bitches and they go to trippin'\nDrankin’ that GTV, that tequila\nSmokin’ them stunna blunts (them big dawgs)\nNigga we never hungover\nPoppin’ bigger numbers with my niggas, straight B's only\nShout out to my love, my blood, my team\nMy gang, my family, and nigga ya know what we bleed\n(You know what we bleed) 404, 305, 504\nWhat’s poppin’, nigga? B-house of dank, put it in the air\nThis that YSL, Rich Gang,  RHQ, YMCMB shit\nBig B’s with a few C’s,  PeeWee, what’s poppin’, nigga?\nBankroll mafia; Hot Beezle, what’s brackin’, nigga?\nThe pussy outta line, the pussy get they head bust, ya dig?\nB-Loc and Bentley, y’all know the business\nIt’s B Slime or G5, rest in peace Tamara and Miss Gladys, boy\n(Ohh)\nRich Gang\n(Ohh)\nRich Gang\n\n[Chorus: Young Thug]\nGivenchy my toes and my bros and my hoes\nGivenchy my toes and my bros and my hoes, for sure, for sure\nGivenchy my toes and my bros and my hoes, for sure, for sure\nGivenchy my toes and my bros and my hoes\nAnd that is for sure, it's for sure\n\n[Post-Chorus: Young Thug]\nTell a nigga, would you ride for a nigga, baby?\nWould you die for a nigga, baby? Hey\nBaby girl, would you cry for your nigga, baby?\nWould you cry for your nigga, baby?\nAy, baby girl, what you know, what you know 'bout that?\nWhat you know 'bout that? You don’t know nothin'\nBaby girl, what you know 'bout that, 'bout that?\nWhat you know 'bout that? You don't know nothin'\n\n[Verse: Young Thug]\nShe don’t know it, she don’t know it\nWork comin' in any day or later, ayy\nEat her candy, Now and Later, way\nI ain’t through baby buying acres (Rich Gang)\n(Racks! Racks!) Almost done\nLemme put somethin inside of ya stomach\nLemme put sum’ right up under ya lungs\nBaby, I just wanna hit like Barry Bonds\nI know all you wanna do is have fun\nI put my heart inside yo pocket, you can't break it\nI told you I love you to death, never dissed you not once\nYou my twin, yeah you my twin, baby, let’s stay together\nYou know you can never ditch me, baby, you know better\nYou know I look at ya like gold, you my future trophy\nShe know she got my heart, she say do it, I jump like Tarzan\nDrugs don’t stop, you know I can’t stop\nBaby don’t press charges, she know that I’m on the block\nWhen she pull up, she can’t go back, she gon' stop, no\nShe ain’t know what time it was 'til I bought her first clock\nRolex, spend $1,000 on a flock, no Waka\nAnd you know I’m comin’ back like Dem Boyz, no Shop\nYeah, loading up a Glock\nTake shots, I got Jays on a flava, flava watch\nBillidybop, pull up shootin' buck shots (TOP NOTCH!)\nYeah, they watch me like a fuckin cable box\nBitches wanna fuck me and they also on my top\nMama told me never give tops outside the shop\nPull up on yo girl, I’m lurkin’ like a cop\nPussy nigga play, I beat them like I box\nHey, I'm the President, baby, blacker BARACK!\n30’s on the Chevy, my nigga, plus it's a box\nYou should know me and sharp shooters sponsored by FOX\nSplit that money up in eight ways like I’m an octopus\nOn the campus with lots of pounds, kicked outta COLLEGE!\nAll I bleed is red but nigga, but I'm not stoppin' shit (red light)\nPull up to the set and I come and pay all my homages\nHoppin' out on Bleveland, I pour up straight out the pharmacy\nPussy nigga scared to say it, I got 'em hummin' shit\nLil bitch, you know I’m really thuggin' like Bones & Harmony\n(Rich Gang) I can never... (be you)\nI’m an animal, you know I got stamina\nIf a nigga ever got robbed, bitch I’m the manager\nAnd I got an African with weed over on Campbelton\nLil momma don’t go, keep it stompin’, I want that cameltoe\nPull up to the set with them sticks and have us an ammo show\nLead through the front door with that tec, it's out the back door\nBags in this bitch, so many bags like where the racks go?\n\n[Chorus: Young Thug]\nGivenchy my toes and my bros and my hoes, for real\nDon't act like you don't know when you know that you know, for real\nEven when I'm laying down, baby, I'm keepin' it tucked, for real\nSwear to God, when you play with just one of these bullets, you kill\n\n[Post-Chorus: Young Thug]\nBaby girl, would you ride for your nigga?\nWould you ride for your nigga?\nWould you die for a nigga? Hey\nBaby girl, would you cry for your nigga?\nWould you die for your nigga?\nWould you ride for your nigga? Hey (Would you?)\nBaby girl, what you know, what you know 'bout that?\nWhat you know 'bout that? You don’t know nothin'\nBaby girl, what you know, what you know 'bout that?\nWhat you know 'bout that? What you know 'bout that?\n(Rich Gang)", "image": "https://images.genius.com/07e1a913522c1d895f518d7ebf9ad7f0.640x640x1.jpg"}], "artist": "Young Thug"}