{"songs": [{"title": "Star67", "album": "If You’re Reading This It’s Too Late", "year": "2015-02-13", "lyrics": "[Intro: Lil Wayne Sample]\n\"That's what they doin', Cam'ron\nThey actin' like these singers, man:\n\"I ain't goin' to the studio until I got a situation\nA subject, I need a beat, I need the producer\nWh-who gonna be on the hook?\"\nMan, what is you doin'?\nGo in the studio with fuckin' clips, clips, ammo!\"\n\n[Verse 1]\nBrand new Beretta, can't wait to let it go\nWalk up in my label like, where the check though?\nYeah, I said it—wouldn't dap you with the left, ho\nShut the fuck up, text from a centerfold, I ain't reply\nLet her know I read it though, voice mail say she ready though\nNiggas know I'm credible, ain't no pussy on a pedestal\nGot my foot on the 'cedes Benz pedal\nDoin' 90 on the bridge like, \"nigga you already know\"\nAnd if you don't know, then now you know, now you know\nSwitchin up the angles now I'm in the Rolls with illuminated angel\nFour, five chains, man the gold gettin' tangled\nMy nigga Biz said, \"the first mill gon' change you\"\nChange for the better, hit it then dead her\nThat's my vendetta, keep this shit together\nGoddamn, we ain't even gotta scam\nCocaine coupe, we ain't even got a scale\nUsed to flip apps, now that old plug murked\nAin't a damn thing changed, you can still get the work, ayy\n\n[Interlude]\nJust hold on one moment and someone will be right with you\n(We're sorry, you have reached a number that has been disconnected or is no longer in service)\n\n[Beat Switch]\n\n[Verse 2]\nYeah\nI remember I had went to Louis V with Haf'\nWatched them spread ten thousand dollars on the glass\nI never ever thought I'd see that in my life\nNow I'm in the East 'cause my boys are gettin' right, man\nI was on TV makin' fifty racks a year\nAfter helpin' mama out, the shit would disappear\nI am not a man, I can't do this on my own\nSo I started askin' them if they would put me on\nAnd they did put me on, yeah, they did put me on\nNow we in the basement and we workin' on the phone\nNow we in the basement and we workin' on the phone, line\nLine blowin' up, workin' on the phones\nNow we in the basement and we workin' on the phones\nBut I just couldn't do it, had to leave that shit alone, man\n\n[Interlude]\nHear what?\nYo hear what, tek time\n(Ha, ha, ha) Ahh, nuh shake\nYo hear what?\nWa gwan fry skull\nHim fried, him fried and a sleep awhile ago inna di van\nYou know Drizzy\n\n[Chorus]\nBlowin' up, line blowin' up, they need the whole thing\nBlowin' up, my niggas really need the whole thing\nBlowin' up, line blowin' up, they need the whole thing\nBlowin' up, my niggas really need the whole thing\n\n[Verse 3]\nI do better with the rider in my system\nOh yeah, I'm on deck, when you call me I'll listen\nI listen unless I been mixin', you know when I'm mixin'\nYou know when I'm mixin', I smoke when I drink, it's tradition\nLike Zoe mama I go hippy, peace sign in the air like I'm Nixon\nI'm mixin'—I am not Esco, but it was written\nI knew when they didn't\nI been had these visions of the life I'm livin' since I was Jimmy\nAll I had to do was just go and get it, and now we\n\n[Chorus]\nBlowin' up, line blowin' up, they need the whole thing\nBlowin' up, my niggas really need the whole thing", "image": "https://images.genius.com/bcf01db777c6e5c46eddb1031a2008d1.1000x1000x1.jpg"}], "artist": "Drake"}