{"songs": [{"title": "Who’s Ya Best MC?", "album": "Sucka Free", "year": "2008-04-12", "lyrics": "[Verse]\nYou know they say Nicki spit crazy, get it poppin' -\nLike, M eighties (80's), or twin tre eighties (80's)\nYoung Money First Lady,ya know, baby girl  -\nOf the group, I'm also known as baby girl, in the coupe\nNever get me confused, as Baby girl in the hoop\nCause, Nicki stay fly, like that Cash Money dude\nI'm stuntin' on these hoes, like Marilyn Monroe\nI got a S curl flow, I spit slick, ya know?\nAnd I don't just spit raps, and chit chat\nNicki could get it in, Nicki could spit gats\nYa girl got hustle, Nicki could pitch crack\nBut, Nicki rather chill, and stack a mil'\nWhile these hoes, stay in hoods like rats for real\nMy voice stay on tha track, like a Mac for real\nRiding the baseline like, 'Quille O'Neal\nGassed ya baby father, for the keys to the Escalade\nNot a baby momma, but I'm drama like, Kay Slate\nWhat can I say? That's how ya girl do\nYa girl stay fresh down, to tha cuticles\nMy people smoke dutches, we don't fluck with bamboo\nI'm a winner mami, ya career's a gamble\nOld ass broad, off track, like bad weaves\nNicki stay on her toes, on point, like ballerines\nLemme remind you, I'm gettin' a tan too\nYa caramel dream, ya girl from Queens\nThey say I'm too pretty, to be spittin' sixteens\nI should be on the screen, posin' for Maybelline\nOr be a Baby Phat girl, kitten on my jean\nHood star broad, Black Barbie Doll\nPardon me, if the cockiness, botherin' y'all\nI'm just bein' Nicki Minaj, ya know?\nGirl from around way, without the L Cool J\nMa' you spit Kool-Aid, I spit acid out\nDoin' this since, you was Reebok, Classic Doubt\nNow this ho, wanna get at Nic', why?\nCause I bagged her baby daddy, she ain't seen him since\nNic' so gutter, lil' white tee, need some Air Max on\nSome Dolce and Gabbana, pretty panties on\nLike, wait 'til the summer catch me, up in the hummer\nOn my way to 555 front, run with the Rucker\nAnd every baller wanna never, give out my number\nOnly that email, Cherry-thong.com, -\nHolla! Name a girl, as real as her\nNo, not them! Who's your best emcee?\nNic, Fox, and Kim, can't forget Rem'\nNic' up in the Porsche Box, or the Benz", "image": "https://images.genius.com/6723f478cff14a2ba2cbe0ce2ad7d4c2.320x320x1.jpg"}], "artist": "Nicki Minaj"}