{"songs": [{"title": "You Gon Go?", "album": "Keep Right", "year": null, "lyrics": "[Verse 1: KRS-One]\nI'm bringing back the style that others have pushed to the rear\nNow you see me, now you don't, now I'm everywhere\nMaybe you can see that knowledge does reign supreme\nRap is like a ballclub and I coach the team\nMove the crowd, that's what MC mean\nHow many albums I got? Mmmm...12, 13\nI've told y'all before\nYou are not just doin' hip-hop, you are hip-hop\nThem jokers need to stop, be hip-hop\nI mastered this and him, her, they, them, that one\nShe and he did not\nI speak a lot, I hit 'em in they weakest spot\nCome see me rock, yo, you'll leave in shock\nKRS, you ever wonder why he's so hot?\nIt's because he's not pop yo, he's hip-hop\nWest to East the sound of the police will rock\nIf you don't love this you won't have the heat I got\nDiscipline, if you're listenin, defeats the COPS\nFuck the dumb shit yo, we gotta teach the tots\nThey say I preach a lot\nAnd last year the took the jeep and shot\nBut this year the beat will knock\n\n[Hook x2: KRS-One]\nI know where\nWe can go\nTo see how a real MC flow\nNo video\nNo radio\nJust a live show\nC'mon now you gon' go?\n\n[Verse 2: KRS-One]\nI'm still standing, demanding playing my lex jammin'\nCats wanna really see me start blam-blammin'\nPut away the cannon for this overstandin'\nI'm landin'\nLet the music play like Shannon\nI'm so hot, why not, I bring all the fans in\nWatch me now come alive like Peter Frampton\nListen to me people, listen to me loud and clear\nIt's time I found out what type of people up in here\nWhen I shout out the classic if you know it say yeah\nSouth Bronx-Yeah!\nMy Philosophy-Yeah!\nBlack Cop-Yeah!\nYou Must Learn-Yeah!\nYeah we gonna do it up in here\nI'm still standin'\nAnd rappers be mad-mad\nCause they know they'll give birth like the American\nFlag in Baghdad\nAll they do is blab-blab, that head chatter\nWhy the dopest MC always a dead rapper?\nI'm a real live rapper, I'm out to set it\nI pay dues, while your crews still on credit\nYou talk that shit till I come out the school\nAnd all y'all sound like Trina sayin' \"That's Cool\"\nTime for the streets again\nTime for them cats to pop gats into the mic you speakin' in\nI'm creepin' in with a hundred soldiers\nWhen I step on the stage it's over\n\n[Hook x2]\n\n[Verse 3: KRS-One]\nThey don't play me a lot\nKRS you don't see a lot\nOn TV a lot, but I do MC a lot\nI don't duck and hide when I see the cops\nI'm free with the knowledge to free the block\nLive on the radio I'm sendin' my rhyme, you can see\nI'm behind enemy lines\nYou already heard about plenty of crime\nNow hear about the sciences that could really open ya mind\nI only got a little bit of time to rhyme before the\nProducer over here says \"Ok, that's fine\"\nSo let's get to it, I got my whole squad with me\nOn top'a all that I got God with me\nYou can go far with me\nFrom New York, to Atlanta, to LA\nYou know they all with me\nYou might not see me on this station cause this is a\nRapcity and KRS leads a Hip-Hop nation\nEven though y'all chase ends\nWhy can't weeeeee be friends, it all depends\nCats wanna thug it out\nIsn't it true that Hip-Hop was bigger when we all loved it out?\nLook at the difference in raps\nSee when I'm spittin' the facts\nLouder than anyone could rap, the industry collapse\nNo one's special anymore\nVariety is gone for sure\n\n[Hook x2]", "image": "https://images.genius.com/4f300314f4b269cd7479d10c0e1cab7e.1000x1000x1.jpg"}], "artist": "KRS-One"}