{"songs": [{"title": "In Cold Blood", "album": "Deeper Than Rap", "year": "2009-04-21", "lyrics": "[Intro]\nRun with me or run from me\nPussies don't get pussy, yeah\n\n[Verse 1]\nI murdered all of my foes, contract killin'\nTwenty K will get ya grand mammy pinned to the ceilin'\nMidst of the war, I piss on graves\nKids get grazed by my piss poor ways\nNever could imagine it, livin' with paralysis\nShoulda checked ya rear view, made a better analysis\nWack yayo caught him slippin' while he snort dust\nCold blood, bullet hit him like a tour bus\nCheck the time on my Movado\nMy jazzy bitch a mulatto who thinks it's petty to model\nSuede Louis on my feet, still runnin' the street\nAnd I never missed a heartbeat\n\n[Hook]\nFamily over the money, money over the bitches\nMoney don't mean nothin', then why they callin' it riches?\nI'm addicted to watches, Mama tellin' me stop it\nGot one over 50, 50 you better watch it\n\n[Verse 2]\nDo him in cold blood\nLook him in his eyes, may do him with no gloves\nBeat the case like Orenthal\nAbove the law, it's so hard to pin the big dog\nLive on so I still bark\nIn my earliest convenience I'mma kill y'all\nMake a lil cake, haters wanna envy\nGod wanna see you niggas in a Bentley\n\n[Hook]\nFamily over the money, money over the bitches\nMoney don't mean nothin', then why they callin' it riches?\nI'm addicted to watches, Mama tellin' me stop it\nGot one over 50 and keep 50 in my pocket\n\n[Verse 3]\nLimousines for the don, number three is the charm\nFlee red carpet, chillin' E on my arm\nPurple rain, smokin' head smokin' weed, call it \"purple brain\"\nI'm in the purple label, daddy got a purple heart\nNot in the service but I'm swervin' in a purple car\nOnce the bitch need a oil change\nI go and buy a new one cause I'm spoiled mayne\n\n[Hook]\nFamily over the money, money over the bitches\nMoney don't mean nothin', then why they callin' it riches?\nI'm addicted to watches, Mama tellin' me stop it\nYou know I'm totin' the rocket so don't make a nigga pop it\n\n[Outro: Bang 'Em Smurf]\nAyo, what's poppin', man?\nThis the boy Bang 'Em Smurf, man\nNew York, what up?\nQueens, what up?\nM.I.A., look, man\nWe put the round on all these niggas, man\nThey know what it is, man\nThe whole Southside stand up", "image": "https://images.genius.com/78f87f596103b6fbd0d1c2f8dad653c4.1000x1000x1.jpg"}], "artist": "Rick Ross"}