{"songs": [{"title": "Gucci Please", "album": "Everybody Looking", "year": "2016-07-21", "lyrics": "[Hook]\nGucci please\nTell me that you love me, can I be your main squeeze?\nTell me that you love me, Gucci, Gucci, Gucci please\nTell me that you love me, can I be your main squeeze?\nTell me that you love me, tell me, tell me Gucci please\nGucci please, Gucci, Gucci, Gucci Please\nGucci please, Gucci, Gucci, Gucci Please\nTell me that you love me, can I be your main squeeze?\nTell me that you love me, tell me tell me Gucci please\n\n[Verse 1]\nBaby freeze, I know a nigga look like 900 keys\nBaby say my ring look like a hundred Ps\nI got college bitches fallin' out calm down breathe\nIf yall keep runnin' on the stage then I'mma have to leave\nI'm bout to drop the top so I can feel the summer breeze\nIts a cold blooded motherfuckin rollie on my sleeve\nIt feels like I'm the freshest nigga out or is it me\nHe getting a lil' money but that nigga isn’t me\nG-U-C-C-Icy I'm the one girls wanna see\nG-U-W-O-P I'm the one boys wanna be\nLil mama got her hair fixed is hers or it weave\nShit I don’t give a damn just know that you look like a queen\n\n[Hook]\nGucci please\nTell me that you love me, can I be your main squeeze?\nTell me that you love me, Gucci, Gucci, Gucci please\nTell me that you love me, can I be your main squeeze?\nTell me that you love me, tell me, tell me Gucci please\nGucci please, Gucci, Gucci, Gucci Please\nGucci please, Gucci, Gucci, Gucci Please\nTell me that you love me, can I be your main squeeze?\nTell me that you love me, tell me tell me Gucci please\n\n[Verse 2]\nCan we pretend that I'm your man and that makes you my girlfriend\nAnd we have a one night stand in my brand new Benz\nAnd we ain't gotta worry bout nobody peeping in\nThe windows tinted black so it ain't no lookin in\nBitches talking bout my house, I think they tryna climb the fence\nThey say that when my dick come out that it's a big event\nPool in my backyard, do you like to swim?\nCause imma work you out and I'm not talking bout the gym\nGucci just got out but God damn he goin in\nThese lil' boys don't ball like Guwop, he play above the rim\nWomen on my page like damn he gettin slim\nCaucasian women see me and be like is it really him?\n\n[Hook]\nGucci please\nTell me that you love me, can I be your main squeeze?\nTell me that you love me, Gucci, Gucci, Gucci please\nTell me that you love me, can I be your main squeeze?\nTell me that you love me, tell me, tell me Gucci please\nGucci please, Gucci, Gucci, Gucci Please\nGucci please, Gucci, Gucci, Gucci Please\nTell me that you love me, can I be your main squeeze?\nTell me that you love me, tell me tell me Gucci please", "image": "https://images.genius.com/617f679ecf3e40194443f9c9117e6712.1000x1000x1.jpg"}], "artist": "Gucci Mane"}