{"songs": [{"title": "Tricks Up My Sleeve", "album": "Can I Borrow a Dollar?", "year": "1992-10-06", "lyrics": "[Common]\nI'm a Jake, I don't bake a cake\nI'm not a cake daddy, you know the type be pullin up in a Caddy\nWith a drop top, see when I ho hop, I kick it to the bus stop (what?)\nAnd it's goodie goodie gumdrops\nI don't be droppin squat but to the heads they think it's topnotch\nI'm skippin over every other dip as if it's\nHop hop hop hop hop hop hop, hop, hopscotch, watch\n\nAiy aiyyo man, ay man, look at ol' girl\nShe got a BIG ass! (Yo man, sic her.)\nAiy man, ay... hey sweetheart, how you doin?\nI'm doin fine\nOh word? What's your name?\nRayshel\nWhy don't you come over to the house so I can put you in the\nBUCK BANG!\n\nAight check it, you see I only bag ya for a second\nYou never see me beggin, you see the slimmie naked\nIn my headroom, mo' better yet my bedroom\nTippedy tokin, and stutterin as if she's Max Headroom\nRedroom (Redrum?) No I ain't a murderer\nI'm Jake the Rake, yo sorry if I'm hurtin the\nVaginal area, fallopian tubes and your cervix\nI strongly recommend that for your gen' you get some Jergens\nI find it beneficial; not to force the issue\nI just blow my shit and wipe you see a head it's like tissue\nUse em and throw em away, see a ho a day is essential\nIf you want a piece of the rock, trick, go to Prudential\nCause I rock a buyer babe on the treetop\nAnd when the wind blows, my dick'll get hard, the cradle will rock\nI'm like the peacock on NBC, Nuttin But Cock\nI pump, prrrrrrrrrrrump pump it up yo, like a Reebok\nHey, I don't sell junk, but I'm a Junkyard Dog\nAnd when I Duke it's a Hazzard, so call me Boss Hog\nOr Roscoe P. Co-- ohhhhh! pain\nThat's the sound of the Caravan... running the train\nYeahhhh yeahh, bitch\nThat's the sound of the Caravan, running the train\nOwwowhwahaheha! Check it out, check it out yeah, in yo' eye!\nYeahh! Hahhh! Yeahh!\n\nTwilite Tone got tricks up my sleeve\nImmenslope got tricks up my sleeve\nYo DRK got tricks up my sleeve\nDe La Soul got tricks up my sleeve\nJuJu got tricks up my sleeve\nThe Nubian Nut got tricks up my sleeve\nCom Sense got tricks up my sleeve\n(\"Wait... I got another trick up my sleeve\")\n\n[Rayshel]\nI'm not a Jake or a Rake or a ho, but I got the mo' better\nFor head of the class\nAnd if you ask me I'm not tryin ta be drastic\nI'm not a bitch like Robin Givens I'm concerned about your\nPlastic, ask it, I'll tell you what you wanna know\nAnd if I tell you no, don't be all up on it dope\nFrontin so your friends won't know that you got the 86\nSo you call me a bitch\nYou get your kicks, but Kix and Trix are for kids\nI don't turn no tricks, I don't suck no Dix-ie cups\nI hops in the hubba Hubba Bubba I'm like\nAl B. stud, cause if I'm not your lover or your friend\nDon't try to spend, waste your time\nTryin to get a taste of mine but you ain't tastin mine\nSo find a new type puss, cause if I don't like you\nYou ain't gettin service G, this ain't the drivethru\nDrive by, way far, and everything'll be groovy\nThen you pester me? Yo I'mma tell ya like the Nubians\nMove on black brotha move on\nYou gotta move on black brotha move on", "image": "https://images.genius.com/e3b1b8cdac9f386a42441991d28a760b.624x624x1.jpg"}], "artist": "Common"}