{"songs": [{"title": "Ambitionz", "album": "Dreams Worth More Than Money", "year": "2015-06-29", "lyrics": "[Chorus]\nMy ambition as a rider\nYeah, it's my ambition as a rider\nYeah, it's my ambition as a rider\nHey, it's my ambition as a rider\n\n[Verse 1]\nRolling, joking, smoking, thinking how I got here\nLoccin', loading toasters, pussy you was not there\nHolding, never folding, we was on the top tier\nShackled to our ankles it was like a nightmare\nYou ever wash out your drawers on the same water you shit?\nDoing your push ups right on the floor where you piss?\nCellies with niggas that went to war with the strip?\nYou got to rumble from night time down to the morning and shit\nI'm tryna tell them, forever label me felon\nClutchin' that pistol, God made me rebellious\nFuck with them niggas, teach you a lesson\nFingers on triggers, meet Smith and Wesson\nI seen pussy niggas turn on me\nThrow the money let it burn on 'em\nIf I feel like he a threat I put a bird on him\nAnd my young hittas will swerve on him\n\n[Chorus]\nMy ambition as a rider\nOh, yeah, my ambition as a rider\nOh, yeah, my ambition as a rider\nOh, yeah, its my ambition as a rider\n\n[Verse 2]\nMoney the root of evil, wait 'til them shooters see you\nLurkin in Grand Marquises, scopin' on you, your people\nMade a movie with niggas, murder and you the sequel\nBullets gon' riddle you, they gon' use tubes to feed you\nMomma gonna pull the plug\nHead big as Hey Arnold's is, full of blood\nSmell the death in the air when we pullin' up\nBullets go B-B-BRRRR, fill 'em up\nBloody murder hollow tips out the clip\nI repent when I murder opposites\nPick and roll, stop and pick\nI reload, spin the corner, drop the shit\nAnd we leave no evidence for residents to grieve 'bout\nThem sluggies hit you nigga, breathe out\nAnd keep your eyes open 'til you start to wheeze out\nWe wipe your mothafuckin' team out\n\n[Chorus]\nMy ambition as a rider\nOh, yeah, my ambition as a rider\nOh, yeah, my ambition as a rider\nOh, yeah, its my ambition as a rider", "image": "https://images.genius.com/1a5cda77113ea2b18bfbec0f3ffbaf69.1000x1000x1.jpg"}], "artist": "Meek Mill"}