{"songs": [{"title": "Who Are You", "album": null, "year": null, "lyrics": "[Intro]\nAyy, ayy (Ayy, ayy)\nWho are you, who are you?\nAyy, ayy ayy\nWho are you, who are you? (Ayy, ayy)\nAyy (Ayy, ayy)\nBitch, who are you?\nBitch (Who are you?)\nBitch (Who are you?)\n[?] beats\nAyy, ayy\n\n\n[Chorus]\nWho are you, who are you? (Who are you?)\nWho are you, who are you? (Ayy, ayy, bitch)\nYou better get a clue, you better get a clue\nWho are you, who are you? (Who are you, who are you?)\nWho are you, who are you?\nYou think you are different but damn, I met a few of you (I met a few of you)\nYou think you that nigga, damn, I killed a few of you (I killed a few of you, damn)\nWho are you, who are you? (Who are you?)\nWho are you, who are you? (Ayy, ayy, bitch)\nWho are you, who are you? (Who are you?)\nWho are you, who are you? (Ayy, ayy)\n\n[Verse 1]\nWho are you, who are you?\nWho are you, who are you? (Ayy)\nThis shit is old to me, this shit is old to me, it may be new to you\nThis shit ain't true to me I bet it's true to you\nRun up on me show you what I'ma do to you\nI am that nigga man, ayy, blow like a ceiling fan\nYou are a silly man, like I'm Meek Milly I pop like a wheelie, man\nI am for really man, you are a silly man\nTry me if you think I'm playin', I do you like I came from Philly, man\nI am too trill, poppin' these pills, I'm tryna live\nPray to the God, I'm not a God, I don't forgive\nI got them goonies, I send them niggas, straight to your crib\nThey kill you all, including the baby, his blood on the bib\n\n[Chorus]\nWho are you, who are you? (Ayy, ayy, bitch)\nWho are you, who are you? (Ayy, ayy, bitch)\nYou better get a clue, you better get a clue\n\n[Verse 2]\nWho are you, who are you?\nI keep on finessin' you\nI am the God at this, I keep on blessin' you\nNiggas be failin', 'cause, I keep on testin' you\nI feel like I am a gym, I keep on flexin' you\nI am the best and you know it, I get the drank and I pour it\nI get the gun and I show it, run up you know that I'm blowin'\nAll of my niggas be totin', you talkin' stupid we catch you in the open\nI kept finessin' the plug, 'cause, I am in love with the drugs\nI am addicted, I am addicted, boy you know what's up\nTalkin' that shit, I run up on you that shotty hold hella them slugs\n\n[Outro]\nAyy, ayy, ayy\nWho are you, who are you? (Ayy, ayy)", "image": "https://i.genius.com/45205e79deae969191ff4c7a763b609e1d4da84a?url=https%3A%2F%2Fleakth.is%2Fattachments%2Fwho-are-you-png.12942"}], "artist": "Juice WRLD"}