{"songs": [{"title": "HOUDINI", "album": ".Wav Radio Tracklists", "year": "2018-08-03", "lyrics": "[Intro: Travis Scott & Playboi Carti]\nOooh-ooh-ooh (The fuck they on?)\nBee! What? What?\nOooh-ooh-ooh (Huh? yeah)\nOoooh-ooh-ooh (Huh? yeah, check it out, Slatt)\nOooh-ooh-ooh (Yeah, what?)\nWhat? What? What? What?\nWhat? What? What? What?\nWhat? What? What? What?\n\n[Verse 1: Travis Scott]\nMove at me, you move with caution (Yeah)\n512, she ball from Austin (It's lit)\nWatchin' Family Guy, no way to pause it (Alright)\nHeard the voicemail and she damn near lost it\nHear the silence, hear the water from the faucet (Straight up)\nOne, two, three, we lasted longer than an auction (Yeah, yeah)\nThought I sold it, but it ain't no way she bought it (Yeah)\nTime to fill up the 'Wood with narcotics (It's lit)\nYeah, I'm up in the trees if you need me (In the trees)\nYeah, back up and the gang go for a three-peat (Alright)\nYeah, back up off the gang, man we need three feet (Three)\nWhile I mix up the magic, Houdini (Yeah)\n\n[Verse 2: Playboi Carti]\nI'm in the 9, I'm in the 9\nI'm in the 9, I'm in the 9\nYeah, reppin' the 9, yeah, yeah, I'm in my prime\nAyy, yeah, we in the grind, breakin' it down\nI just left Houston\nOoh, yeah, meet me at Travis' spot\nOoh, we at the Batcave, yeah, we at the pit stop, yeah\nI got these dreadlocks, yeah, I'm in the big block, yeah\nI'm in that rich spot, yeah, you in the fed spot, ooh\nI feel like the only one, they callin' me deadstock, ayy\nThese niggas be holdin' their tongue, they don't be sayin' a lot\nI'm in a bloody spot, uh I'm in a bloody spot, what\nI'm in a dirty spot, huh, I'm in a bloody spot, uh\nI'm in the trap, I'm in the back, I'm in the birdy spot\nGot the dirty thot, she come with a dirty spot\nThat come with a dirty pot, I need the dirty with pop, yeah\nI need a bitty with pop, all of my bitches gon' pop, yeah", "image": "https://images.genius.com/313fb217018774f7e73b2692a40db040.1000x1000x1.jpg"}], "artist": "Travis Scott"}