{"songs": [{"title": "Thug Nigga", "album": "One Nation (Bootleg)", "year": "2010-01-01", "lyrics": "[Intro: Capital LS & 2Pac]\nYo E, somebody come in this motherfucker with me man\nI'm with you nigga, you don't need nobody, I'm with you nigga\nCome on nigga what's up?\nLS and 'Pac, Greg Nice\nYou're looking at me through the window\nAsu, set it off with you nigga\nCome up in here with me y'all\n(Set it off nigga, for the niggas in New York, set it off)\nYo' ha ha ha ha ha yo' yo'\n(LS in this biaatch!)\nWe in the motherfuckin'... west coast right now\n(Westside)\nWord to mother, my nigga Kurupt\n(Eastside, ride)\nK- Kurupt, word, I got my nigga Greg Nice\n(Right there nigga, right there)\nBaby Jesus and the Allstars\n(babbbby babbby )\nTha Outlawz, takin' off their draws, niggas\nYo' we 'bout to... check it out\n\n[Verse 1: Capital LS]\nWhat does it take to shake and bake nowadays?\nNiggas in crime, get made cause it pays\nBodies get sprayed with motherfuckin' ultra-rays\nWhen shit gets too smooth I get's, rude with the lipper\nAny kind of liquor's company like Jack Tripper\nThere's been times when I flip like acrobats\nFuckin' coast to coast, chickenheads to hoodrats\nTools to Gats, Lowriders to Ac's\nTwo years ago my shit was underrated (was underrated)\nI wish you rap niggas frustrated\nThe rhyme stated updated; as I migrated\nI'm direct from Strong Island, New York\nWhere I be smilin', profilin', wildin'\nWith my niggas in the Acura Coupe\nIn the Ja's and bitches like the Ginseng group (Ginseng baby)\nPlayin' that \"One Love\" loop Ha ha ha (loop)\nThe sun shines through my sunroof (sunroof)\nSome days I can amaze the youth with proof that\nThe force of my rhyme can cause a cardiac (cardiac)\nArrestin' motherfuckers that don't like investin'\nSo I eat them up like salad dressin' (salad dressin')\nAnd it don't stop\n\n[Ad-libs: 2Pac]\nHa ha ha, yeah nigga, that's how we do that shit\nLS in this bitch, nigga that's how we do that shit\nLive live on the westside, eastside right, niggas can't understand it, no doubt, no doubt\nMy scandalous family, insanity\nIt ain't no playin' nigga we're takin' over the whole industry\nYou bitch made niggas can't believe that shit\nLS and niggas so crazy\nYou only have to pay, to pull up on that bitch\nYou've been clowned, to make it to that ground\nThese niggas snatchin' your business kid\n\n[Verse 2: Asu]\nThey fucked around and let the 3rd bred about the stable (Whats up?)\nMe and my Cali niggas is jumpin' fools without the cables (Without the AK)\nEverything I got is double 2's 4's and barrels\nOnce that ass slipped we gots to burn it like Carrol\nSomehow someway real niggas know real niggas yeah yo why is that?\nWhen you roll Asu, you end up with them tires flat\nThe names Asu, it starts with A and ends with you\nWhatever you want to do, I got my whole fuckin' crew\nUp over the mountain there's fountain of phrases\nI'm countin' pages, ages is givin' up wages to heal the rages\nI don't riff, I stay cool let the sanity build\nAll I need is a starter and the horror that's worse than Amityville\nNo disrespect, all we want is bacon G\nPack them bags; they have them hotel got vacancy\n\n[2Pac talk]\nThat's right nigga set that shit 'til they motherfuckin' chincheckin' we wreck it, Look here\n\n[Verse 3: 2Pac]\nMy niggas crooked, though it seems\nMy every single, thought is caught up, in collectin' cream\nA made nigga, Picture me dyin' in the blaze, or gunfire\nWill not retire 'til I'm paid, turn the bass up high\nWhen we ride, we fly by, bitches blow me kisses\nNiggas from Compton to Brooklyn come on get your riches\nFrom Crenshaw to 1-2-5 and do or die\nRollin' with niggas from Long Beach, to Long I\nI hardly smile, cause my heart froze\nOnce I, commence my show, I rip apart foes\nNow I, got one nation its a crooked compilation\nJust to end the bullshit let's get back to money makin'\nTell 'em bustas that I rolled on, controllin' our house\nMy shit's so wicked when I flip, niggas  closin' they mouth\nThem Cocoa brovaz, Buckshot the BDI thug\nGreg Nice, LS, Asu, so show a nigga love\nOutlaw!\n\n[Outro: 2Pac]\nYou feel that shit nigga!\nYou know what time it is, ha ha ha ha, yeah!\nHit them niggas with the shit that made Nice & Smooth nice nigga\nGreg Nice feel me nigga?\nI know u fucked a lot of drug dealers\nBut she never got fucked by a thug nigga\nCome on! I know she fucked a lot of drug dealers\nBut she never got fucked by a thug nigga\nCome on! I know you fuck a lot of drug dealers\nBut you never got fucked by a thug nigga, baby never\nCome on! I know you're fuckin' with some drug dealers\nBut you never got fucked by a thug nigga\nHa ha ha ha, yeah yeah!, all like that nigga\nHa ha ha ha, hell motherfuckin' yeah, Thug Life baby\nIt don't stop, this song is twisted and crazy\nYeah nigga, that nigga 2Pac\nFrom this block to your block, you can tell the kids nod\nOne Nation, fuck around and get shot, you know, One Nation\nEast side, West Side, ha ha ha ha, yeah\nAll my niggas on the East Side, throw up your guns\nAll my niggas on the West Side, throw up your guns\nAll my niggas from the East Side, throw up your guns\nAll my niggas from the West Side, throw your guns up\nNiggas from the East Side, throw up your guns\nAll my niggas from the West Side, throw your guns up\nAll my niggas from the East Side, throw up your guns\nAll my niggas from the West Side, throw your guns up\nNiggas from the West Side, throw up your guns\nAll niggas from the East Side, throw up your guns\nAll my niggas from the West Side, throw up your guns\nAll my niggas from the East Side, throw your guns up\nHa ha ha, yeah nigga, Outlawz yeah, Thug Life\nHa ha ha ha ha, yeah, energy makes plenty of enemies, you feel me?\nThrow your guns up!!", "image": "https://images.genius.com/a1a90553105ad6af8fac203ba73284bf.480x360x1.jpg"}], "artist": "2Pac"}