{"songs": [{"title": "Eastside", "album": null, "year": null, "lyrics": "[Bigg Snoop Dogg]\nYou'z a fool fo' dis, yeah\nMy dogg Hi-Tek, representin' Cincinnati, Ohio!\nEastside shit, y'all know how we get down\n7 dizzles a wizzle, Bigg Bow Wiggle's, up in the hizzle\nFo' shizzle bizzle, here we go again\n\nFreshly dressed, I jump up in the mo'nin' tryna find some Zest\nPsyche, we like the Bom, somebody betta ring the alarm\nAnd hit the folks at the forum\nLet my homies off the yard\nI shall see the head nigga in charge\nPush... Bush outta office, dump 'til they get off us\nMake them offers, that leave niggas in coffins\n\n[Goldie Loc]\nCan you feel it my nigga, I'm 'bout to kill it my niggas\nSound like guerillas, fo' real'a off gangsta government millas\nCoke killas, when it comes to off mic'n wit me\nI was branded in a gang, f**k havin' techniques\nJust ride, not a damn lettin' these fools breathe\nPop peas, push keys, find a stash fo' yo cheese\nIs it possible that laws might get jealous\nHell yeah they be hatin' on the 3 Good Fellas\n\n[Tray Deee]\nOver-dosage of ferocious, WestCoast in effect\nBang straight gangsta shit, so you know it's on deck\nHold and respect, cold as it get, don't wanna test\nKidnap ya wife and ya kids, you get the message\nInsanity, commanded me to savagely spit\nSuffer casualties, challenge me, I handle it quick\nNo talkin', C-Walkin', we chokin' the block off\nLettin' the Glock off\nAnd throwin' up DoggHouse\n\n[Hook: Nate Dogg]\nWestCoast niggas and we all in yo house\nGang bang niggas we gon' turn this bitch out\nEastside ridaz and we all in yo mouth\nDogg Pound Gang we let the mothaf**kin' doggs out\nNate Dogg, Goldie, Snoopy, Tray Deee\nNever loved a ho and run the \"G-A\" in me\nAlways got a bitch, but never in the front seat\nStill the same let the mothaf**kin' doggs out\n\n[Goldie Loc]\nYeah! it's about to get Crip'd out crazy\nBlast on all you suckas with the throw away to daily\nDon't you shoot that little mothaf**ka no mo'\nThat ain't what he said when he hit the chest went through his heart, came out his elbow\nYou shouldn't have been talkin' that shit bitch boy\nSayin' the wrong thing against the real McCoy\nDidn't know I was a cold-blooded gangsta\nIf you ain't ridin' wit us fool, we'll catch ya lata\n\n[Tray Deee]\nWe exploded, reloaded and sewed it up\nSprayed shots to the crowed, like a loaded pump\nKeep this mothaf**ka jumpin' 'til they close it up\nThen we dippin' wit a sip and some hoes to f**k\nPour late, the hard way, ain't no bustas here\nSo explict you can only get it once a year\nEastsidaz, the ridaz, they change the game\n\nAnd let you know from here go, we straight came to bang\n\n[Bigg Snoop Dogg]\nPut me on a leash if you dare and I doubt you\nEver see someone here, who gave a f**k about you?\nNiggas on the streets gon' keep talkin' shit about you\nAs long as you clap fool, it's bigger than 'bout too\nF**k wit fools, that ain't never paid us\nAnd try to turn the homies into traitaz\nBlue rags with blue balls, fo' all you hataz\nI shoot a shout out to the killas\nYeah them stealas and Raiders\n\n[Soopafly]\nIt's them D-O double G'z\nAin't nobody really f**kin' wit deez\n\n[Bigg Snoop Dogg]\nWho let the mothaf**kin' doggs out?\n\n[Soopafly]\nDoggHouse in ya mouth\nWe them niggas people talkin' about\n\n[Bigg Snoop Dogg]\nWho let the mothaf**kin' doggs out?\n\n[Soopafly]\nNiggas betta run and hide, we about to ride\n\n[Bigg Snoop Dogg]\nWho let the mothaf**kin' doggs out?\n\n[Soopafly (Bigg Snoop Dogg)]\nWho let the mothaf**kin' doggs out? (Woof, woof)\n\n[Bigg Snoop Dogg]\nWho let them Eastside ridaz out?\n\n[Goldie Loc]\nNow all the locs and doggs, who roll in big balls, say chips! (Chips!)\nAnd all the women wit extensions in well fed conditions, you bitch! (You Bitch!)\n\n[Bigg Snoop Dogg]\nHey! who let the mothaf**kin' gate open?\nPolice comin' and we still smokin'\nWhat you drinkin' on Loc'y, Loc'y?\nDoggy wo'gy, got his fo'gy while we tokin' on the wo'gy, doggy\n\n[Goldie Loc]\nSay woof mothaf**ka!, woof mothaf**ka!\nMighty mowed his ass, take his block fo' the hustlas\nPost up, make about a million a month\nHittin' Bloods!, switchin' guns!\n\n[Hook: Nate Dogg]\nWestCoast niggas and we all in yo house\nGang bang niggas we gon' turn this bitch out\nEastside ridaz and we all in yo mouth\nDogg Pound Gang we let the mothaf**kin' doggs out\nNate Dogg, Goldie, Snoopy, Tray Deee\nNever loved a ho and run the \"G-A\" in me\nAlways got a bitch, but never in the front seat\nStill the same let the mothaf**kin' doggs out", "image": "https://images.genius.com/8c99dd335733f9c3cf16f57c9f589cfb.361x361x1.jpg"}], "artist": "Snoop Dogg"}