{"songs": [{"title": "Zan Man", "album": "I Came From Nothing", "year": "2011-06-08", "lyrics": "[Intro]\nIt's Young Thug bitch\n(ROC Crew forever)\nMy world\n(We went from cheese to cheddar)\nTry not to get putted out\n\n[Verse 1]\nHop out the G4, now I'm back to the basics\nI thank God that I am not racist\nShout out to Wayne cause he is not basic\nHe got me on my turtle time, no Matrix\nAnd I promise I'll ball, no patriot\nAnd I'll be at the finish line, slick waiting\nWhich is at the tip top, big Akron\nBut if I fall off I'll die, so I'm pacin'\nAnd I've been in and out the bank bitch\nWhile ya'll assholes been in and out a tank bitch\nI think I'm on my Wayne cake shit\nBut we smoke the same weed, the Wayne stank shit\nAnd I'm the top tire, no innertube\nAnd I'll eat till you're sour, like lemon food\nCause I'm the motherfuckin' boss and you're a middle dude\nAnd you're just like the bricks, we get rid of you\nAnd I should make a pledge of allegiance\nCause these niggas small, they ain't in my region\nI stay away from ya'll when you niggas this bleedin'\nCause I don't know if you know me like I'm takin' the pleadin'\nWe in the buildin', the niggas that are outback\nI throw the children at your bitch and she caught that\nAnd I'm the boss so, yea I Marshall Faulk that\nAnd my partner on my falkjack\nI'm at the top, no lie\nAnd I be in the motherfuckin' sky, don't fly\nAnd if I can't stay around ya, I'mma run right through ya\nBut if you get right bitch, I might new, new ya\n\n[Interlude]\nYea, it's Thug, I have prison bars (Do the math)\nConcrete jungle and shit\nWe been havin' this shit man\nLong, long time ago, I promise you\n\n[Verse 2]\nMoney on your head, now you need a paper proof roof\nNiggas at me, man I need a bulletproof booth\nAnd what ya'll call goons, we call goof troops\nAnd them hoes we smashin', ya'll call 'em new, new\nRidin' with the 50 cal, old man protected\nHow the song got Universal still neglectin'?\nOops I mean select me\nSkooly didn’t forget me\nI fuck with Juugman shit, respect he get plenty\nAnd I be with my dogs like a hunter\nWe be blowin' racks while they starvin' out for hunger\nAnd they say I look good, but I'm mean, sexy monster\nThey wanna make me mad but Ty told me to stay humble\nAnd they ask me why I still respect Jimfro\nCause he the motherfucker that made me, is you crazy?\nAnd he asked me why I had two babies\nCause I ain't lettin' a fuck nigga clone me, is you crazy?\nBut if a nigga play with them babies\nHe gone need the motherfuckin' army and the navy\nCause the ROC crew move by the babies\nAnd we got a 1000 guns in Haiti\nAnd Skooly hopped out the Porsche\nAnd I be ridin' round lurkin', me and your dad\nOr should I be sayin' the zan man kids?\nCause we be high like the school at Harvard of Spanish, ya dig?\n\n[Outro]\nThank God that I am not basic..", "image": "https://images.genius.com/ac0b77a35fdb3726c0ed9766d648c354.500x500x1.jpg"}], "artist": "Young Thug"}