{"songs": [{"title": "What Goes Around", "album": "Stillmatic", "year": "2001-12-18", "lyrics": "[Produced by Salaam Remi]\n\n[Intro: Nas]\nYeah..\n\n[Chorus: Nas]\nAyo, it's poison: ecstasy, coke, you say it's love, it is poison\nSchools where I learned, they should be burned, it is poison\nPhysicians prescriptin' us medicine which is poison\nDoctors injectin' our infants with the poison\nReligion misoverstood is poison\nNiggas up in my hood be gettin' shot, given poison\n\n[Verse 1: Nas]\nIn hospitals, shots riddle the block, little\nChildren and elderly women run for they lives\nDrizzlin' rain come out the sky every time somebody dies\nMust be out my fuckin' mind, what is this, the hundredth time?\nSendin' flowers to funerals, readin' Rest In Peace\nYou know, the usual, death comes in threes\n\"Life is short\" is what some nigga said\nNot if you measure life by how one lives and what he did\nAnd funny how these black-killer companies is makin' money off us\nFast food, Cola, soda, Skull and Bone crosses – it's all poison\n\n[Chorus 2: Nas]\nEcstasy, coke, you say it's love, it is poison\nSchools where I learned, they should be burned, it is poison\nPhysicians prescriptin' us medicine which is poison\nDoctors injectin' our infants with the poison\nReligion misoverstood is poison\nSisters up in my hood try to do good, given choices\n\n[Verse 2: Nas]\nWhen pregnant, drop out of school or have abortions\nStop workin', hopin' that they find a man that will support them\nUp late night, on they mother's cordless\nThinkin' a perm or bleachin' cream will make them better, when they're gorgeous\nWhite girls tannin', liposuction\nFake titties are implanted, fake lips, that's life destruction\nLight-skinned women, bi-racial\nHateful toward themselves, denyin' even their blood\nI don't judge Tiger Woods\nBut I overstand the mental poison that's even worser than drugs\n\n[Chorus 3: Nas]\nYo, it's poison: ecstasy, coke, you say it's love, it is poison\nSchools where I learned, they should be burned, it is poison\nPhysicians prescriptin' us medicine which is poison\nDoctors injectin' our infants with the poison\nReligion misoverstood is poison\nRadio and TV poison, white Jesus poison\nAnd any thoughts of takin' me down is poison\nWho want beef now? My heat shall anoint 'em, PLAOW!\n\n[Interlude: Nas]\nNever to worry, all the wrong-doers got it coming back to 'em a thousand times over\nEvery dog has its day, and everything flips around\nEven the most greatest nation in the world has it coming back to 'em\nEverybody reaps what they sows, that's how it goes\nInnocent lives will be taken\nIt may get worse, but we'll get through it, y'all, be strong!\n\n[Verse 3: Nas]\nThe China-men built the railroad, the Indians saved the Pilgrim\nAnd in return the Pilgrim killed 'em\nThey call it Thanksgiving, I call your holiday \"hell-day\"\n‘Cause I'm from poverty, neglected by the wealthy\nMe and my niggas share gifts every day like Christmas\nSlay bitches, and party everyday like this is the last\nI'm with my heckles, connectin' and we hittin' the lab\nThis is my level, fuck if it get you mad\n\n[Chorus 4: Nas]\nIt's all poison: all of my words to enemies, it is poison\nRappers only talk about keys, it's all poison\nHow could you call yourself MCs? You ain't poison\nThink about the kids you mislead with the poison\nAnd any thoughts of takin' me down is all poison\nWho want beef now? My heat shall anoint 'em, PLAOW!\n\n[Bridge: Keon Bryce]\nWhat goes around comes around, my nigga\nAnd what goes up, it must come down, my nigga\nThe soldiers found below the ground, my nigga\nJust hold it down, we older now, my nigga\nWhat goes around comes around, my nigga\nAnd what goes up, it must come down, my nigga\nThe soldiers found below the ground, my nigga\nJust hold it down, we older now, my nigga\n\n[Verse 4: Nas]\nThis nigga Ike with the Iverson jersey, light-skinned with herpes\nFuckin' sisters in Harlem, Brooklyn and D.C\nThis is the problem, ‘cause he never tell 'em he got it\nFrom lettin' fags suck him off, Rikers Island in '93\nDrives a Benz, hangs at all the parties\nAll the concerts, backstage where the stars be\nRockin' they shirts in bitches faces like clockwork\nWhat's your name? Where you from?\nChain blingin', thinkin' girls everywhere is dumb\nTakin' pride in ruinin' their lives\nSo they could never have babies and they could never be wives\nHe never used a condom; give him head? He got ya\nMet the wrong bitch and now he dead from the monster AIDS\nI contemplate, believin' in karma\nThose on top could just break and won't be eatin' tomorrow\nI know some bitches who be sleepin' on a nigga's dreams\nThey leave; when that nigga blow, she the first bitch on her knees\nKnowin' dudes that's neglectin' their seeds\nInstead of takin' care of 'em they're spendin' money on trees\nI pray for you, deadbeat daddies\n'Cause when them kids get grown\nIt's too late for you: now you old and you gettin' shitted on\nIt's all scientific, mystic, you know, the Earth and the stars\nDon't hesitate to say you heard it from Nas\nWhat is destined shall be\nGeorge Bush-killer 'til George Bush kills me\nMuch blessings, be healthy, remember:\n\n[Bridge: Keon Bryce]\nWhat goes around comes around, my nigga\nAnd what goes up, it must come down, my nigga\nThe soldiers found below the ground, my nigga\nJust hold it down, we older now, my nigga\nWhat goes around comes around, my nigga\nAnd what goes up, it must come down, my nigga\nThe soldiers found below the ground, my nigga\nJust hold it down, we older now, my nigga", "image": "https://images.genius.com/b568e8d559c7ba98ef485809d81c1d79.1000x1000x1.jpg"}], "artist": "Nas"}