{"songs": [{"title": "F.I.V.E", "album": "OKE: Operation Kill Everything ", "year": "2013-10-09", "lyrics": "[Intro: Skit]\nProsecutor: Sir, is it true you were a crack cocaine dealer for 7 years?\nDefendant: I-I plead the fifth\nProsecutor: Exactly how much money did you earn in your time as a crack cocaine dealer?\nDefendant: Fifth, five. One, two, three, four, Fifth\n\n[Verse 1: Game]\nJoggin' my memory, the Documentary\nKilled that in a drop top, John Kennedy\nHad the rap game in fear, like it was ten of me\nThe old me ain't got shit on what I'm finna be\nNigga, I'm finna be still reppin' the letter B\nWhat if it was the nigga that Dre signed instead of me?\nWould I be starvin' or studyin' in Harvard?\nOr would I be a dog of another fuckin' pedigree?\nTake away me, take away the su-woo\nTake away the gangstar like hip-hop did Guru\nPull up in that new coupe, take away your girl, run her choo choo\nThen put it on Worldstar, or YouTube\nYo Tune' what it do?\nGot some bitches in the lobby and I'm 'bout to send them through\nI'm Kobes rings, nigga, who the fuck is you?\nNot the nigga with five bitches sittin' in the coupe\n\n[Chorus: Chris Brown]\nFive, got Jacksons in my pocket and I'm feeling like a Jackson\nFive, I'm balling, yeah, I'm balling, got me feeling like I'm in the Fab 5\nFor as long as I live, I will rep the five\nLike MJ in game five, oh, woah\n\n[Verse 2: Lil Wayne]\nI got five on it,\nFive sho', Young Tune in this bitch, fuck 5-0\nNickel plated 4-5 if I have an issue\nBeat your ass black and blue with a bag of nickels, ha\nI’m a G, do somethin' ’bout it\nYou ain’t half of me, you ain’t 500 dollars, nigga\nAnd my red bone, 5-5\nNo hand slapped, but I’m high five\nYeah, get with the game or play the sideline\nI dream to get the cover of High Times\nNow take 5 paces\nAnd try to guess the color of my shoelaces, red, bitch\nYeah, I’m on my high horse\nNow the sky mad at me 'cause I stole five stars\nGot some freaks in the livin' room gettin' it on\nAnd they ain't leavin' 'til five in the morn'\n\n[Chorus: Chris Brown & Lil Wayne]\nFive, got Jacksons in my pocket and I'm feeling like a Jackson (I got, yeah, feeling like a Jackson Five)\nYoung Tunechi, yeah\nFive, I'm balling, yeah, I'm balling, got me feeling like I'm in the Fab 5 (woo hoo)\nYoung moolah, baby\nFor as long as I live I will rep the five (I will rep the five)\nFive\nLike MJ in game five, oh, woah\n\n[Outro: Chris Brown & Lil Wayne]\nI deserve to be top five\nShots, pull up", "image": "https://images.genius.com/f04f9b2892eac01c8dd7876593883785.500x500x1.jpg"}], "artist": "The Game"}