{"songs": [{"title": "Off The Wu-Headbanger", "album": null, "year": null, "lyrics": "[Intro: Method Man]\nI would kill some fucking body\nThe mad stola, the mad stola\n(Who? Russel who?)\nHa ha, nah let me stop\nWord up this is a Def Jam production (Sandman)\nFeaturing, Johnny Blaze word up\nAnother Sandman joint, dirtman on the track\nFlip the script, script the flip\nCheck the steez (believe that)\nCheck it out now, check it check it out\n\n[Verse 1: Method Man]\nI get drunk off of cheap wine and hold frontline\nNiggas wanna front, fine, fuck with me and mine\nRain on your sunshine\nSwine niggas come as hard as a pork rind\nCan you dig it, only five percent live it\nWhile the rest of you fake niggas try to get it\nPeep the Stallion, half of y'all need to quit it\nFrontin' hard and be soft as a cotton knitted\nNo balls at all, if you do son then get with it\nRazor sharp in my jaw bone I might spit\nI'm dealin with it on a everyday basis\nRoam where it get cold at and stack glaciers\nIn the zone it's Tical once again stoned\nThrow your hands in the air and puff a Meth bone\nDid you ever get the feeling for that phat shit?\nSomething different from that R&B and rap shit?\nWell here it come, from the gums of the one, I amaze 'em\nFire in the sky, peep me now, Johnny Blaze 'em, check it\nMy mind's on the rhyme, ain't a damn thing funny\nGettin' money, Blaze represent, kills the fraudulent\nFucker giving me the grill\nNowadays everybody trying to keep it real\n4th Disciple, hit me with that 30/30 rifle\nBeats from the streets mega-trifle\nRap gymnastics, flipping from the cradle to the casket\nTake another pull, fantastic\nIt's the Method not the Plastic, Man\nComing down like hourglass sand, check the tactic\nFlow P.L.O., P.L.O. now you know\nThe ultimate and rhyme legitting\nPeep the counterfeitten or get snake bitten\nFilled up with deadly venom, Johnny Blaze get up in 'em\nPlay 'em out like Lee denim, can you dig it\nCan a brother eat, can I live it\nGets no deeper, whoever slipping get the sleeper\nHold, faces of death, bodies cold\nOn some Evil Dead part 2, swallow your soul\nYeah, and it don't stop\nThe body body body body rock, yeah\nHip hop, we sat out in the dark (in the dark)\nWe used to do it out in the park (Where that?)\nHill Avenue, ain't a damn thing new\nStay true to my Clan, I'm a family man\nLoyalty brought me royalties\nTo the Gods I give my heart and soul totally\nIt's a bond can't be broken, that's my life\nI'mma die if I think twice, I'm not jokin\nTo the essence if I'm half stepping\nPolitician use the system, as lethal weapons\nWhen we slip up, lethal injection\nHah, everyday life's a lesson\nI take my spot in the lower class section\n\n[Outro: Method Man]\nJohnny Blaze, 9-5 to the 9-6\nWord up, keep it moving", "image": "https://images.genius.com/fe6629f7a5e6af0aa38ca87547ced96f.1000x562x1.jpg"}], "artist": "Method Man"}