{"songs": [{"title": "Where It’$ At?", "album": "1999", "year": "2012-06-12", "lyrics": "[Intro: Joey Bada$$ & Kirk Knight]\nAye what it is? One time, what up\nAye what it is? One time, what up\nAye what it is? Two time, what up\nTwo time, two time, what up\nAye what it is? One time, what up\nAye what it is? One time\nLet me know, let me know\nLet me know, let me know\n\n[Verse 1: Joey BADA$$]\nLet's get down tonight\nI think I might blow a whole pound tonight\nSo shorty hit me with the spot and if it sound alright\nThen you know I'm in the house, let a nigga run his mouth\nIt's going down on sight\nI'm always down to fight, ain't duff a nigga in the while\nNo bluff, ain't no church when you're living in the wild\nI was hidden in the crowd, rippin' on some loud\n'Til I seen the sucka nigga dick-lickin' on my style\nWow, must've been the material linen\nWhole night kept him in my peripheral vision\nAll I gotta say is the word and imperials get him\nWord to my pops, I know niggas known for serial killin'\nBut back to the women, they tryna catch me slippin'\nSo I gotta pack a mags to stop venereal venoms\nFrom entering my system\nIf it ain't my moms or my 'sis then, I cut'em in the system\n\n[Hook: Joey Bada$$ & Kirk Knight]\nSo tell me where it's at and I'm in the spot (so what you wanna do)\nI said so tell me where it's at and I'm in the spot (we got a lot to come true)\nI said so tell me where it's at and I'm in the spot (so what you wanna do)\nSo tell me where it's at and I'm in the spot (we got a lot to come true)\nI said so tell me where it's at and I'm in the spot (so what you wanna do)\nTell me where it's at and I'm in that spot (we got a lot to come true)\nLet me know, let me know\nLet me know, let me know\n\n[Verse 2: Joey BADA$$]\nYo let me tell you what I'm living like, same shit, just a different night\nSuper bad chicks and they all up in my kryptonite\n'Bout to get down, I'm tryna get up in the tight\nSo roll the indo right and I can show you what them bitches like\nThey just wanna come and have fun\nTold this little hun she could come but don't touch my funds\nI might get crazy, I might bust a gun\nSo just give me some more and I might bust her son\nMight bust and run, they said love will come knockin' at my door\nWell I guess lust must've wrung\nThe dutch touch the lungs and it was on, had her beggin' for the dawn\n'Til the crack of dawn then I passed it off to Kwon\nI said it gotta be the swank if it ain't the rank\nCause some pull hoes like how dreamers pudo\nHold up, let me pull ove', told her to hop in then put it back and drove\nAnd hit it out-park like Al Pujols\n\n[Hook: Joey Bada$$ & Kirk Knight]\nSo tell me where it's at and I'm in the spot (so what you wanna do)\nI said so tell me where it's at and I'm in the spot (we got a lot to come true)\nI said so tell me where it's at (yo fuck you Joey) and I'm in the spot (so what you wanna do)\nSo tell me where it's at and I'm in the spot (we got a lot to come true)\nI said so tell me where it's at and I'm in the spot (so what you wanna do)\nTell me where it's at and I'm in that spot (we got a lot to come true)\nLet me know, let me know\nLet me know, let me know\n\n[Verse 3: Kirk Knight]\nShe's so enticing, derogatory thoughts when I'm sighting\nSlangs to get her wet\nAnd I heard you're overflowing, I could test the waters like sea man\nAnd I heard you like semen, see man\nWell let me slide through, I know you're feelin' the kid\nCause these nonchalant lines is lettin' me in\nCause on contrast, I could see us lovebirds, it's in plain sight\nAnd am I right cause I heard you like the international lovin'?\nOn a higher scale, when I mean scale, I do it well\nLet me go deeper, feel like I'm doing it well\nWord on the street you acting like a bastard, can I be you daddy?\nYou can hop up in my caddy, and I heard you got the fatty\nYeah cellurite\nJust remember it's amazing how I come up on the track\nSo duck and weave, and please believe my side effect is shakin' knees\nDamn here I go again with the suggestive themes\n\n[Hook: Joey Bada$$]\nSo tell me where it's at and I'm in the spot (so what you wanna do)\nI said so tell me where it's at and I'm in the spot (we got a lot to come true)\nI said so tell me where it's at and I'm in the spot (so what you wanna do)\nSo tell me where it's at and I'm in the spot (we got a lot to come true)\nI said so tell me where it's at and I'm in the spot (so what you wanna do)\nTell me where it's at and I'm in that spot (we got a lot to come true)", "image": "https://images.genius.com/252e8274d38f0d4a7ea351dd63231cbb.612x612x1.jpg"}], "artist": "Joey Bada$$"}