{"songs": [{"title": "Don’t Trip", "album": "The Documentary 2", "year": "2015-10-09", "lyrics": "[Produced by will.i.am]\n\n[Intro: Dr. Dre]\nYo, yo, will.i.am, my nigga\nIt’s your boy Dre\nYo, I-I don’t think people know that you know how to take it to the streets\n\n[Verse 1: The Game]\nCheck it out now, check it out now\nCheck it out, uh-huh\nIt’s like that, yeah, it’s like that now\nIt’s like that, uh-huh, it’s like that now\nThat black .45, I gotta put it on\nThat chrome Glock 9, I gotta put it on\nThat .38 special, I gotta put it on\nNever leave the house without the teflon\nHop off the porch like\n\n[Chorus: will.i.am & The Game]\nOh, oh, oh, oh, oh, that new bounce\nNew bounce, new bo-, don’t trip on me\nDon’t trip on me, don’t trip on me\nDon’t trip on me, don’t trip on me\nDon’t trip on me\nNigga don't trip\n\n[Verse 2: The Game]\nDon’t trip, homie\nYeah, I’m the opposite of Crip, homie\nYou ain’t even gotta ask, niggas know me\nI make it rain like Tony, Toni, Toné\nAventador to the corner store, I whip this hard\nCompton God, watch ‘em jump over cop cars\nYeah, I grew up to N.W.A, nigga\nAnd my grannies whipping yay-yay, nigga\n\n[Verse 3: Ice Cube]\nCome on, don’t trip, homie\nIce grew up around Crips, homie\nWhere you motherfuckers find this phony?\nActing hard, he’s a tenderoni\nThe boulevard to the prison yard, I push this cart\nWestside rolling, wherever you are\nAnd I been coming up, and ain't none of ya'll niggas running up\n'Cause I'm quickdraw when I'm gunning up\nBoy you know the sun ain't coming up\nLay that ass down\nTryna milk this cash cow\nFace down, look at you now bitch\n\n[Chorus: will.i.am & The Game]\nOh, oh, oh, oh, oh, that new bounce\nNew bounce, new bo-, don’t trip on me\nDon’t trip on me, don’t trip on me\nDon’t trip on me, don’t trip on me\nDon’t trip on me\nNigga don't trip\n\n[Verse 4: Dr. Dre]\nYou know the deal, greet a nigga on your knees bitch\nYou heard the talk around town I don't need shit, Compton\nDeep water got 'em sea sick\nMurder, murder shit and ain't nobody see shit\nBomb weed, palm tree, gold D shit\nWho that nigga that said I wasn't gon' be shit?\nCocktail through the window with the indo\n(It's what this is) We don't stress them innuendos\n(We) Do what we wanna when we want to\n(And we) Never hesitated to confront you\n(And we) Seen shit as kids\nIt was normal to us, it might take you\nBut it might fuck around and haunt you\nShoulda come and see this shit\nGive a fuck about no tours, nigga\nI want you to come and be this shit\nRen, Cube, Yella, Dre and Eazy-E this shit\nSee how long it take your punk ass to leave this bitch\nCompton\n\n[Chorus: will.i.am & The Game]\nDon't trip on me, don't trip on me\nDon't trip on me, don't trip on me\nNigga don't trip\n\n[Verse 5: The Game]\nDon't trip, Blood\nI make it rain in Compton like it's a strip club\nI grew up on Santana block, that's where the Crips was\nMy mama house was in the middle of the street\nHow was a nigga supposed to get to school?\nI hopped every backyard on my block\nTill I got to  Elm Street, took the rag out my sock\nAnd I could have been a Crip but I ain't like blue that much\nAll Crip school, I ain't really go to school that much\nI was selling crack on Elm, bagging up sacks on Elm\nWith the ratchet in my Bulls jacket, giving you the facts on Elm\nKing Frog and Big Face had my back on Elm\nWe was fighting over territory with the T-Flats on Elm\nI had to scrap on Elm, that's how I got my stripes\nAir Max 95s, not a scratch on my Nikes\n2016 motherfucker, don't you pull it\n'Cause I made it out of Compton with a stab wound and five bullets\n\n[Chorus: The Game & will.i.am]\nDon't trip on me oh, don't trip on me oh\nDon't trip on me oh, don't trip on me oh\nDon't trip on me oh, don't trip on me oh\nDon't trip on me oh, don't trip on me oh\nDon't trip on me, don't trip on me\nDon't trip on me, don't trip on me\nDon't trip on me, don't trip on me\nNigga don't trip\n\n[Verse 6: The Game]\n'Cause I'm bool like that, I'm bool like that\nI'm bool like that, yeah I'm bool like that\nThey say \"Game, why you always act a fool like that?\"\n'Cause I went to Compton High Crip School like that\nI was Blood and I ain't really like blue like that\nThey was Crippin they ain't give a fuck who like that\nThem niggas jumped me, why they have to do a 'Ru like that?\nNigga went and got the homies and we flew right back\nThey C like that, we B like that\nWe trip like that cause LA sick like that\nWe Blood like that, we Crip like that\nThe blunt lit like that, we out\n\n[Outro: will.i.am]\nWhen you ready, lemme know\nWhen you want it, lemme know, I got it\nWhen you see me, congratulate a nigga, don't hate\nNiggas will always be niggas, yep, true\nThat's why I don't trip on these niggas, would you?\nNiggas is wild like gorillas that's stuck in that zoo, yep\nWhat happens when niggas unite and start making them moves\nDon't trip", "image": "https://images.genius.com/f5bd9dcb51fd19e06b10b2ae0e3620cf.1000x1000x1.jpg"}], "artist": "The Game"}