{"songs": [{"title": "Malcolm", "album": "Supreme Clientele", "year": "2000-02-08", "lyrics": "[Intro: Malcolm X sample & Ghostface Killah]\n\"So they try and project the image, to the public\"\n(Uhh)\n\"That this- this is being done by\"\n(Speak brother Malcolm, speak)\n\"THIEVES and thieves alone! And they ignore the fact that no, this is not thievery alone. It's a- It's a\"\n(True indeed)\n\"Corrupt, vicious, hypocritical, system. That has, CASTRATED the black man. And the only way the black man can get back at it is to strike it in the only way he knows how.\" *audience claps*\n\n[Verse 1]\nAyo\nI'm like Malcolm, out the window with the joint\nHoodied up, blood in my eye, I let two fly\nLike fuck it, *2 gunshots*, look how these niggas duck shit\nOne kid hollerin', \"What!\" Lookin' up, he the big wig\nFake ass cat, low life, sodomized mind\nBeatin' niggas, big bricks of bread, sell them as dimes\nHis feet hurt, networkin' he get no work\nYo, smack him where his hand hurt, fuck what he worth\nYo, he sucked his thumb, Slew footed kid, laced with the pink gums\nStuntin' to my Baltimore niggas that he on the run\nPlus he ill on the drums, heartburn for life, calcium man\nWatch him grab the Tums, he's a front\nPigeon-toed Tyler's sister with the fat ass\nShow hash for Hines up the block plus he smashed her\nBig Buck did him something deadly, act premeditated\nBuck 60 strike was the medley\nNice like Van Halen, seen him at the tunnel with his skin peelin'\nDid two days, thought he was jailin'\nYou get close, look at his hands\nThat's the same kid that cut his wrists, talkin' bout \"The cuffs did it\"\nHe bantam weight, frontin' majorly, eyes like Sammy Davis Jr\nRounded off with a fade, G, he sport the Bob Hope classics\nRan down Asics, K-mart, the short sleeve shit be the basics\nHe eat hams, shitted on himself twice, big-hatted Jews\nRushed the nigga out in Crown Heights\n\n[Chorus]\nYo let me tell you how the game go\nWe gettin' rid of all the prostitutes\nTony wants the streets back fo sho\nToo many hustlers, too many thieves\nWe're fuckin' up who's willin' to fight, and teach the seeds?\nToo much TV, guns and robberies\nLust and greed and hate the 4 devils' jealousy\n\n[Verse 2]\nYo I-Cham punched Mase in his face over some bullshit\nThe other night they kidnapped his brother pokin' it with knives\nIt's rainin', 85 degrees kinda muggy\nOne of the nights they thrown in his face it's real ugly\nYo we up in Jonesy's posin', all these niggas know me\nFrom fuckin' wit Un and these niggas, heavy parolees\nYo we played the speaker\nAnd from a distance we could see these chains\nThe P slayed, flat on his chest, was two planes\nAshy hands yo, no need for rings at all\nHe just cracked the V8 backed up, leaned against the wall\nLook at Flower, he just came home, he on like a fuck\nDid a dime for holdin' up the guards up in the armored truck\nTen years later, son 280 on the weight tip\nHe throwin' up six plates plus, he studied Matrix\nHe's a wally horse, shout it out, sweatin' through his valor\nCock-eyed nigga, back up his neck, he had sores\nSammy eagerly, rode up on him, toxi off the turkey with the joint\nOn him\nFlower look his man stood up before him\nThe bitches hit the table, Jah king stripped off his cables\nShots went off, Sam'll get a chance to make his debut\nFlower grabbed Tiff his man with the sideburns, hat fell off\nWe noticed ring-worms, he hid behind Rich\nC-Allah hit the light switch, young girls were trampled\nIn the measured pool, pistol with Mase, and broke the handle\nDesperate crawlin' to the door on all fours\nShim kicked the jukebox the theme song rode in was \"It's Yours\"\nOh my goodness, Ba grabbed the Mo bottle thrashin'\nHe layin' like a gay models shoutin' out Sebastian\nHe smiled with his teeth missin', beggin' for mercy\nNo more god, the 68 thousand down at pier 3\nOut came the cannon, whistled out zaggin'\nCham snatched his flag four big rocks enter the dragon\nIt's over, another story told\nLyin' with the snakes, tongue kissin' cobras\n\n[Chorus]\nYo let me tell you how the game go\nWe gettin' rid of all the prostitutes\nTony wants the streets back fo sho\nToo many hustlers, too many thieves\nWe're fuckin' up who's willin' to fight, and teach the seeds?\nToo much TV, guns and robberies\nLust and greed and hate the 4 devils' jealousy\n\n[Outro: Malcolm X sample]\n\"So they try and project the image, to the public\nThat this- this is being done by\nTHIEVES and thieves alone! And they ignore the fact that no, it is not thievery alone. It's a- It's a\nCorrupt, vicious, hypocritical, system. That has, CASTRATED the black man. And the only way the black man can get back at it is to strike it in the only way he knows how.\" *audience claps*", "image": "https://images.genius.com/f0013dbd91dff7fd77352a0283ad6ec5.1000x1000x1.jpg"}], "artist": "Ghostface Killah"}