{"songs": [{"title": "Amplified", "album": "Stoned Raiders", "year": "2001-12-04", "lyrics": "[Intro]\n* \"Say what?\" scratched repeatedly *\n\n[Sen Dog]\nI be that, short-temper, hostile rhyme bringer\nLifestyle gone wild, similar to rock singers\nCheck me on the big screen, livin' out my dreams\nCypress, Assassins, SX, latin thug thing\nFools think they get bad, I ain't really with that\nFlavour of the month, bro, (?) try to dispatch\nAlways got the good badge, take it to the head\nGot me wasted like Jerry from the Grateful Dead\nDon't trip, get a grip, be strong and don't fake it\nOr else you get beat down, an' stripped butt-naked\nI just kick the lyric, straight from the spirit\nYou can tell I got soul first time as you hear it\n\nChorus - Sen Dog and B-Real (repeat 2x)\n\nWelcome to the show, all come inside\nYou can hear proper sound when it's Amplified\nYou wanna party with the best and say \"fuck the rest\"\n'Cos we take away ya stress and never settle for less\n\n[B-Real]\nWhen you deal with the Hill, keep your mouth still\nIf you rely on your skill then rely on your steel\nIf you have no ideal, or any thoughts to feel\nWhat you sought was real, to give 'em slots to fill\nBusters stop to deal\nBut I face them, quicker than takin' a box of pills\nNow you gots to chill\nGet cops and sheilds, steady, hark the (?)\nIf they're lookin' for prey, ready to stalk and kill\nAs I lock the wheel, don't you mock the drill\n'Cos I'll cock my steel, make you drop and spill\nGot no mercy unless you talk to deal\nQuit talk and kneel, you won't top my will, bitch!\n\nChorus (repeat 2x)\n\n* \"Say what?\" scratched some more*\n\n[Sen Dog]\nAin't no-body better, on that you can bet   (CY-PRESS!)\nWanna see a dope show? Put your money on my set\nReal emcees and real DJs\nReal South-siders from the heart of LA\nNow, back in the day we had big sucess\nAnd it's like that now and we won't settle for less\nYou can beat the LB from the new latin lingo\nNowadays you nothin', without a hit single\nTime to get loco, and put bodies in motion\nHit the stage in a rage, and start up a commotion\nNo I ain't jokin, see my mic smokin'?\nI slam it like the art and make sure it's broken\n\nChorus (repeat 2x)\n\n*scratching to fade*", "image": "https://images.genius.com/b0e5201adaaa026dce5a41c0cb1c6c5c.300x300x1.jpg"}], "artist": "Cypress Hill"}