{"songs": [{"title": "Scary Movies (Sequel)", "album": "Build and Destroy", "year": null, "lyrics": "[Intro]\nWhat's your favourite scary movie?\n\n[Bridge]\nLive from the dungeon, we coming\nY'all best be running, we coming\nY'all don't want none of this gun and\nI don't know why y'all keep frontin'\n\n[Verse 1]\nI'mma scare the socks off you for sure the shock stops all you\nKnock ya lox off and chop your watch off you\nLurking in the back like a crook in the black of the bushes\nWith the rats, with a axe, and the stacks of wood is\nBy the garage, the Mirage tracks the shadow\nMy weapon is large with bodies, I'm strapped for battle\nMy soul is in the crossroads, it hides the feeling\nSomewhere deep inside the spirit to rise the killer\nI'm too distant to talk, my vicious assault\nIs inflicted in parts to slit you and stick in your heart\nI got nothing to lose and nothing to gain\nOnly way I'm dying is up in flames, I'm stuck in the game\nLook at you busting ya thang\nShots only get stuck in my frame, I got you not trusting ya aim\nI never speak but you can hear me breathe at night\nWith a hunger and greed for life 'til this eve was right\nI'm a true killer, a troop risen to do business\nLive on a booth on a river drooped with news clippings\nI only come out when it's time to run out and find\nAn innocent victim inside one house with blinds\nI'm Freddie Kruger, Jason and Scream chasing a dream\nLooking for a scene to take to the extreme for the mean\nYou better carry your Uzi's is rare to do me\nEverybody's scared to view me, I'm Scary Movies\n\n[Hook]\nY'all want drama? Wanna make a scary movie?\nRappers coming in with their team and carry toolies\nYou can jump right out of the screen and barely move me\nWe hard hitting, directing and starring in it\n\nYo niggas from the Wall don't bleed, Dirty Dozen niggas don't bleed\nRoyce 5'9\" don't bleed, Rock City niggas don't bleed\n\n[Bridge]\n\n[Verse 2]\nAll this room in this big house you chose the attic\nYou running slower and slower so you froze in panic\nI'm wearing a white mask, black cloak and dagger\nYou scatter hoping for life, grabbing ropes and ladders\nUnder this robe, I'm tatted up, automatic'd up\nI'm mad as fuck, I'mma kill no matter what\nYou - live in the wrong house, at the wrong time\nYou've - answered the call so you all mine\nYou can't put fear in the heart of the heartless\nGot a list of names just don't know which one to start with\nAt your house, staking it out, posing as carpenters\nLooking for closets and house guns with cartridges\nI'm low down and stressed, I go around the rest\nOf the house looking for Granny to throw down the steps\nAnd when it's your turn - oh you know it's tragic\nAnd the music in the background is so dramatic\nI'm tryna lift you off your feet - hope you know gymnastics\nTry to - soak the mattress with rope molasses\nYou try to - cover your head like a prophylactic\nNext time somebody calling your phone, don't answer it\nHello? Hello?\n\n[Hook]\n\n[Outro]\nWe making names for each other like the Wayans Brothers\nRock City niggas always name each other\nNiggas got crews, don't even claim each other, 2000", "image": "https://images.genius.com/d86b45b993cdf0c53559e740521a4bba.500x494x1.jpg"}], "artist": "Royce da 5'9'’"}