{"songs": [{"title": "Pussy", "album": null, "year": null, "lyrics": "[feat. 2 Chainz]\nOk, I gotta come and say 'whaddup? '\nMake sure they heard my own right\nFirst I get my dick suck then heading for a back ride\nTurn on to her back side, then I put that pimpin riddle\nMaking sure she act right\n\nThat pussy, that pussy, that pussy good\nThat pussy, that pussy, that pussy good\nThat pussy, that pussy, that pussy good\nThat pussy real good, I've been real good\n\nMe, I'm from the East side, said she from the South side\nOn like a drive much, total visit my sight\nHave to switch off my location, my house is her best nation\nSaid she had no fucking gas so I picked her up from the mall station\nThere she got that feeding pussy, I'm a go feed my need of pussy\nEvery other day I feed a pussy, never ever when I eat the pussy\nYour hoe is my hoe\nYou can't go home with your hoe\nDisrespect I cross the line, nigga I dull her\nLife's candy, long hell or short hell I don't care\nBig brushes, though, studio, everywhere I go it's all good\nChillin' in my ride with my bitch on the side\nStop talking, suck some, you're fucking up the vibe\n\nOk, I gotta come and say 'whaddup? '\nMake sure they heard my own right\nFirst I get my dick suck then heading for a back ride\nTurn on to her back side, then I put that pimpin riddle\nMaking sure she act right\n\nThat pussy, that pussy, that pussy good\nThat pussy, that pussy, that pussy good\nThat pussy, that pussy, that pussy good\nThat pussy real good, I've been real good\n\nI've been fucking all night, I got a hangover\nI am so fly, I need a land on\nI don't eat, take you bitch when I wake up\nHit the door and then turn around like\n\"What you lying niggas talking about? \"\nYou fuck with me, I don't fuck with you\nFerrari Coop, hot pursuit\nPop and learn and I'm popping too\nAs far this chains I'm rocking to\nShare the stone I'm coping to\nThat's one for me, one for me, it don't run for me\nLikely, no artifacts but a bunch of dudes\nBunch of weed and a bunch of lean\nTrue religion, bunch of jeez\nGucci stole, bunch of gees turning head on women like a murder scene\nAnd I do what I gotta do when I gotta do\nWhen she's with me she won't answer phones\nI do make a come to, make a kung fu with no bro and no panties on\n\nThat pussy good, that pussy moist, twenty two, she from Detroit\nI beat it up, yeah, beat it up, in the mirror you can see yourself\nFirst I get a head gang, yeah, her girlfriend ate it up\nGot a white girl, there's no cocaine, me had just a weed dope\nAll girls there one time, I'm a pee at it and pee white\nShe out of sight, she out of mind, I'll rap until don't see why\nFace down, hands on, beneath that she needs the cash up\nHe talked to finesso, my diamond cup, my lascar\nHeidy-ho, I'm a smash up\nWe boast up till we toast them up, heard a charm about five honey\nNigga, it ain't no cost, but\n\nOk, I gotta come and say 'whaddup? '\nMake sure they heard my own right\nFirst I get my dick suck then heading for a back ride\nTurn on to her back side, then I put that pimpin riddle\nMaking sure she act right\n\nThat pussy, that pussy, that pussy good\nThat pussy, that pussy, that pussy good\nThat pussy, that pussy, that pussy good\nThat pussy real good, I've been real good\n\nI jig me got me on test basis on my iPhone, said I'm coming over\nYeah, girl, that's cool enough\nBut you got a brain, need a bunch of rubbers\nHow many you need? Like one or two. Mother of fact, two are good\nI'm a use any last one, cause that pussy is too good\nYeah, I ain't none of them other niggas\nYeah, I'm way above them niggas\nShe make them niggas drop a cup of jizz\nMe and my niggas been escape for free\n\nHalle Berry sequel made me feel good\nI said okay girl that pussy real good\n\nOk, I gotta come and say 'whaddup? '\nMake sure they heard my own right\nFirst I get my dick suck then heading for a back ride\nTurn on to her back side, then I put that pimpin riddle\nMaking sure she act right\n\nThat pussy, that pussy, that pussy good\nThat pussy, that pussy, that pussy good\nThat pussy, that pussy, that pussy good\nThat pussy real good, I've been real good", "image": "https://images.genius.com/f82a00deb2e816cc89005a9839eead69.1000x1000x1.jpg"}], "artist": "2 Chainz"}