{"songs": [{"title": "We In Here - Dirty Version", "album": null, "year": null, "lyrics": "Game time... let's go... WE IN HERE!\nIt's time to bring the East Coast back baby!!\nNew York (the dog) WE IN HERE!\nWe talkin' 'bout the Swizz and the dog wasn't gonna terrorize y'all niggas?\nYou can't be serious!\nRuff Ryders!\n\nWe gon' get it, get it started, get it started again\nWe gon' get it, get it started, get it started again (We in here!)\nWe gon' get it, get it stoppin', get it poppin' again\nWe gon' get it, get it poppin', get it poppin' again (follow me now!)\nWe.we.we.we.we.we.we.we.we.we.we.we.we.we.we IN HERE!\n\nSix number one albums, imagine that\nCats is sick, 'cause dog got his swagger back\nIf that shit go, naw I ain't havin' that\nBut they don't want it, I'ma still grab the bat\nThink I give a fuck? I'ma \"get down,\" \"go hard\" type of nigga\n\"Bring it to the yard\" type nigga\nFour, four, one, O, five, fourteen thousand\nTen, ten haze the street with the housin'\nC-76, remember me bitch?\nI'm that nigga that for life, gon' be yo' enemy bitch\nFuck around, got my weight up, weight up, brought up\nNiggas gettin' ate up, straight up, what the fuck?\nCome on vodto, this is just not your day\nSo stop tryin' to be macho, aight yo?\nYou don't wanna fight yo, I get's my strap on\nPut niggas' lights out clap on!\n\nWe gon' get it, get it started, get it started again\nWe gon' get it, get it started, get it started again (We in here!)\nWe gon' get it, get it stoppin', get it poppin' again\nWe gon' get it, get it poppin', get it poppin' again (follow me now!)\nWe.we.we.we.we.we.we.we.we.we.we.we.we.we.we IN HERE!\n\nWe don't bark no more, we bite\nMotherfucker from the heart, we can get this war on tonight\nAin't nuttin but a thang 'cause the camp gets busy\nFuckin' wit' the 'Line? It's a rizzy\nShit ain't the same, cats done changed the game\nFuck it, all y'all niggas is lame, what's my motherfuckin' name?\n(Come on) Twenty million records sold\nWhile y'all niggas is strugglin' to go gold!\nCome on papi! Can't none of y'all niggas stop me\nYahmean? Y'all niggas is sloppy\nWhat would the game be without me? Nada!\nCats talk about a whole lotta, product\nGucci and scota, Louie Vuitton\nCome on, what up with what's really goin' on?\n\"What's hood?\" Cats ain't killin' nuttin but a few minutes\nI'm about to bury a box wit'chu in it\nSo if you got's the whip, you better get on\n'Cause if I pull up on, it won't be for Grey Poupon\n\nWe gon' get it, get it started, get it started again\nWe gon' get it, get it started, get it started again (We in here!)\nWe gon' get it, get it stoppin', get it poppin' again\nWe gon' get it, get it poppin', get it poppin' again (follow me now!)\nWe.we.we.we.we.we.we.we.we.we.we.we.we.we.we IN HERE!\n\nCats playin' games, so I'm goin' raw\nRun up in that fuckin' building, kick down the door\nY'all don't want no fuckin' problems wit' X\nY'all don't wanna see them four-legged piece, wit' them collars on they necks\nWit' them niggas downstairs wit' the tech, you know the rest\nFuck it, blow it y'all niggas, bitch I take respect\nDog's shit hot, that's why y'all cowards froze me quick\nI pop up, catch niggas on some cozy shit\nWith Chinese slippers and silk scarves on\nNigga out here tryin' to get his bark on, wonder why the dog gone\nI couldn't take it, deface it, that nigga make shit\nThat's somethin' that'll happen, nigga wanna brace it\nAnd for the record, what you gonna do to fill up my spot?\nI ain't gonna front, that? replace shit, was kinda hot\nNot!! How you gonna jack Will Smith for a beat?\nThat's like tryna jack me for the streets! It ain't happenin'!\n\nWe gon' get it, get it started, get it started again\nWe gon' get it, get it started, get it started again (We in here!)\nWe gon' get it, get it stoppin', get it poppin' again\nWe gon' get it, get it poppin', get it poppin' again (follow me now!)\nWe.we.we.we.we.we.we.we.we.we.we.we.we.we.we IN HERE!\n\nWE IN HERE!\nWE IN HERE!\nWE IN HERE!\nWE IN HERE! WE IN HERE!", "image": "https://images.genius.com/1bcf43b1cc0f34db6cd70e1a63c8b84c.464x464x1.jpg"}], "artist": "DMX"}