{"songs": [{"title": "Out Do Ya", "album": "Everybody Looking", "year": "2016-07-21", "lyrics": "[Verse 1]\nIf I ain't a millionaire then my lil boy can grow a pussy\nIf Guwop ain't bout his business then Popeye must be a sissy\nAnd if you ain't getting money I don't wanna talk to ya\nCause how you let a nigga in the feds out do you\nI'm not politically correct cause bitch I ain't no politician\nI can't hang round none of you niggas cause you niggas might be snitchin'\nBut I ain't gotta deal with you, nigga I don't eat with you\nBut how you bitches let these bogus ass niggas sleep with you?\nI can't live with you, lay with you, take that pussy with you\nI can't put up with you, play with you, ain't got free dick to give you\nThey tried to be cool with ya, chill with ya, take no pictures\nWhat the fuck I look like standing by you police ass niggas\n\n[Hook]\nHow you let a nigga in the feds out do you?\nHow you let a nigga in the feds out do you?\nHow you let a nigga in the feds out do you?\nHow you let a nigga in the feds out do you?\nHow you let a nigga in the feds out do you?\nHow you let a nigga in the feds out do you?\nYour pockets in the red and I don't wanna talk to you\nHow you let a nigga in the feds out do you?\n\n[Verse 2]\nI'm laughing to myself cause these rappers so broke\nThey sold no dope they don’t want no smoke\nHow they let a nigga in the feds out do em\nI ain't got no rap, I let my chopper talk to em\nA nigga need me, I don't need no nigga\nI'm the shooter and the boss, I don't need no killer\nThe money that he make don't make me richer\nI'm the slickest nigga walkin' I don't need no feature\nSittin on the hood of my brand new Bentley\nOld neighborhood with some brand new jewelry\nBig diamond rings like a old school preacher\nBitch let a nigga out the feds come beat ya\n\n[Hook]\nHow you let a nigga in the feds out do you?\nHow you let a nigga in the feds out do you?\nHow you let a nigga in the feds out do you?\nHow you let a nigga in the feds out do you?\nHow you let a nigga in the feds?\n(Damn)\nHow you let a nigga in the feds out do you?\nYour pockets in the red and I don't wanna talk to you\nHow you let a nigga in the feds out do you?", "image": "https://images.genius.com/617f679ecf3e40194443f9c9117e6712.1000x1000x1.jpg"}], "artist": "Gucci Mane"}