{"songs": [{"title": "Back To Business", "album": null, "year": null, "lyrics": "[Produced by Swiff D]\n\n[Verse 1: Justus (Dr. Dre)]\nThey've been wondering if I'm gon' show\nShit you already know-ow-ow-ow\nWhere you been? Where you at? Where you headed?\nThis shit started to disappear oh no, no\nI'm right here, yeah, take this shit right back to the basics\nSound like I'm right back in the basement\nTryna to put my neighborhood on\nSix in the morning (Six in the morning)\nUntil six in the morning (Best believe I'm on it)\nMan I'm working so hard\nWhen the check hit the bank, shit, I ain't even notice\nI live in the future, I'm blind to the moment\nI, I, you ain't gotta stay\nOh you ain't gotta stay around we own it\n\n[Verse 2: Dr. Dre]\nI remember when I was young just a front runner\nI was fucking with them drums like every summer\nHomies couldn't make it out the hood, make a nigga wonder\nBut I couldn't let Compton take a nigga under\nNo way, no how, can't stop\nHad, bigger dreams for this hip-hop\nI'm happy, it was music and not Ziplocs\nAnd now we, bringing crowds like it's woodstock\nI might as well wipe down the crown I done put up in the attic\nI don't play around, lotta niggas coming through the door\nNot too many stay around\nLot of artists made it yeah\nGod damn man I made a sound\nOh you ain't never seen a legend do it?\nHold up homie wait around\nI've been on the verge since a nigga put it down\nIf we talking numbers, fuck Billboard charts\nPutting for start with the bank accounts\n\n[Hook: Victoria Monét (Dr. Dre)]\nI've been away\nBut I think I'm doing better\nAnything you do can't impress us\nI won't let up on it\nWhat are you gonna say\nAnd I think because they hate us\nAnd the fact that they can't break us\nI will never let up\nI'm going, yeah I'm going\n(Best believe I'm going)\n(I'm going) back\nIt's time to get back to business\n\n[Verse 3: T.I.]\nThis shit realer than rap\nSomewhere trapped where you can find me at\nGot thirteen in my strap\nAnd I kick it, do it with me whatever town we at\nI'm killing these niggas was never feeling these niggas\nWent from a million to ten figures I grow\nGetting back to the business in the back of a Bentley\nI'm thinking damn how far can I go\nWell, if my nigga Dre can get a bill\nIt let me know that there's hope for a nigga still\nAnd many more showing love for my art form\nWhen the ATL the trap shit was on board\nGive a raw nigga money when they let me in\nIf it wasn't for me they would have let me sit\nExplanation for all the demolition we did\nI'm grinding handling my business nigga\n\n[Bridge: Sly Piper]\nHow many miles in the air\nOne million I'm stacking up this paper\nUp up and away-er\nOne way ticket to the ozone layer\nDon't you wanna roll where there ain't no head room\nTake it to another atmosphere\n\n[Outro: Sly Piper]\nSmoke this, smoke this\nRoll it up, roll it up, get a lighter\nSmoke this\nRoll it up, roll it up, get a lighter\nAnother atmosphere\nI can change your atmosphere\nGet a girl for my Johnson\nRoll it up, smoke this\nBreak it down, roll it up, get a lighter\nSmoke this, roll it up, get a lighter\nI can change your atmosphere\nSmoke this", "image": "https://images.genius.com/bf3badae49c33b583126057638078bd8.576x576x1.jpg"}], "artist": "Dr. Dre"}