{"songs": [{"title": "Angel", "album": "...And Then There Was X", "year": "1999-12-21", "lyrics": "[Intro: Regina Bell harmonizing while DMX speaks]\nWhat good is it for a man to gain the world\nYet lose his own soul in the process?\nGod loves you, yes he does, said you're alright with him\nI wonder…\n\n[Chorus: Regina Bell]\nI know you've never seen him\nBut don't fight with him\nYou're gonna make it through the night\nTo the light with him\nYou're alright with him\nI said you're alright with him\nI know you've never seen him\nBut don't fight with him\nYou're gonna make it through the night\nTo the light with him\nYou're alright with him\nI said you're alright with him\n\n[Verse 1: DMX]\nI'm callin' out to you, Lord, because I need your help\nSee, once again I'm havin' difficulty savin' myself\nBehavin' myself, you told me what to do, and I do it\nBut every and now and then it gets a little harder to go through it\nLosin' friends day by day\nI'm in so much pain when I'm here, Lord, please take me away!\nI put you here to do a job, and your work ain't done\nTo live is to suffer, but you're still my son\nAnd there will be a time when you shine as bright as the stars\nBut there won't be a his or hers, just ours\nThen you'll see what I've been tryin' to show you all these years\nDo the right thing, 'cause after the tears come the cheers\nI will, my Lord, with my heart and my soul\nThat's gonna be how I roll, from now until I mold\nLead and I'll follow, you take away the sorrow\nI'ma sleep on what you said and holla back tomorrow\n\n[Chorus: Regina Bell]\nI know you've never seen him\nBut don't fight with him\nYou're gonna make it through the night\nTo the light with him\nUhh, you're alright with him\nI said you're alright with him\nI know you've never seen him\nBut don't fight with him\nYou're gonna make it through the night\nTo the light with him\nUhh, you're alright with him\nI said you're alright with him\n\n[Verse 2: DMX]\nI want you to know, Lord, that for what you given me I'm thankful\nSincerely, from the bottom of my heart, I'm grateful\nYou gave us power in our words, so I think before I speak\nAnd that way when I speak, they know I'm here to teach\nCan't tell 'em nothin' wrong, 'cause I love 'em too much\nI reach a lot of people, and Lord, I'm lovin' the touch\nBut deep inside, I've got somethin' that's workin' against\nEverything I know is right, what I know makes sense\nThat's when you must fight harder than you've ever fought before\n'Cause what you've got goin' on inside you is a war\nBetween good and evil, be careful of those who wanna be you\nThey smile but are not really happy when they see you\nBe careful of the ones that always wanna get you high\n'Cause when the time comes, that one'll let you die\nListen to me! I'm here, but I can only help you\nIf you want me to help, what do you want for yourself?\n\n[Chorus: Regina Bell]\nI know you've never seen him\nBut don't fight with him\nYou're gonna make it through the night\nTo the light with him\nYou're alright with him\nI said you're alright with him\nI know you've never seen him\nBut don't fight with him\nYou're gonna make it through the night\nTo the light with him\nYou're alright with him\nI said you're alright with him\n\n[Verse 3: DMX]\nMy Lord, my savior, don't judge my behavior, but instead\nTake what's in my heart and put it in my head\nSee, I guess I really never knew how proud I made you\nMy life is yours, my soul I gave you\nI don't know if I'll do good enough (He's by your side)\nAnd we both know the hood is rough (Right by your side)\nSometimes I don't know what to do (X, dry your eyes!)\nBut I know what I gotta do (It'll be alright)\nYou keep givin' me the word, and I'll put it to song\nTalk to me, I'll talk to them, and we can't go wrong\nThis is the start of somethin' strong, and this is just the start of it\nPraises to you, my Lord, for lettin' me be a part of it\nI was that kid that, been there, did that\nBecame ashamed so I hid that, but ain't no longer with that\nUse me as an example—if I can do it, then they can too\nWith the Lord behind us, there ain't nothin' that we can't do\n\n[Chorus: Regina Bell]\nI know you've never seen him\nBut don't fight with him\nYou're gonna make it through the night\nTo the light with him (The light with him)\nYou're alright with him ('Cause he loves you)\nI said you're alright with him\nI know you've never seen him\nBut don't fight with him\nYou're gonna make it through the night\nTo the light with him\nUhh, you're alright with him ('Cause he loves you)\nI said you're alright with him\n\n[Outro: Regina Bell]\nHe's by your side\nRight by your side\nX, dry your eyes!\n'Cause it'll be alright\nYeah, he's by your side\nRight by your side\nX, dry your eyes!\n'Cause, it's gonna be alright\nYeah yeah, yes it is!", "image": "https://images.genius.com/57efb548310ed90e73d9200fd01a3e59.630x630x1.jpg"}], "artist": "DMX"}