{"songs": [{"title": "Chicken Room", "album": "Trap Back", "year": "2012-02-05", "lyrics": "[Verse 1: Gucci Mane]\nGo! If it’s a coke drought, then why's your wifey coked out?\nButt-naked, snortin’ lines in the dope house\nI’m too far, smoking cigars in the dining room\nGot birds everywhere, that’s why it’s called the dining room\n300 pounds wrapped tight, I need every room\nAnd move the clothes, I put the money in the closet, fool\nI'm not a handyman, but Gucci keeps a lot of tools\nI teach niggas how to cut it, like it’s barber's school\nWait a minute, just be patient, I may take a minute\nI’m in a dark and tinted Mercedes, it cost a pretty penny\nI’m in the kitchen and I’m water-whippin\nI hit it for the freak, ‘cause homey bought a half a chicken\n\n[Hook:]\nGot 6 goons countin’ money in the living room\nGot birds everywhere, I call it the chicken room\nAnd I'm about to move my bed into my kitchen soon\nGot birds everywhere, I call it the chicken room\nGot 6 goons countin’ money in the living room\nGot birds everywhere, I call it the chicken room\nAnd I'm about to move my bed into my kitchen soon\nGot birds everywhere, I call it the chicken room\n\n[Verse 2: Gucci Mane]\nI'm in my Phantom with my madam and a fat blunt\nI dump the ashes in an empty cup of grape fruitpunch\nI'm having fun, prima donna\nSellin’ pills and chron’\nI need it by the ton\nI want it wit a grape one\nMe and Rock from the block, that’s a great bond\nI'm in the Zone 6, I'm coolin' with my black gun\nTrue religion, .50 is my true religion\nAnd there ain’t no robbin’ me\n.50 in my robbin’ jeans\nAin't no \"I\" in team\nYou want 1017\nYou know my regime\nGot money, all means\nI bring it to you clean, I bring it to you raw\nI got a 100 things, I'm tryin’ to numb your jaw\n\n[Hook:]\n\n[Verse 3: Rocko]\nHey, R-O-C the Don, I'm flyer than an owl\nWho that say they got new falcons? I’m passing out right now\nI quote my mouth when I talk. These niggas scary\nRepeat whatever they hear, these niggas parrots\nEyes of despair, I can’t spare it\nHas to get my coach\nThat’s why I ?rode the vultures\nD.E.E\nI’m a pescetarian, I don’t eat beef\nGo google that word\nMy favorite food is birds\nThey tryin’ to get the formula\nBut I’m on to them\nThey know I got them 5 birds, and they wantin’ them\nThe Pontiacs, where the fuck I'mma put this money at?\nLook, now I got 30 from ?sealings this year, 100 mill\n\n[Hook:]", "image": "https://images.genius.com/acd9babb757092a69a2f3c9e7eb4a9ad.320x320x1.jpg"}], "artist": "Gucci Mane"}