{"songs": [{"title": "Eddie Kane (OG Version)", "album": null, "year": "2018-09-29", "lyrics": "[Verse 1: ScHoolboy Q]\nTop rack nigga and the money came with it, huh\nNew bitch with me, Hope the booty came with it\nCame with it, uh, yeah, rims flying down the road, huh\nFive in the morning, feds knockin' on my door, huh\nToilet full of dope, while my burner knee high\nTell me put the gun down, I'm probably gonna die\nI know, I know, big guns sell dope\nEddie Kane's little bro, hundred k, one whip, hah\n\n[Bridge: Dem Jointz]\nOpen Eddie Kane for hire, huh!\nBeen tryna get rich for hours (Well, we-ell)\nNights like this I wish\nCocaine drops would fall\n\n[Verse 2: ScHoolboy Q]\nYo! Yo, yo\nEddie Kane ain't closed, baby powdered nose\nI was ten at store the homies taking starter coats\nPistol clearing out the crowd, way before I had a show, hah\nCopy! Cook it, rock it, bop it!\n'Cause I'm broke looking dirty, hope I die before I'm thirty, uh\nRobbing, the killers gettin murdered, I give and go when I serve ya\nAfter curfew, I know, behind a bush on your porch\nYour chain getting borrowed, gotta re-up tomorrow\nFigg still goin' get it, I break it down like a chemist\nHere I'm rhymin' the seventies, crack rock was the eighties\nReason ya moms out lately\nReason ya brother's a crack baby\nIn the nineties sellin' pills to the thousands\nI'm young Eddie! Hah!\n\n[Bridge: Dem Jointz]\nOpen Eddie Kane for hire\nBeen tryna get rich for hours (Well, we-ell)\nNights like this I wish\nCocaine drops would fall\nWoo!\n\n[Verse 3: ScHoolboy Q]\nYo, uh, yo, uh\nNeed a car with no mileage, Kristoff on my palate\nMy cigar full of cabbage, came from the dirt to the carats\nGetting dirty dollars, four different baby mommas\nDope between the speakers, so fuck you, Mr. Teacher\n'Cause the paper, I ace it, lead, they tried to erase it\nBut I'm still standing, they mad and everything\nNothing given, I'ma take it first\nOn the trees like a hammock, flip the work behind the campus\nYoung Groovy turn your hood into a movie\nGang bangin', dope slangin', GTA-ing\nShoot the whole club up, fuck tryna sneak the K in\nOn the road to riches\nThank you Mr. Reagan, you helped them dollars rake in\nAnd to my uncle that fucked up the family\nThat shit that you was smokin', I was pushin'\nResidue lie on the cushion\nI'ma blame it on your ass cause I ain't gettin' whoopings\nAnd your proof is in the pudding\nI'm just grandma's baby, Eddie Kane\n(Eddie Kane, Eddie Kane) Ugh\n\n[Bridge: Dem Jointz]\nStanding in the white light\nAnd we on! And is there any other smokers in here? Huh!\nAnd we on! And is there any other smokers in here?\nAnd we on! And is there any other smokers in here?\nKeys open doors on the road to my heart\nDreams on the floor, bet a nigga stay high, and I know\nWhat makes the world go 'round, go 'round? Woohoo\nWhat makes the world go 'round, go 'round? Woohoo\n\n[Outro]", "image": "https://images.genius.com/e79de87534188a7a50d154e7eb1c6a42.1000x1000x1.jpg"}], "artist": "ScHoolboy Q"}