{"songs": [{"title": "U Can’t Resist", "album": "Da Real World", "year": "1999-06-22", "lyrics": "[Intro: Baby]\nUh, what's happenin? What\nUptown, New Orleans in this bitch with VA, you understand?\nWith this hot girl, Missy\nFuckin with these Uptown Guerillas, you dig?\nIf it don't make dollars, it don't make sense\nDo yo' thing girl\n\n[Verse 1: Missy]\nY'all don't wanna gimme my props?\nI'mma have to lick two shots on my Glock\nPop-pop the enemy 'till he drop\nMake his whole body go hibbie-to-the-hop\nWell I won't stop 'till I get up to the top\nGotta blow any other state off the block\nAnd I got a whole lotta chedda in my pock's\nBetter gimmie giimme five mics, gimme props\nSay you sick of my clique and my shit\nCause I got a whole lotta hits and no tricks\nJust a bass line, few snares, few kicks\nMake the whole industry wanna go and bit\nI say you sit, we sit, I sit\nWhile I go shit on a mix like this\nSay you spit, I spit, we spit\nBut you can't fuck with a nigga like this\nCheck me out\n\n[Hook]\nHatin' on us but ya can't resist\nIf you come hard, better come legit\nWe gon' talk shit cause we confident\nIf you think not, then you bound to sit\n\n[Verse 2: Missy]\nY'all don't wanna put me on front\nOn the front page, all the shit I don' done?\nNow you wanna fuck around and grade my shit?\nLet's talk about the million niggas who bit\n\nIt's only one Timothy from the V\nAnd the whole industry goin' beep-beep\nNow I gotta go change up my beats\nSo another nigga won't duplicate me\n\nYeah I got styles, got shows, videos\nAnd my shows, it grows, it grows\nAnd I sing, I flow, I blows\nAnd I know y'all niggas know\nWhen I come swift with the one-two kick\nIf ya got a blunt, got a light, got it lit\nYeah, don't stop, won't stop, won't quit\nAnd I made 1.6 admit, check me out\n\n[Hook]\n\n[Verse 3: B.G.]\nI'm that nigga that tote them AK's\nB.G. is what they call me\nI be in them project hallways\nBeef with me, you gon' be sorry\nMe and my niggas'll shut yo' block down\nWe got K's so, put them Glocks down\nYou scared to come outside\nThem Hot Boys got you on lock-down\nThis nigga here from CMB\nRoll with a clique about 20 deep\nCause I made a mill', it don't mean\nI ain't gonna keep it real with my peeps\nAll I have is thugs in my clique\nAll my nigga's, they come off the street\nNow all of a sudden ho's on my dick\nCause I'm on BET and MTV\n\n[Verse 4: Juvenile]\nIt ain't no secret, this nigga be project\nGetting paid, that's what's my object\nAin't none of you nigga's gon' stop this\nCause I'm 'bout makin' a profit\nI'm all about getting it locked, dog\nDon't wanna be on the block, yo\nCause bitches be makin' them cop calls\nWhile I be makin' drop offs\nMannie Fresh, he hooked me up too\nTo the playa hater's I say, fuck you\nYou needs to worry 'bout you\nInstead of what Tanut\nJuvenile don' hooked up with Missy\nBitches gon' hate me, bitches gon' dis me\nAlota you nigga's gon' miss me\nI'mma be here, you gon' be history\n\n[Hook]\nRepeat 1\n\n[Missy]\nIf you come hard, better come legit\n(Say what? Oh, ah huh)\nIf you come hard, better come legit\n(Oh, uh)\nWe gon' show you, so you best believe\n\n[Outro: Timbaland]\nWhat, uh\nWhat, what\nWhat, what\nWhat, what\nWhat, what\nUm hmm, Hot boys\nIt's all gravy\nMissy\nTimbaland\nWe out\nGimme that\nGimme that\nOh, gimme that\nGimme that\nGimme that, gimme that\nGimme that\nGimme that, gimme that\nOh, yeah", "image": "https://images.genius.com/f887ad1c0966679207185a705cecd837.1000x1000x1.jpg"}], "artist": "Missy Elliott"}