{"songs": [{"title": "Pray", "album": null, "year": "1999-04-06", "lyrics": "[Nas]\n\"What we need to be thinkin' about is the future!\nWe don't know what's in store tomorrow!\nAll we can do is just guess! We want the best for tomorrow;\nFor our family, for our children, for our future\nBut if we don't get up andact like we want it\nWe gotta pray to somebody! We ain't to tough to pray!\nYou walkin' around like a gangsta, gangstas pray! Thugs pray!\nTell me somethin'; if you ain't prayin', where would y'all be today?\nWhere would y'all momma be today? How would you be here?\nSomebody prayin' for you, nigga!\"\n\n[Horse]\nI never thought bein' a man you could hang in the end\nFacin' life with no parol and consecut' sentencin'\nGot people witnessin', your co-defendent snitchin'\nYour back against the wall, your left eye is twitchin'\nLoyal ladies usual, a D-and A's the mutual\nScared to face the light of a courtroom site\nRacist cops on each side cause the know I just might\nMake a break for the door but I give it my all\nIf I die in this struggle, give my momma a call\nCause she always left these jewels: what goes up must fall\nSince I fell dead broke, landed in jail\nRefused to face the facts, how wifey skipped to town with the bail\nI'm on my own now, V8, far away from home now\nPalmer wealth state, the law changes each date\nSecret inditements got me knocked, there ain't no price I can pay\nTo get me the fuck up out this shit, so to Allah I pray\nFor forgiveness - Yes, I sinned and I need to be held\nAnd jail ain't no place a black man wanna be killed\nAmen\n\nI only pray when shit is fucked up!\nI only pray when my life is lookin' bad luck!\nI only pray when I'm in mothafuckin' handcuffs!\nCallin' out for someone, somewhere!\nIs there anybody out there?\n\n[Wiz]\nI look up at the sky, why do young niggas die?\nFelt the stray hit me, somebody stay with me\nFallin' to the ground with the sound of a four-pound near me\nBitches screamin', wish I was dreamin'\nI fought a thousand gun fights, near one bullet skipped me\nOn the morning run to get my little sisters Rice Krispies\nPlayed the numbers knowin' that I got my lucky dice wit' me\nSee some niggas I know I can roll - Uh, uh!\nGet them bitches, left all of them broke, left what they smoke\nHoes yellin', 'Watch ya back!'\nBut before I could turn around, before I could I react\nBlaow! Blaow! Blaow! Would you look at me now?\nIs this blood that I feel as I fell to the ground?\nFeel like a head shot but maybe just grazed my temple\nNiggas diggin' in my pockets, sayin' I just rolled a pimple\nYo, my mouth was movin' but it was nothin' I was sayin'\nOnly if they knew deep inside my mind, I was prayin'\nAmen\n\nI only pray when shit is fucked up!\nI only pray when my life is lookin' bad luck!\nI only pray when I need his help the most, what?!\nCallin' out to someone, somewhere!\nYo, is anybody out there?\n\n[Jungle]\nAin't nothin' stoppin' me - Untouchable - Hoes, I fucked a few\nStyle like The Greatest, Ali - Check what the knuckle do\nRock bubblegoose to mink, big links\nYellow ice, live the ghetto life, 'fuck y'all think?\nBravehearted; fuck around, get graveyarded\nDearly departed - The word on the street, I'm a target\nI ain't runnin', I ain't hidin', I'm ridin'\nI be gunnin', y'all be duckin' and divin'\nWhen I come through buckin' this four-fivin'\nRevenge you sayin' you gettin'\nBut shit is gettin' too wild, this lifestyle of sprayin' weapons\nSo I check out the preacher - Life is off the meter\nThoughts of homicide, tryin' to dodge the reaper\nConfessions in a church cause it hurts, behind a curtain\nNigga talkin' to me, but I ain't certain\nVoice sound familiar so I pulled the shade back\nIt was this stupid nigga that I popped way back\nHe set me up, he just got to the preist\nI tried to reach but he had his heat pointed my way\nAnd said, 'Pray'\n\n[Nas]\n\"You've got to pray, huh! I mean pray, pray\nAnd when you pray, you got to look up to the lord, huh!\nYou got to look up and you got to pray for your children, huh!\nYou got to pray for that man in front of the liquor store, huh!\nYou got to pray for that man on the corner! He know he doin' wrong\nBut somebody gotta pray for him, huh! You know we doin' wrong\nBut we gotta pray for ourselves! You know we are headin'\nTo this new millennium, goddamnit! They say a comet is comin'\nTo this world by the year two-thousand, I say it's God! It's up to you\nTo pray to that higher power higher than yourself and humble yourself\nAnd, and, and beg for forgiveness cause it comes back to you!\nA man told me that while he was in jail, all he did was pray\nAll he did was stay in his jail cell and pray to God...\"", "image": "https://images.genius.com/23061dd2dc7e863127db561906debd27.434x434x1.jpg"}], "artist": "Nas"}