{"songs": [{"title": "Hello", "album": "G.O.A.T. (Greatest of All Time)", "year": "2000-09-12", "lyrics": "[Chorus: Amil (LL Cool J)]\nHello, hello (yo, yo)\nHello, hello (yo, yo)\nHello, hello (yo, yo)\nHello, hello (yo, yo)\nHello, hello (yo, yo)\nHello, hello (yo, yo)\n{Call me on the telephone}\n\n[Verse 1: LL Cool J (Amil)]\nWhether, 2-1-2, or 7-1-8\nOr 9-1-4, I love it hardcore\nWhen it's over the phone, it's safe to do it raw\nImaginary worlds we could both explore\n(Hello) Baby what you wearin' right now?\n(Hot pants) My girl ain't around, let's get down\nAnd I hope the phone's tapped, let's pretend you on my lap\n(I'm bouncin' up and down with my shoulders back)\n(Nigga you like that?)  You see I'm runnin' up my bill\nMomma might hear me, but you just too ill\nI got your flicks lined up, stereo low\nCherry flavored grease beneath my elbow\nIf I was there what would you do?  (I'd lay you on your back)\n(Ride or die daddy, and I love it like that)\n\n[Chorus: Amil (LL Cool J)]\nHello, hello (yo, yo)\nHello, hello (yo, yo)\nHello, hello (yo, yo)\nHello, hello (yo, yo)\nHello, hello (yo, yo)\nHello, hello (yo, yo)\n{Call me on the telephone}\n\n[Verse 2: LL Cool J (Amil)]\nYou the freak of my dreams, the reason that I keep on baggy jeans\n(Oooh, I love me a nigga from killer Queens)\n(I'ma rub up on your muscles, ride 'til I'm sweatin' it)\n(I bet you I can make you cum first) throw the bets in\nI'm a nasty nigga, made to order\nKiss below the border with a warm glass of water\nIs you wit me? (Yeah) Tell me how it taste\nI promise I'll keep the telephone right in my face\nHow it feel? (Feels good) Where you at? (In the hood)\n(Talkin' on the phone like a good girl should\nTo my nig', baby I'ma reach my peak)\nStrawberry shortcake, good enough to eat\n(And I taste mad sweet) We big freaks\nBlastin' off on the phone seven days a week, uh\n\n[Chorus: Amil (LL Cool J)]\nHello, hello (yo, yo)\nHello, hello (yo, yo)\nHello, hello (yo, yo)\nHello, hello (yo, yo)\nHello, hello (yo, yo)\nHello, hello (yo, yo)\n{Call me on the telephone}\n\n[Verse 3: LL Cool J (Amil)]\nI throw sugar in the water so the ice tastes sweet\nTo make sure your ex-man can't compete\nShower curtain on the bed, warm baby oil\nG-string sittin' like a snake in a coil\n(Hold on, I think somebody on the other line)\nInterrupt this nut I'ma bust, you out your mind\nLay back, imagine us chest to chest\nTongue-kissin' deep while we spark a sess\n(Everything is crazy, L do it the best)\nRidin' rough baby, put my pipe to the test\n(On the telephone?) Yeah, this is the ill zone\nI wanna make you moan until it's a dial tone (*BOOOOO*)\nHowever you want it baby, I'm raw to the bone\nThree (three) two (two) one (one) telephone\n\n[Chorus: Amil (LL Cool J)]\nHello, hello (yo, yo)\nHello, hello (yo, yo)\nHello, hello (yo, yo)\nHello, hello (yo, yo)\nHello, hello (yo, yo)\nHello, hello (yo, yo)\n{Call me on the telephone}\n\n[Outro: LL Cool J]\nYeah, yeah, knamsayin'?  Word up, that's what I'm talkin' about\nAll you gotta do is hit me, word, I'll call you right back\nYeah, [?] move this out\nHahaha, what you want me right now\nYou gon' make me crash or somethin', hehehe, word up\nUhh, uhh\nIt's that real shit\nUhh..\nHehehehehe..", "image": "https://images.genius.com/7d9009021acaa20a396f75cbd74c2360.1000x1000x1.jpg"}], "artist": "LL Cool J"}