{"songs": [{"title": "Room 34", "album": "Hi! My Name Is B.o.B", "year": null, "lyrics": "[Hook]\nI look down\nOut my window\nI see your face and your shadow\nOn the street below me\n\n[Verse 1]\nIn room 34, in the third row\nThere sits a young brother and they call him Earl-O\nThere's a girl that Earl knows, also in the third row\nAnd he wanna flirt, so he passes her dirty notes\nNow she flirt back, even though every girl know\nEarl-O popular, fuck taking girls home\nSo he asks her for her number, she said \"somethin, somethin, 0\"?\n\"Please call me after 7 cause my minutes very low\"\nSo when the bell rang, the girl dip and hurry home\nBut Earl wanna follow, so he hopped in his Impala\nThen he pulled up beside her on interior and chrome\nHe offered her a ride, \"I'll take you where you wanna go\"\nShe said \"if you don't mind, I'm over there by ?\"\nShe hopped up in the ride then he got his swerve on\nThey pulled up outside, he asked \"were your parents home?\"\nShe said \"come inside, don't be nervous, we're alone\"\n\n[Hook]\nI look down\nOut my window\nI see your face and your shadow\nOn the street below me\n\n[Verse 2]\nNow Earl called his homeboys, on his Chirp phone\nTold 'em \"come over\" and no, he ain't let the girl know\nApartment 34, in the third door\nTo your left, there's a girl left on the dirty floor\nShe's staring at the ceiling as the ceiling fan blows\nAll the blood on her face at the tip of her nose\nHer mama walk in like \"what in the world's wrong?\nWhy you laying butt naked? Girl, where your clothes?\"\nBut she ain't say nothing cause she just turned 14\nThe cuts hurt but her pride hurt mostly\nHer mama pick her up and put her shirt on\nNow she headed to the emergency room\nShe asked if dad was coming home from work soon\n\"Please promise me you ain't gon' tell a word to 'im\"\nIt's just another day as the world moves\nMoves, moves, moves, damn\n\n[Hook]\nI look down\nOut my window\nI see your face and your shadow\nOn the street below me\n\n[Verse 3]\nWell in room 34, on the third floor\nThere sits a sad family and they talking to the po\nThe cop ask her if she know if Earl-O sell dope\nThen he get his information then he get back on patrol\nWhen everybody leave, she go and lock the door\nThen she walk up to the window while she standing in her robe\nShe open up the window then she write a little note\nAnd take a deep breath and open it some more\nShe take her first step, her other foot on the floor\nShe hesitate a little but she know she wanna go\nShe look up at the sky then she look down at the road\nAnd sing a little song and this is how it go\n\n[Hook]\nI look down\nOut my window\nI see your face and your shadow\nOn the street below me", "image": "https://images.genius.com/adcf6114ce030b4f70858bc64c941f6f.496x496x1.jpg"}], "artist": "B.o.B"}