{"songs": [{"title": "Tha’ Lunatic", "album": "2Pacalypse Now", "year": "1991-11-12", "lyrics": "[Verse 1: 2Pac]\nOh shit, jumped on my man's dick\nHeard he had a twelve inch, now the bitch is lovesick\nWho's to blame, the guy or the groupie\nHeard I was down with D.U., now she wants to do me\nOooh-wee! This is the life\nNew bitch every night, never tripped off a wife\nIt ain't right, but it's cool how they come quick\nDon't try to flip with the lip cause I run shit\nHip hip, hooray for the AK\nSpray when I lay competition, what a great day\nMake pay, next is the wet sex\nHexed with the vex now they wreck with the complex\nI'm set, wonder what I tote, check\nBloody as a Kotex, snappin' motherfuckers' necks\nRevenge so sweet when it comes from\nNiggas get done with the drum, watch my foes run\nNigga keeps comin when they can't slip\nFull of that shit, another hit from tha' lunatic\n\n[Chorus: Stretch]\nYeah, fuck that God! Word up\nBlowin' niggas out the motherfuckin' frame, you know what I'm sayin'?\nConstantly, fuck that trick, we ain't havin' it\n\n[Verse 2: 2Pac]\nLeave me the fuck alone, you get none of this\nIt's suicidal, you lose your title like Doug-las\nCause I'm nothin' nice and, I'm icin' like Tyson\nI'm grippin' the mic and my DJ is slicin'\nI'm tired of motherfuckers steppin' to me with the same old\nTryin' to do me like Nintendo\nHow the fuck you think I ever got this far?\nBy bootin' motherfuckers like a shootin' star\nCause I'm out to show that I'm a dope MC\nThink crack had you fiendin', wait'll they get a load of me\nBitches on my dick like a motherfuckin' condom\nNiggas wanna flip, let 'em step, and I'll bomb 'em\nSee somethin' you want, why don't you come and get it\nAnd then get waxed and taxed, like the government\nThen I leave you sittin' there, wonder where your money went\nWhile your bitch is callin' me, tellin' me to come again\nNigga I'm loc'ed, when I smoke, from the indo\nBut we can be friends though, after you get broke like a window\nThat's what you provoked, and now you're smoked out\nLookin' like a bitch, cause your whole fuckin' posse, broke out\nPunk motherfucker couldn't roll on\nHe couldn't hold on, game is too strong, nigga\nLeave me the fuck alone, you get none of this\nFeel the wrath, and revenge of tha' lunatic\n\n[Chorus: Stretch]\nYeah Tu', tell 'em motherfuckers, word up\nWe ain't havin' it, none of that shit!\nBitch ass niggas, niggas can't fuck with us Tu', word up\n'91, we takin' this whole motherfucker over\nNiggas got problems in '91, '92, and '93\nAnd all that other shit, word up\n\n[Verse 3: 2Pac]\nRecognize game when it smacks you, bitch I'm back to rip\nPuttin' this on the map with this mackin' shit\nTime will tell if it's made well\nWell I raise hell and excel cause it pays well\nJordan couldn't dunk it any harder, pump it any farther\nI'm funky, that's word to the father\nAct like you know 'fore I thump the bolo\nThought you was a pimp, now you're simpin' for my solo\nOh no, not another new jack, swearin' that he's ruthless\nDucked and now he's fucked and left toothless\nI can hear the fear in your flow, you ain't prepared\nYou're scared and you're bound to go\nIt's somethin', I guess I let the beat keep bumpin'\nStop trippin' off these niggas cause they ain't about nuttin'\nOr should I say naythin'\nPunk put my tape in, fuck all the fake-in\nI'm sick of the bullshit\nCome equipped and get ready to rip\nOr get the dick of tha' lunatic\n\n[Chorus: Stretch]\nAh yeah, fuck that, you know what I'm sayin'?\n(The motherfuckin' lunatic)\nYes Tu'!\nTell them niggas what time it is, 'kna'm sayin'?\n(Punk motherfuckers, get the dick of the lunatic)\nNiggas can't fuck with us, word up\nBitch ass niggas, fuck 'em\n\n[Outro: 2Pac]\nFuck all them niggas\nI'm tellin' these niggas that they ain't got\nNaythin' on a nigga like me\nWe squashin' these punk motherfuckers in '91\n'92, '93, and so on\nSo let the beat float on\nWhile I spray these punk bitches\nWith these dope ass lyrics\nThanks to Poppa for supplyin' the dank\nNow it's money in the bank\nAnd all y'all niggas shit stank\nCompared to this shit\nFuck y'all punk bitches!\nTha' Lunatic *echoes*", "image": "https://images.genius.com/839619da9eb2d92ecf5367044a1fb2ba.500x500x1.jpg"}], "artist": "2Pac"}