{"songs": [{"title": "Million", "album": "Just Re’d Up 2 ", "year": "2013-01-21", "lyrics": "[Hook x2]\nSaid I'm ridin' in that Porsche, mind on a million\nMy girlfriend trippin', so fuck how she feelin'\nCause she don't pay no rent, so she don't mean shit\nI got more money than her, so she don't mean shit\n\n[Verse 1: YG]\nSaid I'm ridin' in that Porsche, mind on a million\nMy girlfriend trippin', so fuck how she feelin'\nShe think I'm worth a million so her panties get to peelin'\nI stop and get some condoms, so I won't have no children\nLegs up in the back seat, booty in the back seat\nThe way a nigga ballin' you would think I was an athlete\nMustard in that Benzo, I'm up in that Porsche, though\nYouse a bad bitch, why you actin' like a whore, though?\nLean by the quart load - 16 OZs\nMind on a million, bitch, fuck you call me?\nAll my homies bangers, pistols ain't no strangers\nPistols ain't no strangers, and pistols can't taint us\nRatchets in the lobby, that's my type of party\nWe buy or sell gangsters, my clique don't need nobody\nRich niggas eat out, pussy niggas Mia\nFuck it then I beast now, like peace out\n\n[Hook]\n\n[Verse 2: YG]\nI'm riding in that Porsche, mind on some money\nNiggas act funny, start makin' money\nPussy make that label, all my niggas able\nPut lil' bro and some killers on the payroll\nAll my niggas a-holes, act like we don't give a fuck\nI bet that shorty hit 'em up...\nI had to switch it up, now I live it up\nI live it Hollywood, we at my house thick as fuck\nPussy don't do shit for me, it's just a nut\nNo homo, I can do that with my hand, bitch, what?\nBitch I think I'm 2Pac, bitch I think I'm 2Pac\nNiggas talk that shit 'til they get their ass popped\nMamas wanna fuck me, their daughters wanna fuck me\nThee bitches think I'm ratchet and the niggas say I'm lucky\nMore racks on, couple racks gone\nDouble racks gone, that's 20 racks gone\n\n[Hook]\n\n[Bridge:]\nI be ridin', my niggas we be ridin'\nOur pistols do the fighting\nSo you don’t want no violence, no\nAll my niggas on, Ciroc and Patron\nHavin' bad bitches come up out they thongs\nOne rack gone, double racks gone\nCouple racks gone, that's 20 racks gone\n\n[Hook]", "image": "https://images.genius.com/4f22072ae134f53926f9d67d51dfb5ce.500x500x1.jpg"}], "artist": "YG"}