{"songs": [{"title": "Good", "album": "More Fish", "year": "2006-12-12", "lyrics": "[Intro: Ghostface Killah (Mr. Maygreen)]\nAiyo, what up party people (Yeah, my name's on the guest list)\nThis is the Wallabee kingpin in the building (As Mr. Maygreen... good evening...)\nRight about now, I'm about to show you how good we are (I'm in the club, I'm)\n\n[Hook: Mr. Maygreen]\n(Good), I look so, (good), the car look\n(Good), I'm in the hood, and I'm okkkkkk\n(Good), the jewels look, (good), the girls look\n(Good), they all from around the wayyyyy\n(Good), hey there, (good), look at you\n(Good), me, I'm just passing byyyyyyy\n(Good), look at her, (good), time out\n(Good), I think I'll give the game a tryyyyy\n\n[Ghostface Killah]\nAiyo, my rose was good, plus my face was good\nThe way I wear my jeans up over my boots is hood\nAnd my cash is good, the grass, spread it out, over the hash is good\nThe grasp who be hypecast is good\nThat's the bird that fucked the game up\nCut the head off lames and platinum niggas, your boy done came up\nGot my aim up, favorite bling with a millennium chains\nChilling, in the staircase, surrounded by killings\nWith bank rolls, bang those, bang your main hoes\nYou was in love with the pussy, it ain't the same though\nCuz I'm good, she's good, so you should be good\nHit her with the stiff one, she callin' me wood\nAnd we don't love those hoes, with they flat butts caked up\nAnd tipped up toes, need an ill plastic surgeon to fix they nose\nCuz they shit is too fat like an adidas sole\nDon't even touch my gold, I'm good\n\n[Hook: Mr. Maygreen]\nI know you heard it a thousand times\nNot quite like my design\nYou say that's what you looking for\nGator boots walk through the door, now\n\n[Bridge: Ghostface Killah (Mr. Maygreen)]\n(Good) Theodore's good, (good), my team is good\n(Good) My robes is good, (I'm so good)\n(Good) My moms is good, (good), my style is good\n(Good) My queen is good, yeah, come on, (I'm so good)\n(Good) The days is good, (good), babies is good\n(Good) Wifes is good... uh-huh\n(Good) The hood is good, (good), God is good\n(Good) Everything is good, come on, let's go\n\n[Ghostface Killah]\nGoose over ice cubes, pass the O.J\nTwo light skinned wizzes, want Ghost, on both ways\nCome here, sit on my lap, it's not a gat, sugar\nHave a seat, don't be afraid to move back\nFeel that? You'se a nasty girl\nBig butt, slim gut, I'll crash your world\nIt's not polite to bend over in Starkey face\nSheer lace, fat ass, got want me to taste that\nLodi dodi, with a coke shaped body\nAnd my jewels hang low like my balls in the potty\nAnd I dare ya'll to try to rob me\nTheodore U, we got the army\nA-Town to Mariner's Harby\nWild West, Now Born, go hard, G\nKilla Hill, Stapletown, Port Rich' kids\nPack heat, like I was pulling out biscuits\n\n[Hook]\n\n[Hook]\n\n[Trife Da God]\nWhen we on the block bubbling rocks, watching for cops\nHolding Glocks in and out of the spots, (it's all good)\nWhen we overseas, getting that cheese, whipping the hottest V's\nBlowin' exotic trees, playa, (it's all good)\nWhen I'm in the whip, sunk in the six, drunk off the liqs\nPull up, stunting, fronting for chicks, (it's all good)\nWhen we on stage getting them Grammy's, snatching them panties\nJetskiing off the shores of Miami, (it's all good)\n\n[Hook]\n\n[Interlude: Ghostface Killah]\nYeah... told ya'll before, another Theodore Production\nThis is how we go in the 06 to 07, come on, come on\n\n[Hook]", "image": "https://images.genius.com/c666c55fe38ac486d5bf42862246cf28.1000x1000x1.jpg"}], "artist": "Ghostface Killah"}