{"songs": [{"title": "Bohemian Grove", "album": "Control System ", "year": "2012-05-11", "lyrics": "[Intro]\nOne time for the women\nTwo times for the ladies\nThree times for the bitches\nThat's right\n\n[Verse 1]\nMotherfuck the government, motherfuck the system\nMotherfuck you, I'm just livin' how I'm livin'\nPatron with a lemon, pineapple in the Ciroc\nVanity, more homes than Sherlock family to roll through\nSmoke up, fuck with a broad or two\nI'm broader than you\n(Murda!) I'm slaughterin' you\nShe ain't gotta be a genius to see it\nI just hope the brain make me say: Jesus! (Christ)\nNo religion, I'm just so explicit\nI coexist in places you would never know existed\n(What, what?) Soulo here\nTake a photo like a 4-seater\nTop notch to my fuckin' socks\nSay I'm not, you smokin' rocks\nShe on my jock, that's reasonable\nIf she pop a Xanny, and give me the panties\n\n[Hook]\nShe'll never leave me alone\nShit, I swear I just met shorty like 40 minutes ago\nAnd it's a go, man, I hope she don't think I think she a ho\nGot me harder than sneakin' a bitch in Bohemian Grove\nOne time for the women\nTwo times for the ladies\nThree times for the bitches, the bitches\n\n[Verse 2]\nMotherfuck the government, motherfuck the system\nMotherfuck you, I'm just livin' how I'm livin'\nHennessy and Coke, 1800\nWe mixin' dark and light like the 1800's\nAnd we gettin' blunted, what it do? Yes, indeed\nBet I got some weed like Schoolboy Q (Q!)\nLet the festivities begin, we in here\n(What?) we in here (what?) we in here\nWhere them hoes at? I'm sincere as Nasir\nBelly of the beast, I might feast on my dear\nWe night ride like Paul Revere\nSpillin' Mai Tais all on her brassiere\nTop notch to my fuckin' socks\nSay I'm not, you smokin' rocks\nShe on my jock, put the key in the door\nIf she pop a Percocet and give me the sex\n\n[Hook]\nShe'll never leave me alone\nShit, I swear I just met shorty like 40 minutes ago\nAnd it's a go, man, I hope she don't think I think she a ho\nGot me harder than sneakin' a bitch in Bohemian Grove\nOne time for the women\nTwo times for the ladies\nThree times for the bitches, the bitches\n\n[Bridge: Alori Joh]\nHey baby, I been thinking of you\nHey baby, I been thinking of you\nHey baby, I been thinking of you\nHey baby, I been thinking of you\nLook at my mind, floating away\nI get so illuminated\n\nMotherfuck the government, motherfuck the system!\nMotherfuck you, I'm just livin' how I'm livin'\n\n[Interlude]\n\nControl, Control, Control\nStimulate the hoes\nControl\nEducating my niggas\nControl, Control\n\n[Outro]\nNow, having said that, I'll go back to this document. This was a meeting, okay this was what he said:\n“Very soon, every American will be required to register their biological property in a national system designed to keep track of the people and that will operate under the ancient system of pledging. By such methodology, we can compel people to submit to our agenda, which will effect our security as a chargeback for our fiat paper currency. Every American will be forced to register, or suffer being unable to work and earn a living. They will be our chattel, and we will hold the security interest over them forever, by operation of the law merchant under the scheme of secured transactions.\n\nAmericans, by unknowingly or unwittingly delivering the bills of lading to us will be rendered bankrupt and insolvent, forever to remain economic slaves through taxation, secured by their pledges. They will be stripped of their rights and given a commercial value designed to make us a profit and they will be none the wiser, for not one man in a million could ever figure our plans and, if by accident one or two should figure it out, we have in our arsenal plausible deniability. After all, this is the only logical way to fund government, by floating liens and debt to the registrants in the form of benefits and privileges. This will inevitably reap to us huge profits beyond our wildest expectations and leave every American a contributor to this fraud which we will call 'Social Insurance.' Without realizing it, every American will insure us for any loss we may incur and in this manner, every American will unknowingly be our servant, however begrudgingly. The people will become helpless and without any hope for their redemption, and we will employ the high office of the President of our dummy corporation to foment this plot against America.”", "image": "https://images.genius.com/36147c3e9b6fcfa747233bb1c340f424.500x500x1.jpg"}], "artist": "Ab-Soul"}