{"songs": [{"title": "Feel My Pain", "album": "I Bullshit You Not", "year": "2009-05-04", "lyrics": "[Hook]\nFeel my pain, make the whole world cry\n(Make the whole world cry!)\nCry (Make the whole world cry!)\nHands up (Now, put your motherfucking hands up!)\nC'mon! Feel my pain and make the whole world CRY!\nStand up (Stand up, my niggas! Listen!)\n\n[Verse 1]\nBehold one of the greatest\nEvery time I touch microphones, I conspire to kill you, like Bilderberg or the Skull and Bones\nIlluminati and all of the secret societies\nListen while I speak and organize all my priorities\nTake a look at the environment, shit's looking strange\nAnd how the living condition for a lot of people been chaingin'\nThe way we been so obsessed and possessed to just talk crime\nIt's funny how niggas ain't dropped a jewel in a long time\nDig in your law, find, Stop acting like y'all blind\nThey put it in our face, but y'all ain't reading between the lines\nI don't need a psychiatrist, I'm focusing, fuck a shrink\nWe take so much shit for granted, shit is deeper than what we think\nCertain people thing I'm wrong and probably think that I'm off, maybe\nBecause when we talk like this, they make us look like we fuckin' crazy\nBut that's alright, if you keep listening, it might clear your sight\nAnd your vision and you'll start thinking 'Hey, what if this nigga's right?'\nThey [?] all my being, never needing permission\nThey control us through our own hustle and through our religion\nThe attention span is short, that's the way we conditioned\nSee, that control is what's having us lose control of our children\nSome things I never understand, no matter how hard I try\nIf I behave and go to heaven and see God when I die\nWhile they always used to tell me that [?]\nWhen no one came back from death to say if it was truth or was lies\nThus, I always strive for perfection, I might make a wrong step\nI think 'What type of person could create such a concept?'\nThem extending the powers that people go is tremendous\nThey'll even use all of the faith that we have for God right against us\nSame mu'fukas got us thinking 'We're all equal'\nNo we're not, they try to put the fear of God in my people!\nThere's no NEED to fear God, look in the mirror and see\nI have been blessed, so I'm POSITIVE that God loves me!\nTried to oppress us and kill us and treat us like we they trash\n'Casue I'm god-like, so they put they fear of God right back in they ass\nTo strive to conquer our inner demons, trying to stop the war within\nThe Devil always been trying to confuse us 'bout our origin\nSitting, thinking 'bout shit I've always pondered ever since realizing I'm somebody's nigga\nCourtesy [?] , that's why we tripping and falling and covering our face too\nNot even knowing where my blood even trace back to\nBut I always give in to [?] and misleaders\nIs it cause my blood might trace to possibly being a descendant of Jesus?\nI know who they fear the most! I hope you're listening clear!\nThe truth is I'm god-like and our nature is different from theirs\nI hope the praying that I do sometime will serve in this purpose\nI pray at home because I feel I'm running out of places to worship\nWhen I used to go to church in the name of God as a [?]\nAnd leave they kids in church to finally getting fucked by the preacher\n\n[Outro]\n(Make it stop! Make it stop! Make it stop..)\nIt's okay, shh. What are we gonna do?", "image": "https://images.genius.com/b1f47d7742cc9a33404ccf975f1feb0a.300x300x1.jpg"}], "artist": "Busta Rhymes"}