{"songs": [{"title": "Remember Me?", "album": "The Marshall Mathers LP", "year": "2000-05-23", "lyrics": "[Chorus: RBX]\nRemember me? Seven executions\nRemember me? I have no remorse\nRemember me? I'm high-powered\nRemember me? I drop bombs, like Hiroshima\n\n[Verse 1: RBX]\nFor this one, they scream \"X, you retarded?!\"\n'Cause I grab the mic and get down like syndrome\nHide and roam into the masses\nWithout boundaries, which qualifies me\nFor the term “universal” without no rehearsal\nI leak words that's controversial\nLike I'm not the one you wanna contest, see\n'Cause I'll hit your ass like the train did that bitch\nThat got banned from TV, heavyweight getup\nHit you, watch your whole head split up\nLoco is the motion, we comin' through\nHollow-tips is the lead the .45 threw\n\n[Chorus: Sticky Fingaz]\nRemember me? Throw ya gunz in the air!\nRemember me? Slam! Slam!\nRemember me? Nigga, bacdafucup!\nRemember me? Chka-chka-Onyx!\n\n[Verse 2: Sticky Fingaz]\nNiggas that take no for an answer get told no\nYeah, I been told no, but it was more like “No! No! No!”\nLife's a bitch, met her, fuck you if you let her\nBetter come better than better to be a competitor\nThis vet is ahead of the shit, it's all redder, you deader and deader\nA medic instead of the cheddars and credda\nSettle vendetta with metal Beretta from ghetto to ghetto\nEvidence, nope, never leave a shred of\nI got the soul of every rapper in me, love me or hate me\nMy mom's got raped by the industry and made me\nI'm the illest nigga ever, I told you\nI get more pussy than them dyke bitches Total\nWant beef, nigga? Pbbt, you better dead that shit\nMy name should be Can't-Believe-That-Nigga-Said-That-Shit\nProbably sayin' he ain't a killer, but I'm killin' myself\nSmoke death, fuck bitches raw on the kitchen floor\nSo think what I'ma do to you, have done to you\nGot niggas in my hood who'd do that shit for a blunt or two\nWhat you wanna do? Cocksuckers, we Glock busters\n'Til the cops cuff us, gon' start ruckus and drop blockbusters\nRound the clock hustlers, you cannot touch us\nI'm gettin' wires, niggas wantin' me dead\nWantin' my head, you think it could be somethin' I said?\n\n[Chorus: Eminem]\nRemember me? I just don't give a fuck!\nRemember me? Yeah, fuck you too!\nRemember me? I'm low down and I'm shifty!\nRemember me? I'm Shady!\n\n[Verse 3: Eminem (& Dr. Dre)]\nWhen I go out, I'ma go out shootin'\nI don't mean when I die, I mean when I go out to the club, stupid!\nI'm tryin' to clean up my fuckin' image\nSo I promised the fuckin' critics\nI wouldn't say “fuckin'” for six minutes\nSix minutes, Slim Shady, you're on!\nMy baby's mom, bitch made me an angry blonde\nSo I made me a song, killed her and put Hailie on\nI may be wrong, I keep thinkin' these crazy thoughts\nIn my cranium, but I'm stuck with a crazy mom\nIs she really on as much dope as you say she's on?\nCame home and somebody musta broke in the back window\nAnd stole two loaded machine guns and both of my trench coats\nSix sick dreams of picnic scenes\nTwo kids, sixteen, with M-16's and ten clips each\nAnd them shits reach through six kids each\nAnd Slim gets blamed in Bill Clint's speech to fix these streets?!\nFuck that! Pbbt, you faggots can vanish to volcanic ash\nAnd reappear in hell with a can of gas and a match\nAftermath, Dre, grab the gat, show 'em where it's at!\n(What the fuck you starin' at, nigga?)\n\n[Outro: Eminem]\nDon't you remember me?\nRemember me? Remember me?\nRemember me? (Slim Shady!)", "image": "https://images.genius.com/e7f2305258d668431f8e250a41f3459f.1000x1000x1.png"}], "artist": "Eminem"}