{"songs": [{"title": "Im good - terrorists", "album": null, "year": null, "lyrics": "[Verse 1: Lil' Wayne]\nI'm so fucking awesome – my marbles, I lost ‘em\nI'm taking everything – everything but precaution\nYour bitches wanna call us, and text us like Austin\nPussy make me hard, pussy niggas make me nauseous\nI've been on my feet since the day I started walking\nBitch, I think I'm MC Hammer, put the nail in the coffin\nSee coke in a drought, sell pussy at an auction\nBullets got a nigga runnin' fast enough to race horses\n‘Round here, you sniff these lines, you don't cross ‘em\nKill your ass and leave you behind, like an orphan\nI swear it happens all the time, very often\nStill gettin' baseball money, Barry Larkin\n‘Round here we play for keeps, yeah we eatin' but we starvin'\nI get me a little money, try to spread it like margarine\nI'm flyer than a motherfucker, all my flights chartered\nGreen kush, red flag, black car, white lawyer\nI'm good\n\n[Verse 2: Meek Mill]\nI say, I go in in my beast mode – rappin' niggas I eat those\nI tell a bitch take a deep breath then bend her knees like a free throw\nI don't want me no good girl, I fell in love with these freak hoes\nIn my bedroom, I'll make a movie, it's starring me with that Lee Rose\nI ball hard like D-rose, my stash on closet\nRacks in my pocket, these racks I deposit\nGot racks on my conscious, money on my mind\nI've got shooters on my team, they've got bodies on their nines\nLook at that bad bitch right there – see that body on that dime?\nI ain't swimming in no hoe, you know I'm probably on that grind\nAll these niggas hatin' on me, me – but I ain't on that time, time\nI be in that back, nigga, and I ain't talkin' 'bout swine\nI'm talkin' 62 West, they say a nigga too fresh\nYou a rat, your homie singing, you should do a duet\nShorty say she love my swag, I make that pussy too wet\nYou niggas banned, and my hoes, and I'm like \"why'd they do that? \"\nGo!\n\n[Verse 3]\nUm, I don't have a conscious – all my friends are monsters\nThey visit me so constant and talk to me about nonsense\nLike stabbing you and then watching you fight for your life like you boxing\nBitch, deuce-deuce – I smoke that OG killer, Bobby Johnson\nI'll ollie over that bitch's head, it's Hollygrove 'til I'm fuckin' dead\nI did a bid for that toast, so fuck with me, I'll treat you like buttered bread\nBut I still go hard with no regard – Earth Day? Shit, bitch, go to Mars\nLeave a nigga dead in the gutter\nI just beat him with a bloody-ass bowling ball\nI'm fresh as hand sanitizer – don't hate the game, just analyze it\nTwo Xanax, I'm fantasizing about fat bitches' panty sizes\nTook a bullet to the chest? Be a man about it\nStop actin' like a little bitch, nigga\nMost of y'all niggas is bitch niggas\nI got a tiger in the basement, Big Tigger\nMy hair long and my dick big\nMy hair long and my dick big\nMy hair long and my dick big\nMy money long and my weed strong\nI feed hunger, I no longer get my weed from Fee\nI pull that freedom off my waist, now watch me let freedom ring (ding)", "image": "https://images.genius.com/6929169de7116d41676151bdea5cc773.1000x1000x1.jpg"}], "artist": "Meek Mill"}