{"songs": [{"title": "The I", "album": "Keep Right", "year": null, "lyrics": "Where shall we land, there?\nWhich city shall we destroy today?\nThis one, or that one?  This one?\n\n[KRS-One]\nTake a look a look around, we last forever\nWe carry books around, manuals are bound in leather\nWe rock the center, the only point that's in the circle\nWe free MC's, what we decree will not desert you\nWe know what we doin, we wise and we chillin\nWe calculate against the continued cries of our children\nThey may be cryin now but they won't be cryin later\nWe love hip-hop, because WE are it's creators\nSo we, build the Temple, write the books, teach the classes\nCreate instrumentals, write hooks and rock masses\nNONE passes, without studyin this flow\nIt's all good as long as you know Kris know!\n\n[Chorus: Mad Lion]\nWhile I deal with I, Jah talk to I\nWhen I dem go alike, only de one comply\nWhatchu see with de I, look twice toward de I\nIf you don't unify your children them a gon' cry\n\n[KRS-One]\nI stand with the rejected, the unsuspected, the unconnected\nThe neglected the one you, never suspected\nIt seems you forget hip-hop plays the back\nSayin that's my sound, and that's my sound\nAnd that's my track, and that's my rap\nAnd that's some chorus they did way back, look honey bringin it back\nI'm actually, I'm everywhere at every time\nAnimating every rhyme and every dare in every mind\nKRS is my representative on Earth\nChallenge him not, he's been hip-hop since birth\nHis main objective, is to put hip-hop in perspective\nShow pity, and DESTROY these wack cities\n\n[Chorus]\n\n[Mad Lion]\nInna style dem a {?}, yo alla dem a cry\nDey worship slackness and to be under sky\nWe lead dem to de water but we cyan't make dem drink\nPussy to take a sip, cause it gon' make you t'ink\nWe don't usually {?} shit {?}, yo alla dem a sing\nWisdom wort more den any diamond and gold\nPeople use it and find it like de Dead Sea Scrolls\n\n[KRS] Take dem Lion, take 'em, take it over!\n\n[Mad Lion]\nCause of dem outer, dem outer, dem outer inter outer inter\nOuter inter outer inter out of control\nDey neva find wisdom til dem dead ohhh\nMad Lion make de {?} roll\nKRS make up a sea and bulge ya\nOf the story of never been told-a\nCause we outer, outer, inter outer outer ese\nOut of control, out of control\nI'm so serious ay (what?)\nWe don have no time fi play, ay (tell 'em again)\nSome people diss dem {?} hell's in this world\nBut dey'll come around one day\n\n[KRS-One]\nYo, yo, only Beezlebub think my voice is aggravatin\nChildren of light hear my voice and start congregatin\nThe mind's debatin, is he a prophet or is he Satan?\nBut the tree is only known by it's fruit, what am I creating?\nWhat am I stating?  Have I stood the test of time?\nOr am I fading, or has God blessed my rhyme?\nSettle your dissin, you better be listenin, forever we glisten\nThe metaphysician with a better way, makin a better day daily", "image": "https://images.genius.com/4f300314f4b269cd7479d10c0e1cab7e.1000x1000x1.jpg"}], "artist": "KRS-One"}