{"songs": [{"title": "Stand Up Guy", "album": "The Leak", "year": "2006-03-28", "lyrics": "[Intro]\nEy, I know you done kicked it with a lot of niggas before\nBut you ain't never kicked it with a nigga like me\nHey Hey\n\n[Hook]\nI see ya baby, throw ya hands up high\nIf you wanna come and kick it with a stand up guy\nBecause the rocks gonna glisten and the drops on 20's\nBend it over let it drop if you wanna roll wit me\nI say all my sexy ladies throw ya hands up high\nIf you wanna come and kick it with a stand up guy\nBecause it don't get betta, niggas don't get cheddar\nLike that fella in the yellow Purple Label silk sweater\n\n[Verse 1]\nThe stones keep glowin' on my wrist like whoa\nAnd she can't stop lookin' I know ya bitch like those\nAnd she chose, ain't no question if the bitch might blow\nJust get her to the crib and get her whole back sore\nI'mma blow my dro', I'mma pop my pill\nAsk anybody wanna take a shot, I will\nMight see me in a different color drop, Hot Wheel\nWith the top down low, and the Glock concealed\nI got the Hayabusa racing up the block, one wheel\nIf the police try to chase me you know they a done deal\nI got skills, anybody wanna come test\nWe'll send this .45 be up in yo chest\nA lot of ladies wanna kick it with a nigga so fresh\nWho could spend a 100k, any day, no stress\nThe watches is insane, the chains is grotesque\nStay single if you wanna but you gain no cash\n\n[Hook]\n\n[Verse 2]\nIf you got a man and you're tired of being there\nYou done gave him too many chances, you're tired of being fair\nI offer you the opportunity to ride with a playa\nYou, me, and a couple of freaks in the ride with a playa\nNevermind those outside, when they stare\nCause the chrome 24's on the ride give a glare\nBecause of one guy, you decided to share\nAs long as you having the time of your life, who cares\nMan, we all sinners, what matters is in the center\nI know God see the heart, and I'm a stand up nigga\nYou can't beat me cause you ain't man enough nigga\nI look him in the eye and tell him man up nigga\nYou really getting money? Throw a grand up nigga\nWanna fight? You should've hit me when you ran up nigga\nLet the Smith and Wesson hammer body slam fuck niggas\nGo and kick it with the hoes and throw ya hands up with 'em\n\n[Hook]\n\n[Verse 3]\nYou ain't know me cause I live so special\nTry to stay low key but it's still so special\nFlat screens in the floor, quarter mil' in the dresser\nJewelry box glowing like I loan on treasure\nI'm chillin' with Vanessa, met a girl named Heather\nTold her \"Hi, how ya doin'? Buy a drink? My pleasure\"\nTold her if she got a homegirl go tell her\nThat I got a hard rug, I could go for-ever\nIf Vanessa wanna touch it just let her\nIf she laughed out loud, I'll be shocked if we jus met her\nBought the dro', get low, and its only one-fifth\nAnd it's four pills left, do you wanna come with?\n\n[Hook]", "image": "https://images.genius.com/757a45da6a6e4106770d36a71b9d8b5b.300x300x1.jpg"}], "artist": "T.I."}