{"songs": [{"title": "No Way to Stop Me", "album": "EA Sports Soundtrax, Vol. 1", "year": null, "lyrics": "[Intro: Royce]\nFrom as far back as I can remember\nMe and my man Vishis\nWe was always taught to shoot for the stars\nThe game is ours, M.I.C. (c'mon!)\n\n[Chorus 2X: Royce Da 5'9\"]\nCan't nobody stop me, uh-uh\nNo way to stop me, uh-uh\nCan't nobody stop me, uh-uh\nAin't no way to stop me, uh-uh\n\n[Royce Da 5'9\"]\nLong as the checks stay ill and the records stay real\nI'ma definitely never see how second place feels\nI'm a striver, I learn from my father to burn like lava\nI am a survivor, the problem\nIs that, even as a kid I've been meanin\nTo be the, heir to the chair that the king's in\nI vowed to myself that, I wouldn't melt\nI will rise to the top, of the pile myself\n{\"C'mon!\"} Can't nobody stop my wealth\nMy dreams or, team up without my help\nFor sure it's better to chase ya\nI base this, on pure competitive nature\nWaitin, for the day that we make plans\nTo compete, win or lose shake hands\nThese are the views of the dudes of tomorrow who will win\nCause they shoot for the stars and refuse, to lose!\n\n[Chorus]\n\n[Kid Vishis]\nYeah, yeah\nAs long as the checks stay ill and the records stay real\nI'ma definitely never see how second place feel\nGot the mind of a rhymer, conquer your roster\nSquad full of mobsters as hungry as a hostage\nYeah, I will never fear\nCause I need to succeed, you could tell in my stare\nThat I care if I lose, I'm a winner so I move with a vision\nNever fool with the timid, rather learn so I listen\n{\"C'mon!\"} Can't stop my mission\nToo vicious for you who step into the trenches\nRaw, talent - never back down\nBring the challenge, I'ma leave standin\nLaughin at y'all faces cause y'all mad\nBut dirty looks, will never shake this man\nFull steam ahead for the cake, for the bread 'til I'm fed\nGo hard at 'em all and refuse, to lose!\n\n[Chorus]\n\n{\"C'mon! C'mon! C'mon!\"}\n\n[Royce Da 5'9\"] + (Kid Vishis)\nLong as the checks stay ill (and the records stay real)\nI'ma definitely never see how (second place feel)\nThe league (the teams) fatigue (breathe)\nBelieve in song {\"C'mon!\"}\nFor sure it's better to chase ya\nI base this, on pure competitive nature\n(You can lose your shoes) Givin crews the blues\n(Go hard at 'em all and refuse, to lose!)\n\n[Chorus]", "image": "https://images.genius.com/892233b049a8da052593a9b4030be708.988x988x1.png"}], "artist": "Royce da 5'9'’"}