{"songs": [{"title": "Jack U Back", "album": null, "year": null, "lyrics": "(*Yes y'all – cut and scratched*)\n\n(B-Real)\nYou're a lost soul rollin down the street\nHustlin, scramblin, money you eat\nYou wanna jack somebody, never look at me\nCause I'm like you when I'm holdin heat\nYou don't want to think about re-percussions\nCause you don't give a f**k about who you rushin\nSo what you gonna do when the blood is gushin?\nYou're playin Roulette without the Russian\nThe stakes are high; can you feel the pressure?\nLookin at the club on top of your dresser\nBorn for the big bank robbin your own\nThinkin your stone but your weak ass throne\nBitches like you ain't got no heart\nParanoid, you're settin in, fallin apart\nHow many times will you take to see it?\nYou fallin away, but you don't believe it\n\n(Chorus: B-Real & Sen Dog)\nJack me and you'll never go back\nJack me and I'll jack you back\nWhere y'all bitches got the scheme or the stack?\nJack me and I'll jump to attack\nTell me what started a scheme at ya lap\nJack me and I'll jump to attack\nJack me and I'll jack you back\nJack me and I'll jack you back\n\n(Sen Dog)\nClothes are settin off from the start\nI'm crazy as f**k just like 2 Pac\nMash on Cypress Hill in a Catalac truck\nSteels all gone, so I gotta play it ruff\nGot hate for do out there, I ain't jokin\nCan't hold me back these days, I'm out smokin\nAnd I still see myself as Enforcer\nKnock em in their face if they dedicate closer\nA Cuban massive man (Spanish)\nWith real attack touch straight, from the ghetto\nWalk for a twenty all day like a (Spanish)\nSpit ball; lick all rhymes just like (Spanish)\nI run over fools like Dorsey Leathers\nAnd murder antiques like J-Rhyme I kill peasants\n\nTake over ships like Female Kastro\nDo anything that a nigga HAS TO\n\n(Chorus: B-Real & Sen Dog)\nJack me and you'll never go back\nJack me and I'll jack you back\nWhere y'all bitches got the scheme or the stack?\nJack me and I'll jump to attack\nTell me what started a scheme at ya lap\nJack me and I'll jump to attack\nJack me and I'll jack you back\nJack me and I'll jack you back\n\n(Jack you back, jack you back)\n\n(B-Real)\nLights are f**ked up it's confusin\nLook at you now what road you choosin\nYou'll never be a part of the revolution\nYou f**k with me, feel the retribution\nPunk bitches can never deal with the real\nCause you weak motherf**kers can't decide what you feel\nAlways poppin shit and hide from the Hill\nComin out where you reside for the kill\n\n(Sen Dog)\nKnocked out Pluto, Super Hill thriller\nVerbal assault, Soul Assassin killer\nReal master Mic, ca, sex come iller\nStoned is a waste over, what you feeler\nCan't make moves so you go ask Chiller\nTry the Real Estate trust centipede riller\nBet your ass that I'm bangin to the fullest\nAnd don't get in my way punk ass, not a Buddhist\n\n(Chorus: B-Real & Sen Dog)\nJack me and you'll never go back\nJack me and I'll jack you back\nWhere y'all bitches got the scheme or the stack?\nJack me and I'll jump to attack\nTell me what started a scheme at ya lap\nJack me and I'll jump to attack\nJack me and I'll jack you back\nJack me and I'll jack you back", "image": "https://images.genius.com/2615919eb0bcef9d55421080ab3b10b1.860x860x1.jpg"}], "artist": "Cypress Hill"}