{"songs": [{"title": "Slow Down", "album": "The Big Doe Rehab", "year": "2007-12-04", "lyrics": "[Hook: Chrisette Michele]\nThis life will fade away... (away)\nSo hard to appreciate... (appreciate)\nEach moment, of each day\nLife's quick, don't flip, move slow, ya rushing it\nOh... oh... oh...\n\n[Ghostface Killah]\nLooking lavish, I lace all my bunnies with karats\nSpending millions and make music, I pay for the clearance\nCuz tomorrow ain't promised and my bankroll's bursting\nConnects with Aston Martin, I'll be that first in\nThat prototype truck, with the space navigation\nCost of living go up, I'm just go on vacation\nFresh oxygen tanks, got world reknowned surgeons\nPlush robes made from suede and knitted by virgins\nFirst breath of the day can be my last\nSo I flash, give my niggas some cash, I just pull out the stash\nBuy a million dollar piece like I buy a pack of seeds\nYou buy OZ's of haze, I buy a forest full of trees\n\n[Hook]\n\n[Ghostface Killah]\nOrder that bottle of Louis the thirteenth and some Dom P\nI got a bunch of chicks that love to get raunchy\nSee, Tone double-dipped and I nut like Flanders\nAsk Tamia and Chevon, I got 'em both going bananas\nBuying frosted bracelets, Louis Vuitton duffles\nFrench vanilla ice cream and hot apple pie truffles\nFly Mika to Costa Rica, I got a crib on the beach\nWith underwater lights and surround sound speakers\nPet cheetahs, tiger sharks and dolphin feeders\nFly French maids, serving Grey Goose by the liters\nGot Felecia and Taquesha, Crystal and Katie\nLittle Precious, picking my poppy seeds out in Haiti\n\n[Hook]\n\n[Hook: Christette Michele]\nSlow down, slow down, slow down\nSlow down, slow down, slow down\nSlow down, slow down, slow down\nSlow down, slow down, slow down\nSlow down, slow down, slow down\nSlow down.... slow down...\nLife's quick, don't flip, move slow, ya rushing it\n\n[Outro: Ghostface Killah - over Hook + hook]\nSlow it down, I need money though\nYouknowI'msaying? This just, just what I do\nOn the streets, y'knahmean?\nBabies need Pampers, man\nYouknowI'msaying? I don't know\nI think about it, I think about it, yanahImean?\nMy responsibilities, I've gotta focus more\nYou might be right though, you know\nMaybe things'll start coming to me naturally, you feel me?\nStarting praying more, youknowImean? Be with the family more\nAnd, I might live longer, you feel me?\nWord... you... just feel like you right, though\nI don't know... I'mma take your advice though", "image": "https://images.genius.com/f1bbc70540da138c70debc041f381d0f.1000x1000x1.jpg"}], "artist": "Ghostface Killah"}