{"songs": [{"title": "You’re My Heart", "album": "Walking with a Panther", "year": "1989-06-09", "lyrics": "[LL Cool J]\nDo you remember, the first time you fell in love\nThe way it felt, the way it feels\nBein able to say, from the bottom of your heart\n{*smooch*} I love you for real\nYour eyes, meet; you feel your heartbeat\nPalms are sweaty you can't keep still\nAnd when you finally touch 'em, and hug 'em and kiss 'em\n.. OOOOOOH what a thrill!\nYou was always searchin, and finally your dream came true\nThey came strollin along\nAnd you promised 'em, straight up and down sweetheart\nI swear - I'll never do you wrong\nHand in hand, heart to heart\nNothin in the world could seperate the two\nAnd even though you've only known that person for a short time\nYou tell 'em I love you -- you're my heart\n\nYou argue witcha parents, and they argue BACK\nYou're too young to be so serious\nYou tell 'em that's not true, I'll go on without you\nAnd walk away aggravated and furious\nYou want 'em to approve, but then again it don't matter\nThe relationship's yours\nYou feel you're maturin, and hey..\nYou can fight your own battles and wars\nYou discuss it with your love and it's the same for them\nSo the two of you decide we're gonna weather the storm\nLife is sweet, kissin caressin and huggin\nAnd keepin each other warm\nBut now comes the serious part, cause love\nBelieve me, it ain't a easy task\nWe'd have one argument too many\nAnd you'd have to ask -- am I still your heart?\n\nAm I still your HEART or is somethin, pullin us apart\nCause baby if it is, please let me know what\nYou run out the door, I tell you come back\nI love you - you shout out, so what?\nHow could you hurt me? How could you treat me\nLike you never loved me, were you playing a game?\nAnd if so, I only have one request: sit down and explain\nTo me, the person who treated you right, did you right\nAnd held you tight, every night\nIs there another lover in your life, that has you uptight?\nCause if it is, aww, baby, please.. don't do this to me\nI'm tryin to reach you, tryin to talk to you\nIt's killin me -- cause you're my heart\nThat's right I admit it\n\nYou're my heart I refuse, to let you go\nI struggle and fight for you against all odds\nGet down on my knees, and pray to God\nThat our love is in the cards\nCause I know you're right for me\nAnd I know I'm right for you\nThere's no way in the world I'll let you slip out of my hands\nPeople say forget about it, move on\n.. but see they don't understand\nYou're nothin to them, but you're so much to me\nSo much in fact that I'd give my life\nTo stare into your eyes and caress your face\nAs the priest, announces us man and wife\nWe'd live happily, ever after\nWhite picket fence and the whole nine yards\nAnd anything that anybody said\nI'd disregard -- if I was still your heart\n\nSo make up your mind, cause I've made up my mind\nI'm beggin you baby please come back home\nI'll be tossin and turnin, as I lay in my bed\nSorrow surrounds me I can feel it in my bones\nThis can't be true, I'm losin you\nOh Lord have mercy, please make it alright\nAll I wanna do in this whole wide world.. is hold you tight\nI've ripped open my heart, shed tears and cried\nNow it's up to you baby, please understand\nI forgive you for everything, and give you anything\nJust let me take ya by the hand\nAnd lead ya, baby I got ya\nProtect you like a mother, protects a child\nNow it's up to you.. I'mma call you in a little while\nYou're my heart", "image": "https://images.genius.com/35b951a9c90707d0d03de9bebbadefc6.999x999x1.jpg"}], "artist": "LL Cool J"}