{"songs": [{"title": "Spanish Plug", "album": "Trap-A-Thon", "year": "2011-03-09", "lyrics": "[Intro]\nGeah, geah, geah, yeah\nGucci, Gucci, huh, huh, huh, ha?\nGucciracci baby, Gucci Gucci\nCocaína shawty\n\n[Chorus]\nWhen I see my plug this how I talk to 'em\nAnd when I serve my folks this how I talk to 'em\nWhen I'm with my dogs dis how I talk to 'em\nIt's Gucci Mane, Laflare, I'm fin' to talk to 'em\n\n[Verse 1]\nTo my guala, my partner, molta manana\nGracias, de nada, brought me years of dollars\nQue pasa amigo? Cocaine more bonito\nCohina mucho es grande on the repo\nEse el pablo, my barrio your barrio\nComprende my friende you speak real good ingles\nSix hundred Wednesday, five thousand Tuesday\nEl nombre es Gucci, no punta, no pussy\nCoronas and kushi, kilos and elbows\nChito seritos, they come from Mexico, there he go\nTwenty tacos and it got me fifty burritos\nS550 Mercedes on Flat Shoals\nQue pasa, manana, my guala guala my partner partner\nLove to treat a nigga to a steak and a lobster\nNow a nigga owe them a million dollars\nGot me making ten G's an hour, money's power, time is money\nYou don't know the nigga then serve the dummy\nServe the junkies then ride Ashantis\n\n[Chorus]\nWhen I see my plug this how I talk to 'em\nAnd when I serve my folks this how I talk to 'em\nWhen I'm with my dogs dis how I talk to 'em\nIt's Gucci Mane, Laflare, I'm fin' to talk to 'em\n\n[Verse 2]\nWhat the bumba claat? My trap spot, dreadlocks and rastas\nRude boys and rude girls, Jamaican mobsters\nI shot the sheriff, smokin' Bob Marley\nAll of this ecstasy is killin' me softly\nTurgo and curry, mid grade so pretty\nSex spot my ex-spot, can't dodge that red dot\nSmokin' the lah-lah, can't get no higher\nWhere is me iya? She sends me fiyah\nWhere is me lighter? Look at me ice-a\nStep up your neck piece, I like your wife-a\nI pack a rifle, I loves me life-a\nPut up your hands 'fore I put up my rifle\n\n[Chorus]\nWhen I see my plug this how I talk to 'em\nAnd when I serve my folks this how I talk to 'em\nWhen I'm with my dogs dis how I talk to 'em\nIt's Gucci Mane, La flare, I'm fin' to talk to 'em\n\n[Verse 3]\nWhat's up nigga, what it do? I'm good my nigga, how are you?\nHalf a chicken, whole chicken, quarter chicken, what it move?\nBentley coupe on Bentley shoes, hell naw them ain't 22's\nStill keep coke in inner tubes, plottin' on my next business move\nTwenty-six inch tennis shoes, old school painted Maserati blue\nBrought my gun, but forgot my roof, pullin' up wit'cha baby boo\nOoh ooh, it's you know who, it's NASCAR baby what you gon' do\nLooking for somethin' thick I can screw, paint change and my diamonds too Trap nigga watch remindin' you\nMy grill and rang be blindin' you\nIf you a stubborn artist I'm signin' you\nI'm still the same nigga that be shinin' too\nTrap nigga watch remindin' you\nMy grill and rang be blindin' you\nIf you a stubborn artist I'm signin' you\nI'm still the black nigga that be shinin' too, bitch~!\n\n[Chorus]\nWhen I see my plug this how I talk to 'em\nAnd when I serve my folks this how I talk to 'em\nWhen I'm with my dogs dis how I talk to 'em\nIt's Gucci Mane, La flare, I'm fin' to talk to 'em", "image": "https://images.genius.com/ed3e421b5a72357602ba74695d877b0f.500x500x1.jpg"}], "artist": "Gucci Mane"}