{"songs": [{"title": "Worst Enemy", "album": "Absolute Power", "year": "2002-09-24", "lyrics": "[Intro]\nI'ma tell y'all a lil' story man,you know I'm sayin'?\nYo this is a song about, somebody who did me wrong dawg\nI thought you was my homie man.. I guess not\nFuck it\n\n[Verse]\nYou was supposed to be my dawg\nHomie, when I first met you, what was told to me was fraud\nWhat a shocker, an imposter! I've been crossed, I lost ya\nMy best friend turned out to be an enemy that's endin' me\nHidden, no sympathy, no empathy either; homie, I never denied ya!\nNuttin' that you wanted: women? I never player-hated\nI hooked you up, booked you up from the beginning\nThis enemy had love for you, shared blood for ya\nWhen ya wanted to dig? I dug for ya, nigga\nBut you a double-crosser, nasty hand-tosser\nI shoulda known you was evil\nWhen you told me you was cool 'fore we'd be sex fools when we under the steeple\nThe retrieval: I'm tryna get my life back\nNo more stoppin' women from puttin' a knife at ya cap\nRemember when we was kickin' it? Bitches was givin' it everyday\nWe did it in every way, but the respect went away\nYou got a mind of your own now; you're grown now\nCan I ask you a question? Did you forget we kinfolks, nigga?\nWe the same complexion! I'm stressin'!\nYou was always in front of me so I listened\nEveryday you wanted me on a mission\nI even let you have sex with my lady like a G\nInfatuated with you and not me\nI sucked it up, I got back wit' her, you fucked it up\nBy lettin' her know I was creepin' around with every chick in the town, buster!\nI shoulda known not to trust ya!\nListen, I'm losin' my life because of you!\nI lost my life because of you! I'm losin' my wife because of you!\nI even had sex and a baby with the crazy bitch you introduced me to!\nNow I'm straight depressed, I hate your flesh\nBut fate was just belate to Tech, laid to rest\nEvery time you got drawers, you made my poor little life fall nigga, ya got balls\nYou ain't never had a partner like me\nReal, I never ever sold ya pipe dreams\nPersonal? Yes, it might seem\nNigga when you was burnin', I went and got the Doxycycline\nLooked out for ya health, and this is all the respect I get?\nHater, ya neck I'll slit, but I can't, 'cause I'm attached to ya\nAnd I don't know why, sometimes I wish you would just die\nIt would eliminate all this hurt\nMaybe I could get up outta all this dirt ya caused me\nSo strong, nothing could stop you, not even cerebral palsy\nI can't believe it; my best homie turned on me\nYou musta forgot we grew up together\nI'm through, life is over now, there's nothin' else to do\nPoint the finger and blame it on you\n\n[Tech + (sung)]\n(It's all because of you, you, you)\nI lost my girl, my world, is upside down because I found you wasn't shit\n(It's all because of you, you, you)\nBroke us in two, you untrue, don't know what to do, I'm talkin' to you (who?)\nMy dick\n\n{*chanting and thunder till fade*}", "image": "https://images.genius.com/478a9ba0370b10241e03f91f6e741b36.1000x986x1.jpg"}], "artist": "Tech N9ne"}