{"songs": [{"title": "Remember High School", "album": "The Language of My World", "year": "2005-10-10", "lyrics": "[Verse 1]\nYo, remember high school?\nWith that dude who thought he was so cool\nWalking around like everybody should know who, he is\nLike he was some superstar in the biz\nJust because he had a Japanese car and some rims\nIt's silly ain't it?\nIt goes to show how tainted\nCause these hoes jocked him like he was somebody who supposedly made it\nAnd I'm not hating man, the dude was my boy\nBut I watched girl after girl get their world destroyed\nNow when a squirrels a squirrel and a nut is a nut\nAnd I seen a lot of girls cut so they could get stuffed\nOr at least be cool in the high school soap opera\nCause kids do anything to be popular\nGuys get their hair cut so girls can jock ya\nBut if girls get with guys their known as a trick\nBut if a dude does the same shit, he's known as a pimp\nAnd the question is: Is there really a difference?\n\n[Verse 2]\nRemember that girl in high school that everyone wanted to hit?\nShe wore them dresses with the bestest breasteses the size of Texas\nAnd she was the queen of estrogen, White, Black, Puerto Rican, and Mexican\nAnd she sat next to you in third period\nShe powdered her face but her skin had no flaws\nHer tits looked like she wore three wonderbras\nThank God for that math book you put on your lap to\nCover up your jeans when your dick got hard\nI mean she was amazing I'm not playing\nYou were like 14 but she was still the kind of girl you wanted a baby with\nAnd I could tell the way that she would rock them pants\nThat a lot of dudes hit it but she wanted a chance\nYou talked to her, but she gave you the shoulder\nShe was the type of girl that was cold as Boulder\nShe'd only mess with ya if you drove a Rover\nWhat I push? Well fuck it\nLet's just say a bucket. OK\nAnyway one day I rocked a show\nAnd I see her right there chilling up in the front row\nNext time I go to my math class for sho' she's talking about\n\"Hey yo bro, I didn't know that you flowed\nHey yo what's up with that CD? Maybe we could eat lunch after P.E\nAh hee hee hee hee hee\"\nIf it's the mic you rock, the car you got, the 3-pointer you shot that get's the girl then she's probably a breezy\n\n[Verse 3]\nRemember high school with that girl you can't remember? (Who?)\nThe one that never stuck out, she kind of looked like whatever\nKinda nerdy, never came to the parties\nShe went home after school and never really chilled with nobody\nShe was in one of your classes and used to wear glasses\nWith braces that accented her pimples that weren't really attractive\nBut she was good in Spanish and let you cheat off her answers\nBut when you'd see her in the hall you would walk right past her\nYou acted like a bastard and never treated her right\nCause her body wasn't buckling and her face wasn't tight\nWell guess what\nSee that beautiful girl with the big butt\nStanding at the incense shop reading the poetry that she writes\nThat's her. Oh hell nah, I know that's not her\nWait minus the pimples, the braces, and a lot less nerd\nTake off the overalls and the baggy sweatshirt\nYeah there she is, reading about her words\nShit, man I'mma go spit some game\nWait I see some resemblance from like way back in the day\nI rememeber that girl that only liked me cause I rhymed\nAnd now I'm really only talking to this girl cause she looks fine\nBack when she was normal I wouldn't give her my time\nShit that's crazy\nI kinda feel sleezy\nIf I could flip the scenario\nI'm the same as these hoes\nKinda like the male version of a breezy", "image": "https://images.genius.com/a341d7269423ec87ff688b91d8b38e47.800x800x1.jpg"}], "artist": "Macklemore"}