{"songs": [{"title": "Audio X", "album": "Cypress Hill IV", "year": "1998-10-06", "lyrics": "[Intro]\n\"T-Minus 10, 9, 8, 7, 6.. 5, 4, 3, 2, 1.. zero!\"\nBlast off\n\n[Verse 1: B-Real]\nCome inside, hello everybody, welcome\nThink you better be ready for the battle when the shit goes down\nCause we warrin'\nAll you fuckin' yellow comets runnin' from the front line\nIf anybody wanna get away, hey\nI'll find your fuckin' ass in due time\nRun and seek shelter but you never will escape\nFlippin over the gate, cause you can't wait\nTo get your fuckin ass away\nBut you're trapped, and there's no way out of this mushroom cloud\nBut you never wanna realize that I'm planted\nIn your mind now\nCypress Hill compound, you could hear the sound\nLet another motherfucker run up\nAnd I'll put your ass down (down)\nThen I'll peal from your cap the Cypress Hill star\nQuick look around, you can't hide\nYou just might die right where you are\n\n[Chorus: B-Real]\nAudio X - We're gonna your blow your head up (up)\nSynthetic flows, they gonna make you get up (yeah)\nGive me any record and I'll flip it any style (style)\nNiggas can't help it, cause they bumpin the shit loud\n\n[Verse 2: Barron Ricks]\nAiyyo whasup kid, feel the rush, glad you kept in touch\nWith these niggas who be puffin on the Dutch\nBustin guns, lay back in the cut\nCan it be, it's just a dream when you're on your scene smokin the green\nCause ain't shit never what you think it seem\nFrom the streets where life ain't cheap\nCypress Hill, Soul Assassins, while you askin, \"Who dat rappin?\"\nWe get all up inside your grill, with the skill\nShoot to kill when it's time for action\nSee you can't hide, from this homicide, that ain't no lie\nBetter kiss that black ass goodbye\nWhen you try to play these wiseguys\nSo who's complainin when we intensify the levels on the ryhme\nYou better get ready for the battle when the shit goes down\nBecause we are the wild\n\n[Chorus: B-Real]\nAudio X - We're gonna your blow your head up (up)\nSynthetic flows, they gonna make you get up (yeah)\nGive me any record and I'll flip it any style (style)\nNiggas can't help it, cause they bumpin' the shit loud\n\n[Break: Barron Ricks]\nAudio terrorists\nMic specialists\nAbout to blow this\nBlast off\n\n[Verse 3: B-Real]\nLookin in your eyes, I see your body bag figure\nBetter be ready for the battle when the shit goes down\nCause it's on nigga\nWhat you wanna do, you better pay close attention\nLet it be known, I control the zone\nBeyond your comprehension\nBlunt session, you feel the tension begin to rise\nFuck and feed him, if they can't take a joke\nAnd get high\nI'm feelin lye, in my lungs, what the deal bro?\nSo many people wanna hit my joint\nBut they never got none\nImagine that bullshit, happens all the time\nNiggas better start growin they own\nThey cannot fuck with mine\nGive me any record and I'll flip it any style\nBeginners better run back to the lab\nAnd practice for a while\n\n[Chorus: B-Real]\nAudio X - We're gonna your blow your head up (up)\nSynthetic flows, they gonna make you get up (yeah)\nGive me any record and I'll flip it any style (style)\nNiggas can't help it, cause they bumpin' the shit loud\n\n[Outro: Barron Ricks]\nThis has been another Audio X exclusive\nBlast off!\"", "image": "https://images.genius.com/4f0b9d852eece67bb00fcc4712c945bb.500x500x1.jpg"}], "artist": "Cypress Hill"}