{"songs": [{"title": "Housecalls", "album": null, "year": null, "lyrics": "Hello this is Dr. Dre. I'm not in right now\nBut if you leave your name and number at the sound of the beep\nI'll be sure to give you a call as soon as I return\n\nHello, Dre, this is Patricia. My husband's out of town\nAnd I was wondering, do you make house calls?\n\nRidin' in my car alone not doin' anything\nStopped the answering service because I knew my phone would ring\nHeard it ring once so I picked it up and said hello\nIt's Dr. Dre, baby, not your average gigolo\n\n[Chorus]\nCuz I make house calls, it's Dr. Dre the maniac\nHouse calls, the human aphrodisiac\nI love those house calls to the girls that's all alone\nHouse calls, when your husband's not at home\n\nIt's a quarter after two, I said I'd show around three\nHer husband's out of town and she would like some surgery\nStopped at the stores so I could get a little wine\nBut all they had was Thunderbird 1979\nSo I left the store, got in my car, drove to her house and then\nKnocked on the door and heard this sexy voice that said come in\nOpened the door to see what I got from this house call\nTall, dark and lovely, 5 ft 8 in a camisole\n\n[Chorus: 2x]\nNow my name is Dre, 6 ft tall with wavy hair\nThe one that comes around when your man just doesn't care\nSo if ya feelin' sexy late at night and you're all alone\nJust think about the doctor, pick up the telephone\n\n[Chorus: 2x]\nHello this is Dr.Dre. I'm not in right now\nBut if you leave your name and number at the sound of the beep\nI'll be sure to give you a call as soon as I return\n\nDre, this is Rene. Do you take American Express?\n\nDre, this is Alicia. You know what the mood is\n\nYo Doc, Lonzo, Two jaccuzis free. Bring yo trunks\n\nYo, it's me again. About those trunks. Forget 'em\n\nYo Dre man, wassup, huh? Cathy's back in town\n\nDre, I think (inaudible) knows about us\n\nSay fool, you left ya driving license over here last night\nNow I'm a have to whoop yo ass", "image": "https://images.genius.com/bf3badae49c33b583126057638078bd8.576x576x1.jpg"}], "artist": "Dr. Dre"}