{"songs": [{"title": "Quotations from Chairman Fred", "album": "DROGAS WAVE", "year": "2018-09-21", "lyrics": "[Verse 1: Lupe Fiasco]\nUhh, I exist, spoken in a confident voice\nCan world shift and continent hoist\nLook under for the plunder\nA rich man's song that gets sung for a sum out the lungs of a stunner\nBut life turns to a station and a hustler to a hummer\nWent from speaking and now not even sinking\nThe game is karaoke ’til it tries to punish poke me\nKinda throw me words slowly, fade degrading in the foley\nWaving metal sheets make thunder\nFooling I was younger; fool me when I'm older\nFool me now, screw me down to the sofa, taking Soma\nDrinking soda, eating vulture, tweeting vulgar\nPlaying Madden getting fat and getting cultured with the quotes\nIn the hopes people will get the jokes\nIf it rains you will get the float\nBut only if they're still building boats\n\n[Interlude: Dr. Eric Thomas]\nBut your values system says you believe in sleep\nMore than you believe in grinding\nYour values system says you are a consumer and not a producer\nThat you’re spending more money than you're making\nWhy? Because you're a consumer, you're reading all the books\nAnd you're saying everything the books are saying\nBut those books are not in alignment with your values!\nAnd you're gonna go to the next level\nYour values are gonna have to change\n\n[Verse 2: Lupe Fiasco]\nUhh, Drunken Fist versus Praying Mantis\nWas it God's plan or man mismanaged to turn New Orleans to Atlantis?\nThey lie in the streets to lambast\nThe black land swam at like a HE MAN in a bathtub\nFire! Cup up the bad blood\nHope hand tugs come right after the lackluster backrubs\nOr half structured or tech hubs or wack love\nThat's stacked as if chance in community chest\nGod said, \"Don’t you ruin me yet\nUntil I give them everything and there’s just two of these left\"\nBlack bumper slow fades into a vista\nRapid cuts a stock footage which freezes on a listener\nGive me love, lovers\nI read it like blood color on the head of a flooded structure\nCan't keep the duck rubber under, fundamentally it’s buoyant\nIt rises like court rooms to swoon for your enjoyment\n\n[Chorus: Nikki Jean]\nEvery single word you said\nWill you say it to me?\nWell it stays with me\nI heard every single word you said\nWill you say it to me?\nWell it stays with me, hoohh\n\n[Verse 3: Lupe Fiasco]\nTrap music meets trapezoids, fake his own death\nThey roll rocks like asteroids to the crest\nThink outside the box, I wrap a toy in a cheque\nThen watch a sissy fuss with a boy in a dress\nMad at the world, in a voice of a man\nWith a bag of a girl, she just avoids the success\nIt's what he said, or what she said\nDouble entendre no matter how you play it\nThen he takes the sex tape and destroys the cassette\nAnd puts the ribbon in the sky like the limited of eye\nThen prepares to utter, what's been a symbol in its side\nAgainst the ticker tape scene in a Silver Lake dream\nSorta orders the lungs to unmilitate screams\nShouts to a forged son with imitate beams\nIn a blue sky filled with pornographic strings\nGetting caught up in the trees, I still believe in Jesus!\n\n[Interlude]\nOur purpose is to ensure\nThat literature and art sit well\nInto the whole revolutionary machine\nAs a component part\nThat they operate as powerful weapons\nFor uniting and educating the people\nAnd for attacking and destroying the enemy\nAnd that they help the people fight the enemy\nWith one heart and one mind\n\n[Chorus: Nikki Jean]\nEvery single word you said\nWill you say it to me?\nWell it stays with me\nI heard every single word you said\nWill you say it to me?\nWell it stays with me\n\n[Outro: Bishop Edgar Jackson]\nThere was a man who wrote many things\nBut Carlyle said, um, that we could not be ruined\nBecause no lie could live forever\nWilliam Cullen Bryan said, \"Truth crushed to earth, would rise again\"\nAnd James Russell Lowell, made it more plain\nThat we would not be ruined or destroyed\nBecause he said that, \"Truth, forever on the scaffold, lies forever on the throne\nBut that scaffold sways the future, and behind the dim unknown\nStandeth God within the shadow, keeping watch, above his own\"\nThese powerful scriptures were also used by the man\nIn whom we celebrate his birthday today, Dr. Martin Luther King\nAnd Dr. King told us to practice non-violence and the power of love\nNon-violence and the power of love has brought us thus far\nThe agape love that we have for ourselves\nThat we have for our people is the reason why our people\nIn this particular diaspora called, North America\nHave not been totally ruined\nWe have not been totally destroyed, we have not been exterminated\nSo therefore, uh, my dear brother, um, Wasalu\nWe call you, we thank you for what you've asked me to do\nAnd we shall continue to study to show ourselves approved under God\nWorkman that needn’t not be ashamed\nRightly this dividing the word of truth\nAnd so at this time, in this city\nWhere young men's lives are not worth much\nIn this city where our people have been discriminated against\nAnd kept from the resources which we\nRightly deserve as a majority of people in the city\nWe are dependent upon the most high creator of the ends of the world\nThat I call Elohim Jehova\nAnd we are dependent upon him to keep us from falling\nTo keep us from being ruined, to keep us from being exterminated\nAnd we thank the Almighty\nFor the privilege of being here with my niece\nIs to impart these words\nAnd I hope it would be of assistance in this project\nGod bless you and thank you", "image": "https://images.genius.com/86aa1a0cb9e9a473ce83eb531fa78079.500x500x1.jpg"}], "artist": "Lupe Fiasco"}