{"songs": [{"title": "The Love Song", "album": "We Are Hip Hop, Me, You, Everybody, Pt. 1", "year": null, "lyrics": "Paroles {The Love Song (Da Bush Babees)}\n\n[Featuring Mos Def]\n\n[Mos Def]\nEverybody.. should get down oh yes (oh yes) oh yes\n\nIntro/Chorus One: Mos Def\nEverybody groove to the music\nAnd do what you like to oh yeah (oh yeah)\n\nChorus Two: Mr. Man (Mos Def)\nBush Babees (Bush Babees)\nY'all know we rock thorough (Yeah we rock thorough)\nFor the whole world (The whole world)\nFive boroughs.. so check it out\n* Chorus One seperate then Chorus Two overlaps One *\nI came all the way from Brooklyn to present my rep\nLyrically deep like sleep; I rock hard like Led Zepp\nI take steps and leave impressions on planets\nMore complicated than life so rappers can not understand it\nTalking that hardcore shit; but I don't buy it\nSit down eat your slice of pizza and be quiet!\nCause all that noise you talk is not needed\nI cut headz off at the knees and leave em all defeated\nSo stay seated, or get deleted from the program\nLet it be known I don't follow cause I'm my own man\nWith my own plan, cause the mind is infinite\nWe got four minutes, so everybody get widdit!\n* Chorus One and Chorus Two combined *\n\nChorus Three: Mos Def\nCause all my people out in Brooklyn get LOVE\nCause all my people out in Queens get LOVE\nUptown and Boogie Down you get LOVE\nStrong Island/Shaolin you get LOVE\n[Mr. Man]\nYou can send MC's in - squads of six and we take two each\nI stand out like seeing Moses at the beach - splitting\nWaves\nMy style's the newest rhyme craze\nBlow up, like grenades, hit words, without shades\nHold ya lighter, the Flatbush dolla camp writer\nRoll with more Dangerous Minds than Michelle Pfeiffer\nPay the piper, I lay the pipe just like a plumber\nWent without a ride for one too many summers, NOW\nI'm out to get the cream like Carnation\nSend headz home like George Bush did to Haitians\nNo patience, I got ta have it, the fine fabric\nI learned The Facts of Life from Mrs. Garrett\nBut now I'ma do it my Way like Carlito\nWhether it's in sweatpants or even tuxedos\nWe know - if this rap thing, don't make loot\nI take it back to '86, stick niggas for they Troops\n* Chorus One and Chorus Two combined *\n* Chorus Three *\n[Y-Tee]\nWe come to tell the people dem, we're talkin one love\nOne are we in love, a way dem cyan't dub\nThey'll find it in a pub, and I said in our club\nWha-wha-one love (one love) gonna take it, gonna take it\nGonna take your jeans and your dungarees and it will be on\nSale\nThings I can try to make you move on the wail\nAiyyo, no play yo, don't go astray yo\nNo matter follow me come be a one of these day yo\nI cyan't believe what dem want in all de mornin\nSo I, I came back in all de evenin\nDa same thing that made the lights out, be sing\nRude bwoy, bad-a-bing, bad-a-bing, now everybody\n* Chorus One and Chorus Two combined *\n\nChorus Four: Mos Def\nCause all my people Up North get LOVE\nAnd all my people Down South get LOVE\nAnd all my people in the East get LOVE\nAnd all my peoples out West get LOVE\n[Mos Def]\nAnd all over the world we get LOVE\nAll over the world we get LOVE\nAll over the world we get LOVE\nWe get LOVE! WE GET LOVE!!!\nWe get, love everywhere we go\nWe get love at ev-ery show\nWe get love everywhere we ride\nWe get love at ev-ery stop\nThis is a station, identi-fi-cation\nFor the entire nation\nCome to bring sensation, oh yes!\nIt's Da Bush Babee clan\nCome to make you understand\nThat we get love all over the land\nAll over the land\nAll over the land, all over the land\nAll over the land, all over the lannnnnnd\nYeahhh, oh yeah, yeahh, yeahh\nWord up, it's the Mos Def\nWith Da Bush Babees\nAnd mad man Merc and the De La\nWord up, bringing it to you the nine-six\nIt's all magic no tricks, knahmsayin?\nComin widdit\nYou gonna love it when you get it\nEv-ery-body, groove to the music\nEv-ery-body, groove to the music\nEv-ery-body... HEY YOU GUYS!!", "image": "https://images.genius.com/facf74257c67da04641635f3cd67e725.268x268x1.jpg"}], "artist": "Yasiin Bey"}