{"songs": [{"title": "Forever", "album": "The BDP Album", "year": "2012-01-10", "lyrics": "[Hook: sample]\n(Get what I'm saying? Forever!)\n\n[Intro:]\nYeah! Kenny Parker in the background! (Forever)\nGimme a little more kick Kenny, Ima about to bounce it like this\n\n[Verse 1: KRS-ONE]\nLook! Look at him, look at them, look at her\nWhat's about to occur, is what you prefer to occur\nWhile these other rappers sloppily slur\nKRS-ONE inspires you to be a street entrepreneur, (forever)\nCause I don't do dance lyrics, I do advanced lyrics\nOrganize frequencies that advance spirits\nSo try not to make the mistake again\nOf hanging with fakes again\nThen comparing them to the ones that created them, (forever)\nYou should never try to compare me\nUnless its to that little kid being held by Holy Mother Mary\nI'm a whole different kind of scary\nBring your military, I'll smash you and all your subsidiaries, (forever)\nBut am I, over your head, You like them others kid\nYou don't know that you're dead\nIts easier, to pass the GED, The G-E-D\nThan try to battle me?\n\n\n[Verse 2: Channel live]\nI'm down with BDP, you just down with O.P.P.,\nI keep planets in orbit, you know, ODB\nI'm from E.O., you just a slave to O-E\nAnd you don't even know yourself, how the fuck you gonna know me, (forever)\nKnowledge Reign Supreme, Hakim means the wise\nBut the best part is understanding forever, we will rise\nBut ya'll stay on ya knees, beggin' please don't squeeze\nYou thought it was chill to the undercovers that squeeze\nNow you all fucked up, this rap zoo is just a tease\nWith little young niggas runnin' around, claim to be OG's\nWhen they only just ice stuck at thirty-two degrees\nAnd they ain't Just-Ice, Kool G Rap, or Ice-T, (forever)\nLike the \"T\" in Terror Squad, we bring the terror hard\nIf Hip-Hop is a nation, BDP is the national guard\nKRS the national god, and I'm like John the Baptist\nI'll watch ya niggas up you even think to try to attack this (forever)\n\n[Outro: KRS-ONE]\nThe one, thats wassup number one\nOnly zero comes before, and thats none\nThe beginning, you can survive with one lung\nAnd even one kidney, no kidding\nOne, two, three, four, without one\nTwo, three, and four are no more, done\nKRS The One...\n\n[Hook: sample]\n(Forever. Do you understand? Forever!)", "image": "https://images.genius.com/b5b9e2d96fe62cc9ca0b863120040330.960x960x1.jpg"}], "artist": "KRS-One"}