{"songs": [{"title": "Medley (Live at the North Sea Jazz Festival, 2005)", "album": "Live at the Jazz Room", "year": "2005-07-10", "lyrics": "[Intro]\nA freak freak y'all, and you don't stop\nA-to the beat y'all, and you don't stop\nA freak freak y'all, and you don't stop\nA-to the beat y'all, and you don't stop, come on\nFreak freak y'all, and you don't stop\nA-to the beat y'all, and you don't stop\nA freak freak y'all, and you don't stop\nI wanna see if y'all up on this hip-hop right here\n\n[Run's verse from Run-DMC's \"Sucker MC's\"]\nTwo years ago, a friend of mine\nAsked me to say some MC rhymes\nI said this rhyme I'm about to say\nThe rhyme was def but then it went this way\nTook a test to become an MC\nAnd Orange Krush became amazed at me\nDerek put me inside the Cadillac\nThe chauffeur drove off, where we take 'em to, Dummy?\n\n[Erykah Badu sample from \"Love of My Life\"]\n(Way back) Uh, where we goin' y'all? We go ooh-ooh-ooh\n(Way back, yeah) Sing it with us y'all, over here, where we goin'?\n(Way back) Uh, over here, go ooh-ooh-ooh\n(Way back, yeah) Alright, see if y'all know this\n\n[Fat Lip's verse from The Pharcyde's \"Passin' Me By\"]\nNow there she goes again, the dopest Ethiopian\nNow the world around me keeps on movin' in slow motion\nWhenever she happens to walk by, why does the apple of my eye\nOverlook and disregard my feelings no matter how much I try?\nWait, no, why didn't I pursue my little princess with persistence\nWas so low key that she's unaware of my existence\nFrom a distance I desired her, secretly admired her\nWired her a letter, and it went:\nMy dear, my dear, my dear, you do not know me\nBut I know you very well\nNow let me tell you about the feelings I have for you\nWhen I try or make some sort of attempt, I simp\nDamn, I wish I wasn't such a wimp\n\nBut I'ma take y'all (Way back)\nUh, yeah, where goin' y'all? Where goin', come on\nWe go (Way back, yeah)\nI can't hear y'all, sing it with me Den Haag\n(Way back) Uh, yeah, uh, it go ooh-ooh-ooh\n(Way back, yeah) Alright, see, y'all gotta know this\n\n[Common's verse from \"Love of My Life\"]\nY'all know how I met her\nWe broke up and got back together\nTo get her back, I had to sweat her\nThought she roll with bad boys forever in many ways\nBoys made her better, to grow, I had to let her, let her\nShe needed cheddar, I understood that (That)\nLookin' for cheese, that don't make her a hood rat (Rat)\nIn fact she's a queen to me, her light beams on me\nI love it when she sings to me\nIt's like...\n\n[Erykah Badu sample]\nLove of my life\nOoh, you know you rock my world and\nLove of my life\nYou b-boy and I b-girl and\nLove of my life\nWe don't stop until the break of dawn, ooh...\n\nHip-hop, hip-hop, hip-hop, hip-hop\nHip-hop, hip-hop, hip-hop, hip-hop\nHip-hop, hip-hop, hip-hop, hip-hop...\n...Hip-hop, hip-hop, hip-hop, hip-hop\nHip-hop, hip-hop, hip-hop, hip-hop\nHip-hop, hip-hop, hip-hop, hip-hop\nHip-hop...", "image": "https://images.genius.com/045767268a13a813bd7645f24fad7896.499x499x1.jpg"}], "artist": "Common"}