{"songs": [{"title": "Duel of the Iron Mic", "album": "Liquid Swords", "year": "1995-11-07", "lyrics": "[Intro]\nOh, mad one, we see your trap\nYou can never escape your fate\nSubmit with honor to a duel with my son\nI agree\n\nI see you're using an old style\nI wondered where you'd learned it from\nYou know very well, it's yours too\nHeh, I had forgotten, will you show me?\nAnd what have you come for?\nYou come here, since you're so interested - fight me\n\n[Verse 1: GZA]\nYo, picture bloodbaths in elevator shafts\nLike these murderous rhymes tight from genuine craft\nCheck the print, it's where veterans spark the letterings\nSlow-moving MCs is waiting for the editing\nThe liquid soluble that made up the chemistry\nA gaseous element, that burned down your ministry\nHerbal vapors and biblical papers\nSmoking Exodus, every square yard is plush\nFuck the screw-faced photo sessions, facial expression\nLeaves impression, try to keep a shark nigga guessing\nGive crazy shouts, son, here's the outcome\nCut across the semi-gloss rhymes you floss\nShit is outdated, just like neckloads of Sterlings\nSuede-fronts, bell-bottoms, and tri-colored Shearlings\nI ain't particular, I bang like vehicular homicides\nOn July 4th, from Bed-Stuy\nWhere money don't grow on trees and there's thieving MC's\nWho cut-throat to rake leaves\nThey can't breathe, blood splash, rushing fast\nLike running rivers, I be that whiskey in your liver\n\n[Hook: Ol' Dirty Bastard]\nDuel of the Iron Mic!\nIt's the fifty-two fatal strikes!\n\n[Verse 2: Masta Killa]\nThis is not a '85 affair made clear\nWhen the Gods get on to perform storms blew up\nWu's up, causing the crowd to self-destruct\nKiller Beez are stinging something while I reveal\nScience that's heavily guarded by the culprit\nBombing your barracks with aerodynamic\nSwordplay, poison darts by the doorway\nMinds that's laced with explosive doses\nDamaging lyrical launcher\nLunge at the youthful offender then injure\nAny contender, testing the murderous Master\nCould lead to disaster, dynamite thoughts\nExplode through your barrier, rips the retina\nWho can withstand the astonishing punishing\nStings to the sternum, shocked in the Hip Hop livestock\nSeeking for a serum to cure 'em\n\n[Verse 3: Inspectah Deck]\nAdults kill for drugs plus the young bucks bust\nDucking handcuffs, throats get cut when dough rush\nOut of town foes look shook but still pose\nWe move like real pros through the streets we stroll\nBullet holes lace the windows in one-six-oh\nSo control the avenues that's the dream that's sold\nBuilding lobbies are graveyards for small-timers\nBitches caught in airports, Ki's in they vaginas\nNo peace, yo the police mad corrupt\nYou get bagged up, depending if you're passing the cut\nPlus shorty's not a shorty no more, he's living heartless\nRegardless of the charges, claims to be the hardest\nIndividual, critical thoughts, criminal minded\nBlinded by illusion, finding it confusing\n\n[Hook]\nDuel of the Iron Mic!\nIt's the fifty-two fatal strikes!\nDuel of the Iron Mic!\nIt's the fifty-two fatal strikes!\n\n[Outro]\nHuh, Master, he must be dreaming, heh\nWell, if he is dreaming then he must be asleep\nAnd if he's asleep, then I will wake him up!\n\nAt the height of their fame and glory, they turned on one another\nEach struggling in vain for ultimate supremacy\nIn the passion and depth of their struggle\nThe very art that had raised them to such Olympian heights was lost\nTheir techniques vanished", "image": "https://images.genius.com/841993260ec6dbf12b80a5a3e780b041.450x450x1.jpg"}], "artist": "GZA"}