{"songs": [{"title": "My Savages", "album": "Monster", "year": "2014-10-28", "lyrics": "[Intro]\nI be on the phone with Doe Boy\nI be telling him, he inspired me to go harder\nKnow what I'm saying, real talk\n\n[Verse 1]\nMy savages, my savages, my savages\nI'm always dressing fresher than a mannequin\nI grew up in a ruthless ass environment\nI'm on the phone with yo, I ask him how the trial went\nThirty five racks is how my day was spent\nI gotta cock it back, that's how my day would get\nYou got me thinking all these bitches artificial\nThe way you acting you must don’t respect a real nigga\nRoll some herb up, pour some syrup up\nThey tried to infiltrate us and then betrayed us\nI told you way before what happened they was hating on us\nYou know when we was juuging for it they was mad at us\nAyy, this a letter for my dogs\nHow we let the money get between us\nHow we let these bitches get between us\nHow we let these niggas get between us\nI got love for all my savages with itchy fingers\nI got love but it ain't like the love I got for India\nShe held me down when I was broke, I got her to infinity\nMy lil' dog caught a murder, gone for infinity\nDumping ashes on your obituary, I know you feeling me\nR.I.P. my grand-dad Quick, he should have seen this shit\nTwenty thousand on some child support, I seen that shit\nRiding round with all them choppers, I done seen this shit\nThese rappers mad at me but these niggas ain't doing shit\nAnd I just bought a pound of kush so I can smoke that shit\nI went and spent a half a ticket at the dealership\nThe fame is doing a lot of damage to my friendships\nIf Esco didn't love me would've been done jumped ship\nAnd it's the love from my fans got me still here\n\n[Interlude]\nMonster!\nSay I'm Illuminati, they tryna make me catch a body\n\n[Verse 2]\nI don't know when I'ma flip, nigga\nGet me some codeine and sip, nigga\nBig bank saying wipe a nigga's nose, my girl changed the lock on the doors\nBefore this shit pour up a fo', ain't falling in love with no ho\nThat what you want for me? That what you really expect?\nYou thinking I'm sitting up depressed?\nI'm somewhere countin' up me a check\nI hate I had to fuck with any of you niggas, that's my only regret\nDrag the mink on the floor\nThe Cuban links on my ho\nTen whips in a row, who would think we were poor?\nWho would think we was poor?\nThere's money laying on the floor\nGot some hoes laying on some hoes\nGot a shawty with me, she a pro\nNo she'll never meet another nigga not another nigga like me\nEven if he got a billion dollars he can't make her cum like me\nWho compliment you like me? It better be about an image\nTell me all of this a gimmick, they thought the whips got rented\nBecause the Spurs weren't tinted, I told em ain't got nothing to hide\nI told em I'm through with the pies\nTold 'em fuck all of my wrongs, I don't even write\nMy savages, my savages, my savages\nWe gon' leave a nigga stiffer than a mannequin\nFree all my niggas incarcerated, you heard?\nLoyal for life, you heard?\nFree band gang! We global now...", "image": "https://images.genius.com/adc81ddb71fc3b8fc301fb13d3cb2324.500x500x1.jpg"}], "artist": "Future"}