{"songs": [{"title": "Who Shot Ya? (Original Demo Mix)", "album": "The Notorious B.I.G. - Ready To Die (The O.G. Edition)", "year": null, "lyrics": "[Verse 1: The Notorious B.I.G.]\nWho shot ya? Separate the weak from the obsolete\nHard to creep them Brooklyn streets\nIt's on nigga, fuck all that bickering beef\nI can hear sweat trickling down your cheek\nYour heartbeat sound like Sasquatch feet\nThundering, shaking the concrete\nThen the shit stop when I foil the plot\nNeighbors call the cops, said they heard mad shots\nSaw me in the drop, three and a quarter\nSlaughter, electrical tape around your daughter\nOld school/new school need to learn though\nI burn, baby, burn like \"Disco Inferno\"\nBurn slow like blunts with yayo\nPeel more skins than Idaho Potato\nNiggas know: the lyrical molesting is taking place\nFucking with Biggie Smalls, it ain't safe\nI make your skin chafe, rashes on them asses\nBumps and bruises, blunts and Land Cruisers\nBig Poppa smash fools, bash fools\nNiggas mad because I know that cash rules\nEverything around me two Glock 9s\nAny motherfucker whispering about mines\nAnd I'm Crooklyn's finest\nRepresenting for the queen, her royal highness\n\n[Verse 2: Keith Murray]\nCatch this one bubonic plague\nIn your head, back, chest, arms, and legs\nWhen I'm coming through grab your cranium for alternatum\nSon, I stay subterranium\nMy subliminals mix with criminal chemicals\nGot more milky syllables than alphabet cereal\nPlace your bet and your whole entourage will get wet\nThat's a promise 'cause Idon't make threats\nI'm a graceful poet with sadistic ballistics\nAbove and beyond all that other bullshit\nLinguistics aggressive antiseptic\nNerve-wreckin', concepted on consistent contestants\nMy deviant deliverance\nLeaves MC's in a state of mal mid depressin' (Word up)\nI launch flows like torpedos\nAt any god-given episode\nI be destined to flip so much funk shit\nAnd do niggas better than the government\nKeith Murray wrecks this with various combinations\nI'm sick, manifestation\nOh my god, it's the hardest, I make entourages\nAnd crews see mirages, Mary J. Blige is\nGod, gotta have my crew lace me up now", "image": "https://images.genius.com/97e6c354b8368e36130dd912210fd93d.1000x992x1.jpg"}], "artist": "The Notorious B.I.G."}