{"songs": [{"title": "You Don’t Know Me", "album": "Build and Destroy", "year": null, "lyrics": "[Intro]\nMoney.. and murder..\nThis is life, understand me\nYou don't know me\nNah.. nah.. nah\n\n[Royce Da 5'9\"]\nNiggas got the wrong views on this long uz'\nI'm nothin to prove, while you bluffin I use, I'm gon' shoot\nAs far as life, I've been lied to, looked down upon\nI had fights, too many to count 'em all, I'll round them off\nI been shot at, went back and got the drop on hoods\nNever been robbed, knock on wood, I don't buy that\nYo the streets is in you, we make Scary Movies\nNo beefs to be continued, only Sequel is lonely and peaceful\nIt's funny to see, niggas wanna be like me\nWho like me? Who represent the D like me?\nFuck the scribbles, I get right to the drawin\nMy head's on straight, I know right where I'm from, and right where I'm goin\nGimme one hit, per summer money come get - take it, it's yours\nWho's the king? Mummy un-stitched, the ruler\nThe one and only, fuck the pesos, now that we work\nThat's only a tenth of the dollar I'm worth - you don't know me\n\n[Hook: repeat 2X]\nYou don't know me, you just know what you hear\nThis is nothin you heard, it's just somethin you know when you hear\nJust makin you know when you hear, it's over this year\nI could even be phony, you don't know me (naw)\n\n[Royce Da 5'9\"]\nI'm hot though, disagree? You do not know\nAbout the streets, or the rap, you just macho\nI won't stop - every broke nigga got a opinion\nFor every dollar he don't got; fuck them\nSome of these niggas hatin me in my own city, but fuck them too\nI'm only here because of y'all niggas, so what sent you?\nI'm only wishin niggas'll stop dissin\nAnd pay attention to that little dot on the mitten I live in\nI don't compete, I teach\nFirst lesson - I'mma show the competition how to get beat\nIt's easy, you don't know me (no)\nYou act raw, but is it really you?\nLook, just gimme my money, that's all I ask for, I'm chillin\nI got lessons to tell, I rhyme like I'm desperate as hell\nHe who prevails will always keep records for sale\nNo matter what the case is\nI blew the fuck up, and now I'm back to rub it in the faces of haters\nYou don't know me\n\n[Hook]\n\n[Royce Da 5'9\"]\nYou might not like, you gon' respect it\nCause I flows 'til I'm restless, I keep stressin who the best is\nYou don't know me homie; you'll never hear\nA real nigga's name in my mouth, I talk about the phony only\nY'all missin the fact, that figures I'm paid\nAnd I'm still itchin to scratch a wack nigga, now that's dedication\nAs long as rap's as segregation, I can only speak for myself\nAnd all I can tell you is you don't know me (naw)\n\n[Hook] - repeat 2X\n\n[Outro]\nYo.. yeah\nMy name is Royce 5-9\nThat's all you know, huh?\nGet to know me first\nNah nah, huh?", "image": "https://images.genius.com/d86b45b993cdf0c53559e740521a4bba.500x494x1.jpg"}], "artist": "Royce da 5'9'’"}