{"songs": [{"title": "Low", "album": "K.O.D.", "year": "2009-10-26", "lyrics": "[Intro]\nDenver, Colorado\nPlease welcome for the last time of the strictly Strange tour 2008\nThe number one independent rapper in the world\nTECH N9NE!\n\n[Verse 1: Tech N9ne]\nHow could I be so down at a time like this, when I'm high like this?\nOn the billboard charts, many major tours overseas, when I fly like this?\nI've been thinkin' about the people that need me\nThey needy in all of the pain that I might miss\nSooner or later it seeks me, reach me\nThen bleed me deep in the rain inside my pit\nI'm goin' down now, because my mom frowns\nIn a research psychiatric center without her son around\nAnd I'm deep off in this hole, when I'm out here rockin' shows (They say)\nI should be hyped 'cause my life is so rock 'n roll!\nBut I feel like The Grinch mixed with Ebenezer Scrooge\nLet the fever ooze, up out of me, clouded me, never eager to\nLet up when I'm in an interview, they prolly be thinkin' they gonna hinder dude\n'Cause he be lookin' like he might offend the rule\nNever intricate to remember blues\nBecause is always right here, with the Hennessy and light beer\nLet it enter me and fight fear, yeah\nI know I quit, but I started back, the homie caught a gat\nAnd my bodyguard Nicholas just had a heart attack\n\n[Hook: Krizz Kaliko]\nI'm sinkin' again, I'm drinkin' again\nDrownin' in water, you're breathin' again\nIt's easy to sin when you're bleedin' within\nNeeding to grin, cheese and recede in the spend\n(Lower than low, lower than low)\nThat's how I feel in the morning\n(Lower than low, lower than low)\nThat's how I sound when you're callin'\n(Lower than low, lower than low)\nI'm high, but feel like I'm fallin'\nI'm sorry, but I'm feelin' lower than low!\n\n[Verse 2: Tech N9ne]\nMy smile is forced, my style is warped\nMorale is corpse, now that my really good pal is torched\nI'm just gone with the wind, I'm home with the gin, to the dome when I spin\nI'ma zone 'cause the phone must be roamin’ again\nAnother tone, I'm alone now I don't want me to spend time with\nI’m just mind this, might find Miss N9ne missed\nI find my mind in this lime ditch, dine quick, not even a second for mindless\nIn the middle of a time when the music's flyin' I've depleted my kindness!\nLow like the grasses, low like poor folks on Gratiot\nI'm so below the casket, ragged pulse of the maggots\nWhy do I feel this illness?\nI'm lookin' for somethin' to come and kill this a little bit\nI got my head in the hills 'cause the real shit is momma is sufferin', takin' pills with the stillness\nAnd I feel it, I can't shake it, in any case my space is the basement\nI can't erase my abrasive encasement\nI'm chasin' hatred, my taste not complacent\nSo as I go to the flo', the industry finally opened the do'\nBut now I'm in the motherfucker, all I feel is.. low\n\n[Hook: Krizz Kaliko]\nI'm sinkin' again, I'm drinkin' again\nDrownin' in water, you're breathin' again\nIt's easy to sin when you're bleedin' within\nNeeding to grin, cheese and recede in the spend\n(Lower than low, lower than low)\nThat's how I feel in the morning\n(Lower than low, lower than low)\nThat's how I sound when you're callin'\n(Lower than low, lower than low)\nI'm high, but feel like I'm fallin'\nI'm sorry, but I'm feelin' lower than low!", "image": "https://images.genius.com/de5c12836aa9b9bbb55356aafbf1fa0a.900x900x1.jpg"}], "artist": "Tech N9ne"}