{"songs": [{"title": "GRoCERIES", "album": null, "year": "2019-05-17", "lyrics": "[Intro: TisaKorean]\nM-M-M-Murda\nUh\n\n[Refrain: TisaKorean]\nI'm like oh my God, shawty tender like a strip (Strip)\nI'm like oh my God, shawty came in with the drip (Okay)\nI'm like her and her friend (Her friend), came for the show (Ooh)\nHer and her friend came for the show, I'm like, um\nCan you do it simple just like lemonade? (Ooh, lemonade)\nCan you do it simple just like lemonade? (Yeah, lemonade)\nCan you do it simple just like lemonade? (Ooh, lemonade)\nCan you do it simple just like lemonade? (Yeah, dawg, ooh)\n\n[Chorus: Chance the Rapper]\nUsed to carry all the groceries in in one trip (Hercules)\nSimply Minute Maid, gone in one sip (Drip, drip, drip)\nToo much dip on my chip (Hey)\nStiff arm a jit to get my lip balm (Yeah, yeah, yeah, yeah)\nUsed to carry all the groceries in in one trip (Hercules)\nSimply Minute Maid, gone in one sip (Drip, drip, drip)\nToo much dip on my chip (Hey)\nStiff arm a jit to get my lip balm (Hey, hey)\n\n[Verse 1: Chance the Rapper]\nTraffic, traffic, lookin' for my chapstick\nBig star, Patrick, haircut look like Brad Pitt\nFive star hotel, doorman look like Braxton\nFancy carpet make her feel like J-\nMake her feel like Jasmine\nMake her feel like...\nMake her feel like Jas'\nMake me feel like I choose you like I'm Ash\nTake me to the box, Bandicoot, let me crash\nOoh, make me sleep, make me dream, make me snore\nThen wake me up, baby, I'ma need support\nThank you, Lord\n'Member eatin' dinner, kitchen drawers full of sporks (Drip)\nI was always one to try to go over my aunt's (Yeah)\nSugar in the 'frigerator right next to the ants (Ew)\nI would make the Kool-Aid then go make a cooler dance (Yup)\nSince I was a shorty, nigga, always wore the pants\n\n[Refrain: TisaKorean]\nI'm like oh my God, shawty tender like a strip (Strip)\nI'm like oh my God, shawty came in with the drip (Okay)\nI'm like her and her friend (Her friend), came for the show (Ooh)\nHer and her friend came for the show, I'm like, um\nCan you do it simple just like lemonade? (Ooh, lemonade)\nCan you do it simple just like lemonade? (Yeah, lemonade)\nCan you do it simple just like lemonade? (Ooh, lemonade)\nCan you do it simple just like lemonade? (Yeah, dawg, ooh)\n\n[Verse 2: TisaKorean]\nPut some water on the grass to make it grow (To make it grow)\nI like her skin all black like a crow (Just like a crow)\nI'm like, \"Get it, please, baby, get it,\" uh\nI'm like, \"Dip it, nacho chip it,\" ayy\nShe like the club, but she don't dance, though (But she don't dance, though, okay)\nI text her kitty and she text me back hello (Eww)\nI'm like Simple Lemonade (Simple)\nI'ma play my cards right, I ain't talkin' spades (Okay, okay)\nThey should be afraid\nMoney growin' on the tree, it's gon' cause a shade (Ayy)\nPlease, can you hold on? Please, could you hold on? Ayy (Ayy, please can you? Please?)\n'Cause me and Chance ain't gon' take long (Grr, grr)\n'Cause me and Chance ain't gon' take long (Ooh, ooh, ooh)\n\n[Chorus: Chance the Rapper]\nUsed to carry all the groceries in in one trip (Hercules)\nSimply Minute Maid, gone in one sip (Drip, drip, drip)\nToo much dip on my chip (Hey)\nStiff arm a jit to get my lip balm (Yeah, yeah, yeah, yeah)\nUsed to carry all the groceries in in one trip (Hercules)\nSimply Minute Maid, gone in one sip (Drip, drip, drip)\nToo much dip on my chip (Hey)\nStiff arm a jit to get my lip balm (Hey, hey)", "image": "https://images.genius.com/f0e56540f66607b0e1b83c872a34f766.1000x1000x1.jpg"}], "artist": "Chance the Rapper"}