{"songs": [{"title": "On My Momma", "album": null, "year": null, "lyrics": "[Hook]\nOn my momma, I'm a get money all day\nAll night, somethin' like 24/7, on my momma\nI'm a stay fresh all day, all night, somethin' like 24/7\nOn my momma, I'm a pull up\nHop out with two of them Top Models\nHaters gon' hate, but before the ice grill, say, 'Stop\nLook at my motherfuckin' wheels'\n\n[Verse 1]\nThey'll say it's bizack for the first time\nYoung boy rhyme like '87 Rakim, locked in my own world\nNo fire hydrant can water down me though\nI'm a tyrant on Swizz beats, it's kind of ironic\nRoll up the chronic tree, Hennessy, let's see, can you get like me?\nWhite tee, L.A. fitted, roamin' the backstreet\nBack trunk, chopper clap back at me\nGirls get skeet-skeet on like Little John\nBME, I don't save 'em, even with coupons\nUsually I kick game like modern-day Bruce Lee\nRaw heat, never paranoid when ridin' on deep-dish rims\nFly as Clark Kent, invade the black like a martian\nThen say, 'Pardon me, no, pardon my arrogance\nIf you don't learnt else about I\nThen, motherfucker, you better know this'\n\n[Hook]\n\nOn my momma, you want to look at my wheels, huh?\nOn my momma, you want to know how it feel, huh?\nTo get like me, makin' them dollar bills, huh?\nPull up, hop out wit' my appeal, huh?\nOn my momma, she lookin' to pop a pill, huh?\nOn my momma, she lookin' to get a thrill, huh?\nShe want to go home, get that punani killed, huh?\nFace down, ass up, she know the drill, huh?\nI got a couple of soldiers ready to ride, huh?\nIt pop off the club, we finna leave outside, huh?\nWe see you duckin' and dodgin', flippin' to hide, huh?\nOn my momma, you play 'round and lose your life, huh?\nI'm funky-fresh all night, huh?\nSmokin' that chronic, high as a kite, huh?\nDrinkin' that brown bottle on site, huh?\nBeen pimpin', baby, swear I don't lie, huh?\n\n[Hook]\n\n[Bridge]\nLook at my motherfuckin' wheels\nLook at my motherfuckin' wheels\nLook at my motherfuckin' wheels\nLook at my motherfuckin' wheels\nYou ain't got to front, homie\nLook at my motherfuckin' wheels\nOr look at me, look at my motherfuckin' wheels\nI said, 'You ain't got to front, homie'\nLook at my motherfuckin' wheels\nOr look at me, look at my motherfuckin' wheels\nI ain't gon' lie 'bout it\n\n[Hook]", "image": "https://images.genius.com/25d8a9c93ab97e9e6d5d1d9d36e64a53.1000x1000x1.jpg"}], "artist": "Kendrick Lamar"}