{"songs": [{"title": "Bagpipes from Baghdad", "album": "Relapse", "year": "2009-05-15", "lyrics": "[Intro]\nOh, it's music to my ears, oh man\nHow can I describe the way I feel?\nFucking great, man\nOkay, let me see\nHow could I begin?\n\n[Verse 1]\nLocked in Mariah's wine cellar, all I had for lunch\nWas bread, wine, more bread, wine and Captain Crunch\nRed wine for breakfast and for brunch\nAnd to soak it up, an in-between snack, crackers to munch\nMariah, what ever happened to us?\nWhy did we have to break up?\nAll I asked for was a glass of punch\nYou see, I never really asked for much\nI can't imagine what's going through your mind after such\nA nasty break-up with that Latin hunk\nLuis Miguel, Nick Cannon better back the fuck up\nI'm not playin', I want her back, you punk\nThis is Hello Kitty bedspread, Satin Funk\nMixed with Egyptian, with a little rap and punk\nZapp and Eric Clapton, Shaft, Frank Zappa, crunk\nAnd yeah baby, I want another crack at ya\nYou can beat me with any spatula that you want\nI mean, I really want you bad, you cunt\nNick, you had your fun, I've come to kick you in your sack of junk\nMan, I could use a fresh batch of blood\nSo prepare your vernacular for Dracula acupuncture\n\n[Chorus]\nBagpipes from Baghdad\nWhen will it ever cease?\nFor Pete's sake, he's crazy to say the least\nBagpipes from Baghdad\nWhat's going through my mind\nHalf the time, when I rhyme, or blowing up like\nBagpipes from Baghdad\nSomebody turn the vacancy sign on\n'Cause I'm gone, blowing on my\nBagpipes from Baghdad\nI run the streets and act like a madman holding a Glad\n\n[Verse 2]\nYou can be a permanent fixture in my lyrical mixture\nI'm the Miracle Whip trickster\nMy signature sound, when a tube of lipstick's around\nI'm bound to put it on in an instant, wow\nMan, what an ensemble\nWhat an assortment of pharma–ceuticals\nThis beautiful pill dust in my palm, my\nCuticles get residue just from touchin' the bottle\nNever knew I could remind me so much of my momma\nI'll cut ya like Dahmer, pull a butcher knife on ya\nThe size of a sword, boy, I'm like the fuckin' Red Sonja\nGet it stuck in your cornea, nice knowing ya, Norman\nYou're so fuckin' annoyin', drop the shovel, boy\nYou don't know what the fuck you're doin'\nI ain't playin' no fuckin' more\nNick Cannon, you prick, I wish you luck with the fuckin' whore\nEvery minute there's a sucker born, snuck up on Malachai\nMade the motherfucker suck on a shuck of corn\nShuck o', shuck o' corn, Chaka Khan\nHit Jason in the face with a hockey puck, and\nTold him it's fuckin' on, man, what the fuck are ya doin'?\nYou're runnin' over the snowblower with the lawnmower\nBlowin' your bagpipes from Baghdad\n\n[Chorus]\nBagpipes from Baghdad\nWhen will it ever cease?\nFor Pete's sake, he's crazy to say the least\nBagpipes from Baghdad\nWhat's going through my mind\nHalf the time, when I rhyme, or blowing up like\nBagpipes from Baghdad\nSomebody turn the vacancy sign on\n'Cause I'm gone, blowing on my\nBagpipes from Baghdad\nI run the streets and act like a madman holding a Glad bag\n\n[Verse 3]\nIn the bed with two brain-dead lesbian vegetables\nI bet you they become heterosexual\nNothing will stop me from molestin' you\nTitty-fuckin' you 'til your breast nipple flesh tickles my testicles\nIs what I said to the two conjoined twins\nHow's it going, girlfriends? You needs a boyfriend?\nYou need some ointment? Just set up an appointment\nWho's gonna see the doctor first? We'll do a coin flip\nI just got my one-year sobriety coin chip\nWhen the bad get going, how bad does the going get?\nBaby, you shouldn't have any trouble rubbing groins with\nEach other, especially when you're joined at the hip\nI'm going to get the needle and thread from the sewing kit\nAnd attempt to separate 'em and stitch 'em back at the loin, shit\nLure the little boy with the chocolate 'Chips Ahoy!' chip\nCookie, lookie, even took me a Polaroid pic\n\n[Chorus]\nBagpipes from Baghdad\nWhen will it ever cease?\nFor Pete's sake, he's crazy to say the least\nBagpipes from Baghdad\nWhat's going through my mind\nHalf the time, when I rhyme, or blowing up like\nBagpipes from Baghdad\nSomebody turn the vacancy sign on\n'Cause I'm gone, blowing on my\nBagpipes from Baghdad\nI run the streets and act like a madman\nHolding a Glad bag, oh, bagpipes from Baghdad\n\n[Outro]\nHghum-day-li-laaa-aaa-aaa-aaa-aa-aah-aah\nHghum-day-li-laaa-aaa-aaa-aaa-aa-aah-aah\nHghum-day-li-laaa-aaa-aaa-aaa-aa-aah-aah\nHghum-day-li-laaa-aaa-aaa-aaa-aa-aah-aah", "image": "https://images.genius.com/280d45965a412d7e2a115e2db61d79f2.1000x1000x1.jpg"}], "artist": "Eminem"}