{"songs": [{"title": "There’s Been a Murder", "album": "Vol. 3… Life and Times of S. Carter", "year": "1999-12-28", "lyrics": "{*Gunshots*}\n{*Woman screamin' in pain*.. cops yellin' \"Go! Go! Go! Go!\"}\n{*Police sirens*}\n\n[Chorus: Alana Davis sample]\nThink there's been a murder-errra-ahhh-hahh-ahhh\nI ahh, think there's been a..\nI.. I think there's been a..\nThink there's been a murder-errra-ahhh-hahh-ahhh\nI ahh, think there's been a..\nI.. I think there's been a..\n\n[Verse 1: Jay-Z]\nI hustle from, night to morning, dawn to dusk\nKidnap and robberies like, (c'mon nigga) \"You goin' with us\"\nI held roundtable meetings so we could go on and discuss\nNot only money but all the emotions goin' through us\nWhy we don't cry when niggas die, that's how the street raised him\nLook in the air, say a prayer (hail Mary), hopin' God forgave him\nCop liquor, twist it, tap it twice, pour it to the pavement\nWe live dangerous, often findin' ourself in the eyes of strangers\n(Who the fuck is you?) My dream is big and in it my team is rich\nAs seen through the eyes of a nigga who ain't seen shit\nBack to live action, I'm packin', I'm still in the mix\nLike new hits, I think I'm goin' over your head a lil' bit\nBut I let you know I changed names when I roam through town\nStay free and be who I'm professional known as now\nJay-motherfuckin'-Z; and with that said\nBack to Shawn Carter the hustler, Jay-Z is dead, and I ahh\n\n[Chorus: Alana Davis sample]\nThink there's been a murder-errra-ahhh-hahh-ahhh\nI ahh, think there's been a..\nI.. I think there's been a..\nThink there's been a murder-errra-ahhh-hahh-ahhh\nI ahh, think there's been a..\nI.. I think there's been a..\n\n[Verse 2: Jay-Z]\nMy infatuation with autos led to autos gettin' sprayed\nHouses gettin' broken in, quarters gettin' trayed\nBricks gettin' chopped, mom's pots gettin' used\nOne thrown in that water, try the soda if there's two (bring it back)\nExpensive shoes worn, Louis Vuitton seats, roof gone\nCoke cheap, my face is like a coupon\nI gotta do Shawn, 'cause even when Jay-Z was lukewarm\nI was gettin' my loot on, nigga I'm too strong\nEat 'til the food's gone, they placed me on this earth\nThe twin brother of Rich Porter, separated at birth\nI got the soul of a hustler, quiet noise like a muffler\nFuck with us, walk through the ghetto\nSee the place that corrupted us\nLearn why we buck at the guys that come up with us\nAin't enough bucks for us to split in this shit\nPlus ain't nobody lovin' us; and with that said\nBack to Shawn Carter the hustler, Jay-Z is dead, and I ahh\n\n[Chorus: Alana Davis sample]\nThink there's been a murder-errra-ahhh-hahh-ahhh\nI ahh, think there's been a..\nI.. I think there's been a..\nThink there's been a murder-errra-ahhh-hahh-ahhh\nI ahh, think there's been a..\nI.. I think there's been a..\n\n[Verse 3: Jay-Z]\nSee my life is like a see-saw\nAnd until I move this weight it's gon' keep me to the floor\nTravel with me through my deep thoughts\nY'all can't learn Jigga by the shit y'all be readin' in The Source\nIt's deeper of course\nFollow the life of this reckless minor\nAt sixteen in the 600, unlicensed driver\nPlayin', cops and robbers, like shots can't stop us\nFlippin' a bird to the choppers (fuck you coppers!)\nBuck-thirty on the turns\nReckless abandon, when I'm standin' on this pedal\nHand on my metal, mind is on this time they tryin' to give me\nLord help me, all I ever wanted to be was wealthy or\nSomebody to tell me that they felt me\nI tried to play the hand you dealt me\nBut you gave me five funnies an' shit\nI was hungry I needed menage money\nNothin' less than a 520; and with that said\nBack to Shawn Carter the hustler, Jay-Z is {*gunshot*}\n\n[Outro: Alana Davis sample]\n{Think there's been a murder-errra-ahhh-hahh-ahhh}", "image": "https://images.genius.com/16c23bf8d7a8a73a71d30d2ec47600b1.1000x1000x1.jpg"}], "artist": "JAY-Z"}