{"songs": [{"title": "Day One", "album": "No Sleep ", "year": "2013-12-02", "lyrics": "[Intro: Future]\nI'm in this bitch with Yo\nWe on that millionaire shit, we can't be worrying bout none of that broke business, you feel me\n\n[Hook: Future]\nI just fucked up the whole check on my Rollie (yeah!)\nYou better come at me correct cause you don’t know me (turn up!)\nA half a million round my neck, I'm still the old me (skrt!)\nI’m on that sour, nigga, I ain't movin' slowly\nHey! Hey! I got that check on me, I've been like that from day one\nI keep my niggas with me, I've been like that from day one\nI drive the newest whips, I've been like that from day one (skrt skrt!)\nI made that gwala flip, I've been like that from day one (br-br-brt)\n\n[Verse 1: Future]\nI'm on promethazine, my coupe the color Akon\nI got my hoodie on, ain't goin' not like Trayvon\nI'm on my hustle, since a young I learned to stay down\nI got young Nino with me and he shoot up playgrounds\nPut VVS's and my watch is presidential\nIf I fuck yo bitch you tell me can you keep it confidential?\nAin't no pressure on my presidents, these Franklins are official\nAnd my coupe is so official, riding round with all my pistols\n30 round that clip from since the day one\nI add-on all my whips, I never trade one\nI'm doing 100 miles I'm on the streets and I ain't racin'\nI drive the most expensive cars\nThat's very fast and very spacious\nAye look at these niggas, they all shooters\nWe came from the bottom, we eat noodles (woo)\nVery bad bitches on my radar\nYou are not a real nigga, nigga you’s a hater\n\n[Hook: Future]\nI just fucked up the whole check on my Rollie (yeah!)\nYou better come at me correct cause you don't know me (turn up!)\nA half a million round my neck, I'm still the old me (skrrt!)\nI'm on that sour, nigga, I ain't movin' slowly\nHey! Hey! I got that check on me, I've been like that from day one\nI keep my niggas with me, I've been like that from day one\nI drive the newest whips, I've been like that from day one (skrt skrt!)\nI made that gwala flip, I've been like that from day one (br-br-brt)\n\n[Verse 2: Yo Gotti]\nCuban link I'm rockin' cost two hunned (Shit two hunnda)\nGas prices high, (whew) Exxon (Gas!)\nAll white foreigns, make em hate some (They hate!)\nDesigner clothes, look like I shop in London (I might)\nI got that yellow AP, different from my old one (shit different)\nYou talk that plug talk but nigga you don't know one (Trippin')\nI'm one hundred dawg, I stand out from no one (Gotti)\nBought a brick from me, I sold him a fake one (finesse)\nI take so many, been like that from day one (finesse)\nUp off with them Cubans and them Haitians (sak pasé)\nI fuck with them gangstas and them killers (killas)\nI know bitches realer than you niggas (I do)\nI know the streets gon' be the streets (I do)\nFuck niggas don't deserve to eat (they don't)\nAnd it been that day since day one (day one)\nIf a nigga get wrong I'mma spray some\nHundred round draw, house look like Graceland, king\n\n[Hook: Future]\nI just fucked up the whole check on my Rollie (yeah!)\nYou better come at me correct cause you don’t know me (turn up!)\nA half a million round my neck, I'm still the old me (skrt!)\nI’m on that sour, nigga, I ain't movin' slowly\nHey! Hey! I got that check on me, I've been like that from day one\nI keep my niggas with me, I've been like that from day one\nI drive the newest whips, I've been like that from day one (skrt skrt!)\nI made that gwala flip, I've been like that from day one (br-br-brt)", "image": "https://images.genius.com/a977a7360ae6031ae204635b7abe34b0.500x500x1.jpg"}], "artist": "Future"}