{"songs": [{"title": "Big Weenie", "album": "Encore", "year": "2004-11-12", "lyrics": "[Intro]\nI don't understand\nWhy are you being so mean?\nYou're a mean, mean man\n\n[Chorus]\nYou're just jealous of me 'cause you, you just can't do what I do\nSo instead of just admitting it, you walk around and say\nAll kinds of really mean things about me\n'Cause you're a meanie, a meanie\nBut it's only 'cause you're just really jealous of me\n'Cause I'm what you wanna be, so you just look like an idiot\nWhen you say these mean things, 'cause it's too easy to see\nYou're really just a big weenie, big weenie\n\n[Verse 1]\nAlright, listen, I need you to focus\nI need you to go dig deep in your mind, this is important\nWe are going to perform an experiment of the sorts\nI'm going to have to ask you to bear with me for a moment\nNow I need you to open your mind, your eyes, close 'em\nYou are now about to be placed under my hypnosis\nFor the next four and a half minutes, we are going to explore\nInto your mind to find out why you're so fucking jealous\nNow why did they make yoo-hoo? Pippity-kaka-poo-poo\nPsych, I'm kidding, I just wanted to see if you're still listening\nOkay, now I need your undivided attention\nSir, I have a question, why do I always sense this undeniable tension?\nFrom the moment that I enter into the room it gets all quiet and whispers\nWhenever there's conversation, why am I always mentioned?\nI've been dying to ask, it's been itching at me, is it just because...\n\n[Chorus]\nYou're just jealous of me 'cause you, you just can't do what I do\nSo instead of just admitting it, you walk around and say\nAll kinds of really mean things about me\n'Cause you're a meanie, a meanie\nBut it's only 'cause you're just really jealous of me\n'Cause I'm what you wanna be, so you just look like an idiot\nWhen you say these mean things, 'cause it's too easy to see\nYou're really just a big weenie, big weenie\n\n[Verse 2]\nAlright now I (Shit), I just flubbed a line\nI was going to say something extremely important\nBut I forgot who or what it was, I fucked up\nPsych, I'm kidding again, you idiot, no, I didn't\nThat's just what you wanted to hear from me is that I fucked up, ain't it?\nBut I can bust one take without looking at no paper\nIt doesn't take a bunch of takes or me to stand here in this booth all day\nFor me to say the truth, okay? You're drooling, you have tooth decay\nYour mouth is open, you're disgusting, what the fuck you eat for lunch?\nA bunch of sweets or something? What, you munch a bunch of Crunch 'n Munch?\nYour tooth is rotten to the gum, your breath stinks, wanna chew some gum?\n\"Yes, I do, sir, what am I on?\" You, sir, are on truth serum\n\"Marshall, I'm so jealous of you, please say you won't tell nobody\nI'd be so embarrassed, I'm just absolutely terrified\nThat someone's gonna find out why I'm saying all these terrible\nEvil and awful mean things, it's my own insecurities\"\n\n[Chorus]\nYou're just jealous of me 'cause you, you just can't do what I do\nSo instead of just admitting it, you walk around and say\nAll kinds of really mean things about me\n'Cause you're a meanie, a meanie\nBut it's only 'cause you're just really jealous of me\n'Cause I'm what you wanna be, so you just look like an idiot\nWhen you say these mean things, 'cause it's too easy to see\nYou're really just a big weenie, big weenie\n\n[Verse 3]\nAlright, now we, we're going to conduct\nThat experiment that we were talking about earlier\nJust to see what a frog looks like when it takes two hits of ecstasy\n'Cause that's exactly what your eyes look like, wanna check to see?\nHere's a mirror, notice the resemblance here?\nWait, let me put these sunglasses on, now look in this mirror\nHow 'bout now? What do you have in common?\nYou're both green with envy and look like idiots with sunglasses on 'em\nYou look like I sound like singing about weenies\nNow take my weenie out of your mouth\nThis is between me and you, I know you're not happy\nI know you'd much rather see me lying in the corner of a room somewhere crying\nCurled up in a ball, tweaked out of my mind, dying, there's no denying\nThat my weenie is much bigger than yours is\nMine is like sticking a banana between two oranges\nWhy are you even doing this to yourself? It's pointless\nWhy do we have to keep on going through this? This is torturous\nMy point is this\nThat if you say mean things, your weenie will shrink\nNow I forgot what the chorus is, you're just as...\n\n[Chorus]\nYou're just jealous of me 'cause you, you just can't do what I do\nSo instead of just admitting it, you walk around and say\nAll kinds of really mean things about me\n'Cause you're a meanie, a meanie\nBut it's only 'cause you're just really jealous of me\n'Cause I'm what you wanna be, so you just look like an idiot\nWhen you say these mean things, 'cause it's too easy to see\nYou're really just a big weenie, big weenie\n\n[Outro]\nFuck off my dick", "image": "https://images.genius.com/e76120b9dd2c0af6f1b3f8d3dcbe11d2.1000x1000x1.jpg"}], "artist": "Eminem"}