{"songs": [{"title": "Where My Money", "album": "Success Is Certain", "year": "2011-08-09", "lyrics": "[Chorus]\nI've been fucking with this game for a long time and I'm impatient\nI'mma kill somebody if somebody don't make me real rich this year\n\n[Verse 1]\nFor starters, I'm all about the bread\nI ain't no artist, I'm a target, I'm like the landlord\nHip hop's currently fallen down the stairs\nYour rents due, muthafucka!\nNow who gives a fuck about who bars the hardest?\nWhen the DJs think they're bigger stars than the artists\nRiding around in Ferraris doing more A & Ring than the A & R's\nAnd half them niggas don't even scratch\nThat's like the blind leading the blind leader\nHip-hop is like the FBI in the trap readin' The Don Diva\nIt makes no sense, it's ironic how I can straighten you\nEven though I stay so bent\nI'm about getting ins, everytime my money's on hip hop\nThat's every time the house nigga wins\nFlooding the drought, loving the club, Crip/Blood gun talk\nLadies and gentlemen: hip hop in one bar\n\n[Chorus]\nI've been fucking with this game for a long time and I'm impatient\nI'mma kill somebody if somebody don't make me real rich this year\nWhere my money at?\n\n[Verse 2]\nI put a cease and desist on this industry shit\nMe making a friend means I just make an enemy quit\nWhen niggas think they finna be big, their images switch\nThey go from getting beat by a nigga to sweet to a cinnamon whip\nThey acting like they got the Vanna White in Wheel of Fortune\nBut actually they spilling the script\nI tell her DJ to play mines, or we gon' spray ya\nAnd that's on every MC's mind, they just don't say it\nI flame spots, my brain lies and the top is on fire\nHow you gonna say Nickle Nine ain't rising\nRappers no longer have to be on the block lying\nYou get your ass whooped on the net, you a pop icon\nI spazz like I got the right rhyme\nI flash like a shot Nikon\nI call my motherfuckin man my money, so money stands out\nWhile I got my motherfuckin hand out\n\n[Chorus]\nI've been fucking with this game for a long time and I'm impatient\nI'mma kill somebody if somebody don't make me real rich this year\nWhere my money at?", "image": "https://images.genius.com/7ef2ea2d0242f3b7c5b03da3554a04b1.640x640x1.jpg"}], "artist": "Royce da 5'9'’"}