{"songs": [{"title": "We Kixin’ It", "album": "Sickology 101", "year": "2009-04-28", "lyrics": "[Verse 1: Tech N9ne]\n(Big gasp) I feel like I'm about to throw up (ugh!)\nGang signs cause I'm kixin' it! (oh)\nGuess I never grow up. security! ease up, let a big star enter\nI just want to drink and flirt with the female bartender\nKixin' it, You up tight but I'm in a loose mood\nMixin' it, not much ice its a vodka and juice booze\nMixin' it, which one might be the vodka and boose boose\nFixin' it, my home slice yellin out 'coose dude'\nHeh, dont do the same old two step throw it up I want to see what city you in\nDancin with a beezy, got my hands where the cushion at\nYellin at the squares 'what the hell is you lookin at?'\nBooty I'm gripsin' it, know that I'm gonna be twistin' it\nNever could tell me to cool it because I'm a villain and baby we kixin it!\n\n[Hook: Tech N9ne]\nI'm cleaned up, my greens up, I'm teamed up\nYa team must be steamed up because we kixin' it\nWe got the liquor in the door we mixin' it\nWe lettin everybody know we hate fakes, frauds, false, foes\nWe dont want to see 'em. we let everybody know we kixin' it\nWe got the liquor in the door, we mixin it\nCome on everybody ooohh!\n\n[Verse 2: Ron Ron]\nKicken its automatic once I bit into this tablet probably never quit kicken it 'till I kick my drinking habit\nI doubt it will ever happen but never is what you never say\nMatter of fact I haven't had a drink well since yesterday\nMy diction's a lil slurry and visions a lil blurry\nStomache bubbling a lil bit, chickens a lil curry\nThe club fin to close so sippen this in a hurry\nAnd plus I'm temporarily fixing to getting married\nThe party's in the parking lot, looming the mac world\nSobered up and noticed I was stroken on a fat girl!\nOhh ohh no no Santa Clause please say it ain't so!\nBut I'm still in to kick it though, cup empty get some more\nSay I shouldn't drink and drive, I party at the liquor store!\n\n[Hook]\n\n[Verse 3: The Popper]\nDun Dealer, Tech N9ne, Ron Ron, got these chicks waving they hands in the air like they pom-poms\nPop the military mind it but I'm calm niggers ask for a little bit of war but I'm nam\nHit the club for an hour then I'm gone to the after party twenty missed calls from von-von\nI'm on some shit way over your head, swear to don if I get pissed I'm probally goin faaade\nWe's big time, you's hardly major. we spot bad chicks and fill em up with party favors\nYeah all the haters we skrillin get stilla grit. get an empty cup and fill it quick\n'Till its six in the morn, in the tel, killen slit lay my perpes, till the day I die who spit it real as this\n\n[Hook]\nI'm cleaned up, my greens up, I'm teamed up\nThe tea must be steamed up because we kixin' it\nWe got the liquor in the door we mixin' it\nWe lettin everybody know we hate fakes, frauds, false, foes\nWe dont want to see 'em. we let everybody know we kixin' it\nWe got the liquor in the door, we mixin it\nCome on everybody ooohh!\n\n[Outro: Tech N9ne]\nTake yo phone an shine your light an with your left cause te liquor id in your right hand\nPut your phone up, turn your cup up. grap a lady put your hand right on her butt\nNow squeeze it squeeze it come on squeeze it squeeze it\nThats your gal now ya'll can go on home and lay that ass on the couch and get your bone on", "image": "https://images.genius.com/081166dc5d132ad1d3549578cac249e0.1000x1000x1.jpg"}], "artist": "Tech N9ne"}