{"songs": [{"title": "UP LIKE AN INSOMNIAC (Freestyle)", "album": "? (Deluxe)", "year": "2017-12-10", "lyrics": "[Intro]\nOkay, I'm way too good at this shit\nI don't even really gotta try no more\nOh my God, Ronny\n\n[Chorus]\nBitch I am up, bitch I am up\nBitch I am up, bitch I am up\nBitch I am up, bitch I am up\nBitch I am up, bitch I am up\nBitch I am- huh? Bitch I am up\nBitch I am up, bitch I am up\nBitch I am up, bitch I am up (Okay!)\nBitch I am up, bitch I am up\n\n[Verse 1]\nOkay, Xans for her dinner, uh, bag from Margiela, uh\nBad lil' bitch, she Spanish, speak no English, got no manners\nJust like a gnome, I'm at your home\nRight on your yard, shoes are Goyard\nDick in your broad, her pussy stinky\nMessy like Binky, bon appétit-tee, okay?\nBitch, I don't see nobody better than me, mm\nAll these pussy niggas is jealous of me, mm\nGot a pussy wetter than Swiffer, you see, mm\nSteal a nigga flow and murder his beat, uh\nStole a nigga bitch, she murder my meat, uh\nHad a nigga numb from feet to the knee up\nWhen she suck my dick, it's makin' her hiccup\nWhen I'm in that pussy, I just might do sit-ups\n\n[Chorus]\nBitch I am up, bitch I am up\nBitch I am up, bitch I am up\nBitch I am up, bitch I am up\nBitch I am up, bitch I am up\nBitch I am up, bitch I am up\nBitch I am up, bitch I am up\nBitch I am up, bitch I am up\nBitch I am up, bitch I am up\n\n[Verse 2]\nAll these niggas fuckin' hoes, ten toes, never fold\nPussy nigga, snatch your soul out your shirt, actin' buff\nActin' up, actin' tough, just might get you fist fucked\nAll that talk about runnin' up, still your boy, I'm runnin' up\nMy flow's acidic, I murder rap virgins with it\nI'm swervin', flippin' the bird while I'm purgin' niggas\nMy words is bigger, matter of fact, my dick bigger\nThe bigger the figure, the more they probably fuck, niggas\nI'll say it again\nNo, I don't wanna be friends with none of you fuckin' Aliens\nI'm Predator, nigga, I batter you nigga, yo, matter of fact\nI'm better than niggas, I'll battle you nigga, woo!\n\n[Chorus]\nBitch I am up, bitch I am up\nBitch I am up, bitch I am up\nBitch I am up, bitch I am up\nBitch I am up, bitch I am up\nBitch I am- huh? Bitch I am up\nBitch I am up, bitch I am up\nBitch I am up, bitch I am up\nBitch I am up, bitch I am up\nBitch I am up\n\n[Outro]\nHey, that was a fuckin' freestyle, just so y'all fuck niggas know\nThank you very much, this- this whole thing was a freestyle\nYou can ask my engineer\nI was doin' this shit in the motherfuckin' booth\nThank you very much, okay!", "image": "https://images.genius.com/6deaf02dd13696745c2816ed957ba43b.499x499x1.jpg"}], "artist": "XXXTENTACION"}