{"songs": [{"title": "Dirty South", "album": null, "year": "2014-10-27", "lyrics": "[Intro: $ki Mask the Slump God & SpookyLeann]\nAyyyy\nSki ski\nLean god\nSki ski\nLean god lean god\nAyyyyy\nOuu\nAyyyyy\nDon't touch\nMy\nHoe\nLean god slump god\nLean god slump god\nSki ski\n\n[Verse 1: $ki Mask the Slump God]\nPussy boy don’t wanna cross my path\nCus like a black cat\nThink it's bad luck bitch\nYou guessed it\nI'ma fuck em up\nThey ain’t nothin funny\nBout the money I'ma run it up\nMo' bucks than Bugs Bunny\nBitch I'ma count it up\n\n[Verse 2: SpookyLeann]\nMy third eye is open\nI'm Adderall focused\nYou claimin you real well just show it (Aye)\nMy third eye is open\nGet stretched like a Trojan\nCoolin wit yo bitch and I got her wet as a ocean\n\n[Verse 3: $ki Mask The Slump God & SpookyLeann ]\nShe dirty like derby\nShe suck me like Kirby\nResemble casper how I ghost on a hoe\n[SpookyLeann]\nAnd I'm the dead pleaser\nDrug game give her seizures\nWhile in Indonesia I'mma roll up all this reefer\n[$ki Mask The Slump God]\nAcid tabs, with the dab\nFeel like a jab to the throat (Aye)\n[SpookyLeann]\nLean on the spliff and your bitch down to fuck\nAnd she taste nicotine from the pulp (Aye)\n[$ki Mask The Slump God]\nI'm off to Costa Rica, we so foreign need a bloodclaat Visa\nThat weed you smoking cheaper\nBack it up, I’mma learn em’ just like a teacher (Aye)\n\n[Verse 4: SpookyLeann]\nI'm leanin’ cause I'm Spooky\nHe said there I be so [?]\nI swear that these bitches mechanics\n‘Cause all these hoes tryna squeak me\nNo curry but I am a killer\nI'm passin' out bars I feel like a dealer\nShe calling me father because I’m a god\nDon't clap when I rap, don't need no applause (Aye)\nSippin' no snitching, don't hang with the law\nRappers Niagara cause' all of them fall\nWait just a minute, the fucks in my cup?\nAin't no “just chillin” she rolling my blunt\nL-lean on the spliff and then she down to fuck\nI go hard in the paint and I'm busting a nut\nPull down her drawers, make her take off her tee\nAnd she moaning too loud, make to turn up the beat\nThat fits\nShe steady trippin', she did gymnastics on my dick\nShe flippin'\nNow we in action that's why she is missing (Aye)\nLean on the spliff and then she down to fuck\nI go hard in the paint, and I'm busting a nut\nLean on the spliff and then she down to fuck\nI go hard in the paint, and I'm busting a nut\nBitches stupid, better stay safe, say your grace\n‘Cause all of my niggas one day is really gorillas\nDon't wanna see anyone of my apes (Aye)\nOh, they call 12 so I guess time to shake\nI got a bad bitch in almost every state\nMedusa head on me, you can not relate\nYour bitch on my phone to take her on a date\nNow it's a party ‘cause we on the mollys\nAnd now it's a party, she ride me no Harley\nHer ass looking black but she is white girl gnarly\nBut oh my Lordy that hoe is like forty\nAnd looking confused\nYou can't keep your body\nI just want your nudes, I'm just being real but you claiming I'm rude\nJosé got them hoes but these hoes is confused\nBut they still finna hang with us\nThey see I make moves\nShe try to play hard to get but it's a faux\nTry to run game but I will never chase, be patient\nWhy would I waste my time on you when I get something better\n\n[Hook: $ki Mask the Slump God]\nShe dirty like derby\nShe dirty like derby\nShe dirty like derby\nShe dirty like derby\nShe suck me like Kirby\nTell me which bitch is worthy?\nShe dirty like derby\nShe dirty like derby\nShe dirty like derby\nShe dirty like derby\nShe suck me like Kirby\nTell me which bitch is worthy?\n\n[Verse 5: $ki Mask the Slump God]\nBetter with my niggas\nLike I'm on a slave ship\nBet we put these knives through your neck\nLike a face lift\nBut I bet your bitch fold like a fucking paper clip\nNow they tryna call me Zelda\nHow I'm slang me a bitch\nDamn, Ski Mask in it\nHit her with the wood like a splinter\nPussy nigga, how you feeling?\nBombaclart ass boy, and your bitch (Ski, Ski, Ski)\nAye, I'm tryna get up in her\nLike spirit on Christmas Winter\nI'm barred out, penitentiary\nJaw up when she sucking me\nCall on anyone you wanna be Ski Mask?\nWho you wanna be?\nTell em' different IDs, I am anybody I wanna be\nDouble cup, fuck it up\nFucking her butt, never fucking her but\nI'm Slump God and on God\nMy bitch ass fatter than a spirit bomb\nMight just swerve, probably hit the curb\nMake a fucking nigga be jerked\nCause I flip the skrt, and make it hurt\nAnd my dick will beat her up like Jimi Jon boy\nI say you drill like Dentist\nCouple milligrams and I doze\nFlow all the bitch fuckin' boats\nDeny it if she tell you, get that pussy wetter the most\nBitch her panties gon' drop like the drop top\nTryna show off just enough like crop top\nPimpin' on lock like I grind it in the slip-knot\nAll I get is top, like I put her in a headlock, headlock", "image": "https://images.genius.com/3459d963f5726b3c9e803da8164be874.500x500x1.jpg"}], "artist": "Ski Mask the Slump God"}