{"songs": [{"title": "White Privilege", "album": "The Language of My World", "year": "2005-10-10", "lyrics": "[Verse 1]\nI see so many people lost who really try to pretend\nBut am I just another white boy who has caught on to the trend?\nWhen I take a step to the mic is hip-hop closer to the end?\n'Cause when I go to shows the majority have white skin\nThey marketed the windmill, the air flair and head spin\nAnd white rappers' albums really get the most spins\nThe face of hip-hop has changed a lot since Eminem\nAnd if he's taking away black artists' profits, I look just like him\nClaimed a culture that wasn't mine, the way of the American\nHip-hop is gentrified, and where will all the people live?\nIt's like the Central District, Beacon Hill to the South End\nBeing pushed farther away because of what white people did, now\nWhere's my place in a music that's been taken by my race\nCulturally appropriated by the white face?\nAnd we don't want to admit that this is existing\nSo scared to acknowledge the benefits of our white privilege\n'Cause it's human nature to want to be part of something different\nEspecially when your ancestors are European Christians\nAnd most whites don't want to acknowledge this is occurring\n'Cause we got the best deal, the music without the burden\nOf being black in a system that really wants you to rock\n'Cause all you need is a program and you can go and make hip-hop\nAnd we hate the mainstream 'cause we're the ones that took it\nNow we listen to Aesop Rock and wear t-shirts that say \"Brooklyn\"\nBut it's not about black and white, right?\nI mean good music is good music regardless of what you look like\nBut when you don't give them props isn't that selfish?\nThat's like saying rock was actually started by Elvis\nSo where does this leave me?\nI feel like I pay dues, but I'll always be a white MC\nI give everything I have when I write a rhyme\nBut that doesn't change the fact that this culture's not mine\n\n[Pre-Chorus]\nBut I'm gonna be me, so please be who you are\nThis is something that's effortless and shouldn't be hard\nI said I'm gonna be me, so please be who you are\nBut we still owe 'em 40 acres now we've stolen their 16 bars\n\n[Chorus]\nHip-hop started off on a block that I've never been to\nTo counteract a struggle that I've never even been through\nIf I think I understand just because I flow too\nThat means I'm not keeping it true, nope\nHip-hop started off on a block that I've never been to\nTo counteract a struggle that I've never even been through\nIf I think I understand just because I flow too\nThat means I'm not keeping it true, I'm not keeping it true\n\n[Verse 2]\nNow I don't rap about guns, so they label me conscious\nBut I don't rap about guns 'cause I wasn't forced into the projects\nSee I was put in the position where I could choose my options\nBlessed with the privilege that my parents could send me to college\nNow who's going to shows, the kids on the block starving?\nOr the white people with dough that can relate to my content?\nMarketed the music, now adapted to the lifestyle\nWhat happened to jazz and rock and roll is happening right now\nWhere's my place in the music that's been taken by the media\nWith white corporations controlling what they're feedin' ya?\nI brought up Aesop Rock, but I'm not even dissing, dude\nWe love hip-hop, and what do you think caucasians are listening to?\nAnd I speak freely when I write this\nIf a black MC examined race, there goes half their fan base, white kids\nAnd this is so true\nAnd we didn't even have to fight the system, we just went and picked up the microphone too\nAnd we got good at it so we should be rappin'\nBut only supporting them is like burning Jimi and buying Clapton\nNow Clapton's incredible, but no Jimi, no foundation\nSo here comes history and the cultural appropriation\nWhite kids with do-rags trying to practice their accents\nFrom the suburbs to the upper-class, mastering a language\nBut hip-hop is not just memorizing words\nIt's rooted in authenticity, something you literally can't learn\n\n[Pre-Chorus]\nBut I'm gonna be me, so please be who you are\nThis is something that's effortless and shouldn't be hard\nI said I'm gonna be me, so please be who you are\nBut as I'm blessed with the privilege, they're still left with the scars\n\n[Chorus]\nHip-hop started off on a block that I've never been to\nTo counteract a struggle that I've never even been through\nIf I think I understand just because I flow, too?\nThat means I'm not keeping it true, nope\nHip-hop started off on a block that I've never been to\nTo counteract a struggle that I've never even been through\nIf I think I understand just because I flow, too?\nThat means I'm not keeping it true, I'm not keeping it true", "image": "https://images.genius.com/a341d7269423ec87ff688b91d8b38e47.800x800x1.jpg"}], "artist": "Macklemore"}