{"songs": [{"title": "Make ’Em Mad", "album": "Summer of Steve", "year": "2012-04-23", "lyrics": "[Childish Gambino]\nChildish Gambino you will get in with a wristband he know\nPeople took an hour just to stand outside in line\nI knew that you would do it, and I reckon you lookin' fine\nThese bitches better be mine, I'm horny all the time\nGambino be the one who put a hump up in your spine\nDrink a little wine, do a little dance\nNow im goin' home, now im in your pants\nForget that, I ain't take the condom off\nNew swag ever since im bustin' off\nI get head like a bottle of Tylenol\nYou like girls when you know you can buy them all\nA fireball, I'm hot as fuck, I bust a nut with tons of sluts\nGo ahead shake your thing baby, look hot\nWhy the girls doin' me? Ho why not?\nI mean why not?\n\n[Hook]\nTell her, some bullshit on my whip im 'bout to take it back\nWhen I switch it up I pull up in the newest jag\nAny time we in I hit the strip and do it bad\nY'all nigga's hatin' us I know we make 'em mad\nIt make 'em mad\nIt make 'em mad\nIt make 'em mad\nWhen we put on the swag\nIt make 'em mad when we put on the swag\n\n[Steve G. Lover]\nAy, Childish let me get em'\nThey ain't in our league, so they can't hang with em'\nStrip club, and the squad came with em'\nTwo girls coming home like they fresh outta prison\nSay words if you get it\nWe only give a damn if a check came with it\nTwo blunts and that old dude who lives it\nI got bitches in the pen who I don't even visit\nYou came in the carpet\nYou get a lot of pussy when they make you a star\nA girl in LA and I don't know her name\nBut she get pissed off when she talking insane\nPaper man people guns with the thang'\nI was a little broke but it started to change\nDrop a couple songs, and that's all of the bang\nCause I ridin' on the track like I'm part of a train\nMy girl southside when I hit the booth\nI drink roc' roc' straight fuck the juice\nA big bro throw bread like fuck the loot\nI'm back bitch, I'm back Prince\nI'm back shit, my home boy pissed off\nI put my hands on that ass, cause that shit soft\nTwo guns it'll burn off\nWhen you stunt like Stevie, it'll turn off\n\n[Hook]", "image": "https://images.genius.com/c580990fca8a06e6e9fa84c379f24c81.700x700x1.jpg"}], "artist": "Childish Gambino"}