{"songs": [{"title": "Not a Damn Thing", "album": "Planet", "year": "2018-03-02", "lyrics": "[Chorus]\nI don't wanna do a damn thing today\nDon't wanna go, I'm just gonna stay\nInstead of work, I just wanna play\nPlus I pulled away a fat stack anyway\nI don't wanna do a damn thing today\nDon't wanna go, I'm just gonna stay\nThey wanna know what I'ma do today\nNot a damn thing, fuck what anybody say\n\n[Bridge]\nWhat? Where they do that?\nWhy they do that? (what?)\nWhy they do that?\nWhy they do that?\n\n[Verse 1]\nRight here right now\nI really wanna know where the smoke and booze at\nI'm taking a off day, yup and I ain't 'bout to lose that\nI'm finna be absent like Bueller (Bueller)\nNow's the time, the time is happening like Mueller (Mueller)\nNot a hair has been seen, it's not an embarrassin' thing\nCallin' in, lyin' to kick, it's the American dream like\nI'm gonna blow a cone by the pool\nSmoke up to many songs, I can choose\nThen right to my phone, call my crew\nHit up Stevie Stone, Frizz, JL, and Joey Cool\nThat's diggable, now my homies is with me\nThat'll tell my chick, hit some hippie\nMake thickies, that's less miserable\nIn Tech's crib you know, everybody gonna get physical\nEat some food then turn on the tube for Netflickables\n\n[Chorus]\nI don't wanna do a damn thing today\nDon't wanna go, I'm just gonna stay\nInstead of work, I just wanna play\nPlus I pulled away a fat stack anyway\nI don't wanna do a damn thing today\nDon't wanna go, I'm just gonna stay\nThey wanna know what I'ma do today\nNot a damn thing, fuck what anybody say\n\n[Bridge]\nWhat? Where they do that?\nWhere they do that? (what?)\nWhere they do that?\nWhere they do that?\n\n[Verse 2]\nRight here in America, we work until our hands are blue-black\nSo we cherish a day to ditch, I thought you knew that\nUh, I'm tryna party at home baby, I'm tryna, uh, fuck off!\nI'ma be stuck in a zone baby\nWith a prime cut Don's finest wine to help me buss off!\nYeah, hit the liq', hit the bong\nIf the missus is trippin, you tell the missus you grown\nIf it quick as the bitchin', run to the strippers with thongs\nWorking the daytime shift and ya'll get to sip and it's on\nT'was a hell of a ditchin' day, a lie in a biggun way\nBut the grown up responsibilities, you gotta be the kid and play\nI deserve to be ghost to you, 'cause I am King\nSo today I just chose to do not a damn thing\n\n[Chorus]\nI don't wanna do a damn thing today\nDon't wanna go, I'm just gonna stay\nInstead of work, I just wanna play\nPlus I pulled away a fat stack anyway\nI don't wanna do a damn thing today\nDon't wanna go, I'm just gonna stay\nThey wanna know what I'ma do today\nNot a damn thing, fuck what anybody say\n\n[Outro]\nYou are now entering the wind down sequence\nThese next pieces are best after dark\nThank you for choosing Planet Pyune", "image": "https://images.genius.com/9512e7de485fe45a8b0365fd80465887.1000x1000x1.png"}], "artist": "Tech N9ne"}