{"songs": [{"title": "F.U.C.K.Y.O.U.", "album": "Get Off the Stage", "year": "2007-12-04", "lyrics": "[Hook] - X 2\n(Fuck you) Nigga fuck you too\n(Fuck you) Nigga fuck you too\n(Fuck you) Nigga fuck you too\nNigga F.U.C.K. Y.O.U\n\n[Too $hort]\nYou finna get yo' ass whooped bitch\nYou bout to get yo' ass whooped bitch\nWe finna whoop yo' ass bitch\nYou bout to get yo' ass whooped bitch\n\n[Mistah F.A.B.]\nOn my mama yo' hood ain't shit\nNigga on my mama yo' hood ain't shit\nOn my mama yo' hood ain't shit\nYo' hood ain't shit, hood ain't shit\n\n[Too $hort] (Mistah F.A.B.)\nMan fuck yo' mama that punk ass bitch\n(Nigga what you say?) She ain't nothin' but a bitch\nNigga fuck yo' mama that punk ass bitch\n(Nigga what you say?) Yo' mama ain't shit\n\n[Mistah F.A.B.]\nFuck that shit nigga what you wanna do?\nNigga fuck that shit nigga what you wanna do?\nNigga fuck that shit nigga what you wanna do?\nNigga what you wanna do? What you wanna do?\n\n[Hook] - X 2\n(Fuck you) Nigga fuck you too\n(Fuck you) Nigga fuck you too\n(Fuck you) Nigga fuck you too\nNigga F.U.C.K. Y.O.U\n\n[Too $hort]\nHit that nigga with a champagne bottle\nHit him with a champagne bottle\nMan hit that bitch with a champagne bottle\nHit him in the head with the bottle\n\n[Mistah F.A.B.]\nWhile you bumpin' yo' gums I'mma bust yo' shit\nKeep bumpin' yo' gums I'mma bust yo' shit\nBumpin' yo' gums I'mma bust yo' shit\nI'mma bust yo' head and bust yo' lip\n\n[Too $hort]\nOne of y'all niggas gon' die tonight\nYou gon' die tonight\nNigga one of y'all niggas gon' die tonight\nSomebody gon' die\n\n[Mistah F.A.B.]\nNigga fuck yo' turf, I'mma put you on a shirt\nNigga fuck yo' turf, I'mma put you on a shirt\nNigga fuck yo' turf, I'mma put you on a shirt\nEverybody on your turf gon' have your picture on a shirt\n\n[Hook] - X 2\n(Fuck you) Nigga fuck you too\n(Fuck you) Nigga fuck you too\n(Fuck you) Nigga fuck you too\nNigga F.U.C.K. Y.O.U\n\n[Ginger]\nBroke ho talkin' all that shit\nYou and your best friend got matchin' outfits\nPunk ass bitch, tryin' to look cute\nIf I pull that weave out then what you gon' do?\nBitch fuck you, I know where you stay\nThink you prettier than me, I'll cut yo' face\nDon't call yo' nigga, what he gon' say?\nKeep fuckin' with me, you bout to get sprayed\n\n[Ms. Hollywood]\nSilly ho, who you think you fuckin' with?\nYou and that pussy nigga ain't got shit\nYou dykin' ass ho, want a dykin' ass bitch\nJust mad cause I won't let ya lick my clit\nYou wanna cut my face cause I'm prettier than you?\nIf I looked like you I'd wanna cut mine too\nYou nappy headed bitch, I don't need no weave\nI would take your man but he ain't got no cheese, so fuck you\n\n[Hook]\n(Fuck you) Nigga fuck you too\n(Fuck you) Nigga fuck you too\n(Fuck you) Nigga fuck you too\nNigga F.U.C.K. Y.O.U\n(Fuck you)", "image": "https://images.genius.com/bf235bef3026a6f3ce0ab508ff5f91d3.500x500x1.jpg"}], "artist": "Too $hort"}