{"songs": [{"title": "I Got Yo Bitch", "album": "Dirty Sprite", "year": "2011-01-11", "lyrics": "Dude:\nFuck you then god damn bitch I don't need you\nMother fucker, you ain't shit!\n\nBitch:\nBaby just calm down calm down\nI'ma call you back in 30 minutes ok\n\nDude:\n30 minutes? please come back\nPlease baby baby please please baby come back\nI'll be over there in 5 minutes\nWhy you keep fucking on that nigga? I love you gurl god damn it!\n\n[hook]\n\nA quarter million worth of ice I got yo bitch with me nigga\nWhole brick around my wrist I got yo bitch with me nigga\nWhen i smash off in that coupé I got yo bitch with me nigga\nIm throwing money out the roof I got yo bitch with me nigga\nI got yo bitch, I got yo bitch with me nigga\nI got yo bitch, I got yo bitch with me nigga\nI got yo bitch, I got yo bitch with me nigga\nI got yo bitch, I got yo bitch with me nigga\n\n\nVerse 1 [Future]\n\nJury got me high, I don't wanna come down\nI'm fresh like a dope boy smoking out a pound\nThese shots cause a racket\nGot designer on my back\nGot them goons in the front\nI make a hunned k a month\nI'm a young boss nigga and I gotta prove a point\nI'm kicking shit with yo bitch backstage smoking joints\nLouie V around my waist, Im an A1 maniac\nI got the city on my back\nI got your city on my back\nI got these bitches on my back\nThey on the stage doing a tootsie roll\nI controlled all my hoes, no remote control\nShe had your heart inside her panties and she let it go\nI'm leaving out the club and I'm like \"let it go\"\n\n[Hook]\n\nVerse 2 [Rocko]\n\nIf your bitch pop up on my radar then I'ma fuck her\nThey be like \"Rocko? Man, I hate that little fucker\"\nBetter move her to Augusta if you love her\nI fuck on the counter not under the cover\nDamn babe we low key we undercover\nShe could stand low wit you my nigga oh I love her\nI fuck her in the runner i don't need incidentals\nOnly no deposit i could fuck her in the closet\nPull off exhausted can't believe you sproused it\nI fuck her on the house my nigga how you house that\nI let you niggas lay up, I just slam\nIf you don't give a fuck i don't give a damn\n\n[Hook]\n\nVerse 3 [Future]\n\nI'm lit up like a stadium\nBalling on gymnasium\nWe're smashing in the coupe\nI got your bitch im about to play with her\nJimmy Choo gon stay on her\nAnother bitch gon lay on her\nQuarter million worth of diamond yeh you know Im cold as fuck\nIm fly as fuck you know it up you little dots dont make enough\nGo to gucci buy it up a gram of kush i roll it up\nMy purple cup dirtier than her i like it when they steady\nAnd i love my drank muddy\nDo the dash with my buddies throwing money out the roof\nIt ain't up for discussion and I can scoop her when I want to\nI can hit her when I want to\nFuture hotter than sauna\nDriving fast like daytona\nWith your bitch turn the corner we at the W I'm putting it on\n\n[Hook]\n\n\nDone by Lucas B", "image": "https://images.genius.com/0dc7f94974057cd63dca84d71cb50adf.500x500x1.jpg"}], "artist": "Future"}