{"songs": [{"title": "Violent", "album": "2Pacalypse Now", "year": "1991-11-12", "lyrics": "[Verse 1]\nThey claim that I'm violent\nJust cause I refuse to be silent\nThese hypocrites are havin' fits\n’Cause I'm not buyin' it, defyin' it\nEnvious because I will rebel against\nAny oppressor - and this is known as self defense\nI show no mercy, they claim that I'm the lunatic\nBut when the shit gets thick, I'm the one you go and get\nDon't look confused, the truth is so plain to see\n’Cause I'm the nigga that you sell-outs are ashamed to be\nIn every jeep and every car, brothers stomp this\nI'm Never Ignorant, Getting Goals Accomplished\nThe Underground Railroad on an uprise\nThis time the truth's gettin' told, heard enough lies\nI told 'em fight back, attack on society\nIf this is violence, then violent's what I gotta be\nIf you investigate you'll find out where it's comin' from\nLook through our history, America's the violent one\nUnlock my brain, break the chains of your misery\nThis time the payback for evil shit you did to me\nThey call me militant, racist, cause I will resist\nYou wanna censor somethin', motherfucker censor this!\nMy words are weapons and I'm steppin' to the silent\nWakin' up the masses, but you, claim that I'm violent\n\n[Chorus]\n\"They claimin' that I'm violent\"\n\"Fuck the damn cop!\"\n\"Just because we play what the people want\"\n\"They claimin' that I'm violent\"\n\"Fuck the damn cop!\"\n\"Just because we play what the people want\"\n\"They claimin' that I'm violent\"\n\"Fuck the damn cop!\"\n\"Just because we play what the people want\"\n\n[Verse 2]\nThe cops can't stand me, but they can't touch me\nCall me a dope man, cause I rock dope beats\nJacked by the police, didn't have my ID\nI said, \"Excuse me, why you tryin' to rob me?\"\nHe had the nerve to, say that I had a curfew\n(\"Do you know what time it is?\nGet out the fucking car, or I'll hurt you!\")\nGet out the car - or I'lI hurt you\nSo here I go, I better make my mind up\nPick my nine up or hit the line-up\nI chose B, stepped into the streets\nThe first cop grabbed me, the other ripped my seat\nThey grabbed my homie and they threw him to the concrete\n(Ay man... Aiyyo... Ay man, just c'mon?)\n(\"What you doin man?\")\nThey tried to frame me\nThey tried to say I had some dope in the back seat\nBut I'm a rap fiend, not a crack fiend\nMy homie panicked (\"I'm out\") he tried to run\n(Freeze nigga!) I heard a bullet fire from the cop's gun\nMy homie dropped, so I hit the cop\nI kept swingin', yo, I couldn't stop\nBefore I knew it, I was beatin' the cop senseless\nThe other cop dropped his gun, he was defenseless\n(Argh, fuck you! Ungh!)\nNow I'm against this cop who was racist\nGivin' him a taste, of trading places\nAnd all this, cause the peckerwood was tryin' this\nFrame up, but I came up\nNow they claimin' that I'm violent\n\n[Chorus]\n\"They claimin' that I'm violent\"\n\"Fuck the damn cop!\"\n\"Just because we play what the people want\"\n\"They claimin' that I'm violent\"\n\"Fuck the damn cop!\"\n\"Just because we play what the people want\"\n\"They claimin' that I'm violent\"\n\"Fuck the damn cop!\"\n\"Just because we play what the people want\"\n\n[Verse 3]\nAs I was beatin' on a cop, I heard a gun click (uh-ohh)\nThen the gun shot, but I wasn't hit\nI turned around it was my homie with the gun in hand\nHe shot the cop (Damn!) now he's a dead man\nI said, come on, it's time for us to get away\n(Let's go, we gotta get the fuck outta here.)\nThey called for backup, and they'll be on their way\nJumped in the car and tried to get away quick\nThe car wouldn't start (Damn!) we in deep shit\nSo we jumped out (C'mon, let's take the cop's car)\nWe drove a little ways thinkin' that we got far\nBut I looked up and all I saw was blue lights\n(that's a lotta of one time)\nIf I die tonight, I'm dying in a gunfight\nI grabbed the AK, my homie took the 12 gauge\n(yeah, it's on now)\nLoad 'em up quick, it's time for us to spray\nWe'll shoot 'em up with they own fuckin' weapons\nAnd when we through sprayin' then we steppin'\nThis is a lesson, to the rednecks and crooked cops\nYou fuck with real niggas, get ya fuckin' ass dropped\nSo here we go, the police against us\nDark as dusk, waitin' for the guns to bust\n(What's next man?) What's next, I don't know and I don't care\nOne thing fo' sho', tommorrow I won't be here\nBut if I go, I'm takin' all these punks with me\n(Pass me a clip) Pass me a clip, G, now come and get me\nYou wanna sweat me, never get me to be silent\nGivin' them a reason, to claim that I'm violent\n\n[Chorus]\n\"They claimin' that I'm violent\"\n\"Fuck the damn cop!\"\n\"Just because we play what the people want\"\n\"They claimin' that I'm violent\"\n\"Fuck the damn cop!\"\n\"Just because we play what the people want\"\n\"They claimin' that I'm violent\"\n\"Fuck the damn cop!\"\n\"Just because we play what the people want\"", "image": "https://images.genius.com/839619da9eb2d92ecf5367044a1fb2ba.500x500x1.jpg"}], "artist": "2Pac"}