{"songs": [{"title": "Tell Me If I’m Trippin’", "album": "Strangeulation Vol. II", "year": "2015-11-20", "lyrics": "[Verse 1: Tech N9ne]\nI wanted to find my gun, my lady runs to the bathroom\nYelling \"someone\", and when it's done\nI'ma treat it like my daughters and son, we having fun\n'Till intruders came knocking to come kill everyone\nThe beat and the kick ringing my bell uncontrollably\nFour in the morning yelling my name so they know it's me\nScramble and try to find my nigga's gun, I'm supposed to be\nPrepared for the crazy, my lady screaming don't go to see\nFuck it, I'm going down to the kitchen to get the knife\nInvite 'em all in my crib and then take everybody's life\nChop 'em all into pieces, pray to God they heat-less\nHe in D shit, play with their bodies in the name of Jesus\nOne, two, three, god damn it's just the cops\nAll the motherfuckers must've scramm' when we hit the block\nI was gonna kill am I wrong to feel\nFor my loved safety I'll leave you permanently still\nTrav said he caught them on camera they came to his place\nTwo teen girls and the guy yelling \"where is Yates\"\nDamn some fans would've lost some lives on this day\nMistaken, I would've been erasing all of the kid's face\n\n[Hook: Tyler Lyon]\nAm I my paranoid or scared\nOr is this my nightmare\nWere they ever really there?\nTell me if I'm tripping\nAm I supposed to sit and wait\nWhile they storm through the gate\nPsycho just like Norman Bates\nTell me if I'm tripping\n\n[Interlude 1: Brotha Lynch Hung]\nYeah, it's gonna be the shit, wait 'till you hear this, man. You on keyboard, I gotta get this fixed, man, damn... Alright, there we go. Alright man, sit over there though\n\n[Verse 2: Brotha Lynch Hung]\nSeven o'clock, I was upstairs\nI was on the keyboard making that tear\nKnock on the front door, C.O. got it\nNiggas came in, I said \"Yo, get in the closet\"\nHit 'em with venom and run up in 'em while they rummagin'\nToo many niggas was coming in, I wanna get me one\nHopin' niggas try me cause I'm finna feel like \"fry me\"\nEyes all Chinese, high off reefer\nI'ma get deeper, turn to the Grim Reaper\nUse a heat seeker when I creep with the heater\nLeave a deep gash, bring the heat fast\nHit 'em with the venom, when I get 'em I'ma keep 'em\nGiving them an enema, even if it's ten of 'em\nThen I'ma, eat 'em like dinner in the cinema\nThen I'ma, shit 'em out, get 'em out\nIn about twenty-four seconds I'ma fuck 'em in the ass\nTuck 'em in the grass, cut 'em up fast\nButtercup, shut 'em up, I'ma cut mass\nI'ma cut lass, nigga he got it, he gotta fuck 'em up, yeah\nTell me if I'm tripping\n\n[Hook: Tyler Lyon]\nAm I my paranoid or scared\nOr is this my nightmare\nWere they ever really there?\nTell me if I'm tripping\nAm I supposed to sit and wait\nWhile they storm through the gate\nPsycho just like Norman Bates\nTell me if I'm tripping\n\n[Interlude 2: Prozak, Woman]\nI don't really wanna play this, guys... This isn't something to mess around with\nCome on, it's just a game, nothing to worry about, sit down\n(Hey, man, hand me one of those beers)\nBut it's not just a game...\nIt is, everything is gonna be fine, hand me a beer too. Come on, let's do it\n\n[Verse 3: Prozak]\nI can still remember, it was January twenty-third, 1994\nAnd a group of us was chilling at the table, we was drinking  with our fingers on the Ouija board\nTryna summon spirits asking \"Ouija, can you hear us?\" never thinking what was in store\nThen the dogs started barking, in the darkness, all of a sudden it was knocking at the front door\nThen we started approaching, cautious as hell as we pulled the door open\nNervous adrenaline, seeming slow motion, no one was there, we went back to the board hoping\nThat we finally made contact, with the deity, apparition on the other side\nThen it started moving out and soon it was spelling out the warning in the morning one of us would die\nWe decided to stop it, said our goodbyes, and left the apartment\nOn the way home Sarah hit a patch of ice, lost control of her car, hit the ditch and lost her life\n\n[Bridge: Tyler Lyon]\nAm I my paranoid or scared\nWere they ever really there?\nTell me if I'm tripping\nAm I supposed to sit and wait\nWhile they storm through the gate\nPsycho just like Norman Bates\nTell me if I'm tripping\n\n[Outro]\n(coughing) Fuck that shit, nigga, hmm, let's party", "image": "https://images.genius.com/d6abef8fbc863a78647f5e7bfd58bbe7.500x500x1.jpg"}], "artist": "Tech N9ne"}