{"songs": [{"title": "Can I Bitch (Canibus Diss)", "album": "Straight from the Lab", "year": "2003-11-07", "lyrics": "[Intro]\n(I, I wanna grow up too)\n\"Uncle Marshall, will you tell us a bedtime story?\"\nHere we go!\n\n[Verse 1]\nNow, once upon a time not long ago\nThere was a little rapper about to blow\nBut his album came, and it was not good\nI think it went lead or double copper-wood\nSo these silly little fans, they were misled\nBy a nerdy Internet computer hip-hop head\n\"Me and you, Clef, we're gonna make some cash.\"\n\"Grab this silver paint and just paint my ass.\"\nHey, mister, would you care to bear witness to\nThe ass-whippin' I'm about to administer\nTo this ass-kissin' little vaginal blister?\nStanibus, little Marshall Mathers' sister\nAnd in this corner, we have the \"Mr\nNot-Havin'-It,\" it's the Mad, sinister\nDr. Evil, with his bag of tricks for\nThis little antagonistic faggot\nDick-sucking ex-LL Cool J fan from Windsor\nI'm 'bout to murder little Kenny-Fag-Kaniff-sta\nYou bastard, I ain't wanna have to diss ya\nCanibus, where the fuck you at? I miss ya!\n\n[Hook]\nCanibitch, oh, Canibitch\nWherefore art thou, Canibitch?\nPlease tell me what happened with\nThat style that you were rappin' with\nCanibitch, oh, Canibitch\nAre you from Los Angeles\nNew York, or just a janitor\nFrom Canada? Oh, Canibitch\n\n[Verse 2]\nNow, at first, I ain't really understand this shit\nPicture me, for a second, and imagine it\nChillin' in the Bat Mansion relaxin' when\nAll of a sudden some bullshit comes across the scanners, it's\nCanibitch, on some 'Stan Lives' shit\nIt creeped me out at first; man, this is sick\nBut me, bein' just as sick, this conflict\nGets my dick harder than arithmetic\nAnd I know how you jealous ones envy\nI shoulda knew better from the first few letters you sent me\nThe first two letters, you were tellin' me shit like\nYou respect me, like any other regular MC\nThe third letter, you asked how come I ain't return\nNone of the messages at Shady Records you left me\nThe fourth letter: \"Slim, you're really startin' to upset me.\"\nThe fifth letter told me you were comin' to get me\nThe sixth letter, there's a bomb threat on our building\nThis crazy motherfucker's really tryna kill me\nSo I went back and read the first few letters that said\nSome shit about a message you left\nOh shit! That's not a E, that's an A!\nThis dude wants to leave me a 'massage,' he's gay!\nRight away, I'm on the phone with Dr. Dre\n\"We got a bogey,\" \"Marshall, I'm on the way.\"\n\n[Hook]\nCanibitch, oh, Canibitch\nWherefore art thou, Canibitch?\nPlease tell me what happened with\nThat style that you were rappin' with\nCanibitch, oh, Canibitch\nAre you from Los Angeles\nNew York, or just a janitor\nFrom Canada? Oh, Canibitch\n\n[Verse 3]\nSo, in two seconds flat, Dre's at my crib\nOnly thing is, we both know where this kid lives\nAnd neither one of us have Canadian citizenship\n\"Shit. Oh, Dre, wait a minute, that's it!\nAll we gotta do is use a bit of turbo-boost\nWe can fly over the border!\" \"Let's Go!\" [whoosh]\nSo we're off to Toronto and we're gainin' speed\n\"What was that? Oh, Jermaine Dupri.\"\n\"Fuck it,\" keep goin', no time to waste\n\"Wait, back up. Hit him one more time, in case.\"\n\"Okay,\" fuck, now he's draggin' under the car\n\"Oh well, only thirty more thousand miles!\"\nMeanwhile, me and Dre are tryna conversate\nJust tryna find a reason for the constant hate\nAnd tryna figure out what happened to 'Germaine Propane'\n\"He couldn't have fell off that hard.\" Ain't no way!\nWhat happened to the way you was rappin'\nWhen you was scandalous?\nThat Canibus turned into a television evangelist!\nPlus, he raps with his regular voice\n[Four impacts] \"What was that?\" \"Pet Shop Boys.\"\nSo, we pull up to the bridge where he last was spotted\nHis corpse was still movin', but his ass was rotted\nAnd he kinda smelled a little like Courtney Love\nI figured if I stick him with a fork, he's done\nSo I stabbed him twice, kept jabbin'—Christ!\nHe won't die! This guy's like a battered wife!\nHe's like Kim: he keeps comin' back for more\nBut he won't fight back, I cracked his jaw\nHold up! 'Bis, quit foldin' up!\nPunch me in the chest, make my shoulders touch\nDo something! At least one punchline!\nCome on! 'Til the meter reads Nine! Nine! Nine-\nTy nine percent of my fans are blond!\n'Bis, come on, answer me, man, respond!\nTell me 'bout the sun, rain, moon and stars!\nIntergalactical metaphors from Mars!\nRaw to the floor, raw like Reservoir Dogs!\nBite another line from Redman's song!\nSuddenly, the stub of a dead man's arm\nFrom a midget reaches out from under the car\nIt's J.D.! This motherfucker won't die, neither!\nDre starts sprayin' him with cans of ether\nWe swamped the bitch in it; stomped the bitch again\n\"Compton!\" \"Detroit, bitch, talk some shit again!\"\n\"Stomp him!\" \"Switch feet!\" \"Stomp him!\" \"Switch again!\"\n\"Dre, all right, he's dead, dog, quit kickin' him!\nI think Stanibus jumped off the bridge again!\" (\"Ahh!\")\n\"Damn,\" \"He disappeared, yo, he's gone, he did it again!\"\n\n[Hook]\nCanibitch, oh, Canibitch\nWherefore art thou, Canibitch?\nPlease tell me what happened with\nThat style that you were rappin' with\nCanibitch, oh, Canibitch\nAre you from Los Angeles\nNew York, or just a janitor\nFrom Canada? Oh, Canibitch", "image": "https://images.genius.com/8dd03ebbf724e2b4d4bafbddf8c3c2f1.1000x1000x1.png"}], "artist": "Eminem"}