{"songs": [{"title": "Nasty", "album": "Life Is Good", "year": "2011-08-09", "lyrics": "[Produced by Salaam Remi]\n\n[Intro: Nas & Big Kap]\n(Y'all ready for Nas?\nQueensbridge, y'all ready to see Nasty Nas?\nUh huh, they ready)\nYeah, word\nGot some Rémy Martin\nAnd some good-ass cigars, check it out\n\n[Verse 1: Nas]\nAyo, late night, candlelight, fiend with diesel in his needle\nQueensbridge leader, no equal\nI come from the Wheel of Ezekiel\nTo pop thousand-dollar bottles of Scotch\nSmoke pot and heal the people\nAny rebuttal to what I utter get box-cutter'd\nCount how many bad honeys I slut, it's a high number\nName a nigga under the same sky that I'm under\nWho gets money, remain fly, yeah, I wonder\nEyes flutter, it's love when Nas pops up\nStars get starstruck, panties start drippin'\nThe ways of Carlito, blaze, torpedo cigars\nDrop Rolls, hoes drop clothes\nLouis the XIII, freaks, women nice size\nI ride like Porsches, thick, brown and gorgeous\nIt ain't my fault, semi-automatic weapons I brought\nThe world crazy, I'm rich and I'm girl-crazy\nDick 'em, convince ‘em all to praise me\nThey ideology is confusion, I lose 'em\nFellates me, who hate me? My gun off safety\nSince the Tunnel and Skate Key, my jewelry in HD\n\n[Verse 2: Nas]\nSilent rage, pristine in my vintage shades\nI'm not in the winters of my life or the beginning stage\nI am the dragon\nMaserati, pumpin' Biggie, the great legend\nBlastin', I'm after the actress who played Faith Evans\nMy little Jackie Onassis, dig?\nI'm so high I never land like Mike Jackson's crib\nVest on, .45 still crack ya rib, sacrilege\nTalk trash 'bout the Nasty kid\nPast nasty now, I'm gross and repulsive\nTalk money, is you jokin'?\nCash everywhere, in my bank, in the sofa\nIn the walls, in the cars, in my wallet, in my pocket\nOn the floors, ceilings, the safe, bitch, I got it\nYou envy, but don't offend me\nI'm skinny, but still I'm too big for a Bentley\nYou are your car, what could represent me?\nToo Godly to be a Bugatti, you honestly\nMust design me somethin' Tommy Mottonic from Queens had before the 90's\nDrug dealer car, rush to the bar\nMove, niggas! We don't give a fuck who you are\nBlack card heavy like a magnet in my stitched denims\nPretty women see them saggin'\nBet a hundred stacks niggas'll run it back\nJust havin' fun, I ain't even begun to black\nLight another blunt in fact, haha...\n\n[Interlude: Nas]\n(Nasty) Nasty kid\n(Nasty) Yeah...\n(Nasty) The kid! (Nasty) Yeah...\n(Nasty) Nasty kid (Nasty)\n\n[Verse 3: Nas]\nFor the hustlers, thick as yellow bitches for the suck of it\nGot a bunch of niggas in prison braggin'\nSaying, \"It was Nas I used to hustle with\"\nI display fashions while my lungs engage hashish\nGuns on my waist, past this\nSince I'm cakin' up, put funds in my safe, laughin'\nAnd joinin' the blunt passin' you niggas was straight assin'\nExcuse the vulgarity, I'm still not fully adjusted\nOr used to the new fans hearin' me spit rapidly\nI never see the whips niggas be claimin' they drivin'\nI guess entertainment means blatantly lyin'\nFake it 'til you make it, I've driven those toys\nBeen in them wars, in the streets, cops kickin' in doors\nFor my team nigga, your flow cheap as limousine liquor\nI’m no fake rap CD listener, sit back and roll a mean swisher\nFor my G's, tell these clowns make room for the king, nigga", "image": "https://images.genius.com/33d35583937f6ea6a19343b8b7effa3d.400x400x1.jpg"}], "artist": "Nas"}