{"songs": [{"title": "Mash And Bang", "album": "Legit Ballin Vol. 2", "year": null, "lyrics": "(Turtle Banxx)\nPicture this shit you facing\nTotalin body and murderous situations against nations we organize like maces\nGot killers patiently waitin\nDifferent places you facing the yellow taping and federal x with graces\nWe ruinin your reputation\nMomma in the hospital pacing for every shot you taking\nThe doctors can't stop the shaking\nSee faces blazin\nLike the son of Satan that punished your creation\nVersus me, it's like a gun that gets nathan\nWhat you expect? (say what)\nLike a neutron on deck (yeah)\nNigga you gonna catch rays (ha)\nYou confess lets get cash and thangs (ugh huh)\nSmokin flash and range\nCause we mash and bang\nTill the vet we slay (ahhhhhhh)\nMotherfucker, let it reign\n\n(Bennie Franks)\nNow they knowing that we mash and bang\nTexas 380 in this cash for cash and mask\nY'all then fucked up now\nLet the south and west connect\nWe snatch a soul out ya better chosen swiss cheese your Avirex\nWhats up now?\nMe and my nigga Turtle cown(?)\nTo late to rehearse nigga (shit) thangs looking shitty now\nPass ya a Phillie pal\nI'm all up in ya now\nAnd when i blast you hear (gunshot)\nFeeling me now?\nWhat i feel for the opponent\nSmell the aroma\nWell come swim with these killa piranhas\nSharin heat orders slash g's and fours\nStreet patrollers can't run when the gasket blows\nYour caskets close\nMy eyes open\nYou fuck around and get John Blaze now ya broken\nAnd now I'm hoping you escape before crimes broken braids on the gallery\nFat too many calories I'm ghost Mickey and Mallory\n\n(chorus)\n(Turtle Banxx)\nWe came motherfucker\n(Bennie Franks)\nWe came motherfucker\n(Turtle Banxx)\nTo bang motherfucker\n(Bennie Franks)\nTo bang motherfucker\n(Turtle Banxx)\nWith an aim motherfucker\n(Bennie Franks)\nWith an aim motherfucker\n(Turtle Banxx)\nTo blow you out your frame motherfucker\n(Bennie Franks)\nTo blow you out your frame motherfucker\n(Todd Nitty)\nCan't help it to be bogus man\nYou know the game\nGot me tighter than a choker chain\nFor flashing thang\nCash but raps and caine\nAll my thugs grab them thangs\nCause we gonna mash and bang\nMash and tame\n\n(Turtle Banxx)\nBotherly we and bodies sippin voscie voscily dick the hottie\nProperly lick a shottie nut up switch a party to a Jason scene\nCut up everybody scream \"To Shut Up Everybody\"\nJuss means you what up big body?\nMy association with fornication got me exposin tricks\nNegotiatin motivation for my disposal\nBody bog\nPut the mask on fuck it take the mask off\nOpen fire blast motherfuckers then we mash on\nFor the change we bang and the thangedest chain\nIf the nights then the name medallion then blow out his brain\nSame mobster and baller hit the casino click the revolvers\nHeat in casinos Turtle Banxx and Bennie Franks\nG.O. Deniro fuck Denaro\nMash the pedal to the metal\nAin't no swashing we heartless bang to this settle\nYou ain't walking the austin and departing the ghetto carchers(?)\nSome bledo when when the pistols echo and serve to protect em\n\n(Bennie Franks)\nFuck them niggas hollerin heat with they narrow barrels\nI got killers that'll bang Jason in math terror\nYour replacements ask Nicholas Cage where ya face went\nFake ass hation hanging butt naked in my basement\nDip em in honey hang em hot\nY'all adjacent vanilla ounce truce let em fly\nThat'll erase em\nShould have ran before we cocked back loaded and aim\nBennie Franks and Turtle Banxx we mash and bang\n\n(chorus)", "image": "https://images.genius.com/b61c84cf38b4d4f2133ce851fe5c6b1c.500x500x1.jpg"}], "artist": "Twista"}