{"songs": [{"title": "Crown Me", "album": "Pound Syndrome", "year": "2015-06-01", "lyrics": "[Intro]\nYo, let me take you to the tribe real quick\n\n[Verse 1]\nI'm from that small city called Panorama\nWhere the vatos roam and they blast they hammers\nNever had no sense, so I'm bad with manners\nWho'd've thought I'd be livin' life in the flashin' cameras?\nGot bitches on my nuts like pubics (Ooh!)\nNiggas could never figure me out like Rubik's (Cubes)\nI be bullyin' everybody like I'm Brutus! (Who?)\nSo don't underestimate me, I do this, truest\nI'm calm and ill but still drop bombs, I kill\nYou know the deal, with my godly skills\nYou wanna jog the field in my shoes? There's a lot to fill\nIt won't happen, you cannot be real\nMan, there's so many rappers that wanna catch my fade\nSo many bitches that wanna snatch my brain\nI'll probably end up on the news, dead, bullet in the head\nMama in the street yellin': \"That's my baby!\"\nYou want me to keep it to a minimal with the syllables?\nI think you should get up off my genitals\nEvery nigga identical when they spit a flow, this shit is critical\nI'ma have to get rough and get all my sentinels\nNigga, what you be sippin' on? I'm guessin' your pen is broke\nIs it difficult for you to get better? You're so despicable\n'Cause your shit is boo-boo, your bars are predictable\nI do not bump it, it's hard to get into you\nPlease admit it, man, the voyage is radical\nMind is set to just destroy, I'm an animal\nKillin' shit, man, I'm a poisonous antidote\nI be on it, man, your boy's international\nYeah, I'm mad with rhymes\nBeen doin' this since '99, I'm a mastermind\nHomie, it's 2015, and all my niggas gon' kill it\nWhen they finish the job, the other half is mine\n\n[Refrain]\nFool, you ain't on that real shit\nI live here, you on a field trip\nI'm made of shit you ain't built with\nYou a bitch, yo' girl need a real dick\nIt's no doubt niggas gon' feel this\nYou don't scare niggas, not even a little bit\nI serve you, you get the bill quick\nCrown me, I'm a real prince\n\n[Hook]\nGive me that crown boy! (Give it!)\nI said \"Give me that shit!\"\nGive me that crown boy! (C'mon!)\nI said \"Give me that shit!\"\nGive me that crown boy! (Give it!)\nI said \"Give me that shit!\"\nGive me that crown boy! (C'mon!)\nGive me that shit!\n\n[Verse 2]\nThe rap game's mine, I revolve it 'round me\nI think I have lost it, and my mind's exhausted\nI'm nauseous from the process\nOf hoppin' on stage and tryin' to dive in moshpits\nNigga, why you focused on diamonds?\nThese Cubic Zirconia's all up in my ear\nOver jewelry, I don't get excited\nMy perception in life is \"Why the fuck am I here, nigga?\"\nI've been this way since your ass has been suckin' on titties\nSince niggas cocked back and start bustin' on 50\nSince J-Lo was mobbin' in public with Diddy\nSince Biggie and Pac got shot up, it's a pity\nThat bullshit you're talkin', I'm not in the mood, bro\nContinue yappin', you'll see Hopsin is brutal\nKeep pushin' me, you gon' get dropped with some Judo\nYou fannin' out like you want cock in yo' culo\nNiggas only in it for money and bitches\nI don't even think they wanna rap no more\nBut they wanna be all over the television\nRockin' feminine shit, tryin' to act homo\nOld bi-ass niggas can't bypass niggas\n\"I can't change even if I tried\"-ass niggas\nTight jeans on so they show yo' ass-ass niggas\nIn the pool with the homie, tryin' to splash-ass niggas\nFruity as Mike and Ike, you'll get diced to rice\nWhen I arrive I pull up like \"Hi! Surprise!\"\nIt might be wise to hide when the nightly skies are high\nFuckin' with an ape; no Life of Pi\nTell me, what position would the game be in\nWithout me havin' the ability to rape the pen?\nPound Syndrome, this is it, I'm weighin' in\nI still hate y'all niggas and I can't pretend\n\n[Refrain]\nFool, you ain't on that real shit\nI live here, you on a field trip\nI'm made of shit you ain't built with\nYou a bitch, yo' girl need a real dick\nIt's no doubt niggas gon' feel this\nYou don't scare niggas, not even a little bit\nI serve you, you get the bill quick\nCrown me, I'm a real prince\n\n[Hook]\nGive me that crown boy! (Give it!)\nI said \"Give me that shit!\"\nGive me that crown boy! (C'mon!)\nI said \"Give me that shit!\"\nGive me that crown boy! (Give it!)\nI said \"Give me that shit!\"\nGive me that crown boy! (C'mon!)\nGive me that shit!", "image": "https://images.rapgenius.com/7e5a5a9adf21721092f4eadc151c8f8c.350x350x1.jpg"}], "artist": "Hopsin"}