{"songs": [{"title": "Code Of THUG LIFE", "album": null, "year": "1992-01-01", "lyrics": "Code Of THUG LIFE\n\n1. All new Jacks to the game must know: a) He’s going to get rich. b) He’s going to jail. c) He’s going to die.\n\n\n2. Crew Leaders: You are responsible for legal/financial payment commitments to crew members; your word must be your bond.\n\n\n3. One crew’s rat is every crew’s rat. Rats are now like a disease; sooner or later we all get it; and they should too.\n\n\n4. Crew leader and posse should select a diplomat, and should work ways to settle disputes. In unity, there is strength!\n\n\n5. Car jacking in our Hood is against the Code.\n\n\n6. Slinging to children is against the Code.\n\n\n7. Having children slinging is against the Code.\n\n\n8. No slinging in schools.\n\n\n9. Since the rat Nicky Barnes opened his mouth; ratting has become accepted by some. We’re not having it.\n\n\n10. Snitches is outta here.\n\n\n11. The Boys in Blue don’t run nothing; we do. Control the Hood, and make it safe for squares.\n\n\n12. No slinging to pregnant Sisters. That’s baby killing; that’s genocide!\n\n\n13. Know your target, who’s the real enemy.\n\n\n14. Civilians are not a target and should be spared.\n\n\n15. Harm to children will not be forgiven.\n\n\n16. Attacking someone’s home where their family is known to reside, must be altered or checked.\n\n\n17. Senseless brutality and rape must stop.\n\n\n18. Our old folks must not be abused.\n\n\n19. Respect our Sisters. Respect our Brothers.\n\n\n20. Sisters in the Life must be respected if they respect themselves.\n\n\n21. Military disputes concerning business areas within the community must be handled professionally and not on the block.\n\n\n22. No shooting at parties.\n\n\n23. Concerts and parties are neutral territories; no shooting!\n\n\n24. Know the Code; it’s for everyone.\n\n\n25. Be a real ruff neck. Be down with the code of the Thug Life.\n\n\n26. Protect yourself at all times..", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}