{"songs": [{"title": "Fuckin Wit the Wrong Nigga", "album": "Until the End of Time", "year": "2001-03-27", "lyrics": "Niggas.. fuckin' with the wrong nigga\n\n[Verse 1]\nMy seductive introduction be specific\nStill elusive, but exclusive's what I give you when I kick it\nAnd I'm still lifted; niggas can't get with Mr. Wicked\nPicture me flippin' my adversaries, gettin' the dick swiftly\nNiggas is swingin' wild, but they styles miss me\nYou can bring that bitch, but your whole click will still get treated shitty\nBusiness never personal\nI'm up before the sun come up, I'm tired\nJust a ghetto star, a drop top double-R is what I'm ridin'\nNigga, if you was half the man your bitch was\nBring yo' artillery when you come for me, ‘cause we sick thugs\nNo hesitation when I pull and blast, ‘cause Syke was bustin'\nPlus, Bo had 'em duckin', screamin', \"Get they cash!\"\nSo now I got the law on me\nMy phone's tapped, so I had to send word through my lil' homies\nTell them niggas this the year when they pull the trigger\nShit, this is what you get, for fuckin' with the wrong nigga\n\n[Hook]\nThis is what you get\nWhen you fuckin' with the wrong nigga\nHehehehe, yeah, nigga, peep it\n\n[Verse 2]\nBefore I lay me down to sleep, I pray and thank the Lord\nFor givin' me another fruitful day\nI wanna be a peaceful, man, but still when niggas come for me\nAll I can see is gettin' 'em killed\nFor real, it's how I feel\nReflect my thoughts, flowin' on these reels\nMake my enemies deal with my steel; they caps peeled\nWe still cool, but you played yourself\nGive him the MAC and make him spray hisself, heyyy\nFallin' legends clutchin' chrome three-five-seven\nPuttin' two bullets to they dome, wanted to die in Heaven\nWhy call in shots? Nobody really as clear as me\nAin't tryin' to help the feds get a case for conspiracy\nMurder, my foes get disposed of\nWe all homies to the death, so my true niggas show me love\nGod, forgive me for my lifestyle, a negative figure\nBut why they fuckin' with the wrong nigga\nYou know?\n\n[Hook]\nIt's like.., why you fuckin' with the wrong nigga?\n\n[Verse 3]\nI was raised by thugs, schooled by killers\nLearned my mathematics skills from real drug dealers\nTried to rise, but they tried me\nI guess they all had to die, ‘cause we tried peace\nI die in these streets\nBlast 'til they recognize\nStill do or die, all my niggas gettin' high, watchin' time fly\nBest strategize on the way to profit\nBest organize how you ride, so they can't stop it\nThen keep it poppin', lot of busters wanna see me fall\nI fucked your bitch, and now this new shit, gon', fade 'em all\nMy niggas ball, made a call for some back-up\nThe lil' homies and my dogs in the black truck\n\"Buck buck\" was the sound as they gats burst\nNo need for ambulance, baby, bring the black hearse\nShould've never fucked around, buster\nHow you figure makin' moves on the wrong nigga\n\n[Hook]\nIt's what it sounds like, ding ding ding..\nWhen you fuckin' with the wrong nigga\nNiggas gettin' hit, when they fuckin' with the wrong nigga\nFuckin' with the wrong nigga", "image": "https://images.genius.com/74b94f4112372859edd6ae711af0df41.1000x1000x1.jpg"}], "artist": "2Pac"}