{"songs": [{"title": "We Just Wanna Party With You", "album": "Men in Black - The Album ", "year": "1997-09-03", "lyrics": "[Jermaine Dupri:]\nUhh, whatchu wanna do? SoSoDef\nYou wanna get down? (ah get down, get down)\nWhatchu wanna do? (ah get down, get down)\nSaid you wanna get down? (We got Snoop Dogg, in the house tonight)\nWhatchu wanna do? (with the homeboy JD)\nYou wanna get down? (ah get down, get down)\nWhatchu wanna do? (ahh ha ha)\nYeah, now check this out\n\nNow, everywhere I go\nThey wanna see Don Ciccio\nYes obsessed with SoSo all my dough\nHow the jewelry glow and the Cristi' flow\nAin't no secret I sleep with freaky\nPremium bush when I push they push\nAnd after we push I leave her\nCause I don't love her\n\n[Snoop Doggy Dogg]\nHa ha, and me neither\nA-B-C-D-P-G-C\nWho could it be, it's the D-O-double-G\nKnown for the bone and the chrome on the D's\nGold credit card backyard full of green trees (what?)\nBreeze through the summer in a Hummer with tint\nOr dip in the low-low but that's just for promo\nNever leave me alone, without the dough doe\nI'm so so cold but y'all didn't know doe\n\n[Chorus:]\n[JD]\nWhatchu wanna do? Said you wanna get down?\nWhatchu wanna do? Said you wanna get down?\n[Chorus: Trey Lorenz]\nGet down on it, get down on it, get down on it\nWe just wanna party with you\n[Snoop]\nWe have Snoop Dogg in the house tonight with the homeboy Ah get down, since you wanna get down\n\n[Snoop Doggy Dogg]\nTo be a high roller, you need a pistola\nAnd about a half a key of some Coca-Cola\nNow that I got older, I got a little colder\nAnd I don't trip to get a chip off my [nigga's] shoulder\nMad dreams, of a gangsta being like Cagney\nOr Bogey but Snoop Doggy\nAin't no follower, man I'mma general\nSo when I put it down I gots to be so original\nI'm quick to bust just like Daz Dillinger\nBut that's the little homey\nAnd I'm the big homey Snoop Don Corleone\nSpittin it, hittin it, while I'm gettin that\nBout it, bout it, and happy to shout out, mmm\nI dissapear 'fore the game get crowded\nTake a trip overseas to the West Indies, freeze\nJD (uh-huh), music please\n\n[Jermaine Dupri]\nI get goosebumps when the bassline thumps\nSo phat [niggas] call me Professor Klump\nAin't nuttin on the low about me I floss\nAnd no there's none of these [hoes] son what I toss\nOn the track better bring chips cause I cost\nMillion dollar company [fuck it] I'm the boss\nI don't sit back and watch, I go for it\nDifferent colored drops on the car port, who's short?\n\n[Chorus]\n\n[Snoop Doggy Dogg]\nKhakis on my leg, Lugz on my feet\nI'm walkin up the street while boppin my feet\nI'm fresh off the bus from Memphis, Tennessee\nHead still spinnin from the Coke and Hennessey\nSit down on it, nah, get down on it\nIt really don't matter cause you want it, Dogg-gonit\nCuzz, you must was buzzed\nWhen you was bumping your gums, who you thought I was?\nBut look, I ain't even tripping right now\nIt's like that there, bow, wow\nSo many styles I could flip em like a file\nPop my drop top and let the beat rock\nDip through, course you do, miss you\nBut back to the issue, I wish you\nStop tryin to clown the Pid-ound\nCause you don't really wanna get down\n\n[Chorus]\n\n[Trey Lorenz]\nAll we wanna do is make you dance\nNo standing on the wall, baby\n[JD] Get your back up off the wall, c'mon\nAll we wanna do is make you dance\nNo standing on the wall\n[JD] Get your back up off the wall\nCause I heard all my [niggas] say\nYou know it\n[JD] Uh-huh\nWhen you're dancing yeah\n[JD] That's right\nYou show it\n[JD] Uh-huh\nWhen you move move move\n[JD] Yeah\nYou know it\n[JD] Do you wanna dance? Come with me and dance\nWhen you're dancing yeah\nYou show it\n[JD] Do you wanna move? I'mma make you move\nWhen you move move move\n[JD] Come with me, yeah yeah, we gon let the beat go on like this\nY'all wanna dance? I'mma make your dance\nY'all wanna move? I'mma make you move", "image": "https://images.genius.com/9112106afbcbf1292e4520787d890de7.220x220x1.jpg"}], "artist": "Snoop Dogg"}