{"songs": [{"title": "Strange Music Box", "album": "K.O.D.", "year": "2009-10-09", "lyrics": "[Intro: Tech N9ne]\nAww, dwaamn!\nDo y'all realize what y'all done did? (Hihi)\nY'all done opened up a can of sick-ass\nAnd I'm about to eat y'all quick-fast, hey\n\n[Verse 1: Tech N9ne]\nI've been hibernatin' in the deepest darkest part of Necropolis\nNow that I'm poppin' it's top, yes I'm the opposite of monogamous\nMénage, I get awkward in this box a bit\nHostile, it's gotta get twist in a knot with this apocolypse\nHolla it (Tech-Tech N9ne-N9ne shit, I'm lovin' it)\nI'm a drug to this grudge of his, rip my covenant, I'll plug a bitch\nLovin' this mug is what the ruckus is, psycho thug with it\nFallin' down like Michael Douglas with the ruggishness\nWhat did I mean, they wonderin' why did I bring this side of my dream?\nThe Nina's a horror machine, dollar for dollar, I balla for all of my green\nNigga, my name is Inigo Montoya, I got an evil plan for ya\nAnd you're about to get dropped, this box is worse than Pandora\nHa-ha-ha-ha-ha!\nThey're all gonna laugh at you, 'cause I had to do what I had to do\nWhen tappin' you like Shabba Doo\nBeatin' 'em up and shootin' 'em up then stab a few\nSad ya knew that you had your crew and they ass are through\nI'm killin' em, throwin' 'em back at you\n\n[Hook: Tech N9ne]\nThat's what's happenin', Strange Music Box\nGot us tappin' in, Strange Music Box\nBump then slap again (why?) Strange Music knocks\nBack up openin', Strange Music Box\nThat's what's happenin', Strange Music Box\nGot us tappin' in, Strange Music Box\nBump then slap again (why?) Strange Music knocks\nBack up openin', Strange Music Box\n\n[Verse 2: Krizz Kaliko]\nSee once they open my lid I'mma give it to 'em\nEver since I was a lil bitty kid I've been truly ruined\nI reflected on what I did 'fore I ran into 'em\nI used to be a fat jerk now I flirt 'cause the scent of a woman\nNow I don't act like, walk like, the nigga that you used to know\nNow I sing and rap about the strange life, it's beautiful\nTell it to 'em like a Geni-u-s, spit it out like I thought you knew\nBubblin', hope you hear me fizz, prayin' to God I make it through\nKali Baby, check my strange box of tricks\nCalico alley cat, lyrical, watch his lips\nHe can go really fast, slow it down and stop that shit\nOr make it dumb to make sure you niggas got that shit\nI'm just playin' with music, I'm the elite heat speech chief\nPlay me and watch they feet turn Beat Street\n'Cause I'm blowin' out they socks, The Freddie Foxxx of my block\nThere's somethin' strange goin' on in that box, Kali Baby!\n\n[Hook: Tech N9ne]\nThat's what's happenin', Strange Music Box\nGot us tappin' in, Strange Music Box\nBump then slap again (why?) Strange Music knocks\nBack up openin', Strange Music Box\nThat's what's happenin', Strange Music Box\nGot us tappin' in, Strange Music Box\nBump then slap again (why?) Strange Music knocks\nBack up openin', Strange Music Box\n\n[Verse 3: Brotha Lynch Hung]\nSpiderman, off of this lyrical Vicodin\nOff of this here we go I get it in\nSpittin' that petrol, let go, Tech know sets blow (Kaboom)\nCome see about me, nigga\nFigure this, I'mma get venomous takin' out ten of us\nNiggas is sweet like cinnamon, wait, but then again\nI'mma pick up the pen again, bit 'em in half, blood bath\nThen I'mma laugh, then I'mma smash\nThen I'mma ash, then I'mma blast first\nThen I'mma send him his ending, cut 'im up\nFuckin him up the rectum, I dissect the man\nI'mma try to eat the neck and hand\nSlice him up like a Mexican\nSeconds in his body is fricassee shit is bleedin', you should see him or you can be him\nI got dead human beings in the freezer, I'm a believer\nI ain't no Wally Cleaver but I carry a meat cleaver\nI speek geek to people, I'm lethal, a little strange\nI eat it with Cream of Wheat and some butter that's mixed with brains\nI'm the Coathanga Strangla, hangin' him up, he's fried rice\nHe tried twice, he's dry ice, tell 'em Tech N9ne\n\n[Hook: Tech N9ne]\nThat's what's happenin', Strange Music Box\nGot us tappin' in, Strange Music Box\nBump then slap again (why?) Strange Music knocks\nBack up openin', Strange Music Box\nThat's what's happenin', Strange Music Box\nGot us tappin' in, Strange Music Box\nBump then slap again (why?) Strange Music knocks\nBack up openin', Strange Music Box", "image": "https://images.genius.com/de5c12836aa9b9bbb55356aafbf1fa0a.900x900x1.jpg"}], "artist": "Tech N9ne"}