{"songs": [{"title": "Let it Out", "album": "Ego Trippin’", "year": "2008-03-07", "lyrics": "[Snoop Dogg]\nWell it's the super duper Snoopa once again I'm on the fly\nSwoopin through I'm in my coupe and all the bitches want a ride\nIf it's trippin like I'm clippin I'm still grippin on my nine\nWe be Crip'n while I'm dippin with my C's up in the sky\nAnd the East is still my side, I'm a reaper when I ride\nFuck a feature, I don't need a motherfucker, I'm the guy\nI delete 'em, stampede 'em, straight eat 'em like some fries\nGet a ketchup, get 'em messed up, turn the heat up let 'em fry\nAin't no different when I'm rippin, pimpin's still up in his prime\nTV shows, movie hoes, pimpin's still up on his grind\nMan these hoes don't know, I'm workin with a nine\nI ain't talkin 'bout a gun, I'm talkin feel it in your spine\nWhen I hit it from behind, if I go up in your mouth\nI might hit you in the mind, you know what I'm talkin 'bout\nIt'll thrill ya, I'm the stealer that'll kill ya with the rhythm of a trigger\nMotherfucker better duck before I hit her, bang!\n\n[Hook]\nDogg-y Dogg, is all, you need\nSo love, the Dogg, like we, love weed\n(Breathe in) Breathe in (breathe out) let it out\n(Breathe in) Breathe in (breathe out) let it out\n(Breathe in) Breathe in (breathe out) let it out\n(Breathe in) Breathe in (breathe out) let it out\n\n[Snoop Dogg]\nYou niggas mad cause I done came and crept up back up on the scene\nThis is bye, retire, I'm still spittin gasoline\nI'm a gangsta motherfucker what the fuck you think that means?\nLittle nigga I'm the king, I ain't givin up a thing\nIf you want it come and take it nigga, I'll be sittin waitin\nMake a patient nigga got the other ear and I'll bake a nigga\nFuck it put the gun down, and straight bank a nigga\nTake it nigga, take it nigga fuck, you ain't this nigga\n.. Slow down my turbo flow\n.. Inhale my doe-doe smoke\n.. Okay I let the fo'-fo' blow\nAnd the po-po know, that's why they on my dick\nAnd they at my crib, tryin to find my shit\nTryin to search my house, what the fuck that's 'bout?\nI ain't givin up shit, you can search that bitch\nI ain't got nuttin Jack; get the fuck on back\n\n[Hook] - 2X", "image": "https://images.genius.com/fd5ace5214e5da1f374653720da7d1c1.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}