{"songs": [{"title": "Oxford Lecture", "album": null, "year": "2015-03-02", "lyrics": "I’ll take one question. I wanted to vibe off an idea, and then I can riff off of that…they said I’ve got 20 minutes or so, I might go longer\n\nOK, everyone please be completely quiet, because I can literally hear a whisper, and it’ll throw off my stream of consciousness, and when I get my stream of consciousness going that’s when I give the best, illest quotes. Literally, a whisper can throw it off\n\nToday was the first time I realised, If I could have done it again I would have gone to the Art Institute over the American Academy of Art, I would have researched where I could have got the best and the strongest education\n\nAnd I’m sure this will end up online, so I don’t want to diss anyone at the American Academy, I’m sure it’s equal to the Art Institute of Chicago by now, but at the time I was going I would look around at the work of the class and not feel inspired by the teachers, and I kinda, the idea of being a fine artist, that’s a really difficult profession to get into, to be respected in, to make money at.  Maybe the goal for some of the people was just to work at an advertising agency or at a record label\n\nMy goal, if I was going to do art, fine art, would have been to become Picasso or greater\n\nThat always sounds so funny to people, comparing yourself to someone in the past that has done so much, and in your life you’re not even allowed to think that you can do as much. That’s a mentality that suppresses humanity\n\nSome of you here probably remember the night when the Donda tweets came through me and I started talking about professions that you guys are going into, that seemed they had nothing to do with a rapper. I was talking about a band of thinkers that could remove religion, race, gender, and somehow come together to find solutions for a broken planet\n\nWe have the resources as a civilization to find a utopia, but we’re led by the most greedy and the least noble\n\nWhat I notice about creatives is that, and one of the reasons why I get into trouble, is, not only do I want to design video games, or make music, or ride bikes, I think one of the most important things to my ability to create so much in the past 30 years is my desire to play sports. I approach creativity like a sport, where if I have a drawing I react just like a jock: LOOK AT THE FUCKING DRAWING RIGHT THERE YEAH!\n\nWe’re all creatives here, we’re all born artists. Some people are artists of business, some people are artists of composition\n\nWe were taught to hide our black fingernail polish and put our head down in the back of the class and not notice out of fear that someone might laugh at one of our ideas – that our idea could become a mockery or a failure in some way\n\nThere’s a Bible saying, ‘No weapon formed against me shall prosper’. Recently I’ve been doing interviews and I’ve had to go back to this verse because I don’t think there’s a living celebrity with more weapons formed against them, but I also don’t think there’s one more prosperous. So what weapons have prospered? The smoke and mirrors of other opinions\n\nI was sitting with Steve McQueen, he shot the visuals for All Day two days ago, it’s completely different to the Brit awards\n\nSo it doesn’t get taken out of context, I’m going to use the word ‘like’. I’m not saying it is, I’m using it as a comparison. So people that want to say ‘Kanye goes to Oxford and tells everyone blah blah blah’. And I’m not telling you this. I’m telling you what I told Steve McQueen in private\n\nWhat I said was The Matrix is like the Bible of the post-information age\n\nI compared it like, when the hundred guys come at Neo, those are opinions, that’s perception, that’s tradition. Attacking people from every which angle possible. If you have a focus wide and master senses like Laurence Fishburne and you have a squad behind you, you literally can put the world in slow motion\n\nIt’s still February, right? (security guard shakes his head, everyone laughs)\n\nBy the way, I don’t know the days of the week. I just go to exactly when my appointment is\n\nWe’d just look at each other and say, it’s still February. For the sheer mount of work that we were able to put into the world. Some of the stuff had been worked on for years coming, months coming. But nonetheless they came back to back to back to back. Answering every crazy interview question, blocking every shot, catching every rebound. Aside from the right I don’t have to give my opinion publicly about artists, I probably would have been batting 2000. I know that’s incorrect also\n\nThis humanity that I talk about, this civilization that I talk about, this future utopia I talk about…it can only happen through collaboration\n\nI love Steve Jobs, he’s my favorite person, but there’s one thing that disappoints me. When Steve passed he didn’t give the ideas up. That’s kinda selfish. You know that Elon’s like ‘yeah, take these ideas’. Maybe there are companies outside of Apple that could work on them and push humanity forward. Maybe the stock brokers won’t like that, the stock holders wouldn’t like that idea, but ideas are free and you can’t be selfish with them\n\nI think that progression of mind with the advent of a human being named Drake (laughs, smirks, crowd laughs) you know, this idea of holding onto a number 1 spot. And then you get this guy that comes and blows out the water every number 1 of any band ever. Be it me, or Paul McCartney [laughs]\n\nI understand that I’m a servant. And with my voice, with my ability to build relationships with amazing people, speak to amazing people. Call Elon Musk out of the blue, or call Obama out of the blue…he calls the home phone, by the way\n\nWith that, I have a responsibility to serve. Why do I say the Matrix is like the Bible? What is my definition of the Matrix? [he never answered this]\n\nI work with an artist called Vanessa Beecroft, and she bought my daughter some toys\n\nI’d see toys that some people would buy for my daughter and I’d say this toy isn’t quality. I don’t want my daughter playing with this. There’s not enough love put into this, this is just manufactured with the will to sell, and not the will of inspiration\n\nVanessa is very focused, she’s like my eyes, she’s a piece of my brain. She bought my daughter these three wolves, knowing the whole collection, that it’d play with the song Wolves, and based on this concept. And when my daughter saw these wolves, I’ve never seen her so happy. She was going so crazy, she was grabbing one, she was riding on top of one…I’ve never seen her happier than this moment. That level of happiness seems to be the thing that we’re fighting for every day, that we’re trying to buy back, trying to work for, especially in America\n\nIn America people really do wear $3000 shirts. For real. Here and in Stockholm people will be like ‘oh dude, it’s a $3000 shirt’\n\nI’m assuming I’m probably wearing a $2000 shirt but I got it for free from the designer so\n\nWe’ve been sold a concept of joy through advertising, through car advertising, through fashion branding. It’s not the concept of time, time with your family, time with your friends, the little time that we do have on earth and what we do with that. It was somehow sold to us through a Gucci bag or something\n\nTime is the only luxury. It’s the only thing you can’t get back. If you lose your luggage – I’m not gonna say the obvious brand of luggage that I’d normally say because I’ve got a meeting with them soon – if you lose your expensive luggage at the airport, you can get that back. You can’t get the time back\n\nIt feels like people do everything in life to get this BMW, this Benz, to get this townhome, to get 2.5 kids exactly. One of them has to be small, y’know!\n\nAnd you’re looking for this moment where you sit in your BMW after all the work you’ve done and all the accolades you get, and you somehow think you’re gonna get that level of joy that my daughter had when she received those wolves. And when you’re sitting in traffic in your BMW, it’s something that feels empty. To everyone who reaches that point. This concept of the selfish human, this idea of separation by race, or gender, or religion, or age, or my favourite thing to hate, class\n\nPeople say it takes a village to raise a child. People ask me how my daughter is doing. She’s only doing good if your daughter’s doing good. We’re all one family\n\nWe have the ability to approach our race like ants, or we have the ability to approach our race like crabs\n\nThis is a generation that is far less racist – yes, small remnants remain of even thinking of calling something of a racial slur\n\nWhite people that listen to rap say ‘nigger’…in the privacy of their own home\n\nThat idea [racism], has passed. We’ve had The Cosby Show, Obama’s president, Beyonce’s great…that’s passed. But there’s still something you’re taught every day, especially in the UK, and that’s division by class. Our main focus, in my opinion…Imagine a world with no war, and imagine if everyone’s main focus, more so than going out to a club, their main focus was to help someone else\n\nI was joking with an interviewer earlier today…people talk about the number of viewers the Brits get, or the number of viewers the Grammys get. They need to do award shows for the Nobel Peace Prize, but I guess that doesn’t sell as many MasterCard commercials. Oh, I mentioned a brand! [looks disappointed]…I had two things…I was trying to get a flawless victory on my speech! No offence to MasterCard…but that was a big fucking logo in the middle!\n\nYou guys have been taught, without you knowing, ways to separate yourselves from each other. If you’re separated, you can be easily controlled. If you’re too busy pointing fingers at each other, rather than holding hands, you can’t get anything done\n\nYou know, Chris Rock called my album My Beautiful Dark Twisted Fantasy…well, Chris Rock and everyone else at every single media publication called My Beautiful Dark Twisted Fantasy the best album of the last 25 years. This only came through collaboration\n\nOne of the most memorable things about MBDTF was Nicki Minaj, and the fact that she kicked my ass, on my own song, on one of the best albums…the best album – I’m just saying what the critics said – of the last 25 years. The best album of the past 25 years that I spent a year and a half making, out there. I was exiled from my country, it was a personal exile, but exile. To come back and deliver my magnum opus of a work, and to be outshined…to be beat by a girl, basically\n\nThis was necessary. I think it was one of the most important points of working on that album, was to not stop her from her moment because of how good she is. Just think of a comparison, if you think about why did it take so long for the new Yeezys to come out? Why did I have to leave one group and go to another group? Why did that group not want to speak to me? I think the Yeezys I was doing over there were comparable to that Nicki Minaj verse. Because these guys were like ‘we’re worrying about this shoe, we’re gonna put it on this celebrity’. And the head’s son would come and say ‘my favourite shoe is the Yeezy’. And it’s like ‘ahhh, I can’t hear about these YEEZYS anymore!’. Like everyone talking about Nicki’s verse, ‘I can’t hear about this verse anymore!’. It was gonna work for her anyway, but let’s just say that in some way in helped give her exposure. She was able to go on and become a successful, and fly, and run, and dream, and provide. And it was not locked because of my career\n\nOne of my biggest Achilles heels has been my ego. And if I, Kanye West, the very person, can remove my ego, I think there’s hope for everyone\n\nWhen I talk about collaboration and the creative process, the best idea wins\n\nI’m proud of the consistency of the performances I’ve done since I’ve been out here. And it comes from four would-be egomaniacs coming out and being forced to work together. The best lighting guy on the planet, the best staging guy, the best video guy, another staging guy, a guy with a laptop for no reason…To be able to deliver, back to back to back, extremely successful, inspiring, groundbreaking, visual, visceral, creative moments that otherwise would have been challenged. And the kid from Chicago screaming from the top of the stage for 40 minutes in a row. I’ve had to pull that card out a few times. Not particularly screaming, but remember, I will scream\n\nMy momma taught me that if I was in a grocery store and I’m by myself and a stranger grabbed my hand, scream at the top of your fucking lungs. If I’m at an awards show and a stranger grabs my hand and they say so we’re going to use these moving lights, or we’re gonna play the music right now before we define the look, or we’re gonna cut the TV cameras in a traditional way. I’ll scream at the top of my fucking lungs\n\nPeople say I have a bad reputation. I think I’ve got the best reputation in the building. They want you to have a reputation of tucking your black nail polish into your pockets and sitting in the corner of the class, and not fighting for your ideas out of fear of being ridiculed\n\nThat’s one of my favourite ones…to be called crazy\n\nI remember when I was young and saw my dad working on computers. And the guy he was working with ended up being a bad guy. And the guys that helped him, that he had the voice to find, didn’t have the same motivation, a high enough skill set to match up to his vision, to his dream, for it to be considered to be a success. But the success is that his successor will be successful in his lifetime. You could say \"But you are successful?\" i’m successful in learning about the beauty that is afforded to rich people. But in learning that, being brought up, middle class, it’s something that is beating out of my chest. ‘Wait a second, I was middle class, and I didn’t get to see none of this shit!’\n\nLet’s have an NBC telethon moment, and say that beauty has been stolen from the people and is being sold back to them under the concept of luxury!\n\nIt’s illegal to not wear clothes, and also possibly too cold. That means someone is imposing an idea on you that should legally have to do! Clothing should be like food. There should never be a $5000 sweater. You know what should cost $5000? A car should be $5000. And you know who should work on the car? The people that work on the $500,000 cars. All the best talent in the world needs to work for the people. And I am so fucking serious about this concept that I will stand in front of anyone and fight for it. Because I was 14 and middle class. I know what it felt like to not get what I have\n\nPeople say to me ‘you’re successful, what are you crying about?’. I’m crying about the people. I’m crying about their daughters. Our daughters, as one family. What good is it? What good is anything that everyone can’t have? Every ism. They think we’re done with racism. What about elitism, what about separatism, what about classism? That’s all", "image": "https://images.rapgenius.com/e6490c4f47f4a41ea345d3609d29d4c2.800x495x1.jpg"}], "artist": "Kanye West"}