{"songs": [{"title": "Hunnid Stax", "album": "These Days…", "year": "2014-06-24", "lyrics": "[Produced by Kenny Beats]\n\n[Intro: Ab-Soul]\n(Money is the anthem)\nPeople treat you real nice when you got fifty dollar drawers on\n(Get money, fuck bitches)\nI'm tryin' man\n(Fuck bitches, get money, get money)\n\n[Verse 1: Ab-Soul]\nWho gettin' that dough? Who gettin' that cake?\nWho gettin' that bread?\nPut a ticket on your head if you can't relate\nWho gettin' that fetti? Who gettin' that cheese?\nYou know I gotta eat, you know I gotta eat\nWho gettin' that paper? Who gettin' that guap?\nWho smokin' that top shelf? Who gettin' top off top?\nAin't nothing more important than the mula\nWho gettin' them commas, makin' mommas do kama sutra\nBest act like you know\nI'm gettin' them checks, I'm spendin' them checks\nTHC through TSA, hope my bag don't get checked\nWho gettin' them Benjamins? Spendin' them with executives\nBusiness man, understand, I'm on fuckin' tour, you on the 10-6\nI'm reelin' in, currency, won't pass the weed but I'll pass a bitch\nMy stock risin', you cock ridin', I'm splittin' clits with a money clip\nWho gettin' that money? Real mothafuckin' money\nThat's all I do dawg, got cashed out\nGot fucked up, then I passed out\n\n[Hook: Mac Miller]\nWoke up early, kissed this bad bitch\nRolled me up a blunt, then I took a piss\nCan't remember what I did last night\nI'm just tryna spend a hunnid stax everyday of my life\nMoney is the anthem\nBlack girls in the bedroom, white girls in the bathroom\nFuck what I did last night\nI'm just tryna spend a hunnid stax everyday of my life\n\n[Verse 2: Schoolboy Q]\nWho gettin' that dough? Who gettin' that bread? (Yeah!)\nGet money I pledge\nWhat you mean you broke? Bitch, open them legs\nNow let a nigga beat, I think I'm gonna skeet\nYou know I love cheeks, you know I love cheeks\nI'm high as a scraper, I'm smokin' that guap\nWho leave guns on the top shelf? Who keep Glocks on Glocks?\nAin't nothing more important than the Hoover\nWho hoppin' out cars?\nUnloadin' that pop-pop, YAWK-YAWK, move ya!\nFig-Fig-Figueroa, gotta a .45 right here up in my coat\nYou can have my ho but don't hit my dope, yes\nI'm burnin' up like a Parliament, I'm 216, I'm suspendin' rent\nYou a bad bitch, come fuck me\nYeah, you heard it right, I said fuck me\nPut that on Crip, even ignorance is bliss\nI love foreign tits and her clitoris\nBeat the pussy down like my nemesis\nMake the pussy drip like I slit her wrist, but\nWho gettin' that money? Real mothafuckin' money\nThat's all I do dawg, got cashed out\nBought a new bitch and a new house like\n\n[Hook: Mac Miller]\nWoke up early, kissed this bad bitch\nRolled me up a blunt, then I took a piss\nCan't remember what I did last night\nI'm just tryna spend a hunnid stax everyday of my life\nMoney is the anthem\nBlack girls in the bedroom, white girls in the bathroom\nFuck what I did last night\nI'm just tryna spend a hunnid stax everyday of my life\n\n[Outro]\nSo before we go out, what's your address?\n\n[Outro 2: Puff Daddy]\nWhat? It ain't no more to it!\nSoulo eatin' now! Tell 'em Puff said so", "image": "https://images.genius.com/077bbd628ad3b7383f095afde8670b76.560x560x1.jpg"}], "artist": "Ab-Soul"}