{"songs": [{"title": "And He Gets the Girl", "album": null, "year": "2006-08-08", "lyrics": "[Intro]\nHold it now!\nYou just walk up to her and say hi\nThat's all you gotta do\nSay hi\nThat's all you gotta do\nSay hi\n\n[Verse 1]\nWell I know I'm not the coolest\nAnd this might sound kind of foolish\nCause I know I'm not the smoothest, told myself I shouldn't do this\nCause I'm not very well-suited, not the popular-est of students\nWe ain't in the same crowd, always see you with the hoopers\nBut we got the same lunch, you might see me with the cooler\nThat's cause I don't eat pork, you can never be sure of\nOh, you like Linkin Park? That's the hat from the tour\nI got an autographed shirt, they wrote, \"much love 2 ya\"\nMan that's really funny how we like the same music\nBut I really love jazz, I was gonna play the tuba\nI tried to join the band, they said I was really, really bad\nDidn't really make me sad, I'm used to being the loser\nBut you, I think you're super, so much, I had to pursue ya\nI don't believe the things they say or the football team's rumors\nThe quarterback can't spell, I'm his after-school tutor\nI just took a cue from Cupid, but, now I think it's stupid\nI'm-I'm sorry\nAnd then I walked away\nThinkin' that she would never talk to me\nLike what were you thinking bringing up the band\nWould have got a better result\nIf would have just beat her up and ran\nYou shouldn't have worn your glasses\nTake your shirt up out your pants\nSee now it's all over and you won't get another chance\nDamn, I was so close to her, then I felt a hand on my shoulder\n\n[Verse 2]\nShe said, \"I know you're not the coolest\nBut I swear you are the cutest\nAnd I know you played the tuba, I seen you at the recital\nIt takes a lot to get up there and embarrass yourself\nBut you shouldn't put down, you should merit yourself\nThat just mean you not a punk, I like Thelonious Monk\nHe's the wallpaper on my computer\nI love Final Fantasy, I hate first person shooters (me too)\n\"Meteora\" was nice but I bought \"Hybrid Theory\" twice\nHalf of the cheerleading squad is in a stupor\nThe only reason I do it is 'cause my mother took state\nWhen she was a junior\nAnd she want me to do the same, so I'm like, naww\nI wanna be an oncologist and diagnose tumors\nI got a a pet parrot, his name is 'Mr. Tuna'\nMy favorite food is fish, remember that for the future\nMy IM name is missluna, you can hit me after six\"\n\n[Interlude]\nHow you feelin' right now?\nYes yes yes yes yes yes\nCome, Seymour, we have things to do!\n(How you feeling right now?)\nAnd just like everything in life\nThings grow, People grow\nAnd people grow apart\nIt's like some things were just never meant to be\nYou see?\nBut, then again\nMaybe\nSome things are\n\n[Verse 3]\nYou know today gonna be the coolest\nAnd you know how far your school is\nKnow how dangerous the flu is, so button up your coat\nAnd finish off your breakfast, you know how important fuel is\nFood is to human as buoyancy's to boat\nI knew this, everyday we gotta go through this\nAnd I ask why you quote, cuz I'm your father Lucas\nPop, last night I was lookin over the futures\nCommodities is felon, rental properties is sellin\nThe bio tech market share is at its hugest\nI think we should ride this wave, we can't re-invent the Rubik's\nWoah, we should of played her more music\nLucas, dear, why is your bookbag full of tulips\n\n[Outro]\nUmm, well Ma, you see there's this girl, you know\nAnd I was thinking that I may walk to her, you know\nTry and talk to her\nDiscuss different things that were taught to her\nAnd see what makes her tick\nYou know? You know Mama?", "image": "https://images.genius.com/b67b7f5bfbd7eb8c5c334fa8b05a2432.400x400x1.jpg"}], "artist": "Lupe Fiasco"}