{"songs": [{"title": "Domestic Violence", "album": "Bobby Digital in Stereo", "year": "1998-11-24", "lyrics": "[Intro: Tiffany]\nYou ain't shit, your daddy ain't shit\nYour brother ain't shit, your money ain't shit\nYour lab ain't shit, your rings ain't shit\nYour gear ain't shit, your jewels ain't shit\nYour kicks ain't shit, nigga, your whips ain't shit\nBobby, you ain't shit, nigga I'm the shit\nYou ain't shit, your daddy ain't shit\nYour brother ain't shit, your money ain't shit\nYour lab ain't shit, your rings ain't shit\nYour gear ain't shit, your jewels ain't shit\nYour kicks ain't shit, your whips ain't shit\nBobby, you ain't shit, nigga I'm the shit\nYou ain't shit, your daddy ain't shit\nYour brother ain't shit, your money ain't shit\nYour lab ain't shit, Bobby you ain't shit\nYour rings ain't shit, your gear ain't shit\nYour jewels ain't shit, your kicks ain't shit\nYour whips ain't shit, nigga, I'm the shit\nYou ain't shit, your daddy ain't shit\nYour brother ain't shit, your money ain't shit\nYour lab ain't shit, your rings ain't shit\nYour gear ain't shit, your jewels ain't shit\nYour kicks ain't shit, your whips ain't shit\nNigga, I'm the shit...\n\n[Verse 1: RZA (Jamie Sommers)]\nWhat the fuck y'all birds talking about?\nGet the fuck out my house\n'Fore I grab you by your hair and slap dick to your mouth\nBob Digi, yeah, you know who is he\nGirl, I fucking slave trade your ass like Kizzy Kinte\n(But wait, fuck you motherfucker)\nYou wish you could fuck\nBitch, all you can do is dick suck\n(Your ass can't fuck, that's why your wife left your monkey ass)\nFuck that, you don't cook, you don't clean, or press my jeans\nYou don't scrub or wash clothes\nOr buy food or make cream in this bitch\nYou don't read to the seeds\nAll you do is watch TV and smoke weed\nGet your nails done and feet, scrub the hair-weave\nSleep all day, eat, gain weight, can't breathe\nTalking about you're going to leave?\nThen bitch leave! What the fuck you're waiting for?\nHit the door, I ain't taking this shit no more!\nSpending all my cream on Gucci, Phillies and Coach\nBefore you moved to my lab, bitch, I ain't never seen a roach\nStains on my carpet, bathroom's more like a fish market\nTake all the space in my closet, where the fuck's your logic?\nDisrespecting my old earth, aborted my child birth\nAnd every day I catch my credit card inside your purse\nYou can't speak a sentence without a curse\nTalking 'bout you're going to be a nurse\nBitch, to be a nurse you got to go to school first!\nWhen I first met you, you was a ho\nI tried to reform you, bomb you, warn you and teach you\nBut couldn't reach you, and you're still a ho\nYour father said you was a ho\nAnd when you leave me, bitch, you're gonna be a ho\nCellulite and gargoyle feet, I'd rather beat my meat\nThat raggy ass pussy a starving dog wouldn't eat\nStarted with the body of a model\nPussy tight as a pharmaceutical bottle\nAnd you could swallow a whole avocado\nAnd two forty ounce bottles\nTo the end of the world, which to I would follow\nNow, when I fuck you, the shit echos cause you pussy is so hollow\nTurn your fat ass sideways\nYour stretch marks look like the US highways\nFuck a new nigga every Friday\nTalking 'bout bust a nut, bitch I'll bust yo guts!\n(You come so quick, nigga)\nWonder why I come so quick?\nWith that wide ass pussy and soggy tits?\nI'm trying to get the shit over with, and go to sleep!\nBut when I'm with my real freak on the weekend\nBet that baby we fuck for two and a half hours to three\nYou'd better study the 1-14 knowledge culture degree\nAbout M-G-T, and G-C-C\n\n[Interlude]\nCause you ain't shit, and your mother ain't shit\nAnd your sister ain't shit, and your pussy ain't shit\nThat weave ain't shit, your ass ain't shit\nGirl you ain't shit, your daddy ain't shit\n\n[Outro: RZA (Jamie Sommers)]\nBut fuck it, yo, let me get this fucking phone\n(Yeah, get the motherfucking phone\nQuit motherfuckers in our fucking\nBusiness. End the fuck, or I'll pull\nThe motherfucking chord out of the\nMan, fuck that motherfucking socket\nYo God, this bitch is bugging I'm sick of this shit motherfucker\nGet the fuck out, I'm throwing\nAll the shit on the motherfucking\nTerrace, right now. I'm sick of)\nI'm on the phone! this shit, you and you shit out the\nI'm on the phone! motherfucking closet right now. My\nWell fuck you! name's on the motherfucking [?] too\n(Bitch, get the fuck out my nigga, I don't give a fuck, fuck that\nHouse man shit, you get the fuck out my lab, all\nThese motherfuckers sleeping in the\nFucking living room. My seeds run into\nThese motherfuckers, these niggas are)\nYo, hey Hewey, hey Hewey in their dirty motherfucking socks and\nFuck you, yo God, my bitch... shit. (Fucking dirty toilet seats and\nThis bitch is stupid man shit. My seeds gotta sit on this shit\nGet these motherfuckers out this\nGive this fucking crab ass motherfucking lab now.) Get the fuck\nGirl the gas yo out. (Every lat one of y'all mother-\nYou's a ho bitch! fuckers. Get the fuck out my lab)\nCome on you's a ho!\nYou'se a ho Motherfucker don't make me pick up\nYou'se a ho this bottle. Don't make me pick up\nYou'se a ho this motherfucking bottle\nYou'se a ho\nHo! ho!\nHo! ho! (Bastard! bastard!)\nHo! ho! (Bastard!)\nFuck you!\nHo! (You fucking bastard!)\nHo! (Bastard! Bastard!)\nFuck you\nYo, yo, dunn, yo, yo, God\n(Bastard! Bastard! Bastard!\nShe's stupid dunn you're fucking dirty dick nigga\nYeah you're fucking stupid nigga\nYou're fucking stupid\nYou're fucking stupid)\nCall me back son (Now that's right, tell that motherfucker to call you back)\nCall me back\n(Cause you ain't going to steal this motherfucking phone)", "image": "https://images.genius.com/10f833f6fa5be4455d32a441346e0086.431x431x1.jpg"}], "artist": "RZA"}