{"songs": [{"title": "911", "album": null, "year": "2018-06-30", "lyrics": "[Chorus]\nYeah, she do coke while I sip codeine\nRap game, crack game, serve it to the dope fiend\nShe like court side, still catchin' nosebleed\n9-1-1, this bitch 'bout to OD\nPassed out on my couch, someone take her out\nMedics in n' out, tellin' her \"breathe in n' out\"\nNeighbors nosier than a bitch, askin' me what this about?\nShorty took too many drugs, tryna overdose for clout\n\n[Verse 1]\nMolly on her tongue got her goin' dumb\nShe older than me, she know that I'm young, but I'm not young and dumb\nFuck a bitch, get a bitch sprung\nPull up on a scene, they run\nI pull out my gun, heater on me\nKinda like the sun, bitch I'm not the one\nFuck wit me, choppa give you smoke like a chimney\nJiminy Cricket, how they jumpin' on my wave, bih'\nIt's crazy, now I'm makin' money on a daily\nI'd be hatin' on me too, if I wasn't gettin' paid\nI'd be hatin' on me too, if I wasn't gettin' laid (uh)\nOn a daily basis, on a daily basis\nPresidential brain from your main, Sarah Palin\nTryna judge a nigga, you don't even got a bailiff\n\n[Chorus]\nShe do coke while I sip codeine\nRap game, crack game, serve it to the dope fiend\nShe like court side, still catchin' nosebleed\n9-1-1, this bitch 'bout to OD\nPassed out on my couch, someone take her out\nMedics in and out, tellin' her \"breathe in and out\"\nNeighbors nosier than a bitch, askin' me \"what this about?\"\nShorty took too many drugs, tryna overdose for clout\n\n[Instrumental break]\n\n[Chorus]\nShe do coke while I sip codeine\nRap game, crack game, serve it to the dope fiend\nShe like court side, still catchin' nosebleed\n9-1-1, this bitch boutta OD\nPassed out on my couch, someone take her out\nMedics in and out, tellin' her \"breathe in and out\"\nNeighbors nosier than a bitch, askin' me \"what this about?\"\nShorty took too many drugs, tryna overdose for clout", "image": "https://images.genius.com/1ff8ab8d3ae5bb47f0797a87d42ddf66.1000x1000x1.jpg"}], "artist": "Juice WRLD"}