{"songs": [{"title": "Flexed Up", "album": "Who You Mad At? Me Or Yourself?", "year": "2013-04-18", "lyrics": "[Hook]\nThey came to doubt us with my mess, and you the fool\nYou tryina post a VIP my nigga, who was you\nValet my shit, I rock that shit, I rock that fucking spot\nSee these jewels, snatch your bitch up in the parking lot\nIm flexing, Im flexing, Im flexing, Im flexing\nSee these jewels, snatch your bitch up in the parking lot\nIm flexing, Im flexing, Im flexing, Im flexing\nSee these jewels, snatch your bitch up in the parking lot\n\n[Verse 1]\nAnybody looking for the old me? Go down for my old shit\nComing at a nigga with a sneak diss, might as well put it out in the open\nIt ain't about the price tag, this why I never look at the price tag\nNothing going on and on, but I am killing this shit, but nigga, warp brain\nAll I hear is loud picks, all I see is satellites\nI dont trust these hoes, no, not even in my afterlife\nNo love for the bloodsuckers tryina snatch a piece, they tryina grab a bite\nWho wouldve guessed this type of life would generate this much of an appetite?\nLife is a 8 count so Im always ahead about two steps\nAnd to this day I still ain't seen a nigga coming close to what I do yet\nThats why she choosing up, she tooted up like a true vet\nAnd she down for the crew, she giving that crew name\n\n[Hook]\nThey came to doubt us with my mess, and you the fool\nYou tryina post a VIP my nigga, who was you\nValet my shit, I rock that shit, I rock that fucking spot\nSee these jewels, snatch your bitch up in the parking lot\nIm flexing, Im flexing, Im flexing, Im flexing\nSee these jewels, snatch your bitch up in the parking lot\nIm flexing, Im flexing, Im flexing, Im flexing\nSee these jewels, snatch your bitch up in the parking lot\n\n[Verse 2]\nThese impostors deserve an Oscar\nThey know Im sick, flow is nauseous, I need a doctor\nIf she do it proper she on the rising\nBut I just ain't saving hoes, Im no Kevin Costner\nYou looking for me? You know where Im at\nIm up at the suite, party of three\nThe ball 23 but one of the greatest arguably\nYou hear what I hear? The stocks went up so pardon the fee\nDont get it twisted, how can I change?\nIm still the same nigga, just harder to reach\nIm self-made and Im certified, flexed up like Im working out\nI spit flames its Kirby time Im so fly I might burn alive\nIn her hair like curling iron, she grip that wood like turpentine\nI asked her what that mouth do then she verbalized\n\n[Hook]\nThey came to doubt us with my mess, and you the fool\nYou tryina post a VIP my nigga, who was you\nValet my shit, I rock that shit, I rock that fucking spot\nSee these jewels, snatch your bitch up in the parking lot\nIm flexing, Im flexing, Im flexing, Im flexing\nSee these jewels, snatch your bitch up in the parking lot\nIm flexing, Im flexing, Im flexing, Im flexing\nSee these jewels, snatch your bitch up in the parking lot", "image": "https://images.genius.com/43cf4f7fb829f88b270853d2534b8f0f.1000x1000x1.jpg"}], "artist": "B.o.B"}