{"songs": [{"title": "The Last Stretch", "album": null, "year": null, "lyrics": "[Intro]\n(Coast to Coast Instrumentals)\nI don't know what the hell that is\nShould have just called Puff for the fucking instrumental\nFuck it, no time for that boy!\nCole World\n\n[Verse 1]\nThey say we living in troubled times\nAye, do you see the trouble signs?\nAye, lifes a bitch, and I'm cuffing mines\nMy dough in flipmode, what up to Busta Rhymes\nI used to never see green, I was colorblind\nNow I get my hustle on\nPay dues like a hair salon\nMy way like a Usher song\nHigher power where these verses from\nYou niggas hoes, put your purses on\nChurch, get your worship on\nBorn alone, work alone, die alone\nHot fire like Dylan\nBitches get their dial on\nFake niggas get dial tones\nI ain't no Viacom nigga\nI'm a fire arm, nigga\nLook how I alarm niggas\nWatch my dope pile on\n'Til it's like a mile long\nNiggas couldn't fill my shoes\nCouldn't even try 'em on\nShowed your lil' ass look\nThat's how you take it\nTwo-facing niggas, couldn't tie my shoe laces, boy!\n\n[Verse 2]\nThat was the warm up, this is the blow up\nNow if you ain't talking no bread boy, ain't no need to show up\nMan they say I'm repping the Ville too much, but fuck it, so what?\nWhen my niggas carrying toys like they don't wanna grow up\nWhen my sisters drinking like fishes and won't even throw up\nLet's po' up, get to' up, know the police gon' show up\nI slow up\nSome niggas ain't got no luck\nSome niggas can't get no love\nSome of 'em can't get no bucks\nSo tell me what do a nigga do if he can't get a job?\nMy brother got him an interview, but he can't get a ride\nWhat's up God?\nNo this ain't no Wu-Tang shit\nThis is my lil' fire drill, just some routine shit\nJust to shoot fiends with\nAnd hold 'em off a lil' longer\nEvery verse I write I swear I'm only getting stronger\nCan you ponder?\nImagine what my shit gon' sound like\nIf I told you that The Warm Up was just a sound bite\nDamn right, believe I put it down right\nAnd I'll be sure to tell you lil' niggas what that crown like\nI showed you love, I brought you through\nI gave you pounds right?\nAye, in my face, you knew your place\nAnd so you smile right?\nSo why I'm here, and now you talking like a little girl?\nYou sound like Whitley, nigga\nMe? I'm from a different world\nYour shit is garbage\nIf I drop you, I'm a litterbug\nBusy getting money\nI ain't fucking with that Twitter, girl\nFuck what they say, wishing me harm and sorrow\nThey here today, bet they be gone tomorrow\nThey catching Z's on me, aye we gon' call 'em Zorro\nI'll let you sleep today, but it's on tomorrow\nYeah, I said it's on tomorrow\nI'm coming for the game\nAnd I ain't talking loan or borrow\nPray for the days I get cash, checks and never weary\nThis the last stretch, I'm a half step from legendary", "image": "https://images.genius.com/2cd936e786e1ab454043327d585c7702.1000x1000x1.jpg"}], "artist": "J. Cole"}