{"songs": [{"title": "Press the Start Button", "album": "Theater of the Mind", "year": "2008-11-24", "lyrics": "[Intro]\nThis song is rated M for mature!\n\n[Hook: Ludacris]\nYeah, press the start button (woo!)\nTell these hoes to press the start button (what!)\nPunch in your code and press the start button\nAnd let the muh'fuckin games begin, biatch!\nFor any ONE of these flows just press the start button\nYea, tell my foes to press the start button\nFor a Ludacris show, just press the start button\nAnd let the muh'fuckin games begin, biatch!\n\n[Ludacris]\nHey, look here\nPicture perfect, I paint a perfect picture\nEyes low cause Igloo done rolled the perfect swisha\nHit you with the weaponry, tell your soldiers to back down\nI'm Raw like W.E., you'll get SmackDown!\nHow you want it? I'll clobber my opponents like Blanka\nBoy, you Street Fightin with a monster\nA-Town mobster, blowin smoke like rastas\nPullin out guns like in Contra, mo' toys than Tonka\nI'm a fuckin problem, rob 'em\nIt's Grand Theft Auto, his burner's right beside him\nHollow points headed to your dome\nHollow points headed to your home\nYour head of lettuce shredded from the chrome\nIt's ludicrous, parents think I'm a weirdo\nI'm a God of War, you a Guitar Hero\nSo let's box like Tyson, you'll get Punched Out\nWelcome to Luda's world, now bring the blunts out!\nHahhhhh!\n\n[Hook] w/ ad libs\n\n[Ludacris]\nI'm Liver than NBA, Luda's Super like Mario\nThat Playstation 4 shit, you older than Atari ho!\nFlows that'll make MC's Go! like Diego\nCall me the Master Chief, my life is like Halo\nFightin off haters, I'm the best, ask Khaled\nI'm at the Call of Duty, plus my Metal Gear is Solid\nMy Resident is Evil, full of Southside riders\nI hope you're packed, man, I got six Virtua Fighters\nThat'll blitz ya like Madden '09\nOr hit you with the Mac and .49s\nThen later sit back and blow pine\nLike it's somethin to do, it ain't pretty\nThe Final Fantasy, they think they live in SimCity\nBut I'm a MechWarrior, try me and I'll damage ya\nHoldin a Soul Calibur, or shoot you like Galaga\nAnd my Creed Assassins ya, so clear the room\nBefore the shotgun helps you meet your Ultimate Doom, boyyyyy\n\n[Hook] w/ ad libs\n\n[Ludacris]\nWhether 25 thousand or 25 mil'\nSurvival of the fittest, either kill or be killed\nGet ya game on playa, get ya game on (what?!)\nGet ya game on playa, get ya game on\nDoesn't matter if it's 25 bricks or it's 25 bucks\nSurvival of the fittest, either stick or get stuck\nGet ya game on playa, get ya game on (what?!)\nGet ya game on playa, get ya game on\nHEYYYY!\n\n[Hook] w/ ad libs", "image": "https://images.genius.com/abff9ac1df466053c5fe1b6b3c92056f.1000x1000x1.jpg"}], "artist": "Ludacris"}