{"songs": [{"title": "She Needs Me (Remix)", "album": "Overly Dedicated", "year": "2010-09-14", "lyrics": "[Intro: Female]\nI miss you (I miss you, I miss you)\nWhere you been? (Where you been?)\nIt's been months and I haven't heard from you, I need you\nIt's been months and I haven't heard from you, come back to me\nCome back, I need you in my life (Come back)\nI miss you, I miss you, come back to me, I miss you\n\n[Verse 1: Dom Kennedy]\nWhat's up baby? (What's up baby?)\nIt's been a while (Been a while)\nYou been good? (Been good?)\nI've been around (Uh)\nDifferent girls (Where?)\nDifferent towns (Yeah)\nTo keep it real (Keep it real)\nYou missing out (Uh)\nI’m on board, next city (Onboard, next city)\nRandom call, text with me (Random call, uh)\nLike, I miss you so much, have sex with me\nNot right now, look you know I got the ex with me\nShe like fuck that (Fuck that)\nI don't care Dom (Care Dom)\nSo selfish and that really isn't fair Dom (Fair Dom)\nMeet me here, where Dom? (Meet me here, where Dom?)\nGet undressed, yeah Dom (Uh)\nYeah Dom, what you need?\nSome bomb head? A bag of weed? (Bomb head, yeah)\nGood food? Japanese? (Yeah, yeah)\nThat's me on page forty in that magazine\n“Dom Kennedy” you need that\nShe said nobody come close, I agreed back (Uh)\nI'm the nigga who used to help her pull that weave back (Yeah)\nAnd she need me, believe that (Yeah)\n\n[Chorus: JaVonte]\nThat girl is smoking\nAnd can you believe that I'm her focus?\nIt ain't hard to see she got me open\nAnd together, we are roller-coasting, on, on, on\n\n[Verse 2: Kendrick Lamar]\nWhat's up love? (What's up love?)\nIt's been a while (Been a while)\nYou been good? (Been good?)\nI've been around (Uh-huh)\nRemember dinner dates I was late? Mr. Chows (Uh-huh)\nTruant like a student, you the principal (Alright)\nSchooled me on timing, we was both shining (Alright, alright)\nLike the sun bouncing off the brightest blood diamond (True)\nI was Your Highness, you was my queen (Uh-huh, uh-huh)\nYou got over him when I got in between\nWatching Martin on TBS as it was tedious\nFor us to eat TV dinners every time we was famished\nBut it was such a pleasure to watch you try to hold it together\nEvery time I put the head in you would panic\nAnd come right down like an avalanche\nMake your legs slant, whisper till you juicing up your pants\nBaby how that sound? Kosher, no sir\nWake it back up, Folger's holsters\nBy my waistline, shot for your heart and\nYou called it a hate crime, say you want me back\nAnd your girl wanna date Dom, that's high school shit\n4-0-1 K, we could be friends with benefits, you dig that?\n\n[Chorus: JaVonte]\nThat girl is smoking\nAnd can you believe that I'm her focus?\nIt ain't hard to see she got me open\nAnd together, we are roller-coasting, on, on, on\n\n[Verse 3: MURS]\nI upped and walked out, now she crying 'cause\nShe need me, I got that Jon Brion love\nHad to find love, we called it punch-drunk\nWe was a two-piece, she was a one-punch\nYou know, a knock-out, and if she was to walk out\nMy heart would go black, shrivel up and drop out\nThere we go again, what the fuck you talking 'bout?\nWe used to fuck all the time back at my momma's house\nSmoking beedies, laying on the futon\nMemories I got saved up like a coupon\nAnd we'd be too gone off a sack of stress weed\nI was broke then, couldn't cop the best weed\nThen she would just leave in a black hatchback\nHomies from the hood used to ask me if I'd tapped that\nI would say “Yep”, smiling so freely\nThat was back then, but I bet she still need me\nShe need me, she need me\nShe need me, she need me\nI would say “Yes”, smiling so freely\nThat was back then, I bet she still need me\n\n[Chorus: Javonte]\nThat girl is smoking\nAnd can you believe that I'm her focus?\nIt ain't hard to see she got me open\nAnd together, we are roller-coasting, on, on, on", "image": "https://images.genius.com/9e1efc6d0a7044dbf2f0776a12ed85b8.620x620x1.jpg"}], "artist": "Kendrick Lamar"}