{"songs": [{"title": "Pardon Me", "album": null, "year": "2017-04-04", "lyrics": "[Intro: Gucci Mane]\nDrop Top\nWizop\nWordplay\n\n[Verse 1: Gucci Mane]\nA nigga so fly that I should have been a pilot\nI know a nigga rap but I could have been a stylist\nFeel like a jeweler 'cause I rock so many diamonds (bling)\nCould never run for president, my past too violent\nFam so broke that I had to start grindin'\nWhy I'm lookin' bummy? Everybody else shinin'\nTurned into a burglar and did a couple break-ins\nStarted as a corner boy, then turned into a kingpin\nWalkin' in Magic lookin' like I were El Chapo\nHot damn Gucci, that's a cold-blooded Hublot\nI can't even fuck with one hoe, I need two\nAnd you ain't gotta call hoe, I don't need you\nJumpin' out a car with no roof in a suit hoe\nWhat type of nigga do the shit that I do hoe?\nStarted as a group, but I'm so dope I went solo\nGet your ass knocked off and call it free promo\nChopper make a nigga back crack like Romo\nGucci go hard on a bitch, no homo\nPull up in an 18-wheeler, me dolo\nFeelin' like Sosa was born to move yayo\n\n[Chorus: Rocko]\nLife's about taking risks\nI told my baby pray for me, I'm tryna be all I can be\nPut my pants on just like you, so why you envy me?\nI'm just tryna be all I can be\nI'm tryna live out my dreams, if I offend you, pardon me\nI'm just tryna be all I can be\nI'm just tryna see all that I can see\nNever mind me, I'm tryna be all I can be\n\n[Verse 2: Rocko]\nAy, they wanna know, how does it feel to be a star?\nHow's it feel to ride around the house for your car?\nHow does it feel to not have to sell that raw?\nI'm told 'em I'm way more paranoid 'cause now they hate me more\nThey say, \"Rock, how does it feel to be last of a dying breed?\"\nYou pump life into these streets, they were in dying need\nOff that real shit, that softest, that uncut, that raw\nThat shit that they jam to everyday when they jump up\nThe law, the word, they meet me in the AM\nMy voice I bring the gate in, in the evenings, still beatin' me\nHit the club still playing, still playing when they leavin'\n(How does that make you feel?)\nIt feels good, they believe me\nThey receive me, I am how they perceive me\nI put my soul into these lyrics, listen, you will hear it\nBackseat Mulsanne, Drop Top and the Dawn\nWhere would the streets be without the Trap God and the don?\n\n[Chorus: Rocko]\nLife's about taking risks\nI told my baby pray for me, I'm tryna be all I can be\nPut my pants on just like you, so why you envy me?\nI'm just tryna be all I can be\nI'm tryna live out my dreams, if I offend you, pardon me\nI'm just tryna be all I can be\nI'm just tryna see all that I can see\nNever mind me, I'm tryna be all I can be\n\n[Verse 3: Gucci Mane]\nFuck your CEO and tell 'em King Gucci said that\nCause I ain't never ever hit a lick and brought the bread back\nThat's your CEO? We used to gamble for his contract\nI damn near lost his first three albums playin' blackjack\nStandin' in the trap, catchin' J's in my wavecap\nCappin' 'bout none of these niggas rappin' 'bout a fake trap\nCall Ghostbusters 'cause these niggas sellin' ghost crack\nPoint 'em to the kitchen and the nigga need a roll [?]\nPut me in the kitchen and I might just bring a whole back\nPut a hole in a nigga head, tell him \"hold that\"\nThis that eggbeater music, get it out the bowl rap\nThis that wife beater music, sell it while it wet rap\nYou a dick rider and I never will respect that\nCame out, took my set back, I know they didn't expect that\nGucci worth eight figures, but he tryna stretch that\nMy partner turned informer on me, I never woulda guessed that\n\n[Chorus: Rocko]\nLife's about taking risks\nI told my baby pray for me, I'm tryna be all I can be\nPut my pants on just like you, so why you envy me?\nI'm just tryna be all I can be\nI'm tryna live out my dreams, if I offend you, pardon me\nI'm just tryna be all I can be\nI'm just tryna see all that I can see\nNever mind me, I'm tryna be all I can be, ay", "image": "https://images.genius.com/0f38e15f50ef8cfe636348ba262a1ce9.500x500x1.jpg"}], "artist": "Gucci Mane"}