{"songs": [{"title": "One Beer", "album": "MM.. FOOD?", "year": "2004-11-16", "lyrics": "[Intro]\nI get no kick from champagne\nMere alcohol doesn't thrill me at all\nSo tell me why shouldn't it be true?\nI get a kick out of brew\n\n[Verse]\nThere's only one beer left\nRappers screaming all in our ears like we're deaf\nTempt me, do a number on the label\nEat up all they emcees and drink 'em under the table\nLike, \"It's on me—put it on my tab, kid\"\nHowever you get there, foot it, cab it, iron horse it\nYou're leaving on your face, forfeit\nI crush the mic, hold it like the heat, he might toss it\nTold him tell her they stole it, he told her he lost it\nShe told him, \"Get off it,\" and a bunch of other more shit\nGetting money, DT's be getting no new leads\nIt's like he eating watermelon, stay spitting new seeds\nIt's the weed, give me some of what he drooping off\nSoon as he wake up, choking like it was whooping cough\nThey group been soft\nFirst hour at the open bar and they're trooping off\nHe went to go laugh and get some head by the side road\nShe asked him autograph her derriere, read\n\"To Wide Load, this yard bird taste like fried toad turd\nLove, Villain.\" Take pride in code words\nCrooked eye mold nerd geek with a cold heart\nProbably still be speaking in rhymes as an old fart\nStudy how to eat to die by the pizza guy\nNo he's not too fly to skeet in a skeezer eye\nAnd squeeze her thigh, maybe give her curves a feel\nThe same way she feel it when he flow with nerves of steel\nThey call the super when they need their back, uhh, plumbing fixed\n\"How there only one left? The pack comes in six!\nWhatever happened to two and three?\"\nA herb tried to slide with four and five and got caught like, \"What you doing G?\nDon't make me have to get cutting like truancy\nMatter fact, not for nothing, right now, you and me!\"\nLooser than a pair of Adidas\nI hope you brought your spare tweeters, MC's sound like cheerleaders\nRapping and dancing like Red Head Kingpin\nDOOM came do his thing again, no matter who be blingin'\nHe do it for the smelly hubbies\nSeeds know what time it is like it's time for Tellie Tubbies\nFew can do it, even fewer can sell it\nTake it from the dude who wears mask like a 'tarded helmet\nHe plots shows like robberies\nIn and out, one, two, three, no bodies, please\nRun the cash and you won't get a wet sweatshirt\nThe mic is the shotty: nobody move, nobody get hurt\nBring heat like your boy done gone to war\nHe came in the door, and \"Everybody on the floor!\"\nA whole string of jobs like we on tour\nEvery night on the score, coming to your corner store\n\n[Skit]\nThere, it is done\nNow that the representative from South Africa has been mind programmed\nAll of the world leaders on earth are under my control\nAnd when they meet tomorrow in special session\nI, Doom, shall be voted: Master of the World\nMy plan is foolproof, but just in case\nAnd what about snow?\n\n[Skit 2]\nNow you keep your eyes open\nWhen I tell ya, start snappin' (Oh yeah, sure)\nUh, ladies and gentlemen\nI am risking my life to tell you with great concern that I must warn you\nI, I, you must listen\nMany among you, have, have, have their minds taken over\n(What a story, start snappin’)\nDOOM, gosh, I wish I’d brought my autograph book\n(Your attempts at humor bore me) Right lead head\nYou’re weird\nWhy is everyone staring at us?\n(Aw, I should have realized, we must look like freaks to them)\nRelax masseur, just do your thing\n(Get a good grip on my-)\nWhat? Why I’ll bend your read out meter for ya, you little\n(Knock it off, Ben)\nWhat’s the matter? (Oh, Ben)\nYou’re nothing but a chicken head\n(You overgrown granite head) Hold it\n\n[Produced by Madlib]", "image": "https://images.genius.com/f67af5eb94d7101171adfff4ca96a76c.1000x1000x1.jpg"}], "artist": "MF DOOM"}