{"songs": [{"title": "Whn the Lights Go Off", "album": "Redman Presents... Reggie", "year": "2010-12-07", "lyrics": "[Intro: Redman]\nUhh\nI'm ready, I'm ready.. (yeah!)\nI'm ready (what's up?)\nI'm ready (what's good?)\nI'm ready (you know I'm feelin real high)\nI'm ready..\nI'm ready (I'm ready)\nI'm ready (I'm good)\nI'm ready (let's go!)\n\n[Poo Bear]\nWhen the lights (lights) go off (go off)\nYou're feenin once you had a chance\nThat's why I (I) just (just) can't (can't) leave it alone\nOhh, ohh, ohh, ohh\n\n[Redman]\nGilla House niggas! Yo\nHip-Hop has been my callin, ever since that I was crawlin\nE. Sermon start recordin, 9-2 started ballin\nYeah, whoever woulda knew, a hot man like me survivin\nRecession may have you down, a boy like me keep on ridin\nI, I keep on ridin, New Jersey hold me down\nNo sense to blame Bin Laden, when the bomb right here in town\nY'all just didn't recognize, but I'm hopin now you know\nEverybody tellin lies but y'all gonna feel\n\n[Hook: Poo Bear] + (Redman)\nWhen the lights, go off\nYou're feenin once you had a chance\nThat's why I (yeah) just (yeah) can't, leave it alone\nOhh, ohh, ohh, ohh\n\n[Redman]\nLet's get it! Hey, yo\nSome rappers say they had it, I feel I'm gettin started\nGot a little bit of change in my hand, Obama's now in office\nSo \"no\" is not an option, my heart is pumpin hunger\nYour money's dial tone, got it? Wrong number!\nI, I need my paper, gotta keep my lights on\nI'm buildin somethin major, so I can count my acres (yes!)\nBetter recognize, hip-hop I love it mayne\nFor the music I will die and y'all gonna feel\n\n[Hook]\n\n[Redman]\nHa ha, yo\nMy boys said I done it, I told 'em I ain't finished\nMy skill's Bout It Bout It, but the money, +No Limit+\nGotta keep my nose in it, cause I plan to make a killin\nInstead of sittin 'round, tryin to whip, makin millions\nI, I love my job, I, I love my life\nIf, if God my witness, I feel I did it twice (yes!)\nBetter recognize, Reggie is goin forward\nBaby when I'm lock and loaded, y'all gonna feel\n\n[Hook] - 2X\n\n[Redman]\nAy, ay, ay, I'm, I'm ready\nI'm, I'm ready\nI'm, I'm ready (I'm ready)\nI'm, I'm ready\nI'm, I'm ready, can put the whole world in my hands\nYes sir, let me at you\nWhen the lights go out, and we got a plan\nI got one ready, can put the whole world in my hands\nIf that plan fails, I take another route\nI'm always ready, when the lights go out, out, out, out\nBelieve me I'm always ready\nWhen the lights go ow-ow-ow-ow-ow-ow-out, out, out\nBelieve me I'm always ready, when the lights go out, out\n\n[Hook]\n\n[Outro: Redman]\nWatch me, watch me, watch me (yes sir!)\nReggie Noble in the buildin\n(I'm ready, I'm ready, I'm ready, I'm ready)\nPoo Bear on the vocal chords, what's GOOD?\nKing David on the track, what's happenin my dude?\n(I'm ready, I'm ready, I'm ready, I'm ready)\nYeah, yeah, signin off 2025\n(I'm ready, I'm ready)\nWe love you, we love you\n(I'm ready, I'm ready, I'm ready, I'm ready)\n(I'm ready, I'm ready, I'm ready, I'm ready)", "image": "https://images.genius.com/4d4f1e8f8a259cccb95855c51037a514.600x600x1.jpg"}], "artist": "Redman"}