{"songs": [{"title": "Strictly For the Funk Lovers", "album": "The World is Yours", "year": "1993-08-17", "lyrics": "[Announcer]\nWelcome funk fans to Hot Spots\nI’m Sha-Ray Jones live here on Cullen Boulevard\nAnd everywhere I go, there’s shit everywhere\nDoo-doo chasers going buckwild\nI’m trying to find out the true meaning of a doo-doo chaser\n\n[RBX & (Jewell)]\nHahahaha, what’s up, niggas and bitches?\nI shouldn’t say bitches, that might offend some of you hoes\nWell, we gon’ do it something like this\nJust to see what you punk ass niggas is working with, yeah\nSo now you wanna get your cranium cracked\nBy talking that old ill shit niggas\nI’m giving out lumps by the pound, hahaha\nAnd you say you don’t believe fried ice cream is reality, nigga\nWould I like to you face to face?\nYou better ask some muthafuckin’ body, nigga\nNow I’ma ask you one muthafuckin’ time, just one thang:\nIs you or is you ain’t a doo-doo chaser?\nWait, wait, wait, let me say it one more time:\nIs you, huh, or is you ain’t a doo-doo chaser? Can hear I it?\n(Doo-doo chaser, that’s what your ass is, yeah, oh…)\n(Nothin’ but a doo-doo chaser, yeah…)\nFunk, nothin’ but pure funk\nI wanna hear you get funky\nYes, and this funk is straight from South Acres, hahaha\nWhat, you didn’t know, nigga?\nBack the fuck up, we working with a crucial brand here, word\nSo now I’m just gon’ sit back and meditate\nOr should I say have a wicked thought\nAbout taking some old punk ass nigga out for tryna criss-cross me, fool\nAnd I’m gon’ make you jump, hahahahaha, yeah, I’m gon’ make it jump\nHollow points all in that muthafuckin’ ass, nigga\nOh, you better ask some muthafuckin’ body, nigga\nAs if you didn’t know\nOh, and once again, I send this one here out to all the doo-doo chasers\nSo if you are a doo-doo chaser, let me see you chase the doo-doo, hahahaha\n(Nothin’ but a doo-doo chaser…)\nGoddamn, so now you wanna diss me, fool\nI guess I gotsta put in work (Put in work, baby)\nHaha, but it ain’t no thing\nHaven’t you ever heard of a killer? (Muthafuckin’ killer)\nNigga, hahahaha, yeah, that’s me, fool\nYou better back the fuck up\nSo now I’m going on a killing spree in South Acres with this nigga Brad\nGet your ass in the house, niggas, ‘cause it’s on\nAnd it’s on like Donkey Kong, hahahahaha\nI know you heard that saying before\nBut on the reals, really doe, I came to let you niggas know\nThat this one right here is only for the funk lovers, true funk lovers\nDig C.C., hahaha\nAnd once again, I commence with the anthem, the doo-doo chaser\nCan you, would you, could you, should you, chase the doo-doo?\nHahahaha…\n(Woo, hey, hey, yeah, doo-doo chasers\nYeah yeah yeah yeah yeah, doo-doo chasers\nI don’t give a fuck, hey, Scarface don’t give a fuck\nHey, RBX don’t give a fuck)\n\n[Announcer]\nSo there you have it, funk fans, the real definition of a doo-doo chaser\nThis is Sha-Ray Jones, signing off from Hot Spots\nAnd join us next week, chasing more doo-doo chasers\nI love you, and peace\n\n[Outro: Jewell]\nDoo-doo chasers, nothin’ but doo-doo chasers, yeah\nDoo-doo chasers, yeah\nDoo-doo, doo-doo, doo-doo, doo-doo…", "image": "https://images.genius.com/2c9d70007eb3a5b42d898b73f3ce76f0.936x936x1.jpg"}], "artist": "Scarface"}