{"songs": [{"title": "Dat’s Dat Shit", "album": null, "year": null, "lyrics": ", Young Zee)\n[Method Man]\nUh, get ya stank on\n[Radio voice]\nWWKYA, WE'RE KICKIN YOUR ASS!\n[Mally G/Jamal]\nMy receitals is worth ten titles\nI shit on wrote Bibles, if you don't like me I don't like you\nI liable to load the rifle, hit the roof and snipe you\nThe shit I spit damaging your vitals\nNobody ride through like my squad do\nGot all y'all players suicidal\nActin niggas, take two\nYou heard the news, I'ma break it to ya\nWe're here to headline the bill and\nFeaturing Funk Doc, Tical and the villain\nA mic murder for hire, ten grand a killin\nYo Funk Doc, pass the Glock, this bitch nigga grillin\nI make moves wit my big dog ?bounce?\nStaten Island to the Bricks for mo' chips and mo' pounds\nY'all know who really lockin this shit down\nWhen we rock it, don't we all stand out?\nY'all hazardarious, clear out\nGet ya ass out 'fore I tear it out\nAnd show you what I'm talkin 'bout\n\n[Chorus: Redman, Method Man (Young Zee)]\nYo get ya up and get ya high, ha!\nGet ya stoned and get ya wide\nDat's dat shit (like or not, niggas sleepin wit the fifth)\nDat's dat shit (like or not, bitches fightin over dick)\nAiyyo we get ya up and get ya high (yeah)\nGet ya stoned and get ya wide\nDat's dat shit (like or not, niggas sleepin wit the fifth)\nDat's dat shit (like or not, bitches fightin over dick)\n[Redman]\nI'm high-powered, the dog rott weiler\nChocolate thai showers got Doc cookin minute rice for five hours\nYou wet cowards, I'm live wire\nYa bitch ass probably wash ya hands wit Palmolive\nYo Bricks holler, I got the plan printed\nLoad it and it goes like summer jam tickets\nFam can't dig it, pop goes the wea-sel\nYou be hidin under your peacoat wit people\nI told cops, roll blocks, no props\nFo' pops, Hennesy back and we both shot\nThat's how we go out, are you the thug type?\nTo ride down like Hopper from a Bug Life?\nWatch the movie, haters tried to eye screw D\nYour beef in small claims court, Judge Judy\nWhen you and I meet up, the fight heat up\nBloody up ya wife beater then light weed up\n\n[Chorus]\n[Method Man]\nI melt wax, Cuban Link chain react\nBreezin through these tracks wit the highest of velocity\nPlay me like Monopoly\nPay me everytime you trespass on my property\nI'm Dick Dastardly, no use in cop blockin me\nSloppily, your woman on the stop-watch clockin me\nPossibly I rock well, somebody always watchin me\nLivin in the street life, my eyes seen atrocity\nUndress a kid properly\nWhen I keeps it movin that means there ain't no stoppin me\nConstant motivation, the god fiend bury kings\nProper education, Allah sees everything\nHow High, just another form of elevation\nThat's why I choose to build from the basement\nTwelve-thirty-one-ninety-nine, times are wastin\nMore these Hot Dog MC's next to Nathan\nAllah Math, break the phonograph in half\nPromoters on some bullshit, short wit Johhny cash\n(Dat's dat shit) They got snitches rattin on the click\n(Dat's dat shit) They got bitches fightin over dick\nWHERE THE LOVE AT, when you're young, broke and black\nIt's over there, in the ashtray, who got a match?\n\n[Chorus]\n[Young Zee]\nYeah yeah yeah, Young Zee got bitches fightin over dick\n[Redman]\nGet ya up and get ya high\nFunk Doc got bitches fightin over dick\n[Method Man]\nYeah yeah yeah yeah, Meth-Tical got bitches fightin over dick\n[Redman (Young Zee)]\nGet ya up and get ya high (All y'all stupid bitches keep fightin over dick)\nGet ya stoned and get ya wide\nGet ya up and get ya high (HIIIIIGH!)\nGet ya stoned and get ya wide wide (Yeah yeah)\nGet ya stoned and get ya high (Fightin over dick)\nGet ya stoned and get ya high ha\nGet ya up and get ya high ha (Fightin over dick)\nGet ya stoned and get ya high ha", "image": "https://images.genius.com/fe6629f7a5e6af0aa38ca87547ced96f.1000x562x1.jpg"}], "artist": "Method Man"}