{"songs": [{"title": "Baggage Handlers", "album": "The Vatican Mixtape, Vol. 1", "year": "2007-02-27", "lyrics": "[Intro: sample from Scarface]\nYou got to be kiddin', five hundred?\nWho you think we are, baggage handlers?\nThe goin' rate on a boat, is a thousand a night, man\nYou know that (first you got to work your way up to 500, cedigo)\nOk, what I did for you guys in Freedomtown, what was that?\n\n[Verse 1: Raekwon]\nReturn of the kitchen kid, with the axe\nAll I know is real detail, coke, lasagna and them E pills\nMillion dollar merchandise, we on, get ya groove back\nA hundred yukons, we all moving crack\nAll my soldiers got big rank, pa, Sicily money\nY'all had a bitch that got pregnant in Iraq\nWhat's the movement? Superman money in the Ooh building\nA few dudes who make a lotta rules sayin' 'you get it'\nRight, wavy hair, all my niggas is polic'\nYou stay off the roof, or jakes see the crib\nNo snitchin', this Amityville detention\nMight fuck around, get caught, or shot down, play position\nYeah, here they come, sizin' them up, you know my status\nThis is raw way, lookin' in his eyes, and he butt\nYo, what's happenin'? I heard you got the streets back, captain\nYup, all niggas is dead, unless they team clappin' something\nHe felt the generals plans, recognize, we going all out\nI might throw three in his man\nHad the slick look, looking all Cubaned up\nDon't get it twisted, nigga we'll swiss swish you up, what?\n\n[Hook: Raekwon (Busta Rhymes)]\nFrom all day to morn', noon, night\nRecognize we gotta re-up (Yo, it's Cuban Link 2, motherfucker)\nYou all listen, pay attention\nWord to the team, we gonna key up (Yo, it's Cuban Link 2, motherfucker)\nGet ya birds off, playground\nYo, stay out my business, you gon' see us (Yo, it's Cuban Link 2, motherfucker)\nFor all them real Cash Rule Everything Around Me\nNiggas get y'all stee up (Yo, it's Cuban Link 2, motherfucker)\n\n[Verse 2: Raekwon]\nThe kid that endorse Maxmaris, shorty show support\nTake your sweatpants off, fix your mascara\nFour hundred nineteen ounces, out in Long Island\nTwelve strong bitches that's real, who not scared of housing\nYes, throw on them raccoon, chinchilla feathers\nLet it drag on my boots, the jean burned leather\nJog through the back of the building, drop the L\nGot the scope on your nosey ass mother, fuckin' up sales\nForty karat locked in, bowtie, chillin' at the Democrat party\nYo, Chef, your coat, got it poppin'\nComing soon, Purple Tape, circle up the city let 'em know I'm back\nFour hundred bricks, and yup, the kids stance\nSponsored by my cousin in Stan', maintainin'\nGot the call from Tony Young Montana, my son campaignin'\nYup, I'm not no fuckin' bellboy, I war anything out there\nThe ring is mine, you can tell Roy\nThat's when I was hit with the call, your whole motto is get tour\nDrug rap owner, you will rip all\nLive like the pope, and get a big hall\nFlipped them a claren, the front, like the Jag back like the store\n\n[Hook: Raekwon (Busta Rhymes)]\nFrom all day to morn', noon, night\nRecognize we gotta re-up (Yo, it's Cuban Link 2, motherfucker)\nYou all listen, pay attention\nWord to the team, we gonna key up (Yo, it's Cuban Link 2, motherfucker)\nGet ya birds off, playground\nYo, stay out my business, you gon' see us (Yo, it's Cuban Link 2, motherfucker)\nFor all them real Cash Rule Everything Around Me\nNiggas get y'all stee up (Yo, it's Cuban Link 2, motherfucker)\n\n[Outro: Raekwon (Scarface sample)]\nYea, we back in the motherfuckin' staircase, nigga\nYou know that kid is coming, Cuban Linx, nigga\nLouis Rich, the signature, bitch\n(Every dog has his day, huh, Mel?\nYou wanna job Ernie? Ok, then, you call me tomorrow)", "image": "https://images.genius.com/6a8b7e152802d68a042f150de8d50c5d.820x820x1.jpg"}], "artist": "Raekwon"}