{"songs": [{"title": "As Time Fly By", "album": "Same Day,  Different Shit", "year": null, "lyrics": "[Intro]\nYeah look. It's Kurupt. Young Gotti. You know life's a bitch. And then you die nigga. Don't ask why nigga. Mom is pride nigga. Live your life nigga\nLook, look\n\n[Chorus][x2]\nLiving in world put against these beneath us that was born to die. Got to make a mistake in just respect and muth fuckas get high\nDie, die, die - if we try, try, try. Mommas cry, cry, cry - as time flies, flies, flies. Heeey. (repeat)\n\n[Verse 1]\nGive me little bit of that cash and I'll be alright my nig. (My nig) Give me a little bit of that hash just chip me off a big, big, big. I'm out to get a grip. Make it happen fast and quick. Give up and down the strip. The homies on this pimping shit\nRiding around LA to A and riding round back, back. You got a lot say, say. Then say that shit in my face\nMy woofers got a lot of base, base. And I don't even drive nigga. I kick back and enjoy my liquor\nSip and enjoy the ride nigga. See all that I want in my life is just a cool momma that's right\nAnd just a gansta paradise inside my gansta paradise you'll find hoes, hoes, ballers on\nSitting on fours. Pimping these hoes. Monte Carlo does, clothes, Gucci penny loaves, loaves\nGansta than a mutha fucka like a G suppose. But if you get the trip and spit the ship to shift in each and everybody part existing throw this nigga up in the system. See me lift him, see me lift him...\n\n[Chorus][x2]\n\n[Verse 2]\nMy homeboy just got shot. I almost lost my spot. I keep on trying to make it. I give it all I got. Who am I am to trust\nIt's not enough. I am trying to get all I can get up out this bitch and it's just singing off a thug. They rape my cuz\nThey got my shit, my bitch, my grip, my twist fucked up. Just brought a brand new SS siting on some D's\nJust me (inaudible2:32) Snoop, Preas, Nate, Warren G, Soldy Mack pushing front to back. Let's ride big and little tribe\nLook at this bitch on the ride. Nigga whats cracking tonight\nYeah a little something just to let you know about the squad. Ride role. Full control\nHoimies all up in pimp mode. Ganstafied this is just the beginning. My time to stop and then ending\nIt might feel like a couple of seconds. It might last about a minute. Look ain't tripping off of none of you niggas\nActing hard. Acting like a God. Imma bomb first than disperse. I;m the worse mutha fuka DPGC. Look....\n\n[Chorus][x2]\n\n[Bridge]\nWe bang on niggas\nWE BANG ON NIGGAS\nThat's all I know nigga\nTHAT\"S ALL WE KNOW NIGGA\nThat's all I know nigga\nTHAT\"S ALL WE KNOW NIGGA\nI bang on niggas\nWE BANG ON NIGGAS\nThat's all I know nigga\nTHAT\"S ALL WE KNOW NIGGA\nThat's all I know nigga\nTHAT\"S ALL WE KNOW NIGGA\nThat's all I know nigga\nTHAT\"S ALL WE KNOW NIGGA\nTo bank on niggas\nWE BANG ON NIGGAS\nThe holla four nigga\nTHAT'S ALL WE KNOW NIGGA\nWe we go nigga\nTHAT'S ALL WE KNOW NIGGA\nFuck a hoe nigga\nTHAT'S ALL WE KNOW NIGGA\nI bang on niggas\nWE BANG ON NIGGAS\nThrowing hoes nigga\nTHAT'S ALL WE KNOW NIGGA\nBack all you hoe niggas\nTHAT'S ALL WE KNOW NIGGA\nNigga froze nigga\nTHAT'S ALL WE KNOW NIGGA\nI bang on niggas\nWE BANG ON NIGGAS\n\n[Verse 3]\nCan fly and start and singing. You better earn your wings nigga. So you can fly and start singing, singing\nThat's cool I ain't tripping. Got my bitch up on my side. All my ganstas to the left. All my D boys to the right, right\nEverything up in the middle there need to be some bitches. Cause if its not bitched we need to mop them niggas\nThis a BG boy affair. She ain't got on underwear. Who gives a fuck and who cares? Nigga we don't fuck around with you squares\nNigga\n\n[Chorus][x2]", "image": "https://images.genius.com/c251b0b346b28a8f4079b3f901685705.1000x1000x1.jpg"}], "artist": "Kurupt"}