{"songs": [{"title": "I Lied", "album": "The Pinkprint", "year": "2014-12-12", "lyrics": "[Intro]\nOoh ooh ooh, ooh ooh ooh\nOoh ooh ooh, ooh ooh ooh\nI lied, I lied, I lied\nTo keep you from breaking my heart\n\n[Verse 1]\nEven though I said I didn’t love you I lied, I lied\nEven though I said I didn’t need you I lied, I lied\nTo keep you from breaking my heart, ooh\nTo keep you from breaking my heart, ooh\nEven though I said don’t touch me I lied, I lied\nI can’t fall for you, can’t give my all to you\nI can’t let you think that I'ma let the game stall for you\nGotta protect me you gotta sweat me\nYou said you thought you was ready and I said \"let’s see\"\nBut I ain’t mean that, I need some fucking proof\nCause what happens if I fall in love, then you cut me loose?\nYou just a heart breaker, won’t let you break mine\nCause I’ll be smashing windows and cutting them brake lines\n\n[Hook]\nI lied\nCause who knew if I should let myself go with you\nWho knows, who knows, so I lied\nTo keep you from breaking my heart, ooh\nTo keep you from breaking my heart, ooh\n\n[Verse 2]\nEven though I said fuck you, I lied, I lied\nI thought eventually, you would let me go\nThat was my insecurities, and my ego\nMissed my jump shot, missed my free throw\nMiss the way we kiss, miss the D yo\nMan it was good while it lasted\nThat shit wasn’t real, it was magic\nIf it was a record, it would have been classic\nBut fuck you though, orgasmic\n\n[Bridge]\nI guess this is what I gotta do to keep me from falling\nStalling the truth, who knew what you’d do, if I let you in?\nMy mama ain't raised no fool\nI am not your usual typical type\nWho would protect me if I never hide?\nFalling so fast I'm afraid of you\n\n[Outro]\nSo I lied, I lied, I lied\nTo keep you from breaking my heart, ooh\nTo keep you from breaking my heart, ooh\nI lied, ooh baby, oooh\nCause what if I let myself go with you?\nIt’s all good now\nGoodbye now\nYou’ll stay, you’ll stay in my heart forever", "image": "https://images.genius.com/e6951472bdf7074eced144472c3b71c0.1000x1000x1.jpg"}], "artist": "Nicki Minaj"}