{"songs": [{"title": "U R the One", "album": "True Magic", "year": "2006-12-29", "lyrics": "[Hook]\nYou are the one\nYou're the one!\n\n[Intro]\nOther fuckas just don't know\nYou got to feel me on this one man\nSo real, I'm so sin-serious about it, you know?\nI know more than a few is gon' relate\nSo much more than a few for really real\nSo much more (On the really real!)\n\n[Verse 1]\nWhen it started I knew it was trouble\nBut you know me, them \"hard and everythings\" can't hold me\nI need some shit straight out the movies\nDrama, warm to the touch, hot mama\nPut me all in like launch jeans and scama\nYou was Mrs. Mine, so fine\nWent from \"we gon' conquer it all\"\nTo \"nigga I'mma see you in court\"\nI woulda never thought, I guess I better think again\nOk, now the shit is really sinkin' in\nWe ain't just divorced, we ain't even fucking friends\nCause in the end it was all about the ends\nBut fuck that I know it gotta be more to it\nHeld up with bitter hate with crosses all through it\nAnd when I looked, what did I see?\nYou on the other end crying like me\nExpression on your face like, \"How could this be?\"\nThat's what I'm asking, \"What the fuck happened?\"\nHow could all the magic and passion just vanish\nWent from outsanding to making me shout, \"Dammit!\"\nCan't explain the changes, behavior's is outlandish\nNow I'm just stuck in the road feeling stranded\nI'm in the dark wishing for the answers\nOn some old Biggie give me one more chance shit\nWhen we met your face so brown\nYour ass so round, of course I'm so down\nWish I knew then what the fuck I know now\nCouldn't read the signs in the road: \"Slow down!\"\nI'm too deep in the road now\nGot me pulling over getting smoked out\nFighting tears that I can't hold down\nCan't believe it, this fucka's got me weeping\nI keep it a secret so my friends won't peep it\nBut late in the evening I'm up, my chest heaving\nI'm reaching in the dark and I'm looking for the reason\nWhy? Did our love have to die? You and I were so fucking fly\nCan't get it off my mind, the things that made me smile now make me cry\n\n[Hook]\nYou are the one\nYou're the one! Fuck you!\n\n[Bridge]\nI wish we never met, I wish we never kissed\nI wish we never touched (Swear to God)\nI wish I didn't love you so much\nI wish I could forget how feel, how you f..\nThat's a lie, the shit that made me smile, now make me cry\n\n[Hook]\nYou are the one\nYou're the one! Fuck you!\n\n[Outro]\nSometime I wish we'd come back\nMan, I wish we'd come back (Memories!)\nNo lie, for real? Fuck that\nNo, for real\nIt's a dangerous necessity\nIt's a world famous mystery, love\nThat's it, peace!", "image": "https://images.genius.com/50acba8e30cec066c838d6f22dd475e3.500x500x1.jpg"}], "artist": "Yasiin Bey"}