{"songs": [{"title": "30 Minutes To New Orleans", "album": null, "year": "2010-10-25", "lyrics": "[Verse 1: Lil Wayne]\nOk, Gucci backpack, fresh black Adidas\nI'm rollin' on a pill, rollin' up some reefers\nDeclining all the Keishas, replying to the Kims\nStill knockin' boots like hammers on tims\nI'm a mothafucker baby, Weezy F. Baby\nYeah I get it wet and I keep it wet baby\nI can make a dyke say she leaving that lady\nI can make a lady say she leaving that pussy ass nigga\nThat gave her that baby, now she with\nWeezy F., Weezy F., Weezy F., Weezy F. Baby\nHahaha, Weezy F. Baby, hahaha, yeah\nWhatcha gon', whatcha gon', whatcha gon' do?\nWhen Nina Ross come and put the pussy on you\nYou probably still a virgin, I'mma bust your little cherry\nAnd I'mma come through in something so cherry\nAnd I'm sittin' on Pirellis, bumpin' Makaveli\nShowed your girlfriend my house she think I live in Italy\nJust bought a jet I'm 'bout to take that bitch to L.A\nBitch I never met I'm 'bout to meet that bitch in L.A\nOoh, I'm feeling myself\nI'm so fly shawty think I really fly stealth\nI'm so paid shawty I could really buy stealths\nAnd I'm feeling my belt, and I'm feeling my sneaks\n'Cause I don't see them on anybody\nGot the semi by me for anybody\nYeah I'm from uptown, yeah I'm from uptown\nYeah, I'm from uptown, Eastside, I'm lighting up two blunts at one time\nAnd I thank God I can say fuck one time\nI'm sipping on two cups at one time\nAnd I thank God I can say fuck one time\nFuck one time, fuck one time, fuck one time, thank God\n\n[Verse 2: Lil Wayne]\nLouis V. bag, all black hammer\nLouis V. shoes with the Louis bandanna\nOn the Louis phone case with the sidekick case\nMight put L.V. on the side of my bitch face\nMan I'm a dog, I go so hard\nMan I'm a dog, 'bout to come in your yard\n'Bout to, 'bout to cum in your lady\nWeezy F., Weezy F., Weezy F\nBaby, hahaha\nWeezy F., Weezy F., Weezy F\nBaby, hahaha\nAnd Young Mulah, baby\nCan't forget that\nHow would you do that?\nI beat that track 'til that bitch blue 'n black\nIt's Weezy F. the monster, even F your mama\nEven X your mama, leave you next to mama\nYou are so pussy gonorrhea's your aroma\nBlind gynecologist could see that your vagina\nWho? Me? Me? Turn beef to balanya\nAnd your girl ride me like a Honda\nBetter yet she ride me like Travis Pastrana\nFuck the X Games, it's ecstacy games\nShow me a mirror cause I'm so glad to meet Wayne\nAnd I'm feeling myself\nSo fly shawty think I really fly stealths\nBut I'm so paid shawty I could really buy stealths\nBut I'm feeling my belt, I'm feeling my sneaks cause\nI ain't never seen them on anybody\nGot the semi by me for anybody\nYeah I'm from uptown, yeah I'm from uptown\nEastside!", "image": "https://images.genius.com/f903dae2533e450c8d3cb233aa846020.745x745x1.jpg"}], "artist": "Lil Wayne"}