{"songs": [{"title": "War Games", "album": null, "year": null, "lyrics": "[Intro: 2Pac]\nNiggas playing deadly motherfuckin' war games (deadly war games)\nThat nigga rappin' about my motherfuckin' life!\nI'm talking to you, nigga (fake-ass motherfucker)\nThe fuck you talkin' about\nLet's get it on now\nHe got shot and left the hospital the same day\nBring the noise\nWhen? What month, motherfucker? (Y'all motherfuckers soft as jelly) What motherfuckin' month?\nBring the noise\nHow you talkin' about gattin' and shootin'\nYou ain't firm nigga, you soft\nWhere the fuck do these niggas live where all this shit be goin' down?\nSoft ass nigga\nFuck your clique nigga\nYou want to know how I did this shit?\nBunch of skinny motherfuckers\nYou want to know how real my shit is?\nNigga, go read the motherfuckin' newspaper, you trick-ass nigga\n\n[Verse 1: 2Pac]\nHeyyyyyyy, huh\nHow many broke-down rappers got some shit to say?\nI sit and strategize, in due time, them bitches pay\nPlus all day, I puff weed 'til my eyes bleed red\nUndercover tactics, leave my enemies dead\nCheck this, I know you niggas got no love for me\nBut how the fuck your whole clique turn to thugs, homie?\nLike misdemeanors, it's a small thang\nYou niggas ain't ready for war, let my balls hang\nBust it, I took apart your whole crew, lack heart, I ain't concerned\nI bust at Bad Boy, Mobb Deep and murder The Firm\nWhen you scream \"Fake thugs,\" who the fuck you mean?\nGet more cream than all of y'all, nigga, fuck your team\nNow Dre want to switch sides, tricks hide in war\nLast year, I'd shed tears, but I don't cry no more\nPlus Jay-Z tried to play me, won't last long\nGo ask King Sun how it feel to have your ass gone\nListen Doo-Wop, don't get your shit knocked, you can't win\nTell 'em all to let the games begin, we havin' war games\n\nYeah nigga, y'all niggas can't fade this shit\nGot shot 5 times, got out of jail on bail\nAnd sold 5 million\nSold more records then all you trick motherfuckers put together\nMore than the Firm, more than Bad Boy, more than Mobb Deep\nMore than all you bitch made niggas\n\n[Verse 2: Napoleon]\nNow won't you just, signal me\nBefore you try to take another one of my folks\nTook they breath so they choke\nAnd I know I did a lot of dirt\nBut grand said it wouldn't hurt\nMy death is comin', 'cause I feel it, smell it\nWhen I work, did you see me\nComin' up I tried to take it easy\nPlan at the wrong place, at the wrong time\nI leave you with a broken mind\nYa whole block is fucked\nWhole family is cryin', when the guns go bust\nI went from Jersey to Cali, nigga\nI seen it all, when niggas get they head busted\nAnd didn't fall\n\n[Verse 3: E.D.I. Amin]\nHuh, yeah\nI be that young nigga, EDI, Amin, huh\nRappers is fixin' to come up short\nIf y'all don't come clean\nCheck it, I'm at home watchin', shittin', sittin'\nAnd I see some niggas on a T.V. line, what a pity\nAin't nothin' but a copy, of a copy\nReincarnation of an imitation, sloppy\nDon't even know you got these white folks laughin' at cha\nHow the hell, you gonna base your lifestyle after a movie character\nI'm dumpin' back at cha\nHuh, fully loaded and you can quote it\nThug niggas casket is ridin' roll it\n\n[Verse 4: Young Noble]\nI'm hell-bound, One Nation\nMy destination is jail bound\nPenetration to get ya niggas shot down, it's my town\nPut your B'9s and Glocks down\nOutlawz drop down\nShuttin' your whole spot down\nWe rock towns daily\nSippin' on the Baileys with thug passion\nMashin' with Mr. Makaveli, so tell me\nWhich one of y'all niggas want the war to be civilized?\nIll as Killa Keise and I be cockin' in your enterprise\nCriminalize, thoughts\nWhen I be thinkin' draw fast, haul ass\nWhen you see a nigga reachin' for what, the heater\nBack streets I know, critically in Italy\nLike Bellissimo\nBut down in Mexico, policio try to track me\nTransform my Jersey army to some Killa' Cali\nKhaki so Kadafi back me\n\n[Verse 5: Yaki Kadafi]\nEhhhhhhhh yoooooo\nThey wanna strangle me and trap me\nAngle to angle, blast me (ride on these bitches)\nSo you niggas can't match me (hehe)\nWhen it comes to the chips (that's right)\nWe flip and cock back like a fifth\n(Eh yo, Kadafi keep a gat on these, while I do it)\n\n[Verse 6: 2Pac]\nAfter the fire comes the rain, after pleasure there's pain\nEven though we broke for the moment, we'll be ballin' again\nTime to make it yo; my military be prepared for them bustaz\nSimilar to, niggas that scary, get too near me we rushin'\nVisions of over-packed prisons, visions and niggas thug livin'\nPressures, three strikes, I hope they don't test us\nThey pull the heater ammunition in crates, ssshhh\nMove without a sound, as we slide down, pistols in place\nThey got me fiendin' for currency, the money be callin'\nIt's like I'm - dreamin', seeing scenes of me ballin'\nParticipated in felonious behavior\nCock the cocked fo'-five, snatchin' niggas pagers\nLabelled a mark soon as we start, it was hard to quit\nWe started out drinkin' 40's, moved to harder shit\nGod damn now I'm a grown man, I follow no one\nNigga got my own plan, WATCH ME, uh\n\n[Outro 2Pac and Yaki Kadafi]\nEhhhhhhhhhhhh yooooooooo\nOoooooo oooooo\nGet that money nigga\nYo nigga come here come here nigga\nCome on come on, whassup whassup\nEh yooooooo\nYo niggas down the block, yo yo\nEhhhh yoooooo\nThat nigga Mu ridin' in a hot car\nYo that nigga Mu got a stolen car\nYo, eh yo, Mu got a stolen car, oh shit\nEh Mu, that nigga bout too, eh yo\nWatch out, that nigga rollin' in stolen\nHhahahehehehahahahaha\nJersey style nigga (that's right nigga)\nThat nigga Mu crazy as fuck\nThat nigga Mu, rollin' in stolen\nNigga doin' donuts in the middle of the street\nK diggity watch out watch out\nEh, yo K, hahahahehehe look at the nigga\nLook at that, K drinkin' a gallon of fuckin' Tanqueray\nThat nigga ain't no fuckin' joke (motherfucker)\nEh K, eh Malcolm watch out the police, nigga\nPolicia, watch out nigga, you rollin' weed right in front of the fuckin' police\nStupid nigga hahahahahahaha\nEh yo Yak, you got weed?\nI don't know man, I had some\nWho got the strap\nI lost, I lost the herb running motherfucker\nWhere the strap at nigga?\nI got the strap\nEh yo who dat? Eh yo who dat, who dat? Eh yo who dat?\nWatch out, watch out, watch out, watch out\nYo, yo, yo, eh yo, eh yo, eh yo\nEh, yo why you let that nigga come through the block?\nNigga not supposed to be down there\nEh, Malc come here, come here\nFuck wrong wit y'all niggas, man (hehe)\nEh yo, get money\nYo the next one mine yo, next one mine\nYou got that, you got that\nMoneyyyyyyyyyyy\nLet me get down, let me get down, let me get down\nLet me get down\nI just came out here, nigga come on man\nHehe", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}