{"songs": [{"title": "Ice Cube Killa", "album": null, "year": null, "lyrics": "[Shag]\nGimmie that beat, bitch! (vocal sample: \"We Are At War\")\nDing Ding Muthafucka\nIt's round two\nI got my lunch and my dinner, fool\nYou think we gonna bow down to some punk ass niggas\nWe from the evil side, boy\n\nChorus: B-Real [Shag]\nDoughboy [Killa], Wack 10 [Killa]\nDoughboy [Killa], Wack 10 [Killa]\nDoughboy [Killa], Wack 10 [Killa]\nDoughboy [Killa], Wack 10 [Killa]\n\n[B-Real]\nIn about four seconds some east side niggas\nIs gonna put the foot in the ass of Doughboy and Wack 10\nI suggest you stay tuned muthafuckas\n\n[B-Real's verse]\nIt takes two of you faggots to get with one of me\nNow I'm running up in you hoes with \"No Vaseline\"\nYou could be the big fish, bring your drama\nFuck your mama, I'll bring the pack of piranhas\nYou tried to pull a ditty, ho\nBut you the one who got the alternative rockers up in your video\nYou get addicted\nYou can take your four W fingers\nAnd stick it in Mack 10's ass and lick it\nIce Cube is a thing of the past\nIf I got no nuts it's because they're still stuck in your ass\nYou're the King of punks, king of busters, king of thieves\nNow get down of your fuckin' knees (Shag: Bow Down)\nStart to sucking\n\nYou tried to remake N.W.A. without Dre and Ren\nDub's cool, but you're fuckin' up with Mack 10\nSilly little philly, I'm back tearing'\nCan you really see my machine gun turrets?\nOpen and aimed at your fat little frame\nHow can I miss?\nI'll twist your cap and take your name\nAnalyze it, my name should be Mack 11\nI'm a higher caliber MC, there's no question\nAnytime you wann run up you get dealt with\nYou get melted \"Check Yo' Self\" (bitch check it)\nIce Cube, you better tell'em (tell 'em mutha-fucka)\nMuggs made the best songs on your third album (biatch!)\n\n[Shag (spoken)]\nYou and Wack 10\nCan't deal with this\nCypress Hill to the muthafuckin' fullest\nFuck y'all\nSo what'cha wanna do?\nBring it on, nigga\nThis is Shag from the Neighborhood Family\n\n[Shag's verse]\nMack 10 is a bitch, suckin' Ice Cube's dick\nBut what you faggots know about some gangsta shit? (B-Real: Nothin)\nLet's take it to the streets and fight like real g's\nWhat you niggas wanna do? You can't fuck with these\nAin't never had a strap now you wanna gangsta rap\nCan't come to your hood cause you're scared to get jacked\nFuck peace, this is war everybody on the floor\nWhen I see your fat ass I'm takin' one to your jaw\nFuck you Fuck your mama fuck your whole clique\nBetter yet, fuck every nigga that you're down wit'\nUnoriginal, can't stand bitch made niggas\nIce Cube, you'se an actor not a muthafuckin' killa\nWhat neighborhood you from? what don't you ever done?\nWhen the shit goes down you the first one to run\nEvery time you talk got a mouth full of drama\nOnly missing you done is going to church wit'cha mama..\n\n[B-Real's verse]\nYou got the Real-a Swingi' of my nuts Cube Killa\nBreak yourself niga, huh! Give a lick-a you ain't a killa\nYou a busta muthafucka bitch made niggas\nI never trust ya --Cube's \"Can't trust 'em\"--\nHoes like you can't figure out where you're from\nAre you from South Central, the Westside or Compton?\nMack 10, the only thing you hoggin' on\nIs Ice Cube's nuts now he's all in your guts\nYou wanna be like him but you got no skills\nIf he's the king you must be the queen of the Hill\nBut I shank the Cube's fat neck cause \"A Bitch Iz A Bitch\"\nAnd a bitch don't get no respect\nNo doubt Westside connections means\nIce Cube's stickin' his dick in Mack 10's mouth (Aahhh!)\nAll of your homies are down wit' my clique\nWhy you always gotta be bitin' my shit\nAnd you don't know one bitch on my dick\nBut yours is best get a blood test for your kid\nOnly bangin' you done was with toy figures\nYour mama wouldn't let you hang with real g niggas\nBring your clique on you wanna scrap\nSo let's get it on (bullets for some chingazos, ese!)\nMack 10 I give you a year I guarantee\nYou'll realize that you're getting' fucked and you'll run to me\nYou pretty little trick, you look real sweet (Mmmm!)\nI should make you one of my hoes like Cube was for Eazy\nDoughboy, you're fuckin' around wit' the real Cuban\nI'm no fictional Scarface movie land bullshit, actor, studio gangsta\nYou should win an award For most outstanding wax banger\nFuck what you been through, what you're going through\nEast Side family, nigga What you wanna do?\n\n[Shag]\nEastside!\nThat's right nigga!\nEast muthafuckin' side\n'Til' we die, nigga!\nFuck all you punk ass niggas!\nCube 187\nMack 10 187\nAny other punk ass nigga\nWho wanna take this beat\n187\nWe hit niggas up like that\nWe bicoastal, nigga\nCypress Hill family\nNiggas better recognize\nWe here to chastise\nNigga, hoo bangin'\nThat's how we hoo ride nigga\nNo love for none of ya'll punk ass niggas\nEast coast nigga, West coast\nWe don't give a fuck\nTalk shit get shot, nigga\nThat's how we feel, nigga\nNiggas get killed\nCaps get peeled fuckin' with Cypress Hill\nYeah, I thought you knew nigga\nI represent muthafucka\nHow does that sound nigga\nCypress Hill Family\nThey're gonna fuck all ya'll niggas\n(Chris Tucker sample: \"You got knocked the fuck out man)\n(Cypress Hill sample: here is something you can't understand\nHow I could just kill a man...)", "image": "https://images.genius.com/31f0c96f104adee3fbc11447cbf3eebc.1000x563x1.jpg"}], "artist": "Cypress Hill"}