{"songs": [{"title": "Like Me", "album": "Untitled", "year": "2008-07-15", "lyrics": "[Intro: Anthony Wilson]\nAy yeah, what's happening mommy? How you doing baby?\nOh you looking kinda good and everything, I see you with them stilettos on baby\nAy check this out, you ain't got time to talk to me?\nAy let me put the bug in your ear baby\nWhy don't you turning them floor shoes into some ho shoes, ya dig?\nYeah, check this out, this Universe Finest, your Royal Highness\nYou know what baby? I can do a whole lot of thangs for you\nGuess why, 'cause I'm a motherfucking pimp\n\n[Chorus: Dwayne Collins (Nas)]\n(Like me...) Hustling and grinding babe\n(I be...) Staying on that paper chase\nI-In this life there's pimps and hoes\nTell me which one are you, you a nigga\n(Like me...) Hustling and grinding babe\n(I be...) Staying on that paper chase\nIn this life there's pimps and hoes\nTell me which one are you, you\n\n[Verse 1: Nas]\nThe good man in me say, \"Get money and stay on the path\"\nBut the pimp shit in me say, \"Yo, keep looking for ass\"\nBut my daughter gave me a gift, something to hold\nA little city in water, when you shake it, it snow\nI told her never let a sucker nigga take off her clothes\nBetter wait 'til you grown, when he love you, you'll know\nEverybody's got a dream, a hopeful wish to own a six times two\nCylinder whip, a fantasy, a bone to pick\nRevenge to get, against - who I don't know\nSomeone who said you won't blow, you won't eat, you won't cake\nThey mistake blaming me for they failures, I'm fresh, getting tailored\nSingle breasted, a lint brush is senseless, some pimp shit\nA woman hates a man and stays with him for many years\nTell him she loves him and be jealous of him\nNow lame is how the ghetto judge him, 'cause he still with her\nShe'll take his cash and give it to some other real nigga...\n\n[Chorus: Dwayne Collins (Nas)]\n(Like me...) Hustling and grinding babe\n(I be...) Staying on that paper chase\nI-In this life there's pimps and hoes\nTell me which one are you, you a nigga\n(Like me...) Hustling and grinding babe\n(I be...) Staying on that paper chase\nIn this life there's pimps and hoes\nTell me which one are you, you\n\n[Interlude: Anthony Wilson]\nAy pimping been going on man for eons and eons man since the beginning of time\nYou know me, the only thing I need to do is get on the grind, and get mine\nSo the only thing I gotta tell you man is you know\nDo what you gotta do man\nBring my money back, get on that track and get on your back\n\n[Verse 2: Nas]\nI heard 'em say the NBA's a bunch of million-dollar slaves\nA portea wasn't real back in the days, the point I make is\nJerry owns the Lakers, his yearly takings\nLet's just say more than collectively all of his players\nThat's business, not really pimp shit\nMaybe a tid-bit similar to when we rappers make big hits\nAnd not own the masters, that's the deal\nBy the way, Poitier helps all the Denzels excel\nHe kept it more than real, but Hollywood can turn a girl out\nI knew a girl 'bout, 5'9\", so fine, she could for sure grind\nShe was sleek, chic, with a classic mouth\nMovie directors always fucked her on the casting couch\nShe came out with a blockbuster, can't knock a hustler\nShe not a hooker, she focused, a hopeless soul on a lonely road\nI showed her all my stones and gold\nI said \"Bitch, life is cold, you need to roll with a nigga\"\n\n[Chorus: Dwayne Collins (Nas)]\n(Like me...) Hustling and grinding babe\n(I be...) Staying on that paper chase\nI-In this life there's pimps and hoes\nTell me which one are you, you a nigga\n(Like me...) Hustling and grinding babe\n(I be...) Staying on that paper chase\nIn this life there's pimps and hoes\nTell me which one are you, you", "image": "https://images.genius.com/b494ca4151f14803123849b4f34be37f.700x700x1.jpg"}], "artist": "Nas"}