{"songs": [{"title": "#PROUDCATOWNERREMIX", "album": "? (Deluxe)", "year": "2019-08-20", "lyrics": "[Intro]\nOh my God, Ronny\n\n[Chorus: XXXTENTACION]\nOh, she ratchet, I might smash her\nBend that backwards, I might pass her\nHomie on Casper, geekin' like Dexter\nI do magic, no distraction\nYeah, my flow's on Destructo Disc, too afraid to cuff a bitch\nThese boys on that sucker shit, feature price went up as shit like\n\n[Verse 1: XXXTENTACION]\n\"Oh, big deal, are you Satan?\"\nI reply like, \"Are you playin'?\"\nSlurp on pussy like Lo Mein\nI'm Progressive like Flo, man\nTherapist knocking at my fucking door, man\nMy body just look like G.I. Joe, man\nFeds askin' questions, I don’t fucking know man\nKim Jong Un to the fucking flow, man\nLike whip, lash like whip, lash like whip, lash like whip, mhm\nDiamond baller, broke my shoulder\nShe wan' fuck (Ayy) but can't come over (Ayy)\nWhen I met your shorty, hit the running man, mhm\nHopped out of jail, made a hunnid bands, mhm\nKKK, I'm just hanging, man, mhm\nChris Rock, niggas acting funny, man\nMy money stretching like Luffy, uh\nLike Disney, these niggas is Goofy, uh\nI don't fuck with snakes but like Gucci, uh\nThese niggas act fool for some coochie, uh\nI will not go back to jail, uh\nThese niggas is blind, need braille, huh\nWatch how I switch, watch how I switch\nNut on her, switch, watch how I- mhm\nNigga, where the fuck is your energy? Cannot mimic your enemy\nPlay pawn defending me, I can palm you niggas\n'Cause I warned you niggas, I never swung you niggas\nI don't need no motherfuckers shoulders to lean on\nWay I ditch her pussy, I treat it like ding dong\nHarder than the Kim Possible theme song\n\n[Interlude: XXXTENTACION]\nYeah re- real quick\nI just- I just really wanted to say all you rappers suck\n\n[Chorus: XXXTENTACION & Rico Nasty]\nOh, she ratchet, I might smash her\nBend that backwards, she sing like pastor\nHomie on Casper, geekin' like Dexter\nI do magic, no distraction\nYeah, my flow's on Destructo Disc, too afraid to cuff a bitch\nThese boys on that sucker shit, feature price went up as shit like (Rico!)\n\n[Verse 2: Rico Nasty]\nI ain't never asked for a handout\nBut I came up, now everybody got a hand out (Whoa)\nI just got my truck on matte red, with a five percent tint (Whoa, whoa, whoa, whoa, whoa)\nAnd them rims blacked out\nEverybody 'round me gon' wait 'til I blackout\nPut the pussy on him, make a nigga tap out\nJust say where, and my niggas pop out\nIf you don't get the picture, we crop you out\nThey givin' out pussy for shout-outs (What?)\nThese lil' bitches live in my shadow (What?)\nThey see me in person and panic (What?)\nMy diamonds the color of candy\nI'm used to shockin' these bitches like Pikachu\nDon't run away from me when I run into you\nIt can get surgical, personal (Whoa)\nEverything I do be goin' up, I'm on my vertical\nYes, I'm a girl, I go harder than niggas do (Hmm)\nI'm in a Benz, that's the color of Fruity Loops (Hmm)\nMy calendar's been lookin' so beautiful\nHow is you hatin' on me from a cubicle?\nI got more money than you on my cuticle (Bitch)\nWhen I pull up, all the bitches like, \"Aah!\"\nOnly leave the house when I'm pickin' up a (Bag)\nGot a short temper, don't make me (Mad)\nStop the comparisons, that shit embarassin'\nBitches at home, I just got back from Paris\nAnd they got to check it wit' me like I'm parents (Hahaha)\nYou got to be quicker than that (Oh yeah)\n\n[Chorus: XXXTENTACION]\nOh, she ratchet, I might smash her\nBend that backwards, she sing like pastor\nHomie on Casper, geekin' like Dexter\nI do magic, no distraction\nYeah, my flow's on Destructo Disc, too afraid to cuff a bitch\nThese boys on that sucker shit, feature price went up as shit like\n\n[Outro: XXXTENTACION]\nI been trying to tell these niggas\nI got- I got the Krabby Patty formula man\nCome fuck with me!", "image": "https://images.genius.com/1291110191b6552f48f1db25d7cf5134.600x600x1.jpg"}], "artist": "XXXTENTACION"}