{"songs": [{"title": "Straight Cash", "album": null, "year": "2014-05-22", "lyrics": "[Hook]\nStraight cash, straight cash\nBitch I'm like a register\nStraight cash, straight cash\nBitch I'm like a register\nStraight cash, straight cash\nB-b-bitch I'm like a register 3x\nMoney, cars, clothes, and hoes\nI don't get enough of them\nHating ass fraud niggas, nah we don't fuck with them\nStraight cash, straight cash\nBitch I'm like a register\nStraight cash, stra-stra-stra-straight cash\n\n[Verse 1]\nYeah, a hundred hundreds, that's ten stacks\nSitting in my pocket, you get that?\nI fuck your girl, give your bitch bad\nPull up in that Benz, hold up girl, he get that\nOh, he did what? I be stunting on 'em\nEven the niggas with them bricks saying I got nothing on 'em\nLook at the jack boys, let 'em run up on 'em\nAnd I be dumping on 'em\nYeah, I got something for 'em\nGlock seventeen, in my seven jeans\nDo them niggas dirty, it be a bloody scene\nI like my yayo white and my money green\nIt's BA, bitch, fuck that other team\nAll you niggas rats, you ain't fucking balling\nI be shitting on these lames like they [?]\nI eat rappers too, go and get your artist\n1-800-Hustler, you should fucking call us\n\n[Hook]\n\n[Verse 2]\nTwenty grand, you don't understand\nI'm my Miami Ocean drive on fucking hands\nShe ask me who I be, I said the fucking man\nLet's cut the bullshit, is we fucking, man?\nSomebody wake me up, swear to God I'm dreaming\nLamborghini, hundred miles an hour and I'm leaning\nBanging flames too, they say my style the meanest\nSwagger on 100, I got it from [?]\nThe money here, the bitches too\nYou need some paper, this what you do\nCall my nigga up, he say sending you\nYou tell him \"me\" you pay for one and he gonna give you two\nDope boy, turned rapper now\nSomebody let them haters out, I back them down\nBenjamins, we count them by the pound\nI was broke as a joke, but guess who's laughing now\n\n[Hook]\n\n[Verse 3]\nFuck a money machine, I'm a money machine\nAll my niggas they get it, yeah running the team\nI ain't chasing the paper, it be running to me\nNiggas talking that money shit till they run into me\nI ain't saving shit, I'mma blow it all\nI'm Miami King of Diamonds, I'mma throw it all\nKeep them haters from around me, them niggas throw me off\nI was broke, I was quiet, now I be showing off\n\n[Outro]\nStraight cash, straight cash\nBitch I'm like a register\nStraight cash, straight cash\nBitch I'm like a register\nStraight cash, straight cash\nBitch I'm like a register 4x", "image": "https://images.genius.com/6929169de7116d41676151bdea5cc773.1000x1000x1.jpg"}], "artist": "Meek Mill"}