{"songs": [{"title": "Bring It On", "album": null, "year": null, "lyrics": "[Intro]\nBring it on…\nCome on, bring it…\n\n[Verse 1]\nBoom! My idea fill the room with light, soon as I write\nTunes are dynamite\nScenery’s out of sight\nShow’s tonight, I seal your doom tight\nMy platoon is right, puttin’ bullet wounds in the mic\nOnce again it’s the paragraph chemist\nInventors are finished, the experimentist\nRakim is the elementor, I invent more courses\nThe editor with thoughts of a sorcerer (bring it)\nAct like you want it –\nIt isn’t a man that’ll take it from me, I hold the mic prisoner\nRescues that’ll reach next crews, that speech\nUnless you know how to teach, retreat to the beat\nI swing it better than Tarzan\nOnce it’s in the R's hand, all they can say is “aw, man”\nA mass of people in hysteria\nYo, any bitin’ emcees in the area?\nBring\nIt…\n\n[Hook]\nBring it on\n(On and on and on and on)\nBring it… bring it on\n(On and on and on and on)\nCome on, bring it…\nBring it\nBring it on\n(On and on and on and on)\n(On and on and on and on)\nDon’t stop rockin’ ‘til the break of dawn - one\n\n[Verse 2]\nPoetry is drastic, hazard when it’s put on plastic\nHavoc if blasted - if I get sarcastic\nYour thoughts is short, mines go far past it\nHe didn’t wanna pass it\nI took it – believe me, it’s devious\nIf they wanna see me it’s worse than hideous\nLook – I drop another rhyme and the place gets shook\nIf you don’t get back, react to the hook\nI hook it – highly explosive, it could blow at any time\nWith any rhyme, without a nine\nGet out of line, too late if you wait ‘til I perform\nMics get blown out of tune, so bring it on\n\n[Hook]\n\n[Verse 3]\nThe crowd didn’t hear the original\nWhen the wild first one to ever let a rhyme float down the Nile\nStomp it, comp it, flowin’, a similar style\nRhymes attack, now they want rap exile\nNever – ‘cause I get militant, that’s why I’m still in it\nYou give me a mic and I’m killin’ it\nWhen it drops, autops and x-rays give them heads displays\nI say, ate away the microchips\nInstead of yappin’ about a gun\nRappin’ about things they never done\nYou’re sterile, you’ll never come\nI’m thorough since I came, I’m still comin’ with more\nIn ’94 I ain’t go on tour, I went to war\nWhatever, I’ll be right here ‘til the next year\nAt the mic site with a bright idea\nBrothers come wrong and better split, get gone\nWhen I rip the song they get torn\nBring it on…\n\n[Hook]\n\n[Outro]\n(On and on and on and on)\n(On and on and on and on)\nBring it\nBring it on\nBring it on\nBring it on\nDon’t stop rockin’ ‘til the break of dawn - one\nBring it… bring it on\nBring it on…\nBring it on…\nCome on, bring it…\nBring it on…\nBring it on…\nBring it on…\nCome on, bring it…\nBring it!", "image": "https://images.genius.com/6699b3c41af3d4ee6ce799b3b558d845.400x400x1.jpg"}], "artist": "Rakim"}