{"songs": [{"title": "I’m Good", "album": "Consignment", "year": "2012-04-27", "lyrics": "[Verse 1: Cito]\nYeah bandana on my snapback\nNikes on my feet, got a girl with a fat ass\nRolling on that Afghan Kush like I'm in Baghdad\nOh, that's your girlfriend? Well homie, I smashed that\nTap that, Tell them haters back, back\nYou can't touch this money ho, Guess I'm like in Sunny, Co\nSpending all these hundreds though, Smoking on that fuckin O\nShorty know I turn it up, Something like that radio\nThen I tell her burn it up, Ha, R. Kelly flow\nYou can find me at the top, That's where all the winners go\nOh, you a gold diggin ho? You can go dig a hole\nI'm all about my money, yeah I'm all about my dough\nPink lemonade, everyday, when you see me\nI pop up out of nowwhere like I'm 3-D\nYou can try man, but you can never be me\nI blow you away, ha, Breezy\n\n[Hook: Cito]\nI'm good, fuck your feelings\nHomie, I'm chilling, Ch Ch Chilling\nHomie, I'm chilling, Ch Ch Chilling\nHomie, I'm chilling, Ch Ch Chilling\nI said I'm good, fuck your feelings\nHomie, I'm chilling, Ch Ch Chilling\nHomie, I'm chilling, Ch Ch Chilling\nHomie, I'm chilling, Ch Ch Chilling\n\n[Verse 2: Goldie]\nI'm so smooth, I'm Tom Cruise in both shoes\nI make moves like playing chess, I slow bruise\nI'm so addicted to women, nigga I cannot lose\nI love shitting on niggas, fuck it I'm so rude\nFuck, the way I'm living is so different than those dudes\nI get my weather from old-timers, I'm old school\nLouie flip flops, Automor tic tocs\nRacks by the ziplock, tell me who was this hot?\nA made nigga with made niggas I'm way richer\nHe can't shopping the corporate flyer than Blake, nigga\nWhoever, don't matter, can get it whenever, however\nWhenever is not just uncovered is the way that I put it together\nLife of a superstar, now I'm living luxury\nNiggas call me bro now, really they don't fuck with me\nBitches call me bro now, who really wanna fuck with me\nThat's why I'm always in the house and I don't want to company\n\n[Hook]\n\n[Verse 3: Jadakiss]\nHomie I'm chilling, OG status\nMy pockets on swole and my bitches be the baddest\nSo raspy, you already know who that is\nCame from the bottom of the hood, where the crack is\nSleeping on the king size Vera Wang mattress\nCatch me coming out the Mandarin with an actress\nYeah I'm chilling, better getcha Nina\nOr leave me with the money like Bobby Christina\nI have your mom in the front row, in a black dress\nTwo mill cash any time all access\nTold you I'm chilling, enough of the small talk\nSleeve rolled up, linen pants on the boardwalk\nWatching a bracelet, straight from the district\nPopping out the big boy toys, with a biscuit\nStill down to earth though, keep it realistic\nI already told you, but in case you missed it, Nigga I'm\n\n[Hook]", "image": "https://images.genius.com/5ff9a0638eaf18af7b98d2b6e3ad8b21.1000x1000x1.jpg"}], "artist": "Jadakiss"}