{"songs": [{"title": "Phucked", "album": "Keep Right", "year": "2004-07-13", "lyrics": "Yeah\nY'know when advice is in your face, you need to heed that\nWord, you need to read that\nY'know, I put this lil' joint together real quick\nYou know what it's called?\nIt's called - NOW YOU'RE FUCKED!\nThat's right, listen\n\n[Verse One]\nWasn't you the type to mimic what you saw on TV?\nWasn't you the type to mimic what you heard on CD?\nYou never wanted to work you wanted everything easy\nYou heard KRS and you said, \"That's preachy!\"\nA wise young man says, \"Father - teach me\"\nA foolish young man wants to live life freaky\nOh yes, Knowledge does Reign Supremely\nWhen I said it eighty-nine you didn't believe me\n\nNOW YOU'RE FUCKED! .. that's right\nNOW YOU'RE FUCKED! .. life is over, finished, done\nNOW YOU'RE FUCKED! .. better heed that, read that\nNOW YOU'RE FUCKED!\n\n[Verse Two]\nListen - back in the days on the Boulevard of Linden\nBROOKLYN!  Kris was a, metaphysician\nLOOKIN!  For better ways to live without bein\nTOOKEN!  We started our own management and\nBOOKIN!  Makin moves with them live cats on\nFULTON!  I can't even 'member all the dough that we\nTOOK IN!  But you was lookin down on us\nCause platinum never astounded us, so\n\nNOW YOU'RE FUCKED! .. word, like that\nNOW YOU'RE FUCKED! .. ha, you shoulda heed that, you better\nNOW YOU'RE FUCKED! .. y'all was chasin the radio, remember that?\nNOW YOU'RE FUCKED! .. what they givin you back now?\n\n[Verse Three]\nBack when we was all singin \"Monie in the Middle\"\nYou wanted to wiggle, jiggle in a tight skirt and giggle\nEven when outside was brittle, you still had on little\nAnd KRS warned that you'll get played like a fiddle\nNow you havin cravings for pickles cause you pregnant\nAnd don't know where the dad went and you poppin them drugs like Skittles\nWhen the baby is born it's little and sick\nBut it's no riddle, you was movin too quick, huh\n\nNOW YOU'RE FUCKED! .. word, look at this\nNOW YOU'RE FUCKED! .. you shoulda stayed home and read a book\nNOW YOU'RE FUCKED! .. literally, symbolically\nNOW YOU'RE FUCKED!\n\n[Verse Four]\nWhen advice is in your life you need to take it\nCause frankly, everybody ain't gonna make it\nBack in the days we, showed 'em the way\nI put it there in the music but you weren't amazed\nYou would criticize, debate, and basically hate\nBut let it be known I wanted everyone to be great\nBut you would diss and not even try to do better\nWhen we was at the U.N. you said \"whatever\"\n\nNOW YOU'RE FUCKED! .. word\nNOW YOU'RE FUCKED! .. we movin ahead, you still in the same spot\nNOW YOU'RE FUCKED! .. 'member all that back talk, all that?\nNOW YOU'RE FUCKED! .. takin over", "image": "https://images.genius.com/4f300314f4b269cd7479d10c0e1cab7e.1000x1000x1.jpg"}], "artist": "KRS-One"}