{"songs": [{"title": "It Ain’t Easy", "album": "Me Against the World", "year": "1995-03-14", "lyrics": "[Intro]\nKeepin' it real\n\n[Verse 1]\nI take a shot of Hennessy\nNow I'm strong enough to face the madness\nNickel bag full of cess weed laced with hash\nPhone calls from my niggas on the other side\nTwo childhood friends just died, I couldn't cry\nA damn shame, when will we ever change?\nAnd what remains from a twelve gauge to the brain?\nArguments with my boo, it's true\nI spend more time with my niggas than I do with you\nBut everywhere it's the same thang\nThat's the game, I'll be damned if a thang changed\nFuck the fame, I'll be hustlin' to make a million\nLord knows ain't no love for us ghetto children\nSo we cold, Rag-top slowin' down, time to stop for gas\nBeep my horn for a hoochie with a proper ass\nUh, it ain't easy, that's my motto\nDrinkin' Tanqueray straight out the bottle\nEverybody wanna know if I'm insane\nMy baby mama got a mind full of silly games\nAnd all the drama got me stressin' like I'm hopeless\nI can't cope, me and the homies smokin' roaches\n'Cause we broke, late night, hangin' out 'til the sunrise\nGettin' high, watchin' the cops roll by\nIt ain't easy; that's right, it ain't easy\n\n[Hook]\n—easy being me\nWill I see the penitentiary or will I stay free?\nIt ain't easy being me\nWill I see the penitentiary or will I stay free?\nIt ain't easy being me\nWill I see the penitentiary or will I stay free?\n\n[Verse 2]\nI can't sleep, niggas plottin' on me, kill me while I'm dreamin'\nWake up sweaty and screamin'\n'Cause I can hear them suckers schemin'\nProbably paranoid, problem is them punks be fantasizin'\nA brother bite the bullet, open fire and I died\nI wonder why, it's just the way it is, even now\nLookin' out for these killa kids 'cause they wild\nBill Clinton, can you recognize a nigga representin'\nDoin' twenty to life in San Quentin?\nGettin' calls from my nigga Mike Tyson, ain't nothin' nice\nYo 'Pac, do somethin' righteous with your life\nAnd even though you're innocent you still a nigga\nSo they figure, rather have you behind bars than triggers\nBut I'ma hold you down and holla Thug Life\nLickin' shots 'til I see my niggas free on the block\nBut no, it ain't easy, ha ha ha\n'Til I see my niggas free on the block, uh, it ain't easy\n\n[Hook]\nIt ain't easy being me\nWill I see the penitentiary or will I stay free?\nIt ain't easy being me\nWill I see the penitentiary or will I stay free?\nIt ain't easy being me\nWill I see the penitentiary…\n\n[Verse 3]\nLately been reminiscin' about Peppermint Schnapps\nIn Junior High hit the block\nKeep an eye on the cops while d-boys slang rocks\nJust a project kid without a conscience\nI'm havin' dreams of hearin' screams at my concerts\nMe and all my childhood peers\nThrough the years tryin' to stack a little green\nI was only seventeen when I started servin' fiends\nAnd I wish there was another way to stack a dolla\nSold my Impala 'cause these hard times make me wanna holla\nWill I live to see tomorrow? Am I fallin' off?\nI hit the weed and then proceed to say: \"Fuck all of y'all!\"\nAin't nobody down with me, I'm thuggin'\nI can't go home, 'cause muh'fuckers think I'm buggin'\nSo now I'm in this high-powered cell at the county jail\nPunk judge got a grudge, can't post no bail\nWhat do I do in these county blues?\nGettin' battered and bruised by the you-know-who\nAnd these fakes get to shakin' when they face me\nSnakes ain't got enough nuts to replace me\nSittin' in this livin' hell, listenin' to niggas yell\nTryin' to torture 'em to tell, I'm gettin' mail\nBut ain't nobody sayin' much, the same old nuts\nIs makin' bucks while these sluts is gettin' fucked\nThey violated my probation\nAnd it seems I'll be goin' on a long vacation\nMeanwhile it ain't easy… no, it ain't easy\n\n[Hook]\nIt ain't easy being me\nWill I see the penitentiary or will I stay free?\nIt ain't easy being me\nWill I see the penitentiary or will I stay free?\nIt ain't easy being me\nWill I see the penitentiary or will I stay free?\nIt ain't easy being me\nWill I see the penitentiary or will I stay free?\nIt ain't easy being me\nWill I see the penitentiary or will I stay free?\nIt ain't easy being me\nWill I see the penitentiary or will I stay free?", "image": "https://images.genius.com/aa900ef68a5861f06835ba38e4e6d764.640x640x1.jpg"}], "artist": "2Pac"}