{"songs": [{"title": "The New Workout Plan (Lil Jon Remix)", "album": null, "year": null, "lyrics": "[Kanye West]\nYou just popped in the Lil Jon remix of \"The Workout Plan\", and\nAnd 5, 4, 3, 2, 1\nAnd here come the 5 to the 7 and 6\nI dropped out of college, I can't count worth shit\nWhen the album dropped I was dissing this\nNow everybody know this the shit\nPart 2, this the update\nFirst rule: stay away from the cupcakes\nThe second rule is so underrated\nThey claim the song was so degradin'\n\"But shit it's still my favorite\nAnd he ain't talkin' 'bout me though\"\nHello, then who I'm talking about, people?\nOK, whatever you want to believe though\nAnd I even took my own advice\nThis gut ain't nothing these hoes’ll like\nI said, I look like LL\nTook my shirt off, she claimed \"I can't tell\"\nBut never say I can't sell\nPat, where we at right now, 3 mil?\nWho the best? Who the best now?\nOK leave me out of it\nTell me who the rest now?\n\n[Hook]\nIt's been a week without me\nAnd she feel weak without me\nShe wanna talk it out but\nAin't nothin' to talk about\n‘Lest, she talkin' about freakin' out\nThen maybe we can work it out\nWork it out\nWork it out\nWork it out\nWork it out now\nMaybe we can work it out\n\n[Verse 2: Kanye]\nOh girl your silhouette make me wanna light a cigarette\nMy name Kanye from the Jigga set Twista said... said... said...\n\n[Verse 2: Twista]\nWhat ‘Sup Lil mama [?]\nThey call me the twista, now work that Motha'Fucka\nBut not to hard, baby you can do what you do\nCause i like a fat ass, but [1?]\nSo, if you could drop it to the floor go and [?]\nSo, its crush time, Shawty show me you can do so\nGon’ Work it, put down the philly steaks\n[?]\nI know you love how my lexus ride\nBut get them with them legs, don’t flex them thighs\nYou know want it, don’t testify\nTry my New Workout Plan called Sex-ercise\nThat’s real\n[Singing]\nYou don’t wanna go a day without me\nShe don’t really wanna lay without me\nI know you love when i’m workin' it in now, baby we can work it out\n\n[Hook]\n\n[Verse 3: Farnsworth Bentley]\nB-E-N-T-L-E-Y\nYee ain't know, you betta ask somebody\nWhat we gonna do is twirk that body\nAll day at they fitness party\nLock them doors, don't tell nobody\nGentlemens in the Gentlemen's Club\nAnd hitting them with an interesting dub\nIt's upside down that for the A-Town\nWhat...y'all...sayin?\nF.J. Bentley caught misbehaving\nYes I'm the captain and I'm saving, all my money\nYes I'm just gonna...stand...and watch you dance from over here\nMatter fact pass the Couvorsier\nBut I will walk you to your car my dear\nCheers\n\n[Outro: Luke]\nWork it out, work it out, girl", "image": "https://i.genius.com/ed07f71d33c6999b4be9a09b816fddbae9e23e50?url=https%3A%2F%2Fwww.discogs.com%2Frelease%2F9883279-The-College-Dropout-Special-Edition%2Fimages"}], "artist": "Kanye West"}