{"songs": [{"title": "Robbin’ Hood (Cause it Ain’t All Good)", "album": "Bootlegs & B-Sides", "year": "1994-11-22", "lyrics": "\"My job is to tell it like it is..\"\n\n[Ice Cube]\nSee who the fuck I'mma jack today\nNigga broke, shit\nAnd it's early in the mornin\n\n\"Today I'm going to tell you the story of Robin Hood\"\n\n[Ice Cube]\nAt last, grab my ski-mask out the closet\nNow let's see how big did my balls get?\nI brush my teeth - it takes a thief\nSwervin, cause I'm tryin to roll up the chronic leaf\nAt a stop sign, I take a hit and hold it on\nI cough (*cough cough*) now I'm off\nDrivin down the two-lane highway\nIt's all bad, thinkin bout shit I never had\nPass through the W.S. (neighbor-hood)\nKnowin I can do my best in Westwood\nCut off by a white BM, driven by a yuppie\nHe sticks up his finger like, \"Fuck me\"\nNow I gotta to follow him HOME, with my CHROME\nSend him to the Twilight ZONE, it's ON\nNiggas say I'm gone cause I'm fuckin with the rich\n(say what?) but they all full of bitch (yeah)\nDon't need a snitch, so I'm rollin solo\nIn a straight bucket, no it ain't a low-low\nHe pulls up to a seven bedroom, eight bath\nOh yeah! He's got to feel the wrath\nPistola to the neck, devil turn off the Westec(?)\nAnd when you're rollin have mo' respect (bitch)\nTied his ass up and took everything I could\nA nigga straight robbin, mobbin, back to the hood\n\n[Hook: Ice Cube]\nAll my niggas love the adventures of\nAll my niggas love the adventures of\nAll my niggas love the adventures of...\n.. Robin hood, cause it ain't all good\n\n[Ice Cube]\nSince two-eleven is my favorite number\nFuck squabbin, cause I be Robin like the Boy Wonder\n\"Holy Bandit!\" Leave yo' ass stranded and you know that\nUnhook the LoJack, cellular phone under the flo' mat\n(Uh) They wanna say that it's federal\nActin like your ninety-five Coupe, is headed fo'\nBeirut they wanna shoot me like a terrorist\nBut I don't give a FUCK, cause I'm takin care of this\nTrigger finger got blisters\nHeard from your sisters, you be rollin on the twisters\nNow when we meet, I can make your heart beat..\n.. and make you feel, so neat\nOr you can get us fifteen\nTwenties out the ATM, I'll take all of them (give 'em up)\nI'm king of the slim jim, it's the incredible\nNine-oh-two-one-oh, is where I'm headed foe\nDon't need no Merry Men, I fuck around and bury them\n(POW!) if they told, what I stole (uh)\nMotherfuckers got to know that I'm lethal\nSteal from the rich, and slide it to my people\n\n[Hook: Ice Cube]\n\n[Ice Cube]\nI stalk, rich ass people like Hudson Hawk\nBitch don't talk, let's take a walk\nNigga got nuttin to lose, you know the rules\nThe purse and the jewels or the eleven o'clock news\nWhich one? Magnum gun to the titties\nMakin scared devils, move from my city\nWith the strong-arm, fuck the long arm of the law\nBitch count to ten and forget who you saw (hurry up)\nHad to clock her with the handle, cause\nYour husband's a thief with an S&L scandal\nDon't feel bad if you're stuck up, ahhhh\nNobody move, nobody get - shut the fuck up!\nI'm nervous, quick to serve this\nHeat in yo' meat, make your blood skeet\nA nigga just tryin to get on his feet\nSo hurry up rich bitch, before I twitch\nShe said, \"Don't rape me, and don't kill me\"\nNigga don't want to fuck, yo' filthy ass\nJust give me the cash and we good\nAll I wanna do is rob you on my way to the hood\n\n[Hook: Ice Cube]\n\nAll my niggas love the adventures of\nAll my niggas love the adventures of\nAll my niggas love the adventures of...\n... Robin Hood, cause it ain't all good", "image": "https://images.genius.com/bd986178756b67188db2d06a77696b78.1000x1000x1.jpg"}], "artist": "Ice Cube"}