{"songs": [{"title": "Or Nah", "album": "Blood Moon: Year of the Wolf", "year": "2014-06-30", "lyrics": "[Produced by Dre]\n\n[Intro: Too $hort]\nDon't fight the feelin'\nThat's right, don't fight the feelin'\n\n[Verse 1: Game]\nSay my life is like a movie, nigga fuckin' every day\nFuckin' every day, nigga fuckin' every day\nSay my life is like a movie, nigga fuckin' every day\nMissionary, doggystyle, nigga fuckin' every way, go\nI'm not the nigga you thought that\nThat trickin', we off that, I hit that, no callback\nShe ratchet, I like it, I hold it, she bite it\nShe lick it and suck it, I fuck it, he wife it\nNo feelings for a ho, that ain't my main thing\nMy niggas on the same thing, all my niggas gang bang\nBitches do too, this is my boo\nTwo C's on that bag but she throw up Piru\nAnd we off that Cîroc, she don't mind if I do\nHer girlfriend a thot, tell her hop in my coupé\nTell her hop in my bed, tell her hop off my roof\nMy baby mama trippin' and that bitch can shoot but\n\n[Hook: Game & King Marie]\nYou gon' let me hit or nah?\nCan I get the dick or nah?\nYou gon' let me watch you strip or nah?\nCan a bitch get a fit or nah?\n\n[Bridge: Eric Bellinger]\nGirl once you get it, you got it forever\nOh nah, so let me hit it\nGirl once you get it, you got it forever\nOh girl, so let me hit it\n\n[Verse 2: Eric Bellinger]\nIf you let a nigga come through\nI'm give it to you better than you ever had it\nGirl, I promise, I'm a be the only thing you want to do\nMakin' you forgot about your niggas automatic, you already know\nI can fuck you better (beitch!)\nCan we live together?\n\n[Verse 3: Problem]\nIt's a problem, bitch you better follow me\nI give you this dick, you hit the lottery\nI know all the stars, astrology\nLast deposit fucked up the whole economy\nGettin' it, spent twenty-ten pitchin' it\nKush, piff in it, every white string infinite\nYou different, last night, niggas picturin'\nSeven times, had a black chick tryin' white shit\nFederline, I’m the future, real beef, I’ll shoot you\nWalk-walk, no talk-talk, no sub and no woofers\nIt's on (on) tell by my tone (tone)\nReal nigga call, better answer your phone\nBeitch!\n\n[Hook: Game & King Marie]\nYou gon' let me hit or nah?\nCan I get the dick or nah?\nYou gon' let me watch you strip or nah?\nCan a bitch get a fit or nah?\n\n[Bridge: Eric Bellinger]\nGirl once you get it, you got it forever\nOh nah, so let me hit it\nGirl once you get it, you got it forever\nOh girl, so let me hit it\n\n[Verse 4: AV]\nYou gon' be a nigga bitch or nah?\nYou gon' let a nigga hit or nah?\nWhat you sayin'? Know you're with it so why you playin?\nBitch you better fuck a rich nigga while you can\nI be on one, two C's for the city\nI'm on, I got Crip and Blood niggas with me\nWait up, just tell me you with it and let me get it\nBaby you can skip the bullshit and let me hit it\nThree pills down, got me rollin' like Nip\nKeep playin' games but you know that you a flip\nHold up, bitch quit playin' and give it up\nYou gon' let a nigga hit or what? What's up?\n\n[Hook: Game & King Marie]\nYou gon' let me hit or nah?\nCan I get the dick or nah?\nYou gon' let me watch you strip or nah?\nCan a bitch get a fit or nah?\n\n[Bridge: Eric Bellinger]\nGirl once you get it, you got it forever\nOh nah, so let me hit it\nGirl once you get it, you got it forever\nOh girl, so let me hit it\n\n[Outro: Too $hort]\nDon't fight it baby, don't fight the feelin'\nYou know a nigga tryna fuck\nI like that bitch, yeah baby\nYour pussy wet? Take them panties off\nDon't fight it, let a nigga hit that shit\nYou like to fuck? All these bitches love fuckin'", "image": "https://images.rapgenius.com/d55dbb940ab0304045067e0d293dd59c.600x600x1.jpg"}], "artist": "The Game"}