{"songs": [{"title": "Rasta Imposter", "album": null, "year": null, "lyrics": "Intro:\nWhat you got to do with it? What the fuck you talkin about?\nWhat the fuck you got to do with it? You stupid nigga? You stupid?\nDid you see that video, nigga? Fuck wrong with you? Like you don't\nYou don't know what you go to do with it. Like your fuckin insane or\nSomething. (You fuckin wack ass nigga)\n(laughing in background)\n\n[Verse One]\nY'all faggots is weak, y'all starstruck niggas think shit is sweet\nThat busy signal bullshit is dead up in the street\nHeard that garbage dough jam, made me reminisce\nOn when heard your man's wack shit and went to take up his\nJealous faggot man cause I'm richer than y'all\nWhen I load my desertees, I'm picturin y'all\nOn the streets of Queens where I was raised and born, hardcore\nAnd stood on every corner like a liquor store\nClips full of hollowtips, follow loose lips\nAimin at your clique and make em cough up my chips\nBitch, ya niggas wanna see if I'm ill?\nWanna see how many rappers can be killed, how much blood can spill?\nWhen I inject this lyrical drill, if I can't do it, the dumb-dumbs will\nTell that nigga to tell his man to tell that nigga\nI send the wolves to kill that nigga\nIf you wanna know why, its cause I'm still that nigga\nMichael Jordan of all this rap shit, pullin the trigger\nWhat the fuck? You on a mission to self-destruct\nAnd have the nerve to let the chickenhead model cluck\nYour swervin nigga, better follow the white lines\nYour up on the sidewalk, off course, read the sign\nI'm so ill, y'all niggas is so wack\nYour whole crew is such, y'all lack the hard impact\nFar as your man go, I got young niggas that wanna get him\nTreat him like a Philly, wet'im and split'im\n\nChorus\nL.L. don't lose niggas, we can do it however you choose nigga\nOne on one or round up the crews nigga\nBut Can-I-Blast you out your shoes nigga\nYou know the rules nigga!\n*repeat*\n\n[Verse Two]\nQueens shit, give me cream so I can grab my dick\nSew that shit, what the fuck y'all niggas workin with?\nBackwards, ass-jerk, jumpin up out the woodwork\nRidin my meat, tryin to critique my physique\nA real nigga wouldn't even mention my lips\nCan't believe you went there, no I know you a bitch\nSugar-coated nigga, deep-throated nigga\nYoung guns take a pull before they quote a nigga\nYeah, I wrote it nigga for all my real live devoted niggas\nI'm a true and livin lyrically ill poet nigga\nSo what you talkin bout? That shits supposed to be hot?\nY'all niggas on the warpath, y'all takin over my block?\nI think not, matter of fact your not aloud to rap no more\nAnd if you hear this in the club sneak out the backdoor\nAnd if you bumpin in your ride make sure your windows is up\nAnd your tint's passed the limit\nSo they don't know a faggot's in it!\nI'm L.L. and I did this to you\nTeflon waitin for every nigga runnin with you\nRhymes hit you, lace you up again and split you\nNiggas ain't official thats why Mom Dukes miss you\nTell your man bring it on, I'm only gettin warm\nNever die, never quit, and my money's long\nPunk ass crab nigga, talkin bout his lips\nConstantly involvin my name with that bullshit!\nWhy I diss you? You stepped up in the ring\nIce jinglin in the video like you the next Don King\nAnd tell your man I know he got some lyrics in the stash\nBut I'm the best that ever did it, now get this motheruckin ass\nMic's too hot to hold, leave it in the sand\nSo I can describe the picture with both hands\nYou must not understand who's in command\nI got all the flavor, but y'all niggas is mad bland\n\nChorus\n\n[Verse Three]\nI'll cut your fuckin head off and leave it on your mom's dresser\nThen pay the pope a hundred thou to go and bless her\nYou wanna test a lyrical teacher and professor?\nI bet y'all niggas fall off now that your under pressure\nI don't stress ya, yet still I must check ya\nExtort niggas for gettin fucked up, stop and inspect ya\nFuck wrong with you nigga? You can't do nothin to me\nIf I put a slug in you on the low, you'd probably try to sue me\nYour girl blew me, I said \"Now!\" She said \"Do me\"\nBust a nut in her face on tape to let the crew see\nCan't put dirt roll, nigga poppin shit\nUnderestimantin what Queens niggas'll do for chips\nI originated all this shit\nThe ice, the champagne, the bitches on the dick\nThat really don't apply to you crabs in a barrel\nMic's my staff sendin you a message like Pharaoh\nLeave it alone or get swallowed in the sea\nThe King of Hiphop is something you could never be\nMy crown you'll never see, I'll rule forever, G\nI'll be goin platinum when you just a memory\nI'm the double L, capital C, double O\nWith the seven upside down jakes slayin the clown\n\nWhat the fuck wrong wit y'all niggas? You out your mind nigga?\nYou better try to go beg Lauryn to come back or something\nFuck wrong with you?\n\nChorus\n\n______________________________________________________", "image": "https://images.genius.com/9e00cf56336ec8915e2fa3b2b2e7502d.377x377x1.jpg"}], "artist": "LL Cool J"}