{"songs": [{"title": "Black Cocaine", "album": "Black Cocaine", "year": "2011-11-21", "lyrics": "[Intro: President Richard Nixon]\nAmerica's public enemy number one, is drug abuse\n\n[Verse 1: Havoc]\nPay attention, everything I mention's a jewel\nAll I gotta do is whisper to make the fetti move\nThe Constitution I go by, cash rules\nEverything around me, through movements' grass roots\nStarted from the bottom, bottom of the pyrex\nHand in hand until that money went high tech\nKeep a ledger in the macbook\nThe crystal ball to us was watchin’ the crack cook\nForseen undisclosed amounts\nBentleys, Ferraris, overseas accounts\nMajor assets, forgot my address\nGot too many of 'em, I don't believe I can have stress\nAnd I’m straight from the projects\nNiggas gotta heart, but we don't got a conscience\nBut I gotta complex, I don’t ever wanna be a bum\nSo I’m counting money 'til my fingers go numb\n\n[Hook]\nBlack, black, black, black, black, black cocaine\nBlack, black, black, black, black, black cocaine\nBlack black black, black, black, black, black cocaine\nBlack, black, black, black, black, black cocaine\n\nBlack black black, black, black, black, black cocaine\nBlack, black, black, black, black, black cocaine\nBlack black black, black, black, black, black cocaine\n\n[Verse 2: Prodigy]\nAsk around who’s laid up, sharp and straight up, Maffiosi\nThe most infamous dangerous rappers on the earth surface\nI serve purpose, I don’t bullshit with it when I spit it\nLeave a burn like the alien blood in this age of Aquarius\nFear me not, I’m here to guide you through the various stages of changes and consciousness\nHigh of the life and haze, am I a hypocrite?\nChunky black with cat piss, call it Wiz Khalifa\nSwinging trees like Tarzan and Latifah\nGot me hide in sun, moon, stars and wheezy\nAll the hash smell, hoes in ya clothes be easy and\nClose ya eyes while I rhyme these lines\nThese black cocaine lines\nNow picture me in ya mind\nAt the concert live\nWe well worth the ticket\nA 120 minutes of ya favorite P lyrics\nYeah that dirty New York, reality rap, that Mobb shit\nClassic like Biggie, but we fresh like Minaj is\nNow who you know got a flow so timeless?\nWho write about more than just cars and diamonds?\nIt’s more than just whatever new gun's in style is\nProdigy the brainiac kid\nWord to baby Jesus\nThis baby faced genius is lasted so far for 80 seasons\nWhat makes you believe that I will stop now\nAnd allow Mobb Deep to collapse to the ground?\nYou crazy? I even make that thought get up?\nWipe the dirt of and come again, his is not luck\nThis is hard work, dedication an passion\nYou just a flash in the pan\nWe endless and everlasting\n\n[Hook]\nBlack, black, black, black, black, black cocaine\nBlack, black, black, black, black, black cocaine\nBlack black black, black, black, black, black cocaine\nBlack, black, black, black, black, black cocaine\n\nBlack black black, black, black, black, black cocaine\nBlack, black, black, black, black, black cocaine\nBlack black black, black, black, black, black cocaine", "image": "https://images.genius.com/5945bace329c1b4f5c6557717eb01acb.316x316x1.jpg"}], "artist": "Mobb Deep"}