{"songs": [{"title": "She’s So Fly", "album": "5.0", "year": "2010-11-12", "lyrics": "[Intro: T.I. (Nelly)]\nSay Mo (yeah bruh)\nYou remember them broads on the strip out in Vegas?\n(Uh-huh, what about 'em?)\nWell, I don't know if I told you or not but (hmm?)\nLil' shawty I was in the back seat with man, you know uhh (uhh, Naomi)\nI ran into her on Rodeo Drive in L.A., and I was like\n\n[Chorus: Nelly]\n(She's so fly)\nShe's outrageous, I met her out in Vegas\nShe fresh off the pages of a magazine, I said\n(She's so fly)\nShe like eye candy, I can't stop starin'\nI'm like goddamn, I got to have you girl, because\n(She's so, fly)\n\n[Verse 1: T.I.]\nHey, hey, hey\nLook at shorty hoppin' out that Maserati\nIn them Giuseppe Zanotti's and that bangin' ass body\nIn them low cut Frankie B's with the panties peekin' out 'em\nWith a booty that big, and her stomach rock solid\nOn Rodeo Drive, walkin' in her Roberto Cavalli\nI should probably walk up to the register and say \"I got it\"\nGo and pick up what you want, it's nothin' ma, don't worry about it\nThat bag should be carried by somebody so exotic\nAnd that dress should be worn when there's nothin' else up under\nJust in case I run into you I can pull up to your bumper\nShe politely declined when I offered her my number\nThen I asked her what's her name, said she'd rather make me wonder\nSo I paid and she laughed, carried out her bags outside\nAnd I couldn't get her ass, I tried\nAs I watch her leave out the store\nHow one man wanted shorty ass and more, for sure\n\n[Chorus: Nelly]\n(She's so fly)\nShe's outrageous, I met her out in Vegas\nShe fresh off the pages of a magazine, I said\n(She's so fly)\nShe like eye candy, I can't stop starin'\nI'm like goddamn, I got to have you girl, because\n(She's so, fly)\n\n[Verse 2: Nelly]\nShorty harder than Cialis\nSee my hand, got the money countin' careless\nCouldn't find a bigger star than in Dallas\nAnd the Pistons ain't the only one with rings in The Palace\nDo your research, tell me your analysis\nTake a jet and make you wonder where you land like Alice\nTell me shorty ain't the baddest\nTell me shorty don't deserve to rock the runway in Paris (woo!)\nShe deserve it all\nI don't do the mall, I do it by catalog\nLa Perla panties and bras, fuck buyin' at the bar\nI fuck around and buy this whole club by tomorrow\nSee, she's so nice\nShe can get whatever she likes\nDon't let the price make you mad\nI live a Fabolous life, shorty, Throw It in the Bag\n\n[Chorus: Nelly]\n(She's so fly)\nShe's outrageous, I met her out in Vegas\nShe fresh off the pages of a magazine, I said\n(She's so fly)\nShe like eye candy, I can't stop starin'\nI'm like goddamn, I got to have you girl, because\n(She's so, fly)\n\n[Break: T.I. & Nelly]\nYeah, yeah, yeah, yeah, so\n(She's so flyyyyyy)\nWhat? Ha, yeah, yeah\n(She's so fly to me) look at her\nUhh, hoppin' out that Rover, hey\nIn them Louie loafers, hey\nI just wanna hold her, yeah, yeah, yeah, yeah\n(Closer to me, closer to meeeeee) WOOOO!\n\n[Verse 3: T.I. & Nelly]\nAy, we in Vegas on the strip and seein' vision\nAnd precision lookin' like a straight star, UHH!\nWith the buttons undone, showin' off her lace bra\nHer partner in the back, told us both hop in they car\nOkay, (?) in L.A., she say I got her to the mall, ha\nSo, we hopped on in and we rolled out there\nWe walked on in and we showed out there\nIt's the King and the One with the dough out hurr\nWe can blow out hurr, 'cause she's so fly\n\n[Chorus: Nelly]\n(She's so fly)\nShe's outrageous, I met her out in Vegas\nShe fresh off the pages of a magazine, I said\n(She's so fly)\nShe like eye candy, I can't stop starin'\nI'm like goddamn, I got to have you girl, because\n(She's so, fly)\n\n[Outro]\n(She's so, fly)", "image": "https://images.genius.com/3455d80c0949060bbaa5eccb85982765.900x900x1.jpg"}], "artist": "Nelly"}