{"songs": [{"title": "Ariel", "album": "The Slim Shady LP (Snippet Tape)", "year": "1999-01-01", "lyrics": "(dialing tone)\n\n(Hello?)\nHi, this is Ariel?\n(This is)\nThis is Marshall\n(Listen, I'm in a serious-)\nDon't hang up!\nGod... Are you gonna leave me too?\nAriel... Hi (What's up with you?)\nI'm sorry, I'm s- (What’s your nationality?)\nI'm sorry, uh-I'm a-I'm a white male\nSingle now,sorry, what should I do, Ariel?\nAre you gonna leave me too?\nEverybody's left me (If I'm gonna leave you?)\nYes (Tell me, what's up with you?)\nI'm sorry, I-I, you know?\nShe comes in, from work late\n(Your girlfriend?)\nShe comes in at late last night, okay?\nI don't know where she's at\nAll I know is that she's got these little, like\nRed marks on her neck\nI'm like \"Are those hickeys?\"\n\"No, these aren't hickeys\" I'm like\n\"You've been fooling around, I can't have it you\"\nShe's done this to me before\nI wish you could just, help me, like\nI don't know, I'm-I'm kinda horny\n(Huh? I'm listening) I've got candles lit\n(What?) Candles, I've got candles, and got\nThe music playing, like a-- Can you hear it?\nThe music? (Why do you [?])\nThe mu-the music... oh, sorry (Just tell me why)\nI don't know, I'm just horny\nI need it-I don't know\nI don't know if I need to just, like, jack off\nOr like have sex with my girlfriend when she comes\nI don't know anymore, you know? I'm just\n(Relax) What? ([?] I think you're going crazy, 'kay?)\n(Just take a bomb, okay, and go to sleep)\n(And stop calling people and crying) A bomb?\n(Uhuh) You want me to swallow a bomb, Ariel?\nYou want me to kill myself, right here, on national TV?!\n(National TV? What's (stuttering and laughing)\nI-I'm what? I don't understand, is that spanish or something?\nI don't understand, what are you-\nYou know, I'm just an english regular guy, I'm a white kid, okay?\nI grow up, you know\nI don't know, oh my god... You know what?\nIf you're not gonna jack me off, you fucking slut\nYou can suck my dick, you fucking whore", "image": "https://images.genius.com/0b1c9568017c50ed4a1b0e810ff2a60c.480x360x1.png"}], "artist": "Eminem"}