{"songs": [{"title": "Too Much", "album": "Killer", "year": "2008-07-01", "lyrics": "[Intro: Tech N9ne]\nFrom the deepest darkest part of misery\nNever seen before\nNever heard before\nTalent beyond this world\nBow down for royalty\nTech N9ne the King\nKrizz Kali the Czar\nKutt Calhoun the Prince\nToo much to comprehend\n\n[Bridge: Krizz Kaliko]\nIt's not quite enough for me\nBut anyone with eyes can see\n\n[Hook: Tech N9ne & Krizz Kaliko]\nToo much for ya\nToo much\nToo much for ya\nToo much\nToo much for ya\nToo much\nToo much for ya\nToo much\nToo much for ya\n\n[Tech N9ne]\nPrepare for the ending\nThis is the pinnacle\nAll hail the king\nTech N9ne\n\n[Verse 1: Tech N9ne]\nAin't nobody better, we comin' clever than ever\nGoin' head up with competitors and levelin' 'em\nWe put 'em through the shredder\nWe got the lever to sever any brethren\nWho steppin' with the devil in 'em\nI'm sick of everybody thinkin' they ready for the work of a killa\nAnd feelin' they ill and not sayin' a thing\nGotta give it up when the skill is incredible\nDeath is inevitable if you got trouble obeying the king\nI guess when I bust I'm too much for ya\nI cuss when I must I'm too rough for ya\nTecca N9na when I'm flowin' it's a rush for ya\nOther rappers on the planet you a customer\n'Cause you buy it and bite on me put your recorder right on me\n'Cause you really ain't the shit and you stuck in debris\nNow the people got the light on me I'm about to fight on the mic\nAnd you knowin' ain't nobody fuckin' with me\nAutomatically haters be mad at me\nWhen I be rippin' it niggas get to trippin' 'cause I'm livin' it up\nGot the industry in the palm of my hand\nAnd I promise I can’t offend a fan when I say I'm not givin' a fuck\nI'm 'bout the music and doin' it, when the people they ruin it\nWhen they miss it, it be drivin' me crazy\nI'm different and people they call me evil and devil\nI'ma let 'em see the level of animal it made me\n'Cause I don't give a fuck, I just bust your crew up\nLeave 'em in the dust, and must chuck the deuce up\nN9na, Krizz and Kutt we upchuck the new stuff\nNever can ya touch or crush us we too much!\n\n[Bridge: Tech N9ne]\nWhy do we even do it when you don't get it?\nIt's like beatin' a dead fuckin' horse\nConstantly givin' you elite shit\nAnd only a handful of you get it\n\n[Hook: Tech N9ne & Krizz Kaliko]\nToo much for ya\nToo much\nToo much for ya\nToo much\nToo much for ya\nToo much\nToo much for ya\nToo much\nToo much for ya\nToo much\nToo much for ya\nToo much\nToo much for ya\nToo much\nToo much for ya\nToo much\n\n[Bridge: Krizz Kaliko]\nAnd I can paint a picture of words\nSo if you understand what you heard\n\n[Verse 2: Kutt Calhoun]\nSayin’ that you want it\nI’m thinkin’ that we way too much for ya\nSettin’ the bar that we 'bout to raise too much for ya\nDolby and Digital, gotta pay some bucks for tha\nClarity and the intricate spray (Bladdah! Bladdah!)\nHowever they want it man I'ma hit 'em with the bidness\nBlood maybe could be the reason you b-b-begun trippin'\nA lot of forgotten, too busy, rottin’ in mud rivers was niggas\nWho got it twitted thinkin’ they thug niggas\nBLEVE and Mountain Dew outta my bodily\nCity of fountains, you think you hard but you hardly\nCompared to a rare brother, I swear there no nothin' nadda\nCan weather a liz-thiz-izzle weapon like Dan Glover\nDangerous with this flow\nCome and cut you like I'm a\nInsane, a beast in beast mode\nAnd know you fucking with the\nMangled beast, the sheets show\nAnd I'll be motherfucking\nDamn, the pieces he sold\nI'm too much for ya\n\n[Outro: Tech N9ne]\nI don't give a fuck I just bust ya crew up\nLeave 'em in the dust and must chuck the deuce up\nN9na, Krizz and Kutt we upchuck the new stuff\nNever can you touch or crush we too much N9na\nKali and Kutt, ain't nobody fuckin' with us!", "image": "https://images.genius.com/ce6124bde0d76994fd0d3a8ddb1d4e97.1000x994x1.jpg"}], "artist": "Tech N9ne"}