{"songs": [{"title": "My Swag", "album": "T.I. vs T.I.P.", "year": "2007-07-03", "lyrics": "[Intro: T.I.]\nYou gotta get your swagger together nigga (ay)\nGet your suit fitted (ay)\nStarts on the inside, ya dig?\nI don't need mine, I got cribs where we goin (okay)\nIf you don't love yourself you can't love nobody\nKeep up nigga (okay) I love myself\nYou gon' need to travel ladies, you go and got that mack diesel right\n\n[T.I.]\nI'm the man from Atlanta, to way out in Cali\nCatch me in New York, I'm on the way to Miami\nI be in Hawaii, then catch me in Paris\nI be at home barely, I'll sleep when I'm buried\nWhat I need some sleep for? This dope got me geeked up\nI went to Japan and made a mil' in a week bruh\nThese niggas can't keep up when they see me in London\nOr out in Ibiza, that time I ain't sleep for\nBout three days maybe, you see me in Haiti\nWith Wyclef Jean and a selection of ladies\nBut my folk got that work in like they back in the 80's\nSee the money's what move me, conversation don't phase me\n\n[Hook: Wyclef Jean] + (T.I.)\n(Tell 'em why cause I) Been around the worrrrrld\nTraveled the seven seas (and I be)\nPoppin bottles with celebrities (so you can find me)\nFlyin high, smokin better trees (ay, oh-ay-ay)\nGirls around the worrrrrld (yo, yo)\nThey keep callin me (they call me)\nPaparazzi they be follow me (they all be)\nHopin that they get a shot of me\nIt's my swaaaaag (they wonder what's so special 'bout him)\n(Why they ain't sellin records like him, tell 'em)\nIt's my swaaaaag (how he always look so cool)\n(That why e'rybody do what he do, tell 'em)\nGotta be my swaaaaag (they wonder why he wear his hat like that)\n(When girls see him why they act like that, ay, I don't know)\nIt's my swaaaaag (for some reason all the real niggas love him)\n(Even though they girlfriend wanna fuck him, I guess)\nGotta be my swaaaaag\n\n[T.I.]\nGettin money in Frisco, wearin my raincoat\nSee I'm gettin wet, and this bitch in the same boat\nI came in the game slow, they act like they ain't know\nThat I wasn't gon' leave until I got what I came fo'\nI still can't complain though, as long as I ain't broke\nI came a long way but shawty ain't nuttin changed though\nI still let the tool go, don't get it confused bro\nRun up on me wrong, now what you think I'mma do bro?\nSend you to your maker, then go to Jamaica\nOr either to Cabo, I chill at my condo\nMy swagger is perfect, hatin on me ain't worth it\nGuarantee you boy, the Earth my turf, if it hurts\n\n[Hook]\n\n[T.I.]\nRegardless what haters say I'm as real as they come\nI'm chasin that paper baby however it come\nFrom singing this song to moving yay by the ton\nI bet you never seen a nigga gettin money so young\nHow I get from the pen', all the way to Berlin\nI've been to Switzerland skiing and pimp I'm goin again\nIt ain't nuttin to catch me in the south of France\nIn a coffee shop smokin dro in Amsterdam\nAnd ain't nuttin to fly, all the way to Dubai\nSt. Barts, St. Lucia, any day we can try\nG-5 to Moscow and they say I'mma lie\nI'mma ball like a dog 'til the day that I die\n\n[Hook] w/ ad libs\n\n[Outro: T.I.]\nThis is impeccable pimpin\nYou couldn't duplicate this shit if I told you how to man\nHahhh, y'all niggas keep up\nBy the time you get to Puerto Rico my nigga I'll be in Cuba\nBy the time you get to Cuba I'll be in Haiti\nBy the time you get to Haiti I'll be way over in Africa man\nY'knowmsayin? South of France in my land man\nThe Earth's my turf my nigga {*fades out*}", "image": "https://images.genius.com/2f70d0ed3d87a3cc476cfb530ff86686.600x600x1.jpg"}], "artist": "T.I."}