{"songs": [{"title": "Da Shit", "album": "Doctor’s Advocate", "year": "2006-11-14", "lyrics": "[Intro]\nNow where's the shit?\nThe shit?\nThe shit!\nN*gga whatsup man?\nCome on kill that noise man, let's just get the shit\nDon't worry, you'll get the shit\nYou'll be\nKnee deep in shit!\n\n[Hook]\nI'm a G, you can't see, me\nThat must be, why you're talkin'\n(Shut your mouth bitch)\nI'm the shit, and you know, it\nNever stops, there's no stoppin'\n(It don't stop niggas)\nRidin' low, blowin' smoke, oh\nAs I cruise, the streets of Compton\n(Roll out the '6-4), ('6-trey)\n(Glasshouse), ('5-7 Chevrolet)\n(And tell them niggas)\n\n[Verse 1]\nI'll let the whole world know that I can't be stopped\nEven without Doc I'm still from the (Streets of Compton)\nYeah nigga I said it, and I'mma stay on top\nLike a hoodrat with bomb ass cot\nRun up on 'em like these rap niggas, I ain't gotta clap niggas\nEnd your career with one line, like that nigga\nHit the switch (front and back), make it bounce (let it jump)\nKillaforn-I-A is where I'm from...\nThree-wheelin' with the ass out\nSmoke chronic 'til I pass out\nHoldin' weight at my nigga Daz house\nHe always got a thick bad bitch from Long Beach\nShe a known freak and she got a long reach\nShe gon' touch it, suck it, fuck it\nNever back down, especially when Al Green in the background\nNow bitch, hit the weed and turn that ass 'round\nIt's time to bring back \"Chronic\" and the \"Doggystyle\"\nWest Coast niggas still holdin' shit down\n\n[Hook]\nI'm a G, you can't see, me\nThat must be, why you're talkin'\n(Shut your mouth bitch)\nI'm the shit, and you know, it\nNever stops, there's no stoppin'\n(It don't stop niggas)\nRidin' low, blowin' smoke, oh\nAs I cruise, the streets of Compton\n(Roll out the '6-4), ('6-trey)\n(Glasshouse), ('5-7 Chevrolet)\n(And tell them niggas)\n\n[Verse 2]\nI'm back on the cover of The Source and the XXL\nFloatin' all through the (Streets of Compton)\nI got more bitches, more plaques\nMore beef and more straps\nThat's what the fuck I call gangsta rap\nI was the Aftermath remedy 'til friends turned enemies\nStreets kept me laced like blunts dipped in Hennessy\nYou niggas act like The Game can't roll 'em out\nOne man show, still sell a motherfucker out...\nWith no Dre still sell the motherfucker out\nCause everybody here from the (Streets of Compton)\nWe got Crip niggas, Blood niggas, ese's, asians\nRed and blue laces, tattoos on faces\nI kept you niggas waitin', had to take you back to the basics\nSwitch the Impala from gold to chrome Dayton's\nEverytime your bitch hear my voice she masturbatin'\nI run through hoes like Walter Payton, on the daily\nI got your main bitch swallowin' my babies\n\n[Hook]\nI'm a G, you can't see, me\nThat must be, why you're talkin'\n(Shut your mouth bitch)\nI'm the shit, and you know, it\nNever stops, there's no stoppin'\n(It don't stop niggas)\nRidin' low, blowin' smoke, oh\nAs I cruise, the streets of Compton\n(Roll out the '6-4), ('6-trey)\n(Glasshouse), ('5-7 Chevrolet)\n(And tell them niggas)\n\n[Verse 3]\nI'm the West Coast Rakim, got you niggas blocked in\nGlasshouse parked sideways on the stock rims\nNew-school, old-school mentality\nTranslation - fours pumps and twelve batteries\nHydraulics make the world go round, your girl go down\nChronic make your girl slow down\nBefore she end up like Superhead (uh), givin' super head (uh)\nEvery nigga in the industry done fucked Super Head\n(Shit...) And I just might fuck her too\nIf I ever catch her slidin' or ridin' through the (Streets of Compton)\nRollin' down Green Leaf, smokin' on that green leaf\nWith a Mack 10 like was born on Queens St\nMurder MC's like I was born in Queensbridge\nThat's how I show you pawn niggas where the king is\nAnd you don't wanna play chess on a time clock\nI'm in the Hall of Fame, next to Snoop behind Pac\nI got the whole motherfuckin' world locked\n\n[Hook]\nI'm a G, you can't see, me\nThat must be, why you're talkin'\n(Shut your mouth bitch)\nI'm the shit, and you know, it\nNever stops, there's no stoppin'\n(It don't stop niggas)\nRidin' low, blowin' smoke, oh\nAs I cruise, the streets of Compton\n(Roll out the '6-4), ('6-trey)\n(Glasshouse), ('5-7 Chevrolet)\n(And tell them niggas)\n\n[Outro]\nEverybody wanna know what the fuck is goin' on\nAm I signed to Aftermath, Interscope\nWhat's up with Geffen\nI'mma just say it like this\nOne day I walked in the motherfuckin' house\nAnd all my shit was gone", "image": "https://images.genius.com/8733b8e495bb8c50e53cd1da0aada2cb.1000x1000x1.jpg"}], "artist": "The Game"}