{"songs": [{"title": "Watch", "album": null, "year": "2018-05-04", "lyrics": "[Intro: O'Shaughnessy Hartley  & Lil Uzi Vert]\n…because it's the last ride ever gonna\nThat I'm ever gonna take at Astroworld\nWoah, woah, yeah, yeah, yeah\n\n[Chorus: Lil Uzi Vert]\nLook at your Rollie, uh, look at my Rollie, uh\nThat's a small face, uh, this a big face, uh\nShe can't see my room, fuck her in the hallway\nGettin' bored with this money, count it all day\n\n[Verse 1: Lil Uzi Vert]\nYeah, they thought we were soft, boy, you learned the hard way\nNot with all the talkin', turned it to a closed case\nLook, bullets got duller, and it's vanilla\nAll white, that Plain Jane, yeah\nThe rose gold one better, hundred or better\nI took the money and flooded my bezel\nYou diamond to rock, computed the settin'\nVVS diamonds, they pop just like kettle\nI popped a molly to get on my level\nRockin' that Ricky and Raf, here my sweater\nYeah, Patek Philippe, it cloudy like Heaven\nMet her at 10, fucked that girl at 11\nFake diamonds in your Rollie, how you reckon?\nDiamond tester, nigga, you better check it, yeah\n\n[Chorus: Travis Scott]\nLook at your Rollie, uh, look at my Rollie, uh\nThat's a small face, uh, this a big face, uh\nShe can't see my room, fuck her in the hallway (yeah)\nGettin' bored with this money, count it all day\n\n[Verse 2: Travis Scott]\nOn the south side of town gettin' me a bald fade (yeah)\nPass her some stuff, we can down it all, take (it's lit)\nNo, can't trust her, she gon' leave us all laced (laced)\nBust a bankroll in the club, where's Chase? (yeah, yeah, yeah)\nLike woah (yeah, yeah, alright)\nYeah, they really want my soul (yeah), that can never go (straight up)\nAngel in the snow (white), always leave me cold (ice)\nLeave it on the floor (what?), but she's slidin' from the pole\nLike woah (yeah, yeah, yeah)\nReally on speed (yeah, cash), you and ivory is all I need (skrrt, skrrt)\nAll agreed, we gon' skip the tees, go bare like trees (trees)\nIt's stuck in heat, link up with the dawgs and then we flee\nWay this summer goin', I might start my summer league (league)\nEvery young nigga get a check and get a team\nYeah, man's on the front line 'cause man's on his deen (yeah)\nNo small faces, it's just an AP beamin' (yeah, yeah)\n\n[Chorus: Travis Scott & Lil Uzi Vert]\nLook at your Rollie, uh, look at my Rollie, uh\nThat's a small face, uh, this a big face, uh\nShe can't see my room, fuck her in the hallway (yeah)\nGettin' bored with this money, count it all day\n\n[Bridge: Kanye West]\nLook at my Rollie, look at your Rollie\nYour shit rockless, my shit hockey goalie\nYou should gon' hide it, man, it's too bad\nLike a bald nigga still wearin' du-rags, ha\n\n[Verse 3: Kanye West]\nIsraeli guards, boy, please be mindful\nDon't have words with me 'cause I got a mind filled\nI could tell Larry David was the mind behind Seinfeld\nWanna know how I feel? Step into my minefield\nWanna know how pain feels? I got off my main pills\nBet my wifey stay close, she know I'm on my Bezos\nOpioid addiction, pharmacy's the real trap\nSometimes I feel trapped, Jordan with no Phil Jack\nOne year, it's Illuminati; next year, it's the Sunken Place\nThey don't want me to change, nah, nigga run in place\nI need someone else to make this drink, because\nYou don't understand the juice to vodka ratio\nThat could satisfy a real drunk, guess what?\nNever trust a bartender that don't drink, bitch\n\n[Outro: Kylie Jenner]\nWe have bust down Rollies, bust down Piguets\nAnd I told him I needed him to bust down our new baby", "image": "https://images.genius.com/d695eb890f4d8860e5208e7c4bf0432f.1000x1000x1.jpg"}], "artist": "Travis Scott"}