{"songs": [{"title": "Take Kare", "album": "Slime Season", "year": "2014-10-15", "lyrics": "[Intro: Lil Wayne & Young Thug]\n(Take care of her)\nNow\nYoung Moo–, Young Moolah, baby\n(Take care of her)\nYoung Moo–, Young Moolah, baby\n(Take care of her)\nRich Gang\n(Take care of her)\nWe got London on da Track\nHey!\n\n[Verse 1: Young Thug]\nBoolin' at the basketball game (Boolin')\nDressed in Balmain (Fresh)\nDropped a hundred on the whole thing (And what?)\nInside cost a whole thing (And what?)\nAnd I'ma give you my all, first my whole name (Oof)\nI'm in her mouth just like Colgate (Ahh)\nI'm really feelin' super, like eight (Whew)\nAyy, hey (Hey)\nLike or hate, ladies man like bait (Woo)\nHop inside a Bentley with a red paper plate\nEvery time they hate, I throw them bands like a bouquet (Woo)\nI ain't Ray J but you can be my Kim K (K)\nFeelin' like Lil Flip, in love with green, don't look gay (Ooh)\nI'll never believe what Lil' Kim say (Ooh)\nWater like Phelps and you can jump in my league (Hey)\nRun into my head like a deer when it's late (Gah)\nMan, everywhere she go, she ballin' (Boy)\nYeah she got Xans, she like, \"Where Tar at?\" (Geek)\nShe don't gangbang, she say she bang gangs (Bang)\nAnd she'll fight, might knock 'em out the ring (Bang)\nOut of cold Pepsi, she'll whip it like a waiter (Woo)\nI just wanna nut, she say that's easy like a baker (Woo)\nShe just want a nigga, I don't serve but I love maple (Woo!)\nAnd therefore she gon' watch me like cable, ayy (Hey)\n\n[Chorus: Young Thug]\nTake care of her!\nIf, if I don't do nothin' in the world, swear to God I'll take care of her (And what?)\nTake care of lil' mama, take care of baby mama (And what?)\nTake care of her (And what?)\nTake care of her, take care of her (And what?)\nTake care of her (And what? And what? And what?)\nOoh-aah (Woo!)\n\n[Verse 2: Young Thug]\nOn a million, goin' to meet a billion (Chasin', chasin' racks!)\nBrand new Bentley, you could keep the ceiling (Skrrt skrrt, woo)\n(Rich Gang) Ooh! (Ahh!)\nTake a trip to Peru\nBaby suck my dog like Snoop (Hey)\nBlood gang, big ups suu whoop (Blatt)\nDinosaur bankroll, woo, woo (Big racks)\nH&M ballin',  hundred ten (Ahh, ahh!)\nThrow my boy 6, bim bim (Ahh, ahh!)\nBaby keep that pussy (Ahh, ahh, ahh!)\nBaby keep that pussy clean trimmed (Woah)\nBought a castle with my last deal (Woah)\nBoy don't talk about no fast deal (Ahh)\nLil' nigga you late (What?)\nOkay (Get it)\nI'ma put the pedal to the Wraith (Skrrt)\nI'ma pull the pedal, not the brake (What)\nIce inside my ring, you can skate (Skate)\nYeah this shit cold like a case (Nigga, what?)\nThat a nigga went and snitched, dealing with (Ooh, ooh)\nAll these mothafuckin' bitches (Main bitch)\nI'm the shit, girl, I'm the shit (Grr)\nI'ma build a hole for a snitch, not a ditch, shit\n\n[Verse 3: Lil Wayne]\n(Moolah, Moolah)\nThey be hatin' on my girl, though\nAnd they wish they was the bitch they hatin'\nSalutations to my old hoes\nAnd thank you for your participation\nNo chaser for my girl though (Rich girl)\nShe go harder than me on occasion\nGettin' wasted with my girl\nThen we sixty-nine 'til we need ventilation\nYou don't know about it\nGotta open new accounts 'cause the others overcrowded\nGotta open up the stores when they're closed when we shoppin'\nFor my girl, wear the clothes that ain't nobody rockin'\nShe so bad, I don't know what to do with her\nI know just what to do in her\nMy homies hit me up, they said they're goin' out tonight\nI said, \"I'm with my girl tonight, I can't fuck with you niggas\"\nI'ma take care of her\n\n[Interlude: Young Thug]\n(Aah!)\nRich Gang\nDon't get scared now, pussy nigga\nAyy\n\n[Chorus: Young Thug & Lil Wayne]\nTake care of her! (Her, I'ma take care of her)\nIf, if I don't do nothin' in the world, swear to God I'll take care of her (Yeah, I'ma take care of her)\nTake care of lil' mama, take care of baby mama (Take care of baby mama)\nTake care of her (Take care of lil' mama)\nTake care of her (Take care of my mama), take care of her (I'ma take care of baby mama)\nTake care of her (Take care of lil' mama, take care of my mama)\nOoh-aah!\n\n[Outro: Lil Wayne]\nYoung Moo–, Young Moolah, baby\nRich Gang", "image": "https://images.genius.com/fc013670d5fa8f813674ec9970ce2bd7.500x500x1.jpg"}], "artist": "Young Thug"}