{"songs": [{"title": "True Love", "album": null, "year": "2011-05-09", "lyrics": "[Chorus]\nAyo, paper, green or chedder, cheese or bread\nThe cream is better, cake niggas fiend\nTo get a piece of this American dream\nIt seems it’s sunken to where this money is all they in love with\nLike paper, green or chedder, cheese or bread\nThe C.R.E.A.M. is better, cake niggas fiend\nTo get a piece of this American dream\nIt seems it’s sunken to where this money is all they in love with\n\n[J. Cole - Verse 1]\nYo, Tasha, a fox but, been round the block cause niggas jock her\nThe wannabe model she dating mobsters\nBeen involved with street kids to kingpins\nGot a thing for the bad boys\nThats how she meets him, see him is cat named \"Black\"\nReal name Jack James, stacks change\nReal big in the crack game\nShe’s seen that Range and she’s seen that chain\nThe bling made the dame wanna give up her last name\nShe was wit, but he was pimp like, just like Ike was\nTreated her like it was the Fight Club\nHit her with rights, blood drippin’ on white rug\nBy the end of the night, they would kiss and she was iced up\nLong as he kept her iced up, she piped down\nHit her off with a little pipe to mic bounce\nDown south where a nigga wouldn’t return for days or weeks\nShe was too afraid to cheat\nSo you ain't even gotta ask\nAs long as she got a Prada bag\nOr an Armani exchange skirt showing a lot of ass\nShe’s good, living the life, she’s ballin’\nToo bad she picked the wrong nigga to get involved with\nSee the nigga black had problems and enemies\nAnd snake niggas is friends only pretend to be\nAnd cats is out for his head, he caught in some shit\nJust watch how Tasha gets tossed in the mix\n\n[Chorus]\nAyo, paper, green or chedder, cheese or bread\nThe cream is better, cake niggas fiend\nTo get a piece of this American dream\nIt seems it’s sunken to where this money is all they in love with\nLike paper, green or chedder, cheese or bread\nThe C.R.E.A.M. is better, cake niggas fiend\nTo get a piece of this American dream\nIt seems it’s sunken to where this money is all they in love with\n\n[J. Cole - Verse 2]\nNow Black owed money and when it comes to this money, trust me\nYou can’t tip toe with nobody cause\nNiggas will do insane things to get they cream\nWon’t even speak, let the bullets explain things\nThats how it is, paybacks a bitch, right?\nEspecially if you didn’t pay back niggas is sick like\nRun up in your crib like “bitch where’s the bread at?”\n“You got a week to get it, dont got it, you’ll regret it”\nFunny I said it cause Jack’s in the same exact predicament\nGot a foot in the grave and still digging it\nOwe some niggas money with no intentions of giving it\nThem niggas is sending warnings, he isn’t listening\nTomorrow morning they buss in his front door\nAnd a swarm of muthafuckers with guns drawn coming at\nOn the hunt for Black, Tasha gets smacked\nBut Jack’s gone a whole week before he gets back but\nNiggas is through waiting, they been too patient already\nThey ain't recieved a fucking penny\nSo they called a nigga up\nTold him if he doesnt get the dough\nAnd give it up n the next 6 hours, his bitch is fucked\nBut, hold up!\nThe nigga Black answers with “So What!”\n“I gives a fuck, shoot the ho up, still won’t show up”\nHung the phone up, toss it back and she knew\nSorry baby girl, this is what cheddar can do!\n(2 silenced gun shots)", "image": "https://images.genius.com/2cd936e786e1ab454043327d585c7702.1000x1000x1.jpg"}], "artist": "J. Cole"}