{"songs": [{"title": "The Food (Live)", "album": "Be", "year": null, "lyrics": "[Dave Chappelle]\nTonight's musical guest\nTwo of Chicago's Finest emcees!\nGive it up for Common and Kanye West!\n\n\"It's Common Sense!\"\n\n[Intro - Common]\nYeah! \"Common Sense!\" - {*scratched*}\nIt's Common Sense! With Kanye West!\nOn the Dave Chappelle Show!\nEverybody gotta eat right?\nIt's the food baby!\n\n[Chorus - Kanye West]\nI walked in the crib, got two kids\nAnd my baby mama late (uh oh! uh oh! uh oh!)\nSo I had to did, what I had to did\nCause I had to get (duh-ough! duh-ough! duh-ough!)\nI'm up all night, getting my money right\nUntil the blue and white (po po! po po! po po!)\nNow the money coming slow, but a least a - know\nSlow motion better than (no-oh! no-oh! no-oh!)\n\n[Verse - Common]\nYou love to hear the story, again and again\nAbout these young brothers, from the City of Wind\nLike juice and gin, in the city we blend\nAmongst the hustle, titties and skin, fifties and rims\nY'all know the Sprewells and trucks that's detailed\nHeartless females that wanna ride in em\nFelt the southside venom in raw hides and denim\nPimp minds collide wit em, a system that tries victims\nWe living in, my man in the fast lane pivoting\nOn the block white is selling like Eminem\nOn the block it \"Jump Off\" like Kim and them\nOn the block it's hot, you can feel it, in your skin and then\nShorties get the game but no instructions to assembling\nEyes bright, it seems like the fight is dimming them\nCall my man cuzo, like I'm kin to him\nHe trying to stay straight, the streets is bending him\n\n[Chorus]\n\n[Verse - Common]\nIt's all good in the hood, like raps and gems\nThrowbacks and Timbs, blacks and rims\nWhether on ball courts, attires of all sorts\nWe never fall short, wit us it's Our Force like And 1's\nSome waves, some air guns, the days of the fair one is over for\nCats is colder than four below, wit self I go toe to toe\nWondering if it's for the art or for the doe\nThough I know to grow a - gotta learn to let go\nThough I know the doe I got to bring back to the ghetto\nArrows on Terot cards pointing to the grind\nPo' livin in more prisons, pointing to my mind, shine the light up\nClench my fists tight, holding the right up\nFreedom fight in dark gear for the years to get brighter\nSituations, and jobs get tighter\nMy man trying to get his weight and height up, c'mon!\n\n[Chorus]\n\n[Bridge - Kanye West]\nI - I know I could make it right\nIf I could just swallow my pride\nBut I can't run away or put my - away\nYou can't front on me\nI - no I can't let it ride\nNo no not tonight\nSee I can't run away or put my - away\nYou can't front on me\n\n[*applause*]", "image": "https://images.genius.com/af231bd3cefe10a3d898842a54af3d3f.1000x1000x1.jpg"}], "artist": "Common"}