{"songs": [{"title": "Circles", "album": "The Documentary 2", "year": "2015-10-09", "lyrics": "[Verse 1: The Game & Sha Sha]\nI just want you to come home\nNo matter if it's late at night\n(I hear you talking)\nI know you saying you working\nBut baby boy this feeling ain't right\n(I'm just out here tryna get my money you know that)\nFuck that, we got enough houses, enough cars\nYou done bought me enough jewelry\nTired of your shit my nigga, you hear me\n(You know I be at the studio and shit)\nNigga you lying, who you trying to run that game on?\nWho you think I am? I'm not one of these thots you met at Playhouse\n(I didn't say that)\nI just rode by nigga, you wasn't at Drake house\nParked my shit at 'Ye house and hopped in the uber\nJayceon stop lying you fucking think I'm stupid\nNah look, ain't nobody say that\nYou ain't complain when I bought that Maybach\nPut you in Chanel, your friend Chanelle can't even say that\nYou wanted to see Rihanna I put you and your friends at the concert\nCloset full of Giuseppes, you came a long way from Converse\nTook you out that Hon-cord, put you in that Tom Ford\nAll this arguing I ain't got no time for it\nYou call my phone like fifty times\nDon't do no shit like that\nI was just fucking them girls\nI was gon' get right back\n\n[Chorus: Eric Bellinger]\nSpinning around, spinning around\nSpinning around, spinning around\nIt's the same old, we be going through the same old\nSpinning around, spinning around\nPulling them down, taking them down\nIt's the same old, niggas get tired of the same old\n\n[Verse 2: The Game & Sha Sha]\nNigga you strapping up?\nYeah I'm strapping up, shit, you acting up?\nYeah I'm acting up, nigga\nYou not gon' keep on playing me\nYou not gon' keep on playing me\nIs it gon' be this bitch or your family?\nI'll kill that bitch whole family (I fucking hate you!)\nWhat your crazy ass shooting in the house for?\nWhat yo dumbass screwing in the house for?\nAnd what time you get home anyway?\nShit, about four\nAnd that's what the fuck you sleeping on the couch for\nI don't give a fuck, thug life, I'm an outlaw\nAnd the next bitch ain't nothing but a house call\nScrolling through my iPhone looking for my side chick\nThis bitch always flipping pushing buttons like a sidekick\nThat's when I hop in my Jeep and pull it up to Toxic\nAnd while you gone, guess what?\nI'll be bouncing on that side dick, nigga\n\n[Bridge: Eric Bellinger & Sha Sha]\nI guess you thought they stopped making real niggas when they made you\nI guess you thought they stopped making real niggas when they made you\nI guess you thought they stopped making real niggas when they made you\nShit, they stop making them, they stop making them\nGuess you thought they stopped making real bitches when they made you\nShit, there's a few in the room and a couple in the Wraith too\nBut you know you still the one\n\n[Verse 3: Q-Tip]\nAnd nothing can compare to the temper that you hear\nWhen you get caught in a stare at the next derriere\nNow she's explaining to you\nThat she's the baddest bitch that ever graced a pair of shoes\nAnd if you wanna gamble to find better, you lose\nAnd all this loud chirping that you consider rude\nBut when food is on the table\nWe may be arguing like we Cain and we Abel\nThen we have some makeup love and we get back stable\nHave a little girl, I cut the cord from her navel\nHey\n\n[Outro: Eric Bellinger & Q-Tip]\nI guess it's just the way it goes down\nLove is like a merry go round\nI guess it's just the way it goes down\nLove is like a merry go round\nAnd on goes the game", "image": "https://images.genius.com/f5bd9dcb51fd19e06b10b2ae0e3620cf.1000x1000x1.jpg"}], "artist": "The Game"}