{"songs": [{"title": "Mr. Pillowman", "album": null, "year": "2010-11-19", "lyrics": "[Chorus]\nMr Pillowman, you can sleep on me. And i'll fulfill your dreams\nI'm the\nPillowman, you probably heard about me. I'm more than what I seem\n\n[Verse 1]\nOnce upon a time there was a boy named Mr. Pillowman\nHe had enough rage bottled inside to even kill a man\nAnd always went out of his way just so that he could get a friend\nHe'd ask for opportunities but nobody would give a damn\nAnd he would always hope he made it, cause he was so creative\nBut he was slowly hated going through these dopey mazes\nHe'd never hesitate whenever a test was given\nHe'd pass it with an A+ but get no recognition\nAt 19 years old he thought he caught his break\nAnd understood that patience and motivation is all it takes\nHis mother was so happy for him that she bought a cake\nI wish you could have seen the smile on his father's face\nTwo days after that, he was feeling lost and dazed\nThe man who was suppose to be his hookup was talking fake\nNow this is oftly strange, his world is cloudy as it softly rains\nAs he's crying out loud, his heart would sing...\n\n[Chorus]\nMr Pillowman, you can sleep on me. And i'll fulfill your dreams\nI'm the\nPillowman, you probably heard about me. I'm more than what I seem\n\n[Verse 2]\nMr Pillowman. Nothing but a civil man\nAlways felt that his success was just around the riverbend\nHe'd smile in your face but down in his heart he'd be sad\nThe world would never acknowledge half of the talents he had\n22 years old he thought he caught his break again\nBecause his buddy hooked him up, and it's for surely thanks to him\nThat Mr. Pilloman, is happy and so proud of his life\nWow this is nice, it's like he felt the power of Christ\nHe knew that God is good and God is bold, It's time to Rock and Roll\nSomebody finally understood he was a pot of gold\nHis lack of success was to the point where it's gotten old\nBut patience was the key, so the stories often told\n...Then his buddy called, and said \"I hate to tell you\nBut that connection that I hooked you up with never fell through\"\nThen Pillowman's like \"What the hell dude? You said this was a swell move\nI'm probably better off trying to sell shoes\"\n\n[Chorus]\nMr Pillowman, you can sleep on me. And i'll fulfill your dreams\nI'm the\nPillowman, you probably heard about me. I'm more than what I seem\n\n[Verse 3]\nHere's a secret. I am Mr. Pillowman\nGoing on 25 and I'm wishing I could live again\nI've reached out to people but yet nobody would lend a hand\nI feel like i'll never be able to pay my rent again\nI'm getting old and time is crucial, feels like I'm not as useful\nMy only meals consist of Kool-aid, and Ramen noodles\n...I wish I had more, but my mom and dad's poor\nSo when you see me don't bother to ask me what I'm mad for\n..Yeah you can laugh about it. But I'm just sad and pouting\nSeeing motherfuckers make it who don't have no talent\nThat's 10 years of my life that's down the drain\nI feel like a true failure living life without a brain\nBut yo, I'm still trying to get a name\nRapping on the mic and spitting flames maybe i could get some change\nBut I'm at the point I'm about to say \"fuck it\"\nCause I released a nationwide album and I never made a buck from it\n\n[Chorus]\nMr Pillowman, you can sleep on me. And i'll fulfill your dreams\nI'm the\nPillowman, you probably heard about me. I'm more than what I seem", "image": "https://images.genius.com/1620b55458e423f96bf6316d13418223.1000x1000x1.jpg"}], "artist": "Hopsin"}