{"songs": [{"title": "Party up - radio edit", "album": null, "year": null, "lyrics": "Uhh.. UH! .. WHOO!\n\nY'all gon' make me lose my mind\nUp in HERE, up in here\nY'all gon' make me go all out\nUp in here, up in here\nY'all gon' make me act a FOOL\nUp in HERE, up in here\nY'all gon' make me lose my cool\nUp in here, up in here\n\nIf I gotsta bring it to you cowards then it's gonna be quick, aight\nAll your mens up in the jail before, suck my (Wooh!)\nAnd all them other cats you run with, get done with, dumb quick\nHow the (Arf!) you gonna cross the dog with some bum (UH!)? Aight\nThere go the click click, nine one one (What?)\nAll over some dumb (Uuuh...), ain't that some (Uh!)\nY'all ... remind me of a strip club, cause everytime\nYou come around, it's like (what) I just gotta get my ... sucked\nAnd I don't know who the (Grr...) you think you talkin to\nBut I'm not him, aight slim? So watch what you do\nOr you gon' find yourself, buried next to someone else\nAnd we all thought you loved yourself\nBut that couldn't have been the issue, or maybe\nThey just sayin that, now cause they miss you\nMaybe they tried to diss you\nThat's why you layin on your back, lookin at the roof of the church\nPreacher tellin the truth and it hurts\n\nY'all gon' make me lose my mind\nUp in HERE, up in here\nY'all gon' make me go all out\nUp in here, up in here\nY'all gon' make me act a FOOL\nUp in HERE, up in here\nY'all gon' make me lose my cool\nUp in here, up in here\n\nOff the chain I leave ... soft in the brain\nStill want the fame, off the name\nFirst of all, you ain't rapped long enough\nTo be ... with me and you, you ain't strong enough\nSo whatever it is you puffin on that got you think that you Superman\nI got the Kryptonite, should I smack him with my ... and the mic?\n... is characters, not even good actors\nWhat's gon' be the outcome? Hmm, let's add up all the factors\nYou wack, you're twisted, your girl's a (Wooh!)\nYou're broke, the kid ain't yours, and e'rybody know\nYour old man say you stupid, you be like, \"So?\nI love my baby mother, I never let her go\"\nI'm tired of weak ... whinin over ...\nThat don't belong to them, ... is wrong with them?\nThey ... for real ... like my mans and them\nWho get it on on the strength of the hands with them, MAN\n\nY'all gon' make me lose my mind\nUp in HERE, up in here\nY'all gon' make me go all out\nUp in here, up in here\nY'all gon' make me act a FOOL\nUp in HERE, up in here\nY'all gon' make me lose my cool\nUp in here, up in here\n\nI bring down rains so heavy it curse the head\nNo more talkin - put him in the dirt instead\nYou keep walin - lest you tryin to end up red\nCause if I end up fed, y'all end up dead\nCause youse a soft type (What?)\nFake up North type (Wooh!)\n... like a soft white (Grr...)\nDog is a dog, blood's thicker than water\nWe done been through the mud and we quicker to slaughter\nThe bigger the order, the more (Uh!) we brought out\nWe run up in there, e'rybody come out, don't nobody run out\nSun in to sun out, I'ma keep the (Arf!) out\n... runnin his mouth? I'ma blow his lung out\nListen, yo' (What?) is about to be missin\nYou know who gon' find you? (Who?) Some old man fishin\nGrandma wishin your soul's at rest\nBut it's hard to digest with the size of the hole in your chest\n\nY'all gon' make me lose my mind\nUp in HERE, up in here\nY'all gon' make me go all out\nUp in here, up in here\nY'all gon' make me act a FOOL\nUp in HERE, up in here\nY'all gon' make me lose my cool\nUp in here, up in here\n\nUh, uh, uh, uh, uh\nHold up! ERRRRRRRR!\nOne.. two.. (meet me outside\nMeet me outside, meet me outside)\nAll my Ruff Ry-DERS (gon' meet me outside\nMeet me outside, meet me outside)\nAll my big ball-ERS (gon' meet me outside\nMeet me outside, meet me outside)\nAll my fly lad-IES (gon' meet me outside\nMeet me outside, meet me outside)\nAll my street street peoples (meet me outside\nMeet me outside, outside)\n\nX is got y'all...", "image": "https://images.genius.com/1bcf43b1cc0f34db6cd70e1a63c8b84c.464x464x1.jpg"}], "artist": "DMX"}