{"songs": [{"title": "Slave II", "album": "Bobby Tarantino", "year": "2016-07-01", "lyrics": "[Intro]\nEast side, west side, we ride, we die, everyone knows\nEveryone knows, everyone knows\nEast side, west side, we ride, we die, everyone knows\nEveryone knows, everyone knows\n\n[Verse 1]\nTell me what you know about forty days, forty nights\nNo lights, all for this\nTell me what you know about sleeping outside\nNo ride in the wintertime, all for this\nTell me what you know about commas in the bank\nLookin' in the mirror, yeah, I did all of this\nX you out, you get solved with this\nEverybody know I...\n\n[Interlude]\nI'm a slave\nI'm a slave\nYou a slave (Yeah)\nYou a slave (Alright)\nI'm a slave for this shit\nI'm a slave (Yeah)\nYou a slave (Alright)\nI'm a slave\nYou got to slave for this shit\n\n[Verse 2]\nWalk inside of Def Jam\nStep on the president table and dap 'em up with the left hand\n'Cause I'm countin' money with the right\nIn a different city every night\nAnd I'm sellin' records like it's white\nIt's another day, another flight\nParis in the morning, L.A. at night\nWhat a beautiful sight\nNow tell me who be fuckin' with me, alright?\nEverybody know I'm livin' this life\nEveryone know I got the baddest wife\nThis shit right here, everybody gonna like\nHold up, I know what I, know what I like\nTell me why everybody in the pipe\n'Cause I'm the only one doin' it right\nI'm a rap genius like Rob Markman\nSpent a couple of million on my new apartment\nDown in Manhattan, that's a multi-million dollar view\nAnd I got it from rappin'\nDamn everyone nappin' on the boy, heh, shit\nI'm not a mad rapper, but what?\nI'm angrier than Kanye\nAngrier than Kanye when he talkin' about clothes\nThat's a fashion line\nAnd my last album went number one\nSo what that mean?\nI did better than you, you, you\nSold way more than that pop bitch\nAnd I dare Def Jam to drop this\nI just drop hits\nCheck the Instagram fam\nI got fifty-thousand people in the crowd, singin' out loud\nEvery word, that's every lyric\nYou can hate, shit, just stop actin' like you don't hear it\nThis shit right here for the party\nThat album that comin', that's shit for the spirit, woo!\n\n[Outro]\n5-0 triple-0", "image": "https://images.genius.com/a2a1ea75211400787dc41af3d53cda10.1000x1000x1.jpg"}], "artist": "Logic"}