{"songs": [{"title": "By Any Means", "album": "Self Made Volume 1 ", "year": null, "lyrics": "[Hook: Rick Ross]\nFork on the floor, white in the pot\nBy any means, if you like it or not\nMalcolm X, by any means\nMany 14s stuffed in my denom jeans\nAs-salamu alaykum, well, alaykum salonne\nWhatever your religion, kiss the ring on the don\nReal nigga, street surtified\nHit the streets, wip caussts 335\n\n[Verse 1: Meek Mill]\nMeek Milly!\nNo park on the 4, but it's white in the pot\nWe charging you niggas up if you like it or not\nDrop the work on the skailes, thro some ice in the pot\nDon't let that arman hammer go right to a lot\nTryna wip a rolli, all Cardier\nShout out to this pirax, and put this on the mear\nWho tought me audomor, my whole team got them\nYou lovin the same bitch my whole team toppin\n100 though, Imma be wherever that money go\nGlocc 9 in my underclothes, new cartell, we workin for him\nFuck niggas, we don't fuck with those\nBad bitches, never let them know\nKeep them round, but never trust them though\nThis 62 so comfortable\nI'm a field nigga, you's a house nigga\nI'm a real nigga, and you's a mouse nigga\nCoad red, which means you coad red\nBut I'll knock you out this, blame it on you old heads\n\n[Hook: Rick Ross]\nFork on the floor, white in the pot\nBy any means, if you like it or not\nMalcolm X, by any means\nMany 14s stuffed in my denom jeans\nAs-salamu alaykum, well, alaykum salonne\nWhatever your religion, kiss the ring on the don\nReal nigga, street surtified\nHit the streets, wip caussts 335\n\n[Verse 2: Wale]\nWale though!\nMalcolm X, get yo head out my pocket\nSome niggas walk with death, guess they ran out of options\nTell them niggas we movin, tell them niggas to do it\nI sware we going ham, hope some them niggas sue me\nNaibor on every block, this bitch ain't got no heart\nShit ain't really same, since Ronald Raigan banned rock\nAnd we ain't land on it, Mr. Raigan\nBut this gonna make us rich, Mr. Raigan\nWale like them Salom\nShe see me Friday, then go to Shamon\nWhen I play with her box, she give the greatest top\nShe say these niggas is her pray, and she makes a lot\nWord, how they say we not fly\nHow they say we not work\nThey just need convincing like Malcolm Little, before he converted\nI'm on my Dean Sha-la, Imma get her right\nOn the bible, you can run, but you can't hide\n\n[Hook: Rick Ross]\nFork on the floor, white in the pot\nBy any means, if you like it or not\nMalcolm X, by any means\nMany 14s stuffed in my denom jeans\nAs-salamu alaykum, well, alaykum salonne\nWhatever your religion, kiss the ring on the don\nReal nigga, street surtified\nHit the streets, wip caussts 335\n\n[Verse 3: Pill]\nMarching for cars, they put a hole in it\nStart the applause, a rebble so lifted\nFor the paper, the poperotzi so relished\nFor the mascot lives, teachers do sharades\nThat's Malic, one behind the brass\nKuruption over cans, leave him leaking in the gass\nBetter remember, smell that chetter and sills\n?\nMy religion is kitchen, par performers\nMy pockets ain't normal\nPholosify is rocks and weed, pot to lean, glocc to scream\nNiggas clocking dollars, don't know how to read with mouths to feed\n\n[Hook: Rick Ross]\nFork on the floor, white in the pot\nBy any means, if you like it or not\nMalcolm X, by any means\nMany 14s stuffed in my denom jeans\nAs-salamu alaykum, well, alaykum salonne\nWhatever your religion, kiss the ring on the don\nReal nigga, street surtified\nHit the streets, wip caussts 335", "image": "https://images.genius.com/32181ba51dd7d9bc28affe373780c5f4.1000x1000x1.jpg"}], "artist": "Meek Mill"}