{"songs": [{"title": "Mama’s Boyfriend", "album": null, "year": null, "lyrics": "[Chorus]\nI never liked you niggas\nWho knew one day I'd be just like you niggas\nUh, alright you niggas, uh, alright you niggas\nWhen I become my mama's boyfriends?\n\n[Verse 1]\nHe walked in our lives I was only five\nSuperman pajamas I was super duper fly\nSittin there like why? He at least Hooper-Size\nYou know I scrutinize, like, \"Who this newer guy?\"\nI'm my mama boyfriend, I'm her little husband\nI was the man of the house when it wasn't\nTryna get to know me, homie? Just kill the charm\nYou ain't interested in me, you just trying to fuck my mom\nWe all the voices of our parents' bad choices\nThe aftermath of divorces, the kids of bitter split-ups\nAnd babysitters, grandparents that don't know what do to with us\nAnd the last thing I want to see is mama's new nigga\nYou old Old Spice wearing, short chain wearing\nDress shoes and jogging pants wearing, church sock wearing\nWhen you first stop caring about your appearance?\nWhen you get here anyway? I already got parents\nDon't try to put me in line, I already got crayons\nMy mama said I could do it, I already got clearance\nKeep your hands off my mama how Anita got Clarence\nYeah I know she look good but you need to stop staring\nI drew a picture of her that'd make her proud\nBut the door was locked and the TV up so loud\nI screamed out, \"I ain't going to sleep no time soon!\nAnd when I do, I'm sleeping in my mama's room!\"\n\n[Chorus]\nI don't like you nigga\nIf I was old enough I'd fight you nigga\nI want to run over you with my bike, you nigga\nDon't go to sleep at night, you nigga\nWhen I become my mama's boyfriends?\n\n[Verse 2]\nTwenty years later where has the time gone\nNow you see I'm dating, having problems of my own\nNow that I'm grown the tables turned around\nI never thought I'd ever raise another nigga's child\nHe don't like his mama's boyfriend just like me\nDon't wanna do the wrong thing, that's very un-Spike Lee\nBut he be like D Bo round his mama, there\n'Cause when she here, he be quiet when she leave, he be talking again\nHe be wilding out, be calm\nI don't drink the drama or sip the Dom-Tyler-Perry-on\n\"You gonna marry my mom?\" Look, I don't read palms\nAnd I don't read Psalms but I did take little man to church\nTook little man to school\nLook, little man, kids don't make the rules\nEven though I ain't raised you, you your mama's angel\nDon't get it twisted, baby boy, I'll Ving Rhames you\n\n[Chorus]\nI never liked you niggas\nWho knew one day I'd be just like you niggas\nUh, alright you niggas, uh, alright you niggas\nWhen I become my mama's boyfriends?", "image": "https://images.genius.com/70c6e506a91f6dabdd23cad304812ce3.533x533x1.jpg"}], "artist": "Kanye West"}