{"songs": [{"title": "Still Here", "album": "Neva Left", "year": "2017-05-19", "lyrics": "[Skit: Little boy and Kendrick Lamar]\nAyo, K-Dot? You up on that new Snoop Dogg? That nigga shit bae! I ain't fuckin' with none of these new niggas, but that nigga, Snoop Dogg? That nigga back!\nRight, right, he a wild lil nigga. But that's where you're wrong at lil homie; big Snoop never left!\n\n[Intro: Sample + Snoop Dogg]\nI am still here! Jah Rastafar-\nYeah, chada-di-da-da\nSugar (hahaha)\nYah, man (hahaha)\nCheck it\n\n[Verse 1: Snoop Dogg]\nDidn't think I would last, I'm adrift on a draft\nWhile I'm flippin' my craft, hold a gift to the gab\nCre-i-zippin' my rag see, hop on the grass\nPeep-pop on these suckers tryna avoid the clash\nBut if I must I must, let me raise my glass\nTryna move on off and put you on up - some fresh game\nOr how to maintain, sustain and gangbang\nYou never change, you stay the same\nIt sound easy, don't it? I put a lot on it\nI be Dogg on it, I really want it\nAchieve at the speed that you work at\nAnd these is the G's we the throwbacks\nBattlecat on the track\nThere is just no way you can call that a comeback\nWe done that, we run that, from the top back little to the front\nWe only here to give you what you want\nBlaze the blunt!\n\n[Hook: Snoop Dogg]\nWhen your times is being rough and no one want to be near you (near you)\nYou know that I'll be there, I'll be right there\nAnd when you're luck is so bad and no one really wants to hear you (hear you)\nJust turn me on, and turn me out and let me play\nLada-di-di-di-da-da!\n\n[Verse 2: Snoop Dogg]\nHorse and a carriage\nSports in a marriage, all in a day's work\nShow you how these plays work\nLongevity, heavenly blowing kush heavily\nRearrange my melody, no more felonies\nShout-out to my mama Beverly, and my grandmother the elderly should be upheld to the utmost\nDorothy Tate, half the reason why I'm great\nMississippi the state\nLet me shake back, right back to the beat\nAnd keep supplying y'all with more heat for the street\nSnoop Dogg, Snoop Lion, it's all the same\nOne thing's for sure, this shit bae\nAchieve at the speed that you work at\nSee these is the G's and we the throwbacks\nBattlecat on the track\nThere is just no way you could call it a comeback\nDid that, done that\n\n[Hook: Snoop Dogg]\nWhen your times is being rough and no one want to be near you (near you)\nYou know that I'll be there, I'll be right there\nAnd when you're luck is so bad and no one really wants to hear you (hear you)\nJust turn me on, and turn me out and let me play\nLada-di-di-di-da-da!\n\n[Outro: Snoop Dogg]\nLada-di-di-da-da!\nYeahma, Snoop Lion\nSnoop Dogg, hehe!\nI'm still here!\nB.C. Powder!\nYessir", "image": "https://images.genius.com/60bf707949edab977c5ad8da61ef82a2.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}