{"songs": [{"title": "Best Thing Yet", "album": "The Drought Is Over 6 (The Reincarnation)", "year": "2008-11-26", "lyrics": "Tell it to my nine bitch!\n\n[Anita Baker]\n\"You're the best thing yet\"\n\n[Intro]\nD-D-D-Diesel on the beat\nShhhhhut up bitch... let Anita speak!\nI think on the remix of this song I'mma get uh, Common and Kanye\nYeah... ok yeah\n\n[Verse 1]\nAnything he can do I could do better\nI avoid trends and I'm still a trendsetter\nWeezy just let em, just let em die\nI got all the answers so they call me when why\nWhat where who, you think you fly?\nI'm up there too - you fly, I flew\nI'm up there too\nYou know they say two, is better than one, time\nI'm a pimp, pimpin all the time\nSo keep your two cents before I give your ass a dime\nPistol on my waist gonna need a funeral and wake\nCause I'mma put that motherfucker dead in your face\nR.I.P. I know my history\nRun DMC but my girl is only worry bout one DMC\nAnd I'm the shit like I-M-T-H-E-S-H-I-T, haha!\n\n[Bridge]\nI do this! ..when I want to\nNah really I can't control it\nEven if I didn't wanna do it\nI would DO IT! Hahahaha\nYeah\n\n[Verse 2]\nReady to battle anyone\nI'mma go with God and a bag full of guns\nYeah I'm an animal hear me growl\nYou against me is like Man Vs. Wild\nMe against you is like man versus child\nHehe and I am the man\nIt's Young Moolah, applaud my team\nAnd we prefer red carpet if the floor's not clean\nIt's Mister, it's the microphone fiend\nAnd they running with my words like I'm writing on jeans\nYeah, and if the lights could all scream\nThey'd sing my song, I like to be seen\nI deserve to be heard if anything else\nSo I fear God and the world going deaf\nCan you hear me now? Heh\nEven the hip-hop vets tell me I'm the..\n\n[Bridge]\nScary!\nDon't stop the beat Diesel\nCause I got the heat Diesel\nLike diesel, yeah..\n\n[Verse 3]\nHeh I put it down like it's too heavy\nBut how can I with the world in my hands\nHeaven in my plans\nI swear I am important like the evidence I'm saying\nI'm just trying to make my alphabets as heavy as I can\nHow do I live, whem I'm as deadly as I am?\nI get props and every other extra credit that I can\nCause see, I respect the merit of a fan\nNo homo but please blow me to Japan\nOkay I'm getting hotter I'mma need another fan\nI keep going so here I go again\nAlways trying to be better than I am\nLabel me the best and in the throne I will stand\nWhy? Because I'm just a standup guy\nYour hands smoking me cause I got your hands high\nI pop a bean and bang Ja Rule when I Cry\nYou only know me but God knows I try\nNo x-ray show my insides\nAnd I gotta stay in touch with my pimp side\nSo, tell your girl I said what's up.. I said hi..\nShe like that's what's up.. like the sky..\nByrd Gang taking off bitch watch em fly\nAnd paint the sky red like the Crimson Tide\nFlow retarded, Special Olympics kind\nThat gold medal heavy but it fit just fine\nSo, I just had to spit this rhyme\nSpit like I'm trying to tongue kiss this rhyme\nSome say greatness gets better with time\nSo I bought a zillion watches but don't watch mine\nYou little fucks are so i-ron-ical\nNickel plus fo' is a nine millimeter\nNo starch but I tote i-ron\nAll out in the open like I'm in I-ran\nYoung, champ-i-on, like a lamp I'm on\nBut um, I could clap and then lights off\nTake no nights off but my days the same\nAnd people change but fuck it nothing stays the same\nAnd naw I ain't speaking so don't wave the blame\nLock me up but you could never cave the blame\nGasoline, can you invision if our gaze was flames\nNo you can not stop my vibe, couple page a game\nDang, a game? Yep, well gimme some baby flames\nAnd if this camera shoots me dead, Lord save my chains\nLord save the rings, I am way too vain hehe\nListen to that Kanye again\nI play the game like I made the games\nYou playing like your trying to get traded mane\nAnd you ain't gotta call me the greatest mane\nBut I am more of a dog than the greatest dane\nYou boys acting like ladies mane\nCrying like you bout to have babies mane\nAnd you can find me grinding on the days we playin'\nAnd that's because I know the sun'll raise again\nAnd when it do I'mma praise the mane\nThey say you crazy Wayne, but I just bake em mane\nAnd that's Ms. Baker saying, that I'm the...\n\n[Outro]\nHehe yeah\nSo, now I got..\nI got the, I got the, I got the R&B vets saying I'm the..\nHahahaha... Lil tunechi bitch!\nYoung Moolah baby...", "image": "https://images.genius.com/3f99fb60638817d357014fe4a769ff57.320x320x1.jpg"}], "artist": "Lil Wayne"}