{"songs": [{"title": "What Are Silly Girls Made Of", "album": "Words From the Genius", "year": "1991-02-19", "lyrics": "[Hook]\nWhat are silly girls made of made of\nWhat are silly girls made of\nA neck full of gold, material things huh\nThat's what silly girls are made of\n\n[Verse 1]\nOn a scale of one to ten I seen a girl about a nine\nA slave of mental death, if only she was divine\nWalking down my ex-block, the block Monroe\nI said, peace to her, the girl said hello\nWell hell is low and the lowest you can go\nIs thirty-two degrees, below zero\nSo I started to rain on this young girl's brain\nCausin her a great mass of physical pain\nShe said, \"Tit for tat, step off my bra strap\nNo diamonds, no gold, you cannot get a rap.\"\nThen I said, \"So what?\", as I grabbed her butt\nShe smiled for a while but her mouth kept shut\nThe girl is eighteen, just birthed a child\nYou're young in the brain and your thoughts are wild\nYou're on welfare, yo but you don't care\nYou say, \"FTF is always there.\"\nYes FTF meaning face-to-face\nThe main headquarters of your local place\nWhere you collect your bi-weekly pay\nTo support the foolish habits you abuse everyday\n\n[Hook]\nWhat are silly girls made of made of\nWhat are silly girls made of\n\"Yeah that's right, I'm juicin em, I'm juicin em dry!\"\nIs that what silly girls are made of?\n\n[Verse 2]\nThere has never been a dame in my entire life\nMy girlie, my ex, my next or my wife\nThere has never been one who tried to disrespect\nEspecially a member of the opposite sex\nYo bust it, there's somethin that I gotta let out\nBut I don't want to be known as Ralph the Blabbermouth\nSilly girls, they think guys are soft\nBut all they wanna do, is knock their boots off\nAnd just from obtaining the common sense\nYou can tell that the girlies seem rather quite dense\nOther than dense they play slightly bold\nBut from the statements I made they could not uphold theyself\nThey break down, and they start to cry and said\n\"Oh! I don't believe this guy!\"\n\n[Hook]\nNow what are silly girls made of made of\nWhat are silly girls made of\n\"It's all about the finances\" \"Forget the romance\"\nIs that what silly girls are made of?\n\nWhat are silly girls made of made of\nWhat are silly girls made of\n\"Guys with cash\" \"can rock my big a--\"\nIs that what silly girls are made of?\n\n[Verse 3]\nSilly girls on a strip, struttin back and forth\nWatchin cars, thinkin of G'n off\nLookin for gentlemen, who they might swing\nAnd attitudes, like you can get anything\nYou wear tight bodysuits under long coats\nBut ain't satisfied until a pervert slice your throat\nYou're young you're dumb and you used to be innocent\nWhen young, now take a look at what you've become\nA bloodsucker, trying to get all you can\nOut the pocket of the next girl's man\nJust to clothe yourself in gold and jewelry\nYou wear tight jeans with attempts to lure me\nInto your web, cause you're livin like a spider\nAnd playin it off, like everything's Ore-Ida\nYou come out late at night and roam the streets\nLike thiefs, stalkin a piece of flesh meat\nIs that what you do for a living get paid?\nC'mon, there's plenty of ways to get paid\nBut instead of living the life that's clean and sturdy\nYou'd rather go out and get your knees dirty\n\n[Hook]\nWhat are silly girls made of made of\nWhat are silly girls made of\n\"He better buy me some gold bamboozles\" \"And some Fendi too\"\nIs that what silly girls are made of?\n\nWhat are silly girls made of made of\nWhat are silly girls made of\n\n[Dialogue: Unidentified women]\n\nFirst of all, don't leave home without it\nWithout what?\nThe gold card\nI'm tryin to tell you now\nI don't lay on my back for free\nYou know as they say\nIf you wanna Taney\nYa gots ta pay\n\n[Outro: Unidentified women and man]\nYo what's up gorgeous, what's your name?\nBaby let's talk about your assets first\nAlright baby, well let's go for a ride in my new car\nWhat kind of car you drivin baby?\nI got a new Yugo\nA Yugo? C'mere\nYou go, get in your Yugo\nAnd get on out of here!\nGirlfriend, tell him about hisself\nI don't believe him, he got champagne thoughts and Bud Light money\nBud Light money? A Yugo? A thirty-five hundred dollar car?\nAnd you steppin to this? I take only Benz's and better love\nForget about the love it's all about the money\nSo let's go put on our silk suits and step to the club tonight\nThat's where it's at\nYeah, money", "image": "https://images.genius.com/a2hbqfa2xwvnb8hpdpe5u35cz.300x300x1.jpg"}], "artist": "GZA"}