{"songs": [{"title": "D-X-L (Hard White)", "album": "...And Then There Was X", "year": "1999-12-21", "lyrics": "[Styles P]\nHoliday Styles\nBitch, I get you shot in the head or shot in the neck\nIf I ain't gettin proper respect\nI don't care if you rap, I still spit in your grill\nI don't give a fuck, never have, never will\nIf it ain't on your hip, then you're lookin to die\nI ain't tryin to be the nigga that's gonna look at the sky\nAsk God why I'm broke, bitch, I'm cooking the pie\nWe all gon' die, sooner or later, matter of time\nMy niggas sell crack, with a package of dimes\nHundred or more, in front of the store, waitin to bubble\nBrand new nine, and an eight in a bubble\nI put sixteen above ya neck, I love my set\nNiggas think they a thug, then thug to death (uh-huh)\nCause the P gonna squeeze 'til no slugs is left (what)\nYou know I'm good with a hundred of 'dro, gun and an O\nYou think your shit butter? Hop in front of this toast\n\n[Sheek Louch]\nYo, aiyyo, aiyyo\nI say what I want, fuck what y'all think is cool\nAnd I hate cops, cause most y'all was dicks in school\nNo pussy gettin niggas tryin to cuff the God\nPlay Sheik out in the yard, but that shit too hard\nMy dough too long, nowadays, my flow too strong\nWhat y'all make in a year, I kick that for a song\nCheck my car, I don't care, I don't play fair\nKeep some shit in the stash box, then get me the chair\nAnd it don't buck shot and the blast is hard to hear\nI'm a true thug nigga, bring it straight to your crew\nSmall yell when I rap, I'm basically talkin to you\nYou see the pain in my eye? Nigga, the flame in my eye?\nI'm tryin to leave my kids some real fuckin change when I die\nFrom rappin or tellin some cat to reach for the sky\nI'm that hunt down nigga, with the four pound nigga\nBounty hunt your whole crew til my bullets go through, WHAT?\n\n[Jadakiss]\nYo, yo, yo, yo\nAll I need is a big gun and a Coupe that's crazy quick\nA nice house with five rooms, maybe six\nA town where money is coming, eighty bricks\nBreak 'em down to all twenties, is a crazy flip\nBet you never even felt the heat\nTil I put the M1 next to your waves and melt the grease\nStreets help niggas; niggas don't help the streets\nY'all use beats for help; we help the beats\nWho want it with me? Who want it with Sheek? Who want it with P?\nIf I say so myself, it's a wonderful three\nBe in the hood with all your jewels in the glovebox\nSame niggas that-a rob you love L.O.X. (uh)\nAll types of burners, even snub Glocks (uh)\nNice size tecs you could carry in your sweats (uh)\nFind your man dead in the trunk of a car (uh)\nIt's Jada {*mwwaa*} responsible for breakin your heart (uh)\nUh\n\n[Drag-On]\nCreep through the streets\nFor some of y'all rappers, that's mighty hard\nMe the Security? Protectin my body? I let my shotty guard\nPut chill pills in brains, bullets like Tylenol\nMake niggas drowsy from the blood loss, got em noddin off\nAnd take casket naps, fuck that\nYou shoulda never let this bastard rap\nAll I know is cold winter, hot slugs through your snorkel\nNo parents, tale from my horror's no morals\nRaised in the wrong era, with no guidance\nSo you dyin? It's no problem, no lyin\nDrag's fire; so ya hamburger beef? I french-fry 'em\nDrag done ate your food\nLike I know to raise your dukes so guard your chin up\nDrag barrels, but shit, I spit-bubble your skin up\nDrag scorch niggas for dinner but season 'em well\nI don't brag I let the streets tell\nPo'-po' now you see he fell\n\n[DMX] {*overlapping last line*}\nUh, uh, now you motherfuckers\nKnow what my name means when you hear it in the streets (uh)\nY'all bitches fear it cause you weak\nYou wanna hear it? I make it speak (WHAT?)\nYou ain't ever bust a gun, but there's a lot of greasy talkin (uh-huh)\nWhat the science behind that son? (I don't know)\nA lot of easy walkin\nI bust shit down (uh) got down (uh) kick down (uh) shot down (uh)\nAin't tryin to talk about what I got now, but I got now (WHAT?)\nI ain't never sold a brick, I done stuck niggas up (c'mon)\nAnd for talkin too much shit? I done fucked niggas up (uh)\nIt can get \"Dark\" for real, and I think you already know that (uh-huh)\nWell think about it with the brick in your hand before you throw that\nNow don't act, cause actin might get you rollin\nWith what you ain't ready to handle (UHH)\nAll that's left of your memory, is a candle (WOO!)\nIt happens quick fast nigga, to bitch ass niggas\nTalkin reckless behind your back, them kiss ass niggas (uh)\nFrom the rap shit to the street shit, I keep shit tight\nLet them cats spit that weak shit (What!)\nI'm DOG FOR LIFE! NIGGA!\n\n[Styles] (Sheek)\nThey gon' need extra guns and extra blocks\n(They wanna Ruff Ryde, Ruff Ryde, Ruff Ryde)\nThey gon' need extra jails and extra cops\n(They wanna Ruff Ryde, Ruff Ryde, Ruff Ryde)\nThey gon' need extra pits and extra Glocks\n(They wanna Ruff Ryde, Ruff Ryde, Ruff Ryde)\nThey gon' need extra chains and extra watches\n(They wanna Ruff Ryde, Ruff Ryde, Ruff Ryde)\n\nThey gon' need extra guns and extra blocks\n(They wanna Ruff Ryde, Ruff Ryde, Ruff Ryde)\nThey gon' need extra jails and extra cops\n(They wanna Ruff Ryde, Ruff Ryde, Ruff Ryde)\nThey gon' need extra pits and extra Glocks\n(They wanna Ruff Ryde, Ruff Ryde, Ruff Ryde)\nThey gon' need extra chains and extra watches\n(They wanna Ruff Ryde, Ruff Ryde, Ruff Ryde)", "image": "https://images.genius.com/57efb548310ed90e73d9200fd01a3e59.630x630x1.jpg"}], "artist": "DMX"}