{"songs": [{"title": "My Summer Vacation", "album": "Death Certificate", "year": "1991-10-29", "lyrics": "[Airline attendant]\nThis is the final boarding call for flight 1259 departing from Los Angeles. Final destination to St. Louis. Thank you\n\n[Verse 1: Ice Cube]\nDamn G, the spot's gettin hot\nSo how the fuck am I supposed to make a knot?\nPolice looking at niggas through a microscope\nIn L.A. everybody and they momma sell dope\nThey trying to stop it\nSo what the fuck can I do to make a profit?\nCatch a flight to St. Louis\nThat's cool, cause nobody knew us\nWe stepped off the plane\nFour gang bangers, professional crack slangers\nRented a car at wholesale\nDrove to the ghetto, and checked in a motel\nUnpacked and I grab the three-eighty\nCause where we stayin, niggas look shady\nBut they can't fade South Central\nCause bustin a cap is fundamental\nPeepin' out every block close\nSeein which one will clock the most\nYeah this is the one no doubt\nBust a U, Bone, and let's clear these niggas out\n\nAy ay man, whassup nigga?\nYo, well this Lench Mob nigga!\n*gun shots*\n\n[Verse 2: Ice Cube]\nNow clearin em out meant casualties\nStill had the L.A. mentality\nBust a cap, and out of there in a hurry\nWouldn't you know, a driveby in Missouri\nThem fools got popped\nTook their corner next day, set up shop\nAnd it's better than slangin in the Valley\nTriple the profit makin more than I did in Cali\nBreakin off rocks like Barney Rubble\nCause them mark-ass niggas don't want trouble\nAnd we ain't on edge when we do work\nPolice don't recognize the khakis and the sweatshirts\nGetting bitches and they can't stand a\nNineteen-ninety-one Tony Montana\nNow the shit's like a war\nOf gang violence, where it was never seen before\nPunks run when the gat bust\nFour Jheri curl niggas kickin up dust\nAnd some of them are even lookin up to us\nWearing our colors and talkin that gang fuss\nGiving up much love\nDyin for a street, that they never heard of\nBut other motherfuckers want to stand strong\nSo you know the phrase, once again it's on\n\n[TV announcer]\nTop of the news tonight, gangs from South Central, Los Angeles which are known for their drive-by shootings have migrated into East St. Louis, leaving three dead and two others injured. No arrests have been made. Police say this is a nationwide trend, with similar incidents occurring in Texas, Michigan, and Oklahoma\n(\"If it can happen here, it can happen anywhere!\")\n\n[Verse 3: Ice Cube]\n(BOOM) My homie got shot he's a goner, black\nSt. Louis niggas want they corner back\nShooting in snowy weather\nIt's illegal business, niggas still can't stick together\nFuckin police got the 4-1-1\nThat L.A. ain't all, surf and sun\nBut we ain't thinkin, bout the boys\nFeudin, like the Hatfields and McCoys\nNow the shit's gettin tricky\nCause now they lookin for the colors and the Dickies\nDamn, the spot's gettin hot from the battle\nAbout to pack up and start slangin in Seattle\nBut the NARCs, raid about six in the morning\nTry to catch a nigga when he's yawnin\nPut his Glock to my chest as I pause\nWent to jail in my motherfuckin drawers\nTryin to give me, fifty-seven years\nFace'll be full of those tattooed tears\nIt's the same old story and the same old nigga stuck\nAnd the public defender ain't givin a fuck\nThe fool must be sparkin\nTalkin about a double life plea bargain\nYou got to deal with the Crips and Bloods by hand, G\nPlus the Black Guerilla family\nAnd the white pride don't like no side\nAnd it's a riot if anyone of us die\nNo parole or probation\nNow this is a young man's summer vacation\nNo chance for rehabilitation\nCause look at the motherfuckin years that I'm facin\nI'mma end it like this cause you know what's up\nMy life is fucked\n\n[Man and (Police)]:\nPolice, eat a dick straight up\n(Look here you goddamn nigga, you're not gafflin nobody\nYou fuckin' understand me? [Kick his ass, put him down]\nThat's right, get down on the goddamn ground NOWWWW! Fuckin move, NOWWW! [Let me take a shot at him])\n(We're gonna do you like \"King\")\nWhat goddamn \"King\"?\n(Rodney King, Martin Luther King,  and all the goddamn Kings from Africa.)\nMan 2: Look out, motherfucker\n(gunshots followed by thuds and unresponsive police radio)", "image": "https://images.rapgenius.com/89a02ab603eae95e0d380fcd08eda589.1000x1000x1.jpg"}], "artist": "Ice Cube"}