{"songs": [{"title": "Proof Freestyle (Invasion)", "album": "Shady Times: Invasion, Pt. 1", "year": "2002-11-01", "lyrics": "[Intro]\nAyo, for that nigga Green Lantern\nYou know what I'm sayin'?\nD12, Big Proof (haha)\nRepresentin' the Shady Records family\n(Kuniva), Obie Trice, 50 Cent (Kon Artis, Swifty, Bizzy, Shady)\nYou know what I mean?\nSo I'ma do this man, you know what I mean?\nD12 all day\nY'all niggas out there spittin' venoms and shit, right?\nI ain't even gotta say your name\nY'all can't even rap, you know what I'm sayin'?\nSo I do my thing\nListen, listen\n\n[Verse 1]\nAyo\nLet L lick his lips and Em hate his mom\nI'm the Genghis Khan of rap, dangerous on tracks\nCame to diss the wack, weak, the plain garbage\nI crave for respect so don't act like I ain't starvin' (I'm hungry)\nYou a pitiful wack rhymer, you a bitch nigga\nOh, you get it from yo' momma\nI bomb your armour till your limbs and branches of your tree tim's\nMurk the world, no way we can be friends\nProof is none of your semen, believin' anything\nBreathin' around a heathen, must be rush to receivin'\nPeace to Young Z and, Pacewon, ain't none\nReady to spit fire, bitch I'm a lace blunt\nAnd what they lace me with, you can't replace the kid\nMy words be like surgery makin' faces lift\nI'm a Matrix glitch, call me deja vu\nI daze your crew, niggas know not to hate at Proof\n\n[Hook]\nI'ma shoot at all y'all, for fucking with my dogs\nI'ma shoot at all y'all, for fucking with my dogs\nI'ma shoot at all y'all, for fucking with my dogs\nI'ma shoot at all y'all, for fucking with my dogs\n\n[Outro]\nIt's like that\nIt's like that, D12 man\nWe can rhyme, we can spit\nWe can do whatever, you know what I'm sayin'\nWe can spit with the rhymes, we can spit with the nines\nYou know what I'm sayin'?\nMotherfuckers wanna rhyme\nMotherfuckers wanna get in this little political game\nTo boost their sales at retail, you know what I'm sayin'?\nWe ain't into that shit, nigga\nWe doin' this for life, nigga\nWe doin' this shit for real\nThink what you wanna think\nLet the purple pills shake and fill you\nDon't think you can't get popped outside of popular music, nigga\nYou heard me?\nJust cuz they go pop don't mean the niggas won't pop, nigga\nShit\nDon't get the Hollywood shit fucked up cuz you see me on TV all the time\nAnd we do it bigger than y'all\nRemember that though\nWe do it bigger than y'all, that means we make more money than y'all\nWe get more money than y'all, we get our way more than y'all\nY'all wanna go to war\nDon't go to war with motherfucking shanks and bats (haha)\nNigga cuz we come to motherfucking war with tanks and gats\nIt's a difference nigga\nAnd niggas grow up baby\nIt's a grown man world, I ain't playin' man\nI ain't losin' man, none of my niggas\nListen, ask somebody\nPut your head to the ground, nigga\nDetroit City\n*gunshot*", "image": "https://images.genius.com/9aa2b669d2a5f46dc081ba18ab21f7aa.500x500x1.jpg"}], "artist": "Proof"}