{"songs": [{"title": "Back 2 Back", "album": "No Ceilings 2", "year": "2015-11-26", "lyrics": "[Intro: Lil Wayne]\nDope man\nDope man, coke man\nYeah\n\n[Verse 1: Lil Wayne]\nI play the Porsche, 918\nI mean the Spyder, you do not know what I mean\nI got a driver for my drop top limousine\nGo ask your bitch, I bet she know 'bout Mr. G\nYeah, he like to talk\nShe like to talk\nSo when he drop her off\nThey have a heart to heart\nGuess he got all the answers\nAnd I got all the verses\nMy Benzo got no ceilings\nBut the windows came with curtains\nSo me and G swervin'\nMe and G swerve\nI keep the double-R, me and Steve Kerr\nPopping these Percs like I'm on injury reserve\nAnd when the pockets full of lint, we want that lint to be fur\nAmen, Amen\nNo baking soda, my nigga, we play it raw\nWe put some holes in them niggas, we playin' golf\nWant you to know it's me nigga, my mask off\nCut out your tongue, put that bitch in a glass jar\nThen drop it off to your kid's classroom\nDirt bags, we belong on a vacuum\nA pad room, I fuck in my bathroom\nLong hallways, my room is the last room\nLong hard days, my schedule don't have room\nYou home all day, you stuck on your Macbook\nI'm gone all day, I'm chasing that checkbook\nI'm stoned all day, I'm stoned all day, I'm on D'ussé\nAnd back in the day we was on section eight\nNow we in our own section, motherfucker like \"Ayy\"\nAll you niggas know what time it is like Flav\nPublic Enemy Number One like Flav\nFifteen with a mouth full of golds like Flav\nFifteen with a house full of hoes like Hef\nGave G the day off 'cause the car park itself\nShots take off like a stealth\nAnd they landing in your scalp\nLetting human heads replace the Grammies on the shelf\nPut a bitch head right below the belt 'til she belch\nAnd she won't get a dollar; zero, zilch\nCup muddy-muddy, muddy-muddy-muddy\nTunechi pass the blunt, I'm gon' need time to study\nThey don't know who got the gun\nBut they know who got the money\nWe don't wanna know what's up\nWe wanna know who got the money\nWhat these niggas wanna do?\nWhat these bitches want from me?\nBitches claiming I'm a dog\nBut these bitches want puppies\nThese bitches bring luggage\nMy bitches bring others\nMy bitches bring rubbers\nYour bitches burn rubbers\nYour bitches burn supper\nI'm still major and I made you niggas\nYou getting bodied by a skater nigga\nI'm not the type of nigga that be Skypin' bitches\nShout out to all my bitches one nightin' niggas\nWoah, make sure you hit 'em with the Slut Walk\nYeah, then text that man to fuck off\nAnd I pour up another one, another one\nThe cream soda tasting like bubble gum\nWoah, straight swerving on these niggas\nFrom Collins, to Highland, to Bourbon on these niggas\nThem other niggas just wasn't deserving of me, niggas\nSo I'm swerving on them niggas\nNo more Family Matters, no more Urkel on them niggas\nI'm feeling like a born again virgin on them niggas\nI'm running to the bank, quick as Herchel on them niggas\nWhat's in your wallet?\nI done went commercial on them niggas\nOn purpose on them niggas\nAll black hoodie, all black gat to match\nYeah, put it to your hat, and Blat!\nWhen we see you, boy, them shots be coming back to back\nLong hair, don't care, nigga; Cactus Jack\nNo Ceilings", "image": "https://images.genius.com/ed7fb7fe9af1d913b520bf5336619560.800x800x1.jpg"}], "artist": "Lil Wayne"}