{"songs": [{"title": "New Body", "album": "Jesus Is King", "year": null, "lyrics": "Lyrics from Snippet\n\n[Intro]\nOh my God, Ronny\n\n[Chorus: Ty Dolla $ign]\nCan't wait to see your new body\nYour Holy, Holy and new body\nYou'll be born again in your new body\nSo it's only fair to your new body, woah\n\n[Verse 1: Kanye West]\nNew walk, new talk\nWho that, who this?\nWho else you know this bad with two kids?\nNobody nowhere, ever gave you this\nNobody flew to Colombia, like you did\nTrying the new dress out with the new drip\nBuying a new bag, first one to get\nOther than this, it's on the to-do list\nAnd I get in fluent all by the influence\nOld sins don't count\nOld friends might bounce\nTold the devil, \"Get behind me, I ain't ever going out\"\nStart, the leaders tryna doubt\nBut we never going out\nMy body's soul, so who you dealing wit now?\nThis a new jig, got a party table at the Ruth Chris\nAll God's children take a group pic\nTurn the flash off 'cause we too lit\nYou used to twerk to every-every song\nYou done partied every way, now you're very, very on\nSpent it on a bottle like Christ on the phone\nAll glory be to God, Hallelujah, carry on\n\n[Chorus: Ty Dolla $ign]\nCan't wait to see your new body\nYour Holy, Holy and new body\nYou'll be born again in your new body\nSo it's only fair to your new body, woah\n\n[Chorus: Ty Dolla $ign]\nCan't wait to see your new body\nYour Holy, Holy and new body\nYou'll be born again in your new body\nSo it's only fair to your new body, woah\n\n[Verse 2: Ty Dolla $ign]\nNew body, you ain't working hard\nBut I gave my life to you, you deserve it all\nNow if he calls you, I ain't perfect\nI know sometimes I agree, but it's worth it\nTryna put my legs up, never give up\nOnly thing I'm tryna do is give that sin up\nLook at the scoreboard, I love to show off\nAnd if anybody step to you, then they too wrong\n'Cause every last one, go ahead, return it\nAnd if the price ain't what you asked for, every sermon\nThat's why I'm turning to Your commandments\n'Cause I know all you do is give me strength, yeah\n\n[Chorus: Ty Dolla $ign]\nCan't wait to see your new body\nYour Holy, Holy and new body\nYou'll be born again in your new body\nSo it's only fair to your new body, woah", "image": "https://images.genius.com/ab09c19cd6d1cd680afe611f1159ad57.892x892x1.png"}], "artist": "Kanye West"}