{"songs": [{"title": "Generique Assault", "album": null, "year": null, "lyrics": "[Verse 1]\nYeah... KRS-One bout to wreck the joint\nI was seen openin up at the edge of Detroit\nWhere the cops go beyond the laws\nWhere enemies work together by putting they shit on pause\nSo what does it mean, Assault on Precinct 13?\nYou are bout to see just what the dirt brings\nIt's working, that force, I have been searching\nLike Lawrence Fishburne when it's time to hurt things\nEthan Hawke, man he face all that\nI hold the mic like Ja held the baseball bat\nI stay ahead, like a baseball cap\nThe ways of the world, Kris don't chase all that\n\n[Chorus]\nWe gettin up outta here, that's what's up. That's what's up\nWatch me back up the truck\nYou livin wit a lot of fear. That's what's up, my gats stay up\nSo crooked cops you backin me up?\nWe gettin up outta here, that's what's up. That's what's up\nWatch me back up the truck\nYou livin wit a lot of fear. That's what's up, my gats stay up\nSo crooked cops you backin me up?\n\n[Verse 2]\nWell as I walk through the street, my spirit will speak\nTo those I meet and great from week to week\nI am not my handsome beat. I command the speak\nAs the observer inside the physique\nMany rappers try to compete, of course\nBut they got smashed and trashed in the streets and tossed\nSometimes I think we all just lost\nWe just flashin and flossin the disasterous cause\nWe don't even know the one-ness of the only force\nInstead of a golden calf, we got a platinum horse\nBut what did Moses do with the golden calf?\nThrew the log at it and it ended in a blast\nMaster, get on them quick, get on them faster\nIn the background you frontin, cuz there's nothing but laughter\nI tag church like the shirt king\nTurn up the track for Assault on Precinct 13\n\n[Chorus]\nWe gettin up outta here, that's what's up. That's what's up\nWatch me back up the truck\nYou livin wit a lot of fear. That's what's up, my gats stay up\nSo crooked cops you backin me up?\nWe gettin up outta here, that's what's up. That's what's up\nWatch me back up the truck\nYou livin wit a lot of fear. That's what's up, my gats stay up\nSo crooked cops you backin me up?\n\n[Verse 3]\nWow, what an ending. What a conclusion\nThey thought they was winning, but they really was losing\nHe though he was sinnin, but he really was proving\nThat leadership keeps it moving, steady cruising\nGuns up, funds up, from sun up to sun up to sun up\nBuck buck buck! Yo, duck duck\nWe run up, two down, one up\nDope MCs see me and get butterflies in they stomach\nOthers can't speak, they just shut up\nKRS on the come up, liftin Big Pun up. Let me sum up\nDope MCs, wack MCs, thin MCs, fat MCs, commercial MCs\nThey can't all get done up\nRaise the drum up, breath for breath, I'll rip your lung up\nOn my trophy wall, I'm nailing your tongue up\nKRS-One, you know what it means\nTurn up the track for Assault on Precinct 13\n\n[Chorus]\nWe gettin up outta here, that's what's up. That's what's up\nWatch me back up the truck\nYou livin wit a lot of fear. That's what's up, my gats stay up\nSo crooked cops you backin me up?\nWe gettin up outta here, that's what's up. That's what's up\nWatch me back up the truck\nYou livin wit a lot of fear. That's what's up, my gats stay up\nSo crooked cops you backin me up?\n\n[Verse 4]\nWe gotta start trusting each other right now if we gonna make it\nThrough this night\nFrom Criminal Minded to Spiritual Minded, and even beyond and behind it, never be afraid to fight\nOr be the lazy type. Me, I'm the crazy type\nI get them clubs so crazy hype\nI throw them glasses on that them ladies like\nAnd years later, rock what they babies like\nI blaze the light, there me be 8,000,000 ways to die\nBut there's 16,000,000 ways to fight\nSo wherever you are,in the crib or your car, in your tank too\nKRS-One would like to thank you, right\nThat's why KRS on the mic\nWishin you peace for the rest of the night\nCuz at the end of the film, you'll see what it mean\nTurn up the track for Assault on Precinct 13!\n\nFresh (fresh)... For 2005... You suucckkkkaaaa!", "image": "https://images.genius.com/e9fa55af2e8bfddf3b40ea0e0347874f.556x556x1.jpg"}], "artist": "KRS-One"}