{"songs": [{"title": "1 in the Morning", "album": "The DEFinition", "year": "2004-08-31", "lyrics": "[LL Cool J]\nIt's one in the mornin - you know what time it is!\nIt's one in the mornin\nIt's one in the mornin - you gonna have come out your clothes on this one\nIt's one in the mornin\n\nYeah I'm still at it, the microphone addict\nYou get your dome splattered, cause homey will not have it\nYour ashes get scattered across the Atlantic\nFor actin like you a teenage chick with her bra padded\nYou might laugh at it, but if you do the knowledge\nIt's really a tad tragic how they runnin through they cabbage\nYou know my track record, L battle like a savage\nI think and grow rich, that gives me the advantage\nUncle LL, I got product for sale\nSo I can bail Al Sharpton out of jail\nSomebody gotta do it, somebody in the black community\nGotta get this money while y'all march for unity\nSo march on, I'ma get my Bentley park on\nThen get my dogs a platform to bark on\nThe realest brother, you Nicole Kidman, one of 'The Others'\nChildren shiverin under the covers\nThe man in black, the tilted Fedora hat\nI'm bringin it raw, you never want your money back\nI'm focused baby, livin like a quarterback\nPlayin in the wishbone, L keep options black\nSystematically, burn you like calories\nWatch your mouth, go earn your lil' salary\nI'm a classic like Nike Airs and Wallabees\nYou could catch it like the flu, homey follow me\n\n[Chorus]\nIt's one in the mornin - flash the dough\nIt's one in the mornin - crack the Mo'\nIt's one in the mornin - get on the flo'\nIt's one in the mornin - who wanna go?\n\n[LL Cool J]\nThat's right Sleeping Beauty, wake up see the light\nThat Tylenol PM got you caught for your BM\nEverybody can see I'm the king of rippin coliseums\nC'mon, youse a male groupie beggin for per diem\nA fruitcake laid out in the masoleum\nI'm the richest man in Babylon, nobody could see him\nMoney's my slave, it do what I say\nIt cry for me, like Denzel in \"Glory\"\nBut I broke the cycle, no more poverty\nI wonder if you hatin on the low - probably!\nBut cats know I'm real, I keep 'em on they heels\nDamn!  Look at my body, coulda been a Navy Seal\nBut you lack the discipline to do what I do\nReinvention, I'm in the 11th dimension\nI'm a value stock pop, get it while it's hot\nCause once I blow, I'ma split and that's it\n\n[Chorus] - repeat 2X\n\n[LL Cool J]\nAiyyo E it's one o'clock\nTime to get one and bounce baby\nIt's time to get one and bounce, you know what time it is\n\nYour honor, last week he punched me in my face\nI want twenty million, you know he liftin weights\nLast week, me and the President was takin flicks\nLast week, my video dropped and you was sick\nLast week, I copped my lil' shorty some kicks\nThat cost 29 hundred, homey you don't want it\nMy ears stay flooded like your man stay blunted\nMy American Express is Black, I'm at the Summit\nThe Benjamin Grier of Def Jam, y'all know\nMy po'tfolio was sicker than polio\nFor real God is good, he took me out the hood\nGot me livin in a mansion like a big boy should\nAnd I never do Cribs, I ain't gonna have y'all fruitcakes\nKnowin how I live, bed extra big\nYou sit around, run your mouth, POTbelly on the couch\nClaimin you hot but honey what you wove out\nWhen she alone, pump L, I make her bounce\nYou on the corner riskin your life to sell a ounce\nWish you was Pablo, lay in the carbo\nWith a chick named Margo who flew from Chicago\nBut no, in real life cats catch it\nIt's not what you expected huh?  Life kinda hectic huh?\n\n[Chorus] - repeat 2X\n\n[LL Cool J]\nYeah yeah\nIt's the definition\nDefinition\nDefinition potna, eleven in a row!", "image": "https://images.genius.com/b42398fade2d37f1bf7eaa68c9bd69dc.1000x1000x1.jpg"}], "artist": "LL Cool J"}