{"songs": [{"title": "The Coming (Intro)", "album": "The Coming", "year": "1996-03-26", "lyrics": "[Verse 1: Lord Have Mercy]\nIt was a dark night, pitch black, May 20, 19...\nApproximately 11:30 p.m., a black child was born\nUpon his arrival and rapid growth\nBeing exposed to the many casualties of the streets\nHe has now realized what must be done....\nHe must bring the ruckus to all you mothafuckas..\nHe must bring the ruckus to All you mothafuckas..\nHe must bring the ruckus to ALL you mothafuckas!\n\n[Verse 2: Rampage the Last Boy Scout]\nAnd now for the moment all you motha fucka's been waitin' for...\nAll my flipmode niggas rise and awake for\nThe most powerful event to occur..THE COMING!!\nOnce again you now rockin' wit the best\nFlipmode is the squad for the year of 1996\nUH! Rampage the Last Boy Scout is who I be\nHere to take you on another ride of the\nFlipmode explosion. Street to street, land to land\nCoverin' all burial grounds in your area\nI'm here to bring on my physical\nThe 8th wonder of the world\nStraight from the dungeon shot\nThe infamous, the infamous, Busta Rhymes!\nBoy Scout's who I be, Flipmode is still the squad...\n\n[Verse 3: Busta Rhymes]\nYo, hey yo, yo, this joint right here, is dedicated to all the\nMu'fucka's who fell off...and the mu'fucka's who's about to fall off!\nYo, keep falling, keep fallin', hey!\nKeep falling, yo, keep fallin', keep fallin\nThis is specifically for the mothafuckas who came out here\nClaimin' to represent hip-hop but really didn't do shit\nTo preserve the value of the fuckin' artform\nThe way of life. Hip-hop is a way to live man;\nIt ain't no institutionalized religion or somethin'\nIt's a way to live, it's a culture, dog, you know what I mean?\nYou know, so if you ain't really got nuthin beneficial\nTo offer this hip-hop shit, preserve the value of the artform\nThe music, the way of living, don't even fuck wit it!\nWe don't need deadweight mothafuckas\nThis is where we at as it stands right now\nIn the current day of 1996, mothafuckas\nThere's only four years left. This is dedicated to\nAll the niggas who keep falling, keep fallin', so keep fallin'!\nAAAAAAHHHHHH!!! Ha, so keep fallin'..........thanks a lot", "image": "https://images.genius.com/e8769bd52f12b0c4930edbc0a93c9cca.1000x973x1.jpg"}], "artist": "Busta Rhymes"}