{"songs": [{"title": "Brainless", "album": "The Marshall Mathers LP2", "year": "2013-11-05", "lyrics": "[Intro]\nOr Eminem has a full line of chainsaws\nEminem, Eminem, Eminem, Eminem, Eminem, Eminem\nMarshall Mathers, Eminem, the rapper Eminem\n\"Who can say for sure? Perhaps a frontal lobotomy would be the answer. If science could operate on this distorted brain and put it to good use, society would reap a great benefit.\"\n\n[Verse 1]\nI walk around like a space cadet, place your bets\nWho's likely to become a serial killer? Case of Tourettes\nFuck, fuck-fuck, can't take the stress\nI make a mess as the day progresses\nAngry and take it out on the neighbors' hedges\nLike this is how I'll cut your face up, bitches, with these hedge-trimmin' scissors with razor edges\nImagination's dangerous, it's the only way to escape this mess\nAnd make the best of this situation, I guess\n'Cause I feel like a little bitch, this predicament's\nDespicable, I'm sick of just gettin' pushed, it's ridiculous\nI look like a frickin' wuss, a pussy, this kid just took\nMy stick of licorice and threw my sticker books in a picker bush\nI wanna kick his tush, but I was six and shook\nThis fucker was 12 and was six foot, with a vicious hook\nHe hit me, I fell; I got back up, all I did was book\nNow there's usin' your head, Momma always said—\n\n[Chorus]\n\"If you had a brain, you'd be dangerous\nA brain, you'd be dangerous\" (I'ma prove you wrong)\nMomma, I'ma grow one day to be famous\nAnd I'ma be a pain in the anus (I'ma be the bomb)\nI'ma use my head as a weapon\nFind a way to escape this insaneness (Momma always said)\n\"Son, if you had a brain, you'd be dangerous.\"\nGuess it pays to be brainless\n\n[Verse 2]\nFast forward some years later, a teenager; this is fun, sweet\nI just got jumped twice in one week, it's complete\nIt's usually once a month, this is some feat I've accomplished\nThey've stomped me into the mud, gee, for what reason you stumped me?\nBut how do you get the shit beat out of you, beat down\nAnd be upbeat when you don't have nothing?\nNo valid shot at life, chance to make it or succeed\n'Cause you're doomed from the start, it's like you grew up on Jump Street, from jump street\nBut if I could just get my head out my ass\nI could accomplish any task, practicin' trash-talkin' in a trance\nLocked in my room, yeah, but I got some plans, Momma\nThese damn rhymes are fallin' out of my pants pocket, I can't stop it!\nAnd I'm startin' to blend in more, in school this shit helps for sure\nI'm gettin' more self-assured than I've ever been before\nPlus no one picks on me anymore\nI done put a stop to that, threw my first punch—end of story\nStill, in my skull’s a vacant empty void, been usin' it more as a bin for storage\nTake some inventory: in this gourd there's a Ford engine\nDoor hinge, syringe, an orange, an extension cord, and a ninja sword\nNot to mention four linchpins, an astringent stored\nIronin' board, a bench, a wrench, a ore winch, an attention whore\nEverything but a brain, but dome's off the fuckin' chain\nLike an independent store, something's wrong with my\nHead, just think if I had a brain in it, thank God that I\nDon't, 'cause I'd probably be Dahmer, 'cause Momma always said—\n\n[Chorus]\n\"If you had a brain, you'd be dangerous\nA brain, you'd be dangerous\" (I'ma prove you wrong)\nMomma, I'ma grow one day to be famous\nAnd I'ma be a pain in the anus (I'ma be the bomb)\nI'ma use my head as a weapon\nFind a way to escape this insaneness (Momma always said)\n\"Son, if you had a brain, you'd be dangerous.\"\nGuess it pays to be brainless\n\n[Bridge]\nNow my mom goes wahm-wahm-wahm\n'Cause I'm not that smart, but I'm not dumb\nI was on the bottom of the pile, gettin' stomped\nBut somehow I came out on top\n\n[Verse 3]\nI told you one day, I said they'd have that red carpet rolled out, yo\nI'm nice, y'all, fuck it, I'm out cold, now everywhere I go\nThey scream out, \"Go!\", I'm 'bout to clean house, yo\nI'm Lysol, now I'm just household\nOutsold the sell-outs, freak the hell out Middle America\nHear 'em yell out in terror, they were so scared, and those kids\nJust about belted out whatever spouted\nOr fell out my smart aleck mouth, it was so weird\nInappropriate? So be it, I don't see it\nMaybe one day when the smoke clears, it won't be as\nMotherfuckin' difficult, yeah\n'Til then, hopefully you little homos get over your fears and phobias\nIt's okay to be scared straight, they said I provoke queers\n'Til emotions evoke tears, my whole career's\nA stroke of sheer genius, smoke and mirrors, tactical, practical jokes, yeah\nYou motherfuckin'— insert insult here\nWho the fuck woulda thunk that one little ole MC'd\nBe able to take the whole culture and reupholster it?\nAnd boy, they did flock; can't believe this little hick locked\nThis hip-hop shit in his hip pocket, and still the shit got\nThat white-trash traffic in gridlock, shit hoppin' like six blocks\nFrom a Kid Rock/Insane Clown Posse concert in mid-Oc-\n-tober, and God forbid I see a wizard\nAnd get a brain in my titanium cranium, y'all\n'Cause I'll turn into the Unabomber, Momma always said—\n\n[Chorus]\n\"If you had a brain, you'd be dangerous\nA brain, you'd be dangerous\" (I'ma prove you wrong)\nMomma, I'ma grow one day to be famous\nAnd I'ma be a pain in the anus (I'ma be the bomb)\nI'ma use my head as a weapon\nFind a way to escape this insaneness (Momma always said)\n\"Son, if you had a brain, you'd be dangerous.\"\nGuess it pays to be brainless\n\n[Outro]\n\"Insaneness\" ain't even a word, you stupid fuck!\nNeither is \"ain't\"", "image": "https://images.genius.com/2c354260f9edc6b2e9bf6b06c935a0b8.1000x1000x1.png"}], "artist": "Eminem"}