{"songs": [{"title": "Believe", "album": "Revival", "year": "2017-12-15", "lyrics": "[Verse 1]\nAnd I started from the bottom\nLike a snowman—ground-up\nLike round chuck, and still put hands on you\nStayin' wound up is how I spend time (Get it?)\nSucker free, confidence high\nSuch a breeze when I pen rhymes\nI just got that air about me like wind chimes (Yeah)\n'Nother day in the life (Uh)\nUsed to have to scrape to get by (Yeah)\nNow my community's gated and I\nMade it and my neighbors say hi (Say hi)\nI'm givin' 'em pounds, I'm upscale now\nGuess it means I'm way in the sky (Way in the sky)\nBut I still remember the days of\nMinimum wage for general labor\nWelfare recipient since a minor\nLook how government assistance has made ya!\nAdversity, if at first you don't succeed\nPut your temper to more use\n'Cause bein' broke's a poor excuse\nThat should only give you more fuel\nShow 'em why you're you\nSo close, God, it's like I almost got it\nBut close only counts in time, bombs and horseshoes\nSo I Unabomb shit—tick, tick, tick—no remorse, pew!\nScrew it, I'm lit, and that attitude I blew up on quick\nThat's why they call me firecracker\nI grew up on WIC—wick, wick, wick—with a short fuse\nI got some important news to report to\nAnyone who thought I was done: nah bitch, not quite\nSpotlight's back on, got my faith, where's yours?\n\n[Chorus]\nDo you still believe in me?\nDidn't I give everything I had to give you to make you see?\nI'll never forget if you turn your back on me now\nAnd walk out, I will never let you live it down\nI'll never quit, do you still believe in me?\n\n[Verse 2]\nMan, I know sometimes\nThese thoughts can be harsh and cold as ice\nTo me they're just ink blots\nI just fling 'em like slingshots and so precise\nSo you might wanna think it over twice (Yeah)\nOr you retards can roll the dice\nBut beef will at least cost you your career\n'Cause even my cheap shots are overpriced\nBut this middle finger's free as a bird\nNuke warhead at birth, hugest forehead on Earth\nToo short for the verse, studied his formula, learned\nHow to incorporate a curse\nPoint it towards corporate America\nStick a fork in and turn\n'Cause four-letter words are more better heard\nThe world force-fed a turd to me, you're getting yours\nBut sometimes I overdo it, but I just get so into it\nI was there consolin' you when no one knew it\nWhen your situation showed no improvement\nI was that door, you walked over to it\nI'm the light at the end of the tunnel\nSo people are always lookin' to me as they're goin' through it\nWhen that tunnel vision is unclear\nShit becomes too much to bear\nSince \"Cleanin' Out My Closet\"\nWhen I was havin' trouble with the snare\nI'm that unrealistic prayer answered\nAnd I'ma get you jacked up like you're tryna fix a flat, uh\nWhen you struggle with despair\nThat double-fisted, bare-knuckles coupled with this pair\nOf nuts I'm cuppin', I am your 'fuck it' switch, nothin' can compare\n\n[Chorus]\nDo you still believe in me?\nDidn't I give everything I had to give you to make you see?\nI'll never forget if you turn your back on me now\nAnd walk out, I will never let you live it down\nI'll never quit, do you still believe in me?\n\n[Verse 3]\nStarted from the bottom like a snowman\nOh man, put that in your corncob pipe and smoke that\nBut my battery's low, I'ma need a boost to my pack\nAnd I know that I always got Proof at my back\nI called you \"Proof\" because I knew for a fact\nMy ace in the hole, homie, I'm callin' on you\n'Cause I think I'm slowly startin' to lose faith in it, so\nGive me that inkling and mo–\n–tivation to go, Hussein with the flow\nFake fans that are two-faced didn't show\nLet heartbeats loop, produce hate in my soul\nLayin' vocals two days in a row\nTrue statement, hate to go down this road\nBut there's only one route to cross this bridge\nSo I walk in this bitch with loose change\n'Cause all my dues paid, but this booth's takin' its toll\nBut it's never too late to start a new beginnin'\nThat goes for you too, so what the fuck you gon' do?\nUse the tools you're given!\nOr you're gon' use the cards you're dealt\nAs an excuse for you to not do shit with 'em?\nI used to play the loser/victim\n'Til I saw the way Proof was driven\nI found my vehicle and I haven't ran out of gas yet\nAnd when they stacked decks, turn handicaps into assets\nFanny packs, hourglasses\nIf time was on my side, I'd still have none to waste\nMan, in my younger days\nThat dream was so much fun to chase\nIt's like I'd run in place\nWhile this shit dangled in front of my face\nBut how do you keep up the pace\nAnd the hunger pangs once you've won the race?\nWhen that dual exhaust is coolin' off\n'Cause you don't got nothin' left to prove at all\n'Cause you done already hit 'em with the coup de grâce\nStill you feel the need to go full tilt\nThat Bruce Willis, that Blue Steel, that true skill\nWhen that wheel's loose, I won't lose will\nDo you still believe?", "image": "https://images.genius.com/edd76153e7ac3ec36be997aea55f32ed.1000x1000x1.png"}], "artist": "Eminem"}