{"songs": [{"title": "Camay", "album": "Ironman", "year": "1996-10-29", "lyrics": "[Intro: {\"sample\"} Ghostface Killah & Cappadonna]\n{\"Love was never born to say goodbye\"} What's happening?\n{\"Love was never born to say goodbye\"} Yo, yeah, you smoking?\n{\"Just another helpless fool in love is what I am\"} This is it\n{\"Just another helpless fool in love is what I am\"} Another chamber\nYou know how we do\n\n[Verse 1: Raekwon]\nYo, what's the deal Goldilocks? \"Ain't nothing I'm just hibernating\nLove that watch, pour me some Scotch and cold Courvoisier\"\nNo doubt, have a chair Boo lets get to pollying\nWho you with? \"Me and Molly and some trick who's Yugoslavian\"\nWhat fabric is that? \"It's only wool and Rayon\"\nLipstick crayon, fly Fahrenheit spray on\nI'm getting tipsy, I hope she read cocks like a gypsy\nAnd transporting bricks stealing many fifties\nFuck negotiating. Is you with me? Is you waiting?\nSweet ass carrot cake vegen plus you don't eat turkey bacon\n\"I don't get down like that, I don't get down neither\nCuban links skeezer, why you acting like a rap teaser?\nI'm like the jewelry exchange plus a range\nNigga you small change I only fuck for figaro chains\"\nAnalyzing Miss Clairol, Fendi down, mascara on\nAssistant manager in Paragon\n\n[Hook: {\"sample\"}]\n{\"...say goodbye\"}\n{\"Love was never born to say goodbye\"}\n{\"Love was never born...\"}\n\n[Verse 2: Cappadonna]\nSocializing, vibing with my eyes on Dot\nShe this book cover lady that be blowing up the spot\nWhile my heart was racing like the hands on the clock\nI step live I think she see me putting out the pot\nPeace Dot, I'm so happy to see you at the rendezvous\nHow's life today? Your hands are softer than Camay too\nYour hairdo way more class than Halle Berry\nCaught visions of me and you riding on the ferry\nPlus your daughter Kiki talk to my man Merry\nI order me a Sex on the Beach with the cherry\nI order her a Riunite on ice, sounds nice\nShe elegant, pretty eyes, glasses, intelligent\nWhispered in my ear that she's celibate\nWhispered back to her ear we don't have to go there\nAs I grab the hand, set her politely in the chair\nAs we stopped to stare at one another, black sister to brother\nI'm thinking all the time how she could be my lover\n\n[Hook: {\"sample\"}]\n{\"Just another helpless fool in love is what I am\"}\n{\"Love was never born to say goodbye\"}\n{\"Love was never born to say goodbye\"}\n{\"Just another helpless fool in love is what I am\"}\n\n[Verse 3: Ghostface Killah]\nWhat's happening brown sugar? Say, you look so good today\nAnkle bracelet wrapped around your leg\nHere have a seat, complimentary drinks is on me\nBartender, Chevalier Chateau at table three\nLuxurious rings, eyes sparkling\nWhat's your name sugar? Juanita Cash Hawkins\nYour complexion gives a reflection of\nSometime a black woman just need to be loved\nQuiet and shy, baby girl my gift got you high\nMade you wanna hit me with the keys to that five?\nJust joking baby, I have a sharp sense of humour\nWish I would've bumped into your frame a lot sooner\nWhat's your physical degree, 31? 33?\nHalf Hawaiian with a slight touch of Chinese\nSeen you working at a law firm on Fifth Avenue\nThree blocks from the Gucci spot is where I trapped you\nYo, I'm all into older woman, who's happy living\nLove kids and, keep all our business in the crib and\nAnd not afraid to die with me the God on your side\nWe holding hands and death do us apart and then we slide\nEarring in the left side of your nose, love my combo\nShould have left my Wiz a thousand times, maybe tonight though\nGirl, you sexy motherfucker, damn what's the recipe?\nYou make a nigga wanna goddamn!\nCan you cook darling? At the stove you're evolving\nBaked macaroni, turkey wings, a nigga starving\nHere take my number let me pull the chair from under\nI had fun plus your backyard speak with thunder\n\n[Hook: {\"sample\"}]\n{\"Love was never born to say goodbye\"}\n{\"Love was never born to say goodbye\"}\n{\"Love was never born to say goodbye\"}\n{\"Love was never born to say goodbye\"}\n{\"Love was never born to say goodbye\"}\n{\"Just another helpless fool in love is what I am\"}\n{\"Just another helpless fool in love is what I am\"}\n{\"Just another helpless fool in love is what I am\"}\n{\"Just another helpless fool in love is what I am\"}", "image": "https://images.genius.com/909e78d9675789a6907b006c97d4c914.600x595x1.jpg"}], "artist": "Ghostface Killah"}