{"songs": [{"title": "Here is Something You Can’t Understand", "album": "Stoned Raiders", "year": "2001-12-04", "lyrics": "Intro - [Kurupt]\n\nYeah bitch\nDogpound and Cypress you fuckers\nWhat you think about that?\nYoung Gotti\nYou brother's don't got it\nB-rizzle you know it, fo' shizzle\nMy nizzle, you gon' get hizzle\nRelax by the kizzle\nAn' go get us a couple hizzles\nYou dizzles\nYeah with Muggs\nWhat it is\nSEN DOOOOOOOOOOG!\nKeep it real gangster\nYeah, B-Real, whaddya gotta say?\n\n[B-Real]\nBitch you try to spit on, you best get on\nBefore things start to happen and I lose my calm\nCuz I just wanna puff weed and tip my cup (Yeah)\nSmoking on the Kush Weed, not giving a Fuck\nRhyme Flow, Mack hoes, and stack dough!\nBut niggas wanna do shit to make me react\nSo \"Insane In The Brain\", let it rain on a bitch nigga\nHanging on my chain cuz you wanna be a rich nigga\nYou can't feel me without the Braille\nIm like that shit that get you amped without the Yale\nMake busters pale 'cos they seen too much\nBut really what they saw was me and Kurupt\n\n[Hook] Repeat 4x\n\n[B-Real]  Here is something you can't understand\n[Sen Dog] How I Could Just Kill A Man\n\n[Kurupt]\nPenitentiaries, stuck for centuries\nYou gotta be real like me and B-Real\nSee you shoot, you ride but we kill\nConcentrate unloadin' our steel\nDippin', hit up niggas, yes we will\nRiding on niggas that when the mayhem spills\nPistols launch off and travel like arrows, animals, Hannibal\nHamlet, and unmanageable\nWhat you gonna get, nigga? Ham on the Table?\nI sic the home girls on you, struck by angels\nGet em up drive by\nWatch em gone drive by\nYeah paranoid, we drive by till we die\nYou niggas really don't know shit\nI treat niggas like hoes when they silly dumb BIATCH!\n\nHook 1 - Kurupt (repeat 2x)\n\nHere is something that they just don't get\nI don't give a fuck nigga, I don t give a shit\nHere is something that they just know\nBack to Fo, creepin' through the back door\n\n[Kurupt] I just DOPE BLAST 'em...\n\n[B-Real]\n... 'Cos I ain t finished yet\nI see remains of someone you ain't diminished yet\nWe re like a pack of piranhas\nIn your Sauna\nAttackin you, till there is nothing left for your mama\nEast side, do or die? Niggas wanna ride\nHitting switches in the Cadillac, getting people high\n'Cos we live this, did this, beatin' like a pistol whip\nDon't pull out ya gat if ya gunna let ya pistol slip\n\n[Sen Dog]\nI'm ignorin' all the DUMB SHIT, 'cos these vatos can't hang\nWith the Mad Dog, nigga, out here runnin' thangs\nDump on that ass if you fuck with my business\nStop Pop, and drop all of you witness\nGlocks lock, and unlock if you listen\nBuck shots, hard stops, no more snitches\nThat's what you get when you fuck with the Real\nHardcore niggas that pack that steel\n\n[Hook 4x]\n\n[Kurupt]\n\nYeah\nThe streets is ran, by heats and mini vans\nInvading the spaces, chucks and fat laces\nThe \"I Don't Give A Fuck\" committee's just arrived\nWith millis and fifty-fives\nHomicidally, I've separated the busters\nBlasted the snitches, broke the switches\nFucked the bitches, invaded the glitches\nStole the riches, booked the bitches\nLike fuck ya interests, nigga\n\n[B-Real]\nPoet in the streets, niggas livin' on the edge\nWe take it to the Darkside, gettin' in your head\nWhile you haunt us like a fed, we twist you like a dreadlock\nHas I got to hammer talkin bitches in the bed?\nWhile you fuckin' with the Soul Assassins and the Dog Pound\nAnd all my latin dog-niggas get to hold it down\nNow your violatin' 'cos you haters know i'm waitin'\nIn the silver stack in the parkin' lot\nWith the handle cocked\n\nHook 2 - Kurupt  {Sen Dog}  (repeat 2x)\n\nHere is something, that I think you just can t understand\n{How I could just kill a man!}\nAnd you wonder why and how it is I could just kill a man\n{How I could just kill a man!}\nYou see, in these streets I pack my heat cuz should it be for real\n{How I could just kill a man!}\nAnd if you think you wanna come and test me, then come deal with my steel\n{How I could just kill a man!}\n\n[Outro - Kurupt]\nYou just don't understand\nHow I could just, kill a man (yeah)\nLa la la la, la la la la-la", "image": "https://images.genius.com/b0e5201adaaa026dce5a41c0cb1c6c5c.300x300x1.jpg"}], "artist": "Cypress Hill"}