{"songs": [{"title": "Doin’ It Again (Remix)", "album": "The Nutty Professor Soundtrack ", "year": null, "lyrics": "Intro: LL Cool J\n\nUh he huh. Remix that joint, word up!\nWe had to remix that joint, smooth it out\nUh he huh, yeah, no doubt, doin it, yeah\nYeah, uh uh doin it, woooo!\nFeeling is strong, uh doin it\nYeah uh, yeah ??? ???\n\nVerse 1:\n\nLL Cool J: I'm in the mood for something wild and obscene\nLeShaun: I hear dat, I'm gettin tired of the same ol' routine\nLL: I need some drama\nLe: Oh, here I come L\nLL: Tattoos and dim lights\nLe: Black young niggette want you's to get it right\nLL: Huh, that's all I need, we got two mouths to feed\nLe: You talkin about some love\nLL: To the six indeed, so uhh\nLay back and let'cha Daddy do it\nLe: A real mack stay on track, he got the run\nLL: Right through it\n\nChorus:\n\nLe: Doin it and doin it and doin it well (Doin it)\nDoin it and doin it and doin it well (Doin it)\nDoin it and doin it and doin it well (Doin it)\nLL: I represent Queens, she was raised out in Brooklyn\n*Repeat*\n\nVerse 2:\n\nLL: I slowed it down cos we was amplifore\nLe: Halfway\nLL: All the way\nLe: Now ya gettin\nLL: Raw to the ----, sick wit it\nLe: Ain't to proud to beg, boy\nLL: That's why I had to hit it, uhh\nI'm in the zone gettin bedrooms props\nI'm talkin outside scenarios\nLe: Ac's\nLL: And parking lots\nLe: Word! You goin there, can-back seats and wild treats\nDaddy do his thing mmm\nLL: It's part of my mystique (He huh huh)\nLe: I'm havin visions on sunsets and waterfalls\nYour hands are in the air, you're up against the wall\nLL: what you lookin for? Point it out\nLe: Promise I'mma get it, send it to me\nLL: Right away (?rule?) wanna hit it\n\nChorus\n\nVerse 3:\n\nLL: I need that new Benz, you in it, testin my limits\nLaid back, cut, now I twist some lyrics\nLe: Sharin cream like it's love, I'm ready now\nLL: What you say when I put it on, you lovely girl\nLe: Oww! You can never hesitate to do your thang (True!)\nAlthough you come from Queens, I'mma treat you like a king\nLL: Where you from?\nLe: Brooklyn\nLL: Honey-coated, in front of genius\nLe: Gettin ------ in the 'lacs\nLL: Tell me why you never wanna see your ex again?\nLe: Hey Lover, you separate the Boyz from the Men\nLL: That's a fact!\nLe: It's well known why you lick your lips\nLL: Yeah, blowin bubbles in blup-blup-blup\nYou makin me wonder if doin it's everything it seems\nLe: You make me shiver\nLL: Standing up in ya straight and then I lean\nLe: Tell me here, I love it when ya way up in my mix\nLL: Everything is butter in the 9-to-the-6\n\nChorus x 1/2\n\nOutro: LL Cool J\n\nUh ha ha, oh man, y'nuhmean\nBig Rochon, Baby Chris, LeShaun\nRock on, LL Season baby", "image": "https://images.genius.com/891cde7cb0ea96f6c0b7a2cda795de40.1000x1000x1.jpg"}], "artist": "LL Cool J"}