{"songs": [{"title": "The Conscious Rapper", "album": "Spiritual Minded", "year": null, "lyrics": "You think this is easy right? (Yeah!)\nYou think this is easy right? (That's easy!)\nYou think you got what it takes? (Yeah that's easy!)\nHuh, we gon' see.. we gon' see right now (Now what?)\nLook\n\n[KRS-One]\nSo you wanna be a conscious rapper\nCan you handle the press and they negative chatter\nCan you eat cold platters, and still spit data\nWatchin others spit lies and they pockets get fatter\nCan you climb up the ladder, and reach the top?\nBut it still doesn't matter, cause you ain't pop\nCan you rock for the love of the art\nCan you drop hit after hit after hit and still don't chart?\nCan you REALLY stay loyal to God\nWhen your life is full of strife, plus it always seems so hard\nCan you handle the criticism\nPeople holdin you up to higher standards, but they don't live 'em?\nCan you hear these kiddy flows and laugh at it\nBut when you spit they callin you arrogant?\nYou better think about that before you rock to this\nSometimes it's easier to pop your Cris', let's do it!\n\n[Hook: *sung*]\nThink you can do what I do\nThink you can step in my shoes\nYou have no clue what I go through\nYou never felt my pain\nWhen they attack my name\nAll because I have spoken the truth\n\n[KRS-One]\nTo be a conscious rapper ain't a mystery\nYou gotta laugh when they call you contradictory\nThe whole industry, you gotta push and pull it\nTo really get with me, you gotta dodge they bullets\nBlaow, blaow, blaow, every day and every way\nYou critics got somethin to say\nAt the same time, you gotta uphold Christ\nUphold life, while others flash cars and ice\nIt could break you down, take you down, make you frown\nIt could actually shake your ground\nBut if you love who you are, and believe in that\nBest believe you will BE where the teacher's at\nAnd where's that? In fact, in cold or heat\nYes, I declare victory over the streets\nOverstand, over these beats, over the so-called elite\nOver the strong, over the weak\nI know how to speak, and most of all I know how to eat\nI know I want humble and meek\nSo you better think about that before you rock to this\nSometimes it's easier to pop your Cris', uhh\n\n[Hook]\n\n[KRS-One]\nLook!\nSo you thinkin about bein a concious MC\nWell you gotta love God and you got to live free\nYou got to see the life that others can't see\nYou got to be the person that others can't be\nYou can't be a S-L-A, V-E\nIf you sayin to yourself, \"This may be me\"\nThen you know goin in that you work against sin\nYour very skills will kill the demons within\nSo don't expect respect from slaves and hoes\nNor the slavemaster's video shows\nNor the rap mags, you know how it go\nNor the slavemaster's video shows\nNor the rap mags, you know how it go\nEspecially black mags, you know they don't know\nJust go to the crowd that you know will need you\nCause NOTHING compares to the respect of the people\nThat's what you look for, that's what you work with\nCause anything else, is truly worthless\nYou better think about that before you rock to this\nSometimes it's easier to just pop your Cris'\nYou better think about that, 'fore you rock to this\nSometimes it's easier to just pop your Cris', uhh\n\n[Hook] - repeat 2X", "image": "https://images.genius.com/d84f73e1b21b8b4dbd679efa191364e4.1000x1000x1.jpg"}], "artist": "KRS-One"}