{"songs": [{"title": "Catastrophe", "album": "Catastrophic", "year": "2012-12-21", "lyrics": "[Intro]\nAt the end of our time\nWe've chosen to believe in each other\nToday we face the monsters that are at our door!\nToday we are cancelling the apocalypse!\n\n[DJ Khaled]\nCatastrophic!\n\n[Reek da Villian]\nYeah, do you know who I am?\nYou know who I am, nigga?\nMotherf*cker named Reek the Villain, nigga\nWhere the f*ck you been, under a rock, nigga?\nThe Conglomerate lead off nigga\nThey send these shits to me, nigga\nI lead this shit, Buss finish it, but I lead this shit, man\nF*ckin' cockroaches - f*ckin' cockroaches\n\n[DJ Khaled]\nCatastrophic!\n\n[Reek da Villian]\nListen...\nI said I'm dippin' in my low-low\nRidin' with that four-four\nPretty bitch beside me, all your bitches they be so-so\nAnd I'm slingin' cocoa, got it for the low-low\nDudes I get my coke from be screamin' 'bout them locos\nKnow we keep it Trillville, all my niggas real trill\nShout out to my homies in the feds, my nigga Real Nil\nRoosevelt we G'd up, wildin' like we eat up\nI'm the nicest nigga, Buss can go and kick his feet up\nAnd let me take this over, let me get that dough up\nI don't even drive no more, the boy be gettin' chauffeured\nAnd this bitch she wear my chain, I'm feelin' like I'm Hova\nAnd you used to be the man, now your shit is over, it's over\n\n[DJ Khaled]\nCatastrophe!\nIf you listening to this song right now, blessings\nThat means the world didn't end\nBut this shit is catastrophic\nYou test Conglomerate\nThe world gon' end\nYou test Busta Rhymes, Reek the Villain, J-Doe\nIt's YMCMB\n\n[Busta Rhymes]\nIf you ain't know we hear to win, lethal like I'm heroin\nEvery time we come again, niggas know we murderin'\nEverything about y'all, bitch you know I don't care\nMake my niggas throw chairs, we ain't goin' nowhere\nBitch they love Busta, know they lovin' Busta\nYour swag lackluster - matter of fact, f*ck ya\nBitch I got a chauffeur, and a f*ckin' butler\nPics of bitches givin' me head on Instagram and Tumblr\nI don't need your number, throw 'em in the dumpster\nWhen you get new money, bitch, you get a new type of hunger\nSmokin' like a muffler, gettin' money like a hustler\nI don't mean to be mean but I'll poke your spleen 'til the shit get ruptured\nDali!\n\n[DJ Khaled]\nDon't play yourself\nYou know when you hear the icon, legend Busta Rhymes\nYou know what he does\nYou know how he does it, too\nHe shits on every verse\nShits on you\nAnd finished you\nThis shit is catastrophic\nConglomerate\n\n[J-Doe]\nHow do I start this? Wanna say some hard shit\nTo show you I'm a artist, but this song is retarded\nI can't think of nothin', but I gotta say somethin'\nAnd since this track is bumpin', these ratchet hoes gon' love it\nI be goin' crazy on these records every day\nI'm getting' to the money every ma'f*ckin' way\nI let all these hoes come over but not one of them can stay\nAnd this shit gon' never change 'til I'm old and I'm gray\nSit your ass down... and don't say nothin'\nBetter get excited when you see the don bumpin'\nAnd to me it's like Christmas for these bitches they be blushin'\nIt's disgustin' how they love it but I ain't givin' 'em nothin'\nYeah...\n\n[DJ Khaled]\nMore money, more problems\nSame shit, just a different day\nIt's the end of the world every day\nIt's called survival\nThis shit is catastrophic\nCatastrophe\nNo room for the weak\nThe weak can suck a dick, and bow down\nConglomerate\nWe the best\nYMCMB\nShaheem Reid", "image": "https://images.genius.com/b64a509fcfb92ec8935231089436682e.500x500x1.jpg"}], "artist": "Busta Rhymes"}