{"songs": [{"title": "Reason", "album": "Street’s Disciple", "year": "2004-11-30", "lyrics": "[Chorus: Emily]\nI see people hating other people\nTell me what's the reason\nThat your kid is hungry, you ain't got no money\nWhat's the reason?\n\n[Verse 1: Nas]\nBy the time of age nine I'm already decidin'\nIf I can protect mommy from the hood by fightin'\nOr usin' a knife or a gun when I'm twenty-one\nBy by then them hoods woulda pushed their way in our apartment\nAnd we die then, so I been a young nervous wreck in the projects\nWatchin' them older niggas pass pot and they high man\nI'm just a young boy, snot nose, hair nappy\nCops ride by squeezin' their trigger fingers at me\nSo I would go to school and try to get good grades\nTeacher wrote mommy and kicked me outta school for havin' braids\nSo she cussed them, said \"My son ain't no motherfuckin' hoodlum\"\nThey judged us, thinking that we dumb cause where we come from\nGot a little older and now I see\nYoung niggas wanted by the powers that be (powers that be)\n\n[Hook: Emily]\nI see people hating other people\nTell me what's the reason\nThat your kid is hungry, you ain't got no money\nWhat's the reason?\nFor these wars we're fighting with each other\nSeason after season\nWhen you're workin' hard, but there ain't nothing comin'\nWhat's the reason?\n\n[Verse 2: Nas]\nUh, picture a Black nanny and a baby in a basket pushin' down 5th Ave\nShe never had it, it's not hers to begin with\nShe gives it breakfast, baths and dinners\nTreats it so tender while her own kids live alone at home with no phone on\nAin't had a good meal in so long, but so long as mommy's a maid\nCookin' and cleanin', she wanna feed her kids and her kids are dreamin'\nWhere's my daddy, who's my daddy, have you seen him?\nI could imagine them askin', what type of human be-ing\nCould leave his family, go back to the Carribean?\nWas he locked up, shot up, does he have freedom?\nMom said wipe your tears, keep readin'\nBut daddy's somewhere, spirit broken, feelin' defeated\nA man feels he has to conquer all\nThe world is his oyster, his pearl so y'all know\n\n[Hook: Emily]\nI can't find no reason why we can't all live in peace\nCause this world keeps spinning, yet still I wonder what's the reason\n\nI see people hating other people\nTell me what's the reason\nWhen you're workin' hard but there ain't nothin' comin'\nWhat's the reason?\nOooh-whoa-ooh-whoa\n\n[Verse 3: Nas]\nI know a girl, her boyfriend was a fugitive\nShe's intuitive, be on some stupid shit\nShe called the cops cause she hated his mother\nNow he away doin' numbers, now she gay with her lover\nHow many niggas gon' die this summer?\nI pump life in my music, but still life is a wonder\nThere's a officer in a squad car, he's a prostitute serial killer\nIt's odd, huh? Cause he's the same cop in church with his wife\nHe's molestin' his son and she ignores it at night\nLittle bad ass bastard, lights a match and kills Betty Shabazz\nIn her pad while she slept\nThey said Prescott Bush funded Hitler while the world's in a twister\nNigga, what you expect? Imagine what's next\n\n[Hook: Emily]\n\nEmily harmonizes as Nas talks:\n\"Uh, uh, man, man'll search the whole planet, looking for what\nTry to conquer all. So what? To all my niggas with they\nKids that love they kids, man. All the daddies out there\nTo all the niggas that died tryin'a figure out what's what\nTryin'a be the biggest of the big, you know. Yeah, yeah\nLadies forgive us. Gotta forgive us. For we know not what\nWe do. Breakin' hearts, leavin' the crib, buggin' out and\nShit. Just man... man.\"", "image": "https://images.genius.com/65c98702fc773f6dafd41563fe5c5485.500x500x1.jpg"}], "artist": "Nas"}