{"songs": [{"title": "I’m A King (Remix)", "album": null, "year": null, "lyrics": "[Verse One: T. I.]\nNow, e'rybody wanna be the king of the South\nWhen, they ain't runnin a damn thing but they mouth\nNo doubt, it's all good, y'all just statin y'all opinion\nBut in the South and in the hood it's understood without sayin\nIt's a given, and ain't because of what I'm doin for a livin\nIt's, mo' because of what I do and how I'm livin\nNot to mention when I'm rappin I'm just hurtin niggas feelings\n(niggas feelings) And still chillin on somethin that's into healing\nMade provisions for the clique to continue keepin it pimpin\nWhether crack was in the house or record sales was through the ceiling\nSo say what you want, and do what you please\nBut for fun, I shoot 22's from your shoes to your knees\nI run a record label and a crew of G's\nSo, niggas'll come and look for you if ya sneeze\nOr even breathe the wrong way, you better do what the song say\nAnd be easy, or else it'll be a long day\n\n[Chorus: T. I.]\nI'm a king - bank rolls in the pockets of my jeans\nI'm a king - you pussy niggas couldn't see me in your dreams\nI'm a king - top topic of all of your magazines\nI'm a king - head of the body, leader of the team\nI'm a king - remember I can get your block knocked off\nI'm a king - a Bentley coupe with the top chopped off\nI'm a king - I'm connectin nationwide but in the South\nI'm a king - just respect it and keep my name out'cha mouth\n\n[Verse Two: Lil Scrappy]\nI'm the prince shorty don't get it twisted\nBeen callin shots simpin 'fore my flows existed\nAnd still find birds in my momma kitchen\nYou might see me burnin purple in the subdivision\nI got soldiers on deck, babyface pimpin\nWhatchu' know 'bout dat, I get a bad Brenda\nWith that vert' top back, my jeans feelin tight\nCause my pockets stay fat, playa better know that\nMy neck got so much shit, danglin\nBig dick, big chain, we just keep on hangin\nGot a Hollywood ho, and a broad that be sangin\nThey be hatin cause I'm famous [?] what I was thankin\nAnd this for every don nigga thankin he passed me\nY'all just thank that you gone and the shit'll be nasty\nI'ma stay ballin, ballin off my old school classic\nLil Scrap got big bank, now see if you can match it\n\n[Chorus:]\n\n[Verse Three: Big Kuntry King]\nShorty I'm down with the kings, so call me the greatest\nNumber one hustler, I keep the street blazin\nIf the grapes don't sell, I dry 'em up and sell raisins\nWhile y'all cherry pickin hustlers out here slavin\nThat king shit nigga runs deep in my veins\nPump through my heart, live in my bone marrow mayne\nThat's pimpin! My gas is premium like octane\nCain't tell me nuttin 'bout stackin these Benja-maynes\n\n[Verse Four: T.I.]\nI'm the king of the Dirty, see me seated in the throne\nOverruled other dudes like Caesar did in Rome\nWith a prince that's so demandin and an aura so strong\nThe South ain't been represented like this in so long\nI'm an emperor, you best be glad I'm workin on my temper\nOtherwise I'd cock a pistol, send some missiles to your temple\nDisrespect us I'ma blick 'em 'til I get you plain and simple\nBrass knuckles to your dentals blast suckers in they dimples\n\n[Chorus:]\n[T. I.] I'm a king", "image": "https://images.genius.com/68262ccdcbffb87427d31b0d6085c2e3.400x400x1.jpg"}], "artist": "T.I."}