{"songs": [{"title": "Hit ’Em", "album": "The Bar Exam", "year": "2007-04-07", "lyrics": "[Intro: DJ Premier]\nYo Royce, the gloves is on?\nDon't play around with these motherfuckers\nIt's time to\n\n[Refrain: Royce Da 5'9\" & Statik Selektah & DJ Premier]\n(It's the Bar Exam!)\nHit 'em\nHit 'em\nHit 'em\nGo!\n\n[Verse 1: Royce da 5'9\"]\nFive-nine stand back, he 'bout to blow\nSnatch your ho, let her go, she 'bout to blow\nThat four-four that he's holdin' is 'bout to blow\nI thought I told you motherfuckers, it's over, brrrrrp!\nStick up! I got the gats out grindin'\nGive me any kinda Preem track, I rap out rhymin'\nAnd brrrrp! Switch up, turn 'round and rap 'bout diamonds\nTell the underground, I'm shinin', I'll be back, I promise\nWhat you lookin' at, dog? Your boy is fire\nThe more time goes by, his nose gets higher\nPlus, he been pushin' that raw, he knows what he wants\nTo fuck a Pussycat Doll before he retires\nIt's all about black and white, it's like a piano\nThe white and black cards you dealt, life is a gamble\nYou might rap hard today, like you a animal\nThen suddenly, tomorrow, you gay, like The Sopranos\nI done seen it all, lyrical niggas who dumb it...\nDown, for y'all niggas to sing along and still do nothin'\nYou simple like the ABC's, is y'all countin'?\nYou like the caption at the bottom with the ball bouncin'\n\n[Chorus: Royce da 5'9\"]\nFive-nine, stand back, he about to blow\nSnatch your ho, let her go, she about to blow\nThat fo' fo' that he holdin' is about to blow\nPreme, tell 'em who it is just so that they know\n\n[Refrain: Royce Da 5'9\" & DJ Premier]\n(Royce, five-nine) Hit 'em!\n(Just a young nigga caught in the mix) Hit 'em!\n(It's rugged and underground) Hit 'em!\n(You can't run no game) Go!\n\n[Verse 2: Royce da 5'9\"]\nFive-nine, crystal clear, pistol in here\nYou disappear as soon as I shoot it, if you appear\nYou see it clear if I appear to be clutchin' a shottie\nThe butt on the gun is bigger than Buffy the Body's\nI go upside your head with it and fuck up the party\nOooh, I make your ass lose those couple Bacardis\nThe forty-long came along with a couple of bodies\nI know a couple Corleones, a couple of Gottis\nMy story long, nigga, I stay deep in the drama\nI get my Maury on, nigga, and sleep with ya mama\nI done did wifes, did dimes, did niggas in when they tripped\n'Cause they found out the kids mines\nBlew the Tech off, drew the column up on who the best\nPut himself, Nas, Jay on it and moved the rest off\nI'm a gangsta, as well as a star\nPut 'em together and you catch me pickin' up where Guru left off\n\n[Chorus: Royce da 5'9\"]\nFive-nine, stand back, he about to blow\nSnatch your ho, let her go, she about to blow\nThat fo' fo' that he holdin' is about to blow\nPreme, tell 'em who it is just so that they know\n\n[Refrain: Royce Da 5'9\" & DJ Premier]\n(Royce, five-nine) Hit 'em\n(Just a young nigga caught in the mix) Hit 'em\n(It's rugged and underground) Hit 'em\n(You can't run no game) Go!\n\n[Outro: Royce da 5'9\"]\nI know I said\n\"I wanna fuck a Pussycat Doll before I retire\"\nWhat I mean was:\nI wanna fuck one\nBefore the song goes off", "image": "https://images.genius.com/4f966eb73a81b58069fb8aff648de307.700x700x1.jpg"}], "artist": "Royce da 5'9'’"}