{"songs": [{"title": "Huey Knew THEN", "album": "Do What Thou Wilt.", "year": "2016-09-29", "lyrics": "[Intro: Ab-Soul]\nAll that\nMm!\nCheck it out, hey\nThis is a story all about how\nMy life got flipped, turned upside down\nAnd if you roll another blunt and keep your mouth shut\nI'll tell you how I became the wicked nigga they call Young Mind Fuck\nBlack out, black out (Youngin from Del Amo)\nBlack out, black out (Belt by Ferragamo)\nBlack out, black out\nBlack out, yeah, aye, man (black out)\nIchiban\n\n[Verse 1: Ab-Soul]\nThey speak highly of me when I raise my voice\nI gotta shoot a fuckin' free throw to make my point\nMy wittiness leave 'em stuck in the wilderness\nYou need a backwood to roll to this joint\nI'm Robin Hood in Robin jeans, you follow me?\nNevermind, I'm tired of tight analogies\nStill in pursuit of happiness in the midst of the madness\nWith middle fingers to bitches with badges that go oink\n(Yeah! Yeah!)\nI'm on the fence with common sense\nMy logic is sound, Spock of the 90746\nNo shit, Sherlock\nRemind 'em of Han Solo on the battlefront\nEverybody behind Soulo and they backin' up\nI just threw my two-step, let her back it up\nGo on, back it up! Go on, back it up!\nYou dry-snitchin', I'm slidin' in somethin' moist\nYou annoy these women, I anoint these women\nYou stressin' em, I schedule an appointment with 'em\nThey let me cut so much I bring ointment, nigga\nI'm lubricant slick, baby, I'm hornier than\nThe brass section of the band, you understand?\nPick your poison, it's your choice\n\n[Pre-Chorus: Ab-Soul]\nHey, I'm just a youngin from Del Amo\n(Lil' homie from the hood)\nYeah, with a belt by Ferragamo\n(Yeah, bitch, I look good)\nHey, just doing what I wanna\nThis ain't marijuana\nPlease don't tell my mama\n\n[Chorus: Ab-Soul]\nI'ma black out, black out, black out, black out\nYou tellin' white lies while I black out\nBlack out, black out, black out, black out\nPale white horse when I black out\nBlack out, black out, black out, black out\nSpark the white lighter, then I black out\nEven white lives matter when I black out\nBucket of black paint in front the White House, nigga\n\n[Verse 2: Ab-Soul]\n(Yeah! Yeah!) I hope I'm in Obama's iPod\nYeah, 'fore I had a desktop\nWas lookin' for a shortcut to be an icon\nBut this time it's for the money, my nigga\nMe and the Ichiban Don got itchy palms\nAnd I just left Emmet's with a jar and a intercom\nI'ma act an ass and have a donkey to pin it on\nI'm winnin' no matter what the decision's dependin' on\nI'm sinister, picture a tickin' bomb in the Pentagon\nThe typical shit I've been on, remember the pen is gone\nYour pinnacle's penny-pinchin'\nI'm gettin' nickels for my thoughts\n(Black out!) Like Slim Shady in Balmain jeans\nDifficult to say I'm vision impaired, all I seen\nI'm Yamborghini High, A$AP M-O-B\nYour 16 is pint-sized to me\n\n[Pre-Chorus: Ab-Soul]\nHey, I'm just a youngin from Del Amo\n(Lil' homie from the hood)\nYeah, with a belt by Ferragamo\n(Yeah, bitch, I look good)\nHey, just doing what I wanna\nThis ain't marijuana\nPlease don't tell my mama\n\n[Chorus: Ab-Soul]\nI'ma black out, black out, black out, black out\nYou tellin' white lies while I black out\nBlack out, black out, black out, black out\nPale white horse when I black out\nBlack out, black out, black out, black out\nSpark the white lighter, then I black out\nEven white lives matter when I black out\nBucket of black paint in front the White House, nigga\n\n[Verse 3: Da$H]\nYoung no shame Kurt Cobain, bastard son\nWith a gun in palm; money, pussy, crime sittin' on my mind\nNo emotion, orange bottles how I deal with mine\nCrackin' bannies only time a nigga cross the line\nWrong hand signs'll turn a function to Columbine\nYeah, so, B.O.B's top gunner\nFront runner, NEVR DIE clique, the thing you are not, brother\nPolo Ralph Lauren is keepin' the Glock covered\nPour up medication by the brick\nSippin' oil like we're tryna sink a ship\nSo yeah, uppers and the downers in the mix\nNow the film heads talking 'bout a script\nLivin' my days is a gamble\nI guess that's the perks of the set, bet\nAin't nothin' certain but dirt, that bitch wearin' that skirt\nSo I guess that I'm flirtin' with death\nNeed the type of cash cow to get Trump whacked out\nHere's the question you should ask\nWhat's the Soul without the Da$H?\nNever had the option I could back out\nIf it's 'bout the cash, then I act out\n\n[Outro: Da$H & Ab-Soul]\nBlack out, black out\nBlack out, black out\nBlack out, black out\nBlack out, black out\nYeah, so!", "image": "https://images.genius.com/637f5718bda94a6a37a2abb42fe7dfc7.640x640x1.jpg"}], "artist": "Ab-Soul"}