{"songs": [{"title": "It Was An Accident", "album": "K.O.D.", "year": "2009-10-26", "lyrics": "[Verse 1: Tech N9ne]\nI was chillin' with a bitch and I was noticing she was so sadistic\nWanted the N9na to bite on her nipples and twist it\nSucking me off until she lost all of her lipstick\nYou know how it is when you X-in on like 7 of 'em\nWith a stick of Sherm and Adderall nigga had to love 'em\n'Cause they get you lifted and thinkin' you unstoppable\nBut what I'm 'bout to tell you is so fuckin' impossible\nI started givin' the bitch my dick\nShe loving the way my jimmy be jabbin' it\nWanted me to cut her up, I said never\nShe said imagine it with the tip of her butcher knife\nI think I took her life\nThis crazy hooker liked pain then I put her right\nFuckin' high and it's insane how she look at life\nShe wish a nigga had fangs and he took a bite\nI'm beatin' it up but it ain't what the pussy like\nThe pussy like to be banged like it took a fight\nThen she asked me to smack her\nThen she asked me to choke her, so I choked her\nAs a nigga got closer to the nut I choked her\nEven harder when I rose up out of the chocha\nShe wasn't breathing, a horrible evening\nCouldn't get her to breathe I really tried to\nDid all I could but it wasn't all to the good\nSo I had to call the ambulance over to come revive her\n\n[Hook: Tech N9ne]\nIt was an accident\nHa ha ha, oooooooooo\nIt was an accident\nHa ha ha, oooooooooo\nIt was an accident\nHa ha ha, oooooooooo\nIt was an accident\n\n[Bridge: Tech N9ne]\nI don't be findin' trouble, it be findin' me\nI don't be findin' trouble, it be findin' me\nI don't be findin' trouble, it be findin' me\nI don't be findin' trouble, it be findin' me\nEm 'nidnif eb ti elbuort 'nidnif eb t'nod I\nEm 'nidnif eb ti elbuort 'nidnif eb t'nod I\nEm 'nidnif eb ti elbuort 'nidnif eb t'nod I\nEm 'nidnif eb ti elbuort 'nidnif eb t'nod I\n\n[Verse 2: Alan Wayne]\nShit I was only 16, just showing off\nNever would have imagined the gun going off\nI was just trying to show these niggas that I wasn't soft\nI stayed at 52nd street so that's what all these niggas thought\n'Cause they was from Hilltop, where niggas pill pop\nSo I'm pulling up to the chill spot with the steel cocked\nStill not, sure what I was thinking, and back then I wasn't even drinking\nSo I'm leaving Lincoln High School off Woodland\nHeaded to the hood to out wit all the hoodlums\nCouldn't wait to show him what I was packing\nKnock on the door he answered like \"Whuuss Crackin'!?\"\nI said, \"Shit, just chillin', just me and my bitch\"\n\"By my bitch I mean that 450 sittin' on my hip\"\n\"Wanna see\"? He said \"Yeah, let me see\"\nI pulled it out and gave it a good squeeze\nI didn't know it didn't have no safety\nNow this man is hit in his chest and he can't breathe\nDevil on my shoulder whispering \"Leave, nigga leave\"\nBut I swear\n\n[Hook: Tech N9ne]\nIt was an accident\nHa ha ha, oooooooooo\nIt was an accident\nHa ha ha, oooooooooo\nIt was an accident\nHa ha ha, oooooooooo\nIt was an accident\nHa ha ha, oooooooooo\nIt was an accident\n\n[Bridge: Tech N9ne]\nI don't be findin' trouble, it be findin' me\nI don't be findin' trouble, it be findin' me\nI don't be findin' trouble, it be findin' me\nI don't be findin' trouble, it be findin' me\nEm 'nidnif eb ti elbuort 'nidnif eb t'nod I\nEm 'nidnif eb ti elbuort 'nidnif eb t'nod I\nEm 'nidnif eb ti elbuort 'nidnif eb t'nod I\nEm 'nidnif eb ti elbuort 'nidnif eb t'nod I\n\n[Outro: Tech N9ne & Alan Wayne]\n— What you scared of?\n— Shit, nigga I ain't scared of nuttin, what you scared of?\n— Damn, I ain't really scared of nothing for real man, but it's like I'm scared as hell of lightening aahaha\n— Ahh\n— You know I'm saying lightening.. I think lightening gon' strike a nigga down for all the shit I done did\n— Shit!\n— You know what I'm saying? Like when the lightening strike, I duck nigga\n— That's crazy I like it\n— But I'm sayin', this is other things, and I ain't quite scared of 'cause I don't know quite know what it is you know what I'm sayin' it's like  (yeah!) you know you're be driving and shit to home late night and shit and it's like you see something on the side of the road you think it's a person it's look like a shadow and shit, and SWERVE 'cause you think the motherfucka gon'..\n— That was like, it could be dead huh?\n— Yeah, that's what I was thinking\n— That's crazy\n— That's what I be thinking though, you know I'm saying\nLike what if this like beautiful forces come to get you for all the bad shit you did you know what I'm sayin'?\nAll I know I used to get high in the motherfucking days trippin' that shit but, I still see that shit\n— Shit I don't even get high and I'm scared of it\n—Aha shadows on the road man that shit trippin' me as fuck", "image": "https://images.genius.com/de5c12836aa9b9bbb55356aafbf1fa0a.900x900x1.jpg"}], "artist": "Tech N9ne"}