{"songs": [{"title": "The Opening", "album": null, "year": "2009-01-01", "lyrics": "[Intro]\nI mean man are you serious man? You opened up for Pitbull, EPMD, Method Man, Redman, and Ludacris?\nMan get the fuck out of here, man I know you lying\nDog, I'm telling you the truth man, look, I came on stage and he was like \"He goes by the name of Psychological. Alright, lyrics. give it up for Psychological. Jigga what?\nUh, D.C., Maryland, Virginia make some noise!\nNah, nah, nah, y'all sound dead to me. I said make some noise!\"\n\n[Hook]\nMake some noise\nMake some noise\nMake some-\n\n[Verse 1]\nBack stage, palms sweaty but I'm ready\nTo kill my set, you know I gotta get the credy\nMoments before yeah im feelin' unsure but everybody like \"You dope man we've seen you before\"\nGotta stay humble, mind state ready to rumble\nGotta keep my cool in this concrete jungle\nMoments before and I'm still feelin' nervous\nRoots walkin' up like \"Whats good you ever heard us?\" (Man)\nNah homie, you see I'm kinda in the zone\nWe can talk later but for now leave me alone\nThen the M.C. for the whole event\nComes up to me while I'm chillin' in the tent\nSaid \"I know you hungry, today you gonna eat, but first theres a couple guys I want you to meet\" (Whats up?)\nTook me on the tour bus told me \"Have a seat\"\nThen a moment later, I met a few from Wu-Tang\nIt was surreal cause they the reason I'm in the game\n\n[Hook]\nMake some noise\nMake some noise\nMake some-\n\n[Verse 2]\nOff of the bus, gunnin' ready to bust\nRhyme is a must, finna kill it you better trust\nMy heart's poundin', but calm and collected is how I'm soundin'\nDressed fresh to death go all the honeys drownin'\nGrip the mic while the announce my name\nSmall talk backstage with big names in the game\nSee I, know the line, between Logic and Bobby\nSee Bobby, he listen to rap for a hobby\nBut Logic, sit back relax he ain't got shit\nSo while the other acts, askin' for autographs\nI'm as professional as it gets ain't no need to ask\nWhy you goin' up to them, talkin' bout you rap\nHow you this how you that, then like \"hey, can you sign that?\"(Please)\nI'm on the stage and they like \"I wanna sign that\"\n\n[Hook]\nMake some noise\nMake some noise\nMake some-\n\n[Verse 3]\nOff of the stage, the whole crowd feelin' me\nCopies of the mixtape what they wanna be\nSee I ain't never ever seen a concert\nBut the first one that I went to is the first one that I merked\nWhen I first came on, they wasn't showin' love\nWhen I last stepped off every girl wanted a hug (Haha)\n\n[Outro]\nI mean yeah man\nIt was a real cool experience, you know?\nIts the first time I ever really did something that big, you know?\nWith a few thousand people there and everything\nAnd, I mean it was just tight, you know what I mean?\nSo, its pretty, its pretty much what I got out of it\nYeah", "image": "https://images.genius.com/75b9fd3705271c3c10d64dfb3139caf7.900x900x1.jpg"}], "artist": "Logic"}