{"songs": [{"title": "Righteous Way", "album": "Digital Bullet", "year": "2001-08-28", "lyrics": "[Junior Reid]\nBlessed love my lark, blessed love empress\nAll teaching of ways, all prince and all princess\nGods and goddess, kings of de earths, kings of de earths\nHeeeya-hahahahaha!\nJah!\nRastafari\n\n[RZA]\nR-rza-rec-rec-Bobby\nYo\n\n[Junior Reid]\nJah live the +Righteous Way+\nTeaching the youths of today\nBobby Digital do and then them say\nLove with me today\nLove with me today\nBaby this is what they say\nI'm gonna lead the youths in my stray\nNo foul play, no foul play\nWant them of love all the way, and no foul play\nWant them of love and not the negative way\nRZA want no drive-by car, then we will see about how we are\nAm I going the digital way, send all the youth to the digital way\n\nJah live the +Righteous Way+\nLeading the youth of today\nTell them to watch and pray\nA child shall lead the way, the way\n\nJah live the +Righteous Way+\nTeaching the youths of today\nBobby Digital do agree to tell them say\nLove shall lead - love is the only way\nLove we want in America, in Jamaica, and in Africa\nLove all over the world, for all women boys and girls\nMen women boys and girls\n\n[RZA]\nLet it be known\nLet it be-let it be known\nLet it be known\nSome said Bobby oughta burn in hell because these fancy bitches\nGot a closet full of kung-fu flicks and nasty pictures\nA library to decipher anything religious\nHe beg for mercy, we pray for Allah forgiveness\nRough nights, tough nights police cuff tight\nLocked the fuck up, someone's mad enough to snuff Mike\nCouldn't fuck right or puff right\nThis 15-year-old bastard got drunk and stuck like\nThe kid in the GangStarr vid, Just to Get a Rep\nPop was a klep, moms out on the steps\nSee sometimes he feel like a motherless, starve for another kiss\nAt night search the skies and searchin for the mothership\nOnly to find it's all inside yourself\nAre you ready for the things of mental health?\nThis old man had a lack of mental health\nBecause his grandfather clock got to old for his shelf\nSo he had to die with a cold on his chest\nThe Old Earth said that the soul went to rest\nSomething that we never could understand\nIs what he told me, sayin;\n\"Yo, how could the ghost be holy?\"\nThat's what he told me, when I watch TV all I see\nIs unfriendly ghosts is bustin through like Scream Part 3\n\n[Junior Reid]\nThem say Digital way\nAll the youths, them ah say\nThey wants them to live in the Rastaman way\nNow follow Babylon way, long time nah Babylon ah lead them astray\nThey want Bobby Digital way, say the pussy and the +Righteous Way+\nWant the Rastaman way, Rastaman never lead you astray\nRighteous way\nRighteous way\nNow lead the youths, them astray\nTell them to watch and pray\nJust, watch and pray\nJah will lead the way\nA brighter day\nYouths are the future, oh yeah", "image": "https://images.genius.com/52be3befc1392598c2d27e30b8059858.500x500x1.jpg"}], "artist": "RZA"}