{"songs": [{"title": "Digi-Electronics", "album": "The Sting: Bobby Digital Bonus Disc", "year": null, "lyrics": "[Intro: RZA]\nCome on, come on\nYo, ye-yeah, ye-yeah\nWhere Ya At? Where Ya At?\nTakin' it back to 1982\nRunnin' Brownsville as we bring you (Where Ya At?\nWhere Ya At?)\nThat phat old school shit\nThe best of the troup could find\nBOODOODOODOODOO!\nYo yo\n\n[Chorus: Force MD's]\nMy crew is super duper fly and we came to get pai-aid\nWe pack those Glocks and razor blades, duckin' spa-a-a-ades\nRollin' that sticky chocolate thai, we 'bout to get bla-a-azed\nY'all cats can't play with us, it's not a ga-a-a-a-ame\n\n[Chorus - last two lines]\n\n[RZA]\nRoll up the Winchester, call up my wife, Celestea Poindexter\nTell her bring back the black iron Mac strapped with two extra\nClips whizzin' at you, worms in the Big Apple\nPotholes in the street crack the Benz axle\nDon't let me come and descend my mens at you\nYou candid cats is fish Jack mackerel\nB-O-B boy, fast like Bruce Leroy\nCaramel sundae honey set the decoy\nFor you soldiers seekin' to de-stroy\nMe, what the fuck you think we got the heat for?\nYou dunce, we knock out your gold fronts\nShorty got bigger and strong once she start smokin' blunts\nWith beef they get found in Hunt's\nThere's no chance to score, your best bet's to punt\n\n[Chorus]\n\n[Doc Doom]\nI know R&B niggas that's harder than you\nYoung T.G.'s with more street smarts than you\nHit a liq', shit you ain't got the heart to do\nAnd I bet the click you run with they bustas too\nFuck a pass, we come strapped when we passin' through\nAll types of straps, you get clapped just for actin' new\nCollectin' more guns ever since my cash done grew\nBad ass with no dad so I'm a bastard too\nAsk your crew, nigga, I gay-bash 'em too\nGrab his strap then ski-mask and bash 'em too\n\n[Madam Scheez]\nWest Cost rider, credit card slider\nRoll up the windows and pass the lighter\nI done turned into a lover, used to be a fighter\nNow I pull out my guns and take 'em out one by one\nYou're refutable bitch, sittin' on pins and needles\nI done seen bitches emotions breakin' up like The Beatles\nWho's the real bitch now? Seen the fear in yo' tears\nNext time grown folks is talkin', shut the fuck up here\nA product of my environment until my retirement\nHave a habit of the automatic breakin' up the static\nAnd if y'all niggas wanna trip y'all can suck my dick\nI got eight or nine of 'em, different colors and shit\n\n[Chorus]\n\n[Timbo King]\nSmell like the rain forest, got diamonds in the hood - flawless\nSable Taurus, spit a verse, no chorus\nYou're on the wrong turf, one of my songs worth\nTwo mil', eh-yo, red pill, blue pill\nStill stay focused, off-white lotus, brokers\nI'ma dead y'all slot time, no spins on the hot nine\nEh-yo, my hot nine got my whole block sign\nI rhyme gangsta, pops was an O.G\nI'm a junior, my son'll be the third\nLet 'em learn degrees, the bees and the birds (uh-huh)\nLet 'em learn degrees, the bees and the birds\n\n[Shyheim]\nWhy you actin' cuckoo like you just flew over nest?\nLike I give a fuck how much weight you bench\nShyheim, my government and my attributes\nBIG left me the Tec and the nine at my crib, so Gimme the Loot\nOr L.B.C. ya like Snoop, I'm out to get coof, again coof\nTurn up the thermostat, peep the murder rap\n'Bout to bring it back, in the name of crack\nIn the name of dope\nRidin' through the hood in the Diamondback with spokes\nIn the name of thai, cliches and skunk\nI came to get high, came to get drunk\nI came with the Tec, Bobby came with the pump\nWe left with the shines, left with two dimes\nSittin' on dubs, royal flush, five of a kind\nCountin' the spare for the deuce-ooh-ooh-one\nNigga, our year, niggas, our year\n\n[Freemurder]\nYeah, yeah, yeah\nYo, talkin' all drunk, makin' a rap right here\nFool remainders, like he can't get clapped right here\nFuck the walkin', Freemurder pack right here\nOn some napalm and bamboo track right there\nFuck twenty-five, shit, I'm strapped to the chair\nCuffie Crime Fam', my fifth black in the air\nY'all don't want none, lead ya back down the stairs\nOnce the Mac appear\nFour heat, I ain't hit 'im, shoot back fire wit 'im\nWhole empire wit 'im, never plea guilty, I ain't hit 'im\nGuess who lyin' wit 'im\nLeft po', ya dead broke like Holy's ear when Tyson bit 'im\nStill on point like lime segment\nPull out joints, the nine wet men\nDouble action, don't want no trouble, askin'\n\"Who I be?\", Murder like Tai Chi\nGet ya brain tilt\nNew Yorker, Brooklyn is where he come from", "image": "https://images.genius.com/298d5b6c65bf8acac98842b49097e653.300x300x1.jpg"}], "artist": "RZA"}