{"songs": [{"title": "BMF (Building Minds Faster)", "album": null, "year": "2010-07-25", "lyrics": "[Lupe: Talking]\nUh huh, friend of the People\nYeah, I mean c'mon\nWhat the fuck do I gotta do\nThis one for the fans here Jack\n\n[Refrain]\nI think I'm Malcom X, Martin Luther\nAdd a King, add a Junior\nSome Bible verses, couple Sunnahs\nAn AK-47 that's a revolution, nigga\nThink I'm 2Pac, Bob Marley\nFela Kuti, Marcus Garvey\nThem the real ones, light a lighter for 'em\nLetcha know, that I'm ridin' for 'em\n\n[Verse 1]\nGon' gimme some, a lil' more beat\nCall your friends around, then call the police\nI'm ridin' with my flow, it take up four seats\nSo I'm gon' ghost ride but with no sheets\nOne man by myself, even then I'm four-deep\nLike hotel swimming pools, that's four feet\nThese niggas like the rooms, so suite\nPriceline, so cheap\nI'm the cell phone, they the room keys\nI'm some shell toes, they some shoe strings\nI turn 'em off, I take 'em out\nI'm Reverend Run, with the laces out\nAdidas, so adios\nAll day I dream, like I'm comatose\nThat's your ship sinking, and I'm so afloat\nI'm T-Pain, I'm on a boat\nNot the slave one, DiCaprio's either\nHear the waves come, they started in the bleachers\nSo I'm swag surfin', the pool's getting deeper\nYou still sweet though, here come them room keepers\nOk I'll be the strings, you be the shoes\nBut guess what, now they Jimmy Choo's\nI wear the pants, you Winnie Poohs\nYo shit meows, my shit awoo\nI got a fifth flow, call me Brother Man\nAfrica the set, yea that's the motherland\nFor that BP, I shed fifty tears\nIn Nigeria that oil been spillin' for like fifty years\nFifty years? Hell naww\nHell yeah, I'm tryna tell ya'll\nAt this rate, niggas gon' lose\nCan't search for water, or grow your own food\nTell me what's gon' happen, when them stores close\nAnd ain't gon open up, no more\nYeah that's the realest shit\nYou gon' feel that, hunger's your enemy\nBut you can't kill that\nNigga wake up, don't join the army\nKill your own peoples, but fear\nIlluminatis and they ain't even real, or are they\nBut you ain't even know, because you par-tay\nToo fuckin' much, if you start to doubt\nThey already in yo mind, and comin' out yo mouth\nIts not a trick, nigga, it's a trap\nSurvival of the fit, is what they aiming at\nAnd niggas ain't fit, fat as hell\nFat in mind, body fat, as well\nWho use most the drugs? Americans\nWhat's in Afghanistan? Heroin\nYou think that's by mistake? They can't stop that\nDon't think you safe though, because you not black\nGreed is colorblind, so I'm colorblind\nThey gon' fuck with yours soon as they done with mine\nThey say I try to hard, verses overwhelm\nI learned most of this, from niggas sittin' in jail\nWhere you think I'm from? I'm from the streets nigga\nTriple OG's told me to teach nigga\nAnd that ain't made up, nope, that's a fact\nThey say that gangsta shit is the shit I rap\nLook who I attract, look at my inner circle\nBunch of street niggas, and a couple Urkels\nLook at my fanbase, oh yes\nFuck what Pro say, look at this protest\nWhere they do that at? Who they do that for?\nMust mean I'm doin' bad, and things is movin' slow\nWe talkin' revolution on public radio\nThen catch me down in Houston, sittin on them 84s\nTrae, wassup? ABN\nGotcha back nigga, sink or swim\nFree Chilly Chill, shake off your masters\nPray to God, build your mind faster\n\n[Hook]\nI think I'm Malcolm X, Martin Luther\nAdd a King, add a Junior\nCouple Bible verses, and some Sunnahs\nAn AK-47, that's a revolution (nigga)\nThink I'm 2Pac, Bob Marley\nFela Kuti, Marcus Garvey\nThem the real ones, light a lighter for 'em\nIf you ain't know, I'm ridin' for 'em", "image": "https://images.genius.com/b67b7f5bfbd7eb8c5c334fa8b05a2432.400x400x1.jpg"}], "artist": "Lupe Fiasco"}