{"songs": [{"title": "Encore / Curtains Down", "album": "Encore", "year": "2004-11-12", "lyrics": "[Intro: 50 Cent & Eminem]\nSh-sh-sh, Shady! Aftermath! Haha!\nG-G-G-G, G-Unit! Haha!\n\n[Chorus: Eminem & 50 Cent]\n’Cause we came here to set this party off right\nLet’s bounce tonight\nAnd if they don’t let us in through the front\nWe’ll come through the side\n’Cause I don’t ever wanna leave the game\nWithout at least saying goodbye\nSo all my people on the left, all my people on the right\nSwing one last time\n\n[Introduction: Eminem]\nGet your ass up for the doctor, one more time\nGet your ass up for the doctor, come on now\nHere we go, cliff hanger, it’s another club banger\nGot ya hangin’ on the edge of your seat, get on down\n\n[Verse 1: Dr. Dre & Eminem]\nTime’s up, game’s over, you lose, I win\n’Bout to show these knuckleheads how to do this here\nOh yeah, new year, next phase, begin\nLook who’s got you goin’ crazy again\nI’m a trend, I set one every time I’m in\nI go out and just come back full circle again\nYou a fad, that means you something that we already had\nBut once you’re gone, you don’t come back\nToo bad, you’re off the map now, radar can’t even find you\nWe stay on the grind, you slip, we out-grind you\nYou walk around mad, you let your anger blind you\nWe walk around just playin’ the violin behind you\nEnough with all the pissin’ and moanin’, wining and bitchin’\nSit and observe, listen, you’ll learn if you pay attention\nWhy ten multi-platinum albums later, three diamond\nWorldwide, we’re on the charts with a bullet and still climbin’\n\n[Chorus: Eminem & 50 Cent]\n’Cause we came here to set this party off right\nLet’s bounce tonight\nAnd if they don’t let us in through the front\nWe’ll come through the side\n’Cause I don’t ever wanna leave the game\nWithout at least saying goodbye\nSo all my people on the left, all my people on the right\nSwing one last time\n\n[Introduction: Eminem, Dr. Dre & 50 Cent]\nWhen Dr. Dre says crunk, you will get it crunk\nGet it crunk! Crunk! Crunk! Crunk!\nAnd when 50 Cent says jump, you get on one foot and jump\nJump! Jump! Jump! Jump!\n\n[Verse 2: Dr. Dre & Eminem]\nThe buzz is tremendous, we drop you all to sense it\nI don’t gotta promote it, for you to know that Doc is off the benches\nWe keep the party rockin’ off the hinges\nWe ain’t showin’ off, we just going off popular consensus\nBut critics say that Doc is soft, Doc is talk\nDoc is all washed up, knock it off, who the fuck is Doc impressin’?\nDoc is this, Doc is that, you got the wrong impression\nYou must be on the cock of Doc, ’cause Doc left you all guessin’\nSo DJ take the needle and just drop it on the record (What?!)\nWe gon’ have this motherfucker hoppin’ in a second (Bump, bump!)\nThat’s why we always save the best cut last\nTo make you scratch and itch for it like fresh cut grass\n’Cause we done swam with the sharks, wrestled with alligators\nSpoke to a generation of angry teenagers\nWhom if it wasn’t for rap to bridge the gap may be raised to be racist\nWho may have never got to see our faces\nGraced the cover of Rolling Stone pages\nBroke down barriers of language and races\nJust call on the caped crusaders and leave it to me and Dre\nTo pass the mic and we can play the\nBack and forth all day like the hot potato game\nThat’s why we came to…\n\n[Chorus: Eminem & 50 Cent]\n’Cause we came here to set this party off right\nLet’s bounce tonight\nAnd if they don’t let us in through the front\nWe’ll come through the side\n’Cause I don’t ever wanna leave the game\nWithout at least saying goodbye\nSo all my people on the left, all my people on the right\nSwing one last time\n\n[Introduction: Eminem]\n50 Cent, come on!\n\n[Verse 3: 50 Cent, Dr. Dre & Eminem]\nBounce now, hands up, you know how we do\nWe make the club jump everywhere we go\nIt’s no secret, everybody know\nWhen Dre’s involved, there’s plenty of money involved\nAnd plenty honey’s involved and sunny Sundays and palm trees\nCali, everyday is just another party\nFrom the valleys all the way to them 8 Mile alleys\nLet’s rally, hands up for the grand finale\nNow raise up out your seat, Dre’s about to speak\nBlaze a pound of weed six days up out the week\nYou can catch me in the studio, bangin’ out the beats to\nProvide you with the heat that keep blazing out your speakers\nSo never say never ’cause Shady, Aftermath together\nAlong with G-Unit Records presents the return of the\nThe Doc and Shady, no one can do it better\nWe tear the club up and leave without a shred of evidence that a…\n\n[Chorus: Eminem & 50 Cent]\nWe came here to set this party off right\nLet’s bounce tonight\nAnd if they don’t let us in through the front\nWe’ll come through the side\n’Cause I don’t ever wanna leave the game\nWithout at least saying goodbye\nSo all my people on the left, all my people on the right\nSwing one last time\n\n[Outro: Eminem & 50 Cent]\nYeah, haha! Still Aftermath, 2006! And don’t worry about that Detox album, it’s comin’… We gon’ make Dre do it! Haha! 50 Cent, G-Unit, Obie Trice, D-Twizzy, Stat Quo, Dr. Dre! We ain’t leaving, let’s go, haha! Ladies and gentlemen, thank you all for coming out! Peace!\n*People chanting Eminem’s name*\n*Footsteps*\nOh shit! I almost forgot…\n*Girl screams as Eminem pulls out a gun*\nYou’re coming with me!\n*Eminem cocks the gun and starts shooting at the audience*\n*People start to scream terrified and run*\n*Gunshots and shouting*\nHa ha ha. Bye, bye!\n*Eminem shoots himself*\nSee you in hell, fuckers", "image": "https://images.genius.com/51f884720f927560dc38aa3288232b7c.1000x1000x1.png"}], "artist": "Eminem"}