{"songs": [{"title": "Untitled Nipsey Snippet*", "album": "Born 2 Rap", "year": "2019-01-01", "lyrics": "[Snippet from Listening Party June 21st, 2019 in Hollywood]\n\n[Verse: The Game]\nLamborghini outside but, nigga, that was Jay's shit\nSame nigga that gave you classic after classic\nAnd still chop rock and zippin' plastic after plastic\nWhy you think Dr. Dre won't take me on them yachts with 'em?\nWhisperin' to Snoop, \"He probably got a Glock with 'em,\" facts\nSmoke comin' out the ‘Rari hood\nNigga, I could fuck Nicki if Safaree could\nWhy the fuck you talk to my niggas that's watchin'?\nAll my niggas from Watts to South Central to Compton\nI wish you could of been a fly on the wall in my dope spot\nBeat it when I tuck in my drawers and I hope not\n'Cause doin' 25 to life is a roadblock\nWelcome to my last album, Nip, turn the cold shot\n\n[Chorus: Nipsey Hussle]\nTwenty million dollars actin' bold, nigga\nAll you niggas sleep, stay woke, nigga\nAll my niggas came and sold dope, nigga\nWhy the fuck you think they call us dope niggas?\nBroken home, broken dreams, no hope, nigga\nWhy the fuck you think we sellin' dope, niggas?\nThis for my dawgs and my locs, nigga\nGotta get our neck up out these ropes, nigga\n\n[Verse: The Game]\nFire to the spoon put you on the moon\nMake America great again, you a fuckin' coon\nAnd you niggas wonder why I'm unenthused\n'Cause hard bottoms trump runnin' shoes\nAnd the less you know, the longer you live\nAnd the more you know, they tappin' your crib\nMy niggas say they got shot and actually did\nWho never thought what happened to Pac would happen to B.I.G\nWhat happened to L, what happened to Proof and Jam Jay though\nHip-hop'll lean on you, R-I-P to Fredo\nYoung niggas stay woke, old niggas stay woke\nIt's rainin' hollow tips, it's rainin' in this Gucci raincoat\nSecurity won't pat me, niggas won't @ me\nSame nigga that saved the West with a bald head and some khakis\nWatchin' Kendrick show while Top Dawg dap me\nThis my last album, motherfucker, I hope you happy\n\n[Chorus: Nipsey Hussle]\nTwenty million dollars actin' bold, nigga\nAll you niggas sleep, stay woke, nigga\nAll my niggas came and sold dope, nigga\nWhy the fuck you think they call us dope niggas?\nBroken home, broken dreams, no hope, nigga\nWhy the fuck you think we sellin' dope, niggas?\nThis for my dawgs and my locs, nigga\nGotta get our neck up out these ropes, nigga", "image": "https://images.genius.com/ad6f06c94460fb7303cc0cd341240eae.1000x1000x1.jpg"}], "artist": "The Game"}