{"songs": [{"title": "Oh Let’s Do It", "album": "No Ceilings", "year": "2009-10-31", "lyrics": "[Intro: Lil Wayne]\nI got Young Money up, and now I got my feet up\nTune in this bitch, tell my niggas throw them B's up\nDoing what the fuck I want, hate me all the fuck you want\nReal niggas fuck with me and I don't give a fuck who don't\n\n[Verse: Lil Wayne]\nLock the CEO up, and I'm the CEO, fuck\nPrison in February, and I ain't in no rush\nDrink 'til I throw up, nigga, roll more blunts\nBall so hard, man, I gotta go pro once\nHit 'em with the shotgun, call that shit the stop button\nCall me Doctor Carter, AKA \"Young Wild Nigga\"\nAKA \"No Trial Nigga\", AK click-clack, pow nigga\nFucking with the kid and you'll be missing like Bilal, nigga\nYeah! Swagger stupid, pack a Uzi\nHundred clips, nigga? That's a movie, aim at your toupee\nYou sweet as Kool-Aid, creme brulee\nI'm sharp as Blu-ray, I fuck her today\nThen she gotta skate — Young Lupe\nI hit the beat hard — Bobby Boucher\nI keep them tools on me, get the screwface\nFlowers for the dead, here's a bouquet\nL.V.'s, nigga, on every suitcase\nY.M., nigga, it's a new day\nWe the champions, nigga, hoo-ray\nYeah, hammer in the Louis duff\nTake a nigga bitch, she gave me brains until I knew enough\nBullet come too fast to adjust\nI don't give a fuck about my roof that much\nSo I put it in the trunk and then the coupe sped up\nTake the chopper out the trunk and just shoot that up\nI'm Weezy F and the 'F' is for Flame\nEat these rappers, chef of the game\nShit on the track, shit on the train\nMurder the beat, the beat was slain\nRest in peace, that's a shame, he kill anybody's song\nVersatile as fuck, I switch it up like Dennis Rodman's dome\nNo homo, you rockin' wrong, rest in peace my styrofoam\nNow they wanna know what I be on\nGet the fuck off my dick, my cock, my bone\nBig money, my pockets long\nNew Orleans, I got my home\nAnd they got my back, pause; no homo, no maricón\nSmoking on that private grown, it put me where I belong\nAll about my cheese; cheddar, mozzarella, provolone\nFuck her for an hour long, let her take a shower, gone\nSorry baby, but I'm in my I-don't-wanna-be-bothered zone\nYeah, you're a groupie, get on your duty\nTwo women give me head, call that \"Two-face\"\nBitch I'm too great, take your food tray, I was born on doomsday\nAin't no nigga like me\n\"What's up\" to my gang, big B's like a Breitling\nTake a nigga bitch, she ride my dick like she cycling\nThen she can't walk, run, or jump, like white men\nFuck you niggas wanna do?\nNo Ceilings, let the bullets rain on you\nWeezy F, the 'F' is for \"Fuck what you’re goin' through\"\nMake your people mourn you\nHaha! OK let's do it", "image": "https://images.genius.com/4a183c010cf184b2a9fecdfcb8e16142.320x320x1.jpg"}], "artist": "Lil Wayne"}