{"songs": [{"title": "In my mind", "album": null, "year": null, "lyrics": "(Hook x2)\nMoney on my mind, on my waist be that strap\nHere to **** my grind, ****a, you dyin' in that stat\nNo joke ****as, I'm self made, I'm a dope dealer\nIn the drug game the doppest ****a\nWe play for keefs, we lay in sheets\nThese bitches don't want no broke ****a\n\n(Verse)\nAntecinin' it be endecin' it every time\nThat's why I got hard on every rhyme\nHard, ****a, that's why I thank God for every line\nNo more invest, you demolish things while I'm barely tryin' (?)\nHard ****, bitches all on my dick, they hangin' on my Calvin Klein\nI'm an outkast and I got 3000 big boys with me, ****a\nSit down and get war with me, I'm droppin' bombs out local Baghdad\nAnd a bitch bound to get more from me\nShe Bread Murphy gettin' horse from me(?)\nBitches smoked weed with a gat man but neva got high\nTook 10/000 feet in the sky, in an aircraft\nTrappin' money, they come outta trap bad\nI'm a dope boy, I sell cocaine you neva had dealt\nI'm a whole brick and you a drop band\nI'm a scientist and you a lab rat\nNow show me where the craft at (money, ****a)\nI need real cheese, I'm a fresh prince, you gotta feel me\nI keep a Smith & Wesson I will squeeze\nBut I got Reggie Miller shooters I ain't gotta take the shot\nShamal Kensley, I'm sharp percentage when I move the white\nEven said to Reggie to make mills week, ****a\n\n(Hook x2)\nMoney on my mind, on my waist be that strap\nHere to **** my grind, ****a, you dyin' in that stat\nNo joke ****as, I'm self made, I'm a dope dealer\nIn the drug game the doppest ****a\nWe play for keefs, we lay in sheets\nThese bitches don't want no broke ****a\n\n(Verse 2: Troy Ave)\nTroy Ave ****a, in my blue bag, ****a\n35 for the kilos, get mine at the? ****a\nPump my chips every flipper, fish scale, Mr. Flipper\nWait a minute, Floodina, I'm in the kitchen with ripper\nStuttering, goin' dummy, no other doors but the money\nGet it sweeter than honey, you know how T roll ya dummy\nMobbin' deep cuz you nervous, it just be me during murders\nCaptain Loaf from survullance, I mean surveillance, we service\nCash business, you know, family, religion ain't dope\nAin't got my momma in snow, they made me the man and you know\nI talk that **** when I flow, and it be facts\nOnly ****as from my blackboard, to big body bags of crack\nDon't play me for no sucka, ****a, you can't afford that raffa (I know)\nI made up from the dirt, made 6 figures, now I want 7\nMillions, still keep me a million\nI go stupider and get silly on em\nReal ****a 4 real yellin' free Rum Pete on a pimp home\n\n(Hook x2)\nMoney on my mind, on my waist be that strap\nHere to **** my grind, ****a, you dyin' in that stat\nNo joke ****as, I'm self made, I'm a dope dealer\nIn the drug game the doppest ****a\nWe play for keefs, we lay in sheets\nThese bitches don't want no broke ****a\n\n(Verse 3)\nI'm a jello thief turn dirt to sticks\nSay any ****, bitch please!\nCame from the bottom, you make it out\nMake a bad 6-16\nCut the tongues out of my **** ****as\nJust thankin' this **** sweet\nAnd I play ya dues, mr. My City\nI dare young forget me\nOn dough I'mma flip out\nLet's go scremmin' like 12 comin'\nBefore we go pow in the wood pow\nYe ****a really ain't know nothin'\nThey frontin'... with no fish to ride\nI reel cash in, got the money, see?\nI got good aim, I go to Baghdad, every ****a tryna front with me\n\n(Verse 4)\nI do a **** ****a, catch a ****a empty out a clip like it ain't all that\nLet em bom bom with em mutha****a let em cope right now\nWhachya thinkin'? It ain't gonna bite!\nGettin' high with a brand new bitch in a brand new car\nGettin' the same ol' brain\nI'mma zone where A-Town thank yeah ****a\nThis here ****a ain't no game\nHey, I'mma trap till the finish\nRemember me? I was standin' on the corner, I was 'posed to be in school\nKnow crack that we dealin'\nHandle my business, get the money n' the stacks to the ceilin'\nPussy ****a, I would rather be the villain\nIn the Bentley with a couple hunnid mill, ride around with me\nSpend to get a **** ****a bare\nIn here mutha****in' heard\n****a I ain't worried\n\n(Hook x2)\nMoney on my mind, on my waist be that strap\nHere to **** my grind, ****a, you dyin' in that stat\nNo joke ****as, I'm self made, I'm a dope dealer\nIn the drug game the doppest ****a\nWe play for keefs, we lay in sheets\nThese bitches don't want no broke ****a", "image": "https://images.genius.com/68262ccdcbffb87427d31b0d6085c2e3.400x400x1.jpg"}], "artist": "T.I."}