{"songs": [{"title": "The Nigga Ya Love to Hate", "album": "AmeriKKKa’s Most Wanted", "year": "1990-05-16", "lyrics": "[Verse 1: Ice Cube]\nI heard payback's a motherfucking nigga\nThat's why I'm sick of getting treated like a goddamn stepchild\nFuck a punk, 'cause I ain't him\nYou gotta deal with the nine-double-M\nThe day is coming that you'll all hate\nJust think if niggas decide to retaliate\nThey try to keep me from running up\nI never tell you to get down, it's all about coming up\nSo what they do, go and ban the AK?\nMy shit wasn't registered any fucking way\nSo you better duck away, run and hide out\nWhen I'm rolling real slow and the lights out\n'Cause I'm about to fuck up the program\nShooting out the window of a drop-top Brougham\nWhen I'm shooting, let's see who drop\nThe police, the media, and suckers that went pop?\nAnd motherfuckers that say they too black\nPut 'em overseas, they be begging to come back\nAnd say we promote gangs and drugs\nYou wanna sweep a nigga like me up under the rug\nKicking shit called street knowledge\nWhy more niggas in the pen than in college?\nBecause of that line, I might be your cellmate\nThat's from the nigga ya love to hate\n\n[Hook]\n(Fuck you Ice Cube!)\nYeah, haha! It’s the nigga you love to hate\n(Fuck you Ice Cube!)\n(Ay yo baby, your mother warned you about me)\nIt's the nigga you love to hate\n(Yo, you ain’t doin' nothin' positive!\nYo, you ain’t doin' nothin 'positive for the brothers, what you gotta say for yourself?)\n(You don't like how I'm living? Well, fuck you)\n\n[Verse 2: Ice Cube]\nOnce again it's on, the motherfucking psycho\nIce Cube the bitch-killer, cap-peeler\nYo, running through the line like Bo, there's no pot to piss in\nI put my fist in\nNow, who do ya love to hate?\nCause I talk shit and down the eight-ball 'cause I don't fake\nYou're begging I fall off\nThe crossover, might as well cut them balls off\nAnd get your ass ready for the Lenching\nThe Mob is dropping common sense and\nWe'll gank in the pen, we'll shank\nAny Tom, Dick and Hank, and get the ass spanked\nIt ain't about how right or wrong you live, but how long you live\nI ain't with the bullshit\nI meet mo' bitches, mo' hoes\nDon't wanna sleep, so I keep popping No-Doz\nAnd tell the young people what they gotta know\n'Cause I hate when niggas gotta live low\nAnd if you're locked up I dedicate my stylin'\nFrom San Quentin to Rikers Island\nWe got 'em afraid of the funky shit\nI like to clown so pump up the sound\nIn your Jeep, make the old ladies say\n\"Oh my god — brake, it's the nigga ya love to hate\"\n\n[Hook]\n(Fuck you Ice Cube)\nYeah come on fool, it’s the nigga you love to hate\n(Fuck you Ice Cube)\nYeah, what up, punk? It’s the nigga you love to hate\n[Yo, who the fuck you think you are callin' us bitches. You ain’t all that, all I hear is this bitch. I ain’t nobody’s bitch]\nA bitch is a...ohhhh\n\n[Verse 3: Ice Cube]\nSoul Train done lost they soul\nJust call it train cause the bitches look like hoes\nI see a lotta others damn\nIt almost look like the Bandstand\nYou ask me: \"did I like Arsenio?\"\nAbout as much as the Bicentennial\nI don't give a fuck about dissing these fools\n'Cause they all scared of the Ice Cube\nAnd what I say, what I portray and all that\nAnd ain't even seen the gat\nI don't wanna see no dancing\nI'm sick of that shit -- listen to the hit\n'Cause yo if I look and see another brother\nOn the video trying to out-dance each other\nI'ma tell T-Bone to pass the bottle\nAnd don't give me that shit about role model\nIt ain't wise to chastise and preach\nJust open the eyes of each\n'Cause laws are made to be broken up\nWhat niggas need to do is start loc-ing up\nAnd build mold and fold theyself into shape\nOf the nigga you love to hate", "image": "https://images.genius.com/1cb382d2d9fb4a9bfa94e3074c1aa220.1000x1000x1.jpg"}], "artist": "Ice Cube"}