{"songs": [{"title": "S.H.E. (Seductive Human Erotica)", "album": "Vintage Tech", "year": "2005-03-22", "lyrics": "[Verse 1]\nI ain't never paid no chick to thrust\nMe, I never paid no woman to make me bust\nMe, I never needed no other chick to clutch\n'Cause N9na was knowing holy matrimony it's a must\nNever ever paid and came with lust\nMy aims for trust\nBecause my woman's pain is enough\nDon't want my marriage ending strange and abrupt\nBut just here recently my brains corrupt\nOne night my niggas took me to the strip club Bazooka's\nEverybody knows that's not the type of shit I'm used to\nIt's a juicer, so that means there was no clothes\nGot my eyes open wide like I'm on no dose\nLook at these bozos, givin' double 0's for ho shows\nI was cool\nI was drinking my juice I was never really in the mood\nUntil I was approached by a beautiful angel in the nude\nBut I flipped my top\nWhen she sat that butter skin on my lap I was shocked\nLips locked feeling like my heart stopped\nShe was hot!\nShe was Carmen Electra in the chest\nAaliyah by the waist\nJennifer Lopez in the ass\nBut she was an angel in the face\nShe asked me if I wanted to dance on the couch\nWith the look of a zombie I reached into my pouch\nAnd shelled it out\nThen she took me by the hand and lead me to the land\nWhere a man could forget about all his problems at hand\nThe scent of a woman, she wearing Chanel\nHypnotized by the smell, a glimpse of hell\nAnd bodily melt down is what I felt now\nI came with 500 tryin' to keep it all but she want it\nAt the ATM to get 4 more that's the limit the UMB Bank let go\nHeavenly can't describe this woman beyond that\nOur pelvic area steady bumping and grinding in combat\nNo penetration, no touchin' it's funny\nHow she didn't kiss me and didn't fuck me\nBut still got away with all of my money\nS.H.E\n\n[Hook]\nTook everything that I had\nFiending for the sex hella bad!\nTook everything that I had\nFiending for the sex hella bad!\n\n[Verse 2]\nThe next day my wife's checking the account\nShe said your only bringing four thousand a month\nSo last night you spent damn near one thousand on what?\nA new piece of equipment for the studio\nShe'll never really ever truly know\nThat I spent it all on a nudie show\nI close myself in the bathroom\nLean over the stool and grabbed my middle section tight\nThinking about the way she made me feel that night\nI had a lot of fun\nThen I got one, then I got one\nI want back that life, in the next life, but did I come\nWife pissed because I depleted our funds\nShe left me and moved back with her mom\nI'm borrowing money from all my homies\nI knew it was wrong\nBut this bitch was the bomb\nI'm paying the bills at Bazooka's\nI slip my finger through her g-string, it was tight\nShe told the bouncers, now I'm in a fist fight\nYou put me out I thought you loved me\nYou said that you liked it rough like me\nAll these motherfuckers and your man\nCan't love you enough like me\nI lost my life for you, my wife for you\nI miss you so I'm sitting outside the club every night for you\nGot spite for you\nS.H.E\n\n[Hook]\nTook everything that I had\nChin check Ninna hella bad!\nTook everything that I had\nChin check Ninna hella bad!\nTook everything that I had\nChin check Ninna hella bad!\nTook everything that I had\nChin check Ninna hella bad!\n\nSeductive Human Erotica!\nTook everything that I had\nSeductive Human Erotica!\nTook everything that I had\nSeductive Human Erotica!\nSeductive Human Erotica!\nSeductive Human Erotica!\nSeductive Human Erotica!\nTook everything that I had HAHAHAHA\nTook everything that I had HAHAHAHA\nSeductive Human Erotica!\nSeductive Human Erotica!\nSeductive Human Erotica!\nSeductive Human Erotica!\n\n[Outro]\nI got the idea to do this next one, right after the S.H.E. shit happen\nSo my nigga Kaliko came through and blew the shit\nYou mighta heard it on our shows\nIt's a little skit called \"Save Yourself\"\nAll Kaliko man, no background, singers or nothing you knowhaimsizzlin?\nIt's produced by Me, Krizz and IcyRoc\nIt's called \"Save Yourself\" check it out", "image": "https://images.genius.com/a948579698830c97f054acf70a17900c.750x750x1.jpg"}], "artist": "Tech N9ne"}