{"songs": [{"title": "Fish / Boppin’ Bitch", "album": "Goblin", "year": "2011-05-10", "lyrics": "[Part 1: Fish]\n\n[Verse 1]\nSlip it in her drink, and in the blink of an eye\nI can make a white girl look chink\nDon't know what to think, 'cause last time I attempted this shit\nThe judge ordered me to see a shrink\nStarted with the link\nContended her to meet me at the local Odd Future Wolf Gang skating rink\nWe was uniquely in sync\nAlready fuckin' and we only met last week\nWe were both young, not yet antique\nSo her mindset was working for my technique\nTell her that I love her and by next week\nYou can hear her shriek from the gashes in her cheeks\nNo, I'm not a freak, I am meekly a creep\nThe neighbors by the creek says my house stinks\nAnd it reeks on the sheet, girl\nStreaks of red, even though all pussy is pink\nOblivion makes obvious seeks\nWhich make meats for my obvious feasts\nUsed to just blot up thoughts, plot, and rethink\nNow I get daughters and tie 'em and clink\nGot my dick harder than iron and zinc\nNow they just rot up, arms caught in the sink\nWhere they get cut up to fit my physique\nCritique my chic in this brand new mink, go\n\n[Chorus: Syd & Tyler, The Creator]\nOh, oh, oh, oh\nOh, ohh (Fish!)\nOh, oh\nOh, ohh\n(Yeah) Oh, oh (Wolf Gang)\n(Wolf Haley) Oh, ohh (How you doin'?)\n(All good?) Oh, oh (Cool)\n(We cool?) Oh, ohh (I'm upset)\n\n[Verse 2]\nBitches running 'round down, pussy take a trip\nMake her strip, got my dick harder than the unzip\nTyler swiftly slips his dick inside of Taylor Swift's slit\nRound trip in that pussy, here comes a ticket\nFilm clips popping on that Canon\nBusting Ottoman cannons, on the pill\nIs he real? Gaza stripping (In my living room)\nWolf Gang full moon, I'm assuming mushrooms (Mushrooms)\nI'm a necrolampoon, not of Charles Mansoon\nThis fuck is ending soon because I'm ejaculating\n\n[Chorus: Syd & Tyler, The Creator]\nOh, oh, oh, oh\nOh, ohh (Fish!)\nOh, oh\nOh, ohh\n\n[Bridge: Frank Ocean & (Tyler, The Creator)]\n(Frankie, Frankie)\nNow I'd like to take this time of day\nTo thank the Mother Earth (Thank you Momma, thank you Momma, fish!)\nLetting the sun shine down on the lake\nWhile I fish your waters\nOoh, hide your daughters, hide your sisters\nHell, hide grandmama too (Grand, yeah)\n'Cause the fisherman's raping everybody in the pool\nHe on the loose, yeah (Yeah)\n\n[Outro]\nGot to wash it down, all this gold is fuckin' bait\nWait 'til you see the semen swimming\nBaby, please not half, the whole is great\nMorals? Your body's near that coral reef\nIt was once upon a time you came home with me\nThen the next chapter left you in my teeth\nFill your gills with goo\nGoing deeper than Pacific Ocean\nThis specific motion\nMakes this hammerhead puke\nGot to wear a wetsuit, can’t get seasick\nI love when you're in fishnets, you want me to eat you\nYou’re fucking wet, fish\n\n[Part 2: Boppin' Bitch]\n\n[Chorus]\nSo I met this girl at the club\nAnd I just wanted her to suck my dick\nAnd that's 'cause\nShe a boppin' bitch, she a boppin' bitch, she a boppin' bitch, she a boppin' bitch\nNow she's drunk and talkin' to me a lot\nUntil we go to another room\nAnd that's 'cause\nShe a boppin' bitch, she a boppin' bitch, she a boppin' bitch, she a boppin'\n\n[Verse 1]\nThis little slut whore sucks cock for a little more bucks\nThan them other sluts fuck for, real easy\nCause I didn't even knock on the front door, sleazy\nI used the welcome mat as a cum rag\nAnd all the Wolves fucked too, yeah she’s a cum bag\nFilled with a bunch of shit I purchased at a drug store\nFour more Dora-looking sluts let me explore\nUntil my cock got sore and started growing cold sores\n\n[Chorus]\nNow she thinks that I like her\nBut all I really wanted was that mouth\nAnd that's 'cause\nShe a boppin' bitch, she a boppin' bitch, she a boppin' bitch, she a boppin' bitch\nNow she text messages me every day\nAnd I don't ever hit that bitch back\nAnd that's because\nShe a boppin' bitch, she a boppin' bitch (That's right), she's a boppin' bitch, she's a boppin'\n\n[Verse 2]\nThis little hoodrat started jockin' at my jock strap\nUntil my uncircumcised penis finally unwrapped\nFlapping up and down until the cack finally go splat\nNow you gotta spat, spit it out until you do scat\nThen you gotta sat and shit it out, bitch, fuck your feelings\nYou wasn’t feeling shit when you was down there kneeling\nNow shut the fuck up you got another dick to deal with\n\n[Interlude]\nNow, now why can't we fuck with this bitch? (She's boppin')\nWait, tell him why we can’t fuck with this bitch, y'all? (That bitch she boppin')\nWhat is she? She a BB, what does that stand for? (She boppin')\nShe, what do she be doin'? (She boppin')\n\n[Chorus]\nNow I'm at a fuckin' clinic\n'Cause my dick is swollen and keeps itchin'\nNigga, I'ma kill this bitch (She's a boppin' bitch)\nBitch (She a boppin' bitch)\nShe a boppin' bitch\n\n[Outro]\nWhere's my gun? (She boppin') I'ma kill this bitch\nWhy am I gon' kill this bitch?\nTo all my niggas out there listenin', that bitch (She's boppin')\nAnd don't let her suck your dick or you'll get hurt", "image": "https://images.genius.com/fd29e400e2d672aa992f9fda170e9959.640x640x1.jpg"}], "artist": "Tyler, The Creator"}