{"songs": [{"title": "Real Niggaz", "album": "The Pac & Biggie You Never Heard (Bootleg)", "year": null, "lyrics": "[Intro]\nA-yeah!\nBad Boy in the house for the '95\nBig shout out to my man Mel Smith\nTo my man Don Cee Shan in the house\nWhat's up Michelle Ray, what's up boo?\n\n[Verse One]\nSick of mama screamin' that \"Get a job, nigga\"\nPressed to the limit, got to rob me a nigga\nSimple and plain, my man scooped me in the hooptie (uh-huh)\nWhispered in his ear \"This is what we got to do, G\"\nGot to bang a nigga and bang a nigga good\nSo I can cop a Benz and drive the fuck out the hood (uh-huh)\n'Cause baby-mama screamin', \"Your daughter 12 months\"\nCan't live life slingin' rocks and smokin' blunts (ugh)\nHangin' with the niggas don't pay the bills\nAnd being broke at 30 give a nigga the chills\nSo what we gotta do is creep and see a sweet vic\nYo, you see that shit? (Hell yeah, I see that shit)\nColombian, Dominican, yeah whatever\nWhoever he was, he had it tucked under the leather\nTwo keys, 20 Gs, nigga, please!\nBlew his brains out 'cause witnesses, we don't leave\n\n[Hook]\nOn the road to riches and diamond rings\nReal niggas do real things\nHanging with the bitches is the song I sing\nReal niggas do real things\nOn the road to riches and diamond rings\nReal niggas do real things\nHanging with the bitches is the song I sing\nReal niggas do real things, ugh!\nAnd the saga continues, uh\n\n[Interlude: Radio Skit]\nRadio check, back on the phones! I got a caller. Caller, your name?\nYo, this is Jam\nWho?\nJam!\nDJ Jam?\nDJ Jam!\nFuck you doing on the phone? Man, you supposed to be helping me do this Biggie thing...\nMan, if JC can get up in here and do his, you know what I'm saying, lil' roll call, lil' thing, I know I can get up in here and introduce mine. You know what I'm saying?\nAight, yo\nCan I run it down?\nYeah, aight\nI'ma just let the record spin and this what I want you to play, right?\nAight!\nYou can hit me off with uh, first, with \"Ready to Die.\"\nYeah\nCome back with \"One More Chance.\"\nMhm\nThen you know you gotta hit that \"The What\" with the Mr. Mef, right?\nYeah\nAnd then, since it is a \"Everyday Struggle\" out there, you can hit me with that joint, too\nThat's right. Now bring your ass back in this room and get back on them turntables\n\n[Spoken]\nYeah, Bad Boy in the house\nBlowing up the spot and all that\nAnd all this paper, son\nKeep it real, son\nPR in the house\nNasim\nSupa P Kelly Green represent to the fullest\n\n[Verse 2]\nAfter mad blunts and gin we had the plan made\nI bought my wifey a crib, I bought the MAFIA an arcade\nMad games: pool tables and candy (uh-huh)\nA little extra trickin' loot be comin' in handy\nCheck it, got on some '95 shit, sold the 5, bought the 6\nDel Vec, copped the Lex, we was set (ugh!)\nNino had work all in the projects\nNiggas slingin' O's he kept the profit\nNo one could stop it, we was livin it up\nAll the sexy young bitches stressin', givin' it up\nSame bitches suckin' dick, tryin' their best to thrill me\nSaid the niggas I killed is out to kill me\nSoon as she spoke, on that note, I saw trenchcoats\nOne had a MAC spittin', all I saw was gunsmoke\nThe other had a shotty, I was shootin' everybody\nAnd I wasn't missin' (ugh), had to get out this position\nNiggas still hittin', feeling hot ones in my back\nLicked six shots, smoked the nigga with the MAC\nThe nigga with the shotty still bustin', cussin'\nMaricóns and putas, all I'm tryin to do is shoot ya\nTwo shots in the Ruger, booyah! Blew his ass out\nThen I passed out (passed out, passed out)\n\n[Hook]\nOn the road to riches and diamond rings\nReal niggas do real things\nHanging with the bitches is the song I sing\nReal niggas do real things\nOn the road to riches and diamond rings\nReal niggas do real things\nHanging with the bitches is the song I sing\nReal niggas do real things (ugh, ugh)\n\n[Break]\nAnd the saga continues\nBad Boy in the house, for the '95 piece\nReal niggas, aight\n\n[Interlude]\nYo check it\nCall Lil Cease, tell that motherfucker to bring me some motherfucking weed to this hospital\nFuck that, tell Uncle Paulie to go pick up ten thousand from Dez and go take about 20 Gs from Nino\nTell that motherfucker to get this nigga next door up out of here, that nigga be snoring all night, I can't sleep\nAnd call that big butt nurse with the long hair to come suck my dick, ugh!\n\n[Verse 3]\nThe doctor said I need about three weeks of recovery\n(Ugh!) But the nurses is lovin' me\nSayin' the best part of the day is my half\nFeedin' me breakfast and givin' me a sponge bath (ugh)\nNiggas say I died dead in the streets\nNigga, I'm gettin' high, gettin' head on the beach\nChillin (ugh!), sittin on about half a million\nWith all my niggas, all my guns, all my women\nNext two years, I should see about a billion (yeah)\nAll for the love of drug dealing (ugh!)\nGot no love for the other side, fuck them tricks (yeah)\nAny repercussion, Junior M.A.F.I.A. spit clips\nAll the time, Big Poppa kick the raw rhyme (yeah)\nRaw flows, and that's how it goes\n\n[Hook]\nOn the road to riches and diamond rings (yeah)\nReal niggas do real things\nHanging with the bitches is the song I sing\nReal niggas do real things\nOn the road to riches and diamond rings\nReal niggas do real things\nHanging with the bitches is the song I sing\nReal niggas do real things, ugh!\n\n[Outro]\nCheck it out (ugh)\nThe Notorious B.I.G. be representing BK to the fullest (right...)\nJunior Mafia for life!\nGive a shoutouts to DJ Jam! (yeah)\nCraig Frazier! Homicide!\nThe whole Radio Check crew! (yeah)\nDeath Row! The West Coast!\nMy nigga Wiz, my nigga JC (yeah)\nMoney Mal, Big Pump!\nThe whole Junior Mafia clique (right...)\nRepresenting, Uncle Paulie (yeah)\n(Junior Mafia!)\n9-5 motherfuckers!\nGet high motherfuckers! (Junior Mafia!)\nReady to Die motherfuckers!\nAnd if you don't know...", "image": "https://images.genius.com/d2c45ba5a5360d934b6c8f30e1fea115.168x168x1.jpg"}], "artist": "The Notorious B.I.G."}