{"songs": [{"title": "Late Night in Kauai", "album": "STN MTN / Kauai", "year": "2014-10-03", "lyrics": "[Verse 1: Jaden Smith]\nOne time I was at the beach\nAnd we were looking at the stars\nAnd this girl was laying next to me\nAnd the blanket that we had was,  had stars on it as well\nSo it looked liked we were just floating in an abyss\nHonestly, when I see her face I just smile I guess\nI mean, our cars came and the lights were on on them so we could see what the waves look like\nI'll be waiting here on the sand\nI remember that first night\nYou were wearing a power ranger black T-shirt\nSo was I, a different color, so was Moey and his brother\nNot as pure, so insecure\nThe times have changed\nBut really we just looked up at the stars\nFor a couple hours, turned off all the lights on the cars\nThe world was ours it was yours—it was mine\nThe time flew by like it was prime time and I'm inside of\nLife, you shouldn't be my wife you should just be with me\nOn this beautiful night\nMaybe we can make things right\nMaybe we can do it without any spite\nIt's just for tonight, and we hope it doesn't end\nSo we drive back to our homes chilling with our friends\n\n[Verse 2: Childish Gambino]\nBalling like Jabari Parker, they say I look like him\nIf we met bet it would be awkward break out the Sudafed\nCause the flow cold, like a SoCo\nI was smoking smoking John Lennon where my Yoko?\nThis that call yo grandma you ain't ready yet\nVerbal mania, imma show you the illest, get my cousin to kill it\nHad a flow but you steal it, I'm in the mood so we ball out\nGot the top down in the back we could fall out\nWe could fall out, nigga we could fall out\nYour girlfriend push a Prius, she giving me that genius\nMensa, we that Tony Danza\nWine on the rug man you know that shit expensive\nI'm on that Willy Wonka, green so Blanka\nVape so good and the pot like lobster\nNigga, I'm a monster, fuck it, I'm a mon-star\nMan, I got this beat I'm going ham like a cop car\nThat's unless you see me pulling up on the boulevard\nTurn them flashing lights, at least you know who you really are\nWe are becoming god\nWe are becoming god\nWe are becoming god\nWe are becoming god\nWe are becoming god\nWe are becoming god\nWe are becoming god\nWe are becoming god\nWe are becoming god\nWe are becoming god\n\n[Bridge: Childish Gambino]\nI guess this ending's the best for me\nBut I can't leave you behind\nYou know that I never wanted to see what's on your mind\n\n[Outro: Fam]\nGoddamn, Goddamn, Goddamn\nYo it's kinda hard not to like, get fucking cheesy on this shit\nBut, does that even matter?\nYou know what I'm saying, juxtaposition man\nJuxta-fucking-position\nMy nigga Jaden Smith dropping  jewels and niggas don't believe him cause he's Jaden Smith\nBut it's all about packaging right?\nReal shit though, good and bad is all relative man\nIt really is, a lot of niggas is sheep\nWe don't even know what we like anymore\nWe just know what the most hype is\nShit, do you really like that shit you like?\nOr you like the way they gave it to you?\nYou know what I'm saying?\nPepsi, Coca-Cola same thing\nDave Chapelle said that, the one that taste the best\nWas the one that was paying him the most at the time\nThat's all that happens with us man\nWe some weak niggas man, all of us\nFollowers, sheeps, plural made that shit up\nApologin' ain't no real word my nigga\nWe know this, but he knows more cause he broke the rules that don't even fucking exist man\nFunny thing is man is like, as a futurist\nAnd I can call myself a futurist\nNobody is even going to give a fuck until I'm gone\nSo does it even matter?\nYes it does...", "image": "https://images.genius.com/77a2349de407b4d4690746b19b39f6dc.500x500x1.jpg"}], "artist": "Childish Gambino"}