{"songs": [{"title": "You See Me", "album": "Camp", "year": "2011-11-15", "lyrics": "[Hook]\nI'm on my ballin' each and every day\nAsian girls everywhere, UCLA\nYou see me babe? You see me babe?\nAsian girls everywhere, UCLA\n\n[Verse 1]\nI'm on my ish, call it\nI watch these haters take they shots like they were alcoholics\n\"What is he wearing? Somebody jack that fool's steeze\"\nIf I'm a faggot spell it right, I got way more than two G's\nNigga I'm amazing, I'm a phenom\nI'm assassin, I'ma kill y'all\nI'ma say ma ma sa, ma ma ma coo sa\nAnd this shit's closed now cause I ball too hard\nAnd I'm cumming on her face, have I gone too far?\nI don't know, who cares, I don't love that broad\nAnd it's funny how these fake niggas always act hard\nI'm a black star in a black car with a black card\nThey wanna knock me out\nThey tryin nigga\nRealest motherfucker in the game like Tron, nigga\nForget these white girls\nI need some variation\nEspecially if she very Asian\nShe got an ugly friend? Roll solo\nCan I stay at your place? No hobo\nNot my fault, man, these ladies love me\nShe's an overachiever 'cause all she do is succeed\n\n[Hook]\nI'm on my ballin' each and every day\nAsian girls everywhere, UCLA\nYou see me, babe? You see me babe?\nAsian girls everywhere, UCLA\n\n[Verse 2]\nSend me naked pics, I’ma Tumbl that\nI’m the shit, been the shit, fuck a humble brag\nYeah we pushin’ that, and her pussycat\nI got swag out my ass so I’m usin’ that\nTexting with Olivia Munn, hopefully, she’ll give me some\nOr some Rosie Jones, man\nHoes is hoes is hoes, man\nRacks on racks on racks, man\nAll I got is tracks, man\nSorry for my accent, but I’ve been practicin’\nEverywhere ya go niggas blastin’ that Gambino\nNiggas be like, \"You ain't know?\"\nBitches be like, \"You ain't know?\"\nMet this fly Latino\nHope that she eighteen though\nIf she not, I’ll say that I got deep throat in Heathrow\n\n[Hook]\nI'm on my ballin' each and every day\nAsian girls everywhere, UCLA\nYou see me, babe? You see me babe?\nAsian girls everywhere, UCLA\n\n[Verse 3]\nTold me I was shit, but that shit couldn't stop me\nNigga still hungry, black Kobayashi\nWhen I talk about you I hear a \"Who?\" like Horton\nI was born for this shit, you a rappin' abortion\nCan we hear the N-word one day and not get upset?\nCan we try something new and not be suspect?\nI don’t really know, we fucked up bad\nYou don’t wanna see my dudes when they get mad\nI got a bunch of jackanapes at the back of me\nThat’ll lacerate anyone in the back of a matinee\nAnd laugh while they masturbatin' all over your beaten body\nSick Boi forever, that Suburban Illuminati\nNaw nigga, yeah, we never stop\nNo period like menopause\nNo period like, \"Oh shit! Am I the only one you sleepin' with?\"\n\"Am I the only one you sleepin' with?\"", "image": "https://images.genius.com/00196af444633a4108e6dc544358985e.630x630x1.jpg"}], "artist": "Childish Gambino"}