{"songs": [{"title": "Gangsta’s Paradise (Re-Recorded)", "album": null, "year": null, "lyrics": "As I walk through the valley of the shadow of death\nI take a look at my life and realize there's nothin' left\n'Cause I've been blastin' and laughin' so long that\nEven my mama thinks that my mind is gone\n\nBut I ain't never crossed a man that didn't deserve it\nMe be treated like a punk, you know that's unheard of\nYou better watch how ya talking and where ya walking\nOr you and your homies might be lined in chalk\n\nI really hate to trip but I gotta loc'\nAs they croak, I see myself in the pistol smoke, fool\nI'm the kind of G that little homies wanna be like\nOn my knees in the night, sayin' prayers in the street light\n\nBeen spending most our lives\nLiving in a gangsta's paradise\nKeep spending most our lives\nLiving in a gangsta's paradise\nBeen spending most our lives\nLiving in a gangsta's paradise\nKeep spending most our lives\nLiving in a gangsta's paradise\n\nLook at the situation they got me facin'\nI can't live a normal life, I was raised by the street\nSo I gotta be down with the hood team\nToo much television watchin' got me chasing dreams\n\nI'm an educated fool with money on my mind\nGot my ten in my hand and a gleam in my eye\nI'm a loc'd out gangsta, set trippin' banger\nAnd my homies is down, so don't arouse my anger, fool\n\nDeath ain't nothing but a heartbeat away\nI'm living my life do-or-die, what can I say?\nI'm twenty-three now, but will I live to see twenty-four?\nThe way things is going, I don't know\n\nTell me why are we so blind to see\nThat the ones we hurt are you and me?\n\nBeen spending most our lives\nLiving in a gangsta's paradise\nKeep spending most our lives\nLiving in a gangsta's paradise\nBeen spending most our lives\nLiving in a gangsta's paradise\nKeep spending most our lives\nLiving in a gangsta's paradise\n\nPower and the money, money and the power\nMinute after minute, hour after hour\nEverybody's running, but half of them ain't lookin'\nWhat's going on in the kitchen? But I don't know what's cookin'\n\nThey say I gotta learn, but nobody's here to teach me\nIf they can't understand it, how can they reach me?\nI guess they can't, I guess they won't, I guess they front\nThat's why I know my life is out of luck, fool\n\nBeen spending most our lives\nLiving in a gangsta's paradise\nKeep spending most our lives\nLiving in a gangsta's paradise\nBeen spending most our lives\nLiving in a gangsta's paradise\nKeep spending most our lives\nLiving in a gangsta's paradise\n\nTell me why are we so blind to see\nThat the ones we hurt are you and me?\nTell me why are we so blind to see\nThat the ones we hurt are you and me?", "image": "https://images.genius.com/80e7d4d7290ea57cc76b3c5e101a8d2f.755x755x1.jpg"}], "artist": "Coolio"}