{"songs": [{"title": "Made It (Outro)", "album": "Mr. Davis", "year": "2017-09-15", "lyrics": "[Intro]\nHuh, Ziggy (Ziggy)\nZay, Gucci\nZaytoven\n\n[Verse 1]\nI'm the definition of a rich trap nigga\nEx-Con, drug don, certified killa\nYoung nigga trapping for them new Lebrons nigga\nI was trafficking and passing bricks like I'm Lebron nigga\nSteph Curry pound of kush under my armor nigga\nArm and hammer Gucci cook it right in front of niggas\nEverybody bosses really they just runners nigga\nOn YSL designer down I drip like gunna nigga\nHave you been so broke you had to serve a pregnant lady\nFeeding crack rock to a baby and you really just a baby\nThe shit I seen in Sun Valley drive a nigga crazy\nI drunk so many pints I damn near drove my mama crazy\n\n[Bridge]\nThis shit crazy\nI'm crazy\nLife crazy\nThey say my wife crazy\nI'm marrying a killer\nThis ain't rock bottom\nCan't go anywhere but up\nIt's Gucci\nI walk in the bank they say\n\"Hey Mr. Davis, how may I assist you?\"\nIt's Gucci\nIt's Wizop\n\n[Verse 2]\nI act like I forgot but I was once a mental patient\nSittin' still in a cell while my career deteriorated\nNow everyday I wake up I feel invigorated\nGot Rihanna on IG talking about Gucci's transformation\nMinor setback for a major compilation\nMeant to say comeback but I might drop a compilation\nSometimes I post a pic just so I can block all the haters\nA lot of niggas sending threats I don't know what the wait is\nThey actin' like they tough but don't want no confrontation\nThese sucka's ain't even man enough to say congratulations\n2018 20 year my high school graduation\nI might go in my bag and send them on a paid vacation\nYou never sold a brick I understand the fascination\nYou think he a D boy but really he's a scammer baby\nI'm from East Atlanta by way of Alabama baby\nTook so many bricks to 'bama my pic should be laminated\n\n[Outro]\nI know my aunt looking down on me like\n\"I'm glad you made it\"\nI know my uncle looking down on me like\n\"I'm glad you made it\"\nI know Slim Dunk', Bankroll, Shawty Lo, [Lione?], East Atlanta Beasley, looking down on me like\n\"I'm glad you made it\"", "image": "https://images.genius.com/534da4803c3535014a96c123eed6953a.1000x1000x1.jpg"}], "artist": "Gucci Mane"}