{"songs": [{"title": "Gucci Gucci", "album": "Sorry 4 The Wait", "year": "2011-07-13", "lyrics": "[Hook/Intro: Lil Wayne & Sample]\nOne big room full of bad bitches\nOne big room full of bad bitches\nOne big room full of bad bitches\nOne big room full of bad bitches\nSorry for the wait!\nOne big room full of bad bitches (Yeah!)\nOne big room full of bad bitches\nTez pushed the album back, man!\nOne big room full of bad bitches\nOne big room full of bad bitches (Sorry!)\nUgh!\n\n[Verse 1]\nFuq' got the weed, Marl' got the gun\nThey say numbers don't lie; bitch, I'm not the one\nHammers in your face, this is not a dream\nAnd you're getting every page of this magazine\nBumping UGK, talking about a murder\nWe roll a Dr. J and then we light that Julius Erving\nI got pussy on the way and pussy on the way out\nLife is a beach and these hoes trying to lay out\nTunechi, Tunechi, tote the toolie, fuck around and pop ya\nMy homies got that white girl, call it Lady Gaga!\nGlock 4-tini, nina colada\nSuck, swallow; semen, saliva\nI am going at your collar; fuck you hoe niggas\nWeezy go hard, you bitches go figure\nDiamonds in my teeth like I'm a fucking dope dealer\nYou're a dead man walking: Michael Jackson, Thriller\n\n[Hook: Lil Wayne & Sample]\nI'm in one big room, full of bad bitches, yeah!\nOne big room, full of bad bitches (Ugh! Ugh!)\nOne big room, full of bad bitches (Yeah!)\nOne big room, full of bad bitches (Ugh, ugh, it go...)\nTunechi, Tunechi, tote the toolie, fuck around and pop ya\nMy homies got that white girl, call it Lady Gaga\nTunechi, Tunechi, tote the toolie, fuck around and pop ya\nOne big room, full of bad...\n\n[Verse 2]\nBack where I started on my set, in black\nAll chrome Glock looking like a platinum plaque\nWe don't pack extra clips, we pack extra Gats\nAnd all my hoes dirty like welcome mats\n'Til the wheels fall off; I can fix a flat\nIf you're scared, go to church and get a scripture tat\nGuns the size of children; now, don't be childish\nBe with wild-ass niggas, and I am the wildest\nI'm a motherfucker; call me Weezy, baby\nAnd on the end of the barrel, I got a sweet potato\nMy life is a movie, I got a leading lady\nMy rooftop drop back like Tom Brady\nI got the world in my hands, skateboard and my Vans\nAnd all my boys stay strapped like we live in Iran\nI know what I can do, so, bitch, I do what I can\nDropped that Sorry 4 the Wait, man, I'm just saying\n\n[Hook/Outro: Lil Wayne & Sample]\nI-I'm in one big room, full of bad bitches, yeah!\nOne big room, full of bad bitches (Haha!)\nOne big room, full of bad bitches (Ugh!)\nOne big room, full of bad bitches (Haha! Ayo, I- I- Yo!)\nOne big room, full of bad bitches\nAyo, Kreayshawn, you can get it! (I'm sorry for the wait!)\nOne big room, full of bad bitches\nYo, yo! Kreayshawn, you can get it! (BP, I see you!)\nOne big room, full of bad bitches (Fükey, baby!)\nStraight up! You can get it!\nOne big room, full of bad bitches (Mike Banger!)\nDrop the Golden Gate Bridge! (Uh-huh!)\nOne big room, full of bad bitches\nScoo-Scoo, what's good?\nOne big room, full of bad bitches\nDrop the Golden Gate Briiiidge!\nOne big room, full of bad bitches\nHood, I see you! (I'm gone)\nAHHHHHHHHHHHH I'm sorry for the wait!", "image": "https://images.genius.com/a22efe31e108ac84ea44f489ff2716f3.320x320x1.jpg"}], "artist": "Lil Wayne"}