{"songs": [{"title": "Wish You Would", "album": "Theater of the Mind", "year": "2008-09-02", "lyrics": "[Intro: Ludacris] + (T.I.)\n(Here we go!) Surprise nigga (hahaaaa!)\nIt was bound to happen sooner or later (Hahahahaha)\n(They ain't ready for this)\nHistory has been made; ATL, yeaaaaaah...\n\n[Hook: Ludacris] + (T.I.) + {Woman}\nCause I got {big bank}, all these haters wanna grill me\n(But fuck that I'm about my money if it kills me)\n{Yeeeah baby!} (And I'm up to no good)\nAyyy I wish a motherfucker would\nTHIS THA A-TOWN, COME INTO MY HOOD\nAyyyy I wish a motherfucker would\nHOUSTON, DALLAS COME INTO THEY HOOD\nAyyyy I wish a motherfucker would\n\n[Verse 1: Ludacris]\nI keep a fresh pair of Ones on my feet\nAnd double deuces on the Chevy\n3's company, the double 4's on my belly\n5 hot amps speakers shake like jelly\nSo many wires in my trunk look like a bowl of spaghetti\nAssault and batteries, but my trunk stay \"Ever-ready\"\nAssault and battery if you scared you never ready\nAnd yeah I went green, and 26's on the hybrid\nSmoked so much green that I can't open up my eyelids\nWake up in London, go to sleep on Atlanta time\nStill my paint got more candy then your valentine\nFor five mill, I bought a lake front crib\nBentley Car cover lookin' like a laced-front wig\nOf course they hating cause they still riding the MARTA train\nRe-name the yacht but put the plane in my daughters name\nNow that's Karma, so call me Daddy Warbucks\nIf you got money, I got more bucks\n\n[Hook: Ludacris] + (T.I.) + {Woman}\nCause I got {big bank}, all these haters wanna grill me\n(But fuck that I'm about my money if it kills me)\n{Yeeeah baby!} (And I'm up to no good)\nAyyy I wish a motherfucker would\nNEW YORK & JERSEY COME INTO THEY HOOD\nAyyyy I wish a motherfucker would\nL.A. & THE BAY COME INTO THEY HOOD\nAyyyy I wish a motherfucker would\n\n[Verse 2: Ludacris]\nLUDA! I'm a freak like a scorpio\nCustom hood scoops make the coupe look like Pinocchio\nI'm rich bitch, I should drop cash\nThe inside of the Lac' look like a wood shop class\nAnd these women gimme love like it's tennis time\nSo many shoes that my closet look like finish line\nSo many acres that my crib look like Bermuda\nSo many diamonds, the safe look like Kay Jewelers\nThat Spider about to drop, my team said, \"Luda get it!\"\nNow 50 thou says that I'm the first nigga with it\nFirst round draft pick, later for you imbeciles\nThe car is all black like it got traded to the Timberwolves\nAnd I keep a little bit of that green up in the lining\nBut as the weather change, my weed adjust to different climates\n(Okaaay) Green in the summer time, orange in the spring\nNow it's black with that purp I call my whip the \"Sac Kings\"\n\n[Hook: Ludacris] + (T.I.) + {Woman}\nCause I got {big bank}, all these haters wanna grill me\n(But fuck that I'm about my money if it kills me)\n{Yeeeah baby!} (And I'm up to no good)\nAyyy I wish a motherfucker would\nCHI-TOWN AND DETROIT, COME INTO THEY HOOD\nAyyyy I wish a motherfucker would\nD.C AND B-MORE, COME INTO THEY HOOD\nAyyyy I wish a motherfucker would\n\n[Verse 3: T.I.]\nI'm fly enough to fly away, trouble I don't shy away\nFrom it, I annihilate suckers in they driveway\nIn church on Sunday morning prayin' 'bout what happened Friday\nBut them the consequences for coming at pimpin' sideways\nNowadays guess it pays to change\nIn cahoots with corporations, making major change\nWith magnificent watches and amazing chains\nPlush pad in Atlanta and L.A.'s the same\nI'm balling til I'm bored with selections and assortments\nOf automotives worth a small fortune, of course it's\nThe '72 Chevelle hardtop, '69 drop\n60 karat piece; you can barely pay your lease, peep!\nDude wanna talk new school tell him go ahead\nDrop-head double R-Maybachs and corner sales\nSwag out the ass, stack cash to the hairline\nFuck another car, it's time to try and buy a airline\n\n[Hook: Ludacris] + (T.I.) + {Woman}\nCause I got {big bank}, all these haters wanna grill me\n(But fuck that I'm about my money if it kills me)\n{Yeeeah baby!} (And I'm up to no good)\nAyyy I wish a motherfucker would\nMIAMI TO ALABAMA, COME INTO THEY HOOD\nAyyyy I wish a motherfucker would\nPHILLY TO BOSTON, COME INTO THEY HOOD\nAyyyy I wish a motherfucker would\n\n[Outro: Ludacris - chopped and screwed]\nST. LOUIS TO TENNESSEE, COME INTO THEY HOOD\nPHOENIX TO V.A., COME INTO THEY HOOD\nOHIO AND INDIANA, COME INTO THEY HOOD\nMISSISSIPPI AND CAROLINAS, COME INTO THEY HOOD\nDUVAL AND LITTLE ROCK, COME INTO THEY HOOD\nOKLAHOMA TO LOUISIANA, COME INTO THEY HOOD\nKANSAS CITY TO SEATTLE, COME INTO THEY HOOD\nMINNEAPOLIS TO MILWALKEE, COME INTO THEY HOOOOOOD", "image": "https://images.genius.com/0ffc16e65d7181f3eec0b4453b326a01.280x280x1.jpg"}], "artist": "Ludacris"}