{"songs": [{"title": "My Birthday", "album": null, "year": null, "lyrics": "[Intro - Lil Wayne]\nYeah, is the tune on? oh, it's on\nBasically\nI got Streets in the booth with me\nDedication trois\n\n[Verse 1 - Lil Wayne]\nNow let me talk my shit\nFresh up out the water like I caught fly fish\nWeezy F. bitch, I can say what I please\nSwagger so cold it stay when I leave\nI see you little doggs just shaking out fleas\nI kill dogs like I'm making Chinese, food\nRude only when I gotta be\nSometimes I gotta tell myself not to bother me\n\"Tell Lil Wayne not to bother Weez!\"\nShawty won't be on my team, she could cheerlead\nShit, like \"Go, Wayne, go!\"\nIce on a white tee, I make a snow angel\nY'all niggas squares, but ain't got no angle\nMy shit's so tight you can get strangled\nIt's Young Money, ain't no such thing as plain clothes\nPolo jammers, Louis slippers\nCall them \"private plane clothes\"\nI'm taking off, going to another land\nCall her misses, never going to another man\nShabba Ranks Weezy, muthafucker, I'm a lover man\nYeah talk that shit Tune\nI gotta wipe my diamond grill with a tissue\nI'm talking too much shit\nI eat pussy and you suck dick\n\n[Kidd Kidd]\nThey call me \"Lil Nut\" but my nuts aren't\nThe same. No homo, that's how I came in the\nThe game, I married Mary Jane, I seen the\nSpidermane, the shit that made Pinky blow\nOut the Brain brain. Told Lois Lane\nI can't be a Super Mane, my whole\nSuit black like bat mane and I keep that iron, mane\nAny woman yellow flag me, throw me out\nThe game, I'm back at the halftime\nLike it's just an ankle sprain\nAin't no one could do it better\nMore hits than Eddie Guerrerra\nThe flow like ? at the competitors\nIt's mass hysteria. Historic in\nYour area, 51 alien, what planet is he from\nHuh? Ain't no fun when the rabbit got the shotgun\nPicture Bugz with the shotgun up to Elmer Fudd\nAll my thugs get dirty like we running\nIn the mud, we 7:30 livewires\nPlug off the chain, utterly untame\nPut the gun to your frame, bitch a bloodstain\nHard to come out, like a love-stain\nI came from nothing, fucking calling hoes\nAnd flying planes; who the fuck could complain?\n\n[Gudda Gudda]\nSo you mad cause I'm styling on you?\nLights off, mask on, creepy siding on you\nGet violent on you, you a sissy like Sisqó\nGudda: I'm the East gang schizo\nIt's no coincidence, man, I bet your bitch know\nHow I knock her down with the Kosher dill pickle\nHow I yell a nigga but my heart dark like nut skin\nBitches aiming for the pockets? You get nothing\nLet me get back in it, bitch\nI just go ahead first, you be on that timid shit\nGet head first, then I be on my Jimmy shit\nShitting on bitches with that Chris Brown\n\"Don't give me shit!\" Niggas in the streets say\n\"Kill them all!\" Bitch, you know we got guns\nLike the Pentagon. I'm just eating nigga\nI'm getting my dinner on\nAnd your bitch licking: getting her lizard on\n\n[T-Streets]\nTalk reckless, I don't give a muthafuck\nI make you do what you is, bitch nigga, duck\nCome for you and your kids like nigga what\nNiggas with elephantitis ain't got bigger nuts\nYoung Money nigga: big dicks, big trucks\nI'mma smash a nigga if he try to diss us\nGo to court: the case get dissmussed\nCause if we did time, your main bitch would miss us\n\n[Mack Maine]\nIt's Mack Maine: ain't shit to discuss\nI get up in a bitch throat like hiccups\nI Chris Kringle bullets with niggas like Christmas\nThen turn to their female dog like \"bitch, what?\"\nMy niggas squeeze triggers like they got arthiritis\nMy dick big: that's why I walk like I got tendonitis\nI spit nasty on the mic like I got gingivitis\nThe doc said I got a case of \"real\" nigganitis\nHe ain't got a vaccine or cure strong enough to fight it\nSee, I'm a warrior. They compare me to Leonidus\nI got a set fee: I ain't about discussing prices\nCause I ain't tryna go broke like Hammer or Mike Tyson\nWish you could see my face now\nFeel like I'm poltergeisting\nSee me in streets, be Street Fighting like\nBlanka or Bison. Slicing, dicing\nLike w butcher knifeing. Wifing\nBitches? Never, that shit is trifling\nYoung Money the fucking nicest\nPut words together like a fucking hypen\nNigga don't make us start fucking rifling\nNigga we got a lot of rappers striking\nStanding by the harvest for fruit\nWaiting for the fruit to ripen\nWe run up on niggas and jack the for their stipend\nCatch me in Minnesota like I'm a Viking\nI'm with every video vixen you liking\nI'm the reason your bitch dyking\nHow I get like this?\nI'll pump a nigga breaks, something like Midas\nI try to be modest, nigga I'm honest\nAnd this is what I did for my birthday, bitch\nI ain't get no pussy though", "image": "https://images.genius.com/f903dae2533e450c8d3cb233aa846020.745x745x1.jpg"}], "artist": "Lil Wayne"}