{"songs": [{"title": "The Wall", "album": "The World is Yours", "year": "1993-08-17", "lyrics": "[Intro]\nSo Brad, tell me what's going on in your world?\n\n[Verse 1]\nIt's fucked up, I'm looking at myself in the mirror\nI'm seeing something scary; it's blurry, make it clearer\nI got a funny feeling that today will be the day\nThat someone tries to blow my motherfucking ass away, hey\nI did some wrong In My Time of Dying but\nI never felt the nerve to make the motherfucking final cut\nI've been depressed for no fucking reason\nBut every problem's got a reason; I'm kinda having trouble breathing\nSomebody help me, hear my plead, my battle cry\nMy psychic told me, it's gonna be hard for Brad to die\nShe told a lie; I think I oughta shoot the bitch\nI got my pistol, thinking if I should shoot the shit\nClick, bang, I jammed it, I slammed it;\nAw shit, goddammit!\nI'm having a fucked up day to begin with\nI lost a bitch, a bird, and then this\nMy homies tend to think I get too high\nI'm doing fine, now pass me the formaldehyde\nThe only thing that seems to help me cope\nIs when I'm drunker than a motherfucker puffin' on the chronic smoke\nAnd then I'm able to deal with the woes\nThe friends, the foes, the bitches, the hoes\nI gotta gang of niggas, and none of them I'd fuck\nI gotta gang of bitches, and none of them I'd trust\nTrust a bitch, nope, uh-uh, never\nI'm having enough trouble trying to keep my damn self together\nThey got me by the balls\nSo please, help me break these motherfucking...\n{*pause*} .. these motherfucking walls\n\n[Verse 2]\nI scream. There's no one there that seen me cry\nI guess its hard to scream to motherfuckers when you scream inside\nI'm staring at my future, it's in plain view\nI blame myself, but, Mommy dear, I blame you\nCause now I'm finally looking at the picture\nMy daddy shoulda quit ya, right before he hit ya.\nOr swung it to the left instead\nAnd left a big-ass stain in the fucking bed.\nBecause the world was fucked from the first\nAnd having me only made the matters worse\nNow look at what they did to me\nThat's some fucked up shit for a kid to see\nMotherfuckin villain after villain, killin after killin\nI'm tryin' to check a million\nThe world's going straight to fuckin satan\nA fucking shame ... about to blow my fucking brains\n\n[Verse 3]\nShit, damn I'm dead\nI'm finally through hearing all these voices in my head\nSomebody finally got me\nI'm looking at my self outside of my fucking body\nSo now I'm standing face to face\nMr. Scarface, versus Mr. Scarface\nWe were two different people from the start\nOne nigga's too smart the other too fucking hard\nAnd both refused to be outsmarted\nDearly departed, the battle's already started\nFuck it, it's on, I swung, I duck, I weave, connect, I'm struck\nCaught me with the piercing lead\nAnd realized to myself, I shot my own fucking self!\nDamn, suicide is quicker\nI try to break the wall the wall keeps getting thicker\nI really start to miss my mother\nI'm trying to to climb the wall, its higher than a motherfucker\nAnd hollow's what the sound is\nI'm having major problems trying to walk around it\nAnd ain't no getting out; I'm trapped\nI really should've dropped my motherfucking strap\nCause when I think about it now\nI didn't have to climb the motherfucker\n{*pause*} ... I shoulda broke the motherfucker down", "image": "https://images.genius.com/2c9d70007eb3a5b42d898b73f3ce76f0.936x936x1.jpg"}], "artist": "Scarface"}