{"songs": [{"title": "Down South Funk", "album": "Doc’s da Name 2000", "year": "1998-12-08", "lyrics": "[Redman]\nAll the way to motherfuckin Georgia\nTo Tennessee\nTo motherfuckin Texas\nTo North motherfuckin Carolina\nYeah, South fuckin Carolina\nYeah, deep down, gritty Alabama\nFunk for your funkin ass, nigga\nHa ha, barefoot walkin motherfuckers\n\n[Erick Sermon]\nYo, guess who's bout to stomp tonight?\nThree seniors, rockin the mic, catchin misdemeanors\nSo charge us with what-what-ever you feel\nBalls of Steel, clappin those with rap deals\nFuck hot, I'm lukewarm and still perform like a champ\nBattle bout, airing your ass out\nSo who's dropping shit on what day? My click's the greatest\nChill, or feel the effect of hi-atus\nShit shuts down when the Squad's around\nIt gets _Thinner_, it's hexed like white man from town\nThree the hard way can't be touched\nMy style's too faraway, to capture, even with help from NASA\nI'm what they call, a living legend, sha-POW\nThat's what they call, a Mac-11, sha-POW\nThere's two on the way down, BLAOW BLAOW\nHere's two more, BLAOW BLAOW nigga!\n\n[Keith Murray]\nIs y'all niggas down to ride? (Man listen)\nWould you kill for your life? (Man listen)\nCan you get busy all night? (Man listen)\n(Hah hah..) (Man listen)\n\n[Redman]\nYo-yo-yo yo, yo yo!\nI got the Down South Funk when I clown out punk-ass\nPolice wanna call dogs and sound off pumps\nI short your Blaupunkts if you thump my tape\nYo dial funk if you're mo' stiff than Rikers Isle bunks\nGet out your seat, E, spit out the beat\nThe tracks plow underground concrete out the streets\nFrom baldies to fades, when I rock MC's wave\nMore flags than Puerto Rican Day parade\nAnd give up, I got the rare footage, of fiends walkin\nBarefooted off my rhyme don't dare cook it\nYou might fall in to intervene\nAnd New Jacks and they girl become Pookie and that, PROM QUEEN\nThat bodybag won't fit you tonight\nYou wanna blow up? Drop the mic, stick to the pipe\nHand to hand my crew'll cripple your click in a fight\nTake my tapes way Down South and triple the price\nStep up on the scene like whazzup? Hey sugah\nBefore you cock-tease Doc, how that cash put up?\nAnd only way I stop til your click say when\nThey had enough, cause I could bump to six A.M\n\n[Keith Murray]\nIs y'all niggas down to ride? (Man listen)\nWould you kill for your life? (Man listen)\nCan you get busy all night? (Man listen)\n(Yo, yo-yo) (Man listen)\n\nMy life is a rap, each song is a flashback\nOf antagonizing anxiety attacks\nThe beat hits the ground and the earth cracks\nNiggas be like, \"OH NO NOT THEM!\" Yeah we back\nWith rhythmatic articulation, God-forsaken\nSick manifestations, PUMP PUMP in your face then\nThe lyrical force that I put in a rhyme\nWill hit you with more power than a molecule enzyme\nNo matter who what when where how I'll lay you down\nWith a sick illed out fictitious style\nYo, we all represent the hood -- the only difference\nBetween us is that we make the shit look good!\nProgrammable annual slammable\nYou Lyte as a Rock and I Cram to Understand You\nSo for niggas on a mission kissin ass and dissin\nWe get even like an ambixdeterous, man listen\n\nIs y'all niggas down to ride? (Man listen)\nWould you kill for your life? (Man listen)\nCan you get busy all night? (Man listen)\n(Man listen)\n\nIs y'all niggas down to ride? (Man listen)\nWould you kill for your life? (Man listen)\nCan you get busy all night? (Man listen)\n(Man listen)", "image": "https://images.genius.com/ff1bcd7d83855df13cac08a00e033052.594x594x1.jpg"}], "artist": "Redman"}