{"songs": [{"title": "Got (That)", "album": null, "year": null, "lyrics": "[Intro]\nMe like the smell of money you dig what I'm saying\nYeah, bitch, I like the smell of money\nDora just brought me ten thousand dollars in a band nigga\n\n[Hook]\nHey! Every three days, brand new weed\nAye! Five or better upon that team\nHey! I want thighs I don't want no legs\nThat's why I got a diving board inside that bitch, Aye!\nDiving board inside that bitch, Ooh!\nDiving board that ho, Hey!\nDiving board inside that bitch, Aye!\n\n[Verse 1]\nI'm a dive in that cat, Aye!\nI'm a sit in that Bach, Aye!\nFat ass selling crack, Aye!\nI'm fire without a match, Hey!\nHey!, Hey!, Whoo!, Get paid in full and I relax, Hey!\nBae kiss me all over that\nNo phone, my lips need chap\nStick the dick inside these hoes today, boy!\nI'm a jump inside that bitch like andalé\nI'm a pull a pointer's head like a frito-lay\nI'm a catch me a brown bitch like baked beans, schwoo!\nMitsubishi stuffed down to the goddamned ground\nCall lil mama Pacquiao, She want a whole lot a round\nI'm a use her, That usher piece up A-Town down\nWe selling drugs, We on your ass like a goddamned hound\n\n[Hook]\nHey! Every three days, brand new weed\nAye! Five or better upon that team\nHey! I want thighs I don't want no legs\nThat's why I got a diving board inside that bitch, Aye!\nDiving board inside that bitch, Ooh!\nDiving board that ho, Hey!\nDiving board inside that bitch, Aye!\n\n[Verse 2]\nPitching underarm and I will play\nPimping all these hoes like Scottie Pippen\nI'm Tony Montana, bome and get me (Bome on!)\nStuff my body with fluid like I bought some Chappie\nNo Rick Ross, I want gun play\nBet a hundred thousand dollars on a Sunday\nI got seven cars parked on a one way\nY'all pussy niggas walking on run-way\nShe want my ice and my cream like a sundae, Hey!\nAnd I'm done with this gangster shit like Ken I'm a Barbie, Yeah!\nYeah! Nigga YSL Barbies\nYeah! There's got a lot of old hundreds and they wrinkled up like a Shar-pei\nOoh! I'm a pull up on a nigga block, Bangin' stars like I work at Hardee’s\nOoh! Lil mama booty soft even though she still horny\nHey! My plug named Bob, Marley\n\n[Hook]\nHey! Every three days, brand new weed\nAye! Five or better upon that team\nHey! I want thighs I don't want no legs\nThat's why I got a diving board inside that bitch, Aye!\nDiving board inside that bitch, Ooh!\nDiving board that ho, Hey!\nDiving board inside that bitch, Aye!", "image": "https://images.genius.com/717461618e785def35d07de6484b7ad4.1000x1000x1.png"}], "artist": "Young Thug"}