{"songs": [{"title": "Ridin’ in My Chevy", "album": "Ego Trippin’", "year": "2008-03-07", "lyrics": "[Snoop Dogg]\nRidin in my Chevy and I'm sittin at the light\nAt the light, I got kush in my blood\nSippin Remy keep it pimpin with my pinky off the cut\nAnd all the people when they see me like, \"Snoop, turn it up!\"\n\n[Hook: Snoop Dogg]\nWhen I'm ridin in my Chevy and I'm sittin at the light\nAt the light, I got kush in my blood\nSippin Remy keep it pimpin with my pinky off the cut\nAnd all the people when they see me like, \"Snoop, turn it up!\"\n\n[Snoop Dogg]\nI'm in my zone muh'fucker\nGet stuck in the ribs by a old bone crusher\nTwo-tone leather with the soul of a hustler\nTryin to stack mayo, stealin clothes from my brother\nPeople wanna know am I close to my mother\nI'm a premature baby, I'm ahead of the others\nYes, I'm aware of the gutter\nAhead of my time, the game's gettin smothered\nI stay on the grind but it's only gettin rougher\nNiggas think I'm playin 'til they smokin like a muffler\n'Bout to take flight, the lane open on you bustas\nCatch me if you can in a world full of suckas\nNiggas keep simpin, they wanna be Usher\nUntil they get their eyes and coffin closed by the usher\nThem punches won't work, you need mo' muster\nLord lay him down, he need no sufferin, nigga\n\n[Hook] - 2X\n\n[Snoop Dogg]\nHmm, on my road to riches\nI done seen a lot of roaches and bitches\nThat's why the Dogg keep, goin the distance\nBut niggas don't know when to listen, that's why I load ammunition\nAnd stay in touch with my competition, I'm in touch with my composition\nRoll a blunt, it's the kush, yeah we got prescriptions\nJust a G5, no encryptions\nPick a side, yeah you know we Crip'n\nAnd through my eyes I see the world different\n100 G's to record wit him, hit the gas give me more engine\nThis is somethin that was born in him\nNo game for a bitch, just forfeit him\nI'm in tune, give me more rhythm\nI let the bullets and the swords hit him\nAll P's like a Porsche emblem\nNow make dead with the mortician\nNigga, this Bigg Snoop Dogg you best to listen\nYa heard me?\n\n[Hook] - 2X", "image": "https://images.genius.com/fd5ace5214e5da1f374653720da7d1c1.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}