{"songs": [{"title": "Ramona", "album": "Pound Syndrome", "year": "2015-07-24", "lyrics": "[Intro: Skit]\n\n[Ramona]\n*Door knob rattling and panting breath*\nHopsin\n*Phone dialing and ringing*\nHopsin, Hopsin, Hopsin are you there?\n\n\n911: 9-1-1 Emergency, what's the issue?\nHopsin: Th-this girl she's out she's...\n911: Wow, wow, wow relax honey, speak to me\nHopsin: There's this girl outside of my house and she keeps tryna come in\n911: Uh huh\nHopsin: And I keep tryna push her away but...but I feel like she's gonna come in and do something...I...I don't know...\n911: Okay, what is your name darling?\nHopsin: It's Marcus Hopson\n911: Okay Marcus, relax\nHopsin: I'm trying\n911: I need you to explain to me who this girl is please\nHopsin: Okay, okay, okay...\n\n[Verse 1: Hopsin & 911]\nHere, let me read you her bio (go 'head)\nShe was raised in Cleveland, Ohio (Uh huh)\nGot a tattoo of a cross on her left tit\nYo, but, she don't believe in no bible (what?)\nShe flashing niggas when I'm on stage\nShe let anyone see 'em at my show (you're kidding)\nFirst time I met her was at a meet and greet\nShe ran up in a hurry and was like \"woah\"\n\"Hi Hop, I'm Ramona (hi)\nPlease forgive me, I might go nuts\nI don't know but I'm like so lucky\nAnd I just wish I could just...oh fuck\nI'm nervous and I feel worthless\nPlease don't think I'm doing this on purpose\nI just cannot control all my urges\nYou're just...oh my God you're so perfect\"\nMan if you fuck with this bitch then you're doomed (yup)\nShe followed me and my tour crew\nTo my hotel, I'm like \"who you?\nWhere you going?\" she said \"your room\" (silly)\nLike \"woah look, ho you gotta go, just because I ripped the mic\nDon't mean you get the right to follow me back to my hotel room, you ain't 'bout to spent the night, aight?\"\nShe said \"okay, Marcus, what if I give you my pussy (what?)\nOh my God, getting fucked by Hopsin, do you know how awesome that would be? Ah\"\n\n[Hook]\nRamona, mona, Ramona, mona\nRamona, mona, Ramona, mona, Ramona\nThis bitch is stalking me, fucking\nRamona, mona, Ramona, mona\nRamona, mona, Ramona, mona, Ramona\nGet this bitch off of me\nFucking Ramona\n\n[Verse 2: Hopsin]\nShe became friends with my girlfriend but my girlfriend did not know (know what?)\nThat Ramona's obsessed with me, she been to at least ten of my shows, woah\nFucking all my niggas names up she like \"Gerald Benton, he wrecks it\nDisney Wright, weed repping, I love SwisSs, three S's\"\nI'm like \"God damn bitch, You ain't even got no chance bitch\nYou ain't even my real fan bitch, you only know 'Sag my Pants' bitch\"\nAll over my Instagram pics, tryna get my attention\nHoping I'mma get you a ticket and fly you to Cali and put you in a bed you can ride the dick in (hell no ho)\nI can't lie though, her ass fat\nShe send me nudes up on Snapchat\nI know every nigga done tapped that\nShe gets sad 'cause I do not snap back (hahaha)\nThat nasty girl, I ain't touching her (nope)\nFuck her, I don't fuck with her (nuh uh)\nShe a real rap chasing hustler\nIf you see her ass, hit the slut alert\nThis one time she tried to cut....\n(Oh my God, Hopsin) what the fuck (hey)\nWhat the fuck are you doing here?\n(I love you so much) shut your ass up, get your ass out\n\n[Hook]\nRamona, mona, Ramona, mona\nRamona, mona, Ramona, mona, Ramona\nThis bitch is stalking me, fucking\nRamona, mona, Ramona, mona\nRamona, mona, Ramona, mona, Ramona\nGet this bitch off of me\nFucking Ramona\n\n[Verse 3: Jarren Benton]\nYo Hopsin (what up man?), you know that bitch named Ramona? (yeah)\nI know you said that hoe's a space case but guess what (what?), I boned her, ah\nI swear to God Hop, man, it's been sick\nShe be like \"Jarren, oh my God, you're the shit\nI'll never, ever, ever, ever brush my teeth now that my breath smells just like your dick\"\nYuck, she won't leave me alone\nEvery five seconds, bitch blowing up my phone\nI'm paranoid hoping she don't show up at my home\nWhat the fuck was I on? Pills or Patron\nThen the bitch talking 'bout she's knocked up\nHow bitch, damn, I had my cock locked up\nWith a latex condom, and we just fucked two days ago\nNow how the fuck a baby pop up?\nAh, she like \"Jarren you're right, must be SwizZz or maybe Dizzy Wright\nCause he went inside it raw like, just the other night\"\nSwear to God Hop, we gotta take this whores life\nBut damn, who gon' let Kato know?\nThat's the nigga's girlfriend, he don't know that she a hoe\nNow she on DJ Hoppa's dick like \"go DJ, go DJ, go\"\nGo DJ, go DJ, go\n\n[Hook]\nRamona, mona, Ramona, mona\nRamona, mona, Ramona, mona, Ramona\nThis bitch is stalking me, fucking\nRamona, mona, Ramona, mona\nRamona, mona, Ramona, mona, Ramona\nGet this bitch off of me\nFucking Ramona\n\n[Outro]\nI am not one of your fucking groupies Hopsin\nAnd honestly, you just lost a fucking fan, okay?\nI told all my friends about your music\nAnd now I regret it, and Jarren, you're a fucking liar\nI only know you because of fucking Hopsin, okay?\nAnd I genuinely thought you were a nice fucking guy\nSo I sucked your dick, and you made fun of me\nYou made fun of me for sucking your fucking cock\nI so can't live with myself right now\n....Okay I'm over it", "image": "https://images.genius.com/e4079e5e3fa49647b0a22cad37ceae57.1000x1000x1.jpg"}], "artist": "Hopsin"}