{"songs": [{"title": "Lintballz", "album": "The Trials & Tribulations of Russell Jones", "year": "2002-03-19", "lyrics": "[Intro: Zoo Keeper (Popa Chief) {Ol' Dirty Bastard}]\n*Popa Chief singing \"Do or die, do or die, do or die\nDo or die\" throughout intro*\n(What's your move bitch nigga?)\nSuttin' ain't goin' down like that\nI ain't lettin' niggas know they ain't know\n(what's goin' on in yo life\nHow you gonna get what you ain't got?\nYou know what I'm sayin'?) You ain't gonna get it\n(Yeah) That's the way it's goin' down\n(Yeah, yeah, yeah, yeah) Fuckers are around\n{Yo I mastered the art of Shadowboxin'!}\n\n[Hook : Popa Chief]\nDo or die, ball or fly\nLintballz always hangin' around tryin' to get high\nBut fuck sittin' around waitin' on a hook up\nIt's time to turn the heat up\nAnd catch these papes like cooked up\nWhat?\nDo or die, ball or fly\nLintballz always hangin' around tryin' to get high\nBut fuck sittin' around waitin' on a hook up\nIt's time to turn the heat up\nAnd catch these papes like cooked up\nWhat?\n\n[Verse 1: 12 O'Clock]\nNiggas waitin' for hook up, get shook up\nNever get your weight off and do a push up\nYou smokin' all my purple kush up\nDon't make me push and rook up\nGet you touched up, I lift my wrist up, yup, yup\nNow niggas know Lil' Diggs, only twice wore a suit\nHad sex in a group with a couple of bitches dance for loot\nSee I'mma tell them niggas about spendin' all they loot\nPartyin' and trickin' on bitches and don't recoup\nI got my own version of roots\nCracker ass nigga pickin' cotton and polishin' my Brooklyn Zoo boots\nThe new news is Brooklyn Zoo\nSunz and Two On Da Road, Blue, Crazy Cuffie Fam too\n\n[Verse 2: Prodigal Sunn]\nYo, I ain't tryin' to be on no forever broke shit\nSo I made myself eatin' these streets where blood leak\nMe and my whole fleet smoke trees, blow heat, roll unique\nDo or die tactics, and keep us sharp on our feet, meak\nAnd all we do is make classics, CCF, the Unit\nDirt Dog, the Zoo, Ghetto Government, get your ratchet\n95% of them niggas is faggots, and I've had it up to here\nSee our face this year, appear\nOn your TV screen, we stay green\nMoney makes the world go around, know what I mean-ean?\nNew team, fresh and clean clean on your scene\nNow sing along, sing along, y'all know the theme-heme\n\n[Popa Chief {*singing*}]\nNow do or die, do or die, do or die, do or die (aarrgh, wooh)\nNow do or die, do or die, do or die, do or die (oohhh)\n\n[Verse 3: Hell Razah]\nYeah, bitches wanna bone a nigga when your records is sellin'\nLabels don't play a nigga when they nuttin' but felons\nYoung Razah got that hot shit that's under the Heavens\nGG'z poppin' grey goose feathers\nProstitute cheddar, crashin' in whips with new leathers\nBad models be on the dick that shy and strip\nThinkin' we some gangsters, thugs, Bloods or Crips\nWatch who you sleep, shake hands and hustle with\nWhy dream to be rich when I'm already rich?\nTwo bars I spit got the hottest nigga pissed\nChicks kiss the diamonds that twist on our wrist\nBrooklyn Zoo, S.O.M., Dirty Bast' shit, nigga\n\n[Hook]\nDo or die, ball or fly\nLintballz always hangin' around tryin' to get high\nBut fuck sittin' around waitin' on a hook up\nIt's time to turn the heat up\nAnd catch these papes like cooked up\nWhat?\nDo or die, ball or fly\nLintballz always hangin' around tryin' to get high\nBut fuck sittin' around waitin' on a hook up\nIt's time to turn the heat up\nAnd catch these papes like cooked up\nWhat?\n\n[Verse 4: Ol' Dirty Bastard (Buddha Monk)]\nI whip a nigga ass on hand and hand, you get flashed\nWhatever you do, I stop your ass\nMy name is Isis, I kill you with a hiss\nI kill you with my motherfuckin' piss\nA matter of fact you kill yourself, nigga I crash ya stealth\n(See let a nigga come through with that bullshit)\n(Yeah we ain't sayin nuttin')\nI never was familiar with bein' pussy\nI loved that shit 'til it's bloody\n\n[Verse 5: Buddha Monk]\nHey yo hold up, you told me you liked that shit muddy and swampy\nAnd you gonna hit it from where (from the back door)\nThis Fam right here, is the Fam right here\nAnd if you fuck with the Zoo you gon' get clapped right there\nFor this cream nigga, I'll walk through Muddy Waters\nIf he be call out, and rob your son and daughter\nLintballz in my pocket and yours is real lumpy\nNah, Lay Down, gimme what you got G\nSplit the pie three ways, live off it for three days\nAnd when it's done, who's the next victim today\nI'm trife nigga, and I don't live by Bible life\nI yap the nigga ripe then stash a nigga right\nYeah I did wanna do it and the Devil didn't make me\nLinballz in my pocket that made me stick them keys\nCheckmate, pray to the Lord, your soul He take\nThen I hip into the rob for my Fam I just got 'im, nigga\n\n[Hook]\nDo or die, ball or fly\nLintballz always hangin' around tryin' to get high\nBut fuck sittin' around waitin' on a hook up\nIt's time to turn the heat up\nAnd catch these papes like cooked up\nWhat?\nDo or die, ball or fly\nLintballz always hangin' around tryin' to get high\nBut fuck sittin' around waitin' on a hook up\nIt's time to turn the heat up\nAnd catch these papes like cooked up\nWhat?\n\n[Outro: Brooklyn Zoo {Popa Chief}]\nYeah yeah, huh huh (motherfucker)\nThat's right, that's right, OK (alright)\nYeah so {now you be knowin'}\n{Annihilate}\n{Get some papes like Bill Gates}", "image": "https://images.genius.com/8aae5961ee3d6894e7d2abaab7f8fc11.772x768x1.jpg"}], "artist": "Ol’ Dirty Bastard"}