{"songs": [{"title": "Fight Night (Remix)", "album": "Catastrophic 2", "year": "2014-08-07", "lyrics": "[Intro: Takeoff]\nIf you know me know this ain't my feng shui\nCertified everywhere, ain't gotta print my resume\nTalking crazy, I pull up andale\nR.I.P to Nate Dogg, I had to regulate\n\n[Interlude]\nPublic Service Announcement\nWhere all my rich niggas at, man?\nYRN shit, man\nMIGO!\n\n[Chorus: Takeoff]\nBroke niggas stand to the left\nMy rich niggas stand to the right\nLil' mama, she keep looking at me (lil' mama!)\nI'ma knock the pussy out like fight night\nHit it with the left, hit with the right\nI'ma knock the pussy out like fight night\nBeat it with the left, beat it with the right\nI'ma knock the pussy out like fight night\n\n[Verse 1: O.T. Genasis]\nImma knock that pussy out, george foreman\nPut my meat all on the grill, george foreman\nPull up in a new 'rari, george forbes\nShe gon flip, so it's george and four men\nO my god, oh my god, two freaky with a [?]\nShe gon give a nigga head, collage\nHit it in the elevator like Solange\nShe a stripper, so i had to throw cash at her\nLook at what she [?] look back at it\nI just wanna fuck, i dont wanna date\nI ain't trynna save a ho, i ain't want you, kay\n\n[Chorus: Takeoff]\nBroke niggas stand to the left\nMy rich niggas stand to the right\nLil' mama, she keep looking at me (lil' mama!)\nI'ma knock the pussy out like fight night\nHit it with the left, hit with the right\nI'ma knock the pussy out like fight night\nBeat it with the left, beat it with the right\nI'ma knock the pussy out like fight night\n\n[Verse 2: J-Doe]\nNow you know i be standing to the right\nIve been standing on this side for my whole life\nNah, you ain't got nothin on these Ni-KES\nYou ain't met a nigga dressed like ME\nMu'fucker, i pull out your bitch and then i rubber\nAnd then this other bitch was blowing up my phone\nShe been waiting for the dick all night long\nWell that ain't overdue, tell that bitch she got a G holdin' up\nCause money coming and that shit is mo' important\nI told her 'hold up or never click back over'\nHello? what up? can we do it? sho' nuf'\nHow much? okay! mu'fucka I be on my way\nLemme get up to [?] cause i know that's what you want\nBitch you lyin' if you say you don't\nI know what the biz, and i know you know it too\nSo, what you think a nigga like me about to do?\nGo and get it, ho\n\n[Chorus: Takeoff]\nBroke niggas stand to the left\nMy rich niggas stand to the right\nLil' mama, she keep looking at me (lil' mama!)\nI'ma knock the pussy out like fight night\nHit it with the left, hit with the right\nI'ma knock the pussy out like fight night\nBeat it with the left, beat it with the right\nI'ma knock the pussy out like fight night\n\n[Verse 3: Busta Rhymes]\nFirst she tryin to get my shit off\nShawty fucked me like she tryin to rip my dick off\nI couldn't even get my shit off\nShe put it on me like you couldn't even cut a switch off\nShe sucked it like she tryin to tear the skin off\nShe made me beat it till she swollen, now the skin soft\nShe made me eat it till I choked and made the kid cough\nYou know i need it till I drown and even get lost (In it)\nI beat it till she asks a nigga (Wait a minute)\nThen make the tape and have a blast (And she was in it)\nAnd she seen me beat it now she act like (She ain't with it)\nBut she seen this money and now she can't (Touch this midget)\nNow lemme just pull my rocks out\nDiamonds dripping off of me, falling all 'bout\nI dont give a fuck bout what shawty be talkin' 'bout\nI pound the pussy, shawty got knocked the fuck out\n\n[Chorus: Takeoff]\nBroke niggas stand to the left\nMy rich niggas stand to the right\nLil' mama, she keep looking at me (lil' mama!)\nI'ma knock the pussy out like fight night\nHit it with the left, hit with the right\nI'ma knock the pussy out like fight night\nBeat it with the left, beat it with the right\nI'ma knock the pussy out like fight night", "image": "https://images.genius.com/5a10c1c78dc105d8dc7cc9c4229b7d66.220x220x1.jpg"}], "artist": "Busta Rhymes"}