{"songs": [{"title": "Set It Off", "album": "Sucka Free", "year": "2008-04-12", "lyrics": "[Talkin: Nicki Minaj]\nChea, Nicki Minaj\nDirty Money, Young Money\nYo, why the fuck these little bitches always talking shit about what they did and...?\nI don't give a fuck, bitch!\nNicki Lewinsky\nLook (fucker!)\n\n[Verse: 1]\nWhen you was on stage with your brain on drugs\n\"Nick-Nack, Carry Crack\", what my nickname was\nAnd when you was in the hood with bottles of OE\nI was OT, looking real low-key\nI do a striptease if the cops stop me\nA pair of Guess jeans and some beef and broccoli\nI was at the Rucker, I was sippin' on a Smucker's\nI was rockin' hats that was made for the truckers\nThat's when I hopped out the pink on pink\nHate it when a bitch act like her shit don't stink\nSee you was drippin' wet, you was jumpin' in the crowd\nI was in a jet, I was swervin' through a cloud\n\n[Spoken: Nicki Minaj]\nYou know, I'mma put them bitches in a time machine and, and, and, and... send 'em back to the past and shit\nBitches always talking 'bout shit they did and all that\nBitch, get in a time machine!\n\n[Verse: 2]\nTime machine bitches always talkin' about the old days\nWhen they was hot, when they was tourin' with the OJ's\nI tell a bitch this: \"I'm not impressed, bitch\"\nI'm Nicki M, trick, I'm always on the guest list\nI'm on my way to Riker's Island with a couple hard\nI'm on a bike, nine-five-four double R\nAnd they don't write shit, they might write a couple bars\nThat's why they getting drop-dropped, like a couple cars\n(You shouldn't have said that) NY to NO\nLate Night shows, like Letterman and Leno\nEnd, where you cut it, home-slice, your gar-bage\nWhite boys tell me that I rock, like guitars\n\n[Outro: Nicki Minaj]\nSee, see, you see Anna Mae?\nI'm about to slap ya'll bitches 'round and call ya'll Anna Mae\nLike, that, that's what y'all gon' get in a minute, real talk, like\nCause, you know, this is '08 now, like\nSo, anything you talk about, like, it gotta be, it gotta be, at least, within a two-year radius type shit, like\nI don't care what happened 50 years ago, like\nYou know, you know, you know, call-- all bets are off, bitches\nYou know, game just begun", "image": "https://images.genius.com/6723f478cff14a2ba2cbe0ce2ad7d4c2.320x320x1.jpg"}], "artist": "Nicki Minaj"}