{"songs": [{"title": "Cartel Gathering", "album": "The Last Kiss", "year": "2009-04-07", "lyrics": "[Ghostface Killah]\nYo yo yo! Word to ride nigga, yeah\n\n[Verse 1: Ghostface Killah]\nAiyyo we four or five niggas with furs on\nUp top gated up, big tables got the reserves on\nBlowin on saxophones, the band is rough\nSo much ice on looks like my wrist been cut\nAnd we just made it back from Beijing\nSeen my jeweler, told him melt the bird down to eight rings\nAnd the music stopped, Jada stood up (yeah)\nBefore the speech, he had everybody raise they cups\nHe said, I been in spots where I can't even mention it\n\"Don't drink the Cris', Ghost mighta pissed in it!\"\nRomanian dude, black down, pourin the saki\nFace slumped to the side like Rocky\nThen Strahan came through, with his bullshit ring\nHe said YIKES, when I pulled out my monster bling\nDon't be afraid of the New York street talk\nI switch gear all day bro, like you do on your peach porch\nThe chairs is suede, the walls is velvet\nMarquise ballroom, so live I felt it\nFat asses in fishnets, shakin they pelvis\nPlayin with they pussy, middle finger drippin, I smelt it\nPoker tables, crap joints just for rap niggas\nMe and Sheek, walkin around bitch-slappin niggas\nThere go Rae, there go P\nYo Chop whattup! Whattup?\n\n[Verse 2: Raekwon]\nSam Cooke writin hand, all of my lightning, damn\nUsed to rob niggas in Sam's, buy shams\nFor my dude's baby shoe or booster baby, rollin with steel\nEatin Jamaican food under the wheel\nYou know the deal, book somethin then blow\nWhen from a O to a low, little apartment in Brookdale\nGold was my motto, lotto numbers is what?\nHad it in me, rolled down coolin with coke\nThat's the 90's, Chef era take over America\nBag Ugly Betty up, make her Ms. Guerrera\nPinky wench in sweaters, cortex burnin the mic booth\nTravel right past my heritage\nThem old school niggas is me\nTaught me how to read, get skee'd, everybody missin a ki\nYo I do this with a natural movement\nCatch me by the munition (aha!)​, scope on me, fuck it I'm losin' it\n\n[Verse 3: Jadakiss]\nAH-HAHHHH! Uh, yeah, yo\nI did it my way, lights off on the highway\nGreek statues on both sides of the driveway\nWord to the stamps on the diesel\nThe way these niggas is lookin either they got cramps or they evil\nOne go we all go, D-boy fresh but hard dough\nCashmere and suede cargoes\nOn top of the beige Wallo's\n45 government edition clippers, straight hollows\nMy Clientele is Supreme and it's proven\nThat I'm Only Built 4 the Link if it's Cuban\nI'm a pioneer, I'm not a vet (uh-uh)\n\"Last Kiss\" is a French one, it's not a peck (uh-uh)\nMovin powder, piff and a lot of wet\nYou're gonna die, that's a promise, not a threat\nYeah, but I ain't with the chatterin\nCause I'd just rather splatter them\nThis is a Cartel gatherin, what?", "image": "https://images.genius.com/889156c9fce6e4ea8b79e5e476d47cb1.953x953x1.jpg"}], "artist": "Jadakiss"}