{"songs": [{"title": "Everything’s Good (Good Ass Outro)", "album": "Acid Rap", "year": "2013-04-30", "lyrics": "[Produced by Cam]\n\n[Making the Beat]\n\n[Intro: Ken & Chance the Rapper]\nWell I should have you hooked up next week\n\nIt's all good or whatever, I can wait 'til my birthday. I uh-\n\nNo, no, no, no. I told ya, I know you need it now, so next week I promise you I'll have you hooked up, ok?\n\nOh, alright. I just wanted to say thank you for, uh, everything. For the, the computer, the t-shirts, and all the other stuff\nYou know, Chance. Let me tell you something. You know, I could never be more proud of anything in my life, you know, than I am of you and what you've done. Chance, you have done remarkable and wondrous things, so you don't have to tell me thank you for anything. I'm supposed to do this, that stuff for you anyway, and ya know, just keep doing what you're doing. I am very, very proud of you. Just keep doing what you're doing, okay?\n\nThank you, love you\n\nAlright, son. Love you too, take care\n\nAlright, bye-bye\nThanks for coming guys\n\n[Verse]\n'Member sittin' in class the first time listening to Dilla\nEverything's good\nRubbin' on yo chin, sippin gin, Margiela brand chinchilla\nEverything's good\nMy manager backpack packed with packs of cigarillos\nAnd some fruit snacks, and some killers\nPhone numbers on speed dial, call them, save monkey guerillas\nEverything's good\nI ain't really that good at goodbyes\nI ain't really that bad at leaving\nI ain't really always been a good guy, I used to be thirsty thievin'\nRunnin through purses, even persons leave 'em hurtin', bleedin'\nI ain't really help the helpless\nI used to be worse than worthless\nNow I'm worth hooks and verses\nI'm good like books in churches\nHarolds and Hooks and Churches\nEverything's good\nSee my name when you Google search it\nUse a card when I make a purchase\nEverything's good\nBut I knew I was fly when I was just a caterpillar\nThat I'd make it even if I never make a milla\nWhen I meet my maker he gon' make sure that we chillin'\nAnd everything's good\nI ain't really that good at goodnight, I ain't really that bad at sleepin'\nWith bad bitches, put 'em aside, I used to be thirsty creeping\nNow I'm out working evenings, birthdays, even Tuesdays\nWednesdays, Thursdays, weekends, rehearsing verses, murdering merch and events\nDamn it feel good to be a gangsta\nAnd it feel good for me to thank you\nPut money back in your bank account\nOff of songs I barely could think up\n'Cause a lot of songs niggas gon' make up\nMake sense, but they never gon' make a sound\nAnd I'm better than I was the last time, crescendo\nThanks Justin, lending them pencils\nMr. Menzies, Mensa, Chris Minto\nThe time I beat Chris on Nintendo\nNa-na-na, hey, hey, good intro\nRemember jacket shoppin' after listening to Thriller\nRemember the first time you heard this through and thought, \"Damn that's that nigga\"\nEverything's good\n\n[Outro]", "image": "https://images.genius.com/aa16cba40f43828a61bbb6212de712bd.750x750x1.jpg"}], "artist": "Chance the Rapper"}