{"songs": [{"title": "Poison Bananas", "album": "You Know What it Is Volume 3", "year": "2005-06-19", "lyrics": "P-p-p-p Unit\nYou pussy ass nigga!\nP-p-p-p Unit\nYou pussy ass nigga!\nP-p-p-p Unit\nYou pussy ass nigga!\n\nWho the snitch?\nYou the snitch\nWho the bitch?\nYou the bitch (x4)\n\nLook, get ya mask took off\nWhen I blast four off\nPump the shotty\nThrow your body\nWhere the grass grow tall\nJeah, I'm like tango for the cash\nOrange Jag\nLooking like a mango when it pass\nWith the tato on the mack\nI ain't talking 'bout bagging up work when I put Yayo in the bag\nFuck is you rhyming about?\nYou 30, just getting in the game, you should be trying to get out\nYou it's drama when the llama get out\nPull and spit the lead\nBullets hit your head\nThen your mind'll sit out\nBy the time they find this shit out\nI'm in a different state\nIn a different zip, different whip, different plates\nWait! I put the heater to your head\nYou G Unit Ninja Turtles cause your leader is rat\nScrat!\nIt's simple as 1,2,3\nYou lames\nWanna get at Game\nYou gotta come through me\n\nTony Yayo\nGet out the way ho\nLloyd Banks just got shot\nTechnique pass the mack\nAnd aim it at Curtis Jack\nYou ain't right\nTrying to be Frank White\nYou getting smacked\nLittle accident murderer\nI just now heard of ya\nAnd the next time you disrespect the west, E serving ya\nYayo\nYou better lay low\nCause the M.O.B. got some killers on the payroll\nI put a million dollar hit on you snitches\nShow you why we call ourselves Money Over Bitches\n\n(Chorus)\nI got a clip full of poison bananas\nAnd some cold hard killers from Compton (here monkey, monkey)\nI got a clip full of poison bananas\nAnd a cold hard killer from Philly (here monkey, monkey)\nI got a clip full of poison bananas\nAnd a cold hard killer from Long Beach (here monkey, monkey)\nI got a clip full of poison bananas\nAnd a cold hard killer from L.A. (here monkey, monkey)\n\nOlivia, get back in the car\n'Fore I smack you like 50 did Fredo Starr\nAnd he picking on lil niggas\nIs it me or is it every video, Curtis Jackson get a lil bigger?\nNigga using that muscle enhancement\nAll I need is a couple dumbells and a sandwich\nFuck holding a conference\nI'll run to Violator, hold Chris Lighty for hostage\nCause Banks doing gay porn, come out the closet!\nEither that or I'mma knock Chris Lighty unconsciencious\nCut all the non-sense\nYou was PC'd up\nHit the bricks, rapping 'bout the corner like you Common\nTalk of New York? You Jorge Pasada\nI throw 'em, you catch 'em, that's not a threat, that's a promise\nYou did 6 months, now you a convict?\nI accepted your phones calls now you got me on some wild shit\nJudge said, \"Time spent\"\nNow you can get it from the same gun homicide dropped five dimes with\nAnd next time you try to kiss me on the cheek\nYou won't be alive long enough to put out my heat\n\n(Chorus)\n\nWelcome to the west, let me show you what hood like\nMy niggas down to sit on death row and ain't fucking with Suge Knight\nTag your left toes, wish you niggas a good night\nRock-a-by baby\nChrome .380\nScreaming, \"Ready to die\"\nThem niggas ain't crazy\nOn the black wall on the mini street that they can't be\nA pine box plenty of leg room\nGame, hit me, we're watching X's rented in Cancun\nI'm look at the two like, \"The nerve of this damn dude\"\nPointing a beam at him, locating his next wound\nTalk to my heat\nChi-Chi get the Yayo\nReplace that G Unit bandana with a halo\n\n(Chorus)", "image": "https://images.genius.com/94aac16d9845daeefdcaedcb5eeb289b.360x360x1.jpg"}], "artist": "The Game"}