{"songs": [{"title": "Nasty Mind", "album": "Devils Night", "year": "2001-06-19", "lyrics": "[Intro]\n{​*girl giggling*}​ Stop!\nYou want me to do what? What are those?\nYou want me to stick those in your what?\n{​*Bizarre laughing*}​\n\n[Chorus: Bizarre (Truth Hurts)]\nWhat is on your nasty mind? (nasty mind, nasty mind)\nDon't you wanna get fucked from behind? (from behind, from behind)\nThen treat me like a dirty slave (dirty slave, dirty slave)\nAnd beat me like I won't behave - I just wanna get freaky, baby!\n\n[Verse 1: Swift]\nI'm too Swift on my toes to get caught up with you hoes\nYou don't know me, see I ain't gotta front or play the role\nI'm a KNOW-G, I KNOW when you being phony\nSee, you probably boning them officers just to pull up on me\nThat's why sixty percent of women is lonely\nThey get in my mix only, then try to creep slowly because they nosy\nI ain't listen to what, my momma told me\nI fuck them and pass to my homies (right)\nThen he fuck them and pass them to the homies (take her)\nI'm a nasty-ass macaroni; you flashing fast money\nYou can pass a Roley, FUCK a alimony\nIf you want me, and ain't out screaming about your monthly\nI'll be sticking your pretty ass until you turn ugly (damn!)\nYou suddenly see stars when fucking me\nAin't no menages, I want 'em in threes, release your garments (trick)\nIt ain't even me to hold back, I fucked your mom quick\nHave her running around this bitch screaming \"That's my dick!\"\n\n[Verse 2: Kuniva]\nYo, I know I'm dogmatic, but your pussy walls done had it (that's right)\nIt's evident that you've been fucking like a jackrabbit\nBut I stay focused, so I acted like I didn't notice (mm-hmm)\nAnd fucked her with no baby lotion and bust in the soapdish\nHo, you can quote this - your breath is smelling like\nYou done sucked a senior citizen's old dick in goat spit (god damn!)\nYou gon' get choked quick, talking all that ho shit\nAll aggressive asking for a slow kiss, no bitch! (the fuck outta here)\nYou like freaking, see you every night creeping\nSucking off the nice deacons, slut you made his wife leave him (cunt)\nSo keep slurping I'll be down to the fullest\nBut forget it bitch, your nipples look like AK bullets\n\n[Chorus: Bizarre (Truth Hurts)]\nWhat is on your nasty mind? (nasty mind, nasty mind)\nDon't you wanna get fucked from behind? (from behind, from behind)\nThen treat me like a dirty slave (dirty slave, dirty slave)\nAnd beat me like I won't behave - I just wanna get freaky, baby!\n\n[Verse 3: Kon Artis]\nI'm tearing down whatever you built, your marriage is through\nCause I answered your wife's door naked wrapped in a quilt\nHoes say \"Kon Artis got a dick so big!\"\nMan, I can persuade any bitch to have eight of my kids, shit\nBitch, I should be locked up for having honeys' legs cocked up\nIn the back of my pops truck\nI'm not fucked up, I just got a fetish for shooting\nCum in coochie till the pussy is pooting it back out\nI 69'ed this one bitch and she bled in my mouth (shit)\nKicked her out, cleaned the couch out, and beat up my crouch\nI don't gotta creep in hotels, I cheat at my house\nSee I'm a dog, I don't need to keep a secret hideout (nahh)\n\n[Verse 4: Bizarre]\nAll night I've been snorting {​*sniffs*}​\nYour age and where you from - it's just not important (nahh)\nYou look like one of my mistresses\nOn welfare, ten kids like the rest of my bitches\nDreams of fucking a handicapped bitch\nSuck my dick while your teeth start to grit (whore)\nAnd a slave, that's how I want you to treat me\nI ain't into S&M, but I love when you beat me (ahhh!)\nI told you I was a horny-ass freak\nWhile I'm beating my meat, your daughter acting like she asleep (yeah right)\nMy love is like thunder and lightning\nAfter it's over, I'm looking like I got my ass kicked by Tyson\n\n[Chorus: Bizarre (Truth Hurts)]\nWhat is on your nasty mind? (nasty mind, nasty mind)\nDon't you wanna get fucked from behind? (from behind, from behind)\nThen treat me like a dirty slave (dirty slave, dirty slave)\nAnd beat me like I won't behave - I just wanna get freaky, baby!\n\n[Outro: Bizarre]\nI just wanna get freaky, baby!\nI just wanna get freaky, baby!\nI just wanna get freaky, baby!\nI just wanna get freaky, baby!\nFreaky baby, he he\nI wanna get freaky with you\nD12... in your area\nAnd remember, if you looking for Bizarre\nDial 1-900-BEAT-ME", "image": "https://images.genius.com/591360993ef93e1c0a2402279fb90319.600x600x1.jpg"}], "artist": "D12"}