{"songs": [{"title": "Gunnen’ Em Down", "album": "Kristyles", "year": null, "lyrics": "[KRS-One]\nUh-huh!  Y'all forgot about this shit right?  Haha\nHaha, TURN THE RADIO OFF!!\nWord!  Yeah, whattup Choco?  Haha\nYo turn it around for me one time\nUhh, uhh, yo\n\n[Verse One]\nI don't despise thugs, I +ADVISE+ thugs\nI teach y'all thugs, cause that's what I was\nYeah I say was cause today I'm above\nAll the guns, illegal funds, the crews and the drugs\nANY HOOD I walk in, they show me love\nThey say 'Knowledge Reigns Supreme, WHATTUP CUZ?'\nCops wanna get sit down and get all bud\nThey wanna think as they drink drink down to the suds\nI respect it, but I don't get down with the fuzz\nI don't drink with DT's I don't hang with the judge\nBut truth be truth and I got the proof\nMost ministers were straight thugged out in they youth\nSee if you're over 25 and you never got live\nWhen it was time to ride, you ain't got no heart\nBut if you're over 26 and you're still in the mix\nAnd your life you ain't fixed, you ain't doin your part\nYou see them cats on TV, playin the role?\nGassin y'all, them cats be over thirty years old!\nActin all dirty and cold\nNONE OF MY CLASSIC ALBUMS they was worthy to hold\nI'm concerned with the soul, overstand?\nWhen we was slappin up rappers they was doin the running man\nYou don't know my style, we be straight gunnin man\nIf you don't know you better ask your older brother man\nShit gets realer than, Real TV\nFrom eighty-six, ain't no rapper realer than me\nOr Just-Ice, I.C.U. or Steady B\nWhat y'all waitin to see?  Somethin faker than me?\nDon't let me have to pull out the Jamaican in me\nI'd rather pull out the as-salamu alaykum in me\nWa-alaikum salaam, yo you wan' tess de Don?\nBLAOW BLAOW BLAOW-BLOAW-BLAOW, bwoy gone!\n\n[Hook]\nThey don't really wanna learn - well start gunnin 'em down!\nYo they really ain't concerned - well start gunnin 'em down!\nThey don't wanna get the book - well start gunnin 'em down!\nThey don't want a conscious hook - well start gunnin 'em down!\nThey don't wanna pay dues - well start gunnin 'em down!\nThey be actin brand new - well start gunnin 'em down!\nThey don't wanna get the light - well start gunnin 'em down!\nYo, pass me the mic - we'll start gunnin 'em down!\n\n[Verse Two]\nWatch dis!  Your crew is my crew and my crew is my crew\nYour crew you lied to, my crew will find you\nThe light I recite will blind and outshine you\nStreet cats be wonderin why they even signed you\nWhere they find you?  WHO is the first cat to rap\n\"wa-da-da-ding\" and show you what the nine do?\nYou ain't never seen me behave with them firearms\nMaybe not, cause you just a slave to Viacom\nMe, I'm a free MC hip-hopper\nI teach real gangsters, hang with real Godsters\nI am to hip-hop what Selassie is to rastas\nWatch your mouth before someone I don't know pops ya\nLemme stop, don't-a-stop the street rhetorhic, ha\nYour soul you sellin it ha, come wit some better shit, ha\nIn five years your whole catalogue's irrelevant ha\nYou spit the ignorance while I spit intelligence\nYou got it backwards like sayin hop-hip\nThat's why when you battled your whole crew got ripped!\n\n{*needle drags across record*} You wanna battle?\n\n[Hook]", "image": "https://images.genius.com/2333a9607025ac4cc5a6777157dbce5f.220x220x1.jpg"}], "artist": "KRS-One"}