{"songs": [{"title": "187um (Deep Cover Remix)", "album": "One Million Strong ", "year": "1992-04-09", "lyrics": "[Verse 1: Dr. Dre]\nNiggas that I used to know and sold dope wit'\nListen to how a motherfucker flow shit\nAnd let me know it's somethin' they can blast on\nThinkin' about the homies that passed on\nDeath Row come to show you where all the game at\nAnd show you how my label got the name that\nSo many wanna see me in, time is money\nBut never in the P-E-N, yo\nWelcome back to Vietnam, California\nAin't a damn thing changed, so let me warn ya\nEvery motherfuckin minute you on the Westside\nThe best side, 20 niggas done just died\nWalkin' down the streets of L.A\nStay strapped 'cause niggas bust caps every day, yo\nThe 1-8-7 don't stop\nOn undercover cops up on the spot gettin' popped, shot\nDroppin' like this and like that\nRat-tat-tat-tat with their caps peelin' back\nSo creep when you in the C-P-T\nYou catch heat for fuckin' with' the D-R-E\nI got my eyes on the shit unfoldin'\nAnd there ain't gonna be no trippin'\n'Cause they know the type of shit that I be holdin'\nIf there's another word said\nI'll let my .44 go buck to the head, nigga\n\n[Hook: Dr. Dre & Snoop Dogg]\nYeah, and you don't stop\n'Cause it's 1-8-7 on an undercover cop\nYeah, and you don't stop\n'Cause it's 1-8-7 on an undercover cop\n\n[Verse 2: Snoop Dogg]\n3 and to the 2 and 2 and to the 1\nHead away, sent away, get away, Snoop's got a gun\nAnd he's lookin' for the cops who set him up in '86\nNow it's time to put they ass in the mix\nBack on the streets with my khakis and my stars\nNuts full of cavi and I'm headed for the bar\nScared than a muthafucka, 'cause I'm fresh out\nBut I gots to make my green, and plus they all fiend\nFollow me, they keep yellin' murder, but it won't stop\nUntil the last nigga that you know drop\nAnother nigga out, but I doubt\nThat you really give a fuck what it's about\nNow, 99 pigs on a block with me\nNot a muthafuckin' cop wanna knock with me\nA C-O-N-V-I-C-T\nThe motherfuckin' D-O-G, comin' from the L-B-C\nLook at what the Doc brought in\nA chrome .38, a .44 mag, and Mac 10\nSo what you wanna do? (What you wanna do?)\nI got the gauge, a Uzi and my mothafuckin' .22\nSo if you wanna blast, nigga we can buck 'em\nIf we stick 'em then we stuck 'em so fuck 'em!\n\n[Hook]\nYeah, and you don't stop\n'Cause it's 1-8-7 on an undercover cop\nYeah, and you don't stop\n'Cause it's 1-8-7 on an undercover cop\n\n[Verse 3: Snoop Dogg & Dr. Dre]\nSplat to a motherfucker face, he fall\nStrong muthafucka 'cause he starts to crawl\nI guess I gots to load the Glock again\nHit 'im with the hollow points and watch him spin\nFuck it, I had to do this quick\nGrabbed the Glock 17, the clip went click\nTried to detect, but did not detect perfect\nSo I creep on that ass, pops him and drops him\nThat ought to stop from beatin' up blacks\nDead in his tracks, from a full six pack\nRelax, 'cause I'm about to take my respect\nI aimed the 12 gauge straight for his neck\nBoo-yaa! Boo-yaa! then I fade into the wind\n1-8-7 and it's on again\nWell it's on, and it's on, and it's on, and it's on\nFo'-fo' Desert Eagle to your motherfuckin' dome\nAnd it's on, and it's on, and it's on, and it's on\nFo'-fo' Desert Eagle to your motherfuckin' dome\nFuck 'em, buck 'em, if they really wanna trip\nNiggas keep your hands on your motherfuckin' shit\n\n[Hook 3X]\nYeah, and you don't stop\n'Cause it's 1-8-7 on an undercover cop\nYeah, and you don't stop\n'Cause it's 1-8-7 on an undercover cop", "image": "https://images.genius.com/0a946216c217589668d59e63303e5229.500x495x1.jpg"}], "artist": "Dr. Dre"}