{"songs": [{"title": "Spend Some Time", "album": "Encore", "year": "2004-11-12", "lyrics": "[Intro: Eminem]\nIf there's any bitches in this room\nThen there's somethin' I gotta say (say)\nFor all the fools who fell for the first girl who comes their way\nI've been down that road\nAnd now I'm back, sittin' on square one\nTryin' to pick myself up where I started from\n\n[Verse 1: Obie Trice]\nI never would've thought that I'd see you out of control\nEven though my penis was deep down in your hole\nYou should know, between us we was like mates of soul\nNothin' could intervene us, especially no hoes\nYou was more so the chalant type I chose\n'Til more shows, haunted you nights, I suppose\nThat's how it go: with time spent, emotion grows\nIn the beginning friends, we decided to roll\nSo who's responsible when you get excited, explode\nAnd Obie's grinnin', then you invite that Obie's cold?\nBut bitches, they gon' talk; niggas, they gon' hate\nWe established this way before we became mates\nSo what's required is that you chill with all that fire\nGet your desire when I retire, and—\n\n[Hook: Dina Rae & Eminem]\nSpend some time with me, say that you'll be mine (Ha-ha)\nI never thought I'd find someone to be mine\nLord knows I was right, ‘cause you just crossed the line\nSpend some time with me, say that you'll be mine\n\n[Verse 2: Eminem]\nI used to say I never met a girl like you before\nStill ain't got a fuckin' clue as to who you truly are\nAlmost went as far as introducin' you to my daughters\n'Til you went as far as goin' and snoopin' through my drawers\nNow I just feel stupid for the loop that you threw me for\nCan't believe I almost flew the coop for some stupid whore\nYou used to say all you wanted was for me to be yours\nAll I ever wanted from you was a few booty calls\nIf you recall, I used to treat you like a groupie broad\nWhen we fucked I refused to even take my jewelry off\nBut it threw me off the first time I called and you blew me off\nIt was a shock, it struck me as odd, but it turned me on\nYou started gettin' moody on me, pretty soon we'd argue\nAnd the ruder you got, the more beautiful you got to me\nAnd who'da even knew that? Who woulda even thought possibly\nCupid could shoot another one of them goddamn darts at me?\nIt's true that I got shot in the heart, but when someone seems\nToo good to be true, they usually are, but see\nWhen you're in it, it's too hard to see\n'Til you pull up and see some other dude's car parked and reach\nUp under the seat as your heart starts to beat\nBefore you make a decision that's life-altering\nAnd just as you halt and you turn and you start to leave\nYou hear them words echoing, almost haunting, that taunting ring\n\n[Hook: Dina Rae & Eminem]\nSpend some time with me, say that you'll be mine (Ha-ha)\nI never thought I'd find someone to be mine\nLord knows I was right, ‘cause you just crossed the line\nSpend some time with me, say that you'll be mine (Ha-ha)\n\n[Interlude: Stat Quo]\nHa ha, yeah right, bitch\nSpend some time on my dick\n\n[Verse 3: Stat Quo]\nIn most cases, Stat's attitude is \"Fuck a bitch!\" (Fuck a bitch!)\nMy only motive is to get head and fuck a bitch (Fuck a bitch!)\nBut you was different, thought we shared a covenant\nEven held your hand in pub-a-lic\nWe sufferin' because of this (Because of this)\nShawty on some whole 'nother other shit (Other shit)\nTryin' to play slick, thinkin' I'ma trick off grip\nI'll admit, I was caught in the mix, down to commit\nFeedin' you the best of me, I should've fed you piss (Should've fed you piss)\nWe started off closer than close\nBut who could've predicted to know\nYour trifling ways woulda stopped our growth?\nAnd the final result, back in that same boat\nI asked myself: \"Do I love these hoes?\" — Nope!\n\n[Verse 4: 50 Cent]\n(Yeah) Em introduced us: \"50, this is Tanya. Tanya, this is 50.\"\nThen slid off and left her to kick it with me\nI complimented her, I said, \"You have very nice lips.\"\nWith my imagination, I could see her suckin' my dick\nWe played the phone game, a week later, shit changed fast\nHad her comin' over in a cab to give me some ass\nDowntown Manhattan, on the balcony, stare at the skyline\nPenthouse full of imported shit, you know how I grind\nShe got to talkin', talkin' like an opportunist, too\nWhy talk when suckin' my dick is the real career move?\nSaid she's an aspiring actress, she do videos for practice\nYeah, yeah, know how many times I done heard that shit?\nHa-ha\n\n[Hook: Dina Rae & Eminem]\nSpend some time with me, say that you'll be mine\nI never thought I'd find someone to be mine\nLord knows I was right, ‘cause you just crossed the line\nSpend some time with me, say that you'll be mine", "image": "https://images.genius.com/e76120b9dd2c0af6f1b3f8d3dcbe11d2.1000x1000x1.jpg"}], "artist": "Eminem"}