{"songs": [{"title": "LIFE WE CHOSE", "album": null, "year": null, "lyrics": "[VERSE 1]\nCowards plottin on me, got my goons do rocking for me\nDidn't take it cause they know I keep they bitches just excite and horny\nI'm that nigga end of story, survive the fame and glory\nTray, this shit I been through mostly got nigga call it quits\nAnd I remain the same, values never changed up\nI can look inside the mirror every time I wake up\nWhile they be shouting up a life they make up\nWe gon do better things, cause this what life made us\n\nHow many g's you know surviving here to tell the story\nGo on i've this thing come back to make history\nWe popping off for niggas and give a fuck\nAnd keep a thing on me, clapping at these niggas like remember us\nIt's just a matter time, before you cope like barb wire\nSpit the flames on this mic start a bonfire\nSo sit around, and hear the words that I speak\nAnd this a blessing, I ain't chose this life, it chose me\n\n[Hook]\nThis the life we chose, dealing with the life we chose\nIt's a cold world, homie, and it's only getting colder\nMotherfuckers get their whole life froze!\nThis the life we chose, dealing with the life we chose\nIt's a cold world, homie, and it's only getting colder\nMotherfuckers get their whole life froze!\nThis the life we chose, dealing with the life we chose\nIt's a cold world, homie, and it's only getting colder\nMotherfuckers get their whole life froze!\nThis the life we chose, dealing with the life we chose\nIt's a cold world, homie, and it's only getting colder\nMotherfuckers get their whole life froze!\n\n[VERSE 2]\nNigga 2013, mob life, know what I mean\nI rather go back to prison than let a nigga stop me\nI rather burn in hell than let a nigga slide\nPut that on my mama that somebody gon die\nThey just jelly cause my voice got her panties all wet up\nIn h class, teach they bitches how to fuck better\nWe the best shit in the world, we just a wordy down version\nYou got here with your corny ass version\nLet me guess I'm rappin your life and you that real deal huh\nI can't come to the hood, unless I get permission from\nLet me tell you something, little closer I could show you\nHow to get away with bodies on that pistola\nYou wanna be dope forever but you never will\nI got that permanent shine, yeah sun never chill\nNon stop fire, god damn I'm so cold\nNothing I can do about it, I will never go broke\n\n[Hook] x 2\nThis the life we chose, dealing with the life we chose\nIt's a cold world, homie, and it's only getting colder\nMotherfuckers get their whole life froze!\nThis the life we chose, dealing with the life we chose\nIt's a cold world, homie, and it's only getting colder\nMotherfuckers get their whole life froze!\nThis the life we chose, dealing with the life we chose\nIt's a cold world, homie, and it's only getting colder\nMotherfuckers get their whole life froze!\nThis the life we chose, dealing with the life we chose\nIt's a cold world, homie, and it's only getting colder\nMotherfuckers get their whole life froze!", "image": "https://images.genius.com/42d069fe8357b9423abc0b46d79ba08d.398x398x1.jpg"}], "artist": "Mobb Deep"}