{"songs": [{"title": "Letting Go", "album": "Lasers", "year": "2011-03-08", "lyrics": "[Instrumental and Percussion Intro]\n\n[Hook: Lupe Fiasco]\nThings are getting outta control\nFeels like I'm running out of soul (oh, woah oh, oh...)\nYou are getting heavy to hold\nThink I'll be letting you go (oh, woah, oh, oh...)\n\n[Verse 1: Lupe Fiasco]\nMy self portrait shows a man that the wealth tortured\nSelf-absorbed with his own self-forfeit\nA shelf full of awards\nWorshiping the war ships that set sail on my sea of life\nWhen I see my old self I wonder if we still see alike\nWe was tight seeing lights, speaking right and breathing life\nNow I see my demons and barely even sleep at night\nI don't get high. Life keep me at a decent height\nAs the old me I predicted all my recent plights\nExhausted, trying to fall asleep. Lost inside my recent fights\nBurdens on my shoulders now, burnin' all my motives down\nInspiration drying up, motivation slowing down\n\n[Hook: Lupe Fiasco]\nThings are getting outta control\nFeels like I'm running out of soul (oh, woah oh, oh...)\nYou are getting heavy to hold\nThink I'll be letting you go (oh, woah, oh, oh...)\n\n[Verse 2: Lupe Fiasco]\nI'm begging me don't let me go, we vow like the letter \"O\"\nTo never go our separate ways and spin-off into separate shows\nTired of all the wardrobe changin', playing all these extra roles\nFilled with all these different spirits, livin' off these separate souls\nPoint in life is getting hollow, can't wait for the exit hole\nGive me room the entry wound. Let me in and let me go\nSo I can roam around this wilderness\nSee it for what it really is, unprepared and filterless\nMagnify the youth in me, alibi the shootin' spree\nAmplify the revolution, sanitize the lunacy\nStrip away the justice, justify the scrutiny\nI can see the lasers shootin' out of you and me\n\n[Hook: Lupe Fiasco]\nThings are getting outta control\nFeels like I'm running out of soul (oh, woah oh, oh...)\nYou are getting heavy to hold\nThink I'll be letting you go (oh, woah, oh, oh...)\n\n[Bridge: Lupe Fiasco]\nSometimes I feel like the world—\nSometimes I feel like the world is against me\nAnd everything that I've done before\nI swear we used to be so pure\nBut we can't be in love no more\nCause I don't wanna fight this war\nBut when I put down my gun\nI turn around and pick up one\nThis Uzi weighs a ton, but I think I'm done!\n\n[Hook: Lupe Fiasco]\nThings are getting outta control\nFeels like I'm running out of soul (oh, woah oh, oh...)\nYou are getting heavy to hold\nThink I'll be letting you go (oh, woah, oh, oh...)\n\n[Outro: Sarah Green]\nThink I'll be letting you go\nThings are getting outta control\nSaid, it feels like I'm running out of soul\nYou're getting heavy to hold\nI think I'll be letting you go\nLetting you go", "image": "https://images.genius.com/176f3f314073903c9b8b8c86069308f1.320x320x1.jpg"}], "artist": "Lupe Fiasco"}