{"songs": [{"title": "Raw Hide", "album": "Return to the 36 Chambers: The Dirty Version", "year": "1995-03-28", "lyrics": "[Intro: Ol' Dirty Bastard + (some Caribbean woman)]\nYeah! I wanna let all y'all niggas know in here tonight\nThat this is that Wu-Tang shit\nThis that shit that's gonna get you high\nSee when you stimulate your own mind for one common cause\nYou see who's the real motherfuckers\nSee what you see is you what you see\n(You nuh see it? Wu-Tang a-run tings!)\nBe the original G\nRhymin' on timin' in the place to be\n(Run blood claat tings!)\nLadies love seein' me!\n\n[Verse 1: Ol' Dirty Bastard]\nYou're a crossbreed, I'm a knowledge seed\nI want action! That's what I need\nI never put doubt on my mind\n'Cause I know when I touch the mic it's the rhyme\nSee murder which is caused\nWhen you fuck with the negative and positive charge\nThen they came up out my garage\nWith the hit that's gonna be large\nTired of sittin' on my fuckin ass\nNiggas I know be runnin' around with mad fuckin' cash\nWho the fuck wanna be an emcee\nIf you can't get paid to be a fuckin' emcee?\nI came out my momma pussy, I'm on welfare\nTwenty-six years old – still on welfare\nSo I gotta get paid fully\nWhether it's truthfully or untruthfully\nWith my Boston bloodthirsty posse\nP-E-A-C-E\n\n[Chorus: Method Man]\nMove 'em in, move 'em in\nMove 'em out, move 'em out\nStick it up {*whip sound*} raw hide!\n\n[Verse 2: Ol' Dirty Bastard]\nYeah, gotta come back to attack\nKillin' niggas who said they got stacks, 'cause I don't give a fuck\n{*inhales*} I wanna see blood, whether it's period blood\nOr bustin' your fuckin face some blood!!\nI'm goin' out my fuckin' mind!\nEverytime I get around devils {*breathing hard*}\nLet me calm down, you niggas better start runnin'\n'Cause I'm comin', I'm dope like fuckin' heroin\nWu-Tang Bloodkin, a goblin, who come tough like lambskin\nImagine, gettin' shot up with Ol' Dirty insulin {*sucks air*}\nYou bound to catch AIDS or somethin'\nNot sayin I got it, but nigga if I got it you got it!!\nWhat!?\n\n[Verse 3: Raekwon the Chef]\nYo, check the bulletproof fly shit, strong like Thai Stick\nThen I'll remain to tear your frame while I freaks it\nLike some fly new sneaks and shit\nNow eat my shit, bitch tried to creep and got hit\nNow regulate, and I'll be out to set up a date\nWu-Tang is bangin' like a Ron G tape\nRZA pump the shit just like a shotty\nWatch me run it like John Gotti\nCollidin' on the track like gin and watty\nCheck the calendar, I warn any challenger\nTo step up {*whoosh*} feel the blast from the silencer\n\n[Chorus: Method Man]\nMove 'em in, move 'em in\nMove 'em out, move 'em out\nStick it up {*whip sound*} raw hide!\n\n[Verse 4: Method Man]\nComin' soon to a theatre near you it be the Wu\nYeah, find yourself in the square and see it's true\nActual facts to snack on and chew\nMy positive energy sounds peace to you\nA wise man killed one horse and made glue\nWicked women puttin' period blood in stew\nDon't that make the stew witches brew?\nI fear for the eighty-five that don't got a clue\nHow could he know what the fuck he never knew?\nGod-Cypher-Divine come to show and come to prove\nA mystery god that's the work of Yacub\nThe Holy Ghost got you scared to death kid boo!!\n\n[Outro: Ol' Dirty Bastard]\nYeah, we always gotta keep it fly\nFly for you to feel what you wants to feel\nSee Wu-Tang'd like to thank, all the people across the country\nAll the people in America, all the people outside of America\nFor listenin' to our music\nWe gotta keep it fly for ya!\nSee this ain't somethin' new\nThat's just gonna come out of nowhere, no!\nThis is somethin' old! And dirty!\nAnd dirty!\nYeah", "image": "https://images.genius.com/7985ae9f777e769efe184aff8b763e1c.1000x1000x1.jpg"}], "artist": "Ol’ Dirty Bastard"}