{"songs": [{"title": "FOR MY PEOPLE", "album": "ALL-AMERIKKKAN BADA$$", "year": "2017-04-07", "lyrics": "[Intro]\nYou know, yeah\nAlways wanted to have super powers\nYou know, uh\n\n[Chorus]\nThis for my people, tryna stay alive and just stay peaceful\nSo hard to survive a world so lethal\nWho will take a stand and be our hero, of my people, yeah?\nThis for my people\nTryna stay alive and just stay peaceful\nSo hard to survive a world so lethal\nWho will take a stand and be our hero?\n\n[Verse 1]\nUh, now all heroes don't wear capes\nAnd all villains don’t get away\nBut all limits eventually fade\nI don't wanna be good, nigga, I'm tryna be great\nIt’s hard when your back's against the wall\nAnd if you got it all to keep your feet up on the floor\nSo I thank the Lord when I wake up in the morn'\n'Cause to inform the world the very reason I was born\nYou can see the power when the mic is in my palm\nWhen I storm across the room, hit the stage and perform\nWord is bond, don't be alarmed\nDon't let me have to sound the horn, and drop a bomb\nWanna get my mom a crib, with a lawn\nSomethin' that my future kids, can run up on\nSo I always do my best to carry on\nLife is like game of chess, don't be a pawn, my nigga\n\n[Chorus]\nThis for my people, tryna stay alive and just stay peaceful\nSo hard to survive a world so lethal\nWho will take a stand and be our hero, of my people, yeah?\nThis for my people\nTryna stay alive and just stay peaceful\nSo hard to survive a world so lethal\nWho will take a stand and be our hero?\n\n[Verse 2]\nLook up in the sky, it’s a bird, it’s a plane\nNo, it's the young black god livin’ out his dreams\nWhat you mean? I been up on an ultralight beam\nThey don't wanna see you fly, they just gonna shoot your wings\nEverything ain't what it seem\nWishin' all these dirty cops, would come clean\nStill swervin’ on these city blocks, for one thing\nMy man just copped a 30 shot, protect the team, know what I mean?\nMusic is a form of expression\nI'ma use mine just to teach you a lesson\nRule one: this microphone's a weapon\nI'm shootin' out the actions manifested and my passion\nNever restin', I'm surpassin' the expectancy\nOf life in my direction\nMan the section 8 depressin'\nHard to be progressin' through recession and oppression\nNot to mention that they had us cell blocked ever since an adolescent\n\n[Chorus]\nThis for my people, tryna stay alive and just stay peaceful\nSo hard to survive a world so lethal\nWho will take a stand and be our hero, of my people, yeah?\nThis for my people\nTryna stay alive and just stay peaceful\nSo hard to survive a world so lethal\nWho will take a stand and be our hero?\n\n[Outro]\nOh, yeah\nOh, mm\nOh, yeah", "image": "https://images.genius.com/84b143545e0338f7b7459bb9ab8ecca4.630x630x1.jpg"}], "artist": "Joey Bada$$"}