{"songs": [{"title": "Meek Mill Freestyles on Flex (2016) | Freestyle #017", "album": "Priorities 5", "year": "2016-09-30", "lyrics": "[Intro]\nWhat we doing, Flex?\nThey see us, Funk Flex, Meek Mill, 017\nI mean, why not?\nDreamchasers in the building, you know what it is\nPhilly, New York City, what's up?\nAll my NY niggas, what's up?\nThe mafia, ha, let's get it!\n\n[Verse 1]\nMixed the Balmain with the Bape shit, I've been going ape shit\nFinna go banana like the K clip\nNiggas talk about me, they see me and never say shit\nKeep them suckers dippin' and dodgin', like it's The Matrix\nHeart full of hatred, show it on the Internet\nWeirdo niggas in my comments, but we ain't into that\nWe was in there making it double and tryna get it back\nBust a thousand traps all in it and take that rental back\nCouple hundred, tint it black, tryna make a mil in it\nI'ma let 'em shuffle when I cut it, got to deal with it\nWhen I got it, put my homies on like a real nigga\nAnd they all still with us\nSeen too many trill niggas fall to let you bitch niggas beat me\n'Fore I take a loss they gon' have to RIP me\nBut that'll never happen, take this war shit deeply\nMy young niggas starving in them trenches and they need me\nThey like, \"Meek Milly, won't you spit that crack again?\"\nFake niggas up three, bring us back again\nRiding down Broad Street, I'm in the Bach again\nI bully niggas, I'm unlike Mac again\nPhilly, money can't make me, suckers can't break me\nBack to back jabs, but I'm still gettin' eighty\nJust to walk through, and have them hoes going crazy\nAll this cash money, got me stuntin', like I'm Baby\nPosted up with Nicki, that's when it get tricky\nNiggas in their feelings, that's when it get drizzy\nSpeaking on the Chasers, definitely get busy\nWe get money, stay a hundred, we don't never keep it 50\nAnd we don't cosign no rats over here, my G\nOn scopes on them straps over here, my G\nLot of security with badges over there, I see\nYou brought the law with you, I brought them hittas with me\nIt ain't a nigga that I met I thought was realer than me\nI'm 'bout to take 'em 4th quarter, I can feel it in me\nCatch 'em on the inbound, watching for the shot clock\n5-4-3-2-1, pull up for the jumpshot\nSwish, nigga! We used to play Sega\nNow its Glock 40, with the red lasers\nNiggas want to kill us, but they can't fade us\nPlay them corners, we trappin', watch for the damn neighbors\nCall the cops on us, and we had them Glocks on us\nPocket full of rocks on us, they was sending SWAT for us\nSuper predators, is what they said of us\nWatching bodies drop on the regular, it was regular\nSaid it made us cold, but really that shit affected us\nFell in love with hoes, they the only one that accepted us\nWhite folks was prejudiced, so the foreign's all black\nWe done turned nothing into something; what you call that?\nEighteen, caught my first case, had to fall back\nTen years of probation probably set us all back\nStarted public housing, now we Kings\nGrandma and Mama, we called 'em queens\nChasing that money, and chasing dreams\nServing out people, ‘cause they was fiends\nOn the North side of Philly, where niggas'll serve they mamas\nAnd go spend that money they made on a new designer\nThey say I'm still stuck in my ways, and to be honest\nI probably am; sorry, Your Honor!\nI was made like this, I was raised like this\nSelling coke to get a mil, shit, I got paid like this\n\n[Interlude]\nNew York City! What we doing, Flex?\nSpecial cloth, special cloth\nShout out to DJ Khaled, this that special cloth\nAt the radio station\nGoing brazy with your boys in the building\nNew York City, what the fuck is up?\nWe here! Let's get it! Let's get it, Flex!\n\n[Verse 2]\nI'm from a hood of broken dreams\nShots firing, yellow tape on the scene, as spooky as Halloween\nGo to school, what do you mean?\nWhen your mama a fiend but your lil' sister a queen\nAnd the fridge so empty it's hurtin' your self-esteem\nNow to get out on the corner and get it by any means\nHow the judge gon' judge us when this is all that we seen?\nThis is all that we know, eviction note at the door\nSo we pray like we gon' get to eat one day\nI promise we gon' beat them streets one day\nRunning 'round, living reckless\nKnowing we gon' live at peace one day\nI'm thinking, \"Should I get to sleep some day?\"\n‘Cause I've been up all night chasing this cake\nTo feed my mama and them\nSummer-time, you hear them sirens again\nThey said, \"That boy won't make it.\"\nYou hear them screams, Mama crying again\nWe had to kill and get as violent as them, we tryna live\nMy young bull, she was supposed to go to the league\nStarted popping on them P's, running 'round with the fleas\nAll them A's and them B's start to turn into C's\nGo from crossing niggas over into running from D's\n'Fore you know it coppers pointing at you, telling you \"Freeze!\"\nAnd you can't afford a lawyer, so they telling you \"Plea!\"\nMan, this shit worse than cancer, like a fucking disease\nLiving this nightmare, they telling us \"Dream!\"\nLook what they did to Martin Luther, bullet holes in our Kings\nAnd they wonder why we never believe\nAnd they wonder why we never would leave\nNigga, we poor, young niggas worrying about that corner store\nBut the chinks own that\nAnd you claiming that's your block; who you think own that?\nQuicksand in the hood and we gon' sink on that\nYou should think on that\nPoison water out in Flint, they let them little babies drink on that; they don't care about us\n\n[Interlude]\nNew York City\nDC4 on the motherfucking way\nYou already know what it is\nWe only doing it strictly for the streets\nWe ain't doing it for the Internet\nStrictly inspiration for the streets\nMotivation for my young niggas behind them walls\nMy young niggas stuck in the trenches\nYou know what it is\nNew York City like my second home, nigga\nFlex, we in the building\nHot97, you already know what it is\n\n[Verse 3]\nViews from the trap, nigga\nI'm back, nigga, with two 9's; Warren Sapp, nigga\nThe crack dealers was new slaves, I toot Tre's\nJordan with the mic, making dudes fade, I do says\nSippin' on that shit like it's Kool-Aid\nRollie with the blue face, diamonds, they clear as Blu-ray\nSuckers all in they new ways, different chapter, a new page\nYou fake if you don't speak to me\nReal soon as you wave, I get it\nFavorite singer, favorite rapper, I hit it, I'm with it\nTry to tell me I'm losing and niggas winnin'?\nThey ain't want to see me on the yacht, no\nThey don't want to see me in the drop, no\nComing down Collins with my young niggas wildin' on the bike\nVroom, vroom, 12 o' clock, whoa\nHear no evil, I don't see no evil\nPocket full of dead presidents; them C-note people\nWe thought you was flamin' hot, why you cheat those people?\nYou fraud niggas, we can't believe those people\nI need a witness\nNow back to them trenches, we trap on them benches\nWith MAC's with extensions, this Shawshank Redemption\nLocked my body up, but my soul free\nNiggas do not know me, so how could they oppose me?\nKill 'em with success, they gon' kill me with emojis\nKill me with a meme, you pussies never could expose me\nDid I fuck his bitch? Maybe it was the 'gram\nHurting these niggas hearts, I really can't understand\nI started off with a dollar, turned it into a grand\nFlipped it into a milli, I'm still reppin' my city\nI pull up poppin' a wheelie, bending corners on coppers\nToting choppers and whiping the work up like Betty Crocker\nMoney, power, the crab in the barrel, no getting out it\nWhat I told 'em, but I'm in Miami eating on Lobster\nBad bitches, I bag bitches that bag bitches\nThey mad niggas, they only hate, I get the cash quicker\nSavages that blast with us, I past niggas\nI lap niggas, I bend the corner, ride past niggas\nI know how that money feel\nDelaware State, landing choppers on the fucking field\nMy life so fucking real\nI don't never go to sleep, ‘cause I'm trying to see a hundred mil\nThat automatic automatically on me\nI automatically clap suckers for running up on me\nAnd automatically smack suckers and fuck up their homies\nFinna fuck up that money, you think it did something to me?\nI do things, new things\nI'm getting blue cheese, no hot wings\nI really cop things, new V's and hard top\nAnd y'all niggas saying hoop dreams was hard rock\nAnd serving samples to the new fiends, whoa", "image": "https://images.genius.com/e91cce46d345daa94bd2c23f297db3fb.300x300x1.jpg"}], "artist": "Meek Mill"}