{"songs": [{"title": "FUCK IT", "album": null, "year": "2015-10-12", "lyrics": "[Verse]\nYo, I've seen a lot of niggas\nSo when them niggas start talkin' reckless, I get offended\nI get it, they try to keep a image\nBut look real closely at the pictures and you see that they chameleons\nHow you doin'?\nYou in the motherfucking building?\nNigga, I'm a architect, got another crane and I don't know if I'mma park it yet, you ain't even start one yet, fuck off my property\nTell Australia I'm sneaking in with a mic in my damn hand\nInstead of the vegetables that I packed in my backpack\nWhen Marshall had this problem, what the fuck was they telling him?\nIs it cause of status or his melanin lacks black? Huh?\nI think people love to be mad\nHow can I be misogynist? I love titties and ass\nHow can I be homophobic when my boyfriend's a fag?\nAnd we been hiding in the closet like our passion is fashion\nStill trying to come out\nCouldn't deal with niggas who decide to take the fun out\nProbably cause I like to be in places where the sun out\nSo comparing niggas lights is a motherfucking bum out\nThought y'all niggas nudists but y'all clothes\nI was 'bout to tee off and putt-putt till the end\nNow it's Anti-Golf Boys cause I don't fuck with my friends\nWorse thing they gave me was an opportunity and a pen\nLook, freedom of speech? My freedom was breached\nBorder Patrol put me on streets immediately\nFor shit I said when I was a virgin repeatedly\nPosting on Hypebeast cause nobody would listen to me\nMy child is a product of me, very honest\nLeft of center, very different, they didn't want us\nThey didn't get us, didn't fit enough for their standards\nDiverse and loud, so they ignored us\nYou put your life in a child that everybody hates\nNow everybody hates papa despite that papa's great\nBut that's your favorite child boy that's your favorite one\n(Got kids, nigga?) Nope, I'm talking 'bout that Cherry Bomb\nI don't think they hear it, I was fearing deteriorating\nAlmost ate my spirit til the children cheered along\nWatching them sing the songs\nEyeballs inspired from Pilot to 2Seater, I couldn't steer them wrong\nThat's why I rode the McLaren, couldn't stop at the Bimmer\n\"Tyler losing himself, and that nigga turned to a diva\nThat nigga preaching and wildin', that nigga smilin' and breathing\nTryna inspire all the little niggas that wanna be him\nBut fuck that!, We want:\nCats cats daddy problems\nKickflip fuck fuck, cupcakes buttrape\nGolf Wang, daddy problems fag fag dad dad\nBike lake everything that I hate, plus being sad\"\nY'all can cry about your year's top rap new albums\nGolf did a quarter million in about two hours\nMoney money ain't the motive, but it is up for discussion\nNiggas frontin' niggas wish that they could fuck with my production nigga\nSaying you the plug, get your chords up\nI was writing string sections on my tour bus\nThey adore me, my little birds\nBe free, go flap your wings, I encourage it\nLook, I wish I had a fucking xanax problem\nSo y'all talk about how I deep I am\nMan-child in the flesh, bitch, I'm Peter Pan\nYou captain tier hook  muthafuckas won't ever be the man\nI got a muthafucking vision, I don't see your plans\nSo shut your muthafucking mouth when I be speaking, man\nCause T the only sober nigga that be tweaking, fam\n\n[Outro]\nFuck\nI don't—I don't like rapping like that", "image": "https://images.genius.com/8ea06abdbabed5327b0ab332d0b1c175.500x500x1.jpg"}], "artist": "Tyler, The Creator"}