{"songs": [{"title": "World is Empty", "album": "The Warm Up", "year": "2009-06-15", "lyrics": "[Verse 1]\nYeah, it's Cole, won't lie, won't stop 'til the race is won\nNiggas who be rapping how real they are\nUsually turn out to be the fakest ones\nCarolina, where I made it from\nCole world, no blanket, son\nGirls fast how Jamaicans run\nPuffing on the city where the Lakers from: L-A, L-A, la la\nSo high, everything is a “ha ha” for me\nDreaming of the days of a drop 500\nAnd a bad bitch that'll go to Popeyes for me\nYou can never tell me that I'm not hungry\nIf you ever felt what's inside my tummy\nMy mind wondering now, is my time running out?\nIs the Lord up top with a stop watch for me?\nHope not, hope not, hope not, hope not\n\n[Hook]\n(My world is empty without you, babe)\nYeah, just trying to make it, my nigga\n(My world is empty without you)\nYeah, yeah\n\n[Verse 2]\nA wise nigga told me don’t chase that cash\nFollow your heart, you’ll make that fast\nDoes a stripper love to shake that ass\nOr does she wish to erase that past?\nGot a nigga in her face, just gassed\nLike “baby girl, why you take this path?”\nStack in his hand, trynna make that last\nAll she thinking bout is how to take his last\nRub titties in his face and laugh\nGotta try not to look fake, in fact\nA little more money, like a few more 20’s\nWhen you let that nigga grab your naked ass\nOkay, he’s gone now, roll her eyes when he whispers in her ear\n“This ain't the life for you, baby, let me take you out of here cause...\"\n\n[Hook]\n(My world is empty without you, babe)\nYeah, she like \"nigga, yeah right\"\n(My world is empty without you)\n\"You know how much motherfucking money I'm making?\"\n\n[Verse 3]\nYeah, my niggas sit back, blowing the L\nOnly getting high cause we closer to hell\nNigga trying to live like Hova, but well\nWe broke and that dough coming slow as a snail\nHustle hard in the snow, in the hail\nHit the block like a postman with mail\nMy brother got knocked now they hold him in cells\nMy mom broke, but she posted the bail\nSomeway, somehow\nNigga feeling like the sun down even when the sun up\nHear the sound out the window of the gun bust\nAnd you wonder why niggas keep the gun tucked\nBut this how niggas was brung up\nA mother just trying to raise her son up\n'Til a stray bullet got his lungs struck\nAnd the Governor couldn’t give one fuck\nWhile she singing\n\n[Hook]\n(My world is empty without you, babe)\nDamn, told you niggas \"Cole world, no blanket\"\n(My world is empty without you)\nTough luck, yeah", "image": "https://images.rapgenius.com/bbedb619df51d7c751c886dc70dfc60c.1000x1000x1.jpg"}], "artist": "J. Cole"}