{"songs": [{"title": "Big Business", "album": "Biker Boyz: Music From the Motion Picture", "year": null, "lyrics": "[Ron Isley singing]\nSwizz Beatz, show 'em what they dealin with\nWooo! Oh yeahhhh! Ahh Yeahh\n\n[Ron Isley singing - Chorus x2]\nHey ladies, can I get a witness?\nLah da da da da-da\nTell 'em what they dealin with\nThrow your hands in the air (big business)\nThrow your hands in the air (yeah! yeah!)\nHey fellas, tell 'em what they dealin with\nBig house (throw your hands in the air), big boats\nBig cars (throw your hands in the air), superstars\n\n[Verse 1 - Jadakiss]\nFuck a six and a seven I'ma put big dubs on the gray eight\nHold your wrist when you squeeze, the slugs'll stay straight\nCan I get a witness, Swizz Beatz the monster\nJadakiss, Mr. Biggs, its big business\nNigga this is our show\nTwenty two master bedrooms in the crib\nThe garage like the car show\nNot only am I real, I think\nBut I still jab a nigga with the left and won't spill my drink\nThe Courvoisier got me clashes\nHoney all over me like ashes\nThrowin that green molases\nYour dealin with D-Block, and Full Surface\nAnd ain't no payment plans its full purse-full\n\n[Chorus x2]\n\n[Verse 2 - Jadakiss]\nA'yo I'm dealin with this mami from Quebec\nWhen she fly out I pull the boat out and blow scomie on the deck\nShootin at the stars, Tommy and the Tek\nSoon as the dutch finish you can find me on the neck\nNo foreplay, bustin the pound raise me\nMiddle of the ocean, bustin her down crazy\nYou know me, I ain't on no star shit\nI just came to hurt the market\nThen squirt the Larkin\nPut your hands up, matter fact put your mans up\nPut your medina's and your lambs up, your grams up\nTalkin bout buckin each other\nProbly fuckin each other\nD-Block dawg, we stuck with each other\n\n[Chorus x2]\n\n[Verse 3 - Jadakiss]\nA'yo Full Surface, Swizz Beatz is in front of him\nGot alot of problems but money ain't one of 'em\nD 12's and up, thats our M-O\nTell me what you know bout a jet ski limo\nWaterproof knockin it, ain't no stoppin it\nAutomatic respect whenever D-Block's in it\nOr we can take it to the avenue too\nBring the Porsche GT out, lavender blue\nShit change, Kiss came its all extortion\nEverybody meet, except for smaller portions\nFor real though, behave yourself on some grown shit\nIt ain't enough room dawg, I'm on my own hit\n\n[Chorus x2]\n\n[Ron Isley singing]\nBig Businesssss, Jadakiss\nOhhh why dont you rap to 'em one tiiime\nShow em who they dealin wit\nBig Businesssss", "image": "https://images.genius.com/a32616470173a6add47889c8377d4886.500x500x1.jpg"}], "artist": "Jadakiss"}