{"songs": [{"title": "Don’t Call Me", "album": null, "year": "2013-09-24", "lyrics": "[Rakim]\nI idolized my father, he taught me to survive the horror\nCause times is harder, the skies are darker\nLook through the eyes of the snake, see inside the monster\nTo rise, need divide and conquer\nIf it's all about money, I don't respect your power, that's weak\nThey could prowl and devour, they cowards you ask me\nPowers that be, mistreat us, mislead us\nThinking eventually we gon' bite the hand that feed us\nSome of them, they tried to keep all up and from them\nMove us all those and club them, eat, plural, it's on them\nNew order of the ages, out of many one\nWhile the rest of us is calmed out of pennies\nNone us starving, it's problems we ain't fed quickly\nOur brethren's would be the ones shaking heads with me\nJealousy, hate, lust and greed would spread quickly\nDon't call me brother if you ain't breaking bread with me\n\n[Chorus: Shontelle] + (DMX)\nDon't call me mother (Ohhh)\nDon't call me sister (Nooo)\nDon't call me brother (Whoooa)\nDon't call me father (Don't call me! Don't call me!)\n(Repeat)\n\n[DMX]\nDon't call me brother, we ain't got the same mother\nOr the same father, you get down like the other\nDon't speak on wisdom when you know you don't love her\nDon't shake my hand when you wanna see me under\nDon't talk slick behind my back\nDon't walk like this when you act like that\nYou tryna bark on when instead you a cat\nCome to your hood like \"BAP! BAP! BAP!\"\nMess with the kid if you want to\nBut your mans and them tell you it'll be the last thing that you would do\nYou built like a scooter, I'm built like a hummer\nWas built like a tank, you don't want it baby, uh uh\nStop playing with D, it'll get you hurt\nYou a girl, you can't play in the dirt, you wear a skirt\nYou don't know a damn thing about putting in work\nWith your whole effin blocks up the murder type, arf\n\n[Chorus]\n[DMX]\nGrrr\nIt's a start\nAnd they don't know what it is\nTHEY DON'T KNOW WHAT IT IS!\n\nAY! (14X)\n\n[Shontelle]\nNo no no\n\n[Chorus till fade]", "image": "https://images.genius.com/1bcf43b1cc0f34db6cd70e1a63c8b84c.464x464x1.jpg"}], "artist": "DMX"}