{"songs": [{"title": "Untitled", "album": "Recovery", "year": "2010-06-18", "lyrics": "[Intro]\nNah, man—not quite finished yet\nHaha, woo!\n\n[Verse 1]\nGirl, I think you just might've tried\nTo pull a motherfuckin’ fast one, I’m mad\nYou just hurt my goddamn feeling and that was the last one I had\nDoes this look like an arcade?\nTryna play games? See this saw blade?\nSee this silhouette of a stalker in your walkway?\nBetter cooperate or get sauteed\nAnd rotisseried while you’re hog-tied\nMC’s get so quiet\nYou can hear a motherfuckin' dog whistle when I walk by\nColt Seavers on a mule, stuntin' on that ass like the fuckin’ Fall Guy\nI don’t gas my Mercedes after midnight, I treat it like a Mogwai\n'Cause it will turn into a Gremlin\nAnd run over kids, women, and men—Vrinn-Vrinn!\nMotor so big, you can fit a midget in his engine\nBitch, give me them digits, why you cringin’?\nNot by the hair on my chinny-chin-chin\nWill I spend-spend even ten cents on you, since when\nDo you think it’s gonna cost me a pretty penny?\nShit, if I think a penny’s pretty\nJust imagine how beautiful a quarter is to me\nEenie-meenie-miney-mo\nCatch an Eskimo by his toe while he’s tryin' to roll a snowball\nBut don’t make him lose his cool\nIf he hollers, better let him go, y’all\n\n[Chorus: Sample + Eminem]\n\"You don't own me\"\nNow here we go, go, go\n\n[Verse 2]\nGet up, baby, get a move on like a U-Haul\nYou can rack your brain like pool balls\nYou won't ever think of this shit—yeah, honey, you called?\nWell, here I come, Havoc on the beat, I wreak it\nEvil—I see, hear, and speak it\nLady, put your money on Shady, fuck that other weak shit\nPut your eggs in the same basket\nYou can count every motherfuckin’ chicken 'fore it hatches\n'Cause you can bet your ass that we gonna get it crackin’\nLike the Kraken and Titans when they're clashin'\nGet your brains bashed in\nSo bad, you will have Kurt Cobain askin’\nTo autograph a bloodstained napkin\nUnfashionable, and 'bout as rational as a rash on a fag’s asshole\nNow let’s take that line, run it up the flagpole\nWith Elton, see if he’s cool with it\nDon’t stand there and look stupid at\nMe, bitch, I ain’t in the mood for this shit\nGet my dick, Google it 'til it pops up\nY’all are so motherfuckin’ full of shit that you're stopped up\nMe, I’m always shittin' diarrhea of the mouth\n'Til your speakers crap out Pfft, huh, what?\nGirl, you got a hot butt\nLike a lit cigarette (chig-chigga-ret-ret)\nBut you won’t get a hot fudge sundae from me\nSo do not strut my way, slut, because—\n\n[Chorus: Sample + Eminem]\n\"You don't own me\"\nNow here we go, go, go\n\n[Verse 3]\nAnd now that I got your panties in a bunch\nAnd your bowels in an uproar\nI'ma show you why I came, so you stop askin' me what the fuck for\nNow look you little slut, cunt, whore, I know you want more\nBitch, it’s time to put the math back into Mathers\n'Cause I’m a fuckin’ problem—run, boy!\nEvery flow, got it mastered\nSo every last word that you fuckin’ fags heard\nComes straight from the fish's ass\nYeah, in other words, I’m a bass-turd\nLookin' at me like I killed Kenny, gas in the tank, yeah, still plenty\nNo morals are instilled in me, so remorse, I really don’t feel any\nEat your heart out, Hannibal, understandable why you're jealous\nFuck an animal, I got cannibal magnetism\nCan't resist him now—can you, ho?\n“Shady, I don’t understand your flow”\nUnderstand my flow? Bitch, I flow like Troy Polamalu’s hair, boy\nDon’t you dare try to follow or compare, boy\nI’m raw, you ain’t even medium-rare\nStay the fuck outta my hair, boy\nYou can look, you can stare, and point\nBut you can’t touch, I’m too clairvoyant\nI don’t get it, man, is there a void?\nAll this weak shit, what am I, steroids?\nWell, bitch, I’m back with some shit for that ass\nAnd your trunk, elephant hemorrhoids\nAnd remember, boys—\n\n[Chorus: Sample + Eminem]\n\"You don't own me\"\nNow here we go, go, go\n\n[Outro]\nThank you for coming out\nI hope you enjoyed the show\nUntil next time;\nPeace", "image": "https://images.genius.com/7b93181ae4ed594c902bf7e4e2149ca7.1000x1000x1.jpg"}], "artist": "Eminem"}