{"songs": [{"title": "Lilies", "album": "Lost In The Atlantic ", "year": "2014-10-17", "lyrics": "[Produced by The Buchanans]\n\n[Verse 1: Lupe Fiasco]\nCome, and bring the pieces to the master\nHe who organize by size then completes them with the plaster\nNow, what should we call it?\nAfter 12, cocktails prevails the inner alcoholic\nWho knelt you by the toilets?\nRemember, remember? Just like the Knights of Malta\nNiggas like their liquor malted, manifested like a land without the Indian\nJust all kith and foul kin\nWhether Maltese or  Millennium\nSaucer, Chaucer of the airwaves\nTwo assists: one Senegalese but her hair beige\nThe others hairs' shaved, both standing at the bottom of the staircase poised\nBut boys too coy to look in their face\nOi, bring the dowry, you can have 'em\nOn annual sabbatical, lookin' lousy in the cabin\nGroomin's only prudent to continue working with humans\nBut ain't no livin' signals inside my circle of students\n\n[Hook: Sirah]\nLilies in the valley of my heart\nLay you on your back and fall apart\nLately I been looking at the spores\nIt got my mind going back to Cali after dark\nI got a problem with commitment, I'd say\nLaying here waiting on waves\nTo wash away the palisades\nBarriers and barricades\nIn the lilies in the valley of my heart\n\n[Verse 2: Lupe Fiasco]\nLeave, and take these pictures to the pawn shop\nTell 'em you want the same amount of money that the one got\nPull up on the side of his Ghost and let the Dijon drop\nIf they muster up the courage to murk us at the Quran swaps\nFor the ones that tell you how to orchestrate the bomb plots\nTaught you well on how to tell the impostors\nMade an inner city Mosque in Mississippi, Madrassas\nMuch like differences in instances, itty-bitty is topless\nThat was food for the fingers\nDim the lights to set the mood for the singers\nWho can turn the stage into a school for the redeemers?\nLike an agent teaching Afghans to use the tool with the stingers\nUseful as a back tire to a flat tire\nA bazooka's your best friend until it backfires\nYour strata needs a bunk bed ladder to climb up\nAnd high hopes will put this whole matter behind us\n\n[Hook: Sirah]\n\n[Verse 3: Lupe Fiasco]\nStill, debunking the myth of a sleepover\nAs the enola sneaks over\nThe seat thinking ricolas fixes Ebola\nHol' up, heathens and thieves, in case police show up\nOut the belly of the beast, making the streets blow up\nBlowing in her hands, making the heat hold us in streaks\nAll my skills on the hilltop, you can hear a quill drop\nSpoon full of sugar help the pill pop\nLet us Tetris, little blocks until the bill clots\nAnd then fill spots and make the field drop\nLevels, wearing the baron's medals\nOtherwise bare expect for a pair of petals\nSomethin' like a bear except he's wearing a pareo\nFair safe haven to take your share of De Niro\nIn his care, might square to a pair of you share hold\nHeavily invested to bury Harriet’s railroad\n\n[Hook: Sirah]", "image": "https://images.rapgenius.com/5b9220121c5ea27b7790ee55ffcdf735.484x478x1.png"}], "artist": "Lupe Fiasco"}