{"songs": [{"title": "Bands", "album": "The Black Bar Mitzvah", "year": "2012-10-08", "lyrics": "[Intro]\nBandz a make her dance [x6]\n\n[Juicy J - Hook: x2]\nBands a make her dance\nBands a make her dance\nAll these chicks poppin' pussy\nI'm just poppin' bands\nBands a make her dance\nBands a make her dance\nThese chicks clapping\nAnd they ain't using hands\n\n[Verse 1 - Rick Ross]\nShe sweet as my swisha when I nut she gets richer\nTake you shopping for hours just for my Instagram pictures\nListen: bands a make her dance\nMills a make me move\nFor years I paid my dues, now I'm paid to wear my shoes\nReeboks for the week, I rocks with the streets\nOver time to the bees, haters give em swish cheese\nIf I gave em a jar he'd smoke powder for me\nGotta pull double shifts just to count all my cheese\n\n[Verse 2 - Whole Slab]\nYou want this money bitch?\nCome and get it ho\nRacks in the air, bands on the floor\nNow dance on the money, that's a money rug\nShe got her titties be as shots and time to tuck\nShe bad as fuck, I'm turning up\nI'm hard in the pen\nYa'll be bad dick and ratchet hoes, the whole Slab case\nBands a make her, 50 make her fuck\nThat ice would make her bite\nThat coup will make her suck)\n\n[Hook: x2]\n\n[Verse 3 - Lil Wayne]\n\nPop that pussy for a real nigga\nPull out my black card, that's my lil nigga\nMake a movie with yo bitch Steven Spiel nigga\nSmoking on Keish Cole, give me chills nigga\nWhat's your real name and not your stripper name\nI make it rain on ya like a window pane\nBands a make her dance\nTunechi make her cum\nHit it from the side like a motherfucking bass drum\nTwo hoes on one fucking pole\nTwo hoes on my fucking pole\nI don't tip I pay bills bitches call me buffalo\nHer stomach in and her ass out\nI'm flyer than the ones they pass out\nIf money grow on trees, I branched out\nI'm just waiting on my bitch to cash out\n\n[Hook: x2]\n\n[Verse 4 - 2 Chainz]\n2 Chainz, four bracelets\nLet me see that ass clap, standing ovation (TRU)\nIf yo girl don't swallow kids, man that ho basic\nGot two bitches with me: take a shot at one ho, using her friend for a chaser\n(Bands a make her bust it) Buss it!\n(Let me see you touch it) Touch it!\nMoney talk, you ain't got none, end of discussion! (Damn!)\n(Bands a make her do it) Do it!\n(Pocket full of money) Money!\nYoung nigga gettin' head while tha engine runnin' (Errrgh!)\nLet me see you wiggle, do it for a real nigga (Yeay!)\nI be laughing to the bank, all you do is giggle\nBallin' in my coupe, call it sports car\nDrop the top and freaky treat that bitch just like a pornstar!\n\n[Hook: x2]", "image": "https://images.genius.com/7a562a064cb983f896e86fc8449cc163.658x658x1.jpg"}], "artist": "Rick Ross"}