{"songs": [{"title": "Hell Yes", "album": "Trap House III", "year": "2013-05-21", "lyrics": "[Intro: Gucci Mane]\n(Da Honorable C.N.O.T.E)\nR.I.P. To Pimp\nAnd O.D.B\n\n[Verse 1: Gucci Mane]\nGetting head from a smart bitch\nI’m pourin' up dark shit\nAnd I might just have a change of heart\nBetter play your part, bitch\nTryna get too smart, bitch\nI might just have a change of heart\nGot a six-car garage, bitch\nBut I don’t need you to drive shit\n‘Cause I done had a change of heart\nWoke up in a mansion – grew up in apartments\nAnd I’m the nigga that broke her heart\nGot a car don’t need no keys, baby\nAutomatic starter, my finger, baby\nPoint a finger, start fightin' like Springer\n‘Cause Gucci Mane ain’t no average\nGot a girl, don’t need no weed, baby\nYou my dope, I'm your fiend, baby\nLike Billy Dee, get in my ride\nAnd girl, get out my dreams, baby\nWork on your footwork like Hakeem, baby\nAll this green between me and you, lady\nPut half on a baby with my homeboy\n‘Cause every time I ain’t tryna have no baby\nSmoking on kush got my eyes real lazy\nYou can ride me, baby, then drive me crazy\nRolling up half a pound, no shirt ‘cause girls around\nAll this money on me, girl, I’ll treat you special\nLet me be the manager, girl, I can help you\nLet me be the treasurer, get you a bezel\nAnd you can be my trafficker, send you wherever, baby\n\n[Hook: Gucci Mane]\nLike Pun and Joe, I don’t wanna be a player no more\nZone 6, I can’t be your mayor no more\nTook all my jewelry, all my money, threw it out the door\nBrick Squad goin’ broke? Nigga that’s a “hell no”\nAm I fresh nigga? Yes, yes\nAnd my bitch dressed nigga, yes, yes\nDress so fresh I impress myself\nAnd I’m smoking on a pound of the realest\nYes or no, am I over dressed?\nAsked for a pick up, said “hell yes”\nAsked for the dick I said “hell yes”\n“Do you wanna fuck me?”\nShe said “hell yes”\n\n[Verse 2: Gucci Mane]\nBaby, I’mma go out my way just to please you\nPlease don’t leave me now, girl, ‘cause I need you\nI’ll cut these hoes off right now, I really need to\nAnd I don’t even know why, girl, but I believe in you\nYou’ve been stuck on my line since you laid eyes on me\nAnd I don’t like your hatin’-ass friend because she lied on me\nAnd I just touched down, I made my girl so proud\nI know her inside out, I know her upside down\nAnd plus that girl stay down through all my ups and downs\nEven the thought of losing her…\nSome niggas might say no to drugs\nAll my crew say “hell yeah”\nWe don’t go get one pair, we go get twelve pair\nAll my niggas got brick fair, all my niggas got brick fair\nAt the Falcons game, and your bitch there\nI was worth ten mill’ when Vick was here\nAnd the same ‘hood you can’t come to\nThat’s the one, my mama pay rent there\nSpin the globe, every point i’ve been there\nI went platinum in Australia\n\n\n[Hook: Gucci Mane]\nLike Pun and Joe, I don’t wanna be a player no more\nZone 6, I can’t be your mayor no more\nTook all my jewelry, all my money, threw it out the door\nBrick Squad goin’ broke? Nigga that’s a “hell no”\nAm I fresh nigga? Yes, yes\nAnd my bitch dressed nigga, yes, yes\nDress so fresh I impress myself\nAnd I’m smoking on a pound of the realest\nYes or no, am I over dressed?\nAsked for a pick up, said “hell yes”\nAsked for the dick I said “hell yes”\n“Do you wanna fuck me?”\nShe said “hell yes”", "image": "https://images.genius.com/2d6a6af130abeb84aebd2824e7c3ef8a.500x500x1.jpg"}], "artist": "Gucci Mane"}