{"songs": [{"title": "I Can’t Wake Up", "album": "Return of the Boom Bap", "year": "1993-09-28", "lyrics": "[Intro]\nWhat I want you to do is count to ten\nNine, eight, seven, six, five, four, three, two\nOn one, you will be asleep - one\n\n[Hook]\nI'm a blunt gettin smoked and I can't wake up\nI'm a blunt gettin smoked and I can't wake up\nI'm a blunt gettin smoked and I can't wake up\nI'm a blunt gettin smoked and I can't wake up\n\n[KRS-One]\nI'm dreamin.. about bein a blunt\nI'm runnin around and I just can't wake up, hah!\nI'm dreamin.. about bein a blunt, ho!\nI'm walkin around and I just can't wake up\n\n[Verse One]\nI'm tryin to wake up, I can't wake up\nSo I run and jump, someone yelled, \"Get that blunt!\"\nGet that blunt - now I'm thinking this is major\nI've got a bunch of people chasin me with a razor?!\nI don't like this dream as a blunt\nBut I can't get out of it and I can't seem to wake up\nSo I'm runnin and racin, blunt smokers are chasin\nThis is insane, I'm caught by House of Pain\nI'm picked up, they said they gonna +Put My Head Out+\nThey slit my back and all the tobacco fell out\nNow I'm hollowed wet thin and yes ready\nThey poured the shumpang gently and re-wet me\nI'm in the mouth yo, I can't wake up\nYo I'm a blunt gettin smoked and I can't wake up\n\n[Hook]\n\n[Verse Two]\nCheck it out now, in the same attire here comes the fire\nOW they lit it, now I'm burnin by the minute\nBut check it out, more heads came to chill\nEverlast took a pull and passed me to Cypress Hill\nCypress Hill took a pull, lungs are full\nWho's next? I'm bein passed to Das EFX\nAs they took a mad pull, smoke blows in heaps\nIt's really smoky but I can still see Black Sheep\nWhoa! Black Sheep gets me, relights me\nRoom is proper, now I'm passed off to Shabba\nShabba's voice gets low like a tuba\nHe said, \"Me no follow no rumor\" and passed me to Grand Puba\nI wasn't burnin right so Puba got mad at me\nAnd said, \"Who rolled this?\" and passed it to Kid Capri\nKid Capri said, \"I won't front!\nPass it to Redman, he knows how to roll a blunt\"\nRedman said, \"No need to re-roll\"\nHe hit, relit it, and passed me to De La Soul\nDe La Soul took a hit and kept hittin\nNow they're buggin cause they passed me to Bill Clinton\nBill Clinton said, \"I'll smoke but I won't inhale\nI'll only hit it twice,\" he got slapped by Greg Nice\nNow I fell on the floor, Greg Nice picked me up\nI'm bein smoked and I can't wake up\n\n[Hook]\n\n[Verse Three]\nGet me out of this, somebody wake me up\nI'm still on fire and I'm still bein smoked up\nHalf my body is gone, now they're comin to my head\nNow my head is being pinched by Teddy Ted\nA crazy nightmare I got to go\nI got to wake up and I'm passed off to Yo-Yo\nYo-Yo gets respect as a lady\nShe didn't smoke, she passed me to Showbiz & A.G\nA.G. said, \"Respect due seen\"\nHe got one big pull and passed me to Smooth B\nSmooth B, although he's talking to Teddy\nTook a hit and passed me to Fab 5 Freddy\nFreddy said, \"Yo! There's nothing left pop\"\nLooked at me in my face and passed me to Chubb Rock\nChubb Rock said, \"Yo Freddy chill!\nIf you ever catch me smoking, just kick me in the grill\"\n\n[Hook]\n\nI'm DREAMIN!!!", "image": "https://images.genius.com/2573d3afb044969d03669dee90d609f7.1000x1000x1.jpg"}], "artist": "KRS-One"}