{"songs": [{"title": "This Is Hip Hop", "album": "All 6's and 7's", "year": "2011-06-07", "lyrics": "[Intro: Tech N9ne]\nWhen I say \"Tech\", you say \"N9ne!\"\nTech (N9ne!), Tech (N9ne!)\n\n[Chorus]\nThis is hip-hop\nIt's country, jazz and R&B and it's pop\nIt's rock and roll and yeah never will it stop\nSo ain't no way you stoppin' this hip-hop, hip-hop\nThis is hip-hop\nIt's country, jazz and R&B and it's pop\nIt's rock and roll and yeah never will it stop\nSo ain't no way you stoppin' this hip-hop, hip-hop\nThis is hip-hop\n\n[Verse 1: Tech N9ne]\nWhat is livin' on 904 Michigan?\nWhat is havin' roaches and trouble findin' more dividends?\nDyin' a poor citizen\nWhat is bars in the door to seal us in\nWar kill us men, tryin' for your kid again\nWhat is savin' your pay to go stay in a available place\nIn the way 'cause you ain't paying no janx when the Yate makes a way to rotate\nWhat is weight in your safe? So we can stay in your race\nLay 'em on tape invading your state with this pain in your face\nWhat is the door slam? They ain't with the program\nThe bidness give a damn, you go HAM, you giving 'em more stamina\nWhat is having a manager bookin' many shows to go jam?\nWhat is at the bottom? They don't really gotta\nWhat is in a column without another who stopped him\nDropped him, popped and chop him, what is summer, spring and autumn?\nWhat is dope and to the top and shot him what is poverty?\nWhat is acknowledging a prodigy?\nWhat is the dichotomy of this good and bad anthology?\nWhat is lads that follow the sad path Sickology?\nWhat is livin' life low, then livin' like you hit the lottery\n\n[Chorus]\nThis is hip-hop\nIt's country, jazz and R&B and it's pop\nIt's rock and roll and yeah never will it stop\nSo ain't no way you stoppin' this hip-hop, hip-hop\nThis is hip-hop\nIt's country, jazz and R&B and it's pop\nIt's rock and roll and yeah never will it stop\nSo ain't no way you stoppin' this hip-hop, hip-hop\nThis is hip-hop\n\n[Interlude: Tech N9ne]\nWhen I first heard the beat, it gave me the vision that if the\nMayan calender was correct and in 2012 the world was actually destroyed\nWhen a new civilization forms and they get to diggin' they find this\nAnd this will be a perfect way to start off the new hip-hop culture\nYou know what I'm sayin'? We're two murderers lyrically\nYou know what I'm sayin'? It'd be crazy\nStrange, baby!\n\n[Verse 2: Brotha Lynch Hung]\nWhat is gettin' off the X and writin' an album?\nWhat is being put in the middle like Malcolm?\nSicker than sarcoidosis\nI eat Carrion, I got body parts in my Carry-On\nThat's when the party starts, nigga, I'm very hung\nBeen rippin' up niggas since I was very young\nScary-lookin' motherfucker, ready to kill your daddy's mom\nReady to eat that meat with a meat cleaver\nI creep in the streets and defeat these\nEat these niggas up hot shittin' out their feces\nPut a knife in their nieces\nAt least he's younger, hunger, dinner\nHe sees thunder, one nut in her\nHe sees baby, doctor visit\nHe spills rabies in his lyrics\nPut her in the back with the flat tire, I'm fire 'till I retire\nI tie her up and then fry her up and then give her to the higher up\nTech N9ne intertwine, get out the wine\nThis is my kind of hip-hop\n\n[Chorus]\nThis is hip-hop\nIt's country, jazz and R&B and it's pop\nIt's rock and roll and yeah never will it stop\nSo ain't no way you stoppin' this hip-hop, hip-hop\nThis is hip-hop\nIt's country, jazz and R&B and it's pop\nIt's rock and roll and yeah never will it stop\nSo ain't no way you stoppin' this hip-hop, hip-hop\nThis is hip-hop\n\n[Outro (Reversed): Tech N9ne]\nTo all my youngsters out there listening to this:\nFind some sort of education or understanding of life and how it was\nAnd then try to find out how you can continue to grow this thing\nAnd better this thing and take this thing to higher heights with\nMore knowledge and more conviction to preserve this thing called hip-hop!", "image": "https://images.genius.com/7d4c4dfa3d56e3cd0f59836ef122ff24.1000x1000x1.jpg"}], "artist": "Tech N9ne"}