{"songs": [{"title": "Keep Doin’ That (Rich Bitch)", "album": "Hood Billionaire", "year": "2014-10-06", "lyrics": "[Intro]\n\"Who this?\"\n\"Your rich bitch\"\n\n[Intro: Rick Ross]\nThis is for my rich bitches\nHer puppy named Panamera\nHer puppy named Panamera\nShe got a condo in the area\nRich bitch, uh, yeah\n\n[Verse 1: Rick Ross]\nShe stay at her friend's and all these bitches is bad\nWatch them lick on each other, I'm talkin' pussy to ass\nDope boy still at large, trackin' device on their car\nTattoos on her arm, Double M diamond charms\nChanel bag on her hip, Hermès bracelets and things\nLet her fuck Meek Mill, told her keep chasin' her dreams\nGet the Lexus to flip, purple Texas to sip\nShe make it rain like a nigga, we got more money to get\nRich bitch, call her rich bitch\nCause she fuck with dope boys and can suck a good dick\n\n[Hook: R. Kelly]\nYeah, I'm a spend up all this money (facts, facts, facts)\nGirl, you doin' somethin' to me (facts, facts)\nHell yeah, keep doin' that, doin' that\nKeep doin' that, doin' that, ohh, oh yeah\nKeep doin' that, doin' that, keep doin' that, doin' that\n\n[Verse 2: R. Kelly]\nI be feastin' on Tinder, she taste just like peaches\nDiamond-studded La Perla, that pussy's prestigious\nYeah, she remind me of somethin' but that shit ain't my Jeep\nMatchin' Bugattis, Versace sheets when we freak\nShe be movin' that dough, quarter mil on her wrist\nWhy you niggas be slippin'? This bitch is fuckin' your bitch\nSaks Fifth, pop tags, Neiman Mar', pop tags\nCrocodile, python, that's a zoo on her bag\nShe on the phone makin' deals, we gettin' them checks\nMy Penelope Cruz, I let her meet my connects\nI fuck her all on the marble, yeah, that girl is a freak\nShe like cummin' n' money, she's the female me\n\n[Hook: R. Kelly]\nYeah, I'm a spend up all this money (facts, facts, facts)\nGirl, you doin' somethin' to me (facts, facts)\nHell yeah, keep doin' that, doin' that\nKeep doin' that, doin' that, ohh, oh yeah\nKeep doin' that, doin' that, keep doin' that, doin' that\n\n[Verse 3: Rick Ross]\nRoom service for weeks, a Dusit towel on the beach\nShe only wear panties once, then pass it down to her niece\nLet's go shoppin' at Boca, sixty stuffed in the sofa\nCan't be tweetin' locations, she postin' pics from her yoga\nNever party with locals, niggas with them Boost Mobiles\nVIP with dope boys, the DJ shout out to Sosa\nValet parkin' the Wraith, cocaine all on her face\nHer Rolex icy as mine, throw up my gang sign\nWe goin' bottle for bottle, Belaire Rose to the Brut\nRich bitch is her name and she Chanel to the boot\nUh, I be droppin' so much, nigga\nMy bitch shoppin' so much, nigga\n\n[Hook: R. Kelly]\nYeah, I'm a spend up all this money (facts, facts, facts)\nGirl, you doin' somethin' to me (facts, facts)\nHell yeah, keep doin' that, doin' that\nKeep doin' that, doin' that, ohh, oh yeah\nKeep doin' that, doin' that, keep doin' that, doin' that", "image": "https://images.genius.com/e226b49702450259996df77626017573.650x645x1.jpg"}], "artist": "Rick Ross"}