{"songs": [{"title": "Like I Do", "album": null, "year": null, "lyrics": "[Intro: Jazze Pha]\nLadies and gentlemen\nYou are now tuned into the very best\nT.I., Dream!\n\n\n[Verse 1: T.I.]\nLong hair, cute face, big booty, thin waist\nBreasts so pretty they can’t be real.. they is) that’s what she’ll say..\nShe’ll play with her girlfriend tag team on the sex I’ll give way..\nGet em on Patron for real they both gone have a field day..\nNever have experienced, gorgeous but they curious..\nSo gorgeous and mysterious I’m panty pumper number one I’m serious..\nI’m talking fast cars, bright lights, big city, long nights, pretty women on site\nI give it to em all night\n\n[Pre-Hook: The Dream & (T.I)]\nIt had bright lights\nRolling through the city in that M6\nEvery other radio station playing my…. Oooo…..\nIn a minute she gone be right up on mine\nAnd look at you\nShe ain't had none in a minute so I’m really finna to put it on you\nYou just got a text from your man over here like he ain’t got no clue\n(Tell him when I let you go, shawty)\nYou know it… (You know what it is, baby)\nHe can’t love you like I do…\n\n[Hook 2: T.I. & (The Dream)]\nHe can’t do it like (I do)\nHe can’t do it like (I do)\nHe can’t do it like\n(So go on shortie twerk that, I’m finna to work that. I do)\nHe can’t do it like (I do)\nYou know he can’t do it like (I do)\nHe can’t do it like\n(I'm not like him and I'm finna to put it on ya like..)\n\n[Verse 2: T.I.]\nSay she got a man but, he don’t really stand up\nIn that stuff like he supposed to all he do is handcuff\nSo she come see me relaxed\nGive me love receive it back\nSex her, stretch her body out so much she say I needed that\nI’m talking prime time porn star\nGoing hard, going in, riding it like a foreign car, invite a friend to join in\nI’m talking fast cars, bright lights, big city, long nights, pretty women on site\nI give it to em all night\n\n[Hook]\n\n[Verse 3: T.I.]\nCatch me in an old school, new school vert drop, hard top\nSee me and at least two freaks pulled over in a parking lot\nEngaged in conversation rolling listening to the radio\nGive it to em rough they say but treat em like a lady though\nShe never kissed a girl before but fantasized about girls before\nImagined having sex with women just don’t want the world to know\nI’m talking fast cars, bright lights, big city, long nights, pretty women on site\nI give it to em all night\n\n[Bridge: The Dream]\nOoh baby\nHey baby girl..\nAll you gotta do is call me when you need me baby\nAll I need is you\nAll you need is me\nLet me free your little body and take you into ecstasy\n\n[Hook]", "image": "https://images.genius.com/68262ccdcbffb87427d31b0d6085c2e3.400x400x1.jpg"}], "artist": "T.I."}