{"songs": [{"title": "Jackin’ for Beats", "album": "Down With the King ", "year": null, "lyrics": "[T.I.]\nKeep my name out your mouth, I done said it befo'\nCause all them games I ain't 'bout, tell whoever you know\nBefo' I pull this thang out, aim it dead at ya throat\nOr bring the rifle out the house and put ya head in the scope\nPimp I'm trained for the drama shawty ready to go\nSee me hangin' out the hummer spittin' seventy mo'\nYou was talkin' 'bout a drought, I was peddlin' snow\nAnd I doubt you'd get some blow as cheap as I'm sellin' it fo'\nHey I'm a G, what I'm worried 'bout a felony fo'?\nWhen I get free bet I'll be ballin' hard as ever befo'\nI got some chevy's but a benz what I'm usually in\nNiggas hatin' on my crew I'll put a few in the wind\nKeep it pimpin' till the end, while you choose to pretend\nShot a video in the pen and I'll do it again\nMade news nationwide from eleven to ten\nHeadline CNN Peter Jennings and friends\nNigga, I'm so cool, been doing this since the old school\nYou turn into a gangsta when your vocals hit the Pro Tools\nHa! Look at him man\nSo don't get it confused, you don't know that dude\nI'm hardcore no gold teeth, no tattoos\nIf you don't want no beef nigga don't act rude\nI got a 4-4 fo' yo' attitude\nWe can talk or shoot it out, whatever you choose\nHave it back in the county blues on the TV news\nOnly two rules when you walk in my shoes\nOne: Take no shit, number two: don't lose\nI'm throwed off, plum fool nigga loose in my screws\nIma pass my patna the tool leave you wet as a pool\nLames get it misconstrued, g's you dont fool\nI know bustin' a grape is somethin' you won't do\nSuper cool, nothin' to prove\nI been bustin' them rugers and givin' you busters the blues\nSince you were suckers in school\nHey, this is a situation you gon' wish you never pursued\nYou wanna push me? Pussy nigga do what you do\nYou think trappin' just in my flows? Nigga au contraire\nBeen sellin' blow since I was 12 years old my dear\nBustin' calicos just to let 'em know I'm here\nChoppers in the trunk of every auto I steer\nWhen you was in the classroom try'na pick a career\nI was sellin' glass, countin' cash, drinkin' a beer\nI agree this rap beef shit is so last year\nBut ask if I'll tear a new hole in your ass? Yeah\nFor flexin' and disrespectin', I don't play about that\nBut no mo' questions, I ain't got shit else to say about that\nBut my sentence'll be finished any day and I'm back nigga\nLaughin' at you sucka ass hollywood rap niggas\nFakin' and they love it but this ain't for the public\nSo in interviews are cued to stay away from the subject\nI just prove that I'm the truth if you don't like it then fuck it\nWe'll just keep it 'tween me you and this pistol I'm bustin', yeaaah\nPussy niggas ain't fuckin' wit' me\nCause pistol play in broad day that shit is nothin' to me\nYou need to pinch yourself nigga cause you livin' a dream\nAnd I'm one of the realest niggas that this industry's seen\nThink of me as John Gotti wit' a PhD\nOr either Martin Luther King with a G-18\nI'm ridin' clean, paint gleamin', blowin' T-H-C\nFor that reason haters wanna alleviate me\nBut I forgive 'em cause I know it ain't that he hate me\nHe just hate his situation hate that he ain't me\nO.G.s say a lot of them in me they see\nCause I'm a scholar no diploma no GED\nNow T.I.P. ain't sweet just so ya'll know\nHad to tone it down for ya cause I know ya'll slow\nNiggas tongue wrastle plenty yeah but they all show\nSpread gossip like hoes 'bout what they don't know\nGot mo' lies to tell than a nigga in jail\nAll my niggas from the streets I know remember me well\nFrom how I used to take a key and put the weight on a scale\nNow I'm seein' how many mills one record can sell nigga\nYou was on the low discussin' a g\nWhen Urban Legend drop we'll see what the discussion'll be\nSissy ass nigga, hah!", "image": "https://images.genius.com/bfc7d65a3c5f16d272808f97615ac5f6.360x360x1.jpg"}], "artist": "T.I."}