{"songs": [{"title": "Best I Ever Had (Remix)", "album": null, "year": null, "lyrics": "[Intro: Drake] (Busta Rhymes)\nYou know alot of girls be (Drake! Busta Bus! Remix!)\nThinkin my songs are about them\nThis is not to get confused, this one's for you\n\n[Hook: Drake] (Busta Rhymes)\nBaby you my everything, you all I ever wanted\nWe could do it real big, bigger than you ever done it\nYou be up on everything other hoes ain't never on it\nI want this forever I swear I can spend whatever on it\nCause she hold me down everytime I hit her up\nWhen I get right I promise that we 'gon live it up\nShe made me beg for it, till she give it up\nAnd I say the same thing every single time\nI say you the fuckin best, you the fuckin best\nYou the fuckin best, you the fuckin best (Aiyyo Drake!)\nYou the best I ever, best I ever had\n(Aiyyo you make me feel like I need to sit down my woman\nAnd just talk straight to her nigga!!!)\nBest I ever had, best I ever had\nI say you the fuckin best\n\n[Verse One: Busta Rhymes]\nCheck it! Baby girl! I'm lovin everything about you\nAnd when I'm on these records girl you make me wanna shout you\nAnd when I see you, I always wanna mouth to mouth you\nLet's go, to the altar so I could officially spouse you\nBaby! I'm glad you let me in to be your dude (Yeah!)\nI love your lovin even when your seasonin my food\nWhen shit get ugly, you never let it change the mood\nYour always holdin me doooooooooowwwwwwwwnnnnnnnnnn!!!!!!!!\nYou know I love you as my lady\nMake me wanna fertilize you have a little Busta baby\nAnd have a couple more and let them drive us fuckin crazy\nAnd have fun while we chasin them around\n(DAMN WE RAISED SOME BAD ASS KIDS GIRL!!!!)\nFor as long as I am breathin\nI'm a rep for you on everything I love and I believe in\nAnd when these other niggas see you they be always schemin\nThey ain't knowin I am wearin the crown\n\n[Hook: Drake]\nBaby you my everything, you all I ever wanted\nWe could do it real big, bigger than you ever done it\nYou be up on everything other hoes ain't never on it\nI want this forever I swear I can spend whatever on it\nCause she hold me down everytime I hit her up\nWhen I get right I promise that we 'gon live it up\nShe made me beg for it, till she give it up\nAnd I say the same thing every single time\nI say you the fuckin best, you the fuckin best\nYou the fuckin best, you the fuckin best\nYou the best I ever, best I ever had\nBest I ever had, best I ever had\nI say you the fuckin best\n\n[Verse Two: Drake]\n+Sex, Love, Pain+ baby, I be on that Tank shit\nBuzz so big, I coul pro'lly sell a blank disc\nWhen my album drop, bitches'll buy it for the picture\nAnd niggas will buy it too and claim they got it for they sister\nMagazine paper girl, the money ain't the iss-ue\nThey bring dinner to my room and ask me to initial\nShe call me the referee, cause I be so official\nMy shirt ain't got no stripes, but I can make ya pussy whiiiiiiiiiis-tle\nLike the Andy Griffith them song\n...And who told you to put them jeans on?\nDouble cup love, you the one I lean on\nFeelin for a fix then you should really get ya fiend on\nYeah, just know my condo is the crack spot\nEvery single show she out there reppin like a mascot\nGet it from the back and make ya fuckin bra strap pop\nAll up in ya slot 'till the nigga hit the jackpot\nI'm sayin...\n\n[Hook: Drake]\nBaby you my everything, you all I ever wanted\nWe could do it real big, bigger than you ever done it\nYou be up on everything other hoes ain't never on it\nI want this forever I swear I can spend whatever on it\nCause she hold me down everytime I hit her up\nWhen I get right I promise that we 'gon live it up\nShe made me beg for it, till she give it up\nAnd I say the same thing every single time\nI say you the fuckin best, you the fuckin best\nYou the fuckin best, you the fuckin best\nYou the best I ever, best I ever had\nBest I ever had, best I ever had\nI say you the fuckin best, you the fuckin best\nYou the fuckin best, you the fuckin best\nYou the best I ever, best I ever had\nBest I ever had, best I ever had\nI say you the fuckin best\n\n[Outro: Drake]:\nUh! Ah yeah! See this the type of joint you gotta dedicate to somebody\nJust make sure they that special somebody\nYoung Money, yeah, yeah, you know who you are...", "image": "https://images.genius.com/54314abfbbbf16253d72455428cc44e6.834x834x1.jpg"}], "artist": "Busta Rhymes"}