{"songs": [{"title": "HOT 97 Freestyle (2019)", "album": null, "year": "2019-07-25", "lyrics": "[Intro: Tyler, The Creator and Funkmaster Flex]\nOoh\nActin'  like I didn't hear this beat before\nAyo \nAyy, it's Tyler, uh\nWolf Haley\nGap  tooth T, bucket hat T, lemon head Enzo\nLil'  bunny hop, Ace the creator, Thernus Haley\nCyber, Beef Loaf\nFree  Rocky, free Rakim, that's my guy\nUm\n\n[Verse: Tyler, The Creator and Funkmaster Flex]\nAyo, um, ayo\nFree Rakim, free Rakim\nI  might fly to Sweden to free him\nHm, okay, I'm freestyling\nSay it again\nFree Rakim, free Rakim\nI might fly to Sweden to free him\nBraid my wig, A$AP tat on my ribs\nSwitch with him, then I can fuck all the Swedish men that I wanna\nActually, I'm gonna\nHeat it up real quick, motherfucka, I'm Lebron-a\nListen, Flex, we just met but I know it don't seem\nLike R Kelly, wet dreams, I always keep 16's, nigga\nMe and Flex looking in the index\nFor buff net niggas just for some hot butt sex\nWhat, what made you go with that verse?\nI don't-\nWhat made you go with that verse?\nI got a little cousin, when I die, he'll prolly take my estate\nI always tell him, \"Be himself, and always strive to be great\"\nHmm, no\nMy momma a dealer, her son crack, nigga\nWhat's that, nigga, facts, nigga, hmm\nWhy when they mention black businesses, they never mention me, dog\nI don't know, please, see man\n'Cause if they talkin' M's, GOLF did 17 in '18, mothafucka\nAnd that's just one season, huh\nStocks that I own, how much stocks do I own\nAll of it, the whole bird, that's my broth in the bowl, nigga\nHm, hm, hm\nGimme a topic, Flex\nCars\nI can't hear you\nCars\nVroom, vroom, zoom, zoom\nSweepin' niggas, inchin' like a broom, broom\nYeah, yeah, man, you know what it is\nDon't even look at my engine, bitch, you can't afford this\nThat's that muh-fuckin' McLaren, that's 500 made\nGot the fuckin' window tinted, 'cause I needed the shade\nAnd that E30 Bimmer, that you ain't seen since you a teen\nUh, back in '91, when they was doin' E and P and D at the arena\nMacarena, Hayna, Jayna, Shayda, Raida, Aida\nI'm back from LA, with Mexicans, they love the Raiders\nBut I don't watch football, I just watch the crooks ball\nWith them fuckin' eight balls, sellin' inside the hall of the high school\nI was not cool, niggas thought that I was weird and shit, they kept they space\nBut it's cool, 'cause now I got they amazin' grace, nigga\nHow many M's? It don't matter how much I make\nJust know what it is, when you see face, the gap-tooth nigga, the big ears\nAnd them shoes you ain't seen yet\nAnd, yes, if you like 'em nigga, I did design it, nigga\nHow many figures Converse gimme for that?\nWell, I don't know, but out in Bel-Air I just copped the a flat\nAnd a flat top, on the top of the hat\nThe one with the G, the store did a couple M's this week\nStop talkin' to me, dawg, niggas playin' around\nThis is right off the top, this is right off the cock\nMe and Flex gon' go 'round the block, and he gon' get...\nHe always slips up when gets a little aggressive, a little aggressive, right, a little aggressive\nHe always slips up when gets a little aggressive\nIt makes your ears and your eyebrows go up\nOkay, um, listen\nThey bringin' up my past, I don't hide it\nGoblin out now, bitch, buy it\nLookin' for them tweets, bitch, find it\nThe cancel couch is fake, and I recline it\nMan, I just don't know\nNiggas try to come for me, dog, they confidence low, dog\nWhat's goin' on?\nI don't got much else to say, so I'm gon' end this shit\n'Cause I got a lil' date with this dude real quick\nWe gon' go prolly get some ice cream, and do-, oh, wait a minute\nHe just got off his damn last shift\nAnd he said that his momma can't do the dishes\nSo he gotta go help her\nSo I'm gonna go weep, and look for someone on Yelp\nBut, wait, that's not a dating app\nSo whatchu use, Tinder, Grindr\nGet with all your niggas, and get right behind 'em\nWhat, you gon' do me like your DM, and slide 'em, hm\nFlex send me emoji\nNo, there's no emoji, I didn't send an emoji, wait a minute\nNow, Flex, why you lyin'\nWhy you tryna play me like change and 50 Cent when he was dyin'\nTryin' just to get it, get it, I split it\nI read it in it, and intended, your head was in it, um, mwah, I kiss it, nigga\nScooby Doobie, oobie the lubie\nMe and Flex was cuddled up watchin' Scooby Doo and eatin' Scooby snacks\nHe said he, \"Wanted my boobies\"\nI said, \"I don't got 'em\"\nHe said, \"Whatever, nigga, I rock 'em\"\nWe stock-a-bock 'em, ocka-rock 'em, tacka-dock 'em\nHe don't eat pork, I thought this nigga was a Salaama Lakim\nY'all niggas crazy, when he called me, I was at the lake, bruh\nBe clear\nIn Tahoe, I know, nigga, that's how I go\nIgor, Igor, Igor, niggas worshippin' Igor\nNiggas be worshippin', their fuckin' hands kissin', and their knees sore, uh\nFree Rakim, free Rakim\nAnd I'm fuckin' screamin' that until they free him\nBe clear\nBe clear, whatever, whatever\nWhatever I gotta do, I go get the cheddar\nAnd I don't even like pizza, but, whatever, more the better, nigga\nMy ex bitch is wetter, nigga\nNah, she dry as fuck, she like the canyon\nMy niggas in Laurel Canyon (Man)\nAll these white kids, they got the fandom\nHis ex is gonna be lookin' at this in, like, a year\nThink that I'm funny because I'm random\nWe could be together like a tandem\nMan, this weird as fuck\nI keep flirting with Flex and he ain’t tryna fuck\nNow I’m confused, I'ma leave, I just think that he hate me\nI thought I came here so he’d date me\nHe talking about a freestyle\nUgh, nigga, fuck rap, fuck that\nI was tryna take him back and take off that hat\nAnd we could be like mwah, mwah, mwah on the lips\nBut that’s weird as fuck man, I’m talkin' ‘bout dick (Pause, pause)\nPause, pause, pause, nigga, pause, pause (Pause)\nWhen we leave you gon’ give me your info so I call\nSayin', “Link when you back in New York, I’m tryna give away a bike (Yeah)\nMaybe we can get some dinner at night” nigga\nChilds, Mr. Childs\nFuckin lyin'\nMr. Childs, Mr. Childs, we there\nLook man, say less, say less, say less, say less\nIss ya boy T, man, all my niggas vegan\nNah, that's fuckin weird, though\nThey be eatin' meat, though\nBut I don't mean it in the \"pause\" way, I mean no homo\nGlitter on my nails, glitter on my neck\nNiggas bitter as hell, their shit don't sell\nI'm doin' so well, man, they really hate to see me win\nEspecially 'cause the gap tooth, and I'm dark skinned\nBut my shit clearer than that ball from Space Jam\nI'm that man, I'm that man\nSee them diamonds on my hand, why am I talkin' material shit?\nI don't even care, but I'm just freestylin' this bitch, man\nNiggas ain't mad, they look\nY'all crooks, me and Jay was just talkin' 'bout books\nI'ma prolly build a buildin' in the next two years, you wanna come?\nSounds good\nNah Flex, you wanna cum?\nPause Flex, you tryna cum? (He baited me for it)\nHe baited me for it, I didn't see that one, he caught me off guard, he got me, you got me, you got me", "image": "https://images.genius.com/610384882ca6311db99de4fbfcdf2b46.421x421x1.jpg"}], "artist": "Tyler, The Creator"}