{"songs": [{"title": "This Means War!!", "album": "E.L.E. (Extinction Level Event): The Final World Front", "year": "1998-12-15", "lyrics": "[Intro: Busta Rhymes]\nJust make sure them, them drums is smackin\nThis, means, WAR!!\n\n[Verse 1: Busta Rhymes]\nI work hard to take care of every one of my niggas\nFeel the love and appreciation from all of my niggas\nWhen I think meditate and contemplate for my soul\nWatch the truth manifest once the story unfold\nDisloyal motherfuckers I'mma BANISH you all\nAnd celebrate all in your absence once I get rid of y'all\nSometimes I can't describe the wicked shit I feel in my heart\nBreak my silence and sporadically tear you apart\nStrike with a serious vengeance and before you die\nPut you through the worst and make you take a look in my eye!\nSo you could witness the extreme damage caused by betrayal\nMake you sorry for the fact that you attempted and failed!\nMake you eternally suffer, you was one of my mens\nTurn your back on me, and I'mma make sure you get it back times ten\nStay TRUE -- now that's the one thing I religiously pledge\nIf you ain't wit me I'mma throw you WAY over the edge\nTHIS MEANS WAR!!\n\n[Chorus: Ozzy Osbourne]\nTake a look inside\nYou can run and you can hide\nIf you cross my path\nI'll make sure you feel my wrath\nGive and you receive\nCherish every breath you breathe\nScriptures on the wall\nThose who betray all must fall\n\n[Verse 2: Busta Rhymes]\nAs I cherish every blessing and I greet you with hugs\nYou my peoples when I see you I embrace you with love\nYeah I be the one to come and get you out of the hole\nYeah you be the one to run and leave me out in the cold\nSo amazing how many times you plot and you scheme\nBut what you don't realize, you'll never conquer my dream\nThough devilish karma can't penetrate the steel in my armor\nTime passed, my oppression got you living with drama!\nParanoid of my retaliation, living in fear\nDisloyalty will have me kill my brother, sheddin a tear\nSuch a shame how you could easily get trapped in a zone\nAnd have to go to war with FAKE niggas standin alone\nUntil I get with all my loyal niggas goin the length\nDon't matter how hard you try you never weaken my strength!\nNow I'm with all of my loyal niggas, breakin the bread\nAnd if you diss the code of honor we takin your head;\nTHIS MEANS WAR!!\n\n[Chorus: Ozzy Osbourne]\nTake a look inside\nYou can run and you can hide\nIf you cross my path\nI'll make sure you feel my wrath\nGive and you receive\nCherish every breath you breathe\nScriptures on the wall\nThose who betray all must fall\nNobody helps them\nNow he has his revenge\n\n[Verse 3: Busta Rhymes]\nWhatchu gon' do? Whatchu gonna do?\nWhere you think you can run, or you can hide?\nWhere you think you can run, or you can hide?!!\nWhere you think you can run, or you can hide?!!!\nWhere you think you can run, or you can hide?!!!!\nI'mma BE the best to show love let's co-operate\nDisloyalty is somethin that we won't tolerate\nDeal with these niggas, let's put them where they properly go\nOn the Island far away in a place where NOBODY know\nSo long fightin the bullshit for so many years\nWatchin the danger and niggas double crossin they peers\nYes I always fight for what is right and put my foot down\nDisrespect my love, I'mma be LAYIN YOU DOWN\nTHIS MEANS WAR!\n\n[Chorus: Ozzy Osbourne]\nTake a look inside\nYou can run and you can hide\nIf you cross my path\nI'll make sure you feel my wrath\nGive and you receive\nCherish every breath you breathe\nScriptures on the wall\nThose who betray all must fall", "image": "https://images.genius.com/74d986e571f31c27df8d6f3000e2079f.500x500x1.jpg"}], "artist": "Busta Rhymes"}