{"songs": [{"title": "Dream / Southern Hospitality / Partna Dem", "album": "STN MTN / Kauai", "year": "2014-10-03", "lyrics": "[Part 1: Dream]\n\nI had a dream I ran Atlanta, and I was on every radio station\nAnd 107.9 was 97.5 again\nAnd they played me at Golden Glide on Friday\nAnd they played me real loud on the street\nWe drive up Memorial Drive, up Wesley Chapel\nI reopen 112, and Jazzy T's\nI'd bring back Turner Field. I fire all the cops in Cobb county\nChick-Fil-A will be open on Sundays\nI bring back LaFace Records, Freaknik, Kilo Ali, Lou\nI get J.R. Crickets some Spelman girls with big booties\nI reopen SciTrek, strippers will get Mother's Day off\nAnd I'd have my own Gangsta Grillz mixtape\n\n[Part 2: Southern Hospitality]\n\n[Intro]\nHey, this is Steve Smith from American Dad\nAnd this is Royalty\n(Stone Mountain)\n\n[Interlude: DJ Drama, Childish Gambino]\nThis what y'all been waiting for?\nIn Gambino we trust! (Gangsta!)\nRoyalty is forever\nDJ Drama is forever (Gangsta Grillz!)\nY'all ready? (yeah)\nGambino! (yeah)\nGet em!\n\n[Verse 1]\nI ain't no snitch, cops, I don't trust 'em\nI ain't no bitch, all I do is run 'em\nI ain't—I ain't no snitch, cops, I don't trust 'em\nI ain't no bitch, all I do is run 'em\nNigga, I was stuntin', keep that shit a hundred\nIf it ain't about the money, then it's not up for discussion\nIf it ain't about—\n\n[Interlude: DJ Drama, Childish Gambino]\nAfter selling out the Georgia Dome 3 nights in a row\nAfter selling 10 million copies of his newest album\nRoscoe's Wetsuit in one week!\nAfter successfully petitioning to recarve his own face into Stone Mountain (yeah, yeah) (Stone Mountain)\nHe's still givin' you niggas a free mixtape?\nWhy, Gambino? Why young guy? Why so generous?\n\n[Verse 2]\nI ain't no snitch, cops I don't trust 'em\nI ain't no bitch, all I do is run 'em (It's Royalty!)\nNigga, I was stuntin', keep that shit a hunnid\nIf it ain't about the money then it's not up for discussion\nIf it ain't about progress, ain't about success\nWhy this nigga suspect? You ain't seen sus' yet\nI'ma fuck the game so hard like Tiffney\nNiggas taking shots, I'm like \"Nigga, don't tempt me\"\nI seen what you make, yeah, them shows sold out\nBut you doing clubs and I'm doing like all out things\n\"Why the hell he rapping if he all out sings?\"\nRoyalty the movement, we all out kings\nFor real, Bino on a mission\nWe are not friends, nigga, this is business\nGirl, this my dream, ain't no split decisions\nWatch me cut this bitch off, I'ma need some scissors\nMama in the kitchen, hot sauce on them chitlins\nI was always spittin', just that no one else was listening\nGot your girl and now we kissing, she attracted to my vision\nNow she see what she was missin', now she act a little different\nTelling you she need some distance\nYeah, come on over, we can talk about it\nNow this nigga mad, yeah, he thought about it\nBut he don't really want it, semen on her stomach\nThat's a second coming; Jesus\nFlow so genius, can't low-key this\nPuffin' on a swisher like a ho smoke penis\nThey want me Uncle Remus, but I'm just flexin' on 'em\n\n[Part 3: Partna Dem]\n\n[Intro]\nThis on some old Atlanta shit. But I like it cause, it's not about what you know, but who you know. Know what I'm saying?\n\n[Verse]\nRoyalty my partna dem, no one else my partna dem\nStay strapped with that arsenal\nThese niggas winnin', it's hard to tell\nMove over, we about to take over\nSlide up in them DMs, her nigga didn't even notice, I'm focused\nYeah, I'm the man of the hour\nPlay me on Power, play me on Hot\nNigga I'm hot, nigga don't stop\nFlow so cold put a cherry on top\nHaters so mad, he ain't even know why, probably all the autonomy\nFuck all your feelings, I'm proud of me\nHead was so good it's psychology\nGod damn, I'm just being who I am\nFrom that weird ass little kid to this ballin' ass grown man\nMan this beat is going so HAM, flow been burr since Novem'\nChain been burr since Novem'\nThat means cold, I'm just sayin', we ain't playin'\nIf your man don't want to lick it, I volunteer as tribute\nYou niggas on them Hunger Games, I'm eating Os like onion rings\nI kill them hoes so constantly, I ain't even gotta sugar coat it\nSee them titties, wanna motorboat it\nI'm Dopaliscious like SpottieOttie\nY'all don't know me, run the world\nTurnin' up like that little girl, like, ayy-ayy-ayy-turn up\nTell them niggas it's tax season\nAtlanta Georgia, that's black Sweden\nI'm such a martyr, die for the game\nI'm such a MARTA I'm runnin' trains like whoo\nSlow that shit, felt that shit\nLet me hear it", "image": "https://images.genius.com/77a2349de407b4d4690746b19b39f6dc.500x500x1.jpg"}], "artist": "Childish Gambino"}