{"songs": [{"title": "All My Men", "album": "Maximum Strength 2008", "year": null, "lyrics": "[KRS-One]\nWoooooooooo!\nWhere my men at? Real dudes\nWhere you at? Look\n\n[Hook: KRS-One]\nMe is a mon, understand, not a passin trend\nMe is a mon, understand, we provide and defend\nMe a mon with a plan, my love it never ends\nI'm callin - all my men, ALL MY MEN~!\n\n[KRS-One]\nAll my men that be holdin down they house and they spouse\nMen, y'all know what I'm talkin about\nReal men, providin for the kids, no doubt\nHolla out, 'gwan shout, you the man of the house\nMen! In my opinion if we gonna start winnin\nF'real, we gotta respect women\nEvery mister, hug your sister, it's the\nTime to support your woman and not diss her\nIt's the, teacher, overstand\nI'm like a preacher, reachin your upper man\nMan, many don't understand\nHow important it is to have a plan\n\n[Hook] - repeat 2X\n\n[KRS-One]\nAll my men that be holdin they house down, true workin\nAll my men that be holdin they spouse down, for certain!\nYou spread love when you drivin around town, not jerkin\nYou a healer, you take away what's hurtin\nCause if a man can't do what a man plans to do, his purpose\nThen a man makes plans with empty hands, he's worthless\nHe can't even understand the plan\nWhat the second or the first is\nLet me verse this or reverse this statistic\nWe gotta think futuristic\nStrategic, logistical and even mystical\nWe need a new ritual\nI'm tired of jumpin over buildings\nAnd havin to stop to hold adult hands like children\nC'mon, you can do it, c'mon\nAnd when they get paid then they quickly run along\nThis ain't just another song\nThis is that fruit that reveals the right from the wrong\nIt won't be long here, before the storm's here\nAnd real men are gonna have to be strong\n\n[Hook] - repeat 2X\n\n[KRS-One]\nBe a MON, stand on principle\nJust be a MON, let God live in you\nJust be a MON, walk in the spiritual\nMetaphysical, political, lyrical\nJust be a MON! Understand you not a passing trend\nAnd this is the end", "image": "https://images.genius.com/8e8d71ccffef56195f7ad1ad515b3f54.640x640x1.jpg"}], "artist": "KRS-One"}