{"songs": [{"title": "Famous Remix", "album": "Priorities 4", "year": "2016-02-21", "lyrics": "[Intro: Rihanna + Kanye West]\nMan I can understand how it might be\nKinda hard to love a girl like me\nI don't blame you much for wanting to be free\nI just wanted you to know\nSwizz told me let the beat rock\n\n[Verse 1: Kanye West + Swizz Beatz]\nFor all my Southside niggas that know me best\nI feel like me and Taylor might still have sex\nWhy? I made that bitch famous (God damn)\nI made that bitch famous\nFor all the girls that got dick from Kanye West\nIf you see 'em in the streets give 'em Kanye's best\nWhy? They mad they ain't famous (God damn)\nThey mad they're still nameless (Talk that talk, man)\nHer man in the store tryna try his best\nBut he just can't seem to get Kanye fresh\nBut we still hood famous (God damn)\nYeah we still hood famous\n\n[Hook: Rihanna]\nI just wanted you to know\nI loved you better than your own kin did\nFrom the very start\nI don't blame you much for wanting to be free\nMaybach Music\nI just wanted you to know\n\n[Verse 2: Rick Ross]\nThe furnace, fires, fortunes, and the fumes\nThe aura arrogance is been known to fill the room\nBoom, little nigga who are you?\nRoc-A-Fella Records on record to kill a crew\nVegas in my palms a don like the [?]\nOnly one with beat taste from Kanye on my momma stew\nFor the ye I've been known to be Karmaloop\nMalcom X in his head say my name and here come to troops\nHands out my pocket I cock it and let it loose\nAnd Dame was spilling Armadale on a nigga boots\nMartin Luther King's real estate was a dream\nFarrakhan's farm was one that I once seen\nThe final call dogs stay on your dean\nFragrances Agent Provocateur stay on my queen\nMind your business the killers can intervene\nI'm half naked in the GQ magazine\nTours looking like its wrestlemania\nI'm The Rock setting fires to the stadium\nBurn it down then I'm off to anther beat\nMight get engages to a freak just for a couple weeks\nSomething I can't afford\nIf you not a playboy that's something I can't endorse\nWin, lose, or draw William living like he Biggie Smalls\nBalling its tax season I was born to be a boss\nSee that your face froze\nBobby Brown lockjaw, Whitney Houston in the ghost\nCoogie and Cartier causalities of the fame\nYour bitch MCM she even tagging my name\n\n[Bridge: Sister Nancy + Swizz Beatz]\nBam bam, bam bam\nBam bam dilla, bam bam\n'ey what a bam bam\nHow you feeling right now? Let me see your lighters in the air\nBam bam dilla, bam bam\nBam bam eh\nBam bam, bam bam\nLet me see your middle finger in the air\nBam bam, bam bam\nBam bam dilla, bam bam\nLet me see you act up in this motherfucker\n'ey what a bam bam\nBam bam dilla, bam bam\nHow you feelin', how you feelin, how you feelin' in this mother fucker, god damn\nBam bam\nOne thing you can't do is stop us now\nBam bam, bam bam\nBam bam dilla, bam bam\nYou can't stop the thing now\n'ey what a bam bam\nMan it's way too late, it's way too late, it's way too late you can't fuck with us\nBam bam dilla, bam bam\nBam bam, bam bam\nBam bam, bam bam\nTo the left, to the right\nBam bam dilla, bam bam\nI wanna see everybody hands in the air like this\n'ey what a bam bam\nBam bam, bam bam\nBam bam dilla, bam bam\n\n[Outro: Nina Simone]\nI just wanted you to know\nI loved you better than your own kin did\nFrom the very start\nI don't blame you much for wanting to be free\nI just wanted you to know", "image": "https://images.rapgenius.com/d371dba5e344794a959d205a2a8375d2.260x260x1.jpg"}], "artist": "Rick Ross"}