{"songs": [{"title": "A Little Somethin’", "album": "14 Shots to the Dome", "year": "1993-03-30", "lyrics": "(LL Cool J)\nHere we go - another funky style\nPeace to my brothers on \"Rikers' Isle\"\nIntroducin' the crew, that's goin' a mile\nSo get behind the ropes, stop actin' wild\nThis here part is like section one\nSo you can bugaloo and set fire to your buns\nEarly mornin' light is yet to come\nAnd when it come, we can boogy in the sun\nFemales, let your hair down\nCause this is how we do it when we go uptown\nWith the funky sound, the razzamatazz\nYou give me to the \"sploshers\", you can get your-a blast\nEnter at your own risk - some brothers got weapons\nYet you're still steppin', the beats' so funkafied\nAnd answer to the bone, people'll be dancin' alone\nLeanin' on the wall next to grandma's mop\nWith the funky, funky groove that's far from pop\nDosey-do your partner all night long\nAnd all you mothers, bring your kids along\n\n(Chorus: LL Cool J)\n(Yo Uncle) whassup, whassup?\n(Yo Uncle) yeah, I do a little somethin'\n(Yo Uncle) whassup, whassup?\n(Yo Uncle) Huh, I do a little somethin'\n(Yo Uncle) whassup, whassup?\n(Yo Uncle) yeah, hah, I do a little somethin'\n(Yo Uncle) whassup, whassup?\n(Yo Uncle) (just kick a little somethin'...)\n\n(LL Cool J)\nAin't no mountain high enough to overcome this\nFunky-like type of stuff\nThe feds are ridiculous, they call my bluff\nBut my wrists are too skinny to hold me with cuffs\nI got the sure-shot guaranteed mover\nSuck it like a hoover and do ya whole maneuver\nDon't stop till you get it on\nWith ya head beboppin' like a bouncy ball\nThey do it in the park, they do it in the mall\nBut when I do it, yeah, I'm doin' it for y'all\nAsiatic, automatic, your funky fanatic without no static\nFlippin' on the freak like I'm acrobatic\nYou were searchin' for the funk and I had it\nHere we go, hand over the cash yo\nWhat chime? Aiyyo, pass the Tobasco\nWork your body like a dime, oh no\nDo the freaky-deaky - the whole girls' cargo\nFemales on the side - we gotta win 'em, yeah\nThe back pockets are stuck with nothin' in 'em, yeah\nExcept my beeper number, rubbin' all my lumber so I cannot slumber\nMakes me sick like a earthquake\nSo do the baddy-too-true, we got cash to make\nAble body, ready to party, all the ladies in the house\nMust be eatin' hardy\nAnd provin' and movin', groovin', so soothin'\nGood for ya and clinically proven (Damn!)\nEvery little bit of the tip makes ya taste flip, like sugar on Ritz\nGet on down, to the sure-shot sound\nCause all five burrows are rockin' uptown\n\n(Chorus: LL Cool J)\n(Yo Uncle) whassup, whassup?\n(Yo Uncle) yeah, I do a little somethin'\n(Yo Uncle) whassup, whassup?\n(Yo Uncle) whattup, hah, I do a little somethin'\n(Yo Uncle) whassup, whassup?\n(Yo Uncle) yeah, hah, I do a little somethin'\n(Yo Uncle) whassup, whassup?\n(Yo Uncle) aiyyo, aiyyo (just kick a little somethin'...)\n\n(LL Cool J)\nPump up the nasty, nasty, nasty sound\nKick back and let it please ya like a rub down\nPut ya body in the lost and found\n(Kick that L) I love the way its goin' down\nWhat you see is what you get\nIn other words, who's next to be the teachers pet?\nDown-home monkey - corn fed, original\nAnd what you do is up to you, the individual\nThis is the place to be for all ya underage brothers\nWith the rebel mentality\nSweet young freaks sayin \"Rock me Amadeus\"\nSkin so smooth lookin' all (cadme-ish??)\nVideo to video, tape to tape\nWalkin' through the jam in search of a playmate\nParty is packed like a rich man's fridge\nToo many people in the crib\nThe situation is sweaty and crazy like Eddy\nAnd yes we are ready to funk it up steady\nAin't nothin' here petty\nStrip down to your lingerie - I'm ready!!\nHold your horse, and baby feel the force\nAnd get yours off - no matter what the cost\nCome out your clothes, get hot like a stove\nEarly in the mornin', we're dancin' in robes\nTo a funkified sweaty, greazy groove\nAnother Marley remix to make you move\n\n(Chorus: LL Cool J)\n(Yo Uncle) whassup, whassup?\n(Yo Uncle) yeah, I do a little somethin'\n(Yo Uncle) whassup, whassup?\n(Yo Uncle) I do a little somethin'\n(Yo Uncle) whassup, whassup?\n(Yo Uncle) peace out, hah, I did a little somethin'", "image": "https://images.genius.com/e280045bd851825ad1c5570d3eb2a6f6.999x999x1.jpg"}], "artist": "LL Cool J"}