{"songs": [{"title": "Strangeulation Cypher (All Parts)", "album": "Strangeulation", "year": "2014-06-03", "lyrics": "Hmm…Tech N9ne!\n\n[Tech in sing-song voice]\nSmashes, the masses\nBut the industry’s hatin’ asses\n\n[Verse 1: Tech N9ne]\nStrange days, when your favorite rapper’s poppin’\nBut is he on top is something you can’t gauge?\nEspecially when he’s toppin’ the charts\nAnd you see me, K. Lamar, and Macklemore sharing the same stage\nI’m the nigga all these artists look up to\nYet for Tech it’s been the hardest to bust through\nBut I keep my fans fiendin’ like clucks do\nYou don’t like how we live it, well…\nI dominate, your conglomerate Wanna beating?\nI can accommodate It’ll be a non-debate, coming up against Aaron the Great\nSo many got arms, legs and necks tatted\nStrange Cause music, show, conceptually I’m the best at it\nLet’s have it for all of these Tech addicts\nAny disrespect to family will get your chest gatted\nAimin’ at ’em and its agony\nBurner blew his brain and back and these\nCannons came and caved in cavity, caliber connect, cap it\nYo, there it go, red is in my head it grow\nHeaded fo’, lead and deaded, yeah the medic said it so\nLet it grow, shred it and get no credits, so pathetic though\nDread embedded steppin; in heaven’s crevice, wet and edible\nGive her the shivers when I deliver this\nHit her then quit her cause she’s on Twitter shit\nAnd when she compare me to Eminem\nI said I’m different She said “How?” I said I’m black and I can say 'nigga' bitch!\nTo him I may just be another bro with a flow\nWe’ll probably never tour cause it’ll be thousands of Juggalos at his show\nAnd I heard fatalities happen on each side, so that’s never no let it go\nSo I get it, I keep what I’m makin’ incredible, all of them scared of a negro\nStrangeulation, this occupation so scandalous\nWe stop the hatin’, no chances\nWhen I rock the nation so Danzig\nI’m killing all these niggas, Operation Code Kansas\nStrange gang plain triggered assassins\nGot a bunch of untamed aimed trained spitters a’ blastin’\nMy insane brain sayin’ give up the rappin’\nAnd go back to the gang bang thang, nigga what’s happenin’, soo-woo\n\n[Verse 2: Godemis]\nDeevil!\nPrayin’ that 12:12 for hell Felon to sell and slept on a bed of nails Like nothing I’ve ever felt\nGhost in a shell, was molded with other demons\nAs if I needed some help Or a host to preserve the heathen\nGot it, my brain is rotted\nI swear to God that I’m not it I’m set to go to the gallow as soon as the rope is knotted I ain’t high as the fire and I have unused adrenaline\nCame in the cypher clean, still smelling like putrid cinnamon Then I’m in, enemy of the state, I’m straight at an angle\nStop risking and quit your bitchin’, it ain’t like I’m raping an Angel Said I was magnifique, ya’ll fuckin’ with it, capiche?\nNow the safest you woulda thought with a devil under your feet\nThey throw a shot and then sit back and wait for some reaction\nAin’t nothing to it but to do it; i’m a mummy rappin\nSo get to clappin or dissin the clan you’re hatin\nListen the man is Jason and this is the Strangeulation\n\n[Verse 3: Stevie Stone]\nStevie Stone I’m on it I’m so clever\nNobody comparing ’em better I put shit together\nAmerica’s most elaborated rap pick yo head up\nSmall talkin’ to get you wet up Yeah\nI’m will to kill all you niggas\nThe feelin’, adrenaline that’ll spillin’ a milli yeah I mill’ all you niggas\nAin’t even reach out they climax rather my sillin’ on niggas\nAnd backin’ a back on back can’t billy you niggas\nGet busy on niggas This ain’t no random some leekage\nStonie in the building the bitches pull out their cleavage\nThe snake and the bat you see them prominent features\nThe spieces Strangeland we rain on your region\nMeatwagon I come I be taggin’ ’em\nBaggin’ ’em bring ’em clusters of three\nGot three magnums gaggin’ em out\nYou pussies is still talkin’ I’m draggin’ ’em out\nI’m tappin’ ’em out\n\n[Verse 4: Murs]\nAww shit, they fucked around and signed a backpacker\nSmart, rich, handsome, plus he’s not a bad rapper\nI’m just a little local talent that fucked around and made it big Underground bully, pickin’ on all these famous kids\nAnd the danger is, now I’m doin’ Stranger biz\nAbout to make the world forget about what a major is Independent Powerhouse, running all these cowards out\nMy enemies are all forgotten, wishin’ I would shout em out And I don’t want to hear a rapper harmonize unless\nHe's thuggish, ruggish, Lazy, Krayzie, Bizzy, Wish or Flesh\nBut maybe I’m just hatin’ cuz my black ass could never sing Fuck that autotune I hope the Futures filled with better things And you a fucking liar! If you say you found a better team Impossible! Like trying to fit my dick inside my wedding ring And all the bread it brings will be distributed and properly\nI represent for hip hop not some fucking aristocracy\n\n[Verse 5: Wrekonize]\nWrapped in XLR cables Up from my whiskers, down to my fuckin’ kicks\nWreck-O was echoed in Gordon Geckos You suckin’ dick Nobody be askin’ me for secrets I ain’t chuckin’ tips I’d rather be bumpin’ hips\nOn that ratchet with muffin tits Tore up the limits\nFrom Britan visions would rock their lives\nInside a prison where giddy bitches don’t jock the rhyme\nBorn in precision on rhythm spittin’ could swat a fly\nFor them to just kick a single shillings from Spotify\nBye, Bye killers On a high five business\nGonna ride by the sickest In your high ride to the hitlist\nIf we ain’t spoke in ages\nThen miss me with broken favors, you Miley Cyrus teenagers\nYou twerkin’ on swollen razors (run now)\nDon't make me come to dinner nail your tongue down\nAnd have you plead your case to us\nAt Strangeland at sundown Be careful of the biz\nCause everything has got a price attached\nWake up with a horse head in your bed\nAnd next your life is snatched\n\n[Verse 6: Bernz]\nTank full of petrol Bank full of pesos\nPool on my tour bus Bonus on a payroll\nFeel like I be killin’ it Famous on the internet\nReally I’m just wingin’ it Cookin’ shit on my Kitchenett\nLife so good Right now I need to celebrate\nBout to sell a stadium out And turn it into rave\nLook at how the industry norm Has started lookin’ Strange\nAll my brothers riding the storm While they just ride the waves Caviar wishes Bitches for my bitches\nBlack shades and hoodies And spots and white linens\nFeel like Sam Kinison Preachin’ to these citizens\nScreamin’ at the saints You ain’t ever gonna get rid of us Guessin’ that I just cleaned my plate So now I’m gettin’ cake Speedin’ down the interstate Yellin’ get out the fuckin’ way\nWe plant flags in the ground Because we here to stay\nAnd bring my whole hood out And have my own parade\n\n[Verse 7: Kutt Calhoun]\n(Black Gold!)\nI purposely wrote this verse Just to murder, dismember, defecate\nDisassemble the limbs Of a nigga who try and separate Artistry from nonfiction Im sent with a conviction\nTo sentence you pons Givin’ the benz on my diction\nThere he goes Speakin’ bout how he murk a beat\nSmellin’ himself Why else would he flaunt about it so verbally Dance around me Like I was a paraplegic\nIn a do-si-do competition\nLookin pissed like I never heard of feet\nYadda Yadda A whole lotta yappin’\nAbout my rappin’ When I’m the captain Of crunchin’ you niggas milky dreams Im the comparison of Pac’s face Staring in your face Mock razor blades cut Leave you crispy clean\nDon’t ask Tech Ask me if it’s questions Guarantee that he tell you\nThat I’m the best And Im destined To find a snake and a bat Helpin’ Kansas City’s progression Hopin’ I hurt the feelings Of whoever second guessed it Cause everybody talkin’\nImma make you niggas hear me\nMind control flow Now: listen till your ears bleed\n\n[Verse 8: Ubiquitous]\nSpit it sicker than these sycophants\nKeep your dick up in your pants\nYou were blunted on the block\nMe? I had some different plans\nI’m trying to get to France\nSniffing grams\nHit a branch\nIndependent Powerhouse\nVibin' out with the fans\nWaking up in different cities Every night\nGetting grands\nStay prepared for this\nI’m bearing witness to this sinner man\nStripper dance with cinnamon\nClubbin’ with my gentlemen\nDrink away the nights events\nNothing worth remembering\nSquad will run up in this bitch\nMobbin’ like some immigrants\nJack you for your paper stack\nRob you of your innocence\nTaping of the scene of crimes\nSwabbing for my fingerprints\nThought about my life\nYou thought the same And couldn’t think of shit\n(Ha!) This type of fire dont extinguish\nNow write about some bigger shit\nYou’re striking out\nSwing and miss\nRing around the Rosie, homie\nPocket full of pain\nKeep a lock up on my lane\nAnd triple optic in my brain, look\n\n[Verse 9: Prozak]\nMy brain is full of thoughts that are darker than Samhain\nThat span across the Great Lakes and vast Midwest Plains Spreading coast to coast like a virus you can’t contain\nNow a global pandemic, panic courtesy of (STRANGE!)\nThe biggest independent label pop the champagne\nWe don’t need no head now, homie you can keep the change Coming through your speakers, receive us into your blood vein We the truth like Nostradamus’ prophecy quatrains Snake Bat, Praise that, part of rap since way back\nSince the days of 8 tracks and 808’s and adats\nAnalog cassette decks, steady grinding, what’s next?\nStarving artist ’til Trav and Tech cut me that advanced check Strange outcast step child, call me Damien\nFive Finger Death Punch straight to the cranium\nFlow so sick, could be enriched with uranium Extraterrestrial, lyrics labeled alien\n\n[Verse 10: Krizz Kaliko]\nKALI BABY! ‘Ight man Ima do this!\nI’m kinda nervous The purpose of having a cypher is so you can sit here wide-eyed Listen look at me in this position\nNow I coulda just left you sitting there\nBut Nina told me to pick ’em apart you’re a victim of art\nK-R-I to the double crooked, look at him he pudgy like they Took an ugly stick and frickin’ shook at him, (OKAY)\nAnd I don’t stay gucci down to the linens I’ll let you trick off, she jerking my dick off and grinnin’\nYou can see him, but he just a figment\nYou wanna be him, better get your pigment gone\nTry to beat him with deliverin’, I get belligerent\nAnd that’s the end of the song\nAnd I get a little bit ahead of myself\nFeel like I’ma melt, and I feel like I’m better than everyone else I guess I be rappin’ ahead of my wealth\nI’m the coldest thing since the ice cube\nOnly thing missing from this beat back in the day was Ice Cube (OKAY)\nYeah I said I’m the best and I meant it , Nigga what?\nOnly niggas that could contest it is rested, dig em up!\n(Okay! Hahaha whatever nigga.)", "image": "https://images.genius.com/a97c6b9421fc6142eef43b7f37277096.500x501x1.jpg"}], "artist": "Tech N9ne"}