{"songs": [{"title": "A Kiss", "album": "Hell: The Sequel", "year": "2011-06-14", "lyrics": "[Intro]\nI want a kiss, kiss, kiss\nI want a kiss, kiss, kiss\nI want a kiss, kiss, kiss\nI want a kiss, kiss, kiss\n\n[Verse 1: Royce da 5’9”]\nNickel Nina nigga Twitter beefing, first rapper to shot a fan\nGucci's my absolute state of mind like Waka's man\nChopper/s spraying, getting head in a car parked, new Gallardo\nThis bitch sucking my dick today, call it yesterday's news tomorrow\nStretch a nigga out, I'm the new Tae Bo, 'bout to cross over, I'm the new Ivo\n'Bout to saves a couple of these bitches\nThat's right, I'm the new Bible\nYou? You five-o. Me? I'm more grounded than punishments\nBut I'm too fly though\nY'all niggas be whining, I should call you Moscato\n\n[Verse 2: Eminem]\nLook down at the floorboard\nIt looks like someone left a pair of stiletto shoes in my Tahoe\nNever know just what type of a ho inside of my ride I may let\nLast night went to 5 a.m. and she ain't even recover from last Friday yet\nHoes all over the ride like it's an ice cream truck\nI can see why they fret\nI already ran over two hoes\nAnd I ain't get out the fucking driveway yet\nSoon as I open the door you try to resist\nWhat for? Get in girl, don't front, shorty\nYou're fighting an un-winnable war, it's useless\nAs tits on a boar or little tits on a whore\nGot 'em acting like spoiled brats kicking and screaming\nLike little kids throwing fits on the floor\nGet in the whip, but you ain't turning this frog into a prince\nWhy you tryna keep convincing me for?\n\n[Chorus: Female Vocalist and Eminem]\nI want a kiss, kiss, kiss\nYou won't get one\nI want a kiss, kiss, kiss\nNot from me\nI want a kiss, kiss, kiss\nNot on the lips, are you crazy?\nI want a kiss, kiss, kiss\nMaybe the cheek but that's all you gon' get from me\n\n[Verse 3: Eminem]\nNow you in my whip just as long as you understand that I can't be whipped\nYou say companionship, I say abandon ship\nI'm a gigolo, so you know I'm always on the go\nI don't got no time to slow down for no relationshit\nDrop the P and add a T\nYeah, you can get mad at me all you want\nBut I'm ghost before you can even say, \"Boo,\" hun, let alone call me one\nA one night stand is all he wants with a female fan, yeah, one like Stan\nAnd he's so 'bout a one nightstand\nHis bedroom has two lamps and only one nightstand\nGet the hint?\nOoh yeah boo – ew\nI ain't finna argue, but why do you think they call it boo?\nYeah, 'cause the sound of it s'posed to scare you\n\n[Verse 4: Royce da 5’9”]\nOh, ho, we can share you in the back of the McLaren\nI don't give a fuck what your name is\nWe gon' call you \"Hi\" and \"Bye\"\nHope you bi, in the meantime your name is Sharon\nSlows the flow down so I can what?\nTell you same face I make\nWhen I'm shooting the gun's the same face that I make when I fuck\nFrom the back of my hand on your neck\nPressing your face against these sheets, it's insane\nYou VIN changed\n'Cause I'm outta this world, girl\nI got that Milky Way dick vein\nI'm at an all-time high with highness\nI'm at an all-time fly with flyness\nAnd this is exactly what they say when they bow to your highness, yeah\n\n[Chorus: Female Vocalist and Eminem]\nI want a kiss, kiss, kiss\nYou won't get one\nI want a kiss, kiss, kiss\nNot from me\nI want a kiss, kiss, kiss\nNot on the lips, are you crazy?\nI want a kiss, kiss, kiss\nMaybe the cheek but that's all you gon' get from me\n\n[Verse 5: Royce da 5’9” & Eminem]\nNickel Nina nigga Twitter beefing, first rapper to shot a fan\nPush a chick out the car while it's moving like Waka's man\nHer bottom's dark, but her top is tan, her private parts\nGot her on the pole, like the opposite of her papa's plans\nCome on stripper, let's hit the strip, 180, throw it in reverse\nAnd drop the trans, I'm in the trance, now look at this bitch dance\nLooking at this tramp like, \"What are you wearing, girl? Quit playing\"\nYeah, bitch and them scratch and sniff pants\nWell let me scratch 'em\nLet me sniff, yeah\nWhat? Did I say that? I'm on lean like Styrofoam cups and kickstands\n\n[Verse 6: Eminem]\nMiddle finger stuck on fuck\nStiff hands, but, girl you got a butt like no if ands\nSo yeah, what the hell, maybe\nAll hail Shady, he'll tell it like it is\nSo tell Katy Perry he's on her tail, he's tailgating\nThese bells are my mating call and I'm here\nBell's waiting, and tell Lady\nGaga, she can quit her job at the post office, she's still a male lady\nWouldn't fuck her with her dick, you heard it, the verdict's in\nHe's allergic to divas and take meat cleavers to 'em\nHim don't give a damn about beaver do him\nWhat a demon, a behemoth evil just seems to be seething through him\n\n[Verse 7: Royce da 5’9”]\nI like the little strip tease you doing this evening\nYou and me gon' find three more chickadees and have a menage like Nicki\nYou hot like a Dickie outfit in Texas without shit under it\nSweating, suck my dick or get to stepping's my logic\n\n[Verse 8: Eminem]\nMy God trick, my dick is hard, as stiff as a yardstick\nWhat are we gonna do?\nRide around 'til we're carsick?\nI'ma put this shit in park like dog shit\nAnd you can blow me in the dark\nIn the parking lot of the trailer park by the garbage\nWhat're you waiting on, me to roll out the carpet?\nCondoms are in the glove compartment, let's start it\nThink I'm joking?\nWhat, am I sitting here tryna make fake farts with my armpits?\nTryna get you to spit pop through your nose?\nAm I here to amuse you? Stop it\n\n[Verse 9: Royce da 5’9”]\nI'm in your pocket outside of a church\nThe other hand reaching for the bottom of your purse\nYou giving me head in a boxing stance\nMy dick's so big you could drop it in dirt\nI'm not your man, we sparring partners\nThere's five things you are in charge of\nThat's: sucking the dick, sucking the dick\nSucking the dick, sucking the dick, sucking the dick\n\n[Verse 10: Eminem & Royce da 5’9”]\nAnd if you ain't sucking a dick, why you sitting there\nWith puckered lips? Oh that's collagen, muhfuckin' bitch\nWhat you mean how'd you get suckered into this?\nYou gon' jump into my truck and then try to get truculent\nYou should be suffering, you should be cooking\nYou should be buckling your seat belt with oven mitts\nExcuse me while I'm making an ass out of myself\nBut it's only because I just wanna get\n\n[Chorus: Female Vocalist and Eminem]\nI want a kiss, kiss, kiss\nYou won't get one\nI want a kiss, kiss, kiss\nNot from me\nI want a kiss, kiss, kiss\nNot on the lips, are you crazy?\nI want a kiss, kiss, kiss\nMaybe the cheek but that's all you gon' get from me\n\n[Outro: Royce da 5’9”]\nNickel Nina nigga Twitter beefing, first rapper to shot a fan", "image": "https://images.genius.com/e46d8c5b81dd5cfba852666c93111bef.1000x1000x1.jpg"}], "artist": "Bad Meets Evil"}