{"songs": [{"title": "What More Can I Say", "album": "The Black Album", "year": "2003-11-04", "lyrics": "[Produced by The Buchanans]\n\n[Intro: Russell Crowe from Gladiator]\n\"Are you not entertained? Are you not entertained?\"\n\"Is this not why you are here?\"\n\n[Interlude: Jay-Z]\nTurn the music up, turn me down\nGuru, let's go get 'em again\nThis time it's for the money my nigga\nBrooklyn, stand up\n\n[Verse 1: Jay-Z]\nThere's never been a nigga this good for this long\nThis hood or this pop, this hot or this strong\nWith so many different flows, this one's for this song\nThe next one I switch up, this one will get bit up\nThese fucks, too lazy to make up shit, they crazy\nThey don't, paint pictures, they just, trace me\nYou know what? Soon they forget where they plucked\nTheir whole style from then try to reverse the outcome\nI'm like, \"TAA!\"\nI'm not a biter, I'm a writer for myself and others\nI say a B.I.G. verse, I'm only biggin' up my brother\nBiggin' up my borough, I'm big enough to do it\nI'm that thorough, plus I know my own flow is foolish\nSo them rings and things you sing about, bring 'em out\nIt's hard to yell when the barrel's in your mouth\nI'm in, new sneakers, dual-seaters, few divas\nWhat more can I tell you? Let me spell it for you:\nW-I, double-L, I-E\nNobody truer than H-O-V\nAnd I'm back for more, New York's ambassador\nPrime Minister, back to finish my business up\n\n[Chorus: Hum-V]\nWhat more can I say?\nWhat more can I do?\nI gave this up to you\nI know this much is true, true, true\nMy love\n\n[Break: Jay-Z]\nWhat more can I say to you? You heard it all\n\n[Verse 2: Jay-Z]\nYou already know what I'm about: flyin' birds down South\nMovin' wet off the step, purple rain in a drought\nStuntin' on hoes, brushin' off my shirt\nBut ain't nothin' on my clothes 'cept my chain, my name\nYoung H-O, pitch the yay faithful\nEven if they patrol, I make payroll\nBenz paid for, friends they roll\nPrivate jets down to Turks and Caicos\nCris' caseloads, I don't give a shit\nNigga, one life to live, I can't let a day go\nBy without me bein' fly, fresh to death\nHead to toe 'til the day I rest\nAnd I don't wear jerseys, I'm 30-plus\nGive me a crisp pair of jeans, nigga, button-ups\nS. Dots on my feet make my cipher complete\nWhat more can I say? Guru, play the beat!\n\n[Break: Jay-Z (Hum-V)]\nMy nigga, hahahaha, woo!\nWe gon' let this ride into the hook\n- I'ma snap my fingers on this one\nWhat more can I say to you?\n- Get my grown man on\nLET'S GO!\n(What more can I sayyyyyyyyyyy?)\n\n[Verse 3: Jay-Z]\nNow you know your ass is Willie when they got you in the mag\nFor like half a billy and your ass ain't lily-White\nThat mean that shit you write must be illy\nEither that or your flow is silly, it's both!\nI don't mean to boast, but damn, if I don't brag\nThem crackers gon' act like I ain't on they ass\nThe Martha Stewart that's far from Jewish\nFar from a Harvard student, just had the balls to do it\nAnd no I'm not through with it\nIn fact, I'm just previewin' it\nThis ain't the show, I'm just EQin' it\nOne-two and I won't stop abusin' it\nTo groupie girls: stop false accusin' it\nBack to the music - the Maybach roof is translucent\nNiggas got a problem, Houston!\nWhat up B, they can't shut up me\nShut down I, not even P.E., I'ma ride\nGod forgive me for my brash delivery\nBut I remember vividly what these streets did to me\nSo picture me lettin' these clowns nitpick at me\nPaint me like a pickany\nI will literally kiss TT in the forehead\nTell her, \"Please forgive me,\" then squeeze into your forehead\nI'm not the one to score points off, in fact\nI got a joint that'll knock your points off\nYoung Hova the God, nigga, blast for me\nI'm at the Trump International, ask for me\nI ain't never scared, I'm everywhere, you ain't never there\nAnd nigga, why would I ever care?\nPound for pound, I'm the best to ever come around here\nExcludin' nobody, look what I embody:\nThe soul of a hustler, I really ran the street\nA CEO's mind, that marketin' plan was me\nAnd no I ain't get shot up a whole bunch of times\nOr make up shit in a whole bunch of lines\nAnd I ain't animated like, say, a Busta Rhymes\nBut the real shit you get when you bust down my lines\nAdd that to the fact I went plat' a bunch of times\nTimes that by my influence on pop culture\nI'm supposed to be number one on everybody list\nWe'll see what happens when I no longer exist\nFuck this man!\n\n[Outro: Hum-V]\nWhat more can I sayyyyyyyyyyy?", "image": "https://images.genius.com/58a07fb743226031d3ccf6dc472cccdf.991x991x1.jpg"}], "artist": "JAY-Z"}