{"songs": [{"title": "Still D.R.E. (Rukmix)", "album": null, "year": null, "lyrics": "[Intro: Snoop Dogg]\nYeah nigga, I'm still fuckin' wit ya\nStill waters run deep\nStill Snoop Dogg & D.R.E\n'99 nigga\n\n[Dr. Dre:]\nGuess who's back?\n\n[Snoop Dogg:]\nStill, still doin' that shit, huh Dre?\n\n[Dr. Dre:]\nOh for show\n\n[Snoop Dogg:]\nYeah\n\n[Dr. Dre:]\nCheck me out\n\n[Verse 1: Dr. Dre]\nIt's still Dre Day nigga, AK nigga\nThough I've grown alot, can't keep it home alot\n'Cause when I frequent the spots that I'm known to rock\nYou hear the bass from the truck when I'm on the block\nLadies, they pay homage, but haters say Dre fell off\nHow nigga? My last album was The Chronic\nThey want to know if he still got it\nThey say rap's changed, they want to know how I feel about it\n\n[Snoop Dogg:]\nIf you ain't up on things\n\n[Dr. Dre:]\nDr. Dre is the name, I'm ahead of my gang\nStill puffin' my leafs\nStill fuck with the beats\nStill not lovin' police\n\n[Snoop Dogg:]\nUh uh\n\n[Dr. Dre:]\nStill rock my khakis with a cuff & a crease\n\n[Snoop Dogg:]\nFor show\n\n[Dr. Dre:]\nStill got love for the streets, reppin' 213\n\n[Snoop Dogg:]\nFor life\n\n[Dr. Dre:]\nStill the beats bang, still doin' my thing\nSince I left ain't too much changed, still\n\n(Chorus - twice)\n[Snoop Dogg:]\nI'm representin' for them gangsta's all across the world\n(Still) Hittin' them corners in them low-low's girl\n\n[Dr. Dre:]\nStill takin' my time to perfect a beat\n& I still got love for the streets, it's the D.R.E\n\n[2nd Verse: Dr. Dre]\nSince the last time you heard from me I lost some friends\nWell, hell, me & Snoop, we dippin' again\nKept my ear to the streets, signed Eminem\nHe's triple platinum, doin' 50 a week\nStill, I stay close to the heat\n& even when I was close to defeat, I rose to my feet\nMy life's like a soundtrack I wrote to the beat\nTreat rap like Cali weed, I smoke 'til I sleep\nWake up in the AM compose a beat\nI bring the fire 'til your soakin' in your seat\nIt's not a fluke, it's been tried, I'm the truth\nSince \"Turn Out the Lights\" from the World Class Wreckin' Cru\nI'm still at it, After-mathematics\nIn the home of drive-by's & Akmatics\nSwap meets, sticky green & bad traffic\nI dip through then I get skin, D.R.E\n\n(Chorus - twice)\n[Snoop Dogg:]\nI'm representin' for them gangsta's all across the world\n(Still) Hittin' them corners in them low-low's girl\n\n[Dr. Dre:]\nStill takin' my time to perfect the beat\n& I still got love for the streets, it's the D.R.E\n\n[Verse 3: Dr. Dre]\nIt ain't nothin' but more hot shit\nAnother classic CD for y'all to vibe with\nWhether your coolin' on a corner wit your fly bitch\nLaid back in the shack, play this track\nI'm representin' for the gangsta's all across the world\nStill...\n\n[Snoop Dogg:]\nHittin' them corners in them low-low's girl\n\n[Dr. Dre:]\nI'll break your neck, damn near put your face in your lap\nNiggas try to be the king but the ace is back\n\n[Snoop Dogg:]\nSo if you ain't up on things\n\n[Dr. Dre:]\nDr. Dre be the name still runnin' the game\nStill, got it wrapped like a mummy\nStill ain't trippin' love to see young blacks get money\nSpend time out the hood, take they mom's out the hood\nHit my boys off with jobs, no more livin' hard\nBarbecue's every day, drivin' fancy cars\nStill gon' get mine regardless\n\n(Chorus - 3 times)\n[Snoop Dogg:]\nI'm representin' for them gangsta's all across the world\n(Still) Hittin' them corners in them low-low's girl\n\n[Dr. Dre:]\nStill takin' my time to perfect the beat\n& I still got love for the streets, it's the D.R.E\n\n[Outro: Snoop Dogg]\nRight back up in your muthafuckin' ass\n'95 plus 4 pennies!\nAdd that shit up, D.R.E. right back up on top of things\nSmoke somethin' wit your dog\nNo stress, no seeds, no stems, no sticks!\nSome of that real sticky-icky-icky\nOooh wee! Put it in the air\nOh you's a fool D.R\n[laugh]", "image": "https://images.genius.com/bf3badae49c33b583126057638078bd8.576x576x1.jpg"}], "artist": "Dr. Dre"}