{"songs": [{"title": "DNA. (Remix)", "album": null, "year": "2017-07-30", "lyrics": "[Verse 1]\nI got, I got, I got, I got anger, hate and jealousy inside my DNA\nI got envy and bad energy inside my DNA\nI got snakes and satan entities inside my DNA\nI got demons, pain and enemies inside my DNA\nI got passion, guts and action tucked inside my DNA\nI got pints of Michael Jackson's blood inside my DNA\nI got Captain Crunch and Magic Dust inside my DNA\nI don't do massive drugs, don't gas me up\nLook, I got, I got, I got, I got\nMurder all on my conscience\nI might take me a hostage\nI fell asleep in Worcester, I just woke up in Compton\nShout out to LA, where your songs play niggas gon' put on my shit\nHalf of you niggas fake, heart full of clay\nWhat's your last name? Thompson?\nEven if you join a gang, that don't really change up the fact you the softest\nDon't let the colors get to your head\nWho the fuck you think you are, Rodman?\nWho the fuck you think you are, Ron O'Neal?\nI'mma murder everything, I don't chill\nIf you lucky, then I might let you eat the scraps off whatever's left I'll kill\nNigga, pull it and *bap bap*\nBlow your brains all on your crop top\nSick of niggas thinking they hot shots\nFull of jokes, niggas get knock knocked\nThis is the chop shop\nI know where they cooking the Crock-Pot\nSemi-auto making them Hopscotch\nAll my life I've been cock blocked\nI'm tired of being stuck in a blood clot\nTalking that blah blah\nI'm runnin', jumpin', duckin' them cops\nHop in the puddle while you jumping on FOX trucks\nYou can run all you want, we just gon' see how far you can get\nIf fans want me do features with their favorite rappers that'd be the best\nLook, all them niggas know exactly who I am, but they don't give me no respect\n'Cause the problem is they don't fuck with me, everybody see me as a threat\nYeah yeah, I know this sounds like some fresh air\nIf you don't hear me right use your left ear\nI want to say that I'm the next up\nI want it last year, they said next year\nI want it this year, they say not yet\nBut I'ma take it from whoever got next\nTwin deuce-deuces, I'm Clyde Drexler\nWhat is competition, who gon' die next?\nGet dissected in the lab with pliers, pencils, and a razor with my initials\nGet stabbed by the guy who sent you\nI'ma sign, send you the pollution, environmental\nI'm a giant pistol, you're a kung fu guy\nIt's simple, you gon' lead by my example\nI'm a flying missile that connected and fried your mental\nDNA on the side your temple, nigga\n\n*Cough, cough, cough*\nOh, shit\n\n[Verse 2]\nSomeone call 911, niggas gon' die when I'm finished\nI'll probably get locked up for life, what the fuck you thinkin'?\nMy whole life I been too fuckin' patient\nGive me respect before I fuckin' take it\nI know you see me don't duck your faces\nYou see me mentioned on publications\nThen you get sour and suck your face in\nPay for my dick since you love to taste it\nBetter swallow the shit, don't you fuckin' waste it\nI'ma flood the nation, this is suffocation, this is deprivation\nThis is Satan's kitchen, that's your destination\nI got heaven waitin' angels flyin', prayin'\nJesus entertainin', Marvin Gaye singin'\nMartin Luther dreamin', Pac and Biggie schemin'\nBob Marley smokin', Paul McCartney floatin'\nProdigy  mobbin', Pun say I’m joking\nJFK riddin' 'round locked and loaded nigga\nShout out to Joe Budden\nThese niggas really don't know nothin'\nI swear they gang full of ho muffins\nI should just roll up and (blaow) *gunshot*\nNo one seen, nobody know nothin'\nThis shit is so touchin'\nShout out to Kevin Durant\nThis that underdog court that they throw us in\nI blow your shoulders in\nThis that crack, this that shit that them hoes got they nose up in\nCinematic, movie shit I usually watch a little static\nI crack you till you're leaking and begin to panic\nA DNA ya bleeding and get liver damaged and get jimmy jammers\nAnd I never had too many manners\nAnd you know my momma always told me I was heavy handed\nFuck it though 'cause I was fully loaded\nNow the semi jammin', I'm already blammin'\nGot the hammer and the minivan\nAnd I'm a busy man but I got liquor\nAnd she bad and boujee\nAll of ya'll snitches is Ratatouille\nCan't beat me up so they gotta shoot me\nThey don't like me now they gotta sue me\nKillin' y'all softly, I got the Fuji\nDon't touch me, all of y'all got the cooties\nThat's your bitch who sent me all the nudies\nGet my dick sucked playin' Call of Duty\nNigga fuckin' shoot me\nNigga damn it they ought to know\nEm shoulda' signed me a while ago\nCole shoulda' signed me a while ago\nDre shoulda' gave me a beat or two\nDiddy shoulda' had me writin' for him in the crib for a week or two\nI don't smoke weed but I needed to\nThis is a meter room\nYou gon' need a bag and a feeding tube\nI'm mad and I mean it too\nIt won't be the last I'll see you soon\nKiss my ass and I mean it too\nA lotta drama\nBitch I'm Freddy Krueger mixed with Jeffrey Dahmer\nI know you're probably mad 'cause you look very sour\nI'd probably be in hell if I was any hotter\nI'd probably be Usher if I ain't wear a condom\nI've never been a fan of Gucci, Fendi, Prada\nBut my auntie got it and she never leave the crib without it\nSome people say I'm crazy, that's the the thing about it\nWhatchu think about it? Think about it, nigga\n\n(Gimme some ganja)", "image": "https://images.genius.com/441d9e31e0dc05dfee42a36a161148d7.475x471x1.png"}], "artist": "Joyner Lucas"}