{"songs": [{"title": "Wesley’s Theory", "album": "To Pimp a Butterfly", "year": "2015-03-23", "lyrics": "[Produced by Flying Lotus & Ronald \"Flippa\" Colson]\n[Additional production by Sounwave & Thundercat]\n\n[Sample: Boris Gardiner]\nEvery nigga is a star, ayy, every nigga is a star\nEvery nigga is a star, ayy, every nigga is a star\nEvery nigga is a star, ayy\nWho will deny that you and I and every nigga is a star?\n\n[Intro: Josef Leimberg]\nHit me!\nWhen the four corners of this cocoon collide\nYou’ll slip through the cracks hopin' that you’ll survive\nGather your weight, take a deep look inside\nAre you really who they idolize?\nTo pimp a butterfly\n\n[Chorus: Kendrick Lamar]\nAt first, I did love you\nBut now I just wanna fuck\nLate nights thinkin' of you\nUntil I get my nut\nTossed and turned, lesson learned\nYou was my first girlfriend\nBridges burned, all across the board\nDestroyed, but what for?\n\n[Verse 1: Kendrick Lamar]\nWhen I get signed, homie, I'ma act a fool\nHit the dance floor, strobe lights in the room\nSnatch your little secretary bitch for the homies\nBlue-eyed devil with a fat-ass monkey\nI'ma buy a brand new Caddy on vogues\nTrunk the hood up, two times, deuce-four\nPlatinum on everythin', platinum on weddin' ring\nMarried to the game and a bad bitch chose\nWhen I get signed, homie, I'ma buy a strap\nStraight from the CIA, set it on my lap\nTake a few M-16s to the hood\nPass 'em all out on the block, what's good?\nI'ma put the Compton swap meet by the White House\nRepublican run up, get socked out\nHit the prez with a Cuban link on my neck\nUneducated, but I got a million-dollar check like that\n\n[Refrain: Thundercat & George Clinton]\nWe should never gave\nWe should never gave niggas money\nGo back home, money, go back home\nWe should never gave\nWe should never gave niggas money\nGo back home, money, go back home\n(Everybody get out)\n\n[Chorus: Kendrick Lamar, Thundercat & George Clinton]\nAt first, I did love you (Love you)\nBut now I just wanna fuck (I just wanna fuck)\nLate nights thinkin' of you (Of you)\nUntil I get my nut ('Til I get my nut)\nTossed and turned, lesson learned\nYou was my first girlfriend\nBridges burned, all across the board (Across the board)\nDestroyed, but what for?\n\n[Break: Dr. Dre]\nYo, what's up? It's Dre\nRemember the first time you came out to the house?\nYou said you wanted a spot like mine\nBut remember, anybody can get it\nThe hard part is keepin' it, motherfucker\n\n[Verse 2: Kendrick Lamar]\nWhat you want you? A house or a car?\nForty acres and a mule, a piano, a guitar?\nAnythin', see, my name is Uncle Sam, I'm your dog\nMotherfucker, you can live at the mall\nI know your kind (That's why I'm kind)\nDon't have receipts (Oh, man, that's fine)\nPay me later, wear those gators\nCliché? Then say, \"Fuck your haters\"\nI can see the baller in you, I can see the dollar in you\nLittle white lies, but it's no white-collar in you\nBut it's whatever though because I'm still followin' you\nBecause you make me live forever, baby\nCount it all together, baby\nThen hit the register and make me feel better, baby\nYour horoscope is a gemini, two sides\nSo you better cop everything two times\nTwo coupes, two chains, two C-notes\nToo much ain't enough, both we know\nChristmas, tell 'em what's on your wish list\nGet it all, you deserve it, Kendrick\nAnd when you hit the White House, do you\nBut remember, you ain't pass economics in school\nAnd everything you buy, taxes will deny\nI'll Wesley Snipe your ass before thirty-five\n\n[Bridge: George Clinton & Kendrick Lamar]\nYeah, lookin' down, it's quite a drop (It's quite a drop, drop, drop)\nLookin' good when you're on top (When you're on top, you got it)\nYou got a medal for us\nLeavin' metaphors metaphysically in a state of euphoria\nLook both ways before you cross my mind\n\n[Refrain: Thundercat & George Clinton]\nWe should never gave\nWe should never gave niggas money\nGo back home, money, go back home\nWe should never gave\nWe should never gave niggas money\nGo back home, money, go back home\n\n[Outro: Anna Wise & Whitney Alford]\nTax man comin', tax man comin'\nTax man comin', tax man comin'\nTax man comin', tax man comin'\nTax man comin', tax man comin'", "image": "https://images.genius.com/ffb1a13cfda120ba85ab9e2a83a4e158.1000x1000x1.jpg"}], "artist": "Kendrick Lamar"}