{"songs": [{"title": "No Hooks", "album": null, "year": null, "lyrics": "RZA:\nSpectacular cardiovascular attacker!\nShaq's on the track with the blackular\nPuzzler! Rugged slugger, 40 oz guzzla\nGold nugget fangs punch holes inside your jugular\nVeins... do it quick nicca bi**h, before your brain get drained...\nWith the horror you now have become stained...\nIce cold, like the winter, Eskimo! Enter\nThe skill like a splinter! A decimal\nLet's have a festival, Wu-Tang Killer Bees, we...\n(Suuuuuuu!) Ah, intellectual\nStyles break your mind!\nShine, nigga, shine!\n\nAll: We don't need no hooks!\n\nShaq:\nThe Shaq Attaq has risen\nAu concrete PM this is twizm\nAlways & forever, forever always attack\nI bring flava to ya ear like Craig Mack!\nLife's a B and then ya D, refer to Nasty Nas Illmatic\nCD, #3 Static!\nYou don't want none, ya best to keep lookin'\nAEIOU's a ass-whoopin'! You're tooken\nInto Clear & Present Danger, I'm a perfect stranger\nQuick to rearrange a... outlook, so look out\nSo here me comes! Quick to beat you down\nLike the RZA on the drums!\nChange my name like Prince, punks be tremblin'\nMy name ain't Shaq no more, call me Superman\nEmblem! Marks, get set, go left\nThe Shaq, the RZA, get ready for the Meth!\n\nAll: We don't need no hooks!\n\nMethod Man:\nDangersome, comin' mad phat, Terrordome\nLike whadva ak, we can get it on. Break 'em down\nI'm a set it, yeah, ooh dat dirty rat, bring 'em here\nTo the mindbender, the deathsender to your ear: Method\nWhatup, hookers? Hoodrats are no goodaz\nIt be Tical breakin' rims with the Seven footer:\nShaq. Bring it to the front, now bring it back\nTo the head, black, 'cuz when my Soul Train hit the track\nTarget: the Billboard Charts, don't make me start it\nThe whole industry is gassed up and now they farted\nMy object is destruction, for percussion, rhymes are bustin'\nGot your wholes block duckin'\nDown! The end is here, apocalypse now!\nGettin' shot, peace'll work it out\n\n(more We don't need no hooks stuff)", "image": "https://images.genius.com/fe6629f7a5e6af0aa38ca87547ced96f.1000x562x1.jpg"}], "artist": "Method Man"}