{"songs": [{"title": "Sub Crazy", "album": "Tical", "year": "1994-11-15", "lyrics": "[Method Man]\nAight? Check it out (FUCK DAT!)\nWord, niggas smoke too fuckin' much man\n(Check it out y'all, check it check it out)\n\n[Intro/Hook]\nWe can all get by if we want now\nGet a fat piece of the pie if we want\nMotherfuckers gettin' mad high when they want now\nI will survive, recognize it be Tical\n\n[Verse One]\nWhat up, ock? Niggas is strapped, ready for war\nOn the ill block, things just ain't peace no more\nFuck it - if you ain't with me then forget me\nNiggas tried to stick me, retaliation, no hesitation shifty (bitch)\nCreepin' niggas in the dark, triggers with no heart\nRippin' ass apart, I be swimmin' with the sharks now (yeah)\nStay out my water or it's manslaughter\nKid, you oughta start reachin' for that nickle-plated auto-\nMatic (f'real) my thoughts get sporadic (uh)\nLoaded raps bustin' mad shots to ya attic (woo!)\nThey say this hazardous flow's a hazard\nStraight from Hazzard County with a bounty on his head\nAnd it said: \"Wanted Dead or Alive\"\nI swear by the whites of they eyes\nTo never take a dive I will survive\n\n[Hook]\n\n[Method Man]\nEeep opp, epp awpp, baaaaaaa\nHere we go, start\n\n[Verse Two]\nShit's gonna happen if niggas start actin'\nLike they want problems. You want 'em? You got 'em\nRap contact, is writin' this exact-\nLy, the way it should, be, attack\nKiller Beeeees on the swarm\nAlaikum as-salaam, drops bombs like Qur'an\nThe ism helps to stimulate my pugilism\nI bust rhymes like jism\nImpregnate the rhythm with the wisdom\nDecipher, the stee, I be hyper\nI dwindle the style, that rekindle like old flamesss\nSssssssaliva, check the wicked flows I delyvah\nOops, I mean delivers like the Hudson River\nStyles be trite, trife like a thief in the night\nI be that sneaky-ass nigga bustin' nuts in yo wife\nBlasted, buggin' off Bacardi and acid\nFlippin' on the mic, it's a classic", "image": "https://images.genius.com/e8eea98eab886487258b11bd4e1cca4b.1000x1000x1.jpg"}], "artist": "Method Man"}