{"songs": [{"title": "Wanted Dead Or Alive", "album": "The Prophet: The Best of the Works", "year": "1997-05-16", "lyrics": "[Intro]\nNuthin' but a gangsta party\nNuthin' but a gangsta party\n\n[2Pac]\nGot me up against the fence, back against the wall\nGet to actin' like a fool if ain’t no justice for the Dogg\nGot to take it out on all, y'all\nBetter read the papers, all my homies goin' crazy, baby\nOnly God could save us\nGot my, mind on currency, hurry, see I ain't worried\nIt's a gangsta party so, Bad Boy gettin' buried\nSnoop Dogg, why they fantasize\nWhen we ride it’s a must adversaries die every time\n\n[Hook: sung by female voice]\nYes, yes, y'all, not $hort but Snoop Dogg\nAnd you know it's like that y'all\n\n[Snoop Doggy Dogg]\nI'm so smooth about my paper check it just how it's done\nI'm servin' any on a platter Snoop Dogg Corleone\nCorleone, now do you know what that mean?\nA Teflon Don to this hip-hop game, super supreme\nIt's like what happen can happen but will it stop\nThat won't happen I'm feelin' good about the mission for jackin'\n*singing*\nAyo Pac, can you feel me?\nWhy these fools, tryin' to kill me?\n*rapping*\nIt's so hard to stay focused on my eyes and prize\nBut if I don't, the Dogg won't survive\n\n[2Pac]\nWe ballin' in my opinion, eternal was wild wheel spinnin'\nOnce implemented it’s represented for five minutes\nTwo of the livest wanted dead or alive\nWe riders, ban us cause we inquired and watch the G's ride\nTwo of America's most, straight out the West Coast\nBow down fool, this is Death Row\nBeen waitin' way too long, fresh out the pen, now it's on\nC'mon, Snoop Dogg, time to bone\n\n[Snoop Doggy Dogg]\nAin't nothin' changed too down to hang I slang a bang with a rhyme\nMe and the homey Pac trippin' Death Row on knobs\nGon survive by Eastside of DPG'z\nStill creepin bump through the hood, always involved in the streets\n(Westside)\nSnoop Doggy Dogg homie, did you forget who I was\nThe big homie to you, there it is and there it was\nNow take a look through the eyes of a G\nAnd just ride to the rhythm of a gangsta beat\n\n[2Pac]\nAll my homies tellin' me\nAin't no love for a real G\nStraight cowards all you playa haters kill me\nThrow up your hands if you feel me\nWe gettin' dollars, homie, holler if you hear me\nIt's one time for my comrades doin' bad lockdown\nFresh out bust the top and bounce drop down\nCan you visualize perfection\nCause every ryder in my set labelled a vet best in their profession\nDon't hold your breath, stick to Smith & Wesson\nSteady study your lessons to keep the crowd guessin'\n\n[Snoop Doggy Dogg]\nStraight gangsta, y'know\nMoney to be made, situations get deeper\nNiggas always tryin' to creep\nBut I know what time it is\n\nGangstas, yeah yeah yeah\nYeah, gangstas\nPlay or stay\nYeah, play or stay\nY'know? Stay a gangsta\nAll my doggs, all my niggas on lockdown, Big Dogg\nIt's for you nigga\nWe gonna ride this motherfucker til the wheels fall off\nYeah yeah\nPlay or stay\nYeah, play or stay\nYeah yeah, play or stay\nYeah yeah, Death Row!\nYeah yeah, my nigga 2Pac rest in peace\nDogg Pound\nDippin real hard y'knowhatI'msayin?\n\nYeah yeah, stay down\nGangstas gangstas\nFoe life, Eastside!\nWestside of the coast\nYeah, Eastside!\nMmmm, for all my soldiers\nYeah\nWhere ya at?\nYeah\n\nY'know? Yeah\nStay down\nFor real\nY'know? What it look like?\nMmm, what it feel like?\nIt ain't easy, y'know? Death Row", "image": "https://images.genius.com/167dd46c3cfce1ef8abdfcc3f1b25ffb.600x594x1.jpg"}], "artist": "2Pac"}