{"songs": [{"title": "Hot 16's", "album": "Raw", "year": "2010-11-19", "lyrics": "[Intro]\nSee the difference between me and you is\nYou think there's no difference between me and you\nBaby, Hopsin is in the building! (I'm RAW) We gone have one hell of a time\nRIGHT NOW!\n\n[Verse 1]\nWho am I? A snobby and deadly poet\nSo nigga put down the pen cause I probably already wrote it\nI'm the nigga that Hollywood barely noticed\nFor pullin' cards, it's easy as sockin' on Gary Coleman\nHow did you get a deal without havin' no type of talent\nThe shit you write is invalid, you gettin' your mic impounded\nI'm livin' in a dump, you livin' life in a palace\nDinin' with Caesar salads, man how do you guys allow it?\nYo, you weak niggas in the limelight trippin'\nBut I won't let you slide like friction\nNot tryna be ya buddy in this rap shit, I like dissin'\nSo you can kiss my ass and watch the white eyes glisten\nYa'll nigga's be regulatin' the area\nHesitatin' to scare to some defamation of character\nI got it locked no separatin' the barriers\nMedicate your hysteria, heaven's waitin' to carry ya\n\n[Hook]\nMy hot 16's be on that ill shit! (uh huh)\nYour hot 16's deal with the children (uh huh)\nBaby, Hopsin is in the building! (you know) We gone have one hell of a time\nRIGHT NOW!\n\n[Verse 2]\nI'm a pro but I kick it with the beginners\nThat what I whip up for dinner it's been up on my agenda\nI came and left but now I'm finna re-enter\nShiver-me-timbers, how the fuck can a nigga be realer?\nI don't know but my flow, is so cold, mistah oh no\nAt your door, I'm ready fo' war\nWhen you was flossin' on me tryna swerve in your hummer\nI was plottin' way bigger nigga, word to your mother\nMy verses are butter, I emerge from the gutter\nTo step up inside the booth and then work mothafuckers\nI'm hungry as all of the roaches that lurk in my cupboard\nYou should be duckin' and runnin', send the word to the others\nI'm a fuckin' nightmare in your worst hell\nAnd I'm leavin' nigga's stuck behind the bars, they don't deserve bail\nYou see wackness doesn't sit on my nerves well\nYou couldn't bust with a dick full of sperm cells\n\n[Hook]\nMy hot 16's be on that ill shit! (uh huh)\nYour hot 16's deal with the children (uh huh)\nBaby, Hopsin is in the building! (you know) We gone have one hell of a time\nRIGHT NOW!\n\n[Verse 3]\nYou see I'm lyrically bashin' up on your feelings\nI'm bad and I don't conceal it, this dragon is known for killin'\nThat's the reason I'm baggin' these hoes and grillin'\nMy madness is so appealin' and swagger is on a billion\nAside from all the provocative hellishness\nI'm somewhat underground, but got the commercial elements\nAccording to ruthless records it wasn't evident\nSo I'm a 9/11 the label bitches to hell with it\nI'm that crazy nigga, you can't be iller\nI'll pick ya fuckin' mom up in a 18-wheeler\nYeah I'll hit it, but if she don't wanna pay me scrilla\nI'll let a rottweiler fuck her till the rabies kill her\nMy hobbies are rappin' vicious, slappin' bitches\nGrabbin' digits, and I occasionally laugh at midgets\nI'm hardly sane and half horrific with a dab of mischief\nNever rap no shit if I haven't lived it, it's that specific\n\n[Hook]\nMy hot 16's be on that ill shit! (uh huh)\nYour hot 16's deal with the children (uh huh)\nBaby, Hopsin is in the building! (you know) We gone have one hell of a time\nRIGHT NOW!\n\n[Outro]\nWelcome to RAW\nWelcome to RAW\nWelcome to RAW\nWelcome to RAW\nWelcome to RAW\nWe gone have one hell of a time, RIGHT NOW!", "image": "https://images.genius.com/511235d7620c5ca1e6b46a485cb180d6.1000x1000x1.jpg"}], "artist": "Hopsin"}