{"songs": [{"title": "Sorry", "album": "Trouble Man: Heavy Is the Head", "year": "2012-11-27", "lyrics": "[Verse 1: T.I.]\nMy cup runneth over with pinot grigio, hol' up\nYou bogus in the Lambo if you ain't lifting the door up\nYou bogus poppin' pills if you ain't pickin the ho up\nYou bogus running out on your kids, my nigga, grow up\nFor God's sake, like a wedding, cutting large cake\nFor large stakes, let the hammer bang, broad day\nAy, nevermind what the blogs say\nThis what my mind and my heart say\nMy philosophy profit off of my properties\nGet it, flip it, we got to be rich, that broke shit is obsolete\nPossibly off of my rocker, watch how you watching me\nSophisticated, psychotic, fly as a pilot\nOfficially silent, all you wish you could get I got it\nUnlimited titanium nigga, what's in yo' wallet?\nOut of gladiator college, I made it summa cum laude\nWhere you clowns couldn't have got a cap and gown if you bought it\nI parley with Saudis, buying crude oil and diamonds\nHustle January, July, fly to Dubai\nA broke nigga telling me 'bout how I'm dividing the pies\nLike a blind nigga telling me it's an eye for an eye\nBullheaded and stubborn, I be that way 'til I die\nBut find a nigga with more hustle than me I dare you to try\nAnd according to the hand on my Audemar\nIt's my time to shine, so fuck y'all\n\n[Chorus: Stacy Barthe]\nWhat should I be sorry for?\nWho should I be sorry to?\nWhat should I be sorry for?\nWho should I be sorry to?\nThe fact is you can't please everybody\nYou can't please everybody\nWhat should I be sorry for?\nWho should I be sorry to?\n\n[Verse 2: T.I.]\nI grew up in the gutter, life a motherfucker\nI guess that's why I don't trust a motherfucker\nSeen a nigga snitch on they mom, shoot at they brother\nGo to prison in love with a bitch and a nigga fuck her\nI seen real G's destroyed by real suckers\nInnocent ladies raped and defenseless babies abducted\nSuch a horrible truth, but you see it over and over\nIt's nothing, you numb to it and your heart grow colder\nPacify your pain with a chain and a Rover\nFuck it, justify your action with stacking your dough up\nYou show up with a brick of cocaine and baking soda\nJust enough for me to blow up, nigga hold up\nSwitch the flow up, 'cause these niggas be snitchin' so much\nI promise all they missing's a badge, coffee, and donut\nGo to jail so what, never see my integrity perish\nThat ain't the Harris' way, study my pedigree\nPromise I'm one of the only ones who keep it 100\nProbably why I think they all out to get me, you can't convince me\nLarge money and fame will plant seeds of envy\nTo make my partners resent me enough to come and get me\nCatch me slippin' and hit me, just like they did 50\nCause I'm in the position that he think he should be given\nListen, dawg, the fact of the matter is\nI'm on a narrow path and we all can't travel\n\n[Chorus: Stacy Barthe]\nWhat should I be sorry for?\nWho should I be sorry to?\nWhat should I be sorry for?\nWho should I be sorry to?\nThe fact is you can't please everybody\nYou can't please everybody\nWhat should I be sorry for?\nWho should I be sorry to?\n\n[Verse 3: André 3000]\nWhat it ain't? What it is? Even if you gotta live\nI learned that apartment is way more exciting than a big ass house on a hill\nI used to be a way better writer and a rapper\nWhen I used to want a black Karmann Ghia\nNow a nigga speeding in a Porsche\nFeeling like I'm going off a course\nCut these fuck niggas off\nNegative in my life, scream that 'til I'm hoarse\nDuck these get the fuck off me projectiles, bitch he ain't really got a choice\nI'm living my life live yours\nI don't even like rapping fast, but that's how the world come to me\nTalk to me sideways nigga that's your ass\nSlow it down, this that shit that'll make you call your momma\nSay, \"Hey, I'm sorry for begging for all them clothes you couldn't afford\"\nAnd this the type of shit that'll make you call your rap partner\nAnd say, \"I'm sorry I'm awkward, my fault for fuckin' up the tours\"\nI hated all the attention so I ran from it (ran from it)\nFuck it if we did, but I hope we ain't lose no fans from it (fans from it)\nI'm a grown-ass kid, you know ain't never cared about no damn money\nWhy do we try so hard to be stars, just to dodge comments?\nAnd this that shit that'll make you call your baby mama\nWhen you gone on half a pill, don't know why but that's how it is\nThen you take a flight back to the crib, y'all make love like college kids\nAnd you say all the shit you gon' do better, we can try this shit again\n'Round the time the dope wear off, you feel stupid, she feel lost\nThat's that dopamine, I mean dope, I mean you think Cupid done worn off\nWaiting in the hallway with her arms crossed\nBaby boy face full of applesauce\nMaybe should have stayed but it ain't yo fault\nToo much pressure, I peel off, I'm sorry\nWas young and had to choose between you\nAnd what the rest of the world might offer me, shit, what would you do?\nWell I'd probably do it differently if second the chance\nOnly if some cool ass older man would've let me know in advance\nThere's this quarry, that is dug so deep in a father's chest\nWhen he feel that he's broken up his nest\nAnd he figured shit he was just doing the best that he could\nWhich end up being the worst that he could\nAnd all some pussy nigga on the Internet can say is that verse ain't good\nIt's boring? Boring? Really?\nWhen I'm disgusted with this world and I can hardly breathe and\nTold so many lies, don't know what to believe\nI discussed it with this girl, and this is what she said\nShe said, \"Lay down baby, baby, rest your weary head up\"\nA lovely distraction but my mind don't wanna rest\nBut my body disagree so I laid up on her breasts, yes\n\"Ooooh, you so fucking fine\"\nI woke up the next morning with new purpose on my mind\nOoooh, who pulls your ponytail?\nWho knows your body well huh?\n\n[Outro: Stacy Barthe]\nWhat should I be sorry for?\nWho should I be sorry to?", "image": "https://images.rapgenius.com/d31260062ddaded1b24eea8039c64d2c.500x500x1.jpg"}], "artist": "T.I."}