{"songs": [{"title": "Friend of Mine", "album": "Ryde Or Die Vol. III - In The “R” We Trust ", "year": "2001-12-18", "lyrics": "[DMX]\nUh-oh! (GROWLS)\nDon't tell me!(GROWLS)\nDon't tell me it's another one of these PK joints!\nNot another P. Killer joint!\nOH MY MOTHERFUCKIN'GOD!\nUh, uh, uh\n\n[Chorus]\nYou better stop that\nBefore I come ridin' back (RIGHT BACK)\nRight back to you (BACK TO YOU)\nI know you wouldn't like that (OH NO)\nWe don't need no (WE DON'T NEED NO)\nExtra offer see  (WE DON'T NEED NO)\nWasn't really no friend of mine (WASN'T NO FRIEND)\nWasn't really no friend of mine (OF MINE)\n\n[VERSE 1]\nI'm part of the meek, started to speak, at age 10\nOther kids were ridin' bikes, but that was the age when\nI became a man, learned to stand, on my own\nOne dog, no bone, so young, so grown\nKid left home, shit got harder, kid got smarter\nDid my part of the bad shit, I was the starter\nCame from the heart of the hood, not lookin' too good\nFuckin' did what I could; ready to bitch in the wood\nFor all the shit you do, just when you think you sly\nWhat goes around, comes around, the wrong damn time\nMaybe too late, but damn, I shoulda did that back then\nShoulda thought about that then, now come on out the den\nSlowly, Come on; keep your hands where I can see 'em\nYou don't know me, but we already got wifey tied up in the BM\nAnd know who set you up? That bitch with the crazy ass!\nAnother shorty, another party of your shady past!\n\n[Chorus]\n\n[VERSE 2]\nGod don't like ugly, all that love me, wanna plug me\nBut fuck me, it's about \"Is this really what you want G?\"\nThe more dirt you do, the more dirt you get\nMore fake niggas that ride, that'll jerk your dick\nThe more you think your slick, but somebody sees everything\nSometimes the thieves never hang\nThey remain, outlaws, wild dogs, outdoors\nStrippin' cats about yours, it's all about claws\nBeggin', scratchin', weighin' and matchin'\nYou stayin with the batch, and playin' with what you catchin'\nDo unto others, as you would have others do unto you, that's under you\nYou must first separate from, then connect with\nFuckin' with that X shit (WHAT), 'cos this the best shit (WHAT)\nMotherfuck the rest bitch (WHAT), it's all about this (WHAT)\nDo what you do, and you get what you get!\n\n[Chorus]\n\n[VERSE 3]\nSee what it boils down to, is that it all comes through\nRemember what you do, cause it's gon' come true\nA little harder than you did it, but that's the way it is\nI ain't know it be like this, but that's the way it is\nKeep fuckin' with them kids, cause they all get grown and shit\nWhen they get they own, what's gon' been that you shown 'em?\nFuck how to take a bone? How to rob a nigga of his throne?\nHow to be left standin' alone?\nGet a nigga gone, that ain't right\nDo it yourself, be a man and fight\nNigga earn your stripes, I damn sure earned mine\nI already know your language, now try to learn mine\nDig 'til you find, and when you find you keep\nI done spelled it out for you, but you niggas is still asleep\n6 feet deep, was just around the corner\nBe surprised how many niggas, wanna, wanna!\n\n[Chorus] X 2", "image": "https://images.genius.com/8a7c6324003fe8ded42987a7babb68f0.700x694x1.jpg"}], "artist": "DMX"}