{"songs": [{"title": "Muhammad Walks", "album": "Fahrenheit 1/15, Part I: The Truth Is Among Us", "year": null, "lyrics": "[Intro]\nA'udhu Billahi min ash-shaytaan-i'r rajeem. Bismillah-i'r Rahman-i'r Raheem\n\nAllahu Akbar, Allahu Akbar\nAllahu Akbar, Allahu Akbar\n\nThis is one's for all my brothers and sisters who died in Iraq, Israel, Afghanistan and right here in America\n(Jesus Walks)\n\nAbraham Taught\nMuhammad Taught\nAnd Moses split the sea\n(Jesus Walk with me)\nI ain't tryin' to profit off the prophets so this one's for free\n\n[Verse 1]\nG's up along with Muhammad and Jesus\nIn the Quran they call him Isa\nDon't think Osama and Saddam is our leader\nWe pray for peace, but the drama intrigues us\nAll, so we fall for the illusions of the beast\nSo instead of tryin' to teach we show our teeth\nSame God, different beliefs\nHijabs, Sunday clothes, yarmulke, kufi, same mission beneath\nWe all tryin' to get to where the sufferin' ends\nIn front of the Most High bein' judged for our sins\nCan't front for the Most High, so the struggle\nContinues\nYou, every bee, bird and tree, he, her and me\nWe virtually on the same boat\nWith the same goats, on the same sea\nTryin' to stay afloat, and put the devil in the yoke\nWith a couple of God's quotes\n\n[Hook]\nAsh-had an la ilaha illa llah\n(Astaghfirullah)\n\n[Verse 2]\nAnd to the sisters and the mothers of ours\nWho cover theyselves cause they're lovers of God\nThe Creator of the worlds, Sculptor of the stars\nDuring Hajj, we walk, through Ramadaan, we starve\nThough you not eatin', there's a feedin' of the mind\nA defeatin' of the demons, a seein' of the signs\nA leanin' on the lines from the surahs\nGetting purer, God deemed it unclean\n(There's no eatin' of the swine)\nNor drinkin' of the wine\nWe all bend to his whims, so I send out a message to my kind\nI’m cordial to Mr. Norful, Mrs. Adams you’re the theme song when I’m battling\nCreflo, player, what’s happening? I can hear the truth in your rappings\n(No)\nSex before you marry\nNo grudges\nYou should carry, no lyin'\nNot supposed to be gamblin'\n\n[Hook]\n(I know it sounds familiar)\nWe all the same man\nIt's all a game\nThe devil hate each and every one of us exactly the same\n(I wanna walk like Jesus, talk like Jesus sall Allāhu ʿalay-hi wa-sallam)\n\n[Verse 3]\nYou know\n(uh)\nAnd to my Akh's tryin to stay on their deen\nIt gets mean especially when you stay on the scene\nAnd at the same try to stay out of trouble\nBut don't forget the blessin' is in the struggle\nThe Most Forgiving will forgive it if you stay repentant\nAnd hustle\nYou gotta stay on your salats, your zakats, your Quran\nTo my homies and miskeen\nAstagfirullah\nAllah forgive us all\nFor we all are sinners\nBless us to be among the winners\nWhen it ends\nBut until then please strengthen the mission within our hearts\nAll praise is due to God\n(Amen)\nTellin' it how it was taught me\nI ain't tryin' to sell it can be brought for free\nThis is how it is\nNow how it ought to be\nMuhammad talk to me\nJesus walk with me\nI hope\n\n[Hook]\n(I know it sounds familiar)\nWe all the same man\nIt's all a game\nThe devil hate each and every one of us exactly the same\n(I wanna walk like Jesus, talk like Jesus sall Allāhu ʿalay-hi wa-sallam)", "image": "https://images.genius.com/9922f7078ce1f910a0541c33e13cce5b.500x500x1.png"}], "artist": "Lupe Fiasco"}