{"songs": [{"title": "Perfect Circle / God Speed", "album": "GO:OD AM ", "year": "2015-09-18", "lyrics": "[Part 1: Perfect Circle]\n\n[Intro]\nWoo-ooh-ooh\nOoh-ooh\n\n[Verse 1]\n(Fuck you) I came for whoever is in charge\nI suggest you go and get yourself a weapon and a guard\nThey need some coffee, everybody’s sleeping on me\nGoing around door to door, setting off alarms\nAll that horse shit, you should have left it at the barn\nKeep a stallion, tell her gallop to the store and get cigars, yeah\nToo many whips, gotta get a new garage made\nI might steal one just to drive it in a car chase\nMe and my bizarre ways (Lord have mercy)\nI moved up from a Private to a Sergeant\nYou can see it from a scar face\nHidden in a dark place, swimming in the shark tank\nGive a bitch a little bit of change, she a game in an arcade\n(Time crisis) Not a second to lose\nI’m the motherfuckin' Bible, that’s forever the truth\nAnd this is not another case of the celebrity blues\nThe devil with me and he tell me to shoot\n\n[Chorus]\nMurder, murder, murder, murder, what would you do?\nHave you ever had to hurt her? Just for something to do\nCan you draw a perfect circle?\nLot of lies cover the truth, you got options, what do you do?\nI wash these pills down with liquor and fall\nLeave it to me, I do enough for us all (I do)\nGot what you need if you like breaking the law\nMy mother raised me a God (Hey)\n(Fuck you)\n\n[Verse 2]\nYeah, blame the drugs, got me sinning on the weekday\nDrunk as fuck, doing buck sixty on the freeway\nGiving y'all the freebase, hidden in the middle of a briefcase\nHidden in a subwoofer, beat case\nUsed to wanna know how a freak taste\nNow I’m in it in an instant like replay\nBroad’s a baton, pass it off like relay\nWhy I’m so mad on my B-Day?\nShe say “I thought you got sober”\nAnd I say “I wish you’d stop being a bitch\nAnd get to minding your business”\nTold me “Money has changed you”\nI get to thinking, how rarely do I visit?\nHow’d I get so egotistical? I’m a Buffalo Soldier\nHeaven is a mile away, the trouble, much closer\nI’m only twenty-three but my mind is older, and it’ll forever be\nDead presidents to the homies, death to my enemies\n\n[Chorus]\nMurder, murder, murder, murder, what would you do?\nHave you ever had to hurt her? Just for something to do\nCan you draw a perfect circle?\nLot of lies cover the truth, you got options, what do you do?\nI wash these pills down with liquor and fall\nLeave it to me, I do enough for us all\nGot what you need if you like breaking the law\nMy mother raised me a God (Hey)\n(Fuck you)\n\n[Bridge: Ab-Soul & Mac Miller]\nA goddess told me “good morning” when I woke up\n(Fuck you)\nYou know I had a good morning when I woke up\n(Fuck you)\nGotta thank God every morning then I woke up\n(Fuck you)\nWould you remember me if I never woke up?\nBye bye (Fuck you)\nI've been a sinner, I’m just tryna stay\nWarm through the winter, and I’ll be on my way\nI’m just a drifter, in endless seas of whispers\nI just need some shelter, give me shelter from the wind\n\n[Refrain]\nWoo-ooh-ooh\nOoh-ooh\nWoo-ooh-ooh\nOoh-ooh\n\n[Interlude: Transition]\nYour call has been forwarded to an automatic voice message system\n412-9…. [buttons dialed] is not available\n\n[Miller McCormick]\n“Hey man, I wish you were here, happy holidays\nUhm, I love ya. And I hope you have a good night / weekend\n/ I hope I talk to you soon, alright, godspeed”\n\n[Part 2: God Speed]\n\n[Verse]\nOh yeah\nI thought I’d have it figured out by now\nShit would be simple, problems would be in the past by now\nMe and the homies would be sitting on millions\nReminiscin' on times when we were so broke and livin' in Oakland just chillin'\nI thought I’d have it in the bag by now\nI thought that we’d be kickin' back by now\nI know that life is a bitch\nI know that life is a bitch, I thought we’d put her in a cab by now\nBut I’m stressing, I can’t relax\nSwallowin' my pride and I’m hiding what’s making me mad\nEverybody saying I need rehab\n'Cause I’m speedin' with a blindfold on and won’t be long until they watching me crash\nAnd they don’t wanna see that\nThey don’t want me to OD and have to talk to my mother\nTell her they could have done more to help me and she’d just be\nCrying saying that she’d do anything to have me back\nAll the nights I’m losing sleep\nIt was all a dream, there was a time that I believed that\nBut white lines be numbing them dark times\nThem pills that I’m popping, I need to man up, admit it’s a problem\nI need to wake up before one morning I don’t wake up\nYou make your mistakes, your mistakes never make ya\nI’m too obsessed with goin' down as a great one\nBut if you wait too long they gon' find someone to replace ya\nSo I guess this is a letter\nTo all my brothers, Most Dope, that’s forever\nI love you more than words could express\nAnd this the part that Q start crying, if he ain’t already yet\nI did my best to be a leader you respect\nAt times I became weaker, got defeated by regret\nSo tell my baby I love her\nAnd if she give me the chance I’ll put a seed inside her, make her a mother\nJust know that there’s a place\nWhere all my people worry free and e'rybody straight\nEvery devil don’t got horns, every hero ain’t got capes\nOpened up my eyes, shit, I’m finally awake, good morning\nYeah, good morning\n\n[Interlude: Outro]\nYo Vin, it’s the morning, you gotta go to work\n“alright”\nYo, you gotta be at work in like ten minutes, yo\n(You good?)\n“I’m straight, yo what’s good?” (When you going?)\nYou gotta pick up the dry cleaning and shit still?\n“man, fuck that shit, I’ll skip”\nYou 'bout to go to work?\n“Mmm”\nAight, what time you gotta be at work?\n“I don’t know…. soon”\nYou Democrat or Republican?\n“Uhh…I don’t know anymore”\nWould you vote for a female president?\n“I don’t care what gender or race you are”", "image": "https://images.genius.com/3fafe062032c4ec3d42f4b11c25a02a1.375x375x1.jpg"}], "artist": "Mac Miller"}