{"songs": [{"title": "Chop Chop Ninja", "album": "Shaolin vs. Wu-Tang", "year": "2011-03-07", "lyrics": "[Kung-fu sample]\nI want them to fight!\nSister... sister, get out of there!\nIf you kill them, we'll never know who's the best\n\n[Hook: Estelle]\nWhat are the true keys to being a ninja?\nDressed in all black, perfect vision, and that movement is in silence, ah\nWhat are the true keys to being a ninja?\nDressed in all black, perfect vision, and that movement is in silence\nThis is Shaolin (Shaolin) this is Shaolin (Shaolin)\nThis is Shaolin, Shaolin, Shaolin\nThis is Shaolin, this is Shaolin\nThis is Shaolin, Shaolin, Shaolin\n\n[Verse 1: Raekwon]\nHe threw a kick at me, I back-slapped him, I pulled out the mac\nHe kicked it out of my hand, how real that?\nYo, a place where niggas get it on at\nI think it evolved around three hundred raps, thirty stacks\nHe had black on, yup, I was dusted, with all of my bangles on\nTwo rings clustered, shorty black\nHe was there, this my nigga, check the bullshit, he jabbed China Man\nHe threw a sword right through his wool shit\nNow he throwing stars at the kid, I'm jumping over my car, yo\nTrying to get to my glove box and shit\nGot the door open, gash in my caesar, my sneakers got red on it\nKnow that's blood, he threw a piece of a chain with a long blade on it\nAnd a nigga was buckwild, I'm ducking and dodging\nTrying to stick 'em with my little blade, Rae in some trouble\nI got to the glove box, I threw two shots, he disappeared\n\n[Hook: Estelle]\nWhat are the true keys to being a ninja?\nDressed in all black, perfect vision, and that movement is in silence, ah\nWhat are the true keys to being a ninja?\nDressed in all black, perfect vision, and that movement is in silence\nThis is Shaolin (Shaolin) this is Shaolin (Shaolin)\nThis is Shaolin, Shaolin, Shaolin\nThis is Shaolin, this is Shaolin\nThis is Shaolin, Shaolin, Shaolin\n\n[Verse 2: Inspectah Deck]\nI stay there like it ain't nothing to face fear\nFlowers by the grave of the niggas who say where\nI'm straight tear, tell them don't play fair\nThen retalliation, I'm a shake 'em just for scraping my suede pair\nHe told me \"Yo, wait right here, son, I been there\"\nRip your pockets off plus nut in your dame hair\nBroad day, even with jake there, serious\nLast time you saw me I was rocking the same stare\nDo or die, you or I, cousin, I pray for you\nForgive me for my sins, father, this is what they made me do\nNonsense cause me to slay the fool, rather than play the fool\nI resort to waving the gauge at you\n\n[Hook: Estelle]\nWhat are the true keys to being a ninja?\nDressed in all black, perfect vision, and that movement is in silence, ah\nWhat are the true keys to being a ninja?\nDressed in all black, perfect vision, and that movement is in silence\nThis is Shaolin (Shaolin) this is Shaolin (Shaolin)\nThis is Shaolin, Shaolin, Shaolin\nThis is Shaolin, this is Shaolin\nThis is Shaolin, Shaolin, Shaolin\n\n[Verse 3: Raekwon]\nThe year of the bullshit, why me? The nigga had Asics on\nA three hundred dollar pair, B\nYou don't scare me, wiping blood, hear me?\nHe laugh with a sinister grin, the sun went down, this is grim\nNow I'm sweating, still repping my square, you probably under a chair\nBlack hood on and sporting a gray beard\n\n[Verse 4: Inspectah Deck]\nRespect mine, or there go your head line\nA nigga got caught up, and left naked sporting a necktie\nSkip town slide to west side, CSI riding on my hides\nSo I'm out til next time", "image": "https://images.genius.com/bd1e2ea326f22bdcaa7332457249e1c5.1000x1000x1.jpg"}], "artist": "Raekwon"}