{"songs": [{"title": "Favorite Rapper", "album": "Free Agents - The Murda Mixtape", "year": "2003-02-25", "lyrics": "Yeah.. yeah.. aight? Motherfuckers!\nBitch-ass niggas, faggots\nCome through nigga... YO!\n\n[Havoc]\nI creep on the tippy-toe, surprisin the enemy\nAnd ain't nobody safe unless you bulletproof E'RYTHING\nClappin at your baby, includin your entourage\nDon't be 'fraid of these slugs, they get you closer to God\nI'm a homegrown terror, my pops planted the seed\nWhen I wild, don't be mad at me, should blame him\nWar with us? The start of your end\nBeef with these faggot-ass rappers started the trend\nP? That's my grimy for life, don't fuck with him\nAnd if word get back to me, I'm buckin you\nKnow it's on me hammers stuck to the hand just like glue\nLike them O.G.'s smokin them trees of bamboo\nShorty thought she knew me so I had to check her\nI'm a Gemini bitch, that mean I flip with the weather\nI don't know how you talk to them other cats, but I ain't them\n(Nah!) Put it in your mouth girlfriend\n\n[Hook: repeat 2X]\n[H] Clap your favorite rapper, gives a FUCK\nGimme a minute I'll crack that ass, whassup?\n[P] It's like drugs cause we gettin it back, get it back\nLike ki's how we get it back, it's a cash explosion\n\n[Prodigy]\nYeah that's right, that's right, that's right\nKnow we done struck a jackpot Dunn, it's a wrap from now on\nJust keep servin these niggas portions of that raw\nAnd sit back and countin this cash, we gettin off\nKnick-knack, paddy-wack, give a dawg more\nI won't stop 'til I can match my car with my clothes\nAnd ery'day of the week, I'm switchin up flows\nSpend ery'day with my peeps, half in the vultures\nPeace to Uncle Imeek, he holdin down the corporates\n.. eatin like a Boss Hogg\nClik-clik-BAOW! Don't have me shootin my gun at y'all\nDon't have me cuttin niggas down like the sniper\nYou had me kill some'n, I'm tryin peel bundles\nOf that scratch, the thou's to the mills\nPaper that our next generation gon' feel\nYou niggas gettin your money? Yeah do that for real\nCause niggas fuck with our money, we set it like the Bush family\n\n[Hook]", "image": "https://images.genius.com/8a94d4d15bcdf43ddb8ce2cdbfde357c.455x455x1.jpg"}], "artist": "Mobb Deep"}