{"songs": [{"title": "So Ruff", "album": "Whut? Thee Album", "year": "1992-09-22", "lyrics": "[Intro]\nAhh Redman..\nDo you feel that the Blacks in your community\nAre still mad at the racial situation?\nYeah, they still mad\nAnd if you don't take that funny smirk off your face\nI'mma kick your...\nOver three hundred ghetto-related crimes happened\nIn Newark, New Jersey alone — still the saga continues\n\n[Verse 1]\nStick 'em up, stick 'em up! I got the jammy to your guts, punk\nDon't make a move! Before I choose to make your guts run\nAll over the block, 'cause my stomach's in a knot\nAnd it growls twenty-four hours a day around the tick-tock\nI got roaches and rats up the back, carryin' bats and gats\nSo I *farting noise* 'fore I snack, Jack\nBecause I'm not down with water from the hydrant\nMy moms taking a bath and my brother's next to dive in\nI gotta think of a plan so I can eat\nI haven't had a cracker for weeks so my mouth leaks\nI squad up, 'cause I'mma set up this kid\nCarryin' loot out from Burger King and what I'mma do is...\nRun up on him, snatch the bag of money, then bust the dummy!\n'Cause, my man, when I think of a plan, there's no shorts take\n'Cause I pack jammies inside of my North Face, coat\nHad the black brother on scope\nNo joke's what I am 'cause the man's a pure pro\n(Yo, my man you got a light? [Straight jackin']\nYeah, give me the effin' money too, G!)\nYo, STOP, STOP, STOP!\nTook the money then I dipped with the quickness\nThe plan went well, so I got down to the business\nOpened up the bag, it was filled with paper\nI thought I freaked the funk but now starts the caper\n'Cause I was set up, now I have to go head up with the cops\nBut they carryin' black Glocks (Shit's thick!)\nWhat's my next move? My life's on the line\nBullets in their clips and none in mine\nSirens on, once again it's on\nI fell (OW!) and then the black Glocks went (POW!)\nI got snuffed and I got bust\nNow the only thing I'm sniffin' is dust, because it's...\n\n[Hook]\n'Cause it's so rough\n'Cause it's so rough\n'Cause it's so rough\n'Cause it's so rough\n'Cause it's so rough\n\n[Verse 2]\nMe and Erick Sermon taking a trip Uptown\nIn the 4Runner, blastin' my tape, puffin' ganja\nSince Erick got props\nI stepped to this hottie with more damn body than a chop shop\nFlexed the jewels then she chose to talk to me\nIt was no doubt that baby cakes was hawkin' me\nSo I kicked it, upped the digits, terrific\nNot knowin' she was scopin' me 'cause I was MAD splifted\nLater on that week, honeydip freaked the funk\nPlayin' Redman and Erick out like two chumps\nCallin' him weekdays, callin' me weeknights\n(Who had her weekends?) Whichever man would freak right\nThings got cozy one night like dynamite\nWe stripped to bare backs and took care of the bare facts\n(No hats? Damn, black) The Funkadelic\nTook a splash — you know how that go, fellas\nTwo months later (See you later, alligator)\nShe was pissed and, I ended up seein' my physician\nShe took a blood test, she took a head check\nLooked at me thinkin', \"Why the hell he isn't dead yet?\"\nThen I asked her, \"Why you lookin' at me?!\"\nShe said, \"Redman, because you have the HIV\"\nCalled Erick and his set, that girl, don't mess around!\nToo late, 'cause Erick already had his drawers down\n'Cause it's\n\n[Hook]\n'Cause it's so rough\n'Cause it's so rough\n'Cause it's so rough\n'Cause it's so rough\n'Cause it's so rough\n\n[Verse 3]\nTo all my brothers, wear your hats, wear your hats\nYou can either get with this or you can either catch the claps\nAnd to my sisters, make 'em wear they prophyl-lastic\n'Cause it's drastic, havin' another ghetto bastard\nThink I'm dying for a piece of butt? Honey, you must be nuts\nYou better settle for a wet kiss, so pucker up\n'Cause you end up messin' around catchin' the heebie jeebies\nLookin' like \"WHODUNNIT?\" Witcha face up on the TV\nSo next time you want sex, get wreck, but protect\n'Cause you could be like sexin' to your last death\nAnd if you still don't know the time, press rewind\n'Cause the next thing you might hear is a flatline\nWord\n[BEEEEEEEEEEEEEEEEP]", "image": "https://images.genius.com/851b0a63d63f6c8548a17f295b615296.1000x991x1.jpg"}], "artist": "Redman"}