{"songs": [{"title": "Beach City (Ladies)", "album": null, "year": null, "lyrics": "[Intro]\nThis beach city nigga\nHuh? what?\nThis beach city nigga\nHuh? what?\nThis beach city nigga\n(You know we had to do a remix)\nHuh? what?\nThis beach city nigga\n\n[Verse 1]\nLong Beach done come together now you know you in trouble\nIf you came in to the beach without Snoop D-O double\nLook, we hear the haters talking that don't mean that we listen\nI'm to busy chasing dreams I don't see competition\nDaisy Dukes bitch cruises through the city\nAnd that ass fat make that bike pop a wheelie\nAll my bitches pretty, tough as a diddy\nIf you ain't with the movement get your ass out the city\nBitch really\n\n[Bridge: Snoop Dogg]\nBang my city, my city we bang\nThis ain't nothing but a long beach thing\nAll my homies they got my back\nTalk that smack and I'mma peel you back\n\n[Verse 2]\nYes, mind over matter grind over chatter\nDeck not full, call me Mad Hatter\nJumped in the rabbit hole mission is the carrots\nOn my bullshit colonel strife with the merits\nCut from the cloth of a boss I inherit\nDon't sleep I'm tied to these streets like a marriage\nLoyal on my ring finger love on my middle\nFaith on my index I need it when I scribble, uh\nDifferent bitch every day like I'm civil\nBut you would never catch him on a leash in my kenal\nCola doesn't save him cola doesn't cape\nCola feed him kibble real bitches relate\nI am not a quitter nor will I ever equate\nPush my own line for the west of the state\nScooped up the game laid it out on my plate\nQueen of the west this ain't up for debate\n\n[Hook]\nThis beach city nigga\nHuh? what?\nThis beach city nigga\nHuh? what?\nThis beach city nigga\nHuh? what?\nThis beach city nigga\n\n[Verse 3]\nYeah, and you know Long beach did it\nBut we ain't dropping name nigga this ain't no attendance\nThese niggas be in conversations talking about they business\nBut if you knew better you'd be talking about your dividends\nI ain't got no friends, they be acting funny\nIt's cool in the beginning but if they ain't getting money\nEnd it soon cause motherfuckers don't wanna see you boom\nThey don't want to give lots of credit where credit is due\nI take them to school, but they don't show me no love\nThey just stalk my instagram and wait for me to hoe up\nThat'll be the day you niggas petty you forgetting\nYou used to be making investments into the future nigga, beach\n\n[Hook]\nThis beach city nigga\nHuh? what?\nThis beach city nigga\nHuh? what?\nThis beach city nigga\nHuh? what?\nThis beach city nigga\n\n[Bridge: Snoop Dogg]\nBang my city, my city we bang\nThis ain't nothing but a long beach thing\nAll my homies they got my back\nTalk that smack and I'mma peel you back\n\n[Verse 4]\nI'm from north side Long Beach\nKnow a couple niggas from the gang\nBut I ain't saying names cause that's dry snitching\nYou fucking with a cold killer when I start spitting\nYour mind vivid, I blind vision with my lyrics\nWe on a mission to get it, I'm concentrating on digits\nCan't pay attention to bitches, these niggas stay in they feelings\nCause now they see I'm the realest\nI'm going in I be killing shit, you feeling it?\nLong Beach City bitch\n\n[Verse 5]\nN-A to the motherfucking E\nYelling checkmate I be the queen of the beach\nIf the sky is the limit guess I'm looking like the clouds\nOnly smoking if it's loud like you bitches run you down\nTrying to get mills so my fam can say grace\nPut my heart up in this shit, like I'm rapping to my pace\nI'm at my post like a Joker I'm no joke\nSmoke that shit that's at your neck like a rope\nGet it? you choke\nNiggas thirsty thumbing, I'm his puss-iera mist, ah\nMake that pussy nigga give me bills not talking rent\nTop put him to bead like the head on a pillow\nMarried to the money\nDead presidents got me looking like I'm widowed\n\n[Hook]\nThis beach city nigga\nHuh? what?\nThis beach city nigga\nHuh? what?\nThis beach city nigga\nHuh? what?\nThis beach city nigga\n\n[Bridge: Snoop Dogg]\nBang my city, my city we bang\nThis ain't nothing but a long beach thing\nAll my homies they got my back\nTalk that smack and I'mma peel you back", "image": "https://images.rapgenius.com/f983165bcb58f45bd9dd1dc30294e998.500x500x1.jpg"}], "artist": "Snoop Dogg"}