{"songs": [{"title": "January 28th (Live)", "album": "Forest Hills Drive: Live from Fayetteville, NC", "year": "2016-01-28", "lyrics": "[Intro]\nRap tune\nI'm tryna make a million dollars off a rap tune, Fayettenam hands up\nCan I make a million dollars off a rap tune?\nI'm tryna make a million dollars off a rap tune\nSay what?\n\n[Verse 1]\nThe real is back\nThe Ville is back\nFlow bananas, here, peel this back\nAnd what you'll find is, your highness\nCan paint a picture that is vivid enough to cure blindness\nCarolina's\nFinest\nYou knew that already\nIn terms of the greatest, I proved that already\nAnd if you would like, I do it twice\nI just sharpen my blade for a minute became lost in my ways\nThis for my niggas that was tossed in the graves\nEvery so often I fade deep in my thoughts\nAnd then get lost in the days\nWe used to play before your coffin was made\nJust got the call nigga got caught with a stray\nHope he's okay\nJust got paid what Cochran got paid to free OJ\nJust to share my life on the stage in front of strangers\nWho know a nigga far too well, and that's the danger\nKnow me better than I know myself\nI rip a page out my notebook in anger\nAnd let these thoughts linger, singing\n\n[Chorus]\nDon't give 'em too much you\nDon't let 'em take control\nIt's one thing you do\nDon't let 'em taint your soul\nSing!\nIf you believe in God\nOne thing's for sure\nIf you ain't aim too high\nThen what?\nThen you aim too low\n\n[Verse 2]\nWhat's the price for a black man life?\nI check the toe tag, not one zero in sight\nI turn the TV on, not one hero in sight\nUnless he dribble or he fiddle with mics\nLook out the window cause tonight the city lit up with lights\nCameras and action\nMay no man alive come through and damage my faction\nI brought you niggas with me cause I love you like my brothers\nAnd your mothers' like my mother\nThink we need a plan of action\nThe bigger we get the more likely egos collide, it's just physics\nPlease let's put our egos aside, you my niggas\nAnd should our worst tendencies turn us into enemies\nI hope that we remember these\nNights fulla Hennessy\nWhen Hov around we switch up on that D'usse\nGotta show respect, one day we tryna stay where you stay\nCause we from where you from\nNot talkin' bout the slums\nI'm talkin' 'bout that mind state that keep a black nigga dumb\nKeep a black nigga dyin' by a black nigga gun\nAnd keep on listening to the frontin' ass rap niggas son\nYeah I said 'son'\nThis is New York's finest\nFor 11 winters straight I took on New York's climate\nLike show me New York's ladder\nI climb it and set the bar so high that you gotta get Obama to force the air force to find it\nNever mind it, you'll never reach that\nCole is the hypnotist, control the game whenever he snap\nThat's every track, sing\n\n[Chorus]\nDon't give 'em too much you\nDon't let 'em take control\nIt's one thing you do\nDon't let 'em taint your soul\nSing\nIf you believe in God\nOne thing's for sure\nIf you ain't aim too high\nThen what?\nThen you aim too low\n\n[Verse 3]\nI ain't serve no pies, I ain't slang no dope\nI don't bring no lies, niggas sang my quotes\nI don't play no games, boy I ain't no joke\nLike the great Rakim, when I make my notes\nYou niggas might be L or you might be Kane\nOr you might be Slick Rick with 19 chains\nOr you might be Drizzy Drake or Kendrick Lamar\nBut check your birth date nigga\nYou ain't the God\nNah you ain't the God\nSay what?\nNigga\nCole the God\nCole the God, Cole the God\n2, 6, nigga! (laughs)\nJanuary 28th...(laughs)\n\n[Outro]\nI'm tryna make a million dollars off a rap tune\nI'm tryna make a million dollars off a rap tune\nI'm tryna make a million dollars off a rap tune\nI'm tryna make a million dollars off a rap tune\nOne day I'll make a million dollars off a rap tune\n\n[Outro]\n*Crowd cheers*\nOh shit\nFayetteville, North Carolina\nFayettenam\n*Crowd cheers*\n2, 6, make some motherfuckin' noise one time tonight, God damn it! Bring all the lights up please so I could see everybody in this motherfucker one time tonight, God damn. Ayy, this shit's crazy. Ayy, this shit crazy. All the way in the back, wassup, we see y'all niggas in the back, wassup? Okay, left side, wassup, we see y'all niggas, man. Right side, what's poppin', God damn it! Ayy, yo, you know we see this shit down here, this shit lit, this shit lit. Ladies and gentlemen, allow me to introduce myself. I go by the name of J. Cole, Cole fucking World, and I'm from the Ville. A few months back, I dropped this album, it's called 2014 Forest Hills Drive, and shit I don't know if people heard about that shit. They tryna say, they tryna say it was the first album to go platinum without no fuckin' features and shit. They said that, they said that, I ain't say that, they said that, but since they said that, since they said that. Fayetnam, if it's cool with y'all, and only if it's cool with y'all, I'm tryna perform the whole fuckin' album for ya'll tonight if that's cool with you. Can I do that shit on some Ville shit? Ok then, on some Ville shit, ok then. But y'all know this whole album is a journey, from front to back, this whole shit is a journey. So before we get too far in the fucking journey, I wanna press rewind and take ya'll to a time where I was just a young boy", "image": "https://images.genius.com/6affcd514d0bc308d7761e9589cd9abc.1000x1000x1.jpg"}], "artist": "J. Cole"}