{"songs": [{"title": "Make That Ass Shake", "album": "Same Day,  Different Shit", "year": null, "lyrics": "[Verse 1: Kurupt]\nI got a fucked up habit for dumping and blasting\nJust picking on my niggers rolling around in the classroom\nJust making shit happen, tired of tripping\nIt's time to start living\nStart enjoying the rhythm\nForget, what I gave them , the joy in the rhythm\nI gave them what I give them, the joy in the rhythm\nI'm forced to come doing five fours\nYou're trying to take anything my life's value t'wards\nTrying to beat Caesar in Rome? I roam\nIt's my dominion, nigga, what I call home!\n\n[Chorus: Kurupt]\nYou can live how you want to live, I don't give a fuck\nNigga, bang how you want to bang, on who and when, what nigga\nAnd all you broads, I wanna see you shake something\nI want do something, rub you leg, your back, your stomach\nShe looked me in my face, then she told me to my face\nThere ain't nothing that she can't do to make her ass shake\nMore than a handful'll make that ass shake\nPussy popping back and forth, look at that ass shake\n\n[Verse 2: Kurupt]\nFine, seductive, bad than a motherfucka\nJust the kind of girl I like to cuddle in this motherfucka\nShe said anything got pleasured in this motherfucka\nI have to admit she said treasured in this motherfucka\nI know all she wants to do is get paid\nThat pussy popped all up and down on me\nMake it pop, make it pop, make it pop!\nTake it off, take it off, take it off!\nShake it up, shake it up, shake it up!\nShake 'em off, shake 'em off, shake 'em off!\nI put on [?] and she let me grab her titties\nBitch, don't you know I run this city?\nYou better ask these niggers all about me\nAnd anything you think about me\nAnd all you niggers, is this what you call war?\nIs this the future I'm looking t'wards?\n\n[Chorus: Kurupt]\n\n[Verse 3: Kurupt]\nAll I know is life's a bitch\nLet me hit you with some G shit\nLook, busters won't leave me alone\nI'm being attacked by imitations, man, like ? and clones\nI ain't out to get you\nWant to party? I'ma party with you\nWhich one of these flips you want to party with you?\nBut if you want to play, we could play it homie\nKick back and let the toy speak and say it for me\nI've been a fool before,I know the feeling\nGetting in the game, nigga? I know the feeling\nBut them k's and the bananas that's pilling\nMake us go bananas, blood pressure to the ceiling\nI've got a funny feeling\nMoney to the ceiling\nMake a nigga like feeling impenetrable\nI feel a strange awe, if I hit the store\nI might have to chip, one, two, three or four\nNiggers, in the front door, nigga on the floor\nNiggers [?] and hit the register drawer\n\n[Chorus: Kurupt]", "image": "https://images.genius.com/c251b0b346b28a8f4079b3f901685705.1000x1000x1.jpg"}], "artist": "Kurupt"}