{"songs": [{"title": "Waiting Room", "album": "Everybody", "year": "2017-05-05", "lyrics": "Atom: So, we waiting for what?\nGod: Excuse me?\nAtom: So you sittin here telling me, this place is a waiting room, right? What are we waiting for?\nGod: Rebirth\nAtom: Rebirth? Like reincarnation?\nGod: If that's what you wanna call it\nAtom: What the fuck you mean, “If that's what I wanna call it?” Either this is what it is, or this is what it ain't\nGod: Sure\nAtom: Chu mean? Ugh, this mothafucka\nAtom: A'ight, lemme get this straight: every time I die, I come here, we talk, and you send me back to earth to be reborn?\nGod: You know the last time we had this conversation it was in mandarin and you were 13\nAtom: Mandarin?\nGod: And a girl\nAtom: What? Nah, bruh, you fuckin' wit' me. Like, Jesus Christ\nGod: He was here too\nAtom: What? Wait, wait, so the Christians got it right?\nGod: Well I’m about to reincarnate you, Atom. I’d say everyone kinda got it right\nAtom: This is a whole lot to take in\nGod: I know. Trust me, I’ve been there\nAtom: So, how many times have I been reincarnated?\nGod: Many, many, many, many, many times\nAtom: If it’s so many times, why don’t I remember?\nGod: If we stayed here long enough, the lives you have lived, and the knowledge from each of them would return\nAtom: What?\nGod: I’m actually about to send you back to 1736 as Bryan Fairfax, the 8th lord Fairfax of Cameron\nAtom: Word, ayy, that sounds important\nGod: Oh, yes. You own 40,000 acres\nAtom: Goddamn! Oh, I’m sorry\nGod: Ha, it's quite alright\nAtom: Well, at least I’m not poor no more\nGod: Well, sure. With all that land and the hundreds of slaves you’ll own\nAtom: Slaves?! Aw, hell nah! No, no, no, no, look, look, look: how you gonna take a black man, send him back in time, and now I gotta own slaves?\nGod: Well, if it's any consolation, your son Tom, the 9th Lord Fairfax of Cameron, sets them free\nAtom: No! That does not make me feel better at all. Wait, hold up, I just realized you said you’re gonna send me back in time?\nGod: Well, I’m not really sending you back in time. That doesn’t exist where I come from, only in your universe\nAtom: Well, where are you from?\nGod: Honestly, Atom, even if I explained where I came from, or told you about the others like me, you just wouldn’t understand\nAtom: But if there's others like you, how can you be god?\nGod: Atom, I said you wouldn’t understand\nAtom: So what's the point of doing all this?\nGod: Really?\nAtom: What?\nGod: A little cliche, don’t you think? Essentially asking me the meaning of life\nAtom: Well, I figured I would ask before you send me back and I can’t remember none of this\nGod: Atom, come here. The meaning of life, the reason I created this place, is so that you can grow and mature\nAtom: Like the human race? Like this is how the human race is supposed to grow and mature? Mature into what? We can’t even get along\nGod: No, Atom, you! It’s for you, you to mature\nAtom: I don't understand\nGod: I created this place for you, Atom. This entire place was made for you. Every time I send you back, every life you live, you grow and mature and understand the grand meaning behind all of this just a little more each time\nAtom: Just me? Wait, what about everybody else?\nGod: Atom, there is no one else\nAtom: I don't understand\nGod: Atom, you are every human being who has ever existed since the dawn of your kind on earth\nAtom: Wait, I'm everyone?!\nGod: Ah yes, now you are beginning to see it\nAtom: So I’m like, everyone that ever existed on Earth, ever?\nGod: Earth? Ha, that’s cute. Earth was just your birthplace. Let us not forget all the stars humanity will colonize over the millennia\nAtom: Wait, that is so much. Too much to take in. I’m every human being that ever lived?\nGod: Or ever will live, yes\nAtom: I’m Jesus?\nGod: And all of his disciples\nAtom: I’m Hitler?\nGod: And the millions he murdered\nAtom: That's deep\nGod: You see Atom, every act of hatred and violence you committed against another, you were committing against yourself and every act of love and hand of kindness, you also extended unto yourself\nAtom: God, why do all this?\nGod: Someday, long from now, you will become like me. You will mature to become what I am\nAtom: I’m a god?\nGod: No, not yet. You see, I was once where you stand right now. It is not until you have lived every human life inside of your universe that I may take you from this place. Once you have walked in the shoes of every race, religion, gender, sexual orientation, loving and hateful person, it is only then that you will understand how precious life truly is", "image": "https://images.genius.com/1a2c364a06d2844fd9e294ee0ea798ff.1000x1000x1.jpg"}], "artist": "Logic"}