{"songs": [{"title": "White Boyz", "album": "Whiteboys (Original Motion Picture Soundtrack)", "year": "1999-07-20", "lyrics": "[Snoop Dogg]\nYeah wassup my nigga?\nI'm sittin here chillin with my nigga Kurupt and we sayin\nI mean it ain't no hard motherfuckin whiteboys in the rap game dog\nYou know? No disrespect (that's right)\nThat nigga Slim Shady is tight than a muh'fucka though (yeah that's true)\nBut we want a nigga to come with some GANGSTA shit\nYou feel me?\n\n[T-Bo]\nI went from rags to riches, to hittin these hoes and switches\nDuckin snitches, and these money hungry bitches\nSo you want a dollar? Well baby I can't holla\nYou ain't gettin' shit from the break-a-bitch collar scholar\nNot even a penny, homegirl you ain't gettin any\nOh by the way... you're too fuckin skinny\nWhy don't you go weep, and wash your stankin ass feet\nWhile my vogues burn, up and down the street\nEatin steak and shrimp, got my name on a blimp\nWalk with a limp, cause I'm a motherfuckin pimp\nMy diamonds is blindin yeah candy paint out shinin\nGot yo' bitch chasin me, while yo' old lady two-timin\nWhether you mobbin in buckets, or roll in a Benz\nKeep yo' eyes on yo' enemies, seperate yo' foes from yo' friends\nFuckin models, drinkin Alize by the bottles\nEleven hundred sixty yachter and my hand's on the throttle\n\n[Hook 2X: Snoop Dogg (paraphrasing Masta Ase \"Jeep Ass Niguh\")]\nWhite boy, white boy, turn that shit down\nYou know that America ain't ready for the sound\nFrom dem white boyz.. (white boyz) white boyz.. (white boyz)\nWhite boyz.. (white boyz) white boyz.. (white boyz)\n\n[Snoop Dogg]\nI'm high 'n a motherfucker, perv on the curve\nFuckin with this white boy, slangin my herb\nD.P.G. to the fullest young cuz\nMy homeboy Ricky said, \"Show me some love!\"\nHe got the club with this fool named T-Bo\nFrom the Dirty South, gold's in his mouth, my peoples\nAll of my homies from the L.B.C\nAll my white homies who smoke with me\nSell me bud on the weekdays cause\nThis shit's for y'all, from me and my doggz\nIf you don't know you do know T-Bo my new dog\nFuck what you goin through, we bout to fuck it up y'all\n\n[Hook: T-Bo says first line with Snoop] - 1/2X\n\n[T-Bo]\nYou know who I wanna be, that white boy, that everybody talk about\nThe one that's tearin up shows, fuckin these hoes, representin the South\nEyes bare-ly open, laid back in the Cadillac tokin\nThem hoes talkin bout ridin with me and Snoop the bitches must be jokin\nToke smoke, up the block and Glock stay cocked so you must get busted\nAnd my city's hotter than a corner full of hustlers\nTwelve slappin, trunk rattlin, and when you yappin we in a gun battle\nWhen you talkin the talk, we walkin the walk\nSo stay in yo' house when after dark\nYou bark and we bite, you're wrong and we're right\nKnuckle up in the club to push and shove til everybody starts to fightin\nYou might think the shit's funny, but fool we ain't actin\nYou bout that yappin? We bout that action and scratchin\nPlayin for keeps, screamin take it to the streets\nCamouflaged down, with them soles on my feet\nAnd up in the club, thugs push and they shove\nAnd you won't know who's a killer, so you betta watch who you mug\n\n[Snoop Dogg]\nBitch get your mind right, get your mind right\nBitch get your mind right, get your mind right\nYeah, white boyz up in the motherfucker\nMy nigga T-Bo!\n\n[Hook]\n\n[Snoop Dogg]\nYeah that shit funky dog\nThat's what I'm talkin bout\nMy nigga T-Bo, Dirty South all up in this bitch\n(We No Limit Soldiers, we No Limit Soldiers)\nYeah, Dogghouse Production\nDogghouse wreckin, bow wow\n(white white white white white boyz)\nThat's how we doin it for the nine-nine\nWhite boyz, yeah we fuckin with whiteboys in ninety-nine\nCause they fuckin with us\nYou know the game gettin deep\nWhite boys comin like dat\n\n[Hook]", "image": "https://images.genius.com/fca3c5a1adeda6fb86e285ff5815975a.200x197x1.jpg"}], "artist": "Snoop Dogg"}