{"songs": [{"title": "Move Ahead", "album": null, "year": null, "lyrics": "[Intro:]\nReal skills, Bronx styles, Cypress Ave meets Cypress Hill\nReal hip-hop, bounce to this shit motherfuckers, READ EM!\nYou know what's up, SHRAP!\nCommissioner Gordon rock on\nTony Touch why'all rock on\nKid Capri yeah rock on\nDJ Kenny Coffin yo rock on\n\n[Verse 1:]\nIn 199-sess, KRS is in his peak-in\nYou are weak-in and collapse like Mike, collect the beacon\nYou talk more ish than a cellullar\nYou can't last, just call me Enema\n'cause I give that ass-troid, heaven and mergatroid\nI'm that six, umm, microphone-holdin humanoid\nPyschological like Sigmund Freud\nBut I get annoyed 'cause these rappers have no brain\nThese hardcore rappers crack me up like cocaine\nThey got no skill or game\nThey sellin that commercial let me say it\n\"Ask for Minoxadil with Rogaine\"\nTrue skills I will explain\nThe teacher breaks this whole shit down plain\n\n[Chorus:]\nWest Coast beef must dead, no-ho-ho\nEast Coast beef must dead, no-ho-ho\nTime for us to move ahead, no-ho-ho\nBe -boy hip-hop is dead, no\nWe must move ahead (x8)\n\n[Verse 2:]\nPeople always say when they see us, teach us\nSo we move by the inch, teachin only some of it, believe us\nHustlas and players and hoes will never leave us\nThey been around since Mary Magdalene and Jesus\nRun wit it, pimps and players run the government\nWe been raised on a tonne of it that's why we're lovin it\nBein a player is cool when you a kid\nUntil you get sent up for a eight year bid\nNow you use and abuse and serve like hell\nTil one day you are found face down upon the ground\nTwo shots to the dome, we need to switch quick\nDyin over what you players, I think, call a bitch\nI'm not a player hater 'cause I hate no one\nBut when you start destroyin hip-hop, you gots ta go, son\nGovernment attack one who's brainwashed\nGovernment attack two who is, yes, brain rinsed\nGovernment attack three is for you and me\nTo constantly dream about the Lex with bulletproof tints\nIt's pointless to think I'm knockin ya\nIf you a pimp, be a pimp, I'll be a philosopher\nSo the....\n\n[Chorus]\n\n[Verse 3:]\nWhy-yes are the intelligent, we descend on every establishment\nIn the East or West, microphone grabbin it\nChess-to-chess, lyrical confrontation is dope\nFor the hip-hop nation, yet our hope, your scope\nIs broader than who can kill who and who got the biggest crew?\nThat's why black people cannot seem to break through\nIt's like crabs in a pot when one crab reaches the top\nOther crabs wish to pull down and blood (BLOODS)\nI'm not understandin what's all the fuss\nHip-hop belongs to all of us\nThe East created it, the West decorated it\nLearn the lesson, the unified picture is black expression\nWhen black expression heights itself\nIt becomes black digression leadin to depression in health\nNow question these ideas today\nIf hip-hop was destroyed could we blame the CIA\nOr the FBI, you'd be a motherfuckin lie-\n-er, li-are, pants on fire-er\nConspiracy theories are contrise or we keep them on the shelf\nWe got no one to blame but ourselves\nSo....\n\n[Chorus]\nWe must move ahead (x8)\nAll beef is dead!", "image": "https://images.genius.com/e9fa55af2e8bfddf3b40ea0e0347874f.556x556x1.jpg"}], "artist": "KRS-One"}