{"songs": [{"title": "Gold Roses", "album": "Port of Miami 2", "year": "2019-07-26", "lyrics": "[Intro: Drake]\nYeah\nI'm home now, it's over now, so...\nYeah\n\n[Verse 1: Drake]\nShe got a thing for Chanel vintage that dropped before she could speak English\nDo you love me or love seekin' attention, I mean which one is it?\nYou keep callin' me ya twin, but twins ain't this different\nMentally I'm already on next year, that's some 20/20 clear vision\nYou sayin' let you finish, I ain't tryna hear it\nI'm all for spiritual liftin', but I don't fly Spirit\nI'm all for findin' happiness, but down to die serious\nAll smiles, Kevin Durant trials\nHad to blow it on the court, I must have blew a milli'\nI'm walkin' on all charges, that's my new Achilles\nI know they love to rock a check, but who gon' do it really? Really?\nMy depositions never surface\nTanenbaum know the logo on the jersey, it's gettin' purchased\nTen years in and y'all yet to hear my most impressive verses\nPaid the cost to be the boss wasn't even my most expensive purchase\nTrust when I say I'm never on the shit they assumin' I'm on\nTales about me are like corridos in Culiacán\nSashimi from Saito, you know that man two Michelin Star\nPostcard from Grace Bay, sendin' my distant regards\nVision wasn't mine, told my niggas the vision was ours\nStill a part of shorty even if we've been livin' apart\nRoxx'll do you filthy for me soon as I give him the nod\nMeanin' he'll blast for me like puttin' the 6 with the God\nHop on a float to show the city the one they appointed\nThe one that's rebuildin' schools and feedin' the homeless\nHang with my niggas, but sometimes I be tryna avoid it\n'Cause they'll get to poppin' out of place like they double jointed\nGoals was the top of the pyramid in this shitty world\n\"I gotta get the most of everything\" is the axis on which it sit and twirls\nPoint blank period, like a City Girl and then I bring it back to 50 world\n\n[Chorus: Drake & Rick Ross]\nAyy, woah\nYou made me this way, yeah\nBefore I'm gone outta this place, yeah\nPut some flowers in my vase, won't you?\nLet me know that I did okay, yeah\nDon't wait 'til some other day, no, no\nThey love to wait 'til it's too late, it's too late\nThis different right here, yo\n\n[Verse 2: Rick Ross]\nI was nominated, never won a Grammy\nBut I understand, they'll never understand me\nLot of lives lost, but I never panicked\nLot of lines crossed, I never did a Xanny\nA hundred room mansion but I felt abandoned\nLove makin' love, but where will love land me?\nJealous, so their bitches be actin' like they sleepin' on us\nBut they speakin' on us, jewelers quote us even numbers\nStill blowin' smoke as angels float above us\nLove givin' back, but will they ever love us?\nChanel in the mail, FedEx from Pharrell\nAnd what I got for sale just sit on the scale\nTriple beam dream, a buck on the shades\nI really seen things give mothers the shakes\nI really bought cars for women on face\nI know it seem odd, but money amazin'\nCollege loans really did fuck up her credit\nDiscover cards, look back, I know she regret it\nBut we keep pushin', keep our foot on the pedal\nIn the mirror she a blessin', rebukin' the devil\nLivin' on the edge, she keepin' me level\nMoney come and go, I'ma keep you forever\nMoney come and go, I'ma keep you forever (Forever)\nSlip-on glass slippers and tickle with feathers\nEverywhere we go, we create a dilemma\nComing to America, really the set\nI'll let your soul glow, I'm keepin' you wet\nAll my cold Decembers, I know she remembers\nForgiveness for a sinner, but is it that simple?\nHoldin' on your hands, your body's a temple\nFly you out to Cannes, ménages with bitches\nLobsters and the prawns, thought you was Spanish\nBottles for the Don, our parties the biggest (Biggest, biggest)\n(Maybach Music)\n\n[Chorus: Drake]\nAyy, woah\nYou made me this way, yeah\nBefore I'm gone outta this place, yeah\nPut some flowers in my vase, won't you?\nLet me know that I did okay, yeah\nDon't wait 'til some other day, no, no\nThey love to wait 'til it's too late, too late (Ayy)\n\n[Verse 3: Rick Ross]\nHad a dream she was singin' to me like Gladys Knight\nTrue love in the projects is called paradise\nAll your niggas left, you wasn't actin' right\nBut honesty itself a small sacrifice\nMy money bag heavy, got me packin' light\nYou movin' funny, can you fill my appetite?\nNiggas' conversations, a lot of it false\nHe own condos right over Carnegie Hall\nSpeak about your cars, but all of 'em parked\nYour niggas' money light, come out of the dark\nYou really are my type, that's not a facade\nOne of the reasons why I write, we got a synopsis\nI'm always at the top of barbershop gossip\nAfter further thought, better not knock 'em\nAllocate some dollars to go out shoppin'\nBitch, we on the real, it's time to stop talkin' (Stop talkin', stop talkin')\n\n[Chorus: Drake]\nAyy, woah\nYou made me this way, yeah\nBefore I'm gone outta this place, yeah\nPut some flowers in my vase, won't you?\nLet me know that I did okay, yeah\nDon't wait 'til some other day, no, no\nThey love to wait 'til it's too late, too late (Ayy)", "image": "https://images.genius.com/238ace232657985076b15e96643813d2.500x500x1.jpg"}], "artist": "Rick Ross"}