{"songs": [{"title": "Shot Down", "album": "Grand Champ", "year": "2003-09-16", "lyrics": "[Intro: 50 Cent]\nOver and over I done told ya, boy\nI'm a G-Unit motherfucking soldier, boy\nAnd when you gon' get it in your brain?\nThe gate's wide open and the dogs off the chain\n\n[Verse 1: 50 Cent]\nI be that youngin with that gun that’s tellin' ya stop frontin'\nI be that yougin on the run after I pop somethin'\nIn the Bible I read death is of the tongue\nAnd if you talk about death enough death is gon' come\nJay taught me how to flow, they shot him in the head\nRandy ass was there, now he runnin' scared\nSome say I'm gangsta, some say I'm crazy\nIf you ask me I'll say I'm what the hood made me\nNow I can stunt 'til my ass dead broke like JD\nOr put a hundred grand on every nigga head that play me\nSee I'm cool with them Haitian mob niggas\nThey say ''Sak pase Nap boule'' and rob niggas\nThe media be tryin' to make a nigga look bad, what's with that?\nSee my flick next to Preme, Papi and Cat\nAnd Montana, I kill 'em with the grammar\nI enhanced in the slammer after bangin them hammers\nX, what up? (Aight)\n\n[Hook: 50 Cent]\nYou don't live that, you shouldn't say that\nCause what come out your mouth'll get you shot down\nThrowin' your money around and we don't play that\nGetting in our line'll get you shot down\nWe know where you hang, we know where you stay at\nThat bullshit you on'll get you shot down\nHere's a few cliques that you shouldn't play with\nG-Unit, Ruff Ryders'll get you shot down\n\n[Verse 2: DMX]\nFuck y'all niggas talkin' 'bout, think you playin' with?\nDouble R, G-Unit, the same old shit\nPut the faggots in the ring, watch 'em all quit\nAll y'all niggas is pussy, suck my dick\nAin't nothin' but a handful of man still standin'\nI remember 50 in a cypher when Onyx was \"Slammin\"\nNow we meet again, it's all good, my nigga\nBack to the street again, it's all hood, my nigga\nKnock on wood, my nigga, we both walk the dog\nWe ain't get to where we at by luck, shit was hard\nBut once we got through the trials it's all smiles\n'Til a big type nigga all of a sudden get wild\nNow why you gotsta go and take me back to where I came from?\nI'mma make you remember where you know my name from\n45th Street, and blaow-blaow Ave\nI done ran through your crew and only let off half, nigga\n\n[Hook: 50 Cent]\nYou don't live that, you shouldn't say that\nCause what come out your mouth'll get you shot down\nThrowin' your money around and we don't play that\nGetting in our line'll get you shot down\nWe know where you hang, we know where you stay at\nThat bullshit you on'll get you shot down\nHere's a few cliques that you shouldn't play with\nG-Unit, Ruff Ryders'll get you shot down\n\n[Verse 3: Styles P]\nIf your head ain't off of your shoulders\nYou ain't get shot, you got nicked nigga (just nicked)\nCause if my chrome hit a piece of your bone\nIt's gon' do more than chip, nigga (a lot more than that)\nYeah, what the fuck is the problem?\nThe Porsche is red, the buckets is army\n30 shot handguns, the gutter is starvin\nNiggas like me might rush your apartment\nBloodstains'll fuck up your carpet, brain on the window\nI smell murder every time that the wind blow\nTie him to the chair and then knock out his chinbone\nI don’t want the throne or the crown, I ain’t sell enough\nYou can have the jail or the ground, you ain't in hell enough\nI'm the one that flood the gutters\nBetter tap your man and let him know P'll love to cut his\nAnd niggas is gettin shot down, two guns up\nDouble R, S.P., holdin' D Block down\n\n[Hook: 50 Cent]\nYou don't live that, you shouldn't say that\nCause what come out your mouth'll get you shot down\nThrowin' your money around and we don't play that\nGetting in our line'll get you shot down\nWe know where you hang, we know where you stay at\nThat bullshit you on'll get you shot down\nHere's a few cliques that you shouldn't play with\nG-Unit, Ruff Ryders'll get you shot down", "image": "https://images.genius.com/e730418bfaada4fc845d1179160af643.999x999x1.jpg"}], "artist": "DMX"}