{"songs": [{"title": "The Raptism", "album": "The Sneak Attack", "year": null, "lyrics": "* H.W.C. harmonizes a melody (no words) where this appears\n\nSo gather round now for the raptism\nCause if the dogs don't get 'em\nThe cat'll get 'em, or the gat'll get 'em, or the crack'll get 'em\nTime for spiritual activism, life is a journey\nAnd Kris got the map with him\nTeach latinos and blacks with 'em\nIt's amazing when whites and asians kick raps with 'em\nCause out of a thousand MC's, believe I taught half of 'em\nKnowledge Reigns Supreme, I beam through many images\nMy origin is a mystery like capstones on pyramids\nWe live it kid, challenge the teacher you will regret that\nI'm giving careers and taking careers away, did you forget that?\nBetter check that, you can rock this track and the next track\nBut when I correct the spirit hit, you'll always be set back\nSo gather round now for the raptism\nOnly those that got hip-hop in 'em\nAnd not rap in 'em and no crack with 'em\nStep up now and receive a holy dose\nFrom a holy host, and take a break from these rappers that only boast\n\n{HWC} Wake up, to make up\n[KRS] Yeah yeah, yeah\n{HWC} Wake up, to make up\n[KRS] Huh, huh, yeah yeah, yeah\n{HWC} Wake up, to make up\n[KRS] Yo, yeah, yo..\nMy intellectual battle will make your brains rattle\nI'll unwrap you and your crew from the same shackle\nI'm on many different planes like a airport\nPsychologically you be rethinkin your identity and cuttin ya hair short\nNow there's a thought, that exposes your insecurity\nYou put no fear in me, I break the M from the C\nAnd reverse it to say \"See 'em? See 'em?\"\nThey allow the devil to lead 'em, and they be givin up they freedom\nSo, huh, gather round for the raptism\n{HWC} Wake up\nWhen the spirit hear it the lyric long before the track get 'em\n{HWC} Wake up\nI spit 'em out, gotta get 'em out, the world I never been about\nI see them glitter but their spirit's goin in and out\nWe see them fading, we also see them hating\nWe also see those living for musical chart ratings\nHear what I'm stating or trading for what you're paying\nReplace fear with faith and you'll stop decaying\nGather round for the raptism (word)\nGather round for the raptism (word, word)\n{HWC} Wake up, wake up, wake up\n* Gather round for the raptism\n{HWC} Make up, make up, make up\n* Cause if the dogs don't get 'em\nThe cat'll get 'em, or the gat'll get 'em, or the crack'll get 'em\nYo, yo, gather round for the raptism\n{HWC} Wake up\nWord.. word..\n{HWC} Wake up\nWord..\n{HWC} Wake up\nThe dogs don't get 'em\nThe cat'll get 'em, or the crack'll get 'em, or the gat'll get 'em\n{HWC} Wake up\n{HWC} Everyday, when you wake up\n{HWC} You got a chance, to MAKE UP!\nRemember, you are not just doing hip-hop, you ARE hip-hop\n{HWC} Wake up to make up\n{HWC} Wake up to make up\nTwice a year, hip-hoppers come together\nTo celebrate the unity of hip-hop\nWe come together, during Hip-Hop Appreciation Week\n{HWC} Wake up to make up..\nWhich is every third week in May\n{HWC} Wake up to make up..\nThen, we come together in Novemeber\nTo celebrate Hip-Hop History Month\nI will see you there - PEACE!", "image": "https://images.genius.com/756508fbcbfc3c6ac80f412ee6f089bd.1000x1000x1.jpg"}], "artist": "KRS-One"}