{"songs": [{"title": "Call Ya Bluff", "album": "Ludaversal", "year": "2015-03-31", "lyrics": "[Intro]\nYeeee-ah, buddy! (Wooo!) But, it fit right now (Ah yeah, I know right?), Gawd damn!\nMan, FUCK them niggas!\nWhoever they said they was, it don't even matta partna! (Yeah, fuck 'em!)\nThis the way we do, nigga (Ah huh!) The A in the buildin'!\nIt's whatever, they know where to find me at (Hmmm-hmmm!)\nThey know what's up (Right!), it's strictly business\nBeef, drawma, whateva you wanna cawl it, nigga\nFuck 'em, we ball!\n\n[Verse 1]\nYeah, anything you wanna do\nI'm ready to do it, my nigga, just say so (just say so)\nDon't say it on the record with your chest\nLeave the booth and then go lay low (\"okay guys, I'm goin' home\")\nHidin' behind your security detail\nActin' like a female\nI done sold over twenty million records\nI could really give a fuck about retail (history's been made)\nNow back to basics (basics)\nBack to Adidas with the fat laces (what up, Rev Run?)\nBack to the Ac,' where I'm ridin' to the track in the Jack\nGet it straight, nigga, no chasers (ah)\nAge ain't nothing but a number\nLuda rappin' like he just turned twenty-four (happy birthday)\nAny rapper wanna forget who I am\nEvery now and then I seem I gotta let em know (know)\nOh, must I remind ya?\nYou rap like somethin' behind ya (boo)\nGot paid but your heart pump Kool Aid (yeah)\nCover Girl make up shoulda signed ya (hahaha)\nBut it's never too late (nope)\nFifteen years, nigga, never too great (nah)\nFour years off gettin' Hollywood checks\nBut you niggas want beef and you lookin' like steak\n\n[Chorus]\nI see that liquor got you loose (got you loose) (got you loose)\nWhen you see me, nigga\nSay it like you said it in the booth (in the booth)\nI'll make you niggas lose a tooth (lose a tooth) (lose a tooth)\nWhen you see me, nigga\nSay it like you said it in the booth (in the booth)\nFuck y'all niggas, I'm the truth (I'm the truth) (I am the truth)\nWhen you see me, nigga\nSay it like you said it in the booth (in the booth)\nNow I'm like, fuck callin' a truce (callin' truce) (no truce)\nWhen you see me, nigga\nSay it like you said it in the booth\n\n[Verse 2]\nHol' up\nNever fuck with a nigga who got some kids (no)\n'Cause when you talk about me then you talk about them\nThen I gotta come where you live (I'm on the way, nigga)\nYou takin' food out they mouth\nNow I gotta put a fist in yours (blah)\nI don't play about my hustle, a nigga got all these acres\nAll my neighbors think I'm flipping them birds (woo)\nNah, but I be flipping these words (yeah)\nAnything you hear me saying, I could back up (back it up)\nAnd you talk so tough on the mic\nBut whenever you in sight, nigga\nSomethin' don't add up (don't add up)\nPut your money where your mouth is (Yeah!), wait, put a gat where your blouse is\nYou think it's funny, cause it's sunny where your house is\nBitch, I'll put my muddy ass boots where your couch is\n(Fuck yo couch!)\nI live this shit, you know you do this just for show, nigga (Deja Vu!)\nYou act as if Ludacris just came and took your ho, nigga (Really!?)\nYou's a ho nigga (Whispers \"Ho nigga\"), yeah I said it twice\nLet this be warning number two, motherfucker go and roll the dice\n\n[Chorus]\nI see that liquor got you loose (got you loose) (got you loose)\nWhen you see me, nigga\nSay it like you said it in the booth (in the booth)\nI'll make you niggas lose a tooth (lose a tooth) (lose a tooth)\nWhen you see me, nigga\nSay it like you said it in the booth (in the booth)\nFuck y'all niggas, I'm the truth (I'm the truth) (I am the truth)\nWhen you see me, nigga\nSay it like you said it in the booth (in the booth)\nNow I'm like, fuck callin' a truce (callin' truce) (no truce)\nWhen you see me, nigga\nSay it like you said it in the booth\n\n\n[Outro]\nI already know fake, nigga (Yeuh!), all gas, no brakes, nigga (Hahahaha!)\nAll that Simon Says shit, y'all got goin' on\nThat, \"Any-pat, pitta-pat\" elementary, school ass shit (AH!)\nThe hell is you talkin' bout, nigga?", "image": "https://images.rapgenius.com/7fb9a06d744e58ff6e10bf6c8f7c3dc4.1000x1000x1.jpg"}], "artist": "Ludacris"}