{"songs": [{"title": "Topless (Dr. Dre Verse)", "album": null, "year": null, "lyrics": "[Verse 1: Dr. Dre]\n1996, I left it all behind\nCause I ain't got no roof on mine\nI had to jump ship, I double back for my\nMy accountant handle my shit\nI never been the losing kind\nGrind\nI'm feeling like it's year one\nI'm a fool anywhere, near square one\nBut ain't no glass ceilings, I crash through 'em\nAin't no cold spells, I light a match to 'em\nAin't no haters, right, just say congrats to 'em\nThis is Detox, this rehab to 'em\nI bring it back years later, let it flow through 'em\nPutting that chronic in their system like I used to do 'em\nRespected, so it's proven that's what I been doing\nMoving the game like weight and everybody been using\nBitch, it ain't really nothing left to say\nYou're tuned in to Detox, I'm Dr. Dre\n\n[Chorus: Dr. Dre]\n(Pow) Guns blaze when I shine\nMake a wish quick, no star and I'm the shooting kind\n(Pow) Front page all the time\nYou boys think sick, but I ain't got no roof on mine\n(I dream topless, I live topless)\nLike my girl is the game with her titties out\n(I dream topless, I live topless)\nSky is the limit, I'm paid to run the city now\n\n[Verse 2: Nas]\nYour skin's your travelling bag of your existence\nYours is shabby and scab, while mine's glistenin'\nVivid on my skin, how many continents I visit then\nYou can journey with me to different places by listenin'\nShitting on them, your brother got it covered\nWe can slug it, knuckle it, however you want it, I love it\nA hustler's wit, the grit, the grind\nMy genetic code make up, murderer by design\nOn Mayan calendar time, when night meets day\nI'm in the light grey Bugatti like a high speed chase\nAdrenaline like jogger, the jumping rope in place\nMuhammed Ali hobbies, no Pilates, tryna keep the ocean by me\nHit a rich man's wife, see what these hoes can buy me\nLooking forward, but it's nice to see the road behind me\nHotel's a seven star, Baguette's glowing\nKeep your lid, yet dawg, the private jet Boeing, topless\n\n[Chorus: Dr. Dre]\n(Pow) Guns blaze when I shine\nMake a wish quick, no star and I'm the shooting kind\n(Pow) Front page all the time\nYou boys think sick, but I ain't got no roof on mine\n(I dream topless, I live topless)\nLike my girl is the game with her titties out\n(I dream topless, I live topless)\nSky is the limit, I'm paid to run the city now", "image": "https://images.genius.com/bf3badae49c33b583126057638078bd8.576x576x1.jpg"}], "artist": "Dr. Dre"}