{"songs": [{"title": "I Luv Dem Strippers - Chopped Not Slopped", "album": null, "year": null, "lyrics": "[Intro: 2 Chainz]\nLet's play big bank, take little bank\nYou are looking at a shark in a fish tank\nWhen I'm in the kitchen, I make plenty cash\nTell shawty come here, she got plenty ass\n\n[Hook: 2 Chainz]\nYeah, I love them strippers\nYeah, I love them strippers\nYeah, I love them strippers\nYeah, I love them strippers\nIn my foreign car, got the trunk by the engine\nSo when I back back, I'm fronting on you niggas\nYeah, I love them strippers\nYeah, I love them strippers\nYeah, I love them strippers\nYeah, I love them strippers\nIn my foreign car, got the trunk by the engine\nSo when I back back, I'm fronting on you niggas\n\n[Verse 1: 2 Chainz]\nFirst I back back, Louie backpack\nWhere's Paris Hilton? Where's Kat stacks?\nI'm round four with this ammunition, my camo come from Tru Religion\nThem broke hoes can't pay attention, your cutie missing, New Edition\nMr. Telephone man, there's something wrong with my line\nWhen I call my baby's number, I get a click every time\nEvery line is dope, you can snort it\nWorking in the pot, I can make you do aerobics\nI'm haterphobic, they mad cause I'm winning\nThey busy high and catching, mad cause I'm pinching!\nAll my bitches different, all my diamonds glistening!\nMy weed so loud, everybody listen!\nThey say it's for the birds, so I bought a kilo!\nMy Boost Mobile chirping, it must be my amigo!\n\n[Hook]\n\n[Verse 2: Nicki Minaj]\n2 Chainz, you fucking crazy, motherfuckers know I'm fucking crazy\nFuck wrong with these bitches lately?\nBitches better get on they knees and praise me\nBitch I rep that rich gang, Where's Stunna? Where's Wayne?\nThat's red on my wristband, SB, Mack Maine\nTell Tyga, lookin' for this bitch called Blac Chyna\nTake a nigga bitch in a hot flash, menopause hot flash\nYes that's why I'm crowned queen, and I ain't lookin' for the prom king\nThese hoes' careers ain't promising, killing these bitches crime scene\nOooh that's how a bitch do it\nFifty black trucks gonna follow when I pull up\nDick shit hit you in the chin like a pull up\nMy door so cocky, my door so stuck up\nOooh hop up out the space car\nBitches stay pressed, I call them a space bar\nMan I wish a bitch would, hundred-thousand dollar engine, I wish a bitch could\n\n[Hook]\n\n[Outro: Nicki Minaj]\nWait I don't even think these niggas understood what the fuck I just said\nI said, hundred-thousand dollar engine\nI wish a bitch could, like the little engine that could\n2 Chainz!", "image": "https://images.genius.com/f82a00deb2e816cc89005a9839eead69.1000x1000x1.jpg"}], "artist": "2 Chainz"}