{"songs": [{"title": "White House (Remix)", "album": null, "year": null, "lyrics": "[Verse 1: Rick Ross]\nYeah I'm still on that '96\nFirst time a nigga ever seen 90 bricks\nYeah them crackers gave Booby life\nI got too much money now I'm living Booby life\nMoving heavy weight it's funny that my uzi light\nI'm getting money see a hundred on a Tuesday night\nI fuck with Opa-Locka, I love my nigga Ned\nOne time for Fat Wayne, my niggas beat the feds\nFuck all these rap niggas, I'm on some other shit\nOwe a million to the Cubans, IRS, and government\nYeah I showed love, but I was shitted on\nSo now I'm onto war, and you can get it homes\nYou want to know who I'm talking to?\nIf it's fuck me, pussy nigga fuck you\nThey hate the Maybach, they hate the B.M\nIn the last year I done blown 3 M's\nI'm putting out 3 films\nBlue Levi's breathing on them green Timbs\nI love y'all, so nigga love me\nYou like my only son, so come and hug me\nI'm where the thugs be, with all my jewels on\nGo ahead and judge me, she want to touch me\nShe wants to call me, she wants to fuck me\nNow should you blame her?\nA nigga famous\n\n[Verse 2: Brisco]\nLet me think back to '98\nWhen Ricky finally rose his right and swore before the state\nThey gave him life, I was just turning 16\nA little G, four hundred thousand when I'm 18\nBorn on the side of town where them killers ride around\nWith two open cases, four pills, and a full pound\nChrome in his pants, and he standing like \"Fuck you\nI'm reppin' Opa-Locka, so don't make a nigga touch you\"\nWe open traps with three workers and a LT\nSticks on deck in case these pussy niggas want beef\nIt's the white house, nigga shoot the lights out\nStop the whole game when them niggas pull them dice out\nI'm fat, happy, two shade, black Willy D\nI'm teary eyed I swear to God and a nigga itchy\nTriple C, black flag, what the lick read?\nI'm a dat boy, who want ?\n\n[Hook: Rick Ross]\nI'm in the White House\nI'm in the White House\nI call the shots, I could get your ass wiped out\nWe in the White House\nWe in the White House\nBig Phantom on the lawn getting wiped down\n\n[Verse 3: Flo Rida & Young Breed]\nHEEEEYYY!\nI'm in the White House, Dick Cheney my watch out\nNo Condoleezza Rice it's clean pots and pans now\nI bleach the floors, I get clean just like Ochoa\nOr Mickey Munday them bricks white as Al Gore\nIf I don't fuck with cookies nigga why am I the Keebler man?\nThey don't want that triple beam scale or that beaker sand\nThem birds lookin' like my Air Force 1's\nThey all get checked I don't care if it's a ton\n(Flo you've been off them)\nSo don't let your boy toss them\nIn the Everglades, nigga the certified Dade\nBobby Brown baby, in the motherfucking Mayb\nLike little Nicky Scarfo with a Colombian named Papo\nWe'll send a thousand of 'em\nYou send a thousand more\nThat's seven stacks a piece to lock down the whole east\nAnd nigga that ain't eating that's a motherfucking feast\nThem Poe Boy stacks, hey Ross where we at?\n\n[Hook: Rick Ross]\nI'm in the White House\nI'm in the White House\nI call the shots, I could get your ass wiped out\nWe in the White House\nWe in the White House\nBig Phantom on the lawn getting wiped down\nI'm in the White House\nI'm in the White House\nI call the shots, I could get your ass wiped out\nWe in the White House\nWe in the White House\nBig Phantom on the lawn getting wiped down\n\n[Verse 4: Gunplay]\nI'm a thousand DB's\nI'm 'bout violence no peace\nMy yacht was a thousand degrees\nDrop 'em, fuck copping them pleas\nThe robbers be robbing with me, they riding with me\nIn Caddy DeVilles, we tatted the grill\nBusted out my product in the dollar trynna get more\nLimo DB's hide the murder, in the wind I'm burning indo\nMansion signing party Ren Rover should have been there\nBoosie too, Thirty Right\nDamn! I'm losing all my niggas\nTriple C records and reels, Trilla on deck\nBlack flag next\nGunplay, Killswitch\nBitch it's over what's over\nCut the check, you feel the full effect\nI finally realized how many niggas full of shit\nSo many murders turned the White House burgundy\nTriple secret service whiffing bourbons on purple weed\nAddicted to diamonds and hood bitches with purple weaves\nCocaine, Hennessey, Gunplay out the candle free!\n\n[Verse 5: Torch]\nAin't no plan B's with no degree\nI'm hand-to-hand on these streets\nZone ? move it by the O, man-to-man D\nTorch call me T.O., relocate with them kilos\nCeelo with them burners early\n4-5-6 shit cause he sold\nThat rock, cooking non-stop\nPots never chill\n? same block, better deals than them other niggas\nConnects with southern niggas getting bulk\nBruce Banner wrapped in that saran bitch I'm shipping Hulk\nSoon as they smoke it, they shaking like we're Hogan man\nWhen they bring they mama TV through you know it's that DISH!\nTriple C's set up shop on any ave\nDisrespect and get your head shot, all you see's the flag!\n?\nAll I see is more cash, your ass in the way\nBitch my name global, same soldier, bi-coastal\nWent from dealing weight local to real estate mogul\nMotherfucker who YOU?", "image": "https://images.genius.com/3dce21029cdd8aab73eb473e015807d5.1000x1000x1.jpg"}], "artist": "Rick Ross"}