{"songs": [{"title": "20 Wave Caps", "album": "Doris", "year": "2013-08-20", "lyrics": "[Verse 1: Domo Genesis]\nLook for me!\nLost in a whirlwind, 2012 quality\nHigh up until the world ends, doing eighty-five in my ride\nAnd these niggas hiding, know I'm striding like a giant\nI ain't lying when I'm rhyming, rule these niggas like a tyrant\nDamn, Doms, it don't even seem like you trying\nKnow these niggas crucify 'em, couldn't crack him, I'm a diamond\nI know that niggas is finding my progression so uncommon\nThe pressure I'm still applying until I hear the angels crying\nSad day in Hell for those who doubted, hope your head explode\nCry about it, but don't deny that Doms got the realest flows\nMy eyes is feeling low, pulling on the killer 'dro\nChilling with a vixen, thinking \"This is what I did it for\"\nStill banging, Wolf Ganging as if you niggas didn't know\nStill trifling, Loiter Litter Life and triple sixing, ho\n\n[Break: Earl Sweatshirt]\nDoms, Doms\nDoms\n\n[Verse 2: Earl Sweatshirt]\nWhile they ripping through the packaging to grab the shit\nI'm shaded with the few whom I usually blow cabbage with\nNew patterns patty-caking with mannequins\n'Cause I don't like my fucking homies dip, bruh, they all\nJaw-slacking, all 'em awe struck\nAnd I ain't got shit but a pretty bitch and cigar tucks\nRiding in the city and knocking out in the Starbucks\nI swear these niggas is fucking phony, smoking spliffs\nAnd that's, prior to arriving to the studio\nEyes glued to a gluteus maximus, attractive lady\nWhere you headed with that shit?\nAnd can a real nigga get a look at it?\nCrook, panic-shook, ain't ya?\nBlunt fatter than some butch ankles\nCheffing, fit the cook apron, ante up for good payment\nRun until my foot achy, running 'til my foot aching\nFull-grown terror type, Ferragamo do-rag\nWith my nigga Travy out in Maui, running two-mans\nSmoking 'till I'm loopy as a motherfucking toucan\n20 minutes, burn a fucking quarter back to two grams\nBut I'mma dip, I know you must have had it with my rude ass", "image": "https://images.genius.com/4ffe0cff138a9901c8034b4cf5a92b79.630x630x1.jpg"}], "artist": "Earl Sweatshirt"}