{"songs": [{"title": "Teriyaki Joe: Neo-Harlem Detective (Chapter Five: Gumbo)", "album": "Teriyaki Joe: Neo-Harlem Detective", "year": null, "lyrics": "[December 5, 2013:]\nTeriyaki Joe: Neo-Harlem Detective\n\nChapter 5: Gumbo\n\nMorning. The sky is a television screen. The \"sky\" is the bottom of Central Park\n\nA sunrise and a sunset and all other galactic phenomenon are broadcasted across the bottom of Central Park to be viewed by us Downstairs\n\nThe bottom of Neo-Harlem provides the same courteous service to Neo-Orleans which won its spot underneath us. We call it the basement\n\nUnderneath that in no particular order is Old London, Sau Paulo, what's left of Los Angeles & Moscow and that's pretty much it\n\nCity states stacked on top of each other like a shish kabob. Earth decided to a go a little nuts orbitally speaking.\n\nScientist still can't explain it. But in short Earth began spinning out of control &. what wasn't literally thrown into space was BBQ'd off.\n\nSome say that's it all a conspiracy and were actually living inside some science project out in the middle of the desert & nothing is real.\n\nEither way here we are. The cities or at least the parts that were able survive the tumult & the apocalyptic meltdown that followed...\n\n..signed treaties and created \"The Caste\" with the ruthless & rich Central Park literally at the top and us unlucky bastards at the bottoms.\n\nThe rest of the planet is either fully automated manufacturing facilities or nothing. Central Park controls all modes of production.\n\nEverything else, religion, philosophy, crime, etc just kind gets in where it fits in. Not lawless but definitely \"law-least.\" Why not?\n\nWhen the very Earth you live on takes an unexpected shit on you & your way of life everything kinda goes out of focus. Welcome to the blur.\n\nThe position of the real Sun over Central Park hasn't changed in about 100 years. If it wasn't 4 the Nano-Gravy it would've been burned away.\n\nIt's literally the tip of the iceberg. Gotta be \"born\" there to live there kinda jazz. An Invitation only Taichi party for the fancy tyrant.\n\nIt's ultra-simplistic in form. Just grass, the glass buildings and the all encompassing Gravy. No history, no future. Just never-ending now.\n\nNo pressures, no sympathies. Just calm and nihilism. Hence why 11's request, I mean threat, to bring his daughter back is so out of order.\n\nDown here in Neo-Harlem it's none of that. It's all about maximum consumption all the time. Crime & nostalgia & love & hate.\n\nLiving like no tomorrow was yesterday. Like the end of the world came and left us behind like bastards on the steps of an abandoned church.\n\nLuckily ppl still want2 find things so that keeps me employed. Luckily 4 them Im really good @ it but maybe not so lucky 4 me this time tho.\n\nI spent the night pondering my next few moves. I knew I needed a Mambo Queen and that meant going Downstairs to Neo- Orleans.\n\nFor obvious reasons I'll need a disguise. And a guide who knows her way around...an Eve to lead Adam to the Apple tree. An Eve indeed!\n\n---End Of Chapter 5---\n\n#TJNHD", "image": "https://images.genius.com/2c3df61679d5348d24cc5a0dc865540b.533x533x1.png"}], "artist": "Lupe Fiasco"}