{"songs": [{"title": "Knock, Knock", "album": "Legend of the Liquid Sword", "year": "2002-12-10", "lyrics": "[Verse 1]\nI'm the obscene slang kicker with no parental sticker\nAdvisin' y'all that wise words is much slicker\nUnder circumstances label advances\nAmple opportunity, infinite chances\nTo rhyme, so unrelated beef I don't stress\nI seen many killed for infinitely less\nYa raps be the clips that's, packed with lies\nCowardlessly ya shoot up those innocent bys\nIn extra long verses, hundred bars in length\nThe percentage of the truth in the rhyme is one tenth\nA solid mass of minerals, easily broke down\nHard rock MC's ya nuthin' but compound\nSparked by the endless greed of CEO's\nIn the videos, with those questionable flows\nTake it twenty-six, cut it down to four bars, make it a hook\nIf it's not on the song it's in a book\n\n[Hook]\nKnock Knock\nWho the fuck is bangin' at my door?\nIs it abstract commercial or hardcore?\nBetter know who the fuck they lookin' for\nCuz they don't want more\nYo Knock Knock\nWho the fuck is bangin' at my door?\nIs it abstract commercial or hardcore?\nBetter know who the fuck they lookin' for\nThey don't want more\n\n[Verse 2]\nThe CREAM of the crop we run circles that remain symmetrical\nWith lightnin' victories that's highly electrical\nMy microphone is just too hot to handle\nPlus I don't fill ya ears with the, Pennister's scandal\nI gift wrap the sawed-off, the DJ pump it\nMarch to the sounds of Armstrong trumpet\nGreat things satisfy great minds\nYou want me to paint scenes describe it in eight lines\nCheck it\nConceptional breakthrough, incomprehensible\nRap that make you, convinced it's invincible\nLease up my words, powerful hazardous\nThe most dedicated research the data; this\nInfo, tempo, is gatherin' momentum\nA thousand rounds of ammo wonderin' who spent them\nApplied science to, vocals we flyin' through\nVictorious always because I am who?\n\n[Hook]\nKnock Knock\nWho the fuck is bangin' at my door?\nIs it abstract commercial or hardcore?\nBetter know who the fuck they lookin' for\nCuz they don't want more\nYo Knock Knock\nWho the fuck is bangin' at my door?\nIs it abstract commercial or hardcore?\nBetter know who the fuck they lookin' for\nThey don't want more\n\n[Vers 3]\nI wrote this rhyme with a Sharpie\nYou see this dark key ignition's for those with keys\nWho wanna start me up\nThat's where nature and nightmare converge\nWhere you hold in so much inside, ya gotta splurge\nOn these snakes with the fangs that, poke through your denim\nWhen ya move it accelerates the action of the venom\nBut the purity and sacrifice gettin' stung twice\nFrom those who load dice, the target is G-Grice\nCuz rhyme travelers are light years beyond\nThe Clan had a bomb that made the world respond\nConsidering my own future, I'm used ta\nDamaging MC's than party-ing with producers\nWhose main makin' cereal from two tracks of stereo\nHold that song's playin' weak ass material\nWe all peak at a singular point in time\n'Till you see the sign, nigga resign\n\n[Hook]\nKnock Knock\nWho the fuck is bangin' at my door?\nIs it abstract commercial or hardcore?\nBetter know who the fuck they lookin' for\nCuz they don't want more\nYo Knock Knock\nWho the fuck is bangin' at my door?\nIs it abstract commercial or hardcore?\nBetter know who the fuck they lookin' for\nThey don't want more", "image": "https://images.genius.com/6eec7781b61d16cab75a144ab36ff78d.500x500x1.jpg"}], "artist": "GZA"}