{"songs": [{"title": "Work (Freestyle)", "album": null, "year": "2013-08-01", "lyrics": "[Verse 1]\nPut in work, put 'em in a hearse\nKilled my lil nigga Snupe\nShit I had to put him the dirt, 'fore I put him on a song\nShit I had to put him in a verse\nSo if you ever see his killer\n50 racks on a nigga, put him on a shirt\nHeadshot, headshot\nFor 50 G's you better make his bed rock\nThese niggas talking beef, I'm eating lamb chops\nAt Philip's 20k just to eat, y'all Niggas dead-pac, hold up\nYou starving nigga, like Marvin nigga\nI'm on the wood, hold up let me pause that nigga\nBut I'm talking Garden nigga, watching Melo ball\nWhy you talking work? You ain't never sell no raw\nYou ain't never cracked no bird\nYou was never at no curb\nPoppin' wheelies me and A$ap Ty, ray-day down 123rd (like man,man,man,man)\nAll these hoes fuckin' nigga\nIf you ain't talkin money it ain't nothin nigga\nWhere your foreign you ain't stuntin nigga\nIt's levels to my bitch you can't fuck her nigga\nCause she like Chanel, you couldn't afford her\nShe got a TL you rockin a Honda Accord bruh\nSee you the type of niggas my niggas gon send to the store bruh\nWon't even let you hit the weed, I know this for sure, bruh\nTalk cocky nigga, and y'all can't stop me, nigga\nHundred grand going straight to my jeweler\nASAP make the bezel rocky, nigga\nAnd I ain't talkin bout Rocky, nigga\nHold up, what the beat, drop, my nigga?\nHunnit in this bitch shine bright, shine bright on the watch my nigga\nI'm gone off with that money\nAnd if that pussy good, then I eat it\nAnd my bitch bad, talking Michael Jackson\nSo it's just only right that I beat it\nAnd if them niggas snatch your chain\nIt's just only right that they keep it\nAnd it's just only right that they rock it\nPut it on Worldstar, and make you watch it nigga\nAnd I ain't get my shit snatched yet\n[Pause]\nFuck with me, you know I got it\nBad bitch, I hope she bout it\nGetting money, you know I got it\n100 bands, I don't own no wallet\nAll y'all niggas be talking shit, talking shit\nTalkin jewelry, talks on whips\nWhere your car? Talk your bitch\nMan P'Mon plottin, she might get hit\nCause that's a sniper", "image": "https://images.genius.com/6929169de7116d41676151bdea5cc773.1000x1000x1.jpg"}], "artist": "Meek Mill"}