{"songs": [{"title": "Wait For You", "album": "Gutter Rainbows", "year": null, "lyrics": "[Intro: Talib Kweli]\nYeah, hey, yeh\nAnd who are you to be talkin 'bout, what I be doin man?\nI'm the upper echelon, who is you to evaluate my performance?\nHow would you like it if I came to your job\nAnd evaluated your performance? {*laughter*}\nAre you the best at what you do?\nYour name don't even come up in conversation man\n\n[Hook: Talib Kweli & Kendra Ross]\nBetter get it while the gettin is good, and do what you do\nNo hesitation, ain't no time for playin games\nGo 'head and take all you can, and grab with both hands\nDo it big or they won't even know your name\nWhile the gettin is good, you do what you do\nNo hesitation ain't no time for playin games\nGo 'head and take all you can, and grab with both hands\nDo it big or they won't even know your name\n\n[Talib Kweli]\nYo, aiyyo\nWhat are you doin wit'cha life? Your time on Earth is sacred\nThe time you spend at your plantation is it worth the paper?\nIt's like you workin for nathan, the money's circulatin\nYou can't pay your mortgage but you buyin bottles perpetratin\nChill with them threatening raps\nYou sound lame, you a snake, you made the plane with your venomous acts\nThey call me Gentleman Sav\nCause I back Miss Congeniality like Benjamin Bratt\nAttractin chicks who like the \"Feminine Fatt\"\nWhile you only deal with the bitches, I deal with the realest women\nIt's ill how they feel the rhythm in they mid-section\nWhen they blessed with the child-bearin hips\nBut the softest pair of lips is when they hair get flipped\nI love my culture and heritage, it keep me from being derelict\nInvested in myself like this was Merrill Lynch\nBeen waitin for my second comin like I'm heavensent\nEven though I'm not your savior I'll grace you with my benevolence\n\n[Hook]\n\n[Talib Kweli]\nYo, yo, yo\nMy style is unfadeable and haterproof I'll slay the booth\nI'm known to interrupt the program like late breakin news\nSome say its only eggheads that I cater to\nWell wait a few in order to make an omelette I gotta break a few\nMy plate is full, I wasn't 'sposed to be here but I made it through\nMy reputation grew, I left.. blood on the stage for you\nHow dare you say that my commitment is debatable\nI'm married to the music; you rhythm then I'm a slave to you\nCommercial artists so relatable\nThe consumer appetite is insatiable, I could do what they could do easily\nBut then they'd say Kweli be seemin fake to you\nRecord sales ain't makin you, money is motivatin you\nThe artist gotta lead I hope the fan base stay with you\nThe products shoddy if you rush it for the paper true\nD'Angelo and Sade they, take a decade or two\nKeep that good music comin and they'll wait for you\n\n[Hook]", "image": "https://images.genius.com/195bc58c1487ceee38b62b9e3ae90bdb.300x300x1.jpg"}], "artist": "Talib Kweli"}