{"songs": [{"title": "When My Niggas Come Home", "album": "California Republic", "year": "2012-04-05", "lyrics": "[Pharrell]\nAin't no other nigga here real as my dude\nHe used to throw money like this (whew!)\nHoney what ya lookin' at? Ain't no need to guess it\nStand over here, you about to be a legend\nWhen my nigga comes home\nWe gon' party til six in the mon'\nWhen my nigga come home\nWe gon' pop champagne 'til it's gone\nI tell you, when my nigga come home\nWe gon' celebrate!\nLobster, shrimp, Roscoes and steak\nWhen my nigga come home\nHe can have any damn thing that he want\n\n[Verse 1: Game]\nI got a nigga locked up for about a knot of money\nHe did nine years, be home before I finish this blunt\nI just bought a ounce of skunk\nMe and my nigga bout to go hard, like when LeBron dunk\nWe ridin' high, like southern niggas in the dump\nErrybody and they mama know UGK in the trunk\n(What's in the backseat?) North Kakalak freaks\nAnd the shit we be smokin' could melt the Mac off they cheeks\nThen we headed to that magic city, he ain't seen no ass and titties\nIn about a decade, these hoes about to get paid\nThey took him to the back, I ain't seen his ass in two hours\nTwo time felon taken a shower in the motherfuckin' strip club\n\n[Hook:]\n\nInhale, inhale\nBlow it out, blow it out\nInhale, inhale\nBlow it out, blow it out\n\n[Verse 2: Game]\nWhen my nigga come home, that's on everything I got him\nYou know why? Cause we was like that, and we came from the bottom\nYou know how many bitches I was mad that I took\nCause I couldn't throw up the hood, the police had me shook\nAnd all he wanted was a super head's book\nSo I sent it cause I meant it, now the clothes is for crooks (?)\nAnd ya girl? She fine as a motherfucker\nTold you she cheated on you? She was lyin' like a motherfucker\nWhen you went in, we was dreamin' about the tre\nNow it's four door flyin' spur, with Killafornia plates\nRemember when we was in the spot, writin' to them Dre beats?\nNow I'm fuckin' with some nerds, chattin' with Skateboard P\nRemember when we was hard\nSayin' to each other nothin' ripppin' us apart\nNow a nigga ballin' and you sittin' in the yard\nBut you comin' home to the Ferrari and a card, max that motherfucker out\n\n[Hook:]\n\nInhale, inhale\nBlow it out, blow it out\nInhale, inhale\nBlow it out, blow it out\n\n[Verse 3: Snoop]\nOne thing you can count on when you touch down\nYou gon' have it all, laid out, everything is paid out\nComin' home eventually, in the penitentiary\nThe homies like to mention me, cause I looks out essentially\nBig Reese Cup, J Dog and Trey-D\nYoung Joe Dog, Scotty Boy, NYC\n(?)\nBlue put me on the set, nigga, it's twenty Crips\nMy cousin' Flip been locked up for twenty five\nAnd Trey-Lo? He's a real twenty-Crip for life\nAnd if I mention your name, you know the business cuz\nWhen you get out, you know we livin' it up\n\n[Hook:]\n\nInhale, inhale\nBlow it out, blow it out", "image": "https://images.genius.com/e6b76fdc2635fdc0e9d62ceb9907eb3c.750x750x1.jpg"}], "artist": "The Game"}