{"songs": [{"title": "And They Say", "album": null, "year": "2017-05-14", "lyrics": "[Intro]\nHuh\nNananananana nananananana\nAy, what they say?\nAy, what they say?\nWhat they say?\nAnd they say\nNanananana a-nanananana (huh)\nNanananananananana\nNa nananananananana (IGH, IGH!)\nNanananana a-nanananana  (huh)\n\n[Verse 1]\nI know the words  (IGH, IGH, IGH!)\nI know the words\nHaven't you heard?\nNew album alert\nThis shit loud as the purp\nWe out in the burbs  (huh)\nOut of the streets, we was out on the curb\nFrom out of the dirt, a mountain emerged\nA willow was birthed\nIt's alright, I wept, I prayed on it, slept on it, wait on it (IGH, IGH!)\nJust flame up with Tunechi, you know that you Gucci\nJust somethin' to say on it  (huh, huh)\nSmoke like a sailor, curse like a chimney (huh)\nMy pop's in the mirror, Mufasa is in me\nI ain't no goofie (I ain't no goofie)\nI ain't no goofie\nI am the re-up, I am the plug, you can't introduce me (who is you?)\nThis ain't a movie, I don't need jewelry, I don't need groupies\nI need my money, I need my money, I am the movement\n\n[Refrain]\nAnd they say nanananana nanananana\nNanananananananana nanananana nanananana\n\n[Verse 2]\nMan I ain't no lame (huh)\nI know the game\nI know my daddy (huh), you can tell when I speak I got his name (huh)\nI'm on my business (I'm on my business)\nI'm not in the business, I'm not a prisoner\nI got my soul (I got my soul)\nI flaunt, I wear it, I'm still a Christian, I still got hitters (I still got hitters)\nReese and Justin a phone call away\nThey say no delay, and ándale! they on the way\nCatch me in the city on the Divvy with the kiddies givin' tours to the tourists\nGivin' our city to the kids, like givin' flowers to the florist\nNeed a little scratch but the tours itch\nProud to go where the pot of gold too rich\nGrab a couple bucks, take some more with you (huh, huh)\nYe ain't know open mics open doors did you? (huh)\nI ain't no stain, I am for free\nI am a promise, capital \"P\"\n\n[Refrain]\nAnd they say nanananana nanananana\nNanananananananana nanananana nanananana", "image": "https://images.genius.com/9db1a9643a028d62543e44c90da3a6ad.1000x1000x1.jpg"}], "artist": "Chance the Rapper"}