{"songs": [{"title": "Somewhere In Paradise", "album": null, "year": "2015-12-13", "lyrics": "[Chorus 1: Jeremih]\nI believe that if I fly, prolly end up somewhere in paradise\nI believe that if I fly, I'll prolly end up somewhere in paradise\n\n[Verse 1: Chance The Rapper]\nChancelor the rapper, Chatham the hood\nSanta to children, had to bag up the goods\nThey say I'm savin' my city, say I'm stayin' for good\nThey screamin', \"Chano for mayor,\" I'm thinkin' maybe I should\nFucked a few A&R's, told 'em, \"Bitch I can’t wife you\"\nTold your ass since day one, I don't like labels or titles\nI'm a rascally rabbit, I know that tricks is for addicts\nThat need fixes for habits, in love with carrots and cabbage\nI'm a savage, established, bad bitch magnet, I'm magic\nYour majesty, I'm majestic, I think my message is massive\nThink you passive aggressive\nI think you passed up your prime\nThink you passed up your chance to be Chance\nNow pass it to Arab\nI should have rhymed it with rhyme\nAin't we been here before?\nAin't my principal told me that I can't rap at that show?\nThen I rapped at that show, simple as that\nGot a complex from Complex off of the simplest raps\nAnd it goes like...\n\n[Pre-Chorus: Chance The Rapper]\nFannin' the fire, hands is up higher\nCannot believe it, damn I'm a rider\nRidin' on twenties, twenty years prior, I couldn't buy a\nForget it you get it\nGod is so awesome, devil's a liar\nTake 'em to church, but I need a choir\n\n[Chorus 1: Jeremih]\nI believe that if I fly, prolly end up somewhere in paradise\nI believe that if I fly, I'll prolly end up somewhere in paradise\n\n[Verse 2: Chance The Rapper]\nBlow out your speakers, roll some more loud\nThat's the sound of the reefer, I think my parents is proud\nThank my fans in the bleachers\nThink my teachers need features\nI think I'm walkin' with Jesus, I knew my feet wouldn't drown\nI been close to the edge, I been trippin' and stuff\nSomebody slipped me a mickey but I ain't giving a fuck\nReally, a milli'? How 'bout six billion more\nOr I'm outie like how'd he cut that umbilical cord?\nAs I smoke herb in this Uber suburban dressed in an Urban Outfitters\nShirt and burgundy pair of Jordans\nI asked the acid if words were worth worryin' over\nHer explanation seemed agitated\nShe said let me answer your question\nWith some questions questionin' yours\nLike why the devil can't get you?\nAnd why these labels can't catch you?\nAnd why'd he make you so special, why did he bless you?\nThink about it\nI woke up this mornin', I woke up this mornin'\nGotta smile when I say that shit, I woke up this mornin'\nGo!\n\n[Pre-Chorus: Chance the Rapper]\nFannin' the fire, hands is up higher\nCannot believe it, damn I'm a rider\nRidin' on twenties, twenty years prior, I couldn't buy a\nForget it you get it\nGod is so awesome, devil's a liar\nTake 'em to church, but I need a choir\n\n[Chorus 2: R. Kelly]\nI believe, I believe, there's somewhere out there for us all\nThere's a paradise (there is a paradise)\nI believe that if I die, I'll see my homies somewhere in paradise\n(I'll see 'em somewhere in paradise)\n\n[Pre-Chorus: Chance The Rapper]\nFannin' the fire, hands is up higher\nCannot believe it, damn I'm a rider\nRidin' on twenties, twenty years prior, I couldn't buy a\nForget it you get it\nGod is so awesome, devil's a liar\nTake 'em to church, but I need a choir\n\n[Outro: Choir]\nI believe, I believe, I believe\nSomewhere in paradise\nI believe, I believe, I believe\nSomewhere in paradise\nI believe, I believe, I believe", "image": "https://images.rapgenius.com/d4667e86f5d50bcc6761d46cdf50391f.1000x1000x1.jpg"}], "artist": "Chance the Rapper"}