{"songs": [{"title": "The Hooch", "album": null, "year": "2016-08-12", "lyrics": "[Chorus]\nWrist, wrist, mix up the hooch (Yeah!)\nMix up the hooch (Up the hooch)\nNo, this not Goose, this the hooch\nYeah, off the hooch, umm yeah (Yeah, yeah)\nFeelin' kinda loose off the hooch\nYeah, loose off the hooch (Off the hooch)\nMix, mix, wrist, mix, mix, wrist up the hooch (Yeah!)\nMix up the hooch, umm yeah\n\n[Verse 1]\nFly done changed (Yeah!)\nAll in the mall, I ain't got no brain (Yeah!)\nDoin' shit together we can't do again (Straight up!)\nBrooklyn with the combo, I'll put in pain\nOoh, I'm back for another one\nOoh, I like the way you wind it (It's lit!)\nOoh, I hate when we're distant (Yeah!)\nOoh, she want a Michael, she don't do Jermaines (hee-hee)\nPrince with the hundreds, yeah, purple rain (hee-hee)\nRoll me up a Backwood, I can't do no planes (hee-hee)\nWhen I take a sip, I swear I know myself (Yeah!)\nI can teach your ass the combo, don't tell nobody else (Straight up!)\n\n[Chorus]\nWrist, wrist, mix up the hooch (Up the hooch)\nMix up the hooch (Up the hooch)\nNo, this not Goose, this the hooch\nYeah, off the hooch, umm yeah\nFeelin' kinda loose off the hooch (Yuh!)\nYeah (yah!), loose off the hooch\nMix, mix, wrist, mix, mix, wrist up the hooch (It's lit!)\nMix up the hooch (Straight up!)\n\n[Verse 2]\nYuh, Clark Gable\nAin't no actin', leave your feelings at the crap table\nIn the party, I got jiggas in my Winnebago\nOnly horses, don't do Porsches cause they're never stable\nOff the hooch juice, ooh\nOff the hooch juice, ooh\nPop two tens, that's a twenty, we just started\nDamn I'm sorry if I end up crashin' in garages\nYeah, think you run your city but you're barely joggin'\nYeah, think I'm shitting on you but I barely farted\nYeah, might just cop the 'parment, put it in apartment, yeah, yeah\nBiggie Poppa way I hit my baby, baby, yeah, yeah\nLil Wayne on the bracelets for a Cartier, yeah, yeah\nV. Live or V. Live I cannot choose\nIf I tell you the combo can I trust you?\nUmm yeah\n\n[Chorus]\nWrist, wrist, mix up the hooch\nMix up the hooch\nNo, this not Goose, this the hooch\nYeah, off the hooch, umm yeah\nFeelin' kinda loose off the hooch\nYeah, loose off the hooch\nMix, mix, wrist, mix, mix, wrist up the hooch\nMix up the hooch, umm yeah\nYuh", "image": "https://images.genius.com/7e62a269cb245b815856cd6eae986a40.1000x1000x1.jpg"}], "artist": "Travis Scott"}