{"songs": [{"title": "Coc Back (clean)", "album": null, "year": null, "lyrics": "You ready?... yes sir.. let?s do!\nRedman\nHey Yo, baby I?m back like Carter, The Don Dada\nStuff sour diesel in the God Father, go hard or go home\nStreets on the phone like red takin it to the max like top shotta\nProper how da man keep a plan how to pop up, that?s why I spit like a Louisiana\nChopper. Mr. chief rocker, do it all I done it, any mc around ain't clear.. I run it\nYeah I got my chest out, blunts got my mind right, 16 bars about the size of a\nKlondike. Mr show stopper, when I am done a bar fight, now I get treated like\nKids around mike, get it rock the NY fitted New Jersey do it quick as a NY minute\nGot the smith like emit. I run it back, skip town, hot 16?s is the only way I?m\nDoing a sentence. Sky?s the limit think I?m bigger than wall st, Chris Wallace said\nIt, my pen got its heart beat. What up to Marcy, Brooklyn I?m sorry I ain?t kicked it\nSo I signed up for Karate. Hip hop monopoly pass go 3 times, ordered TiVo for\nAssholes to rewind, ( Gilla House we grind) aye boy get em off us never sleep no\nCaffeine to make a star ? buck\n\nCHORUS\nCoc bak ? spit it out, coc bak ? spit it out, coc bak ? spit it out\nCoc bak ? spit it out, coc bak ? spit it out, coc bak ? spit it out\nLyrical bang bang on the track man down\nCoc bak ? spit it out, coc bak ? spit it out, coc bak ? spit it out\nCoc bak ? spit it out, coc bak ? spit it out, coc bak ? spit it out\nLyrical bang bang on the track man down\nREADY ROC\n\nInhale ? exhale I?m proof that sex sells\nNow watch my bank account boost like a Nextel\nFrom Marseille Paris to Cali, you can find me where ever the Bally\nProbably with Halle bury the Audi, interior whiter than Bill O?Riley\nI?m Akbar Preme mixed with Muhammad Ali, plus I got Big L spirit inside me\nYour money like Bob Green, my money like Yao Ming, everybody gets scrilla on my\nMy team, we shine like high beams, the dream like Akeem that?s why I?m the prince\nLike Naseem, nah mean. Ready da man aak, its big Willie stay fly like Hancock, catch\nMe in Jam Rock with niggas with dread locks that never waste bullets all they do is\nTake head shots, shots shots. Fire shots man down, these damn clowns shoulda knew\nReady was the man now. I hooked up with Gilla & figured the plan, how to be #1 in\nHip hop hands down, plan down. Clamp down like pliers this man on fire, soughta\nLike Denzel or Marlo from the wire, the rap rowdy piper, Makhi Phifer, the D.Csniper\nI?m gonna need me a diaper up in my new Viper\n\nCHORUS\nCoc bak ? spit it out, coc bak ? spit it out, coc bak ? spit it out\nCoc bak ? spit it out, coc bak ? spit it out, coc bak ? spit it out\nLyrical bang bang on the track man down\nCoc bak ? spit it out, coc bak ? spit it out, coc bak ? spit it out\nCoc bak ? spit it out, coc bak ? spit it out, coc bak ? spit it out\nLyrical bang bang on the track man down", "image": "https://images.genius.com/09bed7d894b68c251538868d4a34b7f8.1000x1000x1.jpg"}], "artist": "Redman"}