{"songs": [{"title": "Dear Mama", "album": "Me Against the World", "year": "1995-02-21", "lyrics": "[Verse 1]\nYou are appreciated\nWhen I was young, me and my mama had beef\nSeventeen years old, kicked out on the streets\nThough back at the time I never thought I'd see her face\nAin't a woman alive that could take my mama's place\nSuspended from school, and scared to go home, I was a fool\nWith the big boys breakin' all the rules\nI shed tears with my baby sister, over the years\nWe was poorer than the other little kids\nAnd even though we had different daddies, the same drama\nWhen things went wrong we'd blame Mama\nI reminisce on the stress I caused, it was hell\nHuggin' on my mama from a jail cell\nAnd who'd think in elementary, hey\nI'd see the penitentiary one day?\nAnd runnin' from the police, that's right\nMama catch me, put a whoopin' to my backside\nAnd even as a crack fiend, Mama\nYou always was a black queen, Mama\nI finally understand\nFor a woman it ain't easy tryin' to raise a man\nYou always was committed\nA poor single mother on welfare, tell me how you did it\nThere's no way I can pay you back, but the plan\nIs to show you that I understand: you are appreciated\n\n[Chorus: Reggie Green & \"Sweet Franklin\" +  2Pac]\nLady, don't you know we love ya? (Dear Mama)\nSweet lady, place no one above ya (You are appreciated)\nSweet lady, don't you know we love ya?\n\n[Verse 2]\nNow, ain't nobody tell us it was fair\nNo love from my daddy, ‘cause the coward wasn't there\nHe passed away and I didn't cry, ‘cause my anger\nWouldn't let me feel for a stranger\nThey say I'm wrong and I'm heartless, but all along\nI was lookin' for a father, he was gone\nI hung around with the thugs\nAnd even though they sold drugs\nThey showed a young brother love\nI moved out and started really hangin'\nI needed money of my own, so I started slangin'\nI ain't guilty, ‘cause even though I sell rocks\nIt feels good puttin' money in your mailbox\nI love payin' rent when the rent is due\nI hope you got the diamond necklace that I sent to you\n‘Cause when I was low you was there for me\nAnd never left me alone, because you cared for me\nAnd I could see you comin' home after work late\nYou're in the kitchen, tryin' to fix us a hot plate\nYou just workin' with the scraps you was given\nAnd Mama made miracles every Thanksgivin'\nBut now the road got rough, you're alone\nYou're tryin' to raise two bad kids on your own\nAnd there's no way I can pay you back, but my plan\nIs to show you that I understand: you are appreciated\n\n[Hook: Reggie Green & \"Sweet Franklin\" +  2Pac]\nLady, don't you know we love ya? (Dear Mama)\nSweet lady, place no one above ya (You are appreciated)\nSweet lady, don't you know we love ya?\n\n[Verse 3]\nPour out some liquor and I reminisce\n‘Cause through the drama I can always depend on my mama\nAnd when it seems that I'm hopeless\nYou say the words that can get me back in focus\nWhen I was sick as a little kid\nTo keep me happy there's no limit to the things you did\nAnd all my childhood memories\nAre full of all the sweet things you did for me\nAnd even though I act crazy\nI gotta thank the Lord that you made me\nThere are no words that can express how I feel\nYou never kept a secret, always stayed real\nAnd I appreciate how you raised me\nAnd all the extra love that you gave me\nI wish I could take the pain away\nIf you can make it through the night, there's a brighter day\nEverything will be alright if you hold on\nIt's a struggle every day, gotta roll on\nAnd there's no way I can pay you back, but my plan\nIs to show you that I understand: you are appreciated\n\n[Chorus: Reggie Green & Sweet Franklin +  2Pac]\nLady, don't you know we love ya? (Dear Mama)\nSweet lady, place no one above ya (You are appreciated)\nSweet lady, don't you know we love ya? (Dear Mama)\nSweet lady, lady (Dear Mama)\nLady, lady", "image": "https://images.rapgenius.com/9e476cea835acb21c5e6d5b1bbbc32f8.300x298x1.jpg"}], "artist": "2Pac"}