{"songs": [{"title": "No Pierdo Nada", "album": null, "year": null, "lyrics": "[b-real]\nNo pierdes nada, te doy mi todo\nJuega con las reglas o si no te rompo\nBien apretado estas en mi luz\nSi vienen los puercos te pongo en una cruz\nNada que hacer nomas esconderte\nEntraste, tu pacas siendo tu viente\nCuando conviene esto me da sabor\nSi estas en mi camino te enseсo mi calor (ahh!)\nLa pongo en la mesa laten las tijeras\nRaperos son esclavos de compaсia disquera\nNo puedes perder, nomas escoje\nUn grupo de matones que no son ladrones\nHas lo que tiene que ser y no te rompas\nCuida la salud y comparte con las compas (compa)\nTen cuidado, con la pista\nSi estas en la loma usa tu vista (vista)\nQue se cuenta? Que soy cuento...\n\nChorus x4:\nTe doy mi todo, no pierdo nada\nPasa que ayer, el tiempo se acaba...\n\n[sen dog]\nTe doy mi todo, sabes como soy\nMe meto a tu cabeza, te destruyo hoy\nAgarro mi pluma la meto en tu cerebro\nNo voy a parar hasta que quedes muerto\nEstoy en mi zona corro y te destuerco\nPongo en un palo a cocinar, dia de puercos\nYo soy el loco, agarro una foto\nEntiende la foto me importa poco\nMe llamo sr. Trueno tremendo\nY no entiendo como sigue mordiendo\nSigo escribiendo, yo me defiendo\nMi rima y estilo son pingareсos\nTengo mi puesto, yo lo manifiesto\nTe doy mi todo y siempre te afecto...\n\nChorus\n\n[mellow man ace]\nRompo pescuezo eso es lo que hago\nEstilo mafioso, te tiro en un lago\nAy por dios, mellow man que quieres mas?\nEsto es una guerra aqui no hay paz\nRepresento, soy ejemplo\nDe raperos en la casa que rompen campamento\nAy quien puede con mellow y cypress hill?\nCuando saca esto va haber tremendo lio\n3 caсones, somos 3 leones\nQuien quiere un pedacito, le parto los riсones\nPzz pzz pzz! Piсiazo en la frente\nQue nunca te entre, va pa ya mi gente\nYo lo empece, cypress lo siguio\nEl mejor grupo de este siglo\nDate cuenta, no eres competicion\nMordiste el estilo, so eres un ladron...\n\nChorus", "image": "https://images.genius.com/2615919eb0bcef9d55421080ab3b10b1.860x860x1.jpg"}], "artist": "Cypress Hill"}