{"songs": [{"title": "American Psycho II", "album": "D12 World", "year": "2004-04-27", "lyrics": "[Intro: B-Real]\nYeah, homie\nI thought we told we been fucking loco\nCypress Hill, D12, bitch!\n\n[Hook: B-Real]\nI'm a little bit off the chain, call me insane\nBut the fact remains that I'm a psycho\nBetter get it through your brain\nWhen you say my name\nNever say it in vain 'cause I'm a psycho\n\n[Verse 1: Swift]\nI'm a motherfucking omen, I bow down to no man\nSplit a nigga open, killing folks compulsive\nA soldier with a motive, scrotum big as boulders\nI hold 'em then unload on you, put it on a poster\nSo everyone can notice who was focused on us poking\nThey nose in our business, hoping that I don't come smoke 'em\nNo one knows my notions or emotions, I'm a vulture\nYou niggas close to croaking any moment and I know when\nI could fuck the culture up, probably rap\nA maniac with anxiety attacks, I don't wanna chat\nSpeak when you spoken to\nAnd I don't have to read a fucking magazine or quotable\nTo notice what you hoes will do\n\n[Verse 2: Kuniva]\nWe all soldiers, we move as a unit, we all roll up\nAnd show up at your residence, light your front door up\nGet scared, life ain't fair\nAnd I'm prepared to blast you just as fast as Dre can say \"Hell yeah!\"\nSo watch what you say 'cause it can happen either today or the next minute\nI can draw the heater and spray and I'm dead serious\nYou could be dead period, end of story\nI'm on your porch with a gun and your son, sipping a forty\nNobody can hold me, I does it all by my lonely\nI stomp your head when you awake, you be looking like Gumby\nAftermath and Shady, bitch, you can read it and weep\nYou see my poster in the 'hood for \"the G of the Week\"\n\n[Hook: B-Real]\nI'm a little bit off the chain, call me insane\nBut the fact remains that I'm a psycho\nBetter get it through your brain\nWhen you say my name\nNever say it in vain 'cause I'm a psycho\n\n[Verse 3: Bizarre]\nThey found Saddam, but they ain't gon' find me\nI'll be under a tree in Buttfuck, Tennessee\nAnd I don't know too much about my daddy\nExcept he spit in my face and fucked me in my fanny\nI ain't a racist, I just hate whites\nFags and dykes, blacks and transvestites\nThirteen years old and joined a fucking gang\nHair under my ass cheeks feeling the fucking pain\nAm I insane? Who really knows?\n'Cause any second my temper can fucking blow\nI get colder than December\nBlack the fuck out, tomorrow won't even remember\nSee Bizarre can show you what violence is all about\nAnd this Dr. Dre beat done brought it the fuck out\nRun in your house and put a gun in your mouth\nAnd blow your brains the fuck out!\n\n[Verse 4: Eminem]\nI probably got a screw loose or two\nOr maybe three or four of 'em\nSome fell out and hit the floor\nAll I know is ever since my fucking head hit the snowbank\nI been a little neanderthalish, no thanks to my man D'Angelo Bailey\nBut I just take it slow daily, my biggest dilemma's\nTrying to figure whether to use the flat head or the Phillips\nOr just go to the Home Depot and pick the new power drill up\nIt's been two hours and six days and I'm still up\nI feel like I'm about to snap any minute\nThere's a new Tower Records about to stop and get a fill-up\nPick the new Cypress Hill up\nAnd go find who did that shit to Xzibit\nAnd go fill up a whole liquor bottle with piss\nAnd shatter his fucking lips with it\n\n[Hook: B-Real]\nI'm a little bit off the chain, call me insane\nBut the fact remains that I'm a psycho\nBetter get it through your brain\nWhen you say my name\nNever say it in vain 'cause I'm a psycho\n\n[Outro: Kuniva]\nKarnail Pitts a.k.a. Bugz\nRest in peace, homie", "image": "https://images.genius.com/6246e5d82871d591568c0f8881ed9690.1000x1000x1.jpg"}], "artist": "D12"}