{"songs": [{"title": "Ready for Whatever", "album": "Paper Trail", "year": "2008-09-23", "lyrics": "[Intro]\nHate the price of fame 'coz it cost too much (yeah boy)\nAnd you lame niggas talk too much (yeah)\nI'm ready for whatever, somebody better tell 'em (yeah boy)\nI said I'm ready for whatever, hey hey\n\n[Verse 1]\nEven though my head in the clouds, I'm planted on the pavement\nHow I walk around, people starin' at amazement\nAnd I play a lot of game on where I be and I ain't playin with it\nThey so judgmental, maybe they don't understand\nIf your life was in jeopardy e'ryday, is you tellin me\nYou wouldn't need weaponry just because of your felony?\nConsider this at least, I got e'rybody sweatin me\nOn the streets is people who won't rest unless I rest in peace\nKilled my folk a year ago, still in my sleep they threaten me\nParanoia stressin me, ain't nobody protectin me\nI'm dealin with the pressure from my partner dyin next to me\nNo one's arrested, they comin for me eventually\nThis was all the things I was goin through mentally\nThis could be the reason I ignored the penitentiary\nNot mentioning New Orlean niggas comin in the city\nKillin all summer long, ain't nobody payin attention\n\n[Bridge]\nNow, is it that hard to understand if you listen?\nEither die or go to jail, that's a hell of a decision\nBut I'm wrong and I know it, my excuses aren't important\nI'm just tryna let you know that I ain't think I had a choice, for real\n\n[Hook]\nI had straps in my ride, gotta go to prison\nYou waiting on me to die, you gon' be waiting for a minute\nReady for whatever, somebody better tell 'em\nI be here when the smoke clears and everythin settles, for real\nCan't afford the price of fame 'coz it cost too much\nPlus these sucka niggas lame and they talk too much\nReady for whatever, somebody better tell 'em\nI be here when the smoke clears and everythin settles, for real\n\n[Post-Hook]\nFor real, for real, ay, for real\nI say, when e'rything settles, for real\nAy, for real, ay, for real\nI say, when e'rything settles for real\n\n[Interlude (over Post-Hook)]\nYeah, I know what you thinking\n\"First Michael Vick, now this, huh?\"\nNaw, not exactly\nI tell you how this shit went down for real, dog\n\n[Verse 2]\nI'm a man, I ain't perfect, I admit it, I'm guilty\nBut understand, feel me, I was ridin filthy\n'Coz niggas out there plottin, to rob me and kill me\n500 thousand every year spent on security\nAnd my future was bright, but now it's gettin blurry\n'Coz niggas in a hurry to find me and bury me\nBut surely, God'll deliver me up out it\nI'm a fighter to the heart, I forever be about it\nI'm a father to my sons, asset to my community\nLook at all that I done, my good weigh the negativity\nMentally, I was focused on not lettin history\nRepeat itself, that’s why heat was kept in the vicinity\nYes, officially, I broke the law but not maliciously\nThrough all of the publicity, was anyone considerin\nMy position and the logic hid in my decision?\nBut they caught me with it, now I'm off to prison, period\n\n[Bridge]\nBut is it that hard to understand if you listen?\nEither die or go to jail, that's a hell of a decision\nBut I'm wrong and I know it my excuses ain't important\nI'm just tryna let you know that I ain't think I had a choice, for real\n\n[Hook]\nI had straps in my ride, gotta go to prison\nYou waiting on me to die, you gon' be waiting for a minute\nReady for whatever, somebody better tell 'em\nI be here when the smoke clears and everythin settles, for real\nCan't afford the price of fame 'coz it cost too much\nPlus these sucka niggas lame and they talk too much\nReady for whatever, somebody better tell 'em\nI be here when the smoke clears and everythin settles, for real\n\n[Post-Hook]\nFor real, for real, ay, for real\nI say, when e'rything settles, for real\nAy, for real, ay, for real\nI say, when e'rything settles for real\n\n[Outro (Spoken)]\nAy, I said listen, homeboy. You can talk all you want, mayne, you know what I'm saying? Everybody talk to the King, you know what I'm sayin? Everybody's entitled to an opinion, you know what I'm sayin? They like yesterdays, everybody got one\nBut the fact of the matter remains: if you ain't walk a mile in my shoes and you ain't lived a day in my life, you ain't survive the shit I done survived, you ain't had to deal with the shit I had to deal with, homeboy—you can't muhfuckin' judge me, partner\nI mean, look at folk like Sean Taylor. You know what they said?\nThey said, had he had a strap, he'da lived today. You know what I'm sayin?\nNow, true enough, I was dead wrong, I broke the law, I deserve to be punished. I understand that, aight? Cool. But listen, man, I got a house full of kids, a mama, and an old lady, whose life is my responsibility. You dig that?\nNow, for all of y'all who think I was just ridin' around on some dumb shit: you know I'm smarter than you man! You know I'm smarter than you dawg! Ay, if you think I was just being stupid, shawty, I got some muhfuckin' oceanfront property in Idaho for sale, homie. If you believe that, I got a bridge in Brooklyn I wanna sell you, partner\nAy, man, real talk: In order to understand my train of thoughts, you have to put yourself in my position. You can't expect me to think like you, 'cause my life ain't like yours, you know what I'm sayin?\nIf you don't understand that, you don't understand English. I'm done talking", "image": "https://images.genius.com/cfd0caa9a36fd23db9dec05ae1a43aed.953x953x1.jpg"}], "artist": "T.I."}