{"songs": [{"title": "Can I Hit It", "album": "Chase the Cat", "year": null, "lyrics": "She's a BEITCH!  Say what, bitch?  Don't get it twisted\nSup with that little crazy man - it is what it is\nYeah, yeah - tryin to get with that mayne\n\n[Too $hort]\nYou call that a dance?\nLook like you're fucking the Invisible Man\nI wanna put my hand - in between your legs, and grip it\nStick my finger in you, see if you with it\nSo I can hit it - know what I mean?\nFreak nasty, all on my thing\nI never seen nothing like that\nI'm looking at the cat - it's looking phat\nBut don't doubt me, 'cause when I put my mind to it\nI take my time, I run a line through it\n(And what?) Get up in them guts\nI make you scream while I'm fuckin it up - beitch!\n\n[Hook]\nI wanna fuck this bitch; I wanna hit that shit\nI want her to suck my dick - can I get it real quick?\nI wanna fuck this bitch; I wanna hit that shit\nI want her to suck my dick - can I get it real quick beitch?\n\n[Too $hort]\nShe's shaking that ass, but she ain't no whore\n(What is she?) She's on the dance floor wanting more\n(She's a freak) Alcohol\nShe went to sit down and was about to fall\nShe's too drunk - but that's cool\nI'm bout to take her to the old school\nBig freaking (yeah)\nAt the house drinking (yeah)\nI do this every weekend\nAnd on the weekdays, I do the same thing\nGetting all this love that the game brings\nI cain't sing - but my songs made me rich (pimping)\nNow watch me break this bitch!\n\n[Hook]\n\n[Too $hort]\nI walked up to her, and said, \"Whassup?\nI love the way you dance, I bet you can fuck\"\nThat's when she blushed, I started spitting it\nGive me two hours, I'll be hitting it (up in it)\nGetting it, while the getting is good\nI made her grab my dick, I knew she would\nAnd when she felt it - it was on\nShe said, \"Take me home\" (sure did)\nAnd two rubbers later, she was whipped (whipped her)\nForever my bitch\nBut don't trip - cause I ain't (I ain't tripping)\nIt's small things to a giant\n\n[Hook] - 0.75X", "image": "https://images.genius.com/5879836b504c477d7cddacb459c66e7c.776x768x1.jpg"}], "artist": "Too $hort"}