{"songs": [{"title": "Party Over Here", "album": "Ghostface Killahs", "year": "2019-07-31", "lyrics": "[Intro]\nHaha, yeah\nTony Stark, nigga\nI ain't going nowhere (Yeah)\nY'all feel me?\nWe about to finish this al', dawg (Uh-huh)\nTell 'em, Tone Tone (It's the beginning)\nYo, yo, yo\nYo\n\n[Verse 1]\nThe old lady said the shooter was 5'6\"\nAnd she don't know how he got away with five of them bricks\nAcross the street, a group of men held nine sticks\nThose is choppers being sprayed, and all of em' missed, uh\nLil' bro got away with it\nHe promised me four of them joints if I stayed with him, uh\nWhat the fuck y'all think?\nI wasn't born with a slit between my legs with a hole that's pink?\nNah, I'm a gangster, besides getting paper\nI move my pawns, fuck around and get rook\nBesides that, any jux session\nDeny me for any stones in your skin, you get cooked\nHaha, blood spillin' like lava\nFace on the hot concrete, no agua\nNasty killer with horror\nYou wasn't even the main entree, how's that for a starter?\n\n[Chorus]\n(Party over here)\nI'm talking like it's about to get deadly, we stay getting ready\n(Party over here)\nStaten Island stay stylin', boy, turn off the lights like Teddy\n(Party over here)\nMore paper, hoes that's swallowing 'scato on the late tip\n(Party over here)\nDon't you dare run, nigga, just hand over the goods, or we'll take it\n\n[Verse 2]\nBottle after bottle, Remy dark, Goose, Moscato\nThrew the club into gear full throttle\nPlayers on one side, killers on the other\nHoes in the middle, plus it's jam-packed, flooded\nSweating through my silk, real life, I might tuck it\nMad hoes, got 'em on the string like a puppet\nParty over here, lil' niggas stepped on my kicks without sayin' pardon over here\nTwo of my goons seen it, followed him over there\nCame back with whatever that fuckboy had in his ear\nNeck, chest, wrists, he couldn't persevere\nPat Riley on his neck, gave up the jewels like, \"Here\"\nNickel-plated bulldogs, 12-inch Rugers and long leathers\nTo pluck any bird nigga feather\nStaten Island, we get ours regardless\nDon't forget, we do the pressin', y'all just press charges\n\n[Chorus]\n(Party over here)\nI'm talking like it's about to get deadly, we stay getting ready\n(Party over here)\nStaten Island stay stylin', boy, turn off the lights like Teddy\n(Party over here)\nMore paper, hoes that's swallowing 'scato on the late tip\n(Party over here)\nDon't you dare run, nigga, just hand over the goods, or we'll take it", "image": "https://images.genius.com/b29a37f10f77fe83afc3a2088a5cf75f.1000x1000x1.jpg"}], "artist": "Ghostface Killah"}