{"songs": [{"title": "Lay it Down", "album": "Independent’s Day", "year": "2005-06-28", "lyrics": "[Intro: K-Doe]\nLet me up in this bitch!\nYeahhh, sup Royce?\nDirty Glove Entertainment in this motherfucker\nLet's go! (Karma side, karma-karma side)\nWhere you from nigga? (Karma side, karma-karma side)\nWhere you from nigga? (Karma side, karma-karma side)\nWhat? (Karma side, karma-karma side)\n\n[Royce Da 5'9\"]\nYeah, I done shot a couple tools, I done got a couple fools\nIn a lot of scuffles in war, I got a couple wounds\nI've learned not to play it just to play it just to burn\nI've learned not to say it, just return\nBetter spray it, let the metal blow\nI ain't never scared but I'm way too paranoid to let it go\nThat's why you can find me in your bushes with them blammers\nSeein footsteps from your grandma, ready pullin back them hammers\nI ride cause I'm skinny\nSomebody 'bout to treat me like I'm Santa when I slide down your chimney\nWith them semi-automatics or the Deserts with the heads\nWith the hollows in the bag like a present for the kids\nWith the mask and the beard and the belly, who you red\nLeave you dead, witnesses lookin like it ain't no tellin who it is\nI'mma ride, I ain't tryin other ways\nI'mma kill just to live just to die another day, hey\n\nO.P., I'm from O.P.! (Karma side)\nO.P., I'm from O.P.! (Yeah I said it)\nO.P., I'm from O.P.! (Karma side)\nO.P., I'm from O.P.! (Hey)\nO.P., I'm from O.P.! (Karma side)\nO.P., I'm from O.P.! (Yeah I said it)\nO.P., I'm from O.P.! (Karma side)\nO.P., I'm from O.P.!\n\n[Hook: all together]\nLay it down, lay it down - you hoes lay it down\nLay it down, lay it down - the murder game down\nLay it down, lay it down - don't let 'em play around\nLay it down, lay it down - the murder game down\n\n[Juan]\nI done flipped a ton of thangs\nLift a couple lames off they feet nigga flippin with the gauge\nNigga plead; I ain't bitchin, I ain't 'fraid\nWhere I'm brave like a muh'fucker pitchin at your brain\nHere the D - that's where I'm from, get done\nWith this hundred-round drum, leave a nigga body slump\nLike spice to the wizard{?}, was straight off the mizzy\nWhen I stay on the grizzly, and I write with that kizzy\nWhat's beats? I'm a gangsta for real\nIf I feel you a threat I make you pay me to live\nRoyce hit me on that Nex' I send a gang to your crib\nWith a pack of killer pitts, let 'em play with your kids\nNo slice, no bangs, just bikes and shanks\nHit that red rum down, you won't like the taste\nYou shouldn't be playin all wild when your life at stake\nI get your man gunned down for his shiesty eighth\nMan it's the whole rundown dawg, I'm like a eight\nStreet Lord gorilla fam take your life away\nWhat? My name Juan, I ain't tryin other ways\nI'mma kill just to live just to die another day, hey\n\n7 Mile, I'm from 7 Mile! (Karma side)\n7 Mile, 7, 7 Mile! (Yeah I said it)\n7 Mile, I'm from 7 Mile! (Karma side)\n7 Mile, 7, 7 Mile! (Hey)\n7 Mile, I'm from 7 Mile! (Karma side)\n7 Mile, 7, 7 Mile! (Yeah I said it)\n7 Mile, I'm from 7 Mile! (Karma side)\n7 Mile, 7, 7 Mile!\n\n[Hook]\n\n[K-Doe]\nYeah, yeahhhh, what!\nI done flipped a couple bricks, I done hit a few licks\nEven downed a couple hits, can't speak on this shit\nBut the case got dismissed\nAnd I looked at the snitch, blew his bitch ass a kiss\nCan't believe how the streets change, fears all on the 3-way\nHe say she say, work on the highway\nGotta do it my way, can't see myself caught\nThat ain't what the hood taught, keep stacks in a vault\nJust in case a nigga talk, call my nigga J\nHe said now I get it poppin off, 7 Mile niggas wit me\nCouple K's of it strictly, evidently y'all can't get me\nIt's a couple motherfuckers when they see you they gon' hit me (hello?)\nShit, your head worth fifty\nAnd I know the {?} tempt me, niggas bank account empty\nI'mma ride, I ain't tryin other ways\nI'mma kill just to live just to die another day, hey\n\nJoy Road, I'm from Joy Road! (Karma side)\nJoy Road, I'm from Joy Road! (Yeah I said it)\nJoy Road, I'm from Joy Road! (Karma side)\nJoy Road, I'm from Joy Road nigga! (Hey)\nJoy Road, I'm from Joy Road! (Karma side)\nJoy Road, I'm from Joy Road! (Yeah I said it)\nJoy Road, I'm from Joy Road! (Karma side)\nJoy Road, I'm from Joy Road nigga!\n\n[Hook]", "image": "https://images.genius.com/5296587baa4eefd1b2b1ef7daff66f78.1000x1000x1.jpg"}], "artist": "Royce da 5'9'’"}