{"songs": [{"title": "Studio Love", "album": "Finally Famous: The Mixtape", "year": "2007-11-24", "lyrics": "[Phone Conversation]\nBig Sean: You ever made love in the studio?\n\nFemale: Ha-ha, I never did it before\n\nSean: You want to?\n\nFemale:  think I’d be interesting\n\nSean: Ooo\n\nFemale: To the music and then you could like, press play, like, I mean record and record it in the booth\n\nSean: We could make it, we could make it happen\n\nFemale: And then you could like, throw it in a song or something, background, chop it up, whatever ya’ll be doin’, I don’t know how that work\n\nSean: I mean shit, we could go crazy…I could, you’d let me bend you over the keyboard?\n\nFemale: Hey, I like it that way\n\nSean: Hey, I ain’t never been mad — never have been, never will be\n\n\n[Verse 1]\nUh-huh\nI took you to that expensive restaurant, you so picky please\nI still ain’t hit this week so next week is Mickey-D’s\nGirl no hickies please\nI know that she feeling me, so Ima take her back to the crib to come feel on me\nYour name is Tiffany?\nHer name is Hillary\nTogether I almost slipped up and called you Tiffillary\nGirl is you kidding me?\nCan’t meet your mom though, I just wanna take you right back to my condo\nAnd I’m hoping I’m turning you on like a console\n‘Cause with that weave in your head you lookin’ like Tonto\nSo Ima want the breast and thigh with that, like the combo\nShe know I’m in charge, she callin’ me the head honcho\nAnd baby I’m afraid if I can’t get that skirt off, then Ima probably hop up in the whip and skrrt off\n‘Cause playing hard to get nowadays is such a turn off\nAnd you gon’ feel different as soon as you sip on this Smirnoff\nYou dig?\n\n[Hook]\n(It’s been a long week, yeah word)\n(And I’m gonna take you outta that skirt)\n(So why don’t you come and sip on something)\n(I could bring my friend, you could bring your friend)\n\nListen, I got short ones, fat ones, Indian and black ones\nSmall ones, tall ones, [?] and them rap ones\nHe one hit and quit ‘em so he never call ‘em back, hoes\nOne hit and quit ‘em so he never call ‘em back, hoes\n\n[Verse 2]\nI realize that I don’t need hoes, they need me\nSoon as they see me, “Oh, I heard your CD”\nI know they wanna hop on my peepee\nSo presidential, I should move to DC\nYou could ask Kiki, Michelle, and Niecy\nThey all, take it to the summit like BGs\nThat’s bubble guts, damn\nAnd I ran through a couple sluts, that’s a whole lotta bubble butts, word?\nPeriodically like the shuttle bus\nAnd Ima probably order all them hoes some Moet\n‘Cause that get ‘em more wet and that mean more sex\nGirl, call up your friend, let me come hit the whole set\nAnd Ima probably have them hung up like the coat check\nGirl, get on your knees let me give you a throat check\nAnd since they and their friends want some, oh them hoes next\nAnd Ima probably work them all out like the Bowflex\nAnd you and your friends could all watch like Rolex\n\n[Hook]\n(It’s been a long week, yeah word)\n(And I’m gonna take you outta that skirt)\n(So why don’t you come and sip on something)\n(I could bring my friend, you could bring your friend)\n\nListen, I got short ones, fat ones, Indian and black ones\nSmall ones, tall ones, [?] and them rap ones\nHe one hit and quit ‘em so he never call ‘em back, hoes\nOne hit and quit ‘em so he never call ‘em back, hoes", "image": "https://images.genius.com/e4311df795cf4c9077ccbb609da0c55a.500x500x1.jpg"}], "artist": "Big Sean"}