{"songs": [{"title": "Santorini Greece", "album": "Rather You Than Me", "year": "2017-03-17", "lyrics": "[Intro]\nSometimes I be wanting to say, \"Fuck the world!\"\nI don't give a fuck!\nI'll shoot it out with all you bitches\nBitches don't love me\nYoung black nigga, nigga fighting the world, nigga\nEverywhere you go, bitches throwing rocks, nigga\nMan, a nigga in a Lamborghini\n\n[Verse 1]\nSeen a Cuban kilo, I was 15 (Huh)\nDealin' yayo, never had my teeth cleaned\nRestricted license but I'm so divisive\nI know the snipers and I flow the nicest (Woo)\nFresher than Groovey Lew at a Coogi shoot (Ahh)\nA multiple weapons in my new Gucci boots\nThe bank account done caught the holy ghost (Huh)\nI say the bank account done caught the holy ghost\nHot pastrami for my Jewish chicks\nEight days of Christmas, every day a newer gift\nI'm Michael Jackson to the rich niggas\nThat leather jacket, baby, with the 6 zippers\nSuicide, or rather crucified (Huh)\nI prophesize your whole crew demise\nMutulu wife reside in Cuba, nigga\nShoot you, let you bleed out, it's how they do a nigga\n\n[Interlude]\nHuh! Huh!\nYou niggas don't believe in God\nFrom this very moment, you should believe in God (Uh)\n\n[Verse 2]\nHalf of my niggas headed to Attica\nEither traffickin' or destined to be a janitor\nDiabetes rampant in my blood line\nThat why fat boy be happy to see the sunshine\nI'm here for results, baby, let's cut to chase\nSticky fingers and paper, D.A. will drop the case (Woo)\nArt Basel with Lyor I blew 300 with 'em (Huh)\n2 seaters for all the soldiers who runnin' with 'em (Ahh)\nAsk 100 women, yeah they wanna hit 'em\nI be half awake and still be runnin' in 'em (Woo)\nTwo new liter Sprite to get me through the night\nBowlin' alley in the basement but we still shootin' dice (haha)\nRich forever, killa take my old advice (Yeah)\nBetter yet, take my old bitches and mold 'em right (Talk)\nAnd if I want her back, I come and take her back (Boss)\nSantorini Greece, I put it on the map\n\n[Interlude]\nSome points you niggas gotta be grateful\nMutulu Shakur\nI know your dreads touching the floor, nigga\n\n[Verse 3]\nWe in the last days, these racist agendas\nBlatant double standards because I'm a nigga\nJesse Jackson on them people payroll (Fuck him)\nWhen you black, lips chapped 'cause the game cold\nI'm givin' niggas jobs when I sing songs (Let's go)\nWhite man love me when I get my bling on (Nigga)\nBut you hate me buyin' real estate in foreign land (What)\nRespect my genius, all my people Portishead (What)\nRoom full of cloaks and they countin' votes\nMillion man march and I'm takin' notes (Huh)\nMade it to the top, you thought they saw a ghost (Yeah)\nFacin' tax evasion, niggas sell they soul\nSo sellin' dope was the path we chose\nAnd now it's boats and the Belaire Rose (Woo)\nRich niggas in the set and stone (Woo)\nNeck rocky, Sylvester Stallone (Woo)\nSee me in Capri or them Andes (Huh)\nSantorini, Greece with a dime piece (Huh)\nMy money long, you know I'm out your reach (Nigga)\nOnly fat nigga joggin' on the beach (Haha)\nVersace underwear but see the ass crack (Ha)\nOblivious to how rapid my cash stack\nI'm a pistol toter, fuck I'm votin' for? (Fuck 'em)\nIf I could, I'd drop a bomb, let's take 'em all to war (Fuck 'em)\nMy favorite shorty out of Baltimore (Yeah)\nEvery Chanel you know I bought it for her (I got that)\nAll the arguments she never called the law\nI was never home but hid the money in the walls\nConstant visits from the A.T.F\nSo I copped some cribs in the A.T.L\nMartha Stewart decorated both (Ha)\nSnoop Dogg donated the smoke\n\n[Outro]\nThis Chinese arithmetic, and it all add up\nIt all add up\nBink Dog, Big Boss\nHuh! Huh!", "image": "https://images.genius.com/d1373df4002267ed5d5750cb5b473c41.1000x1000x1.jpg"}], "artist": "Rick Ross"}