{"songs": [{"title": "Dog Intro", "album": "Grand Champ", "year": "2003-09-16", "lyrics": "[Swizz Beatz whispers]\nRuff Ryders\nRide or die\nGet at these niggas dog\n\n[Man talking]\nYup, yup, yup\nI don't really trust humans that much these days\nShit, fact of the matter is, I trust dogs more than I trust humans\nShit, nothing like that dog love I tell ya\nNot just any dog, gotta be a pit bull\nYup, that's the only dog for me\nYou don't wanna get caught in a pit with one of them\nThey make good companions, but even worse enemies\nIt's all on how you take it\n\n[DMX verse]\nNothing goes down I don't get a small piece of\nGet the picture see the beauty in the beast of\nThe mad man, Mr. bad man is here\nCause a nigga like me smells wreck in the air\nIt just ain't fair, the shit that I be doing to niggas\nAnd get away with the same shit ruining niggas\nCover all ground and I roll thick like the fog\nOnly motha fuckin' friend I ever had was a dog\nNever ate the hog but glad to say I smoked plenty\nThe 5th Precinct to name one of many of'em\nIn one verse I beat you worse than your momma\nI fuck around and eat you first like Dahmer's\nI'ma, play that ass out like a bomber\nKilled a nigga once for looking like he wanted drama\nI'm buggin, the pain it hurts I gotta scream\nAHHHHH!\nLettin' off a little steam\nSociety was just too much, I couldn't hack it\nSix motha fuckin' years in a straight jacket\nYo black it wasn't wise for them to let me out the joint\nNever really got better so I'm not on point\nI just might flip, quick, but it's too late to be bitchin'\nGot more loose screws than the table in your kitchen\nI'm itchin', just hope you ain't around when I scratch\nCause like I said before, I eats what I catch\nSearchin' shit will have a nigga hurt and sick\nThe dirt you kick will get you in the dirt and quick\nWord to Miz, you niggas is kids, don't play\nI'm too old for the jokes you'll get smoked, I don't play\nI'm won't say what's gon' happen if you force my hand\nSomeone somewhere will be like \"I lost my man\"\nTake it to heart it's about to get dark so run that\nAll that shit niggas talking been there done that\nWhat black? Think it's an act? Then let me know\nBut he liked what I'm saying so shut the fuck up and let me flow\nYo you think it's a game? Keep playing\nThey gon' find your ass somewhere in a creek laying\nIt's over you just ain't laid down yet\nAnd in a minute you gon' be that motha fucka' that ain't found yet\nHold off from making movies and make moves\nStop talking about shit that you can't prove\nI'm the mountain you can't move, so why you trying\nLooking at me stupid wondering why you dying\nWhile you flying\nThrough the air with a big ass hole in your chest\nWishing you was holding a vest\nBut it's too late for wishing so all you getting is rest\nGo to sleep, pa pa will take care of the stress\nGod bless and may He have mercy on your soul\nPOP POP\nTake these two more with you on your stroll, nigga\n\n[DMX talking]\nYup, yup, yup\nI don't really trust humans that much these days\nShit, fact of the matter is, I trust dogs more than I trust humans\nShit, nothing like that dog love I tell ya\nNot just any dog, gotta be a pit bull\nYup, that's the only dog for me\nYou don't wanna get caught in a pit with one of them\nThey make good companions, but even worse enemies\nIt's all on how you take it\n\nYou know how we do baby\nAight\nGrand champ\nYou know how we do\nScratch all day, match our weight\nFuck nigga\nYou can't be fuckin' serious\nA raccoon ain't nothing but a big cat", "image": "https://images.genius.com/e730418bfaada4fc845d1179160af643.999x999x1.jpg"}], "artist": "DMX"}