{"songs": [{"title": "Centipede", "album": null, "year": "2013-07-23", "lyrics": "[Acapella Intro]\nMm mm mm\nDoo doo doo da da da dum dum beh\nOh, eh, oh\nLost all of our woe\nWe lost all of our whoa-oh, sad love songs\nHey centipede, centipede, centipede, centipede, centipede...\n\n[Chorus]\nOh, eh, oh\nLost all of our woe\nWe lost all of our whoa-oh, sad love songs\nHey centipede, centipede, centipede...\n\n[Verse 1]\n'Bino, will you be my baby daddy, yup\nI'm too fresh, man, the world ain't never had me, yup\nI'm too fresh, man, y'all ain't never gave me that\nStone Mountain, ain't no doubting, and these niggas won't hold me back\nThey wasn't hating him anyway\nMy roommate exercise, man, he moving that heavyweight\nMy girl ain't down to ride, couldn't deal with my day to day\nI'm at my Grandma's house, man, like I don't know what to say\nMaybe \"I'm sorry\" but sorry don't pay the rent\nI promise to pay you back and I don't know where he at\nBut tell him he missing out, his grandson is cool as fuck\nAnd tell me who be standing when them other ones giving up?\nLet's keep it spontaneous, I don't need that rehearsal\nMore flow, man, than Progressive commercials\nGet with the program, 'cause the plus loan ain't putting us on\nI got month-long before I take the bus home\n\n[Chorus]\nOh, eh, oh\nLost all of our woe\nWe lost all of our whoa-oh, sad love songs\nHey centipede, centipede, centipede...\n\n[Verse 2]\nI know this music shit ain't shit\nAnd all these random niggas in my house make you anxious\nAnd I ain't never told you that our love would be painless\nBut I was so in love with you I thought we could make it\nDamn, I wasn't in it, damn, we wasn't finished\nDamn, I got us tickets, damn, we went to Venice\nPrioritize on our lives and made you into a business\nThat's why you wasn't surprised when I had made my decision\nGotta make it, 'cause if not I'm a failure, my wallet Azalea\nAnd my brother still moving, ain't no shit I can tell him\nTrying keep him out of trouble, but the cops is wilding\nAnd it's nice to have a felon when the boys get violent\nThe Mexicans tried to jump me at the club\nFunny thing was I thought they were stepping to show me love\nGrandma's couch, my biggest fear, and fantasy\nWhen I ain't in her arms all I'm making is enemies\nHere I'm screaming obscenities at a nigga\nWanted to live bigger\nThem Edenwald projects was eatin' our concept\nOf anyone walking out, what is you talking about?\nGun Hill Road made them summers feel cold\nOn the same train that my parents met on\nTwenty years later and my thoughts still ghetto\nHigh off of pressure, man, that's a stiletto\nGot your own couch now but you don't feel better\n\n[Chorus]\nOh, eh, oh\nLost all of our woe\nWe lost all of our whoa-oh, sad love songs\nHey centipede, centipede, centipede...\n\n[Bridge]\n'Cause if not, I'm a failure\n'Cause if not, I'm a failure\n'Cause if not, I'm a failure\n\n[Outro]\n\"It's not an unholy nigga, it's a Arab nigga in the store. You know what he want? Money, nigga. You know what your bitch want, you know why they feel they can't fuck with you? 'Cause you don't have no money, my nigga. Bitches do not want a nigga with no money. Did you not learn this in Harlem? Lesson number one. You can't keep saying you a Harlem nigga and you don't want that skrilla, nigga. Come on B, it's home of the hustlers, nigga. Nigga, that's all you gotta understand. It's the hood nigga. It's make guap or die, nigga.\"\n\n\"What do you think? 'Cause he gotta know, my nigga. Money is not evil, nigga. Go tell them niggas in Polo you don't wanna make no money, nigga. What they gon' say, \"Oh, he right\"? Hell no, nigga. You think niggas like selling crack and shit nigga? You think niggas like putting crack in they ass nigga, and selling cracks out they ass? You think niggas like shooting niggas, my nigga? You think niggas like tucking packs? You think niggas like baggin' up? You know how boring baggin' up is, my nigga? It's so boring, my nigga. There is no underground, Joe Budden is on his fourth mixtape selling shit. The underground is Koch, nigga. There is no underground nigga. You don't see Raekwon or none of these niggas on the block. You don't see none of them niggas on the block. There's no more block, nigga, it's over for the block. You ask any nigga on the block, do they wanna be on the block? They gon' say no, nigga. Get your money, man. Stop trying to be gooned out, my nigga\n\n\"Hood niggas don't want to be—\"\n\n\"Hood niggas don't want to be hood niggas, my nigga. Everything niggas do, everything niggas do in the hood is for money, my nigga. What's one thing that niggas do in the hood that ain't for money? What bitch would want a nigga with no money? Huh? Huh!? Yo, slime! It's your time.\"", "image": "https://images.rapgenius.com/95b8df8c64be12f5f81c47ff5616a4a3.500x500x1.png"}], "artist": "Childish Gambino"}