{"songs": [{"title": "Hey! (Original 12\" Version)", "album": null, "year": null, "lyrics": "[Intro]\nHey there boys and girls!\nLet me know if y'all with me y'all\n\n[Verse]\nI only play the games that I win at\nAnd stay the same with more rhymes than there's ways to skin cats\nAs a matter of fact, let me rephrase\nWith more rhymes than ways to fillet felines these days\nWatch the path of the black one, Super-villain\nWho wrecks clubs for delf in a drunken stupor\nChillin, ready and willin' to inadvertantly foil that plan of the rhymers they be whiners like spoiled brats\nWho got more snottier flows than snotty nose\nAnd holds mics like he knows karate body blows\nNobody knows the trouble I see from the MPV\nFly dirty tailin' the bubble eye thirty\nFor the record this is some shit I just thought of y'all\nIt's science fiction that's not permissible in no court of law\nI live to rock mics in 3-D\nThe only reason i seek to stop, to snuff the TV\nI heard beats, they sound like karaoke with monkey rhymers on a leash like \"don't let this nigga choke me\"\nHit 'em with a penny so we could get these peanuts\nAnd I thought we was nuts\nI used to get free cuts\nThey lock Lex Luthor up in Green Haven\nSince when a nigga never really been too clean shaven\nMisbehavin' rap stars need Listament\nCall me Mr. Bent, I'm at where your sister went, intelligent\nUsed to write and be well spoke\nNow all a nigga wanna do is fight and sell-\nTell joke\nThis could lead to catastrophe\n'Bout to stop the violence right after these last of three shots from the black bat that got me at headlock\nHoldin' on to sanity by strands of that dreadlock\nShe told me get off, I said \"Bitch, let me set this shit off so I could get rich\"\nThen this shit hit me like the point of intoxication\nImma come out and rock this nation\nLike ox defacing\nA lot niggas out is rusty like oxidation\nIn this world's strangest, most dangerous occupation\nI could do it\nI'm the super like in your building\nVillain like trife Kinder is in All My Children\nPlottin', and it's sure to pay ends\nWith some real mature womens and some more of they friends\nAnd when bad men roll tight\nIt's actual true, like a pack of big Bambu with natural glue\nWho grip necks of deuce to dukes to triple X\nHe just came in 4-D, follow the ripple effects\nAnd it'll lead ya right to him\nOh snap!\nSeems we've walked into a trap through rap\nZoinks! This place is filled with pretender willies\nOne false move and get broke off like end of Phillies\nYes true believers\nAin't nothing new to a\nCrook with special powers like how to tell the future uhhhhh...\nI picture rhyme of the month, two page long\nI'm in it with two gauges and my cape on wrong\nSon it's on, it's like a Raekwon tape song\nWith a fleet of superbad bitches, status: Rae Dawn Chong\nLet me know if y'all with me y'all (HEY!!!)\nIt's national and geographic, down to the titty ball\nI represents MI City y'all\nTo my man Wiz doing his unsettling bids\nYou woulda got away if it was not for them meddling kids\n\nM'er F'ers", "image": "https://images.genius.com/263743633b6e58854e753b25dca6beab.430x430x1.jpg"}], "artist": "MF DOOM"}