{"songs": [{"title": "Kill Her", "album": "Raw", "year": "2010-11-19", "lyrics": "[Bridge]\nTell em all what I came to do\nKILL!\nOne word that explains the truth\nREAL!\nBang out 'til your brain is loose\nAll your little fun filled days are through\nRemember that I’m like this thanks to you\n\n[Verse 1]\nFirst off I’m a little bit psycho, I know\nDumb like a mentally retarded kid\nI ain't got no friends, no ends to my stress\nSo I chill in the dark and shit\nWith a rifle and bomb, knife in my palm\nThinking 'bout the motherfucking lives I'mma harm\nSwing at me then I'm slicing your arm\nThen make you videotape me piping your mom\nRuthless!\nDeceitful lies, listen up, you don’t want beef to rise\nI really wanna murder Tomica Wright\nI’m thinking of taking her out for a pizza slice\nThen tie her ass up and then beat the life\nOut her god damn skull 'til she bleeds and cries\nThe whole fucking time she was screaming \"Why?\"\nFuck you bitch, don’t be surprised!\nTime after time you told me that my album would drop\nIt was all bullshit, then the day that it finally did\nBitch how come it flopped?\nIt’s Ruthless baby for sho'\n[Tomica] I’m tryna make me some dough\nGet up off your ass to make a motherfucking marketing plan\nAnd then maybe I'll blow\nBut no!\nYou wanna be a little bitch about it\nThought that I would never do shit about it\nYou made a contract with a twist around it\nSo I could never, ever, ever get up out it\nNo outlet so I'm pissed about it\nI'd be really dumb if I just allowed it\nWatch your back, you might get surrounded!\nBang, bang, bang you hit the ground!\nThen\n\n[Bridge]\nILL!\nTell 'em all what I came to do\nKILL!\nOne word that explains the truth\nREAL!\nBang out 'til your brain is loose\nAll your little fun filled days are through\nRemember that I’m like this thanks to you\n\n[Hook]\nYeah brother you got to feel it just like a killer, killer!\nYeah brother you got to feel it just like a killer, killer!\nYeah brother you got to feel it just like a killer, killer!\nKill her, kill her!\nKill her, kill her!\n\n[Verse 2]\nListen up, don’t you ever hate me\n'Cause I’ma blow up like a bomb when I’m detonated\nSee, you be tripping like a nigga\nThat's walking with his shoes untied\nBest believe I’ma set it straight\nTie a rope around both of your legs, then hook 'em to 2 cars\nAnd drive 'til they separate\nNow your soul's in the sky, try to levitate\nBitch you gon' live life in a better place\nYou done fucked me once, you done fucked me twice!\nHaving me begging to drop must be nice!\nLook at Eazy-E's lovely wife\nMaybe the reason is my ugly eyes\nI be the illest when I crush these mics\nBut it never occurred that I must be right\nYou’re the reason I say \"fuck my life\"\nI hate you bitch, it's a must we fight!\nEverybody keep on running around and asking\nWhat do Tomica be doing with her time\nI don’t really know though\nI just keep it low-pro, 'cause I'm mad with the contract I signed\nI was so happy at first, then it turned to a curse\nHow'd it happen to me?\nThat’s the question\nI could not get the answer\nSo now I’m building a casket for [Tomica] to rest in\nBitch you ain't nothing but a big phony\nLying to niggas, saying you signed with Sony, bitch\nNone of the staff up there knows me\nHow come my rap career's moving so slowly, bitch?\nNow I got big enough buzz to destroy you and Ruthless\nYou can’t hold me, bitch!\nI’ma fuck around and put some steel toes on\nAnd kick your ass in the ovaries, bitch!\n\n[Bridge]\nILL!\nTell 'em all what I came to do\nKILL!\nOne word that explains the truth\nREAL!\nBang out 'til your brain is loose\nAll your little fun filled days are through\nRemember that I’m like this thanks to you\n\n[Hook]\nYeah brother you got to feel it just like a killer, killer!\nYeah brother you got to feel it just like a killer, killer!\nYeah brother you got to feel it just like a killer, killer!\nKill her, kill her!\nKill her, kill her!", "image": "https://images.genius.com/511235d7620c5ca1e6b46a485cb180d6.1000x1000x1.jpg"}], "artist": "Hopsin"}