{"songs": [{"title": "I’m Old School", "album": null, "year": null, "lyrics": "Let us formally introduce ourselves\nGetting money game\nThe number one co-signer in the game, Don Cannon\nExtreme customs\nAnd our homie Twista\nBack pop poggle with the man in the hood\nWe reloaded\nYes yes, y’all, you don’t stop\nI’m Twista bitch\nI’m on some different shit\nMan west side merciful, call me magnificent\nI’m back off, my clique strong\nLost her iPhone, she’s back to the brick phone\nSway troop, joggin’ suit with the dookie roll\nCoffee cup, countin’ money like I’m Flookie Stokes\nI’m on the hustle, paper player and daily profits\nRaccoon rat with the tail, call me Davie Crocket\nI’m old school, I’m so cool\nBring all my fingers, go across all 4 fool\nTakin’ it back to gold nugget John\nFrom a Chevy Malibu to a Cherokee\nTo a ally ah ah ride to west side\nNever picking up the pace\nEP I be swag and I fit it to the bass\nMad ‘cause in bigamy 8\nCouldn’t happen to a rapper so a nigga couldn’t hate\nI remember when the walls had graffiti on it\nTook a look at them next summer, now they got GD on ‘em\n(Yes yes, y’all, you don’t stop)\nI fuck ‘er first and hustle up and hit the weakest spot\n(Yes yes, y’all, you don’t stop)\nNow flip your work and double up and go arrika\nI get street money money street money money money\nI’m old school, I’m old school\nI get rack money money rack money money money\nI’m old school, I’m old school\nI’m back on, my money very long\nNever TD on the 3 inch, thick hair and bone\nSlang bow, slang dope\nThe way your gang go\nI’m paid in full bitch, check out my hurricane go\nRemember when you used to get it for the dirty, for the both?\nEvery rapper in the game or the industry could get over 30 for the show?\n‘Cause it was all good when we was on 30’s and vobes\nNone of these niggas out here pay over 30 for those\nDamn, let’s take it back\nWho can you tell? Got him\nPop blockin’, my true religions look like bail bonds\nLet’s get back to when you used to get work cheap\nIf you the man, you could still get a third cheap\nI’m so old school but I smoke dro fool\nAin’t no mo, we the realest, logic in pro tubes\nI’m too old fashion for you to try to play me hater\nAntenna on the TV, close on the radiator\n(Yes yes, y’all, you don’t stop)\nI fuck ‘er first and hustle up and hit the weakest spot\n(Yes yes, y’all, you don’t stop)\nNow flip your work and double up and go arrika\nI get street money money street money money money\nI’m old school, I’m old school\nI get rack money money rack money money money\nI’m old school, I’m old school", "image": "https://images.genius.com/f832da8d956be1aa5e9a0ec763dcd481.716x716x1.jpg"}], "artist": "Twista"}