{"songs": [{"title": "Riot", "album": "T.R.U. REALigion", "year": "2011-11-01", "lyrics": "[Intro]\nSpinz, what's happening, mayne?\nYou feel me? I told the whole squad, mayne\nCut it up!\n\n[Bridge]\nI say, damn right they got it, damn right they got it\nDamn right they got it, damn, damn right they got it\nDamn right they got it, damn right they got it\nDamn right they got it, damn right they got it\nI said lame niggas be quiet, lame, lame niggas be quiet\nLame niggas be quiet, you in the presence of a real nigga\nI said lame niggas be quiet, lame niggas be quiet\nLame, lame niggas be quiet, you in the real nigga presence\n\n[Verse 1]\nI eat your girl up for breakfast, won’t save you no extra\nSay she fucking with me cause a real nigga's her preference\nDrinking like I'm from Texas, and you know I stay flexing\nAnd if you don't know I go by Tity 2 Necklace\n\n[Chorus]\nI say, damn right I got it, damn right I'm 'bout it\nClique full of killers, please don’t get us excited\nYeah we smoking loud, so lame niggas be quiet\nAnd if you fuck with us, we gon' start up a riot\nI-I'ma start a riot, I'ma start a riot\nI'ma start a riot, I'ma start a riot\nI'ma start a riot, I'ma start a riot (yeah)\nI'ma start a riot, I'ma start a riot (2 Chainz!)\n\n[Verse 2]\nAin't stunting these niggas, ain't stunting these bitches\nTwo cigarillos, look, look like extensions\nYeah I’m from the Southside, her mouth wide, my pack loud\nMy gat loud, I back out and click clack, pow pow\nCourt dates, skip trial, my rep is a reptile\nNow and Later, alligators, I stepped on the work like a stepchild\nPimps up, hoes down, make your girl pull her clothes down\nHer hair down and I’m down, her phone off so don’t dial\nThis right here is that no style, I don’t know how I do the shit\nI’m true to this, True Religion, they taking swag with no permission\nAll year, it's Gucci season, G's on my belt buckle\nCocaine on my left knuckle, kill you and bury what's left of you\n\n[Chorus]\nDamn right I got it, damn right I'm 'bout it\nClique full of killers, please don’t get us excited\nYeah I'm smoking loud, so lame niggas be quiet\nAnd if you fuck with us, we gon' start up a riot\nI-I'ma start a riot, I'ma start a riot\nI'ma start a riot, I'ma start a riot\nI'ma start a riot, I'ma start a riot\nI'ma start a riot, I'ma start a riot (2 Chainz!)", "image": "https://images.genius.com/8fc769615f97c16394f0acc5aa38dfea.600x600x1.png"}], "artist": "2 Chainz"}