{"songs": [{"title": "Lalala", "album": null, "year": null, "lyrics": "[Intro]\nI love listening to it from the beginning too\nLike there's joints where I don't even want to hear that shit from the beginning dawg\nAnd this is just one of them joints that, like, cites that issue\nYou know what I mean?\nHow you feeling right now?\nYeah. It's a little different, you know what I mean\nBut I got to keep it real so...\n\n[Verse 1: Logic]\nThought it was love but yeah it faded now\nI've been to hell and back so I'mma illustrate it now\nI wonder how did I end up in this position\nThe fatal collision of lovers kissing, biting, play fighting\nAnd fucking without no rubbers, yeah, we had it all\nBut I show no recognition as it all began to fall\nGirl what was we thinking?\nLove bigger than the Titanic and now we sinking\nResorting to smoking, snorting and drinking\nNow I'm thinking you was my sun, I was your moon\nElegantly lightin' up every single room that you walk in\nBreak up, now I'm stalking, your memory\nHonestly, you gave me my identity\nTook the prototype and made a better me\n\n[Talking: Logic]\nHey girl, how you doing?\nIt's me\nYou know, I've been doing a lot of thinking\nAnd we should probably talk so just give me a call\nPeace\n\n[Hook: Kendal]\nHere in this wonderless land is a boy and girl\nBut reading the lines on your hand\nLet's me know there's more to know\nSome--\n\n[Verse 2: Logic]\nTime ticks now I'm feeling ill, I gotta keep it real\nMy emotion's what I conceal\nNow baby do you feel the level of sincerity\nWhen I say I would kill to get what we had back\nThey say it's better to have loved and lost\nWell, I say try it, faking like you ain't hurt but you know and I won't buy it\nUsed to be full of your love but now I'm on a diet\nCan't you feel my pain, I know when you feel the same\nI do proclaim ending that wall on my love terrain\nMy love for your body, remember when we got naughty\nScratching on your back, telling me that you like that\nBut now when I text you, you won't write back\nWhat the fuck is up with that? I gave you everything\nAnd now you wanna take it back? I can't handle it\nSaid you loved me, now you acting scandalous\nLast time I've seen you everything was fine until you cut the connection\nAt the drop of a dime, like I ain't paid my phone bill\nFuck that, I keep it real, can't you feel my love?\n\n[Hook: Kendal]\nHere in this wonderless land is a boy and girl\nBut reading the lines on your hand\nLet's me know there's more to know\nSomehow your powers didn't leave\nOh, but mine took off with the breeze\nI'm not sad, it's simply what I've come to be\nAnd I'm not sad, it's simply what I've come to be\nAnd this ain't home but I will live here comfortably\nYou will be my--\n\n[Verse 3: Logic]\nThought you was faking but, I was mistaken\nSee, our relationship was long distance, for instance\nDo you remember the time when I was horny on the phone\nAnd you wouldn't pay me no mind?\nI was feeling all alone but you made it better\nI was the ammunition, baby girl was the Beretta\nWe was made for each other, she always made me feel better\nSee, I was tripping until I heard the news\nShe wouldn't talk to me, now I'm so confused\nSo I took a trip from Maryland to see her\nAsking why she wasn't talking to me\nKnocking on her door, feeling hella unsure 'til her mother answered\nBaby girl, you passed away and all the emotions that I stashed away started coming back\nSee, I felt terrible for thinking that you left me jack\nBut you didn't have a choice, God had to have his favorite angel back\nWith the beautiful voice that I will never hear again\nI'm sorry, will you forgive me?\nGoodbye\n\n[Hook: Kendal]\nHere in this wonderless land is a boy and girl\nBut reading the lines on your hand\nLet's me know there's more to know\nSomehow your powers delete\nOh, but mine took off with the breeze\nI'm not sad, it's simply what I've come to be\nAnd this ain't home but I will live here comfortably\nYou will be my--\n\nLa la la la la la", "image": "https://images.genius.com/75b9fd3705271c3c10d64dfb3139caf7.900x900x1.jpg"}], "artist": "Logic"}