{"songs": [{"title": "X-Is Coming", "album": "It’s Dark and Hell is Hot", "year": "1998-05-19", "lyrics": "[Intro: Kid]\nOne, two, X is coming for you\nThree, four, better lock your door\nFive, six, get your crucifix\nSeven, eight, don't stay up late\n\n[Chorus]\nOne, two, X is coming for you\nThree, four, better lock your door\nFive, six, get your crucifix\nSeven, eight, don't stay up late\n\n[Verse 1]\nWho's afraid of the dark?\nResponsible for the murders in the park\nWhen I bark, they hear the boom, but you see the spark\nAnd I see the part of your head which used to be your face\nBe replaced by nothin' for bluffin', what a waste\nNiggas wanna see me taste my own medicine, picture that\nGet on some old second grade shit, I'ma get you back\nRetaliate, if it hates for you to think I took a loss\nWhen all I did was shook it off, yeah, you heard me, shook it off\nMan, if we was up north, niggas would've been fucked you\nBut then we in the streets, niggas should've been stucked you\nPlucked you like a chicken wit' your head cut off\nThey'll find you wit' your back open and your legs cut off\nAnd as for your man, don't you ever in your mothafuckin' life\nKnow when I gotta gun come at me wit' a knife, a'ight?\nAnd forgettin' you ever saw me is the best thing to do\nDon't give a fuck about your family, they'll be resting with you\n\n[Chorus]\nOne, two, X is coming for you\nThree, four, better lock your door\nFive, six, get your crucifix\nSeven, eight, don't stay up late\nOne, two, X is coming for you\nThree, four, better lock your door\nFive, six, get your crucifix\nSeven, eight, don't stay up late\n\n[Verse 2]\nYou got yourself in a predicament, that you can't get out of\nYou already in some shit, but it's about to get hotter\nFuckin' with a nigga like you runnin' your mouth\nWill, have that same nigga like you, gun in your mouth\nBut won't be like the last time when you run in the house\n'Cause I ain't knockin' on the door, I'm comin' in the house\nAnd I'm gunnin' for your spouse, tryin' to send the bitch back to her maker\nAnd if you got a daughter older than 15, I'ma rape her\nTake her on the livin' room floor, right there in front of you\nThen ask you seriously, whatchu wanna do?\nFrustratin', isn't it? Wanna kill me, but I'ma kill you\nNow watch me fuck just a little while longer, please, will you?\nThis is revenge, no dap before you die\nAnd despite how much I hate to see a grown man cry\nI'ma make you suffer, see your ass in Hell, motherfucker\nClick, boom-boom, see your ass in hell\n\n[Chorus]\nOne, two, X is coming for you\nThree, four, better lock your door\nFive, six, get your crucifix\nSeven, eight, don't stay up late\nOne, two, X is coming for you\nThree, four, better lock your door\nFive, six, get your crucifix\nSeven, eight, don't stay up late\n\n[Verse 3]\nWhen I speak you better listen, the harder it gets, the more follows\nAnd I'm hittin' 'em with shit that they can't all swallow\nI keep my slugs hollow, keep families with sorrow\nKeep motherfuckers like you, not seein' tomorrow\nI will borrow a gun, then run 'til I catch you\nLet you slip up, just once, then I'ma wet you\nStretch you out like a limousine\n'Cause where I catch you is where I catch you, that's what killin' means\nFuck whoever's standin' there when you get what you got comin'\n'Cause once I hit you in your head, the witnesses start runnin'\nNiggas started somethin', but they chose not to finish it\nSo I'ma wrap it up, for real, dog, 'cause I'ma win this shit\nFuck it yo, let's end this shit, I don't need the plaques\nAnd I ain't a DJ, nigga, so I don't need the wax\nGimme slugs for my gats, gimme hoods for my rats\nGimme wood for my bats, then they meet where the fuck I'm at, for real\n\n[Chorus]\nOne, two, X is coming for you\nThree, four, better lock your door\nFive, six, get your crucifix\nSeven, eight, don't stay up late\nOne, two, X is coming for you\nThree, four, better lock your door\nFive, six, get your crucifix\nSeven, eight, don't stay up late", "image": "https://images.genius.com/8314b41ccd0d9cc7825bc168024bdec2.630x630x1.jpg"}], "artist": "DMX"}