{"songs": [{"title": "Kill Dem", "album": "Back on My B.S.", "year": "2009-05-19", "lyrics": "[Intro: Pharrell (Busta Rhymes)]\nHo! (Hmmm! Eh!) Ho! (Hmmm! Eh!) Hey! (Hmmm! Eh!) Ho! (Hmmm! Eh!)\n\n[Verse One: Busat Rhymes]\nWhat di blooclaat yuh a talk bout when mi in di place and yuh see di bwoy a walk bout (TRUE!)\nDon use two ting park outside a di club and yuh see police chalk out (Hmmm!)\nA likkle eediat bwoy mass out see di pretty gal dem side a di place pass out\n(HEH HEH HEH HEH!!!!) True mi a luagh out\nCome through and mek di people too massive mi caan south\nDi likkle fool fool bwoy cross out and mi in di place yuh know seh mi a shine floss out\n(GWAAN SHINE RUDEBWOY!) Yuh nuh see boss deh bout\nTrue and when mi a talk yuh fi shut yuh mouth\nLook, any bwoy waan test blast out pop coppa shot yuh should a tek anodda ras rout\nNow before mi get ready fi flash out bring two big batty gal back a mi ras house\n\n[Hook: Busta Rhymes] (*Pharrell) (Tosh)\nA KILL DEM!!! (And one and two and three and four lick a shot more fire!!!!)\nA KILL DEM!!! (And one and two and three and four lick a shot more fire!!!!)\n(*Look at that muffin!) (What di bloodclaat dem a talk bout!) (*Look at that muffin!)\nA KILL DEM!!! (*Look at that muffin!) (*Look at that muffin!)\n(Dem a know seh we run this bloodclaat round here!)\n(*Look at that muffin!) (Weh dem a really a deal wid?) (*Look at that muffin!)\nA KILL DEM!!! (*Look at that muffin!) (Yuh nuh know seh a we run this bumbohole!)\n(*Look at that muffin!) (YAH HEAR MI!!!!!!!!!)\n\n[Verse Two: Busta Rhymes]\nConcrete control everyting inna di bloodclaat street (EH!!!!)\nIt nuh really matta weh dem waan speak bare cocksman deh bout we nuh eat people meat\n(TRUE!) Nuff woman in di place dem a bleach when yuh hear big tune more fire dem a preach (HA!)\nWhen man pull up and di tire dem a screech whole heap a excitement when dem find out seh we reach\nNow, when, big man come through have manners, cau mi nuh know weh dem a try do\nYo, oonu fi know seh we nuh skin out bwoy who waan test ol' dutty big gunman crew (RAH!)\nGal see mi and she seh Mr. Rhymes tek wine, nuh matta gun inna yuh waistline (CHO!!!!)\nNow yuh know seh she know di routine mi a beat dat and tek it to anodda extreme\n\n[Hook: Busta Rhymes] (*Pharrell) (Tosh)\nA KILL DEM!!! (And one and two and three and four lick a shot more fire!!!!)\nA KILL DEM!!! (And one and two and three and four lick a shot more fire!!!!)\n(*Look at that muffin!) (What di bloodclaat dem a talk bout!) (*Look at that muffin!)\nA KILL DEM!!! (*Look at that muffin!) (*Look at that muffin!)\n(Dem a know seh we run this bloodclaat round here!)\n(*Look at that muffin!) (Weh dem a really a deal wid?) (*Look at that muffin!)\nA KILL DEM!!! (*Look at that muffin!) (Yuh nuh know seh a we run this bumbohole!)\n(*Look at that muffin!) (YAH HEAR MI!!!!!!!!!)\n\n[Verse Three: Busta Rhymes]\nEverytime mi hear di most wickedest ting I'm still inna mi prime (True!)\nWhole heap a people still inna di line watch how dem a wait fi see mi every bloodclaat time\nBig batty mi must fill up dat when mi touch sound selecta must puul up dat\n(BO BO BO BO BO BO BO BO!!!!!!!!) Yuh see di dancehall packed\nNuff shot fire till somebody lay dung flat\nHey! And if yuh really wanna know who a di maddest is\nMi when mi siddung and a bun nuff chalice\nNow! I mon waan know dem a manage and mi dun dance till every bloodclaast vanish (HA!)\nFrom Brooklyn way dung a Buckingham Palace bare pretty gal a par and yuh know we a di baddest\nMore fire bun di place wid a book a matches gal tek wuk from when mi a dig inna yuh crotches\n\n[Hook: Busta Rhymes] (*Pharrell) (Tosh)\nA KILL DEM!!! (And one and two and three and four lick a shot more fire!!!!)\nA KILL DEM!!! (And one and two and three and four lick a shot more fire!!!!)\n(*Look at that muffin!) (What di bloodclaat dem a talk bout!) (*Look at that muffin!)\nA KILL DEM!!! (*Look at that muffin!) (*Look at that muffin!)\n(Dem a know seh we run this bloodclaat round here!)\n(*Look at that muffin!) (Weh dem a really a deal wid?) (*Look at that muffin!)\nA KILL DEM!!! (*Look at that muffin!) (Yuh nuh know seh a we run this bumbohole!)\n(*Look at that muffin!) (YAH HEAR MI!!!!!!!!!)", "image": "https://images.genius.com/39d2d4f1bba15212af6b346af49c7ff2.1000x1000x1.jpg"}], "artist": "Busta Rhymes"}