{"songs": [{"title": "Kurt Loder Car Freestyle", "album": null, "year": "1999-03-13", "lyrics": "[Eminem]\nYo, yo, I'll start it off, yo, yo…\nMy name is Shady, his name is Proof\nYo, we used to have a roof up on my house\nAnd now we had a mouse that ate the cheese out of the fridge\nDidn't want to admit that I was on welfare when I was three\nPlus, when I was four, my mother used to leave\nShe used to always slam the door and say\n\"Goodbye, goodbye, Marshall, I'm leaving, I'm single\nAnd right now I'm going to mingle at bingo.\"\n\"Yeah, see you later, alligator,\" is what she said\nAnd I would always stay at house, freezin' till I'm dead\n'Cause it was cold inside that house, we never had no heat\nYo, Proof used to come walkin' up right up the street\nAnd be like, \"Yo, what up, Em? How you doin'?\"\nI used be like, \"Yeah, man\nIt's good to see you, dawg, but my life's ruined\n'Cause my mom just left,\" she left my brother Nate\nAnd I hate the fact that we never had no food on our plate\nSo then Proof said: \"What up, Em?\"\nYo, so I said \"Proof, won't you come in?\"\n\n[Proof]\nYeah, yeah, come in, what’s up with dat?\nTango and Cash, came to mingle and blast\nTogether tougher than Alcatraz prison bars\nDrivin' foreign cars\nYes, it's me and my man compadre\nBlack and white, white and ivory and black ebony\nThey can't step to me, rubbery and heavenly\nThey can't see us in the 313 vicinity\nAyo, Em, ha ha ha ha\n\n[Eminem]\nWhat up? Ha, ha, I'm comin' like ha ha\nI'm ill like nah nah, and y'all don't wanna see me\n'Cause I'm ill with the skill\nAnd I can grill and I always keep it real\nWhen I built my garage back after it just got burnt down\nSorry that my parents weren't always around\nBut it was really hectic growin' up\nBut now I'm blowin' up\nSo it don't matter: every show I do, I'm always showin' up\nTo the club drunk as hell, drunk as fuck, drunk as what?\nCan't say that on MTV\nBut remember it? Little old wimpy me\nWho used to always dream to be on MTV\nNow you can't see me\nI know you remember that rhyme\nAyy, wait a minute, yo check it out, I'm 'bout to flatline\nPass the mic back to Proof\n'Cause we get loose, we drink gin and juice\nSip it 'cause we always raise the roof\n\n[Proof]\nAyo, ayo, we all up in your sight like cataracts\nMe and Em tag-team\nBeat any of y'all on some battle rap\nSee us next time we strippin' out your Cadillac's\nHow you like that? Soon you down like a battle axe\n\n[Eminem]\nI'm down like a battle axe\nI got a phatter axe to smash\nAnd I smash your cataracts\n'Cause it's a Cadillac's that I be drivin'\nWhen I be high off fuckin' vivarin\nNow you can't see me 'cause I'm revivin' and survivin'\nIn the D, every single day in Detroit\nIf rappers wanna step to me, they better get to the point\n'Cause they don't understand the way that I do it\nThe fluid that I be spittin' is never written\n'Cause I'm always, always bitten, 'cause it—\n\n[Proof]\nAyo, you make your neck crack like a snare pop\nWe're fresh and they're not\nSo give it up, don't even do this\nYou're wack, in fact you get flat-lined\nYou need practice\nWe stick you like a cactus\nNah, you're not a guy, you're an actress\nThe fact is—\n\n[Eminem]\nHere's my address, this is my old address\nAnd called… a street called Dresden\nYo, dead presidents is what I'm resurrectin'\nGotta say what's up to Desmond and JLB\nBut yo, they don't help me\nDo a thing, they never did\nWhen I was a clever kid, rhymin'\nI always used to go to school and climb in\nThe back baseball diamond\n\n[Proof]\nHey yo, abort, hold up!\nHurt shoulder\nPeace for Kurt Loder\nYeah, we're doin' an interview\nIn a minute or two\nWe're gonna enter in you\n\n[Eminem]\nIn the nude, when we intrude\nDon't mean to be rude\nBut yo, what's up, dude?\nHow you doin', MTV?\nHow you doin', Kurt?\nHow you doin' everybody else in the world?\nYou gettin' hurt\nBy this freestyle that I be comin' up with\nEruptin' and kick your mother in the tummy\nAnd in the stomach\n\n[Proof]\nAyo, ayo, and all of this we just done is freestyle\nAh, ah, ah, don't touch that dial, yeah\n\n[Eminem]\nHold it right there, I'm your worst nightmare\nWipin' diapers on my high chair\n\n[Proof]\nWhat?! Yeah!\n\n[Eminem]\nWhen I was this big\nNow I'm still bigger, but I'm skinny like a twig\nSkinny little white boy\nGrowin' up I liked noise\nI spike punch and light joints\n\n[Proof]\nAyo, everybody looks for us to follow\nWe thrust the bottle, thrust the throttle\nBust a bottle over your head\nTrain your thoughts just like Cus d'Amato\nYour guts is hollow\nBack up, Proof and Em\n\n[Eminem]\nAnd all them wack MC's steppin' to me at Saint Andrews\nJust remember that I hate you, and yo, I can't stand you\n\n[Proof]\nYeah!\n\n[Eminem]\nBye bye!\nGoodbye, good night!\nBye bye, good night!\nBye bye, good night!\n\n[Proof]\nBye bye, bye bye, bye bye!", "image": "https://images.genius.com/b379811c1415017b9f3e3a71b9d26060.400x400x1.jpg"}], "artist": "Eminem"}