{"songs": [{"title": "What People Do for Money", "album": "Luthaism ", "year": null, "lyrics": "[Intro: Proof]\nDJ Salam Wreck!\nHa!\nWe on the Pyrex\nAnd this is an exclusive for Exclusive\nHa-ha! Big Proof - Purple Gang - D12 - Swifty McVay\nAnd this is -- aight, fist, c'mon Pete!\n\n[Chorus:  Proof]\nGo in, see, I gotta do it again\nDon't you know boy what I do it up in?\nBrought my 4-5 and the slew and his friend\nDeath before dishonor, I'm true to the end\nGo in, see, I gotta do it again\nDon't you know boy what I do it up in?\nBrought my 4-5 and the slew and his friend\nDeath before dishonor, I'm true to the end\n\n[Verse 1:  Proof]\nMy back's against the wall and my nerves are bad, now\nCover your kids' ears because my words are bad, ma\nMash out, I'm coming for lives when I black out\nLast nigga prob'ly remember is being in this crackhouse\nI ain't dissing Benzino or threatening Dave Mays\nNo defending racism or neglecting slave days\nBut Ray-Ray knows it's all dollars and cents\nCorporate ballers are pimps\nThese nigga chimps swallowing dick\nJust to get print into script brick by brick\nThey kicked it with the fag, he's wack, and they die rich\nI assisted Shady, I assisted Dave before\nJudgment, you lunch us with wine, listen, pay me\nI'm missing Jay-Z already, vision hazy\nPay me for truth, nigga, shit, and this is daily\nSo I'm kissing Hailie and I'm wishing maybe\nShe ain't gotta grow up and fear Mr. Crazy\n\n[Hook: Sample]\nWhat people do, do for money\nWhat people do\nWhat people do\n\n[Proof, over sample]\nMan fuck these niggas\nIt's like this\nHeyo Em don't even diss these niggas back\nD12 will hold up, you hear me?\n50 you don't even clobber these niggas\nThey crying and they sells\nEnough of the Hailie sales\nFirst Em, we should be talking about his mama\nAnd I ain't white, hate niggas and shit, right?\nBut I hear you though nigga\n[?] any building you get, nigga\nAlways gotta test the street\nTalking all that street shit nigga\nBe real with yourself nigga\n\n[Verse 2: Proof]\nBut one day, that reality drills in\nLookin'  at your mag now, damn dawg, it's real thin\nWho would you advertise\nBecause you battled the wisest guys\nWho chastise us with fabricated lies and\nSlipped on dreads but still kept my head when\nYou threatening lives, it ain't wise to threaten dead men\nWalking without aids is hard\nLook at Mays's arse\nHe in Dave Mays's cars and we're raising bars\nWe're waging noise, so much pain is born\nI was Unsigned Hype, I use to praise The Source, damn!\nUntil they dub nigga while father was getting signed\nNext time he sees my shoe, to spit and shine\nI wasn't even ready for what dub he was on\nYou come in game, nigga, shit you gotta be strong\nRap is being had, I'm about to pack up my bags\nEvery minutes of the days before my plaque's in my lap\n\n[Verse 3: Swifty McVay]\nHe tried for four years but he's rejected\nA demon whose magazine's anorexic\nFiendin' for attention\nHe don't know the meaning of hip-hop\nWe just need to lynch him\nListen, what Benzino don't realize\nThis culture is given to anyone who want to ride\n{​​​​​​Proof: True!}​​​​​​\nNow he the type of nigga who can't take defeat\nNow he crying, \"BECAUSE OF SHADY RECORDS I CAN'T EAT!\"\nDamn, knowing it may seem cause he can't rap\n\"I'M A MAKE MONEY FROM A MAGAZINE!\"\nNow he gonna think, \"HOW CAN I TAKE OVER?!\"\nHe messed around and fucked with a motherfucking soldier!\nHa ha!\nThat racist shit is over\nYou know the deal bitch, your career is over\nHa! Ha! Ha!\nDJ Exclusive!\n{​​​​​Proof: It's over nigga!  D12!}​​​​​\n\n[Hook: Sample]\n\n[Proof, over the Sample]\nHaha! It's like that nigga!\nWe ain't gotta put out no hit for you, boy\nWe do it like this\nNiggas down with us:\nRock Bottom, Sidney Syringe\nPET, Purple Gang\nDJ Exclusive, V-Dog, Fall Collection, Fat Killahz\nReal Detroit motherfuckers, we all roll together\nYou know what I'm saying?\nBlack Face, I'm gonna tell you motherfuckers like this man\nI ain't even fucking with no magazines\nI'm going on the internet", "image": "https://images.genius.com/eeca96db2e754f5dad1d171d98484486.360x360x1.jpg"}], "artist": "Proof"}