{"songs": [{"title": "The B Bop", "album": "Gazing at the Moonlight", "year": "2009-10-27", "lyrics": "[Intro]\nExcuse me, are you Hopsin?\nYeah, why? Who wants to know?\nMy mommy doesn't like me listening to you, but could you\nLike sing me one of those songs? Like, like one of the cool ones?\nMan I got to go man I'm not tryin to sing...\nPlease?\nAlright, alright alright...\n\n[Hook]\nIt's the B Bop, my B Bop song\nDo the B Bop, ain't nothing wrong\nCome on!\nShobedibeebop, shobedibeebop, bidung, oh baby!\nShobedibeebop, shobedibeebop, bidung, oh baby!\n\n[Verse 1: Hopsin]\nAyo it's time to bring the West back, pass me the exlax\nSo I can shit on all these niggas when I wreck tracks\nYour flow ain't that ill, I think you should adjust that\nHomie I don't mean to be rude to you, it's just that\nYou ain't the first nigga I seen with an attitude\nUp on the mic tryin' to explain what the gat'll do\nYour skills won't get you that place up in Malibu\nYou better off tryin' to go slang with a bag of fruit\nAnd leave it up to me, I got the bubblies\nI'll do in an hour what would take your ass a couple days\nMy contacts make the ladies fall in love with me\nHe's the joker of rap is what these motherfuckers say\nI'm slightly psychotic and idiotic but modest whenever spotted\nSo logically I'm a prophet, face it niggas you just suck\nAnd as far as your game, it ain't never had legs to step up\n\n[Hook]\nIt's the B Bop, my B Bop song\nDo the B Bop, ain't nothing wrong\nCome on!\nShobedibeebop, shobedibeebop, bidung, oh baby!\nShobedibeebop, shobedibeebop, bidung, oh baby!\n\n[Verse 2: Hopsin]\nMan I'm tired of the ghetto, hope I make it out this place\nIll niggas running around like an ape up out the cage\nAnd it ain't about the change, man these things are not the same\nAll these killers wanna leave my brain laying on the pave\nAnd I ain't did nothing, all these little kids cussing\nLearning from their big cousins how to go and get stuck in\nA correctional facility, messing up their liberty\nActing a fool making unnecessary enemies\nYes it's very weird to me, I did not get caught in it\nI was into rap, for some reason I love the art of it\nI ain't never drank or smoked because I'm smarter than\nThat and I didn't want to grow up to be what my father is\nGotta make a living, got plans of moving out the hood, not stayin in it\nI hate these cheap apartments, and these vague complaining attendants\nRoaches in the kitchen but I ain't really trippin, I'll be rolling in a minute, singin\n\n[Hook]\nIt's the B Bop, my B Bop song\nDo the B Bop, ain't nothing wrong\nCome on!\nShobedibeebop, shobedibeebop, bidung, oh baby!\nShobedibeebop, shobedibeebop, bidung, oh baby!\n\n[Verse 3: Hopsin]\nOn the mic I burn niggas and turn rappers to singers\nI learn that on the day I confirmed I was the slayer\nI serve packs of these haters my words actually rape 'em\nAnd where's daddy to save him? My urge has to be fatal\nUp in this music shit the sky's the limit for rising in it\nLong as I'm consistent and keep on using my eyes as gimmicks\nI'mma be the talk of the town, walking around\nLike \"Yes this rap game, I'm the boss of it now\"\n\n[Hook]\nIt's the B Bop, my B Bop song\nDo the B Bop, ain't nothing wrong\nCome on!\nShobedibeebop, shobedibeebop, bidung, oh baby!\nShobedibeebop, shobedibeebop, bidung, oh baby!", "image": "https://images.genius.com/fb33e7a89a5050dc08095e21c220cc15.1000x1000x1.jpg"}], "artist": "Hopsin"}