{"songs": [{"title": "Fear Not of Man", "album": "Black on Both Sides", "year": "1999-10-12", "lyrics": "[Produced by Mos Def]\n\n[Spoken]\nBismillah ir Rahman ir Raheem\nIf you can hear me ladies and gentlemen\nThen I'm very happy that you came here\nOoh-oooh, whee!\nThat was for Brooklyn\nHa ha, we get it every time\nYou got me on? Oh\nShout out to all of my crew, East-West, North-South\nAll the continent, Europe, all abroad international\nBring it in, bring it in, bring it in, bring it in\nIt's a lot of things goin' on y'all\n21st century is comin'\n20th century almost done\nA lot of things have changed\nA lot of things have not, mainly us\nWe gon' get it together right? I believe that\nListen—people be askin' me all the time\n\"Yo Mos, what's gettin' ready to happen with hip-hop?\"\n(Where do you think hip-hop is goin'?)\nI tell em, \"You know what's gonna happen with hip-hop?\nWhatever's happening with us\"\nIf we smoked out, hip-hop is gonna be smoked out\nIf we doin' alright, hip-hop is gonna be doin' alright\nPeople talk about hip-hop like it's some giant livin' in the hillside\nComin' down to visit the townspeople\nWe are hip-hop\nMe, you, everybody, we are hip-hop\nSo hip-hop is going where we going\nSo the next time you ask yourself where hip-hop is going\nAsk yourself: where am I going? How am I doing?\nTill you get a clear idea\nSo if hip-hop is about the people\nAnd the hip-hop won't get better until the people get better\nThen how do people get better? (Hmm)\nWell, from my understanding people get better\nWhen they start to understand that they are valuable\nAnd they not valuable because they got a whole lot of money\nOr 'cause somebody, think they sexy\nBut they valuable 'cause they been created by God\nAnd God makes you valuable\nAnd whether or not you recognize that value is one thing\nYou got a lot of societies and governments\nTryin' to be God, wishing that they were God\nThey wanna create satellites and cameras everywhere\nAnd make you think they got the all-seeing eye\nEh, I guess The Last Poets wasn't too far off\nWhen they said that certain people got a god complex\nI believe it's true\nI don't get phased out by none of that, none of that\nHelicopters, the TV screens, the newscasters, the satellite dishes\nThey just wishing\nThey can't really never do that\nWhen they tell me to fear they law\nWhen they tell me to try to have some fret in my heart behind the things that they do\nThis is what I think in my mind\nAnd this is what I say to them\nAnd this is what I'm saying to you check it\n\n[Chorus]\nAll over the world hearts pound with the rhythm\nFear not of men because men must die\nMind over matter and soul before flesh\nAngels hold a pen, keep a record in time\nWhich is passing and running like a caravan trader\nThe world is overrun with the wealthy and the wicked\nBut God is sufficient in disposing of affairs\nGunmen and stockholders try to merit my fear\nBut God is sufficient over plans they prepared\nMos Def in the flesh, where you at, right here\nOn this place called Earth, holding down my square\n\n[Bridge]\n'Bout to do it for y'all, and y'all at the fair\nSo just bounce, come on bounce\nB-b-bounce b-bounce b-bounce-bounce\nAnd just-\nJust step, two, three\nJust step, two, three, and\nStep two\nTwo, three and\nOne two three and four\nOne two three and four\nOnce again\n\n[Chorus]\nAll over the world hearts pound with the rhythm\nFear not of men because men must die\nMind over matter and soul before flesh\nAngels hold a pen keep a record in time\nWhich is passing and running like a caravan trader\nThe world is overrun with the wealthy and the wicked\nBut God is sufficient in disposing of affairs\nGunmen and stockholders try to merit my fear\nBut God is sufficient over plans they prepared\nMos Def in the flesh, where you at, right here\nOn this place called Earth, holding down my square\n\n[Outro]\nBout to represent in your whole atmosphere\nBout to represent in your whole atmosphere\nTo your atmosphere, to your atmosphere\nOh-ooh!\nThat was for you—and Brooklyn, too!", "image": "https://images.genius.com/7e6832cab470314ffb530b255928573d.600x600x1.jpg"}], "artist": "Yasiin Bey"}