{"songs": [{"title": "Mighty Healthy", "album": "Supreme Clientele", "year": "2000-02-08", "lyrics": "[Intro: Sample]\n- \"My God, so they are killers. I've heard lots of people say once a man's a killer, they just keep on killing and killing; they sort of develop a taste for blood\"\n- \"Yeah, that's right. They kill one man, or kill ten. It's all the same (yes). After all, they can only hang you once\"\n\n[Verse 1: Ghostface Killah]\nBoth hands clusty, chilling with my man, Rusty\nLow down, blew off the burner kinda dusty\nThe world can't touch Ghost, purple tape, Rae co-host\nMonty Hall expo, intellect, you read pro\nSon trifling fuck, wildflower on the cycle and\nPicked up the broom thought I was Michael-in'\nWest Brighton Pool, now I'm into Iron Duels\nTurn Nuns to Earths Whoopi, she at Allah school\nInhale break beats of Hell A-Alikes propel parallel\nDuracell knot, you flash a burnt cell\nSnap out of CandyLand kids, the old rumor is\nBlacks become immune and shit, we never did\nLike eating dead birds, trust the pharmacy over herbs\nMen marrying men, ill they got the urge, pulsar\nScissor hand wig vanished in the winter, living off land\nYou god damn right I fuck fans, king me\nCheck checkmate props like the micro chip founder\nNeck to neck stock with Bill Gates now\n\n[Bridge: Ghostface Killah]\nWhen we hug these mics we get busy\nCome and have a good time with G-O-D\nMake you snap your fingers or wiggle\nScream, shout, laugh or just giggle\nShake that body, party that body\nDon't fuck with Ghost you'll feel sorry\nThat's word, I'm not the herb\nUnderstand what I'm saying, saying, saying\n\n[Verse 2: Ghostface Killah]\nHit mics like Ted Koppel, rifle expert\nLet off the Eiffel, burn a flag in your grass, spiteful\nRingleader set it off, rap Derek Jeter\nCulprit, prince of the game wish you could see us\nWe lay low glitter wax full bangles\nPriceless ropes, lay around the God get tangled\nWoolly hair, eyes fiery red, feet made of brass\nTwelve men following me, it be the God staff\nMove, every script's like Miramax\nSmash the big boy, totalled it, Wilshire and Fairfax\nSon beaming wifey on the beach, sipping Zima\nWu 'binos to latinos, we love Selena\nOvernight, God schedules, Fed-Ex\nPretty silhouette velvet nice DNA scroll genetics\nToo hot to handle, one thought from scrambling the mandolin\nHundred game Wilt Chamberlain, smack 'em, say when\nHe rolling up, face wrinkled up, hands is on his nuts\nYo kid stop fronting on the ground 'fore you get touched\nIt's Canada Dry sess with Allah, son\nWe want rye, we want it so bad we might cry\n\n[Outro]\nFor every blow, depends on breath control\nSo it's the first thing you must learn\nFortunately it's easy\nYou'll soon learn\nMy God so they are killers\nKilling and killing\nThey sort of develop a taste for blood", "image": "https://images.genius.com/469fdc23501d689480b2d8fa549f0636.240x240x1.jpg"}], "artist": "Ghostface Killah"}