{"songs": [{"title": "Nocturnal Rainbows", "album": "Raw", "year": "2010-11-19", "lyrics": "[Intro]\nYou think you're original? You ain't original\nYou were programmed to be you\nYou're a slave, and you don't even know it\nThe shit you think of ain't even your thoughts\nLet's step out the box for a minute!\n\n[Verse 1]\nHow do we know if God exists? How do we know what's positive?\nAre you the definition of an angel or the opposite?\nIf you lost your wallet and I found it, I would not commit\nTo stealin' it; but if the tables turned, then you would pocket it\nSee, I been me for so long, but I still don't know who Hopsin is\nHow come I'm the one my teachers used to have a problem with?\nI show my music to different labels, they ain't too fond of it\nBut in the underground I seem to get so many compliments\nSay my name and it's like people get afraid and shook\nBut if you take a look, you'll see I'm nothin' like an angry crook\nI'm learnin' hands-on, you busy with your face in books\nI'm here to benefit the world so Heaven's where we're safely put\nI'm not a devil, not speakin' in tongues\nI just wanna touch your heart, I try to reach it in songs\nI'm from where a child's future is on the streets with the bums\nBecause it's hard to become somethin' so unique where I'm from\n\n[Hook]\nWhen the Sun's down\nNocturnal rainbows soar in the air so high\nIt may seem so that I can't see\nBut the darkness provides the light for me\nI don't wanna be lonely\nAnd the Moon is my only homie\nIf there's a higher power, then show me\nInstead of nocturnal rainbows\n\n[Verse 2]\nObama's president, so? What's he represent?\nJust because the nigga's half black don't mean he's Heaven-sent\nYou're clueless to evidence and all the minds he's messin' with\nHis charm and smile hasn't got my ass up out this debt for shit\nFrontin' like he's truly Jesus, and all you fools believe it\nThe change he's makin' isn't good, that's just how you conceived it\nIt's like we're all broker than ever, it's due to reasons\nDealin' with self-beneficial plans and the movement he's with\nIlluminati, or whatever the fuck they go by\nThey're the reason weird shit happens and we don't know why\nWhy did Michael Jackson start his tour, then have to go die?\nHow did rap music go from really good to so dry?\nReal artists get shelved and wack ones get famous\nTo leave masses brainless, a smart mind is dangerous\nIn their eyes; there probably ain't no real shit in your playlist\nYou're just a product of what the government has created\n\n[Hook]\nWhen the Sun's down\nNocturnal rainbows soar in the air so high\nIt may seem so that I can't see\nBut the darkness provides the light for me\nI don't wanna be lonely\nAnd the Moon is my only homie\nIf there's a higher power then show me\nInstead of nocturnal rainbows\n\n[Verse 3]\nWe're all smart, and we know what's bad and good for us\nBut yet, when you got offered some marijuana, you took a puff\nYour brain's a fuckin' powerhouse\nBut what, that wasn't good enough?\nIt's people like you who talk that \"shoulda, coulda, woulda\" stuff\nYou probably threw your life away ‘cause you'd rather get high\nWith no license or car, so you bum rides to get by\nSayin', \"I should've did this\" or \"I shouldn't have hung with this guy.\"\n\"I'm broke as fuck, my rent's high. Ah, I should've realized.\"\nI ain't being cruel with these situations that I address\nI more than likely could be someone you admire, yes\nBut it's because the blood, sweat and all the time that I invest\nWe play the same game: difference is, you never try your best\nYou don't have a skill, you set yourself up for a higher mess\nI work around the clock, you slack off for lots of time to rest\nKeep bullshittin' till your life is gone\n‘Cause living's naturally hell, you have to work to put a smile on\n\n[Hook]\nWhen the Sun's down\nNocturnal rainbows soar in the air so high\nIt may seem so that I can't see\nBut the darkness provides the light for me\nI don't wanna be lonely\nAnd the Moon is my only homie\nIf there's a higher power then show me\nInstead of nocturnal rainbows\n\n[Outro]\nNocturnal rainbows soar in the air so high\nNocturnal rainbows soar in the air so high\nNocturnal rainbows soar in the air so high\nNocturnal rainbows soar in the air so high", "image": "https://images.genius.com/511235d7620c5ca1e6b46a485cb180d6.1000x1000x1.jpg"}], "artist": "Hopsin"}