{"songs": [{"title": "Microphone Murderer", "album": "Demo Tape", "year": "1991-01-01", "lyrics": "[Notorious B.I.G.]\nA whole lotta niggas want Big to make a demo tape\n'Specially that, BUM-ASS NIGGA uhh\nThis goin out to you nigga recognize\nYo 50, what's this?\n\nMicrophone murderer, mass mayhem maker\nB.I.G.'s on the mic, call the undertaker\nMake an appointment, schedule a interview\nBecause you know what Big Man's about to do\n50 Gran' on the Technic at the right peak\nBrothers wanna hear the words Big Man speak\nThe microphone - I'm rippin', the burner got the clip in\nSlammin MC's like Scottie Pippen\nFlippin on Old Gold, cold as the rhymes you stole\nPuffin on dime bags and I been told\nMy words are harder than a brick, Chinese arithmetic\nA thick stick and my dick\nMakes me sick when you pick the whick-whack rhyme G\nYou get what you pumpin is Tic-Tac time Z\nB.I.G. moves swifter than a ninja\nEven on stickups I'm the masked avenger\nKeep my eyes open and the case closed\nNo eyewitnesses, no names are exposed\nJust the heavyset one with the big gun\nAnd a sweet tongue shakin down everyone\nLoot like Michael Jackson kicks like Bo Jackson\nBenz like Freddie Jackson, no need to ask in the crew\nOooh! No frontin, no fakin moves\nFightin or fuckin, resort to the stick and move\nSmack the fool that disagree, recognize the pedigree\nRhyme is mine cause I said it's me\nStep to a Big Man grippin the mic stand\nKeep a bankroll and so do 50 Gran'\nAnd, I give you my hand cause you deserve a pound\nTryin to blow up the spot, in my part of town\nBraves, because you get no praise\nI treat you like a derelict with AIDS\nRecognize, I don't fuck with the St. Ides\nB.I.G. down with O.G.B\nOld Gold Brothers for the others that missed me\nThe crew stay deep on Bedford and Quincy\nRhymes in the pocket for a quick hand to hand\nYou want it to be on, there's a Tec in the garbage can\nI pull bitches like Kim Fields, Brooke Shields\nShelley Long, Connie Chung, I can go on and on\nWord is bond I'm a don~!\nI split 'em and run up in 'em I fuck 'em and then I duck 'em\nI hit 'em in the shitter and forget her, and it gets better\nB.I.G. are the letters\nNiggas know the pedi'...\n\nThat's the end!! What you want me to do? DAMN~!", "image": "https://images.genius.com/6c96abc4bf36378ec25a3f74b38f27fb.1000x1000x1.jpg"}], "artist": "The Notorious B.I.G."}