{"songs": [{"title": "Car Horn (Madlib remix)", "album": null, "year": null, "lyrics": "I'm the C-O to the double M O to the N\nYou heard, motherfucker? Well boy I hit ya again\nOfficial bald nigga from the City of Winds\nStay doing it, doing it, I am doing it (Repeat 2x)\n\nWhat the fuck is going down? Nigga you sound\nLike a real bitch right now, the pound\nI gave you I knew I shouldn't have gave you\nBefore you was a hoe now you think the money made you\nA slave to the rhythm, indentured servant to wisdom\nClinton is the pres but I voted for Shelly Chisom\nIn a poetical prison, I'm visiting self\nFor hours, coward niggas get shanked for kicking\nPussy raps, radio is like CO's they try to push me back\nI rip cats out of they suits, give them they hoodies back\nI from the hood we stack back fist\n\"Ooh ohh ahh\" is the sound of blackness\nThese new school cats is classless, influenced by rap shit\nFront money, but hustle backwards\nI break bread with broads that got they masters\nAnd hypes the blaster, lawyers that work faster than young ghetto bastards\nBecame childlike with the way I style right\nAnd act, because children naturally react\nRespond, to the Com as a poet I'm a last like a Don\nCause I'm like that yo, a phenom without shit on my arm\nYou can't coherse a verse\nI'm a rhyme when I want to get up and rhyme\nSome say I space like John Glenn because of the places I've been\nI breaks about spin, been through cases of Heinekin\nReturn to orbit off some shit that's anti-Corbin in the Wild Style\nOn to gain rappers is getting tortured for tossing salads\nYou imbalanced, you rap about violence too much\nI go on blind dates with my estates and gold dust\nAnd at my shows a lot shows up, they think it's a hold up\nSo many hands go up, but with the band I cold up\nMoney folder, you want a fresh style let me show you\n\nI'm the C-O to the double M O to the N\nYou heard, motherfucker? Well boy I hit ya again\nOfficial bald nigga from the City of Winds\nStay doing it, doing it, I am doing it (Repeat 2x)", "image": "https://images.genius.com/334bd07941665eb5b381fb51bced319d.1000x1000x1.jpg"}], "artist": "Common"}