{"songs": [{"title": "Love No Ho (Demo)", "album": "Demo Tape", "year": "1991-01-01", "lyrics": "[Intro]\nYo Bigs, man, what's wrong man?\nYou look like you got problems man\n\n[Notorious B.I.G.]\nHey yo man, psh man..\nIt's this fuckin' bitch, man!\nShit, I know I ain't s'posed to have no feelings for these hoes out here man, but\nThis bitch on the back of my mind man (word?)\nYeah man... done wrote a rhyme 'bout the bitch man\n(Let me hear it) Want me to drop the drama kid? (Yeah)\n\nYeah, dedicatin this to you man\nCause my man 50 Grand told me straight up and down man\nI ain't 'sposed to love NO ho\nKnahmsayin? I tried to tell her 50\nI got three rules in life\nI'm not to be played with, played on or played out\nI'mma drop it like this\n\n[Verse One]\nLyin' in my bed, I'm lookin' at four walls\nEcho in my head sayin' I got a lot of gall\nGrippin' my cap, my pen in my teeth\nThinkin' what this ho said, she called me a thief\nShe said I stole her heart, and didn't leave a trace\nI told her I was sorry, and she said \"get out my face\"\nWalked out my door with my Walkman in my pocket\nPlayin \"Love Is a House,\" and thinkin how she jocked it\nWhen she had the key, to open up my door\nAdore, that Prince scan that bought me on the floor\nI know that she loved me, I couldn't ever fake it\nI say go buy a pie, the girl would go bake it\nMakin' a record was important to me\nMore important than her that's what made her flee, see\nThe mistake was not payin' no mind\nAll her posse said we was \"two of a kind\"\nI call her back twice, your sister said you're broke\nShe said \"when you left, your ears was full of smoke\nChokin' on a cigarette, you don't even smoke!\"\nJumped in the train station put in a token\nCoulda been my partner, amigo, my peer\nJust waitin' for them three words that all girls wanna hear\n\"I love you,\" huh, you would start to cry, if\nI would reply with I.L.Y\nThen I tell your friends that you played me out\nSaid I wouldn't say \"I love you\" just to make you shout\nSo I, call up 7 digits that would pick up your phone\nYour sister picked it up and said that you wasn't home\nI heard you in the back cryin' up a storm\nScreamin' how you wish that I never was born\n\"I hate him! I hate him!\" That's what she kept sayin\nShe'll come to her senses is what I kept prayin'\nBut now I'm gonna lay the cards on the line\nJust say that you hate me, or say that you're mine\nI said, when I played ball you was in the stands\nWhen I was sick, you held my hand\nIt was hard to say before, but now I can\nBitch, I love no ho, fuck ya!\n\n[Interlude:]\nI don't give a fuck about'cha\nTake a long walk off a short pier, bitch\nTryna to take bankrolls\nBum bitches outta here 50, man\nNow check this\n\n[Verse Two]\nCome to my crib, she say, \"B.I.G. listen\nI don't like the way you been dissin'\"\nFeel like I been kissin' other bitches cause my lips feel chapped\nI tell you \"it's from the blunts,\" you ain't tryin to hear that\nNow I'm Henny'd like a fuck? What's the riff?\nWho I'm sleepin with? I ain't got the time\nTo shoot the gift to hoes, I'm tryin to take bankroll\nI ain't fuckin nobody, case closed\nYou hit the lights and decide to doze off\nNo kiss goodnight, didn't take your clothes off\nAnd my dick is harder than a rock\nNobody to cockblock but you's a hardrock\nThe fuck you think I am, gay?\nI ain't got no time to play I ain't got nothin' to say\nBounce out the crib, just to see my man 50\nAnd what's up with B.I.G\nAnd the O.G.B., you know they keep plenty hookers\nAnd I ain't a bad looker\nSo I see one ho that I like yeah, oooh\nShit is cool\n\n[Outro: The Notorious B.I.G., ?]\nTrust no hoes, all they want is bankroll\nThat's what I'm tryin to tell you now baby\nMy man 50 done schooled me to all y'all hookers\nKnahmsayin? I ain't lame to this\nCan't spell game without me, the B.I.G", "image": "https://images.genius.com/6c96abc4bf36378ec25a3f74b38f27fb.1000x1000x1.jpg"}], "artist": "The Notorious B.I.G."}