{"songs": [{"title": "R.O.T.C (Interlude)", "album": "Overly Dedicated", "year": "2010-09-14", "lyrics": "[Produced by Jairus 'J-Mo' Mozee]\n\n[Intro: Kendrick Lamar]\nThis is me thinking at 4:43 AM, June 6th\n\n[Verse: Kendrick Lamar]\nSometimes I wanna say fuck rapping, I need money now\nLike should I start trapping? If what I write down\nDon't collect this very moment then I'm on it, no question\nIn the streets my niggas is well connected, let's see\nDo I cop a pound of kush, Promethazine or push some E?\nOxycontin have me laying on soft cotton when I sleep?\nThis is deep as the abyss, I'm not just rhyming on the beat\nI be in spots chopping the rocks like Flintstone feet\nThis is me frustrated, battling my own evils\nFinna saddle up that work, across Ohio in a Geo\nOr should I sell my music .zip to buy your zip\nAnd hope one day it flourish to a kilo, track record of a hustler\nRather records on the needle, making music\nClocking fast bank like a shot from Patrick Ewing\nMy nigga, what you doing on these corners with me?\n\"I thought you had a show?\" Well ma nigga I guess I didn't\nI'm tryna get this dough and easy money sounds tempting\nEspecially when your homies pushing V8 engines\nTwenty-two on twenty-sixes, Range Rovers rolling up\nThree-fifty for an ounce of fire, I hope I got enough\nThis industry calling my bluff, I need a new solution\nCurve-serving, know I might be in your store boosting\n2-11's with Mac-11's like fuck Hip Hop\nDon't wanna be Pun, don't wanna be B.I.G., don't wanna be 'Pac\nJust give me your funds, A.K.A. everything that you got\nOr everything getting shot, for nothing\nLeave you in shock, coughing up blood and mumbling\nWatch, the plans of a young man sponsor\nMoving grams like relocating your mom's momma\nThen expand to the Hoover dam, water\nSherm, contraband, they yearn for the butt-naked\nFuck a verse, verses get let off in thirty minutes, six seconds\nI disperse to the world of unruly, where I put the mic down\nAnd pick up a sack and a toolie, if you knew me\nYou'll know I always had a passion for riddle when writing\nBut lately, I've been thinking 'bout taking chances to brighten\nMy future financially, so please don't be mad at me\nI gotta do what I gotta do, no shit\nSo I tell my nigga front me, let me put it on the strip\nThen give it back when I think about the consequence, shit\n\n[Chorus: BJ the Chicago Kid]\nThere are times, when you need someone\nI will be by your side\nOh darling, cause there is a light that shines\nSpecial for you, and me yeah\nI-take-I-take-take my chances-chances-chances\nBefore they pass, they pass, they pass\nPass me by, oh darling\nYou've got to look at the other side\n\n[Outro: Kendrick Lamar]\nR.O.T.C—Right On Time Conscience", "image": "https://images.genius.com/9e1efc6d0a7044dbf2f0776a12ed85b8.620x620x1.jpg"}], "artist": "Kendrick Lamar"}