{"songs": [{"title": "Pussy Killz (Bonus Disc)", "album": "God’s Son", "year": "2002-12-13", "lyrics": "[Intro]\nUh\nCrazy (crazy), ah (ah)\nYo pussy kill me...\nHuh (huh).. yeah (yeah) yeah..\nHuh, huh, huh, huh..\n\n[Verse 1]\nPussy killed me when I was born (What?)\nPardon me, I'll rephrase it: departed mommy's womb decaying\nI look at the bright side\nThe fact that I got a life side\nBorn '73 - September right Nas? (True)\nVirgo child, the first thing I learn is money makes the world go round\nOn this small planet, it's ten women to one man; I wonder how we manage\nTo say vows and walk a straight line in marriage\nNiggas is some nasty creatures (word)\nBitches even nastier, they throw at your boy and it's hard for me to pass it up\nFreaky hoes lick a nigga's ass and nuts\nStupid bitch bragging 'til her baby dad went nuts (stupid bitch)\nNow he looking for me, two cars deep\nRolling up on nigga's, barrel out the window, asking, \"You Nas peeps?\"\nI can't have that, two four five, nigga grab that\nPass it to me, sucker-for-love niggas I blast at\nI swear my dick is gonna get me in trouble\nI pissing bubbles\nI thought I felt a sharp pain, better stick to rubbers\nWhen laying hooker after hooker, day out and day in\nWatch out for diseases, the doctors can't name 'em\nJust a thought: we all fuck the same chicks\nSome play like they innocent, fucking entertainers\nAnd basketball players, the bitch is a ho\nBut still some of y'all a save her, put your dick in her throat\nYou just the nigga that done wifed her (huh?)\nShe drove you crazy, now your monkey ass wanna shoot the pimp that pipes her\nShe had your baby, (damn) now you a life-er\nAnd suicide notes you write her, pussy kills\n\n[Chorus]\nOh what a thrill\nInside a bitch feel\nGotta be strong to handle it, it's real\nPussy kills\nBacks shots keep a nigga open\nBitch'll have a nigga's gun smoking\nHuh, pussy kills\nOh what a thrill\nInside a bitch feel\nGotta be strong to handle it, it's real\nPussy kills\nBacks shots keep a nigga open\nBitch'll have a nigga's gun smoking\nHuh, pussy kills\n\n[Verse 2]\nMy nigga James got married, same girl he went to school with\nNice girl, nerd with glasses, he was too stuck\nStudied for her Masters, part time nurse\nI'll tell you how superb the ass is, but who's looking\nI mean that's my man, maybe I just took a peek\nMaybe I wondered what it would be like, sike\n'Cause James and me like I was with AZ like\nLuke and Han Solo\nFucking with niggas' girls' forbidden, that's a no-no\nIt's death and we real niggas, civilized Gods\nAnd their ain't too many niggas like Nas, I'm trust worthy\nPlus I know a dude that caught his wife cheating\nKilled his baby, killed his wife, and took his own life, even\nHappy for James 'cause real bitches hard to come by\nThis nigga found one, I told him he's lucky, we clown some\nRolling up dutchies while watching Roy Jones in round one, he froze\nPut his face to the TV, 'bout an inch close\nMove out the way nigga, fuck's the matter with you, you blind?\nHe pointed to the front row, thought he was loosing his mind\nShe 'posed to be with her sick mother, left for the weekend\nWas stressed when she was leaving\nNow she's next to some nigga, cheesing\nHe's having trouble breathing (gasping for air, coughing)\nHe pictured 'em making noises, grinding him and kissing him\nYelling, \"Ain't no telling where her lips have been!\"\nLeft her foul messages, she came home no lesser than\nTen minutes later, then they start wrestling and screaming\nShe said she missed her flight that evening\nShe never left, she wasn't at that fight, you speeding\nThat's Vegas, this is New York, you bugging\nI held up my hand for a dap but he wouldn't touch it\nI'm like, \"When you started acting like that? This is dumbness.\"\nGave me a crazy look and started swinging punches\nI ducked, couldn't believe it, the nigga so whipped\nHe got his gat and started squeezing, hit two policemen\nNeighbors dialed 911, they heard the thumping\nWounded cops kicked in the door and started dumping\nMe and his wife dip to the floor she smiled strange\nMy comrade was breathing no more, they killed James\n\n[Chorus]\nOh what a thrill\nInside a bitch feel\nGotta be strong to handle it, it's real\nPussy kills\nBacks shots keep a nigga open\nBitch'll have a nigga's gun smoking\nHuh, pussy kills\nOh what a thrill\nInside a bitch feel\nGotta be strong to handle it, it's real\nPussy kills\nBacks shots keep a nigga open\nBitch'll have a nigga's gun smoking\nHuh, pussy kills", "image": "https://images.genius.com/3a2b5d523ed4c1887dcd3d37b71c01d9.1000x1000x1.jpg"}], "artist": "Nas"}