{"songs": [{"title": "Bible On The Dash", "album": null, "year": null, "lyrics": "Slanging girly in the morning early, got to catch the rush\nM. O. B. And that’s a must, C. O. D. I got no trust\nAnd I be B. M. F.’n, a million won’t last a month\nAll I need is one, P. N. C. And that’s enough\nAnd I ain’t even crank up yet, but bet I’m gassing up\nWhen my prada press that peddle bitch you better fasten up\nI excel and ash the blunt, they hell a hundred times\nThat even one hundred-one couldn’t bring back how it was\nWhen a brick was seventeen and you ain’t have to rob your plug\nWhen rapping was an art, now the shit a jug\nBet you couple dollars, few jewels, and some pussy\nI’m getting a little too power drunk, now I’m on that bullshit\n\n[Hook:]\nI got a problem and a plan, revolver in my hand\nTrying to keep it cold, but y’all won’t understand\nThat’s why I roll, that’s why I roll with the bible on the dash\nThat’s why I roll, that’s why I roll with the bible on the dash\nI got a problem and a plan, revolver in my hand\nTrying to keep it cold, but y’all won’t understand\nThat’s why I roll, that’s why I roll with the bible on the dash\nThat’s why I roll, that’s why I roll with the bible on the dash\n\nCutting corner on corona’s, trying to buck up on a bonus\nOut her on my lonely, last stogie but I’m focused\nNow I know, friends parallel to foe\nAnd all that good pussy leave you parallel to broke\nI asked the pastor, what’s the fastest way to heaven for a bastard with a tarnished past, give me your honest answer\nWith all this hannah montana, without the arm and hammer\nAm I going to get the slammer or the casket\nTrying to keep a level head, rolling on this rocky road\nThis a full time gig, trying to keep this Glock cold\nGot the work, water in the pot, need a hot stove\nAnd a down ass bitch, and a squad down to roll\n\n[Hook:]\nI got a problem and a plan, revolver in my hand\nTrying to keep it cold, but y’all won’t understand\nThat’s why I roll, that’s why I roll with the bible on the dash\nThat’s why I roll, that’s why I roll with the bible on the dash\nI got a problem and a plan, revolver in my hand\nTrying to keep it cold, but y’all won’t understand\nThat’s why I roll, that’s why I roll with the bible on the dash\nThat’s why I roll, that’s why I roll with the bible on the dash", "image": "https://images.genius.com/3dce21029cdd8aab73eb473e015807d5.1000x1000x1.jpg"}], "artist": "Rick Ross"}