{"songs": [{"title": "Use Me", "album": "Trap House III", "year": "2013-05-21", "lyrics": "[Produced By Da Honorable C.N.O.T.E.]\n\n[Verse 1: 2 Chainz]\nWho me? Ain't’ shit…\nSittin’ court-side at All-Star\nAnd this? Givenchy\nMy shirt covered in all stars\nAnd y’all wasn’t wearing gold watches\n‘Til you seen us wearing gold watches\nAnd you may have a hit bitch\nBut this one out the ball park\nAnd oh! lawnmower, just for the snake boys\nShoot your ass into pieces, man\nAnd deliver it to your front door\nOh! Encore, they want more, they’re fans now\nGot your girl ass clapping, hands down\nDon’t approach me with your hands out\nSittin’ down I still stand out\nTall nigga with jewelry on\nLike Christmas lights on a damn house\nIt’s me, and I’m cool with it\nYou don’t know what to do with yourself\nWhen I do it, I’m doing it fresh\nBorn to do it, so I do it to death\nCalm in the steps, walking my dawgs\nWe don’t get along, I’m tellin’ ‘em fetch\nHit ‘em like “PA!” Hit ‘em like “PA!”\nShoot up the spot and I’m leavin’ like “Ah!”\nOkay, you know I started from scratch\nI got to the strip club just to relax\nI get a flat tire, I buy a new car\nYou know what time it is, check the Rolex\n\n[Hook: Gucci Mane]\nIf you keep whining, baby, you gon’ lose me\nBetter choose me, baby, come choose me\nSo fine that I let the girl use me\nBut I don’t ever get used up, usually (turn up, turn up)\nBaby use, me – baby, use me\nBaby use, me – baby, you can use me\nBaby use, me – you can use me\nBut I don’t ever get used up, usually\n…makin’ no noise\nThat nigga ain’t makin’ no noise (nah, nah)\n…makin’ no noise\nNo niggas ain’t makin’ no noise (shut up)\n…makin’ no noise\nThem niggas ain’t makin’ no noise (nah, nah)\n…makin’ no noise\nThat nigga ain’t makin’ no noise (shut up)\n\n[Verse 2: Gucci Mane]\nIf you’re an ugly ho, I can’t leave with ya\nIf you’re a broke nigga, can’t smoke weed with ya\nIf you ain’t a boss then I can’t sip lean with ya\nI’m not a rapper, bitch, I’m a mob figure\n4-58, it’s a centrepiece\nThese ho niggas ain’t seen half a million\nGot a pimp cup, I’m in the strip club\nAnd the difference is these hoes ask for me\nLaFlare, nigga, I’m rare, nigga\nCaveman Shit Drag Her By Her Hair Nigga\nYou a bear nigga? Well I’m a bear killer\nYou a fuck nigga, I don’t fuck with ya\n2 Chainz, nigga, my cuh-cuh\nAll my cousins sell drugs\nMy brother sent a pack, I fell in love\nAnd told everyone I know I sell bud\n\n[Bridge: Gucci Mane]\nAll I rock is designer clothes\nAll I take is designer drugs\nSo geeked up couldn’t find the club\nWoke up on the beach with a bag of bud (damn)\n2 Chainz, two times, got major money\nMore money than a label tryna sign a thug\nAnd ya CEO say he wanna sign with me\n‘Cause the artists you’ve got ain’t hot enough…\n\n[Hook]", "image": "https://images.genius.com/2d6a6af130abeb84aebd2824e7c3ef8a.500x500x1.jpg"}], "artist": "Gucci Mane"}