{"songs": [{"title": "My Story", "album": "Cloud 9", "year": "2008-01-01", "lyrics": "[Intro]\nDJ Chapman, what's happenening? Oh, yeah!\n(Commissioner! Terry Urban..)\nThis motherfucker on?\n\n[Verse 1]\nOkay, I think I wanna tell ya'll a little story..\nAbout a young boy, a very young boy\nAlways playing games, but he never had a toy\nMaking A's in school? (Psh) He couldn't do it\nA crazy motherfucker, yes, everybody knew it\nLong story short, that nigga was me\nThat nigga is B., destined to be\nA failure, but I still made it out - hell yeah!\nI was stubborn, couldn't nobody tell me nothing\nWalk around smokin' like I live in Amsterdam\nMiddle finger to the sky, like I don't give a god damn\nBut rebellion is just a side effect\nHomicidal? Maybe, Suicidal? Yes\n\n[Interlude]\nBoy, I tell you, niggas be like:\n[\"Niggas\":] \"Why in the hell you so quiet, nigga, you sick?\"\n[B.o.B:] \"Haha, hell yeah I'm sick nigga look at me, you can't tell? What you think going on with my head? I don't even know, I need God to tell me.\"\nBut anyway, let's get back to the story, enough of this shit talking now\n\n[Verse 2]\nMy daddy from the Barn, and my momma from the gutter\nSo I guess that makes me a country motherfucker\nAnyway, in school, your boy was a huslter\nI had everything on deck to get that butter\nBut I was headed down the wrong path - smoking weed, selling weed, failing out of class\nBut I was like, \"Fuck what the 'Po think, I'm a let the [?] stain\"\nBut I ain't fuck with crack, ya'll can have that\nBut on top of that, I thought I got a bitch pregnant\nFor 7 damn months I thought she was expecting\nThen I found out it wasn't mine, but that was only half the issues that was off my mind\n\n[Interlude]\nAnd then, my parents was telling me \"You need to go to college, and you need to do this..\"\nAnd I was like, \"No sir. I'm straight on it.\"\nI ain't trying to spend 40 thousand, just to be 50 thousand in debt when I graduate\nAnd a scholarship? What the fuck is a scholarship?\nMy G.P.A started with a damn decimal, you know what I'm saying?\nBut anyways, let's go\n\n[Verse 3]\nBack to the saga, I'm dealing with these problems\nI'm back to graduating, I ain't finna to go to college\nSo I gotta figure out how I'm gonna make some dollars\nBut I ain't in the streets, so I gotta slang beats\nThen I sold my first beat, got a couple stacks\nAnd just like a nigga, I spent it like that\nGot a couple diamonds, got a couple hats\nAnd filled up my closet with some shoes and some slacks\nNow I'm back to square one, where I'm at now\nRapping in this booth, in this basement of a house\nBeing honest man, I'm just trying to make it out\nBut fuck it man, I'm out\n\n[Outro]\nYeah.. And that's this typical story of a young black male, living in Decatur, off Cantler Road\nBut you know what, though? This just ain't your typical story, you know what I'm saying?\nBut y'all watch out though, y'all gon' see.. Aha!\nI ain't really got shit else to say, I just want to hear myself talk\nAnd I know y'all want to hear me talk, cause y'all still listening\nMy voice sound sexy, don't it? Aha! I'm just fucking with y'all, I'm", "image": "https://images.genius.com/adcf6114ce030b4f70858bc64c941f6f.496x496x1.jpg"}], "artist": "B.o.B"}