{"songs": [{"title": "One", "album": "Supreme Clientele", "year": "2000-02-08", "lyrics": "[Intro: Ghostface Killah & Trife Diesel]\nYo, yeah, new Ghostface!\nTo glorious days, (True, indeed, God)\nCheck it out, y'all\nWe back, yes, yes, y'all (Fake roller derbies)\nMasked avengers, (We're here to sharpen your sword)\nAll praises due to T.M.F., Wu-Tang Clan\n(Scream on it, Ghost)\n\n[Verse 1: Ghostface Killah]\nAyo, we at the weedgate, waiting for Jake\nWe want eight ravioli bags, two thirsty villains yelling bellyaches\nHeavyweight rhyme writers, hitting the grass that's the ripest\nPull out this kite from this white bitch\nTalking 'bout, \"Dear Ghost, you the only nigga I know\nLike when the cops come, you never hide your toast\"\nGuest starred in mad shit, CBL, Ice Water metallic\nPast tense placed in gold caskets\nDru Hill bitches, specialist lounging at the mosque\nSuede kufi wrap, undercover dentist\nRhymes is made of garlic, never in the target when the NARCs hit\nRumor is you might start to spit\nYou nice Lord, sweet daddy Grace, wind lifted\nOn the dancefloor, makeover's free followed by gauze\nDuncan Hines monument cakes, we never half-baked\nAlaskan, sexcapade, push your new court dates\nTrauma, hands is like candy canes, lay my balls on ice\nThe branches in my weed be the vein\nSwimsuit issue, darts sent truly from the heart, boo, I miss you\nSee daddy rock a wristful\nModern-day slave God, graveyard spells fog, get goggles\nLaying like needles in the hospital\nFive steps to conquer, ask Bernadette, Baguette swizzle\nZiploc your ear, hear thistle\n\n[Bridge: T.M.F.]\nTo my real bitches take your drawers off\nTo all my high niggas, snatch her skirt off\nJust in case she wanna play, get up in that bitch face\nAnd tell her Ghost said, \"Take your clothes off!\"\n\n[Chorus: Ghostface Killah]\nAyo, the Devil planted fear inside the black babies\nFifty cent sodas in the hood, they going crazy\nDead meat placed on the shelves, we eat cold cuts\nFast from the hog y'all and grow up\n\n[Verse 2: Ghostface Killah]\nAyo, crash through, break the glass, Tony with the goalie mask\nThat's the past, heavy ice Roley laying on the dash\nLove the grass, cauliflower hurting when I dumped the trash\nSour mash served in every glass up at the Wally Bash\nSunsplash, autograph blessing with your name slashed\nBackdraft, four-pounders screaming with the pearly ash\nChildren fix the contrast as the sound clashes\nMrs. Dash, sprinkle with her icicle eyelash\nAsk Cappa Pendergrass for backstage passes\nSpecial guest, no more Johnny Blaze, Johnny Mathis\nAcrobat, run up on that Love Jones actress\nDistract the cat while I'm high sugar get a crack at this\nDicking down Oprah, jumprope, David Dinkins\nWatch the black mayor of DC hit the mocha\nTangerine sofa, two super soakers in the Rover\nHit the sport's bar, tell a young lady to bend over\nMeditated yoga, Paddle Ball, dancing with the vulture\nCastor Troy laying for Travolta\nYo, switch the lingo, five-nine-seventy\nGod glow, seven fifteen four be ebony\n\n[Chorus: Ghostface Killah]\nAyo, the Devil planted fear inside the black babies\nFifty cent sodas in the hood, they going crazy\nDead meat placed on the shelves, we eat cold cuts\nFast from the hog y'all and grow up\n\n[Outro: Ghostface Killah & (Tommy Whispers)]\nAyo, Wu-Tang Clan, T.M.F. in the motherfuckin' joint\nWe all connect as {\"one\"}\n(Aw shit, baby) Straight up and down y'all\n(Staple-town, y'all) Yo, how many girls you gotta fuck, yo? {\"one\"}\n(Ah-hah, know I'msayin? Trey-Mack, what?)\nHow many nigga you might bust? {\"one\"}\nHaha, straight up and down\n{\"one\"}\n(How many shots?) {\"one\"}\n{\"one\"}\n(That's it) Word up\nHow many cakes we bake, y'all? (​\"one\")​\n(Yo, yo, yo)  {\"one\"}\n(Aw shit, haha) <...at a time, nigga?> {\"one\"}\n{\"one\"}", "image": "https://images.genius.com/d77a412e9c8950b0cc31ab1d5a64444e.800x800x1.jpg"}], "artist": "Ghostface Killah"}