{"songs": [{"title": "To Whom It May Concern", "album": "Trust The Process", "year": "2017-08-07", "lyrics": "[Intro]\nThank you for being here with me today\nAppreciate you for coming\nTrust The Process\n\n[Chorus]\nIf I give you all of me, would I get all of you?\nIf I told you I'm anointed, could you see the proof?\nGive my heart and soul for you when I'm inside the booth\nFeel my love, feel my pain when I'm inside the booth\nWould you switch or change on me if you knew the truth?\nNo, I ain't the same person that was introduced\nThank the Lord 'cause I don't look like what I been through\nHere's a letter to you\n\n[Verse 1]\nI'm back again\nJesus on that cross, I had to rise again\nTime to get my blessings, time to get my blessings\nI had to live my life, I had to learn my lessons\nI had to keep that smile but deep inside I'm stressing\nJust tryna keep my spirits from that deep depression\nIt's time to tighten up\nI put my pride down and pick that Bible up\nLooking in the mirror tryna find myself\nQueen, she know I love her till it life or death\nLiving on the edge plotting on the plans\nNothing without God, nothing without my fans\nSorry for my absence, hope y'all understand\nNo more We The Best, but Khaled still my man\nCritics want the beef but I'm not feeding them\nMy loyalty don't stop if we don't speak again\nI could cry tears right now\nDon't know how I feel right now\nAll that meditation that I did, all that beasting in the gym\nAll this energy inside I got to give\nBack and I'm better than y'all, ready whenever the call\nThey expecting me to fold, friends turn into ya' foes\nKept focus on the goals, mind, body and the soul\nNew me, it's a new day, that's another story untold\nGod, nigga\n\n[Interlude]\nAt some point, we gotta talk about it\n\n[Chorus]\nIf I give you all of me, would I get all of you?\nIf I told you I'm anointed, could you see the proof?\nGive my heart and soul for you when I'm inside the booth\nFeel my love, feel my pain when I'm inside the booth\nWould you switch or change on me if you knew the truth?\nNo, I ain't the same person that was introduced\nThank the Lord 'cause I don't look like what I been through\nHere's a letter to you\n\n[Verse 2]\nI'm back again\nFeeling so immortal I must rise again\nPut that on my mama, put that on my kids\nR.I.P. Fo' Fifth, I tat that on my skin\nYou just be my angel till we meet again\nI can hear you nod like \"just keep going in\"\nI'm feeling the ether, I'm feeling Aretha\nI keep it realer than people ain't no lies comin' out of the speakers\nI gotta watch for the leechers, false prophets and the evil preachers\nCome with normal features, I'm that different kind of a creature\nI'm a fucking soldier, all my trials done made me stronger\nPassion, I can't control it, hating, I can't condone it\nSomething just gotta give, don't listen, you gotta feel\nPart of me had to die so one part of me gets to live\nWalking out on the label I put aside all the fears\nI'ma show all you niggas I do this shit here for real\nOn God\n\n[Chorus]\nIf I give you all of me, would I get all of you?\nIf I told you I'm anointed, could you see the proof?\nGive my heart and soul for you when I'm inside the booth\nFeel my love, feel my pain when I'm inside the booth\nWould you switch or change on me if you knew the truth?\nNo, I ain't the same person that was introduced\nThank the Lord 'cause I don't look like what I been through", "image": "https://images.genius.com/63a45994a9026932298eb838abe3f8b5.500x500x1.jpg"}], "artist": "Ace Hood"}