{"songs": [{"title": "Forever Begins", "album": "Finding Forever", "year": "2007-07-31", "lyrics": "[Produced by Kanye West]\n\n[Verse 1: Common]\nVictory won, in a world of Henessey and guns\nToo young for the marches but I remember these drums\nThe stark reality of wars and battles\nWe fought for ours, caught in ghetto tragedy\nI talk to my aunt named Mattie Lee\nAnd recognize the importance of family\nHand me a joint, good music, and room to breathe\nThose that doubt Com' will soon believe\nCan't judge the weave, my lady had one\nI'm more like a fool for soul and passion\nThe price of gas rises, street life is pumpin' fast, lives is\nI watched Crash and realize that we all survivors\nNo religion or race could ever describe us\nMy guys do dirt, move dirt, but never really talk about it\nForever begins just because I thought about it\n\n[Chorus: Bilal]\nLiving once again\nWe live\nThen you're gone\nLiving once again\nWe live\nThen you're gone\nLiving once again\nWe live\nThen you're gone\nLiving once again\nWe live\nThen you're gone\n\n[Verse 2: Common]\nAshes and snowfalls\nI wonder when the roll call for heaven gon' come\nForever gon' come\nIt's a cold world and I can never go numb\nLook fear in the eyes, say I never gon' run\nSooner then later, I know the cheddar gon' come\nFor now I write the world letters to better the young\nOn tree by jury, together we hung\nNow we let our chains hang and gang bang to maintain\n'Ghanistan goin' through the same thing\nIt trickles down, at each other we aim pain\nI shoot for stars, peace and exclusive cars\nThrough the ride I learned to earn hard\nWatch gangstas turn God in the midst of war\nNo matter how much I elevate, I kiss the floor\nIt was in the wind when she said Dilla was gone\nThat's when I knew we'd live forever through song\n\n[Chorus: Bilal]\nLiving once again\nWe live\nThen you're gone\nLiving once again\nWe live\nThen you're gone\n\n[Outro: Pops]\nOrigin is forever\nWell, well well\nHere we are back in the studio again\nLook at that\nHey I don' need no cue cards\nThey got the engineers holdin up the cue cards\nWhat that say?\nOh they say, just talk, don't sing\nSon, I bet you feel like you and I've been here forever\n30 years old red eyes, beholding red eyes\nI see my world's tears\nYeah, origin is forever\nEvery peak will have 2 valleys\nHopeful eyes in the comfort\nOf true protection and admiration of a child\nThat's forever\nForever is to strive\nA place of endearment\nForever is what I leave\nMy I-self contribution\nDamn, what I'm gon' leave?\nOk...\nI'll leave my one and only grain of spiritual sand\nTo universal scales of humanity, all humanity\nForever is finding a solution to a solution\nTsunamis, hurricanes\nFollowing the trails of the African slave ships\nWar, war, and more war\nFloods, Columbine, global warming, earthquakes\nAnother somebody done me wrong, son\nVirginia Tech, is not an, \"Oh, what the heck?\"\nWe're still, did you place your one grain\nOf spiritual sand forever?\nConfusion need a solution\nBlend and stir, stir and blend\nThe pot of humanity; sift the ingredients\nOf acknowledgment, apology, amendment, atonement\nWe gonna work with the four A's here\nForever Pops\nCommon good is forever...\nGod's memory is forever...", "image": "https://images.genius.com/da89ed2094b9a8d542d03ed39ea208e1.1000x1000x1.jpg"}], "artist": "Common"}