{"songs": [{"title": "Doggystyle", "album": "Death Row: The Lost Sessions Vol. 1", "year": "1993-11-23", "lyrics": "[Intro: George Clinton]\nYeah, this is a story about a famous dog\nDoggy Dogg that is\nThat smooth macadamian, a.k.a Silky Slim\nBack in the motherfuckin' house for nine-trey\nWhy must he be like that?\nWhy would any other dog hit it from the back?\nIt's in his nature, it's Doggystyle baby\n\n[Hook 1: Jewell]\n(Oh I, oh I) It's Doggystyle (oh-o-o-o-oh, uh oh oh-o-oh) Doggystyle (I)\nDoggystyle, it's Doggystyle\n(Oh I, oh I) Yeah it's Doggystyle (oh-o-o-o-oh, uh oh oh-o-oh)\nIt's Doggystyle yay (I)\n\n[Verse 1]\nIt's like tonight is the night by Betty Wright\nIt's my first piece of ass and it's awfully tight\nBut I'm still finna handle my business like a dog\nFading that pussy, yes y'all\nSo lay back baby girl, and take a trip with me\nI got the drink on deck, so take a sip with me\nDrip with me, while I swing my thang\nReminiscing 'bout the first time Doggy Dogg came\n\n[Hook 2: Jewell, (George Clinton)]\nIt's time to take you motherfuckas down memory lane\n(Memory lane, memory lane, Doggystyle)\nIt's time to take you motherfuckas down memory lane\n(Down memory lane, Doggystyle)\nOh I, oh I, oh-o-o-o-oh, uh oh oh-o-oh (yeah) I (yeah, Doggystyle)\nOh I, oh I, (yeah) oh-o-o-o-oh, uh oh oh-o-oh (yeah, Doggystyle) I (Doggystyle)\n\n[Verse 2]\nIt was a hot sunny day in the month of May\nI'm next door to the house with my homie J\nInstead of being at school, I'd rather ditch and shit\nCause at one-forty-five I got a bitch to get with\nEven though I'm young, I'm kind of real good\nWith working my thang to get a bitch sprung\nShe glimpsing in the mirror and shit\n'Cause once I'm in it from the back all I'm hearing and shit is\n\n[Bridge: Jewell]\nOnce you get near, the pussy gets clearer\n(I can see it)\nI will do things to blow your socks off\n(I can feel it)\nOnce you get near, the pussy gets clearer\n(Doggystyle, Doggystyle)\nI will do things to blow your socks off\n(Yeah)\n\n[Verse 3]\nA little something for the bitches that's down with me\nKeep it low as you creep and get around with me\nDon't be afraid like Aaron Hall\nYou know you want to fuck your nigga Doggy Dogg\nHave you ever had your pearl tongue licked and shit?\nWhile your nigga's in the county and you eating a dick\nThe position I'm fishing and wishing for\nIs doing it Doggystyle, bitches blow\n\n[Hook 3: Jewell]\nOh I, oh I (oh yeah), oh-o-o-o-oh, uh oh oh-o-oh\n(Doggystyle, doing it Doggystyle) I (do it Doggystyle)\nOh I, oh I (oh let me feel it), oh-o-o-o-oh, uh oh oh-o-oh\n(I can see it, I can see it) I\nOh I, oh I, oh-o-o-o-oh, uh oh oh-o-oh\n(Doggystyle) I (Doing it Doggystyle)\nOh I, oh I, oh-o-o-o-oh (doing it Doggystyle), uh oh oh-o-oh I\n(oh yeah, I can see it)\nOh I, oh I (oh I want to feel it), oh-o-o-o-oh, uh oh oh-o-oh I\n(doing it Doggystyle, I want to do it)\nOh I, oh I (I can feel it) oh-o-o-o-oh, uh oh oh-o-oh I\n(doing it Doggystyle, I want to taste it)\n\n[Outro: Jewell]\nSnoop Doggy Dogg, won't you hit it from the back?\nI like it like that\nDoggystyle, Doggystyle\nWon't you do it\nWon't you do it Doggystyle\nWon't you, one-two, won't you\nGive me love, that pussy get near it\nWon't you hit it from the back\nSnoop Doggy Dogg\nI heard you do it, do it all the time\nI heard you doing it, doing it Doggystyle\nAnd with the Dogpound\nYeah\n(Doing it Doggystyle)\nGivin' them bitches what they want\nServing them hoes, but you don't love them hoes\nI'll tell them some more\nThat you're doing it, doing it, Doggystyle\nOh yes\nBaby\nAin't no- ain't not- ain't nothin' but a G-thang\nBaby\nDo it Doggystyle for the nine-trey\nWith Dr. Dre\nYeah, doing it Doggystyle\nDoing it, doing it, Doggystyle\nYeah\n\nLive Studio Noise", "image": "https://images.genius.com/7cc2f7ed3fbd943a987123697bc1a07a.1000x928x1.jpg"}], "artist": "Snoop Dogg"}