{"songs": [{"title": "You Know What It Is - New Explicit", "album": null, "year": null, "lyrics": "[Chorus]\nI'm a real nigga homie tote six figures only\nGotta pistol you don't want it boy you know what it is\nI'm way flyer my pays way higher\nIf they ever mention sire boy you know what it is\nAin't about drama you don't want no problems\nI'll up that Llama boy you know what it is\nI get money all I count is big money\nDick is all she get from me boy you know what it is\nAy ay ay ay ay, boy you know what it is\nThe wait is over here we go again I'm back in the play\nI sell another couple mill and take it back to the A\nI take another couple mill and put it back in the safe\nFive cash for the crib on the back of the lake\nI'm up in Crucial 2 stepping with the gat in the waist\nT.I. ain't in the street no more fuck ho' dat what they say?\nThe men trying when you see 'em boy you have to be great\nThe pistol hit you in the face your teeth they have to replace\nThat's if you lucky nigga trust me it don't hurt me to take\nA 100 thousands to them Haitians you'll be murdered today\n\n[Chorus]\nWomen sweating when they see me I'm apparently hot\nHad the album of the year nigga Grammy or not\nRemember all day I used to stand in the spot\nWith two revolvers in my pocket pitchin' handling rocks\nBut now chart topping in a car I ain't got\nI am the number one customer at my own car lot\nYou want to know how much money I'm makin' just imagine a lot (10-20)\nI'm probably making more than you'd imagine I got (30-40)\nListen closer I need to know if you understand me or not\nBecause you disrespecting me you and your man will be shot\n\n[Chorus]\nWent from the king of the south to the king of the states\nRiding in a car you probably never seen in the states\nNo idea how much yay' I can bring in the states\nYou can get a hundred on 'em four million a day\nFrank Lucas ain't the only one who made a million in a day\nBut it's an American gangsta right here in your face\nAnd you don't want to see PSC in the scene with AK\nYou think you runnin' up and robbin' that ain't even the case\nJust 'cause you get away that don't mean its OK\nYou a dead man walkin' and I mean it OK?\n\n[Chorus]", "image": "https://images.genius.com/68262ccdcbffb87427d31b0d6085c2e3.400x400x1.jpg"}], "artist": "T.I."}