{"songs": [{"title": "Where Ya At?", "album": "One Million Strong ", "year": null, "lyrics": "[Ice Cube]\nSo yo check this out\nThis is Ice Cube from the Westside Connection\nCallin all the way from Johannesburg, South Africa\nThe world has never seen a million black men in one place\nBut on October 16, in Washington, D.C., a million black men will gather\n\n\"This is a mission, not a small time thing\" (sample repeats)\n\n[Mobb Deep]\nYeah yeah yeah yeah yeah, word up son, check it out though\nYaknowhatI'msayin? Word up son\nListen up son, knowhatI'msayin?\n(Watch out for them man) Listen up son, check it out though, yo\n\nOpen your eyes get wise and look alive focus your attention\nWindows 95 updated high tech lynchin\nCrosses of the colored man who claims he holds the keys to the safe\nSecrets of the world, blow him in his face\nWho's the master of the universe, galaxy and planets\nBabylonians ecstatic moon the sinkin of Atlantis\n(Be the one soul original black filled with melanin\nGoin out like represent Kuwait in two thousand)\n\n[Ice-T]\nBrothers gonna have to put themself in check\nThree strikes you in the penzo, checked to your neck\nYour woman cries, your baby grows up alone\nTalkin through a three inch glass on a two way phone\nYou tell me brothers got no options today\nYou best to listen to the Ice closely fool, crime don't pay\nGas and dope bullets and coke ain't the way\nYou need to march with the Nation on Atonement Day, represent\n\n[Chuck D]\nNow, to all my brothers we be rhymin like this\nYeah I can handle, but they can't kill it mill or dismantle it\nAnd we can leave the component alone\nShow all my brothers a brother instead of negro\nCrackers in the back obscene knahmean\nBut I've been knockin em out the box like saltines\nSo on the single we be flowin at the lingo\nComin together, not solo like Mandingo\n\nChorus: all together\n\nSo where you at y'all?\nRight here, hangin with my brothers and we showin no fear\nSo where you at y'all?\nRight here, if you represent then throw your hands in the air\n\n[Smooth B]\nArm Leg Leg Arm Head\nMy people with braids waves dreads and baldheads\nA million strong doin duty, wisdom strength beauty\nUmmah Ahs they are, sun moon star\nAnd it's a holy day, come sober\nSmooth B in D.C., sixteenth of October\nIn unity there is power, none can devour\nHour after hour, we shower\n\n[RZA & Killah Priest]\nImagine us travellin back to Nazareth\nMost fabulous\nTo raise up the black dead slaves like Lazarus\nWhen I catch rays through the blaze holy essays\nNo more death days and vexed slaves possessed in caves\nYo it's the last days and times we gots to raise your mind\nBrothers walk around dumb different and blind\nPregnant Earths always carry eggs\nI pledge to never fall off the ledge\nAnd blacks remain family like Sister Sledge\n\n[Shorty]\nGod prepared the table for us, in the presence of our enemy\nNow we soon to be, one in unity\nOne two three I'm a G\nBut the God inside is that G I chose to be\nThe world is a stage and everybody plays a part\nI'm not considered, the one with a sensitive heart\nWhen I say black man you say go\nBlack man GO black man GO\n\nChorus\n\n[DA Smart]\nSomebody stole me, you took me from Kunta to Toby\nAnd mold me, in a way that you freed me but still hold me\nWhat you tryin to pull? Eatin us like cannibals\nWhatever happened to that forty acres and that animal\nNow you tryin to use integration just to fool us\nLike Malcolm said, we been hoodwinked and bamboozled\nMama cryin, and I ain't lyin\nI'm going to Washington for justice, I'mma get it, or die tryin\nDon't hesitate, he's at the gate\nAnd that's a million black men in one place to set it straight\nSo black women applaud the black God\nI'm DA Smart, with the million man march\n\n[KAM]\nDamn that's how you know the world about to end\nRain hail snow earthquakes and a million black men\nUpon the God indivisible\nWith liberty and justice for all cause y'all done made us miserable\nWith this AmeriKKKan nightmare\nThat's why October 16th we gon be right there like yeah\nThe same niggas that you want gone\nWell we about a million deep on your front lawn\nIt's goin on from here to Abraham Lincoln's statue\nAnd every brother here thinkin yeah we need to holla at you\nAbout this overdue bidness\nWith the Black Muslim, Christian Jew and Jehovah Witness\nTo get this out in the open the only way\nIs for us to declare a black holy day\nThe homies say that they rollin\nPlus we got family, forty miles up, controllin\n\nChorus 4X (to fade)", "image": "https://images.genius.com/48632002ee4fdf3d2414cabd5fa44fda.240x240x1.jpg"}], "artist": "Ice Cube"}