{"songs": [{"title": "Leave Me Alone", "album": "K.O.D.", "year": "2009-10-06", "lyrics": "[Intro: Tech N9ne]\nWhere I'm at right now..\nI ain't got no tolerance for something stupid\nOr hatred, or envy, if you bringing any one of those\nHow 'bout, leave me alone\n\n[Verse 1: Tech N9ne]\nThey pray I'll free fall any day\nWell I don't need y'all anyway\nNegativity give me nay, you finna hear me say\nJust leave me right here with my Henny, save my chicks and plenty pay\nYour boy Tech done blown, an still rep the home\nBut now I just wanna be left alone\nThey wish death and my flesh and my chromosomes\nSlept my songs, they need a little bit less Patron\nAnd they holler, the weirdo! When I walk in the spot\nThe zeros pissed 'cause they ladies wanna swallow my gyro\nThey live in squalor and fear though\nThey daughter come here though, she know I keep plenty Robert De Niro\nYou punks'll never get to see me let a tear go\nStarted hatin' the second I busted a mere flow!\nI just want you to get some gones, not near no\nNegative energy that is a remedy, aiyyo listen here bro\n\n[Hook: Krizz Kaliko]\nStay away from me, please stay far away from me\nLeave me by my lonely, just let me be\nStay away from me, please stay far away from me\nLeave me by my lonely, just leave me alone!\n\n[Verse 2: Tech N9ne]\nThe hood don't play me huh?\nTreat my Strange Music like rabies, huh?\nThey be saying Tech Nina, he crazy huh?\nBut you want me on your video and CD\nYou elementary rappers are straight remedial - A.D.D\nI'm in my own world partner, and you don't fit there\nAll your Tech hatred has got you sounding like a bitch, playa\nAnd this is to multiple haters and I swear it\nAin't about a pass homie, but if the shoe fit wear it nigga\nIt's a size N9ne, wanna step inside mine?\nIt'll feel like you died trying and you will know that I can't buy time\nFor you to catch Casper it's high time\nYou tried crimes against me 'cause you couldn't follow the guidelines\nThey say respect yo' elders! You best go tell the Lord\nForgive you 'cause what's next - your failure!\nJust leave me where it's less your hell, brah\nInvest your mail to something that sell\n'Cause the Tech don't smell ya, Tech gon' tell ya\n\n[Hook: Krizz Kaliko]\nStay away from me, please stay far away from me\nLeave me by my lonely, just let me be\nStay away from me, please stay far away from me\nLeave me by my lonely, just leave me alone!\n\n[Verse 3: Tech N9ne]\nLeave me singular, numero uno, ichiban\nThey want my doom and my funeral, psycho bitch be gone!\nLosing my lithium quickly this chick done hit me don\nAnd bit me on my finger, tell Trav to get me bond\n'Cause if it happens again! If it happens AGAIN!!\nI'ma - FFF- uh... boy!\nI wish I had no problem with smacking a friend\nWith a gat for snapping a chin\nBut I got chicks that wanna get it in, fo' sure\nI'm taking all the crazy hoes outta my lady mode\nI'm done with the oldies, nothing but new shit in my radio\nLeave me solitary 'cause the way she go is shady though\nIt's later for their ego, no more Tech N9ne, let the baby know\nAll of you need to try clit, and straight deny dick!\nLeave us alone 'cause you're mentally damaged, no try sick\nI wish I wasn't a star and the gentleman would die quick\nSo next time you tripping, I'll flip and hit you in yo' eyes, bitch!\n\n[Hook: Krizz Kaliko]\nStay away from me, please stay far away from me\nLeave me by my lonely, just let me be\nStay away from me, please stay far away from me\nLeave me by my lonely, just leave me alone!", "image": "https://images.genius.com/de5c12836aa9b9bbb55356aafbf1fa0a.900x900x1.jpg"}], "artist": "Tech N9ne"}