{"songs": [{"title": "Assassination Day", "album": "Ironman", "year": "1996-10-29", "lyrics": "[Intro: Sample]\n\"There's no coke\nWhat?\nYou heard me you dumb fuck, there's no coke\nWhat the fuck do you mean there's no coke?\nI've been up and down this ship\nI've been in every fucking room\nThere's gotta be coke\nThere is nothing, nothing.\"\n\n*heavy panting*\nHelp PLEASE!\n*panting continues*\nHelp me!\n*gunshot*\n\n[Chorus: Masta Killa]\nIt's assassination day, I stalk\n\n[Verse 1: Inspectah Deck]\nI move through the Third World, my third eye's the guiding light\nInvite the fight, we all die tonight\nThe life I live's a 25 to life bid\nParole reneged, I stroll the globe fugitive\nCream is short, Cee Cipher Power stalk, plus the fiend talk\n3 Gs the cost in Supreme Court\nWhite lies and blackmail land me back in jail\nWe're all for sale, a stolen goal but it fail\nStranded on the front line, I shine to the dumb and blind\nIt comes time I take back what was once mine\nCrunch time in the first quarter, from the worst slaughter\nDevil's poisoning the birth water\nThe earth daughter rest her head on my chest\nThrough the struggle we cuddle under half-moon crest\nWhile the press plant fear and exploit the gun blasting\nCentral broadcasting is shackling, nerves are unfastened\nTrapped in deep water, gasping\nI clash with the titans for my half on the action\n\n[Verse 2: RZA]\nI stop producers careers, the weak spot was the ears\nScorpion darts hits the mark, pierce the heart with silver spears\nYou're bewildered, my unsaturated, low filtered\nDevils still feel this so you're living build tilted\nMCs upon their axis, their body hazard tactic\nLactic acid, desert dry cactus, practice\nYou can never match this invincible, Wu-Tang indispensable\nOne nation under God, indivisible with liberty and justice\nThe mic is in my clutches\nThugs who bring ruckus leave in crutches\nUnforgivable snakes face the double-edged swords starts to swivel\nDecapitates the head, makes the projects more livable\nInterchangeable, caution: flammable\nMy chamber is 99 plus 1  unnameable angles\nAnd strangles, microphone cords start to dangle\nSilent as the gases that pass throughout your anal\nWe creep through your doors\nSeep out like sweat through the pores\nDestroy your internal organs with the biological warfare\n\n[Verse 3: Raekwon]\nFirst of all before we move on, this shit is like a Yukon, don\nSpread it out like Grey Poupon\nSplurging, merging in the suburbs\nUsing this just like an adverb, action word, flowing like a blackbird\nGod came in, aiming like Terry Bradshaw\nHe hit the crash bar, stay relaxed God, his shit is smashed, Pa\nYou handle this just like algebra, UFO spot 'em like Galaga\nHolding like bullet-proof Acuras\nYou so fly, yeah right, you want to get me high, yo, Bobby\nYou hear how I'm shooting it like they blue tops\nNo, you won't play me like your lady\nPay me 380, spit it at you like a baby, final destination, Hades\n\n[Verse 4: Masta Killa]\nWar's extremely serious and it saddens me\nTo have to take things to deadly measures\nAnd have you measured and shot for no pay\nIt's assassination day I stalk my enemy like prey\nTranqued by deceptional sounds that deceives\nAnd lures MCs to the lair\nWith a mic-like bait, then awaits to be bitten by greed\nTemptation tempts my victim to proceed\nForward, ignorance wouldn't allow retreat\nYou'd rather pursue death than admit defeat\nNow who's best to describe for what I specialize in\nMurderous rhyming, constantly inclining\nMy mind spits with an enormous kickback\nYour brain then absorbs the impact\nDisorderly conduct from the crowd is the feedback\n\n[Chorus: Masta Killa]\nIt's assassination day, I stalk", "image": "https://images.genius.com/86aaa4a25c81fd34a671c2db7083cc80.800x800x1.jpg"}], "artist": "Ghostface Killah"}