{"songs": [{"title": "Quintana Pt. 2", "album": "Days Before Rodeo", "year": "2014-08-18", "lyrics": "[Intro: Travis Scott]\nI'm finessin', finessin' (Straight up)\nI came up a hundred bands a week, straight off finessin'\nLa Flame\n\n[Verse 1: Travis Scott]\nWalked in this bitch, I just got through finessin' designer (Straight up)\nOh my God it's no rental, gold plated, no need to remind you\nRobbed my plug, that nigga wasn't getting me high (That dope)\nOh no no, oh no no no no no no no\nStack on black as True Religion (Straight up)\nThis that shit that keep you geekin' (That dope)\nI done fucked me 'round five bad bitches this morning (La Flame)\nAnd I ain't goin' back unless they horny (Oh no)\nOh no no, oh no no no no no no no\n\n[Chorus: Travis Scott]\nFinessin', finessin' (Straight up)\nI can't go one day without finessin' (La Flame)\nFinessin', finessin' (Bando)\nI came up a hundred bands a week straight off finessin' (Straight up, straight up)\nI came up a hundred bands a week straight off finessin'\nBeen on that weed, with my team\nRolling with my team, yeah they all finessin'\n\n[Beat Switch]\n\n[Verse 2: T.I.]\nMan, here it go, fishcale, A1 perico\nFill PJ's up with kilos, then sell it like it's legal, yeah\nEverybody he know, could have gotten hit with the RICO\nCaught a couple of charges, they were weak though\nFeds had to let him go in a week or so\nStill, still need the key to blow\nWhole heap of dough, ran the streets for so long\nMan the team was so on, damn it seem like so long\nAgo, we had 'em in Mexico\nHe tryna' make it back, three bricks more\nThe people always run up on us in Texas though\nOnly by the grace of God they ain't catch us though\nSome lil' young nigga with some big dreams\nAlmost on the verge of doing some big things\nTryna' get a bird since he was sixteen\nAnd now he playin' ‘round with fifteen or more, ayy\nYou know a nigga love nice things\nAnd the price in the hood is too frightening\nThem niggas ain't gon' do the right thing\nIt’s time for me to do my thing (Hey)\n\n[Beat Re-Switch]\n\n[Chorus: Travis Scott]\nFinessin', finessin' (Straight up)\nI can't go one day without finessin' (La Flame)\nFinessin', finessin' (Bando)\nI came up a hundred bands a week straight off finessin' (Straight up, straight up)\nFinessin', finessin' (Straight up)\nI can't go one day without finessin' (La Flame)\nFinessin', finessin'\nI came up a hundred bands a week straight off finessin' (Straight up, straight up)\n\n[Outro: Travis Scott]\nHow high?\nTell me why she wanna leave me?\nShe used me to get high\nOh she used me to get higher, higher, higher\nSo tell me why she wanna leave me?\nOoooh, ooooh, oooh, ooh-oooh\nOoooh, ooooh, ooooh\nAs the days go on, the southern region of our national anthem\nThe quest for La Flame, this journey, it's the last days", "image": "https://images.genius.com/ae4cdbfd5d98b2b161e9adb04edbe619.500x500x1.jpg"}], "artist": "Travis Scott"}