{"songs": [{"title": "I Make the World Spin", "album": "Haywire", "year": "2009-06-18", "lyrics": "[Verse 1]\nYo, white eyes, black tee\nIll rhymes, that’s me\nHollywood's now labeled as lame\nBut I’ve been on that raw shit since I came in the game\nFuck this! Rap niggas trying act like they punk rock\nTight jeans, Mohawks screaming “fuck cops”\nY’all should get your fucking nuts chopped\nYou all look like you suck cock\nBust shots if you hate me\nYup that’ll fix the problem\nPut me out there, leave it up to Mr. Goblin\nTo contribute to all the bullshit that’s dropping\nSo he can take his kids out Christmas shopping\nLook at the niggas I'm spinning circles around\nMy verbal profound lyrics make them hurdle the town\nThey washed up 'til they gurgle and drown\nTheir whole dynasty I’m burning it down\nFunk Volume, you’ve heard of it now\n\n[Chorus]\nI kick the bitches out\nAnd let the girls in\nYour baby daddy shouts\nYou stole my girlfriend\nYou see I’m on the prowl\nI make the world spin, round\nWelcome to the pain in my life\nYeah baby\n\n[Verse 2]\nSuicide, (huh?) trust I might\nTell 'em what my motto is fuck my life\nDon’t need alcohol to upper-cut my wife\nSo much rage I could crush my mic\nSee I woke up on the wrong side of the bed\nMy brain works but the whole left side of it is dead\nThere’s a little small gremlin inside of my head\nAnd lately I’ve been feeling like I'm living life on the edge\nBut wait a minute, this ain’t a gimmick, I can’t pretend it\nI’ma scream it loud to the world just in case they forget it\nBe careful of some of the knowledge that you take from critics\nThey tryin' to execute a nigga but I stay committed\nNew topic, mind over matter\nNever needed my arms to climb up a ladder\nYou wack niggas don’t ever show signs of a rapper\nIt's getting too serious for you? Why, what’s the matter yo?\n\n[Chorus]\nI kick the bitches out\nAnd let the girls in\nYour baby daddy shouts\nYou stole my girlfriend\nYou see I’m on the prowl\nI make the world spin, round\nWelcome to the pain in my life\nYeah baby\n\n[Verse 3]\nYeah, the black man’s back\nThere is no topic my raps can’t smash\nThe state of hip hop that can’t pass\nIt’s all full of shit like a fat man’s ass (eww)\nMay I please have just enough trust\nIn you motherfuckers to leave the rust of us stuck\nI turn my head and now you're messing stuff up\nAll that \"You! Turn it up!\" Just shut the fuck up\n(Damn) I’m rude and I'm so wicked\nI’ll make sure you never blow up\nLike a balloon with a hole in it\nI knock hustlers for a living, got muscles for the women\nGot puzzles for the children, blaow\nPlus I got a sick delivery, that’ll have you niggas shivering\nAnd stunned from bombs I drop lyrically\nYou can’t touch my shit\nSo I’ma end it just like this\nSuck my dick!\n\n[Chorus]\nI kick the bitches out\nAnd let the girls in\nYour baby daddy shouts\nYou stole my girlfriend\nYou see I’m on the prowl\nI make the world spin, round\nWelcome to the pain in my life\nYeah baby", "image": "https://images.genius.com/44b49d0de2559bbc3b7d62a3cabcc0da.1000x1000x1.jpg"}], "artist": "Hopsin"}