{"songs": [{"title": "Cherry Range", "album": "Birth of a Prince", "year": "2003-10-07", "lyrics": "[Intro: RZA]\nYeah, yo, what up yo?\nYeah, yeah, what up?\nNothin', man, hold on\nSomeone beepin' on my other line and shit\nNigga, I've seen everything I wanted to see\nCome on son, yo, in my Range Rover runnin' out this muthafucka and shit\nI be there in ninety minutes, aight, I make a stop\nAight, peace, one-one\n\n[RZA]\nI'm up in the Cherry Range, drivin' fast through heavy rains\nMy mind's on everything, my Wiz, my seed, the five pounds of weed\nMy dog got bagged with tryin' to sling in D.C\nMy cell phone rings off the hook: \"brrring!\"\n\"Kinetic 9: Yo, what's the word, king?\"\n\n[Beretta 9]\nDuckin' lights, b.s. and problems, pushin' through Holland Tunnel\nTryin' to avoid getting caught up in the funnel\n'Cuz in the jungle, sometimes you gotta rumble\nWith the, the Beez...\n\n[RZA]\n... That's why we study degrees\nAnd keep our third eye open for c-cypher punks\nWill bag you for a blunt and lock you up for a month\nYou've seen Bird? You had beef with that chump\nAnd I heard he came home from a two-year slump\n\n[Beretta 9]\nYeah, I heard, I got the pump in the trunk\nAnd when I see that crab, I'm a dump in his lump\n'Cuz niggas ain't shit but welfare cheese\n\n[RZA]\nWith their food stamp bitches and their coupon seeds\n\n[Beretta 9]\nFrontin' with their platinum like they're O's and G's\n\n[RZA]\nWhen faced with the gat, niggas pose and freeze\nAnd melt like snow on my windshield, that windmills\nIn my mind spin, they give skin chills\nYo, son, we gotta make them deals\nFor ten mill's so we can pay them bills, yo\n\n[Hook: RZA & Beretta 9]\nYou wanna eat how we wanna eat, live how we wanna live\nBe what we wanna be, give what we wanna give\nSay what we wanna say, play how we wanna play\nTeach what we wanna teach, do what we gotta do\nEat how we wanna eat, live how we wanna live\nBe what we wanna be, give what we wanna give\nSay what we wanna say, play what we wanna play\nTeach what we gotta teach, lay where we wanna lay\nDo what we gotta do, eat how we wanna eat\nLive how we gotta live, be what we wanna be\nGive what we gotta give, say what we wanna say\nPlay anywhere we play, teach where we gotta reach\nDo what we gotta do, lay where we wanna lay\nStay where we wanna stay, pay who we wanna pay\nAnd get our record played, on the radio\nAirwaves, without havin' to pay the fuckin' D.J.!\n\n[Hook 2X: Xavier Naidoo]\nSay what you wanna say, do what you wanna do\nEat how you wanna eat, be what you wanna be\nLive how you wanna live, give what you wanna give\nPlay where you wanna play, stay where you wanna stay", "image": "https://images.genius.com/0b55b2ec40b427a658f9839bb61bb1e8.600x600x1.png"}], "artist": "RZA"}