{"songs": [{"title": "Rappaz R. N. Dainja", "album": "KRS-One", "year": "1995-11-29", "lyrics": "[Scratched Hook]\n\"Rappers are in danger\"\n\n[Verse 1]\nBlast-Master Kris I don't talk ish\nExpand your consciousness and dismiss foolishness\nNo one is new to this or new to Kris\nIn hip-hop's atomic structure, I am the nucleus\nThat is the center of the group we/us\nThey/them/you, every squad, every massive, every crew\nDental floss is lost when a true rapper jumps off\nThe cash is incidental but not meant to distract you, of course\nThe style that I am kicking is like chicken\nIt will be bitten, rewritten, then performed for a $25 admission\nReviewed in The Source\nYou will listen then find something missing of course... it's skills\nThat's what you're fishing for, it's lost\nI'm getting too explicit, the track jingles\nI won't do a wack album then remix it for my single\nKicking rhymes 'til I wrinkle, and my brown eyes twinkle\nGod-core hip-hop for the nine-cinco\n\n[Scratched Hook]\n\"Rappers are in danger\"\n\n[Verse 2]\nTasty like a souflee french croissant on Tuesday\nRappers be boo-tay\nGoo-fy that's how they crew stay\nBitin' whatever you say to boost they ego\nWe know the steelo, your whole character is foul\nMakes me want to shoot a free throw, BLAOWW!\nFrom the git go, no, get go, my flow hits low\nWherever all the dope shit go, there's where my shit go\nBee-dee-bee-bo, skank, I think\nSelf with ya groups everyone else and the bank\nOthers like to bring the shottie to the party\nI bring knowledge of self, you cure the mind, you cure the body\nSome rappers like to come to the party, hopin' to leave with somebody\nCheck, I come with skills and I leave with your motherfuckin' respect\nAhh yeah... so check, UH!\n\n[Scratched Hook]\n\"Rappers are in danger\"\n\n[Verse 3]\nNew types of verbal hip-hop I bring\nWhen you know you can sing, BOY, you know you can sing\nI do not clutter up the airwaves, with stacks of useless facts\nMC's trying to be macks, but acts like ignorant blacks\nFreak that, I'll snap your back as it cracks\nYou will experience, loss or lack of balance\nStop the violence, fry from week to week like an allowance\nAll of you are cowards hiding behind the mask of MC\nI remember, thinkin back to '83\nNo video, no, you had to be a real live MC\nNow you younguns grow up buggin, any new jock you're huggin\nWeak production, let me tell you somethin\nAny MC can battle for glory\nBut to kick a dope rhyme to wake up your people's another story\nAct like you never saw me\n'Cause when it comes to lyrics, I'm in a different category\n\n[Scratched Hook]\n\"Rappers are in danger\"", "image": "https://images.genius.com/78316fa7efcf948425107910e5b3a92b.300x300x1.jpg"}], "artist": "KRS-One"}