{"songs": [{"title": "BrainStorm (L.A. Leakers Freestyle)", "album": null, "year": null, "lyrics": "[Intro: SchoolBoy Q]\n\nYo SourMilk, what up brah\nJustin Credible, I hear you on the radio every night brah\nThis one for L.A. Leakers, turn me up\nShit, nigga don't be always, rapping on nigga's shit\nThis shit too groovy though, nigga had to get some\nSmoking these Backwoods, nigga\nTouch the sky on the real nigga\nFig Side, Fig Side\nFig Side\n\n[Verse 1: Schoolboy Q]\n\nNiggas out here chasing these hoes\nMy motivation, only switching up flows, nigga\nAnd getting this dough\nStudio with just me an my weed\nCause y'all tee'd\nFronting and brown nosing while asking questions\nTrynna figure what I'm doing next\nCan't you see I'm working\nMom's sick and says she needs a surgeon\nClothes dirty, and she need detergent\nHow the fuck that suppose to make me feel?\nShit is real, I just seen Kendrick make a mil\nWithout a deal, just hard work and dedication\nAmbition, and motherfucker I can't be waiting\nYou know what I'm saying, too many options on this land\nBut y'all don't hear me though\nWent from \"Gimme\" to more than twenty racks a month\nI ain't rich, but I can stunt\nNever wear it more than once\nSmoking blunt after blunt\nEating lunch after brunch\nJoy getting bigger now, and yeah that's my nigga\nEven though sometimes, got to beat her ass\nBut she knows daddy's soft, spite she's screaming \"FUCK CRASH\"\nRidding with my baby and we screaming \"FUCK THAT\"\nMy daughter want more, so she be getting 3 a show\nSo this other bread can blow\nWhat you saving for?\nYou know?\n(And by the way sir, this Fendi shirt's a go)\nJust because there's more to it than music, you understand?\nNiggas gotta have the whole package nowadays\nGet a whip, get a chain\nLess rapping nowadays\nWhere you from? You don't bang\nNiggas actin' nowadays\nAll trappin' nowadays\nFake Luger beat, BMF'ing nowadays\nMan, you niggas are crazy\nDropped a record, got some bread, and went lazy\nAll the hoes say we wavy like the navy\nYoung dope niggas crackin' like the eighties\nFig Side, sucka niggas can't fade me\nWant the broccoli and the cheese, shit is gravy\nBucket hat made her wanna have my baby\nThoroughly popping from here to overseas\nFan feel us more cause they know we’re fucking G’s\nOn the radio, but are you buzzing? Nigga please\nJust kilt a show in Miami, let’s feel the breeze\nFollow me, I’ll show you how we feast\nHit the lab and never leave for weeks, you weak\nMust got your rhyme book at the lost and found, a clown\nHottest out\nMe, Rocky, Danny Brown\nThe crown\nMove over because you’re finished\nTDE push the limit, we locking it for a minute\nCar service take me where ever\nShe bobbin’ because it’s tinted\nFreak-a-leak, do it ‘til I skeet\nHit her with my signature at Meet and Greet\nFucking all from being me, it’s nothing though\nYou use to floss your bread, acting like you up, but now you broke\nIt’s nothing though\nShit ain’t up to par, now you wishing for a star\nHoping gotta go too far, cause he ain’t answering your goddamn calls\nBlame the jealousy come out your jaws\nYour whole project was a goddamn flaw\nYour album sales proves you’re not that hard\nYou getting crucified on these damn blogs\nCause you don’t got bars, and you don’t got heart\nAnd you got no skill\nMore on top is trash hooks, man you get that deal\nI can smell your ass from here bruh, you not that ill\nGetting stealed, they say you only talk about pills\nWeed, money, bitches, hoes, sluts, hookers and butts\nBut what about that kid on the bus\nWhen I met him, he didn’t have much\nTold me his life was on stuck, couldn’t get over that hump\nUntil my record dropped and it bumped\nTold me Blessed was his favorite one, followed by that I’m the one\nSo I dapped him and gave my nigga a hug\nHe teary-eyed, saying there shit he had to overcome\nI wish I still remember homie’s name\nI wanna know if he knew he was giving game\nGo harder in this game\n\n[Outro]\n\nYo, shout out to my nigga that was in New York, that I’m talking about\nI really ain’t got no bars, I be tellin’ niggas that\nLike, he really wasn’t on the bus, that nigga was at the show\nI just said bus ‘cause I needed to rhyme and shit\nTold you I ain’t got no bars\nBut yo, shout out to my nigga though\nReal game, nigga\nWe gonna get this shit\nFig Side, Fig Side (3x)\nSoulo next, nigga\nShit ain’t done homie\nFig Side", "image": "https://images.genius.com/e79de87534188a7a50d154e7eb1c6a42.1000x1000x1.jpg"}], "artist": "ScHoolboy Q"}