{"songs": [{"title": "Fuck Da World", "album": "Space Boogie: Smoke Oddessey", "year": "2001-07-17", "lyrics": "(Daz)\nMotherfuckers know that it's on tonight\nWe came in here to fuck it up with a shoot out or fight\nNiggas don't understand that it's on tonight\nHap hap hap it's on tonight.. Young Gotti!\n\n(Kurupt)\nTake preparation (preparation) meditation (meditation)\nConvalescent solo solo psycho store storm and store propane\nTo roll the game rearrange change rain or snow\nBut for real explain the conceptional view\nWith the exception of an exceptional feud I view\nImpose the arsonists to burn a bunch, extreme kerosene\nHelium dioxide aquanated oxide acquitted lop side\n\n(Chorus)\nBaby this is it fuck da world\nI'ma be the first nigga to fuck da world\nConverse apparel inspired by..\nFly out the barrel five out the barrel\n\n(Kurupt)\nJust take position ammunition, convalescent Converse\nWhere we at first is where we at last, where we last cash\nOne last toke will make your smoke ride high\nI'ma give everything like pushing the button\nNow how does it feel when you die for nothing?\nMetropolis crumble, apocalypse mo' lines surround and dine\nLet loose in at least a Nam, calculate keep time\nFinish the World War I've been a star\nThe knock quiminitar(?), strange and restrain\nRetired and rewired, melodically molecules\nStrategy and logic enables our positions then points us missiles\nAll sided equal... deeper than pistols\nFor instance... unknown the science of forensics\nGet your backpacked like ten sticks\nHit like ten sticks hit with the effect of tense ticks inglow(?) sticks\n\n(Chorus 2x)\n(Kurupt) Baby this is it\n\n(Daz)\nIt's on tonight\nWe came in here to fuck it up with a shootout or fight..\nBoop boop hap hap, nigga it's on tonight\nWe came in here to fuck it up with a shootout or fight\n\n(Kurupt)\nNigga you want war? Yeah right, I'm mic sky like stiletto\nHolocaust to high school, roscoe to Vasco\nImpossible lives the hospitalized\nFranchise strip niggas is broke for ranches mansions avalanches\nAlarms ring cause harm in court\nLike platinum and gold\nI've sold a whole, explosions hit explode implode\nPopped out bodies dropped off on Rider's road\nI've seen and foreseen the unseen\nAnd able hardly able to separate the myths from fables\nI'ma buy a Baltic while you purchase fireplaces\nPoisonous supply and occupy in space\nThe midnight I could hide the dark until the spark\nLight up the night nothing everything in sight\nI'ma cross the finish line with both legs broken\nFlow coke broken both toke smokin' (wha?)\nDaz dilly machine dean two shottie\nThe life of a party is a live scene\nGastra.. neo kung-fu niastra\nMonsoons swarm en route like harpoons\nYoung black Sinatra analytical ANTRA\nA million percent proof bound to found the youth\nUncrude uncoil bubble and boil turmoil\nDon't specialize and ill crack your bones\nNow fuck with that (automatic cardiac attack)\nForced to front in your chest back, (?)no raptor arab(?)\nKuruption! Yeah that's me!\nNew word to the dome, cyclone stallone\nStainless steel momomamamarron(?)\nGet done cloned and choke in stone\n\n(Chorus:2x)\n\n(Daz)\nYeah and thats how we doin this shit\nDaz Dilli, Fredwreck, Kurupt the Kingpin Young Gotti\nServin y'all suckers to one inch\nYeah fuck that oohhh!\nStraight to the dome nigga phill smoke some sit back\nFor all the real thugs out there\nMeditate penetrate on these suckers\nYeah nigga it's on tonight, fuck da world\nFuck da world.. hap hap hap hap hap yeah!\n(voice sings in background)\n(old man's voice)\nI said end of the world ha ha ha ha ha ha!!!!!!!", "image": "https://images.genius.com/32f5907a0f69c52bd9d20ec857b3f90c.944x944x1.jpg"}], "artist": "Kurupt"}