{"songs": [{"title": "Pass it Pass It", "album": "R&G (Rhythm & Gangsta): The Masterpiece", "year": "2004-11-16", "lyrics": "[Hook - Pharrell Williams] (Keyshia Cole)\nPass it, pass it - get it girl\nPass it, pass it - get it girl\nPlease don't be greedy! nooo!\nPass it, pass it - get it girl\nBreathe it in! Now let go!\n(La la la la la la la la la)\nBreathe it in! Now let go!\n(La la la la la la la la la)\n\n[Verse - Snoop Dogg]\nRoll up a fat one and pass it around\nLay back hypnotized by The Neptunes sound\nMy peoples always see me and they think I'm on point\nSo they roll me a blunt, or either pass me a joint\nI'm the modern day Rick James, yeah that's me\nAnything less than the best is blasphemy\nSo ask for me - when you wanna get spliffted\nI'm not Keith Murray but I'll Get Ya Lifted\nTerrific, cause this is just the linguistics\nThis shit's cannibalistic, so I mixed it and twisted\nWith the berries and cherries, the high berries\nThe aura is horror, man this shit is so scary!\nI took another hit and then my vision got blurry\nI had to pass this shit in a motherfucking hurry\nI'm looking at this chick, real thick, her name is Cheri\nBig fat booty and her pootie was hairy, c'mon biatch!\n\n[Hook]\n\n[Verse - Snoop Dogg]\nNick nack patty wack, give a Dogg a bone\nNaw don't gimme nothing but a handful of stones\nDon't stop! I ain't finised yet\nYou say you got the bomb? You wanna make a bet? it's on!\nI blew about three zones then took baby home\nNigga what?! Motherfucker I'm grown\nI have it how I want it, did it done it and stunted\nFronted a hundred to my nigga cause he want to get blunted\nAin't nothing to it, but to do it so I did it cause I'm wit it\nThis is the Face Off, the one hitter quitter\nIt'll lay you on your back fast, sweat start to trickle\nEverything is moving like you on a tricycle\nYou caught up in the pickle but I get you out\nI blow you a charge through your nose, not your mouth\nSlow down! ho damn! you're doing too much\nYou're supposed to take two puffs then give the shit up, c'mon!\n\n[Hook]\n\n[Verse - Snoop Dogg]\nYeah this is classic, fantastic, I'm blasted\nI've been growing and blowing, niggas wonder how I lasted\nWell, like Jesus I fasted, for 40 days and 40 nights\nI got it all mastered\nNow I need a hit of that, Neptune-ology\nGangsta philosophy, yep yep I gotta be\nReal high, whenever writing my novelty\nBecause it adds to my celebrity\nSo I celebrated, teledated, innovated, dominated\nOrchestrated, situated, petuated, reinstated\nThen I created, you're happy that I made it\nTake another hit, young nigga get faded\nWe're going all out, smoke till ya fall out\nD-O double G House all in ya mouth\nThe West got the best, the East got the peace\nI'm out and about with a blunt in my mouth, peace!\n\n[Hook]", "image": "https://images.genius.com/3ede6fe494e556f8700a77f4c132088d.600x600x1.jpg"}], "artist": "Snoop Dogg"}