{"songs": [{"title": "The Mad in the Game (Madden 2001 Theme)", "album": null, "year": null, "lyrics": "Hahhhh! Yeah!\nLadies and gentlemen, yeah! 2001!\n\n[Verse 1:]\nLook I'm better than you and I can prove it\nSet up your best defense I run through it\nCheck out the play by play with John Madden\nXzibit and EA Sports we come smashin'\nYeah! Its all in the game\nLet me explain, bringing the fame\nYou can set it off in the rain, set it off in the snow\nForth down and one to go\nRun your own franchise boilin' with Team Ecko\nI'm here for one thing to smash the other team\nBreaking you down, everything you pass is out of bounds and incomplete\nEcko unlimited athletes making you stumble and fumble\nYour offense in deep trouble\nYeah!\n\n[Hook:]\nIn that field, feel the power! (Yeah, yeah!)\nOnly thing you hittin' is the ground in the showers (Uhhh)\nPlaybook full of technique I'm playing for keeps (Yeah)\nMouthpiece, put on your pads and tighten your clets (Ahhhhhhhha!)\nIn that field, feel the power! (Yeah)\nOnly thing you hittin' is the ground in the showers (Uhhh)\nPlaybook full of technique I'm playing for keeps\nMouthpiece, put on your pads and tighten your clets (Yeah)\n\n[Verse 2:]\nCheck the stats the numbers don't lie\nYour quaterback throw lame ducks that don't fly\n22 players with a passion to play\nTop of Madden football at home always\nBrought to you live by EA Sports\nTry to rush for the first down but still fell short (Yeah!)\nYou hear the support from thousands of fans (*crowd cheering*)\nUp in the stands pushin' off Superbowl plans\nYou will contact EA Sports you realize the facts (Yeah)\nYou might have kicked it off or caught the ball and ran it back\nWelcome to the dog house you getting blown out\nAfter the game you see the Madden bus rollin' out\n[Bus driving by] Yeah!\n\n[Hook:]\nIn that field, feel the power! (Yeah!)\nOnly thing you hittin' is the ground in the showers (cmon)\nPlaybook full of technique I'm playing for keeps\nMouthpiece, put on your pads and tighten your clets (Ahhhhhhhha!)\nIn that field, feel the power! (Uhhh)\nOnly thing you hittin' is the ground in the showers (Yeah)\nPlaybook full of technique I'm playing for keeps\nMouthpiece, put on your pads and tighten your clets\nYeah", "image": "https://images.genius.com/fce1e2b08952b1596484d7ea9ce00db2.1000x1000x1.jpg"}], "artist": "Xzibit"}