{"songs": [{"title": "Party People", "album": null, "year": null, "lyrics": "[Jay-Z]\nGuess who? Uh, uh-uh uh-uh\nJigga, ya heard?\nUh-uh, a-Timbaland, ya heard?\nUh, Twista, ya heard? see'mon, see'mon\nUh-uh, uh-uh, g-ge, ge-geah\nYo.. yo.. ye-yea, ye-yea\nTurn this up.. yo, yo, yeah\n\nWhen the war's on, the pores are drawn like pictures\nThe niggas is all gone when these triggers get witcha\nNigga before long you need stitches in your longjohns\nA.K., t-t-t-t, heartbeat, t-t-t-t\nEight figures you fake twitchy niggas can't stop (that)\nJigga, Twista my nigga Timb on the hot track\nHow you gon' stop that? We can't be slowed\nNiggas (?), look at your clothes\nWhen I'm in crazy mode, three-eighty blows like\nMaceo, leave acey holes\nThat's just Jay-Z doe, crazy flow\nRhyme great, dominate your radio\nSee'mon, get your gun, your mask and gloves\nI don't ask for love, I blast 'em up\nRespect my gangsta dude, or your life's in danger dude\nDoctors pushin on your chest tryin to bring you through\n\n[Chorus: Timbaland] + (Twista)\nAll my party people gon' do what? (Gonna get buck)\nGet some liquor in the gut (So whassup?)\n(Get them lighters lit up, make them get up\nWith somethin the East and West gon' bump)\nAll my party people gon' do what? (Get crunk)\nGet some liquor in the gut (So whassup?)\n(Get them lighters lit up, T got some gangsta shit\nThat's beatin in yo' trunk)\n\n[Magoo]\nFuckin with Mag, nigga end up in a hospital\nSittin on the corner of the bed, sick cause of what I said to him\nOn a track star beef take it in the kitchen\nCookin MC's all niggas taste like chicken\nHittin 'em high, right in the ear\nSlicin on 'em muh'fucker vampire style, I'm a bloodsucker\nYou turnin into a mad ducker, tellin ya dog\nI'm at the Rucker with a bad Puerto Rican chick\nFat as my cash and she a dick sucker, get up outcha car\nYou ain't goin real far, see the chainsaw?\nBreakin the law, like turnin a dyke\nWhen it come to that man that just like Mike\nI don't care what you like, I'll make you run in outer space\nIf you go to court man, only wish you got a case\nFor real, I'm fuckin faced on a hill of ice\nMag hot now nigga 50 G's the price\n\n[Timbaland]\nTimbaland good for that - {*beat plays, he scats*}\n{*scatting*} - I invented that\nHear the hi-hat, hear the bassline on the track\nRemember \"One in a Million\" when I left ya back\nProducers sayin, \"How you get your sound like that?\"\nI don't know playa, I'm a creative cat\nGot party people dancin to dis and dat\nGot party people sayin, \"This a dope-ass track!\"\n\n[Chorus]\n[Twista]\nTimbaland hit 'em with the um, ah-um, ah-um-ahh, you gon' do what?\nStop frontin you bumpin the new cut\nLike a shoe ah, um ah-um ah, hit 'em in the gut\nTwitchin and itchin to get up, I hit 'em up\nWith some skanless to vibe to and ride to\nWith the stanky inside you - listen to while a freak lickin you\nGo on a bogus mission to, somethin you crip-walk in the kitchen to\nSomethin you bump on the porch or the park\nOr pump it while you displayin yo' heart when you flex on a mark\nYou can play it to clear your head from drama with the feds\nAnd all the homies like down for when they in the dark\nUsed to rock up at the block club, players wasn't ridin slick\nYou can let your mind cruise for miles\nThey can't tell no sucker who's allowed, with a strap on the mic\nI'm thinkin how can I move the crowd, move the crowd\n\n[Chorus] - repeat 2X\n[Timbaland]\n.. bounce wit me, bounce wit me, bounce, ow ow ow\nOw ow ow-ow ah, shake wit me, shake wit me, shake wit me, shake..\n.. bounce wit me, bounce wit me..\nShake wit me, shake wit me\nOw, one time, bounce wit me, bounce wit me\nYo, ahh\n\nRemember when you first found me?\nI was workin at Burger King\nNow take a good look around me\nLook at all these cars, look at all these girls\nWhy you always tryin to put down me?\nWhy you always tryin to put down me?\nYou get 'round your friends and try to clown me\nWhy you always tryin to pull that boo-boo?\nI'm gettin tired of all that bullshit\nAlways talkin dis and dat\nYour girls screamin, \"We looove him!\"\nSee girls, they LOVE me\nGirl that's just, only Tim\nYes, it's only Tim\nWhatchu talkin 'bout that's only Tim?\nYeah whatchu talkin 'bout that's only Tim?\nCause\n\n[Timbaland: repeat 2X]\nI made it this far (this far)\nMade it without yo' money (yo' money)\nMade it without yo' car (yo' car)\nMade it without yo' naggin (what?)\nNow look who's the star (whoo!)\n\n[Timbaland]\nYaknowhatI'msayin?\nWhy it gotta happen to people like me, I don't get it\nI don't understand it\nThat's why people like myself, only hang with self\nHahaha, and nobody else\nEasy now", "image": "https://images.genius.com/f832da8d956be1aa5e9a0ec763dcd481.716x716x1.jpg"}], "artist": "Twista"}