{"songs": [{"title": "Birds of a Feather", "album": "World War 3, Vol. 1: Lean", "year": "2013-01-04", "lyrics": "[Intro:Gucci Mane]\nHuh\nBirds of a feather,it's Guwop!\nChyeah, huh\nI got my nigga Rock with me, shit is epic\nOn 13 shit\n\n[Verse 1: Gucci Mane]\nI fuck with Rocko cuz he's a hustling motherfucker(A1)\nYou know I fuck with Flocka cuz he's a crazy motherfucker(BSM)\nYou know I fuck with Scooter, he's a robbin' motherfucker(BMG)\nI used to fuck with Gotti till he turned into a buster (fuck em)\nI did a song with T.I. but the nigga still a sucker\n4Tre got locked up taking some bricks down to Augusta\nYou know I fuck with Hot but he's a shysty motherfucker\nYou know I fuck with Mojo, he's a hustling motherfucker\nIn nineteen ninety seven I was a petty motherfucker\nTwo thousand seven, I was trappin' heavy on Custer\nI did a song with Keyshia Cole, I wish I woulda fucked her\nI miss that girl Misha, she was a fine motherfucker\nI used to fuck with Keyshia Dior and I still kinda love her\nI wish that I could fuck her now cuz my mind in the gutter\nYou know I fuck with P and Buck, I'm they fucking third brother\nThe nigga killed Dunk get out, I'll be a locked up motherfucker\n\n[Hook]\nMost of these niggas, half of these hoes\nA couple of my pistols, fuck all of my foes\nA few more swishers, a couple more M's\nI'm tryna get richer and free all of my niggas\n\n(2x)\nI need all of mine, nigga\nAll of my niggas\nIm trying to get richer to free to free all of my nigga\n\n[Verse 2]\nShout out that nigga Meech, he's a loyal motherfucker(BMF)\nI got no respect for Jeezy, he wouldn't even buy a lawyer\nYeah I respect Big Cat but he's a dirty motherfucker\nI still fuck with Coach K but he's a nerdy motherfucker\nYou know I signed Young Dolph, he's a juggin motherfucker\nBut I still say that Project Pat is my favorite rapper\nFree my nigga Boosie, he's a gangsta motherfucker\nFree my nigga B.G., he's a gangsta motherfucker\nR.I.P. to Soulja Slim, I miss that motherfucker\nR.I.P. to Pimp C, cuz I miss that motherfucker\nWhen I lost Dunk, it's like I lost my own brother\nR.I.P. my grandaddy and I lost my grandmother\nWell, ever since I had my son I never fucked my baby mother\nAnd every bitch in the industry want to be my baby mother\nMy nigga says he loves his girl, but I just seen her with Usher\nA nigga rob me in ninety six, when he get out I'mma touch him\n\n[Hook]", "image": "https://images.genius.com/2363c8d759c5b9334226a57823c9c00e.894x896x1.jpg"}], "artist": "Gucci Mane"}