{"songs": [{"title": "If They Knew", "album": "Hood Billionaire", "year": "2014-10-30", "lyrics": "[Pre-Chorus: K. Michelle]\nThis is so all bad, nothin' good can come from this\nSweet but sad, I don't know love ruins a relationship\nIt will never last but it feels so good, guess I gotta deal with it\nThis is so all bad, this is so all bad\n\n[Chorus: K. Michelle]\nGot me messin' 'round with you\nYou got me messin' 'round with you\nOut here messin' 'round with you\nWhat you gon' say? What you gon' do?\nBaby if they knew?\n\n[Verse 1: Rick Ross]\nI'm a G, she say the pain runs deep\nBut she can't run from me\nI'm in these streets with the killers, thugs, and drug dealers\n100 mil' plus, in trucks with no ceilings\nFuck who don't feel it, I'm feelin' like I'm the realest\nBiggest boss in the business and really that's to infinite\nWhat we doin' wrong but it feels right\nCan't discuss what we did the whole night\nWon't be the last time, on my cash line\nDuffel bags so accountant is the past time\nAnd for the last time, I'm not a bad guy\nI just like what I like, now shorty act right\nSmall waist, red weaves\nBlack car, keep it flyer than them Red Wings\nNightmares, daydreams​\nShe the one, listen how she say things\n\n[Pre-Chorus: K. Michelle]\nThis is so all bad, nothin' good can come from this\nSweet but sad, I don't know love ruins a relationship\nIt will never last but it feels so good, guess I gotta deal with it\nThis is so all bad, this is so all bad\n\n[Chorus: K. Michelle]\nGot me messin' 'round with you\nYou got me messin' 'round with you\nOut here messin' 'round with you\nWhat you gon' say? What you gon' do?\nBaby if they knew?\n\n[Verse 2: Rick Ross]\nShe in love with the life, champagne and all the lights\nChanel sneakers and scarves, I want you to be my wife\nWe can run around the world and tuck with no fear\nG4, G5, whole team here\nCall ourselves friends, but we holdin' hands\nGot alot of questions, am I a controllin' man?\nI run the streets but I'm well known in Japan\nAs a G, a boss, the money coming fast\nShe from a lovin' home, I'm from a troubled home\nOne bedroom, didn't have a telephone\nNow I'm on the corner, time to get my hustle on\nWomen recognize, and now I got a couple of 'em\nSpeedin' in the Beemer then I got a Range\nShe not a side chick, she all in my lane\nShe a quiet chick, may let her see some things\nI'm catchin' feelin's for her, she take away the pain\n\n[Chorus: K. Michelle]\nGot me messin' 'round with you\nYou got me messin' 'round with you\nOut here messin' 'round with you\nWhat you gon' say? What you gon' do?\nBaby if they knew?\n\n[Verse 3: Rick Ross]\nLife amazin', wake up in new places\nBig faces stuffed in suitcases\nPlayed the hand I was dealt, few aces\nNow the bedroom suite is too spacious\nNiggas wanna kill me but I put 'em on pause\nBroke motherfuckers better bow to the boss\nI'm gettin' high, I'm above the law\nGettin' down and dirty, makin' love to her\nPlease believe in niggas that's still schemin'\nBut the ghost that floats the 4 Seasons\nTo love me baby is too easy\nBut what I need you to do is just believe me\nShe got the Range Rover, I was cool with it\nBeen the land, cruisin' girl I went to school in it\nGreen Goyard bag, it got the tool in it\nEvery time we fuck, I act a fool in it\n\n[Chorus: K. Michelle]\nGot me messin' 'round with you\nYou got me messin' 'round with you\nOut here messin' 'round with you\nWhat you gon' say? What you gon' do?\nBaby if they knew? (Ooh)\n\n[Outro: K. Michelle]\nBaby if they knew? (Ooh)", "image": "https://images.rapgenius.com/c407b78e95cc59f4cef6dc44e2ec70bd.500x500x1.jpg"}], "artist": "Rick Ross"}