{"songs": [{"title": "The Art of It", "album": "The Lost Tapes 2", "year": "2019-07-19", "lyrics": "[Verse 1: Nas]\nFire spitter, I ain't never met a higher nigga\nMe extinguished is like Queensbridge fiendless\nMansion, marble foyer\nI can afford a closet in alphabet order\nA life, Adidas under A, the B for beater, Bottega\nBritish Knights sneaker, my C so ill\nThat, man, I get chills when I look at my Christian Diors, they kill\nD is for Dries Van Noten\nYoung niggas try to keep up with what I'm doing\nD cups, tequila and blunts\nWeed, women, and liquor\nDepending on the day is a different mission\nThey not knowing, they wanna know what he got on\nThe QB Don went and got his Pete Rock on\nNas keep a fine bitch to roll his weed up for him\nMy niggas in Mount Vernon keep it G'd up for him\nSpeaking of G, the gat I'm good with it, hit your hood with it\n.44s never could miss him, coming to see us\nGlad to see you made it home to the hood, nigga\nWe blowing trees, tell me, don't it feel good, nigga?\n\n[Chorus: J. Myers]\nDamn it feels good, it feels good don't it?\nLa-la-la\nPut that good shit in the air (Yeah)\nLa-la-la\nNiggas in the hood don't live forever (My G niggas)\nAs long as we together (My QB niggas)\nWe gon' put that good shit in the air (Yeah)\nLa-la-la\n\n[Verse 2: Nas]\nAnother bullet manufactured, another man in his casket\nFuck maintaining, that's lame language\nDust to dust, ashes to ashes, I duck quick\nSeen fire flashes, the type of fire that spit out a magnum\nAnd I'm the type who runs to the drama looking for who clapping\nNike boot, what I eat him, he like food\nPulled out the barrel\nFour-fifths rip through bone marrow\nMake his toes spiral the dirt\nWhile his feet kick up rock, he's a sprinter\nPolice agenda, lock up niggas for three winters\nWhen I attack I'm faceless like a iron mask\nThey get away quick, traceless, lying back, liars pass\nI breathe deep like Lamaze class\nLive young, obtain wisdom, and die last\nStretched out or in a body bag, I ain't that\nLive young, obtain wisdom, and die last\n\n[Chorus: J. Myers]\nDamn it feels good, it feels good don't it?\nLa-la-la\nPut that good shit in the air (Yeah)\nLa-la-la\nNiggas in the hood don't live forever (My G niggas)\nAs long as we together (My QB niggas)\nWe gon' put that good shit in the air (Yeah)\nLa-la-la\n\n[Verse 3: Nas]\nLook, I don't have that much time, candidly, I'm in divorce\nRumors, DUIs, in and out of court\nDifferent judges, assault charges hovers on your boy\nOther niggas' wives lust to be under covers with your boy\nY'all don't want an angry Nas on your label\nY'all got plenty checks, CEO, man\nI'm only 36 but if it's— point five on the table\nI say with all respect my dude\nThank you, we had the best times but I'm about respect, I'm about the talent I possess\nNever know, there could just be a time when I'm behind your desk then let you go\nCould you imagine Nas the exec?\nThe artist on the masters controlling your release\nProbably they wanna wait 'til I'm deceased to honor me\nSo my product'll be a big commodity\nNot bothered if my son and daughter eat off of me\nCautiously I write this next line honestly 'cause I'm a G, there's no beef\nI used to open off making fifty G's\nBut now I spend that on a diamond to make her neck freeze\nMy larynx'll serenade the hood\nI tell the cops my blood dirty, they say I'm all good\nTMZ, they hoping when the marriage end I'ma turn to Larry Flynt\nNas is not the average gent, I'm on my classy shit\nHere's one small percent of what y'all in store to get\nMore real nigga shit\n\n[Chorus: J. Myers]\nDamn it feels good, it feels good don't it?\nLa-la-la\nPut that good shit in the air (Yeah)\nLa-la-la\nNiggas in the hood don't live forever (My G niggas)\nAs long as we together (My QB niggas)\nWe gon' put that good shit in the air (Yeah)\nLa-la-la", "image": "https://images.genius.com/91da51c7ed14c805c492a0346f54d465.1000x1000x1.jpg"}], "artist": "Nas"}