{"songs": [{"title": "Where Are They Now? (West Coast Remix)", "album": null, "year": null, "lyrics": "[Intro]\nThis is a Core DJ Exclusive....\n\n[Nas]\nAyo, check it out, this is Nas\nIs Hip-Hop dead or is it still alive? Ha ha\nWell, check it out\nRight about now, I'm ridin' with my homies from the Westside\n(West Coast)\nShowin' love\n(West Coast)\nI asked where are they now?\n(West Coast)\n2007, they right here, yeah\n(Where are they now?)\n\n[Breeze]\nYo, it's time to rhyme, keep it in mind, I'm gifted\nWith the strength to go the length, and if it’s\nRough enough to keep the crowd wonderin'\nBreeze and L.A. Posse (Where are they now?)\nStill layin' in the land of the palm trees\nWarm breeze, sippin' on Dom P, still chillin' with King T\nSlowed on MCin’, pass the series green\nGettin' money off the words I spit, yet still gee-in'\nStill the young son but now a nigga got a baby girl\nTryin’ to raise her right and guide her through this crazy world\nStill got a slow flow and fast raps know\nReppin' twenty years, still gettin' ASCAP checks\nStill, spittin' the truth when I mentor the youth\nOn how to be professional when they step in the booth\nAnd never cuppin' the mic so you can hear me clear\nNas wondered, yo, where are they now?\nI'm right here, G\n\n[KAM]\nGoddamn, that nigga KAM back on the scene\nWith the O.G. West on the same team\nHittin' corners in a Six-Trey Chevrolet\nRagtop Impala, gettin' dollars every day\nFor pushin' heavy yay to this rap shit\nFuckin' with niggas I done put L.A. on the map wit’\nSo that the legacy lasts long\nWe're givin' it up for all the homies that done passed on\nAnd you can check Bobcat’s file\nHe can tell you who we are, what we did and where we at now\nThis bullshit, niggas tired of that\nFools runnin' they mouth, so where the Southside riders at?\n\n[Hook: Breeze, KAM, Nas, King T]\nEverybody’s talkin' about the South and the East Coast\nBut what about the West Coast?\n(West Coast)\nEverybody talkin' about this South and the East Coast\nBut what about the West Coast?\nWest Coast, yeah, Nas's ridin' with you right here\n(The who?)\nWest Coast\n\n[King T]\nHey, watch it resurrect from the jump\nHouse shoes, Khaki suit, riot gauge pump\nBlack Raider hat with ‘Bitch Please’ on the side\nCentral and Greenleaf, 1989\nJust in time, King T pushed the line\nThe G's had to have it, Eazy and Dre had it\nI was a damn fool, now dudes wanna act it\n(Where are they now?) He's still active\nWe go back like the Jheri Curl shag\nWhen Pooh was from the Gate, Bobcat was from the Aves\nI was in that green 6-4 with the rag pull back in slow motion\nT-La showboatin'\nThey lookin' for that West Coast Trojan\nThought to be in exile but I'm just posted\nBlessed to be the best to crack the West Coast open\nKing T-La back, muthafucka, it's a wrap\n\n[Candyman]\nThe C-A- to the N-D-Y-The-M-A-N\nI still melt in your mouth, not in your hand\nI love to hear the story, again and again\nBut it originated from this man, The Candyman\nDamn, it feels good to hear my West Coast peers\nMakes me wanna shed a tear for the ones who ain't here\nI was just a young player in these Westside streets\nMotivated to be innovative like Ice-T\nKing T, Toddy Tee\nR.I.P. to Mixmaster Spade, MC Trouble, Rudy Pardee\nAnd it's a trip to witness trap rap\nWhen I’m on the first album cover with Eazy-E doin' that shit way back\nHell yeah, we need a new West, Dirty South respects\nI remember doin' shows out there\nThey never tripped off the Westside\nSpend all their chips at the Best Buy\nGroovin' like they just don't care\n\n[Threat]\nNo mistakes, can’t get away\nDumpin' with them funky rhymes\nYep, that's MC Deadly Threat\nThey play him on the radio all the time\nI love my folks, I love my G's\nThey can't kill Cali, they love my weed\nWest Coast done it, East Coast did it\nThen the South came wit’ it like ‘let's go get it’\nRed Ghost did it like the ones before me\nThe batterram came and took all the glory\nI got an Army like Uncle Jamm’s\nK-D-A-Y bumped the jam\nBobcat, Battlecat and DJ Pooh\nL.A., S.C., but we say Zuu\nIt still never rain or snow in Cali\nWe're gettin' blunted in the back of the bowling alley, like..\n\n[Hook: Breeze, KAM]\nEverybody’s talkin' about the South and the East Coast\nBut what about the West Coast?\n(West Coast)\nEverybody talkin' about the South and the East Coast\nBut what about the West Coast?\nWhere are they now?\n\n[Ice-T]\nThis is it, dope from the fly kid\nIceberg bang for the West, servin' a life bid\nWestside nigga for life, ride or die\nI get so gangsta, I stay so fly\nSaggin' my Khakis, reppin' my flag\nNigga, break out the gun, bitch, let's play tag\nEvery day in the street, somebody calls me Cube\nI tell ‘em that's my loved one, but it’s Ice-T, dude\nI come from that Crenshaw strip, ya heard?\nIt’s way Cripped up, chrome when the 6-4 lift up\nIt's hard to rock a party, L.A. don't like nobody\nNiggas rather pop the trunks and dump shotties\n\n[Sir Mix-A-Lot]\nI'mma show my nigga Nas what I got in my garage\nYeah, my publishin' is large, water fountains in my yard\nThe Posse left Broadway to get ‘em on the glass\nI got class, but still I like a fat ass\nMix-A-Lot sheenin' with this S-Class gleamin'\nAggressive pimp leanin’, marked the game like a demon\nFrom TVs to movies, Hollywood use my shit\nSeven-figure years keep comin’. Who's your pimp?\nF430 with these black paddle shifters\nThis may not uplift ya but I'm still takin' pictures\nAnd I'm lovin' all you sisters, Mix'll never disrespect ya\nWestside vet; you need your paper? I'll connect ya\n\n[Hook: CMG from The Conscious Daughters]\nEverybody’s talkin' about the South and the East Coast\nBut what about the West Coast?\n(West Coast)\nEverybody is talkin' about the South and the East Coast\nBut what about the West Coast?\n(The who?)\nThe West Coast\n\n[CMG from The Conscious Daughters]\nIt's the rhyme-spittin' kitten you’re never hittin’\nThe legendary, all-time great phenomenal female\nMonarch, hittin' charts\nFlowamatic nine spitta shoot like darts, blowin' bitches apart\nIt's The Conscious Daughters, still stompin' over soil\nHolla at your folks, the females is royal\nBay Area OGs, still gettin' cheese\nLike we sidin' on the block with 'Pac and Eazy-E", "image": "https://images.genius.com/23061dd2dc7e863127db561906debd27.434x434x1.jpg"}], "artist": "Nas"}