{"songs": [{"title": "Mad Crew", "album": "Return of the Boom Bap", "year": "1993-09-28", "lyrics": "[Intro]\nBuck buck buck buck booyakasha!\nOf course all the hardcore heads\nThis one goes out to you\nCrank up the volume one time\nPeace to all the real DJs out there\nCause I don't send my music to no garbage DJs\nThey get me (mad)\nSo in the clubs I get (mad)\nOn the mic I get (mad)\nOn the beats I get (mad)\n\n[Hook]\nYo, I got the\n(Mad, mad crew up in the house)\nI'm with the\n(Mad, mad crew up in the house)\nI be chillin' with the\n(Mad, mad crew up in the house)\nI'm rollin' with the\n(Mad, mad crew up in the house)\n\n[Verse 1]\nSee, this is what I'm sayin' and I know you don't see this\nWack, underpriveledged MCs think they can see Kris\nThey watchin' too much television and they rocka\nThis ain't the TV show \"Taxi,\" and I ain't Lotka\nI break an MC off proper, yo don't check me\nAsk your Moms and Pops, yo they respect me\nBut here you stand, tryin' to get yours, but gettin' NOTHIN'\nYou probably can't spell \"Boogie Down\" or \"Productions\"\nI play for jeeps, I play for keeps, I play for streets, believe me\nPut down the microphone and consider a squeegee\nYou're rated PG\nAgain I win when I begin\nI'm slammin' again, no win, try to comprehend\nI don't bend\nI ravage and damage\nI'm wild like a savage, kickin' asses\nHot flashes, your style's with trash's\nStay out of my classes, punk\nStay out of my classes, yo\n\n[Hook]\n\n[Verse 2]\nTwinkle, twinkle to the little rap star\nI got all type of MC tongue in a pickle jar\nSo here's a quick freestyle to my target:\nMy core audience, *fuck* the rest of the market!\nCause I spark it, styles I loanshark it\nThen break your legs if you try to chart it\nI got heart, it\nDoesn't take a lot to rock a record, get wit it\nSome MCs can't rock for five minutes\nSorry, that's not the way to approach me\nUse caution\nI rip up lyrical crews and MCs often\nYou probably don't know this:\nI give birth to MCs\nAnd I also give abortions\nI'll do a number to your body structure\nYou look like supper\nAnd I'm that hungry motherfucker!\nYou don't wanna be on the menu!\nI'll end you, twist you up and bend you\nLike Gestapo\nPick up the microphone and crush up MC like a taco\nNo, we're never sad because we nah deal with sorrow\nThat's why dem challenge me, jah man you know dem challenge trouble\nMe are number one of me there is no double!\nAnd you don't want no trouble\nCause Blastmaster KRS is flashin' lyrics on the double\n\n[Hook]\n\n[Verse 3]\nCheck\nMe comin' on quick, me comin' a dance, now me a sing\nKRS-One in a party, man me do me own ting\nNuff MC test, but you don't hear vowel one\nAll you hear is when the BDP crew slap them up\nWe have the champion belt and lyrical cup\nAny DJ they want my title filled, no way now man step up\nBut when you lose, now understand you get fucked up\nThis ain't no game upon the mic\nMe bring the noise to you like Chuck\n\n[Hook]\n\n[Hook 2]\nKid Capri got the\n(Mad, mad crew up in the house)\nGang Starr got the\n(Mad, mad crew up in the house)\nIll Will got the\n(Mad, mad crew up in the house)\nFlavor Unit got the\n(Mad, mad crew up in the house)\nCheck it out!\n\n[Outro]\n(Make some noise!)\nBig shout out to all the real hip-hoppers in the house!\nAnd to all the phony DJ's that tried to battle BDP this year...\nUnderstand I got the\n(Mad, mad crew up in the house)", "image": "https://images.genius.com/2573d3afb044969d03669dee90d609f7.1000x1000x1.jpg"}], "artist": "KRS-One"}