{"songs": [{"title": "Seven Words", "album": "Killer", "year": "2008-07-01", "lyrics": "[Intro]\nWelcome to The Sextion, where it's all about sex\nIf horny is what you're looking for, well this is the place\nThe Sextion\nNow, for your listening pleasure\nThis is Tech N9ne, Skatterman and Krizz Kaliko with seven words\nHow many words?\n\"One, two, three, four, five, six, seven\"\n\n[Hook: Krizz Kaliko]\nIt's seven words I wanna say to you\n\"Love it when you suck my dick\"\nIt's the best thing in my world\nIt's seven words I wanna say to you\n\"Love it when you suck my dick\"\nGirl, it's why I'm giving you seven words\n\n[Verse 1: Tech N9ne]\nYou should look at this as a wonderful endeavour\nThe pleasure of having a bitch go below the belt for treasure\nNo pressure, I know you shy and I ain't tryna stress ya\nCan I undress ya? And get ya to swallow each and every measure?\nDamn! You put the \"whore\" in hormones, I might just bust before long\nLet's take a pic in your phone of you taking more and more dome\nDo it but don't pinch me, don't chew it when you think me\nGet fluid then you sink me, 'cause you got to/two it just like pinky\nI really love it when you put the hot water in your mouth\nSlurping and slobbering about, now it gets hotter in the south\nYep, the water was blazing, it was amazing\nAnd now my dick is shriveled up like a raisin'\nYou love my leg in third, 'cause I'm blessed with heaven's curve\nAnd I equal the thrill and rush of having sex on X and herb\nNever get the lesson blurred, I'd like to rest in her\nBut not before I issue baby doll my seven words\n\n[Hook: Krizz Kaliko]\nIt's seven words I wanna say to you\n\"Love it when you suck my dick\"\nIt's the best thing in my world\nIt's seven words I wanna say to you\n\"Love it when you suck my dick\"\nGirl, it's why I'm giving you seven words\n\n[Verse 2: Skatterman]\nFor the sake of argument, let's say we call her \"Ol' Girl\"\nShe had the type of lips to make this street nigga's toes curl\nIt's her world, all I do is kick back, just sit back\nShe let my zipper down and pulled the head out and licked that\nShe licked that, sometimes I had to fight to get my dick back\nBut baby moved to Minnesota, swear to God I miss that\nThe way she used to grab and smack herself all in the face with it\nLooking at me dead in my eyes while she be tasting it (tasting it)\nShe used to say \"Daddy, you wasting it\" (wasting it)\nI used to say \"Baby, I'm pacing it\"\nBut fuck the hot water shit, she used that crushed ice (crushed ice)\nIf she sucked your dick once she make you nut twice (nut twice)\nShe was just that good\nI could sell her for a stack to my boys in the hood\nSo if you got you one of these, keep them faking bitches to the curb\nLeave this on her voicemail, all you need is seven words\n\n[Bridge: Krizz Kaliko]\nNow as she sucks my soul, I lick her funky emotions\nPiercing all the way into her mind so I can feel what she's thinking\nFeel me? I know you do\nWe're getting closer and closer, eruption is imminent\nClimax is closing in on us\nIf you don't get your hands on me soon, I might disappear\nHere is what I been waiting on, the best thing you ever heard\nThe one, two, three, four, five, six, seven words\n\n[Hook: Krizz Kaliko]\nIt's seven words I wanna say to you\n\"Love it when you suck my dick\"\nIt's the best thing in my world\nIt's seven words I wanna say to you\n\"Love it when you suck my dick\"\nGirl, it's why I'm giving you seven words\n\n[Outro: Tech N9ne + (Female)]\nMmm, mmm, you know what I want you to do, right?\n(Yeah, I know what you want me to do)\nWhat's that?\n(Do you want it with hot water?)\nWhat's that?\n(You mean to tell me freaky ass Tech N9ne ain't never had it with no hot water?)\nNah, show me\n(Hold up a second)\nWhat the fuck?\n(And then you do it like that)\nOK, go ahead... ahh shit, fuck, that's wonderful!\n(That's what I thought)", "image": "https://images.genius.com/ce6124bde0d76994fd0d3a8ddb1d4e97.1000x994x1.jpg"}], "artist": "Tech N9ne"}