{"songs": [{"title": "Once Upon a Time in the Projects 2", "album": "War & Peace Vol. 1 (The War Disc)", "year": "1998-11-17", "lyrics": "Once upon a time in the projects yo\nI damn near had to wreck a ho\nYellin through the screen do' (HEY, let me in!)\n(Big Daddy got a fifth of gin, and down to sin)\nBaby up in two-ten, is on a nigga\nBendin over pickin up her mail, she can tell I'm dyin to get her\nI'm sittin in yo' livin room, slash kitchen\nA nigga ain't tryin to be the fuckin groom so stop bitchin\n*knock knock knock* I like the way that ass is switchin, answer the do'\nSome nigga in a eighty-kay, yo' baby daddy\nLookin like he mad at me (what) wit'cho name on his neck\nHere we go with mo' drama in the projects\n\nWait a minute, who is this motherfucker?\n\nYou better take his ass in the back, and start talkin\nNick that bud 'fore it bloom, and start stalkin\nI can hear you guys yellin *glass breaks* a little strugglin\nYouse a FOOL if you think that I'm jumpin in\nThat nigga jet, smokin on a ciggarette\nYou say domestic shit, get you soakin wet?\nWell come widdit and get it, blow my socks\nWhile I'm drinkin all the Kool-Aid, watchin Jamie Foxx\nI'm hearin mo' knocks *knock knock knock*\n(Oh, that's just my people\nThey came all the way to the projects to meet you) Who?\nThis fool wearin black, his girl, in the see through\nDistraction, a little action, *fight ensues* I woke up\nTied up like (What happened? Punk you shoulda stuck to rappin\nNiggas tell me you got a house full of platinum..\nWhere the platinum at motherfucker?\nI hear that shit worth more than gold!)\n\nWait a minute motherfucker, this my house!\n\nOnce upon a time in the projects (3X)\nOnce upon a time, once upon a time\n\nI'm like baffled, they got me gaffled, with the duct tape\nSo I remain raw, in come this chainsaw *knock knock knock*\nAnother knock, it's the girl from two-ten\nHere to drop salt, that's when them bitches fought\nI thought, \"I bet-ta plan my escape\"\nIn the midst of this commotion, Ice Cube is breakin tape\nI'm free, bombin on the first thing I see\nAnd guess who walk in, with a nine, and a grin\nIt's the baby daddy he ain't playin, *gunshots*\nHe started layin everybody down, about face with a frown\nI'm runnin to the bedroom, I lock the do'\nAnd grab the phone, the bitch phone ain't turned on\nI think I'm gone, that's when I hear a soft knock\nIt's the girl from two-ten, with her number, and a Glock\nSaid, \"Call me up, if it's for sex, or chin check\nNigga get you a real ass bitch from the projects!\"\n\nAnd I just might do that\n\nOnce upon a time in the projects (3X)\nOnce upon a time, once upon a time", "image": "https://images.genius.com/9a92bffe36c691d91a9dd7116941cd17.1000x1000x1.jpg"}], "artist": "Ice Cube"}