{"songs": [{"title": "Ready To Die (Bridgeport Sample Removed)", "album": "Ready To Die - The Remaster", "year": null, "lyrics": "[Intro: Puff Daddy & The Notorious B.I.G.]\nYeah, yeah\nYou ready, motherfucker? (You ready, motherfucker? Uh, uh)\nWe gon' kill your ass (Kill your ass)\nI'm ready\n\n[Verse 1: The Notorious B.I.G. & Puff Daddy]\nAs I grab the Glock, put it to your headpiece\nOne in the chamber, the safety is off release\nStraight at your dome, holmes, I wanna see cabbage\nBiggie Smalls the savage, doing your brain cells much damage (Uh)\nTeflon is the material for the imperial\nMic ripper, girl stripper, the Henny sipper\nI drop lyrics off and on like a light switch\nQuick to grab the right bitch and make her drive the Q (Uh-huh)\n45, Glocks and TECs are expected when I wreck shit\nRespect is collected, so check it\nI got techniques dripping out my butt cheeks\nSleep on my stomach so I don't fuck up my sheets, huh (Ha)\nMy shit is deep, deeper than my grave, G\nI'm ready to die and nobody can save me\nFuck the world, fuck my moms and my girl\nMy life is played out like a Jheri curl, I'm ready to die\n\n[Chorus]\nYes, I'm ready\nYes, I'm ready\nYes, I'm ready\nSo die motherfuckers, die motherfuckers, die\n\n[Verse 2: The Notorious B.I.G. & Puff Daddy]\nAs I sit back and look when I used to be a crook (Yeah)\nDoing whatever it took from snatching chains to pocketbooks (Uh-huh)\nA big bad motherfucker on the wrong road\nI got some drugs, tried to get the avenue sewed\nI want it all from the Rolexes to the Lexus\nGetting paid is all I expected\nMy mother didn't give me what I want, what the fuck?\nNow I've got a Glock making motherfuckers duck\nShit is real and hungry's how I feel\nI rob and steal because that money got that whip appeal (Okay)\nKicking niggas down the steps just for rep\nAny repercussion lead to niggas getting wet\nThe infrared's at your head real steady\nYou better grab your guns 'cause I'm ready\n\n[Chorus: The Notorious B.I.G. & Puff Daddy]\nYes, I'm ready\nYes, I'm ready\nI'm ready to die\nYes, I'm ready\nNah, we ain't gonna kill your ass yet\nSo die motherfuckers, die motherfuckers, die\nWe gon' make you suffer\n\n[Verse 3: The Notorious B.I.G. & Puff Daddy]\nIn a sec I throw the TEC to your fucking neck\nEverybody hit the deck, Biggie 'bout to get some wreck (Yeah)\nQuick to leave you in a coffin for slick talkin'\nYou better act like CeCe and keep on walkin'\nWhen I hit ya, I split ya to the white meat\nYou swung a left, you swung a right, you fell to the concrete\nYour face, my feet, they meet with stompin' (Uh-huh, uh-huh)\nI'm rippin' MCs from Tallahassee to Compton\nBiggie Smalls on a higher plane, niggas say I'm strange\nDeranged because I put the 12 gauge to your brain (That's right)\nMake your shit splatter\nMix the blood like batter then my pocket gets fatter\nAfter the hit, leave you on the street with your neck slit\nDown your backbone to where your motherfucking shit drip (Woo)\nThe shit I kick, rippin' through the vest\nBiggie Smalls passing any test, I'm ready to die\n\n[Chorus: The Notorious B.I.G. & Puff Daddy]\nYes, I'm ready\nYes, I'm ready\nI'm ready\nYes, I'm ready\nTime to go, we gon put you out your misery motherfucker\nNiggas definitely know what time it is\nYes, I'm ready\nThe Notorious one in full effect for '93 (Yeah)\nYes, I'm ready\nUhh, uhh\nYes, I'm ready\nSo die motherfuckers, die motherfuckers, die\nSuicidal, I'm ready\nYes, I'm ready\nUh\nSo die motherfuckers, die motherfuckers, die\nUh, uh, uh\n\n[Outro: Puff Daddy & The Notorious B.I.G.]\nNow I lay me down to sleep (Yeah)\nPray the Lord my soul to keep\nIf I should die before I wake\nI pray the Lord my soul to take\n'Cause I'm ready to die\nI'm ready\nI'm ready\nAll y'all motherfuckers come with me if you want to, haha\nI'm ready\nI'm ready\nI'm ready\nBiggie Smalls the biggest man\nI'm ready\nRocking on and on in '93\nEasy Mo Bee\nThird Eye and the rest of the Bad Boy fam\nI don't wanna see no crying at my funeral", "image": "https://images.genius.com/aefdcd2cc93e4ba4044a75264a1a129f.499x499x1.jpg"}], "artist": "The Notorious B.I.G."}