{"songs": [{"title": "Mr. President", "album": "Exit 13", "year": "2008-09-05", "lyrics": "[LL Cool J - Verse 1]\nDear Mr. President, with all due respect\nWish we could have a conversation\nI would take a trip down to your residence\nAnd we would talk about the state of the nation\nMr. President, I would ask you about the war\nReally and truly, what is it for?\nWhen a I.E.D. make a soldier fall\nIs he dying for something above us all?\nIs it all about him at the end of the day\nIs a pledge of allegiance just something to say\nI hope not, cuz I love the U.S.A\nDespite of all the drama we have today\nMr. President are you aware?\nOur flesh and blood is dying over there\nWhen the coffins come back, do you care?\nWhen only the poor kids die, is it fair?\n\n[Hook: Wyclef Jean]\nIf I could talk to the President\nWould he pay attention, really listen?\nIf I could talk real intelligent\nWould he beware and then change his position?\nNow is time, time, time\nFor me to speak my mind, mind, mind\n\n[LL Cool J]\nDon't get me wrong, I respect the flag\nBut it hurt to see a kid in a body bag\nHe fought for his country with all he had\nNow he have a family without a dad\nWith a mama crying, the kids is scared\n9/11, why were we unprepared?\nMr. President, are you aware?\nUnless you rich you have poor health care\nMakes you scream and wanna pull out your hair\nDischarged from hospitals as soon as you get there\nMr. President, truth or dare\nTerrorists are hiding, and you know where\nIllegal immigrants are everywhere\nIs it really their fault, they wanted to come here\nI respect you, please be clear\nBut talk with me, show the people you care\n\n[Hook]\n\n[Wyclef Jean]\nWhat am I to do, have you wiggle any you\nTell me something that I just make sense\nYou sent us off to war, please be honest what it's for\nDoes it matter if it's life or death?\n\n[LL Cool J]\nI'm not Republican or Democrat\nI'm independent and I want the facts\nWhen are the soldiers coming back?\nAre we prepared for a terror attack?\nLate at night I watch CNN\nIt gets so bad, I might stop breathing\nThe Middle East hates us, what's the reason?\nMr. President, my heart is bleeding\nTuck my kids in every evening\nTry to teach them to keep believing\nHoping my government won't deceive them\nTell 'em, touch your goals, you could achieve them\nMr. President, I have to know\nIf I die for you, what will I have to show\nWill it really and truly help our country go?\nI'm waiting for your answer, let me know\n\n[Hook 2x]", "image": "https://images.genius.com/0c13f17b61fb5401ffd0b607a7ca75ab.500x500x1.jpg"}], "artist": "LL Cool J"}