{"songs": [{"title": "That’s What They Call Me", "album": null, "year": null, "lyrics": "Man, I ain't got nothing but some pussy and some paper\nI keep a bad bitch like a muthafucking Laker\nI don’t love them hoes, fuck that pussy till its aching\nPass a bitch like Troy Aikman\nMan, gangstas don’t die, gangstas go to Vegas\nWe don’t need no navigation, we go where the money takes us\nMuthafucking fools, like the first of fucking April\nI ain't never been a pussy, have you ever been in pussy?\nThats so muthafucking good, feel like a treasure in a pussy\nI’m a shovel in a pussy, or devil to them pussy\nSpill the champagne on them pussies\nYeah, same shit different restroom\nStop playing, I turn your chest into a flesh wound\nHa, you would never guess who's in my guest room\nNow they saying \"just me Tune!\"\n\n[Hook]\nTunechi, that what they call me man\nBig dog muthafucker, you’s a Pommerain\nThey say fuck me, then Karma came\nAnd since my case, I got my guns in my momma name\n\nAnd since my case, I got my guns in my momma name\nIn my momma name…guns in my momma name\nAnd since my case, I got my guns in my momma name\n\n[Lil Wayne - Verse 2]\nI’m smoked out, I’m by myself\nBitch, I’m a king no matter how the cards are dealt\nIt’s Young Money or it’s take money\nLong hair don’t care, call me jake sully\nPay me or pay for me\nI tell em hoes stay on ya toes, ballet for me\nMomma pray for me\nGoons spray for me\nI have em bring me your head on a tray for me\nCut the brain raw, pussy ass nigga I’m at your chest like a training bra\nTune talk that shit that rip straight through the kevlar\nPull a bitch over, dump his ass in a reservoir\nReal nigga repertoire\nAdd five or six blunts to the head, it helps\nReportin’ live from the top of the food chain\nWe eatin man, now what my name?\nTunchi, yep! That what they call me man\n\n[Gudda Gudda]\nGudda Gudda, double G, it’s all the same\nThe game ain't never been the same since the Carter came\nAnd I stay high bitch, fly like the largest plane\nYou Captain save a ho, cuffin like a sargeant man\nDuck tape on the handle of my pistol nigga\nAnd I don’t spit no more I drew like a retarded man\nShawty on my lap, watch me pump pump up the party man\nDon't you hold a grudge cause your bitch chose me, I’m sorry man\nYoung nigga with old school, game like an Atari man\nThats your ho callin’ man\nI’m Gudda Gudda bitch, thats what they call me man", "image": "https://images.genius.com/f903dae2533e450c8d3cb233aa846020.745x745x1.jpg"}], "artist": "Lil Wayne"}