{"songs": [{"title": "Jam 4 U", "album": "Whut? Thee Album", "year": "1992-09-22", "lyrics": "[Intro]\n*inhales, starts coughing*\nYo, this is for motherfuckers, that talk that sellout shit\n\n[Hook]\n\"I just want to jam for you\" (repeat 2X)\n\"Ev-everybody get up!\"\n\"I just want to jam for you\" (repeat 2X)\n\"Get on up!\"\n\n[Verse 1]\n\"Get down, get down, on down...\" like James Brown plus I get down\nBut for now I \"Get on up!\"\nRhythm and funk makes you hump\nLike Technotronic, I'll make the Jam Pump\nStrong to the finish when I freak the fly gimmick like\n\"Du-na-da-du-duh!\" without eating my damn spinach\n'Cause when I'm on a roll, that's when Redman start\n\"to chill...\" round off backflip cartwheel\n\"Ahhhhhh, you're nasty!\" I know\nWhen my afro grow, that mean more rhymes to flow\nBut I continue, on the menu, and send you\nOn a jam that earthquakes the whole damn venue\nIt's like this, it's like that, I won't slack\nI pack more steel than the cops pack blackjacks\nWord is bond, the quiet storm broke your arm\nWhen I sound off from here all the way to Hong Kong\nDrop pound for pound to throwdown and strut\nYo E, what's that funk mode? \"Get on up!\"\n\n[Hook]\n\"I just want to jam for you\" (repeat 2X)\n\"Ev-everybody get up!\"\n\"I just want to jam for you\" (repeat 2X)\n\"Get on up!\"\n\n[Verse 2]\nCheck this out here, let the rough cut cut your ear\nHit Squad's the crew, I'm twenty-two, and Beck's the beer\nFloat like Muhammad, roll-on like Secret\nMe rip, the crowd in half on the sneak tip\n'Til they crumble, too humble for you to stumble\nI sting like a buh-bee while the others bum-bumble\nDon-dan-dan, do-do-don-ding\nExtremely wild, like the hair on Don King\n'Cause I kick the mode to make your brain explode\nIt's the HUH, the funk, now I'm known around the globe\nSo buckle up, hush up, while I freak the funk to get down\nWith the sound, grab my bozack then I freeze now...\n... on your mark, get ready, get set, let's go\nWith the flow to jet like Delta, or Jesse O-\n-Wens with the Benz, I clean my front lens\nWith a system, that knocks harder than Rin-Tin-Tin\nWithout question, I'm flexy when I'm sexin'\nWicked when I Kick It like A Tribe Called Quest-in\nThe rude Redman rip backbones and hips to bits\nThen split ya from your wrist to your armpits\nBut true indeed, since pop's dropped the seed\nI knew I'd be, the funkiest brother that ever bleeds\nRough and rugged, more nuggets in the bucket\nThat's dum dum dollars, and yes Redman love it\nPound for pound, I throw down to make ya strut\nYo E, what's that funk mode? \"Get on up!\"\n\n[Hook]\n\"I just want to jam for you\" (repeat 2X)\n\"Ev-everybody get up!\"\n\"I just want to jam for you\" (repeat 2X)", "image": "https://images.genius.com/851b0a63d63f6c8548a17f295b615296.1000x991x1.jpg"}], "artist": "Redman"}