{"songs": [{"title": "Gangsta Shit", "album": "You Know What It Is Vol 4 - Murda Game Chronicles", "year": "2007-04-08", "lyrics": "Vida, the multi-million dollar diva\nThe Game's changed, The Game's done caught that amnesia\nHow your fingers gonna get next to this?\nYou damn near? sending me all your text messages\nMonday you're blowing me up, Tuesday's the same\nWednesday's male strip night so I don't hear from Game\nHe outplayed I done saved a couple of your messages\nDon't know why you texting me cos women ain't your preference\nBut anyway, any rate, Vida's never on your team\nYou need to go back to Kanye and find another \"Dream\"\nFind another video hoe, another fiend\nCos the only way you'll find me is if you find another...\n\nBitch shut the fuck up!\nGet the fuck outta here!\n\n1 (Game):\nQuick for death though\nGet pussy like a lesbo\nBen Frank the king get green like the gecko\nFour-finger ring, '87 gold chain\nAll black Air Ones, tape em like Daddy Kane\nSmooth criminal bitches love the way I flow\nThe way I puff Cuban cigars and sip Don slow\nV.I.P. lick it up, it's real go get a cup\nChampagne like cum in her mouth, the way she spit it out\nThe black Hugh Hef sold crack, blast a few TECs\nFuck em all doggy style now who's next?\nReign terror pull they pony tail fuck em in the mirror\nPiss in they mouth like Vida Guerra\nReign terror pull they pony tail fuck em in the mirror\nPiss in they mouth like Vida Guerra\nUsed to fuck nasty bitches\nMoved up to classy bitches\nPeep the way I went from rags to riches\n\nIt's that gangsta, gangsta, gangsta shit they love it\nGangsta, gangsta, gangsta shit they love it\n\nI never once dreamed about a hood rat\nOnly dream about bitches with good cap\nBeyoncé, Ashanti!\nGet money like Andre\nWhich one? Pick one\n3, 000 or the sick drum, slick tongue\nFor these foul niggas outta bounds with they lyrics\nPut em to death with mine I murk em by the minute\nThis beef shit I seize quick\nMy clip crowded like the Freaknik\nBout Dat, Bout Dat, that Master P shit\nTell em haters to eat dick and die slow\nWhile we live it up, ride low and bust with the 5-0\nPop Cristal with foreign bitches\nPussy official\nMe and head game got more to dish out\nTold B.I.G. piss they ass, they do too\nThey know we fuck all night like we say we do\nI used to fuck ashy bitches\nMoved up to classy bitches\nPeep how I went from rags to riches\n\nIt's that gangsta, gangsta, gangsta shit they love it\nGangsta, gangsta, gangsta shit they love it\n\nI been around the world and nya-ya-ya\nI can't find a bitch that pop shit and don't ride dicks like Heather Hunter\nI'm talking whoever wanna\nGet they brains fucked out by Mrs. seven summers\nNever hand chump sex\nBut I know bitches that write pussy off like bump checks\nAnd model Funk Flex\nBitch cheated, I wouldn't give her what she needed\nWouldn't eat it or beat it\nTwo-fingered the bitch Vida like a virgin\nTwo finger split had her swerving\nLike me in the Rolls Royce, lick it up behind curtains\nI keep bitches screaming and squirting\nNever heard em but the pussy get murder\nFeel like they been bit by a serpent\nI never fucked a bitch that would turn me down\nJust like never fucked a bitch that would burn me, wow\nI used to fuck nasty bitches\nNow I fuck classy bitches\nPeep how I went from rags to riches\n\nIt's that gangsta, gangsta, gangsta shit they love it\nGangsta, gangsta, gangsta shit they love it", "image": "https://images.genius.com/fd823b680b687dac4f58ed6122bbab9b.500x500x1.jpg"}], "artist": "The Game"}