{"songs": [{"title": "Standing on Ferraris", "album": "The Documentary 2", "year": "2015-10-09", "lyrics": "[Produced by Jahlil Beats]\n\n[Intro: The Game & Diddy]\nI put that on Piru\nYo Game, let's go\n\n[Chorus: The Game]\nI've been shot stabbed, left for dead, walked through every hood in LA\nBandana on my head, guarantee that shit was red\nMachetes and them choppers out, bitches with their knockers out\nI done fucked 'em all, that's why I'm standing on Ferraris, nigga\nFrom the corner playing lookout to kitchen cookouts\nYeah, that's why I'm standing on Ferraris, nigga\nIn a 64, 6'5, too big for a Bugatti\nThat's why I'm standing on Ferraris, nigga\n\n[Verse 1: The Game & Diddy]\nRan the west for a decade nigga, check the bio\nGave you Cincinnati fitteds like I get it in Ohio\nAutographs on the vinyl made the Lamb albino\nStraight away in the Wraith, that's a Peyton Manning spiral\nYou lookin' at your idol, Jesus wrote the Bible\nYeezus, that's my Nike town rival\nDare a nigga try me now, like why me now\nLookin' for Red Octobers, I will tie him down\nStay laced, spit nothin' but based, yeah\nAll my shit bump like Craig Mack face\nAsk your favorite bitch how my dick taste (Baaaaaaaaddd Boyyyyyy)\nAsk your neighbor's bitch how my dick taste\nDon't take orders, I dictate, get your shit straight\nDickface, perpetual Rollies with the big face\nI got 'em lovin' the movement\nBeard so long, I'm feelin' like Rick Rubin\n\n[Chorus: The Game]\nI've been shot stabbed, left for dead, walked through every hood in LA\nBandana on my head, guarantee that shit was red\nMachetes and them choppers out, bitches with their knockers out\nI done fucked 'em all, that's why I'm standing on Ferraris, nigga\nFrom the corner playing lookout to kitchen cookouts\nYeah, that's why I'm standing on Ferraris, nigga\nIn a 64, 6'5, too big for a Bugatti\nThat's why I'm standing on Ferraris, nigga\n\n[Verse 2: The Game]\nTop floor at the Biltmore, say they want a\nWar, shit, that's what I'm built for, loungin'\nMiami with the eye candy\nBitches names Sandy and Bambi, my exes can't stand me\nGod blessed the nigga with more swag than Jigga\nMore hoes than Trigga, Trigga know, that's my nigga though\nFigure four down, Figueroa, Ric Flair\nPhantom, all red flannel, niggas don't hit me though\nSpit on models, R.Kelly, piss on the center fold\nEver since Doc showed me a billion in a envelope\nLove Jimmy, fuck Interscope, I'm a don\nWalk outside, naked, Cuban cigar and Louboutins, huh\nShit on my lawn, snakes in the grass\nI hear 'em slitherin' and hissin' whenever I pass\nRidin' with somethin' French; Khloe Kardash'\nTwo-hundred on the dash, that's your ass\n\n[Chorus: The Game]\nI've been shot stabbed, left for dead, walked through every hood in LA\nBandana on my head, guarantee that shit was red\nMachetes and them choppers out, bitches with their knockers out\nI done fucked 'em all, that's why I'm standing on Ferraris, nigga\nFrom the corner playing lookout to kitchen cookouts\nYeah, that's why I'm standing on Ferraris, nigga\nIn a 64, 6'5, too big for a Bugatti\nThat's why I'm standing on Ferraris, nigga\n\n[Outro: Diddy]\nYo, this nigga Game bought me a motherfuckin' red Ferrari for my birthday, nigga. (I put that on Piru) Told me I was honorary. (Put that on Piru)\nI said, nigga, I'm with whatever with this motherfuckin' red Ferrari, nigga. Yeah, I'll take it\nNigga, Game givin' out red Ferraris for no reason, it was just a Tuesday\nA motherfuckin' Tuesday. Niggas said happy Tuesday, Puff\nNow that nigga wanna stand on my Ferrari every day\nNow that nigga wanna stand on my motherfuckin' Ferrari all the time\nDrivin' down the street with Hype Williams shootin' a video. We ain't even shootin' a video, we just motherfuckin' ridin' down the street, this nigga got Hype Williams shootin' and shit\nSee this what happens when that East meets West, we get together, know what I'm sayin'? Say fuck the rest, we start partyin' and bullshittin', havin' a good time, throwin' pool parties and shit\nNiggas start buyin' niggas from the East Coast Ferraris and shit, shit all good, red Ferraris at that, nigga\nShit, ain't got no time for no other shit, I just got time to get this motherfuckin' money man. Get this money with me man. So that's what we decided to do so now we gettin' more money than anybody and everybody\nAnd the only color that we motherfuckin' at the end of the day gonna beef over is that motherfuckin' green motherfucker", "image": "https://images.genius.com/f5bd9dcb51fd19e06b10b2ae0e3620cf.1000x1000x1.jpg"}], "artist": "The Game"}