{"songs": [{"title": "Turn Ya Back", "album": "Black Dollar", "year": "2015-09-02", "lyrics": "[Intro: Rick Ross]\nYou know, going through the things you go through\nMake you who you are\nBut when the closest ones to you turn they back on you\nIt's such a painful feeling\n\n[Hook 1: Rick Ross]\nThey turned they back, turned they back\nBut then 'em niggas wanna front\nThey blowin' stacks, they blowin' stacks\nThey turn they back, turn they back\nBut then 'em niggas wanna front\nThey blowin' stacks, they blowin' stacks\nThey turned they back, turned they back\nWatch a nigga fall down\nThey turned they back, turned they back\n\n[Verse 1: Rick Ross]\nTurned they back, turned they back\nI watch my nigga turn his back, turned they back\nI watch my bitch turn her back, she turned her back\nWatch a nigga fall down then she turned her back\nBut, now I'm back, now I'm back, now I'm back, now I'm back\nNow I'm back, nigga, now I'm back\nAll my niggas turned they back, they turned they back\nEven my people turned they back, they turned they back\nEven my cousin turned they back, he turned his back\nBut now I'm back, now I'm back\nEven my bitch, she turned her back, she turned her back\nBut now I'm back bitch, where you at? Now where you at?\n\n[Hook 2: Rick Ross]\nThey turned they back, turned they back\nWatch a nigga fall down, they turned they back\nThey turned they back, turned they back\nBut then 'em niggas wanna front\nThey blowin' stacks, they blowin' stacks\nThey turned they back, I asked 'em why\nWhen they turned back, they couldn't see me cry\nThey turned they back, I asked 'em why\nWhen they turned back, they couldn't see me cry\nA Mastermind\n\n[Verse 2: Gucci Mane]\nMan, it's funny how a nigga act\nLike he got shit bad, but really that is just a knack\nYou know a bitch that called police on you and took her back?\nYou stole a stack but bitch man, I would take the whole sack\n\"Say Gucci Mane, you the man, why you doin' that?\"\nHe said \"been workin' lockin' up that shit, it won't come back\"\nI told that nigga \"man, there ain't no need to call me that\"\nWhen I was broke man these bitches wouldn't call me back\nYou could pay a nigga's rent, have a nigga back\nEven pay a nigga bond what kind of shit is that?\nI took the shirt off my back and put it on your back\nThen you turned your back, oh what kind of shit is that?\nBurr!\n\n[Hook 2: Rick Ross]\nThey turned they back, turned they back\nWatch a nigga fall down, they turned they back\nThey turned they back, turned they back\nBut then 'em niggas wanna front\nThey blowin' stacks, they blowin' stacks\nThey turned they back, I asked 'em why\nWhen they turned back, they couldn't see me cry\nThey turned they back, I asked 'em why\nWhen they turned back, they couldn't see me cry\nA Mastermind\n\n[Verse 3: Whole Slab]\nThey triple crossed me, left me for dead\nThey blowin' racks, I'm fucked up, I owe these chicos bread\nI'm in the red, I took a loss, had to crawl back\nMy own niggas crossed me out, now what you call that?\nFucked up my set, my bottom bitch, she turned her back\nShe want rum and rocky with me, she was chasin' sack\nPussy hoe, she turned her back, that's how she felt\nCollect call from Rice Street, that bitch, she run herself\nI knew a nigga 10 years, it's a deadly game\nMan can win those cracker canes, shawty said my name\nShit ain't the same, there's somethin' missin'\nThere's somethin' different\nEither ya ass get pimped or you're doin' the pimpin'\nSlab!\n\n[Hook 2: Rick Ross]\nThey turned they back, turned they back\nWatch a nigga fall down, they turned they back\nThey turned they back, turned they back\nBut then 'em niggas wanna front\nThey blowin' stacks, they blowin' stacks\nThey turned they back, I asked 'em why\nWhen they turned back, they couldn't see me cry\nThey turned they back, I asked 'em why\nWhen they turned back, they couldn't see me cry\nA Mastermind\n\n[Verse 4: Meek Mill]\nOkay, hoes turnin' back, niggas did too\nI was sellin' crack, my niggas did too\nMan I ain't see it comin', all the shit we been through\nAnd they ain't see it comin' neither, last time I spinned through\nHard-top bent blue, every time I dipped through\nNiggas turned they back on me, tried to fuck my bitch too\nAnd I put 'em on paper, oh that's what this shit do?\nOh, that's how you nigga rock? I be wrong, I get you dropped\nI get you wet, nigga turn ya back\nKnow where I live, I lay you flat, nigga, that's a fact\nPut it on my kids, you niggas rats, and I'm comin' back\nLook what you did, made me do that, got you niggas clapped\nThese pussy niggas...\n\n[Hook 2: Rick Ross]\nThey turned they back, turned they back\nWatch a nigga fall down, they turned they back\nThey turned they back, turned they back\nBut then 'em niggas wanna front\nThey blowin' stacks, they blowin' stacks\nThey turned they back, I asked 'em why\nWhen they turned back, they couldn't see me cry\nThey turned they back, I asked 'em why\nWhen they turned back, they couldn't see me cry\nA Mastermind", "image": "https://images.genius.com/be2a0055a8996220ec3bf561583cd405.800x800x1.jpg"}], "artist": "Rick Ross"}