{"songs": [{"title": "Hey Baby", "album": null, "year": "2019-05-19", "lyrics": "[Intro]\nHey baby, hey baby, hey baby, hey baby, hey baby, hey baby\nThugger!\nThugger Tugger, baby!\n(Ricky Racks)\nYeah\n\n[Chorus]\nAt the same time with me like\nI wanna feel and see like (Hey)\nLike Mike I wanna be like\nOh yeah, yeah, yeah, get that right\n'Cause she like me, I'm supposing (Hey baby)\n'Bout you, I'll kick down the door (Hey baby)\nYour ice is cold, you need a coat (Hey baby)\nAyy (Hey baby)\nBaby, I want you and you know (Hey baby)\nWhat I gotta do for it to show? (Hey baby)\nGive you big ol' love like you're 'posed to (Hey baby)\nHey (Big ol' love)\n\n[Post Chorus]\nHey baby (Swoo)\nUh, uh, uh, yeah\nWhatever you need (Thugger, let's get it)\nI want you to come see (Oh, oh oh, oh)\n\n[Verse 1]\nPick it off, you'll swallow it\nSince that day you left, I gained a thousand bitches (Yeah)\nLet that nigga play, I shoot a thousand missiles (Bow)\nMillion dollars surrounded by lots of killers\nSearch for niggas like bounties and bound a nigga (Search)\nLike a school, lost and found a nigga\nTo be rude, you a coward, nigga (And what?)\nI pay my dues and allowance, nigga\nPray to Lord and just bow a nigga (Lord, nigga)\nI get stoned like a mountain, nigga (Stoned like a mountain)\nDiamonds dancing, no cloud, lil' nigga (Dancing, no cloud)\nYou got milk like your cow was bigger (Milk like no cows)\nMy crew hungry like sneakerheads (Hungry like sneakerheads)\nI got spots like a cheetah, bitch (Cheetah)\nMomma said I don't need a bitch\nFuck a bitch with a needle dick\n\n[Chorus]\nAt the same time with me like\nI wanna feel and see like\nLike Mike I wanna be like\nOh yeah, yeah, yeah, get that right\n'Cause she like me, I'm supposing (Hey baby)\n'Bout you, I'll kick down the door (Hey baby)\nYour ice is cold, you need a coat (Hey baby)\nAyy (Hey baby)\nBaby, I want you and you know (Hey baby)\nWhat I gotta do for it to show? (Hey baby)\nGive you big ol' love like you're 'posed to (Hey baby)\nHey\n\n[Verse 2]\nShe want love, looking for love, [?]\nI want that buzz, it's clear to us\nYou blurry, you dirty and I don't trust you\nYou know you unworthy, I know that you girly, I know that you flirtin' (Yeah)\nWhen I come to the house and pack up all my shit, baby don't get discouraged (Don't get scared)\nYou don't play by the rules (Don't)\nYou don't know 'bout no dues (You don't)\nMama taught you to win, win, win, you don't know how to lose (No)\nBut it's okay, it's cool, I know that it's not up to you (Yeah)\nI spiked out my drink and my Loub's\nGot water, fish tank diamond, boo\nTell your friend to come give you a hand (Yeah)\nI just poured up a deuce in a can\nI'll think about you whenever I land\nWhen I'm 'bout to fall, I'ma pop me a xan\nMy brother got phones down his Smith, like a Stan (What?)\nYou done made a few thousand, now I see how you playin' (I do)\nAnd I added horsepower, now that bitch super fast\n\n[Chorus]\nAt the same time with me like\nI wanna feel and see like\nLike Mike, I wanna be like\nOh yeah, yeah, yeah, get that right\n'Cause she like me, I'm supposing (Hey baby)\n'Bout you, I'll kick down the door (Hey baby)\nYour ice is cold, you need a coat (Hey baby)\nAyy (Hey baby)\nBaby, I want you and you know (Hey baby)\nWhat I gotta do for it to show? (Hey baby)\nGive you big ol' love like you're 'posed to (Hey baby)\nHey\n\n[Outro]\nOoh, ooh (Yeah, yeah)\nUh, ooh, swoo (What?)\nSwoo, swoo, uh, uh", "image": "https://images.genius.com/717461618e785def35d07de6484b7ad4.1000x1000x1.png"}], "artist": "Young Thug"}