{"songs": [{"title": "Piggy Bank", "album": "The Massacre", "year": "2005-03-03", "lyrics": "[Produced by Needlz]\n\n[Chorus]\nClickity-clank, clickity-clank\nThe money goes into my piggy bank\nClickity-clank, clickity-clank\nThe money goes into my piggy bank\n\n[Intro]\nMan I’ll get at you! My knife cuts your skin\nI’ll get at you! Blow shots at your man\nI’ll get at you! 2Pac don’t pretend\nI’ll get at you! I’ll put that to an end\n\n[Verse 1]\nThat damn shit is old, don’t be screamin’ “Get at Me Dog”\nHave you runnin’ for your life when I match ya part\nI get to wavin’ that semi like it’s legal\nA lil’ nigga hurt his arm, lettin’ off that Eagle, you know me\nBlack on black Bentley, big ol’ black nine\nI’ll clap your monkey-ass, yeah black on black crime\nBig ol’ chrome rims gleam, you know how I shine\nC’mon on man, you know how I shine\nI’m in the hood, in the drop, Teflon vinyl top\nGot a 100 guns, a 100 clips, why I don’t hear no shots?\nThat fat nigga thought “Lean Back” was “In da Club”\nMy shit sold eleven mill’, his shit was a dud\nJada’ don’t fuck with me, if you wanna eat\nCause I’ll do yo’ little ass like Jay did Mobb Deep\nYeah homey in New York niggas like your vocals\nBut that’s only New York dawg, yo’ ass is local\n\n[Chorus]\nClickity-clank, clickity-clank\nThe money goes into my piggy bank\nClickity-clank, clickity-clank\nThe money goes into my piggy bank\n\n[Post-Chorus]\nYeah, yeah-yeah! Get more money, more money\nYeah, yeah-yeah! Get more money, more money\nYeah, yeah-yeah! Get more money, more money\nYeah, yeah-yeah! Get more money, more money\n\n[Verse 2]\nBanks’ shit, sells; Buck’s shit, sells\nGame’s shit, sells; I’m rich as hell\nShyne poppin’ off his mouth from a cell\nHe don’t want it with me, he in PC\nI could have a nigga run up on him with a shank\nFor just a few pennies out my piggy bank\nYayo bring the condoms, I’m in Room 203\nFreak bitch look like Kim before the surgery\nIt’s an emergency, for Michael Jackson see\nLooked at a picture and says she looks like me\nKelis said her milkshake bring all the boys to the yard\nThen Nas went, and tattooed the bitch on his arm\nI mean like way out in Cali niggas know you, cuz\nFirst thing they say about you is you’s a sucker for love\nThis is chess not checkers, these are warning shots\nAfter your next move I’ll give you what I got\n\n[Chorus]\nClickity-clank, clickity-clank\nThe money goes into my piggy bank\nClickity-clank, clickity-clank\nThe money goes into my piggy bank\n\n[Post-Chorus]\nYeah, yeah-yeah! Get more money, more money\nYeah, yeah-yeah! Get more money, more money\nYeah, yeah-yeah! Get more money, more money\nYeah, yeah-yeah! Get more money, more money\n\n[Outro]\nWhen I get at you I’ll punch out your grill\nI’ll get at you! Let off that blue steel\nI’ll get at you! Nigga I’m for real\nI’ll get at you! Could get yo’ ass killed", "image": "https://images.genius.com/ca36dfbff5c6dfcea453afdb61476f86.1000x1000x1.jpg"}], "artist": "50 Cent"}