{"songs": [{"title": "I’m Threw Witchu", "album": "R&G (Rhythm & Gangsta): The Masterpiece", "year": "2004-11-16", "lyrics": "[Snoop Dogg]\nYeah man, this is another 9 inch dick classic\nWe wanna dedicate this one, to all the fellas\nWho got a hardhead bitch, who just won't listen\nY'know? The best thing to do, is leave her\nDon't hit her, shake that ho (bitch I'm gone!)\n\n[Hook: Soopafly]\nBitch I'm gone.. I can't take it no mo'\nI can't get through to you\nThere's nothin I can say that you seem to understand\nBitch I'm gonnnnnnnnneeeeeee.. I'm out oh yeah yeah yeah\nI'm through wit'chu\nOh I'm through wit'chu, yeah\n\n[Soopafly]\nI knew that you, was a ho back then\nAnd bitch you're still one now\nYa like to bust, nuts in your face\nBut with that big-ass mouth\nYou need to shut the fuck up, you talk too much\nI told you once before, yeah\nThat pimpin don't, like to tell you twice\nSo I'm walkin out that dooooooooooor\n\n[Hook: Soopafly]\nBitch I'm gone.. oh yeah bitch I'm, oh I, I got to get the, hell outta here\nI can't get through to you\nI can't get through to you, you talk too much, I can't tell you shit\nBitch I'm gonnnnnnnnneeeeeee.. oh yeah I'm goin I got to get out\nI'm through wit'chu\nOh yeah, I'm through wit'chu bitch, yeah yeah\n\n[Soopafly]\n(Bitch I'm gone) Bitch I'm through wit'chu\nI'm through wit'chu, cause I refuse to lose\nI can't be locked in your world\n(Bitch I'm gone) I need to breathe, I got to roll\n(I'm through wit'chu) Ain't no way\nI can stay another day wit'chu\n\nBye bye bitch, and wit all the other pussy, yeah\nA nigga got besides yo' big head gut and butt fo' ugly kids\nStill livin with ya grandmama bucket mouth ass\nYou shoulda known, you was fuckin with a mack (MACK)\nInstead of steppin your game up, you got pushed way to the back\n(Step off, step on back)\nI seen yo' expression, when you seen me pimpin in the club\nIt looked like, it looked like you wanted to break down, down and cry\nBut I just didn't give a damn, I didn't give a damn, no no I didn't\nCause bitches ain't shit, anyway, so don't even ask me why\n\n[Hook: Soopafly]\nBitch I'm gone.. I'm I'm gone hah, yes I am, I got to get ta\nI can't get through to you\nGot to get ta, got to get ta hell outta here, oh yeah\nBitch I'm gonnnnnnnnneeeeeee.. oh bitch a, I got too many bitches, anyway\nI'm through wit'chu\nTo be, foolin wit'cho, ugly, ugly, ugly ass\n\nOh, break it down (break it down)\nOh we got to break it down (break it down, break it down)\nWhoaahhh, aw yeah yeah yeah yeah\n\nHey hey hey, what's up baby?\nCome on in, sit down, what'chu got, what'chu got there?\nY'now, I seen you today baby, you know what?\nJust sit the fuck down bitch!\nI ain't playin no God damn game wit'chu right now bitch\nY'knahmean? There's a lotta time and effort up in this shit, y'knahmean?\nWanna tell you a lil' somethin like this bitch\nI got everything, you don't have nothin\nBitch, I ain't believin a motherfuckin word you say bitch\nGet yo' shit, and get the fuck outta here\nEven though it's yo' motherfuckin house, get the fuck up outta here\nYou know what? I'm leavin this motherfucker\nGot a fo' bedroom upstairs, I'm movin your sister in bitch\n\n[Hook - singers only version, in background]\n\nAnd I gotta protective order against yo' punk bitch-ass\nSo we gon' partyin all night long\nAnd your sister a twin so I'm finna cash this check bitch\nI'm out\n\nAw, my car is parked right outside\nI got a full tank of gas, and away I go\n\n[Snoop] Bye bye", "image": "https://images.genius.com/22daab0632e506300bab596c589dcfb2.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}