{"songs": [{"title": "Tell It Like It Is", "album": "Release Therapy", "year": "2006-09-26", "lyrics": "[Produced by Omen]\n\n[Karma] Daddy is that your car on TV?\n\n[Ludacris]\nYou better believe it is baby\nNow go in the other room\nIt's about to be some grown folks talkin here, okay?\nAll right\n\nYeah, things ain't always what they seem or cracked up to be (okay)\nLike all these fakin ass rappers in this industry (tell 'em!)\nTalkin 'bout what they got and they ain't got a damn thang\nHow you own three cars but you don't own your own name? (woo!)\nGet your business right boys, the first class is in session (okay)\nGet a entertainment lawyer in the music profession (hey!)\nStart up your own company, trademark the name\nThat's gon' run ya about a grand so start savin your change (DTP!)\nOpen a bank account quick and then follow these steps (uh-huh)\nSign yourself TO yourself and start signin ya own checks (woo!)\nHit the booth and start recordin at the speed and need\nWhatever gets your juices flowin, could be speed or weed (what else?)\nGet it mixed and mastered (hey) pressed up and plastered (okay)\nSell it to your whole hood out the trunk, ya bastard!\nShow all the non-believers what you destined to be (hey!)\nAnd in just a couple years you could be rich like me!\n\n[Hook: Ludacris]\nBut I can't hold my tongue - I'mma tell it like it is\nThis biz ain't all fun - I'mma tell it like it is\nGive it to you straight, no chase - I'mma tell it like it is\nLook you straight in yo' face and I'mma tell it like it is\nI can't hold my tongue - I'mma tell it like it is\nThis biz ain't all fun - I'mma tell it like it is\nGive it to you straight, no chase - I'mma tell it like it is\nLook you straight in yo' face and I'mma tell it like it is\n\n[Ludacris]\nSee mostly all your favorite artists got some serious problems (yup)\nTheir money could be the problem but money can't solve 'em (nope)\nSome get addicted to drugs and flat out lazy (woo)\nSome taste a little fame and go flat out crazy (woo!)\nI'm close cause those close wanna live off my fame (yup)\nAnd that type of shit ALONE'll drive a nigga insane (crazy!)\nNot to mention all the vultures, the scandalous promoters (okay)\nCrabs'll try to sue you, magazines'll misquote ya\nMost of these label heads, they don't care nothin about ya (nah)\nIf you stop sellin records they'll act like they don't know ya\nIt's hard mixin business with pleasure so don't play\nMe and my crew argue and fight like every other DAY (for real!)\nRappers ain't above the law but our life is so fast\nThat we got a special task force of police on our ass (true that)\nAll that, and this is really just the start of it (just the start of it)\nHip-Hop! You really wanna be a part of it?\n\n[Hook: Ludacris]\nWoo! I can't hold my tongue - I'mma tell it like it is\nThis biz ain't all fun - I'mma tell it like it is\nGive it to you straight, no chase - I'mma tell it like it is\nWoo! Look you straight in yo' face and I'mma tell it like it is\nHey hey, I can't hold my tongue - I'mma tell it like it is\nMan this biz ain't all fun - I'mma tell it like it is\nI'mma give it to you straight, no chase - I'mma tell it like it is\nHey! Look you straight in yo' face and I'mma tell it like it is\n\n[Ludacris]\nLet's go!\nWhat's worse than havin no money is havin it and losin it (yup)\nWhat's worse than havin some money is grabbin and abusin it (yup)\nWe never took no money from Chingy, thought I was cool with him (nah)\nI wish his ass well but I don't want NOTHIN to do with him (woo!)\nSome don't own they publishin; me? I never fool with 'em (nah)\nI'm down for my artists, try my best to stay true to 'em (believe it)\nCause outside my label competition is irrelevant (DTP!)\nUnless I'm still in competition with my president (what up Jay?)\nAnd believe that I'm supportin the Hova\nCause the industry's shady, it needs to be taken over (okay!)\nBut the first rule to accumulation of wealth (what's that?)\nIs don't trust nobody but your GOD damned self!\n\n[Hook: Ludacris]\nWoo! I can't hold my tongue - I'mma tell it like it is\nMan this biz ain't all fun - I'mma tell it like it is\nI'mma give it to you straight, no chase - I'mma tell it like it is\nLook you straight in yo' face and I'mma tell it like it is\nI said I can't hold my tongue - I'mma tell it like it is\nThis biz ain't all fun - I'mma tell it like it is\nI'mma give it to you straight, no chase - I'mma tell it like it is\nLook you straight in yo' face and I'mma tell it like it is\n\n[Karma] Daddy are you finished with grown folk talk?\n\n[Ludacris]\nYeah baby you can come back in here\nCome give Daddy a kiss, you know I love you right?\n\n[Karma] And I love you, always!", "image": "https://images.genius.com/57825a3687491fdf0e3c4c58b1b7aee5.1000x1000x1.jpg"}], "artist": "Ludacris"}