{"songs": [{"title": "What’s Your Number?", "album": "Till Death Do Us Part", "year": "2004-03-23", "lyrics": "Let's go\n\n[B-Real]\nI met her at the club, her friend liked me but she didn't\nShe noticed a lot of girls giving up their phone digits\nShe didn't wanna be one of those hoes\nIn clothes exploiting her body from head to toes\nShe had glossy lips she was swaying her hips\nOn the dance floor and every nigga's flashing her grip\nTrying to impress her in vain she gave no play\nNiggas hit her up for numbers and she said no way\nI thought to myself let it go and roll on, B\nBut like Smokey said she really had a hold on me\nI couldn't stop staring I started to fantasize with her\nVoices in my head said she's tantalizing ya\nEven if I moved to the other side of the party\nI had pictures in my head of her moving that body\nI was beside myself with hunger pain\nSo I slowly walked over and I asked her name\n\n[Hook: repeat 2X]\nWhat's your name, what's your number?\nI would like to get to know you\nCan we have a conversation?\nThe night is young, girl give me a chance!\n\n[B-Real]\nShe gave a smile but I got no answer though\nI took a while before she gave a chance she's acting cold\nI offered her a drink she turned me down flat\nShe said if you want my name you gotta do better than that\nI said OK, now your shit don't stink\nI'ma walk away only tried to buy you a drink\nAs I began to walk away she said I'm sorry for real\nBut every guy in the club tried slipping me pills\nI don't trust guys each and every one will lie to you\nI said I understand but it's not what I try to do\nI wasn't even gonna come to your table\nBut if I didn't I knew that I'd regret it later\nI go after what I want but I got class\nFor me no need to slip a pill if I want ass\nShe gave me a funny look I couldn't tell what it meant\nShe let her guard down and on our conversation went\n\n[Hook]\n\n[B-Real]\nShe said I want a man with a plan and ambition\nNot an immature nigga on a \"pussy-hit mission\"\nI'm too good for that I have so much to offer\nGot a good job working at my mom and dad's law firm\nYou got goals, that's what she asked\nYeah I wanna fill my home with platinum plaques\nIt takes hard work but you know it's coming after\nShe said 'oh my God you must be a famous rapper!'\nI do all right but I'm never satisfied\nI'm told when you still love what you do it never gets old\nI strive for more but that's enough about me\nWhy don't we skip out the club and take a walk on the streets\nWe slipped out of the club with no worries\nSeems she wanted to get out in a hurry\nWe hung all night till we lost our friends\nTill they caught us bangin in the back of a Benz\n\n[Hook] - 2X", "image": "https://images.genius.com/bbdbef4d71e94241d00e6cf766f68925.640x640x1.jpg"}], "artist": "Cypress Hill"}