{"songs": [{"title": "Revelation", "album": "Devils Night", "year": "2001-06-19", "lyrics": "[Hook: Eminem]\nI don't wanna go to school, I don't need no education!\n(We don't need no education)\nI don't wanna be like you, I don't wanna save the nation! (daddy no!)\nI just wanna live my life, every day a celebration!\n(We don't need no thought control)\nOne day I'mma leave this world, I'm waiting for the revelation!\n\n[Verse 1: Bizarre]\nI wanna kill myself! I'm still debating\nIn front of a baptist church masturbating, praying to Satan\nThink I'm crazy cause I smoke crack\nLive on B with the mac in a two family flat (fuck it)\nTired of getting hit in the face with a broom\nMy moms on her period, my dad's in my room (Daddy no!)\nI got ten rocks and I need to get out\nI sold them in five minutes, at my own damn house (Moms smoke crack)\nMy poor grandmother, God bless her soul\nThe bitch got AIDS (aww) she just waiting to die of a cold (hahaha)\nThere's three things that keep me from being a Nazi:\nI'm black, a fag, and my dad's Liberace\n\n[Verse 2: Kon Artis]\nNo matter how bad the beating, I went to school cheating\nMy dad whooped my ass at a PTA meeting\nSkipping school I had to have nuts just to do it\nGot bored and became truant\nWhen I had the gall to go I just couldn't do it\nI was lured into corners by the peer pressure shit\nHow would you feel if you was held by the tip of a barrel\nGetting threatened to get your skin ripped to bone marrow\nBet suburban kids never got rushed for their apparel\nLike me, outcast, last to class\nFirst to leave, when the teacher called on me\nBest believe I had something up my sleeve\n\n[Verse 3: Eminem]\nI've been praised and labeled as crazed\nMy mother was unable to raise me, full of crazy rage\nAn angry teenager, nothing can change me back\nGangsta rap made me act like a maniac\nI was boosting, so influenced by music I used it\nAs an excuse to do shit, ooh I was stupid\nNo one can tell me nothing hip-hop overwhelmed me\nTo the point where it had me in a whole 'nother realm\nIt was like isolating myself was healthy\nIt felt like we was on welfare but wealthy\nCompelled me to excel when school had failed me\nExpelled me and when the principal would tell me\nI was nothing, and I wouldn't amount to shit\nI made my first million and counted it\nNow look at, a fucking drop-out that quit\nStupid as shit, rich as fuck, and proud of it\nThat's why\n\n[Hook: Eminem]\nI don't wanna go to school, I don't need no education!\n(We don't need no education)\nI don't wanna be like you, I don't wanna save the nation! (daddy no!)\nI just wanna live my life, everyday a celebration!\n(I don't need no self control)\nOne day I'mma leave this world, I'm waiting for the revelation!\n\n[Verse 4: Swifty McVay]\nI was raised with a rifle and mask\nSteadily beating my psychiatrist ass just for asking about my past\n(bitch) I was never on that punk shit; fucking around\nCan get your beloved abducted, smothered in blood quick\nYou couldn't pay Swift to give a fuck\nWas crazy like my father, it must of been poison in that nigga's nut\nFar as probation, fuck peeing in cups\nI violate at any time, let them see the blunt\nI grew up steadily masturbating inside of cells\nYoung as hell, having conversations with myself\nYou could tell I wasn't lenient, a disobedient\nLynched and slapped teachers, bitch I'm not reading it\nYou don't know what dogs go through, a little nigga\nSipping liquor with my old dude, what the fuck you gon' do?\nI'm quick to curse you, I told my mother that I'mma hurt you\nIf you ever again mention that curfew\n\n[Verse 5: Kuniva]\nLook, my family ignores me and I don't like that\nThey don't even listen when I tell them I'll be right back\n(Yeah whatever) This nice beautiful house ma, it don't mean shit\nCause you know daddy's a drunk and he don't clean shit\nAnd yesterday he hit me like a grown fucking man\nI couldn't stand up to him, I just ducked and ran\nI'm sick of this, I wish on Christmas\nThat I can get a loaded four-fifth and put a fucking end to this\n(Fuck it) I got no friends and I can't get a bitch\nOnly thing I have is dirty magazines and sticky fingertips\nNothing to smile about, I'm about to lose my mind\nGot me an automatic nine, now I'm wilding out\n\n[Verse 6: Proof]\nWhen school's over, pu-pil are people to shoot through\nKids going cuckoo, with a two-two\nSince my friend is this new dude, in this high school\nLosing his noodle learn that people don't like you\nThe football jocks is, spitting on him\nPopular kids in school is now picking on him\nBurn out youngster niggas now hitting on him\nAnd his teacher in his english class keep flipping on him\nAnd now he's grounded with no allowances\nFor drinking forty ounces, 'cause he was caught by his counselors\nAnd why the fuck I gotta ride the bench coach?\nAlready got expelled for wearing a trench coat\nAll I ever seen is... (Violence, violence...)\nTold me to keep silent, stop battin' my eyelids\nIt's apparent that my parents weren't parents at all\nThat's why I blew out my brains in front of the wall (Fuck you!)\n\n[Hook: Eminem]\nI don't wanna go to school, I don't need no education!\n(We don't need no education)\nI don't wanna be like you, I don't wanna save the nation! (daddy no!)\nI just wanna live my life, everyday a celebration!\n(I don't need no self control)\nOne day I'mma leave this world, I'm waiting for the revelation!\n\n[Outro / Skit: Eminem]\nIf you don't eat your meat, how can you have any pudding?\nHow can you have any pudding if you don't eat your meat?\nIf you don't eat your meat, you can't have any pudding!\nYou can't have any pudding if you don't eat your meat!", "image": "https://images.genius.com/591360993ef93e1c0a2402279fb90319.600x600x1.jpg"}], "artist": "D12"}