{"songs": [{"title": "The Ride", "album": "Dreamchasers 2", "year": "2012-05-07", "lyrics": "[Intro]\nSee when I do joints like these\nI do it for the young'en in the ghetto\nThat you ain't go'n never hear his story\n'Cause he ain't gonna make it to tell ya\nSo you know what's crazy?\nI went to court the other day, the D.A. say she hate me\nHow you gonna hate me when me and Lou just took 20 racks\nAnd put coats on them kids back\nIt's 30 degrees outside\n\n[Verse 1]\n24, how could I ask for more?\nI got my deals, it's gettin' real, I'm makin' cash fo' sure\nStuntin' every chance I get, because I had it poor\nBut every time I go to sleep I hear the devil at my door\nAnd I'm on them papers so them courts I'm goin' back and forth\nDealing with probation, man, they all said I'd be back for sure\nMommies turned to zombies from that raw\nBecause it's crack galore\nYou wonder why them babies runnin' crazy 'steady clappin' off\nGettin' life before they get pussy\nCause ain't nobody love'em so they lives get took'en\nLocked in cages, have'em fighting over cookies\nAnd lunch trays, just happy them days ain't never killed 'em\nYeah, I remember, it was a hot December\nNiggas die on top of winter\nCause them kids need them toys\nWell, Santa Claus don't see them boys\nOr see the girls around here, there's Jack boys down stairs\nNo man with the big bag, just man with the big gat\nTry and take your shit back cause he feel the world owe 'em\nAnd his daughter want a Barbie bike for Christmas\nHe goin' show her, that the love is there, no mother there\nJust her little brother there\nWe wash our pain with Belvedere\nAnd use the drugs they brung us here\nWe get high to get by, hot dogs, no ribeyes\nWith tears drip from red eyes\nWhen ends don't meet the dead lines\nThe D.A. said she hate me, but I don't understand\nWhen I just rock the show in front of 50,000 fans\nI think that bitch racist, she probably in the Klan\nShe take her pain out on me, but she probably need a man\nI took my mom from public housin', put her in the sticks\nWe came a long way from welfare and gettin W.I.C\nThat shit just made me hungry\nAnd now we gettin' rich, and all these niggas gettin' sick\nI know they wanna get me hit cause I'm ballin'\nYeah, cause I'm ballin'\n\n[Outro]\nIt's like sometimes I always gotta let these type of joints go man\nJust speakin' to the streets\nThat bitch said she hate me\nI felt some type of way about that\nLast night we just came out\nGiving 2, 3 hundred pair of shoes to the schools\nTo the girls and the boys basketball teams\nHow you hate me?\nYou hate me cause I'm doin' what I'm suppose to do'\nAnd I got that money and I'm making more money than you\nWell, bitch you can hate me for that\nLet's get it", "image": "https://images.genius.com/a7bc28c05034136e861be4c94601d20a.500x500x1.jpg"}], "artist": "Meek Mill"}