{"songs": [{"title": "Did Ya Say That?", "album": "Legend of the Liquid Sword", "year": "2002-12-10", "lyrics": "[Verse 1]\nI keep your heart is PZA-pumping, the beat is just the jump in\nThe crowd get wild off my style, they want something\nThe herds start stomping the promoters that be fronting\nThey sue for Cash Rule but the courts they give 'em nothing\nYour soundman came with the feedback like we need that\nSecurity's shining flashlights like \"where the weed at?\"\nStay in your place, see you guys smoke blowing in your face\nAnd it's hard to stop it once we came to drop it\nWho bold enough to challenge this deadly reportation\nOf keeping MC's in a hopeless situation\nNo comparison, if you put the darts side by side\nOne will weigh out the other\nLike friend next to brother\nTry to take cover as the battle comes to a closion\nThat structure that supported your rap started implosion\nYour whole chest and your world caved in\nThey completely gave in, they was far from brave men\n\n[Hook 2X: GZA]\nDid ya say that?\nRecord execs wanna push the album way back?\nAnd hold out on my advance?\nThey didn't pay that\nProducers want seven points?\nHe didn't play that\nYo did he say that?\nDid ya say that?\nRecord execs wanna push the album way back?\nAnd hold back my advance?\nThey didn't pay that\nProducers want seven points?\nHe didn't play that\nYo did he say that?\n\n[Verse 2]\nRaindrops keep falling on your head\nSo heavy that it's tearing what you're wearing\nAin't caring, so you're hearing what I said\nI'm making sure it stick\nLike a stamp you don't lick\nOr a snare with no kick\nSo you know it be authentic like the hand-made works of a carpenter\nThe 64 squares make 'em use a sharpener\nKept a fine point with the lead, then it's thread\nOn the paper then like cancer it would rapidly spread\nThis music is addictive but can't live without it\nAt times you shout it The Wu, they be about it\nA strong following with the die-hard supportedly\nThe loyalty came from the songs that went accordingly\nI couldn't be more wrong if I changed the format\nDid something different from the most explored rap\n\n[Hook]\nDid ya say that?\nRecord execs wanna push the album way back?\nAnd hold out on my advance?\nThey didn't pay that\nProducers want seven points?\nHe didn't play that\nYo did he say that?\nDid ya say that?\nRecord execs wanna push the album way back?\nAnd hold back my advance?\nThey didn't pay that\nProducers want seven points?\nHe didn't play that\nYo did he say that?\n\n[Verse 3]\nPositive Elevation Always Correct Errors\nThat's the fire till my Clansmen starts to spread terror\nSpin your wig back like we DJ'ing, he ain't playing\nMy songs set a trap, catch 'em laying\nNow we stuck but he's overwhelmed by what he came across\nNot to play it is a terrible loss at whose cost?\nPeople wait like never before for the ball to drop\nAt the gate lined up for a tape to cop\nI still run into students banging my first joint\nWrote a essay off the second LP to prove a point\nThat a rhyme is a terrible thing to waste\nGimmicks and radio the God don't chase\nBut I replace your wackness, it shows in your flows\nImmaturenesses, all of your hoes, case closed\nMost of your strength is in the pocket of you clothes\nThat you endorse in every rhyme like it's garments and robes (echo)\n\n[Hook]\nDid ya say that?\nRecord execs wanna push the album way back?\nAnd hold out on my advance?\nThey didn't pay that\nProducers want seven points?\nHe didn't play that\nYo did he say that?\nDid ya say that?\nRecord execs wanna push the album way back?\nAnd hold back my advance?\nThey didn't pay that\nProducers want seven points?\nHe didn't play that\nYo did he say that?\nYo did he say that?", "image": "https://images.genius.com/6eec7781b61d16cab75a144ab36ff78d.500x500x1.jpg"}], "artist": "GZA"}