{"songs": [{"title": "God Is Fair, Sexy Nasty", "album": "The Divine Feminine", "year": "2016-09-16", "lyrics": "[Intro: Kendrick Lamar]\nOpen your legs\nSay yeah, share, say yeah, share, say yeah\n\n[Hook: Kendrick Lamar + Delusional Thomas (Mac Miller)]\nHearts on my timeline, bullet to your rose\nThen I watch your petal fold\nDon't you know your body been mine?\nI know you know I know\nSexy, nasty, have no guideline\nOne day, four times\nYou don't mind that I don't care (pleasure, pleasure...)\nYour divinity has turned me into a sinner\nGod is fair (pleasure, pleasure...)\nAnd your beauty can even make hell have a winter\n\n[Verse 1: Mac Miller + Kendrick Lamar]\nYeah and a freak mind is divine so we fuck from behind\nOn these sides, between thighs, I eat up\nWhy do, why do anything but trust myself?\nTried to give her up but she fuck so well\nMan that bitch so cold, man that bitch so cold\nI'ma take my time, I'ma hit that slow\n'Cause I ain't in a rush young girl\nYou're the only thing for me in this fucked up world\nAnd do you believe in love?\nHold on tight when demons come\nIt'll be alright, no need to run\nStay with me tonight, we'll see the sun\nAnd when we wake up early we'll still be young\nNever felt this free before\nI need you more than keys need doors\nI need you sleepin' next to me\nThe blanket sheets, I'll take them all and keep you warm\nYeah and I teach her that we were the creatures of love\nYou be the leader, I could be Julius Caesar\nWhen I'm pullin' up in the Beamer\nThe beats in the trunk, all the freaks wanna fuck\n\n[Hook: Kendrick Lamar]\nHearts on my timeline, bullet to your rose\nThen I watch your petal fold\nDon't you know your body been mine?\nI know you know I know\nSexy, nasty (sexy, nasty)\nHave no guideline (have no guideline)\nOne day, four times\nYou don't mind that I don't care (pleasure, pleasure...)\nGod is fair (pleasure, pleasure...)\n\n[Verse 2: Mac Miller]\nI need to feel your touch\nYou shy, you don't reveal too much\nNo lies, don't hide yourself at all\nWith you, I just can't help but fall\nIt's true, and I'll try everything\nGirl you're, my sexy nasty, thing\nShe been getting faded all the time, flap your wings\nI been getting stoned all week\nIt make me go too deep\nGirl you so lonely, will you come home with me?\nJust take your clothes off babe\nKnow that we been talkin' on the phone all day\nI love it when you tell me that you don't behave\nTell me when and where, I bet I won't be late\nAll I really wanna do is procreate\nI'm a Superman, you'll be my Lois Lane\nKnow you late for work, you stayin' home today\nWe gon' keep on goin' 'til our bones both break\nIt's the grown folk way, yeah\n\n[Hook: Kendrick Lamar]\nHearts on my timeline, bullet to your rose\nThen I watch your petal fold\nDon't you know your body been mine?\nI know you know I know\nSexy, nasty (sexy, nasty)\nHave no guideline (have no guideline)\nOne day, four times\nYou don't mind that I don't care\nGod is fair\n\n[Piano Interlude: Robert Glasper]\n\n[Outro]\nHello, I would like to tell you about my love affair with my husband and the wonderful ways that we were able to understand each other and find out about each other. We got to know each other little by little living very close in the same building and he would help me with things and I would see him and think \"what a cute guy\" and he was a cute guy. And it was just little by little we got to know, just to say hello. One day I invited him to a party and I had heard so much about him, people respected him, and he was good to everybody, he knew, people he worked with all adored him. And it was something so important, the respect that you have for somebody, for me was the most important. Being attracted to him and being...finding people respected him and I respected him. I love the fact that he sensed how my feelings were, and I learned to understand and respect and see his feelings and understand his feelings ahead of time...\n\nSo, it was so very easy to be together and look forward to being together and our love affair just blossomed the more we saw each other and the more we were together, we learned more and more about each other. After a short period of time we became engaged and had a very small intimate wedding with just family and very close friends, the friends we continued to have for the rest of our life and then came two adorable little boys. And...my husband just adored my daughter and adored the two boys, and I feel I just gave him a wonderful life. A good marriage and a wonderful family and I know he really had a beautiful life and I did too. And how important it is to love, respect and care for each other.", "image": "https://images.genius.com/ad3289c77ccbc5156d26ed73b3dce45b.620x620x1.jpg"}], "artist": "Mac Miller"}