{"songs": [{"title": "Ocean Within", "album": "Slam: The Soundtrack", "year": null, "lyrics": "[KRS-One]\nWord..\nSonja.. you know you saw her in the movie\nAnd my man Saul, he's like THIS!\n\n[Saul Williams] * singing *\nThere is no ocean like the one, within\nLook to the moon rise with the tides, and swim\n(repeat 4X)\n\n[KRS-One] * speaking while Saul sings *\nUh-huh, yeah, yeah\nKRS-One, coming through.. like this\nUh-huh, do it, do it like that, like that\nUh, uh-huh\n\n[Saul Williams] * sings first two lines *\nSaul the road to Damascus, come follow me\nThe serpent swallow the moon, but it won't, swallow me\n(Yeah, speak the word!)\nIntellect is like a major city\nLaden with concrete, metal\nAdvanced modes of transportation\nShining buildings, and fenced in parks\nSpirit is the mountain's forest wilderness\nAnd vast countryside that surrounds it\nToo many people live in the city\nStruggling day to day for mere existance\nMost have forgotten how to live off the land\nThey only experience nature on class trips\nAnd short-term vacations\nFor those that live in the country\nCities are like amusement parks with high prices\nAnd temporal satisfaction\nAt the end of the day, they are tired\nAnd ready to go home, and relieve their ringing ears\n\n[Saul Williams] * singing *\nThere is no ocean like the one, within\nLook to the moon rise with the tides, and swim\n(repeat 2X)\n\n[KRS-One]\nUh-huh, speak the word\nHyper-accelerated meditations talk\nThe reversal of this word dispersal is thought\nThere is no difference between thought and talk\nLike the blackboard chalk and homicide chalk\nThey both give outlines\nOne is designed to outline the mind\nThe other outlines the body after a crime\nCould it be that these two chalks are connected;\nMeaning the body gets outlined when the mind is neglected --\n-- or poorly directed\nLike the teacher with the chalk\nOr is the teacher the beginning of the homicide we talk?\nBe selective in your speech\nCause the chalk of the two technical teaching has taught each\nKnowledge Reigns Supreme Over Nearly Everyone\nNearly every daughter, nearly every son\nIgnorance reigns supreme for some\nThey chase the sum, inviting the I-R-S to come\nMake the connection, choose your direction\nUse your protection when sexin AND hexin\nThings come back cause they really never left\nIf the secret to meditation is found in the breath\nThen speech is another form of meditativeness\nWhattya say to this latest rhyme or poem?\nSome have been known to quite the mind through\nOHHHHHHHHHHHMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM", "image": "https://images.genius.com/2eda58ee0adb9d194b1c6b8bf821922c.500x500x1.jpg"}], "artist": "KRS-One"}