{"songs": [{"title": "​iSay", "album": "KHALIFA", "year": "2016-02-05", "lyrics": "[Intro: Wiz Khalifa]\nIt's KK what I'm smoking nigga\n\n[Verse 1: Wiz Khalifa]\nAnd I done popped so many bottles think I'm through with it\nBeen smoking so much weed in public owners cool with it\nBeen on my grind since I was young and now I'm stupid rich\nYou niggas stupid, I'm in the club and it's ruthless\nMy crew ain't part of that bullshit\nMy new whips the hardest\nWalk in the office like a business man\nI'm just an artist\nSmoking and all, crib full of weed\nPlaques on the wall\nMy face on all the magazines\nKush in this jar I'm getting this cheese\nPants skinny rubber bands plenty\nWhole team going hard like it's the last inning\nWhole team going hard you got no chance of winning\nLot of seats on the floor lot of cash pending\nI play the game left hand like my man Jimi\nYou just a right hand man call that man Semmi\n\n[Hook: Wiz Khalifa]\nWhat can I say?\nWhat can I do?\nTo show how much\nReal shit a nigga do\nWhat can I say?\nWhat can I do?\nTo show how much\nReal shit a nigga do\n\n[Verse 2: Wiz Khalifa]\nAll of this off the internet\nThose who ain't seen it coming dog I been a threat\nBeen smoking up all this weed\nBeen rolling up while I drive\nBeen to the bottom and back\nBeen seen you haters disguised\nNiggas telling me lies\nJust to try to get close\nShades cover my eyes cause I be higher than most\nBeen on the plane for twenty hours, and wasn’t tired\nLive by the code, money power\nOnce I got on, my niggas hired\nJuicy J he ride, it’s the gang or die\nThe game will stress you out but that’s what this dubie is for\nYou acting like you know me now\nNever knew me before\nSnoop sat me down, school me even more\nKick it with my son and don’t even do the awards\nSaid next year I might win me one\nYou got problems don't lend me none\nGot a pound then go send me one\n\n[Hook: Wiz Khalifa]\nWhat can I say?\nWhat can I do?\nTo show how much\nReal shit a nigga do\nWhat can I say?\nWhat can I do?\nTo show how much\nReal shit a nigga do\n\n[Verse 3: Juicy J]\nNiggas out here broke because they scared of that bread\nMy money so old I got mold on that bread\nHow you think I went and copped that Rolls-Royce Corniche?\nTurn around and bought a Maybach next week\nA nigga don't hustle then a nigga don't eat\nA nigga ain't paying fair, and life ain't cheap\nNigga ain’t shit sweet but this box of swisher sweets\nEver since I was a youngin I was\nGetting it in the streets\nNow I'm on tour even getting it overseas\nAll the way in Switzerland stacking swisser-cheese\nI ain't too good for that brown paper bag\nI can still move that work and I get it off fast, hoe\n\n[Hook: Wiz Khalifa]\nWhat can I say?\nWhat can I do?\nTo show how much\nReal shit a nigga do\nWhat can I say?\nWhat can I do?\nTo show how much\nReal shit a nigga do", "image": "https://images.genius.com/329866c1bd0be13efe2300615c0293e5.1000x1000x1.jpg"}], "artist": "Wiz Khalifa"}