{"songs": [{"title": "My Type", "album": "T.I. vs T.I.P.", "year": "2007-07-03", "lyrics": "[Intro]\nLet's go (ay, ay, ay, ay, ay.. ay, ay, ay)\nY'all gon' wish for a nigga like me when I ain't here\nYa know what I'm sayin'? (Think I'm lyin)\nSay goodbye to the bad guy!\nYou don't appreciate a nigga my type\nOnce I die ain't no mo' niggas my type\nSo just remember me right (you ain't gotta worry 'bout me no mo')\nJust remember me right, hey just remember me right\nHey just remember me right, just remember me right\n(But you gon' see is far worse than out there, hey!)\n\n[Hook: T.I.]\nBet you don't appreciate a nigga my type\nCause when I die ain't no mo' niggas my type, so just remember me right\nBet if I let them suckas kill me tonight\nAll them haters gon' be filled with delight, God forgive me, aight?\nI sacrifice so they could live my life\nIf necessary I'd give my life, so what you here in my life\nReputation decorated with stripes\nNo need for cryin at the end of my life, hey just remember me right\n\n[T.I. - over Hook]\nYou'll see...\nI see you laughin, AY!\nI did this shit for you nigga, it's all good\nHey! You know me homie, ay\n\n[T.I.]\nWhen your back was against the wall remember where could you go\nRemember who helped you again like he helped you befo'\nWent out they way to let you know that you ain't ever alone\nThey disrespect you, you come get who 'til they left you alone\nHe taught you, how to be weak, he taught you how to be strong\nTaught you not to accept defeat, you go all out or be gone\nBet it ain't, the same in the streets now that he gone\nHe now in heaven on the throne exactly where he belong\nNow he left millions devastated and his family mourned\nSons turn to grown men since they daddy been gone\nDaughters grew, like him or not he left his family on\nEven prepaid the funeral service he had in the dome\nAnd there they came to represent, for a stand-up gent\nWho walked it like he talked it, always said what he meant\nImpossible to stop him, had a head like cement\nMaybe now you'll appreciate a nigga like this (they might)\n\n[Hook]\n\n[T.I. - over Hook]\nAin't gon' be no mo', remember me how I was baby\nI can see you still laughin right now, HEY!\nI made it possible homie\nBut I die for it, it's all good man\nStrong got to lead the weak! Ay\n\n[T.I.]\nIf they had only knew the man outside of the hype\nNo matter what the situation he always try to do right\nStill they gossip to told lies, used to take him for granted\nOften find it hard to relate, somehow they can't understand it\nCause that respect he gon' demand, if there's a problem he handle\nLook adversity in the eye, he never ran from a challenge\nThey tried to knock him off balance when the Feds came and got him\nDid the time on his head, came home, that ain't stop him\nThat's why them niggas used to hate him but they girl used to jock him\nSwear he had the kind of swagger made the world stop and watch him\nPlus he possess so much hustle made it impossible to top him\nGot better every album, haters hate to see him drop 'em\nThey just talk shit from a distance, when he around they playin possum\nHe used to scare them suckas shitless that's probably why them niggas shot him\nAnd what it took ain't nothin else they ever could or did about it\nSo go on, talk shit about him, least you ain't forgot about him\nI see\n\n[Hook]\n\n[T.I. - over Hook]\nYou'll see! Ain't no more of me man\nHey, hey, hey!\nEnjoy, I did this man\nThat's how I just put the weight on my shoulders\nI carry the load baby, I'm used to it\nI'm built for it! AY!\n\n[T.I.]\nWanna say sorry to my momma, King and Lil' Mama\nSee me go through so much drama, you could stand a lil' thunder\nNever let 'em see you sweat, stay cool as a cucumber\nStay ready for whatever, make 'em know I'mma do wonders\nHow he died? On his feet like a man with honor\nShowed you the sky was the limit, you could do whatever you wanna\nThat's for Bubba and Domani, Deyjah and Neek-Neek\nDon't worry 'bout me, Uncle Phil and Leiah's with me\nSee me wit'cha granddaddy - I know you gon' miss daddy\nBut life ain't always a dream, and horrible shit happens\nHate I let a nigga kill me before I could quit rappin\nAnd get to spend mo' time wit'cha, I know we'da been happy\nBut I had to take in them chances, you probably woulda been trappin\nLong as I could keep that from happenin, ya pappy can die happy\nJust keep the wind at ya back, and the sun at ya face\nRemember winnin in your blood, you were born with what it take, okay?\n\n[Hook]\n\n[T.I. - over Hook]\nHey, that's it for me\nHey, I bet you'd love that, wouldn't you?\nI did this for y'all man\nYou know ain't no favorite man\nMan fuck this shit partner, HEY!\n\n[Outro]\nHey y'all, with all my heart I apologize man I'm sorry\nI tried, I did everythang I could man, y'knowmsayin?\nThere was just more of them than there was me, ya dig?\nThey say you can't win 'em all\nBut shit man, I gave them niggas hell long as I could though bruh\nHeh, and you could put the money on that, HEY!", "image": "https://images.genius.com/2f70d0ed3d87a3cc476cfb530ff86686.600x600x1.jpg"}], "artist": "T.I."}