{"songs": [{"title": "Got Your Money", "album": "Nigga Please", "year": "1999-09-14", "lyrics": "[Intro: Ol' Dirty Bastard]\nI dedicate this to all the pretty girls\nAll the pretty girls in the world\nAnd the ugly girls too\n‘Cause to me you're pretty anyway, baby\n\n[Verse 1: Ol' Dirty Bastard]\nYou give me your number, I'll call you up\nYou act like your pussy on interrupt\nI don't have no trouble with you fucking me\nBut I have a little problem with you not fucking me\nBaby, you know I'ma take care of you\n‘Cause you say you got my baby, and I know it ain't true\nIs it a good thing? No it's bad, bitch\nFor good or worse, makes you switch\nSo I walk on over with my Cristal\nBitch-ass niggas, put away your pist-als\nDirty won't be having it in this house\n‘Cause, bitch, I'll cripple your style!\nNow that you heard my charming voice\nYou couldn't get another nigga, coochie won't get moist\nIf you wanna look good and not be bummy\nGirl, you better give me that money! Aow!\n\n[Hook: Kelis]\nHey, Dirty!\nBaby, I got your money\nDon't you worry, I said hey!\nBaby, I got your money\n\n[Verse 2: Ol' Dirty Bastard]\nSo I glanced at the girls, girls glanced at me\nI whispered in their ear: \"Wanna be with me?\"\nYou wanna look pretty though, in my video\nOl' Dirty on the hat and I let you all know\nJust dance if you caught up in the holy ghost trance\nIf you stop I'ma put the killer ants in your pants\nI'm the O-D-B as you can see\nF.B.I., don't you be watching me\nI don't want no problems, ‘cause I'll put you down\nIn the ground where you can not be found\nI'm just Dirt Dog trying to make some money\nSo give me my streaks and give me my honey!\nRadios play this all day, everyday\nRecognize I'm a fool and you love me!\nNone of you, NUH, better look at me funny\nNUH, you know my name, now give me my money!\n\n[Hook: Kelis]\nHey, Dirty!\nBaby, I got your money\nDon't you worry, I said hey!\nBaby, I got your money\n\n[Over the hook]\nSing it! Sing it, girls!\nJust shake it right now!\nIf Dirty want his money\nI think y'all should give him his money\nThat's how I like you, girl!\n\n[Verse 3: Ol' Dirty Bastard]\nNigga playing in the club like this all night\nBitches put your ass out, let me hold it tight\nYou looking at my wrist saying \"It's so nice!\"\nThe price bitch is diamonds, shining disco light\nWell, you better help me solve my problem\nOr I'ma get this money and rob them\nLucky Dog when I won the Lotto\nRan up on my car for carrying Rollo\nBut hold on, you can call me Dirty\nAnd then lift up your skirt\nAnd you want some of this Dirty\nGod made Dirt and Dirt bust your ass\nStop annoying me! Yeah, I play my music loud\nIt takes the Bastard – Ol' Dirty – to move the crowd\nThey say, \"He had his dick in his mouth.\"\nEddie Murphy taught me that back in the house\nNow give me my money!\n\n[Hook: Kelis]\nHey, Dirty!\nBaby, I got your money\nDon't you worry, I said hey!\nBaby, I got your money\n\n[Hook: Kelis]\nHey, Dirty!\nBaby, I got your money\nDon't you worry, I said hey!\nBaby, I got your money\n\n[Hook: Kelis]\nHey, Dirty!\nBaby, I got your money\nDon't you worry, I said hey!\nBaby, I got your money\n\n[Hook: Kelis]\nHey, Dirty!\nBaby, I got your money\nDon't you worry, I said hey!\nBaby, I got your money\n\n[Hook: Kelis]\nHey, Dirty!\nBaby, I got your money\nDon't you worry, I said hey!\nBaby, I got your money\n\n[Outro: Kelis]\nHey, Dirty!\nBaby, I got your money\nDon't you worry, I said hey!", "image": "https://images.genius.com/80138c0168d640cc86229d4d232c07f1.600x510x1.jpg"}], "artist": "Ol’ Dirty Bastard"}