{"songs": [{"title": "We Don’t Play That Pussy Shit", "album": null, "year": null, "lyrics": "[Verse 1]\nIt ain't good to do good in front of niggas in the hood, right?\nIt ain't good to do good in front of niggas in the hood, right?\nEverybody know that\nDoing good in front of niggas in the hood cause problems\nTreys, trey pounds, and four-fours solve em (you ain't lying!)\nI hate when hoes get on some loudmouth shit\nYour man gangster? Me too -- go on, get him, bitch!\nI just bought a new toast to spit\nNext nigga getting gully getting laid out quick\nWherever ribs is touching, niggas is getting hurt\nCause a broke nigga always down to put in work\nDon't run up on me -- I don't know you, nigga\nSo what you bought my CD? I don't owe you, nigga\nI know you love the way the Audi's beat bumps\nGot your license plate rattling all over your trunk\nI confuse these chumps with my style, dog\nI'm from Queens, but I'm motherfucking B.K. hard\nI sound like I move bricks Uptown\nBut like a thug from the Bronx, I stay with the four pound\nShook nigga -- I'm a Guinness Book nigga\n\n[Hook]\nWe don't play that pussy shit round here\nYou can get your fucking wig split down here\nDon't go repping where you come from too much around here\nYou can get your fucking cap peeled -- Queens, nigga!\n\nWe don't play that pussy shit round here\nYou can get your fucking wig split down here\nDon't go repping where you come from too much around here\nYou can get your fucking cap peeled -- Brooklyn!\n\n[Verse 2]\nIf I can't get my gun in the club, why would I come in the club?\nSo niggas I done stuck up could cut me the fuck up?\nNah, I'm outside to jump off when they finished, G\nFour deep, strapped with all kinds of heat\nNiggas think they want beef; they don't want beef\nThey find out when somebody they love laying in the street\nWhen you rap, you keep it gangsta, dog -- it's all good\nBut don't go popping that shit in my old hood\nWhere I'm from, a young boy'll come and try you, nigga\nShells'll have you feeling like you on fire, nigga\nIf you thinking we thirsty, cuz, you right\nWe looking at your watch and chain like that's a S-type\nPromoters saying, \"Don't play 50 in the club\nLast time he came on, niggas tore shit up\"\nWhat! I don't know where you from and I don't care\nBut, nigga, we don't play that pussy shit around here\n\n[Hook]\nWe don't play that pussy shit round here\nYou can get your fucking wig split down here\nDon't go repping where you come from too much around here\nYou can get your fucking cap peeled -- Harlem, nigga!\n\nWe don't play that pussy shit round here\nYou can get your fucking wig split down here\nDon't go repping where you come from too much around here\nYou can get your fucking cap peeled -- BX!\n\n[Verse 3]\nThe only Spanish I know is, \"Go on your guita la boca, puta\"\n\"No inglés, no inglés\", motherfuckers'll shoot ya\nThe Latin Kings don't like me, I don't care\nWe don't talk that \"Mira, mira\" bullshit around here\nMan, I done did so much dirt in the hood\nNiggas heard I got shot, they was all saying, \"Good!\"\nFuck y'all, y'all ain't got to like me\nI get knocked, y'all niggas ain't got to write me\nI'm on the same bullshit I been on\nIt's the same bullshit y'all niggas need to get on\nY'all shit sound too commercial\nCome cruising through the hood, motherfuckers'll hurt you\nYou should know where and where not to flash jewels\nCause nigga's run up on y'all fools and flash tools\nThey want the money, the watch, and your tennis shoes\nI ain't gotta tell you not to move -- you know the rules\n\n[Hook]\nWe don't play that pussy shit round here\nYou can get your fucking wig split down here\nDon't go repping where you come from too much around here\nYou can get your fucking cap peeled -- Staten Island!", "image": "https://images.genius.com/3ac0369e9af7e95b4d1574832fafebfe.430x430x1.jpg"}], "artist": "50 Cent"}