{"songs": [{"title": "Twerk It (Megamix)", "album": null, "year": "2013-01-01", "lyrics": "[Intro: Tosh]\nYO! YUH DUN KNOW!\nTHIS TIME WHEN WE COME IN WE COME FI FLATLINE\nEVERYTING INNA THIS BUMBOCLAAT 'TIL CLASH DUN!\nFI REAL!\n\n[Verse 1: Busta Rhymes]\nBig man, yes we deh 'bout, hear weh mi a talk\nMad ting, nuh seh nuttin watch how dem gyal a walk\nThis direction, fi wi section tun up time now\nTwerk it twerk it, see di remix ago dun dem now\n\n[Interlude: Tosh & Vybz Kartel]\nHEAR A! A TUN UP TIME NOW!\nBUSTA WID DI WORL BOSS!\nKartel mi seh, gaza come afta\nCau widout Kartel there's no bloodclaat Gaza\n\n[Verse 2: Vybz Kartel]\nHey gyal come twerk it twerk it\nSiddung pon it come work it work it\nMy long dick neva short circuit\nBig batty gal bare man a observe it\nMi nuh need nuh space fi mi wey now\nWine to di song dun wine 'til it playback\nLook inna mi eye and count every teardrop stop! (FI-FI-FI REAL!)\nBoom pon di buddy boom di buddy gyal\nTun backway fi di booty massage\nTwerk it gyal yuh large and in charge\nBaby yuh batty big like, Nicki Minaj\nBOOM BOOM BOOM! Di earth shake\nWhen yuh drop dung low yuh mek di earthquake\nPunaany wet, punaany wet\nPunaany wet like Michigan lake (YUH DUN KNOW!)\nAll Toronto gyal dem a wine pon Drake\nJust like ova di island bake\nGyal seh mi sweet like chocolate cake\nI fuck dem leave dem what a heartache\nRichie Feelings, play this\nMek every hot gyal a Portmore hear this\nBusta Rhymes weh di gyal dem seh\nWhen di gyal dem a wine and do\n\n[Chorus: Busta Rhymes]\nShe haffi twerk it twerk it twerk it twerk it\nTwerk it twerk it twerk it twerk it\nTwerk it twerk it twerk it twerk it\nTwerk it twerk it twerk it twerk it\nTw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw\nTw-Tw-Tw-Tw-Tw-Tw-Tw-Twerk it-Tw-Tw-Tw-Tw-Tw-Twerk it\n\n[Verse 3: Ne-Yo]\nIf I may, let me say\nYou gotta that kinda booty make, we want pay, a bill or two\nI'm talkin rent, where you stay\nUtilities included just keep movin that way (FI-FI-FI REAL!)\nThrowin it, rapid pace\nThen turn around and wind it like she from Jamai-ca\nLord have mer-er-er-er-er-ercy!!!\nLove the way she lookin back at it makin that face\nShorty yuh dun know, what I do to it\nThat girl for gettin me rock hard watchin her do it\nShe wine like a champion, rom pom pom pom pom\nCenter of, attention when she workin that tundra\nShorty haffi...\n\n[Chorus: Busta Rhymes]\nShe haffi twerk it twerk it twerk it twerk it\nTwerk it twerk it twerk it twerk it\nTwerk it twerk it twerk it twerk it\nTwerk it twerk it twerk it twerk it\nTw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw\nTw-Tw-Tw-Tw-Tw-Tw-Tw-Twerk it-Tw-Tw-Tw-Tw-Tw-Twerk it\n\n[Verse 4: T.I.]\nDrop it down, hey country burn it by the pound\nPussy lock it down, say who ain't ballin stop it now\nBitch I know how they round, it ain't no squares off in my circle\nBitch bet get it straight, won't serve you less you movin weight (FI-FI-FI REAL!)\nFresh outta section eight, peruvian flakes on my plate\nWe got the freshest shade, in my hood e'ryday a yellow tape\nIn front of murder scene (BANKHEAD!), land of anarchy murder kings\nWanna murder king? Tell Maino bring them dirty things (YUH DUN KNOW!)\nAny borough bring, thirty chopper thirty beams\nWith extended clip, hop out the ride and let it rip\nWho wanna play with Tip? I rob and make a nigga strip\nRight there on the strip, shed light then bitch you wanna trip\nTell 'em...\n\n[Chorus: Busta Rhymes]\nShe haffi twerk it twerk it twerk it twerk it\nTwerk it twerk it twerk it twerk it\nTwerk it twerk it twerk it twerk it\nTwerk it twerk it twerk it twerk it\nTw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw\nTw-Tw-Tw-Tw-Tw-Tw-Tw-Twerk it-Tw-Tw-Tw-Tw-Tw-Twerk it\n\n[Verse 5: Jeremih]\n(Tw-Tw-Twerk it) Twerk it (Twerk it) Twerk it\n(Twerk it) Twerk it (Twerk it) Twerk it\n(Twerk it) Twerk it (Twerk it) Twerk it\n(Twerk it) Twerk it (Jeremih!)\nBaby won't you, come here girl and twerk it\n(HEY! HEY! HEY!) (Twerk that ass girl) (FI-FI-FI REAL!)\nDreams about that, body, it's twerkin'\n(HEY! HEY! HEY!) (Twerk-Twerk-Twerk that ass girl) (YUH DUN KNOW!)\nTwerk that thang for me, lookin back on me\nShawty got a donkey, now come and ride this pony\nShe can handle it, by just lickin her lips\nI'll tell her don't talk, and hope she take the....\nLook at them titties\nNow that's a flashback\nGot damn that ass fat! spendin all my ASCAP'S\nPlease just go 'head twerk it, cause don't know how to work it\n9 to 5 you work it, off that off that twerkin\n\n[Chorus: Busta Rhymes]\nShe haffi twerk it twerk it twerk it twerk it\nTwerk it twerk it twerk it twerk it\nTwerk it twerk it twerk it twerk it\nTwerk it twerk it twerk it twerk it\nTw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw\nTw-Tw-Tw-Tw-Tw-Tw-Tw-Twerk it-Tw-Tw-Tw-Tw-Tw-Twerk it\n\n[Verse 6: French Montana]\nHey boss, you know you would hear that \"Haan!\"\nYou know the repertoire know we pop the ace no debit card\nCoke Boyz, Busta that's my dog no reservoirs\nSick grain talkin big chains I got seven on\nBig moves carry big tools talkin Lebanon\nRide with killers smokin on that loud but they very calm\nCome her girl shake it on the pole it's a heavy storm\nMore ya talk, got your main girl with her titties shown\nShe's straight, eatin cheesecake with, Diddy Combs\nLikkle man, don't be talkin crazy off the liquor mon\nBig mouth, bought a big house, ten acre mon (YUH DUN KNOW!)\nShine! Dutty Wine it, Tony Matterhorn\nCoke Boyz, E. Ali (FI REAL!) my niggas forever shine\n\n[Chorus: Busta Rhymes]\nShe haffi twerk it twerk it twerk it twerk it\nTwerk it twerk it twerk it twerk it\nTwerk it twerk it twerk it twerk it\nTwerk it twerk it twerk it twerk it\nTw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw-Tw\nTw-Tw-Tw-Tw-Tw-Tw-Tw-Twerk it-Tw-Tw-Tw-Tw-Tw-Twerk it", "image": "https://images.genius.com/54314abfbbbf16253d72455428cc44e6.834x834x1.jpg"}], "artist": "Busta Rhymes"}