{"songs": [{"title": "Get Right", "album": "No Genre Pt. 2", "year": null, "lyrics": "[Produced by Sonny Digital]\n\n[Intro: B.o.B]\nMan, I'm 'bout to get right\nMan, I'm 'bout to get right\nTrip, trip, dead light\n\n[Hook: Mike Fresh] x8\nEverybody, get right\nI'm 'bout to get right\n\n[Verse 1: B.o.B]\nYeah, J, I'm 'bout to get right\nYeah I'm 'bout to twist off, I'm 'bout to lift off, I'm 'bout to take flight\nFlyin' with the brakes off so don't blow my buzz and don't kill my vibe\nAnd you ask me is this the way I feel or is it still just a high\n(is it still just a high)\nThere goes my imagination again\nThere goes my thoughts, away with the wind\nThere's no medication amazing as this\nYour favorite fragrance, your favorite spliff\nAs real as they come, for niggas like us\nWhere days where the fakers get fake as they get\nWe take us a hit\nWe just be coolin', you lookin' anxious as shit\nI know they see me, doin' my thang\nI go too many places to trip\nThis shit I'm on, this shit so strong\nYou could take 20 vacations per hit\nMan, ain't nobody as faded as this\nMan, ain't no life as outrageous as this\nAnd I would pull out my resume\nBut it's too many pages to flip\n\n[Hook: Mike Fresh] x8\n\n[Verse 2: Mike Fresh]\nEverybody's got that vice\nEverybody need what they need to get right\nI won't judge you, so don't judge me\nWhen you see me cranberry moonwalkin' my Sprite, all right\nFuckin' with Fresco, you smokin' the best dope\nYou been workin' all day, it's time to let go\nSo what, we high? So what, we drunk?\nAnd if we run out, it's nothin' to get more\nLivin' my life one day at a time\nTryna get right one play at a time\nYou never can predict what I'm gonna do next, No Genre\nI ain't finna stay off in a line\nIf I had it my way, I'd ball everyday\nHit the mall everyday\nGo through 100K, and put it all in the safe\nWhat the hell are celebrations for?\nDrinkin' moonshine out a mason jar\nPatron margaritas, pretty señoritas\nBringing me everything I need like, \"Si Señor\"\nYou could pull up to the kick back\nBut you better have a six pack or somethin'\nYou don't wanna be the one empty handed\nWhen everybody ask, \"Where the liq at?\"\nGet right\n\n[Hook: Mike Fresh] x8", "image": "https://images.genius.com/07af9b12b2956baf31b88d2ae47697d2.500x500x1.jpg"}], "artist": "B.o.B"}