{"songs": [{"title": "Mathematics", "album": "Black on Both Sides", "year": "1999-08-02", "lyrics": "[Produced by DJ Premier]\n\n[Intro]\nBucka-bucka-bucka-bucka-bucka-bucka, haha!\nYou know the deal; it's just me, yo\nBeats by Su-Primo for all of my people, Negroes and Latinos\nAnd even the gringos\n\n[Verse 1]\nYo, check it\n1 for Charlie Hustle, 2 for Steady Rock\n3 for the forth-coming live future shock\nIt's 5 dimensions, 6 senses\n7 firmaments of heaven and hell\n8 million stories to tell\n9 planets faithfully keepin' orbit, with the probable 10th\nThe universe expands length\nThe body of my text possess extra strength\nPower-lift the powerless up out of this towering inferno\nMy ink so hot it burn through the journal\nI'm blacker than midnight on Broadway and Myrtle\nHip-Hop passed all your tall social hurdles\nLike the nationwide projects-prison-industry complex\nWorking-class poor, better keep your alarm set\nStreets too loud to ever hear freedom ring\nSay evacuate your sleep, it's dangerous to dream\nFor ch-ching, cats get the \"cha-pow!\" You dead now\nKilling fields need blood to graze the cash cow\nIt's a numbers game, but shit don't add up somehow\nLike I got 16 to 32 bars to rock it\nBut only 15% of profits ever see my pockets\nLike 69 billion in the last 20 years\nSpent on national defense, but folks still live in fear\nLike nearly half of America's largest cities is one-quarter black\nThat's why they gave Ricky Ross all the crack\n16 ounces to a pound, 20 more to a ki\nA 5 minute sentence hearing and you're no longer free\n40% of Americans own a cell phone\nSo they can hear everything that you say when you ain't home\nI guess Michael Jackson was right, you are not alone\nRock your hardhat, black, 'cause you in the Terrordome\nFull of hard niggas, large niggas, dice-tumblers\nYoung teens and prison greens facing life numbers\nCrack mothers, crack babies, and AIDS patients\nYoung bloods can't spell but they could rock you in PlayStation\nThis New Math is whipping motherfuckers' ass\nYou want to know how to rhyme, you better learn how to add\nIt's mathematics\n\n[Hook]\n\"The Mighty Mos Def\"\n\"It's simple mathematics\"\n\"Check it out\"\n\"I revolve around science\"\n\"What are we talking about here?\"\n\"The Mighty Mos Def\"\n\"It's simple mathematics\"\n\"Check it out\"\n\"I revolve around science\"\n\"What are we talking about here?\"\n\"Do your math, do your math\"\n\"1, 2, 3, 4\"\n\"What are we talking about here?\"\n\n[Verse 2]\nYo, it's 1 universal law, but 2 sides to every story\n3 strikes and you biddin' for life, mandatory\n4 MCs murdered in the last 4 years\nI ain't trying to be the 5th when the millennium is here\nYo it's 6 million ways to die, from the 7 deadly thrills\n8-year-olds getting found with 9mils\nIt's 10 PM, where your seeds at? What's the deal?\nHe on the hill pumping krills to keep they bellies filled\nLight in the ass with heavy steel, sights on the pretty shit in life\nYoung soldiers trying to earn their next stripe\nWhen the average minimum wage is $5.15\nYou best believe you've got to find a new grind to get cream\nThe white unemployment rate is nearly more than triple for black\nSome front-liners got their gun in your back\nBubbling crack, jewel theft and robbery to combat poverty\nAnd end up in the global jail economy\nStiffer stipulations attached to each sentence\nBudget cutbacks but increased police presence\nAnd even if you get out of prison still livin'\nJoin the other 5 million under state supervision\nThis is business; no faces, just lines and statistics\nFrom your phone, your Zip Code, to SSI digits\nThe system break man, child, and women into figures\n2 columns for \"Who is\" and \"Who ain't niggas\"\nNumbers is hard and real and they never have feelings\nBut you push too hard, even numbers got limits\nWhy did one straw break the camel's back?\nHere's the secret\nThe million other straws underneath it\nIt's all mathematics\n\n[Hook]\n\"The Mighty Mos Def\"\n\"It's simple mathematics\"\n\"Check it out\"\n\"I revolve around science..\"\n\"What are we talking about here?\"\n\"The Mighty Mos Def\"\n\"It's simple mathematics\"\n\"Check it out\"\n\"I revolve around science..\"\n\"What are we talking about here?\"\n\"Do your math, do your math\"\n\"1, 2, 3, 4\"\n\"What are we talking about here?\"\n\n[Outro]\n(Mathematics, mathematics, mathematics...)", "image": "https://images.genius.com/fb48b17db99d20e6baaeeb962cf997b3.483x479x1.jpg"}], "artist": "Yasiin Bey"}