{"songs": [{"title": "Uh Huh (remix) (produced by J-Love)", "album": null, "year": null, "lyrics": "\"Bus driver -- this here gal refused to give me her seat!\"\n\n[Intro: Method Man]\nEverybody... huh, yeah\nYeah, uh, uh, uh, now, uh, yeah, yo\n\n[Method Man]\nWhat up my people equal?, this be Tical: The Prequel\nShine up the desert eagle, light up that extra lethal\nI mean that \"ooh wee\", three years and two g's\nI'm back with new trees, I wrapped in loose leafs\nWhile ya'll was just rappin', who get the set crackin'?\nJust like a neck snappin', let's get this next platinum\nWhat's happ'n Def Jam? Remember Meth Man?\nI held your hand through them years when ya'll was stressed, fam\nThat's why I still love you and Russell still hustle\nLet's get to pumpin' iron, and flex some real muscle\nUp in this bitch due, my click is Rick Rude\nAnd I ain't got the ivory, this ain't the flick, dude\nSomebody told me, ya'll can't hold me\nNaughty By Nature, do my dirt all by my lonely\nYou need back off bitch, you don't know me\nGot to leave these hoes alone, they too nosey\n\n[Chorus: Method Man]\nMeth is killin', M.C. killin'\nWhat more can I say, stop grillin'\nThat's what niggas get for actin' Hollywood\nAnd since ya'll understood... would you?\nWould you? Would you? Would you?\nUh huh, that dollar day, that dollar dollar day, ey\nThat dollar day, that dollar dollar day, ey\n\n[Method Man]\nOk, the love issue, don't let that love get you\nMy brothers love pistol, doin' they thug dizzle\nBet ya'll ain't know, did you?, that I'm a pro, did you?\nUntil the flow hit you, fuck it, I'm official\nBone wit more gristle, thrown from chrome nickel\nPlace that don't tickle, can't wait to zone wit you\nI'm hard as stone chisel, Meth got his own little\nFormula to go triple -- for shizzle\nYa'll know my occupation, I'm puttin' in the work\nSo any imitation, I'm puttin' in the dirt\nThat shit is aggravatin', why ya'll procrastinatin'\nI got some massive waitin', and she probably masturbatin'\nWelcome to New Yitty, where half is two fifty\nIf I got a problem, then that's one problem too many\nSo don't tempt me, I'll bust until I'm empty\nSwiftly, that way, I get the chance to take you with me, muthafucka!\n\n[Chorus]\n[Method Man]\nYo, I got style, H rap round, back up and back down\nAct up, we back clown, last up to bat now\nIt's me Ticallion, swing like Barry Bonds\nMommy got a ratty thong, happy cuz daddy gone\nTurn it up it a little bit, a notch, and it'll get\nCook it once the griddle gets so hot, good lookin' kid\nOk, now where was I? Prepared, was I\nYour man broke his jaw tryin' to say what I\nSay on this mic, not a day in your life, could ya\nSay I ain't nice, could ya? If I ain't nice, would ya?\nGet off my dick and tell your bitch to come her, she stuntin'\nCan hear me \"cummin'\" like my dick's in her ear or somethin'\nI put that on my momma, she put that on her kids\nHe put that chrome on your dome and blowed ya fuckin' wig\nThat's how it is, ask Bobby Dig'\nWe back on your block, with 'nuff shots to give, muthafucka!\n\n[Chorus 2X]", "image": "https://images.genius.com/fe6629f7a5e6af0aa38ca87547ced96f.1000x562x1.jpg"}], "artist": "Method Man"}