{"songs": [{"title": "Another", "album": "Life After Death", "year": "1997-03-25", "lyrics": "[Intro]\n[Big] Yeah, fuck you\n[Kim] Fuck you too\n[Big] Fuck you bitch\n[Kim] Fuck you motherfucker\n[Big] You ain't shit anyway, fuck you\n[Kim] You ain't shit, you fat motherfucker\n[Big] Yeah, whatever whatever\n[Kim] Whatever\n[Big] You wasn't sayin' that when you was suckin' my dick\n[Kim] You wasn't sayin that when you was eatin my pussy\n[Big] You nasty bitch\n[Kim] You a nasty motherfucker\n[Big] Check it, uhh\n[Kim] Crab ass nigga\n\n[Refrain 1: The Notorious B.I.G.]\nWhat do ya do when yo' bitch is untrue\nYou cut the hooker off and find someone new\nI need another bitch (another bitch), in my life\n\n[Verse 1: The Notorious B.I.G.]\nUh-huh, uhh, uhh\nI know he don't treat you like I treat you\nTime to explain your game is see-through\nSex is lethal, I ain't gon' lie\nMeans to get ya back, I ain't gon' try\nLike this y'all, my girl sucked another nigga dick y'all\nLight skinned with the chromed out six y'all\nThought they was creepin', took trips to V-A every third weekend\nWhile you was sleepin', he hit you on the box\nSixty-nine code non-stop\nShoulda left ya then, but my heart said not\nYou knew too much, the relationship grew too much\nYou knew about the crack vials, means to be trial\nWhere I hid dough under the bathroom tile\nWaited for a while, thought you was my right thing\nThen things got frightenin'\nPeep the scene, sorta like Sam Rothstein\nGuess you Ginger, huh, go figure\nNever thought you could be a gold-digger\nTake my dough and spend with the next nigga\nAsked my man Jigga, my ace boon coon\nTold me cut the bitch off 'fore the shit balloon\nNow I'm like Brandy, Sittin' in My Room\nPissy drunk listenin' to Stylistics tunes\nOr the O'Jays, thinkin' 'bout the old days\nMy nigga's like, fuck that bitch, go play\nBaller, when she beep you, don't call her\nGuess who I seen, that freak bitch Paula\nShe was askin' 'bout ya whereabouts\nHere's the digits, I know you can wear that out\nTear that out the frame, ya game so tight\nWe'll be all fuckin' tonight, knahmean?!\n(I'm fuckin' you toniiight..) feel me? Uhh\n\n[Refrain 2: Lil' Kim]\nWhat do ya do when your man is untrue\nDo you cut the sucker off and find someone new\nI need another man, in my life\n\n[Verse 2: Lil' Kim]\nMmm, uhhh, uhhh!\n'Member when you said you would die for me, shit\nAll of that was just lies to me\nMotherfucker shoulda never said bye to me\nNow you cry for me, like Jodeci\nIt's like that y'all, my nigga hit another bitch from the back y'all\nBlack nasty and mad fat y'all; shoulda seen the ho\nNigga pack your shit, you out the do', ohh\nWhat about the fight in The Mirage?\nI seen ya Benz parked outside my sister's garage\nSaid it was your friend Rog, bullshit\nI ain't gonna keep puttin' up wit the bullshit\nAnd still I, never sweat these bitches\nQ.B. hang like plaques on the wall in your pictures\nScale them fishes, my love is concrete\nStashin' your heat in the passenger seat of the Nautica Jeep\nWe've been down for so long\nStill a bitch like me tryin' to hold on\nTeary eyed, damn a bitch steamin'\nGirls steady screamin', \"Kim you need to leave him!\"\nWhen I testified in court\nCouldn't think straight thinkin' 'bout the bitches I fought\nOver you, nigga have the shit you bought\nAnd fuck you, movin' is my last resort\nYou see, nine outta ten niggas ain't shit\nOne outta five niggas suck a dick\nYou're mad at me, too bad she ain't as bad as me\nShoulda kept the freak bitch off my canapé\nNow you see, ain't no pussy warm as mine\nLong as mine, ain't no love as strong as this\nWhen I sucked your dick, it's like smokin' a roach\nUhh, why go from first class to coach\n\n[Refrain 1: The Notorious B.I.G.]\nWhat do ya do when yo' bitch is untrue\nYou cut the hooker off and find someone new\nI need another bitch (another bitch), in my life\n\n[Refrain 2: Lil' Kim]\nWhat do ya do when your man is untrue\nDo you cut the sucker off and find someone new\nI need another man, in my life\n\n[Refrain 1: The Notorious B.I.G.]\nWhat do ya do when yo' bitch is untrue\nYou cut the hooker off and find someone new\nI need another bitch (another bitch), in my life\n\n[Refrain 2: Lil' Kim]\nWhat do ya do when your man is untrue\nDo you cut the sucker off and find someone new\nI need another man, in my life", "image": "https://images.genius.com/f923892b8bd95f2b330b86e77e9326cb.800x704x1.jpg"}], "artist": "The Notorious B.I.G."}