{"songs": [{"title": "Wit the Shits (W.T.S)", "album": "Championships", "year": "2018-11-30", "lyrics": "[Intro]\nC-Sick, C-Sick, C-Sick\n\n[Verse 1: Meek Mill]\nUh, shawty was frontin', now she throw that pussy at me (Throwin' that pussy)\nTold her meet me at the clearport, she got happy (She got hyped)\nNigga, you don't want these problems, Lil Scrappy (You don't want problems)\nIf you talk, when you see me, just don't dap me, for real\nBack on my savage shit, got that pussy off accident (Yeah)\nFuckin' this ratchet bitch, stay on her knee like Kaepernick, yeah\nI just been havin' it, lovin' this money, I'm passionate, yeah\nOnce I fuck like Meechy, hoe, give you my ass to kiss, pause\nNigga said he hit my hoe, so what?\nNigga, I hit that too, yeah\nShe said she don't swallow, grow up\nThis shit grown-ups do, uh\nI'ma put a check on your bitch ass\nHomie gon' spin back through, yeah\nCatch you on the block while you slippin' with the gang\nTurn your whole shit Piru-ru\nGet some pussy on a plane (On a plane)\nThis the type shit that I do (I do)\nWho your WCW? (Who dat?)\nThe the type of hoes I screw (I screw)\nThis the type of hoes I got (I got)\nNew Hermes flip flops (Sheesh)\nIf ain't got no time for the hoe and I really like her, she'll get a wrist watch (Gang)\n\n[Chorus: Meek Mill]\nDo a split on the dick (Do a split)\nIf you really with the shits, lil' bitch (Lil' bitch)\nShe ask her friends (What?), \"Should I let him hit?\" (What they say?)\nShe say, \"Girl, you better fuck him if he rich\"\nHe gettin' it, bad bitch, hittin' it (Whoa)\nNew foreign, whippin it (Skrt)\nBlue face, crippin' it (Crippin' it)\nI go all day, count them Benjamins (Benjis)\nI'm rich, really is\nYou sick, syphilis (Yeah, uh)\n\n[Verse 2: Melii]\n¿Quién es la mami que manda?\nNo tienes mula so yo te di banda'\n'Tamos fuma'o de la ganja\nPila de tigueres, rabia con alma\nI let them eat up the nana, dip on a nigga, like, \"See you\nMañana\"\nBaddest lil' bitch in my genre\nI got your baby dad fuckin' up commas\nIcy, icy, icy, drip all on me, watch me when I move (When I move)\nIf you like 'em freaky, baby, she could come here, too (For real?)\nYou could eat this pussy while I watch her fuckin' you\nCall that hoe a Uber when we done, it's up to you (Oh, yeah)\nWho your MCM? Bitch, I make him swipe\nI won't mention these hoes, I might give them life\nI just want the head, you can't spend the night (Oh my god)\nKissin' him sloppy, callin' him papi, that shit get him hype (Que perro)\n\n[Chorus: Meek Mill]\nDo a split on the dick (Do a split)\nIf you really with the shits, lil' bitch (Lil' bitch)\nShe ask her friends (What?), \"Should I let him hit?\" (What they say?)\nShe say, \"Girl, you better fuck him if he rich\"\nHe gettin' it, bad bitch, hittin' it\nNew foreign, whippin it (Skrt)\nBlue face, crippin' it (Crippin' it)\nI go all day, count them Benjamins (Benjis)\nI'm rich, really is\nYou sick, syphilis (Yeah, uh)", "image": "https://images.genius.com/74622f434a6e852420ea522d6aae36f1.1000x1000x1.jpg"}], "artist": "Meek Mill"}