{"songs": [{"title": "30 Hours (Freestyle)", "album": null, "year": "2016-12-14", "lyrics": "[Intro]\nEnviyon on the mix\nBaby lion goes\nHaha\nWhere the islands go\nYeah\n\n[Verse 1]\nNone of these motherfuckers could touch me\nI don't give a fuck if you think you could\nI'll still beat your ass like you from another hood\nStill smokin' Woods, still givin' bitches wood\nIn a wishin' well 'cause I still wish a nigga would\nHah, you ain't shit to a boss\nRev her up like an engine until it give her exhaust\nAll these rappers I'm killing, I'm turning into a villain\nMy Nina be a horny bitch the way I'm getting her off\nRandy Moss for your boy how I'm pickin' 'em off\nI'm pickin' 'em out, these other niggas chickenin' out\nI'm chewin' 'em up, pause, then I'm spittin' 'em out\nI'm bein' general, don't make me start singlin' out\nFirst thing's first, bitch, keep my name out your mouth\nBefore the doctor have to take your fuckin' brain out your mouth\nI may just show up to your next concert with a AK\nJust to see what all that fuckin' hype is about\nNow it's blood on my Louis V's\nBad bitch like my clothes, came from overseas\nEx-girl gettin' mad, said she over me\nKnowin' damn well that I'm still in them ovaries\nBitch, please, I see bullshit around me\nHoes tryna clown me\nAs soon as I get money, I bet them bitches surround me\nAll my money goin' to new clothes and wardrobe\nSo I can't help but be fresher than Downy\nOrange VLONE like I'm straight out the county\nLouis Vuitton don mixed up in Givenchy\nSame way Hennessy mix up in Bacardi, haha\nDamn, so how the fuck you gon' stop me?\n\n[Chorus]\nHaha, I've been givin' 'em 30 hours, haha\n30 hours, haha, ayy\nDu-nu-nu, haha\nAye, y'all like that out there?\nBeen gamin' for 30 hours\nAyy, look, hah\n\n[Verse 2]\nI run laps around these niggas in they school raps\nI'm still doggin' with them cool cats\nI'm still pretty when I sit back\nI break your bitch for the Kit Kat\nYou niggas broke, you can't fix that\nThe competition is a mismatch\nYou think it's cool to fuck with me on a bad day\nAnd lately, I've been havin' a lot of those\nYou pussy niggas so uptight\nThat if you put your big boy pants on\nYou'll be rocking a camel toe\nI'm such a animal\nI'm such a cannibal\nBody parts in my Danimals\nI'm super radical\nPussy, you not compatible\nYou niggas itch like rashes\nYou claim niggas' after me, so call me cautious\nThem hoes used to laugh at me but now they askin'\nThe whereabouts to all my fashion\nIf we could have sex on camera\nLike I don't have real life standards\nGuess I don't have real life standards, huh?\n\n[Chorus]\nHahaha, fuck nigga\nHad to give these hoes 30 hours\n30 hours, ah-uh-uh\nDu-nu-nu, hey, hey\nHad to give these hoes 30 hours\nAye, should I give 'em a little more?\nI should? Bet, haha, look\n\n[Verse 3]\nI'ma just go back in for another, huh\nWhat's the real definition of a brother?\nRelation by blood or relation by color?\nHmm, man, I don't give a fuck\nI'm just talkin' to talk\nThis the talk of a boss\nKeep playin' wit' yo' boy and I'll be checkin' yo' pulse\nProbably put you in a hospital, piss on your bed\nWhile you in a coma and your mama wait for results\nGone\n\n[Chorus]\nHaha, gang\nHad to give these niggas 30 hours\nHah, 30 hours, hey, hey\nDu-nu-nu, yeah\nHad to give these niggas 30 hours\nFuck nigga, haha\nAnd we gone\n\n[Outro]\n30 hours\n30 hours", "image": "https://images.genius.com/9d5054c0925b9267dfed2c17f25316f5.500x500x1.jpg"}], "artist": "Juice WRLD"}