{"songs": [{"title": "New National Anthem", "album": "Paperwork: The Motion Picture", "year": "2014-08-20", "lyrics": "[Intro: T.I.]\nI know radio prolly ain't gonna play this\nBut chopper going off in the hood man like Afghanistan\nOr the Gaza strip somewhere man\nYeah, we hear it so much we probably numb to it by now\nAfter all, it’s the American way right?\n\n[Hook: Skyler Grey]\nHome of the brave and free\nFree just to murder me\nLand of the beautiful\nCursed by the hate we throw\nIs this the new national anthem?\nIs this the new national anthem?\n\n[Interlude: T.I.]\nIt's America, land of the handgun\nHome of the shotgun\nYou're dead if you ain't got one\nIt was like this before I got here, baby I ain't do it!\nI ain't start it, I'm just a part of it\nTurn it!\n\n[Verse 1: T.I.]\nYou say this the home of the brave I guess\nI say this the home of the K’s and the vets\nAll alone with the J’s smoking yay cause he stressed\nOn chrome with a Tek taught to spray for respect\nI learned from the best used to stay in the “jects”\nBought work from the vets burning rubber in the 'Vettes\nThis as good as it gets used to play with the rats\nThen I got older and learned stay away from the rats\nGod blessed this nigga, to hustle up and make eight figures\nTurned from a goon to a great young nigga\nNo complaining just doing what it take young nigga\nI was raised in a decade of hate young nigga\nAlways dodging polices because they hate young niggas\nAnd we hate them too, 38 in him shoe\nAll the changes the system will take him through\nHe ain’t a killer but he will if you make him do it\nHomicide he’ll ride, they’ll put him on trial\nLet him have a life sentence then do it with a smile\nAnd he only 19, he ain’t even had a child\nAs a child, told his mama he’ll be gone for a while\nAnd she cried, still they just put him inside\nNow she all on her own because her other son died\nListen to the politician as he lied and he lied\nHe a snake in a suit, trying to hide in disguise\n\n[Hook: Skyler Grey]\nHome of the brave and free\nFree just to murder me\nLand of the beautiful\nCursed by the hate we throw\nIs this the new national anthem?\nIs this the new national anthem?\n\n[Interlude: T.I.]\nWell damn officer, what did I do?\nNaw hold up man, don’t shoot, I live over there\nAy, man what you doing? You trippin, dawg\nHow many times has that ever happened to you?\nWhat the fuck do you know about being a black man in America?\nAnd you wonder why we walk around with straps\n\n[Verse 2: T.I.]\nFor the stars and the stripes prison bars and the pipe\nYoung nigga rolling weed in a cigar he can light\nBang red either blue selling hard and the white\nLive by the gun, never run from a fight\nTrayvon in a hoodie, walking through the neighborhood he\nDidn’t do shit to buddy, he didn’t have to die did he?\nI guess it’s because his dad was a judge in the city\nThey didn’t want him in the pen with the thugs that could get him\nA jury of his peers said all was forgiven\nBut touch one of mine, right or wrong, I’ma kill them\nFill them with the lead like they put in Martin Luther King’s head\nLike they killed Malcolm X, Edgar Hoover did that\nYou can catch me in the hood where they shooting niggas at\nThey don’t know if Neighborhood or the Hoovers did that\nWhether Piru or VL's or GDs wit me we\nDown to uprise from the OG’s to peewees\n\n[Hook: Skyler Grey]\nHome of the brave and free\nFree just to murder me\nLand of the beautiful\nCursed by the hate we throw\nIs this the new national anthem?\nIs this the new national anthem?\n\n[Interlude: T.I.]\nDon’t get it fucked up\nIf you ain’t found something you’re willing to die for\nYou ain’t fit to live\nTo get something you’ve never had\nYou must be willing to do something you’ve never done\nI’ma die by mine\n\n[Interlude: T.I.]\nLet me ask you something, if the kids are the future\nTell me why you can get more for being C.O. than you can for being a teacher?\nTell me why it means more to the government to pay the people\nWho got to watch over the prisoners more than the people\nWho got to keep the children from becoming prisoners? That make sense?\nTell me why 9 ounces of crack will get you more time than a rape right now?\nTell me why them crazy white boys can tote a gun but I can’t right now?\nYeah I had felonies, I done did dirt in the streets\nBut I ain’t ever gave it to anybody that didn’t deserve it\nYou know what I mean?\nI ain’t ever ran in no public place with no pistol shooting no innocent people\nI ain’t never ran in no school, killing no kids\nMan this is the result of you refusing to deal with the issues at hand\nWe are a product of the environment you placed us in\nWe ain't do it, we just lived through it\n\n[Hook: Skyler Grey]\nHome of the brave and free\nFree just to murder me\nLand of the beautiful\nCursed by the hate we throw\nIs this the new national anthem?\nIs this the new national anthem?\n\n[Interlude: T.I.]\nMessage to my people\nStop waiting on folk to help you, help yourself, it starts with you\nGet yourself out, reach back, get somebody else out\nAnd that’s the way we’re going to get ahead\nSitting around waiting on government to do something for us\nAin't never gonna happen partner, they don’t give a fuck about us\nBut don’t play into their hand partner, you making it easy for em\nHell is you doing?", "image": "https://images.rapgenius.com/283b23b5b83770e0c47d72871434032c.500x500x1.jpg"}], "artist": "T.I."}