{"songs": [{"title": "It Just Doesn’t Matter", "album": "Faces", "year": "2014-05-11", "lyrics": "[Intro]\nThey've got the best equipment that money can buy. Hell, every team they're sending out here has their own personal masseuse. Not masseur, masseuse. But, it doesn't matter! Do you know that every mohawk competitor has electrocardiogram, blood and urine tests, every 48 hours to see if there's any change in his physical condition? Do you know that they use the most sophisticated training methods from the Soviet Union, East and West Germany and the newest Olympic power, Trinidad & Tobago? But it doesn't matter! It just doesn't matter! It just doesn't matter! I tell you it it just doesn't matter! It just doesn't matter! It just doesn't matter! It just doesn't matter! It just doesn't matter! It just doesn't matter! It just doesn't matter! Even if we win... if we win, ha! Even if we win! Even if we play so far over our heads that our noses bleed for a week to 10 days, even if God in Heaven above comes down and points his hand at our side of the field, even if every man, woman, and child held hands together and prayed for us to win, it just wouldn't matter!\n\n[Verse]\nYeah\nYeah\nUm, um\nJumping out the Camino\nJust left the gas station, smell like Hot Cheetos\nRecording soft-core on her Tivo\nMa, the meatloaf!\nRe-smoke, got a vegan bitch in the Peace Corp\nAll she ever do is ask me what I eat meat for--\nHold up, pause. Always over the quota\nBoss, wake up in polo, sleep in Lacoste\nTravel across the world, but that didn't phase me\nCouple people that I know that happen to play me\nOnce they start to realize that I'm actually crazy\nShit, I'm actually crazy... um, and\nQ's phone gettin blown up by Lyor Cohen\nChristian Dior, nothing I'm owning\nGo to Hawaii, fuck with Samoans\nGet faded and sleep in the oceans\nKeep it in motion\nI'm rolling, yeah, yeah, yeah, I'm rolling\nKeep it in motion, I'm rolling, yeah\nAnd your bitch wearing elbow pads\nSell her pussy over Melrose Ave\nI've been to hell and back trying to get attached to my better half\nNever that, the smiles so gone, so bring the coke on\nI'm higher than Voltron, with a bunch of gold on\nCaucasians still love me like my name was Michael Bolton\nHold on, do you fuckin' dirty like the soap gone\nFroze on, it's bone chilling, colder than the Pope's secrets\nOlder than Capone's demons, coming from a place where there was no Jesus\nWalking behemoth, I increase the Feces\nCause shit real, fly into your windshield and get killed\nBuggin' out, had it all, I'm nothing now, I just gave it away\nFuck a label, Cain and Abel, put a name to a face\nUm, yea\nI bust your speakers with some bullshit rap\nI'm on drugs, all my new shit wack\nRemember that, I ain't shit but a fraud\nBut everyone I know ain't nothing to God\nBut everyone I know ain't nothing to God\n\n[Outro]\nIt kills you, it feeds off the Earth\nA night like this, one of us could get up in the middle of the night Grab an axe and cut somebody's head off", "image": "https://images.genius.com/cb728ec66cfad5964e15291c3c4a294c.375x375x1.jpg"}], "artist": "Mac Miller"}