{"songs": [{"title": "Everybody’s Something", "album": "Acid Rap", "year": "2013-04-30", "lyrics": "[Intro: Slum Village & (Chance The Rapper)]\nLadies loving my music is like some sex shit\nNiggas trying to grip up my mic like it's a dick\n(On the mic like it's a dick)\nRun around the corner to pick up the new shit (The shit)\nToss this in the deck so niggas can catch rep\nLadies loving my music is like some sex shit\nNiggas trying to grip up my mic like it's a dick\nRun around the corner to pick up the new shit\nToss this in the deck so niggas can catch rep\n\n[Verse 1: Chance The Rapper]\nWhat's good good? And what's good evil?\nAnd what's good, gangstas? And what's good, people?\nAnd why God phone die every time that I call on Him?\nIf his son had a Twitter, wonder if I would follow Him\nSwallow them synonyms like cinnamon Cinnabon\nKeep all them sentiments down to a minimum\nStudious Gluteus Maxim models is sending him\nPics of they genitalia, tallied up ten of 'em\nI slurped too many pain-kills down, I'm off a lot\nI got a lot of off days, but it ain't often that I'm off the clock\nYou what I mean, I got the Chicago Blues\nWe invented rock before the Stones got through\nWe just aiming back 'cause the cops shot you\nBuck buck, bang bang, yelling \"Fuck Fox News\"\nBooyaka buckle up, motherfuck opps too\nAin't no knuckling up 'em young 'cause it just not cool\n\n[Bridge: Chance The Rapper]\nNice to see you, Father New Year\nMiddle finger Uncle Samuel\nShooting death with weighted dice\nAnd hitting stains on birthday candles\nI know somebody, somebody loves my ass\n'Cause they help me beat my demon's ass\n\n[Chorus: Chance The Rapper & BJ the Chicago Kid]\nEverybody's somebody's everything\nI know you right\nNobody's nothing\nThat's right\nEverybody's somebody's everything\nI know you right\nNobody's nothing\nThat's right\nEverybody's somebody's everything\nThat's right\nNobody's nothing, nobody's nothing (Right? Igh)\nI know you're right\n\n[Verse 2: Chance The Rapper]\nI used to tell hoes I was dark light or off-white\nBut I'd fight if a nigga said that I talk white\nAnd both my parents was black\nBut they saw it fit that I talk right\nWith my drawers hid but my hard head stayed in the clouds like a lost kite\nBut gravity had me up in a submission hold\nLike I'm dancing with the Devil with two left feet and I'm pigeon-toed\nIn two small point ballet shoes with a missing sole\nAnd two missing toes\nBut it's love like Cupid kissing a mistletoe\n\n[Bridge: Chance The Rapper]\nNice to see you, Father New Year\nMiddle finger Uncle Samuel\nShooting death with weighted dice\nAnd hitting stains on birthday candles\nI know somebody, somebody loves my ass\n'Cause they help me beat my demon's ass\n\n[Verse 3: Saba]\nLike Cassius ducking the draft and now the fight is over\nThe type to love from a distance, not the type that told her\nSpent three days on the rap, trash it and type it over\nWith babies on the block underarms like fighting odors\nCoppers and quotas, hold ya head like 2Pac had taught\nObviously, they are on a come up\nWith better chances tobogganing in the fucking summer\nConcoctions for the bad days and a condom for the good ones\nAll odds against us, we tryna get lucky, doper than Lucky\nYou're ending happy, that's only a tugging\nLike Satan masturbating, shit come hot, but y'all still love me\nUgh, how Father Time a deadbeat? Maybe I'm adopted\nThat'll explain why all of my shit been so timeless, igh\n\n[Chorus: Chance The Rapper & BJ the Chicago Kid]\nEverybody's somebody's everything, nigga\nNobody's nothing, nigga\nEverybody's somebody's everything, nigga\nNobody's nothing at all\nWu-Tang\nEverybody's somebody's everything\nThat's right\nNobody's nothing\nI know you're right", "image": "https://images.genius.com/aa16cba40f43828a61bbb6212de712bd.750x750x1.jpg"}], "artist": "Chance the Rapper"}