{"songs": [{"title": "Soursop", "album": "Ghostface Killahs", "year": "2019-09-13", "lyrics": "[Chorus]\nWhen I was just\nGive  me light, light, light the way\nLight  the way, give me light, give me light\nGive me light, light, light, light\nLight, light, light, light\nLight,  light, light\nCan  you light?\nCan you light? Light, light the way\nLight  the way, give me light, give me light\nGive me light, light, light, light\nLight, light, light, light\nLight, light, light\nCan  you light?\n\n[Verse 1]\nYeah, yo\nBloodclaat, bust my gun like a rude boy\nNo Love & Hip Hop, bad attitude, boy\nJamaican Clarks, sippin' Guinness on the hot sand\nSun splash, I'm on after Elephant Man\nMy posse paddle through the Cayman in a small canoe\nChewin' on chew sticks, blowin' on ganja root\nFonto leaf, Irish moss, soursop\nBig nets catchin' monk fish, spice for the crockpot\nThe powder is wrapped, lookin' like baby roadies\nMachine gun mask on, lookin' like a bunch of goalies\nThe half a foot dread, the whole land call him Toby\nHe got a team of red beam that'll lean the police\nChristoper Coke, the pistol'll smoke gutters\nWe out in Kingston grooming the dirt for the butters\nSharpened machetes that slice through the trees for berries\nBusting coconuts, Selassie legendary\n\n[Chorus]\nWhen I was just\nGive me light, light, light the way\nLight the way, give me light, give me light\nGive me light, light, light, light\nLight, light, light, light\nLight, light, light\nCan you light?\nCan you light? Light, light the way\nLight the way, give me light, give me light\nGive me light, light, light, light\nLight, light, light, light\nLight, light, light\nCan you light?\n\n[Verse 2]\nSiddly, diddly, diddly, diddly, diddly, diddly, and truly (Right)\nNo search and fiddle (Right)\nDiddly, diddly, diddly, and truly\nFirst class (Brrt)\nCold blooded murderer (Right)\nTell 'em, tell 'em, tell 'em, tell 'em what them ah really require (Right)\nCold blooded murderer\nWu-Tang the definition of a soldier\n\n[Verse 3]\nCheck the Tiger Bone, stole love don, I sip a megaton\nOn point, soldiers is armed and blow the best corn\nFly silks and wallies, women from Jamaica to Bali\nAcknowledge me at the show and prove rowdy\nI miss Allah Real still, I build with this peace of steel\nThey call the microphone chrome nickel-plated poems\nJamel Ireef and Iron Man Tone, respect shown\nIn Jamaica, there's a party, peace to all my natty\nEatin' swordfish and I keep sliced avocado\nRice and peas and items sweet like a mango\nOne hundred clip rifle blow, steady flow, rhythm, tempo\n\"More fire,\" the sample go, so\nPeace to Fire House, Waltham, Havendale to Maverley\nJungle to Rema, Salt Lane to Tivoli\nGaza, Spanish Town, Trenchtown, back to Maxfield\n'Nough respect due, everything real\n\n[Outro]\nWhen I was just", "image": "https://images.genius.com/5d29f854228aa112356a7c3a84f5cd4e.1000x1000x1.jpg"}], "artist": "Ghostface Killah"}