{"songs": [{"title": "Blasphemy", "album": "The Don Killuminati: The 7 Day Theory", "year": "1996-11-05", "lyrics": "[Snipped of a religious TV show]\nGod has a plan, and the bible unfolds that wonderful plan\nThrough the message of prophecy\nGod sent Jesus into this world to be our savior\nAnd that Christ is returning, someday soon\nTo unfold the wonderful plan of eternity\nFor my life and your life\nAs long as we're cooperating with God\nBy accepting Jesus Christ as our personal Lord and savior\nUnless the Lord does return in the coming seven days\nWe'll see you next time here on This Week in Bible Prophecy\n\n[Intro: 2Pac]\n2Pac, don't start that blasphemy in here!\nMakaveli, the new breed\nAnd I remember what my pops told me\nThe new word, follow me\nRemember what my pops told me\n\n[Verse 1: 2Pac]\nMy family tree consists of drug dealers, thugs and killers\nStrugglin', known to hustle, screamin', \"fuck they feelings!\"\nI got advice from my father, all he told me was this:\n\"Nigga, get off your ass if you plan to be rich!\nThere's ten rules to the game, but I'll share with you two\nKnow niggas gon' hate you for whatever you do\nNow, rule one: get your cash on, M.O.B.\nThat's Money Over Bitches, 'cause they breed envy\nNow, rule two is a hard one: watch for phonies\nKeep your enemies close, nigga, watch your homies\"\nIt seemed a little unimportant, when he told me, I smiled\nPicture jewels bein' handed to an innocent child\nI never knew, in my lifetime, I'd live by these rules\nInitiated as an outlaw, studyin' rules\nNow, papa ain't around, so I gotta recall\nOr come to grips with bein' written on my enemy's walls\nPromised if I have a seed, I'ma guide him right\nDear Lord, don't let me die tonight\nI got words for my comrades, listen and learn\nAin't nothin' free, get back what you earned\nNo doubt, gettin' higher than a motherfucka, bless me, please\nThis Thug Life'll be the death of me\nC'mon, yeah\n\n[Bridge: 2Pac]\nAnd I remember what my poppa told me\nRemember what my pops told me\nBlasphemy!\n\n[Hook: Prince Ital Joe & 2Pac]\nNuf for dem dat steal in the name of da Lord\nDem a tell nuff lie, but holdin' my bird in a cloud\n(Remember what my pops told me)\nUsing the name of the lord in vain\n(blas-blas-blasphemy, blasphemy)\n(Remember what my pops told me)\nWhile de people in de ghetto feel nuff pain\n\n[Verse 2: 2Pac]\nWe pro'ly in Hell, already, our dumb asses not knowin'\nEverybody kissin' ass to go to Heaven ain't goin'\nPut my soul on it, I'm fightin' devil niggas daily\nPlus the media be crucifyin' brothers severely\nTell me I ain't God's son; nigga, momma a virgin\nWe got evicted, had to leave the 'burbs\nBack in the ghetto, doin' wild shit\nLookin' at the sun don't pay\nCriminal mind all the time, wait for Judgment Day\nThey say Moses split the Red Sea\nI split the blunt and rolled a fat one up, deadly\nBabylon beware, comin' for the Pharoah's kids\nRetaliation, makin' legends off the shit we did\nStill bullshittin', niggas in Jerusalem waitin' for signs\nGod comin', she's just takin' her time (haha!)\nLivin' by the Nile, while the water flow\nI’m contemplatin' plots, wonderin' where the thought’ll go\nBrothas gettin' shot, comin' back resurrected\nIt's just that raw shit, nigga, check it (that raw shit)\n\n[Bridge: 2Pac]\nAnd I remember what my poppa told me\nRemember what my poppa told me\nBlasphemy!\n\n[Hook: Prince Ital Joe & 2Pac]\nNuff a dem a steal in the name of the lord\nDem a tell nuff lie, but holding a bird in a cloud\n(Remember what my pops told me)\nUsing the name of the lord in vain\n(Remember what my pops told me)\nWhile de people in de ghetto feel nuff pain\n(What!)\n\n[Verse 3: 2Pac]\nThe preacher want me buried, why? 'Cause I know he a liar\nHave you ever seen a crackhead? That's eternal fire\nWhy you got these kids' minds thinkin' that they evil?\nWhile the preacher bein' freaky, you say, \"honor God's people\"\nShould we cry when the Pope die? My request:\nWe should cry if they cried when we buried Malcolm X\nMama, tell me: am I wrong? Is God just another cop\nWaitin' to beat my ass if I don't go pop?\nMemories of a past time, givin' up cash to the leaders\nKnowin' damn well they ain't gonna feed us\nIn my brain, how can you explain time in B.C.?\nIt's hard enough to live, now, in these times of greed\nThey say Jesus is a kind man\nWell, he should understand times in this crime land\nMy thug nation, do what you gotta do\nBut know you gotta change\nTry to find a way to make it out the game\nI leave this and hope God can see my heart is pure\nIs Heaven just another door? I leave this here\nI leave this and hope God see my heart is pure\nIs Heaven just another door? And my people say\n\n[Hook: Prince Ital Joe & 2Pac]\nNuff a dem a steal in the name of the lord\nDem a tell nuff lie, but holding a bird in a cloud\n(Remember what my pops told me)\nUsing the name of the lord in vain\n(Can't I remember what my poppa told me, blasphemy)\nWhile de people in de ghetto feel nuff pain\n\n[Collision]\nOur Father, who art in Heaven\nHallowed be Thy name\nThy kingdom come, Thy will be done\nIn Earth as it is in Heaven\nGive us this day, our daily bread\nAs we give up our debts\nAs we forgive our debt-ors\nLead us not into temptation\nBut deliver us from evil\nFor God's is the kingdom and the power\nAnd the glory forever and ever and ever", "image": "https://images.genius.com/7894e79ce5a96c41b016bcedd35bed4f.600x600x1.jpg"}], "artist": "2Pac"}