{"songs": [{"title": "Would You Die for Me", "album": "Born Again", "year": "1999-12-07", "lyrics": "[Verse 1: Notorious B.I.G.]\nVenue after venue, I've been through\nComing to the telly, so I can bend you\nSend you to the store, condoms and more\nJealous females, call you sluts and whores\nCould it be my hardcore metaphor\nMake sweat pour on the bedroom floor\nOpen up the Lex door\nJump on in, I'm kind of tired\nI'm a roll blunts while you spin\nYou got your license, right? Alright, no swerving\nHair blonde out, Madonna style like a virgin\nSplurging, Dom P., Ro-se\nMuch foreplay, that's my forte\nNiggas see the ring, baguettes to death\nShe looking for a man, honey he just left\nViolate me, he get beat to death\nGoodfellas squeeze every shell they got left\nGrand Marnier increase the don strength\nTwo four-fifths within my arms length\nWith a calm breath I say we gots to float\nThrow Little Cease the keys to the boat\nTongue all down her throat, you know the routine\nGot my dick large like Bruce Springsteen\nAnd you mean too, eyes greenish blue\nGot the Coogi sweater with the bubble Fubu\nBeautiful, that's how the night goes\nGet out them tight clothes\nGet in some night clothes\nI invite those girls that smoke lye\nKeep it real with you\nYou keep it real with I\nWe be tight like frog's ass\nHave you screaming \"Biggie, Biggie give me one more chance\"\n\n[Hook: Puff Daddy]\nWould you ride with me? (Yeah)\nWould you lie for me? (That's right)\nWould you get high with me? (For sure)\nWould you die for me? (No doubt)\n\n[Verse 2: Lil' Kim]\nThese hoes don't treat you like I treat you\nLike my contacts, I can see right through\nDon't they know me and you is stuck like glue?\nQueen Bitch means number one and two\nWifey, ya'll ain't got to like me\nGo head and act dumb, you'll just catch a hot one\nY'all know where I'm from\nBucktown, lay your ass down\nYou don't wanna play around (with me)\nProbably just mad because Frank chose me\nA fly cu-tie, you just a grou-pie\nGirls call my telephone just to hang up\nWhile me and you is in the crib, laying up\nOh he ain't tell you that we live together\nAnd that we gonna have a kid together\nWhatever, me intimidated, never\nAnything you give to him, he give it right to Kim\nAnyway, I fuck better than you\nGive head better than you, pussy get wetter than you\nIf I fuck another nigga, don't mean nothing\nB.I.G. is in my heart from the start\nWhether broke or rich, I'm a stay his bitch\nChicks who used to be around, where they at now?\n(See I don't care bout them other broads)\nB.I.G. kept it real with me, and that's that\n\n[Hook: Puff Daddy]", "image": "https://images.genius.com/5fa56d7da6cf3fe54995d91d7120c735.500x500x1.jpg"}], "artist": "The Notorious B.I.G."}