{"songs": [{"title": "Sonny’s Missing", "album": "Only Built 4 Cuban Linx... Pt. II", "year": "2009-09-08", "lyrics": "['The Killer' sample]\nThen who will beat him?\nI don't know, you know I can't reveal that sort of thing to you\nWell I haven't got my money yet\n\n[Intro: Raekwon]\nHead splash, caught him... (eight million stories or something)\nEight million stories, nigga\nWord up, from the hard streets of Norfolk\nMotherfucker to New York, all over the world, nigga\nWe win, all day everyday, nigga (Son is missing right now, man)\nYa bitch-ass nigga, watch what happens (Get on it man, for real)\nCheck the shit, yo, aiyo, aiyo...\n\n[Verse: Raekwon]\nThey found his head splashed, caught him by the side of the building\nHe had a mask on, four-five why did you kill him?\nIt was supposed to happen, clicked the shit back\nYo, this is the deal, you get on the floor and lay in the grass\nHad me handcuffed, take two puffs of the kush\nI see you out here, your name's real, can't let you get touched\nHe had a team, Japanese fiend, all of them greened down\nChiba lit, blood on his Adidas was thick\nOne second homey, walked over, weapon was boney\nLong nose joint, \"Hold him\", grabbed the nigga head, broke his Roley\nWhere the blow shorty? Shorty start smiling, \"Y'all niggas is puss\"\nYo, Lex, these niggas, ain't vets, they gush\nChunk of meat flew off his cheek bone, broke a seat\nHad a hole in his 'Lo shirt and took all his weed\nUntied him, he fell, legs weak and son wouldn't tell\nNow it gets deep, son start falling asleep\nThey woke him back up, smacked him with the Mac, \"Where ya slut?\"\nI heard you copped a new Beamer and them glasses is rough\nThey was the Furla joints, eighteen karats, bought 'em right in Brazil\nHe had the steel on 'im, niggas went savage, they had him spread out\nT position, opened his jeans up\nShot him in the leg bone, he rose up like Kung Tut\nStill riffing, this why for real my niggas'll still get it\nAll of us yelling, he ill wit it\nMouth bloody, muddy Gucci joints on, them shits was nine hundred\nCouldn't wait to kill him, his sons wanted it\nChampion hoody was gone, they broke his neck in like five places\nPushed him down the rail and it skipped his face\n\n[Outro: Raekwon]\nYo, chill, nigga, chill\nPolice, police, the bullhorn... {*sirens wailing*}\n(Aiyo, son, niggas better start flushing the fucking toilet, man)\nThey just fucking killed this nigga, my nigga\n(Better stop leaving ya dirty fucking Fila hoodies around, man)\nHit this nigga in the back of his fucking head\nYou, man? (Yo, man, the nigga whole fucking head desintegrated, nigga)\n(There's a hundred police outside) Listen, B, aiyo..\nThey running through the building, man\n(Y'all niggas gotta shut the fuck up, man)\n(Then you wonder why niggas be getting busted?\nMan, y'all niggas is yelling, man\nWe in the back cooking, B, come on, man\nWhat the fuck? Langston, go to the store\nI'm stilling waiting for the baking soda)", "image": "https://images.genius.com/2691e582dc2839478e49279288d69cb1.1000x1000x1.jpg"}], "artist": "Raekwon"}