{"songs": [{"title": "Steady Mobbin’", "album": "Death Certificate", "year": "1991-08-09", "lyrics": "[Intro]\nGod damn!\nThe bigger the cap, the bigger the peelin'\nAnd when dealin' wit' Da Lench Mob you gots to know steady mobbin' is not just the name of this jam, but a way of life\nBound together by motherfuckers as known to break em' off something\nGive it to me\n\n[Sample] (x4)\n\"There goes the neighborhood\"\n\"There goes the neighborhood\"\n\"There goes the neighborhood\"\n\"There goes the neighborhood\"\n\n[Verse 1: Ice Cube]\nFour or five niggas in a mothership\nBetter known as a deuce and we all wanna smother shit\nBent, front and back glass got tint\nTryin' to get our hands on some dollars and cents\nAnd fools can't hold us\nEvery chance we get, we hittin' up the rollers\nComin' up short of the green guys\nAnd I might start slangin' bean pies\nOr the bootleg t-shirt of the month\nWith \"U Can't Touch This\" on the front\nI'm 'bout to get rich\nCause life ain't nuttin but money and fuck a bitch\nThey drop like dominoes\nAnd if you didn't know, Ice Cube got drama hoes\nSo after the screwin'\nI bust a nut and get up and put on my white Ewings\nI'm out the door\nAll you might get is a rubber on the floor\nCause I'm ready to hit the road like Mario Andretti\nBitch, cause I'm steady mobbin'\n\n[Hook]\n(\"Have you ever seen such a sight in your life?\") (Steady mobbin')\nHave you ever seen such a sight in your life?\n(Steady mobbin')\n\n[Verse 2: Ice Cube]\nBustin' caps in the mix\nRather be judged by twelve than carried by six\nCause I'm gettin' major\nFuck Pactel, move to Sky Pager\nTold all my friends:\nDon't drink 8 Ball, cause St. Ide's is givin ends\nFools get drunk and wanna compete\nSlapboxin in the street\nNiggas get mad, tempers are flarin'\nCause they got a few bitches starin'\nJust for the nappy heads\nBut scandalous bitches, make for happy Feds\nI make it my duty to cuss 'em\nOut, cause I just don't trust em\nAnd if you tell on me I'm bombin' on Betty\nBitch shoulda known I was steady mobbin'\n\n[Hook]\nHave you ever seen such a sight in your life?\n(Steady mobbin')\nHave you ever seen such a sight in your life?\n\n[Verse 3: Ice Cube]\nSince one-time so hot\nGot me a stash spot in my hooptie for the Glock\n'Cause I'm rollin' on rims\nEating soul food, neckbones from M&M's\nGrubbin' like a motherfucker\nGreasy-ass lips, now I gots to take a shit\nSaw Sir Jinx bailin'\nWhen I hit a left on Ruthelen, \"Whattup loc?\"\nDon't you know that niggas get smoked\nThey take they life for a joke, get in nigga\nI'll take you to the pad soon\nWent to mom's house and dropped a load in the bathroom\nJumped back in my low rider\nComin' out feelin' about ten pounds lighter\nWent to Bone's house so I can get the gat\nLooking for the place where all the hoes kick it at\nLench Mob ain't nuttin but tramps\nBut hoes lickin' nuts like stamps\nOne fool bumpin' music for the yamps\nBut Ice Cube had more amps, get in bitch\nCause I had the jam on\nAnd I don't want to hear shit about a tampon\nGive me the nappy and make me happy\nThe ho said 'Pappy could you slap me\nOn the ass hard and fast\nAnd could please try not to leave a gash?'\nI said yeah, but I don't play sex\nWithout puttin' on the latex\nSlipped on the condom\nFucked around and dropped the bomb son\nAnd it came out sort of like confetti\nIn for the night, no longer steady mobbin'\n\n[Hook]\nHave you ever seen such a sight in your life?\n(Steady mobbin')\nHave you ever seen such a sight in your life?\nHave you ever seen such a sight in your life?\n(Steady mobbin')\nHave you ever seen such a sight in your life?", "image": "https://images.genius.com/bfb89723b3b23c1d4a32f74291dc1365.600x607x1.jpg"}], "artist": "Ice Cube"}