{"songs": [{"title": "Yates", "album": "Special Effects", "year": "2015-05-04", "lyrics": "[Verse 1: Tech N9ne]\nEver since my cradle date, or my prenatal state\nI was blessed with the gift to disable hate\nWith fatal takes on the mic is makin' my halo break\nAnd smash every lady workin' at Strange, call them my label-mates\nI throw the squad up, them I'mma pour ya broad up\nGenitals, so plentiful, ya chemical's low but shot up\nWishin' they'd slow the god up\nBut I ain't trippin' when I rip I'm twitchin'\nThey think that I be sniffing on Snow Tha Product\nBitch I might be, this a nice key, to get ya hyphy\nDick ya wifey, this for Ike\nSlice of sin or source if ya see somethin' slither slightly\nStep inside the surface of Strange, or simply sight-see\nSpit the flow, get the dough, then I hit the ho\nMister irresistible twisted is this kiss the toes\nI'ma kick ya nose if one of ya pricks oppose\nI'm all he hates, cause I became a landmark like Ollie Gates\nMaudie's great, tall estate, y'all debate, nigga, call me Yates\n\n[Hook: Marcus Yates]\nIt's no challenge, it's no challenge at all\nWhen you up the bar, it gets below average\nBelow average, killin' 'em, toetag 'em\nI'ma let you be great though (x3)\nBut it ain't no stoppin' a Yates\n\n[Verse 2: Tech N9ne]\nLately I've been like fuck rap\nWhat? Did he say \"fuck rap\"?\nOh no no, I'mma write in bold and plus caps\nFUCK RAP\nCause all these tough cats really don't have no nutsacks\nTrust that 'nuff scratch does back much wackness\nFlush that shit\nDown with the gowns with the sounds for the clowns\nAnd not in a good way\nYou can drown underground with the pounds\nWhen they gust that shit\nOh so, low we stojo, hoes and dough negro we flow though\nLet the soul glo, mojo, nigga\nPillowcase, over the head of the industry\nIllustrate, with my mouth and murders my ministry\nSeal the fate of my enemy, feel the weight of my energy\nI heal the hate. Facilitate. Disc jockey's with scrilla make\nThem play your records until you break\nRadio ain't nothing but real estate\nIt's still a fake deal of mates who ain't real awake\nBut the mill is great, ain't no iller ape that can kill a Yates\n\n[Hook]\nIt's no challenge, it's no challenge at all\nWhen you up the bar, it gets below average\nBelow average, killin' 'em, toetag 'em\nI'ma let you be great though (x3)\nBut it ain't no stoppin' a Yates\n\n[Verse 3: Marcus Yates]\nI can keep my head, while everybody losin' theirs\nNo Marcus, I told you, don't start this debate\nI'm all arsenal friend, we the median like, you feedin' me in\nTired of bein' with the intermediate\nFaded on bullshit, control the whole medium\nI done ran inside my meniscus\nI done out-rapped everybody Christmas\nSo why in the hell would I fail?\nIf I do, I'm just being Ezale\nFront line level, untamed, unchained\nAfter all this shit, I remain on lane, loser\nAnd that's what yo ass get for hittin' that snoozer\nMy brain is worth a few trillions, I don't get worked\nSo my verses hurts when they send me to kill 'em\nI'm like Biblin' niggas, keepin' it blacker than Power Rangers\nBut why the name Zachary? No leashes, I'm free sucker\nNo reachin' no knee deep into mine\nLike a comprehension of lines\nRevisit them when you wanna hear that real wizard dim\nYoung and timeless, elite science, prominent and flyin'\nAnd beat them beats to meet and greet but I conscience", "image": "https://images.genius.com/edd99f73805809fd6bac9dda75c9e951.550x550x1.png"}], "artist": "Tech N9ne"}