{"songs": [{"title": "Love 4 Sale", "album": "The Archive Live, Lost & Found", "year": null, "lyrics": "[Chorus]\nOnce was a time I thought that love could be sold or bought and (Uh) everything fell in place for me, for me, for me. (Yeah) The fashion of passion, the crashing with caution because of the notion the potion of passion had never been passed to me, to me, to me\n\n(Lady hustler stand up). Once was a time I thought that love could (Uh huh) be sold or bought (Uh huh) and everything fell in place for me, for me, for me. (Nick Wiz they're gonna love you for this) The fashion of passion, the crashing with caution (Uh) because of the notion the potion of passion (Yeah) had never been passed to me, to me, to me\n\nYeah\nUh\n\n[Verse 1]\nGo look at her, livin' a world of give and take\nA girl that only get with dudes that's gettin' cake\nBut don't hate [?] just feed her with gifts to get a date\nDiamonds and pearls and trips to get away\nAnd plus ten steps ahead she's slick\nTurnin' to love slays and leave 'em straight out whipped\nShe too much, get what she out to get, and here's the trick\nThe tricks get out-tricked, the pimps get out-pimped\nIn bed, beyond compare, ma's rare\nHer computer know what to do with hardware, ah yeah\nShinin' in a diamond brassiere\nTattoo on her rear \"Swipe credit card here\"\nShe [?] thinking above the scale\nAnd having second thoughts about love for sale\nNo regret, had a feeling love would fail\nShe had fun, but now she want love for real\nShe said....\n\n[Chorus]\nOnce was a time I thought that love could be sold or bought and (Uh) everything fell in place for me, for me, for me (Love for sale). The fashion of passion, the crashing with caution because of the notion the potion of passion had never been passed to me, to me, to me (Love for sale) (Never been passed to me, baby)\n\nOnce was a time I thought that love could be sold or bought and everything fell in place for me, for me, for me (Love for sale) (Yeah). The fashion of passion, the crashing with caution because of the notion the potion of passion had never been passed to me (Uh), to me, to me (Yeah)\n\n[Verse 2]\nShe ain't dumb, let him stack his cash\n'Cause when he get home she gon' crack his stash and get half\nLove to check the racks for rags\nIn the Jag packed with bags from Saks 5th Ave\nIn the club (Yeah), make the scene go wild\nAlways singled out, and her bling go blow\nSwitch up, never rock the same old style\nDesigner name profile, she's bilingual now\nAnd the [?] speak Manolo, Armani, Dolce & Gabbana, Roberto Cavalli\nLook at mami, speak Donatella Versace, Jimmy Choo, Prada, Valentino Garavani and Red\nStep off the aeroplane\nJust to hang out under the sunset somewhere in Spain\nIn Madrid, spell like Chanel and Vera Wang\nBut she forgettin' one thing, she missing the wedding ring\nShe said....\n\n[Chorus]\nOnce was a time I thought that love could be sold or bought and (Uh huh) everything fell in place for me, for me, for me (Love for sale). The fashion of passion, the crashing with caution because of the notion the potion of passion had never been passed to me, to me, to me (Love for sale) (Never been passed to me, baby)\n\nOnce was a time I thought that love could be sold or bought (Yeah) and everything fell in place for me, for me, for me (Love for sale). The fashion of passion, the crashing with caution because of the notion the potion of passion had never been passed to me, to me, to me (Love for sale)\n\n[Verse 3]\nIt ain't love, you know a man attracted to fashion\nCashmere, chiffon, silk, suede and satin, and flashin'\nLove Franklin, Grants and Jacksons and cash and\nNobody never gave her passion, just lust\nNo one can [?] 'til mami demand more\nA man that can't fall, and trust\nStarting to understand more\n'Cause if they share yours you declare war\nWhen they met, wanted no strings attached\nHe can take it where he wants if he brings a bat\nAnd it's wraps, the necklace, earnings to match\nEverything fell into place but things collapse\nInstead, think it ain't as tight as it was\nAnd now she only want what's rightfully hers\nIs respect, she need a man to wifey her up\nShe wanna know what if feel like to be loved\nShe said....\n\n[Chorus]\nOnce was a time I thought that love could be sold or bought and everything fell in place for me, for me, for me (Yeah). The fashion of passion, the crashing with caution because of the notion the potion of passion had never been passed to me, to me, to me (Love for sale) (Never been passed to me, baby)\n\n(This is for my lady hustlers)\n\nOnce was a time I thought that love could be sold or bought and everything fell in place for me, for me, for me (Love for sale). The fashion of passion, the crashing with caution (Uh) because of the notion the potion of passion had never been passed to me, to me, to me (Love for sale)", "image": "https://images.genius.com/009ea2953d379ab53e8bb7f20f149287.800x800x1.jpg"}], "artist": "Rakim"}