{"songs": [{"title": "U With Me?", "album": "Views", "year": "2016-04-29", "lyrics": "[Intro: DMX]\nWhat these bitches want from a nigga?\n\n[Verse 1]\nOn some DMX shit\nI group DM my exes\nI tell 'em they belong to me, that goes on for forever\nAnd I think we just get closer when we not together\nYou tell me that I'm confusin'\nMore immature than Marques Houston\nCuts too deep for a band-aid solution\nWe too deep in this thing, you'll never lose me\nLOLOL, I'm glad you find this shit amusin'\nHeard a lot about me 'fore we started off\nI know you heard that my pool parties like Mardi Gras\nI know you heard that my girl is sponsored by Audemars\nThat's why she always correctin' me when my time is off\nAnd my house is the definition\nOf alcohol and weed addiction\nYou got a different vision\nYou wanna walk around naked in the kitchen\nWithout runnin' into one of my niggas\nThat's not the way we livin'\nToo much goin' on, it's just not realistic\nThese days I don't talk 'bout them days like I miss 'em\nAnd you shouldn't miss 'em either, we different people\nBut every time we speakin'\n\n[Chorus]\nIt's like a lot of games bein' played\nHow's it goin' down?\nIf it's on 'til we gone, then I gots to know now\nIs you wit' me or what?\nYeah\nIt's like a lot of games are bein' played\nHow's it goin' down?\nIf it's on 'til we gone, then I gots to know now\nIs you wit' me or what?\nYeah\n\n[Verse 2]\nI wanna know how much time you spent on them paragraphs\nWhere you're getting me\nAll that grey in our conversation history, you\nPlayin' mind games, when you sayin' things\nPlayin' mime games, we both doin' the same thing\nSlide on a late night\nYou like to slide on a late night\nYou send the \"Are you here?\" text without an invite\nThat's that shit that I don't like\nWe both slide on a late night\nDo things in our off time\nWe both, yeah\nMade some mistakes, pon road\nYeah, how's that for real?\nYou toyin' with it like Happy Meal\n3 dots, you thinkin' of a reaction still\nWhile you're typin', make sure you tell me\n\n[Chorus]\nWhat type of games are bein' played?\nHow's it goin' down?\nIf it's on 'til we gone, then I gots to know now\nIs you wit' me or what?\nYeah\nWhat type of games are bein' played?\nHow's it goin' down?\nIf it's on 'til we gone, then I gots to know now\nIs you wit' me or what?\nYeah\n\n[Verse 3]\nYeah, remember you was livin' at The London for a month\nService elevator up to 4201\nWe was still a secret, couldn't come in through the front\nGirl, I had your back when all you used to do was front\nThat's for sure though, I made a career off reminiscin'\nTime got a funny way of tickin', things are so much different\nI'll admit it, I've admitted to a lot of things\nAct like you know it, fuck them stories, fuck the shade they throwin'\nUnderstand I got responsibilities to people that I need\nAnd on my way to make this dough\nA lot of niggas cut the check so they can take this flow\nA lot of niggas cut the check so they can take this flow\nOhhh, ohhh\nTryna give your ass the world\nYou runnin' your fingers through my curls\nYou knew me when the kid had waves\nBut that's enough of that\nYou could never say I came up and forgot about your ass\nAnd that's some real shit", "image": "https://images.genius.com/6f4b9c41ccb18485cccd6aa364ccc3b8.1000x1000x1.jpg"}], "artist": "Drake"}