{"songs": [{"title": "Pledge Allegiance To The Swag", "album": "No Mercy", "year": "2010-12-07", "lyrics": "[Intro]\nAy count that money for me partner\nAy Ross make sure that nigga got that shit right, ya hear me?\nAy, let a motherfucker go ding, that’s a 150 thou\nYeah, that shit should add up to about 5.4\nI be right back, I’m finna go get dressed\nTell tha nigga to gas up tha jet\n\n[Hook: T.I.]\nI stay on my grind cause that come first\nIf he get outta line his feelings finna get hurt\nAll that’s on my mind is get that dough\nHe try me I'mma take you places you don’t wanna go\n56 stacks of more and I’m in your town\nJust to shake some booty home but it finna go down\nHear that click clack roll, better get back fast\nHave attention when you see me pledge allegiance to the swag\nPledge allegiance to the swag [x8]\n\n[Verse 1: T.I.]\nAy, I do my thang you don’t know\nOff the motherfuckin’ chain, play the game how it go\nI ain’t in the game still I'mma problem on the low\nWhip them thangs well just know I know who got it for the low\nTriple O.G. so sucker free, I swear\nYou don’t know me homie you can get the fuck from round here\nI don’t care who you will, who you with or who you know\nLet’s be clear, I’m a motherfuckin’ G and you a ho\nKeep that Remy XO pulled up, bankrolled, swole up\nSmell money in the air soon as I roll up, ayyy\nI’m the coolest in the city bitch\nWhile you lame trippin’ on that goofy stupid silly shit\nWho you ever seen it really did, super fly filthy rich, any with it killin’ shit\nCame in that bitch with my ego and got cash\nI demand you to raise your hand and\nPledge Allegiance To The Swag\n\n[Hook]\n\n[Verse 2: Rick Ross]\nBrown bag of money, call me David Copperfield\nA bitch’ll disappear, Lord, the bitch will disappear\nWe control the corners, that’s usual politics\nPush a button from the mansion, hit you with a hollow tip\nWe two different niggas, I’m servin’, he sniffing his\nAnd I love that new Bugatti, how that bitch be shifting gears\nMovin’ how I move, I fuck with a selected few\nAviators and Audemars, tha bezel flourescent blue\nDown south nigga, had to climb up out the barrel\nOutfox these niggas, now we rock our own apparrel\nPledge allegiance to the swag cause this shit is top notch\nJumpin’ in and outta bitches like I’m playin’ hopscotch\nJumpin’ in and outta sixes like I got a car lot\nAnd I got the type of digits that your bitch’ll dial by\nYoung niggas bow down to the kings\nIn the presence of a Don, pay respect, kiss my ring\n\n[Hook]\n\n[Verse 3: T.I.]\nEnd zone - off set, neck, wrist frostbit\nDeal ain’t hundred mil, you ain’t talkin’ bout shit\nNigga wanna beef, he get the whole cal quick\nIf you talking bout some paper step into my office\nOn some Penthouse shit, rentin' out chicks\nFuck ‘em from behind, they be spitting out dick\nExcuse me now but if I may make an announcement\nI smoke no more but when I did I was blowin’ ounces of gas\nAsk the feds what I had when they found me\nWe down with whatever, don’t interrupt my countin’\nBallin’ on a daily basis, call my accountant\nOnly time you make it rain when you throwin’ change in a fountain\nFlow sick, crazy, derranged, need counselin’\nHe say I ain’t all that, she say I’m outstandin’\nThem lames out Jeezy, square’s outta season\nWhen you see my swag, nigga, pledge your allegiance\n\n[Hook]\n\n[T.I Talking]\nAy my nigga I’m the type of stars and stripes you know what I’m saying\nYou come fuck with me on that bullsh-t you’ll be seeing Stars and Stripes nigga, you understand that nigga, say I’m lying, think its a game if you want to partna\nAy Ross I see you my nigga, I bump that Maybach music nigga when I’m playing music in my Maybach, ya dig\nAye listen, all you other sucker ass nigga homeboys\nI don’t see you dogg, you transparent, translucient dog\nMy nigga get out my way nigga let money get through here dog\nYou understand\nSay you niggas ain't even on my muthaf-cking resume dog\nAye my nigga if I did take you out the game it was my pleasure to move you out my God Damn way you know what I’m saying\nNiggas say no more homes\nNigga you could have died in the hand of another man, you know what I’m saying\nNigga I’m the best thing that ever happen to you, nigga\nYou know, say homeboy\nMy worst muthf-cking mistake was the best you ever hope for\nKnow what I’m saying, I forgot more shit than you could remember\nNigga, I got more muthaf-cking money in my chain draw than you got in your God damn bank roll nigga\nNigga anytime you want to nigga I match my change to your mutha-fcking dollars see who come up first know what I’m saying\nBig bank take little bank nigga wassup nigga?\nThese niggas thought I was just talkin when I came in this muf-cka talkin that Cage shit nigga\nLook at me know nigga what you see nigga?\nHuh?\nYeah, yeah, yeah, yeah\nGet your pen out take notes nigga\nDon’t Hate nigga! Ha!\nFuck that bullsh-t, Partna\nIt’s the muf-cka…\nAye man, Jay.. Ay, Jay talkin bout..\nJay say he made the Blueprint my nigga\nThis the muthaf-ckin’ Foundation nigga, ok?\nYeah, everything else would be built up off of this shit nigga\nAll Red-y yeah, yeah\nSay no more nigga everything understood don’t need to be explained\nRoss I got you nigga, say no more\nIt’s all good my nigga\nGrand Hustle PSC For Life Bitch Nigga!\nWest Side!\nIt’s on one bank here nigga\nCount, I told you! Didn’t I muthaf-ckin’ tell you? yeah!\nAight then, I’ll holla at ya’ll niggas on the motherf-cking Flipside nigga!\nA hundred million plus, a bus nigga, bitch nigga!", "image": "https://images.genius.com/f55abc725080eb05147e45ce3cd406a8.1000x1000x1.jpg"}], "artist": "T.I."}