{"songs": [{"title": "Shorty Wanna Be a Thug", "album": "All Eyez on Me", "year": "1996-02-13", "lyrics": "[Chorus]\nSaid he wanna be, shorty's gonna be a thug\nSaid he wanna be, one day he's gonna be\nSaid he's gonna be, shorty's gonna be a thug\nSaid he's gonna be, one day he's gonna be\nSaid he wanna be, shorty's gonna be a thug!\nSaid he wanna be, one day he's gonna be\nSaid he wanna be, shorty's gonna be a thug\n\n[Verse 1]\nWas a nice middle-class nigga\nBut no one knew the evil he'd do when he got a little bigger\nYou'd often find him blazed, for puffing on a Newport\nPlotting on another way to catch a case\nWas only 16, yet convicted as a felon\nWith a bunch of old niggas, but you the only one ain't tellin'\nI tell you it's a cold world, stay in school\nYou tell me it's a man's world, play the rules\nAnd fade fools, break rules until we major\nBlaze up, getting with hoes through my pager\nWas raised up, commence to money-makin' tactics, uh\nIt's getting drastic, niggas got automatics\nMy finger's on the trigger\nTell the Lord to make way for another straight thug nigga\nI'm sitting, getting buzzed, looking for some love\nFrom the homies, ‘cause shorty wanna be a thug\n\n[Chorus]\nSaid he's gonna be, said he's gonna be\nOne day he's gonna be, shorty's gonna be a thug\nSaid he's wanna be, said he's wanna be\nOne day he's gonna be, shorty's gonna be a thug\nSaid he's gonna be, one day he's gonna be\nSaid he wanna be, shorty's gonna be a thug\nSaid he wanna be, one day he's gonna be\nSaid he wanna be, shorty's gonna be a thug\n\n[Verse 2]\nStraight from the hall to the pen'\nAn adolescent nigga standing way higher than six feet ten\nHe carried weight, like a Mack truck\nGonna bust on playa haters, if them mothafuckas act tuff\nThen that's when, a lethal weapon with the razor\nThis little nigga smoking weed and getting blazed up\nNo one could figure, when the guns blast, pull the trigger\nCould take the life of a young nigga, guns bigger\nNo mother and father, you see, the nigga's all alone\nOld timers my role model, the war zone\nBeen laced with this game 'til it's a part of me\nMy heart don't beat no fear, and that ain't hard to see\nThe future is looking dim\nI'm tryin' to make a profit out of living in this sin\nI'm in the dark, getting buzzed, looking for some love\nOut with the homies, ‘cause shorty wanna be a thug\n\n[Chorus]\nSaid he's gonna be, said he's gonna be\nOne day he's gonna be, shorty's gonna be a thug\nSaid he's wanna be, one day he's gonna be\nSaid he's gonna be, shorty's gonna be a thug\nSaid he's wanna be, one day he's gonna be\nSaid he wanna be, shorty's gonna be a thug\nSaid he wanna be, one day he's gonna be\nSaid he wanna be, shorty's gonna be a thug\n\n[Outro]\nShorty's gonna be a thug\nLittle bad ass nigga, to the young niggas\nGotta stay sharp, nigga, play your part!\nGot plenty of time (you bad mothafuckas)\nYou only get three mistakes, and then it's life, big baby\n(Niggas craaazy) Watch the signs!\nDamn, nigga! Sixteen, nigga?\nSixteen?! Too bad, mothafuckers", "image": "https://images.genius.com/f0e663efef180da9b5d259005a1919e3.589x589x1.jpg"}], "artist": "2Pac"}