{"songs": [{"title": "Get High Rule The World", "album": "Da Drought 3", "year": "2007-04-13", "lyrics": "[Intro]\nDrought 3, hear my chains... ha!\nThat mean I'm ballin, bitch... if ya didn't know\nIf you wasn't informed, or somethin' like that\nThis is Da Drought 3, and um... check this out\n\n[Verse 1]\nYeah, imagine waking up out ya sleep to them pistols blastin\nAnd if the witness is dead, there's no trial\nIf you didn't know then, ho, well, ya know now\nAnd I don't mean basketball, when I say I don't know Yao\nMoney money money money: boost my morale\nPlay with my money money money: O.K. Corral\nI like a bitch with a apple bottom, like Vokal\nThe top is at my fingertips, like I ain't got no nails\nI got blood brothers bitch, I ain't got no pals\nI make a girl get low, like I ain't got no L's\nI'm a paper chasin' dog, check my toenails\nAnd I never miss a game, no Shaq O'Neal\nMore like Brett Favre, just like Brett Favre\nI been shot two times; just wipe that off\nBut I thank you for putting me right back, Lord\nAnd to you, Father, I would give my life back for it\nThat knife that sword; that gun, that war\nMake ya so-called soldiers just run like Gore\nYeah, Frank that is, from San Francis\nAnd I got more banana clips then chimpanzees\nTen addresses and I dresses\nLike I thinks I'm the muthafuckin' best there is\nAnd I'm about to bubble and she catch that fizz\nAnd I'm straight from Claiborne, nigga; just ask Liz\nCheck ya neck, there ain't a crook like this\nFrom the city where the judge throw the book at kids\nBurner in school, in my bookbag hid\nTalk stupid at lunch and we havin' ya ribs\nIf you are not home, then we havin' ya kids\nAnd if you can't come up with half, I'll send ya half of ya kid\nBack to the board, an extravagant crib\nI'm on the toilet watchin' Martin, just laughin' and shit\nDon't know why I get high, but I get high\nI get high like every single day\nWe do shit that them other women can't\nMary Jane, what is it you've done to me?\nI pop a beat and start rollin'\nAnd then I smoke it like a muthafuckin' stogie\nPeep how I wrote it, I was rappin to the\nDing-ding-ding-ding... fuck it\n\n[Hook]\nGet high, rule the world, and that's that\nI need all my funds, yeah, all my money baby\nBlack diamonds and pearls, believe that\nI made bling bling and my chest look like a mural\nI'm nuts, just call me Squirrel\n\n[Verse 2]\nMy fetish is the girls, but the women, not the girls\nAct your age, not your shoe size, maybe we can do the twirl\nI'll be the Prince of her Pearl-tongue, earring in her pearl-tongue\nIf she come, let her girl come, give her a pill, give her girl one\nParty time, excellent, yup, Wayne's World\nCampbell's soup on the wrist, just call me Earl\nLil' Marl, don't shoot em, ya heard?\nI get high, my words slur, I start callin 'em Merle\nHey, Merle, light that firre\nAnd I know this old, but I'm really \"Hot in Herre\"\nI went with the Phantom, my niggas coppin' the spurs\nMy hand's in the pot, I'd rather eat and stir\n\n[Hook]\nIt's I against the world, and I'm strapped... yeah\nI bring all my guns... shoot mothers, fathers, babies, damn!\nBlack hand guns to serve, we could see\nBut we are so blind to the signs they tryin' to lose the world\nAnd we will walk right up with our guns, yup, hand n' hand, yeah\nWe'll march right after the drum, but I don't need no band\nNigga, Drought 3", "image": "https://images.genius.com/32e1b9a7e336b3f316f0f5de4d6c2815.300x300x1.jpg"}], "artist": "Lil Wayne"}