{"songs": [{"title": "Sammy Da Bull", "album": "Searching for Jerry Garcia", "year": "2005-08-09", "lyrics": "[Hook: Nate Dogg]\nAll these niggas talkin 'bout what they gon' kill\nHeard you caught a misdemeanor then I heard you squeal\nHoldin hands with the D.A. while you made your deal\nThree thousand miles away and I could hear you still\nHalf these niggas snitchin yo and that's for real\nI know it's hard to swallow, that's a big ol' pill\nIf I catch you motherfuckers you gon' catch some steel\nI know it might sound crazy, that's the way I feel\n\n[Proof]\nUhh, trace this to it's basis, no movie script\nNo yay, no pounds, no uzi clips\nNot a car, no bling, know a bougie bitch\nYou got all of these rappers sayin they movin bricks\nThey whole cliques switch with boob and tits\nIf you're - truly bitch, then they'll - usually snitch\nIn a roundabout way I say my toolies spit\nBut if it come to coppin a plea, it includes the fifth!\nThe mood is flipped cause spirits see the diaphragms\nGangsta rappers with murderers for hired hands\nPolice and riot vans, callin us pirate clans\nGovernment guide hands, with private plans\nTo damage the game, it's a shame to survive a scam\nCause we high off liquor, bitches and Vicadin\nYell out we gon' strike again, so triflin\nGot kids idlin the vest to riflin (look Ma!)\nWhy you make a fake life in pens?\nGlorify the hood but never a Bible hymn\nAnd as the streets keep tyin in\nUntil the Feds indict the fans just for buyin in, where's the violin?\n\n[Hook]\n\n[Swifty McVay]\nHah, are you the guy that told the guy that I'm the guy that gave the guy\nA half a P; now the police is after me\nAskin me questions, tellin me shit you only knew\nPulled up on me out the blue, all this shit because of you\nI should do somethin' cruel bitch, snitchin like Samuel Bull, snitchin like Samuel Bull\nNow yo' life's fucked up, and I'm announcin you responsible\nAnd I'm cut the fuck up, and whatchu gonna do but sit yo' ass there\nSo what? Ain't nothin fair\nWhen a nigga like you get carried away without your lips\nAnd they wonderin why Swifty McVay be killin shit (AHH!)\nI drop you off and get lost, come back the same day\nWitcho' tongue cut off nigga, it's cursed anyway\nYou the one who can't count, so give my G's up (straight up)\nAnd when it comes to shootin you the one who freeze up\nThat's why yo' broke ass could swallow these nuts\nAnd folks ask, tryna follow everything that reads up\nOn your report you made, I will escort you to your grave\nTryna see me behind bars so you can get paid?\nThat's negative, you threaten my life? I CAN'T let you live\nThen you think that it'll catch up to your momma and your kids snitch {AHH!}\n\n[Hook]\n\n[Proof]\nIf you aim for slugs that's blazed by killers\nNow the game done changed these niggas out here praisin squealers\nGo Proof - my behavior's iller when tellin the truth\nExpunge my gun nigga like any paid felon'll do\nMy spoken is well in the truth, you in hell and the Proof\nFrom the block to the jail or the booth\nBad boy image shall illuminate in silence\nGangsta, one that communicates through violence\nGo Proof - not through yappin or hostile rappin\nAll on TV vest up and Glocks go flashin\nIt's all actin - y'all just\nDon't see the director behind the camera that yells out \"Action\" (take one!)\nBlowin off the door hinge to a world in orbit\nWhere the masses have supportive recorded performance\nThere's enormous shortage of poor kids\nWith new deals, they will become distorted and tortured\nAnd I ain't losin like 'Pac, there's rules on my block\nI'm from Detroit bitch, it ain't cool to be shot [gunshots]\n\n(Is he still alive?)\n(Yeah yeah, I think so)\n(Alright great, let's sign him!)\n\n[Hook]\n\n[Outro: Proof]\nHeh, aiyyo dig this\nIf you tell the masses, you tell the cops\nBut if that street yappin made you famous, then you a star\nStar; hey, write down \"star\"\nWrite down \"star\" on a piece of paper\nHold it up in front of you, right in the mirror\nPut it in the mirror\nHold it up in front of you, and that's YOU\nWe don't like you [laughs]\nHolla at me, fix it faggots..", "image": "https://images.genius.com/ab9a6517cd52ed1370641d9d44571fdd.500x500x1.jpg"}], "artist": "Proof"}