{"songs": [{"title": "Nuthin’ but a ‘G’ Thang (Freestyle mix)", "album": null, "year": null, "lyrics": "Nuthin' But A \"G\" Thang [Tha' cut!!]\n- Dr. Dre\n\nOne, two, three and to the fo'\nSnoop Doggy Dogg and Dr. Dre are at the do'\nReady to make an entrance, so back on up\n[or you know im'a have to rip shit up]\nGimme the microphone first, so I can bust like a bubble\nCompton and Long Beach together, now you know you in trouble\nAin't nothin' but a G thang, baaaaabay!\nTwo loced out niggas we're craaaaazay!\nDeath Row is the label that paaaaays me!\nUnfadable, so please don't try to fade this [Hell yeah]\nBut, i'm, back to the lecture at hand\nPerfection is perfected, so I'm a land 'em, understand?\nFrom a young G's perspective\nAnd before me dig out a trick I have ta' find a contraceptive\nYou never know she could be earnin' her man\nLearnin' her man, and at the same time burnin' her man\nNow you know i ain't with that shit luietenat\nCause ain't no lovin' good enough to get burned while I'm up in it [Yeah]\nNow that's realer than real-deal Holyfield\nAnd now all you hookas and ho's know how I feel\nWell if it's good enough to give 'em all a proper chunk\nI'll take a small piece of some of that funky stuff\n\n[Chorus 1]\nIt's like this and like that and like this and uh\nIt's like that and like this and like that and uh\nIt's like this and like that and like this and uh\nDre., creep to the mic like a phantom\nWell I'm peepin', and I'm creepin', and I'm creep-in'\nBut I damn near got capped, cause my beeper kept beepin'\nNow it's time for me to make my impression felt\nSo sit back, relax, and strap on your seatbelt\nYou never been on a ride like this befo'\nWith a producer who can rap and control the micro\nAt the same time with the dope rhyme that I kick\nYou know, and I know, I funks up on funky sh-[yeah]\nTo add to my collection, the selection\nSymbolizes dope, take a tope but don't choke\nIf ya' do, ya' have no clue\n\nO' what me and my homey Snoop Dogg came to do\n\n[Chorus 2]\nIt's like this and like that and like this and uh\nIt's like that and like this and like that and uh\nIt's like this, and we ain't got no love for those\nSo jus' chill, 'til the next episode\n[Tha' mix]\nFallin' back on that ass with a hellified gangsta' lean\nGettin' funky on the mic like a' old batch o' collard greens\nIt's the capital S, oh yes, the fresh N double O P\nD O double G Y D O double G ya' see\nShowin' much flex when it's time to wreck a mic\nHippin' ho's and clockin' a grip like my name was Dolomite\nYeah, and it don't quit\nI think they in a mood for some mathaf**k'n g shit\nSo Dre. [What up Dogg?]\nWe gotta give 'em what dey want [What's that, G?]\nWe gotta break 'em off somethin' [Hell yeah]\nAnd it's gotta be bumpin' [City of Compton!]\nIt's where it's explained, so I'm a ask your attention\nMind like a mathaf**ka but i ain't linchin\nDroppin' the funky tracks is makin' the suckas niggas mumble\nWhen I'm on the mic, it's like a cookie, they all crumble\nTry to get close, and you're ass i'll get smacked\nMy mathaf**kn homey Snoop Doggy Dogg has got my back\nNever let me slip, cause if I slip, then I'm slippin'\nBut if I got my Nina, then you know I'm straight trippin'\nAnd I'm a continue to put the rap down, put the mac down\nAnd if you bitches talk shit, I have ta' put the smack down\nYeah, and ya' don't stop\nI told you I'm just like a clock when I tick and I tock\nBut I'm never off, always on 'til the break dawn\nC O M P T O N, and the city they call Long Beach\nPuttin' the shit together\nLike my homey D.O.C., no one can do it better\n\n[Chorus 3]\nLike this, that and this and uh\nIt's like that and like this and like that and uh\nIt's like this, and we ain't got no love for those\nSo jus' chill, 'til the next episode", "image": "https://images.genius.com/bf3badae49c33b583126057638078bd8.576x576x1.jpg"}], "artist": "Dr. Dre"}