{"songs": [{"title": "What Up Gangsta", "album": "Get Rich or Die Tryin’", "year": "2003-02-06", "lyrics": "[Intro]\nG-Unit (BO!), we in here (BO!)\nWe can get the drama popping we don't care (BO! BO! BO!)\nIt's going down (BO!), 'cause I'm around (BO!)\n50 Cent, you know how I gets down, down\n\n[Chorus]\nWhat up, blood? (WHAT)\nWhat up, cuz? (WHAT)\nWhat up, blood? (WHAT)\nWhat up, gangsta?\nWhat up, blood? (WHAT)\nWhat up, cuz? (WHAT)\nWhat up, blood? (WHAT)\nWhat up, gangsta?\n\n[Verse 1]\nThey say I walk around like I got an S on my chest\nNah, that's a semi-auto, in a vest on my chest\nI try not to say nothing, the DA might want to play in court\nBut I'll hunt a duck nigga down like it's a sport\nFront on me, I'll cut you, gun-butt you or buck you\nYou getting money, I can't get none with ya, then fuck ya\nI'm not the type to get knocked for D.W.I\nI'm the type that'll kill your connect when the coke price rise\nGangstas, they bump my shit, them they know me\nI grew up around some niggas that's not my homies\nHundred G's I stash it (what), the MAC I blast it (yeah)\nD's come we dump the diesel in battery acid\nThis flow's been mastered, the ice I flash it\nJux me, I'll have your mama picking out your casket, bastard\nI'm on the next level, Breitling baguette bezel\nBenz pedal to the metal, hotter than a tea kettle, blood\n\n[Chorus]\n(WHAT)\nWhat up, cuz? (WHAT)\nWhat up, blood? (WHAT)\nWhat up, gangsta?\nWhat up, blood? (WHAT)\nWhat up, cuz? (WHAT)\nWhat up, blood? (WHAT)\nWhat up, gangsta?\n\n[Bridge]\nWe don't play that\nWe don't play that\nWe don't play that (G-Unit)\nWe don't play around\n\n[Verse 2]\nI sit back, twist the best bud, burn and wonder\nWhen gangstas bump my shit, can they hear my hunger?\nWhen the fifth kick, duck quick, it sounds like thunder\nIn December I'll make your block feel like summer\nThe rap critics say I can rhyme, the fiends say my dope is a nine\nEvery chick I fuck with is a dime\nI'm like Patti LaBelle, homie I'm on my own\nWhere I lay my hat's my home, I'm a rolling stone\nCross my path I'll crush ya, thinking I won't touch ya\nI'll have your ass using a wheelchair, cane, or crutches\nIndustry hoes fuck us, in the hood they love us\nStomp a bone out your ass with some brand new Chukkas\n\n[Chorus]\nWhat up, blood? (WHAT)\nWhat up, cuz? (WHAT)\nWhat up, blood? (WHAT)\nWhat up, gangsta?\nWhat up, blood? (WHAT)\nWhat up, cuz? (WHAT)\nWhat up, blood? (WHAT)\nWhat up, gangsta?\n\n[Outro]\nWe don't play that\nWe don't play that\nWe don't play that (G-Unit)\nWe don't play around\nWe don't play that\nWe don't play that\nWe don't play that (G-Unit)\nWe don't play around\nWe don't play that\nWe don't play that\nWe don't play that (G-Unit)\nWe don't play around\nWe don't play that\nWe don't play that\nWe don't play that (G-Unit)\nWe don't play around", "image": "https://images.genius.com/17bdb55979efe915f90e0fa67b92ad61.1000x1000x1.jpg"}], "artist": "50 Cent"}