{"songs": [{"title": "Bomb First (My Second Reply)", "album": "The Don Killuminati: The 7 Day Theory", "year": "1996-11-05", "lyrics": "[Intro: Press Release]\nIn today's music news: the ever-controversial 2Pac Shakur has just released another album under the alias \"Makaveli.\" Music insiders are running wild trying to rearrange other artists' street dates in fear of a wipeout in retail inter-chart movement. Although no one knows the exact cause of the new album, resources tell me a number of less fortunate rappers have joined together in conspiracy to assassinate the character of not only Mr Shakur but of Death Row Records as well. Nas, the alleged ring leader, is furious at 2Pac's – excuse me – Makaveli's verbal assault on Mobb Sleep, Notorious P.I.G., and several other New York rappers. JAY-Z from \"Hawaiian Sophie\" fame, Big Little whatever, and several other corny-sounding motherfuckers are understandably shaken up by this release. The question everybody wants to know is: why'd they get this nigga started? 2Pac – rather Makaveli – was not available for comment but released this statement:\n\n[Spoken: 2Pac]\nIt's not about East or West\nIt's about niggas and bitches\nPower and money, ridaz and punks\nWhich side are you on?\n*Heartbeat* *Gunshots*\n*Encroaching footsteps*\nThese niggas is still fuckin' talkin'?\nYou niggas still breathin'? Fuckin' roaches\nA'ight, it's the Raid on cockroaches\nPunk motherfuckers, this is it (Makaveli The Don)\nKilluminati Style (all day) (up in your ass)\n(Bomb first) (Outlaw Ridahz) Solo shit, bring it!\n\n[Verse 1: 2Pac]\nAllow me to introduce first: Makaveli the Don\nHysterical, spiritual lyrics like The Holy Qur'an\nNiggas get shook like 5-0\nMy .45 is next to me when we ride, for survival\nMoney-makin' plans, pistol close at hand, swollen pockets\nLet me introduce the topic, then we drop it\nExpose snakes ‘cause they breed freely\nSee me rise, located worldwide like the art of graffiti\nI think I'm tougher than Nitti, my attitude is shitty\nBorn on a dope fiend's titty, in every city\nYou'll find me, look for trouble right behind me\nMy Outlaw niggas down to die for me, nah mean?\nI hit the scene, niggas duckin' from my guillotine stare\nI'm right there, my every word a fuckin' nightmare\nGet me high, let me see the sun rise and fall\nThis for my dogs, down to die for y'all\nExtreme venom, no mercy when we all up in ’em\nCut ’em down, to Hell is where we send ’em\nMy whole team trained to explode, ride or die\nMurder motherfuckers lyrically and I'm not gonna cry\nMe, a born leader, never leave the block without my heater\nTwo big pits, I call them \"my bitch-nigga eaters\"\nAnd not a whimper until I'm gone\nThug Life runnin' through my veins so I'm strong\nBye bye bye, let's get high and ride\nOh, how do we do these niggas, but I'm not gonna cry\nI'm a Bad Boy killer, JAY-Z die too\nLookin' out for Mobb Deep, nigga, when I find you\nWeak motherfuckers don't deserve to breathe\nHow many niggas down to die for me? Yay-yay!\nWest Coast rider, comin' right behind ya\nShould have never fucked with me\nI want money, hoes, sex and weed\nI won't rest until my road dog's free – bomb first\n\n[Chorus: 2Pac]\nWe bomb first when we ride\nPlease reconsider 'fore you die\nWe ain't even come to hurt nobody tonight\nBut it's my life or your life, and I'ma bomb first\nWe bomb first when we ride\nPlease reconsider 'fore you die\nWe ain't even come to fight tonight\nBut it's my life or your life, and I'ma bomb first\n\n[Verse 2: E.D.I. Mean]\nFor so many days, in so many ways we've been duckin' strays\nThey delivers, but still we some Bad Boy killers\nGot nuttin' to lose, I gots nowhere to go\nI only got one home, see me stranded on Death Row\nWith Outlawz, it's Makaveli be the general\nAnd I be a soldier on a mission, sent to do what you'll never do\nAnd that's ride for the cause, yes, I'll die for the cause\nYou best believe, if I'ma leave this bitch, yo I'm dyin' with yours\nKamikaze, sicker than a ma'fuckin' Nazi\nGot a little question for that nigga that made \"Paparazzi\"\nIf you ain't in this rap game for the motherfuckin' cash, mane\nThen what is your motherfuckin' purpose? Narcing service\nE.D.I. Mean, born worthless\nThat's until the day I decided to bomb first, bitch!\n\n[Bridge: 2Pac]\nBiatch! Come on, bring it, down with it!\nThen we ride\nCome on, bring it\nBomb first when we ride\nHey, get that nigga!\n\n[Verse 3: Young Noble]\nYour style wack as ever, like you was rockin' patent leather\nCausin' massive terror, y'all niggas lack, you ain't thorough\nHalf rapper, half drug kingpin, you're tellin' fairy tales, dunn\n\"King of New York\" like you the motherfuckin' one?\nBut I'm from Jers', we don't play that shit\nFrom the Clare down to North Bricks all my niggas flippin’ chips\nGettin’ rich, even though it's hard\nTryna creep through these halls and brawls without scarred by a revolve'\nWith no warning signs, ‘cause yo, my man took five\nNow I'm the youngin with the 9 ready to put in my time\n\n[Outro: 2Pac]\nShoot first, look at their head, burst bleeding\nDon't want to hear no shit this evening, believe me\nWe bomb first when we ride\nPlease reconsider 'fore you die\nG's and thug niggas on the rise\nPlan, plot, strategize, and bomb first\nWe bomb first when we ride\nPlease reconsider 'fore you die\nG's and thug niggas on the rise\nPlan, plot, strategize, and bomb first\n\n[Segue to \"Hail Mary\"]\nLet us pray, my nigga\n'Cause we definitely have sinned", "image": "https://images.genius.com/de81f90d8bf5ccdc5b74c71182edc9d2.600x600x1.jpg"}], "artist": "2Pac"}