{"songs": [{"title": "How High", "album": null, "year": null, "lyrics": "Takin it from the top?\nTippy? Tippy?\nHow high?\nThe Ultimate high\n'Scuse me as I kiss the sky\nSing a song of six pence, a pocket full a rye\nWho the fuck wanna die for their culture?\nStalk the dead body like a vulture\nTical get, blacker than your blackest stallion\nHit your house'n projects, I represent the Shaolin my nigga\nHell yes, 'Apocalypse Now', the gun blow\nIt be goin' down, diggy diggy down diggy down down\nWhile the planets and the stars and the moons collapse\nWhen I raise my trigga finga all y'all niggas hit the decks\n'Cause ain't no need for that, hustlers and hardcores\nRaw to the floor raw like Reservoir Dogs\nThe Green-Eyed Bandit can't stand it\nWith more Fruitier Loops then that Toucan Sam Bitch\nPlus, the Bombazee got me wild\nFuckin' with us is a straight suicide\n10 9 8 7 6 5 4 3 2 Murder 1, lyric at your door\nTical bring it to that ass raw\nBreakin' all the rules like glass jaws\nNigga, you got to get mine to get yours\nFucka, we don't need no rap tour\nI'd rather kick the facts and catch you with the rapture\nMore than you bargained for\nTical, that stays open like an all night store\nFor real, I keeps it ill like a piece of blue steel\nPointed at your temple with the intent to kill\nAnd end your existence, M-E-T\nAin't no use for resistance, H-O-D\nI bees the ultimate rush to any nigga on dust\nThe Egyptian Musk use to have me pull mad sluts\nI shift like a clutch with the Ruck\nExamine my nuts, I don't stop till I get enough\nYour shit broke down, light your flare\nSince the dark side tears you into Hollywood squares\n6 million ways to die, so I chose\nMade it 6 million and 1 with your eyes closed\nThe blindfold, cold, so you can feel the rap\nAnd shatter the glass and second half on your monkey ass\nAnd yo my man, hit me now\n(Tical)\nBitches use to play me, now they can't forget me now\nForget me not, I rock the spot, check Glock\nEmpty off a lickin' off a hip hop\nFuck the billboard, I'm a bullet on my block\nHow you dope when you payed for your Billboard spot?\nLook up in the sky, it's a bird, it's a plane\nIt's the funk doctor spock smokin' Buddha on a train\nHow high? So high that I can kiss the sky\nHow sick? So sick that you can suck my dick\nLook up in the sky it's a bird it's a plane\nRecognize, Johnny Blaze, ain't a damn thing changed\nHow high? So high that I can kiss the sky\nHow sick? So sick that you can suck my dick\n'Til my man Raider Ruckus come home\nIt ain't really on till the Ruckus get, home\nPuff a meth bone, now I'm off to the red zone\nWe don't need your dirt weed we got a fuckin' O\nCheck it, I brings havoc with my hectic\nBring the Pain lyrics screamin' for the antiseptic\nMovin' on your left kid, and I'm methted, out my fuckin' dome piece\nPlus I got no love for the beast\nHailin' from the big East Coast\nWhere niggas pack toast\nHome of the drug kingpins and cut throats\n(Hey boy, you's the rude boy on the block)\n(You try and stop the bum rush you will get popped)\nAs I run around with a racist\nMy style was born in the 50 stair cases\nDig it, eff a rap critic\nHe talk about it while I live it\nIf Red got the blunt, I'm the second one to hit it\nLook up in the, I got the verbs, nouns and Glocks in ya\nEnter the centa, lyrics bang like rico-chet\nRabbit, I brings havoc with an A-K matic\nRollin' blunts an all day habit\nI get it on like Smif'n'Wes\nPunks take a sip and test\nWho split your vest\nThe funk phenomenon\nI'm bombin' you like Lebanon\nBlow canals of Panama\nJust off stamina\nStyles not to be fucked with, or played with\nFuck the pretty hoes, I love those, Section A Bitches\nHittin' switches, twistin' wigs with\nFat radical mathematical type scriptures\nI dig up in your planets like Diga\nBoo, scared you, blew you to smithereens\nFuck the marines, I got machines\nTo light the spliff, and read Mad magazine\nI fly more heads than Continental\nWreck ya 5 times like US AIR off an instrumental\nLook I'm not a half way crook with bad looks\nBut I may murder your case like your name was Cal Brooks\nI breaks 'em up proppa\nAsk Biggie Smalls 'Who Shot Ya'\nFunk doctor, with the 12 Gauge Mossberg\nLook, I got the tools like Rickle\nTo make your mind tickle\nFor the nine nickle\n(Yo Red, yo Red)\nPunk ass pussy ass\n(You ain't gotta say no more man, that's it)\nWord up Tical, we out\n(It's over)", "image": "https://images.genius.com/fe6629f7a5e6af0aa38ca87547ced96f.1000x562x1.jpg"}], "artist": "Method Man"}