{"songs": [{"title": "What’s Yo Name?", "album": "I’m Serious", "year": "2001-10-09", "lyrics": "[T.I.]\nYo, Uh (12x), a come on T.I.P\n\n{Pharrell}\nCome on (4x), I said come on, come on, come on, come on\n\nVerse 1: T.I.P\n\nAh I was trained to spit game from the get green\nAy T.I.P. been bangin' thick dames since he was 15\nThe click came ran trains if her shit clean\nThe same broad'll front on yall like she Miss Thang\nAnd damn how da bitch seem she's a dick fiend\nAlthough I won't elaborate I'll say she lick things and get green\nShe fuck wit me because I got big dreams\nAnd along wit a face she think she seen on the big screen\nI give it to her 'til she whine and her back hurt\nThen drive her crazy 'til she crying and she act worse\nYeah, I'm a rapper, I'm a man, but I'm a mack first\nI need a broad wit a bank and a fat purse... and that's first\n\nHook: {T.I. & Pharrell}1x\n\n[T]\nI'm a p-i-m, ah, m-p\nTold y'all niggas before about me\nPlenty Remi to the h-e, ah, a-d\n\n[P]\nSomebody buy some more dro' so we can smoke please\nNow what's yo name?\n\n[T] I'm pussy bumper number one\n\n[P] Yeah, I said what's yo name?\n\n[T] I'm pussy bumper number one\n\nVerse 2: T.I.P\n\nMan trying to stop pimpin like shooting a bee-bee gun at a freight train\nSo comparing us is like wine to a grape stain\nMy reputation's great mayn, I got a great name\nI hate lames, I stake claims, and I break dames\nI like 'em small or bigger with a figure eight frame\nSo if she fine I bet she mine when I find time\nMan I ain't lying, mine dimes I don't wine or dine\nLike clothesline hoes mine, I'm a goldmine\nAy I'm the \"King of Da South\" and the throne mine\nI got the chrome in the Chevy and the Brougham mine\nAy man I'm young but I been doing it for a long time\nThat ain't my fault that bitch grown she got her own mind\nAh-and I'm...\n\nHook: 1x\n\nVerse 3:\n\nI bet some niggas think I cake her when I take her out\nBut come next week just watch me rape her fucking bank account\nEventually the P$C hey we gone take the south\nThen grab the earth by the ankles and shake the paper out\nNigga I'm bout my paper route so I'm gone make a route\nAnybody blocking my road to riches man I'm gone take 'em out\nKeep runnin yo mouth making up you mind you got's to be's wit out\nMe I'mma git a ho who gone make show my pockets seen about\nBig p-i-m-p-i-n-g is all I be's about\nI break a ho in break 'em til they broke and then I ease 'em out\nThey out of pocket, I'mma lock 'em out and leave 'em out\nAnd that don't change man, season in season out\nOpen up The Source shawty and see who just you reads about\nIf it ain't concerning T.I.P. or P$C he out\nAin't nothing if you ain't cuttin then u don't see the house\nBecause you know I got to practice what I preach about\n\nHooK: 1x\n\n[Neptunes]\nCome on (4x) I said come on, come on, come on, come on\n(repeat)\n\n[T.I.]\nI'm a p-i-m, ah, m-p\nTold y'all niggas before about me\nPlenty Remi to the h-e, ah, a-d", "image": "https://images.genius.com/d4010b5f2aa7374582fd8c3be5913af3.1000x1000x1.jpg"}], "artist": "T.I."}