{"songs": [{"title": "Runaway (Watch The Throne Tour Freestyle)", "album": null, "year": null, "lyrics": "[Intro 2x]\nRunaway, did I make you runaway? Did I make you runaway?\nHow many people came with the one they love tonight?\n\n[Verse 1]\nYou know love ain't always gon' be easy\nEspecially when people in your business like the way they do Yeezy\nAnd ladies? I know you girls gon' be\nAlways talk 'bout what he did\nFellas? I know you guys\nAlways talk 'bout what she did\nY'all be going through up's and down's\nHavin' fights and shit\nI want you do a favor\nFirst of all, just for the ladies\nI just want you do me more favor\nAnd y'all please now checking e-mails, cause I\nGot it in the e-mails so guys get away with shit and some\nI'm just serious, I'm just serious, I'm just serious\nBut for real 'bout tonight\n\n[Hook 2x]\nIf you love someone tonight hold onto'em real tight\nIf you love somebody tonight hold onto'em real tight, real tight, real tight\n\n[Verse 2]\nCause I always find, yeah I always find\nIf I told you I can make ... tonight\nDon't listen to me baby cause I'm an asshole\nAnd you always find, and you always find\nYeah I always find, yeah I always find\nIf I told you I can make the way to heaven tonight\nDon't listen to me baby cause I'm an asshole\nAnd you always find, yeah you always find\nYeah I always find, yeah I always find\nIf I told you I won every single bill 'bout you every minute I had to\nDon't listen to me cause I'm an asshole\nAnd you always found and the one place I fucked up\nI thought you'd always be mine, I thought you'd always be mine\nI thought you'd always be mine and if I say I didn't love you, I was lying\nI swear to God I was lying, I swear to God I was lying\nI swear to God I was lying, I swear to God I was lying\n\n[Bridge]\nSo do me a favor\n\n[Hook 2x]\nIf you love someone tonight hold onto'em real tight\nIf you love somebody tonight hold onto'em real tight, real tight, real tight", "image": "https://images.genius.com/70c6e506a91f6dabdd23cad304812ce3.533x533x1.jpg"}], "artist": "Kanye West"}