{"songs": [{"title": "The Embassy", "album": "The Ecstatic", "year": "2009-06-09", "lyrics": "Boogey (Boogey) man (man)\n\n\"This is your captain speaking, with just a little flight information\nComing up on the left we're going to be catching a glimpse of the Grand Canyon\nOn the right you can be able to see the Hoover Dam\nIn just a a few minutes. We're flying at an altitude of 37,000 feet\nAnd our air speed is four hundred miles an hour...\nCouple a little facts here, I'm packing a Colt King Cobra\nThat's a .357 caliber firearm with a black rubber-grip and a six inch barrel\nAlso, the co-pilot is carrying a Kimber Custom defense pistol with all the bells and whistles you'd expect from a custom gun of that kind with an alloy frame and bevel treatment on the entire gun\nAnd our Chief Flight Attendant Roger has a uh Ruger Bearcat, that .22 with a hand-fluted cylinder\nAll three are capable of piercing body\nArmor at a distance of up to twenty-seven feet and you can put a hole\nIn human bone and flesh the size of the Grand Canyon, which\nBy the way is coming up on the left hand side of the plane, so just\nSit back, relax, and enjoy the rest of your flight...\"\n\n[Mos Def]\nFrom the top, la, la, la, la...\nLa, la, la, la, lalalalala...\nLa, la, la, la... la-la-la-la-la-la-la-la\nMentioned that he worked for the embassy\nPeople seem to find that interesting\nHigh status, intrigue and mystery\nSpecial code name on the hotel registry\nI love it when they say\n\"Enjoy your stay\"\nThey say how they mean it\nCause that's the way they been trained\nShow you to your room\nA suite with a view\nWhen, if anything at all\nDo not hesitate to call\nNice! The greatest, the greatest\nCompliments, tooth brush, tooth paste, razors\nA Bible, a Qur'an in a drawer\nOr depending where you are\nTend to whisper through the walls\nShe was calling on God\nThe greatest, the greatest\nSalutations, congratulations\nReservations, exclusive arrangements\nDinner with the patrons, the scenery is amazing\nIt's so outrageous, they whisper when they say it\nWhen it's really real it's even realer than \"The Matrix\"\nClassic, modern, ancient, flagrant\nGet a special thrill every time they get to say it\nPeace! I work with the embassy\nOn behalf of imagination industry\nI come visit, you come visit\nSuch a pleasure, official business\nLa, la, la, la...\nLa, la, la, la, la-la-la-la...\n(Boogey, boogey, man, man)\nLa, la, la, la...la-la-la-la-la-la-la-la\nThe Embassy...greetings", "image": "https://images.genius.com/b13acc0fe75405f9fde88d9e60c03a7a.640x640x1.jpg"}], "artist": "Yasiin Bey"}