{"songs": [{"title": "Twisted", "album": "Animal Ambition: An Untamed Desire To Win", "year": "2014-05-20", "lyrics": "[Intro: Mr. Probz (50 Cent)]\nHere's a little info you should know (it's 50)\nYou don't know what you're in for\nWhat you're in for (c'mon)\n\n[Chorus: Mr. Probz (50 Cent)]\nWe get the party rockin', bottles poppin'\nTonight we gon' turn up 'til we (yeah) twisted, yeah\n(Yeah, yeah, yeah, yeah)\nSystem thumpin', the club is jumpin'\nTonight we gon' turn up 'til we twisted, yeah\n(Yeah, yeah, yeah, yeah-yeah)\n\n[Verse 1: 50 Cent]\nLet's toast to success and take it a little higher\nMay tomorrow bring you everything your heart desires\nLet your driving ambition offer you new visions\nMay your gut-instinct help you make good decisions\nThis is more than Champagne, this is more than just a glass\nThis is a symbol of accomplishment we rarely ever had (ha ha!)\nLet's enjoy tonight like tonight's our last\nWe can focus on the future and reflect on the past (WOOO!)\nWe done came so far, I mean, look where we are\nIf they don't call us by name they call us entrepreneurs\nFrom the block to the board room, the hood to the high life\nSkyscraper paper, baby, life in the limelight\nWant the best of the best, the top of the top\nI mean the baddest bitches, you know, the cream of the crop\nWe gotta hustle and have it, we better than average (uh)\nMore like the elite, my nigga, we gotta eat, c'mon\n\n[Chorus: Mr. Probz (50 Cent)]\nWe get the party rockin', bottles poppin'\nTonight we gon' turn up 'til we (turn up) twisted, yeah\n(Yeah, yeah, yeah, yeah)\nSystem thumpin', the club is jumpin'\nTonight we gon' turn up 'til we (c'mon, c'mon) twisted, yeah\n(Yeah, yeah, yeah, yeah-yeah)\n\n[Verse 2: 50 Cent]\nWhat was once a strike against us has become an advantage\n'Cause we grind when we at it like we stone-cold addicts\nThat mastermind, the mental is oh so essential (uh)\nProduct of the environment (uh), they ain't been what we've been through (yeah)\nI'm fond of the phrase \"If there's a will, there's a way\"\n'Cause we come from the parts where only killers could play\nSouthside (Southside), it's alright\nGhetto's my Alma Mater huh? It's alright (WOOO!)\nWe could keep the party jumpin' like this all night\nThe bottles, just keep 'em comin', baby, let's get right\nLet's get it on, play a little Marvin\nIt’s gettin' hot in here, homie, this could be a problem\nKeni Burke style, let's keep rising to the top (uh)\nLet's do it, do it big and let a fuckin' hater watch, oh yeah\nThis is perfect, this a moment to remember\nAs we proceed on our money getting agenda, c'mon\n\n[Chorus: Mr. Probz (50 Cent)]\nWe get the party rockin', bottles poppin'\nTonight we gon' turn up 'til we (turn up) twisted, yeah\n(Yeah, yeah, yeah, yeah)\nSystem thumpin', the club is jumpin'\nTonight we gon' turn up 'til we twisted, yeah\n(Yeah, yeah, yeah, yeah-yeah)", "image": "https://images.genius.com/91fab3acc919c16f0f7aef5b0463e19c.600x600x1.jpg"}], "artist": "50 Cent"}