{"songs": [{"title": "The Die", "album": "Lupe Fiasco’s The Cool", "year": "2007-12-18", "lyrics": "[Intro: Lupe Fiasco]\nI present the death of The Cool\n\n[Verse 1: Lupe Fiasco]\nWell I herd like groups of cows\nThat all your enemies wanna shoot you down\nThey got AK-47's and a bunch of Mac-11's\nSemi-automatic weapons that produce ka-pows\nWord on the street is they all got heaters\nThey gon' hit you up, you ain't even gonna see it\nYou got a lot of money, I ain't tryin' to be funny\nBut they say where you goin', you ain't even gonna need it\nI seen you ridin' round, shinin' with your fine round\nDiamonds, pretty green eyed lady\nBeen on the sideline, plottin' while you prime time, poppin'\nHungry niggas want a piece of your pastry\nI suggest you protect your bakery cause they comin' for your head\nAnd there's a bounty on the chain that's hangin' from your neck, you see\n\n[Hook: Lupe Fiasco]\nI don't know what you been told in your ear\nBut I hear it's goin' down, somebody gotta (Die!)\nI don't know what you been told in your ear\nBut here's what's goin' round, somebody gotta (Die!)\n\n[Verse 2: GemStones]\nHit a nigga, put the mini Mac strap, clap\nAny nigga think he gettin' G's down here\nEnemy to any nigga gettin' money on my honey\nMan I heard Michael Young is the real clown here\nRun upon a nigga from the back with a Mac\nGon' be strapped cause a nigga finna' squeeze off ten\nRun upon this nigga 'lac, rat-a-tat-tat\nClick-clack, where this nigga at? I needs in\nShit is going down if ever I see him\nRub a nigga out like Oxy 10\nAnd keep a couple of dollars up in the wallet\nTo pay the cops so they can never box me in\nThat's what I'm thinkin' 'bout\nRidin' around polishin' this big pistol\nI'mma catch him in the wind, pray the gun don't jam\nSo, until we meet again, nigga, it's cool\n\n[Hook: Lupe Fiasco]\nI don't know what you been told in your ear\nBut I hear it's goin' down, somebody gotta (Die!)\nI don't know what you been told in your ear\nBut here's what's goin' round, somebody gotta (Die!)\n\n[Verse 3: Lupe Fiasco and GemStones]\n[Lupe Fiasco]\nDon't pay them niggas no mind, they hatin' on you\nAin't nobody with a shotty out plannin' to do a robbery\nItchin' to catch a body creepin'\nIn the stolen jalopy out there waitin' on you\n\n[GemStones]\nI'm sittin' in this stolen car finna rob this nigga\nShould I let the mini Mac or the shotgun hit him?\nI been waitin' all day tryin' to spot this nigga\nI can't let him get away I'mma pop this nigga, UH!\n\n[Lupe Fiasco]\nPlus they don't know about the choppa in the trunk\nThe Glocks in the box and the 9 on tuck\nThe bulletproof glass, the 40 in the stash\nI pull the steering wheel and it pop all up\n\n[GemStones]\n40 caliber stashed up in his dash box\nBulletproof windows you couldn't break 'em with a pad lock\nAK in the trunk, where the sounds bump\n2 twin Glock 40's, and a 9 in his damn crotch\n\n[Lupe Fiasco]\nMan, we finna go up in this club, show a little love\nGet a few drinks, holla at some girls\nSnatch up a pair, leave outta there\nPut some dro' in the air then go get some grub\n\n[GemStones]\nThey finna go up in the club, show a little love\nGet a few drinks, holla at some girls\nSnatch up a pair, leave outta there\nPut some dro in the air then catch a few slugs\n\n[Lupe]\nHey, hey, pull over right here, I gotta take a pee\nAnd don't go nowhere, nigga wait for me\nAnd if some niggas do kill ya in the next few minutes\nJust remember, my nigga, there's a heaven for a G\n\n[Outro: Lupe Fiasco and Gemstones]\n\n[Lupe Fiasco]\nAy, ay hold this right there\nI'll be, I'll be right back--I gotta take a piss man hold on\nFa sho. Ay man, ay don't leave i'll be right back\nAy don't leave i'll be back\n\n[GemStones]\nHurry your ass up man. Damn\nCoolest nigga what, coolest nigga what, coolest nigga what\nHustla for life!\nAy man, nigga hurry your ass up. Shit\nI'mma cool ass nigga man\nFuckin' three in the mornin'\nI'm the coolest muthafucka in the world, man\nNiggas ain't fuckin' with me man\nNigga i'm high, smokin'. Fly ass car\nI run these muthafuckin' streets, and these niggas out here lookin' for me\nMan i wish a muthafucka' would...\nAy, nigga hurry your ass up, nigga! Damn\n\n[footsteps and a gun cocking]\n\n[random voice]\nWhats up now nigga?\nAin't too cool now is you nigga?", "image": "https://images.genius.com/f097b99dcc00024d51d3fba2d7b73cf6.600x600x1.jpg"}], "artist": "Lupe Fiasco"}