{"songs": [{"title": "Walk on Water", "album": "Revival", "year": "2017-11-10", "lyrics": "[Chorus: Beyoncé & Eminem]\nI walk on water\nBut I ain't no Jesus\nI walk on water\nBut only when it freezes (Fuck)\n\n[Verse 1: Eminem]\nWhy are expectations so high? Is it the bar I set?\nMy arms, I stretch, but I can’t reach\nA far cry from it, or it's in my grasp, but as\nSoon as I grab, squeeze\nI lose my grip like the flying trapeze\nInto the dark I plummet, now the sky's blackening\nI know the mark’s high, butter–\nflies rip apart my stomach\nKnowin' that no matter what bars I come with\nYou're gonna harp, gripe, and\nThat's a hard Vicodin to swallow, so I scrap these\nAs pressure increases like khakis\nI feel the ice cracking, because—\n\n[Chorus: Beyoncé & Eminem]\nI walk on water\nBut I ain't no Jesus\n(It's the curse of the—, it's the curse of the—)\nI walk on water (Shit)\nBut only when it freezes\n\n[Verse 2: Eminem]\nIt's the curse of the standard\nThat the first of the Mathers disc set\nAlways in search of the verse that I haven’t spit yet\nWill this step just be another misstep\nTo tarnish whatever the legacy, love or respect\nI’ve garnered? The rhyme has to be perfect, the delivery flawless\nAnd it always feels like I'm hittin’ the mark\n'Til I go sit in the car, listen and pick it apart\nLike, \"This shit is garbage!\"\nGod's given me all this, still I feel no different regardless\nKids look to me as a god, this is retarded\nIf only they knew, it's a facade and it’s exhaustive\nAnd I try not to listen to nonsense\nBut if you bitches are tryin' to strip me of my confidence\nMission accomplished\nI'm not God-sent, Nas, Rakim, 'Pac, B.I.G., James Todd Smith\nAnd I'm not Prince, so…\n\n[Chorus: Beyoncé & Eminem]\nI walk on water\nBut I ain't no Jesus\nI walk on water\n(It's true, I'm a Rubik's—, it's true—)\nBut only when it freezes\n(It's true—)\n\n[Post-Chorus: Beyoncé]\n'Cause I'm only human, just like you\nMaking my mistakes, oh if you only knew\nI don't think you should believe in me the way that you do\n'Cause I'm terrified to let you down, oh\n\n[Verse 3: Eminem]\nIt's true, I'm a Rubik's—a beautiful mess\nAt times juvenile, yes, I goof and I jest\nA flawed human, I guess\nBut I'm doin' my best to not ruin your ex–\npectations and meet 'em, but first\nThe \"Speedom\" verse, now Big Sean\nHe's goin' too fast, is he gonna shout or curse out his mom?\nThere was a time I had the world by the balls, eatin' out my palm\nEvery album song I was spazzin' the fuck out on\nAnd now I'm gettin' clowned and frowned on\nBut the only one who's looking down on\nMe that matters now's DeShaun\nAm I lucky to be around this long?\nBegs the question though\nEspecially after the methadone\nAs yesterday fades and the Dresden home\nIs burnt to the ground and all that's left of my house is lawn\nThe crowds are gone\nAnd it's time to wash out the blonde\nSales decline, the curtain's drawn\nThey're closin' the set, I'm still pokin' my head from out behind\nAnd everyone who has doubt, remind\nNow take your best rhyme, outdo it, now do it a thousand times\nNow let 'em tell ya the world no longer cares\nOr gives a fuck about your rhymes\nAnd as I grow outta site, outta mind, I might go outta mine\n'Cause how do I ever let this mic go without a fight\nWhen I made a fuckin' tightrope outta twine?\nBut when I do fall from these heights though, I'll be fine\nI won't pout or cry or spiral down or whine\nBut I'll decide if it's my final bow this time around, 'cause—\n\n[Chorus: Beyoncé]\nI walk on water\nBut I ain't no Jesus\nI walk on water\nBut only when it freezes\n\n[Post-Chorus: Beyoncé]\n'Cause I'm only human, just like you\nI've been making my mistakes, oh if you only knew\nI don't think you should believe in me the way that you do\n'Cause I'm terrified to let you down, oh\nIf I walked on water, I would drown\n\n[Outro: Eminem]\n'Cause I'm just a man\nBut as long as I got a mic, I'm godlike\nSo me and you are not alike\nBitch, I wrote \"Stan\"", "image": "https://images.genius.com/d630d312d01528a7b3b648d337a8e746.1000x1000x1.png"}], "artist": "Eminem"}