{"songs": [{"title": "Mr. Incredible", "album": "Finally Famous Vol. 2: UKNOWBIGSEAN", "year": "2011-06-01", "lyrics": "[Intro: Earlly MacMillion]\nIncredible, incredible\nIncredible, incredible\nThe story of my life be the makings of a real boy\nIf you live my life you will recognize a real boy\nIf you didn't know I'mma have to let you know\nAnd I just wanna be incredible\nIncredbile, incredible, Mr. Incredible\n\n[Verse 1: Big Sean]\nI hear the people yellin, so it's time to get my save on\nBet that I could do in one day without a cape on\nAll I needs my Nikes, chain and my Bathing Ape on\nAnd bet that I could clean this mess up without an apron\nWith no hesitation, got so much drive\nAll I need is four wheels and I'mma reach my destination\nFrom where they on that cane like they need a hip replacement\nGot on and got out, I even made a bitch replacement\nNow she gon ride my dick til I need a dick replacement\nMr. Incredible, she still in amazement\nUnderground money safe in a dark basement\nAnd I flash more than Powerpoint presentations\nBut with great power comes great responsiblity\nThe ones who don't cheer for me is trying to get rid of me\nIm trying to make history, they trying to make me history\nSo I'mma see which one is really meant for me\nThe story of my life\n\n[Hook: Earlly MacMillion]\nThe story of my life be the makings of a real boy\nIf you live my life you will recognize a real boy\nIf you didn't know I'mma have to let you know\nAnd I just wanna be incredible\nIncredbile, incredible, Mr. Incredible\n\n[Verse 2: Big Sean]\nAnd I check my highlights every time the news is on\nStill stand out if we wore the same uniform\nAnd my chick is finer than them models, but only five four-a\nIdolize Kimora and in love with my aura\nBut love seems to be every hero's downfall\nSo even if she treats like me a king, there's no crown for her\nBitch recognize this power in my punchlines\nSee me as a meal ticket, but I'm not a lunch line\nCrying for my help, but I can't fit them in my schedule\nPut me on a pedastal, but if I lost it all\nSome would flip like they was flexible, fake ass niggas man\nSwear to God, eat a dick and everything that's edible\nAnd I can't save everything and all\nI would need the world's biggest memory card\nWhen I die and my grave says in memory of\nI hope somebody else will rise above and become incredible\n\n[Hook: Earlly MacMillion]\nThe story of my life be the makings of a real boy\nIf you live my life you will recognize a real boy\nIf you didn't know I'mma have to let you know\nAnd I just wanna be incredible\nIncredbile, incredible, Mr. Incredible", "image": "https://images.genius.com/35094fe912ce98af36fb55bca8412d23.500x500x1.jpg"}], "artist": "Big Sean"}