{"songs": [{"title": "Revenge of the Dreamers", "album": "Revenge of the Dreamers ", "year": "2014-01-28", "lyrics": "[Intro]\nNa, na, na, na, my nose runnin'\nGot my shades over this\nThe whole skyline of the city's right in front of my face, yeah\n\n[Verse 1]\nI'm in the zone this year, it's all fire nigga check my attire\nYour worst fear is confirmed, your reign at the top expires this year\nNo application, I'm hired this year\nThis a dedication to that bitch who slashed my nigga tires, oh yeah\nI knew about you, bitch I knew about you\nCame up on a good nigga, he ain't have a clue about you\nTried to tell that nigga, don't trust that bitch as far as you can smell her, nigga\nBut you live and you learn\nOn these road to riches niggas bound to miss a few turns\nDon't let the bridges that you cross turn into bridges you burn\nYou're bound to miss a few turns\nDon't let the bridges that you.. fuck it you don't hear me\nLook, ayo, I walk along this long harbor of life and sit on the piers\nReflect on my pain and shit on my fears\nShould I feel an ounce of guilt that I outdid all my peers?\nOr write my name in the sky and show them niggas I'm here?\nThis one is for the history books, picture me shook or failin'\nThis is revenge of the dreamer\nMisery took a million of my niggas' hopes from 'em, don't even know some 'em\nNo more, the coke numbed 'em, no suicide notes from 'em\nThey killin' theyselves, slowly killin' they cells\nFive iPhones dropped, my nigga still in the cell\nHe said he found God, shit, I doubt it, to each his own\nWhatever keeps you strong to get up out it, we need you home\nCause see a war's goin' on outside, I 'bout cried\nWhen that boy that the cops shot died, my mouth wide open from shock\nSick and tired of hopin' it'll stop\nThis pen the only hope that I got, I open up shop, and break out\n\n[Chorus]\nGot what you want, I got what you need\nMy heart on my sleeve, watch me bleed, I break out!\nDreamville is the team, my team iller than fiends\nAnd ye' ain't real as you seem, and we can tell, nigga\nFuck what you think, cause if your shit don't stink\nNigga my shit won't sink, cause it can't, I break out!\nI gotta break the fuck up outta here\nDreamville is the team, my team iller than fiends\nAnd ye' ain't real as you seem, and we can tell, nigga\n\n[Verse 2]\nWar stories, got tour stories\nPop-four-whores-on-the-top-floor stories\nNiggas know, every verse is worth a brick of blow\nJust a seven figure nigga got the game in figure four\nI know at times I'm hypocritical, you niggas dig it though\nI fuck until my dick be sore, leave bitches walkin' pigeon toe and break out!\nOn to the next bitch, homie\nYour new chick—that's my ex-bitch, homie—in fact, I'm still logged in her Netflix, homie\nJust make sure she cook you breakfast, homie\nHer bacon slammin' but her eggs get runny—funny\nSo many bombs, you'd think Flex get money from me\nCole world but my neck get sunny\nNow I don't fuck around with hoes from reality shows\nOr blow-up dolls, 'cause I don't like havin' sex with dummies, love me\nNo disrespect meant, honey, this just a compilation of my observations\nWhile trapped in this God-forsaken nation\nShit, but since we makin' conversation\nI've been thinkin' me and you would make a bangin' combination\nI know that you mad, I know what I said\nBut my dick be arguin' with my head, are you with the bed?\nWell if so let's break out!\n\n[Chorus]\nGot what you want, I got what you need\nMy heart on my sleeve, watch me bleed, I break out!\nDreamville is the team, my team iller than fiends\nAnd ye' ain't real as you seem, and we can tell, nigga\nFuck what you think, cause if your shit don't stink\nNigga my shit won't sink, cause it can't, I break out!\nI gotta break the fuck up outta here\nDreamville is the team, my team iller than fiends\nAnd ye' ain't real as you seem, and we can tell, nigga", "image": "https://images.genius.com/a672d085777f459db6e18f274036a084.500x450x1.jpg"}], "artist": "J. Cole"}