{"songs": [{"title": "Suplexes Inside of Complexes & Duplexes", "album": "Watching Movies With the Sound Off", "year": "2013-06-18", "lyrics": "[Intro: Mac Miller]\nThis is madness (madness)\nThis is an outrage! (an outrage)\nAs a matter of fact, this is outrageous! (outrageous)\nHahahah, yeah\n\n[Verse 1: Mac Miller]\nYoung sire, slap the fuck out Jon Cryer\nRough rider, raw bust inside a vagina\nLike I want kids, my head continues to be haunted\nI burn a city down while I'm unconscious\nMaybe gon' and take some quaaludes, conversate with Jesús\nBatting practice with the mothafuckin' ghost of Babe Ruth\nDo as a saint do, turn painful to graceful\nDevil on my trails, I'm trying to find the Holy Grail\n(Coughs repeatedly) Right there\nAnd if Mars is the farthest that man has set his target\nThen I don't know why I even started\nI'm sick of being too nice to people who don't do shit but consume light\nTold myself, \"Fuck the world kid, just do what you like\nGo and have a food fight, start yourself a new life\nYou're too bright to be inside a bunch of mediocrity\nBut all those big words ain't gon' get you paid\nAnd those abstract ideas for sure won't get you laid\nYou got it made in that mad house\nWhat the fuck you got to be sad 'bout? Go 'head and rap now\nDo what you do best\nI mean, that's what you do best\nMatter fact mothafucka, you suit vest, you need to buy a new dress\nI heard you and your girl live in a duplex\nI'ma put her ass in a suplex, the sun east, the moon west\nYou got a clue, what does a clue get? Nothing\"\n\n[Verse 2: Jay Electronica]\nMy milk and honey, my chérie-chérie amore\nMy Cinderella in her carriage by the doorway\nHer ruby slipper made the wizard send the scarecrow\nAnd the lion through the forest\nTo the Wicked Witch's fortress where she scorched them in the foreplay\nRemember that? He said he'd fight the box to see the wizard\nWhen he was visited by Dorothy who came here on a blizzard\nNow the whole world's in color, still\nHow Auntie Em was next of kin but not her mother, real\nHer face was careworn, I suspected she migrated to Kansas up from Dearborn\nAnd had beef with Mrs. Gulch from the very beginning of year one\nMr. Candyman, the parables parabolic\nThe poetry's like the poems and psalms of Ecclesiastes\nLightning should strike the stone and then Moses should make a tablet\nThe Judge will bang the wood up in parliament with the mallet\nAnd yell \"Hear hear\", finally some order to this rap shit\nFinally some sort of water to soil these cracked lips\nI keep my shit crispy and elegant\nSo miss me with the irrelevant, the god body is heaven-sent\nThe hard-body is reverence, since the son of Byford\nBrother of Fal, every rhyme's halal\nEvery line is kosher, livin' la vida loca\nShout out to Tony Toca, we ballin' like we suppose to...", "image": "https://images.genius.com/c97dc009b7b1ff0982e14799c3dd3042.375x375x1.jpg"}], "artist": "Mac Miller"}