{"songs": [{"title": "Bob N’I", "album": "Birth of a Prince", "year": "2003-10-07", "lyrics": "[Intro: sample]\nBird flying high, you know how I feel\nSun in the sky, you know how I feel\nBreeze drifting by, you know how I feel\nIt's a new dawn, it's a new day\nIt's a new life for...\nBird flying high, you know how I feel\nSun in the sky, you know how I feel\nBreeze drifting by, you know how I feel\nIt's a new dawn, it's a new day\nIt's a new life for me\n\n[RZA]\nWho be the last man standin' when I cock back the cannon? (Bobby!)\nAnd blast your ass in search for Michael Landon (and)\nAbandon ship, you can't penetrate (and)\nMy solar eclipse, you dickhead y'all get pussy-whipped (and)\nSword of Conan, wind speed of Rodan (and)\nFlow so cold, I freeze M.C.'s to snowmen (and)\nTurn 'em up to the sun to defrost them (and)\nProceed with caution, you get your beans baked in Boston (and)\nSlice a lemonhead, it's like John Lennon said (and)\nHelp, you need somebody and (and)\nIf you ever see somebody and (and)\nFuckin' with the Wu, you gonna be a body and (and)\nBy me, myself and Bobby and (sha na na) (and)\nYou superficial nigga, fuck it I'm a superhero (and)\nMy pistol will turn you to a super zero (and)\nMake a fingetip griplock of Royce Gracie (and)\nWhile I'm makin' this cash like Mr. Spacely (and)\nOr Cogswell Cogs, I don't fuck with hogs (and)\nYour dialogue is stuck, too analog (and)\nIs you guns heavy enough? (and)\nIs your gold chain truck Chevy enough? (and)\nDon't fuck around with Starks, Rebel and us (and)\nB-O-B-B-Y (sha na na) (and)\nYou superficial nigga, buck it I'm a superhero (and)\nMy super pistol will turn you to a super zero (and)\nLot of niggas askin' us, some faxin' us (and)\nHow I gladiate, take land like Maximus (and)\nYou listerin', while this winds blisterin' (and)\nI'm in the clouds like my man Calrissian (and)\nLando, bust shots like Marlon Brando (and)\nYou gettin' smacked like I'm playin' black Sambo (and)\nHambone, hambone, haven't you heard? (and)\nPapa gonna buy you a mockingbird (and)\nIf that mockingbird don't sing (and)\nPapa gonna buy you a diamond ring (and)\nWatch out for the Killa Bee sting (and)\nBZA-Bobby (sha na na)\n\n[Outro: RZA]\nYou see that's what we called B-Boy freestyle!\nYou stupid muthafucka!!!\n\n\"and\" \"Bobby!\" (repeated to the end)\n\n\"sha na na!\"", "image": "https://images.genius.com/0b55b2ec40b427a658f9839bb61bb1e8.600x600x1.png"}], "artist": "RZA"}