{"songs": [{"title": "Tears of a samurai", "album": null, "year": null, "lyrics": "[Chorus: Thea]\nOh whoa, these tears that I've had\nThey here, have no, word\nThen roll, each time each pain\nI fell insane\n[RZA]\nFury in my eyes, sword on my side\nEscape death to become immortalized\nAfro on my head, the black Samurai\nNumber One, I bring a whole nation alive\nI'm the leader of the Clan, you can tell from the headband\nSpirit of God, become one inside man\nExcept all challengers, leave 'em in bandages\nSword won't ceist til my enemy vanishes\n\n[Chorus II: Thea]\nAnd so your tables have turned\nOnly now with you and I've burned\nWere these sweet memories?\nIn the rain\n[RZA]\nYo, I'm the master of disaster, no one swing a sword faster\nI warned you, the'll be tears after the laughter\nNow I'm 30 years, after the rapture\nWar blood will be spilt, we start a new chapter\nFury in my eyes, sword on my side\nAfro on my head, I'm a black Samurai\nNumber One, I bring my whole nation alive\nEscape death, to become immortalized\n\n[Chorus]\n\n[Chorus II]\n[RZA]\nYo, yo, dogs out to chase these cats, in the jungle\nRats wanna snatch that cheese, in the jungle\nBears want honey from bees, in the jungle\nBirds wanna nest in the trees, in the jungle\nSquirrels try'nna catch a nut, in this jungle\nPigs wild around in the muds, in this jungle\nLions on the hunt for the beef, in these jungles\nHyena roll around thirty deep, in these jungles\nTry'nna snatch ice from the penguins, while I'm stingling\nI see shorty wop, she got those ill rings jingling\nThey jingling, baby, I heard Ringling\nBarnum & Bailey was in this place, shit is crazy\nWhat's a man to do in this jungle?\nLive life on the hunt full, in the jungle\nWhen hamsters come and try to snatch a crumb from you\nWhat a man 'pose to do, in this jungle?\nIf you can talk to animals in this jungle\nWould you allow the slouth to come amongst you\nWould you break bread, or instead\nGet the thirty-thirty scope and put one in your head\nPut one in the head...\n\n[Chorus II]", "image": "https://images.genius.com/0050e4b1c52ecca6d63818331b489e2a.683x683x1.jpg"}], "artist": "RZA"}