{"songs": [{"title": "Half Man Half Amazin’", "album": "A Taste of Tical O (Part II)", "year": null, "lyrics": "[Pete Rock] To all my Bronx niggas (Yeah!)\n\"And I say right about now get ready to get down\nTo the funky sound of the man they call\"\n\"Pete Rock\" \"and Method Man\"\n\n[Method Man]\nDumbheads, what? Cherryheads.. what?\nAppleheads, what what what?\n(Meth-Tical, you know how we do Dunn, yeah\nHit it off you know what I mean, like this y'all)\nP.R., take them to the bridge, uhh!\n\n[Chorus: Pete Rock]\nFloat on this magnificient track wise intelligent\nAll-star Jamerican yes the rap vet\nReinforce your threat, who got the money to bet\nAgainst the number one, holdin down the position\nCrush the competition with the limited edition\nHeavy caliber rhyme, shootin down ya peace sign\nThe war's on for real, run grab ya shield\nYo Meth, take the steel and let these cats know the deal\n\n[Method Man]\nStyle blazin, Iron Lung on this collaboration\nMoney for the takin I ain't sweatin confrontation\nWith P.R.ah, we beez the mens of tomorrow\nMaster, license to kill, bringin the horror\nTo ya house like Amityville, keepin it more than real\nNiggas ain't supposed to feel, Hot Nicks ya know the deal\nIf you read the resume, gives a fuck what niggas say\nTimb boots to pave the way, here I come to save the day\nYes stoppin the fuckin press, transform to Mister Mef\nSee that logo on my chest, save a damsel in distress\nHot shit, in the song, got to Get Until It's Gone\nKids wanna get it on get smacked up and shit upon\nRight til ya prove me wrong, think you can do me hunh?\nCan't we all just get along, in this modern Babylon?\nDueling with my nemesis, layin down laws\nDon't start if you can't finish it, I'm telling you Pah!\nGot the power of a meteor shower, comin down\nOn all ya cowards, trickin ya funds and sniffin powders\nHere we come, straight from the slums, Dynamic Duo son\nGhost Rider Jonathan and Soul Brother Number One\n\n[Chorus: repeat 2X (sampled and scratched by Rock)]\n\"Sendin this one out.. to my man\" - [Prodigy]\n\"Meth-Tical\" - [Meth] \"Pete Rock\"\n\"Half man, half amazin\" - [Nas]\n\"Make it hot nigga!\" - [Big Pun]\n\"For you!\" \"KnowhatI'msayin?\" - [Prodigy]\n\n[Method Man]\nLeapin tall buildings in a single bound, faster than a round\nBlastin out a forty pound, y'all niggas fuck around\nTake that and handle it, Method Man I get\nStrong with Titantic shit, that means abandon ship\nGet a life and get a grip, there ain't a problem that I can't fix\nTransmittin live from Apocalypse\nAnd the Cho-co-late, Boy Wonder, my sidekick\nCowabunga, these evil doers days are numbered\nWe flexin like the X-Men on rap veteran\nThat be's no question, boy ya need protection son\nI'm burnin up check the temperature\nYa fuckin wit The Last Emperor, Iron Lung dangerous son\nFor all who enter the, 36, Deadliest chambers\nFor all the prejudiced, entertainers\nThere ain't a damn thing you can tell us, bite ya tongue\nI be the troublesome, don't sleep niggas is holdin son\n\n[Pete Rock]\nPick em off form long range break em down to small change\nA New York Giant stand in front of ya ...\nSquad, what up God, a million to one one odds\nThat you can't stop this bullet\nI'm like Refrigerator Perry rush right through it and just do it\nSo act like ya knew it, the Mount Vernon/Shaolin fluid\nThe rap committee coming live\nThrough ya city, swing hard like Ken Griffey\nGain stats, now who's next up to bat?\nKnock em out the box, Method Man and Pete Rock\nCelebrating victory, rap world remedy\nTake a double dose deadly\nDeadly kid.. yo!\n\n\"C'mon!\" \"One two!\"\n\"The numba one set and sound\" - [BDP]\n\"Meth-Tical\" - [Method]\n\"Pete Rock, this one's for the crew\" - [CL Smooth]\n\"Half man, half amazin\" - [Nas]\n\"One two!\" \"The numba one set and sound\" - [BDP]\n\"Meth-Tical\" - [Method] \"on arrival\"\n\"Pete Rock, this one's for the crew\" - [CL Smooth]\n\n\"Half man, half amazin\" - [Nas (continues to echo to end)]", "image": "https://images.genius.com/ef71878edb3e2101748fdd635355fc79.320x320x1.jpg"}], "artist": "Method Man"}