{"songs": [{"title": "That Tree", "album": "More Malice", "year": "2010-03-16", "lyrics": "[Verse 1: Snoop Dogg]\nSnoopy\nIs what they say as if they knew me\nGroupies, on my head like a cufi\nMy nigga Kid Cudi, that's my little buddy\nCall some hoes up, and get some cutty cutty\nWhat's your life like? Mine's is kinda tight\nA long way from hustlin', that china white\nMy people love me, the fans love me, I'm all go\nIf you ain't showin' love, then what you call for?\nI don't need it in my life, my kids pay the price\nSo alike and in need of my wife\nSmoke 'til I'm gone, Dogg on the throne\nI'm world-wide known, I'm a boss in the zone\nI get it how I get it 'cause I can, I earn my spot\nYou see the plan, I'm just fuckin' with my fans\nI turned out to be the better man, important to life\nYou understand while I'm puffin' on this gram\n\n[Hook: Kid Cudi]\nEverything I'm havin', no there ain't necessity\nThough I'm shining, keep on grindin'\nWhat you see ain't all of me\nThough I keep them ho's, don't love them ho's\nThe code in which y'all roll\nIt's so simple what I need\nYou know I keep my fam and I can't forget that tree\n\n[Refrain: Kid Cudi]\nNah nah nah, nah nah nah\nI can't forget that tree\nNah nah nah, nah nah nah\nI can't forget that tree\nNah nah nah, nah nah nah\nI can't forget that tree\nNah nah nah, nah nah nah\nNah nah, nah nah nah\n(Nah nah nah, nah nah nah)\n\n[Verse 2: Kid Cudi]\nI got my fam dawg, look at my niggas\nGot a little money y'all, and I ain't trippin'\nMost days I'm faded, feeling ex-rated\nSteady wantin' freaky hoes, then I want a lady\nHoldin' the fam down, and my close homie\nThe peoples who were there, when some sucka left me lonely\nPhony, when you see a nigga don't approach me\nMade it to the top baby, that's on me\nKoch tryna claim that they made me\nHowever you feel, another real fugazzi\nI keep it one hundred, never frontin', don't need be\nI'm in another zone, no place you could see, my nigga\nConyo to haters that don't know\nLow pro, how a nigga like from costo\nThe one fans love, who was always approachable, yo\nAnd I rep the double O, smokin', eatin' Cheerios\n\n[Hook: Kid Cudi]\nEverything I'm havin', no there ain't necessity\nThough I'm shining, keep on grindin'\nWhat you see ain't all of me\nThough I keep them ho's, don't love them ho's\nThe code in which y'all roll\nIt's so simple what I need\nYou know I keep my fam and I can't forget that tree\n\n[Refrain: Kid Cudi]\nNah nah nah, nah nah nah\nI can't forget that tree\nNah nah nah, nah nah nah\nI can't forget that tree\nNah nah nah, nah nah nah\nI can't forget that tree\nNah nah nah, nah nah nah\nNah nah, nah nah nah\n(Nah nah nah, nah nah nah)\n\n[Verse 3: Snoop Dogg]\nCan't forget it, they made me who I am, a king\nAnd I'm still on the scene, you gotta love it\nAll out in public, the people want to touch it\nI need a blunt with the stuffin'\nNigga, it's nothin' for me to chill out, post up at the house\nWith Madden on the screen, and smash on the homies\nHollywood nice now, everybody on me\nAnd on the blogs talk shit like they know me, hm\nAww fool, take you niggas to school\n\"How to get rich and stay cool\"\nSnoopy D O Dub, show you homie, even with the critics\nAnd the Feds all on me, I was tappin' all the chonies\nDogg, but my folks call me Snoopy\nBoss dogg, nigga sue me\nPony tail swangin' as I lay in the jacuzzi\nLove of my life, while I'm puffin' on the oww wee, kush\n\n[Hook: Kid Cudi]\nEverything I'm havin', no there ain't necessity\nThough I'm shining, keep on grindin'\nWhat you see ain't all of me\nThough I keep them ho's, don't love them ho's\nThe code in which y'all roll\nIt's so simple what I need\nYou know I keep my fam and I can't forget that tree\n\n[Refrain: Kid Cudi]\nNah nah nah, nah nah nah\nI can't forget that tree\nNah nah nah, nah nah nah\nI can't forget that tree\nNah nah nah, nah nah nah\nI can't forget that tree\nNah nah nah, nah nah nah\nNah nah, nah nah nah\n\n[Outro: Snoop Dogg]\nSnoop Dogg in the house tonight blowing that Laker purp that I know you like, right?\nKid Cudi, my nephew, blaze that shit right now would you, would you, right?\nSnoop Dogg in the house tonight blazing that Laker purp that I know you like, right?\nKid Cudi, my nephew, blaze that shit right now my nigga, right?", "image": "https://images.genius.com/6f4929ea34ebcafd7949d2bcf3838944.220x220x1.jpg"}], "artist": "Snoop Dogg"}