{"songs": [{"title": "Wobble", "album": "Just Re’d Up", "year": "2011-05-02", "lyrics": "[Intro: Soulja Boy Tell 'Em]\nKnow what I'm sayin?\nI just feel like, do what you posed to do, dog\nRight?\nSOD, Soulja\nTell 'Em\nGet at these niggas\n\n[Verse 1: YG]\nDamb, all that ass\nLike a missed call, I'm tryna call that back\nNo waitress, but I might tip her\nNo T-Pain, but I'm in love with a stripper\nShe get fried and crisp cut\nAfter I stab her, she get stitched up\nWalkin with a wobble, remind me of a model\nGucci what she got on, I'm waisted off the bottle\nThen she 2d it up, so then I loosin up\nDrunk talk the Goose, then I hit the blunt to boost it up\nDo that shit, girl, work that back\nLookin kinda basic, you get ate like a midnight snack\nI'm the one that likes them G strings\nBooty, ass and thighs, I only believe in three things\nShe know I'm a baller, got bird banks\nMade it rain, and made it look like it's her birthday\n\n[Chorus: YG]\nShe make it shake shake, and she make it jump jump\nNow she got me spendin, and I can't stop stop\nNow get it, get it\nI get it, I get it\nBooty so big, lookin like it wobble\nBooty so big, lookin like it wobble\n\n[Verse 2: Soulja Boy Tell 'Em]\nBaby girl say meet her in the trap, but I know that is a trap\nSo I let her suck my dick, with my pistol in my lap\nShauty, I got a question, is you gon smash the clique?\nShe turned around, and bust it open like a bag of chips\nI say \"Look, I'm Soulja B, I came from rags to rich\"\nIf I don't know nothin, I know how to bag a bitch\nNow pass the splif, and ignite the whip\nI'm rich, what I look like fightin a bitch?\nSOD, Imma rep that for life, you bitch\nYou can smell me for a mile, and you just scratch and sniff\nThese days, I ain't gotta even ask to spit\nWobble down to the ground, all nice and shit\n\n[Chorus: YG]\nShe make it shake shake, and she make it jump jump\nNow she got me spendin, and I can't stop stop\nNow get it, get it\nI get it, I get it\nBooty so big, lookin like it wobble\nBooty so big, lookin like it wobble", "image": "https://images.genius.com/0234c65f6d6514702072da47412b8cc3.500x500x1.jpg"}], "artist": "YG"}