{"songs": [{"title": "Get Over It", "album": null, "year": null, "lyrics": "[Intro]\nYeahhh\nTay you know, you know I told you many times you my favorite rapper right?\nI'mma start this off like you would do it\nUhh\nShout out to DJ Wristpect\nOctober's Own!\nDrizzy!\nHehe\nHere I go!\nUhh\n\n[Verse]\nLook I stands out\nSo don't think this ain't some shit that I done planned out\nAnd life is beautiful as ever when it pans out\nAnd girls are beautiful until they want a hand out\nBut, ask Apple how I get it though\nI'll be on the phone with a bitch that you will never know\nSo you can son me never\nI don't get bitter, I just get better\nAnd a verse is just a verse for me\nI keep it generic and these niggas take it personally\nIf I was in a room and someone yelled, \"Hey bitches!\"\nI would never turn around cause I just don't fit the description\nBut that's just me though\nBut don't mind him girl, that's just Freako\nPlease don't cuss girl, that don't suit ya\nHis name 40 and his name Future\nOliver's here and you know me ho\nI'm the cash cow front man of O.V.O\nI am not doing features now, no means no\nAnd the hate starts building the more we grow\nDamn shame am I over-expressing the game\nShould I hold back on addressing the lame\nBecause they becoming obsessed with my name\nI'm trying to clean up my mess and explain\nAnd boy you know my progression insane\nMy engineer is the best in the game\nAnd ever since I've been messing with Wayne\nPeople getting jealous I can see they expressions have changed\nThey seemed to love me when this shit was going nowhere\nAnd now they got a bunch of feelings that they won't share\nThey just give me the fuck it I'm broke stare\nAnd Drake was at the club and he balled like no hair\nLiving life from a whole different angle\nOnly see the road through the wings of an angel\nAnd I can see the heart on your sleeve\nAnd I know this shit is hard to believe\nYou gone have to get over it\nAnd all you talking ass niggas get over it\nAnd all you people that be hating get over it\nAnd all you women that I fucked get over it\nAnd yea I'm turning 22 get over it\nYou know you got to hear my records get over it\nMy whole team getting rich get over it\nI got the city on my back get over it\nGet over it, get over it\n\n[Outro - Drake]\nDJ Wrispect\nLittle Brother\nPooh, 'Te\nBig doe I see you homie\nYeah\nI'm serious man, please, just get over it\nJust for y'all I'mma keep it humble as a mumble in the jungle\nY'know what I'm talkin' bout\nIt's Drizzy\nThank Me Later coming soon\nJust lemme live man\nIt's all I ask\nHere I go", "image": "https://images.genius.com/f0da5ca89f30622fa5af9d0ce7c47be0.500x500x1.jpg"}], "artist": "Drake"}