{"songs": [{"title": "Thisisme", "album": "Resurrection", "year": "1994-10-25", "lyrics": "[Hook: KRS-One sample & (Common)]\nI love the way I am and can't nobody out here change me\nI love the way I am and can't nobody out here change me\nI love the way I am and can't nobody out here change me\n(Common)\nI love the way I am and can't nobody out here change me\n(Common)\n\n[Verse 1]\nCheck it out (Common)\nGood Morning Viet-Com, I'm back\nHuh, it's me again\nIs it me you're looking for? (Yup)\nFor the perfect beat, sweetly oblique\nI'm fresh, I come clean, but I can't whistle\nPsss, I'm only buggin\nWhile No dug in the crates, I dug in my nose\nAnd picked a rhyme, any rhyme I don't have any time\nTo waste, I'm hip... don't even trip\nTo an easy travel agent now we fly for free\nI can be fly for free\nYou want some fire tree, then buy from me\nI got the flame like U-I-C but I be from U-A-C\nSome of the realest illest chillest cats you may see\nIn your life if you get one\nRappers are like jobs to me (Why?) because they get done\nHere it comes I'm as Able as Cain to get raw\nThat's why the DJ's mix me, I'm gonna bust dicks\nThis is not da bomb so save all your threats\nI'm good to go and also I'm Rets\nRhymes I wrecks affects the roughnecks\nDown to the preps in the Polos, the studs with fros\nHoes with weaves, the bald-headed to the dreaded\nTo folks with butters, high rollers in rollers\nPlayers with plats, studs with stocking caps\nI be rockin' raps 'til I collapse\nNiggas play my tape about as much as they do craps\nI'm on point, I cee-lo, I see high\nHi C, I'm free at last\nI'm a free man, free as World B\nAnd like an early bird, I'm special\nYou ain't that special, as Ed and Vesta\nSo to myself I say congratulations\nI'm glad you had the patience, you better have the patience\n'Cause this is me\n\n[Hook: KRS-One sample & (Common)]\nI love the way I am and can't nobody out here change me\n(Common)\nI love the way I am and can't nobody out here change me\n(Common)\nI love the way I am and can't nobody out here change me\n(Common)\n\n[Verse 2]\nWhassup Scony Rony? I'm that boney homey from Stony\n(Common) You know me!\nOff the GP niggas see me on the TV\nTalkin' Take It EZ, and they was like \"He ain't hardcore!\"\nBut hardcore is far more than bats and gats\nIt stems back to the roots of being true\nIt's gonna get me Me, you just get you You\nWhat I look like, talkin' about some shit I ain't do?\nI ain't shoot nobody, I ain't shank nobody, I ain't kill nobody\nIt wasn't us, it was them\nThe Warriors, I'm a warrior and still don't have to sho-gun\nIt takes one to know one, and no one can\nTell me how to be, 'cause I'mma be me, aight?\n'Cause I'm a man, now check it\n\n[Hook: KRS-One sample & (Common)]\nI love the way I am and can't nobody out here change me\n(Common)\nI love the way I am and can't nobody out here change me\n(Common)\nI love the way I am and can't nobody out here change me\n(Common)\n\n[Verse 3]\nSometimes, sometimes, I get a good feeling!\nWhen I'm chillin' at the flat, lookin' at the wall\nWondering can I come off of it, I'm off a bit\nOn the mic I be talkin' shit\nBut some say my talk don't make no Sense\nI'm tryin' to make dollars\nMy momma told me to go to school and be a scholar\nBut school ain't for me\nSo don't even go there, I'm comin' out of nowhere to go where\nProbably in about seven years, I won't have no hair\nBut not only am I the Hair Club President, I'm also a client\nI come off like a toupee, I still have to pay 2Pc Dark\nA Raider that never Lost the Ark, on the shot\nBut now when I shoot rock, I be all out of breath\nMy boy Adefo wanted to be a chef\nBut he went down South, and fell in love, call me love\n'Cause love is gonna getcha — I'mma getcha!\nI'm like B.J., my Arm is Strong and I Stretch ya\nStyles from East to West, all across the country\nI'm like that big fat woman 'cause cats wanna bump me\nI probably would get bumped more if I was a gangster\nBut I am a gangsta, call me the gangsta of love\nI love my music, I love my momma\nI love myself, I love you, and you love me\nAnd this is, I'm out\n\n[Interlude]\nYo, I wanna say peace to my moms, my grandmomma\nLil Chandra, and John, yo rest in peace to my Aunt Stella\nRahsaan's moms, Ron's moms, Dawn's moms, Corey's moms\nWho are you? These people be themselves y'all, peace and love\n\n[Outro: Common] (Repeat 4X)\nCommon (over scratch of \"can't nobody out here change me\")", "image": "https://images.genius.com/8cc4e9a4a27cf48a434a2d5800999430.500x500x1.jpg"}], "artist": "Common"}