{"songs": [{"title": "Peace of Paper/Cup of Jayzus", "album": null, "year": "2013-08-05", "lyrics": "Dis nigga, like he's so exclusive\nSometimes dreams, peace of paper I got reams\nWhere the D go?, Put that on a rose now you\nPronounce it hero, you see?\nLu see like La Brea & Pico, with binoculars on my peephole\nI feel my best work was album zero\nNow with Deniro its boo boo in my backyard and\nBen burnt down my gazebo that dinero's a casino\nWit spit in the sandwich of the police though\nThey ain't see the steel plate up under my seat though\nStill play it like Shaquille but I can free throw\nI ain't playing but I compete, I ain't a player but I'm complete\nAnd that's the win win a mason mind can't sign if the pen's Templar\nNight vision on white linen is still green\nPeace of Paper I got reams, make it rain\nTo make em smile, now rake it into piles\nAnd go buy ya self some style, prom night/cat walk\nPrepared the suit for weeks, or effortless as a Parisian\nWalking down the street, I ain't in it\nI'm just walking round some beats\nTongue in cheek, just talking round some teeth\nNeighborhood watching\nMade of good options, mastermind times\nNeighborhood hoodie take the hood shopping\nBack track to the stolen plates\nWhat's a closed wallet to an open safe\nSay your grace\nPeace of Paper/Cup of Jayzus what we writing?\nThese ain't entendres these are secret indictments\nLitte secret excitements\nFor willing minds I'm feeling fine\nBalling hard and killing rhymes\nKnocking off bigs and stealing shines\nHey shawty is it a crime?\nTo DMV everytime until I give em license\nThey waiting on lines\nPeace of Paper I'm Kerry James\nCommissions fly as the Constitution as a plane\nPeace of Paper Cup of JAYZUS what we doing?\nPizza Lasers/ Cup of Razors\nWhat you choosing?\nChoosy mothers choose the smoothest peanut butters\nAnd more cognizant fathers do George Washington Carver\nA break from the paper it means do you identify more\nWith what's being made or the maker?\nI'm what's being chased\nI'm not the chaser\nCup of JAYZUS Peace of Paper\n\nCheck it, now paper make a plane & paper make it rain\nBut how fly is paper plane in the rain?\nI'm fly paper on the brain\nThis and two-ply paper just ain't the same\nI do do it for the bottom\nIn the air is where I stop em\nI threw words like 2 birds, that's Batman and Robin\nTo answer all your hunches that's just how I throw my punches\nWe must somehow become a family that's why I throw 'em in bunches\nMushroom clouds or on the flo' with the fungus\nIf you look em up and down\nFrom the foot to where he put his crown\nThe slow Pan to understand is Shaq on the shoulders of Yao\nOver and over for miles\nPeace of Paper, Cup of JAYZUS made a movie\nThank God on Friday, then buy a ruby on Tuesday\nA couple beats from Jay, a couple beats from Ye\n& make Food for thought, that's a restaurant in a day!\nIt would behoove thee\nThe critics say that I fell off I acknowledge I slipped\nBut what do you call falling from space into a bottomless pit?\nAnd not pit like how Lui Kang can knock Baraka off with a hit\nKnock it off for a bit\nWhat would be really funny if I blew up after Drizzy\nAnd started from the bottomless back to the topless like a watcher of Strips\nPeace of Paper, Cup of JAYZUS\nPeace of Paper, Cup of JAYZUS, bout it, bout it\nDon't let ya inner fears result in a outer coward\nFrom baby showers to 80 flowers upon my coffin roof\nThe upper class glass is not filled up with the coughing proof\nBe more P and step ya Yessirs Up\nP-O-P! Jayzus a cup of Courage, I can't can't\nThats double negative it's 2 earls\nThey really nice but they'll never touch the cup its like I gave it to two girls\nThis my odd future out in front Supreme shop\nFly as Rick Ross at a Wing Stop\nThought Kick Push was about drugs\nIt's not but just to be super sure\nBut from your perspective it might seem\nLike Supreme out in front of Odd Future Store\nSo that skaters and skiers\nNose grinders and grinding up\nNose powders with ether\nNot an Earl diss either but he might think it be and be like\n\"Lu's new should be Mr.Pure 2positive Shakur and 2 be sure he's\nNot that really nice, That 2 girls and cup line sucked\nIt really means he gave himself a cup twice\"\nYou just witnessed a double, a probable Odd Future diss in the future\nAnd me ghostwriting my own rebuttals\nYou can't do that with a single cup\nYou gone need a couple, again you got a double\nGot my shot on the rocks, but don't stop, keep pouring til it's a puddle\nPeace of Paper, Peace of Paper Cup of JAYZUS what's the drive?\nGreatest Rapper Alive or Greatest Rapper That Died?\nThen on judgement day they say the greatest rapper's revived\nOh look who's here the greatest rapper's arrived!!\nAt the birthday party the greatest rapper surprised!!!\nBumped into Doom the greatest rappers collide\nEverybody dead but AZ the greatest rapper survived\nI'm not the greatest rapper... the greatest rappers' a lie\nGot the same points as Lux the greatest rappers a tie\nTold Jean, Foxy, & Rah the greatest rapper's a girl\nThey said the greatest rapper's a guy\nPhone rang it was Ghost he said \"Kiss the greatest rapper... Goodbye!\"\nChris said Common, Common said Kweli, Talib said I'm sure it's Mos Definitely!!\nPeace of Paper Cup of JAYZUS\nSmack might have the greatest but now I'm just playing favorites\nPlaying flavored to be reminiscent of Miles on smack playing faded\nPeace of.... these niggas is nice\nKnees like these niggas aight\nShins like listen to them, ankles like shins making sense\nFeet like why you running behind these niggas\nThey still trying to step inside ya prints\nBear trap rap don't step inside the clinch\nWhere da at? Don't jeopardize a better stride for limps\nI exercise at length so electrify the fence\nLet me inside the danger room on level 5 with the weaponized defense\nWith an extra side of the next guy's petty exercise attempts\nThe ghost of my career, better than most of what they revere\nI take my targets and throw them back on my spear\nI'm outta here\nDrogas\nShaka Zulu", "image": "https://images.genius.com/b67b7f5bfbd7eb8c5c334fa8b05a2432.400x400x1.jpg"}], "artist": "Lupe Fiasco"}