{"songs": [{"title": "Black Cotton", "album": "Loyal to the Game", "year": "2004-12-12", "lyrics": "[Intro: 2Pac]\nBlack Cotton, Black Cotton\nBlack Cotton – a symbol for unrewarded struggle\nTime for a little gospel tale\nGhetto gospel, that is, listen!\nRotten Black Cotton in God's eyes\nSpeak!\n\n[Verse 1: 2Pac]\nBlack cotton, steady stressin', Smith & Wessons, count my blessings\nClass is in session: the worst question is the first question\nWhy do we work like slaves sweatin' blades to an early grave?\nNever got paid but still we slave (in the nine tre')\nAnswer that, then answer this too\nLove's gonna get ya, you know it's true – life's a bitch, true?\nYou best to backtrack and try to act black and live\nNot to be phony and positive but why be negative?\nWhat's the matter, G? Black cat got your tongue?\nFat track got you sprung, now you're hung?\nDo ya feel me? Dum dum diddy, is it me?\nAttempt to reach each and every brother on the streets\nIf not peace, then at least let's get a piece\nI'm tired of seein' bodies on the streets deceased\nLookin' through my highschool yearbook\nReminiscin' of the tears as the years took\nOne homie, two homie, three homies – POOF!\nWe used to have troops, but now there's no more youth to shoot\nGod, come save the misbegotten\nLost ghetto souls of Black Cotton (in God's eyes)\n\n[Chorus: Eminem]\nNobody don't care (No matter how hard I try\nLook to the sky, and I ask God why)\nNobody don't care (Seems like my dreams\nDrowned in by screams, no answer to my questions)\nNobody don't care (Feels like I'm pressed\nWhy do I stress? It's like I'm bein' tested)\nNobody don't care (Seems like my prayers\nVanished in thin air, please answer my questions)\nNobody don't care\n\n[Verse 2: Kastro]\nIn the belly of the beast I'm bubblin' up\nRunnin' out of luck, about to self-destruct\nOld heads say live your life like such\nYou're sure to catch her with your one-day boy\nI wouldn't listen to 'em\nYour power movement was cool, but it ain't fix nothin'\nSo I just go with what I know, I don't trust none\nLook what the 80's did to us baby kids\nAnd now we grown up, nobody ain't own us yet\n\n[Verse 3: Young Noble]\nBlack cotton, I'm plottin' on what they owe me\nI'm workin' without a profit, they shacklin' all my homies\nI'm hurtin', but keep in mind, it ain't irkin'\nAnd we ain't stop, it's curtains\nYou try to rise and certainly we survive with Outlaw Ridaz\nWhat's the reward for a struggler?\nIf the law lovin' us, then why they hate to see us comin' up?\nRunnin' up, gun cocked, black mask and gloves\nIf you ain't got a penny, mind the glove, no love\nWaitin' for my 40 acres and a blunt to blaze\nBiblical times, good hearts with milita minds\nBlack Cotton – I'm hoppin' over enemy lines\nBlack Cotton – I ain't stoppin' till they givin me mine\nBlack Cotton\n\n[Chorus: Eminem]\nNobody don't care (No matter how hard I try\nLook to the sky, and I ask God why)\nNobody don't care (Seems like my dreams\nDrowned in by screams, no answer to my questions)\nNobody don't care (Feels like I'm pressed\nWhy do I stress? It's like I'm bein' tested)\nNobody don't care (Seems like my prayers\nVanished in thin air, please answer my questions)\nNobody don't care", "image": "https://images.genius.com/aff64f752ccfff1d48590e5db3c0357a.300x300x1.jpg"}], "artist": "2Pac"}