{"songs": [{"title": "Lies & Rumors", "album": "Shark Tale (Original Motion Picture Soundtrack)", "year": "2004-09-21", "lyrics": "Here we go...\n\n[Hook]\nThey say that one little lie turns into another, then you go and cheat\nBy the time you know it, you are wrapped up in a whole bunch of seaweed\nYou shoulda listened to your mama, and listened to your daddy, when they tried to speak\nAnd tell you that there's just too many fishes in the sea\n\n[Repeat 8X]\nNo, no, no, no, no, no, no, no\n\n[Verse 1: Kon Artis]\nNow this thing here, it may cause concern, but\nIt's just a little story bout a shark eatin worms\nIt's, not a riddle, but subliminally catches on\nHow one little lie can turn into a bigger one\nWhen I was a young, guppy in the sea\nYou could see all the bigger fish pickin on me\nCause they knew I didn't really have the guard or bullet\nAnd the other sharks that have teeth sharper than me\nI'm a never-endin story about a shark this big\nThe load of kids that got an act for fizz\nSo sit back, kick back with a bag of chips\nWhile I tell you bout something stupid I did...\n\n[Hook]\nThey say that one little lie turns into another, then you go and cheat\nBy the time you know it, you are wrapped up in a whole bunch of seaweed\nYou shoulda listened to your mama, and listened to your daddy, when they tried to speak\nAnd tell you that there's just too many fishes in the sea\n\n[Verse 2: Proof]\nI'm off to work but I'm late (hey) but what can I say? (hey)\nI'm cool with the boss and then of course it's a payday\nWe reachin the weekend and I'll be treatin my baby\nTypical day, dude's in the way - but hey wait!\nShark's in the water, gotta duck in the corner\n'til I'm caught, I'mma talk and I walk where I wanna\nHittin the seaweed, sippin this green tea\nBig fish in this small world, they'll all believe me\nFor knocking a shark off, protecting my city\nThey all grab my CD and now I'm a popular rock star\nLike it or not though I'm a marvelous artist\nWorking my hardest and becoming a starfish\n\n[Verse 3: Kuniva]\nNow what am I to do? The boss is on my back\nI gotta follow his orders when sharks attack\nIt's a dangerous scene, but I'm a Rasta man\nCross me and my brother, it will cost ya, man\nAnd this little pipsqueak is gettin' on my nerves\nSo my tentacles should give him just what he deserves\nSo you better swim fast cause I'm after ya\nAnd go and hide inside the mouth of a clam or somethin'\nCause I'm out and about - I'm bad news, a henchman\nA jellyfish with an attitude, so listen\nSwim for your life cause I'm on your tail\nSo frightenin I scare a snail out of its shell\n\n[Hook]\nThey say that one little lie turns into another, then you go and cheat\nBy the time you know it, you are wrapped up in a whole bunch of seaweed\nYou shoulda listened to your mama, and listened to your daddy, when they tried to speak\nAnd tell you that there's just too many fishes in the sea\n\n[Verse 4: Swift]\nI love this liquid, I'm silly when I'm in it and I bet\n(This water we're standin in is wet)\nDuh! What do you expect from me?\nI'm a platinum Jack Dempsey, trying to get a fee\nAnd everybody know that I'm the G of the sea\nI just knocked this shark off - the dude tried to eat me\nI guess he didn't like me, it might be because I'm a Pisces\nThey always try to take me lightly\nSo why the trouble? I just wanna hustle\nAnd multiply bubbles and pump my muscles\nI don't want to make a mistake\nCause these fishermen will set you up, and I ain't fallin for the bait\n\n(Daddy - what are we gonna do with a fish with a tattoo?\nWe're gonna eat him. What do you think?)\n\n[Verse 5: Bizarre]\nI'm a lionfish with dreams of makin it big\nHouse in the ocean, three ugly kids\nAnd why everybody keep on pickin on me?\nI'm the sexiest, prettiest fish in the sea\nHeck no, I ain't nobody dish\nCause I'm in love with Angie - the beautiful angelfish\n{*kissing sound*} Give me a kiss baby\nI'm running from the white shark, you tryin to make me crazy\n\n[Hook]\nThey say that one little lie turns into another, then you go and cheat\nBy the time you know it, you are wrapped up in a whole bunch of seaweed\nYou shoulda listened to your mama, and listened to your daddy, when they tried to speak\nAnd tell you that there's just too many fishes in the sea\n\n[Repeat 8X]\nNo, no, no, no, no, no, no, no", "image": "https://images.genius.com/8d2804876d1b3d3d1868ca11549ba7fa.1000x992x1.jpg"}], "artist": "D12"}