{"songs": [{"title": "Who Do You Think I Am", "album": "Gazing at the Moonlight", "year": "2009-10-27", "lyrics": "[Intro]\n— Fuck is this! Hello\n— Hello Marcus?\n— Huh!\n— What you doing?\n— Watching 'Cops', what you doing?\n— Just sitting here thinking about my baby Harold, but guess what the fuck he did\n— (What?)\n— He said he only going to stay me for a week Marcus, and he fucking been here for like three months already, what do I do?\nI mean I don't wanna tell him to leave 'cause he's my boyfriend, and I love him Marcus!\n— Man, hey man wait, wait hey man hold on a second man\n— Uh what?\n\n[Verse 1]\nBitch who do you think I am?\nAyy yo, this shit has gotten out of hand\nWhy you calling me when you be having problems wit' ya man (Huh?!)\nI got enough problems as it is\nGirl you talking to the kid who don't know how to get a bitch (Bitch!)\nIf you want me to get all mushy as a friend\nThen you better give me motherfucking pussy at the end (What?)\nYou making me feel like a wussy little man\nAnd it's worthless if I don't get the tushy in my hand (Man!)\nI don't want to talk for some hours every night\nAbout the man you like, and how he'd rather fight\nThan build your relationship, just face it, bitch\nI don't give a fuck, fuck him, take his dick\nOnly reason that I even listen\nIs 'cause I'm seeking admissions, to put my penis on yo freaking clitoris (Ha!)\nI'm tired of it, I just want to say \"God damn!\"\n(God damn!)\n\n[Hook]\nBitch who do you think I am?\nMy boyfriend dumped me, I'm so lonely (So?)\nBitch who do you think I am?\nJames always act like he don't want me! (So?)\nBitch who do you think I am!\nI want yo pussy! (Pussy, pussy!)\nBitch who do you think I am?\nIf you ain't thinking about letting me hit it, you need to quit it (Shiiit)\nBitch who do you think I am?!\n\n[Verse 2]\nA fucking gay dude who listens to your stories?\nIf they nice or if they boring? Girl I'm tired and I'm snoring\n'Cause your vibe is just annoying, and I'm tired of ignoring\nAnd avoiding and supporting this shit, and plus I'm horny\nYou think I'm really into that? Girl, put an end to that\nI just want to get the snatch, Ching, Ching, hit the jackpot!\nBitch open up your legs like a laptop\nTake a fat cock, yeah, then I'll let your ass talk\nBut otherwise, if you don't, we gon' slap box\nFuck around and ride up on yo block and get yo ass popped\nWasting my time, now I'm wasting my rhymes\nMaking this song? 'Cause you ain't got naked yet, ho?\nYou think I put that time in for nothing?\nFuck that girl, we either fighting, or fucking!\nAnd I ain't playing wit' you girl, I'd hate to diss you\nNo wait, I like to diss you\nTurn this shit to wilder issues\n\n[Hook]\nBitch who do you think I am?\nMy boyfriend dumped me, I'm so lonely (So?)\nBitch who do you think I am?\nJames always act like he don't want me! (So?)\nBitch who do you think I am!\nI want yo pussy! (Pussy, pussy!)\nBitch who do you think I am?\nIf you ain't thinking about letting me hit it, you need to quit it (Shiiit)\nBitch who do you think I am?!\n\u007f\n[Interlude]\n— {Bitch crying}\n— Shello like jello\n— Marcus\n— What?\n— Come pick me up\n— Why? What happened?\n— He dumped me\n— Man shoot\n— He told me he doesn't love me anymore {Bitch crying}\n\n[Verse 3]\nI couldn't kick it wit' yo ass a while ago\nAnd now you want to hang 'cause he ain't around no mo'?\nWhat the fuck I look like, after he fucked you?\nAnd he dumped you? Now I'm the dude you run to?\nWhen he wants you, I'ma be the one you flee from soon\nThen I'll become the one you got your finger up to?\nIt ain't my motherfucking life, you think I care? Ha! Shiiit\n\n[Hook]\nBitch who do you think I am?\nMy boyfriend dumped me, I'm so lonely (So?)\nBitch who do you think I am?\nJames always act like he don't want me! (So?)\nBitch who do you think I am!\nI want yo pussy! (Pussy, pussy!)\nBitch who do you think I am?\nIf you ain't thinking about letting me hit it, you need to quit it (Shiiit)\nBitch who do you think I am?!\nMy boyfriend dumped me, I'm so lonely (So?)\nBitch who do you think I am?\nJames always act like he don't want me! (So?)\nBitch who do you think I am!\nI want yo pussy! (Pussy, pussy!)\nBitch who do you think I am?\nIf you ain't thinking about letting me hit it, you need to quit it (Shiiit)\nBitch who do you think I am?!\n\nLike I really want to hear that shit", "image": "https://images.genius.com/fb33e7a89a5050dc08095e21c220cc15.1000x1000x1.jpg"}], "artist": "Hopsin"}