{"songs": [{"title": "I Do It All Night", "album": "Battle of the Sexes", "year": "2010-03-09", "lyrics": "[Intro: Ludacris]\nHehehe, yeah (let's GO, ohh!)\nDamn right nigga (yeah yeah) what? (yeah)\nOkay (y-y-y-yeah) these girls be askin me, you know\nHow, how long, how long I can go for\nI tell 'em like this nigga (what you tell 'em?)\nI do it all night, I do it all night\nI do it, I do it, do it all night\nI make 'em say OHH! {*scratch*} OHH, OHH, OHH!\n{*scratch*} Gim-gim-gim-gimme some mo', HEY!\n\n[Verse 1: Ludacris]\nHa! I do it all night, my whip is all white\nI done had a couple drinks and I got a little buzz so I'm feelin alright\nBut the night's just gettin started, haters get disregarded\nRoll up them sweets, creep-creep let's hit these streets and get retarded\nI pop a bunch of bottles, my bitch be poppin too\nKeep talkin out yo' face, and she might be poppin you\nShe might be pop lock and droppin down to the flo' wit it\nMeanwhile all my dogs chasin paper, that's right we go get it\nSo get it right (get it right) kill the lights (kill the lights!)\nI'm feelin like I might just pop a pill tonight (pill tonight)\nCause the feeling's right (the feeling's right), pass me a Miller Lite\nThen grab that girl with the Coke bottle shape, she's my type (woo!)\nI'll take her home (take her home) and do the do (do the do!)\nI know the Kama Sutra, think what I'll do to you\nStick to you like super glue, maybe even like bubblegum (okay!)\nDon't go to sleep woman (why not) no matter how many times I cum\n\n[Hook: Ludacris & (Shawnna)]\nI do it all night, I do it all night\nI do it, I do it, do it all night\nI make 'em say OHH! {*scratch*} OHH, OHH, OHH!\n{*scratch*} Gim-gim-gim-gimme some mo', HEY!\n(I do it all night, I do it all night)\n(I do it, I do it, do it all night)\n(I make 'em say) OHH! {*scratch*} OHH, OHH, OHH!\n{*scratch*} Gim-gim-gim-gimme some mo', HEY!\n\n[Verse 2: Shawnna]\nAyy, ayy\nI do it all night, and I ride them logs high\nBaby lil' crib good, I'mma ask his shawty what that mouth like\nTell me if it's out of sight, tell me if he's slow and long\nThen he made his tongue above his nose, I said \"You know you wrong\"\nBut I'm really like sho' you right, tell me where you wanna go tonight\nAnywhere, any place, I can see it in your face you are the prototype\nTo the ceiling I'm so so high, so-so feelin like I'm so so right\nPlease tell me why the 'dro so fire, I can't stop zonin and I don't know why\nAy look - beep beep get up out my lane, y'all hoes can't do it like me\nIf you're thinkin I'm 'bout the game, take a look at my U-N-I-T\nThat's right I'm back on deck, but don't get it twisted the strap on deck\nThe mac on deck, the pack on deck, and e'ry damn day keep a rack on deck\nAnd that's on Jeff, that's on we, that's on Hoover and that's on me\nThat's that wood that match them seats, and that's in the Caddy and that's on 3's\nNo matter what they said I been gettin my bread, get my paper, get my check\nBut anybody wanna try to ask I've been gettin some heeeead\n\n[Hook: Ludacris & (Shawnna)]\nI do it all night, I do it all night\nI do it, I do it, do it all night\nI make 'em say OHH! {*scratch*} OHH, OHH, OHH!\n{*scratch*} Gim-gim-gim-gimme some mo', HEY!\n(I do it all night, I do it all night)\n(I do it, I do it, do it all night)\n(I make 'em say) OHH! {*scratch*} OHH, OHH, OHH!\n{*scratch*} Gim-gim-gim-gimme some mo', HEY!\n\n[Verse 3: Ludacris & Shawnna]\nHow many women can I fit up in my Cadillac?\nSo high I can't SEE, feelin like I got cataracts\nSome in the middle of the night say I get drunk and don't know how to act\nI don't know how to act\nHe don't know how to act\nAnd I don't know how to stop, and I don't know how to quit\nBlowin on a couple zone, now we need another fifth\nAnd I mean I'm out my mind, not I mean I'm out my body\nSee we do this all night, is you comin with me shawty?\n\n[Hook: Ludacris & (Shawnna)]\nI do it all night, I do it all night\nI do it, I do it, do it all night\nI make 'em say OHH! {*scratch*} OHH, OHH, OHH!\n{*scratch*} Gim-gim-gim-gimme some mo', HEY!\n(I do it all night, I do it all night)\n(I do it, I do it, do it all night)\n(I make 'em say) OHH! {*scratch*} OHH, OHH, OHH!\n{*scratch*} Gim-gim-gim-gimme some mo', HEY!", "image": "https://images.genius.com/05b5494c6b36a8d257cb2950d2d8896c.640x640x1.jpg"}], "artist": "Ludacris"}