{"songs": [{"title": "I’m a New Man", "album": null, "year": null, "lyrics": "Well the song says no one man should have all that power right?\n\nThere’s definitively been times I let\nLet power, get the best of me…\nAnd let the world take the rest of me\nI look in the mirror and say\n“God, is this, is this my destiny?\nIs this what I’ve done\nAfter all the years of you blessin’ me?”\nWell maybe this is just a moment\nA moment of you all testin’ me\nTo see if I can still act professionally\nTo keep me at bay\nLike the Chesapeake\nGuess it’s me\nJust a ‘G\nFrom the C.I.,\nHonest… And why?\n\nWhy would you give me that Power?\nKnowing I was just an artist\nKnowing exactly where my heart is\nAnd I will only work the hardest\nAnd sometimes, put art, before being the smartest\nAnd sometimes act retarded\nJust look at what I started\nAnd they wanted me to be dearly departed\nDie, nigga die, and I had no reply\nAnd I still looked her in the eyes\nAnd said that I could touch the sky\nAnd after all the drama\nI wonder where I would be if I still\nHad my Momma, Common\nAnd everybody I was promising around me\nYou know how niggas from Chi town be, sometimes we wild\n\nAct like a child\nGet fouled\nStay in style\nAs of now …?\n... flows through the veins of a modern day\nPharaoh. In American Apparel\nStanding down the barrel of the media\nFor the man that face never made it in the encyclopedia\nHis story, His glory\n…and they re-write history right in front of us - in front of us\nBut what happens?\nWhen one of us is on the other side of that T.V. screen?\nYou know what I’m sayin’. Real niggas you know what I mean\n- you know what I mean\n- you know what I mean\n- you know what I mean\n\nOr at least that’s what I thought\nBut when they sayin’ “Hey that’s what the real nigga do, right?”\nNaw not right, that’s just mean, that’s just me that’s not, right\nNow how long did it take me to realize?\nAnd open up my fucking eyes!\nThat this shit is just a disguise\nAll the fame!\nAnd the power!\nAnd the hour!\nIn the showers!\nOf the diamonds!\nAnd the jewels!\nAnd the gold!\nEverybody say you cold!\nEverybody screaming at motha ****ing shows\nAnd you know what?\n\nYou wake up in the morning\nAnd in awe you’re a real person\nAnd worse you got the …?...\nGot a little bit harder\nA little bit more insignificant\nYou was the terrific ****\nBuying expensive ****\nLast year worked for Louis or Ford\nToo much for me to even record\nThe only thing I had to do was get my heart out\nThe greatest blessing in the world is the fact you let me get my art out\nThe fact that you accepted me and didn’t neglect me\nEven when I was a …?...\nEven when I went to these meetings straight dolo\nI had to go solo. I used to have a group\nThat group used to wear Adidas and\n…?... and then I got stupid and left them niggas\nAnd said I’m better than ya’ll when it was true\nNow when I finally got the power man what the **** did I do?\n\nAnd I’m so sorry to how every one of ya’ll had to fight for my name\nEvery one of ya’ll a year ago, that all waited for this change\nEveryone who said “Kanye is that nigga quit talkin’ names”\nAnd I know! I am the one to blame\nAnd the people that I-I-I, let down\nI want to tell you right here - right here, right now\nThat I’m a new man that understands why people abusing the power\n\n*Crowd erupts drowning out the lyrics*\n\nAnd make more music for the world to love!\nAnd there’s so many people I could thank there’s my Mom and God and above\nSo all ya’ll, and everybody throw your hands in the sky!\nEveryone touch the sky before the day never dies! dies! dies!\n\nNo one man should have all that power!\nThey say no one man should have all that power!\nThey say no one man should have all that power!\nThey say no one man should have all that power!", "image": "https://images.genius.com/70c6e506a91f6dabdd23cad304812ce3.533x533x1.jpg"}], "artist": "Kanye West"}