{"songs": [{"title": "Once Again", "album": "Till Death Do Us Part", "year": "2004-03-23", "lyrics": "\"Ladies and gentlemen.. boys and girls.. I bring to YOU\"\n\n[Intro - samples + vocals]\n\"Once again!\"\n[B-Real] Once again it's Cypress Hill\n\"Once again\" .. \"Once again!\"\n[B-Real] Once again it's Cypress Hill\n\"The greatest show on Earth!\"\n\"Once again!\"\n[B-Real] Once again it's Cypress Hill\n\"Back again!\"\n\"Once again!\"\n[B-Real] Once again it's Cypress Hill\n\"I bring to YOU\"\n\n[Verse One: B-Real]\nWelcome everyone, take ya places\nIt's great seein all these familiar faces\nYou want thug shit?  We got a lot of it\nYou wanna get high?  I'm on top of it\nYou want bottles?  C'mon, we poppin it\nYou want a revolution?  Ain't no stoppin it\nEnemies try to fire back\nDesire that, find you where the tire track\nCause we run ya down son, but in spite of that\nGot a joint?  Fools give me my lighter back\n... I'ma light up the bomb\nI'ma blaze 'til we set off the fire alarm\nNo need for evacuation\nFind a honey that's ill for ejaculation\nShe got friends, well the more the merrier\nNo limits, no worries, no more barriers\n\n[Hook 2X: B-Real, mixed with samples]\nOnce again it's Cypress Hill\nWe some ill-ass niggas straight bumpin the field\nSmoke it up, from now until\nSomebody calls out steel and we live for the thrill\n\n[Verse Two: B-Real]\nPlug the mic in, and I'll move the crowd\nNeighbors get mad cause the music's loud\nI send a few girls in the hall to talk\nCrusty old man never called the cops\nNo pistols, if you get my drift yo\nYou pull one and miss better slit yo' wrists bro\nThis ain't a gangsta party\nBut if you turn it into one a bullet might pierce yo' body\nRelax, there's a lot of girls in here\nYou shitfaced niggas, don't earl in here\nDon't break shit or take nothin, mind your manners\nOr your head goes BOOM like it's fuckin skanless\nBut we ain't for all that right now, just chill out\nWe can pop bottles or let the blood spill out\nCuanta, suck it up, shut your trap\nBefore you lose that fine-ass girl on your lap\n\n[Hook]\n\n[Verse Three: B-Real]\nYou wanna room?  Let me clear one out\nBut while I'm gone, just don't let the beers run out\nIn the morn' we can watch all the tears come out\nWhen the pigs come, a nigga wanna hear one out\nFor now, we can pass the time\nBlazin it up, if you slow you the last in line\nGot a roach, so what?  You ain't spent a dime\nYou ungrateful-ass critter, back the hell of mine\nYou can, lose the life or lose the knife\nUse the pipe, but I can't lose tonight\nAll the girls bein picky who they chose tonight\nYou better hope you chillin with the right crew tonight\nSee that girl over there?  Yeah she like your style\nProbably seen her on the video \"Girls Gone Wild\"\nHesitation is constipation\nOf your game when you're in for a night of elation\n\n[Hook]", "image": "https://images.genius.com/bbdbef4d71e94241d00e6cf766f68925.640x640x1.jpg"}], "artist": "Cypress Hill"}