{"songs": [{"title": "Speakers On Blast", "album": "The R.E.D. Album", "year": "2011-08-19", "lyrics": "[Verse 1: Game]\nIt's not usual, the game be, all up on some South shit\nStraight West Coasting, you can tell by my outfit\nRed 'nati fitted, \"Blood in, Blood out\" shit\nEmpty jelly jars, nigga, bird in the couch shit\nThe mad rapper, Oscar the Grouch shit\nExcept when I'm hopping out of cans, I'm pulling out shit\nDippin' a 4 though, double X 3-D Polo\nIf hip-hop was the league, I'd be the motherfuckin logo\nYour last shit was so-so, you should sign to Jermaine\nI've been hard since I was solo\nNiggas feel my pain, I make it rain without the strippers\nGo against the grain, and push your shit back like some clippers\nI bang and then I hang out at the Staples like Blake Griffin\nYou can tell I'm getting money the way that glass house is sitting\nI mash out the strip then like Nash when I'm dippin\nFeeling like God's Son, the way that It Was Written\n\n[Hook]\nThem boys want they music on blast\nDon't turn me down, turn me up every time them cops pass\nMashed on the gas, am I getting high, don't even ask\nCause I got another ounce up in the stash\nThem boys want they music on blast\nDon't turn me down, turn me up every time them cops pass\nMashed on the gas, am I getting high, don't even ask\nCause I take 2 hits, and then I pass\n\n[Verse 2: Game]\nI see the cops in the rearview, why can't a motherfucker chill in the car\nFeelin' like Missy, why you all up in my grill\nThey must know that I got bird stashed all up in my grill\nCamouflage by the Armor All while it's sparkling off my wheels\nAnd I fuck hoes that prey on Dwight Howard and Shaquille\nNot them throwback rats they be on showin' college hill\nFor real, I think my first album sold 5 mil'\nAnd you say to yourself \"He's broke\"\nWell how the hell am I ballin', like Spalding\nI did a couple of movies, now agents calling and calling\nCan't get to the phone right now cause balls is all in this bitch mouth\nWhen did we start taking these tricks out?\nNow she gon' run her big mouth and tell her girlfriend\nYou had her all up in the wind\nBlowing yo cheese on Louboutins, and now that bitch is in the wind\nAnd after the next draft, she gon' start that cycle again\nHow you claimin' that bitch when she with him?\nCome again cause\n\n[Hook]\n\n[Verse 3: Big Boi]\nDaddy Fat Sax\nIf my balls are on your chin, then can you tell me where my dick's at?\nGag order ghetto, head hunter, head buster through the chit-chat\nI skip to the lou, my darling bring the thunder, I'm the lightning that strikes twice\nMotherfucker, call me massa\nCause I runs the plantation and I'm whooping niggas asses if they disrespect the presentation\nBelow the Mason-Dixon, we facin' the basis, never missin' pimpin'\nYou can embrace it or come face to face with total devastation\nMy mojo is never fadin', I'm in my Optimus Prime transform\nSwitch it up, heat it up, speed it up, that means I'm gone\nLight years, ahead of your Buzz, Toy Story and club songs\nBoy, gone, the A-T-L-iens are phoning home\nBut I feel like a librarian, cause style's are being' loaned out like books\nA castle full of crooks, rape and pillage\nThey'll do anything for money, I bet misleading the village\n\n[Hook]\n\n[Verse 4: E-40]\nNot from New England, but I pack a patriot\nNot from Atlanta, but I got the cater\nNot from Chicago, but I'm a bear\nI'm a bay area nigga, 49er, Raider\nI'm about my bread man, I ain't no sucker\nNow these bitch ass niggas soft as table butter\nI'm about my riches, magazines, street hustler\nYou can ask your uncles, daddies, mothers, and your older brothers\nBut I used to flea flick that yola white\nSellin' that shit below the retail price\nI'm a rare breed like the bike club, get it right\nDesperado like Toriono, shout out to Dynamite\nI got my red cup, and some green\nWhat kind of green you smoking pimp? Blue dream\nMy nigga let my hit that there hemp, do your thing\nHow many woofers in your trunk? 4 15s\n\n[Hook]", "image": "https://images.genius.com/5f5301fa46a1afd76d0d034e80d23434.1000x1000x1.jpg"}], "artist": "The Game"}