{"songs": [{"title": "They Say (Live at the North Sea Jazz Festival, 2005)", "album": "Live at the Jazz Room", "year": "2005-07-10", "lyrics": "[Intro]\nBut I could give a damn what they say\nI could give a damn about the things that they say\nI could give a damn about the things that they say\nI could give a...you know why? 'Cause...\n\n[Chorus: John Legend]\nThey say \"What's happenin'?\"\nWe say the facts and if, they lie\nWe comin' back for them\nThey might say... but they don't know!\n(Come on)\nThey say, They say...\nThey don't know\n(Y'all know what they say, right? You know what they say)\n\n[Verse 1: Common]\nYo, they say a nigga lost his mind\nBut in the scheme of things I never lost a rhyme\nThe thin line between love and hatred\nI'm the black pill in the Matrix, the saturated life\nThey say life is what you make it\nSo I wait quick on a spaceship so I can take it\nAs high as the stakes get when paper get low\nI be tellin' Derek, \"Tell Cara get us a show\"\nLittle Com, I make righteous bitches get low\nRichest man ain't necessarily the nigga with dough\nThey say \"You ripped\" \"Wow...\" Yeah, that's what they say\nMy niggas couldn't tell it was me, like Jamie in Ray\nPaintin' a day, wit' focused crime, broads, and good wine\nThey say \"Dope is sour so it's homework and hood crimes\"\nI stood mine, for forever and a day so goodbye\nThey never could say - tell 'em, J\n\n[Chorus]\nThey say \"What's happenin'?\"\nWe say the facts and if, they lie\nWe comin' back for them\nThey might say... but they don't know!\n(Come on)\nThey say, They say...\nThey don't know\n\n[Verse 2: Common]\nThey say \"Dude think he righteous\"\nI write just to free minds, from Stony to Rikers\nAmongst the lifeless, in a world crazy as Mike is\nOn my paper, whether its weed or Isis\nThey say \"life is a game,\" so I play hard\nWritin' for my life 'cause I'm scared of a day job\nThey say \"Sef kept the hood together\"\nI tell the young, \"We can't play the hood forever\"\nPlay my cards right, they say I went too left\nThey showed me strange love, like I was Mr. F\nPlayed chess in this game of, pawns and knights\nNow I claim \"King\" like Don, or Frank White\nThey say my life is comparable to Christ's\nThe way I sacrificed, and resurrected, twice\nThey say \"The crochet pants and the sweater was wack\"\nSeen \"The Corner\", now they say \"That nigga's back\"", "image": "https://images.genius.com/045767268a13a813bd7645f24fad7896.499x499x1.jpg"}], "artist": "Common"}