{"songs": [{"title": "So Much More", "album": "Finally Famous (Super Deluxe Edition)", "year": "2011-06-28", "lyrics": "[Chorus]\nI been this way before\nDreamed of havin' so much more\n\n[Intro]\nI do It\nFor the city, man\n\n[Verse 1]\nFeeling like I got the cheat code to life\nJewelry looking like it got free-throwed in ice\nDebating with the Reaper not to repo my life\nCause in my 23 years I've lived a couple lives\nLike why? Cause I stunt? Bag the tree like it's fall?\nThe girls that was out of my league trying to play with my balls\nI pay bills, I work hard, and when my mama cried a river\nThey never gave us a bridge, they gave us a bridge card\nNigga riding low, puffing on loud\nI came way too far to fuck it up now\nText from my mom said \"Me and your grandma proud\"\nI'm way too deep in the game to go sit back in the crowd\nTeacher told me to get a job, save up for 401(K)\nMan, I'd rather be young as shit counting 401k\nI'd rather die with a smile instead\nI'm just multiplying my money and dividing the legs\n\n[Chorus]\nI been this way before\nDreamed of havin' so much more\n\n[Verse 2]\nBut I'm never dividing the bread\nBitch, I bet I get the debit if I don't get the cred I deserve\nThrowing West side up like Pac up\nWhere they pop your block up, b-blocka big poppa flock off\nYou holy lil' whoaty holy kenobi chewbacca\nI'm Balenciaga, Chanel, Hermes but I bet you that you won't find it\nRockin' Louis and MCM, I guess I'm clothes-minded\nI'm in the Obama suite, you one below up in the Joe Biden\nI'm in your city just chilling where all your hoes hiding?\n20k for the fit because it's 24 carats\nI can't lie, the price'll probably go up when I wear it\nI'm just D-town repping\nMaking all these niggas who second-guessed regret it\nRegret it like half the hoes I smashed in the sheets\nAt least I realize now how much I love Ashley Marie\nAnd when it's all said and done, I'll probably get on my knee\nCause she put up with too many games not to have her a ring\nMan, she almost cried when she see me on TV on BET\nJust making it seem easy! Standing next to Common Sense and Yeezy\n\n[Chorus]\nI been this way before\nDreamed of havin' so much more\n\n[Verse 3]\nMan, I wake up to a wet dream\nEvery day's a Friday and every night's a sex scene\nEvery week is Fashion Week and every day I'm pressed clean\nDetroit's angel, I even got red wings\nHeaded to the ball, me and three prom queens\nIt's prom night, and guess who's the prom king?\nThey having a kissing fight and I'm Don King\nEverybody know I'm coming soon like Lebron's ring\nTell me that wasn't the verse of the year\nMan, that shit deserves a hearse and a tear\nSwear to God I'm overlaid, all my girls get overfucked\nAll my deals be overpaid and all my joints be overstuffed\nFinally Famous bitch, there ain't a fucking thing that's over us\nSo take that check out and owe it up! Man, I turn impossible possible\nAnd what these niggas could barely see into optimal\nThe same teacher who told me rap is what not to do\nSaid I'm throwing my life away, if I drop out of school\nWant me to come speak to the kids, the point I gotta prove\nIs that I did everything they told me not to do\nAfter I went down the road they told me not to cruise\nThey ain't know that was my road to success\nNow my picture on the wall hanging to help the kids follow through\nMy dream girl is every night, my dream car is optional\nMy old school look like a T-Rex: I should feed her fossil fuels\nMan, I turn my enemies to molecules, lil' hoes\nWithout any preparation, I exceed these expectations\nMan they wanna see me dead, but I gave 'em dedication\nAnd I'm yelling fuck 'em all with a hundred exclamations\nCause I'ma be the man til my fucking expiration\n\n[Chorus]\nI been this way before\nDreamed of havin' so much more\n\n[Outro]\nBIG, I do it, this goes out to my muthafucking city of Detroit\nWestside to be exact, right over there on Northlawn\n\n[Chorus]\nI been this way before\nDreamed of havin' so much more", "image": "https://images.genius.com/74dafd89a1fed6671db23bd241b486e5.1000x1000x1.jpg"}], "artist": "Big Sean"}