{"songs": [{"title": "You Said", "album": "BEAUTIFUL THUGGER GIRLS", "year": "2017-06-16", "lyrics": "[Intro: Young Thug]\nSo what's up with all that goddamn tough talk you had earlier on the phone, you know what I'm saying?\nWhen you said you was gon' goddamn do this and that to me when you saw me?  (Freaky-deeky)\nWhere all that at? Oh, I thought so\nYou got high a level of confidence, you know what I'm saying\n\n[Chorus: Young Thug]\nYou said you gon' fuck me to death when you see me\nYou said that, you said that (You said that)\nYou said you gon' do me the worst\nI remember you right when you said that (I remember you)\nYou said you gon' kiss from my neck to my chest\nTo my navel and dick and nuts (You said all that)\nWe talked about everything\nThen you know that we got us some making up (Ooh)\nI lick on that puss on a pill\nAnd I make her stand up like some bunny ears (Bunny ears)\nI bite on her butt and I suck on her toes\nAnd her soul go outta here (Go outta here)\nShe look at him like he roadkill and I turned 'round her life\nLike I'm Dr. Phil (Dr. Phil)\nLet's get freaky deeky 'round here\n\n[Post-Chorus: Young Thug]\nSay now, ooh, ooh, ooh (I need you to say now)\nSay now, ooh, ooh, ooh (I want you to say now)\nSay now, ooh, ooh, ooh (I want you to say now)\nI want you to say now\nSay now (Jeffery!), ooh, ooh, ooh\n\n[Verse 1: Young Thug]\nI got the door unlocked\nAnd I know right now she'd rather have my dick than a watch (Facts)\nAnd I'm not right about everything\nBut I got a strong feeling she'll take me a charge if we run into the narcs\nAnd I'm seeing all your emotions, came a long way from roaches\nUnwrap the birds, get to rolling\nI ain't never needed nothing brodie\nAll four pockets, macaroni\nRose-gold AP like a token (Token)\nBought that bitch a mink, now she cozy\nRather go to jail, I ain't told 'em (Yeah)\nI get excited when I see you (Excited)\nI'd rather freeze up and get shy when I see you\nI'm daydreaming and I’m steady just strappin' our child in the rearview (Ayy)\nIf you a cool one you a real one\nLet's go to Africa, to the Pilgrim (Ayy)\n\n[Chorus: Young Thug]\nYou said you gon' fuck me to death when you see me\nYou said that, you said that (You said that)\nYou said you gon' do me the worst\nI remember you right when you said that (I remember you)\nYou said you gon' kiss from my neck to my chest\nTo my navel and dick and nuts (Dick and nuts)\nWe talked about everything\nThen you know that we got us some making up (Ooh)\nI lick on that puss on a pill\nAnd I make her stand up like some bunny ears\nI bite on her butt and I suck on her toes\nAnd her soul go outta here\nShe look at him like he roadkill and I turned 'round her life\nLike I'm Dr. Phil (Dr. Phil)\nLet's get freaky deeky 'round here\n\n[Post-Chorus: Young Thug & Quavo]\nSay now, ooh, ooh, ooh (Say now)\nSay now, ooh, ooh, ooh (I want you to)\nSay now, ooh, ooh, ooh (I want you to)\nSay now (Say now, yeah), ooh, ooh, ooh, ayy\n\n[Verse 2: Quavo]\nLast week she told me we ain't gon' make it past this day (Last week)\nWe in my house, she wanted me to leave, but where am I gonna stay?\nShe hid the keys in the attic, she even tried to hide my Patek (Keys)\nPlease stop being petty, I don't want no more spaghetti\nMy side bitch in the driveway, yeah\nWaiting on you to leave, bae, yeah\nYou gotta know, yeah, the time changed\nI don't know what's on your mind frame\nBut I gotta go and gangbang\nThe streets mine so I switch lanes\nYou said \"I won't change\" (Won't change)\nYou said \"I won't change\" (Won't change)\nI regret I put you up on game (Regret it)\nI regret I told your mama \"Life would change\" (Momma)\nYeah, out of all the cash, I put on her (Cash)\nOut of all the bags, I put on her (All the bags)\nAnd I said I don't brag, I don't boast\nSince you popped the tags, I don't want 'em\nAnd my niggas they been placed the vote (Vote)\nBut you needed to get off the boat (Boat)\nI can't blame it on me I said \"No\" (No)\nGot her head so big it explode (Explode)\n\n[Chorus: Young Thug]\nYou said you gon' fuck me to death when you see me\nYou said that, you said that\nYou said you gon' do me the worst\nI remember you right when you said that (Remember you)\nYou said you gon' kiss from my neck to my chest\nTo my navel and dick and nuts\nWe talked about everything\nThen you know that we got us some making up\nI lick on that puss on a pill\nAnd I make her stand up like some bunny ears (Some bunny ears)\nI bite on her butt and I suck on her toes\nAnd her soul go outta here (Outta here)\nShe look at him like he roadkill and I turned 'round her life\nLike I'm Dr. Phil\nLet's get freaky deeky 'round here\n\n[Post-Chorus: Young Thug]\nSay now, ooh, ooh, ooh (Say now)\nSay now, ooh, ooh, ooh (I want you to)\nSay now, ooh, ooh, ooh (I want you to)\nSay now (Say now), ooh, ooh, ooh, yeah\n\n[Verse 3: Young Thug]\nLet's make our last toast (Jeffery)\nShe gets the last gulp (She gets the last gulp)\nI got some Actavis yeah, I want the last dose\nI got a good cash flow (I got a good cash flow)\nBut I don't want the fast dough (Don't want the fast dough)\nYoung Thugger got filthy rich, I came right out the rat-hole (Facts)\nI smoked a whole leaf, I'm drinking codeine\nI want some head and knees\nI don't want no teeth (I don't want finna teeth)\nI should've called off (Should've called off)\nI'm 'bout to OD\nIn her mouth like a golf ball (In her whole mouth)\nMy two homies\nBack it up on me, I make her squirt on the couch, eww\nPrivate party, only broads here (Private party)\nWe pass forty caps, no beers (Got the forty capsule)\nEvery diamond on me crystal clear\nMolly on me, baby, take it off of me (Off of me)\nCAT scan, white stuff on my jeans (Lap dance)\nHit it from the back, loosen up her spleen (Ayy)\nSay you mine, I'ma take it off and raw dog\n\n[Chorus: Young Thug]\nYou said you gon' fuck me to death when you see me\nYou said that, you said that\nYou said you gon' do me the worst\nI remember you right when you said that\nYou said you gon' kiss from my neck to my chest\nTo my navel and dick and nuts\nWe talked about everything\nThen you know that we got us some making up\nI lick on that puss on a pill\nAnd I make her stand up like some bunny ears (Some bunny ears)\nI bite on her butt and I suck on her toes\nAnd her soul go outta here (Outta here)\nShe look at him like he roadkill and I turned 'round her life\nLike I'm Dr. Phil\nLet's get freaky deaky around here\n\n[Post-Chorus: Young Thug]\nSay now, ooh, ooh, ooh (Say now)\nSay now, ooh, ooh, ooh (I want you to)\nSay now, ooh, ooh, ooh (I want you to)\nSay now, ooh, ooh, ooh (I want you to)\nSay now, ooh, ooh, ooh\nYeah, hey, hey", "image": "https://images.genius.com/9bc1176534f1203d5df1330fc7210bf2.1000x1000x1.jpg"}], "artist": "Young Thug"}