{"songs": [{"title": "Ho", "album": "Incognegro", "year": "1998-07-15", "lyrics": "[Chorus]\nHo (Ho!), you's a ho (Ho!)\nYou's a ho, I said that you's a ho (Ho!)\nYou's a ho (Ho!), you's a ho (Ho!)\nYou's a ho, I said that you's a ho (Ho!)\n\n[Verse 1]\nYou doin' ho activities with ho tendencies\nHoes are your friends, hoes are your enemies\nWith ho energy to do what you do\nBlew what you blew, screw what you screw\nY'all professional like DJ Clue, pullin' on my coat tail\nAnd why do you think you take a ho to a hotel?\nHo tell everybody, even the mayor\nReach up in the sky for the ho-zone layer\nCome on playa once a ho always\nAnd hoes never close they open like hallways\nAnd here's a ho cake for you whole ho crew\nAnd everybody wants some 'cause hoes gotta eat too\n\n[Chorus]\nHo (Ho!), you's a ho (Ho!)\nYou's a ho, I said that you's a ho (Ho!)\nYou's a ho (Ho!), you's a ho (Ho!)\nYou's a ho, I said that you's a ho (Ho!)\n\n[Verse 2]\nCan't turn a ho into a housewife, hoes don't act right\nThere's hoes on a mission, and there's hoes on a crackpipe\nHey ho how ya doin', where ya been?\nProlly doin' ho stuff 'cause there you ho again\nIt's a ho wide world, that we livin' in\nFeline, feminine, fantastical women\nNot all, just some, you ho who you are\nThere's hoes in the room, there's hoes in the car\nThere's hoes on stage, there's hoes by the bar\nHoes by near, and hoes by far\nHo! (But can I get a ride?!) No!\n(C'mon nigga, why?!) 'Cause you's a\n\n[Chorus]\nHo (Ho!), you's a ho (Ho!)\nYou's a ho, I said that you's a ho (Ho!)\nYou's a ho (Ho!), you's a ho (Ho!)\nYou's a ho, I said that you's a ho (Ho!)\n\n[Verse 3]\nYou gotta run in your pantyhose, even your daddy knows\nThat you suckin' down chocolate like daddy-os\nYou hoes are horrible, horrendous\nOn taxes, y'all writin' off hoes as dependents\nI see the ho risin', it ain't surprisin'\nIt's just a hoasis with ugly chicks faces\nBut hoes don't feel so sad and blue\n'Cause most of us niggas is hoes too\n\n[Chorus]\nHo (Ho!), you's a ho (Ho!)\nYou's a ho, I said that you's a ho (Ho!)\nYou's a ho (Ho!), you's a ho (Ho!)\nYou's a ho, I said that you's a ho (Ho!)\n\n[Outro: \"Ho\" & (Ludacris)]\nMuthafuckas I'm so tired of y'all niggas always talkin' 'bout ho this, ho that; you the muthafuckin' ho nigga. I wasn't no ho last night\n(Ho, bring yo ass!)\nOkay, hold on", "image": "https://images.genius.com/9ea8d719979b4d9e52d89271c9e0b7da.1000x1000x1.jpg"}], "artist": "Ludacris"}