{"songs": [{"title": "Damage", "album": "Return to the 36 Chambers: The Dirty Version", "year": "1995-03-28", "lyrics": "[Intro]\n(Say peace) Peace!\nDirty, Ol' Dirty Bastard\n(Say it, say it again)\nThe Genius! Genius (The Genius)\nThe Genius, the Genius\n\n[Verse: Ol Dirty Bastard & GZA]\nI'll grab the mic and I'll damage ya\nCrush your whole stamina\nHere comes the medical examiner\nOne verse then you're out for the count\nBring the ammonia, make sure he sniffs the right amount\nWake him up and then ask him\nWhy did he attend this --\nCompetition to get ass kickin' so tremendous\nBoy you know you shouldn't bother this\nLeave me alone like the son said G or he'll be fatherless!\nI got the asiatic flow mixed with disco\nRoll up on the scene like the Count of Monte Cristo\nAnd MCs start to vanish\nI stepped up to a jet black kid, started speakin spanish!\nYo he wasn't from Panama\nAsked him how he get so dark, the nigga said suntanama!\nHe responded so fast, he made me laugh\nHa-ha-ha, HARARRRH then I scared-his ass!\nKicked the hundred strongest rhymes\nI brought out the punk in him\nCaught him with a strong five deadly venom\nTold him enter the Wu-Tang\nWitness the Shaolin slang, that'll crush the shit you bring\nAnd watch your ass take a big fall, why?!\nMy Main Source is like a friendly game of stickball\nAnd as you step up to bat man and I play the riddler\nTry to do me for a rhyme and I'll change to Hitler\nGo out like a Nazi; you'll be wishin your fuckin' ass stayed home and played Yahtzee!\nOr watchin' Happy Days sweatin' Potsie\nWith Ralphie and Richie Cunningham, Joni and Chachi\nWu, who? Me gettin' wrecked so I'm through\nLike a ten and a half foot gettin' in a seven shoe\nNow picture that with a Minolta\nHave your ass doin some Night Fever shit like John Travolta\nI come strong, I make knowledge born, I flip the script\nAnd rock on from P.M. past the fucking Dawn\nPass the Hammer you're broke down, English grammar, what, what\nCan't understand it here's the panorama\nA complete view of how I defeat you\nShould've stepped to those fuckin' kids who tried to beat you\nYeah, I bust that ass before\nYou ran to Texas and came back but forgot the chainsaw!\nAnd when I perform a massacre\nBetter be coming with some motherfucking shit that's spectacular\nCrush the personal vendetta, well you just better\nStart stepping to your raggedy ass jetta\nPut the pedal to the metal\nYou and your DJ change your name to Ma and Pa Kettle\nAs I pass the bone, kicks your every measure\nIt's not a Newport but it's still live with pleasure\nC'mon don't be silly, just a bag of sensimilli\nRolled up in a Motown Philly\nI used to write all the time when I smoked\nGrab the mic, then I like kinda went for broke\nWith visually concepts strongest rhymes and biceps\nLyrically speakin', three to four rhymes a choke\nSome think they be harmin' this, claimin' they be bombin' this\nBut they still remains anonymous\nI pull strings like Jimi Hendrix\nRhyme on beats that go backs to the days of Eddie Kendricks\nI teach the truth to the youth, I say, \"hey youth\nHere's the truth, better start wearing bulletproof\"\nArm yourself with a shield\n'Fore you get trapped up just like the children in the cornfield", "image": "https://images.genius.com/7985ae9f777e769efe184aff8b763e1c.1000x1000x1.jpg"}], "artist": "Ol’ Dirty Bastard"}