{"songs": [{"title": "Gazzliona", "album": null, "year": "2017-12-28", "lyrics": "[Instrumental]\n\n[Verse 1: Joey Bada$$]\nGuess who's back again\nI'm known to make a fucker lose oxygen\nI get sparked off intoxic drops of gin\nWait, stop, drop it in, roll over\nIs what I told her, don’t play games, I can't console her\nHand it over to the Pro like a controller\nWe overload her 'til she froze up, it was over\nThe Pros expose her, her ex propose her\nThey be like, \"You ain't that hot\", I know\nBut they still knock my door askin' 'bout Jay Hova\nMy witness, label me, not the Cohen\nI got the sickness, hit this, get fixed with the quickness, right\nAnother J, J blow like dynamite\nThe other day, I was poor, dine I might\nHad nothing but a empty appetite\nNow I live a crazy emcee rapper life\nBig tings ah gwan, top shotta\nKill it every show, rank's up like Shabba\nMr. Lover flow, hot off the top like lava though\nI'm too hot, still skillet the pot\nTurn bass metals into gold\nThey ain't think alchemy before I go\nYummy, let me wrap up my meat then explode\nWho am I? The fiery Pro\n\n[Verse 2: Kirk Knight]\nThe prime suspect, still the odd one out (GET 'EM!)\nI might lose my mind, I might fuck your spouse (GET 'EM!)\nSteal it, go and take it 'cause I need one now (YEE!)\nWho am I? Keep an eye on, don't lose count\nShe said nothin' lasts forever, keep comin' back hun\nGive me hot propulsion through 150 suns\nThe image in my mind brings the masterpieces\nMake hot feces, I like my plate hot, feast\nAnd my theory is, E.M.V, word to my J\nMy achilles is livin' in a world where MC's is\nMass affected, Poseidon of rap\nI can see it all happened with the raps I spawned\nCitizen but I guess y'all watch, (?)\nGive me a glass but I mazel tov\nAnd one balled too hard, such a star\nThe energy I give off, I run conEd\nStill money in whatever wall it's in\nIt's hard to sin, with my contract, it's hard to sin\nSo who am I to shock therapy\nPhonetic, panic, dangerous, show-off, act static", "image": "https://images.genius.com/678691c7dbda30f42435fa64c7c11b36.340x342x1.png"}], "artist": "Joey Bada$$"}