{"songs": [{"title": "Baller", "album": "Blow the Whistle", "year": "2006-08-29", "lyrics": "[David] Ha hahaha! I ain't gotta say much... $hort, YEAH!\n[$hort] So you wanna be a baller?\n[David] David Banner~! Big Face\n[$hort] You wanna get paid?\n\n[Too $hort]\nYou gotta keep tryin, just don't give up\nCan't get on your feet cause you just won't get up\nYou dream about havin nice things but you don't have a plan\nHow you gon' get it, from your Uncle Sam?\nYour welfare check can't buy a house and a Benz\nWhat'chu wanna be, a mouse or a man?\nYou need a hustle, somethin that'll make some cash\nDon't step on the gas, you're goin way too fast\nIn your new sports car, you're dreamin again!\nSnap out of it - I know you're fiendin to win\nYou need to start from the beginnin, get a paper and pen\nWhat'chu like to do, what's your favorite thing?\nThere's gotta be somethin you can do wit'cha life\nSell things that a whole bunch of people will buy\nMake a lot of profits, make bank deposits\nWanna live like this, here's a shoe, how's it fit?\n\n[Hook: Too $hort] + (Banner)\nHow you gon' ball if you got no hustle\nHow you gon' pimp if you got no game (YEAH!)\nHow you win a fight if you know you can't tussle\nYour life ain't right cause you so damn lame (YEAH!)\nNow how you gon' ball if you got no hustle\nHow you gon' pimp if you got no game (YEAH!)\nHow you win a fight if you know you can't tussle\nYour life ain't right cause you so damn lame (YEAH!)\n\n[David Banner]\nNiggas wanna play with they life but won't play with they kids\nThey'll ball for these hoes but won't invest shit\nGo to church and pray to blue eyes, church is for them pew thighs\nSupersized by fries, I pimp a lot of bitches\nBut I'd rather save yo' lives\nI'm from a place where they hung black folks\nWhere a bird can be whipped from some raw AND dope\nNow you broke cause you smoke and you don't got a job\nMan get up off yo' ass and do just like Todd~!\nSell yo' shit up out the trunk\nStop hatin other niggas you can get what you want\nYou can get what you need without makin others bleed\nI'm the master of the P-U-S-S-E\nOops I meant Y, others gotta die\nJust to help sorry-ass lames get by\nNow you'll let a bird die if you saw a bush\nBut you're pussy in the hood nigga, come get douched\nYeah nigga!\n\n[Hook]\n\n[Too $hort]\nWhen you finally start makin some dough\nYou gotta work a lot harder, way more than befo'\nIt ain't hard to get in, but it's hard to stay\nWhen you start pimpin it's all night all day\nNon-stop, gettin it, then you start kickin it\nOut with some hoes, later on you'll be stickin it\nMove forward and continue to do what men do\nGettin money cause it's in you\n\n[David Banner]\nOr maybe bein a man ain't in you, you BITCH\nYou can sell out your own just so you can get rich\nNo soul, no vibe, but you sportin a cross\nMan the truth is you're tired and your spirit is lost!\nI've been baptized in dirt, pull your panties up nigga\nRather shoot ya in your mind instead of blowin out your liver\nDavid Banner, Mississippi until the day that I die\nYou can make it in this world, stand up nigga try\n\n[Hook]", "image": "https://images.genius.com/a946f356e20bac26df64ff8cca250ed8.500x500x1.jpg"}], "artist": "Too $hort"}