{"songs": [{"title": "Busa Rhyme", "album": "Da Real World", "year": "1999-06-22", "lyrics": "[Intro: Missy Elliott]\nSlim Shady\nSlim Shady\nSlim Shady\n\n[Verse 1: Eminem]\nWell, I do pop pills\nI keep my tube socks filled\nAnd pop the same shit that got 2Pac killed\nSpit game to these hoes\nLike a soap opera episode\nAnd punch a bitch in the nose 'til her whole face explodes\nThere's three things I hate\nGirls, women, and bitches\nI'm that vicious to walk up and drop-kick midgets\nThey call me Boogie Night\nThe stalker that walks awkward\nStick figure with a dick bigger than Mark Wahlberg\nComing through the airport\nSluggish, walking on crutches\nHit a fucking [pregnant] bitch in her [stomach] with luggage\nIt's like a dream I can't snap out\nI black out, I'm back out\nI'm lookin for something of to beat the crap out\nI'm bringing you rap singers two middle fingers\nI flip you off in French\nThen translate in English\nThen I'mma vanish off the face of the planet and come back\nSpeaking so much Spanish, Pun can't even understand it\n\n[Chorus: Missy Elliott]\nWon't you busa rhyme for me, boy? (Slim Shady)\nWon't you busa rhyme for me, boy? (Slim motherfucking Shady)\nWon't you busa rhyme for me, boy? (Slim Shady)\nWon't you busa rhyme for me, boy? (Slim motherfucking Shady)\n\n[Verse 2: Eminem]\nI had a huge attitude, started off staticky\nMad at you, had you mad at me automatically\nI'm not a commodity, I'm an oddity\nWho oddly enough developed himself a Halloween following\nIt's so big, if I counted up all the freaks who follow me\nI'd probably owe Ozzy Osbourne an apology\nCollege girls, live in an alcoholic's world\nFull of url, head twirls every time the toilet swirls\nCovered in throw-up, and I refuse to grow up\nI won't budge, I still tell a grown-up to shut up\nI made this rap game suspenseful, cause now I got an impulse\nGave to insult you with a pencil (Bitch)\nAnd waste the paper on you\nChopping down the oakwood\nCause everything that you wrote in your notebook was no good\nAnd as long as I stay in the studio and keep cuttin'\nYou motherfuckers are puttin' your words together for nothin'\n\n[Chorus: Missy Elliott]\nWon't you busa rhyme for me, boy? (Slim Shady)\nWon't you busa rhyme for me, boy? (Slim motherfucking Shady)\nWon't you busa rhyme for me, boy? (Slim Shady)\nWon't you busa rhyme for me, boy?\n\n[Bridge: Missy Elliott]\nTurn the music up, we gonna wake the neighbors\nWe gon' get high, we gon' roll the Vega's\nMe and Slim Shady on some shit daily\nWhat you want, what you got\nIs it hot, is it hot?\nTurn the music up, we gonna wake the neighbors\nWe gonna get high, we gonna roll to Vegas\nMe and Slim Shady, on some shit daily\nWhat you want, what you want?\n\"A person from another planet might disagree with you.\"\n\"Well, if you want my opinion, he comes from right here on Earth.\"\n\n[Interlude]\nSlim Shady, Misdemeanor\nTimbaland\nSlim Shady, Misdemeanor\n\n[Verse 3: Eminem]\nI'm homicidal and suicidal with no friends\nHolding a gun with no handle, just a barrel at both ends\nSpraying tecs at you until you see your fucking legs\nWith the bullet holes and the exit wounds laying next to you\nFucking mad dog, foaming at the mouth\nFuck mouth, my whole house is foaming at the couch\nJumped out of the 93rd floor of a building\nAnd shot every window out on the way down to the ground\n(Keep filming)\nWoke up to a hospital staff, got up and laughed, chopped 'em in half\nSuffocated the oxygen mask\nShit, if I get any higher\nI'mma get the East and West beefing again\nSlide back to Detroit and stand in the crossfire\n\n[Verse 4: Missy Elliott]\nY'all better call the police 'fore I kill this track\nDon't shoot Missy, get back\nI'mma put you all in the line and I'mma watch you MC's die\nYo Mommy, Mommy, Missy done lost her mind\nI think somebody done pissed her off this time\nI'mma have to bust you through your chest and\nYou gonna have to clean up the mess\nIt's raining, raining and it's pouring loud\nNever fear, 'cause pissy Missy's through the crowd\nI hear the gats go cha-pow\nWho shot me dammit, bitch get down\nDon't walk when I talk, I never talk when I smile\nLay em on down, like they lived underground\nFor the sound that me and Timbaland, we found\nGet your ass kicked later or get your ass kicked now\n\n[Outro: Missy Elliott]\nUhh, one-two Misdemeanor, Slim Shady, Timbaland, motherfucker\nUhh uhh uhh, two, two, two, triple zero", "image": "https://images.genius.com/f887ad1c0966679207185a705cecd837.1000x1000x1.jpg"}], "artist": "Missy Elliott"}