{"songs": [{"title": "Out of Towner", "album": "Hoodmorning (No Typo): Candy Coronas", "year": "2011-07-29", "lyrics": "Yeah blood, let's take these niggas back to 96, 11th grade when a nigga was walking the Compton High School. Cincinnati Red fitted snug on my motherfucking forehead. Nike backpack on, you know like Durant be wearing. Nike straps tighter than a virgin pussy Illmatic in the Walkman, what?\n\nSitting on the subway they looking like \"who is that?\"\nThe boy gutter all hood New York sewer rat\nYou can never mace me, where Cuda at?\nThey love me out in Harlem like a ten dollar buddha sack\nI spit that Ill Street Blues, yeah Kool G Rap\nBut my style is big, where the Coogis at?\nI said my style is Big now light a L\nAs I skip to the next track on Supreme Clientele\nGhost to Manhattan, seat reclined in the Aston\nTom Ford glasses cause NY is into fashion\nMadison. Square. Garden. Feeling like Spike Lee's squares, Jordans\nYou squares ain't important\nFresh to death my gear's in a coffin\n*cough cough* Why that nigga coughin'?\nBlowing that sour diesel I ain't be here that often\n\nRiding on the A train, listening to Ghostface\nI'm just ridin on the A train, listenin to Ghostface\nRiding on the A train, listening to Ghostface\nI'm just riding on the A train, listening to Ghostface\n\nPull up in that Derrick Rose hop out number nines or elevens\nYou niggas is copycats, my style is patent leather\nSouth side of the Chi nigga I ain't packing never\nI ain't shy of the Chi, Jay Cutler in cold weather\nAnd all I do is win, 72 and 10\nBall like Mike, Scottie, Dennis Rodman and them\n7-4 Chevelle, niggas riding in them\nKillers from Cabrini-Green, I was riding with them\nPelle jackets niggas out here robbing in them\nAnd even getting coat-jacked ain't Common to him\nKeep thinking you Larry Hoover that line'll have you shook\nThat's that Crack Music nigga forgot I was on the hook\nG.D.s, Vice Lords, Four Corner Hustlers\nLatin Kings, MCs, all em will fuck with us\nBlowing trees like the windy city\nNigga I blow trees in the Windy City\n\nRiding on the L train, listening to Kanye\nI'm just riding on the L train, listening to Kanye\nI'm just riding in on the L train, listening to Kanye\nSaid I'm riding on the L train, listening to Kanye\n\nI be in Lil Haiti\nFirst forty eighty\nAin't nothing bout to go down nigga my fam's Zoe Pound\nAnd ever since they locked my nigga Zo down\nEverything slow down, but my nigga Ross is on\nThe homie Khaled put the Boss's on\nWe blowing orange like the Dolphins home\nAnd we don't floss the chrome\nWe turn that Wildcat offense on\nThat New Era fly off ya dome\nI'm about to take my talents to South Beach\nI don't even go to the games, but got Heat\nAin't no Trickin Daddy, I take a bitch to get some Cuban food\nHave a couple mojitos then fuck her like a Cuban do\nRiding down Collins in the newest coup\nFlo-Rida on the place, they think I'm Uncle Luke\nNigga Tony Montana, who the fuck is you?\nI'm the all-red side of the Rubik's Cube\n\nRiding in the fast lane, listening to Rozay\nI'm just ridin in the fast lane, listening to Rozay\nRiding in the fast lane, listening to Rozay\nI'm just riding in the fast lane, listening to Rozay", "image": "https://images.genius.com/c7e8ae0f47986bad415f5d58fc0b2281.320x320x1.jpg"}], "artist": "The Game"}