{"songs": [{"title": "It’s On", "album": "Unleashed & Unreleased Vol. 2", "year": "2002-01-01", "lyrics": "Ugh dmx\nClueminati\nIs y'all motherf**kers ready for the ruff ride!\nGrrrrr!\n\nWhen I speak I'm understood, my decision is wood\nSee what I'm able to see, (ugh) 'cause my vision is good\nIt's like I see through the eyes of a wise old man\nSo I chill, and when I can kill this guy's whole fam\nSomething better to be thought dumb and remain silent\nThen to open your mouth and remove all doubt 'cause if it came violent\nSee I'm gonna give it to you straight, so you don't ask anymore\nYou don't really want what you asking me for\nIt's a war (ugh), when it's on it's on, when I'm long (what)\nTill I'm gone and I ain't got long\nBut while I'm here, (ugh) y'all niggas gonna burn\nBe (? ) after this money (what) and y'all niggas gonna learn\nAll this f**king weak you've been talking about that driveby\nAnd ain't did nothing but drive by\nListen shorty I'm telling you this for your own good\n(uhh) everybody is the man in they own hood, for real\n\nYeah 'cause if it's on it's on\nBitch niggas keep frontin' then your ass is gone!!\nYeah 'cause if it's on it's on\nBitch niggas keep frontin' then your ass is gone!!\nYeah 'cause if it's on it's on\nBitch niggas keep frontin' then your ass is gone!!\nYeah 'cause if it's on it's on\nBitch niggas keep frontin' then your ass is gone!!\n\nI always keep my enemies the closest (uhh)\nAlways make sure I know where the toast is (uhh)\nAlways cover my tracks when I creep\nAlways get away when I'm done to relax to d\nI always know the rules of the game before I play\nAnd always keep enough dough to know I'm good for the day\nAlways walk my dogs off the leash and\nAlways get my thoughts off the streets and\nAlways will ever lend a hand in borrow\nAnd always no matter what plan for tomorrow\nI always pay my respects to the dead\nI always take at least one blunt to the head\n\nNow always know -- (cut off) is gonna end up getting f**ked\nAnd always know-- (cut off) is gonna end up getting stuck!\nI'm always strapped; I'm always cracked\nI've always rapped; it's always that\nAlways black\n\nYeah 'cause if it's on it's on\nBitch niggas keep frontin' then your ass is gone!!\n\nYeah 'cause if it's on it's on\nBitch niggas keep frontin' then your ass is gone!!\n\nYeah 'cause if it's on it's on\nBitch niggas keep frontin' then your ass is gone!!\n\nYeah 'cause if it's on it's on\nBitch niggas keep frontin' then your ass is gone!!\n\nNever try to knock off rock on the block that ain't yours\nNever take a man's life 'cause you hate yours\nNever become so involved with something that it blinds you\nNever forget where you from someone will remind you\nNever take for granted what's been given as a gift\nAnd never sleep on a nigga unless that nigga stiff\nNever turn your back on a nigga you don't trust\nNever turn your gat on a nigga and don't bust\nNever expect to get away with the same shit more than twice\nNever forget you could get it too for a price\nNever bring it to a nigga if you scared to die\nNever gonna do it -- if you scared to drive\nNever gonna be another day it gets dark\nNever get it -- here for the heart\nNever say never, 'cause I never thought, this never thought never\nEver caught better, getting cheddar, with doing better, dmx!\n\nYeah 'cause if it's on it's on\nBitch niggas keep frontin' then your ass is gone!!\n\nYeah 'cause if it's on it's on\nBitch niggas keep frontin' then your ass is gone!!\n\nYeah 'cause if it's on it's on\nBitch niggas keep frontin' then your ass is gone!!\n\nYeah 'cause if it's on it's on\nBitch niggas keep frontin' then your ass is gone!!\n\nUhh dmx\nClueminati\n9-8\nRuff ryder's\nMotherf**ker\nYa'll niggas don't know, how it's gonna go, for real (uhh!)\nIt's dark & hell is hot\nY-o motherf**ker\nSchool street\nHome of the brave we all here baby\nMundo! telemundo!\nWhat!", "image": "https://images.rapgenius.com/1434e8ee824f41e765821605650b321b.500x366x1.jpg"}], "artist": "DMX"}