{"songs": [{"title": "Used To", "album": "If You’re Reading This It’s Too Late", "year": "2015-02-13", "lyrics": "[Produced by WondaGurl]\n\n[Intro 1: RiFF RAFF]\nBoys, now listen, we got more motherfuckin' TV screens\nOn the outside the damn tour bus than on that motherfucker\nBoys playin' Playstation\nWe come through motherfuckin' hang gliding\nOff motherfuckin' Versace skyscrapers\nI don't get it, what more can you ask for?\n\n[Intro 2: Drake]\nYeah—sound, sound, sound\nYeah, real 6 side shit\nSickos, ah man\n\n[Verse 1: Drake]\nYeah, when you get to where I'm at\nYou gotta remind 'em where the fuck you at\nEvery time they talkin', it's behind your back\nGotta learn to line 'em up and then attack\nThey gon' say your name on them airwaves\nThey gon' hit you up right after like it's only rap\nJewels look like I found a motherfuckin' treasure map\nAnd ain't told no one where the fuck it's at\nShout out to the G's from the ends\nWe don't love no girls from the ends\nI'm gon hit 'em with the wham once again\nI'ma always end up as a man in the end, dog\nIt's just apparent every year\nOnly see the truth when I'm staring in the mirror\nLookin' at myself like, there it is there\nYeah, like there it is there man, whoo!\nI ain't tryna chance it, I be with the bands\nLike a nigga went to Jackson State or Grambling\nYoung Nick Cannon with the snare drum, dancin'\nWatch the way I handle it, uh\nBring it to the bedroom, you know that shit is candle lit\nShe know I'm the man with it, uh\nWith the bands like I must've went to Clark, went to Hampton\nI ain't playin' with it\n\n[Chorus: Drake]\nI ain't felt the pressure in a little while\nIt's gonna take some getting used to (what you say?)\nFloatin' all through the city with the windows down\nPuttin' on like I used to (what you say?)\nThey never told me when you get the crown\nIt's gon' take some getting used to (what you say?)\nNew friends all in their old feelings now\nThey don't love you like they used to, man\n\n[Verse 2: Drake]\nWay more gully gully than buddy buddy\nNever needed your acceptance, never needed nothin'\nY'all don't understand, I'm the one they want to hear from\nY'all don't understand that it's me or nothin'\nYeah, I'm fuckin' glowin' up\nShaq postin' up on niggas that I used to have posters of\nReal quick, man, you couldn't have hated that\nLet's be real, nigga, you couldn't have made it that, woo!\nDance how I dance, watch me dance\nYou're fuckin' with the best, man, I'm too advanced\nAfter this drop I got new demands\nCan't meet the terms, keep it movin' then\nMake sure the plane got a phone now\nSo when we 'bout to land I can call to tell the woes I'm home now\nI'll tell 'em link up at the valet at the Hazy\nThink I got the shit that had the city going crazy\n\n[Chorus: Drake]\nI ain't felt the pressure in a little while\nIt's gonna take some getting used to\nFloatin' all through the city with the windows down\nPuttin' on like I used to\nThey never told me when you get the crown\nIt's gon' take some getting used to\nNew friends all in their old feelings now\nThey don't love you like they used to, man\n\n[Verse 3: Lil Wayne]\nWhen you get to where the fuck I'm at\nYou gotta remind 'em about where you been\nAbout all of the money that done came and went\nAbout the two cents I ain't never spent\nWhen they say you're too famous to pack a gat\nI gotta remind 'em about where I'm from\nNot about where I'm going, about where I've gone\nStepping on a Swisher roach like a stepping stone\nGoin' at a nigga throat like a herringbone\nBoy, do I smell beef? Mmmm, pheromones\nGot a fuckin' halo over my devil horns\nTrap pumpin' all night like Chevron\nSuck a nigga dick for a iPhone 6\nFuck my nigga Terry for a new Blackberry\nYou can get buried for a ounce of Katy Perry\nI was only five, but still remember the drought in '87\nLord, tell 'em bitches I ain't got no times to play games with 'em\nI ain't got no time\nTell her that I love her and I hate her in the same sentence\nI'm fuckin' her mind\nI got, mind control over Deebo\nParmesan my panino\nPromethazine over pinot\nAnd when my bloods start shootin' that's B-roll, bitch\n\n[Chorus: Drake & Lil Wayne]\nI ain't felt the pressure in a little while\nIt's gonna take some getting used to\nFloatin' all through the city with the windows down\nPuttin' on like I used to\nThey never told me when you get the crown\nIt's gon' take some getting used to\nNew friends all in their old feelings now\nThey don't love you like they used to, man\n\n[Outro: RiFF RAFF]\nLet's just let bygones be bygones, okay?\nLet's just go ahead and just let bygones be bygones\nI pull up lookin' like a damn cyborg, weighin' 224\nOh man, these boys don't even understand\nListen when you see OVO Jodi pull up on the scene with Drake\nFor goodness sakes, well for goodness sakes\nYou see this mixtape you listenin' to? This an album\nYea, we could have, we could have sold it to you for 17.99\nOr 29.99 with the shirt, buy it at the Target\nThese motherfuckers trippin' so hard I had to look down and double check cause I thought they had their shoes tied together—motherfuckers got they shoes tied together\nWhat more could you ask for?\nBoys harassing me with these questions\nHow about this? How about don't ask me no more motherfucking questions? We ain't doing no interview!", "image": "https://images.rapgenius.com/44d39b851f2206191171087994719e62.1000x1000x1.jpg"}], "artist": "Drake"}