{"songs": [{"title": "High Expectations", "album": "Soul in the Hole  (Original Music From and Inspired by the Motion Picture)", "year": null, "lyrics": "[Intro]\nCome on, let's get started.  Don't listen to that street talk.  That street talk is dead.  Don't be talking about no drugs and no popped Uzis around here.  If you ain't got no basketball in your hand and wanna shoot it out, you gotta go somewhere else\n\n[Hook: Sample from Chaka Khan's \"Move Me No Mountain\"] (x2)\nI don't expect you to be something you're not\nAll I expect you to give is all you got\n\n[Verse 1: Common]\nYo, yo, check it\nUnattached and calm, sundaes and pills I palm\nWith intentions to make it to the league\nIntrigued by two-letter cars, SE's and GS'ses\nOn the court, niggas I leave like messages\nPlagued by this ball-player exorcist\nIt's sort of foul how the world be reffin' us\nKenny is our Moses in this five-on-five Exodus\nFor the game of life, full courts ain't preppin' us\nSchools want me, but the ghost of Manigault haunts me\nPlus they wanna crib me, way out in the country\nI'm city like street lights and some games that be fights\nNever worked on my left so it's hard to be right\nEither rich, poor, or Mike is who I wanna be like\nStory of many black males that I refuse to rewrite\n\n[Hook: Sample from Chaka Khan's \"Move Me No Mountain\"] (x2)\nI don't expect you to be something you're not\nAll I expect you to give is all you got\n\n[Verse 2: Common]\nYo, brothers opinions is Bias-ed, like Len\nThat I'll end up like Ben... Wilson—still, some pretend to be friends\nBeneath the grin, I see the jinn spoke of in the Surah\nMore so than my soul, my jumper is purer\nPeople play juror.  I witness the fall of legends\nOnce was the joint—now they resin.  Got a God-given present\nMy gallant talent is like a magic\nTrick turned by a chick with a bad habit\nOpportunity to move, I grab it\nMe and my moms had static.  Now I reek Hennessy and havoc\nMan to man talks with Kenny send me to a zone\nBeen on my own for so long, my vocal tone's grown\nCompetition gets blown like speakers\nWhen I cross her like Jesus out of bleachers, broads, and beepers\nYeah I boogey it's all good, but it could be better\nWant to stay eighteen forever\nBut now I stay on point like Rod in this Strickland\nIf Brooklyn courts was a campus, then I would be the big man\n\n[Hook: Sample from Chaka Khan's \"Move Me No Mountain\"] (x2)\nI don't expect you to be something you're not\nAll I expect you to give is all you got\n\n[Verse 3: Common]\nFrom thoughts that pennies bring, I assemble teams like the Kenny Kings\nThink fast over breaks, dialect I'm dribbling\nRemembering night posters of Moses and the Supreme Court\nRealizing that rap and life are team sports\nI follow these thoughts\nMoves never receive thought, lyrical Johnny Cochran\nCause of the way I free thought\nThe system make a nigga think to make it that he need sports\nOr either to the tip he gotta resort\nMy seed'll be taught to start his own in the George Carter zone\nDon't wanna be a dope MC living in his momma's home\nOr speaking to my fans in a starving artist tone\nUnknown zones I roam with mind architecture\nSpark the lecture, emphasizing: let God direct ya\n\n[Hook: Sample from Chaka Khan's \"Move Me No Mountain\"] (x4)\nI don't expect you to be something you're not\nAll I expect you to give is all you got", "image": "https://images.genius.com/10e89d24f6cb5508365c94bb617b264f.500x499x1.jpg"}], "artist": "Common"}