{"songs": [{"title": "What Do You Got", "album": null, "year": null, "lyrics": "[Hook: Eminem]\nBig and some Pac and you mix them up in a pot\nMix them up in a pot, mix them up in a pot\nTake some Big and some Pac and mix them up in a pot\nMix them up in a pot, what the fuck do you got?\nFifty!\nBig and, Big and some Pac and you mix them up in a pot\nMix them up in a pot, mix them up in a pot\nIt's Big and some pac and you mix em up and you got\nJuggernauts of this rap shit, like it or not\n\n[Verse 1: 50 Cent]\nI got a gambling problem\nI bet you niggas I'mma be back bustin'\nBut you won't notice me when that gat dumpin', you wan' bet?\nI lost money when I bet on Roy\nWon money when I bet on Floyd, I'm the one that bet on boy\nUndefeated, eyes low like I'm weeded\nI bet you niggas think I won't be number one again\nI raise the stakes, you know why I put mo' on the line\nIt's showtime I'm goin' for my mine, you can bet that\nI bet that tech jam before that mac\nI bet that dope go before that crack, I bet my money stack\nI bet yo bitch wanna roll with 50\nI bet if I said I'm going to the hotel she'd go with me\nI bet you really love her man you think she wouldn't come\nShe got your pussy wooped, her head game, it got you sprung\nI'm taking all bets, through all sets I be a bookie\nThat have to be ten percent off the top, fucking rookies\n\n[Hook: Eminem]\nBig and some Pac and you mix them up in a pot\nMix them up in a pot, mix them up in a pot\nTake some Big and some Pac and mix them up in a pot\nMix them up in a pot, what the fuck do you got?\nFifty!\nBig and, Big and some Pac and you mix them up in a pot\nMix them up in a pot, mix them up in a pot\nIt's Big and some pac and you mix em up and you got\nJuggernauts of this rap shit, like it or not\n\n[Outro: 50 Cent]\nFifty! (fifty!) Ohhhh! (Ohhh)\nI wanna bet y'all niggas, it ain't gon' be\nThe old niggas like me!\nTrust me, I came up hard! (came up hard!)\nAll you gotta do is go through my hood\nSouthside, niggas like me all up and down there\nOn the corners, in the penitentiary, they from southside\nYeah, they ain't on the top of the charts\nThey don't know the formula, they ain't on the hot 500\nThey like me!\n\n[Hook: Eminem]\nBig and some Pac and you mix them up in a pot\nMix them up in a pot, mix them up in a pot\nTake some Big and some Pac and mix them up in a pot\nMix them up in a pot, what the fuck do you got?\nFifty!\nBig and, Big and some Pac and you mix them up in a pot\nMix them up in a pot, mix them up in a pot\nIt's Big and some pac and you mix em up and you got\nJuggernauts of this rap shit, like it or not", "image": "https://images.genius.com/f3c99ff99403476b718809cdc24d0e10.953x953x1.jpg"}], "artist": "50 Cent"}