{"songs": [{"title": "Soldier", "album": "Who Got Game?", "year": "2005-11-26", "lyrics": "[Intro]\nYo Mal, they tried to kill me man\nFive shots and I'm still here nigga, hahaha\n\n[Hook]\nI don't give a fuck where you niggas from\nEast to West coast I'mma bang my gun\nYou better wear a vest when you come outside\n'Cause nigga this's Westside 'til I die\nI'm a motherfuckin' Soldier nigga\nI'm a soldier nigga\nI'm a motherfuckin' soldier nigga\nI'm a soldier nigga\n\n[Verse 1]\n\"He signed with Dre, he gon' sell\nWill he do a mill plus or will he end up in jail?\"\nGet real close to the speaker, I got a story to tell\nHe went from the front porch to the cover of double X-L\nI took one in the heart, I'm ready to die\nAnd all this hennesey will make a nigga crash the G5\nCatch me at a stop sign nigga I ain't drunk\nI'm gangsta I pop mine and leave you eyeing the pump\nTie your faggot ass up let you die in the trunk\nI'm from Westside Compton nigga I ain't a punk\nStreets is talkin', Is he from Cali? is he from Queens?\nDo he ghost for P. Diddy, can he write me a sixteen?\nDid he take 5 shots? is he a blood or a crip?\nRidin' through the CPT my hood painted on the bricks\nAnd I'mma die with a empty clip, 'cause I'm a ghetto boy\nI just rap a lot like J-Prince\n\n[Hook]\nI don't give a fuck where you niggas from\nEast to West coast I'mma bang my gun\nYou better wear a vest when you come outside\n'Cause nigga this's Westside 'til I die\nI'm a motherfuckin' Soldier nigga\nI'm a soldier nigga\nI'm a motherfuckin' soldier nigga\nI'm a soldier nigga\n\n[Verse 2]\nIn '99 I studied The Chronic inside out\nAte Doggystyle for breakfast, lunch was Reasonable Doubt\nI ain't know how to count bars, I was writin' on napkins\nHigh as fuck I wrote my first sixteen to Illmatic\nI was in the hood fightin' with niggas, over who the best MC\nIce-Cube, Snoop Dogg or Xzibit (Pac, and Pac)\nAnd how the East been makin' a killin'\nSince them Long Beach niggas walked in New York and crushed the buildings\nThen this Marcy Project nigga came and stole the crown\nRight after the king of N.Y. had got shot down\nTen years later I'm in Harlem killin' them mixtapes\nThey like me, I want 'em to love me like they love Ma$e\nBut holla in L.A them niggas'll tell ya they hate me\nAnd the plan is to catch me with my gun on safety\nNigga I'm still breathin', I ain't dead\nNext time you try to kill me put one in my head\n\n[Hook]\nI don't give a fuck where you niggas from\nEast to West coast I'mma bang my gun\nYou better wear a vest when you come outside\n'Cause nigga this's Westside 'til I die\nI'm a motherfuckin' Soldier nigga\nI'm a soldier nigga\nI'm a motherfuckin' soldier nigga\nI'm a soldier nigga\n\n[Verse 3]\nBefore Jimmy Iovine the kid was in IVs\nThese bitch niggas tried to take my life for five Gs\nI was in the projects, two o'clock in the mornin'\nPlayin' Madden, niggas kicked in the door and start blastin'\nNigga I'm a gangsta, I don't need no pity\nI just sit inside the Ferarri and roll up a philly\nAnd I been compared to Shyne like Shyne was compared to Biggie\nI'm from Compton he from New York City\nCome on really you gotta be kiddin'\nAin't nobody Biggie but Biggie\nBut I'm a six figi niggie, and I know Fifty\nBut that don't mean I can get you backstage at awards\nOr cause you went to highschool I'mma take you on tour\n'Cause he got two bodyguards he can't get hit with the four\nAnd 'cause he wear a vest don't make him 2Pac Shakur\nWhen you see me in the streets, ain't no security guards\nNo L.A.P.D, no bullet proof cars, I'm a gangsta!\n\n[Hook]\nI don't give a fuck where you niggas from\nEast to West coast I'mma bang my gun\nYou better wear a vest when you come outside\n'Cause nigga this's Westside 'til I die\nI'm a motherfuckin' Soldier nigga\nI'm a soldier nigga\nI'm a motherfuckin' soldier nigga\nI'm a soldier nigga", "image": "https://images.genius.com/971e1e3ecea4681ccdb2f77d8054c762.345x345x1.jpg"}], "artist": "The Game"}