{"songs": [{"title": "Sherane a.k.a Master Splinter’s Daughter", "album": "good kid, m.A.A.d city (Deluxe Version)", "year": "2012-10-22", "lyrics": "[Produced by Tha Bizness]\n\n[Intro]\nLord God, I come to you a sinner\nAnd I humbly repent for my sins\nI believe that Jesus is Lord\nI believe that you raised him from the dead\nI will ask that Jesus will come to my life\nAnd be my Lord and Savior\nI receive Jesus to take control of my life\nAnd that I may live for him from this day forth\nThank you, Lord Jesus, for saving me with your precious blood\nIn Jesus' name, Amen\n\n[Verse 1]\nI met her at this house party on El Segundo and Central\nShe had the credentials of strippers in Atlanta\nAss came with a hump, from the jump she was a camel\nI want to ride like Arabians, push an '04 Mercedes-Benz\n\"Hello, my name is Kendrick,\" she said \"No, you're handsome.\"\nWhispered in my ear, disappeared, then found her dancin'\nCiara had played in the background\nThe parade music we made had us all wearin' shades now\n\"Cool, where you stay?\"\nShe said: \"Down the street from Dominguez High\"\nOkay, I know that's borderline Compton or Paramount\n\"Well, is it Compton?\" – \"No,\" she replied\nAnd quickly start battin' her eyes\nAnd strictly had wanted her thighs around me\nSeventeen, with nothin' but pussy stuck on my mental\nMy motive was rather sinful\n\"What you tryin' to get into?\"\nShe didn't tell, just gave me her Nextel\nDropped the number, we chirped the whole summer, and well\n\n[Verse 2]\nThe summer had passed, and now I'm likin' her\nConversation we havin' probably enticin' her\nWho could imagine? Maybe my actions will end up wifin' her\nLove or lust, regardless we'll fuck, 'cause the trife in us\nIt's deep-rooted, the music of bein' young and dumb\nIs never muted; in fact, it's much louder where I'm from\nWe know a lot 'bout each other, her mother was a crack addict\nShe live with her granny and her younger two brothers\nHer favorite cousin Demetrius's irrepetible\nFamily history of gang bangin' did make me skeptical\nBut not enough to stop me from gettin' a nut\n\"I wanna come over, what's up?\"\nThat's what I told her soon as this episode\nOf Martin go off, I'm tryin' to get off\nI was in heat like a cactus, my tactics of bein' thirsty\nProbably could hurt me, but fuck it, I got some heart\nGrab my momma's keys, hopped in the car, then, oh boy\n\n[Verse 3]\nSo now I'm down Rosecrans in a Caravan\nPassin' Alameda, my gas meter in need of a pump\nI got enough to get me through the traffic jam\nAt least I hope 'cause my pockets broke as a promise, man\nI'm thinkin' about that sex, thinkin' about her thighs\nOr maybe kissin' on her neck, or maybe what position's next\nSent a picture of her titties blowin' up my texts\nI looked at 'em and almost ran my front bumper into Corvette\nEnthused by the touch of a woman, she's a masseuse\nAnd I'm a professional porn star when off the Goose\nI had a fifth in the trunk like Curtis Jackson for ransom\nI'm hopin' to get her loose like an Uncle Luke Anthem\nI'm two blocks away, 250 feet\nAnd six steps from where she stay, she wavin' me 'cross the street\nI pulled up, a smile on my face, and then I see\nTwo niggas, two black hoodies, I froze as my phone rang\n\n[Outro]\nPlease leave your message for 323-\nRecord your message after the tone\nKendrick, where you at?\nDamn! I'm sittin' here waitin' on my van\nYou told me you was gon' be back in fifteen minutes!\nI gotta go to the county buildin', man\nThese kids ready to eat! I’m ready to eat, shit\nI gotta get them food stamps, come on now\nYou on you way or what?\nI hope you ain’t out there messin' with them damn hood-rats out there, shit, especially that crazy-ass girl Sherane\nPlus you got school tomorrow\nYou keep fuckin' around in them streets, you ain’t gon' pass to the next grade, 11th grade\n(Is that Kendrick on the phone?)\nYo' daddy hollerin' about some damn dominoes\nHe want to holler at you too\nGo 'head, Kenny, go! Shit\n(Hello? Yeah, where my motherfuckin' dominoes at?)\nKenny! (What?) You on his voicemail! Damn fool (Oh) Shit!\n(K, where my motherfuckin' dominoes at?\nThis the second time I ask you to bring my fuckin' dominoes!)\nKenny, give me the damn phone, shit. Don’t hang up! Damn!\n(Keep losin' my goddamn dominoes, we gon' have to go in the backyard and squab, homie)\nJust let me—Kendrick\nWhen you get this message, man, call me back\nI need to know when you gon' bring back my damn car\nThis man fussin' about some damn dominoes\nIt ain’t all that serious, fuck, damn dominoes\nShit, I'ma miss my damn appointment! Fuck!\nFuck them damn dominoes, nobody wanna hear that\nNobody wanna hear yo' ass!\nMatter of fact, cut my motherfuckin' oldies back on\nYou killin' my motherfuckin' vibe", "image": "https://images.genius.com/b386cd0530f6f348b478eba2927b0f91.1000x1000x1.jpg"}], "artist": "Kendrick Lamar"}