{"songs": [{"title": "Negative Ego", "album": "LFO’s (Low Frequency Oscillators)", "year": "2013-10-03", "lyrics": "[Verse 1]\nOk my momma said I'm fuckin' up\nMy daddy say I'm negative\nAnd my grandma said my head is big\nAnd my doc said I need medicine\nAnd my uncle say I'm selfish\nAnd my auntie say I'm helpless\nAnd my cousin said let's fuck bitches and get money and sell bricks\nAnd my teacher said I'm a failure\nAnd I ain't never gon be shit\nImma live fast and die young when that time comes Imma sleep quick\nAnd my girl told me you're never there and I never cared bout nothing else\nYou don't love me, you love yourself I told the bitch you something else\nYou, you something else, something else unusual\nAnd I'm sorry girl you're beautiful and I'm not the man you used to know I'm\nSo different now, real different now, just hear me out\nI just wanna get rich and die tryin'. If not, then I die hoping\nI'm waking up with my eyes closed, go to sleep with my eyes open\nFour friends in my Tahoe realizing I'm not focused\nI place hands on that Bible and promised God that I stop smoking\nThe yacht open, my block holdin' them shots open them too\nThere's three sides of a story inside my side of the truth\nYou can see it in my eyes I guess time flies when it's you\nNiggas need me in they top 5 and that's top 5 of my crew\nSo fuck a paystub and that work life\n9 to 5 that's your life\nTake it slow, I heard fast relationships don't work right\nI'm Joyner Lucas you heard right\nMost niggas gon hear wrong and it's funny cause they cheer on and they probably won't be here long, nah\nThat's far as I need to get\nCops talking they need the tip\nI don't know I plead the fifth\nI need to sip Henny shots, every smoke get high to def\nI'm tripping on my ego, well this the negative side effects, so\n\n[Chorus]\nNow everybody wave your motherfucking hands, huh?\nYou living in hell, living in fear, huh?\nWe living in jail, living in pent, huh?\nThe Devil himself, tryna get in, huh?\nWe living in hell, living in fear, huh?\n\n[Bridge]\nOk my momma said I'm fuckin' up\nMy daddy said I'm negative\nAnd my grandma said my head is big\nAnd ain't that some shit\n\n[Verse 2]\nShit, I never had no enemies, remember me?\nYoung nigga, that pretty boy with a new name\nTattoos and 2 chains like Tity Boi no loose change\nDogs walking on two legs\nWeird niggas, I'm here, listen my ambition like Cool J\nSo don't call it no comeback\nFeeling like Big Pun back\nYou ain't shooting, you pussy niggas, so bitch give me my gun back\nScared of noise like, \"What's that?\"\nI'm a Bad Boy where Puff at?\nAnd everything you say you did I pretty much don done that (Whoo!)\nAt high school I was tripping hard\nSkipping class, up in the hall\nStealing clothes all in the mall, and fighting niggas, I did it all\nSelling crack in rental cars\nMy heart told me you sinning hard\nI went to church the pastor told me, \"What the fuck is you living for?\"\nAnd that's as real as I need to get\nMy girl asked if I cheated on her, I don't know I plead the fifth\nI need to sip Henny shots, if you smoke get high to def\nI'm tripping on my ego and this the negative side effects, so\n\n[Chorus]\nNow everybody wave your motherfucking hands, huh?\nYou living in hell, living in fear, huh?\nWe living in jail, living in pent, huh?\nThe Devil himself, tryna get in, huh?\nWe living in hell, living in fear, huh?\n\n[Bridge]\nOk my momma said I'm fuckin' up\nMy daddy say I'm negative\nAnd my grandma said my head is big\nAnd my doc said I need medicine\nAnd ain't that some shit", "image": "https://images.genius.com/af3af66c40d283e3ae3bb9b03af33c02.600x600x1.jpg"}], "artist": "Joyner Lucas"}