{"songs": [{"title": "Somethin’ To See", "album": "Bad Season", "year": "2010-12-23", "lyrics": "[Hook - Kaliko]\nWhen I was young I used to wonder, why you lookin at me?\nCause I'm gifted I'm different, I still ask why? why you staring at me?\nCause I'm something to see. ok, ok, now why?\nWhy you looking at me? cause I'm a wierdo, still though ill flow, and so\nWhy you staring at me? cause I'm something to see\n\n[Tech]\nThey didn't stare much, before I fucked my hair up\nIn 11th grade, when I had bare nuts\nAnd the principal told me to get a haircut\nCause I was distractin kids, but when a nigga was rappin\nChumps would flare up\nCause I was dope and plus a sight to see\nMighty twice exciting, the night sky thing, with dykes inticing\nA sight, just the mic and me\nI bring nice things when I write the fightings, igniting\nWhen a nigga wanna get up in the face of the spikes and see\nCause I'm diff-erant diff-erant, trippin is what this nigga want\nThis is when pistols get to clickin\nThe sick one hit the dump\nOn suckas I bring the chrome rukus\nWhen I go, yeah I'm back niggas on track making stacks, fat figures\nEven though strangers rap, we still cap pillaz\nI'm miraculous, such an activist, I blast a bitch and cause disaster\nIf I'm deffinatly trip I'm smashing in shit\n\n[Hook]\n\n[Kaliko]\nHeart throb, never, black and ugly as ever\nBlack and shiny like pattent leather\nHowever, I stay gucci down to the boots\nThe booth is the only place I feel I got to tell the truth\nOk\nIts like a gift and a curse\nMe and people get funny looks from them first, then their women\nWhen I'm traveling get the dip on their turf\nSee what I'm working with then dip in their skirt\nIma bend em\nThey used to shake me off like I was dandruff\nNow they want me in the middle, like the meat on their sandwich\nMr. two-tone, famous now that you grown, mr. getting to big for the city now that you blown\nUsed to look at me like I was putting on a side show\nNow they know vitiligo, in every city I go\nStill the funny lookin fat kid on the inside\nThe difference is now a niggas world wide\n\n[Hook]\n\n[Phenom]\nWhy do they stop and stare?\nHelling to oh me\nI'm still the same ole playa, that's all that I can be\nCause when I ride through the hood these days\nNiggas don't feel the same, cause when you turn your radio on\nYour prolly gunna hear my name\n\nTell your bitch to pick her jaw off the floor\nShorty been gawkin and starin and all since I walked in\nIts prolly gunna be causin a problem\nA nigga been watchin and jockin hard and licking her chops\nAnd shes looking at me like a piece of meat shes fittin devour\nNow I'm a sensible fella, never have I been a sucka\nThat's why I'm gone kick the bucket, before a ho game I trust\nBecause all the same hoes who ain't ever paid me no nevermind\nIs all trying to perform a horizontal grind in this bed of mine\nCause they know I'm from another time, I'm ahead of mine\nAnd I'm fittin to blow off all the rhyms from this head of mine\nAnother nigga ill as me, please you will never find\nSomeone on my level I'm not yet even in my prime\nUhh, they used to act like they never seen me\nNow the same haters looking at me like they never seen me\nYeah and if your girlfriend ain't never seen me\nBetter handcuff her might dead her if you let her see me\nPhenom!", "image": "https://images.genius.com/0fb56636df878a9df9d4417d6e65d406.1000x1000x1.jpg"}], "artist": "Tech N9ne"}