{"songs": [{"title": "Dope Dealers", "album": "Odd Future Unreleased Volume 1 ", "year": "2011-10-16", "lyrics": "[Verse 1: Tyler, the Creator]\nTeenage billionaires\nHe's beating records off the top the holes of money\nHe roll rover sell base for 12 a pop\nHodgy eating rapers whole, never digest I'm dope\nShit since they coming out of him like crack heads\nLike fuck I should be illegal eagles flying over state\nAnd the model bitch\n(She look good)\nAnd the head is great\nThe Pink stripe is for diplomatic immunity\nI'm A-C-E-A-K to fuck up the community\n(Holla holla holla, Spit another one real quick)\nNiggas Stez biting like they Mike Tyson\nHere these queers taking credit like their\nFaggot card is debit fines hit me on my beepa\nCould be on the keys then I push it out sneaka bitch\nI'm bunny like the Basket-baller\n[Ya]\nI'm the dope dealer push man in the dream state\nYour bitch sticks to me like purple schotch tape\n[I'm lime green]\nThe Pink stripe is for diplomatic immunity\nI'm A.C.E. aka Mr. Fuck Up the Community\n\n[Verse 2: Blak tha Map]\nI don't serve much but let me take your order\nGuaranteed to get your chips while I gallop aforda\nFlip a check quick like we betting with quarters\nAnd I beat the cut like we talkin' 'bout horfa\nEspecially if she looks like canorfa\nI not saying I would never do more than ork her\nI'm just saying I would do never divorce her\nBut I don't know if I could afford her\nBut J.K. cause Ima I'm ballin'\nIf life was a chip then hommie I'm all in\nYesterday's money was talkin'\nYes the shit was callin'\nTelling me to take over the world\nLike a young Jospeh Stallin\nDirty dog records beating all the pussies\nNever shopping unless were talking bout diamonds and stussy\nYo I'm probably with your chick\nPlaying with her cliteris\nYep\nHer friend is coming for a lick\nLook I'm not your father don't even bother\nI pulled out early", "image": "https://images.genius.com/e8d6a379d9f9cf188e3324cf11ca5754.630x630x1.jpg"}], "artist": "Tyler, The Creator"}