{"songs": [{"title": "Buckingham Palace", "album": "The Lost Tapes", "year": "2018-09-07", "lyrics": "[Verse 1: Ghostface Killah]\nHunnid Gs\nBone crusher, I'm like the hood's top celebrity\nLong dick ya chick like my rap's longevity\nColder than a glass of ice cubes\nI got 'em all in bad moods, stompin' on shoes, I never lose\nI don't give a fuck about how you're feelin'\nGot the roof on fire, legs to the ceilin'\nSexual healin', we throw on that Marvin Gaye shit\nGot two black burners, that'll melt your facelift\nMemory foam muffle the sound of the gun blast\nMy clan bring heat like the summer, check the forecast\nWe kamikazes, microphone aeronautics\nWe bounce off promoters like West Coast hydraulics\nNarcotics, we keep a stash in the gun box\nRight near the mask and the wig are the fake dreadlocks\nBumboclaat, box of ammo in the pocket\nIt's all fun and games 'til your eye's hangin' out your socket\n\n[Chorus: Ghostface Killah]\nWatch how you're talkin' to my goons, it's guerillas\nShooters, ruthless, all types of killers\nHunger Game shit, they're fightin' for block space\nBox cutters, Gem Stars'll ox your face\nWatch how you're talkin' to my goons, it's guerillas\nShooters, ruthless, all types of killers\nHunger Game shit, they're fightin' for block space\nBox cutters, Gem Stars'll ox your face\n\n[Verse 2: 38 Spesh & B.E.N.N.Y. The Butcher]\nHey yo, I got a problem with authority\nLawyers handle problems accordingly\nThey actin' like they pops wasn't callin' me\nI gotta make sure my corner eat\nOver the stove pot leaned to the side like I'm pourin' tea\nBlack man in a foreign V, emblem on the door and seats\nEither you a hustler or a thief\nAll I needed was a quarter ki'\nIn the corner, me and my dawg regulated like Warren G\nSold it hot, but I bought it cheap\nGot it from Miami back to P.A. like Ross and Meek\nHuh, borrowed your bitch for a week\nShe hold my guns and bricks, I give her dick for a storage fee\nYou talk slick, but can't afford to be\nAnd we don't call it beef until I'm sendin' hits where your daughters be\nStep on work with foreign sneaks\nEverything foreign so my bitch look like Kimora Lee\n\n[Chorus: Ghostface Killah]\nWatch how you're talkin' to my goons, it's guerillas\nShooters, ruthless, all types of killers\nHunger Game shit, they're fightin' for block space\nBox cutters, Gem Stars'll ox your face\nWatch how you're talkin' to my goons, it's guerillas\nShooters, ruthless, all types of killers\nHunger Game shit, they're fightin' for block space\nBox cutters, Gem Stars'll ox your face\n\n[Verse 3: KXNG CROOKED]\nYeah, bandana tied around the nozzle, pop pop!\nThe nozzle is the nostril of the Roscoe, pop pop!\nPossibly I'm comin' across as hostile\nYou could be double-crossed by your apostle, that's the Pentecostal gospel\nBlack C.O.B. flag hangin' out the left side\nBlowin' in the atmosphere, the atlas here is Westside\nRan up in the stash spot when I heard my connect died\nHis wife is Columbian, got Columbian neck tied\nI went from roaches in the cereal to flowin' the most ferocious in your stereo\nBut culture vultures don't hear me though\nHotter than diseases that overdose the venereal\nWhile bitches out here with a burnin' bush like the Moses miracle\nWhy the fuck would I touch a thot with some gonorrhea?\nI give her the hammer, I call it a blammer, that's onomatopoeia\nGo look it up, you don't read books enough\nThat's why Crooked's up in your Mamma Mia, I'm a G, nigga\n(I'm a G, nigga)", "image": "https://images.genius.com/204dd96189300279dc946cf80f4c5d8b.750x750x1.jpg"}], "artist": "Ghostface Killah"}