{"songs": [{"title": "My Language", "album": "The Language of My World", "year": "2005-10-10", "lyrics": "[Hook 1: Many Voices]\nThis is my language\nThis is my language\nThis is my language\nThis is my language\nThis is my language\nThis is my language\nThis is my language\nThis is my language\nThis is my language\nThis is my language\nThis is my language\nThis is my language\nThis is my language\nThis is my language\nThis is my language\nThis is my language\nThis is my language\n\n[Intro: Macklemore]\nCheck it out, yeah\n\n[Verse 1: Macklemore]\nThe risk of blunderin' to rap in front of a couple a hundred kids knowin' my licks is humblin'\nSpit the struggle of an addict to puff in them swisher split but the light that was lit, I quickly run from it\nI turn away from that source inside\nA slicker for happiness, thinkin' I need a store to buy it\nRecordin's priceless but look at how important ice is\nI thought rhyming was forever now it's imported diamonds\nMy point is eyein', music that's absorbed my life an'\nYou glorify guns, they bust sex and drugs of course they'll try it\nAnd I can't even front like I didn't, cause I still do and that's why I'm spittin'\nI'm lookin' for this thing called moderation that I heard some found\nThe only problem with drugs is sometime you gotta come down\nI lived half my life numb and bud drowned\nAnd rum, vodka, how many bucks have I spent on dubs now?\nI'm 23, look at my lungs now\nThe amount of THC from the swish of sweet blunt count?\nI can't even conceive, that's why I run wild\nIn these streets like I was 13, like fuck now\nI make that revolution music, but not for the army\nA reminder against the vices that harm me\nCause I could never see how affected my lung is\nYou only get one shot at life, no ad-libs or punch ins\n\n[Hook 2: Many Voices]\nThis is my language\nThis is my language\nThis is my language\nThis is my language\nThis is my language\nThis is my language\nThis is my language\nThis is my language\nThis is my language\nThis is my language\nThis is my language\nThis is my language\nThis is my language\n\n[Verse 2: Macklemore]\nNow, my mom once told me that we're not finished products, only\nAuthors of a book, and the object is to write it slowly\nThis is my last 16, I'll go for it\nFour years in college and this is all I have to show for it\nI said, this is my last song, so here's my passion\n18 tracks, each one an attempt to take my mask off\nWoo! The oral tradition's been passed on\nWhile she ride the rhythm to the points that I'm a blast off\nAnd as the music absorbs through\nMe to be like Don P. hearin' beats from my dorm room\nXP, It's been a joy and blessin'\nMy boy 'til my death and my Step-Cousin with voice from heaven\nYes, Budo! It was you who produced through\nI am connected and now our friendship is the truth, dude\nMy last two are for NuNu of course\nI dedicate it to you, but this album's already yours\n\n[Hook 3: Many Voices]\nThis is my language\nThis is my language\nThis is my language\nThis is my language\nThis is my language\nThis is my language\nThis is my language\nThis is my language\nThis is my language\nThis is my language\nThis is my language\nThis is my language\nThis is my language\nThis is my language\nThis is my language\nThis is my language\n(I wanna be an elk)\n(I wanna be an elk)\n\n[Outro: Macklemore]\nI'm proud to say this is my language\nI'm out\nThat's it\nThe Language of My World\n(This is my Language)\nIt's been a long journey, and a struggle indeed, and I'm so glad that it's over\nThank you for listening\nUntil next time, peace and blessings\nThis is my language", "image": "https://images.genius.com/a341d7269423ec87ff688b91d8b38e47.800x800x1.jpg"}], "artist": "Macklemore"}