{"songs": [{"title": "This One’s for Me", "album": "The Iceberg / Freedom of Speech... Just Watch What You Say", "year": "1989-10-10", "lyrics": "Yo yo whassup Ice man you look upset brother\nYo man, I got a lot of things on my mind man\nBut I don't know if I should put it on this record, yaknahmsayin?\nMan go ahead and kick it man\nLet the people know what's happenin man\nYou know brothers out there sellin out man\nWhy they goin out like that man?\nYo, sellin out like it ain't nothin man\nI ain't with it\n\n[Ice-T]\nDig it, I'm just a brother from L.A\nSouth Central, I live life the fly way\nUsed to bang and hustle but I traded for the big game\nInfamy got dumped for fame\nNow I'm known and respect as creator of the crime rhyme;\nBut my lyrics are deeper\nBecause I'm the one that makes you think before make a move\nI wrote \"Pusher\", \"High Rollers\", and \"Colors\" just to prove\nThat I could kick game, and drop knowledge at the same time\nBut one L.A. station wouldn't play my records one time\nI'm tryin to save my community\nBut these bourgeoise blacks keep on doggin me\nThey don't care about violence, drugs and gangs\nKJLH, you ain't about nuttin\nYou just a bunch of punk bourgeoise black suckers\nAnd this one's for me\n\nYou won't play no Public Enemy\nYou ain't playin no Boogie Down Productions\nYou ain't tryin to represent the black community\nYou just carin about your little ol' R&B +BULL+\nYou play all day and night\nI represent Los Angeles all over the United States\nAnd you ain't did NUTTIN for me\nThink about it\n\nHold up, I ain't finished on the diss tip\nThere's a few more punks that I got to rip\nAll you chump MC's who sell out quick\nWhen P.E. was on the top, you rode the tip\nBut now they got problems and you suckers run\nWho's Chuck's real friends, does he really have one?\nYou yell P.E. this, P.E. that\nFist in the air, proud to be black\nNow they got static and you run like punks\nI haven't heard an MC stand up for him once\nMaybe you suckers are just hopin that they fall off\nSo you can fill their shoes, nope sorry boss\nThat's what the matter with black people anyway\nWe ain't down with nothin, I don't care what you say\nYell or lie, don't even bother\nHow low will a brother go for a dollar?\nPublic Enemy broke a new rap age\nAnd now you rappers ain't got nuttin to say?\n\"Yo it's their problem\" \"Griff shouldn'ta said it\"\nE where's my pistol? (Yo I'll go get it)\nCause it's time for me to enforce some discipline\nAre you down or not, are you out or in?\nChuck Flav and Griff are my true friends\nI got their backs if it means my career ends\n\nAll you so-called down MC's with Public Enemy\nI ain't heard nobody out there, tryin to help my man out\nYouknowhatI'msayin? Griff is my man, I don't care WHAT he said\nYouknowhatI'msayin? And I ain't gon' let them go out like that\nYouknowhatI'msayin? Chuck, Ice got your back\nAnybody out there got problems with Public Enemy, come talk to me\n\nOnce again, I'm back in the diss mode\nI gotta speak my mind, it's time to unload\nOn this so-called government we've got\nIf I lied like them, I think I'd get shot\nThey sell drugs to kids and say it's us\nAnd when the cops are crooks, who can you trust?\nYou only see young brothers in a drug bust\nAshes to ashes, and dust to dust\nMy homey got a year for an ounce of weed\nWhile Bush sells weapons to the enemy\nYou gotta be stone blind not to see\n\"Our government is honest!\" Nigga, please\nCocaine can't be made in the United States\nKickin facts like this our government hates\nThe young kids on the streets ain't the enemy\nThey're just ghetto youth after money\nThey sell drugs, but who sells drugs to them?\nTry the C.I.A. my friend\nOr the F.B.I. or even Bush\nSomebody's gettin rich, damn sure ain't us\nWe're just killin ourselves while others laugh\nLook at the street, it's a cocaine bloodbath\nWe gotta realize dope is pure death\nMess with drugs, you're breathin your last breath\nSellin drugs is straight up genocide\nThey're gonna laugh, while we all die\n\nSittin up there thinkin you're makin that money\nHustlin and all that, you're killin your brothers\nYouknowhatI'msayin? You just stupid, straight up stupid\nPuttin dope into your body - c'mon, youknowhatI'msayin?\nYou gotta get somethin goin out there\nGet some brains, youknowhatI'msayin?\nWe are just playin ourselves cold out of the pocket\n\nThis one's for me, I make records for you\nBut this cut I straight out had to do\nThere's topics in my mind I have to break\nCause so many of you out there are so damn fake\nIf ya ain't know they're no-one, cutthroats\nBackstabbers, scheamin for banknotes\nAnd all of you out there know what I'm talkin bout\nIf you claim you're down then NEVER sell-out\nNever sell out, youknowhatI'msayin?\nYou gotta stay down for yours\nYou know I want it, sure as I'm Ice-T\nI make records for you, but this one's for me\n\nYou know what I'm talkin bout out there\nThere's ways to sell out left and right\nBut you ain't got to do that\nThere's things more important than money\nI'm talkin bout pride, I'm talkin bout dignity\nYou got it out there\nAll you got to do is stand on your own two feet\nDon't go out like no sucker\nStay down, youknowhatI'msayin?\nPeace", "image": "https://images.genius.com/8130dc496c2cedd8004532bb340c7c91.800x800x1.jpg"}], "artist": "Ice-T"}