{"songs": [{"title": "King Kong", "album": "Return of the Dozen Vol. 2", "year": "2011-04-12", "lyrics": "[Intro: Bizarre]\nYeah, D-Twizzie\nBack in the lab\nAyo, fire that weed up, pass it around\nKing Kong, bitch\nAll my niggas is gorillas\nFuck the other animals, nigga I’m the king of the jungle\nYeah, beware\n(King Kong, ain’t got shit on me!)\n\n[Verse 1: Bizarre]\nFourteen blunts, sixteen stobeys\nWho wanna get their jaw broke by Sugar Shane Mosley?\nBattle rapper, grew up in the cypher\nYou grew up a lover, I grew up a fighter\nI eat rappers, twenty times a day\nAll you can eat like Old Country Buffet\nRegular weed, I don’t even smoke\nHoes come over and get licked like a envelope\nI’ll smack your auntie, then kill your mother\nI just wanna fuck somebody up like Raz B brother\nMe, Von, and Swift, we like to commodores\nCome to a D12 party, we got all types of whores\nDon’t worry ‘bout hotel rooms, we got all types of floors\nAnd we’ll be smoking weed till a quarter past four\nSo run up, try actin’ crazy\nYou’ll get your back cracked but not by a Chinese lady\nBizarre, Eddy [?] from Oz, I got a lotta bars\nI’m King Kong bitch, but to you I’m God\n\n[Hook: Sample] (x2)\nKing Kong, ain’t got shit on me!\n\n[Verse 2: Kuniva]\nI have an attitude beyond belief\nSo when I palm this heat, I’ll leave your body layin’ all in the street\nI’m a big dog walkin’\nMy body ain’t worth shit, it’s kinda backwards ‘cause it hurts when the fifth starts barkin’\nI’m even better than before, iller metaphors\nKillas bet it all on ‘Niva, one shot dead ‘em all\nAnd that’s for Big Pun, big guns, plus a mean mug equals get funds, bitch run\nI tear this whole place up, sniff a half a cake up\nThen hog a loogy in your girl’s make up\nBrandishin’ pistols with 40s laughin’\nUp in your shorty in the asses, makin’ moves like I’m choreographin’\nMy dialect is full of disrespect, fuck the rules, bust a Uz’\nYou playin’ while I eat [?]\nThat’s how it is, how I live, nigga holla at me\nI oughta join PETA homie, ‘cause I’m llama happy, blow!\n\n[Hook: Sample] (x2)\nKing Kong, ain’t got shit on me!\n\n[Verse 3: Swifty McVay]\nMcVay, I’m that scandalous, a black bastard\nPuttin’ holes in a nigga’s face like a jack-o-lantern, I can’t fathom\nBeing attacked, don’t try me\nI spasm and leave these shots planted in that ass like an IV\nI’m grimy, lyrically toxic, a death prophet that cannot stop it\nOn fire like the back of rockets\nIn a mosh pit, stompin’ mommas for talkin’ shit\nI’m a pill poppin’ advocate, bitch I will not quit\nIf you ain’t payin’ homage to this Loch Ness Monster, we gon’ have a problem\nWhile my claws grip your revolver, I don’t knock niggas unconsciousness\nYou’ll be forever unresponsive, dwellin’ in a realm of darkness\nI park in front of your crib, walk on your porch with all fours\nAnd I piss on your kids, a reservoir dog\nThat’ll force y’all to torture each other, and this is not solved\nI’m on a couch laughin’ at all y’all, what?\n\n[Hook: Sample] (x2)\nKing Kong, ain’t got shit on me!", "image": "https://images.genius.com/78a2dd37bee3129adb21d5fac55f009d.1000x1000x1.jpg"}], "artist": "D12"}