{"songs": [{"title": "Kingofdasouth", "album": "Trap Muzik", "year": "2003-08-19", "lyrics": "[Verse 1]\nI been a menace to society\nSince when? since Menace 2 Society\nStill refused to become a legitimate citizen quietly\nFelt like my label hidin' me\nBut here I am anyway I might be back to slangin' grams any day\nAnd if this record flop well I'll be back wit' a bomb of hard\nWit' C-Rod and the squad this whole industry's a façade\nMan this ain't real life\nHalf these rappers don't know what sacrifice feel like\nMan these niggas is all hype\nNot even rappin' on real mics\nThey just get high and say whatever the fuck they feel like\nThey make me feel like bustin' these niggas one at a time\nAnd I'm still outbustin' these niggas, ho pick a rhyme\n\n[Hook]\nAy, what these other niggas talkin' I don't believe that shit\nI'm the king cause I said it and I mean that shit\nAy, what's so special 'bout him ay, he ain't all that shit\nI set the city on fire and you seen that shit?\nAy, what these other niggas talkin' I don't believe that shit\nI'm the king cause I said it and I mean that shit\nAy, what's so special 'bout him ay, he ain't all that shit\nI set the city on fire and you seen that shit\n\n[Verse 2]\nIt's only five rappers outta Atlanta who bustin' and I'm one of 'em\nThe other four, you know who you are\nBut if you gotta think twice, well, shawty, you ain't nice\nRegardless of your publishing deal you can't write\nI'm the best thing left blowin' breath on the mic\nThe king of the south; nothin' less will suffice\nYou wanna bet? Well put yo' budget up\nMatch the price me and you like putting matches to ice\nYou won't make it\nBefore I had a deal I was still butt naked\nGod signed this, like keeping the Lord's promise\nThe truth nigga like Beanie's first LP\nYou can do a song with N'SYNC and couldn't outsell me\nI'm a legend in my own time, a prophet in my own rhymes\nA king wit' a concubine\n\n[Hook]\nAy, what these other niggas talkin' I don't believe that shit\nI'm the king cause I said it and I mean that shit\nAy, what's so special 'bout him ay, he ain't all that shit\nI set the city on fire and you seen that shit?\nAy, what these other niggas talkin' I don't believe that shit\nI'm the king cause I said it and I mean that shit\nAy, what's so special 'bout him ay, he ain't all that shit\nI set the city on fire and you seen that shit\n\n[Verse 3]\nNiggas like you a dime a dozen they come and go\nSo why I'm runnin' now and I ain't never run before\nGrab choppers, cock 'em and blow\nStoppin' the show bet or owe 'em, droppin' the hoes\nYou just keep watchin' the door\nPop 'em, watch 'em drop to the floor fluff his pockets and go\nPut a quarter block on his nose and a Glock in his clothes\nHe can keep his watches and gold for his momma to hold\nShe'll be there buyin' the hoes before the drama unfolds\nThey know shawty outta control got me hot as a stove\nPuttin' holes in yo' Girbaud wettin' up yo' Polos\n44's and Callico's a black and a chrome\nLettin' loose and splackin' your dome\nHoppin' back in the Brougham\nKnown for kickin' in yo' door wavin' gats in yo' home\nClearin' it out I'm sorry I ain't hearin' you out\nYou hearin' about the squad pumping fear in your heart\nBecause you know sacrifice was near and dear to your heart\n\n[Hook]\nAy, what these other niggas talkin' I don't believe that shit\nI'm the king cause I said it and I mean that shit\nAy, what's so special 'bout him ay, he ain't all that shit\nI set the city on fire and you seen that shit?\nAy, what these other niggas talkin' I don't believe that shit\nI'm the king cause I said it and I mean that shit\nAy, what's so special 'bout him ay, he ain't all that shit\nI set the city on fire and you seen that shit\n\n[Outro]\nAy, my niggas y'all already know what it is\nT-I-P, Grand Hustle, Pimp Squad for life nigga\nSanchez on the beat, dig this man\nI'mma keep it always pimpin' I'm stayin' down\nY'all niggas gone send yo' demos in\nGet cha little motherfuckin' deal\nGo sell records\nNigga I got houses, I got blow, I got dro\nNigga I got hoes, nigga I got property nigga\nWhat you wanna do nigga?\nFuck y'all niggas\nCome see about me if you don't like it\nKing of da goddamn south\nRubberband man in this bitch\nUh, oh, uh, oh", "image": "https://images.genius.com/ab2d918a9feba95d0153b56bb925499d.1000x1000x1.jpg"}], "artist": "T.I."}