{"songs": [{"title": "Census Bureau", "album": null, "year": null, "lyrics": "Yeah, we straight from the Census Bureau\nHaha, Runyan Ave\nWe lookin' for yo' momma\nD 12, where yo' momma at?\nMiko, where yo' momma at?\nYoung Zee, hey Dame, where yo' momma at?\nI wanna f**k that b**ch, her stankin' ass\nHey 'em where yo' momma at? Yo\nYou know me, Denaun the same ol' nigga\nI spray paint your car up like Rain-O nigga\nSee me and you are sorta like the same I guess\nWe both rock mics but yours is into our chest\nYou can't do nuttin' to me, Runyan Ave's unruly\nAnd truly this ain't a movie, you get slapped with the tooly\nSo pass the slimmy and the Hennessy, I got the energy\nTo steal every car in this vicinity, you feelin' me?\nTake it back to when Das EFX was sayin niggity-wiggity-wild\nPiggity-pow, nigga be out\nYou don't really want war, I'm chillin' at your door\nThis uzi will have you bloody windmill-ing on the floor\nI can't be a punk, my daddy wasn't none\nI lose a fight after school and I came home and got one\nYou reap what you sow, that sh*t you oughta know\nI keep it on the flo' under the seat, I ain't a hoe\nYou know it's been a while but we feelin' it now\nThe rough sound muh'f**ker, niggas killin' it now\nGoddamn, you don't want no problems B\nGet your name in the obituary column sheet\nIt's that same ol' sh*t, niggas back again\nYo yo, you fallin' off, goin' back to smokin' crack again\nHit the weed, guzzle your Corona, pass the Gin\nBetter duck 'cause they back bustin' gats again\nA basket case indeed, stronger than a can of mace\nSlap you in the face while you patty-cakin' witcha seed\nI'll be makin' all these niggas wanna take a beam\nAnd put it right on my head\nYou don't be takin' heed, you probably idol the Feds\nHavin' meetings to recite what I said\nLiable to have you in a medical room\nWalk in that b**ch with a cell phone then turn it on\nGot a chrome that be f**kin' up sh*t worse than I\nYou would swear that I'm a Gemini\nI kill a guy for nothin', eye to eye\nAnd I ain't gotta touch them niggas face soon as I say somethin'\nGot a pump that'll tear your arm quick, when I leave a carcass\nYou would think you in Death Row's office\nI'm I'll enough to fall in the middle of moshpits\nSurvive and I'm gettin' up high without a flaw b**ch\nYou know it's been a while but we feelin' it now\nThe rough sound muh'f**ker, niggas killin' it now\nGoddamn, you don't want no problems B\nGet your name in the obituary column sheet\nIt's that same ol' sh*t, niggas back again\nYo yo, you fallin' off, goin' back to smokin' crack again\nHit the weed, guzzle your Corona, pass the Gin\nBetter duck 'cause they back bustin' gats again\nI'm a dog on the mic that'll brawl out with Christ\nGet to cappin' at your captain 'til he fall outta life\nI'm all outta nice, nigga tuck your chain\nPut holes in your head and finger-f**k your brain\nFool f**k this game, I'm poppin' at coach\nMomma dropped me on my head and knew that somethin' was broke\nI ain't feelin' nothin' you wrote so I'm stompin' your throat\nShow up at the hospital and start punchin' your folks\nI'm a uzi with arms and legs\nDuty calm your man, before my tooly bomb his head\nYou wanna take what my 40-cal since you b**ch-made\nSpittin' the right game so yo' ass can get laid\nThe f**k down, I don't give a f**k now, whassup?\nTalkin' 'bout \"Clappin'\", quit actin', you barely bust nuts\nDon't get it twisted at the gates, the name is Proof\nAnd I'ma kill every man that came with you\nYeah, yeah, knock knock, guess who showed up?\n44-mag and tear your whole door up\nPink shower cap and yellow drawers\nMy dick's so small, I can pee on my own balls\nWhen it comes to pussy, Bizarre goes to work\nThat's why my mouth smell like hot dogs and yellow Persh\nSo tell your momma hit me on my cell phone\nI ain't home, I'm so wet gettin' stoned with Norah Jones\nYou know it's been a while but we feelin' it now\nThe rough sound muh'f**ker, niggas killin' it now\nGoddamn, you don't want no problems B\nGet your name in the obituary column sheet\nIt's that same ol' sh*t, niggas back again\nYo yo, you fallin' off, goin' back to smokin' crack again\nHit the weed, guzzle your Corona, pass the Gin\nBetter duck 'cause they back bustin' gats again\nYo, I chuck niggas daily, a six-man crew that's born crazy\nA triple O.G. like Tray Deee\nI stay sparkin', b**ch I got a attitude\nI step on your shoes and won't say pardon, be cautious\nHidin' from the one-time, nutty as I wanna be\nWild and disorderly, p**sin' on your toilet seat\nNigga now you know it's me, I got a.44 wit me\nB**ches all over me, sayin' yes like Floetry\nHomie you wanna be a G? Go toe-to-toe wit me\nIt ain't no hoe in me dawg, I shoot out where your colons be\nWave the people-mover, crowd-controller\nRob niggas 'til my pockets look greener than Yoda\nAnd you know that I'm the shady type, the crazy type\nThat's probably why promoters never pay me right\nWe a bunch of hooligans, my hands is on the tool again\nI'm 'bout to bust a Huey and spray up a f**kin' school again\nYou know it's been a while but we feelin' it now\nThe rough sound muh'f**ker, niggas killin' it now\nGoddamn, you don't want no problems B\nGet your name in the obituary column sheet\nIt's that same ol' sh*t, niggas back again\nYo yo, you fallin' off, goin' back to smokin' crack again\nHit the weed, guzzle your Corona, pass the Gin\nBetter duck 'cause they back bustin' gats again\nYeah, D 12\nDevil's Night, part two\nThe drama continues\nKaySlay", "image": "https://images.genius.com/d38fa240d684e57a565427318ace6fee.706x706x1.jpg"}], "artist": "D12"}