{"songs": [{"title": "Nightmares", "album": "Listen To Me", "year": "2011-05-13", "lyrics": "[Intro]\nSo what they uh...your dreams is suppose to mean something right? But this shit don't make no sense. I keep having the same dreams over and over again. It's crazy. She said...\n\n[Verse 1]\n\"Nigga you just like your father\nI knew I shouldn't have kept you\nSon told me not to have you, little bastard I regret you\nYou so disrespectful\nYour daddy wore a condom and it broke\nYou shouldn't even be born, you wasn't meant to\"\n\"Oh bitch I can't believe you\nYou never was my mom, bitch you always did me wrong\nWe could never get along\nSo many times I tried and plenty times I cried\nYou were never by my side, shit you never did me right\"\n\"Motherfucker damn right\nYour daddy never loved me\nUsed to beat me and he left me for some hefter in the country\nAnd you a spitting image of that piece of shit faggot\nIf you think I treat you bad, muhfucka just imagine\nI used to write poetry, he took away my passion\nIf you don't believe me ask him\"\n\"But that was way back when\"\n\"I don't give a fuck I can see his face all in your face\nFor what he did to me you gon' pay for his mistakes\"\n\n[Hook] {x2}\nNightmares and I can't sleep\nPray the Lord and I hope that He can hear me\nBad dreams and I wonder what it means\nLord have mercy on me\n\n[Verse 2]\n\"Nigga shut the fuck up\nYou got it fucked up, I never should've trusted you\nOr fucked with you, you fucked up\nI knew I should've one'd you\nI knew I shouldn't have fucked you\nSon told me not to trust you I knew you was nothing special\"\n\"Bitch be happy I ain't leave you\nYou lucky I ain't left you, hefter don't be forgetful\nI did everything I can do\nBut you so ungrateful and I'm so faithful\nI done took care of your kids like they mine it amaze you\nA nigga could be so good, working two jobs and\nBitch you got some nerve coming at me sideways\nNo wonder when you get a man you can never keep one\nIt's just that you don't know a good nigga when you see one\"\n\"Fuck you\nYou don't know what I've been through with my baby dad\nHe beat my ass, nigga left me, wouldn't take me back\nSometimes I see his face all in your face\nFor what he put me through you gon' pay for his mistakes\"\n\n[Hook]", "image": "https://images.genius.com/2c85e5ff7768da914af18e07c14fca52.1000x1000x1.jpg"}], "artist": "Joyner Lucas"}