{"songs": [{"title": "Blue Armor", "album": "More Fish", "year": "2006-12-12", "lyrics": "[Intro: Ghostface Killah]\nUh-huh\n\n[Ghostface Killah]\nGreasy, razor blades, shots spray, military\nArmor, keep blaze packed, all day, dog's day\nGroundhog Day, ya'll bitch niggas got sweet hands, word\nI know why, why? Ya'll all gay, pop off head\nGet your top rocked, way across state\nThe pamphlet read, from seven to nine, don't hold that weight\nYa'll just bait, I'm a fisherman, I own this lake\nWhen I catch fish, I fry 'em, to they backside flake\nI smash ya'll muthafuckas like a seedless grape\nAnd hang niggas like some ceiling fans in K-Mart plates\nFeel me? Shake double earthquakes, give thanks, give shanks\nWord to my momma, I cut the grass on you fucking snakes\nExpose, don't tell, use a mo', round the way\nGo-Go down, gone with the wind, he's a he-she\nBitch ass nigga for sale, like Magilla\nStanding in the window, with a sign, \"Yes, I fuck men, though\"\n\n[Interlude: Ghostface Killah (Sheek Louch)]\nAiyo, Sheek (What up, dog?)\nStab one of them niggas, nigga, word up!\n\n[Sheek Louch]\nAiyo, my niggas is wetted, they drunk and they trying to eat\nThe hammers on 'em, and they ain't out looking for meat\nI'm jumping out cars, I'm giving you permanent scars\nYour hardest nigga, you can't compare him to ours\nI'm sitting on crates, I'm missing probation dates\nI'm stuck with this weight, my wifey period late\nI'm hot as fuck, my truck keep getting tailed\nIt's like every week, one of mines getting jailed\nForgetting bail, piss test failed\nGot parole on us, then wanna roll on us\nI'm at my momma crib sleep, who told on us?\nI'm sick to death, I'm on fire in the streets\nLike in Back to the Future, when the car left\nGhost'll clap for me, fuck, rap for me\nYo, tell them niggas on the Island, get strapped for me\nHet wet ya, and throw the stocking\nOn his face, like when he first met cha\n\n[Ghostface Killah]\nYo, me and Sheek drug heads like a bottle of Goose\nI had my road dogs follow your troops\nGorilla game, African tribe, Somalian crew\nWith a flow so sick, my high temperature'll body the flu\nCrack heads get knocked out, right in front of the school\nSlap 'em Sheek, wake his ass up, he can't even move\nCereal box is crack and ratchets, in the cocaine spot\nMy fiends'll box filled with coke head classics\nDope money, flood me rags of kush, heavy drags\nBodegas, I'm mad, my older sister Patty's a butch\nGuns come out like my mother's teeth, watch how I'm throwing heat\nThe leg gravy be steaming over smothered beef\nFrom eight-ball jackets to cops and robbers\nMy last drug run, I threw in two bricks to garbage\nI wash my money in Woolite, dunyy, sippin' on Folgers\nBlack jewels trucking, still come through bummy", "image": "https://images.genius.com/c666c55fe38ac486d5bf42862246cf28.1000x1000x1.jpg"}], "artist": "Ghostface Killah"}