{"songs": [{"title": "Half Price", "album": "I’m Good", "year": null, "lyrics": "[Intro: Woman (Kanye West)]\n(First of all, this song right here got...)\nYou say what is it that you want?\n(...a long ass intro)\nYou got everything that a woman could ever need in life\n(you got everything)\nYou got a closet full of minks, Chinchilla\n(You got beats from Kanye)\nI got a bureau full of diamonds\n(What else ya need?)\nI can change four times a day if I want to\nYou even tryin' to eat lobster and drink champagne\nNow you know that ain't your roots\nFor you strictly a collard green and cornbread bit\nNow you know if anybody know it, I know\nBut since you feel like that this evening\nSit down (Know what?) and drink some champagne with me\nAnd let me rap to you\n\n[Verse 1: Kanye West]\nYou'll never catch me in that baby momma Benz again\nI'm pushin' a G5\nAll the girls sayin' that his hair look Indian\nAnd ain't never seen him and MCM\nNow I don't like fake boobies but I'd do it to Lil' Kim (Yes I would)\nWe gon' roll this weed\nWe gon' play like Sonny Bono and hit these trees soon as we get alone\nI'm doin' beats for pro bono soon as we get to bone\nNow she like a lot of clothes, I like to see her out of 'em\nShe got a lot exposed, pump up the volume\nPump up the volume, dance, dance\nDon't give Kanye a chance\n'Cause I'm a Gemini with two sides and two rides\nY'all talkin' business, I'm peepin' her thighs\nLook, I'm tryin' to hit that back end 'fore I get that back in\nCalled Trina and \"Do she need that beat tracked again?\"\n\n[Hook: Kanye West]\n'Cause I came back for you\nTo show you that I'm workin' with a little somethin'\nAnd we get the session pumpin'\nSee, I came back for you\n'Cause any rap chick that look half nice\nI'm givin' 'em half price\n\n[Verse 2: Kanye West]\nBack when Eve went with Steve before she had her weave\nI was sendin' beat tapes like you wouldn't believe\nBack when Foxy had a group with Nas and AZ\nThe way she looked on Chyna Doll, I woulda did them beats for free\n'Cause only recently I been gettin' a decent fee\nThe checks I got from D-Dot was t-teasin' me\nI bought some earrings like, \"Baby, that may be fake\"\nBut at least it got girls callin' me 'Babycakes'\nNow maybe Kay can get a ménage with Lazy K\nAnd Lady May, maybe, hey?\nYou're lookin' all thick and sweet\nYou need a nigga that can give you dick and beats\nSo go and get Angie and tell her\n\n[Hook: Kanye West]\n'Cause I came back for you\nTo show you that I'm workin' with a little somethin'\nAnd we get the session pumpin'\nSee, I came back for you\n'Cause any rap chick that look half nice\nI'm givin' 'em half price\n\n[Outro: Kanye]\nGot a two for head sale\nSend, send headshots first though\nWill you beat tapes for who? Oh, Trina?\nOh, I'm right there, I'm right there\nI'll be the- I'll be in studio in five minutes\nYo yo, she said she want her ass look gushy wet\nI told her all I need is my back end check\nI told her to—\nI ain't finish that verse", "image": "https://images.genius.com/9e8c59349a0337188ba7d78588103880.600x600x1.jpg"}], "artist": "Kanye West"}