{"songs": [{"title": "Haterz", "album": "Hi! My Name Is B.o.B", "year": "2008-02-22", "lyrics": "[Produced by Ribah]\n\n[Intro]\nYes! What's happening? It's B.o.B!\nLet me introduce myself once again\nMr. East Side all day\nDecatur, Georgia - What's happening? [Calleror?]\nMan, jah-jrk-ga-gu-Woo! Woohoo! Boy, I'm just excited!\nI'm cra - this is crazy!\nOkay, this is B.o.B, and this is the LRG Hi! My Name is B.o.B mixtape series\n(Ribah on the Beat!)\n\n[Hook: B.o.B]\nWe got 'em going down for the count, looking down at the ground\nThat's why we got Haters, that's why we got haters\nHaters everywhere go, Haters everywhere go\nHaters everywhere go, where we go\nHaters going down for the count (One!)\nLooking at the ground (Two!)\nI think you're a hater, I think you're a hater\nHaters everywhere go, haters everywhere we go\nHaters everywhere go, where we go\nHaters going down for the count\n\n[Verse 1: B.o.B]\nJeahh.. yes sir it's the beats from Decatur (Jeah)\nCan't see enemies and the haters (Jeah)\nLittle sharp like a thing like the razor (Jeah)\nBlade, come clean like a shape up (Aha)\nSo I guess I gotta game my tape up (uh-huh)\nBut everybody got the need to say something (uh-huh)\nCan't speak up whenever you face them (uh-huh)\nThat's what you call microphone gangsters (What's up?)\nYeah I got them, [?] dope (Dope)\nYeah I'm raw, you know my flow (flow)\nCause Bobby acting extra hard, like a viagra overdose (aha)\nTalking that noise on all them songs (songs)\nA bunch of little boys, but you all look grown (grown)\nThose niggas there, and these niggas here\nBut it really doesn't matter, cause they all just clones (clones)\nGo to school, read a book, be a lawyer (lawyer)\nHell yeah, man I'm all for the cause (cause)\nAnd they ain't trying to involved with the law serve\nBut a nigga will get caught with the most money\nAnd that just ain't a threat on a song (no)\nDon't get it wrong, for protecting my own (no)\nCause niggas that slip, they don't last long (no)\n\n[Hook]\n\n[Verse 2: Rick Ross]\nRoss.. Haters talk, but they don't count\n[Bet you got you a bird, nigga still at an ounce?]\n[Bet you got you a house?], haters hating on me\n'Cause I'm OG, big boss of the south\nGot more diamonds, got more whips\nDo more shining, stack more chips\nI'm just riding, straight profiling\nYeah I'm smiling, with your bitch\nVIP, don't touch my shit\nDay with me, yeah that's my clit\nShake them haters, watch me stunt\nNow all at once, suck my dick!\nThey know what we came for, AK to your [cango?]\nThey got me under investigations, they say I slang dope (Heeyy)\n\n[Bridge]\nWe got 'em going down for the count\n\n[Verse 3: Juvenile]\nBoss! Talk about you, when I roll away\nWhen around me, you ain't even got a word to say\nAnd you was telling your folks, you were going to murder me\nKept me going to the car, ready hurry to play\nY'all looking at a man, I'm looking at children\nBored like a motherfucker, what is you doing\nNew Orleans, my city long been burnt\nWatch yourself, your coming down your turn\nYou know what it is, you been down that path\nIn the shit, that these clowns don't have\nLike buying a [boy/bar?] and putting it on my tab\nHate around on me, even on my staff\nYou a momma's boy, nigga you ain't so rough\nBack in the hood, you didn't have no nuts\nMe and my people used to beat you up\nNow you on top and [thank you too much?]\n(They hating)\n\n[Bridge]\n\n[Verse 4: Big Kuntry]\nCocaine! (Cocaine!)\nDirty niggas, I done hate 'em (Yep)\nEven bought a PSE chain (What?)\nBut that don't make you family (Uh-uh)\nBehind my back you mad at me (strange)\nIn my face you proud of me (What?)\n(Haha) Fuck boy, go ahead, nigga you ain't gotta me kind to me (uh-uh)\nNiggas scared (niggas scared!)\n'Cause I got that hater stopper (stopper)\nWhat's that? (What's that?)\n[Left be?] my motherfucking chopper (chopper)\nI told [till?] (told till), I going to hold a hustle down\nIt's [market?] season (market season), I'm killing shit now\n\n[Hook]", "image": "https://images.genius.com/adcf6114ce030b4f70858bc64c941f6f.496x496x1.jpg"}], "artist": "B.o.B"}