{"songs": [{"title": "My Own Hell", "album": "Vintage Tech", "year": "2005-03-22", "lyrics": "[Intro 1 (Taken from Freaky)]\nI really don't have to tell you much about this one because the song is\nLike the song is like self-explanatory, you know what I mean? It's\nCalled \"My Own Hell\", story about me, and Midwestside, and Hogstyle\nRecords, and people around me, and my wife, and stuff like that, Pretty\nPersonal, real ruff copy, it's the only one we got, you know what I\nMean? I think y'all really love the story\nPeople are nosey and want to\nKnow about my life so check this out; this is called \"My Own Hell\"\nProduced by Don Juan\n\n[Intro 2]\nNigga, my life is straight conflict\nWhen all I want to do is kick it hard and make bomb shit\nEvery perimeter I enter is infested with a sinner\nSeems like I'm losing and never coming out the winner\nShit, I'm the only one kicking it, everyone else plotting and scheming\nBut yet they never listen when I say I'm a little piece of love and a pit full of demons\n\n[Verse 1]\nMidwestside was record company comprised of all friends\nWho grew up together and shared ends\nNobody stepped on nobody's toes\nDiamond was executive producer, Juan had beats I had flows\nScooby and Txx Will did promotion\nGot it where Mitch Bade was the shit and got Kansas City open\nJuan got that shit to Quincy Jones through a chick named Mona\nThree days later Q called us back and it was on\nQ told us to wait on putting the record out indy\nThe record company will make it to where we'll have plenty\nSo we waited, should we put this out? We debated\nBut working with Quincy we were elated\nSo now we on the road to L.A. and it was live\n'Til we got to Quincy's and Diamond told Scooby and them to sit outside\nThat's when the tension started to build\nNiggas started feeling unappreciated and then shit got real!\n'97 Quincy called back for me and Juan\nI told my Rogue Dog niggas just to remain calm\nI'm bout to make it so we can bling, get us nice things\nAnd then Don Juan said, \"let's mash for our dreams nigga\"\nScooby didn't like the way he spent his money on promos\nT-shirts and money to pay Brain for logos\nHe thought he wasn't appreciated, Midwestside depreciated\nGone for the summer and everybody waited\nBakarii didn't like the fact he was down with Mitch Bade\nHe felt that he should be the next nigga to get paid\nTxx Will got tired of being lectured\nOn distribution so the anted up and started Hogstyle Records\nMy niggas wanted me to ride\nHell yeah I'm down, Tecca Nina's on both sides\nHogstyle's like \"Fuck 'em, 'cause they didn't believe in 57\nMidwestside's the same, but the love, I'm trynna find my way to heaven\n\n[Hook]\nYo... This is my own hell nigga, this is my own hell\nJust tryna make my records sell\nOff in my own hell nigga, this is my own hell\n\n[Verse 2]\nWe went to Cali to hook with QD3\nThey wanted the superstar to be me\nKicked it with big Q off in the wild wild west signed me to Qwest\nDidn't know I was in for some more Perspective mess\nQwest fighting Midwestside over a single\nAll the way from the love angel to Kris Kringle\nCEO of Midwestside fighting QD over my budget\nQD fighting Qwest 'cause he never loved it\nWarner Bros. fighting back and forth with my artists\n'Cause the bitch who's handling money's retarded\nQwest don't like Midwestside, QD3 don't like Qwest\nAnd I'm sitting in the middle depressed\nWarner Bros send me four Gs a month\nI'm kickin' it at parties, liquor, weed, and cunts\nWhen everybody's fussing and fighting\nI'm suffering peacefully like Novocaine\nThat's because I didn't know the game\nMidwestside, Juan, and QD3\nQ-W-E-S-T fighting all over me\nSway and Tech tripping with Q over a check he didn't pay\nBut I suffer (Man I suffer)\nYeah, I suffer at the end of the day\n\n[Hook]\nYo... This is my own hell nigga, this is my own hell\nJust trynna make my records sell\nOff in my own hell nigga, this is my own hell\n\n[Verse 3]\nFemale friends started not to like my woman\nWhen they found out my marriage was comin'\nMy wife didn't like my friends from the get go\nShe say them bitches ain't nothing but fucking famous rapper niggas for the grip hoes\nWifey don't like me hanging out with E and Beans\n'Cause when we be seeing E and Beans wifey be seeing things\nBeans don't like Sheryl 'cause Sheryl fine as hell\nAnd Beans thinks Sheryl will take the dick to show and tell\nSheryl don't like Beans 'cause Beans rude\nShe wish Beans would go back to Chicago with her dude\nSayin' he don't like Dr. Wick\nBut Dr. Wick don't give a shit, Zany got Nicky waiting for the hit\nWifey study entire 'cause something seems fishy\n'Cause all my relations iffy iffy\nWifey thinks Big Sonya would try to fuck\nBig Sonya knew if she try wifey was down to buck\nNow all these niggas in my rhyme are my people\nNo one can save them not even a steeple could make 'em equal\nYou're all my sisters, my brothers\nBut I'm tired of mediating, I'ma sit and watch y'all kill each motherfucking other\n\n[Hook]\nYo... This is my own hell nigga this is my own hell\nJust trynna make my records sell\nOff in my own hell nigga, this is my own hell\nThis is my own hell nigga this is my own hell\nJust trynna make my records sell\nOff in my own hell nigga, this is my own hell", "image": "https://images.genius.com/a948579698830c97f054acf70a17900c.750x750x1.jpg"}], "artist": "Tech N9ne"}