{"songs": [{"title": "Ghost Rider (Crossfire)", "album": "Freak To The Funk / Ghost Rider 12", "year": null, "lyrics": "[B-Real]\nOn the high seas, it's the pirate\nWith the musket\nAt'cha head, and I'll fire it\n\"It's the return of the Red Beard!\"\nAnd Polly don't want a cracka'\nI'm gonna make you back up\nWith the wind in the sail\nDestination on to the temple\nWhere the boom lies in the mental\nOutlaws ridin' beside me\nI see a ship on the horizon\nComin' up, and I'm realizin'\nIt's time for another uprisin'\nI'm manin' this attack by suprise n'\n\"Avast mates, fire up the cannon\"\nRight on the enemy's vessel it's landin'!\nLook at all these ships sinkin' low, and goin' down\nWith the captain, that's goin' under\nLet no man put us under\nWhen me and my ship's rollin' like thunder\n\n(hook)\nGhost rida'\nOn the seven seas fiya'\nPump that cannon when the flames get higha'\n(x4)\n\nI'm still on the high seas\nSmellin' that salt of the ocean breeze\nFeelin' that heat of the sun on my face with a 'Yo Ho Ho and a bottle of rum'\nWhen you see my flag in the distance\nYou better run and call for assistance\n\"Cuz we're comin' on the pillage\nKillin' all the men, and takin' all the gold and the riches in the village\"\n\"Pull up the anchor! Swap with the bounty!\"\nHeadin' for the east where my enemies hound me\nThey wanna hang me for high treason and chivalry\nAnd for many other reasons\nWanted dead, and a handsome reward for any motherfucker who delivers my head\n\"Shiver me timbers!\"\nI'll burn your bloody ass to a cinder\nSo all you motherfuckers remember\n\n(hook)\n\n[Sen Dog]\nThink of the many moons I been away from home\nOn the seven seas or wherever I roam\nBlack Beard takin' you down to the galley\nHow does it feel with my sword in your belly\nYou can face the cold shank\nOr get ?blind funk it? when I'm makin' you walk the plank\nStandin' over the edge in the dark\n\nB: \"Feed his bloody ass to the God damn sharks!\"\n\nSen: The sound of a neck bone snappin' is what'cha in fo'\nWhen ya on ya way to the sea flo'\n\nB: \"Sixteen men on a dead man's chest\"\n\nSen: I killed them fools and I'll kill the rest\n\nB: \"I am what I am!\"\n\nSen: And I'm not a land lubba'\nWhen ya hear the musket, you all take cova'\n\nB: \"Fire one, fire two, fire three!\nDon't ever forget about me!\"\n\nSen: 'Cause I'm the ghost rider' on the storm\nKeepin' the cannons warm\n\n(hook)", "image": "https://images.genius.com/733c08d2c2a34f03a05490cf3a671d14.500x375x1.jpg"}], "artist": "Cypress Hill"}