{"songs": [{"title": "Revolution", "album": null, "year": null, "lyrics": "[Prelude: 2Pac speaking]\nYou know what gang violence is, mostly?\n[And the people dont want you to hear this]\nIf somebody shoots your family member\nOf course you retaliate, You know what I mean?\nSame thing the U.S does except nobody even shot their family members\nThey see that, somebody bomb a school\nAnd all these people get killed\nSo the united states feel like ooh thats messed up\nWe gotta go show em who tha real killers\nThis country was built on gangs, you know\nI think this country still is run on gangs\nRepublicans, Democrats, The Police Department, The FBI\nThe CIA, those are gangs, you know what I mean\nThe correctional officers\nI had a correctional officer tell me straight\n\"We the biggest gang in New York state\nStraight up.\"\n\n[Verse 1: 2Pac]\nSuppress the revolution of premeditated scheme\nIntroduce a drug called crack, to us ghetto teens\nGot a law for raw niggas, now playa what it be like?\nWhen will niggas see they got us bleeding with three strikes\nCan't seem to focus hopeless, with violent thoughts I wrote this\nGot these Devils petrified, hiding from my hocus-pocus\nAnd so I learned to earn my currency in over time\nAffiliated, clearly click a military mind\nMay God forgive us though we dwell inside a paradox\nThugged out and drug dealin, from the womb to the block\nMy live mind got me survivin five rounds\nMy forty-five got my fortified with live rounds\nWhen shit's thick we plot hits, when our Glock spits\nAll hail, Out on Bail, Wrath of the 2Pacalypse\nForever ghetto necessary picture food stamps\nOutlaw Thug Niggas never left the boot camp\n\n[Hook: Busta Rhymes]\nWe got the real live shit from front to back\nTo my niggas in the world, 2Pac is back\nWhere my soldiers is at? (2X)\nWhere the fuck my soldiers at?\nWhere my soldiers is at?\n\n[Verse 2: 2Pac]\nNow I was born as a rebel, making trouble for the devil\nTake this gang bang shit, to a whole (a)nother level\nCan you feel me now?\nArmies in every city\nDefinition of power\nPlayers are you with me?\nSee the war is the prophecy\nSurvival is the strategy\nRest in peace to my comrades that deceased\n\n[Busta Rhymes: yells \"Notorious B.I.G!\"]\n\n[Verse 2 Cont'd: 2Pac]\nWalking down the streets of time\nYoull have these devils petrified of a nigga in his right mind\nThey tell us that we hopeless and hell bound\nThis fo the brothers in penetentiaries jailed down\nI got you in my heart till tha day I die\nThink of tha damage we can do, if we wasn't high\nCan you picture me loc? Its a thugs wrath\nPolitical contracts and blood baths\nFor Matulu Shakur up in the Rikers\nThough they got you, I never let them stop me\nThe struggle continues\n\n[Skit: 2Pac Speaking Again]\nNow if we do want to live a thug life and a gangsta life and all of that\nOk, so stop being cowards and lets have a revolution\nBut we dont wanna do that, dudes just wanna live of character\nThey wanna be cartoons, but if they really wanted to do something\nIf they was that tough, alright, lets start our own country\nLets start a revolution, lets get out of here, lets do something\n\n[Hook: Busta Rhymes]\nWe got the real live shit from front to back\nTo my niggas in the world, 2Pac is back\nWhere my soldiers is at? (2X)\nWhere my soldiers at?\nWhere my soldiers is at?", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}