{"songs": [{"title": "Kool Aid and Frozen Pizza", "album": "K.I.D.S", "year": "2010-08-13", "lyrics": "[Intro: Excerpt]\nSee a person like me, smoke weed 'till I hallucinate\nI don't know why, crazy right?\nThis party was dope, that shit got played quick\nYo but the bitches are freaky here\n\n[Verse]\nKool-Aid and frozen pizza\nIt's a work of art, I ain't talking Mona Lisa\nDream of rocking crowds, see me filling up arenas\nThis weed got me laughing like a damn hyena\nYeah, I live a life pretty similar to yours\nUsed to go to school, hang with friends and play sports\nEvery single summer taking trips to the shore\nAnd that was all gravy but I knew I wanted more\nAin't ever seen a young rapper like moi\nCan't believe they eyes, swear its just a mirage\nStill got my training wheels in the garage\nBut I ain't gonna need those, I'ma go hard (Go hard)\nSo far I've done pretty well for myself\nCouple trophies on the shelf so what else\nCould I want that I don't have yet\nWell, a little more cash and my own fast jet\nSo I can go anywhere (Anywhere) anywhere (Anywhere)\nCali for the kush, cause boy I know there's plenty there\n'Bout to be in music stores everywhere but not yet\nThey can't understand my concept\nI been climbing up the great wall, haven't had a fall yet\nThese blogs gotta know I'm on next\nClean conscience, good Samaritan\nCompanies send me clothes so I'm wearing 'em\nIf you didn't know, well I'm from the 'Burgh\nEverything I drop recorded by Big Jerm\nI smoke herb and I make music\nI don't even talk about it boy, I just do it\nEverybody got their own opinion, the reasons why they feeling 'em\nYou must admit he's killing 'em, running off adrenaline\nWaiting for the game to wanna let him in, so open up\nThe boy a barrel of a smoking gun\nWhether I'm old or young, the chosen one\nI got a hundred billion flows to come\nI hope you know the lyrics to every single song\nSo when I'm at a show everyone can sing along\nMy weed bag empty, bottle at its last drop\nI'm feeling like this could be my last shot\nBut many more songs to make cousin\nSo why the fuck you bugging?\nHaha\n\n[Outro]\n(Yeah, we just some motherfuckin’ kids)\n(We just some motherfuckin’ kids)\n(We just some motherfuckin’ kids)\n(We just some motherfuckin’ kids)\nShout out to all my fans man\n(We just some motherfuckin’ kids)\nHolding me down\n(We just some motherfuckin’ kids)\nAnd all the homies\n(We just some motherfuckin’ kids)\nMost dope!\n(We just some motherfuckin’ kids)\n(We just some motherfuckin’ kids)", "image": "https://images.genius.com/77947b06ecbfe25564f55a72ac6ecdff.500x500x1.jpg"}], "artist": "Mac Miller"}