{"songs": [{"title": "Things Will Change", "album": "Kristyles", "year": null, "lyrics": "Hands in the air! (x4)\n\n[KRS]\nGood looking, word...\nDJ Revolution, word up...\nLet's do this, kid...\nHere we go!\n\n[Hook]\nA good time, a good vibe, and a house with a court\nGood life, good wife, a little food for thought\nI need (I need) food, clothes, and a whip with rims\nI need God in my life, I need family and friends\n(I need) money, power, respect, I need love\nI need world peace, homeless to eat, no drugs\nI need every race and creed to be one\nEvery nation, every face and seed to see sun\n\n[KRS]\nYou need to listen to this, you need to listen to Kris\nYou need to have peace at least, you need spiritual bliss\nYou need a lyrical twist, do you know what a miracle is?\nBefore we begin, you may need a kiss\nI suggest either one from J to O-one from the lips\nEither way what I'm saying, yo, is bound to uplift\nYou need checks, you need cash, you need intellect\nYou need to be moving fast, you need that big respect\nYou need to be rolling in a car, going to a bar that's far\nMakin' the deal to make you a star\nYou need to ask yourself, now do you know who you are?\nWhere you goin'? How many steps you took so far?\nYou need patience, you need to control your mind\nIf you read and don't act, then you're wasting your time\nWe need better leaders, we need better preachers\nWe need a three-thousand dollar raise to all teachers\n\n[Hook]\n\n[KRS]\nYou need some meditation, you need rejuvenation\nYou need assistance right now with your situation\nYou need some contemplation, you need a combination\n–A combination of will power and concentration\nYou need some syncopation, with regular relaxation\nBut you can't, cause you runnin' and racin' and chasin'\nYou need to slow down, maybe you should speed up\nOne sayin' \"lay down,\" the other's sayin' \"leap up\"\nYou gotta keep up, I suggest you start to speak up\nA lawyer, a doctor, a rapper — you wanna be what?\nWhatever it is, you gotta visualize\nYou need to focus for real, and stop livin' them lies\nThe time you givin' them guys\nYou could be workin' upon the goal you hold\nYo, you must realize, yo, you need to be wise\nYo, you need to be alive, there could be no revenge or deceit in your eyes\nRise!\n\n[Hook]\n\n[KRS]\nGimme what I need, do it with speed\nChange the situation around, plant new seeds\nI roll with a righteous team of adults\nForget the insults, we plan to get results\nYou can call us a cult, you can call us a gang\nBut when it comes to Hiphop, no, you cats can't hang\nWhen the Gatts go bang\nAnd the telephone rang\nTelling you to come to identify the remains\nThat's when you feel the pain\nAnd my name comes as comfort, ease and all stress and strain\nYou need to know the game\nYou need to know the meaning of your own name\nReprogram your own brain, ask questions with no shame\nHow you think you gonna master your craft if you don't train?\nPerfecting your skill, that's the aim\nPerfect your skill, and you'll always have money and fame\nC'mon!\n\n[Hook]\n\nWhat I, uhh, what I need\n(House on the hill)\nThat's what I need\n(Cash credit on my bill)\nThat's what I need\n(All my dreams fulfilled)\nThat's what I need\n(New whip that I can wheel)\nWhat I need\n(With the chromed out grill)\nUh huh, that's what I need\n(And the girl that can chill)\nThat's what I need\n(And my spirit all healed)\n\n[Outro x6]\nThat's what I need\n(That's what I need)", "image": "https://images.genius.com/2333a9607025ac4cc5a6777157dbce5f.220x220x1.jpg"}], "artist": "KRS-One"}