{"songs": [{"title": "Tears", "album": "Spiritual Minded", "year": null, "lyrics": "\"At midday today, some Americans attended memorial services\nFor victims of Tuesday's acts of terrorism. Thousands\nGathered at Chicago's Daily Plaza. Hundreds more looked\nOn from the windows of surrounding office buildings\nMany waved flags, and traffic came to a complete standstill\nOn the rooftop of City Hall, which faces Daily Plaza, a\nPolice sharpshooter watched the crowd, even as he saluted\nThe flag. After a minute of silence, church bells rang.\"\n\n{Ain't no need in all the tears, oh no no, yeah yeah\nYeah cause things will be better tomorrow}\n\n[Hook: repeat 2X *sung*]\nNo need for tears, no need to cry\nNo matter what we face, we shall get by\nWhen the problems you face are too much to bear\nKnow I'll be there\n\n[KRS-One]\nHold that head up y'all, don't get fed up y'all\nC'mon let's get up y'all\nMake that bed up y'all, life is a set-up y'all\nSadness comes from a lack of knowin, not knowin\nWhere the one that you love is goin\nWe all gonna reap what we all are sewin\nThere is no death, just constant growin\nWe can't stay here forever\nWe all gotta go to a place we believe is better\nSo why be sad, why be mad\nNow you can see it ain't about the cheddar\nIt's all about the time that we spend together\nNot the rhyme or the crime or the Gucci sweater\nThe house that's built on a rock can stand the weather\nFaith, can stand the weather\nBut is your house, upon the rock\nOr is it on sand and about to drop\nHere is the question that you got to ask\nDo I live for today or do I live for the past?\nThink fast, but do not hurry\nLife is a class and we should not worry\nBut tell me, how long you gonna ignore\nTell me how long you gonna ignore God's law?\nHow long can you really endure\nLivin like pimps, livin like whores\nThe choice is yours, or really ours\nThink about this while you lay the flowers\nOn the grave, uh, let's talk about how you behave, uh\nDo you come out the neighb' or out the cave?\nBetter change your ways, we comin up on some stranger days\n\n[Hook]\n\n[KRS-One]\nUhh, uhh\nDon't step where the danger lays or danger lies\nOpen them EYES UP, better to RISE UP, WISE UP\nRaise your MINDS UP\nLook to the left, look to the right\nPray in the day and the night\nBe prepared for the fight, not scared of the fight\nHe's the way, the truth AND the light\nJ to the E to the S to the U to the S\nYou can remove the stress\nYes, we do need you here\nYes, we wanna be free from fear\nYes, we wanna start seein clear\nHavin you here, not over there\nLookin around sayin where, does anybody care?\nYeah, I'll be there\nAt the door, not at the war\nAt Matthew 5:44\n\"But I say, unto you\nLove your enemies, bless them that curse you\nDo good to them that hate you\nAnd pray for them which despitefully use you\nAnd persecute you\"\nThis goes for them terrorists too\nBut them publicans, done put themSELVES up above again\nLookin for blood again, hate no love again\nGot them soldiers runnin in, with a gun again\nWith a ton of sin, in a holy war, how we gonna win?\nI think it's time for KRS-One again\n\n[Hook] - repeat 2X\n\n[KRS-One]\nThe time is now, you gotta make your choice\nWhich side are you on? Turn now to Matthew 5:46\n\"For if ye love them which love you, what reward have ye?\nDo not even the publicans the same?\nAnd if ye salute your breddern only, what do ye more than others\nDo not even the publicans so? Be ye therefore perfect;\nEven as your FATHER which is in heaven, is perfect..\" {*echoes*}", "image": "https://images.genius.com/d84f73e1b21b8b4dbd679efa191364e4.1000x1000x1.jpg"}], "artist": "KRS-One"}