{"songs": [{"title": "Hit Em Up III", "album": null, "year": null, "lyrics": "Aiyyo Head, that's why I fucked your mother you fat motherfucker!\n\n{*beat changes to 2Pac's \"Hit 'Em Up\"*}\n\nKill Whitey! - Hahaha\nKill Whitey! - Detroit! What? What?\nKill Whitey! - .. yo, yo\nKill Whitey! - Haha! Look\n\nFirst off, fuck your songs and the shit you say\nDiss my wife, but at least I got a bitch, you gay\nYou claim to be a Muslim but you Irish White\nSo fuck you fat boy, drop the mic, let's fight\nPlus I punch you in the chest, weak hearts I rip\nWhitey Ford, forty and white, lethargic ass dickhead\nI keep 'em comin while you runnin out of breath\nSteady duckin while I'm punchin at your chest, you need to rest\nDilated, go ask your people how I leave ya\nWith your three CD's, nobody sees, when they released\nEvidence, don't fuck around with real MC's\nWho ain't ready for no underground beef, so fuck geeks\nI let you faggots know it's on for life\nBut Everlast might die tonight, haha\nFat boy murdered on wax and killed\nFuck with me and take a heart pill, you know!\n\n[Hook: Eminem]\nGrab 380's when you see Slim Shady\nCall the doctor to heal your heart\nThey shocked you back to life at the clinic\nBut you 'bout to get relapsed any minute\nHonkey, I hit 'em up!\n\nHahaha, yo check this out\nYou faggots ain't even on my level\nI'mma let D-12 ride on you bitch-made ass faggots!\n\n[Kon Artis]\nYo! Get out the way yo, get out the way yo\nWhitey Ford's heart just stopped\nEminem shocked him back, he had another heart attack\nWhitey Ford's gettin his ass floored for talkin back\nLittle faggot Hamburgular, I show you where the burgers are\nAt your own restaraunt, while I'm servin ya\nDrop and stomp your whole heart 'til it stops\nCall the cops, I'mma beat your ass while they watch\n\n[Kuniva]\nHa ha, now we got the whole industry makin fun of you Erik\nWhere's your House of Pain now? There's only one of you Erik\nYou a petty coward, you ain't ready to steady go a round\nWith some killers from 7 Mile to the motherfuckin Belle Isle Bridge\n\n[Hook]\n\n[Eminem]\nGot in his ass and now this faggot wanna mention me still\nThis ain't no freestyle battle Everlast gettin killed\nWith his chest open\nTryin to throw a fuckin punch, but you just chokin\nHavin a stroke and now you learn why crackers never earned a dime\nCause you SUCK motherfucker you should learn to rhyme\nTalkin 'bout you packin pistols but it's funny to me\nYou ain't never been in trouble, you just wanna be me\nI'm a paleface killer whale\nOn his way to fuckin prison, pistol whippin tail, ha\nErik remember when I passed you in the lobby that day?\nThat shit was obvious you probably was gay, ha\nNow it's all about country, you gave up hip-hop\nForty-nine thousand copies, the week your shit drop\nWhile my sales makin records break\nTwo and a half million scanned by the second week\nMotherfucker I hit 'em up!\n\n[Proof]\nI'm from Detroit's Pemberton Ave., where bullets tear you in half\nFuck the music, we got an uzi for all you fags\nGet the shit out of our stereo, Dilated you violated\nNow you 'bout to get annihilated, we gon' bury you\nIriscience get choked up and yoked up\nAll you underground bitches get your throats cut\n\n[Swifty]\nWhat the fuck?! Is you stupid?\nI choke Whitey Ford with his fuckin guitar cord\nAnd stuff him in cardboard, chopped up in a box\nWith sixteen parts, I stomped on his heart\nD-12, Amityville, fuck your mother while you watch\nKeep your restaraunt locked and block your door\nCause we \"Hit 'Em Up\" like motherfuckin 2Pac Shakur\n\n[Eminem]\nYou a, \"Black Jesus,\" heart attack seizures\nToo many cheeseburgers McDonald's Big Mac greases\nWhite devil, washed up honkey\nMixed up cracker who crossed over to country\n\n{*laughing*}\nYo, aiyyo cut this shit off\n{*needle drags, beat stops*}\n\nFuck him, that's it, I'm done, I promise, I'm done, that's it\nI'm sorry, I'm sorry, I'm sorry, I promise\nI just believe in kickin a man while he's down\nGod damn! I quit\nMention my daughter's name in a song again you fuckin punk\nAiyyo..", "image": "https://images.genius.com/d38fa240d684e57a565427318ace6fee.706x706x1.jpg"}], "artist": "D12"}