{"songs": [{"title": "Valleys", "album": "Pharaoh Height 2/30  ", "year": "2015-08-28", "lyrics": "[Intro]\nPharaoh, pharaoh?\nPharaoh\n\n[Verse 1]\nDollar mission, Mississippi Masala getting\nGuava Casaba melons, getting a spot at competition\nTitties and teeth, so silly of me, no really, it’s free\nAye you can use the phone like a new computer wand\nThat’s an Ethernet pun, cause dial-up’s all done\nWhen it took twenty minutes just to download one\nAye, you got a fine face, also a dime in your behind\nPlease can I find some time space to find base\nKinds of rhymes to describe how you’re designed great\nAnd maybe remove the mind freight\nLike it’s overhead cranes at the train yard\nThat Tom Cruise used in the War of the World's\nBefore the aliens came part\nRemember that? Oh, not a fan of the sci-fi?\nLike dial-up’s not a fan of the wi-fi\nI’m in your eyes like little reflective little pools of tie-dye\nAnd it’s 1972 and I’m some long-haired high guy\nDriving a Volkswagen Beetle off into the California twilight\nI usually got top cause I’m a guy right\nBut if you’re gay that’s straight too\nHey, I don’t hate, I got a couple of friends who went bi twice\nDid that arrive right?\nDo you like whole stories or just the highlights\nCause I like to write your life story on the sky\nMade of Lite Brights, remember those?\n10 years old, let me guess your age\nYou were a ten, ten years ago\nAm I right, who you calling?\nMaybe New Orleans\nWhere your Mother lives with your brother's kids\nBecause he locked up cause\nOf what some other motherfucker did\nLove to fib 'bout the Fibonacci sequence\nDo you flicker like Liberace Sequins\nOr maybe twinkle like little stars\nAnd tingle like little scars\nI run a wrinkle with you like a car hood\nAnd crash test and beat-box while we rewrite\nSaul Williams doing the slam set\nThen wrap like saran over the pan\nKeep the yams fresh, sweet\nFive different songs, over five different beats\nAnd this one’s called Valley\nI wrote it on the plane in the chair by the galley\nOn the way to Cali, chicken in the salad\nSounds like a ballad\nYou loyal, so I’m Khaled\nBuy your momma a palace, scratch that\nBuy your momma what matters\nData says dollars hotter than two Nevadas\nBurning hole in the pockets\nAnd in the wallets of all the rappers\nTrappers attracting all the yellowbone Instagrammers\nBut what about us?\n\n[Interlude]\nPharaoh, Pharaoh, Pharaoh\n\n[Verse 2]\nIt burns inside like lactic acid\nExorcise demons, turn them into gods\nTurning in the rods for the bags of the catfish\nI don’t believe that God is a black man\nSpoiled child getting robbed for his black mans\nMars and other stars in the CAT scans\nBack when I listened to Killah Priest\nHad my mind thicker and bigger than Philip Heath\nWalking round in kufis with sunnis with dhikr beads\nRemembering the movies my duty was killing beats\nSocial villain unwilling to live in peace\nI told you children I’m wielding a living beast\nStreets, this is where Helen and Ellen meet\nSo you can get lost like Gilligan on the beach\nThe players getting mad they not kicking it with the freaks\nCause they took away they pussy and giving it to the geeks\nLike us, paradigm shifter, South Carolina Nine shrine shine giver\nBut not enough dimes to be a crime line tipper\nThe difference between \"nigga\", and \"nigga\"\nUh, Bernie Sanders need a Nike deal\nThen I might consider that, he might be real\nIf Phil Knight, knight him then I might like him\nUntil then children, enjoy the white icing on the cake\nCake, cake, cake, cake\nOn the cake, cake, cake, cake, cake\nOn the cake, cake, cake, cake, cake\nOn the cake, cake, cake, cake, cake\nYeah, yeah, pharaoh, height, yeah\n\n[Verse 3]\nWhat you need a little more? Okay, I’ll give-I'll give you a little more, I’ll give you a little more.. maybe like, like, yeah, yeah\nFreestyle off the top, sitting on the stool on the block\nWatching  for the cops, watching for the thots, watching for the shots\nI’m watching for a lot, I gotta use my eyes cause they use me\nCause to them I’m like a price, so I say surprises\nAnd they don’t deprive us, I just demise us\nAnd nothing ever lies yes, on my premisises\nWatched for my demises\nMaybe might like them, until then just enjoy the white icing on the cake\nCake, cake, cake, cake\nThe cake, cake, cake, cake, cake\nThe cake, cake, cake, cake, cake\nThe cake, cake, cake, cake,cake\n\n[Outro]\nAmeri-cake, cake, cake, cake, cake\nThe cake, cake, cake, cake, cake\nThe cake, cake, cake, cake, cake\nThe cake, cake, cake, cake, cake\nAmeri- the cake, cake, cake, cake, cake\nThe cake, cake, cake, cake, cake\nThe cake, cake, cake, cake, cake\nThe cake, cake, cake, cake, cake\nAmeri-cake, cake, cake, cake, cake", "image": "https://images.genius.com/bef4cf108208bb4604a6547581b0aaf0.500x500x1.jpg"}], "artist": "Lupe Fiasco"}