{"songs": [{"title": "Live Forever", "album": null, "year": null, "lyrics": "[Intro: Baka]\nMurda on the beat so it's not nice!\n\n[Chorus: Juice WRLD]\nWhy do I always fall for the bad ones?\nShe turning every boy to a sad one\nAyy, she turning every boy into a mad one\nI guess I'll be pissed off until the price comes (Yeah)\nToo much drugs (Yeah), I can't breathe (Yeah)\nAvalanche (Yeah), pick me up, 911\nToo much drugs (Yeah), I can't breath (Yeah)\nWho me? Nah, I'ma live forever, uh\n\n[Verse 1: Juice WRLD]\nClick-clack, get back, that's for her love\nI met her at a kick back, then I fell in love\nWhy do I always fall for the bad ones?\nShe turned a happy boy into a sad one\nNiggas fake, make believe, they don't stand a chance\nBitch, I'm 2Pac when I hit 'em up\nFell asleep, off the lean\nYou a dead bitch if you wake me up (Up)\nShe told me she gon' suck my dick on camera (Flash)\nFuck her, all them Perkies, I got stamina (Smash)\nWe can fuck but first you gotta fuck my manager (Smash)\nNo broke niggas allowed, MGM'er (Look)\n\n[Chorus: Juice WRLD]\nWhy do I always fall for the bad ones?\nShe turning every boy to a sad one\nAyy, she turning every boy into a mad one\nI guess I'll be pissed off until the price comes (Yeah)\nToo much drugs (Yeah), I can't breathe (Yeah)\nAvalanche (Yeah), pick me up, 911\nToo much drugs (Yeah), I can't breath\nWho me? Nah, I'ma live forever, uh\n\n[Verse 2: Juice WRLD]\nI'm a loner and a stoner at the same time\nThat lil' bitch don't like to read but she love lines\nDealing with this heartbreak all the time\nPerkies killing my pain, I'll be fine\nShe say she a freak in the sheets, yeah\nI love her physique, she's a beast, yeah\nIf that bitch a feast I'ma eat, (Yeah, yeah)\nI don't go to bitches, bitches come to me (Yeah, yeah)\nOoh, you know that I speak the truth\nYeah, he fell in love with you, but it's not so simple\nThrow a band, watch her get low like Lambo\n\n[Chorus: Juice WRLD]\nWhy do I always fall for the bad ones?\nShe turning every boy to a sad one\nAyy, she turning every boy into a mad one\nI guess I'll be pissed off until the price comes (Yeah)\nToo much drugs (Yeah), I can't breathe (Yeah)\nAvalanche (Yeah), pick me up, 911\nToo much drugs (Yeah), I can't breath\nWho me? Nah, I'ma live forever, uh", "image": "https://images.genius.com/1ff8ab8d3ae5bb47f0797a87d42ddf66.1000x1000x1.jpg"}], "artist": "Juice WRLD"}