{"songs": [{"title": "Fuck a Hook", "album": "M.I.C. (Make it Count)", "year": "2004-10-26", "lyrics": "[Intro: Royce Da 5'9\"]\nDJs and MCs!\nComin' up next is the incredible!\nWe takin' it back to the beats and the rhymes!\n\n[Verse 1]\n5'9\" is back, about to make a nigga spin on his back\nNot on a cardboard, on the ground with people surroundin'\nLookin' down at him; lookin' astounded\nReady to draw 'round him an outline of his body in chalk form\nThis nigga here let the trigger talk for him\nHis niggas'll bark for him, for real, his heart's warm\nSo you've been warned\nI don't even need to be drunk forever, the liquor is rootin' me on (go, go, go, go, go!)\nI turn tables fast as Jam Master Jay do\nI'm N.W.A., I choke hoes like Dre\nPoke holes in the pavement, throw foes in the grave\nIf you could choose between a broke nose or the AK\nI make movies like Cube 'cept I use hammers\nYep! I shoot but I don't do it with cameras\n(Nope!) So you can call me Malcolm\nYou can all witness what I be doin' to all of these rappers (yes!)\nWith y'all sloppy tactics; don't try to copycat me\nIf you ain't tryna box me back\nAnd watch your back, don't take another look into the eyes\nOf a nigga that's willin' to ride 'til he blind\n\n[Hook]\n(Fuck a hook... fuck a hook...)\nChka-chka-chka, Royce... 5... 9!\nYeah, and it's on\n(Fuck a hook... fuck a hook... fuck a hook...)\nChk-chka-chka-chka\nI will rhyme all day, yes!\n\n[Verse 2]\nI'll show you the back of your brain\nSlap you with the back of the gun\nClap you when the rappin' is done\nI aim to hit, I pack MACs, accurate ones\nChange the clip, I send rappers back where they from\nChangin' fast, the game I ask is not a sport\nI'm tired of bein' a fuckin' day late and a dollar short\nAnd I'm back! All of you rap niggas hide your mics\nI'm ridin', dyin', and I ain't flyin' by on them bikes\nI'm walkin', talkin', you eye me you dyin' tonight\nThis iron is showin' you the shine designed by Christ\nAnd I am the head reaper about the sick shit\nYou about to see dead people without the \"Sixth Sense\"\nAnd yeah, takin' food off my mother's table'll\nGet you killed regardless like my brother's label\nMy heart and arteries a part of me that'll test the truest\nWe can do it, put your vest into it, yeah\n\n[Hook]\n(Fuck a hook... fuck a hook... fuck a hook...)\nChka-chka-chk\n(\"You don't wanna play with him today\")\nYeah, No!\nYeah, hardcore! Rhymes galore!\n(Oh!) Givin' you what you need!\nLike I told you before!\n\n[Verse 3]\nYeah, the rap game is dead, I'm 'bout to breathe life in it\nBring it back to when niggas was cypherin'\nYeah, back in the day, when nobody needed radio play\nI was straight long as my radio played tapes\nAnd this went on before all of them pay dates\nWe was backflippin' and windmillin' to save face\nThese days, we'll give you the MAC so stay in your place\nI hope before you lay on your back, you sayin' your grace (pray!)\nThese new cats that rap to me, they groupies\nYou never see 'em in Max Julius or them Guccis\nOr they woulda got robbed for them Diadores\nOr the Gazelles, we the store, we take, we sell your\nItems we took, have you goin' to tell\n(We crooks) we either goin' pro or goin' to jail\nI know I'mma spare (many) lives\nThis rap shit is comin' with me, 'cause don't nobody know how to share\n\n[Hook]\n(Fuck a hook... fuck a hook... fuck a hook...)\nChka-chka...\n(\"Get in your mind—\nGet in your mind—\nGet in your mind all day!\")", "image": "https://images.genius.com/cd9172649c4be5e25b673a95fee73f73.400x400x1.jpg"}], "artist": "Royce da 5'9'’"}