{"songs": [{"title": "Just a Man", "album": "Young Sinatra: Welcome to Forever", "year": "2013-05-07", "lyrics": "[Verse 1]\nYeah, this is my vision\nWritten without second thought or revision\nThe type of shit that affect you like an oncoming collision\nThat just make you freeze, drop to your knees and beg 'em\nPlease Lord, forgive me for gripping a semi now\nWhen searching for God all I ever do is stare up\nWhile Satan sending me women\nWearing nothing but they hair up\nGot the condom on the dresser, I can't wait to undress her\nWould you think lesser of me if I did it?\nCause I get lonely, I'm human, and boy it's been a minute\nFresh out the states, surrounded by women that wanna hit it\nBut should I take the pussy just cause I could get it?\nOr do I want something that's more committed?\nGod damn, it's hard to admit it\nAs you focus on the little things, the bigger ones will get you\nSo I minimize the negatives to see the bigger picture\nI get richer while you fuckers hate\nSo keep it up and watch a young brother elevate\nI'm black and white but racism I still cannot evade\nI never understood the concept, even to this day\nYou know we're all the same in the eyes of a blade\nBecause when men shed blood it's still the same shade\n\n[Hook]\nThat's why I'm just a man homie\nFlesh and blood, I'm just a man\nBut I don't think they understand homie\nI ain't perfect, I'm just a man\nYeah, y'all think I'm more than just a man\n\n[Verse 2]\nI contemplate on the daily if I'll survive and strive\nTo be the greatest lyricist dead or alive, I gotta prevail\nThat's my word like excel\nWent from a small town in West Deer Park to XXL\nNow we shopping at Louis V, back in the day it was Ross\nThey calling me the savior, hope they don't give me the cross\nNow that's the realest shit you ever heard\nNever in the streets but I was closer than the curb\nDo you feel me?—Whole world wanna kill me\nSigned a deal but I'm still me—in five years will I still be?\nEver since I was a youngin this is all I've ever wanted\nAlways kept it real while they perpetrated and fronted\nI was in the studio while they was gettin' blunted\nAlways have my doubts but deep down I knew I'd run it\nSportin' Armani like menage a trois that's double breasted\nA lot of time I've invested and never once have I rested\nFeeling nervous like when you getting tested\nThe game is over saturated, completely infested\nThe greatest story ever told, realest song ever written\nTo hell with a Plan B, motherfucker I ain't kiddin\nI''m just trying to get this money, I'm just trying to get paid\nThat's the type of mentality put careers in the grave\nFuck how much you made\nWhat's it worth if your memory fade?\nNow I ain't perfect, on occasion I'm strayed\nIt's been forever since I prayed and I guess today is the day\nSo I step in the booth and treat that shit like a confessional\nThinking back as I reminisce\nWondering; does God even exist?\nA man of faith but mentally I feel at risk\nWhat you want from me, where am I supposed to go?\nSeems like you never talk, tell me how I'm supposed to know?\nI'm just a man, I ain't perfect—is this life even worth it?\nIt's time to dig up the past so fuck it let's unearth it\nLike my childhood, living free like a child should\nRemember the time I opened the bedroom door crack?\nAnd saw my daddy smoking more crack?\nNo food in my house, we just couldn't afford that\nMomma drinking, sleeping until five\nBut she always seemed to get up whenever men arrived\nFeeling alone at like eleven\nSegregated from the other kids like it was 1957\nI've loved, I've hated, I've cried, I've died inside\nI've resurrected but don't neglect that I've modified\nI'm stronger, faster, better than ever before\nAnd everything I've been through can honestly assure\nI'm no less, no more\n\n[Hook]", "image": "https://images.genius.com/da76d57af3e6ee702af91bac2a18326a.1000x1000x1.jpg"}], "artist": "Logic"}