{"songs": [{"title": "Don’t Tell Smokey Doe (Novi Novak Diss)", "album": null, "year": "2011-03-12", "lyrics": "Yo, I'll do me and you do you\nTell the world how you fake all your Youtube views\nUsing Wiz Khalifa's name just to boost you through\nNot only hoes trip, but apparently you do too\n\nYou kinda sick, but homie I'm like the swine flu times two\nYou wanna take it off tracks? Fuck it. I'll fight you\nYou stupid as your dumb fan puppets you lie to\nTelling them all that Lil wayne wanted to sign you\nBullshit thats a bunch of crap\nTheres no proof Wayne gave you a contract\nWhats up with that?\nAnd if he did put one up for grabs\nYou turned it down cause he wouldn't kiss you like he does his dad\n\nFuckin' fag back down or get burnt quick\nYou like the confidence I gave you on first diss?\nIt was on purpose, I knew if I threw the first hit you'd respond\nNow I'll prove that you ain't worth shit\n\nAm I a beast? Of course it is true\nI strangle Novi in his booth\nUsing his mic cord as a noose\nBoard up your room, you're doomed\nBy my whole rep of tunes\nAnd soon\nYour fans gonn' turn on you\nLike some wicked goons\n\nI don't care to pull your card, you deserve it\nYou're the reason white rappers have it so hard\nYou actin' tougher than a\nNappy afro that won't part, but you're like a mannequin, all body with no heart\nYour whole game is whack, Novi Novak?\nC'mon, be real.. what kinda name is that?\nYou a shameless act, who's lame, infact\nYou try to gain fame\nPretend like you were raised with blacks\n\nBlack psychos? You're glad I can't be called that\nI'm only crazy over Raw tracks\nBut you ain't nuts either nigga, so fall back\nClosest thing you ever been to nuts is lickin' your daddy's ballsack\n\nYou bullshittin' sayin' Hop sucks\nYou smoke a lot, but I'm one hit of dope you should not puff\nYa I heard your diss, it was hot stuff\nI see you Googled my name\nI tried yours, nothing popped up\nYou act like you the hugest star\nYou strung out like a used guitar\nYou couldn't get a hit standing in front of a moving car\nThe only time you tour is at an amusement park\n\nStop denying it you can't hold me\nThe flow is nastier than anchovies\nDon't be up at my show in Chicago tryna act like you my damn homie\nFuck Swag City followers, and Novi", "image": "https://images.genius.com/1620b55458e423f96bf6316d13418223.1000x1000x1.jpg"}], "artist": "Hopsin"}