{"songs": [{"title": "Picasso", "album": null, "year": "2019-05-08", "lyrics": "[Verse 1]\nHollywood, Hollywood, oh how I fuckin' love you\nI cannot seem to break through from this curse that I've been stuck to\nI came in as a lil man but now my fuckin' nuts grew\nToday's the day our ties are finally cut loose, fuck you\nUh-oh, it's my triflin' ass (Uh-oh)\nPullin' up like, \"Hi guys, I'm back!\" (Hi)\nGoddamn, nigga, I'm so up that I can't get down\nGotta skydive from that (Yikes!)\nWon't see the day I might relax\nI ain't never been a nice guy, in fact\nY'all wishin' I would try nicer raps\nSorry, I ain't got the right mind for that (Uh-uh)\nLook how cold he is, pimpin' just like H-O-V is\nY'all are beyond saving and my rhymes stay inappropriate\nThis is just how my show begins\nIf you hatin', come blow me then\nFuck you, here's some petroleum\nGive me my clout, you owe me it (Yeah)\nWhoa! Niggas better duck and run for cover like it's fuckin' Iraq\n(Stand down, nigga!)\nI'm pouring liquor for your ass, you ain't even die yet (Oh no!)\nI've been headin' up the ladder long enough\nIt's time I hit the climax (Yikes!)\nYour career's goin' bye-bye, it's ironic you don't got a bypass\nNiggas know that I've been ill\nMan, the whole time that I've been here\nI done made a fortune like ten mil'\nFrom the paper lines that my pen fills\nAnd if I don't spend it, my kids will\nI'm low-key but a big deal\nHoes see me and they freeze up, that's why they all on my dick still\n\n[Pre-Chorus]\nThey tell me I'm too hostile, I am Picasso\nBitches like, \"Remember me from high school?\" Nah, ho\nCame up in this shit killin' niggas with the hot flow\nY'all ain't got a fuckin' thing on Hop, whoa\n\n[Chorus]\nBoy, you better rock slow\nWho am I? I'm Picasso\nTake the high road\nASAP 'cause I ain't liable\nFor no nigga (Nope!)\nMy fuckin' head is in the cosmos\nGot it locked though\nBitch, I'm Pablo Picasso (Mhm)\n\n[Verse 2]\nI've been told the new game plan's\nTo make bullshit for the new age fans\nAnd you can't pop unless you take Xans\nAnd flex on the 'Gram like you do make bands\nWhat? Oh no, they like, \"Fuck boom bap rap, you can't win\"\n\"Save that shit for the Wu-Tang Clan\"\nThat's when I bust in like the Kool-Aid Man (Yeah!)\nLook, I ain't the nigga who pullin' up\nTryna get shine by how much the Rollie glow (Nah)\nI'm here to rain on parades\nMy sinister ways to fuck up the rodeo (Woo!)\nI do my shows and hoes\nBe losin' control like I was the Holy Ghost (Stop!)\nWhen I deliver the penis it lies in the mouth, she call it Pinocchio\nMmm, man, who want war with me?\nBitch, I torture beats, I've been born to beast\nStill I abort MC's, oh so horribly\nDog, your corpse'll be right on the floor with these\nFeet that I'll stomp you out with\nThis my house, bitch, and you can't afford the lease (Watch out!)\n(Whoa) Fuck all that Hollywood shit\nOver half of you not even lit that be ridin' my dick\nI got no problem with this\nI come through and your body is zipped, I could hardly resist\nNigga, my hobby is pissin' on anyone I can offend\nI got no friends\nWhoever thinkin' they hot, go and tell 'em nobody's convinced, hmm\n\n[Pre-Chorus]\nThey tell me I'm too hostile, I am Picasso\nBitches like, \"Remember me from high school?\" Nah, ho\nCame up in this shit killin' niggas with the hot flow\nY'all ain't got a fuckin' thing on Hop, whoa\n\n[Chorus]\nBoy, you better rock slow\nWho am I? I'm Picasso\nTake the high road\nASAP 'cause I ain't liable\nFor no nigga (Nope!)\nMy fuckin' head is in the cosmos\nGot it locked though\nBitch, I'm Pablo Picasso\nRock slow\nWho am I? I'm Picasso\nTake the high road\nASAP 'cause I ain't liable\nFor no nigga (Nope!)\nMy fuckin' head is in the cosmos\nGot it locked though\nBitch, I'm Pablo Picasso (Mhm)", "image": "https://images.genius.com/199f96c069506598096f3b2a18847c53.1000x1000x1.jpg"}], "artist": "Hopsin"}