{"songs": [{"title": "It Is What It Is", "album": null, "year": null, "lyrics": "[x16](Hopsin)\n\n[Verse 1: Hopsin]\nI'm a radical nuisance, and I'm back on my bullshit\nWent from lashing on ruthless to hanging rappers from nooses\nYou ain't gotta like me, but like a magnet and you stick\nBreaking these niggas was easy like snapping a toothpick\nYour whole gimmick's a fraud, you just casting illusions\nThat's how niggas get ran up on and cracked with a broomstick\nWatch what my promo does to your whole buzz, you're dead\nI don't show no love to homo thugs\nMy haters never show they face, they usually try to hide, but when they see me at my shows, I'm who they truly idolize. (I LOVE YOU!) I keep a handful of ugly groupies I deny, knowing if they ever showed up at my crib by surprise. (What the fuck?)\n\n[Verse 2: Jaylenz]\nNiggas gonna recognize, we the coldest niggas [?] shit\n[Adlib:Hopsin](Huh?)\nI been off for a minute, now I'm back in this bitch. I'm going off [?], bitch I been ripping this\n[Adlib:Hopsin](What?)\nAny minute and I'm with it, come and get it cause I been killing it\n[Adlib:Hopsin](Uh-huh)\n[Adlib:Hopsin](Get it)\n[Adlib:Hopsin](Oh)\n\n[x3](It is what it is)\n\n(I been up on this, I'm a motherfucking selfish cat. Quick to walk on niggas like a welcome mat. Wassup?)\n\n[x2](It is what it is)\n\n(So bitch suck a dick, the kids busting sick. I'm a motherfucking selfish cat, quick to walk on niggas like a welcome mat. Wassup?)\n\n[Verse 3: Jaylenz]\nYo, it is what it is, [?] for the kids\nBreak into your crib and stick a fucking pen through your rib\nI'll get you pinned to the fridge as I empty this clip into the cat and dog, and get to fucking busting like I'm jacking off\nI laugh it off when it comes to the thought of death and shit\nGot the angel and devil on my shoulder steady wrestlin'\nCheck inside your mom, you'll most likely find my specimen\nMy jizz will paint her face whiter than the forty second president\nQuietly evident, popping medicine just to get me off\n[?] and bungee jump with some dental floss\nHit from the back so hard, you see my penis is her jaws\nGo deeper and give birth to myself while she in menopause\nIt's probably my potty mouth that got you mad, cause I'm a motherfucking grouch hopping in trash, and smoke [?]'s ass\nMy dick's harder than jerking off with a doctor's cost, shot his ass, then hide in the same spot that 2Pac is at\n\n[x4](It is what it is)\n(I been up on this, I'm a motherfucking selfish cat. Quick to walk on niggas like a welcome mat. Wassup?)\n\n[x2](It is what it is)\n(So bitch suck a dick, I been up on this. The kid's busting sick. I'm a motherfucking selfish cat. Quick to walk on niggas like a welcome mat. Wassup?)\n\n[x8](Suck a dick)\n\n(Hopsin)", "image": "https://images.genius.com/1620b55458e423f96bf6316d13418223.1000x1000x1.jpg"}], "artist": "Hopsin"}