{"songs": [{"title": "Memories (Part II) - Album Version (Edited)", "album": null, "year": null, "lyrics": "[Big Sean - Verse 1]\nSometimes I dream bigger than I live\nSometimes I think better when I'm lit\nSo go head and light it\nRoll it up, ignite it\nOne time for all my niggas that dreamed it than real life'd it!\nI swear I've been through everything in life but a coffin\nThey say sky's the limit, how bitch? I'm moonwalking!\nAnd my middle name Michael hoe\nSuccess is my idol and being broke is my rival\nBut it's because I got the title hoe\nSee I just want my fantasies and real life\nYou got everything to me what it feel like\nMuthaf-ck the radio if I can't hear mine\n\nThey give the wrong niggas more airtime than airlines\nIs you feeling me?\nIf not you feel my energy\nSee I know I'mma make it, but even if I don't\nDon't feel bad cuz honestly all these times that I had\nThose will be the best memories\n\n[Chorus]\nBe the best memories\nI hope that you remember me\nThese will be the best memories\n\nOoooh ohho ooooooooo\nCuz in the end all you really have is memories\nOoooh ohho ooooooooo\n\n[Big Sean - Verse 2]\nAre you willing to give up what you love, for who you love\nOr lose your girlfirend to groupie love\nEverywhere I go I get a group of hugs\nThats what happens when they need connections and you the plug\nHow many trends you gotta set before you considered great\nHow many missed calls before you considered fake\nHow many dreams before its considered fate\nI'm eating in a World where I'm considered bait\nA workaholic addicted to bills\nPeople addicted to me cuz they addicted to real\nMy best friend got addicted to pills\nI can't look at him in his eyes, you don't know how that shit feels mentally!\nI ain't trying to rock no shirts that say \"in memory\"\nI'm praying that he make, wished we could go back\nCuz honestly all the times that we had\nThose be the best memories...\n\n[Chorus]", "image": "https://images.genius.com/1db10915bf07ae763610bb53d1717887.1000x1000x1.jpg"}], "artist": "Big Sean"}