{"songs": [{"title": "Sh!t (Remix)", "album": "No Sleep ", "year": "2013-12-17", "lyrics": "[Intro: Future]\nEar Drummers\nMike WiLL Made-It\nAyy!\nAyy!\nAyy!\nAyy!\nShit!\n\n[Chorus: Future]\nTalking 'bout you popping tags, nigga you ain't bought shit\nTalking 'bout a hunnid bottles, nigga you ain't popped shit\nAll you talk nana clips, nigga you ain't shot shit\nSpending money on these hoes, nigga you ain't fuck shit\n\n[Verse 1: Drake]\nTook niggas out the hood like I'm from there\nSo you know it's all good when I come there\nI hear you talk about your city like you run that\nAnd I brought my tour to your city, you my son there, nigga\nBut I had to come through for the remix\nOn my haven’t-done-a-verse-in-eight-weeks shit\nAnd if a nigga say my name, he the hot shit\nBut if I say the nigga name, he still the hot shit\nFucked up, lucky I don't feed into the gossip\nNiggas act like they don't know, but they should know\nYeah, I just think it's funny how they dangling the bait\nBut I'm the one that's killing niggas on the hooks, though\nAnd niggas ain't got a grill, still ice-grill hating\nI know y'all already know Mike Will Made It\nJust looking at the numbers, nigga, I feel amazing\nI'll call Michael Jordan up and Mike will make it\nI'm the young rap nigga with the 'Melo deal\nYou need to come to OVO for a better deal\nJust know a million ain't shit once you get a mil'\nAnd niggas say it’s all good\nThat’s how you better feel, nigga, nah!\nFuck that, this year I'm talking big stuff\nRolling through the city like a young nigga bricked up\nFuck niggas gon' be fuck niggas\nThat's why we never gave a fuck\nWhen a fuck nigga switched up, damn!\n\n[Chorus: Future & Juicy J]\nTalking 'bout you popping tags, nigga you ain't bought shit\nTalking 'bout a hunnid bottles, nigga you ain't popped shit\nAll you talk nana clips, nigga you ain't shot shit\nSpending money on these hoes, nigga you ain't fuck shit\nMike-Will Made It! Let's get it! (Ma-fi-UH!)\n\n[Verse 2: Juicy J]\nIf money talk then your pockets ain't saying shit\nI'm in the bathroom getting head from yo' bitch\nAnd I ain't paying her shit\nYou want beef? You don't know who you playing with (Hey!)\nI tell my pilot to land the jet (Hey!)\nI'm hopping off, get 'em, we popping off (Hey!)\nGive a click and you niggas dead where you standing at (Hey!)\nI'm just a trippy nigga smoking on cabbage\nYour money funny like Jim Carrey\nI got a bitch and she super bad like Halle\nAnd we still keeping that white like Barry\nI'm a rich nigga, still keep a pistol with me\nNigga, you ain't fuckin' with a picture of me\nI got all this cake and shooters with me\nJust in case you pussy niggas try to get you a piece\nWhat it is, my nigga? What it's hittin' for? (Hey!)\nWhere the car you were whippin' in you video? (Hey!)\nWhere the ice at, nigga? Where them pretty hoes? (Hey!)\nYou a fraud, real niggas already know (Hey!)\nBroke-ass niggas, I can't stand 'em (Hey!)\nI hit 'em with the cannon\nI'm buying off the mall at random (Hey!)\nJuicy J, that nigga fresh to death (Hey!)\nSmoke it 'til it's nothing left\nPeel off, then I'm ghost in my Phantom\n\n[Chorus: Future]\nTalking 'bout you popping tags, nigga you ain't bought shit\nTalking 'bout a hunnid bottles, nigga you ain't popped shit\nAll you talk nana clips, nigga you ain't shot shit\nSpending money on these hoes, nigga you ain't fuck shit", "image": "https://images.genius.com/a977a7360ae6031ae204635b7abe34b0.500x500x1.jpg"}], "artist": "Future"}