{"songs": [{"title": "Grand Finale", "album": "Faces", "year": "2014-05-11", "lyrics": "[Intro]\n\"The hallucinations have stopped, finally, thank God, but uh, my adrenaline reserves are burning out and I'm staring straight into the face of a total psychotic freakout\"\n\n[Verse 1]\nAnd if by chance this is my grand finale\nBury me in Allegheny County\nIt's the most hated, so faded that I'm bow-legged\nDon't bathe, gross gang, smell like old lo-mein\nShit, the flow dangerous, make you wanna do the wave\nThrow your bitch right off your lap and start a standing ovation\nThe most strangest, master of the ceremonies\nA fifth of Stoli then it’s only Cher and Moby karaoke\nMy bitch a shooter, call her Annie Oakley\nGet you for a pair of Kobe's, just got out on probation\nAnd no famous friends for me, just old faces\nI only go places wasted like I'm Joe Namath\nNot a king, I'm no David, music, I'm a crackhead\nNo hobbies and recreation, don't even know my address\nSelf medicate, self education\nRick Rubin showed me transcendental meditation\n\n[Hook]\nLet us have a grand finale\nThe world will be just fine without me\nThe clown got a smile on his face\nSlow it down, we goin' out with a bang\nAre you ready for the fireworks?\nIt was a silent night 'til the fireworks\n\n[Verse 2]\nYeah, ok, I fear nothin' on this odyssey of dark roads\nGod lives in my dog's soul, the devil in his dog bowl\nWe are the prophets, Jesus was a poor sport\nHe booted Nostradamus, turned water into wine\nBut he loved the gin and tonic, had skeletons in his closet\nEven God will one day be forgotten\nAnd recently I've been feelin', I've been feelin' like\nIt'd be really nice to get to sit with Mickey Weiss\nShoot the shit 'bout life, he'd be pissed I'm sniffin' white\nNever got to see me grow up, how long it take to live a life?\nI'm a bit surprised that I'm even still alive\nMixin' uppers and downers, practically suicide\nMy old Jewish mind, REMember music, you'll be fine\nAnd I make my own beats now, if you behind\nHallucination's how I use my mind\nWho am I?\n\n[Hook]\nLet us have a grand finale\nThe world will be just fine without me\nThe clown got a smile on his face\nSlow it down, we goin' out with a bang\nAre you ready for the fireworks?\nIt was a silent night 'til the fireworks", "image": "https://images.genius.com/cb728ec66cfad5964e15291c3c4a294c.375x375x1.jpg"}], "artist": "Mac Miller"}