{"songs": [{"title": "Under the Influence", "album": "The Marshall Mathers LP", "year": "2000-05-23", "lyrics": "[Hook: Eminem]\nChem-le-le-le-le-le-le-le, le-le, le-le\nChem-le-le-le-ne-miah-nuf-niah, ne-nish, ne-ne\nTranslation:\nSo you can suck my dick if you don't like my shit\n‘Cause I was high when I wrote this, so suck my dick!\n\n[Verse 1: Eminem]\nTwo pills I pop, 'til my pupils swell up like two pennies\nI'm Clint Eastwood in his mid-twenties\nA young-ass man with a trash can, strapped to the back\nOf his ass so the rats can't chew through his last pants\nI'm like a mummy at night, fightin' with bright lightnin'\nAnd frightened with five little white Vicodin pills bitin' him\nI'm like a fuckin' wasp in the hospital, lost\nStingin' the fuck outta everything I come across in the halls\nI light a candle and place it up on the mantel\nGrab a knife at the blade and stab you with the fuckin' handle\nSo when you find yourself wrapped up in the blinds, hurtin'\n(Bitch, it's too late)\n‘Cause once you're hung from the drapes, it's curtains\n\n[Verse 2: Swifty]\nI'm an instigator, .380 slug penetrator\nDegradin', creatin' murders to kill haters\nAccused for every crime known through the equator\nThey knew I did it for havin' blood on my 'gators\nMy weed'll hit your chest like a double barrel gauge and\nI'm a black grenade that'll blow up in yo' face\nWith a fifth in me, when I guzzle Remy I do shit on purpose\nYou never hear me say, \"Forgive me\"\nI'm snatchin' every penny, it gotta be that way, nigga, face it\nThat weed I sold to you, Brigade laced it\nYou hidin', I make the President get a facelift\nNiggas just afraid, handin' me they bracelets\nChillin' in the lab wasted, I'm the type\nThat'll drink Kahlua and gin, throw up on the mic\nYour life is ruined, you get socked right on sight\nAnd even at the Million Man March, we gon' fight\n\n[Hook: Eminem]\nSo you can suck my dick if you don't like my shit\n‘Cause I was high when I wrote this, so suck my dick!\n‘Cause I don't give a fuck if you don't like my shit\n‘Cause I was high when I wrote this, so suck my dick!\n\n[Verse 3: Bizarre]\nI'm a compulsive liar, settin' my preacher on fire\nSlashin' your tires, flyin' down Fenkell and Meyers\nPlates expired, soon as I'm hired I'm fired\nJackin' my dick off in a bed of barbed wire\n(Hey, is Bizarre performin'?) Bitch, didn't you read the flyer?\nThe special invited guest will be Richard Pryor\n(Aren't you a male dancer?) No, bitch, I'm retired\nFuckin' your bitch in the ass with a tire iron\nI'm ripped, I'm on an acid trip\nMy DJ's in a coma for lettin' the record skip\nLettin' the record skip, lettin' the record skip (Damn!)\nI'm fuckin' anything when I'm snortin'\nIt's gonna cost 300 dollars to get my pitbull an abortion\nSome bitch asked for my autograph\nI called her a whore, spit beer in her face and laughed\nI drop bombs like I was in Vietnam\nAll bitches is hoes, even my stinkin'-ass mom\n\n[Verse 4: Proof]\nAyo, flashback, two feets, two deep up in that ass crack\nWeed laced with somethin'– nigga, pass that!\nIn Amsterdam we only hang out with hash rats\nAt a \"Stop the Violence\" rally, I blast gats\nBMI on publishin'; get yo' ass capped\nThe Kuniva, divide up yo' cash stack\nRun yo' motherfuckin' pockets, ASAP\nI don't need a platinum chain, bitch, I snatched Shaq's\nBorn loser, half thief and half black\nBring your boys and your guns and get laughed at\nBitch smacker, rich rappers get they Jag jacked\nAnd found chopped up in a trash bag\n\n[Verse 5: Kuniva]\nWe stranglin' rappers until the point they can't yell\n‘Cause they crew is full of fags and sweeter than bake sales\nReckless, come from behind and snatch your necklace\nGruesome, and causin' more violence than nine hoodlums\nI grapple your Adam's apple until it crackle\nRun right past you, turn around, grab you and stab you\nGet executed, ‘cause I'm a Luni, I got a Yukmouth\nAnd it's polluted; I cock it back, then shoot it\nI love snatchin' up players, thugs and young ballers\nShoot up the household, even the young toddlers\nBrigade barricade to bring the noise\nWhile the bullets break your bones up like Christmas toys\nIf I go solo, I'm doin' a song with Bolo\nA big Chinese nigga screamin', \"Kuniva, yo, yo!\"\nI leave ya face leakin', run up in church\nAnd smack the preacher while he's preachin'\nTake a swing at the deacon\n\n[Verse 6: Kon Artis]\nI used to tell cats that I sold weed and weight\nI was straight 'til I got caught sellin' them shake\nI'm ignorant, with the intent to snatch your rent\nI got kicked out of summer camp for havin' sex in my tent\nWith the superintendent's daughter, my brain's out of order\nI've been a Kon Artis since I was swimmin' in water\nIn cahoots with this nigga named Carlisle Von\nWho got fired from UPS for tryin' to send you a bomb\n(Special delivery) I sign to a local label for fun\nSay I got cancer, get dropped, take the advancement and run\nDrive-by you in the rain while you carry your son\nCall your house and hang up on you for not givin' me none\nBorn straight up out a pussy but a son of a gun\nGot a reputation for havin' niggas runnin' they funds\nUsed to be the type of nigga that was foldin' some ones\n'Til I met your fat mama, now I'm rollin' in dough\n\n[Hook: Eminem]\nSo you can suck my dick if you don't like my shit\n‘Cause I was high when I wrote this, so suck my dick!\n‘Cause I don't give a fuck if you don't like my shit\n‘Cause I was high when I wrote this, so suck my dick!\n\n[Outro: Eminem]\nHa-ha! Suck my motherfuckin' dick!\nD12, Dirty-motherfuckin'-Dozen\nNasty like a stank slut bitch with thirty fuckin' husbands\nBizarre Kid, Swifty McVay, the Kon Artis\nThe Kuniva, Derty Harry, and Slim Shady", "image": "https://images.genius.com/e7f2305258d668431f8e250a41f3459f.1000x1000x1.png"}], "artist": "Eminem"}