{"songs": [{"title": "The Fiends Are Knocking", "album": "Knock Madness", "year": "2013-11-26", "lyrics": "[Chorus]\nThe fiends are knocking at my door\nShould I give them what they're asking for?\nThey want it (want it)\nNeed it (need it), have it (have it)\nWoah—oh (woah)\nYeah, yeah, yeah\nKnock Madness\nSo what the fuck y'all need from me?\nI'm here to make these fiends believe\nThey want it (want it)\nNeed it (need it), gotta have it (have it)\nWoah—oh (woah)\nYeah, yeah, yeah\nKnock Madness\n\n[Verse 1]\nYeah, I promised you niggas a album\nYou been patiently waiting, now the day is finally present\nI took my time with this shit\nI put my mind into every line, 'cause when it's out I ain't tryna regret it\nNiggas get overhyped and all they hits go stale\nBecause they shit don't sell, now that's a big old fail\nBut the punch is a lot harder when you clip your nails\nNiggas, how you expect to drive when you ain't get your L's?\nYou was the next big thing while I was last\nYou was poppin' tags while I was mad chillin' in my pad with my rhyming pad\nTryna record with no door so I hear my mom and dad\nArguing upstairs so I gotta wait 'til the drama pass\n'Cause my mic be picking that shit up\nBut I ain't wanna give up, I'd exhale fast even if I did suck\nYou want the madness? Then come and get some\nI'm takin' the cake, and all that's left for y'all is the pieces I bit from\nSee I ain't buddy-buddy with rappers because that shit is fake\nMost of y'all morals is fucked up, you on a different page\nYou get no props just 'cause you getting paid\nIf you garbage we ain't doing business, point blank, I discriminate\nAnd I don't do no bullshit collabs to get my name poppin'\nThat ain't even considered a safe option\nAnd that just ain't Hopsin, I paid homage, now I'm straight wilin'\nNow turn this shit up while the bass knockin', now c'mon\n\n[Chorus]\nThe fiends are knocking at my door\nShould I give them what they're asking for?\nThey want it (want it)\nNeed it (need it), have it (have it)\nWoah—oh (woah)\nYeah, yeah, yeah\nKnock Madness\nSo what the fuck y'all need from me?\nI'm here to make these fiends believe\nThey want it (want it)\nNeed it (need it), gotta have it (have it)\nWoah—oh (woah)\nYeah, yeah, yeah\nKnock Madness\n\n[Verse 2]\nAnd I be gettin' comments like\n\"Hop, what's the hold up with your new shit, man?, you be taking forever son\nYo I'ma stop waiting, I'm getting my hopes up\nWith your work ethic it ain't gon' ever come\nYou had the XXL cover in 2012\nAnd I thought you would soon prevail, but homie, you ain't doing well\nYou hit us with that Ill Mind shit and that was cool as hell\nBut when it comes to your album, you never got no news to tell\nYour whole career is just a train wreck\nYou toured around the world for 3 years, but you always performed the same set\nI been asked you to come to my city, but you ain't came yet\nI guess you ain't in it for love, you just want that pay check\nIf I was you, then I wouldn't be too proud\nYou signed Dizzy not too long ago and he's bigger than you now\nYou said you saving hip-hop, well, save this shit\nAnd all I hear is wack niggas and I hate this shit\nHomie I stopped being a scrub because of you\nI stopped playin' these bitches in the club and fell in love because of you\nMy dad heard your song and he stopped doin' drugs because of you\nI learned to rap and even built a little buzz because of you\nBut you take it for granted, thinking you have it made\nSittin' back in the shade, Hopsin, there's people that you have to save\nThis is beyond music\nYou speak life into these motherfuckers, Hop, you have a gift, so when you gon' use it?\"\nDamn, I have that much of an impact?\nMy rhymes did that? Sometimes, I really feel my shit's wack\nThat's why I kick back, but fuck this shit, yo, where my pen at?\nI'm 'bout to kill this shit and make niggas just wanna quit rap\nI'm causing havoc, layin' the rappers like a hammock\nIf I want the fucking planet, I can have it, now try to snatch it\nOnly God can stop my violent habits\nYou niggas average, I ain't even in my prime and still I'm twice the savage\nC'mon\n\n[Chorus]\nThe fiends are knocking at my door\nShould I give them what they're asking for?\nThey want it (want it)\nNeed it (need it), have it (have it)\nWoah—oh (woah)\nYeah, yeah, yeah\nKnock Madness\nSo what the fuck y'all need from me?\nI'm here to make these fiends believe\nThey want it (want it)\nNeed it (need it), gotta have it (have it)\nWoah—oh (woah)\nYeah, yeah, yeah\nKnock Madness", "image": "https://images.genius.com/89f3b594c1d21cb0ced76a0e54600701.1000x1000x1.jpg"}], "artist": "Hopsin"}