{"songs": [{"title": "How Life Changed", "album": "No Mercy", "year": "2010-12-07", "lyrics": "[T.I.]\nAy say K.T., I remember bruh, standin out ten of us\nFlip a bird, split it up, antenna stickin up\nFor crooked cops patrollin if the red dog rollin all the dope\nI'm throwin, fuck a jail, I ain't goin tonight\nQuick to pull a fo'-fo' in a fight\nUnder the street lights rollin the dice\nWe were so enticed, by niggas like slick money and ice\nWe figure prison it just come with the life, along with losin your life\nAnd there was no way we thought\nWe'd go to jail for e'ry case we caught\nFor all the yay we bought, not a dime did we say we borrowed\nBought damn near every pair of J's at the mall\nHad our way with the broads, hit the rink but we ain't skatin at all\nSeem like every other day we'd brawl, that A.K. on call\nWhen I think about all we done\nIt's amazin to see how far we've come\nRemember? Ay\n\n[Hook: Mitchelle'l]\nOhhh! Oh-ohhh!\nI remember walkin (walkin)\nDidn't have a dollar in my pocket (in my pocket)\nNow I'm watchin stocks like what's the options (options)\nUh-huh (uh-huh) uh-huh (uh-huh) how life's changed\nI remember hustlin (hustlin)\nTryin to keep these crooked cops off us (off us)\nNow I read about it in my office (in my office)\nUh-huh (uh-huh) uh-huh (uh-huh) how life's changed\n\n[T.I.]\nAy say C-Rod, remember days we was slangin the hard?\nIn a crib with no lights we used to stay in the dark\nRemember Cap and Mac Boney man, they were retarded\nI don't know who kept us laughin the hardest\nSince our stacks is the largest, didn't take us long to corner the market\nI remember every day was a party\n15, 16, was dreams of bein cocaine bosses\nIn pursuit of that we made so many terrible choices\nLike the time we made away with that millenium\nFrom the dealership before our day, wasn't we killin them?\nLate nights, gun fights, high speed chases\nSo close to the good life we tasted\nDamn the consequences pimp, if it's a chance we'd take it\nFirst case a month in juvenile and get probation\nWhen I think about all we done\nIt's amazin to see how far we've come\nRemember?\n\n[Hook]\n\n[Scarface]\nWe started small time, dope game hustlin that cocaine\nInterstate traffickin, high feelin no pain\nNumb to the fact that we was poisonin our own kind\nI ain't give a fuck, he gettin his so I want mine\nYoung'n with that attitude, somebody finna give me that\nI ain't give a fuck, how I got it, it was real as that\nSo if I had to peel a cap, somebody was dead then\nSince I'm a killer that's the condition my head's in\nCan't work too hard to get my money, I refuse to\nSlave for the next man who raised nigga, fuck you!\nThese streets are 9-to-5, you want it we can get it for ya\nAnd even though they steady changin this is still a hustle\nStill got them same rules, may not be the same game\nWe done found some brand new money, still we maintain\nThe same integrity we upheld in the street light\nLivin a motherfuckin dream nigga singin like\n\n[Hook] w/ Scarface ad libs", "image": "https://images.genius.com/f55abc725080eb05147e45ce3cd406a8.1000x1000x1.jpg"}], "artist": "T.I."}