{"songs": [{"title": "Bloodline Anthem", "album": "The Great Depression", "year": "2001-10-23", "lyrics": "[Hook: Dia]\nBelieve me! It's our TIIIIME now to let 'em know\n(WHAT?!) It's our TIIIIME now to let 'em know\nBelieve me! It's our TIIIIME now to let 'em know\n(WHAT?!) It's our TIIIIME now..\n\n[DMX]\nI like my blunts heavily hashed, bitches heavily assed\nJoints ready to stash, got 'em ready to blast (WHAT?!)\nGive 'em plenty and pass, the thing off (woo!) toss that\nGet pulled over, we already lost that, of course black (uh!)\nFloss that, lose that, get that? Come up off that\nYou ain't choose that, but you with that, now spit back (c'mon)\nY'all niggas got me all wrong (WHAT?!)\nI'm still a grimy nigga (WHAT?!)\nAnd I still give it to you, on your song (WHAT?!)\nI let you niggas live for a minute, you get goofy\nTold you go 'head, drop a few albums, I'll do a movie (aight)\nBut when I come back, c'mon dog, respect my slot (UHH)\nAin't no get in where I fit in, bitch I'm straight to the top (aight)\nAnd whoever don't like it, FUCK YOU FAGGOT, bring it! (WHAT?!)\nNigga don't wanna walk it but, stay tryin to sing it\nWhat I gotta start smackin you guys around again?\nDon't make no motherfuckin sense, y'all some grown ass men!\n\n[Hook]\n\n[DMX]\nI don't play with you cats like I used to\nCause well I ain't your father (uh-huh)\nThis time it's gon' be a little harder\nTold niggas to \"Do You\", courtesy of Flex\nPut out \"... And Then There Was X\" and then there was X\nAnd then there was X again, ain't my next of kin\nJust some hardheaded dickridin grown-ass men (uhh, uhh)\nC'mon with the bullshit (WHAT?!) please, don't touch that\nYou might, bust yo' gun dog but we bust back (aight)\nAnd what's that, a lot of dead homies\nThat ain't yours (UHH) leave it alone, you don't know me\nRespect the nine or catch a wreckless twenty-nine (ahh)\nFor every bone in your spine (ahh) make a nigga recline (ahh)\nThis whole rap shit is mine (WHAT?!) and I'm not sharin (uhh)\nNiggas gettin popped every day, not carin (woo!)\nPeep niggas starin, but they don't want NUTTIN\nNowadays niggas get it for frontin, motherfucker!\nCocksuckin-ass niggas!\n\n[Hook]\n\n[DMX]\nNow there's a lot of - bitch niggas that's rich niggas I stick niggas\n(uhh) Pick niggas and hit niggas I lift niggas (uhh, uhh)\nWannabe player, stay in the park\nCause the grownups is over here, and we drinkin (WHAT?!)\nFuck is you thinkin? (WHAT?!)\nX ain't changed, still with the same shit (uhh)\nAin't with the game shit (uhh) bust leave a stain shit (uhh)\nWatch the game change quick (WHAT?!)\nSome niggas married to the game\nNigga like me? Married to the same bitch (c'mon!)\nI'm a dog from the hood, so I gotta rap from the hood\nPut a snake and a cat to the wood\nMAN!! if you, only knew\nWHAT IT IS!! that I'm, goin through\nWHEN IT IS!! that I'm, goin through it\nYou ain't gon let me get ahold of that thing, cause I'mma do it! (woo!)\nPop, stop drop watch and roll niggas (uhh)\nHold niggas dog I can't control niggas! (c'mon!)\n\n[Hook] - repeat 2X", "image": "https://images.genius.com/afd6872a63df0f464c2e3cf8eb96a627.500x500x1.jpg"}], "artist": "DMX"}