{"songs": [{"title": "The End (Outro)", "album": "Dreamchasers 3", "year": "2013-09-29", "lyrics": "[Intro: Meek Mill]\nOkay, these niggas wanna be sleep\nIt's nine in the morning\nI ain't been asleep yet\nI though sleep was for billionaires\nI think I'm the last of the street niggas left\nUh...\n\n[Verse 1: Meek Mill]\nWhen it come to stuntin', I'm like money man Meech\nBrought my city with me and we coming in the fleet\nAnd now I'm getting richer and they don't want me in the streets\nI'm thinking fuck a album sales, we sold a hundred bricks this week\nThousand grams of crack, take it to the table\nBag it all up, take it to the label and tell 'em distribute it\nI'm getting cake ridiculous\n'Rari like a frog, jumping through the traffic, ribbitin'\nAnd they tellin' me to turn down, they say that I need Ritalin\nBallin' like I'm Jordan, no assists from Scottie Pippen\nIn an' out the flows, crossing over like I'm dribbling\nRunning laps round them rappers, tired like Michelin\nStarted off with Tip and 'em but that wasn't it for him\nYellow, gold Cuban, diamonds blue like Michigan\nBeen taught you niggas\nThat there's levels and there's differences\nTo this lifestyle, the way a real nigga livin' it\nI'm gettin' it, nigga put yourself in my predicament\nIf you was gettin' all of this fucking money\nYou won't spend this shit\nI be at the dealership, pointing out and picking shit\nJust to shake the town up, talking off the Richtor shit\nTake 'em to the Clear Port, no Instagram, picture it\nNiggas taking pictures for the Instagram, you in the shit\nOn the jet, fifty for the flight to go to LIV and shit\nSpend another thirty on the champ\nAnd never sipped the shit\nOne million, two million, three million, four\nI can have a million dollars knocking at my door\nRidin' in the passenger, like 2Pac Shakur\nOnly thing that's different is this new Glock that roar\nGet a rush from the paper, rush from the money\nIf money talk it's like you said hush to your money\nThese broke niggas say I talk too much about the money\nThat's what we do it for the love of the money\nNigga...\n\n[Outro: Allen Iverson]\nWe're sitting here, I'm supposed to be the franchise player\nAnd we're in here talking about practice\nNot the game that I go out there and die for\nAnd play every game like it's my last\nNot the game\nWe talking about practice man\nI mean how silly is that?\nWe talking about practice\nWhat are we talkin' about?\nPractice? We talking about practice man\nWe talking about practice\nWe talking about practice\nWe ain't talking 'bout the game\nWe talking about practice, man\n\nKilled my nigga snupe\nI'm going hammer on these niggas\nRidin' through my city\nWith my finger on the trigger\n(To be Continued)", "image": "https://images.genius.com/9f7555483900d17e5492cc73d0fff0df.600x590x1.png"}], "artist": "Meek Mill"}