{"songs": [{"title": "Untouchable", "album": "Grand Champ", "year": "2003-09-16", "lyrics": "[Intro 1:DMX]\nUhh (huh) yeah, it is what it is\nYah'mean? We untouchable baby\n\n[Chorus:Syleena Johnson]\nI keep my song in my soul\nBlessed my heart and made it go\nTops of our heads to tips of our toes\nWe're untouchable\nEveryday the sun'll shine\nTook this dream and made it mine\nI'm gettin' down one thing that I know (WHAT!)\nWe're untouchable\n\n[Verse 1:DMX]\nWe built this Double R thing from the ground up\nAnother principle of when it's beef, niggas round up\nGettin' down like what nigga, YO!\nThat's all it takes and it's like, HERE WE GO!\nThorough type niggas that control the streets\nRollin' deep, holdin' heat, don't even think about sleep\nWhen we creep, niggas goin' down for the count\nIt ain't sweet, fuck around and knock money out\nC'mon fella, you don't want the dog with the camp\nNot Old Yeller, a pit bull and dog is the champ\nYou know better, think about crossin' the line\nHit your sweater, with about ten from the .9\nDouble R and we get down for life!\nLet a nigga KNOW we can go down tonight\nFrom the tops of our heads, the tips of our toes\nWHAAAAT! We untouchable, AIGHT?\nYea, WHAT!\n\n[Chorus:Syleena Johnson]\nI keep my song in my soul\nBlessed my heart and made it go\nTops of our heads to tips of our toes\nWe're untouchable\nEveryday the sun'll shine\nTook this dream and made it mine\nI'm gettin' down one thing that I know (WHAT!)\nWe're untouchable\n\n[Intro 2:The Cross]\nYeah, yeah, YEAH! Be strong\n\n[Verse 2:The Cross]\nI represent the have and the have-nots\nAll the niggas with the weed spots\nAnd all my niggas on them cell blocks\nWe gon' R-U-double-F R-Y-D-E\nYou can't fuck with my army\nMy niggas is untouchable, eatin' niggas like Lunchable\n.45 be crushin' you when the bullets be touchin' you\nPaul bearers'll carry you\nTo the cemetery where your momma gon' bury you\nBlack suit be fittin' you nigga, I got hood degrees\nPlus I'm street like powder, milk, and government cheese\nIf you a runnin' man nigga, then I'ma shoot up your knees\nThen it's me against the world, man against machine\nS.D.T.S. - stick to my routine\nMy knuckle game impeccable, crack game incredible\nLawyers for my niggas who be sittin' in the Federal\nNigga, I'm untouchable\n\n[Chorus:Syleena Johnson]\nI keep my song in my soul\nBlessed my heart and made it go\nTops of our heads to tips of our toes\nWe're untouchable\nEveryday the sun'll shine\nTook this dream and made it mine\nI'm gettin' down one thing that I know (WHAT!)\nWe're untouchable\n\n[Intro 3:Infa-Red]\nLyrically I'm, untouchable..\nInfa-Red nigga, let's go..\n\n[Verse 3:Infa-Red]\nAll I can know is 365 days of pain\nMy name, how to sell cocaine\nAnd I was taught to buy guns so big when I go to the roof\nI can aim and shoot down a plane\nInfa-Red's my name but fuck all that\nFall back and witness how the streets made me the grimiest nigga alive\nI sell you a fake pie, shoot out your fake eye\nGive niggas a break, nah; I gotta chase mine\nDon't wear your watch around me nigga I take time\nLike niggas that them blue tried to like\nI turn men to mice, canary yellow my ice\nAnd Ruff Ryde on anybody, to be precise\nBut I handle my business like I'm supposed to\nWhen you go in the precinct, that's the only time you see my poster\nBut I could post up and get rid of my pieces\nI own collies sellin' rocks the size of Domino pizzas\nI'm untouchable, nigga\n\n[Chorus:Syleena Johnson]\nI keep my song in my soul\nBlessed my heart and made it go\nTops of our heads to tips of our toes\nWe're untouchable\nEveryday the sun'll shine\nTook this dream and made it mine\nI'm gettin' down one thing that I know (WHAT!)\nWe're untouchable\n\n[Intro 4: Sheek]\nDouble R.. whoo! All day..\nYo, aiyyo X let me get 'em daddy - yo, yo, yo\n\n[Verse 4:Sheek]\nU-N-T-O-U-C-H, A-B-L-E-S\nSheek the new Elliott Ness (no doubt)\nNigga, Bloodline, D-Block; two of the best\nHang the Double R chain from the side of the car\nDrive by and put your brains on the side of the bar\nSheek heavy in the hood (uh-huh)\nAnd I don't mean cause I gained weight in the hood (nah)\nMy aim is good, aiyyo X what they want it to be here?\nOur hammer's cocked, outside of the house on the lawn chair\nYeah nigga what? The new rap LeBron's here\nGet 'em dog, we the new America's nightmare\nAnd we don't say much, we just get it on\nThat's why we don't get touched, y'all like a dutch\nHands all on you, I'm tryna warn you\nTo stay in your place, so you don't get laced\nAnd them pretty ass shades, can stay on your face\n\n[Chorus:Syleena Johnson]\nI keep my song in my soul\nBlessed my heart and made it go\nTops of our heads to tips of our toes\nWe're untouchable\nEveryday the sun'll shine\nTook this dream and made it mine\nI'm gettin' down one thing that I know (WHAT!)\nWe're untouchable\n\n[Verse 5:Drag-On]\nUhh, uhh, uhh, c'mon!\nYou motherfuckers got me back on my grizzly, I'm back on the grind\nI'm back to the streets, catch a beef, come back with the nine\nI'll murder ya man, come back with his shines\nI tote two guns, I don't care if you box, I don't care if you blind\nI spit in your eye like niggas is eatin, I'm splittin' the pies\nFrank Nitty your rap, how gritty am I? The city is mine\nYeah, you get in my way I pity your moms\nYeah, my block is real, my niggas is armed\nMy borough is thorough, we bang with each other\nI'm switchin' my diamonds and changin' the color\nWith change of weather, canary in the sun, uhh\nI bury ya nigga then bury the gun, X whattup?\nMe and you is untouchable (uh-huh)\nWe both had bricks they couldn't sniff cause the coke was uncrushable\nGuns is fingerprint-proof, we \"Ryde or Die\"\nYou drivin' by, we clap at your ride, good-bye\n\n[Chorus:Syleena Johnson]\nI keep my song in my soul\nBlessed my heart and made it go\nTops of our heads to tips of our toes\nWe're untouchable\nEveryday the sun'll shine\nTook this dream and made it mine\nI'm gettin' down one thing that I know (WHAT!)\nWe're untouchable", "image": "https://images.genius.com/e730418bfaada4fc845d1179160af643.999x999x1.jpg"}], "artist": "DMX"}