{"songs": [{"title": "Up Out The Way", "album": "Napalm", "year": "2012-09-04", "lyrics": "[Intro: E-40]\nI'm in my 7 deuce Cutlass with the slap in the back\nWith the slap in the back, with the slap in the back...\n\n[Xzibit]\nI got that rag top Impala with the brains blew back\nWith the brains blew back, with the brains blew...\n\n[Verse 1: Xzibit]\nI got that rag top Impala with the brains blue back\nCould you loan me a dollar? Bitch, I can't do that\nGot a flight in an hour, got my bags all packed\nBring it in for the huddle a hundred and fifty racks, POW!\nWant me to take it to the club and throw it on the ground?\nInstead I take it buy a business, make it double down\nI'm back in business, you pussy niggas in trouble now!\nShake, what you gon' shake the city?\nClearly you are from outta town\nI'm in my scraper, catching paper on the turf\nStackin' yaper like a Laker, hit exactly where it hurts\nBetter put that shit in reverse, you might cross over the ledge\nThe king of the castle swingin' screamin' \"off with their heads!\"\nRound up and wrangle your ratchets\nMad cause they given us action\nFuck em', we keep em', we mackin'\nDon't need them nigga, what's happenin'?\nWhat is it? Let's get it crackin'! Millions and millions reacting\nFocused, no longer distracted, put it down, let's see you match it\n\n[Hook: E-40 & Xzibit]\nI'm a rich ass nigga, you's a bitch ass nigga\nI'm a rich ass nigga, you's a bitch ass nigga\nI'm a rich ass nigga, you's a bitch ass nigga\nI'm a rich ass nigga, you's a bitch ass nigga\nStacking money to the ceiling, getting paid all day\nAll day, all day, all day, all day...\nIf you ain't tryna get it, better get up out the way\nOut the way, out the way, out the way, out the way...\n\n[Verse 2: E-40]\nX, let me spit at them, mane\nThey done awoken a sleeping dragon\nNow the roof is on fire, let the motherfucker burn\nThe fire marshall came in when it was my turn\nEverybody up in here spazzin'\nHigher than a hippie, crunk and hella pissy\nEverybody tipsy, feelin' hecka tripy- my wrist real brisky icy\nBitch made niggas don't like me\n'Cause they wife want me to pipe, she...\nBeen on me since 1990\nBody, boomin', I be tycoonin'\nMe and a few of my goons and alcohol consumin'\nBorn and raised in the grip\nWhere a fiend will sneak up on you try and hit you for a hit\nBetter pack a extra clip\n'Cause niggas ain't playin', niggas really with the shit\nBallin' like rawlings\nOr should a pimp say like spaulding\nAll I hear is money callin'\nThousands on thousands on thousands\nFlatlands, public housing - real talk player, no Jones\nAll about my allowance - need a money counter just to count it\nSheesh, capiche? I'm heavy off in these streets\nUFC front seats - no famine man, we feast\n\n[Hook: E-40 & Xzibit]\nI'm a rich ass nigga, you's a bitch ass nigga\nI'm a rich ass nigga, you's a bitch ass nigga\nI'm a rich ass nigga, you's a bitch ass nigga\nI'm a rich ass nigga, you's a bitch ass nigga\nStacking money to the ceiling, getting paid all day\nAll day, all day, all day, all day...\nIf you ain't tryna get it, better get up out the way\nOut the way, out the way, out the way, out the way...\n\n[Verse 3: Xzibit]\nLet's get whatever you drinkin' and drink it by the case\nThen let me pound on your pussy and knock it outta place\nI wanna hook you and book you, hand you some time to face\nWhile we vacate in a destination for motivation. Hey!\nSeparate hundreds from fifties - ball it up, bring it all with me\nCallin' a audible hit me, I'm open, never forget me\nDown shift, punch it, approaching 160\nI'm clowning like Barnum and Bailey bouncing around the city\nPity you feelin' shitty, this 25 to lifer is pushing a Spyker\nGet anybody hit by a sniper\nLive the rest of your life in a diaper or chill the fuck out\nOr you can walk, better keep walkin' or they can carry you out\nThis is the end of the drought, homies is bouncing around me\nToo many zeros to count. I let these women surround me\nJump off their clothes dig 'em out, but then they never can find me\nHolding unholy amounts, already showed you the route, c'mon\n\n[Hook: E-40 & Xzibit]\nI'm a rich ass nigga, you's a bitch ass nigga\nI'm a rich ass nigga, you's a bitch ass nigga\nI'm a rich ass nigga, you's a bitch ass nigga\nI'm a rich ass nigga, you's a bitch ass nigga\nStacking money to the ceiling, getting paid all day\nAll day, all day, all day, all day...\nIf you ain't tryna get it, better get up out the way\nOut the way, out the way, out the way, out the way...", "image": "https://images.genius.com/727e047579481405310e18c83d10416c.1000x1000x1.jpg"}], "artist": "Xzibit"}