{"songs": [{"title": "Put Em Up", "album": "Mixtape", "year": null, "lyrics": "This is the way it's the way it's supposed to be\nThis is the way that I say that it's gonna be\nThis is the way that I say it's supposed to be\nThis is the way that I say that it's gonna be\n\nLet me go, nigga, back up off me\nDog out the cage, cats walk softly\nTalk real lightly, scared to bite me\nScared to death to shoot me, scared to fight me\n\nIndustry niggas is playing the wrong game\nUp in a real nigga face, saying the wrong thang\nAt the end of the day, what that really mean?\nCome on, let this bitch ass nigga flee\n\nHe ain't mean no harm, he ain't mean nuttin' by it\nIt ain't mean no wrong, you's a grown ass man\nLet 'em know, dick ain't for ridin'\nDick is for findin' pussy, then hidin'\n\nWhat is my dick doing in your mouth?\nThis ain't a pacifier nigga, c'mon, take that out, please\nOh shit bitch, this is how dog get down\nHands in the air whenever dog hit town\n\nPut 'em up, come on, put 'em up, come on\nPut 'em up, come on, put 'em up, come on\nPut 'em up, come on, put 'em up, come on\nPut 'em up, come on, put 'em up, come on\n\nPut 'em up, come on, put 'em up, come on\nPut 'em up, come on, put 'em up, come on\nPut 'em up, come on, put 'em up, come on\nPut 'em up, come on, put 'em up, come on\n\nY'all niggas heard it through the grape vine\nWhat's that? X is back, I'ma take mine, yeah\nName of the game is get in where you fit in, dog\nNigga, I fit in at the beginnin'\n\nCats living, jumpin' out the window\nWhere'd money go? Yo, right out the window\nWhether it's rock and roll, I lock and load\nShut 'em down, open up shop, oh no, com on\n\nDick ridin' niggas, stay up in it, where you goin' dog?\nUpside your fuckin' head in minute\nFirst you pick the dudes, stick and move\nWitness smooth, real simple, stick to the rules\n\nWhy you gotta make shit complicated? I hate it\nY'all keep a nigga aggravated\nThen rate it, loading up let the hungry eat\n911, it's a beast running loose in the streets\n\nPut 'em up, come on, put 'em up, come on\nPut 'em up, come on, put 'em up, come on\nPut 'em up, come on, put 'em up, come on\nPut 'em up, come on, put 'em up, come on\n\nPut 'em up, come on, put 'em up, come on\nPut 'em up, come on, put 'em up, come on\nPut 'em up, come on, put 'em up, come on\nPut 'em up, come on, put 'em up, what?", "image": "https://images.genius.com/49d3acfb6e8c12c9a829c2bd1a908682.1000x1000x1.jpg"}], "artist": "DMX"}