{"songs": [{"title": "Can I Get A Flicc Withchu", "album": "R&G (Rhythm & Gangsta): The Masterpiece", "year": "2004-11-16", "lyrics": "[Intro: Snoop Dogg]\nYeah, brand new Snoop Dogg [echo]\nSomethin' to crack the New Year off, you dig? [echo]\n\n[Hook: 2X]\nOne for the trouble, two for the bass\nCome on everybody let's rock this place\n\n[Verse 1: Snoop Dogg]\nDoggy Dogg, you are the best\nRock this beat cause you are so fresh [2X]\n\nWell if you insist her I guess I'll twist her\nBut, give me a minute while I freak your sista\nPush the pista up against her\nNo offense, but this pimp'in mista\nBow your fist up or hold your cris up\nLight that bitch up and blow your sist up\nThis that shit to get your jive talkin'\nEast Side RTC walkin'\nPeople, people listen closely\nI say it cause mostly when y'all approach me\nStay low key and keep it OG and don't try to burn rubber on me\n\n[Hook]\nI love your movies you are awesome Snoop\n(Can I get a flicc withchu?)\nI buy your records, everything you do\n(Can I get a flicc withchu?) {Oh really?}\nMy daughter loves you; she's only two\n(Can we get a flicc withchu?)\nYou a handsome fella, you kinda cute\n(I really wanna get withchu)\n\n[Verse 2: Snoop Dogg]\nDoggy Dogg you are the best\nRock this beat cause you are so fresh\nDoggy Dogg you are the best\nTake this shit back home to the West\n\nMelissa Brista in San Francisca\nThe cute little sista with the feet for blista\nSay that I dissed her cause I wouldn't kiss her\nBut I got her a picture say I'll holla back witcha (I'll holla)\nHey, they say that I'm like Mr. Bigsta\nAll these bullshit moves to miss us\nDivide in twisters we buy relistas\nWe mind my listnats cause I'm a mimsta\nDesign by mimstas these time are senistas\nBut I'mma finish her on the ground until it's done\nKnives and silly clubs - hoes and fake thugs\nPimps, players and all the above\n\n[Hook]\n\n[Hook 2X]\n\n(Oooooh Weeee)\n\n[Snoop Dogg]\nYeah, that's bangin' loco (For shizzle)\n\n[Verse 3: Snoop Dogg]\nOh, were was I? Oh yes, spittin' to flip ya\nComin' thru scriptures; straight your ditchas\nPigs won't pinch us, won't just miss us\nAnd they wanna french kiss us\nPack the pistas, twist don't twist us\nRoll with me on this dog adventure\nBut you can't enter without your credentias\nAnd if you get in, you might get a picture (come on)\nSo sit your shit down, go on and get down\nIt's huggy baby, it's comin' in your town\nYou don't wanna miss this, it's just like Christmas\nSo make your wish list and go on and flicc this (Preach)\n\n[Hook 2X]\n\n[Snoop Dogg: 2X]\nGo VIP with big D-O-G and see what gangstas do\nOnce we get withchu we can take pictures\nWe came to funk withchu\n\n[Bootsy Collins]\nOh, for real yo on the dilli-do\nFollow the bouncin' ball\nSay, who do you call? (Who do you call?)\nOh, for real yo on the dilli-do\nOh, follow the bouncin' ball baby (Who do you call?)\nYeah (Who do you call?)\nWarm me up\nBurn it up me, keepin' your hot spot hot\nTurn it up me, shake what you got - you got a lot\nBurn it up me, keepin' your hot spot hot\nTurn it up me, shake what you got - you got a lot", "image": "https://images.genius.com/22daab0632e506300bab596c589dcfb2.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}