{"songs": [{"title": "Smile Mama, Smile", "album": "Black Market", "year": "2015-12-04", "lyrics": "[Produced by Jake One]\n\n[Intro: Rick Ross]\nI just wanna see my mama smile\nHere I go\n\n[Verse 1: Rick Ross]\nI went unconscious, I woke up to see my mama smile\nShe told me no more promethazine, that'll make her proud\nThink about it, damn I had to think about it\nGimme a second, mama, lemme think about it\nI went unconscious, I woke up to see my mama smile\nShe told me no more promethazine, that'll make her proud\nThink about it, damn I had to think about it\nGimme a second, mama, lemme think about it\nNever had the chance to tell my dad I was a Yankee fan\nTrue love is unconditional, money don’t make the man\nFirst time me in a batting cage, I knew I had a gift\nWhich I had to skip, I'm at the car wash trying to make a tip\nPositivity is all I got to give\nWhen we was kids, it was steel now it's time to live\nThat's why I throw a pinkie ring up when I post a pic\nIt's for my niggas on they dick, \"Look what this nigga did!\"\nThink about it, think about it\n40 M's in my Timbs, still ridin' rims\nWord on the streets, they say that nigga get a lot of cake\nI take the time, I kiss both cheeks on my mamas face\n\n[Hook: Cee-Lo Green]\nJust smile!\nThe world had to make me a man, but I'll always be your child!\nMama just smile!\nMost importantly, I want you to be proud! Mama just smile!\n\n[Verse 2: Rick Ross]\nNo I never really mind that we caught the bus\nOr that we always stand in line, I’m talkin' all of us\nIt made me stronger, it made me quicker on my feet\nAll the gain she gave me the love that she would teach\nTurn me onto real estate we bought us 50 homes\nWho really gonna be your shoulder when your kidneys gone\nWho really gonna be your rider when the Bentley's gone?\nOr when they singin' like a choir in a Christmas song?\nMama! Always depend on my mama\nJust bought another Benz for my mama\nI always keep it real with my mama\nShe harder than a rock\nThrow her parties on the block for my mama\nI just wanna see my mama smile\n\n[Hook: Cee-Lo Green]\nJust smile!\nThe world had to make me a man, but I'll always be your child!\nMama just smile!\nMost importantly, I want you to be proud! Mama just smile!\n\n[Bridge: Rick Ross]\nMakes me happy just to see a smile on her face\nPerfect mother and I love you, tell you every day\nYou always was a black queen, mama\nYou showed me all the best things, mama\n\n[Outro: Cee-Lo Green]\nI am at love\nYour flesh and your blood\nYour unconditional love inside of me\n(L-E-T---M-E---S-E-E---Y-O-U---S-M-I-L-E)\nMama, just smile\n(L-E-T---M-E---S-E-E---Y-O-U---S-M-I-L-E)\nMama, just smile\n(L-E-T---M-E---S-E-E---Y-O-U---S-M-I-L-E)\nMama, just smile\n(L-E-T---M-E---S-E-E---Y-O-U---S-M-I-L-E)\n(L-E-T---M-E---S-E-E---Y-O-U---S-M-I-L-E)", "image": "https://images.genius.com/5443bc2c1a02c3c0df5d0f01baaa2ad4.1000x1000x1.jpg"}], "artist": "Rick Ross"}