{"songs": [{"title": "Eastside Party", "album": "Death Row’s Snoop Doggy Dogg: Greatest Hits", "year": "2001-10-23", "lyrics": "[2Pac]\nNigga you young! {Echoes}\n\n[Nate Dogg]\nNo one does it better! {Echoes}\n\n[Chorus 2X: Nate Dogg]\nNo one throws a Eastside party like we do\nNobody...No one does it better\n\n[Verse 1: Snoop Dogg]\nBreak out the weed and the drank and chill out and get high\nIt's 1 A.M. and the crowd is still live\nRelax to the groove, I mean, just move with ya boy\nGot shit poppin' like always, you know, so enjoy\nGo make yourself at home, got big meat on the grill\nLadies and homies all in the mix, it's time to chill\nSha-La-La brought the orange, with the zags and the blunts\nRoll up some Bob Marley joints of some skunk, Daz with Thai\nAnd Nate got a hundred piece\nSo we piece up properly on the O.Z\nWe in the zone bombed out feelin' good, ya know\nGot the homegirls and homies from the hood, ya know\n2-1, 1-9, 2-0, we all in the house\nAnd it's a Long Beach thang where I was born and hung out\nTo all my players and hustlers and gangbangers, listen up\nIt's about time I kick a rhyme to fuck shit up\nNow who throws shit?\n\n[Chorus 2X: Nate Dogg]\nNo one throws a Eastside party like we do\nNobody...No one does it better\n\n[Interlude: Snoop Dogg]\nNow do the gangstas run this motherfucka? (Hell Yeah!)\nOr do the ladies run this motherfucka? (Hell Yeah!)\n\n[Chorus 4X: Nate Dogg]\nNo one throws a Eastside party like we do\nNobody...No one does it better\n\n[Verse 2: Snoop Dogg]\nNow the party is bumpin', thumpin' back to back\nAnd Daz on the turntables puttin' down a scratch (HA!)\nI'm on the mic so I'mma bust me a rap\nAnd I'mma dedicate this one to a pack of hoodrats\nThe Dogg Pound nation, locs and big posse\nThese is the peoples I see rockin' the party\nMake a nigga wanna poplock on the flo'\nAnd do the Boogaloo Shrimp and pimp the ho\nI got to owe 'em my life cuz I'm a O.G\nI got the love in the hood cuz I'm the big homie\nI got the skills when it comes to rockin rhymes\nSo put your hands up to the sky, get yours, I got mines\nNow everything is live, don't you agree?\nAnd if you do, then keep on groovin' with that nigga D-O-double-G\nWe ridin' with the hat to the side of the ride\nY'all know how we do on the Eastside\nYou see the thing is we like to keep it harder\nAnd we real party people just like Afrika Bambaataa\nWhat do you want? Matter fact, what do you need?\nCuz we keep it all on point from the drank to the joint\nSo pass the bottle, ain't no need to squabble\nAnd hand it to the little homie, let him have a swallow\nIt's a Eastside thang, nigga, bring yo ass\nG's up Ho's down, nigga, you know the program\n\n[Chorus 2X: Nate Dogg]\nNo one throws a Eastside party like we do\nNobody...No one does it better\n\n[Verse 3: Snoop Dogg]\n(What you watchin' the clock for?) The clock tickin'\nBut it won't stop kickin' cuz everybody kickin' it\nAnd gettin at the bitches, which is, the main thing gangstas do\nSkip the bump cuz the rump's what I came to view\nNew pussy in the hood, shall I kill it? (Kill It!)\nThe way she got it poppin, no, it's probably hotter than a skillet\nBut baby don't tweak, like you ain't no freak, peep\nI keep my game tight, it ain't no leaks\nSo we can keep this on the down low\nAnd take a walk with the Dogg and lemme show you what the pound for\nCandlelight and romancin'\nIf I can just get the last dance in at the mansion\n\n[Chorus 5X: Nate Dogg]\nNo one throws a Eastside party like we do\nNobody...No one does it better\n\n[The Ladies]\nNo one throws a Eastside party like we do\nNobody...No one does it better", "image": "https://images.genius.com/dceebda859a32eb0b992545242936a6f.480x480x1.jpg"}], "artist": "Snoop Dogg"}