{"songs": [{"title": "So So", "album": "No Genre", "year": "2012-02-21", "lyrics": "[Verse 1]\nYes sir is Bobby Ray, aka A. B.o.B. (O)\nI can't be eco-conscious, I'm always burning trees\nAnd this that fire, fire, call it that third degree\nAnd call me supersonic I shake the earth beneath ya\nHell yeah you heard of me, quite an emergency\nThe way I take the game and I beat it so un-unmercifully, yeah\nLadies with curly features, wait at concerts to see you\nThey can roll home with B.O., and maybe service me up\nBut if you wanna work for me then girl you need your working visas\nAnd if you ain't working then you just should not converse with me\nThat's not that serious, don't take it so personally\nPlus currently I prefer the girls who prefer the three C.P.O\nC.P.O. I think I think I'm Neo\nI'm caught up in her Matrix and I think it's time to reload\nAnd if this were a court, then girl I would have to appeal\nI think that the defendant have some things that she must reveal\nHeels ha, heels ha, tell me what's the deal, ma\nGot me chasing you to see if I could cop a feel, huh\nI gotta keep it real, kosher, kosher, kosher\nCause she don't want that bullshit, no sir, no sir, no sir\nHer thighs go round like roller-coaster motors\nAnd like a minute bundle, I had to roll them over\nHad to connect the headset into her Motorolla\nThis bout to get scary like the end of October\n\n[Hook]\nAnd this is about the time when I hit you with the dope flow\nI got that fire man, and other shit is so so\nAnd this is about the time when I hit you with the dope flow\nI'm at the frying pan, your shit is so cold\nAnd this is about the time when I hit you with the dope flow\nI got that fire man, and other shit is so so\nAnd this is about the time when I hit you with the dope flow\nI'm at the frying pan, your shit is so cold\n\n[Verse 2]\nSo cold like a hobo wearing no clothes in a snow globe when the temperature is below froze\nI mean below freezing and there's no reason to be so cheesy, got my own team and my own league\nMy own lane and my own speed, it's a long road so I don't sleep\nIf I don't know you I don't speak, it's a small world and it's gonna shrink\nIf you're full of shit, then you're gonna stink\nI'm a realist I'm gonna think, with a pair of eyes so I'm gonna see\nI'll be whatever the fuck I wanna be, I'll be everything except a wanna be\nI'll be everything you ever wanna be, if you're clever enough you can corner me\nBut what's a corner to me, I'm geometry\nSo tell me who gave you the authority? Who the fuck are you? The authority?\nWhat am I supposed to be orderly? pardon my honor you're charging me?\nSaying something I oughta be but I got some much heart that my arteries will always be partying like a camaraderie\nMan I'm already famous historically so my story is already glorious\nJust like P Diddy victorious to the B.I.G. Notorius\nI'm a champion, I'm a warrior, I bring war to ya\nSo if you got beef that's unfortunate, we'll hang ya'll out like portraits\n\n[Hook]\nAnd this is about the time when I hit you with the dope flow\nI got that fire man, and other shit is so so\nAnd this is about the time when I hit you with the dope flow\nI'm at the frying pan, your shit is so cold\nAnd this is about the time when I hit you with the dope flow\nI got that fire man, and other shit is so so\nAnd this is about the time when I hit you with the dope flow\nI'm at the frying pan, your shit is so cold", "image": "https://images.genius.com/d18ebaef113d710715491da16422feee.1000x1000x1.jpg"}], "artist": "B.o.B"}