{"songs": [{"title": "The Presentation", "album": "Comeback Season", "year": "2007-09-01", "lyrics": "[Produced By Rich Kidd]\n\n[Verse 1]\nShake up the world, that is what I'm about to do\nAnd homie, you ain't even on my altitude\nI'm tellin you, I got enough cloud for two\nAnd like a nigga turned Blood, I came out the blue\nThey like, \"Damn who's Drake, where's wheelchair Jimmy at?\"\nOn my Chris Brown shit, I'm still here, gimme that\nI'm cutting lights out like it's bedtime\nThese other rappers lukewarm like red wine\nThe truth hurts so please don't rub it in\nI'm not signed yet, so I'm still budgeting\nI'm like Jeopardy, I'm still buzzin in\nEvery city that you got a nephew or a cousin in\nI miss cake these days\nI can't even afford a mistake these days\nAll of my favorite girls miss Drake these days\nPlease don't take offense to my ways\nCause I need drug money Who got drug money?\nI am talkin \"white Phantom sittin' on dub\" money\nI am talkin \"cold champagne at the club\" money\nAnd no I ain't emotional, but baby I love money\nTo all these A&R's that's playin' stars\nWhy you gotta act dumb? (dumb)\nYour girl know how I beat it like a flat drum\nAnd spit dirty like I'm chewing on black gum\nI fooled y'all, ain't shit for me to come back from\n\n[Interlude]\nOh! Yes!\nI'd like to take this opportunity\nTo formally welcome you to this extravaganza\nThat I call Comeback Season\nHope you enjoy your stay\nDrinks are on me, by the way, yeah\n\n[Verse 2: Drake]\nHow the fuck Jay and Dame gon' break up 'fore they meet Drake?\nI'm sure it can be resolved, I'm just hopin that they make up\nI'm perfecting my craft using more cess\nTryna make some cheese off a single is a process\nGet it? Kraft, single, cheese, process\nSit back and admire the talent that I possess\nTop notch, no less, oh yes, I'm known in the city\nBut need to bust out like a model that show chest\nCause you deal with agents from check collections\nI'm keepin' it cleaner than Little X direction\nAnd baby girl, if you don't like me, it's prolly due to the fact\nThat you are les like NextSelection\nThe city is mine, I control this, you know this\nCause you are nothing like it and I'm so this, the coldest\nI'm in Jamaica, docked at the bay, what up Otis?\nI'm back with the form like Obus, I go, yeah\nAnd I'mma teach it so you learn right\nYou can't come on this ride, you need to earn height\nWith no hydro bill, I let the lights burn out\nAnd after that I take 'em back like returned flights, yeah\nYou can't miss the boy\nMe and Rich united like van Nistelrooy\nBar Mitzvah kid, get your hits destroyed\nCause I keep it under wraps like Christmas toys\nNo witnesses, no mistresses\nThis the present and I'm a show you what gifted is, mayne\nKeep it real, no other youngin's as hot as me\nYou a Gucci groupie, my nigga, and I'm a prodigy\nWhat I'm direct for, cause I'm who they check for\nI waited for connects while you was playin' Connect Four\nYou was playin' Uno, I was doing you know\nWhatever us rappers do to develop a new flow, I promise\n\n[Outro]\nShout out to 40-40\nYeah my right hand!", "image": "https://images.genius.com/866a4a7df935705e834f236499d617c6.1000x1000x1.jpg"}], "artist": "Drake"}