{"songs": [{"title": "Striving For Perfection", "album": "Only Built 4 Cuban Linx…", "year": "1995-08-01", "lyrics": "[Album Intro: Ghostface Killah (Raekwon)]\n(Yeah yeah I'm tired of doing this shit)\nAight word, aight I'ma set it (Tell me how you feel man)\nYo son, check the fly shit son (Sup cousin how you doin'?)\nYo baby check it man, I got a new connect son, for real man\nFuck all this twenty-four brick shit man (No doubt)\nMy man got out of state for fifteen (Yeah)\nYou know what I'm saying?\n(You know my man's and 'em is in VA they politicking to death) Right right (So it's all good, what's up? What you wanna do?)\nWe gotta move God, we gotta move God, we gotta migrate\nGet the f-, get the fuck outta New York, yaknowhatI'msayin?\nBounce man, start fucking with bigger and better shit\nSo you telling me no more big eights strictly breaks\nNo more no more no more man (I'm with you, I've been waiting)\nNo more God (what's up?)\nIt's the pot of gold right here man this is it man, this is glory\nYouknowhatI'msayin?\n(So yo, the first thing we gotta do man is just know what we gonna do with this cream when we get it man) Right\n(Cause I'm not tryna just be, sitting on motherfucking 200 thou)\n(And acting like I'ma just be a drug dealer all my life) Nah\n(Son I got bigger and better plans Son)\nNo doubt, we gonna move on man\n(And you know I be fucking with anybody man)\nSon, long as the love and the trust is there Son we gonna grow God\n(Yo, yo, Tony)\nWe gonna grow like a plant, son\n(Yo you coming at me like that, son?)\nFor real son, come on you know me man (You know my style, son)\nYou know how my heart feels though, God (No doubt)\nBut yo God, for real, this is my last time God\nI'm hanging this shit up man if this shit don't work right here, God\nYouknowhatI'msayin?\n(Word up, I feel the same way, I feel the same way kid)\nYo God, yaknowhatI'msayin?\nI got shot at man, my mom's windows got shot the fuck up man\n(Yeah)\nYo God, my baby's in here God, see I gotta take the time man\nAnd raise my family man (Yeah yeah yeah)\nYaknowhatI'msayin? Sit around man, my grandkids, man\n(But yo son, it's like this man, we all living man, we here now man\nWord man\n(YouknowhatI'msayin? Let's not think like we gon' be stagnating man, let's keep moving ahead man, keep our head up man\nTake care of our families man)\nGod, word is bond, I'm your eyes that's in back of you kid\n(Let's do it then)", "image": "https://images.genius.com/e336a632db4d1dd7b6d848646b5d5ffc.876x876x1.jpg"}], "artist": "Raekwon"}