{"songs": [{"title": "Lil Bit (Remix)", "album": "You Know What it Is Volume 3", "year": "2005-06-19", "lyrics": "[50 Cent] (The Game)\nOkay, whassup its ya boy 50 Cent (Yeah)\nIt's goin down right here you heard me? (I'm craaazy)\nOff of The Massacre's (Aftermath)\nCheck it out (G-Unot!)\n\n[Hook - The Game]\nBitches only feel ya shit just a 'lil bit\nNiggas only feel ya shit just a 'lil bit\nThe hood only feel ya shit just a 'lil bit\nStop the singin' lets get back to some killa shit\n(x2)\n\n[Verse 1 - The Game]\nStep up in the club they like who you wit\nI'm signed to Dr. Dre not G-Unit\nRed rag in my pocket feelin' old school\nYou forgot how bullets feel I'mma show you\nI'm a gangsta I do what I want to\nYa time is up nigga I dun warned you\nYou got the police witchu nigga don't trip\nI got a box of donuts and a whole clip\nWhen it's time for beef he get his drink on\nAnimal Rights said kill 'em with that mink on\nI'mma kick it by your car 'till it's time to go\nAnd I won't leave the scene 'till the police show\nCause\n\n[Hook]\n\n[Verse 2 - The Game]\nRemember 50, comin' out ya stereo\nSounded gangsta 'till he switched his flow\nHow many times I try to get you to hit the smo\nStop lyin' to the people you don't twist the dro\nMy tech, is fit, my clip is long\nAnd the bloods, and crips, is on you dawg\nThey musta heard that you a ho\nGot G-Unit airbrushed on ya toe\nBring the pump in the club cause I'm hurtin' the kid\nAnd I do these rap beefs all the time mayne\nThey say at summer jam, I turned it out\nBut Kanye and Hova killed it without a doubt\nThe rat came out dancin' like a pro, mayne\nPunched him in the face the crowd was like \"oh mayne\"\nFour months ago I was yellin' G-Unit\n'Till I found out the nigga 5-0 was a snitch\nNow\n\n[Hook]\n\n[50 Cent] + (The Game)\nProduced by Scott Scorch (Scott Scorch!)\nScott Scorch (Scott...I mean Scott Sc, Sc, Sc)\nScorch\n\n[The Game]\nIt's Scott Storch you dumbass bitch\nS-T-O-R-C-H\nStorch mothafucker, Storch\nLearn how to talk you fuckin' bitch\nThat's that muhfuckin hole in ya jaw huh?\nScott Scorch\nLearn how to say a nigga name you dumbass faggot\nDon't even know how to talk, and that's the reason..\n\n[Hook]", "image": "https://images.genius.com/94aac16d9845daeefdcaedcb5eeb289b.360x360x1.jpg"}], "artist": "The Game"}