{"songs": [{"title": "Good Times", "album": "Hidden Darts: Special Edition", "year": "2007-03-13", "lyrics": "[Intro: Ghostface Killah]\nAllah himself\nMan, woman, child\nThe book of life\nStarks Enterprise!\n\n[Ghostface Killah]\nTake out the rap kingpin, the black Jesus\nI know a few niggas sniff coke and caught seizures\nPeace to ten thousand seaters\nAnd all y'all pretty ass Libras\nMy Tommy dick'll blow y'all ass to pieces\nI love fuckin with y'all I got the George Jeff walk\nLook how I dance, favorful robes, bows and all sorts\nHold on, who turned the lights on?\nWord to my microphone and preach on\nBrother, that's that bullshit in my right arm\nCrackhead stop it, dope pusher stop it\nThe father sent me a message and I came to drop it\nThe prophet is to love each other\nMichael Jordan/Jackson, Cosby money, Oprah\nThey got our love by go get Africa\n\n[Lord Superb]\nHarmony, grits, welfare cheese\nWhips, cheque data first in the fifth\nWhat Ghost?\n\n[Ghostface Killah (Lord Superb)]\nFuck y'all niggas an' fuck y'all bitches an'\nFuck the pictures y'all takin, fuck the whip you in\nStarsky bring home the dough now the show is over\n(It's over) It's over? (It's over) It's over?\n\n[Lord Superb]\nTimberland, crack snorkels, jewels, cash insurance\nTai hold, fly clothes and El Deramo\n5 plus 5 O's, one plus 9 O's\nSave our self, reach our goals\n\n[Ghostface Killah]\nWhat if the BIBLE wasn't good?\nAnd good was bad, as bad as it should\nIt matters, feed em power food\nThe wonders that Allah will do\nMaybe he'll discover you\nLook 'em like a couple of jewels\nTicket traum' was old, that plus the God ain't loved the way I move\nPeople see me, G. Deini\nHe beeny on the cell, seen me?\nYou need me, you read me\nCaptain over, get that weed to me\nThe champion, the vigilante\nAsk me what the surface could be\nIn me like Marcus Camby\nHear me, I fuck with family\nDons, chew on this, the hit list got\nAll of your names, so y'all lames is hist'\nI kissed the bangin-est bitch (all night) that's famous for her tits\nNot that tall doofy chick in your hood called Snitch\nCome on!\n\n[Lord Superb]\nBentleys for sharp shoes\nSimilac, Huggies, big Shizam jewels\n\n[Raekwon]\nInfrared shootin at niggas\nWe back execution niggas\nMarkin it mummy, he money, he fly bummy\nSuper wizzers, look like Luther bitches\nStill catches ill inventions\nStrength, real niggas holdin blitz as real as ninjas\nSo illable, wheel of promotin like Benz dealer\nInstiller, get real for hugs, lets chill feel I'm ill with colour\nYo bacon, straight cake, layin on my paper aces\nFuck all your under statements\nBattle us? Battle gauges\n\n[Lord Superb]\nA big mansion, real product of the strip scampy\nCell boat, big yacht, and beige Hummer\nSummer home, big stones and cologne\nRemember heroes? I guess them corner days is gone\nMommy got a house, Daddy got a house\nGranny got a house, we moved out\nThat's right, we moved out\nNow that's what I'm talkin about\n\n[Ghostface Killah]\nSmackin all y'all stars and chumps\nGettin cash in the larger sums\nShootin dice in the church with nuns\nWe come with the biggest guns", "image": "https://images.genius.com/7e5a18091d3e0f8ca0dd24fa1536f363.500x500x1.jpg"}], "artist": "Ghostface Killah"}