{"songs": [{"title": "Intellectual Dons", "album": "Unreleased & Revamped", "year": "1996-08-13", "lyrics": "(*B-Real sings the chorus on 11 seconds*)\n\n(Intro)\nWhat's up we gonna go down the line baby\nBrand new one from the Call O Da Wild\nGive big shouts to money makin Manhattan\n145th street crews, 155th street crews\nAll my niggas on the East Side\nWe gonna flip the track baby, flip the script like this\nBig shouts to all the weed spots and all that who know how we do\n\nMe things no money sat on Monies chicks\nFillin Barcadi on club seats\nHarm's represent the crease on wise fully feet harmly accriminate\nFuturistic kittens of the street all malfunction seats\nCrews stand like mannequins sportin names is Tim's\nI'll make half your flaps burn is self-discipline\nAnd supportin your kittens if you're convinced\nThey keep the scripts movie-men\nExperience and heart with cinematographers having captured raw footage of this\nMischievous black kids dipped in black hooches\nRuthless-a the caswendler stupid used to pump with the any gooier\nNow let the card hold the futures\n\n(Chorus)\n(B-Real)\nDon't want to do it but they wanna\nJust the Intellectual ganja puffin dons causing trauma\nDon't want to do it but they wanna\nJust the Intellectual trauma causing dime\n\n(Barron Ricks)\nB Ricks stands anonymous decant flicks\nAnd non-raps that can't bonely manifest the Buddha blessed\nFreshly dressed rollin in the clubs for success\nI'm not dressed in materialistic games to get the sex\nThe five six I'm livin fortune of survival tactics\nKeepin my enemies close and all my niggas out of business\nWhat is this?\nSlicey characters spreadin my business\nFragments that can't manage that do damage yo I had it\nEnvironmental pressure causing static\nIn fabric of the asiac cabbage it's madness\nAll this I'm civilized now what do I now?\nRun these avenues buckwild with crews now who is it?\nMakin all you critics fiend these lyrics\nAnd be the core\nYes y'all comin through on your premises\nThis is it\n\n(Chorus)\n(B-Real)\nDon't want to do it but they wanna\nJust the Intellectual ganja puffin dons causing trauma\nDon't want to do it but they wanna\nJust the Intellectual ganja puffin dons causing trauma\nDon't want to do it but they wanna\nJust the Intellectual ganja puffin dons causing trauma\nDon't want to do it but they wanna\nJust the Intellectual ganja puffin dons causing trauma\n\n(Interlude)\nKnowI'msayin?\nBig shouts to my sacred projects connections knowI'msayin?\nAll my brothers on 113th Lexus to-dial knowI'msayin?\nBig shouts to the LES baby we see you\n\nPut on Stella performances\nWhile niggas place bids at auto auctions\nRe-model frames and changin rusty engines and courting\nAnd while you Forman fools wanna shorten my life\nMy life is like survival organs\nIt's not important that you're this lyrical dissertation\nTossing lineal (????) break your vinyl\nChronically spotting spiral perhaps spinning out wax\nYo ?Nas? put the black wars on elegant floors\nThe teachers got operations make em insecure\nGypsy cabs I flag Donnas DC slam that ass take a detour\nAffiliates with my predominately black landscape\nHop the squad I watch the sling shot from rotting up your pin spot\nJostling nigga (????) playing possum\nI got the X-ray vision\nAin't nothing poppin while the tears who interfere\nAnd the fears they disappear\n\n(Chorus)\n(B-Real)\nDon't want to do it but they wanna\nJust the Intellectual ganja puffin dons causing trauma\nDon't want to do it but they wanna\nJust the Intellectual ganja puffin dons causing trauma\nDon't want to do it but they wanna\nJust the Intellectual ganja puffin dons causing trauma\nDon't want to do it but they wanna\nJust the Intellectual ganja puffin DONS\n\n(Outro)\nAh man that's the Call O' Da Wild flavor baby\nI can't take it no more I'm outta here baby\nBut before we get up out I wanna give big shouts\nTo all the Buddha spots that made this possible\nBig shouts to the 99 cents store baby\nThe discount health foods knowI'msayin?\nAll the brothers on the Lexus ail with that good, goodness\nBig shouts to the party bag shop\nTo all you other food spots on your roster crew with the end shit\nYeah we out baby don't forget to flip this to the other side\nGet with that Call O' Da Wild baby, it's like that yeah", "image": "https://images.genius.com/5bfb3c1df682504d29cac02d808840bd.600x608x1.jpg"}], "artist": "Cypress Hill"}