{"songs": [{"title": "No Permission", "album": "KHALIFA", "year": "2016-02-05", "lyrics": "[Intro: Wiz Khalifa]\nWhen I ride by, I want you to see what I see\nYeah, yeah, yeah, yeah, yeah\nShit's very clear, uh\n\n[Verse 1: Wiz Khalifa]\nPass me a joint, guarantee Imma hit it\nCome to that life, I don't talk it, I live it\nI got a old school ass car you can sit in\nI got a crib that you probably can't get in\nI got a pound, we can grind it and twist it\nI been at work on the grind for a minute\nSmokin' that loud and still mindin' my business\nShe fuck with me because I got the vision\nCountin' my benjis\nPuttin' it all in the bank but I don't really mind if I spend it\nCan't take it? Don't cross the line when you finish\nWhen you stay all on your grind you can get it\nWhen we be fuckin' I'm climbin' up in it\nShe fuck with me because I got the vision\nHaters be talkin', don't mind 'em, don't listen\nDuckin' 'em shots, that's divine intervention\nI be so high, you should prolly come visit\nYou make a choice, hope you like your decision\nCome to my crib, we can spark and get lifted\nGo up in smoke just like I'm a magician\nShe ain't have fun, then she probably was trippin'\nShe fuck with me because I got the vision\nGet to this money, get high, my intentions\nFamily first, that's a valuable lesson\nShe fuck with me because I got the vision\nI fuck with her, when I'm talkin', she listen\nWhen we together, we stick to the mission\nSparkin' that weed up without no permission\nShe fuck with me because I got the vision\nI fuck with her, when I'm talkin', she listen\nWhen we together, we stick to the mission\nRollin' that weed up without no permission, uh\n\n[Hook: Wiz Khalifa]\nOh, oh\nMoney come and money go, we stay the same though\nOh, oh\nMoney come and money go, we stay the same though\nOh, oh\nMoney come and money go, we stay the same though\nOh, oh\nMoney come and money go, we stay the same though\n\n[Verse 2: Chevy Woods]\nStill getting richer, her friend came for Richard\nThey answer my calls and I guess you don’t know 'bout this blessing you missin'\nKeys in ignition, ready to start it\nKilling that pussy, that’s dearly departed\nOK, now give me your thoughts on this carpet\nJust got the call, Imma pull up and park it\nSmellin' like kush, what could you tell me?\nBody all chocolate like Keisha in Belly\nDamn girl I like what you do with that jelly\nYou here for your interview, shoutout O'Reilly\nWe gettin' money nigga case closed\nAll hundreds to the bankroll\nIf you coming nigga, let’s go\nI’m talking crab with the eggroll\nJust shot a text “What you doin tonight?”\nOh is you down for the chewin' the night?\nTurn off the lights but that ain’t what I like\nI want to see what you do in the light\nTold me you grown and don’t need no permission\nIf it hadn’t been for you Ima need intervention\nHold up a second, I’m talkin', just listen\nWhat’s on your mind?\nDon’t make no decisions\nI’m gone", "image": "https://images.genius.com/329866c1bd0be13efe2300615c0293e5.1000x1000x1.jpg"}], "artist": "Wiz Khalifa"}