{"songs": [{"title": "Speech to Malcolm X Grassroots Movement", "album": null, "year": null, "lyrics": "First I want to say, Peace to my mother. She’s not here, but I gotta give a peace out to her. Because I wouldn’t be here if it wasn’t for my mother.\n\nI looked on the front of this thing, and it said, “Start from within to rebuild our original greatness,” right? OK, well, that’s what my mother did, know what I’m sayin’. And I’m listening about freedom fighters and strugglers, and you gotta understand that  when it was in to have a gun and be in the street, my mother gave that up to be in the house and wash the dishes and feed us and put the thoughts in our brains. Because we didn’t get any of that history from any of those soldiers that we lost--we got none of that. They all went to jail, if you can remember. They all went to penitentiaries. We didn’t see none of that knowledge. If it was not for my mother, who stayed home and didn’t go out and do all that, then I wouldn’t have had shit--excuse my language. But I wouldn’t have been nowhere.\n\nSo, what I want to do, hopefully, is, I want to be--I am--Tupac Shakur. I have to be a reminder that it ain’t time to cool out, banquets and all that--it’s still on. It’s on just like it was when you were young. And you want to say “fuck that” just like you said “fuck that” back then. So how come now that I’m 20 years old, ready to start some shit up, everybody’s telling me to calm down. You know, don’t curse, go to school, go to college...well, fuck that. We’ve had colleges for a while now, now i'm saying, and there’re still Brenda’s out there, and nigga’s is still trapped. And it gets me irked [laughs] because I understand that it’s not gonna stop. It’s not gonna stop until we stop it.\n\nAnd it’s not just white men that’s doing this to Brenda, and it’s not just white men that’s keeping us trapped. It’s black, you know what I’m sayin’? We have to find the new African in everybody, in all of us. Because if we keep running around looking for black and who got the most colors on and who got the baddest dashiki on, we still gonna get--and excuse my language--fucked.\n\nIt irks me right now that my mother is going through, you know, she has to get clean.  This is somebody I watched travel the whole country, during the time when women were scared to speak up for the Black Panthers. She spoke at Harvard, Yale, everywhere, and now I see my mother as what’s really going on, and I don’t see no big parades around my mother now. And she done got dozens of fucking awards. And I don’t see nobody there. You understand what I’m saying? So about all this, I take that lightly. I take all this lightly.\n\nWhat I want you to take seriously is what we have to do for the youth, because we coming up in a totally different world. This is not the same world that you had. This is not the 60s, this is not that. You grew up B.C.--before crack. That should say it all. We did not grow up with our parents. You had parents, that told you this and that and this is what went on back in the day. Now do you don’t have that. You have young kids, fourteen, coming home and their mama’s smoking out, or doing it to their best friend to get the product. You understand what I’m saying?\n\nSo that means, it’s not just about you taking care of your child; it’s about you taking care of these children. It hurts that--no, it bothers me, not hurts--that I have to sidestep my youth to stand up and do some shit that somebody else supposed to be doing. It’s too many men out here for me to be doing this. It ain’t my turn yet. I’m supposed to be following behind him, getting the knowledge. I don’t even have a chance to get the fucking knowledge. I can’t go to college; it’s too much problems out here. I don’t got the money, nobody do.\n\nSo what I’m saying is that it’s not as easy as we mapping it out to be, and we gotta stay real. We gotta stay real. Before we can be new Africans, we gotta be black first. We gotta get our brothers from the street like Harriet Tubman did. Why can’t we look at that and see exactly what she was doing. Like Malcolm did, the real Malcolm, before the Nation of Islam. You gotta remember: this was a pimp, a pusher and all that. We forgot about all that. In our striving to be enlightened, we forgot about all our brothers in the street, about all our dope dealers, our pushers and our pimps, and that’s who’s teaching the next generation. Because y’all not doing it! I’m sorry, but it’s the pimps and the pushers who’s teaching us. So if you’ve got a problem with how we was raised, it’s because they was the only ones who could do it. They the only ones who did it. While everybody else just wanted to go to college, and, you know, “everything has changed,” they were the ones telling you, “The white man ain’t shit. Here you go, check this out, young blood: You take this product, you switch it, you make money, and that’s how you beat the white man. You get money, and you get the hell up outta here.” Nobody else did that. So I don’t want to hear shit about nobody telling me who I can’t love and respect until you start doing what they did.\n\nTo me, this is Mecca. This is the black family--I see it here. But what makes it that much sadder, what makes me wanna cry is that, soon as I leave here, so does Mecca. We going back to the real deal. Right out there, you gonna see them same sisters in Brenda, they right out there. And y’all gonna get in y’all’s cars and drive the fuck home. I apologize. I apologize, but check this out: you can’t be no more offended by my cursing than what’s really going on. That’s real. That’s real, y’all. Because we letting the media--and the white man--turn us off. You letting them say that the rappers ain’t real, and either gotta be the ‘intelligent person’ or you a ‘gutter person.’ We all the same. We all feel it like y’all feel it.  I just can’t hold a straight face when I see it.\n\nThis is proof that we can be together. The young black male is the future of us. And the young black sister is the future of us. It’s gonna be what you put into it. So if you don’t put shit into it, don’t get mad when we blow up.", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}