{"songs": [{"title": "Why (German Remix Version)", "album": null, "year": "2004-01-01", "lyrics": "[Verse 1: Jadakiss]\nAha\nIt's dead real\nYo, why is Jadakiss as hard as it gets\nWhy is the industry designed to keep the artist in debt?\nAnd why them dudes ain't ridin' if there part of your set?\nAnd why they never get it poppin' but they party to death?\nYea, and why they gon give you life for a murder?\nTurn around only give you eight months for a burner, it's goin down\nWhy they sellin' niggas CD's for under a dime?\nIf it's all love daddy why you come wit your nine?\nWhy my niggas ain't get that cake?\nWhy is a brother up North better than Jordan?\nThat ain't get that break\nWhy you ain't stackin' instead of tryin' to be fly?\nWhy is rattin' at an all time high?\nWhy are you even alive?\nWhy they kill 2Pac n' Chris?\nWhy at the bar you ain't take straight shots instead of poppin' Criss?\nWhy them bullets have to hit that door?\nWhy did Kobe have to hit that raw?\nWhy he kiss that whore?\nWhy?\n\n[Hook: Anthony Hamilton]\n\nAll that I been givin'\nIs this pain that I've been living\nThey got me in the system\nWhy they gotta do me like that?\nTry'd to make it my way\nBut got sent up on the highway\nWhy, oh why?\nWhy they do me like that?\n\n\n\n[Verse 2: Jadakiss]\n\nWhy would niggas push pounds and powder?\nWhy did bush knock down the towers?\nWhy you around them cowards?\nWhy Aaliyah have to take that flight?\nWhy my nigga D ain't pull out his Ferrari?\nWhy he take that bike?\nWhy they gotta open your package and read your mail?\nWhy they stop lettin' niggas get degreez in jail?\nWhy you gotta do eighty-five percent of your time?\nAnd why do niggas lie in eighty-five percent of they rhymes?\nWhy a nigga always want what he can't have?\nWhy I can't come through in the pecan Jag?\nWhy did crack have to hit so hard?\nEven though it's almost over\nWhy niggas can't get no jobs?\nWhy they come up wit the witness protection?\nWhy they let the terminator win the election?\nCome on, pay attention\nWhy sell in the stores what you can sell in the streets?\nWhy I say the hottest shit but be sellin' the least?\nWhy?\n\n[Hook: Anthony Hamilton]\n\nAll that I been givin'\nIs this pain that I've been living\nThey got me in the system\nWhy they gotta do me like that?\nTry'd to make it my way\nBut got sent up on the highway\nWhy, oh why?\nWhy they do me like that?\n\n[Verse 3: Kool Savas]\n\nOK!\nWarum macht Mel die besten Beats die es gibt?\nWarum bin ich anstelle du auf diesem Track hier mit Kiss?\nWarum spitt ich so sick?\nWarum laden Kids runter statt zu kaufen?\nWarum sind Kids statt zu Hause draußen, rauchen und saufen mit 12 und 13?\nWarum fickt Fernsehen dein Hirn?\nUnd warum meinen Lehrer sie hätten Recht, obwohl sie sich irren und wollen uns verwirren?\nUnd warum bloß ist alles so schwer, alles so kompliziert?\nWarum bin ich nicht dumm und merk nicht was um mich herum passiert?\nWarum reden Mädel zu früh, geben Schädel zu früh?\nWarum betrügt man seine Frau obwohl man sie liebt?\nWegen dem Trieb!\nWarum buckelt man sich tot, doch verdient einfach nicht mehr?\nWarum verdien ich nich einfach noch mehr?\nWarum flieg ich nicht gern?\nWarum war gestern jeder auf Jungle, heut jeder auf Ragga?\nWarum sind Rapper nicht sie selbst, sondern Gangsta und Gutter?\nWarum schreiben sich diese 16 Bars wie von selbst?\nWarum buddelt ihr euch nicht einfach ein Loch und vergrabt euch selbst?\nWarum?\n\nHa!\n\n[Hook: Anthony Hamilton]\n\nAll that I been givin'\nIs this pain that I've been living\nThey got me in the system\nWhy they gotta do me like that?\nTry'd to make it my way\nBut got sent up on the highway\nWhy, oh why?\nWhy they do me like that?", "image": "https://images.genius.com/34d1815281afeb502b98075367058136.453x453x1.jpg"}], "artist": "Jadakiss"}