{"songs": [{"title": "Hold Down the Fort", "album": "Juvenile Hell", "year": "1993-04-13", "lyrics": "Yeah, we gotta hold down the fort\nWe gotta hold down the block\nWe gotta hold down the fort\nWe gotta hold down the fort, check it\nNineteen-ninety-motherfuckin-three right?\nWhat's YOUR new year's resolution motherfucker?\nCheck this out\nWe gotta hold down the block\nWord is bond kid, uhh, aight\n\n[Prodigy]\nBeef on the block, who is he?\nSet it Dunn, me and my automatic likes to get busy\nGhetto representer, there ain't no motherfucker better\nWhile you be catchin feelings like a love letter\nI gotta hold down my fort and won't lose\nNigga die, because I got the tec 9 blues\nBulletproof Polo, I'm goin out solo\nWhoever wanna come better step like they know cuz\nI'mma survive, more rougher than a certified\nAround the way, parlay and get high\nMy mega blast'll last in days to pass\nNiggas shoot, too fast, to pull out your gun last\nThat's why I like to spark first, and shoot your\nBitch-ass down your next ride'll be a fuckin hearse\nCause little niggas don't die son\nHalf-step and get that ass lit up like a flare gun\nCops they want static, whatever they can have it\nMy name is Prodigy and I'm known to cause havoc\nAnd when I flip I be on some ill shit\nI walk the street, like a real super trooper\nThe block shit proper, who once got had\nMad beef with the dread who sold me that dirt bag\nMad props to the bad little niggas in the neighborhood\nLong live the short, gotta hold down the fort\n\nGotta hold down the fort\nGOTTA HOLD DOWN THE FORT\nWe gotta hold down the fort\nYOU GOTTA HOLD DOWN THE FORT\nWe gotta hold down the fort\nYOU GOTTA HOLD DOWN THE FORT\nSo hold me down son (YEAH)\nHold me down (YEAH YEAH)\n\n[Havoc]\nYeah how we go son, pull out the motherfuckin M1\nStraight from the 'Bridge so you know where I'm from\nThe little, project nigga, I gets no bigga\nYo, my crew is buck so motherfuck how you figure\nStep the fuck back, nigga, attack with the mack\nCause word is bond it's on\nShit is real around the way so sit back and take notes\nDead you on your coat, then cut your motherfuckin throat\nTakin life like a thief in the motherfuckin night\nWhile I write write, you bite bite bite\nNiggas wanna step to my business\nBut I just parlay and sip on my Guinness\nCause I'm the ripper, Mr. Flip the Scripture\nNiggas can't fuck with the flow of a real lil nigga\nI wreck shop, in fact, get the mac, this is real\nShit is real, how the fuck you figure, nigga nil\nSo son hold me down while I pull out the Glock\nGotta hold down the block, that's word to my pops\nSo once again it's on, light up the chalm\nTime to drop the bomb, word is bond\n\nWe gotta hold down the block\nHOLD DOWN THE BLOCK\nWe gotta hold down the block\nWE GOTTA HOLD DOWN THE BLOCK\n\nYo son he pumpin over here Dunn?\nI know he ain't pumpin over here yo\nYo word is bond yo son peep he comin over let's bring it to him\nWhat, what? What what what, what?\nWho the fuck are you?\nMan fuck that, what? *automatic spray*\n\nHOLD DOWN THE BLOCK\nYeah whattup now? What what, what what?\nWhattup now?\nHOLD DOWN THE BLOCK\n\n[Prodigy]\nTo all the niggas that's live or real\nYou gotta hold down your block, cock back the Glock\nFuck the cops, cause your neighborhood chores\nIf they beef, make em bleed on the project floors\nI get my kicks from loadin up gun clips\nDon't fuck with suburb chicks, I need a gangsta bitch\nDon't need a crew, I can bust you down solo fast\nAnd after that, dip into the weed stash\nI'm quick to blast, enemies won't last the fate\nI kill em fast so they can't retaliate\nCause when I'm not alive who'd takes my place\nTo hold down the fort, we move on\nMy man got my back\nI'm ready to go at anybody, who think they John Gotti\nPeace to Manny C, good lookin out B\nI'm Hellbound, got my block locked down\n\nWe gotta pull out the Glock\nGOTTA PULL OUT THE GLOCK\nWe gotta pull out the Glock\nWE GOTTA PULL OUT THE GLOCK\nWe gotta pull out the Glock\nWE GOTTA PULL OUT THE GLOCK\nWe gotta pull out the Glock\nWE GOTTA PULL OUT THE GLOCK\nWe gotta pull out the Glock\nWE GOTTA PULL OUT THE GLOCK\nWe gotta pull out the Glock\nWE GOTTA PULL OUT THE GLOCK\nWe gotta pull out the Glock\nWE GOTTA PULL OUT THE GLOCK\nWe gotta pull out the Glock\nWE GOTTA PULL OUT THE GLOCK\nCheck it, yeah\nCall that nigga", "image": "https://images.genius.com/2ca92566d6769c85797a1f455575d4b8.597x597x1.jpg"}], "artist": "Mobb Deep"}