{"songs": [{"title": "Special", "album": "Honest", "year": "2014-04-22", "lyrics": "[Intro]\nFreeband Gang!\nIts only the chosen ones(Its only the chosen ones,Its only the chosen ones)\nThat come from nothing and make millions(jaiha)\nAnd continue doing it\n\n[Hook: Future & (Young Scooter)]\nYou ain't even tryna be special(tryna be special, tryna be special) (jugg nigga)\nYou ain't even tryna be special( tryna be special,tryna be special) (go to work)\nYou ain't even tryna be special(tryna be special,tryna be special) (chea)\nI thought you was someone special (jugg)\n\n[Verse 1: Future]\nYou keep breaking down in front of me\nHow thats gon' look to my niggas when they honor me\nI set the tone of this i can't let no one intervene\nYou can't take my pressure you probably be done blowed your brain\nThese bitches wanna use everything I worked for the fame\nYou know the dues I paid but the money drive 'em insane\nThey wanna go to court and sue me and take everything\nThis devil working on yo niggas and they taking aim\nI’m on a high and I'ma stay up here right with the planes\nYou got a Grammy and young nigga on that purple drank\nI'm a motherfucking astronaut and I'm untamed\nI made a million off of metro ask the dope game\nI booked the show up and rock the show up like some cocaine\n\n[Hook]\nYou ain't even tryna be special(tryna be special, tryna be special)\nYou ain't even tryna be special( tryna be special,tryna be special)\nYou ain't even tryna be special(tryna be special,tryna be special)\nI thought you was someone special\n\n[Verse 2: Future]\nI bag bitches Burkin bag on bad bitches\nRags to riches I had it never lost it\nI stayed at it I stayed flossing\nI been sleeping' in dope houses\nMy mind wasn't even there nigga\nI'm rare nigga\nI been there nigga starving\nMy confidence been there nigga\nWhen I was serving off them quarters\nYou wouldn't even though we had a plug\nYou wouldn't even think we had a plug\nFrom crumbs to bricks I been special (I been special)\nFrom crumbs to bricks I been special\nWe here nigga\nThey counted us out we bounce back nigga\nNow they back round with us\nLike they was hustlin' back wit us\nWhen we was puttin' that real on top fake in the middle\nTurn that cake into some ice nigga\nIts Black Migo for life nigga\nBlack Migo Gang we here, the original - salute!\n\n[Hook]\nYou ain't even tryna be special(tryna be special, tryna be special)\nYou ain't even tryna be special( tryna be special,tryna be special uuuu)\nYou ain't even tryna be special(tryna be special,tryna be special\nI thought you was someone special( someone special, someone special)\n\n\n[Verse 3: Future]\nHis momma hate me her mamma hate me\nThey hate I made it\nThey love when I struggle they love when I suffer\nI got all the scars to prove it\nI took my scars and made a movie\nI got all my niggas with me through the bad and the good\nI got all my jewels on me and I'm still in the hood\nI can never stop from grinding cause I made it out the mud\nI can never forget when I was on the block selling drugs\nCodeine calm my nerves I was getting high since a kid\nI took all my problems and I turned it all into hits\nI can channel my anger now I can go make me some billions\nThey trynna' predict my next move but I say fuck politics\nLong as I stick to the formula I'm never gon' switch\nFreeband gang for life thats the blueprint\n\n[Hook]\nYou ain't even tryna be special(tryna be special, tryna be special)\nYou ain't even tryna be special( tryna be special,tryna be special uuuu)\nYou ain't even tryna be special(tryna be special,tryna be special\nI thought you was someone special( someone special, someone special)\n\n[Outro: Young Scooter]\nJuug!\nJuug!\nJuug!\nCount Up!\nYoung Scooter\nBlack Migo Gang", "image": "https://images.genius.com/954d4bfb2f1a939623e43520199dcb34.500x500x1.png"}], "artist": "Future"}