{"songs": [{"title": "E and 1 Equal None", "album": "I Miss the Hip Hop Shop", "year": "2004-06-15", "lyrics": "{Verse 1}\nHey yo, I got a friend by the name of Mu he hangs out with Proof and we all stay crew\nI gotta group by the name of (??) ain't nuf (??) with saliva Kuniva\nAin't I thought that youse on top then fell to nuttin\nNow let me tell you something you don't know why the hell you frontin\nBut I do, you and your brother had the game on lock\nWhen it came the independence had your name on top\nBut then came Suge and Master P then your switched the shit\nNo more acid raps, you flipping bricks\nI witnessed you get chased by Champtown\nAnd now you want me to believe you pushing weight now\n8 Mile was out, (??) filled with (??)\nNo matter how much your front, you gotta deal with war\nIn the D, we all see you ain't no cap-peeler\nLocally, it's rock bottom, tell the boys im (??) so\nDo you, motherfucker, and I'll be me\nI can't believe the devil signed up with ICP\nIf that's your move I respect it, ain't no fronting, just know that nothing from nothing leaves nothing, motherfucker\n\n[Chorus]\nI stand where I stand and I am what I am\nAnd I'll be damned if I let a nigga get in my clan\n(SO!)\nI'll do me, fool, you do you\nAnd all the loud mouth talking just WHOOPTIE WHOO!\nI stand where I stand and I am what I am\nAnd I'll be damned if I let a nigga get in my clan\n(SO!)\nI'll do me, fool, you do you\nAnd all the loud mouth talking just WHOOPTIE WHOO!\n\n[Verse 2]\nFirst off, the real first name is Cleveland (??)\nI stab your tongue with a knife 'til it's bleeding words\nI'm a wanksta\nMotherfucking bitch, I'll thank you\nRemember never say I'm a gangsta? (Now that's gangsta!)\nDon't be mad that you got smacked, punched & slammed\nThis is all day, I ain't even got to touch you, man\nWhat the plan?  Diss Proof and build your name\nYou ain't Pac or Big, but get killed the same\nAlong with Ja Rule, Benzino with any other people for that matter\nSpread venom, Proof will come and see you\nI stand where I stand, I am what I am\nAin't playing with a Stan, I'm a dangerous man\nDon't care about nothing you say, nothing you do\nWe coming for you, get your guns and your crew\nGot a plan in my mind, a clan on the rise\nI tell you like this, I'm (?), goodbye\n\n[Outro]\nTell you like this, this is it\nAll right\nI'm through dissing Esham\nEsham, you quit dissing me, man\nYou know what I'm saying?\nI ain't even wasting any more time\nLet's do it like this, acronym for your name\nE.S.H.A.M.: Every Sucker Has A Moment\nWhen you and your brother was on, y'all was on top then\nIt's over with\nGive it up, nigga\nNo one more acid rap\nNobody wanna hear that bullshit you talking, all right\nMan, nigga, first born\nIt ain't my fault there's another first born\nOn top of that, he's older than you\nSo he gotta be first born before you was a first born\nDo the math on that shit and grow up nigga\nYou know what I'm saying?\nAnybody else go and diss me, guess what?\nI ain't even gonna respond\n'Cause y'all gone think it's a little thing I do\nI just sit down, beef with all them niggas\nHey, yo\nBring-bring that chorus\n\n[Chorus]\nI stand where I stand and I am what I am\nAnd I'll be damned if I let a nigga get in my clan\n(SO!)\nI'll do me, fool, you do you\nAnd all the loud mouth talking just WHOOPTIE WHOO!\nI stand where I stand and I am what I am\nAnd I'll be damned if I let a nigga get in my clan\n(SO!)\nI'll do me, fool, you do you\nAnd all the loud mouth talking just WHOOPTIE WHOO!", "image": "https://images.rapgenius.com/aece9683c72b6881e3aced04d6bb0db4.225x224x1.jpg"}], "artist": "Proof"}