{"songs": [{"title": "Talk to Ya", "album": "Prince of the City 2", "year": "2007-11-20", "lyrics": "[Intro: Wiz Khalifa talking]\nYeah. so i seen her from afar\nIm sayin to her come over to the car\nShe like \"You some kind of star\"\nIm like :naw naw naw, chill chiil\"\nNam sayin thats that name\nI figure id put a little bit of this game all in her brain\nI told her i ain't gone hold you, damn sure ain't tryna control you, but ill mold ya\nShe looked at me like she ain't believe me\nSo i figure i show ya\n\n[Verse 1: Wiz Khalifa]\nSaid she never felt like this before\nWhen im home we get it on. Im on the road she miss the ball\nAnd you thick for sure know how to work them hips right\nLevel with my swisher says i show her how to twist right\nAnd when i gotta make moves she keeps her lips tight\nTell her that the money stacked so she let me get right\nAnd that sex get good on them late nights\nNothin but thumbs up like a hitch hike\nYes im the shit like\nYou ain't never heard of\nAnd you know how i do\nAct like you dont but now i learn ya\nIm talking about teaching ya\nHow about schoolin ya\nGo and do your thang gimme brains, ill tutor ya\nSo many of them lames\nA real niggas somethin new to ya\nNow your tellin all your friends what i do to ya\nBut its cool ya know? I leave her spine broke\nWhen im up inside, make her breath and hit a high note\nLike...\n\n[Interlude: Kev da Hustla talking]\nYeah, so I'm standin on the corner\nShorty ride through. She pushed the whip like ya know?\nMe and my nigga Wiz...blowing on that good I'm like...\nWe gotta stop shawty. See jump out....\n\n[Verse 2: Kev da Hustla]:\nAnd now i approach her\nLike whats your name\nYou get the picture shorty i really like your frame\nThat coke bottle shape and them asian eyes\nYour half black and half you ain't gotta tell the guys\nShit wonder why i approached her\nI wanna get to know ya but i ain't tryin to hold you\nBack from all your dreams and high hopes\nYou smell that mami\nYeah thats real smoke\nListen i got plans too\nYou know how your man do\nIll get close before i try to cuff hands boo\nYour for your latest shidd\nYeah thats my favorite\nRoom lit like vegas\nHe point like \"pay them\"\nMami ya body amazing\nLights off no cable\nI found out she a mind freak like chris angels\nBendin over tables, giving her all she handles\nI swear to god her room sounded like this damn sample\n\n[Interlude: Wiz Khalifa talking]\nYesss, I seen my man Kev The Hustla over there on somethin bad\nI mean bad. So i mean, i finish rollin up my weed\nHop out the car, i see a couple of little ones\nOver there lookin kind of lonely ya kno\nIm sayin not preferably one, she looking at me\nI seen her smilin and all that\nLike she know who a nigga is\nSo you know what i do, i walk straight up to her like...\n\n[Verse 3: Wiz Khalifa]\nEy ey shorty i just wanna talk to ya\nUsually keep it moving but i had to stop for ya\nAnd let you know any thing less than me is not for ya\nNo time to waste i got patience like a doctor do\nAnd this may be a lot for you\nSo why dont you fall in\nHit some of this weed and soak it all in\nGot game like the ball in\nAnd we ballin goin state to state call me rawlings\nLook dawg i ain't tryna start nothing\nShe laughed and said that you kinda star or somethin\nIm like nah im playin with you ma i'm frontin\nThey call me young wiz\nGet up in my car or somethin\nWe could talk about your day why im cigar stuffin\nHeres my phone give me a number that i can call or something\nGet you back to your crib and have the walls jumpin\nScreamin at the top of your lungs like....", "image": "https://images.genius.com/68cfefda5eadd906284dd844e0bf9b61.1000x1000x1.jpg"}], "artist": "Wiz Khalifa"}