{"songs": [{"title": "Right Back At You (Original Version)", "album": "The Infamous (Demo Tape)", "year": "1994-01-01", "lyrics": "[Produced by Havoc]\n\n[Verse 1: Prodigy]\nNow, '94 to '95, innocent without crime...\n(Drop that shit) Yeah, yeah, check it out\nNow run for your life, or you wanna get your heat, whatever\nWe can die together\nAs long as I send your maggot ass to the essence\nI don't give a fuck about my presence\nI'm lost in the blocks of hate and can't wait\nFor the next crab nigga to step and meet fate\nI'm lethal when I see you, there is no sequel\n24-7, mac 11 is my people\nSo why you wanna end your little life like this?\nCause now you've bumped heads with kids that's lifeless\nI live by the day only if I survive\nThe last night, damn right, I ain't tryin' to fight\nWe can settle this like some grown men on the concrete floor\nMy slugs will put a stop to your hardcore\nWays of action, I grab the gat, then\nAin't no turning back when I start blastin'\nPick up the handle and insert the potion\nCock the shit back in a calm like motion\nNo signs of anger or fear cause you the one in danger\nNever share your plans with a stranger, word is bond\n\n[Hook: repeat 2X]\nI put the drop on you kid, now I got you\nYou got the heart to get busy without your crew?\nLet's get it on nigga, do what we gotta do\nYou buckin' me, I'm buckin' right back at you\n\n[Verse 2: Havoc]\nFuck where you're at kid, it's where you're from\nCause where I'm from, niggas pack nothin' but the big guns\nAround my way, niggas don't got remorse for out-of-towners\nCome through fronting and get stuffed with the 3-pounder\nThe loud sounder, ear ringer\nAnd I'm a point the finger, on all you wannabe gunslingers\nYou got a real ice grill but are you really real\nStep to the hill and I'm a test your gun skills\nCause real niggas don't try to profile\nYou just a chump who needs to get drunk to buckwild\nBut swing that bullshit this way\nAnd I'm a make your visit to the bridge a motherfucking short stay\nQueensbridge, that's where I'm from\nThe place where stars are born and phony rappers get done\n6 blocks and you might not make it through\nWhat you gonna do when my whole crew is blazing at you\nWith macs and tecs to lend to get your dome crush\nYou thought that you could come around my way and beef, stupid fuck\nWhat the hell you smoking? What the fuck possessed you\nTo come out your face, now I have to wet you\nThrow on my Timbs, black mask and black serpent\nTwist a nigga cap, then jump in the J-30\n\n[Hook]\n\n[Verse 3: Hype Da Madman]\nStraight up and down, Imma let you know now\nYou feel the gunshot bloaw from the Red Eye style\nNow pass the owl and let me roll the method\nShit’s hectic while I’m cested, where’s the mic? Let me wreck it, check it\nMy rugged rhyme, lyrical design hit your spine\nEvery time that the Red Eye shine\nBlinds the naked eye cause they can’t see through\nThe smoked screen behind the scene stands the Red Eye crew\nNow it’s true, my spiritual comes through my physical\nBoth connected by the method, therefore I’m lyrical\nSo what you gonna down I come to pursue\nWith my Tec 22 and infra red on you?\nFor real, my laser beam likes to s[???] when I squeeze\nI’m like a sniper when I strike you, steady busting from trees\nMCs, you know my steez, I’m living trifle with the rifle\nPunks I make them st[???] feed they ass to my disciples\n\n[Verse 4: Big Noyd]\nMy little thug's selling drugs and he's struggling\nThe game got him bugging, I trying to tell him slow down cousin\nBut he vexed and niggas getting wet up in the projects\nBut with no doubt, shortie's out for his respect\nBut is his brain insane from the lye?\nFrom smoking that one eighteen tiny tye\nWhy, a nigga just died last week\nAs he swore he was grown and he's a thug in the street\nAnd it's like that, my crew pump cracks and we pack macs\nHis eyes is wild with the rezzy monkey on his back\nBut I'm stressed and I need to be blessed\nWith a firepack, don't even go there cause it ain't like that\nSlow down baby, he said, what, you trying to play me?\nYou must be crazy, pulled out the heat and almost blazed me\nThen he was Swayze...", "image": "https://images.rapgenius.com/d771033f8687bf7bd175167abb7a040b.619x401x1.png"}], "artist": "Mobb Deep"}