{"songs": [{"title": "Trap Luv", "album": "Hood Billionaire", "year": "2014-11-24", "lyrics": "[Skit: Kenneth \"Boobie\" Williams]\nDudes can't appreciate, you know what I'm saying, county and wealth, you know what I mean, as far as like inner wealth, you know what I mean? When you see when you the fool\n\n[Intro: Yo Gotti]\nI'm in a jungle\nLions, tigers and gorillas and shit nigga\nIt's a lot of monkey ass niggas out here too\n'Lotta hustle nigga\nRules, laws, strategy\n\n[Verse 1: Yo Gotti]\n10 million dollars later I'm a blessin' nigga\nHow a nigga rich but still stressin' nigga\nGlock .40, Smith & Wesson nigga\nStreets will never ever stop testin' niggas\nYoungin' give 'em a head shot, send a message nigga\nPart rapper, part goon, still finessin' nigga\nI believe in hustle I don't fuck with luck\nAnd it's fuck em kill em all if they don't fuck with us\nThem three letters mean a lot boy, sacrifices\nCocaine Mafia, double check the prices\nNiggas killin' niggas like they got a license\nNiggas crossin' over like they Allen Iverson\nFuck that iPhone 6, they be trackin' niggas\nI'm about to get a beeper, fade to black on niggas\nGotti, goodnight, I'm gone\nI be back when they quit livin' through phones\nWhen niggas put the gram down and pick the grams up\nYou got follows but no dollars man that shit ain't addin' up\nNah, and all the dirt I done, all the bricks I sold\nI can't sleep at night, paranoid it shows\nI be strapped on stage, fuck the award show\nCause I shoot this bitch up and only God knows\n\n[Skit]\nYeah like I told you a long time ago fam, y'all gon' hold it against you. I keep fightin' doin' this to y'all. Every time I get somethin' in the mail whether it's favorable or not from the courts, I keep puttin' it down because y'all are my motivation. I appreciate the love\n\n[Verse 2: Rick Ross]\nNiggas ridin' gold rims and they mama po\nAnd they kill a family member for that envelope'\nI'm the Lionel Richie to these Commodores\nWe flipped pies to franchisin' Dominoes\nI speak for dope boys every track I'm on\nUntil this day my people never rat or told\nPosted 20 in, I'm talkin' fed pen\nThe line between us both have gained so very thin\nAmongst my boys, I'm W.E.B. Du Bois\nSouls of black folk to hustle wasn't a choice\nRap game everybody skimmin' off the top\nFuck the interest as long as you pull it off the lot\nHoes wanna fuck, haters wanna hate\nCertified sack boy, black Ronald Reagan\nDouble M no longer that Buick Regal money\nNickel bag niggas so don't make me put a kilo on it\nNegotiatin' for it or either we take it\nNiggas even shootin' choppers in a fuckin' cadence\nFell out with some people that I still love\nI guess that's how it goes when it's real blood\nI remember countin' cash standin' in the trap\nI turned my hat to the back, had a hundred stacks\n60 M's later, it's 300 tax\nStill losin' weight with the south on my back, nigga\n\n[Bridge: Rick Ross]\nI pray you play by the rules\nI came so close to the edge\nI pray you play by the rules\nI came so close to the edge\nI pray you live by these rules\nWe came so close to the edge\nI pray you play by the rules\n\n[Outro: Rick Ross]\nAin't no mercy young nigga\nIt's the jungle, locs\nAnd I pray you rich forever\nGotti, I pray you rich forever\nAll my niggas I pray you rich forever\nWhen you smokin' and you vibin' to this shit\nI pray you rich forever my nigga\nHood Billionaire", "image": "https://images.genius.com/bef9a0948252c91da2c707ba7803fcfd.1000x1000x1.jpg"}], "artist": "Rick Ross"}