{"songs": [{"title": "You Ain’t Got Time", "album": "The World Is MIND", "year": null, "lyrics": "[Chorus: Malcolm X]\nTo have once been a criminal, there’s no disgrace\nTo remain a criminal, is the disgrace (That’s right)\n\n[Verse 1: KRS-One]\nPolitics is a pile of tricks\nEight years, what do we get out of it?\nMore chatter, more gun splatter\nMore dumb rappers, and dumb athletes and actors\nMy name’s revolution, open your eyes\nI'm not on TV, 'cause the revolution will not be televised\nThey telling lies, we better rise and get a plan\nThe US President? He’s endorsed by the Klan\nDamn\nYou don’t understand what’s going on?\nSlavery coming back and most of y’all just gonna go along\nNot me, they ain’t veiling me\nYou can see, I ain’t vote for the president or Hillary\nAmerica tryin’ to put the fear in ya\nThey the reason for the fake war there in Syria\nSo when I grab the mic, I spit a full-clip\nWake up, you ain’t got time for this bullshit\n\n[Chorus: Malcolm X]\nTo have once been a criminal, there’s no disgrace (That’s right)\nTo remain a criminal, is the disgrace (That’s right)\n\nTo have once been a criminal, there’s no disgrace (That’s right)\nTo remain a criminal, is the disgrace (That’s right)\n\n[Verse 2: KRS-One]\nThis what the boom bap sound do\nSince way back in the Bronx, I had a sound view\nIf you hearin’ this, the truth, it just found you\nI’m in his town, her town, your town too\nMan, I stay ahead like a crown do\nLook around you\nKnowledge reigns supreme, this is what it comes down to\nPeople talkin’, but ain’t doin’ nothin’\nKRS ain’t about frontin’, let me tell you somethin’\nWe need unity at all cost, or everything is all lost\nThese lessons are hard, that tweeter shit is so soft\nBrothers killing brothers killing brothers with the sawed off\nNo remorse, brothers are hauled off up north\nWe off course, believe in the hype\nHonesty, we ignore; but that deceiving, we like\nThese rappers are corny, but you like, “He aight”\nYou lyin’ from the pulpit\nYou ain’t got time for this bullshit\n\n[Chorus: Malcolm X]\nTo have once been a criminal, there’s no disgrace (That’s right)\nTo remain a criminal, is the disgrace (That’s right)\nTo have once been a criminal, there’s no disgrace (That’s right)\nTo remain a criminal, is the disgrace (That’s right)\n\n[Outro: Malcolm X]\nI formerly was a criminal. I formerly was imprisoned, I’m not ashamed of that. You never can use that over my head. And—that—He’s usin’ the wrong stick, I don’t feel that stick", "image": "https://images.genius.com/e7b1daf2ed6f9ee66a79dbc610af91d7.1000x1000x1.jpg"}], "artist": "KRS-One"}