{"songs": [{"title": "What Happened", "album": "I’m Serious", "year": "2001-10-09", "lyrics": "[T.I.]\nThese niggas robbing me\nPray to God is nothing but a robbery\nI gave them all I had\nSo they pulled they lick off flawlessly\nThey yelling fussing cussing\nBut all I hear is heaven calling\nMe next thing I know they busting\nThey left me seven and they all in me\nOn fallen knees help me please death is all I see\nIf I die memory of a ballin G is all I'll be\nNever thought I'll be laying in a puddle of blood trying to breathe\nI don't want to die but something is telling me\nIt's time to leave say my apologizes\nMake a final peace wit God\nSeen my whole life flash before my eyes\nAnd now it's getting dark body temp done drop\nGoing in shock crying out in fear, close my eyes\nTake my last breath and I'm outta here\nIn my life I smoked a lot of weed\nDrunk a lot beer, sold a lot of ki's\nBut that shit don't even matter here\nSomebody said \"walk toward the light\"\nBut I ain't ready to go\nAm I dead? is it over? \"you ain't ready to know\"\n\n[T.I.]\nWell now I moving toward the light\nAnd I ain't walling or nothing\nI ain't like the shit\nWell hell I guess ain't use for me to try to fight\nThe shit what the business is you God\nI been waiting to meet you\nAnd I knew I been hearing bout yall\nBut like the one day I would see you\nBut why you let dem niggas kill me?\nYou could have done something why you ain't come down there\nAnd shield me when them niggas started dumping\nThen He say \"excuseth me\nBut I control no hatin\nAnd it cometh not from me\"\nWell who coming from \"Satan\"\nOh Satan did this excuse me Lord\nBut now that nigga's on my shit list and\nI know with all this fly shit you got a A-K\nOr a piston grip give me a clique of angels with bulletproof wings\nLucifer gon get piston whipped a lot of die I ain't scared\nWho he think he is fuck with Tip\nI got a A-K two 45's bout 50 clip I'm finna dip\nI ain't borrow shit I'm finna trip\nPut a piston grip in Lucifer lip\nAnd then he say \"two wrong doth make it not a right one a last\"\nWell forgive me cause\nI'm bout to ride out on Luficer's ass\nAnd all I need you to do is give me\nThe strength and Lord you know I'm need you\nWith the shit I'm finna attempt\nI'm fix to bust hell wide open fear don't control me\nAnd I'm O.G. hell can't hold me\n\n[T.I.]\nNow 'Pac and Biggie want ride too\nI guess that's cool since that muthafucker\nThe reason y'all niggas had to die too\nMy nigga Bankhead would be alive too\nShawty let ride\nIt's 4serious up here dough\nCause we don't ride we glide\nNow I'm strapped and ready folks\nBut I can't steam to do a thing\nWith these wings how I'm supposed to keep them steady folks\nWith a chopper on back of two 44's shawty no\nA the pain we finna bring\nI don't thing he even ready for\nWhen it's on you already know\nFarewell bruh. mama always told me\nI was bad enough to tear hell up\nI'm doing this for what you made of\nFrom that time you made the bitch eat the apple\nTo the time you pick your folks\nTo put us on the boat and enslave us\nWorked that never paid us\nKilled Malcolm X, Martin Luther King\nAnd everybody else tried to come down here and save us\nKept our fathers from raising us\nKidnapped us from our country\nTake your distance in our religional way\nWell now it's time for the cadet to busted\nWe want our spirits and our minds back now\nI'm getting mines right now\nPussy nigga lay it down I'm walkin\nThought hell kicking the devil doors down\nSpreading rounds waving cadet rounds\nWell I woke up I was lying down shawty\nWHAT HAPPENED?", "image": "https://images.genius.com/d4010b5f2aa7374582fd8c3be5913af3.1000x1000x1.jpg"}], "artist": "T.I."}