{"songs": [{"title": "They Still Like Me", "album": "Dedication 2", "year": "2006-05-22", "lyrics": "[Intro: Lil Wayne]\nOk, ok, ok\nMhm, M-mhm, that's what I'm talkin' bout man\nI killed that shit man, man that right there it's easy man\nYou know what I mean? Gimme somethin else man\nDrama I'm on fire man rock\nWatch this man\n\n[DJ Drama]\nLet's do this for Hollygrove!\nCan't forget Magnolia projects!\nShout to the N.O.!\nDJ Drama! Weezy F. Baby!\nDedication 2, let's go!\n\n[Verse: Lil Wayne]\nWeezy motherfucker, what it do? Holla at me\nAll the niggas tryin to hate me and the bitches tryin to have me\nI'm a money man, yep, I get it from my daddy, ho\nAnd boy, we can beef like Magnolia and Calliope\nHollygrove my barrio, let that automatic go\nTest me when I'm chillin and I kill you from my patio\nBitch, my shadow look good, I'm just feelin Weezy\nHop in my shit and say goodbye 'cause the ceilings leavin\nBelieve me, they ain't tryin to see me\nTell 'em I be the nigga with the burner in the beanie\nI'm the fireman, she just call me when she steamin\nI wet her up and put her out and leave the bitch dreamin\nNiggas say they hot but its really not steamin\nIf these guys bad, then I gotta be a demon\nWayne/Wayan's getting money like Damon and Keenen\nTry and take it from me and I'm aimin and beamin'\nBangin and leavin stains on the cement\nSlide the crackers something so they tame the policemen\nLeft in a Porsche, came in a Koenigsegg\nI'm fresh, yeah, the Gucci sweats came with the creases\nI'm hot but I'm cold, I just change with the seasons\nTryin to put some cheese on my pieces\nIf you lookin for your nigga, I be where the water gets deeper\nHuggin on that money, tryin' to put it in a sleeper\nYeah, I'm here, who the fuck wanna say somethin?\nLeave your whole head empty like a straight pumpkin\nMake no assumption, I'm hustlin\nYour girlfriend guzzlin when you thought she wasn't\nName still buzzin even when I'm doin nothin\nBut I'm never doing nothin 'cause I'm always getting money\nThat simple, jackass, if you don't get it, you're a dummy\nAnd them niggas that diss me ain't nothin but pure pussy\nSure, honey, I done heard what you said\nBut if a nigga really cared, tou'd already be dead\nJust a young ass nigga with some old ass bread\nYes I keep them dollars running like them bitches got legs\nNow my nigga Tez Po been ridin with me since pegs\nAnd my right wrist is looking like a cracked open egg, that's\nWhite and yellow diamonds, adjust your lighting\nI got 'em so mad but, oh I think they like me", "image": "https://images.genius.com/d3b5f479408c61bed346754e1bb3f8ad.1000x1000x1.png"}], "artist": "Lil Wayne"}