{"songs": [{"title": "The Old Us", "album": null, "year": "2019-02-27", "lyrics": "[Verse 1]\nI know this is super random\nWe done had our ups and downs and I done threw some tantrums\nI honestly care about you way more than you could fathom\nAnd God knows I ain't lyin’, if only you could ask Him\nI know you think our happiness just comes and goes in occasions\nWhen I leave Earth, I wanna be frozen in place\nWith a rose in a case full of love notes I wrote for the days I got to be next to you\nThat's how I feel and no one can change it, but\nI gotta get this tension off of my chest\n'Cause every day I feel a constant regret\nNow I can reflect to see the issues we never dissolved or suppressed\nI guess it’s only right that karma was next\nAnd I'ma be open and honest with you, your absence is causing the stress\nI wish the pain I feel would lay inside a coffin and rest\nAnd it's only you who can soften my flesh\nBut still you run me in circles and lately you ain't been responding to texts\nAnd now my only option is to act like I don't fucking need you\nI bottle up the pain although the bottle's fucking see-through\nI pray to God and wish that we could wash it up and re-do\nGuess every love story just ain't got a fucking sequel\nI just need to know if you feel the same\nWhy can't we kill the games and reconcile?\nI know you still afraid, we both stuck\nThere’s no trust, we gave our souls up the moment love had approached us, but—\n\n[Chorus]\nCan we go back to the old us?\n’Cause I just don't fuck with this new you\nLately you ain’t showin' no love\nYou act like I never knew you\nWe need to stop the games right now\nLet's stop the games, baby\nI need you to ease the pain right now\nI need you to keep it real with me, my love\nCan we go back to the old us?\n'Cause I just don’t fuck with this new you\nLately you ain't showin' no love\nYou act like I never knew you\nWe need to stop the games right now\nLet's stop the games, baby\nI need you to ease the pain right now\nI need you to keep it real with me, my love\nCan we go back to the old us?\n\n[Verse 2]\nOn my end there was mistakes made, I had too much pride to take blame\nThe moment my fame came, my ways changed\nI couldn't stay sane and started making our sunny days rain\nAnd even though my life has moved on, our history's too strong to forget\nI won't pretend I ain't stained\nAnd if you open up my fucking chest and take a look in my heart\nI swear to God you gon' see yo' engraved name\nHow you gon' leave me hanging?\nHow you gon' leave me achin'?\nI never did get my closure, so how you gon' mediate it?\nHow you gon' be when Zade is old enough to understand that his daddy isn't around?\nHow we gon' be related?\nAnd I just want my family on track, that's the plan we both had\nShit is sad because I'm askin' for a chance we don't have\nI fucking love you\nAnd I just had to grab my notepad just to write a song for you saying—\n\n[Chorus]\nCan we go back to the old us?\n'Cause I just don't fuck with this new you\nLately you ain't showin' no love\nYou act like I never knew you\nWe need to stop the games right now\nLet's stop the games, baby\nI need you to ease the pain right now\nI need you to keep it real with me, my love\nCan we go back to the old us?\n'Cause I just don't fuck with this new you\nLately you ain't showin' no love\nYou act like I never knew you\nWe need to stop the games right now\nLet's stop the games, baby\nI need you to ease the pain right now\nI need you to keep it real with me, my love\nCan we go back to the old us?\n\n[Outro]\nI'm sorry", "image": "https://images.genius.com/99b319baea5e0d550d83513f71578b03.750x750x1.jpg"}], "artist": "Hopsin"}