{"songs": [{"title": "Gangland", "album": "Monster", "year": "2014-10-28", "lyrics": "[Intro: Future]\nFuture Hendrix\nYeah\nIt ain't a secret\nStraight up\n\n[Verse 1: Future]\nI'm the one who got the presi' flooded\nYou wear more Chanel than anybody?\nYou the type to get ya man indicted\nI'm the type to pull up in a Spider\nI'm the type to drive a Hummer\nPut a hunna round clip inside a dirty rifle\nIt's dirty when it got a homi on it\nFuck that nigga put a bounty on em\nI'm the one that put that dirty in the cup\nHad you sippin', noddin' off nigga\nYou was gettin' fronted, runnin' off nigga\nI made myself to a boss nigga\nPut a hundred carats in a cross nigga\nPut a 200 thousand on a cross nigga\nCould never sleep cause it'll cost niggas\nThey can never see my palms sweaty\nYou never seen the hunger in me\nI'm so sick and tired of being humbled nigga\nThis money put a lot of demons in me\nWent and tatted all these angels on me\nFuck that nigga put a tracker on em\nThen we throw a pep rally on em\nThese commas coming in\nThese haters coming in\nThe karma coming back from when I was gettin' it in\nMy baby mama tryna sue again\nBought my little twins Christian Louboutins\nGet my nigga commissary in the pen\nGot the Federales on a nigga chin\nFuck the Benz, I'ma whip the Spur\nBut fuck my Spur, I bought my bitch a Ghost\nI'm full of syrup and I'm seeing ghosts\nI'm pushing heroin right through N.O\n\n[Break]\nYou know we got that boy-boy like New Orleans, ya hear me? Runnin that pack through Chi Town, Memphis, All up through B More & DC\n\n[Bridge]\nLil' Mexico turf a gang land\nI'm ABK like I'm Zonaman\nThat's Any Body Killa nigga\nDo you have the heart to kill a nigga?\n100 thousand for a lawyer, gotta be a Johnnie Cochran\nTake the dope off the border, from the water, put it in the water\n\n[Verse 2]\nKnow some Mexicanos down in Georgia (my migos)\nWe on every channel when we pop it\nHit em in the head and start braggin' bout it\nThey on 7th street, they gotta bunch of bodies\nGotta bunch of chains, my neck is very crowded\nWhen I flood the street,  they have a powder shower\nKnow the recipe, you need to learn about it\nFinessin' niggas, gotta learn about it\nI could cook it in the microwave\nI got ya baby momma with the shits\nI got your son sitting on a brick\nMy teacher said I wouldn't be shit\nShe even know what I represent\nFree Band Gang President\nMoney over everything, nigga\nEverything else irrelevant\n\n[Bridge]\nLil' Mexico turf a gang land\nI'm ABK like I'm Zonaman\nThat's Any Body Killa nigga\nDo you have the heart to kill a nigga?\n100 thousand for a lawyer, gotta be a Johnnie Cochran\nTake the dope off the border, from the water, put it in the water", "image": "https://images.rapgenius.com/4cd10336cc2ca468ab2b4e9d7642ba60.475x475x1.jpg"}], "artist": "Future"}