{"songs": [{"title": "A Man", "album": "Skull & Bones", "year": "2000-04-25", "lyrics": "(Sen Dog)\nDon't let nobody treat me like crap\nI'm pullin heads off sharp and smack em off francs\nThe best in these days I smoke on these tracks\nGonna mash your plan for holdin me back\nJump up rush the office with the gat\nLettin the niggas see where my mind is at\nHurry up to the walls see how I react\nBut I keep comin back and that's for a fact\nI got the beef, but no road I got dropped\nAnd take each day the bullshit don't stop\nGot to act with the man cause I don't suck cock\nNo matter how bad I wanna get to the top\nThe music go out like a fuckin lot\nWith the key and the dat I rap and just stop\nCome and see me on a Soul Assas trip\nHittin stage, generate, pumpin all that lip\n\n(Chorus)\nYOU CAN'T FUCK WITH ME\nI AM EVERYTHING YOU EVER WANT TO BE\nA FUCKIN MAN!\nYOU CAN'T FUCK WITH ME\nI AM EVERYTHING YOU EVER WANT TO BE\nA FUCKIN MAN!\n\n(Sen Dog)\nIf y'all ever need help I don't wait\nAnd I come from some shit that's put away\nI hit these suckers that think they so great\nSteal a nigga style, so they can update\nNo matter how you try you'll always be fate\nBreakin off chunks off of what I create\nI see that liquorice all over your face\nBack-stab a nigga in the mist of the chase\nFuck the bullshit let's get to the bottom\nStompin punk styles, agein rock got em\nOnly thing I don't wanna say when I drop em\nLoadin my shells so don't try to hock em\nHittin the heat with the jig-ass beats\nBite my style, is the only way to compete\nSmoke anybody if I ever lop heat\nAnd anybody else that wanna fuck with me\n\n(Chorus)\nYOU CAN'T FUCK WITH ME\nI AM EVERYTHING YOU EVER WANT TO BE\nA FUCKIN MAN!\nYOU CAN'T FUCK WITH ME\nI AM EVERYTHING YOU EVER WANT TO BE\nA FUCKIN MAN!\n\n(Sen Dog)\nI sing funky-ass shit that I bring\nFly likes a lot when I do my thing\nCheck it out y'all ain't no one nicer\nGot it goin on with the mighty wanna cipher\nGot a women crazy, when I beg\nAnd hip-hop styles with the SX-10\nTrust no one ain't nobody your friend\nCause this business hear all about to end\nDon't mean comin back when they bust the raps\nAnd all the little things of the nicer tracks\nHangin out in the uniform\nKeep what I'm doin here all night long\nIs to keep it goin, bring the thunder and pain\nAin't bitches same since I went insane\nFuckin with these bitches up in this game\nTo the depicts, drain on my FUCKIN TRAIN\n\n(Chorus)\nYOU CAN'T FUCK WITH ME\nI AM EVERYTHING YOU EVER WANT TO BE\nA FUCKIN MAN!\nYOU CAN'T FUCK WITH ME\nI AM EVERYTHING YOU EVER WANT TO BE\nA FUCKIN MAN!", "image": "https://images.genius.com/af5085b228c3f1b6bc3a2ac39f6c6be8.1000x977x1.jpg"}], "artist": "Cypress Hill"}