{"songs": [{"title": "You Must Love Me", "album": "In My Lifetime, Vol. 1", "year": "1997-11-04", "lyrics": "[Intro: Kelly Price (Jay-Z)]\nThroughout my life (uh huh uh huh uh)\nNo matter what I've done (right)\nYou've been merciful and your love endureth (yeah)\nThrough all things (yeah)\nFor that I am eternally grateful\n\n[Verse 1: Jay-Z]\nSince my date of birth bought you nothing but hurt\nPlay those video games, stole change from ya purse\nSat on the cold court bench 'til I was arraigned in ya skirt\nSaw the pain in ya face, still you maintained a smirk\nAll you did was motivate me, \"Don't let 'em hold you back\"\nWhat I do? I turned around and I sold you crack\nI was a bastard for that, still I'm drowning in shame\nJust remember one thing now: you're not to blame\nYou was newly separated tryin' to escape ya world\nAnd through my thirst I didn't help you I just made things worse\nI hated me and everybody that created crack\nHad me thinkin' the newest kicks and the latest gat\nStill haven't apologized, so please play this back\nWhile I try to come to terms with such a heinous act\nYou know in more than one way cocaine numbs the brain\nAll I did was think about how the funds once came\nThen I ran across this memory and it stung the brain\nHow can you ever destroy the beauty from which one came\nThat's a savage, you're the reason\nWhy me and these beats make a marriage\nWhy I rhyme above average and I ain't shit\nGlad you got yourself together, no thanks to me\nStrong and beautiful the way thangs should be\nYou must love me\n\n[Chorus: Kelly Price]\nYou must love me...\nSay that you love me\nAll I know say that you must love me\nOhh yeah\n\n[Verse 2: Jay-Z]\nWe used to fight every night but I never would suffer\nJust smile, my big brother's tryna make me tougher\nAs we grew fussing and fighting continued\nAs I plundered through ya stuff and snuck ya clothes to school\nGot intense, real intense as we got older\nNever believed it would lead to be poppin' one in your shoulder\nWhere my rings? Knew you had it 'cause you took too long\nAs Mickey, Annie and the girl that bought it looked on\nHuffin' and puffin' gun in my hand told you step outside\nHoping you said no but you hurt my pride\nMade our way down the steps\nMaybe you thought it was just a threat\nOr maybe ya life was just that crazy\nAnd you was beggin' for death\nTry to justify this in my young mind\nBut the adrenaline and my ego hurt combined\nDrove me berserk, saw the devil in your eyes\nHigh off more than weed\nConfused, I just closed my young eyes and squeezed (gunshot)\nWhat a sound! Opened my eyes just in time\nTo see ya stumbling to the ground\nDamn! what the fuck I done now?\nRunnin' around in a circle thinking I'm assed out\nHot gun burnin' my waist, ran straight to Jaz' house\nLike a stranger damn I just shot my nigga\nAnd ran off into the night as if it was not my nigga\nLeft the scene, how could I go out that way?\nStill you asked to see me in the hospital the next day\nYou must love me\n\n[Chorus: Kelly Price]\nWhat after all the wrong I've done\nYou must love me...\nI know you must\nYou must love me...\n\n[Verse 3: Jay-Z]\nEverything in my power and within my frame\nTo protect you from this life and keep you away from the game\nBut you was one of the few people that I can trust\nAnd the fact of the matter I slang these pies for us\nYou put the pressure on me daily, rarely would you let it go\nWas a thousand and one times I had to tell you no\nBut it was one of those days when nobody was around\nAnd I needed emergency trip out of town\nSearched my mental Rolodex for all the numbers I know\nAs you stared in my face asking me could you go\nI agreed said send her everything'll go smooth\nJust tell her what to do and everything'll go through\nStrapped her body with them thangs as you boarded the plane\nCouldn't explain the strange feeling that I caught in the vein\nI'm thinking why would I send you when I knew it ain't right\nI'm thinking what would make you sacrifice ya life\nYou must've love me\n\n[Chorus: Kelly Price]\n(\"You must love me\" repeats in background)\nAfter everything that I've done wrong\nI know inside you must love me\nI know that you love me\nYou showed me I know it\nI know\nSay that you love me\nSay that you love me\nI know you must love me\nOh yes you do\nInside I know it\nYou've always shown it\nYou love me yea yeah\nOh yeah\nI know that you love me", "image": "https://images.genius.com/5d943fdf8e012d844a1b587b79e29b3d.1000x1000x1.jpg"}], "artist": "JAY-Z"}