{"songs": [{"title": "Purified Thoughts", "album": "Apollo Kids", "year": "2010-12-21", "lyrics": "[Intro]\n\"Am I a good man? ...\"\n\n[Verse 1: Ghostface Killah]\nTake my hands out my pockets you can see my thumbs\nBoth of them turned green from counting the ones\nMemorized by the glory, word life\nCut off niggas who killed good but couldn't do nothing for me\nShout 'em out every once in the blue\nAnd kid yo, I never rocked with\nLong as they keep away, we cool\nI devised my own stimulus plan, I'm nigga-rich\nI'm tired of eating those crumbs and black licorice\nTo free my mind on Friday, I cleanse in the mosque\nLet the imam pray over my head and wash\nThoughts, sterilized, purified, Godly\nWatch his gift manifest the green like barley\nIf that shit happen I'll feed his whole army\nTalking 'bout the angels and peeps in Somali\nTry to stay humble and swallow my pride\nIn God I trust, not talkin' 'bout the ones on your five\nCrisp dollar billing, catch me in a little hut in Benin\nVillage style, feeding the children\nBig pots of jasmine tea with Mandela\nAfricans chanting me on like Coachella\nGhostface Bumaye, Kumbaya my Lord\nMy death day, 24 karat tomb I lay\nWishing they could bury me next to the prophets\nNabi, Lut, Is'a, Musa, Hadrat Muhammad, Ibrahim\n\n[Interlude]\n\"Am I a good man?\" (I don't know)\n\"Am I a fool?\" (We'll see)\n\n[Verse 2: Killah Priest]\nThe Lord takes me, gathering speeds before winds\nHigh currents, distance, places be forming wings\nKings offering, thrones was there\nMan with the seven crowns on his dome was near\nFeet walked over rose petals sold from the ghetto\nFace froze in gold like the pharaoh\nAdorned in glory, robe of light, a power for his cherub\nAs He passed the path, white doves crossed the eyes of thugs\nEternal heartbeat and the dark fire in his blood\nSeven hundred books were opened\nEmbraced to write, then threw the crooks in the ocean\nSkin brass hair like it grew from goatskin\nThe chosen has spoken, tablets were broken\nThe smoke hand grabs an omen\nGravity grabbing me gradually, dragging me through Hell's cavity\nThis is blasphemy, I fell where the jackals feed\nGod felt bad for me but cast me in the Caspian Sea\nSatan gave the dragon his key, Wu-Family's the faculty\nK.P., K.P\n\n[Interlude]\n\"Am I a good man? Am I a fool?\n\"Am I?\"\n\n[Verse 3: GZA]\nHe used to sling in the stairwell\nFast to put the rap on a thinking cap, ignite your hair gel\nNo such thing as the fair sale\nHe'll put the bullet out same day, delivery airmail\nAnd on this level a thug will sell your garbage\nNo refund, the only exchange from the cartridge\nBut the users just kept coming back with their life earnings\nReady to make a deal, soul and pipe burning\nThe outcome tragic, the household dramatic\nLiving rooms for heating spoons, basements for addicts\nSupport from a bean, hit the courts from a fiend\nWho betrayed one, who had lit the torch for his team\nSo he sent them gifts, body parts per diem\nIn a box that held prints but too dark to see 'em", "image": "https://images.genius.com/f48f03bc4acc3c9c4ddc676ddc586579.1000x1000x1.png"}], "artist": "Ghostface Killah"}