{"songs": [{"title": "What’s The Difference (Unreleased Version)", "album": null, "year": "1998-01-01", "lyrics": "[Intro: Phish] x2\nWhat's the difference between me and you\n\n[Verse 1: Dr. Dre]\nBack when Cube was rolling with Lorenzo in a Benzo\nI was bangin' with a gang of instrumentals\nGot the pens and pencils\nGot down to business; but sometimes\nThe business end of this shit can turn your friends against you\nBut you was a real nigga\nI could sense it in you\nI still remember the window of the car that you went through\nThat's fucked up, but I'll never forget the shit we been through\nAnd I'ma do whatever it takes to convince you\nCause you my nigga Doc, and Eazy I'm still wit'chu\nFuck the beef, nigga I miss you\nAnd that's just being real wit'chu\nYou see the truth is\nEverybody wanna know how close me and Snoop is\nAnd who I'm still cool with\nThen I got these crab-ass niggas I first drew with\nClaimin' that they non-violent, talkin' like they Ruthless\nSpit venom in interviews, speaking on reunions\nMove units, then talk shit and we can do this\nUntil then - I ain't even speaking your name\nJust keep my name outta yo' mouth and we can keep it the same, nigga\nIt ain't that I'm too big to listen to the rumors\nIt's just that I'm too damn big to pay attention to 'em\nThat's the difference\n\n[Hook: Phish] x2\nWhat's the difference between me and you\nYou talk a good one\nBut you don't do what you supposed to do\nI act on what I feel and never deal with emotions\nI'm used to living big dog style and straight coasting\n\n[Verse 2: Hittman]\nThe difference is: I don't care\nCan't you tell it by my rigid stare?\nI'm legendary, get you open like a Frigidaire\nMore despair, your style's dead as Fred Astaire\nYou need medicare, security blanket and a fucking teddy bear\nAwh yeah, awh yeah\nIs your expression when you eyewitness a session\nVocal pitch making impressions like Jerry Butler\nStupid fucker, I will cut ya\nDoing a sucka's such a tragedy, I'll run you raggedy like Ann\nYou'll kick the pink can like a faggoty man\nNew styles, I usually keep clandestine\nLike files of semen found in J. Edgar Hoover's intestines\nNo question\nBut keep that on the low low, Falana slow mo\nWhen puffing marijuana couldn't get the time of day\nNow I'm fucking nigga's Mommas\nDrama's still part of my dietary\nHit hard like Singletary\nKill your daughter, bust her cherry\n\n[Hook]\n\n[Verse 3: Eminem]\nAight, hold up hold up\nStop the beat a minute\nI got somethin' to say\nDre, I wanna tell you this shit right now while this fucking weed is in me\n(What the fuck?)\nI don't know if I ever told you this, but I love you dog\nI got your motherfucking back (right) just know this shit\n\n[Dr. Dre]\nSlim, I don't know if you noticed it\nBut I've had your back from day one nigga\nLet's blow this bitch\n\n[Eminem]\nI mean it dog, you ever need somebody offed - whose throat is it?\n\n[Dr. Dre]\nWell if you ever kill that Kim bitch\nI'll show you where the ocean is\n\n[Eminem]\nWell that's cool, and I appreciate the offer\nBut if I do decide to really murder my daughter's momma\nI'ma sit her up in the front seat and put sunglasses on her\nAnd cruise around with her for seven hours through California\nAnd have her wavin at people (hi)\nThen drop her off on the corner\nAt the police station and drive off honkin' the horn for her\nRaw dawg, get your arm gnawed off\nDrop the sawed off and beat you with the piece it was sawed off of\nFuck blood, I wanna see some lungs coughed up\nGet shot up in the hot tub 'til the bubbles pop up\nAnd they nose and cough snot up\nMucus in hot water\nThat's for trying to talk like The Chronic was lost product\nThat's for even thinking of having them thoughts thought up\nYou better show some respect whenever the Doc's brought up\nSo what's the difference between us\nWe can start at the penis\nOr we can scream\n\"I Just Don't Give a Fuck,\" and see who means it\n\n[Hook]", "image": "https://images.genius.com/bf3badae49c33b583126057638078bd8.576x576x1.jpg"}], "artist": "Dr. Dre"}