{"songs": [{"title": "What Makes a Man", "album": "The Dream Merchant 2", "year": "2007-10-09", "lyrics": "[Intro: Rapper Big Pooh]\nYeah! Uh! Yeah! This ya boy Rapper Big Pooh man! Uh!\nBuddy Klein in this nigga!!!!!! 9th Wonder in this nigga!!!!!!!!!\nYeah! This that Dream Merchant, Vol. 2 shit, you know what I'm sayin?\nI don't think y'all understand what's about to go down man\nI don't think y'all really know man, listen\n\n[Verse 1: Rapper Big Pooh]\nThat's me your world MC\nYeah I went to college I ain't finished my degree\nYou can check my pedigree I'm the son of a Lee\nIt's Pooh Steinback when these words touch beats\nName out on the streets like it's etched in stone\nTrust you don't want it when I step in that zone\nFaggot niggas call home or they scream for the law\nOr they cry for they Pa cause I'm simply Ma\nI ain't the type to ever starve I'm a worker nigga\nMention a few mills it do wonders for the figure\nKnow niggas who would peel you like tangerines\nGot government issues like in the marines\nI keep my hands clean get tunnel vision\nApproach every line with the right precision\nMake the right decision 'fore life get missin\nAnd the next time you hear me I be writin different, lil' nigga\n\n[Hook: Buddy Klein]\nNigga if you dont stand for somethin\nYou bound to trip and fall down\nMan I don't give a fuck click clack hit 'em up\nMan we spit heat at these clowns\n\n[Rapper Big Pooh]:\nSo what you 'gon do when Klein come through\nWith the Rapper Big Pooh and 9th into\nAnd (AH! AH!) Get at you (AH! AH!) Get at you (AH! AH!) Get at you\n\n[Verse 2: Buddy Klein]\nYo, paddy cake, paddy cake, maker man\nYou a bitch on his dick, tryna make the band\nGet at me dog, I'm funky like nasty draws\nPiss me off, I start shootin like basketball\nI'm street, I'm hood, I'm really whatcha musta saw\nI'm thug, I'm raw, big like I'm above the law\nWith all this change, I tharted doin a buck in the rain\nFlip a ki fool, that's drug dealer's dream\nNigga please, move, I ain't talkin bout crack\nI'm talkin bout rap - I eat y'all food right from scratch\nThe street's my daddy, whatchu gon' teach me, sonny?\nSpeed on the road of riches, just tryin to increase my money\nCarolina beats pah, stop ya breathin dummy\nLeak shells in ya back, y'all like Eastern Senate\nBK MC, full recline makin cream\n(You best to chill..) Or you'll get cut like you ain't make the team\n\n[Hook: Buddy Klein]\nNigga if you dont stand for somethin\nYou bound to trip and fall down\nMan I don't give a fuck click clack hit 'em up\nMan we spit heat at these clowns\n\n[Rapper Big Pooh]:\nSo what you 'gon do when Klein come through\nWith the Rapper Big Pooh and 9th into\nAnd (AH! AH!) Get at you (AH! AH!) Get at you (AH! AH!) Get at you\n\n[Outro: Buddy Klein]\nSome say it's the shit that we go through\nI know sometimes we won't do what we 'sposed to\nBut all I got is my word and my bond\nAnd I'm a hold both tight until the day that I'm gone\n\n[Rapper Big Pooh]\nSome say it's the shit that we go through\nI know sometimes we won't do what we 'sposed to\nBut all I got is my word and my bond\nAnd I'm a hold both tight until the day that I'm gone", "image": "https://images.genius.com/c79a4d23ca0ae75f715c34ad0ae3825a.492x486x1.jpg"}], "artist": "9th Wonder"}