{"songs": [{"title": "Hustlin’ (Bonus Track)", "album": "T.I. vs T.I.P.", "year": "2007-07-03", "lyrics": "[Governor]\nHustlin... out here...\n\n[Hook: Governor]\nI'm out here, hustlin\nI'm just thinkin 'bout gettin back home to you babe\nI'm out here, hustlin\nYou see that's how I'm able to send that little money to you\nHustlin - let's get more freedom\nIn my future, so we can ball (out here)\nSo we can sip champagne, and puff that mary jane\nAnd you can fly first class on an airplane\n\n[T.I.]\nJeah, ay, let's go man\nI remember comin up, used to hate to get on the bus\nDreams of gettin paid and makin the big bucks\nStarted to get a little then couldn't get enough\nLet me in, I'mma win nigga I don't give a fuck\nThe environment sucks but the bread ain't bad\nThe broads, don't fuck 'em all but the head ain't bad\nI'm young, rich and legit; think the Feds ain't mad?\nHaters are sick of the Six, so scared of the scad\nDag, damn nigga ya ain't have to brag\nThis'll never pay, remember when you said that bad?\nThe nigga still thinkin I blew up so fast\nJ. Geter, remember when you put up yo' last?\nThis for my niggas tryin to flip yo' cash\n'fore the Feds can get a chance to clip yo' ass\nGet a lot of powder in a Ziplock bag\nWrist full of rubber bands, 40-cal's in the dash\n\n[Hook]\n\n[T.I.]\nYo ay, ay, let me holla at 'em Gov'..\nI know some people love me to death and there's some that can't stand me\nCause I got a big-ass crib in Miami (what else?)\nAnother out in Cali, backyard so sandy (okay)\nAnd most broads find it hard to understand me\nBut the same attitude that make crews goddamn me\nIs the same ones that got me lookin cool at the Grammy's\nHaters wanna damage me but King you'll never be\nShawty holla at me when you get your first felony\nThen holla at me when you've been on Dave Letterman\nSay they never seen a real nigga so elegant\nLames wanna hear that real shit and I'm tellin it\nTrained the game to be sold and I'm sellin it\nChasin a Honda mil', that bullshit is irrelevant\nWe can race if you wanna, I bet on me and you'll never win\nSimply cause a loser's somethin I've never been\nIf you doubt now holla back at 2007 then\n\n[Hook]\n\n[Governor]\nHustlin... out here...\nHustlin... out here... {*echoes*}", "image": "https://images.genius.com/2f70d0ed3d87a3cc476cfb530ff86686.600x600x1.jpg"}], "artist": "T.I."}