{"songs": [{"title": "Fresh Out!", "album": "Planet", "year": "2018-03-02", "lyrics": "[Intro: Krizz Kaliko & Tech N9ne]\nThe number one independent rapper in the world!\nTech N9ne!\nI am what? Fresh out of fucks!\n\n[Verse 1: Tech N9ne]\nFed up with everything, I'm cynical than I ever been\nI'll make the Beretta ring if any comin' up at a king\nAlluding to leveling a leader livin' a better dream\nKinda like the brother on the side of Coretta King!\nBut the people, they made me a monster\nI need a getaway and may need some Kontra-\nBand in my hand I'm goin' crazy and bonkers\nLike I'm rich and my baby's Ivanka!\nThey don't give a damn about a good nigga\nThey wanna take what you givin' and put you out in the river\nWithout a particular bout, I give you doubt if you is a\nFallacy giver and nothin' but a salary digger!\nI'ma relay the message, you're gonna decay\nIf karma displays a deathbed, you wanna delay\nThe drama today that Tech said he gonna repay\nThe one in the way, I check it wit' a llama to spray!\nWhen I spit it, niggas, quit it, 'cause I come wit' it\nBig digits, got 'em livid, when I quick flip it\nThey don't wanna dig it but the spirit is not authentic\nNot a pity party, but I'm fed up with the hatred\nAnd how they wanna spit upon and hit the gentle faces\nNot even knowin', we sick and mental cases\nI open up they mouth wit' a fully and dental they shit!\n\n[Chorus: Tech N9ne]\nI am (what?) fresh out of fucks!\nI am (what?) fresh out of fucks!\n\n[Verse 2: Swisher Sleep]\nIs it that I'm having a panic attack and I'm tired of fact\nThat I'm starvin' like Marvin Hagler, heart of a battler fighter\nOr get you from out of here, hit you for standin' there\nMan in here, mind your manners and manage your mannerisms\nYour mouth of a minimal double dribblin'\nStuffed up a Ritalin, got me jitterin'\nGot me feeling the pit fighter's adrenaline\nSittin' inside of a cage, prison, shank sharpened and bank targetin' (get 'em!)\nIs it that I'm having a panic attack and I'm not gonna have it\nFresh outta fucks and I don't make it a habit\nI don't trust anybody the fact\nThat you not giving a fuck, I practice\nI been seein' on you wishing my tactics\nNow the blood outta my body, even the water out my cactus\nI'll tackle a pterodactyl and shackle 'em and ride on the back of 'em\nSlappin' them in the abdomen, hurry the wings flappin'\nWe flyin' to Strangeland and demandin' a pretty penny\nAnd poppin' on the collar like I'm hidin' the hickey\nI am who the suckas pretend to be, get offend of me\nThey depend on my energy, there's a penalty nigga\nFinna be remedied, the epitome of an enemy\nIn a minute, we cut the noise and become a symphony\nCatch a Windom, finally faded, gettin' behind a riddly dynasty\nTecca N9ne and me signin' these twin time to be violently\nMurderin' my mind and become reblinded by me\nAnd ignitin' the dynamite and then me Swish!\n\n[Chorus: Tech N9ne]\nI am (what?) fresh out of fucks!\nI am (what?) fresh out of fucks!\n\n[Verse 3: Tech N9ne]\nBleed ya if you got the funk a milli fever\nNothing but a sucka billy diva\nBuckin' really we had enough of the silly negras\nAgreed get the heata, bussin' up to really freeze ya\nI'm an abomination, when ya on ya hatin'\nKinda conversation, I'ma bomb ya nation\nWith my congregation of non-sedation\nThe Don's awakened achin' the spawn of Satan\n\n[Verse 4: Swisher Sleep]\nWho called my name in? I go not contemplatin' out dome\nMy combination ain't norm\nI'ma sock a face in the eye socket and break it\nHis mind pocket is achin'\nThe time clock is wastin', a pine box is awaitin'\nI'm salivatin', they callin' me the killa, killa\nThere's no feelings, it's sentimental in general\nI'ma hammer 'em, hit 'em all in the middle\nThey feminine, all that bitchin' is not admissible\nZip it or get a kick in the genitals\nWhen I spit it, niggas critic\n'Cause every time I come with it\nThe winner, victor definitive\nPen and pad an opinion, opinionated\nA pyramid in the makin' it permanent, here statin' initiative\nTryna get it and fit it where the position is\nPut my life and my money, freedom at risk for this\nGive me mine, I don't give a fuck what tradition is\nListen, I'm a diamond, I'm unsigned and I'm killin' shit\n\n[Chorus: Tech N9ne]\nI am (what?) fresh out of fucks!\nI am (what?) fresh out of fucks!\n\nBiatch!", "image": "https://images.genius.com/c36ae5178ab08ac046d581cb42ab737c.300x300x1.png"}], "artist": "Tech N9ne"}