{"songs": [{"title": "Stronger Than I Was", "album": "The Marshall Mathers LP2", "year": "2013-11-05", "lyrics": "[Verse 1]\nYou used to say that I'd never be\nNothin' without you, and I'd believe\nI'm shot in the lungs, I gasp, I can't breathe\nJust lay here with me, baby, hold me please\nAnd I'd beg and I'd plead, drop to knees\nAnd I'd cry and I'd scream, \"Baby, please don't leave!\"\nSnatch the keys from your hand, I would squeeze\nAnd you'd laugh, and you'd tease\nYou're just fucking with me, and you must hate me\nWhy do you date me, if you say I make you sick?\nAnd you've had enough of me\nI smother you, I'm 'bout to jump off the edge\n\n[Chorus]\nBut you won't break me\nYou'll just make me stronger than I was\nBefore I met you, I bet you I'll be just fine without you\nAnd if I stumble, I won't crumble\nI'll get back up and uhh\nBut I'ma still be humble when I scream \"Fuck you!\"\n‘Cause I'm stronger than I was\n\n[Verse 2]\nA beautiful face is all that you have\n‘Cause on the inside you're ugly and mad\nBut you're all that I love, I grasp, you can't leave\nPlease stay here with me, baby, hold me please\nAnd I'd beg and I'd plead, drop to knees\nAnd I'd cry and I'd scream, \"Baby, please don't leave!\"\nBut you left and you took everything I had left\nAnd left nothin', nothin' for me\nSo, please don't wake me from this dream, baby\nWe're still together in my head\nAnd you're still in love with me\n'Til I woke up to discover that that dream was dead\n\n[Chorus]\nBut you won't break me\nYou'll just make me stronger than I was\nBefore I met you, I bet you I'll be just fine without you\nAnd if I stumble, I won't crumble\nI'll get back up and uhh\nBut I'ma still be humble when I scream \"Fuck you!\"\n‘Cause I'm stronger than I was\n\n[Verse 3]\nYou walked out, I almost died\nIt was almost a homicide\nThat you caused, ‘cause I was so traumatized\nFelt like I was in for a long bus ride\nI'd rather die than you not be by my side\nCan't count how many times I vomited, cried\nGo to my room, turn the radio on and hide\nThought we were Bonnie and Clyde\nNah, on the inside you were Jekyll and Hyde\nI felt like my whole relationship with you was a lie\nIt was you and I, why did I think it was ride or die?\n‘Cause if you coulda took my life you woulda\nIt's like you put a knife through my chest\nAnd pushed it right through to the\nOther side of my back and stuck a spike too, shoulda\nPut up more of a fight, but I couldn't\nAt the time, no one could hurt me like you coulda\nTake you back now, what's the likelihood of that?\nBite me, bitch, chew on a nineteen footer!\n‘Cause this morning I finally stood up\nHeld my chin up, finally showed a sign of life in me for the\nFirst time since you left\nAnd left me with nothin' but shattered dreams\nAnd the life we coulda had and we coulda been\nBut I'm breakin' out of this slump I'm in\nPullin' myself out of the dumps once again\nI'm gettin' up once and for all—fuck this shit!\nI'ma be late for the pity party\nBut you're never gonna beat me to the fuckin' punch again\nTook it on the chin like a champ\nSo don't lump me in with them chump-ions\nI'm done bein' your punching bag\nIt was the November 31st today\nWoulda been our anniversary\nTwo years, but you left on the 1st of May\nI wrote it on a calendar, was gonna call\nBut couldn't think of the words to say\nBut they came to me just now—so I put 'em in a verse to lay\n\n[Bridge]\nAnd I thank you, ‘cause you made me\nA better person than I was\nBut I hate you, ‘cause you drained me\nI gave you all, you gave me none\nBut if you blame me, you're crazy\nAnd after all is said and done\nI'm still angry, yeah, I may be\nI may never trust someone\n\n[Chorus]\nBut you won't break me\nYou'll just make me stronger than I was\nBefore I met you, I bet you I'll be just fine without you\nAnd if I stumble, I won't crumble\nI'll get back up and uhh\nBut I'ma still be humble when I scream \"Fuck you!\"\n‘Cause I'm stronger than I was", "image": "https://images.genius.com/2c354260f9edc6b2e9bf6b06c935a0b8.1000x1000x1.png"}], "artist": "Eminem"}