{"songs": [{"title": "Hot Sauce to Go", "album": "Kiss of Death", "year": "2004-06-22", "lyrics": "[Intro - Jadakiss] (Pharrell)\nAH-HA! (hot sauce to go)\nLight in the incense, backup\nAnd turn the lights off in the motherfucker!\n(Hot sauce to go) Right now! Please!\nThank you, muah!\nAhah-ha! (hot sauce to go)\nYou know who it is! (Jada)\nThe obvious is beautiful! (hot sauce to go)\nMarlvelous, I'm getting older\n\n[Hook - Pharrell Williams] (w/ Jada ad-libs)\nYou got to move wit the groove\nAs she lay on the one's and two's\nWait a minute, wait a minute\nYou gon stink up the room!\nWit that big ol' ass!\n\n[Verse 1: Jadakiss]\nYo, we gon hit something\nI'm cutting the rug wit love\nOr I'm on the wall pressed up against something\nYou should let em know the boss is back\nSo y'all niggas that went wood go get more shalack\nI see bowlegs backing it in\nI put it on her wit the ol' school two step, clap and a spin\nFilled up her cup, slid her a dutch\nYou know what's happenin then (what?) in\nAnd all I did was having a grin\nOff top let her know I ain't one of these dudes\nRhyming to lose, naw ma I'm rapping to win\nYeah! yes! They know the God be fresh\nI'm on that ass blowing purple on the washing set\nAnd even though I came wit thugs\nYou still might catch a few of them 'Stepping In The Name Of Love'\nUh! It's D on the Block, the Ryde is Ruff\nAnd you wit the motherfucking Billionaire Boys Club!\n\n[Hook - Pharrell Williams] (w/ Jada ad-libs)\nYou got to move wit the groove\nAs she lay on the one's and two's\nWait a minute, wait a minute\nYou gon stink up the room!\nWit that big ol' ass!\nWould you go to jail, LIGHT ME UP!\nGo to jail, LIGHT ME UP!\nWould you go to jail, LIGHT ME UP!\nGo to jail, LIGHT ME UP!\nYou got to move wit the groove\nAs she lay on the one's and two's\nWait a minute, wait a minute\nYou gon stink up the room!\nWit that big ol' ass!\n\n[Verse 2: Jadakiss]\nGangsta leanin, Kiss be in the bank wit cream and\nMy wrists and my neck be gleamin\nWhatever I got cost, Honey look hotter than Hot Sauce\nThat's why I get top in a drop Porsche\nThen she get dropped off, told her that the whole block pop off\nShe come through, take them rocks off\nAnd therefore, wanna know, what would they stare for\nThey heard about the work, it's as white as your Air Force\nMaybe it's the voice that the world got an ear for\nMost of these rappers, I just don't care for\nSo I be on the honies wit the big ol' asses\nHypno and Cleako in big ol' glasses\nWe could do the damn thang, order the champagne\nHoney's Head of the State, and I'm running the Campaign\nIf you coming, c'mon, if not I'm gone\nOther than that, yo Pharrell, sing my song!\n\n[Hook: Pharrell Williams]\n\n[Verse 3: Jadakiss]\nHey yo, Honey got a goon thinking\nThat ass like that, she could have the room stinking\nI - picked her up in the maroon Lincoln\nBlew her back out until the moon sank in\nSpend the profit, hold on the to the re\nLock me up, hold on the to key\nI want you to wake up in the morning wit me\nI got it bad for ya, breakfast and a cab for ya\n\n[Hook: Pharrell Williams]", "image": "https://images.genius.com/2b764e1a48616aab1941bfc2c79cd515.1000x1000x1.jpg"}], "artist": "Jadakiss"}