{"songs": [{"title": "Memories Back Then", "album": null, "year": "2013-09-18", "lyrics": "[Verse 1: T.I.]\nAyy, in my apartment a long time ago\nI knew a bad bitch, but she was kinda slow\nStill gave it up when it's a few of us\nShe let me finger-fuck her on the school bus\nWe used to cut school with her and run train\nShe wanted to hang with us, we wanted one thang\nJust penetratin' that throat, dawg\nShe choked on it like smoke, dawg\nBut whenever I fucked up my re-up\nIn a dice game I go see her\nShe'll give me enough to buy a quarter ounce\nAnd then blow a blunt of that reefer\nShe used to buy a nigga new sneakers\nPay the bill on my beeper\nJust so she can page to put a \"69\"\nAnd I know it time to go freak her\nThen one day I just asked her\n\"Why you always give your ass up?\nI mean, damn, these hoes get paid\nAll you do is get laid—this shit don't add up.\"\nShe said, \"Tip, all I wanna do is feel love\nEven if I know it ain't real love\nEven if I know a nigga only finna hit it\nAnd then never call back, I still fuck.\"\nAnd that's fucked up, but she so trill\nI need somethin', she go steal\nWhen the trap hot and police ride\nNigga, guess where we go chill?\nFor 'bout four years she held dope\nAnd my four pounds 'til it go down\nI remember shawty, she stayed down\nI won't say her name ‘cause she married now\n\n[Hook: Kris Stephens]\nWhen the lights go out\nAnd I'm in my bed\nI think of all the madness in my head\nAll of the things that I did back then\nWhen I'm in my bed\nI think of all the memories I've had\nAll of the things I did back then\n\n[Verse 2: B.o.B]\nShe would always turn heads when she'd fall through\nShe would always make moves how a boss do\nAnd she never gave any nigga time of day\nBut she the chick all the niggas tried to talk to\nBut when it came to me, she had a thing for me\nWhen we kicked it she roll up the weed for me\nAnd we'd both cut class post up in the cut steady\nWatchin' just to see if the police comin'\nWe got close over time, her and I\nRight around the time that I first got signed\nCome to think about it I was 'bout 17\nI ain't even have a license, couldn't even drive\nI was goin' back and forth with each flight\nAnother show after show, each night\nShe became so suspicious of these other bitches\nShe'd go through my phone and we'd fight\nTalk about torn between the two\nWasn't really much more that we could do\nWasn't really much space for us\nBut she stayed down with every tour she seen me do\nBut I guess one night I had a few\nHuh, one night I had a few\nYeah, this little chick that caught my eye\nI told her: \"Hurry up, meet me at the room!\"\nAnd no, I didn't have a contraceptive\nWhat my common sense neglected\nAnd two months later, next thing I know\nI got a text that said \"I'm pregnant\"\nAnd you can almost bet she kept it\nAnd that's the reason why you left me\nOn top of all that, it wasn't even mine\nI went and got paternity tested—damn!\n\n[Hook: Kris Stephens]\nWhen the lights go out\nAnd I'm in my bed\nI think of all the madness in my head\nAll of the things that I did back then\nWhen I'm in my bed\nI think of all the memories I've had\nAll of the things I did back then\n\n[Verse 3: Kendrick Lamar]\nWait, hol' up, is that you?\nWith them big ol' thighs after school?\nJay 305 had gave me high five\nWhen I said I’m in hot pursuit\nYou said I won’t ride until Kendrick drive\nA new Monte Carlo that cruise\nAnd that shot my pride, I tried to improv\nBut no freestyle I never do\nYou lookin' for the nigga with the tallest 'fetti\nYou overlookin' every nigga that ain’t quite ready\nTo make it rain on you like I'm about to break a levee\nHol' up, that pussy petty\nYeah, your nails did, your hair did\nYour cell phone is selfish\nIt only got numbers that come with a Hummer\nHer new prima donna I smelt it\nTried to make you mine, ho!\nTried to make some time, ho!\nBut I ain’t got the time or the patience\nTo stop and wait in line, ho!\nHer dreams holds Versace\nShe fall for Armani\nOnly deal with rich niggas—fuck you and Mick Romney!\nI’m grown now, I’m on my own now\nI’m po-o-o-oppin'\nChange my phone now when I get home now\nI got o-o-o-options\nFast forward, wait, is that you?\nWith them big ol' thighs after school?\nAnd your three kids and three baby daddies\nSame car note that’s overdue? I know\n\n[Hook: Kris Stephens]\nWhen the lights go out\nAnd I'm in my bed\nI think of all the madness in my head\nAll of the things that I did back then\nWhen I'm in my bed\nI think of all the memories I've had\nAll of the things I did back then", "image": "https://images.rapgenius.com/c5ebea9a4eb0bd756121a9711033914c.600x600x1.jpg"}], "artist": "T.I."}