{"songs": [{"title": "Top Floor", "album": "Rolling Papers", "year": "2011-03-29", "lyrics": "Started out slow, out slow\nCause no matter how much she gets\nShe wants more, girl\nNow we're on the top floor, top floor\nHolding on tight, you ain’t letting go\nCan you feel it in?\nCan you feel it in?\nFeel it in\n\nOh\nFirst class help you in the game like a free throw\nFill my bank up with cash, my glass with Clicquot\nYou ain't gotta tell your friends what we talk about\nAll the places that we go, we go\nYou're mine for the night, your man try and repo, oh\nWork nights never sleep so you think she got no job\nGo to school during the week on the weekend we go hard\nLive so large, let you go tear down the mall like it’s your card\nIt's no problem, go ahead and sing it girl, this is your song\n\nStarted out slow, out slow\nCause no matter how much she gets\nShe wants more, girl\nNow we're on the top floor, top floor\nHolding on tight, you and I go\nCan you feel it in?\nCan you feel it in?\nFeel it in\n\nOh, nothin you can tell us, they get jealous when we show up show up\nMake you feel like a little girl again, but fuck you like a grown up\nHigh as you can be it's like the dream you never woke from\nMy life's like a movie, get ready for your close up\nPour bottles and toast up\nYour man in your phone trying to see what your plans is\nSo what, you still turn up my songs soon as they playing it\nKnow what the sound is my new talks and you ain't saying shit\nI'm a call you soon as I land\nProbably roll some weed ride up on the beach while you tan\nParty every week and you hardly would speak\nBut now you got my phone taking pictures\nLaughing, smoking, chilling, yeah\n\nStarted out slow, out slow\nCause no matter how much she gets she wants more, girl\nNow we're on the top floor, top floor\nHolding on tight, you and I go\nCan you feel it in?\nCan you feel it in?\nFeel it in\n\nWe don't need nobody talk\nProbably cause we're in the sky, sky, sky, sky\nWhen we really take off\nAnd I tell her hold on\nCause she say she never been this high\nWe don't need no nobody talk\nProbably cause we're in the sky, sky, sky, sky\nWhen we really take off\nAnd I tell her hold on\nCause she say she never been this high", "image": "https://images.genius.com/ef34f0d3cc4691656a978816ff820f9b.1000x1000x1.jpg"}], "artist": "Wiz Khalifa"}