{"songs": [{"title": "Po Nigga Blues (Scott Storch Remix)", "album": "Loyal to the Game", "year": "2004-12-12", "lyrics": "* Ron Isley harmonizes throughout but sings no real lyrics\n\n(Scott, Storch) Hey!\n\n[Hook: 2Pac]\nWhy'd you slang crack? I had to\nWhy'd you slang crack? Cause I had to\nWhy'd you slang crack? Cause I had to\nA nigga gotta pay the fuckin rent\n\n[Verse 1]\nCrazy, I gotta work with what'chu gave me\nYou claimin I'm a criminal and you the one that made me\nThey got me trapped in this slavery\nNow I'm lost in this holocaust headin for my grave G\nI told Sam he could fuck the war\nAnd got a busted jaw for sayin fuck the law\nAnd if you wonder why I'm mad check the record\nWhat's a nigga gotta do to get respected?\nSometimes I think I'm gettin tested\nAnd if I don't say yes a nigga's quick to get arrested\nThat's the reason I stay testin\nI keep a vest on my chest in case the cops are gettin restless\nWalkin around, ready to light shit up\nBut since my life is fucked, some say I'm slightly nuts\nBuck buck is the sound as I move up\nOther niggas pay attention when a fool bust, huh\nThey make a nigga be a killer; I used to be a dealer\nBut they wanted to see who's realer\nNow them same motherfuckers wanna murder me\nAnd I wonder if the Lord ever heard of me, huh\nI need loot, so I'm doin what I do\nAnd don't say shit until you walked in my shoes\nThere was no other destiny to choose\nI had nuttin left to lose, so I'm singin nigga blues\n\n[Hook]\nWhy'd you slang crack? I had to\nWhy'd you slang crack? Cause I had to\nWhy'd you slang crack? Cause I had to\nA nigga gotta pay the fuckin rent\n\n[Verse 2]\nPoppa need brand new shoes, but what the fuck can a nigga do?\nMy little boy gotta eat too\nSo why must I sock a fella\nJust to live large like Rockefeller?\nAnd did you ever stop to think\nI'm old enough to go to war, but I ain't old enough to drink\nCops wanna hit me with the book, huh\nAnd you're hooked on my \"I Don't Give a Fuck\" look\nMake your rules, I'mma break 'em\nNo matter how much you make 'em, you show me bacon I'm take 'em\nSo don't you ever tempt me\nI'm a fool for mine nigga and my pockets stay empty\nTo my brothers in the barrio\nYou're livin worse than the niggas in the ghetto so\nI give a fuck about your language or complexion\nYou got love from the niggas in my section\nYou got problems with the punk police?\nDon't run from the chumps, get the pump from me\nWe ain't free, I'll be damned if I play the trick\nFor a blonde-haired, blue-eyed, caucausian bitch\nDown with my homeboy Rich, huh\nFuck a snitch and a groupie-ass bitch\nAnd the nigga with a cellular phone, leave his baby at home\nSo he can go out and bone, huh\nAnd you wonder why we blazin niggas\nCause you punks havin babies can't raise the niggas\nAnd they bound to be fuck-ups too\nDrinkin forties of brew, huh, singin nigga blues\n\n[Hook 2]\nWhy'd you slang crack? Cause I had to\nWhy'd you slang crack? Cause I had to\nWhy'd you slang crack? Cause I had to\nNow I'm headin for the motherfuckin pen\nWhy'd you slang crack? Cause I had to\nWhy'd you slang crack? Cause I had to\nWhy'd you slang crack? Cause I had to\nNow I'm headin for the motherfuckin pen\nWhy'd you slang crack? Cause I had to\nWhy'd you slang crack? Cause I had to\nWhy'd you slang crack? Cause I had to\nNow I'm headin for the motherfuckin pen\n\n[Ron Isley ad libs to fade]", "image": "https://images.genius.com/aff64f752ccfff1d48590e5db3c0357a.300x300x1.jpg"}], "artist": "2Pac"}