{"songs": [{"title": "Act a Fool", "album": "Chicken-n-Beer", "year": "2003-05-20", "lyrics": "[Intro x2: Ludacris]\nDrop! 2 Fast\nDrop! 2 Furious\nI'm too fast for y'all, man\nDrop! 2 Fast\nDrop! 2 Furious\nI'm too fast for y'all, man\n\n[Hook: Ludacris]\nAHH, you just came home from doin a bid\nTell me whatcha gon do? ACT A FOOL\nSomebody broke in and cleaned out your crib\nBOY whatcha gon do? ACT A FOOL\nJust bought a new pair and they scuffed your shoes\nTell me whatcha gon do? ACT A FOOL\nNow them cops tryna throw you in them county blues\nBOY whatcha gon do? ACT A FOOL\n\n[Verse 1: Ludacris]\nTalkin about gats, traps, cops and robbers\nIt's 9-1-1, PLEASE CALL THE DOCTOR\nEvacuate the building and trick the pigs\nSince everybody wanna piece, we gon split ya wigs\nSee some fools slipped up and over-stepped they boundaries\nYou about to catch a cold, STAY THE FUCK AROUND FROM ME\nYa peeps talkin 'bout what kinda shits he on\nYou disappear like \"POOF, BITCH BE GONE\"\nYou think twelve gon' catch me, GIMMIE A BREAK\nI'm super-charged with the hide-away license plate\nIt seems they wanna finger print me and gimmie some years\nThey'll only get one finger while I'm shifting gears\nI got suede on my roof, wood grain on the dash\nSheep skin on the rug, Golden Grain on the stash\nHydraulics all around so I shake the ride\nWe go FRONT, BACK AND SIDE TO SIDE, WHAT\n\n[Hook: Ludacris]\nSome punk just tripped up and made you spill your drink\nTell me whatcha gon do? ACT A FOOL\nNow your car just stopped on a empty tank\nBOY whatcha gon do? ACT A FOOL\nIf you got late bills and you lost your job\nTell me whatcha gon do? ACT A FOOL\nIf you about to get drunk and you ready to mob\nBOY whatcha gon do? ACT A FOOL\n\n[Verse 2: Ludacris]\nLet's take it to the streets cuz I'm ready to cruise\nJust bought me and my cars all some brand new shoes\nAnd the people just stare so I LOVE TO PARK IT\nAnd I just put a computer in the glove compartment\nWith the pedal to the floor, radar in the GRILLE\nTV in the middle of my STEERING WHEEL\nIt's my car's birthday so we BLOWIN THEM CANDLES\nMore speakers in the trunk than my ride can handle\nGot my name in the headrest, read it and weep\nNOS tank in the back, camel hair on the seat\nAnd when I pull up to the club, I get all the affection\nCuz the women love the paint and they can see their reflection\nI'm about to take off, so F what ya heard\nBecause my side mirrors flap like a FUCKIN BIRD\nAnd the fools, we gon CLOCK ONE and we'll POP ONE\nCuz my folk ridin shotgun with a shotgun\n\n[Hook: Ludacris]\nYou just got hustled for a wad of cash\nMan whatcha gon do? ACT A FOOL\nNow your friends just smoked up your brand new stash\nSay whatcha gon do? ACT A FOOL\nNow them gulls up the block still runnin they mouth\nBOY whatcha gon do? ACT A FOOL\nIf anyone talk bad about the Dirty South\nTell me what I'm gon do? ACT A FOOL\n\n[Verse 3: Ludacris]\nI got my eyes wide shut and my trunk wide open\nDid donuts last week and the streets still smoking\nSee, I'm off that anti-freeze and my car is TIPSY\nOff the off ramp doin about a hundred and fifty\nRollin through East Point, on way to Ben Hill\nSlide a five to the junkie to clean my windshield\nGot the whole crew ridin and we startin SHIT\nI even got a trailer hitch with the barbeque pit\nNow all you wanna do is get drunk and pout\nPlus your new name is Fire cuz we stomped you out\nAnd yeah, we blow trees and beez that's fantastic\nSo gulls hold ya weave while I'm weaving through traffic\nI kicked to fifth gear and teared the road apart\nYou'll be like lil John Q and get a Change of Heart\nIt's one mission, two clips and some triple beams\nI'm ABOUT TO BLOW THIS WHOLE SHIT UP TO SMITHEREENS\n\n[Hook: Ludacris]\nThe pot holes in the street just bentcha rims\nTell me whatcha gon do? ACT A FOOL\nMAN, THAT AIN'T STICKY, THAT'S JUST STICKS AND STEMS\nBOY whatcha gon do? ACT A FOOL\nCatch ya man with another bitch up in ya bed\nLadies whatcha gon do? ACT A FOOL\nIf the bottles all gone and your eyes are red\nBOY whatcha gon do? ACT A FOOL\n\n[Ludacris]\n2 Fast, 2 Furious...\n2 Fast... ACT A FOOL\n2 Fast, 2 Furious...\n2 Fast... ACT A FOOL\n2 Fast, 2 Furious...\n2 Fast... ACT A FOOL\n2 Fast, 2 Furious...\n2 Fast... ACT A FOOL", "image": "https://images.genius.com/ce2716ceecbf30d8ad36d6d9bdfec20e.200x200x1.jpg"}], "artist": "Ludacris"}