{"songs": [{"title": "Vato", "album": "Grow Season", "year": null, "lyrics": "[Intro: Wiz Khalifa]\nI didn't mean to make you hate me, (rewinding)\nI didn't mean to make you hate me, (scratching)\nI didn't mean to make you hate me\nBut I'm usin' this rap shit to make me cake-y. (rewinding)\n\n[Verse 1. Wiz]\nI didn't mean to make you hate me\nBut I'm usin' this rap shit to make me cake-y\nA lot of bullshit rappin' lately\nI ain't focused on that cause I'm stackin' daily (a-huh)\nKeep a good sack, could mack your lady\n19 years, not one cat that play me (no)\nHeard otherwise, trust. You crazy\nSwagger all on some old, fuck you, pay me (fuck you)\nThey say the flow cocky, maybe I should fall back\nHatin' cause you not me, I say to hell with all that (all that)\nI'm in this game to get my ones up (yeah )\nBeast on beats, trying to teach you dumb fucks (yeah)\nThink shit sweet just cause he's a young buck\nI spit heat, Wiz eat you chumps up\nTo them I'm great for how I make songs\nTo you I'm probably just another nigga to hate on (damn)\n\nBut it's the hustla, Young Khalifa\nI (what?) smoke so much, I love my reefa'\nWhy niggas so into me, fam?\nTryin' to end up missin', like the Kennedy fam.\nLotta cash flow, asshole\nThe team gettin' cake in my state\nThey get rid of weight like Ricki Lake\nThe mixtape made this shit look real fun,\nDropped Show and Prove\nNow you dudes lookin' real dumb\n\nYou better run nigga (run nigga)\nRun, motherfucker, run (run)\nWhen that young motherfucker come\nBefore you try and bring it to this kid\nPay attention to how I do this shit\nCause it ain't easy\nDimes wan' greet me\nHaters wanna heat me\nPussy ass cops wanna jail and police me, bail and release me\nI'm in the air, you a couple layers underneath me\nThere where the streets be\nAnd some tried, all failed to defeat me\nThe best without a shadow of a doubt\nKnaw'm talkin 'bout?\nPut my shit in stores, the hood bought them out\nWho got the 'Burgh rockin' something we gotta talk about?\nI show and prove\n\n[Verse 2, Kev Tha Hustla (a.k.a. Chevy Woods)]\n\nThe kid's bars harder than a mothafucka' I ain't talkin vegetables, young, I'm an onion cutta'\nAnd it's the hustla baby you gotta deal with me\nMad cause their shorty like ice, and try to chill with me\nYou at a stand still runnin' them plates, my trap team boys runnin' your face(?)\nWon't try to run to the jakes(?) Yeah I'm in the whore(?) like an upper body\nWith two bad bitches, Wiz in the upper lobby\nAnd we runnin' the train, it is never a, \"probably\"\nMy grind like Slim Fast, I keep the plate off me\nHome boy, I been doing this since way since, and trust my hand right, cause I don't need a weight, bitch\nDon't get a facelift, I lift your face prick\nYou heard shit, Kev ain't the one to play with, cause youngin's down to shoot at you like, \" Fuck what your goons is fool.\"\nSounds like a fuckin' drum roll when the Uzi shoot.(brrrrat)\nPardon me, man. It's (fucking Green Lantern making noises), now that's a foul line, get some freak shots (blam)\nThe situation is you so impatient and you can't get it man, times a wastin'\nPlus, I gotta laugh cause this is what youll never be\nYou just a mutt and I'm a well known pedigree\nCome with a settle fee, and maybe we can talk\nI'd rather strip dude and make his dumb ass walk.(?)", "image": "https://images.genius.com/b0673dfc8e451f01ab36cb28e28673e6.500x498x1.jpg"}], "artist": "Wiz Khalifa"}