{"songs": [{"title": "Welcome 2 Hell", "album": "Hell: The Sequel", "year": "2011-06-14", "lyrics": "[Intro: Eminem]\nYeah\nTold you we'd be back\nWelcome to Hell\n\n[Verse 1: Eminem]\nThere's a switch, I flip, emotions cut off\nSo cold, I done froze my butt off\nAnd this ain't even the tip of the iceberg yet\nIt's like squirtin' a squirt gun in the ocean, fuck all\nOther words, I ain't put a dent in the game compared to the damage I've yet to do\nAs long as you still have feelings to hurt, I'll be around as long as you let me get to you\nAs long as I got two balls to palm, I'll be the bomb, you're just a false alarm\nGet scant, little piss-ants, and see if I don't come along and stomp your farm\nThunder and lightning, rain, hail, sleet with a tornado's the kinda brainstorm I get\nSo when wind starts blowin’ shit\nTalk about goin’ in? Goin’ insane’s more like it\nWizard of words when he spits hazardous with it like a disastrous blizzard\nSo you better listen quick fast don't miss it\nYeah, go ahead, little, prick bastard, diss it\nBut when you get hit with a sick-ass explicit flow\nDon't ask how much of his passion is it that goes in it\nJust know that all he knows is that\nIt's better to kick ass than kiss it\nDick Dastardly of audacity\nMental capacity, unmatched it has to be stopped but it can't be\nBut man I can't just keep doin' 'em like that or no one'll rap with me\nExcept one—you asked who is it?\n\n[Verse 2: Royce da 5’9”]\nGuess who just came through to blast you bitches?\nWith the ratchet, the book of Matthew, a book of matches\nLighting 'em under white linen\nYou 'bout to have to admit it\nThey pass you the mic, asked you, spit it\nAnd you got handed your own ass, your ass in your own hands\nI'm sure they gon' laugh when you're going to the bathroom with it\nNow with what would you come against us?\nBetter be somethin' with a Bigfoot pedigree\nEasily, these are the reasons that we need to be in y'all prayers\nEach region breeds some MCs that wanna be the remise\nThat they wanna breathe our air, with these ideas\nAnybody thinkin' the game don't need the Bad and the Evil regime\nThat's like saying that the Bad Boy Piston team didn't need Isiah\n\n[Verse 3: Eminem]\nShit, piss, and bleed, this is a different breed of MCs, I swear\nBetter beware, there's too much at stake and to find someone this raw on a beat is rare\nYou can kiss my ass and eat shit stains out my underwear that I don’t even wear\n\n[Verse 4: Royce da 5’9”]\nThis gotta be no fair, it's like hitting the lottery, oh yeah\nWho you know hotter? There gotta be no pair\nShotty that I got'll lobotomy your hair\nClassic, smash it, smother it, read it and weep then\nPerhaps you will have no rebuttal and\nIn fact, you seein' me in this rappin' is like saying\nTila Tequila can sing like Jazmine Sullivan\n\n[Verse 5: Eminem]\nBack to bash your skull again, push a bitch out the Aspen\nAnd tell her get the fuck outta Dodge (Dodge Aspen)\nShouldn't have to explain my metaphors\nYou has-beens are duller than color books that ain’t colored in\nSecond and third, fourth wind, got another wind\nHere they come again, none other than Bad and Evil\nAlso known as Saddam and Osama Bin\nIt's been a long time, but I bet that neither one of us\nHave felt sicker than we do right now\nAnd we only get iller with time\nMe and Nickel fuckin' shit up on the dime\nSo telling us to pipe down is like talking to a meth head\nBruce Willis on his death bed, last breath with an infection\nFightin' it while he's watchin' internet porn, 'bout to meet his death with an erection\nMy God, what I mean is David Carradine jackin' his penis in front of his tripod, choking his own neck\nWhat part you don't get? I'm saying I die hard!\n\n[Verse 6: Royce da 5’9” & Eminem]\nWhen you listening to my bars, nothing but the F-I-R-E\nComing out your iPod, we come up in a place\nChicks heads start spinnin' like motherfuckin' white walls\nGot your mother suckin' my balls while we fuck each other, we punch each other in the eyeballs\nAnd I never say, \"I'm so–rry,\" the 5’9” and the Fire Marshall\nWe spit with an intensity to shut shit down\nIn the industry, two different entities with a propensity\nTo put these N-U-Ts up inside of your fuckin' mouth\n\n[Outro: Eminem]\nAw shit, stop it\nYo, welcome to the CD", "image": "https://images.genius.com/e46d8c5b81dd5cfba852666c93111bef.1000x1000x1.jpg"}], "artist": "Bad Meets Evil"}