{"songs": [{"title": "Thought It Was a Drought", "album": "Dedication 6: Reloaded", "year": "2018-01-26", "lyrics": "[Intro: DJ Drama & Lil Wayne]\nShout to Mack Maine!\nYeah, yeah, yeah, yeah\nHood boss, what's up?\n6, 6, 6 (Gangsta Grizz-ills!)\n\n[Intro: Lil Wayne]\nBig body on brabus, that's all I know\nBig shotties in the closet, that's all I wore\nScreaming \"money over power,\" quote, un-quote\nAnd if the bread get too low, kidnap John Doe (Hold up)\n\n[Refrain: Lil Wayne]\nI just fucked your bitch in some Young Money flip flops\nI'm smoking on that loud and you can hear a pin drop (Hold up)\nI just kissed my bitch and I left codeine in her mouth (Yeah)\nSwimming in my money, I smell chlorine when I count (Get 'em)\n\n[Verse: Lil Wayne]\nSkating and mating, I'm spinning like Daytons\nI'm winning like Peyton, I'm Christian like Laettner\nI'm putting some straightener into all of these Satans\nI'm wilder than Nathan, Goliath on David\nI'm quietly waiting, I'm trying to be patient\nBut they want me to wait for Simon to say it\nBut I am too faded, so talk to my agent\nOr they talk about you to your congregation\nMan, no conversation or negotiation\nNo affiliation by association\nI need confirmation for my compensation\nOr we make a corpse out of your corporation\nI need my donation, take drugs in rotation\nThat AK gon' sound like a standing ovation\nThey landing your facial, bandanna, rosacea\nI'm all about numbers, comparisons, ratios\nCollateral, collateral\nXanax and Adderall got me unparalleled\nMe and your bitch compatible\nGo together like a parachute and a \"geronimo\"\nThis dick is mechanical\nBut he get too casual up in the vaginal\nI pop a Viag-a-ra, she hop like a kangaroo\nSuck like a snaggle-tooth\nI ain't got time for no rumors\nWhen I am not human, or you men, I'm booming\nI'm fucking her, fucking her roomie\nI'm platinum versus aluminum, I'm shrooming\nI visualize what I'm assuming, my vision is gloomy\nBut fuck it, I zoom in and now I see movement\nAnd I'd like to thank all the niggas that schooled me\nBut I still might shoot up my class reunion\nI'm sipping that Houston like it's communion\nSmoking some weed, bright as a petunia\nI'm walking around Miss America\nLike I'm the King, King of Zamunda\nBeen hanging around with my shooters\nWhen you was still hanging out with Mr. Cooper\nWhich one of you niggas want beef?\nI'm putting your name all inside the chalupa\nMoney since the Mayans, thuggin' since the riots\nSix, exemplifyin', higher than Orion\nLion off the diet, eat the whole safari\nPop a cork or body, keep it soft and sour\nWatch the market tower\nFind a wooden counter, knock on it twice and count 'em\nCompetition, clown 'em, opposition chowder\nWatch the bitches shower, optimistic mama\nCommon sense ain't common, top position scholar\nSo far from the bottom, they can't hear me holler\nAll I say is our, all I say is our, our father\nMy lil' bae a model, pussy taste like cobbler\nMake me \"As-salamu alaykum\" about her\nWhat more can I say about her? Pray about it\nI just race the 'Rari, left it way behind me, taste the mileage\nLoud-ass blatant diamonds, I think they the loudest\nWaking zombies\nBreak a face or promise, give me steak lasagna, hate your honor\nStill my mama's baby; and my baby mamas, they some riders\nCan't deflate them tires, I'm still chasing commas\nNigga I made Big Tymers\nAnd I'm still taking time to make it timeless\nDedication problems\nSick shit, ayy, yeah, yeah, yeah...\n\n[Skit: Lil Wayne]\nThe nicest thing a fan can say to me when they approach me on the street is any fucking thing true, anything real. You know what I mean, that's the nicest thing. I mean like, even if its cliché, cliché I can still tell when that cliché was straight from your heart and that's all you could think about, all you could think to say when you saw me or if you meant it, like even if it's that, like I said just when it's real. You know why? 'Cause sometimes people can say things that's so real to them that they don't even know that, you know what I mean, some of the things they are saying isn't fact, you know what I mean, official. But you know, things like so what I mean like example: you might walk up on somebody, I might walk up on somebody on the street and they might, uh, they might... shout out the valet from today, umm well yesterday, shout out the valet from yesterday, before you opened the door of my car, you're looking in my eyes, you're a young cat too, you look me in the eyes and you say ahh, and he couldn't, his English wasn't all that, he said: I like the new album, I really like the new project, and I said to him I was like thank you man, he meant that, 'cause he looked me in my eyes and he even opened my door before he said it, you know what I mean, so I was like damn you know when I got in the car I was like damn it's not a project. You know what I mean I don't even consider that, it's damn sure not an album just a mixtape, you know what I mean, but to him that was real, that shit was real, could be a project not an album, so shout out to homie. I slid him a nice little tip you know what I mean", "image": "https://images.genius.com/3622689a5172c789024942436b11dce2.800x800x1.jpg"}], "artist": "Lil Wayne"}