{"songs": [{"title": "Miss U", "album": "Life After Death", "year": "1997-03-25", "lyrics": "[Intro: The Notorious B.I.G. (Lil Cease)]\nFam, you know what I'm sayin? (No doubt, man)\nThe motherfuckin shit just get me so motherfuckin' mad\n‘Cause, you know, that was my nigga, you know\nAnd like, I had just got the nigga Puff card and shit (yeah)\nI knew the shit was 'bout to go down\nAnd my man was like hyping me\n'Bout everywhere we go, me and O (pluggin' it)\nMe and O be together, and the nigga be like\n\"Watch, I'm telling you when my man get on, it's gonna be some shit, we ain't gonna have to sell this shit no mo'\nI'm telling you\" (aight?)\nAnd the nigga just got moked out like that, man (tch)\nThat shit fucked me up, man\n(That shit fucked a whole lot of niggas up, man)\nYo, man, I loved that nigga O too (say word)\nThat was my motherfuckin' heart\n\n[Interlude: The Notorious B.I.G.]\nYeah, dedicating this to my nigga O\nWe miss you, nigga\nGoing out to all the young niggas that died in the struggle\nWord up, shit is real in the field\nYou know, sparkin' blunts to all you niggas; word up\n\n[Bridge: 112]\nEach and every day\nDaydreams of how we used to be\nSee your family\nAnd that baby's lookin' just like you\nWhy'd you go away?\nI've been missin' you lately\nTell me what you're going through, oh yeah\n\n[Verse 1: The Notorious B.I.G.]\nUhh, uhh\nI remember sellin' three bricks of straight flour\nGot my man a beat down to the third power\nHe didn't care, spent the money in a half hour\nGot some fishscale, reigned on competition like a shower\nGot the coke cooked up, a crackhead Kevin\nIn '88, when Kane ruled with \"Half Steppin'\"\nA .38, a lot of mouth was our only weapon\nWe was kings 'til the D's crept in\nAnd now I'm missin' him\n\n[Chorus: 112]\nOoh, I'm missin' you (I'm missin' you)\nTell me why the road turns, why it turns\nOoh, I'm missin' you (missin' you)\nNah nah nah nah nah\nOh tell me why why why why\n\n[Verse 2: The Notorious B.I.G.]\nUhh, we work all week, weekends we play the movies\nWe rocked flat tops, our girls rocked doobies\nMade a killin', even though the D's knew me\nEventually, you know they try to do me\nFuck it! Fed up, my nigga wanted to take it down South\nSick of cops coming, sick of throwing jacks in his mouth\nGave him half my paper, told 'em \"Go that route!\"\nFew months, he got his brain blown out, now I'm stressed\nHis baby's mother, she trippin', blamin' me\nAnd his older brothers understand the game it be\nKinda topsy turvy; you win some, you lose some\nDamn, they lost a brother, they mother lost a son\nFuck, why my nigga couldn't stay in N.Y.?\nI'm a thug, but I swear for three days I cried\nI, look in the sky and ask God why\nCan't look his baby girls in the eye\nDamn, I'm missin' him\n\n[Chorus: 112]\nOoh, I'm missin' you (I'm missin' you)\nTell me why the road turns, why it turns\n(Tell me, tell me why)\nOoh, I'm missin' you (I'm missin' you)\nNah nah nah nah nah\nOh tell me why why\n(Tell me, tell me why) why why\n\n[Verse 3: The Notorious B.I.G.]\nThere was this girl around the way that made cats drool\nHer name's Drew, played fools out they money in pool\nPeople swore we was fuckin', but we was just cool\nShe used to hang while I slang my joints after school\nShe'd watch my bomb, help my moms with the groceries\nMy little sister, the girl was kinda close to me\nA little closer than the average girl's supposed to be\nFar from a lover, my girl was jealous of her\nThen she started messin' with some major players\nHandled keys, niggas called them the Bricklayers\nA dread kid, had a baby 'fore that bitch Taya\nFound out her baby's father cheating\nNow Drew, she gotta slay her\nOne night, across from the corner store\nTaya ran around the block with a chrome four-four\nSqueezed all six shots in the passenger door\nThe dude lived – what my baby had to die for?\nI'm missin' her\n\n[Chorus: 112]\nOoh, I'm missin' you (I'm missin' you)\nTell me why the road turns, why it turns\n(Tell me, tell me why, ooh)\nOoh, I'm missin' you (I'm missin' you)\nNah nah nah nah nah\nOh tell me why why why why (oh God tell me why)\nOoh, I'm missin' you (tell me, tell me why)\nTell me why the road turns, why it turns (ooh ooh)\nOoh, I'm missin' you (missin' you)\nNah nah nah nah nah\nOh tell me why why why why\nOoh, I'm missin' you\nTell me why the road turns, why it turns\nOoh, I'm missin' you", "image": "https://images.genius.com/f4413efc6682e8c2cfa7a01117fc8cd5.1000x1000x1.jpg"}], "artist": "The Notorious B.I.G."}