{"songs": [{"title": "Oh Nelly", "album": "Nellyville", "year": "2002-06-25", "lyrics": "[Intro]\nHere we go again\nReal smooth, yeah\nHere we go again\n\n[Verse 1: Nelly]\nThey said a country boy, came through and then - changed the game\nIf you what you got ain't hot then - check your flame\nIf what you spittin ain't hittin then - check your aim\nYour record sales start to slip and then - Nelly to blame\nNow who you know come through first time on the scene\nNo set-ups, no guest appearances in between\nFire like a nigga drinkin gasoline\nI keep it hot, like my dirty down in New Orleans\nThe Rams won the Superbowl, bought myself a ring\nWhether you sparkle or you bling, don't matter same thing\nThug drinkin mo', but Don the King\nI'm gettin pissy, with Tissy, Missy and Irene\nReal close friends that like to try things\nMe and my dirties we like to buy things\nFuck around and give me a license to fly things\nLook up in the sky and have a Nelly sighting, like\n\n[Hook: repeat 2X]\nSkurrrrt, oh! (Gon' break it down)\nOh Nelly! (Gon' change that game around)\nAnd I bet (y'all really gon' hate him now)\nWhy don't you come ride with me?  Oooh-wee!\n\n[Verse 2: Nelly]\nFirst name Nelly, last name Nel\nFirst letter C, last letter L\nSix hundred fly by, what the hell?\nV-12 full detail, sittin on Sprewell's\nWho in?  Can't tell, too much tint\nBut why the radio so loud?  Too much spent\nNever be a Bush man, too Bill Clint'\nBoth country boys, and if the head right, E.I\nHead for my residency, lovin my presidency\nI do it like you never did see\nShady to them niggas that's shadin me\nGivin back to the ones that gave to me\nBought a Caddy for the man that created me (who?)\nMy daddy, call him Big Nelly (ooh!)\nPimp juice flowin through that bloodline cuz\nHuh, see what it does?  Yeah, you feel the buzz, like\n\n[Hook x2]\n\n[Verse 3: Nelly]\nOne mo' time!  N, E, dash L-L-Y\nIf you didn't like me then, gon' hate me now\nMe and Murph' fogged out in the buggy I\nWith the, suction doors, two bad-ass whores\nHolla at Yo, cause I need that custom made\nWaves, fresh fade, brand new Band-Aid\nSkurrrt, them boys ain't playin around\nUnless it's her watch according to her face, hopscotch never\nNever tic-tac-toe, there's too many of those\nI need a Rocky Dennis face - uhh, know what I mean?\nThen I'm good to roll; hey, out of control\nNew motto - never fuck the same ho!\nTryin to catch Wilt, four more to go\nFrom the bed to the flo', jackrabbit too pro\nKnock 'em out, wake baby girl to let her know\nYo - you can't even stay here tonight, f'real, I'm sorry\n\n[Hook x2]\n\n[Nelly - still talking over Hook]\nY'know, cuz, my security they gon' be knockin on the door in a minute\nAnd, if you ain't out ma it's, it's it's gon' be violence\nUm, yeah, f'sure, nothin personal, fo'sho'\n\n[Interlude]\nUh uh, uh, you come ride with me\nUh, uh uh, uh you come ride with me\nSkurrrrrt! Uh uh, uh, uh you come ride with me\nUh uh, uh, uh, uh uh\n\n[Hook x2]", "image": "https://images.genius.com/ee6c6181ebd522da5b345ff9cd0a61f9.1000x1000x1.jpg"}], "artist": "Nelly"}