{"songs": [{"title": "Ghost Deini", "album": "Supreme Clientele", "year": "2000-02-08", "lyrics": "[Verse 1: Ghostface Killah]\nYo, summer time holding the nine, split the Vega in half\nJeeps rumble and my dogs puff grass\nBank stopping, hide your rocks, hydraulic\nThe kid with the most knowledge\nWill obtain and touch top dollars\nHold me down, hand me my cake, dusty, bake, activate\nFuck your corny debates\nI'm like cake or maybe like ten thousand dollar rabbits\nThe kid walked through, switch up his accent, now I'm from Paris\nCash the bill, frozen elements in gold\nSigns from the most high causes me to break the mold\nHow the fuck was y'all niggas thinkin'?\nYou think I fell off the ledge?\nThe legendary Ghost Deini might be dead?\nNever, impossible, pull out black burners like tonsils\nTwo Gallants, hitting if we got to\nBusting at y'all niggas daily, wall to wall, Hawkins\nSucking your teeth cause God chain-talking\nLike Ghostface this, Ghostface that\nGhost sold crack, now his revelations spoken through rap\nVelour-ed down like the Sheikh of Iran\nGasoline CREAM wrapped in hospital bands\nModel vans, Michael Davis, it's me against housing\nExtraordinary pro-black, sold God creations to control thousands\nCatch me at the flicks, Apollo rap Frederick Douglass\nYou know what? A-yo, fuck this\nA-yo, how can I move the crowd?\nFirst of all, ain't no mistakes allowed\nHere's the instructions, put it together\nIt's simple ain't it? Well, quite clever\n\n[Bridge: Ghostface Killah]\nMarvin, Marvin, you were a friend of mine\nYou stood for somethin, ugh\n2Pac, Biggie, ohh how we miss you so\nWe want y'all both to know\nWe really love you so\n\n[Verse 2: Ghostface Killah]\nA-yo, I'm Gucci down, Wally boot, Jamaican hat\nLong 4-pound, ask niggas how I get down\nDon't speak much, deluxe plush imaginations\nHold a note like Willie Hutch\nYou might've bumped into me on the Rikers bus\nWeed in my cheeks, gem in my beauty sleep sleeve\nDead serious, knowledge by 2% triple geese\nCome on, we juggle mics\nThree Card Monte, amps advance to the final\nShow these niggas how the way we dance\nHot night, Jamaica\nCame through in a booger green '68 Pacer\nMad paper, high as a fuck, truck\nTwo rappers got stuck that night, I ain't saying no names\nThey know who, thank you for the chains\nOutdoor event, New Year's Eve, Cali weed\n30 seconds til we tear and decease\nQuick, call all my seeds dipped in the crowd\nThe ho spotted me, he knew not to call my name out\nHe walked off softly, we exactly\nFormed like Christ and the disciples\nBlack fatigues, lethal-faced dunnie, he held the rifle\nWe had the whole shit shook\nYour favorite rappers dropping they drinks\nOn the low tucking they links, we made eighty off the books\n\n[Verse 3: Superb]\nOne of the illest since Magic Johnson, no disrespect\nBut metaphors'll keep me out the projects\nRap connects'll keep me correct, ayo, I wrote this on Donnie roof\nAfter his funeral, on one knee, thinking his killer's following me\nSo to my nigga Donnie, up there\nCan you please tell God that we fucked up here?\nYou got beer, weed, guns, AIDS\nAll these obstacles, it's hard to make it nowadays\nWhy's the Devil winning, some say it's our fault\nIf that's the answer, you know smoking cause cancer\nLet me drop a bracelet, leave a chain behind\nMy tape stay at the beginning cause that's how they rewind\nY'all know how we dine, we don't eat swine\nAnd we don't drink wine\nIf you don't bring me some motherfucking cognac, I'll kill you\nI can't feel you, ain't in my senses, and you ain't in my dollars\nI fuck with rottweilers, no leashes, no collars\nBrolic scholars, that's Ghost Deini", "image": "https://images.genius.com/f0013dbd91dff7fd77352a0283ad6ec5.1000x1000x1.jpg"}], "artist": "Ghostface Killah"}