{"songs": [{"title": "Forget", "album": "No Genre Pt. 2", "year": "2014-07-09", "lyrics": "[Verse 1]\nBaby you deserve the best, you deserve the best tonight\nIt ain't much time left, so you know the time is right\nPay no mind to all the rumors, you get caught inside the hype\nWe can both take off, no commercial jet, it's a private kind of flight\nWe can both get so lit, like a stick of dynamite\nI can tell that our bodies both click, kinda like a pilot light\nI'mma fire the pussy up, you can cool it down with ice\nWhen you talkin' to your friends, tell 'em he can't do it like me\nGirl, ain't no option, girl he can't rock it, naw, he can't rock it like me\nGirl keep on poppin', yeah keep on poppin', yeah keep on poppin' on me\nYou and I both know he basic\nThat dick got you starin' at your phone and you debating for real\n\n[Hook]\nForget aboutcha nigga, you know you all that\nI'll make you forget aboutcha nigga\nAnd when he hits you, you won't call back\nForget aboutcha nigga, forget aboutcha nigga, forget aboutcha nigga\nI'll make yo ass forget aboutcha nigga\nForget aboutcha nigga, forget aboutcha nigga\nForget aboutcha nigga\n\n[Verse 2]\nAye, how come you can't get dick down some?\nBumpin' a shawty album\nI'll give us both 'bout an hour 'til we both figure out the outcome\nWhat's the outcome? Get it?\nI don't wanna get too specific\nBut you know that I know you gon' miss it\nWhen I'm holding you close and I hit it\nThat's how it's supposed to be, now she buzzin' all over me\nBaby girl I'mma rock the boat, love overboard, love overseas\nAll night long I'm still strong\nI don't know, somethin' must have came over me\nLike a pornstar in a foreign car, we damn near broke 'bout both the seats\nI shift gears, she roll the weed\nIn the trunk, that's where my motor be\nShe upload me pics, no clothing while she network socially\nSee she and I both know he basic\nThis dick got her staring at her phone and she debating, for real\n\n[Hook]\n\n[Bridge]\nShe's a sociallite\nThe social able type\nEven her schedule is sexual, oh what a night\nI'm sayin', \"Oh, what a night, oh what a night\"\nI step into my DJ booth and say hello to the mic\n\n[Hook]\n\n[Outro] x2\nI'll call, you can't get dick downfall\nI'll make you forget about him", "image": "https://images.genius.com/07af9b12b2956baf31b88d2ae47697d2.500x500x1.jpg"}], "artist": "B.o.B"}