{"songs": [{"title": "Pop Shit", "album": "The Neptunes Present... Clones", "year": "2003-08-19", "lyrics": "[Intro: ODB]\n1-2, 1-2, 1-2 (guess who's home?)\nYeah mothafucker, you know who it is\nOl' Dirty Bastard a.k.a. Dirt McGirt\nKillin' anything that moves {x2}\nYou know what time it is\nNeptunes mothafucker.. The Neptunes\nYo 1-2, 1-2 (yeah this shit don't stop!)\n\n[Ol' Dirty Bastard]\nPlug it up, cocaine make ya speakers blow\nParty amps gettin' sniffed up now wit it too\nWhen there's somethin' in my camp, a wireless amp\nHigh as a ramp, speak to Wu like stamp\nThe wet got me damp, pussy darker than lamp\nMoses you don't wanna 'ttempt, I see all fans\nI'm too drunk too, now you like \"Move!\"\nCoked out in Peru, in hair/here like shampoo\nSmall like snubs, camera to you scrubs\nKinda like stubs, confidential at the club\nSniff buds like Rule, I fast Ghost like Wu\nGet cream like tube, burn ya fast food\nAppeared in rude, we'll take ya panties off nude\nYes and renewed, big guns and clued\nBitch I'm loose like Lugz, Dirty to the litter bug\nGirls you like hugs? I don't like thugs\n\n[Hook: Pharrell (ODB)]\nPop shit, bitch what's wrong?\nPop shit, nigga what's wrong?\n(Take my drink it's about to get..) OOH!\n(Take my drink it's about to get..) OOH!\n(Me and my niggas about to get...) SUED!\n(Me and my niggas about to stop..) YOU!\n\n[Ol' Dirty Bastard]\nAiyo all this shit is from the ghetto\nSmoke Palmetto, sing like Peno\nCarry the Heathrows, scared of police though\nThey tried to kill O. in prison yo!\nHad me turned out, drunk is all about\nI got this money pourin' out the stout\nI'm a loud mouth, drunk party is out\nPlay this music on every route\nFollow Dirty, I'm the WhiteOut\nCatch bitches like trout, get drunk, won't stop\nI'm gettin' this money, called gettin' honey\nStreets of Brooklyn and ain't a damn thing funny\nHave a day sunny, bitches put me in ya tummy\nI'm the nigga on the cross burnin' about 20\nGo me a bunny lookin' good and funny\nAll you niggas, is straight crash dummies\n\n[Hook]\n\n[Ol' Dirty Bastard]\nI was checkin' out my melody before The Blueprint\nFelony, a nuisance, huggin' me and my two cents\nDon't double the six takes, never did a mixtape\nBut rather a chick take but waste any weather we get cake\nI let rats have it, fuck these rap faggots!\nEverybody want the kid dead like Pat Garrett\nI'm a goon, speak with a mellow tone\nRock yellow stones, gun longer than a broom!\nCuz felon on the ride is long due and soon\nOut again like boom, government comin' soon\nAnything less is uncivilized like a case mack\nI'm a shooter used to stay jack, cooler than a Maybach\nArubu known to collect, twistin' up that haze black\nAnd Backwood on that, good rap, I stay strapped\nP.P., don't carry that weight\nNigga redhead, fuck with chicks if their head straight\n\n[Hook]\n\n[Outro: ODB]\nYeah you know what time it is\nIt's that new shit\nDirt McGirt, Neptunes", "image": "https://images.genius.com/8bcc21a6b9f49f44b5c447a289abacdf.640x640x1.jpg"}], "artist": "Ol’ Dirty Bastard"}