{"songs": [{"title": "Playground", "album": null, "year": null, "lyrics": "[Verse 1]\nBustin, I'm going off\nSting like a bee, float like it's Noah's ark\nYou know it's hard, flow is sharp\nLike I'm blowing darts\nNiggas bear with me\nThese hoes out here looking like some spare kidneys\nThey give it up, how gracious, ass outrageous\nUp in the club you could spot her, a Dalmatian\nSaid she found God, but to me she found Satan\nShe only getting hotter\nWhat's good with the Ramada Inn?\nGot a game tighter than them jeans her ass hiding in\nI got that D baby, ain't talking vitamins\nShe said: \"That's cool nigga\nBut can you buy the Benz? \"\nShe playin’ niggas like a violin\nI hit that ass just a little more violent\nShe hitting notes, then I'm ghost like it's Shaolin\nI'm on the prowl maybe soon I'll throw the towel in\nUntil that day's found\nThis is my playground\n\n[Hook]\nThis is a playground\nBut if shit got hard, would you stay down\nWould you stand up for me, would lay down\nOr would you 'scape town on the first Greyhound\nHey now, hey, this is a playground\nBut if shit got hard, would you stay down\nWould you stand up for me, would you lay down\nOr would you 'scape town on the first Greyhound\nHey now, hey this is a playground\n\n[Verse 2]\nThis is a playground, merry-go-round\nLike a dream for a nigga\nBut I swing on a nigga if he push me\nI'm makin' moves like the Rutgers\nThese ain't no monkey bars motherfucker, not a sucker\nBut these labels throw me deals like the prosecution\nWant to underpay me and fuck me like its prostitution\nI write that constitution, you know, that classic shit\nHow you going to own my masters\nAnd you ain't mastered shit?\nGive them my ass to kiss, my lawyer laughed at this\nSaid they was on some bullshit when they drafted this\nLike MJ, so I wagged a finger like Dikembe\nUntil you niggas talking proper paper, no comprende\nAnd now the deals got mills like Wendy's\nAnd got these labels doing bids like inmates\nHoping my pen lays my name down\nUntil that day's found, this is my playground\n\n[Refrain]", "image": "https://images.genius.com/2cd936e786e1ab454043327d585c7702.1000x1000x1.jpg"}], "artist": "J. Cole"}