{"songs": [{"title": "Problemz", "album": "Prophets vs. Profits", "year": null, "lyrics": "Yeah man, yo Marla what's up\nYeah, Inebriated Beats, big up Boston, the whole Boston\nEdo.G what's up man?  I got you\nWe gon' bounce this now, can I start?  Can I start?\nHere we go\n\n[KRS-One]\nI'm the newest and the truest MC on the mic\nI wrote over 500 songs, pick what you like\nIt ain't easy bein me, by day or night\nBut it's easy bein free to recite what you like\nHip-Hop is my inalienable right\nWhen it comes to emceein KRS is a whole different type\nNow go get it right, did I flow spit it tight\nIn a fight I was the type to go get a pipe\nBINK! BINK! BINK! BINK!  Movin 'em back\nBINK! That's the sound of an aluminum bat\nBut it seems they new to these facts\nWhich means they new to the tracks\nWhich means they do hold us back\nToo new to know all that but still runnin they trap\nDo the math, radio gets a 20 record a week stream\nBut only three are ever seen\nWhat happens to the other 17?\nIt's a PROBLEM.. PROBLEM..\nPROBLEM IN HIP-HOP TODAY!\nWe gotta solve it\n\nToo many players and not enough crime\nWhen they finally wake up they woulda ran out of time\nThey can't see today how they effect tomorrow\nToo afraid to follow, cause they trust is hollow\nBecause according to the laws they'll harp some sorrow\nYo, \"Victory Over the Streets\" - that's our motto\nBut if people ain't got no vision, that's a PROBLEM..\nPROBLEM IN HIP-HOP TODAY!\nWe gotta solve it\n\nPeople say, \"Kris - why you teach so much?\nWhy you preach so much?  Why you speak and such?\nWhy you so bent on reachin each of us?\"\nI reply - because you eatin with us\nIn the future our children will be meetin with us\nHave a seat then with us and start speakin with us\nThey'll be critiquin us to be sure they believe in us\nWe don't need a PROBLEM..\nPROBLEM IN HIP-HOP TODAY!\nWe gotta fix it\n\nWe live non-toxic, we teach that hip-hop is\nThe transformation of all subjects and objects\nRetrain your optics, to reinterpret the topics\nWe gotta stop treatin hip-hop like a product\nAnd more of a strategy; I got graphs, charts\nSacred textbooks, these cats can't battle me\nBut they try, and why?  Cause that's a PROBLEM..\nPROBLEM IN HIP-HOP TODAY!\nWe gotta fix that\n\nThese cats need history to get with me\nBut hip-hop's history's a mystery\nSo how they gonna find out, trial and error\nWe can make one the example for all to get better\nInform, KRS is not the norm\nI go from hot to warm to cold to hot\nBut hip-hop's history many forgot\nAnd that's a PROBLEM..\nPROBLEM IN HIP-HOP TODAY!\nWe gotta solve that\n\n[interlude beat]\n\nPROBLEM.. PROBLEM IN HIP-HOP TODAY!\nWe gotta fix that", "image": "https://images.genius.com/32bf9790e346029d7cf0897f83ab18fa.1000x1000x1.jpg"}], "artist": "KRS-One"}