{"songs": [{"title": "The Watch (feat. Raekwon)", "album": null, "year": null, "lyrics": "(featuring Raekwon)\n\n[singer]\nTony for mayor.. (x4)\n\n[Ghostface Killah]\nCatch me in a crisp blue six, deep dish\nDoors is crisp, velour stop at the wrist\nWatch is involved, talk to me Trick Daddy\nI liked the way you tilt ya hat up in that Caddy son\nCan't believe you the most slept on\nTook a break since the Cuban, niggas lookin' like you just repped wrong\nYou done slimmed down a bit, got caught with the hammer\nSteal banners, medical examiners, clocked live hammers\nFor real, you a live nigga, rock ya five in ya slippers\nLike them other five guys in ya picture\nCome on, watch, I'm the star of the show, so blow then\nMothafucka, you ain't blew in three years\nYou son of a bitch, that's why I rock the big shit\nDon't forget who you is, nigga, you my little shit\nI will crush you to pieces, stop ya heart from tickin'\nAnd you mad 'cause you a older clock, couple rocks missin'\nAnd my Breitling--the band: you can say it's iced lightning\nYou don't like him, do you? You wanna fight him\nIn fact, I should've put you back, relaxed on the stones\nAnd copped the two-thousand leather in snow cones\nA bowl of milk almost killed you, ak, you almost drowned in Pops\nI bought another box, I'ma keep it real with you\nAnd I'ma murder you if ya bitch-ass get on my nerves again\n\n[Raekwon (as \"the watch\")]\nYo, Ghost, you'se a funny nigga\nTurn on the radio, all you hear is X and Jigga\nHa ha, you vexed, nigga?\nNo airplay\n\n[Ghostface Killah]\nBet my gat spray\n\n[Raekwon (as \"the watch\")]\nYo, that's hearsay you spray hairspray\nAnd up North, nigga, you ain't gettin' jailplay\n\n[Ghostface Killah]\n(How you know?)\n\n[Raekwon (as \"the watch\")]\nYo, it's obvious, Clan's day\n\n[Ghostface Killah]\nHold on, let me park my shit\nLet me find out this nigga barkin' and shit I'm a Don of this shit\nAnd you know that shit I wrote with Golden Arms is a hit\nMy Wallos show off, go off like an alarm in the six\nDraped in yellow and I'm still poppin'\nMy movie life in the hood is like an ill doctrine\nBeat trial with illegal aide, fuck Cochrane\nAnd if it's on I might blow you if I'm boxed in.. {*echoes*}\n\n[Raekwon (as \"the watch\")]\nYo what's wrong man?\nYo, yo, yo, what you doin', man?\nYo, man, chill out, man\n\n[Ghostface Killah]\nDon't even worry\n\n[Raekwon (as \"the watch\")]\nWhy you..\n\n[Ghostface Killah]\nOk\n\n[Raekwon (as \"the watch\")]\nCome on, son\nWe can't.. don't depart us like that, son\nCome on\n\n[Ghostface Killah]\nI'ma destroy you\n\n[Raekwon (as \"the watch\")]\nCome on, man\n\n[Ghostface Killah]\nYou pop too much shit\n\n[Raekwon (as \"the watch\")]\nCome on, man, I'm just tellin' you time\n\n[Ghostface Killah]\nIt ain't even like that, you know who bought you\nA nigga's just fuckin' with you, man\n\n[Ghostface Killah]\nBye!\n\n[singer]\nTony for mayor.. {*repeats to fade*}\n\n[Outro: Ghostface Killah (Raekwon)]\nYo, let me tell y'all mothafuckas somethin'\n(Shoot one of those niggas, Lord)\nWe could battle for belts, ice (Type shit)\nWhatever the fuck you want to do\nLet me tell y'all somethin'\nThis the Theodore Unit, mothafucka\nWe takin' the bait of this shit\nThat's word to my momma, man\n(Staten Island, nigga, what, nigga?)\nCoke, spoon throwers (Get ya money right)\n(Gotta know how real do this)\nSlew-footed mothafuckas, I pop all y'all niggas\nY'all niggas is fucked, straight up\nWe back in here now, mothafuckas\nIt's the fuckin' Unit, you heard\nThat's the Theodore Unit\nY'all mothafuckas better recognize\nAight? That's my word\n(Yeah, nigga, yeah)", "image": "https://images.genius.com/32fabf2b8b2eb256a0e1d6a14a76852f.500x500x1.jpg"}], "artist": "Raekwon"}