{"songs": [{"title": "Teriyaki Joe: Neo-Harlem Detective (Chapter Three: Gravy)", "album": "Teriyaki Joe: Neo-Harlem Detective", "year": "2013-12-02", "lyrics": "[December 2, 2013:]\nTeriyaki Joe: Neo-Harlem Detective\n\nChapter 3: Gravy\n\n---Download Complete--- Hmmm looks like I'll be heading upstairs.\n\nThe cab stinks. The stale intensity of so many burned out digital cigar cores left to decay on the floor. The acid graffiti. It doesn't fit.\n\nNot fit transport for somebody \"Going Upstairs\" as they say. We all say that. Some champagne and classical music would be nice.\n\nMaybe a chauffeur would give the trip up top a fancier sentiment. I mean the best of us should travel with a little more class and dignity.\n\nThis is like being in a port-o-potty with thrusters. A couple coughs. A well aimed spit. Yeah thats how the \"Best Of Us\" do it, precisely.\n\nUp through the clouds. Directly into the Moon. We pass through it. It's only a meter thick. So warm. So fake. Color is still wrong to me.\n\nThe cab slows to a halt. Border patrol scans the ID tags. All clear. One step down. Disinfection nozzles spray the cab down. Missed a spot.\n\nStep three is up next. Blindness. Total sensory disconnect. 3 seconds. 3 weeks. It's all the same in \"non-sense.\" Helpless. Out of touch.\n\n\"EOJ LAER TON RUOY\" --------- *digital sizzle\"\n\n----------------------—•----------------------------------------------------music-------------------------------------------------------\n\n---------------!!! Awww Nice. Grass. Glass. Nothing else. Central Fucking Park Baby! It's all tai-chi and vegan techno utopia. Upstairs.\n\nNH is Downstairs. Can't see it from here. Shit I wouldn't wanna see it either. Most these folks never have. Never will. Where's my devil?\n\nBirthing out of Non-sense mode is always a mellow moment. Has to be or the shock would give you a heart attack. Wish I could smoke here.\n\nMan would you look at that. The real Sun. Son of a bitch. My devil approaches. His name is 11. Mid level manager at a pill manufacturer.\n\nI don't believe him. He's not my devil. Too many questions. He's just checking me out. He knows I know. He changes to his real voice.\n\nAll this espionage. Games. The real voice isn't really right either. Neither are the eyes. All tests. The \"air\" is thick with nano-machines\n\nIt's like wading in a pool of thin water. It's what moves things here. A seamless, all encompassing soup of nano-machines & information.\n\nA spoonful of this stuff would sell for millions back Downstairs if we had real sunlight to keep it alive that is. What'd he say???!!!\n\n\"That's right Mr.Teriyaki (-It's Joe!-) I want you to bring my daughter back.\"\n\nImpossible.", "image": "https://images.genius.com/2c3df61679d5348d24cc5a0dc865540b.533x533x1.png"}], "artist": "Lupe Fiasco"}