{"songs": [{"title": "Here We Go", "album": "Faces", "year": "2014-04-11", "lyrics": "[Intro]\nBe without fear in the face of your enemies\nBe brave and upright that God may love thee\nSpeak the truth even if it leads to your death\nSafeguard the helpless and do no wrong\nThis is your oath\n\nYeah, yeah so how's it feel?\nCan you feel it?\n\n[Verse 1]\nPolo pajamas, I think I made it\nI show my mom my first million, she damn near fainted\nThe rich and famous, so nice to make your acquaintance\nThe legends put out the latest, I feel that it sound outdated\nI'm the hardest working person in the universe\nTemptation victim to the church of Lucifer\nInternet rappers ain't shit when no computers work\nYou spent your whole advance on two chains and a Gucci verse (a Gucci verse?)\nI'm the greatest, admit it, I'm the greatest\nAnd I don't hold a grudge against anybody who hated\nI'm underrated, don't fit on nobody's playlist\nIf I ain't in your top 10 then you're a racist\nCocaine ether creates a strange creature\nThey wasn't hearing me 'till I fucked with a Brainfeeder\nI'm still playing it out the same speakers\nI did it all without a Drake feature!\n\n[Chorus]\nSo many things that I've created\nBut this right here might be my favorite\nThey ask me how I feel, I say \"amazing\"\nI feel amazing\nSo many things that I've created\nBut this right here might be my favorite\n\n[Verse 2]\nBrand new home, I think I made it\nKey to the city, I keep to open the gates with\nA briefcase with a million under the pavement\nThat's just on some rainy day shit, yeah\nThe kids getting murdered that I grew up with\nThey shooting up doing drugs or they doing nothing\nMy girl's parents still living out in the hood\nI come through in that new Beamer like the shit all good\nDamn, I'm just a human let me make mistakes\nShit has changed ain't little Malcolm with a baby face\nEven my homies tell me take a break\nThey know it ain't their place, and this a day I hate to waste\nTrying to be a legend by tomorrow\nThey say I can't, I'm determined to prove em' wrong though\nI'm not perfect but they ain't either\nI did it all without a Jay feature!\n\n[Outro]\nYou hear a lot of savage and unnatural things about the people these days", "image": "https://images.genius.com/cb728ec66cfad5964e15291c3c4a294c.375x375x1.jpg"}], "artist": "Mac Miller"}