{"songs": [{"title": "Slap Them Up", "album": "Return of the Boom Bap", "year": "1993-09-28", "lyrics": "[Intro: D.J. Premier]\nTellin' it like it is, right about now D.J. Premier is in the\nMotherfuckin' house and shit, ya know what I'm sayin'? But yo\nYo Kris, run that shit, ya know what I'm sayin'? That, that shit\nMy joint. Run that motherfucker...it's only right kid...\n\n[KRS-One]\n(Do it, do it, do it...)\nDrop that bassline...\nYou want lyrics? We give ya lyrics. Check it out now, one time...\n(Do it, do it, do it...)\nWhen we come in all de dance 'nuff D.J.'s shut up, woy!\nGal! Will ya come slap dem up\nWhen we come in all de dance 'nuff D.J.'s shut up, woy!\nIll Will, slap dem up\n\n[Verse 1: Ill Will]\nMC's get ate, get broken like a pretzel\nAnd get dissed if they ever try to step to\nThey can't take a MC with loose lips\nTalk a lotta shit but sink no motherfuckin' ships\nLyrics make bigger holes than hollow tips\nWatch another rapper body get stiff\nJust like in church, we pass the basket\nAs I preach over his casket\nFuck it, kick the body right over\nAnd say \"See ya, hmm...nice to know ya\"\nGot another rapper to see\nYo Kris, bust that ass [certainly]\n\n[Verse 2: KRS-One]\nEither shit or get off the pot\nLet the original rapper rock the spot\nYou stand there and jock, goin' [mumbles]\nThis is absolutely ludicrous, what can you do to KRS\nChattin' foolishness, step along quick with that stupidness\nIt's me reppin' this for self, where else ya lookin'?\nI got more rhymes than all the Jamaicans in Brooklyn\nSo beat it or be seated, gee, I'm mad undefeated\nYoung boy, you can't see me, run along and make pee-pee\nI was rockin' rhymes when \"La-Di-Da-Di\" was a demo\nAdmit you been on my tip for years and just can't seem to let go\nGo, go call your mother, tell her you wanna battle KRS quick\nI bet the minute you get home you'll get your ass whipped\nCrazy ill mad styles is what I give'em\nNot a run-of-the-mill'em, I drill'em, I got ridiculous rhythm\nNone of my styles you can get with'em\nStill um, will um, your crew come get some so I can kill'em\n\n[verse 3: Ill Will]\nWell I roll by myself but don't let it fool ya\nIf I got beef my crew'll damn step to ya\nWe don't play no games, I'll come straight to your rest\nLift up your shirt and blast you in your chest\n[Well that was fresh]\n\n[Verse 4: KRS-One]\nA fad doesn't fill the bill, but mad skills will\nDon't let me have to kill you kid, god forbid still\nGreed will lead your need to succeed\nBut your speed, your speech\nYour outreach is a breach of what I teach\nFor lyrical styles you're a leech\nIf I was Spanish I'd say, [\"You rhyme like a beech\"]\nWow-wow-wow-wow, wow-wow-wow, wow-wow-wow...\nWow, for a amateur you really looked hard\nBut you're really a bitch, when you get it together\nCall me, here's my card\nCheck the list: you lack breath control, mental behaviour\nLyrical talent, imagination and flavour\nI got no time for amateur rhyme, you could be hurt\nThinkin' you're hard because you wear a gangsta T-Shirt\nI'll smash your wanna-be ass in the deep dirt\nBlack, you'll come up dizzy sayin' \"How da fuck he do dat?\"\nCause you're yappin' like you can't be reached\nIf your name ain't Arrested Development, well save your speech\nTime to ill, I got mad skills to fill\nNot a fake, I got more styles than Drake's got tasty cakes\nGotta be the best, gee. Don't try to test me\nYou'll get jacked son, even if your name is not Jesse\nLet's be up front when I meet ya\nPeace, uh, I'm the motherfuckin' teacher\n\n[Outro]\nWhen we come in all de dance 'nuff D.J.'s shut up, woy!\nGal! Will ya come slap dem up\nWhen we come in all de dance 'nuff D.J.'s shut up, woy!\nGal! Will ya come slap dem up, up, up, up, up...\n(Do it, do it, do it...) x2\n\nYo...South Bronx, South South Bronx\nSouth Bronx, South South...yo, Uptown\nBrooklyn's in the house, lemme tell ya 'bout Staten Island\nWhat about...Queens?", "image": "https://images.genius.com/2573d3afb044969d03669dee90d609f7.1000x1000x1.jpg"}], "artist": "KRS-One"}