{"songs": [{"title": "My Downfall", "album": "Life After Death", "year": "1997-03-25", "lyrics": "[Intro]\n*Phone rings*\nYo...hello? Faith?!\n*Click*\n*Phone rings*\nYo\nKill you, motherfucker\nHello?\nKill you, motherfucker\nWord?\nI'm gonna get you, motherfucker\nYou better watch your motherfuckin' back\nThat's my word nigga\nGet the fuck outta here\nBetter watch your motherfuckin' back\nWatch my back? Word?\nI'm gonna get Biggie, I'm gonna kill Biggie\nYou soft duke, you soft\nFuck all you niggas, you all ain't SHIT\nWatch your motherfuckin' back\nEat a dick\n*Click*\n\n[Interlude: Puff Daddy]\nJealousy's a motherfucker, you weak jealous motherfuckers!\nIf you a jealous motherfucker, you just a weak motherfucker!\nSee when you on top, motherfuckers just wanna bring you down!\nMotherfuckers don't even know you, and they don't like you\n\n[Verse 1: Notorious B.I.G.]\nUhh, I dream filthy\nMy moms and pops mixed me with Jamaican Rum and Whiskey\nHuh, what a set off\nShoulda pushed him dead off, wipe the sweat off (uhh)\n'Cause in this world I'm dead off, squeeze lead off\nBenz sped off, ain't no shook hands in Brook-land\nArmy fatigues bring fatigue, to enemies, look man\nYou wanna see me locked up, shot up\nMoms crouched up over the casket, screamin' \"bastard\"\nCryin', know my friends is lyin'\nY'all know who killed him, filled him with the lugers from they Rugers\nOr they Desert, dyin' ain't the shit, but it's pleasant\nKinda quiet, watch my niggas bring the riot\nGivin' cats the opposite of diets\nYou gain thirty pounds when you die no lie, lazy eye\nI was high when they hit me, took a few cats with me\nShit, I need the company (uh-huh)\nApologies in order, to T'Yanna my daughter\nIf it was up to me you would be with me\nSorta like Daddy Dearest, my vision be the clearest\nSilencers so you can't hear it\nCompetition still fear it, shit don't ask me\nI went from ashy to nasty to classy, and still\n\n[Chorus: DMC]\nThat's not all, MC's have the gall\nTo pray and pray for my downfall (they pray)\nPray and pray for my downfall (they pray)\nPray and pray for my downfall (they pray, they pray)\n\n[Verse 2: Notorious B.I.G.]\nThis goes out to cats, fingers in they ass again\nFifty dollar half-a-men, daydreamin'\nFuck around get wet like semen, your whole team and\nBe more gone than Freeman\nI took the cream and, moved to new places, new faces\nFuck the screw faces, 'cause when I flip\nI make the papers, dangerous, we Goodfellas\nNiggas can't bang with us, try to do me\nMy crew be unruly (what)\nSome old school cats that call gats toolies\nCall blacks moolies, think it's cool to smoke woolies\nAnd fuck without rubbers (what)\nSpecialize in killin' wives and grandmothers\nWho ya trustin', shit\nWhen Frank start bustin', Frank start somethin'\nKillin' ya gently, God meant me, to push a Bentley\nMe and Sean Combs takin' broads home\nOn the phone with the chip, with these Cristal chicks\n'Bout to make our own porno flicks, my life's the shit\n\n[Chorus: DMC]\nThat's not all, MC's have the gall (they pray, they pray)\nTo pray and pray for my downfall (they pray)\nPray and pray for my downfall (they pray)\nPray and pray for my downfall\nThat's not all, MC's have the gall (they pray, they pray)\nTo pray and pray for my downfall (they pray)\nPray and pray for my downfall (they pray)\nPray and pray for my downfall, fall\n\n[Verse 3: Notorious B.I.G. (Puff Daddy)]\nWe used to hold the gold, now we floss with diamonds\nNiggas want my team to stop shinin'\nPray my fame start declinin'\nWhinin' like girlies (stop whinin' you bitches)\nWe been around the world twice, all we got is mo' ice\nAnd mo' nice, sacrifice your heart\nLexus with the automatic start (what)\nFifty shots'll tear your club apart\nEatin' shrimp À la carte, with some bitches from Brussels\nEatin' clams and mussels\nUhh, octopus, pretty face no waist\nI just want the bush, so I can mack it\nGive her a package to push, 'cause I work them hoes\nPendejos I show you how to play them hoes\nCan you just visualize it?\nBefore I go to sleep I check the beds and the closet\nSo I can sleep safe, not too many keep a mil' in the briefcase\nInfrareds help me sleep safe, but wait\n\n[Chorus: DMC]\nThat's not all, MC's have the gall (they pray, they pray)\nTo pray and pray for my downfall (they pray)\nPray and pray for my downfall (they pray)\nPray and pray for my downfall, fall\n\n[Interlude: Puff Daddy]\nSee, y'all motherfuckers live off of negativity\nWhat y'all niggas need to get through your motherfuckin' heads\nIs that, y'all fuckin' with some niggas that's on a higher\nMotherfuckin' level -- we don't give a fuck\nAbout what you think about us how you feel about us\nWhat you got to say about us\nWe gon keep doing our motherfuckin' thing\nFrom now 'til the year three thousand bitches!\nYou can't breathe, you can't sleep, you can't eat\nWithout thinkin' about us!\nAnd without thinkin' about us on your mind\nWe gon' haunt your asses MOTHERFUCKERS!\n\n[Chorus: DMC]\nThat's not all, MC's have the gall (they pray, they pray)\nTo pray and pray for my downfall (they pray)\nPray and pray for my downfall (they pray)\nPray and pray for my downfall, fall\n(They pray, they pray, they pray, they pray)\n(They pray, they pray)", "image": "https://images.genius.com/f4413efc6682e8c2cfa7a01117fc8cd5.1000x1000x1.jpg"}], "artist": "The Notorious B.I.G."}