{"songs": [{"title": "Back Back", "album": "Pimpin’ Incorporated", "year": null, "lyrics": "[12 seconds of background conversation to start]\n\n[Too $hort]\nWe got a new dance (ay let's see it)\nIt's called the Back Back (let's see it)\nLet's do it baby\n\nBack Back (back back) Back Back (back back)\nBack Back (back back) Back Back (back back)\n\nWhen I walked in the door first thing I saw\nWas you drinkin at the bar, doin it all\nDancin like I never seen it done before\nYou don't need a dance partner on the floor\nYou just bounce that ass like it's goin out of style\nLove the way the music sound, goin hella wild\nAnother time, another zone\nIt's like yo' ass got a mind of it's own\nIt keeps sayin I don't wanna be alone\nWe need to swap numbers, I'll call you later on\nAnd since I made your favorite song\nIt's alright tonight, don't do a player wrong\nYour booty goes on and on\nYou could stand still and it won't be long\nBefore it moves, I love the way your panties shake\nI heard your booty got banned in twenty states\n\n[Chorus: Bishop of Crunk] + (Too $hort)\nBACK BACK! (Girl you 'bout to hurt somebody)\nBACK BACK! (On the dance floor workin the party)\n(That Lil' Jon beat got her freakin again)\n(That's how her momma used to dance on that Seagram's gin)\nBACK BACK! (That booty cain't stop)\nBACK BACK! (Can you make it drop?)\n(They been shakin like that since the 80's)\n(Man they ain't never gon' stop, are you crazy?)\n\n[Too $hort]\nEven when you sit in a chair, you still keep bouncin\nPut it right here and I will be pouncin\nWatch how I slide on up\nI might need a saddle, to ride that butt\nGirl you think it's wide enough?\nCan I plug it in the wall, and light it up?\nDoes it come with an instruction manual?\nCan I twist yo' knobs while I touch yo' handles?\nCan I see you do it booty butt-naked?\nBack Back, girl you too wild you gon' break it\nDamn! I thought it was mine\nBut my dick belongs to you since you started to grind\nI see why they call it a crime\nA woman like you is hard to find\nThe way you twerk that junky, make it funky\nCain't take this from me girl shake that monkey!\n\n[Chorus] w/ minor variations\n\n[Too $hort]\nDamn baby, how you move like that?\nIs it the music or the way that I do my rap?\nI wanna sick my dog, on yo' cat\nCause I love the way you do the Back Back\nJust bounce that ass 'til you cain't no mo'\n'Til your cheeks start to sag and you can't go low\nWhen your arthritis kicks in at 44\nKeep shakin that ass like a ho\n20 years from now she'll still get down\nAnd booty shakin music'll still be around\nIt's a family tradition, cain't let it die\nYou saw that ass shake, that's how he met his wife\nI'm up all night, me and my whole crew\nDon't hate cause it's late when I roll through\nIn the middle of the night, tryin to get in your mind\nI'ma wiggle in tight and I'ma hit from behind\nSo Back Back! - Whoa, did you see that mayne?\nGirl stop playin don't change a thang\nWatchin you dance I almost came\nThe way you shakin that ass is insane\nI, cain't believe my eyes\nI can see from the rear what's between your thighs\nTook two steps back and realized\nYo' ass is a real prize\n\n[Bishop of Crunk]\nBack Back!\nLet me slap that ass, let me slap that ass\nBack Back! [?] yo' ass\nShorty move that shit, ass hit like this\nAss so quick make that booty wanna split", "image": "https://images.genius.com/b06c57cf2cfd6ca6f1870496190e3b04.700x700x1.jpg"}], "artist": "Too $hort"}