{"songs": [{"title": "Real 92.3 Freestyle", "album": null, "year": "2015-03-09", "lyrics": "[Verse 1]\nYou never knew a plug, plug, plug, a plug like this\nSophisticated gangsta, watch me thug like this\nSnatch your, uh, in a club like this\nSeven zeros, need my pub like this\nStuck in a rock in a hard place\nI am thinkin' I won't bump y'all up, well, I am\nI got to get my thing off\nMy style come from Devin the Dude, Kurupt, 2\nAnd James Brown with his fist crossed\nI fluctuate the vocals like Prince Rogers\nWhoever thought a billionaire come out of Compton?\nMultiply simple logic, it's rules you can follow\nIf Dre ain't motivation, I don't know who is\nGift and a curse, maybe them shoes is too big\nOr maybe I'm too pessimistic to know I'm gifted\nChasin' hood rat brownie points and bullshittin'\nI dropped the four on 'em, scrapin', hopped a four on 'em\nGrab my dick and pour on 'em\nYeah, homie, I'm still talkin' that whoop-de-whoop\nHoppin' out on my enemies, I know who to shoot\nBack when my homies where I need to be\nSuch a familiar sceneries, I smell the gun smoke\nI watched a homie watch his son smoke\nI seen the sun set on my set\nI seen one 'Ru and one Loc, one slip and one played him close\nEverythin' subject to change\nNowadays, the Compton Crip car kill each other\nFaster than an opposite color\nHomies whack out everythin', you're dead, homie\nIt's your mother, your uncle and brother\nIf God was a Loc, he'd probably had one comin'\nDamn, that's fucked up, I guess it is\nWhen you can't trust not a soul inside these streets\nI made a video out there in Copenhagen, so the homies can see\nTo let 'em know it's more than just Pamela Lee\nThey said, \"Good looking\"\nPaused the video the moment his phone ring\nThat fast dollar was his only problem\nNo matter how many times I showed him the Eiffel Tower\nThe block was home and Africa was too far for power\nThen I knew\n\n[Bridge]\nAnd you don't and you don't and you don't\nAnd you don't and you don't and you don't\nAnd you don't and you don't and you don't\nAnd you don't and you don't stop\n\n[Verse 2]\nThis feelin' is unmatched\nThis feelin' is brought to you by adrenaline and good rap\nBlack Pendleton ball cap\nWe don't share the same synonyms, fall back\nBeen in it before Internet had new hacks\nMy innocence limited, the experience lacked\nTen of us with no tentative tactic that cracked\nThe mind of a literate writer, but I did in fact\nYou admitted it once I submitted it wrapped in plastic\nRemember scribblin', scratchin' diligent sentences backwards\nVisitin' freestyle cyphers for your reaction\nNow I can visit a stadium, pack it the fastest\nGamblin' Benjamin benefits, sittin' in traffic\nSpinnin' women in cartwheels, linen fabric on fashion\nWinnin' in every decision\nKendrick is master and mastered it\nIsn't it lovely how menace has turned attraction?\nPivotin' rappers, finish your fraction, runnin' pure magic\nThank God for rap, I will say it got me a plaque\nBut what's better than that? I know everything\nI know everything, I know myself\nI know morality, spirituality, good and bad health\nI know fatality might haunt you\nI know everything, I know Compton\nI know street shit, I know shit that's conscious, I know everything\nI know lawyers, advertisement and sponsors\nI know wisdom, I know bad religion, I know good karma\nI know everything, I know history\nI know the universe works mentally\nI know the perks of bullshit, that isn't meant for me\nI know everything, I know cars, clothes, hoes and money\nI know loyalty, I know respect, I know those that's hungry\nI know everything, the highs to lows to groupies and junkies\nI know if I'm generous at heart, I don't need recognition\nThe way I'm rewarded, well, that's God's decision\nYou know, they know that from Compton School District\nI give it to the kids, don’t gossip ‘bout how it was distributed\nI, I, I know how people work, I know the price of life\nI know how much it’s worth, I know what I know and I know it well\nNot to ever forget until I realized I didn’t know shit\nBig Boy, what’s up?\n\n[Bridge]\n\n[Verse 3]\nI don’t give a butt  about no politics in rap\nMy little homie Stunna Deuce ain’t never comin' back\nSo I got to go hard every time I jump on wax\nBump what they talking ‘bout, this here is where it’s at\nLook, I came in this game, I stuck my fangs in this game\nI wore no chain in this game, my hood, my name in this game\nNow I double up, time to bubble up the bread and huddle up\nI’m stickin' to the scripts like, “Yeah, 'em Benjamins can cuddle up”\nI skip, hop, I drip-drop, I flip-flop with them white tube socks\nIt go sherm sticks, watch me burn this\nThat’s what the chronic smell like when them chemicals mix\nFifty-homie salute, I’m out to Compton Zoo with the extras\nEl Cos, Monte Carlos, Road Kings and dressers\nRip Ridaz, P-Funkers, Mexicans that eff with me\nNobody can eff with me, tell y'all to eff with me\nJumpin' out the Caddy, uh, just got my dick sucked\nThe little homies called\nThey said, \"The enemies done cliqued up\"\nOh yeah? Puto want to squabble with mi barrio?\nOh, yeah? Tell 'em they can run it for the cardio\nOh, yeah? Everythin' is everythin', it's scandalous\nSlow motion for the ambulance, the project filled with cameras\nThe LAPD gamblin', scramblin', football numbers slanderin'\nHomie’s name on paper, you snitched all summer\nThe streets don’t fail me now, they want to put the game in town\nFrom Compton to Congress, it’s set trippin’ all around\nAin’t nothin' new but a flow of new DemoCrips and ReBloodlicans\nRed state versus a blue state, which one you governin’?\nThey give us guns and drugs, call us thugs\nTell me they profit to fuck with you\nNobody can fuck with you, Obama said, \"What it do?\"\n\n[Bridge]\nCan I get one more?\n\n[Verse 4]\nEverybody want to talk about who this and who that\nWho the realest and who wack, who white or who black\nCritics want to mention that they miss when hip hop was rappin’\nMotherfuck if they did, then a nigga'd be platinum\nY’all priorities are fucked up, put energy in wrong shit\nHennessy and Crown Vic, my memory been gone since\nDon’t ask about no politician at award shows\nNo, don’t ask about my, hoes, no, don’t ask about my foes\n'Less you askin' me about power, yeah, I got a lot of it\nI’m the only nigga next to Snoop that can push the button\nHad the Coast on standby\n“K. Dot, what up? I heard they opened up Pandora’s box”\nI box ‘em all in, buyin' land stock", "image": "https://images.rapgenius.com/74ffc367398e15de9e0948d816c78725.1000x1000x1.jpg"}], "artist": "Kendrick Lamar"}