{"songs": [{"title": "Strangeulation III", "album": "Strangeulation", "year": "2014-05-06", "lyrics": "[Verse 1: Wrekonize]\nWrapped in XLR cables\nUp from my whiskers, down to my fuckin' kicks\nWreck-O was echoed in Gordon Geckos, you suckin' dick\nNobody be askin' me for secrets, I ain't chuckin' tips\nI'd rather be bumpin' hips on that ratchet with muffin tits\nTore up the limits from Britain visions would rock their lives\nInside a prison where giddy bitches don't jock the rhyme\nBorn in precision and rhythm spittin' could swat a fly\nFor them to just kick a single shillings from Spotify\nBye, Bye killers, on a high five business\nGonna ride by the sickest in your high ride to the hitlist\nIf we ain't spoke in ages then miss me with broken favors\nYou Miley Cyrus to majors, you twerkin' on swollen razors (run now)\nDon't make me come to dinner, nail your tongue down\nAnd have you plead your case to us in Strangeland at sundown\nBe careful of the biz cause everything has got a price attached\nWake up with a horse head in your bed and next your life is snatched\n\n[Verse 2: Bernz]\nTank full of petro, bank full of pesos\nPool on my tour bus, bonus on a payroll\nFeel like I be killin' it, famous on the internet\nReally I'm just wingin' it, cookin' shit on my kitchenette\nLife so good right now, I need to celebrate!\nBout to sell a stadium out and turn it into rave!\nLook at how the industry norm has started lookin' Strange\nAll my brothers riding the storm while they just ride the wave\nCaviar wishes, bitches for my bitches\nBlack shades and hoodies and spots and white linens\nFeel like Sam Kinison, preachin' to the citizens\nScreamin' at the saints, \"You ain't ever gonna get rid of us!\"\nGuessin' I just cleaned my plate so now I'm gettin' cake\nSpeedin' down the interstate, yellin' \"Get out the fuckin' way\"\nWe plant flags in the ground because we here to stand\nI bring my whole hood out and have my own parade\n\n[Verse 3: Kutt Calhoun]\n(Black Gold!)\nI purposely wrote this verse just to murder, dismember, defecate\nDisassemble the limbs of a nigga who try and separate\nArtistry from nonfiction, I'm sent with a conviction\nTo sentence you pawns givin' opinions on my addiction\n\"There he goes, speakin' bout how he merk a beat\"\n\"Smellin' himself, why else would he flaunt about it so verbally?\"\nDance around me like I was a paraplegic\nIn a do-si-do competition, lookin' pissed like I never heard of feet\n\"Yadda, yadda\", a whole lotta yappin' about my rappin'\nWhen I'm the captain of crunchin' you niggas' milky dreams\nI'm the comparison of Pac face staring in your face\nMock razor blades, Kutt leave you crispy clean\nDon't ask Tech, ask me if it's questions\nGuarantee that he tell you that I'm the best and I'm destined\nTo find a snake and a bat, helpin' Kansas City's progression\nHopin' I hurt the feelings of whoever second guessed it cause\nEverybody talkin', I'mma make you niggas hear me\nMind control flow, now, listen till your ears bleed\n\n[Verse 4: Ubiquitous]\nSpit it sicker than these sycophants, keep your dick up in your pants\nYou were blunted on the block, me, I had some different plans\nI'm trying to get to France, sniffing grams, hit a branch\nIndependent Powerhouse, vibin' out, wit' the fam\nWaking up in different cities every night, hittin' grants\nStay prepared for this, I'm bearing witness to the sin of man\nStripper dance with cinnamon, clubbin' with my gentlemen\nDrink away the night's events, nothing worth remembering\nSquad'll run up in this bitch, mobbin' like some immigrants\nJack you for your paper stack, rob you of your innocence\nTaping off the scene of crimes, swabbing for my fingerprints\nThought about my life, you thought the same and couldn't think of shit\nHa! This type of fire don't extinguish\nNow write about some bigger shit, you striking out, swing and miss\nRing around the Rosie, homie, pocket full of pain\nKeep a lock up on my lane and triple optic in my brain, look\n\nRinging\nUbiquitous: “Yeah, what up?\"\nN9ne: \"Ubi?\"\nUbiquitous: \"What’s going on man?\"\nN9ne: \"Hold on… Travis is calling me, hold up.\"\nN9ne: \"What up, Trav?\"\nTravis: \"What up man, I’m outside right now.\"\nN9ne: \"Alright, here I come.\"\nTravis: \"Alright.\"\nN9ne: \"Peace. Ubi! You got the bitches number from… So and so?\"\nUbi: \"From what? What, which bitch?\"\nN9ne: \"That redheaded bitch from… dadadadada.\"\nUbi: \"Oh, yeah yeah yeah. Want me to text it to you?\"\nN9ne: \"Yeah text it to me right now. Love.\"\nUbi: \"Aight peace.”", "image": "https://images.genius.com/a97c6b9421fc6142eef43b7f37277096.500x501x1.jpg"}], "artist": "Tech N9ne"}