{"songs": [{"title": "Broke Bitch", "album": "Get Off the Stage", "year": null, "lyrics": "[Too $hort]\nWhassup baby?\nDamn like that? Can't even speak?\nI ain't tryin to fuck, just tryin to holla, say whassup\nLet me ask you somethin baby\nIs that a wig or a weave?\n\nWhat you see is what you get\nIf you don't like it, fuck you bitch\nYou look good, you hot as shit\nBut you broke as hell and ain't got no whip\nI ain't yo' type, I don't care\nGet a light-skinned nigga with long hair\nI spoke, you act like you mad at a dude\nI don't give a fuck 'bout your bad attitude\nIt's in me - I'm laced with game\nYou get a signed autograph with a face to blame\nTear it up later when you hate my guts\nRight now, I wanna make you taste my nuts\nYou hella fine, but I don't wanna keep in touch\nAll I wanted was to sleep with a slut\nI wanna fuck you bitch cause you got the look\nA top notch, but you ain't too hot to be shook\n\n[Hook]\nBROKE BITCH~! You can't fuck with me\nYou can't afford me\nBROKE BITCH~! You can't even afford a happy meal from McDonald's\nBROKE BITCH~! Five dollars worth of gas\nWhere you goin, 'cross the street?\nBROKE BITCH~!\nYou just wanna marry a million dollar ballplayer\nBROKE BITCH~!\n\n[Too $hort]\nYou wanna get you a nigga in the NFL\nA basketball player, tall as hell\nYou might get lucky, marry the champ\nBut when you walk by they say there's a tramp\nYour stock is low, you don't know what happened\nYo' baby daddy is low budget rappin\nYou wanna do it big, spoil the kid\nBut you're still at the club out hoein an' shit\nYou tryin to hit a lick - no doubt\nYou want diamonds, all you get is dick in your mouth\nBitch, you need to stop and think\nYou act like a dick is a slot machine\nAre you serious? You can't be thinkin clear\nIt's quicksand bitch you'll sink in here\nYou wanna be rich better stop that shit\nYou never hit the jackpot\n\n[Hook]\nBROKE BITCH~! Yeah we tryin to get top notchers\nNobody want your busted ass\nBROKE BITCH~! Quit buyin all them knockoff purses and clothes bitch\nBROKE BITCH~! Always starin at the ground\nYou need to hold your head up\nBROKE BITCH~! If you had some money you wouldn't be wearin them\nRaggedy-ass shoes\nBROKE BITCH~!\n\n[Too $hort]\nThere's too many women can't stop a player\nI see one I like, I'ma stop and stare\nI don't need plans, I'ma take the chance\nI don't even have to ask the bitch to dance\nI'm a natural, I don't need luck to win\nI'm the kind of nigga that'll fuck your friend\nAnd you won't know nothin, every time I see her\nOn the low we fuckin, I know them buttons\nAnd I hit 'em, most of the time I get 'em\nI got a million lines and I spit 'em\nWhen I wanna fuck, who do I like to call\nI throw a little party and invite 'em all\nThey never argue and fight with a brother\nAnd I like when they like each other\nI told Polow I'm never gettin married\nI don't give a fuck if you was fuckin Sherri!", "image": "https://images.genius.com/bf235bef3026a6f3ce0ab508ff5f91d3.500x500x1.jpg"}], "artist": "Too $hort"}