{"songs": [{"title": "De Automatic", "album": "KRS-One", "year": "1995-11-07", "lyrics": "[Intro]\nSome fear de 'matic\nAh hah hah, heh heh heh, EHHH\nCheck it out\n\n[Chorus]\nSome fear de 'matic, yes de automatic\nDisrespect, from MC's, me nah go have it\nDe automatic, get de automatic\nTonight a rapper gwan die\n\n[Verse 1]\nCrazy MC's waste they time chasin millions\nWhile KRS-One, holds the minds of the children\nI'm buildin a followin of a hundred and forty-four thousand\nChosen few heads up in project housin\nA true rapper, street rapper, rappin to the center\nI enter any cipher, with tales of adventure\nIf rappers are ridin beats like cars, I'm bendin mad fenders\nPut down your mic and surrender\nYou's a pretender, Blastmaster KRS rules the pavement\nKickin Edutainment while you wait for your arraignment\nSave it friend before your chest I cave it in\nI got my way again, I'm classical like a fuckin Harley Davidson\nHow do you think I kick a lyrical style no end, you figure?\nIt's simple, I'm a rap God, and youse a nigga\nDon't mean I'm bigger, it simply means I'm smarter\nFor starters, I come at you poetically harder\n\n[Chorus]\n\n[Verse 2]\nHa hah, fake ass rapper, how you think you got juice?\nWhen you rock a pair of panties underneath your bubblegoose\n(Word) KRS-One will fuck up parties dramatically\nMy reflex'll slap a wack rapper automatically\nWhen you was home witcha mother, afraid of the dark\nI was sleepin out in Prospect Park\nEatin one meal every 48 hours\nWritin dope rhyme styles that you now devour\nDon't you realize, that I'm all about survival\nI got only friends cause I KILLED all my rivals\nShow up at the rhyme recitals, took they titles\nFrom eighty-six to ninety-six completes my first cycle\n\n[Chorus]\n\n[Verse 3]\nI spent 40 days, and 40 nights in the wilderness\nI'm hard, from head to toe yo there ain't no killin this\nI wrote over 100 rap hooks\nAnd sociological books, while you worried about your looks\nNow you wanna enter the dragon in sound\nBut I've got the live club show locked down\nPlatinum and gold don't hold in my arena\nYou gots to keep it real on the mic, when they see ya\nI manifest, in the West the East and overseas\nDivision in rap is wack, and I don't know of these\nI represent New York to be specific\nThe South Bronx, but in Japan I'm still gifted\nI grab a jet and land on your set, what the fuck?\nTwenty bucks for a rap show is still, twenty bucks\nI start from eighty-six, and bring you into ninety-six\nNo gimmicks, tricks or lip-sync lyrics\n\n[Chorus]\n\n[Outro: Fat Joe]\nYeah yeah it's the God Fat Joe\nRepresentin the motherfuckin South Bronx\nWith my nigga Kris, knockin off frauds\nMotherfuckers wanna do what?\nBig shout out to my nigga Kenny Parker\nIll Will, BDP crew for life nigga\nNaughty Gotto, the Big French productions\nOf course the TAT crew, my nigga Brim\nThe T.S. crew, and the whole Godsville\nSouth Bronx represent nigga, uhh\n\nThe South Bronx, the South South Bronx\nSouth Bronx, the South South Bronx\nYeah! Uhh!", "image": "https://images.genius.com/78316fa7efcf948425107910e5b3a92b.300x300x1.jpg"}], "artist": "KRS-One"}