{"songs": [{"title": "Yo Body", "album": "Category F5", "year": null, "lyrics": "[Intro: Johnny P]\nNow when I touch on yo body babe\nAnd when I grab on yo body babe\nWhen I feel on yo body babe\nI say ooh, oooh, oooh (Hell yeah)\n\n[Verse 1]\nCan I re-introduce myself\nFor the city of the Chi, West side ain't it mayne?\nPut some flame to the maryjane\nDown with the same thang\nWith main in the left lane, peep game\nPut the duck in the ash tray, got on the freeway\nSprayed a lil cologne on the car seats\nThen I gotta up wit big d and six freaks\nThey was thick as hell, you understand me?\nI was sipping on Patron about to fade out\nGot up wit lil ma, had the whole lick layed out\nPut the gucci on the doorseat\nCountin some mo gee's, the dice game damn near broke me\nSo I'm callin fo mo gees's and putting a pound of weed and four b's\nMy thumper and my door keys\nWalked up like she know me I gotta keep it moving\nCause she prolly be the police\nSo i, got turned tough told her to meet me in the range rove\nWe ain't gettin money so I gotta go and change clothes\nBumped out wit the same hoes tonight we in the hotel\nCause I got it in the mainfloor\nAll them looking good, but I wanna hit the main fo\nWhat you think I'm spittin game for?\nCause I talk alotta spots andale, andale, andale, cha cha\n\n[Hook: Johnny P]\nI gotta beg for yo body\nGurl I need yo body\nI see you wit my body\nEvery time I see yo body\nI say ooh ooh\nIf you was a car, girl you'd be a phantom\nYo ass and yo titties\nAin't no tellin if I had them what I'd do\nWhat i'd do, what id do\n\n[Verse 2]\nI was chose in this game\nTo be a cold mothafucka with the fe's and the lad's\nNow let the roof all down\nWhile I'm gettin good ol' head smoking trees in the back\nYou see the mix with the jewels and the stacks\nDont try to pull it, I got goons wit the gats\nMy money long like a python\nMakes yo bitch say fuck it, Imma roll wit the mack\nB-low gettin all that dough, B-low gon pimp them hoes\nB-low gettin all that show, and my meat gon touch the floor\nMothafucka, get on ?SPIt ROW?\nLike I said you already know: P-O P-I-M-P\n\n[Hook]\n\n[Verse 3: Twista]\nGurl, you got a banging body like a Bugatti\nShe got work like a cooking pot (oh!)\nShe got legs like a potential hit (yes!)\nAnd a frame like a working car\nBut who the one the women looking spectacular fo'?\nWho the one that got the bump in the back of the truck?\nWho the one that saw the body wit the booty of a Maserati\nWhile I'm in the party way back in the club\nYou be kinda reminding me of my gee princess\nSo I gotta say majesty when I say that\nAnd when I see the way the fatty looking from way back\nYou be kinda reminding me of a Maybach\nYou be the type I know I mite kiss\nAnd if I flow it right I know I'm so righteous\nAnd if you wanna try and get as lyrical like the twist;\nYou gotta flow li-li-li-li like this\nSo now ima go to the back\nGet a cup fill it up wit the drank when I mack on a ho\nTriple it up cause wen I get out I wanna cut\nCause I'm twist and Imma kick that spectacular flow\nNow I spit you with the kind of glory\nKnow its kinda gory when I come out of the laboratory, lets ride\nAin't no fucking wit the Twista, J.P, Do or Die\nYou are now wit the Category F5\n\n[Hook]\n\n[Outro]\nNow when I touch on yo body babe\nAnd when I grab on yo body babe\nI say, oooh, oooh (Hell yeah)", "image": "https://images.genius.com/ab06dbf0ce99f56ef5472a2ab819fd5f.675x675x1.png"}], "artist": "Twista"}