{"songs": [{"title": "Billy", "album": "The Sting: Bobby Digital Bonus Disc", "year": null, "lyrics": "[Intro: RZA]\nEh-yo, man, fuckin'..\nMothafuckin' Billy, man\nYeah, man\nThat mothafucka, man, just called me and shit\nFrom fuckin', uh, some county jail, man\nDown South or some shit\nHe's mothafuckin' crazy\nI thought that nigga was comin' here next week too and shit\nBut I guess he went down South with them fuckin' white boys and shit\nYou know he love hangin' with them white boys and shit\n\n[RZA]\nYo, yo, yo, Billy\nHe sniffed dope and swallow acid, took gulps of colt classics\nSmoked hashes, tote plastic Glocks and low jackets\nCross country, cousin Billy with forty monkeys\nTwenty white honkys, Harley Davidson bike junkies\nIn a convoy escapin' from Rosco P. Co\nAnd those four redneck cops who had Rodney in a sleephold\nThe SWAT team, U.S. army shock team\nThe snipers who shot King, infrared dot beams\nAimed at windshields, gas tanks and wheels\nFrom the bank they yanked the mil, hot lead and stainless steel\nShot through the helmets, cracked heads like Hellmanns jars\nRipped through the roofs and blew the hood off the car\nA.T.F., F.B.I., D.E.A., chopper in the sky\nEye witness news on standby\nBill Beutel, it was Mit from the metly\nMint leaf tea dipped in P.C.P., hit to the head like a D.D.T\nHard on the gut like Mc D.L.T\nC-cipher punks put the A.P.B\nOn these destroyers who was drunk off the J&B\nRan up in A&P, hit the safe at P&C\nDocumentary on A&E, eight P.M. E.S.T\nFive P.T., the ho tapin' on V.C.R\nThree victims shot, one was saved by C.P.R\nFuckin' Billy be wildin'\nLike Robert L. Lee or Stonewall Jackson\nHe always out for action\nI was at an eighteen hole golf course relaxin'\nWhen I received the collect call, BOODOODOODOO\nCollect call from cousin Billy\n\n[Phone Skit: RZA (\"Billy\")]\n(Eh-yo, Bobby, I'm in trouble)\nYo, what's goin' on, cousin?\nWhat the fuck, man?\n(Listen, yo I need fifty thousand)\nOh sh--, eh-yo, Kinetic\nCheck it out, nigga said he need fifty fuckin' g's Son\n(Listen, yo, we got into a fight\nIn the bar, shit was just crazy)\nEh-yo, I heard you was fuckin' with the white boy Tommy again\nTakin' that acid, nigga\n(Yeah, oh yeah, we chillin' though\nI just need you to come get me, for real)\nNo problem, son\nYo, I'll send my nigga Kinetic down to get you and shit (Aight)\nAight, there it is", "image": "https://images.genius.com/298d5b6c65bf8acac98842b49097e653.300x300x1.jpg"}], "artist": "RZA"}