{"songs": [{"title": "My Name Bam-B", "album": "Poindexter", "year": "2009-09-17", "lyrics": "[Verse 1: Childish Gambino]\nPeople say I'm crazy, I'm loony, I'm psycho\nI like it\nI got my shit checked like Nike\nDoctor said he'd never seen anything like me\nChances of recovery are nil to not likely\nBoy so crazy make your baby mama look sane\nKicking thoughts around like he got a loose brain\nI got a whiskey sour, sober\nUntil I fall down like it's mid-October\nYoung young Hova\nBoy I say, for goodness sake\nI'm in my prime like I'm standing on my dinner plate\nYou niggas innerspace cause you come up Martin Short\nI'm so fly I don't need a right wing from Drudge Report\n\n[Hook x2: Childish Gambino]\nAh! Stay wildin' like me!\nMy name Bam-B!\n\n[Verse 2: G.E.T.H.]\nPeople say I'm angry\nBut if you're happy, you're crazy\nI'm violent, so I've got a blue belt from Renzo Gracie\nRead the news today, oh boy, some kids are dead\nPulled the covers over my head and went straight back to bed\nCause even my good days are generally bad\nAt my happiest, I'm just slightly less sad\nAnd I get mad if you're glad to be alive\nCause I had a chance at a happy life\nGood mom, good dad\nSeriously trust me, you wouldn't wanna be me\nThe best days of my life involve leftovers and TV\nI got almost no friends and I don't know how to handle this\nEven the friends I do got are all moving to Los Angeles\nEven I'm tired of my whining\nEven I don't want no more of me\nI whine more than a 3-year old multiplied by Morrisey\nEvery time I meet someone who wants to be my friend\nThe first thought that I have is, \"Yo what the fuck is wrong with them?\"\nI go through life with my fists up\nBut trust me my fists are all\nFull of handfuls of Wellbutrin and Risperdal\nI'm depressed y'all\nSomeone please help me (Please help me)\nSeriously (Seriously right now)\nHelp\n\n[Hook x2]\n\n[Verse 3: Childish Gambino]\nI'm good with the N\nNo not the Nina\nMean I'm good with the hammer so I'll fix your broke heater\nAnd not your bro Keeter\nI don't tote guns\nI never had white so I never needed one\nAnd the hood respect me, I rose from the ashes\nThey call me the phoenix in the clear rim glasses\nThey saw me work with all that work\nNow I got my own enterprise, call me Kirk\nAnd I'm born on an air force base, so I'm fly\nMove out to Decatur, that's Atlanta's Bed-Stuy\nI got that pink like pussy\nGot that pussy day and night so they call me Kid Cudi\nBitch!\n\n[Hook x2]", "image": "https://images.genius.com/78bea76bf210cec3130c214f2a4ab5f7.800x800x1.jpg"}], "artist": "Childish Gambino"}