{"songs": [{"title": "This Is Us", "album": "G.O.A.T. (Greatest of All Time)", "year": "2000-09-12", "lyrics": "[Intro: LL Cool J]\nI'ma give all y'all somethin', word up\nWord up, all my live cats out there gonna love me for this one\nUh-huh.. they gon' be like\n\"Yo you, you need to listen to that joint L made\"\nHeh-heh.. word up\nThat's the joint you gotta listen to, y'knahmean?\nCheck this out y'all\n\n[Verse 1: LL Cool J]\nI got the key that fits the lock of a real dog's mind B\nThe answer to the question chicks ask most the time see\nWhy my man cheat and give some bitch my heat?\nSlap me one day then Sunday he's so sweet?\nTo me and mine, this nigga's hard to define\n'Cause he beefin' when he broke but he arrogant when he shine\nIt fucks you up, you wonder if you wastin' time\nMention marriage, he lit a Dutch and peeped out the blinds\nWhat different niggas feels in they hearts is scary\nI used to say shit like\n\"C'mon baby, you should be honored to share me\"\nShe used to throw the cakes up, plus the burger was hairy\nI used to have to think of shit to keep 'em comin', you niggas feel me?\nBaby or no baby, I wasn't loyal or nothin'\nJust me and my niggas on tour, frontin' and hittin' somethin'\nRed lipstick prints all over my drawers\nOh you wanna be an actress huh?  Well my movie's hardcore\nLike Dungeons & Dragons; gettin' brains in a Benz wagon\nStep out, jeans saggin', crew laughin'\nGettin' blazed by the fiend for ten bones a piece\nNothin' but the dog in me needin' to be released\nThis is us\n\n[Chorus: Carl Thomas]\nYou know that I do, the best that I can\nBut you don't seem to love me no more, no more\nI try to please you, and be your man\nBut you don't seem to love me no more, no more\n\n[Verse 2: LL Cool J]\nThe flipside of the coin, what team you wanna join?\nYou in The Tunnel every Sunday exposin' your tenderloins\nIn every rap cat's face, with some ol' flirty shit to say\nNeed to go home, wash your kids up, and put your tits away\nMe and my clique in motion, champagne and Alize\nGot your mind bubblin crazy, wanna flip Cool J\nSpend your last on your hairdo, but you ain't save a dime\nTo put your child through college baby, now have you?\nGo get a job interview, your bad-ass kids a curfew\nAnd skip that \"Bills Bills\" shit broads is goin' through\nI know this prostitute who said that life ain't cute\nChild born with a destiny only God can dispute\nPlayers giggle and laugh, flashin' gats and cash\nMy dogs don't care about you Boo, they like your ass\nTold me if I call and your man answer, ask for L\nSo he can say, \"No L live here,\" our code is ill\nTell him you about to catch a flick with Sherell\nPlottin' and schemin' in the shower, masturbatin' on the cell\nThe neighborhood hustler, that cat we all know\nThat nigga we grew up with, son from next do'\nMy dream was to flow and escape the hell below\nBut the demons in my life set fire to my dough\nI thought about murder, I vowed my revenge\nLike the devil's pumpin' hate through my heart with a syringe\nThis is us\n\n[Chorus: Carl Thomas]\nYou know that I do, the best that I can\nBut you don't seem to love me no more, no more\nI try to please you, and be your man\nBut you don't seem to love me no more, no more\n\n[Verse 3: LL Cool J]\nThey say a man gon' be a man, but that's only half the scenario\nYou nag a cat, you givin' him a license to fuck a hoe\nWhen a man come home late, he want his girl to say hello\nNot hear all that bullshit, bout, \"Nigga where you go?\"\nFried chicken ready, t-shirt and panties at the stove\nMessages written down, blunt rolled ready to go\nGive me a hug, not too long, give me space\nWhen a cat got issues don't need you all up in his face\nRub your breasts, kick back, smile a little\nIf it's rainin' outside, chill, listen to the drizzle\nNow kiss my chest, call me Superman\nPull down my boxers by the Calvin Klein band\n[?] wash it, enjoy the flavor, I return the favor\nThis behavior, should save ya\nFrom me all night freakin', with a nineteen-year-old\nHalf naked Puerto Rican, creamy ass leakin\nEvery man will agree, when she nag it's killin' me\nI don't always wanna talk about how the world is shittin' on me\nI sip some Alize and meditate the pain away\nAnd get in my own zone where I wanna be alone for solo\nReminisce with photos\nAnd missed opportunities to make some dough flow, you know?\nChill, relax baby, support me from the background\nBelieve in my dreams, instead, you and your girls sat 'round\nComplain about, who's tradin' ass for cash\nIf there ain't no trust then just us can't last\nThis is us, I know you feelin' that\nThink about that shit, word up\n\n[Chorus: Carl Thomas]\nYour man, your man, your man\nEverything we've been through yeah\nAll the places we've been yeah\nJust don't know if I'll be the same again, ha\nEver since you walked all all over me, ha\nAnd even if we bring this back together, ha\nYou know it won't be the same, no no no no\nNo no no no no, ha\nOh I, I, baby I, tried to be your man\nWoah, oh, yeah\nHooo hooo hooo\nCan't you hear me?  Can't you hear me?\nWoah", "image": "https://images.genius.com/7d9009021acaa20a396f75cbd74c2360.1000x1000x1.jpg"}], "artist": "LL Cool J"}