{"songs": [{"title": "Fast Money", "album": "Fahrenheit 1/15 Part II: Revenge of the Nerds", "year": "2006-01-01", "lyrics": "Hey now\nWhat down yo?\nWhat down what down\nHey now\nI’m saying what’s the deal on that though\nHey now\nI’m saying wh-what\nHey now\nI’m saying man you want me to lay down or what man\nHey now\n(Muffled)\nHey now\nHey listen c’mon man\nHey now\n\n[Verse 1: Lupe Fiasco]\nUh\nSneakers beep a heater underneath the seam\nOn the jeans every time I hit the scene\nLike Mira\nLook at me crook I be\nLike ya neck when you slept wrong the American dream\nDon’t step on the block that I run\nBlock that I brung the first beamer that they’d ever seen on these\nWit with the rocks I sling like David\nFee Fi Fo Fum\nBy nature I’m a hustla\nMove pack like I move and I’m packing\nY’all niggas move back on the come up like elevator action\nWelcome to the action-packed world of trapping\nWhere we tip into Chi-Town if you cook a key you will see\nIf you chop the nickels that you can get a drop and a box of pistols\nHave to get it cooked so you can not get little\nFast (echo)\nMoney (echo)\n‘cause all my habits important\nI kept the illest hoopers in high school and Jordans\nKept the illest rappers in the hood recording\nSee I keep it real no I no bluffin’\nI got money but I no puff them\nI re-up remove weight like liposuction\nNow follow a playa as I go hustling\nFor that fast\n\n[Hook: Guitar Wayne]\nFast money baby\nMoney (echo)\nFast as it comes or faster\nWhen the closet close\nThen you’re on your own check\nCan you dig it baby?\nWoooohooo!\n\n[Verse 2: Lupe Fiasco]\nUh\nNow let’s see what happens when a little mackin and a little Cadillacin’ get it crackalackin on the scene like shush\nRings gators on seen the suits when I sneak\nMan I pack shit for a king\nSuch as I\nUh, uh you try\nSee haters try to touch they uh, uh deny\nThis is not for the weak of heart like John Q\nYou’re just a John to that blonde who wants you\nI’m cut from a finer cloth\nSee it’s pimpin’ in my blood\nKnow how much that vagina costs\nIf a playa suspect the game gon’ reject him\nWelcome to the world’s oldest profession\nWe running game in the Chi-Town\nMost niggas lame cuz they can’t accept it\nThey can never understand so they can’t respect it\nThey can never feel my pain cuz they can’t connect with it\nFast (echo)\nMoney (echo)\nPimps up hoes down\nWhy you trying to get that ho to swallow\nIf you get a brain then the hoes will follow\nUh, I keep it real see I know pimpin’\nI tell them what they want cuz I know women\nThey better have my cash or I go tripping\nNow follow a playa as I go hustling\nFor that fast\n\n[Hook]", "image": "https://images.genius.com/dbe43b56e43c0bf22c2ad2f2bce13dd0.500x500x1.jpg"}], "artist": "Lupe Fiasco"}