{"songs": [{"title": "In the Morning", "album": "Friday Night Lights", "year": "2010-11-12", "lyrics": "[Verse 1: J. Cole]\nBaby, you summertime fine\nI let you get on top, I be the underline, I'm\nTryna get beside you like the number nine, dime\nYou fine as hell\nI guess I met you for a reason, only time can tell\nBut well, I'm wonderin' what type of shit you wantin'\nDo you like the finer things or you a simple woman?\nWould you drink with a nigga? Do you smoke weed?\nDon't be ashamed, it ain't no thing, I used to blow trees\nGettin' lifted, I quit but shit, I might get high with you\nIt's only fittin' 'cause I'm lookin' super fly with you\nA flower, you are powerful, you do somethin' to me\n'Cause girl, I caught the vibe like you threw somethin' to me\nSo I threw 'em back, now all my niggas hollerin', “Who was that?”\n“Oh boy, she bad nigga, what you 'bout to do with that?”\nI'm finna take you home, just sip a little Patron\nNow we zonin', baby you so fine\n\n[Chorus: J. Cole]\nAnd can I hit it in the mornin'?\nCan I hit it in the mornin'?\nAnd can I hit it in the mornin'?\nThe Sun risin' while you moanin'\nAnd can I hit it in the mornin'?\nCan I hit it in the mornin'?\nAnd can I hit it in the mornin'?\nThe Sun risin' while you moanin'\n\n[Verse 2: Drake]\nUh, baby, you wintertime cold\nThe night is still young, drink that dinner wine slow\nI'm tryna make the goosebumps on your inner thigh show\nI'll let you beat me there as far as finish lines go\nYeah, and if you gotta leave for work\nI'll be right here in the same bed that you left me in\nI love thick women 'cause my aunt she rode equestrian\nI used to go to the stables and get them kids to bet me\nAnd I would always ride the stallions whenever she let me\nI'm jokin', I mean that thing is pokin'\nI mean you kinda like that girl that's in the US Open\nI mean I got this hidden agenda that you provokin'\nI got bath water that you can soak in, things I could do with lotion\nDon't need a towel, we could dry off in the covers\nAnd when you think you like it, I promise you gonna love it\nYeah, when lights comin' through the drapes and we both yawnin'\nI roll over and ask if I can hit it in the mornin'\n\n[Chorus: Drake]\nYeah, can I hit it in the mornin'?\nYeah, can I hit it in the mornin'?\nYeah, the Sun risin' while you moanin', baby\nCan I hit it in the mornin', uh?\nCan I hit it in the mornin', yeah?\nCan I hit it in the mornin'?\nThe Sun risin' while you moanin'\n\n[Verse 3: J. Cole]\nHey, God bless the child that can hold his own\nGod bless the woman that can hold Patron\nGod bless her homegirl that drove us home\nNo strings attached like a cordless phone\nYou see my intentions with you was clear\nI'm learnin' not to judge a woman by the shit that she wear\nTherefore you shouldn't judge a nigga off the shit that you hear\nGet all defensive, apprehensive, all because my career\nTo be fair, I know we barely know each other and yeah\nSomehow I wound up in your bed so where we headed from here?\nJust say you're scared if you're scared\nBut if you through frontin', we can do somethin'\nAnd you know just what I'm talkin' about\nTomorrow you'll be callin' out\n'Cause tonight we gettin' right into the wee morn'\nCook a nigga breakfast after sex is like a reward\nThen I go my own way, you think about me all day\nThat's just a warnin'\n\n[Chorus: J. Cole]\nAnd can I hit it in the mornin'?\nCan I hit it in the mornin'?\nCan I hit it in the mornin'?\nThe Sun risin' while you moanin'\nCan I hit it in the mornin'?\nCan I hit it in the mornin'?\nAnd can I hit it in the mornin'?\nThe Sun risin' while you moanin', yeah", "image": "https://images.genius.com/ae722fa8fa10d75fe4b25dfeb4b8d8d6.1000x1000x1.jpg"}], "artist": "J. Cole"}