{"songs": [{"title": "Don’t Hate the Player", "album": "You Nasty", "year": null, "lyrics": "[Too $hort]\nDon't hate the player nigga, hate the game (3X)\nBut what if you ain't no player?\n\nEverybody talkin bout they gettin hated\nAll these lies is bout who they been datin\nIf you never was a player, I cain't hate you\nYou know life is one time, you cain't take two\nYou seem to think cause you ain't fuckin mo'\nThat some other nigga's all up in yo' ho\nIt ain't yo' fault, did you do that?\nYou think yo' ex-bitch, gon' ever take you back?\nHell naw, you still thinkin you a player\nYou only got one girl;\nYou just a square from nowhere\nYou starin at the ground, fuck the ceiling\nLove is the word that describes yo' feelings\nYou're hooked, you can't leave her alone\nYou're like O.J., wait til he brings her home\nYou wanna kill her, but you don't wanna play the fool\nYou never was a player, we cain't hate you\n\nDon't hate the player nigga, hate the game (3X)\nBut what if you ain't no player?\n\nWhat you mad at?  Your bitch let me have that\nAnd I ain't even say shit about your fat ass\nShe chose me, don't get an attitude\nIt really ain't got nuttin to do witchu\nI'ma fuck her - anytime I wanna\nLike a dog, I'mma climb up on her\nShe don't sweat me bout my other broad\nBut you called her on the phone and said I'm just a fraud\nI beat up hoes and I'm a rapist\nThen you told all your homies how I hated\nDamn nigga!  I don't even know you\nI seen you actin like a groupie at a show or two\nI know she knows, the way you lied\nLast time I hated it was 1985\nI was young, caught up with a bad bitch\nI took my time, learned the game, I had to have the shit\n\nDon't hate the player nigga, hate the game (3X)\nBut what if you ain't no player?\n\nShe said you had a little dick, and can't fuck\nOther niggas fuck her good, but you ain't up\nCan't do that stuff with a freak, can't never be weak\nCause a nigga like me'll put a dick in her cheek\nAnd to the beat, I start humpin on her face\nGrab her by the ears and then give her a taste\nYeah nigga, I fucked her and she's mine now\nYou know I been a dog for a long time now\nBut I ain't gon' fight you for this pretty ho\nYou think somebody player hated, you don't get it though\nJust can't figure it out, and you never will\nYour bitch went out and found her a better deal\nSaid it was cool, kickin it witchu\nBut she has more fun when she's lickin on dude\nI hate to be rude, but you know the rules\nLife is the game nigga - you lose\n\nDon't hate the player nigga, hate the game (3X)\nBut what if you ain't no player?", "image": "https://images.genius.com/96065abbdb6b1c6563ccc77d191b621b.300x300x1.jpg"}], "artist": "Too $hort"}