{"songs": [{"title": "Gettin’ It In", "album": "Kiss of Death", "year": "2004-06-22", "lyrics": "[Jadakiss:] Ah-ha!\n\n[Hook: Kanye West]\nShorty gettin it in with me (uh-huh)\nShorty gettin it in with me (yeah)\nShe said I brought some friends with me, but I don't know why\nBecause they ain't gettin in with me (uh-uh)\nShorty gettin it in with me (yeah, yeah)\nShorty gettin it in with me (uh-huh)\nShe said I brought some friends with me, but I don't know why (yeah)\nBecause they ain't gettin in with me (yo)\n\n[Verse 1: Jadakiss]\nYou know me, I'm with a ghetto diva, stiletto fever\nJell-o shots, yellow reefer\nSame rules apply, I'm back on top\nYou can't drink or smoke if you not gon' pop\nSee me in the popcorn drop, not gon' stop\nTakin shots of Catron, gettin top on yachts\nThe medallion's a mountain, rock on rocks\nThe whole world wanna know when this lock gon' drop\nWithout a doubt, she acknowledge the wealth\nSince she ain't give brains, I told her let me get some knowledge of self\nThen I told her be proud of yourself and dig deep\nAnd try to see what you could get out of yourself\nAfter all that, I told her to fall back\nThe Ferrari truck parked in the back is all black\nNext time, bring some friends and more 'gnac\nIt depends how I feel in the morn' if I call back, what\n\n[Hook: Kanye West]\n\n[Verse 2: Kanye West]\nYeah, Kanye to the, yeah\nI'm with this bad Ethiopian chick, drinkin' straight up liquor\nI told her I'm Nigerian, a straight up nigga\nNow is it just me, or do them Uggs\nHave girls feet lookin' like sheepskin rugs?\nSome rhyme with a name, some rhyme nameless\nDon't try to treat me like I ain't famous\nMy apologies, are you into astrology?\n'Cause I'm, I'm tryin' to make it to Uranus\nSee that's a little Don Juan game\nAll across your chest like Sean John name\nNiggas tryin' to figure out since Kan' came\nWho the rookie of the year, me or LeBron James?\nThey say whoa, don't get caught up in the hype\nAin't no tellin' they gon' love you after tonight\nWell if tonight's the night, pop bottles, fuck models\nSpend money 'til you broke, my nigga live your life!\n\n[Jadakiss:] Ah-ha!\n\n[Hook: Kanye West]\n\n[Verse 3: Jadakiss]\nShorty gettin it in with me, 600 Benz with me\nShe wanna spend with me, uhh\nShe see me roll up the bud, then thug out the club\nCause I got my mens with me, uhh\nShe said she leavin her friends for me\nThey ain't gettin in with her, cause she gon' bend for me, uhh\nHer tongue spin like a rim for me, do what she can for me\nLook like a ten for me, uhh\nNow shorty is out with me, usin her mouth for me\nShe lookin out for me, uhh\nShe said 'Kiss where you live, I said you see the Bridge\nWhen you step on the balcony, let's go\n\n[Hook: Kanye West]\n\n[Jadakiss:] Ah-ha!", "image": "https://images.genius.com/2b764e1a48616aab1941bfc2c79cd515.1000x1000x1.jpg"}], "artist": "Jadakiss"}