{"songs": [{"title": "Rich Sex", "album": "Queen (Bonus Version)", "year": "2018-06-11", "lyrics": "[Intro: Nicki Minaj, Brinx Billions & Lil Wayne]\nFull blown, run rich, Brinx\nYo, Mula, yo, yeah\nAyo\n\n[Verse 1: Nicki Minaj]\nI know what these niggas like, and it ain't my charm\nI ain't stupid, this $250 on my arm\nI like money more than dick, nigga, that's a fact\nYou think pussy's everything? Well, let's have a chat\nA-a-ass out, pussy fat, point me to a rich nigga\nWho gon' Rico, Ace me, pay in full my money, Mitch nigga?\nI'ma help him fuck the check up, I'ma run the business\nIf your girl don't get it poppin', put me on your wishlist\nHitlist, now he sendin' gifts like if it's Christmas\nHe said, \"Baby, everyday we ballin',\" I say, \"Swish, swish\"\nGot him callin' nonstop 'cause he don't wanna miss this\nI said, \"Don't panic, keep the faith, nigga, B.I.G.'s bitch\"\n(Real rich nigga sex)\n\n[Chorus: Nicki Minaj]\nIf you know your pussy worth a Benz truck (Rich sex)\nDon't let homie fuck unless his bands up (Rich sex)\nGo to DR, get that fat transfer (Rich sex)\nIt ain't such a thing as broke and handsome (Ri-Rich sex)\nIf you let that broke nigga fuck, we tellin' (Rich sex)\nIf you let that broke nigga fuck, we tellin' (Rich sex)\nIf you let that broke nigga fuck, we tellin' (Rich sex)\nIf you let that broke nigga fuck, we tellin' (Rich sex)\n\n[Verse 2: Lil Wayne & Nicki Minaj]\nLil mama said she only fuckin' on a rich dick\nI cum in her face and tell her, \"Now you lookin' rich, bitch\"\nHer friend in the other room, can I get a witness?\nWe could have some rich sex, cannot have no rich kids\nFacts, all my bitches have no limits\nFucked her in a helicopter, now she screamin', \"Sky's the limit\"\nFuck her in a drop top, now she screamin', \"Sky's the limit\"\nSent her back to who she with, now she screamin', \"Why I'm with him?\"\nDamn, lil mama said she only suckin' on a rich dick\nMake you put your money where your mouth at, that's some lipstick\nLet's fuck on the money 'fore we count that, that's some rich shit\nPussy smell like money when I'm down there, that some Nic shit\n(Real rich nigga sex)\n\n[Chorus: Nicki Minaj]\nIf you know your pussy worth a Benz truck (Rich sex)\nDon't let homie fuck unless his bands up (Rich sex)\nGo to DR, get that fat transfer (Rich sex)\nIt ain't such a thing as broke and handsome (Ri-Rich sex)\nIf you let that broke nigga fuck, we tellin' (Rich sex)\nIf you let that broke nigga fuck, we tellin' (Rich sex)\nIf you let that broke nigga fuck, we tellin' (Rich sex)\nIf you let that broke nigga fuck, we tellin' (Rich sex)\n\n[Interlude: Nicki Minaj]\nRich who? Got bricks, too\nThe rich get richer, that's my ritual\nRich crew, link my bitch, too\nMack took the Wraith, me and Tune flew\n\n[Outro: Nicki Minaj & Brinx Billions]\nI don't even know where we going these days, where we landing\nQueen, where we going again?\nTo the moon, Alice, the goon palace\nWe don't get fly, we take flight, haha\nWoo! Haha, ahh-haha, ahh!\nYou mad, doggie? You mad, doggie? Haha\n(Next stop: New York)\nHahaha, rrrrr!", "image": "https://images.genius.com/c2364194acb9b424e9eeef9a4a168d17.1000x1000x1.jpg"}], "artist": "Nicki Minaj"}