{"songs": [{"title": "Riot In The Club", "album": "Streetlights  ", "year": "2010-04-20", "lyrics": "[Intro]\nHey blaze that up\nCoughs\nHey this some bomb shit\nCoughs\nDamn!\nYa know I walked  in the club the other day and almost wanted to smack the shit out  this nigga\nMan\n\n[Chorus]\nThis is what  we do when we ride in the club, soon as we come in niggas ride in the club\nDon’t give a fuck nigga don’t give a fuck soon as we come in niggas ride in the club\nUnderstand?\nThis is what we do when  we ride in the club, soon as we come in niggas ride in the club\nDon’t give a fuck nigga don’t give a fuck, soon as we come in niggas  ride in the club nigga\n\n[Verse 1]\nJust another day on the streets of Los Angeles where the fone shine the homies on the dime, on the dime me i’m a nickel  plated 9\nJust bustin saying what  i feel just telling ya’ll the reals, yall the reals yall the reals\nBaby got ass for days\nBaby got ass for days\n\n\nBomb in so many days\nBomb in so many days\n\nTell me have you ever seen my for its beautiful gleaming  like armour all you can come over here\nAnd see it out the back  door nigga\nDo what i gotta do just to get where i gotta get\nI could  tell from the way you look you ain't down for the ride.  all i knows what I got\nAll I got’s what I know/ I could  tell from your instary you ain't ready to ride to ride\nPull out the pistol nigga and then busting the slide the slide\nTell me something  I don’t know so i told the bitch nigga  to beat it and then cracked his  ho /ho\n\n[Chorus]\n\n[Verse 2]\nBounce wark get it cracking  what the fuck you thought  had happened when i came up in the spot eh\nAnything it hadn't stopped had them niggas pippin hot cuz they always too lose tell em what we call it record side  balling whu\nLet me get ya ass some game, don’t teach ya bitch about the game /the game\nCuz now she’s all up on it, as soon as we walked in she was all upon us\nI stepped in I know i'm the one, two seconds  later playa ain't no fun. no fun\nThey call me gotti sinatra,  hood is lost in but classics is operas;  fascinating.  now niggas scrapping\nI kick back and before we came it wasn't cracking nigga man. man look at the latinos / tinos\nChilling like hood gambinos\n\nRide ride\n\n[Chorus]\n\n[Verse 3]\nJust don’t understand why y’all tripping might catch me dipping but never catch me slipping\nSo it ain't no twisting\nMoney like a nigga serving chickens nigga\nNever catch me slipping cuz there ain't no repairing  when the hommies clipping\nClipping\nWe’ll start the chipping but now i wanna get a bitch to blow my dick in\nRoll in w my tux and my all black dickies dick get your bitches just trying a dickie /dickie\nIt’s just me an keeta around the ladies and all of them coochie eaters, and I’m cool/ I’m cool\nGo on baby do what u do lil mama just too smooth, before  I say something here come the haters that’ll bring the crocodile out the alligator nigga ride ride\n\n[Chorus]", "image": "https://images.genius.com/48a18f242c2b2fb8c91b44110a454db4.600x600x1.jpg"}], "artist": "Kurupt"}