{"songs": [{"title": "Letter For The Fifth Anniversary Of “The Warm Up”", "album": null, "year": "2014-06-15", "lyrics": "5 years ago, we started a journey together. On June 15th, 2009 I released The Warm Up to a few who were waiting patiently for it. Full of my dreams, fears and predictions, it resonated with you right away. Over the next year I watched it grow legs and spread at an unbelievable pace all because you felt it so much. Five years later, I couldn’t be more proud of it’s impact. Thank you.\n\nThe Warm Up is a declaration of dedication to Greatness. Told from the perspective of a kid who wants more than what his city has to offer him. The crime. The stagnation. He wants more from the girls he dates. He wants out of Muhammad’s house. He refuses to let anyone tell him he can’t dream. That he won’t make it. He believes in himself. He dedicates his life to his craft, because he’s finally realized that the work that you put in today has a direct and absolute impact on the life you live tomorrow.\n\nYou heard the passion, you heard the stories, and you believed in him too. You rooted for him. And your’e still rooting. My thoughts today come from my observations over the past 5 years. I understand now that you’re rooting for him, rooting for me, because you are also rooting for yourself. You realize that this society kills dreams and encourages you to conform. To settle for the block, to join the army, to become a lawyer when you really want to paint, to get comfortable in the projects, to slave away at a 9-5 you hate because it pays decent; to become complacent with safety. The Warm Up says, “Fuck that. I will be Greater. Watch me.”\n\nI think about all the times over the past few years that one of you has said to me, “you’re the reason I went to college,” “yo, The Warm Up got me through some hard times,” “got me through law school,” “med school,” “high school,” “The Warm Up changed my life.”\n\nI imagine that 5 years ago we all wanted more. The Warm Up was just something that put music and words to what we were feeling. As I write this I’m on a plane from Sydney, Australia back to New York City. Music has taken me around the world now, doing shows in places I never thought I would be. I’m grateful.\n\nI’m wondering where you are today. 5 years later. The Warm Up dropped when some of you were upperclassmen in college. I’m hoping that you’ve found a career doing some shit you love, something that makes you happy. Maybe you needed more time to figure it out. Grad School? Or maybe you’re back in your parents crib trying to regroup. Everything will be OK. Don’t stop dreaming.\n\nSome of ya’ll were still in high school. If you went on to college, enjoy it while you got it. If you went straight to the real world, I wish you the best. I hope you found a trade you love, or a job that allows you to support yourself. Happiness is all that matters. If you ain’t happy, adjust please.\n\nSome of you were underclassmen in college, which means you probably just entered the workforce or you’re still trying to get that entry level position. These are the toughest times. You will struggle no doubt, but it will all work out in the end.\n\nNo matter where you were 5 years ago, I hope that today you are closer to your dreams. I know that everything hasn’t gone exactly the way you planned, it hasn’t for me either. But our job isn’t to plan. Our job includes 3 responsibilities. 1. To dream. 2. To believe that dream is attainable. And 3. To work hard everyday towards that dream. Let God handle the rest.\n\nAs you go throughout this week replaying this project that changed my life and lots of yours too, I want to leave you with this because I feel we all need it. Read this as if these words were yours, because they are.\n\nIn 5 years I have come so far. I am grateful to be here today, alive and full of potential. But I am not satisfied. I still want more. I still have dreams, even bigger now than before. I will not settle or conform. I rededicate myself to greatness. I give my time and my passion to my craft, because I realize that the work I put in today affects the life that I live tomorrow. I believe in myself. And to all those that doubt me I say, “Fuck that. I will be Greater. Watch me.”\n\n- Cole", "image": "https://images.genius.com/2cd936e786e1ab454043327d585c7702.1000x1000x1.jpg"}], "artist": "J. Cole"}