{"songs": [{"title": "Shit on U", "album": "Build and Destroy", "year": null, "lyrics": "[Intro]\nHahaha, yeah yeah, haha\nNo offense to my two niggas\nY'all know who y'all are, it's personal\nMotherfucker, you hear me?\nI know I ain't get back to you\nYou dissed me a while ago, I just caught it\nI couldn't understand what yo' fat-ass was sayin!\nIt's all good though (I will shit on you)\nI'm home, it's time for us to talk to each other\nNigga.. (fuck, you)\n\n[Verse]\nYo yo, I heard you on DJ Butter, you ain't slick\nSomewhere in between a st-st-stutter and punch diss\nI was like, \"Huh, what the fuck is this?\nWhy the fuck this lame nigga tryna fuck with this?\"\nYou was talkin real reckless, you dissed the king\nGet your eyes off my necklace, kiss the ring\nCrawl 'fore you walk, don't get caught without your gat\nSomebody shoulda taught you how to talk before you rap\nI know about how you gotta get walked though your verse\nNiggas tryna teach you how you talk all through your verse\nThe streets, magazines still knockin your verse\nOn your verse, niggas just look at they watch and converse\nI'm about realism - as far as a fat nigga\nThat raps and rapes kids, I don't see the vision\nYou do front, me you admire\nYou told the truth once like, \"I'm a compulsive liar!\"\nInsecure niggas take offense to the line\nAll in my my shit when I'm mentionin mines\nYo it's on, better tell Von stick to the rhymes\nYou better run and get Swift when I get to the nine\nIt should be: Wall Street, y'all and Slum V\nBut no, (nope) you wanna rhyme like Young Zee\nHeh, you was a clown in school\nOnly nigga on stage in a costume, now the world is clownin YOU\nThe sheriff of the rap - arrestin the big fat bear\nThat gotta jump into character to rap\nUhh, nigga GIMME this mic, you ain't doin it right\nYou call yourself a idiot, I'm just provin you right\nThis is strong over the weak, long career over deceased\nAnd me doin you wrong over your beat\nYou speak when you see me but you talk the flow\nFuckin clown, smile nigga, honk your nose (honk honk!)\nYou probably look at it like I'm makin a big deal\nBut nigga that's what I do, I make big deals\nTake a chunk of the budget, and keep they proud raise\nAnd watch the little people split the pie five ways\nNigga go play, matter fact, catch up\nI am six figures bigger and my books kept up\nY'all a rap boy band, and you testin me now?\nY'all a group with one star like Destiny's Child\nFUCK THAT! No nigga, how can I relate\nTo a group with four dudes that's easily replaced?\nI erase niggas when they talk backwards (what?)\nI call Paul and have him write you off on his taxes\nI'm a solo artist, you just one of the crew\nFans comin up to y'all like, \"Which one is you?\"\nYou the fat one! Tell 'em that's your name\nYou will tell a joke whenever too, that's your game\nYeah, who cares if you've been on tour, you don't come off\nNigga all you do is run on stage and run off\nYeah, one loose cannon - that's strange\nCause the only cannon in the crew is planted wherever Proof's standin\nI speak to Em and Proof, I'm speakin with love\nThem my niggas, y'all sissy niggas keepin a grudge\nI don't give a FUCK nigga, you get beat up with gloves\nAnd if you want beef, fuck it, you can meet up with Bugz\nI'll shit on you!\n\nYou fat motherfucker\nAiyyo cut that shit! Fuck that nigga\nYou diss me you gon' get dissed back, nigga\nYo' mama, muh'fucker\nAnd I beat yo' ass, Wall Street ho", "image": "https://images.genius.com/d86b45b993cdf0c53559e740521a4bba.500x494x1.jpg"}], "artist": "Royce da 5'9'’"}