{"songs": [{"title": "Look Into My Eyes", "album": "Greatest Hits", "year": null, "lyrics": "[Scarface]\nLook me in my eyes, tell me what you see\nDo you think I'm cra-zy??? (AAAAAGHHH!! Just bein me)\nSometimes I wanna die, maybe I'll be free\nFree from all this bullshit that's constantly surroundin me\n(I can feel it in my head) I see when I'm asleep\nI don't wish to discustin, cause it done been too deep\nI'm tired of bein' stepped on, and past around like weed\nLook me in my eyes (Look me in my eyes)\nAnd tell me what you see (and tell me what you see)\nCan you see my future, and what lies down the line?\nIs it just my test, or is it just my time?\nTime for me to pay, for all the wrong I've did\nI forgot to be picked off, when I was just a kid\nA poison in my mind, tryin to find relief\nBut I can't get no peace, cause Shoemaukers been chasin me\nTryin' to set me up, bustin down my streets\nBlockin' up my door, to see if he can catch me\nBut I don't sell no dope, so fuck what niggas say\nFuck Ronnie Carbone(?), and fuck the D.E.A\nAnd fuck these undercovers, that lock me up for weed\nYou can search me all you want to, but you won't find no cheese\nAnd I ain't finna snitch, cause I don't know a thang\nDon't ask me shit bout Steve, don't ask me shit bout Jane\nI know you crackrs pissed off, I can see it in your eyes\nI'm down with Rap-A-Lot, until the day that I die\n(Until the day that I die)\nSo fuck you in ya asses, you know it's all a lie\nYou just wanna destroy me, just like you did my guy\nBut now I must expose you, and tell my boys the truth\nListen up my niggas: \"The F.B.I. been watchin' you\"\nEspecially if you black, and tryin to leave the streets\nAnd get off in this music, you see the way they doin me\nRunnin in my crib, makin niggas lie\nNigga get a scapegoat and take this 25\nYou know I ain't no dopeboy, ain't never been a mule\nI admit I use to sell rocks, but that was back in school\nNow I just do music, and smoke a little weed\nBut not enough to run a dope house, so why you fuck with me?\n\n[Chorus]\nLook me in my eyes!\nWill you look in my eyes, and tell me do you see what I see?(My eyes!)\nWill you look in my eyes, and tell me do you see a Geeeeeeeee?\n\n[Scarface]\nLook me in my eyes, I've told all I could tell you\nAnd now you know too much, if you leak a word I'll kill you\nYou think that I'm insane, partially deranged?\nYou've had your chance to pick my brain, now explain\nWhat's up with all these nightmares, this long rewinding road\nThat leads me to the same place I started from;\nRight before I left home\n(Look me in my eyes!) I thought you was a shrink\nDiagnosed my symptons, I give you time to think\nOK your time is up, now analyze my life\nPlease remove your glasses, look me in my eyes\n(Look me in my eyes, my eyes)\nYou seemed to be confused, I raised up off his sofa\nPut back on my shoes, because this sessions over\nI headed for the door, he stopped me in my tracks\nHe said he had an answer, he told me to come back\nHe spoke the book of Matthew then he spoke the book of Luke\nBut he stopped at Revelations, when he just spoke the truth\nAnd told me all my answers, I would find in his book\nIf I just stopped and looked, if I just stopped and looked\nTold me to seek in he who seeks he shall find\nThen he put back on his glasses, and looked me in my eyes\nLooked me in my eyes\n\n[Chorus](2x)", "image": "https://images.genius.com/fe3f882ae8d4fcbd1348bf088b0b7025.640x640x1.jpg"}], "artist": "Scarface"}