{"songs": [{"title": "Hit the News", "album": "Streets of Compton", "year": "2016-06-17", "lyrics": "[Hook]\n40 ounces ain't the only thing poppin'\n'Round here we get it clockin' when the things start knockin'\nLow lows ain't the only thing droppin'\nBodies hit the ground, tires screeching niggas yell \"Compton!\"\nLike ooh, ooh\nThem niggas hoppin' out of coupés, coupés\nFuck you thought nigga? They tryna' overuse the shotty\nShit I'm tryna' hit the news with the shotty\n\n[Verse 1: The Game]\nI am from where the niggas say \"What'd up Cuh?\"\nYou can get your ass wet up by \"One Blood?\"\nAnd I bet they just saw El Chapo\nAnd you can get your noodles spilled right up in your taco\nAnd you can get your taco turnt into some nachos\nAll over cheese my nigga\nWhat's beef my nigga? Ridin' by slow mo\nBullet holes in Caine and Sharif my nigga!\nFuck peace my nigga! Cause every time we try that\nWe get smoked by police my nigga\nI am bringing sheets my nigga\nWent from being skinny and gettin' jacked for my Penny's to a beast my nigga\n\n[Hook]\n40 ounces ain't the only thing poppin'\n'Round here we get it clockin' when the things start knockin'\nLow lows ain't the only thing droppin'\nBodies hit the ground, tires screeching niggas yell \"Compton!\"\nLike ooh, ooh\nThem niggas hoppin' out of coupés, coupés\nFuck you thought nigga? They tryna' overuse the shotty\nShit I'm tryna' hit the news with the shotty\n\n[Verse 2: The Game]\nI want the zooms zooms and wam wams, bricks in the Trans Am\nShooters on first, second and third, that's a grand slam\nThese rap niggas Fruit Loops; Toucan Sam\nWhen I say so, bloods rush like a handstand\nAnd ain't with that old Death Row shit\nBeen bangin' since '94, I ain't never did no hoe shit\nType of nigga I am, empty out the whole clip\nCall my YG's and have em' run through your whole shit\nWho was before Kendrick, who was before Nip?\nMiddle of the Slauson, did my shit fighting four Crips\nYou win some and you lose some nigga\nYou break knuckles and you bruise some nigga, what?\n\n[Hook]\n40 ounces ain't the only thing poppin'\n'Round here we get it clockin' when the things start knockin'\nLow lows ain't the only thing droppin'\nBodies hit the ground, tires screeching niggas yell \"Compton!\"\nLike ooh, ooh\nThem niggas hoppin' out of coupés, coupés\nFuck you thought nigga? They tryna' overuse the shotty\nShit I'm tryna' hit the news with the shotty", "image": "https://images.genius.com/013b16a8c7fb2bc65f6717453933b715.1000x1000x1.jpg"}], "artist": "The Game"}