{"songs": [{"title": "We Takin’ Over (Remix)", "album": "Da Drought 3", "year": "2007-04-13", "lyrics": "[Intro]\nYessir!\nIt's me, the rapper eater\nFeed me, feed me, feed me!\nNo homo\n\n[Verse]\nOne time for me, one time for the DJ\nHe be Khaled, I be Lil Weezy\nBaby, if you ask me, if you're nasty\nCreative, gifted bastard, spit sporadic\nI'm so diplomatic, democratic\nTouch it, bring it, push it, systematic\nDamn right, I kissed my daddy\nI think they pissed at how rich my daddy\nIs, and I'm his kid, I stunt with my daddy\nCall Miss Lee, she with my daddy\nSo diss me and don't diss my daddy\n'Cause who was there when no one wasn't? Just my daddy\nWho was there when I needed money? Just my daddy\nSo who be there when I see the money? Just my daddy\nWho said that I'd be the one? Just my daddy\nHello hip-hop, I'm home; it's your daddy\nWhen I say deez, I don't mean the Caddy\nI mean deez nuts, Akon's and Khaled's\nRick Ross, T.I.P., Stunna and Fat Joe\nAnd I ca-ca-can't forget Brisco\nAnd yeah, I done squashed the bullshit with Zoe\nIt's a bakery here, just tryin' to get dough\nShout to my dreads, my Haitians and chicos\nYou lookin' for me, ho? I'm in the 3-0-\n5, I'm the best rapper alive\nHomeboy got a mind that a map wouldn't find\nHomeboy got a 9 that a cop wouldn't find\nBut I could get to it even if I was blind\nLike a scary movie, they screamin' when I rhyme\nI'm a king, you can ask Stephen if I'm lyin'\nI'm a Prince, too demandin' like my mom\nToo bold, too cold like wet salam-\nMi, me, it's all about me\nIf the girl got a voice, then she talk about me, me\nHe say, she say, I say me\nWe'll be in the M-I-A-Mi\nWith me, and T, and big Ronnie\nAnd the Homie streets, probly somewhere on the beach\nAnd Taz and E probly somewhere in the Jeep\nAnd Marley in the Phantom with Mister G\nAnd me, me, it's all about me\nPlay with me and it's all-out beef\nBeef! Yes! Chest! Feet!\nTag! Bag! Blood! Sheets!\nYikes! Yeeks! Great Scott\nStorch, can I borrow your yacht?\nWatch me and my clique go all out\nLike the ball in the stands, we balls out\nBoy, I don't know what y'all 'bout\nBut I just spit like a dog mouth\nPink ice, just lookin' like a hog mouth\nVroom, I had to bring the hog out\nLight them trees, bring a log out\nEvery day Christmas, I'm eggnogged out\nAnd hip-hop is my new-bought house\nMy flow just grew legs and walked out; bye", "image": "https://images.genius.com/32e1b9a7e336b3f316f0f5de4d6c2815.300x300x1.jpg"}], "artist": "Lil Wayne"}