{"songs": [{"title": "The Incredible True Story", "album": "The Incredible True Story", "year": "2015-11-13", "lyrics": "[Intro]\nGet ‘em!\n\n[Verse 1]\nLiving life on the East Coast\nWay back in the day trying to beat most\nAnybody that wanna do what I do\nWell let me keep it one hunnid with you\nIt ain’t about that; ain’t about Hip Hop, ain’t about Rap\nTake a minute, hold up, wait, now use your cap\nChicago, know I’mma snap\nNah, this ain't no basic rap\n\n[Chorus 1]\nAnd so they wonder who am I—so high (so high)\nI said they wonder who am I—so high\n\n[Verse 2]\nBack again, never outside so I’m acting in\nI laugh again when they don’t understand\nWhat I mean, bias; everybody seen by us\nEverybody wanna live a life like this\nMan fuck that, do what’s good for your family\nMake music like there’s no Grammy\nFor that last line, they might ban me\nI don’t give a fuck though\n'Cause I am me, from Beijing to Miami\nI’mma just do what I do with my crew\nAin’t no telling what I’m finna do\nBut I promise that I’mma keep writing for you\nAnd I know what to do, everything right here for you\nOnly for you, depending on what you gon' do\nIt’s all for you—it’s all for you\n\n[Chorus 2]\nWho am I—so high (so high)\nI said they wonder who am I—so high\n\n[Verse 3]\nLet me take this time to find the rhyme\nAnd know that I’m the only one\nTo find the one, the time is done\nBeyond the sky, beyond the sun\nThere is no one besides the only one\nAnd you know I gotta let ‘em know\nIf you love it, let it go\nAt an all-time low and all I know is, all I know\nI do what I love, came from below and then rose up above\nCreated a world no one has been to\nEverything that I’m into, everything that I’ve been through\nBring it back like, let it shine like a Bat Light\nReminiscing on that night, gotta take flight\nEverybody probably wonder what I’m living like\nIn the middle of the night, I might write\nDespite what they say is right and wrong\nDespite they wonder (wonder)\n\n[Chorus 2]\nWho am I—so high (so high)\nI said they wonder who am I—so high\n\n[Sample: Alan Watts]\nWe’d like to be painters, we’d like to be poets. We’d like to be writers, but as everybody knows—we can’t earn any money that way. What do you want to do? When we finally got down to something which the individual says he really wants to do, I will say to him you do that—and uh—forget the money. If you say that getting the money is the most important thing, you will spend your life completely wasting your time...\n\nYou’ll be doing things you don’t like doing in order to go on living, that is to go on doing things you don’t like doing, which is stupid! It is absolutely stupid! Better to have a short life that is full of what you like doing than a long life spent in a miserable way. And after all, if you do really like what you’re doing, it doesn’t matter what it is—somebody is interested in everything—anything you can be interested in, you will find others who are...\n\nBut, it’s absolutely stupid to spend your time doing things you don’t like and to teach our children to follow in the same track. See, what we are doing is, is we’re bringing up children and educating them to live the same sort of lives we are living—in order that they may justify themselves and find satisfaction in life, by bringing up their children, to bring up \"their\" children, to do the same thing. So, it’s all retch and no vomit—it never gets there. Therefore, it’s so important to consider this question...\n\n\"What do I desire?\"\n\n[Outro]\nThe Incredible True Story\nAnd Transformation of the Man Who Saved the World\n\n[Scene VII]\n\n[THALIA:]\nSurface contact in 400 meters...\n300 meters...\n200 meters...\nTime of day is 6:28 Constant Meridian\n328 feet...\nOxygen: 100%\nTemperature is 17 degrees Celsius\n\n[KAI:]\nMan... what are the chances that there’s some big-ass creature out there that’s going to eat us?\n\n[THALIA:]\n100%\n\n(laughter)\n\n[KAI:]\nFuck...\n\n[THALIA:]\nClear skies—\n\n[THOMAS:]\nKai, which Tarantino film do you think Logic liked best?\n\n[KAI:]\nI would definitely have to probably have to say Kill Bill\n\n[THALIA:]\n114 feet—\n\n[KAI:]\nMan, stylistically he’s like—what’s the name of that bitch? The lead character? I forgot her name, but he’s like that bitch—with like some Kung-Fu shit he’s like with his raps. It’s fucking crazy!\n\n[THOMAS:]\nYou know in—in Pulp Fiction I mean—the way Tarantino constructed his shots, it’s the same feel for me with his raps you know? There’s thought behind it...\n\n[KAI:]\nNo, I could see that, I could see that but...\nBut nah man, fuck that man! Kill Bill was the shit!!\nEspecially like knives throwing and dodging and shit—and then fucking hot chicks fucking fighting each other and cutting each other’s heads off! What the fuck is that?!\n\n[THOMAS:]\nYeah, fuck it—\n\n[THAILIA:]\nPrepare for surface landing!\n\n[THOMAS:]\nYou’re right, hot chicks and Kung-Fu, can’t beat that...\n\n[KAI:]\nYeah, can’t beat that at all...\n\n[THALIA:]\nSurface contact in:\n10... 9... 8... 7... 6...\n5... 4... 3... 2... 1!\n\n[KAI:]\nAre you ready for this?\n\n[THOMAS:]\nAre you?\n\n(sounds of birds chirping, air, etc.)\n\n[THOMAS:]\nWait, wait—what's that sound?\n\n(sounds grow, then abruptly stop)\n\n[THALIA:]\nLife...", "image": "https://images.genius.com/b9b6844bdd8ebfbe10235ad54d885cfa.960x960x1.jpg"}], "artist": "Logic"}