{"songs": [{"title": "Dedicated", "album": "The Documentary 2", "year": "2015-10-09", "lyrics": "[Intro: Future]\nCan I trust you gonna ride for me like I ride for you?\nFuture Hendrix, yeah!\nBongo, by the way\n\n[Verse 1: Future]\nMoney we burn it on bitches like candles\nCan I trust you gonna ride for me like I ride for you?\nI speak your name and it's royalty\nYou see the stress and my loyalty\nYou gotta be there for me through the casualties\nYou see my trials and my tribulations\nYou can tell them demons tryna capture me\nOnly thing that ever mattered to me was my niggas\nI know these niggas gon' ride, yeah, squeeze triggers\nYou gotta put in some time for this\nAlmost lost my mind for this\nFuck all that crying lil bitch\nNiggas round my way, they dying for this\n\n[Chorus: Future]\nFuck all these bitches, I'm yours\nFuck all these bitches, I'm yours\nOnly thing that ever mattered to me was my niggas\nOnly thing that ever mattered to me was my niggas\nOnly thing that ever mattered to me was my niggas\nOnly thing that ever mattered to me was my niggas\nFuck all these bitches, I'm yours\nFuck all these bitches, I'm yours\n\n[Verse 2: The Game]\nYou already know me, know how I get down\nKnow I'm with the shit when I pull up\nAny nigga ever disrespected you from the beginning\nI put the chrome to his neck like a pull up\nYou know a nigga bang Cedar block\nYou was bool with it, wasn't you?\nTalkin' 'bout when a nigga gonna leave the block alone\nBut you never say this shit when I'm fucking you\nWe was the Huxtables, everything was perfect\nEverything was working\nWe had some beautiful kids together\nHad a nigga feeling like everything was worth it\nCloset full of Birkins\nHow you make a nigga spend a million dollars on purses?\nThen have an attitude\nLike you in the studio helping a nigga write verses\nHad a nigga focused on the future, now a nigga feeling like Future\nWe both dealing with a new nigga 'round our kids\nAnd we ain't kill 'em yet, nigga, I salute you\nAnd I still bang like I used to, red Impala, gold things like I used to\nPick up my kids, they don't see none of that\nBut when I'm back in the hood I'm yelling soo woo!\nAnd it was all good just a week ago\nShit, we was Nicki and Meek a week ago\nGave you everything, the watch, the house, the cards\nTatted your passport, and now you wanna see me low\nWanna take my pussy, give it to the next nigga free\nOne thing about the next nigga\nHe just the next nigga, he can never be me\nI'm coming to get my kids and they momma like\n\n[Chorus: Future]\nFuck all these bitches, I'm yours\nFuck all these bitches, I'm yours\nOnly thing that ever mattered to me was my niggas\nOnly thing that ever mattered to me was my niggas\nOnly thing that ever mattered to me was my niggas\nOnly thing that ever mattered to me was my niggas\nFuck all these bitches, I'm yours\nFuck all these bitches, I'm yours\n\n[Verse 3: The Game]\nCompton ain't the same\nWhere all these bitch niggas come from?\nCan’t even take a fade or ride through the hood\nWithout niggas hands out like they want some\nBut where you at when I need you?\nSee most of these niggas see through\nYou throw up a P, I throw up a P too\nYou pulling out heat, I draw the heat too\nCompton made me like this, nigga\nFuck all these bitches, get money and die\nHundred niggas in my section, hundred Rollies in the sky\nThere's a hundred little niggas that will bang on a nigga\nPut the flame on a nigga, take chains from a nigga\nThat will go BG, Turk and Wayne on a nigga\nWhen the club get cloudy let it rain on a nigga\nWe are with the shit, let us redefine lit\nThat’s in the club smoking on extendos, extendo with the clip\nStanding on the couch like wah\nBackwood hanging out my mouth like wah\nWho the fuck want a problem?\nOnce you’re shot, leave a nigga dead on an island\nCreep out the back door with my side bitch, aye\n\n[Chorus: Future]\nFuck all these bitches, I'm yours\nFuck all these bitches, I'm yours\nOnly thing that ever mattered to me was my niggas\nOnly thing that ever mattered to me was my niggas\nOnly thing that ever mattered to me was my niggas\nOnly thing that ever mattered to me was my niggas\nFuck all these bitches, I'm yours\nFuck all these bitches, I'm yours\n\n[Outro: Sonyaè Elise (Future)]\nOooh-oooh-oooh\nFuck these other bitches I just\nOooh-oooh-oooh\nFuck with them when issues begin\nOooh-oooh-oooh\nI be with my niggas, when I'm\nOooh-oooh-oooh\nSay I'm with my niggas, I just\nOooh-oooh-oooh\nDon't you know there's no better time than when I'm with you?\nBut I can't control these temptations when a nigga not with you\nYou wanna be done with me, but your heart won't let it\nStanding at the front door but you just can't exit\nYou wanna be with me\nYou wanna be with me\nYou wanna be with me, with me, with me, with me\nMe, me, me, me\nYou wanna be with me, with me, with me, with me\nMe, me, me, me\nMe, me, me, me\n(Fuck all these bitches, I'm yours\nOnly thing that ever mattered to me was my niggas\nOnly thing that ever mattered to me was my niggas)", "image": "https://images.genius.com/f5bd9dcb51fd19e06b10b2ae0e3620cf.1000x1000x1.jpg"}], "artist": "The Game"}