{"songs": [{"title": "Weed Brownies", "album": "Amber Kush Mixtape", "year": "2011-07-20", "lyrics": "[Intro: Wiz Khalifa]\nIs this the top? The top of the world?\nTop floor, there's weed in the ashtray\nIt's top-shelf, cap!\n\n[Verse 1: Wiz Khalifa]\nRiding in my Challenger, faded off this weed brownie\nTurning down the music cause the weed is loud enough already\nNiggas ask me 'bout my pay, I say I keep it steady\nGripping on the wheel, spending money like a politician\nTipping on a bill, it's going down\nLike this bitch was sitting on the hill\nI keep my girlfriend in them expensive sort of heels and furs and shit\nEat champagne and lobster cause I fucking deserve this shit\nCap! Niggas say I've got an old soul\nWell, I tell them that I'm here muh'fucka\nAnd I made it cause my flow cold\nI'ma roll some of this weed\nI'ma pass it to you and we gon' be so gone\nHomie, I got papers and vaporizers\nFlavors to stablize ya\nThoroughly-baked cake, can't say a thing with my eyes shut\n\n[Hook: Wiz Khalifa]\nThey say they do (they do, they do, they do)\nBut they don't know (don't know, don't know, don't know)\nWho we are (who we are, who we are, who we are)\nSuperstars\n\n[Verse 2: Curren$y]\nUhh, I'm out of here, stratosphere\nPaper hella-straight, nappy hair\nBitches seem not to care that you was even there\nWhen we pulled up lit like Times Square\nWhen we pulled up lit like road flares\nWhen we pulled off, them hoes disappeared\nBecause they know what we be doing over here\nShe just wanna be high in her underwear\nWith her iPhone plugged in the wall, power low\nStepping out the shower, threw her a shirt to towel off with\nOne of the two qualities I want in a bitch\nCause baby girl fuckin with me is some major shit\nFair warning: I gotta wake up to a BJ every morning\nAnd a J while I'm yawning, darling\nI got papers and vaporizers, flavors to stablize ya\nI'm a fully baked potato, spending my cheddar and chives\n\n[Hook: Wiz Khalifa]\nThey say they do (they do, they do, they do)\nBut they don't know (don't know, don't know, don't know)\nWho we are (who we are, who we are, who we are)\nSuperstars\n\n[Verse 3: Big Sean]\nI'm dedicated, hella-faded, high as hell, I'm levitating\nI'm rolling up, fuck a wheelchair, ironically, my shit's medicated\nYour eyes closed cause you asleep, my eyes closed cause I'm meditating\nI gotta go make reservations, at a real nigga's destination\nTwo girls in the tub, that's luxury\nYou disagree? That's fuckery, saying, \"Fuck you\" cause you can't fuck with me\nI need my dick sucked, but I'm sucka-free, you are who it sucks to be\nI'm accompanied by Finally Famous Over Everything, that's my company\nYou already know, nigga\nCollect the money like it's old, nigga\nAnd I'ma blow it like it's rolled, nigga\nAnd I be stuntin 'til I'm old, nigga\nWeed, money and hoes - what a hell of a night!\nFuck you mean? This is everyday life\nShe in the mirror making sure that she wearing it right\nIt's apparent she present where I'm appearing tonight\n\n[Hook: Wiz Khalifa]\nThey say they do (they do, they do, they do)\nBut they don't know (don't know, don't know, don't know)\nWho we are (who we are, who we are, who we are)\nSuperstars", "image": "https://images.genius.com/96fedef1021fe0a4ad0093c057e935ec.600x600x1.png"}], "artist": "Wiz Khalifa"}