{"songs": [{"title": "Right Back at You (Freestyle)", "album": "Free Agents - The Murda Mixtape", "year": null, "lyrics": "{*opening gunshot courtesy DJ Whoo Kid*}\n\nYea (yo P it's on in this motherfucker) that 2003 shit\nYo check it out\n\n[Havoc]\nFuck where you at kid, fuck where you from\nPistol-whip a nigga dumb slugs {*DAMN*} hittin up lungs (uh-huh)\nMy nigga just got sent to the sprungs, shit is real\nHe went for razors spittin them shits from under his tongue\nAnd from birth I was a hustler, no talk I'm buckin ya\nNo matter if a dime bitch, my nigga bitch ain't fuckin her\nLoyalty to the click, forever Mobb 'til I die BITCH\n(BEOTCH) Open my casket wide\nSo you can see how fly, nigga from N.Y. do it\nNigga front on me, and die, so why do it\nI swear, feel like I've been here before, my first dealings went raw\nAnd tried to convert it to cash that's pure {*WHOO.. KID*}\nWe gettin money niggas fingers behind triggers, that go without sayin\nBlock ain't affiliated we sprayin\nAnd anybody that you see, gettin past us payin\nOn some \"Quiet Storm\" shit, motherfucker it's still rainin\n\n[Hook: Prodigy]\nAiyyo - what we got the drop on you kid, now we got you\nYou got the heart to get biz without your crew?\nLet's get it on nigga do what we gotta do\nYou buck at me I'm buckin right back at you\nWe got the drop on you kid, now we got you\nYou got the heart to get biz without your crew?\nLet's get it on Dunn do what we gotta do\nYou buck at me I'm buckin right back at you\n\n[Prodigy]\nLet me start things off\nIn the room just drinkin my drink, check out my thoughts\nI'll be buried too soon, but at the same time\nI see a very good future, what it's gon' be Dunn\nYou never know will ya, got guns by the pi-dound\nTo destroy beef, better tell your dawg sit down\nI hits off the (? ?) like a little green army man\nPullin grenade pins on the floor shootin\nMurder a human, invadin my space\nAnd do the slip like Thomas Crown, vacate the place\nTake your bitch like, Tony Montana or Goldie\nSwift with my talk like the serpent did Eve\nWhen my niggas emerge, we intensify things\nYou can smell it in the air that's the shit, hittin the fan\nNiggas gon' feel me when my thing bang\nAnd we continue to party like eternal Sunday\n\n[Outro]\nShout out.. Infamous Records.. ha ha\nCan't forget, LandSpeed {*blam} yea yea", "image": "https://images.genius.com/8a94d4d15bcdf43ddb8ce2cdbfde357c.455x455x1.jpg"}], "artist": "Mobb Deep"}