{"songs": [{"title": "Finish Line / Drown", "album": "Coloring Book", "year": "2016-05-12", "lyrics": "[Part I: \"Finish Line\"]\n\n[Intro: Eryn Allen Kane & Chance The Rapper]\nDo-do-do-do-do-do-do\nDo-do-do-do-do-do-do\nDo-do-do-do-do-do-do\nDo-do-do-do-do\nAnd we back, and we back, and we back, and we back\nDo-do-do-do-do-do-do\nDo-do-do-do-do-do-do\nDo-do-do-do-do-do-do\nDo-do-do-do-do\nAnd we back, and we back, and we back\n\n[Verse 1: Chance The Rapper]\nThey ain't teaching taxes in school\nIt don't even matter, I was acting a fool\nBut who would think the raps would turn into racks?\nDon't matter, matter fact, it could happen to you\nScars on my head, I'm the boy who lived\nThe boy love playing when the boy too sick\nReclining on a prayer, I'm declining to help\nI've been lying to my body can't rely on myself, oh no\nLast year got addicted to Xans\nStarted forgetting my name and started missing my chance\nL.A. for four months, end up leaving right back\nI'm in love with my city, bitch, I sleep in my hat, uh\nI felt hogtied ever since my dog died\nHe lived to 84, damn, that's a long ride\nI know he up there, he just sit and he wait\nI'll be racing up the stairs, I'ma get to the gate singing\n\n[Bridge: Eryn Allen Kane]\nDo-do-do-do-do-do-do\nDo-do-do-do-do-do-do\nDo-do-do-do-do-do-do\nDo-do-do-do-do\nDo-do-do-do-do-do-do\nDo-do-do-do-do-do-do\nDo-do-do-do-do-do-do\nDo-do-do-do-do\n\n[Chorus: T-Pain]\nOh, all my days\nI prayed and prayed\nAnd now I see the finish line\nOh, I'm gonna finish mine, yeah\nAll my days\nI prayed and prayed\nAnd now I see the finish line\nGonna finish mine, yeah-eah\n\n[Verse 2: Chance The Rapper]\nHey! Gimme the water, gimme the water\nI need the kind from Space Jam\nGet this money, get this budget, KOK to day camp\nMe and my girl plan to stay to the end\nHope there never come a day where we be better as friends\nWe in a marathon we could build a marriage on\nArguments as parents digging deeper than a baritone\nI've been getting blocked just trying to make songs with friends\nLabels told me to my face that they own my friends\nI got to pray, I got to pray, like Hammer after \"2 Legit\"\nI got the power, I could poke Lucifer with crucifix\nI cannot scrape om stupid shit, I stand up like I'm Ludacris\nI know some folks that talk so much\nYou'd think they drive an Uber whip, damn\nQueen said, \"Why we in a queen bed?\"\nI said, \"It's yours, don't worry, lil' beanhead\"\nI'm just here to catch my breath, I got a world tattoo\nShe said, \"Cool, just bring me some food\"\n\n[Chorus: T-Pain]\nOh, all my days\nI prayed and prayed\nAnd now I see the finish line\nOh, I'm gonna finish mine, yeah\nAll my days\nI prayed and prayed\nAnd now I see the finish line\nI'm gonna finish mine, yeah-eah\n\n[Bridge: Eryn Allen Kane]\nDo-do-do-do-do-do-do\nDo-do-do-do-do-do-do\nDo-do-do-do-do-do-do\nDo-do-do-do-do\nDo-do-do-do-do-do-do\nDo-do-do-do-do-do-do\nDo-do-do-do-do-do-do\nDo-do-do-do-do\n\n[Part II: \"Drown\"]\n\n[Intro: Eryn Allen Kane]\nThe water may be deeper than it's ever been\n\n[Verse 1: Noname]\nLord rain down on me so I can move on water\nLike children at the altar, like God inside my house\nI love you, I love you, you looking holy like Mama\nYou made a church out of feathers, so when she fly to the Father\nShe know the choir gon' follow and all the offering paid\nShe gave my name away to your holy house\nShe like my blessings in disguise\nShe like her Jesus mountain high\nSo He can watch her lonely child, I know my God\nI know my God seen His breaks and His edges\nAre jagged for giving that pain to His city in gold\nLike everything is everything\nLike all them days He prayed with me\nLike emptiness was tamed in me\nAnd all that was left was His love\nAnd all that was left was His love\nAnd all that was left was His love\nAnd all that was left was His love\n\n[Chorus: Choir]\nNever, never drown\nThe water may be deeper than it's ever been\nNever drown\nThe water may be deeper than it's ever been\nNever drown\n\n[Verse 2: Choir & Kirk Franklin]\nNever, never, never (Chance, let me in, come on)\nThis thirst in my soul (There's a thirst in my soul, it tell me)\nWhere else can I go? (Where?) but You? (Come on)\nI may cry a river (I may cry a thousand tears, but)\nBut You take each drop and You wash (You wash me new)\nMe new (People sing)\nThis water is deep (Yes, yes and I need You to)\nJesus, rescue me (Come on, save me, I need You to)\nTake me to Your mountain (Hallelujah)\nSo someday Chicago will be free (Someday, we'll all be free)\nBe free (Say)\n\n[Chorus: Choir]\nThe water may be deeper than it's ever been\nNever drown\nThe water may be deeper than it's ever been\nNever drown", "image": "https://images.genius.com/b17a54d05a3de269cc6ea53c3f71f73e.1000x1000x1.jpg"}], "artist": "Chance the Rapper"}