{"songs": [{"title": "We On", "album": "Starvation", "year": "2012-01-01", "lyrics": "[Verse 1]\nOk, I walk in the party, Mister Swag, so gnarly\nWith a bad Spanish mami, better ask somebody\nYeah that's my Maserati, going HAM no salami\nThat's yo chick? If I like it then I'm straight bogarting\nIn the club, where the bottles? That Rosé, no Moscato\nThey see me, models follow, ass clap, ah bravo\nI be wiling my nigga\nSee my jewels they six figures\nFuck your girl and her friend\nI'm a dog I do figure\nChilling with my click and I puff that loud\nShe don't want to fuck then I tell that bitch bye\nHeart so cold why waste my time\nTwenty on that wrist cause I like that shine\nFuck you niggas who hate on mine\nCredit card will not decline\nMissionary, no not me, I like that pussy from behind\nBitch I'm ballin' every day it's like somebody pressed rewind\nAll my niggas came from nothing, mandatory that we shine\nPrivate planein' no complainin' if I happen to recline\nSame nigga that they doubted an I'm gladly gon' remind\nMade a million of my hunger, that's just solely my reply\nCause we the best, shit ain't a lie\n\n[Hook]\nHad to bring the money home\nI had to bring the money home\nMo'fucker we on\nHad to bring the money home\nMo'fucker we on\nHad to bring the money home\nKay, now catch me in your city wit a clique of niggas wit me\nCouple bitches gettin' tipsy\nCelebrating cause we winnin', we on (x8)\nI go so hard, niggas already know\nStill in the club when it closed at 4\nBirthday girl gon' drop it low\nLet's make a toast to never broke\nCause we on (x8)\n\n[Verse 2]\nOkay now one for the money, shawty two for the fuck of it\nPull up in on some shit that just might destroy all your confidence\nMeet a bitch n' hit it quick n' never know her government\nI been rockin' Hermez and that \"H\" don't stand for hooligan\nHigh boy, I fly high, nigga blast off\nYou goof, truth, loose, goose. Prove you ain't cotton soft\nWe on, we on, way to keep on, bring on\nAll these cases of that aces bring her back to my oasis\nTakin' shots after shots like I'm bustin' of that 44\nMan, that Ciroc got me feeling like I overdosed\nLivin' with my niggas, celebrating, rockin' hella gold\nRing, hella big you would think I won a Super Bowl\nYeah we in the building, why the fuck you think it's super swoll?\nTell the DJ \"bring it back\" and show 'em what we really on\nAll these women love me cause they know we young and money long\nMama told me \"get it\", so I had to bring the money home\n\n[Hook]", "image": "https://images.genius.com/ee1f29169e460342b88aa5c8d75ede59.500x500x1.jpg"}], "artist": "Ace Hood"}