{"songs": [{"title": "Fame", "album": "Better Dayz", "year": "2002-11-26", "lyrics": "[Intro: 2Pac]\nAnd my niggas say\nWe want the fame!\nCome on! Come on!\n\n[Chorus: 2Pac]\nOne thing we all adore\nSomething worth dyin' for\nNothin' but pain, stuck in this game\nSearchin' for fortune and fame\nThe one thing we all adore\nSomething worth dyin' for\nIt's been nothin' but pain, stuck in this game\nSearchin' for fortune and fame\n\n[Verse 1: 2Pac]\nThough we exist to breed, some believe currency comes to G's\nStress is half the battle, with success comes greed\nThey got me hot when they shot me, plotted my revenge\nTo increase my ends, enemies gettin' dropped\nWin or lose, red or blue, we must all stay true\nPlay the game, nigga, never let the game play you\nAnd for the fame, niggas change fast, that's a shame\nWhat's to gain, lost souls? Who controls our brain?\nWho can I blame? The world seems strange at times\nSomewhat insane, I'm hopin' we can change with time\nI'm livin' blinded, searchin' for refinement curse\nI know, death follows me, but I'll murder him first\nAnd worse yet, with each breathe, steps I take, breathless\nIs there a cure for a hustler with a death wish?\nCigar ashes, toast with crystal, glasses\nWe mash on them jealous bastards, with my ski mask\nI'm the first one to want him blasted\nWrapped in plastic, bullshittin' got his ass hit\nAin't nothing left now, treated like a stepchild was not for me\nNothing but busters and bitches be rockin' beats, fake in fame\n\n[Verse 2: Yaki Kadafi]\nBlock run and shoot slugs\nWe throw them back like hardballs\nWithout the gloves, no love for these fake desperadoes\nAnd thugs I bleed to envy\nSmoke and blow out they blunts, sippin' Henny\nDrunk nights, and hot days\nCockin' my heat, shootin' it sideways\nA life on the run, full of common blunts\nUnconditionally married to my gun\nFulfillin' my destiny on knees and one's desires\nBe pullin' all my cabbage like priors, stuck in the trance\nSearchin' for something higher, the fortune and fame\n\n[Chorus: 2Pac]\nOne thing we all adore\nSomething worth dyin' for\nNothin' but pain, stuck in this game\nSearchin' for fortune and fame\nSomething we all adore\nSomething worth dyin' for\nIt's been nothin' but pain, stuck in this game\nSearchin' for fortune and fame\n\n[Verse 3: Young Noble]\nSearchin' for fortune and fame, lost in the rain\nA lost of the game, with life is the cost of the game\nWe forcin' the change, motherfuck flossin' a chain\nAll the blame belongs to the part of the brain\nThat we never use, nigga, plus my heart is in pain\nAnd if I ever lose, homie, bet I'm at it again\nOutlaws don't die, so united we stand\nAnd if family come before, all the fortune and fame\n\n[Verse 4: Napoleon]\nAs I walk up in the crib, laid to rest my head\nSay salaam to the angels, hope they bless my bed\nHope they bless me the righteous way\nGot a homie locked down outta town, I sent him a kite today\nMan, that hate in your heart you gotta cleanse it, dawg\nPrayin' for my downfall, and I can sense it, dawg\nI was passed down the street fame\nLike Glocks clocked and keep aim\nWas raised up with a clock box\nAnd I ran with the local street gang\nThey say the light is faded but still shine in the dark\nYou can easy been a man, but you's a boy in your heart\nAnd that's some game that I got from generation of game\nIn the road of life, dog\nWe need to switch up lanes – think about it!\n\n[Hook: 2Pac]\nOne thing we all adore\nSomething worth dyin' for\nNothin' but pain\nStuck in this game\nSearchin' for fortune and fame\nOne thing we all adore\nSomething worth dyin' for\nBeen nothin' but pain\nStuck in this game\nSearchin' for fortune and fame\n\n[Verse 5: Kastro]\n\nI can't complain, I've seen my fair share of the fame\nIt won't change me, now I've got this piece of change\nI feel strange, I got so used to the hood\nThat when I finally got out at first it ain't feel good\nI was just a baby, still retarded from slavery\nWhen we struggle to shovel shit ain't nobody saved me\nGhetto ain't made me, I made myself\nPoverty raised me, thinking ain't no help\nI pray for my health, my mind, and my family too\nState of myself, my grind, and my family crew\nWhere one hand washes the other\nNo, we ain't blood, but we still real brothers\nThe struggle is real, nothin' can steal what we build\nAnd that remains the same 'til the day that we killed\nAnd that's real, life that I was aimed to be\nLove by my family tree, that's fame to me – how about it?\n\n[Hook: 2Pac]\nOne thing we all adore\nSomething worth dyin' for\nNothin' but pain\nStuck in this game\nSearchin' for fortune and fame\nOne thing we all adore\nSomething worth dyin' for\nNothin' but pain\nStuck in this game\nSearchin' for fortune and fame", "image": "https://images.genius.com/4f7dcd7bb697e66f11fe0520838cb066.1000x1000x1.jpg"}], "artist": "2Pac"}