{"songs": [{"title": "Inglorious", "album": "Bastard", "year": "2009-12-25", "lyrics": "[Intro: Dr. TC]\nWell, Tyler...\nUh, it's about that time\nI mean you're a good kid, just misguided\nOkay, so is there anything else you wanna say\nBefore we end this?\n\n[Verse 1]\nMy father died the day I came out of my mother's hole\nAnd left a burden on my soul, until I was old enough\nTo understand that the fuckin' faggot didn't like me much\nHe loved my moms enough to bust a nut and then he Shake Junt\nBring your pops to school day, for twelve years, I cheated\nTold the fuckin' faculty that he was at a meetin' and\nBring that dude to life day, he wasn't at the meetin'\nMade a U-turn on the way there like; \"the fuck am I thinkin'\"\nBirthdays, Christmas, my only fuckin' wishlist\nWas CDs (and a father) and a new fitted\nInstead I got some CDs, inhaler, some Ritalin, some white socks\nI was hyper, 'cause I didn't get attention from my real pops\nCops say I'm supposed to be in jail, but they don't know it's me\nStatistics say that niggas with no father ain't gon' be shit (nigga)\nWell I guess I had one because nigga I'm it\nYou smell that? (Yeah!) That's the odor of success, bitch\n\n[Interlude]\nI know I'm not the only bastard in America\nSo I'm gon' to need some help, on this next part\nScream it with me, niggas\n\n[Hook]\nFuck you (I'm good)\nFuck you (I graduated)\nWithout you (I'm good)\nFuck you (I'm good)\nNigga, eighteen (I'm good)\nFuck you (I'm good)\nGot a car, nigga (fuck you)\nEat a dick, nigga, bitch\n\n[Verse 2]\nFather's Day was the worst when it came to gifts\n'Cause I ain't know for who or what the fuck to get\nNow my momma mentioned the day before what she would like\n'Cause she's playin' both roles, like her occupation was dyke, fuckin' right\nI ain't look up to Obama and Nixon\nI look up to the Hugos and Dixons\nThe niggas in the vision rap about the shit they cookin' in the kitchen\nPushin' keys, like them niggas that were bangin' on the keys\nMy father never seen me, the nigga probably Stevie\nHe bought me a hoodie, a couple albums\nLike that's gon' make up for the years and the tears\nAnd the money that my momma spent on rent and clothes\nYou fuckin' dipped out, I swear to God, if I see you\nI'm a get out the M-16 and let a fuckin' clip out (RRRAAA!)\n'Cause in 16 years, you let your kid doubt the existence, none\nI don't give a fuck either, like father, like son, I'm done\n\n[Bridge: Hodgy Beats]\nHe ain't give a fuck about me\nHe ain't give a fuck about you\nHe ain't give a fuck about we\nSo what the fuck we gon' do?\n\n[Hook]\nFuck you (I'm good)\nFuck you (I graduated)\nWithout you (I'm good)\nFuck you (I'm good)\nNigga, eighteen (I'm good)\nFuck you (I'm good)\nGot a car, nigga (fuck you)\nEat a dick, nigga, bitch\n\n[Verse 3]\nThe cold is nice, and I'm not talkin' 'bout the weather\nThe skin is thick, no need for leather, your father called\nHe said you're better without him, I'm not the only fuck\nWithout them, how to tie a tie and how to get your suit hemmed up\nTake it to the shop, then what?\nFuck it, momma's proud of her asthmatic, thin fuck\nLuck on my brim, Supreme keeps me warm\nWhen the cold blood swarms in my veins, fuck rain in the summer\nThe bummer is the fact that I'm black\nAnd I hang with white Neos whose marrow stays frio\nNow this counselor is tryna tell me that I'm emo\nShe don't give a fuck\nD-low where's the trigger? I'll let this bullet play hero\n\n[Outro: Tyler]\nNah, fuck that\nFuck that\nI ain't deserve this\nI'm over it\nBANG!", "image": "https://images.genius.com/233f9573ead55dd88a580f888cbf3b48.700x700x1.png"}], "artist": "Tyler, The Creator"}