{"songs": [{"title": "When We Ride On Our Enemies", "album": "Better Dayz", "year": "2002-11-26", "lyrics": "[Intro]\nFugees! Fugees and Mobb Deep\nTryin' to diss now too, huh?!\nHahaha! Well, I ain't prejudiced\nI don't give a fuck\nThis is what it sounds like\nWhen we ride on our enemies\nBiatch! When we ride on our enemies\n\n[Verse 1]\nHey, got some static for some niggas on the other side of town\nLet my little cousin K roll, he's a rider now\nWhat they want from us motherfuckin' thug niggas?\nUsed to love niggas, now I plug niggas, and slug niggas\nAm I wrong? Niggas makin' songs, tryin' to get with us\nMust be gone on stress weed, in the West we trust\nTo the chest I bust, then we ride 'til the sun come\nShinin' back to brighten up the sky; how many die?\nHeard the Fugees was tryin' to do me\nLook, bitch, I'll cut your face, this ain't no motherfuckin' movie\nThen, we watch the other two die slow\nCastrated entertainin' at my motherfuckin' sideshow\nBam! Set my plan in mo'\nTime to exterminate my foes, I can't stand you hoes\nUh, now label this my fuckin' trick shot\nMy lyrics runnin' all you cowards out of hip-hop\nWhen we ride on our enemies\n\n[Chorus]\nWhen we ride on our enemies\nI bet you motherfuckers die\nWhen we ride on our enemies\nWhen we ride on our enemies\nBet all you motherfuckers die\nWhen we ride on our enemies\n\n[Verse 2]\nCome take a journey through my mind's eye\nYou crossed the game, don't explain, nigga, time to die\nSay goodbye, watch my eyes when I pull the trigger\nSo right before you die, you bow before a bigger nigga\nNow dry your eyes, you was heartless on your hits\nNiggas love to scream \"peace\" after they start some shit\nPay attention, here's a word to those that robbed me\nI murder you, then I run a train on Mobb Deep—don't fuck with me!\nNigga, you're barely livin', don't you got sickle cell?\nSee me have a seizure on stage, you ain't feelin' well\nHell, how many niggas wanna be involved?\nSee, I was only talkin' to Biggie, but I'll kill all of y'all, then ball\nThen tell Da Brat to keep her mouth closed\nFuck around and get tossed up by the fuckin' Outlawz\nBefore I leave, make sure everybody heard\nKnow I meant every motherfuckin' word\nWhen we ride on our enemies\n\n[Chorus]\nWhen we ride on our enemies\nMake sure everybody die\nWhen we ride, on our enemies\nWhen we ride on our enemies, hehe\nI make sure everybody die\nWhen we ride, on our enemies", "image": "https://images.genius.com/4f7dcd7bb697e66f11fe0520838cb066.1000x1000x1.jpg"}], "artist": "2Pac"}