{"songs": [{"title": "Stay Schemin Freestyle", "album": null, "year": null, "lyrics": "Uh I say one life to live\nSo nigga Im a ball till I fucking fall\nLike September gone hell a hall\nNiggers act like they dont remember when I was selling raw\nBut since they run their mouth like bitches they can tell them broads\nHow I came through\nPanama fling blue\nEverybody bust down\nAnd Im with the same crew\nHalf my homies selling dope\nThey dont got the same view\nBut we got the same goals\nI used to work that same old\nI used to sell them same\nTryna touch a hundred mill\nTwenty four with a ghost\nI swear my life is hell a real\nTook them babies out the hood\nPut my momma up on that hill\nGot the weight up off my shoulders\nTell them that its time to kill\nAll the sudden all these older suckers mad\nCause only 24 and buying shit they wished they had\nIs it my bad?\nOr Is it my fault?\nLife I live and shit I talk\nHoes I hit and the whips I park\nWhen I did that bit they forget that part\nAnd its all so cold\nWhere grown men cry\nAnd old men die\nBut I ain't fold\nDid them my time\nNone of them hope he die\nBut Im gonna live\nLike MIA\nSunday we lie\nWe in that viv\nAnd when we dib\nWe fly G5 nigga\nI used to have a million and a bad bitch\nBut now I got it I treat it just like my last bitch\nGot another one\nHotter than a double sun\nReal homies love me cause they feel just where Im coming from\nOld heads been balling\nI ain't talking running gun\nUse to chase the paper now the money I be running from\nAh every day I wake up I just pray to god\nThat I get my cake up and I stay alive\nPac Man Pac Man\nRun because the ghost is out\nRoss has bought a new crib\nShit it looked like Oprahs house\nI just bought a new crib\nMy shit looks like his older house\nLast of a dying bread its nothing that I told about\nYall get exported when them bricks get imported\nNiggas ain't important they informants be informing\nGot a crib in Malibu California\nAbout to do Miami\nGot a sting I clear my debt\nI told them do it for ah\nI ride for my niggers dog\nI ride for my niggers uh\nAnd I slide for my niggers dog uh\nI say money in the building everybody spending\nThirty racks on me shit my pockets say I'm winning\nLouboutin sneakers different colors Ill be in them\nKeep a bad chick with me\nI don't own her she a rental\nCause I\nWear em out\nTake em back\nShe know I ain't stingy wit it let her make a stack\nLurking at the dealer fuck around and take this back\nI get so comfy in that bitch I fuck around and I take a nap Zs\nShe ask me where that paper I'm like bitch please\nShout out to the jeweler make my wrist freeze\nThis shit that's on my hip will leave you Swiss cheese\nHit you with the whole clip\nYou get on some bullshit\nI'm a blow this paper like its 2012\nIf getting money was a sin I guess I'm going to hell\nIf stunting on them was a crime I guess I'm going to jail\nAnd they gonna have to give me life cause I be doing it well\nI'm getting money on the regular\nWe don't smoke regular cause nigga we ain't regular\nGot so many pretty hoes number in my cellular\nAll I get is straight cash shit I'm like a register\nI'm balling like there's no tomorrow\nForty on my Audemar\nThirty for this Prezy piece\nI think I got every sneak\nI done hit so many dimes\nPresidentuary sweet\nBack and forth to Hollywood\nMIA like every week\nCan't remember my maps\nCause I got so many but now I'm back\nI came from Hollywood to the trap\nAnd I'm right back in these streets\nRidin' round with this Mac\nAnd I ain't talking about my laptop\nTalking bout the back block\nRiding in a dirty whip\nHammers in the stash box\nHuh? What you know about that?\nI'm spitting bars off the top and they ain't flowing like that\nThey ain't flowing like this\nOld school flow\nFlowing like kiss raspy voice in the VIP\nWith a hundred bottle\nAce of spade doing my thing\nHot 97 they know that I'm going angry\nMy neck, my wrist be all bling\nA lot of niggers catch cases\nThey ain't like me, they'll sing\nWhen its time to see their cell\nI ain't had no bail\nBut had a couple   bitches\nThey was writing me sending mail\nSo I had to hold it down\nAnd now I got the crown\nI ride for my niggers dog\nI ride for my niggers uh", "image": "https://images.genius.com/6929169de7116d41676151bdea5cc773.1000x1000x1.jpg"}], "artist": "Meek Mill"}