{"songs": [{"title": "Live to Die", "album": "Fly International Luxurious Art", "year": "2015-04-28", "lyrics": "[Verse 1]\nAyo gas station Sammy, rich nigga live in Miami\nThey killed him and lived with his family\nHe was drunk spazzin' on a young nigga with cash\nThey did the best to him, whooped his ass\nBloody out, his ear was ripped, they know he loved his music\nThey poked him twice, his gear was ripped\nNinja style, niggas whipped him with a Benz belt, broke his arm\nCrushed his Audemars with whelps\nOn his face, they was slappin' him, fake ass rapper\nOld ass gun, pussy get Tinactin\nMedicine face, nigga, they opened his mouth\nA few gold fell out, wheel him out\nHe thinkin' he a gangsta? Quit playin', listenin' to Sid and them\nBecause he sat up in bed to bid with 'em\nFishcakes, bubblegum shrimps in his Timbs\nHe had 12 and a half on, only wore 10\nNiggas is lame, and I'm sayin'\nAll that hard, no damn frame, how you playin'?\nThought you bubble with the big Willies, flyin' in fast cars\nAnd get busy, now he sittin' there lookin' dizzy\nDon't look at Chef, nigga look at your rep\nWhat dinosaur game you playin'? They playin' death\nTax man comin', you can feel it\nBesides, hold the ratchets in both arms\nThey gave it to him, peel it\n\n[Hook] x2\nKill niggas, let it die, live with the feelings\nWe don't know no other way, just get millions\nPyrex kings and the cartels, connect in Scarsdale, put your money up and [?]\n\n[Verse 2]\nIndian Femi from Toronto\nHim and his horse, [?], two wild sopranos\nRunnin' through ice, and niggas fall back\nThey bumped in the crunch, [?]\nUsed to wash them niggas up for chump change\nSomethin' was strange, feds was listenin', ran out of the gun range\nSon I feel vibes, not knowin' this was the time\nTo get away, but they rolled on alive\nBlack freeze out of the bushes, [?]\nBig three pound, four of them were beams\nWhen they rushed him they cuffed him, we cussed them\nYo what the fuck? You doin' life, lil' nigga, who the sucker, what?\nBlack was mad, he went for the cop's mag\nThey started [?], the shot rang, that's bad\nBlack fellow was [?], like 33 Ds\nLet off 100 shots, went mad\n\n[Hook] x2", "image": "https://images.genius.com/b9cf0aa51ef52878688776969ae84d35.1000x1000x1.jpg"}], "artist": "Raekwon"}