{"songs": [{"title": "Venus", "album": "The Ruler’s Back", "year": null, "lyrics": "All the lonely guys.. {*echoes*}\n\nJust gettin' off my job, ‘round Wall Street, with the ties on\nFinest girl, a brother think he ever set eyes on\nNice day, weather sunny, as he made a run for honey\nWith a warm personality, well it’s on the money\nI’d have tounged her right there, seemed kinda fun up there\nWonderin’ there, as he tellin' me he could get the underwear\nMeanwhile, still jockin' her, like a real sucka\nSister which was so fine, she could have AIDS, I’ll still knock her\nHeart beatin' for her since a brother didn’t figure meetin'\nAs I ask her if she’s single, “yeah, caught my nigga cheatin'”\n“Nice to meet ya”. Leaves… she had dope combined features\nWatched her walk away and observin' the fine creature\nNext day again, went in uninvite[d], super angry with us\nRan into so much that her and her friends had start to hang with us\nThey pair and move, though fine, they both swine\n“Can I take you out to movies wine, dine, the whole nine?”\nShe condones, good riddance, nigga slid this on her\nDidn’t want to get to bone her, though I knew I didn’t own her\nAnd I could’ve made a move, a little will power ‘cause although\nThat she told me she liked him as a friend and that was all\nAnd since hang with us, she already told her, cool he freaked her\nThe week on my birthday bought me a pair of Gucci sneakers\n“Did she like me?”, racin’ the thought. “Was it a sign?” Guess it weren’t immoral\nWhen she saw me, definitely this is kinda special\nSince for this dish, none abate, but everybody wanna play\n“How long is money gonna wait?” So I asked a honey on a date\nAnd she accepts, though thought it wasn’t much [of] a plan\nWindows on the world, even had the nerve to touch her hand\nThough not lookin' at. Bashful? No sir\nSuppose I was so shy and then the hon' pulls closer\nThought “clever hint”, so what she straight, never been so excited\nAnd convinced, kiss, in heaven ever since\nHoldin' her hand too, chillin', future plan to build\nCouldn’t believe my dream fulfilled and then that girl began to ill by sayin'\n\nLady if you will\nSay you’re the one that sent for me to thrill\nSomeone that I can hold close in my arms\nWith all the charms of you\nAll the charms of you\nOf a lady, this world is just for ladies\nA heart screams out to ladies\nA world of love’s for you", "image": "https://images.genius.com/f966841215ba401665c2c00044999e50.500x500x1.jpg"}], "artist": "Slick Rick"}