{"songs": [{"title": "Street Bullies", "album": "Apollo Kids", "year": "2010-12-21", "lyrics": "[Intro: Sheek Louch]\nGeah! Aiyyo Starks, whattup?\nWhat it do family?\n\n[Hook: Ghostface Killah]\nWe street bullies for cheddar, and that's our word\nPop bottles and spend money on chicks with curves\nWe the youth poetic justice, the kings and the Yankees\nOur flows is vicious, check check, check out my melodies\n\n[Shawn Wigs]\nWe gifted with vocab to make the streets spaz\nAnd I'm infatuated with money like Mr.Krabs\nBlow bags of that purple 'til I'm purple like Grimace\nBurn spinach cause it keep up flows, Shawn's a menace\nEven Barack watch \"The Wire,\" the streets is political\nWatch how the '89 analog switched to digital\nIt's a miracle, we gettin rich, offa visuals\nMillionaires open doors, split them residuals\nAnd still don't know how to act, spend 5 beams on jeans\nSteady blowin cream by the stack\nI get my change, now go cop, get'cha a drink\nAnd have a ho butt-naked washed up by the sink\nBlowin stink, and I don't see grass on the field\nSo I'mma tear ass on that field\nThe Doe Wilson walk around with a bottle of Spades\nDiamonds lookin like I flossed in a cascade\n\n[Hook]\n\n[Sheek Louch]\nDee dee dee da dee, dee dee dee dee da dee day\nYou asked for Donnie G oh won't you please come out and play\nThey know I keep that black girl, the black guns and the AK's\nI'm comin where you lay, and yeah I'm gonna spray - hey!\nMotherfucker what'chu lookin at? The crook's back\nStaten Island got my back, Brooklyn niggas let it clap\nHalf these niggas ride out, Harlem niggas keep it real\nBronx got a shorty there, that's my little hideout\n{?}, Rose, Donnie cake, souflee\nM6, no top on it, toupee\nRubber grip, stainless steel, the night look gray\nYeah, this that fly shit, patch over the eye shit\nSlick Rick, bruh, these bitches be on my dick\nYeah I'm the new draft pick, about to get my ass licked\nStreet bullies blastin, you ain't gotta ask it\nGhostface, Wigs, will put you in a casket\n\n[Hook]\n\n[Sun God]\nCan I, kick it? Yes you can\nCan I, kick it? Yes you can\nCan I, kick it? Yes you can\nWell I'm gone - are you gonna miss me when I leave?\nBesides this 8 times 5, got tricks up in my sleeve\nGuaranteed, ain't nobody around these beez\nSee the team, we don't sleep, cause niggas need green\nWe bleed different, we chase money, y'all can chase dreams\nCame a long way, don't fuck that bread up in between\nTell 'em God sent you, load up that wop and let it ring ock\nIt's more than raindrops, when your nigga name get scratched off\nLike his name dropped, that's when that thang pop\nY'all niggas thought once too much, that's why your brain stopped\nLock and load both of them 40's I make the place hot\nYou can't wipe that up with no shirt, that take mops\nOut the window here's another bomb let that bass drop\n\n[Hook]", "image": "https://images.genius.com/f48f03bc4acc3c9c4ddc676ddc586579.1000x1000x1.png"}], "artist": "Ghostface Killah"}