{"songs": [{"title": "I’m The Best", "album": "Pink Friday", "year": "2010-11-19", "lyrics": "[Intro]\nUh, yo, yo\n\n[Verse 1]\nIt was back in '07 did a couple of tapes\nDid a couple DVDs, made a couple mistakes\nDidn't know what I was doing, but I put on the cape\nNow it's, \"Which world tour should I go on today?\"\nSee you told me I would lose, but I won\nI might cop a million Jimmy Choo's just for fun\n'Cause bitches couldn't take what was in me Australia, Sydney\nMight run up in Disney, out in LA with Lindsay\nGot the eye of the tiger, the Lion of Judah\nNow it's me and my time, it's just me in my prime\nEverything I tried to teach 'em, they gon' see it in time\nTell them bitches get a stick, I'm done leading the blind\nGot two shows tonight that's Brooklyn and Dallas\nThen a private party at the Buckingham Palace\nWhich means I gotta fly like a movie no commercial\nThat's Young Money, Cash Money\nYeah, I'm Universal\n\n[Chorus]\nI hear they comin' for me because the top is lonely\nWhat the fuck they gon' say?\nWhat the fuck they gon' say?\nI'm the best bitch doing it, doing it\nI'm the best bitch doing it, doing it\nI'm the best, best, best, best\nI'm the best, best, best, best\nI'm the best\n\n[Verse 2]\nI remember when I couldn't buy my mother a couch\nNow I'm sitting at the closing, bought my mother a house\nYou could never understand why I grind like I do\nMicaiah and Jelani, why I grind like I do\n'Cause even when my daddy was on crack, I was crack\nNow the whole album crack, you ain't gotta skip a track\nI ain't gotta get a plaque, I ain't gotta get awards\nI just walk up out the door, all the girls will applaud\nAll the girls will commend as long as they understand\nThat I'm fighting for the girls that never thought they could win\n'Cause before they could begin, you told them it was the end\nBut I am here to reverse the curse that they live in\nGot two bones to pick, I'mma only choose one\nYou might get addressed on the second album\nWhich means you can breathe 'til I motherfucking say so\nTo all my bad bitches: I could see your halo\n\n[Chorus]\nI hear they comin' for me because the top is lonely\nWhat the fuck they gon' say?\nWhat the fuck they gon' say?\nI'm the best bitch doing it, doing it\nI'm the best bitch doing it, doing it\nI'm the best, best, best, best\nI'm the best, best, best, best\nI'm the best\n\n[Bridge]\nIt's okay\nIt's okay\nLong as you know\nLong as you know\nLong as you motherfuckers know\nI'm the best, best, best, best, best, best\n\n[Chorus]\nI hear they comin' for me (I hope they comin' for me)\nBecause the top is lonely ('Cause the top is lonely)\nWhat the fuck they gon' say? (What they gon' say?)\nWhat the fuck they gon' say? (What they gon' say?)\nI'm the best bitch doing it, doing it\nI'm the best bitch doing it, doing it\nI'm the best, best, best, best (I'm the best)\nI'm the best, best, best, best (I'm the best)\nI'm the best", "image": "https://images.genius.com/44a8be97aef4cdd5114bd6cec02b2357.1000x1000x1.png"}], "artist": "Nicki Minaj"}