{"songs": [{"title": "Why You Ain’t Call Me?", "album": "Killer", "year": "2008-06-01", "lyrics": "[Intro]\nTo whom it may concern..\n\n[Hook]\nWhy you ain't call me?\nYou know I'm the hardest, you know that my art is applauded\nWhy you ain't call me?\nI'm not broken-hearted, but it could have been on when I started\nWhy you ain't call me?\nYou know I'm the hardest, you know that my art is applauded\nWhy you ain't call me?\nYou sleep on my music and that's a damn shame 'cause I slam my thang\n\n[Verse 1]\nI've been inside every hip-hop circle you could imagine\nGangster or Pop, even backpackers know that I'm real good at rappin'\nI was strugglin' back in the day when my hood was lackin'\nYo, so I'm 'bout to talk about what should've, would've and could've happened\nIf music was about innovatin' and penetratin'\nGenerations by generatin' musical integration\nIt wouldn't be about limitation and demonstratin'\nImitation we then are blatantly just disintegratin'\nIt ain't about the music, it's just about the fame\nIf you ain't popular homie, then you just out the game\nIf video and radio don't frequently announce your name\nThey don't know your music even though you blow most out the frame\nBut a closed mouth don't get fed when it stays shut\nLay cuts with Tecca Nina 'cause he can straight bust\nSay what? You ain't heard of me gettin' paid bucks?\nTouring, y'all see me rippin' the stage up\n\n[Hook]\nWhy you ain't call me?\nYou know I'm the hardest, you know that my art is applauded\nWhy you ain't call me?\nI'm not broken-hearted, but it could have been on when I started\nWhy you ain't call me?\nYou know I'm the hardest, you know that my art is applauded\nWhy you ain't call me?\nYou sleep on my music and that's a damn shame 'cause I slam my thang\nWhy you ain't?\n\n[Verse 2]\nI've been on tour with Hov, 'bout 27 shows\nWhy he ain't have me on a record only heaven knows\nMaybe he missed us, missin' the big picture\nThat this is a fixture, aw yeah, he got Twista!\nWell Twista's my homie and we both from the Midwest\nAnd I guess Hov ain't lookin' for another speedy rapper kid yet\nMe collaboratin' with them was all in me dreams\nMatter fact the only one of 'em called me was Beans\nHe told me he played you \"The Industry Is Punks\"\nAnd you loved it so you know Tech is what the industry would want\nI started down at the bottom, got with TOG and then it paid\nBut I would've loved to been on the third verse of \"Renegade\"\nThey must think I'm a stick of dynamite with no stem\nThat's probably why I got D12 but no Em!\nBut I burst flame and I bet that y'all know my first name\n'Cause I'm the hardest this side of Earth, mane\n\n[Hook]\nWhy you ain't call me?\nYou know I'm the hardest, you know that my art is applauded\nWhy you ain't call me?\nI'm not broken-hearted, but it could have been on when I started\nWhy you ain't call me?\nYou know I'm the hardest, you know that my art is applauded\nWhy you ain't call me?\nYou sleep on my music and that's a damn shame 'cause I slam my thang\nWhy you ain't?\n\n[Verse 3]\nThis ain't no hate-mail, this a love letter\nI love you niggas' music and I hope it does better\nI just wish you woulda hit a brother that love cheddar\nBut I'm ballin' now and I'm better than I was EVER\nSpace age flows like Jesse and Primrose\nTenfold, I used to open-up, now I end shows\nGrim road, when you one of the best with slim dough\nAnd you ain't got Dre, Storch, Pharrell and no Timbo\nI've met almost half of the DTP\nBut the couple times I spoke to Luda, don't think he see me\nHad never met I-20 but he spoke at BET\nShawnna love me, Field Mob and Chingy decently speak me\nSo I'ma reiterate the game it's all fame\nAnd you don't get no play if you an emcee with a small name\nIf I wanna get on TV I guess I gotta call Pain\nAnd Nelly, my great-grandmother's name is Maude Haynes\n\n[Bridge]\nMaybe I'm trippin', full of delusion\nMaybe it come from all the drugs I was usin'\nMaybe I am the best thing that you ever saw\nMaybe I'm wrong and you don't know me at all\nI guess I'm blinded, I got reminded\nThat none of you just will never know who the N9ne is\nAnd you never heard of the homie from the Show-me\nPUNK THAT! I know you niggas know me\n\n[Hook]\nWhy you ain't call me?\nYou know I'm the hardest, you know that my art is applauded\nWhy you ain't call me?\nI'm not broken-hearted, but it could have been on when I started\nWhy you ain't call me?\nYou know I'm the hardest, you know that my art is applauded\nWhy you ain't call me?\nYou sleep on my music and that's a damn shame 'cause I slam my thang\nWhy you ain't call me?\nYou know I'm the hardest, you know that my art is applauded\nWhy you ain't call me?\nI'm not broken-hearted, but it could have been on when I started\nWhy you ain't call me?\nYou know I'm the hardest, you know that my art is applauded\nWhy you ain't call me?\nYou sleep on my music and that's a damn shame 'cause I slam my thang\nWhy you ain't?", "image": "https://images.genius.com/ce6124bde0d76994fd0d3a8ddb1d4e97.1000x994x1.jpg"}], "artist": "Tech N9ne"}