{"songs": [{"title": "BET 2015 Sprite Cypher - Joyner Lucas", "album": null, "year": "2015-10-13", "lyrics": "Uh, yo, what up, what up\n\nWhat up Dre? What up Khaled?\nIf you don't know me now\nThen you will, dont worry about it\nI used to wanna be friends and tell everybody\nBut now I  wanna be mad and just kill everybody\nSee everybody watching, like\n\"Who does he think he is?\" like\n\"Who the hell is this kid?\" and\n\"Why the hell is he here?\" and\n\"Who told him we care?\" like yo\nI'm Joyner Lucas, by the way, hello\nYou don't remember my face\nOr ya'll didn't get the memo?\nAt some point, I gave all you niggas my demo\nYou hopped inside your limos and threw it out the window\nMan it's no wonder why nobody called and tried to find me\nNo wonder why nobody flew me out and tried to sign me\nThey said this game is full of hoes\nAnd then I thought of Miley\nThey told me \"get her while she young\"\nAnd then I thought of Tyga\nOr Kylie, whatever\n\nI gotta say a few things\nAnd this wasn't supposed to happen\nBut I made it this way\nAnd now I finally get the chance to hit the stage for the day\nAnd address all the things that I swear I've been waiting to say\nOkay let's get down to the itty gritty\nYou nitty bitty rappers softer than Pretty Ricky\nAnd smaller than Iggy's titties, I shit in your kitty litty\nAnd if I died and came back, I'm bringing Biggie with me\nI ain't got no top five\nI'm top five of your top five\nBut I'm not trying\nI'm 6'3\", you 5'5\", but you not Plies\nI'm pop-eye, I'm Fetty Wap\nWith a cocked-eye\nYou in for a rude awakening, I hope you awake\nI went to Meek's crib and told him that I'm cool with Drake\nKendrick told me this is competition, who is safe\nAnd shoutout to my exes, ya'll done made a huge mistake\n\nWhen am I gonna win an award?\nWhen are ya'll gonna realise that I'm kicking in doors?\nWhen Dre gonna realise I ain't no shit to ignore?\nWhen Diddy's butler gonna come and get my shit at the door?\nHuh?\nNow YouTube Joyner Lucas, follow me and stay\nI hope that Charlamagne'll give me Donkey of the Day\nI hope [?] never drop no bombs on me\nThey gonna need some military bazookas and nine armies\nNever been running your mouth\nInstead I'm putting my gun in they mouth\nA thug and I'm coming around\nAnd taking they sweater, they woman, and duck and I'm out\nThinning it out\nSomebody calling you out, you ready to move?\nJoyner get women, I'm setting the mood\nAnd all of the niggas they get in the booth\nI'm telling the truth\n\nSo what's an MVP when you strategising?\nAnd what's an STD if you're Magic Johnson?\nWhat's a BET Cypher without me involved?\nThis ain't even what we all thought it was\nWe was wrong\nJoyner", "image": "https://images.genius.com/878e845295c819856874c2de04d464e7.794x794x1.jpg"}], "artist": "Joyner Lucas"}