{"songs": [{"title": "All Praise Due", "album": null, "year": "1999-01-01", "lyrics": "[Intro: Mos Def talking]\nA lot of people wonder...a lot of speculation goin' on about...who's in control. Who is God? Who's on top of this thing? Am I God? Is God in me? Well I got the answer. Let 'em know. 'Bout to give it to y'all. Let 'em know oh oh. It goes like this\n\n[Hook]\nGod make the world get up and move\nGod make the world go round\nGod make the moon rise high\nGod make the sun [?] Allah, a ha ha\nWe are, we are, the grand groove, grand groove\nGod make the world get up and move\nGod Allah make world the get up and move\nAllah make the world, God make the world\n\n[Verse One]\nYo check\nAll praise due to the Merciful and Beneficent\nSovereign universal dominate black element\nThat's the space, ancient like Sanskrit\nEven though man made transmit my transcripts\nAnd they can't be tamped with\nAllah protect this\nI make jams for crime clans and working class fams\nAnd all y'all mans who eat aci with chams\nAnd heads in the flats who dispatch the dollar vans\nYoung kids in badlands with great escape plans\nWho eat most of they meals outta boxes and cans\nCasualties and cutbacks of social programs\nDedicated\nTo all those who rode slave ships\nWho screamed and cried but survived the ride\nI know that my life is better cause you weathered the tide\nHarder work on this side making truth magnify\nDevils can't stop me, but they damn sure try\nShine the light on the Earth that receive and radiate\nAin't no surface I've seen that's too dense to penetrate\nThere are plans by many hands to make us deviate\nSo I speak on plates so that all good life regenerate\nBaby ain't no time to deliberate\nHe put the wonder in the world let's activate\nLet's activate, let's activate, let's activate\nCause\n\n[Hook]\n\n[Verse Two]\n\nYou know I ain't gotta lie to you\nGod made the world get up and move\nYou know I ain't gotta lie to you\nGod Allah made the world get up it's true\nYou know I ain't gotta lie to you\nGod made the world get up and move\nYou know I ain't gotta lie to you\nGod Allah made the world get up it's true\nYes you know I ain't gotta lie to you\nGod Allah made the world, Allah made it all\nAllah made the world, Allah made it all\nAllah made the world, Allah makes it all\nAllah made the world, Allah controls it all\nAllah makes the world, Allah controls it all\nAllah made the world, Allah controls it all", "image": "https://images.genius.com/4d1a9757d430776710118a3e0ba4658f.1000x667x1.jpg"}], "artist": "Yasiin Bey"}