{"songs": [{"title": "We Run N.Y.", "album": "Dare Iz a Darkside", "year": "1994-11-22", "lyrics": "[Production by Reggie Noble]\n\n[Intro: Dr. Trevis, Hurricane G, Redman]\nHahahahahahaaaaa\n[KRS-One] Watch out!\nGeyeeah! As we take a journey to the darkside\n[KRS-One] Watch out!\nFrom Hell and beyond, the knotty-headed nigga era has triumphed\n[KRS-One] Watch out!\nA new ever! If you don't know, your bitch ass better\n[KRS-One] Watch out!\nAxe somebody! Shoot em up!\n\n[Glo] The Hurricane G is live and in color\n[KRS-One] Watch out!\n[Glo] We run you motherfuckers!\n[Red] The Funk Doctor Spot coming live and in color\n[KRS-One] Watch out!\n[Red] We run you motherfuckers!\n[R+G] Puffin mad spliffs, so fuck a bitch\nAnd a nigga, cause niggas, and bitches ain't shit!\nHahahahahahaaaa! Dr. Trevis\n[KRS-One] Watch out!\nIs in the motherfuckin house\nWith a couple of sick patients for your bitch ass\n[KRS-One] Watch out!\nYeahhh!\n\n[Verse 1: Hurricane G, Redman]\nThe Hurricane G is the ultimate funk, pop the trunk\n(Hoo-hah!! Wild like Shaolin monks)\nRepresentin', comin' out of Brooklyn, Flatbush\nYou wuss, you can't push push in the bush\n\nWell uh, let's take a journey to hell and beyond\nWhere the bomb grows on palms, and bags labeled Cheech and Chong\nThe Jimi Hendrix of rap, I got an afro and\nBandana, then I rock jams like Santana\nI move MC's like niggas move keys uptown\nRed and Hurricane G, SO HOW YOU LIKE US NOW?!!?!\n\nChorus: repeat 4X\n\n[KRS-One] Watch out! We run New York\nYeah\n\n[Verse 2: Hurricane G]\n(Hurricane G hit em one time)\nFrom the Brook, taught how to trick by the real gangsta crooks\nSo I hook back what you took!\nI take my funk and my religion serious\nSanctify y'all and leave y'all house niggas delirious\n(hahahahaa) cause I'm furious!\nHow dare you motherFUCKERS, forget about the ultimate\nFunk, BITTTTTCH nigga!\nI got your wicked witch with a switch\nMotherfucker, fuck you and your crew!\nSo what nigga, is it you wanna do?\nIn ninety-fo' I kick the wicked for the bitches\nFor the real trick deez who can dig it\nCause after pop thought all that, Hurricane stay fat\nWord to my big dick boriquas in the back\nThe queen of the East coast, funk gangsta pack buddha\nOn the rhyme since eighty-nine\nIt's all in your mind, but what's yours is mines\nYour dough and your hoes Bump N Grind to my rhymes\nNow! It ain't a nigga who could hang\nOr pop yang, about a motherfuckin th-a-a-a-ang\nAnd uh, fuck any bitch who can't hang\nI'm representin bitches universal!\nIt go, one for the biz, on the bizness\nWhich y'all blesses with God's blessings, do you see?\nHurricane and Redman original steel\nLatin Queens in the house!!\nSo nigga swing it over here on these big fat tits!!\n(Titties, hahahahahaa)\n\n[Verse 3: Redman]\nThe Funk Doctor Spot, blast up on your block\nI'm walkin through the sewer with manure on my socks\nYour style, I freaked it when I was a child\nSo you talkin that baby talk like, Who's Talkin Now?\nVerbally I crush, brains erupt\nBlow your focus, like you sniffin angel dust\nRun of the mill I'm not, watch me kill a cock-sucker\nAnd cause ruckus, like them L.O.D. motherfuckers\nEvery verse every word I preach\nRepresents the East, long as the human eyes can see\nGimme that funk funk funk funk funk funk funk funk beat!\nI light a blunt for niggas up in Sing-Sing\nI do it to death, style is funk that's fresh\nRemove your vest, you just won the wet t-shirt contest\nAnd I'm hotter, than the Globetrotters in the Bahamas\nI got a pair of pajamas made out of ganjah and almonds\nEager, as a nigga wantin my shit to dub\nCause my shit be BANGIN like the Crips and Bloods\nTroop, I flew the coop like Big Bird in Timb boots\nI Skywalk the planet like my code name was Luke\nFrom the darkside, I'm from the darkside Pah\nI'm Above the Law like Steven Seagal\nMotherfucker!!\n\n[Outro: Dr. Trevis]\n[KRS-One] Watch out!\nHahahaha, we take you to the darkside\nCome travel\n[KRS-One] Watch out!\nOn our metaphoric futuristic type shit\nAs we blow your brains like spliffs\n[KRS-One] Watch out!\nDr. Trevis is outta here\nFor the nine-fo' you stank... bitch\n[KRS-One] Watch out!\nYeahh\n[KRS-One] Watch out!", "image": "https://images.genius.com/d90c906f33a174fa71425b4dd339eb96.1000x1000x1.jpg"}], "artist": "Redman"}