{"songs": [{"title": "Heartbeat", "album": "I Got Next", "year": "1997-05-20", "lyrics": "[Intro: Redman]\nAlright everybody move back from the ropes\nIf you don't move back we're gonna turn this music off\nAnd that's my word, move back!\nWord is bond let's get this shit goin\nWord up, it's the Funk Doc in the house\nSay hell yeah!          HELL YEAH!\nSay fuck yeah!          FUCK YEAH!\nWord up, it's the Funk Doc Spock you don't stop\nIt's my man KRS you don't stop\nIt's the girl Angie you don't stop\nWith the hah haha ha haha hah!!\n\n[Verse 1: Angie Martinez]\nIt's the Butter Pecan Rican speakin', deletin'\nOther radio jocks that think they competin'\nThey pre-sweetened, like candy, I'm hot like pepper\nBig up to Sandy but my name is Angie\nMartinez, what a true microphone fiend is\nSteppin up lovely with MY, A...DIDAS\nThrough your speakers, representin\nBoriquas, and all hip-hop rhyme seekers\nYou may think I'm crazy right, but I'm crazy hype\nSlay this nice y'all, everytime Angie grab the mic\nI jams it right tonight, not the hardest\nBut peep the style of this Puerto Rican Goddess\n\n[Interlude: Redman]\nAiyyo yo yo yo, stop the music!\nAiyyo back up off the ropes, man, word up!\nYo get from the off the ropes\nNow aiyyo yo yo, KRS-One, come again the selector!\n\n[Verse 2: KRS-One]\nIt's been a long time but we made it, you waited\nYou gettin frustrated cause these MC's in trainin\nSkills on the mic for a royalty save it\nPullin down rap so that others can't make it\nThey can't fake it in front of KRS they naked\nThat same old MC trend I'm here to break it\nThe highly conceptional multidirectional\nHot in ninety-seven so I guess I'm flexible\nRap relieve stress so yes I guess it's medical\nAll your wrecking and raping is still theoretical\nRedman, you know you must understand (Whatup?)\nRedman, you know you gots to understand (Hah! Whatup love?)\nAngie, rockin with the one BDP (Ha, haha)\nRepresentin right now at Hit Factory\n\n[Verse 3: Redman]\nOne two hah, and you don't quit\nIt's Kris and Angie with the ultimate\nOne two hah, and you don't quack\nIt's Funk Doc smoke weed and don't smoke crack\nHahaha, hah, and you don't quit\nHoohahhahah, and you don't quit\nI rock jams like, Samsonites with mics\nStage two boomin system and flood the lights\nThe lyrical, fo'-fo's lettin off like suppose\nReggie Reg is rockin on the ra-dioooo!\nHahh, huh, the oooh-child too chill\nCaps peeled, Someone In My Bed like Dru Hill\nRaise em up, cause I feel my spot can't be touched\nNo time for the Pauline jack, hit the clutch\nShotgun what?? It's the high exalted\nRuler of the buddha, the cash make my pockets\nStick out like a tumor, for the consumers\nI get busy with La Pluma, detonate the bomb\nTo make you hibernate sooner, certified luna-tic\nMy click run deeper than Charlie Tuna\nKahunas, raw for the able key movers\nAll over the hood like them Crooked I coolers\nBang maneuvers, from Jerz to Vancouver\nBack to the Bronx with heartbeats ample looped up\nI Blastmast like Kris, funk abyss\nLike a phone chauvenist with a Roley on the wrist\nSike!  I can afford it, less I slaughtered\nThree platinum niggas and none of em prerecorded\nKRS-One need to be runnin for office\nSo Butter Pecan Rican -- tell them to get off his", "image": "https://images.genius.com/2d8a06de1f39a224dcb05e3e9195e0b4.640x640x1.jpg"}], "artist": "KRS-One"}