{"songs": [{"title": "Outta Ya Mind", "album": "L.A.U.S.D. Result", "year": null, "lyrics": "[Intro]\nWhat the fuck is this... Marcus?\nYour friends are calling me and saying that I gave you shit\nWhat the fuck is that all about?\nAlright, whatever, um [?] Well fuck that Marcus\nWhatever, if you wanna call me back then call me back\nBut I'm pissed because I'm... [?]\nAbout how you told them about me and how I'm a dirty fucking slut\nAnd I'm a hoe and I fuck around with everybody\nAnd you know that I fuck around with everybody\nSo whatever\nUh, guess I'll talk to you later or whatever the fuck you wanna do\n[?] So bye\n\nHa, ha, yeah! Oh! Girl you must be outta your mind\n\n[Verse 1]\nYo, yo, I would just love you, [?] you; have a lot of sex, bitch fuck you\n[?]\nThat don't mean that a nigga gon' want you, want you\nGet up out my face 'cause hoe you, getting on my nerves that's why I never chose you\nRemember that I can find better snatch than yours, than yours\n[?]\nHad his dick chopped off [?] drop off\n\n[Hook]\nI know I'm everything you could want, you could want, oh!\nBut you ain't got what I'm looking for, looking for, oh!\nSo go and find another nigga and stop wasting my time\nYou must be outta your mind, girl\n\n[Verse 2]\nYou the reason I get so violent; can't fix this with a kiss, don't try it\nI don't even want your lips on my lips, all of your bullshit I just don't buy it\nGirl, I don't wanna hear your whining, try not to commend your [?]\n[?] But find another nigga to fill your body\nDon't be tryna' act all stuck up, toughed up, what slut? You'll get fucked up\nRun up on [?] but fuck you\nDisgust you [?]\n[?] (Shit)\nGo and get another dick, here's a riddle for you bitch\n[?] That you can't have at all (It's me)\n\n[Hook]\nI know I'm everything you could want, you could want, oh!\nBut you ain't got what I'm looking for, looking for, oh!\nSo go and find another nigga and stop wasting my time\nYou must be outta your mind, girl\n\n(I know I'm everything you could want, you could want, oh!\nBut you ain't got what I'm looking for, looking for, oh!\nSo go and find another nigga and stop wasting my time\nYou must be outta your mind, girl)\n\nBaby, I know I've been [?] in the past\nBut that's just who I am, and I ain't never gon' change\nI'm sorry baby\n\n[Verse 2]\nCouldn't wait to play your ass like Halo 2\nThought I'd buy you things, I won't get a thang for you\nBreath always kicking like you just ate tofu\nGo get your little friends, what they gon' do?\nShame on you, you ain't able to\nTurn the fellas on, that's why they ain't on you\nSo before you try to land by my way, listen to workout plan by Kanye\nIf you do or don't, I don't really fucking care\nCan't explain how I feel 'cause there's nothing there\nListen girl, there's something I wanna share\nI never took you out 'cause people were gonna stare\nAnd I ain't tryna' ruin my reputation\nI don't even want to be in that situation\nAnd it ain't nothing that I'm special education\nWe never spent time, so there was no time wasted\n\n[Hook]\nI know I'm everything you could want, you could want, oh!\nBut you ain't got what I'm looking for, looking for, oh!\nSo go and find another nigga and stop wasting my time\nYou must be outta your mind, girl\n\n[Outro]", "image": "https://images.genius.com/c35ce5f4e23966aa4f87edff45cc91c2.800x800x1.jpg"}], "artist": "Hopsin"}