{"songs": [{"title": "Kendrick You Next", "album": null, "year": "2013-09-05", "lyrics": "[Intro: 2Pac Interview]\nSo, okay, you want to see some macho shit? I’m the most macho nigga out here. I'm the most.. I thought you niggas knew, I’m the most thuggish nigga out here. I have no mothafuckin’ fear… I have no fear, I have only ambition, and I want mine, and I will do anything to protect and feed my family\n\n[Intro: Meek Mill]\nTake money!\nYeah! Take money! Haha\nUnh!\n\n[Verse 1: Meek Mill]\nFirst off, fucked your bitch, nigga, get a blood test\nYou a upset, nigga, where the love at?\nWhen we talking 'bout Philly, know I fucking run that\nSame place I've been up corners you can never come back\nYou fraud nigga, ball like I'm Chrissy Paul, nigga\nI cross niggas, when you hate it 'cause you lost, nigga\nYou soft nigga, then you disrespect a boss, nigga\nYou dissin' to get you on, that'll get you off nigga\nBroad nigga, and you was screamin' \"come to my hotel\"\nNigga, we was slingin work out the motel!\nNo scale, Barry Reese, I know you so well\nI caught your chick, I pulled that bitch like she a coat tail\nLet's keep it trilla, you ain't never make a dope sale\nYou ain't never played that corner--make a coke sale\nOn a late night, swimmin with the great whites\nYou was rockin' durags, big tees, fake Mikes\nBoy you had a wild week, shoppin' on Canal Street\nSame place you bought your fake chain and your time-piece\nHow we gon' believe you? Nigga I should lead you!\nTalkin' \"PC,\" that was never Beanie Sigel!\nThat was never ME, why you lying to the people?\nI was locked down, still doing shit illegal\nRunning around in jail like, \"I ain't give a hell,\" when\nYou was on PC, locking it with males\n\n[Interlude: Meek Mill]\nAnd I ain't got time for this shit, let me get another one\n\n[Verse 2: Meek Mill]\n23 and 1 never get to see the sun\nHad to get a glass visit just so you could see your son\nTook a deal on your homie, 'cause you couldn't beat the gun\nThey was tryna give you life, man, you know that wasn't right\nThen you left him in the hood, on his head, he had a price\nYou ain't even give a call, other niggas shot him twice\nNiggas trynna get a buzz off my name for some likes\nDead rapper, I'm at you, I'mma give you one tonight\nCa-ssidy! Boy, you so trash to me\nDo the math I dissed you, that's subtract to me\nYou ain't poppin, what the fuck could you add to me?\nYou just another dead body, another casualty\nI'm in the streets, so I do this beat casually\nAnd I ain't even write this shit, why you mad at me?\nCause you nursery rhyming, flow perfectly timing\nAnd I'm giving gas, I'm in the Aston, one Swizzy's designing\nNow beat it, I know you're heated but I know you need it\nI got that Justin Bieber please believe it, nigga I know you see it\nThey play piano at your viewing, let Alicia key it\nI asked Swizzy \"could she do it?\" he said \"nigga, beat it\"\nSwizz don't fuck with you, Melo didn't either\nYou fucked that check up, you bit the hand that feed you\nAnd you was 6 feet, you got me digging deeper\nHold up, let's switch the beat, so I can spit some \"Ether!\"\n\n[Interlude: Meek Mill]\nOh shit! You purple-dickie wearing-, durag-, over-sized fitted-, fake Air 1-wearing nigga!\n\n[Verse 3: Meek Mill]\nI say, come on with your soft ass, all you niggas all trash\nCouldn't bet a 100 grand, nigga, that's a small tab\nI'mma hit him where it hurs, this gon' make his dog mad\n'Cause this verse gon' hit this nigga harder than that car crash\nThat you should've died in, I'm mad that you survived it\nBut I came to murder you and have you scuba diving\nSwimming with the fishes, all you niggas is bitches\nDick riders, knocking on the wood, superstitious\nPause that, I'm all that, I'm really in the trenches\nAnd when I see you, nigga, I'mma have you jumping fences\nCutting through the alleys, you must be on the molly\nSniffing all that white shit and fucking with that Bobby\nCome to your hotel and meet you in the lobby\nJust to Worldstar you and do you just like Tommy...\nHearns did Martin, I burn in the Martin\nThat Aston when I start it like a lion when it's roaring\nBoy you lying, you ain't touring, you can't even get a show\nShit you like a pound of reggie, they can get you for the low\nAnd I'm like a brick of Diesel, it cost 60 for the flow\nYou ain't a gangsta, you a wanksta, nigga, 50 even know, whoa!\n\n[Verse 4: Meek Mill]\nYou say you a gangst,a but you never pop nothing\nAnd you locked your homie out when you heard the cops coming\nRapping for a long time, nigga, you ain't got nothing\nYou ain't wanna battle Mook neither, nigga, stop fronting\nDamn, homie, in high school, you was the man, homie\nFuck happened to you?\nYou had a doghouse with a doghouse in the backyard?\nNow you living in a doghouse in the backyard?\nNigga, I was broke then, now I got Black Card\nYour career maxed out, your shit like a MAC card\nEasy, nigga, I talk greasy, nigga\nAnd I'mma stunt on Instagram just to tease you, nigga\nCouple months we at the funeral\nI swear to God that shit was beautiful\nFive-X tees, durag's, the usual\nYour mama screaming like \"Cassidy what they do to you?\" OH!\n\n[Outro: Meek Mill]\nAnd this shit called \"Kendrick You Next\"\nI'm just on some shit this time around, everybody get it\nYou say my name, I give you a thousand, it's just that simple\nMeek Milly! Enuff, what up?", "image": "https://images.genius.com/6929169de7116d41676151bdea5cc773.1000x1000x1.jpg"}], "artist": "Meek Mill"}