{"songs": [{"title": "What It’s Gonna Be", "album": "The Appeal: Georgia’s Most Wanted", "year": "2010-09-28", "lyrics": "[Verse 1]\nI'm in the zone, they keep on getting offended\nBut I ain't did nothin wrong, but tighten up on my business\nAnd now I'm making millions, everybodys' social\nThey really too emotional, I don't have time to hold em'\n\"I wanna be a billionaire,\" Me too\nSo I can count a billion cash in hundreds on Youtube\nI get dirty money bitches bitches know it's ciroc on my rider\nI'm on stage with Diddy, Nicki, Ricky Rozay and Flo-Rida\nI rock Mauris without money, ball like Stoudemire, Amare\nHold the blunt with my left hand to show my Audemars in Paris\nLook at all the I've accomplished, I just bought me 3 Ferraris\nSpent 5 million in my company if offended you; not sorry\n\n[Hook]\nWhat it gon' be?\nWhat it ain't gon' be, too many chains on me, too many rings on me\nBaby dancing on me, diamonds dancing on me cause my watch and my ring straight dancing on freeze\nWhat it ain't gon' be, dare anybody here to put they hands on me\nToo many stacks on me, so many racks on me, got some killers with some gats and\nWhat it gon' be?\nWhat it ain't gon' be, dare anybody here to put they hands on me\nToo many stacks on me, so many racks on me, got your dime on my line asking\nWhat it gon' be?\n(repeat x1)\n\n[Verse 2]\nI'm a mathematician young street magician, and I keep on taking pretty girls to Lenox\nNew Mercedes with 80 in it, watch me spend all 80 in 80 minutes\nSaks & Fifth, young true religion\nBought a car so sharp it make the feds suspicious\nThey say I'm too flamboyant, I say they're malnutritioned\nI'm in a rare edition, I think Le Mans edition\nDare anybody here to put they hands on me\nToo many stacks on me, so many racks on me, got a dime on my line asking\nWhat it gon' be? What you gon' do Gucci, when you gon' leave?\nStill popping bottles pouring liquor on chicks; no need to lie I'm such a freak\nNo need to hide, you so unique I'mma try to beat ya back down til' you weak\nSay you ran out of money then more for me, here's more for you, cause you a whore for me\nDon't be a whore for free cause we could ball right now, we\nCould do this 2, 3, 4 times a week\nFrom Zone 6 down to Camilton, I pull up in that yellow thing\nI put rims on, everything\nHoes think I got them wedding rings\n\n[Hook]\n\n[Verse 3\nLike I'm in the lead, throwing money high, I don't care where it reach\nSpent 2 G's a week on haircuts, like 4, 5, 6, 7 times a week\nThese girls petrified, almost scared to speak\nI'm in a new GT with the Georgia peach\nGot a condo right off the Florida beach, It ain't hard to reach, so nice to meet\nEvery night with me you probably fight with me\nSex fight on me and spend the night with me\nNo rules, everything alright with me, nice shape baby\nShaped just right for me\nCatch ball players in magic city show them boys how good my jumper is\nMaking all pros look like amateurs\nI just showed my ass last night I had a blast\nMy jewelry was so bright haters put theirs in the trash\nPulled up in something fast just to make them haters mad\nRims with the paper tag, paper bag full of cash\n\n[Hook]", "image": "https://images.genius.com/0ad1fedc3017fe83eecd678c80831b9e.400x400x1.jpg"}], "artist": "Gucci Mane"}