{"songs": [{"title": "Where Ya At (Remix)", "album": "Renzel Remixes", "year": "2015-11-11", "lyrics": "[Intro]\nEarly morning on the balcony in my Versace briefs, nigga\nOcean splashes against the stones\n\n[Verse 1]\nRollin wit it it be too heavy to hold it nigga\nRollin hop out hit you right in your emoji nigga\nStories commonly echo throughout the battlefield\nFamiliar faces fire from inside a Cavalier\nWhere were you when we squadded up to retaliate\nPardon my French, German Ruger inside the Palisades\nSun seekers and (?), let's have a yacht parade\n200 feet too long for the Feds to come confiscate\nIn the mall I make her smile like Arsenio Hall\nFront or back I fuck her raw while accepting my calls\nWhen in right or wrong, still I'm reciting my songs\nKid dynamite, this why they call me the bomb\nTook another date, landed in another state\nThis a lot of raw dishes on my dinner plate\nNo squid, no crab, all I want is fish\nAt the wedding I got married singing reminisce\nBody guard, fuck you and that body guard\nMake 'em come pick up a body 'fore the party start\nFerrari fat boy, they fuck with me on snap chat\nI get the party, started fuck her sliding out the back\nHer favorite show is How To Get Away With Murder\nI got a couple ways, hope your ass a quick learner\nBoss, and they call me Renzel\nFuck 'em like I'm Denzel\n\n[Hook 1: Future]\nWhere your ass was at dog, when niggas wouldn’t feed me?\nWhere your ass was at dog, when bitches didn’t need me?\nWhere your ass was at dog, when niggas tried to run off?\nWhere your ass was at dog? You made me pull this gun out\n\n[Verse 2: Future]\nWhere your ass was at, dog, you went and switched sides?\nWhere your ass was at, dog, when niggas spread lies on him?\nWhere your ass was at, dog, when the bodies came sliding?\nWhere your ass was at, dog, when I was serving pies?\nWhere your ass was at, dog, when niggas wouldn’t feed me?\nWhere your ass was at, dog, when bitches didn’t need me?\nWhere your ass was at, dog, when niggas tried to run off?\nWhere your ass was at, dog? You made me pull this gun out\nWhere your ass was at, dog, when I was in the Pyrex?\nWhere your ass was at, dog, when I was drinking Hi-Tech?\nWhere your ass was at, dog? Came through the projects\nWhere your ass at? We keep that fully loaded contracts\nHad to rent that on the dick ass jocking\nRunning through the pussy like a nigga going jogging\nFuck a little Louis, put it in a bitch pocket\nPut a pic with me on the gram now you popping\nWhere your ass was at when I was trapping in the stove?\nHad to struggle to get where I'm at and sell dope\nJackie Chan moves got game in the choke\nGas rolling up in the blunt, Amoco\n\n[Hook 2: Future]\n12 tryin' come in the spot to open up the dope\nBurglar bar doors gotta young nigga confident\nJuugin' out the stove and we still bangin', honest\nBlowing on the O ho, we call that ho an onion\n\n[Verse 3: Drake]\nMan, where your ass was at when we took the city over?\nWhere your ass was at when all they'd ask was what's the hold up?\nWhere your ass was at when niggas first got the news?\nNow your ass around because we’re paying back dues\nWhere were you? When all the dogs needed help\nLawyers and the commissary ain’t gon’ pay itself\nWhere your ass was at when we recorded in the bathroom?\nWhere your ass was at I take attendance like a classroom\nMan I ain’t got no choice\nCause nowadays I swear this shit done changed up for the boy\nI’m self-made, selfish with my women, self-employed\nI’ll buy the neighbors house if they complain about the noise\nMan, where your ass was at, dog, when niggas wouldn’t feed me?\nWhere your ass was at, dog, when bitches didn’t need me?\nWhere your ass was at, last winter was the coldest?\nFuck where you was at, I had the 6 on my shoulders\n\n[Hook 1: Future]\nWhere your ass was at dog, when niggas wouldn’t feed me?\nWhere your ass was at dog, when bitches didn’t need me?\nWhere your ass was at dog, when niggas tried to run off?\nWhere your ass was at dog? You made me pull this gun out\n\n[Verse 4: Future]\n60 for a walk, bitch don’t panic\nHad them bitches fall through fucking like a savage\nHeard you tryna swim in the ocean no jacket\nHeard that nigga came through squeezing on a ratchet\nHeard that nigga came through squeezing on a ratchet\nServe a lot of dog food; call you a mutt\nWhere your ass was at dog, when I was on my come-up?\nThe reason I’m here today cause I ain't never gave up\nWhere your ass was at, dog, when niggas wouldn’t feed me?\nWhere your ass was at, dog, when bitches didn’t need me?\nWhere your ass was at, dog, when niggas tried to run off?\nWhere your ass was at, dog? You made me pull this gun out\nWhere you ass was at, when I was trapping at the stove?\nHad to struggle to get where I was at and sell dope\n\n[Hook 2: Future]\n12 tryin' come in the spot to open up the dope\nBurglar bar doors gotta young nigga confident\nJuugin' out the stove and we still bangin', honest\nBlowing on the O ho, we call that ho an onion", "image": "https://images.genius.com/26f2cdfc9fdcb22135f837c8ea35c566.1000x1000x1.jpg"}], "artist": "Rick Ross"}