{"songs": [{"title": "Deep Cover", "album": "Doggystyle", "year": "1992-04-09", "lyrics": "Hit this motherfucker G\nNo, naw man, I can't fuck with that\nAww man, I been dealin' witchu for three motherfuckin' months, you ain't hit the pipe in front of me yet\nSo what you sayin'?\nI think you five-oh\nFive-oh? Man, I ain't no motherfuckin' cop\nWell, hit this motherfucker den\n(I can feel it)\nTonight's the night, I get in some shit\n'Deep Cover' on the incognito tip\nKillin' motherfuckers if I have to, peelin' caps too\nCause you niggas know, I'm comin' at you\nI guess that's part of the game, but I feel for the nigga\nWho think he just gon' come and change thangs\nWith the swiftness, so get it right with the quickness\nAnd let me handle my business, yo\nI'm on a mission and my mission won't stop\nUntil I get the nigga maxin' at the top\n(I hope you get his ass 'fore he drop)\nKingpin kickin' back while his workers slang his rocks\nComing up like a fat rat\nBig money, big cars, big bodyguards on his back\nSo it's difficult to get him\n(But I got the hook up with somebody who knows how to get in contact with him)\nHit him like this and like that\nLet 'em know that I'm lookin' for a big fat dope sack\nWith ends to spend, so let's rush it\nIf you want to handle it tonight, we'll discuss it\nOn a nigga's time and a nigga's place\nTake my strap just in case one\nOf his boys recognize my face\nCause he's a sheisty motherfucker\nBut I gives a fuck, cause I'm going 'Deep Cover'\nYeah, and you don't stop\n(Cause it's 1-8-7 on a undercover cop)\nYeah, and you don't stop\n(Cause it's 1-8-7 on a undercover cop)\nCreep with me, as I crawl through the hood\nManiac, lunatic, call me Snoop Eastwood\nKickin' dust as I bust, fuck peace\nAnd, the motherfuckin' punk police\nYou already know, I gives a fuck about a cop\nSo why in the fuck would you think that it would stop?\nPlot, yeah, that's what we's about to do\nTake yo' ass on a mission with the boys in blue\nDre, (Whattup Snoop?)\nYo, I got the feelin'\nTonight's the night like Betty Wright, and I'm chillin'\nKillin', feelin', no remorse, (yeah)\nSo let's go straight to the motherfuckin' source\nAnd see what we can find\nCrooked-ass cops that be gettin' niggas a gang of time\nAnd now they wanna make a deal with me\nScoop me up and put me on they team and came too chill with me\nAnd make my pockets bigger\nThey want to meet with me tonight at seven o'clock\n(So whassup nigga?)\nWhat you wanna do?\n(What you wanna do?)\nI got the gauge, a Uzi, and my motherfuckin' twenty-two\nSo if you wanna blast, nigga we can buck 'em\nIf we stick 'em then we struck 'em, so fuck 'em\n(I can feel it)\nYeah, and you don't stop\n(Cause it's 1-8-7 on a undercover cop)\nYeah, and you don't stop\n(Cause it's 1-8-7 on a undercover cop)\nSix-fo'-five was the time on the clock\nWhen me and my homey belled in the parkin' lot\nThe scene looked strange and it felt like a set up\n(Better not be, cause if it is they gettin' lit up)\nOh, here they come from the back in they 'llacs\nI'm checkin' for the gats they strap, so whassup black?\n(Chill, let's hear the deal)\n(If it ain't up to what you feel then grab your steel)\nRight, so, what you motherfuckers gon' come at me with?\nHope you ain't wantin' none of my grip\nCause you can save that shit\n(Guess what they told me?)\n\"We give you 20 G's if you snitch on your homey\nWe'll put you in a home, and make your life plush\nOh yeah, but you got to sell dope for us\"\nHmm, let me think about it\nTurned my back and grabbed my gat\nAnd guess what I told him before I shot it\n\"If you don't quit, yeah, if you don't stop, yeah\nI'm lettin' my gat pop, cause it's 1-8-7 on a undercover cop\"\nYeah, and you don't stop\n(Cause it's 1-8-7 on a undercover cop)\nYeah, and you don't stop\n(Cause it's 1-8-7 on a undercover cop)\nYeah, and you don't stop\n(Cause it's 1-8-7 on a undercover cop)\nYeah, and you don't stop\n(Cause it's 1-8-7 on a undercover cop)\nYeah, and you don't stop\n(Cause it's 1-8-7 on a undercover cop)\nYeah, and you don't stop\n(Cause it's 1-8-7 on a undercover cop)\n...", "image": "https://images.genius.com/d31a03639b8f8f4259b9b9da07972d52.996x1000x1.jpg"}], "artist": "Snoop Dogg"}