{"songs": [{"title": "You Can’t Fade Me / JD’s Gafflin’", "album": "AmeriKKKa’s Most Wanted", "year": "1990-05-16", "lyrics": "[Verse 1: Ice Cube]\nNow the taste of alcohol is filling up my bladder\nWhat's the date and time, it don't matter\nHad a pocket full of phone numbers, I was trying to sort\nTo make a long story short\nRan into, this girl named Carla\nKnew her from the back seat of my homie's Impala\nShe said what's up, yeah what's the deal\nCheck the hairdo of course it ain't real\nThen I looked down she was fat in the front\nI asked how long, well about seven months\nOh how time flies when you're having fun\nShe said \"Yeah but the damage is done\nWhere you been?\" \"On a little vacation\nOh by the way, congratulations\nWho's the lucky man?\" I don't have a clue\nThen she said \"The lucky man is you.\" I dropped my brew\nAnd everything looked fuzzy\nNot a baby by you, the neighborhood hussy\nShe said \"Yeah remember that date?\"\nI thought back and tried to calculate\nThen I said \"Damn, are you sure it's mine?\n'Cause I know you been tossed plenty of times\"\nShe said \"That day, no I wasn't whoring\nYour ass is mine,\" that's when the sweat started pouring\n'Cause all I saw was Ice Cube in court\nPaying a gang on child support\nThen I thought deep about giving up the money\nWhat I need to do is kick the bitch in the tummy\nNaw 'cause then I'd really get faded\nThat's murder one 'cause it was premeditated\nSo what I'mma do, I don't have a clue\nHow many months left, damn only two\nI'm gettin faded\n\n[Hook]\n(\"Livin' and jivin' and diggin' the skin he's in...\")\nNo cigar, G\n[(\"Livin' and jivin' and diggin' the skin he's in\" \"Whoa yeah\")]\n[(\"Livin' and jivin' and diggin' the skin he's in...\")]\nAy yo, homey, man, I'm getting faded\n[(\"Livin' and jivin' and diggin' the skin he's in\" \"Whoa yeah\")]\n\n[Verse 2: Ice Cube]\nIt's crazy 'cause before I could sleep with her\nI had to duck and dodge and try to creep with her\nSee the booty and the front was all in place\nBut the girl had the pitbull face\nSo we ran jumped drove swam crawled hid\nOh lord god forbid\nMy homies see me at the motel\n'Cause those fools would love to just go tell\nEverybody in the hood that knows your rep\nSo jump in the back seat and quiet is kept\nAnd hold your big fat butt steady\n'Cause yo, ho, I got the paper bag ready\nShe started moaning and gobbling like a turkey\nI knocked the boots from here to Albuquerque\nI dropped her off man and I'm knowing\nThat I'm a hate myself in the morning\nI got drunk to help me forget\nYo another day another hit, shit\nI'm gettin faded\n\n[Hook]\n(\"Livin' and jivin' and diggin' the skin he's in...\")\nAy yo, you know what time it is\n(\"Livin' and jivin' and diggin' the skin he's in\" \"Whoa yeah\")\n\n[Verse 3: Ice Cube]\nNine months later she's ready to drop the load\nAnd everybody in the hood already knows\nIt's supposed to be mine so they laughing at me\nYou know Ice Cube can't be having that, G\nI'm thinking to myself why did I bang her\nNow I'm in the closet looking for the hanger\nJD and Jinx and T-Bone won't let up, they won't shut up\nI'm gettin fed up, bitch\n'Cause I know you're tryin' to break me\nBut if I find out your tryin' to fake me\nI'm a buff that duff and hoot\nBeat ya down and leave a crown or two\nThat night she went into labor\nAnd the shit is getting kinda major\nThe baby came out damn it was a lifesaver\nLooking like my next-door neighbor\nShe said it was mine that was her best guess\nBut let's check the results of the blood test\nI started smiling yeah 'cause it read negative\nDamn, why did I let her live?\nAfter that I should've got the gat\nAnd bust and rushed and illed and peeled the cap\nBut no I just told the ho who laid me\nExcuse me bitch it's a switch\nYou can't fade me\n\n[Outro]\nNaw baby, not this way\nYo, you ain't playing Ice Cube out like no booger\nI don't fall for the okey-doke\nAnd before I fall for the okey-doke, I let the pistol smoke\nNow sing it\n(\"Livin' and jivin' and diggin' the skin he's in...\")\nHa ha, yeah baby, you can't fade me\n(\"Livin' and jivin' and diggin' the skin he's in\" \"Whoa yeah\")\n(\"Livin' and jivin' and diggin' the skin he's in...\")\nNah, unfadeable baby, yo\n(\"Livin' and jivin' and diggin' the skin he's in\" \"Whoa yeah\")\n\n[Segue: \"JD's Gafflin'\"]\nI ain't never got gaffled like that, I used to do the gafflin'\nMcDonald's is my spot (What you used to do?)\nJack them motherfuckers for them Nissan trucks\nRight in the drive-thru.  \"Nigga, get your motherfuckin' food, leave it in the car, nigga, get out.\"  Straight jackin'", "image": "https://images.genius.com/1cb382d2d9fb4a9bfa94e3074c1aa220.1000x1000x1.jpg"}], "artist": "Ice Cube"}