{"songs": [{"title": "Came Up", "album": "Free Agents - The Murda Mixtape", "year": null, "lyrics": "[Havoc]\nBang your head, squeeze the four to this\nGet bent, bag a whore to this - good girl, metamorphise it\nThat's you? Oh my bad, little shorty a freak\nNow nigga come up off of it\nI don't fight over hoes but I kill for my dough\nThat's right nigga know where my morals is\nWe can take it to the street, homey I don't give a fuck\nCorporate, nigga shoot up them offices\nEither step your game up or forfeit\nNigga never had it, I don't know how he lost it\nKeep, fuckin with Hav', have them ladies on your block\nLookin at you on the floor like, \"poor kid\"\nCause I bring it to the doorstep, 'ready know the layout\nThink, not that, and some more shit\nIt's called backshot talk, you don't know nuttin 'bout it\nCause you can no longer hit it\n\n[Hook: Mobb Deep - repeat 2X]\nNiggas better step they game up (step it up)\nBitches better step that game up (step it up)\nI don't give a fuck and you know I don't give a fuck\nNiggas just made cause I came up\n\n[Prodigy]\nAiyyo yo\nIf songs is ammo, then we got endless bullets\nTake you to war with rap and you definitely losin\nOur chorus is like a 50 cal slug\nOne verse is like a +Cannonball+, +RUN+ - too late you threw it\nThese beats is like landmines, one step KABOOM\nIt's body parts all over the room 'n shit\nAlbums is like time bombs, our shits blow up\nIt's chemical warfare, we spread through the hood son\nAnd attack the nervous system\nMake niggas bop they head and turn that shit up\nMake the ladies panties wet, you know we get 'em\nHot and bothered, girl I have that oyster drippin\nOn stage flippin, catch us on tour\nSlowly but surely takin over the world\nAnd come back home with paper in colors you never seen\nBut at the money exchange, it all turn green\n\n[Hook]\n\n[Outro]\nWoo! Oh man! Shit\nRemember this? (No doubt, no doubt)\n(That's what the fuck I'm talkin about)\n\n\"The bad has been playin\" (been doin this shit here man)\n\"That song all night\" (constantly baby)\n\"And now is the time baby..\"\n.. to turn out your lights\nA rap for you faggot-ass niggas\n(Yo son, c'mon man)", "image": "https://images.genius.com/8a94d4d15bcdf43ddb8ce2cdbfde357c.455x455x1.jpg"}], "artist": "Mobb Deep"}