{"songs": [{"title": "Turnpike Ike", "album": "Port of Miami 2", "year": "2019-08-06", "lyrics": "[Intro: Rick Ross]\nI told her that she can't fuck me like a king no more\nI told her she gotta make love to me like I'm an emperor\nAn emperor\nMan, I done got money everywhere nigga, but particularly that Turnpike south\nIt's really a blessing to a young nigga like Renzel\n\n[Verse 1: Rick Ross]\nIndictment on the way, got Sadow on the case\nWhen you get your first kilo, it should be on your face\nNigga movin' like the Mob, hundred thousand Francs\nDry land when you wanna be out on the lake (Swish)\nDetermined to be one of the fortunate men\nBitches come from everywhere, once the hustlin' commence\nI see you prayin', testifyin', forgotten the time\nBottom line, your cars should get shot up like it were mine\n20 round but the voodoo, let no harm be allowed\nMap fout ou deyo, they all know the spirits when I be aroused\nMade it to Star Island, started with a nickel rock\nWho thought a project nigga get to get a yacht?\nTwo million dollars cash in the Range Rover\nOpa Locka airport, let's get the plane loaded\nI put it on the Turnpike\nGold rims, whip wheel, blue bills, duckin' the termites\n\n[Skit: Rick Ross]\nI'ma let one of my bad bitches tell y'all how much paper I got\nBaby, what we living like? Twenty houses\nWhat else? Fifty cars\nYeah, what that make you feel like?\nPriceless baby\nUh, you live for me? Everyday\nYou would die for me? Right now\nUh, double MG\n\n[Verse 2: Rick Ross]\nTurnpike, real earner, Ted Turner (Me)\nWhip it in the kitchen, that boy was a fast learner\nTime to live it up, two million tucked in that new Bentley truck\nAin't too many I can trust so shooters is a must\nI reminisce when it was hit or miss\nI was innocent until I hit a lick\nSeven figures on a nigga mama couch\nDon't want to hear nobody talkin' 'bout a drought (Boss)\nI'm chilling in a yacht in my Mitchell & Ness\nStitches in my britches, 57S\nSwishers, you can smell 'em on the internet\nAin't beefing with nobody 'cause I'm killin' that\nI toss the pistol on the car chase (Woo)\nThen walked into the church just like the boy Mase (Lord)\nI'm the man out in Barcelona (Boss)\nGot a couple of bad bitches out in California\n\n[Skit 2: Rick Ross]\nReal language, biggest\nTell these niggas some more shit bae\nBaby, you're the biggest\nUh, your fine ass\nThe biggest boss, you're my boss baby\nHow much money we gon' get?\nWe gon' get all of it baby (Uh)\nWe gon' take it all honey\nTurnpike Ike (Uh, ha)\nYou're the biggest baby, you're the boss\n\n[Verse 3: Rick Ross]\nGo get a room right out of town, and I'm in Oprah's yacht\nI'm making move with all my rounds, you better call the cops\nSecond weekend, I just had to go buy me a drop\nSlick remarks and I'm in county, yeah look at him shop\nCold games, I gotta step out, I'm on 'em in furs\nGil Green, the way I capture the moment with words\nCity mine, I keep the killers to fill up a church\nSwear to God, a quarter kilo won't get you a verse\nBring mine, stay on time, and that's where we resign\nMeanwhile, we'd be having such a meaningful time\nSpiritual nigga, baptized up in G5\nWith bad bitches who idol still with Nicki Minaj\nRags to richest, now I move with beautiful women\nNewfound, new beginning, one day that I grew to be winning\nIf you looking for me catch me on the Turnpike\nAnd when you see me,  I'ma show you what this work like, nigga\n\n[Skit 3: Rick Ross]\nFuck you think this is? Turnpike Ike nigga\nIsaac Hicks, rest in peace OG\nBig Mike, Michael Delancy\nFree Michael Delancy\nKenneth Williams, long live Black Bo\nCarol City shit, nigga\n\n[Outro: Female vocal]\nHe a thoughtful nigga, boss\nThey won't ever be a boss as big as you baby\nYou're the biggest, the biggest boss\nYou're the biggest, the biggest boss\nYou the boss, you the boss", "image": "https://images.genius.com/e962334e64ea4f814fb520d8bae77334.742x742x1.jpg"}], "artist": "Rick Ross"}