{"songs": [{"title": "Monkey See, Monkey Do", "album": "Straight from the Lab", "year": "2003-11-07", "lyrics": "[Intro]\nAyo 50\nWhat I tell you?\nWe ain't even have to say shit, they did it, ha ha\n\n[Chorus]\nMonkey see, monkey do\nDon't ever make the first move, just let 'em come to you\n'Cause they gon' always see and do what the other one do\nSo let them come to you, the rest'll just follow suit, monkey see, monkey do\nTweedle-dee, tweedle-dum\nIf they really want it bad enough, well, then they gon' come\nNow here they come as we expected, now we just set 'em up\nCheck-mate, motherfucker, game's over, we won\nTweedle-dee, tweedle-dum\n\n[Verse]\nDoesn't take much for me to raise such a stink up\nWhen motherfuckers hate your guts\nYou ain't even gotta say much\nFor me to put a pen to a blank sheet of paper\nIs like smearing a bloodstain with a paint brush\nI can’t explain what it is my brain does\nBut however it works, it's insane, it's plain nuts\nAnd it ain't just my brain that’s dangerous\nIt’s a whole combination of things, it takes nuts\nAnd I’m not afraid to raise the stakes up\nI got a million bucks in the bank and 8 trucks\nFor anybody who gets on the track and spanks us\nI'm patiently waiting for the day, I’m anxious\nTo see the look on ya fake mugs\nWhen you thugs go bankrupt\nYa drunk, you ain't tough\nWhatever you drank must've just turned you into some gangstas\nThis is me talking, motherfucker, this ain’t drugs\nYou wanna pop shit? Wake up then make up\nFuck that! It’s too late chump, now face up\nI pray for the day that someone who spits with the caliber that Nas and Jay does\nOpens up his jaw to say somethin' or rattle my name off\nOr rattle the first thing from the top of his brain off\nSo I can blow the fucking dust off of this chainsaw\nAnd give him the surgery that he came for\n'Til I pull the paint off\nI never been shot\nBut I think me and Fifty must've been cut from the same cloth\n'Cause I’ve always came off like Ja's chain\nWhen they try to rush him and lost\nAnd came back and gave him a watch in exchange for it\nI don’t stop, only thing that I wait for\nIs the day that I ain't gotta report to probate court\n'Cause I'ma give you all a reason to hate more\n'Cause I been holding my tongue 'til I got a sprained jaw\nA lot of rappers on my list that just ain’t Ja\nAnd I'ma read that motherfucker off come April\nYou pussies think I went soft 'cause 8 Mile\nWhen I come back I’ll be shooting more than just paintballs\nTrust me\n\n[Chorus]\nMonkey see, monkey do\nDon't ever make the first move, just let 'em come to you\n'Cause they gon' always see and do what the other one do\nSo let them come to you, the rest'll just follow suit, monkey see, monkey do\nTweedle-dee, tweedle-dum\nIf they really want it bad enough, well, then they gon' come\nNow here they come as we expected, now we just set 'em up\nCheck-mate, motherfucker, game's over, we won\nTweedle-dee, tweedle-dum\n\n[Outro]\nFucking dummies\nThis ain’t chess\nYou playin' motherfucking checkers\nThis shit is all day, man, it’s too easy\nWe playing chess, you playing checkers\nYou 'bout to get your mother fucking asses jumped\nFucking punks\nAnd by the way\nWe ain’t just talking to one person\nWe talking to every-motherfucking-body who wants to bring it\n'Cause we bring it into anybody who wants to bring it\nSo bring it\nDon’t pick up the ball if you don’t wanna play, man\nIt’s all fucked up now\nFuck I’m supposed to do now?\nHuh?!\nWhat the fuck I'm supposed to do?!\nYo, we out!", "image": "https://images.genius.com/8dd03ebbf724e2b4d4bafbddf8c3c2f1.1000x1000x1.png"}], "artist": "Eminem"}