{"songs": [{"title": "Incarcerated Scarfaces", "album": "#T5DOA: Freestyle Edition", "year": "2015-06-06", "lyrics": "[Intro]\nKnock niggas out the box all the time\nNiggas know my motherfuckin repertoire, baby pa\n(Uh-huh) take care of B.I., Kiss\n(HA-HAAAEEH!)\n\n[Chorus]\nNow, yo, yo, what up, yo? Time is runnin' out\nIt's for real though, let's connect politic, ditto\nWe could trade places, get lifted in the staircases\nWord up, peace, incarcerated Scarfaces\n\n[Verse]\nMy thug related style attract millions\nNobody is safe, no man, woman, or children\nClips, already filled 'em, head-huntin' civilians\nStay up in the spot, the bread comes to the buildin'\nWanna be hot? The lead comes wit' the feelin'\nHustlin' and rappin', two things I'm skilled in\nUh, yeah, the choice is yours, baby, pick one\nBroke elevators, turn the lights out, stick one\nTom Ford suit on in the White House, sick one\nYou ain't never had a brick, let alone flipped one\nKnow a couple off here and there 'til the piff come\nOther end of the barrel, yeah, you the victim\nUh, good deed for four quarters\nBentley SUV is on order\nI just threw my thing, I'm a king wit' a don aura\nShout to my UK fam, D-Block Europe\nAll my enemies, every nigga that got tore up\nY'all want to play games, I'm puttin' the high score up\nThis right here is that shit that they need more of\nRunnin' your mouth to a stranger, you get caught up\nPuttin' your life in danger, at least sort of\nClassroom could never compare what the streets taught us\nDon't just watch me, nigga, peep all us\nShallow minds usually drown in deep waters\nI do it for the souls of all the deceased ballers\nIf you ain't never wit' us, how could you be for us?\nHow could somethin' that's so tarnished be flawless?\nTold you, 'Life's a bitch', but she's gorgeous\nOnce you press play on her, you can't pause her\nRap's my house, tell these niggas to pay mortgage\nGot work doin' the drought, it's no shortage\nYou know me, fuck the law, I'm lawless\n\n[Chorus]\nNow, yo, yo, what up, yo? Time is runnin' out\nIt's for real though, let's connect politic, ditto\nWe could trade places, get lifted in the staircases\nWord up, peace, incarcerated Scarfaces\n\n[Outro]\nHaha, Jadakiss season\nThere can only be\nIt's only four seasons\nT5DOA, Silverback Gorilla part 2\nGhost... L-O-X\nLearn life 'fore life learn you, HA-HAAAEEH!", "image": "https://images.genius.com/91aaca2db40e949852229a6bd8eb75d7.500x500x1.jpg"}], "artist": "Jadakiss"}