{"songs": [{"title": "I’m So Official", "album": "Mystery Team", "year": null, "lyrics": "[INTRO]\n\"From now on, that'll be, like, our little thing, like you're, like, a little version of me. I'm carrying you around like-- like in a papoose. It would be amazing.\"\n\n[Hook]\nI’m so official, all I need is a whistle\nI’m so official, all I need is a whistle\nI’m so official, all I need is a whistle\nAll I need is a whistle\nAll I need is a whistle\n\n\nSaid I’m so official, all I need is a whistle\nI stole that line from Wheezy and Lil’ Drizzle\nAnd yes, it’s the nigga with the Care Bear kizzles\nAnd fuck what’chu heard, I don’t even care a little\nIt’s the B to the izzle, niggas can’t see me\nFresh like a baby\nSick like a preemie\nGirls double team me - blow me in the parking lot\nI used to get fucked over and now I only fuck a lot\nI love being nerdy, these niggas shop at Wal-Mart\nI shop so I mall cop, call a nigga Paul Blart\nI’ma have a drug fart, meaning that my shit’s dope\nNigga in a bow-tie - that’s my fuckin’ kinfolk\nGirls used to say, “Nope!” - like they watch P&R\nNow they say yes because I’m on before P&R\nYes, my European car speaks for itself\nI don’t wear that fuckin’ jewelry, it’s bad for your health\nSee, where I come from, they would hit you where you’re walkin’\nRip your fuckin’ chain off, leave you in a coffin\nStay Stone Mountain\nNigga, where my hood at?\nNiggas say, “You it!” when you drinkin’ with a hoodrat\nBoy, the beat’s so sick, thank you mc DJ!\nChillin’ on my sofa watchin’ Venture Bros. Blu-rays\nNiggas gettin’ mad because I’m flyer than a Blue Jay\nRappin’ and on tv like a nigga LL Cool J\nCall you on a Tuesday, fuck you like it’s Friday\nI don’t run no drains, bitch, call my shit the highway\nBlacker than Mugabe, Whiter than the album\nI guess I’m in the middle, so call a nigga Malcolm\nYou don’t need to help him\nDIY - do it yourself, nigga don’t try\n“Please, just do it!” The girl sound Nike\nGuess that’s the reason why these niggas don’t like me\nGirls I don’t know give my penis oral hygiene\nMy dick plays the field like my dick won a Heisman\nNiggas talkin’ shit and that shit don’t surprise me\nAnd I’m so official, got a badge and a nightstick\n\n[\"Only one question remains, Eric. Why'd you do it?\n- I'll bet you he gets his kicks giving old ladies the heebie-jeebies\n- Hell, no. I wanted to see if it felt like pussy!\"]\n\n[Hook]\n\nSaid I’m so official, all I need is a whistle\nNigga blew up and he didn’t need a missile\n“He tryin’ too hard.” Homie, this my hobby!\nI do this on vacation, rappin’ is my golfin’\nYoung Young Hova, lil’ Lil’ Wheezy\nDress the turd up slutty, make the shit look easy, uh\nI’m the choreographer -\n‘cause I’m making moves and you niggas just follow ‘em, uh!\nElroy made a funny on you slow ones\nYes, my name is Childish, but you guys are children\nHow’s it fucking feel man, being so on fire?\nStepping on these short guys like I’m in The Shire\nI am slow Orlando, oops, late bloomer\nMoney comes quick, but the girls come sooner\nOpposite gay victim, meaning straight shooter\nI’m fuckin’ in yo redneck, I’m diggin’ in your cooter, yes\nWho told them I was so dope?\nRapping’s a religion, and nigga I’m the provost\nI don’t even know those other guys telling me they know my little cousin Lindsay\nNigga, I’m busy\nUm, that’s it though, angry like a pitbull\nTalkin’ like it’s hard work. Nigga, this is simple\nShout out to black nerds, shout out to white ones\nShout out to Asians, keep playin’ Street Fighter\nShout out to nerd chicks in glasses, sweeter than cinnamon\nMe and Sick Boi are synonyms\nPeople hear my voice and say, “What happened to Eminem?!\nThis shit is absurd! He’s saying the n-word!”\nNaw, it’s just Bam-B. The nigga that’s crazy for giving shit free\nAnd fuck iTunes, I’m doin’ it OG\nAnd girls love my dick like a song that’s on Glee\nNigga, call me Elroy - because I’m so high\nThat you cannot measure, I’m losing cabin pressure\nGot drive like a brand new Volvo\nI’m so official, I’m the Foot Locker logo, nigga", "image": "https://images.genius.com/db635fd721539042d4ff0248e0911184.500x500x1.jpg"}], "artist": "Childish Gambino"}