{"songs": [{"title": "Flow Forever", "album": null, "year": null, "lyrics": "[Rakim]\nAiyyo.. what's goin on?\nThe Mic Lebanon Teflon Don..\nI'm back baby\nThe year of the 9's\nAnd I'ma have to make these motherfuckers a offer they can't refuse\nY'know?\n\nHa, what's goin on? Yo c'mon, you know it's on\nI wrote a song, test my flow on the Autobahn\nMake sure the force is right, I floss all night\nGet off the mic it'll smoke like an exhaust pipe\nKeep em in the lie-bury, studyin my theory\nRa theory get translated in Swahili\nFrom the lands as far as Zanzibar\nThey understand the are, the man Allah\nIt's obvious why the copiers, they copy this\nSoon as my data processes Y2K they floppy disk\nNow who the hottest is? How can it not be this?\nBaby who the cockiest? Papi is? Gracias\nAiyyo, this be so, magnifico\nEven my, typical, style difficult\nMake a crowd go wild when I rip a show\nBetter stand back, this'll blow, you didn't know?\n\n[Chorus]\nThey show me love when I'm come through\nYo any club that I come to\nI hit a microphone check one two\nAnd they know what I want to do - flow forever\n\n[Rakim]\nYou ever witness rapport like this before?\nIt's cause y'all kiss the floor, say this my Lord\nIt's the chosen one, with the golden tongue\nFlow for the old and young when I'm holdin one\nIn the front row sitty, we show no pity\nWhere kids get jiggy and girls are so pretty\nThe Wanderer, back from Casablanca\nTo stomp all, what next for Ra the Conqueror\nSo let's go, the best show will explode\nNo dress codes, they just pose in they best clothes\nGirls get exposed when I show my rap expo\nWill there be a next episode? I guess so\nThose that halved out, wanted to have clout\nWhat they mad about? Must be a cash route\nMC's switch they style from they last bout\nAnd I bet soon as they hear this they spaz out\n\n[Chorus x 2]\n[Rakim]\nWherever Rakim go, it's the God temple\nIt's simple, my M.O., no problemo\nBeen all over the map, even know where Hell is at\nI did the welcome mat, and then welcome back\nMy flow is raw, they treat me like Mr. Know-it-All\nThey want me to show em all my brand new protocol\nExcuse-a-moi, I make a move for Ra\nYou ain't soupin Ra, save the hoop-a-la\nLet me find out you rhymed out designed out\nPullin dimes out then climb out, for time out\nI'm at the free throw, playin ball, or cee-lo, I keep dough\nReloaded like Carlito, incognito\nI be so, low key, women get nosy\nI do a show they want to go see to get to know me\nIn the front row seat they cosy\nThinkin I'm givin them the bo-bo-bee until they O.D\n\n[Chorus x 4]", "image": "https://images.genius.com/a39c418c52aac094b7b6ccdec45b8c2a.400x400x1.jpg"}], "artist": "Eric B. & Rakim"}