{"songs": [{"title": "Lowkey", "album": null, "year": "2018-12-21", "lyrics": "[Intro]\nStuntin' like a maniac, in the strip club blowin' 80 racks\n(Nigga I'm too lowkey for that)\nStuntin' like a maniac, in the streets nigga where the ladies at\n(I'm way too lowkey for that)\nStuntin' like a maniac, ask niggas, bitch I got my paper stacked\n(I'm too lowkey for that)\nYeah stuntin' like a maniac all day\n(Somebody better let 'em know—)\n\n[Chorus]\n(I'm too lowkey for that)\nNiggas on the bad slope, finna crash woah\nTryna show the hoes the cash flow\n(Nigga I'm too lowkey for that)\nMy foot is on the gas though\nGot my hat low, still an asshole, yeah ho\n(I'm not too lowkey for that)\nNigga, I just do what it does\nWhat's up? What it do? What's up? What it do?\nYou blowin' all your money on the hoes and the cars bro\nIt's all dope, but we all know\n(Nigga I'm too lowkey for that)\n\n[Verse 1]\nI'll admit my last few years have been kinda rusty\nHave I been beatin' myself up? In my mind I must be\nI slowed down, watchin' my peers as they rise above me\n'Cause rap's a leap of faith except nobody ties the bungee\nThese times are ugly\nI'm close to my midlife, the crisis hunts me\nCalm on the surface but inside I'm grumpy\nIf I was comfy, I'd say \"fuck rap\" because life is complete\nSurprise I'm hungry, rappers lookin' like fries and lunch meat\nDamn you got the hoes, you got a grill, you makin' mills huh (Huh)\nWhen you be flexin' you lookin' so icy that I get the chills son (Huh)\nI seen you pull up in your whip and you stopped\nBut somehow the wheels spun (Damn!)\nWho is the plug for the drugs? Tell me where you get the pills from\nI heard you came from the real slums\nWhat the fuck you gon' do when your deal's done?\nNigga the day that you fizzle out will come\nIf you think it ain't comin' you're real dumb\nThat ain't a bag you made off your talent\nThat is a label allowance\nAnd we gon' see in the end if you really could pay off the balance\nBitch!\n\n[Chorus]\n(I'm too lowkey for that)\nNiggas on the bad slope, finna crash woah\nTryna show the hoes the cash flow\n(Nigga I'm too lowkey for that)\nMy foot is on the gas though\nGot my hat low, still an asshole, yeah ho\n(I'm not too lowkey for that)\nNigga I just do what it does\nWhat's up? What it do? What's up? What it do?\nYou blowin' all your money on the hoes and the cars bro\nIt's all dope, but we all know\n(Nigga I'm too lowkey for that)\n\n[Verse 2]\nI could care less about expensive gold chains\nI'm gettin' mo' praise from spittin' propane\nBitch this is no game\nI don't fuck with hoes who hang with rappers and want fame\nFuck the swaggy shit, now I'm livin' like it's the old days\nSo pack your bags, you had your chance, this might be the\nAvalanche that wipes it up\nI'm back to rockin' baggy pants and wife beaters\nBitch your time is up\nThis my master plan and lightning struck\nDon't get caught in fires that my ashy hands is writin' up\nBeen had the fuckin' game on lock\nBeen had my pesos copped\nBeen plottin' deeply tryna take yo spot\nI can't erase those thoughts\nMy drive is somethin' that these fakes don't got\nTheir vision blurry tryna chase those thots\nYou tryna do it independent but you ain't no Hop\nThe indie valedictorian, bitch, my grades don't drop\nQuit tryna move me\nBeast mode is where my mind is usually\nY'all focused on Louis Vuitton and Gucci, I told you—\n\n[Chorus]\n(I'm too lowkey for that)\nNiggas on the bad slope, finna crash woah\nTryna show the hoes the cash flow\n(Nigga I'm too lowkey for that)\nMy foot is on the gas though\nGot my hat low, still an asshole, yeah ho\n(I'm not too lowkey for that)\nNigga I just do what it does\nWhat's up? What it do? What's up? What it do?\nYou're blowin' all your money on the hoes and the cars bro\nIt's all dope, but we all know\n(Nigga I'm too lowkey for that)\n\n[Outro]\nNigga I'm too lowkey for that\nI'm way too lowkey for that\nNigga I'm too lowkey for that\nNigga I'm too lowkey for that", "image": "https://images.genius.com/12e57b8322a4d63fcf9ffc0533792aac.600x600x1.png"}], "artist": "Hopsin"}