{"songs": [{"title": "Elevator", "album": "Relapse: Refill", "year": "2009-12-15", "lyrics": "[Intro]\nAll aboard!\nOkay, next stop, my basement (Ha-ha)\nI'll meet you down there!\n\n[Chorus]\nThere once was a saying that I used to say\nBack in the day, when I met Dre\nI used to sit and goof on the phone with my friend Proof\nThat if I went gold, I'd go right through the roof\nHe'd say, \"What if you went platinum?\", I'd just laugh at him\n\"That's not happening, that I can't fathom\"\nEighty-some million records worldwide later\nI'm living in a house with a fucking elevator\n\n[Verse 1]\nHaters getting mad, they done had enough of Shady\nYou slay me, nothing you say matters enough to touché me\nRappers try to play me, they use Hailie as a ukulele\nWhoopsa-that-a-fucking-daisy\nThat’s a no-no, even she knows Da-Da's fucking crazy\nFucking animal, cuckoo, bananas, fucking-A, B\nMaybe it's because I never had a mother raise me\nFuck around and throw a baby at another baby\nYou may think it's 'cause of the way that I was brought up\nBut it's all caught up to me now, karma's in the waters\nEvery line I ever said has got me in a corner\nYou might think it doesn't creep upon ya, but it all does\nYou wouldn't listen, man, I tried to warn ya when you started\nNow your brain's all haunted 'cause of all the shit you thought of\nChainsaw slaughters, turn your daughters into sawdust\nI never thought it'd come to this, I oughta just be honest, but\n\n[Chorus]\nThere once was a saying that I used to say\nBack in the day, when I met Dre\nI used to sit and goof on the phone with my friend Proof\nThat if I went gold, I'd go right through the roof\nHe'd say, \"What if you went platinum?\", I'd just laugh at him\n\"That's not happening, that I can't fathom\"\nEighty-some million records worldwide later\nI'm living in a house with a fucking elevator\n\n[Verse 2]\n\"Sorry Lance, Mr. Lambert and Aiken ain't gonna make it\nThey get so mad when I call them both faggots\"\nAll these fucking voices in my head, I can't take it\nSomeone shut that fucking baby up 'fore I shake it\nYou're standing adjacent to Jason, slash, Leatherface, and\nTogether makes 'em a fucking bad combination\nI lashed at the doctor in my last operation\nShoved the Wiener Schnitzel up his ass, hopped away, some-\n-body please stop the patient, get the cops to mace him\nHomie, I'm the Scheiße, ask Doctor Dreson\nI can't leave the game, I just can't walk away, son\nNo, not a-now, not a chance, not today, son\nI can't believe I leave for one brief second\nAnd you pussies queef all over the rap game, naked\nAnd use a leaf to wipe up the crap stain, feck it\nI'll just keep saying the same exact saying, check it\n\n[Chorus]\nThere once was a saying that I used to say\nBack in the day, when I met Dre\nI used to sit and goof on the phone with my friend Proof\nThat if I went gold, I'd go right through the roof\nHe'd say, \"What if you went platinum?\", I'd just laugh at him\n\"That's not happening, that I can't fathom\"\nEighty-some million records worldwide later\nI'm living in a house with a fucking elevator\n\n[Verse 3]\nElevator in my house, hah, smell ya later\nI blew the fuck up, a hamster in the microwave, I'm\nThinking 'bout an escalator now, steps, I hate 'em\nTold the neighbors step away, then I just pepper-sprayed 'em\nYeah, for every time you ride down the street\nOr hide out, drive by my house and beep\nLike, now motherfucker, try now to sleep\nLie down fucker (bah), try counting sheep\nAnd you're tryna find out why now there's beef\nMace in your face, bitch, cry now, pussy\nThis is my house, all nine thousand feet\nSo you can suck my dick with Amy Winehouse's teeth\nThen I shove 'em in the elevator, take 'em to the top\nStand above 'em just to cut the fucking cable, let 'em drop\nWalk an hour to the damn refrigerator, get a pop\nWhile I let 'em fall all the way to the basement, yelling \"Stop!\"\n\n[Chorus]\nThere once was a saying that I used to say\nBack in the day, when I met Dre\nI used to sit and goof on the phone with my friend Proof\nThat if I went gold, I'd go right through the roof\nHe'd say, \"What if you went platinum?\", I'd just laugh at him\n\"That's not happening, that I can't fathom\"\nEighty-some million records worldwide later\nI'm living in a house with a fucking elevator\n\n[Outro]\nYou fucking son of a bitch, I can't believe this shit\nThis must be all that there is, this must be it\nFucking-A, even got a bidet\nTo wash my ass after I shit with gold toilet paper\nDishwasher's so big, when I'm pissed off, I can just toss a\nFlying saucer in it, the shit's awesome\nYeah, fucking elevator, living in a house with a fucking elevator", "image": "https://images.genius.com/f0f6c35eb65bb3ec183868950b41a55d.600x600x1.jpg"}], "artist": "Eminem"}