{"songs": [{"title": "Fly Shawty Penelope", "album": "The DaVinci Code: The Vatican Mixtape Volume 2", "year": null, "lyrics": "[Intro: Raekwon]\nYeah, yeah, straight outta jail\nFirst time nailing me, realer than the obvious\nThey never said it was gonna be easy\nWho can y'all put up with?\nThe streets... why you coming at me like that, man?\nYou payin' him? You taking care of me?\nWhat's the matter with you, man?\nSee this the shit that make a nigga don't come over, man\n\n[Chorus 2X: Raekwon]\nAiyo, fly shorty Penelope, fresh female chick\nStraight outta jail, first time mailing me, God\nRealer than the obvious, livelyness was on the line\nI mean like, the sweetest thing, most seen her kind\n\n[Raekwon]\nBloomingdale patient, slick finance who got a Benz station\nStudying law, buying North Faces\nTried by the police, yo, straight up and down\nI hold rollies, size six shaconies, daughter, might name her Water\nSon, might name him Rich Porter, style, Law &  Order\nCopped them quarters, it's real, blowing out in Florida\nDisplaying a game, frame, I'm adoring her\nBlasting music, I'mma lose it, shorty romance the music\nJust grind, don't dance to it, flexin' with a sun dress on\nShorty refreshin', less you stressed, stop swarmin' on her\nYellin', it's all made basic, taste it\nAnybody lace this here, you can blaze it\nRinaldo stepped up, what, \"Lex, you know I got it lined up\"\nBust ya gun from the side, what?\nTake this thought in mound, your frame might be a dime\nBut the brain power might not shine\nShorty had a good head once, rolling up blunts, damn\nShe fucked up, got caught in the crunch\nNow, down go her lifestyle\nShe on the FDR now, with a Audi J, bugging out\nStop that drinking, you wild, project chick, yo\nWon't even tuck her chain, nigga, that's foul\nGot caught up in the number run, dunn\nI need to get my life back, son, share one\nLex laid it out, but she stunt, enter and still smoke blunts\nShit ain't real, she yelling \"Fuck everyone\"\nYup, caught up in the midst, I mean glitz\nWent from doorags to rich, now he blue hat and switch\nI guess, the live way to rap it, shorty went backwards\nNow she stuck with a dirty Guess jacket\nKeep on, giving out the jewels wrong\nWho wrong? Who want? Who trynna-trynna act like you never knew wrong\nNow it's raining, now I'm maintining, gaining\nProbably gaming with positive aiming, long dane it\nStepped in, jumped in the car, fuck God\nPut the Wisdom for Knowledge, you bond, whine too hard\nShaking her ass, walking out to the garage, you large\nFuck men, fuck who weighing nods\nStopped, took a peak at the stars, the Zodiac, a fine Mars\nOr lose it for a chick behind bars\nWash, waking up Lars, aiyo collect call Taj'\nLet's take a half a million in the cards\nLaying up, at the Laborage, say I need a massage\nStressed, jumping out the Guess jumper, charged\nWifey material, make sure y'all observe the ariel\nI'm mailing this through ya stereo\nWifey material, make sure y'all observe the ariel\nI'm mailing this through ya stereo\nWifey material, make sure y'all observe the ariel\nI'm mailing this through ya stereo", "image": "https://images.genius.com/6f197227f3f40405b8f2f57a987c805a.820x820x1.jpg"}], "artist": "Raekwon"}