{"songs": [{"title": "What It Is", "album": "Genesis", "year": "2001-05-01", "lyrics": "[Intro: Busta Rhymes]\nYeah.. Flipmode.. Violator..\nNeptunes nigga\nWhat you want nigga, yeah\nWhat you want bitches\nKeep it goin, c'mon\nKeep it goin, c'mon\nKeep it goin, c'mon\nC'mon, yeh yeah\n\n[Verse 1: Busta Rhymes]\nC'mon - who be the father to this?\nBounce right here niggas be followin this\nModelin bitches be frontin and be swallowin this\nCarry on and yellin, screamin, be hollerin this\nFlipmode co-signed to be the sponsor for this\nWhat? To conquer this you need to march on for this\nWhat? Ha, bitches just shake it and wiggle\nAnd start to bake and just giggle\nAnd then get naked a little and shit\nSweat drippin off they face and they nipple and shit\nNiggas wildin til they be all tired and crippled and shit\nYeah you buggin on how we be doin it to ya\nHit y'all niggas with shit just like bullets was travelin through ya\nNow, from right to left with a capital F\nSo we gon' keep this shit hot to death and we stoppin your breath\nDrinkin and buggin and fuckin with them hoes again\nBut it's nothin cuz y'all niggas KNOW we 'bout to blow again\n\n[Hook: Kelis (Busta Rhymes)]\nBusta, what it is right now (Yeah)\nBusta, what it is right now (Eh-heh, eh-heh)\nBusta, what it is right now (Yeah, eh-heh, eh-heh)\nBusta, what it is right now (What you want? Eh-heh, eh-heh)\nBusta, what it is right now (Yeah, eh-heh, eh-heh, eh-heh)\nBusta, what it is right now (Yeah, what-chu...)\nBusta, what it is right now (What you want now)\nBusta, what it is right now (Flipmode, c'mon, c'mon)\n\n[Verse 2: Busta Rhymes]\nLet me show you what it is right now\nLet me... step up and handle my biz right now\nNiggas don't even know what it is right now\nGot 'em mad as if I was bonin they wiz right now\nSo let me dig right now all in your ass way she bouncin got my...\nBubbly startin to fizz right now\nAyo, fuck it shit is feeling kinda big right now\nGot 'em ready to split a couple of wigs doin tricks wit her ass\nShoulda seen what shorty did right now\nGot me stuck on just takin her back to my crib right now\nC'mon, the way shorty throwin that ass all over the place\nWhy shorty dizzy tryin to throw it all up in my face\nWoooohh! So what you got right now\nCuz we comin to blow the whole entire spot right now\nNigga we hot right now, all you other niggas move your shit over\nBecause we comin take your slot right now\n\n[Hook: Kelis (Busta Rhymes)]\n\n[Bridge: Kelis Both]\nThis be the beat to rock for the street\nMore hot shit we givin you more heat\nFeelin that bounce, bangin the concrete\nBangin in the club and bangin it in your jeep\nFlipmode Squad, two thousand and one\nWave your hands and rep where you from\nWe keepin it street cuz that's how we live\nIt's what it is baby, it's what it is baby\n\n[Verse 3: Busta Rhymes]\nC'mon\nSee what it is is that we smokin got you open my nigga\nRippin til the very last word is spoken my nigga\nThink we jokin we be makin niggas soakin they clothes\nWhile niggas is runnin and wildin busy scopin these hoes\nBitches is runnin and wildin scopin niggas wit dough\nWhile we keepin niggas chokin like we smokin the 'dro\nHeh, see what it is is that we create a ruckus\nCuz that's what we love to do muh'fuckas, c'mon\n\n[Hook: Kelis (Busta Rhymes)]\n\n[Outro: Busta Rhymes]\nFlipmode nigga, c'mon\nViolator muh'fucka, c'mon\nWe got Kelis muh'fucka, c'mon\nNeptunes muh'fucka, c'mon, yeah\nBus-A-Bus muh'fucka, c'mon , yeah\nEverybody in the spot, c'mon, yeah\nWhat it is right now, c'mon\nBus'll tell ya what it is right now, c'mon\nBus'll tell ya what it is right now, c'mon\n2001 hot shit, c'mon\nHot shit, hot shit, hot shit, c'mon", "image": "https://images.genius.com/2266cc61db175c2ab21e39606b81c760.600x584x1.jpg"}], "artist": "Busta Rhymes"}