{"songs": [{"title": "Imagine", "album": "Tha Blue Carpet Treatment", "year": "2006-11-21", "lyrics": "[Intro: Snoop Dogg]\nYo Doc what up my nigga\nSnoop Dogg, this is what it is mane\nThis record is so motherfuckin' gangsta man\nI think it's time for me and you to just, tone it down a bit\nCome on...\n\n[Dr. Dre]\nImagine it never happened\nImagine no rappin'\nImagine niggas trapped imagining having action\nImagine how these niggas could be actin' if we never got this shit crackin'\nImagine life's so hard\nYou can't imagine it's like livin' in the City of God, you feel me?\nImagine life on the yard\nOr tryin' to get that dollar on some shitty ass job\nImagine Biggie with his son\nImagine Pac gettin' called 'pop' by one\nImagine a mother struggling\nDealing with a system that don't give a fuck about who shot her son\nImagine life where you can't win\nWhen you get out of the ghetto and go right to the pen\nWhen you get out to the pen you go right to the jenz\nSo if you get back to the streets you go right back in\nImagine Russell still struggling\nNo Def Jam, just another nigga hustlin'\nAnd ain't no rocks on them fellas\nJust rocks on them fellas, just tryin' to keep it bubblin'\nImagine niggas just stuck\nFrom the East to the West Coast, everybody fucked up\nI can't imagine no less\nBut it don't take imagination to know niggas been blessed with hip-hop\n\n[Hook: D'Angelo]\nBefore we go, can you imagine?\nWith your ears, clear your mind – can you imagine?\nPaint a picture in the sky - can you imagine?\nPlease call emergency I've been dreamin' all my life\n\n[Snoop Dogg]\nCan you imagine being lit up by some hot shells?\nImagine being tossed around and put in jail\nImagine life when you can't get from under\nImagine niggas at ya when you done fo'\nRemember how they asked you \"What you run for?\" and treat ya like a bitch\nWhen they kick you in your dick and take your shit\nReactin' like they hate to see you gung ho\nBut just imagine if the rabbit got the gun, though\nBut you already know\nImagine niggas in the LBC\nFelt just like Snoop Dogg and D-R-E\nAnd felt just like them niggas in the 2-1-3\nThen imagine that's what's coming when you fuckin' with me\nImagine you was up on top of this shit\nImagine if the bitches could stay off this dick\nI mean, imagine we said 'fuck this shit'\nImagine if my niggas got together and tore up this bitch, yeah\nYou can't imagine growing up in the jail, dumb\nHappy just to be alive, watching all your people run\nWould you imagine growing up to sell you 50 million records\nWorldwide or fuckin' off somebody's son\nImagine if these niggas never saw a color\nWould it be peaceful in them streets where niggas kill each other?\nAll a drunk fool get is pissed-on balls\nHe fuckin' off my niggas, they gone murder us all\nImagine that\n\n[Hook: D'Angelo]\nBefore we go, can you imagine?\nWith your ears, clear your mind – can you imagine?\nPaint a picture in the sky - can you imagine?\nPlease call emergency, I've been dreamin' all my life, all my life\nBefore we go, can you imagine?\nWith your ears, clear your mind – can you imagine?\nPaint a picture in the sky - can you imagine?\nPlease call emergency, I've been dreamin' all my life, all my life\n\nImagine, imagine\nYeah, yeah, oh yeah\nCan you imagine?\nCan you imagine?\nCan you imagine?\nImagine, imagine\n\n[Outro]\n\"In the name of Allah, in the name of God\nThe beneficent, the merciful\nThe one God to whom all praise is due\nRegardless of land, labor, or title\nNo matter what name you call God by\nWhenever life seems hard\nEverybody know that you must﻿ talk to God\"", "image": "https://images.genius.com/9eeff8d4aa3579798c6d6f74d21fad47.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}