{"songs": [{"title": "If They Love Their Kidz", "album": null, "year": "1996-01-12", "lyrics": "[Intro: 2Pac]\nIf my enemies love their kids\nOnly if my enemies love their kids\nIf my enemies love their kids\nIf my enemies love their kids\nOnly if my enemies love their kids\n\n[Verse 1: 2Pac]\nHey, why have drama\nNigga, your baby mama stay right around the corner\nI could touch her if I fuckin' wanna\nSo why you wanna insist to diss?\nI got your name at the top of \"fuckin' dead bitch\" list\nMeet Mr. Makaveli's terror, mack of the year, thug of the era\nDeath Row and Outlawz, nobody does this shit better\nMy lyrics explode on contact, best prepare for combat\nAin't no stoppin' so bomb back\nIt's the last days, niggas is dyin' for bullshit\nMAC-11 is heavy, yet I'm ready to pull quick\nNiggas ain't ready for a brother that's livin' major\nBear witness to a sick motherfucker that's spittin' razors\nWhen I cut 'em they cut, when I stick 'em they stuck\nAnd my ambitions to bust, 'cause I ain't givin' a fuck\nWe tore the neighborhood up, look at all the shit that we did\nMurder's a life long bids, if my enemies love they kids\n\n[Hook: 2Pac]\nYou don't wanna die\nAnd I don't wanna kill ya\nKeep my name out ya mouth\n'fore a nigga have to drill ya\nAll my enemies buried for the shit that they did\nDon't make me murder you nigga\nIf my enemies love their kids\n\n[Verse 2: 2Pac]\nBodies is wrapped in plastic, nigga, this is drastic\nJust takes a nigga with the right automatic to cause static\nLike a Mossberg dumpin', and muthafucker'll do jumpin'\nMake 'em role of a bitch, like Michael Jackson, \" Wanna Be Startin' Somethin' \"\nHolla at my crew and they perish, who do you cherish?\nGot that ass in my sight\nTonight I'm bussin' off the terrace with multiple gun shots\nNiggas is droppin' rapidly, bussin' at crooked cops\nThem bitches is runnin' after me, tell 'em I'm high\nWhen they ask \"why I'm trippin' out the top of my drop?\"\n'Cause you know why?\nKeep dippin' on my block they sell rocks and box with frail cops\nIf not we buss shots from Glocks, fuck cops\nMy only fear of death, can you hear me, it's \"comin' back\"\nHad enough of this bullshit world so none of that\nI felt no remorse for all the shit that we did\nNiggas dyin', hear the sirens, if my enemies love their kids\n\n[Hook: 2Pac]\nYou don't wanna die\nAnd I don't wanna kill ya\nKeep my name out ya mouth\n'fore a nigga have to drill ya\nAll my enemies buried for the shit that they did\nDon't make me murder you nigga\nIf my enemies love their kids\n\n[Interlude: 2Pac]\nYou muthafuckin' right\nThese niggas better wise up\nIt’s a real muthafuckin' war nigga\nYou don't wanna get with me\nHow the fuck you gon' get with me\nIf you got kids muthafucker\nIf my enemies love they kids\nI’ma let my lil' homeboys ride on you busta muthafuckers\n'Cause y’all don't feel me\nEh yo Mu, K, Malc\nRide on these bitch ass mothafuckers\nRide on 'em!\n\n[Verse 3: Napoleon]\nI don't even wanna talk no more\nLosin' your life, what for?\nFacin' a young muthafucker who puts it down for the dough\nGet killed in front of your kids, God forbid if it happen\n'Cause the shit I'm on now I'm taking pass on us rappin'\nGotta survive by myself, but at the same time get wealth\nWon't put my gun on the shelf, it keeps me livin' like heaven\nBut when the shit jumps I'm ready 'cause I already knew\nYou better get us muthafucker 'fore we come get you\nDeep in my heart I think this shit's about to pop any moment\nTryna do me like my parents but I'm a tougher opponent\n\n[Verse 4: Kastro]\nThis nigga scared, must be rusty and all I'm prepared\nFor all the drama, you stayed with all them niggas you feared\nYou fuckin' busta, musta let the evil or the money trap you and slappin' at'chu\nEvery second we comin' at you and you the last one\nWhen no rocksis tryna cast one\nGuess a young rider who would die for fuckin' blast of that thug passion\nClashin' on enemies passin'\nGigglin' when they should've been figurin' who would be the last one, laughin'\nWhile I switch your wig, I gotta ask y’all somethin'\n\"Don’t y'all muthafuckers got kids?\"", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}