{"songs": [{"title": "Looking Back", "album": "DIME TRAP", "year": "2018-10-05", "lyrics": "[Intro: Dave Chapelle]\nWho the fuck is that?\nYeah, bitch, it's me, it's me\nSo humble, I'm so humble\n\n[Verse 1: T.I.]\nAy, tell me what you gon' see looking back at yo' life\nWon't be worth a damn, if you ain't living it right\nAll we know is stripes, learned to die for respect\nYou make a lot of money, they admirin' that\nWe gettin' bags here, playa, it just is what is is\nFall, flay, do or die, kill or be killed\nRemember, walking Bankhead was a terrible thought\nIntensions ain't work, tryna come up now\nI'm prayin' God blessed me and this life I chose\n'Cause the new Benz dropped, can't be ridin' the old ones\nIn 12 hours, I done raised hell and shit\nMiddle of the crack era, tryna sell and shit\nIn Vegas, fightin' police, me and Jeezy and 'em\nHit the strip, Fat Burger, did my thing again\nAll I do is kick back, blow gas and smile\nReminiscin' 'bout when I was young and wild\nYou're still feeling the effects of the shit we did\nBefore us, drug dealers didn't get this big\nWhere I'm from, it ain't glamorous, quite the different outcome\nYou have a run, get indicted, then forget about him\nSo much greatness but not so many make it, wonder how come?\nIt's been that way since Huey Newton, Martin, Malcolm\nI got a grind and a hustle, I ain't hearing it\nPlus a 1 of 1 drip that my daddy had\n\n[Chorus: T.I.]\nAy, tell me what you gon' see when you looking back at yo' life\nAy, tell me what you gon' see when you looking back at yo' life\nLooking back at yo' life\nAy, tell me what you gon' see when you looking back at yo' life\nLooking back at yo' life\nAy, tell me what you gon' see when you looking back at yo' life\nLooking back at yo' life\n\n[Verse 2: T.I.]\nOn the front line facin' off with the L.A.P.D\nOnly nigga ain't a gang member is me\nI'm certified through and through, ain't nothin' flawed 'bout that\nThe nigga was talkin' shit in Houston, went and saw 'bout that\nIn Cincy, caught me slippin', lost my homeboy 'bout that\nSome bystander died after but never quite got back\nI heard they caught 'em, I'm thinkin', 'We could pay the bond, I bet'\nAnd then wait, 'Am I a maniac for thinkin' of that?'\nListen, my freedom on the line, I'ma square up and cap\nBut nigga lyin', talkin' 'bout I told, he really chillin' with a rat though\nWe through Paperwork party, show mine on a yard\nAnd gym park; coached ball, taught a class and all\nWith the only one from Georgia gettin' regular visits\nFilled up a couple busses so my people could kick it\nReally did that, how the fuck you live with yourself?\nKnowin' the only thing you ever did, you did it for self\n\n[Chorus: T.I.]\nAy, tell me what you gon' see when you looking back at yo' life\nAy, tell me what you gon' see when you looking back at yo' life\nLooking back at yo' life\nAy, tell me what you gon' see when you looking back at yo' life\nLooking back at yo' life\nAy, tell me what you gon' see when you looking back at yo' life\nLooking back at yo' life\n\n[Outro: Dave Chappelle]\nEverything I say, is the truth. And that's a lie. And that's the motha fuckin' truth", "image": "https://images.genius.com/762209f629de50995145f116f95b5ea9.750x750x1.jpg"}], "artist": "T.I."}