{"songs": [{"title": "Bond", "album": "The Ruler’s Back", "year": "1991-07-02", "lyrics": "Yeah, boy!\nCheck it out Slick, ya know what I'm sayin?\n\nNo complaining\nI reached my destination and its raining\nI'm in Colombia, the Bond steps off the plane and\nI hear a hollar from a bro with ring around the collar\nIts chief of police, grease Bond, tell me to follow\nTreated me to everything, no taxin, maxin\nGives me a hotel suite for me to relax in\nSeems everyone was on my silk drawers\nA cloud does it have to bug me a daffy nerve\nJumpin out the closet, word up, dead nigga\nSaid \"Chief how do you figure tryin to arrest me, the Double for the\nMurder of the nigga?\"\nNow in a cell, but not for long, and now I'm out, I hear a weeping\nOne asleep, other sleeping, kept creeping\nBumped into another, my appearance was alarming\n(To who) some lady that thought I'm charming\nPlease, the way I is I don't even have to say hon\nSo who's a Don?\nYou better believe the nigga keeps girls fond\nThe name's Bond!\n\nWell, I'm outside and its the chief with twenty thiefs like the brainiac\n\nAware because the Double 0 was bucking like a maniac\nTill nobody lives, so hon, nowhere to do correct\nSaid \"excuse me baby, but where they hiding the hooker at?\"\n\"Around the block, but chill at least chill till the storm has stopped\"\nDecided it was a helicopter, sounds like its warming up\nGrabbed ya leg, shot the chief, someone said \"Stop hawking\"\nShook me off at twenty-thou, the Bond got up walking\nThey was laughing as they left they grew thinner like Iraqi\nGot the plans from the dying chief of police in her pocket\nTo make it even worse honey girl was definitely rattin'\nWas holding her in a club that was happening in Manhattan\nI'm on the plane in the day seemed nothing was a phasing\nExcept for the stewardess jocking the Amazing\nBut kept my composure, had another honey hon\nWho the Don?\nBetter believe the nigga keep girls fond\nThe name's Bond!\n\nBack at home in New York, I didn't want to get too overfly\nYou wanna know why I pulled out my 535i? (pimp!)\nBoy I see some lookouts with some girls that's annoyed\nIt was a private engagement for the dealer and the boys\nDouble just passed the hoods with their faces painted\nWalked in, say a good twenty girls fainted\nThrow cousins all out but seems that everyone was shitting\nAnd man I was so cool I even carried me a kitten (reowr!)\nTrouble for the Double 0? Wouldn't swallow that\nWho's the man with the Golden Gun and all of that\nTurned curls of mercy, left blood on the walls of\nRescued the shorty who was all on the walls of\nWhore said \"You're late!\" I don't wanna hear none of your dissing\nNabbed the cash, made a good twenty million on the mission\nGood job, not to mention had the boss honey hung\nSo who's a Don?\nBetter believe the nigga keeps girls fond\nThe name's Bond!", "image": "https://images.genius.com/f966841215ba401665c2c00044999e50.500x500x1.jpg"}], "artist": "Slick Rick"}