{"songs": [{"title": "Blow Job Betty (original)", "album": "Raw, Uncut and X-Rated", "year": "1986-11-05", "lyrics": "[Intro]\nMan, i rap so much\nI started to record over\nBecause i got so much raps ain't no record can hold it\nAnd that's so true about Too Short\nBitch must've told me, she said \"Too Short, i love you\"\nAin't that a bitch? she said \"I love you\"\nYou know what i said?\nI couldn't even start rapping. i said:\n\n[Verse 1]\nBitch, who are you?\nYou said you love me, but is that true?\nYou asked me could you by my lady\nYou wanted so much to have my babies\nSo what, bitch? i bust your cherry?\nHell fucking no, i don't wanna get married\n'Cause can't no bitch hound me\nTalking some shit about a family\nI'm a player, and she's my whore\nI'm Sir Too Short and i'm a [?]\nThe last thing i need is a wife\nImma keep that title for my whole life\nBut if i would, what'd happen to be\nToo Short, baby, what would you see\nIf i had a son, say i had a son\nHe'd be rocking cocaine by age one\nIt's true, homeboy, it's not a cap\nI'mma tell this shit on the Short Side rap\n'Bout the ladies, the women, the girls and freaks\nI got a rap for them, so listen to me\nI've been trying to say this all through my rhymes\nI'm gonna say that shit just one more time:\nNiggas ain't fucking, we're getting rich\nBut that don't mean you can't suck dick\nToo Short ain't shit i made up\nBut you sucked my dick and you never got fucked\nYou say i'm not the real McCoy\nBut you sucked my dick and my homeboy's\nYou're a pro at sucking head\nYou licked my balls where it feels best\nYou sucked my dick better than right\nAnd that right there is Short Side\nThe pimp tip, could never quit\nI heard a freak say: \"that's the shit\nHe took the cake,  fucked a break\nToo Short, baby sure ain't fake\"\nThat's right, young freak, i'm your commander\nWhen it comes to Short [?]\n'Cause a nigga ain't lame, step back bitch\nUnless you're trying to make me rich\nYou told your friends i wanted you\nYou dumb sprung freak, that's just not true\nYou came to me and you had to ask\nAm i Too Short who sings the rap?\nWhen i replied: \"yes i am\"\nWe were walking down the street, holding hands\nThen Too Short spit a [?]\nAnd the next thing you know, we was all [?]\nSomeone had to ask my why do i call this rap \"Short Side\"\nWhy, 'cause someone said to me \"Too Short, side on that freak\"\nIf you drop the \"Too\", what's the tip?\n\n[Outro]\nShort Side, Short side, you freaky bitch (echoes)", "image": "https://images.genius.com/5596228ae8537847e97db188cbe62640.1000x952x1.jpg"}], "artist": "Too $hort"}