{"songs": [{"title": "Stick 2 the Script", "album": "The Dynasty: Roc La Familia", "year": "2000-10-31", "lyrics": "[Intro: Jay-Z & DJ Clue]\nYeah.. DJ Clue! A/K/A/, William, M. Holla..\nWith William H. Holla\nThe world's most infamous\nThe Holla family nigga\nRoc-A-Fella Records, c'mon\nDynasty! New Jay-Z! Beanie Sigel!\nStick to the script!\nWe live money over bitches nigga stick to the script\nRemember where you heard it first.. stupid!\nCop, flip, we re-up; get back to the shift\nMoney over bitches nigga stick to the script\nDJ Clue!\n\n[Verse 1: Jay-Z (DJ Clue)]\nYO, they call me William H. (H!) the all-time great (GREAT!)\nI fuck the most hoes out of New York State (STATE!)\nI rock my jewels (JEWELS!) I'm not a fool (FOOL!)\nIn the small of my back I got this big-ass tool (ha hah!)\nWhen I'm skatin' through the city and I stop and kick it\nBe the most asked question - how I got them digits?\nI say I stay on my grind, never stop for bitches\nNever talk like a mime I gotta watch you snitches\nAnd I stick to the script, that's my advice so live\nEat nigga, let it stick to your ribs\nI seen niggas go from handlin' birds to ramblin' words\nTo the man, seen a Sammy the Bull emerge on the stand\nAnd it was all good just a week ago\nWe lost Ty and E, but we still eatin' though\nFor like a hundred weeks nigga, we gon' run the streets\nTil we reach Malik or the date of E's release\nPeep Hova in a Jeep Rover, passin' reefer over\nTo this freak, breathe mami this is good weed mami\nThree, hommies under the belt, three extra clip\nWe aim, we shoot; y'all shoot aim, we stick to the script\nC'mon!\n\n[Chorus: Jay-Z]\nMoney over bitches nigga stick to the script\nWe cop, we flip, we re-up; get back on our shift\nMoney over bitches nigga stick to the script\n{*scratch* \"You can bullshit with rap if you want, muh'fuckers\"}\nMoney over bitches nigga stick to the script\nWe cop, we flip, we re-up; get back on our shift\nMoney over bitches nigga stick to the script\n{*scratch* \"You in the streets nigga, make your moves\"}\n\n{*scratch* \"Y'all niggas truly ain't ready for this Dynasty thing\"}\n\n[Verse 2: Beanie Sigel]\nGeah, uh-huh\nYeah, money over bitches nigga\n{\"This Philly cat back- back at it\"}\nStick to the script, yo\nAyo, they don't call me Mack for nuttin'\nI don't give a whore jack, man they all say that Mack be frontin'\nBut if you can't take a case bitch and take it to the chin\nTake the heat, beat your feet bitch, skate in the wind\nDon't snitch, we can blow dough, make it again\nYou can be my ho bitch, I can't make you my friend\nBecause - friends depend on friends, not Bean Sigel's shit\nI don't need you; let welfare feed you\nMack'll, stick to the script, and stick to the flip\nI got a sick whip game, water stick to the bricks\nI got a sick flip game, order gettin and shit\nI got a strict strip, flip 'caine, get it in shifts\nBitch, you can't get at me, shit I get at you\nOnly in the physical, I tell you like Mystikal\n\"Shake that ass (yeah) watch yourself\n(Yeah) show me what you workin' with but wash yourself\"\nFuck a dirty bitch (yeah) man I roll with a sturdy click\nThat'll murder shit, empty clips you never heard a spit\nSlide a bitch what? Slide a bitch shit\nSlide a bitch dick, then I slide out a bitch shit\nAin't no time to stick around and play step pops\nShit I'm tryin' to get down, cop and upset blocks\nLow price, quick flip, 2-8-K quick\nShit don't go right, 2 AK's spit - stick to the script nigga\n\n[Chorus: Jay-Z]\nMoney over bitches nigga stick to the script\nWe cop, we flip, we re-up; get back on our shift\nMoney over bitches nigga stick to the script...\nMoney over bitches nigga stick to the script\nWe cop, we flip, we re-up; get back on our shift\nMoney over bitches nigga stick to the script\nY'all get knocked, y'all turn bitch\nWe get knocked, we never snitch, c'mon", "image": "https://images.genius.com/c91a9bc0eb9aaf290224ebeaabd243a0.640x640x1.jpg"}], "artist": "JAY-Z"}