{"songs": [{"title": "The Universal Magnetic", "album": "The Universal Magnetic / If You Can Huh! You Can Hear", "year": "1997-01-01", "lyrics": "[Intro]\nYeah, ha ha ha\nA-B-boys rock the world\nCD's and tapes help generate papes\nE-F is the end part of Def\nG-good, H is what style be\nWhen I grab the microphone and MC\nRoll off the tongue like L-M-N-O-P\nAnd when I am done you will agree\nMos Def represent most definitely\nJeans is what I used to rock in '83\nDrank up all the Kool-Aid at the block party\nUsed to wish I could break with Rock Steady\nWatched Tenspeed and Brown Shoe on TV\nBut now it's not dis and it's on like this\nMy name is Mos Def, this is good as it gets\nBaby I make you rub your mitts like sardines and grits\nMy shit still hit, even when the record skip\nEven when the record skip\nEven when the record skip\nI don't quit, I don't quit\nWe 'bout to make this one the sure hit\nShawn J. make the party people feel it\n\n(Ladies and gentlemen, we'd like to introduce a very\nInteresting young man that has traveled from very far\nAway to be with us tonight)\n\nThere is such a place that creates such a melody\nBrooklyn! Go ladies!\nIt's a living dream, it's a living dream, it's a living dream\nLove like this!\n\n[Verse 1]\nRecognize all area crew\nWhether you speak Japanese or Goonie Goo Goo\nSon when I come through, other rappers boo-hoo\nCause they know they style's soft like baby doo-doo\nI will continue to hit like a fifth of Stolichnaya\nPutting jokers on ice to get the cream like Breyers\nNo secret, Mos Def is the one the hons admire\nI get in my stance and set the dance on fire\nSpread out my wings and I take the world higher\nPeace to the fam magnetic in the Chi\nJah Born, Top Sean and my man Ato\nAnd all my other clan who reside in the Zoo\nGot the celebrated oatmeal broadcast brew\nMos Def gon' keep it naked like Umfufu (Eddie!)\nWords adhere to the tape like crazy glue\nSo when they bounce out of speakers they stick to you\nThe way that I communicate is non-typical\nBut eye level like a 3-D visual\nI hold the mic extension, exhibit level and dimension\nAnd radiate the space like a upright bass\nYo son I leave crews laced and escape with no trace\nSound official like the finish time at a horse race\nHere to put it in place, for the nine-uno-seis\nMos Def set the pace, make your fam give chase\n\n[Hook]\nRaise your hands in the air, everybody get with it\nUniversal Magnetic B-Boy, scientific\nIt's like that and you don't stop\nIt go on to the rhythm you don't stop\nRaise your hands in the air, everybody get with it\nThe Universal Magnetic B-Boy!\nScientific y'all, you don't stop\nIt go on to the rhythm you don't stop\n\n[Verse 2]\nBaby it's in my chromosomes to rock microphone sets\nWho wanna test the M-O-S just leave that shit alone\nI make no bones or poems about dropping bars\nMake the world fall sway under the Mos Def, yes\nI ring the alarm like Tenor Saw\nMy style hella-raw, I keep it raw bone like Skeletor\nAnd you should go and tell your clientele\nThat they need to get the message like Melle Mel\nI got the shit on lock like a death row cell\nAnd if I ain't a b-boy, Premier never used a bell (ding ding)\nSo tell your poor ass crew to retire\nBefore I make they ass catch fire like Richard Pryor\nNon-descriptive fiending for riches, calling Earths bitches\nBut most of y'all brothers is living with your mothers\nThe boogie man yanking up your covers\nSharper than some new box cutters, on Parkay's and butters\nAnd Stevie Wonder's, to make you run and tell the others\nThe beat lovers, and play my jam like the numbers\nSon I rock the globe like I rocked your boat\nI'm 'bout to tap it on your shoulder cause you got to know\n\n[Hook x2]", "image": "https://images.genius.com/4c11dc2db95d74f078cbd2d3ba8f0118.640x637x1.jpg"}], "artist": "Yasiin Bey"}