{"songs": [{"title": "All Night Long", "album": "One Day It’ll All Make Sense", "year": "1998-01-25", "lyrics": "[Common (with Badu singing in background)]\nYeah.. wanna feel the vi-ah-hi-hibe\nWanna feel the vibe, wanna feel the vi-ibe!\nUhhh.. wanna, what? Yeah\nWanna, what? Uhh, yeah (come on)\nEvery-bod', c'mon, uhh\nYo, yo.. (all night long)\n\n[Common]\nDuring divine hours, I use mind power to refine\nFlower girls, and make 'em feel like black pearls\nGet they minds off acryllic nails and the rap world\nIt's a lot you can find in the lost black girl\nMa-sons build in lodges, we be in garages\nDiscussin' who we boned and who God is\nPro-black like Craig Hodges with my dashikis in the cleaners\nI kick it for the Chevy ridin' head to backstreet leaners\n\n[Erykah Badu (with Common)]\nAllllll.. (uhh) niiiiiight.. (yea yea, what?) [HAH]\nAllllll.. [HUH, UHH] niiiiiight.. (whatcha say now Bee, what?)\nAllllll.. (yeah, yeah yeah) niiiiiight.. [AOW! Aoww-owwww]\n(to freak it with the) Allllll.. (now let me get a piece of this)\n(let me get a piece Bee) niiiiiight..\n\n[Common]\nCheck it, check it\nI was born underwater with three dollars and a cocktail\nTryna make the Garden of Eden, out of Auckdale and Rockwell\nLocked in this Grid like a 2Pac tale\nWild hair and rock smells make the cops tail\nMy third eye is my rail, on this L of thought\nWith afrocentric stamps I'm mailin' thoughts to my Gods held in court\nI dwell where rebellion's taught, and emotions seldom walk\nI try to walk like an Egyptian, but Hieroglyphics fail to talk\nI guess the hustlin is the unspoken Gospel\nLove that I'm an apostle, feel the holy spirit of Chicago\nE Bottom, here's the bottle\nI think I, need a cup of a tea, because I'm novel\n(come on bay-bayyy) Bust it\n\n[Erykah Badu]\nIahhhhh jus' wanna rock you\nAlllllll night looooong\nAllllllll (come on bay-bayyy)\nAll night long.. all night long..\nAll night long.. on and on and on and onnnn (come on bay-bayyy)\nIahhhhh jus' wanna rock you (all night long)\nAlllllll night looooong (all night long)\nAllllllll (on and on and on and onnnn) [HAH, UH-HUH]\nIahhhhh (all night long) jus' wanna rock you (all night long)\nAlllllll night looooong (all night long)\n{what? yo-yo, yo-yo yo-yo check it, check it}\nOn and on and on and onnnn\n\n[Common]\nA portrait of the Artist, formerly known as Sense\nThe brain-wash, with my vocal tones I rinses\nOpportunity and the beat knocks\nWomen, give me rhythm like beatbox, but it's the year\nOf completion, I want a Queen to complete Rash'\nWho's flavored from stacks, to Reeboks\nSend blessings to the family of Ice Mike\nShit like that, don't help me write right, but I got site/sight\nLike a construction worker, when it's time to build\nGet off like Sam Jack' and it's time to kill\nIn perserverence I'mma find a meal, and provoke\nMy Gramps used to trick off big papers at the Riverboat\nIt go..\n\n[Erykah Badu (with Common)]\nAllllll.. niiiiiight.. all night\nAllllll.. niiiiiight.. you got it goin all night\nAllllll.. niiiiiight.. y'know, y'know it all night\nAllllll.. niiiiiight.. oahahhhoahhohhhhhh (yea, yeah)\n\n[Erykah Badu]\nIahhhhh jus' wanna rock you (one more time)\nAlllllll night looooong, oahhhhohhh (ebb in feelings)\nIahhhhh jus' wanna rock you (I ain't sleeping)\nAlllllll night looooong (all night long)\nOn and on and on and onnnn\n\n[Common]\nCheck it\nI walk downtown to tempos and never lose the beat\nSome people got ignorance confused with bein' street\nOn the, street of desire my body and soul meet\nArguin over thick broads and meals with no meat\nHad the cold feet for a second\nMega-niggas in my box throwin suggestions\nHad me checkin' myself and double checkin', I popped the resurrection\nIn the mirror I only heard my reflection\nLet me hold mics, while you hold dicks and CD collections\nAnd at MusicLand and Coop's, we can make connections\nI meditate with confidence, to not chomp on cents\nOutspoken like 30's but yet I guard my lips\nWritin niggas with stripes, I hold posture with\nPoppin shit to fat broads, wearin os-trich\nGivin em voicemail, tracks are like County\nTo them I voice-jail/gel, if you believe in Heaven\nWhy is the choice Hell? Why is this choice Hell?\nWhy is this choice Hell?\n\n[Erykah Badu]\nIahhhhh jus' wanna rock you\nAlllllll night looooong, oahhhhohhh (keep goin)\nIahhhhh jus' wanna rock you (keep goin, keep goin, keep on)\n(and don't you give up) Alllllll night looooong (ah keep on, ah keep on)\nOoahhhoahhhhh (ah keep on, ah keep.. ah don't you give up)\nIahhhhh (all night long) jus' wanna rock you (all night long)\nAlllllll night looooong (if you want it you can have it lay upon my rest)\nOn and on and on and onnnnnnnnnn (keep it goin baby)\n(if you want it you can have it lay upon my rest)\nIahhhhh jus' wanna rock you (all night long)\nAlllllll night looooong (if you want it you can have it lay upon my rest)\n(all night long) On and on and on and onnnnnnnn\n\nAlllllll (if you want it you can have it lay upon my rest) niiiiiiiight\nAlllllll (and if you want it you can have it lay upon my rest) niiiiiiight\nAlllllll niiiiiiiiight\nAlllllll niiiiiiiiight\nAlllllll niiiiiiiiight\nAlllllll (don't stop now) niiiiiiiiight (no no no, no, uh-uh)\nAlllllll (you bet' not stop) niiiiiiiiight\nAlllllll niiiiiiiiight\n\nYeahhhhhh.. Common Sense, and Baduuuu", "image": "https://images.genius.com/c8ce7467dc2a6ebbdc0659b93da16bb6.424x420x1.jpg"}], "artist": "Common"}