{"songs": [{"title": "World Domination", "album": "1999", "year": "2012-06-12", "lyrics": "[Produced by MF DOOM]\n\n[Intro: Sample + Joey Bada$$]\n\"Say, Brain—what do you wanna do tonight?\nThe same thing we do every night, Pinky: try to take over the world!\"\nWho the fuck is this Joey Bada$$ nigga, son?\n\n[Hook]\nAyo, who the fuck passed you the mic\nAnd said that you could flow? Point 'em out bitch, I wanna know\nWho the fuck passed you the mic?\n\n[Verse]\nCheck!\nPuffin' on stramonium, underground like potholes but going fossil\nThese bars like art in the Smithsonian\nThese flows is for custodians, homeless men, horny OBGYN dudes\nBrowsing my laptop lookin' at red fallopian tube\nThey like \"Yo Joey, you rude\", I'm like \"If only you knew\nI'm only in school for cosmology, that's why I act as lonely as you\"\nYou see I'm wise beyond my years and my peers\nSo my voice over the snares is the only way they hear\nWhat I got behind my membrane, but I've been smoking chem strains\nSo lately I've been having hard times with remembering\nBut be patient, my studies prove Egyptians ain't shit\nCause I believe that we could be like Neo in \"The Matrix\"\nBut fuck it, I'm erratic, momma lock me in the attic please\nTil I draw enough static in my somatic anatomy\nAnd come out imputed with fusions of \"Blueprints\" and \"Illmatics\"\nI’ve been going raw, this just how I feel rappin'\nWe gave y'all Sur' Tactics, so y'all can’t even gas us\nWe taught you how to be prepared but still attacking the masses\nY'all better get y'all caskets cause we ‘bout to annihilate\n(The new Babylon era) My empire gate’s in the Empire State\nI’m on the higher platform, look at the way they clap for ‘em\nNever fuck with phony men cause I don’t like my back torn\nNigga ask Kwon, this that top ramen' you ain’t used to\nKeep it neutral to scruple and tell ‘em no beef like noodles!\nKeep it neutral, just so you can scruple\nI tell ‘em no beef like noodles\n\n[Bridge]\nIt’s world domination, nation, you’re tuned into my station\nAlways got a doobie and a motherfucking eighth lit\nAlways got the trees, so what the fuck you mean\nI ain’t about to rise to the top with my fucking team\nIt’s world domination, nation, you’re tuned into my station\nAlways got a doobie and a motherfucking eighth lit\nAlways got the trees, so what the fuck you mean\nI ain’t about to rise to the top with my fucking team\n\n[Hook]\nAyo, who the fuck passed you the mic\nAnd said that you could flow? Point 'em out bitch, I wanna know\nWho the fuck passed you the mic?\nAyo, who the fuck passed you the mic\nAnd said that you could flow? Point 'em out bitch, I wanna know\nWho the fuck passed you the mic?", "image": "https://images.genius.com/252e8274d38f0d4a7ea351dd63231cbb.612x612x1.jpg"}], "artist": "Joey Bada$$"}