{"songs": [{"title": "Who Want It?", "album": "The Bar Exam", "year": "2007-04-07", "lyrics": "[Intro]\n(Big shout out to The Alchemist)\n\n[Verse]\nI'm the most cold blooded, gold flooded, iced out, star studded\nFly like the ghost of who died cause the coke done it\nClean like that Maz' that I got in my garage\nWhen that 'rati rides up (Ahhhh), you gon' know it's not a Mazda\nI zone better than you cause I exercise with my hoes\nBut my trigger finger got it's own regimen\nI'm so sick like Ne-Yo I got my own medicine, I do my own edits\nC'mon, you know if your crib ain't got no echo, let go you ain't a star\nI let go and send bullets like petrol into your car\nPut your stunner shades on fix your eyes to look at me\nI'm standin but still but yeah my chain is doing the Watusi\nWhy the fuck they spend so much on those - why wouldn't we?\nPlus I'm tired of niggas talking bout what I shouldn't be (yeah)\nPut the tools to 'em put the magnum in gear\nThen, sing the blues to 'em let them things cruise through 'em (blao)\nBelieve you me I be squeezing that E-Uey, niggas will bleed\nBetter breathe, you might re su me\nThat's the resume nigga, don't it seem roomy?\nDon't it read long? Don't my name got a ring to it?\nLike a ringtone patterned after King Kong\nAdam Eve, battle rappin, tabernacle theme song\nThat's cause I'm a natural, striking like I'm lightin matches\nI could west, south, Midwest or bite the Apple\nPsychopathic, when he on the track it's like it's magic\nThe city on his back just like his jacket (Woooo!)\nThe gats that we pack got extensions attachments\nPut away your pencils and pens if you rappin\nYou ain't gotta write rhymes you could have 'em all in your head\nI'll read 'em off the floor when you dead (yeah)\nMost lyrical I am in a category with none\nCompare me to who? If it ain't the Notorious One I'm buryin' you\nCause squeezing ain't shit, my guns be speakin to players like Stephan A. Smith\nAnd believe me they spit, however you want it\nI put up them numbers every season that's the reason they sick (keep goin)\nI don't pop a lot of bologna, the parkin lot I shot up your homie\nI rocked a lot of Prada, lot of Brioni\nWe only rock shoes once and give 'em to my niggas (uh huh)\nWhile you still cleanin yours and stickin your socks in 'em (yeah)\nIm just a hot nigga, them Glock triggers givin you riga'\nBroadway and I'm all day like a city slicker\nYou bigger than me I still get you, I'm so shiest'\nI ghost write if I wanted I could let Diddy dis you (keep goin)\nCome through your city like the six is a tanker van\nHave them killers show up to the scene like the anchorman\nAnd they'll give you the news without the down payment\nUp comin rapper was slain but he is now famous (uh huh)\nEtch out you, blow your chest out you\nNext album no need to know the rest bout you\nWhile you in the air killed just hoverin there chillin (What you doin?)\nIn the Hilton in Paris fuckin with Paris Hilton (Damn!)\nYour little bro at the podium reading goodbyes\nI'm getting blowed by a ho in a V Dubai\nTo prove my worth I did my dirt, the most you can do to the ghost is kill my curse\nThe most you can do to me now is steal my work\nYou still can't touch it I'm dope, just feel my verse (keep goin)\nMy artistic thought process is all twisted\nThe raw shit I thought of came from awe disses (yeah)\nThe object of narcissism the sharp weapon\nI start guessin 'em all guess that I'm autistic\nPreach! Nigga my speech is reachless, untouchable by any livin creature\nAny way I'll meet you (yeah), anywhere I'll beet you (yeah)\nBed time to headline or anywhere I feature (uh huh)\nNiggas ain't tryin to hit nickel up to do songs (Naw)\nLast one done it still pissed cause I pooped on him (hahahaha)\nMade him write his verse over like I looped on him\nOh (seven), Royce Da 5'9\" nigga who want it?\nNobody", "image": "https://images.genius.com/4f966eb73a81b58069fb8aff648de307.700x700x1.jpg"}], "artist": "Royce da 5'9'’"}