{"songs": [{"title": "S.T.R.E.S.S.", "album": "Room for Improvement", "year": "2006-02-14", "lyrics": "[Intro: Drake]\nYeah, Ren, M.O.F, Haha\nIt's Drake man, it's Drake man.Yeah\nAyo Ren this that gritty shit here man\nI'ma have to tell them about I been through on this know what I mean\nHO! Southern Smoke!!!\n\n[Verse 1: Drake]\nVery few give you that truth, it's either they can't do it with lyrics\nOr can't do it in spirit, they cancel what they doin'\nThe samples that they usin', can't get through the clearin'\nI'll handle it since they just can't get you to hear it\nMy father's early careerin' forced my parents to split up\nMy mother was a teacher, my father was kind of fed up\nWith just being a florist, so the choir sang his chorus\nAnd he got back into doin' what he was doing before us\nBecause money is an issue, your son, he gon' miss you\nAnd plus you got a wife at home cause mommy still exist too\nNow you lookin' for exes, you ain't never expect this\nYou end up doing time, and me, I end up with a step-sis\nNobody passing judgment, they question where the drugs went\nYou know I hold you down because without you, I'd be a wasn't\nAnd mommy I'mma support her, I keep it all in order\nSee her with tears in her eyes or you arrested at the border\nBut\n\n[Hook: Nickelus F]\nI got stress on my shoulders\nTrying to keep my heart pure but this world is makin' it colder\nYoung black man dodge your bullets trying to get older\nAnd you wonder why we turn to drugs and chain smokers\nIT'S STRESS MY NIGGA!!!\nI'm just tryna live my life cuz\nMake a little money, find a bunny\nTo make my wife cuz BO!, BO!, BO!, BO!\nI'm just trying to live my life cuz\nMake a little money, find a bunny\nTo make my wife cuz BO!, BO!, BO!, BO!\n\n[Verse 2: Drake]\nThis is my life, and so the rest has kinda been cool\nQuestion what I been through\nI write a verse addressin' it\nAnd yes I might offend you\nPicture when I was in school\nMe being the closest thing to black\nAnd guess what rap music what I was into\nRest of the kids were sheltered\nI never liked to fight\nBut when someone called me a \"nigga\"\nI'd punch em I couldn't help it\nNow I'm grown I can say what it is\nIt's parents that got these Black and Filipino nannies raisin' they kids\nAnd your daddy want it very right\nI make you happy, plus I'm Jewish, he don't approve\nI think he want you to marry white\nHe want Sinatra at the wedding, not Barry White\nCause black is black honey, even if he's very light\nAnd so I never been for dinner at they places\nAlways brutally honest, and so I pin it to they faces\nI live it so the case is, whether Drake is\nWay ahead of his time, or inquisitive and racist\n\n[Hook: Nickelus F]\n\n[Verse 3: Drake]\nAm I hot as the rest? should I strive for my spot as the best?\nLike girls with Double D's, I got a lot on my chest\nThere's questions that need to be answered that's not on the test\nInstead of starin' at quizzes now it's models with breasts\nAnd yes, when I'm dismissed after a tedious listen\nI sit at home and say I should of been a pediatrician\nHomie, I probably could've been on TV consistent\nAn artist like Pablo, maybe Petey's assistant\nAnd my mindset is come and get me\nI'm all alone at home with my mom and grandma and ain't nobody runnin' with me\nSo, if you got the heart to come in here and kill a lady\nDaughter, and her grandson, nigga get the handgun\nIf not, you gon make me call the burbs out in Richmond\nThat have you niggas laying out on the curb, they some hitmen\nLast couple of months I done probably been around the world and back\nAnd I don't wanna question half the places Nick been\n\n[Hook: Nickelus F]", "image": "https://images.genius.com/c85f36c02060316fcec1ed423c60f0da.1000x1000x1.jpg"}], "artist": "Drake"}