{"songs": [{"title": "Play No Games", "album": "Dark Sky Paradise (Deluxe)", "year": "2015-09-22", "lyrics": "[Produced by Jay John Henry & Key Wane]\n\n[Intro: Sample & Big Sean]\nGirl, it's true\nYou do, you do, you do\nIt's true (Oh)\nIt's waiting for you (Uh-huh)\nGirl, it's true\n\n[Verse 1: Big Sean]\nOkay, I won't deny it\nHalf the time you send a text, yep, you know I'm not replying\nJust to let you know, I'm not one of them niggas you be dodging\nI'm the one that you dodge with (Swerve, swerve)\nI'm the one that you gon' take that dress you saving out the closet (Woah)\nI'm the one you need alone\nI'm the one that when you round your friends\nThat you gotta put on speakerphone\nJust so you can let them know what we be on, like he the one\nYeah yeah, I know I'm young but you respect me like a father figure\nYoung mobbish nigga, prolly make you father figures\nSean Don Perrier out in Paris with a pair of Yays going\nWell, I would tell you but I gotta paraphrase\nAnd even when you tripping, we tripping, I pay for ya\nGourmet for ya, chauffeur arranged for ya\nI'll take that flight alone earlier in the day for ya\nJust to beat you there and prepare, let you know I'm waiting for ya\nFinally Famous\n\n[Chorus: Chris Brown & Ty Dolla $ign]\nI ain't like them other niggas (Other niggas)\nAnd I ain't 'bout to play no games with you (Play no games)\nYou know what your problem is? (Oh)\nYou don't ever see the big picture\nOh wee, I want you to take me serious\nOh baby, I want you to take me serious\nAw yeah, yeah (Girl, for you)\n\n[Verse 2: Big Sean & Ty Dolla $ign]\nWait, wait, waiting for ya\nI be wait, wait, waiting for ya (Girl, it's true)\nYou got a young boss nigga like me waiting for ya\nYou got that bomb ass, pussy, I'll be waiting for ya (Yeah)\nWho ya love? (Tell me) Tell me who you fucking love (Tell me)\nTell me who you wanna fuck and love\nI left that sexy dress out on the bed with a note there laying for ya\nWith directions where I'm waiting with dinner and waiter for ya (For ya)\nI'm that nigga (Nigga), she tell me I'm that nigga\nI'm the nigga that's your nigga even when you got a nigga (Uh)\nThat you make love with, but right before take drugs with\nThen right after, hit the tub, wait on me with suds\nThen you back that ass up on me like it's 99 (Woah)\nWine fine, like a bottle from the 99 (Uh-huh)\nHit you with the 99 like it's fucking primetime (Time)\nKilled the pussy, had to hit that shit like nine times (Woo)\nGirl, even when I'm gone, just know I'm there for ya (There for ya)\nI'm all ears, in other words here for ya (Here for ya)\nI'd probably rob a fucking bank and go to jail for ya (Uh-huh)\nAs long as I can smack that ass and pull that hair for ya\nFinally Famous\n\n[Chorus: Chris Brown & Ty Dolla $ign]\nI ain't like them other niggas (Other niggas)\nAnd I ain't 'bout to play no games with you (Play no games)\nYou know what your problem is? (Oh)\nYou don't ever see the big picture\nOh wee, I want you to take me serious\nOh baby, I want you to take me serious\nAw yeah, yeah (Girl, for you)\n\n[Bridge: Ty Dolla $ign]\nI've been waiting on that ass all night though\nGirl, don't keep me waiting no more\nYeah, yeah, it's true\nGot some things I wanna do to you, baby, oh\nOoh yeah!\n\n[Chorus: Chris Brown & Ty Dolla $ign]\nI ain't like them other niggas (Other niggas)\nAnd I ain't 'bout to play no games with you (Play no games)\nYou know what your problem is? (Oh)\nYou don't ever see the big picture\nOh wee, I want you to take me serious\nOh baby, I want you to take me serious\nAw yeah, yeah (Girl, for you)", "image": "https://images.genius.com/a1bd60691514af24dbc22e6e9dbec912.1000x1000x1.jpg"}], "artist": "Big Sean"}