{"songs": [{"title": "The Ugliest", "album": null, "year": null, "lyrics": "[Intro: The Notorious B.I.G.]\nYeah, ninety-six, for my Nostrand Ave niggas\nMy Fulton Street niggas (Hardcore for ninety-six)\nDangerous MC's\nUhh (Check it out), uhh\n\n[Verse 1: The Notorious B.I.G]\nDiamonds on my neck, chrome drop-top\nChillin' on the scene, smokin' pounds of green\nOoh-wee, you see, the ugliest\nMoney-hungriest, Brooklyn Loch-Ness\nNine millimeter cock test, wan fi' test?\nAnd the winner is, not that thinner kid\nBandanas, tattoos, my fist never bruise\nLand still cruise, Frank White paid his dues\nAsk who's the raw, bet they say \"Poppa, very\"\nLook forward to me like commissary\nAll of a sudden, now everybody Big Willie\nDone did it, come with it, get your head splitted\nOr get your neck slitted, admit it, you overdid it\nYour shit it just ain't got that loud, gold tooth shine like \"ta-dow\"\nBiggie Smalls the illest and how, frays raise your eyebrow\nBy now you figure, he talkin 'bout that nigga\nBut your weak-ass assumptions, lead lead to dumpin'\nIV to pumpin', you're feeling something\nCatch my drift, or catch my four-fifth lift\nAt least six inches, above project fences\nTurn meat to minces, jumps turn to flinches\nWhen I rain I drenches, cleared your park benches\nMissed you by pinches, your talk is senseless\nActor needs chiropractor, for cracked jaw\nYes I rocked, your chatterbox\nDangerous you're not, I gets down\nTwist your body round and round, upside down\n\n[Chorus: Roc Marciano]\nIs the love really there? (Is it?)\nDo a thug shed the same tear? (Never know)\nThrow your ice in the the air, we here\nAnd we all gon' ball 'til the courts up here\nDon't give a fuck what them niggas think we talk in here (Come on)\nS the love really there? (Is it?)\nDo a thug shed the same tear? (Never know)\nThrow your ice in the the air, we here\nAnd we all gon' ball 'til the courts up here\nDon't give a fuck what them niggas think we talk in here\n\n[Verse 2: Busta Rhymes]\nUh, smoke a little then we cut coke a little\nAnd we skim a little off of the top\nTaking you back when niggas use to snort coke\nAnd toast through the hood and cry up to\nBe the richest folk to float through the hood\nNiggas doin' real good, it was evident\nIn the testament, when coke flow was good\nWhen Ronald Reagan was president\nThe say no to drugs grown greatly irrelevant\nNiggas gettin caught with bricks\nBut still reaching the settlement\nNiggas get a one to three\nCome home in twelve months\nRun up and take a niggas shit\nLeave 'em with twelve lumps\nI've never been so willin'\nTo put the thoughts of mo killin'\nInto manufacturing a flow so bone chillin'\nIcy with a pistol, nigga\nShit glitter like ball room chandelier with crystal, nigga\nI stack money as we live life simple\nIn the corner of the club sippin' on a Harvey Bristol, nigga\nC'mon, modern day gangsta shit\nAnd die slow as we give you niggas cancer shit, c'mon\n\n[Chorus: Roc Marciano]\nIs the love really there? (Is it?)\nDo a thug shed the same tear? (Never know)\nThrow your ice in the the air, we here\nAnd we all gon' ball 'til the courts up here\nDon't give a fuck what them niggas think we talk in here (Come on)\nS the love really there? (Is it?)\nDo a thug shed the same tear? (Never know)\nThrow your ice in the the air, we here\nAnd we all gon' ball 'til the courts up here\nDon't give a fuck what them niggas think we talk in here\n\n[Verse 3: Labba]\nWhat you know about a nigga murder i got no chemical\nThan courts in Miami water got shit federal\nTime for that ass\nI rather go to little heyday boy some bricks in the station\nHead back long crossed 8 mile to become the boss enforce the Laws\nYou want some motherfuckin' hoes there keep it steppin'\nNo discount player no fuckin' credit\nNo shorts, I came to Governor lost (damn)\nI came to price the dime bribe source\nYou had a devil smokin with them rebels\nWe kill for money and power\nExtortionin' in my own hood and that shit's power\nA black man crime call 'em a coward\nA black man knowledge we kill 'em tomorrow\nIts sickenin' that's how our people live\nWe disrespect our elders and curse our Church Members", "image": "https://images.genius.com/54314abfbbbf16253d72455428cc44e6.834x834x1.jpg"}], "artist": "Busta Rhymes"}