{"songs": [{"title": "Money Talk", "album": null, "year": "2016-02-16", "lyrics": "[Produced by C4 and KIP]\n\n[Intro]\nHey, you know, a lot of y'all out there man really running y'all mouth\nLike you just like to hear yourself talk, you know what I mean?\nTalk so much, not knowing if the wagon make the more noise man\nHaha, get you some money, man\n\n[Hook]\nLotta nigga talk, you don't ever get paid\nFuck nigga hate, broke bitches throw the shade\nLotta nigga talk, you don't ever get paid\nStill kickin' shit, make a bitch go crazy\nLotta nigga talk, you don't ever get paid\nFuck nigga hate, broke bitches throw the shade\n\n[Verse 1]\nStill kickin' flav', got my swag on turn up\nCame with a zip, let the whole thing burn up\nAll I know, get dough, keep it pimpin'\nTaught me that in '85, never learned nothin' different\nAll I see is haters in my rear view\nMillions in my windshield, got a clear view\nI trained myself, go deaf for a broke nigga\nThat way when you're talkin' I don't hear you, listen\nStill poppin', give a shit about me\nFuck that shit you talkin', look at you, see you ain't bout it\nLook at you, see you don't want it\nShould hardly be an opponent\nWhen you sittin' next to TIP, it look inferior, don't it?\nGive a damn if you don't know\nI've achieved everything you could hope for\nIf being a real nigga turned into a corporation\nLook at me, shawty, I should be the logo\nPlease no photos as I stepped in that Magic\nGot four hoes in the two door Bentley, what's happenin'?\nShe with the action, then she come in with me\nBut if not I leave her, she mean nothin' to me\nI pull up, hop out, give the valet my keys\nI run the city, bitch, I'm parkin' for free\nAnd who the nigga right here talkin' to me?\nThere gon' be problem if you keep botherin' me, man\nI came in this bitch to spend 20's and 50 G\nWhat you tried to park here? That ain't my Bentley\nYou can't listen to me now, God as my witness\nKeep on in your earnin's I take your opinion\nI swear, nigga\n\n[Hook]\nLotta nigga talk, you don't ever get paid\nFuck nigga hate, broke bitches throw the shade\nLotta nigga talk, you don't ever get paid\nStill kickin' shit, make a bitch go crazy\nLotta nigga talk, you don't ever get paid\nFuck nigga hate, broke bitches throw the shade\n\n[Verse 2]\nFocused on the money; fuck shit? forget about it\nI bought a Lamborghini, wrecked it, give a shit about it\nGet up out it, call an Uber, go and buy a new one\nI gotta run a bag up, it's extra for the blue one\nGot 500 bags off in Chattanooga\nGo and put it up and take a 100 motor gang here\nTwo rules, gettin' money, nigga, stay real\nAt all costs, nigga, at all costs, nigga\nTake a hit of this and run your balls off\nAnd, nigga, you ain't really beefin' if you called off\nPlay a bit to the left, call it southpaw\nFuck around, get your mouth wired, gotta weed y'all\nBetter stand down before I be a man\nDrown guns up, hands down, that's exactly how I caught y'all\nOkay one day I retire, put me in the hall of fame\nBut you lames don't forget what I done taught ya'll\nI put the fear of God in ya\nOh you nigga hard is ya?\nI can see the broad in ya, put your cut\nThen you gotta make a move, make a choice\nEither go out like a bitch or get your ass kicked\nGod damn that'll be horrible\nSo pipe down, nigga\n\n[Hook]\nLotta nigga talk, you don't ever get paid\nFuck nigga hate, broke bitches throw the shade\nLotta nigga talk, you don't ever get paid\nStill kickin' shit, make a bitch go crazy\nLotta nigga talk, you don't ever get paid\nFuck nigga hate, broke bitches throw the shade", "image": "https://images.rapgenius.com/684dba004906f2862e0bcaf5ca325970.600x564x1.jpg"}], "artist": "T.I."}