{"songs": [{"title": "Started", "album": "Dedication 5", "year": "2013-09-01", "lyrics": "[Verse 1]\nY'all don't want no problems up in here\nThese niggas wear dresses and y'all call me weird nigga?\nGo in niggas' pockets while we here\nWhat kind of cologne do you wear because all I could smell is fear nigga\nY'all don't want no problems up in here\nBoy I'm from New Orleans where the dope fiends kill niggas\nBrains came out his fucking ear\nI got a full clip, I empty the whole thing up in here\nNow I'mma keep a pill and a blunt\nI might pass the motherfucker but most likely I'mma flunk\nTell my bitch I could do bad on my own\nShe say \"You gon' miss me nigga.\" I say \"Bitch the thrill is gone\"\nI ain't drove it look better in the driveway\nMarried to the MOB, man you niggas just some bridesmaids\nBitches give me head instead of playing mind games\nTattooed tears for my homies, it's a cryin' shame\nYou could get a Dom P bottle to your face\nNiggas just construction workers, trynna build a case\nMales shouldn't be jealous that's a female trait\nWhy your bitch blowing me up? If I answer, I deflate\nMotherfucker I'm like\nY'all don't want no problems up in here\nI fuck her 'til she cry, make that ho drink her fuckin' tears\nLord, I hope she swallow more than tears\nThen her homegirl came in the room and volunteered\nMan, dreads hanging out the ski mask\nRun up in your house, the couch potatoes getting mashed\nRun up in the kitchen get your stash out the oven\nYou wonder how we know? stop talking while you cuddlin'\nAin't nothing like some pussy when you going through something\nJust called a bad bitch, I said I'm going through something\nBugatti sitting still, look like it's going 200\nPussy nigga keep your mouth closed like you chew onions\nMother fucker I'm like\nY'all don't want no problems up in here\nRather be judged by my jewelry, not a jury of my peers\nAnd I got some kush to hide in her brassiere\nAnd we only selling what the boat bring here nigga\nY'all don't want no problems up in here\nCause I got shooters on the roof like some fucking reindeer\nAnd I'm probably with the model of the year\nI'm about to go Pac with the nose ring up in here\nUh, lifestyles of the rich and famous\nYoung Money motherfucking Entertainment\nAnd y'all know Marley got the chopper up in here\nYeah, me, myself and I, the fucking Three Musketeers\nSmoke like I fucking disappeared\nI check your pussy ass, and wait for it to clear nigga\nTunechi, everybody know your name like Cheers, nigga\nStarted from the bottom now my whole team here nigga!\nTunechi!\n\n[Outro]\nYeah, D5\nWhatup Five?\nWorry bout me, give a fuck about you\nJust as a reminder to myself\nBust every single nut in her motherfucking mouth\nI'm like, Lord I hope she swallow more than tears...", "image": "https://images.genius.com/aa4f93cf953aad46ecd13d3027b59fff.475x475x1.jpg"}], "artist": "Lil Wayne"}