{"songs": [{"title": "Platinum and Wood", "album": "Dark Sky Paradise (Deluxe)", "year": "2015-02-24", "lyrics": "[Verse 1]\nCome roll with a nigga, get high with a nigga\nCount stacks with a nigga, fuck hoes with a nigga\nBack in high school we used to trade clothes with my niggas\nBack when Iceberg and Girbaud\nWas like the wardrobe for the killers, we pose for the pictures\nStunting on hoes, I stunt with my bros\nReal go-getters, I swear being broke didn't fit us\nLike new T-shirts, new jeans, new hats\nYou know, spending gas money on everything except gas\nSpending my last on the shit that won't last\nBack when 20 dollars would impress that ass\nA movie and popcorn and caress that ass\nOverdress to undress that ass, god bless that ass\nIt was me and my dawgs, summer on summer\nRiding around like we dumber on dumber\nWhipping that Toyota like it's a Hummer\nWhat happened to those days? I really do wonder\nWhen all I did was safe sex, latex\nThe first time I slipped up, wished I had a homemade AIDS test fuck\nBut I ain't flunk once\nBack before I got drunk once\nI was smoking on haze, all in a daze\nMy homies would call and say, \"nigga, come roll\"\n\n[Break 1]\nThe D grown us to get it man. You know what I’m mean? Just hustle, hustle, hustle. They, you know we, you know, there really wasn’t that much opportunity for us, man. So, we just had to let our nuts hang and just, shit, boss up and, and learn the game\n\n[Verse 2]\nMan, I'm straight up off the 7 Mile, they call that the better mile\nTryna get a house up in the woods off on 11 Mile, bet it now\nOne time for the D, Girls that hold me down Corretta style\nFree Juan, let him out\nAnd everything I want off in the world is a must-have\nI realised that at the bus stop with a bus pass thinking \"fuck rap\"\nCause there's niggas in the streets\nGetting money under my nose that I must stash\nI've seen people get murked who ain't deserved that shit\nCops should've protect-and-served and shit\nBut still pull me over, disrespect and search my shit\nAsk \"why the attitude?\" cause bitch, you deserve that shit\nBang bang bang, how do you maintain\nA sane brain and mind in a city of AKs and K9s?\nWhen only language they know English and gang signs\nFuck it all though, I'm repping till the world blow, come roll\n\n[Break 2]\nWell shit, I’m just, you know, I’m proud of lil' bro man. That nigga listened and he was able to stay focused man and through all the adversity man and through all the hood politics. But he seen it, he was with it, he was on it, you know? I mean like I say the Linwood man, shit that’s what we know the city man, that’s for the city man all fucking day\n\n[Outro]\nSean, it's good to be home, isn't it?", "image": "https://images.genius.com/740ca6fe7862ad174446f7794050b7a4.1000x1000x1.jpg"}], "artist": "Big Sean"}