{"songs": [{"title": "Jump On It", "album": "Authentic", "year": "2013-04-30", "lyrics": "[Intro]\nNo cut\nPure raw\nWe sold out\nYou bought more\n\n[Verse 1]\nIt was meant to be\nHip hop died, reincarnated through me\nNow the promoters gotta double my fee\n‘Cause these pop melodies ain’t fucking with me\nGet back on your tour bus roll some broccoli\nI'll leave your crew twisted and your hoes knock kneed\nHell through (time) and the game in my speed\n‘Cause water down hip hop we do not need\nYes sir, I got the real recipe\nA little bit of old E and bon bon Z\nI guess by now you can tell you miss me\nThe baddest motherfucker in rap history\nOne to the temple put you out your misery\nThat’s not an album , that’s a frisbee\nTangle with LL boy that’s risky\nThem boys is backwash, we want whiskey\n\n[Hook]\n(Jump on it! jump on it!)\nWhen the chips is down you gotta fight for the crown\n(Jump on it! jump on it!)\nTell them boys over there get down or lay down\n(Jump on it! jump on it!)\nI got the house of pain for your little pop clown\n(Jump on it! jump on it!)\nDon’t get it criss cross we’re taking over the town\n\n[Verse 2]\nRoll up on your set pull out the 4 pound\nWho’s pitching out here blast them off the mound\nThe game got us bored, no rebounce\nClaims he’s hardcore how he sound\nMy radio’s a bunch of noise in the background\nFor a factory manufacturing pop clowns\nThat’s what happens when LL ain’t around\nThe pop stars flooding and the hip hop drowns\nDJ suffer while sarada goes round\nYou screaming? got the real creaming\nWelcome to hip hop, we’re out here fiending\nWatch a program directed in the bin and\nWent from cruss group to a boy band screaming\nWhen it come under the car I ain’t leaning\nI wish I could bump the brim creaming\nI tell you what, play my stupid — call it even\n\n[Hook]\n\n[Verse 3]\nWhat y’all want, no cut!\nWhat y’all need, pure raw\nWhat we do, we sold out\nAll because.. you bought more!\nNo affects on my voice, that’s my choice\nHard raw beat make a soft voice moist\nGet the dinero bring the heat like Jon Voight\nTimbaland music, rolls royce\nHit you in the head like a fat joint\nBack to the S’s big meat in Detroit\nL so perceptive shrud in the droit\nBad motherfucker, now you get the point?\n\n[Hook]\n\n[Outro]\n(Jump on it! jump on it!)\n(Jump on it! jump on it!)\n(Jump on it! jump on it!)\n(Jump on it! jump on it!)", "image": "https://images.genius.com/c0c7dbb9fd10ac4887ec94389a4d0712.1000x1000x1.jpg"}], "artist": "LL Cool J"}