{"songs": [{"title": "Mr. K.I.D.", "album": null, "year": null, "lyrics": "(Yea, yea, cle-cleveland style!)\n\n[Verse 1: Kid Cudi]\n84 Kid Mesc was born\nOn my own since they cut the umbilical cord\nWhen I was born, witness to divorce and scorn\nEver since that happened, I was daily torn\nDidn't understand nothing but I'm happy\nInstead of being cool, my family kept on snapping\nCool out shit 12 a nigga was rapping\nMy father died, the pain is still\nLook in the mirror man, I see real\nTouch my reflection, feels what I feel\nThe letter is written: stamped and sealed\nIntoxicated, spill for spill\nAnd I ain't never seen a gang making deals for deals\nCover my mind and witness why\nThere's the time in the world and no time to die\n\n[Hook]\nI ain't trying to upset nobody\nI'm just trying to be me\n\nEverywhere I go man, people like \"he's still rapping?\nYeah that's right man, you still gun clapping?\nI'm on to bigger positive things\nTrying to live out a dream\nI'm the MVP, look at my ring\nWhat y'all know about the street games, you're just\nDreaming em up. Not trying to make a come-up\nGoing to sleep at night praying to god\nWishing that you had that bad bitch in your arm\nI'm that kid tryna make things happen\nUp in the club, watching gangstas clapping\nAnd I'm that kid that be steady rapping in the booth\nThrow out my demo and that's a Hot 97 proof\nAnd you don't wanna sign me, fuck are y'all on?\nI go next to the next dude that wanna put me on\nAnd that's real, cause I'm only me\nThe K-I-D, not trying to become the next OG\n\n[Hook]\n\nRelax daily [-]\nYa know what I mean, less acting\nMore me and me, less them\nIn the pool of magical ones, I will not swim\nNot on the hottest day or the warmest night\nI'm free like a bird nigga, I should take flight\nPlain nigga, the one less hoes like\nEven if I had jewels that could dim light\nOff they would never look, rather read a book\nKnow I'm semi-wrong, got 'em shook\nNow they know Scott, and they know I plot\nDon't trust hoes, they just want the knot\nTill I abuse it, baby I love music, not\nReally ain't no question, just lessons\nAt confessions, never false preaching\nReal recognize through deception and lies\nSo, keep it music, baby keep it going steady\nIt won't be long, my niggas, till everybody witness\n\n[Hook]", "image": "https://images.genius.com/57fc91d7548f4e591a971ea7f5443a88.355x355x1.jpg"}], "artist": "Kid Cudi"}