{"songs": [{"title": "Show it to Me", "album": "T.I. vs T.I.P.", "year": "2007-07-03", "lyrics": "Aye bend that ass over, and let it move back\nCome kick it wit me, I'll get your groove back\nAnd give it to me\nShow it to me\nGive it to me\nShow it to me\nGive it to me\nShow it to me\n\n[Hook]\nAye bend that ass over, and let it move back\nCome kick it wit me, I can help you get your groove back\nAye give it to me\nShow it to me\nNow give it to me\nShow it to me\nNow give it to me\nHey whatcha doin'?\n\nGive it to me\nShow it to me\nAnd let it wiggle cause I like it when you do that\nCome kick it wit me, I can help you get your groove back\nNow give it to me\nShow it to me\nNow give it to me\nShow it to me\nJust give it to me\nHey whatcha doin'?\n\nJust give it to me\nShow it to me\n\n[T.I.]\nI got a whack dough flow\nStacks on swole\nFive different hoes in Cadillac four door\nNiggas think they gonna attack, I got a mac on hold\nI'll bust ya in your stomach leave you back on the floor\nYou see T.I. and Nelly on it, know the track gone blow\nMan you niggas barely pro, I don't even practice no more\nAye shawty I was gettin' dough when you was rappin so-so\nWhen you barely had flow I had crack for the low\nYou can stunt for the audience and act for the hoes\nLet me ask you what you gon' do when we ain't actin' no more\nAye when I finish wit you you ain't even gon' be rappin' no more\nAye \"How he doin'?, Where he at?\" somethin' they ain't askin' no more\nAye picture me not bein' the main attraction no more\nThat's all the talkin' I care to do to you back to the hoes\nBaby drop it back it up til you can't back it no more\nYou show me you bout that action, I'll throw a stack on the floor\n\n[Hook]\n\n[Nelly]\nAye come on in lil mama sit down pay attention\nYou don't want to get to school, then take your ass to detention\nStick my key in your ignition, I'm crankin' up your engine\nI'm pullin' your extensions Now we switchin' up positions\nGot an ill technique, in makin' ya knees weak\nA non-stop treat until your g-spot leak\nTo your G4 seat, we'll be back next week\nSo tell that lame ass nigga you got places to be\nSo give me your participation, don't need no hesitation\nDon't want to be mistaken, ma I'm plannin' on relations\nYea, you rollin' wit the King and the One\nCountry niggas in the chevy passin' Grey Poupon\nMan, we been gettin' dough since we was way too young\nThe record sales was the mob that'll make me a Don\nYou see this is why I'm hot, and this is why he not\nSo mama climb on top, and show me what you got, aye\n\n[Hook]\n\n[T.I. & Nelly]\nThe independent ladies that can buy their own Mercedes I say\nThat's the one, that's the one\nCountry girls that represent, payin' they own rent holla\nThat's the one, that's the one\nFor the women constantly poppin' tags with the newest Louis bags yea\nThat's the one, that's the one\nTo all the girls who in shape, slim waist, pretty face hey\nThat's the one, that's the one\nOkay\nNow bend that ass over", "image": "https://images.genius.com/2f70d0ed3d87a3cc476cfb530ff86686.600x600x1.jpg"}], "artist": "T.I."}