{"songs": [{"title": "2MININHELL", "album": null, "year": "2019-01-15", "lyrics": "[Intro]\nAye, aye, aye, aye, aye\nYeah, yeah, yeah, yeah\nAye, aye\nWho am I? Bitch, who are you? (J. Knight on the beat)\nWho am I? Bitch, who are you? Aye\nI just had to hit that light switch you feel me\nYuh, yuh, yuh, aye, swooh, oh I got high for this one, Aye\n\n[Verse 1]\nWith the gang, in my lane, boy I never change, aye\nI'm the same, I'm the same, I be with the gang, aye\nPop a Xan just to ease the pain, aye\nBlow you down in your fucking game, wait, aye\nWho are you? Who the fuck are you? aye\nTie the knot, with the Glock, like a fucking shoe, aye\nBoy I heard you got that pole, but you won't fucking shoot, aye\nI might kill you and your moms, I don't got shit to lose, aye\n\n[Verse 2]\nI am lunatic, I go crazy with the stupidness\nI'm a wild fucking hooligan\nYeah it's Juice let the Uzi spit\nI might fuck a bitch then kick her out\nI'ma show you what this business 'bout\nYour bitch gon' know what the dick about\nYour team gon' know what my clip about\nAye, aye, dammit I'd do it again\nAye, aye, Juice went to shoot it again, aye\nI'm in the booth going stupid, I came in here, yeah\nI got crews and we win, yeah\nCame with the Ruger again\nBoy you ain't got no damn shooters again, aye\n\n[Verse 3]\nNow I ain't come to shoot the one, bitch\nBut I'm still shooting some shit, aye\nBoy I hate bitches, they just make assumptions\nMaking something, out of nothing, aye\nNow what sense do that make, aye\nI got this work, hard rock, earthquake\nI whip the pot and then I make the earth shake, aye\nShould've never came here in the first place, aye, aye\nBlow your candles out, happy birthday, aye, aye\nI send shots to your fucking birthplace, aye, aye\nIn the studio cooling with Zayn\nJordan, Freddy we gon' do our damn thing, aye, aye\nStay the fuck out my way, aye, aye\nGoin' 90, (Skrt) on the highway, aye, aye\nAye\n\n[Outro]\nAye, aye, aye, aye\nDamn I'm through with this shit, fuck it", "image": "https://images.genius.com/1ff8ab8d3ae5bb47f0797a87d42ddf66.1000x1000x1.jpg"}], "artist": "Juice WRLD"}