{"songs": [{"title": "Pussy Pop", "album": "40 Days & 40 Nightz", "year": "1998-08-25", "lyrics": "[Intro: Method Man & Xzibit]\nMista Meth in the house!\nHa, yeah, break it loud\n\n[Verse 1: Xzibit]\nYeah, when it's all said in done, we gon' be on top\n'Cause we don't stop, now, lock it down, hit the spot\nAnd clown niggas relyin' on special effects\nWhile the khakis and chronic, got the bitches still breakin' they neck\nMove the crowd without breakin' a sweat\nTrendsetter, with a Beretta, so keep it on deck\n'Cause you never know when Xzibit gonna roll through the set\nDon't be scared, just be prepared and quiet as kept\nAt a nightclub, talkin' 'bout you don't go out\nAnd you tryin' to got to school to make a certain amount\nBut the last part, I just couldn't figure it out\nI guess its real hard to talk with a dick in your mouth\nLightweight, like confetti\nSteadily tested by motherfuckers who ain't ready\nTo deal with the legendary\nSoopafly, X-Z, and Bullet Loco\nShot callers, clear the whole block like we po-po\n\n[Chorus: Method Man]\nRound and round we go, it don't stop\n'Til we all get dough, c'mon, make it hot\nBaby girl do the pussy pop, pussy pop\nLick shots for the pussy pop, pop, pop!\nLookin' good with your stink-ass\nType of ass make a nigga pull it over fast\nMake it hot, baby girl do the pussy pop, pussy pop\nLick shots for the pussy pop, pop pop!\n\n[Verse 2: Jayo Felony]\nThis bitch ain't got the pot to piss in\nKeepin' it next to the name and her gun\nThis the Dulo gang bitch\nWho the fuck want some?\nYou got titties and ass\nBut I got a dick and some cash\nIf you ain't talkin' about shit\nThen I'ma smash, bitch\nOn three, on me, bitch, you my property\nDaddy Jayo Felony, and ain't nobody stoppin' me\nAnd I said daddy, bitch, yeah, that's what you gon' call me\nI ain't no simp or no wimp\nI'ma motherfuckin pimp\nTerrorizin' my hoes, make they high-heels fall off\nYou got me close to fucked up, if you think I'm goin' soft\nOn ya; I'm hard on my hoes, that's how it goes\nBitch, get up off your toes, and get my six-four\nYou got my name, you bounced\nSo you might as well break bread\nAnd only Dulo niggas know, what's the head\nMy name is Billy Loco, and this is my opinion\nI'm coming from SD, and Dulo is my religion\nBi-b-b-b-biatch!\n\n[Chorus: Method Man]\nRound and round we go, it don't stop\n'Til we all get dough, c'mon, make it hot\nBaby girl do the pussy pop, pussy pop\nLick shots for the pussy pop, pop, pop!\nLookin' good with your stink-ass\nThe type of ass make a nigga pull it over fast\nMake it hot, baby girl do the pussy pop, pussy pop\nLick shots for the pussy pop, pop pop!\n\n[Verse 3: Xzibit]\nI don't save 'em, pay 'em, or buy clothes\nAll I really wanna do is win the game, fuck hoes!\nIn Jamaica, at the Half Moon Villa\nWith a killa and a cocaine dealer, layin' low from the law\nSee, it all comes down to who's quick to draw first\nPay attention, prevention, ridin' off in a hearse\nMister X to the you know me\nThousand-dollar bitches wanna pop the pussy for free\nThe dysfunctional member of the Alkaholik family tree\nFrequently bang bitches, Wu-Tang, Killer Bee\nHennessey on the rocks, with Pina Colada\nAt the Ramada, make you work hard like Donna\nFor the cheese, got you down on your hands and knees\nAfter that, we kickin' back and burn up some trees\nMad shout, 'cause Xzibit's not the type to be treatin'\n'Cause, I'm an Alkaholik. and I'm late for my meeting\n(Come on, Like that!)\n\n[Chorus: Method Man]\nRound and round we go, it don't stop\n'Til we all get dough, c'mon, make it hot\nBaby girl do the pussy pop, pussy pop\nLick shots for the pussy pop, pop, pop!\nLookin' good with your stink-ass\nType of ass make a nigga pull it over fast\nMake it hot, baby girl do the pussy pop, pussy pop\nLick shots for the pussy pop, pop pop!", "image": "https://images.genius.com/2cbec7b745c109ceb67758132235acd9.600x600x1.jpg"}], "artist": "Xzibit"}