{"songs": [{"title": "Mula", "album": "The Documentary 2", "year": "2015-10-09", "lyrics": "[Produced by Sevn Thomas and Kanye West]\n\n[Intro: Kanye West + Sarah Barthel]\nLet me know if you're feelin' lonely\n\n[Verse 1: The Game]\n'Cause ain't no real niggas out here\nYe what these niggas start hummin' out their mouth with?\nBunch of bullshit, weak ass albums\nBunch of lil' niggas tryna copy our style\nWhen we originated this, whole motherfuckin' album had hits\nThat's why we up in the Ritz\nThat's why I'm up in your bitch, head honcho\nGet you killed pronto, wearin' red now, El Segundo\nBail long as Alonzo Mourning\nKill a nigga in his Monte Carlo like Alonzo\nSold records, sold crack, nigga, recognize\nFor the record, I've been wreckin' shit since '05\nNo lie, J's on\nTake these motherfuckas off and throw the Ye's on\nRewind, J's on\nTake these motherfuckas off and throw the Ye's on\nYeezy, tell these niggas that they is slaves\nMaster want you on red carpet like yesterday\nYou a house nigga, I'ma get away though\nCome back kill master ass like Django\nMost you niggas just rapping for the fame though\nI start rapping to get the fuck out this durango\nWhat goes around comes around, how that saying go?\nDocumentary 2, no 50, keep the change hoe\n\n[Hook: Kanye West + Sarah Barthel]\nFeelin' lonely\nLet me know if you're feelin' crazy\nI guess all that stuff they told me\nIn my life was extra shady\nI should've kept 'em waitin'\nSay hello to the mula\nI'm on top, no lie\nSay hello to the mula\nI'm on top, good night\n\n[Verse 2: The Game & Kanye West]\nBack like I never left, nigga I'm on my second breath\nAnd I got another track from Yeezy\nHow'd you do that? Like Eric Wright said Eazy\nPull up in my cool whip, I don't give a fuck about it\nLeave it at the valet, I ain't fucked up about it\nI'll call an Uber, nigga, I'll fuckin' shoot a nigga\nI got a white bitch that blow like a tuba, nigga\nI just got a new crib, I just got a new Wraith\nI just got cooler than LL Cool J\nI just got a new gun, squeeze it like some toothpaste\nI, I, (aghhhhk)\nSpit in the face of a coward\nShit on anybody ever try to take ours\nYe why that nigga's face so sour?\nCause that slick mouth got him wet up like a shower\nNow what you know about power?\nWhat you know about dreams?\nWhat you know about freestylin' versus each other\nShelter outside of Nike Town without a dollar in your jeans\n\n[Hook: Kanye West + Sarah Barthel]\nFeelin' lonely\nLet me know if you're feelin' crazy\nI guess all that stuff they told me\nIn my life was extra shady\nI should've kept 'em waitin'\nSay hello to the mula\nI'm on top, no lie\nSay hello to the mula\nI'm on top, good night\n\n[Outro]\n[Felicia]\nChuck! Chuck! Chuck! Nigga I know you see me!\n[Game]\nFelicia what the fuck you want?\n[Felicia]\nOoh please can I borrow your car?\n[Game]\nBorrow my car? Bitch are you stupid or somethin'?\n[Felicia]\nWell give me a quarter piece then\n[Game]\nBitch I don't sell crack no more\n[Felicia]\nWell give me some money or something I can take around your brother house and trade\n[Game]\nI ain't got shit\n[Felicia]\nWhat about this iPod and them Dre Beats, you don't need that shit, don't you know that nigga or somethin'?\n[Game]\nSo?\n[Felicia]\nPlease, I'll suck your dick for this shit\n[Game]\nBitch you can have this shit, I don't want my dick sucked by no motherfuckin' smoker\n[Felicia]\nOh okay, thank you then. You know I would have sucked your dick for it anyways with your fine ass\n[Game]\nFelicia get the fuck away from my car\n[Felicia]\nOkay, what is you listenin' to on this shit anyway?\n[Game]\nBitch press play", "image": "https://images.genius.com/f5bd9dcb51fd19e06b10b2ae0e3620cf.1000x1000x1.jpg"}], "artist": "The Game"}