{"songs": [{"title": "Birds In The Trap [Short Film]", "album": null, "year": "2017-03-13", "lyrics": "[Intro]\nI was walking down the street and as I look up I  see these two clowns doing absolutely nothing gettin' on everybody fuckin' nerves anyway I see this one car coming down the street\nActing all crazy and everything\n\nTravis playing piano\n\n\"Sweet Sweet\" playing in background\n\nWoman\nTravis I'm ready to go\nTravis I'm ready to go\nTravis I said I'm ready to go\n\nTravis bumps into partygoer\nKnocking his [drink] to the floor\n\nTravis\nDamn my nigga? what the fuck is wrong with my shit bro\n\n[Person 2]\nC'mon, How you gon fix that shit bro\n\nTravis\nFix what my nigga\n\n[Person 2]\nCheck this out my nigga\n\nTravis\nShut up nigga that was fucking alcohol it ain't wasn't even fucking drank, alright nigga, whatever nigga, haha (tss)\n\nTravis Exiting\nWaddup boy, Waddup nigga\n\n\nWoman\nI don't see why every time we go somewhere you have to go and start something with somebody\n\nTravis\nStart what? I ain't start nothin'\n\nWoman\nWhy did you just try to fight him\n\nTravis\nThat nigga trippin', trippin' over nothing\n\nWoman\nNo I'm not you need to relax\n\nTravis\nHim and you trippin' over nothin'\nOh for real\n\nTravis\nMan shut up and get in the whip\n\nWoman\nDon't tell me to shut up\n\nTravis\nFuck up\nBitch\n\nWoman\nExcuse me, Repeat yourself?\n\nTravis\nBITCHIN!\n\nWoman\nWhat is your problem?\nI don't understand why, how you think you can walk around and treat people however you wanna treat em\n\nTravis\nShut Up, Jeez\n\nWoman\nThat's your ego, and your ego's going to get you in trouble\n\nTravis\nTrouble nigga, I am trouble nigga\n\nWoman\nYou don't know how to treat anyone\nYou don't know how to treat me\nYou don't treat yourself well\n\nTravis\nTreat yourself well, fuck is you talkin' bout\n\nWoman\nYou treat yourself well? Maybe if you cared about yourself you would watch your actions, you know what, if you don't want me to worry about you, if you don't worry about you\nI'm not gonna worry about you, let me out of the car\n\nTravis\nWhat?\n\nWoman\nPull over and let me out of the car\n\nMan get fuck out, fuck out man\n\nWoman\nI swear to god I can't stand you\n\nTravis\nWhatever, close the door nigga\n\n\"sweet sweet\" starts playing on the radio\n\n[Travis start singing \"the ends\" over the \"sweet sweet\" beat]\nOkay, I got it, copy\n20/20, but I can't see nobody\nOne eye open, Illuminati\n\n[Travis talking to friends]\nOh shit yo waddup though\nGet money\nWaddup my nigga\nSee you got your little broads leaving pocketbooks and junk\nMan hell yeah, I had to drop a bitch off there dog\nShe trippin' bout some stupid ass shit (again?)\nHell yeah always trippin'\nYou know that bitch crazy\nI guess that's what they do\nMan we at the spot I'm at a little table, I'm dippin' out\nI bumped into a nigga and he start trippin' know what I'm sayin\nActin' like he startin' somethin' at the motherfuckin' spot\n(straight up?) hell yeah, with some alcohol wasn't no fuckin' drank nigga must not know, you know me\n\nOfficer pulls up next to Travis\nSlow down your vehicle your going too fast\n\nTravis\nYes Sir\n\nPerson 2\nAlways messing with somebody man (always)\nWhat's been good though nothin' to it but gettin' this paper\nWe bout to get it in a little later man got the hook up\nDefinitely get a couple little bags and a couple broads\n(approaching homeless person on bike) oh shit\nFreind #2What the fuck?\nTravis\nStay out the motherfuckin' road It's called a sidewalk nigga\n(stupid ass)\n\nPerson 2\nShit mane I'm bout to serve him too (haha)\n\nTravis\nYou stupid, this it right up here?\nPerson 2\nYeah this lil bridge\nI'll meet you up later, I'll have a couple bags\nDon't forget the blunts\n\nTravis\nAlready\n\nTravis gets a hotdog from hotdog stand, drives off and\nGets in a car accident\n\nPlaying instrumental to \"the ends\"\n\nTravis: Spoken\nDimness, my old brother\nI can feel whispers flying over endless rain of meaningless chaos\nReality always exceed fiction\nI can see an unborn generation\nI can hear within the silence and see within the nothingness\nFlashing neon lights trying to disturb and throw off my fucking judgment\nPast, present, and future all melted in a nonending circle\nHear my words of temptation and redemption\nThey made me believe I could escape\nRemember this shit, remember me, the one who die here\nIt's time to live\n\nPlaying \"coordinate\"\n\nTravis steps off the roof of an abandoned building to be found on the ground of an abandoned construction site\n\nPlaying \"way back\"\n\nPlaying \"the ends\"", "image": "https://images.genius.com/62d241389823ea14f6a4612f37e29db8.1000x1000x1.jpg"}], "artist": "Travis Scott"}