{"songs": [{"title": "In The Ghetto (Remix)", "album": null, "year": null, "lyrics": "(feat. Ludacris, Rick James)\n\n[Busta Rhymes:]\nUh, y'know, this time as we circle around the block, as we travel through the hood\nYa mean? This time I had to pick up one of my homies to help me tour guide you again through the hood - my nigga Luda!\n\n[Rick James - sampled from \"Ghetto Life\" + (Busta Rhymes):]\nWhen I was a young boy, (REMIX!) growin up in the ghetto! (REMIX!)\nHangin out on corners, (REMIX!) singin with the fellas (REMIX!)\nLookin for the cute chicks, (Flipmode, bitch) tryin to find me big fun (DTP)\nLookin for some trouble, (Yeah, yeah) or anyone who'll give me some (Here we go!)\nI was young and crazy! (In the ghetto) (REMIX!)\nDidn't know what my life would be (In the ghetto) (REMIX!)\nI was dumb and oh so lazy (In the ghetto) (REMIX!)\nSomething had a spell on me (In the ghetto) (REMIX!)\nYou all know what I'm talkin 'bout (Talkin 'bout ghetto life)\n(Talkin 'bout ghetto life) (And as we continue on)\nYou all know what I'm singin 'bout (Talkin 'bout ghetto life) (We gon' continue to travel through every ghetto through every part of this motherfucking planet, ya heard?)\nGhetto liiiiiiiiife (Talkin 'bout ghetto life) (LET'S GO!)\n\n[Busta Rhymes:]\n(In the ghetto) Crackheads all over the place\nWhere they be stockpile dry boogers on they face\nWhere they mother put spit up on they finger - wiping it off\nOr put a knife to the skin of a few - slicing it off\nWhere younger kids be looking at the older man funny, like he trifling\nRecycling soda can money\nMy niggas ball now and youngins try to ball later\nWhile they hustle, muzzle em, selling a final call paper\nFor the perm, when you see the black hair natural\nCrackhead'll off a nigga's head for a capsule\nFind alot of good game, alot of hood fame\nPolice know alot of niggas by they first name\nExperience your first struggle, and you'll see your first pain\nGet your first drug money, it'll be your first chain\nNow, and even when it looks like shit is getting worse\nUp in the ghetto, regardless I'm a rep the hood first\nGotta love it\n\n[Chorus: Rick James + (Ludacris)]\n(Talkin 'bout ghetto life)\n(Talkin 'bout ghetto life)\nYou all know what I'm singin 'bout (Talkin 'bout ghetto life) (Remix, yeah, we know about that ghetto life, remix)\nGhetto liiiiiiiiife (Talkin 'bout ghetto life) (Luda! Check it out, look)\n\n[Ludacris:]\n(In the ghetto) That ghetto life sure is drastic!\nAll the furniture's covered in plastic\nHand-me-down brothers with past clothes\nMilk crates as basketball goals\nLil kids go to SLEEP for dinner\nUse hangers as t.v. antennaes\nWe drink kool-aid without the water\nAnd most kids is without they father\nUse pots and pans for roof leaks\nCrackheads with average 2 teeth\nTell grandmama to stay strong\nThe ambulance is taking to LONG!\nLil babies out playing in the street\nUse the oven and stove as HEAT!\nAlot of tests and daily scars\nAnd we gotta drink out of jelly jars when\n\n[Chorus:]\n(Talkin 'bout ghetto life)\nGhetto liiiiiiiiife (Talkin 'bout ghetto life)\nYou all know what I'm singin 'bout (Talkin 'bout ghetto life)\nGhetto liiiiiiiiife (Talkin 'bout ghetto life)\n\n[Busta Rhymes:]\n(In the ghetto) Look, see the shit so simple\nKids watch what we do with the project windows\nSelling drugs on the strip, hoping that your chips grow\nHanging clothes on the line, hoping that the wind blow\nTo dry that shit off, you know that it ain't really that\nGotta save money for that food, fuck the laundromat\nDespite the struggle and all\nNo matter how the thing pop\nForever repping the ghetto\nCan't stop, won't stop\n\n[Ludacris:]\nYeah!\nPlaying hide-and-go seek don't seem right\nPlaying red light, green light (In the ghetto)\nYou get beat with extention cords\nAnd the cops got friends of yours (In the ghetto)\nWhatchamacallit, thingamajigs, what's-her-face and what's-her-name is up (In the ghetto)\nNo heat so you shiver up\nAnd the pizza man don't deliver up (In the ghetto)\n\n[Outro: Rick James + (backup singers)]\n(Talkin 'bout ghetto life)\nYou all know what I'm talkin 'bout (Talkin 'bout ghetto life)\nYou all know what I'm singin 'bout (Talkin 'bout ghetto life)\nGhetto liiiiiiiiife (Talkin 'bout ghetto life)\n(In the ghetto)\n\n\"Never mind who you thought I was, I'm Rick James BITCH! \" [applause]\n\"Cocaine is a hell of a drug\"", "image": "https://images.genius.com/54314abfbbbf16253d72455428cc44e6.834x834x1.jpg"}], "artist": "Busta Rhymes"}