{"songs": [{"title": "Better Player", "album": "No Limit Records Presents: Mean Green: Major Players Compilation", "year": null, "lyrics": "Yeah man\nThese niggas always comin' up to me\nTalkin' bout\nHow do I feel about this bitch\nAnd that bitch, and what do I think\nMan.. know what I tell these niggas?\nMan I ain't trippin' on you and your ho, man\nGot my own bitches\nI got my own ho's, nigga\n\n(Verse 1, Too $hort)\nNow I don't really care about'cha Benz\nOr ya light-skinned bitch\nCould give a fuck who ya tell\nYou don't like this shit\nThe fact still stands\nYou got one girlfriend\nAnd I feel like\nThe whole world pimp\nI can't be like you\nYou always actin' fake\nI could tell you how much\nA real mack can make\nA million dollars ain't shit to spend\nI get some new ho's, and get it again\nSo don't tell me, what'chu wish for\nYou wanna be kept, by a rich ho?\nBitch ass nigga, tryina lic me a lic\nShe better pay me right now\nIf she wanna get some dick\nI told you, got the game from the old niggas\nEvery time I park my car, I come to gold-diggers\nWith the \"Easy Pussy\" sign, on display\nIf you lookin' for some money\nDon't come this way\n\n(Hook, Too $hort)\nYou couldn't be a better player than me\nEven if you fucked every day of the week\nI know you think you got it like Platinum Pete\nI be fuckin ho's every day of the week\n\nYou never could be a better player than me\nEven if you rolled in luxury\nI know you smoke coke and that top notch freak\nYou never could be a better player than me\n\n(Verse 2, Too $hort)\nNow I don't really care about'cha phone book\nYou think you're pimpin'\nYa chillin' at the club\nWit' all ya women\nYou lyin' on ya dick, save the drama\nGot my eye on ya wife, and ya baby-mama\nCause you snoozin' (You know the rules pimp)\nYa bitch is choosin' (You 'bout to lose them)\nYellin', \"get'cho ass in this car bitch!\"\nBut I'm much too fast with this hard dick\nShort Dogg took ya broad, it just can't be\nYour bitch sucked me n' fucked me n' then she thanked me\nI know the whole story, you ain't servin' it right\nI'll probly slide by, and put some work in her night\n\n(Hook, Too $hort)\nYou couldn't be a better player than me\nEven if you roll in luxury\nI know you smoke coke and that top notch freak\nYou never could be a better player than me\nBiatch!\n\n(Verse 3, Too $hort)\nNow I don't really care\nIf you fucked the richest bitch on Earth\nYou could be a gigolo and couldn't get more work\nCause I'm a player from way back\nTaught by the best, no way you could say\nThat I was short like the rest\nOf y'all half steppin', lil' dick wanna-be big-wheeler's\nGot a bad case of the Syphilis\nIn the studio, you're make-believer's\nIn real life, you're more like, they can't foresay this\nYou rushin' to the scene, savin' ho's\nEvery time you come across them, crazy folks\nYou cuff 'em, hurry up and get 'em to safety\nBut sooner or later, the bitch gotta face me\nCause I put the game down from the start\nAnd you ain't nothin' but a dumb-ass mark\nAnd do yo thang, and watch me do mine\nGet the bitch on the phone\nAnd let's see who's lyin'\nNigga\n\n(Hook, Too $hort)\nYou never could be a better player than me\nEven if you roll in luxury\nI know you smoke coke and that top notch freak\nYou never could be a better player than me\nBiatch!\n\nCouldn't be a better player than me\nI know you couldn't be a better player than me\nBiatch!\n\nCouldn't be a better player than me\nEven if you did it every day of the week\nI know you think you got it like Platinum Pete\nI be fuckin ho's every day of the week\n\nYou never could be a better player than me\nEven if you roll in luxury\nI know you smoke coke and that top notch freak\nYou never could be a better player than me\n\n(Echo to fade)\nBiatch!", "image": "https://images.genius.com/8f76877437c9799d3c8a4d184e3d6b91.500x500x1.jpg"}], "artist": "Too $hort"}