{"songs": [{"title": "What’s On Your Mind", "album": "Don’t Sweat the Technique", "year": "1992-06-23", "lyrics": "[Verse 1]\nI seen her in the subway, on my way to Brooklyn\nHello, good lookin', is this seat tooken?\nOn the A-train, picking at her brain\nI couldn't get her number, I couldn't get her name\n(I'm curious) I said I still like your style of fashion\nBut I hate your high saddity attitude with a passion\nIs it because brothers like to hawk a lot?\nIs it because you're shy'n don't talk a lot?\nShe turned away, no play, I said okay\nYou don't really look good, I hope you have a bad day\nSat back, relaxed though the ride was tight\nI was thinking of the rhymes I wrote last night\nNext stop was mine, a familiar scene\nI was meeting my friend, Killer Ben in Fort Greene\nWhere the girls are real, they tell ya how they feel\nIf you're soft, you're soft, or if you're hard like steel\nSee I don't bend and I won't rust\nAnd I don't break and I won't bust\nStomped up the street and did I hear a treat?\nHard high heels tappin' on the concrete\nI took a peek, it was the girl from the train behind me\nDid she live in the area, was she trying to find me?\nHmm, I didn't wanna play myself out\nI played it off, stopped and I bought a Guinness Stout\nNow was she shy, she didn't walk by\nShe came in the store then she even said 'hi'\nCuriosity, at a high velocity\nMaybe possibly she had the hots for me\nI said, \"if we're playing games then we're gonna play mine\nI'm a lay the rules cause it ain't much time\nIf you hide your feelings, and they hard to find\nI wanna know what's on your mind\"\n\n[Hook]\n\n[Verse 2]\nAbout a week went by and I called her, \"Hello\"\nI said yo, can I speak to, um, she said no\nHey yo, I know I didn't call, I didn't wanna stress you\nGo out my way to impress you, press to undress you\nSee I wanna get to know you so I can show you\nWhat a strong relationship can grow to\nBut you gotta trust me and you're gonna love me\nSqueeze the phone and hug me, use your mind to rub me\nNow how does it feel\nWhen my mental, massage ya temple\nTelephone's hot from the vibes that I sent you\nNow tell me your inner thoughts and deepest emotions\nNext you see ecstacy's explosions\nNow I'm coming to see you to spend some time\nI'm a romantic warrior, but is it a crime\nAnd if you hide your feelings and they hard to find\nI wanna know what's on your mind\n\n[Hook]\nI wanna know what's on your mind\n\n[Verse 3]\nNow it's been months and it's smooth and lovely\nI'm in your head so you'll be thinking of me\nSo we met in Queens and went to Valley Streams\nAnd, uh, couldn't remember the movie we just seen\nBut it's Wednesday, take the train uptown\nHow do the 125th street sound\nAmateur night, Showtime at the Apollo\nProbably be watching Bill Cosby tomorrow\nThen after that get into it, I mean intimate\nEvery word is an instrument\nMaking sounds and tones and songs and moans\nMy lips so close to your ear, it's like headphones\nYou smile, you said you never know what the day will bring\nIt's always a new song to sing\nThe next day I went back to the her rest\nKnocked on the door, intentions: finesse\nShe let me in and had nothing but a negligee on\nSmelling like Liz Claiborne\nI sat down and got comfortable and watched the Huxtables\nShe sat next to me and said what's up wit you\nI got the feeling for sexual healing\nA mental healing; how you feeling\nShe caught the effect and said she feel the same\nCould you massage my intellect and stop the pain\nDesire's yearning, the fire's burning\nYou hot cause it's a lot you're learning\nNow I'm ready to explore you inner world\nIt's take a long time cause I'm just beginning, girl...\nTake it easy, cut off the TV\nCut off the lights, use your mind to see me\nUse your physical form if I'm hard to find\nCause now I know what's on your mind\n\nCause now I know what's on your mind", "image": "https://images.genius.com/c242f8367734db09ac26eb1c1bbcee98.900x900x1.jpg"}], "artist": "Eric B. & Rakim"}