{"songs": [{"title": "Stillmatic (Freestyle)", "album": null, "year": null, "lyrics": "[Produced Eric B]\n\n[Intro]\nAyo Nasty Nas, what up?\n~Ain't nothing, a lot of cowards fronting\nI hear what you're saying, but yo, this is all love for me, you know?\n~No doubt, smoke them cowards, you stillmatic\n\n[Verse]\nMa, I'm sorry who the fuck I am, I can't trust my fans\nOut of luck, no constructive plans\nMy friends stay powdered up, I'm so drunk, can't stand\nYou said if I would sober up, I'd be a powerful man\nTurned out the street life, you prayed I wouldn't\nBut every church in the world can't save our children\nI stayed out late, you heard shots, thought it would be\nYour oldest son on the ground dead, but fortunately\nThem bullets had some other names on it, the brother was blind\nI hit the L, then, we yell out, \"It wasn't my time!\"\nI loaded up shells, one by one\nYou smelled blunts from my room door, little Nasir was at war\nAnd little did I care what you saw\nCrew deep with a few heat, now it's time we settle the score\nBut in the projects, I vision Muhammad, in linen garments\nPreaching man, woman, and child, the living Prophet\nAnd I'm similar, Nasir Bin Olu Dara Visqu Allah\nFist full of dollars in the dice game, God\nThe Ice King, God, the Black Christ, elegant stance\nClothes fit me like a crime boss, the medicine man\nI see the world collapsing, young pregnancies\nYoung girls are unfastening their Sasoon jeans, no prophylactic\nAll this fast shit and fly jewelry, now makes my eyes teary\nN.Y. City, grab a hold and ride with me\nRip the Freeway, shoot through Memphis with MoneyBags\nStop in Philly, order cheese steaks and eat Beans fast\nAnd bring it back up top, remove the fake king of New York\nYou show off, I count dough off when you sample my voice\nI rule you, before, you used to rap like the Fu-Schnickens\nNas designed your Blueprint, who you kidding?\nIs he H to the izz-O, M to the izz-O?\nFor shizzle you phony, the rapping version of Sisqo\nAnd that's for certain, you clone me, your wack clothes line\nI'd rather Sean John, you bore me with your fake coke rhymes\nAnd those times, they never took place, you liar\nUn was your first court case, you had no priors\nYou master fabricated stories of streets and sound slick\nHave you surrounded, you and the faggots you down with\nWhile they riding Nas, trying to boost their careers\nCorny as Cormega, all you Hip-Hop queers\nSince Illmatic, It Was Written, I Am Nastradamus\nThat's the answers to the puzzle I gave you, now here's a promise\nMy next few albums, instead of projects\nThey'll be a difficult test inside the cover for the mind's optics\nCome in my hood, but bring the guns with you, it's dark\nHeaded through Brooklyn, Queens, Harlem, Staten, and Bronx\nHeaded through Compton, Oaktown, South Central, and Watts\nNew Orleans, Mississippi, Chi-town, every block\nI'm trying to have my positive ways, I put my rhymes on page\nDid crimes and headline on stage\nI signed a contract, so here it is, you have it\nStreet's Disciple, I'm Stillmatic\n\n[Female voice sample]\nYou make me feel so good", "image": "https://images.genius.com/90d4ea3e4b4e95ac0bf888101ab63895.480x360x1.jpg"}], "artist": "Nas"}