{"songs": [{"title": "Pound Cake Freestyle", "album": null, "year": "2013-10-07", "lyrics": "[Intro: Jimmy Smith]\n\nGood God Almighty. Like back in the old days. You know, years ago they had the A&R men to tell you what to play, how to play it and you know whether it's disco and rock but we just went in the studio and we did it. We had the champagne in the studio, of course, compliments of the company, and we just laid back and did it. So we hope you enjoy listening to this album half as much as we enjoyed playing it for you. Because we had a ball. Only real music is gonna last, all the other bullshit is here today and gone tomorrow...\n\n[Verse 1: Meek Mill]\nPhil made millions, James made millions\nCoon went drop top Rarri, no ceiling\nI'm just chilling, Omelly even spilling\nLike Ace of Spade and Club LIV, we in the building\nPretty hoes to many flows the way I kill em\nGive my cousin Tock my Bentley the way I'm feeling\nFuck this money and fuck these hoes\nSame gear for a week, I'm like fuck these clothes\nPmon had bricks 'fore you had braces\nMy whips all black, I guess I'm acting racist\nMy bitch all bad, she half black and asian\nScream \"sak pase\" I guess I'm acting Haitian\nOut in M.I.A with some real zoes\nAnd no lame bitches around us, all real hoes\nThese niggas rap good but they weirdos\nAnd if they ever disrespect me then it's air holes\nThey say do for self, that's a word to the third\nBut if my nigga can't rap I'll buy him a bird\nAll real estate, fuck it, I'm buying the curb\nI buy a crib every week from the hood to the burbs\nMaking investments with this money I'm blessed with\nNigga tryna snatch my chain, that's a death wish\nRiding through my city 57 that's the FN\nYou ain't never seen a nigga this rich and reckless\nYou niggas paying hoes just to stick around\nSimmer down, Mulsanne how I get around\n50 rounds through the town how I whip around\nI'm getting richer so you know they wanna sit me down\nIt's DC, double M, know they hate us\nMe and Ross both got rich but we ain't break up\nNiggas falling out for the paper but try to make up\nFor the cameras, niggas might fool y'all but can't fake us\nPull up in the hood I put niggas on jets\nTake 'em to Miami when they just was on steps\nSelling green and serving fiends up in the 'jects\nPacks still on 'em in the pool getting wet\nThey killed Dame set him on fire\nAnd the crazy part that niggas was quiet\nNiggas on obituaries like they flyers\nTime is money so it's sky dwellers when we buy 'em\nRolex niggas,stretch like bowflex, nigga\nSellin' Instagram, feds takin' kodak, nigga\nI've been rich since 24, you ain't know that, nigga?\nAnd I was taught pay that man if you owe that nigga\nGone...\n\n[Interlude: Meek Mill]\nAnd all this shit I'm talking right now is straight facts\nIf you're from my hood, you know what I'm talking about\n\n[Verse 2: Spad-O]\nMeek what up boy, turn the beat up for me a little bit\nIts your man Spade-O, DC, on deck, lets go\n\nThis that new philly due op\nWho is you op (who are you?)\n150 rounds in the o-op\nI'm chasing big cheese\n1 on 1 you can't get these (nope!)\nEmbalming fluid mixed with mint leaves\nWe call it wet wet\nMy niggas jet set\nWere always on the go\nY'all just get set\nMeek made millions, so why can't I? (why not?)\nPull up that cranberry Porsche with the slant eyes\nI don't get mad, I get motivated\nBack to backing in all foreigns we motorcaded\nAnd I don't battle, I respect the war\nPull up that bullet proof caddy with the extra door\nStash box & the extra floor\nRock the world 24 bringing extra whores\nOh yea we about the pound cakes\nYou crawl snatching niggas ain't been around cakes\nSaran wrap around the big blocks\nAnd thats real rap I am hip-hop\nYou hear me rhyme, you can feel my pain and anguish\nI don't do much talking, I speak the language\nMy crew too live\nI'm in my new rise\nSuccess go to the believers, I make my Duas\nI'm at the game, in dem' floor seats\nYou got dem' nose bleed, barely at door seats\nUhh\nI'm getting fit for ring\nBezel on my presidential crown fit for a king\nDC is like the army, better yet the navy\nNiggas, acting shady so i grip my 80\nSo I, peep the blitz like I'm Tom Brady\nI'm the, sure thing & you niggas maybes\nNah, I dont two stroke, I live a bike life\nBut I move coke, I live the white life\nI'm the truth, why i got to lie for?\nI was born broke but I won't die poor", "image": "https://images.genius.com/6929169de7116d41676151bdea5cc773.1000x1000x1.jpg"}], "artist": "Meek Mill"}