{"songs": [{"title": "Sumtn’ 4 Urrbody", "album": "Red Gone Wild: Thee Album", "year": "2007-03-27", "lyrics": "[Hook by Blam]\nThis is sumtn' 4 urrbody get yo' hands up\nOn the grind, money on yo' mind get yo' grands up\nIf you on top getting hella guap stand up\nIf you on da corner you a goner home and man up\nThis is sumtn' for all my peeps on da East Side\nA lil sumtn' for my G's on the West Side\nNow if ya want it we on it dog, ya know how it is\nWe're with the illest and realest killers, we handle our biz\nLet's get it, rahh\n\n[Runt Dawg]\nY'all hear that big trunk bumpin', yeah that's Runt Dawg\nSystem knock harder than the cops at your front door\nMuhfuckas always talkin' tough like they want war\nMatta fact next nigga stunt gon' get dumped on\nYeah, Dawg home\nI break your jaw bone\nAnd the '8 make you lose more weight than Star Jones\nRappers don't come to Jers'\nGun under my undershirt\nI'm hollerin' \"Gilla House!\" drunk off the Thunderbird\nMy bitch be like, \"Damn nigga wash yo' feet\"\nShe say the hair on my chest look like taco meat\nShit, two hammers\nMake your whole crew vanish\nI'm a animal in front of Channel 2 news cameras\nBitch I'm like John Wayne\nShot like LeBron James\nThe chrome fo'-fo' pretty like Ricky Fontaine\nMy gorillas kill a man\nWe thicker than\nThat wic check peanut butter that come in that big silver can\n\n[Hook]\n\n[Ready Roc]\nFuck it let's make it hot\nI'm reppin' for all my blocks\nDuckin', dippin' the cops\nReady runnin' the dock\nIcarus in his sock\nWe comin' straight from the bottom going straight to the top\nThese haters want us to stop\nGroupies is on our cock\nCuz they know it's going down like I'm Young Joc\nBut I'm not\nReady Roc\nKeep the pistol grip\nThis some official shit\nBrick city keep it wrapped like a Christmas gift\n\n[Redman]\nYo, eh yo cock it back click-click-click Hey!\nIt's Dr Bombay\nSick flow, get your Medicaid\nAnd I'm like Hey!\nMy hometown is NJ\nEyes redder than Reynaldo Rey\nI just blaze\nAnd I'm a soldier, better follow the leader\nAnd for guap I even smack kids like Madea\nI'm for re-a'\nYour boy is tight\nYou got weed? Nigga show ya right\nGimme a light\n\n[Hook]\n\n[Icadon]\nIcadon nigga I got the semi with the lens\nI'm in Bushwick, Brooklyn lookin' pretty in the Benz\nGhostwriter, got the spirit of Biggie in my pen\nFunk Doc said it's time to go, Gilla begins\nIcadon, you probably saw me leanin' in the B-M'er\nFly nigga, baby my socks be up in the cleaners\nIn the club with twin bitches steamin' on my reefer\nThey both go at my balls like Venus and Serena\nWhat's good?\n\n[Saukrates]\nNigga I double\nMy trouble\nThrough a war, price bubble\nHalf dog and half gorilla, get a tight muzzle\nI shut you down like Smith infrared light gun do\nMy Mrs Smith'll have you turn over that ice bundle\nCadillac Devilles look right with that (Gilla House)\nComin' through yo' speakers like my ice cream (in ya mouth)\nI shoot a bazooka not pipe dreams (Clear 'em out)\nMy name is Saukrates get yo' hands up Gilla House!\n\n[Blam]\nThis is sumtn' 4 urrbody get yo' hands up, hands up...", "image": "https://images.genius.com/65aa1591ac947b9397141766462ac089.465x465x1.jpg"}], "artist": "Redman"}