{"songs": [{"title": "Max Julien", "album": "Who You Mad At? Me Or Yourself?", "year": "2013-04-18", "lyrics": "[Intro: A$AP Rocky]\nHello, it's the Mack, sit back and relax\nAs we chat on ways to make a couple stacks off your snatch\nHold up, here's the catch, you might have to hit the track\nTake a loss, make it back, if you get caught, bitch shut your trap\n\n[Hook: A$AP Rocky]\nAll my life\nI've been waiting for your love\nAll those nights\nI'd been lusting for your touch\nTell that bitch I need money\nBitch I need money\nI need money\nBitch I need money\nI need money\nBitch I need money\nI need money\nTell that bitch I need money\nTell that bitch I need\nMoney make the mothafuckin' world go round\nNo, money make your mothafuckin' girl go downtown\n\n[Verse 1: A$AP Rocky]\nRiding 'round, I'm getting it, two chains on like I'm Tity\nVersace shades like I'm Biggie, them twenties, fifties and benjis\nThese bitches all in my business, I mack 'em then I act stingy\nI never slip with my pimping, when I holla come and get with me, huh?\nDrizzy, huh? Swizzy, huh? Prada, Gucci and Fendi\nWhich only means you fancy, my trillest bitches is trendy\nShe tipsy off of that Crissy, my pimping never been friendly\nShe fell in love cause I'm pretty, she love me more than her family, huh?\n\n[Hook: A$AP Rocky]\nAll my life, I've been waiting for your love\nAll those nights, I'd been lusting for your touch\nTell that bitch I need money\nBitch I need money\nI need money\nBitch I need money\nI need money\nBitch I need money\nI need money\nTell that bitch I need money\nTell that Bitch I need\nMoney make the mothafuckin' world go round\nNo, money make your mothafuckin' girl go downtown\n\n[Verse 2: ASAP Ferg]\nI need new Bape, grandpa need a toupee\nMama need some new weave, get her hair done with new braids\nSo bitch give me money, stop dicking around like you paid\nHeated that grip like today, better hit that strip like today\nBetter hop in that whip with the coochie, then she lick dick to the new king\nThem niggas be balling like 2K, better suck that dick 'til Tuesday\nBetter get them chips 'fore it's too late, it's a new bad bitch with a booty\nWho sucking and fucking for Kool-Aid and keeping that pimp in a new Range (Oh, Lord)\n\n[Hook: A$AP Rocky]\nAll my life, I've been waiting for your love\nAll those nights, I'd been lusting for your touch\nTell that bitch I need money\nMoney make the mothafuckin' world go round\nNo, money make your mothafuckin' girl go downtown\n\n[Outro: A$AP Rocky]\nWhat? I ain't tryna fuck, make her, make a buck\nEvery nigga in the world wanna live it up\nGive it, give it up, trill bitch, don't give a fuck\nAnd she get a pimp nigga like me, rich as fuck", "image": "https://images.genius.com/43cf4f7fb829f88b270853d2534b8f0f.1000x1000x1.jpg"}], "artist": "A$AP Rocky"}