{"songs": [{"title": "3 a.m.", "album": "Relapse", "year": "2009-04-23", "lyrics": "[Intro]\nThere is no escaping (Yo)\nThere's no place to hide (Ayo)\nYou scream, \"Someone save me!\" (Yo)\nBut they don't pay no mind (Ayo)\nGoodnight, goodbye!\n\n[Verse 1]\nYou're walkin' down a horror corridor\nIt's almost four in the mornin' and you're in a\nNightmare, it's horrible, right there's the coroner\nWaiting for ya to turn the corner so he can corner ya\nYou're a goner, he's onto ya\nOut the corner of his cornea, he just saw ya run\nAll you want is to rest 'cause you can't run anymore, you're done\nAll he wants is to kill you in front of an audience\nWhile everybody is watching in the party, applauding it\nHere I sit, while I'm caught up in deep thought again\nContemplating my next plot again\nSwallowin' a Klonopin while I'm noddin' in and out on the ottoman\nAt the Ramada Inn, holding onto the pill bottle, then\nLick my finger and swirl it 'round the bottom\nAnd make sure I got all of it\nWake up naked at McDonald's with\nBlood all over me, dead bodies behind the counter, shit\nGuess I must've just blacked out again—not again!\n\n[Hook]\nIt's 3 a.m. in the mornin'\nPut my key in the door and\nBodies layin' all over the floor and\nI don't remember how they got there\nBut I guess I must've killed 'em, killed 'em\nI said, it's 3 a.m. in the mornin'\nPut my key in the door and\nBodies layin' all over the floor and\nI don't remember how they got there\nBut I guess I must've killed 'em, killed 'em\n\n[Verse 2]\nSitting nude in my living room, it's almost noon\nI wonder what's on the tube, maybe they'll show some boobs\nSurfing every channel until I find Hannah Montana then\nI reach for the aloe and lanolin, bust all over the wall panellin'\nDismantlin' every candle on top of the fireplace mantel and\nGrab my flannel and my bandana, then\nKiss the naked mannequin man again\nYou can see him standin' in my front window if you look in\nI'm just a hooligan who's used to using hallucinogens\nCausin' illusions again, brain contusions again\nCutting and bruising the skin, razors, scissors, and pins\nJesus, when does it end? Phases that I go through\nDazed and I'm so confused\nDays that I don't know who gave these molecules to\nMe, what am I gon' do?\nHey, the prodigal son, the diabolical one\nVery methodical when I slaughter them\n\n[Hook]\nIt's 3 a.m. in the mornin'\nPut my key in the door and\nBodies layin' all over the floor and\nI don't remember how they got there\nBut I guess I must've killed 'em, killed 'em\nI said, it's 3 a.m. in the mornin'\nPut my key in the door and\nBodies layin' all over the floor and\nI don't remember how they got there\nBut I guess I must've killed 'em, killed 'em\n\n[Bridge]\nShe puts the lotion in the bucket\nIt puts the lotion on the skin\nOr else it gets the hose again\nShe puts the lotion in the bucket\nIt puts the lotion on the skin\nOr else it gets the hose again\n\n[Verse 3]\nI cut and I slash, slice and gash, last night was a blast\nI can't quite remember when I had that\nMuch fun off a half-pint of the Jack, my last Vic and-a-half\nA flashlight up Kim Kardashian's ass\nI remember the first time I dismembered a family member\nDecember, I think it was, I was having drinks with my cousin\nI wrapped him in Christmas lights\nPushed him into the stinkin' tub, cut him up into pieces\nAnd just when I went to drink his blood\nI thought, \"I oughta drink his bathwater, that oughta be fun\"\nThat's when my days of serial murder manslaughter begun\nThe sight of blood excites me, that might be an artery, son\nYour blood-curdling screams just don't seem to bother me none\nIt's 3 a.m. and here I come, so you should probably run\nA secret passageway around here, man, there's got to be one\nOh no, there's probably none\nHe can scream all that he wants, top of his lungs\nBut ain't no stopping me from chopping him up-up, 'cause…\n\n[Hook]\nIt's 3 a.m. in the mornin'\nPut my key in the door and\nBodies layin' all over the floor and\nI don't remember how they got there\nBut I guess I must've killed 'em, killed 'em\nI said, it's 3 a.m. in the mornin'\nPut my key in the door and\nBodies layin' all over the floor and\nI don't remember how they got there\nBut I guess I must've killed 'em, killed 'em\n\n[Outro]\nYo, yo, ayo (Evil… rise)\nYo, yo, ayo (Evil… rise)\nYo, yo, ayo (Evil… rise)\nYo, yo, ayo (Evil… rise)\n(Evil… rise)\n(Evil… rise)", "image": "https://images.genius.com/35fb3ef95f68fd39cfbf82749a7b0235.1000x1000x1.png"}], "artist": "Eminem"}