{"songs": [{"title": "Get My Gun", "album": "D12 World", "year": "2004-04-27", "lyrics": "[Intro: Eminem & Kon Artis]\n*Gun being cocked*\nI'm gonna get my gun!\n\nThis motherfucker wants to disrespect me?\nEm, Em, what the fuck you doing, man\nI got something for his ass\nCalm down!\nNo, YOU calm down!\nMan, what's your problem\nFuck that, the motherfucker wants to pop shit to me!?\nMan, he wasn't popping shit\nYou heard him, he was popping that shit!\nWhat shit?\nThat shit, you heard him!\nHe asked for your autograph!\n\n[Verse 1: Swifty McVay]\nA mass murderer, pack burners to blast further then you can get\nMy shit be shooting through bricks\nI mix anything together, I done guillotine a nigga\nKeep a heater that pop clips with seventeen or better\nI'll be severing heads, I'm in everyone's nightmare\nA nigga that can never ever be scared of the feds\nSend the niggas that'll fuck with you\nStab and brass knuckle you\nThen have you in the public, there's nothing that you can do\nEnough with you're motherfucking tough talk, you're soft\nGet you're balls blew off, from a sawed-off, I'm raw dog\nCrazier then all y'all, got you like the navy when I'm angry\nYou'll never catch me hanging in a Narc's car\nAll I have is thought of, breathing evil\nDesert Eagles will eat through people\nWhen I see you I'mma heat your beef slow\nFuck being peaceful, the piece in the vehicle and\n(I'm gonna get my gun!)\n\n[Hook: Eminem]\nThis motherfucker's popping that shit\nNah, fuck that, I'll be right back\n(I'm gonna get my gun!)\nNah, motherfucker, fuck you\nYou ain't disrespecting me like that\n(I'm gonna get my gun!)\nWalk to the room, sixteen shot clip\nBitch, how you like that\n(I'm gonna get my gun!)\nBet you ain't know that I'm strapped\nNice one, bitch, this is my gat\n(I'm gonna get my gun!)\n\n[Verse 2: Kuniva]\nI bring it to niggas looking as if they want trouble\nI send they body flipping around like a stunt double\nForget about the fighting, scrapping, squabing, bucking\nI'll squeeze the piece you jumping, dodging, ducking\nSquatting under trucks and screaming \"that nigga's bluffing\"\nI cuff my nuts while cussing \"don't trust him\"\nI round up Runyan, Dave, Wood and Nico\nMy nigga Big I and Mal' letting the heat blow\nHeat seek hoes got A&E closed\nCause you keep shooting at me and missing like Shaq's free-throws\nYou gotta get a little closer if you wanna try\nPistol whip a soldier, with a missile on his shoulders\nWe can fold or blow your brick house into some tiny boulders\nA grimy, older cat will leave you with a tiny odour\nI'm doggish, you feeling froggish, then leap bitch\nMy car is right across the street bitch and (I'm gonna get my gun!)\n\n[Verse 3: Proof]\nMy whole outfit count clips, get your house lit the fuck up\nYour spouse shit, and your mouse clip\nBetter bounce, bitch, countless, slugs I'mma send\nWatch you holler when the hollow tips go through your skin\nI'm in love with the sin, tell Bugz I'mma see him\nWhen I cock back, right, I’ll put your blood on your friends\nMake a rug outta him, bust a slug on his chin\nAin't going no were like the drugs outta Kim\nI'm a psycho icon, a mightful might bomb\nGet a eye full of lid when I slight your lights out\nWith a street cleaner, wipe your life out\nBullets gnaw at your ears, like a Tyson fight bout\nFuck the night clout, guns, clips...\n(I'm gonna get my...)\nFuck that, run bitch!\nHit the streets talks, chumps don't know me\nAin't no prob to leave your whole bod' holey\n\n[Hook fades out in the background]\n\n[Eminem]\nDumbass motherfuckers always gotta come to me with some dumb shit\nFucking\nI done told this motherfucker\nWassup, bitch?!\nAutograph this!\nOh shit...\n\n[Verse 4: Eminem]\nI'm trying to pull the trigger but it's stuck, fuck\nMy shit is all jammed up, ugh\nCome on, you cock-sucking, good-for-nothing\nMotherfucking piece of shit shoot, ah\nYeah! What up, bitch!? Say that shit again\nShot, the bullet missed, hit a brick, bounced of it\nRicocheted back in his shin\nWent through his bitch on it's way back, hit his friend\nPayback homie, don't play that shit is spin\nTo be on I told you to leave this shit alone\nOr... (I'm gonna get my gun!)\nAnd it's a shame, I'm too drunk to even aim\nDenaun stepped in the way and I shot him in his leg\nIt's like\n\n[Verse 5: Kon Artis]\nBang, bang, bang, nigga, pow, pow, pow\nEverybody busting rounds like they Ra', Ra', Ra'\nBut when you see me in the street I be like, what's up, now\nTheir bodyguard be stepping in trying to calm shit down\nFuck that! I got a bone to pick\nYou said it then we should address like some grown man shouldn't we\nThen me and you could talk about our problems couldn't we\nJust shoot a fair one and handle this situation seriously\nI guess not, you want to resort to the heater\nSo I gotta grab my Mac and my Uzi and my Nina\nStep in between us and get shot\nBut get separated with the squeaza\nYou ain't ready for war, Runyan ain't nothing to play with\n\n[Hook: Eminem]\nThis motherfucker's popping that shit\nNah, fuck that, I'll be right back\n(I'm gonna get my gun!)\nNah, motherfucker, fuck you\nYou ain't disrespecting me like that\n(I'm gonna get my gun!)\nWalk to the room, sixteen shot clip\nBitch, how you like that\n(I'm gonna get my gun!)\nBet you ain't know that I'm strapped\nNice one, bitch, this is my gat\n(I'm gonna get my gun!)\n\n[Verse 6: Bizarre]\nWalk to Rite-Aid for a can of spaghetti\nIt's been one hour, bitch, my photos ain't ready\nPictures of my dog and my family reunion\nIt's been two hours and my fucking days ruined\nHey, Kate, do you wanna get raped\nHave my pictures on fucking Philips 38\nThat's why I don't be fucking battle rapping\nCause every time I lose, this what the fuck happens *Gunshots*\nBack to the pictures I was trying to get developed\nThis man tried to get in front of me, I wouldn't let him\nI'm ready to blow this bitch's brains out\nI'm nervous, I farted, some shit came out\nTimes up, shot her with a gun\nGot on my cellphone and called Reverend Run\nAnd all this crazy shit, I regret it\nAll because I wanted to see Elton John naked", "image": "https://images.genius.com/6246e5d82871d591568c0f8881ed9690.1000x1000x1.jpg"}], "artist": "D12"}