{"songs": [{"title": "Wraith", "album": "DIME TRAP", "year": "2018-09-07", "lyrics": "[Intro: T.I.]\nYeah\nHey man\nI got a real short list of shit I like to do\nYa dig\nGet money (Yeah)\nKick shit (I Just wanna ball, yeah)\nThat's the list, nigga, that's it\n\n[Chorus: T.I.]\nI just wanna ball in the wraith\nWith your broad in the way\nAnd I wanna, I'ma take my shot\nI pray to God, is it all in a day\nLeave your daughter with the papers\nFuck a hater 'til the day I die (yeah, yeah, yeah)\nFuck what them bitches saying, fuck what them niggas doing\nBefore you were getting going, I was getting to it\n\n[Verse 1: T.I.]\nPut it down, bankrolls in the neighborhood\nWas catching cases, before I got to get some paper good\nLil homie asked me \"Unc, how do you know you came up?\"\nI said you deal with less bitches wearing lace fronts\nI don't like her, feel that way about a lot of rappers\nI don't talk about 'em\nMost these niggas ain't gon' bust a grape and they just talking loud\nGodbody, got a problem, nigga go to war about it\nHm, having problems understanding your logic, man\nFor four hundred, I'll take your honey and tour London\nGet some more money\nDon't believe me? Well, you a dummy\nAin't no pun intended\nMilitary guns in the mansion\nAin't no runnin' in it\nA rubber when I fucked that bitch\nIt ain't no cumming in it\nSince my first album, I been serious\nAin't no funny business\nBitch, ain't no funny business\nNo weapon against me shall prosper\nBut it's welcome to form\nKnew from the day I was born I'd perform in the Forum\nRinging bells and blowing horns when my name called\nI'm just a self-made nigga in the wraith though\n\n[Chorus: T.I.]\nI just wanna ball in the wraith\nWith your broad in the way\nAnd I wanna, I'ma take my shot\nI pray to God, is it all in a day\nLeave your daughter with the papers\nFuck a hater 'til the day I die (yeah, yeah, yeah)\nFuck what them bitches saying, fuck what them niggas doing\nBefore you were getting going, I was getting to it\nI just wanna ball in the wraith\nWith your broad in the way\nAnd I wanna, I'ma take my shot (yeah, yeah, yeah)\n\n[Verse 2: Yo Gotti]\nI'm a dope boy legend\nStreet I'm reppin\nNot a stone in a watch, no charm on the necklace\nThey say I'm reckless, yeah, I might be\nDon't give a fuck about no nigga who don't like me\nNow, if I go to jail today, that bitch gon' write me? No\nShe gon' fuck me? No, if a nigga go broke\nI bet a Wraith on the Super Bowl\nIn the kitchen, super cold\nSix ounce, four pints, that's a super stove\nBefore I ever had a plaque and a hit\nBoy, I bet I had a MAC and some bricks\nIf it's stars in the wraith, got the titles in the safe\nGot the lawyers on deck, got the money for the case\nTruck, truck, Lambo\nGuns, guns, ammo\nMe and Black Youngsta, back to back cause that's my fam-o\nHe a white man, kill him\nFor his shit, she want a check for the pussy\nThat's that out the North shit\n\n[Chorus: T.I.]\nI just wanna ball in the wraith\nWith your broad in the way\nAnd I wanna, I'ma take my shot\nI pray to God, is it all in a day\nLeave your daughter with the papers\nFuck a hater 'til the day I die (yeah, yeah, yeah)\nFuck what them bitches saying, fuck what them niggas doing\nBefore you were getting going, I was getting to it\nI just wanna ball in the wraith\nWith your broad in the way\nAnd I wanna, I'ma take my shot (yeah, yeah, yeah)\n\n[Verse 3: T.I.]\nPresidential swag\nIn the slum with the hairnet\nRunning up a bag, do it for 'em just to pass out\nDab in my bag, give it to her, wear her ass out\nDick game great, give it to her till she pass out\nThis the real caine, add B12, pour baking soda\nStretch a quarter out a whole, and no details (No!)\nShout to all my niggas, who legitimized they figures\nNow they rich and you just get it out the blue\nNow he ridin' in the Rolls Royce\nCame out the bottom, now he making more than ol' boy\nAlways been a hustler, not a robber, I never stole nothing\nTrappin', flippin' work till they come up on a whole one\nHuh ok, K-I-N-G, can't deny me\nNiggas still rhymin' 'bout what we did in the 90's, nigga\nYeah, see it on my face, dawg\nI'm just a real nigga riding ridin' under Wraith stars\n\n[Chorus: T.I.]\nI just wanna ball in the wraith\nWith your broad in the way\nAnd I wanna, I'ma take my shot\nI pray to God, it's all in a day\nLeave your daughter  with the papers\nFuck a hater 'til the day I die (yeah, yeah, yeah)\nFuck what them bitches saying, fuck what them niggas doing\nBefore you were getting going, I was getting to it\nI just wanna ball in the wraith\nWith your broad in the way\nAnd I wanna, I'ma take my shot (yeah, yeah, yeah)\n\n[Outro: Dave Chappelle and T.I.]\nDave Chappelle: You gone have to run this back! Hold on, one second, tho. God damn, nigga, I wasn't ready for that!\nYo, this gotta make the album\nT.I.: Mmm, Everything I'm playing you is going on the album\nDave Chappelle: Nigga, this that nitty gritty for the city. That shit is what's up, like.. ding ding ding ding ding ding. Beat sound sneaky as shit! I like that. I like that", "image": "https://images.genius.com/a78d362910b94e3242fe1ffbdbafe94c.1000x1000x1.jpg"}], "artist": "T.I."}