{"songs": [{"title": "Real Women", "album": null, "year": null, "lyrics": "H-Town women (this is so soulful right now!)\nChocolate women (this is so soulful right now!)\nNew York, New York women (U-G-K, Raheem DeVaughn)\nA-Town women (Kweli)\nThis is for Chi-Town women (my real women)\nMy Midwest women! (my Midwest women)\nDown South women, the West Coast women\nAll of my women, whoo!\n\nNow bein King of the Underground's a title I wear with pride\nLike my syrup and swisha can't leave without it when I ride\nEven though I'm the king of the city where I reside\nI wouldn't and couldn't do it without my woman on my side\nSometimes I got it figured out, sometimes I'm confused\nI win 9 times out of 10 but now and then I might lose\nBut no matter the road I choose and how the drama unfold\nA playa always got his better half right on his shoulders\nShe gon' hold me down to the fullest, rainy or sunny\nShe seen me ball out of control and dead broke with no money\nSo when the game got funny, she ain't pack up and roll\nShe help me get back on my feet now man that's way too cold\nIf you got a down woman wit'chu keepin' it true\nDon't try to hate, appreciate her for the things that she do\nThis dedicated to the dedicated ladies that stand up\nIf you keep it real wit your man, then put your hand up, c'mon\n\n[Chorus: x2]\nThis for the real women (the solid ladies and the pros)\nBut the real women (that play the game like they suppose)\nThey the real women (the Queens holdin down they Kings)\nThey the real women (so go on girl do yo' thing)\n\n(Uh) I'm 'bout to spoil you, show you my gratitude\nI love the all of you, even your attitude\nNever gonna give you black-n-blues, that's abuse I'm not that dude\nTake it back to when I held yo' hand and my name became yo' back tattoo\nI love the fact that you don't need me to make you whole\nDoin' it fast or takin' it slow, you know when to let me take control\nAnd I apologize for puttin' tears inside them eyes\nWhen I wasn't fair didn't compromise, put you in fear when I told them lies\nHow I love to dive inside them thighs, I love your cockiness\nAin't gonna ask if you roll in rap, you know this right it's obvious\nI'm an Underground King with a winner down Queen I'm fin' to let her know\nThis ain't about bling, this ain't about cream, I never let her go\nWe smokin' love (smokin' love) you know what's up (know what's up)\nThis for the real women, that's you? Throw it up\nCause your man's so focused you rub your lips lovin' the bub cause I open you up\nYou got my back whether broke or re-up in the crush limousine cause we rollin' up\n\n[Chorus]\nUh, you was down from the get-go\nI put it down with them silly hoes\nRidin' tryin' to get the dirty do'\nDidn't know what my life was goin' have in sto\"\n'Til my karma came\nAnd you was right there tryin' to have my things\nWhen the chips all fell down\nYou was the only one I had around\nSaved my life when I was 'bout to drown\nGirl you my queen, come and get your crown\nNow I keep you with the nice things\nV-V-S ice blings, 10-karat diamond rings\nIf I ain't tell you with the biz\nGirl you my baby 'til the end\nAnd I'm a treat you like a king supposed\nKeep you ridin' Rolls slammin' matchin' do's\n\n[Chorus]\n(Uh) H-Town women\nChocolate women\nNew York, New York women\nA-Town women\nThis is for Chi-Town women\nMy Midwest women!\nDown South women, the West Coast women\nAll of my women, whoo!", "image": "https://s3.amazonaws.com/rapgenius/talib-pic.png"}], "artist": "Talib Kweli"}