{"songs": [{"title": "Southern Gangsta", "album": "Theater of the Mind", "year": "2008-11-24", "lyrics": "[Intro: Ving Rhames]\nHe's a hustler, unbound by law\nA self-made millionaire\nWith a wreckless disregard for the haters\nLudacris, on \"Southern Gangsta\"...\nA true entrepre-negro\nCEO of Disturbing Tha Peace Records\nHe expanded his empire into multiple profitable businesses\nIncluding his Thai food restaurant, Straits\nInternet sites, WeMix.com\nAnd my favorite, MyGhetto.com\nThe MVP of this rap shit\n\n[Verse 1 - Ludacris]\nLuda! I'm a hustler, BALLER, gangsta, CAP PEELER\nI stay strapped like your neighborhood trap dealer\nI got rifles that blow ya below ya bible belt\nAnd mac-11's that leave you wetter than Michael Phelps! (woo!)\nBut you'll be swimmin with the fishes\nSofter than bitches washin dishes, fool what's the BUSINESS?\nI'm already rich, so talk mo' figures (yup)\nSpit 30 large for cigars of you ho niggas (oww!)\nI got gangstas that'll rearrange ya whole face\nAnd put your casket on ice, now that's a cold case (ha!)\nNever forget where you come or that block'll bang you\nI keep my ear to the STREETS like a cocker spaniel\nI cock and blast you into outer space\nBreak every bone in ya, you so out of place\nBoom without a trace, you a bluff to block\nI got some red beams, let's play connect the dots!\n\n[Interlude: Ving Rhames]\nHe's the biggest boss, comin outta the M-I-yayo\nStraight from the \"Port of Miami\"\nTo keepin it \"Trilla\"\nInvolved in many heated acts of violence\nThis goes deeper than rap shit\nHe's worth eight figures\nSo young niggas, boss up\nI present to you, Rick Ross, the boss\n\n[Verse 2 - Rick Ross]\nI got a letter from the government, the other day\nI opened and read it, it said \"We were hustlers\"\nHad a Lexus at 18, picture that\nGot a Chevy with pictures on it from pitchin crack\nBitch I know Haitians, we speakin Creole\nBitch I'm a D-boy, still slingin kilos\nI got twenty cars, why exaggerate?\nIt cost me five grand just to fill the gas tanks\nLove the marble floors, got the Greek pillrs\nFrontin at awards, real street niggas\nI used to serve shake, now I serve steaks\nThree squares on a row, call it 3rd Bass\nGet the Gas Face, chopper in your laugh face\nShoot his ass, aim defense is the last case\nKeep Jewish friends, the newest Benz\nYou in a pool of blood, let me see you swim\n\n[Interlude: Ving Rhames]\nHailing from College Park, Georgia\nAuthorities figured they must have been some sort of mob\nOr illegal organization\nAccording to authorities, they made a quarter mil' a week\nSelling mid-grade, they were some high-rollin hustlers\nTity Boi, and Dolla Boy\nPlayaz Circle, A.K.A., the Duffle Bag Boys\n\n[Tity Boi] + (Dolla Boy)\nUhh, I'm so sick I wrote this verse in a hospital\nIt's an election year, I support strippers\n(We roll like bicycles, icicle flow)\n(White liquor, my nigga stay on line with the blow)\nI'm on time with the flow, not a minute nor second late\nAin't no such thing as second place\n(And every day I live heavyweight, you niggas featherweight)\n(Fairytale tellin niggas really need to take a break)\nAnd the estate got a lake for a backyard\n(The pool room product put it all on my sacks card)\nFor real? (Yeah, for real) I'm ill, I deal, I did, I will\n(I got dogs like Cujo, me and Tity two chains ridin in a two do')\nBitches catch kudos (you know)\nYeah we move weight like sumos\nAnd kicks it with them bitches like judo\nSOUTHSIDE!\n\n[Outro: Ving Rhames]\nPlayaz Circle, Rick Ross, Ludacris\nThis has been another episode, of \"Southern Gangsta\"\nThanks for tunin in, what's next for Luda?\nWell, anything's possible, in the +Theater of the Mind+", "image": "https://images.genius.com/abff9ac1df466053c5fe1b6b3c92056f.1000x1000x1.jpg"}], "artist": "Ludacris"}