{"songs": [{"title": "Pick it Up", "album": "Maximum Strength 2008", "year": null, "lyrics": "[Hook: KRS-One]\nGet up! What we slowin down for?\nPick it up, pick it up, pick it up, pick it up, pick it up!\nWe got a whole nation to restore\nPick it up, pick it up, pick it up, pick it up, pick it up!\nWe gotta really love each other more\nPick it up, pick it up, pick it up, pick it up, pick it up!\nWhen you see my CD in the store\nPick it up, pick it up, pick it up, pick it up, pick it up!\n\n[KRS-One]\nIt's the teacher, class is open G\nLet's get open on the concept of voting, we\nBegin the discussion by viewing democracy\nPeople power, a people ruled philosophy\nDemocracy is a system of government\nWhere the whole population is the sum of it\nWhere the goverment can't move without its people\nWhere, before the law, everybody's equal\nBut take a look at the police and how they treat you\nTake a look at these corporations that cheat you\nDemocrats and Republicans are all see-through\nNow we voting for the lesser of two evils\nMan, don't let 'em deceive you\nThis is an autocracy, not a democracy\nBut to call this a democracy without mock interest\nIn the laws of society, that's called hypocrisy\n\n[Hook]\n\n[KRS-One]\nDemocracy only happened one time\nIn European history, now keep this in mind\nIt was practiced in Athens overseas\nIn 508 B.C. by Cleisthenes\nCitizens would get together on a hillside\nAnd decide how and if they was gonna ride\nBut in 322 B.C. here's what happened\nAlexander of Macedon conquered Athens\nAnd that was the end of democracy\nWhere the people had a say in their society\nToday, we gotta get more knowledge\nAnd learn about the function of the electorial college\nIt doesn't matter who you vote for today\nThe electorial college has the last say\nBut that's another day, here's what I came to say\nRise up\n\n[Hook]\n\n[KRS-One]\nIn corporate sponsored elections, who's winning?\nThis the wrong direction from the beginning\nEvery candidate got scandal, they all sinning\nTryin to convince you, tellin you what they've been in\nBut the real issues, they get avoided\nWhile our children still gettin exploited\nHeh, they call me Blastmaster Kris\nEdutainment, that's what my tactic is!\nSome criticize Kris, some laugh at Kris\nBut you can't say Kris is not an activist\nSocial justice, I got a passion for this\nCause equal rights we still asking for this?\nSo when I do my tours it's not just rappin for Kris\nI'm givin you more than gun packing with this\nI'm openin doors, you should be asking 'bout this\nYou listening to them whores and them capitalists\nTheir game is tight, got you trapped into this\nIt won't be long before the ring you like have to kiss\nThat's why I'm an activist\nI help people not to get trapped in this\nThe temptation? You gettin wrapped in this\nSo get up, stop sitting like a pacifist\nPick it up, pick it up, pick it up, pick it up", "image": "https://images.genius.com/8e8d71ccffef56195f7ad1ad515b3f54.640x640x1.jpg"}], "artist": "KRS-One"}