{"songs": [{"title": "Up (SS2)", "album": "Slime Season 2", "year": "2015-10-31", "lyrics": "[Intro]\nWheezy what the fuck brackin', nigga?\nI might need to be on beat for this one\nYou dig?!\n\n[Chorus]\nWoah, we tore up\nI'm like baby don't throw up, if she ever hit the ground\nYoung Thug not pickin' her up, you can Quicker Picker Up\n'Cause I'm a blood, pass me my bup, tryna come around for help but you gon' (What?)\nEnd up suckin', nothing but dick like woah\nBaby girl gon' stay and drop it, no steps but I promise I go up\nGirl what up? I'm like baby this what's up\nShe under me like a rug, can't go up, yep\n\n[Verse 1]\nTrick bitch pull up on me, tryna get these digits\nHow the fuck I love when I never like 'em, ooh\nBitch I am a genie, I got hoes in Magic City\nEven when it's rented, president tinted\nI need an Aaliyah she gon' rock all on my boat\nMy chain small but only my weed make me choke\nHey come here baby girl I want that amateur throat\nAnd when I get through I pass it to all of my folks\nDamn they got my name on the Coke\nBlackjack got me winning by the boats\nShoot dice nigga five deuce four tre\nAnd my weed orange like a fuckin' cantaloupe\nShe fuck me then smile in your face, all she ever say is \"Oh yeah\"\nOoh baby girl, pull up and give top, no lotion, she like Olay\nHey I don't like 'em black, no spades, no way\nAnd I only tell her to hurry and wait\n\n[Chorus]\nWoah, we tore up\nI'm like baby don't throw up, if she ever hit the ground\nYoung Thug not pickin' her up, you can Quicker Picker Up\nCause I'm a blood, pass me my bup, tryna come around for help but you gon' (What?)\nEnd up suckin', nothing but dick like woah\nBaby girl gon' stay and drop it, no steps but I promise I go up\nGirl what up? I'm like baby this what's up\nShe under me like a rug, can't go up, yep\n\n[Verse 2]\nBitches comin' round the fuckin gangsta, think they stupid\nPull up in the trenches, smoking loud like a Dually\nAnd I know I am the best, bitch, how you do this?\nAnd I pulled up on your bitch early truancy\nDamn what the fuck is going on, I am gone, so gone\nI just spent a band on cologne, I am on, so on\nAnd my neighbors call my thick misses Texas Roni\nThey was watchin' me back in the days like a Sony, promise\nI just bought my son a Bentley for his 'port card\nAll my bitches coming foreign plus they head on\nThese lil' bitches tryna compete then they dead wrong\nI'ma act just like I'm sleep but I'm dead on\n\n[Chorus]\nWoah, we tore up\nI'm like baby don't throw up, if she ever hit the ground\nYoung Thug not pickin' her up, you can Quicker Picker Up\nCause I'm a blood, pass me my bup, tryna come around for help but you gon' (What?)\nEnd up suckin', nothing but dick like woah\nBaby girl gon' stay and drop it, no steps but I promise I go up\nGirl what up? I'm like baby this what's up\nShe under me like a rug, can't go up, yep", "image": "https://images.genius.com/2b1dcde62657935e97ccf20a99636263.1000x1000x1.png"}], "artist": "Young Thug"}