{"songs": [{"title": "Sunshine", "album": "Sucka Free", "year": "2008-04-12", "lyrics": "[Spoken: Nicki Minaj]\nAyo Young Money nigga. Hello Brooklyn. President Carter. Nicki Lewinsky\n\n[Verse 1: Nicki Minaj]\nMe and the Dread, yo give him some head – blow\nLong as he know he keep me flyer than a Red Bull\nDon't give a damn when Christmas is\nMy bitches is president mistresses\nNow let's go, I'm with the boss, I'm Ms. Ross\nI make them girls jump like I'm Kris Kross\nBack to basics, bitch, I been hot since Asics\nAnd I'm tighter than face lifts, flyer than spaceships\nNow as for Dread? I met him on Mars\nI said, \"I am Minaj and I'm gooder with the bars\"\nHe said that he a Martian, he can be my Tarzan\nAnd he looking for a bad bitch for his squadron\nThat's how we got together, see he control the weather\nI leave my planet never without my um–b–rella\nIt's Dirty Money, slash Young Money, Cash Money\nYou-can't-catch money, run-it-nigga-fast money\nGetting at Weezy, you coming through me-ezy\nAnd I won't hesitate to do anyone greasy\nIf he gimme the word then I'm flipping the bird\nAnd then I'm spinning around and I'm gripping the burner\nSee, I been the bitch since bubble gum and double dutch\nYou was playing hopscotch, bitch, I been top notch\nBitches is whack, they trash, they just pollution\nWrite ya own raps, make that your resolution, fuckas\n\n[Chorus: Babyface (Jay-Z)]\nTouch me with, a heart of gold (uh-huh)\nI can't go a day without my sunshine (uh-huh) ahh-haaa (say what? uhh)\nTouch me with, a smile of gold (yeah)\nI can't go a day without my sunshine, sunshine (uhh, uhh, uhh)\n\n[Verse 2: Lil Wayne]\nI got you baby, yo\nYeah, ok I'm Dread, yo! I keep a red ho\nI keep a red bow, Blood gang, bitch!\nI get that bread dough, I get that head blow\nUntil she got a red throat (Haha)\nNow who be rolling with the boy like sushi?\nShe said her name was Nicki, I'm Tunechi\nI ain't have to introduce me, she knew me\nI told her that's she's unique like a boutique\nAnd I got her and she said she got me\nNow let's go, she with the boss and I'm the boss\n\"He the President, yeah she Lewinsky\" but we never get caught\nAnd I could give her brain back because I'm so smart\nFuck with my bitch and I'mma draw like Picasso art\nYeah, I spit at you like a hot beat\nAnd nigga if it's not her then it's (not me)\nYeah, as for her I met her on Mars and she said\n\"I am Minaj, and I'm gooder with the bars\"\nShe got me with her charm, my wings on my arms\nNow we flying over chicken heads, shitting on ya farm\nLike sitting on a thorn, like sitting on a horn\nWe sticking to your ass, like brass\nSo get a new alarm for me and Miss Nicki Barnes\nCause we kill everyone and get acquitted in the morn'\nSo get a new alarm for me and Miss Nicki Barnes\nCause we kill everyone and get acquitted in the morning, bling!\n\n[Outro: Babyface (Jay-Z), Nicki Minaj, Lil Wayne]\nTouch me with, a heart of gold (uh-huh)\nUh-huh, uh-huh\nBig boogie, I told you we would go through it, baby\nI can't go a day without my sunshine (uh-huh) ahh-haaa (say what? uhh)\nOkay, uh-huh\nNicki Minaj, Nicki Lewinsky, Weezy F, da martian\nTouch me with, a smile of gold (yeah)\nI can't go a day without my sunshine, sunshine (uhh, uhh, uhh)\nListen, listen, uh-huh, Mr. President, you know the mistress gotta holla at you for a minute, right?\nLike I mean, you know, meet the girl in the Oval Office it's nothing\nIt's going down, tell your wife you gon' be a lil' late tonight, hahaha, kyuh", "image": "https://images.genius.com/6723f478cff14a2ba2cbe0ce2ad7d4c2.320x320x1.jpg"}], "artist": "Nicki Minaj"}