{"songs": [{"title": "It’s All on Me", "album": "Compton", "year": "2015-08-07", "lyrics": "[Produced by Dr. Dre & Bink]\n\n[Intro: Dr. Dre]\nFamily problems, it ain't easy handling those needs\n(Sometimes you gotta do what you gotta do)\nBaby mama drama, I just need a little time to go to sleep\n(Damn, only if I had a little time for me)\nRecord company motherfuckers asking me when I'm gonna release\n(I'm under pressure homie, so much pressure on me)\nAnd my homies on my back\nAbout me helping them get up off them streets\n(I mean what the fuck?)\n\n[Hook: Justus & (BJ The Chicago Kid)]\nAnd it all falls back on me\n(I said it all falls down)\nSometimes, somehow, it all falls back on me\n(Somehow it always fall back on me)\nNo matter where we are, no matter what we doing, it's on me\n(No matter where we are it's on me)\nIf it was up to you that's just the way it's always gon' be\n(Listen to me)\n\n[Verse 1: Dr. Dre]\nIt's kind of funny how they fall back on me\nI used to never get a call back, homie\nBefore the money they didn't see me\nLike it's dark and it's all black, homie\nBut now they switching cause the card black, homie\nIt wasn't always that way, we was recording on the 4-track, homie\nNew apartment, no fridge, no mattress, no table, no cable\nAnd all I hear is my girl in my ear\nAnd this nigga Eazy asking for his car back, homie\nI would've never saw this happening from that far back, homie\nWhat it came to be, would have never believed\nLiving the life I lived in C-P-T\nA motherfucking dream to reality is what you call that, homie\nYeah, it was something to me\nNo eat, no sleep, wasn't nothing to me\nCan't always be how you want it to be\nAnd I'm the one that they looking up to\nFuck they expecting from me?\n\n[Hook: Justus & (BJ The Chicago Kid)]\nAnd it all falls back on me\n(I said it all falls down)\nSometimes, somehow, it all falls back on me\n(Somehow it always fall back on me)\nNo matter where we are, no matter what we doing, it's on me\n(No matter where we are it's on me)\nIf it was up to you that's just the way it's always gon' be\n(Listen to me)\n\n[Verse 2: Dr. Dre]\nThat's just the way it is, and how it always was\nDJing parties in my neighborhood just for the love\nDope dealers overtipping and bitches stripping\nAnd any minute niggas'll start tripping and start shooting shit\nOn any given day I'm like \"what the fuck?\"\nFace down on the pavement with the billy clubs\nTook that feeling to the studio and cued it up\nAnd now it's \"Fuck the Police\" all up in the club\nNow it's '91 and Snoop Dogg came to visit and was like\n\"What up cuz? Let me show you what this chronic like\"\nCouldn't help myself, just had to dip into that chronic life\nAnd then that night came in when that nigga Knight came in\n(Woo!) This one of those dreams you don't wake up from\nThen again, you don't sleep if you come from where I come from\nWhere the sun shines and they bust nines, no 9 plus 1-1\nWhen they run up on your school bus with a tool tucked\nYou might learn something\n\n[Hook: Justus & (BJ The Chicago Kid)]\nAnd it all falls back on me\nSomehow, it all falls back on me\nNo matter where we are, no matter what we doing, it's on me\nIf it was up to you that's just the way it's always gon' be", "image": "https://images.genius.com/19804ba7a9b6ceb36d0158950514927a.1000x1000x1.jpg"}], "artist": "Dr. Dre"}