{"songs": [{"title": "Tomorrow", "album": "Finally Famous Vol. 2: UKNOWBIGSEAN", "year": "2009-09-07", "lyrics": "[Intro]\nG.O.O.D Music in this bitch\n\n[Verse 1]\nMan I was up early in the A.M., legs will be achin'\nFeet will be achin' from dreams I was chasin'\nWas always told \"you won't see nathan just waitin'\"\nLike them hatin' ass niggas that just sit around hatin'\nPussy ass niggas they shoud sit around thinkin'\nWalk around in aprons bitchin' and bakin'\nI'm sayin my city like \"we need another hero\"\nI'm tired of playin' the background like Tito\nJackass niggas, remind me of Steve-o\nI put em in their place so I remind them of debo\nAy did you see that award show where I got my close\nUp? Its all good I got it on Tivo\n'Ye called me and my mama said \"I think its time to sign\"\nGot signed 'round the time Common said \"its for the people\"\nI'm tryna make it better for mines without a kilo\nMade it out the D, boy and he ain't a d-boy\nNo, and he ain't a d-boy\nMan these other niggas decoys\n\n[Verse 2]\nNow mama I done grown up too much for you to try to have me babied\nAnd lately, I realized that I was needin' a lady\nWe eatin' bout to have a perfect season I'll be damned\nIf I get Randy Moss and Tom Brady-ed\nI made a little change I can't truly complain\nDatin' with a chick that got beauty and brains\nBut when them bitches come around talkin' bout sex\nShe gone say that I'm a dog, well all dogs go to heaven\nMy grandma used to talk about how college was so needed\nSigned for a half a mill, now she like \"who need a degree?\"\nAt our family gatherings like \"who need a CD?\"\nEverybody hands out like I said \"who need a freebie?\"\nMan what's up? label said \"he next up\"\nPeople said \"he next up\" man let's get it pressed up\nI'm glad I never listened to y'all and let up\nStuck to my roots, call me Questlove\nCall the radio and they gonna request us\nSo I'm headed to the bank cause I'm finna check up\nHa ha ha, ha ha ha, (?) blase blah I'll prolly buy that tomorrow\nFor real, I'll prolly buy that tomorrow\nNaw for real, I'll prolly buy that tomorrow", "image": "https://images.genius.com/35094fe912ce98af36fb55bca8412d23.500x500x1.jpg"}], "artist": "Big Sean"}