{"songs": [{"title": "Living", "album": "B.O.A.T.S. II #METIME", "year": "2013-09-09", "lyrics": "[Verse 1: 2 Chainz]\nGood head get your rent paid\nThen I cut a corner like a switch blade\nBitch made nigga talking shit 'bout me\nGot a red car so I bought a red bottom\nChillin' at the game sitting courtside\nYou looking at the flyest nigga on the boat ride\nLow life, I'm a multi nigga fo' life\nOh my, had it up to here like a bow tie\nCut it out, sold drugs out my momma's house\nSo for mothers' day, I bought my mom a house\nChillin' in the club standing on the couch\nNigga, fuck yo couch, nigga, nigga, fuck yo' couch!\nShoes cost more than that shit anyway\nAny day, when the semi spray, bet it penetrate\nBrrraaatt, better duck, nigga!\nGot a lake in my yard filled with dope, nigga!\n\n[Hook: 2 Chainz]\nI'm just livin' baby, and you got that right\nI'm just livin' baby, I'mma enjoy this night\nI'm just livin' baby, I'm just livin'\nI'm just livin' baby, I'm just livin'\n\n[Verse 2: 2 Chainz]\nMotherfuck the other side, (motherfuck the other side)\nMotherfuck the other side, (motherfuck the other side)\nEverything official, my pistol's dismissin' missiles\nAs far as running game, my nigga, I need a whistle\nMy nigga, I need your sister, oops, I don't think that came out\nStill fuck a girl with my chain out\nStill do my thing with my thing out\nLong ass clip, I could shoot you without aiming\nMy life, your motherfuckin' entertainment\nDangerous, leave you with the angels\nShoot yo' ass from all types of angles, explain this\nWell, it was just bunch of niggas and then just me\nThey came close and it just skeet\nThey tried to run and I said \"Come back\"\nIf you think you're alone then there Bobby Womack\nHold that, ridin' that Phantom down Old Nat\nNigga said \"What up, pimp? Where the hoes at?\"\n\n[Hook: 2 Chainz]\nI'm just livin' baby, and you got that right\nI'm just livin' baby, I'mma enjoy this night\nI'm just livin' baby, I'm just livin'\nI'm just livin' baby, I'm just livin'\n\n[Verse 3: IamSu!]\nRide around on my side of town\nYou might fuck around and get peeled\nI rock Mookee, rock Y3, got Bathing Apes on my heels\nNigga, this ain't no game, there ain't no competition\nI knew he was a fake, got good intuition\n23 and I'm still livin'\nBeen all around the world and it's still Richmond\nCause I'm loyal to my soil, good to my hood like oil\nGot me in that water, bet it boil\nBitch, I'm a boy, beat the beat up like Roy\nConsider your bitch my employ', real to the core\nStraight up, I never been fraud, and I put that on my lord\nY'all rap 'bout clothes that you cannot afford\nWhere's the Versace and where's the Tom Ford?\nEverything we rap 'bout, that shit be ours\nThis bitch a freak, she should get the award, aye\n\n[Hook: 2 Chainz]\nI'm just livin' baby, and you got that right\nI'm just livin' baby, I'mma enjoy this night\nI'm just livin' baby, I'm just livin'\nI'm just livin' baby, I'm just livin'", "image": "https://s3.amazonaws.com/rapgenius/UMG_cvrart_00602537507474_01_RGB72_1500x1500_13UAAIM70647.1200x1200-75.jpg"}], "artist": "2 Chainz"}