{"songs": [{"title": "Trina Moe", "album": "The Great Depression", "year": "2001-10-23", "lyrics": "[Hook]\nAyo! Bounce to that Trina Moe\nNiggas about to blow\nBouncin' straight out the door\nHere we go, here we go\n\n[Verse 1]\nBloodline, scratch all day, match all weight\nOnly dogs eating is us, we snatch all plates\nErr, ERR! ERR! Get him, boy!\nClick, click, pop the leash, hit him, boy!\nNiggas brag about waggin', we stop the tails\nX drop an album, niggas droppin' sales\nNiggas can't fuck with the dog, forget about it\nMoney went up against the dog, read about it\nMan, listen, you cats better walk easy\nI'm on some positive shit, but I still walk greasy\nAin't nothing changed, still ain't sweet\nStand on one block, but I own the whole street\nAnd on the whole street is dirty niggas with funny moves\nLeaving your house with bloody boots, we cruddy dudes\nRest of them ass kissers is sensitive ass niggas\nFourth album, and I still get in that ass, nigga\n\n[Hook]\n\n[Verse 2]\nIt's Dark and Hell is Hot\nFlesh of my Flesh, Blood of my Blood; And Then There Was X\nGot niggas like, \"What's next and then?\"\nHit 'em again, you cats ain't never gon' win\nI was here before most of y'all careers were born\nI'll be here when y'all careers are gone, still strong\nDifference between right and wrong is me\nNiggas talk shit, but you can't MC\nWe already know how much your watch is worth\nTalk about helping the hurt, saving the Church\nWhy don't you brag about helping out where you come from?\nAnd give brothers a job that really want one?\nGotta think about that shit you said, you don't mean it\nI done listened to that shit you said, but I done seen it\nMost of you cats is type funny\nBut when it comes time to feed the hungry, gon' get type ugly\n\n[Hook]\n\n[Verse 3]\nMan, I'm already knowin', like y'all niggas is knowin'\nYou can't fuck with dog, bust a cap, scrap or flowin'\nSeeing is believing, and well, let's just see\nI ain't even gon' speak, one million the first week\nAight, let's ask the streets: How many sold?\nWhat? Three niggas, three months to go gold?\nC'mon, ese, keep it real, homes\nYou fuckin' with the dog, you already know\nThis ain't nothing new, fuck is you mad at?\n15 million! Nah, nah, nah, nah, nah\nRest assured, I'm best abroad\nYou can test Billboard because the rest are frauds\nI got 18 years under my belt, rappin'\nLet me see, you was three, I was making it happen\nNext time we bump heads, don't be hard headed\nShow some motherfuckin' respect, bitch, or you'll all get it\n\n[Hook]", "image": "https://images.genius.com/afd6872a63df0f464c2e3cf8eb96a627.500x500x1.jpg"}], "artist": "DMX"}