{"songs": [{"title": "Betta Stay Up In Your House", "album": "Genesis", "year": "2001-11-27", "lyrics": "[Intro: Busta Rhymes (Curtis Mayfield)]\nYea, I know it's kinda cold outside\nBring your nasty ass inside\nPlay yourself a dark corner motherfucker, yea\n(Eddie you should know better\nBrother, you know you're wrong)\n\n[Verse 1: Busta Rhymes (Rah Digga)]\nCome on, can't stop, won't stop, rockin' for you niggas\nCause I rep the street like Johnnie Cochran for you niggas\nAnd I, got a state gun cockin' for you niggas\n(twenty-one) legal (gun) shots (poppin' for you niggas\nAnd I, blow tones, more force than cyclones\nShit is on everytime I catch a Ron Jones\nThug bitch, rock boots and hoops with rhinestones)\nGot the (key) to the (city and) run the crime zone\nNow come on, take something, shake something, break something\nStop, close your shop, you niggas ain't sayin' nothin'\nNiggas be frontin' and knowin' they ain't really weighin' nothin'\nBetta (stop) 'fore we (pop) and really (get to sprayin' something)\nFlood it up (whip it up) smoke it up (blooded up\nNiggas straight tryin' to brake, I tell 'em shut it up\nI spit the ill for real, ain't nothin' buttered up)\nFlipmode (doin' it) everybody (love it up)\n\n[Hook]\nEast coast, what up? West coast, what up?\nMidwest, what up? Dirty South, what up?\nAll my chickenheads, put it in your mouth\nIt's Flipmode, better stay up in your house\nAll my thugs, what up? Thug bitches, what up?\nStreet niggas, what up? Stack riches, no doubt\nWe got the block locked take another route\nIt's Flipmode, better stay up in your house\nMy niggas HOOK\n\n[Verse 2: Busta Rhymes (Rah Digga)]\n(Dirtiest, wordiest, Jersey it's\nWetter than a mile, I stalk like pedophiles\nNobody gets saved when I bless the child\nGettin') eight (like) snapper (you too fessed to vow)\nHold up (run on) get up (come on)\nAhhooo! And put every single nigga where I'm from on\n(Bitches) all in the (spot) go head (and get your) fun on\n(Niggas keepin' it) movin' (go head) and get your (thug on)\nWhat on (earth possesed y'all to try a lil')\nDrunk (lil') high (Big heads in the sky\nMake) niggas (straight) cry (without Mo' and Dry\nTake it down) homeboy (got bigger fish to fry\nFuck that) other nigga (Rush that) sucker nigga\nNiggas love the way we sound up on another Digga\n(Hot D) but I got another younger brother bigger\n(Digga) pass me the Henny so I can take another swigger\n\n(Chorus)\n\n[Verse 3: Busta Rhymes (Rah Digga)]\n(Switch it up like Ak-Nel while you hit a dry spell\nCats like you get no reply on the Skytel)\nHate y'all (raps like Eminem hate Britney)\nBonafide (MC) who (fuckin' with me?)\nTop niggas better give props nigga\n('Fore you get dropped) fuck around and get your shit popped nigga\nFlip-flop niggas, you could (really get your shit mopped)\nOr left to lay up in a pit stop nigga\n(Spillin' it) feelin' it (killin' it) come on!\n(The hardest MC don't want flex no more)\nMake it hot (everytime I rock, rest assured\nShit'll have that) who could rock (the raw best award, nigga)\nLook it up (cook it up) shook it up (book it up)\nWhen we (rock) you shouldn't watch (promoters) nook it up\n(Raise the level a little) you know (my niggas) took it up\n(In and outta big) figgas while me and (Digga) cook it up\n\n[Hook]", "image": "https://images.genius.com/4102489ca8934c81cdf553b85cec18fd.1000x1000x1.jpg"}], "artist": "Busta Rhymes"}