{"songs": [{"title": "Firebreather", "album": "GEMINI", "year": "2017-09-22", "lyrics": "[Intro: Macklemore]\nGot a Guns N' Roses T-shirt, and never listened to the band\nJust being honest, I just thought that shit looked cool\nHold up, do you know who I am?\n\n[Verse 1: Macklemore]\nTurn the block to Woodstock\nRetire? Don't think that I could stop\nJet-ski the way I ride the beat\nAnd fuck your wave, I'ma die knowing that I did me\nI got some words and I cannot let them die in me\nThis is arena status\nOur bones end up in the ground, does it even matter?\nMake some good music, get what you put in\nGet out and go and leave the planet\nNow what the hell did you think this is?\nWe're born, we're dying, in-between we live\nLove, prosper, hands to the sky, catch a gospel\nRoll the dice, nah, I ain't betting on tomorrow\nChain looking like Orion's Belt\nJacket looking something like a lion pelt\nHad to take a break and find myself\nThey put me in a box by myself\nThe same writers criticizing my rhymes\nAre the same writers that gentrifyin' Bed-Stuy\nI can't even see the hate, I should probably check my eyes\nI got 50,000 phones pointed at me in the sky\n\n[Pre-Chorus: Reignwolf]\nBetween a rock and a hard place\nCold blunted with a stone face\nFirebreather, firebreather\nBorn under a blood moon\nBut the sun is coming up soon\nFirebreather, firebreather\n\n[Chorus: Reignwolf]\nFire, fire, fire, fire, fire\nFirebreather, firebreather\nFire, fire, fire, fire, fire\nFirebreather, yeah, firebreather\n\n[Verse 2: Macklemore]\nWhat the fuck you think I'm doing it for?\nHungry like it's my rookie year, and I'm new to the sport\nThe game is tied up, they looking at you in the fourth\nDo you take the shot or pass it, this is ten-thousand hours\nAnd I'm working on my Master's, liabilities, and assets\nAnd I'm showing up to practice, shooting early, getting baskets\nThere's no father to my style, I'm just a freckle-faced bastard\nAn animal in the jungle, running, hunting with a habit (woo)\nAbracadabra that motherfucker is magic\nIt's '81 and Madonna is on me dancing\nI'm sorry momma, I got it, I know I should mind my manners\nI'd probably go double-platinum if I could think of an ad-lib\nI'm jazz Prince, I rap a lot\nI grew up on Scarface, now Brad's my dawg (woo)\nIrish goodbye, sayonara and we mobbin'\nPut the nail in the coffin, motherfucker, I'm on one\n\n[Pre-Chorus: Reignwolf]\nBetween a rock and a hard place\nCold blunted with a stone face\nFirebreather, firebreather\nBorn under a blood moon\nBut the sun is coming up soon\nFirebreather, firebreather\n\n[Chorus: Reignwolf]\nFire, fire, fire, fire, fire\nFirebreather, firebreather\nFire, fire, fire, fire, fire\nFirebreather, yeah, firebreather", "image": "https://images.genius.com/5ea668c903da567bb7c9de7dda4c7b81.1000x1000x1.jpg"}], "artist": "Macklemore"}