{"songs": [{"title": "Hell of a Life", "album": "My Beautiful Dark Twisted Fantasy", "year": "2010-11-22", "lyrics": "[Produced by Kanye West; Co-Produced by Mike Caren, Mike Dean & No I.D.]\n\n[Verse 1]\nI think I just fell in love with a porn star\nTurn the camera on, she a born star\nTurn the corners in a foreign car\nCall the coroners, do the CPR\nShe gave that old nigga a ulcer\nHer bittersweet taste made his gold teeth ache, uh\nMake her knees shake, make a priest faint, uh\nMake a nun cum, make her cremate, uh\nMove downtown, cop a sweet space, uh\nLivin’ life like we won the sweepstakes, what\nWe headed to hell for heaven’s sakes, huh\nWell I’mma levitate, make the devil wait, yeah!\n\n[Chorus]\nHave you lost your mind?\nTell me when you think we crossed the line\nNo more drugs for me, pussy and religion is all I need\nGrab my hand and baby we’ll live a hell of a life\n\n[Verse 2]\nNever in your wildest dreams\nNever in your wildest dreams, in your wildest\nYou could hear the loudest screams\nComin’ from inside the screen, you a wild bitch\nTell me what I gotta do to be that guy\nSaid her price go down, she ever fuck a black guy\nOr do anal, or do a gangbang\nIt’s kinda crazy that’s all considered the same thing\nWell I guess a lotta niggas do gang bang\nAnd if we run trains, we all in the same gang\nRunaway slaves all on a chain gang\nBang, bang, bang, bang, bang\n\n[Chorus]\nHave you lost your mind?\nTell me when you think we crossed the line\nNo more drugs for me, pussy and religion is all I need\nGrab my hand and baby we’ll live a hell of a life\n\n[Verse 3]\nOne day I’m gon' marry a porn star\nWe’ll have a big-ass crib and a long yard\nWe’ll have a mansion and some fly maids\nNothin’ to hide, we both screwed the bridesmaids\nShe wanna role play, 'til I roll over\nI’mma need a whole day, at least rolled doja\nWhat party is we goin’ to on Oscar day\n'specially if she can’t get that dress from Oscar de\nLa Renta, they wouldn’t rent her, they couldn’t take the shame\nSnatched the dress off her back and told her, “Get away”\nHow could you say they live they life wrong?\nWhen you never fuck with the lights on\n\n[Bridge]\nFuck with the lights\nFuck with the- with the lights on\nFuck with the lights\nFuck with the- with the lights on\nFuck with the lights on\nWith the- with the lights on\nFuck with the lights\nFuck with the- with the lights on\nFuck- Fuck with the lights\nFuck with the- with the lights on\nFuck with the lights\nFuck with the- with the lights on\n\n[Chorus]\nHave you lost your mind?\nTell me when you think we crossed the line\nNo more drugs for me, pussy and religion is all I need\nGrab my hand and baby we’ll live a hell of a life\n\n[Outro]\nI think I fell in love with a porn star\nAnd got married in a bathroom\nHoneymoon on the dance floor\nAnd got divorced by the end of the night\nThat’s one hell of a life\n\n(Mmm, mmm, mmm)", "image": "https://images.genius.com/5e511a0def0666b6a0786c359b1888ce.500x500x1.png"}], "artist": "Kanye West"}