{"songs": [{"title": "What Kinda King? (I Smell Pussy) (T.I. Diss)", "album": null, "year": null, "lyrics": "Yeaaaahhhhh, pussy, ok it's a war right now\nPussy, I know you a pussy though\nFake ass nigga, snack cake ass nigga\nNigga it's Gucci nigga, you know how I rock nigga\nYou know this shit real over here nigga\nStupid diamonds nigga, that's all I talk about nigga\nWe So Icey, pussy, pussy, pussy, pussy, pussy\nNigga you a pussy, aww man, nigga pussy shawty\n(East Atlanta stand up nigga)\n\n[Verse 1:]\nWhat kinda king do a birthday bash in the middle of the summer with some fucking leather pants?\nWhat kinda nigga skeet in a slut bitch that every rapper hit, suck everybody dick?\nWhat kinda king try to spark up beef then apologize for it on national T.V.?\nIt's the best homeboy trynna be so hard\nI'm a grown ass man you a lil bitty boy\nWhat street nigga wear a three piece suit with cuff-links, ties and double back shoes?\nSay it ain't so, nah say it ain't you\nBitch nigga I be on Bankhead more than you do\nI'm a East Atlanta hard head respect my crew\nAnd respect my grind bitch we gotta eat too\nSay you gotta click of fools, all my goons well paid\nI'm a So Icey boss, all the soldiers well trained\n\n[Interlude]\nIt's Gucci nigga!!\nWhat it do?\nEast Atlanta, that's round 1 baby\nI got you, I got this lightweight man\nFeatherweight ass nigga man\nFuck wrong with this nigga?\nLil pussy ass boy, you a pussy nigga\nPussy ass\n\n[Verse 2:]\nWhat kinda nigga post a hundred thousand bail\nSame day his album drop, man they let him out his cell\nWhat kinda nigga don't need no deal\nNo money no cars just to show he real\nWhat kinda nigga is you, you lil lizard lip\nLil junior aka the monkey in the middle\nTIP tell TI to step it up a little\nCause the boy too little and his bones to brittle\nBiaatch! say it just like Short\nNapoleon complex cause he so short\nGotta pot gotta fork got some back up in New York\nI'm a So Icey judge pussy let's hold court\n\n[Interlude]\nYeaaaaahhhh\nBleh bleh bleh bleh\nThrow up on the track on this pussy nigga\nAwww man, you get stupid on that one\nReal stupid on that one Waka\n...\n\n[Verse 3:]\nThe king wanna battle me, pussy wanna handle me\nSchizophrenic child with a split personality\nTI will you please tell TIP, I got a new 40 with a 30 round clip\nWhen I see him and he move I'm a shot him off the rip\nTrynna spark rap beef that's how people get killed\nGucci bigger than him, the fight not fair\nWe can start it over here, but we can end it over there\nI'm in Magic City shawty see me swang in the chair\nYeahhh, it's Gucci Mane La Flare\nUp in Magic City shawty see me swag in the chair\nYeahhh, it's some pussies over there\nGucci\n\n[Outro]\nYeaaahhhh pussy, pussy, snack cake, snack cake\nDeer meat, deer meat, sweet ass nigga\nYou're like motherfucking deer meat, nigga you sweet nigga\nBetter yet you're like bear meat, cause you're not tough nigga\nGet a little, little little fork, little knife cut this little beef up\nEat this little beef\nGucci", "image": "https://images.genius.com/6f0a4980c8ef838036229e1d4dcd036c.408x408x1.jpg"}], "artist": "Gucci Mane"}