{"songs": [{"title": "Superstar (Deal or No Deal)", "album": "Deal or No Deal", "year": "2009-11-24", "lyrics": "[Hook]\nYou can be my superstar\nWe can do anything you want\nWhoo-ooowhooo\n\n[Intro]\nTaylor Gang, Paper Planes\nDon't forget the Champagne\n\nLamborghini wangs too, oh yeah\n\nCome on and fly with your boy\nYou look like, um\nJust what I like\nYeah\n\n[Verse 1]\nYeah, what say you my dear\nWe drink get drunk go straight to the crib\nGot a thing for Ms. Thang over there\nThem yellow diamonds lead straight to the Wiz\nEntrepreneur, got straight to the biz\nJumped in my car, spaceship that is\nAnd we fly out, them expensive things that we try out\nMost lie about\nYou got me like Ne-Yo gone girl\nDo your own thing, I can see in your own world\nGot my homeboy spring cleanin' your homegirl\nAnd shawty we gonna do this shit right\nI'm tryna find a bottle of anything that you like\nTo wait I got no time I'm trying to take you tonight\nAnd if you wanna roll, then maybe we can go\nI ain't showing off this is really my life, yeah\n\n[Hook]\nLeave with us never be the same, you reppin' with the planes\n[Hook]\n\nHahahaha. Yeah bitch! Uh! Haha\nYeah, bottles going off and I ain't concerned with how much it's gonna cost me\nI'm-a drink it straight probably order you a long beach\nWaiter bring the drinks I'm-a roll some of this bomb weed\nSomewhere in outer space or somewhere under a palm, tree\nThe flyest thing you ever been on, me\nAnd them other niggas claim to be the planes\nBut how they leave them land when they're on, E\nNo fuel, though my swag is sicker than no cure\nMaybe it's all the alcohol making me so sure\nDamn, baby we cop the brochure we gon' shop at those stores\nPresidential panel, on top of those floors\nSay you got fans I got lots of homeboys\nAnd they love to smoke and chill like I do\nSo come to my hotel bring your friends and they can get high too\nAnd\n\n[Hook]\nHahaha, yeah, bitch!\nLeave with us never be the same, you reppin' with the planes\n[Hook]", "image": "https://images.genius.com/de1b97b5d4f1bea5ffcaf6e7b4dfcd09.320x320x1.jpg"}], "artist": "Wiz Khalifa"}