{"songs": [{"title": "Topless", "album": "Straight from the Lab Part 2", "year": null, "lyrics": "[Verse 1: Eminem as Dr. Dre]\nMy motto is live by the bottle\nSo why is my supply low, bring in a truckload with a high-low\nStay grounded but I still reach for the sky though\nGhetto idol I think, but what do I know\nShit I know a lot more than I should\nThe hood stood by me just like I thought it would\nDont act like I'm Hollywood when I probably could\nI don't polly, Mohammed Ali of rap, I don't lolly gag\nWest Coast, the home of the body-bag\nThe shotty, the Mag Los Angeles, where the party at\nYou can catch me anywhere where there's Bacardi at\nYeah, Andre is back so have a cardiac\nStarted back with the black Raiders starter cap\nGangsta rap, we practically fuckin' started that\nEveryday with this game I'm gettin' smarter at\nSky's the limit so everytime I get on a track\n\n[Hook: Dr. Dre]\nGuns blaze when I shine\nNigga wish quick, no startin' I'm the shootin' kind\nFront page all the time\nYou boys think sick but I ain't got no roof on mine\nI drink topless, I live topless\nLike my girl is the game with her titties out\nI drink topless, I live topless\nSky’s the limit I’m paid to run the city now\n\n[Verse 2: Nas]\nYour skin's your travelin' bag of your existence\nYours is shabby and scab while mines glistenin'\nVivid on my skin how many continents I’ve visit then\nYou could journey with me to different places by listenin'\nShittin' on 'em, ya brother got it covered\nWe can slug it, knuckle it however you want I love it\nA hustler's wit, the grit the grind\nMy genetic code make-up, murderer by design\nOn mayan calendar time when night meets day\nI’m in a light grey Bugatti like a high-speed chase\nAdrenaline like jogger the jump in rope in place\nThe Muhammad Ali hobbies no pilates tryna keep the ocean by me\nHit a rich man’s wife see what these hoes can buy me\nLookin' forward but it’s nice to see the road behind me\nHotel’s a seven star, baguette's glowin'\nKeep your lid yet dawg the private jet boeing topless\n\n[Hook]", "image": "https://images.genius.com/92a4caddb38548f811a9d5b5599e4304.1000x1000x1.png"}], "artist": "Dr. Dre"}