{"songs": [{"title": "D.I.G. (Dipped in Gold)", "album": "Trap House III", "year": "2013-05-21", "lyrics": "[Verse 1]\nShe dripping in gold she dripped in gold she water whipping\nDipped in gold, she clean the kitchen, damn she a good mathematician\nJust to put her clothes on, probably her 20 minutes\nJust to put that gold on, probably take like 40 minutes\nGold car, gold Bentley, and she got a gold beautician\nYou know Guwop feed his baby, treat her like a pediatrician\nDrop top Benz it beat the street, my gold teeth match her diamond necklace\nDrumma Boy I killed the beat and it didn't take me 30 seconds\nGold teeth match her diamond necklace, you know Bricksquad hella flexin\n1017 be super keyed, drug test, man, we never passin\nGucci Mane wear yellow gold and rose gold he hella clashin'\nTold my mama \"I can't go to school, that's not my fucking passion\"\n\n[Hook]\nShe D.I.G she dipped in gold, you dig that ?\nYeah you know she dipped in gold\nShe D.I.G. she dipped in gold, you dig that ?\nMan I swear her body cold\nShe D.I.G. she dipped in gold, you dig that ?\nMan I got her dripping in gold\nShe D.I.G. She D.I.G. you dig that ?\nShe dripping gold, she dripping gold, she dipped in gold\n\n[Verse 2]\nMy raps they just be so offensive\nPlease just stay out Gucci's business\nDrumma Boy you too explicit\nBig Guwop I'm so prolific\nI just got like 30 gold\nBitch, I just came from the dentist\nHella trippin, hella whippin, drop my top, my rims they spinnin\n??????? no you ain't\nSay ya love me, no you don't\nHit the blunt I wish I would\nBitch you can't even hit the trunk\nDrop top Rari riding through Bleveland paint our cars red every month\nCan you handle what you will see? cause this right here ain't what you want\nNo, ain't what you want\nNo you're not and no you can't\nPark my jeep jump in my dump it's big dog Gucci but I won't run\nDip my blunt in gold, man, now I got a golden blunt\nSippin on some golden lean this activist it keeps me slumped (Wasted!)\n\n[Hook]\nShe D.I.G she dipped in gold, you dig that ?\nYeah you know she dipped in gold\nShe D.I.G. she dipped in gold, you dig that ?\nMan I swear her body cold\nShe D.I.G. she dipped in gold, you dig that ?\nMan I got her dripping in gold\nShe D.I.G. She D.I.G. you dig that ?\nShe dripping gold, she dripping gold, she dipped in gold\n\n[Verse 3]\nShe work out man, she doing crunch\nI'm goin to hit her once a month\nI'm goin let her hit the blunt\nShe refused to give a son (what?)\nAll these thiyow on my dick, man I got to give em one\nI just came from show Ohio they gave me like half a hundred\nI feel like the old pimp C man I think I should team Bun\nI should sign with BMG cause I just moved a metric ton\nI should sign with BSM cause man I used to hang with Dunk\nNPA 1017 bet 10,000 dollars playing ???\nBricksquad like NWA, Drumma Boy he Dr. Dre (easy)\nGucci Mane I'm sure glad I know gunfight I ain't got nothin to say\nOld Gucci I'm gettin this trey I duwop man I need a drink\nNew Gucci it's big Guwop I'm paintin my cars I got a scrape!\n\n[Hook]\nShe D.I.G she dipped in gold, you dig that ?\nYeah you know she dipped in gold\nShe D.I.G. she dipped in gold, you dig that ?\nMan I swear her body cold\nShe D.I.G. she dipped in gold, you dig that ?\nMan I got her dripping in gold\nShe D.I.G. She D.I.G. you dig that ?\nShe dripping gold, she dripping gold, she dipped in gold", "image": "https://images.genius.com/2d6a6af130abeb84aebd2824e7c3ef8a.500x500x1.jpg"}], "artist": "Gucci Mane"}