{"songs": [{"title": "Church (The Unplanned Mixtape)", "album": "The Unplanned Mixtape", "year": null, "lyrics": "[Jim Valvano speech at the 1993 ESPY Awards]\n\"Time, time is very precious to me. I don't know how much I have left and I have some things I would like to say. Hopefully at the end I'll have something that will be important to other people too.\"\n\n[Geologic]\nStand up, sit down, stand up again\nMorse Code sent to God, are you listening?\nHe must have been too busy fixing other shit\nNo call, no response shows the opposite\nWe confess to the man who was faceless\nI still do the same but to thousands of strangers\nWent through some changes, some said I'm faithless\nCause I replaced the altar with a basement\nI often fought the explanation of where people go when their bodies let go of the soul\nDoes it just turn cold?\nOr do we get judged and told where to go?\nAnd if so, how the fuck would you know if nobody came back and said I'm telling you, bro?\nI could never get past the shit that was spit out the pastor's lips\nAnd the rapper's started making more sense\nI guess that's the reason that some people cringe when they kids get a hold of my shit\nIf the grip of a God is insistent on not questioning if he truly exists\nNo wonder that I got caught up in the music it filled my spirit to the brim, amen\nMotha' fucker\n\n[Macklemore]\nThis is my offering card\nThe only thing I have to offer is bars\nThe only time I felt like I was talking to God\nWas in my Walkman walking with Nas\nAlright see I be going to Sunday school every week\nIn the back trying to read, but see that something was off\nMaybe it was cause I was trying to huddle in the yard\nPreacher didn't connect when he would mumble the Psalms\nI was in my head and I was bustin' with Pac\nTakin' off my wifebeater and getting drunk in the park\nAfter that part, I found God, it wasn't Jesus\nSome psilocybin and the ink it released\nI began to hold communion every time my music came out the speakers I used it\nAnd it fuled my movement I believed in, voice of reason, just me and my Adidas\nAnd I could achieve it, I put my hand over my heart, pledge allegiance\nI solemnly swear by the faith that raised my since Kool Herc dropped that needle\nThe South Bronx, that's hip-hop's Egypt\nThe word of our God is manipulated and twisted by the same system\nThat is infiltrated and falsely interpreted Jesus\nOne life, one love, one God, It's us, treat your neighbor how you would want to be treated\nThe universal laws of God, don't look too far it's right here, us human beings\nThe spirits right here and I don't have to see it\nNow every time I want to connect with God I put my headphones on\nThen I nod, grab my pen, my pad, let it seep in, in\nAnd that's my process\nAnd God's always watching\nGot God in my Walkman\nGo ahead and top that", "image": "https://images.genius.com/271e7551d2ccbead25e01c36162352d0.900x900x1.jpg"}], "artist": "Macklemore"}