{"songs": [{"title": "Interlude", "album": null, "year": null, "lyrics": "I wake up every morning, kiss my wife goodbye\nHug my kids, tell em I love em, my mouth, hit the fried\nI'm out on patrol, in my squad car, do I lay\nWhere you never know, if you'll be makin it home today\nSo many different attitudes, that I come across\nI'm hard to console tonight, feeling nobody's lost\nHookers hustlers killers and thieves, out on the streets\nGot my mind warped, just found another corpse on the beat\nBound gagged raped, I'm frustrated, I hate it\nFound a woman in the dumpster, body was mutilated\nBad dreams all up in my head, no lie\nSometimes I gotta take a sniff so I can get by, why\nDon't I get hurt, cause there go my nerves, I got the urge\nTo merge this bullet in my brain, relieve my pain\nWhat a fuckin shame, I don't wanna live, I paint the wall\nWith the bloodstains, eye of the pig, I see it all\n\nThe eye of the pig\n\nDj Muggs cuts and scratches'This pig' from Pigs\n\nI've been on the force, over twenty years, I can say\nThat I'm worse, than some of these motherfuckers I put away\nI'm in the biggest gang you ever saw, above the law\nLookin through the eye of the pig, I see it all\nDrug abusers, drug dealers and the gang-bangin\nPieces of shit who should be on the fuckin news hangin\nThese days you can't tell who's-who in the world\nIs that a whore, or is that, an innocent young girl?\nFuck, I need a drink, and I'm almost off\nAt the precinct, it's like an aa meeting all gone wrong\nI. A. Got an eye, on my close friend guy\nFor takin a supply from evidence from a bust on a buy\nThat doesn't concern me, we never rat on each other\nWe went through the academy, just like frat brothers\nMidnight, I only have an hour left on my shift\nThink I'll get my dick sucked by this basshead bitch\nMy marriage is all fucked, my wife is with the neighbors\nSubpeonaed, now I gotta sign these fuckin divorce papers\nI recall, happier times, before the fall\nLook into the eye of the pig, I see it all\n\nNow I'm on my way, back to the station to check out\nSo I can go home, relax, take a drink and think about\nMy abrupt change, out of the clean, to the corrupt\nLook into the eye of the pig, I'm all fucked\nNo longer can I determine, who's the criminal\nFrom the innocent man down, to the pedophile\nNo one gives a fuck about me, I'm slippin\nInto darkness, I'm comin to grips and feelin heartless\nWatch this, a dark green truck, tinted windows\nDuly modified, probably a dope dealer inside\n\"Pull it over to the curb, take your keys out \"\nAnd raise your hands out the window and get em in high position\nDon't move, or I'm gonna blast your fuckin head off\nJust tell me where the guns and dope are and you'll get off\nDon't give me that bullshit, I've heard about your raps\nAll you talkin about is slangin and shootin off the scraps\nOk, Mr. Freeload, get the fuck out of the truck\nI love it how all you fuckin rappers think it's so funny\nHit the fuckin floor, I need no probable cause\nYou got a big sack of coke in your truck (what?) so take a pause\nYou find it funny? Get that smile off your face\nMotherfucker take this", "image": "https://images.genius.com/2615919eb0bcef9d55421080ab3b10b1.860x860x1.jpg"}], "artist": "Cypress Hill"}