{"songs": [{"title": "Strangeulation Vol. II Cypher IV", "album": "Strangeulation Vol. II", "year": "2015-11-20", "lyrics": "[Intro: Tech N9ne]\nSo you know you got to go when Tech N9ne hand you this track\nSo I call on Krizz, Rittz and Prozak, let's go!\n\n[Verse 1: Krizz Kaliko]\n(Haha, here we go again! Yeah! Hey Tech, watch this!)\nKali baby, I guess I'm back at it again\nLemme laugh at 'em again\n'Cause they know I write the back out of a pen\nHoly moly get going nobody hold 'em is what they told 'em\nAnd poda-be motor yodeling sick and ain't gettin over it\nSick at the lip and watch 'em clown, watch 'em clown, clown\nLoving to tickle 'em I be licking 'em down, give 'em the crown\nLook at the ground when you approaching the regal Beagle\nAnd people don't be equal and when they saying: it's fecal\nBetta give it up, put 'em in the blender\nSurrender it like you had enough\nNever no-contender pretending like you ready-to-buck\nNinja turtle talkin' to a splinter, I don't give a fuck\nAh-ha, it goes up\nKillin niggas like they coppers\nAnd rappers on my thing-a-ma-bobber\nCome to chopping I'm the home of the whopper\nYour girly bopping I don't think I can stop her\nSo dope that it made her wanna gimme a slobber\nThey remember you when you stop and you pop\nEvery syllable, bow down to a nigga that's bigger than you\nAnd he thinking he can come and speak at him really rude\nAh-ha, eat the nigga food\nI'll knock the stuffing out ya muffin, fucking knucklehead\nNever did it wrong 'cause you singing the song all in your head\nLead off, I beat the beat up and go\nRun a nigga feet off and chew 'em like a piece of pilaf\nShitting on niggas an leave the seat off, then re-tweet off\nSocial media this to beat off to\nDamn, they think we lost 'cause when we get off a look at themselves saying we awful\n'Cause it's more than bread that we wanting\nMe and Nina keeping 'em jumping\nAnd we won't stop 'till we get to the top\nYou in the way then we Midwest chop ya!\n\n[Verse 2: Rittz]\nShit, never could do right in school, I just choose to cruise by\nThe principal told me I'm a loser, the dude’s right\nAll I did as a kid was shoot dice and toot white\nCausing disputes, my future was never too bright\nBut who would’ve knew I’d be lucky enough to get a record deal\nAnd pursue my music? I’m too psyched, not once, but two times\nI murder shit, a repeat offender with the biggest independent, salute N9ne\nIf they bussin' I'mma take this rappin' shit to a new height\nToo tight like Drake's bike jacket, my crew like\nA pack of wild wolves, 'bout to howl at the moonlight\nYou wanna come at us? God bless, Gesundheit\nYou a pussy, you might lose a fight with a bull dyke\nAnd I already give you a fuse strike, a few of mine\nKinda swole with this now your face is basically a bullseye\nAnd you like ooh-ah!\nAnd I ain't quitting 'til I got a crib in Malibu, sitting poolside\nI'm chilling, sipping Crown a coke bag\nI say what I'm thinking, never been known to hold back\nI'm pimpin' 'em steadily, putting hoes on Prozac\nBlow got me looking like my nose is snow-capped\nUnder the scopes, steady getting groped and poked at\nThen those that oppose that wanna do-si-do\nPer rope-a-dope will get you K.O.'d or toe tagged\nAt 5'10\" you can see my 'fro from rows back\nFake friends hanging on my coast below Tech\nHate the term 'no homo' but I'm sick\nOf bending over, getting fucked for the dough I don't have\nOh snap, forgot it was a chopper song\nThis is what you want to hear, I guess I better do a study how I execute it, therapeautic\nDon't compare me, some of these rappers got a bigger pussy than the Octomom\nAnd yo, ya-uh-yeah!\n\n[Verse 3: Prozak]\nThinkin' about takin' it to another level\nI'm from another realm like an angel falling from heaven\nI fell to the Earth, the purpose of resurrection\nI'm coming through your speakers like demonic possession\nAnd hell's bells, don't be afraid of mythology\nDeep inside my brain is a wicked psychology\nAncient revelation intertwined with technology\nAlien biology, you know that I gotta be Strange!\nDamn right, and I'm proud to be\nBiggest independent label, check the biography\nWe taking over the industry without an apology\nBurning all the bridges, tell me who wanna follow me\nI'm sick with the sickness and spit with the quickness, so vicious with every bar (bar)\nSo best to be leaving me lonely, psychotic and mentally scarred (scarred)\nAnd I don't really wanna be the one to tell you but I will if you don't get it by now\nOur strangers are angels, and able to seal the game, you lames better bow down (bow down)\nYou need to recognize a miracle inside the lyrical, we're killing all these shows now\nIt started from the bottom, now we got the people showing up and lining up in every town\nTakin' it to another planet and stratosphere\nCircle like a satellite on top of this atmosphere\nSnake and bat the symbol of the future, don't interfere\nYou don't really wanna be the one we make disappear\nAnd this flow is hypnotic, it's class A narcotics, you pop out the bottle\nPrescribed by psychologists, go for psychotic shit\nProzak and Kaliko, Rittz, Midwest Chopper shit\n\n[Outro: Skyler Brown & Kelsee Pietz]\nBaby, you up?\nYeah, let's do it", "image": "https://images.genius.com/d6abef8fbc863a78647f5e7bfd58bbe7.500x500x1.jpg"}], "artist": "Tech N9ne"}