{"songs": [{"title": "FV Till I Die", "album": "Pound Syndrome", "year": "2015-07-24", "lyrics": "[Hook: Hopsin]\nYa'll ain't even seen the nigga Hop coming\nThat's how I roll, dawg\nThe second niggas take they eyes off me\nI leave 'em on the side of the road, dawg\nI'm the realest, believe me\nNiggas can't see me, they'll take a life to be me\nYe-yeah, who the fuck I rep? Can you remind me\nIt's Funk Volume till I D-I-E, my nigga\n\n[Verse 1: Hopsin]\nYeah, you behind if you don't know the power (nigga)\nProduct this shit the moment Ruthless started goin' sour (what?)\nNiggas is sayin' fuck you to us, but we have spoke it louder\nNow they come to us for advice in the game, they know it's ours (true)\nCause It's so hard just to survive in this era\nWe learn from trial and error, it's hard for cowards to bare us\nThey know the style is terror, nigga we everywhere\nYeezy and Hov ain't the only niggas that's wildin' in Paris\nBack in the day, me and my nigga SwizZz was always in grind mode\nReppin' that 818 was just like walkin' that tightrope\nWe've seen rappers come and go and get lost in this cycle\nSo we had to fuckin' make sure we left all of your minds blown\nSwizZz? He told me 'bout his brother Damien sayin' that he could create a structure for us\nWe're guaranteed to make a win\nI said I'm in, let the games begin\nSo he introduced us, then after that\nWe plotted on some ways to make us trend, yeah\n\n[Hook: Hopsin]\nYa'll ain't even seen the nigga Hop coming\nThat's how I roll, dawg\nThe second niggas take they eyes off me\nI leave 'em on the side of the road, dawg\nI'm the realest, believe me\nNiggas can't see me, they'll take a life to be me\nYe-yeah, who the fuck I rep? Can you remind me\nIt's Funk Volume till I D-I-E, my nigga\n\n[Verse 2: Hopsin]\nYou see, I took a shot out of the glass of mischief\nMade an album so raw the way you just had to get it, every track explicit\nI figured those of you who was in love with rap would listen\nAnd tell your parents that it's the one gift they should grab for Christmas\nThen I blew up way faster than what I had predicted\nIt's like magic, isn't it, they love my language and graphic image\nSome people thought Ruthless put me into a bad position\nBut I over came it and outshined 'em, I'm back up in it\n2011, went on a nation wide tour\nCame back and dropped that Ill Mind 4\nThat put me in a cool place, swiped up a million views in a few days\nI celebrated inside of swimming pools sippin' Kool Aid\nI shot a video with my nigga Tech and B.o.B\nI went from feeling lonely to how does everyone know me?\n2012, I made the XXL Freshman list\nI knew that this fuckin' game was gon' be mine when I stepped in it\nCome on, man\n\n[Hook: Hopsin]\nYa'll ain't even seen the nigga Hop coming\nThat's how I roll, dawg\nThe second niggas take they eyes off me\nI leave 'em on the side of the road, dawg\nI'm the realest, believe me\nNiggas can't see me, they'll take a life to be me\nYe-yeah, who the fuck I rep? Can you remind me\nIt's Funk Volume till I D-I-E, my nigga\n\n[Verse 3: Hopsin]\nI was online chillin', bloggin' and what not (okay)\nI stumbled across this one nigga, reminded me of a young Pac (right)\nI asked Dame if he heard of Dizzy he said, \"Come on Hop\nI been bumpin' his shit before you, bruh, his songs hot.\"\nIf he had that push, then so many doors'll become unlocked\nHe said we should sign him, I said that's a long shot\nWe flew him to Denver to see our show and said you fuck with this shit?\nHe said, \"Shit nigga, yiggity yamp, I'm up in this bitch.\"\nA few months later, one of the homies had stopped me\nAsked if I had seen this raunchy, zombie filled, godly video, that's beyond beast\nI said, \"probably, I don't know, who the fuck you speakin 'bout?\"\nHe showed me Skitzo by Jarren Benton, I started freakin' out!\nI'm like, oh shit! I had to show SwizZz\nAnd Dame and they both flipped, it's a trip, this nigga's so sick!\nWe had to put him on quick and blow this nigga up\nNow we got a serious squad, the truth, it is nuts\n\n[Verse 4: SwizZz]\nYo, I took the college route to figure out my path in life\nRomp the UCI and that lead me right back behind the mic\nI tried to make my dad proud, brother got his MBA\nWhile I was wildin', takin' random classes tryna find my way\nJunior year, I had to bounce not to blindly chasin' dream\nCalculated riffs, I knew that I devised a perfect scheme\nHop was gazin' at the moonlight, I just hit the valley scene\nDame got rocked by the recession, then we formed the fuckin' team\nF-U-N-K-V-O-L-U-M-E, nigga\nSeven years into this shit, somehow we're only gettin' bigger\nAnd we're just now gonna start the shit, I've been up out the picture\nDizzy, Hop, Jarren, and Hoppa stay confident I deliver\nSo I'm grateful for the chance and the position that I'm placed\nMeet the aftermath, the aftermath, the Funk is in your face\nIndependent livin', we control every decision made\nWhat up Dame? Prepare the reign, we killin' this thing, it won't stop, bitch!\n\n[Outro: Hopsin & SwizZz]\nHaha, Zzzeed up\nDon't act like you don't know what time it is fool\nSwizZz\nDizzy motherfuckin' Wright\nJarren Benton\nDJ Hoppa\nLet's make it\n\n[Hook: Hopsin]\nYe-yeah, who the fuck I rep? Can you remind me\nIt's Funk Volume till I D-I-E, my nigga", "image": "https://images.genius.com/e4079e5e3fa49647b0a22cad37ceae57.1000x1000x1.jpg"}], "artist": "Hopsin"}