{"songs": [{"title": "The genesis - explicit album version", "album": null, "year": null, "lyrics": "NAS\n\"Get-get.. get down!\"\n\nNew York streets where killers'll walk like Pistol Pete\nAnd Pappy Mason, gave the young boys admiration\nPrince from Queens and Fritz from Harlem\nStreet legends, the drugs kept the hood from starvin'\nPushin' cars, Nicky Barnes was the 70's\nBut there's a long list of high-profile celebrities\nWorldwide on the thorough side of things\nLivest kings, some died, one guy, one time\nOne day grabs me, as I'm about to blast heat\n40-side of Vernon, I turned well he asked me\n\"What you up to, the cops goin' bust you\"\nI was a teen drunk off brew, stumbled I wondered\nIf God sent him, cause two squad cars entered the block\nAnd looked at us, I ain't flinch when they watched\nI took it upstairs, the bathroom mirror, brushed my hair\nStarin' at a young disciple, I almost gave my life to what the dice do\nYeah man, throwin' them bones\nHopin my ace get his case thrown\nHis girl ain't wait for him, she in the world straight hoein'\nWhile he lookin' at centerfolds of pretty girls\nShowin' they little cooch, gangstas don't die he's livin' proof\nThe D.A. who tried him was lyin'\nA white dude, killed his mother durin' the case\nHung jury, now the D.A. is bein' replaced\nPre-trial hearin' is over, it's real for the soldier\nWalks in the courtroom, the look in his eyes is wild\nTriple-homicide, I sit in the back aisle\nI want to crack a smile when I see him\nThrow up a fist for black power, cause all we want is his freedom\nHe grabbed a court officer's gun and started squeezin'\nThen he grabbed the judge, screams out, nobody leavin' everybody\n\n[Chorus]\n\"Get down, get down! Get down, get down!\" [Repeats]\nEverybody\n\"Get down, get down! Get down, get down!\"\n\n[Nas]\nSome niggas fuck they enemies in they ass when they catch 'em\nWeird-ass niggas are dangerous, so don't test 'em\nThey make you, disappear, this a year that I won't forget\nSold CD's double platinum, met mo' execs\nSouthern niggas, independent label, real killers\nKnow the business, ran Tennessee for years, now they chillin'\nThey had the coke game somethin' crazy\nSold music out the trunk of they car, that shit amazed me\nPut me onto heron blunts, sherm or somethin'\nTook a puff, what the fuck, I turned to punch them\nSouthern niggas ain't slow, nigga tried to play me\nI left from around them dudes, they cool but they crazy\nNow I'm back around the old school that raised me\nNew York gangstas, we loungin', out in L.A. see\nA dude wrote my dawg from Pelican Bay\nThe letter say, \"Nas I got your back - the fools don't play\"\nI rolled with some Crips down to a Crenshaw funeral\nNever saw so many men slaughtered and I knew the ho responsible\nThe nigga still alive in a hospital\nMidnight they crept in his room and shot the doctor too\nSee my cousin's in the game, thuggin' and things\nHe plugged me with a dame who was half-Mexicano\nGave the ass up, I'ma mack daddy Soprano\nShe passed me the indigo, but the imbecile\nShould of never tippy-toed, thought my eyes were closed\nOpenin' the hotel room do', to let her goons in\nBut I moved in a manner, on some Jet Li shit\nI let the hammers blow, wet three kids\nSee honey thought I had somethin' to do, with all the drama\nCause I was with a crew, that had her people killed\nCalled up my cousin, told him I ain't fuckin' with you\nHe responded cool, but told me out here this how motherfuckers\n\n[Chorus]\nAll I really gotta say is that\nIf that's how our people goin' get down, how we ever goin' get up?\nHow we ever goin' get up if that's how we get down?\nA shame when you ain't look at it\nMy folk is yo' folk, but we all kinfolk\nSomebody gotta make a change", "image": "https://images.genius.com/23061dd2dc7e863127db561906debd27.434x434x1.jpg"}], "artist": "Nas"}