{"songs": [{"title": "Doe Rae Me (Hailie’s Revenge)", "album": "Straight from the Lab", "year": "2003-04-15", "lyrics": "[Intro: Eminem + Hailie]\nHailie, what do you want to be when you grow up, baby?\nI don't know, but I don't want to\nGrow up to be like Ja Rule's little dirty-ass kids\nHa ha, yeah, c'mon\nG-G-G-G-G-G-G Unit\nHailie, come here, baby! Bring Daddy his Oscar!\nWe're gonna shove it up Ja Rule's ass\n\n[Verse 1: Swift]\nI'm about to get rid of some hoes, it's simple\nI'm quick to murder ink with lead\nAnd I ain't talking 'bout a pencil\nLook at what the fuck you done got into\nI see you found your niche, you just a bitch with a menstrual\nClaiming you a murderer, and you spelled it wrong\nYou put E before the D, ‘cause that's all you on\nYou on Pac's dick, you a replica guy\nIf he was still alive, you would never get by\nAll you do is cry, bitch, keep it real\nLife is more than imitating niggas and eating pills\nAnd what kind of motherfucker ruins three deals\nThat another nigga got you? They didn't see skills\nAnd I ain't playin', you a brother getting cheated\nAnd Ja Rule be prayin' on his cover, ‘cause he need it\nAnd all you niggas hating, shut your mouths!\nIt's just that real niggas ain't buying that shit y'all put out\n\n[Verse 2: Obie Trice]\nDoe, rae, me, but we don't sing, motherfuckers\nSo Murder Inc, do your thing, motherfuckers\nYou unleashed on a team\nWho expects nothin' less than R&B coming from that regime\n\"Regime\" is a little extreme\nNeck and neck with soldiers, motherfuckin' Marines\nJa sold his soul to sing\nWeave eye-witness team on the TV screen, chase the greed\nNow that you've embraced the green\nDon't fuck with the triple beams\nYou's a motherfuckin' actor, slash Pac impersonating rapper\nSlash Billie Holiday – how it happen?\nArtist and repertoire saw him in action\nPac assassination, Def Jam grabbed him\nTold him, \"Reenact him, you go platinum!\"\nThey seen it for sure, I know that Afeni Shakur\nDon't enjoy Jeffrey Atkins reenacting her boy\nSo I'm click-clackin' this toy, mash and destroy\nShady slash Aftermath and Detroit, motherfucker!\n\n[Hook: Eminem]\nDoe rae me, fa-so-la-ti-da\nDon't blame me ‘cause you washed up, lost your spot\nMama-say-mama-sa-ma-macosa\nJa, quit playin', knock it off, you're not 2Pac\nDon't hate me, I'm too hot and you're not\nShooting at me, with the only shot you got\nJa, quit playin', knock it off, you're not 2Pac\nYou'll get popped poppin' all that shit you pop\n\n[Verse 3: Kuniva]\nNow, we can get past the mean mugs and get to the slugs\nTo the grievance and the crying and the intimate hugs\nWe don't take you serious, nigga, you shook\nYou half of a half-way crook; get off X dick, go sing a hook!\nNigga, and you can't replace the late great one\nAnd when you gone you only gon' be the late fake one\nNigga, please stick to the script\nBefore the guns stick to the clip\nAnd Benzino, you ain't shit but a bitch!\nFuckin' old-ass, ignorant, innocent-lookin' senior citizen\nBuilt up, slap you like Grimace, all sensitive\nWait a minute, hold on: is it me, or do he look like a banana with braids and clothes on?\nA bitch-made man; now, how you gonna connect\nWith them short ass arms, like a Tyrannosaurus Rex\nYou niggas can scream, holler and curse\nGo ahead and respond\nAnd pull that pen and pad up outta your purse\n\n[Verse 4: Proof]\nSlim didn't send Proof to get at the wankstas\nHe told me to let loose and spit at the gangstas\nWhat up, Gotti? And this little war you pushed on\nPut your ear to the ground for stepping on bush stones\nWhat's wrong? Didn't think we strong with real niggas?\nRoll like a boss, in the streets they still feel us\nIt's real business, y'all ain't caught the concept\nYou talking nonsense to walking bomb threats\nContact was blown by Benzetta in The Source\nThreaten at the boss, you gon' see me on your porch\nNow Irv got the nerve to try to serve on us\nBut Detroit niggas early and ain't scurred to bust\n\n[Verse 5: Kon Artis]\nWord to my nigga Bugz, punks like you get beat up\nStomped unconscious and smacked with the heater\nThis rap cookie monster gets jabbed in the tonsils\nWith dicks so much that he should be fixed with a vagina\nWho's behind ya? Cadillac Pac or that transvestite?\nThat dress like a Lil Kim fox\nYou're just like a little windbox\nPress tight on the trigger of this Glock\nSwallow that little shit you got left to help you eat\nYou knock Pac's songs without love to help you sleep\nYou got shot in your video trying mock Pac\nYou Mockaveli; get your own identity!\n\n[Hook: Eminem]\nDoe rae me, fa-so-la-ti-da\nDon't blame me ‘cause you washed up, lost your spot\nMama-say-mama-sa-ma-macosa\nJa, quit playin', knock it off, you're not 2Pac\nDon't hate me, I'm too hot and you're not\nShooting at me, with the only shot you got\nJa, quit playin', knock it off, you're not 2Pac\nYou'll get popped poppin' all that shit you pop\n\n[Over hook]\nDon't you never say my little girl's name in a song again\nFuckin' punk-pussy bitch! I'll fuck you up, boy! Never!\nDon't you never in your motherfuckin' life…\nI'll choke the shit out of you little motherfuckin' midget\nHailie'll whip your motherfuckin' ass\n\n[Outro: Obie Trice]\nThat's right, motherfuckers\nShady records, what you know about it?\nFuck Benzino! Fuck Ja Rule!\nNigga, this Obie Trice right here talkin' to you motherfuckers\nJa Rule punk ass, yeah, fuckin' Soul 4 Real ass\nNigga, that's Soul 4 Real\nThat the nigga from Soul 4 Real!\nCandy Rain-ass nigga, he got a deal, now he rappin'\nYou don't know what's, faggot-ass motherfuckers\nGet money to all my real niggas, man\nObie Trice, D-12, G Unit, 50 Cent, Hailie Jade\n\n[Outro: Hailie and Eminem]\nDaddy, is Ja Rule taller than me?\nNo, honey, you guys are the same size", "image": "https://images.genius.com/8dd03ebbf724e2b4d4bafbddf8c3c2f1.1000x1000x1.png"}], "artist": "Eminem"}