{"songs": [{"title": "No Mediocre", "album": "Paperwork: The Motion Picture", "year": "2014-06-17", "lyrics": "[Hook: T.I.]\nAll I fuck bad bitches, I don't want no mediocre ho\nDon't want no mediocre, I don't want no mediocre, no!\nBad bitches only, ain't no mediocre ho\nDon't want no mediocre, I won't hit no mediocre, yeah\nBad bitch stuntin' on them mediocre hoes\nOn them mediocre, you stunt on them mediocre\n7, bitches with me and ain't none of them mediocre\nFrom they head to they toes they so far from mediocre\n\n[Verse 1: T.I.]\nRight hand in the air, I solemnly swear\nI never fuck a bitch if she don’t do her hair, no more\nYou won’t get no dick if it’s a bush down there\nGirl, I should see nothing but pussy when I look down there\nHey, come fuck with a nigga, what better to do?\nHe call and ask how you doin, tell him \"Better than you\", yeah\nI’m kicked back with four pieces like a Kit Kat\nMe fucking if you ain’t a dime, just forget that\nPretty face, fat ass, if she don’t have\nHave one of these, well, I think I’ll pass\nI just handed her the keys to a new drop Jag\nWhen she took it, I took it back, you shoulda asked for a Benz\nThat’s mediocre bitch!\n\n[Hook: T.I.]\nAll I fuck bad bitches, I don't want no mediocre ho\nDon't want no mediocre, I don't want no mediocre, no!\nBad bitches only, ain't no mediocre ho\nDon't want no mediocre, I won't hit no mediocre, yeah\nBad bitch stuntin' on them mediocre hoes\nOn them mediocre, you stunt on them mediocre\n7, bitches with me and ain't none of them mediocre\nFrom they head to they toes they so far from mediocre\n\n[Verse 2: Iggy Azalea]\nHeard he want to lay it down on Iggy Iggy\nGave it to him twice, now he want a 3, Mike Bibby\nDiva, but I need a bad boy, rest in peace, Whitney\nPardon me but I don’t think none of these bitches fucking with me\nWant a billboard bitch? Stop running in place\nHeels on me saying gimme 6 inches of space\nCourtside while designer frames cover my face\nNow everybody in the game wanna get 'em a taste\nI’m still Grand Hustle first lady, fuck you pay me\nBet he won't go 12 rounds with the million dollar baby\nI can change your life quick, stop playing with me\nAnd if you ain't talking money what you saying to me? Iggs\n\n[Hook: T.I.]\nAll I fuck bad bitches, I don't want no mediocre ho\nDon't want no mediocre, I don't want no mediocre, no!\nBad bitches only, ain't no mediocre ho\nDon't want no mediocre, I won't hit no mediocre, yeah\nBad bitch stuntin' on them mediocre hoes\nOn them mediocre, you stunt on them mediocre\n7, bitches with me and ain't none of them mediocre\nFrom they head to they toes they so far from mediocre\n\n[Verse 3: T.I.]\nI'm in Brazil with a bitch\nCatch me in a mansion in the hills with a bitch\nGet her out them tennis shoes, throw some heels on a bitch\nI’m the type of nigga split a mil with a bitch\nHold up, only if she bad though\nOut here trying to find someone that better than my last ho\nTake her to my castle, drown her in my cash flow\nSay your dick so little she can fit it in her asshole\nTold me she can't ride this shit no further than a cab go\nSaid I got that dumb dick, she wanna be my tutor\nSo she give me brain, getting head on the scooter\nHad sex on the beach from Bermuda up to Cuba\nI done fucked a lot of dimes but I’m looking for a cuter bitch\nYou the shit, what she say when she got to sit\nWhen I ain't around, give a damn who you do it with\nSuper thick, pretty face, ménage à veinte\n20 at the same time, wanna get ya rent paid?\n\n[Hook: T.I.]\nAll I fuck bad bitches, I don't want no mediocre ho\nDon't want no mediocre, I don't want no mediocre, no!\nBad bitches only, ain't no mediocre ho\nDon't want no mediocre, I won't hit no mediocre, yeah\nBad bitch stuntin' on them mediocre hoes\nOn them mediocre, you stunt on them mediocre\n7, bitches with me and ain't none of them mediocre\nFrom they head to they toes they so far from mediocre", "image": "https://images.rapgenius.com/1b9a09ba08b2342e999e1132b162144c.1000x1000x1.jpg"}], "artist": "T.I."}