{"songs": [{"title": "H.A.M (Sandwich)", "album": null, "year": "2012-07-30", "lyrics": "[Verse 1: Tyler, The Creator]\nBitch ass niggas don't know me, new sandwich with bologna\nI ain't really y'all niggas friends, none of you motherfuckers is my homie\nI bought a brand new treat, y'all niggas don't know me\nA B C, 1 2 3, AK-47 hit a nigga in his teeth\nHe can talk a lot of shit but don't really wanna be handling the motherfucking business that he needs to\nI'm a hit a motherfucking nigga in the back when I see you\nFiji Water, Fiji Water, I'mma go and piss on my daughter\nYou don't believe me, I'm a monster\n\n[Hook: Earl Sweatshirt]\nReal nigga on the track bitch\nCome through with the sandwich\nThat's bread, lettuce, cheese, mustard, bread, crumble\n\n[Verse 2: Domo Genesis]\nUh, you know the buick got the suicide\nRoll up on that buick nigga you're gone die\nYou will never know who in fucking side\nI come through commit a fucking suicide\nI got nine knives, nine lives, nine bags of chips\nNine bitches, we about to go on a field trip\n\n[Hook: Earl Sweatshirt]\nSandwich, bread, lettuce, cheese, tomato, mustard, bread, crumble\nSandwich, bread, lettuce, cheese, tomato, ketchup, mustard\nWho you trying to fuck with\n\n[Verse 3: Tyler, The Creator]\nNot me nigga, because I got the heat nigga\nIf you got a fucking problem nigga I will motherfucking lay the shit down like lyrics on a\nBeat nigga Get your ass beat nigga, Talk shit to me\nI don't like that, I'll put a fucking bundle of bananas in my fucking ass\n\n[Hook: Earl Sweatshirt]\nReal nigga what's up\nLettuce, cheese, tomato, mustard, bread, crumble\n(I look like J. Cole, I look like J. Cole)\n\n[Verse 4: Tyler, The Creator]\nMy new, my new, my new bitch got a new line up\nRolex with the time up\nDon't believe I'm the best nigga, playback rewind up\nI give no fucks. Do I give fucks?\n(Ayo Clancy)\nI give no fucks\n\n[Bridge: Tyler, The Creator]\nThese niggas got a problem on their hands\nIt might be me, It might be me\n\n[Bridge: Earl Sweatshirt]\nIf you wanna be the one for me\nYou're gonna have to show me your motherfucking back handling skills\nBro that's on me for realla, real nigga in the spot\nI might come through with a Glock, and kill you\nWe gone sing until the night's over, What you looking at boy\n(Ready?)\n\n[Verse 5: Tyler, The Creator]\nCall me wavy, the way that I'm cappin' ya\nAll black guns like I'm going to war with Africa\nNigga got a problem, I'll be...\nWolf Gang, Golf Wang, Trash Wang\n\n[Hook: Earl Sweatshirt]\nLettuce, cheese, mustard, tomato, lettuce, bread, crumble(tasty)\nSandwich, lettuce, bread, cheese, mustard, crumble, we who you trying to fuck with?\n\n[Verse 6: Tyler, The Creator]\nPussy nigga think he trying to talk shit to me on Facebook and Twitter?\nCall me Mark Maguire, I'mma hitter\n\n[Hook: Earl Sweatshirt]\nSandwich , lettuce, cheese, mustard, tomato (where your sandwich at)\nTomato, bread (scrumpcious), I like bread\n\n[Outro: Tyler, The Creator]\nBitches know I'm the bomb, I mustard\nYou can call me dijon", "image": "https://images.genius.com/610384882ca6311db99de4fbfcdf2b46.421x421x1.jpg"}], "artist": "Tyler, The Creator"}