{"songs": [{"title": "Renegade", "album": "The Blueprint", "year": "2001-09-11", "lyrics": "[Verse 1: JAY-Z]\nMotherfuckers say that I'm foolish, I only talk about jewels (Bling bling)\nDo you fools listen to music or do you just skim through it?\nSee, I'm influenced by the ghetto you ruined\nThe same dude you gave nothin', I made somethin' doin'\nWhat I do, through and through and\nI give you the news with a twist, it's just his ghetto point of view\nThe renegade, you been afraid I penetrate pop culture\nBring 'em a lot closer to the block where they pop toasters\nAnd they live with they moms, got dropped roadsters\nFrom botched robberies, niggas crouched over\nMami's knocked up ‘cause she wasn't watched over\nKnocked down by some clown when child support knocked\n\"No, he's not around.\" Now, how that sound to ya? Jot it down\nI bring you through the ghetto without ridin' round\nHidin' down, duckin' strays from frustrated youths stuck in they ways\nJust read a magazine that fucked up my day\nHow you rate music that thugs with nothin' relate to it?\nI help them see they way through it—not you\nCan't step in my pants, can't walk in my shoes\nBet everything you worth, you'll lose your tie and your shirt\n\n[Verse 2: Eminem]\nSince I'm in a position to talk to these kids and they listen\nI ain't no politician, but I'll kick it with 'em a minute\n‘Cause, see, they call me a menace and if the shoe fits, I'll wear it\nBut if it don't, then y'all will swallow the truth, grin and bear it\nNow who's the king of these rude, ludicrous, lucrative lyrics?\nWho could inherit the title, put the youth in hysterics\nUsin' his music to steer it, sharin' his views and his merits?\nBut there's a huge interference, they're sayin' you shouldn't hear it\nMaybe it's hatred I spew, maybe it's food for the spirit\nMaybe it's beautiful music I made for you to just cherish\nBut I'm debated, disputed, hated and viewed in America\nAs a motherfuckin' drug addict, like you didn't experiment?\nNah, nah!—That's when you start to stare at who's in the mirror\nAnd see yourself as a kid again, and you get embarrassed\nAnd I got nothin' to do but make you look stupid as parents\nYou fuckin' do-gooders, too bad you couldn't do good at marriage (Ha-ha!)\nAnd do you have any clue what I had to do to get here?\nI don't think you do, so stay tuned and keep your ears glued to the stereo\n‘Cause here we go, he's Jigga-Jur-Jigga-Jih-Jigga\nAnd I'm the sinister Mr. Kiss-My-Ass is just a—\n\n[Hook: Eminem (& JAY-Z)]\n—renegade! Never been afraid to say\nWhat's on my mind at any given time of day\n‘Cause I'm a renegade!\nNever been afraid to talk about anything\n(Anything?) Anything! (Anything)\nRenegade! (Never been afraid to say)\n(What's on my mind at any given time of day)\n(‘Cause I'm a) renegade!\n(Never been afraid to holler about anything)\nAnything? (Anything) Anything!\n\n[Verse 3: JAY-Z]\nI had to hustle, my back to the wall, ashy knuckles\nPockets filled with a lotta lint, not a cent\nGotta vent, lotta innocent lives lost on the project bench\nWhat you hollerin'? Gotta pay rent, bring dollars in\nBy the bodega, iron under my coat\nFeelin' braver, durag wrappin' my waves up, pockets full of hope\nDo not step to me, I'm awkward, I box lefty\nAn orphan my pops left me and often my momma wasn't home\nCould not stress to me, I wasn't grown\n'Specially on nights I brought somethin' home to quiet the stomach rumblings\nMy demeanor, thirty years my senior\nMy childhood didn't mean much, only raisin' green up\nRaisin' my fingers to critics, raisin' my head to the sky\nBig, I did it, multi before I die\nNo lie, just know I chose my own fate\nI drove by the fork in the road and went straight\n\n[Verse 4: Eminem]\nSee, I'm a poet to some, a regular modern-day Shakespeare\nJesus Christ, the king of these Latter-day Saints here\nTo shatter the picture in which of that as they paint me as\nA monger of hate, satanist, scatter-brained atheist\nBut that ain't the case, see, it's a matter of taste\nWe as a people decide if Shady's as bad as they say he is\nOr is he the latter, a gateway to escape?\nMedia scapegoat who they can be mad at today\nSee, it's as easy as cake, simple as whistlin' \"Dixie\"\nWhile I'm wavin' the pistol at sixty Christians against me\nGo to war with the Mormons, take a bath with the Catholics\nIn holy water, no wonder they tried to hold me under longer\nI'm a motherfuckin' spiteful, delightful eyeful\nThe new Ice Cube, motherfuckers hate to like you\nWhat did I do? (Huh?) I'm just a kid from the gutter\nMakin' his butter off these bloodsuckers, ‘cause I'm a muh'fuckin'—\n\n[Hook: Eminem (& JAY-Z)]\n—renegade! Never been afraid to say\nWhat's on my mind at any given time of day\n‘Cause I'm a renegade!\nNever been afraid to talk about anything\n(Anything?) Anything! (Anything)\nRenegade! (Never been afraid to say)\n(What's on my mind at any given time of day)\n(‘Cause I'm a) renegade!\n(Never been afraid to holler about anything)\nAnything? (Anything) Anything!\n\n[Hook: Eminem (& JAY-Z)]\nRenegade! Never been afraid to say\nWhat's on my mind at any given time of day\n‘Cause I'm a renegade!\nNever been afraid to talk about anything\n(Anything?) Anything! (Anything)\nRenegade! (Never been afraid to say)\n(What's on my mind at any given time of day)\n(‘Cause I'm a) renegade!\n(Never been afraid to holler about anything)\nAnything? (Anything) Anything!", "image": "https://images.genius.com/1aebfd816914351eb7010bd441822da8.1000x1000x1.jpg"}], "artist": "JAY-Z"}