{"songs": [{"title": "Don’t Touch Me (Throw Da Water on ’Em)", "album": null, "year": "2008-04-15", "lyrics": "[Produced by Grind Music]\n\n[Intro: Busta Rhymes]\nThis is a national security alert\nGrind Music\nFlip Mode\nAftermath\nHere we go!\n\n[Verse 1]\nBack with the most venomous rap\nIt be the Godfather of the club banger let me hear you clap\nYou can applause and from the very beginnin'\nYou can give me a standin' ovation\nWhile I bang your face in\nWith another banger, I call it a cliffhanger\nWatch me mangle and strangle this whole rap shit (Come on!)\nYou can see the way I make 'em mad sick\nFrom down bottom, the way I got 'em; give me my cash quick (Come on!)\nLock on; you better grab onto somethin'\nBecause I'm 'bout to shake shit again and make a black bitch (Cum on!)\nNow you hear the shots ring off\nFrom bitches takin' everything off—each other\nGot 'em wildin', runnin' for cover\nThe King Kong-Big Foot-gully-with-a-skully bully of rap\nStill-ugly-with-the-money runnin' the trap\nNow they givin' me dap, as far as I'm concerned in this mu'fucker\nLook how I got 'em, now they ready to snap\n\n[Hook]\nSo don't touch me nigga! (You might burn yourself)\nDon't touch me nigga! (You might burn yourself)\nIt's gettin' hot in this bitch (So throw da water on 'em)\nWe got 'em hot in this bitch (So throw da water on 'em)\nWe got 'em hot in this bitch (So throw da water on 'em)\nWe got 'em hot in this bitch! (So throw da water on 'em!)\nHere we go!\n\n[Verse 2]\nNow you see the alcohol spillin'\nAnd we got 'em hands in the ceilin'\nYou know we only come to rattle the bulidin'\nAnd break it on down just a little, once again\nKnowin' we holdin' the bank so let me keep the dice rollin'\nAnd keep it traditional the way I keep my money fallin'\nWhile you're slackin' on your MAC-in', Duke, we always keep it goin'\nRight to the left, do it to death, now watch me\nCome through with a chisel that make the game sizzle, and I—\nPull out the skillet, prepare for the cookin'\nHow I'm wildin'; niggas wonder when I'm gonna bring the hook in\nThug's ice grill in every time they get to lookin'\nGot 'em wildin' overseas all the way back to \"Go Brooklyn!\"\nNow they ready to spazz 'cause we bring the best to them\nShit that shut it down on the regular, that's with the—\nFly '80s nigga that was whippin' in a Cressida\nFresher than—most of these niggas, killin' the rest of the—\nFellas that was thinkin' they was rushin' in and bustin' in\nBut the way we was doin', we was musclin' they hustlin'\n\n[Hook]\nSo don't touch me nigga! (You might burn yourself)\nDon't touch me nigga! (You might burn yourself)\nIt's gettin' hot in this bitch (So throw da water on 'em)\nWe got 'em hot in this bitch (So throw da water on 'em)\nWe got 'em hot in this bitch (So throw da water on 'em)\nWe got 'em hot in this bitch! (So throw da water on 'em!)\nHere we go!\n\n[Verse 3]\nYou don't really want it, my dude\nI'm sayin' most my niggas is rude\nAnd when we come, we eat a nigga' food\nBack to the fact of the matter at hand\nFor me to come and control this whole shit was only part of the plan\nThe other part of the plan for you to understand:\nThat nothin' could fuck with the kid, let me say it again\nThe broad-backed, big Bus-a-Bus back to put out the trash\nAnd just for the record, we got it on smash\nNow, how the fuck they even got the audacity\nThe fire marshall come and try to talk about capacity\nEvery time I'm in the spot, I hope you know it has to be\nExtremely packed to shut it down, you'll probably cause a tragedy\nDon't you know that when I'm in the place I change the mood again\nI be wildin' wit raunchy bitches and a bunch of hooligans\nNow don't get it fucked up just because I flaunt it\nNiggas think that they can test me, bring it if you really want it\nSee I be the type to always beat you to the punch faster\nI keep a smile on my face, but carry the Bushmaster\n\n[Hook]\nSo don't touch me nigga! (You might burn yourself)\nDon't touch me nigga! (You might burn yourself)\nIt's gettin' hot in this bitch (So throw da water on 'em)\nWe got 'em hot in this bitch (So throw da water on 'em)\nWe got 'em hot in this bitch (So throw da water on 'em)\nWe got 'em hot in this bitch! (So throw da water on 'em!)\nKeep it goin'\n\n[Verse 4]\nYou already know I said it word to mother\nShit is so hot you niggas think it's cold up in the summer\nShh, calm the noise down let's get a little quiet\nCause the neighbors call the police they know we cause riots\nAnd they know that we'll have them thinkin' they dancin' with the devil\nWhen they play the music turn the volume to the highest level\nYou got it right\nLet's keep the bomb goin' like we lit a stick of dynamite\nBow, you know you need to follow whenever you hear the God spit\n(Aw, shit)\nYou see me nigga back in the cockpit\nOut to gettin' this money I give you all a stock tip\nPerspire by a nigga till you see the sweat drop drip\n\n[Hook]\nSo don't touch me nigga! (You might burn yourself)\nDon't touch me nigga! (You might burn yourself)\nIt's gettin' hot in this bitch (So throw da water on 'em)\nWe got 'em hot in this bitch (So throw da water on 'em)\nWe got 'em hot in this bitch (So throw da water on 'em)\nWe got 'em hot in this bitch! (So throw da water on 'em!)\nHere we go!", "image": "https://images.genius.com/2b3834083057caa47a4d42d3890cbead.800x800x1.jpg"}], "artist": "Busta Rhymes"}