{"songs": [{"title": "Kiss of a Black Widow", "album": "Bobby Digital in Stereo", "year": "1998-11-24", "lyrics": "[Ol' Dirty Bastard (RZA)]\nLet me tell y'all all something motherfuckers\n(Oh you complaining about that man?)\nYeah them motherfuckers belong to us\nStraight up, tell all ya'll motherfucking hoes\nYa'll motherfuckers know what's the fucking time\nYou think we don't love you motherfuckers?\nRun in to the motherfucking courts with all that bullshit motherfuka\nI'm letting all ya'll motherfuckers know\nI'm getting tired a that shit\nYou motherfucking triple breed motherfuckers\nBitches we love you motherfucka\n\n[Verse 1: RZA]\nBobby Digi, Bob Digital shit is critical\nLaid the fuck up inside the hospital\nIt's a riddle of a sphinx bitch had me jinx wid hijinx\nCuban linx snatched from my neck\nIt was the sex\nThis 12 ounce bottle of Beck's had me drunk\nOne night laid up wit the Ol' Dirt and ten bags of skunk\nJust met this ho last month\nLookin' like a Benz with a woofer in the trunk\nI pushed up like a push-up stick\nOne hand up near my cheek the other hand was holdin' my dick\nI said \"Power equal.. Boo!\"\nWhere's your people? I be Bobby D-I-G-I-tal\n(Is that right?) Word, and exact\nGirl you got a smile that a make a nigga heart crack\n(For real?) Word, ya grill like a thousand dollar bill\nClose your eyes count to three and click you heels\nAnd we could end up at my place face to face\nButt-naked I'll invade your inner space\n*Sniff* Straight up boo\nDamn I can taste it!\nOne drop of sperm the God wouldn't waste it\nOver the quilt\nI rather put it inside you so your breast be filled with milk\nAnd we could lay up\nAnd I could squeeze until it tilts\nMy house built on stilts is bangin' like the Hilton\nLook, now how you feelin' gimme some feeback boo cause I need that\n(Look Bobby where's the beer and the weed at?)\nWhat girl? shit I got more than a little\nShe set me up for the kiss of the black widow\n\n[Verse 2: O.D.B]\nYou couldn't get a flick of the hype outfit\nCause the way that I'mma dress this style is mad wild\nEnough to make a crowd of women scream Oww!\nWhether at a party or just in bed\nOr thoughts of Ason bitch keep that in your head\nMy beats are funky my rhymes is funky\nSometimes I say well motherfucka what's the recipe?\nI don't know! I ask my mama, she don't know!\nGo ask ya poppa....\nIt's all about me in the place to be\nNigga you all that uhhh....\nMotherfucka that shit is jinxed it's mad\nMotherfucking game and it's a God-damn shame\nHow many motherfuckas wanna know this name, Ason\nYo I LOCK ON pass the break!\nShake and motivate, stimulate\n\n[Verse 3: RZA]\nBy this wiz that you dying to have in your clutch\nFall in love like a drug\nCall out into her love flood\nFuckin' so much, dunn you'll only bust blood\nCaught inside the scud-missle grip like tissue\nNow I'm laid up inside the hospital\nBobby Digital's on critical\nCause the testicles is drained\n\n[Outro: RZA]\nHuh huh\nNah I ain't doing it right, right?\nHuh", "image": "https://images.genius.com/10f833f6fa5be4455d32a441346e0086.431x431x1.jpg"}], "artist": "RZA"}