{"songs": [{"title": "Big Girl", "album": "Fishscale", "year": "2006-03-28", "lyrics": "[Produced by Ghostface Killah and Anthony Acid]\n\nEvery girl that's guilty of waiting so long, sometime\nSo it seems like it doesn't make sense\n\n[Female singing with laughing in the background]\n\n[Sniffing]\n\n[Verse]\nYeah, it was them cute pretty bitches that was smelling like coke\nThey kept going [egh egh] like they had shit in they throats\nThey had stacks on the tables, cables\nI had to say it was like early May\nA few days 'til my birthday date, baby date\nI'll play to the sucker DJ, looking like Enrique\nTold him to throw in that Supreme Cliee-ente\nHe said just gave a nod with a thumbs-up wink\nI just put down my dollar bill, took off my mink\nBartenders know we big spenders, gave us those mobster drinks\nSent us lobsters and cigars that stink\nPlaying them oldie-but-goodie classics, them honies had fat asses\nNoses runnin' from the raw, they hid behind they glasses\nToney with the Montana, I came to play\nWith my long fingernail, your honey should pass that yay\nLet me see what color you got boo, I got that beige\nI see y'all from the perihperals, ladies far right from the stage\nI'm 33, I look 26 with big furs on\nWhat y'all inherit, the Santa Maria?\nY'all money that long?\nYour father must have fell back when y'all started fucking\nYou asked me what I think about dude? I say \"fuck him\"\nAnd this one bitch called me Fat Albert\nThe way my pockets had the mumps, you know that Ghost is 'bout it\nThen I asked these young ladies do they buff helmets\nThey said \"fuck you\", took a sniff and then they didn't tell me\nJust because you left home, this is Tone\nYo, you see I flip stones\nBirthstone, you ain't grown fuck around and get boned\n3 rich pretty young ladies lost at 6, Gucci kicks\nAnd they picky when it come to they dick\nIf y'all ladies was all mine I'd teach you well\nFree tales, sweet smells, eat well, hear bells\nBefore you sleep, read your books like it was my fanmail\nAnd when you wake, you be a new woman, know the whole world can tell\nWord life, put you to school when the clubs'll stop\nCollege girl, pay for your books at 200 a pop\nAnd all I ask in life's for you to be careful\nStay focused, take care of your health\nHave kids and marry a prince\nGood luck and happiness\nAnd no longer shut yourself in, taste the pain, the sorrow\nThe sun'll shine and still come out tomorrow\nAnd maybe be a secretary, business woman, 5th Ave., or run a library\nYou got the right conversation, education and looks\nWith the right intelligence to stay away from them crooks\nBaby get on your feet, be an accountant, doctor, lawyer or nurses's aid\nComputer wizard, you about to get paid\n\n[Outro, over background singing]\nYea\nYou know I just met y'all\nAnd I love y'all already and all that\nBut I gotta get off that nose candy\nTo make it in life and all that shit\nThat's why I'm here\nI'm like a father figure and all that shit\nI let y'all get high, and that's all you're going to do but\nYa'nawm sayin?\nCause I drop jewels all over the place\nY'all too pretty for that\nSome of y'all nose hairs is burnt\nI just want you to snap out of it\nYou know why? cause you's a", "image": "https://images.genius.com/61b48fa7fe972c473dc1c20c9489e45f.1000x1000x1.jpg"}], "artist": "Ghostface Killah"}