{"songs": [{"title": "In His Own Words", "album": "In His Own Words", "year": null, "lyrics": "[Interview]\n(made nigga  to the grave nigga!)\nyou can't disrespect the loveall those ghettos and towns..I love y'allwassup y'all it's the thug lord 2Pac I'm coming back for sho' (made nigga to the grave)\nharder and harderY'all can't fade me. Y'all can't turn on me don't change on me(this is it)you know what I meanwhat's poppin'all those ghettos all those..what's poppin'only god can judge usI'm riding y'all can't fade me , I'm\nRidingmade me #1 you know what I meanand I'm coming back fo' sho'So you can imagine how I feelThat's wrong[Verse 1: 2Pac]\nThey try to ban me, cause the brothas makin' noise a lot\nI tear that asses and the boys\nBout to poison the block\nThey got me jocked\nBut now I'm strapped and gettin' hotter\nRunnin' from the cop, as I try to cock my Glock\nThe war won't stop\nThat's why they wanna ban the music\nYou ever notice how the cops can't stand the music\nSee a black man coolin' with a mexican\nWe can all have peace on the sets again\nGive a shout-out to my homies in the Pen', they try to keep us down 'fore we clown everytime we hit the Top-10\nso why are people telling me I'm wrong for doing what I'm doingI'm a reflection of the community[Hook: Young noble] +[Interview]\nBrothas talk a lot of shit, but that'a after you gone\nCause they fear you in a physical form\nOutlaw in his own Words, they just get served\nStuck out on a block out when the drama occurs\nBrothas talk a lot of shit, but that'a after you gone\nCause they fear you in a physical form\nOutlaw in his own Words, they just get served\nStuck out on a block out when the drama occurs\n\n[Verse 2: 2Pac]\nOnce again it's yo friend out of Oakland\nHopin' they keep the hip-hops clubs open\nNow we can fight and let 'em close [?]\nWe can have peace and so we control them\nAin't nobody gettin' paid, it's a damn shame\nWhy gangbang brothas in the same gang take security to blame\nCause they lettin' it off, brothas come to have fun\nBut they settin' it off\nOne time make it worst when they sweat us\nSend a army of pigs to come get us\nSo I'm runnin' out of time, and it's cool, down with my (homeboy put it down)\n\n[Hook: Young noble] +[Interview]\nBrothas talk a lot of shit, but that'a after you gone\nCause they fear you in a physical form\nOutlaw in his own words, they just get served\nStuck out on a block out when the drama occurs\nBrothas talk a lot of shit, but that'a after you gone\nCause they fear you in a physical form\nOutlaw in his own words, they just get served\nStuck out on a block out when the drama occurs\n\n[break]\n\n[Interview 2]\nyou know what I mean going through tryna come up\nAnd then get pulled up back 5 steps then you move make 8 steps and pull you back 18 steps so\nTo me it's not personal because they're all going through it. The only thing that makes it different and original with me is that people get to watch it from beginning to end like soap opera. You get to watch mine'severytime I think this is it and I go all out to beat that and I win or I lose then I come into the next one and it's worse. It's like the twilight zone. It's like some evil, unstoppable shit that is won't let me goI wanted to get out the game. I'm trying to get out the game and they wanna dirty up my memory. They wanna dirty up everything I worked forI feel as though what was done in the dark will come to lightwhat's the problem!attitude's them change it's not as sick as it used to beI can't front. It slowed me down. What went through my mind was 'like damn I'm shot', I couldn't believe I could ever get touchedThat's why I attack the way I do, because I'm a general and I'm a smart general and I'm not gonna attack at no blind soldierI feel like I'm doing it for hip hop all do is get me [?] outhell nah we goin taking it personal\nand my choices have already been made even if I wanna change it\nso that's how I know who shot me,what happened and everything they mad cause I know what happenedI feel as though what was done in the dark will come to light\nthe secrets that everybody is gon find out about that I don't  have to playa hater [?] about that will come out and you will find out for yourself and you'll know why I did it\nBut it's a game. It's the game of life, Do I win or do I lose?. I know one day they're gonna shut the game down but I gotta have as much fun and go around the board as many times as I can before it's my turn to leave\n\n\n(what! ,Makaveli in his own words\nWhat!, Outlaw in his own words\nWhat!\nWhat!)\n\nOutlaw", "image": "https://images.genius.com/697ac17cdbfa0842a42c39848e6a8555.600x600x1.jpg"}], "artist": "2Pac"}