{"songs": [{"title": "B Boy", "album": "NYC All-Star 15", "year": "2015-01-29", "lyrics": "[Produced by Sap]\n\n[Verse 1: Meek Mill]\nAll that ass, Lord have mercy\nAll that champagne, these bitches thirsty\nVerserchy, no hold up, I meant Versace\nI prolly pull up Roberto over Cavalli\nPuffin' on Cali, prolly out in the valley\nSippin' on something drowsy, bitches twerkin' like Miley\nTwerk, twerk for a real nigga sellin' work\nPromise I won't tell a word\nI been on that trill shit, way back\nNorth Philly nigga, but I'm laid back\nGet shot in your head drivin' your Maybach\nHomey D Clown know I don't play that\nSippin' dirty, riding dirty, I say hi to thirty\nCall your dog,  I call my dawg and he'll buy a birdy\nTry to school me, I'm getting out here early\nDope dealer, Puma life, back of this soccer jersey\nMink draggin', tell PETA I'm swaggin\nAll these karats like I'm tryna lure in a rabbit (Dag!)\nJust to put it (Put it where?) On my jacket (On my jacket)\n(What they askin?) What you doin? (What you doin?) Doin' fashion\n\n[Verse 2: Big Sean]\nOkay, I walk with a limp and I talk with a slur\nI might wear every single chain and mix it up with my fur\nI might get every single drink and mix it up til I blur\nI tell the bitch get on my lap, but don't you get on my nerves\nI need that bag full of green like a lawnmower\nJohn Doe and all Sean Doe it, and I keep it G\nYeah, I ground floor it, and I'm pound blowin'\nIf her pussy good then I might one, two, three, round four it\nGot her down for it\nYeah, nigga overthink, never under stress\nYeah, I understand, your girl over, I'm so unimpressed\nYeah, and she tryna fuck me raw, unprotect\nBut if I don't have that rubber on it I feel under dressed\nYeah, and I got money bags under my eyes, ho, cause I ain't sleep\nThey all Goyard too cause I ain't cheap\nFinally Famous Aura Gold is my I-N-C\nAnd I put everything in motion like I-N-G\nAnd when we flyin' private you could bring the gun on with us\nI got this freak to 3rd base, she tryna run home with us\nAnd I got comma on comma on comma on comma... on comma\nAnd I ain't talking about no run on sentence\nYeah, nigga hot headed so I need that Chings Chili\nPut my P up on her head like that bitch is reppin' Philly\nAnd I wheelie in that pussy like my nigga Meek Milly\nOn my way to meet millis\nLawyer drafting up the deep deep dealies\nI got rich decided that ain't rich enough\nWhen I did it big, bitch, I decided that ain't big enough\nDead Pres, who you diggin up?\nWho that nigga that you hating on, but just  can't get enough?\nFuck, the jig is up, little bitch\n\n[Verse 3: A$AP Ferg]\nI'm like Madoff but I made off, scheming on niggas' payoff\nI never take a day off, your stash is short like Adolf, Hitler\nYou should lay off on the gangsta talk cause you're fake, dog\nYou never pushed no yay, dawg, ain't see no keys like Ray Charles\nMe and Meek in the Maybach, we get Wale and take off\nWe got your bitch in a big house, she walk in hype like \"Hey, Ross, how you doing?\"\nGet with a dreamchaser, we ballin' hard like the Lakers\nYou ballin' out, you a faker, you prolly catchin' the vapors\nI'm at your house on the hill, I fucked your girl and your neighbor\nYou thinkin' Khloe don't know me, I'm in the car dashin' haters\nI'm in the Kardashian, get it? I'm lyin', can't I pretend?\nThey say fake it 'til you make it, well, let the fakin' begin\nI got a bitch with fake titties, fake ass, she all in the Benz\nThem titties'll prolly fall like a ball when she bend\nMy niggas from Harlem and Philly all get it in\nYour bitch come around then we fuckin' her and her friends\nCome get with a dreamchaser, we ballin' hard like the Lakers\nYou ballin' out, you a faker, you prolly catchin' the vapors\nCome get with a dreamchaser, we ballin' hard like the Lakers\nYou ballin' out, you a faker, you prolly catchin' the vapors\nI'm at your house on the hill, I fucked your girl and your neighbor\nI'm at your house on the hill, I fucked your girl and your neighbor\nI'm at your house on the hill, I fucked your girl and your neighbor\nI'm at your house on the hill, I fucked your girl and your neighbor, damn!\n\n[Outro: Meek Mill]\nWhat she do?\nShe, just, put, heart eyes under my pic nigga\nThat's my bitch nigga\nBought her a first class ticket to put the dick in her", "image": "https://images.rapgenius.com/f6eeb6ac8fbbd0a859878134a26794b5.500x500x1.jpg"}], "artist": "Meek Mill"}