{"songs": [{"title": "We’re The Greatest", "album": "Authentic", "year": "2013-04-30", "lyrics": "[Intro: LL Cool J]\nNever jealous cause once we're gone\nNever leave here til it's done\nBe really the greatest of all\nDo it well but not enough\n\n[Hook: LL Cool J]\nOh oh oh, mama we made it, aye\nOh oh oh, we're finally the greatest of the world\nOh oh oh, I told you we'd make it\nOh oh oh, we're finally the greatest of the world\n\n[Verse 1: LL Cool J, Eddie Van Halen(solo guitar)]\nKnock knock – who's there?\nThe one, remember me?\nI'm lookin kinda different these days, don't you agree?\nYour boy's going big these days, didn't even see?\nThe hell with the devil, there's no sympathy\nThe wishes in my past are still ridin me\nAll I can do is laugh as they lie to me\nYou can't take my God from inside of me\nCrosses up, light up the sky with me\nI got a lot of crazy crazy on my mind\nLike what's the real reason that the pope resigned?\nI got Van Halen, I don't need a bassline\nI knew we can do it, it was just a matter of time\nPut the axels back on the street and break on the vine\nI came back to take back everything that was mine\nIf I live to be 1-0-9 I'm still in my prime\nIf I don't then I don't, I'll live on in your mind\n\n[Hook]\n\n[Verse 2: LL Cool J, Eddie]\nI'm on a hacksaw tour, Eddie got a Frankenstein aimed at your door\nSpeakers under the stage, lift you off of the floor\nWhy? This music is the end to the war\nWe endure, cameras everywhere, everyone is keeping score\nEverybody talkin bout what's up bout the tour\nThe world is a steak, I'm a chew it up raw\nWe're back in heavy metal like we above the law\nLondon, Japan, Germany and France\nLisbon to New York, we're live up in Netherlands\nJump up on some shoulders baby, you never dance\nYou only live once, come on, here's your chance\nYou could be reborn, half star, half man\nIf you rise up and grab my hand\nIf I live to be 1-0-9 I'm still in my prime\nIf I don't then I don't, I'll live on in your mind\n\n[Hook]\n\n[Brigde, Guitar Solo: Eddie Van Halen]\nEddie Van Halen\nWe are the greatest\nRise up!\n\n[Hook]", "image": "https://images.genius.com/c0c7dbb9fd10ac4887ec94389a4d0712.1000x1000x1.jpg"}], "artist": "LL Cool J"}