{"songs": [{"title": "When Thugz Cry", "album": "Until the End of Time", "year": "2001-03-27", "lyrics": "[Intro]\nWhen thugs cry\nNow I lay me down to sleep\nI pray the Lord my guns to keep\nIf I die before I wake\nI pray the Lord my soul to take\nGot us dyin'\nWhen thugs cry, times is hard\n\n[Verse 1]\nBorn thuggin', and lovin' the way I came up\nBig money clutchin', bustin' while evadin' cocaine busts\nMy pulse rushin', semi clutchin' into insanity\nThey shot at my cousin, now we bustin' at they whole family\nThe coppers wanna see me buried, I ain't worried\nI got a line on the D.A. ‘cause I'm fuckin' his secretary\nI black out and start cussin', bust 'em and touch 'em all\nThey panic, and bitches duckin', I rush 'em and fuck 'em all\nI'll probably be an old man before I understand\nWhy I have to live my life with pistols close at hand\nKidnapped my homie's sister, cut her face up bad\nThey even raped her, so we blazed they pad\nAutomatic shots rang out, on every block\nThey puttin' hits out on politicians, even cops\nI ain't lyin', they got me sleepin' with my infrared beams\nAnd in my dreams I hear motherfuckers screamin'\nWhat is the meanin' when thugs cry?\n\n[Hook: singer & (2Pac)]\nOh, why should you send your child off to die?\nIn the streets of chalk where they lie\nLet no wrongs cry out when thugs cry, dear God (when thugs cry)\nOh my, does it have to be this way?\nOur children of today won't stay wise\nLet the children hear when thugs cry, dear God, oh why?\n\n[Verse 2]\nMaybe my addiction to friction got me buggin'\nWhere is the love?, never quit my ambition to thug\nAin't shed a tear since the old school years of elementary\nNiggas I used to love, enclosed in Penitentiaries\nBut still, homie, keep it real, how does it feel\nTo lose your life, over something that you did as a kid?\nYou all alone, no communication, block on the phone\nDon't get along with your pop, and plus your moms is gone\nWhere did we go wrong? I put my soul in the song\nTo help us grow in time, but now our minds are gone\nWe went from brothers and sisters to niggas and bitches\nWe went from welfare livin' to worldwide riches\nBut somethin' changed in this dirty game, everything's strange\nLost all my homies over cocaine, mayne\nSee, they ask me if I shed a tear, I ain't lie\nSee, you gotta get high or die, ‘cause even thugs cry\n\n[Hook: singer]\nOh, why should you send your child off to die?\nIn the streets of chalk where they lie\nLet no wrongs cry out when thugs cry, dear God\nOh my, does it have to be this way?\nOur children of today won't stay wise\nLet the children hear when thugs cry, dear God, oh why?\n\n[Verse 3]\nAnd all I see is these paranoid bitches, illegal adventures\nBustin' motherfuckers with uppercuts, I leave 'em with dentures\n‘Cause in my criminal mind, nobody violates the Don\nI write your name wit' a piece of paper, now your family's gone\nWhy perpetrate like you can handle my team?\nSo merciless in my attack I take command of your dreams\nLeavin' motherfuckers drownin' in they own blood\nClownin', takin' pictures later\nLaugh 'bout them punk bitches that turned snitches\nRegulate my area, the terror I represent\nMakin' your people disappear, you wonderin' where they went\nAm I cold, or is it just I sold my soul?\nAddicted to these streets, never find true peace I'm told\nCome take my body, God, don't let me suffer any longer!\nSmoke a pound of marijuana, so I know it ain't long\nWhere is the end to all my misery, is there a close?\nI suppose that's why I murder my foes; when thugs cry\n\n[Hook: singer]\nOh, why should you send your child off to die?\nIn the streets of chalk where they lie\nLet no wrongs cry out when thugs cry, dear God\nOh my, does it have to be this way?\nOur children of today won't stay wise\nLet the children hear when thugs cry, dear God, oh why?\n\nOh, why should you send your child off to die?\nIn the streets of chalk where they lie\nLet no wrongs cry out when thugs cry, dear God\nOh my, does it have to be this way?\nOur children of today won't stay wise\nLet the children hear when thugs cry, dear God, oh why?\n\n[Collision]\nI shed tattooed tears for years\nFor my dead homeboys and my prison peers\nY'all ain't never heard my cries\nNow you wonder why would you die?\n\n[Additional/Original verison Outro]\nAyy Nas, remember that shit you said? I don't know what magazine you said it on... Some shit about we're sending thugs to whoever & whenever. You need to go to the record store and check out some of the albums you've been putting out, because you been spitting this thug shit for a while now. I know you've been listening cuz you've been biting this shit so, uh recognize and realize before your ass get rolled on!...", "image": "https://images.genius.com/74b94f4112372859edd6ae711af0df41.1000x1000x1.jpg"}], "artist": "2Pac"}