{"songs": [{"title": "Mr. Officer", "album": null, "year": null, "lyrics": "[RBX + Dr. Dre]\nAiyo Dre\nYo, what's up?\nYo man, if that Rodney King shit would’ve jumped off with me man, that shit would've been a total different episode\n\n[Skit: Sample]\nWell, I might not be able to let you off so easy there Jimbo. See, you were doing 65 in a 35, and you ran a red light. That's reckless driving as far as I’m concerned! Who else you got in there with you Jimbo, huh? What the hell is going on in here? Alright, everybody out of the vehicle right now!\n\n(Don't do it! Don't shoot! Don't shoot! God, don't shoot! Please don't shoot!)\n\nYou're a cop. I know you man. I know what you're thinking. You’re thinking, \"We got us another crazy nigga here with a gun,\" well let me tell you something: Human life means very little to me at this point in time. You see, I thrive on misery. In the jungle, misery’s all you got, but, things are different back here in the world, or so they seem. Nobody wants to talk about pain and suffering. Everybody wants everything to be nice and civil. Well, okay then. Let's be nice. Let’s be civil. And let's drop those guns before I pull this trigger and change the way you feel about me!\n\n[Intro: RBX]\nHa ha ha ha ha ha ha ha ha\nFool\nDon't you know before you bring home the bacon\nYou gotta kill the motherfucking pig first\n\n[Hook: RBX (x4)]\nMr. Officer, Mr. Officer\nI wanna see you laying in a coffin sir\n\n[Verse 1: Prince Ital Joe]\n[?] is dead, me say [?] is dead\nThem ass is dead\nThem ass is dead, dead, dead\n[?] is dead, me say [?] is dead\nThem ass is dead\nThem ass is dead, dead, dead\nThem beat up Rodney King, them no have no mercy\nWicked officer, them no love humanity\nThe Crips on the block, them a come to get [?]\n[?] buried under\n[?] is dead, [?] my people get bread\nL.A. riot [?] spread\nSoon [?] California get scared\nThem ass is dead\nDead, dead, dead\n\n[Interlude: Reporter]\n\"Yes, we have—there have been riots, ah, uh, rioting. Well, I don't wanna say rioting, but there’s been looting downtown. But right now, Bree, what I want to show you is, they have started fires down at the end of the street.\"\n\n[Refrain: RBX + Sample]\nHow many niggas like police?\nWe don't love 'em!\nWe don't like 'em!\nI said how many niggas like police?\nWe don't love 'em!\nWe don't like 'em!\n\n[Sample]\n[?]\n\n[Verse 2: Dr. Dre]\nSitting in my living room, calm and collected\nFeeling that gotta-kill-a-cop perspective\n'Cause what I just heard broke me in half\nSo fuck Daryl Gates and the whole police staff\nLaugh now, but cry much later\nYou see when niggas get together\nThey get mad 'cause they can't fade us\nLike my niggas from South Central, Los Angeles\nThey found that they couldn't handle us\nBloods, Crips on the same squad\nWith the Ese's helpin', nigga, it's time to rob and mob\n(And break the white man off something lovely\nI don't love dem so dem can't love me)\nYo, straight puttin' it down, gettin' my scoot on\nIt's jumping off in Compton so I gots to get my loot on\nAnd come up on me some furniture or somethin'\nGot a VCR in the back of my car\nThat I ganked from the Slauson Swap Meet\nAnd the police better not try to stop me\n'Cause they will see that I can't be stopped\n'Cause I gives a fuck about a motherfucking cop\n\n[Interlude: Reporter + Reporter 2]\n\"Yes, on the videotape we seem to have the, ah, people in the crowd throwing things at the officers.\"\n\"And swinging at them as well, as a result a young woman there, you see took a swing at at an officer with some object in her hand.\"\n\n[Refrain: RBX + Sample]\nHow many niggas like police?\nWe don't love 'em!\nWe don't like 'em!\nI said how many niggas like police?\nWe don't love 'em!\nWe don't like 'em!\n\n[Hook: RBX (x2)]\nMr. Officer, Mr. Officer\nI wanna see you laying in a coffin sir\n\n[Verse 3: RBX]\nOne-time trigger happy, no nigga love\nOne-eighty-seven time, time to grab the glove\nCan't get prints on a nine I throw away\nOr get prints on my Uzi when it spray\nPop, pop, pop, another cop just dropped\nAnd I get relief like, plop, plop, fizz\nSmash, I crashed his head like a window\nI ain't Nintendo, I'm high off the indo\nCreepin', with the quickness to the cut\nBust one to his head while he munches on a donut\nAnd crack-up, so now he call for back up\nI guess I gots to pack up, filling the clip up\nI zip uptown but motherfuckin' cops are all around\nHelicopters flyin', these motherfuckers tryin'\nTo catch me and stretch me on Death Row\nBut hell no, the poor blacks refuse to go\n\n[Interlude: Reporter]\n\"This is now covering a very, very wide area of Los Angeles where these fires have been, uh, ignited. I mean, from here to the, uh, to the south end of South Central is a long way.\"\n\n[Hook: RBX (x4)]\nMr. Officer, Mr. Officer\nI wanna see you laying in a coffin sir\n\n[Outro: Prince Ital Joe]\nGunshot, them go bust\nThem go bust, bust, bust\nJamaican posse, ya gon bust gunshot\nDeath Row posse, ya gon bust gunshot\nWe no like police\nWe no like police\nNo like police\nWe no like police\nJamaican posse, we no like police, and\nDeath Row posse, they no like police, come follow me\nNo like police\nWe no like police\nDon't like police, and police don't like me", "image": "https://images.genius.com/bf3badae49c33b583126057638078bd8.576x576x1.jpg"}], "artist": "Dr. Dre"}