{"songs": [{"title": "Deep Fried Frenz", "album": "MM.. FOOD?", "year": "2004-11-16", "lyrics": "[Intro]\nBefore we go any further\nFriends\n\n[Verse]\nAs you call 'em, they call you when they need something\nTrees for the blunt, the G's for the front\nI found a way to get peace of mind for years and left the hell alone\nTurn a deaf ear to the cellular phone\nSend me a letter or better, we could see each other in real life\nJust so you could feel me like a steel knife\nAt least so you could see the white of they eyes\nBright with surprise, once they finish spitting lies\nAsssociates, is your boys, your girls, bitches, niggas, homies\nClose, but really don't know me\nMom, dad, comrade, peeps, brothers, sisters, duns, dunnies\nSome come around when they need some money\nOthers make us laugh like the Sunday funnies\nFam be around whether you paid or bummy\nYou could either ignore this advice or take it from me\nBe too nice and people take you for a dummy\nSo nowadays he ain't so friendly\nActually they wouldn’t have made a worthy enemy\nRead the signs: \"No feeding the baboon\"\nSeein' as how they got ya back bleeding from the stab wounds\nY'all know the dance, they smile in ya face, y'all know the glance\nTry to put 'em on, they blow the chance\nNever let your so-called mans know your plans\n(How many of us have them?) A show of hands\n(Friends) is a term some people use loosely\nI'm real choosy on what I choose to let crews see\nYou telling me; I try to act broke\nJealousy the number one killer among black folk\nFellas be under some type of spell like crack smoke\nGhetto Cinderellas, lead 'em right to your stack, loc\nJust another way a chick'll lead to your end\nI check the dictionary for the meaning of friend\nIt said: person, one who likes to socialize with\nSympathiser, helper, and that's about the size of it\nMost of the time these attributes is one-sided\nTo bolster the crime, they're apt to shoot you through your eyelid\nAnd they can't hide it, going wild like a white bitch\nSometimes ya need to cut niggas off like a light switch\n(Click!) And when things get quiet\nCatch 'em like a thief in the night, what a riot\nI first met Mr. Fantastik at a arms deal\nDon't let it get drastic, think of how your moms'll feel\nWhen it get for real, steel get to sparkin'\nEverything darken, and ain't no talkin'\nFor somethin so cheap, it sure buys a lot of trouble\nYa better off focusing than tryin to plot to bubble\nOr else it'd be a sad note to end on, the guns we got is\n(One's we can depend on, friends)\nSome come in the form of codependence\nA lot of times only end up being codefendants\nTen bucks say they tell for a lower sentence\nAnd leave you up under the jail, begging for a penance\nIt don't make no sense, what happened to the loyalty?\nHonor amongst crooks, trust amongst royalty\nI'd rather go out in a blaze, than give 'em the glory\n(How many of us have--) a similar story\n(Friends) before lovers, we used to have some type of over-standing\nJust so when I let her get the man thing, she know it's no strings\nWe could do the damn thing, but ho, it's no rings\nJust how the tramp swings\nWill she see 'em again?\nThat depends on how good was the skins and could she memorize the lessons\nIt ain't no need to pretend\nEven though she let 'em stab it, she know they're just friends\n\n[Outro]\nFriends\nHow many of us have them?\nFriends\nOnes we can depend on?\nFriends\nHow many of us have them?\nFriends\nBefore we go any further\n\n[Skit]\nFellas! Don't be silly! I know who my friends are!\nAnd the next nice neighborhood I move into, you guys'll get crack'\n(Negro humor always escaped me.)\n\n[Outro Skit: Character 1; Mr. Fantastic; (Invisible Woman);\nDr. DOOM; Character 2]\nThe most powerful, the most mysterious monarch in all the world\nGuided by a fighting force that never sleeps\nThat never relaxes its vigilance\nFor none is as feared, none has as many foes\nAs DOOM, the awesome ironclad lord of\nI know who Doom is (Then tell us)\nHe happens to be the most dangerous man in the world\nI’d hope we’d never hear from him\nI’d hope we’d never have to battle him\nBut now the worst has happened and I must tell you what we’re up against\nI first met DOOM years ago\nWhen he wanted to be alone, alone to pursue his forbidden experiments\nOne day while conducting a secret experiment\n[Explosion sounds] Later, when he recovered from his injuries\nInstead of having learned his lesson, DOOM was bitter, angry, vengeful\n[Woman screams] What have I done to myself?\nMy face, it is hideous\nHe traveled the world, seeking a cure for his disfigured face\n(I’m sorry sir, there is nothing we can do for you)\nHe traveled through remote villages, where strangers are seldom seen\nHe continued his search, never showing his face\nUnless threatened by bandits who prey on travelers\nWho foolishly wander alone through their domain", "image": "https://images.genius.com/f67af5eb94d7101171adfff4ca96a76c.1000x1000x1.jpg"}], "artist": "MF DOOM"}