{"songs": [{"title": "Knuckleheadz", "album": "Only Built 4 Cuban Linx…", "year": "1995-08-01", "lyrics": "[Intro: Raekwon, Ghostface Killah, U-God]\nGhostface: Let me - let me hold that\nRaekwon: One for you; one for me\nTwo for you; one-two for me\nGhostface: What?!\nRaekwon: Three for you\nGhostface: Nigga get - get the\nRaekwon: What?\nU-God: Fuck out of here with all that shit\nGhostface: Smack fire out your fucking ass. Man, what the fuck you think this is man? Get the fuck up out of here man\nRaekwon: Chill, chill. So, yo, matter of fact: the man is back\nGhostface: Stick this man head out over a fucking fire!\nRaekwon: Shit, alright. This ain't even enough bread right here. This ain't enough\nGhostface: Fuck that man, yo\nRaekwon: We going to shoot right over there. And, yo, them niggas got the big cream over there; just chill\nU-God: Alright, let's get this cash, and move nigga\nRaekwon: Spark it, right out the tropical, kid\nGhostface: Alright, don't play me like I got a flowerpot head kid\nRaekwon: Just chill man\n{*loading clip*}\nRaekwon: On the real, man. Just chill: Let's go get this money fast son; I know how we got to do this, kid\n{*gunshots*}\nRaekwon: ... you know trust this\nGhostface: Alright, scrungy-head motherfuckers\n\n[Verse 1: Raekwon]\nLay on the crime scene, sipping fine wines, pulling nines on\nUFOs taking they fly clothes, they eyes closed\nWe getting loot, no doubt, check the word of mouth\nUnheard about, guns go off and now I murder route\nI'm out, my raps play the part like a Get Smart secret agent\nIn a maze and style's blazing\nJohnny Blaze and Tony Starks in the Days Inn and\nAnd Rhyming, my nigga Lou Diamond with Robert F\nWe like Meth to go and fuck with Noodles\nHaving them poodles on the lockdown, buying me\nAmarettos and chewables, smacking pharmecuetical\nRap niggas on dust and woos\nYo, I told you some killed, robbed and fold\nThe goal's untold, fuck it, it beats parole\nSo stroll marvelous, soul controller of the whole globe\nGoddamn I got it sewn and yo\nWhat up wop? Pop the suitcase high and we can talk\nYou can walk out the fucking building and get caught\nSave the fully inflatable, rap relatable\nDrug relatable, niggas here to play with you\nA hundred dollar Rottweiler, go to spot sellers\nGuns and Glocks for them niggas who got props\nOff top jail niggas get mad bigger and yo\nMail a guy about a hundred pictures\nWord to mama, this rap wonder rhymer team got drama\nComma, blunt smoke real ass marijuana\nChef Maranzano boats across the Verrazano\nImmaculate, bust off my gun's so accurate\nAnd get cream in the cuisine of Queens\nI told you Money skated with night beams and two rings\n\n[Interlude: Raekwon (Ghostface Killah)]\nCrazy fag, I'm getting ready to do this shit\n(Sniff mad shit)\nMan, niggas know not to step on this shit\n\n[Verse 2: Ghostface Killah]\nWho's the knucklehead, wanting respect?\nChop his fingers in the drug game, Money well known\nLead singer, humdinger, flash is the aftermath, here's his photograph\nRun up in his lab, take off the mask Chas and think fast\nDon't laugh, bag the cash, grab the hash, don't forget his stash\nGrab the tear gas and place it in his face fast\nAt full blast {*Car zooming by*}\nThen skate to the next gate further upstate\nI heard they got crazy weight, bagged up by the cakes in\nCrates like disco breaks, yo look out for Jakes\nGive it all it takes, let's burn the place before we motivate\nYo, Blake, niggas don't fake, rape his mate\nIf the bitch scream, for God's sake grab the grey tape\nIt's by the plate with the blow crushed up with the flakes\nKiller snakes, four bodies found floating in lakes\nDrug related paper talking about the kids who didn't make it\nHits without a trace, never seen the bricks, see Rae and Ghostface\nCongratulations Chef, let's celebrate and sniff an eighth\n\n{*Inaudible conversation*}\n\n[Verse 3: U-God]\nThe rap star is born, Rap Parmesan, put it on, seal it on\nWe're silicone, spark it on your talkathon\nThis rap phenomenon, two corresponds\nTook the arms, hit me on the hip and horns, rap chaperone\nScars tone, bars thrown, war tones, raw tones\nBlowing out the door, bones, but\nYour raps is fraudulent, plug in these rap coordinates\nIs reinforced with suspense, be on your rap sword defense\nThese microphone professional, sensational\nFully operational, I got niggas here to play with you\nYou know the steez, you know my whole program\nBrothers from the no-lands, all we want is the Gs, guns and grams\nLiving fat like the Hoffa, mafia, sipping, eating pastas\nLaying in the house telling the seeds about the sagas\nBefore we got dramatic and thoughts got sporadic\nWe grabbed golden tablets and quick guarded the Abbots\nSlugs hit the Pelle, put tokes into the belly\nSuckers tried to knock me out the box like Skelly\nI smoke the weed trees, I drop top to the breeze\nHoney dip spending G's on nails and hair weave\nThe crime boss taking no loss, excessive force\nWe can play the A-Train back of the iron horse\n\n[Outro: Raekwon, Ghostface Killah]\nRaekwon: Yo, man, you know what I'm saying?\nGhostface: Fuck it man\n\n{*Tire screech*}\n{*crash*}", "image": "https://images.genius.com/e336a632db4d1dd7b6d848646b5d5ffc.876x876x1.jpg"}], "artist": "Raekwon"}