{"songs": [{"title": "LAX", "album": "Tha Blue Carpet Treatment Mixtape", "year": "2006-11-21", "lyrics": "\"Oh... Cali?\n\"No doubt\"\n\n\"LAX\"\n\"Oh... Cali?\"\n\"No doubt baby\" - (x4)\n\n[Snoop Dogg]\nWest West y'all, pile it on your plate\nA little somethin' somethin' from the Golden State\nNah, we ain't like Kobe and Shaq\nIt's Magic and Kareem nigga, Showtime is back\nTrue legends, two steppin' on you peasants\nWhat y'all thought, y'all gon' need bout two vests'\nCause we he plug, I plug\nMixed shot with the slug, listen here cuh\nWhen I dig dug - play slick and get stuck\nBut don't play tough boy, go and get it up\nHey yo Cube, tell me this\nWhy half of the homies gettin' worked by a bitch?\nThen they fall in love and get hurt by a bitch\nNine months later cus got mirked by a bitch\nSee I'm just a nigga that ya don't wanna\nReverse the game on her, put the bitch on a corner\nWelcome to California\n\n\"LAX\"\n\"Oh... Cali?\"\n\"No doubt baby\"\n\"LAX\"\n\"Oh... Cali?\"\n\"No doubt baby\"\n(Welcome to Cali)\n\"LAX\"\n\"Oh... Cali?\"\n\"No doubt baby\"\n(Welcome to Cali)\n\"LAX\"\n\"Oh... Cali?\"\n\"No doubt baby\"\n(Welcome to Cali)\n\n[Ice Cube]\nCome hit the town, drop down nigga\nL-A-X, top down nigga\nI'm scoopin' you up, ya rollin' or what?\nI know what ya came for, I'm rollin' it up\nSnoop Dogg nigga, y'all hold up\nNever thought Ice Cube would show up\nBut I'm in the studio gettin' fucked up\nWith a beat from Battlecat, a nigga lucked up\nI got my hustle down, look and learn\nSee how a hot nigga, cook and burn\nA nigga earn like David Stern\nMixed with Big Worm when he off that sherm\nNow - bust a u-turn, come by your hood\nFor motherfuckers that think I went Hollywood\nPick a Coast, it got to be the West\nI live out there, from the W.S. nigga\n\n\"LAX\"\n\"Oh... Cali?\"\n\"No doubt baby\"\n\"LAX\"\n(Welcome to Cali)\n\"Oh... Cali?\"\n\"No doubt baby\"\n\"LAX\"\n(Welcome to Cali)\n\"Oh... Cali?\"\n\"No doubt baby\"\n\"LAX\"\n(Welcome to Cali)\n\"Oh... Cali?\"\n\"No doubt baby\"\n\n[Ice Cube]\nFell asleep on the plane, and so did he\nWoke up chillin' in the LBC\nI grew up in the HNC\nBut that ain't what I turned out to be\nUnderstand me that I'm still a G\nWho ain't never spent a day in the penitentiary\nNow I'm rappin' with Snoop D-O double-G\nAnd got the whole fuckin' world nigga lovin' me\n\n[Snoop Dogg]\nYep yep, they love him to death\nCause he walk under water, without gettin' wet\nRoll through the neighborhood without gettin' checked\nSo gone and so blown, are we there yet?\nYou wonder why I got the S on my chest\nCause I'm a motherfuckin' vet from the Wild Wild West\nI used to sing \"Bennie and the Jets\"\nNigga so boss now I sip Henny on my jets\nFrom the East back to the West\n\n\"LAX\"\n\"Oh... Cali?\"\n\"No doubt baby\"\n\"LAX\"\n\"Oh... Cali?\"\n\"No doubt baby\"\n(Welcome to Cali)\n\"LAX\"\n\"Oh... Cali?\"\n\"No doubt baby\"\n(Welcome to Cali)\n\"LAX\"\n\"Oh... Cali?\"\n\"No doubt baby\"\n(Welcome to Cali)", "image": "https://images.genius.com/9eeff8d4aa3579798c6d6f74d21fad47.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}