{"songs": [{"title": "On the Real", "album": "Original Demo Tape", "year": "2004-03-30", "lyrics": "[Produced by Marley Marl]\n\n[Sample]\nOn the real, all you crab niggas know the deal\n\n[Intro]\nYeah, finally up in this nigga\nLet's pay homage to Illmatic\nLet's put the crown where it's at 10 years\nNever been done this real by nobody\n\n[Verse 1]\nTo my seed, may I lead you into no greed or evil\nIn the categories of stories I breed my sequel\nYou know the money, blues, blunts, broken 22's\nMonkey see, monkey do, shorty sipping sunny dew\nNow it's V.S.O.P. in a Phantom, mad smoky\nMurder trees, cruising gat in the stash so it won't poke me\nUp in the Trump Plaza, Suite 3010\nDon't make no noise cause we dirty, tell 'em hoes hurry in\nWe got the room lit up with perfume and mad boom\nAnd there's video taping blooming asses on the zooming lens\nRollin on you nondescript niggas, you're marked for death\nLike Colombians with bad coke that gyp niggas\nTilt the dutch, twisted up the uwee if you're skilled enough\nIn Will we trust, salute the dead the nine mili busts\n\n[Interlude]\nThat verse is ten years old, nine and half years old\nStreet's Disciple, the rebirth comin at you this year baby, it's on baby\n\n[Verse 2]\nTo the hood, may this be the day that we pop them bottles\nThis is mandatory, what if there's not tomorrow?\nYou know the murder rate, jealousy, you heard 'em say\nHe say, she say, I'm 'bout cheddar, he don't deserve to make\nSipping clear liquor with niggas, that talk sideways\nListening close, to every word in case they violate\nUp in the projects Apartment 5D\nSpark a lea' it's 'bout the reed, counting everything the block see\nWe 'bout to need to take the corners from them cowards\nGet it on so y'all can move more coke powder, by the hour\nHold in case we gotta rip niggas, loaded\nTeflon coated projectiles'll flip niggas\nFrom ninth grade to lightweight to grams to my mans with guns in hand\nPolice vans, they missed the summers again\n\n[Verse 3]\nYeah, power to the people, death to the phonies\nThis beast to the mic one two check, y'all fed-e-rallies on me\nAnd they look like you approachin me like how you, homie?\nThe F.B.I. see only one problem, they try to slump me\nAfter the young black male cause he makes a lot of money\nSo hustlers make crack sales cause they deprived and hungry\nMy country hates that I could run free state to state with hunnies\nWhile making cake with real golded plate rims on Humvees\nThe bush stroker, the kush smoker, nigga\nJust when you thought it was over look over your shoulders\nI'm 30 now, baby sip drinks and sip 'em slow\nMotto no stress, smoking less than I did befo'\nYou see the kid was broke 'til I spitted vivid expressions\nOf hard living ghetto children, of a lesser God\nReligion was fast women, expensive cars\nY'all witnessin over 10 years, the best of Nas", "image": "https://images.genius.com/ffe91cf8806703f8a4c4cba11c0ceed7.1000x1000x1.png"}], "artist": "Nas"}