{"songs": [{"title": "Higher Level", "album": "Return of the Boom Bap", "year": "1993-09-28", "lyrics": "[Produced by DJ Premier]\n\n[Verse 1: KRS-ONE]\nAfter seven years of rockin', how do you rate me?\nPoorly or greatly? Everybody seems to be goin' for their's lately\nYo mad heads be needin' money\nSo listen very close as I conduct this little study\nSee it's, funny to me, you can watch TV\nAnd give up your life trying to be all you can be in the Army\nNot knowin' your history, you either fight and die or come back home in misery\nYo get with me, I deal with reality\nLoosen your mind to the truth, and don't get mad at me\nNo politician can give you peace\nIf you trust Jesus, why do you vote for a beast?\nEmancipation is long over due\nSo overcome procrastination\nBecause freedom is within you\nFor some reason we think we're free\nSo we'll never be, because we haven't recognized slavery\nYou're still a slave, look at how you behave\nDebatin' on where and when and how and what Massa gave\nYou wanna know how we screwed up from the beginning?\nWe accepted our oppressor's religion\nSo in the case of slavery it ain't hard\nBecause it's right in the eyes of THEIR God\nWhere is our God: the God that represents us\nThe God that looks like me; the God that I can trust\nA God of peace and love; not mass hysteria\nI don't want a God that blesses America\nI could never really vote for the devil\nLet me take you to a higher level\n\n[Verse 2: KRS-ONE]\nTitle, take the title from the Bible we can get there\nRip the title from off the front of the Bible, God don't live there\nToo many inconsistencies, too many mysteries\nPicture the Pope and the Vatican, laughing and drinking and singing and kissing me\nI stand with God whether I'm paid or whether I'm cryin' broke\nI like to ask these politicians would Jesus vote?\nThe way we view God is a freakin' shame\nChurch is to blame. We trust God, but bomb Hussein\nWe simply lovin' the scripture, same scripture that whipped 'cha\nSooner it'll hit 'cha, religion's gettin' richer\nWith that European version of Christ made into a picture\nOur society's gettin' sicker, and sicker, and sicker...\nLike liquor, we are God-Intoxicated\nNot to the true God, but the one the government created\nThe same governments tellin' people to vote\nI pray to God because the people have lost hope\nYou either vote for the mumps or the measles\nWhether you vote for the lesser of two evils, you vote for evil\nPolitics and God are not equal\nBut the education if you don't guard, is really lethal\nPeople have more respect for a holy book\nThan they do for a cow on a meat hook\nBelievers of Jesus be denouncing Satan on every level\nBut every Halloween they're dressin' like devils\nI pray to you for the light you might give them\nMother make them know that you're livin' within them\nYou begin them and end them in silence\nFrankly, if they knew you, they would understand violence\nI pray to you for the Pope and the Vatican\nHave mercy Mother, cause I know that you're mad at them\nThe White Jesus deceived us awhile ago\nAnd Pope Julius the Second paid Michelangelo\nI know this happened in 1519 yet\nThis is the image we can't seem to forget\nVote for God, don't vote for the Devil\nLet me take you to a higher level", "image": "https://images.genius.com/2573d3afb044969d03669dee90d609f7.1000x1000x1.jpg"}], "artist": "KRS-One"}