{"songs": [{"title": "Rata", "album": "N9NA", "year": "2019-04-19", "lyrics": "[Intro: Tech N9ne & Krizz Kaliko]\nRata, rata\nBlocka, blocka, blocka\nAyy, fucking ratas\nKaliko, Kaliko, campos\nWho got day one on the trigger, I do\nReal nigga say\nWho got day one on the trigger, I do\nReal nigga, ayy\n\n[Verse 1: Tech N9ne]\nWhy you gotta do it? (Why?)\nWhy you gotta do it? (Bitch)\nWhy you gotta do it?\nWhy you gotta spew it? (Ayy)\nWhy you gotta spew it? (I don't know)\nThat's so fucking foolish\nIn my book, never been a pardon\nWhen the yapping happens, capping in your jargon\nBabble yells, that'll fail\nI bet you been a tattletale since kindergarten\nHe's punked, we dump the punk, debunked, no sin again\nWe bump P Funk, he slumps, Glee jump, so feminine\nThat's why he's a cop dressed in his block best, but a hot mess\nNever do know how to talk less, so we plot stretch, when you got next?\nTwo in the ten, he doing again\nHe gonna rat on you and a friend, then you in the pen\nHe gonna mix it up and try to put you and the crew in the blend\nHe gonna tell, then the screwing begin\nEl capo debacle, that is what he can offer\nDepend on him and then in a rut he can toss you\nHe claim he down, dirty, and muddy but softer\nThan cotton candy, me and my buddies'll off you\n\n[Pre-Chorus: Tech N9ne]\nAnything go down, bro?\nI don't know, I don't know\nWe just make the sound, yo\nI don't know, I don't know\nYou gon' make these hounds go\nRound your crown, so\nOne, two, one, two, three, ayy\n\n[Chorus: Tech N9ne]\nRata (Rata, rata)\nWe go cuckoo, we go blocka (Blocka, blocka)\nWe go do-do with the chopper (Do-do-do-do-do)\nStomp you like a cucaracha\nSay goodbye to your day, ayy\n\n[Bridge: Tech N9ne]\nKoba, you's a fucking mentirosa (Say it again, ayy)\nKoba, you's a fucking mentirosa\n\n[Verse 2: Tech N9ne & Krizz Kaliko]\nYeah, he a traitor, Joe, he's a hater, moe\nWanna get up in the mix and delay the dough\nMan, I heard he nerdy but he play the role\nOf a killer, iller than I spray this flow\nWhy you got to go and (Spread lies)\nThat's when all my homies (Dead flies)\nAnd that's when all the evil lying ass straight divisive ice up in your (Head dies)\nWhat in the cup string, the cup doohickey?\nWhy you got to be a true sissy when you know I'm carrying a tool with me?\nEverybody know that you iffy\nGonna be on your head in a cool jiffy\nAll I'm saying is the dude's sickly\nYou believe him or not like you view Ripley, I'm gone\nGun on my waist, yeah, gun on my waist\nYou gotta pay 'cause you're taking the food out my baby mouth house nigga, watch what you say\n'Cause if you cross the line (Oh yeah)\nThis not gon' happen one more time\nSay, say goodbye to your day, yeah\n\n[Pre-Chorus: Tech N9ne]\nAnything go down, bro?\nI don't know, I don't know\nWe just make the sound, yo\nI don't know, I don't know\nYou gon' make these hounds go\nRound your crown, so\nOne, two, one, two, three, ayy\n\n[Chorus: Tech N9ne]\nRata (Rata, rata)\nWe go cuckoo, we go blocka (Blocka, blocka)\nWe go do-do with the chopper (Do-do-do-do-do)\nStomp you like a cucaracha\nSay goodbye to your day, ayy\nRata (Rata, rata)\nWe go cuckoo, we go blocka (Blocka, blocka)\nWe go do-do with the chopper (Do-do-do-do-do)\nStomp you like a cucaracha\nSay goodbye to your day, ayy", "image": "https://images.genius.com/8ebb9cdb1a785ebf6dcf120453e6e9aa.1000x1000x1.png"}], "artist": "Tech N9ne"}