{"songs": [{"title": "Here We Go Again", "album": "...And Then There Was X", "year": "1999-12-21", "lyrics": "[Intro: DMX]\nSame old shit dog, just a different day\nYou know how niggas do, when we play, how we play\nIT IS NOT, A FUCKING GAME!\nA man's gotta do what a man's gotta do\nIf it's fuck me nigga, you know it's fuck you\n\n[Verse 1: DMX]\nI kick it to shorty to try to help him understand\nHit him with work, cause yo, that's my little man\nHe asked a few questions bout the game and I told him\nSo when he made a bad move it was my place to scold him\nNever told him nuttin wrong, kept it fair\nDidn't listen, so I might as well have been talkin to the air (damn)\nEverybody makes mistakes, a mistake is aight\nBut if it ain't, I'ma tell you straight, time to say goodnight\nNobody likes to be played, regardless of the relationship\nBut shorty's fuckin up big time, I HATE THIS SHIT\nI'm caught in the middle of, havin love for a lil nigga\nKnowin what's expected of me as a, real nigga\nMy next move is crucial, what do I do?\nHow do I keep it real with shorty in my crew?\nDidn't want to kill him, so instead of puttin the Mac on him\nI did the only thing I could do, turn my back on him\n\n[Chorus: DMX]\nHere we go again..\nSame old shit dog, just a different day\nHere we go again..\nYou know how niggas do, when we play, how we play\nHere we go again..\nA man's gotta do what a man's gotta do\nHere we go again..\nSo if it's fuck me nigga, then you know it's fuck you\n\n[Verse 2: DMX]\nNiggas that I fuck wit, wanna get him dead\nBut I'm cool with shorty's peoples, so I let him live\nUnder normal circumstances, he would be a marked man\nBut I hit him with a grand, just didn't shake his hand\nGo about your business (uh-huh) do what you gonna do\nBe what you gon' be, I wash my hands, I'm through\nI can forgive I just can't forget\nYou're on your own little man don't ask me for shit\nIf you paid attention to what I taught you then you good\nIf I see you again, get it, understood?\nGo 'head before I change my mind 'cause you know you should be dead\n\"I just wanted to say, \"Aight, go ahead\"\nInstinct told me to kill him but the savior is\nI'm a good nigga, plus I owed his peeps a favor\nBut I also knew, the decision I just made\nWent against the rules of the game that we played\n\n[Chorus: DMX]\nHere we go again..\nSame old shit dog, just a different day\nHere we go again..\nYou know how niggas do, when we play, how we play\nHere we go again..\nA man's gotta do what a man's gotta do\nHere we go again..\nSo if it's fuck me nigga, then you know it's fuck you\n\n[Verse 3: DMX]\nI should have, followed my first instinct, cause I knew\nSometimes you gotta do what you gotta do\nNow this nigga's fucking with the competition\nUngrateful motherfucker, should of got him missing\nThis nigga got the nerve, to take my kindness, for a weakness\nGotsta get back on some street shit so I can creep this\nRat, when I act, take one, set him up, to take two\nGet him there, take three, get him done\nWasn't hard for me to get him where I wanted him, confronted him\nBZZZZZZZT, CLICK! There was a bullet in one of them\nFeelin lucky? CLICK, looks like you are\nCLICK CLICK CLICK, luck ain't goin too far\nWhat you did was put on another pair of shoes\nAnd they just happened to be too big\nWhat you did was stupid, real fuckin stupid\nWell shorty I gave you a chance and what did you do?\nThrew it back in my fucking face so fuck you too!\n\n[Chorus x2: DMX]\nHere we go again..\nSame old shit dog, just a different day\nHere we go again..\nYou know how niggas do, when we play, how we play\nHere we go again..\nA man's gotta do what a man's gotta do\nHere we go again..\nSo if it's fuck me nigga, then you know it's fuck you", "image": "https://images.genius.com/57efb548310ed90e73d9200fd01a3e59.630x630x1.jpg"}], "artist": "DMX"}