{"songs": [{"title": "No Other", "album": "Dedication 2", "year": "2006-05-22", "lyrics": "[Intro: DJ Drama & Lil Wayne]\nI'ma tell y'all like this (Yeah)\nI learn something new every day (What it do?)\nMore money, more problems!\nHaha! Ayy, you already know\nI always knew I was gon' make it\nYeah, listen, man\nBut you never know what you gon' go through\nYeah, my nigga, we got this shit\nI'm glad to be here! But sometimes, you wonder\nYeah, ayy-ayy, I tried told 'em\nIs it worth it? But I done dedicated my life to this shit!\nCash Money millionaire!\nIt's nowhere to turn! (Ya know!)\nSo I'm in it for life!\nI can't feel my FACE! Yeah! Yeah! Yeah, yeah!\nAnd this what we do!\nLet's go! Let's go! Let's go! Hahaha! I told em!\nI told y'all! (Shout out to Bun B!)\nPay attention! (Yeah!)\n\n[Verse 1: Lil Wayne]\nYeah, straight up D-Boy Seventeenth ward\nMiss Katrina turned my city to a seashore\nI keep going for them coins like Lyor\nThey gon' either respect me or: E.R.\nBurnin' them bitches like a ci-gar\nPunk, put a hump in your back, they called it Igor!\nWar? This shit is hard, any yard where we are\nWe call that cocaine rice, I got that Condoleezza\nHuh? You fuck with me, chump, I rock your teacup\nI say, before you spend a dollar boy, put up the re-up\nYep! Get up, 'cause we up, foot up and knee up\nIn the game, put up or shut up, I hit your head up\nBukka-bang; the Birdgang and the Birdman J\nLil Wayne, here to hang, other words, here to stay\nFeel my pain! Fireman, I spark in the rain\nI walk through the flames, yeah, all for the change, yeah\nCall it insane but I'm a hustler to the muscle\nAnd them new drop Bentleys look like pussy in the summer\nSo I'm fucking that, hugging that block like I'm loving that\nNever sell a crumb where my mother at—run with that\nYou can come at me for beef and shots come with that\nYour bitch come at me for wood and I'm the lumberjack\nI come in that Similac Maybach, shades black\nLooking like I'm tryna bring yay back, ASAP\nGive it to 'em raw, no Ajax, taste that\nHeh, fuck around and make your face crack\nI know niggas that shoot dope, arms looking like a racetrack\nNigga missed a vein in his neck, his whole face fat\nYou can't take that? Well, I can't take back\nWhere I come from, so I learned how to make that\nYeah, turn that straight to a G stack\nStack up my cheese, now I'm screaming \"Where the keys at?\"\n\n[Interlude: DJ Drama & Juelz Santana]\nBig shout to the Dipset movement! (Trendsetter!)\nShout my nigga DukeDaGod! (Cannon!)\nShout my nigga Hell Rell!\nI can't feel my face!\nTwin, what up?\nI really don't think they ready for this\n(The Aphilliates, nigga! Pay attention!)\nOH!\n\n[Verse 2: Juelz Santana]\nI'm live from, block one, five-one\nWhere my young niggas on the rise to get a name, don't try them\nWayne, I feel your pain and I see your stress\nHow they think your people 'posed to get through Katrina\nOff a FEMA check? (Nope!)\nCoke in the Pyrex (Yup!); dope and the ice, yes (Yup!)\nMind on the highway, road signs, right, left (Yup!)\nAnd that's the mindstate of kids growin' up\nStill they wonder why the crime rate's goin up\nThrow it up: Eastside, Westside, Southside, Northside\nFuck with my money, I torch guys, off guys (Gangsta!)\nHire men, fire men, send 'em to a higher man\n(\"There he go\") Torture 'em: vice-grip, pliers, man\nNiggas turn to tinfoil when they see the iron, man\nPressure bust pipes, I apply it and\nMove like a lion through the jungle, yes\nThere is none higher than me\nDon't slip up and end wind up in the lion's den (rrr!)\nBig body Benz idlin', higher than\nA chick that flight-attend or Air Force flyer, man\nBad bitches, I fly 'em in, fuck 'em\nSend 'em back home hyped, feeling like they on nitrogen\nJust call me the Pied Piper, man\nStill get the coke through the pipeline\nThen off to the piper stem (Piper stem)\nAnd I'm still getting paper back in rubber bands\nI still got paper bags coming in\nI still got that mattress with the paper bags under it\nComic books, Playboy baby mag under it, still!\nI still got ties with my guys who don't speak no English\nThem vatos, they got those cheapest (Cheapest)\nGot no green card, got no visas\nAnd got those Pablo features (Just watch!)\nThey drop off and pick up; I pick up then drop off\nThen drop off what's picked up, and then what? I do it\nGangsta Gri-zillz!\n\n[Outro: DJ Drama]\nAnd like that, we gone!\nI told y'all!\nI'm so dedicated!\nNothing can take me out my zone!\nAMG!\nIf you support the movement, then we dedicate this to you\nDedication 2!", "image": "https://images.genius.com/d3b5f479408c61bed346754e1bb3f8ad.1000x1000x1.png"}], "artist": "Lil Wayne"}