{"songs": [{"title": "Are You Looking At This", "album": "Never Forget", "year": null, "lyrics": "[Intro]\nRun, run, run, run...\nWill you stay or will you run\nWhen you looking at this\n\n[Chorus]\nI know you young but are you looking at this\nI know you got dumb but are you looking at this\nYour day is gonna come when you looking at this\nWill you stay or will you run when you looking at this\n\n[Verse 1]\nYou cannot see we now free, we get cassette back\nSo everytime I get the microphone I gotta bless that\nEverytime I speak the truth they hopin' you forget that\n9/11 truth got proof, you know we rep that\nThe war was started on a lie - did you forget that?\nPolitics is all about money and we accept that\nVoting is like joking with rights we'll never get back\nThis a different type of rap of what you might've guessed eh?\nFresh rap - put it on your tongue, man, test that\nPeople always askin' and passin' where KRS at\nI be teachin', preachin' and speakin' a little less rap\nEducators, straight from the pavement, me nah gon' left that\n\n[Chorus] x2\n\n[Verse 2]\nToo many rappers talkin' 'bout now they the best at\nWhile KRS-One is at levels they'll never get at\nBeat bitin', fakin' the funk - dudes respect that?\nAll these lies hitting your head, right where you rest at\nThey take your mind off the truth and put it where the sex at\nNow these rappers doing R&B - forget that\nIn the game I'm bright, I'm skipped twice, they left that\nCash - I don't stress that, the stage is where I'm fresh at\nCats want cars but don't know where East or West at\nSteering themselves right into where the stress at\nTheir own words got 'em sick and right there where the mess at\nTalking like demons but wanting God to bless that\nTake a minute, step that\nThink a minute, digest that\nIt's not every day a teacher speaks and you get that\nDown goes the devil - ra-ta-ta-ta-ta\nThe American presidency is for sale and you can check that\nYou think one man, one vote really elects that\nNews with views? Where's the free press at\nDon't let 'em take your mind and put it where the rest at\nEdutainers, straight from the pavement, me nah gon' left that\n\n[Chorus]", "image": "https://images.genius.com/8219c6b423edb4d95b5c842a51f3b31e.640x480x1.jpg"}], "artist": "KRS-One"}