{"songs": [{"title": "Armpits", "album": null, "year": null, "lyrics": "[Hook: Da Pak]\nNiggas, bitches, pimps, tricks\nWhoever you with, let me see them armpits\nMusty or dusty, ashy or nasty\nWhen your paths meet, let me see them armpits\nHey, yo\nHit somethin'\nPop somethin'\nMove somethin'\nRock somethin'\nSpit somethin'\nCop somethin'\nDo somethin'\nLock somethin'\nYou want your life? The lift your arms up!\nNigga put your palms up, get them guns up!\n\n[Verse 1]\nCome on over ho, we got weed in the Rover\nIf you don't get your hands up, you can bleed in your shoulders\nI'm the holy ghost ask them Jehovahs\nI leave no witness, nobody but the chauffeur\nYou might see me on the sofa with Oprah\nNope, you gon' see me on the screen\nFor catchin' a 3 to 15 for this cream\n?\nI'm doing hit-runs with my hit-team\nSomebody get shot, nobody get seen\nGirl you a party ho, but that fit look nice on your body though\nI don't party though...\nBitch! I'd rather stick niggas for their money\nAnd baby, this ain't a party song\nBut I'll hit hoes with the Bacardi long\nDick stroking, pussy bust that shit open\nBig pimping, big scoping, your tip closing\n\n[Hook]\n\n[Verse 2]\nWe backed up in this Expo\nDrugged, gats up\nTime ticks to conflict, the bomb hit\nExplosion, blows with yo neck slow drips, holes\nGet 'em up are you finna win or what?\nHands, get 'em up\nIt's too clutch, by the guts, send 'em up\nAs far as them blocks go, we got those, hit 'em up!\nPopped a mo', let's go henny in the cup\nOptimal, make 'em stop, drop and roll\nWith the hot flows, spot clothes, gotcha dough\nShot ya ho, dragged her out the hospital\nUnlock the door, pop the trunk, lock the fo'\nRidin' in the drop-top slow, copped the dro\nSpot the popos but they only obstacles\nJump from the pot smoke, won't stop the show\nGot the dough, lash out ?\n?, C'mon!\nYeah, yeah, uh, what? Yeah niggas, what? What? What? Uh, What?\n\n[Hook]\n\n[Verse 3: Lupe Fiasco]\nHey, yo\nI pop something, write for a little; drop nothing\nUnarmed? Nuh-uh, lights on 'em pistols stop fronting\nWhile y'all chase birds like Road Runner for phone numbers\nI be in the back with bone crushers and known hustlers\nBig bill niggas, big deal niggas\nOne call you're killed, all ill niggas\nWant beef? Better be extra sure\nMy niggas be under your floors\nSo stay on your toes like pedicures\nMy 16s make other rappers quit dreams\nTry to sing, enlist in the marines\nZero tolerance, I leave heroes hollering\n?\nFeel me? 'Course not\nStill be on top\nOn the rock, bill me for your spot, for real B\nHonor that\n18, longer gat, corner cat, stronger raps\nWhen Lu on, who gon' be stopping that?\n\n[Hook]", "image": "https://images.genius.com/b67b7f5bfbd7eb8c5c334fa8b05a2432.400x400x1.jpg"}], "artist": "Lupe Fiasco"}