{"songs": [{"title": "Giant Size", "album": "The PJs: Music from & Inspired by the Hit Television Series", "year": null, "lyrics": "* unedited lyrics; The PJ's soundtrack is clean\n\n[Intro: Chip Banks of American Cream Team]\nWhat? Aiyyo, y'all wanna do a track wit us or some shit?\nWe the billion dollar boys club\nWhat you got a hundred thousand for us? The fuck's that?\nThree rings and a hair cut or some shit?\nAiyyo, American Cream Team, baby\nHeavy hitters, New York City Giants\nGamble for plots and 4 better for spots and things of that nature\nPop off\n\n[Superb of American Cream Team]\nI don't rock wit hoes, I puff Optimos\nYour label ship gold, but only copper sold\nPerb got flows, everybody and God knows\nFuck a bitch for two dimes, she got to cop those\nUsed to be a thug, now he wear cop clothes\nTry to come to the hood and we shot hoes\n\n[Chip Banks of American Cream Team]\nI don't care who you got a deal wit or who you chill wit\nBanky'll run up in your session and shut you down on some real shit\nTill the Chef be like (Chill, kid)\nThat's word to Abola Perrione, dem not know who they deal wit\nChef Banks, uh-huh, slash Banky\nGot the whole world callin Flex tryin to transtate me\nSaid New Jack City 2, Banky B. Nino, push a 2000 benz-ino\n\n[Killa Sin of Killarmy]\nThese rap icons, mass spit fire out of cons\nFuck a bigon, rely on ion in my python\nWe squeeze off, long disc when we piss\nResort this, gun powder coverin wrist is blastphemist\nShotties say, \"Fuck!\", cursin my name\nKnowin damn well, I'm hurtin the same\nWhat part of the game you playin?\nKid, I'm sayin, yo, three months ago you was on\nYou fallin short now, chasin a don, you're money ain't loned\nFaggot fuck, bag him, stick him in the back of my truck\nStrip him and smack him up for actin up\nBe slitherin, hit him in the rips again\nBroke the code of honor that we livin in\nDepleted the whole click, is never when\nBut never that\n\n[Chorus: Raekwon]\nAiyyo, there it go again, same shit, just rep\nShow me ya holdin kid, control ya rep when we rollin\nWorldwide, niggas look live, collection cream by a land slide\nSettin up to son, won the grand prize\nStand up, why? Where it came from? Accord and the 5\nWhere the name from? Read the Rob, yo\nYo, while we handglide, slang lye\nChill, ya better recognize, cuz it's cut out for big shit, Giant Size\n\n[Polite of American Cream Team]\nYo, we from the ghetto, the land where everythin is real\nNights was tough, days came hard as steel\nStill we played the field like players witout contracts\nBroke the trends and the fans far beyond that\nComin to America, now we tradin places (uh-huh)\nNew faces in the hood, and they racist (uh-huh)\n]From all the squeezin, they callin the precinct\nWe could battle in ya PJ's or battle in the becon!\n\n[Raekwon]\nI kick vocals at the top of my lungs, drunk\nPlayin cards, young start wildin on dunns with guns\nRemmy doctor, old man jams with voice of Hoffa\nChill, slap shorty up at the opera (Battle in the becon!)\nUncle got the Kangaroo, rock the Kangaroo, boo\nStart cursin out white boys shoes, you wild\nThirstin Howl wit a growl start barkin at crowds\nHe actin like he got shark skin now\n\n[Kingpin of American Cream Team]\nI lace my hookers with G-String, Liz Clairborne\nDon the King, hustlin, nigga Don I mean\nExquisite, a radiant, brilliant chemist\nAmerican Cream Team, billion buck spenders\nStrip boutiques, advantage, get move on\nWe too strong, the menace, nothin to lose con\nYachts we cruise on, money that's too long\nPull out a check book, coupon, purchase the Yukon\n\n[Chorus]\n\n[Outro: Raekwon]\nIt's never been a game, stop playin, stop playin (repeat to fade)", "image": "https://images.genius.com/c1a79ce421e047f1559b49f74bf265a5.300x300x1.jpg"}], "artist": "Raekwon"}