{"songs": [{"title": "More & More", "album": "DIME TRAP", "year": "2018-10-05", "lyrics": "[Intro: T.I.]\nSome shit never change, nigga\nAha, ayy, yeah\n\n[Verse 1: T.I.]\nFrank Muller, put one, two to your medulla\nOblongata, there is none hotter\nI'm so in love witcha girl, it's just somethin' 'bout her\nI'm havin' fun with her, you better come get her\nI fuck her face, bust one on her concealer\nAnd make another girl lick it off, I'ma dumb nigga\nSince a young nigga, I've been a made man\nMy bitches come with fat ass and a spray tan\nSpend a whole bag, then run up more\nI won a 100K shootin' dice, 10 to 4\nPlaying poker, put the sack up, go all in\nLose, double down, win, go to Dubai\nIf you wanna win big, the risk gotta be high\nWant them bad bitches all on your dick, you gotta be fly\nYeah, he cool but he not a T.I., I will be damned\nWatch him do designer drugs by the gram, get what they asked for\nLife be action packed but don't nothin' distract from the cash flow\nDope boy fashion, avoid fuck boys, hate 'em with a passion\nI'm sucka-duckin' gettin' money, a hard dick all a bitch got comin', yeah\n\n[Chorus: T.I. & Jeezy]\nAll I know is more & more (aha)\nGoin' to the grave 'fore I'm going broke\nDo it all against the odds, baby, lord knows\nPuttin' on, homie, that's what I was born for (You know what this is)\nHunnid bands (Yeah)\nAll I know is more & more (Aha) (Wassup)\nGoin' to the grave 'fore I'm going broke (Tip, I got you, nigga)\nDo it all against the odds, baby, lord knows\nPuttin' on, homie, that's what I was born for (You, know what this is)\nHunnid bands\n\n[Verse 2: Jeezy]\nDope boy, bitch I ain't got to say it again\nIt's the king and the don, you gotta play it again\nDrop the top, lace your boots up, grab your scale\nAll you see are triples Es like you're weighin' a whale\nSee, I'm straight up out the gutter, it ain't hard to tell\nFlex, made that yellow butter, it ain't hard to sell\nThirty rounds up on my hip, make it hard to walk (Damn)\nCaller from a private number, make it hard to stalk\nDrop the top on a 'Rari, nigga, I'm so made\nLeft the Dawn in the Bend, Dade, I'm so paid\nAnd she came to the mansion, yeah, the bitch got slayed\nSkinny dippin' in the pool yeah, lil bitch got saved, huh\n\n[Chorus: T.I. & Jeezy]\nAll I know is more & more (Aha)\nGoin' to the grave 'fore I'm going broke\nDo it all against the odds, baby, lord knows\nPuttin' on, homie, that's what I was born for\nHunnid bands (Yeah)\nAll I know is more & more (Aha) (More & more)\nGoin' to the grave 'fore I'm going broke\nDo it all against the odds, baby, lord knows\nPuttin' on, homie, that's what I was born for\nHunnid bands\n\n[Verse 3: T.I.]\nAll I know is get this check and the respect\nFly the family from Atlanta to Hawaii and back\nWhy would you act slow? No, I'm not an asshole\nGet your ass blown smooth off for doin' too much\nHad it with the other nigga that was tryna move up\nIt is what is, ain't no way to make a do-up\nBetter know that we was sellin' crack until we blew up\nWas trappin', everybody knew us and then the mill' came\nDone been through so much shit that I'm numb to it, don't feel pain\nJust heard Urban Legend the other day and it still bang\nGet a hustle (Get it)\nMake it double, want some weight, you need some bigger muscles (You need it)\nFinesse the plan, then work your way throughout the filibuster\nTryin' not to kill a sucka, that's a hard job (Ya dig)\nBut I'ma still try my hand with a car shark\nBoy, I've been gettin' it out the mud since 14, makin' it do what it does\nTrue trap nigga\n\n[Chorus: T.I. & Jeezy]\nAll I know is more & more (Aha)\nGoin' to the grave 'fore I'm going broke\nDo it all against the odds, baby, lord knows\nPuttin' on, homie, that's what I was born for (You know what this is)\nHunnid bands (Yeah)\nAll I know is more & more (Aha) (More & more)\nGoin' to the grave 'fore I'm going broke\nDo it all against the odds, baby, lord knows\nPuttin' on, homie, that's what I was born for, uh huh\nHunnid bands\nAll I know is\n\n[Outro: T.I.]\nSome more and some more is all I know, man\nYou know what I mean?\nBig-big shit poppin' for a long time, you understand that?\nHey, we do this shit for bread and meat; we don't win then we don't eat, you understand?\nYeah, yeah, talk while we spit is what we do all day, man\nI mean, try to be humble as I can be\nBut truth be told, none of you nigga can't fuck with me, you understand that?\nIt's the motherfuckin' king, nigga\nCome hell or high water, accept no substitution\nStay solid all the way through it\nFuck what a hater got to say\nWhat I did, can nobody undo\nBuild this shit with my bare hands, man\nBare witness to the greatness\nIt's upon you\nThis is the Dime Trap", "image": "https://images.genius.com/762209f629de50995145f116f95b5ea9.750x750x1.jpg"}], "artist": "T.I."}