{"songs": [{"title": "The What (Unreleased Version)", "album": "The Notorious B.I.G. - Ready To Die (The O.G. Edition)", "year": null, "lyrics": "[Verse 1]\n[B.I.G.]\nAll it's takin'\nIs some marijuana and I'm makin'\nMC's break fast like flapjacks and bacon\nBack spins to windmills. Who's still the gin drinker?\nIll thinker explodin' when the paper hits the ink\nGrab your gangster chronicles and turn to page 6-6-6-\nThe holocaust, BIG the merciless\nHurry up and close the gate when my freestyle escapes\nI'm giving young minds statutory rape\nMothafuckers thought I slip bust my lip, right?\nYou didn't know the extra clip's on my hip\nYou don't want none of me N-O-N-A-M-E-(T-H-O-D Man)\nDon't tempt me, you don't wanna fuck with M-E\n\n[Method Man]\nHere I am, I'll be damned if this ain't some shit\nCome to spread the butter lyrics over hominy grit\nIt's the low killer death trap, yes I'm a jet black ninja\nComin' where you rest at, surrender\nStep inside the ring, youse the number one contender\nLookin' cold booty like your pussy in December\nNigga stop bitchin', button up ya lip and\nFrom Method all you gettin' is a can of ass-whippin'\nHey, I'll be kickin', you son, you doin' all the yappin'\nActin as if it can't happen\nYou front and got me mad enough to touch somethin'\nYo I'm from Shaolin, Island, and ain't afraid to bust somethin'\nSo what cha' want nigga, ya won't nigga\nI got a six-shooter and a horse named Trigger\nIt's real, ninety-four, rugged raw\nKickin' down your god damn door (and it goes a lil' somethin' like this)\n\n[Chorus: Method Man & Biggie]\nFuck the world, don't ask me for shit\nAnd everything you get ya gotta work hard for it\n(Honeys shake your hips), ya don't stop\n(And niggas pack the clips), keep on[Verse 2]\n\n[Method Man]\nVerse two, comin' with that Olde E brew\nMeth-tical, puttin' niggas back in I.C.U\nI'm lifted true, you can bring your wack-ass crew\nI got connections, I'll get that ass stuck like glue, huh\nNo question, I be comin' down and shit\nYo I gets rugged as a motherfuckin' carpet get\nAnd niggas love it, not in the physical form but in the mental\nI spark and they cells get warm\nI'm not a gentle, man, I'm a Method, Man!\nBaby accept it, utmost respect it and\n(Assume the position) Stop look and listen\nI spit on your grave then I grab my Charles Dickens\n\n[B.I.G.]\nWelcome to my center\nHoneys feel it deep in they placenta\nCold as the pole in the winter\nRicochet off the vertebrae then splat where your heart be at\nNow starts the cardiac arrest Where's your vest?\nYou forgot now you slowly drop cuz your heart stopped\nBeaten, your bitch-ass crew is retreatin\nNiggas left you, fucked up passed out with your ass out\nPockets ran through stripped with your brains bashed out\nNiggas wanna do me slugs just run through me\nLike trees to branches\nCliffs to avalanches\nIt's the praying mantis\nDeep like the mind of Farrakhan\nA motherfuckin' rap phenomenon, plus\n(I got more Glocks and techs than you)\nI make it hot (Nigga won't even stand next to you)\nNigga touch me you better bust me\nTree times in the head\nOr motherfucker's dead, ya thought so\n\n[Chorus: Method Man & Biggie]\nFuck the world, don't ask me for shit\nAnd everything you get ya gotta work hard for it\n(Honeys shake your hips), ya don't stop\n(And niggas pack the clips), keep on\nMotherfucker uh\nFuck the world, don't ask me for shit\nAnd everything you get ya gotta work hard for it\n(Honeys shake your hips), ya don't stop\n(And niggas pack the clips), keep on", "image": "https://images.genius.com/97e6c354b8368e36130dd912210fd93d.1000x992x1.jpg"}], "artist": "The Notorious B.I.G."}