{"songs": [{"title": "Shots fired", "album": null, "year": null, "lyrics": "Jadakiss: D-Block, Double R, Time Is Money...\nNiggas is cowards. Load up nigga\nStyles P: Let's go\n\nJ: Yo, we woulda been killed you\nS: Why even bother, nigga?\nJ: You ratted on Prim\nS: He prolly ya father, nigga\nJ: In New York you was never a don\nS: Niggas knew you was a rat when you made \"Ghetto Qu'ran\"\nJ: Had names in the daily news\nS: Shot you nine times\nJ: You could barely move\nS: D-Block got the tenth shot\nJ: Fuck it...\nS: Let's air the dude\nYou dissed Ja Rule\nJ: Took his style and ran wit it\nS: Singin' on the hooks the same\nJ: Bitch you done Scanned wit it\nS: And don't try to diss a D-Block crook\nJ: Fuck sales, you hear your boss on a D-Block hook\nWe do shows in New York\nS: Nigga we not shook\nJ: If it's war get the four\nS: Put his head to the floor\nJ: So we can show his faggot man how his Reeboks look\nS: And you could all die in an instant\nJ: For instance...\nS: Tre pound leave ya ass smokin' like incense\nJ: The four pound'll make ya man smoke like a Winston\n\n[HOOK]\nShots fired\nJ: Man in a hole nigga\nShots fired\nS: Tell G Unit to roll, nigga\nShots fired\nJ: Nine times? The tenth one'll do it to him\nShots fired\nS: Somebody better tell him we'll ruin him\nShots fired\nJ: 50 keep runnin' his lips, nigga\nShots fired\nS: Damn, you already been hit, nigga\nShots fired\nJ: We don't give a fuck if you rich, nigga\nShots fired\nS: Get the fuck off our dicks, nigga\nShots fired\n\nS: Get Rich or Die Tryin'...\nJ: Was a classic\nS: Now you rich and you tryin' to die...\nJ: You'ze a dumb bastard\nS: We gon' be hesitant, can't see the beast\nJ: And you roll wit more police than the muthafuckin' president\nS: Bitch nigga, he get ill\nJ: Like we ain't know he cock-blocked Game out his Reebok deal\nS: Plus he had the label like Don't let him drop\nJ: Let my niggas drop first so they won't let it rock &\nS: Bitch-made nigga\nJ: Got a problem wit us? Come see us wit a gun\nS: Or a switchblade, nigga\nJ: Damn, we thought you knew\nS: Got ya shit sprayed, nigga\nJ: You been pussy since that sheepskin\nS: Fifth grade nigga\nJ: Niggas stole ya bike...\nS: Cuz you was pussy\nJ: Tried to take ya life...\nS: Cuz you was pussy\nJ: Now we gon' take ya mic...\nS: Cuz you was pussy\nJ: Left the hood and hired the cops\nJust your luck\nS: We the ones dat fire dem shots\n\n[HOOK]\n\nJ: You wasn't real wit me\nS: Now you gotta deal wit me\nJ: I'mma get you the same tombstone as the real 50\nS: For all of y'all who hear us\nThe bigger the nigga is, the more pallbearers\nJ: Y'all be wit the cops, we the 44 wearers\nS: Y'all scared of the block, same ones we tear up\nDon't get near us\nJ: You could never worry me\nS: I know you been to jail...\nJ: You also been to therapy\nS: In the hood 'til they bury me\nJ: I heard you did a Shock bid in Lakeview\nIf my man woulda knew then he woulda ate you\nS: How bout...\nJ: He was in the bunk right next to you\nAnd I coulda made him put a L-O-X on you\nS: All you niggas together ain't got enough bars for us\nHeard a bunch of shit from y'all, none of it was hard to us\nJ: Kill his ass if there's no cops & he's not wired\nS: You can't come back to New York, nigga\nShots Fired\n\n[HOOK]", "image": "https://images.genius.com/34d1815281afeb502b98075367058136.453x453x1.jpg"}], "artist": "Jadakiss"}