{"songs": [{"title": "Hands In The Air (Bitch Nigga)", "album": "Gangsta & Soul", "year": "2009-05-14", "lyrics": "[Verse 1]\nBack up Q back in town, I'm next up\nDraked up, with ya kicks laced up\nNiggas can't face us, hoes want to chase us\nCruise through the city no worries nigga I'm untouched, uncut\nTop dawg money shit, stay with a money clip\nUSA today olympics shit the way my money flip\nDouble back, got a nigga trippin off a double stack\nHundred racks, spend it ain't nothing, toying my money back\nEasily, I'm hot, imagine what my temper be\nWith out a doubt I'm cold blooded so it balance out\nThese niggas I'm calling out, home of these fake ass wannabe rap niggas, wanna be thug niggas\nFace on it too nigga? what you a fool nigga? I'll give you the blues nigga\nI carry the flu nigga, the locest G, top ranking nigga\nIts GED fresh outta jail and I'm already in your OG, me nigga!\n\n[Hook]\nNiggas always talking the young clap\nWell lil muthafuckas I'm bout that, bitch nigga, bitch nigga\nWe back a fourth with the shit, nigga\nWe can settle this with the fists nigga, bitch nigga, bitch nigga\nI swear to god that you a bitch nigga\nKill your mans over a bitch nigga, bitch nigga\nYeah, yeah yous a bitch nigga, bitch nigga! Nigga!\n\n[Verse 2]\nSee I ain’t really into that yiggity-yak talkin', my giggity-gat spoken\nYou laying in that coffin, doing this shit often\nMy nigga 50 era, I'm causing terrors to any rapper that active and claiming they factors\nBring ya to the light, while punching out your sight\nGet it right, rock the microphone yeah I spit it tight\nEasily, ain't no other rapper fucking with me evenly\nTwo advanced, gucci belt while I'm sagging my pants\nRap confession, yall hearing my progression\nSeen the most money in my life in a recession\nI'm that real, plus I make the music that kids feel\nHope I ain't the reason they pop steel, but anyway\nYou niggas get popped still, leave a nigga mouth with a chopped grill\nGED nigga we that ill, I'm lyrically in it, I'm in it to win it\nMoney, we spend it, sins is repented\nLittle nigga, I’m finished, gone\n\n[Hook]\nNiggas always talking the young clap\nWell lil muthafuckas I'm bout that, bitch nigga, bitch nigga\nWe back a fourth with the shit, nigga\nWe can settle this with the fists nigga, bitch nigga, bitch nigga\nI swear to god that you a bitch nigga\nKill your mans over a bitch nigga, bitch nigga\nYeah you, yous a bitch, bitch nigga! Nigga!\n\n[Verse 3]\nIf you're feeling real good, put your hands in the air\nHands in the air, hands in the air!\nAnd if you feel like you a muthafuckin, motherfuckin player\nHands in the air, hands in the air!\nAnd if you really don't, really don't, really give a care\nHands in the air, hands in the air!\nIf you feel what I'm saying, keep your hands in the air, hands in the air\nHands in the motherfucking air!\n\n[Outro]\nFuck you niggas man, Chea!\nQ!\nQ!\nT-D-E, Nigga!", "image": "https://images.genius.com/5be8aea8d73e30772a3a8919cc421f1f.500x500x1.jpg"}], "artist": "ScHoolboy Q"}