{"songs": [{"title": "Banned From TV", "album": "Mr. Philadelphia", "year": "2010-01-01", "lyrics": "[Verse 1: Meek Mill]\nYessir!\nAye look, I took my rap money and I went and bought some kilo(s)\n4th quarter, tie game, and one for the free throw\nLetric bill audemar, lighting up like PEECO\nWord to my homies locked, \"free my nigga Reek\" flow\nWe go, anywhere I wanna, it's my ego\nJewelry on and off, all I know is ball (ballin)\nGlock 4pound'll put your brains on the wall\nI'm trynna buy them hammers TIP had, you niggas at the mall\nLet me tell you why they hatin', cause they dead pot\nAye weezy tell them niggas kill they self, head shot\nFred Flintstone ya bitch, I make her fuckin' bed rock\nSo much ice up in my Breitling made my fucking band pop\nEeny, meeny, miny, moe, pick a fucking rapper out\nAnd I bet they ain't in to half that shit they say or rap about\nI be really into that, flowing with my rachet out\nEvery time I'm in the club, know we bring them ladders out (ladders)\nDon't you hate a rapping nigga screaming he ain't gotta rap?\nSpitting all that bullshit you spiitin, (tsk) gotta trap\nWatching for them boys in the khakis and the alphabet\nCause they don't wanna see a young nigga make it out the jack\nOut the hood, out for good, hating nigga I been good\nThe coupe like the Bat Mobile, my bitch playin Robin Hood\nKobe told me \"get 'em\" and I told him that \"I got 'em good\"\nYou ain't never been there bitch, why you actin' hollywood?\nKerosene heater flow, swagger on a milli'n (swagger)\nEvery time I'm on some shit they be like \"you killin' 'em\"\nHe said I ain't on that shit, Black Eyed Peas \"well Will I am\"\n5 percent on everything so you don't see what wheel I'm in\nOr you don't see what bitch I got\nIce up in my wrist and watch\nI'mma cloud hopper, prolly take me to the top\nDrama, take me to my Glock so I can get strapper\nAnd I be with that white boy, fucking with that Casper\nLaughter, cause I can play around and shout you niggas down\nLawnmower with that semi, cut you niggas down, buck you niggas down\n\"Who you be with??\" Talk about about me, when you see me it's the remix!\nI said I'm fly as fuck, get that purple, light it up\nThink it's sweet then try your luck. Need a murder? Hire us\nShooters, they always on deck. Just waitn' to fire up\nSend them at you niggas, they gon' listen like I'm wired up\nTell that ho to get a grip, \"bitch go pick them pliers up\"\nCatch me in an SRT, coolin burn them tires up\nWe banging that Flamerz 3, shut 'em down and light 'em up\nI hear you niggas got that work, we call ya phone and line you up\nCash rules everything around me, and near me\nTell them hoes I don't do singles, they can share me\nI don't wanna talk or do business if you scary\nLil niggas shoulda never watched Tom and Jerry (rat!)\nBreak a brick down, cop a whip, get my jewels up\nPay a couple bills, lay low, and then a crew cut\nCatch me in the vip popping bottles with my tool tucked\nHating ass niggas make me sick, fuck my mood up\nSwagger on a million, billion, trillion\nSomewhere on an island like Gillagen\nWrist wear, lookin' like it's made from Jack & Jill and 'em\nWhole band bust down, big rocks, killin em\nMy city I'm bigger than the mayor is\nAsk the streets, say I'm everything I say I'm is\nI went to jail, came back like A.I. did\nAnd put my city on the map real rap! (Mr. Philadelphia)", "image": "https://images.genius.com/02fee89da0cebb67c2da7a31768e15c2.500x500x1.jpg"}], "artist": "Meek Mill"}