{"songs": [{"title": "Letterhead Remix", "album": "The Unplanned Mixtape", "year": "2011-04-24", "lyrics": "[Verse 1: Sapient]\nI've been obsessed with words ever since I was a little buck\nThen I grew bigger and figured drawing pads weren't big enough\nI wanted to use a wall, but in school was taught not to\nAnd that graffiti was the root of all evil\nIt's just letters and making them unnatural shapes\nSo clean caps, surgical masks is actually sayin' activate\nTo coat our empire\nLiftin' mad cans of paint from Fred Meyer's\nEmpty 'em out under bridges and walls of alleyways\nGiving the graff task force a sour taste\nThe same flavor that makes haters salivate\nI was more gully as a minor, caught a felony, so nowadays\nI don't struggle to prove nothing to you\nI get a head full of letters, I'm cutting 'em loose\nUp in the booth, cousin, it ain't a gift, it's a habit\nWhether good or bad, I won't regret it when I'm looking back\n\n[Hook: Sapient]\n‘Cause I'm a letterhead\nI'm a letterhead\nSo don't sweat the technique\nWhen I represent me; get 'em!\n\n[Verse 2: Illmaculate]\nLunch time, I was tryin' to bring that realness back\nFuck the lunch line, 'cause I ain't have no skrill or scratch\nI was on the way to Fred Meyer's just to fill my bags\nSteppin' in the home improvement section with my sticky hands\nThat's why I got these baggy pants: to conceal the stash\nBut undercover security can't conceal his badge\nI know every single camera that this building has\nAnd I racked so many cans that I'm almost feelin' bad\nThat's exactly what a bad look ain't\n‘Cause it's quite good, like the Backwood taste\nAnd I never stole a Snickers, but I have took paint\nSo, hello, my name is pickers in the blackbook, thanks!\nShit, I'd be admired if I was tryin' harder\nBut I'm a riot starter, beef igniter\nJust a street writer, but I hope to die a martyr\nFreedom fighter, with a stolen Pilot marker\n\n[Hook: Illmaculate]\nWhy you got all that spray paint on your finger tips?\n‘Cause I'm a letterhead\nI'm a letterhead\nSo don't sweat the technique\nWhile I represent me\n\n[Verse 3: Macklemore]\nI was just a kid in Seattle, doin' kickflips in a flannel\nWith some fat caps, I racked off midget enamels\nIn Cali, they rhyme \"Shelltoes\" with \"Melrose\"\nMy posse was on Broadway, scribin' on the metros\nGettin' pound by the bus driver — \"Hell nah!\"\nI was a letterhead, my life was graffiti\nLetters I lived, I put pride in that mean street\nAdventures to your ribs, I'm not goin' to the precinct\nYou can buff me, you can cuff me, you can't stop me\nI'm young, cocky, gettin' up with my sharpie\nMichelangelo with the concrete\nThat little ball in the paint can\nWas the metronome to my heartbeat\nI put my freedom on the line for the letters on the walls\nShubu, patriot, flat black up in my palm\nCherry red in my blood, I bleed the ink through my arms\nIt's like America: bombin' buildings and not gettin' caught\n\n[Hook: Macklemore]\nNope, I'm not gettin' caught\n‘Cause I'm a letterhead\nYes, I am, I've been tellin' you that\nDon't sweat the technique\nWhile I'm killin' these beats", "image": "https://images.genius.com/271e7551d2ccbead25e01c36162352d0.900x900x1.jpg"}], "artist": "Macklemore"}