{"songs": [{"title": "Therapy", "album": "Faces", "year": "2014-05-11", "lyrics": "[Intro]\nJust so Pittsburgh, man\n\n[Chorus 1]\nSo how's it feel?\nCan you tell me how it feel?\nNow it's real\nSo can you tell me how you feel?\nCan you tell me how it feel?\nCan you tell me how it feel to come and hang around a motherfucker like me?\nHow it feel to come and hang around a motherfucker like me?\nHow's it feel? So can you tell me how's it feel?\nCan you tell me how it feel to come and hang around a motherfucker like me?\nHow it feel to come and hang around a motherfucker like me?\n\n[Verse 1]\nSaid, \"Baby, what you doing tonight?\nWe could watch the world get ruined tonight,\" living this life\nGot you flexin', feelin' cooler than ice, let it melt\nAs we follow all the stupid advice, and I don't usually like\nTo be this honest witchu, I must have lost the picture\nGimme a box of swishers, room full of obnoxious bitches (Got you)\nWhy you lyin' to me? Just grab your ladies\nThat Mercedes all kinds of roomy, and when the time's are gloomy\nHit me up, I can make you feel like the perfect girl you wish you was\nGivin' you that feeling like when Christmas come\nI just take all of my problems, throw 'em in a blunt\nLight 'em up and watch 'em float away, ayy\n\n[Pre-Chorus]\nWatch 'em float\nI can take you anywhere you wanna go\nCan you dream?\nCan you tell me how's it feel?\n\n[Chorus 2]\nHow's it feel? How's it feel?\nHow's it feel? Can you tell me how\nIt feel to come and hang around a motherfucker like me? (How's it feel?)\nHow it feel to come and hang around a motherfucker like me? (How's it feel?)\nHow's it feel? How's it feel?\nCan you tell me how it feel, how's it feel?\nHow's it feel to come and hang around a motherfucker like me?\nHow's it feel? Yes\nHow's it feel?\n\n[Verse 2]\nOkay, said\nI'm back on these rap songs, feeling they're never gonna last long\nGot a shortcut, baby? I'll pass on it, my dick, throw your ass on it (Blaow)\nPass the time, ask for my alibi, tryna tell you I need that\n(I need that) Just relax (Just relax)\nPut that money in my motherfucking hand\nTake another pull, Goddamn\nAin't part of the plan, like a car in a van\nI'm rollin', I'm feelin' good, I'm golden\nMy man, let me just do my dance\n'Cause, motherfucker, this my jam, said this my jam, this my jam\nHow many times you 'bout to let them opportunities pass you by?\nI used to be a pretty passive guy, since before I was a Goddamn mastermind\nIn that castle of mine, I came up in half the time as these lame fucks\nYou can't rush that greatness, that mansion where my maid lives\n\n[Pre-Chorus]\nLike wow, watch 'em float\nI can take you anywhere you wanna go\nCan you dream? (Dream)\nCan you tell me how's it feel?\n\n[Chorus 2]\nHow's it feel? How's it feel?\nHow's it feel? Can you tell me how\nIt feel to come and hang around a motherfucker like me? (How's it feel?)\nHow it feel to come and hang around a motherfucker like me? (How's it feel?)\nHow's it feel? How's it feel?\nCan you tell me how it feel? How's it feel?\nHow's it feel to come and hang around a motherfucker like me?\nHow's it feel?\nHow's it feel? Ha\n\n[Post-Chorus]\nHow's it feel?\nHow's it feel?\nHow's it feel?\nHow's it feel?\nOkay, now tell me how's it feel?\nHow's it feel? Can you tell me how it feel?\nHow's it feel? (Please)\nHow's it feel to come and hang around a motherfucker like me?\nHow's it feel?\nHow's it feel? Ha\n\n[Outro]\n\"l know, man. Cops can kiss my ass\"\n\"All they are is assholes\"\n\"l know, man, but what's the matter with them? They mad 'cause we get more pussy than they do?\"", "image": "https://images.genius.com/cb728ec66cfad5964e15291c3c4a294c.375x375x1.jpg"}], "artist": "Mac Miller"}