{"songs": [{"title": "Jersey Yo!", "album": "Doc’s da Name 2000", "year": "1998-12-08", "lyrics": "Yo yo yo\nOnce upon a time up in Jersey, Yo!\nHa ha, I damn near had to wreck a ho\nYo, I knocked on her door, \"Who is it?\"\nHa ha, it's Funk Doc here to pay a little visit to ya\nI heard them niggas in The Bricks get smoked a lot\nI heard them niggas out in Brooklyn get smoked a lot\nI heard them niggas all Uptown get smoked a lot\nI heard them niggas out in Queens get smoked a lot\n\nYo, yo yo\nI smoke your buddha to the last drop like I was Maxwell\nIf blunts came in degrees, call me a blackbelt\nI'm worldwide chinky, who dub with chrome inky\nChicken ridin' shottie and she boost all her dickie\nThis is your brain, this is my tape on drugs\nIf your lame ass can't feel it, then your cord unplugged\nPPP smoked your weed, ain't nobody around\nYou just got clowned for a whole half a pound, check it out, now\nI do a lot of stupid shit when I be smokin'\nOne time I left my truck runnin' in Brooklyn wide open\nI forget who I call, ask for Nia (R - \"Hello, can I talk to Nia?\")\nAnd it's Tonya (G - \"NIA?!\", R - \"Oh shit!\")\nClick over (R - \"Whassup bitch?\".. \"Oh, hi momma!\")\nYo, when I'm on stage rhymin I forget what state that I'm in\nThe bitches numbers I lost, my baby mama find em\nI played the lottery, forty million that day\nI probably won the motherfucker but I forgot that I played!\n\nYo yo yo\nOnce upon a time up in Jersey, Yo!\nHa ha, I damn near had to wreck a ho\nYo, I knocked on her door, \"Who is it?\"\nHah, it's Funk Doc here to pay a little visit to ya\nI heard them niggas up in Cali get smoked a lot\nAll them niggas in Atlanta get smoked a lot\nI heard them niggas in Virginia get smoked a lot\nI heard them niggas in Rhode Island get smoked a lot\n\nAiyyo-yo, yo\nWhen I get high I start throwin' water in the crowd\nBattle MCs off the top, slaughterin' a child\nDetroit call it Ganz, Miami call it Krip\nNo matter what you call it, it be peelin' back my shit!\nAiyyo Cali niggas got Bomb -- that same Bomb\nMade me forget my mama's birthday and it's tattoed on my arm\nI misplace my Lex keys everytime I be zee'd up\nI was caught puttin' Christmas trees up, and it was Easter!\nDo y'all motherfuckers feel high tonight?\nKnowin y'all niggas shouldn't drive tonight?\nYo, however the plan go, close the Caravan door\nSo we can all die and get high off of secondhand smoke\nBrick City got the Pep, empty out your Black N' Milds\nSmokin the L with Doc earn frequent flyer miles\nI flew around the planet with my weed tucked in\nI need to go to E.O. rehab, and sign my stankin ass in!\n\nOnce upon a time up in Jersey, Yo!\nAh-hah, I damn near had to wreck a ho\nYo, I knocked on her door, \"Who is it?\"\nYo, it's Funk Doc here to pay a little visit to ya\nI heard them niggas in The Bronx get smoked a lot\nI heard them niggas up in Yonkers get smoked a lot\nI heard them niggas in Chi-Town get smoked a lot\nI heard them niggas in Detroit get smoked a lot\nLot, lot, lot, lot\nYo, yo, yo, yo\n\nYo.. motherfucker\nDon't fuck around in The Bricks motherfucker\nRats'll whoop your ass over there motherfucker\nNigga got so much Backyard Boogie over there\nThe seeds'll kill you motherfucker, yeah!\nChickenheads'll rob you over there motherfucker\nSucker ass motherfucker\nGet the fuck on out of here\nYo light that shit here!\n\n(We gon' take you out, on W Fuck All Y'all radio)", "image": "https://images.genius.com/ff1bcd7d83855df13cac08a00e033052.594x594x1.jpg"}], "artist": "Redman"}