{"songs": [{"title": "Real", "album": "Dreamchasers 2", "year": "2012-05-07", "lyrics": "[Verse 1]\nI said, I used to get high just to get by\nCouldn't deal with my reality, was livin' in a lie\nSometimes I asked God, \"Is we livin' just to die?\"\nConversations with my dad, and he livin' in the sky\nI think, \"Am I goin' crazy? Or is this shit for real?\"\nThe spirit of a nigga who will or is appealed\nFightin' to see the light and I'm fightin' to keep it real\nLike a nigga with no lawyer, I'm ready to take a deal\nGot me feelin' like Khaled 'cause all I do is win\nI don't practice no religion 'cause all I do is sin\nI don't even write it down, I'm just spittin' out what's in\nI don't celebrate for victory, man, all I do is grin\nUgh, shit, I ain't braggin', I don't boast\nBut when it come to bread, fuck a slice, I need a loaf\nAnd a little bit of toast just to keep the haters off me\nMan, I do this for my city, all the niggas waitin' on me\n\n[Chorus]\nLook into my eyes, tell me what you see\nYoungin' full of pride, tendencies of a G\nI never gave a fuck what ya heard about me\nNever told, never sold my soul, nigga this is me\n\n[Verse 2]\nI'm a family man\nDon't you ever cross that line where my family stand\nI send them boys to come and get you in that family van\nCold shooters that love them hammers like Yosemite Sam\nI'm from a hood where these niggas scared to dream at\nFuck the money, they wanna know where the lean at\nThey make ya' lean back, I'm talkin' fade-away\nMike Jordan, gettin' it ain't important\nHow can I forfeit? Niggas makin' a fortune\nLivin' in fortresses, gettin' it on some corporate shit\nGo hard or go home and this the orphanage\nSame niggas that I grew up I be often with\nSmall circle 'cause niggas a murk you\nMost of the time it's niggas that know, but my niggas is purple...\nHearted, I seen the snakes before they even started\nCaught 'em and the was dearly departed\n\n[Chorus]\nLook into my eyes, tell me what you see\nYoungin' full of pride, tendencies of a G\nI never gave a fuck what ya heard about me\nNever told, never sold my soul, nigga this is me", "image": "https://images.genius.com/a7bc28c05034136e861be4c94601d20a.500x500x1.jpg"}], "artist": "Meek Mill"}