{"songs": [{"title": "Put in Work", "album": "Setbacks", "year": "2011-01-11", "lyrics": "[Verse 1: Schoolboy Q]\nUh! And everything be everything\nPlus a nigga pullin' hoes they on me like they weddin' ring\nGo and let your titties hang\nGo and set your pussy free\nGo and let your booty swing\nArch your back and lose your pain\nThen she be like where he go\nProbably with my other ho\nBest believe she bring me more\nBest believe I need my dough\nPenthouse on the seventh floor\nThis your house, this my dick\nThis your lip, this your couch\nShow me what that talk about\nGo ahead and run your mouth\nShe on one\nOn my pole like track and field she in it for the long run\nTake your ass up out this world get introduced to stardom\nPullin' hoes up off the bench my nigga but you had started them\nHmm, and they waist look like we starve 'em\nAss hold that baby fat, damn, where they do that at\nDamn, seen her momma back\nDamn, now I'm feelin' that\nBeatin' on that pussy like producers call me battle cat\n\n[Hook]\nEverytime we hit the scene man them bitches fallin' out\nEverytime we on the scene man them birds be fallin' out\nEverytime we hit the scene have them chickens fallin' out\nEverytime we on the scene man them hoes be fallin' out\nIf you Chevy revvin' clean, then she should put in work\nIf your swagga really clean, then she should put in work\nIf your sneakers really clean, then she should put in work\nIf your temporary clean, then she should put in work\nYou always talk about it\n\n[Verse 2: Schoolboy Q]\nThey be like damn, where they do that at\nDamn, hey who made your hat\nDamn, hey who did your tat\nShit I want my money back\nDamn, heard you pay the stack\nDamn, how much for your kicks\nDamn, I ain't payed for shit\nDamn I know that got you pissed\nDamn, bet I bust your bitch\nDamn, bet I got some weed\nI put your ho at ease\nCracked her like policies\nAdopted a cold heart they call me Foster Freeze\nI can make it snow, brr, you just a breeze\nNigga please, I'm managed by the bees\nThey love me overseas\nThat's word to Japanese\nNow I'm coming to America they owe me cheese\nA bunch of bad broads, bet they pay me fees\nIt's pimpin' ho, you know whassupper\nTaxin' you every Friday you Mrs. Tucker\nSuck the nut off my head she drain me like a sewer\nThink I'm Big Meech, I been Larry Hoover!\n\n[Hook]\n\n[Verse 3: Schoolboy Q]\nUh! We movin' forward we ain't lookin back\nSo I gotta get some sneakers everytime I cop a hat\nSuperstylistic hat, Southern playalistic rap\nSaw her titties, saw graffiti, read my name, I'm on perhaps\nAnd her ass be overlap, out of shape and overfat\nOn the job I'm takin' apps\nBlew my mind right through my cap\nI just wanna chill with you\nYou just wanna throw it back\nSo go 'head throw it back, bust it open throw it back\nBustin' hoes ain't nothin' Jack\nShut your mouth and show your stats\nStill ain't seen a proven fact\nAlways hear your chitty chat\nWe be stuntin' never frontin' nigga cause they know we on\nYou be stuntin' always frontin' cause I shit your favorite song\nYou played out like reggaeton, now you mad at me and shit\nShe said I'm her favorite dick, best believe she savour it\nYou be actin' with them actors straight pretendin' guaranteed\nShe ripped my landing as we toast to new beginnings now that pussy gone\n\n[Hook]\n\n[Outro]\nUh! Uh! And everything be everything\nPlus I keep the baddest hoes they on me like they wedding ring\nGo and let your titties hang", "image": "https://images.genius.com/4e5d39814aadb84f19c68cb7ca188a5d.950x946x1.jpg"}], "artist": "ScHoolboy Q"}