{"songs": [{"title": "Extortion", "album": "Hell On Earth", "year": "1996-11-19", "lyrics": "[Produced by Mobb Deep]\n\n[Intro]\nYeah...\nTime to let these niggas know, son\nNiggas don't even wanna motherfuckin' understand\nKnowhatI'msayin? Time to hit 'em with the 3rd degree\nYeah, you know the QBC, here to drop a G\nYo...\n\n[Verse 1: Havoc]\nLook into the eyes, True Lies, your whole click despise\nEspecially me, H-A-V-O-C\nDon't want your chick, cuz she's burnin' third degree\nPlus you snitchin', you ain't got no ties on me\nI keep it strong, while you scream word is bond\nLyin' through your teeth, swearin' on your first born\nYour word is weak, don’t hold no weight in this\nHit you up quick, strictly shit that I'm livin' in\nYou walk a line that's thin, you religious? Well, you sin\nFuckin'' with the Mobb, Infamous to the end\n\n[Verse 2: Prodigy]\nI hold a nine Ruger, with an infa-spot disc\nRed dot right at your face, so set sail or rock it\nAnd kept drivin', pull off like the Indy 5G\nIn a four time Ford truck with Speed\nLike the motion picture, this nigga Gone With the Wind\nMy crime work, ninja style shit was did\nAnd got away with, escaped it, the Jakes from tracin'\nAnythin' that lead to the source, you know the boss\nOf the Mobb killin', is like an Unsolved Mystery\nPuzzlin', nobody knows, it's all history\nMadness amongst me, I frequently have to get thugly\nNever fails, it's always somethin'\nNo rest, daily gotta rock my vest\nI shoot at your best man, yeah, your MVP\nHe played the front line, got struck down immediately\nI wave a Mobb Deep flag, you hear the sound as it slaps wind\nHeavy load, my military hold ammunition\nFar from animation, it's real live, you think not?\nMy crew, kings of New York who takin' your spot\nI put the green light on your whole click, Island shit\nRunnin' through the whole house wildin', extortin'\n\n(Extortion, hit that up, extortion, hit that up)\n\n[Verse 3: Havoc]\nExtortion is the key, I got the key for extortion\nSpend your fortune, dead your shorty like abortion\nTake precaution, Infamous laws enforced in\nYou married to the Mobb, can't take it? Then divorce it\n'Cause I ain't got no time for them domestic disputes\nIf you scared, get a dog, don't got a clique? Then recruit\nYou're weak troop, lost battalion in the mist\nOn your name I shit, take it like a man, you little bitch\n\n[Verse 4: Method Man]\nI blaze yo' britches, P.L.O. extortion\nYou forcin'\nThe hand that rocks the cradle, caution before you enter\nThis Shaolin representer, carry 36 deadly shits\nYou fuckin' with top contenders, official to the bone gristle\nIt don't matter if you bust rhymes or bust pistols\nRemember me? Burn a nigga to a 3rd degree\nDon't act familiar, motherfuckers, you ain't heard of me\nJust peep the stee and the rap, how it's supposed to be\nTap the pockets, bag the goods like a grocery, we food-shoppin'\nOn top of that we hip-hoppin', and don't stoppin'\nOut-of-state drawers-droppin', the panty-raiders\nSlide on ya like gators\nDug that stank bitch back out and then played her\nBut that ain't nothin'\nCrossin' this dog walkin', native New York and\nShaolin' slang talkin', rap nigga, Mr. Freeze, crowd shiver, what?\nYoung, black and don't give a fuck\nIf the next crew get the scissor...\n(Extortion, extortion, give that up kid, extortion)\nBottom line, what the fuck you wanna do?\nYou eyin' me, at the same time I'm eyin' you, punk\nWanna pop the most junk\nBe the same motherfucker with the most lumps\nChew on that shit\n\n[Outro]\nPunk faggot (word up)\nBurn his ass like a book of matches\n[Yeah, that's just about it]\nUnder pressure like fat bitches...", "image": "https://images.genius.com/2c1555f27e44bd87876d75ca225fcb3a.600x600x1.jpg"}], "artist": "Mobb Deep"}