{"songs": [{"title": "Beware", "album": "Maximum Strength 2008", "year": null, "lyrics": "[KRS-One]\nYeah, HUT HUT HUT HUT!\nI know we ain't gettin soft, HUT HUT HUT HUT!\nI know we ain't gettin soft, listen\nFIYAH!\n\n[Hook: KRS-One]\nWhen you advertise in New York\nYou best to beware, oh yes\nWhen you advertise in New York, you best to beware\nCause the bling bling, and de sex t'ing\nDem no care, oh no, you best to beware\nOh no, yo you best to beware, oh no noooo\n\n[KRS-One]\nThis is how they do it kid, I thought you knew it kid\nThis is how they set us up listen I can prove it kid\nMany don't understand, you see it's all a plan\nTo keep the black man a child like he's Peter Pan\nYou'll never see a man, a real black man\nUntil you see a man with control of his hands\nAnd to control your hands means you control your mind\nAnd to control your mind means you ain't commitin crimes\nMan you smarter than that, goin to prison is whack\nEven the people in prison know I'm spittin the facts\nI'm gettin open, open the class up\nDon't smoke crack it'll tear yo' ass up\n\n[Hook]\n\n[KRS-One]\nListen! We got our own problems here in the States\nSo you know I'm not pointin the finger BUT WAIT\nThis is somethin y'all got to see\nEven the UN knows violence begins with poverty\nWhen you ain't got no money, it's quicker to kill\nIt's human nature that's way the jails are filled\nAnd the MILITARY? From the time you sign up\nTo kill your neighbor man it's a SIN already\nAnd SIN meaning Selfish Inconsiderate Needs\nGimme what I want! I don't care who bleeds\nThese days people ready to steal and rob\nAll in the name of I'm DOING MY JOB~!\nBut what about doing your work, what's your purpose?\nNo human being is worthless\nThink about this before you pull the trigger\nAnd you call your sister a bitch and your brother a - WHOA\n\n[Hook]\n\n[KRS-One]\nKnowledge Reigns Supreme again, ignorance is weakenin\nTruth is what I'm speakin when I'm reachin and teachin my friends\nLife is more than just cars and lust\nUnity is a must, we need to build trust\nOpen up your mind to this, raisin up your consciousness\nWhether you a pessimist, strategist or optimist\nMy synopsis is knowledge ain't where college is\nKnowledge is for leaders and wisdom is for philosophers\nNow I'm hearin London gettin violence like Brooklyn was\nBrothers gettin shot just for lookin cuz?\nI thought we deaded that, we need to be headed back\nYo France, you need to be coverin your brother's back\nBring the lovin back, cause the government don't love you\nThey into murder, money, and stayin above you\nThey want you all in prison\nSo before you kill your sister or brother stop and listen\n\n[Hook]", "image": "https://images.genius.com/8e8d71ccffef56195f7ad1ad515b3f54.640x640x1.jpg"}], "artist": "KRS-One"}