{"songs": [{"title": "Supervillainz", "album": "Born Like This", "year": "2009-03-24", "lyrics": "[Posdnuos/P-Pain]\nWhat rhymes with shillin, villain\nWhat rhymes with shmillain, villain\nHe's a villain..\nYes, he is..\n\n[Kurious] + (Doom)\nSet it off, adrenaline rush\nThe boys way beyond a pen and the dutch\nStronger than hen a bag of the dust\nYou need to watch how they acting with us\nNow time to get it in gear, get it in right here\nRevenge is better than beer\nYo Doom, it's been a minute think they getting it clear (Yeah!)\nWhen brothers reunite, make sure we party right\nWe rock it all night long even beyond the morning light\nIt's hard to see him in the light\nEven harder to see him on the mic\nA black Benz beats being on a bike\nAnd he can talk a gay chick outta being a dyke\n(New Kurious, y'all) Like that y'all\nFreak freak y'all (At a store near you)\nTo the beat y'all (Go get it)\n\n[Doom]\nKeep it on click fully auto\nI won't stop the rock until pockets thick and gordo\nMore so a risk of sounding poor, bro\nNo tux  who needs tickets to the award show\nNormally cordial, more or less, less is more or no\nHock spit out the cockpit\nStuck to the window 'till it's solid as a rock hit\n\n[Posdnuos/P-Pain]\nYes, he is..\n\n[Mobonix]\nHe grabbed the mic like two money bags\nWaiting for the getaway to count what he had\nThought he was a spaz, but dude kept wrecking\nThe crowd remote control, keep 'em all guessing\nFunny man gave 'em nuttin like a bummy dare\nTaught him how to fight wit' a mic and the hottest stab\nBut that's the life of a villain, and you know after that, chilling\nWent places got Gracie don't follow\nThe big joke ain't no Cola in the Coke bottle\nWriting rhymes till the pen go hollow\nAnd been flow hotter than the sunshines of Marrow\nAnd get the villain and scheme\nIf it's not real life it's still in yo' dreams\nLike that y'all, like that y'all\nLike that a like that and like that y'all\n\n[Posdnuos/P-Pain]\nWhat rhymes with thrillin, villain..\nWhat rhymes with stealin, villain..\nHe's a villain..\nYes, he is..\n\n[Prince Paul/Filthy Pablo]\n..That's right, I'll smack the black off of ya, punk!\n\n[Slug]\nVillain... Pushin' on the couch cushion\nSouth side Minneap never lived out in Brooklyn\nKept the faith forget the fame\nIf they sweat the name let it set the lane\nHeld mind, cold and hard\nHad no regard who the chosen are\nWho, you? Oh no\nYou played the Oboe, keep it on the low low\nRappers are candy butterscotch\nI'mma let their baby mothers watch\nShe loves the ock, I touch the spot\nBitch, I'm the itch, that must've got up her crotch, heh\nNow stop, fill the buildings\nAnd leave some pills for these little villains\nHey shorty, share the flask\nLet me explain why I wear this mask..\n\n[Outro]\nVillain!\n\"I want you to call me at that address if I'm still there\nGonna make sure you get cracked!\"", "image": "https://images.genius.com/01edf9d69a6ac635d7ca4d452539e8ce.1000x1000x1.jpg"}], "artist": "MF DOOM"}