{"songs": [{"title": "Write at Home", "album": "Radio Silence", "year": "2017-11-17", "lyrics": "[Verse 1: Datcha]\nPeace, peace, everything we do is a creation\nIn complete harmony, our creation becomes art\nEverything we've ever invented stems from the human imagination\nEverything we've ever invented or created\nThat moved an era is recognized as work of genius\nScience and the empirical man, philosophy and the thinker\nReligion and the shaman, art and the sick who can metabolize\nEverything with a trace of decay is human error\nForgivable human error the curse\nFrom the radiance of the gift which becomes shadow\nNecessary evil so to speak, or we'd have figured it out by now\nStriving for perfection is a result of genius\nFind peace, share your genius\nSee I can't see my own face without a reflection\nWhether it be your reaction to my expression, a mirror or water\nI need the outside to know the inside which is where I reside\nThrough this understanding, I know that all things are one\nAccording to science, everything is a wave of energy\nA soundwave reaches my ear and my mind makes something of it\nMy eyes are receptors for another type of energy\nWhich my mind then depicts as images, same goes for smell and touch\nTime and space are tools which help me concretize these waves into information\nNow when given full attention to something other than time and space\nTime and space disappear, I'm simply doing\nYesterday, tomorrow, here, there, poof!\nIt is always now, all is energy\nEven thoughts are forms of energy waves floating\nTechnically I'm only a vessel channeling those thoughts\nMy mind chooses to tune into these frequencies\nWhich I either contemplate or share with the outside\nI believe we all function with the same foundation\nEnergy, which is everything\nEverything is one big ocean of energy\nEverything is within you, everything is you\nThe identity of me is but a series of memories\nIn which my mind decides to narrate in order to create that feeling\nRemember it is always now\nThe first law of thermodynamics states that energy is conserved\nIn other words, energy can neither be created or destroyed\nEnergy only transforms\nWe are thus forever, and death is but a blink\nSo I ask why hurt? Why kill? Why hate? Why fear? Why war?\nWhy the feelings of uneasiness if all is but a single form of energy entertaining itself?\nCan the state of the world change?\nCan the state of the world change?\nIf energy only seems to transform then why not?\nIt seems as if darkness has always reigned over\nWe live on a planet amongst the system in a dark space\nA planet amongst other planets routing around the sun\nIn the same fashion as electrons do\nAround the nucleus which form the cells, which form us\nAh yes, all is one, and my friends, it is beautiful\nLet us unify our heart, now feel your power and I thank you\nPeace and forever\n\n[Bridge: Bilal harmonizing]\n\n[Interlude: Talib Kweli]\nYeah, uh\nSnap ya fingers, do ya step\nAyyy, where we at with it?\nWhere you at? Uh, uh\nWhat era is this, man?\n\n[Verse 2: Talib Kweli]\nThe era of the musical beautiful mistakes\nDelivered hand to hand like we slangin' the mixtapes\nYou tryin' to describe us, you might as well get it straight\nWe the content creators, we greater than clickbait\nThe passion for the culture, the vultures they try to kill it\nIt's a war for your spirit, the lyrics is here to heal us\nWe looking for the fountain to keep us forever young\nWhile I get my energy from the sun, all things are one\nRollin' the blunt on a copy of Native Sun\nGettin' hung just for speakin' the native tongue\nMy color is my penalty mentally on the run\nPhotosynthesizing my energy from the sun, huh\nReleasing blockages I ain't stoppin' until they gone\nFeeling weighted down like my pockets is full of stone\nUntil I realized I can change what's going on (let's go!)\nTo every single place I go I'm right at home\nI'm right at home (let's go!)\nWaiting for that day to come, huh\nLooking for fountains to keep us forever young\nGet my energy from the sun\nRollin' the blunt on a copy of Native Sun\nGettin' hung just for speakin' the native tongues\n\n[Outro: Bilal harmonizing]", "image": "https://images.genius.com/25f545688171433c422bdbaf45bd1392.1000x1000x1.jpg"}], "artist": "Talib Kweli"}