{"songs": [{"title": "What’s Up, What’s Haapnin’", "album": null, "year": null, "lyrics": "Aye What's Happenin'\nAll you haters should get at me cause I hear ya and\nI'm watchin' but I'm serious haters so all I gotta say is\n\n[Chorus]\nWhat up, what's happenin'\nAll u haters can get at me (hey)\nCause I hear ya and I'm watchin' (hey)\nBut I'm still here I ain't stoppin'\nSo What up, what's happenin'\nAll u haters should get at me\nCause I hear ya and I'm watchin'\nBut I'm serious haters so all I gotta say is what up\n\nWhat it is bro (bro)\nWhat it do mane (man)\nStill the man from the pan to the blue flame\nStill gettin' dough and make it rain with the loose change\nI bet that what he did a show, now that's a damn shame\nI guess that what he hatin' for boy u so damn lame (Sucker nigga)\nYa Click the same, a destined bunch of walkin' shit stain\nDisgraced the A ya give the city such a bad name\nYou way back in my rear view mirror I'm in the fast lane\nStill I hear ya loud and clear on ya lil' song\nGo on getcha dissin' on while the king on\nYour self esteem gone (why) cause I'm back now\nLet's see if we can't teach these niggas how to act now\nYa Kissin' ass then, ya just as bad now\nI check ya ass then, I shut ya ass down\nAnd I deliver front and center, never back down\nWho get the last laugh now sucker nigga\n\n[Chorus]\nI got a front street swag and a side street hustle\nCenter Hill, Cedar Ave. that's where I be sucker\nSouth Grand Church Street, the first with that work\nBut we can get it to commercial, if ya need somethin' chirp with\nHey what I care bout who you askin', sayin' they ain't heard of me\nI'm certified, certainly\nThem videos ain't hurtin' me\nI still ride with the window rolled down all around the A town like it's finn'a go down\nIf it was ever any questions, niggas finna' know now\nWon't retire my thrown or surrender no crown\nI never bow down (Never)\nAnd never say die (Never)\nJust to whom it may concern and who so ever may try\nI'm forever Westside\nAnd the featherweight dies\nTell them take your best shot\nGoin' get yourself hot\nCause I yell Bankhead and you felt left out\nI ain't mention yo name\nThat's what all this bout?\n\n[Chorus]\nFrom Summer Hill to the hills up in Hollywood\nA house full, gettin' to it, you know how we do it (Yeah)\nYeah we smoke great (great)\nAnd we drink good (good)\nThen we ball hard, just like G's should\nBuy what we want\nDrive what we want\nG4 up up and away we go, we fly where we want\nHaters smile like they like it when they really don't\nWish they could just wish me away\nThat's what they really want\n\"I really hate his ass\"\n\"I don't like him either\"\n\"We'll do a song together, maybe then we can beat him\"\n\"Somehow he must be stopped\"\n\"Somethin' must be done\"\n\"If we can't knock him off, let's just try him when he get caught with guns\"\n\"Then if he really done (Yeah) and we really won (Yeah)\n\"Any more ideas? \"\n\"Suggestions anyone? \"\n\"How bout we stay up all night, on the blog sites\nSpread vicious lies and nasty rumors we could all write\"\nBut that's alright\nLet the nerds hate\nCause in my face though, them words get ate\nAnd hatin's hard work, when I just bounce back\nThis God's work\nTell all the haters I'm back!\n\n[Chorus]", "image": "https://images.genius.com/68262ccdcbffb87427d31b0d6085c2e3.400x400x1.jpg"}], "artist": "T.I."}