{"songs": [{"title": "The Perfect Beat", "album": "Eardrum", "year": "2007-08-21", "lyrics": "\"Check this out...\"\n\n[KRS-One]\nHooooooooooooo~! (HEY DJ!) WHAT? (\"I know you're gonna dig this\")\nYeah, yeah, yeh yeh! KRS, ohhhh~! Talib Kweli\nTalib this is crazy, yo this is crazy\nHah... what'chu doin?\nThrow your hands up, c'mon\n\n[T] BK to BX and every place in between, it's all 7-18 like\n[K] Grand Concourse, whassup!\n\n[Talib Kweli]\nWe got beats to the rhyme and the rhyme is so fresh yo\nSo what'chu got? 9's and tecs, you're no threat\nIt's the beat, how you get your cake don't matter\nIt takes heart the lyrics been replaced with the swagger\nI stay sharp enough to slash your face like a dagger\nThe actors been replaced with the rappers\nThe rappers been replaced with the actors, see how they try to stay on the beat\nThe pig route when he's walking down the street to the beat\n\n[KRS-One]\nWOOP~! Sound of da police\nWhat is the life of a true hip-hopper, the beats\nPeace love unity livin proper with the beats\nIn any endeavor whatever we will prosper with our beats\nSome cats are real, other are impostors with beats\nWe the realest, livest\nThe rawest, crack cocaine heroin survivors with beats\nWe avoided the cops, we focused on beefs\nSpittin, all we saw was stacks of rhymes written, elite\nWay too smart for the system of course\nWe know a smart, free, black man just pisses 'em off!\nWhat they like is when we glisten and gloss\nFlashin millions but still takin a loss\nBump the beat! Yeah, all in the street\nTalib yo, I think it's 'bout time to speak\n\n[Talib Kweli]\nYeah... yeah... word~!\nWatch me take it there, life ain't a crystal stair\nHell yeah it's crystal clear when Kweli and Kris is here\nSearching for the perfect beat I went to East Dayt'\nIt's crazy and fugazi how they slaves to they release date\nThey try to look away, they're scared to look inside\nAskin why like a guy who look for God up in the sky (that's right)\nSearchin high and low, behind the do', inside the drawer\nLittle did he know that the beat was tryin to find a flow\nStuck in limbo, how low can you go\nA punched hole through your stomach lining like Tylenol\nBuild all kind of rolled, metaphors and similies\nThat'll have you doubtin my competitor's abilities\nMy whole body is a spiritual facility\nWhere I confess after a lyrical killing spree\nThe illest delivery, later for the talk we need action\nSilence is golden but the violence is platinum\nWhen you rappin to the beat\n\n[KRS-One]\nBoom, bap, who's, that?\nKRS-One bring the beat back\nThe perfect beat we seek that, knowledge of mind we speak that\nWe don't speak weak crap over weak tracks\nMOVE, THAT; we speak boom bap live in the club\nWe can show and prove that\n\n[Talib Kweli]\nYeah, it ain't old school or new school it's true school rap\nBeat you 'til you're blue and black, true dat, it's\n\n[KRS-One]\nBetter beat win again, work the street\nMovin again, insert the heat\nLookin again for the perfect beat\nDon't look in the book to learn to eat\nWrite up a hook, learn to speak\nNever be shook, follow the heat\nForever they look weak\nT.K. you must speak!\n\n[Talib Kweli]\nTeachin 'em how to eat to live\nThey cheap and their pimp is pleadin the fifth\nBleedin as if they goin to war\nEverytime they leavin the crib\nSneakers and whips, police be peepin the strip\nYou see 'em walkin the beat\nHoes believin the pimps who eatin the shrimps\nSo John's walkin the street\nLookin for a sweet face, in each case\nTryin to get they heartbeat racin, and the dark meat be tastin\nSo delicious, my description so good to the beat\nIt's lifted right from the sounds that you hear in the hood when you sleep\n\n[KRS-One]\nBring the beat back!\nAll that whackness, we don't need that\nYou gotta bring the beat back!\nAll that whack garbage, we don't need that\nBring the beat back! All that weakness we don't need that\nSelector bring the beat back, bring the beat back!\nSelector, listen!\n\n[Talib Kweli]\nYeah, DJ Rhettmatic\nTalib Kweli, hip-hop", "image": "https://images.genius.com/36dc52e92a9d27102149cf08b1a7f326.936x936x1.jpg"}], "artist": "Talib Kweli"}