{"songs": [{"title": "Keys Under Palm Trees", "album": "Beam Me Up Scotty", "year": "2009-04-18", "lyrics": "[Verse 1]\nHear the Devil callin', I can hear 'em\nIt's like, I get chills down my spine, when I'm near him\nMan, I'm a tad too bad, I don't fear him\nI don't need the preachers, I'm the high priestess\nEverywhere I go, I get \"Hi, nice to meet you.\"\nBitches know I beast this, I'm the fashionistis\nAnd they know, I stay around the white, like a groom\nLook up in the sky, I see somebody on a broom\nI think I'm gettin' hi-high-hi-high, on my own supply\nYellin' \"Rasta, alright! \" when I'm ridin' by\nSee, I used to be the wife, of a king\nBack when I was smugglin' them things, in the bing\nNow that I'm a boss bitch, it's a win-win\nCome to Mr. Chow's, or meet me in Chin-Chin\nNow I get'cha ching & my name bells ring -\nOops, I mean my name ring bells, ding ding!\n\n[Hook](x2)\nI'm in Jamaica with them keys, under palm trees\nThe leprechaun sees, what my palm reads\nAnd if my heart seize, please call my aunties\nI think them girls tellin', I hear them boys yellin'\n\nGet down, get down, get down down\nGet d- get down, get down, get down down\nGet down, get down, get down down\nGet down, get down on the ground\nGet down, get down on the ground\n\n[Verse 2]\nMan, fuck a P0, and fuck a C0\n'Bout to \"Set It Off\", like Cleo\nMad, they done tapped my Treo\nBagged my skio, heard the bitch lyin' like Leo\nAnyway, I'm the ninja, Kawasaki blazin'\nIn a kimono, \"Konichiwa\" to the Asians\nI kick, kick, kick it like I'm Bruce Lee's son\nSo all of that yellin' in the street soon done\nCause if I take my ski mask off, then I'm dumbin'\nThe young Chaka Khan, yes - \"I Am Every Woman\"\nAnd I am 'bout that coke, not what'cha put the rum in\nSay a little prayer, tell the Lord that I'm comin' (comin')\n\n[Hook]\n\n[Outro]\nCan you hear the yellin'?\nComin' for me, comin' for me-e-e-e\nComin' for me, comin' for me, comin' for me", "image": "https://images.genius.com/d4b8299bec1aac14c1931423e8d3466c.500x500x1.jpg"}], "artist": "Nicki Minaj"}