{"songs": [{"title": "​i (Single Version)", "album": null, "year": "2014-09-23", "lyrics": "[Produced by Rahki]​​\n\n[Sample]\nThis is a world premiere!\nThis is a world premiere!\n\n[Intro]\nI done been through a whole lot\nTrial, tribulation, but I know God\nSatan wanna put me in a bow tie\nPray that the holy water don't go dry\nAs I look around me\nSo many motherfuckers wanna down me\nBut an enemigo never drown me\nIn front of a dirty double-mirror they found me\n\n[Chorus]\nAnd I love myself\n(The world is a ghetto with big guns and picket signs)\nI love myself\n(But it can do what it want whenever it want, I don't mind)\nI love myself\n(He said I gotta get up, life is more than suicide)\nI love myself\n(One day at a time, sun gonna shine)\n\n[Verse 1]\nEverybody lookin' at you crazy (crazy!)\nWhat you gonna do? (what you gonna do?)\nLift up your head and keep moving (keep moving)\nOr let the paranoia haunt you (haunt you)?\nPeace to fashion police, I wear my heart\nOn my sleeve, let the runway start\nYou know the miserable do love company\nWhat do you want from me and my scars?\nEverybody lack confidence, everybody lack confidence\nHow many times my potential was anonymous?\nHow many times the city making me promises?\nSo I promise this\n\n[Chorus]\nI love myself\n(The world is a ghetto with big guns and picket signs)\nI love myself\n(But it can do what it want whenever it want, I don't mind)\nI love myself\n(He said I gotta get up, life is more than suicide)\nI love myself\n(One day at a time, sun gonna shine)\n\n[Verse 2]\nThey wanna say it's a war outside and a bomb in the street\nAnd a gun in the hood, and a mob of police\nAnd a rock on the corner, and a line for the fiend\nAnd a bottle full of lean, and a model on the scene yup\nThese days of frustration keep y'all on tuck and rotation\nI duck these cold faces, post up fi-fie-fo-fum basis\nDreams of reality's peace\nBlow steam in the face of the beast\nThe sky could fall down, the wind could cry now\nThe strong in me, I still smile\n\n[Chorus]\nI love myself\n(The world is a ghetto with big guns and picket signs)\nI love myself\n(But it can do what it want whenever it want, I don't mind)\nI love myself\n(He said I gotta get up, life is more than suicide)\nI love myself\n(One day at a time, sun gonna shine)\n\n[Bridge]\nWalk my bare feet (walk my bare feet)\nDown, down valley deep (down, down valley deep)\nFi-fie-fo-fum (fi-fie-fo-fum) (I love myself)\nMy heart undone (my heart undone)(I love myself)\n\n[Hook]\nThe world is a ghetto with big guns and picket signs\n(I love myself)\nBut it can do what it want whenever it want, I don't mind\n(I love myself)\nHe said I gotta get up, life is more than suicide\n(I love myself)\nOne day at a time, sun gonna shine\n(I love myself)\n\n[Verse 3]\nI went to war last night\nWith an automatic weapon, don't nobody call a medic\nI'ma do it till I get it right\nI went to war last night\nI've been dealing with depression ever since an adolescent\nDuckin' every other blessin'  I can never see the message\nI could never take the lead, I could never bob and weave\nFrom a negative and letting them annihilate me\nAnd it's evident I'm moving at a meteor speed\nFinna run into a building, lay my body in the street\nKeep my money in the ceiling, let my mama know I'm free\nGive my story to the children and a lesson they can read\nAnd the glory to the feeling of the holy unseen\nSeen enough, make a motherfucker scream, \"I love myself!\"\n\n[Outro]\nI lost my head\nI must've misread what the good book said\nOh woes keep me, it's a jungle inside\nGive myself again 'til the well runs dry (i)\n\n[Car Horns]", "image": "https://images.genius.com/d595983644058b8bb5249c3ac6300d93.658x658x1.jpg"}], "artist": "Kendrick Lamar"}