{"songs": [{"title": "All The Way Live", "album": null, "year": null, "lyrics": "Coolio\nMiscellaneous\nAll The Way Live\n1 It's all the way live. It's all the way live\nIt's all the way live. It's all the way live\nWhy you take a chunk and go up for a dunk?\nAn' I never been a punk but your girl calls me hunk\nStraight to the hoop and I know how to shoot\nIf you wanna know the truth then you better get the scoop\nComin' up to miss wit' my mic in my fist\nAn' everybod's lookin' so you know I gotta bit\nYou take me that can't be\nShook an' took like all rookies\nSo if you're a beginner an' you want wanna be a winner\nThen you better have some spinach with your dinner\nSo just put your head to the sky, if you wanna ride\nAnd keep you eye on the flies cause it's live\n(repeat 1)\nWhat you see is what you get\nAnd what you got is a whole lotta sweat\nBlood and tears, so have no fear\nCause they ain't seen moves like these in years\nI can shake it bake it, show the fake\nBut never perpetrate or player hate\nMy name ain't Brat but I'm Funkdafied\nMy name ain't Luke but I can walk-the-sky\nSo put it over here homie low, an' go for broke\nAnd watch the smoke but make sure you don't choke\nPut your head to the sky, if you wanna ride\nAnd keep you eye on the flies cause it's live\n(rpt 1)\nOoo the music's in the groove\nIt's the rap that makes you move\n'Cause Lakeside show-ed up at the party\nOoo the music's in the groove\nIt's the rap that makes you move\nCoolio show-ed up at the party\n(rpt 1)\nThis ain't Penny Hardaway or Kareem Abdul\nIt's Coolio in the house but you can call me cool\nAn' I gotta keep it real for my peeps on the street\nYou can fill it in your feet or bump it in your jeep\nFrom sea to shinning sea the rows of century\nBend under Sicily I put it down for the G\nFeel the fire, feel the funk\nAn' you better clear the lane when I'm goin' dunk\nI ain't looking for protocol, got sumpin' for all o' y'all\nTo make you get your back up off the ball\nJust put your head to the sky, if you wanna ride\nAnd keep you eye on the flies cause it's live\n(rpt 1)", "image": "https://images.genius.com/80e7d4d7290ea57cc76b3c5e101a8d2f.755x755x1.jpg"}], "artist": "Coolio"}