{"songs": [{"title": "Real Hip Hop", "album": "Kiss of Death", "year": "2004-06-22", "lyrics": "[Swizz Beatz]\nSwizz Beatz the monsta\nReal music (real music) let's go\n\nThe hood's hot! (uh-huh, yeah) The hood's hot! (clap)\nThe hood's hot! (oh, yeah) The hood's hot (yeah, yeah)\n\n[Verse One: Jadakiss]\nYo when I squirt the chrome the funeral home\nGon' double they money this year off my work alone\nSo cool with it, yet and still I'm old school with it\nNobody gotta know who did it\nTwo-thirds of the L.O., where the X at?\nHoodie under the suit jacket, double-breast that\nI'm in the hood like scratch-offs, get them packs off\nLame niggas cuffin them whack whores\nUse of the pick goin back door, no more for the fake\nJust stand there and I'mma dish it back off\nMight lay it up, might not\nNiggas don't be in the wrong place cause it's me in the right spot\nI'm quite hot, y'all niggas is quite pop\nThe record don't sell then I still got light rocks\nLike wearin Timbs with Nike socks\nAnd the lil' bit of money I did make I put it in light stocks\n\n[Swizz Beatz]\nYeah, how y'all doin out there (Jada whattup nigga?)\nHow y'all doin out there? (It's your boy Sheek Louch nigga)\nThe hood's hot! (Thanks for invitin me on this track)\nThe hood's hot!\n\n[Verse Two: Sheek Louch]\nYo if my flow too tight, put the pressure on\nWatch the juice come out like I'm squeezin a Sprite\nMake big deals, get out on big bails\nShit, your career about as short as Amil's (ha ha)\nShit on niggas like I had two tails (damn)\nWith enough bars to open four jails\nIf you don't know nigga, ask Madden\nHow I play with the hammer, in Manhattan\nShank up (yeah) niggas leak enough blood\nTo fill a motherfuckin H-2 tank up\nGetcha bank up (yeah) who you rank up\nGet off his dick and get you a brick (woo!)\nWe done seen every John Woo flick\nSo act like The Killer instead of some chick (bitch)\nFuck a pimp cup, get a plastic one (no doubt)\nPut some 'gnac in that shit and go and get it done\n\n[Swizz Beatz]\nHow y'all doin out there? (You know what they want right)\nHow y'all doin out there? (They want that gangsta shit from us daddy)\nThe hood's hot! (So let that shit hit you)\nThe hood's hot!\n\n[Verse Three: Sheek]\nMe and 'Kiss hot like lava (no doubt)\nWe got sons in the game and we don't need Maury to know who the father\nIf we don't know you, your bars ain't big enough (nah)\nYou need a gimmick, go run around the block with Puff\nGet a Black Phone, rent some of Jigga's stuff\nI'm like T-Dub, you wanna be dubbed (no doubt)\nI was there when a lil' nigga re'd up\nYou ain't Willie, you just act G'd up\n\n[Jadakiss]\nYeah, uh, yo\nI branched out, so you can get the deez\nIn the glass seam bags you can pull the stamps out\nNigga the champ's out, we don't rock loud colors\nWe pop loud guns nigga to stand out\nYou know what it is kid, your man got the money in his crib\nThen we gon' go in your man's house\nDouble R D-Block nigga the camp's out\nCan't forget about Swizz, he blowin the amps out, what?\n\n[Swizz Beatz]\nHow y'all doin out there?\nHow y'all doin out there?\nThe hood's hot!\nThe hood's hot!", "image": "https://images.genius.com/2b764e1a48616aab1941bfc2c79cd515.1000x1000x1.jpg"}], "artist": "Jadakiss"}