{"songs": [{"title": "Make It Hot", "album": "Mr. Smith", "year": "1995-11-21", "lyrics": "[Intro]\nAha , y'nahmean?\nWord up, just wanna bring em to it real\nReal rugged like, uhh, man\nMake me feel like I'm method out and all that, y'nahmean?\nGo diggin, uhh check it\n\n[Verse 1]\nI bring the butter, huh\nMake you wanna creep up on one another, huh\nI'm mad sharp like a box cutter, huh\nI got the fam rollin like brothers, huh\nWe in the mecca, Moey, rollie glistenin\nRainin on niggas so bad they think it's drizzlin\nGround zero funk track it's mega\nDoin wild damage to your arm, legga legga\nWho's that? The bawla, the player, the mister with the techniques\nPumpin blends, creepin up the backstreets\nThrow your rocks up high and let em gleam\nIt's the Uncle what? Uncle L makes a wild scene\nAnd I be blowin all the rookies out the frame\nAnd they be knowin Uncle's flowin in the game\nQueens to uptown I'm gettin down for my crown\nWhen you see me comin thru just gimme a pound\nAnd say....\n\n[Verse 2]\nYeah\nI'm bout to wet it up, get it up\nTake a track, drape it in jewels and set it up\nI'm so nasty with mines, I warm it up like raw liquor\nDime pieces throw it at me like a free picker\nI'm open, I let the funk soak in\nI taste like an eighth, ya freeze and start chokin\nYeah son I'm all up in ya mix\nYa callin in your clique, I'm bawlin wit'cha trick\nGolden rocks fallin off my neck and wrists\nWhen I breeze by, you be groovin in the midst\nOf my cycle, every move I make is vital\nCrucial, official, brothers sayin \"L we miss you\"\nMuch love to all the shooby doobies and cliques\nWhile you're bawlin in the coupe you know I had to get the six\nGet your swerve on boo, chill wit me\nGet me, I want the CREAM, baby hit me\n\nNow take it to the bridge\n\n[Bridge]\n(Keep it comin baby)\n(Keep it comin baby)\n(Keep it comin baby)\n(Keep it comin baby) Keep on\n*repeat x3*\n\n[Verse 3]\nSomebody tell me the way I keep comin up\nFunk runnin up and mad spots is blowin up\nIt gets hot when I manifest melodies\nBeatin niggas all in their heads, so what you tellin me?\nGet your drink on, throw you mink on\nLet your head nod, stick it out, that's what I'm talkin bout\nI got ya deep deep down inside my mixture\nSwervin curbs, servin as I fixed ya\nFormulated and combinated, the people congregated\nYou frontin for nothin, your crew is overrated\nAnd I'ma take it on down to the AM\nKeep the drama flowin til the party cave in\nUhh, I get you open, baby come and get a fix\nYo, that's word to mother I be droppin mad shit\nLet's organise, bounce together for real son\nTrick a little though, sip a little Moe, peace one\n\n[Outro]\n(Keep it comin baby) Keep it goin baby\n(Keep it comin baby) Keep it goin baby\n(Keep it comin baby) Keep it goin baby\n(Keep it comin baby) Keep on\n*repeat x4*", "image": "https://images.genius.com/aba57f7703e47dacfcd5243398922d01.500x500x1.jpg"}], "artist": "LL Cool J"}