{"songs": [{"title": "Ganja Bus", "album": "Till Death Do Us Part", "year": "2004-03-23", "lyrics": "[Damian Marley]\nAll aboard, and jump on a Ganja Bus\nWe nuh under nuh weed, weed under us\nYou rollin' up, roll like it thunderous\nYou smokin' up, Rasta nuh sprinkle dust\nToo much ecstasy, make man a exodus\nToo much fantasy, can't come next to us\nFi di ganja we always notorious\nSo just answer me, if you feel glorious\nWe have weed inna cakes and Oreo's\nBelieve me though, better than your Marlboro\nYou want my roll, on someone you hardly know\nThis Marley bro a tell unno fi take it slow\nYou tell me no, say you want to star the show\nLike who? Johnny Depp and you want to blow\nYou short a breath, that means you are far below\nYou start to take, substances up in your nose\n\n[Hook: Damian Marley - 2X]\nCloud nine ah where you find me\nSome boy wan reach, cloud ninety\nWe're smokin' like a genie\nThe skunky and the greenie\n\n[B-Real]\nOn the ganja bus, they comin' after us\nWe makin' stops all over Los Angeles\nOn the block, where the weed that get scandalous\nWhen we run around, police can't handle us\nThey wanna clout the bus, and on the top be us\nThey never wanna come around, just a rowdy bunch\nTengo el poder, tu no aguantas\nYo sé, que el juego es dificil para usted\nDespiertate, no dejes tu gente ver\nTu situación cuando no puedes mantener\nEn fuerza que nosotros, enseñale\nDeja tu vida sin rastros, escondete\nPortate, we flyin' up to saint tropez\nAnd if you want we can jet through Montego bay\n\n[Hook: Damian Marley - 2X]\nCloud nine a where you find me\nSome boy wan reach cloud ninety\nWe're smokin' like a genie\nThe skunky and the greenie\nSenn Dogg!\n\n[Sen Dog]\nCuando fumo yo no juego, pásame el fuego\nMe lo fumo todo, quememe los dedos\nEn la mańana cuando me levanto\nAntes que nada, yo quemo un pipaso\nEnamorado con la yerba buena\nComida cubana y las nalgas morenas\nTodas las nenas saben que yo tengo\nLas colitas, vete en mi leńo\nNo hay nadie que me quite el vicio\nMarihuano por vida, oiste chico?\nMundo entero quiero que me entiende\nLa Cannabis es buena pa' tu mente\n\n[Hook]\n\n[B-Real]\nIt's so hazardous\nTake a strive with us\nWhen it's over California, we react the bus\nWe fabulous, your talk don't mean jack to us\nBetter fear for your ass when disaster come\nPass ya' blunts, gonna have to mash it up\nFor you conniving mothafuckers wanna stash it up\nYou actin' up, we can't have that's whats up\nListen Muggs on the table gonna slash it up\n\n[Hook] (2x)", "image": "https://images.genius.com/bbdbef4d71e94241d00e6cf766f68925.640x640x1.jpg"}], "artist": "Cypress Hill"}