{"songs": [{"title": "The MC", "album": "I Got Next", "year": "1997-05-20", "lyrics": "Who am I? The MC, la-di da-di\nI don't wear Versace, I wear DJ's out quickly at the party\nWho am I? If you're like me hip hop is in your body\nWho am I? THE MC!\nWhen the jam is slow and you need a proceeder\nWho am I? THE MC!\nWhen you need a lyrical leader wit oratorical triple features\nWho am I? THE MC!\nWhen you need to rock your 3000-seat arena, best believe, uh\nWho am I? THE MC!\nWhen you need to get the word on the street wit demeanor\nWho am I? THE MC!\nI beg thee, let me splurt rhymes, I have plenty\nWho am I? THE MC! Lord have mercy\nI hit sudden like Percy\nAlways New like Jersey, stay thirsty\nWho am I? THE MC!\nShowin my authority, superiority\nAn artistic minority, now you startin me\nCuz party philosophy can only be carried out by\nWho am I? THE MC!\nNo doubt, predicting far ahead what will set the party off immensely\nWith plenty of who? THE MC!\nTrained at Rooftop, Red Zone, Roxy and Bentley's\nWho am I? THE MC!\nGently move crowds with harmonious rhythm\nCuz the lyrics we give em they miss em\nWho am I? THE MC! Again, THE MC!\nHer Infinite Power Helps, Oppressed People sent me to tell you\nIf you truly study lyrical flows and stay on your toes you will be\nWho am I? THE MC!\nAnd as an MC you will study verbal magic\nBut watch what you say cuz you'll attract it\nControl your subconscious magnet from pullin in havoc\nWho am I? The MC!\nNon-stoppin' MC, hip hoppin MC\nVerbal rockin', head knockin', quick droppin' MC\nI laugh cuz I mastered the craft MC\nIn sound clash I'm the first and last MC\nIt's sort of like Jim Carrey throwin' that Mask to me\nI black out and wake up to catastrophe\n3 MC's dead from the sound blowin' out massively, wow!\nWho am I? The MC!\nUntouchable, can't be caught off guard with fast tracks or slow tracks\nAss cracks get waxed to the max, MC's pack raps for all tracks\nIndigenous cultures, Asians, Whites and Blacks\nNever missed it the linguistic of\nWho am I? THE MC!\nMeta-lyrical poetic mystic MC\nHearin the voice of an ancient spirit MC\nPremeditated worder\nKillin negative concepts out the mind of the observer MC\nYou deserve a break from counterfeits, frauds and fakes\nClaimin to be an MC for heaven sakes\nWell, this MC done raised the stakes\nUnder the stress from KRS\nContracts and mental gats are bound to break\nWho am I? THE MC! Again, the MC!\nConduct yourselves properly MC...", "image": "https://images.genius.com/2d8a06de1f39a224dcb05e3e9195e0b4.640x640x1.jpg"}], "artist": "KRS-One"}