{"songs": [{"title": "Issues", "album": null, "year": null, "lyrics": "Needs transcribing\n[Intro: Juice WRLD & G Herbo]\nHit-Boy \nUh,  you know how it is\nSwervo\n[?] Mike Crook\nG.  Ry [?]\n\n[Verse: Juice WRLD & G Herbo]\nAnd  we keep pistols\nRocket launchers missiles\nYoungins  will walk up and hit you\nJuice don't know how to whistle\nWe just trickin' off 62\n[?] spit 62\nHe  don't give a fuck he rich too\nWhy you over here lil' bitch, you ain't fucking is you?\nWe takin' phones in here, we don't want no issues\nRollie plain jane ice, that's an old igloo\nNeed a sweater if you next to me, you ain't cold is you?\nMe and Swerv' bringing issues, issues, issues, issues\nJust like Future got no issues, issues, issues, issues\nMagazine in that Kel-Tec, issue, issue\nYou dying today if we into it\nHerbo tell 'em what we been through\nI was in the funeral with my dawgs\nAnd we tryna eat [?]\nI catch a nigga I still will do\nThat shit forever we been [?]\nI got some real niggas still beneficial\nIf it's about me, they'll get with you\n[?]\nAll my Jays official\nGet your issue, get your issue, keep those bitches with you\nSoon as you understand time is money I don't gotta kick it with you\n[?] can't be on your menstrual\nShe wanna fuck on me and Herbo\nI'ma turn that bitch to Squirtle\nAudemar on my wrist cost 30 Gucci fur coats\nI don't wanna hurt you hop on my dick like you hoppin' a hurtle\nLambo stick shift in my grip, do the turbo\nI got these shells in my house, like I'm collectin' turtles\nYou don't want no issue, issue, issue\nBitch we rich we still'll hit you, hit you, hit you\nHe in his feelings, you want some tissue, tissue, tissue\n[?] he can get this shit too, Juice tell 'em what we been through\nBarely walkin' off the Percs, all this shit I been through\nI lost my brother so I'm try'na do what he would do\nDeep in this street shit had to get physical left a nigga fucked up mental\nToo quick to kill you my anger built up ain't had nobody to vent to\nYo bitch want me to vent to her, fuck her all night\nPercs on me, geek time, rock-star life\nStill be in the traps, ooh\nI'm with them killers from over east I feel like that dude\nRound of applause for this nigga he got clapped, ooh\nCall me crazy, I'ma get that strap, ooh\nG Herbo always offbeat he don't know how to rap, do he?\nHe run up some millions, don't know how to act, do he?\n[?] pack like oowee\nRan a quarter mil up in two weeks\nWe was havin' shootouts in [?]\nMama kicked me out like Bruce Lee\nYou think I'm gettin' some Buffalo wings hopped out [?] with this blue cheese\nTry'na rob, .40 fuck him up [?]\n[?] we losin' [?]\nAnd we ain't doin' no schemes\nWe just livin' our dreams\nWe just doin' our thing\nRockin' Designer jeans\nAnd our watches got bling\nAin't worried 'bout a thing\nHollows gon' pop out, bang\nBank account's green\nHoodies by Supreme\nWhips on gasoline\nCribs big as fuck\n[?] Sutton Springs\nWe ain't stressin' a thing\nMe and Swervo boolin' boolin' up in Sutton Springs (Gang)\nMoney everywhere so put the racks up\n'Cause if the police come you not gonna have no back up\nMe and Herbo sippin' Wock' but we gon' Act' up\nWe gon' Act' up, bitch we gon' Act' up\nPolice comin' through the front I'm out the back, yeah\nDid I say back? I meant I'm coming out the brack, yeah\nEverywhere I go I fucking snap, yeah\nWe on blast, me and Swervo on blast, me and Swervo on blast", "image": "https://images.genius.com/1ff8ab8d3ae5bb47f0797a87d42ddf66.1000x1000x1.jpg"}], "artist": "Juice WRLD"}