{"songs": [{"title": "Stay Woke", "album": "Legends of the Summer", "year": "2018-06-24", "lyrics": "[Intro: Meek Mill]\nHow I keep from goin' under?\nIt's like a jungle outside\nSometimes I wonder how I keep from goin' under\n\n[Verse 1: Meek Mill]\nWe scream, \"Black Lives Matter,\" but we still toting ladders\nWatching our own brothers trying to get at us\nDreams get shattered when a scene full of crackers\nAnd they charge you with some shit you ain't do\nYou like, \"what happened?\"\nWe go get lawyers to say shit, we don't know how to talk\nThey told us to hate each other before we learn how to walk\nMama taught you how to fight, fight, before she taught you how to write, right\nAnd daddy locked down in the cell, can't kiss you night, night\nMonsters under the bed every night, feel like it's fright night\nCoke fumes in the air, mama holding on that pipe tight\nAnd you catchin' contact, but never mind that\nIn a world where Black is wrong and white right, it's like a combat\nWe go to war for our freedom, they say we equal\nI used to wanna play like Randall and be an Eagle\nI used to play the quarterback, my dog would go receiver\nThat was 'til the ball got flat by a dope needle on the pavement\nIt's amazin', this environment we was raised in\nOn them papers, one mistake and I'm gettin' caged in\nYou gotta feel me, feel like the system tryna kill me\nGot arrested and the charges F1 for popping wheelies, stay woke\n\n[Chorus: Miguel]\nIt was designed for us to fail\nWe still prevail through the hell\nYeah, can you believe it? We're still undefeated\nThough it was designed for us to lose\nWe'll still make it through, nothing's impossible\nCan you believe it? We're still undefeated\n\n[Verse 2: Meek Mill]\nPicture me ten years younger with some tats on my face\nTakin' a bunch of Xannys with the strap on my waist\nPointin' it at the camera like mama ain't teach me manners\nTryna see mo' bills like I'm headed to Alabama, no, wait\nI can't judge them, I'm just trying to understand them\n'Cause I used to pop Percs, pourin' purple in my Fanta\nHad me swerving in my Phantom like I'm runnin' from my dreams\nI was headed for the slammer, I was plantin' all the seed\nFor them to bury me, I had my whole family mad at me\nFell deep in love with the game and it married me\nJudge said, \"I'll give you a chance, just don't embarrass me\"\nMotivatin' these little niggas is like a charity\nCommunity service even though they knew we was workin'\nThey did this to me on purpose, 'cause I ain't movin' too perfect\nI stay away from them clowns, watch how I move through the circus\n'Cause they be weighing you down, even some of them dudes in your circle, stay woke\n\n[Chorus: Miguel]\nThough it's designed for us to fail, yeah\nWe still prevail through the hell, yeah\nCan you believe it? We're still undefeated\nThough it was designed for us to lose\nNothing, nothing, nothing's impossible, no\nCan you believe it? We're still undefeated\n\n[Verse 3: Meek Mill]\nHow can I pledge allegiance to the flag\nWhen they killin' all our sons, all our dads?\nI come from a place, when you kill your own brother you can brag\nLike he got bodies, but that's a fad, no, that's a fact\nI'm screamin' out at your corner, nigga, that's a trap\nScreamin' out at your homie, nigga, that's a rat\nCatch a case with him, bet he crack\nThe odds against you and they double stacked, stay woke\nBought my mom a new crib, that's some gangster shit\nNiece and nephews walking around wearing minks and shit\nKept the hood motivated, this the thanks I get?\nTry to Ja Rule the kid on some Wanksta shit\nBut that's impossible 'cause I'm unstoppable\nThe label can't drop me, nigga, I'm too valuable\nYou thought I would lose but I won and that bothered you\nStill movin' 'round in Philly just like the mobsters do\nWhen I talked to Em and Hov, they said, \"I'm proud of you\nYou stood tall back when everyone doubted you\"\nMy reply is, \"I did what I gotta do\nAnd I need that verse 'fore you retire too\"\nJumping all the obstacles, I'm way too wavy\nSaid I would lose boy you way too crazy\nPick and choose either fame or the money, fame will make you crazy\nAnd the money will make them bad bitches say, \"Thank you, baby\"\nYou're welcome", "image": "https://images.genius.com/5ad54542b169369767afef858bd7458d.940x933x1.jpg"}], "artist": "Meek Mill"}