{"songs": [{"title": "The Realist Killaz", "album": "Tupac: Resurrection", "year": "2003-11-11", "lyrics": "{Gunshot}\n[Man talking]\nYo, Red Spyda (ooh-wee) is that 50 Cent/Pac joint ready?\n{Gun cocking} Let me know, holla {Gunshot}\n\n[2Pac - from the song \"Smile\"]\nThere's gon' be some stuff you gon' see\nThat's gon' make it hard to smile in the future\n\n[50 Cent talking]\nYeah nigga! Haha\nLet's go nigga, this is what it is\n2Pac cut his head bald\nThen you wanna cut yo' head bald (You pussy nigga!)\n2Pac wear a bandanna\nYou wan' wear a bandanna\n(What do we have here now?)\n2Pac put a cross on his back\nYou wanna put crosses on yo' back\nNigga you ain't 2Pac - This 2Pac!\n\n[Verse 1: 2Pac]\nIs it, money or women to funny beginnings, tragic endings\nI can make a million and STILL not get enough of spending\nAnd since my life is based on sinning, I'm hell-bound\nRather be buried than be worried, living held down\nMy game plan to be trained\nMilitary mind of a thug lord, sittin' in the cemetery cryin'\nI've been lost since my adolescence, calling to Jesus\nBalling as a youngster, Wondering if he sees us\nYoung black male, crack sales got me three strikes\nLiving in jail, this is hell, enemies die\nWonder when we all pass is anybody listening?\nGot my, hands on my semi-shotty, everybody's listenin'\nPlease God can you understand me, bless my family\nGuide us all, before we fall into insanity\nI make it a point, to make my peep bumpin' warlike\nDrop some shit, to have these stupid bitches jaws tight\n\n[Hook: 50 Cent + (2Pac)]\n'Till Makaveli returns, it's \"All Eyez On Me\"\n(What do we have here NOW?)\nAnd you can hate it or love it, but that's what it's gon' be\nYou should've listened, I told you not to fuck with me\n(What do we have here NOW?)\nNow can you take the pressure, that's what we gon' see\n[Gun cocking, gunshot]\n\n[Verse 2: 50 Cent]\nNow since you're crying for mercy I promise\nMy success'll be the death of you\nLo and behold you sold your soul\nNigga there's nothin' left of you\nLook in the mirror, ask yourself who are you?\nIf you don't know who you are, how could your dreams come true?\nMotherfucker, I sat back and watched\nYou pretended to be 'Pac, you pretended to be hot\nBut you're not (now) - I see it so clear\nYou can't take the pressure, you pussy\nI warned you not to push me\nYou see me and chills run up your spine\nGod made men the same boy, but your heart ain't like mine\nPress, they look at me like I'm a menace\nI was playing with guns\nWhile your momma had your punk-ass playing tennis\nI'm a nightmare, you see me when you dream\nWake up, turn on your TV and see my ass again\nYou cowardly-hearted, you couldn't make it on your own\nFuck The Source, I'm on cover of Rolling Stone\nHahahaha\n(You pussy!)\n\n[Hook x2]", "image": "https://images.genius.com/372d7337fb25b091107b435b777f00bd.1000x970x1.jpg"}], "artist": "2Pac"}