{"songs": [{"title": "Pressure", "album": "Lupe Fiasco’s Food & Liquor", "year": "2006-09-19", "lyrics": "[Intro: Lupe Fiasco]\nRoc-A-Fella\n1st and...!\nJay!\nLupe!\nYeah!\nUgh!\n\n[Verse 1: Lupe Fiasco]\nAnd so it seems that I'm sewing jeans\nAnd 1st and 15th is just a sewing machine\nSo I cut the pattern and I sew its seams and\nButton in this hustling, then, publicly, I'm Buddy Lee\nThere's no busting them\nAnd cuffing them is like ushering in the regime\nThey want me to make Prince pants\nBut I withstand, I ain't gotten into that\nA little big in the waist, two-pocket on the back\nCall them Lu-vi's, old jeans covered in blue dye (Woo!)\nGive 'em the game, that's like giving chocolate to the fat\nLook: how you think I got here?\nThat's the same game that came through where I lived as a kid\nIn the bad luck truck and threw boxes off the back\nMade me a ripper, deliver like river\nContent a lil' more thicker, slicker, yeah!\nAnd they said oil and water don't mix\nNow they all down at the beach, washing off the fish\nWas Blackbeard 'til I brought the Roc into your ships\nYeah!\n\n[Chorus: GemStones]\nIt's my life (My life)\nEverything I do I do for you (I do it all for you)\nEverything I say, you know it's the truth (I'll say it is the truth)\nI'll take all the pressure off of you (Take pressure off of you)\nI'll take the pressure off of you\n\n[Verse 2: Lupe Fiasco]\nYeah! Uhh, it's hella proper (proper)\n'Cause it sag so low you can see boxer—like a boxer's\nThat's the way that the family's pants worn\nDon't be sly and try and put 'em on\nThe stones in the pocket'll drag you down to Davy Jones' locker\nBeware if you wanna rock the Knickerbocker\nOther nigga from the block what, they was selling O's\nLike Wheel of Fortune, of imported cocaine\nJust to feel important, it was \"Do or Die\"\nThey was tired of being \"Po' Pimps,\" not for sure (Sure)\nThat was just a product of my common sense (Sense)\nI guess, I was just guessing like the consonants\nMomma said, \"Beware of what the devil do\"\n\"Tell 'em that your soul's not for sale like the Ws\"\nSo go 'head and pirate the highest\nCannons make you leak like, pirated my shh...\nIt's no shh.. it's just shh like quiet\nAnd big homie's out of retirement, nigga\nYessir!\n\n[Chorus: GemStones & Jay-Z]\nIt's my life (My life)\nEverything I do I do for you (I do it all for you)\nEverything I say, you know it's the truth (I'll say it is the truth)\nI'll take all the pressure off of you (Take pressure off of you)\nUnh!\nI'll take (Young!) the pressure off of you\nUnh!\n\n[Verse 3: Jay-Z]\nSo the pen is mightier than the sword, my Lord\nMy first picture was a line-up, now I'm on the Forbes (Unh)\nAnd I still remain the artiste through thees all\nIf you force my hand, I'll be forced to draw (Hahaha)\nIf the war calls for Warhols\nHope you got enough space on your hall's walls\nI make niggas murals, then escape the Bureau's investigation\nOut in Europe on vacation\nI'm back for these puppies with the pound, boy (Rrrrra!)\nHere's a round, boy (Rrrra! Rrrra!), down, boy\nSound boy, you don't wanna sound-clash; loud noise\nLeave niggas paranoid if not paralyzed\nWhich means you can't walk in my shoes\nToo much green; you can't talk in my hue\nExtend the team, nigga, holla at Lu'\n1st and 15th, that's my cue\nI'm through\n\n[Chorus: GemStones]\nIt's my life (My life)\nEverything I do I do for you (I do it all for you)\nEverything I say, you know it's the truth (I'll say it is the truth)\nI'll take all the pressure off of you (Take pressure off of you)\nI'll take the pressure off of you", "image": "https://images.genius.com/373c57c9cfddd95f1d232784084809ba.500x500x1.jpg"}], "artist": "Lupe Fiasco"}