{"songs": [{"title": "I’m Still #1", "album": "In Tha Beginning... There Was Rap", "year": null, "lyrics": "Artist: Cypress Hill\nAlbum:  In Tha Beginning... There Was Rap\nSong:   I'm Still #1\n\n[B-Real]\nFunkmaster Flex, is down with us\nKRS-One, he's down with us\nThe Wu-Tang Clan is down with us\nBusta Rhymes you know he's down with us\nNaughty and Fat Joe are down with us\nThe MAAD Circle are down with us\nDef Squad, is down with us\n?DN's and Mike M? are down with us\nDr. Dre you know he's down with us\nJulio G he's down with us\nSway and King Tech, are down with us\nMakin funky music is a must... I'm #1! *one echoes*\n\nPeople still takin rappin for a joke\nA passing hope, or a phase with the rope\nSometime I choke and try to believe\nWhen I get challenged by a million MC's\nI try and tell them, we're all in this together\nMy album was raw, because no one would ever\nThink like I think, or do what I do\nI stole the show, then I leave without a clue\nWhattayou think makes up Cypress Hill?\nConcisive teaching, or very clear speaking\nRidiculous bass, aggravating treble\nRebel, renegade, must stay paid\nNot by financial aid, but the break of hits\nCausing me to take long trips\nI'm the original, teacher of this type of style\nRockin off beat with a smile or smirk\nOr chuckle, yet some are not up to\nCypress Hill Posse, so I love to\nStep in the jam and slam, I'm not Superman\nCause anybody can\nOr should be able, to rock a turntable\nGrab the mic, plug it in and begin\nBut here's where the problem starts, no heart\nBecause of that, a lot of groups fell apart\nRap is still an art, and no one's from the old school\nCause rap is still a brand new cool\nI say no one from the old school cause rap on the whole\nIsn't even twenty years old\nFifty years down the line, you can start this\nCause we'll be the old school artists\nAnd even in that time I'll say a rhyme\nA brand new style, ruthless and wild\nRunnin around, spendin money havin fun\nCause even then, I'm still #1! *one echoes*\n\nSoul Assassin crew of course\nComes to express with styles galore\nWays of rhyming, old and new\nPast and present, knock knock who is it?\nA brand new style, RRRAH time to change\nPeople talk about me when they see me on stage\nLive in action, guaranteed raw\nI hang with the rich and I work for the poor\nAnd after all you can say you saw\nCypress Hill, stompin once more\nI play it by ear, I love to steer\nThe fifty-seven Bel Air from here to there\nI grab the beer, but not in the ride\nCause I'm not stupid I don't drink and drive\nI'm not a beginner, amateur or local\nMy album is sellin, because of my vocals\nYou know what you need to learn?\nOld school artists don't always burn\nYou're just another rapper whose had his turn\nNow it's my turn, and I am concerned\nAbout idiots, posing as kings\nWhat are we here to rule, I thought we're 'sposed to sing\nAnd if we are to sing, then let us begin to teach\nMany of you are educated open your mouth and speak\nA Cypress Hill soldier, is something like a total renegade\nExcept I don't steal I rhyme to get paid\nAirplanes flyin, overseas people dyin\nPoliticians lyin I'm tryin\nNot to escape, but hit the problem head-on\nFrom bringin out the truth in the song\nSo C-H-P short for Cypress Hill Production\nMade a little noise cause the crew was sayin somethin\nPeople have the nerve to take me for a gangsta\nAn ignorant one, somethin closer to a prankster\nDoin petty crimes goin straight to penetentiary\nBut in the scale of crime that's really elementary\nThis beat is now compellin me, to explain the silence\nWhy my last jam was so violent\nIt's simple, Cypress Hill will teach reality\nNo beatin around the bush, straight up, just like 'My Weed is Free'\nSo now you know, a poet's job is never done\nBut I'm never overworked, cause I'm still #1! *one echoes*\n\nMC Eiht, he's down with us\nBig Boy and Ralph M are down with us\nReFugee Camp, is down with us\nKhartoum and Vigga V are down with us\nCall O' Da Wild is down with us\nPsycho Realm, is down with us\nLifestyle Car Club is down with us\nMakin funky music is a must, I'm #1! *one echoes*", "image": "https://images.genius.com/fe8aada78f9aa9e48b6c14b0b7ee2fd9.301x300x1.jpg"}], "artist": "Cypress Hill"}