{"songs": [{"title": "King Pinz", "album": "The Vatican Mixtape, Vol. 1", "year": null, "lyrics": "[Intro: Raekwon]\nBeing's that it's gettin' ready to go\nYo, you know that sound? Yeah, some bad from here\nYeah, this real right here, I'm back, boy\nI'm back... that's my word, it's goin' down, man\nWatch my voice man\nDifferent from other cat's voices, man, remember that, man\nDifferent flows, man\n\n[Raekwon]\nAiyo, lace these niggas with fire fire\nYou been away for a minute, heard your style got flyer\nYo, hold on, the sword got heavy, Universal caught on\nNow its time to take over the melody\nPlus stand firm, Staten Island kingpins\nInk pens go to work, and I got ninjas who speak French\nMy flow, God, build for sevens and fives, straight up big shits\nSprewell wheels, kids with bee hives, I'm old school\nGot a old tool, plus rollin' with the old crew\nRicher than The Jackson 5\nI kill for money, rap ain't nothing\nI'm a real estate slave, chump, and I got some money in Vibe\nRead the news, now, Chef coming for you, reviews gon' start poppin' up\nYou, crews start lockin' up\nYeah, think that I'm playin', I got\nTwo red assault rifles, ready for your wig, I'm sprayin' shit\n\n[Interlude: Raekwon]\nUh, uh, exclusive boy\nLet's do it to them, aiyo\n\n[Raekwon]\nAiyo, flashin' in a robe from England\nHeavyweight slap gannon king, and I do the raft thing, blaze niggas\nForty acres of land, eleven guns, Moore soft leathers\nWhy we keep rappin' in the slums?\nHibernate with big hammers, elephants hands\nThe Fila shits, support Ralley's, robbin' in Sam's\nTell the media we generation money\nBoth hands is clusty, but I rather be in Russia spendin' trust money\nFeel the sleeves? Thats ostrich\nMutiple v's, my own company, with forty eight mobsters, yo\nRob niggas on the hurry, get busy, pull out them tranquilizer guns\nBye sleepy head, get jiggy\nFor all the regulator soldier, I demonstrate the lifestyle\nOf gettin' knifed down, I might pop you over\nCome up, try soldier\nCivilize your whole life, fast, ya'll ain't fly, rover\nDon't test me, pa, you're playin' with death\nWhat you think they call the kid Chef for, I poison up vets\n\n[Interlude: Raekwon]\nAnd I told you baby, it's goin' down\nWord up, you know how we give it to 'em\nWord up, what's the deal, though, nigga\nWord up, one, aiyo\n\n[Raekwon]\nAiyo, I said it, I meant it, I lived it\nThe legend rep, for all real niggas, on the set, don't ever go against him\nLive for the action, a warrior\nWu taught me that, though\nNow I go for self, Van Glorium\nI've been carryin' on cats, I'm like Hitler on diesel\nExecute them Purple Tape thieves, yo\nYa'll niggas ain't nothin', I've been on\nI told ya'll what I wanna do\nWatch me get the glow, when I get on", "image": "https://images.genius.com/6a8b7e152802d68a042f150de8d50c5d.820x820x1.jpg"}], "artist": "Raekwon"}