{"songs": [{"title": "Last Call", "album": "YSIV", "year": "2018-09-28", "lyrics": "[Intro]\nAyo real talk, 6ix\nAs soon as you played me this joint, I already knew\nI was like, \"Yo, this some fucking, 'Last Call' shit\"\nAnd it got me hella excited 'cause I always wanted to do like\nA \"Last Call,\" I remember the first time I heard Kanye's\nI thought that shit was so tight, dawg\nAnd I was like, man I'm tryna tell my story, you know what I'm sayin'?\nAnd then uh, I remember Cole did it, when did he do it?\nHe was on Friday Night—\nNah, nah, he did it on The Warm Up yo\nAnd when he did the \"Last Call\" on The Warm Up, I was like \"Damn, I'm tryna do mine\"\nSo since—since this joint got that vibe, I'ma do my own \"Last Call\" right now for y'all\nAnd my voice is messed up too, this is the last track of Young Sinatra\n\n[Verse 1]\nYeah, yeah\nBack in the day I wasn't shit, homie\nPenny pinchin', I couldn't even pay the rent, homie\nThinkin' 'bout it I wonder where them years went, homie\nJust a youngin' tryna survive, they was hatin' on me\nI was working that nine-to-five, I was waitin', homie\nI was bussin' tables fantasizin' 'bout cakin', homie\nLetting 'em slip away my dreams, wasn't waitin' on me\nThis for anyone with ambition, calling anybody that'll listen\nI'm wishing all your dreams come true, 'cause mine did\nAnd yeah, you know I had to put that in the rhyme kit\nBut that shit came from sacrifice\nNot on the corner selling drugs and smackin' dice (Listen)\nYeah\n\n[Bridge]\nSomeway, somehow, I understood finally\nIf you want to come and get it, you know where to find me\n'Cause I ain't got no time for anybody that be tryin' me\nKnow if they don't understand, I'ma leave 'em behind me\nObviously\nI ain't got no time, no, no\nI said obviously\nI said I don't got no time, no, no, no, no, no\n\n[Verse 2]\nYeah, yeah\nI treat the beat like it's my only son, my DNA\nAnd this that Southernplayalistic shit like we was in the A\nBack in the day, I was Young, Broke & Infamous\nA Young Sinatra that was Undeniable\nWho Welcome-d you To Forever while Under Pressure\nAnd told you The Incredible True Story of Bobby Tarantino\nAnd Everybody in the Ultra 85\nGoddamn, it feel good to be alive\nAnd all these bitches that I passed up\nCouldn't fuck witcha 'cause your hair was too gassed up\n'Member creeping with the gat, masked up\n\n[Interlude]\nGod damn, it's kinda crazy to reminisce on all this shit man\nWhat it was like growing up\nDamn man, just, motherfuckers running in and out of the crib\nDoing drugs, selling drugs, all types of stuff\nMeanwhile, I was just tryna keep it together\nI was tryna make sense—sense of all this shit around me\nI didn't know how to take it, how to perceive it, you know what I mean?\nAnd then meanwhile I'm supposed to be going to school and getting good grades and shit\nBut I'm seeing like, domestic violence in my house\nAnd just, so much going on\nAnd I'm sure everybody was probably like, \"Man, yo\"\n\n[Verse 3]\n\"Why little Bobby didn't come to school today?\"\nOn the real, I was doin' anything to run away\nAnd that's the same reason kids join gangs every day\n'Cause they wanna be accepted, but at home they too neglected\nMeanwhile, white America quick to call him a thug\nBut all he ever wanted was a father to give him some love\nTell him that he love him, that he need him\nPromise he won't ever leave him\nNever smoke crack, never lie, and won't never beat him\nIt feel like for my life I been needed a break\nLooking at my family, I ain't wanna make the same mistake\nAnd I know that shit sound fucked up but they not all doin' great\nOh God, please\nCan I have a conversation with a member of my family without it ending asking me for five G's?\nTo pay they bills or they lawyer fees (Huh)\nI learned something, I ain't giving y'all a dime\nI'll give you something worth more—that's my time\nI ain't dropping stacks, I'm dropping knowledge\nUnless it's for my nieces and nephews to go to college\nAnd hit me on the phone, hit me up\nLike, \"Uncle Bob, where you at?\nYeah, I know your pockets fat but I don't give a fuck 'bout that\nI'm glad we family\" (Uh)\nWe a half-breed family, yeah, yeah, uh\n\n[Interlude]\nMan, see, I remember when I was like fifteen years old\nAnd my dad took me to the studio\nI know this is random, I'm tryna take you guys through it, right?\nAnd, I'll never forget it, I had like eight rhyme books\nHe'll tell you—he'll tell you, man\nI just, I went through them motherfuckers\nI was rapping for like fifteen minutes straight\nAnd that was my first time, yo\nI was like tenth grade, in the studio\nAnd I knew that this was what I wanted to do\nI knew it\n\n[Verse 4]\nI knew it ever since I first saw Kill Bill\nI been flowin' like that blood, Uma Thurman spilled\nNone other than the RZA, yeah he did the soundtrack\nAnd then I discovered Wu-Tang soon as I found that\nAnd then Big L, Mos Def, and Nas, it wasn't no turning back\nI couldn't change it if I tried, homie, how 'bout that?\nSee, I'm a student of the game, so simple and plain\nBut I'ma take it back to before I ever sat first class on a plane\n\n[Interlude]\nI was in College Park, right?\nWell I guess, technically, if you wanna go before that\nI was uh, I was living in Germantown\nUh, nah, actually it was Montgomery Village\nBack in Maryland, I was living in my sister's basement\nAnd then some shit happened, you know, she kicked me out\nIt was Christmas, whatever, I love you Genie\nAnyway, so shit happened, and then I just kept it pushing\nYou know, I was homeless for a little while, whatever, you know\nI went, uh, I stayed at my—my mentor's house, Solomon\nUh, and then I stayed back at my—my godparents' house\nMary Jo and Bernie, I love y'all\nUh, Mary Jo, I'm sorry, back when I used to smoke\nI would steal the shit out of your cigarettes\nI love you, I'm sorry about that, but\nYou remember—always she would let me record\nI'd always be recording in the attic or wherever I could, so\nI love you—thank you for supporting me there\nBut then, she was like, \"You gotta get the fuck outta here\" too\nAfter a while, she gave me some time\nBut like, I was twenty years old at this point\nShe was like, \"Nah, you gotta get the fuck outta here and do something with your life\"\nAnd this was right around the time that I opened up my first show ever for Ghostface Killah man\nIn Gaithersburg, right in Old Town\nThe shit was insane, I'll never forget it\nAnd that's where I met my boy Lenny, Big Lenbo, wassup!?\nThat's right, man, we just started kicking it and hanging\nHe lived in College Park, and before I knew it I was living—I was living with him in his basement\nAnd this was right around the time I met 6ix\nAnd 6ix was going to the University of Maryland at the time, which was right down the street\nSo I'd always go to their dorm room\nI remember—there was nights I would just crash in the dorm when we was making beats\nWe was doing all types of shit man\nWhen we first got out, we did the first Young Sinatra\nAnd now we on the fourth Young Sinatra, motherfucker! That shit is crazy man\nAnd I remember like, I used to steal quarters from Lenny just so I could go to the 7-11 to eat\nAnd he was like, \"You idiot, why are you stealing? Just ask me, bro\" And I was supposed to get a job, I was—see, I was sleeping in, uh, his basement on the couch\nWhich is the—the, the cover to my first album, Under Pressure\nShout out Cathy, shout out the Rosado family, all my beautiful brown people!\nWe made it, it's crazy\nBut nah, nah, listen, I'm getting ahead of myself, I'm getting ahead of myself\nSo like, I was staying with him and I was supposed to get a job, right?\nAnd he was like, \"Yo, you gotta get a fucking job, bro\"\nThings were going so good with the music that we kinda stopped talking about it\nIt seemed like every week something new was happening\nAnd I just sat him down one day and I was like, \"Look bro, I—please, like, can you just give me one year, like just give me one year, man, let me put everything into this, and if I don't get it, fuck it, I'll just submit, and I'll just—I'll just blend into society.\"\nAnd he was like, \"Bro I'ma give you one year\"\nAnd for one year him, his family, all the homies, Benny, everybody man!\nThey took care of me, they put—he put clothes on my back, he put food in my stomach\nYou know, he helped me with microphones, and recording\nAnd yo, almost a year to the fucking day bro, I signed to Def Jam\nAnd my man, he was a land surveyor, out there like making sure all the buildings get built\nRain, snow, sleet, all that shit for twelve years, dawg!\nAnd when I signed my deal I said, \"Fuck that! Quit your job, we're moving to LA!\"\nThis shit was crazy, so we get to LA\nWe're staying off Coldwater Canyon\nAlta Mesa, in Studio City, man\nAnd I'm going to the studio with No I.D. every day\nAnd uhh, like, shit is crazy\nThat's the first time I met Cole, yo shout out Cole, that's my fucking boy\nBig Sean, all these homies, man, that I met, it was crazy\nDon Cannon, everybody\nThat's when I first met Kev\nBobby, my engineer—what up Bobby?\nIt was just like, life was insane\nI dropped, uh, Young Sinatra: Undeniable, and that was crazy\nThat was insane, 'cause that was the first time\n\n[Verse 5]\nMe and my boys ever hit the road\nOn the real, you know we went from zero to overload\nPerforming in front of the fans, had they hands waving\nThis is all I ever wanted, this is all I'm craving\nMe and my boy Chris shocked the game\nTwo visionaries on a mission, shit ain't been the same\nSome ups and downs came around, had a lot of problems\nBut no matter what happen, you know we'd always solve 'em\nYeah, we'd always solve 'em, like\n\n[Interlude]\nMan, it's kinda crazy thinking about it though\nLike, so much has happened yo\nAnd I mean shit, by the time y'all are hearing this, I'm 28\nI'm 27 while I'm recording it\nI mean, right now, literally, I'm working on Bobby Tarantino, Ultra 85, Young Sinatra IV\nAnd a whole bunch of other shit, man this is crazy!\nActing, writing, like\nI'm just—I'm just so, I can't believe I'm here, man\nWe grinded for so long, we worked for so long, yo\nAnd motherfuckers, they hate you, man\nThey try to make me feel bad about how I look, how I speak\nHow I rap, how I act, my race, my everything\nThey just—they, they fucking hate you man\nThey'll hate you when you're in this position\nBut you can't let 'em—you can't let 'em, you can't let that shit get to you man\nContinue to persevere, continue to be the best you you can be 'Cause I'm here right now man, best friends\nI got everything I could ever want man\nEven though you always want more deep down\nAnd you got goals deep down, that's great man, but fuck that shit\nI'm so happy, I'm so blessed, man\nSo if you're listening to this right now\nNo matter how old you are, how young you are\nWhether you on the school bus headed to get your education\nOr you driving home from work pissed off at your boss\nJust, man, just please do what you love in life\nSo many people, they always say, how, \"Oh, you know, I would do this—but,\" or \"I can't, because\"\nAnd you already fucking lost, they lost\nAnd I feel bad for that person 'cause that person will never make it \"I would, but I don't have the money,\" \"I would, but I don't have the time\"\nFuck that, you gotta do it man\nYou gotta do what makes you happy\nYou have to live selfishly in that aspect\nStop worrying about others, stop freaking out\nJust focus on yourself, man, and your own happiness\nThat's the realest thing\nAnd that's all I can tell you, because\nYou can't help anybody else until you can help yourself, you know what I'm saying?\nSo please, put the—put the mask on first, like they say on the airplane, cuz\nPut your—put your own motherfucking mask on\nAnd go do it man\nGo do it, just live your life\n\n[Outro]\nI love y'all, thank you so much for tuning in\nUh, I hope you've enjoyed this Young Sinatra experience, I know I have\nUh, this is prolly gon' be the last one though\nUh, this gon' be the last one for sure\nI'm coming back with some fun, but, I don't know\nI love you guys! Ultra 85's gonna be crazy! I mean, crazy! Bobby Tarantino's that trap shit, woo!\nWe took 'em back with this boom bap\nNow we, we finna head to the future\nWe ain't scared, we makin' music for everybody, you know what I mean?\nI love y'all—look at that Murrland accent coming out\nI don't know why, every time I get on the mic that Murrland accent\n\"Go ahead 'cuh,\" \"jah like\" all day, boy, you sound like Wale, back of your neck, haha\nI love y'all so much\nRattPack\nYeah, yeah\nYeah!", "image": "https://images.genius.com/04d1c970904a534f622b012d9599fc9b.440x440x1.jpg"}], "artist": "Logic"}