{"songs": [{"title": "Pronto", "album": "Malice N Wonderland", "year": "2009-12-01", "lyrics": "[Intro: Snoop Dogg]\nWhat it do? Coming at you live, it’s your boy big Snoop Dogg\nGot my nephew Soulja Boy in this mothafucker\nWe need you to move like pronto, like expeditiously\nMatter fact. Soulja Boy holla at 'em nephew - ya dig!\n\n[Hook: Soulja Boy]\nPronto, you known' how we ball\nShe dancin’ on my drawls, with my back against the wall\nS.O.D boys, got our money sittin’ tall\nWhile your money sittin’ small\nLet me make a phone ciz-allll! ciz-alllll\nI’m callin up my boyz, they’re gonna bring the noise\nWhen we hit the dance floor\nMy team hardcore, all the girls do adore\nBouta do the gang rock til my feet get sizzz-ore\nSizzz-ore\n\n[Verse 1: Soulja Boy]\nStep on the scene, make the haters say dammit\nSoulja Boy Tell ‘Em hottest rapper on the planet\nYa’ girl love me and I know you can’t stand it\nGoth-em city doors got ya boy Batmanin’\nYa’ girl go hard like Dikembe Mutombo\nSoulja number one but I ain’t talkin bout the combo\nS.O.D. boss [yeah] I’m the head hon-cho\nWalk inside the club, I need V.I.P pronto\n\n[Hook: Soulja Boy]\nPronto, you known' how we ball\nShe dancin’ on my drawls, with my back against the wall\nS.O.D boys, got our money sittin’ tall\nWhile your money sittin’ small\nLet me make a phone ciz-allll! ciz-alllll\nI’m callin up my boyz, they’re gonna bring the noise\nWhen we hit the dance floor\nMy team hardcore, all the girls do adore\nBouta do the gang rock til my feet get sizzz-ore\nSizzz-ore\n\n[Verse 2: Snoop Dogg]\nGet it in, get it out, turn it up, turn it down\nBig Snoop Dogg and Soulja Boy, told ya boy in your mouth\nMake it bang, make it bounce, break it up, take it out\nNigga what you talking about? Snoop Dogg walk it out\nGo to work, do the jerk, do it till your head hurt\nWe the west, just the turf, known throughout the universe\nSuperman and Kyptonite all on the same mic\nSend us some bad bitches like\n\n[Hook: Soulja Boy]\nPronto, pronto, you known' how we ball\nShe dancin’ on my drawls, with my back against the wall\nS.O.D boys, got our money sittin’ tall\nWhile your money sittin’ small\nLet me make a phone ciz-allll! ciz-alllll\nI’m callin up my boyz, they’re gonna bring the noise\nWhen we hit the dance floor\nMy team hardcore, all the girls do adore\nBouta do the gang rock til my feet get sizzz-ore\nSizzz-ore\n\n[Verse 3: Soulja Boy]\nMic check 0 1 2 3\nI don’t freestyle cuz my style ain’t free!\nLyrical criminal most have battled for national, Soulja no limit\nBut im not talking bout Master P\nI’m in my tour bus a lot and groupies in back of me\nEvery photoshoot, interview, video, shoot a magazine\nMy flow is so sick, the number one off of iTunes\nMy flow, quick, can lay you quicker than the fuckin’ swine flu\n\n[Hook: Soulja Boy]\nPronto, pronto, you known' how we ball\nShe dancin’ on my drawls, with my back against the wall\nS.O.D boys, got our money sittin’ tall\nWhile your money sittin’ small\nLet me make a phone ciz-allll! ciz-alllll\nI’m callin up my boyz, they’re gonna bring the noise\nWhen we hit the dance floor\nMy team hardcore, all the girls do adore\nBouta do the gang rock til my feet get sizzz-ore\nSizzz-ore\n\n[Verse 4: Snoop Dogg]\nAll black hooded up, nigga we can get it up\nYa, you can set it up cuz we will neva let it up\nAnd I’ll do it till you get enough, and I beat you dead and red and stuff\nWhat it do, what it is, I see you haven’t read enough\nThis is the life I chose for me and this is the way I chose to be\nA lot of fools is hating me but that’s just the way it’s supposed to be\nNever went, against the grain, always banging 20 gang\nStand for something dawg or you gonna fall for anything but later for that\nYeah, I got my swag back, I’m with the Soulja Boy, now nigga bag, back\nFor them GCs and TCs we in the VIP, blowin on some Laker purple trees\nJerkin knees, workin these cute bad bitches\nI think they Vietnamese, we gonna get them for their cheese\nBreak it down, spread it round, fire a pound\nPut it in the air, right now like pronto\n\n[Hook: Soulja Boy]\nPronto, pronto, you known' how we ball\nShe dancin’ on my drawls, with my back against the wall\nS.O.D boys, got our money sittin’ tall\nWhile your money sittin’ small\nLet me make a phone ciz-allll! ciz-alllll\nI’m callin up my boyz, they’re gonna bring the noise\nWhen we hit the dance floor\nMy team hardcore, all the girls do adore\nBouta do the gang rock til my feet get sizzz-ore\nSizzz-ore\n\n[Spoken Outro]\n“Ladies and gentlemen, we are now approaching 35,000 feet\nHope you’re enjoying your ride through Wonderland\nI am your flight attendant Boss Lady\nTurn your bottles upside down and your blunts in an upright position\nAnd please remain seated until the flight has come to a complete stop\nThanks for flying the friendly skies with your friendly captain Snoop D-O-double-G aka The Homey”", "image": "https://images.genius.com/a9730b160b9e646d986f0b4659d2dc40.800x800x1.jpg"}], "artist": "Snoop Dogg"}