{"songs": [{"title": "Swing My Way", "album": "No Genre Pt. 2", "year": "2014-07-06", "lyrics": "[Produced by: B.o.B]\n\n[Intro: Sevyn Streeter]\nShawty swing it my way\nWhat you waiting for baby?\nAre you gonna take it?\nWon’t you please swing it my way\nShawty swing it my way\n\n[Verse 1: B.o.B]\nI was out on the town, whipping and swinging\nGot my head on a swivel ‘cause niggas be scheming\nI had just got off the phone, my partner told me “be easy”\nIt ain’t got no definition, we just all know the meanings\nI pull up to the spot, told the valet to leave it\nRunned into a little cutie she look like Jennifer Freeman\nA couple feet to my right, i could see she was speaking\nI couldn’t hear what she was saying ‘cause the DJ was screaming\n\n[Pre-Hook 1: B.o.B]\nSo I walked over to her slowly, she don’t smoke and she don’t drink\nWell you gon’ fail your drug test ‘cause all I got is dope D\nI know you don’t know me, but you could be my only\nShe whispered in my ear and this is what she told me\n\n[Hook: Sevyn Streeter]\nShawty swing it my way\nWhat you waiting for baby?\nAre you gonna take it?\nWon’t you please swing it my way\nShawty swing it my way\nShawty\nIf you’re feeling how I’m feeling then probably\nThere’s a million ways that we can get it started\nI’m feeling so naughty\nSo, swing it over here shawty\n\n[Verse 2: B.o.B]\nThey say it’s better to give than it is to receive it\nThat’s why I give her all I got, my bad for overachieving\nGet your ass out them secrets from Victoria’s Secret\nBack and forth with those lips, now that’s a verbal agreement\nYou say your man out of season, he probably cheating\nThat booty the dumbest, but that head is a genius\nYou could check out the stroll, you swear I was skiing\nFell asleep in that pussy, woke up, thought I was still dreaming\n\n[Pre-Hook 2: B.o.B]\nBut then she pull me close and cozy, she don’t smoke and she don’t drink\nWell you gon’ fail your drug test ‘cause all I got is dope D\nI know you don’t know me, but you could be my only\nShe whispered in my ear and this is what she told me\n\n[Hook: Sevyn Streeter]\n\n[Outro: Sevyn Streeter and B.o.B, Union]\nYou looking good shawty, good, sure enough, good enough for me (x3)\nYou looking good shawty\nSo bring it over to me\n\n[Outro: Sevyn Streeter]\nI’ll love you right, all day and night\nEverything that you want, boy already know\nSo you gonna see, how good it can be, come home with me. oooh\nI been watching you from across the room\nI wanna know your name, won’t you swing my way?\nShawty come my way, swing my way\nOooh, swing my way, swing my way\nSwing my way, shawty, oooh", "image": "https://images.genius.com/07af9b12b2956baf31b88d2ae47697d2.500x500x1.jpg"}], "artist": "B.o.B"}