{"songs": [{"title": "Drunk Tunes", "album": "Meth Lab Season 2: The Lithium", "year": "2018-12-14", "lyrics": "[Intro]\nHands up (Hands up)\nHands up (Hands up)\nHands up (Hands up)\nHands up (Hands up)\nHands up (Hands up)\nHands up (Hands up)\nHands up (Hands up)\n(Go, go)\nOh, no-no-no\nI can't feel my face\nI need some more energy\nGive me a shot then I’m goin' out in space\n(Go, go)\nDon't need no more, my head’s spinnin'\n(Go, go)\n\n[Chorus]\nI lost my friends, where are we? (Where are they?)\nI lost my phone, what happened? (What's goin' on?)\nI'm drunk, I need assistance (No-no-no)\nDon't touch me, I'm good (Get off me, I'm good)\nI lost my car, what happened?\nThese drunk tunes got me trippin’\nTake me home, damn, I’m buggin'\nThese drunk tunes got me so high\n\n[Pre-Verse: N.O.R.E.]\nHey, yo, I’m drunk walkin' outta the club\nStopped to show love\nThe people want to flick it for Instagram pictures\nI'm drunk so my eyes all red in the pictures\nI'm outta place, bozo face in the pictures\n\n[Verse 1: N.O.R.E.]\nSpread love, crew love, shit, it’s all the same to me\nI show love, I get love, yup, and that remains to be\nI'm walkin' to the whip and I'm stumblin'\nI'm Marshawn Lynch with my limp, I ain't fumblin'\nI smoked a Marlboro Red, see, I was outta line\nAnd late to see my lady, I was outta time\nI had to be meet her at the Fifi's fish spot\nA Rafael gave me L and got my wrist hot\nI used to drink Smirnoff with dope fiends\nI would babysit my cup, coasting\nNew wave, Soundcloud, always around loud\nSplit a 'rillo, armadillo\nShot up the armored hero\n\n[Chorus]\nI lost my friends, where are we? (Where are they?)\nI lost my phone, what happened? (What's goin' on?)\nI'm drunk, I need assistance (No-no-no)\nDon't touch me, I'm good (Get off me, I'm good)\nI lost my car, what happened?\nThese drunk tunes got me trippin'\nTake me home, damn, I'm buggin'\nThese drunk tunes got me so high\n\n[Pre-Verse: Method Man]\nHey, yo, I'm drunk, throwin' up in the club\nIn addition, I ain't know what they was slippin' in them drinks I was sippin'\nI didn't think, prob'ly somethin' pink, I was slippin'\nLast time I woke up in the clink, I was trippin'\n\n[Verse 2: Method Man]\nOne drink, two drink, three, it ain't a thing to me\nI shows up then leave tore up, ain't nothin' changery\nOne too many Kamikazes, I'm a zombie\nStumblin' out the party, I was duckin' paparazzi\nI shoulda skipped last call and hit the herb spot\nOr hit the studio, maybe, because this verse hot\nMy first shot, my bird hot, by the third shot\nCurved the THOT, the thirst real but her purse not\nMy attitude is out the world, I'm a star\nPlus a rhymin' alcoholic, ask the girl behind the bar\nThe opps can't call it, they ain't havin' a prob'\nHoney workin' on the tan, they nabbin' the jar\n\n[Chorus]\nI lost my friends, where are we? (Where are they?)\nI lost my phone, what happened? (What's goin' on?)\nI'm drunk, I need assistance (No-no-no)\nDon't touch me, I'm good (Get off me, I'm good)\nI lost my car, what happened?\nThese drunk tunes got me trippin'\nTake me home, damn, I'm buggin'\nThese drunk tunes got me so high\n\n[Verse 3: Joe Young]\nYo, don't talk to me when I'm drunk is what I'm sayin'\nYou okayin'?\nMad disrespectful, is we fuckin' or you stayin'?\nNights like this, I never know what I might pull\nThe bud got me high, I'ma Vodka and Red Bull\nI'm on a level that could be dangerous to most\nChampagne to the face, need no glass, fuck a toast\nKeep them shots comin', keep the liquor runnin'\nAfter hours spot jumpin', we might be into somethin'\nWe havin' a good time, I ain't worried 'bout nothin'\nThe Lab in this bitch, eight guns, we ain't bluffin'\nDon't be mad, she belong to the world stock, cuffin'\nShe in the middle of the dance floor like her muffin needs stuffin'\nI got the oven, I'ma serve the plate\nTried the number with no debate\nPoppin' mad bands for a nigga, shake that cake\nMake that shit quake and watch it drop for a mother fucker\nShe ride the wave like it's some props in this mother fucker\n\n[Chorus]\nI lost my friends, where are we? (Where are they?)\nI lost my phone, what happened? (What's goin' on?)\nI'm drunk, I need assistance (No-no-no)\nDon't touch me, I'm good (Get off me, I'm good)\nI lost my car, what happened?\nThese drunk tunes got me trippin'\nTake me home, damn, I'm buggin'\nThese drunk tunes got me so high\n\n[Outro: N.O.R.E.]\nGo (Go, go)\nGo (Go, go)\nPut 'em up, put 'em up, put 'em up\nGo (Go, go)\nGo (Go, go)\nGo (Go, go)\nPut your hands up\nGo (Go, go)\nGo (Go, go)\nPut 'em up, put 'em up, put 'em up\nGo (Go, go)\nGo (Go, go)\nPut your hands up\nGo (Go, go)\nGo (Go, go)", "image": "https://images.genius.com/ed8b9d6333cc29967da88416db3514c8.1000x1000x1.jpg"}], "artist": "Method Man"}