{"songs": [{"title": "As I Am", "album": "Young Sinatra", "year": "2011-09-19", "lyrics": "[Intro]\nAlright, run it\nI know what it's like\nTo be all, all depressed\nAnd not wanna go out and\nAnd live life man\nThat's not healthy man\nYou can't be living like that, what's wrong with you?\nHi\nYeah, hey you, yeah you\nYeah, yeah, uh-huh\nI know you been feeling down\nThere's— something's pissing you off\nAnd something's wrong— you know what\nWe're gonna— I'm gonna cheer you up\nI'm gonna help you out\nJust go ahead and just\nAnd just listen alright?\nHere we go\n\n[Verse 1]\nHi there, hey friend, how are you\nCheer on up, you superstar, you\nDon't let them try you\nFuck that shit, don't let them deny you\n'Cause you're gonna make it some day\nAnd you're gonna make it some way\nNo more waitin’ for the bus\nAnd no more riding on the subway\nLive life how you want to\nSo get on up, now, go get out there\nFace your fears, no need to be scared\nYou better rebel\nAnd if they hate you, give 'em hell\nNo more hiding in your shell\n'Cause we are not defined\nBy how hard we fall\nSo, dust yourself off and stand tall\n‘Cause you can make it\nOf this, I’m sure\nJust spread your wings and you will soar\n\n[Hook]\nI know\nI know, know that I'm gonna blow\nYou away\nAnd when I wake up\nI'm gonna shake up the fuckin' world\nAnd you're gonna love me\nYou're gonna take me as I am (as I am)\nAnd not a single one of you can tell me no\nOhh, yeah\n\n[Verse 2]\nI'ma go where nobody before me has gone\nAnd I know that the journey is gonna be long\nLivin' life like a mademan like a don\nI was in the dark but now all the lights on\nIt's real hard on the rise to fame\nCause everybody's mad and you're the one to blame\nAnd just last year you didn't know my name - Logic\nNow they all demand it\nUsed to hate me and I can't stand it\n'Cause now you love me you so damn manic\nSaid I'll never make it said I'll fail\nMy ship would sink\nBut motherfucker I sailed\nI know I'm gonna prevail\nEyes on the prize right on my trail\nMiddle finger to the haters that are on my tail\n'Cause I got heart boy I got spunk\nFeelin' just like Jordan before the dunk\nAnd if you fuck around I'ma put you in the trunk\nHa, I'm just playin around\nWait for the sound (wait for the sound)\nWait for the sound (wait for the sound)\nOow\n\n[Hook]\nI know\nI know, know that I'm gonna blow\nYou away\nAnd when I wake up\nI'm gonna shake up the fuckin' world\nAnd you're gonna love me\nYou're gonna take me as I am (as I am)\nAnd not a single one of you can tell me no\nOhh, yeah\n\n[Verse 3]\nI swear to God that I love the life I live\nAnd I'm grateful for every breath it gives\nI remember thinkin' something's gotta give\nNew day but it all just feels the same\nNo clouds but I can feel the rain\nPointin' fingers lookin' for someone to blame (lookin' for someone to blame)\n'Til I came across my own name\nI wasn't in control of my destiny\nFeelin' empty thinkin \"Where's the rest of me?\"\nI gotta make it but I need the recipe\nOnly then will I find the best of me\nI didn't wanna listen, didn't give a fuck\nI was so selfish, I was so stuck\nCleanin' up food, for a little buck\nThen I quit that, livin' on luck\nI was so lost, at what cost?\nWhy be the worker when you could be the boss?\nStill doin' wrong, tryna live right\nGet my mind righteous, man, what a fight\nShit gettin' tight, man that ain't right\nAnd my girl left, so I just might\nSo I just might\nGo home to where the, wild things roam, and the\nHappiness last, and the\nHaters kiss my ass\nGo home to where the, wild things roam, and the\nHappiness last, and the\nHaters kiss my ass", "image": "https://images.genius.com/6118bfdbbde22320e3c6bc130e1772d3.1000x1000x1.jpg"}], "artist": "Logic"}