{"songs": [{"title": "Fake ID", "album": "The Language of My World", "year": "2005-10-10", "lyrics": "[Intro]\nLadies and gentleman, my name is Macklemore. This is my music, and it feels so damn good right about now. Check it, I got a story, yo, it goes a little something like\n\n[Verse 1]\nWhen I was seventeen I was staying in NYC\nAnd my homie told me where I could get a fake ID\n\"Ayo, son, you better get that shit when you in NY\" (okay)\nSo I hopped on the subway and I gave it a try\nTo my pleasant surprise the ID looked fine\n5'9\", blues eyes, born in nineteen-seventy-nine (just right)\nNervous as hell, I went to the store with my homie\nCame out and yelled \"Dawg, they sold me a 40\"\nYeah, you know that I was the man\nBuying liquid contraband with a fake ass hologram\nNo more looking for bums, standing in the rain\nStranded on Broadway and giving 'em all my change\nFor the rest of the summer man I was on fades\nSeventeen, had it made, getting drunk everyday\nAyy, I got treated a whole new way\nBecause of a piece of plastic that proved I was of age\n\n[Interlude]\nYou know what I'm saying, all of a sudden you get this little piece of plastic and you're in the club. Seventeen like bah! Check it out, it's like this, yo\n\n[Verse 2]\nNow for the next three years I had so much fun\nGetting drunk in hip-hop clubs where you had to be twenty-one\nThen one day I was walking and I saw a sign\nThat said KRS-One twenty-one up and live\nThat's hella tight\nAyo I heard he always ripped it\nSo I hopped up in my Civic and went out to buy a ticket\nWhen I got up the the door the bouncer checking ID's\nLooks at mine and he's like \"Nah, we don't take these\"\nI tried to reach and grab my shit back\nBut the mother fucker was tougher than Shaq, on crack\nI should've punched him, but I would have reached his knee cap\nAnd that probably wouldn't have hurt him very much\nHe kept laughing and smilin', he called me a dumb shit\nAnd if I would've let myself I would have cried in public\nOh no, I'm like \"Give it back, bro!\"\nBut no, my ID was jacked by the Caucasian Deebo\n\n[Bridge]\nHa I'm laughing right now but at the time it really was not funny and it's still not very funny. Fucker\n\n[Verse 3]\nBitch why you got to take my ID?\nWhy do I have to be 21 to drink a Long Island Iced Tea?\nI hate bouncers with their bald heads and ten foot tall legs\nAnd shirts that they outgrew when they were like ten\n*Get 'em*\nYour mother is dumb for having you\nYou're a bouncer because you have a small dick and as a kid everyone laughed at you\n*Get 'em*\nYou're too big and you never seemed to listen\nYou look injected with the shit they give to KFC chickens\n*Get 'em*\nI don't like ya, at all I despise you\nIf I was tall I would fight you\nIf I was a dog I would bite you\nEvery single day you make people cry\nAnd your job is to go and ruin teenager's lives\nOk I'm going too far bouncers aren't all bad\nI'm sure they make great husbands and really strong dads\nBut hopefully you learned a lesson from me\nNever take an MC's fake ID\nYup, I said never take an MC's fake ID\nYou could be buff and tough, it don't matter to me\nCause you're going to get burned if you step to MCs", "image": "https://images.genius.com/a341d7269423ec87ff688b91d8b38e47.800x800x1.jpg"}], "artist": "Macklemore"}