{"songs": [{"title": "Fucked Up Day", "album": "The Worst", "year": "2000-09-12", "lyrics": "[Intro: Tech N9ne]\nYa\nWe at the end of this shit\nFinally at the end of this shit\nMy nigga Paul Law on vocals\nMidwest side\n'Bout to drop a couple light weight verses\nCheck it out\n\n[Verse 1: Tech N9ne]\nBe warned\nSo many motherfuckers in the inner city got me torn\nMany niggas have sworn\nBut don't even understand the storm\nSo I better move the, hold the press\nNever can slow the best\nBut I'm having a fucked up day so I just progress\nWhen smoking on them green clovers, cess\nThinkin' about killin' a bitch if a bitch insist\nOn usin' the bottleneck sources\nI give her what I mean by death from anghellic forces\nOf course it's the fist of fury\nMr. T.I.B.D. and several twister\nUplift a high plains drifter and differ\nMitch bade nigga, display bigger\nNext he'll find himself in the middle of a ditch lay with her\nBig parade of them slithery things I mean stuffed in grey litter\nDon't know how much longer I'll be on this [?]\nSo we scorn to [?] best be warned, be warned\n\n[Hook: Paul Law]\nLet me warn you\nI'm having a fucked up day today\nAnd I just ain't got no time to play\nLet me warn you\nThis shit's getting worse for me today, today, today\n\n[Verse 2: Tech N9ne]\nI drench to get drunk, I thinks to get funk\nMy inks a bit bunk, so I switch my pen and then begin my friend\nI blinks 'cause it bumps\nRD's give a nigga [?] without a flaw\nWe say walla milli dollar, then break a lot a jaw\nAlright, where the booze at? Never did think I'd use that\nWho's that nigga who don't know then confuse that\nI do-es that, really wanna take out this demon\nWaiting for God to give me the OK\nWhat niggas really want is a black Keyser Söze, ugh\nCaught up in rap I'll never again get caught up with a bitch\nStuck in the intersection [?]\nDon't know how much longer I'll be on this [?]\nSo we scorn to [?] best be warned, be warned\n\n[Hook: Paul Law]\nLet me warn you\nI'm having a fucked up day today\nAnd I just ain't got no time to play\nLet me warn you\nThis shit's getting worse for me today, today, today\n\n[Verse 3: Tech N9ne]\nThe end of my LP, also end of existence\nNovus ordo seclorum, time to get artillery equipment\nRiddle me this, riddle me that\nWho's the nigga that got that contract\nHave been dead like about four years and nueve says\nWho's gonna come back?\nWho's that one them call the K-I-double L-A clown around these parts of Mizzou who is the nigga that's gonna make many G's\nWho sees demons after dark\nAnd skinheads killin' my P-E-O-P-L-E's\nWho's said yell Seig Heil but don't fuck double N-U-double T's\nGod's infinite family trees\nAbout to seize these [?]\nRacist punk gonna make you fall down to your knees\nWhy am I that type to be cool before I swarm?\nBecause I like these calmer moments before the storm, be warned\nEverybody want to go heaven but nobody want dead\nRude awakening boy, the future tells about too many bloodshed\nI said, Satana we shall dismember in the last days\nStart this race in '71 November, remember\nI can look into your eye, smile and then to your surprise\nI'll be yellin' \"Die, nigga, die!\" when all the bullets fly\nDon't know how much longer I'll be on this [?]\nSo we scorn to [?] best be warned\nThe worst type of nigga is gone\n\n[Outro]", "image": "https://images.genius.com/87934aebc9ee54de45c58f2e2bede516.369x369x1.jpg"}], "artist": "Tech N9ne"}