{"songs": [{"title": "Ride Or Die", "album": "Live From Compton", "year": null, "lyrics": "Damn\n\nYou gone ride or die?\n\nWoo\nWoo\n\nAll my niggas gone bust they guns\nReal mother fuckers never trust niggas, but we trust our guns\nGet money is the code of the streets\nLive by it, and they say the hotter the bullets, the colder the streets\nLike the older the hammer, the older the beef\nYou holding the can and you busting or you die with your heat\nMe and my niggas gone survive in the street\nFor one reason, we ain't living to kill niggas, just dieing to sleep\nI'm in the hood and I ain't wear a vest\nPush a stock GTO, with a pump in the seat and a desert eagle in the head rest\nLive and I took 5, get respect cause I won't die\nSo its a bet that I'm gone ride\n\n[Chorus: x2]\nI'm riding dog, you riding with me? (ride with me)\nIf I'm frying dog, you frying with me? (fry with me)\nIf I'm dieing dog, you dieing with me? (die with me)\nJust know when the beef come, we all busting our guns (what?)\n\nWe can beef, I don't give a fuck, any street, stoop or block\nCompton, New York City of Rocks\nYou ain't never been out the hood? don't go to far\n12 gauge shotty, with a pump like Joe Dumar's\nShells the size of Sprewell lugs, go through cars\nRip apart your new Bentley nigga, like Dre sent me\nThe haze in me make me wanna kick back\nYour man work out at bally's, put the 38 to a 6 pack\nAnd beef keep the E.R full til the shit packed\nNo more rooms? let em die in the streets\nIm from the CPT, where niggas dieing to eat\nThem niggas with scars under they left eye and they cheek\nPark a 745 on your street\nLike mother fucker if you don't ride with me, you can die with the enemy\nOr die like the Kennedy's nigga\nI empty desert clips out like a bottle of Hennessy nigga\n\n[Chorus: x2]\nI got niggas that'll beef for the game\nRun up on your man, splat his brain then bring you his chain\nSo if you owe my hood, you better pay up\nI roll with killas, that'll put you in a hole like a lay up\nAin't no sleep on the block, my niggas stay up\nCause they ain't trying to miss sales\nThey trying to tip over fish scales\nBe in the XXL, and its only 6 street rappers if you wanna be real\nThat go for the whole industry you bitch ass niggas\nSay my name in a verse if you ready to die\nI call up my Harlem niggas on the i95\n10 minutes later you dead on the I95\nAftermath mother fucker, we ain't playing this shit\n50, work ride, Joe, Cube, the Game and Em\nIts our house and we in the front yard\nSo fuck with the Dr. and get picked apart like junk yards\n\n[Chorus: x2]", "image": "https://images.genius.com/4aa4c5e841b178f0af09f3f0d0694eeb.500x500x1.jpg"}], "artist": "The Game"}