{"songs": [{"title": "Goosebumpz", "album": "Watching Movies With the Sound Off", "year": "2013-06-18", "lyrics": "[Verse 1]\nBetter act right, 'cause I smack dykes\nGive 'em blow and a bit of that bagpipe\nBitch wanna live that rap life, but I already hit that last night\nThink you're fuckin' with me, huh? Must be hittin' that crack-pipe\nI be makin' my money, thank God I learned how to add right\nMy cash like that cocaine, give me more, say, give me more\nDon't worry 'bout it, ain't no thing, big titty hoes in my videos\nClassy bitch, don't kiss and tell\nSmack her ass and then wish her well\nLife sucks, better give 'em hell\nGet money, fuck girls, free Biggavel\nA million in my briefcase, 'bout to shop for some real estate\n'Bout to party with drugs though, turn it up, bitch, feel the bass\nThrowin' money in your face, feelin' good, livin' great\nBad bitches in different states, it's like I think I'm Vincent Chase\nWith porn stars, sports cars, and my crib got a courtyard\nHow we get all this money though?\nYou know how big his tours are?\nGreedy bitch, you a needy bitch\nWant some money, but need some dick\n\n[Pre-Chorus]\nAnd my belt monogram\nWhen I die, bet she fuck my hologram, though\nWhen I die, bet she fuck my hologram, though\nWhen I die, bet she fuck my hologram\nWhen I die, bet she fuck my hologram\nMy hologram\n\n[Chorus]\nWe in my black Benz, windows up\nGettin' head, smokin' blunts\nEverybody know what's up, and I turn them girls to sluts\nCrib's like a mob boss, my bitch get my car washed\nWe non-stop, my dick out, her jaw drop\n'Cause all we do is fuck, fuck-fuck, fuck-fuck\nAll she wanna do is fuck, fuck-fuck, fuck-fuck\nAll she, all she wanna do is fuck, fuck-fuck, fuck-fuck\nAll she wanna do is fuck, fuck-fuck, fuck-fuck, fuck\n\n[Verse 2]\nDon't I look like a drug dealer? Don't I look like I'm somebody?\nKillin' beats with that Murder Inc, don't I look like I'm Irv Gotti?\nRidin' through in my hippy van\nYou broke bitches don't give a damn\nYou softer than the Michelin man\nYour bitch put her pussy on Instagram\nBetter go hard when my flow starts\nThey brand new with they old cars\nYour pockets is on low carbs, she do a show, she a pollstar\nIn the penthouse, with the pants down\nWith the camera out, no hands now\nThem hard drugs, we don't ran out\nCan't believe that's somebody grandchild\nShe's so bad but I like it, wanna hear your pussy, I'll mic it\nMy credit card bill is righteous but, girl, that ass is so priceless\nSpend the night with the right bitch, my dick ill, my pipe sick\nSmall pussy, tight fit, she loves to sniff that white shit\nFuck free, no charge, I play the pussy like Mozart\nEat that pussy, I won't starve\nLove the pussy with my whole heart\nBitch named Layla my Clapton ho\nGive me head, put the Benz in captain mode\n\n[Pre-Chorus]\nAnd my belt monogram\nWhen I die, bet she fuck my hologram though\nWhen I die, bet she fuck my hologram though\nWhen I die, bet she fuck my hologram\n\n[Chorus]\nWe in my black Benz, windows up\nGettin' head, smokin' blunts\nEverybody know what's up, and I turn them girls to sluts\nCrib's like a mob boss, my bitch get my car washed\nWe non-stop, my dick out, her jaw drop\n'Cause all we do is fuck, fuck-fuck, fuck-fuck\nAll she wanna do is fuck, fuck-fuck, fuck-fuck\nAll she, all she wanna do is fuck, fuck-fuck, fuck-fuck\nAll she wanna do is fuck, fuck-fuck, fuck-fuck, fuck", "image": "https://images.genius.com/c97dc009b7b1ff0982e14799c3dd3042.375x375x1.jpg"}], "artist": "Mac Miller"}