{"songs": [{"title": "Georgia", "album": "Disturbing tha Peace", "year": "2005-10-09", "lyrics": "\"Georgia\" \"Georgia!\"\n\"Georgia\" \"Georgia!\"\n\n[Hook 2X: Ludacris]\nWe on the grind in (\"Georgia!\")\nAll the time....\nIt ain't nothin' on my mind but (\"Georgia\")\nWe ain't playin' witcha\n\n[Ludacris]\nCountry names, country slang, fiends at the liquor sto'\nBlack cruisin', craps shootin', 50 on the 10 to 4\nOvercast, the forecast, shows clouds from plenty dro\nAnd we read for war in the state of (\"Georgia\")\nYEAH! Dirty words, dirty birds, it's MEAN in the Dirty South\nIf you ever disrespect it, then we'll CLEAN out ya dirty mouth\nBulldogs clockin, these lookout boys is hawkin'\nYou gotta be brave in the state of (\"Georgia\")\nI got five Georgia homes, where I rest my Georgia bones\nCome anywhere on my land, and I'll aim at ya Georgia Dome\nIf you get into an altercation, just hop on ya mobile phone\nAnd tell somebody you need HELP in the middle of (\"Georgia\")\nWe some +ATL Thrashers+, scope ya punk and then smash ya\nWe'll come through ya hood worse than a tsunami disaster\nDon't know who they gonna get, or who them robbers gonna hit\nThat's why I keep my +Georgia Tech+ in the state of (\"Georgia\")\n\n[Hook 2X: Shawn Jay]\nWe on the grind in (\"Georgia!\")\nAll the time....\nIt ain't nothin' on my mind but (\"Georgia\")\nWe ain't playin' witcha\n\n[Smoke]\nI'm from the home of neckbones, black eyed peas, turnip, and collard greens\nWe the children of the corn, dirtier than Bob Marley's PeePee\nGA, the Peach State, where we stay\nMy small city is called Albany (\"Georgia\")\n(Hahaha) Pecan Country, like catfish wit' grits\nCandy yams and chitllins', Grandma's home made baked biscuits\nThe land of classical Caprices and Impalas, and super sports\nIngredients in this peach cobbler called (\"Georgia\")\nI love the women out in LA and the shoppin' stores in NEW YORK!\nThe beaches in M.I.A.; But ain't nothin' like that GA, red clay\nLook on ya map, we right above Florida, Next to 'Bama\nUnder that Carolina to Tennessee, you'll see (\"Georgia\")\nWhere Gladys Knight took the \"Midnight Train\", The birthplace of Martin Luther King\nWhere ass so plump and hips are thick, where 'Llac trucks sittin' on 26s\nKnow where you goin' or you'll get lost, Found in these plumb trees in the south\nChoppers'll tomahawk your top, down here in (\"Georgia\")\n\n[Hook 2X: Smoke]\nWe on the grind in (\"Georgia!\")\nAll the time....\nIt ain't nothin' on my mind but (\"Georgia\")\nWe ain't playin' witcha\n\n[Shawn Jay]\nNow I was born in the 'Bany on the bottom of the map; with a wet paint\nChip chin on Pirellis, And chrome on the chevy's, When I'm choppin' in the trap\nCountry as hell, they some warriors, tote somethin' spray somethin'\nThe same shape as Florida; Lookin' for me boy\nYou'll find me down in Dougherty County in a small city called Albany (\"Georgia\")\nWhere they used to call us some Bamas, and now they\nJockin the grammar; Watch your mouth unless you offer some manner\nBut ya hustlers wasn't on ever corner like the Waffle House in Atlanta\nR.I.P Camoflauge out in Savannah (\"Georgia\")\nNow you might come from vacation, leave on probation, Home of the strip club\nKnown for the thick girls, Where the tricks put tips in the tip cup\nFor the thick chick in the thong wit the big butt, Wanna get love\nWon't be cheap, long money like Peachtree\nMan she take it off like Freaknik down here in (\"Georgia\")\nWhen you see them confederate flags, you know what is\nYo folks picked cotton here, that's why we call it the field\nI got a Chevrolet on twenty - sixes; I'm from GA, GA (\"Georgia\")\n\n[Hook 2X: Field Mob & Ludacris]\nWe on the grind in (\"Georgia!\")\nAll the time....\nIt ain't nothin' on my mind but (\"Georgia\")\nWe ain't playin' witcha\n\n\"Georgia\" \"Georgia!\"\n\"Georgia\" \"Georgia!\"\n\"Georgia!!!\"", "image": "https://images.genius.com/ca7a724b4b53a52595efa79bde19ff2e.1000x1000x1.jpg"}], "artist": "Ludacris"}