{"songs": [{"title": "True School", "album": null, "year": null, "lyrics": "[Produced by DJ Jean Maron]\n\n[Intro]\nStrictly hip hop - that's what we're dealing with here today\nFeel this one more time, let's go back around\nFeel this, bump this in your ride\nLet the stress off you, yeah\nBump this, leave the job in the back\nLeave the school in the back\nKRS One\n\n[Verse 1]\nListen to the stile awhile the KRS is giving you\nI'm still repping, that's a miracle\nMe, I went from criminal all the way to spiritual\nNow the people say ''yo, KRS, there's no comparing you''\nOriginal, down to my DNA, I'm lyrical\nFrom the golden age hip hop is what I spit at you\nI am the pinnacle, my level is so critical\nWay before the metrics KRS was metaphysical\nYou gotta look at the fact that I still rap\nHip hop culture, I live that cause I built that\nOthers are still trapped, they're looking like field rats\nUsing real raps to see where their next meals at\nIf they would only feel rap and not deal rap\nTheir whole style, man, they wouldn't have to steal that\nI stay fresh cause I'm hip hop, blessed cause I'm hip hop\nCops wanna stress cause I'm hip hop\nFuck a desk and a lunch break, cutting through that red tape\nTemple of hip hop, that's the escape\nNo cure for the headaches and the failures\nI'm on that rastaman vibrations like Bob and the wailers\nI teach my kids to be sailors\nCause the sea levels rising, you gonna see technical failures\nHow many times I gotta say it?\nThe dream of Dr. King, uh uh, nope, I won't betray it\nI'd rather make one righteous dollar on my level\nThan make a million dollars spitting rhymes for the devil\nWe're not coming here to dance, me come to MC\nMany say I'm the greatest like Muhammad Ali\nSome say I'm arrogant and egotistical and cocky\nCause when I flow they know they can't stop me\nSo here's another classic, blast it like a shotty\nMy recoil kick so hard it bumps your body\nMe I'm the last of the dreaddy, the knotty\nKRS One, I liven up any party\nMe getting booed? Chewed? Screwed? Hardly\nI'm spiritual minded, brother, I move godly\nI got manners, when I sneeze I say pardon me\nTwenty years rocking, I'm blessed, I got to be", "image": "https://images.genius.com/e9fa55af2e8bfddf3b40ea0e0347874f.556x556x1.jpg"}], "artist": "KRS-One"}