{"songs": [{"title": "Let’s Get Blown", "album": "R&G (Rhythm & Gangsta): The Masterpiece", "year": "2004-11-16", "lyrics": "[Intro: Pharrell]\nYessir!\n\n[Chorus: Vanessa Marquez & Pharrell]\nCan I get more thrills?\nYou know you want some more girl, so come on, yeah\nCan I get more thrills?\nYou know you want some more girl, so come on\nLet's get blooooooown!\nLet's get blooooooown!\n\n[Bridge: Snoop Dogg]\nI'm just looking, mm-mm-mm\nLooking at the ladies\nAll of them fly\nI don't know which one I want, dawg\nI can't make up my mind, girl\n\n[Verse 1: Snoop Dogg]\nSo won't you make it easy on me?\nAnd take this drink, then hit this weed\nTwo step wit me, let's slip to the dance floor\nOn and on and on and on we go\nI'll dip you if you want me to\nYou see I really wanna get a little front with you\nBiggidy bump with you\nA nigga wanna hump you, and then just comfort you\nAnd then I'll pop the top\nAnd lay you on the cot, and get you nice and hot\nYeah yeah, it's all to the real\nWe could do it like Guy, come on girl, let's chill\n\n[Chorus: Vanessa Marquez & Pharrell]\nCan I get more thrills?\nYou know you want some more girl, so come on, yeah\nCan I get more thrills?\nYou know you want some more girl, so come on\nLet's get blooooooown!\nLet's get blooooooown!\n\n[Verse 2: Snoop Dogg]\nCome on baby, let's get blown, mm\nNow you can fly the friendly skies\nWith the S-N double O-P, D-O double G-Y\nNow don't ask why\nJust keep looking good in the hood, damn girl, you so fly\nWe could do what you want to\nYou say you drink Alize, or was is Malibu?\nIt don't really matter though\nYou remind me of the time when I had a ho\nShe kept telling me, \"Doggy Dogg, I gotta go\"\nSo I let her get in the wind and co-macked her friend\nTwo plus two, it equals four\nThis is some shit that could last forever more\nI'm tryna put my bid in\nNaw I'm just kidding, come on ma, get in\nAnd don't ask where we going, pimping and hoeing\nDrink pouring and weed blowing, you know it, come on!\n\n[Chorus: Vanessa Marquez & Pharrell]\nCan I get more thrills?\nYou know you want some more girl, so come on, yeah\nCan I get more thrills?\nYou know you want some more girl, so come on\nLet's get blooooooown!\nLet's get blooooooown!\n\n[Bridge: Snoop Dogg]\nCome here baby, lemme holla at you real quick\nI've been looking at you, from the corner of my eyes\nChecking out your hips, lips, tips and your thighs\nI've been wanting to do you, for a mighty long time\nYou make a pimp wanna sing \"I-I-I\"\n\n[Verse 3: Snoop Dogg]\nWe'll head to the hills, your dreams I'll fulfill\nWe could do it how you want cause I'm oh so real\nTell me you, naw I won't squeal\nYou wit Da Big Boss Dogg so seal the deal\nPharrell got the Babyface\nAnd Dogg got the Whip Appeal, so name the place\nThis love I bring to you, on the real baby girl\nWon't you do me a favor and sing for Snoop?\n\n[Chorus: Vanessa Marquez & Pharrell]\nCan I get more thrills?\nYou know you want some more girl, so come on, yeah\nCan I get more thrills?\nYou know you want some more girl, so come on\nLet's get blooooooown!\nLet's get blooooooown!\n\n[Outro: Pharrell & Vanessa Marquez]\nDamn, you know you want it (if I got it, I'ma give it to you)\nSo come and get it (if I got it, I'ma give it to you)\nIf I got it (If I got it, I'ma give it to you)\nThen you can get it (ya know)\nHey! Ohh\nCan I get more thrills? Can I get more thrills", "image": "https://images.genius.com/1bf36374def4183f2c0ea778b395bf0b.220x223x1.jpg"}], "artist": "Snoop Dogg"}