{"songs": [{"title": "My nigga", "album": null, "year": "2013-12-26", "lyrics": "Black bottle boys, Ciroc lifestyle, Mastermind\nUntouchable Empire ya heard me\n\n[Verse 1: Rick Ross]\nFour stacks on the balmain jean jacket\nI'm addicted to things i got a mean habit\nNigga look at my rings i've got team tatted\nMe stacking my cream the only thing matter\nMe whippin that 'cain you know it's G status\nQuarter Key in back just like a beef potted\nWhen am in the spot know it's straight crackin'\nGot your chain snached actin' like it ain't happen\nJigga am with won at least eight pageants\nCartier cost ya boy 80 carats\nBlack bottle boy we can go to war\nStarted 40 bottles, we can order more\nOutgrewed save; Money waterwall\nMy Audemars for ballers, nigga none of y'all\nShit got real back in '98\nLook around lil niggas buying weight\nPark the money caller when it's seven ???\nAll white phantom now we heavy weight\nTalkin money team, money nigga everyway\nMoney team, money nigga everyway\nShe never fucked a nigga with straight commas\nThey come right back like I'm A. Broner\nCome right back like I'm A. Broner\nCome right back like I'm A. Broner\n\n[Hook: Rich Homie Quan]\nFrom original version by YG\n\n[Verse 2: Young Breed]\nGot some niggas who will slide like them killers in the eighties\nAll i got to do is say it ain't no finna maybe\nI bust a nigga head it just how my momma raised me\nNever really knew my daddy so my brother had to get me\nUptown native, all black mercedes\nAnd my motherfuckin' wrist worth four and a baby\nUsed to break them down daily, like fuck you; pay me\nNow you lookin' at the plug it's self made paper\nPussy on demand like I'm paying for a cable\nTold that bitch this a mob ain't no motherfuckin' label\nTryin' put a hundred grand in the middle of my palm\nI do it for my niggas who can't even get a pawn\nBig dope dealer with a death sentence\nAin't snitch, kept it real that's real nigga\nSide bitches still trippin' tryin' kill you winner\nGot 99 problems, pussy ain't issue\nAnd I'm strapped; what's a pussy nigga would tryin' play\nI'm from the jungle nothin but killers and wolves where I stay\nStill a type that tell that i'm cool with a 'cain\nBitch I'm good in the hood and I'm good at the bank\n\n[Hook: Rich Homie Quan]\nFrom original version by YG", "image": "https://images.genius.com/3dce21029cdd8aab73eb473e015807d5.1000x1000x1.jpg"}], "artist": "Rick Ross"}