{"songs": [{"title": "Let Me In", "album": "Sickology 101", "year": "2009-04-28", "lyrics": "[Intro: Krizz Kaliko & Tech N9ne]\n[K] Alright, party night tonight, alright you, come on in\nYou're good, skinny jeans, come on in, tight shirt, come on in\nAh, that new rock 'n roll gay look, yeah, you're cool, come on in\n[T] What's up, man?\n[K] Hey, man, you can't get in here, boy\n[T] What's wrong with me, man?\n[K] Well, can't you read the sign, boy?\n[T] No French braids, no dread locks, no gold teeth, gold teeth-\nAw, you don't want no black folks in here, huh?\n[K] Can't you read the sign? It says Power and White, I-I mean Power and Light District\n[T] Look here, man\nHow much it gonna take to turn this all white club, into a nigga club?\n[K] What!?\n\n[Hook: Krizz Kaliko]\nLet me in the door\nIf you say you hear me knockin' what you standin' there for?\nWho I gotta kill or sleep with? Cause I'm the world's best kept secret\nLet me in the door\nIf you say you hear me knockin' what you standin' there for?\nCause I'm the one that do that music, you feel but you still refuse this\nLet me in the door\n\n[Verse 1: Ca$h Image]\nRight now 'fore my goons have to tear it down\nWe don't wait in line and we don't stand around\nWe in clubs and we draggin', actin' brand new\nActin like he never seen my face and I ain't got loot\nThey know I'm Ca$h Image and I'm with Tech N9ne\nAnd 'fore the club close the owner gon' respect mine\nWe spend a lot of money and that's the bottom line\nTen cars on chrome plus the neck shine\nBaggy jeans on and J's worth a lot of bucks\nAnd you ain't gotta know me, you can tell my dollars up\nPoppin' collars in the club, turn the bottles up\nAnd all the models in the club wanna follow us\nIt's Mr. Chevy man, you hear my song playin'\nAnd every time we in the club we be spending grands\nFirst deny Tech (What!?), then deny me (What!?)\nAnd I was number 1 on 103 for 40 weeks\n\n[Hook]\n\n[Verse 2: D-Locc Da Chop]\nYou say you hear me knockin', so why you don't wanna let me in?\nBut I ain't buggin' so tell the cops to come and get me then\nComplain about my shoes ain't really talking bout shit\nDude, I spent like 350 on this outfit\nNV ain't gon' let me in seein' as he actin' funny with me\nWhat it gonna cost me, homie? I brought a little money with me\nI don't wear tight shirts, my pants kinda baggy\nKC hat tilted so now they wanna red flag me\nI buy the bar every time, point blank period\nThe doorman hatin', takin' his job too serious\nMe, Ca$h Image, Tech and Kaliko\nAbout big business so what I'm talking to a bouncer for?\nThe women see me scream my name like the announcer spoke\nThey actin' brand new this week so I'm about to go\nTo the block and bubble and get plenty cake\nI just wanted women and I don't like this club anyway\nSo fuck y'all!\n\n[Hook]\n\n[Verse 3: Tech N9ne]\nI get money from music and I like to spend-spend\nWhen I hit the town I know they're gonna let me ins in\nBut these other clubs be trippin' like I begin sin\nYou hear me knockin'? (Aw yeah!) Well, let me in then!\nCause NV ain't so friendly, they got a gay assembly\nOf femmes who think the blacks be packin' semis\n(That's why they don't sell no Henny)\nStink butts who think bucks\nBut they don't know my bank account is like a Brink's truck!\nCould buy it any day, 2.1 on a new building and lease\nSome at The N9ne has plenty say\nThe rhymin' get me paid so I resign cause NVA\nAnd plus NV stands for no vaginas anyway\nThey place me and Lil' Weezy, we give no love\nThat's why when I brought Chingy in there and he peed in your club\nNot in the toilet either (No!), you don't enjoy the beaver (No!)\nYou'd rather plot on how to give a lil' your boy the peter\nAmerica's clubbin' phase two, I erase you\nMy pants are too baggy even though I'm clean and I'm paid too\nOrlando south races they treated me cold\nAnd Lucky Strike in Power and Light won't let the Nina in to bowl\nWhoa, guess my Dickies the wrong clothes\nPlay my music but won't let me and my homies through the doors\nOver one million records sold, lots of money to fold\nThey should let me in any club in (KC, MO!)\nAnd I'm the biggest tipper, bartenders know me well\nAnd waitresses love me so club owners: (Go to hell!)\nYou got that blow to sell, but you want this bro to fail\nWhen it really ain't me cause it is your destiny to go to jail\nAnd when you be serving you might see work\nOn Club Nina when you walk up you might be hurt\nYou might skee skirt, cause you ain't getting in if you ain't got a\n(KC hat and a white t-shirt, ey!)\n\n[Hook]\n\n[Outro: Tech N9ne]\nOnly reason I even go to the club is so I can listen to some loud music and drink, holler at a bianc\nMy neighbors be mad at me cause I be shakin' the whole block with my system\nSo that's why I go to the club\nI gotta work at the club, take pictures and sign autographs, yadada mean?\nI don't need to be in your club for real\nAnd club dollars say that I owe them 70 dollars\nI paid 125 dollars to get in\nWhy you trippin I just wanted to drink\nSo if 70 dollars is owed that means some cats were there after I left\nYa know what I mean ha ha put it on my tab\nI don't owe nobody shit", "image": "https://images.genius.com/081166dc5d132ad1d3549578cac249e0.1000x1000x1.jpg"}], "artist": "Tech N9ne"}