{"songs": [{"title": "The Omen", "album": "Flesh of My Flesh, Blood of My Blood", "year": "1998-12-22", "lyrics": "[Intro: Female Voice & Devil]\n*Woman sobbing*\nOh, God…please don’t take my child\nHe’s not ready to die\nOh, God…he’s going to take him from us!\nI hear him comin'! I hear him coming!\nNoooo, coming!\nMmmmmm. Him. Him. Him. Him\nOh, God…please don’t take my child\nWhat’s this?\nHe’s not ready to die\nOh, God…he’s gonna take him from us!\n*Heart monitor flatlines*\n*Woman screaming*\n\n{​​​DMX barking}​​​\n\n[Verse 1: DMX, DMX as Damien]\nYou still right here shorty, told you I got you\nLike the way I scooped you when them faggot niggas shot you\nI'mma hold you down and I mean that for real\nBut every time you beef with a nigga, I end up havin' to kill\nIt ain't like that, and hey, forget about them two kids\n'Bout to get a deal and it's as nice as you is\nOh, you think?\nNah, I'm just playin', wassup?\nGot some new bitches, I know you tryna fuck\nNot really\nWhat, I ain't your man no more?\nJust because a nigga don't need a hand no more?\nYou know how we do, if one goes soft\nWe all take the pussy and go up in her raw\nIt's like now, where you goin', I ain't tryin to take it\nFuckin' with a nigga like you, I won't make it\nIt'll be what it is...\nYo, you in for the night?\nI'm 'bout to take it to the crib\nYou get home, aight?\n\n[Hook: Marilyn Manson]\nThe snake (snake), the rat (rat), the cat and the dog\nHow you gonna live when you're in the fog?\nThe snake (snake), the rat (rat), the cat and the dog\nHow you gonna live when you're in the fog?\n\n[Verse 2: DMX]\nYo, I ain't fuckin' with this nigga no more, word to my mother\nFuck it, so you know I'm for sure, word to my brother\nIt's like he's gotten worse than before, son of \"I wonder\"\nWhat type of dirt this nigga got in store for me to get under?\nThen I get the call: \"Yo?\"\n\"X, Police just killed your cousin, underneath the projectsDon't get vexed, niggas'll pay, 'member I got you\nTold you I got you; Dawg, I got you!\"\nI'm in a catch twenty-two, but them niggas got to pay\nBut I know he gon' be askin' for a favor one day\nBut fuck it, I ain't got no choice in the matter\nThem faggots killed my peoples, and I wanna see em splatter\nThat's what I'm talkin' bout, we ain't on no kid shitAnd I'mma use the same gun that you killed them two kids with\nIs that hard to live with?\nNah\nSee, you still a playa\nBut what you want from me?\nAhh, I'll tell you later\n\n[Hook: Marilyn Manson]\nThe snake (snake), the rat (rat), the cat and the dog\nHow you gonna live when you're in the fog?\nThe snake (snake), the rat (rat), the cat and the dog\nHow you gonna live when you're in the fog?\n\n[Verse 3: DMX]\nShit is all over the news: 'Bomb goes off in Central'\nWhat the fuck have I gotten myself into?\nThe mental, is like, get the fuck outta there\nI'm out\nHey, goin' somewhere?\nNah\nWhat's the bag for?\nFuck it, what you want?\nCan your nigga come inside, for a minute and puff a blunt?\nHere we go again...\nAfter what I just gave you?\nWasn't actin' like that, when you asked for that favor\nYo, I ain't asked you for shit!\nOh, yes you did\nWhen you really needed somethin' then you allowed me to give\nYou sold me your soul when you didn't say no\nJust let a nigga go; now gimme what you owe!\nFuck were you thinkin'? Ain't shit for free!\nAin't a motherfucker you know, can defeat me!\nForgive me Father, for I have sinned\nAnd with your help, I know the Devil won't win\n\n[Bridge: Marilyn Manson]\nKill kill kill, kill kill kill\nTake you all on our way to hell\nKill kill kill, kill kill kill\nWe're gon'.. do do it, do it well\nKill kill kill, kill kill kill\nTake you all on our way to hell\nKill kill kill, kill kill kill\nWe don't want to do it, we do it well\n\n[Outro: Marilyn Manson]\nThis is Marilyn Manson, DMX, Ruff Ryders\nThis is Marilyn Manson, DMX, Ruff Ryders, Swizz Beatz\nDMX, Ruff Ryders, Swizz Beatz, Ruff Ryders, Swizz Beatz", "image": "https://images.genius.com/236ac8cb125196c489579b947c3b2fb8.945x945x1.jpg"}], "artist": "DMX"}