{"songs": [{"title": "New Bitch", "album": "The Sex Tape Playlist", "year": "2018-05-04", "lyrics": "[Intro: Too $hort + Female]\nWake yo’ muthafuckin’ ass up, let’s have a discussion right the fuck now\nWhy you tryna question me, bitch?\nDon’t ask me why I’m questioning you, nigga\nI’m still sleep, shut the fuck up\nNah nah, nigga, I’ve been waiting for 5 hours, 15 minutes, 23 seconds and\n\nCounting\nWhat, bitch?\nGet yo’ ass up\n\n[Verse 1]\nI woke up this morning on some new shit\nI rolled over like, “I need a new bitch”\nI sent a mass text out like “I’m cool”\nI done with you hoes, I swear I’m through\nSo don’t text me, and don’t call me\nDon’t hit me with a pocket dial saying “My fault”\nErase my number, and my e-mail\nAnd that’s all you need to know, no details\nAnd don’t be on Instagram in my DM’s\nTalkin’ ‘bout how you pregnant, you my BM\nI used a Magnum every time, bitch, stop that\nLying like that’ll get you popped at\nAnd when you see me in the club, don’t act like we still fuckin’\nJust hit me with that “What’s up?” or don’t say nothin’\nWhy I’m leaving? You really wanna know what the truth is?\nI’m tired of you, girl, I need a new bitch\n\n[Interlude]\nI need a new bitch\nLose my number\nI need a new bitch\n\n[Verse 2]\nWhy you blowin’ me up like a mad bitch?\nSee my number in her phone under “Daddy Dick”\nDon’t be mad at me ‘cause I had to, bitch\nOG player, I used to drive a Cadillac\nBut I spent $160,000 on this sports car\nGot her in the front seat, she called me Short Dog\nI said, “Call me by my real name, Big Dick Dad”\nNow there’s bitch ass niggas in her phone getting mad\nDon’t ask me, ask her\nCan’t afford therapy, go see your pastor\nDon’t call or text me, now or next week\nShe’s always with me, and it’s always sexy\nThree decades of game, still pimpin’ hoes\nYou need to let that shit go—what you trippin’ fo’?\nAin’t no pearl like new pearl\nI said bring yo’ ass here—what it do, girl?\nShe’s so exotic, and exclusive\nI just might make her my new bitch\n\n[Outro]\nI need a new bitch\nLose my number\nI need a new bitch\nYou better lose my number\nI need a new bitch\nI need a new one, a new bitch—BITCH!", "image": "https://images.genius.com/c714b91c4bc45bdec04b6c2a9315f86f.1000x1000x1.jpg"}], "artist": "Too $hort"}