{"songs": [{"title": "I’m Sorry Ms. Jackson (50 Cent diss)", "album": null, "year": null, "lyrics": "[Bridge: Jadakiss]\nWhen it's all said and done\nAfter they said I've won\nAll I'm going to say is...\n\n[Hook]\nI'm sorry Ms. Jackson\nI am for real\nNever meant to make your daughter cry\nI apologize a trillion times\nI'm sorry Ms. Jackson\nI am for real\nNever meant to make your daughter cry\nI apologize a trillion times\n\n[Verse 1: Jadakiss]\nTried to diss kiss to the world\nAnd it's your fault cause she said she saw you kissing a girl\nThe hood was behind her for her whole career\nBut now they've slightly starting to disappeared\nSomething about that\nShe's always angry\nMight have been when them girls trying to push her scalp back\nNeeded some head room\nSo she went out and bought Tyson's mansion with 18 bedrooms\nShe's a domestic boss\nThat don't leave no marks though, you got to digest those scares\nIn fact think you got to tell her to get back\nBecause every kiss rap is similar to a bitch slap\nToo hard since way back in the school yard\nShe's hollywood though all she needs is a boobjob\nGirl in the bubble, didn't mean to trouble her\nMan but im a Calico, im double her\nReally think you should tell her to chill cause\nMy resume is longer than a doctor bill was\nI did the song with ja rule bigging the city up\nShe did the magic stick remix with olivia\nShe got more money but I get busier\nThink somebody going to end up killing her\n\n[Bridge: Jadakiss]\nWhen it's all said and done\nAfter they said I've won\nAll I'm going to say is...\n\n[Hook]\nI'm sorry Ms. Jackson\nI am for real\nNever meant to make your daughter cry\nI apologize a trillion times\nI'm sorry Ms. Jackson\nI am for real\nNever meant to make your daughter cry\nI apologize a trillion times\n\n[Verse 2: Styles P]\nHood had love for this bitch\nCause she came from south side queens with a thug ass click\nBitch got change, and she changed\nNow she don't fuck with the hood, probably give a nigga brains\nBitch got boogie on a nigga\nWent from the hood to hollywood got a movie on a nigga\nBitch talking greasy like new york sting\nSucking down south dick that's some new york thing\nAnd the bitch used to be cool, hood even liked the bitch\nUsed to listen to again in the weeds\nShe had stories of many men, times in the club and niggas that was wanksta but the truth was to see\nBitch ain't shyt, she was real good at bluffing it\nOrdered protection on the niggas she was fucking with\nNow that's a ho that you just can't trust\nHired cops, that's a ho that you just can't touch\nBitch moved out new york when they were swinging them Glocks\nBitch got a deep voice but she would be singing a lot\nBitch would sell her soul just to get on the charts\nWant to front like she's gangsta but she got no heart\nAnd she going to get hit by the mac and\nAll in the back and this time i bet the jaw will be cracking\nShe's going to get broken to fractions d block is the faction\nAll i can say is im sorry ms. jackson\n\n[Hook]\nI'm sorry Ms. Jackson\nI am for real\nNever meant to make your daughter cry\nI apologize a trillion times\nI'm sorry Ms. Jackson\nI am for real\nNever meant to make your daughter cry\nI apologize a trillion times", "image": "https://images.genius.com/34d1815281afeb502b98075367058136.453x453x1.jpg"}], "artist": "Jadakiss"}