{"songs": [{"title": "Breathe It In", "album": "Stoner’s EP", "year": "2012-04-16", "lyrics": "[Hook]\nBreathe it in, breathe it out\nBreathe it in, breathe it out\nBreathe it in, breathe it out\nBreathe it in, breathe it out\n\n[Verse 1]\nWe smoke good good, you smoke sour\nYou got lights out, well we got power\nAsk your girlfriend, she knows how I\nBlew about a zip in my Eddie Bauer\nI like fist fights, you need two Glocks\nYou rock bullshit, while we knock 2Pac\nThis that high five, yep that fire\nBig Snoop Dogg, yeah and I'm gon' die high\nItchy ga ga, you got bush\nWe got Obama, and we blow kush\nAK-47, not that train wreck\nWe blow bubble kush, while you smoke bullshit\nAsk my nephews, up in the yay yay\nIf it ain't the Cali then it must the hay hay\nThis your highlight, so get your shit right\nAnd this that real talk, so get that shit right\n\n[Hook]\n\n[Verse 2]\nYour kids and your mama, they say that they love me\nCause I am the big dog, and you just a puppy\nI got big game, you got nada\nYou like white girls, so you sniff powder\nWeigh that bag light, and play that flash light\nThis your last night, now get my cash right\nI am King Kong, you just a baby cub\nI got long dong, and you got baby nuts\nSmoke with Snoop Dogg, I don't think so\nYou got outdoor, I like indo\nI am legendary, you are temporary\nYou smoke stress for less, we smoke blueberry\nYou got the woo wop sack, so don't start that\nWhy you pop that, young nigga you ain't got that\nIf you need that, turn on your headlights\nCause I got that shit to get your head right\nNow, smell the smiso, I got diesel\nSpread the weed smur', I'm high as a beezurd'\nRelax and kick back as D.O.D. did\nNow hit that, lit that, and bring that shit back\n\n[Hook]\n\n[Verse 3]\nShe likes Lebron, he likes Kobe\nWell I like Baron Davis, cause that's my homie\nL.A. unified, add that up low\nNot what you smoke, cause you smoke bunk dope\nHow many T signs, must I relate back\nIf you ain't got kush, then please don't say that\nWe get down here, your weed got brown hair\nAnd that's the kind of weed that we don't smoke round here\nSee, you smoke red hair, we smoke that there\nYou got whack shit, and we got cat piss\nWe like swisher sweets, you like back woods\nYour weed got seeds, and you think that's good?\nBoy you so lost, I am so boss\nI got Q.P.'s, to me that's no cost\nD.O. double G, L.B.Cizzne'\nI guess this will be the death of me\nAnd if it do so, then let my lungs lay\nCause I'm in heaven blowing seven's of O.G\n\n[Hook]", "image": "https://images.genius.com/ba60ef32580085f132dc154656bbb9f0.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}