{"songs": [{"title": "We Made It Freestyle", "album": null, "year": "2014-03-23", "lyrics": "[Produced by Purpdogg]\n\n[Intro: Eastbound & Down (Kenny Powers)]\nThe only thing I'm seein' I'd like to put an amend on, perhaps a little more room here for the fixins, you know what I'm talkin' about? Oh, we gon' have a lot of fixins? We gonna have so many fuckin' fixins up in this motherfucker, this shit gon' go through the roof. Oh God damn I'm shittin' gold these days\n\n[Soulja Boy]\nWe made it\nWe made it\n\n[Verse 1: Jay Electronica]\nThe devil, the haters, the bloggers\nThe papers, the labels, they labeled me\nBut they can't relate to our struggle, my nigga\nWe came up from slavery\nApologies go out to all of my fans cause they waited so patiently\nThis one is for all of the lost and forgotten black angels that prayed for me\nA milli, a milli, niggas love me cause I'm ill\nThe greatest story ever told, niggas in the field\nFrom Solomon to Sambo to Django, it's fact\nI'm the Farrakhan of rap and I get it from the wheel\nThe son of WD, who hung around in the D\nWho ran around in the three\nThe trap gods raised me\nFace all on the Sphinx\nStory all in the wall of the pyramids\nNiggas know the Black God saved me\nYou can blow the nose off, that won't change it\nObamacare won't heal all that anguish\nWe came a long way from the bottom of the boat\nAll praise to the Mahdi, we found our language\nGold necklace, middle finger erected\nGod tribe of Shabazz stylin' on the record\nLost sons of Muhammad, we wildin' in the wreckage\nAsha du illah illaha is the message\nAll these niggas, I got to fight one\nAll these devils, I got to strike some\nAll these rebels just waitin' on the war cry\nMama said: \"son, you got to strike drum\"\nRoc Nation, celebration\nMotivation, elevation\nNigga we made it from slaves on a slaveship\nLive from the cotton fields, straight to the spaceship\n\n[Interlude: Kenny Powers]\nKinda makes me wonder why the hell so many people are tryna tell me to slow down. Seems like motherfuckers should be shuttin' the hell up and enjoyin' the show\n\n[Verse 2: Jay Z]\nHop off the slave ship\nPopped off my chain and took it to Jacob, I got it gold plated\nWalked in that bitch like \"Nigga we made it!\"\nI own my own masters\nYou know I ain't missin' no royalty statements\nI can't be rated (God, God), damn Hov stunt on them haters\nSorry Mrs. Drizzy for so much art talk\nSilly me rappin' 'bout shit that I really bought\nWhile these rappers rap about guns they ain't shot\nAnd a bunch of other silly shit that they ain't got\nI'm on my Lupita Nyong'o\nStuntin' on stage, after 12 Years A Slave\nThis Ace of Spades look like an Oscar\nBlack tux, look like a mobster\nDon't make me RRRRAA yah, nigga watch your tone\nI come to court with black boxers on\nY'all hella jealous of my melatonin\nI could black out at any given moment\nI'm God, G is the seventh letter made\nSo when my arms and feet shackled I still get paid\nAll praises due\nI'm ready to chase the Yakub back into caves\nThese are the last days, but do I seem fazed?\nShowed up to the last supper in some brand new J's\nI'm the true and livin', book of Hov\nNew religion, 8th wonder of the world, alien, superstition\nYou're blind, baby\nBlind to the fact of who you are maybe\nMy bloodline's crazy\nKings and queens and Michael Jordan rings\nI go estúpido, sucio\nThe flow is filthy, y'all can't kill me\nI've been inoculated from the snakes and the fakes\nAnd your corny handshakes, cock sucker we made it!", "image": "https://images.rapgenius.com/d0076c473a574a522d18bbcc81872113.400x400x1.jpg"}], "artist": "JAY-Z"}