{"songs": [{"title": "Only Ye", "album": null, "year": null, "lyrics": "[Verse 1: Tyga]\nI'ma make you love me, yeah, I'm your only hope\nListen to your momma, have a baby, he got dough\nDon't go creepin' if ya got a iPhone\nShe tracked ya location and ya ass wasn't home\nYeah, I told the bitch like I told Nike: Yeezy's on yo' ass\nTold that nigga get from and from my car\nMy Yeezy's on the gas\nAnd last thing I need is involuntary manslaughter\n'Cause I ain't finna let no lame nigga raise my daughter\nStop asking me that dumb shit; do you have a Samsung charger?\nYou see me spending that Gualla\nWe stay spending that Gualla 'til you love me\nThirsty bitch, keep sippin' that water 'till you love me\nDo you love me?\nI got caught up with the strippers, I got caught up in the fame\nCaught up on MediaTakeOut\nDon't know how much more I could take\nI got caught up in the pictures, they blurry enough I could fake\nI can tell my girl it wasn't me, I was in a meeting with Jay\n\n[Bridge: Tyga]\nBut today, I don't have any plans\nRap God in a minivan\nUsher say I got it bad, yo, really bad\nDoes anybody have any 'Xans?\n\n[Verse 2: Tyga]\n'Cause you don't know these rich-nigga problems\nYou niggas got bitch-nigga problems\nToo many hoes on my dick; yeah, I got big dick nigga problems\nIf she hack my phone, that's dick pic nigga problems\nThat's when she ask, \"Who the fuck is Tonya?\"\nNigga, you must be fucking Tonya\nSometimes I do shit to prove I don't need nothin' from 'em\nSometimes I make 'em hate me just to prove I can make 'em love me again\nI could make you love me again\nI'll make y'all love me\nI feel like a new artist up in this bitch\nLike I'm really starving up in this bitch\nIf you don't wanna hear my mouth, don't get me started up in this bitch\nEvery time I throw up my diamond, see it's flawless up in this bitch\nScreaming south-southside, goin' retarded up in this bitch\nSee T-Raww up in this bitch\nYeah, see Yeezus back on his shit\nThey say damn Ye, please come back\nWe need more of the platinum hits\nBitch my new boot killed that Timberland\nMy niggas don't remember them\nI'm the dark chocolate Eminem\nI'ma make you love me\n\n[Verse 3: Kanye West & Tyga (both)]\nYou see love and hate's a similar emotion\nOpposite of love is the difference\nThat's when motherfuckers don't care about you no more\nI'd rather be hated and loved than be not cared about\nRrrrra, rrrrrrra, get these motherfuckers out\nSee I immediately took the media\nSee I immediately took the media\nAnd made it what it mean to me\nI control this shit, I control the puppet strings\nI am in charge of the narrative\nSo don't ever compare this shit\nAs I air this shit out, a modern day Ali\nFor anybody that wanna try me, see\nAll I ever wanted to do was take the whole time on TV and give an eleven-minute speech\nThey wish I would perform for these niggas\nDance. nigga. dance, dance, nigga, dance, dance, nigga, dance\nI been dancing too long and y'all motherfuckers money been getting too strong\nIf I hear another motherfucker I put on made a million dollars a day (uh, yeah, yeah)\n(Fuck [?] all these hoes, I'ma make you love me, yeah)\nIf I hear another motherfucker I put on made a million muhfuckin' dollars a day (uh, yeah, yeah)\n(Them boys just don't know, I'ma make you love me, yeah)\n(Hit me on my phone, I can't hear them other girls 'cause I got them hoes on hold)\nIf I say, I say (I'ma make you love me, yeah, yeah-yeah)\nI'ma make you love me (yeah, yeah-yeah)\nI'ma make you love me (yeah, yeah-yeah)\nYou never stopped loving me, did you?\n(I'ma make you love me, yeah)\nYou never stopped loving me. did you?", "image": "https://images.genius.com/70c6e506a91f6dabdd23cad304812ce3.533x533x1.jpg"}], "artist": "Kanye West"}