{"songs": [{"title": "Turnt up (feat. lil twist)", "album": null, "year": null, "lyrics": "(Lil Twist)\n(haha yeah, well)\nI stay turnt up like a stove with a t-kettle\nSwag see it like a kid in the hospital\nAll that and your doe still a lot little\nPussy up bust a but spittin hot riddles\nLike a dog off the leash when I say get\n'em sic sic 'em theres another victim\nGet into the paper when I baseball hit em\nPython bite yeah da boy sit bent em uh\nWhat they talkin' about? Like big bros say we walkin\n'em out but in my free time I'm learnin how to skate so\nI'll fuck around and member put the park in the house\nPropane flow I'm the spark of the south!\nBullseye, nigga yeah the target is out!\nErrybody go to red carpet is out so high man\nI can't come down ahhh\n\n(Chorus)\nI'm so turnt up in this bitch\nTurnt up in this bitch\nGot better house note on my wrist no less than\n100k for my whip Uh\nWho's fuckin with me?\nAin't a nigga that's fuckin with me\n9 chicks got a couple with me, wild girls like driving with me!\n\nWho's fuckin' with me?\nWho's fuckin' with me?\nWho's fuckin' with me?\nAin't a nigga that's fuckin' with me\nWho's fuckin' with me?\nWho's fuckin' with me?\nWho's fuckin' with me?\nAin't a nigga that's fuckin' with me Nope!\n\n(Busta Rhymes)\nTwist, lemme get em..\nShuttin every party down is the minimal\nTell the police lookin' for a nigga like a criminal\nEar plugs needed in this mofucka like\nI got the volume now up way up on the tenth visible\nMake a nigga ears bleed till 'em it is critical niggas\nThink they nice and yeah that shit is kinda typical\nTill they be alone, and anyway in where they come from ???\n(Jibberish)\nSome will try to do this but you know who the original?\nTurnt up crazy nigga kinda cynical\nI gotta laugh if you niggas only really knew the half to tell\nThe truth you niggas be soundin' pitiful\nReal talk hommie Imma warn you, don't front or\nI'll sick the little Youngen on ya\nFlow on em lil Twist go get 'em before\nI have to heat it up like it was sittin' in a sauna\nLookin' like a nigga still hustle on tha corner bossed up like a\nCeo time on her\nAnd if I gotta spittin any longer\nSomebody gonna probably gonna feel the\nDifferent kind of taught ya\nWhen it comes to backin' on a first step\nFuck around and be the first to get burnt up\nNiggas know that when we in the building yeah we get it\nTurnt Up!\n\n(Chorus)\nI'm so turnt up in this bitch\nTurnt up in this bitch\nGot better house note on my wrist no less than\n100k for my whip Uh\nWho's fuckin with me?\nAin't a nigga that's fuckin with me\n9 chicks got a couple with me, wild girls like driving with me!\n\nWho's fuckin' with me?\nWho's fuckin' with me?\nWho's fuckin' with me?\nAin't a nigga that's fuckin' with me\nWho's fuckin' with me?\nWho's fuckin' with me?\nWho's fuckin' with me?\nAin't a nigga that's fuckin' with me Nope!\n\n(Twist)(hahah)\nG et 'em!\nOn the words big bro gotta tell me\nMain weather on the nigga on the bell ring\nWon't lose if a nigga try to feel me\nGotta betta off chainsaw hill freeze\nBad chick chop some weed up\nIn the back of the back main back with my feet up\nFranklins like urethra shut the whole\nMall down with a swipe of the Visa!\nShades black can't walk up\nReeds game full of ice lot of cars like Tonka\nMy swag is awesome, awesome and I run it like Boston\nFlashy like Rondeau\nGot a bash full of bad girls sittin' in the condo\nTwizzy half the head honcho shoutout\nCc ablejacks in da londo!\nSix swags see the real whip past got\nThe chicks wanna to ride me like Six Flags\nG4, G5 switchbacks\nGone in the earliest gone quick, fast!\nTell B roll it up like Nash\nWhile I'm in the back countin' up this cash\nDetails swag put a pull up in the slap\nTrot wave like I can't handle the clash!\n\n(Chorus)\nI'm so turnt up in this bitch\nTurnt up in this bitch\nGot better house note on my wrist no less than\n100k for my whip Uh\nWho's fuckin with me?\nAin't a nigga that's fuckin with me\n9 chicks got a couple with me, wild girls like driving with me!\n\nWho's fuckin' with me?\nWho's fuckin' with me?\nWho's fuckin' with me?\nAin't a nigga that's fuckin' with me\nWho's fuckin' with me?\nWho's fuckin' with me?\nWho's fuckin' with me?\nAin't a nigga that's fuckin' with me Nope!\n\nHaha", "image": "https://images.genius.com/54314abfbbbf16253d72455428cc44e6.834x834x1.jpg"}], "artist": "Busta Rhymes"}