{"songs": [{"title": "Gangster Shit", "album": null, "year": "2016-05-31", "lyrics": "[Intro]\nDid you pray today?\nDid you pray today?\nI could dick you down on some gangster shit\nDid you pray today?\nI could put you down on the gangster shit\nI could put you down with some gangster shit\nDid you pray today?\nDid you have a baby?\nYou got ventilation\nHer sex is amazin'\nShe like penetratin'\nI'll leave that pussy achin'\nThugger!\n\n[Verse 1]\nI was bangin', servin' rocks inside my classes\nBig pimpin', you can send or just fax it\nI was fresh, every day like it was my last\nThese politics, they're tryna lock me out and latch it\nThese politics, they're tryna block me, but I'm savage\nFor every bitch that tried to diss me, I'm not average\nI told my mom I want some green, ain't talkin' cabbage\nThese bitches backstabbin' and these niggas done turned to addicts\nThey ridin' 'round geeked up out their mind\nSoon as they come down, ain't got a fuckin' dime\nWhere that nigga that raised you? That's a whole other story\nHer nigga's diamonds like glaciers, seven rings on me like Horry\nI flood my wifey with them VVs and that CC\nI swear to God I've been so fresh ever since little league\nMy old lady know all these girls are tryna steal me\nSteal, yeah\nCheck out my diamonds, I'ma shine until they feel me\nThey put them teeth inside my mouth and then she healed me\nAll these pussy niggas really small, little league\nYeah she put that pussy on my log, ooh-wee\nYeah, yeah, yeah, yeah\n\n[Hook]\nI could dick you down on some gangster shit\nI could dick you down on some gangster shit\nI could put you down on some gangster shit\nI could have you ridin' round with gangsters, shit\nI could talk to Taz, she's a gangsta bitch\nI can talk to Ralo, he a gangsta nigga\nYeah, I done popped the top, that's a gangsta lit\n650 thou', that's a gangsta lick\n\n[Verse 2]\nRunnin' circles, on these niggas\nDrinkin' color purple, on these niggas\nAyyy, I'ma take off runnin', on these bitches\nWhen hungry, I fill up my tummy, with these riches\nWhen I'm servin' you, homie, when I'm servin' you\nGotta keep the tool on me, gotta keep the tool\nHer booty lookin' plummy, plummy\nThese lil' niggas lookin' bummy, bummy\nIf I say, \"Come on,\" you know she comin', comin'\nOG Kush, it's smellin' like a junkie, junkie\nThese fuck niggas, they done bought my drugs\nThey'll have you lookin' like a man in debt\nYou see I'm out here\n\n[Hook]\nI could dick you down on some gangster shit\nI could dick you down on some gangster shit\nI could put you down on some gangster shit\nI could have you ridin' round with gangsters, shit\nI could talk to Claire, she's a gangsta bitch\nI can talk to Ralo, he a gangsta nigga\nYeah, I done popped the top, that's a gangsta lit\n650 thou', that's a gangsta lick", "image": "https://images.genius.com/ca95fe8e6a3456dd15028a1ddbe8f626.1000x1000x1.jpg"}], "artist": "Young Thug"}