{"songs": [{"title": "High", "album": "On the Rvn", "year": "2018-09-24", "lyrics": "[Chorus: Elton John, Young Thug & Both]\nAnd I'm gonna be high (hi-i-i-i-i-i-igh)\nI'm a rocket man, I'm a rocket man, hey!\nAnd I'm gonna be hi-i-i-i-i-i-igh\nI'm a rocket man (hi-i-i-i-i-i-igh)\n\n[Verse 1: Young Thug & Elton John]\nAtlanta by my side\nDifferent land for my kind (Thugger!)\nSpend ol' bands for my pa (racks)\nSpend ol' bands for my mother (I'm a rocket man)\nGot a plan for my brother (hey)\nChanel bag for my lover (hey)\nFuck them ol' niggas, they ol' suckas (hey)\nThey tellin' on one another (and I'm gonna be-)\nI want a train, let's run a train (okay)\nIf she wan' bang, then let her bang (hey)\nHe said he bleeding, where the stain? (where is it?)\nMy bitch at the top of food chains (I'm a rocket man)\nThey local, I don't even know they name (no)\nI been fresh since a kid, ain't never plain\nI just picked up a bag in Rotterdam\nI'ma whip out the MAC and pop ya brain\n(And I'm gonna be-)\nI do what I want and shawty can't (yeah)\nI do what I feel and shawty cannot\nI'm diggin', I digg and shawty layin' (Thugger)\nAnd all of the bitches say they digg that (I'm a rocket man)\nFrom Maine way to Spain (woo)\nAll I got is a chicken for the thots (yeah)\nI take off like a plane-\n\n[Chorus: Elton John, Young Thug & Both]\nAnd I'm gonna be high (super geeked!)\nLike a rocket man, hey, like a rocket man, he-ey!\nAnd I'm gonna be hi-i-i-i-i-i-igh\nI'm a rocket man (hi-i-i-i-i-i-igh)\nHigh as a plane! From Spain to Maine, you know what I'm sayin'? Damn\n\n[Verse 2: Young Thug & Elton John]\nOn a private order (yeah)\nI'm a rocket launcher (yeah)\nIt gotta be the pride of something (bet)\nI walked out, Magic stumbling (I'm a rocket man, woah)\nI stumble upon a mil' (yeah)\nI stumble upon a million five\nI spent a fortune all on double seals\nIf I tell you the numbers you'll probably cry (And I'm gonna be-)\nIf I tell you you fake then you'll probably die\nThese days if he say that he hit then he probably lyin'\n(I'm a rocket man, woah)\nIf you say you got wings and some fish then you probably fried (that's deep)\nGot my karats out of Bonnie & Clyde (woo! And I'm gonna be-)\nShe let me back in like she never cried\nShe let me back in like I never lied\nI look like a cat with 11 lives\nI really kick shit you can ask a fly (I'm a rocket man)\nI'm steady chasing like I'm never tired\nI'm living scary like a haunted house\nLil mama sexy, I got butterflies, hey\n\n[Chorus: Elton John, Young Thug & Both]\nAnd I'm gonna be high (hi-i-i-i-i-i-i-i-i-igh)\nI'm a rocket man, I'm the rocket man, hey! (yeah! yeah!)\nAnd I'm gonna be hi-i-i-i-i-i-i-i-igh-igh, yea-yeah\nI'm a rocket man\nHi-i-i-i-i-i-i-i-igh (ye-yea-yea-yeaah, yeah, yea-ah)\n\n[Outro: Elton John]\nAnd I'm gonna be high\nI'm a rocket man", "image": "https://images.genius.com/9f540cef77e11d68df15bce7200bf5ff.1000x1000x1.jpg"}], "artist": "Young Thug"}