{"songs": [{"title": "Successful (Remix)", "album": null, "year": null, "lyrics": "[Verse 1: Drake]\nPart of me wished I can meet with\nAll you haters in person, they got a lot of\nFeelings for me they just ain't certain. How to\nExpress themselves when I walk into the club and\nTake stares like the fuckin elevators ain workin\nYeah. Cause they know the promoter pays you, you wouldn't\nHave come if somebody hadn't of made you, you just looking\nForward to seeing women that played you and shitting\nOn the men they get engaged to, I swear it's like. Uh\nMore confidence and less fear. We can discuss it further\nWhen y'all manage to get here. Diddy here, O here\nSkinny here, Rex here and we just having one of them conversations\nAbout next year. I`ma kill it, I promise that`s how I know you\nMad. I've always treated my city like some shoulder pads. The\nBig homie use a flash if you must and I swear I ain't asking\nFor much, all I want is the\n\n[Hook: Trey Songz]\nI want the money, money and the cars\nCars and the clothes, the hoes, I suppose\nI just wanna be, I just wanna be successful\nI just wanna be, I just wanna be successful\nI just wanna be, I just wanna be successful\n\n[Verse 2: Soulja Boy]\nHip-hop is like school, yeah I had to\nLearn it. Beef is like a blank disc, yeah\nI had to burn it. They finally showing me\nRespect but I had to earn it. I'm heading to\nThe finishing line, ain't got no time for\nU-turns. Today I realise that I'm not perfect\nEverything I did to get here wasn't really worth it\nWhy won't they just let me be great. You fall down seven\nTimes you stand up eight. Realise true happiness lies\nInside of you. Everyday give yourself a mental shampoo\nThe birds singing after the motherfukin` storm gone. If you\nWant to sing, you can always sing this song. Turn my swag\nOn, this my theme song, there`s 95 per-cent chance that I used to\nBe your ringtone. I got swissel and cheese but I don't yodel\nHeart tatted on my neck they love my vocal\n\n[Hook: Trey Songz]\n\n[Verse 3: Soulja Boy]\nAs I sit back and spit this crack and leaking\nOn the internet and watch my haters react\n50 said they can't read between the lines so\nI jab, uppercut, punchline after punchline\nI know you thinking damn Soulja going hard\nRight now. And I'm thinking damn this is just the\nStart right now. Soulja Boy is going on a renegade\nIf life give you lemons make lemonade\n\n[Hook: Trey Songz]\n\n[Outro: Soulja Boy]\nUh, no one person on this earth can change their past\nBut every single person on this earth can start today\nAnd change their future. That`s real shit. Beezy\nSoulja Boy I tell 'em", "image": "https://images.genius.com/e8e4af9d70633a1703ccd3faf671871c.640x640x1.jpg"}], "artist": "Drake"}