{"songs": [{"title": "Ride Wit Me", "album": "The Leak", "year": "2006-03-28", "lyrics": "[Intro]\nLet's get it homeboy!\nY'all already know what is man, this ain't nothing new to y'all man!\nT.I.P., Pimp $quad Click ya understand that?\nKing of the South! Hey!\nWestside of the A-Town, nigga you don't know no better nigga\nZone 1 thru 4\nBANKHEAD!!\nBowen Homes, Bankhead Courts what's happening?\n\n[T.I. over Intro]\nHuh, huh-ayyyy\nYuh, yuh, huh-ayyyy\nGrand Hustle - c'mon and kick it wit me for a minute you know what I'm saying?\nCome and ride wit'cha boy man, hey!\nY'all ready know what it is, aye..\nWe gone swing by Simpson Road y'know what I'm sayin'\nWe gone ride down Bankhead my nigga\nC'mon and ride wit a nigga right quick aight?\n\n[Hook]\nCome and ride wit me nigga, lemme show you where we kick it at\nWhere them suckers get it at and hustlas keep the chickens at\nRide wit me nigga, lemme show you where we kick it at\nWhere ho niggas be snitchin at and often come up missin at\nRide wit me nigga, lemme show you where we kick it at\nWhere them killers livin at and T.I.P. be trillin at\nRide wit a G, come and ride wit a G\nAll through the ATL, come and ride wit a G\n\n[Verse 1]\nSee me riding through Atlanta in a Phantom with the double door\nMake these bitches wonder what he be in so much trouble for\nI'm touching folk, anytime they tryin Grand Hustle folk\nAnd busting folk, what the fuck they arguing fussin cussin for?\nYou lucky ho, a couple of years ago I'da probably cut your throat\nBut fuck it though, what I'm spending somethin on a nothin for?\nThis well-known flow, man I got this shit from Simpson Road\nAdamsville, Bowen Homes, Center Hill to Zone 4\nA drop top, flip flop, shine thats the chrome glow\nTIP pop out the roof, ay what he up in Herndon Home for?\nWith long dough, shit he just doin what he known for\nBlowin 'dro on twenty-fo', livin how the song go\nRubber burnin, turnin corners, beatin like a congo\nYou try to jack and pull the strap, it's +ASAP+ pronto\nKing of the South, every hood's head honcho\nI'm Westside certified, go where the fuck I wanna go\n\n[Hook]\n\n[Verse 2]\nHey I done told y'all I'm a O.G., never had cold feet\nYou end up with no teeth, nigga \"U Don't Know Me\"\nI'll knock ya off ya feet, put holes in ya 'til ya clothes leak\nToss this in the river like I threw away my old heat\nYou chose to oppose me? Who the fuck you 'posed to be?\nMechanicsville to Summerhill, the Zone 3 done roll wit me\nNo ho's in me, you know all the blow these folks done sold wit me?\nI'm everything you 'posed to be, boy ain't no runnin over me\nKick it wit the +King+ and lemme show you what I mean man\nMost these niggas rappin 'bout a block, ain't never seen nann\nReal niggas recognize, real niggas and ye ain't nann\nYou don't know how to stab a nigga dead, keep a clean hand\nOr sell a block for twenty-fo' you got for seventeen grand\nFrom Eastside niggas in Kirkwood and Little Vietnam\nThese 26's keep the attention of bitches\nCome and ride wit me pimpin, lemme show you how we get it\n\n[Hook]\n\n[Bridge]\nAlabama, Mississippi, come and ride wit a G\nDallas ride wit a G, Houston ride wit a G\nCarolinas, Virginia, Philly come and ride wit a G\nMemphis ride wit a G, Chicago ride wit a G\nCalifornia, Florida, Detroit they all gon' ride wit a G\nPhoenix ride wit a G, St. Louis ride wit a G\nSeattle ride wit a G, Jersey ride wit a G\nVegas, New York, and D.C. they all ride wit a G\n\n[Hook]", "image": "https://images.genius.com/757a45da6a6e4106770d36a71b9d8b5b.300x300x1.jpg"}], "artist": "T.I."}