{"songs": [{"title": "Lifetime", "album": "The Infamous Mobb Deep", "year": "2014-04-01", "lyrics": "[Intro: Prodigy]\nSometimes I ask myself\nWhy the fuck we still doin' this shit?\nFor the love?\nFor the dough?\nFor these hoes?\nFor the life?\nYeah, uh\n\n[Verse 1: Prodigy]\nDeath'll cometh, purgatory punish\nDumb muthafuckas and grimy ass bitches, yeah\nFlex on me, I'm paying you a visit, yeah\nI come through there with horrible intentions\nMy rifle get lit, it's a terrible weapon\nThere ain't nothin' when I shit\nGon' clean up the messin'\nAll because I'm a gold decorated veteran\nPlatinum and precious stones, my necklace\nStill on parole, still pop a nigga quick\nShe feelin' me? I'll pop a nigga bitch, uh\nKing-sized ego, they hatin' on me for\nAll I do is shine, baby, shine writin' these dope\nKing Size B-R'S and you a little beeyotch\nKick you in your muthafuckin' head 2 or 3 times\nYou'll be aight, baby boy cryin' for mommy\nYou wasn't really 'bout that life\n\n[Chorus: Prodigy]\nThey be actin' like they know somethin' they don't really know\nMan, I spend all my days, my nights locked up in the studio\nFeel like a lifetime, I'm-I'm-I'm\nSpillin' my lifetime, I-I-I\nYou not in yo right mind, uh-uh-uh (Yeah)\nYou niggas tryna take me for a joke?\n\n[Verse 2: Havoc]\nSkin tone dark skin, camo hoodie, Timbs on\nFull on type of shit that rip a nigga grill off\nLive by the code, sleep with an iron\nOne eye open, hope a nigga try it\nAccumalated riches raised out of sweatbox\nNow I'm countin' bread, transfer money off of a desktop\nTop lawyer so the jury came back deadlocked\nSnitch down, all he saw was fire when the lead popped\nPermanently on bed rest\nShorty talkin' marriage, she ain't even give me head yet\nDead wrong niggas, not a bit of conscious in us\nSaid, \"fuck the world,\" went ahead and just did us\nDid us, never look back, it's survival\nUp and ready, never let these little niggas try you\nOne slip'll have a nigga headed to a grave\nPine box, timeslot took the fuckin' way\n\n[Chorus: Prodigy]\nThey be actin' like they know somethin' they don't really know\nMan, I spend all my days, my nights locked up in the studio\nFeel like a lifetime, I'm-I'm-I'm\nSpillin' my lifetime, I-I-I\nYou not in yo right mind, uh-uh-uh\nYou niggas tryna take me for a joke?", "image": "https://images.genius.com/d36f3c5fdf16cb402e39bef763e25bf4.1000x1000x1.jpg"}], "artist": "Mobb Deep"}