{"songs": [{"title": "Rise and Shine", "album": "Cole World: The Sideline Story", "year": "2011-09-27", "lyrics": "[Intro: Jay-Z]\nThere's a nigga right now somewhere\nHe at the table with a bowl of Apple Jacks\nAnd he's reading the back of the cereal\nAnd in between eating the Apple Jacks he's writing some shit\nAnd he wants my spot\nI'mma find him though, I'mma sign him..\nI don't want no problems\n\n[Verse 1: J. Cole]\nLike we always do at this time, Cole blowin' your mind\nHey dummy, this no accident, all of this was designed\nTook my time, crept from behind\nAnd I opened up your blinds, rise and shine, Cole World\nSame nigga used to drive around with yo girl\nIn my mama's Civic, now I'm out here tryna get it\nI ain't like you lame ass niggas, boy I spit it how I live it\nSo when you see me in the streets, man I ain't gotta mimic\n'Cause I ain't got an image to uphold, this real shit\nI ain't got a gimmick, I just flow, the niggas went nuts for\nThe boy that set fire to the booth\nIn a game full of liars, it turns out that I'm the truth\nSome say that rap's alive, it turns out that I'm the proof\n'Cause the ones y'all thought would save the day can't even tie my boots\nThe ones y'all thought could hang with me can't even tie my noose\nLet these words be my bullets, nigga, I don't rhyme, I shoot, bang!\n\n[Hook]\nBefore I wake\nI pray to the Lord, my soul to take\n\n[Verse 2]\nLord I been dreamin' bout the paper, get rich 'fore I see my life taper\nHope my mama get to see Jamaica before she meet her maker\nI hoop was never good enough to ever be a Laker\nBut these words I record got me ballin', Jordan\nMore than a rapper this a natural disaster\nBoy, I'm meaner than Katrina mixed with Gina, \"Shut up, Cole!\"\nThis is for my niggas back home, homes, what up, bo?\nThis is for the bitches that played me, what up, ho?\nNah I ain't mad, it's sad, you went from bad to real bad\nTwo kids that don't even know their real dad\nReal sad, baby girl I wish you still had it\nThen maybe you could get a taste of livin' Villematic\nIs Cole still at it? Y'all be talkin' about the same shit\nThat's how I feel about it, mama was a real addict\nThat's why I don't respect that lyin' ass white shit you talkin'\nCole's planning funerals, you might fit the coffin\n\n[Hook]\nBefore I wake\nI pray to the Lord, my soul to take\n\n[Verse 3]\nGet on your job lil mane, this ain't Saturday\nWe in two different lanes, you can't navigate\nWe in two different games, you playin' patty cake\nBrother you're lame, you're Shane Battier\nYou out of shape, my mind run a mile a minute\nThe sky's the limit, I'm so high, I'm divin' in it\nMy rides is tinted, my knob's gettin' slobbed up in it\nShe hollerin' God, man you would've thought that God was in it\nBut it's just a nigga God invented\nThe best out, foolish pride'll make you not admit it\nBut if this shit ain't fire nigga, why you noddin' with it?\nThe hate in your blood can't stop your soul from vibin' with it\nNow you all conflicted cause my flows is wicked\nAnd my hoes is thicker and all of yours is pickin' me\nCause they know a star when they see a star, nigga\nAin't even got to fuck him to know he a raw nigga\nI got her in my bedroom, but cheer up, nigga\nYou saved so many hoes, you a hero, nigga!\nMedal of honor, I'm feelin' on top like Pac\nWhen he slept with Madonna, hey, this is death before dishonor\nGet arrested and forget to tell my mama\nShe got enough to stress about, my niggas gonna get me out\nThen we hit the club with the thugs and the liquors\nNo criminal record but I'm makin' criminal records\nIsn't it ironic? Isn't it iconic?\nJacket so expensive you wouldn't even try on it\nBut it fit me perfect, I purchase it if I want it\nThe city on my shoulder, so no girl, you can't cry on it\nWhen you make a list of the greatest aye, am I on it?\nMaybe not yet but bitch I got the clock set\nIt goes tick-tock, game on lock\nSon gon' shine but the reign won't stop, oh no\n\n[Outro]\nIf I should die before I wake\nI pray to the Lord my soul to take\nMy soul to take, my soul to take", "image": "https://images.genius.com/40e3a5c128f6db9b27cebe6606882165.1000x1000x1.jpg"}], "artist": "J. Cole"}