{"songs": [{"title": "Pity", "album": "Any Given Sunday #1", "year": "2011-07-31", "lyrics": "[Intro: Zulema & J. Cole]\nGod help the hungry children\nHelp the homeless children\nHelp them to survive the world they can't understand\nYeah, sip of this ma'fuckin' drink\nGod help the child who's needy\nWho needs love not pity\nLean back, volatile\nHelp them to survive this cold and bitter land\nYeah\nYeah, hey...\n\n[Chorus (Condensed): J Cole]\nIs this the life that You chose for me?\nIs this the life that You chose for me?\nIs this the dice that was rolled for me?\nI won't cry about it, I won't cry about it\nIs this the life that You chose for me, Lord?\nIs this the life that You chose for me?\nIs this the dice that you rolled for me?\nYeah, yeah\n\n[Verse 1: J Cole]\nThis is The Ville, home of the fast-lifers\nWhere we get high and don't come down, we gas prices\nMan, I wonder how hard to live my past life was\n'Cause this one hard, I could show you my scars, I ain't cryin' though\nAyy, save that pity for the next man\nOr that girl getting beatdown by her ex-man\nAyy, hold your head, mama, I know you wish that nigga dead, mama\nIf I can find a way to kill him, I won't have nar' drama\nDamn mama, tell me who you love\nThis one is for the boy that see his mama on drugs\nI feel your pain, boy, and just know I been through the same, boy\nThat lady need you more than ever, don't be ashamed, boy\n'Cause when it rained, boy, that was your umbrella\nThe one that changed your pissy sheets when you was a young fella\nAnd now she in the bedroom on her knees\nStaring at the sky, screaming \"Lord, please!\" Tell me now:\n\n[Chorus: J Cole & Omen]\nIs this the life that You chose for me?\nIs this the life that You chose for me?\nIs this the dice that was rolled for me?\nI won't cry about it, I won't cry about it\nIs this the life that You chose for me, Lord?\nIs this the life that You chose for me?\nIs this the dice that you rolled for me?\nI won't cry about it, I won't cry about it\n\n[Verse 2: Omen]\nIt's like...\nSoon as you cling on my mind's sayin' \"be gone\"\nI leave 'em with wrinkled foreheads, they now Klingons\nConfused, 'cause friendship's abused and I'm sorry for it\nMy life performance been trifling, sometimes I fight my conscience\nWas never given spades, but I always had the heart\nAlways misplayin' the hand that was dealt the joker cards\nIs what I was feelin' like, lonely, low energy\nFallin' slow, clinically, ballin'? No, but we finna be\nDon't pity me ever, even when them haters answerin'\nMind state of the victor, no victim, I'm just a champion\nMoney comin' slow, God, intervene\nSpirit's never broken, I'm just focused, don't pity me, no no no\nYou see this pain put a strain on my whole life\nI seen the rain, seen my dreams turn to long nights\nBut all I ask is don't pity me, no, no\nDon't pity me, no, no, don't pity me, no, no\nNo\n\n[Chorus (Extended): J Cole]\nIs this the life that You chose for me?\nIs this the life that You chose for me?\nIs this the dice that was rolled for me?\nI won't cry about it, I won't cry about it\nIs this the life that You chose for me, Lord?\nIs this the life that You chose for me?\nIs this the dice that you rolled for me?\nI won't cry about it, I won't cry about it\nHey, I can't cry about it\nNuh, gotta be strong, can't cry about it\nHey, uh\n\n[Verse 3: Voli]\nYeah\nAnd I\nFreestyle life, can barely write the rent\nYearly income can barely keep this music life in check\nCall up mama, \"Hate to borrow money with Christmas near\nHey, you know what, how 'bout we make each other gifts this year?\"\nFriends are calling me up, asking me if I'm signed yet\nWho I'm working with? Am I making dollar signs yet?\nDisappointment within their voices - do they pity me?\nDisbelief - I'ma stay driven like them city streets\nBut ah, it seems like every day is rainy weather\nCan barely fit my pain and pride beneath the same umbrella\nBut he don't care, he don't care, it's hard to keep em dry\nNo more caterpillar, now you see him change: peeping Tom\nYeah, this life will flash before your eyes\nSo get your match before your fire turns to ash, no more drive\nNo more gas, before you cry, get your last, before you die\nLive your past with no regrets, broken necks, no looking back, man\n\n[Chorus (Condensed): J Cole]\nIs this the life that You chose for me?\nIs this the life that You chose for me?\nIs this the dice that was rolled for me?\nI won't cry about it, I won't cry about it\nIs this the life that You chose for me, Lord?\nIs this the life that You chose for me?\nIs this the dice that you rolled for me?\nYeah", "image": "https://images.genius.com/d75165afed097efe5c123d56cef54f0a.1000x1000x1.jpg"}], "artist": "J. Cole"}