{"songs": [{"title": "THere He Go", "album": "Habits & Contradictions", "year": "2012-01-14", "lyrics": "[Verse 1]\nAin't got no jewelry on, still I'm shining hard\nAin't got no bodyguard, walking solo through the mall\nBitches and the hoes know they see me they like, \"There he go!\"\nThey be like, \"There he go! Schoolboy, there he go!\"\nChiefing like a mothafuckin' Seminole\nHere we go, off probation probably go to Mexico\nFurthermore, can't find this in the store, this shit ain't for the low\nGot my daughter swagging like her mothafuckin' daddy though\nThe patio, what a mothafuckin' view\nNappy chin hairs, bitch, I'm mothafuckin' Q\nUhh, mothafucka, mothafucka, yeah\nFucking is my favorite word, reason why I'm fucking her\nShe swallow my dick and balls, whatever occur\nPurr, I love that kitty cat\nAss fat, throw it back, I can't believe you wifing that\nDeepthroat, seven or 11, she's a double gulp\nMy pistol drawn, her boyfriend got me paranoid\nNigga try sneaking up on me and I'm making noise\nBut what I failed to understand, I'm the mothafuckin' man\nRan into him, he's a fan, goddamn\n\n[Hook]\nI'm shining hard, they be like, \"There he go!\"\nNo bodyguard, they be like, \"There he go!\"\nUp in your broad, they be like, \"There he go!\"\nThey be like, \"There he go! Schoolboy, there he go!\"\nHiiiPower, bitch, they be like, \"There he go!\"\nBlack Hippy shit, they be like, \"There he go!\"\nMagnificent, they be like, \"There he go!\"\nThey be like, \"There he go! Schoolboy, there he go!\"\n\n[Verse 2]\nLook up in the sky, it's a bird, it's a plane\nNo, it be this nigga here just looking at you lames\nWith my niggas, yo, we betting on the Laker game\nEven though my niggas lost, another iTunes check done came\nGarcia Vegas, yeah, that bitch be burning slow\nQuip a four, now the blunts go back around like merry-go\nUh, for sure, ain't no need for niggas out here fronting doe\nMetaphor, how I come up with it? I don't fucking know\nY'all acting like that TDE don't run LA\nCoast ain't been this hard since Pac, Death Row and Dr. Dre\nWord to Dr. Dre, Detox is like a mix away\nSo go ahead and let the grown-ups work\nAnd go somewhere and play\nWorldwide Holocaust, cuh we murder shit\nWithout a gun or knife, it's just a fucking hit\nPussy drips, raining in her cervix, I'm a fucking pimp\nSagging low, crack a nigga bitch just like pistachio\n\n[Hook]\nI'm shining hard, they be like, \"There he go!\"\nNo bodyguard, they be like, \"There he go!\"\nUp in your broad, they be like, \"There he go!\"\nHey be like, \"There he go! Schoolboy, there he go!\"\nHiiiPower, bitch, they be like, \"There he go!\"\nBlack Hippy shit, they be like, \"There he go!\"\nMagnificent, they be like, \"There he go!\"\nThey be like, \"There he go! Schoolboy, there he go!\"\n\n[Outro]\nYeah, Q!", "image": "https://images.genius.com/41740fc8a4f359c7d4a16721d87de950.1000x1000x1.jpg"}], "artist": "ScHoolboy Q"}