{"songs": [{"title": "Trouble Seeker", "album": "Rise Up", "year": "2010-04-20", "lyrics": "[Verse 1: B-Real]\nI'm on a rampage! Rippin' up the damn stage\nWartime fate Dealer, some say renegade\nPart-time psycho! - Sippin' on lemonade\nDon't want trouble but I'll give it to you anyway\nYes, I'm insane! Put you in pain\nMy mind has been trained to live in the fastlane!\nShould I slow down? - Fuckin' speed up!\nYou better take a hit from my weed you need some! [3 seconds guitar solo by Daron Malakian]\n\n[Bridge: B-Real]\nGo hard, go hard! Live hard, die hard! [3 seconds guitar solo by Daron Malakian]\nRape one, cap one, fake one, slap one! [3 seconds guitar solo by Daron Malakian]\nBreak one, jack one, save one, get one! [3 seconds guitar solo by Daron Malakian]\n\"Rise up\"! \"Rise Up\"! Take me higher!\n\n[Hook 1: B-Real \" (Sen Dog)]\nGot my hands on the wheel\nAnd I'm never lookin' back in my rearview mirror!\n(I'm A TROUBLE SEEKER! - BUCK, BUCK! - I'm A TROUBLE SEEKER!)\nCan't eat or sleep I need some\nMedical attention, I'm a trouble seeker!\nI'm a trouble seeker! - I'm a trouble seeker!\nI'm a trouble seeker! - I'm a trouble seeker!\n\n[Verse 2: Sen Dog]\nBlowin' the chop', but I'm midnight stalker\nThe graveyard walker and I don't like coppers!\nThe mic linebacker - Elvis comin' at cha! (ELVIS COMIN' AT CHA!)\nMiddle of the pig, wanna pay off disaster!\nHide ya from Cypress! - All around hypin'!\nSongs like these keep bringing up my prices. (BRINGIN' UP MY PRICES!)\nDog in the food in Bob Marley hold out\nBalls to the wall on a date with a student!\n\n[Bridge]\n\n[Hook 2: B-Real + (Sen Dog)]\nGot my hands on the wheel\nAnd I'm never lookin' back in my rearview mirror!\n(I'm a trouble seeker! - BUCK, BUCK! - I'm a trouble seeker!)\nI don't care about them\nAnd if you see me comin' actions are clear!\n(I'm A TROUBLE SEEKER! - BUCK, BUCK! - I'm A TROUBLE SEEKER!)\n\nThey say I'm crazy, lately\nI'm off the chains, don't touch me baby!\n(I'm A TROUBLE SEEKER! - BUCK, BUCK! - I'm A TROUBLE SEEKER!)\nCan't eat or sleep, I need some\nMedical attention I'm a trouble seeker!\nI'm a trouble seeker! (trouble...) - I'm a trouble seeker! (trouble...)\nI'm a trouble seeker! (trouble...) - I'm a trouble seeker! (trouble...)\n\n[Verse 3:]\n[B-Real:]\nIs that so? Listen in your headphones!\nCarvin' up your headstone, guessin' you was dead wrong!\nSo up the heatwave! Betta learn to behave!\nThese days we pass weed. - Like a relay!\n[Sen Dog:]\nSorta like a hand off, then you really handle\nIt; you puff up a hit, then you're lit like a candle!\nWe lead by example! - You know that we are showin' proof\nGonna beat them whose are over you beat down overdue!\n[B-Real:]\nBeat down owerdue. - Had to learn the hard way!\nHomie started flippin' and we left them in the hallway!\nGonna puff all day! - Shut 'em down late night!\nMotherfuckers wanna play! - What you got stage fright?\n\n[Hook 2]", "image": "https://images.genius.com/f469b84836527dfec52206e182dfacce.220x220x1.jpg"}], "artist": "Cypress Hill"}