{"songs": [{"title": "Come And Get Me", "album": "The Last Kiss", "year": "2009-04-07", "lyrics": "[Produced by Neenyo]\n\n[Verse 1: Sheek Louch]\nGeah, make a move y'all\nWhich part you wan' lose?\nThe clip is loaded, the quatro is on cruise\nI'm back to work bitch, the clock off snooze\nI'm tougher than leather nigga I cannot bruise\nWho wanna try a nigga?\nHard to the God, come and butterfly a nigga (hold that!)\nOoze on out (uh-huh)\nWeeks later bitch go and throw your shoes on out\nI'm that shit that great Mario Puzo 'bout\nClear this out, blood on the hopscotch floor\nShells in the sandbox; niggas with big Glocks\nLate night, movin that junk, like Redd Foxx\nNow, you don't want nothin about me (nah)\nYou pussy, nigga come fuck with the alkie\nWeed smokin, keep the cancer piece on it (yeah!)\nCall hoes, get pussy whenever I want it (c'mere bitch)\nMack daddy (no) pimp daddy (no)\nHammer cocked (yeah) let that, go\nI ain't heard shit in a long long time\nTo even fuck around with either one of my rhymes (Sheek Louch!)\nNiggas still livin off the petty-ass crimes\nThe Hossa{​?}​ hater, Lacoste gator\nLevi's, hundred to the Mr. Chow waiter\nWhattup street niggas? Hold heat niggas\nFUCK sweet niggas, you'll get beat niggas (yeah!)\n\n[Hook: S.I.]\nNow who out there wanna fuck around with me?\nYou can come and get a fresh buck-50\nWe got guns, money, liquor, drugs\nWe right here until they come get me (I'm talkin 'bout murder)\nNow who out there wanna fuck around with me?\nYou can come and get a fresh buck-50\nWe got guns, money, liquor, drugs\nWe right here until they come get me\n\n[Verse 2: Jadakiss]\nC'mon, yeah.. ah-HAH! Nobody\nC'mon, yeah, c'mon, yeah, c'mon, yeah, yeah, uhh, yo\nYo listen here, you ain't dead if your heart ain't stop\nTwin 40's, you ain't gotta ask \"Are they cocked?\"\nI'm so sharp I could come through and scar they block\nLate night, red linin in an R8 drop\n- And I'm only tuckin them until I shoot ya\nWhen I pull 'em out that's when I'm fuckin with your future\nYou gon' realize this is nothin that you're used to\nGet your life tooken by a booster, then we gon' hang the noose up\n- It's all over with (yeah)\n- All they found was his Louis scarf with his DNA all over it (mm)\n- Who's choosin and pickin them (who?)\nCause I'm sick of them, not followin the curriculum (yeah)\nIt's my shit and I'm evictin them (get out)\nWhoever feel like they ain't gotta leave - I'm rippin them\nEven though the love's frail the thug's real\nAll you gotta do is just follow the blood trail\nMuch harder fightin when the battle is uphill\n- Whatever the knife can't handle the slug will\nKeep a good lawyer that's smart work on cases\nStill gotta run from the NARCs, they gon' chase us (run)\nIn case I gotta put some artwork on faces\nIf we leave the game for God they gon' +Mase+ us\nMy suggestion, is that you don't even test son\nUnless you wanna catch a fresh one\n\n[Hook: S.I.]\nNow who out there wanna fuck around with me?\nYou can come and get a fresh buck-50\nWe got guns, money, liquor, drugs\nWe right here until they come get me (I'm talkin 'bout murder)\nNow who out there wanna fuck around with me?\nYou can come and get a fresh buck-50\nWe got guns, money, liquor, drugs\nWe right here until they come get me\n\n[Outro: Sheek Louch]\nYeah, yeah, yeah!\nLet's go", "image": "https://images.genius.com/889156c9fce6e4ea8b79e5e476d47cb1.953x953x1.jpg"}], "artist": "Jadakiss"}