{"songs": [{"title": "One Mic (Remix)", "album": "From Illmatic to Stillmatic: The Remixes", "year": "2002-06-04", "lyrics": "{*speaking softly, gradually getting louder*}\n\nTurn my headphones up, it's pure\nNuttin' gonna stop me now, Stillmatic\nTye Fyfe remix, you know?\n(I'm here now, we here, it's your world)\nIll Will y'all\n\nYo, all I need is one mic, one beat, one stage\nOne person front, my face on the front page\nOnly if I had one love, one girl and one crib\nOne God to show me how to do things his son did\nPure, like a cup of virgin blood; mixed with\n151, one sip'll probably make me flip\nSee my name in the hieroglyphs, like Osiris and Isis\nParables written inside papyruses\nAckowledge it, we been all tricked time to come out of it\nSeeds watch us, grow up and try to follow us\nPolice watch us {*siren*} roll up and try knockin' us\nOne knee I ducked, could it be my time is up\nBut my luck, I got up, the cop (shot) again\nBus stop, glass bursts, a fiend drops his Heineken\nRichochetin' between the spots that I'm hidin' in\nBlackin' out as I duck back, forget gettin' hit! {*more sirens*}\nThis is my hood I'mma rep, to the death of it\n'til everybody come home, little brothers is grown\nHoodrats, don't abortion your womb, we need more warriors soon\nSent from the star sun and the moon\nIn this life of police chases street sweepers and coppers\nStick-up kids with no conscience, leavin' victims with doctors\nIF YOU REALLY THINK YOU READY TO FLY, WITH MIND POWER\nTHIS IS WHAT NAS IS 'BOUT, BROTHERS THE TIME IS NOW!\n\n{*whispering again*}\nYo, all I need is one mic..\nAll I need is one mic.. that's all I need\nAll I need is one mic.. all I need\nAll I need is one mic.. yeah\n\n{*gradually getting louder*}\nAll I need is one cup, one page, and one pen\nOne prayer - tell God forgive me for one sin\nMatter fact maybe more than one\nLook back at all the hatred against me, touch alla them\nJesus died at age 33, there's thirty-three (shots)\nFrom twin (Glocks) there's sixteen a piece, that's thirty-two\nWhich means, one of my dunns was holdin 17\nTwenty-seven hit your crew, six went into you\nEverybody gotta die sometime; hope your funeral\nNever get caught up, pain'll go through the innocent\nNothin' is fair, brothers roll up, (shootin') from wheelchairs\nMy heart is racin', tastin' revenge in the air\nI let this all slide for too many years, too many times\nNow I'm strapped with a couple of (macs), too many (nines)\nIf y'all people really wit me get busy load up the (semis)\nDo more than just hold it explode the (clip) until you empty\nThere's nothin' in our way - they bust, we bust, they rush, we rush\n(Lead) flyin', feel it? I feel it in my gut\nTHAT WE TAKE THESE DUDES TO WAR, LIE 'EM DOWN\nCAUSE WE STRONGER NOW MY PEOPLES THE TIME IS NOW!!\n\n{*whispering again*}\nAll I need is one mic.. that's all I need, that's all I need\nAll I need is one mic.. there's nuttin' else in the world\nAll I need is one mic.. that's all a (nigga) need to do his thing y'know\nAll I need is one mic..\n\n{*starting loud this time, getting quieter*}\nALL I NEED IS ONE LIFE, ONE TRY, ONE BREATH I'm ONE MAN\nWHAT I STAND FOR SPEAKS FOR ITSELF, THEY DON'T UNDERSTAND\nOr wanna see me on top, too egotistical\nTalkin all that slick stuff, while my name is biblical\nWonder what my secrets is, enemies'll move on you\nOnly if they know, what your weakness is I have none\nToo late I'm mad young I'm laughin' cause I'm a cool brother\nThought I wouldn't have that ass done? Fooled you brothers\nWhat you call a infinite brawl, eternal souls clashin'\nWar gets deep, some beef is everlastin'\nComplete with thick scars, brothers knifin' each other\nUp in prison yards, drama, where does it start?\nYou know the block was ill as a youngster\nEvery night it was like a, (cop) would get killed body found in the dumpster\nFor real a hustler, purchased my Range, people throwin dirt on my name\nJealous cause fiends got they work and complain\nWomen left me cause they thought I was finished\nShoulda knew she wasn't true she came to me when her man caught a sentence\nDiamonds are blindin', I never make the same mistakes\nMovin' with a change of pace, lighter load, see now the king is straight\nSwellin' my melon cause none of these brothers real\nHeard they were, tellin' police, how can a kingpin squeal?\nThis is crazy, I'm on the right track I'm finally found\nYou need some soul searchin', the time is now\n\nAll I need is one mic.. yeah, yeah yeah yeah\nAll I need is one mic.. that's all I ever needed in this world, (fuck) cash\nAll I need is one mic.. (fuck) the cars, the jewelry\nAll I need is one mic.. to spread my voice to the whole world", "image": "https://images.genius.com/1ab51dbafd9e2abb1817cfbf10dd00a5.1000x1000x1.jpg"}], "artist": "Nas"}