{"songs": [{"title": "Short Dog’s in the House", "album": "Short Dog’s in the House", "year": "1990-09-11", "lyrics": "\"Moving up!\" \"East Oakland, yeah that's right\" (Repeat 4x)\n\nOakland, California, West Coast life\nYou either play the game or you smoke the pipe\nI became a rapper at the age 14\nNo gold ropes, no diamond rings\nBut look at me now, 10 years later\nAsk any MC if I rap greater\nSee I'm known in Fresno, even the big O\nFrom San Diego to Sacramento\nThey'll tell you yes, wherever you go\nAnd I bet my life won't one say no\nAin't nothing like a Too $hort fan\nI ain't tripping, you can play it again\nDon't fight the feeling, life is me\nI rock shows in Nashville, Tennessee\nIt wasn't \"Hee Haw,\" so don't laugh\nAt the good ol' boys getting autographs\nIn Cinncinatti, I know you heard\nI got fined for the \"Cusswords\"\nIt's true, baby, so so unique\nMight slap your man, or just thump your freak\nI come to your town, I'm not under\nI want your name and your telephone number\nYou think I'm faking, but I'll call\nWe only got one night to do it all\nI know baby it's such a pity\nTomorrow night, we hit another city\nCold macking in the game is all we do\nMe and the boys called \"The Dangerous Crew\"\nI used to be local til I signed with Jive\nToo $hort then went nationwide\nI went to Georgia with the Too $hort sound\nI went down like Bobby Brown\nI said a rap and they took me to jail\nPulled out my bank, and made bail\nThis is my story, it could not wait\nIt all started out in the Golden State\nCalifornia, where I was born and raised\nI used to play the drum in my younger days\nI just hit that beat any way I can\nSmooth high-stepping in the marching band\nI turned in my drum and I started to rap\nNow beats I make, make my bank so fat\nIt's Too $hort, on the mic tonight\nPennsylvania, can you see the light?\nFrom Chicago, to Indiana\nFrom Mississippi, to Alabama\nLouisiana, even Texas\nFemales, call me sexist\nBut don't they love it, you know me\nFreak nasty in a room trying to blow me\nLike engine, engine, number nine\nHomies run a train, standing in line\nIf that train jumps off the track\nThen my brother you will catch the clap\nFrom Colorado, to Arizona\nAll the way back home to California\nIn Chattanooga, they know the tip\nShort Dog in the house, I'm that flip\nGetting clip, or playing pool\nI can't help it I'm so damn cool\nCall me \"Dog\" or leave me alone\nI'm riding in a Cadillac Fleetwood Chrome\nWith Too Clean, behind the wheel\nI'm riding shotgun, rapping for real\nTotal boss in the back, give me superside\nThey like to roll 'em fat cause you know we ride\nTo the beat y'all, and it don't stop\nIt goes on cause I don't stop rapping\nNow you know, nothing but the Dog in me\nYou make love to me and I still act stingy\nOh should I pay you? You must be tripping\nI didn't buy you and I sure ain't renting\nI said \"I love you\" cause you gave me head\nI didn't love you when we got out the bed\nIf I could love you, you know I would\nBut what you giving, ain't all that good\nA little southern hospitality\nYou'd better try to get away from me\nI love money, and I just can't fake it\nI go to Magic City and the girls dance naked\nI'm somewhat of a hero by the way I rap\nBut I'm living like an Oaktown mack\nI'm in the house y'all, I'm like ?peeser? y'all\nRat heads get nothing but cheese, y'all\nOr get slapped, put up your dukes\nI kick you in your ass with my Nike boots\nSome rappers try to be just like Too $hort\nCan hang with the Dog, you'd better stay on the porch\nIn Minnesota, Virginia Beach\nWisconsin, I got freaks\nAtlanta, Little Rock\nLouisville, it don't stop\nKansas City, Missouri\nI rock the house in East St. Louis\nDetroit, it's like Oakland\nIt's a black thing, and I'm a black man\nTo all my brothers in the U.S.A\nToo $hort baby don't even play\nWoofers in the trunk, blasting the beat\nI cross the bridge and hit 3rd Street\nYears ago, I rocked that joint\nI say what's up to my homies from Hunter's Point\nWe go a long way back, it's always been like that\nIn the days that Short Dog was so young at the rap\nI'm in the house!\n\n\"Moving up!\" \"East Oakland, yeah that's right\" (Repeat 4x)", "image": "https://images.genius.com/354fed0b5f5b1d6e18186fae903238d6.930x927x1.jpg"}], "artist": "Too $hort"}