{"songs": [{"title": "Ghost Showers", "album": "Bulletproof Wallets", "year": "2001-11-13", "lyrics": "[Intro: Madame Majestic]\nWhen Ghost threw this rhyme at you\nHe made up his mind\nThat every little thing he does\nBe designed to entertain you (yeah)\nOoooh (yeah), his whole life through (that's right)\nHe's been walking through the rain (rain)\nUntil the day he rhyme for you (uh huh, uh huh)\nAnd the sun came pouring down (tell 'em girl)\n\n[Verse 1: Ghostface Killah]\nEy yo, my rolls be Liberace\nAnd my bedroom is off the hook all day, designed by Versace\nY'all just watch me, this is how I blow up\nRight when y'all finna leave the joint then I show up\nStar-spangled up and my chain got cuts\nMr. T looked, saw my shit and went nuts\nStarks stays in luck, truck\nThere's a new gangster in town and he's coming up!\nStaten Island's capo, hoes with most info\nCrown Royal bottles in the back, blowin' Indo\nFly shit like Curtis Mayfield and his intro\nThrow this in your whip, convent, your tints blow\nYo' I kick the ill rhymes like this\nY'all niggas really never wrote rhymes like this\nC'mon, stop frontin' at a time like this\nPretty Tone in the house, you better hide your bitch\n\n[Chorus: Madame Majestic]\nGhost Showers, just a sign of the power\nYou feel in you, oh baby\nGhost Showers, got you by the hour\nYou're dancing, too, oh baby\n\n[Verse 2: Ghostface Killah]\nBehind the wall action, barely spaghetti jewels\nMachetes for y'all, little Debbie say \"I bet he do\"\nBig bellies to big tellies, Jim Kelly's, we flip cellies\nIt's Lils, dusted out heavy in the big Chevy\n(Kick the ill rhyme) nah, nah, I said it before\nI keep the club moist, ladies throw they panties on the floor\nAction, Atlantic City lights, main attraction\nSlick talk, jiggy at the door, got the gat in\n\n[Hook: Madame Majestic & Ghostface Killah]\nYeah, c'mon\nOooh, you know that rhyme won't end\nWe 'bout to slow this down right about know and\nMakes your day worthwhile\nYou know, wait for the drop to come back in and all that and uh\nIt takes your day that's sad and blue\nC'mon baby girl, sing that, uh, c'mon, didn't y'all like that?\nOn a ride to far and move\nC'mon, didn't y'all like that? Yeah, say what, say what, say what\nOn that dark and troubled sea\nUh, ma', that's right now\nGhost showed you the light\nTell y'all, didn't I tell y'all, didn't I tell y'all, didn't I tell y'all?\nAnd now you're dancing so fast and so free\nUh huh, ey yo, hold on, I got you baby\nThey're leaving stormy skies behind\nCheck it, I run it back people, let's go, here we go now\n\n[Verse 3: Ghostface Killah]\nYo, who got the biggest burner?\nAsk the Terminator, Wes Snipes shit plus Ghost meets Vegas\nStage show magician, dip with with a bunch of candy\nI got a lot of babies, y'all ain't family\nIf y'all don't hear me, y'all don't feel me\nMy album is bulletproof, y'all can't kill me\nIn 2003 the lease is up\nWe on the block now, no need for y'all re'in up\nPop your seat up, chop the weed up, excuse me if I'm horny\nNo doubt, I might knock the beat up\nFlorence style, all up on the set freezed up\nAll player haters get Swiss cheesed up\nMotherfucker if you with me, throw your hands up\nLook, money at the bar, pick your man up\nMe and Reese Piece is like diamonds in the rough\nI need Viacom money, but rhymin' ain't enough\n\n[Chorus: Madame Majestic]\nGhost showers just a sign of the power\nYou feel in you, oh baby\nGhost showers got you by the hour\nYou're dancing, too, oh baby\n\n[Talking through the Chorus: Ghostface Killah]\nYo, Starks Enterprise, yeah, c'mon\nTheodore, yeah Theodore Unit, uh-huh\nYeah, that's right, you heard?\nParty motherfucking people, yeah\nIt's like that, straight up, nothin' but the top, bitch\nYeah, that's right, that's my shit\nThis shit make you wanna go...yo'\nFeel-Ghost, feel Ghost, feel Ghost, now flow it, now back\nHop, hop, hop, word\n\n[Singing a second Chorus over the first one: ?]\nWhere do we go, where do we go, where do we go, go now from here?\nGhost showers got you by the hour, holding you, taking you, blessing you\nAhhhh baby, the showers", "image": "https://images.genius.com/f4093661813b3ac25f7c044e4b1e305d.899x899x1.jpg"}], "artist": "Ghostface Killah"}