{"songs": [{"title": "8 Minutes to Sunrise", "album": "Music Inspired By the Motion Picture Wild Wild West ", "year": "1999-06-15", "lyrics": "[Common]\nYeah, yo, yo, yo-yo, yo, yo\nYo, a touch of jazz y'all, yeah, yeah\n?? y'all, yo they got us on the run, like\n\n[Jill Scott]\n8 minutes to sunrise\nOh baby now, what are we gonna do? (I don't know..)\nPressure is mountin\nOh baby now, how we gonna get through? (I, don't, know)\nCan't go left (uh-uh) can't go right (uh-uh)\nDon't know, how we made it through the night (c'mon c'mon c'mon)\n7 minutes to sunrise\nOh baby now, what are we gonna do? (Do it, do it..)\n\n[Common]\nIt was once said by Black Thought that things fall apart\nKnew I shouldn't have been messin with dude's girl from start\nBut I pimp from the heart, the art of it made it interestin\nPlus me and sister blend before we got intimate\nFriend or no friend, my man caught wind\nThis chick is payin me, it'll either cost me or cost him\nTold her she shoulda lost him (when?) a while ago\nCause dude'll drink a pile of Mo' and defile her yo\nI ain't here to start on this [nigga] for me to wreck his broad\nYou could tell what I thought of this [nigga]\nNickname was Smoke, don't know if that was cause of cigarettes\n(or what?) or guns he tote, he called shots on the deck\nSo I wasn't tryin to call his bluff, by his persona\nYou could see, he think he tough!\nIf that wasn't enough, old girl had his son\nThis is Wild like the West I'm like Jesse on the run, uhh\n\n[Jill Scott]\n6 minutes to sunrise\nOh baby now, what are we gonna do? (I don't know..)\nPressure is mountin\nOh baby now, how we gon' get through? (I, don't, know)\nCan't go left and (uh-uh) can't go right and (uh-uh)\nDon't know, how we made it through the night (yo, we got..)\n5 minutes to sunrise\nOh baby now, what are we gonna do? (Do it, do it..)\n\n[Common]\nI understand that time is runnin out, I'm thinkin of town-skippin\nGot a Chevy but the alternator be trippin\nI'm hittin rum straight, thinkin of a route to truncate\nThe streets is watchin, out is one way I put myself in his Nike's\nHis position is, \"Aight man, somebody bonin my lady\"\nProbably snap like Rod-man\nMy plan was to meet at this bar called the Tiki (when?)\n'round four, when she was comin she would beep me\nI sat deep in the corner, drinkin zombies, becomin one by now\nWonderin if my style would support her and her child\nOut the corner of my eye saw this stud I recognized (who?)\nOne of Smoke's guys, to stay out of sight I tried\nTold Jill Scott to meet we coulda picked a better spot\nOn some \"Nobody's Supposed to Be Here\" [shit] like Deborah Cox\nLooked at my watch, [shit] I don't even got a watch\nFelt for my Glock, damnit I don't even got a Glock, yo\n\n[Jill Scott]\n4 minutes to sunrise\nOh baby now, what are we gonna do? (I don't know..)\nPressure is mountin\nOh baby now, how we gon' get through? (I, don't, know)\nCan't go left and (uh-uh) can't go right and (uh-uh)\nDon't know, how we made it through the night (c'mon c'mon)\n3 minutes to sunrise\nOh baby now, what are we gonna do? (Do it, do it..)\n\n[Common]\nPressure puh-pressure what? The pressure's cookin\nIt ain't good lookin, like a black promoter I'm talkin bookin\nNot that I'm spooked of dude, I could whup him\nBut he was on the horn informin the rest of them hoodlums (aight)\nUsually I wouldn't fight over a woman, old girl had a sun-shine\nWas messed up, on Smoke's payroll was one-time\nMy pager went off, it read one line: \"Come get me\nFrom Halsted,\" I'm thinkin this is monkey bar [shit]\nWent to the phone quick, called her (what happened?) Her line was busy\nSituation number nine, got my mind dizzy\nWondered if this plan was designed to get me\nI've been drinkin too strong to be thinkin too long\nLike 40 goin North I'm doin 50, headed for the spot\nAskin God to be with me, and lately\nShe has been actin shifty -- (but what?)\nBut then it hit me (hit me) it hit me (hit me)\nIt hit me (hit me) it hit me\n\n[Jill Scott]\n2 minutes to sunrise\nOh baby now, what are we gonna do? (I don't know..)\nPressure is mountin\nOh baby now, how we gonna get through? (Yo -- I said I, don't, know)\nCan't go left and (uh-uh) can't go right and (nope)\nDon't know, how we made it through the night (yo, we got)\n1 minute to sunrise\nOh baby now, what are we gonna do? (one-one, one.. ha?)\n1 minute.. (we got, we got) one, one\n1 minute.. (ahh shit, we got) one, one\n1 minute.. (what we got girl?) one, one\n1 minute.. (baby, Com Sense on the run) now, now\n1 minute.. (Com Sense on the run) one..\n1 minute.. (just got on the run, just got on the run)\n(Com Sense on the run, Com Sense on the run)\n(just got on the run, just got on the run)\n(they got us on the run like.. they got us on the run)\n(they got us on the.. yo, they got us on the run)\n(uhh, yo, they got us on the run)\n(they got us on the.. yo, they got us on the run)\n(and we out..)", "image": "https://images.genius.com/67be58a5622b416a7f512d91c9ee314c.1000x979x1.jpg"}], "artist": "Common"}