{"songs": [{"title": "223's", "album": "Lil Glokk That Stole Khristmas", "year": "2018-12-19", "lyrics": "[Intro: YNW Melly]\nRocco did it again\nOh this bitch recordin'?\nThat's crazy, hah, yeah, slatt, you know, uh\nWhole lot of gang shit\nBaow, graow, baow, graow, blatt\nUh, slatt, slatt, hold up, uh, uh, slatt, uh\n\n[Verse 1: YNW Melly]\nBlood walk, baby, this the Blood walk, huh\nI don't use my hands, I let the blood talk, huh\n.223's and MACs'll make you blood walk\nI can make any nigga hit the Crip walk\nCrip walk, I'ma let my hip talk\nPulled a .40 with a dicky, gotta kill up y'all\nClick, ooh, ooh, ooh, ooh, ooh\nAnd the clip is see-through\n\n[Chorus: YNW Melly]\nWhat all do you want from me?\nAR's and them .223's\nFuckin' 'round with me, you see\nI'm hot, I'm 500 degrees\nHeard he caught a body\nBut that does not mean shit to me\nGot two on me, got two on me\nBlood Gang, yeah, SuWoop on me\n\n[Verse 2: YNW Melly]\nDetrimental\nMe and Glokk all on your instrumental\nI kill a nigga and it really wasn't coincidental\nStop all that flaggin' shit, you just be on that actin' shit\nNo, I ain't with no cappin' shit and I ain't on no rappin' shit\nNo lackin', bitch, you know it ain't no lackin', bitch\nI check into Blood, nigga, like, \"Ayy, man, what's brackin', bitch?\"\nI'm two floors up on you niggas\nI'm two floors up on you niggas, yeah\n\n[Chorus: YNW Melly]\nWhat all do you want from me?\nAR's and them .223's\nFuckin' 'round with me, you see\nI'm hot, I'm 500 degrees\nHeard he caught a body\nBut that does not mean shit to me\nGot two on me, got two on me\nBlood Gang, yeah, SuWoop on me\n\n[Verse 3: GlokkNine]\nI'm like blatt (Uh-huh), we don't never play, he get whacked, like\nTryna find his face, ain't no trace, ain't comin' back\nG-Nine, Mister Two-Glocks, just bought a MAC (Oh yeah)\nA MAC for your facelift, rearrange your cap (Come here)\nOne foot in the industry and one foot in the trap\nInvite that dope to my bloodline, I treat him like my strap\n'Cause 'bout me he'll take a nigga's feet off the map\nBig B's 'til I'm sleep, push a P, he get clapped\nTwo guns, that's the twin Glocks, I roger that part\nColder than a bitch 'cause the bitch froze at that\nLike apostrophe, Google forgot a comma in the back\nSay I'm worth 250K, we can bet a trey on that, nigga\n\n[Chorus: YNW Melly]\nWhat all do you want from me?\nAR's and them .223's\nFuckin' 'round with me, you see\nI'm hot, I'm 500 degrees\nHeard he caught a body\nBut that does not mean shit to me\nGot two on me, got two on me\nBlood Gang, yeah, SuWoop on me\n\n[Outro: GlokkNine]\nBig blatt like SuWoop, mmh, yeah\nWhat you want? What he want? Mmh, ayy, ayy\nBig sticks for a punk, yeah, mmh\nWhat he, uh, what he see? Yeah, uh, ayy, ayy\nBig blatts 'cause I bleed, yeah, mhm\nWhat he on, what he breathe? Yeah, ayy, ayy\nI'm pushin' P's, pushin' P's, yeah, yeah\nWhat it is and what it ain't, mmh, ayy, ayy\nLike a skunk, we leave him stank", "image": "https://images.genius.com/44793564fbbfd4f4d1878ce234783b9c.1000x1000x1.jpg"}], "artist": "9LOKKNINE"}