{"songs": [{"title": "Close my eyes", "album": null, "year": null, "lyrics": "Got me thinkin' 'bout better days\nHeyyy! Better days..\nGot me thinkin' 'bout better days\nMost of these niggas need bitches too\nBut you never hear that side of the story so\nWe wanna do shit like this...\n\nVerse-1\nSometimes its hard to wake up in the morning\nMind full of demons, I don't wanna hear them anymore\nGot me heartbroken,fine, so many babies screaming\nCause they seeing destruction before they a see human being\nSo they start smoking weed, we'll never get our day\nUntil we learn to pray, keep our families in shape\nCause they all broke. and why do ghetto birds die\nBefore we learn to fly, some bodies else's child caught in guns\nSmoking weed, can all make a change\nSo I'm told, but I haven't seen the change unfold\nI keep hoping please, if you prefer to breathe\nCommunities in need of people that will lead\nKeep your eyes open, I can only say I'll try\nUntil the day I die\nBaby please don't cry\nGot me thinkin' 'bout better day\n\nVerse-2 (Not sure about few words here)\nEternally thug nigga Hilfigure made by Tommy\nSo when I speak hope to reach my buddy mommy\nOh come to poppy\nI love it when you sweat and sloppy more peeps\nUntil I come to wake no one can stop me\nMy bump and grind\nComing through ya every time\nCome get a blast of this through passion\nIt'll blow your mind\nHey throw up your legs\nWrap your shit around my back\nIt's a west side bang fucking hoes around the map\n? get down with 2Pac while I'm ? out ?\nWhile they seduce my jimmy I'll\nBe screaming give me body\nMake then hoes scream my name out\nGive me my prides and don't cha\nLove out these thugs nigga ?\nI'm at the freaking parade\nI'm watching caramel bitches play\nGet with real niggas bullshitting never get your pay\nThis is the dream of a young black teen\nI think hoes cross-country like a greedy crack fiend\nNow come on!\n\nVerse-3\nThough half our problems can be based on economical greed\nAnd dying breed, addicted to weed\nThey're getting Gs\nWith my heart open, greed, brings only misery\nA way to tragedy, so I stay sucker free\nOnly a few chosen, rise (rise)\nMy ghetto queen, rise (rise)\nDon't be afraid to try (try)\nToo many of us died for the door to open wide\nMy brother be wise, stay focused on the prize\nThough everybody dies\nWe continue growing...\n\nGot me thinkin' 'bout better days\nHeyyy! Better days..", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}