{"songs": [{"title": "Comin’ Agg", "album": "The World is Yours", "year": "1993-08-17", "lyrics": "[VERSE 1]\nAh shit.. I'm sick of niggas jumpin up with choppers\nRunnin for your shit, tryin to make another nigga stop ya\nBut it's on cause you up against a real nigga\nI steal niggas and kill niggas, I'm the real nigga\nYou up against a motherfucker with a quick temper\nI'm a born killer, in case you don't remember\nI got my pistol but I got a different clip in it\nClick-click, motherfuckers, can you get with it?\nYou ain't the nigga that you thought you was, fool\nAnd now I'm after that ass on the cool\nIt's all about survival of the fittest\nNigga, you shouldn'ta did this\nAnd now I gots to handle my business\nI got to get your ass up out the picture\nI ain't the nigga you wanna fuck with\nMotherfucker, I wouldn't bullshit ya\nNow look at what you stuck with\nThe last nigga in this motherfuckin world you shoulda fucked with\nI'm leavin niggas in bodybags\nYou shouldn'ta fucked with the Brad\nYou punk motherfucker, I'm comin agg\n\n[VERSE 2]\nMr., Mr. Scarface for the nine-trey\nNiggas packin nines, fuck you, bitch, I pack an A.K\nFully automatic for you hoes who wanna jack this\nS.A. fool, and I'mma put you on your back, bitch\nAin't no half-steppin, I'm comin at you rough-like\nShootin to kill cause back in school I had enough fights\nTo never wanna put my knuckles up against a nigga's head\nSo you can sling 'em all you want, but motherfucker I be slingin lead\nCause like I said befo' I'm a motherfuckin dreadlock\nPuttin fools in headlocks, givin niggas headshots\nAnd everybody in your motherfuckin area\nIs tryin to scrap up some money, so they can help to bury ya\nBut I can give a motherfuck about your family\nBecause your family ain't my fuckin family\nYou shoulda thought before you stepped to tha\nNigga in black standin right here next to ya\nI'm stoppin muthafuckers from breathin\nJust gimme a reason and I'mma be squeezin\nThe trigger of this motherfuckin Glock, pop-pop until you drop\nFrom these motherfuckin gunshots\nAnd leave your whole fuckin family sad\nDon't fuck with the Brad, motherfucker\nCause Brad's comin agg\n\n[VERSE 3]\nWhere the cocksuckers at, where the cocksuckers at?\n(Where they at? Where they at?) (There they go) at my gat\nCause I'm about to heat up like a vet\nChop shit down on your set and then jet\nAnd smash off in my soap box\nCause I'm down for the dirt and motherfuckas said it don't stop\nNow which one of you hoes wanna fuck\nMake your way to your truck\nI wanna see the way that you jump\nCause by the time you get your keys\nI'm lettin loose, motherfucker, lay em down, nigga, and get these\nIt ain't shit for me to watch em fly\nSo die, motherfuckers, die, motherfuckers, die, die\nI ain't no motherfuckin good guy, dog\nAnd I don't give a good guy damn about none of y'all\nI'm from the state of the motherfuckin gunslingers\nKnockin dicks in the dirt with just this one finger\nSo get your ass caught up in this gangsta shit\nAnd I'mma try my best to make it stank, you bitch\nPlus you comin with that fake drag\nYou fallin dead on your ass, you motherfucker\nI'm comin agg", "image": "https://images.genius.com/2c9d70007eb3a5b42d898b73f3ce76f0.936x936x1.jpg"}], "artist": "Scarface"}