{"songs": [{"title": "Shut Up Nancy - feat. Kokane", "album": null, "year": null, "lyrics": "[Verse 1:]\nShut up b! tch, you talk too much\nGetting on my nerves, you're so irritating\nUsing too many words and my ears can't take it\nAnd your voice is kinda loud too\nWhat else can that mouth do\nYou like cum? Tell her what it tastes like\nYou keep some on your tongue make you stay quiet\nWhat? Better not hate me\nCause you still gotta [?] still gotta penny\nWhat's my fee? I charge what you earn, you're so lucky\nYou get the cargo the sperm\nNow it's all in your sperm, got you acting crazy like you smoking sherm\nBut all I smoke is the kush\nYou need to shut your mouth b! tch, hush!\n\n[Hook: Kokane]\nShe talk to fucking much, she just don't wanna shut up, (Nancy)\nYou need to shut your mouth, cause you talk too fucking much, (Nancy)\nYou fucking all that stuff, b! tch don't pick it up (Nancy)\nI just can't be with you\nCause you run your mouth too much, can you feel me?\n\n[Verse 2:]\nYou know me, I'm always clowning\nBut now Nancy, that b! tch is always frowning\nAnd now, she don't even like to smile\nShe just makes me face and talks too loud\nShut up Nancy, you getting on my nerves\nToo many adjectives and not enough verbs\nEvery time you speak, all you do is babble\nWe ain't at the house playing scrabble, b! tch\nFuck you, and fuck your opinion\nCause I just fuck this big butt Dominican\nAnd hit that shit from a lot of angles\nShe ain't speak English, just body language\nSo we ain't have to say nothing\nJust stay up all night fucking\nNancy, you can never ever feel like us\nYou need to shut your mouth b! tch, hush!\n\n[Hook:]\nShe talk to fucking much, she just don't wanna shut up, (Nancy)\nYou need to shut your mouth, cause you talk too fucking much, (Nancy)\nYou fucking all that stuff, b! tch don't pick it up (Nancy)\nI just can't be with you\nCause you run your mouth too much, can you feel me?\n\n[Verse 3:]\nShut up Nancy, you're such a disgrace\nTalk shit to me, you get fucked in the face\nI don't care b! tch, tell them that\nMy name is Too $hort, who the fuck you yelling at?\nFuck with me, you being the silence of the lambs\nYour boyfriend left, you can't find another man\nYou're too upset to play with yourself\nSo you never have sex, remember how it felt?\nWhen you used to get kissed on those lips\nBut now all you do is talk shit\nYou need to wipe your mouth with some toilet paper\nTurn up the lights and drink [?]\nCause you already know what's up\nI'm trying to get you drunk and when you're throwing up\nJust spit out all them words and flush\nShut your mouth b! tch, hush!\n\nCan you feel me?\n\n[Hook:]\nShe talk to fucking much, she just don't wanna shut up, (Nancy)\nYou need to shut your mouth, cause you talk too fucking much, (Nancy)\nYou fucking all that stuff, b! tch don't pick it up (Nancy)\nI just can't be with you\nCause you run your mouth too much", "image": "https://images.genius.com/f7947ca6d18485b4713ba9c89b2980c7.800x800x1.jpg"}], "artist": "Too $hort"}