{"songs": [{"title": "Fast Cars", "album": "Birth of a Prince", "year": "2003-10-07", "lyrics": "[Intro: RZA]\nTrue mizza-Mast' on the triz-nack\nBob Digi back for a snack\nKinetic 9 in the biz-nack\nRaekwon got the triz-nap\n\n[Hook 2X: RZA & Erica Bryant]\nWe be ridin' fast cars\nWeed all in the glass jar\nChrome all on my crash bar\nGlocks all in my stash box\n\n[RZA]\nGats burst off, thugs take their shirts off\nFive niggas drop off, before I got the verse off\nPop go the Glock, wipe the fuckin' smirf off\nYour face, my bitch pulled up in a lime green and turquoise\nSL5, five AMG, while you shoppin' for a deal like it's A&P\nOn the paper chase, like blood, my thoughts circulate\nNo caffeine, but the submachine gun will percolate\nRikki Tikki Tavi, ya'll niggas Duck Daffy\nGet fucked like Daphne, stuck like the taxi\nDrivin' through the hill at night to the weedspot\nI got two hands but I'm known to carry three Glocks\nB-O-B-B-Y, niggas see I, only rock the Wu-Wear jeans, not the Levi\nUsed to break days smokin' coke and digi\n'Til I bulked up to the Incredible Hulk like Bill Bixby\nFace green, knuckles burst out like Wolverine\nShould I rip this bitch pussy or go pull a sting?\nFatal guillotine carrier, boy, ya'll niggas know me\nWrap niggas in sheets, fold 'em like the roll singing\nSick silky six syllable stanza\nSlap simple sadiddies swine sleazy Samantha\nShe blowin' up my horn, bitch ain't try'n to answer\nBobby Digital, Zodiac sign: Cancer\n\n[Hook 2X]\n\n[Ghostface Killah]\nYo... yo.. yo..\nYo this is P. Tone, 5 minutes from the Park Hills, Staten Isle\nI do bad, only when the Mack good to stay balanced\nYou shoot me? I shoot you, best bet's to finish me\nCuz if not, if I get the chance, I'mma doo-doo\nYour shit all over your hood, the clips go buckin' me good\nThe shells get stuck in the wood, Starks is a veteren (uh-huh)\nClarks, jewelry, bitches, jeans, darts is his medicine\nY'all can't build me, your technique's Ecederin\nLook, I will take my time in the bushes, right\nPaid up people no mind like I'm crooked, right\nShoot a nigga on down, do him somethin' right\nHe on the floor, tell his grams, \"yo I seen the light\"\nThe red car it just pulled off like Un Hall was drivin' the joint\nFaster than ya had ya the fifth smokin' lookin' moist\nI ain't know what to do so I told the boys\nI'm not a sucker look, y'all mothafuckin' made noise\n\n[Hook 2X]\n\n[Outro: RZA]\nIce Water exclusive, Bob Digi\nKinetic 9, Killa Beez\nStraight up, Raekwon the Chef\nBizza-bizza-O Di-di-Dirty Bas-stard\nGizza-gizza-ga-gizza-gizz-ga-Ghostface Killah, Killah, Killah\nThe GZA, The Genius\nMizza-mizza-mizza M-E-T-H-O-D Man\nStraight up, Masta Killa\nThe Inspectah Deck, U-G-O-D\nThe B-O-B-B-Y tck-tck-pssh", "image": "https://images.genius.com/0b55b2ec40b427a658f9839bb61bb1e8.600x600x1.png"}], "artist": "RZA"}