{"songs": [{"title": "Soulmate", "album": "The Divine Feminine", "year": "2016-09-16", "lyrics": "[Intro]\nYou feel like you're alone, Will? You have a soulmate? Somebody who challenges you. I'm talking about someone who opens up things for you—touches your soul. You can't give back to them, you know. You'll never have that kind of relationship in a world where you're always afraid to take the first step because all you see is every negative thing ten miles down the road. You can do anything you want, you are bound by nothing...\n\n[Verse 1]\nYeah, are you my soulmate?\nMy angel, what do you want with me?\nToo high, slow pace\nMy eyes closed, your body all I see\nI think you're too divine for my human mind\nWhen I'm with you, what do you do? Bring me to life\nNo matter what, one day everyone dies\nYou think you a God 'til you run out of time\nYeah, when you're gone, what will you leave behind?\nYeah, do I belong sometime soon, where goes my mind?\n\n[Hook]\nYou were the one to show me\nDivine love, love, love, love\nWhere was you when I was lonely\nMy divine love, love, love, love?\nWhen the stereo plays our songs, sounds so clear\nBaby, where'd you go? What's so wrong?\nI'm right here...\n\n[Verse 2]\nYeah, why do you stay on my case?\nI try to make you feel okay\nDo you know I'm in pain?\nI give you clues, you misconstrue\nYou continue to push me far away\nWhy don't you come on in?\nIt's like you forgot my face\nI just wanna taste of everything you're made of\nWe ain't (nothing)\nCut the strings, my balloon, watch me fly\nYeah, when are you coming through to free my mind?\nAre you happy with your life?\nCan I come and satisfy? Open up, let me inside\nWhen you take off all your clothes, I'm under your control\nRollin' up, you get me high\n\n[Hook]\nYou were the one to show me\nDivine love, love, love, love\nWhere was you when I was lonely\nMy divine love, love, love, love?\nWhen the stereo plays our songs, sounds so clear\nBaby, where'd you go? What's so wrong?\nI'm right here...", "image": "https://images.genius.com/b039f6866294506ae42378217870e464.375x375x1.jpg"}], "artist": "Mac Miller"}