{"songs": [{"title": "War (Birth Of A Nation)", "album": "The Birth of a Nation: The Inspired By Album", "year": "2016-09-29", "lyrics": "[Intro: Raye]\nOh yeah-yeah\nOh-na-na-na, uhm\n\n[Raye]\nConcrete bricks, bullet proof vests\nI'm proud of these walls that I built to defend\nAnd protect this bold heart\nThis bold heart\nBut the way you marched into my home\nNot few, big army\nWith the weapon on your arm\nYes, you struck straight with your cold heart\nYour cold heart\n\n[Verse 1: Nas]\nI'm like Nat, I'm like Nat\nI'm a man of God but where is Christ at?\nAnd even though my name is Nas I am like Nat\nIs this me declaring war? White flags\nI now know why I was even born\nTo strike back\nA full moon up in the sky, that's a sign that\nIt's time to get my liberation, the perfect configuration\nIt's the birth of a nation, midwife black\nMother father, caucasian\nMy blood Indian, native\nSo now I'm contemplating being like Nat\n'Bout to show you what I'm made of\nI'm what racists are afraid of\nNo mule and the 40 acres\nAnd despite that\nWatch out for the traitors\nWhen they say make America great again, do they mean make us all slaves again?\nDon't be sidetracked\n\n[Hook: Raye]\nIs this you declaring war?\nNo, we will never wave the white flag, the white flag\nSo you think I'm gonna run now?\nNo, the time has come to fight back, to fight back\nThis is me declaring war\nThis is me declaring war, war\nThis is me declaring war, war\n\n[Verse 2: Nas]\nDon't want to be a victim no more\nDepicted as a criminal, especially when you're poor\nWhy doesn't the government order capital punishment\nTo officers\nWho racial profile and put slugs in us\nMakes me think they want us extinct\nOn the brink of insanity\nWe screaming for justice, they sending tanks, the man in me\nDemand we protect the family, anarchy\nKu-Klux-Klan and him demanding he damage me\nSo my fantasy is every single one of us\nCome against the evil divide of people, it's common sense\nThe fury, I hope the whole world hear me\nNo justice, so I became a revolutionary\nNo matter if you're red, white, black\nIf you want freedom then we're all like Nat\n\n[Hook: Raye]\nIs this you declaring war?\nNo, we will never wave the white flag, the white flag\nSo you think I'm gonna run now?\nNo, the time has come to fight back, to fight back\nThis is me declaring war\nThis is me declaring war, war\nThis is me declaring war, war\n\n[Outro]\nDear America, it's time for a better America\nThere's a little Nat Turner in every one of us\nNo matter if you're red, white, black\nIf you want freedom then we're all like Nat\nWar, war (war), war, war\nDeclare war\nIt's time\nLet the spirit of Nat Turner live forever", "image": "https://images.genius.com/ca0953926fcfc4039b6de54033aee74d.763x763x1.jpg"}], "artist": "Nas"}