{"songs": [{"title": "2SEATER", "album": "Cherry Bomb", "year": "2015-04-13", "lyrics": "[Chorus]\nWe can speed in my 2 seater\nGirl I got a 2 seater\nSpeed in my 2 seater\nIn my 2 seater\n\n[Verse 1]\nAbout a hundred on Fax and it's easy to stop\nYou see my shit isn't stock\nI used to piss in a pot and now I piss on the walls\nSince I pissed off a cop, a couple tickets I have copped\nBut I can pay for them all\nAnd by the model of my vehicle you know that I ball\nE92, but '91 the year that Tyler was spawned\nAnd if I crash I'm owing wheels like I'm a Vaughn or a Vince\nTiptronic stick or automatic you pick\nShit is static as shit, sure my shit is a M\nMight get that X6 end, don't follow exit him\nMight take a back street hidden\nHouse got all sports cars like his garage is gym\nTwo sapphires on him neck next his precious gems\nNow AMG it's in boy I will eat him Benz\nNew engine, you got that old shit with those deep rims\nYou got a warranty don't care if you scratchin rims again\n\n[Chorus]\nWe can speed in my 2 seater\nGirl I got a 2 seater\nSpeed in my 2 seater\nIn my 2 seater\n\n[Bridge]\nSit in my passenger seat\nYou tell me I got too much speed\nAnd I should slow, I should slow down\nBut I can't, cause you driving me wild\nGirl I get a rush when we're speeding in my car\nAnd sometimes it's too much\nAnd you can feel the beat in my heart\nGirl I get a rush when we're speeding in my car\nAnd sometimes it's too much\n\n[Verse 2]\nI know some dudes that would find you that carry rugers\nAnd shottas, and fucking shoot at your Honda\nThen fucking zoom out in Mazdas\nThem GOLF boys is bad for you like the food from McDonalds\nBoy, I'm a king and I ain't lyin', boy, hakuna matata\nBetter watch for them hyenas if you flex then they swarm\nCashing so many checks they're calling him Tyler O-Comma\nI'm tryna ball like I was Domo O'Connor in '09\nProbably September...\nBoy I'm just rhyming these syllables, suck my genitals\nAlbum cover looking like the mascot of the timberwolves\nSkate park at Pemberton\nHoping that I ditched the chords and go pick up the pen again\nCause I kill the dark shit like I'm motherfucking Zimmerman\nTurn around and lose pounds like I'm fucking Timbaland\nBy pounds, I mean in (beep)\nGive it till he cop brick like a wall with pig in it\nAnd money coming out the blue\nLike cops are changing fits or shit I'm killin' it\n\n[Verse 3]\nBack when Left Brain had the hightop fade\nAnd we would go skate on them concrete waves\nAnd now I switch gears to hear the cylinders pump\nThe beat thump, don't get it twisted boy my board's in the trunk (Skate!)\n\n[Skit]\nCan you roll my window up?\nThe fuck you turn my music down for, man?\nCan you roll my window up?\nWhy? Damn!\nCause it's windy!\nBut I love it when your hair...\n\n[Verse 4]\nBlows, when it blows, when it blows\nWhen your hair blows\nHanging out the sunroof\nI love it when your hair blows\nWhen it blows, when it blows, when it blows\nHanging out the sunroof\nI love it when your hair blows\nWhen it blows, when it blows, when your hair blows\nHanging out the sunroof\nListening to Mac DeMarco\nHanging out the roof window\nSwitch to third gear turbo\nSkrting on these niggas\nSkrting on these bitches\nListening to Mac DeMarco\nHanging out the roof window\nSwitch to third gear turbo\nSkrting on these niggas\nSkrting on these bitches\n\n[Interlude]\nYou can say you don't want to take that drive\nBut your hair, it blows\nI know we'll have a good time\nYou just gotta stop being scared\nJust roll\nJust come and roll with me\nIt's all good\n\n[Skit]\nYeah, man, what's good man, you good? I've been chilling, man. I've been doing some push-ups and shit\nFor real?\n50 a day...Oh w-w-wait...is that that nigga Tyler?\nI think so\nBitch ass nigga, here he comes, man FUCK this nigga, man, this nigga stink... w-wait be quiet, be quiet\n'Ight\nMy nigga, T, man, what's good, man, you good? Alright, I see you!\nI'm good, man, I'm good, I'm good\nAy, man, I see you with your little girl sh-she looks...okay. Alright, ya'll good, man, alright! Ay, your feature don't start for another 20 minutes, so you can go get your shit up, I can go and get some shit... and I see you with your little jewels and shit too, man!\nAw thanks, man, I'm trying, man, I'm just trying\nYeah, let me know if you need anything...I got you...just...you know...yeah\nAlright um...yeah we'll probably walk around and come back when the movie starts whenever\nIght, man, I'mma see you\nIght, my nigga...ight\nErroll:\nFucking FAGGOT, man, I swear to GOD\nYeah\nThis nigga bitch weak too!\nYeah, she is\nGod dammit! I'd still fuck!", "image": "https://images.genius.com/bc37e364cd39806bba7469442454fc50.640x640x1.jpg"}], "artist": "Tyler, The Creator"}