{"songs": [{"title": "Tonight", "album": "Born Again", "year": "1999-12-07", "lyrics": "[Intro: Notorious B.I.G. (Puff Daddy)]\n(Yo, check this out, yeah motherfuckers)\n(Come on motherfuckers, B.I.G. motherfuckers)\nToo much smoke in here man\nOpen a fucking window\nWhat the fuck man\nYo yo yo yo yo\n\n[Verse 1: Notorious B.I.G.]\nI make your mouthpiece obese like Della Reese\nWhen I release, you lose teeth like Lil' Cease\nNigga please, blood floods your Dungarees\nAnd that's just the half of my warpath\nLaugh now, cry later, I rhyme greater\nThan the average player hater and spectators\nBuy my CD twice, they see me in the streets\nThey be like, \"Yo he nice, but that's on the low though\"\nBe the cats with no dough, tried to play me at my show\nI pull out fo'-fo's and go up in they clothes\nShort-change niggas, snort-'caine niggas\nExtortion came quicker, bought the Range, nigga\nYa still tickle me, I used to be as strong as Ripple be\n'Til Lil' Cease crippled me\nNow I play hard, like my girl's nipples be\nThe game sour like a pickle be, y'all know the rules\nMove from BK to New Jeruz; thinking 'bout\nAll the planes we flew, bitches we ran through\nNow the year's new, I lay my game flat\nI want my spot back--take two\nMotherfuckers mad 'cause I blew, niggas envious\nToo many niggas on my dick, shit strenuous\nWhen my men bust, you just move with such stamina\nSlugs missed ya; I ain't mad at 'cha\nBlood rushin', concussions ain't nothin'\nCatch cases, come out fronting, smoking something\nSippin' White Russians, bitch in the Benz bumpin'\nI laced it with the basic, six TV's a system\nKnocking Mase shit; face it, we hard to hit\nGuard your shit, 'fore I stick you for your re-up\nWipe the pee up, lick shots, woke your seed up\nGo in the ashtray, spark the weed up, long kiss\n\n[Hook: Joe Hooker]\nY'all can't see this\nThat this might be the night\nThis might be the night, that's right, that's right\nThis might be the night (Kiss your ass goodbye)\n\n[Verse 2: Havoc]\nNiggas playing they hands wrong, that's why they won't last long\nFinessed what I was dealt with from the day I was born\nWhile you bent up on that corner, niggas plotting and scheming\nUp in them little holes, be creeping with Mac demons\nNiggas know not to fuck with my dough\nNiggas know not to fuck with this little bro, I'm 10 seconds hit'n'go\nBlack mask, black truck, chrome rims, Chuk' Timbs\nEnough to confuse any witness\nStrongest of calibers, is what we only travel with\nYou gotta get hit, your man dead, so you got a hand in it\nExtort y'all, once friends, now we gotta cross y'all\nYou know the niggas with the biggest balls set the new laws\nAnd flip fours, have 'em washing drawers while you up North\nGat to your jugular, getting your salad tossed\nOverhearing niggas situations, singing like Lou Rawls\nSitting on the stand with no remorse\n\n[Hook: Joe Hooker]\nY'all can't see this\nThat this might be the night\nThis might be the night, that's right, that's right\nThis might be the night (Kiss your ass goodbye)\n\n[Verse 3: Prodigy]\nYo, yo, how we do niggas, I don't beef, I shoot niggas\nIf I can't get the main character, a few niggas then\nI don't need no gin to boost me\nI got enough steam to blow, somebody gotta go\nI got fire in my heart, guns in my car\nCash in my Carhartts, it ain't hard to get 'em\nLike blaow when I hit 'em, the nigga shit his drawers\nWhen the 40-pound hit him, the fuck these niggas thought?\nCould it be the fame, maybe it's the 2 Benz or\nWould it be the same if I couldn't claim those?\nFuckin' put holes through your Range Rove'\nCocksucker, beat it, while you bleedin' on the dashboard\nNiggas get, what they hand call for, I'm gettin' rich\nYou get deaded, I get erections over revenge, kid\nYou get a quiet spot in the shade for a grave\nI'll lay a nigga down and steam roll away...\n\n[Hook 2X: Joe Hooker]\nY'all can't see this\nThat this might be the night\nThis might be the night, that's right, that's right\nThis might be the night (Kiss your ass goodbye)\n\n[Outro: Puff Daddy]", "image": "https://images.genius.com/5fa56d7da6cf3fe54995d91d7120c735.500x500x1.jpg"}], "artist": "The Notorious B.I.G."}