{"songs": [{"title": "I’m Straight", "album": "King", "year": "2006-03-28", "lyrics": "[Intro]\nFury\nYeah, yeah, huh, aye! What the fuck I got to worry about now?\nNigga, you think after weatherin' the storm and comin' from the extremes I came from\nYou think I'mma come all this way to get scared? Hahah!\nNah, nigga, I'mma motherfuckin' win\nNigga, if all this shit go out the window right now, man\nI'm all too familiar with this shit\nMy nigga, I'm straight, you dig? Please believe that shit, man Hey!\n\n[Hook 1]\nYou can keep the car, the clothes, the money and the hoes\nJust gimme a couple of O's, drop me off at the sto'\nAnd I'm straight, hey, shawty, I'm straight\nHey, you can keep the dancers and the boppers, the plexers and the poppers\nLet me fill up my Impala, go and holla at my partners\nAnd I'm straight, hey, shawty, I'm straight\n\n[Verse 1]\nI gotta couple of V's wit' the kits, MPV's on my wrist\nA lot of glamour and glitz, but shawty I don't need it\nMy beginnin' was a humble one, a hustler I'm a son of one\nTaught me how to number run, I went from that to number one\nHad a hundred ones, I bought a slab, flipped another one\nSold my little three-eighty east, and said I need another gun\nThe littlest in the trap, and got it poppin' like some bubblegum\nJunkies hatin' on my stacks, sayin' I'm nuttin but a young\nBuck, niggas say, \"What?\", then he see me raise up\nJust wanna see the little boy wit' nuts change a old nigga whole face up\nCause I spray the nigga's whole face up, wet the nigga from the waist up\nThey'll try you once, 'til you pull a .40, then tell 'em shawty don't play wit' us\nI'm fourteen in the dope game and don't care 'bout catchin' no case, bruh\nDon't consider me, not statistically, another nigga it's too late for\nHey, wait, bruh, bet any nigga came from that?\nWho lose it all the day, I bet he say he changed from that\n\n[Hook 2]\nHey, you can keep the game and the fame, the haters and the lames\nJust gimme some cocaine, and somewhere I can slang\nAnd I'm straight, hey, shawty, I'm straight\nHey, you can keep the clones and the clowns, the throne and the crown\nWell-known in the town that I'm holdin' it down\nSo I'm straight, hey, shawty, I'm straight\n\n[Verse 2: B.G.]\nOkay now, now when I spit it, I spit it how I live it\nEvery verse I ever gave ya, it was fact, nothin' fiction\nI'm a livin' legend.. no stuntin', no reppin'\nYou can check my track record, I'm highly respected\nI'mma gangsta in the game, go ask Lil' Wayne\nAsk Judge Johnson, how many times he saw my face\nFor, \"pistol here, pistol there,\" \"violation here, violation there\"\nBetta ask Rank, I ran the jail when I was there\nI held it down, where-ever I go\nWhen I'm in the A wit' the King, or in Detroit in the snow\nI'm a pro, whether it's movin' snow or movin' 'dro\nThat's between me and you, I can get it for the low\nBut that's nothing, everybody say they got a story\nMine on \"Larry King,\" theirs is on \"Maury\"\nAt the end of the day, it seems to won't go away\nI guarantee the heart of the streets is straight\n\n[Hook 1]\nYou can keep the car, the clothes, the money and the hoes\nJust gimme a couple of O's, drop me off at the sto'\nAnd I'm straight, hey, shawty, I'm straight\nHey, you can keep the dancers and the boppers, the plexers and the poppers\nLet me fill up my Impala, go and holla at my partners\nAnd I'm straight, hey, shawty, I'm straight\n\n[Verse 3: Jeezy]\nSnowman bitch (bitch), I ride two-seaters (vroom!!)\nIt's a cold world, so I keep two heaters (geyeah!)\nI'm straight, you betta ask somebody (body)\nMatter fact nigga you can just ask me (me)\nA little over aggressive, yeah I just might be\nBut half the niggas in the hood just like me (damn!)\nYou wonder why a nigga talk eight balls all day?\nYou should try standin' around wit' eight balls all day (YEEEAAAHHH!!)\nSomebody pray for me, I don't know nothin' else (AYE!)\nWhy should I help you, when you ain't tryin' to help yourself\nI came in this game, fresh out the streets (yeah)\nWho you kiddin' nigga, I put my life on these beats (YEAH!)\nFuck bein' broke, this a reality check (check)\nWhile you mad at ya girl, ya betta check reality (AHAH!)\nGotta crawl 'fore you walk, you gotta think before you talk\nDamn right they gon' hate (geyeah!) but tell them niggas I'm straight (AHAH!)\n\n[Hook 2]\nHey, you can keep the game and the fame, the haters and the lames\nJust gimme some cocaine, and somewhere I can slang\nAnd I'm straight, hey, shawty, I'm straight\nHey, you can keep the clones and the clowns, the throne and the crown\nWell-known in the town that I'm holdin' it down\nSo I'm straight, hey, shawty, I'm straight\n\n[Outro: Pimp C]\nSay what it do? Young Pimp C know what I'm talking 'bout?\nYeah, nigga want me to speak on some \"king\" shit, know what I'm sayin'?\nOn the cool y'know.. young nigga T.I. jumped out there\nSaid he was the king of the south\nHe ruffled a whole lotta niggas' feathers\nBut niggas didn't really understand what the nigga was talking 'bout\nY'know.. and uh.. so everybody had it twisted but..\nMe I understood from the get go\nThat what the nigga was tryin' to put\nIn these motherfuckin' stupid ass niggas' faces!!\nWas the fact that it's a whole bunch of kings down here\nAnd as long as you takin' care of yo' business and doin' king shit you a king!\nWhat these niggas shoulda been tryin' to do was tryin' to get close to the nigga\nAnd get some understandin' about the type of game\nHe was tryin' to put in these motherfuckin' niggas' ear holes!\nUnderstand what I'm sayin'?\nSo I'm layin' back I'm watchin' the game from the sideline\nKnow what I'm talking 'bout?\nAnd I'm seein' all these ol' pussy ass niggas out here\nTalking 'bout they this and they that, but they really ain't doin' nothin!\nCause they motherfuckin' paper ain't right\nWhen I see them in the street, they diamonds fake! Know what I'm talking 'bout?\nThey shit ain't cut right, ya shit ain't right!\nShit cloudy and chipped up, know what I'm talking 'bout?\nAnd them niggas talking 'bout they \"trill niggas\"\nDon't even know what the motherfuckin' word mean!\nKnow what I'm talking 'bout? This comin' from the O.G. style trill\nKnow what I'm talking 'bout? Not these ol' fake ass niggas\nTryin' to come on the scene later on and tryin' to take glory for some shit\nSome other niggas paid dues for, know what I'm talking 'bout?\nSo this is what is.. we bringin' Georgia and Texas together\nAll you ol' BITCH ASS NIGGAS that ain't down wit' the play\nMove on to the side, all you old school rappers like 'Pac say\nYou niggas flabby, lookin' like Larry Holmes\nBACK YO' BITCH ASS UP!! And, and, and, and move around for the South\nCause it's our time to shine, know what I'm talking 'bout?\nNow let's do this shit!", "image": "https://images.genius.com/757a45da6a6e4106770d36a71b9d8b5b.300x300x1.jpg"}], "artist": "T.I."}