{"songs": [{"title": "What U Lookin’ 4", "album": "Muddy Waters", "year": "1996-12-10", "lyrics": "[Intro]\n1996\nKnocking on these punk-ass kiz-ods\nBringing it down the hill in the Jersey section\nIn the dark\nOh, in the dark\n\n[Redman]\nIt goes one for the mind and two for the money\nWho dat wit skull tattooes and his nose runny\nIt's me, that funky MC, the Rrr-ah E\nIndubitably, I'm Jersey down to my Timb tree\nOfficer, you're hawkin the, ninety-three Landcruise-\nWhen it's real criminals, you should be watchin' for\nGet off my dick for what you don't got\nPlus you probably never licked a shot from your Glock\nWalkin to my car witcha nine out the holster\nPut your hands on the steering wheel like ya s'posed ta\nI cooperate, don't give the redneck no hassle\nBecause too many mistakes be happening to black folk\n\n[Hook]\nWhat the fuck are you looking for?\nCan't a young man make money anymore?\nHah hah, leave ya butt naked...\n(In the dark)\nI said what the fuck are you looking for?\nCan't a young man make money anymore?\n(In the dark)\n\n[Redman]\nAyo stash that weed up while me and the cop is riffin'\nDamn I knew I shoulda got that stash box built-in\nBut it's alright 'cause me and my niggas roll tight\nWe all think alike, we jump out whoever packin pipe\nDon't they know who's the freak from the East?\nI get faded like Chong and Cheech without bleach\nAnd started spittin' game 'fore these cops start to reach\nOn these creeps, showin' mentality from the streets\nEven though we had a half a pound by the seats\nMy peeps never tweek, we handle shit when there's heat\nSince one cop was white the otha was a brotha\nI pulled out my tape and front page of the cover\nOf The Source, told him me and Janet's on tour\nBroke it down to who's my boss and who I rap for\nPlus them niggas, EPMD\nPut me D, now I'm runnin with the Green Eyed B-\nA-N-D-I-T, and Def Squad camp\nHere's your Def Jam tickets and your autograph\nNow haul ass, I got a meetin' 'bout seven\nBasically I'm saying bye bye like Guy\n\n[Hook]\nAyo what the fuck are you looking for?\nCan't a young man make money anymore?\nHah hah, leave ya butt naked...\n(In the dark)\nI said what the fuck are you looking for?\nCan't a young man make money anymore?\n(In the dark)\n\n[Redman]\nMy license, been suspended, for about five years\nThe system got my ass in the jam\nCan't even ride to see my fam in Alabam'\nI get petrified everytime I see the man throw the lights on (woop woop)\nThe mic's on so I stress it\nShit, I'm haulin ass before I start undressin'\nNiggas on they knees with they hands on the top of the-\nHeads while the Feds crack jokes with the Glock in ya\nDon't get me wrong I know a lot of cool cops\nThat'd let me go if I had two Glocks and oowops\nBut, I don't, so, I keeps it, real\nThe five hundred series with deep dish peels\nQuick, my bitch, stash, two clips, between two her tits\nBefore the cops fuck with the Rrr-ah\nI'm a nigga of today a nigga of tomorrow, beyotch!\n\n[Hook]\nI said, what the fuck are you looking for?\nCan't a young man make money anymore?\nHah hah, leave ya butt naked...\n(In the dark)\nI said what the fuck are you looking for?\nCan't a young man make money anymore?\n(In the dark)\n\nTo my people in Kentucky rock rock on word is bond\nNewark, New Jersey rock rock on word is bond\nAtlanta, Georgia rock rock on word is bond\nConnecticut rock rock on word is bond\nTo my people up in Queens rock rock on word is bond\nBri-donx in the house rock rock on word is bond\nVirginia's in this bitch rock rock on word is bond\nSan Francisco rock rock on word is bond\n\nYeah, bitch ass niggas rock this!", "image": "https://images.rapgenius.com/0a74fbde446eaf49e1da1f4daae6845a.1000x1000x1.jpg"}], "artist": "Redman"}