{"songs": [{"title": "Death Of A True Thug", "album": null, "year": null, "lyrics": "Cause they're bragging, telling the fuckers in jail yo, we just got pumped woo\nAnd that's why we don't do it, I know what I'm doing, imma destroy 'em\n\n[Verse 1]\nGot some static for some niggas on the other side of town\nLet my little cousin K roll, he's a rider now\nWhat they want from us motherfuckin thug niggas?\nUsed to love niggas now I plug niggas, and slug niggas\nAm I wrong? Niggas makin songs, tryin to get with us\nMust be gone on stress weed, in the West we trust\nTo the chest I BUST! Then we ride 'til the sun come\nShinin back to brighten up the sky, many die\nHeard the Fugees was tryin to do me - look bitch!\nI cut yo' face, this ain't no motherfuckin movie\nTHEN! We watch the other two die slow\nCastrated entertainin at my motherfuckin sideshow\nBAM! Set my plan in mo', time to exterminate my foes\nI can't stand you hoes, uhh\nNow label this my fuckin trick shot\nMy lyrics runnin all you cowards out of hip-hop\nWhen we RIDE\n\n[Hook]\nAnd if I die by a slug, the death of a true thug\nTell me will my niggas mourn me?\nThe death of a true thug\nAnd still, we try to change the past, in vain\nNever knowin if this game'll last, feelin ashamed\nAnd if I die by a slug, the death of a true thug\nTell me will my niggas mourn me?\nThe death of a true thug\nA man of military means in my artillery\nWatchin over me through every murder scene\n\n[Verse 2]\nCome take a journey through my mind's eye\nYou crossed the game, don't explain, nigga time to die, say goodbye\nWatch my eyes when I pull the trigger\nSo right before you die you bow before a bigga nigga, now dry yo' eyes\nYou was HEARTLESS on yo' hits\nNiggas love to scream peace after they start some shit - pay attention\nHere's a word to those that robbed me\nI murder you then I, run a train on Mobb Deep! Don't fuck with me\nNigga you're barely livin, don't you got sickle cell?\nSee me have a seizure on stage, you ain't feelin well, hell\nHow many niggas wanna be involved?\nSee I was only talkin to Biggie, but I'll kill allay'all, then ball\nThen tell Da Brat to keep her mouth closed\nFuck around and get tossed up, by the fuckin Outlawz\nBefore I leave, make sure everybody HEARD\nKnow I meant, EVERY MOTHERFUCKIN WORD\n\n[Hook]\nAnd if I die by a slug, the death of a true thug\nTell me will my niggas mourn me?\nThe death of a true thug\nAnd still, we try to change the past, in vain\nNever knowin if this game'll last, feelin ashamed\nAnd if I die by a slug, the death of a true thug\nTell me will my niggas mourn me?\nThe death of a true thug\nA man of military means in my artillery\nWatchin over me through every murder scene\n\nI really didn't believe until I got shot that no black person would shoot me\nI was their representative, they would never harm me\n\n[Hook] x2\nAnd if I die by a slug, the death of a true thug\nTell me will my niggas mourn me?\nThe death of a true thug\nAnd still, we try to change the past, in vain\nNever knowin if this game'll last, feelin ashamed\nAnd if I die by a slug, the death of a true thug\nTell me will my niggas mourn me?\nThe death of a true thug\nA man of military means in my artillery\nWatchin' over me through every murder scene", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}