{"songs": [{"title": "Bubblies", "album": "Gazing at the Moonlight", "year": "2009-10-27", "lyrics": "[Intro:]\nRecord Label Exec.:So? What can you do for our label Mr. Hopsin\nHopsin: Oh huh, well I got the bubblies\nRecord Label Exec.: The Bubblies?\nHopsin: Well, yeah\n\n[Verse 1]\nCheck it out\nYeah I'ma little out of it\nI don't even really understand what the problem is\nI think it's because I'm the man wit the hottest shit\nSatan offer going if I can I demolish it\nThen people noticing that's why my name bubblin'\nThey speak about Hop they like \"Nah, you can't fuck wit him\"\nYou ain't up wit him these niggas just ain't touchin' him\nYou want him out the game distract to straight bustle him\nI know it's necessary because I'm ahead of every\nUpcomin' MC and they don't wanna be secondary\nSo they sendin' these threat messages to me just to scare me\nThey see I'm very capable of being legendary\n\n[Hook]\nThere's something wrong wit me\nI'm feelin' kinda ill don't fuck wit me (Yeah)\nI think I might have the bubblies\n(I got the bubblies)\nOooh, Hes got the bubblies yeah\nBubblies (Yeah)\nYeah, bubblies (Yeah)\nYeah, bubblies (I got the bubblies)\nHe's got the bubblies\n\n[Verse 2]\nLike a fat man wit diarrhea problems\nWho been takin' way too many bites of peach cobler\nIf I get in the game yup I probably will rob em\n\"Hes takin' over the world we gotta freakin' stop him!\"\nListen up and listen good, only I can Stop me\nI'm not gone stop me til my damn dick is iced and rocky\n(Wow) And now you tryna defeat me, your styles sloppy\nThen again if I was in yo shoes I would not be\nProbably the same way, I'd run up on me and take fade\nThen lie to the cops wit a straight face\nThen right when you thinkin' that shit is just perfect\nHop would take it outta some rappers who didn't deserve it Just to make me feel better, send threatens and kill letters\nTo every rapper who I think is droppin' a ill record (Pow!)\nI'm comin' you dumb if you not runnin', I'm gunnin'\nOH! Whats up wit my stomach?\n\n[Hook:]\n\n[Bridge: 2x]\nExcuse me sir wheres the restroom?\nExcuse Me sir wheres the restroom?\nI have to use the restroom (Find the way, nigga!)\n\n[Verse 3:]\nEhh, MCs tryna roll on opponents\nJust to boost up they career when they old and Corroded\nI got plans don't be thinkin' that your flow will decode it\nIt's my spotlight and I ain't lettin' go of the moment\nAnd if you really feel you've had it, You want the mic so bad Well motha fucka I suggest you come and snatch it! (Aaah)\nEven if you did it wouldn't make a difference\n'Cause the people you tryna attract ain't listenin'\nThese bubbly wubblys suddenly buggin' me\nStomach be rumblin' mumblin' when I have to confront MCs\nIt troubles me but the honeys be lovin' me\nSome will be fiesty, but in the end I'ma feel on her double Ds\nI'ma have to end this dang song pretty soon\nAnd I ain't sayin' it just to be cool I really do\nFor real man, all my dang time is runnin' out\nOh too late, it's already comin' out!\n\n[Hook:]\n\n[Outro:]\nI've been waiting for this my whole life\nOh yes, the feelin' is so right\nYeah, yeah, bubblies\nHuh, hah, ooh thank God yeah\nBubblies, haha", "image": "https://images.genius.com/fb33e7a89a5050dc08095e21c220cc15.1000x1000x1.jpg"}], "artist": "Hopsin"}