{"songs": [{"title": "Charms Alarm", "album": "Can I Borrow a Dollar?", "year": "1992-10-06", "lyrics": "[Intro]\nWhat we have here is a very, serious delicate situation\nLots of people out here always ridin the dick, hmmph\nBut check this out\nI like your style, I like your stride\nAnd I like your motivation\nBut the Late Show, we ain't standin for that shit\nSo my man right here he wrote a little song about it\nWhy don't you sing it\n\n[Verse 1]\nRing the, alarm, here comes, the Com\nCall me Mr. Hollywood -- check it out!\nRing the, alarm, here comes, the Com\nCall me Mr. Hollywood\nOn the Goodship, Lollipop\nPop goes the lolli lolli, for I'm, the Jolly\nGood Fellow, he-llo? Is anybody there?\nI'm not a step, so don't stare\nBecause I Rock-well I always feel like, I always feel like\nSomebody's watchin me, ooh, somebody's watchin me\nIt's gotta be that, that that that nigga that sweat my shit\nI say say say, \"Black get off the 'zack you block my urinal tract\"\nI gotta go pee-pee, yo you don't know me\nYou're just a new kid on my jock, tip-seekin and you're phony\nIt's my little pony and you cannot get a ride\nSo when you see me homey, just please just step aside\nStep aside, not talkin wlidside, I'm comin from the Southside\nWhere the ruffnecks reign; if you can't stand it, don't go outside\nCause it's hot I got the stuff to call your bluff and pull your card\nAnd nowadays it's all these dick kids, that wanna be hard\nYou're fraudulent, I can tell a pussy by his scent\nSo sorry, but the van got tipped\nAnd out is how I'm lookin, I'm lookin out for my people\nI'm fly like I'm fly like but me don't have no eagle\nBeat the beater with the juice, how far would you go to\nYou're never gonna get it, woo-wooh-wooh-wooh!\nYou wasn't down from the jump, so why you wanna criss cross?\nYou no business buyin, insecure junkyard motherfucker\nGet lost, cause youse a sucker\n\n[Chorus]\nI'll be your lollipop\nI'll be your lollipop\nI'll be your lollipop\nYo can lick me everywhere\n\n[Verse 2]\nWe really lucky we got em, you can spot em\nFrom a distance, now let's just say for instance\nYou got a crank gettin ganked for his bank by some snake\nLittle wench -- is you is, or is you ain't\nThe sucker\nYou gotta gotta be, gotta be, to let the shit occur\nGettin pimped, by a ho, that ain't too proud to beg, for your dough\nShe get your money mo money mo money money mo!\nI couldn't go out like that if it was my first day off of punishment\nJust call me Kaopectate; in relationships, I'm runnin shit\nSo don't be comin to me with that, \"We can go out, you pay\"\nCancel that bitch, it's the, unamerican way\nThis is the circumcision, and skins is gettin cut off\nRidin on my shit, just to get they nut off\nNot, no cops, just low-downs want a lick\nIf you ain't down with the 'Van, dyke, get off the dick\nCause I remember the time, the time, the time you tried\nTo play me like I was booty but now you're just a groupie\nSweatin me uhh, sweatin me uhh\nTellin me when I get big don't be forgettin me uhh\nBut forget you, forgot you, after, I rock you\nIt's Blo Pop time bitch, you better set your clock\nTo the Charms Alarm\n\n[Chorus]\nI'll be your lollipop\nI'll be your lollipop\nI'll be your lollipop\nYo can lick me everywhere\n\n[Bridge]\nWhy'd the sucker MC sucker MC cross the road?\nTo get to the other side?!\nWhy'd the sucker MC sucker MC cross the road?\nTo get to the other side, now check it out\n\n[Verse 3]\nI got the pep in my step, the slide in my glide\nSo I won't trip, when I let my backbone slip\nSome shake it to the East, I'm shakin West, well I'mma shake your mid\nAnd I'mma get you suckaz, just give me one side, and one rib\nI barbeque the mouths, hey, I barbeque the mouths\nCause mom always said - don't play wack in the house!\nSo take that garbage to the backyard\nAnd I was like, \"Everybody wanna wanna rap hard\"\nBefore you wasn't hardcore, so Sonic why ya flipped?\nHow you gonna hop when you ain't hip?\nYou found rap, on a two-way street - and lost it\nOn a parkway, I ain't sayin no names, yo Rico Suave\nFuckin goons fakin stab wounds, I need to shank the crank\nElvis Presley Jr., tryin to be somethin that you ain't\nNo daps, y'all are hoes, y'all go on stage\nAnd take off all your clothes; then you strike a pose\nYou knows and I knows, that's how you sell your record\nBecause your shit is butt, you gotta get naked\nBut you're wack, you're wack, showin your body to me\nI said you're wack, you're wack, showin your body to me\nYou got no soul man, and you need to get a pound\nCause you, ain't, really down with true hip-hop you suckers", "image": "https://images.genius.com/e3b1b8cdac9f386a42441991d28a760b.624x624x1.jpg"}], "artist": "Common"}