{"songs": [{"title": "Look Thru My Eyes", "album": "It’s Dark and Hell is Hot", "year": "1998-05-19", "lyrics": "Judge not, less you be judged first\nMy nigga, my nigga\n\n[Hook]\nLook through my eyes, see what, see what I see\nDo as I do, be what I be\nWalk in my shoes and hurt your feet\nThen know why I do dirt in the street\n\n[Verse One: DMX]\nBurnin' in hell, but don't deserve to be\nGot niggas I don't even know that wanna murder me\nJust because they've heard of me, and they know that the Dark is for real\nThe bark is for real, (arf) when you see that spark it'll kill\nPeep how I park it and chill, take it over there, bark wit' it\nFrom Y.O. to Cali to Baltimore back to New York wit' it\nCome through flyin', up 1-2-9\nUp the School Street 'cause I come through mine\nBark at my dogs, \"Get at me, nigga!\"\n\"Arf! Arf! Arf! Get at me, nigga!\"\nWhat the deal is? Never forget what real is\nThem cats that used to say \"X is the best,\" know he still is\nCan't help but feel this, puttin' goosebumps on your arms\nTake you there if you want but I lose chumps with the bomb\nIt's the calm before the storm\nDr. Jekyll and Mr. Hyde and it's gettin' warm, feel me yo\n\n[Hook]\nLook through my eyes and see what I see\nDo as I do, be what I be\nWalk in my shoes and hurt your feet\nThen know why I do dirt in the street\nLook through my eyes and see what I see\nDo as I do, be what I be\nWalk in my shoes and hurt your feet\nThen know why I do dirt in the street\n\n[Verse 2]\nI can understand why y'all niggas is scared of me\nAnd why the big dogs never wanted to play fair with me\n'Cause I leave blood wherever I go, wherever I flow\nWherever I blow niggas who know I can go, feel me yo\nWhat is it about the Dark that gets niggas where they about to spark\nAbout to bark, take it to the heart 'cause it's real like that\nGive him chills, but do I make him feel like that\nShit is real, what you don't know is gon' get ya\nWith the steel, what you don't know is gon' split ya\nI can blaze tracks, make niggas play wax and raise stacks\nPayback's a bitch; didn't you used to say that?\nPlay around in dirt, you'll get mud\n'Cause you know, I can either spread love or shed blood\nAnd bloodshed turns the mud red and real sticky\nOr I can hit you from roof, make it a quicky\nFor real\n\n[Hook]\nLook through my eyes and see what I see\nDo as I do, be what I be\nWalk in my shoes and hurt your feet\nThen know why I do dirt in the street\nLook through my eyes and see what I see\nDo as I do, be what I be\nWalk in my shoes and hurt your feet\nThen know why I do dirt in the street\n\n[Verse 3]\nI bear my soul, niggas wouldn't dare, my role\nGives a nigga a heart of gold, but with a hole\nLost all control, my shoulders hold a lot of weight\nJust like first time sold an eighth, then told it's not an eighth\nBut then it's out of state, and it's too late for changes to be made\nThat's what I get for fuckin' with strangers in the shade\nThis is it, y'all niggas got to give me a plate\nFor the same reason that fate chose to give me the weight\nTake away hate, now I'm supposed to love the one that cursed me\nThe one that wouldn't give me a cup of water when I was thirsty\nIt was always him versus me, but now I gotta teach him\nPersonal feelin's put aside, 'cause now I gotta reach him\nWhat I'd like to do is turn my head, like I don't know him\nBut it seems like I've been called on to show him, so I'ma show him\nAnd if you never met me, then you've no right to judge me\nI've got a good heart but this heart can get ugly\n\n[Hook]\nLook through my eyes and see what I see\nDo as I do, be what I be\nWalk in my shoes and hurt your feet\nThen know why I do dirt in the street\nLook through my eyes and see what I see\nDo as I do, be what I be\nWalk in my shoes and hurt your feet\nThen know why I do dirt in the street\n\n[Outro]\nFeel the pain, feel the joy, of a man who was never a boy\nFor real\nArf arf, arf arf arf", "image": "https://images.genius.com/8314b41ccd0d9cc7825bc168024bdec2.630x630x1.jpg"}], "artist": "DMX"}