{"songs": [{"title": "I Own America (Part II)", "album": "The Art of Storytelling", "year": "1999-03-25", "lyrics": "[Verse 1: Slick Rick]\nAll of you cock pullers are frontin'\nWave your arms around like you're some octopus or somethin'\nTo better you, for any chick you want, I'm gettin' her\nRob people, mad ignorant, et cetera\nWho the one to entertain and fume with?\nWho you know breed humans can't be in the same room with?\nReefer sweet, wrap it up, free fix greet\nEvery rapper rap maggot underneath Rick's feet\nEvicted, why you tryin' to find shit to lick with?\nEven your kids tell you that you ain't shit to Slick Rick\nThough you pretend to be glory\nI'm number one, that's the end of the story\nThe black Clark Gable leave you numb\nEvery single one frontin' on your label is a bum\nLet me slow it down, that's enough of that\nThis I have to say to you nothing other rapper cats\n\n[Hook: Slick Rick] (x2)\nFrom New York to Cali none'll fuck with the awkward\nYou think Muhammad Ali used to talk shit\nBing, this sure hit alone'll bury ya\nAnd even I got deported, I own America\n\n[Verse 2: Slick Rick]\nHe's so crazy, I smash rippin' up the place\nGive the mack a taste, I wipe my ass with a rapper face\nCars come to a dead stop\nRain find ways not to drop on my head top\nTycoon rush at the richest\nEven my complexion is a must have to bitches\nEven without car money to budget\nI would have the most elegant apartment in the Projects\nKnow what I mean?\nBitches are in awe at the lingo\nKnow that Rick'll put an end to all rapper income\nAn old-timer, lock up all vagina fields\nFrance nor Italy can fuck with my designer skills\nSaltin' inferior, faultin' to where we are\nTryin to find fault in superior\nLet me slow it down, that's enough of that\nThis I have to say, to you nothing other rapper cats\n\n[Hook: Slick Rick] (x2)\n\n[Verse 3: Slick Rick]\nYou lack the taste hook I'm stickin' 'em with\nWhile degenerate like yourself make our race look ignorant\nAnd your girlfriend wanna kiss and deploy\n'Bout in the groin gets none of this tenderloin\nFeet planted on deep black firmament\nBow in the presence of who lead rap permanent\nLike a lion rap rips a chunk of kids\nYou stunk cause mortals ain't shit to conquer\nSomebody said new pharaohs have appeared\nHow when everything I wore ten years ago, you wear now\nI coulda murder heard a word out quick Rick stomp it kid\nHung to it, you complete bum to Rick\nSource Awards, yeah, Rick every seminar\nEven make Saddam Hussein tell me where the weapon are\nLet me slow it down, that's enough of that\nThis I have to say, to you nothing other rapper cats\n\n[Hook: Slick Rick] (x2)\n\n[Outro]\nYeah, from New York to Cali none'll fuck with the awkward\nYou think Muhammad Ali used to talk shit\nBing, biatch", "image": "https://images.genius.com/73539fff4e6ebc470e6cab73853f0ac6.1000x1000x1.jpg"}], "artist": "Slick Rick"}