{"songs": [{"title": "Where Do I Go", "album": null, "year": null, "lyrics": "[Hook]\nAnd somebody tell me, where do I go from now (x4)\n\n[Intro]\nI've been lost, you know?\nOh, you know? I didn't know... didn't know at all\n\n[Verse 1: Lupe Fiasco]\nI just wanted to use computers\nI made it to the finish line first, but Lu's a loser\nI wanted to watch so I turned to rocks\nLike Medusa, the block, the users\nThe rock, the shooters, the shots, the heckle of cops\nThe lugers, the Glocks, the cougars\nShould be with my Akhs, making Salat in the Ummah\nBut instead I'm on the block in this lot with the Kufi's\nAnd I'm feeling like a doofus, I think I understand the meaning of life\nAnd really ain't no reason for ice, still want it\nStill haunted by the demon, a price\nBut if u give it to me we'll flaunt it\nI think niggas is dead broke, and I can bring em to life, its funny how--\nNaw it really ain't funny sometimes I hate money\nPlease God take from me\n\n[Hook]\n\nAll my blessings, I take em as a lesson\nMake 'em into questions, and relate 'em to the present\nShould I take it as a present? A penalty?\nBut everything's from the man upstairs\nCould barely sing cuz the man upstairs is beating on the floor\nWhen the music stops will I have a chair?\nWill I be seated on the floor\nIt really don't matter cat beat me to the score\nI was speaking to this whore\nYou know I got trouble with women humble beginnings\nMumblin and tremblin now they smugglin and stealing\nStep ya game up check the dame what?\nI nutted on her fangs ain't nuthin to hang up\nThat really happened in fact but I ain't manufactured for that\nA bumpy ride had to fasten my straps\nI be tryna reach em, other niggas be lyin:\nDyin' to get behind and beat 'em\nI just be tryna teach 'em\n\n[Hook]\n\nI put it on paper, cuz they'll put you on for paper\nBut most of these niggas is paper\n10 1/2 by 8 blue lines 3 holes\nHit they ass wit 8's, flat lined, 3 holes\nCuz they'll gas u up like cold pacer\nAnd leave u in the cold without a coat with a cold\nThats not gangsta them niggas ain't ya boys man\nThem niggas is the poison gotta keep em under the sink\nRight next to the bleach I say that I'm on top of my game\nCuz if you under you sink\nI wonder if its just the hunger you think? imagine that til it haunts you\nThem niggas want you to fall, I fall cuz I want to\nYellow leaves and felonies that's how I fell on these\nGod made my head with mind in it\nThey made my bread with swine in it\nMade my bed and now im lyin in it\nI wonder if this is my limit\n\n[Hook]", "image": "https://images.genius.com/b67b7f5bfbd7eb8c5c334fa8b05a2432.400x400x1.jpg"}], "artist": "Lupe Fiasco"}