{"songs": [{"title": "50 Ways", "album": "King Mathers", "year": "2011-03-23", "lyrics": "[Verse 1: Eminem]\nYou probably gonna think that I'm talking\nAbout you and you goddamn right I am\nLook at you, this is the minimal I could diss you\nSubliminally, but I think criminal instinct\nHas pushed me to the brink, my pussy does it stink\nHe still loves me 'cause he puts me in his ink\nHe does, doesn't he, still is, isn't he?\nNah, I'm just playing tug of war with his heart 'cause he misses me\nI can still fuck him and leave him whenever I feel frisky\nAnd is no risk of disease 'cause he ain't with anyone is he?\nThis bitch really thinks she can get me\nIf she still wants me, driving across country\nStrapped up to the front seat, missing all her front teeth\nThinking to herself when's the next time he's gonna punch me?\nI told this cunt she's gonna overdo it once\nAnd once she does, she was stuffed up in a trunk\nCrunch, he scrunched her up in a ball\nBunched up nice and comfy\nFuck around get dumped up in a lake 'fore you dump me\nYou cunning little cunt, deceitful witch\nYou thought you had me, 'till my shrink told me this\n\n[Hook: Paul Simon]\nThe problem is all inside your head she said to me\nThe answer is easy if you take it logically\nI'd like to help you in your struggle to be free\nThere must be 50 ways to leave your lover\n\n[Verse 2: Eminem]\nI feel like a serial killer, I keep dumping bodies in the lake\nI'mma get caught and send up the river\nI shiver when I think of the company I keep\nHow do I know she ain't gonna kill me when I sleep\nI shriek, every time she hands me something to drink\nSex kept us together, when we slept together every-thing\nWas all better, she made me feel like a king\nSlowly she began lowering my self-esteem\nShe go to the club and not answer the phone when I call her\nAnd I just bought her a truck for 50,000 dollars\nAccused me of doing drugs and scream n' holla\nThen I find a bag of coke on her, some marijuana\nAnd all I know is every time I go\nTo them hiding spots, wherever she hides her blow\nThe little bags of dope, there was a pile of coke\nThat's growing smaller, and that was just a while ago\nAnd I wouldn't even let on like I know\nWhat was I supposed to do? Call her out on it, we just argue\nSay she put it there on purpose and flipped the whole script\nOoh she's a manipulative evil bitch\nA cunning little cunt, little deceitful witch\nShe thought she had me, 'till my shrink told me this\n\n[Hook: Paul Simon]\nThe problem is all inside your head she said to me\nThe answer is easy if you take it logically\nI'd like to help you in your struggle to be free\nThere must be 50 ways to leave your lover", "image": "https://images.genius.com/f8ad550517ec415ff9684ba9aff7c8dc.1000x1000x1.png"}], "artist": "Eminem"}