{"songs": [{"title": "It Won’t Be Long", "album": null, "year": "2010-08-17", "lyrics": "[Hook]\nUh, yeah\nI said it won’t be long (no)\n‘fore we out here baby\nGotta get you up out here baby\nSaid it won’t be long\n‘fore we out here baby\nWe up out here baby\n\n[J. Cole Verse 1]\nI say a prayer and look up in the sky\nThank God even though a nigga headed to this tired day job\nWill my eyes stay wide still I know I’m gonna blow\nThis is music for my niggas cause I know you want more\nCause that old shit fake but this new shit real\nJ. Cole not Jay but this that Blueprint feel\nHey Cole is you crazy that's some big boots to fill\nYeah straight out the Ville and the shoes fit well\nSeen heaven, seen hell, seen niggas get killed\nKnew every detail still never would tell\nScared of the repercussion, scared of them people bussin'\nBullets be hittin’ nigga’s you swear they could be percussion\nNiggas be holding triggers before they could read instructions\nOh God, never did our fathers teach us nothing\nNo law, but became a man on my own\nShowed my momma I could stand on my own\n\n[Hook]\n\n[J. Cole Verse 2]\nDear mama, your son hurting\nLiving in this cold World where niggas shun virgins\nAnd praise hoes\nAs days go by shawty 19 years old\nNo clothes for her baby yet she stay so fly\nTell me why mamma do you cry\nIs it cause you know my teacher be feeding me lies\nIs it cause you know that Preacher is greedy inside\nCause racism is alive I see the disguise\nMamma I know it hurts\nIt hurts me to watch you go to work barely hanging on\nSome rich man getting richer while you slaving for him\nSo whats the options for him\nA young nigga from the hood without a pops at home\nSurrounded by no good\nAnd soon no good becomes so good quick\nA little drug money got him feeling so hood rich\nKilling your hood with the same shit Ronald Reagon filled up your hood with\nAnd it’s still in your hood shit\nI’m feeling no good mamma\nI’m sick of my soul\nIs there a better life for us I just sit and I hope\nI just hope and I pray\nIt’ll change one day I’ll make a change one way\nAnd mamma I can fly you out this cold world\nThis cold life, it’s all wrong\nThere’s no right\nIts hard to see the good when there’s no light\nJust grab onto me, trust me hold tight!\n\n[Hook]\n[End]", "image": "https://images.genius.com/2cd936e786e1ab454043327d585c7702.1000x1000x1.jpg"}], "artist": "J. Cole"}