{"songs": [{"title": "Pimp On", "album": "Kamikaze", "year": "2004-01-27", "lyrics": "[Intro: Bishop Don Magic Juan]\nYeah.. no introduction is really needed\nBut it's, the Bishop Don Magic Juan\nChairman of the Board, of famous playas everywhere!\nPLAYAS, PLAYAS, PLAYAS!\nRepresentin, green is for the money\nGold is for the honey, ain't it man?\n\n[Interlude]\nPimp-pimp on, pimp-pimp on\nPimp-pimp on, pimp-pimp on!\nThen get your pimp on\n\n[Verse 1: Twista]\nPeep how the Twist' puttin' down the luchie while smokin' a lot of dro\nWhatchu know 'bout checkin' yo' paper for a down-ass bottom ho\nOr snatchin' yo' new fur model mink with the hood off the hanger\n24-karat rings standin' a half a foot off the finger\nCustom seats are amazin' tellin nobody could touch that bitch\nShoes my Maurie, piss by the month, he cut shock shit\nAnything from my hoes when I ask, I get it\nIn the Cadillac I kick it, since y'all I wanted to be like macks and Bishop\nType wanna get up in the club, drinkin' Cris'sy from a gold cup\nFlossin' my club, peepin' persons yellin' out \"Chuuuch!\"\nFinna attract to trick politicians I'mma maintain pimpin'\nYou can't change pimpin', from the Stone Age to the \"Space Age\" pimpin'\nFrom Southern mackin' in Memphis to the playa mo' when you shoot to Chi\nIn the black diamond with fuchsia dye pullin' out hoes like Supafly\nAll I gotta do is spit fo' lines\nNow she got me chameleon gators with colors that flip fo' times\nNow get yo'\n\n[Hook]\nPimp-pimp on (pimp on)\nPimp-pimp on (pimp on)\nPimp on (pimp on)\nPimp-pimp on, then get your pimp on\nPimp-pimp on\nAnd if you want it the 'Llac with three hoes in the back\nPimp-pimp on\nFeelin' like a mack while you checkin' yo' scratch (Pimp on)\nThen you gettin' yo' pimp on (Pimp-pimp on)\nThen get your pimp on\n\n[Verse 2: 8 Ball]\nUhh.. yeah.. yeah, yeah\nIt's the Fat Mac - 8Ball to most of y'all\nYou a ho need a pimp, I'm the one you supposed to call\nShit talker, somebody's daughter she my street walker\nShe call me daddy, she a ho so that's what I call her\nOr bitch or ol hard-head ass ho\nThe rougher I treat her she love a nigga even mo'\nBrush my hair, manicure and do my toes\nKnock bitches from them niggas who act like hoes\nI'm mink draggin' out my 2-2 Paddywagon\nSittin' on 2-3's, diamonds on 24 karats\nBall out a bitch ass, and I don't make deals\nPeel a meal from a pussy, know how that feels?\nHigh heels and furs, Lexus his and hers\nHpnotic, ex' and sex mixed with the words\nPull up, and let the window down, here she come\nThe American way, I was taught how to\n\n[Hook]\nPimp-pimp on (pimp on)\nPimp-pimp on (pimp on)\nPimp on (pimp on)\nPimp-pimp on, then get your pimp on\nPimp-pimp on\nAnd if you want it the 'Llac with three hoes in the back\nPimp-pimp on\nFeelin' like a mack while you checkin' yo' scratch (Pimp on)\nThen you gettin' yo' pimp on (Pimp-pimp on)\nThen get your pimp on\n\n[Verse 3: Too $hort]\nPlaya getcha pimpin' on\nGotta getcha game together man, all your women gone\nTo start all over, ain't nothin' to a mack\nJust put 'em to work, and watch yo' money stack\nThat's fosho doe, everyday a G a mo'\nAsked your little sister, \"Girl, why you wanna be a ho?\"\nShe got turned out, like Red Riding Hood\nGoin' to Grandma's house, now she lookin' real good\nWhile the Big Bad Wolf try'na eat her out\nPay up, the cash is what we be about\nSquares, we don't care if you don't understand\nPlayers break out the game power, you don't wanna go there\nSay it in your prayers you wanna be like me\nYou down on your knees but it's not likely\nTo ever happen, so I just keep rappin'\nThis real mackin', this ain't actin'\n\n[Hook]\nPimp-pimp on (pimp on)\nPimp-pimp on (pimp on)\nPimp on (pimp on)\nPimp-pimp on, then get your pimp on\nPimp-pimp on\nAnd if you want it the 'Llac with three hoes in the back\nPimp-pimp on\nFeelin' like a mack while you checkin' yo' scratch (Pimp on)\nThen you gettin' yo' pimp on (Pimp-pimp on)\nThen get your pimp on\n\n[Outro: Bishop Don Magic Juan]\nYeah, Bishop Don Magic Juan\nAin't no shame, in my game\nGood game, is happenin everyhere\n{*Interlude plays in background*}\nPlayas in Los Angeles, Detroit, Miami\nNew York, Chi-Town, WORLD-WIDE!\nCHUUUCH IS HERE!", "image": "https://images.genius.com/43a8d8ea9e82ab31d5a8dc1392088c6a.1000x1000x1.jpg"}], "artist": "Twista"}