{"songs": [{"title": "Weezy N Madonna", "album": "Dedication 6: Reloaded", "year": "2018-01-26", "lyrics": "[Hook 1: Lil Wayne & Stephanie Acevedo]\nYou can throw up peace, I'm throwin' squad up\nHad to get the dreads bleached, the James Blonde look\nI'm 'bout to put my hands on her like E. Honda\nShe walkin' around in a Young Money Tee without a bottom\nShe squad\nIt's a Secret society, these niggas tiny, I'll be your body\nScreaming, Money Team, Money Team, Money Team, Mula\nScreaming, Money Team, Money Team, Money Team\nFrom the rooftops\n\n[Verse 1: Lil Wayne]\nYoung Tune winnin' now\nYou know I been winnin' then and now anyhow\nAnyway, don't start no shit if you can't finish loud\nI've been away, I've been around\nI've been busy doin' business\nMind your business 'fore I shut your fuckin' business down\nShe say my lyrics like a lifeline when she down\nShe checkin' bitches off my timeline when she down\nBut all them bitches on the sideline, out of bounds\nWatchin' us play around\n\n[Verse 2: Stephanie Acevedo]\nStephanie and Weezy now\nThe birds birds birds are you singing now?\nThey gonna' keep a lil Puerto-rican out\nA lil' souvenir gotta get me now\nHaul ass on a bitch all in the fast lane\nTurn Xan on your bitch you are just Plain Jane\nI just laugh at the shit with my bad bitch gang (gang gang)\nCause' you ain't a bad bitch without a YM chain\n\n[Verse 3: Lil Wayne]\nI second that shit you ain't lyin' that's game\nI tell your nigga meet me outside in the rain\nI shoot him up like a hundred times then again\nAgain and again, are you not entertained?\nAin't no better drugs than the ones I know\nI done went down on bitches I don't know\nI don't usually do this unless I'm drunk or I'm high\nAnd right now I'm both, got me talking bout you hoe\n\n[Hook 2: Lil Wayne & Stephanie Acevedo]\nSaid she really love the blonde look\nSo she dyed her shit we look like Weezy and Madonna\nScreaming, Money Team, Money Team, Money Team, Mula\nAnd I'm screaming\nFuck your team, fuck your team, fuck your team, Like 2Pac\nSip slow, no blowin' highs, no killin' vibes\nWe touch each other, touch the skies, she rub her eyes\nShe cry Money Team, Money Team, Money Team, Mula\nShe cry Money Team, Money Team, Money Team\nThen I zoom out\n\n[Verse 4: Lil Wayne]\nI said \"Tell me who you loyal to?\"\nIs it Weezy? Is it Wayne? Is it Tunechi? Is it gang?\nOr these no-names hanging with a nigga with a name?\nHow you poppin' pain pills and you living with the pain?\nYou can't tell me that ain't horrible\nAnd my love always free when the lights get dark\nI know love isn't cheap I got a nice-ass job\nYou look priceless to me, I'll rip your price tag off\nBaby \"Tell me who you loyal to?\"\nDo you start with the money or the man?\nDoes it end with your heart in your hand?\nFuck it, if the money bag in the other hand, that was the plan\nLet that nigga spoil you\nI guess somebody else on grind mode\nBut a nigga that provide though\nPut his pride to the side though, and you my slime, so\n\n[Hook 2: Lil Wayne & Stephanie Acevedo]\nSaid she really love the blonde look\nSo she dyed her shit we look like Weezy and Madonna\nI'm 'bout to put my hands on her like E. Honda\nCause' she walkin' around in a Young Money tee without a bottom\nScreaming, Money Team, Money Team, Money Team, Mula\nScreaming, Money Team, Money Team, Money Team, zoom out\nNigga you could throw up peace, I'm throwin' squad up\nHad to get the dreads bleached, the James Blonde look\nShe saw my pic on IG, now she's inspired\nShe dyed her shit we look like Weezy and Madonna\nYeah, yeah, yeah, yeah\nThat's some sick shit! Money Team\n\n[Skit: Lil Wayne]\nSee, this Dedication mixtape series is so important to the culture because they say it is. It's plain and simple, plain and simple. I don't label it important to the culture. If I have ever labelled it important to the culture I was feelin' myself and smellin' my drawers -- uh, pause -- I'm old, my mama used to always say that, my grandma used to say that \"You smellin' your drawers.\" -- but anyway, I don't know if y'all people say that, I'm from the south -- but yeah, the Dedication mixtape series is important to the culture because the culture say it's important. So that's why I still jump my ass in these motherfuckin' booths, wherever I can find a booth, most likely the same one, and do my motherfuckin' thing. And I gotta keep doing my thing and that's why I do my thing because the culture say it's important. They say \"We want that, we need that, we gotta have that.\" It make the-it make the world know what I mean? It make the music world spin, and that's what it's all about, and it's 'cause they say it", "image": "https://images.genius.com/3622689a5172c789024942436b11dce2.800x800x1.jpg"}], "artist": "Lil Wayne"}