{"songs": [{"title": "Murdera", "album": "The Infamous Mobb Deep", "year": "2014-01-01", "lyrics": "[Intro]\nWe know how that song go...\nThis one called, The Murdera\n\n[Pre-Verse: Havoc]\nUh, yeah\nUh huh, uh\nDie, nigga, die\nDie, nigga\n\n[Verse 1: Havoc]\nLook into my crystal ball, I see murder for y'all\nFirst things first, order a hearse for y'all\nFirst nigga open his mouth first to fall\nWatch who you talkin' to, nigga, first of all\nMy gang don't get along, we arrogant\nTake a while for you to assess what the damage is\nGive a fuck POP where them cameras is\nNew York shit under new management\nBlessin' in disguise, black mask and black gloves\nForecasts; grey skies, tears of a black dove\nI can change your life, I just need you to act up\nYeah, that's karma, we don't believe in no bad luck\nHe without sin cast the first stone\nGood in any hood I blend like a earth tone\nI murk microphones, it's a homicide\nAs I watch the soul from your body rise\n\n[Hook: Havoc]\nPop, pop, pop, murder, murder, kill, kill\nDo it for the money or we do it for the thrill\nHustlin' the goal 'til my nose run and spill\nBlood on the streets, I'm 'bout that dolla dolla bill\n\n[Verse 2: Prodigy]\nI'm out for gunshots to represent me\nDo it for the principle and do this shit for free\nYou scared motherfucker? You stay away from me\nYou snitch motherfucker? You supposed to be a G\nThe chickens and the rats and the snakes all click\nThey can't come outside no more, I'm on my shit\nI'm talkin' right now, you talkin' back then\nYeah, it's a new day, wake up and get a whiff, can you smell it?\nThat’s a bitch nigga flesh burnin'\nI put pussy holes all over your back\nYou run from the TEC squirtin'\nOh, suddenly these niggas is feelin' me\nAnd all that blood loss got 'em catchin' epiphanies\nYoung fly rap nigga and I BRAPP niggas\nI understand why you upset I'm that nigga (Ugh)\nShootin' star, I'm a gun totin' celeb\nI wield pistoles, put 'em in wheelchairs\nFuck a peace treaty, they tried to O.D. on me\nBut now you want me to chill and call police on me\nI'm outside of the law, above the system\nI piss on the courtroom floor, I don't give fucks\n\n[Hook: Havoc]\nPop, pop, pop, murder, murder, kill, kill\nDo it for the money or we do it for the thrill\nHustlin' the goal 'til my nose run and spill\nBlood on the streets, I'm 'bout that dolla dolla bill\n\n[Verse 3: Prodigy]\nYeah, R-I-P for those try to go against we (Rest in peace)\nWe the M-O-B-B, make you swallow all your teeth (You take that)\nAnd fuck the police, we New York's finest\nTop shelf gangsta shit, yeah, we the grimiest\nYou send me up the river? I send you up the river Styx\nBitchy ass nigga, you bleed infamous\nCome again\n\n[Hook: Havoc]\nPop, pop, pop, murder, murder, kill, kill\nDo it for the money or we do it for the thrill\nHustlin' the goal 'til my nose run and spill\nBlood on the streets, I'm 'bout that dolla dolla bill\nPop, pop, pop, murder, murder, kill, kill\nDo it for the money or we do it for the thrill\nHustlin' the goal 'til my nose run and spill\nBlood on the streets, I'm 'bout that dolla dolla bill\n\n[Outro]\nThis one called the murdera", "image": "https://images.genius.com/d36f3c5fdf16cb402e39bef763e25bf4.1000x1000x1.jpg"}], "artist": "Mobb Deep"}