{"songs": [{"title": "Lil’ Ghetto Boy (remix)", "album": null, "year": null, "lyrics": "Artist: Dr. Dre featuring Snoop Doggy Dogg\nAlbum: Death Row Greatest Hits\nSong: Lil' Ghetto Boy (remix)\n\nThe Ghetto x8\n\nSnoop Doggy Dogg:\n\nWake up, jumped out my bed\nI'm in a two man cell with my homie Lil' 1/2 Dead\nMurder was the case that they gave me\nDear God, I wonder can you save me?\nI'm only eighteen, so I'm a young buck\nIt's a ride, if I don't scrap, I'm gettin' stuck\nBut that's the life of G, I guess\nEse's way deep, shanked two in the chest\nBest run cause brothers is droppin' quicker\nUgn, too late, damn, down goes another nigga\nBouncin' off the walls, throwin' them dogs\nGettin' that rep as a young hog\nIt ain't nothin' like the street life\nYou better be strapped with your shank\nCause ain't no fist fight\nSo I guess I gots to handle mine\nSince I did the crime, I gots to do my time\n\nChorus:\n\nWe run game in the ghetto\nWe gets high in the ghetto\nWe gets shot in the ghetto\nYou might get stuck in the ghetto\nLil' Ghetto Boy\n\nDr. Dre:\n\nNow I'm holdin' the dub, sittin' on swoll\nTwenty-seven years old, up for parole, stroll\nI'm back up on my feet with my mind on the money\nThat I be makin' soon as I touch them streets\nThings done changed on this side\nRemember they used to thump, but now they blast, right?\nBut it ain't no thang to me\nCause now I'm what they call a loced ass O.G\nThe little homies from the hood with grip\nAre the ones I get with cause I'm down to set trip\nNigga, I'm bigger than you, so whatcha wanna do?\nDidn't know he had a twenty-two\nStraight sittin' behind his back\nI grabbed his pockets and then I heard six caps\nI fell to the ground with blood on my hands\nI didn't understand\nHow a nigga so young could bust a cap\nI used to be the same way back\nI guess that's what I get (for what?)\nFor tryin' to jack the little homies for they grip\n\nChorus\n\nSnoop Doggy Dogg:\n\nSomethin' for the real O.G.'s to get with\nSome facts made our made\nNow you runnin' but I'm played\nLike every single day, really doe\nYou know me, I'm the smooth macadamian\nGamin'em for my homie\nNo need in be uncalm, if you pack right\nAnd learnin' just enough to keep your sack tight\nLate nights, I wonder what they get in for?\nEarly mornin' on the corners, what they hittin' for?\nSeven young G's put they serve down\nIn a G ride, Eastside's where they swerve now\nNot thinkin' about what's really goin' on\nGot crept on, stepped on, now they gone\nI spent four years in the county\nWith nothin' but convicts around me\nBut now I'm back at the Pound\nAnd we expose ways for the youth to survive\nSome think it's wrong but we tend to think it's right\nSo make all them ends you can make\nCause when you're broke, you break, check it out\nSo ain't no need for your mama to trip\nCause you's a hustlin' ass youngsta, clockin' your grip\n\nChorus\n\nLil' Ghetto Boy\n\nThat's the life of a G, I guess\nThe ghetto. x3\n\nThat's the life of a G\nThat's the life of a G, I guess\nThe ghetto. x3\n\nThat's the life of a G. The ghetto\nThat's the life of a G, I guess\nThe ghetto", "image": "https://images.genius.com/bf3badae49c33b583126057638078bd8.576x576x1.jpg"}], "artist": "Dr. Dre"}