{"songs": [{"title": "Let Me Dope You", "album": "Culdesac", "year": "2010-07-03", "lyrics": "[Verse 1]\nWelcome to the culdesac, this is where the street ends\nI am just a rapper, I ain't got the time for speakin'\nNigga stay weak like tornado and a tree branch\nI never have a weak day, my life's a long weekend\nFuckin' with ya raw, bitch, my mouth should get tested\nSleepin' on a nigga, hope you feel well rested\nGambino stay on, can't nobody pull the cord out\nA nigga fucked up, like a hang gliding whore house\nSick boy, yeah, the clique on deck\nYes, I rap absurd, got the game upset\nAnd they rap about the jewelry, the weed they smoke\nAnd I rap about my life, and niggas think it's a joke, nah\nI only put real on a nigga\nBitches see the money, try and steal on a nigga\nYes, I'm on fire, you can feel it on a nigga\nStep away from the heat; they Shaquillin' on a nigga\nTreat niggas like pussy, go hard on 'em\nWatch the swagga get swiped like a card, bottom\nThe swag's unique, I don't even worry 'bout 'em\nI got the tortoise shell frames and the argyle\nYou wouldn't think from the things I'm fashionin'\nI'd get more bush than Kim Kardashian\nDrop hot shit, yeah, my mouth's a laxative\nBorn to be the greatest, this is not by accident\n\n[Chorus]\nHey player, what's good?\n(Let me dope you!)\nHey hater, what's hood?\n(Let me dope you!)\nI'm on fire like wood\n(Let me dope you!)\nAnd you don't wanna fuck with dude\n(Let me dope you!)\n\n[Bridge]\nDon't start no shit, there won't be no shit\nDon't start no shit, there won't be no shit\nDon't start no shit, there won't be no shit\nDon't start no shit, there won't be no shit\n\n[Verse 2]\nI'm a genius, I ain't gotta fake shit\nMy cup runeth over, you can take sips\nI'm in a spa, white robe like a racist\nNiggas can't see me, I will pay for your LASIK\nBuck what ya heard, bitch, I'm flyer than you ever seen\nMy wallet make paper, call it Evergreen\nAshy to classy, finally got some Vaseline\nLive inside a sauna 'cause I always got my self-esteem\nName in your mouth, and it seems as though I struck a nerve\nI never fit in like my penis in these tiny girls\nI figured I was different from these other guys\nWhen I wrote for 30 Rock, I was under 25\nThese other rappers wanna fade into the background\nI'ma stand out when these niggas done sat down\nI always pack heat, yeah, my mouth need a pat down\nMoney, girls, clothes, I don't worry about that now\n\n[Chorus]\nHey player, what's good?\n(Let me dope you!)\nHey hater, what's hood?\n(Let me dope you!)\nI'm on fire like wood\n(Let me dope you!)\nAnd you don't wanna fuck with dude\n(Let me dope you!)\n\n[Bridge]\nDon't start no shit, there won't be no shit\nDon't start no shit, there won't be no shit\nDon't start no shit, there won't be no shit\nDon't start no shit, there won't be no shit", "image": "https://images.genius.com/7fb2bc257978c0cab9de60c94b6542d5.320x320x1.jpg"}], "artist": "Childish Gambino"}