{"songs": [{"title": "Ghetto Rock", "album": "The New Danger", "year": "2004-10-19", "lyrics": "[Intro: Mos Def]\nHello Children\n\n[Hook 1: Mos Def]\nBlack Jack Johnson N.Y.C., R-O-C-K-I-N-G\nSun and the moon, earths, stars, and planets\nBefore song done y'all goin' all understand it\n\n[Verse 1: Mos Def]\nLike - Hot\nThe haters can't fuck with it\nCause they mom and they sister and girl in love with\nIt (and they niggas)\nSound man holla black COME WITH IT\nSping the record 'till the record done spinning\nUp top is you getting up with it?\nDirty dirty is you getting cronk with it?\nSmokey smoke from coast to coast\nBe carefull our first draw be that overdose\nWho stay holding it from Brooklyn? YOU KNOW IS MOS!\nHa, Jackpot I (Sing yo) got to go for broke\nIs this the only way the Smith Family now to go\nRight here to my youngest one is older folks\nIm'ma put down like a dirty so and so\nFreak daddy came here to work the mojo - oh\nBecause the - high is high and the low is low\nAnd that goes for the sinner man to holy folks\nPut your shit in the sky like I know you - oh\n[Brooklyn stand up!]\nHa, my ghetto nation get toe to toe\nStay rocking steady steady cause I told you so\nAnd after y'all get it go I let it go some more\nThat Black Jack about something for sure) for sure\n[SAY WHAT!]\nFor sure for sure [HA!]\nLet me see you in the world making your shoulder role\nAnd if it get good tell your nigga throw your 'bows\n\n[Hook 2: Mos Def]\nCause we are so ghetto\nYes we are rock and roll\nYes we are so ghetto\nYes we are rock and roll\nYes we are so ghetto\nYes we are rock and roll\nYes we are so ghetto\nYes we are - rock and motherfucking roll (WOOOO!)\n\n[Verse 2: Mos Def]\nHa, I am a fighter and a lover\nI'm the freaky baby daddy, I'm a bad motherfucker\nI'm the earth, wind, fire, and the thunder\nI said I am, go ask my mother\nYou don't believe that shit believe what you want to\nAlright, OK, So, Shut-up!\nSpeak language come straight from the gutter\nObserve the terms that we trade with one and other\nLike - what's good, what's popping, what's cracking\nWhat it is, how you living, what's happening\nWork songs that the slaves sang back then\nThe playground chants, with little girls claping\n\n[Hook 2: Mos Def] + (Girls chanting)\nBlack John Johnson N.Y.C., R-O-C-K-I-N-G\nSon and the moon, earths, stars, and planets\nBefore the song done y'all going all understand it\nBlack John Johnson N.Y.C., R-O-C-K-I-N-G\nSon and the moon, earths stars and planets\nBefore the song done y'all going all understand it\n\n[Outro: Mos Def]\nSPACE!\nGIMME THE SPACE!\nBACK UP, GIMME THE SPACE!!!\nLET A NIGGA ROCK!\nGIMME THE SPACE!\nLET A NIGGA ROCK!\nLET A NIGGA ROCK, HA!\nThis is the sound\nGhettos rock\nThis is the sound\nGhettos rock\nThis is the sound\nGhettos rock\nThis is the sound\nGhettos rock\nThis is the sound\nGhettos rock\nThis is the sound\nGhettos rock and - MOTHERFUCKING ROLLLLLLLLL!", "image": "https://images.genius.com/338419572381e746b5f1aa0866d2d857.596x596x1.jpg"}], "artist": "Yasiin Bey"}