{"songs": [{"title": "Truck Volume", "album": "Genesis", "year": "2001-11-27", "lyrics": "BUSTA:\nYeah, yeah\nYeah, yeah\nTurn my music up (C'MON)\nTurn my music up (C'MON)\nTruck shit now (C'MON)\nTruck shit now (C'MON)\nTruck shit now (C'MON)\nTruck shit now (C'MON)\nTurn my music up (UHH)\nTurn my music up (UHH)\nTruck shit now (C'MON)\nLive nigga bully foot brassed up on rap shit now\nCheck it out now\n\nVERSE 1:\nYeah, yeah, yeah re-lax that shit you talk\nBefore I sick my bitch on you that'll bounce with your dick on a fork\nI'll bring a bigger storm to calm your clouds\nI own a couple things; I even own a farm with cows\nI own the moment when my niggas run deep through crowds\nLike how a pregnant woman breast milk leek through her blouse\nA lot of niggas like to wish on a star\nDon't give a fuck who you are\nI know some niggas that'll piss on your car\nNow see, every time we step in a place\nI give y'all niggas shit that put a foul look on your face\nAnd rob ice like I was never more able\nDon't drink coffee 'cos my diamond be cutting the glass on the table\nHey, I be the lost found tribe of \"Jabas\"\nBust niggas then I plant another bomb in your ass\nAnd then I put my students all in a class\nTo clear my ruler ship\nAnd make y'all niggas fucked up doin' the math\n\nHOOK:\nOne time now (C'MON)\nTruck shit now (C'MON)\nTruck shit now (C'MON)\nTurn my music up (C'MON)\nTurn my music up (UHH)\nTruck shit now (C'MON)\nTruck volume (C'MON)\nTruck volume (C'MON)\n\nCHORUS:\nI know ya-wanna-get up-on it\nLet me-show ya- how we do\nEvery-time we-drop that-shit you\nKnow we-put it-down for you (HEY, HEY)\n\nVERSE 2:\nHow many times you gon' crush down somethin'\nYou need to change your name up, to Bus-A-Bus down somethin'\nYou fuckin' with the highest my nigga\nTryin' to fuck with the giants, might as well call me Goliath my nigga\nC'mon, drop hot shit on the spot; sop it up with a mop\nBefore the hungry come and shop on your block\nI know some niggas that'd love to blood suck you all\nA thing of the past, because them niggas stuck you all\nOne shot bustin' the same bullet, struck you all\nAnd when they bounce you hear voices screamin' \"FUCK YOU ALL\"\nGathered up about a thousand young ?box? who brawl\nAs decoys, in case they needed to duck you all\nThat's why you better move tight with your click\nNiggas be thirsty and quick\nJust to be off into the night with your shit\nC'MON, we keep it street to give a damn who you are\nMake niggas wile, and bitches spread, and put they hands on the car\nNow let me frisk 'em, and shake they asses down to the floor\nOne dude wonderin', \"What them niggas is poundin' me for?\nWhat them niggas grillin'? What them niggas houndin' me for?\"\nBefore the poundin', \"What them niggas was surroundin' me for?\"\nWell let me tell you what the fuck we was surroundin' you for\nWe came to get you once but now I come to get you for more\nAnd while they get and got, niggas drinkin' ten-dollar-henne a shot\nGetting' drunk and wilin' out in the spot\n\nHOOK:\nWhat the fuck now (C'MON)\nTruck shit now (C'MON)\nTruck shit now (C'MON)\nTurn my music up (C'MON)\nTurn my music up (UHH)\nHot shit now (C'MON)\nStreet shit now (C'MON)\nTruck volume (C'MON)\n\nCHORUS x 2", "image": "https://images.genius.com/4102489ca8934c81cdf553b85cec18fd.1000x1000x1.jpg"}], "artist": "Busta Rhymes"}