{"songs": [{"title": "Ask Yourself a Question", "album": "Kuruption!", "year": "1998-10-06", "lyrics": "[Produced by Dr. Dre]\n\n[Intro: Kurupt]\nCheck it out\nHere's a penny for your thoughts, a nicklebag of bliss\nAn M-16 with eighteen clips\nI'm all set to bust, treacherous\nIllustrious, homie don't question us\n\n[Hook 1: Kurupt]\nJust ask yourself the question\nHow many hoes can I fuck in one night?\nJust ask yourself the question, nigga\nHow many niggas can I blast on sight?\n\n[Verse 1: Kurupt]\nI'm ferocious, and you knows this nigga\nBitches wear skirts, shake ass and bump\nI pop pistols, that's all I do\nI pop one at him and pop two at you\nI'm illusive, I'm a glutton\nPistol popping activist with the key to the bucket\nI rip your pockets of the side of your pants\nYou glare to the side and you glance, I’m in my G4 stance\nHow the fuck you make it this far?\nNo matter where you at, or who you are\nPeople treat me like Kareem Abdul Jabbar\nI hear ooh's and aah's when I jumps in my car\nJust from last night you can tell\nThat I'm addicted to the fast life (Addicted to the fast life)\nShouts out to my homeboys Mad and Quell\nYou go on and fuck Misty, while I fuck Michelle\n\n[Hook 2: Kurupt]\nJust ask yourself the question\nHow many hoes can I fuck in one night?\nJust ask yourself the question\nHow many niggas can I blast on sight?\nJust ask yourself the question\nIs it cool to ride, or is it cool to fuck?\nJust ask yourself the question\nI don't know why these motherfuckers wanna fuck with us\n\n[Verse 2: Kurupt]\nWhat you wanna do, penetrate me?\nBump my crib? Bust and fuck my bitch, nigga?\nI never thought a nigga would trip\nOff a little piece of ass that he know he could get\nAny day (Any day) and any time (Any time)\nYou'se a vegetarian (what?), I like beef, turkey and pork\nFish and chips, chips and dip\nFuck it, hand me my knife and my fork\nI'm not too picky nigga, Kurupt young Gotti\nA.k.a. Low Ricky nigga (what up momma?)\nSubstantialar, tyrannosaurus, gigantic, titanic tarantula\nOn a creep homie, wake up\nDon't sleep homie, supposed to know it\nLook, I'm hazardous to health, nigga, bitch, nigga\nDon't ask me shit 'til you ask yourself\n\n[Hook: Dr. Dre and Kurupt]\n\n[Verse 3: Dr. Dre]\n(Fuck is up?)\nMan, life's a bitch\nYou gotta put your pistol to the sky\nKill a million motherfuckers and get high in order to be cool\nMan, you'se a motherfucking fool (Speak to these niggas)\nI thought the same way back in the days\nYoung with a lack on daily things\nNever thought too much, homie, never trip\nI got drunk as fuck, the homies blaze sticks\nLook out for them niggas out to get you\nIt's a mistake forgetting to take your pistol with you (Your pistol, nigga)\nNiggas get swallowed in the game\nI cock and bust hollows to peer, duck and frame\nYo nigga, that shit sounds like I did it\nDon't blaze the Indica without the Thai with it\nNiggas look like they're doped up like tired bitches\nWith the eyes wide gone, you spit the harpoon\nWiping shit the fuck out, like typhoons\nWith the little homeboys, T-bone and cartoons (C'mon)\nMotherfucker don't ask me for shit\nFuck everything you believe in, little bitch\n\n[Hook: Kurupt]", "image": "https://images.genius.com/a7652517cf446c15e882aa0bc85229b3.594x594x1.jpg"}], "artist": "Kurupt"}