{"songs": [{"title": "Ghetto Story (Steady Mobbin’)", "album": "Lupe Fiasco’s Food & Liquor (Advance/Pre-Release Leak)", "year": null, "lyrics": "[Lupe talking]\nYou know I had to do it, man\nIt wouldn'ta been right if I didn't\nYou seen it? You seen the show last night on TV?\nYou seen nigga's rims man? You seen the new Jordans man?\nYou see her ass yo? Yeah, yeah, that's crazy\n\n[Singing]\nSeein' with my ghetto eyes\nI walked with my ghetto feet\nI talked with my ghetto speech\nI'm copacetic, I won't let it bring me down\nBring me down...\n\n[Verse 1: Lupe Fiasco]\nI say it's instilled\nAs I peep from beneath the titled brim of my pinwheel\nSteady mobbin', heavy problems\nGenocide desensitized to violence\nMakes it hard to sympathize\nHarden, individuals whose feelings is minuscule\nSoon become criminals if you dark-skinned\nAnd you was raised in a project apartment\nPublic Aid made it that your father couldn't stay\nHe had to part then, left with only a mother\nThe family structure suffers\nHe will soon cling to hustlers, as his guardians\nHe still a boy, needs to fill a void, marchin'\nUp the block up to no good, sellin' in the wrong hood\nHe was taken down by a marksmen\nAt his wake, 8th Grade Graduation picture\nLast words: Don't let the habitation get ya\nPardoned, Lord have mercy on the fallen\nAmen, feel like I'm hardened\nGot the harbinger for the coming of the carpenter\nTil then, I got some big fish to fry like Marlins\nPart niggas, steady mobbin'\n\n[Chorus]\nI've got some questions to ask\nAnd I'm waitin' on some answers\nLike, Why do the good die young?\nWhy ain't there no cure for cancer?\nWon't let the streets dictate my glory\nCause it's something out there for me\nBut I'mma flee my territory\nSo I won't end up, just a ghetto story\nJust a ghetto story, just a ghetto story\nJust a ghetto story, just a ghetto story\n\n[Verse 2: Lupe Fiasco]\nAnd I try to see past it\nThrough the down-roll window on\nThe driver side of my Caprice Classic\nSteady mobbin', corner store traffic\nI.e. dope fiends, hookers and teens with alcohol IVs\nI see, plastic, cups is a nickel\n50 cent for Dutch Masters\nMy big brother's Pelle Pel' lingers\nOf a fargone weed smoke\nLookin' for greener pastures, pasturized 2% for $2.19\nYou can get 2 quarts, there's also a sale on Newports\nA separate line for Lotto, bumpy face, add a model\nHuggin' a bottle, salt and sour Jays, and blueberry Hugs\nShorties consider a meal, been my feel for it\nSweatin' for a pair of Air Jordans they would steal for\nAnd a gold chain 4 fiends would\nKnife, wild and kill yours\nThere's nothing too promising on our billboards\nDrink Tanqueray, eat KFC, come abort your child\nBuy Nikes, which makes it highly\nUnlikely that we gon' fight, G\nSteady mobbin'\n\n[Chorus]\n\n[Verse 3: Lupe Fiasco]\nAnd I'm still on\nAs I stroll down the same street so\nMany like me once before, were killed on\nSteady mobbin', thinkin' bout the Black Panthers\nAnd the babies that were born in the late '80s\nThat now have babies that lack Pampers\nNo Kwaanzas and they lack Santas\nAnd the father who thinks shoe-shopping is the answer\nSkipped out on parenthood classes so\nShe don't know how to handle her\nAnd never learned from her grandmother\nOne day got hot, couldn't take it\nDropped her in a vacant lot\nAlbum of Life, now condensed into a sampler\nSee the shapes these little girls is gettin'?\nSome say the steroids in the chicken is\nThe cause of the thickening in the young women\nLivid, see some shorties playin' Cops & Robbers, livin'\nBittersweet thoughts is what I had for them\nI can picture quota fillin' Police chasin' after them\nCatchin' up to, friskin' and askin' them\nWhere the packs at? Who yo' chief\nIs? Where the straps at?\nAm I thinking too hard? Or perhaps that's reality\nIn a project mentality, but through it all\nI hope we learn more than how to be\nWhores and how to move a ball\nSteady mobbin'\n\n[Chorus]", "image": "https://images.genius.com/3eefa46f0c6e9d0def3a2d3c94939cad.1000x1000x1.jpg"}], "artist": "Lupe Fiasco"}