{"songs": [{"title": "R.I.P. Gil Scott-Heron", "album": null, "year": null, "lyrics": "The Television Will Not Be Revolutionized\n\nIdiot boxes of the world unite! To fight off the effects of intelligence, replace smart quotes with fart jokes, substitute sense with scenes from Martin, let the baby’s bathe in that glow and learn all manner of things they don’t really need to know!\n\nThe Television Will Not Be Revolutionized!\n\nChannel the content of some rambling nonsense deep into the annals of yo’ subconscious, deprogram and depress chasing some televised success\nBe them, that, they and those be everything but in control\n\nThe Television Will Not Be Revolutionized!\n\nSmall claims Court drama, teenage baby mamas, Osama watching Osama, Celebrity Endorsed indoor saunas, the perfectly cooked piraña and other cannonfodder for you to ponder, all at the speed of imitations of life while the smoke of war gets inhaled thru the peace pipes, be still my beating heart and scare my brain from thinking thoughts as I sit intoxicated by the delights, sarcasm and 3 strikes thrown by my favorite pitcher in a sound surrounded, 3 dimensional, high death, full color mixture, wholly unsocializing and completely uncensored\n\nThe Television Will Not Be Revolutionized!\n\nBy this one-eyed monster most of the world was raised, and by this hero most of the world was saved, and to this master most of the world is slaves, it factors your fears with actors and cheers from a live studio audience pushing you to engage in a heroic act of thoughtlessness for the grand prize of a little bread, fleeting fame in the circus and every thought in yo head\n\nThe Television Will Not Be Revolutionized!\n\n“Ain’t no changing me” said my flat screen TV, No More Che’s to the rescue, or Black Panthers to correct you, just coaxial cables and satellite signals to connect you to a world that doesn’t really look like it does on TV, where everything is much shorter, fatter, uglier and in disorder, where u have to do it now because there are no digital recorders where if the present gets boring you can just fast forward\n\nThe Television Will Not Be Revolutionized!\n\nSo there will be no revolution, or paradoxically ironic televised public execution of the entire worldwide televising institution, there won't even be a celebritized, televised trial of old baby blue, cuz you see my dear friends the television will not be revolutionized but what about the revolution that should taking place inside………………….of you?", "image": "https://images.genius.com/b67b7f5bfbd7eb8c5c334fa8b05a2432.400x400x1.jpg"}], "artist": "Lupe Fiasco"}