{"songs": [{"title": "Who Shot Ya (Freestyle)", "album": null, "year": null, "lyrics": "[Intro]\nNo that nigag didn’t come out of a motherfuckin’ balloon in the air\nThat nigga’s ill, he landed on the projects with that shit\nCrazy, B, crazy\nAh man, it’s this nigga Rae right here, right\nYeah, 2013 bullets, huh?\nThat’s what I’m talkin’ about\nReal\n\n[Verse]\nFly down to Vegas and fuck, drop a half a ‘mil\nTable it up, silks cable it up\nI’m from the grain, entertainers get scooped and trapped\nPull a navy blue Uzi out and roof your ‘Lac\nCrap table, King, Black Jack, gangsters with chains on\n69 blue jean denims, OJs on\nRelax, blunt’s on me, black weed gritty\nParlay with the wrangler posse in the city, yo\nOverdose confidence, gun in the console, concord jet to the Congos\nBagging everything up, swag on a million, blindfold\nCan’t see nothing I wear, fronting out here\nThey ask me how I’m eating, I be hunting out here, yeah\nGodzilla rap and them labels\nHugh blow fiend, heron don, Levis is plainclothes\nSo many rings plus surrounded by kings\nSitting back in the fourth row, examining Queens\nThey like “Chef, yo, you built for it meet at the Biltmore”\nAny violations I agree to get killed for it\nWhere’s the real rap? Niggas is lost now\nHmm, how much it cost now to marry it up?\nDivorce it, blaow, extortion style\nShoot the first nigga who talk, you lost your style\nMy next album might be called The Wild\nWolverines, bears and whales, no snails\nFoxes, good Great Danes, that’s all, he Cale\nKill all the rats, for real\nThey live in the hoods\nThey all come out convinced to sell\nLittle clothes niggas is frail\n‘Cause when he rap it’s like poisonous lines that’s rich\nMix together virgin blood and gallons of piss, yo\nThe real lowdown in the midst\nI come like Sandy in the middle of the year like Christmas\nKango, Santa skully, emerald green\nRockin’ dark green Wallabies, blowing the beam\nOn the go, yo, bowling for cream\nAnd I’ll be here for the next ten years for the team\n\n[Outro]\nYo, oh shit\nPacquiao just got knocked the fuck out by Marquez, nigga\nOh shit", "image": "https://images.genius.com/32fabf2b8b2eb256a0e1d6a14a76852f.500x500x1.jpg"}], "artist": "Raekwon"}