{"songs": [{"title": "Real & True", "album": null, "year": "2013-11-05", "lyrics": "[Intro: Future]\nWhy did we go all the way?\nWhat do we do, ohhh, when it rains?\n\n[Hook: Mr. Hudson]\nWhen the sun dies and the stars fade from view\nOur love will remain real and true\nThrough the distant and cold depths of space\nThe radio sings our song, it's a love real and true\n\n[Verse 1: Future]\nHold on, hold on, hold up Future, what the fuck you doin'?\nYou can annihilate way more chicks than the chick you screwin'\nYou on top of your game, homie, man you a star\nYou got real bitches, they love that nigga that you are\nThey say you're like Jimi Hendrix, in his early twenties\nYou in Vegas, you supposed to be with a snow bunny\nYou a player, huh, you wanna come around and save her\nKeep it trill, you lovin' her just as much as your career\nYou mad ill, I knew you'd be the one to keep it real\nAnd I can't even lie, dog, when I see y'all it gives me chills\nAnd Imma stand behind y'all because I know the way you live\nAye just do me this favor, you give it time, time reveals\n\n[Hook: Miley Cyrus]\nWhen the sun dies and the stars fade from view\nOur love will remain real and true\nThrough the distant and cold depths of space\nThe radio sings our song, it's a love real and true\n\n[Verse 2: Miley Cyrus]\nWe've been in the same place, for a long, long time\nIf our hearts go the wrong way, I still know you're mine\nShould we even try to fight it?\nIf our love is trapped in all ways\nI know that things been rough\nBut when you're by my side\nIt's more than enough, yeah\nFor us to make it through the test of time\n\n[Hook: Mr. Hudson]\nWhen the sun dies and the stars fade from view\nOur love will remain real and true\nThrough the distant and cold depths of space\nThe radio sings our song, it's a love real and true\n\n[Verse 3: Future]\nStandin' in the middle of humility\nCan't nobody never love you more than me\nCan't nobody never love you more than me\nIf love is all you need, I'm all you'll ever need\nI can never be scared of commitment\nI can prevail through life without bein' malicious\nI can't hold you for responsible for your mischiefs\nI hope you are never huntin' me with vengeance\nI'm not predictin' anything, I'm just listenin'\nCongratulations, you made it, you coulda missed it\nAnd I'm acceptin' your past but forgiveness\nAnd with all the mistakes I've made, you're still listenin'\n\n[Hook: Mr. Hudson, Miley Cyrus, and Future]\nWhen the sun dies and the stars fade from view\nOur love will remain real and true\nThrough the distant and cold depths of space\nThe radio sings our song, it's a love real and true\n\n[Bridge: Future]\nReal and true\nReal and true\nReal and true\nReal and true\nAnd I can fight temptations off\nI ain't soft, no I ain't soft\nYou can't be lettin' the rap shit go to your head\nCan't be cancellin' no shows, fuckin' up your bread\nCheck out these rumors, that ain't nothin' but the devil\nThat's why we gotta continue to pray together\n\n[Hook: Mr. Hudson, Miley Cyrus, and Future]\nWhen the sun dies and the stars fade from view\nOur love will remain real and true\nThrough the distant and cold depths of space\nThe radio sings our song, it's a love real and true", "image": "https://images.genius.com/c2ed3caf6f9b189274f23c051135989f.600x600x1.png"}], "artist": "Future"}