{"songs": [{"title": "I’m Black", "album": "The World is Yours", "year": "1993-08-17", "lyrics": "They try to take advantage of a nigga cause I'm black\nThey lookin' at me strange so I'm lookin' at they ass back\nI got a little problem so I'm writin' you a note\nA letter to the KKK from the black folks\nI'm tryin' to get it on, tryin' to check the grip\nAnd there goes officer cracker tryin' to sink my fucken battleship\nTurnin' on his flashers, callin' up the dogs\nNow my Lexus Coupe is flex surrounded by the hogs\nSnatchin' out my seats, tellin' me I sell dope\nAm I on probation or parole? I tell 'em fuck no!\nTell me mister officer, what's the problem?\nWhat's the matter?\nWhy you gotta treat us like scum? Is it that a\nNigga's doin' a tad bit better than you?\nAnd brutality is all that you crackers can do\nAnd mark me up for resistin' yo ass\nWhen in reality officer friendly kicked my ass, damn!\nYou overflex your authority too\nPut your foot in my shoe, and let me try on your boot\nSo I can run it in reverse\nYou can treat me like god, and I can treat you like dirt!\nThe 22 years I been here I saw\nMotherfuckers disrespect god before they disrespect the law\nBut yo I gots ta diss 'em\nCuz I refuse to be mislead by this ungodly system\nMister president I beatin' on yo back do'\nI make yo mind doin' rap but I'm black doe... nigga\n\n\"We are United States of America. You honestly believe\nJust because you wear bags that means you care?\nYou have the right to abuse and treat my people like\nThey're animals on the street? I'll be damned you're\nBloods will flow with the hands of the black man\nIn the same streets that you killed me and my brothers in.\"\n\nMister mister officer, mister officer, mister sergeant\nJust because I'm young and I'm black I'm a target?\nYou say I'm sellin' dope but you fake\nCuz young dope dealers flash cash and make mistakes\nAnd besides we ain't dealin' no mo'\nLook at my hood, we ain't killin' no mo' so\nEverybody's yellin' peace\nThe only war that's goin' on is goin' on with the police\nCuz they ain't stoppin' with the bullshit\nIf they could they'd lock us up with some chains and swing a bull whip\nCuz they figure they're the master\nAnd they can take you to jail or take your lifes\nThem sorry bastards\nThat makes me wonder why\nThe five-o can determine if we live or if a nigga dies\nAnd to me that shit is bull\nOnly god can take life but I still gotta watch the law\nIt's bad enough I watch the next G\nBut even worse I gots ta watch the motherfuckers who protect me\nThey fucken packin gats yo\nThey serve and protect, they don't respect cuz I'm black ho\n\n\"Every black man that is a car jacker will start jackin'\nPolice cars and watch jaw brains shad on the dashboard\nWhy when you pull us over you show us your pistols before\nYou aks us for our drivers license? Somethin' is not right!\"\n\nRollin through my hood in my motherfuckin' dropper\nGettin' tailgated by a motherfuckin' copper\nBut I ain't got respect for you motherfuckin' dickheads\nCuz y'all was straight hoes back in school nerdy shitheads\nI finally figured out why you bitches roll in packs\nCuz niggas who ain't shit talk loud and pack gats\nYou got a fucken pistol, now you think you're a VIP man\nBut you can get cut becuase you'd be just like the next man\nHoldin' me for nothin'\nRunnin' my fucken license plates\nMy plates come clean\nYou call the DEA\nThe DEA\nSays I'm a known drug dealer\nStraight born killer\nA motherfuckin' wig splitter\nHe don't know shit about a nigga but I'm black\nAs far as he's concerned all niggas push crack\nAnd plus I'm 22, that really makes 'em check\nA drop-top Benz, Lexus Coupe, no respect\nI gotta be doin' long I'm hidin' somethin' from the demons\nHe gotta be stringin' yale, let's play someone that's pregnant\nCuz niggas can't have shit but I'm a motherfuckin' troop\nYou come to us like Luke\nUndercover David Duke\nMister David Duke\nMister officer\nMister mister master\nI'm pickin' out your coffin sir\nDie motherfuckers, I'll send your folks my worst\nA breast of pig in a motherfuckin' hearse\nSo fuck you motherfuckers, punk bitches take that\nCuz I'm real with the shit that I speak cuz I...\n\n(Outro)", "image": "https://images.genius.com/2c9d70007eb3a5b42d898b73f3ce76f0.936x936x1.jpg"}], "artist": "Scarface"}