{"songs": [{"title": "U.O.E.N.O.", "album": "Dedication 5", "year": "2013-09-01", "lyrics": "[Verse One]\nUh, I'm flying private through Cloud 9\nYeah, if you got a problem, I'm Einstein\nYeah, I'm yawnin', I'm so tired of ballin'\nYeah, only selling work to them workaholics\nGot guns bigger than you nigga, I don't fuck with new niggas\nI blues your bitch ass, hope somebody give you rhythm\nI got animal all in my floor, take your shoes off at the door\nNiggas feed these bitches lies, nigga don't food poison my ho\nI buy my drugs for the low, like a coupon on at the store\nMy niggas like Kanye with that good, my niggas like Lou Rawls with that blow\nNiggas be sayin' they racked up, don't let that Q-ball leave you broke\nI know you want a pat on the back, but then those fools goin' see you choke\nI saw your bitch and she said, she tryin' to move on and let go\nBoy, I get up in that pussy and hit her with moves you don't even know\nNiggas be trippin' over these hoes, I done came too far to get close\nI've been outchea gettin' bread and I don't need you all in my loaf\nIf you stick your neck out there, I'll have my goon's all at your throat\nNiggas be lukewarm at the most and when I'm through ballin' I coach\nShout out to my nigga Mack gettin' his boo on in that Ghost\nI'm still coming off the top of the dome but it'd be on a tombstone if I wrote, Tunechi\n\n[Hook]\nMy kids already rich and they don't even know\nThese nigga's sayin' they playa's, they ain't even scored\nMy bitch rolling my weed, she don't even smoke\nEverybody following me, I ain't even Moses, nigga\n\n[Verse Two]\nUh, my cologne illegal in nine countries\nI found a way like it was hiding from me\nYeah, my weed good, my sex better\nBitch, don't text me no long letters\nI'm ahead of the game, I need a blowjob\nMost of these ho's ain't got no job\nAnd these niggas goin' buy em' everything\nYou goin' fuck around, and get the ho robbed\nI'm ahead of the game, I need a haircut\nUsed to hug the block, I mean bear hug\nAnd tell them rats the AK go Rat-a-Tat, like snare drums\nI woke up this morning, dick rock hard, dick harder than a armadillo\nMLK would be proud of me, cause I do this shit for all my niggas\nHer mouth, pussy, or asshole, life is full of hard decisions\nIf she ain't fuckin', she get the boot, let me write this bitch a parking ticket\nAin't got time for love life, all I know is get paid\nI'm high like Bonjour, twisted like french braids\nI got my own shoes, SLIME, T, I feel like MJ\nI'm working that graveyard shift, man these niggas been dead\n\n[Hook]\nUh, I feel asleep in that pussy and I didn't even know\nI woke up and acted like I didn't even know her, yeah\nDon't fuck with these fuck niggas, you already know us\nI'm looking for that loud pack, weedman bring the noise\nYeah\n\n[Verse Three]\nPass that weed to the next nigga, blunt longer than a tongue twista\nHoes want this scud missile, I'mma ball, like Crystal\nLil Tunchi Li, young sex pistol, new money, no wrinkles\nI'm hard headed, Ocho, Dedication Cinco, uh\n\n[Outro]\nWhat up 5?\nRocko fuck with me! Yeah!\nFuture fuck with me! Yeah!\nT, I feel like MJ\nI'm working that graveyard shift, man these niggas been dead\n5!", "image": "https://images.genius.com/aa4f93cf953aad46ecd13d3027b59fff.475x475x1.jpg"}], "artist": "Lil Wayne"}