{"songs": [{"title": "Hip Hop", "album": "Mr. Smith", "year": "1995-11-21", "lyrics": "[Produced by The Trackmasters]\n\n[Intro]\nWord up! Ya know what I'm sayin'?\nI gotta globe in the world in the mail today\nNahI'msayin? Heh, word up!\nUhh, kid told me \"Yo, the world is yours kid, put it in ya pocket\"\nNahmean?\nMake a brother feel good, word up!\nBrother feel energized\nI wanna dedicate this one to the game that put me on the map\nY'nahI'msayin?\n\n[Verse 1]\nI know you love it, the game is so irresistible to touch\nYou should see me when fiendin' for microphones that I can clutch\nDroppin' bombs, combinin' the club attracts\nLike the old Sugarhill Gang, King Tim and Fatback\nThere's no question the suggestion was made\nThe foundation was laid when the Furious played\nGrandmaster Flash slayed competition that was wishin'\nThey could serve the technician with the number one position\nUgh, the real deal, Fearless Four scored\nBambaataa was hotter, Spoonie was givin' em nata\nAn' I was all up in my headzone, melody and' all\nCosign and The Movement sayin', \"Yes, yes y'all\"\nIt's just the love affair that never ended\nI recommended that I take microphones and blow 'em up\nAin't that splendid?\nThis one goes out to all the hip-hop do-or-diers\nA song is dedicated to the music I admire\n\n[Chorus]\nWhenever and ever\nWe want you, I need you (I need hip-hop)\nWhenever and ever\nWe want you, do you feel the same way too? (I need hip-hop)\n\n[Verse 2]\nKane's era was terror, he warmed it up\nParrish and Erick, cat lyrics that'll make ya turn it up\nAnd I was in the cut, chillin' in my drop-top Benz with friends, Loungin' with my mens, laughin' 'bout all the ends that I spends\nMaking snaps, pumping Kool G Rap and Biz\nDapper Dan, Dookie wrotes I'm about to show what time it is\nAt the rooftop, I was with Doug E.Fresh and Slick Rick\n\"La Di Da Di, who likes to party?\" was the fat shit\nI mean, I saw this hip-hop thing on every level\nChuck D, P.E., yes, the rhythm and the rebel\nI can reminisce the black fist, Uzi, Terminators\nTerrordome techniques that terrorize the lighter shade-a\nIt's all about the game that we play every day\nEric B & Rakim flow to such a different way\nI'm lovin' hip-hop cos it help brothers escape\nLet's celebrate our music people before it's too late\n\n[Chorus]\nWhenever and ever\nWe want you, I need you (I need hip-hop)\nWhenever and ever\nWe want you, do you feel the same way too? (I need hip-hop)\n\n[Verse 3]\nSurvival Of The Fittest, Mobb Deep, and Lost Boyz\nLickin' shots got the game hot, they even flipped on 2Pac\nSnoop Doggy Dogg put the West Coast in gear\nDr Dre, NWA, Eazy E's in here\nI wanna tell the world they just don't understand\nMy man Nas Escobar, Wu-Tang Clan\nKeith Murray to the Redman, down south Da Brat\nMy people are you with me where you at? Ya peep that?\nI'm on a mission to rejuvenate the funk\nBring the game back and give the do-or-diers what they want\nWhen you hear Craig Mack, Notorious B.I.G\nLatifah, Heavy D, you should reminisce of me\nSome say it's Naughty By Nature, \"Hip-hop in all its glory\"\nA fleet of battleships floatin' in different categories\nMy love affair with hip-hop'll never fade away\nSincerely yours, LL Cool J\nPeace\n\n[Chorus]\nWhenever and ever\nWe want you, I need you (I need hip-hop)\nWhenever and ever\nWe want you, do you feel the same way too? (I need hip-hop)\n\n[Outro]\nYeah, ain't no doubt about it kid, know I'm sayin'?\nHip-hop's the game, helped a lot of brothers escape\nTake it to another level, know I'm sayin'?\nIt's our music, we own this music, know what I'm sayin'?\nWord life! I wanna give a couple of shout outs here, know what I'm saying?\nFirst of all, I wanna thank my man Baby Chris, y'nahmean?\nHelped me put this Mr. Smith, Mr.Smith album together\nMake it hot, know I'm sayin'?\nThank the Trackmasters-Poke & Tone, Steve Stoute\nWe definitely turning this joint out, y'nahmean\nWord bond! Hip-hop for life, kid!\nYeah!", "image": "https://images.genius.com/aba57f7703e47dacfcd5243398922d01.500x500x1.jpg"}], "artist": "LL Cool J"}