{"songs": [{"title": "Maintaining", "album": "Resurrection", "year": "1994-10-25", "lyrics": "[Intro]\nGotta watch out for them critters...\n\nI get the party live, Common Sense'll get the party live, huh (4X)\n\n[Verse 1]\nI was born in Chicago, raised on Planet Rock, talking zuh zuh zuh zuh\nCats knock my tape like boots, I'm as fresh as fruits\nYou pussy MC, it's you I rebuke\nRepent! You burn up, you got me bent\nI'm current as an event, got on big hoes at Freaknik\nFrequently you're telling me Whoopty Woo can rock it\nSo? He ain't put no scratch in my pocket\nYo herb, with my hand I cock it\nAnd rock it like that brother in Colors, 'cause I want y'all to live\nMy crew is too live, we sneakin' to the rear\nBut I can't get us all in free (What?)\nIt's just another case of that 2-dollar emcee\nI rock the same clothes 3 days straight\nTo you they wrinkled but to me they straight\nNow I'm straight; are you straight?\nI'm straight as long as I got beer\nI thought about it, Jack, and now I'm outta here\n\n[Hook]\n(\"Maintain the rock, don't stop the rock\") (8X in background)\nI get the party live, Common Sense get the party live\nI get the party live, Common Sense get the party live\nWe get the party live, ayo Chicago get the party live\nI get the party live, Common Sense get the party live\n\n[Verse 2]\nI need me some new socks (uhh), I need me some new drawers\nI draws attention, like a letter to a sergeant\nThere's a few good emcees, the wack I'm giving code red\nSlim say I ain't got no body, but when they see me at the party\nThey be like, \"Go 'head, go 'head\"\n'Cause I got's the cuts like Bobbitt, rappers are dickheads\nShoppin' they demo, I do 'em like Big Red\nMy office hours are from 9 to 5\nWhile you avoid the party I make it live\nThe fellas nod and the chicks dance\nWhile I'm coolin' in my jumpers and my big pants\nI'm as dope as PCP; MC's see me and they start having flashbacks\nI don't flash scratch, I gotta watch my back\nNowadays blacks don't know how to act\nBesides Larry Fishburne, Charles Dutton, and Wesley Snipes\nMarks wanna test me because I test the mics\nBut I check 'em like sound, and like Goose, I'm down\nPlus I done got better since \"Soul by the Pound\"; I'm maintaining\n\n[Hook]\n(\"Maintain the rock, don't stop the rock\") (8X in background)\nWe get the party live, ayo Chicago get the party live\nWe get the party live, 87 get the party live\nI get the party live, Common Sense get the party live\nWe get the party live, UAC'll get the party live\n\n[Verse 3]\nI fall fresh upon the spirit, with the lyric that's overwhelmin'\nAnd house more hoes than Spelman\nWords I'm weldin' like James Johnson\nMy brains sponsorin' speech on the mic, I'm like a Jackson\nRappers I'm fondlin', they try to settle out of court\nBut I could never be bought\nWhat type of rebel eats pork?\nI'll take the cat and never get caught\nU-AC together we fought\n'Cause I can't see my mellows boxin' and me not boxin' wit' 'em\nI don't care who started it, I'mma be a part of it\nRegardless of the odds of how hard\nIt's been many times we was outnumbered and we still got with 'em\nI got rhythm from some boogers and some foxes\nBut a 5 becomes a 10 when a brother's off some gin\nI got juice, and this nigga scared\nI'll F your head up, like the LA Four\nWhen I flow like cash I go for broke like Melba Moore\nWhy should a male with a B.A. get more than me?\nWhen Rashid got an MC degree\nAnd a doctorate in rockin' shit, I go to Dock's to get\nA fishwich with cheese\nI don't mix with MCs, 'cause I just don't like them mother—\nBut I'm still maintaining\n\n[Hook]\n(\"Maintain the rock, don't stop the rock\") (8X in background)\nWe get the party live, ayo Chicago get the party live, yeah\nWe get the party live, 87 get the party live, yeah\nI get the party live, Common Sense get the party live, huh\nWe get the party live, UAC'll get the party live", "image": "https://images.genius.com/8cc4e9a4a27cf48a434a2d5800999430.500x500x1.jpg"}], "artist": "Common"}