{"songs": [{"title": "Soulful", "album": null, "year": null, "lyrics": "Intro [Kanye West]:\nYeah. DC. Stand up for your boy ? Oh, I go by the name of Kanye To The. The Roc is in the building. And as far as I'm concerned, we're about to bring that real soul back to the game. John Legend on the backgrounds by the way. Let's go\n\nVerse One [Kanye West]:\nFrom what I hear Kanye is killing that game very bad\nMy girl rockin' the little lamb that Mary had\nLittle bit of ghosta style mixed with Mosta style\nI'm versatile, I'm the poster child\nGettin' cheese so I'm supposed to smile\nGet it?\nWe making hits like Sosa now\nHit it!\nAnd I, hate when girls actin' boushie as hell\nAnd I already seen 'em naked like Blu Cantrell\nIf I talk to people like they stupid as hell\nDo that mean God gonna make my kids stupid as well?\nWell\nOur Father, please for give me\nI am sinner, slash winner, slash soul inventor\nC'mon\n\nChorus [Kanye West]\nIt's so soulful man [x3]\nAnd when you hear, swear it feel like soul food man\n[x2]\n\nVerse Two [Uncredited]\nLook, my mommy don't be playin' cause she know I got my game intact\nI spit them lines that make a rapper have a brain attack\nAnd chickens know I'm gonna do it like I wanna do it\nAnd miscommunication, no we never run into it\nI got chicks like Samone and Colla\nStay with lip gloss and Fendi bag beside her\nAnd your girl said she ain't ready for me\nI'm in love so mommy got me singin' Teena Marie\nHigh above the Giovanni, she ain't Gucci or Prada\nClimbin' in the Mirada, studin' like a scholar\nSo I don't even bother\nI be poppin' my collar\nI can get into your soul when I call you tomorrow\nC'mon\n\nChorus\n\nVerse Three [John Legend]:\nI know you gotta lot of stress today\nLet's hit the party like we just got paid\nNow if you really want to get away\nSay yeah, yeah\nGot people on your back constantly\nAnd you never get a second for free\nYou know you gotta get away with me\nSo say yeah, yeah\n\nVerse Four [Consequence]:\nYo, I'ma worry bout the trades and ballin'\nI'm gonna trade it all\nI'd rather catch up on my paper and evade them all\nYou sore losers picked the wrong guy to take a fall\nI probably train and fall\nFor what they made in the fall\nMade it to a never-quite-was to an overnight buzz\nCause the way I flip a metaphor, nobody quite does\nBy the time I leave the club\nI'm weighing the pros and cons\nCause she must have been a pro the way she approach the Cons\nAnd Con man is an army\nMoney boss on\nWe so big be hoppin' out when I'm tryin' to do my laundry\nBut I ain't even sorry for the way I get my doe\nCause J, Kanye and Con got that food for your soul, go!\n\nChorus\n\nOutro [John Legend]:\nSay yeah, yeah, yeah, yeah, yeah", "image": "https://images.genius.com/70c6e506a91f6dabdd23cad304812ce3.533x533x1.jpg"}], "artist": "Kanye West"}