{"songs": [{"title": "Everything I Got", "album": "Freshmen Adjustment Vol. 3", "year": null, "lyrics": "[Verse 1: Kanye West]\nNow that you're tuned in\nI suggest you zoom in\nAnd claim Puff dead\nI'm out the tomb then\nI'm married to the game like the bride and the groom is\nIf you don't want to move then leave the room here\nSee you the type of nigga believe the rumors\nBut I'm the type to show y'all what the truth is\nAnd show you how the coupe is\nAnd you don't know where the roof is\nAnd the interior is stupid\nSo I'mma shoot my shot and just do it\nCause I can't stop my love for the music\nBeen a decade since Biggie dropped \"Juicy\"\nWhen I think back sometimes I still lose it\nAnd feel the ambiance\nFrom the screams of the audience\nAnd y'all response\n\n[Hook: John Legend]\nI'mma give it everything I got, just to stay on top\nFor the love of the block, cause it's still part of me\nAnd we from Harlem, we\nGonna give it everything I got, just to stay on top\nFor the love of the block, cause it's still part of me\nAnd we from Harlem, we\n\n[Talking over hook: Termanology]\nCause we can't stop, and you don't stop, cause you can't stop\nWhat's up, rap world\nI figured I'd take this opportunity to look outside of myself and say\nWhat would I say if I was them\n\n[Verse 2: Termanology]\n9-1 Heavy D, 9-2 Mary J\nNo more Uptown\nBad Boy on the way\n9-3, 9-4 B.I.G.'s in the door\n9-5 making hits, Junior M.A.F.I.A. clique\nCraig Mack, \"Flava in Ya Ear\"\nDon't stop there, Lil' Kim posing in the panties and a brassiere\nSayin' \"Biggie Biggie give me one more chance\n\"Biggie Biggie give me one more chance\" ah man\nFly chicks, rolling in fly whips\n9-6 Bad Boy invented the remix\nThese hits got the whole world loving my clique\nThey loving the sound\nThe whole world hitting my hit\n9-7 Big passed and he went up to heaven\nOnly on the second album he already a legend\nMan I wish Big could've seen the world in '07\nMatter of fact sometimes I wish I just died with him\n\n[Hook: John Legend]\n\n[Talking over hook: Termanology]\nI miss him\nHe's still part of me", "image": "https://images.genius.com/e00085bf087c8e35e4d55ae683cbbcd7.500x500x1.jpg"}], "artist": "Kanye West"}