{"songs": [{"title": "Issues", "album": "Compton", "year": "2015-08-07", "lyrics": "[Produced by Dr. Dre]\n\n[Intro: Anderson .Paak & King Mez]\nFrom close range we official\nCocaine, money and pistols\nGoddammit I got issues\nCan't be serious\n(Alright now here we go)\nWhere my city at?\nFuck with me, come on\nI know you're feelin' that\nFuck with me, come on\nYou know I'm really that\nFuck with me, come on\nCome on, come on\nDon't even act like I ain't 'bout my business\nMothafucka come on!\nCome on, come on\nFull clip, ammunition\nYou don't wanna deal with these fuckin' consequences\n\n[Verse 1: Ice Cube]\nFuckboys should tighten up a whole lot\nI got some niggas with me down for runnin' up in your spot\nAnd these niggas got hatchets and ratchets\nSome of them lethals up under the mattress\nAnd matter of fact this is a chance to show my lifestyle out to the masses\nBut chances are I might get another negative reaction\nThink I'm a fraction, but I fucks 'em up like battery acid\nI gives a fuck what you think, nigga? This is my passion\nSurvive through the time, you know my name, you know my reputation\nYou know what it is, I don't need to give no explanation\nWhen you say my fuckin' name, add exclamation\nLos Angeles king now, make your bitch bring crowns\nTo me and Dre, you don't like it, you can lay\nThink I'm quiet cause I'm actin', but my bank account gon' say \"Fuck you!\"\nRespected from SoCal out to the Bay\nCashed a lot of checks this mornin', guess today was a good day\n\n[Hook: Dem Jointz]\nNow I lay me down\nAnd wake up to gunshots in this crazy town\nGood mornin'\nAnd the sleepers will join the fallen\n\n[Verse 2: Dr. Dre]\nBut this is what the fuck is up, doin' this for my city\nComp-town, Hub, this my fuckin' committee\nShout out to Dub C, real nigga be with me\nC-Walkin' on these niggas with a crease in them Dickies\nYou know how many nights I heard them sparks echo in the park?\nAround this time I was spinnin' records at Eve After Dark\nMy city crazy, school girls used to play with that chalk\nSame chalk police used to outline niggas we lost\nYou understand what I'm sayin'? Shit is crazy, man\nFuck the money, yo this shit could never change me, man\nThese new niggas in this bitch could never phase me, man\nI know it's strange but on some real shit it's plain as day\nI’m just havin' some fuckin' fun with this rap shit\nNigga with an attitude, still gettin' active\nMan this industry to me, it feels a little plastic\nI ain't heard nothin' that I can consider classic, ugh\nBut this is for my niggas who been runnin' with me\nAnd everybody in this bitch that's out there gunnin' for me\nAnd I got love for my people that stay one hundred with me\nI'ma keep it A1, been that way since day one\n\n[Hook: Dem Jointz]\nNow I lay me down\nAnd wake up to gunshots in this crazy town\nGood mornin'\nAnd the sleepers'll join the fallen\n(And the sleepers'll join the fallen)\nSo I lay me down\nAnd wake up to gunshots in this crazy town\nGood mornin'\n(And the sleepers will join the fallen)\n\n[Bridge: Dr. Dre]\nDrama make the city happy\nAll I think about is makin' classics\nTragic classics for the masses\nThis how you make a motherfuckin' classic (Classic)\n\n[Outro: Dem Jointz]\nThis is where I leave you\nCarry you\nIn the city of Compton\nThis is where I leave you\nCarry you\nDown the Pacific Coast\nThis is where I leave you\nAnd all your issues", "image": "https://images.genius.com/19804ba7a9b6ceb36d0158950514927a.1000x1000x1.jpg"}], "artist": "Dr. Dre"}