{"songs": [{"title": "On To The Next One (Freestyle)", "album": null, "year": "2018-06-28", "lyrics": "Hmm, that was interesting\nWhats that genre called?\nUK drill, okay uuh\nIt kinda sound like Chicago drill though\nSound like some DJ L shit\nYou know DJ L? You heard DJ L? yeah\nUhuh yeah\nLets see how long i could rap\nLets see how long they could act\nI was just up in the trap\nI had my gun in my lap\nI shoot a nigga like crabs\nI shake up, i dont do dab\nRun up on me then i run up on him with that chopper he hittin' the lab\nI add it up i add the bodies up that is the aftermath\nUp in school he wanna fight, I beat him up after class\nThen I meet at the next class and beat him up after that\nI had the last laugh\nBombin' like Baghdad, where my dad at?\nGuess he a bad dad, that was his last chance\nI am the last man, they killed everyone of my niggas\nI am the last man, this is the last stand, i got the big bands\nAy, i could rap on anything, married to a wedding ring yuh\nNeed a crown i been the king yuh, niggas funny, Jerry Spring-yuh\nI don't got time for it nuh, i just write time for it yuh\nPull up on him, god damn, I'm a up the odd got a nine for it yuh\nI feel like a chiropractor when i get it crackin' ima crack a spine\nI'm a fuck a bitch so good, she gon' let me hit it from behind yuh\nMatter fact i pull up on you wit' a chopper to yo brain and change your mind yuh\nIm at the top of the top, but its still more to climb yuh\nI change the climate, pull up on him im shining\nTwo tone skeleton A.P on the way rolly diamonds\nNiggas talkin' down to me, but all this niggas under me\nActin' like some pirates, cause they tryna rob and plung-e me\nBut I ain't got no time, I just got my 40, and i got your shawty\nOff of the molly, up in the party, she actin' naughty\nI tell her sorry I cannot fuck, I wanna play her like an Atari\nI just made [?], gotta go to Paris, coolin with [?] yuh\nVlone on me uh yeah, Revenge on me yuh aye, thats your homie\nI may kill him fuck your homie yuh aye, thats by my lonely\nOnly wanted me no cloney, I can't fuck her if she not thick, cause I really\nDon't fuck with the boneys\nYeah hm\nFuck 12, I don't fuck wit' the police\nThese niggas, fake friends, hatin', thinkin' that they know me\nI got the force like Obi-Wan, last name Kenobi\nCourse I'm with a white bitch, still catching the nose bleeds", "image": "https://images.genius.com/1ff8ab8d3ae5bb47f0797a87d42ddf66.1000x1000x1.jpg"}], "artist": "Juice WRLD"}