{"songs": [{"title": "Tweets About The Rap Industry", "album": null, "year": "2013-09-09", "lyrics": "[Gucci Mane: Rap Industry Tweets]\n\n- Everyone in the industry has a hidden agenda every person let greed n pride conquer them its sad but I been in jail so much it humbled me\n\n- I swear to God me and scooter the last real authentic street niggas left\nHow do yall let dz suckers trick yall\nBaffles me. Its ez 4 me\n\n- I was not born rich but I wake up real and go to sleep real its as effortless as breathing rappers are strippers. Gossiping but fake as hell\n\n- Fuck jeezy. Tip. Gotti. Waka.Nicki minaj drake d a Wooh.frenchy 2 chainz coachk kkaior eminem oj rock\nQuavo takeoff cardo dam g\n\n- Me and waka fuck nikki minaj dats nothing\n\n- Tell. Her intervention my dick in her throat I moved dat bitch to atl. Bitch u was sleepin n d car. Bitch. I pulled dat bitch off wayne bus\n\n- Me and waka fucked chyna tyga girl at d w south beach dats nuthin. Ask dj holiday\nEm n her mouth. Waka. N her ass. True\n\n- Ask ciara did she ride dat bike 4 gucci in cali while she was with 50 ask kelly did she cum to patchwerk and onyx while she was wit shaka\n\n- Ask. Rock. Is he holding resent ment bout Monica\n\n- Iggy wanna, suck my dick\n\n- Fucked buffy in d ass\n\n- Had a threesome with keyshia and a white girl ask coach k. N Orlando\n\n- Fantasia hit good. Dro was taking her to figure 8. She was giving head at d 4seasons wit wop\n\n- Fucking jeezy main thang currently ask her\n\n- I wanna fuck tiny lil ugly ass\n\n- Tell craig n julia suc my dick at Atlantic records\n\n- Tell big cat. N Jacob. Stop fucking kids. Jacob\n\n- 250. 4 waka. I gave him. A mill. Myself. Eat ys mom a ass\n\n- Vanessa at xxl\nU a, true groupie\nFat piece of lard\n\n- Gotti been wanna b gucci n. Jeezy\nWe call him guzzzyI fuc all. Ya hoes. U kno dat U can hit mine. I thought real niggas share hoes\n\n- I break hoes and make hoes gotti suspect And he fearme remember I got a sacvideo. Gotti maliah yoris keyshia dior jessicakod I fux all dem\n\n- Real recognize real If im lying Tiny pretty and keysha dior a church girl. I fux all d hoes I love trickinoff this 5m a year in showmoney\n\n- Just seen. Rocko. Ge ask me. One question. All most was. With his maker. Who next. He cried like a ho. 'n' ran\n\n- Rocko. Cum back lets finish our talk bitch\n\n- I should have went in his pocket. He had a switchblade. Lol. Brah. Bring me. A. Combo from Mcdonalds I got u dollar menu ass rappers\n\n- Tell tyga. Thas asshole hit good. Chyna. Free. Stan. My haitian boss. Nigga\n\n- Rozay join list. Police ass nigga\n\n- Nikki minaj. Keysha dior taraji p henson n monica. That's a street nigga fantasy\nI got 10k apiece. Im horny errbody wear tennisskirts\n\n- Warner. Mizay. Atlantic. Shapiro firm\nEmanon management asylum records bsm. Get ready 4 audit no deal 4 waka sell ya ghost bitch 1m\n\n- Who wanna buy d tape of rocko running and guwop kickin him in ass. Wit my house shoes on lol. I want 250k\n\n- Waka on drake tour drake giving u 6k a show. U a ho. Fly to iceland redo dem silver dull ass bsm chainz\n\n-Tell drake he a true male groupie\nI don't need u u 2 much a, sissy stop tryin b me. Chec dat bitch instagram. True groupie\n\n- Scooter 500.k And. Thugg 250k waka 2m\n\n- No. I change my mind ill keep waka\n\n- Rocko u so scary u ran tell d truth I want sell to worldstar\n\n- Ask waka did we run a g on tyga girl\n\n- Waka did video wit flo nikki tyga and chyna was there pregnant. Me n waka was laughing inside joke tell nikki call rocko I just took that\n\n- Freakhowas not allowed at eagles landing landing country club.So I put her up at microtelOff 675 room rate 60 wit tax. Crazy head ass hard\n\n-Nikki u a g ho\n\n-Bitch u booty feel like box Chevy nikki u ain't suck me and waka dick at d microtel\n\n-I got pix. Who got millions\n\n-Waka did video wit flo nikki tyga and chyna was there pregnant. Me n waka was laughing inside joke tell nikki call rocko I just took that\n\n-I got pix of nikki n my bed I got tape off rocko begging 4 his ?got pix of 3sum k kaior. Dm askdem ciara kelly fantasia mya buffy maliah?\n\n-Waka. U bring me 500 cash. U can have ya career back 100 percent walk away but u broke\n\n-Stop flexing momma boy. She stole yo money 2 dumbass fake gangsta\n\n-I prefer 100z\n\n-Tell frenchie sell his ass 2 help u\n\n-And ya momma fuck nigga. Ill sell ya contract 2 slick pulla fa 750 kcash\n\n-I wanna take rihanna to bet awards in atl.cuz She b fucking wit sum lame ass niggas\n\n- My album been turnt n. Kori mixin n masrering 4 last week. Yall niggas stop asking to b on my album u ain't no trap God yall sum hoes\n\n- Polow stole my song medicine dold it 2 plies he put keri on my song. N dud video polowddon itsOnsight ibput dat on bam my son\n\n- [Young Throwback ‏Interlude]\n@gucci1017. Eh this gucci brother sum1 hack brah twitter. Yall tr y sabotage brah. Dat messed up let gucci b. GOD kno d truth. Hackers\nRetweeted by Gucci Mane", "image": "https://images.genius.com/6f0a4980c8ef838036229e1d4dcd036c.408x408x1.jpg"}], "artist": "Gucci Mane"}