{"songs": [{"title": "Hold", "album": "KRS-One", "year": "1995-11-07", "lyrics": "[Produced by KRS-ONE]\n\n[Verse 1]\nI'm thinkin' real hard about some money I can hold\nBut everybody I know is deep in the hole\nA steady payin' job is too hard for me to hold\nI call around for work but they puttin' me on hold\nBut in my hand a shiny .45 is what I hold\nI make a mayonnaise sandwich out of some whole-\nWheat, I'm feelin' weak, I can't hold\nI gotta rob somebody tonight and take the whole\nBank roll, some cash I gotta hold\nAt the bottom of my shoe is a little bitty hole\nThat's it, my mental sanity I can't hold\nI'm walkin' to the store with this pistol that I hold...\n\n[Verse 2]\nHalf of me is sayin' maintain and uphold\nSuddenly I bump into some asshole\nHe's cursin' me out, but this pistol that I hold\nTook control, and in his head I put a hole\nAhhh man, now I'm lookin' around the whole\nArea, the gun is still hot that I hold\nI'm buggin' out, and I don't know how much longer I can hold\nI feel myself sinkin' deeper in the hole\nSo in my victim's pants I rip a little hole\nAnd felt for the wallet, and took the whole\nBill-fold, forty bucks is what I hold\nSuddenly I hear, \"Freeze! Police! Hold!\"\n\n[Verse 3]\nIn the penitentiary I see a whole\nBunch of blacks and Hispanics that they hold\nIn my cell I cry like hell, my head I hold\nOne day somebody ax if my shoes they could hold\nI told this guy, \"Listen! My shoe's got a hole\nBut what's up with that shiny sharp knife that you hold?\"\nHe lunged forth, the first thing that I thought of was to hold\nThe arm with the knife so that he couldn't put a hole\nIn me, but then I put him in a chokehold\nTook the knife and in his neck I put a hole\nSuddenly all the C.O's come to me and it's me they hold\nBeat my ass and I spend two weeks in the hole\nI'm ready to bug out, my sanity I can't hold\nMy needs and wants messed up my life on a whole\n(Damn, just wasn't satisfied with life)\n\n[Outro]\nThe moral to the story is...\nYour addiction to your needs and your wants\nIs what causes problems in your life\nMake sure you got what you need\nPut at a safe distance all the things that you want\nIt's wants that get you into trouble\nThis is the balance of life\nThe balance to life on a whole", "image": "https://images.genius.com/78316fa7efcf948425107910e5b3a92b.300x300x1.jpg"}], "artist": "KRS-One"}