{"songs": [{"title": "Turn Off the Radio", "album": "AmeriKKKa’s Most Wanted", "year": "1990-05-16", "lyrics": "[Intro]\nA message to the Oreo cookie:\nNo matter how much you wanna switch\nHere's what they think about you\n\n[Sample]\n“You gold teeth, gold chain wearing, fried chicken and biscuit eating monkey, ape, baboon, big thigh, fast running, high jumping, spear chucking, three-hundred-and-sixty-degree basketball dunking, titsun, spade, Moulan Yan. Go the fuck back to Africa. Go the fuck back to Africa. Go the fuck back to Africa.”\n\n[Interlude]\nThink about it, fuckin' sellout\nHere we go on station 103.787 and we're listening to…\nWe won't be listening to, uh. Ice Cube, Amerikkka’s Most Wanted Because that’s bullshit get that shit outta here\nStraight R&B, straight R&B, straight R&B\nWhere the motherfucking plug at? I'm about to disconnect his ass\nTurn off that motherfucking radio\n\n[Verse 1]\nTurn on the radio take a listen\nWhat you're missing\nPersonally I'm sick of the ass-kissing\nWhat I'm kicking to you won't get rotation\nNowhere in the nation\nProgram directors and DJ's ignored me\nCause I simply said fuck Top Forty\nAnd top thirty top twenty and top ten\nUntil you put more hip-hop in\nThen I might grin but don't pretend that you're down with the scene\nAnd go and dis me in a magazine\nHow could you figure the brother could dig ya\nDJ face down in the river\nNo it's not a threat but a promise\nI'm as\nCrazy as they come see\nMama didn't love me\nAll I got is my nine\nAnd to calm the savage beast here's the Alpine\n\n[Interlude]\nTurn off that bullshit!\nTurn off that motherfucking radio!\nTurn off that bullshit!\nTurn off that motherfucking radio!\nTurn off that bullshit!\nPlay the music motherfucker put the music on\nDamn!\n\n[Verse 2]\nTune in to the radio listen for a minute\nYo G stick a fucking tape in it\nCause all the radio do is gangle\nThat R&B love triangle\nIf you're out there kicking it with the brothers\nYou don't care about lovers\nYou wanna hear a young nigga on the mic\nGoing buck wild\nThrowing and flowing and showing new styles\nThat's where I'm coming from\nReality that's what they're running from\nSo if you're down with Ice Cube let me know that you know\nYo turn off the radio\n\n[Interlude]\nYou know what? You know what?\nBasically those black guys and those rap guys\nThey don't know what the fuck they're doing\nI hate those fuckers\nI hate em\nEspecially that one guy\nThe AmeriKKKa's most wanted\nIce Cube--I hate that fucker\nGet him off the air, get him off, get him off\nGet that rap shit out of here!(3179024)\nJust get me a gat so I can smoke this motherfucker!\n\n[Outro]\nHello?\nHi, this is D.E.L\nHey, I'm calling from 3838 Twin Oaks Way\nYeah, I just wanted to call to say fuck the radio!", "image": "https://images.genius.com/1cb382d2d9fb4a9bfa94e3074c1aa220.1000x1000x1.jpg"}], "artist": "Ice Cube"}