{"songs": [{"title": "Pimpology", "album": "Short Dog’s in the House", "year": "1990-09-11", "lyrics": "[Intro:]\nPretty Tony: That nigga wanted the honey, all we wants is the money\nY'know, all bitches are the same, just like my hoes. I keep em' broke. Wake up one morning with some money, they subject to go crazy y'know\n\n[Verse 1:]\nI'm going to tell you a story in stereo\nAbout the pimping game, that you should know\nBut if you don't, it's alright\nCause I'll be spittin' this game to you all damn night\nWhen I was 3 years old\nStraight pimp game I was told\nMy daddy sent me to a pimp school\nIn this man's world, you can't be no fool\nIf a pimp is what you wanna be\nYou're gonna have to learn pimpology\nPimpology: a pimp's profession\nCan't be affected by the Great Depression.\nSo if you want to be giant sized\nCome to my school. Get pimpmotized\nIn your school, what do they teach?\nEnglish, math, and history\nPimpin' game, you can learn\nAnd if you do, you will earn\nA pimp diploma, just for you\nFor learning what you're taught when you come to school\nLesson 1, you should know:\nNever love a bitch or a ho\nLesson 2 tells you to do only one thing:\nAct cool\nLesson 3:\nBreaking a bitch. If she's poor, if she's rich\nIf your game is soft or hard\nIt shouldn't take long to break the broad\nLesson 4:\nKeep your ho. It's the most important thing to know\nCause I pimp or die bitch. I'm like the Mack:\nRiding around Oakland in a Cadillac\nBut on the other hand, if you just can't pimp\nAnd the hoes keep treating you like a simp\nI don't know what to say about you boys\nYou better go to the store and buy some toys\nCause you can't play this game\n\n[Interlude:]\nPretty Tony: Next time you hear grown folks talking, shut the fuck up, y'hear?\n\n[Verse 2:]\nNow you heard my story in stereo\nAbout the pimpin' game, that you should know\nBut if you don't, it's alright\nCause I'll be spittin' this shit to ya all damn night\nIt don't stop\nI'm Short Dog, ain't nothing nice\nI never rap fake when I'm on the mic\nI ride around town in a clean ass Benz\nNever ever frontin' on my cool ass friends\nMy zodiac sign is of Taurus the bull\nI drink Olde English, and I do get full\nIf you're wondering why I don't stop my rap\nCause other MC's can't rock like that\nMy music flows like dominoes\nI pimp these hoes, that's how it goes\nBitches on my beeper all day and night\nI'm a motherfuckin' player, homeboy, that's right\nO-A-K-L-A-N-D:\nThat's where I reign, top dog MC\nToo Short, baby, on the microphone\nI work motels. I don't take freaks home\nMan, they start trippin' when they think your rich\nMet her yesterday, now she's my bitch\nIt's not hard to believe. But that's how it goes\nI'm burning rubber on these hoes like vogues\nCheck out my style, baby don't stop\nIf you can't call me Short, just call me Dog\nBlack is my color, I have no other, nothing else will do\nI've got a black car, black bed, black TV\nI've even got a silk black suit\nDangerous music, and the Dangerous Crew\nOakland California, and Playboy too\nWest coast rapping all over the place\nToo Short, baby, all in your face\nI rap so hard...you can't stop me\nMy last album sold a million copies\nMe and the maestro, laying the beat\nDJ scratches from my homeboy Pee\nDangerous music is what you hear\nA new LP every year\nYou know we rolling, can't be faking\nWe come through and all your girls we're taking\nYou know we're rolling. Don't do no simpin'\nOaktown players strictly pimpin'\nBitch, my name is Short. Just what you've been looking for\nSending young tenders on a wild goose chase\nUp in the hills, trying to find my place\nGetting lost, getting tossed, getting found and clowned\nEvery time you see Short baby, you get down\nCause the raps I make are the raps you like\nThe way Sir Too Short rocks the mic\nIt's a one of a kind rapping style\nHave the freaks in the crowd, going wild\nFor when I spit my rhyme, what's my tip?\nBitch, bitch, bitch, bitch make me rich\n\n[Outro:]\nGoldie: It was $35,000\nSlim: $35,000 cash money?\nGoldie: No. I get 1. $35,000 plus 1, right?\nSlim: The one I gave you?\nGoldie: No, I gave you 6 alright. I had 1. Now $35,000 plus 6, right? Now $35,000 plus 1, plus 6 makes 7. $35,000 plus 7, right? Muthafucka, can you buy that?", "image": "https://images.genius.com/354fed0b5f5b1d6e18186fae903238d6.930x927x1.jpg"}], "artist": "Too $hort"}