{"songs": [{"title": "Nothing But A Hero RMX", "album": "Young, Broke, and Infamous", "year": "2010-12-17", "lyrics": "[Intro]\nAlright\nIn the sky it's a bird, it's a plane, nah, who that?\nEverybody want me to save 'em, I can't do that\nGot a little shine and they wonder where the loot at\nThe life of an artist, I had to pursue that\n\n[Verse 1]\nSuperman all the time, yeah, true that\nThat's why I laugh, when they ask, \"Man, where the suit at?\"\nI love my family, love my friends\nBut when it comes down to money see it all depends\n'Cause now I got new family, I got new friends\nThat I never even seen before, where does it end?\nSee, I got loved ones and I got enemies\nBut at the end of the day, I don't know their identities\nAre they loving entities or people\nBefriending me for the fame?\nBreaking in the game, life'll never be the same\nIt'll never be the same, and they all like\n\n[Hook: Tabi Bonney]\nYou are my superhero\nI said it, I said it\nYou are my superhero\n\n[Verse 2]\nI was gone for a minute, came back in a flash\nSpit crack, up a dude's rock, like dash\nAny dame, know I got game, go ask\nThis is my true identity, no mask\nMost wish to get it and rub on a flask\nI wish to get it and rub on her a—\nHip-Hop, what I'm talking 'bout, you ain't on\nAnd a metaphor, means I am hands on\nOut for the green, with a buzz, like Hornet\nI ain't rip the game yet, I just torn it\nSee? The good guy gets the dame\nAnd if a shawty got a donk, like Lois Lane\nI turn into the parapalegic, from X-Men\nYou ain't get it? I'm all about the brain\nStep to the mic, he a beast\nHungry in the game, still looking for a feast\nAll about my dough on the rise like yeast\nAnd I'ma keep going 'til I motherfucking decease\nSee I stood on the side humbly, like Alfred\nBut now it's time, to jump in the bat outfit\nAnd I could give a damn, if you doubt it\n'Cause when I hit the stage, they shout it\nUh, yeah, they shout it, what'd they shout? They shout\n\n[Hook: Tabi Bonney]\nYou are my superhero\nI said it, I said it\nYou are my superhero\n\n[Verse 3]\nKnow the flow never awkward, man\nStepped in the booth, they like, \"I'll be damned\"\nKid opened his mouth and shocked me, man\nAnd I get the honeys wetter, than Aqua-Man\nSee? That's that sex appeal\nI guess that'll add another mill', to the deal\nBut right now, I'm just tryna get a meal\nIn the Bat-cave, sharpening the skill\nWith an Iron-Man mindset, they can never steal\nVillain on the mic though, yeah, I had to kill it\nI wrote this rhyme, in braille, just for you to feel it\nLet the flow pour for a minute, but I gotta seal it\n\n[Bridge]\nHopefully now, y'all know me, got a grip on the game\nLike it was fresh up out the Sony\n\n[Hook: Tabi Bonney]\nYou are my superhero\nI said it, I said it\nYou are my superhero", "image": "https://images.genius.com/0f21a1e2589d732e4a263527296e9f51.500x500x1.jpg"}], "artist": "Logic"}