{"songs": [{"title": "Kon Queso", "album": "MM.. FOOD?", "year": "2004-11-16", "lyrics": "[Verse]\nGive it a sec for the pain to start\nThis wreck right here, it ain't for the faint of heart\nThey thought they saw the worst verse\nFrom the team of G men who seem like nerds at first\nOnce they get to know us people dig us\nLeaders in the fight for equal rights for niggas\nInventor of the more dementeder flow, no bout a-doubt it\nThis go for if you're bout it bout it or rowdy, rowdy\nWhatever's clever, the master fold\nWho every hooker heard of, but now ho know\nIf we see tomorrow, the next day classes\nThe Villain in the back with the x-ray glasses\nHave no fear, the ninja here\nFeel 'em like the tinge in your ear from drinking ginger beer\nWhen it's on, loco head gon' lay low\nAnd heat it like beef patty, coco bread kon queso\nIf you say so lace the whole case load\nThey say he wear a metal mask in case his face show\nHe told 'em they flows is bitch talk and ayo's\nHis whole crew walk with pitchfork and halos\nSay, ho, if you never worked a J-O\nAnd keep more cash in the stash than a peso\nOkay, yo, y'all know who to follow\nTie 'em up in the crib and leave they place hollow\nOh, shoot, the goose is loose\nSo wild you couldn't chase it down with straight fruit juice\nFrown like the first time you taste cous cous\nStash the deuce deuce, troops asking truce, truce\nToday on intense wreck week\nWe have the super villain in his own defense to speak\nIt's all part of my mental techniques\nAvailable to freaks and pencil neck geeks\nTrain a sane brain to an insane train of thought\nOn a campaign trail he came to gain your support\nCharge cash for a autograph\nSay some shit to make your daughter laugh then slaughter the ass\nSee 'em on the big screen like Steve McQueen\nDo something and never be back once he leaves the scene\nKeep more medicated pads than Stridex\nFor his own side wreck with no known side effects\nBefore you press charges use your noodle\nSo what when he grab the mic he crush your cute cuticles\nKeep your mouth shut, everything will be beautiful\nIt would be awfully rude to you, now get back to your hooty hoo\nDamn it, it ain't worth the drama, can it\nFrom the calm bandit eat rhymers like pomegranate\nSoon as he stepped in, he lit the room\nBoom, reschedule my noon with Britt Hume\n(Doom!) In love with Mary Jane, she's my main thing\nPulled her right from that web head, what a lame brain\nMaintain and say it, don't spray it\nYou wanna see your girl again, you might as well pay it\nIf I had a dime for every rhymer that bust guns\nI'll have a cool mil' for my sons in trust funds\nWhen I was broker than a broke dick dog\nI always kept a L to smoke in thick fog\nWhen it rain, it sure do thunderstorm\nI got more rhymes in the summer than musty underarms\nOne, two, microphone checker\nFirst learned to neck off a Home Ec homewrecker\nThis is back when he was like crib age\nWhen he hit the stage, it's like a gauge to the rib cage\nBreak the mic like a rock star, break a guitar\nAnd jump off the stage like, \"Yee haw!\"\n\n[Outro Skit]\n(UN leader): We shall now vote for a new world leader. I nominate, DOOM. All in favor, say I\n(Delegates (In unison)): I\n(Peter Parker): Oh no\n(DOOM): DOOM is master of the world\n\n(Voice 1): We must hurry\n(Voice 2): If you are really with us, prove it. Let me hear you say it. Tell me that DOOM is a tyrant and must be overthrown\n(Voice 1): I-I have spent my life\n(Voice 2): Say it! You have spent your life serving a tyrant. DOOM must be stopped\n(Voice 1): I fear you're right, my friend\n\n(DOOM Cronie): The President of the United States is on the phone\n(DOOM): Mr. President, you're at the mercy of your deadliest enemy\n(President): It is time you learned once and for all, DOOM. The united states does not barter with terrorists\n(DOOM): You never learn, do you?\n\n(Voice 1): Here, this is the address of friends in New York. They'll help", "image": "https://images.genius.com/f67af5eb94d7101171adfff4ca96a76c.1000x1000x1.jpg"}], "artist": "MF DOOM"}