{"songs": [{"title": "Cuttin’ it Up", "album": null, "year": null, "lyrics": "[Intro: movie sample]\nSo ya puttin' all ya subs now, huh?\nYea, ya doin' real good?\nAin't you gonna introduce me to ya friend, here?\nWell I'll introduce myself, excuse the glove\n\n\"Get ya shit beaten\" - Prodigy of Mobb Deep (sample repeated)\n\n[Intro: Raekwon]\nAww shit, these niggas out here, hold that\nPicture that nigga, all the real niggas, yo, come on\nYea, word up, I look good right?\nYo, aiyo\n\n[Raekwon]\nPut my money on the real kings, reveal the rings\nRocks swing, stayin' bling-bling in Ossining\nJet mack packages, feast to light it up and beast it\nCordially invited, the motto is eat this..\n\n[Polite]\nYo, what up, Lex? (What up son?) Yo it's on again\nYo, it seem like niggas want war again\nIf you ain't know, bet ya niggas heard of me now\nCan't stop me, best bet, murder me now\n\n[Chip Banks]\nAiyo Lex, put ya diamonds on\nGrab ya vests and ya nine, cuz it's on\nI rep Harlem World where they hustle at\nAll the way to B.K. where they bust you at\n\n[Raekwon]\nYo, yo, gun on 'em in the x-rays\nReal niggas lay tired of it\nNigga violate it, cut him in the face\nVivid hand Glock, loopin' the dance, shoot him in the ass\nLike cupid, dealin with an old place, stupid\n\n[Polite]\nYo, yo, ain't a team allowed to know, fuckin' wit this\nNiggas mad like I'm fuckin' they chick\nSee me stuck in the whip, gun in the hip, one in the head\nTen in the clip, niggas is dead, they imposters\n\n[Ghostface Killah]\nI used to bubble dimes, in the goose, I use to cuddle nines\nAnd double the fact that you dare think that you can trouble mines\nBig guns is layin', Timothy McVeigh 'em\nBroad day 'em, push 'em all the way in\n\n[Raekwon]\nAiyo, dred's in the bloody rep\nYeah, yellow canary Lex', specs on, movin' like vets\nTri-boro, thoroughest thugs move like DeNiro\nHeat out, extortin' the heroes, 4/5 singles\n\n[Hook: Polite (with Prodigy sample)]\nAiyo let's go get dough\nBust slugs in the club, thugs get low\nBitches showin' me the thong like I'm Sisqo\nUp in the six, yo, watch his wrist glow, damn, it be sick though\nThis be the shit though\nYou ain't know, got ya moms in the disco\nSingin' the intro, shakin' the ass like the nympho\nTime to move, nigga, we in, time to catch wins\n\n[Ghostface Killah]\nFor magical mixes, remix the hell outta the Bible\nLike strip it and switch the whole title\nRobes hit the floors, shoes is buffed\nGold studded bracelets, handcuffs, they gave it up\n\n[Raekwon]\nTeach niggas how to resolve a big mob\nKeep niggas on beat, fuck around and di-ie the mid-ob\nNiggas gonna bump what, yeah, you wit it whatever\nLet's body these niggas, a lot of niggas bump, yeah\n\n[Polite]\nYo, yo, never been the type to hold a grudge\nDid five, I was guilty, fuck the judge\nThe Ave. got mad when I slid back through\nIced out, just came home and I blew\n\n[Chip Banks]\nWe like, them frisky, rich and poet-esque\nIf it's chilly on our neck, then it's cold on our wrists\nThe cash flow is nuts, come through 8th Ave\nAnother hundred style, burn out for doughin' us\n\n[Trife]\nAiyo, the hood's off the hook, hooded up crooks\nPlay the back burner wit black burners layin' for the juks\nI'm too live, heats be the same as my shoe size\nFresh out the box, just copped a pair of new nines\n\n[Killa Sin]\nYo, my team is like nitro, it might go boom when the lights blow\nCatch you in the spinal wit the same knife from Psycho\nMy mic flow like Michael on the ball court\nAll pro, result of this Cream Team, niggas is all out\n\n[Hook]\n\n[Outro: Ghostface Killah (Prodigy sample)]\nAiyo, rep for ya town (\"Get ya shit beaten\")\nUptown, break it down (\"Get ya shit beaten\")\nStaten Island, break it down (\"Get ya shit beaten\")\nB.K., break it down (\"Get ya shit beaten\")\nQueens and Bronx get down (\"Get ya shit beaten\")\nThrow ya hands up right now! (\"Get ya shit beaten\")\n(\"Get ya shit beaten\")", "image": "https://images.genius.com/32fabf2b8b2eb256a0e1d6a14a76852f.500x500x1.jpg"}], "artist": "Raekwon"}