{"songs": [{"title": "Don’t Worry", "album": "The Documentary", "year": "2005-01-18", "lyrics": "[Verse 1: Mary J. Blige]\nCan't wait 'til we make real love\nBecause these conjugal visits just ain't enough\nI'm really looking forward to a future for us\nBaby don't worry 'bout it\nI'mma beeee right here, waitin on you\nEven took a second job\nSo they won't take the clause and put a lean on the\nHouse\nI know it's gonna be a while before you get out, ooh\nBaby don't worry 'bout it (don't worry)\nI'mma beeee right here, waitin on you\nAnd them dudes you ran with are foul\nThey been tryna get at me, ever since you been down\nEven my girls are tellin me, I should end it all now\nBaby don't worry about it\nI'mma be {*cell door slams*}\n\n[Verse 2: The Game]\nAll I can think about is that honey complexion\nAnd the way your skin glow when you slippin on them Dior dresses\nI know you wonderin why I got you a Smith 'n Wesson\nCause them niggas in the hood is the reason we stressin\nI miss that gangsta love and that lil' affection\nThem butter soft lips when you kissin my chest and\nMary I put nuttin above you\nAnd behind that vest I got a heart ma gangstas need love too\n\n[Verse 3: Mary J. Blige]\nSome think the worst of you\nThey portray you as a man, it's not that far from the truth\nYou were caught up in the game and now it's, caught up to you\nBaby don't worry about it\nI'mma be right here, waitin' on you\n\n[Verse 4: The Game]\nIt used to be caramel skin tones, Sprewell rims on\nGlass house, ass out, Jacob watch, gemstones\nBandanna, Nike Airs, tennis bracelet, wife hair\nBlack rag, do or die, .45 right here\nEvery time I was down, you was always right there\nWhenever visitin hours came, I know my wife there\nSo pink diamonds right here, chain hang, ice there\nThe reason for my tattooed tear - I need you to hold me down\n\n[Hook: Mary J. Blige]\nI'll be waiting on you (I'lllllll)\nI'll be waiting on you (I'ma be right here whenever you call me babe)\nI'll be waiting on you (ooooh-ohh)\nBaby don't worry about it\nI'mma be right here, waitin on you\n\n[Verse 5: The Game]\nI'm locked up countin the days down\nTryna hold my head cause the penitentiary ain't no playground\nI'm dyin in here and I don't know how you stay down\nIn the shootin range twice a week bustin that trey-pound\nI would never ask you to wait around\nBut how do a white sandy beach in St. Tropez sound?\nAnd no more outta town trips on that Greyhound\nJust me hittin like a beat from Dr. Dre, out\n\n[Hook: Mary J. Blige]\nI'll be waiting on you (I'll be waiting)\nI'll be waiting on you (I'ma be right here, for you baby)\nI'll be waiting on you (I'll)\nBaby don't worry about it (don't worry babe)\nI'mma beeee right here (I'ma be) waitin' on you\n\nI'll be waiting on you (I'ma be right here waitin for you baby)\nI'll be waiting on you (you know I-hiiiiiii will)\nI'll be waiting on you (whenever you need me baby)\nBaby don't worry about it (I'll be right here, I'll be right here)\nI'mma beeee right here, waitin on you (don't you worry)\n\nI'm lookin for a future with you baby\nWanna see you real soon, real soon, real soon\nI'll be right there, I'll be right therre\n(Baby don't worry about it)\nDon't worry, don't worry\n(I'ma be right here, waitin on you)\nDon't worry...", "image": "https://images.genius.com/395930cce0f4587e3046d2e0a817502c.900x900x1.jpg"}], "artist": "The Game"}