{"songs": [{"title": "Just Like Daddy", "album": "The Don Killuminati: The 7 Day Theory", "year": "1996-09-26", "lyrics": "[Intro: 2Pac & E.D.I Mean]\nOutlawz, go ahead, in this\nNo doubt\nDeath Row, Makaveli Records\nYou can call me daddy, uh\nI'll be ya daddy, that's right, uh\nJust like daddy\nFo' the ladies\nHahaha\n\n[Chorus: 2Pac & Singer]\nCome with me and in time we'll grow\nDedicate slow jams on the radio-oh why\nKnow ya happy, I can feel ya passion\nLookin' out for ya just like daddy, come on\nSunshine turns to rain\nBaby, I can take away ya pain\nIf ya trust me\nClose ya eyes, feel the magic\nNever leave when ya need me\nI'll do ya just like daddy\n\n[Verse 1: E.D.I. Mean]\nI met her when she was younger\nReal daddy died when she was younger\nHer moms let her do what she please, an' seen no one loved her\nHer eyes shined of love, a diamond in the rough\nThe kind that you could love; not yet touch, but so much, potential\nYoungster let me guide ya mental\nAnd to a place, with a sourness of pain you'll never taste\nBy God's grace, you was born with that face\nNothin' but pure beauty; so for an eternity, I feel it's my duty\nTo be a souljah (souljah) yeah, baby got plans to mold ya\nIn the coldest nights is when I hold ya\nLike I'm supposed to, as we roll closer\nI'll take yo' hand gladly, anything you need, ask me\nSupportin' my baby girl just like daddy\n\n[Verse 2: Makaveli]\nTo alleviate the stress, spendin' time wit' you, I feel blessed\nWhen you gone, feel the pain so strong deep in my chest\nWhen I got arrested, came so close to goin' to jail\nThrowin' blows at the po-pos breakin' ya nails\nScreamin' loud goin' all out, damn I did\nYou stayed locked down at moms house, watchin' the kids\nThrough the whole bid in the V-I, I see ya daily\nWhile my fake homies try to fuck you, you run and tell me\nThat's why I stay committed, I thank God every time I hit it\nHopin' you'll forgive me for all the times I bullshitted\nMe and you against the world, we untouchable\nScreamin' like you dyin' every time I'm fuckin' you\nYa never had a father or a family, but I'll be there\nNo need to fear so much insanity, and through the years\nI know ya gave me your heart, plus\nWhen I'm dirt broke and fucked up, ya still love me\n\n[Chorus: 2Pac & Singer]\nCome with me and in time we'll grow\nDedicate slow jams on the radio-oh why\nKnow ya happy, I can feel ya passion\nLookin' out for ya just like daddy, come on\nSunshine turns to rain\nBaby, I can take away ya pain\nIf ya trust me\nClose ya eyes, feel the magic\nNeva leave when ya need me\nI'll do ya just like daddy\n\n[Verse 3: Yaki Kadafi]\nBoo, would ya die for me?\nDown holdin' my pistol, gettin' high\nWith mean sounds tougher than bristles\nBut when you cry I'll be ya tissue\nBack in the county written letters, how I miss you\nGivin' you credit, apologetic how I diss you\nKiss you for thinkin' like a mona and on a level\nAnd sometime daddy ready to wine ya and dilation\nFor a total twine ya, we right behind ya true\nLife just me and you, no tellin' what we could do\nGettin' high between the sheets, make the shit right here discrete\nPuttin' hickeys on ya belly while we fuckin' on the beach\nI love it when ya nut up and grab me\nI feel for ya badly, baby girl just like daddy\n\n[Verse 4: Young Noble]\nShorty I lend my hand out ta help ya, lost soul lookin' for shelter\nOn late night accept it, treat ya good, won't disrespect ya\nMy age is young, out of place bitch days is done\nFrom a trixy to a missy, you know I raised ya hun\nPlaced her under my wing, showed her how we swing\nNow she rolling blunts for her king\nOne day labelled thug misses, the essence of my ghetto sisters\nHugs and kisses, that's just for me to be a father figure\n\n[Chorus: 2Pac & Singer]\n(Just like daddy) come with me and in time we'll grow\n(Just like daddy) Dedicate slow jams on the radio-oh why\n(Just like daddy, c'mon) Know ya happy, I can feel ya passion\nLookin' out for ya just like daddy, come on\n(just like daddy) Sunshine turns to rain\nBaby, I can take away ya pain (Just like daddy)\nIf ya trust me\n(Just like daddy, come on) Close ya eyes, feel the magic\nNeva leave when ya need me\nI'll do ya just like daddy\n\n[Outro: 2Pac]\nC'mon\nThrow ya hands up\nPut ya hands up\nThrow ya hands up\nPut ya hands up\nThrow ya hands up\nPut ya hands up\nPut ya hands up\nThrow ya hands up\nWhere my sistas?\nWhere my sistas at?\nWhere my sistas?\nWhere my sistas at?\nWhere my sistas?\nWhere my sistas at?\nThrow ya hands in the air\nWhere my sistas?\nWhere my sistas at?\nWhere my sistas?\nWhere my sistas at?\nWhere my sistas?\nWhere my sistas at?\nThrow ya hands in the air\nCome on\nYes\nYes, just like daddy\nYes, throw ya hands in the air, come on\nOutlawz in this mutha fucka (Yes!)\nNo doubt!\nKadafi, Hussein, Makaveli, Napoleon, Marbles, EDI, Kastro, Khameleon, Storm, Yeah the bitch check\nNo doubt get yo money\nThrow yo hands in the air\nYeah, just like daddy baby\nKnow you got somewhere to go tonight\nCause you a thug nigga, thug nigga that loves niggas!\nHahahahahaha\nCome on\nJust like daddy\nOutlawz baby, outlaws, outlaws outlaw, outlaw\nThrow ya hands in the muthafuckin' air", "image": "https://images.genius.com/de81f90d8bf5ccdc5b74c71182edc9d2.600x600x1.jpg"}], "artist": "2Pac"}