{"songs": [{"title": "Good Guys Left Behind", "album": "Knock Madness", "year": "2013-11-26", "lyrics": "[Intro]\nI know I don't usually make love songs, but there's a few\nSpecial girls who kind of changed my perspective on everything\nAnd I feel like every guy comes to that point in his life\nWhere he changes from a boy into a man\nSo yo, this one is strictly for the ladies, only\n\n[Verse 1]\nSee when I met your stupid ass up at the mall on accident\nI thought you was the baddest chick I ever seen but that was so inaccurate\nYou stole my heart like you had done some magic trick\nYour essence was so fabulous you also had a sexy look and rack of tits\nI only had intentions to respect your ass and that was it\nI took you for a walk under the moon, we joked and laughed a bit\nThe chemistry was there, right where we met I had to act on it\nAt that moment I knew you was the girlfriend that I had to get\nWhat happened bitch? I swear you had me mad sprung\nOur first time hanging I could've did more than I had done\nBut I didn't because I was nervous, in my heart, you had reserved a place\nSo sexing you just wasn't on my mind cause you were worth the wait\nShit got to a point where you started cancelling dates we made\nGave me crazy rage, you had me thinking you hate me, great\nYou vanished with no signs and I didn't even know why\n'Til I found out you had a fucking boyfriend this whole time\n\n[Bridge]\nWhy couldn't you just tell me?\nYou had me buying plane tickets to go see your stupid ass\nThen you cancelled on me at the last minute talking about you busy\nBitch, I'm busier than you and I still make time for your bitch ass\nFuck you!\n\n[Hook]\nI should've fucked you when I had the chance to (the chance to)\nNow I'm sittin' alone in my house and I'm wishin' you'd call me right now\nBaby, perhaps I should have been less nicer than I was to you\nCause this seems like all the good girls go for bad guys\nAnd good guys get left behind\n\n[Verse 2]\nI swear I'm sick of this, bein' stuck in predicaments\nGettin' the shitty end of the stick and it's never different\nHours spent on the phone as I'm listenin' to your gibberish\nBlah-blah-blah your mind was scrambled I tried to configure it\nI'm not one you should move past, these player guys, you choose that\nTo me, you're worth a lot more than what they had valued you as\nOnly reason they hollered was because you got a cute ass\nThey just want you for sex and then they move on to a new task\nYour actions show your true class, I think you're moving too fast\nDatin' these strangers can be dangerous, they rarely do last\nBut you just too blinded to see, just like a disease\nThe guy that you been lookin' for is more than likely me\nBut now I'm on some \"fuck you\" type shit\nYour mind is so indecisive, bitch, cry\nI'll no longer be ya tissue you can wipe with\nYou just triflin', you get screwed so much\nI'm thinkin' that you like it, my prediction on\nYour future is always right, I must be psychic, damn\n\n[Bridge]\nSee, I ain't even tryna affiliate myself with stupid\nPeople like you anymore, it's the same damn story with\nYou every single time, don't be callin' me talkin 'bout\nYou fucked up, bitch, fuck you!\n\n[Hook]\nI should've fucked you when I had the chance to (the chance to)\nNow I'm sittin' alone in my house and I'm wishin' you'd call me right now\nBaby, perhaps I should have been less nicer than I was to you\nCause this seems like all the good girls go for bad guys\nAnd good guys get left behind\n\n[Verse 3]\nThat's just the way that the story goes\nDeep down bitches ain't nothing but clueless, horny hoes\nThey'll fill ya life up with drama like it's the Maury show\nShe'll turn her back on you even though she had sworn she won't\nI never felt this sore before, here's what you do to be fair\nYou get a girl, fuck her while the opportunity is there, cause if you don't\nSome other nigga will, best believe this shit is real and\nWhen you find out what she's been doin' you'll fall and get the chills\nLove is just a battlefield, some bitches be gettin' killed\nNiggas too, it's the truth, better run and get your shield\nHoes will make ya think they at home waitin' for ya, sittin' still\nBut really, she's out with that guy you don't like and she's gettin' drilled\nMy heart is forever swollen, why'd I let you ever hold it?\nGirl, you was my Bella and I thought I was your Edward Cullen\nThere's no rules to hop onto your boat, you'll take whatever floats it\nBitch, you turned my heart into a cave no one should ever go in\n\n[Bridge]\nI can't stand these stupid bitches\nMan, I just wanna take my hand\nAnd put it around their fucking neck\nAnd choke the fuck outta them! Ooh!\nFuck 'em all!\n\n[Hook]\nI should've fucked you when I had the chance to (the chance to)\nNow I'm sittin' alone in my house and I'm wishin' you'd call me right now\nBaby, perhaps I should have been less nicer than I was to you\nCause this seems like all the good girls go for bad guys\nAnd good guys get left behind\nI should've fucked you when I had the chance to (the chance to)\nNow I'm sittin' alone in my house and I'm wishin' you'd call me right now\nBaby, perhaps I should have been less nicer than I was to you\nCause this seems like all the good girls go for bad guys\nAnd good guys get left behind", "image": "https://images.genius.com/89f3b594c1d21cb0ced76a0e54600701.1000x1000x1.jpg"}], "artist": "Hopsin"}