{"songs": [{"title": "Hail Mary", "album": "The Don Killuminati: The 7 Day Theory", "year": "1997-02-11", "lyrics": "[Segue from \"Bomb First\"]\n\n[Intro: 2Pac]\nMakaveli in this, Killuminati\nAll through your body (All through your body)\nThe blow is like a 12-Gauge shotty (Uh) feel me!\n(Come with me Hail Mary, nigga, run quick, see)\nAnd God said he should send his one begotten son\n(What do we have here now Do you wanna ride or die)\nTo lead the wild into the ways of the man\nFollow me! (La la-da-la la la la la)\nEat my flesh, flesh of my flesh!\n\n[Chorus: 2Pac]\nCome with me!\nHail Mary, nigga, run quick, see\nWhat do we have here now?\nDo you wanna ride or die?\nLa la-da-la la la la la\n\n[Verse 1: 2Pac]\nI ain't a killer, but don't push me\nRevenge is like the sweetest joy next to gettin' pussy\nPicture paragraphs unloaded, wise words bein' quoted\nPeeped the weakness in the rap game and sewed it\nBow down, pray to God, hopin' that he's listenin'\nSeein' niggas comin' for me and my diamonds when they glistenin'\nNow pay attention: bless me please, Father, I'm a ghost\nIn these killing fields, Hail Mary, catch me if I go\nLet's go deep inside the solitary mind of a madman\nScreams in the dark, evil lurks, enemies see me flee\nActivate my hate, let it break to the flame\nSet trip, empty out my clip, never stop to aim\nSome say the game is all corrupt and fucked in this shit\nStuck, niggas is lucky if we bust out this shit\nPlus, Mama told me never stop until I bust a nut\nFuck the world if they can't adjust, it's just as well, Hail Mary\n\n[Chorus: 2Pac]\nCome with me!\nHail Mary, nigga, run quick, see\nWhat do we have here now?\nDo you wanna ride or die?\nLa, da-da, da, da, da-da, da\nCome with me!\nHail Mary, nigga, run quick, see\nWhat do we have here now?\nDo you wanna ride or die?\nLa, da-da, da, da, da-da, da\n\n[Verse 2: 2Pac]\nPenitentiaries is packed with promise-makers\nNever realize the precious time that bitch niggas is wastin'\nInstitutionalized, I live my life a product made to crumble\nBut too hardened for a smile, we're too crazy to be humble\nWe ballin', catch me, Father, please\n‘Cause I'm fallin' in the liquor store\nPass the Hennessy, I hear you callin', can I get some more?\nHell, 'til I reach Hell, I ain't scared\nMama checkin' in my bedroom, I ain't there\nI got a head with no screws in it, what can I do?\nOne life to live, but I got nothin' to lose\nJust me and you on a one-way trip to prison, sellin' drugs\nWe all wrapped up in this livin', life as thugs\nTo my homeboys in Clinton Max doin' their bid\nRaise hell to this real shit and feel this\nWhen they turn out the lights, I'll be there in the dark\nThuggin' eternal through my heart\nNow hail Mary, nigga!\n\n[Chorus: 2Pac]\nCome with me!\nHail Mary, nigga, run quick, see\nWhat do we have here now?\nDo you wanna ride or die?\nLa, da-da, da, da, da-da, da\nCome with me!\nHail Mary, nigga, run quick, see\nWhat do we have here now?\nDo you wanna ride or die?\nLa, da-da, da, da, da-da, da\n\n[Verse 3: Kastro]\nThey got a A-P-B out on my thug family\nSince Outlawz run these streets like these scandalous freaks\nOur enemies die now, walk around half-dead\nHead down, K-blasted off of Hennessy and Thai Chronic\nMixed in, now I'm twisted, blistered and high\nVisions of me thug-livin' gettin' me by\nForever live, and I multiply, survived by thugs\nWhen I die they won't cry unless they comin' with slugs\n\n[Verse 4: Young Noble]\nPeep the whole scene and whatever's goin' on around me\nBrain kind of cloudy, smoked out, feelin' rowdy\nReady to wet the party up\nAnd whoever in that motherfucker, nasty new street slugger\nMy heat seeks suckers on the regular\nMashin' in a stolen Black Ac' Integra\nCocked back, sixty seconds 'til the draw, that's when I'm deadin' ya\nFeet first, you've got a nice Gat but my heat's worse\nFrom a thug to preachin' church\nI gave you love, now you eatin' dirt\nNeedin' work, and I ain't the nigga to put you on\n‘Cause word is bond\nWhen I was broke, I had to hustle 'til dawn\nThat's when the sun came up, there's only one way up\nHold your head and stay up\nTo all my niggas, get your pay and weight up\n\n[Bridge: Kadafi]\nIf it's on, then it's on, we rape beat-breaks\nOutlawz on a paper chase, can you relate?\nTo this shit I don't got be the shit I gotta take\nDealin' with fate, hopin' God don't close the gate\nIf it's on, then it's on, we rape beat-breaks\nOutlawz on a paper chase, can you relate?\nTo this shit I don't got be the shit I gotta take\nDealin' with fate, hopin' God don't close the gate\n\n[Chorus: 2Pac & Prince Ital Joe]\nCome with me!\nHail Mary, nigga, run quick, see\nWhat do we have here now?\nDo you wanna ride or die?\nWe've been travelin' on this weary road\nSometimes life can be a heavy load\nBut we ride, ride it like a bullet\nHail Mary, hail Mary\nWe won't worry, everything will curry\nFree like the bird in the tree\nWe won't worry, everything will curry\nYes, we free like the bird in the tree\nWe runnin' from the penitentiary\nThis is the time for we liberty\nHail Mary, hail Mary!\n\n[Outro: 2Pac]\nWestside, Outlawz\nMakaveli the Don, solo\nKilluminati, The 7 Days", "image": "https://images.genius.com/2af6d8d26b4cbe47fea31ead7a5cddb4.879x773x1.jpg"}], "artist": "2Pac"}