{"songs": [{"title": "Fly Like Me", "album": "B.o.B Vs Bobby Ray", "year": "2010-02-02", "lyrics": "[Intro]\nAh-hah a-hah! Ehehehehe\nI'm just doin my thang man\nBut they can't do it quite like me\nCause they not like me\n\n[Chorus]\nI put my shoes on like ya, my shirt on like ya\nMy jeans on like ya, but I ain't nothin like them\nPut my shades on like ya, set my rims high like ya\nKeep a bad bitch like ya, but I ain't nothin like them naw\nYou - cain't be - fly - like - me (ayyy) [3X]\nCause you - just - ain't B.o.B\n\n[B.o.B - talking over second half of Chorus to start]\nAight look\nJam out\nI... pull up to the parking lot\nTinted windows on the car ain't stock\nAnd you already know how I do it when I do it\nWhen I hop up out the car they stop\nStraight pimpin in my LRG\nCreative wreck on my feet\nSo ev'rybody looking at my toes as I creep\nQuit lookin cause you ain't got these\nI talk it, how I, wanna, talk it\nY'all already what the pen is for\nSoon as I hit the club\nEv'rybody crabbin on me cause they wish they was\nI wish I could, go back when\nBack when I didn't get too much\nTo show y'all haters how I came up\nWhen y'all label it love\nSo I get fresher, deffer than you\nYou cain't be me, don't thank you could\nYeah Eastside, Ham Squad on deck\nStraight up slangin dat wood\nHandle dat good; man you can have that back\nGrippin woodgrain like Cadillac\nI see yo' Charger, bet mines harder\nWhippin that black on black\n\n[Chorus]\n\n[B.o.B]\nAh ha, a-hah! Yeah... look\nWell I ain't nothin like y'all\nStay fresh from Winter to Fall\nAnd y'all already know how I move when I move\nWhen I come through the do' they pause\nLookin fresh in my Moschin'\nWith them Academik jeans\nWith them Oakleys on my face\nI can see you but you cain't see me\nCause I walk it, how I, wanna, walk it\nY'all already know I'ma let them hang\nSoon as I hit the stage man\nI get thangs shakin like a 8 point 8\nAnd to this day, I don't play\nI came from the struggle so I'm 'bout my pay\nI want them marble countertops\nForget them paper plates!\nCause you not me and I'm not like you\nA whole bunch of real players in my crew\nBut nowadays e'rybody so fake\nThat you can only trust a few\nThink I'm talkin 'bout you? Well then I probably am\nIf the shoe fit put it on yo' foot\nYeah, Eastside, Ham Squad on deck\nStraight up slangin that wood\n\n[Chorus]\n\n[Outro]\n(I hear you talkin) I hear you talkin\n(But I really don't hear a thing) Naw\n(So keep on tryin) Keep on tryin\n(But you don't be nuttin like me) Ha ha ha ha\n(I hear you talkin) I hear you\n(But I really don't hear a thing) Naw\n(So keep on tryin) Keep on\n(But you don't be nuttin like me) Nah\n(I hear you talkin) Ha ha ha\n(But I really don't hear a thing) That what they do?\n(So keep on tryin)\n(But you don't be nuttin like me) They just try\n(I hear you talkin) Keep on\n(But I really don't hear a thing)\n(So keep on tryin) Yup\n(But you don't be nuttin like me) Nah\n\nYou cain't do it man, that's just how I do it\nB.o.B, I'm nuttin like you you nuttin like me\nHa ha ha ha\nAhhh, wooooooo!", "image": "https://images.genius.com/43ec171838184bac0a8baa89f9e6d0a9.600x600x1.jpg"}], "artist": "B.o.B"}