{"songs": [{"title": "WHAT’S GOOD", "album": "IGOR", "year": "2019-05-17", "lyrics": "[Part I]\n\n[Verse 1]\nTurn my lights on\nHow the fuck you quiet with the mic on?\nI don't get anxiety, you Sam Bowie-ass niggas\nI just get my Mike on\nY'all said I wouldn't go nowhere, I took the detour\nWhen you see the someone in the crack right by the seashore?\nWhen you see them brand new le Fleurs on the floor?\nIf the cops ask my name, bitch, I'm Igor\n\n[Chorus]\nYuh, ayo\nYeah, yeah\nLet's go, let's go, I ain't playin' around\nRed nose, red nose, all you niggas is clowns\nNiggas turning it up, well, shit, I'm tearing it down\nHard to believe in God when there ain't no mirrors around\nWhat's up?\n\n[Bridge]\nUh-huh, ayo\nUh-huh\nYeah, yo\nBitch\n\n[Verse 2]\nRunning 'til the rims fall\nHad them niggas and the cops looking jigsaw\nI done fucked around and turned into the big dog\nBetter get God, get caught? Bitch, I think not\nYeah, new suit, new boots, same nigga, like what?\nLukewarm-ass niggas always wanna talk\nI'm hot, I'm heat to the core like Earth\nDon't touch, don't go, niggas might get buck\n\n[Chorus]\nYo, yuh, ayo\nYeah, yeah\nLet's go, let's go, I ain't playin' around\nRed nose, red nose, all you niggas is clowns\nNiggas turning it up, well, shit, I'm tearing it down\nHard to believe in God when there ain't no mirrors around\nWhat's up?\n\n[Interlude]\nWhoop, uh huh\nYeah, bitch\nYeah\n\n[Part II]\n\n[Intro: slowthai]\nI see the light\nNow didn't I tell you motherfuckers\nUm, I see the light\nTo pay attention and to keep your motherfucking eyes glued to the man that's in front of you?\nI see the light\nThat's what the fuck I expect all y'all motherfuckers to do\nI see the light\n\n[Verse 3: Tyler, The Creator & slowthai]\nDracula, Dracula, Dracula\nSuck me first, I might get back at ya (I see the light)\nIs that shit clear? Check the aperture\nHahahahaha, I can't laugh at ya (I see the light)\nThis the shit that make you nervous\n'Bout to go buck wild, nigga, Steve Irwin (I see the light)\nSick of that 'Claren talk, I'm on my third one\nNiggas talkin' reckless, I never heard 'em (I see the light)\n\n[Chorus: slowthai]\nI see the light\nI see the light\nI see the light\n(Buck, don't touch, though, my niggas might get buck, don't touch, though)\nI see the light\n(Buck, don't touch, though, my niggas might get buck, don't touch, though)\nI see the light\n\n[Verse 4: Tyler, The Creator & slowthai]\nThat car crash couldn't take me (Woo, ha)\nGreen haired angels all around me (Uh)\nNo answer why, no tears to cry, bitch, I'm alive (I see the)\nThat wasn't my endpoint like v-neck\nI ain't have nobody to cheat on, I cheat death\nNew album, no repeat, I reset\nEverything I deliver special like G. Dep\nTwo of 'em, I total, Kima, Pam\nMe and death, the universe played middle man\nQuick nap, kick back like horse, eyes shut\nLoud sound, no scratch\nMotherfuckers really thought I died\nHoping they could take a spot\nNigga not knowing that I'm one of one\nAnd they some Helen Keller-ass niggas\nAnd I got my eyes open now I see the...\n\n[Outro: slowthai & Jerrod Carmichael]\nLight\nI see the light\nYou never wanna meet a motherfucker like me\nI see the light (I said)\nI see the light\nI see the light\nI don't know what's harder, letting go or just being okay with it", "image": "https://images.genius.com/f49c5b7408c82981df2e3e01900b527d.1000x1000x1.jpg"}], "artist": "Tyler, The Creator"}