{"songs": [{"title": "Happy Bar Exam 2", "album": "The Bar Exam 2", "year": "2008-09-20", "lyrics": "[Verse 1: Marv Won]\nAye, aye\nI'm back on my bullshit\nCome chill with the crook\nI'm rejuvenated bitch, I feel as good as I look\nThat's awesome\nShow me who's talkin' and I'll off 'em\nFrom Austin to Boston, make 'em floss in coffins\nShit, if I ain't the man, I'm standin' next to him\nStarvin'\nSomebody bring me a Dexatrim\nTo suppress my appetite\nI feast on niggas who ain't rappin' right\nLearn in the after life\nIf I ain't the best baller, I'm right after Mike\nCockier than the nigga that made Flashing Lights\nI'm the king of the jungle\nI'll stop all the scoring on your block without bringin' Mutumbo\n100 round drums is what I bring to the rumble\nBrash\nI ain't get a thing when I was humble\nAnd why should I be?\nNiggas ain't good as me\nThe best black champ we had in a while like Booker T\nOne of the best, but overlooked like I'm Pusha T\nYou little pussies get fucked\nHere go the douche for free\nIt ain't too much that Marv can't do\nMake way for royalty\nHappy Bar Exam 2\n\n[Verse 2: Royce Da 5'9\"]\nYou welcome\nBubble like Seltzer\nBubble lights do a double life crime what else then?\nGun shots kinda sound like the llama belchin'\nShittin' like I'm rhymin' in the John like Elton\nI turn a nigga into stone\nSend out a blast like an e-mail to shoot ya\nFemale Medusa\nIt Wasn't Me like Shaggy\nDenaun did it\nLike a fag was snitchin' on D-12 producer\nGive you a buck 50 this evenin'\nThis is my time of the month\nIf you ain't fuckin' with me you bleedin'\nI can't count how many whips I be stickin' keys in\nBitch, you ain't dissin' me, you just committin' treason\nRed wine or Riesling\nHas been, I'm a \"he's been...\"\nEverywhere\nI'm Bigger than Cee's friend\nLyrics written down with a G's pen\nHood rats on me cause I'm in a trap\nI'm gonna give her cheese then\nShe with me, she never dick teasin'\nThe wrist freezin'\nShe's tellin' me I'm just seizin'\nShe do whatever I tell her long as it's with reason\nSo I'm gonna tell her to blow me until she quits breathin'\nShe play her position, but it's me receivin'\nThe cum come through them gums looks like the bitch teethin'\nDiss me, get treated like you was just leavin'\nAfter I quit squeezin'\nI'm the shit fool\nEvery year in my past, my shit list grew\nNiggas switched up and got ripped up like Rick Rude\nYeah, I don't fuck around with that mic\nYou try to fuck with me you probably fuck around with that white\nWhat you a cluck?\nI psycho spit\nY'all writtin' with lead\nI'm writtin' my rhymes with rifle tips\nI'm excitin' like highlights of Michael clips\nI run the net like my mic's a microchip\nNickle\nHappy Bar Exam 2\nIt's a holiday nigga", "image": "https://images.genius.com/5b0c99ea857e85f30c22aa344281f869.320x320x1.jpg"}], "artist": "Royce da 5'9'’"}