{"songs": [{"title": "Red Sabbath", "album": "Speedin’ Bullet 2 Heaven", "year": "2015-12-04", "lyrics": "[Intro]\nI can't get numb enough\nI don't want to know what's down or up\nI need to escape forever, forever\nI need to escape forever, forever\n\n[Verse 1]\nThe clouds stay gray\nThe devil wants to play, okay?\nThe devil wants to play, okay?\nShe likes to feed on the weak\nLocking in on her prey\nDissolve your soul, fingertips turn cold\n\n[Chorus]\nI need to escape forever, forever\nI need to escape forever, and ever\n\n[Verse 2]\nBlood everywhere, blood everywhere\nMy outfit's fresh, of course it is\nYou said we do this to death\nCold until my last breath, slowly exhale\nOne last fuck you to the world\nOne last fuck you to the world\n\n[Chorus]\nI need to escape forever, forever\nI need to escape forever, and ever\nI need to escape forever, forever\nI need to escape forever, and ever\n\n[Outro]\nThe clouds stay gray\nYou can't escape me, I will destroy you\n\n[Skit]\nBeavis: \"You know Butthead, I say this a lot, but that was cool.\"\nButthead: \"What a long strange trip it has been.\"\nBeavis: \"It sure has. I feel a little different.\"\nButthead: \"Beavis, the world will never be the same. Doves will fly into the sunset and there will be harmony, and there will be rainbows. There will be peace on earth. And there will be no haters, and if there are haters, we shall flex on them. We shall flex on them hard.\"\nBeavis: \"Flex on, yeah.\"\nButthead: \"And finally we will score, the whole world will score. It's gonna be cool.\"\nBeavis: \"Really? We're gonna score? Are you sure? Wait a minute, are you sure? Because I always think I'm gonna score, and then it doesn't happen. And I don't want to get my hopes up because I'm all emotional right now.\"\nButthead: \"Yes, Beavis, it is foretold.\"\nBeavis: \"Yeah, cool, that's good. Butthead. a minute ago you said 'hard.'\"\nButthead: \"Oh, yeah.\"", "image": "https://images.genius.com/854fa85e9ebd6f2af80c0040cdd56b2e.1000x1000x1.jpg"}], "artist": "Kid Cudi"}