{"songs": [{"title": "Free Enterprise", "album": "Black Market", "year": "2015-12-04", "lyrics": "[Intro: Rick Ross]\nGod is great, first and foremost, uhh\nDon't you wish everything could be so perfect?\n\n[Verse 1: Rick Ross]\nFree enterprise, overexposed\nIrritated, uneducated still scribble my flows\nThe jubilation, the euphoria\nPushing a foreign in the morning, pick your daughter up\nDrop your seed off, let the weed up\nSlow motion, fast forward till we speed up\nGrinding 'til my new accountant is fully at ease\nBeefing with broke niggas really like pulling my teeth\nGet away from me! You looking so suspicious\nLight pocket, heavy hearted, you simple minded niggas\nDon't be jealous of me, I keep enough foes\nGet all the sneakers, not enough clothes\nYou can have the ex, I got enough hoes\nYou can have my next, once we a month old\nReptile black, Birkin Bamboo handle\nNow the trophy on the mantle, well I got a Phantom\nBeing down and out was inconceivable\nWhen you find out the one you love is just misleading you\nTryna make a living, remain spiritual\nEgotistical ways I embraced back in middle school\nIf the chick was game, we would run a train\nSend her home on a bus, then forget her name\nBut now the bitches be the realest ones\nI done cried on her shoulder when I'm feeling numb\nSeen a man get life and never shed a tear\nBut his daughter in the night never pierced her ears\nTime will come when all that nice shit disappears\nWhy you think I'm on the night shift with the pills?\nMind frame of that boy that was found slain\nMild slang, you can tell I been around 'caine\nDouble R, Ricky Ross, bitch we been the gang\nBottom of the black market, time to rise again\n\n[Interlude: Rick Ross]\nMy inner Andre 3000, uhh\n\n[Verse 2: Rick Ross]\nSo many false allegations, is my image tainted\n3 weeks in the hole, as if a nigga heinous\nAs I'm pacing in the cell all this pictures painted\nAll i wanted was some Belaire and a Danish\nInmates gave me commissary just because I'm famous\nOr is it cause' I'm rich and I know what pain is?\nAssassinate Trump like I'm Zimmerman\nNow accept these words as they came from Eminem\nDemocratic party sentenced to the pendulum\nKilling them, I voted for Andre Benjamin\nHead of black music, do you know what rhythm is?\nStick your hand in the basket, it gets venomous\nStraight player, my chicks finish my sentences\nTime to squash to beef, I kill a nemesis\nShow up at the wedding in my Timberlands\nAnd for the record, know my best man'll kill a bitch\n\n[Outro: John Legend]\nSo if I die before I wake\nSay I, I lived my way\nNever said I would be perfect (no)\nNever said that I deserved it (no)\nNever said I wouldn't lie (no)\nNever said I wouldn't make my mom cry (no)\nBut if I'm gon' die, I believe it's alright\nIt was so amazing, so amazing (as I look back on my)\nIt was so amazing, so amazing\nI wouldn't change a thing, no no no\nNo, ohh\nIt was so amazing, so amazing, ohh\nIt was so amazing, so amazing\nI wouldn't change a thing", "image": "https://images.genius.com/5443bc2c1a02c3c0df5d0f01baaa2ad4.1000x1000x1.jpg"}], "artist": "Rick Ross"}