{"songs": [{"title": "Above the Law", "album": "Hell: The Sequel", "year": "2011-06-14", "lyrics": "[Intro: Claret Jai]\nThe poor stays poor, the rich get richer\nIt’s just so disproportionate\n\n[Chorus: Claret Jai]\nSometimes life seems so unfortunate\nThat's why I don't give a shit\nThe poor stay poor, the rich get richer\nIt's just so disproportionate\nYou don't know just what I go through\nThat's why I would rather show you\nJust how far that I can take it\nEvery rule, I'm breakin' it\n\n[Verse 1: Eminem]\nTerrible, but not rip-able, invincible, I hung invisible\nFuckin' mistletoe all over the world, I stuck my ass up under it\nNow pucker up them lips and kiss it, hoes\nHere we go, Bad and Evil so you know how this'll go\nThe competition's miserable, we stomp them bitches this is no\nJoke, goin' overboard like someone threw us off the boat, choke\nCough from all the smoke, I'm tryna stay on fire\nSo you know if I hate fucking water sprinklers\nI don't love the hose\nSomeone let the cat out the bag, now it's time to stuff its face\nBack in that bitch, smother that little\nMotherfucker 'til it suffocates (Who?)\nYou had long enough of a wait, why are they\nTryin' to be so secretive? Bad and Evil is reunited, hey!\nCame back to annihilate, the game's in dire straights as I await\nWord on Satan as I drop, fall to my knees before this\nOuija board and I pray, now I lay me down to sleep\nI do this shit in my sleep, I’m sleepin' now, imagine if I awake?\nI'm champ, bitch, I'll never taste the canvas\nCould never be no damn wuss or pussy\nNever mushy, so you can't squish\nNowhere near a tush, in fact if I jump out a bush\nIn a sneak attack's, the only way I'll say I am-Bush\nOutlandish, these words are weapons that I brandish\nStand-offish to hoes, keep your hands off this\nCan't top it, so what the fuck would I sugarcoat it for?\nLaw? Fuck protocol, I'd holla at this ho\nBut now my throat is sore\n\n[Chorus: Claret Jai]\nSometimes life seems so unfortunate\nThat's why I don't give a shit\nThe poor stay poor, the rich get richer\nIt's just so disproportionate\nYou don't know just what I go through\nThat's why I would rather show you\nJust how far that I can take it\nEvery rule, I'm breakin' it (Royce!)\n\n[Verse 2: Royce da 5’9”]\nBaby, I'm lawless\nYou couldn't burn me if you threw acid on me\nI'm at ya, homie, I'm at your home ready to spray you\nWhile you nappin', homie, have everything on and around\nYour mattress lookin' like the word in front of a matrimony\nYou high, thug? Yeah, go 'head, jump, no matter how high you get\nYou gon' come up short like Spud Webb\nMy DUIs get waived like sayin' bye\nStill ridin' with no L's like James Todd, can't change, I\nI thank God for my safe thinkin', last time I was safe thinkin'\nMe and my niggas was doin' a bank job\nI stay violent, y'all go the peace route\nYou got a mouth like Kanye\nI'll knock your whole bottom row of teeth out\nNo disrespect to Mr. West, shit, I'm just nice with mine\nAnd this just rap, I'm just like Ricky Hatton, I just like the line\nThese weak rappers want to set us up, they never tough\nThey ask me for a hook, I tell 'em, left or right? Head or gut?\nWhat y'all messin' with is a nigga that'll leave you FUBAR\nFucked up beyond all recognition\nY'all are rock stars, I'm the opposite, I could just\nThrow a rock and hit a star for the fuck of it\nPartner, you're not hard, I body your hot bars\nBeef is left you pray, right like Allahu Akbar\nLet's go, when I leave y'all shot, you ain't gon' be on your Metro\nIn a bad area that call dropped\n\n[Chorus: Claret Jai]\nSometimes life seems so unfortunate\nThat's why I don't give a shit\nThe poor stay poor, the rich get richer\nIt's just so disproportionate\nYou don't know just what I go through\nThat's why I would rather show you\nJust how far that I can take it\nEvery rule, I'm breakin' it", "image": "https://images.genius.com/e46d8c5b81dd5cfba852666c93111bef.1000x1000x1.jpg"}], "artist": "Bad Meets Evil"}