{"songs": [{"title": "Take The Heat", "album": "A Taste of Tical O (Part II)", "year": null, "lyrics": "[Intro:?]\n\nSpinning the b-b-beats for the streets\nIt's the Bomb Squad DJ\nWe getting you crunk right now\nGet down or lay down\nTake it like a motha fuckin' man\n\n[Hook: ?]\nHe's Mr. Take The Heat, Mr. Baby Rub My Feet\nMr. Don't Be Hanging Late In Streets\nMr. Bring Home The Bacon, Mr. You Ain't Hear Enough\nMr. Pack Your Shit, Mr. Do It To Me Rough\nMr. Please, Drop Me At My Job\nMr. Please, I Need A Hundred Dollars To Borrow\nMr. Please, Can I Use Your Car\nIf any man can do all this, he got to be a bad boy\n\n[Method Man]\nFast women and fast cars\nA razor blade instead of a tongue, my game sharp\nWe major leaguers, minor leaguers, get out the park\nBitches, that wanna back talk, get out and walk\nI'm too cold, like Iceberg Slim\nYa'll see, I'm caked up with icing\nRolling on dubs, thug for lifing, never trifling\nAnd I ain't never met a piece of pussy I ain't liking\nI'm too piping, hot, front, you get got, kid\nDon't get too close, because you might get shot\n\n[Hook]\n\n[Method Man]\nOkay, come out and play\nYa'll clowns Need to get down, or get out the way\nI'm a live round, shot to your head by Doc Dre\nAin't too long, ya'll gon' live on consignment and not pay\nThis is everyday, life of the kid, fuck who it is\nI'm gon' live like a true bad boy, and do it big\nAnd I could take it, it's just as good as I get\nAnd ya'll ain't gotta ask, dead rapper your ass, kid\nWho anti-everything, ya'll niggas is for\nWho eat up everything on his plate, then eat yours\nAin't got no table manners at all, I'm off the wall\nLike I'm MJ, jerking myself, scream at your frog\nAnd bitches wanna give us the drawers, cuz who we are\nThe same bitch'll sugared your tank and key your car\nThe life of a player and pimp, who every dollar, tax exempt\nPussy paying the rent, now who I'm is?\n\n[Hook]\n\n[?]\nOh I'm a bad boy, fast cars, hot women\nThe lifestyle, accustomed to winning\nBitch, your chrome is spinning, tinted windows\nBut still, you're jailed from the head bopping gangsta lean\nYou'se a bad boy, champagne, diamond studded events\nRed carpet rollout, pulling up in a Bent'\nAnd the crowd, they taking pictures\nIt's hard to tell, if a flash went off\nOr you was blinded by the riches", "image": "https://images.genius.com/ef71878edb3e2101748fdd635355fc79.320x320x1.jpg"}], "artist": "Method Man"}