{"songs": [{"title": "On Deck", "album": "From Zone 6 To Duval", "year": null, "lyrics": "[Verse 1]\nKush burner nigga in the kitchen, good cookin\nAnd I know I might be ugly, but my car is good lookin\nA star, so I shine like the sun in Mississippi\nA show in Mississippi, so I love to sit with fifty, bands\nYa gamblin ass I'm from Birmingham, shot ya boy down fifty grand and I shook lil buddy hand\nUntil the feds get me nigga spend ya bread with me\nYou pretty boy niggas know the kid get filthy, fizzy\nHaters know the bitch stay distant, get ya ass whooped, bus came you just missed it\nSo Icey boys four niggas eight bitches\nTwo girls for every nigga that's how we kick it\n\n[Hook]\nIs you iced out? (check) Is you thugged out? (check)\nGat them shooters on deck, got them goons on deck\nSo Icy entertainment, big jewels on deck\nBaby look at our neck, we rock VVS\nIs you iced out? (check) Is you thugged out? (check)\nGot them shooters on deck, we got goons on deck\nBig jewels on deck, baby we on deck\nSo Icey VVS, we rock VVS (BURR!)\n\n[Verse 2]\nSupercalifragilisticespianadocious\nThat's some super fruity Cali kush he super smokin\nDolce, Dolce-bana, Gabana frames\nI'm Gucci half the time think that it's my clothing line\nDo it like la kitchen show me yours I'll show you mine\nI'm high up out my mind don't think I'm lyin cause I ain't lyin\nIf smokin is a crime then that's a cryin shame\nMary Jane, Mary Jane, I love the Mary Jane\nIt's underrated unappreciated highly-decorated, damn I been hella patient, but I'm losing all my patience\nMany wanna duplicate, generate, penetrate, innovative bachelor, Gucci Mane the bachelor\n\n[Hook]\n\n[Verse 3]\nIt's a pity how these inner city bitches fuck these niggas just for riches flashing like they rich but shop at JC Penny's\nA gimme u say gimme gimme gimme gimme gimme\nI'm a go and get it type of nigga I ain't with the beggin\nSo Icey boys baby got it on my necklace on my neck and on my wrist\nOn my face because I'm flexin\nI'm a chef I can make a hit, I can make a brick\nUsed to steal rob and take a brick I didn't fake a bit\nIf a bitch talk bout Gucci mane that she on Gucci dick\nI'm a soldier and a CEO, So Icy we da shit\nIf a bitch talk bout So Icey she on our dick\nI'm a soldier and a CEO So Icey we the shit\n\n[Hook]", "image": "https://images.genius.com/fcc541d6d90cfb0abd7802a11141eeaa.500x500x1.jpg"}], "artist": "Gucci Mane"}