{"songs": [{"title": "Royal Flush Freestyle", "album": "The Bar Exam 2", "year": "2008-09-20", "lyrics": "[Intro: Canibus & Royce Da 5'9\"]\nYeah\nBar Exam 2, nigga\nIt's a motherfuckin' holiday, bitches\nBar Exam 2\n\n[Verse 1: Canibus]\nI landslide you to the lava below, gotta stance nigga flow\nHow many bars? How far can you go?\nOnly as far as the mind, Canibus and Royce 5'9\"\nBar Exam 2, spit a rhyme\nA miniature version of me told me he wanted to MC\nI told him, \"Be careful who you be.\"\nHe said, \"I'ma just be me.\" I said, \"Yeah, I see\nBut you don't understand what I really mean\"\nLook at the manifest list, it got my name down\nA bald head for the cool crown, how you like me now?\nI terrorize rap music\nWhat manner of creature could do this? Canibus, stupid\nRetarded, autistic artists, one click, perfects target\nStaff Sergeant Canibus talkin', I would not let off the gas\nTraverse it through San Stone's past\nThe Ripper spills whiskey from a flask\n\n[Verse 2: Elzhi]\nYeah, I toke green, blowin' out smoke screens\nPoke queens, leave them with soaked jeans\nYou're the definition of what \"joke\" mean\nI'm star status, like glowin' lights throughout the far strato-\nSphere, it's clear who repertoire that is\nPursue whites and fuck a shoe price, my cheese outgrew mice\nI'm too nice, cut through slice, I'm seein' you twice\nThe lead pacer, been makin' moves like Speed Racer\nIndeed tracin' a line that fucks with your mind like a weed lacer\nTry and boast, ain't lyin' close, so what I diagnose\nI could fry and roast any guy till they applyin' ghost\nPee on peons beyond eons\nTill there's neon Klingons, close encounter of the three kinds\nYou may fall, I'm AWOL, my heaters will spray y'all\nAnd put you in a hole like Robert Peter to pay Paul\nI could give a fuck, got a flow to leave a river stuck\nYou hear deeper lines, keep a nine near the liver tucked\n\n[Verse 3: Royce Da 5'9\"]\nYeah, Osama McCain, you climb in this ring\nRhyming with Obama the king\nEnd up on the bottom of the things\nLiving inside of ominous springs, I'm in a dream\nI spit the only kind of sickness that vomiting brings\nThat means I'm ill/sick, and plus I'm real, bitch\nI should've played Hancock instead of Will Smith\n'Cause I'm drunk, the flyer, I'm the super hero\nMinus all the chump attire, and I bleed hardly\nTell your idol his times up and he's barbe-\nCue, every rhyme lined up like Steve Harvey's do\nFrom the pies to the brick man\nNiggas couldn't follow in my steps 'less I died in some quicksand\nSo come and see a nigga burn a show and give me a hand\nBefore I give you the fist like a germaphobe\nAnd you probably too scary to scuffle\nIf you ain't hit a nigga until you buried your knuckles\nI got a hundred round drum, I shoot the first thirty\nTo kill everybody that trash your hook up\nCategory blast the butcher, empty the clip\nJust to make that 70 show like Ashton Lutcher\nNigga you at war with sharks, the government team\nWill leave you airless like Jordan Sparks or a motherless queen\nWe put it on y'all, tape a nigga phone call\nSell it to the net for a phone card\nThen use it to phone y'all mommas, I throw you niggas a bone\nAnd then I bury the drama in a bone yard\nThe flow's in prime, I got more plastic on me\nThan all of Hugh Hefner's hoes combined\nMy niggas got GTs and shit, yeah, I know mini Coopers\nWhile you niggas rolling around in them Mini Coopers\nI'm the shit, for real, y'all niggas mini-poopers\nDrunk, wildin, commiting vodka and Henny bloopers\nWho could give a nigga the Snoop foot?\nStretch him out on the floor like the Manut look\nYou shook, nigga, I'm like the crew cook\nI put a price on the whip, and I'm like the blue book\nWith an appetite for destruction with the greed stigma\nExplains my past and adds to my enigma\nIf it's digital or analog\nBar Exam 2 is the present, the distributor is Santa Claus", "image": "https://images.genius.com/5b0c99ea857e85f30c22aa344281f869.320x320x1.jpg"}], "artist": "Royce da 5'9'’"}