{"songs": [{"title": "It’s a Cold Day (The Funk Wit U mix)", "album": null, "year": null, "lyrics": "George clinton:\n\n(chorus)\nAnd it's a cold cold cold cold day\nFor a player\nDit dit dit dit do do dit dit dit\nI want to hold yah\nDit dit dit dit do do dit dit dit\nI want to hold yah\nDit dit dit dit do do dit dit dit\nI want to hold yah\nDit dit dit dit do do dit dit dit\n\nToo $hort:\nI got too many girlfriends what am I gonna do?\nPlay em tell the world ends and always keep a few\nWhen it comes to women I did everything I thought of\nPlayers like me, we never get caught\nWho's the next on the list? it's a daily routine dog\nShe give me short, then she'd take my jeans off at\nFirst she wasn't messing with me told me to lick it\nBut now she's always sweating me. when we gonna kick it?\nSpend some time wit her, I need to come through and hit it\nAny time I feel like I want it, I can get it\nI'll be here for you, you never wonder were I'm at\nSo when I come through put the spare key under the mat\nWhen I come in, there ain't no holding back\nJust feel what I am doing and roll with that\nAnd even though I admit I can't commit this time\nIt's cause I got my heart broke at the age of nine\nI've been hard core every since I sucked up the game from pimps\nYou never hear me rap about the same bitch\nI never turned a hoe into a housewife\nShort dog east oakland in the house right\n\nChorus 2:\nI'm ready to ride, ready to ride, ready to ride\nI'm the mothership wish it comes\nI'm ready to ride, ready to ride, ready to ride\nI'm the mothership wish it comes\n\nChorus 1:\nDit dit dit dit do do dit dit dit\nI want to hold yah\nDit dit dit dit do do dit dit dit\nAy yeeeay I want to hold yah\nDit dit dit dit do do dit dit dit\nI want to hold yah\nDit dit dit dit do do dit dit dit\nI want to hold yah\nDit dit dit dit do do dit dit dit\nAyyy yeeay\n\nToo $hort:\nI thought we was cool like that, why you go behind my back?\nTrying to cross me in the game when you know I'm a mack\nCan't do that, you all up in my mix\nGet the phone book callin all my bitches\nYou know I don't really care if you interfere\nCause I don't think you know about these real players\nIf you need a lesson, you better listen up\nCause I don't think you ready for this pimpin stuff\nI'm too short baby on the microphone\nSince you got no game, I gotta write these songs\nTo wake you up and get you motivated\nI'm about to flip the script and I know your gonna hate it\nYou can't infatuate my game no more, it's fool proof\nSo when you try to cross me up, I pull through\nLike a solider, cause we fighting a war\nHaters against players, who you fighting for?\nYou all in my business trying to make it theirs\nI need to hit you in your face tell you 'mind your own affairs'\nI'm sir too short, and I'm knowing just how to be a player bitch\n\nChorus 2:\n\nChorus 1:\nToo $hort:\nBiotch echoes\nNow if your trying to be a player, do your thing\nBut if you wanna be in love, it's cool mang\nDon't try to be a player when you see that you can't\nLet your peers pressuring you into being what you ain't\nIt's hard to be real in this fake world\nWould you result to violence if I take your girl?\nOr would you realize she likes me more then you\nOur relationship is starting and yours is through\nAre you riding on the bench. who you starting for?\nDo you have another girl or is your heart broke?\nDo you know how to be a player?\nIs what they say about me\nI'm straight down with the after party, late night freaks\n\nBelita woods:\nShe's just a pretty face, and she doesn't even use her own name\nShe stole it from a magazine\nShe's just a pretty face\nAnd the words she say ain't coming from her mouth\nShe stole the can and loves the pot\nShe's just another pretty face\n\nGeorge clinton:\nOhh ohh ohh ohh ohhhh\nFive o'clock I make a run\n\nChorus 1", "image": "https://images.genius.com/f7947ca6d18485b4713ba9c89b2980c7.800x800x1.jpg"}], "artist": "Too $hort"}