{"songs": [{"title": "Fly You", "album": "Amber Kush Mixtape", "year": null, "lyrics": "[Intro - Wiz Khalifa]\nYeah! All this Louis Vuitton\nI see clearly now\nOcean view, you deserve it\nI do this for you\n\n[Verse 1 - Wiz Khalifa]\nUh\nSay the trees couldn't get better\nNeed this sort of weather\nSand beneath your toes\nYour drinks come with umbrellas\nCutting off our phones\nIgnoring important texts and email messages\nSay I do it big\nI can't do it less than this\nThem other niggas talking shit\nShe ain't impressed with them\nYet to spend. And we been here for a minute\nThat explains all the trips I invested in\nIt's funny how all the fussing and fighting\nTurn around into us fucking and flying\nEvery night on the road you call me up and you crying\nWas worried about them bitches, now you too busy picking diamonds\nAin't worried bout a price\nCause if you want it I got it and I'mma pay for it\nThe good weed's lit, the champagne's poured\nOrder whatever you want if you got a taste for it\nIt's every girl's dream, but you awake for it\n[Hook] x4\nFly you to where I am\nI'll fly you!\n\n[Verse 2 - Wiz Khalifa]\nAnd you, know how it goes I go harder than a bitch\nPardon my French, but I work hard for this\nYou never had to see me on no starving artist shit\nBut mama when you caught me cheating thought that you would call it quits\nKnew fuckin' with me that you was takin' all the risks\nSo you ain't trying to give in\nSaying I'll be straight and you'll be the one hurt in the end\nAnd that's no good!\nJust tryna put you in the game like a coach would\nEverything going just how it should, now your friends jealous\nThey hating on us. But we so far they can't tell us\nThe life we livin' it was made for us\nWhen you're ready, give me a call, I'll be waiting on it\nAll you gotta do is hit me when you land and I'll pick you up from the airport\nAnd take you straight to the villa we don't stay at resorts\n5-star suites, spend weeks at the day spa\nMama keep your day job, I'mma..\n\n[Hook] x4\nFly you to where I am\nI'll fly you!\n\n[Verse 3 - Wiz Khalifa]\nAnd no matter where we go, you\nSay you never been\nShe in love, cause I keep it G\nNot cause the Gs that I spend\nBut I DO spend Gs on expensive weed\nVintage sneaks and hotel room keys\nCame for a day, stayed the whole week\nRed-eye, no sleep - window seat\n\n[Hook] x4", "image": "https://images.genius.com/ddb89bd2a59f0d1244043ad1427a532e.500x500x1.jpg"}], "artist": "Wiz Khalifa"}