{"songs": [{"title": "Her", "album": "Goblin", "year": "2011-05-10", "lyrics": "[Intro]\nOh I don't need the metronome bro\n(Ey)\nWhen you wanna be, ahh\nWhen you eat all the cheese in the store\nIn the the store, in the store, in the store, yeah, yeah yeah\nAlright\n\n[Verse 1]\n(It's this girl)\nShe lives next door, to the store that I loiter at\nWe talk every night, she cry to me about her guy\nAnd if we text I get pissed when I get no reply\n(It's this girl)\nI know that she's the key to love\nShe is who I'm thinking of when I am beating Richard up\nTo mental images her face look\nThe closest that I got was when I'm poking her on Facebook\n(This girl)\nVideo chats are so exciting\n'Cause it's like she is inviting me to her world full of privacy\nI'm getting gassed up, I think she's liking me\nShe's gullible and I just wanna take it like a pirate (arrrrgh!)\n(It's this girl)\nI see her in class\nNot really, two doors down, but anytime that I pass\nTo take a piss in a stall, I picture us in the hall\nLocking lips on the wall, her hand grabbing my dick\nMy left hand on her tits, ah my shit's getting hard\nFrom thoughts of dating this bitch\n(It's this girl)\nHer name is my password, fuck\n(This girl)\n\n[Verse 2]\nAll my niggas got they bitches and stuff\nBut all the bitches they fuck, are known as bitches and sluts\nBut she's special, I know to y'all I come off as rough\nBut I'm the nicest to her, and I just want to concur\nA relation, I want the cheesy dates at the movies\nAnd stupid walks at the beach, and sharing straws in a cup\nI never had that, so when we holding hands walking home\nI look past that, the fact that she's fucking guys that I hate\n(This girl)\nBut, things are looking great, cut copy\nLast time we talked she said that her relationship was rocky (Action)\nNow that Mr. Faggot's gone, there's no one that can stop me\nFrom bagging her, I got these tickets to the Roxy\n(Girl)\nNext day, metro's taking me home\nI see her in the cut at Wendy's, but she's not alone\nWho's that guy? Wait, why the fuck he 'bout to kiss her? (Shit)\nCome to find out she got back with her nigga\n(It's this girl)\n\n[Interlude]\n(Damn!)\nFuck\n(It's this girl)\nAnother one\nIt's not the first time\n(It's this girl)\n\n[Verse 3]\nShe's so pretty, fuck self-pity, I feel so shitty\nI wanna text her in a jealous rage\nBut if she reply to say anything, I'ma smile, I know\nWhat do I do with myself?\nSit in my room for some days?\nPlay Xbox with piles full of wet socks? Fuck that\n(Girl)\n\n[Verse 4]\nMy nigga ask, \"Ace, what happened to such and such?\"\nI could slander her name, and then tell him I probably fucked\nOr I could tell him the truth and just say she ain't like me much\nBut instead, I lie and say she moved to Nebraska\n\n[Outro]\n(It's this girl)\nBut she's not mine", "image": "https://images.genius.com/fd29e400e2d672aa992f9fda170e9959.640x640x1.jpg"}], "artist": "Tyler, The Creator"}