{"songs": [{"title": "I’m Burnt", "album": "Streetlights  ", "year": "2010-04-20", "lyrics": "[Chorus]\nI’m burnt. Everybody sayin’ I’m burnt\nNigga you should see when I’m turnt\nHomie I’m burnt, burnt, burnt the fuck out\nYa’ll ready know what I’m ‘bout\nYou know why I’m burnt, cuz I got that fire\nFuck you know why I’m burnt, cuz I got that fire\nYou know why I’m burnt, cuz I got that fire\nAnd the whole god damn world keep tellin’ me that I’m burnt\n\n[Verse 1 (Kurupt)]\nI’m coming in and am getting it like what it do\nMe, Daz, Terasflop, Problem, Snoop\nSystem bumping, nothing coming through, put two\nCuz the hoes lil close, somthin’ to do (to do)\nSo many ways to do, see mees coming turnt out, burnt out in two\nGangster shit with the nina way at least, the grand\nDaz by my side, he the close in hand (What Up)\nThat’s Com-town-pee, elected Compton official foreign MC\nGang bang cruise on, get my mobile goose on, ‘peals in great gruthon, luthon eight\nWait, of, off, high, this is how we do it every time we roll by\nAlcoholic, toxigenic, tonic, apple vodka, go shove it on Obama, off Obama, and now I’m burnt\n\n[Chorus]\n\n[Verse 2 (Problem)]\nIt's Eazy like E when you coupe so roofless, no time for haters, I just hit them with the deuces\nI see hoes there, what up with introducing, cuz all ya’ll tight, I’m just looking for the loosest\nMeet me on Sunday, everybody Tuesday, meet your friend Wednesday, everybody Thursday\nFind out Friday they both get pissed, Saturday with me up, then I’ma get flipped!\nThere’s one hit of this, got you going like Trish, strap a seatbelt when you're riding on this\nI’ma fuck your head up, first lick your own damn, gotta Beat It, real Bad, now Mike's looking down\nWord's all out that I’m burnt, thirsty tonight, so the pussy I slurp\nYo’ man ain’t home, I don’t need to get lurk, cuz ima soda pop that till mofucka squirt. You dig?\n\n[Outro]\nYou can smell marijuana on me, take out a gas-on roll it on E. One more sipper, hit and I’m gone, ain’t no telling no shit that I’m on. You can smell marijuana on me, ain’t gotta gas so I’m rollin on E. One more sipper, hit and I’m gone. Now I need someone to take home\n\n[Chorus]", "image": "https://images.genius.com/48a18f242c2b2fb8c91b44110a454db4.600x600x1.jpg"}], "artist": "Kurupt"}