{"songs": [{"title": "Supa GFK", "album": "The Big Doe Rehab", "year": "2007-12-04", "lyrics": "[Intro: people whispering]\nIs it a bird? Is it a plane? (no it's Ghost, no it's Ghost)\nWhat did y'all discover?\nIs it a bird? Is it a plane? (no it's Ghost, no it's Ghost)\nIt's a Superman lover...\n\n[Ghostface Killah]\nYeah, yeah, yeah\nAiyo, I'm coming up the block, got my hands on the ratchet\nAnd these fucking little faggots don't believe it's Ghost\nWell, surprise mothafucka, Starkey Love got breakfast\nGot some steaming hot biscuits, you can eat this toast\nShots blow through ya meatloaf and lace ya back\nTurn you over like a pancake and take ya gat\nThat's not damn near the half of it\nCops came, said the Killahs ain't risk game and the flow's so accurate\nAnything's possible, black, you mad profitable\nWaste no time, breath, air on popping you\nPut you on the guest list, go dance with death\nThe club's dead, yeah, you right, you the last one left\nSee the spooks in, goths in, devils in, fire's in\nYou dwelling in hell where them snitch niggas lyin, friend\nYa skin start bubbling from in the hot oven\nSay peace to my man down there, K-Dozen\nIt's Ghost, pressing y'all clowns on the regular\nDead you on a five pack, then take ya cellular\nDon't get it twisted, black, cuz I'll bury ya\nThis is just weed money, the more, the merrier\n\n[Hook: singer]\nThey call me the Superman lover\nSaid, they call me the Superman lover\nYeah, plus I'm wrong...\n\n[Ghostface Killah]\nAiyo, G4 jets with like three and four pets\nSex, Beck's, chicken and hens, all the same sex\nWalk through the Amazon, spilling Dom, Moet\nTo find my way back I gotta leave a trail of baguettes\nMy tongue's like a four-pound, my game is ill\nTwist a chick like a Rubik's cube, now what's the deal?\nChocolate, light skin, meet Mr. Excitement\nGot my D.D.L. on me, that's my Dick 'em Down License\nNever wife 'em, strike just like lightning\nI stay piping, hype just like Hype is\nBitches wanna see me and my rhinestone drawers\nCall in sick at work, then they take off\nFor me, spread 'em out for Starky\nMy mouth makes music like Biz Markie\nI get it in like any car key\nMy stroke is on, I'm never rusty\nUh-uh, but if you wanna play, this is what you gonna say\nThat I got the best D, he could hit it all day\nSomething like a rising star that's on Broadway\nSex real live with a Illmatic foreplay\n\n[Hook]\n\n[Interlude: Ghostface Killah] + (sample)\nOh shit, it's that Bally, it's that slick Bally\n'88 material, little niggas don't know nothing about this though\nCheck it out y'all (look) come on (look) yeah, come on\n(Up in the sky) When I'm at the bar, or in a rented car (look)\n(You'll see me flying by) Ya see the jewerly truck, don't touch\nYeah, yeah, come on, when I'm in the streets\nMight show you the heat (look, flying straight past ya)\n\n[Hook]\n\n[Outro: Ghostface Killah] + (sample)\nToney Starks Radio (something ain't wrong with me)\nMama got a big butt, mama got a big butt\nToney Starks Radio right here\nMama got a big butt, mama got a big butt\nSmooth FM, you know how we do, come on\nWave ya hand in the air like this\nMami, wave ya hands in the air like this\nPut 'em up if you trying to get rich\nPut 'em up if you trying to get rich\nUh, that's right, get rich\nLet's go, that's right, get rich\nGhostface, Ghostface...\nStaten Island, New York, what's up", "image": "https://images.genius.com/f1bbc70540da138c70debc041f381d0f.1000x1000x1.jpg"}], "artist": "Ghostface Killah"}