{"songs": [{"title": "Big Dogs", "album": "Tical 2000: Judgement Day", "year": "1998-11-10", "lyrics": "Check it, check it out (8X in background)\n\n[E-Dub] Uh-huh, yeah yeah.. ahh yeah word up\n[Meth] Yo, yo-yo\n[E-Dub] Uhh..\n[Red] Yo, yo, yo!\n[E-Dub] Redman.. ahh yo, Iron Lung\n[Red] Yo-yo-yo, yo..\nYo-yo, yo-yo\n[E-Dub] Word, E-Dub uhh, word.. yo\n\n[Redman]\nCall us Guerillas of the Mist, raunchy vocalists\n(Your code name) Doc\nWhat's your name? (Hot Nicks)\n(Who them slick kids puffin' that shit holdin they dicks?)\nYo them same two, drivin your whip, fuckin your bitch\n(Hold me down son!) Yo, I hold you down with the pound\n(You got a lot of BISCUITS?) Aiyyo but where they at now?\n\n[Method Man]\nDiggy down down we Reservoir Dogs, you puppy chow-chow\nGot my mittens on the kitten, lickin it now-now\n(Yo we bring the beef to you, infest it with the Mad Cow)\nDisease (we set to load) cocks and squeeze\n(Boo-yah!) We too hard to hold off\n(One arm slam ya like Nikolai Volkoff)\nWhen I dip-dip-diva (diva) the anti-socializa (liza)\nEverything be ice cream, observe the frusen-gladje\n[Redman]\nWe rock ya, knock ya fuckin whole team off the roster\nStarting lineup, Iron Lung (and Funk Doctor)\n\n\"..stomp with the Big Dogs\" (4X)\n\n[Method Man]\nJohnny Blaze the Ghostrider (uhh)\nGhost stories by the campfire (uhh) We night breed (VAM-PIRE!)\nBe duckin from the head rushin (uhh) Wu-Tang production (uhh)\nPercussions bringin repercussions (uhh) I hold my mic sideways BUSTIN\nAnother one bites the dust and (uhh)\nCardiac arrest clutchin (uhh) your chest suckin (uhh)\nYour last breath, M-R, period, Meth\nNiggas, dyin from papercuts, BLEEDIN TO DEATH\nDown these mean streets Jonny Quest (uhh)\nFrom ASCAP to NASDAQ, get that money sack (uhh)\nThese habitats ain't no place to raise a FAMILY AT\nThese alley cats (ha) be at war with these dirty rats (uhh)\nSo watch your back when you come to the slums\nThere ain't nowhere to RUN from the Iron Lizard Lung (uhh)\nPhasers on stun - I be givin it to Son\nMy plate spares no one, \"Miuzi Weighs a Ton\"\n\n[E-Dub] Word up, Meth yo\n\n\"..stomp with the Big Dogs\" (4X)\n\n[E-Dub] Yeah, uh-huh, yeah\n\nCheck it, check it out (2X)\n\"..stomp with the Big Dogs\"\n\n[E-Dub] Yeah Dynamic Duo, uhh\n\n[Redman]\n'Pon cock, the Don Juan Doc\nSend crews back to the shoeshine box, connect the dots\nMy description, black male, yellowed and mellow\nI make it hard for MC's to run neck and elbow\nWith D-O, penal code, Deebo knows\nTo duck when he hear the bike, wit the squeaky clutch\nSwallow this hard act to follow\nYou could parachute off my slang and use my, rhymes to toggle\nI'm tense, so smooth I can't be fingerprinted\nI stomp harder in slow motion.. den, den-den-den\nYo, fuck your applaud, bitches still rush me\nLike they rushed the store before Soul Train Awards\nIncorporate a law, whoever ain't raw get they hand chopped\nBy Jamal with the Wu sword (whoooo-eeeee!)\nMy crew specialize in, snakin your bitch\nRobbin you, while you on the floor, shakin and shit\nI'm doin me now do you (Yo, who you?) Doc\nI bomb shit til the Conflict's Crucial, I\nBe the black \"El Nino,\" I mean yo, I'm supreme\nLike the team show witcha paid yo' cream fo'\n(To see us sit down?) Yo, nah we get the fuck up\n(And leave the one you wit) Then take her from Usher\nThat's right, six-double-oh with chrome pipes\nU.S. Marshal's, out to pen us up like Snipes\n(Throw it in drive) Fuck takin me and Meth alive!\n(Aiyyo you lick that a-way) You lick out the other side!\n\n[E-Dub] Ohh, yeah yeah", "image": "https://images.rapgenius.com/d879d8f156d4defe65e1a246ff7c85e3.220x220x1.jpg"}], "artist": "Method Man"}