{"songs": [{"title": "Layover", "album": null, "year": "2018-10-11", "lyrics": "[Intro]\nCaesar Lee\nYeah\nTwo sides to every story\nHendrix\nShawty where you been these days?\nShawty where you been these days?\n\n[Chorus]\nI ain't talked to shawty in a few days\nBut you already know, girl I been missin' you\nKeep some pretty shit at the condo\nGot some thick shit on the bed with her legs open\nBitch came through for a few, that's a layover\nBitch came through for a hour, that's a layover\nWhat you been doin'? I been chillin' at the crib, poolside with some pretty-pretty bitches tryna get a tan\nHad some Chinese freaks come over to the crib last night just to fuck, [?]\nHad them Chinese freaks come over, tried molly, now they wanna ask Shoota \"Do we got them xans?\"\nTell me you don't want no parts with this\nTell me you don't want no parts in this\nTell me your heart ain't in this shit\nYour heart ain't never been in this shit\nYour heart ain't gotta be in this shit\nYour heart ain't never been in this shit\n\n[Verse]\nI'ma flood some ice on both of my wrists\nI'ma flood that ice on both of my wrists\nBaby came over, she a new vibe\nBaby came over, she a new vibe\nTell me that you ready for the turn up right now like me, just like me\nDon't tell me that I fuck you so good, you don't wanna leave, you don't wanna leave\nGot a case of Hennessy in the fridge on chill for you\nYou need to call up some more girls, tryna feel on you\nPretty girls they in my collection, baby don't get caught out there flexin'\nAnd you got that Birk' on your shoulder, and I got them racks, won't fold up\nYou can't pick a hood don't know us\nYou can't pick a hood don't know us\nYou can't go nowhere and they don't know us\nYou ain't for them lights and the cameras when I roll up\nSo I fuck your main thing to keep her composure\nRollin' up dodie, and I'm gone off soda\nDon't I keep that red drink with me like Piru?\nThen I put them solitaries in it, go to Caicos\nFuckin' on the sand, baby they don't understand us\nFuckin' on the sand, baby they don't understand us\nChristian Louboutins on your feet when you stand up\nNow I'm gettin' fed up, cause tryna bed fuck\nActin' like a nigga don't know she bout a dollar\nActin' like nigga ain't got no models\nI'll fuck a pop star at this time here tomorrow\nThese girls walk around, these strip clubs ours\nGoin' out the country, get that dirty money, gotta watch who did the laundry\nI gotta get it rainstorm, sleet, or sunny\nI gotta chase this mofuckin' money\n\n[Chorus]\nI ain't talked to shawty in a few days\nBut you already know, girl I been missin' you\nI ain't talked to shawty in a few days\nBut you already know, girl I been missin' you\nKeep some pretty shit at the condo\nGot some thick shit on the bed with her legs open\nBitch came through for a few, that's a layover\nBitch came through for an hour, that's a layover\nWhat you been doing? I been chillin' at the crib, poolside with some pretty-pretty bitches tryna get a tan\nHad some Chinese freaks come over to the crib last night just to fuck, [?]\nHad them Chinese freaks come over, tried molly, now they wanna ask Shoota \"Do we got them xans?\"\nTell me you don't want no parts with this\nTell me you don't want no parts in this\nTell me your heart ain't in this shit\nYour heart ain't never been in this shit\nYour heart ain't gotta be in this shit\nYour heart ain't never been in this shit", "image": "https://images.genius.com/383bdf7e658c81236926af98a9211465.780x780x1.png"}], "artist": "Future"}