{"songs": [{"title": "Paper’d up", "album": "Paid Tha Cost To Be Da Bo$$", "year": "2002-11-26", "lyrics": "\"He's a sweet, soul, brother!\"\n\n{*beat from the remix of \"Paid in Full\" plays in the background*}\n[Snoop] Money, money, money, money!\n[Snoop] Money, money, money, money!\n\"You make me feel so goooood!\"\n[Snoop] Money, money, money, money!\n\n[Snoop] Money, money, money, money!\n[Snoop] Money, money, money, money!\n[Snoop] Money, money, money, money!\n\n[Hook: Mr. Kane]\nIn the world of change, here I am\nTryin to have some thangs\nSo what you need is some game, to get your money man\nOhh baby, in the world of paper, paper\n\n[Snoop Dogg]\nThinkin of a master plan\nCause ain't nuttin but sweat inside my hand\nSo I dig into my pockets, all my money is spent\nSo I dig deeper, but still comin up with lint\nSo I, start my mission, leave my residence\nThinkin how can I get some dead presidents\nI need money, I used to see a stick-up kid\nSo I think of all the devious things I did\nI used to roll up, this is a hold up, ain't nuttin funny\nStop smilin, cause still don't nuttin move but the money\nCause now I've learned to earn cause I'm righteous\nI feel great, so maybe I might just\nSearch fo' a 9 to 5, if I strive\nThen maybe I'll stay alive\nSo I walk up the street, whistlin this\nFeelin out of place cause man do I miss\nA pen and a paper, a stereo, a tape of\nMe and Warren G, and a big fat plate of\nChicken wings, cause that's my favorite thang\nBut without no money man that shit's a dream\nCause I don't like to dream about gettin paid\nSo I dig into the books of the rhymes that I've made\nSoon as I bust 'em see if I got pull\nI hit the DoggHouse, cause I'm paid in full {*echoes*}\n\n[Hook]\n\n{*beat from the remix of \"Paid in Full\" plays in the background*}\n[Snoop] Money, money, money, money!\n[Snoop] Money, money, money, money!\n[Snoop] Money, money, money!\n\n[Mr. Kane: repeat 2X w/ ad libs]\nW-w-w-w-w-well\nW-w-w-w-w-welllll\nOhhhh baby\nW-w-w-w-w-well\nW-w-w-w-wellll, ohh baby\nOhhhh baby", "image": "https://images.genius.com/020258c5b50e382d2763d8439947dad4.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}