{"songs": [{"title": "Drippin’", "album": "Slime Season 3", "year": "2016-03-25", "lyrics": "[Intro]\nThugger\nWhat do you want from me?\nIt’s YSL until we dead you know, I understand\nI know\n\n[Verse 1]\nHe geeked on beat\n2 freaks I just geeked SK Kel-Tech XPD\nOG off codeine, need more lean\nNeed more weed to proceed\nI know B's, I throw B's, tall P's\nI know Pirus I know nine deuce\nIf I call 'em they gon' kill it too\nCall Duke, he gon' shoot\nYea, Thugger took it too\nLivin' bulletproof, if I was you I would be mad too\nGood shooter, I'ma good shooter\nAnd if I wanna see some titties I go eat at Hooters\nYeah, yeah, I could be your teacher cause I got a ruler\nMy dad ate hunters for 30 years and they call him cougar, yeah\nI got ice baby, fuck your jeweler, oh\nI sip Actavis straight out the cooler\nGirl you know it, I'll do ya\nI give you head, I want your Medusa\nI need it, I need it (Yeah)\nI need it, I need it (Yeah)\nI need it, I need it (Yeah)\nTurn me up, I need it, I need it (Yeah)\n\n[Interlude]\nYou don't know ting about me okay?\nLeave me alone man, I just want the money\nI get back with you when I'm done, okay?\nListen up, ayy\n\n[Chorus]\nI done spent, I done, I done spent a bag, hundred bands on her nigga\nWoah I'm comin', comin'\nI'm comin' in your lane ready to clash with you nigga\nBig 6, yeah 6\n6 golds in my mouth like an Old English can lil' nigga\nI wrote my verse with 3 bars like an Adidas Stan Smith nigga\n\n[Verse 2]\nNigga, nigga, nigga\nDidn't I tell you 'bout playin' with YSL? (slatt)\nNigga, nigga, nigga\nDidn't I tell you 'bout playin' with Lil Jeff?\nWhy you playin'?\nSwear to God I got 100 blues, 100 reds, 100 blacks, on my right and left\nNiggas spent two bands on some Maison Margiela, pussy nigga watch your step\nBangin' big B's fuck a Bentley\nDo 150 just because they think it’s rented\nBitches from the north, south, east, west, we got plenty\nNew Uncle Luke inside your town with way more riches\nMake me, make me nut and get some new Indian Remy\nEh make me, make me bleed, swear to God, leave a nigga drippin'\nDrip, I'm drippin' from the start to the finish nigga\nDrip, I'm drippin' with my niggas and these bitches nigga\nDrip, I got some Raf Simons on, no trippin' nigga\nDrippin', dick-dick-dick, keep on drippin' nigga\nDick on a stick, got her drippin' nigga\nDick with my clique got her drippin' nigga\nDick on her lips don't kiss it (oh drippin')\nJump, at it ribbit ribbit (drippin')\n\n[Chorus]\nI done spent, I done\nI done spent about a hundred bands on her nigga\nWoah I'm comin', comin'\nI'm comin' in your lane ready to clash with you nigga\nBig 6, yeah 6\n6 golds in my mouth like an Old English can lil' nigga\nI wrote my verse with 3 bars like an Adidas Stan Smith nigga", "image": "https://images.genius.com/4eb5a8d50ced58dcb61391d68217d745.1000x1000x1.jpg"}], "artist": "Young Thug"}