{"songs": [{"title": "Tilted Pt. 3", "album": null, "year": null, "lyrics": "I did this, in the memory of a couple of my homies\nCouple of your homies. Um, Not acknowledging or glorifying any type of violence or anything type of thing like that\nPeace\n\nHook x7\n\nYeah, uh uh, uh uh\n\nSouthside, Westside, Northside, Eastside\nWestside. Haha\n\nYeah\n\nThis one goes out, to the mothers who lost sons, that was just trying to gain family\nR.I.P.: Ram, Kato, Frank Niddy\n\nYeah\n\nI tips my to the left\nIt's Just the Westside of 'em\nDon't ride nothing\nBut, know plenty people peoples that ride somethin'\nDecided. Cousin I should describe the lives of 'em\nSome wives drive Chevy's With Gold Daytons and the tires of 'em\nFirst, let me tell you where son grown\nGrew up 'round GD's, VL's, Black Souls, and Unknowns\nHat ya' hang, bangin' sacks, slangin' with guns on\nForced to drop the Forks, or you gotta run home\nOr you gotta run anyway after you drop the Folks\nBecause they was really Folks, looking for somebody to jump on\nWars, Lords, shoot up all the corners they hung on\nHear the Squeeze, and aim for my region brother to come home\nViolations, Laws, Lessons, Sessions, & Mandates\nPicnic Collections, lip side throwing they handshakes\nThat's where I stayed, drive-bys where I played\nGDN in they fades, with a 150 Sittin' Sideways\n\nHook x7\n\nUh, I seen 'em\nBrawl for it, Write on the wall for, Get Kicked out the Mall for it, Run from the Law for it\nSeen things they should've never saw for it\nLong as it's, All Well, All Mighty, All Righty, they all for it\nBlackhawk fitted, get hit in the jaw for it\nBlue and Black Jordans sportin' might get 'cha applaused for it\nPeace Treaty for like a Week if Chief & them Called for it\n150 deep in ya' street, & saying y'all broke it\nBut what started that was a shawty walking down the ave in a starter cap\nPops sayin' he ain't want me no part of that\nThose happenings with those hats and things\nMove me out south, now, all my homies is Latin Kings\nTeaching me Spanish, Lowrider Magazines, Black & Gold Bandannas, taggin' crowns up on the scene\nThat was the age, how kinda Lupe was made, homies from Pax Town to Terror, New Era\nSittin' Sideways\n\nHook x8\n\nUh, See from Youth, I wasn't a stranger\nPops schooled 'em to the El Rukn's, plus the P. Stone Rangers\nAnd, as I grew up, knew most of what happened threw up\nDisciples loved the Geto Boys because they was talkin' to Hoover\nTime Versus Life is all a Process\nDrive-Bys, Gang Fights, and Lock Downs had us scared of the Projects\nCouple Arab Knights, and Solid Foes I knew, thought that them Moes was cool\nThey said salam aleikum to..\nTo my Out of Town Friends, to take off they hat, that they couldn't wear that in the places I was taking them to\nMy Homies was Breakin' it, so I was Breakin' it, too\nIf they started chasin' them, then they was chasin' me, too\nProbably all got cousins, brothers, sisters, & loved ones that probably died for nothin'\nOn shakin' up or somethin'\nTo the mothers that payed, to my homies in the grave, keep a glittered 150 in ya' memory, homie\nSittin' Sideways\n\nHook x4", "image": "https://images.genius.com/b67b7f5bfbd7eb8c5c334fa8b05a2432.400x400x1.jpg"}], "artist": "Lupe Fiasco"}