{"songs": [{"title": "Step Daddy", "album": "Shorty the Pimp", "year": "1992-07-14", "lyrics": "Step daddy, I know what you want\nI come through like the first of the month\nAin't nothing but a holiday\nWhen I fuck my way\nI'm her worst nightmare, her wettest dream\nWe always do that freaky thing\nAnd when I'm coming to her house\nI know just what she's all about\nDon't waste no time, get in it\nKeep on humping til my head starts spinning\nWhoop that ass like a world champ\nBreak the chairs and knock down the lamp\nIn my birthday suit, dripping wet\nNo I ain't tripping how freaky it get\nFeeling that sweat on my eyebrow\nNothing can't stop me but nature now\nFucking your bitch like them pros do\nSomething you can't get close to\nBorn to Mack in my drop-top Caddy\n\nJust call me \"Step Daddy\" (Repeat 3x)\n\nHow many mothers in the house tonight, ladies?\nHow many daddies take care of them babies?\nThey got to learn to take care of their own\nGetting girls pregnant and leaving 'em alone\nFine little bitches, way too young\nMet Short Dog and then gave him some\nSo why you keep talking about the PG&E?\nWhen all she ever wanted was a man like me\nTo come through, and do that thang\nStep Daddy in the house, and I got game\nSo lock your back doors, check your hoes\nSuck on the pussy and lick them toes\nStep Daddy coming through like a porno flick\nFreak the bitch, now she loves my dick\nShe let me bust big nuts all in her mouth\nAnd S.D. turned the bitch out\n\nJust call me \"Step Daddy\" (Repeat 4x)\n\nGold-digging bitches in the City of Dope\nGot it going on like a daytime soap\nShe's so freaky, she'll make you shout\nOne on the way and got two at the house\nThree different daddies, and all is well\nAs long as them brothers keep making mail\nAnd it's cool, when I come through\nPlay step daddy for a minute or two\nAnd then fuck her, that's how it's done\nIt's not my daughter and it's not my son\nSo what if your kids start tearing shit up\nI really don't give a fuck\nI never get mad about the shit they break\nWhen I'm around, we eat steak\nI let the motherfuckers act bad\nBuy 'em toys when they're crying and sad\nCould you be 'em? Your baby's momma\nTurns me on in her freaky pajamas\nI come through and make the whole house happy\n\nJust call me \"Step Daddy\" (Repeat 3x)\n\nGet freaky, and do it wild\nOn the floor, doggy style\nI get rugburns, on my knees\nWhile your bitch be crying \"Please\nDon't stop\" So I don't\nI fuck her like I know you won't\nPull out my dick and make her lose hope\nStick it back in and make her take some notes\nIf that's your bitch, homeboy you'd better keep her\nCause she won't stay off my beeper\nYou can't fuck her and I appreciate it\nEven though I know you hate it\nI keep getting that good shit\nS.D. wanna fuck your bitch\nCome through and make the ho so happy\n\nJust call me \"Step Daddy\" (Repeat 2x)", "image": "https://images.genius.com/f82c145afb5d000ecf7dbe3e66f99782.1000x992x1.jpg"}], "artist": "Too $hort"}