{"songs": [{"title": "Over My Dead Body", "album": "Take Care", "year": "2011-11-15", "lyrics": "[Chorus 1: Chantal Kreviazuk]\nHow I'm feeling, it doesn't matter\n'Cause you know I'm okay\nInstead, I ask myself, \"Why do you worry?\"\nWhen you know, you know I'm the same\nI know, I know you don't love me, baby\nThey’re trying to take you away from me\nOnly over my dead body\n\n[Verse 1: Drake]\nI think I killed e'rybody\nIn the game last year, man, fuck it, I was on though\nAnd I thought I found the girl of my dreams\nAt a strip club, mmm-mmm, fuck it, I was wrong though\nShout out to all my niggas living tax free\nNowadays it's six figures when they tax me\nOh well, I guess you lose some and win some\nLong as the outcome is income\nYou know I want it all and then some\nShout out to Asian girls, let the lights dim some\nShots came, I don't know where they was sent from\nProbably some bad hoes I'm 'bout to take the hint from\nYeah, you know me well, nigga\nI mean you ain't the only real nigga\nThey got me on these white women like Seal, nigga\nSlave to the pussy but I'm just playing the field, nigga\nAre these people really discussing my career again?\nAsking if I'll be going platinum in a year again?\nDon't I got the shit the world wanna hear again?\nDon't Michael Jordan still got his hoop earring in?\nMan all of your flows bore me: paint drying\nAnd I don't ever be trippin off of what ain't mine\nAnd I be hearing the shit you say through the grapevine\nBut jealousy is just love and hate at the same time\nYeah, it's been that way from the beginning\nI just been playing, I ain't even notice I was winning\n\n[Refrain: Drake]\nAnd this is the only sound you should fear\nMan, these kids wear crowns over here and everything is all right\n\n[Chorus 2: Chantal Kreviazuk]\nOh, I know, I know you don't love me, baby\nThey’re trying to take you away from me\nOnly over my dead body\n\n[Verse 2: Drake]\nYou say I'm old news, well who the new star?\nCause if I'm going anywhere, it's probably too far\nJust performed at a Bar Mitzvah over in the States\nUsed half of the money to beat my brother's case\nRed wine over Fed time\nAnd shout out to the niggas that's doing dead time\nShout out to the bitches there when it's bedtime\nAnd fuck you to the niggas that think it's their time\nYeah, don't make me take your life apart, boy\nYou and whoever the fuck gave you your start boy\nOh, you wanna be a motherfucking funny guy?\nDon't make me break your Kevin Hart, boy\nYeah, it's whatever\nYou know, feeling good, living better\nI think maybe I was numb to it last year\nBut you know I feel it now more than ever\nMy city love me like Mac Dre in the Bay\nSecond album, I'm back paving the way\nThe backpackers are back on the bandwagon\nLike this was my comeback season back, back in the day\nAnd I met your baby moms last night\nWe took a picture together, I hope she frames it!\nAnd I was drinking at the Palms last night\nAnd ended up losing everything that I came with\nFeel like I've been here before, huh?\nI still got ten years to go, huh?\n\n[Refrain: Drake]\nAnd this is the only sound you should fear\nMan, these kids wear crowns over here and everything is all right\n\n[Chorus 2: Chantal Kreviazuk]\nOh, I know, I know you don't love me, baby\nThey’re trying to take you away from me\nOnly over my dead body\n\n[Outro]\nThree in the morning, still going down\n\n[Produced by Chantal Kreviazuk and Noah \"40\" Shebib]", "image": "https://images.genius.com/a50b0608affc94c4dae3d502a65ea390.1000x1000x1.jpg"}], "artist": "Drake"}