{"songs": [{"title": "I Luv", "album": "Chase the Cat", "year": null, "lyrics": "I love (I love)\nI love it (I love it baby)\nLove this (I love it, love it)\nLove, ooooohh!\nLove this (I love it girl)\nLove (Oh you really want it girl?)\nLove (I love this shit)\nLove this (Be-atch!!)\n\n[Daz Dillinger]\nShe was a betty I done knew back in the day\nLittle scary lil' bitch from around the way\nPlus she sucked and fucked all day\nWith a little bit of Alize (Alize..Alize..)\n\n[Scarface]\nI put it down for these young hoes\nGet the pussy like I'm married\nAnd send her home with the cock swoll, did her pops know?\nLittle girl that he tryna protect was in the crib doin porno\n\n[Too Short]\nFo' sho' baby, I know these hoes\nStep up too 'em and show these hoes\nI never wonder to myself \"Would she?\"\nI get deep in her mind and her pussy\n\n[Trick Daddy]\nWho dat? She was the world's greatest, dick sucker\nPlay the note with the tongue while, finger fuck her\nI hit it in the back of the donk, in the back of the Benz\nGot my dick in her ass, front of one of her friends\n\n[Scarface]\nFace down, ass up -- bitch be still whikle I bust this nut\nI rock hard while I'm in these guts\nWipe my dick and then that's enough\n\n[Daz]\nShe wanna kiss me after she done lick me\nSlap the drunk, you know the ho got Tinesi\n\n[Too Short]\nDaz, this punk bitch wanna get with me\nCuz the ho lookin for a P-I-M-P\n\n[Trick Daddy]\nYou know the ho don't know no better\nI would rough ride ya ass, but the magnum's better\nI know a lot of niggas done paid ya bitch\nRemember one thing, I got a major bitch\n\n[Too Short]\nPull up on the stroll, in the fo' door Caddy\nSlapped the bitch, she hollered \"No, no daddy!\"\nI got the cash, if she don't that's her ass\nSo quick, so fast\n\n[Hook - 1st pt. Too Short, 2nd pt. by female]\nI love gettin my head blown\nI love gettin my nuts rubbed\nI love gettin my dick licked\nI love gettin my nuts sucked\nI love gettin my pussy ate\nI love when niggas see me masterbate\nI love it when you nut all in my face\nI love it baby, but I can't stand the taste\n\n[Too Short]\nI once knew a bitch named Erica\nWay back in the day, she had a geri curl\nI made her suck my dick on the ferris wheel\nBeen pimpin all my life, big player for real\n\n[Daz]\nI said \"Come on girl, you know how it's 'sposed to be\"\nIt's makin me nut, but feel our fantasy\nCome on come on baby, won't you get the best of me\nI SMELL PUSSY!!\n\n[Trick Daddy]\nGet T double D on the double stack\nAnd one dose of the dick, she be doublin back\nSee me, I've been known to shit on hoes\nCuff her cold, straight spit on hoes\n\n[Scarface]\nI been known to step on a bitch\nPut a thumb in your ass, while I slap your clit\nBut ain't no way that I'mma lick yo' shit\nTell 'em what she is Short Dog (Be-itch!)\n\n[Hook - 2x]\n\n[Trick Daddy]\nI love, gettin my thug on\nOn dirty joints, in the school zone\nEverything I cop, I put dubs on\nI love this..\n\n[Too Short]\nWhen I'm at the club\nSee a girl get freaky and I slap her butt\nShe try to say \"Short Dog, that's enough\"\nYou know I love it little mam, can't pass it up\nCuz I..\n\n[Hook to fade]", "image": "https://images.genius.com/5879836b504c477d7cddacb459c66e7c.776x768x1.jpg"}], "artist": "Too $hort"}