{"songs": [{"title": "Gorgeous", "album": "My Beautiful Dark Twisted Fantasy", "year": "2010-11-22", "lyrics": "[Produced by Kanye West, Mike Dean & No I.D.]\n\n[Chorus: Kid Cudi]\nAin't no question if I want it, I need it\nI can feel it slowly drifting away from me\nI'm on the edge, so why you playing? I'm saying\nI will never ever let you live this down, down, down\nNot for nothing I've foreseen it, I dream it\nI can feel it slowly drifting away from me\nNo more chances if you blow this, you bogus\nI will never ever let you live this down, down, down\n\n[Verse 1: Kanye West]\nPenitentiary chances, the devil dances\nAnd eventually answers to the call of Autumn\nAll of them fallin' for the love of ballin'\nGot caught with 30 rocks, the cop look like Alec Baldwin\nInter-century anthems based off inner-city tantrums\nBased off the way we was branded\nFace it; Jerome get more time than Brandon\nAnd at the airport they check all through my bag\nAnd tell me that it’s random\nBut we stay winning, this week has been a bad massage\nI need a happy ending and a new beginning\nAnd a new fitted, and some job opportunities that's lucrative\nThis the real world, homie, school finished\nThey done stole your dreams, you dunno who did it\nI treat the cash the way the government treats AIDS\nI won't be satisfied til all my niggas get it, get it?\n\n[Chorus: Kid Cudi]\nAin't no question if I want it, I need it\nI can feel it slowly drifting away from me\nI'm on the edge, so why you playing? I'm saying\nI will never ever let you live this down, down, down\n\n[Verse 2: Kanye West]\nIs hip-hop just a euphemism for a new religion?\nThe soul music of the slaves that the youth is missing\nBut this is more than just my road to redemption\nMalcolm West had the whole nation standing at attention\nAs long as I'm in Polo smiling, they think they got me\nBut they would try to crack me if they ever see a black me\nI thought I chose a field where they couldn't sack me\nIf a nigga ain't shootin' a jump shot, running a track meet\nBut this pimp is, at the top of Mount Olympus\nReady for the World's game, this is my Olympics\nWe make 'em say ho 'cause the game is so pimpish\nChoke a South Park writer with a fishstick\nI insisted to get up offa this dick\nAnd these drugs, niggas can't resist it\nRemind me of when they tried to have Ali enlisted\nIf I ever wasn't the greatest nigga, I must have missed it!\n\n[Chorus: Kid Cudi]\nAin't no question if I want it, I need it\nI can feel it slowly drifting away from me\nI'm on the edge, so why you playing? I'm saying\nI will never ever let you live this down, down, down\n\n[Verse 3: Kanye West]\nI need more drinks and less lights\nAnd that American Apparel girl in just tights\nShe told the director she tryna get in a school\nHe said, \"Take them glasses off and get in the pool\"\nIt’s been a while since I watched the tube\n'Cause like a Crip set, I got way too many blues for any more bad news\nI was looking at my resume feeling real fresh today\nThey rewrite history, I don't believe in yesterday\nAnd what's a black Beatle anyway, a fucking roach?\nI guess that's why they got me sitting in fucking coach\nMy guy said I need a different approach\n'Cause people is looking at me like I'm sniffing coke\nIt's not funny anymore, try different jokes\nTell 'em hug and kiss my ass, X and O\nAnd kiss the ring while they at it, do my thing while I got it\nPlay strings for the dramatic ending of that wack shit\nAct like I ain't had a belt in two classes\nI ain't got it I'm coming after whoever who has it\nI'm coming after whoever; who has it?\nYou blowin' up, that’s good, fantastic\nThat, y'all, it's like that, y'all\nI don't really give a fuck about it at all\n'Cause the same people that tried to black ball me\nForgot about two things, my black balls\n\n[Chorus: Kid Cudi]\nAin't no question if I want it, I need it\nI can feel it slowly drifting away from me\nI'm on the edge, so why you playing? I'm saying\nI will never ever let you live this down, down, down\n\n[Verse 4: Raekwon]\nI done copped Timb's, lived in lenses, kid\nArmani suits, fresh fruits, Bally boots and Benzes\nCounting up, smoking, one cuff\nLive as a red Jag, a Louis bag, grabbing a blunt, fuck it\nSteam about a hundred and one L's\nKites off to jails, buying sweats, running up in Stetson\nNigga hat game was special\nIt matched every black pair of Nikes, throwing dice for decimals\nThe older head, bolder head, would train a soldier head\nMake sure he right in the field, not a soldier dead\nThat meant code red, bent off the black skunk\nThe black dutch, back of the old shed\nIf you can't live, you dying, you give or buy in\nKeep it real or keep it moving, keep grinding\nKeep shining, to every young man, this is a plan\nLearn from others like your brothers Rae and Kanye\n\n[Chorus: Kid Cudi]\nNot for nothing I've forseen it, I dream it\nI can feel it slowly drifting away from me\nNo more chances if you blow this, you bogus\nI will never ever let you live this down, down, down", "image": "https://images.genius.com/31f9198f646ae211d8fe2c855e6ea4d0.998x998x1.png"}], "artist": "Kanye West"}