{"songs": [{"title": "The Truth", "album": "KRS-One", "year": "1995-11-07", "lyrics": "It's not natural If it goes against God\nIt's not factual Her truth is not hard\nIt's not natural If it goes against God\nIt's not factual Gimme the truth!\n\nListen to the lyric as the negative is shrinkin\nIt's shrinkin out your life when you decide to change your thinkin\nOne of the first things we gotta switch around of course\nIs Jesus Christ, and him dying on the cross\nYou're looking at the cross, surrounded in it's mystery\nWith Jesus on the cross in a, total misery\nNow seperate Jesus from the cross so you can see\nThe truth about the cross, and the cross's history\nThe cross was created by the Roman government\nIt's only purpose and use, is cap-i-tal punishment\nBut Jesus Christ, was all about the revolution\nWhile the cross was used as Jesus Christ's execution\nSee what if Jesus Christ, was hung upon a tree\nUpon every church wall, that's exactly what you'd see\nIf Jesus Christ, was shot in the head with no respect\nWe'd all have little gold guns around our neck\nIf Jesus Christ was killed in electic chair, now get it\nYou'd be knealing to the electric chair with Jesus, still in it\nYou gaze upon the cross, and you see the execution\nYou yell stop the violence but the cross you're still using\n\nIt's not natural If it goes against God\nIt's not factual Her truth is not hard\nIt's not natural If it goes against God\nIt's not factual Gimme the truth!\n\nSo I say listen, listen, open up your third eye vision\nGod is not down with religion\nReligion they be sellin it, listen up, God is intelligent\nReading of the bible is irrelevant\nYou gotta look within yourself, not a scripture\nKRS-One comes to rearrange the God picture\nIf you sit and believe, you can acheive\nIf you sit and accept, you don't know, what's correct\nOr incorrect, take for instance Adam and Eve\nThe first two people on the planet, or so you believe\nTheir first time in heaven kids they had, Cain and Abel\nHuh, now let me show you why the story's unstable\nAccording to the story, according to what you believe\nThere was only Cain, Abel, Adam, and Eve\nOn the whole planet, now use your intellect\nAnd tell me, what did Cain and Abel do for sex?\nUpon the whole planet there was not another\nCould it be for sex, heh, they were looking at each other?\nHold up! I thought the church wasn't into that\nBut wait, still yet, there is another fact\nHow did the world get populated?\nNow tell me if I'm wrong, but obviously Eve had it goin on\nThink for a minute, I know it gets notorious\nBut yo G, check out the chorus\n\nIt's not natural If it goes against God\nIt's not factual Her truth is not hard\nIt's not natural If it goes against God\nIt's not factual Gimme the truth!\n\n[Rich Nice]\nYo yo...\nYo bring that back\nI wanna say something on this BlastMaster session\nYo this is Rich Nice\nYou brothers gotta stop treating these hoes like nice girls\nAnd these nice girls like hoes\n\n[KRS-One]\nTrue indeed, I'd like to welcome the rebirth of the Goddess\nWord up it's all about knowledge of self\nYo Busta Rhymes, why don't you take the session over from here", "image": "https://images.genius.com/78316fa7efcf948425107910e5b3a92b.300x300x1.jpg"}], "artist": "KRS-One"}