{"songs": [{"title": "Cut Her Off (Remix)", "album": null, "year": "2014-04-05", "lyrics": "[Intro: Rick Ross]\nThem boys wearing fake belts\nThey drink fake lean\nNiggas smoking synthetic, huh\n\n[Verse 1: Rick Ross]\nBitches dropping like, swish, Ricky Pitino\n50 racks on the corner, think it's casino\nHoes thinking I'm boojie, when I'm smoking on gucci\nAll my shoes be Gucci, I got a mill for Lil Boosie\nDouble M on the rise, duct tape on my pistol\nSo you won't be surprised, it's time to make this official\nGot a bitch on the East, got a bitch on the West\nWhen I'm eating the box, I let her sit on my chest\nYou know I love her a lot, she let me fuck on my yacht\nRolling dice with my niggas, a half a ticket, the pot\nI blew a brick out in Reno, Uncle Paulie casino\nNiggas shot up my car, walk away like Benzino\nPercocets for myself, I feel a hundred degrees\nNiggas getting that money, bust it down with your team\nFrom the Chevy to Bentley, from the Bentley to Rolls\nIt may seem like we do, we never loving them hoes\nIt gotta add up tonight, we call it simple mathematics\nTransfers and wires, that happen under the mattress\nNiggas shoot for the stars, pray a larger amount\nNiggas thought I was slipping, I got a grip on the South\n\n[Chorus: K Camp]\nIt ain't nothing to cut that bitch off\nIt ain't nothing to cut that bitch off\nSo what you saying ho?\nYou Know I'm the man ho?\n\n[Post-Chorus: K Camp]\nNothing but a bird, I'ma leave you where you stand, ho\nHeard you got a man ho\nHope he understand though\nYou ain't nothing but a creeper baby, I'm just saying, though\nSaying, though\nIt ain't nothing to cut that bitch off\nIt ain't nothing to cut that bitch off\n\n[Verse 1: K Camp]\nCreeping on the low, hope your man don't see\nShe will bust it down for some damn Lime-A-Ritas\nChew me like some bubblegum, something like Rasheeda\nGotta get my partner some, she on me like Adidas\nBaby, you can't hold back, better stop flexing like you not\nYour man tryna patrol then I guess he is a cop\nBut he really can't cuff if he busting at my spot\nBut I done had enough cause you making my shit hot\nBlowing up a nigga phone, what I tell yo ass 'bout that?\nTryna hold something, hold my nuts, can you do that?\nCan you play around with that mouth while he hit it from the back?\nYou can't say nothing now cause we all been through that, through that\n\n[Chorus: K Camp]\nIt ain't nothing to cut that bitch off\nIt ain't nothing to cut that bitch off\nSo what you saying ho?\nYou know I'm the man ho?\n\n[Verse 2: 2 Chainz]\nYou know that ain't a real bag bitch, that's a knock off\nWhen I get that work I get to juggin' like hot sauce\nAll swimmin pool lakefront\nHit it from the back, rearrange her lace front\nStuntin', tattoos on my neck and on my kidney\nIf I don't like that ho I turn her ass into a frisbee\nIf I dont like your disc I turn that ho into a frisbee\nI throw it out on Old Nat right by the Wendy’s\nThree cellphones and all of 'em jumpin'\nI can see your hoes and all em' nothing\nYeah I'm a don don', Don Cheadle, Don Cornelius\nWatch the Dom spill\nPockets fat as Don Carter Jeter, nigga, done deal!\n\n[Chorus: K Camp]\nIt ain't nothing to cut that bitch off\nIt ain't nothing to cut that bitch off\nSo what you saying ho?\nYou know I'm the man ho?\n\n[Verse 3: K Camp]\nBaby I'm ashamed, why you acting this way?\nHeard she 'bout that action, you can bring her this way\nHit her on yo mattress, make you feel some type of way\nPass her to my migos, they gonna bust it, ¡Andale!\nPlease don't play no games cause I know thats what you like\nKnock it out the frame, baby girl, it's alright\nYeah that pussy bomb, I just call it dynamite\nYou ready? Here I come, I can do this shit all night\n\n[Chorus: K Camp]\nIt ain't nothing to cut that bitch off\nIt ain't nothing to cut that bitch off\nSo what you saying ho?\nYou know I'm the man ho?\n\n[Post-Chorus: K Camp]\nNothing but a bird, I'ma leave you where you stand, ho\nHeard you got a man ho\nHope he understand though\nYou ain't nothing but a creeper baby, I'm just saying, though\nSaying, though\nIt ain't nothing to cut that bitch off\nIt ain't nothing to cut that bitch off", "image": "https://images.genius.com/3dce21029cdd8aab73eb473e015807d5.1000x1000x1.jpg"}], "artist": "Rick Ross"}