{"songs": [{"title": "WW III", "album": null, "year": null, "lyrics": "Ruff Ryders, Ruff Ryders\nRyde or Die - Volume 2\n(Tugboats.. ehh, it's over..)\nAhhh-HAHAHAHAHAHAHA!!\nIt's the second time around motherf*cker! (YESS!)\nVolume 2 - Ryde or Die, BIATCH!\nGangsta nigga and we gon' rock this motherf*cker, you dig me?\n(Fo' sho' baby!) We the square root of the motherf*ckin streets!\n(Fo' sho' baby!) Double R, you cocksuckin sons of bitches!!\nYEAH!!\nState yo' name gangsta (Big Snoop Dogg.. bow wow!)\nWhere you representin? (West coast)\nYou gon' hold it down? (Please believe it nigga)\nEnough said then nigga (hold up.. BIATCH)\nMmm, let's make this official\nShine yo' boots and load yo' pistols\nPull out yo best credentials cause thislll\nBe the official for the fictitial\nDoggy Dogg and Big Swizzll, nigga blow the whistle\nSmokin on some bomb-beeda secondhand smoke\nWill getcha, hitcha, and make you all get the picture\nDig this - when was the last time you seen me\nPosted up West coasted up and sippin on some Remi?\nBelieve me - it ain't easy been Deezy (nah it ain't)\nWit these jealous rap niggas and these punk ass breezies\nMan - I couldn't remember what they told me\nWhen I first came in the game but thangs done changed\nCall it what you wanna, keep the heat up on it\nEast, Long Beach, California - spinnin like a 'Tona\nBangin on the corner, hot like a sauna\nSo you best to back up off me or I kick this ? on ya\nState yo' name yungsta (YUNG WUN!)\nWhere you representin? (ATL SHAWTY!)\nYou gon' hold it down? (DAMN RIGHT!)\nWell nuff said then (Ease up, nigga!)\n(Man throw dem treys up!)\nShorty pop a lot, actin like you got a lot\nWit all that fake ice on his watch, this nigga wanna get got\nComing to my city wit all that hot shit and his fake ass click\nI'ma put somethin in him and bust his wig, I'm on some thugged out shit\nYou better be strapped boy, how you love that boy, act boy\nI'ma break yo back boy, wit a bat boy, where you at boy\nHold up I'm cold hearted; DAMN RIGHT, I get retarded\nI'm a yung-un and down here, bitch I'm the hardest\nYou can hoot, hide and talk that shit\nI'ma stay low, keep it real and sho' to come up\nBut when I bite you gone feel that there, it's real down here\nWatch your mouth boy, you might get killed down here\nI'm a Ryde or Die nigga, put somethin in your eye nigga\nGet beside yourself it's bye bye nigga\nWhen it come to Glock cockin and drop poppin\nI'm the first to hit the block and go to war wit the cops f*ck nigga\nState yo' name gangsta (Scarface)\nWhere you representin? (Motherf*ckin South)\nYou gon' hold it down? (You God damn right)\nEnough said then nigga\nHeidi-hoe! Scarface and Don, pullin the strings to your alarm\nBringin terror wit this beretta, I clutch in my palm\nI'm scarin motherf*ckers straight wit mine\nGuerilla tactics, guranteein my enemy die\nIt's worldwide army alert for all soliders\nEither you Ruff Ryde, Ryde Ruff, or roll over\nIt's a stick up, so down on yo knees, cause I'm sicker\nDon't disrepect it, you don't disrespect me nigga\nI'm the one these niggas call on; when negotiations are halted\nAnd the time comes for the beatin of the bosses\nMake 'em an offer that can't refuse\nThey don't comply, well now I'm bout to stank these fools\nFool, I guess these niggas think they can't be moved\nRealizie they don't scare niggas like they thank they do\nYou f*ck wit me, I gots to f*ck wit you\nWorld War 3 motherf*cker, I thought you knew\nState yo' name gangsta (Jadakiss nigga)\nWhere you representin? (East coast dawg)\nYou gon' hold it down? (Why wouldn't I?)\nEnough said then nigga (Let's go)\n(Let's go)\nIf you f*ckin wit the 'Kiss, you ain't gon' breathe\nThe only time I lick in the air is New Year's Eve\nSonny from \"Bronx Tale,\" you can't leave\nGet kissed on yo' cheek then you meant to die\nCause when the gun start poppin then my temperature rise\nYou know my style; 20 niggas wit 40 Cals\nNine years ago you was hollerin shorty wild\nNow I'm in the rap game twistin these honies out\nNever left the crack game still on a money route\nI run through the industry looking for enemies\nY'all niggas sound sick and Jada the remedy\nGet shot in yo' eyes and mouth\nCan't see can't talk when you f*ckin wit the heart of New York\nAnd that's fouler that swallowin pork\nAnd to f*ck wit the feds dog\nYou know I push the prowler to court\nToast on my lap, got the East Coast on my back, UH\nHow many times must I tell you motherf*ckers\nWe ain't industry niggas\nWe in-the-STREETS, niggas - you motherf*ckin right!\nRuff Ryders forever, yeah bitch - now what?\nRyde.. or.. Die.. you talk it, we live it (East COAST!)\nSo Ryde.. or.. Die.. you want it, we give it (West COAST!)\nSo Ryde.. or.. Die.. you start it, we end it (Dirty SOUTH!)\nSo Ryde.. or.. Die.. you talk it, we live it (Mid WEST!)\nSo Ryde.. or.. Die.. you want it, we give it (Ruff RYDERS!)\nSo Ryde.. or.. Die.. you start it, we end it (Biatch!)\nYeah, Double R motherf*ckers - Ruff Ryders", "image": "https://images.genius.com/34d1815281afeb502b98075367058136.453x453x1.jpg"}], "artist": "Jadakiss"}