{"songs": [{"title": "T.I. vs. T.I.P", "album": "Trap Muzik", "year": "2003-08-19", "lyrics": "[Rap Verse: T.I.] + (T.I.P. alter ego)\nI wanna talk to you shawty (Why?)\nCause you be trippin' sometimes\n(Man I'm just trying stay true to what I say in my rhymes)\nIt ain't a doubt in my mind, but you got a lot on the line\nYou need to think 'bout yo' actions (Why?)\nYou be overreactin' (Maaaan)\nLook at Cap and K.T. listen to K.P\n(What about 'em; where the fuck this shit come from?)\nOr to a J.G. to your mama or D.P\nOr somebody shawty shit you be makin' me sick (Nigga fuck you!)\nYou'd be a motherfuckin' fool if you blow this lick (Alright alright)\nThis the chance of a lifetime, you know this shit\nRemember what Jarmel told us \"stay focused Tip\" (I remember nigga)\n(Man but they be tryin' me shawty)\nNiggas be tryin' you how?\nAy let them tell it, you was just another guy in the crowd\n(Naw, but they be talkin' too loud)\nMan you be listenin' too hard\nJust pay these niggas no attention and keep fuckin' they broads (Alright)\nI know you harder than these niggas (Yeah) and smarter than these niggas (Yeah)\nMore heart than these niggas (Yeah)\nQuit worryin' 'bout thses niggas\n(Ay man fuck these niggas I'm from Bankhead and I don't know where you stayed at)\n(But talkin' sideways behind my back, I never played that)\n(Since you become a payed cat T.I. you been so layed back)\n(I wonder where lil' bad ass Tip from back in the day at)\nMan that nigga had to stay back there so we could be that\nNigga on TV and FYI we got the P back\nHold up shawty freeze Jack (What?)\n\"Lame\" I'll never be that (Yeah OK)\nChanged my name a thousand times and still a G believe that\n(Oh yeah good we go Ki's)\n(That nigga from overseas back)\nYou see what I be sayin' 'bout this nigga (What man? Shit)\nI don't believe that\nYou ain't listenin' is ya?\nYou got issues I got kids, 2 boys a lil' girl\n(Ay I know nigga they my kids too)\nYou know it's one false move and it's back to the big house\nThe judge told our ass \"one more time\" and we ain't gettin' out\n(I wouldn't say that)\nBe thinkin' 'bout standin' outside in the sunshine (Ho)\nWatchin' nigga's heads get buck for cuttin' the lunchline\nAy shawty you ain't 'posed to make the same mistake more than one time\n(And I ain't made the same mistake twice since uh '99)\nPlease, boy stop don't get me started folk it's not the time\nAnd let's just do this shit my way get paid and have a lot of time\nPlenty fine bitches, who gon' pull shawty you is?\n(Man you know Tip got the hoes)\nAnd Tip hoes got gold teeth (What that mean? What you tryna say nigga?)\nMine got jobs, good credit and they own features\n(And mine boost clothes, sell 'dro, got the blow cheap)\n(I guess it's just depend on what ya like folk) That's right folk\n(And I was just kiddin' 'bout them kites folk) Heh, alright folk\n(I'm really glad we had a chance to sit it down and rap a tad)\n(I admit you had a couple points, sometimes I act a ass)\nAy but it is so important to keep it real though just like ya said\nNo record deal, no amount of mil' shall go to my head\n(And with that said can't nobody tell us shit, so fuck the hatin')\nHow many niggas real enough to stand and give theyself a straightenin'?", "image": "https://images.genius.com/ab2d918a9feba95d0153b56bb925499d.1000x1000x1.jpg"}], "artist": "T.I."}