{"songs": [{"title": "Who Got The Yayo?", "album": null, "year": "2016-01-12", "lyrics": "[Intro]\nYeah, yeah\nWho got the yayo? (Who got the yayo?)\nWho got the...\nWho got the yayo? Who got the yayo? (Who got the yayo?)\nWho got the...\nWho got the yayo?\nWho got the... Who got the...\n\n[Chorus]\nWho got the yayo? Who got the yayo?\nI need some cut when I'm using the scale\nI don't sell drugs, it's not really my style\nBut I need a plan if this music'll fail\nSo who got the yayo? Who got the yayo?\nI know some hustlers I'm cool with in jail\nI'll be god damn if I work a real job\nI need thousands of dollars the movement is real\nSo who got the yayo?\n\n[Verse 1]\nWho got the plug?\nPromised my auntie I'd never sell drugs\nShe told me pray if I ever need guidance\nThe truth was my logic, I never got love\nWorkin' my ass off to see where it get me\nI need some white girl, I need me some Becky\nPackets of money, I bet that they'll love me\nCause none of my honeys don't even respect me\nWho got the yayo? Show me them niggas\nBitch, I've been rapping since HOV was a dealer\nThere's too many rappers that no one can hear 'em\nAnd Diddy and Yeezy don't notice a nigga\nDon't notice a nigga, tell me who next\nWho got that Yayo? Who got that best?\nGrandma gon' kill me she find that I'm dealin'\nBut my time is limited who got the stretch?\n250, 350, 550, yeah\nI got some heat when they ride with me, yeah\nI wanna see what they got for me\nNigga now who got the yayo? don't lie to me, yeah\nDon't get it twisted I move and I ain't lost a step\nI don't usually get played off the left\nI got Hitlers like Adolf that hate on a nigga\nThen take off and then its a pill at the [?]\nAnd I'm cooking like Raekwon the Chef\nPoppa told me don't leave cake on the dresser\nThey playin' not death\nPray on a downfall I hope I fall down\nThen they all keep just smilin' then there go my rep\nWhat she gon' say, I need this rap money move out the way\nIf I don't get famous then who got the yay?\nWho got the yay? Who got the yay?\n\n[Chorus]\nWho got the yayo? Who got the yayo?\nI need some cut when I'm using the scale\nI don't sell drugs, it's not really my style\nBut I need a plan if this music'll fail\nSo who got the yayo? Who got the yayo?\nI know some hustlers I'm cool with in jail\nI'll be god damn if I work a real job\nI need thousands of dollars the movement is real\nSo who got the yayo? Who got the yayo?\n\n[Bridge]\nWho got the, who got the\nWho got the yayo? Who got the yayo?\nWho got the yayo? (x2)\n\nShip me some packages who got the mail\nI'll be god damned if my music'll fail\nSo who got the yayo? Who got the yayo?\n\n[Verse 2]\nWho got the yayo? Who got that coco\nI don't know shit about chopping no cholo\nHeard you know niggas that cop for the low-low\nBe careful them snitches call cops on the low-low\nAnd I just be solo, I just be dolo\nPushing a hooptie, I'm riding a loso\nUnder the radar, can't look like no target\nThem niggas was talking but not anymore doe\nWho got the yayo? Who got the crocket?\nThat Betty Crocker they using then cop it\nBurying these niggas, put two in a coffin\nI'm usually exhausted the truth is I'm driving\n2000-and fucking-5 miles with no choppers around\nIf I make it from rapping then I can sit down\nBut the truth is this shit is not promised for now\nSo I guess I'll just move in wich-y'all niggas\nNow gimmie 250, 350, 550, yeah\nI need some heat when they ride with me, yeah\nI wanna see what they got for me nigga\nNow who got the yayo? Don't lie to me, yeah\nDon't get it twisted I move and I ain't lost a step\nI can spit like I ain't lost a breath\nRunning this shit with the heat on and ain't broke a sweat\nWhat the fuck is you think you gon' get\nPut the cake on my back, bleeding my ink from this pen\nIn my heart I still think I'mma win\nIf I don't then I guess I'll just trap out the bando\nMove keys a pianos and lay in the sand\nWhat the fuck you gon' say\nI need the trap money move out the way\nIf I don't get famous then who got the yay?\nWho got the yay, nigga who got the yay?\n\n[Chorus]\nWho got the yayo? Who got the yayo?\nI need some cut when I'm using the scale\nI don't sell drugs, it's not really my style\nBut I need a plan if this music'll fail\nSo who got the yayo? Who got the yayo?\nI know some hustlers I'm cool with in jail\nAnd I'll be god damn if I work a real job\nI need thousands of dollars the movement is real\nNigga who got the yayo? Who got the yayo?\n\n[Bridge]\nWho got the , who got the\nWho got the yayo? Who got the yayo?\n\nShip me some packages who got the mail\nSo who got the yayo?\nI don't sell drugs, it's not really my style\nBut I need a plan if this music'll fail\nSo who got the yayo?\n\nWho got the, who got the, who got the yayo?\nWho got the yayo? (x2)\n\nI don't sell drugs, it's not really my style\nBut I need a plan if this music'll fa-\nWho got the yayo?\n\n[Verse 3]\nI never wanted to sell any drugs\nPass the cocaina, cocaine or coquito\nThat power, perico that product is Deebo\nMight need a lot of them kilos\nI might need a pound just for me doe\nCause I just be stressin'\nI got some problems I'm guessin\nI'm crazy you probably think different\nI'm high on a mission\nTomorrow ain't promised\nSo this is just me whippin' pies in the kitchen\nThe pastor keep preachin' I think keep singing that gospel\nThen I look straight through the bible\nAll of my teachers said rappin' is easy\nBut being successful is harder than I knew\nAnd I would just nod I said, \"Well I'm gonna try\"\nShe looked back at me and stared, \"Do what you can\"\nI said, \"Well what if I fail?\" She said, \"Just do it again\"\nDo what you fail, don't let the devil inside you\nDon't let the ghetto deprive you\nPray everyday, but if you lose all of your faith\nThen you must do what you got to\nThen you must do what you got to\nMy nigga got get it, go take it go make it you business\nCause haters don't listen, now who got the flavor\nI'm missing, now who got the flavor said\n\n[Chorus]\nWho got the yayo? Who got the yayo?\nI need some cut when I'm using the scale\nI don't sell drugs, it's not really my style\nBut I need a plan if this music'll fail\nSo who got the yayo? Who got the yayo?\nI know some hustlers I'm cool with in jail\nAnd I'll be god damn if I work a real job\nI need thousands of dollars the movement is real\nNigga who got the yayo? Who got the yayo?\nWho got the, who got the, who got the yayo?\nWho got the yayo?", "image": "https://images.rapgenius.com/a9f0c4db023d7bb729b96850839d37e9.500x500x1.jpg"}], "artist": "Joyner Lucas"}