{"songs": [{"title": "I See Fire (Remix)", "album": null, "year": "2016-09-17", "lyrics": "[Intro: 2Pac]\nNiggas need a spot where we can kick it\nA spot where we belong, that's just for us\nNiggas ain't gotta get all dressed up and be Hollywood\nY'knahmean? Where do niggas go when we die?\nAin't no heaven for a thug nigga\nThat's why we go to thug mansion\nThat's the only place where thugs get in free\nAnd you gotta be a G\n\n(DJ Shota)\n\n[Verse 1: 2Pac]\nWas it the liquor, that makes me act blind, times that I'm with her\nAnonymous pictures of other niggas tryin' to kiss her\nWill I love her or shall I diss her?\nI'm sick of this scandalous shit I deal wit', tryin' to paint a perfect picture\nMy memories of jealousy no longer carefree\nCause so much bullshit your girlfriends keep tellin' me\nI'm on tour, but now my bedroom's an open door\nSo it got me thinkin', what am I tryin' for?\nWhen I was young I was so very dumb, eager to please\nA lil', trick on a mission tryin' to get in my P\nMe and my niggas is thug niggas, former known drug dealers\nWe don't love bitches and believe, they don't love niggas\nI gotta blame my attraction\nBut you became a distraction, a threat to my paper stackin'\nI thought you changed but now I know\nCan't turn a hoe into a housewife, baby, and there you go\n\n[Bridge: DMX]\nCan't stop, gotta eat\nStepping on, my feet\nSpread love, think it's sweet\nUh, uh, uh all you catz don't know\n\n[Verse 2: Ed Sheeran]\nIf this is to end in fire, then we should all burn together\nWatch the flames climb high into the night\nCalling out father oh, stand by and we will\nWatch the flames burn auburn on the mountain side\n\n[Verse 3: Ed Sheeran]\nAnd if we should die tonight, we should all die together\nRaise a glass of wine for the last time\nCalling out father oh, prepare as we will\nWatch the flames burn auburn on the mountain side\nDesolation comes upon the sky\n\n[Chorus: Ed Sheeran]\nNow I see fire, inside the mountain\nI see fire, burning the trees\nAnd I see fire, hollowing souls\nI see fire, blood in the breeze\nAnd I hope that you remember me\n\n(DJ Shota)\n\n[Verse 4: The Notorious B.I.G.]\nA nigga never been as broke as me – I like that\nWhen I was young I had two pair of Lees, besides that\nThe pin stripes and the gray\nThe one I wore on Mondays and Wednesdays\nWhile niggas flirt I'm sewing tigers on my shirts, and alligators\nYou want to see the inside, I see you later\nHere comes the drama, oh\nThat's that nigga with the fake, blaow\nWhy you punch me in my face? Stay in your place\nPlay your position, here come my intuition\nGo in this nigga pocket, rob him while his friends watchin'\nAnd hoes clockin', here comes respect\nHis crew's your crew or they might be next\nLook at they man eye, big man, they never try\nSo we rolled with them, stole with them\nI mean loyalty, niggas bought me milks at lunch\nThe milks was chocolate, the cookies, butter crunch\n\n[Verse 5: Ed Sheeran]\nOh, should my people fall then surely I'll do the same\nConfined in mountain halls, we got too close to the flame\nCalling out father oh, hold fast and we will\nWatch the flames burn auburn on the mountain side\nDesolation comes upon the sky\n\n[Chorus: Ed Sheeran]\nNow I see fire, inside the mountain\nI see fire, burning the trees\nAnd I see fire, hollowing souls\nI see fire, blood in the breeze\nAnd I hope that you remember me\n\n[Bridge: DMX]\nCan't stop, gotta eat\nStepping on, my feet\nSpread love, think it's sweet\nUh, uh, uh all you catz don't know\nCan't stop, gotta eat\nStepping on, my feet\nSpread love, think it's sweet\nUh, uh, uh all you catz don't know\nCan't stop, gotta eat\nStepping on, my feet\nSpread love, think it's sweet\nUh, uh, uh all you catz don't know\nCan't stop, gotta eat\nStepping on, my feet\nSpread love, think it's sweet\nUh, uh, uh all you catz don't know\n\n[Chorus: Ed Sheeran]\nNow I see fire, inside the mountain\nI see fire, burning the trees\nAnd I see fire, hollowing souls\nI see fire, blood in the breeze\nAnd I hope that you remember me", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}