{"songs": [{"title": "Green Island", "album": "Dare Iz a Darkside", "year": "1994-11-22", "lyrics": "[Production by Reggie Noble]\n\n[Intro dialogue]\n\n[Intro: Redman]\nYeah, yeah, yeah, yeah, yeah, yeah yeah\n(Yeah, he's so funky, smoke the Maui wowi)\nWho is them niggas Redman and Reggie Noble?\nYeah, yeah, yeah, yeah, yeah, yeah yeah\n(He's so funky, whoa, whoa)\nWho is them niggas Redman and Reggie Noble?\nNah, nah, check it out, check it out\n\n[Verse 1: Redman]\nMotherfucking\nLadies and gentleman, my style's rugged like Timberland\nWhen I clock dividends women give me more love than Wimbledon, uh\nMy style flow local like New Jersey transit\nAnd I can't stand it, and you'll need Teddy to unjam it when I cram it\nI'm from, N to the E, W-A-R-K\nNewark NJ got the AK, when I wave bitch you better say \"Heey!\"\nI'm a Kid From the Hall\nI got big balls to make your pussy walls drip in your lace drawers\nHey boy this is the way the East Coast swing it so bring it\nMan, I turn your ass Brown-er than James with the Sex Machine shit\nI keep the chronic patrol on the road\nIn case you're wondering why I keep mad izm\n'Cause I smoke everybody else's shit up\nMy style's the ultimate funk when I mic checka, one two checka\nAnd I give effects to niggas with my Black and Decker, so check\nThe manuscript, man you flipped, put it down if you can't handle it\nGot a B.R.C.G., Blunt Rollers College Graduate\nI got a degrees in Physics on how high I can get\nThen next I check how many niggas that can die from my TEC\nCause the N-E-W-A-R-K\nIs where the niggas robbin' and stealin' and buckin' niggas every day\nNow Jersey's on max so pass the dutchie on the left hand side\nGot the hidash, in case we cridash, in my ride\nSo, sliiiide, before I call the medics\nYou can bet, bitch, you couldn't get fly if you was FedEx\nCan I, drop the funk on ya, run it on ya?\nStrong as ammonia, smell it from here to California\n'Cause Reggie Noble dropped that cock named Noble at Sunoco\nI'm better than rice and beans when I rock you ocho to ocho\nMy music more underground than a kid at 300 XL\nConvertible, fuel-injected, that's why my style's well-respected\nI'm dope on the ridealz, so fidealz, on my didealz\nAnd chumps are wondering what two niggas dropped the funk, funk!\n\n[Chorus]\n(Yeah, yeah, yeah, yeah, yeah, yeah yeah)\nWho is them niggas, who is them niggas\nWho is dem niggas Redman and Reggie Noble\n(Yeah, yeah, yeah, yeah, yeah, yeah yeah)\nWho is them niggas, who is them niggas\nReggie Noble, drop the funk one time\n\n[Verse 2: Redman]\nVerbally you never heard of me, I smoke you third degrees\nAnd 'cause surgery for emergency 'cause Reggie Noble style like burglary\nI get hot busted when I dip my nuggets (Hey)\n'Cause it take a million niggas to stop it just like Chuck did\n'Cause we run around Newark with the nine on cock\nKeep it heated for the brothers that's not off my block\nAnd if ya don't know the flavor, be a tough guy and enter\nSo go show you more nigga events than Jacob Javits center\nI'm genuine, to the rhyme, get your canines\nCops, I got the hot Glock stocked for when it's playtime\nI rock around the Robin tweet tweet on the calendar\n'Cause you couldn't pull my number if your class major was Algebra\nI make bitches moan to my Stallone without Sylvester\n'Cause I'm more deadlier than a whole school system of asbestos\nSo check us, I always smoke mad blunts before breakfast\n'Cause I, Get Around like 2Pac with Poetic in my Justice\nHold tight, hold tight, everybody hold tight\nI'm Super like my man Cat, 'cause I keep my styles jam packed\nI (wreawow) like Anthrax, split my pants like Bill Bixby\nYou could tell the tracks was fat from the work of my MP-60\nI smoke the chronic that's why my sinus always fucked up\n(Cam-boo, cam-boo cam-boo) Will have you fucked up\nI blaze blunts with my nigga Mel-low, yo, say hello\n(Yo, what up dog?)\nReally, now pass the second blunt to Quilly\n\n[Uncle Quilly]\nNow sit your big ass down 'cause I don't know about this rap stuff\nThere wasn't rap when I was pickin' cotton, saying 'massa'\nY'all young whippersnappers, with the caps on backwards\nMan, y'all fuck around with Quilly I kick a bone out yo' ass quick\n(Watch out now) I ain't bullshittin'\nI represent the O-O-O-O-OG's from '43 goddamnit\nAnd if you keep on with that dirty mistreating\nI'm gon' whoop your ass 'til your heart stop beating goddamnit\n\n[Verse 3: Redman]\nAyo, chronic bubonic, the funky bionic you find it I'll have to rewind it\nWhere minds are blinded, \"Time 4 Sum Aksion\", so time to find it\nI'm smoked out like a cookout, ah, look out, my dick's out\nThat was last album when I was bouncing on trains like Malcolm\nI was hiiiiigh, I thought I wouldn't survive\nThat's why I quit my nine to five and got live\nBecause this \"hip to the hop\" shit fills my pockets\nAnd I'm Audi for '94 because I already got my props\nHoes, hoes, and more hoes...\n\n[Outro: Redman & (*Reggie Noble*)]\nNah nah nah nah n-nah\nOn the real though, on the real\nAll jokes aside, word is bond\nI'ma come pick you up tomorrow (*Nah nah*)\nWe gon get some drinks (*Fuck that*)\nGet the boodah (*Nah*), get the hiddash (*Ohhkay*)\nAnd we gon chill, we gon smoke (*Fuck you*)\nWe gon get fucked up (*Nah, nah*)\nWe gon go right to the deacon and party (*Nah, uh-uh*)\nWord is bond on the real (*Lies. Lies. Lies! LIES!*)\nYo c'mon B (*Yo, fuck the lyin'*)\nI'm forreal—I'm forreal this time, god\n(*I remember what you did to me last album, pussy ass*)\nI'm forreal—nah nah, check this out\nOn the real this time (*You be gamin', god*)\nI'm not gon front on you word is bond (*You be gamin', forreal*)\nWe gon go right to the muthafuckin' deacon and chill, nigga! (*Forreal man?*)\nWord up! (*Pshh, a'ight man. Word up, don't play me. Yo—Anyway where the fuck the deacon at?*)\nA-heh... My DEAC-in yo mouth! Heheheh hahahahaha\n(*Yo FUCK you*)", "image": "https://images.genius.com/d90c906f33a174fa71425b4dd339eb96.1000x1000x1.jpg"}], "artist": "Redman"}