{"songs": [{"title": "30,000", "album": "Young Sinatra", "year": "2011-09-19", "lyrics": "[Intro]\n\"Wake up, you bitch-ass\nCracker-ass motherfucker, sike, nah\"\n\n[Verse 1: Logic]\nSee all I ever wanted was a window to sit close to\nAnd you don't understand but in the end you ain't supposed to\nI'm talking first class, 30,000 feet under my ass\nLiving life on the dash, constant pursuit of cash\nNow I'm living a life that you and yours could only dream about\nAnd just a couple years ago this shit I used to scheme about\nRehearsing for hours in front of my mirror\nUntil my voice was hoarse but my vision was clearer\nSee this that new school style but the flow remind you of them old days\nFast forward to the present, rappers have no class like snow days\nGood God, let me bring it back to hip-hops first renaissance\n‘96 Kool-Aid and Sega Genesis\n\n[Chorus: Logic]\n\"Hey yo, hey yo, how you keep it so real?\nI love the way your lyrics make me feel\"\nRoll it and get high, light it up and fly\nFeeling like I'm 30,000 feet up in the sky\nI got em' saying\n\"Hey yo, hey yo, how you keep it so real?\nI love the way your lyrics make me feel\"\nRoll it and get high, light it up and fly\nFeeling like I'm 30,000 feet up in the sky\n\n[Interlude: Erykah Badu]\nI just want a chance to fly\nA chance to cry, and a long bye\n\n[Verse 2: Logic]\nSo many people think that they know my whole situation\nConversations with people that handle public relations\nNothing but hundred dollar bills and standing ovations\nSlowly pacing until I kill like that boy Jason\nIt ain't nothing, never folding or bluffin'\nGet money, fuck bitches but respect women cause we love em'\nKiss em', touch em' and rub em'\nFuck em' but never grub em'\nHit it fast but then I slow it down like Robitussin\nShorty giving me brain until concussion\nThe club run out of vodka the second we rush in\nNever under estimate the power in which I'm bustin'\nMy lyricism got yo girl blushin'\nAin't even touch her and yet she gushin' (ha)\nAward shows, chilling with all my bros\nThree-piece Ralph Lauren and some Jordans, I suppose\n\n[Chorus: Logic]\n\"Hey yo, hey yo, how you keep it so real?\nI love the way your lyrics make me feel\"\nRoll it and get high, light it up and fly\nFeeling like I'm 30,000 feet up in the sky\nI got em' saying\n\"Hey yo, hey yo, how you keep it so real?\nI love the way your lyrics make me feel\"\nRoll it and get high, light it up and fly\nFeeling like I'm 30,000 feet up in the sky\n\n[Outro: Erykah Badu]\nOut my mind I'm tusslin'\nBack and forth 'tween here and hustlin'\nI don't wanna time travel no mo'\nI wanna be here, my thinkin'\nSay, on this porch I'm rockin'\nBack and forth like Lightnin' Hopkins\nSo if anybody speak to Scotty\nTell him, \"Beam me up!\"", "image": "https://images.genius.com/6118bfdbbde22320e3c6bc130e1772d3.1000x1000x1.jpg"}], "artist": "Logic"}