{"songs": [{"title": "Kocky", "album": "Welcome to Strangeland", "year": "2011-11-08", "lyrics": "[Intro: Tech N9ne]\nAw shit, Aw fuck\nMe, Kali and Ces we go to get bucks\nOn the path but didn't think we'd get stuck\nBy some crass lads that's 'bout to get tough\nAnd they play not, temperatures stay hot\nAnd don't nobody be relaxin' when on they block\nLike it a yay spot, never let that pay stop\nUnless you wanna be trippin' with Kutty and Jay Rock\n\n[Verse 1: Kutt Calhoun]\nBad Flames, Feature Presentation, Raw and UnKutt\nAll of 'em undeniable classics like who they come from\nMost talked about on the internet\nNigga I been a vet\nEleven years strong, still holdin' on\nAnd I ain't finished yet\nRed headed-est step child\nIt's a plague spread to accept how it is\nWanna see me fall get me out the loot\nWhen all I've done is respect how it is\nNow I gotta turn into a nigga you once knew\nNo mo' papers off\nProbation I'm a cold case\nHe gon' sho hate it\nWhen I throw a bomb like Troy Aikman\nTo do damage you walk in a bunch huh?\nWhen you niggas are really the punks huh?\nIn the hearts of men, I'm seeing cowards\nWhere you niggas is at when the funk come?\nSmoke a blunt to that\nWhen the funk ensues you resort to rap\nSaid you was all in, 2 on the 10 you must distort the facts\nSo I pledge allegiance to only me I only breathe\nEat to shit, the chrome's in me [probably wrong]\nThe only misconstrued message in the song you see\nIs it's not arrogance, this is what it's grown to be\n\n[Hook: Krizz Kaliko]\nSee you can tell be the way that I use my wealth I'm cocky\nThis the man right chyea as to ya'll out south I'm cocky\nAnd if you ain't figured out what we talkin' about\nI'm the one they all talkin' about\nAnd if they hatin' me that only mean my name in they mouth I'm cocky\n\n[Verse 2: Jay Rock]\nPull up to the spot, watch the girls all pause\nLike a dirty ass dog house, drawers gon' fall\nBitches get wet when they see that candy paint\nSuck yo dick through them boxers 'cuz you got bank\nShout out to them shot callers, niggas got rank\nDeath to you snitches singin' like Drake\nI'm all the way silent, I will never break\nPillow talking to them hoes, you all the way gay\nThe problem is niggas never know they place\nJust know your role, play your part and you'll be straight\nBut niggas crooked like Deebo eye\nAnd could never ever see why we so fly\nYou either gotta go home or go hard\nKeep a bad bitch with a good job and good jaw\nBlack strap on me, yeah you can tell when I walk\nPitbull of the leash if you flinch I'mma bark\n\n[Hook: Krizz Kaliko]\n\n[Verse 3: Tech N9ne]\nYou thought we through\nStop the bull talk\nWe rule papi\nSmooth\nKnock these fools off me\nBoo sloppy\nHow I have they bitches bukakke\nMove awfully cool hotty\nSlob these jewels softly\nWho's naughty?\nShock exudes bossy\nDude's cocky\nSoowoo got me blue blocky\nWhen I do shop\nAt the woowop\nI bought the boo jockey\nMy Gucc watch\nPerfuse rocks\nAnd I be loose of the Caribou Lou\nMami your poonani\nSaw me and got tsunami\nTech's elated I'm rated\nThey say the greatest\nParaded my latest\nPages I created\nAnd the news shot me\nThat's why I'm hated\nYou faggots is weak and dated\nWhen I spray this place and do away\nWith this fakin' then erase it who'd stop me?\nIt is evident, that you wonder why and where her cheddar went\nThat look on your face I'm seeing I'd rather get\nWhen your boo prop me\nI'm a sedative\nCuz I beat it repetitive\nUsed twat be\nAll in ya mouth and you never knew Charlie\n\n[Hook : Krizz Kaliko x2]", "image": "https://images.genius.com/4392f3223b9e5965e7f76dc529941352.1000x1000x1.jpg"}], "artist": "Tech N9ne"}