{"songs": [{"title": "How You Like Me Now", "album": "Raw", "year": "2010-11-19", "lyrics": "[Intro: Hopsin]\nHow you like me now?\nHow you like me now?\nYeah, how you like now?\nI'm flossin' all you nigga's like BLAOW!\nWOW!\n\n[Verse 1: Hopsin]\nYo! So I'ma flop? Nah, that's where you guys are wrong\nI shit on niggas, that's why I rap with a diaper on\nDon't be approaching me with none of your mess\nTalking 'bout where I belong\nJust tell your friends all about me and sit\nAnd watch as they minds get blown\nNiggas on that basic shit, now I'ma go ape a bit\nI know y'all prayed for this, so don't trip\nHere's a handkerchief for your razored wrists\nMy flow got a few ways to switch\nNiggas act hard, I'ma change the script\nEverybody begging to be a buddy of mine\n'Cause they know I got skills y'all can't prevent\nWhen I lace a hit you impressive, none\nYou can take it as a lesson, son\nIf you was smart, you'd drop the mic and\nTry to stick up a bank with a weapon drawn\nPillow Man was slept upon\nThat's the reason the West was gone\nBut I set the bomb, when it blows up\nYou niggas will know where the heck I'm from\nI'm keeping it raw fo' sho', flow so diabolical\nYou all should know that it took like 10 whole years\nJust for my balls to grow\nNo overnight success, I'm struggling just to write this mess\nThe road to righteousness was more than words and skill that I possess\n\n[Hook: Hopsin]\nI was the nigga all you niggas used to clown\nNow when I come around, I got you motherfuckers like \"Wow!\"\nYeah, how you like me now?\nI'm flossin' all you nigga's like BLAOW!\nAyo! How you like me now, motherfucker?\nHow you like me..\nYo! How you like me now, motherfucker?\nHow you like me..\nAyo! Let me see you clown, motherfuckers\nLet me see..\nYeah! How you like me now, motherfuckers (Guess who it is!)\nHow you like me...\n\n[Verse 2: SwizZz]\nAyo! S-W-I-Z-Z and add another\nMy swagger makes your girl want to cut, like upper\nI'm mad hot, dog, my 16s should come with mustard\nIf you think I have a big head, then you haven't see my brother!\nStacked bad niggas swore I wouldn't make it rappin'\nPromised it couldn't happen and hated with a passion\nA mixtape later I silenced their laughing\nNow the same ones would probably suck my dick if I asked 'em\nIt's obvious I have it locked like CAPS\nRocking to a bitch fight beat that slaps\nI do it major, Poly Sci & Bio\nI don't have haters only fans in denial\nNow gimme a minute to hop in my zone, I'm making 'em pop like Mary\nI'm rocking the party to act all retarded, I'm making 'em pop like cherries\nI know this nigga is wild, but I will knock him down\nJust answer this question for me:\nHow you like me, how you like me now?\n\n[Hook: Hopsin]\nI was the nigga all you niggas used to clown\nNow when I come around, I got you motherfuckers like \"Wow!\"\nYeah, how you like me now?\nI'm flossin' all you nigga's like BLAOW!\nAyo! How you like me now, motherfucker?\nHow you like me..\nYo! How you like me now, motherfucker?\nHow you like me..\nAyo! Let me see you clown, motherfuckers\nLet me see..\nYeah! How you like me now, motherfuckers\nHow you like me...\n\n[Verse 3: Hopsin]\nOh, so you wanna be cool? You wanna be pals?\nYou wanna be closest friends?\nSee a nigga so hot, that's why I'm popping up\nLike I'm toaster bread\nI say shit that don't get said\nThat's why I can't roll with feds\nIlluminati got they eye on me\nAnd they gon' see to it that a nigga don't get fed\nMy purpose ain't hard to see\nI pull up on rappers like \"pardon me\nYour bars are weak, you put too much time\nTryna get your sparkling charm to bling\"\nI be kickin' 'em multiple syllables\nRipping up shows and holding my genitals\nGet a dose of the wicked flow before your niggas run up\nSaying \"Homie, you should've known\"\nIt's crazy how life can switch\nI ain't gonna lie to you mine was shit\nNot anymore, shit changed up\nFrom woman selection to size of tits\nI know bitches who can ride the dick\nNiggas who think that my eyes are sick\nShowing 'em many agents who be loving\nThe melodies that I supply them with\nYo! I gotta a note for all y'all\nIn the rap game who got an album stacking dough\nY'all got big, chains'll start falling off like Michael Jackson's nose\nWho the illest? Y'all know\nHopsin, yeah, bravo\nI'm 'bout to leave the building right now\nAbadeAbade that's all folks\n\n[Hook: Hopsin]\nI was the nigga all you niggas used to clown\nNow when I come around, I got you motherfuckers like \"Wow!\"\nYeah, how you like me now?\nI'm flossin' all you nigga's like BLAOW!\nAyo! How you like me now, motherfucker?\nHow you like me..\nYo! How you like me now, motherfucker?\nHow you like me..\nAyo! Let me see you clown, motherfuckers\nLet me see..\nYeah! How you like me now, motherfuckers\nHow you like me...\n\n[Outro: SwizZz]\nLet me ask you niggas something\nHow you like me ha?\nAll you motherfuckers used to hate talk that shit\nHow you like me?\nI know I haven't made a check\nBut I get more than you bitch-ass\nI talkin' on the song like it's my track and shit\nSorry Hop for takin' it over, but I had to\nI mean I didn't have to but - holla at me\nYou know what it is?\nFunk Volume\nOne more time for y'all, Funk Volume", "image": "https://images.genius.com/511235d7620c5ca1e6b46a485cb180d6.1000x1000x1.jpg"}], "artist": "Hopsin"}