{"songs": [{"title": "My Fault (Pizza Mix)", "album": "The Singles", "year": "1999-11-02", "lyrics": "[G] Eminem as Susan (the girl)\n[D] Eminem as Dave\n[J] Eminem as John\n[R] Eminem as Ron\n\n[Chorus]\nI never meant to give you mushrooms, girl\nI never meant to bring you to my world\nBut now you're sittin' in the corner, crying\nAnd now it's my fault, my fault\nI never meant to give you mushrooms, girl\nI never meant to bring you to my world\nBut now you're sittin' in the corner, crying\nAnd now it's my fault, my fault\n\n[Verse 1]\nI went to John's rave with Ron and Dave\nAnd met a new wave blonde babe with half of her head shaved\nA nurse aid who came to get laid and *tied* up\nWith first aid tape and *raped* on the first date\nSusan -- an ex-manic depressive who just moved from Houston\nWho loves blues and alternative music (Whattup?)\nTold me she was starvin, I said it wasn't a problem (Nah!)\nI got a coupon for this pizza with everything on it\nWe can double the mushrooms and minus the sausage\n[G] I'm allergic to fungus\nCome on Sue, that's nonsense\nWho's at the door? Pizza man!\nWho ordered pizza? Susan, it's yours\n[G] Nuh uh\nIf you got it with double mushrooms on it then I don't want it\nShutup Susan I'll pick em off it\nOh hell, I might as well try it, I'll be alright\nSusan you just swallowed the wrong slice!!\n\n[Chorus]\nI never meant to give you mushrooms, girl\nI never meant to bring you to my world\nBut now you're sittin' in the corner, crying\nAnd now it's my fault, my fault (I'm sorry)\nI never meant to give you mushrooms, girl\nI never meant to bring you to my world\nBut now you're sittin' in the corner, crying\nAnd now it's my fault, my fault\n\n[Verse 2]\n\"Yo Sue!\"\n[G] Get away from me, I don't know you\nOh shoot, she's tripping..\n[G] I need to go puke!! (Bleahh!)\nI wasn't tryin to turn this into somethin major\nI just wanted to make you appreciate flavor\nSusan, stop cryin, I don't hate ya\nI'm sorry your father used to chase ya and spank ya with hangers\nSo what they locked you in the attic in your dad's house?\nThat ain't no reason to start wiggin and spaz out\nShe said\n[G] Help me I think I'm havin a seizure!\nI said, \"You're breaking out in hives, let go of the pizza!\"\n\"Would you put it down you're startin to scare me\"\nShe said\n[G] I'm twenty-six years old and I'm not married\nI don't even have any kids and I can't cook\n(Hello!) I'm over here Sue, (hi) you're talkin to the plant, look!\nWe need to get to a hospital 'fore it's too late\n'Cause I never seen no-one eat as many *shrooms* as you ate\n\n[Chorus]\nI never meant to give you mushrooms, girl (Whoops)\nI never meant to bring you to my world\nBut now you're sittin' in the corner, crying\nAnd now it's my fault, my fault (It's an accident)\nI never meant to give you mushrooms, girl\nI never meant to bring you to my world\nBut now you're sittin' in the corner, crying\nAnd now it's my fault, my fault\n\n[Verse 3]\nSusan (wait!) Where you goin? You better be careful\n[G] Leave me alone dad, I'm sick of gettin my hair pulled\nI'm not your dad, quit tryin to swallow your tongue\nWant some gum? Put down the scissors, 'fore you do somethin dumb\nI'll be right back just chill baby please?\nI gotta go find Dave he majored in allergies\n\"John, where's Dave at before I bash you?\"\n[J] He's in the bathroom; I think he's takin a crap dude!\n\"Dave! Pull up your pants, we need an ambulance\nThere's a girl upstairs talkin to plants\nChoppin her hair off, and there's only two days left\nOf Spring Break, how long do these things take to wear off?\"\n[D] Well it depends on how many pieces she ate\nJust one, with double mushrooms by mistake\nNow she's upstairs cryin out her eyeballs, breaking out in hives\"\n[D] She's gonna die dude\n\"I know and it's my fault!\"\n[D] My god!!!\n\n[Chorus]\nI never meant to give you mushrooms, girl\nI never meant to bring you to my world (I'm sorry)\nBut now you're sittin' in the corner, crying\nAnd now it's my fault, my fault (What do I do?)\nI never meant to give you mushrooms, girl\nI never meant to bring you to my world\nBut now you're sittin' in the corner, crying\nAnd now it's my fault, my fault\n\n[Outro]\nMy God, I'm so sorry!\nI'm so sorry! Susan please wake up!\nPlease! Please wake up!! What are you doing?!\nYou're not dead!! You're NOT dead!\nI know you're not dead!", "image": "https://images.genius.com/470671c8093b9402f448fbfa466a98eb.600x595x1.jpg"}], "artist": "Eminem"}