{"songs": [{"title": "Ms. Fat Booty 2", "album": "Lyricist Lounge 2 ", "year": null, "lyrics": "Modern girls!!\n\n(sung)\nI know, I can't afford to stop\nFor a moment.. that it's too soon.. to for..\n\n[Mos Def] - speaking over sung vocals\nI say girls, girls, girls, girls\nReach out and clap your hands\nI be the fabulous man so, just play the fabulous fan\nAnd, bring the breeze, bring the breeze\n\n[Mos Def]\nAnd from the moment that I saw ya, I knew you was trouble\nBut I disregarded, detour signs\nAnd did not stop til you was mine\nI guess God was like, aight fine\nCareful what you wish for, cause you just might get it in heaps\nTry to give it back he be like - nah that's yours to keep\nSo poetic baby girl you make it hard to speak\nMy dream lover make it hard to sleep\n.. I wrote a little song about it\n\nIn she came with the same type game\nThe hairdo, Prada shoes, brand new Gucci frame\nBig thangs, so big you can't hardly explain\nWhen she done crossed her legs, she make mind turn insane\nHad seen her on the ave and spotted her, how I wanted her\nAss so fat she think police tryna follow her\nWhat you lo-lo-love, expert in the bedwork corridor\nMan see a touches her, man you'll feel sorry for\nHustlers, bubblers, jugglers, sufferers\nAll wanna know what her name and phone number was\nThey're spendin up their money like, post them up and touch her up\nBut it don't (?) tough, X-amount of (?)\nSon, bwoy, African and tough, all nice and decent\nA-yeah yeah, I'm tryin to ride with a diamond like you\nLookin pretty in the club, plus she love Mos and Wu\n\n[Ghostface Killah]\nAss wide and fat, breasts mad, hair wrapped\nWilma style, chunky, that's how I like my batch\nYou a rose from the hood, smoked out of 89\nWe headed back, you had a baby by Ron\nBut that's irrelevant, bygones is bygones\nCalgon is Calgons, love it when you jump in Ghost thongs\nSteppin out of B-B-Q's\n'Member when we licked the cream out of Suzy Q's?\nSpaghetti jewels, the big word on the street\nYou like Millie Jackson in the new Mack flick carryin heat\nOr say with Oprah with a makeover, Billie Jean slash Dairy Queen\nFantasy is, can I eat you on the swing?\nSee it's written all over my face, Daily News\nBig bold lettered, front page, Starks how it taste?\n\n(sung)\n.. forget\nI know, I can't afford to stop\nFor a moment.. that it's too soon.. to forget\nI know, I can't afford to stop\nFor a moment.. that it's too soon.. to for..\n\n[Mos Def] - speaking over sung vocals\nTo all the fine-ass ghetto troublemakers from all over the world\nAss from New York, to L.A., Miami to Atlanta G.A\nCakalaks, to the Bay.. any place in the world that they stay\nEven Japan and the U.K., you know you got to\n\n[Mos Def]\nWatch out! Louisana jug wine and conk out\nThrow her hands high and make her backside pop out\nWatch out! If you don't have the V.I.P. lacq' out\nThem big dollars they talk 'bout, just turn around and walk out\nYou better watch out! Exotic fabrics, speech in larynx\nThink it's mid-day traffic, runnin game like the Mavericks\nMakin time seem elastic when we stretch out and smash it\nThen vanish like a phantom and hurt my understandin like WHAT??\n\n(sung)\n.. forget\nI know, I can't afford to stop\nFor a moment.. that it's too soon.. to forget\nI know, I can't afford to stop\nFor a moment.. that it's too soon.. to forget\nI know, I can't afford to stop\nFor a moment.. that it's too soon.. to forget\n{*music gradually fades out*}\n\n[Mos Def] - speaking over sung vocals\nSpecial, special dedication\nTo all the fine-ass ghetto troublemakers, out in the world today\nSome in this very party right here right now tonight\nSome of them listenin to this song in they jeeps\nSome of them listenin to this song at they job\nSome of them runnin game on some cat right now\nI want you to just rock and bounce to that\nRock and bounce to that\n\n{*music comes back in*}\n\n[Mos Def]\nI say girls, girls, girls, girls\nReach out and clap your hands\nI be the fabulous man so, just play the fabulous fan\nAnd, bring the breeze, bring the breeze\nSay girls, girls, girls, girls\nReach out and clap your hands\nI be the fabulous man so, just play the fabulous fan\nAnd, bring the breeze, bring the breeze\n{*music and vocals fade*}", "image": "https://images.genius.com/bb2a12043d5bed3ffa2d2b0d3814b69b.600x600x1.jpg"}], "artist": "Yasiin Bey"}