{"songs": [{"title": "Like This", "album": "Tha Blue Carpet Treatment", "year": "2006-11-21", "lyrics": "{*sounds of cameras and conversations in background*}\n\n\"Whassup with that goddamn camera nigga what's crackin?\"\n\"Aight let Snoop through with the Western Union (bitch though)\"\n\"Damani! Soopafly! Ay Bad Lucc! What's up nigga?\"\n\n[Intro: Snoop Dogg]\nI'd like to welcome the Western Union onto this \"Blue Carpet Treatment\"\nSome playa partners of mine... and we gon' show y'all this new dance we got\n\n[Chorus: Latoiya Williams & Raul Midon + (Snoop Dogg)]\nLike this (like this, it's easy to do)\nLike this (yeah, it's so easy to do)\nGrab a honey, take her to the floor and do it just like this\n(You can do it, you can do it just just like this)\nYou don't have to break it down to the floor (c'mon, yeah)\nAll you gotta do is keep movin your hands like this\n(Like this, you do can do it, you can do it too)\nLike this (c'mon, you can do it, you can do it too)\nI feel playa when I move and dancin to the song\nAll I wanna do is get my groove on like this\n\n[Damani]\nI throw my hands like Marvin\nSorta like James Brown how I +Get Down+\nI'm holdin my chain so it don't swang\nI'm slidin my feet, stayin on the beat\nI dip low then bring it back slow\nIf you didn't wanna dance, why you on the flo'?\n\n[Bad Lucc]\nDamani's on the go and Mr. Lucc on the catch-up\nSoopa Doopa behind, and baby this a set-up\nTwo-step with me - call your girls\nI got two ref's with me, they call the game quickly\nBig boy smooth, I'm too cool for the runway\nPlaya of the year, my gear's set for Sunday\n\n[Soopafly]\nWait right here girl I'm comin back Monday\nSlide right in front of me; get our dance on\nFred Astaire, Faye Dunaway; eyes on us\nWhile we move to the clap; I'm nice with the dance\nAnd I'm smooth with the rap; we in the zone with the lights and glamour\nGlass full of Patron, the code is grammar\n\n[Damani]\nCoat made of panther, excuse me miss\nLet me show you how to do it\n\n[Chorus]\n\n[Snoop Dogg]\nLet me holla at you baby, come close, it's\nBigg Snoop Dogg, king of the coast, bitch\nWalk with me, stay focused\nPut it on me little mama, let me see you stroke this\nIt seems like, the mo' hits\nOn a slow drift, bubble like a fo'-fifth\nAnd everybody everybody notice\nSo to cool cool Calvin Broadus\nAnd every woman is a goddess\nAnd every rapper is a artist\nYeah right, you're dead wrong, just sing along\nIt's Godzilla for reala my nigga, King Kong\nGivin' niggas the blues\nAs I'm walkin' on these fools in my blue suede tennis shoes\nI'm two-steppin' with my weapon close\nOn the dance flo' loc, cause you never know\nYeah baby girl, she's strapped, but she cool\nCause we ain't come, to act no motherfuckin fool\nWe just chillin like a villain, got my hands to the ceilin\nAnd I'm feelin the feelin, come feelin like this\n\n[Chorus]\n\n[Outro: Snoop Dogg]\nCheck it out\nI-I know baby girl I know\nSee, out here in the West\nNah, we don't do that\nWe don't do the motorcycle dance\nWe don't do the snap, uh-uh\nWe do a lil' somethin like this, c'mere\nC'mere, you think you can do that with me baby?\nDo it just like this, c'mon\nYeah... [fades out]", "image": "https://images.genius.com/9eeff8d4aa3579798c6d6f74d21fad47.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}