{"songs": [{"title": "Throwin My Money", "album": "Dark Horse", "year": "2013-07-02", "lyrics": "{Chris Millionaire on the track}\n\n[Intro: R. Kelly]\nIn the club throwin' money\nTurned up, Kells and the Twista\n\n[Hook: R. Kelly]\nThe way she work it on the pole\nGot me throwin' my money, throwin' my money\nThey way she twerk it on the pole\nGot me throwin' my money, throwin' my money\nThe way she pop it on the pole\nGot me throwin' my money, throwin' my money\nThe way she slide down on the pole\nGot me throwin' my money, throwin' my money\n\n[Twista]\nPop that booty, let me watch it girl\nDrop it, I'll not knock it - better yet I'mma reach into my pocket girl\nWatch it girl she sluggin', come over here cause I see what you do\nTippin off the plenty booze; how you be attractin' plenty dudes with the Jimmy Choo shoes you in\nWhat you doing takes some talent so I gotta say that I'm enjoying what I witness\nMy money flow is endless, lookin' at her work that pole like a gymnast\nClimbin' up to the top, turn it upside down then open up her legs\nLookin' sexy all the way to the bottom, I'm throwin' dollars cause it look like she finna hit her head\nNow she twerlin' around it, then do a split right in front of it\nReady to go back up when she look at how thick the money get\nShe do it caterpillar, ballerina diamond toes arial and vert\nFull rockin' it verti crucifix fan kick, pro pound with mills stacks spin in reverse\n\n[Hook]\n\n[R. Kelly]\nI ain't got no plans tonight\nGet somewhere, you can help me get my head right\nAnd I love your swag, cause it's just like mine\nSiamese, twins, me and, you, we, two, of a, kind\nStrip club is our playground, she playing on her monkey bar\nUp and down like a roller coaster - I call that ass a theme park\nWay she handle her business from the sky she make it drop\nMy money no limit, tonight I'm about to go astronaut\nNever ride solo, Mr. Franklin always with me\nShe'd been around the pole so many times she should be dizzy\nRolex that's real crime, these niggas exaggerating\nHer ass can hold a glass, that's no exaggerating\n\n[Hook]", "image": "https://images.genius.com/5a82462c7648c262cd242217da588ea0.500x500x1.jpg"}], "artist": "Twista"}