{"songs": [{"title": "Special", "album": "Malice N Wonderland", "year": "2009-12-08", "lyrics": "{*Brandy ad libs during Intro*}\n\n[Intro]\nFellas, last call, for alcohol\nYou better get what you drinking man\nI am your main man DJ, EZ Dick\nShare something real special with you\nA brand new cut, from the big Boss Dogg\nFeaturing, Brandy, and Pharrell\nCause you're so special baby, yes you are\n\n[Hook: Brandy, Snoop, Pharrell]\n[B] It's the way you\nIt's the way, you, make me feeeeeel\n[S] Special girl, you're so special, special\n[B] Ooooh, baby just don't, change\nYou're so reeeeeeal\n[S] So special girl, you're so special, special\n[B] Show me that I'm special, tell me boy\n[P] Girl, you know you are special\nI bet you were born in the skyyyyy\n[B] Show me that I'm special, tell me boy\n[P] Girl, you know you are special\nGirl, the hottest in my mind\n\n[Snoop Dogg]\nI know you, and you know me\nAnd this is the place that you really wan' be\nLet's make it crack-a-lack, I make it look easy\nLife can be a carnival and I'mma be your reason\nKiss, me, slow-ly\nPerform +Quiet Storm+ 'til I get you nice-ly\nI'm puttin out the blunt cause I see\nThat I need you more in my life than I need a bag of weed\nNow I compare you to a bird when she fly by\nI wanna rock you back to sleep like beddy-bye-bye\nBounce in the 'llac with your hand on my lap\nThrow your bags in the back, I'mma show you where it's at\nAin't no tellin if we might come back, you like that?\nI figured out a way to catch a flight right, back\nSee I ain't never flown for fees\nCome spend a weekend overseas in Greece with me\nPlease believe!\n\n[Hook] w/ ad libs\n\n[Snoop Dogg]\nYou know if you through with me, then I'm through with you\nBut you're the one who fell in love and said that love was true\nBut you ain't never fake on me\nAnd now you think that you gon' find another G like me?\nThem, niggas, ain't gon' play\nThey gon' just hump, they ain't gon' do it your way\nI can't hate and say what they gon' do\nAll I know is that I'm true and know that you my baby boo\nLet's take a chance, go to France on a three-day cruise\nWalk with your man in the sand like, oooh\nIt's our little rendezvous\nWhoopty-whoop, Big Snoopy and boo\nI picture this love affair, of ours\nTo last a lifetime, just like flowers\nTake a quick flick then get dressed, we'll head to Brazil\nI'll show you how it feel when you're rollin with the real\nHow it feel?\n\n[Hook] w/ ad libs\n\n[Brandy + Snoop]\nWe can make it, let's just stay together\nCome together, don't gooooo\nLet's just have some fun and be together\nForever... for liiiiife\n\n[Snoop Dogg]\nNow that we're livin our life especially, I say that you're my pick\nAnd every day we'll dress alike and always stay slick\nTo me, I see you as a gift\nIncredible, it's edible, my ice cream, have a lick\nI'll catch you when you fall like leaves\nAnd be the one that you need, come be my #1 please\nSee I ain't never blown no cheese\nOr done no songs like these, I love the air that you breathe\nYou know why? (why-why, why-why)\n\n[Hook] w/ ad libs", "image": "https://images.genius.com/a9730b160b9e646d986f0b4659d2dc40.800x800x1.jpg"}], "artist": "Snoop Dogg"}