{"songs": [{"title": "Deadly Venoms", "album": "Ooh, I Love You, Rakeem ", "year": "1991-07-01", "lyrics": "[Intro]\nYo, here we go yo\nThe Prince Rakeem, this here is called My Deadly Venom\nYou know what I'm saying?\nSome old freestyle type of slick slang\nFor you and your gang\nGirls so y'all can kinda sweat this\nCheck it out and ya don't quit\n\n[Verse 1]\nAnd many brothers know me for what?\nFor bagging bitches\nBut I'm also known for giving stitches\nA buck 50 for those who get nifty\nThat's why your ass so fast to call me swifty\nAnd here I go and here I go\nHey yo go out like Bo and act like ya know\nThat ya can't beat me or bring me\nThe least bit of harm\nSssss, um um, uh uh\nHeck no, I keep a sucker brain petrified\nWhen I grab the mic I won't let go, I'd\nRather go live forever and ever and ever\nLet it go? Never\nAssume a lot of boys are doomed\nWithout being tuned\nTo many many many moons\nAs the champ that blast through your amp\nI can't get weak 'cause my style can't cramp\nI'm rugged like Guess black denim\nBattles y'all know I always ran 'em\nWhen it comes to rappers, they're seeds\nI'll plant 'em\nAs I eject ya wit' a dose of deadly venom\nThis is the way I like to Parley\nAnd amputate to the words I say\nThe tormentor, take you on a mad adventure\nThrough an episode that's cold like the winter\nCheck your checklist\nAnd see if you can wreck this\nYou thought I was a lover\nAnd didn't expect this\nStyle I specify but now you can testify\nThee not a less the best is I\n\n[Chorus]\nDeadly Venoms\nDeadly Venoms, kid\nCheck it out, yo\n\n[Verse 2]\nNo time for charades or masquerades\nIt's more rugged shit with the kid with braids\nAnd I like brothers to step up and show what they got\nAnd watch 'em drop on the spot\nAnd pop the corns\nJust raw like crumbs from my tongue\n'Cause you're small like Tom Thumb\nBut I'm great, up to date and elevate\nRhymes I design\nI write with paper mate\nI stimulate your thoughts\nCan't take shorts\nWon every battle that I ever fought\nSo friend or foe\nWho want to go toe to toe?\nYo you know you're gonna fall below\nZero don't try to play hero\nLike um, Robert De Niro and Crazy Shapiro\nBut I exempt not to be a wimp\nI walk with a limp of a Roscoe pimp\nI'm a slickster\nWho's out to get your sister\nYou disagree with me? Fuck you mister\nSo uncanny brothers can't stand me\nI'll take the panties from your mammy and your granny\nRap crusader, bam boom invader\nSexcapader and also a panty raider\nSo protect your property\n'Cause when it comes to bagging girls\nNo one is stopping me\nOr getting rid of me\nI'm the epitome\nEven cold fuck the statue of liberty\nThat's the way that I am though\nYea Rakeem with a rugged deadly venom (venom)\n\n[Interlude]\nYea check it the Deadly Venom (Venom)\nWord, the Deadly Venom, kid\nYea a Deadly Venom (Venom)\n\n[Verse 3]\nSuckers step to me and think they can do me\nYour style is screwy like Hong Kong Phooey\nYou can't push me, rush or mush me\nDust or crush, or even ambush me\n'Cause I'll play ya right out of position\nSee through your mission with x-ray vision\nAnd once I see ya I get Scrooge like Ebenezer\nCrush ya like black Caesar\nAfter that I'll leave ya\nHit 'em with a symptom of Rakeem fever\nYou get strung, hung, swung\nDone, by a witty rap tongue\nFrom a young man who understood\nWhat it takes to be good\nMake a rhyme sound like it should\nSusa I'm making this style looser\nI turn men to stone like Medusa\nYou get blown and thrown off course\nFeel the remorse, you're forced to take a loss\nI get crazier slay ya like Hell Raiser\nStyle amaze ya I'm rugged like a trail blazer\nThen I crash right through your\nLyrics I sued 'em\nThey're moving like U-Haul\nBooming 'em, doing 'em, wrap 'em like aluminum fo-o-oil\nYour plans got spoiled\nRhymes will affect ya\nWho loves to wreck ya?\nI laugh in your face like I'm Woody Woodpecker\nHa ha ha ha ha, ha ha ha ha ha ha\nYou can't get with the Ra\nDeadly Venom\n\n[Outro]\nWord, Know what I'm saying?\nThe Prince Rakeem strikes again\nNever hit below the belt although the blow is felt\nI wanna say peace to the DMD Posse\nAnd the Gladiator Posse\nAnd the whole Staten Island Posse\nAnd the Funky President Melquan", "image": "https://images.genius.com/b9de29dee1a5b6dcb8d879daf5fd9484.493x478x1.jpg"}], "artist": "RZA"}