{"songs": [{"title": "Back in the Day", "album": "Under Construction", "year": "2002-11-12", "lyrics": "[Intro]\n\"Brothers and sisters!\nBrothers and sisters, I don't know what this world is coming to!\"\n\n[JAY-Z, Missy]\nWhassup, Missy? Timbo!\nThis is.. another.. Missy Elliott (Hip-Hop! Yes!)\nExclusive (Yes, uh)\n\n[Verse 1: Jay-Z]\nOne for the butters, I came from the gutter\nNo I came from my mother but y'all know what I mean\nHov' is here to stay like permanent crease in your jeans\nMe and Missy be the new Tag Team\n\"Whoomp! There It Is\"\nWe like, Rae & Ghost, A.G. and Showbiz\nWe \"Public Enemy #1,\" our \"Uzi Weighs a Ton\"\nThis is our house, Run! hahaha\n\n[Missy]\nWhat happened to those good old days? (Huh?)\nWhen hip-hop, was so much fun\nOhh, house parties in the summer y'all (C'mon)\nAnd no one, came through with a gun (A guh-un)\nIt was all about good music y'all\nIt helped to relieve some stress (Huh?)\nOhh, we was under one groove y'all (Y'all)\nSo much love between North and West\n\n[Hook: Missy Elliott]\nGo back in the day\nBritish Knights and gold chains\nDo the prep and cabbage patch\nAnd wear your laces all fat\nBack in the dayyyyyyyy, hey hey\nHip-Hop has chaaaanged\n\n[Verse 2: Missy]\nRemember when we used to battle? (Uh huh)\nOn the block before the lights came on (Yeah)\nOhh! Mama said we would be straight A kids (Come on)\nIf we did our homework, like we knew those songs\nSalt-N-Pepa, Rakim, and P.E\nD.M.C, and Heavy D\nYes! Daddy Kane, Slick Rick, too (Oooh ooh!)\nMC Lyte opened, doors for you and me, c'mon\n\n[Hook (JAY-Z)]\nGo back in the day\nBritish Knights and gold chains\nDo the prep and cabbage patch\nAnd wear your laces all fat\nBack in the dayyyyyyyy, hey hey (Young!)\nHip-Hop has chaaaanged (J. Breezy, let's do it again, nigga)\n\n[Verse 3: JAY-Z]\nRough, the way it oughta be\nFrom day KRS-One all the way up to Nineteen Naughty Three\nTo M.O.P., we Cold as Ice\nNigga, we rock it from the \"Dre Day\" to the Suge Knight\nSo fuck Chuck Phillips and Bill O'Reilly\nIf they try to stop hip-hop, we all gon' rally, nigga\nPost Biggie and 'Pac I gotta hold down the city\nMake a nigga wanna holla like Missy, but fuck it\nJust let a nigga MC\nThe best rapper alive, unquestionably\nIf you riff on your EP, you gonna need an MD\nSo you gots to chill cause I kill at will\nLike solid water dude; y'all niggas don't get it\n\"Kill at Will,\" solid water? Ice Cube\nHa ha, that's how hip-hop has evolved\nJay-Z's for President, I'm namin Ra as the National God\n\n[Missy]\nMe and Jigga, Jigga J-J-Jay-Hova\nI rocks the mic right whether I'm pissin' drunk or sober\nMisdemeanor fo'-finger ringer I'm stupid FRESH\nI've been hot since LL rocked the Kangol HAT\nYes yes, the yes yes, the yes y'alln\nC'mon... AW YEA, AW YEA\nOkay, me, that nigga Jigga, fresh dressed in the mornin'\nC'mon... AW YEA, AW YEA\n\n[Hook: Missy Elliott]\nGo back in the day\nBritish Knights and gold chains\nDo the prep and cabbage patch\nAnd wear your laces all fat\nBack in the dayyyyyyyy, hey hey\nHip-Hop has chaaaanged\n\n{*ad libs and whistling*}\n\n[Break: Missy]\nI wanna, go back in, time (let's go)\nFeels like I, I wanna, go back in, time\nFeels like I (Y'all remember \"Self Destruction\"?)\nI wanna, go back in, time\n(Where all the rap artists got on a record together?)\nFeels like I, I wanna, go back in, time\n(I used to love them days, no tension, let's go!!)\n\n[Hook: Missy Elliott]\nGo back in the day\nBritish Knights and gold chains\nDo the prep and cabbage patch\nAnd wear your laces all fat\nBack in the dayyyyyyyy, hey hey\nHip-Hop has chaaaanged", "image": "https://images.genius.com/5dfa9016abf58bcec676c0b77a31f2bc.1000x1000x1.jpg"}], "artist": "Missy Elliott"}