{"songs": [{"title": "Summer 17", "album": "Rather You Than Me", "year": "2017-02-08", "lyrics": "[Intro: Rick Ross]\n(Maybach Music)\nYou scared to die, nigga?\nOpen your eyes wide and I pray you are (huh)\n\n[Verse 1: Rick Ross]\nI'm out on bond so I gotta beat it (huh)\nAll the dope boys say they wanna be me (boss)\nI got a lick, boy, I got a lick (I got a lick)\n2017 trust me, boy, this one is it\nI used to smoke the weed until my fingers burn (huh)\nPool of bitches fuckin' me, I got 'em takin' turns (woo)\nMy nigga bought the stick but you wanna fade (fick)\nMade runnin' in the bank a residential thing (huh)\nAll my niggas mad they like, \"Fuck the world\" (fuck it)\nBack to standin’ on the Ave. with a couple birds\nIf you a killer, well I’m tryna see (huh)\n'Cause callin' the police the only thing free (woo)\nI had to park that purple Lamborghini​ (yummm)\nAnd pull that Chevy back out on the cement (huh)\nI'm from the city where they kill for nothin' (nothin')\nAnd all Renzel do is push a button (woop)\n\n[Chorus: Rick Ross]\nI want my niggas rich by summer seventeen (let's get it)\nI want my niggas rich by summer seventeen\nI want my niggas rich by summer seventeen\n(All my niggas! I'm talking all my niggas!)\nI want my niggas rich by summer seventeen (Maybach Music)\n\n[Verse 2: Yo Gotti]\nI had a quarter mil' when I was seventeen\nQuarterback and quarter keys, plus I own the team (yeah)\nRather you than me, rather me than you (me, you)\nRiding in that coupe, hanging out shooting (skrrt, skrrt)\nGlass panoramic top, I don't got no roof (pew)\nYour bitch wishing on a star, I can see the moon\nI can count to a million with my eyes closed\nAnd shoot a pussy with that chopper while I'm blindfolded (brrr)\nDraco, Draco, Draco (Draco) fitted cap a halo (brrrr)\nActivis and Faygo, no pussies on my payroll\nIt's 'bout to be a cold summer, hot winter (summer, winter)\nThis mid-March, I might make it rain 'til September\n\n[Chorus: Rick Ross]\nI want my niggas rich by summer seventeen (summertime)\nI want my niggas rich by summer seventeen (all of mine)\nI want my niggas rich by summer seventeen (summertime)\nI want my niggas rich by summer seventeen (huh)\n\n[Verse 3: Rick Ross]\nI'm out on bond so I gotta beat it (Lord)\nHalf a million to my lawyer 'cause he undefeated\nShots fired; you short of breathin'\nBarefoot 'cause them kids took your Adidas (woo)\nI'm keepin' fried fish up in my mama pan (mama)\nHow much y'all detectives call yo' boy the son of Sam (mama)\nSa ka fet shake up the block, that's with a hundred grand (Sa ka fet)\nPut that voodoo on you niggas so that gun'll jam (woo)\nYou know them niggas killers how they name ring (boss)\nYou know them niggas winners how they chain swing (ah)\nAll the bitches sellin' pussy charge the same thing (okay)\nRichest nigga in the hood, we call him Rain Man\n\n[Chorus: Rick Ross]\nI want my niggas rich by summer seventeen (summertime)\nI want my niggas rich by summer seventeen (All my niggas, let's go!)\nI want my niggas rich by summer seventeen\nI want my niggas rich by summer seventeen\n\n[Outro: Rick Ross]\nLord! I'm talking all my niggas!\nAll my niggas!\nEvery one of 'em, nigga\nSummer seventeen\nSummer seventeen, nigga!\n(Maybach Music)", "image": "https://images.genius.com/759627553eeeb38594af994eaf2a173a.500x500x1.jpg"}], "artist": "Rick Ross"}