{"songs": [{"title": "Your Gonna Love Me", "album": "Reefer Party 2", "year": null, "lyrics": "You gonna love me\nYou gonna love me, man! is wiz khlaifa!\nUh, black out, yes!\nCd in the building\nPitsburg stand up real quick for your prince right now\nI'm about to show you niggers\nAnd why wiz khalifa is the prince of the city\nListen, listen, listen!\n\nYoung dude, you get off in\nNiggas often handy\nRespect you fools you soft as panties\nAnd no other rapper fame like mine\nDisagree, I remove your top, help you change your minde\nCock sucker what your life about\nWe're on that add with our pipes out\nCity seen nigga life's out!\nThat's the definition that is black thing\nWe being black out thing and slaying hurts for these ladies\nAnd in the I wanna step up, get it a lot of things that will make a mess of you\nAnd I don't sell weed\nI don't sell, dope\nI roll with the gang, of fools that leave a smile on your throat\nTo see games, soon as we stump in a place\nNot notheing on my waist but don't think, no want to mistake\nLeave anyone you met in your life, as you if you're running my space\nDog, that could get you punched in your face\nOr you could run butt naked, have you runnin the place\nNo jewels, no shoes, I'm nigga with no rules\nDudes, don't understand what I'm getting at?\nThe whole concept is pitiful, so when I'm done\n..these twins no longer be identical\nI do got respect for anyone thats real\nBut all hail the true price of the city is still and thats (Meeeeeee)\nListen man, it's still the song she's singing to you\nYow niggers gonna love me, man!\nYou might not want to, but it's hard, I'm the prince of the city and still!\nAnd thats (meee), listen!\nShuts start to my nigga, let's collapse on my nigga listen, uh!(meeeee)\nI speak to you, dough\nI'm the true prince of the city\nDo the artist formerly none\nNow keep that thing, gotta keep that\nReaching for the lord, dog, release that bling\nWhen I step in the place. stole grands on me\nDowns, with their hands on me\nYou're sick of searching and niggas with punch lines\nWell known to heart pride\n\nAll mouth doing like a buck fifty on a strip\nIt's no way you gonna hold me\nI rap sick, and I put the\nOk, get a cracking for the war\nI'm sixteen, the eighteen, when it's back for the war!\nI'm way big, no I'm better than him\nKeep suffering on me with a .. I call 'em double mint twins\nThis are all streets, and trespass, and you get bust back\nYou can for everything down to your bus pass\nAnd when I buck fast, niggers dunk fast\nAnd if you get hit ain't notheing left but your mustache\nAnd niggers imitate the team we are\nBut I roast you burn niggers like cdr\nI do got respect for anyone real, but all hail the true prince of the city is stilland thats (meeee)\nAnd that's me!\nNo doubt about it man\nAnd niggas can run that back\nIt's o question, the prince of the city is still, nigga and thats (Meeeeee)\nAnd that's me, oh, oh!\nI'm feeling real good in here right now\nI'm feeling ,invincible man\nAnd niggers let us sing the side of this one!\nBlack out! black!(meeee)\n(Your gonna love me yes you are you better you better.....)", "image": "https://images.genius.com/cf4bee87c663b4bbda8c025187155bbe.500x500x1.jpg"}], "artist": "Wiz Khalifa"}