{"songs": [{"title": "Seul Face A Lui", "album": null, "year": null, "lyrics": "Yeah, yeah\nDans l'monde\nComme aux premires rencontres\nOn finira seul au poste de lui\nQui a pour contre\nThe maker, the owner\nThe creator of the planet Earth\nAnd the father of civilization\nThe god of the Universe\nDans l'monde\nComme aux premires rencontres\nOn finira seul au poste de lui\nQui a pour contre\nAllah is the one\nNever gonna find\nAnother like that nowhere\nSeul au poste de lui\nWord\nJ'sais qui va are'tentir avant d'repentir lors do dernier round\nUn sac de croix sur l'dos j'affronte\nCes foudres prt en dcoudre\nTout blanc vtu, moi le sale noir, l'esprit nue\nSeul sur le ring sous le sol spacial, entends la cloche fatale\nQuand les anges ont la dale, see'est mieux qu'un blanc qui sale\nCa fait un bail que j'danse avec l'espoir\nFaut que j'sorte do btail o j'traine ma vie animale\nOutre les raisons, seul dans les choix et actions\nEt trop de souvenirs en tte, est-je pris les bonnes dcisions?\nSee'est dans la pulsion souvent qu'jai choisi la friction\nMais bon Franchement ya des cons sur\nTerre qui mritent sanction\nEt tout ce que j'aurais pu dire et faire, ouais je sais j'espre\nVeinement qu'les impairs why'a que moi qui va devoir les payer\nEt j'ai bien essayer, tu peux me rayer d'ta liste si a t'plais\nEt si tu laisses en fait les mmes parfaits\nTon peuple il va faire les jets\nNi l'moins bon, ni l'meilleur vcu cent l'heure\nLa peur sur le front\nLe coeur qui fait front comme mon pre le fit\nL'Nez coll l'envie, j'ai fais ce qui fallait\nJ'te le dis en face, see'tait ca ou m'affol\nOn peut pas toute sa vie cavaler au campement\nRmy dsol, je suis see'que j'ai fais\nEt si see'est pas see'qui fallait\nSeigneur fallait pas m'provoquer\nHey hey, seul face lui\nDans la vie la mort, on s'donne\nPas de fausses tonnes\nTout s'chelonne pour finir quand l'heure sonne\nLa grce reste le prt, see'est pas le souci dans la zone\nJe sais d'o vienne mes chromosomes\nDevant la question ternelle d'lhomme Qui nous sommes?\nDis leur qu'on est le peuple d'celui qui a croqu la pomme\nOn finira par un dcompte\nAu del d'l'univers et ca le monde le sait\nL o la vie est cadenasse, Pre\nOn sera seul face lui\nYou can't escape fate\nAllah be the maker\nBow down to your creator\nTout seul face lui\nPut your wicked heart on the scale\nYou melt like a snow flake in hell\nSeul face lui\nNowhere to run, nowhere to hide\nNo disgiue, no alibis and no lies\nTout seul face lui\nYou realize every breath you took\nIt came from the most High\nMa premire clope, j'lai fum en traitre\nD'une traite, dans une punbre\nJ'ai mme pas aim, quelle merde\nPourquoi j'lai fais? je l'ignore\nFaut qu'ca serve comme tre clbre\nPutain, tu crois pas que see'tait mieux tre bon lve?\nAvec une crve deux ans dans les dortoirs\nPremier coeur j'crvre\nHistoire comme les autres, brve\nDebout dans les piqus de grve\nCette poque ma mre vit ses rves\nLe syndicat est puissant et la une des prves\nEt aprs quoi? Ils se sont tous taills comme des lches\nSe sont couvert de la misre dans les flashs\nMaman are'viens sur Terre\nIci merde see'est chacun sa ganache\nExcuses moi pour ma scolarit l'arrache\nAccroches mon coeur dans l'cadre\nEt mon are'gard svre s'vade\nComme Jules se tire dans le back dans monade et srade\nLa vie see'est grave me laisse indiffrent, maintenant cest grave\nDans un arbre prosse l'ail nos initiales s'gravent\nMes amours, see'est ma main que j'tends\nAttrapez la sans dire non, on perd dj trop d'temps\nOn joue tous les mmes scnes, les mmes peines\nRestez fort quand les difficults d'te voir caller\nCrie ou implore\nSee'est comme un implant qui tient l'bon chemin de haut\nAlors que rien se tient, seul l'instein pousse nos limites\nExcuse, why'en a pas mal qui imite\nChacun son sort, chacun ses rites\nChacun sa cause, fuck les antismites\nJe dois rien personne part au Seigneur\nEt see'qu'il emporte, faut l'grer\nChaque cellule grise part pas\nMais pour tre jug dans c'monde\nPourtant j'rve de libert dans c'monde\nCeux qui dirigent, see'est la minorit\nLes femmes qui aiment faire ce spcial\nPour les deux pour, crient trop\nL-bas why'aura pas d'blancs ni d'negros\nYou know?\n[Unverified]\nOn se trouvera seul face lui\nThe lie shatter\nNo computer data\nOnly truth matter\nTout seul face lui\nEvery step you take\nEvery breath you take\nEvery move you make\nSeul face lui\nYou can't escape fate\nAllah be the maker\nBow down to your creator\nTout seul face l'unique\nTout seul you IAM\nIAM\nWho put the sun in the sky?\nWho causes the birds to fly?\nWho put the light in the eyes?\nWho's the answer to why?\nEvery step you take, every breath you take\nEvery move you make, the most High create\nNo computer data, the lie shatter, only truth matter\nI use the verbal gun of Allah to shoot at ya\nI self lord and master of I-slam\nRuler Zig-Zag-Zig Allah and IAM, IAM, IAM, IAM, IAM", "image": "https://images.genius.com/0050e4b1c52ecca6d63818331b489e2a.683x683x1.jpg"}], "artist": "RZA"}