{"songs": [{"title": "Ballin", "album": "Mr. Philadelphia", "year": "2010-08-25", "lyrics": "[Intro – Meek Mill]\nIt’s the dream team bitch\nMr. Philadelphia\nPhilly in this bitch, Meek Million\n\n[Verse 1 – Meek Mill]\nAll I ever wanted was a million and a bad bitch\nUsed to blow my money and wake up like where my stacks went\nI was  17 I left my crib, went where the cash went\nAnd popped back in my hood in an Aston, mansion\nFlying with the top off, and I’m getting topped off\nI’m about my chicken bitch, and I spit that hot sauce\nMustard yellow Breitling, tell 'em catch up, I’m a hot dog\nHood nigga, but I live my life like I’m a rock star\nShot bar, fuck no, take me where the bottles at\nMr. Rose baby, get a lot of that\nCopy that, roger that, I be where it’s popping at\nJahlil he put a hit out on that beat I b-b-body that\nImma take the offshore, baby, cause it costs more\nElevator take me to the top, right on the ball floor\nShawty tried to jump inside the coupe, can’t find the car door\nWhy you think I work so much and grind so fucking hard for\n\n[Hook – Meek Mill]\nHey, bottles up, shawty drop me down\nAsk who fucking with me, not a sound\nHear them haters talking, but they whispering\nSo what they saying bout me, cause I’m getting it\nWe ballin, we ballin\nBallin like it’s Spalding\nEverytime I wake up all I hear is money calling\nBallin and ballin, tearing up the Martin\nCall me Mr. wrecking ball the way I break them walls in\n\n[Verse 2 – Shizz Nitty]\nFuck niggas and bitches\nAin’t Shizzy a dope\nUsed to have weed, now they say the bottom got dope\nKnew a nigga had soap, and they rocked his ass\nSaw they did a round hit, and they stopped his ass\nMillion dollar nigga, they call him socks in the air\nThey don’t play around anigga, they got Glocks over there\nRest in peace to Lil [?], he was just in the way\nWhen them bullets from up top, man they started to spray\nIt’s just another story from around the way\nWhere we keep a tough crew and them boys don’t play\n75 nigga ball, rest in peace to bubble\nI like my remmy and my rose, bud is [?]\nKeep winning, and keep on losing\nYou keep on hating and your bitch keep choosing\nYou think she ain’t?\nMotherfucker we got bottles sitting everywhere\nAin’t too many niggas models sitting everywhere\n\n[Hook]", "image": "https://images.genius.com/02fee89da0cebb67c2da7a31768e15c2.500x500x1.jpg"}], "artist": "Meek Mill"}