{"songs": [{"title": "A Love That’s True (Part 1)", "album": "Behind Bars", "year": null, "lyrics": "[Intro]\nSo you get my point son, you just don't trust no bitch\nYou know what I'm sayin? (Okay, daddy, I understand you)\nCause bitches ain't no good, you know what I'm sayin?\n(Okay, I get your point) Anyway, listen to this, check it out\n\n[Verse 1]\n1994, as the world gets trifer\nI'm wondering, fuck I need a woman in my life for?\nYa know, cause it's like a nigga whole history\nWith you hoes been nothing but misery\nFirst rater, five-one stood\nMad coke fiend though the bitch looked good\nMet her at the fever, \"What's going on, stranger?\"\nAnd like a fool took her in and tried to change her\nI don't who I thought I's bluffing\nThat bitch wasn't giving up that coke for nothing\n\"Oh you tryna dis, mister bougeois nigga\nYet back in the day, you used to smoke coke cigarettes too\nThat type shit you ain't admitting\"\nBecause, homegirl, I grew outta it, you didn't\nAnyway, dead outta order\nCame in with a sheepskin her ex-lover bought her\nWho gave you that? \"My ex\" I said \"Who?\"\nBelieve she had the nerve to say \"You can wear it too\"\nWhen I found strength to depart, I do\nWithdrew, for something brand new\n\n[Hook]\nSomeone who would be true\nYes, I should find someone who would be true\nCause Ricky needs a love that's true, true\nOh dear, Scooby Dooby Doo..\n\n[Verse 2]\nThen I met Sin, sweating the viking\nA brown skinned fox, slim just like I like 'em\n\"What? Sweating you? Picture that, nerd.. please\"\nAnyway, the bitch had herpes!\nYou know, imagine me, the fool being the spouse\nDoctor said I couldn't catch it 'less I got aroused\nFound out snooping in her bag what she got\nNow why you ain't tell me? You worthless slut!\n\"Because I loved you at the time and couldn't afford to\"\nYou know homegirl should get the Oscar award for her lying\nAnyway, stayed with the creep\nOne day, Sybil here, talking in her sleep\n\"Chris, wait,\" the bum bitch said\nSo loud 'til a mothafucka fell out the bed\nWho the hell is Chris? She putting up resistance\n'til I caught her calling the nigga long distance\nHad the nerve to dis patch loving\nBoy am I lucky that I didn't catch nothing\nWhen I found strength to depart, I do\nWithdrew, for something brand new\n\n[Hook]\nSomeone who would be true\nYes, I should find someone who would be true\nCause Ricky needs a love that's true, true, true\nIndeed, I need a love that's true\nIt seems I need a love that's true\nOh dear, Scooby Dooby Doo\nOh gosh, Scooby Dooby Doo\n\n[Verse 3]\nThough happy I was free, the need for love was still in me\nGot to the point where the need for it was killing me\nThen I met shorty here, hanging with my cousin\nFound out later how young the bitch was and\nThough I done hit it and she opened up a world\nAnd remind me of that song \"Go Away, Little Girl\"\nIt had to end because the bitch weren't loyal, and spoiled\n\"That's because I had you pussy whipped royal\"\nYou see the type of shit a nigga was gonna marry?\nYou see the type of attitude the bum bitch carry?\nLike oil and water, impossible mixture\nThen temper tantrums came into the picture\nYelling, carrying on bad and cursing\nComplete embarassment to the Ruler as a person\n\"Gimme shorts\" Ruler will not permit you\nThen she goes wild, starts breaking up my furniture\nFlirts too, excuse me, a whore\nLike the world's worst groupie when I brought her on tour\nSo when I found strength to depart, I do\nWithdrew, for something brand new\n\n[Hook]\nSomeone who would be true\nYes, I should find someone who would be true\nCause Ricky needs a love that's true, true, true\nIndeed, I need a love that's true\nIt seems I need a love that's true\nOh dear, Scooby Dooby Doo\nOh gosh, Scooby Dooby Doo", "image": "https://images.genius.com/9492e61c778d8d1c0b9cddf2393d4e25.500x500x1.jpg"}], "artist": "Slick Rick"}