{"songs": [{"title": "Do What You Do", "album": "My Homies", "year": "1998-03-03", "lyrics": "[B-Legit]\nI flip, make hits, and stick like peanut butter\nFive g's to the homie my money he didn't stutter\nThe gutter with the gats, fuck that, we need the lucho\nIt ain't no in between such things as being neutral\nWe shoot y'all, answering to me if it's needed\nCatch you in the bucket and fuck it we gon feed it\nWe bleed it, A-K spray and nine milla\nYou fuckin with a killa for scrilla\nMoney wanna deala\nPeel 'em from the back and fact, you're ass out\nThrow you in the trunk, we bump and mash out\nWe blast out and get the fuck outta dodge\nAnd leave your body corpse parked at the Travellodge\nYou can't reason with a fool with guns and no brains\nThrown off your balcony get stoned and let's remain\nWe stressed main, paper come up short\nPlus this bitch with my baby tryin to take me to court\nI need a new quarter, plus my screws is loose\nMakin niggas wanna pour shit down like orange juice\nI one two, and slap the fuck outta you\nSo go on about my business bitch, and do what you do\nYou like to run shit\nDo what you do\nYou fuck with powder bitch?\nHey yo, do what you do\nYou turn dyke too\nYeah, do what you do\nBut if it's fuck me bitch, then it's fuck you too\nIf you build a heist\nYo, do what you do\nYou like to talk the vice?\nDo what you do\nSpeakin on my crew\nNigga, do what you do\nBut if it's fuck me bitch, then it's fuck you too\n\n[Bushwick Bill]\nMe and two freaks in B-Legit's back seat\nF-u-c-k-i-n-g\nI got clunkers, cuz you know big Chuck like em plump\nSippin hurricane bumpin slurricane cuz it thumps\nIn my trunk my pistol grip pump at all times\nKryptonite got me blowed cuz I hit it five times\nI got condom on my dick, but my mind is on scrilla\nBitches just respect this nigga Chuck and I'ma killa\nMe and my nigga, four hoes, weed, and liquor\nHeaded to the boat to freak these bitches on the river\nAnd since I'm from the south these hoes showin me love\nAnd B is from the west, he really don't give a fuck\nTwenty minutes later, all hell broke loose\nBitches suckin dick and lickin up nut juice\nOne bitch said she like to eat pussy too\nShe looked at me, I said shit, bitch, do what you do\nBitch you like suckin dick?\nDo what you do\nHomie, you like to eat pussy?\nDo what you do\nNigga you like bein broke?\nDo what you do\nBitch you wanna fuck me, I wanna fuck you too\nNigga you like stealin cars?\nDo what you do\nNigga you like bein 'hind bars?\nDo what you do\nNigga you don't give a fuck about shit?\nDo what you do\nNigga it's fuck Bushwick, well fuck you too", "image": "https://images.genius.com/8f2e242e8c32bb311fdcab8c0ef63ab3.500x500x1.jpg"}], "artist": "Scarface"}