{"songs": [{"title": "If I Ruled The World ’09", "album": null, "year": null, "lyrics": "[Intro: Marsha Amborious (Nas)]\nOooh oooh, oooooooooooooooohhhhhhhh! The struggles of life! (Life!)\nOooh, oooh, oooh, da da da da da da! (Everything I ever wanted)\nOh, oh (Yeah Yeah!) Do do do do do do! (Yeah! My life, so real)\n\n[Verse 1: Nas]\nBefore I use to dream I could rule the world\nNow it's thorough I survived the perils in my fly apparel\nSeven forty five appeal, no candy paint no chrome wheels\nI Close deals tried to see my face on my own bills\nThe president here, he's honest and fair\nPrayed for the days, when the kins of slaves is honered and shared\nJanuary 20th I was there\nI'm aware the part I played to get young voters to care\nRecession is a blessin in disguise\nFor a new economy to rise somethin old has to die\nI'm still sippin' Rose' PJ's it be's like that\nI brung the eighty seven Fila's back\nSave collect, B.I.G.'S dream came correct\nTryin' to push seven hundreds, they made them yes\nI used to think United College Fund was for bums (Nah)\nThe ghetto advocate for education look what I become\n\n[Hook: Marsha Ambrosious {Nas}]\nBefore I use to dream I ruled the world\n{I use to have to imagine, now I can actually have it}\nSo here I am, to rule the world, world\nBut now you used to dream you ruled the world\n(Now, you, use, to, dream, you, ruled, the, world!)\n{I use to dream} (Ruled the world)\nSo here we are, are, are, are (Yeah! Here we are!)\n\n[Verse 2: Nas]\nI don't say I'm maintainin', that's a lame's language (word)\nPoor English, from a wise man I learned patience\nMe not distinguished, is like a fiendless Queensbridge\nI don't say I'm grindin', cause everything I do is redefining\nCause when you know the streets to the science\nApply it very moderate, 'til your business'll watch you profit\nRap game, NBA to NFL, the kids'll yell, \"Will I win? \"\nThe fella ends up in the cell - nonsense\nCause they can grow to be part of the Congress\nBe responsive, to these inner-city problems\nBehind a tent with a chauffeur, I rep for the culture\nRep for the thugs and STILL see eye to eye with Oprah\nI was a dreamer a wisher would hope for\nA better life for these kids while I sip on a Mosa\nI plan yo, you should watch the black and white's hand, yo\nWho's the best? Next to me, they couldn't light a candle\nYep!\n\n[Hook: Marsha Ambrosious {Nas}]\nBefore I use to dream I ruled the world\n{I use to have to imagine, now I can actually have it}\nSo here I am, to rule the world, world\nBut now you used to dream you ruled the world\n(Now, you, use, to, dream, you, ruled, the, world!)\n{I use to dream} (I Ruled the world)\nSo here we are, are, are, are (Arrrrreeeeeeee!)\n\n[Bridge: Marsha Ambrosious (Nas)]\nYou can be who you wanna, say what you wanna (Marsha!)\nTryna make it better, our sons and our daughters (Yeah!)\nUse your mind - make a change\nYes, we can - see a brighter day\nGon' be struggle, gon' be pain\nBut no excuses to be made\nThis is the time that we've been waiting foooooooooor!\n\n[Verse 3: Nas]\nI done seen it all, I got it on with the weak and strong\nThere's no relief, it's like the beef keeps keepin on\nI can't count the amount I drew heaters on\nCause we was warrin in the Ps', it was Vietnam\nNow I got you in arenas, watchin me perform\nThe songs rappin 'bout them same beefs and the street I'm from\nThankful, for the art form I'm eatin from\nI never see no losses, I only see we won - yeah\n\n[Hook: Marsha Ambrosious {Nas}]\nBefore I use to dream I ruled the world\n{I use to have to imagine, now I can actually have it}\nSo here I am, to rule the world, world\nBut now you used to dream you ruled the world\n(Now, you, use, to, dream, you, ruled, the, world!)\n{I use to dream} (I Ruled the world)\nSo here we are, are, are, are (Here we are this day!)\nBefore I use to dream I ruled the world\n{I use to have to imagine, now I can actually have it}\nSo here I am, to rule the world, world\nBut now you used to dream you ruled the world\n(Now, you, use, to, dream, you, ruled, the, world!)\n{I use to dream} (Oh we come so far!)\nSo here we are, are, are, are (Here we are this day!)", "image": "https://images.genius.com/23061dd2dc7e863127db561906debd27.434x434x1.jpg"}], "artist": "Nas"}