{"songs": [{"title": "Don’t Shoot", "album": "The Pimp Tape", "year": "2018-11-09", "lyrics": "[Verse 1: ScHoolboy Q]\nThe world don't love us and the hood be hating\nDestroy the minds of the kids we raising\nBabies having and killing babies\nThe cops patrol daily when they made me\nThis lil nigga drive Mercedes, huh\nThey wanna take my fingerprint even though my license be straight\nThey think it's fake, my name regis-straight\nThey want me riled up and catch a case\nSaid I resisted to a heavyweight\nAnd said I attacked 'em when I get shattered face\nBruh I'm just tryna feed my daughter eggs\nWorking late at 12 hour rate\nNigga gotta escape\nI'm shakin' this place, no matter how many damn L's I take\nOr F's I get, we strive for excellence\nThe cops supposed to protect the streets, but who protecting us from them?\nMy pen got me above the rim\nBlack creative mind jumping out the gym\nLife flashed cause your Dayton don't spin\nHands up, 'fore they take one out again\n\n[Chorus]\nHey now, don't shoot\nHands up, don't shoot\nToo drunk, don't shot\nHeadshot, don't shoot\nWhat you really know about the people?\nYou don't really know about the people\nYou don't even know what make the pain go away\nNo, you don't really understand the peaceful\nYou can't even figure how to see folk\nCan you even feel what we say?\n\n[Verse 2: Too $hort]\nYou motherfuckers want some\nEverywhere I go they banging\nWhere you from? What you claimin'?\nBitch ass nigga, you wish you could\nThrow your set up in the air and bang your hood\nYou from the ghetto, they don't know you on my turf\nBang right now, get your bitch ass murked\nIn the club turning up, better not throw it up\nGang politics bout to get you fucked up\nAlways twistin' up your fingers\nLil homie right behind you, he a real gang banger\nNo tattoo tears but he a hitter\nYou just a tough motherfucker on Twitter\nDon't get caught up in the crossfire, nigga\nYou throwin' signs up, he got his hand on the trigger\nYou on your phone 'bout to lose your life to a shooter\nGet killed for some shit that you typed on a computer, bitch!\n\n[Chorus]\nHey now, don't shoot\nHands up, don't shoot\nToo drunk, don't shot\nHeadshot, don't shoot\nWhat you really know about the people?\nYou don't really know about the people\nYou don't even know what make the pain go away\nNo, you don't really understand the peaceful\nYou can't even figure how to see folk\nCan you even feel what we say?\n\n[Verse 3: Joyner Lucas]\nI used to wake up in the morning, had to work and catch the bus\nJust me and my sister, no one sitting next to us\nI was dropping music but I couldn't catch a buzz\nUsed to do it cause I need it now I do it just because\nThis is my director's cut, Tarantino\nI need you to point me to the plug, Al Pacino\nI don't trust you suckers with your hobbies, that ain't me though\nBunch of undercovers, y'all some Bobby Valentino\nThis that East Coast, this that heat though, this that kilo\nThis that Migos, Bad and Boujee shit, that freak show\nThis that peep hole, I see through y'all, this that repo\nTake your bitch and play some Keno\nI'm a hero, Captain Save-A-Hoe in Speedo's\nI speed through y'all, this that speed boat, I found Nemo\nHope if they shoot me they ready to kill\nThey doing life  and they ready to squeal\nBitch I'm the devil, you're not on my level\nAnd you 'bout to find out if heaven is real\nI know y'all dead shot got roaming the plastic\nGet left in the grass when I run through your field\nWhat they gone do, put them heaters on you\nNiggas screaming \"Don't shoot\" when we all in your grill\n(Joyner, Joyner)\n\n[Chorus]\nHey now, don't shoot\nHands up, don't shoot\nToo drunk, don't shot\nHeadshot, don't shoot\nWhat you really know about the people?\nYou don't really know about the people\nYou don't even know what make the pain go away\nNo, you don't really understand the peaceful\nYou can't even figure how to see folk\nCan you even feel what we say?", "image": "https://images.genius.com/46e22a0f3338d4832cc1464e3d1176d3.680x680x1.jpg"}], "artist": "Too $hort"}