{"songs": [{"title": "Leonardo Da G9", "album": "Lil Glokk That Stole Khristmas", "year": "2018-12-13", "lyrics": "[Verse]\nI think all you niggas take me for a bitch, ain't it?\nAnd if you give me paint brushes, then you get painted\nYou tryna' test the G9 just to get famous\nAnd I done took a nigga cookie and some good [?]\nLeft him shitty, diarrhea, what he is, ain't it?\nDiamond shine, chandelier, quite a gift, ain't it?\nCaught a pussy in the rear, catch my drift, safely\nAnd if you eva' get the picture you better not post nothin'\nTell them crackas suck a dick, but what I'm facin'\nCounty talk, whole porch [?] take patients\nAll this talent, for a show but I ain't see patience\nBig Glock, so if you sleepin' now you awaken\nI done did the John Wall tryna' flex on 'em\nIt ain' nun but twenty grand drop a check on 'em\nTalkin' leave him where he stayin' let us flex sum\nLike we pop a xan, we ain' playin' you'll get stepped on\nIt's some niggas up to [?] when you be home\nBuck the jack, no [?] but through your curtains how we come through\nI be ballin' on 'em got me feelin' like I'm Rondo\nNever broke again, like that boy Quando Rondo\nTell that boy you play again I'ma sin like pronto\nComin' through the front, back, side, and the window\nThey think 'cause I signed, I'ma flop I just beginned hoe\nI'ma walk around with the .9 just try again tho'\nAnd I put that \"Uhh, aye yuh\" on the outro\nI'ma put that burner on a nigga like a eye hole\nThey gave me two mill but I think I need a lot more\nGave my niggas them some meals now they eatin' off a [?]\nClass in session nigga, I'ma teach ya'\nCall Lil Nine the Pastor, off a bean he wanna preach\nCTRL, alt, backspace, he get deleted\nI think I'm gon' hit a fucking mil on this speaker\nTook me for a CD, but ion repeat\nSay a nigga gotta C me but I'm a B\nI ain' ever pass the tenth grade as you can see\nBut I done made a big play, blew up from A-Z\nShe blew me like a balloon mush mouth\nRun off in ya' house and all the TVs, take 'em out\nI know he ain' gon tell Ion even gotta doubt\nIf he eva' in a situation, then I'ma get 'em out\nYa' know I gotta pistol somewhere, can't go without\nThese niggas think they takin' me then we can bang it out\nSum like a water sprout tornado season, spin around\nI got the bity bleeding 'cause they like what we about\nThese niggas playin' recruiters got me mistaken for a scout\nWe tryna' cop a shoota that's gon' move around town\nWater whippin ass shit somehow, a nigga drown\nI got a stupid bag like my pockets, they too small\nWe gon' pop alotta tags hit the mall and have a ball\nTalm bout he crashed why that boy ain' wreck the wall?\nOh, he copping deuces talkin' about that extra draw\nFuck a nigga thinkin' bitch you want a bitter fall?\nI'm campin' in yo bushes I'm just ready for that gunfire\nI'm know thirty Jits, right now who just trynna' slang iron\nWit them thirty dirty thirty poles on a hang time\nSnaggletooth tec, fully auto, and some land mines\nTell 'em, mind yo business stay in yours, and I got mine\nMy watcher, he reserve and observe, it's like it's gang time\nTold her stay in her\nUhh, aye\nAye, yuh\nAyye", "image": "https://images.genius.com/78f4f6711216df0a7880ea3cf1655467.500x500x1.jpg"}], "artist": "9LOKKNINE"}