{"songs": [{"title": "The Oath", "album": "Catch the Throne: The Mixtape, Vol. 2 ", "year": "2015-03-11", "lyrics": "[Intro: The Night's Watch Oath]\nNight gathers, and now my watch begins\nIt shall not end until my death\nI shall take no wife, hold no lands, father no children\nI shall wear no crowns and win no glory\nI shall live and die at my post\nI am the sword in the darkness\nI am the watcher on the walls\nI am the shield that guards the realms of men\nI pledge my life and honor to the Night's Watch\nFor this night and all the nights to come\n\n[Verse 1]\nNight gathers, my watch begins\nTo manifest 'til death, and it shall not end\nI take no wife, no land, father no children\nI wear no crown, win no glory and I shall not bend\nI am the shield  that's here to guard the realms of men\nI been in hell, while they're asking where the hell I've been\nI am the sword in the darkness, the watcher of all\nThat means I'm heartless, bigger they come harder they fall\nI pledge my life and my honor to the Night's watch\nFor this night and nights to come I give my life, watch\nSee the black crow, watch it revolve\nSome call us black brothers\nIce watch, colder than yours, we wear them black colors\n\n[Hook]\nAre you even man enough to take the oath\nMan enough to take a dagger to a throat\nOr are you only man enough when it matters the most?\nWhats the matter?\nYou was thinking your life mattered? It don't\n\n[Interlude]\nDo you know what leadership means?\nIt means that the person in charge gets second guessed by every little twat with a mouth\nBut if he starts second guessing himself, that's the end\n\n[Bridge][x2]\nI am the sword in the darkness, the watcher of all\nThat means I'm heartless, bigger they come harder they fall\n(Night Watch)(x2)\n\n[Hook]\n\n[Outro]\nThis is not the end, not for us\nNot if you lot do your duty for however long it takes to beat them back", "image": "https://images.genius.com/79300fbca741c0da5f837d0dcfdecf18.1000x1000x1.jpg"}], "artist": "Method Man"}