{"songs": [{"title": "My Potna", "album": null, "year": "2013-10-08", "lyrics": "[Verse 1: T.I.]\nYou got a problem, you can get it how you live, pussy nigga\nI ain't flexin', it just is what it is, pussy nigga\nGet thrown, get shot, get killed, pussy nigga\nSo what? You got all that money but you still a pussy nigga\nYou ain't bout that life, you just be actin hard, pussy nigga\nEvery day I'm sucka duckin, trynna dodge pussy niggas\nAll we did was slang crack and get paid, pussy nigga\nBeen the man ever since first grade, pussy nigga\nDon't believe me? See me, try me, see what happen, pussy nigga\nYou be dissin',I be laughin' cause you just rappin', pussy nigga\nNo matter what, you'll never be me, pussy nigga\nAnd see me, no matter what, I'll never be a pussy nigga\n\n[Hook: T.I.]\nI play a lot of games, but I ain't playin', I ain't playin'\nThey say a lot of things, but they ain't doin' what they sayin'\nDon't get it fucked up, them niggas scared not me\nHold up, let me tell these motherfuckers something 'bout me\n\n[Verse 2: T.I.]\nHey when they walk up on me 'Man, what it is, my potna?'\nI say nuthin' but Bankhead and Center Hill, my potna\nDidn't believe us when we said 'They tried to kill my potna.'\nThat's why he doin' life, but he still my potna\nBetter get it back to section, you ain't one of my potnas\nGet on your ass for touchin', that ain't one of my potnas\nAsk Snoop, I'm the truth, like Trae, my potna\nC-Dub, KT, yes they my potnas yo\nYoung Dro, Mac Boney, Big Kuntry, my potnas\nThey could talk but they know better than to fuck with my potnas\nAs a young'n OG told me 'Do your thang, my potna!'\nThat's why now I'm on everything and Hustle Gang, my potna\n\n[Hook: T.I.]\nI play a lot of games, but I ain't playin', I ain't playin'\nThey say a lot of things, but they ain't doin' what they sayin'\nDon't get it fucked up, them niggas scared not me\nHold up, let me tell these motherfuckers something 'bout me\n\n[Verse 3: T.I.]\nThese niggas talk tough, but they know they don't want it\nYou see me racked up, it's kinda fucked what you told me\nDon't be a fool now, boy I'll leave you where you lay\nAnd I got shooters, ain't no [?], just what they do every day\nBack in the day my record wasn't gettin' played\nI was trappin', ridin' dirty, gettin' paid\nWhat? Cut the 5 keys in the back\nHey let me tell you niggas something bout that\nMy cousin Toot was the man, he got his work 'round the base\nAnd how much money he made, nobody know 'til this day\nMy uncle quit, had the city sold up\nHe did 10k and back I blowed up\nEy Every man that's statin' 'bout me\nAt 16 all I wanted was a key\nA bank roll, an apartment full of hoes\nHey let me tell you something 'bout me 'case you didn't know didn't know\n\n[Hook: T.I.]\nI play a lot of games, but I ain't playin', I ain't playin'\nThey say a lot of things, but they ain't doin' what they sayin'\nDon't get it fucked up, them niggas scared not me\nHold up, let me tell these motherfuckers something 'bout me", "image": "https://i.genius.com/ad7742fb3a4582cebb3d467380d6b715855a829e?url=http%3A%2F%2Fcdn.hiphopwired.com%2Fwp-content%2Fuploads%2F2013%2F10%2Fti-my-potna-500x500.jpg"}], "artist": "T.I."}