{"songs": [{"title": "Keep the Receipt", "album": "Kon the Louis Vuitton Don", "year": "2005-01-01", "lyrics": "[Intro: Ol' Dirty Bastard and Kanye West]\nYo this is Dirt McGirt\nI'm chilling with Kanye West\nHe's killing y'all niggas on the beats\nHe's killing y'all niggas on the tracks\nWhere your plaques at, dog?\nThe game is officially over\nGo kill yourself\n\n[Hook: ODB (K. West)]\nNow take that and equipment back to the store\nWe don't wanna hear that weak shit no more\nDo anybody else make hits anymore\nGuess not mothafucka, it's the Roc mothafucka\n\n[Verse 1: Kanye West]\nNow y'all gon' stop talking that shit that you talking\nYour broke-ass mamma couldn't afford that abortion\nNow tell me how the hell she gon' afford that coffin\nNow I done sat back and seen it all too often\nThe backbone of this like Marino to the Dolphins\nMost hits out the Chi since Sosa and Andre Dawson\nMy niggas had Pro Tools, I had no tools\nKaraoke machine, fuck it I'm old school\nOnly difference is my tracks drove niggas postal\nSo I drove costal while they stay local\nHow I can't rhyme when my freestyles'll roast you\nSit down I'll coach you while we style in posters, dog\nNiggas had a chance to sign me, dropped the ball\nI'll see you at the awards\nNow after all that it took, I made it to The Roc\nI guess I ain't as dumb as you look\n\n[Hook: ODB (K. West)]\nNow take that and equipment back to the store\nWe don't wanna hear that weak shit no more\nDo anybody else make hits anymore\nGuess not mothafucka, it's the Roc mothafucka\nNow take that and equipment back to the store\nWe don't wanna hear that weak shit no more\nDo anybody else make hits anymore\nGuess not mothafucka, it's the Roc mothafucka\n\n[Verse 2: Kanye West]\nNow I showed you how to do this, dog\nPut a few beats on the tape, I saved this one for myself\nI heard you niggas' tapes, need a little bit of help\nBut I'm rapping and I can't do nothing for you man\nAsk G and Hop this, 40 grand if you ain't fam\nI mean, if you ain't Hov, if you ain't Cam\nDamn I know you say he's killing hisself\nHe got a little bitty deal now he feeling hisself\nYup just cause I played beats and act hospitable\nDon't mean I can't get you changed to hospital you\nI'm from a raw family, dog, and I'll spit on you\nSo play like a kid in the garden and get little you\nWho your hype man? I'm curious\nIt got you souped up like the cars on The Fast & Furious\nHere go a new movie for you critics called \"Who's Laughing?\"\nThe first producer that rap better than the rappers\n\n[Hook: ODB (K. West)]\nNow take that and equipment back to the store\nWe don't wanna hear that weak shit no more\nDo anybody else make hits anymore\nGuess not mothafucka, it's the Roc mothafucka\nNow take that and equipment back to the store\nWe don't wanna hear that weak shit no more\nDo anybody else make hits anymore\nGuess not mothafucka, it's the Roc mothafucka\n\n[Outro: Ol' Dirty Bastard and Kanye West]\nAftermath still making them hits, nigga\nLunatics still making them hits, nigga\nSo So Def still making them hits, nigga\nBad Boy still making them hits, nigga\nWu-Tang still making them hits, nigga\nRuff Ryders still making them hits, nigga\nCash Money still making them hits, nigga\nDirt McGirt still making them hits, nigga\nYo yo the game is over, go kill yourself\nGo kill yourself, nigga\nWe don't wanna hear that weak shit no more", "image": "https://images.genius.com/b7758602aa6883d6e056a8f30703a549.591x591x1.jpg"}], "artist": "Kanye West"}