{"songs": [{"title": "ADHD", "album": "ADHD", "year": "2019-09-12", "lyrics": "[Intro]\nIt kinda feels like, I'm dyin’ on the inside\nIt kinda feels like, I been tryna get by\n\n[Pre-Chorus 1]\nAnd I been this way since day one\nI don't need no medication\nNo, I don't need no drugs\nOr maybe I’m different, and maybe my ADHD got me trippin'\nAnd maybe I'm just everything that you missin', yeah\n\n[Chorus]\nI feel like I'm dying inside\nWhy do I think crazy?\nSomeone save me (Save me)\nYou can't blame me (Blame me)\nIt's my ADHD, yeah\n\n[Verse 1]\nMy mind racin', I been paranoid\nOverthinkin’, maybe that’s a void (Woo, woo)\nDon't cut me up like I don’t have a voice\nI think I was born different, I ain't really have a choice, yeah (Yeah)\nClass in session, you a hour late (Hour late)\nDon't play with me, today is not the day (Oh yeah)\nPay attention, I am not deranged\nI could tell you what I'm thinkin’, I just don't know how to say it\nMaybe I get on your nerves, I mean what I say (Oh yeah)\nI been a man of my words, eon wide awake (Yeah, yeah)\nMaybe a lil' disturbed, but that's just me\nYou don't bleed the blood I bleed\nI wear my heart on my sleeve, nigga\n\n[Pre-Chorus 1]\nAnd I been this way since day one (And I been this way since day one)\nI don't need no medication (I don't need no medication)\nNo, I don't need no drugs\nOr maybe I'm different, and maybe my ADHD got me trippin'\nAnd maybe I'm just everything that you missin', yeah\n\n[Chorus]\nI feel like I'm dying inside\nWhy do I think crazy?\nSomeone save me (Save me)\nYou can't blame me (Blame me)\nIt's my ADHD, yeah\n\n[Bridge]\nIt kinda feels like, I'm dying on the inside\nIt kinda feels like, I been tryna get by\n\n[Verse 2]\nYipee-yipee-yih-yoh-yipee-yah-yah\nStaring at the fire, kumbaya\nI'ma take you higher, take you higher\nI'ma take you higher, take you higher\nToo many things on my head (Yeah, yeah), what am I thinkin'?\nHow come I can't go sleep in my bed? (Oh, yeah)\nI hear them talking, everyone stranger\nThey leave me for dead (Oh, yeah)\n'Cause they want me gone (Yeah)\nThis that shit I be on (Yeah)\nAin't no one to lean on (Yeah)\n\n[Pre-Chorus 2]\nAnd you know I been this way since day one (I been this way since day one)\nI don't need no medication (I don't need no medication)\nOr maybe I'm on one\nOr maybe I'm different, and maybe my ADHD got me trippin'\nAnd maybe I'm just everything that you missin', yeah\n\n[Chorus]\nI feel like I'm dying inside (Inside)\nWhy do I think crazy? (Crazy, yeah, yeah)\nSomeone save me (Save me)\nYou can't blame me (Blame me)\nIt's my ADHD, yeah\n\n[Outro]\nIt kinda feels like, I'm dyin' on the inside", "image": "https://images.genius.com/d0eb2b80d212b93b097d604c4c6af62e.680x680x1.jpg"}], "artist": "Joyner Lucas"}