{"songs": [{"title": "Betrayal", "album": null, "year": null, "lyrics": "(feat. GangStarr)\n\nIntro(phone conversation):\nYo what up son?\n-Yo what up kid?\nYo, you holdin your head up?\n-I'm tryin to man, but the system is shady\nWord man they always man, they always tryin\nTo keep a good brother down, but I'm sayin\nWe still, you know we got love for you son\nAnd we prayin for you and we, you know\nWe tryin to hold it down wh\nYou know while you in there man\n-No question\nHopefully they won't keep you in there for too long\n-Yeah, for real, I sure love be out in a minute, you know?\n-But you know what I want you to kid? You know what would\n-be the bomb man?\nWhat's that?\n-You need to do some shit with Face man\n-Bomb on niggas, be shady man\nScarface?\n-Yeah man\nYo that's my nigga, yaknowwhaImean\n-Scarface is tight son\nYo that's a good idea word is bond\nI'm gonna talk the play in tomorrow(yeah) and\nSee about if we could hook up wit him\n-That's proper\n\nHook: Guru\nScandalous, money greed and lust\nIn this trife life, there ain't nobody you can trust\nPlus there's no justice, it's just us\nIn fact, watchin' yo back it be must\nAnd each and everyday around the way gats bust\nAnd jealous so-called friends'll try to set you up\nIt's called betrayal\n\nVerse 1: Guru\nCheck the horror scene\nThe kid was like twelve or thirteen\nNever had the chance like other kids to follow dreams\nWatched his father catch two in the dome and to the spleen\nNothin\" but blood everywhere, these streets are mean\nThey spared his life, but killed his moms and his sister Jean\nOf course over some drug shit\nHi spops was on some ill-out, spill your guts, on some thug shit\nDidn't know his boys was on some shady ass no love shit\nHis pops got played out though, with silencers they laid him out yo\nTook his stash and all the cash and left 'em, tied up on the couch yo\nWith tape over his mouth, so he couldn't cry out\nCause his dad was the nigga with clout\nSurvival of the fittest so they split his wig no doubt\nDespite the stocking caps he noticed the same cat, who used to give him doe\nAnd taught him, to use the same gat\nSupposed to be an Uncle,fam and all that\nHe could tell it was him 'cause he wore the same slacks, he wore when\nHe took him to Meadowlands racetrack\nWhy did he flip and go out like that?\nIt's called betrayal\n\nHook\n\nVerse 2: Scarface\nA Betrayal\nPunk ass niggas\nIt's called betrayal\n\nHe on a mission to become a ball player\nFlip big Benz's, flossin all gators\nHad it all mapped out,6-8,12th grader\nFresh outta school, he fin' to go lay paper\nHe had abrother who was hustlin collectin his change\nNever let his baby brother stick his neck in the game\nTold him all he had to do is just enjoy the ride\nAnd he ain't have to worry about money cause that's in time\nSo now he's pacin as the time moves slowly\nCan't wait to face Shaquille in the paint and school Kobe\nKept his grades and stayed up under naighborhood functions\nAnd then a group of knuckleheads came through dumpin\nSo now he's sittin on the sidewalk bleedin\nFell into a puddle of his own blood and stopped breathin\nAnd everybody in the neighborhood still grievin\nBut destiny caught up with his ass and he got even\nAnd all the cryin in the world ain't goin to bring him back\nHis brother, sittin at the wake wipin tears from his mother's eyes\nWhy'd the game have to go and take the young boys life\nOnly the wicked live shife, payin the price\nWhile he's starin at the shell\nHis brothers soul wants hell the trigger man made bail\nAnd you, wouldn't pay the boys mail, and sacrificed the fuckin family\nThat's betrayal\nBetrayal(echoes)\n\nHook", "image": "https://images.genius.com/4a83e0fa554b5f2e5c5acce61362bbe7.1000x1000x1.png"}], "artist": "Scarface"}