{"songs": [{"title": "Gettin Some Head", "album": "Dedication 2", "year": "2006-05-22", "lyrics": "[Hook](x2)\nI was gettin some head\nGettin', gettin' some head\nI was gettin' some head\nGettin', gettin' some head\nI was gettin' some head head\nGettin', gettin' some head\nI was wit the kinda girl that make ya toes pop\n\n[Verse 1]\nRidin' with a bitch I call hot mouth Shelly\nShe pop them ecstasies and get that cottonmouth heavy\nI give her a bottle of water bitch break out sweatin'\nAnd then she get straight to that head like a fuckin' excedrin\nI'm a fly ass nigga take a look at me bitch\nNow ho go and tell the cops I gotta crook in my dick\nStraight gut a bitch open like a hook in a fish\nI got a lady from Paris that french kiss my shit\nYea why you think I gotta tint my whips\n'Cause I be gettin' some head, right in my shit\nYou say you love that woman, but that been my bitch\nAnd if you kiss that woman, than you suck my dick\nThese hoes is nasty, y'all niggas is trippin'\nI got a bitch with her mouth like that boy Ken Griffey\nWhen I'm out in the streets better believe I'm pimpin'\nAnd if you ever saw me with one of them video vixens\n\n[Hook]\nI was gettin' some head\nGettin', gettin' some head\nI was gettin' some head\nGettin', gettin' some head\nI was gettin' some head head\nGettin', gettin' some head\nI was wit the kinda girl that make ya toes pop\nSuper head what's good? Super head what's good? Super head what's good?\n\n[Verse 2]\nYou know me I smoke a blunt while I'm gettin' brain\nStick my finger in her butt while I'm gettin' brain\nYeah I'm nasty bitch! What? Lil Wayne!\nI liked them Mac'd up lips and two tongue rings\nI gotta say it I'm the President I run things\nAll these hoes tryna save a nigga cum stains\nReal talk I get head I get head on the airplane\nBitch be climbin' all over that little chair thang\nI pull her hair back\nShe holla yeah back\nI like a bitch wit some lips like a bear trap\nAnd I don't mind goin' down I take care of that\nI have homie at home like where she at?\nShe wit me in my bad ass ride\nGivin' me a blow job like a 9-5\nShe said she eat her vegetables so she stay alive\nSo she slobbed on my knob\nLike corn on the cob\n\n[Verse 3: Pharrell]\nI mean I make her fiend for that dick\nThey be pumping the P, P be pumping 'em\nLook at they ass they gotta tell me just go\nYou ain't fucking with me when it come to these hoes\nBust fast across they chin\nWhat I'm saying to them man I don't pretend\nPush one button, and the chrome (?) ducking\nKeep it going like the grill on the (?)\nShe's a freak she want D's and some (?)\nShow her keys and the skirt'll go and shirt'll go\nShe say I hurt her tho, in the cervical\nShe being murdered tho, give her vertical\nBaller G ain't no apology\nWanna have a couple words better call a G\nMan I seen your sports car but it's smaller B\nThe Enzo's outside for you all to see\nLook at my chains, look at my rings\nRocks and watches, bracelet plain\nKeepin' it going, with a brick a day\nCan't compare so you just complain\nMad as a bitch, grabbing ya bitch\nGet OJ start stabbing ya bitch\nI'm Macy here's a cab for ya bitch\nCall me on my niggas shit beg and laugh at ya bitch\nA.C., gotta stay cool mane\nNever let 'em see you sweat that's the rule mane\nHit her till we through mane\nSend her back to you mane\nThat's what we do mane\nBubble gum chew mane\nOther than that catch me getting some bread\nIf you see my billboards I be getting some head\n\n[Hook](x2)\nI was gettin some\nGettin, gettin some (aye)\nI was gettin some (aye)\nGettin, gettin some (aye)\nI was gettin some head (aye)\nGettin, gettin some (aye)\nI was wit the kinda girl that make ya toes pop\nI was -", "image": "https://images.genius.com/d3b5f479408c61bed346754e1bb3f8ad.1000x1000x1.png"}], "artist": "Lil Wayne"}