{"songs": [{"title": "The System Gotcha", "album": "Never Forget", "year": null, "lyrics": "[Hook] x2\nSo if you think you're too old\nYour thinking that you're too cold\nYou gave up on your true goals\nThe system gotcha\nI'm giving you a new soul\nYou're never ever too old\nTo manifest your true goals\nOr the system gotcha\n\n[Verse 1]\nYou're never too old to sell a key\nSo how could you be too old to emcee?\nI'm from where it originated so get me\nWhy would I stop what I created, even at sixty?\nShout out to Herc and Cindy\nHip hop lifts me and never left me\nYou know where KRS be\nRight there where the best be\nWhen I spit a free I can't help it if that's how God blessed me\nSo I'm never empty, writer's block never tempts me\nWith twenty albums I mastered this evidently\nSo I ask you gently\nYou don't see how to spot me on the block with my classic medley?\nI can't stop, people won't let me\nI don't talk sexy, but I do come correctly and you can check me\nBut just don't compare me to the next G\nKRS-ONE: when you get older you'll respect me\n\n[Hook]\n\n[Verse 2]\nI keep it moving all over the country\nDoing underground spots with the ceiling above me\nI keep it dark and ugly, microphone crusty\nWe will be here forever; trust me\nI rock the spots that be dusty and banged out\nI do house parties, raves and gang hangouts\nOthers took the same route, we didn't take the main route\nYou know who they are, I ain't gotta call they name out\nThey superstars, but in 1986 you ain't know who we are\nAnd notice when I said \"who we are\", as opposed to \"who we were\"\nCause the past and future already occurred, but it was blurred\nTime reversal symmetry just occurred\nMy being is timeless if the future remembers me\nAnd there's no end to me, word!\nPast and future happen at the same time, especially in the memory\nWe share the same mind. Images of my future telling me the same sign\nIn 1983 who I'd be in '09, but it's past 2011 and I flow fine\nRapping at 70? Believe that it's no crime\nThese youngins rent they style, I own mine\nAs you can see, I don't be relying on my old rhymes\nI'm spitting raw rhymes, right here, right now\n25 years, I never put the mic down", "image": "https://images.genius.com/8219c6b423edb4d95b5c842a51f3b31e.640x480x1.jpg"}], "artist": "KRS-One"}