{"songs": [{"title": "It’s Okay (One Blood) [Remix]", "album": "Doctor’s Advocate", "year": "2006-11-14", "lyrics": "[Intro: Jim Jones]\nUh-huh, Jones\nDipset, Byrdgang, bitch!\nYou know what it is\nWhen you see me two twelvin' you, homie (that's right)\nYou fuck niggas keep triple ninin' (Eastside)\nHave some integrity, bitch\n'Fore it get tech-mangy out here, smell me? (Ballin'!)\n\n[Verse 1: Jim Jones]\nPeace Blood, peace almighty (Peace Blood!)\nWe all thugs and we run the streets nightly (Eastside!)\nAnd get my lawyer; why? 'Cause I ain't coppin' out (Nope!)\nAnd I fuck with b-boys that bring them choppers out\nOne shot of that'll have the boys bring the coppers out\nAnd we ballin', foreign toys what we hoppin' out (Flossing!)\nMy fair east side, where we ride\nAnd we all fly high in the Lear G5s (Ballin'!)\nSo twist your fingers up\nAnd bang, motherfucker, bang! (Nine-Trey!)\nGet your money up, this 'caine is what we fuckin' slang (Gotta hustle!)\nAnd nine-trey is what I fuckin' claim (Ugh!)\nIt's Dipset Capo, the don of the Byrdgang (Eastside!)\n\n[Verse 2: Snoop Dogg]\nThey call me D-O-dub, wasn't really trippin', Cuz\nTwenty-one, twenty Crips and all of us is Crippin', Cuz\nWe from a different street, all got that different heat\nBut when we move the Macs\nWhen Game come, we on the same beat\nSo if you fuck with Blood, then you fuck with us\nAnd we ain't bustin' duds, 'cause we bustin' slugs\nWe sure to stay in touch and clean your mess up\nAnd if you from the West Coast, my nigga, W-W-W-W-West up!\n\n[Verse 3: Nas]\nGame got at me about the remix, it's a honor, my nigga\nI made rap one blood, Nasir, signin' with Jigga\nI got rappers gettin' mad at me\nI got these new jack rappers tryin' to clap at me\nI got these corny wannabe diss song kings on the radio\nTalk about how they gon' spray and take me away\nBut I'm the true living legend, I'm not to be questioned\nHave your whole hood holla shit about my progression\n\n[Verse 4: T.I.]\nYEAH! You knowin' my attitude shitty (Ok!), only a buck fifty\nSo I keep the Smittys with me—shit, how many getting it?\n(Hey, what you scared?) I'm prepared in the mall and all\nWith two-twos, you can call me Quick Draw McGraw (Haha!)\nYou try me, I'ma cut that fool, better call the law\nI start sprayin', make fuck niggas fall and crawl (Bow! Bow!)\nI press play like Puff, no pause at all\nChoppin' holes in all the walls, that's all they saw, hey!\n\n[Verse 5: The Game]\nHip-hop ain't dead, it just took a couple shots\nI bring it back to life, give it a couple shocks\nThe king comin', no, I'm not Jay-Z\nToo many niggas hate me, but they scared to face me\nThis ain't a movie, dawg, (nope!) not Waist Deep\nI'm not a actor but I'll show your bitch big meat\nShe givin' one blood, one love, on dubs\nA hundred forty thousand the first week, ugh!\n\n[Hook: The Game]\nRemix, remix, remix\nRemix, remix, remix\nRemix, remix, remix\nRemix, remix, remix (Remix!)\n\n[Verse 6: Fat Joe]\nAll these niggas wanna front trill with them stiff faces\n'Til them niggas lyin' still up in stiff cases\nWith the Styrofoam and embalmin' fluid\nI been gone too long, and I'm dying to lose it\nSomebody go and get this nigga a pine box\nAnd I ain't just talkin' 'bout a measly nine shots\nYeah I'm chopper-happy and my wrist loose\nCall me Goldie, I'll smack a bitch too\n\n[Verse 7: Lil Wayne]\n504 gangsta, New Orleans soldier\nBangin' underwater, fuck around and soak ya\nLouisiana gunner, I'm 'bout my holster\nAnd if you gettin' greasy, I'm an ulcer\nI'm bickin' back, bein' bool, on the Eastside\nOf New Orleans where the Bloods at the B-hive\nAin't nothin' sweet unless it's Presidential\n'Cause that is where I sleep, now give me my key\n\n[Verse 8: N.O.R.E.]\nNew York, get the blood money (Dirty cash!), still sweet\nWe the Black Wall Street by the swap meet with heat\nDef Jam, they gon' flop him\nAnd Reggaeton ain't hot in the building no more\nIt's OKAY! I get it poppin'\nBack to the forest trees for deep, these little mes\nWho took believers a opportunity to breathe\nAnd you ain't gotta go overseas to see Iraq shit\nYou can come to LeFrak, Queens and get jacked quick\n\n[Verse 9: Jadakiss & Styles P]\nOne blood, we used to the spillin'\nCame from the hood so we used to the killin'\nUsed to the black males makin' crack sales in the building\nHow else you get the Benz with the suede on the ceiling?\nBlood in, Blood out, me and homie back-to-back\nBoatload of work and we about to pitch a shut out\nI'm New York's king, I'm New York's hardest nigga\nAnything in between's a motherfuckin' target, nigga\nD-B-L-O-C-K, he spray\nThe hawk'll find a nice home right where your cheeks stay\nWe got a mean team, hip-hop's dream team\nThem boys is only in the projects on green screen\nYeah, no security, I'll put you on the respirator\nI'm the bomb; I'm the motherfuckin' detonator\nOne dutch, one bud, one burner, one slug\nWant a couple casualties, but we'll settle for just...\n(One blood!)\n\n[Verse 10: Fabolous]\n(What it look like?) All I say at most\nShooters waitin' on the word, \"Just say it, Los!\"\nI let these niggas live (Yes!), I told 'em pull the plug\nHave them goons pullin' gloves, leave the room full of slugs (Yes!)\nCatch me traffickin' on maroon-colored dubs (Yes!)\nCouple Africans with balloons full of drugs (Yes!)\nIf they like me, tell 'em line up\nWhile I sit behind ten and point 'em out like a line-up\n\n[Verse 11: Juelz Santana]\nMic check, one two, one two (Check!)\nI'm strapped, you strapped, let's play two-on-two (Let's go!)\nYou're eyein' us in the iron bus (Boom!)\nLeak you, two liters of red juice: Hawaiian Punch (Ha!)\nSo what you boys gon' do to me? (What?)\nI'm born street, your life's sweet: MTV's Laguna Beach (Damn!)\nMama told me not to play with fire\nBut she never told me I would grow to be a lighter\n\n[Verse 12: Rick Ross]\nOne love to the gangs (Yeah!), but I'm in the things\nSave the colors for the cars, see, we kill for the fame (Ross!)\nThe boss made it, yeah, we floss flagrant\nShame how I lost your life savings up in Las Vegas (Ross!)\nI'm a heavy better, I'm a heavy seller (Tell 'em)\nKeep white in the office, call it Jerry Heller\nLettin' off a hundred rounds (Rounds), let the barrel pick (Pick)\nAnd we gon' sit here and wait for the Darryl case\n\n[Verse 13: Twista]\nChi got Lords and Gangsters, show me where them niggas at\nChi got Two Sixes and Kings, show me where them killas at\nChi got them ballers and hustlers, show me where them figures at\nGame, where them triggers at? Aim at them fitted caps\nHe got the clips, I got the scope, let's get them choppas, nigga!\nHe got the kush, I got the dope, let's get it poppin', nigga!\nHurt him in that cherry six-four, shit, ain't no stoppin', nigga\nHit him in the head and the body with a bullet\nWhen I put him in the cemetery then I gotta holla out\n\n[Hook: The Game]\nRemix, remix, remix\nRemix, remix, remix\nRemix, remix, remix\nRemix, remix, remix (Remix!)\n\n[Verse 14: Kurupt & Daz]\nWhat up, Cuz? Yeah, rollin' with two grips\nGlock holdin' on the hip, rollin' with two clips\nGot two tiny locos ready to take trips\nShake and make trips, high stakes to take grips (Grip)\nBut they know what's crackin', Cuz, 'cause as we huddle (Ayy!)\nThey hold cards down, nigga, like spades and pinochle (Nigga)\nWest Coast gangbang, riders erasin' 'em\nGot funny niggas raisin' up and riders replacin' 'em, Cuz\n\n[Verse 15: Daz Dillinger]\nDraped in blue, notorious gangsta crew\nR.I.P. for niggas who don't stay true\nDeep down in the crevices (Woo!), see, them checks better win\nDwellin' in the land of the gangbang profession\nI'm legendary, yes, yes, a West Coaster\nThrowin' up two Cs with two guns in my holster (Woo!)\nI'm from Long Beach City, a Crip next to Compton\nDown with my nigga, Game, if you niggas want problems\nFrom the streets to the suites, anywhere, we can meet\nDel Amo to Compton, Slauson Swap Meet\nWorldwide (Wide), get swept away by the tide\nYGs and BGs, OGs, it's time to ride!\n\n[Verse 16: WC]\nWho the riders shooting through the gutter lane?\nTrued up in them Carolina blue Hurricanes (What up Blood?)\nFrom the Westside, strivin' to dead 'em\nWhere them killers throw that third letter up\nLike Raymond Washington and Tookie Williams\nBlue jeans, blue strings, blowin' blueberry green\nCadillac on blue Ds and a blue tee\nMoney thick as blue cheese, chuckin' up the dub\nWhat the West be without Snoop and Dub C and one blood?\n\n[Verse 17: E-40]\nThe Bay Area, fuckers, we pop 'em\nOpen you up if you got a problem (Ahhhh!)\nUp top, born in California\nClean your clock, open your can of tuna (Doot-doot-doot!)\nMake a choice, it's either Hell or it's Heaven\nGet your chest laid out with the FN-57 (Bo! Bo! Bo!)\nThis ain't nothin' to do with nobody\nIn the Yay, there ain't nothin' to do but catch bodies\n\n[Hook: The Game]\nRemix, remix, remix\nRemix, remix, remix\nRemix, remix, remix\nRemix, remix, remix (Remix!)\n\n[Verse 18: Bun B]\nI'm comin' straight up outta P-A-T like Compton in all black\nBut when we say \"What it do?\", they never say, \"Holla back!\"\nBun Beeda, I'm OG, like '95 Air Max\nNeon green outta Flight Club off of Fairfax\nAsk the Hundreds, it's doable, I done done it\nAt the summit of rap, and I'm watchin' you haters plummet\nRun to it or run from it, to Bun, it don't differ\nWipe the streets with ya like you a Swiffer as a gift\nOne blood\n\n[Verse 19: Chamillionaire]\nI'm the realest youngsta that's breathin'\nAnd I don't gotta give a reason\nChamillionaire a millionaire\nY'all competin' to be competin'\nMy purpose is to get the cheese\nAnd that's a purpose that you're defeatin'\nSo shut your mouth, have a seat\nAnd be quiet 'til I'm finished eatin'\nMy label tells me I'm greedy\nHoggin' all the room on your TV\nLike Eric they think it's Eazy\nBut it isn't easy, believe me\nNeed to make a room in B.E\nTelevision if you wanna be me\nGame said he made room for Jeezy\nI had to make room for me, G\n\n[Verse 20: Slim Thug]\nIt's one blood if you Blood or Cuz\nFrom that number one Thug, it's still one love\nI rep my blue boy team, but I do it for green\nI do it for my folks, Vice Lords and Kings\nAll the trappers, future rappers, standin' out on the blocks\nTryna get up out the hood, man, and stack up a knot\nPut your sets in the air, scream, \"Fuck the cops!\" (Word, fuck 'em)\nWe gon' rep for the hood, man, like it or not (Thugga!)\n\n[Verse 21: Young Dro]\nMy feed mashable, murders are catastrophical (Okay)\nCars is improbable, I'm overcomin' obstacles (Okay)\nTrappin', I made it logical (Okay), my topic is impossible (Okay)\nI got a partner named Shoe Strang 'cause shorty real crossable\nShark meat to Pappadeaux, cars be tropical (Yeah, yeah)\nAll guns choppable, all blocks are mobbable (Yeah, okay!)\nI'm unstoppable, my Calico is toxable\nLyrically diabolical, kushin' is now cigarable (What it is!)\n\n[Verse 22: Malice & Pusha T]\nRedrum, redrum, such power in the tongue\nNever in the wildest, wasn't talkin' to them\nStyle on niggas but feel it to the numb\nJapanese thread, brought flavor to these bums\nConsider me the savior, look what the Lord gave ya\nMy celebrated presence like the return of Rayful\nFrolic in the snow so playful\nAnd revivin' the track like we flowin' through jumper cables\nWhat duo you know\nGet XXL kudos while coppin' off Julio?\nYeah, classic shit, we mastered this\nLeft for dead, I'm back, I'm Lazarus\n\n[Hook: The Game]\nRemix, remix, remix\nRemix, remix, remix\nRemix, remix, remix\nRemix, remix, remix (Remix!)\n\n[Verse 23: Ja Rule]\nNigga, one Crip, one Blood, L.A., New York\nThe Game, the Rule, one love, guns up\nHands down, can't touch the flow, it's a bit much\nThe style, wanna keep up? I'd advise you to speed up\nWith money movin' like coke these days gotta re-up\nG up, cop some heaters and dare a nigga to act up\nYou see us in dual-seaters and throw it up\nIt's all hood, niggas, rep your sets if you Cuz or (Blood!)\nNiggas, we all bleed!\nThese niggas can't breathe!\nOnly because the guns are drawn and aimed to part\nNiggas that got bullets with names on them\nWant 'em? Come get 'em! Niggas, y'all know where to get at me\nLook at me, now pass me, maybe you can be half me\nYou bastards, I'm laughin', bullets stickin' in family\nWho sadly gets torn between one Crip and one (Blood!)\n\n[Outro: Ja Rule]\nY'all niggas know me, haha, yeah!", "image": "https://images.genius.com/8733b8e495bb8c50e53cd1da0aada2cb.1000x1000x1.jpg"}], "artist": "The Game"}