{"songs": [{"title": "Special", "album": "The Documentary", "year": "2005-01-18", "lyrics": "[Intro: Dr. Dre & The Game]\nAw man! Aye Game, don't tell me you love her\nI mean I like the bitch, I don't love her\nNext thing you know you gon' be all boo-boo'd up with her and shit\nFuck that!\n\n[Hook: Nate Dogg]\nGirl I'll do anything to make you feel special\nMan it's easy to see you're special to me\nWhether we lovers or friends, we'll always be\nI want you to know, you're special\n\n[Verse 1: The Game]\nL-A-X to J-F-K, that's where it all happened\nCaught you walkin out that Gucci store in Manhattan\nI was in chains and cuffs, you was wit'cha girls\nI was in that Aftermath chain, you was in pearls\nIt was me against the world baby girl; you had dreams of stardom\nThe Prince of Compton meets the Queen of Harlem\nFirst date at Mr. Chao's it was kosher, I wore culture\nThe fur, the Gucci, Louis, Fendi, Prada, Dolce\nYou're runnin circles in my living room, tearin up sofas\nMcLaren or Rover, fuck it ma let's tear up the highway\nLet the Sprewells spin 'til the plates fall off\nThen we can go one-on-one in Dre's house\nJeans painted with the waist cut out, you rock 'em the fly way\nThat lil' bit of Compton mixed with Bed-Stuy way\nAnd girl, I'm not tryin to excite you, I'm tryin to wife you\nBamboo earring, white Air Nike you, yeah\n\n[Hook: Nate Dogg]\nGirl I'll do anything to make you feel special\nMan it's easy to see you're special to me\nWhether we lovers or friends, we'll always be\nI want you to know, you're special\n\n[Verse 2: The Game]\nI like your style, like the way you move, the way you talk\nThe way you smile, the way you swingin them hips when you walk\nThe way you look, the way you ride when you workin them thighs\nThe way you lickin your lips when you look in my eyes\nYou down for me? I'm down for you\nYou go down on me, I'll go down on you\nI wanna do all the things that your man won't do\nI'm from the hood, so I know how to handle you\nKeep you in pink rocks and G-Unit canvas shoes\nShow you how to gangsta lean when the Lambo move\nI'll take you to New York City, Atlanta too\nShow you how to fly them birds and them hammers through\nAnd you know\n\n[Hook: Nate Dogg]\nGirl I'll do anything to make you feel special\nMan it's easy to see you're special to me\nWhether we lovers or friends, we'll always be\nI want you to know, you're special\n\n[Verse 3: The Game]\nLet me tell you 'bout the birds and bees\nHow I stand on the block all day and flip birds and ki's\nYour boyfriend don't like me, cause he don't get a fourth of my cheese\nAnd you can take back the Porsche and his keys\nHop in the Range Rover, you ain't gotta force him to leave\nI got a chrome four-four in my jeans\nYou got Gucci frames coverin the mark on your face\nCause he don't want you to leave, and I don't want you to stay\nSometimes I wanna snatch that nigga out his CLK\nI know he treatin you the way K-Ci did Mary J\nI wanna, ease your pain, kick off your Louis sandals\nLet me, wipe your tears with my G-Unit bandana\nYou make me wanna peel you out them jeans when you rockin them\nIt's \"Me & My Girlfriend\" like 2Pac and them\nJay-Z and Beyonce, or Bobby and Whitney\nWe the 0-5 Bonnie and Clyde, feel me?\n\n[Hook: Nate Dogg]\nGirl I'll do anything to make you feel special\nMan it's easy to see you're special to me\nWhether we lovers or friends, we'll always be\nI want you to know, you're special", "image": "https://images.genius.com/395930cce0f4587e3046d2e0a817502c.900x900x1.jpg"}], "artist": "The Game"}