{"songs": [{"title": "Shit On You", "album": "Devils Night", "year": "2001-06-19", "lyrics": "[Intro: Eminem]\nI'll shit on you -- da da, da da, da da\nI'll shit on you -- da da, da da, da da\nI'll shit on you -- da da, da da, da da\nI'll shit on you -- da da, da da, da da\nI'll shit on you! I will shit on you\nI'll shit on you! Girl you know, its true\nI'll shit on you! Bitch or man, its true\nI'll shit on you! I will shit on you\n\n[Verse 1: Swifty McVay]\nI remain fatter than gluttony\nTaping bombs to the back of record companies\nBlow 'em up if they ain't wantin me\nThe national guard, they scared of huntin' me\nI love beef; I got you hoes ducking me\nA drug thief, bitch I'll take your marijuana\nThese slugs'll keep your ass away from my corner\nI drown niggas in hundred degree saunas\nYou can act a fool if ya wanna (biatch!)\nIt's this lyrical piranha\nStrapped wit a grenade, in the pool with ya mama\nAttack her by the legs then I pull her to the bottom\nTwist nuttin' up like a condom\nSlap it if you fuckers got a problem\nWhen I see 'em, you hoes ending up in a fucking mausoleum\nOr hidden in the trunk of a black and gold BM\nPull in the garage while you screaming\nKeep the motor on then I'm leaving (I'll shit on you!)\nI'll shit on you!\n\n[Hook: Eminem]\nI will shit on you I don't care who you are\nI'll shit on you!\nI don't give a fuck about you or your car\nI'll shit on you!\nFuck your house, fuck your jewelry and fuck your watch\nI'll shit on you!\nFuck your wife, fuck your kids, fuck your family\nI'll shit on you!\n\n[Verse 2: Bizarre]\nI'm a alcoholic, where's the fucking toilet?\nPass the hot dogs (Bizarre aren't you Islamic?)\nBitch, shut your fucking mouth\nI'mma keep eating 'til Richard Simmons comes to my house\nWith a chainsaw to cut me out (me out, me out!)\nI'll fuck your wife, I had sex since I met her\nToo busy fucking with your twelve year old baby sitter (hahaha)\nAnd all women ain't shit - only good for cooking, cleaning\nAnd sucking dick - and that's it! (I said it)\nI'm responsible for killing John Candy\nGot Jon Benet Ramsey in my '98 Camry\nI don't give a fuck who you are\nI'll shit on anybody; truly yours the idiotic Bizarre\n\n[Verse 3: Eminem]\nMy adolescent years weren't shit to what I do now\nI never grew up, I was born grown and grew down\nThe older I get, the dumber the shit, I get in\nThe more ignorant, the incident is, I fit in\nIgnoring the shit how boring it gets\nWhen there's no one to hit\nI don't know when to quit throwing a fit\nI know I'm a bit flaky but they make me\nIt's they who egged me and say they can take me\nIt's they who legs I break and make achy\nIt's they who mistake me and make me so ANGRY!\n(I'll shit on you!) I'll spit on you\nStart pissing and do the opposite on you\nYou weren't listening, I said I'll cop a squat on you\nStart spilling my guts like chicken cordon bleu and\nStraight shit like Notorious B.I.G. did to that bitch\nOn his skit on his last album\nPull my pants down and\n\n[Hook: Eminem]\nI will shit on you I don't care who you are\nI'll shit on you!\nI don't give a fuck about you or your car\nI'll shit on you!\nFuck your house, fuck your jewelry and fuck your watch\nI'll shit on you!\nFuck your wife, fuck your kids, fuck your family\nI'll shit on you!\n\n[Verse 4: Kon Artis]\nIs Richard Pryor still alive?\nIf not I'm sicker than he was prior to him dying (what?)\nBorn brainless, this steel ain't stainless\nYour bloodstains are all over this steel god dang-it\nBitch bring it, these niggas that I hang with\nI hang you up naked by your ankles dangling (oww, oww)\nMy need I stay strangling, I don't need your help\nIf you don't give me the pussy\nI'll un-loosen my belt (I'll shit on you!)\nI'm what your daddy's not, your mom's kinda cock\nYour sister tends court, your aunt supply her rocks\nBuck fifty cross your neck\nFloss your TEC, I'll beat you wit it across your chest\n\n[Verse 5: Kuniva]\nYo, it's only right I jack your car keys and run\nSpent all of my advancements on weed and guns\nFor fun, when I'm drunk\nI'll run a truck through the weed house\nJump out and beat ya peeps down worse than Steve Stoute\nPut you in chokeholds I learned last week\nFrom the Police man who caught me stealing weed from his jeep\n(hey, hey, hey!) I see hoes biting, y'all don't wanna brawl\nThat's like Deebo fighting Peabo Bryson (I'll shit on you!)\nFuck what you hollering and yelling about\nI'll reach in your mouth and pull your fucking skeleton out!\nNiggas get hit wit a two piece; (bling bling)\nWit a poisonous sting, I'm such a violent thing\n\n[Hook: Eminem]\nI will shit on you I don't care who you are\nI'll shit on you!\nI don't give a fuck about you or your car\nI'll shit on you!\nFuck your house, fuck your jewelry and fuck your watch\nI'll shit on you!\nFuck your wife, fuck your kids, fuck your family\nI'll shit on you!\n\n[Verse 6: Eminem]\nOnce I get on two hits of X my disk slips and disconnects\n'til I walk around this bitch with a twisted neck\nBut still shit on the first bitch who disrespects\n(c'mon, I'll shit on you!) Over reaction is my only reaction\nWhich only sets off a chain reaction\nAnd puts five more zany acting maniacs in action\nA rat pack in black jackets who pack ten\nNine millimeters, five criminals pulling heaters\nAnd spilling liters of blood like swimming pools\nShiesty individuals shoot at bitches too\nA lot of people say misogynistic which is true\nI don't deny it matter of fact I stand by it\nSo please stand by as I start up a damn riot\nIf you don't wanna get stampeded then stand quiet\nBoy, girl, dog, woman, man, child (I'll shit on you!)\n\n[Hook: Eminem]\nI will shit on you I don't care who you are\nI'll shit on you!\nI don't give a fuck about you or your car\nI'll shit on you!\nFuck your house, fuck your jewelry and fuck your watch\nI'll shit on you!\nI will fuck your wife if you fuck with me\nI'll shit on you!\n\n[Outro: Eminem]\nYou heard me\nBitch, I'll shit on you\nD12 will shit on you\nI'll shit on you\nYour life\nYour wife\nYour kids\nYour car\nI'll shit on you\nYour house\nYour spouse\nYour rings\nYour things\nI'll shit on you\nI'll shit on you\nI'll shit on you\nI'll shit on you", "image": "https://i.genius.com/22f2255a88932d6f2cde9eed5f9f12a06c85255c?url=https%3A%2F%2Fwww.music-bazaar.com%2Falbum-images%2Fvol14%2F648%2F648927%2F2496420-big%2FShit-On-You-cover.jpg"}], "artist": "D12"}