{"songs": [{"title": "Red", "album": "Hoodmorning (No Typo): Candy Coronas", "year": "2011-07-29", "lyrics": "[Intro: Redman]\nRedman in the building\nYo Game what’s good my nigga?\nGilla House\nBlack Wall Street, what’s hood?\nYou already know I’mma do it like this my nigga\n\n[Verse 1: Redman]\nYo I’ve been hustlin’ that’s where the fuck Red been\nIt’s Redman, infrared with a hairpin - trigga\nWhen the red ring, I got bitches in Washington after my red skin\nRed, that’s the color when it came out him\nRed, that’s the name of the Game album\nRed, I wear black, I look fly\nRed, I’m getting head on the red eye\nRed, put in work\nRed, keep the airport security on high red alert\nRed, what’s up Red?\nYou know Red to' up\nRed, the color that Baby and Wayne throw up\nRedman, the red necks they can’t stand it\nI got caught with their daughter red handed\nRed, I’m not rich but the paper good\nSo bring it on around a big boy neighborhood\n\n[Hook: Redman]\nRed, yeah yeah boy you know me\nRed, that’s the color that my eyes be\nRed, I’m on fire homeboy\nAnd that’s that the color that’ll show you that I’m hot\n\n[Verse 2: Game]\nYou mention Redman the wrong way it’s red dots\nI put you in the sky nigga, Redd Foxx\nYeah Red Rum, Glock got the red beam\nGive you red wings and I ain’t talking about the hockey team\nI’m talking red rags hopping out of red wags\nWith a red bone, head redder than Sinbad's\nAnd I’ve been bad before Michael Jackson was\nThat’s why the R.E.D. album got a Michael Jackson buzz\nI mean I should get a red Michael Jackson glove\nAnd grab my dick (HOOOOOOOO!), what’s happening blood?\nOr you can catch me on the red carpet\nBitch rocking red bottoms, you can call her red scarlet\nAnd just like the store you can be a red target\nMy shit butter, you ain’t never seen red margarine?\nRed star with my face make ‘em talk a lot\nShut they ass up, red 'raris in the parking lot\n\n[Hook]", "image": "https://images.genius.com/c7e8ae0f47986bad415f5d58fc0b2281.320x320x1.jpg"}], "artist": "The Game"}