{"songs": [{"title": "Goin’ Down", "album": "Return to the 36 Chambers: The Dirty Version", "year": null, "lyrics": "[Intro: Ol' Dirty Bastard]\nHell\nRemember when we was young\nAnd we used to go\n(ahhhhhhhhhh) *repeated*\nAh, Punch Call!\nNo no, remember when we used to say who could do this the longest\n(ahhhhhhhhh) *repeated*\n*breaks down*\nAhhhh!!!!!!!! ahhhhhhhhh!!!!!!!!!!\nAll right, I'm about to put it\nGoin down, down\n\n[Verse 1: Ol' Dirty Bastard]\nI am the U-N-I, The Q-U-E, the G to the O-D\nI said I go by the unforgettable name of the man called Unique G\nWell, my name is known all over the world\nTo the foxy ladies and the pretty girls\nI go down in history\nAs the baddest brother that ever could be\n\nYou couldn't show me\nDidn't know me\nHow to be a true MC\n\nMy advantage on the M-I-C is the slang\nThat I manifest so you could never hang\nObviously you know my name by now\nI done thrown stupid parties all through your town\nDirt McGirt...that's my motherfucking name\nLove to flirt...that's my motherfucking game\nThey said \"Who wanna be an MC?\"\nI am the original G-O-D\nMaking young ladies scream's my specialty\nSee my style, different from yours\nMake young bitch wanna drop the drawers\n\n[Interlude: Icelene Jones]\nFuck that bullshit Unique\nYou my motherfucking husband\nI ain't got no motherfucking time for them bitches\nYou better come home with me\nYou better bring your motherfucking ass home tonight, motherfucker\nI ain't got no motherfucking time for no bitches calling my motherfucking house with that bullshit\nYou got three fucking babies to take care of\nFuck that shit\n\n[Interlude: Ol' Dirty Bastard]\nMatter of fact, I gotta song for you all:\nSOMEWHERE OVER THE RAINBOW\nWHERE BLUEBIRDS FLY\nSOMEWHERE OVER THE RAINBOW\nWHY OH WHY\n\nHEAR ME NOW!\n\n[Verse 2: Ol' Dirty Bastard]\nStyle funky, you know dat's me\nKILLER BEE whohoho ONE MAN ARMY\nDown for mine when I go on tour\nThrow your hands in the air if you want more\nStyle is evil is like an wicked witch\nWith the mi-ca-phone spliggh! Funky as a bitch\nWhich is which, makes me nasty nasty\nNext on the mic is the rappin NUH\nYou want some of the Ason's gun\nShoot the nigga, BLAAOW, reaches no one\nThen you KNOW not to touch my HOE\nI like livin my own fuckin show", "image": "https://images.genius.com/7985ae9f777e769efe184aff8b763e1c.1000x1000x1.jpg"}], "artist": "Ol’ Dirty Bastard"}