{"songs": [{"title": "Bat Cave Radio Freestyle", "album": null, "year": "2008-10-30", "lyrics": "I tell em, I say\nOne yourself when 2 niggas run up with 3 gats\nA four, five, six shots, seven like eight claps\nDa nine milli throw ten shots where ya face at\nAnd the MAC 11 tucked in where da 12 gauge at\nWhen I was 13 had 14 grams of ajax\nTurned 15 start spitting 16s of straight crack\nBy 17, 18th street where I played that\n19 niggas on the corner with 20s and they strapped\nPlayin with my money like playin with my emotions\nFloatin off that water like I'm layin in da ocean\nRoastin, I make you disappear, hocus-pocus\nWe leave these suckas like they Jerry Rice, wide open\nIn da field to get real, ya block slow-motion\nAnd the bills rollin in just like a coasta\nGotta catch a nigga sleepin late night, stick em with the toaster\nMake him put it all in like he was playin poker\nCause I remember days, nights, I couldn't even think right\nNiggas gettin murked out I'm clutchin on that thing tight\nI wouldn't even blink like\nBlink once, blink twice\nCause that'd get ya life snatched\nFaster than a Tyson match\nPull up to the scene\nSo fresh, so clean\nIn a 7-4 pound, with the windows rolled down\nLike 20 on my neck, feel like the king, no crown\nI be Prada down enough and all my year be low down\nRed horse, red stripes\nRed porshe, red lights\nTell me stop cause I'm killin em\nGot chains like a millions\nLames they not feelin em, but tell em keep hatin\nPraying on my downfall, tell em keep waitin\nI be here, I be there\nWear them rocks on rocawear\nI'm so fly without no leer\nWhy would I lie? No I don't care\nI ride that fire without no fear, keep that choppa on deck\nIf a hater run up on me hit him up with no rat\nIt's big business, big bills, and big choppas\nCherry red Challenger, lookin like a lobster\nAll blacks D's on it, hoes holla\nSlidin through your area\nWhy is they comparin us?\nSerious, numbers on my check look like a serial\nAnd I still got the block jumpin, Shawn Marion\nI said a hater disrespect me then I'm airin em\nHe don't dig me where I from we just bury em\nWe count money, fuck bitches, go super hard\nMaybach, layed back, looking like a super star\nDiamonds on my neck, shining on em like a shooting star\n30 in the clip it's got me feeling like a shooting guard\nStop me, small but I'm cocky\n2 40s give a sucka 80 like Shockey\nPull up in the hood 4 door Mazeradi\nJewels on flashy like a paparazzi\nCopy, I be probably in the hills out in Cali\nIn the million dollar crib eatin on shrimp and brocolli\nWatch me, Pilladels Flyer, no hockey\nTell your chick to google me, she can dot com me\nShe ain't gotta chase me, just tell her myspace me\nAnd maybe she can find me, so I can get behind it\nHeard I got a deal so now she joe me like sloppy\nGot the goons on deck, they ride hard like Kowazakis\nThey ride hard, I said they ride hard\nI say we be the freshest\nJury be VVSes\nKated by DTSes\nLike Khalid shit we the best and\nI tell em hoes I don't wanna talk, just leave a message\nAutomatic stash boxes so they can see the weapons\nBut I be DC reppin, Grand Hustle the muscle\nNo me don't love these girls, I just love when I fuck em\nI just ah, no me don't love these girls, I just love when I fuck em\n\nLet me keep it clean, holdup what I say?\nI said, I said, said\nI got money on my mind, change on my membrane\nInsane, in the kitchen with it got the whip game\nSimilar to Gordon, throw it in the pyrex\nLike can I get your order? Ounces to the quarter\nOmelly pushed the rock, I pushed the haze power forward\n20s have a niggas floatin like he in the water\nSure ya, we got bundles for a Goya\nA bean my nigga, if you need I get it for ya\nThis sawyer on my hip, tinted in the rora\nBad lil chick with me, looking like Kimora\nLead that's me in the pocketbook to yora\nLong pretty hair ass juicy and Coutura\n20s, 50s, hundreds, nigga that's all up in my money grip\nWe chewin like it's double mint\nThat 40 got a double clip\nAutomatic magnum like a condom with a rubber grip\nAnd these suckas step up out of line and we gon fuck em up\nI hug that strip, on the block, with that Yao Ming\nThose oh-yous put them on a higher plain like Al Green\nNow I mean, ay ay, they hear when I talk\nGot that white girl and that green lady like Fairmount park\nAnd this nigga think he G, I bet he fear when I spark\nPut some hot shit in his tea, he be layin out, chalk\nWhere he at? There he go\nPull up on that nigga slow\nGot that ruga clip like rula shootin like a video\nAnd we be ridin, ridin, slippin, slidin\nAll through the city with that semi right beside him\nBallin like Jimmy, and that nigga try and try him\nWe catch em when they slippin, homicide em\nI said now they start and stop and frisk us, niggas gettin childish\nBut really they ain't stoppin shit, that's just gon get a cop in here\nWe're competent, common sense, cause niggas, they rock this shit\nFrom where they forever hate,you'll never get a compliment\nI'd rather do a 5 to 10, nigga fore I lose my life\nGo out in a blaze of glory, squezing with my trigga tight\nYoung loke, and gun smoke, and done choke, and nigga\nRaised by the rat's roaches, real youngen holdin coke\nState they gave my man life, Feds they gave my man 10\nMessin with this dirty game feel like I'm on a dead end\nLike damn where my nigga Rick\nDamn where my nigga Brick\nAs time flies I think about you, know you tired and sick of it\nThen they said my nigga snitched, I could neva see that\nTalkin that they got statements on him, hold let me read that\nBelieve that\nWas gettin high off of life, about to relapse\nGud gang, aka them Ladder boys, we back\n\nWe back\nI ain't playin\n\nI said\nI don't make it rain, I ain't rich\nI ain't got a milli, I ain't trynna chase a bitch\nYeah I got signed, but I ain't got them bricks\nAnd I still step up in the club feelin like I'm Mitt\nWe got Squally in the building, he be there strapped\nOmelly outside and he let out with the Mac\nMe I'm in the crowd, just chillin fallin back\nPeepin out the scene, I see a hater I react\nLike you don't want no problems\nWe come with them choppas\nThey call us the Ladder Boys cause we get it poppin\nWe don't do no robbin, all we do is grind\nHustle from the muscle nigga, save up every dime\nEverybody know I'm bout to blow like a bomb, boom\nPull up in the '96 Impala, vroom\nHammers in the stash box dirty, broom\nThe holster in the passenger, gansta, goon\nYeah I do my thang\nUh, I said, I said\nYeah I be on some shit, yeah I do my thang\n\nI ain't gon give em that, Imma let Raw give em that man\nI do my thang man, shout out to my boy Oskee\nMy boy Oskee, my boy Oskee\n\nHold on, hold up\nI said, they gave my nigga 20 years, man that wasn't even right\nGot him in the Hell hole, livin at the speed of light\nPrayin that the time fly by so he can see the light\nSee his kids meet a wife, all over a key of white\nBut why you think they take that time from you, cause you need it right?\nAnd you can't get it back, so how they givin people life?\nLike you gon live again, grow up be a kid again\nThat's why I never waste time, I cherish every minute in\nPray that God faithful though\nMan half that shit I make, I blow\nI don't even take it slow\nCause any given day could go\nAnd I could see my death date, feel my last breath take\nThat's why I go and get it now\nI be like shit wait\nDie young, and the bag don't even last that\nWhere the young niggas 16 and over die fast at\nI was made there, raised there but moved past that\nLivin at the speed of light, it looked like a flash back\nI don got money, went broke then got the cash back\nHad it I was cool though, lost it I got laughed at\nThat's why I never ever cherish nothin I can have back\nThankful for my life though, I wish I could stash that\nShit I'm just livin at the speed of light\nBallin hard to see the light\nBe here today, to cease tonight\nI just hope when God come arrest me that he read my rights, read my wrongs, ah\n\nRest in peace to Shotty too man.  Rest in peace all my boys man\nFree the whole State Road.  Man, when you get out here man, all my boys that's booked, man when you get out here do\n\nYour thing man\nJail ain't for nobody man. It's Meek Milli, I'm in the building, Bad K studio man, Flamerz\nAll day. Y'all want some more?\n\nI say, hold up I'm on my grind\nI hustle everyday\nAnd I won't 9 to 5 but you can get that 9 for 5\nWe got that ye, ay ay bae bae, come around my way\nEverything be a-okay\nEven quarters has some ozs niggas know we got that way\nBut ay ay ay\nI remember dog we used to be slaves\nNow we whip that white like it's Kuntakente\nAy, all we know is hustle get payed\nGrind from the muscle just to lay up in the shade\nCause I'm the man in my city\nAnd nobody fucking with me\nI be rollin through your hood ridin shotty with the semi\nThey be rollin on that good, I be poppin on that henny\nRidin tinted in the SR, tu with that hemi\nSee that bad chick? That's all me I be in it\nFrom the front and from the back\nI say this and she do that\nI step in, they like \"Who dat?\"\nThat's Meek Milli and them boys\nBrought them choppas in the building we be really making noise\nSaid we be really making noise\nWe brought them choppas in the building we be really making noise, boy!", "image": "https://images.genius.com/6929169de7116d41676151bdea5cc773.1000x1000x1.jpg"}], "artist": "Meek Mill"}