{"songs": [{"title": "Slow Jamz", "album": "Kamikaze", "year": "2003-12-02", "lyrics": "[Produced by Kanye West]\n\n[Intro]\nAre you going to be, say that you're gonna be\n\n[Hook: Jamie Foxx]\nShe say she want some Marvin Gaye, some Luther Vandross\nA little Anita, will definitely set this party off right\n(Are you gonna be, are you gonna be, are you gonna be\nAre you gonna be, are you gonna be, well well well well)\nShe say she want some Ready For The World, some New Edition\nSome Minnie Riperton, will definitely set this party off right\nYes it well, oh yes it will\n(Are you gonna be, are you gonna be, are you gonna be\nAre you gonna be, are you gonna be, well well well well)\n\n[Verse 1: Kanye West]\nYes it will, it definitely will! You know what I told her?\nI told her to \"Drive over in your new whip\nBring some friends you cool with\nI'mma bring the Cool Whip, then I want you to strip\nSee you is my new chick, so we get our grind on\nShe be grabbing, calling me Biggie, like Shyne home\nMan I swear she fine homes, why she always lying though?\nTelling me them diamonds, when she know they rhinestones\nShe got a light-skinned friend, look like Michael Jackson\nGot a dark-skinned friend, look like Michael Jackson\nI played Ready for the World,she was ready for some action\nMy dog said you ain't a freak, so you gotta prove my man wrong\nI'mma play this Vandross, you gon' take your pants off\nI'mma play this Gladys Knight, me and you gon' get right\n\n[Hook: Jamie Foxx]\nShe say she want some Marvin Gaye, some Luther Vandross\nA little Anita, will definitely set this party off right\n(Are you gonna be, are you gonna be, are you gonna be\nAre you gonna be, are you gonna be, well well well well)\nShe say she want some Ready For The World, some New Edition\nSome Minnie Riperton, will definitely set this party off right\nYes it well, oh yes it will\n(Are you gonna be, are you gonna be, are you gonna be\nAre you gonna be, are you gonna be, well well well well)\n\n[Interlude: Aisha Tyler & Kanye West]\nNow Kanye, I know I told you to slow it down, baby\nAnd it's good, it's all good, it's beautiful, it's beautiful\nBut now I need you to do it faster, baby\nCan you please? Do it faster baby, do it faster!\nDamn, baby; I can't do it that fast...\nBut I know somebody who can, Twista!\n\n[Verse 2: Twista]\nGot you looking at the gliss' on my hands and wrists\nWhile I'm laying back and smoking on my cannabis\nWhen it come to rocking the rhythm like Marvin and Luther\nI can tell you ain't no messin' with Kan-man and Twist\nWith a shot, and I be sipping Hennessy\nPlay some R&B while I smoke a B\nYou can't fuck with me, put that on a G\nAnd all is (Well well well well)\nCome with me and sip on some Evelyn Champagne\nYou ain't know Twista can work it like The Whispers?\nHit the stop light, movin' to some Ides\nHis rims still moving so I bump a little Spinners\nWhile I'm smoking on a B, dipping through the streets\nBumping R&B, and I got the heat on them 23's\nAnd I do it (Well well well well)\nWith my Earth in the Wind smokin' Fire\nLet me get your sheets wet listening to Keith Sweat\nPut you in a daze with Maze\nFulfilling her with every temptation, slow-jamming, having deep sex\nYou Ready for the World, girl? Come on go with me\nI'll touch you all over your body, baby don't say no to me\nAnd every note'll be controlling me\nI'm loving the way you be holding me when I be listening to Jodeci\nAnd when I come over and bend your ass\nYou be bumpin' Teddy Pendergrass\nI done hit it from the back to the melody of \"Roll It Slow\"\nNow I gotta go up in it fast, but I'mma finish last\nNo matter how much of a thug, you see\nI still spit it like its R&B, go to the club with me\nAnd with some Luther come on\nI hope you feelin' me and still gon' be in love with me, and I ride...\n\n[Hook: Jamie Foxx]\nShe say she want some Marvin Gaye, some Luther Vandross\nA little Anita, will definitely set this party off right\n(Are you gonna be, are you gonna be, are you gonna be\nAre you gonna be, are you gonna be, well well well well)\nShe say she want some Ready For The World, some New Edition\nSome Minnie Riperton, will definitely set this party off right\nYes it well, oh yes it will\n(Are you gonna be, are you gonna be, are you gonna be\nAre you gonna be, are you gonna be, well well well well)\n\n[Verse 3: Twista]\nBaby drop another slow jam\nAnd all us lovers, need to hold hands\nAnd if you ain't got no man, hop up in my Brougham\nI keep it pimping like an old man, you gots to roll with the plan\nCause after that, then I take it to the dome\nThen I got to bone, stay up in the zone\nGot to get you home, gotta run up on\nAnd I do it (well well well well)\nBaby drop another slow jam\nAnd all us lovers, need to hold hands\nAnd if you ain't got no man, hop up in my Brougham\nI keep it pimping like an old man, you gots to roll with the plan\nCause after that then I, take you to my home\nWe can get it on, disconnect the phone\nTrying to get you gone, I'mma make you moan\nAnd I'll do it (Well well well well)", "image": "https://images.genius.com/23d3da2fbbe4cdb1e2b2aafd6e611cd9.600x600x1.jpg"}], "artist": "Twista"}