{"songs": [{"title": "Nature of the Business", "album": "My Soul", "year": "1997-08-26", "lyrics": "Verse 1:\n*singing* It's the roll of the dice\nThat you can't afford to lose\nIt's the nature of the business\nIt's the smugglers who lose\n*rapping* I got a little proposition, homey, check it out, we gonna put it down\nCause you and I go way back, and I know you done been around\nThese peeps that I know done put me up on some shit\nNigga, we could all come up loc, we could all make grips\nNow I ain't talkin bout no bullshit ass flippin z's\nI'm talkin Trump type access, they comin off a gang of keys\nNow what exscuse you got to play?\nYou got a wife and baby on the way?\nWell, that makes it mo better\nWe gon work this shit together\nWe gonna stack enough loochie to get your girls gift from Gucci\nAnd send your baby to college and ain't no gettin caught\nCause we gon use the type of knowledge that they never tripped off of befo\nThey ain't even ready for this hellified shit we got in sto (That's right)\nAnd I done used the G to hook up that manpower\nShit have the okay to folks taught Pillsbury how to push flour\nNow all we gotta do is make sure this shit go through, partna (Right)\nNow call your crew, cause we got work to do\n*talking* It's a fifty-fifty chance that you can get stuck\nAnd then snake eyes are crafted, and we shit outta luck\n*singing* It's the roll of the dice\nThat you can't afford to lose\n*talking* But if we make this shit work the whole crew gon come up\nWith thousands in the Seiko's, Dane's, and fat pocketbooks\n*singing* It's the nature of the business\nIt's the smugglers who lose\n\nVerse 2:\n*rapping* Next level in the game, homey, it's time to get this shit movin\nWe went up fifty keys on ?speck? and now we got some shit to prove it (Right)\nWe got the contacts in Vegas that's where we go got our troops\nThey'll be the ones in the casino lines dressed in blue suits\nAnd afta  Shorty, Vic, and Spider done picked up the shit\nThey gon lay low a few days to make the trip look legit (That's right)\nBut, just in case them niggas get any fucked up ideas\nWe gon send Wino and Big Homie to watch our back with the gear (Right)\nAnd then them niggas gonna take the midnight train to Dallas (Dallas)\nWe got to hook up them baggage plans to Ras Kass, Misses Alice\nThe cool thing about her is that if she get caught\nIt's still all in the family so she ain't gonna sell a nigga out\n*talking*\nAight, then, maybe they should get a U-Haul pack that shit in a matress\n*rapping*\nNah, they best go Greyhound, it's still the same as motherfuckin taxes\nAnd all we gotta do is hold our breath about three more days\nAnd cross our fingers, and hope nobody get popped along the way\n*talking* You can make this quick lick and be set up for life\nBut if your ass get stuck, I hope it ain't your third strike\n*singing* It's the roll of the dice\nThat you can't afford to lose\n*talking* And them things you last expect, sometimes out there waitin\nBut I hope you understand if you caught then you ain't got shit to say\n*singing* It's the nature of the business\nIt's the smugglers who lose\nIt's the roll of the dice\nThat you can't afford to lose\nIt's the nature of the business\nIt's the smugglers who lose\n\nVerse 3:\n*talking* Everything is goin according to plan\nThis shit is on its way to the man, to the man\nSit next to the goddamned man (Right)\nBut there's one thing you should know\nThere's some bustas on the bus talkin loud and drinkin and actin the fool\nThat shit ain't cool (Say what?)\nNow, I don't want to have to switch this loc\nSo, send some bodies to the next stop to get this under control\n(They on they way)\nBut be aware that they all wearin navy uniforms\nAnd they got medals and patches and shit, they think that say Desert Storm\nAnd they got \"Gung Ho\" written all over they chest\nSo tell Lek Ratt, D-Dog, P.S. to wear they vest\nIt's gettin kinda cold out here so I'mma have to be gone\n*sirens and helicopters*\nWait, here that? Oh, I think somethin wrong *gunshots*\nWhat's Up?  Baby, what's goin on, man? What! What the fuck happenin?\nAw, shit, my nigga, I'mma have to face shit\nI think somebody set us up, there's feds all over the place\n*rapping* That's the name of the game, that's the way the game go\nSometimes you rise high, and sometimes you sink low\n*singing* It's the roll of the dice\nThat you can't afford to lose\n*rapping* If you make it back to the hood then I'll see you around\nBut if they got somebody watchin, then stay your ass outta town\n*singing* It's the nature of the business\nIt's the smugglers who lose\nIt's the roll of the dice\nThat you can't afford to lose\nIt's the nature of the business\nIt's the smugglers who lose\nIt's the roll of the dice\nThat you can't afford to lose", "image": "https://images.genius.com/8b2afc0b2ec12b84597cab495ffdf0e1.600x600x1.jpg"}], "artist": "Coolio"}