{"songs": [{"title": "Footsteps in the dark", "album": "#ThrowBackThursday", "year": null, "lyrics": "[Verse 1: Raekwon]\nCatch me in them fisherman hats, rocking cannons kid\nNew improved Nikes on, flying through Atlanta Kid\nLounging, piffery lit, look who we wit\nYeah Denzel, Samuel, Brett Farve, and Brad Pitt\nChilling in thou kid, 2-1 and thou and a suit case\nBet that now lets blow the blue base\nDef George Clooney and his goonies, wrapped up big\nPlay the left table the bitch with the wig\nI looked, thats my nigga\nShe was a crooked one, yeah thats my nigga\nShuffling cards bitches bras off niggas is card sharks\nThey Jakes, crooked ass hops in the mix\nYeah we posted up assassins is laughing\nNiggas in yellow Bentleys ninjas in front of the building\nThey from Cali p's gangster, chief eats\nThey're known to sweet beef then break out  lay low in the Aspens\n\n[Verse 2: The Isely Brothers]\nAre we really sure\nCan a love that lasted for so long still endure?\nDo I, really care? Hey, hey\nLet's talk about the distractions goin' on elsewhere\n\n[Chorus]\nI keep hearin' footsteps baby\nIn the dark, in the dark\nWhy? I keep hearin' footsteps baby\nIn the dark, in the dark\n\nMy mind drifts now and then\nLookin' down dark corridors and wonders what might have been\nSomething's up ahead\nHey, should I keep this same direction or go back instead?\n\n[Chorus]\nHoney, now lets stop walkin' around\nWhen there's love lost to be found\nAnd you know I still care, I still care\nWhat's the sense in goin' elsewhere?\n\nWho feels really sure?\nCan that feelin' guarantee your happiness shall endure?\nAnd do we, really care? Hey, hey\nLet's look at what's been happenin' and try to be more aware\n\n[Chorus]\nYeah, lets stop walkin' around\nWell when there's love lost, lost to be found\nHoney, you know I still care, I still care\nWhat's the sense in goin', goin' elsewhere?\n\nHoney, lets stop walkin' around and around and around\nWhen there's no love to be found\nBaby, you know, I still care, I still care\nWhat's the sense of goin', goin' elsewhere?", "image": "https://images.genius.com/f37ffb5db5ec4d6047bb34f74bdae6e0.500x500x1.jpg"}], "artist": "Raekwon"}