{"songs": [{"title": "Relax", "album": "The Real 4Fingaz", "year": "2009-11-16", "lyrics": "[Verse 1: YG]\nFirst off we gon do it like this just relax take it off\nLay down on yo back just relax I'm a stroke\nStroke yo body til it collapse just relax\nI got this girl, I got this girl\nI'm a take you to my world just relax\nJust listen to the beat and think of me just relax\nI'm a kill that pussy straight murder that shit\nAnd I'm a eat it eat it eat it then lick it til it slaps aye\nI'm a freak lil mama just call me daddy\nAnd I promise to God I'm a make you happy\nAnd she don't speak no spanish but she call me papi call me papi\nAnd I promise to God...\n\n[Hook: Ty Dolla $ign]\nGirl when I lay yo body down you better relax. Girl when I hit it from the back. Just relax\nGirl when you climb up on top (baby baby) ooh you know just tryna relax\nSo slow down, slow down, slow down, slow down, slow down...\n\n[Verse 2: Ty Dolla $ign]\nOh oh Girl I swear if you put that pussy on me I'll lose my muthafuckin mind\nI can't get my thoughts together and I'm lost up in there\nAnd I can't even remember my name until you scream it scream it scream it\nAnd when I eat it eat it eat it got you goin crazy crazy crazy\nNow you beggin for me to put it back in...\nI'm a freak lil mama just call me daddy\nAnd I promise to God that I'm a make you happy\nAnd she don't speak no spanish but she call me papi\n\n[Hook: Ty Dolla $ign]\nCuz when I lay that body down (girl when I lay yo body down) ooh you better relax (relax)\nWhen I hit it from the back just relax. Ooh\nGirl when you climb up on top (baby baby) ooh you know just tryna relax\nSo slow down, slow down, slow down, slow down, slow down...\n\n[Verse 3: Ty Dolla $ign]\nCus I'm a freak lil mama just call me daddy\nAnd I promise to God I'm a make you happy (aye)\nAnd she don't speak no spanish but she call me papi\nAnd I promise to God I'm a make you happy (aye)\nJust relax girl, Just relax girl. Stop trippin girl and just relax aye", "image": "https://images.genius.com/4b9687351df12fdb4ae5aec4eab9ff74.480x480x1.jpg"}], "artist": "YG"}