{"songs": [{"title": "The Ghetto", "album": "The Documentary 2.5", "year": "2015-10-16", "lyrics": "[Intro: Woman]\nStay with me, please, don't leave me, baby\nI love you, stay with me, please, baby\nSomeone's coming, please, please\n\n[Chorus: will.i.am]\nIt seems like everywhere I go, everybody’s in a struggle\nOh, the whole world is a ghetto\nOh, the whole world is a ghetto\nThe ghetto, the ghetto, the ghetto\nThe, the, the, the\n\n[Verse 1: Nas]\nIt be jam-packed in front of the stoops in Siberia\nSame way they are in the middle of Nigeria\nEvery part of the whole world, there's an area\nThat, if you're poor, another day alive is a miracle\nThe blocks in Watts got crooked cops that frame the innocent\nNo different from Flint, Michigan\nLiving in the D, checking in with the pimps and them\nIt's similar to O-Town, in the Southern Peninsula\nPretty city, skyscrapers will fool you, look through to\nInner cities the rich won't move to\nThe nice parts, they well-protected by a vanguard\nThe opposite of how these concentration camps are\nLow-income housing, it dwells murderers\nBut children don’t qualify for health services\nThe bourgeois act like they don’t see starvations\nLike they spraying Estée Lauder on sanitation\n\n[Chorus: will.i.am]\nIt seems like everywhere I go, everybody’s in a struggle\nOh, the whole world is a ghetto\nOh, the whole world is a ghetto\nThe ghetto, the ghetto, the ghetto\nThe, the, the, the\n\n[Verse 2: The Game]\nStreetlights come on, cop cars' lights flicker\nThey smoke us like cigarettes, need a light, nigga?\nUsed to chastise or string us up to spite niggas\nWar to fight for the culture, instead we eaten by vultures\nThey mix us like mimosas, hang us on wanted posters\nAsked for license and registration with they gun out the holster\nSome of us guilty, some of us not, some of us filthy rich\nOthers just watch us niggas drive up the block\nWe think we keeping it one hundred coming back to the hood\nThey think we flossin' money, so they pull a ratchet: what's good?\nIt happens in Compton, happens in Queens, happened to Big L\nHappened to Chinx and 2Pac in that passenger's seat\nSometimes it's internal, happens to you before you happen to bleed\nWhat's beef? Cops killing niggas dead in the streets\nSo before we look outside, we gotta look within\nCause, now, we the dinosaurs, I think the world 'bout to end\n\n[Chorus: will.i.am]\nIt seems like everywhere I go, everybody’s in a struggle\nOh, the whole world is a ghetto\nOh, the whole world is a ghetto\nThe ghetto, the ghetto, the ghetto\nThe, the, the, the\n\n[Verse 3: Nas]\nI'm from the project buildings, high stories\nMy stories from violence to glory\nDog-eat-dog world, gory\nIn the gutter, brother despise brother\nThrowing threats at each other\nBroken bottles and bar fights with box cutters\nAlcoholics, narcotics, organized\nFamilies sleep from a gas stove, burned alive\nThey bagging up drugs with plastic gloves\nOn his way to the top with his cash, he shrugs\nKidnappers, degenerate thieves and gamblers\nStealing, panhandlers, wrapping grams up\nRubber bands on they Grams, what?\nPlaying cards and they bored\nMembers of gangs, living by and dying by the sword\nBlock parties, fools stamp debit cards\nYour hood ain't no different from ours\nWe share the same dreams, same money\nSame clothes and cars, instead we get the same jail bars\n\n[Bridge: Nas (will.i.am)]\nThe world's a ghetto, the world's a ghetto\nThe world's a ghetto (Ghetto)\nThe world's a ghetto\n\n[Verse 4: The Game]\nMe and God's son, jumping out of project buildings in black parachutes\nBoth classic, both ride through the hood in a pair of coupes\nFlow sick, mix the Henny with the Theraflu\nHe told me I was ill at that Houston's, nigga, where was you?\nHip-hop critics, sit the fuck down, get a chair or two\nI ain't tryna kick knowledge, just a pair of graphic parables\nGrew up, spent the whole middle school in the same pair of shoes\nMe and my brother sharing shoes, my childhood was terrible\nThat's why I spend nights on the rooftop, smoking medical\nYou got a minute, my nigga? Let me break down the variables\nAdapted to my surroundings, flow better than I used to\nMomma, this for us buyers, for the days I wore FUBU\nHaving beaucoup dreams, deuce-deuce in jeans, my nigga\nNow, I'ma end your career in two sixteens, my niggas\nIf he the God's son, then I must be the prophet\nAnd all this \"King of L.A.\" shit, you niggas need to stop it\n(The ghetto)\n\n[Chorus: will.i.am]\nIt seems like everywhere I go, everybody’s in a struggle\nOh, the whole world is a ghetto\nOh, the whole world is a ghetto\nThe ghetto, the ghetto, the ghetto\nThe, the, the, the\n\n[Outro: Anderson .Paak]\nUh, it's a ghetto\nUh, it's a ghetto\nIt's a ghetto\n(You gonna take that top note or what, man?\nWe gonna do this harmony or we gonna do it right\nThis motherfucker Chuck gonna come here swinging\nHe's gonna come here drunk off that shit\nCome on, now, let's get it right, tighten up, nigga\nHey, one, two, three, four)\nIt's a ghetto, it's a ghetto\nIt's a ghetto, it's a ghetto\nOne more time\nIt's a ghetto, yeah\nIt's a ghetto, it's a ghetto\nHey, it's a ghetto\n(Alright, alright, alright, that sound good\nBut we need to work on this other one, now\nLet's get it tight\nCome on, Lyrica, JC, Pharaoh\nLet's make this shit happen man, come on)\nOne, two, three, four\nOh, oh, oh, took your love away\nI wanna know\n\n[Produced by will.i.am]", "image": "https://images.genius.com/72a00bceccb1bffdad5f44c0094145dd.1000x1000x1.jpg"}], "artist": "The Game"}