{"songs": [{"title": "Tiger Style Crane", "album": "Redman Presents... Reggie", "year": "2010-12-07", "lyrics": "[Intro]\nYeah! Ow! Turn me up some more Just\nTurn me, turn the music up some more\nGillahouse! We 'gon get it in nigga\n\n[Verse One]\nYo! Crack the Remy Martin, for niggas pumpin weed by the mini market\nBring it when you see me park it\nI think Big like Diddy office\nI fuck a ho with a baseball cap on like Mr. Marcus\nYeah! My Family Feud like Richard Dawson\nThe survey said I'm hidin right in your apartment\nIt's Brick City, right beside New York\nYeah the streets is watchin even mimes wanna talk\nI run up on the DJ, smack 'em on camera\nMakin sure I get my wax on like Daniel son\nFeel my Genuine Draft not Miller\nI could walk up in the church and start a mosh pit up\nYeah! I Bring The Pain, eleventh member of the Wu-Tang\nMy flow tigerstyle crane\nI'm back nigga, ridin that gravy train\nThe rap criminal my Artifacts hard to Tame\nBitch wanna complain, no use to barkin\nCause we can go neck for neck like Pam and Martin\nGet smoked like a carton, of Newport's nigga\nOn my New Jersey shit, and New York nigga\nYeah!!!\n\n[Interlude]\nGillahouse! Gillahouse in the motherfuckin buildin y'all\nBeen a long time since east coast had this motherfuckin reign!!!\nGillahouse!!! Gi-Gi-Gi-Gi-Gi-Gi-Gi-Gillahouse!!\n\n[Verse Two]\nYo! Yo! Check the nigga flow\nI knock out the Mike like Buster Douglas bitch leave a nigga broke\nAnd Jigga know when I clutch the pen\nIt's fuck them hens I put them paragraphs in a bigger foe\nFuck tryin to take a pack of protein\nCause when I brawl I'm a stay strapped like Bokeem\nBlow smoke rings in the meetin\nIf I ain't gettin half of what I sell you ain't eatin neither\nA leader won't take no shorts I know better\nIt's D-O-C M-P-V for Vendetta\nI'm always on point never skip or slip\nMy bitch stay tryin to kill me like Mrs. Smith\nIf I carry two cannons, no time to kill out\nI bust out the side of my jeans like Bruce Banner\nMy dogs do it on camera, and to them\nI'm big brother almighty like Gamma Phi Gamma\nI roll like a rider should\nAnd when the chick blow Doc she be famous like Monica\nHardcore in the blood get the best in line\nPut the iron to your watch cause I'm pressed for time\nNIGGA!!!\n\n[Outro]\nYeah! Gillahouse niggas!!! Y'all already know what it motherfuckin is!\nGillahouse!!! What's happenin nigga! Gi-Gi-Gi-Gi-Gi-Gi-Gi-Gillahouse!!\nHey Chris you already know what's happenin nigga! Gillahouse\nYeah!", "image": "https://images.genius.com/4d4f1e8f8a259cccb95855c51037a514.600x600x1.jpg"}], "artist": "Redman"}