{"songs": [{"title": "Love That Bitch (Remastered)", "album": null, "year": null, "lyrics": "[Intro - DMX:]\nHey you see\nThis the shit, I be talkin 'bout, know'msayin?\nWhen you don't know, what the fuck is really good know'msayin?\nYou feel one way, but you know you gotta walk the other way\n\n[Chorus - DMX:]\nAiyyo dawg, listen I love that bitch\nCause of some bullshit I don't trust that bitch\nCause of the kid I'm stuck with that bitch\nBut my niggas like, \"Yo FUCK THAT BITCH!\"\n[DMX:]\nAiyyo it's like this man, shorty got a kid\nOn some drunk after the club shit, we done did\nAll week bitches got me hittin the Remy, full throttle\nBy the time I finish the bottle them bitches is models\nLet me break it down like this, here's what happened\nI was y'know, tryin to fuck and, once I get to rappin\nWe at the crib, bitches leave they panties on the doorknob\nPuff somethin, ten minutes later we on the floor hard\nAH! AH! Huffin and puffin\nShe screamed it more cause she can't get enough of the lovin\nNow, look where it got us, nine months later\nBaby is born and I'm realizin I hate her\n\n[Chorus x2]\n[DMX:]\n\"YOU DON'T GOTTA CHILL WITH HER!\" Man, they don't know\nI'm still with her cause I'm tryin to see the baby grow\nThat's just the pops in me, see I ain't never had one\nAnd now that I am a father I don't wanna be a bad one\nAs shorty get older, how do I explain\nThat I really can't stand his mother? She a pain!\nAnd I never really liked the bitch, out the gate\nIt was those two bottles of Remy, plus it was gettin late\nNow I ain't say I ain't had nothin to do or to blame\nMan I'm the Dog, bitches stay screamin my name\nShe knew it was a fuck thing, she ain't my wife\nSo why I gotta pay for her for the rest of my life?\n\n[Chorus x2]\n[DMX:]\nChild support? You're killin me! But it gets worse\nMoms got a thirst that'll get her put in a hearse\nSome say it's like a curse, the way she got me locked down\nIt feel like I'm trapped and I'm tryin to get out now\nFrom the beginnin, shit was cool\nCheck it, a nigga was hungry and this bitch was food\nAnd I, wanted to eat 'til the Dog got full\nCause I knew how I felt and the things that I would do\nBust it! From the beginnin you had my mind goin\nLook forward to seein you every time knowin\nCouldn't see shit cause, love was blind\nFuck it, that liquor is what gets you blind\nREAL TALK!\n\n[Chorus x2]\n[Jannyce (DMX):]\nI told you so (yo dawg, listen I love that bitch)\nNot to fool with hoes (but I don't trust that bitch)\nCause that's the way it goes (but I'm stuck with that bitch)\nI told you so (my niggas like, \"Man fuck that bitch\")\nI told you so (aiyyo dawg, listen I love that bitch)\nNot to fool with hoes (but I don't trust that bitch)\nCause that's the way it goes (but here I'm stuck with that bitch)\nI told you so (now niggas like, \"Man fuck that bitch\")\n[Outro - DMX:]\nBitch! Fuckin bitch, bitch! Fuckin bitch, stupid bitch\nStanky bitch, fuckin bitch! Bitch, punk ass bitch\nUgly bitch, bitch, fuckin nerves hate you bitch\nFuck that bitch, bitch!", "image": "https://images.genius.com/1bcf43b1cc0f34db6cd70e1a63c8b84c.464x464x1.jpg"}], "artist": "DMX"}