{"songs": [{"title": "What If", "album": "The Last Kiss", "year": "2009-04-07", "lyrics": "[Produced By Chophouze]\n\n[Jadakiss]\nYo, take a second\nWhat if we could rewind the hood?\nBetter yet, what if the LOX woulda signed with Suge?\nWhat if Puffy never signed us?\nWhat if Oprah made them comments like Imus?\nWhat if you designed this?\nThought like I did, said it like this\nWhat if Peyton was fightin' dogs instead of Mike Vick?\nWhat if Arnold woulda just let Tookie get Life?\nWhat if BIG missed the party?\nWhat if Pac missed the fight?\nWhat if you was caged in?\nWhat would you change then?\nWhat if there was no Rockefeller law for made men?\nWhat if the hate ran through me?\nAnd what if Portland woulda drafted Jordan instead of Sam Bowie?\nWhat if you really had to be nice to get a deal?\nWhat if all of these rappers ice was really real?\nWhat if I hit you wit the razor from cheek to chin?\nWhat if Mike Jackson never woulda bleached his skin?\n\n(Hook) Jadakiss 2x\nWhat if you neva knew things that you needed to know?\nWhat if you neva been places you needed to go?\nWhat if you get there and learn them as you go?\nWhat if is the question, can I ask them once more?\n\n[Jadakiss]\nWhat if the pain went away?\nWhat if you changed in a day?\nWhat if you could eliminate all the games people played?\nWhat if Shyne beat the case?\nWhat if Diddy did a dime flat?\nWhat if Nelson Mandela could give his time back?\nWhat if Malcolm was silent?\nWhat if Martin was violent?\nWhat if you could really sneak a Uzi on the Island?\nYeah, what if I made you kiss the nina?\nWhat if a brick was only just a misdemeanor?\nWhat if Manhattan was hit by Hurricane Katrina?\nWhat if a Black man was the one controllin' FEMA?\nWhat if we ain't never let emotions come between us?\nWhat if the last time we rode somebody seen us?\n\n(Hook) Jadakiss 2x\n\n[Nas]\nYo, I flow calm but don't push\nWhat if Saddam hung Bush?\nWhat if 'One Mic' was called one hook?\nWhat if the Bridge never showed me how to hold a weapon?\nWhat if I ran up in that sick chick with no protection?\nWhat if I never wore an Army jacket?\nCarhartt to match it, unlaced Timbs\nThe hood on my first album cover under plastic\nWhat if I was another corny rapper?\nWhat if I went instead of Notorious?\nWho would tell my story after?\nWhat if I love less and lust more?\nIf Obama was on Rushmore\nWould Ali give Tyson a bust jaw?\nWhat if I never glared out that project window?\nWould neva be scared for the life of me and my kinfolk\nWhat if that gun pin broke?\nI would never laid back in the Enzo, all red\nWhat if real niggas was all dead?\nWhat if Hilary and them was Reptilian?\nAnd 2012 was the end of men and all world civilians?\n\n(Hook) Jadakiss 2x", "image": "https://images.genius.com/74f6cb8e37420dc73fd4019537e3cbd1.953x953x1.jpg"}], "artist": "Jadakiss"}