{"songs": [{"title": "Everyday Struggle", "album": "Ready to Die", "year": "1994-09-13", "lyrics": "[Chorus]\nI don't wanna live no more\nSometimes I hear death knockin' at my front door\nI'm livin' every day like a hustle, another drug to juggle\nAnother day, another struggle (Right)\nI don't wanna live no more\nSometimes I hear death knockin' at my front door\nI'm livin' every day like a hustle, another drug to juggle\nAnother day, another struggle (Right)\n\n[Verse 1]\nI know how it feel to wake up fucked up\nPockets broke as hell, another rock to sell\nPeople look at you like you's the user\nSellin' drugs to all the losers, mad buddha abuser\nBut they don't know about your stress-filled day\nBaby on the way, mad bills to pay\nThat's why you drink Tanqueray, so you can reminisce\nAnd wish you wasn't livin' so devilish, shit\nI remember I was just like you\nSmokin' blunts with my crew, flippin' over 62's\n'Cause G-E-D wasn't B-I-G\nI got P-A-I-D, that's why my moms hate me\nShe was forced to kick me out, no doubt\nThen I figured out nicks went for 20s down South\nPacked up my tools for my raw power move\nGlock 19 for casket and flower moves\nFor chumps tryin' to stop my flow\nAnd what they don't know will show on the autopsy\nWent to see Papi to cop me a brick\nAsked for some consignment, he wasn't tryin' to hear it\nSmokin' mad Newports 'cause I'm due in court\nFor an assault that I caught in Bridgeport, New York\nCatch me if you can like the Gingerbread Man\nYou better have your gat in hand, 'cause man\n\n[Chorus]\nI don't wanna live no more\nSometimes I hear death knockin' at my front door\nI'm livin' every day like a hustle, another drug to juggle\nAnother day, another struggle (Right)\nI don't wanna live no more\nSometimes I hear death knockin' at my front door\nI'm livin' every day like a hustle, another drug to juggle\nAnother day, another struggle (Right)\n\n[Verse 2]\nI had the master plan, I'm in the caravan on my way to Maryland\nWith my man Two-TECs to take over this projects\nThey call him Two-TECs, he tote two TECs\nAnd when he start to bust, he like to ask, \"Who's next?\"\nI got my honey on the Amtrak with the crack\nIn the crack of her ass, two pounds of hash in the stash\nI wait for hon to make some quick cash\nI told her she could be lieutenant, bitch got gassed\nAt last, I'm literally loungin', black\nSittin' back, countin' double digit thousand stacks\nHad to re-up, see what's up with my peeps\nToyota deal-athon had it cheap on the Jeeps\nSee who got smoked, what rumors was spread\nLast I heard I was dead, with six to the head\nThen I got the phone call, it couldn't hit me harder\nWe got infiltrated, like Nino at the Carter\nHeard TEC got murdered in a town I never heard of\nBy some bitch named Alberta over nickel-plated burners\nAnd my bitch swear to God she won't snitch\nI told her when she hit the bricks I'll make the hooker rich\nConspiracy, she'll be home in three\nUntil then I looks out for the whole family\nA true G, that's me, blowin' like a bubble\nIn the everyday struggle\n\n[Chorus]\nI don't wanna live no more\nSometimes I hear death knockin' at my front door\nI'm livin' every day like a hustle, another drug to juggle\nAnother day, another struggle (Right)\nI don't wanna live no more\nSometimes I hear death knockin' at my front door\nI'm livin' every day like a hustle, another drug to juggle\nAnother day, another struggle (Right)\n\n[Verse 3]\nI'm seein' body after body and our mayor Giuliani\nAin't tryin' to see no black man turn to John Gotti\nMy daughter use a potty so she's older now\nEducated street knowledge, I'ma mold her now\nTrick a little dough buyin' young girls fringes\nDealin' with the dope fiend binges, seein' syringes\nIn the veins, hard to explain how I maintain\nThe crack smoke make my brain feel so strange\nBreakin' days on the set, no sweat\nDrunk off Moët, can't bag yet because it's still wet\nBut when that dry, baggin' five at a time\nI can clock about nine on the check cashin' line\nI had the first and the third, rehearse, that's my word\nThick in the game, D's knew my first name\nShould I quit? Shit no, even though they had me scared\nYo, they got a eight, I got a TEC with air holes\n\n[Interlude: The Notorious B.I.G. & Puff Daddy]\nAnd that's just how the shit go in the struggle, motherfucker\nHah, come on, what you say?\n\n[Chorus]\nI don't wanna live no more\nSometimes I hear death knockin' at my front door\nI'm livin' every day like a hustle, another drug to juggle\nAnother day, another struggle (Right)\nI don't wanna live no more\nSometimes I hear death knockin' at my front door\nI'm livin' every day like a hustle, another drug to juggle\nAnother day, another struggle (Right)\nI don't wanna live no more\nSometimes I hear death knockin' at my front door\nI'm livin' every day like a hustle, another drug to juggle\nAnother day, another struggle (Right)\nI don't wanna live no more\nSometimes I hear death knockin' at my front door\nI'm livin' every day like a hustle, another drug to juggle\nAnother day, another struggle (Right)\n\n[Outro: The Notorious B.I.G. & Puff Daddy]\nJunior M.A.F.I.A. right\nYeah, rock on, woo!\nBiggie Smalls, right\nJunior M.A.F.I.A", "image": "https://images.genius.com/e6cce6ad5c26175653cd5e5590b6e235.1000x1000x1.jpg"}], "artist": "The Notorious B.I.G."}