{"songs": [{"title": "I Can, I Can", "album": "The Wood (Music From and Inspired by the Motion Picture)", "year": null, "lyrics": "Uh, Ruff Ryderz, DMX, Swizz Beatz\n\n[Verse 1]\nI be, I be that dog that gots to flow\nThat's why, that's why baby I gots to blow\nAnd you, and you know it's straight from the gutter\nBecause, because it's gettin darker than a mother\nSlow down, slow down partner you movin too quick\nOh now, oh now gotcha, your crew and them sick\nWhat now, what now nigga, you feelin this shit?\nBut how, but how is this nigga killin this shit\nDon't think, don't think that it couldn't happen again\nDon't blink, don't blink cuz I put a (?) in your chin\nThen what, then what niggas is gonna see you dead\nFor what, for what over some shit a bitch said\nBut why, but why did your life mean so liitle?\nI tried, I tried but you got me caught up in the middle\nThis is, this is what it all comes down to\nI did, I did what a nigga had to do, come on\n\n[Hook]\nDon't worry 'bout me\nCuz I'm a be the dog that I am, you know, D\nThe type of nigga that y'all niggas love when you see\nSo y'all, don't worry bout me, ya hear me?\n\n[Verse 2]\nWhat's up, what's up with that nigga they call D?\nI am, I am what niggas is tryin to be\nAnd will, and will continue to do my thing\nThey love, they love all that dark shit that I bring\nKnow why, know why? Cuz I keep it realer than you\nYou can't, you can't cuz of all the shit that you do\nYou know, you know just what I'm talkin about\nYou asked, you asked nothin bout runnin your mouth\nA bitch, a bitch what you thought niggas couldn't tell?\nYou flipped, you flipped after two days in a cell\nGood thing, good thing I knew what was on your mind\nYou sing, you sing but you still gon do your time\nNo bail, no bail cuz they don't believe your story\nOh well, oh well guess you gon do that forty\nI'm here, I'm here still gettin platinum plaques\nYou there, you there still tryin to watch your back\n\n[Hook] X 4", "image": "https://images.genius.com/93d9d3e9f3be0f40a137f75a59c0534e.498x498x1.jpg"}], "artist": "DMX"}