{"songs": [{"title": "Kim", "album": "The Marshall Mathers LP", "year": "2000-05-23", "lyrics": "[Intro: Eminem & Kim]\nAw, look at daddy's baby girl\nThat's daddy's baby, little sleepy head\nYesterday I changed your diaper\nWiped you and powdered you\nHow did you get so big?\nCan't believe it, now you're two\nBaby, you're so precious, daddy's so proud of you\nSit down, bitch! You move again, I'll beat the shit out of you! (Okay!)\n\n[Verse 1: Eminem & Kim]\nDon't make me wake this baby!\nShe don't need to see what I'm 'bout to do!\nQuit crying, bitch! Why do you always make me shout at you?!\nHow could you just leave me and love him out the blue?!\nOh, what's the matter, Kim? Am I too loud for you?\nToo bad, bitch! You're gonna finally hear me out this time!\nAt first I'm like, \"Aight, you wanna throw me out, that's fine!\"\nBut not for him to take my place, are you out your mind?!\nThis couch, this TV, this whole house is mine!\nHow could you let him sleep in our bed?! Look it, Kim!\nLook at your husband now! (No!) I said look at him!\nHe ain't so hot now, is he, little punk?!\n(Why are you doing this?!) Shut the fuck up! (You're drunk!)\n(You're never gonna get away with this!) You think I give a fuck?!\nC'mon! We're going for a ride, bitch! (No!) Sit up front!\n(We can't just leave Hailie alone, what if she wakes up?)\nWe'll be right back — well, I will, you'll be in the trunk\n\n[Chorus: Eminem]\nSo long, bitch, you did me so wrong\nI don't wanna go on\nLiving in this world without you\nSo long, bitch, you did me so wrong\nI don't wanna go on\nLiving in this world without you\n\n[Verse 2: Eminem & Kim]\nYou really fucked me, Kim, you really did a number on me!\nNever knew me cheating on you would come back to haunt me\nBut we was kids then, Kim, I was only eighteen\nThat was years ago, I thought we wiped the slate clean\nThat's fucked up! (I love you!) Oh God, my brain is racin'\n(I love you!) What are you doing? Change the station!\nI hate this song! Does this look like a big joke? (No!)\nThere's a [four]-year-old little [boy]\nLaying dead with a slit throat in your living room!\nHa-ha! What, you think I'm kiddin' you?!\nYou loved him, didn't you? (No!)\nBullshit, you bitch! Don't fucking lie to me!\nWhat the fuck's this guy's problem on the side of me?\nFuck you, asshole! Yeah, bite me!\nKim? Kim! Why don't you like me?\nYou think I'm ugly, don'tchu? (It's not that!) No, you think I'm ugly\n(Baby!) Get the fuck away from me! Don't touch me!\nI hate you! I hate you! I swear to God, I hate you!\nOh my God, I love you! How the fuck could you do this to me?!\n(I'm sorry!) How the fuck could you do this to me?!\n\n[Chorus: Eminem]\nSo long, bitch, you did me so wrong\nI don't wanna go on\nLiving in this world without you\nSo long, bitch, you did me so wrong\nI don't wanna go on\nLiving in this world without you\n\n[Verse 3: Eminem & Kim]\nCome on, get out! (I can't! I'm scared!)\nI said get out, bitch! (Let go of my hair! Please don't do this, baby! Please! I love you! Look, we can just take Hailie and leave!)\nFuck you!\nYou did this to us! You did it! It's your fault!\n\"Oh my God, I'm crackin' up\" Get a grip, Marshall!\nHey, remember the time we went to Brian's party\nAnd you were, like, so drunk that you threw up all over Archie?\nThat was funny, wasn't it? (Yes)\nThat was funny, wasn't it?! (Yes!)\nSee, it all makes sense, doesn't it?\nYou and your husband have a fight, one of you tries to grab a knife\nAnd during the struggle he accidentally gets his Adam's apple sliced (No!)\nAnd while this is going on, his son just woke up\nAnd he walks in, she panics, and he gets his throat cut\n(Oh my God!)  So now they both dead\nAnd you slash your own throat\nSo now it's double homicide and suicide with no note\nI shoulda known better when you started to act weird\nWe coulda— hey, where you going? Get back here!\nYou can't run from me, Kim! It's just us, nobody else\nYou're only making this harder on yourself!\nHa-ha, gotcha! Go ahead, yell!\nHere, I'll scream with you, \"Ah! Somebody help!\"\nDon't you get it, bitch? No one can hear you!\nNow shut the fuck up, and get what's comin' to you!\nYou were supposed to love me!\nNow bleed, bitch, bleed! Bleed, bitch, bleed! Bleed!\n\n[Chorus: Eminem]\nSo long, bitch, you did me so wrong\nI don't wanna go on\nLiving in this world without you\nSo long, bitch, you did me so wrong\nI don't wanna go on\nLiving in this world without you", "image": "https://images.genius.com/e7f2305258d668431f8e250a41f3459f.1000x1000x1.png"}], "artist": "Eminem"}