{"songs": [{"title": "Long Time Part 2", "album": "10 Day", "year": "2012-04-03", "lyrics": "[Produced by Peter Cottontale and THEMpeople]\n\n[Verse 1]\nI wonder if Gladys smiles when angels bring my name up\nOr change language and subject change up\nHer boy's a long way from red dolls and green rangers\nThings ain't been the same since Ms. Patterson called me famous\nI saw your reflection in a toilet full of vomit water\nYou don't think I felt your hand on my head yelling, \"Call his father\"?\nBut people don't hear ghost, so how they gon' play me?\nMoney saved me, so I'ma do the same thing\nYou droppin' pounds, gettin' small on some sick shit\nLike how you got the drive but don't know how to use a stick shift?\nYou better not miss this, overdose dope and mix this\nLet your throat close with a boatload of dope quotes within it\n\n[Chorus]\nLong time now since I seen you smile\nLong time, long time now since I seen you smile\nAnd it's been a long time, long time now\nSince I seen you smile\n\n[Verse 2]\nDropping tapes 'til I lost the count\nCoughing out blood\nDropping weight like I lost an ounce\nThrowing words and tossing nouns\nNY traveling, I'm Boston bound, bossing 'round homies\nAnd talking down to shorties while I'm jotting down\nNotes to spit to Harlem crowds\nSurfing through the Harlem crowds\nAt the crib, I'm falling down\nI'm on the floor, crawling 'round\nI'm calling out to God, \"You're little angel's falling down\nSave me from my darkened cloud\nReach your hands and arms around\"\n\n[Chorus]\nLong time, long time now, since I seen your smile\nWe miss you\n\n[Verse 3]\n10 day\nIt's been a really, really long time, long time\nSince a goof-ass nigga done tried me\nLabel niggas wanna sign me\nAnd lame ol' nigga wanna buy me\nFood and weed and drink and shit\nJust as long as you inkin' shit\nSometimes I can't pay for food\n'Cause sometimes I can't think of shit\nWhere's your head at? Where's your head at?\nSinging my shit like you just said that\nWanging my shit like, \"Where'd you hear that?\"\nYoung-ass nigga, where you headed? Long time to get famous\nLife's whatever you make it, just thank God that we made it", "image": "https://images.genius.com/04c687414ea567ebf44f05a92c3e86ff.1000x1000x1.jpg"}], "artist": "Chance the Rapper"}