{"songs": [{"title": "Nothing Like Home", "album": "Infamy", "year": "2001-12-11", "lyrics": "(Prodigy talkin')\n\nYeah man..you know...2002 man...approachin' 2003 man...where we takin'\nThis man?...where we headed for the future man...whats the resolution?\n\nVerse 1: (Prodigy)\n\nWealth, health, and happiness nigga\nKeep me from runnin' 'round clappin' these niggas\nSometimes you gotta just handle your business\nFuck it, it's on me, rounds of shots for niggas\nPunk, I wake up everyday to cathedral ceilings\nJumpin' out my bed, wall to wall marble and pillars\nLivin' like the pharaoah Tut, I'm blessed with life\nSo I breathe deep and give praise to the most high\nThen I, get fresh for a new day\nI eat broccoli for breakfast and smoke my trees\nTurn on the flat screen to C-Span\nSee the elite strength, attorney general slowly gettin' bills passed\nProphecies comin' to pass\nWe gotta survive this shit dun, it's nothin' to laugh at\nI hops in the V, grabs the heat and I stash that\nI'm in tune with Doc, Pac, and Huey, it's a rap\n\nChorus (both)\n\nI traveled the World, and been alot of places\nBelieve me dog, ain't nothin' like home\nAnd if you want somethin' done, you gotta do it yourself, you got drama?\nWho's gonna clap that chrome?\nNobody like you, somebody like me\nWhen death I'm ready for it in Threes\nAnd me off point? c'mon now nigga please\nI'm paranoid, you know I'm burnin' those trees\n\nVerse 2: (Havoc)\n\nSaw alot of niggas die, some niggas survived\nAnd those that did did it by the skin of their hide\nDodgin' that long ride, the four-fifth aimed at 'em\nAnd knew to fall back when them slugs came at 'em\nOn the real, for me to be here tellin' ya'll this\nIs like dice, then I rolled that Four-Five-Six\nAnd never lost ever since, though I took that big pinch\nMy Brother passed away, 24/7 I was bent\nDrunk in my pain, alot of friends went and then came\nAnd those that stayed understood a nigga pain\nAnd for a niggas problems had noone to point the blame\nI was my own worst enemy goin' against the grain\nSomewhere along the line them pieces had to get grabbed\nAll this money plus family, shit wasn't that bad\nAll you little shorties runnin' 'round like shits sweet\nJust remember these words from the M-O-double-B\n\nChorus -\n\nVerse 3: (Littles)\n\nI kiss my finger, cross my heart, I'mma make it out these dark days\nWhether together or we part ways\nI got a promise to that boy tatted on my arm\nThree strong, man, the heat's still lukewarm\nWho can you trust when your friends wanna pop your safe?\nYou let him stash in your place, now you watch his waist\nVision the days, hear the ghost whisper\nDogs we left in the past, brought back now here with us\nCross my heart, let the haze linger\nPour out a little liquor, knowin' God took a good nigga\nThousand dollar slippers skirt from the scene he was just a worker, dog\nYou were his every dream\nI kissed his face like I never knew 'em\nIt was me, once upon a time when life was ruined\nNow the mink rope chain sparklin'\nJumpin' out of bed, Thousand dollar slippers slidin' huggin' the\nCarpets\n\nChorus", "image": "https://images.genius.com/1e1ebfd1f79138a02b3cbced2c28bcf7.800x800x1.jpg"}], "artist": "Mobb Deep"}