{"songs": [{"title": "Roc the Mic (Remix)", "album": "Nellyville", "year": "2002-06-25", "lyrics": "[Intro - Beanie]\nYou know we hadda do a remix right?\nHo! Ho! Ho! Ho!\nAll you Young Gunnerz!\nHey Just, this the one right here baby!\nI told you dawg!\n\nIts B Sig in the place with State P\nAnd we got what it takes to rock the mic right Yeah!\nStill watch what you say to B. Sig\nCause I still will knock your ass the fuck out\n\n[Verse 1 - Beanie (Freeway)]\nI bring the hood when I'm travelin\nScrap backwoods unravelin\nScrap smoke good when we travelin\nForget the Mac's cause the K's fit good in the Caravan\nI clap up your hood like the hammer man\nBring your gat, better bust it if you get that close\nScared to clap better strap your folks (strap...your...folks)\nWho want beef with State P...\nEnemies try to speak to me\nNegative they don't get that close\n\n[Verse 2 - Freeway (Beanie)]\nIts Free, listen\nBlow trees with Mac Mittens\n(No we didn't) Yes we did!\nSwitch beginnings, Smith and Wesson precision\nBring the broads down with ribbons\n(Leave a mess in your crib)\nNot a brave nigga?\n(Fuckin with some made niggas)\nHit him with the AK nigga\n(Free no you didn't)\nYes I did\nOverpayed shit? Wait a minute...\nWhen this fakin, snatch the cake up out his crib\n(Then slide, uh)\nI'm like the baker with your pies\n(Then rise)\nSet up shop and distribute where you live\nIt's Freeway in the place with my squad\nAnd we got what it takes to DUMP the K\nFLIP your ride!\n\n[Chrous 1 - Beanie]\nIts B Sig in the place with State P\nAnd I got what it takes to rock the mic right Yeah!\nStill watch what you say to Young Free\nCause 50 shots still will turn the club out\n[Hook 2 - Freeway]\nIts Freeway in the place with State P\nAnd we got what it takes to the rock the mic right Yeah!\nStill watch what you say to B Sig\nCause we got what it takes to dump the D-E\n[Hook 3 - Nelly]\nIts Nelly in the place with Murph Lee\nAnd I got what it takes to rock the mic right Yeah!\nYou better watch what you say around herre\nCause theres somethin on my waste to make the whole place break\n[Hook 4 - Murphey Lee]\nIts Murph dun in the place with Nelly\nAnd I got what it takes to rock the mic right Yeah!\nYou better watch what you say to my face\nCause I got what it takes to shake the whole place\n\n[Verse 3 - Murphey Lee]\nMurphy Lee's eighteen entertainin 'em\nTwenty-one when I'm clubbin it\nFake ID for the fuck of it\nI'm just a school boy, somewhat new boy\nIf you can't get Nelly you'a settle for who boy?\nTwo toy carrier, two stashes\nOne truck that seats six asses\n22's to confuse the masses\nRemove glasses, blow smoke up in my ashes\nI used to drive my mama stuff\nNow the school boy puttin twenties on the Bomb Pop truck\nI make rappers go back to the block\nThey be like \"maybe I was better off selling rocks\"\nI'm Murphey Lee in the place to be punk\nAnd I got enough skunk to fill the whole blunt\nI take trips with chumps up in my trunk\nAnd I take em real far to a safe place to dump\n\n[Verse 4 - Nelly]\nIt's Mr. Down down, I'm witcha dirty get down and lay down\nFinance a pay-down, heard what I said now?\nSee how I procede with caution\nMy whip crack fast all you niggas is horses\nRandy Moss', I play when I wanna\nNut check, gut check, cause I say what I wanna\nAround six in the six with the throwback\nSixers, number six Julius Irv'\nCris and the herb, make it hard to swerve\nThrow your hands up; if you didn't bang your rim on the curb\nYou couldn't hit while you was makin a turn\nI strike a nerve in old MC's wantin a comeback\nI got the strength that he's lost and that's fact\nLike K - \"Know\" one here even said your name\nR - You really feelin guilty bout somethin mayn\nS - Sad to see you really just want just\nOne - more hit please please!\nYou the first old man should get a rapper's pension\nNo hits since the cordless mic invention\nI'm snitchin; matter fact, stay the fuck out the kitchen\nNelly kickin with too many dimensions\nMidwest, and we aim about mid-chest\nDuked on my side, too many in my tribe\nCoupe outside who the fuck want a ride?\n\n[Hook 3]\n[Hook 2]\n\n[Outro - Freeway (to fade)]\nAll a y'all need to one yo self\nGo get the burner nigga clap yo-self!\nAll a y'all need to one yo self\nGo get the burner nigga clap yo-self!\nYeah! Its the, its the Roc nigga\nHo! Ho! Ho! Ho!\nAnd another one...", "image": "https://images.genius.com/ee6c6181ebd522da5b345ff9cd0a61f9.1000x1000x1.jpg"}], "artist": "Nelly"}