{"songs": [{"title": "Street Dreams (Bonus Verse)", "album": null, "year": null, "lyrics": "\"Uh. What?! What?! Uh.\"\n\nStreet dreams are made of these\nThugs drop Beemers wit' three-hundred E's\nA drug dealer's destiny is reachin' a ki\nEverybody's lookin' for somethin'\nStreet dreams are made of these\nShorties on they knees for playas wit' big cheese\nWho am I to disagree?\nEverybody's lookin' for somethin'\n\n[Noise and a gun shot]\n\nMy man put me up for the share, one-fourth of a square\nHeaded for Delaware wit' one change of gear\nNothin' on my mind but the dime sack we blazed\nWit' the glaze in my eye that we find when we crave\nDollars and cents- A fugitive with two attempts\nJakes had no trace of the face, now they drew a print\nThough I'm innocent 'til proven guilty\nI'mma try to get filthy, purchase a club and start up for realty\nFor real, G, I'mma fullfill my dream\nIf I conceal my scheme, then precisely I'll build my C.R.E.A.M\nThe first trip without the clique\nSent the bitch wit' the quarter brick, this is it\nFresh face, NY plates, got a crooked eye for the Jakes\nI want it all, ArmorAll Benz and endless papes\nF' God sake, what a nigga got to do to make a half million\nWithout the FBI catchin' feelin's\n\nStreet dreams are made of these\nThugs drop Beemers wit' three-hundred E's\nA drug dealer's destiny is reachin' a ki\nEverybody's lookin' for somethin'\nStreet dreams are made of these\nShorties on they knees for playas wit' big cheese\nWho am I to disagree?\nEverybody's lookin' for somethin'\n\nFrom fat cat to papi, niggas see the cat\nTwenty-five to flat, push a thousand feet back\nHoldin' gats wasn't making me fat, snitches on my back\nLivin wit' moms, gettin it on, flushin' crack\nDown the toilet- Two sips from bein' alcoholic\nNine-hundred-ninety-nine thou from bein' rich but now I'm all for it\nMy man saw it like Dionne Warwick\nA wiser team for a wiser dream, we could all score it\nThe cartel, Argentina coke with the nina\nUp in the hotel smokin' on sessamina\nTrina got the fishscale between her\nThe way the bitch shook her ass, yo, the dogs never seen her\nShe got me back livin' sweeter, fresh Caesar\nGuess, David Robinson's, Walle' moccasins\nBitches blow me while hoppin' in the drop-top B-M\n\n\"Word is bond, son, I had that bitch down on my shit like this.\"\n(\"Uh. What? What? Word?\")\n\nStreet dreams are made of these\nThugs drop Beemers wit' three-hundred E's\nA drug dealer's destiny is reachin' a ki\nEverybody's lookin' for somethin'\nStreet dreams are made of these\nShorties on they knees for playas wit' big cheese\nWho am I to disagree?\nEverybody's lookin' for somethin'\n\nIll designer fleece, studded marquise\nA letta L on my car keys- Thuggin' hard on Cavarse\n'Posters be Franchesco and all these bets\nMobile phones in the armrest, ladies be the bombest\nI creep tinted, parked the whip and grabbed the rented\nSeems like I'm changin' my location every minute\nLike a plague is on my head, son- I vision red rum\nWarrent squads knockin' at the same time the Feds come\nPandemonium got me puffin' Cambodian\nGrand openin's of barber shops and stock\nMy jew-el rock, tokin' pronto- Livin' like a pablo\nPapi like a poncho until the state patrollers pulled us over\nFound the guns and the good\nHad a nigga like 'Nas had to run through the woods'\nSneakin' out the next mornin'- Looked up to God\nGuess in all this was a fuckin' warnin'\nTook my diamonds in for the pawnin'\nNow I'm back on the climbin'\nMovin' consigned through rain, sleet, whatever climate\nSo many ups and downs shiftin', I was twisted minded\n'Mazed on top, all the hoes and pussy had me blinded\nBig lip bitches, suckin' dick rediculous\nGS'es and vest-es, larger rays lookin' sentious\nBack on the block buggin', how the fuck I been through this?\nNearly caused my life but now I can't show a cent from it\n\nStreet dreams are made of these\nThugs drop Beemers wit' three-hundred E's\nA drug dealer's destiny is reachin' a ki\nEverybody's lookin' for somethin'\nStreet dreams are made of these\nShorties on they knees for playas wit' big cheese\nWho am I to disagree?\nEverybody's lookin' for somethin'\n\n[Noise and a gun shot]", "image": "https://images.genius.com/23061dd2dc7e863127db561906debd27.434x434x1.jpg"}], "artist": "Nas"}