{"songs": [{"title": "3 Peat", "album": "Tha Carter III", "year": "2008-06-10", "lyrics": "[Intro]\nYessir!\nThey can't stop me\nEven if they stopped me\nHahahah, yeah\n\n[Refrain]\nI'm on it, ooh, I'm on it\nI'm so on it, and however you want it\nYou can get it tonight ho, and all night ho\nI get the beat from (Maestro), fuckin' right, ho!\n\n[Verse]\nI might go crazy on these niggas, I don't give a motherfuck\nRun up in a nigga house and shoot his grandmother up\nWhat! What! I don't give a motherfuck\nGet your baby kidnapped and your baby-mother fucked\nIt's Tha Carter 3, bitch, better put your supper up\nHollygrove, I throw it up like I'm trying to lose my gut\nFuck is up? Beat him up like a million uppercuts\nGot a million duffled up for the fuck of it, shit\nGet on my level, you can't get on my level\nYou gon' need a space shuttle or a ladder that's forever\nHowever, I'm better, if not now, then never\nDon't you ever fix your lips unless you 'bout to suck my dick\nBitch, swallow my words, taste my thoughts\nAnd if it's too nasty, spit it back at me\nTwo more inches, I'd have been in that casket\nAccording to the doctor, I could've died in traffic\nBounce right back on them bitches, like Magic\nAbracadabra, I'm up, like Viagra\nI just do this shit for my clique, like Adam Sandler\nI control hip-hop and I'mma keep it on my channel\nWatch me, bitch, watch me\nBitch, watch me, but they cannot-see me, like Hitler\nIt's the New Orleans nightmare\nMoney so old, it's growing white hair\nYoung Money, baby, yeah we right here\nI'ma make sure we ball 'til we fall like tears\nAnd mama, don't cry, your son can handle his\nI got her out the hood and put her in the hills\nYeah, when I was 14, I told my mom we will see better days\nAnd sure enough, I got Miss Cita in a better place\nWhen I was 14, I told my mom we will see better days\nAnd sure enough, we did exactly what I said\nI tell my girl \"When you fuck me, better fuck me good\n'Cause if another girl could, she gonna fuck me good\"\nNo sitting at the table if you bringing nothing to it\nAnd I get straight to it like it's nothing to it\nYeah, I got game like Stuart\nScott, fresh out the ESPN shop\nAnd when SportsCenter poppin', everything stoppin'\nBut you can't fool me, I know what you watchin'\n\n[Refrain]\nMe! You watch me! You watch me\n'Cause I be, Weezy, must see, T.V., C3\nNigga, that's me, and I'm me, I'm me, times three\nSo retreat, or suffer defeat, I'm back, 3-peat\nC3!", "image": "https://images.genius.com/70a7ef69242915a9cd1c3f68031e4c0a.1000x1000x1.jpg"}], "artist": "Lil Wayne"}