{"songs": [{"title": "Way I’m Ballin’", "album": "Dedication 5", "year": "2013-09-01", "lyrics": "[Verse 1: Lil Wayne]\nI got shotguns under my staircase\nRob yo ho ass bare face\nBeen had this bitch on lock, I’m bout to get this bitch a cellmate\nAll my life I been this cold\nAll my nights I spend with hoes\nI keep change on me now\n‘Cus this shit’s startin to take a toll\nI just flew 2 hoes in, oh how time flies, clip its wings\nMake you spit that safe combination, out like Listerine\nAnd even though I’m not an artist this is where I draw the line\nWe don’t feel none of you niggas\nY'all some fuckin porcupines\nI still got residue all on my dinner plates\nReal niggas in my inner circle\nNone of my checks come late, I ain’t having that, I give em curfews\nDressed up like a old lady, uzi under my church dress\nSurprise yo ass like a baby… taking his first steps\nI’m too good for just any bad bitch\nSmoke like I’ve been kissing dragons\nThat milk carton show her missing panties\nThat pussy felt like a hidden valley\nThank God that I’m so gifted\nI wouldn’t return a single gift\nBut all good things must come to an end\nLike this blunt burning my fingertips\nLil' Tune\n\n[Hook: Lil Wayne]\nThis ain’t what you want\nPut that gun to yo ho head\nMake her tell me what you don’t\nGot some moon rocks in my pockets, that’s a pocket full of stones\nFuck with me cuz I fuck around and got that shit from Neil Armstrong aw!\nNeil Armstrong aw! Neil Armstrong\nFuck with me cuz I fuck around and got that shit from Neil Armstrong!\nGot some moon rocks in my pockets, that’s a pocket full of stones\nFuck with me cuz I fuck around and got that shit from Neil Armstrong aw!\n\n[Verse 2: Mack Maine]\nStriper pole on the yacht\nStriper pole in my spot\nI got yo girl in my condo\nBitch I’m ballin like Rondo\nFlexin ranches up in Texas\nI know it’s a blessing but I don’t know what’s a recession\nIf we talkin mew mew’s, Jimmy Choos and Giuseppe she got it\nI star 6-7, my flights I fly private\nI’m a walkin hedge fund\nI copped a 62 for leg room\nThis bitch text saying her lights off\nI bought her a new crib, it’s a tax write-off\n\n[Hook: Future]\nIt’s like the way I’m ballin on these niggas\nIt’s like the way I’m ballin on these niggas\nForeva\nIt’s like the way I’m ballin on these niggas\nHold it\nIt’s like the way I’m ballin on these niggas\nStep up in this kitchen\nJust step back take a look at me\nListen , that Ferrari unreleased\nStop being so defensive, I’m making real decisions\nThat’s the reason why we winning\nWe flying, we finished\n\n[Verse 3: Birdman]\nRich Gang, we drop feathers to vall\nRich Gang ball 'till you fall\nWe hit the block dippin cuz the block hot\nRecord sales, ship it from the Hard Knox\nLive it like we live it twice\nBallin with them bright lights\nBad bitches stand tall\nBad bitches want em all\nHella choppas on the surface\nMansion on the beach, nigga that’s the purpose\nBlow it cuz the swag is perfect\nFirst class flights, nigga we done murked em\n\n[Hook: Future]", "image": "https://images.genius.com/aa4f93cf953aad46ecd13d3027b59fff.475x475x1.jpg"}], "artist": "Lil Wayne"}