{"songs": [{"title": "Herb-Crusted Lamb Rib Chops / Beer-Steamed Snow Crab Legs", "album": "#MEALTIME", "year": null, "lyrics": "Herb-Crusted Lamb Rib Chops\n\n• 2 lamb racks, chopped and frenched\n• Freshly chopped mint, thyme and rosemary\n• 1 tablespoon minced garlic\n• Kosher salt and black pepper\n• Lawry's\n• Olive oil\n\n1. Play \"Where U Been?\" featuring Cap.1 and crank up the 2 Chainz dance\n2. Drizzle olive oil on the most expensive rack of lamb in the store\n3. Sprinkle assorted seasonings (Lawry's black pepper, onion, garlic) onto lamb and mix well with chopped herbs\n4. With the song bumping in the background, cover the expensive lamb in plastic wrap and let sit at room temperature for 20 minutes\n5. Place chops onto lightly oiled, hot, oven-safe pan\n6. Cook over medium-high heat for approximately 2 to 2 1/2 minutes per side\n7. Finish cooking in 350F oven for roughly 10 minutes or until desired doneness\n8. Once finished, plate racks of lamb alongside a bottle of extravagantly priced cabernet. 2 Chainz and fine wine. You want true? That's true enough\n\nBeer-Steamed Snow Crab Legs\n\n• 2 pounds snow crab legs\n• 22 ounces cheap beer\n• 1 lemon\n• 1/2 stick butter\n• Olive oil\n• Old Bay Seasoning\n• Garlic powder\n\n1. Turn the lights down and light some candles\n2. Set the mood by playing \"So We Can Live\"\n3. Once the vibe is right, add snow crab legs to large stock pot\n4. Pour the cheapest beer in the supermarket over the crab legs\n5. Add juice of 1 lemon and put lemon in pot when finished\n6. Season with Old Bay and garlic powder\n7. Bring the pot to a boil and cover if possible\n8. Let crab legs steam for 6 minutes\n9. Light some more candles and meditate. The vibe is so important to this dish that it is worth spending extra time to get it just right\n10. Turn legs, then steam for an additional 5 minutes\n11. Serve with melted butter and/or \"Me Time\" Sauce", "image": "https://s3.amazonaws.com/rapgenius/2-chainz-meal-time_01-500x375.jpg"}], "artist": "2 Chainz"}