{"songs": [{"title": "What Happened to the Groupies", "album": "Can’t Stay Away", "year": null, "lyrics": "Intro: Captain Save-A-Ho\nShort, Short, whats up man, this Captain man check this out\nI know you and B-Legit finna get in here and get down on this song right?\nBut yall can't be talkin bad about broads, man, you know?\nYall in here talkin bout \"suckin this\" and \"suckin that\"\nAww shit, here come B pullin up in his 600 blowin big weed, yall be cool man\n\nVerse 1: B-Legit/Too $hort\n\nB-Legit:\nI blaze blunts all day get keyed all night\nBe the one to take flight if the smoke ain't right\nI'm tight, nicknamed Ike for the drama\nIt's baby and her mama, naked in a sauna\nDown with the gang cuz them flows be hard\nBlue mink, Short, and my St. Brenard\nSuper bad man all around Hoo-J\nTell me what the fuck happened to the groupies\n\nToo $hort:\nWhat happened to the groupies, I thought they was comin through\nTo do everything we want em to\nSupposed to be all good when they get here\nBreak niggas off, bitch we real playas\nBaby in the red said \"It's coo'\"\nShe gonna give me some pussy, and some head too\nI ain't trippin though, these bitches takin too long\nI'm bout to call some other hoes on the phone\n\nB-Legit:\nTell em I'm a hog nigga, need a triple-X bitch down to stick\nTurn tricks switched the dick\nTheres hips outside and I'm fo' sho' dat\nAnd the finest ho she know where mo' at\nGotta show that, nigga tuck my jewels\nCan't be slippin with a bitch, niggas know that shit\nHit me at the room when the hoes come\nIt be at 301 we callin for some\n\nToo $hort:\nWhere they at B-Legit where they at? (where they at)\nLet these bitches know theres some real playas back\nTold her meet me in room 510 on the mattress\nIf you do it right then I'll be back bitch\nAnother showdown, in yo' town\nLet everybody know you my ho now\nI'm feelin way too cool off the gin and juice\nI'm bout to fuck my bitch and her friend too (and her friend too)\n\nCaptain Save-A-Ho:\nDamn, see man yall niggas is trippin man\nNiggas this '98 yall actin like its still '88\nShort cussin, and all this bullshit\nCheck this out--see baby and them leavin see?\nBaby come here, c'mon, baby don't even trip, just kick it for a lil while\nYou know what I'm sayin? I'll take you to Sizzler to go eat after awhile\nI'll make em stop trippin, don't even trip baby its all good\n\nVerse 2: Too $hort/B-Legit\n\nToo $hort:\nI'm feelin good, everything hooked up right\nBefore its all over I'mma be in som'n tight\nLooked down at my hip to check my pager\nTryin to find me a bitch, fresh off the stage\nNigga ain't hungry, fuck the after party\nTold a cute groupie \"Bitch meet me in the lobby\"\nYou know how we do it, told her bring all her friends\nNext weekend we gonna do it all again\n\nB-Legit:\nI said it out my mouth on the mic real loud\nWe at the Holiday-Inn, room 510\nBring all the bitches even if they dikes\nWe hyped, hoes eatin pussy tonight\nSeen her in my mug, peepin my game\nLookin like she could take dick in the brain\nWe all champagne and Cali green\nI need a bitch like that on a pimp team\n\nToo $hort:\nIt's after midnight, can't find the right women\nCan't be slippin while you're late night pimpin\nWay too many niggas got stuck like that\nWaited too late then fucked a rat\nWake up in the mornin, mad as hell\nWith the wrong bitch in the wrong hotel\nShoulda gave up when you first struck out\nNow you tryna get the fuck out\n\nB-Legit:\nMan I was drunk when I went out, blow when I woke up\nDidn't get to fuck cuz these hoes is ducks\nNiggas like me need the head lay on\nFrom bad ass bitches who prefer red bones\nRock microphones, later count G's\nCould always spot a rat chasin niggas with cheese\nPlease, put it on freeze, it don't suit me\nWhat happened to the muthafuckin groupies? (muthafuckin groupies)\n\nCaptain Save-A-Ho:\nWhat happened? nigga they all left, thats what happened\nYall muthafuckas gonna be sittin around all night talkin to each other\nOh thats cool, yall got some muthafuckin Playboy magazines\nSo I guess thats why yall ain't trippin, check this out man\nYall niggas gotta understand one thing man\nBitches don't love to be talked to like that, yall gotta break down\nBe cool with a bitch, ya know what I'm sayin?\nShow her some caring and shit, understand me?\n\nVerse 3: B-Legit/Too $hort\n\nB-Legit\nI remember when the shit first began\nI used to fuck the dog shit out my biggest fans\nFour in the mornin we hit the waffle spot\nThen its back to the telly for some more cock\nShit was non-stop, don't choose too fast\nTheres a gang of more bitches with way more ass\nUp and down the hall with the bad-ass body\nGroupies lookin for the after party\n\nToo $hort:\nI used to be wild as fuck, get my dick sucked\nOn the back of the tour bus with two or three sluts\nCheck into my suite, order somethin to eat\nKnockin at my door, its another lil freak\nRight up the hall on the same flo'\nYou could stand in line and run a train on the ho\nTop-notch or rat, skinny or fat\nB-Legit, where all the groupies at? (groupies at)\n\nB-Legit:\nIn the room with the tricks gettin big faces\nBut they really wanna know how the dick tastes\nI used to get fucked, fall asleep, wake up\nKick the bitch out and bump a freak\nBut nowadays, you gotta watch your route\nNiggas savin hoes need to cut that out\nSo what they talkin bout, they shoulda been done came\nI think they scared of a nigga with this real game\n\nToo $hort:\nWhat happened to the groupies, don't point your finger\nThey're all backstage chasin R&B singers\nAt the other concert, on the other side of town\nI seen a few hoes but they wasn't down\nWhere the groupies at, I'mma ask yall later\nProbably out tryna fuck basketball players\nSilly hoes, rappers got mansions\nBut we ain't tryna get into these tramp bitches\n\nCaptain Save-A-Ho:\nYall niggas is trippin man\nYall need to sit down and re-evaluate your morals man\nYall niggas gettin too old for this shit\nYall gonna be sittin around in the club\nTryna figure out who goin home with ya old ass\nYou need to find ya a good woman, snatch her up, get her a BMW\nShe got kids, only do what you do, tell her \"I got you\"", "image": "https://images.genius.com/31a42aa43e1b297422c8b89c0ea0a2c0.500x493x1.jpg"}], "artist": "Too $hort"}