{"songs": [{"title": "Psycho Bitch III", "album": "Special Effects", "year": "2015-05-04", "lyrics": "[Intro: Tech N9ne]\nReal killas move in silence\nQuiet storm, such a tyrant\nMurderer stays vibrant\nAt 5'2\", she's a giant\nAnger breathes defiance\nWhen she's on, no compliance\nCause her demon needs violence\nDon't give her no love, never wanna fold up\nThen you better hold up cause she cray\n\n[Verse 1: Tech N9ne]\nYou're just a shady bitch, on the daily on some crazy shit\nDon't fuck around with a lady, it'll be a blaze where your Mercedez sit\nEighty-six the baby bit, you don't wanna run into my radius\nMaybe get you rabies sick and the gravy is (Ain't that about a bitch)\nWhen you date the girl and you mate the girl\nAnd she fuckin' with another man'll make you hurl\nShe methodical with a chain and gonna break ya world\nTaste the barrel of a shotgun, aught one, in the head nigga not fun\nBut you really wanna pop some\nPut the Yak in the belly and he drops when he got done\nYour imagination, kills you when it's so bad it's aching\nAnd what's your status? Hatin', a whole lot of aggravation\nCause she's kickin' it with this rapper, and that rapper\nAnd that factor get a gat clapper\nGotta mash after with a blast at her\nSilly bitches don't consider your feelings\nThey make you think the lovin' is real when you chilling\nBut when you turn away, she gets to illin' with another nigga\nProlly drilling for real and you know his music and he knows yours too\nAin't no limits to what your whore do\nPillow talking with her no more true\nLovin' when I catch up with 'em, bro you're through\n\n[Interlude: Makzilla & (Tech N9ne)]\nAye bro the bitch that you fuckin' with, man, she was in the club last night with the rap nigga. What's up with that?\n(For real?)\nYeah, nigga. They were in there together, my nigga\n\n[Hook: Tech N9ne]\nWishing you never heard of a (Psycho bitch)\nBitch will make you murderous, she's a (Psycho bitch)\nPsycho breedin', believe it (Psycho bitch)\nDon't pack nothing, just leave it (Psycho bitch)\nShe can be peaceful, and people that's peepin' they see this evil freak in you\nFreakin' you, make you repeat it like it's a sequel\nBetter run when you see a (Psycho bitch)\nCause your bitch might be a (Psycho bitch)\nYeah, yeah\n\n[Verse 2: Tech N9ne]\nThis bitch\nTalking to me in this alley, she love me to bits\nBut on the other end she really takin' the dick\nI never knew she was evil, my nigga told me that he caught her with him in the mix\nThat is when I get to trippin' and having a fit\nHe think he with her, she told him we broke up\nDiggin' the day on my penis she choke up\nHe know I'm tripping cause she's fuckin' telling him\nHe gonna feel it when I put the hell in him\nI'm outraged cause I've been lied to\nIf I happen to catch her with him she can die too\nUsed to be my boo, now she's sucking some guy's goo\nWanna divide two and dump 'em both in the bayou\nSteppin' with my crew, I ain't coming to fight you\nBullets gonna fly through whoever's walkin' beside you\nI never liked to, would take the knot out of a tied shoe\nI'm bout to slide through and bang him, nigga this Piru\n\nInterlude: Man & (Tech N9ne)\nHello?\n(Why you calling my girl phone, nigga you know what this is?)\nI didn't give myself her my cellphone number nigga\n(Are you fuckin' her?)\nHahaha\n(Oh you think think this shit funny nigga? Okay, I'mma see you)\nHoe-ass nigga\n\n[Hook: Tech N9ne]\nWishing you never heard of a (Psycho bitch)\nBitch will make you murderous, she's a (Psycho bitch)\nPsycho breedin', believe it (Psycho bitch)\nDon't pack nothing, just leave it (Psycho bitch)\nShe can be peaceful, and people that's peepin' they see this evil freak in you\nFreakin' you, make you repeat it like it's a sequel\nBetter run when you see a (Psycho bitch)\nCause your bitch might be a (Psycho bitch)\nYeah, yeah\n\n[Verse 3: Hopsin]\nBitch where the fuck you been?\nI've been calling yo ass since last night\nYou runnin' some shit? You sucking some dick?\nOh, you was with Rachel, is that right?\nHmmm, okay, guess I was wrong, case closed then\nNow you got one more time to lie before you get your face broken\nSo stay focused, I ain't jokin'\nYou slept with a nigga, think I ain't noticed?\nRunnin' game on me like I ain't your man?\nTrying to come back home? I don't think so bitch\nGimme your phone (No!) Gimme that shit(No!)\nStop wrestling, makin' me use aggression\nI'm tryna see who you texting\nWoah!  Oh bitch, I'm going to jail fo' sho\nI shouldn't have held yo phone, I'm losing control, lord help her soul\nWho the hell is Joe and why did you text him sayin' the sex was great?\nYou fucked him!? Ooh, both of you guys are dead, just wait\nLemme call this nigga, got me getting all violent\nI'm mad and you crying, you better hope his phone is on silent\n(Hello?)\nHey baby, just wanted to say that I love you much\nSike, nigga, it's her boyfriend, and I'm on my way now to fuck you up!\n\n[Interlude: Man & (Tech N9ne)]\n(Sup nigga, talk that funny shit now nigga)\nAw, this hoe-ass nigga right here\n(Wassup nigga?!)\nWassup nigga?!\n(Fuck you, nigga!)\nNigga, fuck you, nigga!\n(Fuck you!)\n*Gunshots fired*\n*Bystanders screaming frantically*\n\n[Break]\nChristine George\nNannie Doss\nCasey Anthony\nAileen Wuornos\n\n[Outro: Tech N9ne]\nYeah man, I do believe you have to be careful with relationships\nMen kill each other over women everyday\nI lost my best friend, Brian Dennis, to a crime of passion\nIt's crazy\n\nWhy not have all these links to all these different genres?\nWhy can't I be the epicenter of all types of music?", "image": "https://images.genius.com/edd99f73805809fd6bac9dda75c9e951.550x550x1.png"}], "artist": "Tech N9ne"}