{"songs": [{"title": "? (Extended Raw Rhymes Version)", "album": "Operation: Doomsday.", "year": null, "lyrics": "[Kurious]\n131 years savage generation\nOne recipe enough said\nJack Daniels old number 7 B\nQuality, Tenesse, sour mash whiskey\n\n[MF Doom]\nOoh, so many flows\nShit goes, so many ways down and below\n20-10 thousand leagues under the sea\nMotherfuckers never know it was me\nOh, that nigga' flew so many flows\nIt's like so many fly colors on the hoe toes\nGod dammit, motherfucker ruling whole planet\nGimme' two times, cut no shit, nah, fuck it\nI'm coming through kicked the bucket one day\nMotherfuckers never see a nigga parle\nLike, lay in the cut, like, he never knew\nMotherfucker, Super Villain\nAnd who the fuck is you? Ooh\n\n[Kurious]\nOne two, one two\nIn order TO make a jam, kid\nWe gotta' get it back up in the zone\nMad shit the way we be spittin, when we writing shit is on\nI'm fucking it up cause right now\n\n[MF Doom]\nSee Imma be serious my next verse, Imma just be serious (Yeah)\nI be starting to laugh, that's my problem\n\n[Kurious]\nThat's my problem too, my shit sound like on some funny shit\nYou know what's hot? The way we keep talking\nI'm taking off the headphones  to talk you you\nBut it's dope, cause we talkin' and still doin' it to the music\n\n[MF Doom]\nSo wait, then the beat's too loud?\nI keep the beats kinda low, like this and shit\n\n[Kurious]\nNo, nah I don't the levels are fucked up\nOh you mean to keep the tone down?\n\n[MF Doom]\nYeah, yeah, yeah, kinda like riding like right there, right there, be like yo\n(The sound facts on the whole situation is...)\n(Good things...)\n\n[Kurious]\nNope-a nope, nope\n\n[MF DOOM]\nHe cleans his metal mask with gasoline, they after him\nLast seen pulling a chick like a fiend pull a fast one\nCan't put shit past him\nGot niggas on his own team mad enough to blast him\nRetarded in real life, on the mic Rain Man\nStand close to his main man like a chain gang\nWho give a fuck about who or they fancy crew\nThat's no mystery what Hardy Boys do with Nancy Drew\nSorta with her drawers down quarter\nThe extorter bring slaughter like \"Well I oughta\"\nI suggest you hand over the formula doula\nA villain in your land, in his land a ruler\nHard hitting like puffing a woola with Lieutenant Uhura\nEvery day feel like it's an off day with Ferris Bueller\nBrother pull heat to prove they not sweet\nNo matter how you spell it, we still got beats\n\n[Kurious]\nPeople question how we live, question what we give\nTake it to the next leave 'em where they can't see me\nStill they judge, but they be butt ass\nTwist that wig like a muppet, keep it simple, can't truss it\nLight's the fuel, mic is the tool\nDrink Jack, kick back, drop jewel, finish what I start\nMastered the art, living hell can't explain it\nInhale confuse it more, cop the .44\nContemplate, meditate, dictate\nI direct my direct fate, coming of late\nKurious, can I say shit\nDo it for CottleRock, do it for K.Nit\n(RIP)\nK-N-I-T, Sub R-O-C\n(Eternally for M-I-C)\nOnly we save we\n\nYeah, ? (word up)\nAll ya'll punk motherfuckers get schooled\nSlammed on sight\n\n\n[MF DOOM]\nBy candlelight my hand will write these rhymes 'til I'm burnt out\nMostly from experience, shit that I learned about\nTopics and views, generally concerned about\nWith different ways to come up and earn clout\nI take a look at my life and pace the trails\nFrom Tablik and savage females with fake nails to face veils\nYou out your frame but still bagging 'em too\nYou know I know, these hoes be asking me if I'm you\nLike my twin brother, we did everything together\nFrom hundred raka'at salats to copping butter leathers\nRemember when you went and got the dark blue Ballys\nI had all the different color Cazals and Gazelles\nThe \"SUBROC\" three-finger ring with the ruby in the \"O\", ock\nTruly the illest dynamic duo on the whole block\nI keep a flick of you with the machete sword in your hand\nEverything is going according to plan man", "image": "https://images.genius.com/c0a80e3098696bdf600f54a76667c069.1000x1000x1.jpg"}], "artist": "MF DOOM"}