{"songs": [{"title": "Shake Ya Tailfeather (Xtra clean radio edit)", "album": null, "year": null, "lyrics": "We do it for fun\nWe just do it for fun\nDirty E.N.T\nWe do it for fun\n\nBad Boy (Nelly, Diddy, Murphy Lee)\nWe do it for fun (this is history baby)\n\nBend them trucks, we do it for fun (haha)\nStack them bucks, we do it for fun (come on now)\nAnd the band played on (yeah)\nJust like (I believe you cool to this), we do it for fun\nIf you see me ma, we do it for fun\n\nBad Boys II, the soundtrack\nLet's go\n\nCome here girl, what your name is?\nWhere you from? Turn around, Who you came with?\nIs that your ass or your mama have reindeer?\nI can't explain it but damn sure glad you came here\n\nI'm still a sucker for cornrows, you know I never changed that (nah uh)\nYour body is banging mama, but where your brains at? (come on)\nI'm still the same cat when I was young I was running with bad boys\nBut now I'm older hope they saw I'm running with bad boys (that's right)\n\nHere come another man unlike no other man\nCandy coated, whoa, switching every other lane\nY'all help me, why don't cha? Please help me\nEighth girl this week and it's only Tuesday\n\nI like the cocky bow legged ones\nLike white and Dominicans\nHispanics and Asians\nShake it for Nelly son\nManolos Ma-no-no's I can't tell\nEverybody and their hoochies\nWhen you do it, do it well\n\nLet me see you take it\nGirl, go and take it off\nWe can even do it slow\nWe can even do it slow\nTake it where you want to go\nTake it where you want to go\nJust take that ass to the floor\nPop something move something\nShake ya tailfeather\n\nGirl, go and take it off\nWe can even do it slow\nWe can even do it slow\nTake it where you want to go\nTake it where you want to go\nJust take that ass to the floor\nPop something move something\nShake ya tailfeather\n\nNow real girls get down on the floor (on the floor)\nNow get that money, honey, act like you know (like you know)\nMama, I like how you dance, the way you fit in them pants (uh)\nEnter the floor (uh) take it low (uh) girl do it again (uh)\n\nYou know I love that (I love that)\nNow where them girls at? (Where the girls at?)\nIt's Diddy, Murphy Lee and Nelly, how you love that? (Shit, uh oh)\nCome on, we got another one player\nFrom New York to the Dirty, how they loving it player?\n\nBaby, you impressive, let's get to know each other\nYou the best of the best and you gotta love it\nIn the dresses, the sexiest, I had to tell her\nShe's a young Janet Jackson live in living color\n\nLook here mama, you're dead wrong for having them pants on\nCapris cut low so when you shake it I see your thong\nMy pocket's full of dough, shake your feathers till the morning\nIt's Bad Boy and Nelly man, somebody better warn 'em\n\nLet me see you take it\nGirl, go and take it off\nWe can even do it slow\nWe can even do it slow\nTake it where you want to go\nTake it where you want to go\nJust take that ass to the floor\nPop something move something\nShake ya tailfeather\n\nGirl, go and take it off\nWe can even do it slow\nWe can even do it slow\nTake it where you want to go\nTake it where you want to go\nJust take that ass to the floor\nPop something move something\nShake ya tailfeather\n\nOh no, I heard them bad boys coming\nCan't stop now, got to continue my running (yeah)\n'Cause we go party till them lights come on\nAnd then my song stop, fuck it, because my mic still on\n\nYo, I'm the big booty type\nI like them thick with their mind right (aww)\nBanging personality, conversate when the time right (naw)\nI'm not hard, I've got women to handle that\nThey be like, \"He the man!\" when I'm really a ThunderCat\n\nCome on, you know the tics connect like Voltron\nCollect so much grass, popo thinking we mow lawns\nMy gohans don't match that\nBut it matches her head wrap and the seats that I got in the 'Lac\n\nI'm just a juvenile (wha) cause I be about G's\nKeep your women wizzy man, they say they have my babies\nI'm young like turk, I like the cash and the money\n(I'm going to eat my money) Man, I'm that damn hungry\n\nSee I'm starvin' like Marvin girl\nI've got sixteen bars of fire is what I'm starting\nPlus my rats come in packs like Sammy and Dean Martin\nAnd I got so many keys you'd think I'm valet parking\n\nLet me see you take it\nGirl, go and take it off\nWe can even do it slow\nWe can even do it slow\nTake it where you want to go\nTake it where you want to go\nJust take that ass to the floor\nPop something move something\nShake ya tailfeather\n\nGirl, go and take it off\nWe can even do it slow\nWe can even do it slow\nTake it where you want to go\nTake it where you want to go\nJust take that ass to the floor\nPop something move something\nShake ya tailfeather\n\nOh no, I heard them bad boys coming\nCan't stop now, got to continue my running (yeah)\n'Cause we go party till them lights come on\nAnd then my song stop, fuck it, because my mic still on (man)\n\nGo slow\nGo to the floor\nLet me see you shake ya tailfeather\n\nLet me see you take it\nGirl, go and take it off\nWe can even do it slow\nWe can even do it slow\nTake it where you want to go\nTake it where you want to go\nJust take that ass to the floor\nPop something move something\nShake ya tailfeather\n\nGirl, go and take it off\nWe can even do it slow\nWe can even do it slow\nTake it where you want to go\nTake it where you want to go\nJust take that ass to the floor\nPop something move something\nShake ya tailfeather", "image": "https://images.genius.com/8acc2c921ff6defb4a5463597263ff0e.750x750x1.png"}], "artist": "Nelly"}