{"songs": [{"title": "The Bristol Hotel", "album": "Bigger and Deffer", "year": "1987-05-29", "lyrics": "[Verse 1]\nI know a fat girl, she wears a orange skirt\nYou give her twenty dollars and you can do work\nShe'll take food stamps and a traveler's cheque\nBecause her hair and her face and her life's a wreck\nShe wears a bright blonde wig, some high heeled pumps\nShe's down in the dumps so she's sellin' her rump\nShe's a hot little momma and she works every day\nIf you wanna pay to play, here's where she stays\nShe's at the...\n\n[Chorus]\n(Bristol Hotel) Room 515\n(The Bristol Hotel) Where that at? (Jamaica, Queens!)\n\n[Verse 2]\nI seen her standin' there, slutty as could be\nOffering the putty for a itty-bitty fee\nEvery red light she'll come over to your ride\nOr she's standin' in the doorway tellin' you to come inside\nThe Bristol Hotel, 'cause it ain't no thing\nAnd her meat tastes better than Burger King\nJapanese executives in three-piece suits\nGlasses all foggy when they come in the place\nThe girlies in the Bristol, they're all in cahoots\nHe fell asleep and got robbed, and cold chumped his face at the...\n\n[Chorus]\n(Bristol Hotel) Room 515\n(The Bristol Hotel) Where that at? (Jamaica, Queens!)\n\n[Verse 3]\nParty people check the story 'cause the story is ill\nIt's the story of two men, one Harold, one Bill\nThey went inside the Bristol on a Saturday night\nHarold was cool but Bill felt uptight\nThe girlies made attempts but Harold played it cool\n\"Never ever rush, that's the golden rule\nI been comin' to the Bristol's ten years of my life\nA-yo, what the hell? Yo, man that's my wife!\"\n(The...)\n\n[Chorus]\n(Bristol Hotel) Room 515\n(The Bristol Hotel) Where that at? (Jamaica, Queens!)\n\n[Verse 4]\nYou see, a Bristol girl is a one of a kind\nAnd if you know her good enough she won't make you stand on line\nShe'll let you inside, make you pay for the ride\nTake off her pants and then it smells like somebody died\nYou say \"What the heck\", because you already paid\nNot knowin' that the guy that went before you had AIDS\nBang bang boogie, she was so amusin'\nNext week you're at the clinic gettin' blood transfusions\nAt the...\n\n[Chorus]\n(Bristol Hotel) Room 515\n(The Bristol Hotel) Where that at? (Jamaica, Queens!)\n\n[Outro]\n(The Bristol Hotel)\n(The Bristol Hotel)\n(The Bristol Hotel)\n(The Bristol Hotel)\n(The Bristol Hotel)\n(The Bristol Hotel)", "image": "https://images.genius.com/360d16b8aeb2fd205516a7b8c96f11b2.1000x1000x1.jpg"}], "artist": "LL Cool J"}