{"songs": [{"title": "I’m That N*gga", "album": null, "year": null, "lyrics": "[Intro: sample]\nI'm that nigga, I'm that nigga, I'm that nigga, I'm that nigga\n\n[Chorus: x4]\nAin't I clean? That machine, super cool, super mean\nI'm that nigga, I'm that nigga, I'm that nigga, I'm that nigga\n\n[talking over the Chorus: T.I.]\nYeah, so\nYou already know, Hey\nI'm the hottest nigga you done heard in a long time\nIntroducing you to the hottest nigga you heard in a long time\nHey\n\n[Verse 1: T.I.]\nMega pimp, super clean, the coolest in the universe\nNiggas hating on what he doing just mad cause they ain't do it first\nHis name pop up when you hit play or on your Google search\nBitches bow they head and bend they knees just like they do in church\nDrop dope into her purse before you get into her skirt\nShe agree to do the work before she get into the vert\nTill my pine box drop down into the dirt\nI'm a be by far the hottest nigga, known to the Earth\nIn the air, I fly, can't compare my\nSwagger to another rapper, don't you dare try\nAnyone with a pair of eyes can look and see\nNo legacy will ever be next to me or near by\nThough I invite you all to try, hey, I'm a fair guy\nJust approach with caution, be aware because I don't share my\nThrone, my crown I own\nHottest flow on any song, I'm on, I'm gone, nigga\n\n[Break: sample]\nI'm that nigga, I'm that nigga, I'm that nigga, I'm that nigga\n\n[Chorus]\n\n[talking over Chorus: T.I.]\nHey! B.o.B, you up next, baby!\nHey! Grand Hustle, nigga!\nIf I ain't the hottest nigga on the universe\nI guess I'll have to do until he gets here, nigga!\n\n[B.o.B:] Here I go!\n[T.I.:] Hey Call me a lie, nigga! Yeah\n\n[Verse 2: B.o.B]\nI'm that nigga that you heard about by word of mouth\nThey probably say I change the music in the dirty south\nNow that the word is out, the timing is perfect now\nTo take all of these hypocritical rumor and burn em down\nIf you observe the doubt, you'd see what they worried about\nThey say I sound like Dre when I'm rapping my verses now\nHonestly, I could give a fuck what you're blurting out\nPoint, blank, I'm in the game rocking my jersey now\nSo jazz it to me or pay me no mind\nEither way you're gonna be hearing me all of the time\nWhether on Greg Street or 107.9\nOr on your favorite rap blog on your favorite rap website\nAnd if that ain't right show me straight to the judge\nJust like Brian Nichols I ain't spitting nothing but slugs\nVenemous blood in my veins, chemicals up in my brain\nYes I resemeble a criminal, B.o.Bizzle, you ain't fucking with mayn\n\n[Break]\n\n[Outro: T.I. (B.o.B)]\nOkay, you got that (I'm gone, mayn\nI kinda, I kinda feel like I got you, man)\nHehehe (I had to kinda show you up, man\nI ain't really wanna make you look bad, really, honestly)\nAy, man, ay man that laughing, that laugh is natural\nBecause I'm literally amused by your sentiment\nI mean if you really feel that, know what I'm sayin\nThat the likes of the second verse can even\nSlighlty compare with the immaculence (Hahaha)\nThen I must take a chuckle... Hahaha\nYou know what I'm saying, but never no mind\n(We can have em blog about it)\nAbosulutely, man, I'll let you guys be the judge\n(You know you gonna do it anyway, fuck it)\nB.o.B or T.I.P. Know what I'm saying, you be the judge, dog\n(Which could be the better acronym for the song)\nBut you know what either way it's Grand Hustle!\nHahahaha (Ah-haha)\n\n[Chorus: until fade]", "image": "https://images.genius.com/3252379f345638f5b880f5055e0ca791.540x540x1.jpg"}], "artist": "B.o.B"}