{"songs": [{"title": "This is the Carter", "album": "Tha Carter", "year": "2004-06-29", "lyrics": "[Hook: Mannie Fresh]\nLadies and gentlemen, pimps and playas\nHalf-ass rappers and true rhyme sayers\nThis is the Carter, so hold onto your teenage daughter\nBecause this is the Carter, a lot more rich and a whole lot smarter\nWayne in ya brain, Young Carter\nWayne in ya brain, Young Carter\n\n[Verse 1: Lil Wayne]\nWho am I? Young Wizzle for shizzle\nFlow sicker than a third floor in hospitals\nMy charm Starburst, my watch Skittles\nI'm hot sizzle, \"what up, hot bizzle?\"\nHolla at a playa, I'm sorta like BD\nY'all can't stop my dribble, or block the lay-ups\nSoft top the coupe, mami pop her too\nDon't chase the feeling, baby girl, let it come to you\nRemove the ceiling on the girl, now she comfortable\nI'm a world-class G, mami, fuck wit dude\nI got \"La-Z-Boy bank\": that's comfort loot\nI'm a offensive coordinator, run and shoot\nYou watch your grill what you ought to do\nFore your ribs get barbecued\nAnd my ribs is showing I say I'm starving dude\nThis, this, this, this, this is the Carter dude\nWhat up Reel, c'mon\n\n[Hook]\n\n[Verse 2: Lil Wayne]\nI'm the Birdman, Birdman Jr. bitch\nI be high in the sky, shit on you and your bitch\nI be flyer than your guy you need to lose the prick\nNow if you follow everything, just grab a wing\nAnd we could shh\nAll the way down to the mall and bet I buy it all\nYoung Mar' picture the broad lick\nAll the way down to the balls then she wipe it off\nIf getting money is wrong I ain't right at all\nI Young Money a car, I just write it off\nI'm the boss of my own shit, I'm my own clique\nI would say \"fuck you\", but go and get your own dick\nGet your game up, boy, hustle harder\nThis, this, this, this, this, this, this, this, this\nGet your game up, boy, hustle harder\nThis, this, this, this, this, this is the Carter\n\n[Hook]\n\n[Verse 3: Lil Wayne]\nAnd y'all better blame Baby\nCause he's the muthafucka that made me, and I'm crazy!\nAnd y'all ask why I never left the Navy\nCause he's the motherfucka that pay me, is you crazy?\nYoung, Young, Young Wizzle, baby\nGive you your issue, Nina wanna kiss you\nNo, no, no, me no want no bullshit\nSo, so stop baller-blocking cause a nigga hood rich\nAnd I floss every day because I could bitch\nSo holla at your boy cause I'm still on some hood shit\nLike, like, like what's really good with your mom or your little boy\nAnd your sister looking good, shit, shit\nI'm still Apple Eagle Weezle\n1-7 Hollygrove, never ever leave you\nI got y'all waiting on my sequel\nThis, this, this, this, this, this is the Carter people\n\n[Hook]", "image": "https://images.genius.com/423c90e7f232e6d83a86b2645ff72b5c.500x500x1.png"}], "artist": "Lil Wayne"}