{"songs": [{"title": "Ricky", "album": "4/4 2", "year": "2016-01-30", "lyrics": "[Produced by Chopsquad DJ]\n\n[Intro: Meek Mill]\nChopsquad\nHow many of y'all niggas wanna go against me?\nWe kill all you mothafuckin' haters\nYou know how long it took me to get here and y'all niggas still talkin'?\nR.I.P. to Lil Snupe\n\n[Verse 1: Meek Mill]\nYou wanna see a dead body, come roll with Ricky\nMy wrist and neck cost a Bugatti, I'm smokin' sticky\nThey think I'm in Illuminati, thought that I was sinnin'\nShit, all them years that I was starvin', and now I'm filthy\nI wanna see my haters dead, talkin' bloody murder\nCause when it's beef I give 'em bread and make a fucking burger\nAnd every time I hear 'em shooting, I get fucking nervous\nWe put them Ghosts back to back, it look like fucking hearses\nKilling niggas, kill them all, funeral stickers\nLord please forgive them they not know what I do to these niggas\nBe with pirañas in the water to chew through these niggas\nThey killed my homie we came back and hit two of them niggas\n\n[Chorus: Meek Mill]\nLord, please forgive them they not know\nLord, please forgive them they not know\nLord, please forgive them they not know\nAnd when we hit them bless their souls\nThe devil coming  and I seen it\nWe fear Allah only I mean it\nAnd Inshallah my soul the cleanest\nCommitted sins and I redeemed it\nLord please forgive them they not know (we let 'em go if they not know)\nLord please forgive them they not know (we let 'em go if they not know)\nLord please forgive them they not know (we let 'em go if they not know)\nAnd when we hit them bless they souls (lord)\n\n[Interlude: Dex Osama]\nI done seen the motherfucking reaper standing over me\nMomma crying like \"You gotta change your life son. You got death on you and shit.\"\nI'm like, \"Damn!\" you hip?\nI'm like I'm about to die but I don't know when\nI just know I'm about to die soon, you hip?\nLike this motherfucker just came and gave me a visit\n\n[Verse 2: Meek Mill]\nLook in my eyes, what do you see?\nHeart of a killer I pull up they looking surprised, what could it be?\nIs it the money, the hoes, I'm feeling the vibe, I'm still in the streets\nAnd shoutout to niggas that's still on my side cause niggas capisce\nSo it's any means necessary, no love not in February\nThey gave my dawg life so he come home like a Nevuary\nWas never scary I hit the lights and say, Bloody Mary, Bloody Mary, Bloody Mary\nLately, I been lurking where the reaper creeping we been creeping\nHit a nigga 20 times, leave him sleeping, see him leaking, we the reason\nHe was fresh to death like it was Easter weekend\nMama selling dinner platters when that boy got hit with ladders\nNo insurance, no informants, close the case\nOpen casket I'm like how they closed his face\nAnd I got cake and I can't lie I cannot wait to stop back by and set y'all straight\n\n[Chorus: Meek Mill]\nLord, please forgive them they not know\nLord, please forgive them they not know\nLord, please forgive them they not know\nAnd when we hit them bless they souls\nThe devil coming and I seen it\nWe fear Allah only I mean it\nAnd Inshallah my soul the cleanest\nCommitted sins and I redeemed it\nLord please forgive them they not know (let them go if they not know)\nLord please forgive them they not know (let them go if they not know)\nLord please forgive them they not know (let them go if they not know)\nAnd when we hit them bless they souls", "image": "https://images.genius.com/7e3922db6d86c7ac9e703937f0053ae9.1000x1000x1.jpg"}], "artist": "Meek Mill"}