{"songs": [{"title": "Speedin’", "album": "Trilla", "year": "2007-10-16", "lyrics": "[Intro: Rick Ross]\nLegendary\nRunners\nYou know me\nTrilla\n\n[Verse 1: Rick Ross]\nEvery dollar that I count can't grow in my account\nMy account can't count up all my money in an hour\nCause it's comin' too fast and I'm scared it won't last\nLook that white girl in her face, told her this was her last dance\nGod damn, speed got my heart racin'\nSee I don't have the nominations you can blame it on my occupation\nCeasar salad, Caesar's Palace\nYou not a boss little nigga cause your cheese is average\nIn the Benz, AK ridin' shotgun\nIt's a Benz cause you're broke 'til you got one\nIt ain't nothin' do 100 in the Maybach\nThrowin' money out the roof motherfuckin' brake pads\n\n[Hook: R. Kelly]\nFast life, I live\nBig cars, big cribs\nSpeedin'\nI'm speedin'\nI can't stop it's all I know\nFrom a young'n I was taught get dough\nI'm speedin' (speedin')\nI'm speedin'\n\n[Verse 2: Rick Ross]\nSee people came lookin' for me, I got ghosts see the west coast\nClose and up in the Le Montrose\nBig money boss major\nAmerican Idol, I got fans like Fantasia\nRead between the lines or yo ass like fantasia\nGet hit between the eyes, he died, they can't save him\nIn the Porsche, I’m weavin', no coke, no coke but I’m speedin'\nStarin' at the skyline, I got a million on my mind, I'm the best\nAnd these pussy niggas runnin' out of time, Ricky Ross\nI'm the chill, quarter mill for the time piece\nYeah, I a bought a wheels like deals for the dime piece\n\n[Hook: R. Kelly]\nFast life, I live\nBig cars, big cribs\nSpeedin'\nI'm speedin'\nI can't stop it's all I know\nFrom a young'n I was taught get dough\nI'm speedin' (speedin')\nI'm speedin'\n\n[Verse 3: R. Kelly]\nSittin' in the living room watching the Grammys\nWishin' that was me that was on the Grammys\nAll I needed was someone to get behind me, money rain on me\nI was a determined lil nigga, dirty shoes and Hilfiger\nHomie help me out cause this boy is a drug dealer\nNow I'm flyin' high cause my gift grew wings\nAnd now I'm flyin' down like the cool crew winds\nKells and Ross on the Hollywood scene\nRed carpet and it's smellin' like green\nNow foss cause I got paid off\nCollabo was the hit hip-hop and R&B boss\n\n[Hook: R. Kelly]\nFast life, I live\nBig cars, big cribs\nSpeedin'\nI'm speedin'\nI can't stop it's all I know\nFrom a young'n I was taught get dough\nI'm speedin' (speedin')\nI'm speedin'\n\n[Outro: Rick Ross]\nWe fly I think somebody followin'\nWe hear the helipad with ya bitch\nYou worth fifteen million baby\nDon't try to blow it all in one week\nOverseas boss (I'm speedin' I'm speedin')\nI'm a fly away on you haters\nAnd I came up so fast, movies, endorsements, films\nWe own things, boss", "image": "https://images.genius.com/07098b42f0c14f8aef7c429e8453e786.600x600x1.jpg"}], "artist": "Rick Ross"}