{"songs": [{"title": "Alan Forever", "album": "DROGAS WAVE", "year": "2018-09-21", "lyrics": "[Intro: Lupe Fiasco]\n(Are you scared? Are you scared?)\nUhh, turn up, turn up\n\n[Verse 1: Lupe Fiasco]\nLet me flex, get up, brush sand off myself\nI was just holding my breath\nBlue shorts, red shirt, how I'm dressed\nI look fresh, and I feel\nBleeeeeeeeeeessed\nWhat's your name? My name Alan\nSounds like Aylan, I love smiling\nI got talents, I can do flips\nI can keep my balance, I love dancing\nMatter of fact, can I have one?\nRight now, y'all heard the man, lights out\nAnd the moon turns into a disco ball\nHeaven, better come and get your daughter\nWaltzing all on top of that water\nThen Whip, then Nae-Nae, then dip\nDown in my submarine\nI got a pair of seats\nRaise the periscope, to see parakeets\nAnd the dinosaurs don't be scaring me\nI got my own personal Dairy Queen\nSatisfaction is guaranteed\nI'm rather dashing, apparently\nGot an airplane too, won't you come fly through the air with me?\nBest thing of all\nMy mother says that I'm very sweet\nJonylah says \"It's all cool, but what about school?\nAnd ain't you Muslim? You can't talk 'til you marry me”\n\n[Chorus: Crystal Torres]\nThe waves can be your cover, the beach can be your pillow\nMy heart can be your house, my eyes can be your windows\nTo teach you how to swim and then we'll play Nintendo\nBeating all of your friends, dancing to the tempo\nGo Alan, go Alan\nGo Alan, go Alan\nGo Alan, go Alan, go Alan, go Alan\nGo Alan, go Alan, go Alan, go Alan, yeah\n\n[Verse 2: Lupe Fiasco]\nAnd they say, yeah (now entering)\nNow entering that Canadian Olympic swimming team\nAnd those medals are just glistening, so gold\nSo cold, yeah\nAnd Alan did the most, all those world records he broke\nThat's why his nickname is the lifeguard and my God is he dope\nMichael Phelps cannot believe it even though he is his coach\nHe might be the next Steve Zissou, or maybe Jacques Cousteau\nWhere he saw that little boy, go and fall off of that boat\nSo he jumped off in that water swam him right back to the shore\nNow ain't that wild, crowd goes wild\nLittle boy scared so the child won't smile\nSo Alan get a towel to dry him off and wipe him down\nPut an ice cream out, that's more his style\nFather runs down that beach\nSees his son just playin' in the sand\nHugs Alan who says he's a brave little man\nWalk away little boy, turns around and waves his hand\nCall Jonylah say, \"Guess what I did today?\nGot my rescue on saved a kid today\nHad my wet suit on and my fins today\nEven taught him next time how to swim away\"\nYou should really feel good that you gave your help\nMight get you into heaven, might raise your health\nMight get a lot of blessings, might raise your wealth\nBet you ain't even know that you saved yourself\n\n[Chorus: Crystal Torres]\nThe waves can be your cover, the beach can be your pillow\nMy heart can be your house, my eyes can be your windows\nTo teach you how to swim and then we'll play Nintendo\nBe with all of your friends, dancing to the tempo\nGo Alan, go Alan\nGo Alan, go Alan\nGo Alan, go Alan, go Alan, go Alan\nGo Alan, go Alan, go Alan, go Alan, yeah\n\n[Outro: Crystal Torres & Lupe Fiasco]\nThe waves can be your cover, the beach can be your pillow\nMy heart can be your house, my eyes can be your windows\nTo teach you how to swim and then we'll play Nintendo\nBe with all of your friends, dancing to the tempo\n(Are you scared?)\nGo Alan, go Alan\nGo Alan, go Alan\nGo Alan, go Alan, go Alan, go Alan\nGo Alan, go Alan, go Alan, go Alan, yeah", "image": "https://images.genius.com/86aa1a0cb9e9a473ce83eb531fa78079.500x500x1.jpg"}], "artist": "Lupe Fiasco"}