{"songs": [{"title": "SI Vs. Everybody", "album": "Meth Lab Season 2: The Lithium", "year": "2018-12-14", "lyrics": "[Intro: Apocalipps]\nLyrical terrorism\nYo, yo, yo, yo\n\n[Verse 1: Apocalipps]\nMe and my niggas, we comtemplate and puff sour\nHow we gon' crash an airplane into the Trump Towers\nFreedom of speech, go grab your heat, then pump showers\nDon’t want the money this time because I want the power\nFuck tracks, bust nuts through wack condoms\nCarried the staff for so long, think I got back problems\nFlow greasy, stack paper so easy\nThis little nigga stay here, open, like Cole Beasley\nI'm at an all time high, you can't stop the feelin’\nIf my success make you sick, here's some amoxicillin\nSix doses, beats is hypnosis\nMeth Lab is open, bitch, so get focused\nIt's big business, we sellin' them plants\nAnd nowadays I got more P's than Kerry Durant\nAnd all the smokers called it dope, so we gave it a stamp\nDispensaries got stripper poles in case you girls wanna dance\nOne thing you gon' know about Apocalipps (What's that?)\nFeel I take this whole shit 'cause I’m an optimist\nYou poppin’ shit, then pop a clip, get knocked then lock your lips\nAnd if you snitch I'ma hit you in your esophagus\nSo I don’t deal wit'chu Dave and Busters\nI got an angry little mob that'll smoke all of your dutches\nNow, keep hatin' thot, eat a sausage\nMinnesota or Cleveland, I’ma get love regardless\nAnd don't nobody get it confused\nIt's Staten Island vs. everybody this time, fool\n\n[Chorus: Iron Mic]\nYo, we the kings of New York where cash rules (Cash rules)\nIn this game called life, you can't lose (Can't lose)\nAnd don't nobody get it confused\nIt's Staten Island vs. everybody this time, fool (What up, what up?)\nYour better run the receipts, we pay dues (Pay dues)\nWe'll check SI live, we bad news (Bad news)\nAnd don't nobody get it confused\nIt's Staten Island vs. everybody this time, fool\n\n[Verse 2: Method Man]\nYeah, yeah\nMy game patient, it's complicated but so am I\nPatiently waitin', I Playstation, I'm so NY\nMy foul flavor, one word is blick and I'm fortified\nBig bully, Michael Jordan wearin' a forty five\nOne in his head, if he ain't dead, he borderline\nDope, every rhyme that I say, go 'head and snort a line\nSublime, if you didn't know I'm a water sign\nWhatever floatin' your boat, just know the water mine\nStick your toe in, the water's fine, I'm positive\nAnd I'm thinkin' positive but I'm thinkin' the problem is (What?)\nThat when I'm thinkin' 'bout opps, I'm thinkin' opposite\nPlus I still think I'm in my Prime 'cause I'm an Optimus\nMy clan on top of it\nGettin' poppin', we poppin' it\n'Cause in the spur of the moment wouldn't care, just pop a bitch\nMeth proposterous\nS-I, no stoppin' it\nAnd once we get the key to the City, boy, we lockin' it\n\n[Chorus: Iron Mic]\nWe the kings of New York where cash rules (Cash rules)\nIn this game called life, you can't lose (Can't lose)\nAnd don't nobody get it confused\nIt's Staten Island vs. everybody this time, fool (What up, what up?)\nYour better run the receipts, we pay dues (Pay dues)\nWe'll check SI live, we bad news (Bad news)\nAnd don't nobody get it confused\nIt's Staten Island vs. everybody this time, fool\n\n[Verse 3: Iron Mic]\nYo\nDon't ever lil' bro me, nigga, I'm big homie\nOn Deck like Inspectah, yup, the weapon on me\nDo not get confused, we just switched up the hustle\nProbably took you a minute to get it, all muscle\nHit that emoji, these rappers is phoney\nThey'll kill for some of this DNA, but you can't clone me\nThis is God given, hard livin', Mars' vision\nYou new niggas can't really rock to our rhythm\nNope, this is massacre music\nThis is Meth Lab, a death jab, let's back into it\nYou tired of the producers dancin' all in the videos (Then what?)\nThen come to Staten Island you little silly hoes\nThey see me go back, you see Sparks like Omillio\nYoung legend gettin' this young money, a milli, though\nAnd I don't throw shots, nigga, I shoot 'em\nI still white tee, Yankee hat and Timberland boot 'em (Let's go)\nThis is easy work\nProbably see me in the street promotin' peace, still do you greasy, jerk\nI been bangin' since Meth was on that stoop with Mary\nI was loungin' on the low when the hours were scary\nEverybody was choppin' back and forth 'cross the ferry\nThese bars are one on one, try not to compare me\n\n[Interlude]\nMeth Lab\nStaten Island vs. Everybody\nThere is no competition\n\n[Chorus: Iron Mic]\nWe the kings of New York where cash rules (Cash rules)\nIn this game called life, you can't lose (Can't lose)\nAnd don't nobody get it confused\nIt's Staten Island vs. everybody this time, fool (What up, what up?)\nYour better run the receipts, we pay dues (Pay dues)\nWe'll check S-I live, we bad news (Bad news)\nAnd don't nobody get it confused\nIt's Staten Island vs. everybody this time, fool", "image": "https://images.genius.com/ed8b9d6333cc29967da88416db3514c8.1000x1000x1.jpg"}], "artist": "Method Man"}