{"songs": [{"title": "U Can Call (Jazze Pha Remix)", "album": "Better Dayz", "year": "2002-11-26", "lyrics": "[Verse 1: 2Pac]\nDear baby you the picture of perfection\nStraight from your million dollar smile\nTo my attraction to your complexion\nNo hesitation needed; you got me\nInhalin' the aroma of your perfume, and feelin' heated\nI move closer to drop the lines of my introduction\nHold out my hand, and grab yo' hand, now we touchin'\nMy lyrics are poetry, so baby get a ticket to go with me\nThugged out so you notice me\nIt's a positive attraction; see pictures of us\nLayin' butt-naked on the beach kickin back relaxin'\nAnd only you can calm, the savage beast\nLook in my eyes are you surprised, that it's me?\nI wanna make you mine\nI'm kissin' on you tryin' to make it different every time (that's right)\nI'm so lonely in my bedroom, lookin' at the walls\nWithcha number in my hand, wonderin' should I even call her tonight\n\n[Hook: Jazze Pha & (2Pac)]\nAnytime you like, baby you can call me\nNeed a thug up in yo' life (call me thug)\nNever find nobody like me\nCause I know what you want (call me thug)\nAnd girl you know I got you\nYou got what I need (call me thug)\nAnd shorty it's all on you\nBaby call on me\n\n[Verse 2: 2Pac]\nBeen gettin' nuttin' but bad news, ever since the day you left me\nI sit and wonder is there a way, you could forget me\nRemember my phone calls, my late visits\nUs havin' breakfast in bed, then we straight kick it\nMe and you in satin sheets, 'til after two\nCome take a walk on the wild side, enjoy the view\nWhenever we collide; it's bound to be a pleasurable time\nMakin' love 'til the early light\nSweetheart don't fight the feelin'\nCome get a shot of this plain dealin' and concentrate on the ceiling\nIt's my intention to brush up\nBeware of the fireworks, cause every time we touch..\n.. it's bound to be, so relax, clown with me\nAs if you're down with me, get around and see\nThe brother with tattoos and no fears\nRunnin' my fingers through your hair\nIf you call me\n\n[Hook: Jazze Pha & (2Pac)]\nAnytime you like, baby you can call me\nNeed a thug up in yo' life (call me thug)\nNever find nobody like me\nCause I know what you want (call me thug)\nAnd girl you know I got you\nYou got what I need (call me thug)\nAnd shorty it's all on you\nBaby call on me\n\n[Verse 3: 2Pac]\nPardon me, but let's be specific\nBaby cause if you down with me, nigga we can kick it\nAnd let's take trips and ride airplanes\nA hundred thousand dollar car on dem gold thangs, so can you hang?\nCause we can be real tight (right)\nI got a big suite at the Hyatt , if it feel right\nMy only wish is to be witcha\nYou got me steady strivin' to getcha\nFantasizin' of friendly pictures\nThe pressure's gettin' major\nI wonder will you answer my call, if I page ya\nGot me goin' wild with anticipation\nFace to face with us locked up in strange places\nWhat will it take? cause the heartache be heatbreak\nIs my prediction when you falsify and start fake?\nIn my position I'm a careful man, but a player when I ball\nGot my eyes on you baby, can I call?\n\n[Hook: Jazze Pha]\nAnytime you like, baby you can call me\nNeed a thug up in yo' life, never find nobody like me\nCause I know what you want, and girl you know I got you\nYou got what I need, and shorty it's all on you\nAnytime you like, baby you can call me\nNeed a thug up in yo' life, never find nobody like me\nCause I know what you want, and girl you know I got you\nYou got what I need, and shorty it's all on you\nBaby call on me", "image": "https://images.genius.com/4f7dcd7bb697e66f11fe0520838cb066.1000x1000x1.jpg"}], "artist": "2Pac"}