{"songs": [{"title": "Haterade", "album": "The Appeal: Georgia’s Most Wanted", "year": "2010-09-28", "lyrics": "[Hook: Pharrell]\nWe've evolved from small to tall\nAnd shall not stall, been flying too long\nWhoa, whoa, whoa, whoa girl\nI be sippin' on haterade\nThat deep-down getcha paid\nIt tastes like lemonade\nScrunch your face when you see me paid\nI be sippin' on haterade\nThat deep-down getcha paid\nThat flavor is lemonade\nScrunch your face when you see me paid\n\n[Verse 1: Gucci Mane]\nI'm not listening, I'm not interested\nMy attention only focused on what I get\nDiamond’s glistening, they call me Mr. Check\nWhite ice lemonade, Black ice she thick\nI got general ambition, life's a bitch\nSo I treat it real good like hoes is squeezed\nMy whole life, I ain't never seen a car like that\nAnd she probably won't see the next shit I get\nAnd a seventeen fresh, I say I guess\nSuccessful, healthy, I live no stress\nSo today is the day that the big boy shine\nDrop tops everywhere, I wouldn't know how to rock\nGot the titties out today showing off tan lines\nBands bending in my pocket, no it's not drumline\nMe and Skateboard P in the club on time\nNo, not on time, but it just in time\n(It's Gucci!)\n\n[Hook: Pharrell]\n\n[Verse 2: Nicki Minaj]\nUh, yo, this one goes out to all of my critics\nDon't you feel stupid? Look how I did it!\nLook how it came to pass when I said it\nWe can do debit, cuz I don't need credit\nYes, I'm epic, look how I rep it\nIt's been eight years, but I broke the record\nYup, the record... yup, the record... yup, the record\n(Just for the record)\nUh, I'm all that I can be\nAnd I'll admit, I'm appalled when you envy\nCuz you can do it, too, and you can do it, too\nI just happen to be the girl that they threw it to\nSo I'mma bounce back, and I'mma ball out\nAnd every time that you see me I go all out\nAnd I'mma win till the ending\nDon't be mad when you see me transcendin'... Gucc!\n\n[Hook: Pharrell]\n\n[Verse 3: Gucci Mane]\nI ball hard, I should be in Sports Illustrated\nCooler than a motherfucka in a Porshe lemonade coupe\nPull up in a Ferrari in your hood, get intimidated\nMutilated, Maserati, Lamborghini (are) decapitated\nFeds investigation on what I accumulated, insinuated\nThat I'm not the man that I say I am\nLike I I give a damn\nBut I just run around town pickin' up stacks\nSome like Louis, some like Gucci\nI love money, ya I love solutions\nAnd my teenage karat ring, baby girl choosin\nAnd I ain't hard to please baby come choose me\nLounge around, round the town with the top chopped off\nYou can call it lost and found ’cause my top stay down\nAnd I ain’t seen a muthafucka since I bought this car\nI ain’t seen a muthafucka since I bought the car\nIt’s Gucci!\n\n[Hook]\n\n[Outro: Pharrell and (Gucci Mane)]\nYou know what I'm talkin' bout?\nGo and lift your glass, go and lift your glass\n(Let's think about the future and forget the past)\nEverybody just lift ya glass, go and lift ya glass\nIf a nigga kid hatin', tell 'em kiss ya ass)\nJust lift ya glass, go and lift your glass\n(Let's think about the future and forget the past)\nEverybody just lift ya glass, go and lift ya glass\nIf a nigga go hard, don't make me laugh, it's Gucci)", "image": "https://images.genius.com/0ad1fedc3017fe83eecd678c80831b9e.400x400x1.jpg"}], "artist": "Gucci Mane"}