{"songs": [{"title": "Mathematics (dirty)", "album": null, "year": null, "lyrics": "(Mos Def)\nBooka-booka-booka-booka-booka-booka\nHa hah\nYou know the deal\nIt's just me yo\nBeats by Su-Primo for all of my peoples, negroes and latinos\nAnd even the gringos\n\nYo, check it one for Charlie Hustle, two for Steady Rock\nThree for the fourth comin live, future shock\nIt's five dimensions, six senses\nSeven firmaments of heaven to hell, 8 Million Stories to tell\nNine planets faithfully keep in orbit\nWith the probable tenth, the universe expands length\nThe body of my text posess extra strength\nPower-liftin powerless up, out of this, towerin inferno\nMy ink so hot it burn through the journal\nI'm blacker than midnight on Broadway and Myrtle\nHip-Hop past all your tall social hurdles\nLike the nationwide projects, prison-industry complex\nBroken glass wall better keep your alarm set\nStreets too loud to ever hear freedom ring\nSay evacuate your sleep, it's dangerous to dream\nBut you chain cats get they CHA-POW, who dead now\nKillin fields need blood to graze the cash cow\nIt's a number game, but shit don't add up somehow\nLike I got, sixteen to thirty-two bars to rock it\nBut only 15% of profits, ever see my pockets like\nSixty-nine billion in the last twenty years\nSpent on national defense but folks still live in fear like\nNearly half of America's largest cities is one-quarter black\nThat's why they gave Ricky Ross all the crack\nSixteen ounces to a pound, twenty more to a ki\nA five minute sentence hearing and you no longer free\n40% of Americans own a cell phone\nSo they can hear, everything that you say when you ain't home\nI guess, Michael Jackson was right, \"You Are Not Alone\"\nRock your hardhat black cause you in the Terrordome\nFull of hard niggas, large niggas, dice tumblers\nYoung teens and prison greens facin life numbers\nCrack mothers, crack babies and AIDS patients\nYoung bloods can't spell but they could rock you in PlayStation\nThis new math is whippin motherfuckers ass\nYou wanna know how to rhyme you better learn how to add\nIt's mathematics\n\nChorus: scratched by DJ Premier (repeat 2X)\n\"The Mighty Mos Def..\"\n\"It's simple mathematics\" - Fat Joe\n\"Check it out!\"\n\"I revolve around science..\"\n\"What are we talking about here?\"\n\n.. \"Do your math\" - Erykah Badu (2X) ..\n.. \"One.. t-t-two.. three, four\" - James Brown ..\n.. \"What are we talking about here?\" ..\n\n(Mos Def)\nYo, it's one universal law but two sides to every story\nThree strikes and you be in for life, manditory\nFour MC's murdered in the last four years\nI ain't tryin to be the fifth one, the millenium is here\nYo it's 6 Million Ways to Die, from the seven deadly thrills\nEight-year olds gettin found with 9 mill's\nIt's 10 P.M., where your seeds at? What's the deal\nHe on the hill puffin krill to keep they belly filled\nLight in the ass with heavy steel, sights on the pretty shit in life\nYoung soldiers tryin to earn they next stripe\nWhen the average minimum wage is $5.15\nYou best believe you gotta find a new grind to get cream\nThe white unemployment rate, is nearly more than triple for black\nSo frontliners got they gun in your back\nBubblin crack, jewel theft and robbery to combat poverty\nAnd end up in the global jail economy\nStiffer stipulations attached to each sentence\nBudget cutbacks but increased police presence\nAnd even if you get out of prison still livin\nJoin the other five million under state supervision\nThis is business, no faces just lines and statistics\nFrom your phone, your zip code, to S-S-I digits\nThe system break man child and women into figures\nTwo columns for who is, and who ain't niggas\nNumbers is hardly real and they never have feelings\nBut you push too hard, even numbers got limits\nWhy did one straw break the camel's back? Here's the secret:\nThe million other straws underneath it - it's all mathematics\n\nChorus\n\n{closing scratch} \"Mathematics..\"", "image": "https://images.genius.com/4d1a9757d430776710118a3e0ba4658f.1000x667x1.jpg"}], "artist": "Yasiin Bey"}