{"songs": [{"title": "The Way I Am", "album": "The Marshall Mathers LP", "year": "2000-05-23", "lyrics": "[Segue from \"Steve Berman (Skit)\"]\n...Man, whatever\n\n[Intro]\nDre, just let it run\nAyo, turn the beat up a little bit\nAyo\nThis song is for anyone...\nFuck it, just shut up and listen\nAyo\n\n[Verse 1]\nI sit back with this pack of Zig-Zag's and this bag\nOf this weed, it gives me the shit needed to be\nThe most meanest MC on this... on this Earth\nAnd since birth I've been cursed with this curse to just curse\nAnd just blurt this berserk and bizarre shit that works\nAnd it sells and it helps in itself to relieve\nAll this tension, dispensin' these sentences\nGettin' this stress that's been eatin' me recently off\nOf this chest and I rest again peacefully (Peacefully)\nBut at least have the decency in you\nTo leave me alone, when you freaks see me out\nIn the streets when I'm eatin' or feedin' my daughter\nTo not come and speak to me (Speak to me), I don't know you\nAnd no, I don't owe you a motherfuckin' thing\nI'm not Mr. N'Sync, I'm not what your friends think\nI'm not Mr. Friendly, I can be a prick\nIf you tempt me, my tank is on empty (Is on empty)\nNo patience is in me and if you offend me\nI'm liftin' you ten feet (Liftin' you ten feet) in the air\nI don't care who was there and who saw me just jaw you\nGo call you a lawyer, file you a lawsuit\nI'll smile in the courtroom and buy you a wardrobe\nI'm tired of all you (Of all you), I don't mean to be mean\nBut that's all I can be, it's just me\n\n[Chorus]\nAnd I am whatever you say I am\nIf I wasn't, then why would I say I am?\nIn the paper, the news, every day I am\nRadio won't even play my jam\n'Cause I am whatever you say I am\nIf I wasn't, then why would I say I am?\nIn the paper, the news, every day I am\nI don't know, that's just the way I am\n\n[Verse 2]\nSometimes I just feel like my father, I hate to be bothered\nWith all of this nonsense, it's constant\nAnd, \"Oh, it's his lyrical content\nThe song 'Guilty Conscience' has gotten such rotten responses.\"\nAnd all of this controversy circles me\nAnd it seems like the media immediately\nPoints a finger at me (Finger at me)\nSo I point one back at 'em, but not the index or pinkie\nOr the ring or the thumb, it's the one you put up\nWhen you don't give a fuck, when you won't just put up\nWith the bullshit they pull, 'cause they full of shit too\nWhen a dude's gettin' bullied and shoots up his school\nAnd they blame it on Marilyn (On Marilyn) and the heroin\nWhere were the parents at? And look where it's at!\nMiddle America, now it's a tragedy\nNow it's so sad to see, an upper-class city\nHavin' this happenin' (This happenin') then attack\nEminem 'cause I rap this way (Rap this way) but I'm glad\n'Cause they feed me the fuel that I need for the fire to burn\nAnd it's burnin', and I have returned\n\n[Chorus]\nAnd I am whatever you say I am\nIf I wasn't, then why would I say I am?\nIn the paper, the news, every day I am\nRadio won't even play my jam\n'Cause I am whatever you say I am\nIf I wasn't, then why would I say I am?\nIn the paper, the news, every day I am\nI don't know, that's just the way I am\n\n[Verse 3]\nI'm so sick and tired of bein' admired\nThat I wish that I would just die or get fired\nAnd dropped from my label, let's stop with the fables\nI'm not gonna be able to top a \"My Name Is\"\nAnd pigeon-holed into some poppy sensation\nTo cop me rotation at rock 'n' roll stations\nAnd I just do not got the patience (Got the patience)\nTo deal with these cocky Caucasians\nWho think I'm some wigga who just tries to be black 'cause I talk\nWith an accent and grab on my balls so they always\nKeep askin' the same fuckin' questions (Fuckin' questions)\nWhat school did I go to, what hood I grew up in\nThe why, the who, what, when, the where and the how\n'Til I'm grabbin' my hair and I'm tearin' it out\n'Cause they drivin' me crazy (Drivin' me crazy), I can't take it\nI'm racin', I'm pacin', I stand and I sit\nAnd I'm thankful for every fan that I get\nBut I can't take a shit in the bathroom without\nSomeone standin' by it! (Standin' by it) No, I won't sign your autograph\nYou can call me an asshole, I'm glad\n\n[Chorus]\n'Cause I am whatever you say I am\nIf I wasn't, then why would I say I am?\nIn the paper, the news, every day I am\nRadio won't even play my jam\n'Cause I am whatever you say I am\nIf I wasn't, then why would I say I am?\nIn the paper, the news, every day I am\nI don't know, that's just the way I am\n\n[Produced by Eminem]", "image": "https://images.genius.com/ca3357132f02edd39e06bee2441ba569.1000x1000x1.png"}], "artist": "Eminem"}