{"songs": [{"title": "Zimzallabim", "album": "The New Danger", "year": "2004-10-19", "lyrics": "[Intro]\nYeah\nGive it to 'em\nYes,yes,yes,yes,aha ah!\nGhetto people..this one's for you\nAnd you and you and you\nAnd you and you in the front\nYo!\nJack Johnson (aha) live and stompin\nUndisputed heavyweight champ (aha) of the world\n\n[Verse 1]\nYo I'm live with it, low, middle, the high with it\nAnd that's how I'mma live and die with it\nAll up and down your spine with it, Like Zimzallabim\nJack Johnson, yes my dog, right with them!\nThe most special, most ghetto, most method, most valuable\nRep my avenue like is the damn state capital\nComing shadows to mind, a better mark of rapeness\nOn slaves who high jacked the slave ships\nThe hackers who remapped the matrix, and built the road back to basics\nAnd getcha all off that strain shit\nYou know this other cats run game with, it's tainted\nConsider this the moment that changed it: NOW!\nJack john's stand strong never bow down\nBack off or get clapped dog right about POW\nFrom east to the west,up north to down south\nWe show you how to REALLY make moshpit bounce\nShow you how the gritty make the ghetto wild out\nFirst letters that I wrote when I sketch the script down\nI'm LIVE WITH IT, low, middle, the high with it\nAnd that's how I'mma live and die with it, I shine with it\nRhyme with it, reveal and recognise with it\nThe ghetto know what time is it, when I spit it\nMe 9-semi, an iron lion strike with it\nSee Dr. Know string a knot and make 'em ride with it\n\nAnd look alive\nGhetto rock with me\nLook alive\nGhetto rock with me\nAha yeah\nThrow it up\nGhetto rock with me\nShow it up\nGhetto rock with me\n\n[Verse 2]\nBorn to rock, since my pawn shift rise (??)\nRock the booze water on any bully on your block\nMy flow tighter than a big titties halter top\nDoper than a floyd flake that they bought they pops\nSince I bright a con duke of course I'm not\nMy sharp mind join the dots and blow they plots\nA lot of cats talk noise a lot, but then the noise is stopped\nWhen the heavy sound voice in charge\nAnd this is no limp bizkit this is jack's fat cock\nLoaded up slightly back, ghetto black rock\nBrooklyn got bomb-rush that you can't stop\nThese the hungry hands that gon snatch your cash box\nI never gave a second thought to fucking with y'all\nCuz my first thought covered it all: YOU WHACK!!!\nAnd I don't care what you sound since not mumblin y'all\nCause you can't do me nothing at all\nWhich means, you can't shine my shoes wash my drawers\nClean my car walk my dog mow my lawn\nIn other words dude I don't need SHIT from them\nAll I got is hard rhymes and hot spit for them\nAnd yeah, I got the country new (raaatttttt) for them\nSee how dark it can get for them? Tell their mommas THAT'S IT for them\nGet the flowers, they'll sing for them\nA sad story how it'll end for them\nThat's what you get for not listenin' FIRE!!\nAnd a long verse of kumbayah, You stand strong you can't move higher\nYou move in \"how we all can move higher?\"\nReady to roll like new tire\nWell I can show you who the true lion\nTrue power move quiet thru the understandin of the science\nWe live with it, no middle, the high with it\nAnd that's how we gon live and die with it, now ride with it!\n\n[Outro]\nYeah, ghetto rock with me\nGhetto rock with me\nGhetto rock with me\nGhetto rock!! Ghetto... MOTHERFUCKERS!\n\nFreaky radio!", "image": "https://images.genius.com/338419572381e746b5f1aa0866d2d857.596x596x1.jpg"}], "artist": "Yasiin Bey"}