{"songs": [{"title": "I Can’t Be Your Man", "album": "I’m Serious", "year": "2001-10-09", "lyrics": "[Intro]\nYeah\nTo the ladies\nOne mo' message from T.I.P.,\nI represent every man in America... Naw, the world\nYou wanna know what he what he\nThinkin' bout when he ain't\nTalkin to you bout why he can't\nBe your man you sure you wanna know\nHere it is...\n\n[Verse 1]\nMy girl say I don't love her\nShe say we just fuckin'\nNothin' against you\nIt's just that I hate tux\nShe wanna toast with the Mo' and the ice\nThrowin' the rice\nWake up with me for the rest of your life\nAsk me where I'm going, when I'm comin back when I bounce\nRunnin her mouth, call herself the queen of the south\nRedecorate the crib throwin satin on the couch\nCatch me out adulteratin' takin' half of the house\nWell it ain't she don't deserve it\nJust I don't wanna give it\nThe life she wanna live\nShorty I don't wanna live it\nMakin' money shorty's missin'\nTo all kind of digits\nFrom KeKe's to Chaniques's\nTo Bianca's and Brigettes's\nPoppin' up unannouced, shorty call 'fore you visit\nNothing about a number, mind your goddamn business\nLook bitch, some shit bout Tip won't change\nWe can hang, but I got to let you know one thang\n\n[Hook]\n(I can't be your man)\nIt ain't you it's me, sorry shorty\n(I can't be your man)\nWhere I been, I don't see no rings on these fingers\n(I can't be your man)\nLook to the future, find someone better than me\n(I can't be your man)\nYou deserve much more, I'm no good to you shorty\n\n[Verse 2]\nDon't it seem like shit be cool for a month and a half\nAll of a sudden you frontin' and showin your ass\nComplainin' bout what you got\nShorty look what you had\nBefore me, it was pull-out couches and Bilitant bags\nNow she mad cause she ain't got a T.V. in her Jag\nI tell you what if that ain't good enough get back on the bus\nGive up the princess cuts and the Prada and stuff\nI take you out to eat and you order a bottle of what?\nUngrateful wonderin' why I'm not faithful\nBallin's all good but this shit is just wasteful\nWant me to pay your bills\nHelp you get a bigger crib\nShorty I don't mind helpin'\nBut show some initiative\nAin't brought nothin' to the table but hard times and heartache\nDo something, get on the grind for God's sake\nA reminder, rewind this message from your highness\nFor those that chose to take my kindness for blindness\n\n[Hook]\n(I can't be your man)\nI don't cheat cause I ain't shit\nI cheat cause you ain't shit\n(I can't be your man)\nEvery time I walk in the house you sittin' on that goddamn couch\nYou ain't got nothing better to do\n(I can't be your man)\nCook, clean, iron, pay the water bill, shorty do something\nWork with me\n(I can't be your man)\nAy, pack you shit shorty, I'm droppin yo ass off at yo mami house right now\n\n[Verse 3]\nOne more scenario\nBout another jazzy ho\nThat I met on the road\nAfter a show in Ontario\nShorty say she got a man\nThat don't really scare me though\nBut she say he got a temper\nSo, but what he jealous for\nCause you told him you were cheatin\nHell, well what you tell him for\nShit, what that got to do with Tip\nYou better let him know\nNow she want to let him go\nBut what for\nSo you can get with me and keep being a slut ho\nI don't think so\nBaby better stay where you at\nI'm no good for you\nNever mind the way that he act\nYou got a kid and a crib with him\nWhat's better than that\nI'm in town for the week you better settle for that\n\n[Outro]\n(I can't be your man)\nI'm here for 4 days shorty, 4 days\nI can't change the world\n(I can't be your man)\nHe don't treat you right?\nWhat that gotta do with me?\n(I can't be your man)\nHe be cussin' you out and shit\nYou cheated on him shorty, can you blame him?\n(I can't be your man)\nYou ain't fend to bring that bullshit to me\nI don't want naan parts of it\n(I can't be your man)\nLook here man\nGet that shit out of my face\nKick rocks\n(I can't be your man)\nI ain't fend to have nothing to do with it\nTheir will be none of that round here\n(I can't be your man)\nBesides shorty you talk to much\nI can't deal with it\n(I can't be your man)\nYou say you work where?\nMickey D's, get the hell out of here shorty\nMan look ay, I can't deal with it\nYou got too much baggage with you man\nYou and little, uh,uh,uh little Opus Cunningham\nY'all kick rocks down the damn street\nI can't deal with it shorty\nN...,complain...,what..., you ain't got what?\nShorty when I met you shorty you was barefooted\nSittin' on the railroad track with some straw in yo mouth\nWhat the hell you complainin' about what you got now\nWh-Wh-What nigga you got steak and eggs right here\nI'm sayin, what the business is?\nGet the hell out of here man\nAy man you need to show me some appreciation round here\nYou in the damn living room more than the muthafuckin' furniture shorty\nI can't deal with that shit man\nGet a damn job\nDo something for me\nLazy bitch, All the bad bitches in the world and I had to hook up\nWith the sorriest hoe in America\nWhy don't you take the weight off my back every now and then\nWhy don't you pay a bill\n30 damn dollars, the cable bill ain't but 30 damn dollars shorty\nWhy don't you change the..., flip the mattress\nMan wash some clothes, change a light bulb\nGoddamn shorty, I gotta do every thing round this sumabitch\nA lazy bitch, ain't nothing worse than a lazy bitch shorty wasted talent", "image": "https://images.genius.com/d4010b5f2aa7374582fd8c3be5913af3.1000x1000x1.jpg"}], "artist": "T.I."}