{"songs": [{"title": "Illegal Search", "album": "Mama Said Knock You Out", "year": "1990-08-28", "lyrics": "Yo baby\nPut your seatbelt on\nI got my paperwork, don't worry\nIt's cool\n\n[The Flex]\nIllegal search\n\n(Do you wanna see it?)\n\n(I'm gonna do it)\n\n[Verse 1]\nWhat the hell are you lookin for?\nCan't a young man make money anymore?\nWear my jewels and like freak it on the floor\nOr is it my job to make sure I'm poor?\nCan't my car look better than yours?\nKeep a cigar in between my jaws\nI drink champagne, to hell with Coors\nNever sold coke in my life, I do tours\nGet that flashlight out of my face\nI'm not a dog, so damn it, put away the mace\nI got cash and real attorneys on the case\nYou're just a joker perpetratin a ace\nYou got time, you wanna give me a taste\nI don't smoke cigarettes, so why you're lookin for base?\nYou might plant a gun, and hope I run a race\nEatin in the messhall, sayin my grace\nYou tried to frame me, but it won't work\nIllegal search\n\n[The Flex]\nKeep on searchin\n\n[L.L. Cool J]\nI'm totally relaxed\n\n[The Flex]\nIllegal searchin\n\n[L.L. Cool J]\nIllegal search\n\n[The Flex]\nKeep on searchin\nKeep on searchin\nKeep on searchin\nGotta, gotta, gotta...\n\n[Verse 2]\nI call it nice, you call it a 'drug car'\nI say 'disco', you call it a 'drug bar'\nI say 'nice guy', you call me Mr. Good Bar\nI made progress, you say, \"Not that far\"\nI just started it, you're searchin my car\nBut all my paperwork is up to par\nIt's in my Uncle's name, so the frame won't work\nChump - illegal search\n\n[The Flex]\nKeep on searchin\n\n[L.L. Cool J]\nIllegal search\n\nYou won't find nothin\n\n[Verse 3]\nOn the turnpike, and everything's right\nIn the background is flashin lights\nGet out the car in the middle of the night\nIt's freezin cold, and you're doin it for spite\nSlam me on the hood, yo, that ain't right\nYou pull out your gun if I'm puttin up a fight\nMy car, my clothes, and my girl is hype\nBut you wanna replace my silver stripes\nYou're a real man, your uniform is tight\nFingerprint me, take me name and height\nHopin it will, but I know it won't work\nIllegal search\n\n(Do you wanna see it?)\n\n[L.L. Cool J]\nHey yo, Marley\nGet funky\n\n[The Flex]\nIllegal illegal illegal search\n\n[L.L. Cool J]\nReal funky\n\n(I'm gonna do it for ya)\n(I'm gonna do it)\n\n[L.L. Cool J]\nKeep it right there\nFunk it up\n\n[Verse 4]\nI wore a suit to court, the case got thrown out\nI'm that man that you all read about\nPut me in jail, you're doin it for clout\nI only got one question: what's that all about?\nJail is somethin that I can do without\nCase dismissed, and now you wanna pout\nYou feel like tryin it again, but you know it won't work\nIllegal search\n\n[The Flex]\nKeep on searchin\n\n[L.L. Cool J]\nIllegal search\nBut I got all my ID, and my car's registered\n\nIllegal searchin\nIllegal search\n\nAnd them cops out there\nThat did the wrong thing to one of my brothers\nIn Jersey\nKeep on searching\nYouknowmsayin?\nCause that was foul\n\nPeace", "image": "https://images.genius.com/22e65b653eb6ded3289c8de99a5e66f7.1000x1000x1.jpg"}], "artist": "LL Cool J"}