{"songs": [{"title": "The Pen and The Needlz", "album": "Fahrenheit 1/15, Part I: The Truth Is Among Us", "year": null, "lyrics": "[Lupe talking]\nGrew up in Chicago, West side, gang lifestyle, the drug scene, the whole.. it's like one whole universe of insanity\n\n[Verse 1]\nBefore I start, like to make sure I’m smart\nGather my composure, rather my swagger and my culture\nPivot my fitted, then begin to rivet, with a change of lyric\nIn other words, I reposition how I sit it\nThen make you feel it like I mispronounced \"filet\"\nOn second thought, I can't make you fill it\nLike you digging your own grave, unless you can Kill Bill it\nA night of the living passed away\nCan you dig it? Why Emcee? Hey\nI do it for my village\nThe pennin' is John Lennon, the beat is the Beatles\nGo together like Lenin and the people\nIn some fresh linens and some John Lennon’s fresh outta Seagle's\nThe pen and the needles...\n\n[Writing and mumbling upcoming verse]\n\n[Verse 2]\nI'm back at cha, and I Pac like cap backwards\nLike a hat's backwards, you know, when the bats backwards\nYeah, like a bat catchers\nThe law gotta long arm like a back scratcher\nBut before I leave mine at home\nLike a bad catcher, I think about my zone\nWhere pimps make scratch off the track like a DJ\nEasy, that’s my zone rappers\nIt's my deck\nAnd if I catch u set trippin’ wit my cassette sittin’ in a zone rappers:\nIt's not a threat\nCuz it'll span ya where I roam rappers, where I hone my skills\nThey wanna send me back home the devil, is on my heels\nThe writing is Sting, liken the sequences, the Police, I repeat\nWe go together like the Beauty and the Beast\nWriting is in my veins;\nThe ink is the diesel, the pen and the needles…\n\n[Writing and mumbling upcoming verse]\n\nThe word is mightier than the sword\nAnd my serve is tightier than yours\nLike year in St. Louis ya whole flow\nI fear I sank through it...\nIt all became clear\nLike a paramedic with an electric chest kit, YEAH\nThe gravity of the vocabulary is a caliber equal to Excalibur\nSwung wit the grace of Agassi in his amateurs, THERE\nThere was a deeper depth, don't know how I got here\nI also had a hole in my flow\nIt appears I sank to it...\nMy swing, it couldn’t be seen\nI apply some paint to it, the invisible man\nWrapped in bandages, in critical, CLEAR\nThe scriptin' of Scorsese the score is Count Basie\nWe go together like, the original and the sequel\nThis is the end of the trilogy, ya feelin’ me?\nThe pen and the needles...", "image": "https://images.genius.com/9922f7078ce1f910a0541c33e13cce5b.500x500x1.png"}], "artist": "Lupe Fiasco"}