{"songs": [{"title": "Pimp Juice", "album": "Nellyville", "year": "2002-06-25", "lyrics": "[Intro]\nOne pound for the ho, that's all we need baby\nJust one for the house.. (whoa, whoa, whoa, whoa) c'mon\n\n[Hook]\nPimp juice - hoooooooooh-ooooooooh-hoooooooo\nI think I need to let it loose (might think I need to let it loose)\nLet her loose, let her loooooose\nShe only want me for my pimp juice (that's all she want me for f'real)\nNot my pimp juice, I'm talkin new pimp juice\nI think I need to cut her loose (it's time for homegirl to recognize)\nYes I do, yes I doooooo-hoooo\n\n[Nelly]\nI'm in that, seventy-four, Coupe DeVille\nWith the, power seats, leather, wood on my wheel\nOne-touch sunroof BUT leave it alone\nHoes see it can't believe it - \"It's goin back on it's own\"\nOooooooooooooooh, shit, that's how we do it baby\n\"Every day like this?\" Seven dayy-ayyys\n.. I tell you three-sixty-five\nWinter spring and fall, in the summer we ride\nYou actin like you never seen it befo'\nLike them country boys ain't got no dough\nBitch please - GET IN - but don't you slam that do'\nDUST YOUR SHOES OFF - befo' you touch that flo'\nCause you wanna put your feet on my rug, don'tcha?\nYou really wanna put your feet on my rug, don'tcha?\nYou're in a hurry - SLOW DOWN - and I might letcha touch it\nYou ain't from Russia, so bitch why you Russian?\n\n[Hook] w/ minor variations\n\n[Nelly]\nNow I'm - clean as a whistle (yeah) sharp as a razor (uh-huh)\nIn anythang from Timberland to Gators\nNow listen - I play the haters (ooh) like they should be played\nAnd uhh - I love the ladies (ooh) like they should get laid\nThat's why I - I got my fade everybody had braids\nAnd now they - switch to fades and I'm thinkin 'bout braids\nJust an example of pimp juice jackin\nIf we were hoopin, I'd be yellin \"They hackin\"\nI see you momma, in my Dolce Gabbana\nGucci and Prada baby I gotta lotta\nThe lucciana ain't a problem for poppa\nThat's all you want then baby girl I'mma holla\nCause you wanna put your feet on my rug, don'tcha?\nYou really wanna put your feet on my rug, don'tcha?\nYou're in a hurry - SLOW DOWN - I don't like how you actin\nTreat you like you're from Milwaukee, send you Green Bay Packin\n\n[Hook] w/ minor variations\n\n(I think I just..\nNeed to take this time and explain to 'em exactly..\nWhat the pimp juice is)\n\n[Hook]\nUh, hear me out now\nNow your pimp juice is anything, attract the opposite sex\nIt could be money, fame, or straight intellect\nIt don't MATTER! Bitches got the pimp juice too\nCome to think about it - dirty, they got mo' than we do\nThey got mo' - juice in they talk, got mo' juice in they walk\nThey got mo' - juice in they veins, OOH GOD DAMN!\nI tell you man it's a cryin shame..\n.. how people use, the juice in vein - you hear me mayne\nPimp juice is color blind\nYou find it work on all color creeds and kinds\nFrom ages 50 right down to 9\nThe Mayor of Nellyville and I won't resign, watch me recline\nCause you wanna put your feet on my rug, don'tcha?\nYou really wanna put your feet on my rug, don'tcha?\nYou're in a hurry - SLOW DOWN - bitch I got all night\nMatter fact, stand on my left boo - I know you ain't right\n\n[Hook] w/ minor variations\n\n[Ad libs to end]", "image": "https://images.genius.com/ee6c6181ebd522da5b345ff9cd0a61f9.1000x1000x1.jpg"}], "artist": "Nelly"}