{"songs": [{"title": "Don’t Stop", "album": "Tha Blue Carpet Treatment", "year": "2006-11-21", "lyrics": "[Intro: Snoop]\nYou in the War Zone\nHa ha, yeah, uhh.. THX, uh, uh\nI wanna go universal one time man\nI wanna talk to the whole world man\nCause, cause I know niggas\nI know niggas feel this shit man, e'rywhere man\nDon't matter where you at you gotta feel this cuz\nTrip\n\n[Hook: Snoop Dogg]\nIf you see the police - don't stop!\nYou got your heat on the seat - don't stop!\nMy nigga ball 'til you fall - don't stop!\nAnd break a bitch like a law - don't stop!\nMy nigga get yo' cash - don't stop!\nOh, you keep the stash in the dash? Don't stop!\nOh, you like to scrape and crawl? Don't stop!\nWell, we do it with no breaks at all - don't stop!\n\n[Kam]\nYeah, okay, yeah - don't stop, don't quit\nYou don't wanna get dropped? Don't pop no shit\nI'm tellin niggas now, off top, real spit\nLike it or not, we who you got to deal wit\n\n[MC Eiht]\nGeah - we at your service\nYou in the War Zone now so don't be nervous\n... And it don't stop\nEverybody drop shit bottom to the top\n\n[Goldie Loc]\nUhh, they want me to stop cause I been goin hard on them lately\nAnd I feel raising my right hand sayin, \"Motherfucker don't make me\nSlap ya ass for not bringin back the cash\nNow do it with no breaks trick and get it real fast\"\n\n[Kurupt]\nOne of you niggas gon' feel these bullets\nSix cannons, loaded, cock and pull it\nWest gang, ridin out that's all we do\nWest gang nigga I ain't gotta explain it to you\nLet's bang\n\n[Kam] + (Snoop)\nYeah, if you gettin down to the sound (don't stop!)\nIf you gotta dump a few rounds (don't stop!)\nIf some punk clown flags you down (don't stop!)\nIf you don't come from the town (don't stop!)\n\n[MC Eiht] + (Snoop)\nIf you tryna hang with the gang (don't stop!)\nIf you makin money tryna slang (don't stop!)\nIf the neighborhood's where you hang (don't stop!)\nIf bustin shots is yo' thang (don't stop!)\nGeah\n\n[Kurupt]\nLook - what'chu tryna do my nigga?\nE'rything you talkin 'bout I been through my nigga\nI'm original, busta I'm a D.P.G\nWar Zone motherfucker in the midst of the streets (nigga)\n\n[MC Eiht]\nGeah, you get it and go\nWhen the boys roll past, you're lettin 'em know\nHeat in the waistband, gang of tattoos\nCompton, Eiht don't stop for you fools\n\n[Goldie Loc]\nWon't stop learnt it on 'em, I gotta eat chief\nNow getcha ass in my way, I'm snatchin you up by your lil' briefs\nNow rock twice and do your hand like this\nIf you not then stop representin this gangsta shit\n\n[Kam]\nSo we bangs the clip, the main West G spot\nCompton, Long Beach, S.E. Watts\nWhere niggas is more sick, more dumb, more gone\nTrick, you know where I'm from, the War Zone\n\n[Hook]\n\n[Snoop Dogg]\nDon't stop, don't stop!\nDon't stop, don't stop, don't stop!", "image": "https://images.genius.com/9eeff8d4aa3579798c6d6f74d21fad47.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}