{"songs": [{"title": "Dinero", "album": "The Compound Gold Project", "year": "2016-07-19", "lyrics": "[Intro: Jadakiss + Beanie Sigel]\nWelcome back Beans, this history baby\nBroadstreet bully set free\nCompound, compound\nTop 5 dead or alive, raspy\nAnd it's a shame what they'll do for that legal tender\n\n[Verse 1: Beanie Sigel]\nMoney is the root of all evil is what they teach you\nThat's what made Nino rock his brother's keeper\nThat's what made Alpo slaughter Rich Porter\nWhen you got a big supporter and your mafia tight\nMoney, power, respect, comin' at order\nDollars ain't shit without the knowledge\nMike got robbed, I robbed him\nHammer got hammered, too much stylin'\nToo many cars in the garages\nToo much flauntin', 100 man entouragin'\nIf money make your world go around, you got a problem\nBut let's make no mistake, let's get it straight\nI've done seen paper take mothers off section 8\nThey say the early bird get the worm\nSo I left home to earn\nAnd left no stone unturned\nAs a young buck I hit the bricks, took the street route\nY'all dudes are still in the nest with your beak out\nWhoever learned you dudes is incorrect\nCause I don't trust no chick, mom no disrespect\nAnd you done wiped my ass and I done fed off your breasts\nIf you dealin' them cards boo I'm cuttin' the deck\n\n[Interlude]\nSo you think money is the root of all evil? Have you ever asked what is the root of money? Those pieces of paper which should have been gold should are a token of honor\n(Jadakiss: That's why they love you when you don't got it\nThen soon as you get it they hate you)\n\n[Verse 2: Jadakiss]\nHaha!\nAll four pockets, bankrolls that can't be tucked\nIt's strange I done seen money break families up\nFor 500 cash even seen your man get cut\nPostin' pictures on the 'Gram all bandaged up\nIf you do get it, don't take it for granted bruh\nThe counters are all marble and granite bruh\nIf it's done right you can get a flower from a seed\nAnd the root of money is power for more greed\nSad part about it, it's somethin' we all need\nI know ex-kingpins that's working at Wal-Greens\nKnow a team of young swipers, shake up the mall scene\nAnything to get the money, they need it like morphine\nThey give you lump sums then they tax you for it\nPeople ask you for it or they'll clap you for it\nSoon as you build it, they destroy it\nThen when you need it you can't get it\nYou get it? You can't enjoy it\n\n[Interlude 2]\nMoney is a tool of exchange which can't exist unless there are goods produced and men able to produce them. Money is not the tool of the moochers, who claim your product by tears. Or of the looters who take it from you by force. (Money)", "image": "https://images.genius.com/d783e179d1606463c84de9e2e38f708f.500x500x1.jpg"}], "artist": "Jadakiss"}