{"songs": [{"title": "Been Shot Down", "album": "The Bar Exam 2", "year": "2008-11-10", "lyrics": "[Hook]\nHe's been shot down\nHe's been shot down to the ground\n\n[Intro]\n\"He's been shot down\"\nMalcolm\nMartin\n\"He's been shot down to the ground\"\nBig\n\"He's been shot down\"\nPac\n\"He's been shot down to the ground\"\nHuh\nThe realest niggas, they gone\n\n[Verse 1]\nMartin Luther laying dead on the terrace, don't nobody know who laid the hit)\n[?] in the frontline [?], Everybody know the government\nHate black people, not just black, big black people, think about a hundred years back\nWhite man talking like a boss and whipping slaves, think about it twenty years back\nBurnt cross in front left by them triple K's, taking niggas, put them in a box\nHis angle is hang them, let them dangle, left there for the little kid to watch\nIn anger, let him grow to be a fucking banger, [?] it's never gon' stop\nPregnant mothers, motherfuckers get shady y'all, [?]\nSlice the stomach then they watch the baby fall, Let a nigga pick a little cotton\nLet a nigga get smoked, bring him home on a big bowl\nEverybody I be idolizing surprisingly die, who next, Nas?\n[?] look at Big and Pac\nIs you really not all my niggas\n\n[Hook]\n\n[Verse 2]\nHip-hop in the form of Pac in the BM, hate a nigga when he was on top\nEverybody on from [?] can see 'em, [?]\nEverything a fly nigga do is hateworthy, [?] by the cops\nBullet ridden in the Michigan State jersey, let me talk about the nigga Big\nFuck revival, my nigga died in a Tahoe, [?]\nWhat is it, the suburban, I forget, and he had to go to the store\nI make daddies, I'm on that Poppa shit, [?]\nAct like you know that you a fast learner, take a nigga BLA! BLA! BLA! BLA! BLA!\nTop of the gat go back like Nat Turner, [?]\nOh you rap niggas, you ain't mean as this, [?]\nShooting black people with extinguishers, [?]\nEverybody I ever wanted to be in my life\n\n[Hook]\n\n[Verse 3]\nWe speak as one, Sean Bell is us, shoot a nigga 66 times\nKeep shooting and shooting like he ain't dead enough, [?]\nFor example, Obama and Jesse Jackson, [?]\nThat's right a black man plotting on a black man, see them kind of niggas everyday\nGive his whole life to that white girl, I know a nigga right around the way\nCome home and give his wife a backhand, I know that it's a motherfucking shame\nThe truth shouldn't hurt but the truth is abuse, [?]\nThe white man's fault, that's our new excuse\nTalking 'bout the same white man who didn't want to drink\nAfter you nigga draw eye contact [?] right out in public\nWith a bill from looking at a girl that ain't even his girlfriend\nDon't be looking at her, she white and you black\nEat a whole meal and give you scraps, and he finna put you in the back\nThe back of the bus, while my niggas clapping at us\nHa, ha, ha, The white man laughing at us\nYeah\n\n[Hook]", "image": "https://images.genius.com/5b0c99ea857e85f30c22aa344281f869.320x320x1.jpg"}], "artist": "Royce da 5'9'’"}