{"songs": [{"title": "Nobody f***ing with us (feat. bun b & slaughterhouse)", "album": null, "year": null, "lyrics": "[Bun B]\nLet's get it started like transmission and alternators\nGot the keys in the cage ready for who you call the greatest\nTakin 'em down from the biggest bitches to smallest haters\nI'm 'bout to serve these niggas, call 'em waiters\nGot my mind right, money right, ready for war\nAnd I got the C4, under my competitor's car\nThese niggas runnin 'round talkin 'bout they better than moi\nWhen I'm done all that's gon' be left bitch is ya head and ya bra\nBitch I'm ahead of the pack, and I'm ahead of the game\nAnd I put yo' head on a platter you put some shit on my name\nBitch I'm the shit, see the stains that I done left on the track?\nAnd I ain't sayin no names but I left the best on they back\nAnd they ain't sayin no names so I gotta say it myself\nI'm finger fuckin this game so you gotta play with yourself\nDon't pull a K off the shelf, or pull a strap out the stash\nI ain't gotta draw the pistol, I will chop at yo' ass\nI just let the hands of God toe-tap on you fast\nLeave you mashed like potatoes on the top of the grass\nCall the coppers to catch me and they'll just tell you to drop it\nI'll find you sooner or later, and they can't do shit to stop it\nGot that thang and I'ma pop it like a bubble on the double\nI am trouble in the flesh, you can't see me with the Hubble\nWe ain't wishin these niggas good luck, go get a clover\nThis Bun B, it's \"B.E. 3,\" this shit is over\n[Crooked I]\nSLAUGHTERHOUUUUUSE! (Whoo, Kiiiiiiiid!)\n[Joe Budden]\nLook at ya man look back at me, yeah I know, sickenin huh?\nFew got a Porsche with only two doors, need to upgrade cause you missin some\nWe just got two different bills, different styles, different sums\nStarted as a drive-by, ended as a hit-and-run\nStop me in the streets, let it be properly when you greet\nFuck lookin for me, I'm on your property if it's beef\nNot for robbery of ya piece, it's lobomomy with my peeps\nThat comraderie is usually sodomy for the beat\n'Less my critics put a lens on them, so I could look through it\nShut the fuck up, probably mean that you too shook to do it\nWe'd see two pennies to your name, yet you so saucy\nWhen I fix this game you can (Thank Me Later) for it, no Aubrey\nSwitch my demeanor up I'm, off my 380 shit\nMy, future's bright, stars is by my head, baby shit\nMake me sick, what you eat don't make me shit\nFound out the reason they hate me is my God-like presence, must be athiest\nWhile all of the frauds in rap is talkin swag put a fork in that\nSlaughter's back, listen nigga I got houses all across the map\nEven got a Boston pad, got this bitch from Boston bad\nWell put her in a wrestlin move, but I heard she got that (Boston Crab)\nBatteries in your back, go by what he say\nJust need you to know that it's no lee-way, and the tables are turned, go DJ\nSo you know what that blindfold's for\nThat bloodshed's a secret, let's keep it behind closed doors\n\n[Chorus: Royce Da 5'9\"]\nWho you said was dope again?\nAy, it ain't nobody fuckin with us, nobody fuckin with us\nWho you said was hot again?\nAy ay, it ain't nobody fuckin with us, nobody fuckin with us\nWho you say could spit again?\nAy, it ain't nobody fuckin with us, nobody fuckin with us\nWho you say was dope again?\nAy ay, it ain't nobody fuckin with us, nobody fuckin with us\n[Crooked I]\nI'm the present and the future\nLike Christmas in 2012 I'm the present in the future, an executive producer\nYou will never get to choose ya destiny cause you a pessimistic loser\nMess with me and I'll definitely shoot ya\nI'ma do's ya like I'm reppin the Yakuza\nDie hard like I'm sexin with Medusa, do somethin nigga\nBorn thuggin, I don't fuck with the cock\nNuts hang down my pant leg, balls tucked in my socks\nI ain't gotta act tough to get a couple of props\nLittle nigga raised hisself, I don't know what's up with my pops\nDo I think I'm the dopest, in America? I do\nMake you switch your whole style like you're datin Erykah Badu\nPair of Ferragamo shoes, I will stomp you\nI'm fucked up, like the relationship between Farrakhan and Jews\nI'm spankin this instrumental, like a wrinkly old bitch\nI'm whippin the kick and snare, make 'em pick they own switch\nI'm smarter than computers that know how to fix they own glitch\nI'll leave you face down, like chicks who lick they own tits\nAnd from this day forward, Crooked is aging backwards\nGettin younger and fresher, puttin bums under some pressure\nYes sir! Watch the next Slaughterhouse album\nEvery line is white powder, I ain't talkin 'bout talcum\nI am tighter than \"The Biggest Losers\" cruisin in a Smart car\nDistinguished alkie, the flask on the armoire\nI'm from the home of the most popular bomb weed\nMost proper, hoes rock with my partners who top seed\nPo' vodka, we gon' bottle pop in the calm breeze\nNo copper can stop a COB star - I'm a giant\nDumpin my cigar ashes out on top of the palm trees\nChrome chopper, if I squeeze you drop on the concrete\nYou wanna talk about the paper? Oh let's do it\nBatter pocket syndrome, the money we gon' abuse it\nStill gettin out-of-town paper so don't confuse it\nTell the hip-hop cops nah, it's only music\nAnd haters steady eavesdroppin on \"The Bar Exam\"\nProbably in your trunk now dependin on what car I ram\n\n[Chorus]", "image": "https://images.genius.com/892233b049a8da052593a9b4030be708.988x988x1.png"}], "artist": "Royce da 5'9'’"}