{"songs": [{"title": "OMG (Whole New Species)", "album": null, "year": "2018-11-16", "lyrics": "[Intro:]\nUhh...\nMan this shit gets so fucking big, this shit big as a blimp\nGoose\nLooking down on these shrimps\nYou understand what I'm sayin' slimeball?\nUdigg what I'm sayin' Stafa?\nA little louder, my nigga\nYeahh!\nGoose Wit Another One\nSlatt! Slatt! Slatt!\n\n[Refrain 1]\nI just bought my dawg a bag (yeah)\nHe got that shit straight off and pulled back up with the cash, yeah (skrt, skrt)\nI just bought my dawg a bag (racks)\nHe got that shit straight off and pulled back up with the cash, yeah (yeah)\nI just bought my dawg a bag (bag)\nHe got that shit straight off and pulled back up with the cash, yeah\nHe pulled back up with cash, yeah\nDropped that shit straight off, and then pulled up with the cash, yeah yeah (get it all, get it all, get it all, get it all)\n\n[Verse 1]\nIf I'm down on my last, I know all my niggas gon' go\nAnd I had a hoe named Leshawn from New Orleans, that pussy was wet I just float (woo!)\nHe on the road in a jag with them bands, the cops pulled him over, put that bitch to the floor\nListen, Lil Set want the new double R, but that money dirty, told him bring me like four, hundred, thousand, bands\nNigga, when you rich, you don't gotta make plans (nah nah)\nCount it till you can't feel your hands\nI want you to stack it till you can't see nothing (slatt! ahh!)\nOh my God! (God!)\nOh my God! (Oh my God)\nOh my God! (Yeah, nigga, yeah yeah!)\nYeah, oh my God! (Woo! Thugger!)\n\n[Verse 2]\nEver since I got my mouth fixed, I've been a whole new species\nYeah, I'm only a blood but I got all these bitches wanna see me and be me\nDigg that, I said I'm only a blood, but I got my new baby girl that C C C C (Chanel Vintage! Woo!)\nI was trying to move myself to Hollywood and get up outta these streets, streets, streets, streets (I'm out the streets now)\nI got it out the mud (I got it out the mud)\nI got it out the mud (I got it out the mud)\nEvery time I count it I lust (count it I lust)\nI got it all just because (all just because)\nMy momma told me I need to hurry up and blow (momma told me) so I went and did that for her (know I did that, yeah)\nThen I made a million then I went and bought an Audi and a Jag for her (woo, woo, skrt, skrt!)\nIt didn't come with no sale on it, yeah (it didn't come with no sale)\nMost of these bitches gonna bail on ya, yeah (most these bitches gon' leave)\nMost your niggas gonna steal from ya\nAnd before I go for that, I'll kill homie (ba ba ba ba)\nWhite G-Star shirt nigga pale on 'em\nBaby if your pockets fat I'll put some wheels on it\nYSL they better kill, better not get killed on me\nLocked up real fool no Tony Bologna\n\n[Refrain 2]\nI don't like my job (know that lil child)\nI do it for my child (I do it for my child)\nI do it for the wild (I do it for the streets)\nI do it for loud (I do it in the uh, uh, uh)\nI do it for cash (I do it for the cash)\nI do it for your ass (I run up on me a four)\nI do it for some cash (I do it for them blues)\nI do it on the dash (I do it on the skrrt)\n\n[Verse 3]\nI do it for your momma them (do it for your momma)\nI pay all of your momma bills (all of em bills)\nI take all your momma deals (take it all)\nI take all of these perky pills (taking a few)\nI done took all the perky pills (overdose)\nI done popped off the double seal (overdose)\nI done looked over lots of deals (I looked it over)\nI want chill let me fucking live (I don't wanna sign)\n\n[Refrain 3]\nI'm only blood (I'm a big blood)\nI'm a big blood (I'm a big blatt blatt)\nAnd I'm a real blood (I'm a big blood)\nI wanna see some blood (I wanna see some meat yeah)\nI'm riding with my cuz (I'm riding with my cuz though)\nBut I'm a big blood, yeah (I'm a big blood, yeah)\nFuck lil momma then pass it to my dawg yeah\nWhen I get through bring her back, to me\n\n[Verse 4]\nI don't care if you a prostitute, that way before you met me\nI don't care if you know everybody in a motherfucking street\nRIP to Bankroll Fresh, this shit got me losing all my flesh\nAll these bitches fake, no lice, yeah yeah\nI know they scoping us, yeah yeah\nLike they suppose to, yeah yeah\nFree Dulu, yeah yeah\nFree Unfunk\nI gotta get 'em out\nMy momma getting old (she old)\nAnd if I get 'em out, she got something else to live for, ahh\nShe like 55, yeah\nShe still in her stride, yeah\nBrim low sunny-side, aye\nPretty bitch I might just wife, yeah (why?)\nGod damn I think I like her, yeah\nDiamonds black, nigga knight her, aye\nYou gon' make me read a Bible\nNigga rappin', rappin' bad like a cypher\nNot Jordan, that's my brodie, yeah\nOn Atlanta like you know it", "image": "https://images.genius.com/717461618e785def35d07de6484b7ad4.1000x1000x1.png"}], "artist": "Young Thug"}