{"songs": [{"title": "So I", "album": "The Mobb Files", "year": null, "lyrics": "[Prodigy]\nYo, Hav, come here\nTell 50 to come here, listen to this shit\nAight, aight\n\nYeah, yeah, a true story 'bout a bum ass nigga\nWho became the world's richest bum ass nigga\nHaha, woooo, word up\nFuck all you niggas\nAiyo\n\n[Verse 1: Prodigy]\nMan, I've been fucked up for so long, and now I'm rich\nAll of them broke niggas that I used to fuck with\nGot that look in they eyes, got that scheme on they face\nWhen I pop up around the way like ain't shit changed\nLook here: don't make me put yo' brains on display\nYou niggas never gave a fuck about P\nNow it's all about me, and why I don't break bread\nWhere do we sleep, and how can we break in?\nIs he in his Jeep? Or maybe it's the Porsche?\nLet's catch him in the V, and tear the nigga all up\nNo, I don't think so\nI'm all in my mirrors and out my windows\nI get up out the car with the Desert Eagle\nShorty don't like me, said I got an ego (Let's get him, let's get him)\nSo, she tell niggas they should stick me\nGassin' niggas up to make history\nSo, they take the jooks so they can make the books\nBut I banged the heat when they came for me, like\n\n[Hook x2: Prodigy]\nNiggas think they so big\nP make a lil blood spill\nNow you punk ass niggas know\nIf you fucks with me, it's a must you bleed\n\n[Verse 2: Havoc]\nCatch me New York cruisin'\nStick in a movie, smokin' that Sour Diesel\nWon't point every time that I blew it\nNice gamin', homie, it's foolish, don't think about it, just do it\nI'll put ya through it like that hurricane that ran through Houston\nYou ain't shootin', you ain't scarin' nothin', y'all just flukes\nRobbin' niggas, strip they ass to they birthday suit\nI never picked grapes, but I cut me a bunch\nI'm that nigga in the club watchin' yo' ass get duffed\nNiggas wanna hang up once they finally got bored with us\nAnd they baby momma sluttin' out there on tour with us\nPass it to the homie once a nigga get bored with her\nAlmost couldn't nut 'cause your ass got caught in her\nDuke frontin', come on baby, you ain't got no guns\nAll you got is that rusty ass Revolver, son\nAnd you can't fool me, I know they borrowed, nigga\nNiggas think that they ill but the Mobb is iller\nYou know the game\n\n[Hook x2]", "image": "https://images.genius.com/4e5baad63f49a9b314f43107843a0aeb.600x600x1.jpg"}], "artist": "Mobb Deep"}