{"songs": [{"title": "Can’t Think", "album": "G.O.A.T. (Greatest of All Time)", "year": "2000-09-12", "lyrics": "[Intro]\nYou ever get to the point where you so frustrated\nYou ready to give up?\nYou ready to end it all?\nDon't do it dog, word up\nI don't care if you black, white, Latin, Asian, whatever\nWe all go through pain\nWhen you can't think, use your soul baby\n\n[Verse 1]\nPreliminary discussions is over with, the verdict is in\nI took the rap throne back\nI reigned like krills in '87, my name is on the map\nIt feels like a razor down the middle of my back\nThey slept on my lyrical ability to blow\nGave another nigga credit for inventing my flow\nI'm a child of God, witness the rising son\nFrom the cradle to the grave, I remain number one\nThis thing of ours, got competition taking red showers\nGrieving mothers calling 1-800-Flowers\nMy repertoire burn your ashes in the urn\nIs it God or money that really make the world turn?\nGrab your gun, separate the ones from the real funds\nInhale deep and hold it in your lungs\nThe streets was requesting some original LL\nA soundtrack for niggas that was raised in {hell}\nThey looking for a leader that can guide 'em through the maze\nSmoke filled rooms, breathing in purple haze\nPo' nigga's on the bricks his whole life\nHe ain't got nothin' to live for, so fucking living right\nBut if you stay in the rain like hurricane\nGold melts down but it don't fear flames\nToxic, lethal, psychologically evil\nGenocide was committed on the black people\nAnd the ghetto is a trap with glass walls\nShould I sell drugs, be a rap thug, or play ball?\nWe end up in the grave anyway\nThe average cat and LL Cool J\nIt's a never-ending cycle, life and death\nUntil then may my mic stay blessed, to the death\n\n[Chorus]\nI can't think, why do I feel I'm losing my mind?\nI can't think, could it be the ill beats and rhymes?\nI can't think, even though I'm a one of a kind\nI can't think, I want the paper, that's just the bottom line\nI can't think, mo' murder every day around the way\nI can't think, I'd rather get paid and parlay\nI can't think, it's all about survival God\nYou know the epilogue by James Todd\n\n[Verse 2]\nPut your life on the line, you running out of time\nThe coroner's calling, she know she on a nigga mind\nAmongst the dogs, real cats is hard to find\nEven a nigga moms hate it when he start to shine\nGet the money and run, dodge the devil and his sons\nSpit powerful parables like a sermon has begun\nFuck the turntables up, leave the DJ awestruck\nAttitude is what, keep the razor blade tucked\nToo much flossing'll get your reputation touched\nToo much rapping'll get your big mouth shut\nProtect your neck nigga, you'll get it in the gut\nYou wearing a vest? What if you get your throat cut\nSold your soul for a dollar, now you having bad luck\nUsed to keep a bad bitch in the crib baggin' up\nPlayer here, player there, nigga turned you out\nBut never told you beware\nNever told you that black love supposed to be shared\nAnd you never judge a woman by the texture of her hair\nFancy cars and gold teeth, G-strings and things\nThe almighty dollar replace the wedding ring\nThe Ark of the Covenant was held by a king\nI ain't trading my soul in for skins and chrome rims\n\n[Chorus]\nI can't think, why do I feel I'm losing my mind?\nI can't think, could it be the ill beats and rhymes?\nI can't think, even though I'm a one of a kind\nI can't think, I want the paper, that's just the bottom line\nI can't think, mo' murder every day around the way\nI can't think, I'd rather get paid and parlay\nI can't think, it's all about survival God\nYou know the epilogue by James Todd\n\n[Verse 3]\nThink about it yo, think about it\nThink about it yo, think about it\nThink about it yo, think about it\nThink about it yo, think about it!\nThe dawn, of a new millennium, came to pass\nThe world revolves around sex or cash\nThe black man's motto, \"Kiss my ass!\"\nShorties in kindergarten are strapped, ready to blast\nAll I ever seen was killers and dope fiends\nFrom FEDS Magazine to the heart of killer Queens\nBronx and Brooklyn and everything up in between\nNo matter what, you always got a Judas on your team\nGiving it to the world and I'm telling it like it is\nTossing lyrical daggers and sending 'em in your wig\nKnow where the body's buried, I ain't saying where it is\nRaised inside the ghetto, but dammit I wanna live\nThe legendary master of lyrical combat\nBut ain't no competition, ain't nobody to go at\nSo I'ma take the time and spit a universal verse\nHit the streets with a blessing and erase the curse\n\n[Chorus]\nI can't think, why do I feel I'm losing my mind?\nI can't think, could it be the ill beats and rhymes?\nI can't think, even though I'm a one of a kind\nI can't think, I want the paper, that's just the bottom line\nI can't think, mo' murder every day around the way\nI can't think, I'd rather get paid and parlay\nI can't think, it's all about survival God\nYou know the epilogue by James Todd", "image": "https://images.genius.com/7d9009021acaa20a396f75cbd74c2360.1000x1000x1.jpg"}], "artist": "LL Cool J"}