{"songs": [{"title": "When U Hear The", "album": "Amerikaz Nightmare", "year": "2004-08-10", "lyrics": "Alchemist - fuck is the deal nigga?\nUh-huh, yeah..\nYeah.. when you hear the..\nYeah..\n\n[Prodigy]\nP yeah you heard of him, big ignorant chains and sports cars\nGallons of Bacardi, bent at the awards\nI need a bitch like Christina Aguiler-y for a broad\nI know I can splack that, she dyin for a thug\nAnd she heard of me, she know about my Infamous life\nShootouts in New York with various types\nFast money, faster guns, we party e'ry night\nCause we perform, e'ry day of the week for that price\n(Mobb Deep) Who you know got a similar catalogue\nAnd still sound brand new, like we just started?\nThe Carhatt Mobb, Guess jean team\nForty inch chain gang, volume please\nSo these people can hear the sounds of Queens\nI make your arm hairs stand up, it had to be me\nMixed with the A-L-C and H-A-V\nN.Y.C. to L.A., we do our swing\nE'rybody have a ball, e'rybody party\nE'rywhere you turn it ain't nuttin but phatties and hotties\nE'rything is all love 'til you try to try me\nThat's when I make e'rybody {*shhhh*}\n\n[Hook]\nWhen you hear the... it's on\nWhen you hear the... it's on\nWhen you hear that.. it's on\nWhen you hear that.. it's on\n\n[Havoc]\nYo I'mma glow, like a dirty bomb, jux, with the certy arm\nRippin anything, that you motherfuckin hear me on\nAdd it to the catalogue, heavy hitters had the song\nNiggas showin no feelings and me, got 'em camoflauged\n(F'real baby) You little babies so emotional\nAnd tip-toe around the beef until that toast to you\nAin't got no problem in smokin you\nEnemies I could deal with, be the ones that's close to you\nAnd do, what I'm 'posed to do, approach Duke\nWhy you faggots only squeezin from out, the vocal booth?\nKnow my style be that overproof, open the Coupe\nOpen your face was talkin, wasn't talkin to you\nAnd now the medics gotta mind to your face, tyin the lace\nYou tellin that a D.A. got 'em tryin the case, yeah\nBottom line you cowards is ass\nKnow Mobb good, in numbers y'all music is trash\n\n{*gunfire*} When you hear the..\n\n[Hook] - echoes to fade", "image": "https://images.genius.com/b2028bc5336e13af3d91919e570f79e6.1000x1000x1.jpg"}], "artist": "Mobb Deep"}