{"songs": [{"title": "Everybody Looking", "album": "Burrrprint (2) HD", "year": "2010-03-13", "lyrics": "[Hook]\nErrybody lookin\n(yo-yo)\nLambo's get the bitches\n(mo-hoes)\nStove make the cookies\n(o's-o's)\nHurtin these suckas feelings\n(ouch-ouch)\n\n[Verse 1]\nYo yo yo come check this crazy flow\nI gotta go and do this show\nJust where is Tokyo?\nYo yo damn bricksquad be burnin dro\nDrink bur man and white folk wit me I got cash to blow\nYo yo your nose gon grow Just like Pinocchio\nYour lying that you're hot as me, but that is not the truth\nOh no my left right wrist is truly extra cold. my flow sick need them extra o's, I need an extra stove\nSo so I'm so icy my squad run in snow.\nYou know it and you knew before so much dough I shut down the store\nHoes hoes I birdfeed these bitches like they like were crows\nI pull the totem pole out and leave them pussy swole\n\n[Hook]\nErrybody lookin\n(yo-yo)\nLambo's get the bitches\n(mo-hoes)\nStove make the cookies\n(o's-o's)\nHurtin these suckas feelings\n(ouch-ouch)\n\n[Verse 2]\nSay, say, what you thought? what you think I say?\nI make money different ways get bags off through the day\nHey hey damn I paved my way I paved my way\nI used to sell a lot of yay I moved a key a day\nWait wait way way way way back in the day\nI ran the A me an my wolves, 2 shotguns and A-K\nNow I'm gettin' that stupid cake\nI'll put you to sleep like Jake the Snake\nThat dope bag sits right in your face, right in front the place\nOne day you might get some money maybe 12 bars if you pay me\n'Scuse me girl you want some babies?\nGucci you can't have my babies\nMonday, I'ma go to Magic City see some ass n' titties\nHit some strippas, sip some liquor all these bitches fucking with me\n\n[Hook]\nErrybody lookin\n(yo-yo)\nLambo's get the bitches\n(mo-hoes)\nStove make the cookies\n(o's-o's)\nHurtin' these suckas feelings\n(ouch-ouch)\n\n[Verse 3]\nGod damn Gucci Mane just bought another lamb!\nChevy with the crazy cam I pull over with that stupid slam\nYeah, plus I got all this jewelry on\nFlexin' like I'm Serious Jones\nBubba Kush still my cologne\nWord up? Bricksquad put your birds up\nYou ain't never heard nothing if you never heard of us\nBlood cause run to you, you can't rep no mo\nMatter you can't breath no more\nBlow so hard that there is nothing left for sure\nWhat? I'm royalty like King Tut\nGot someone to introduce you to baby dats deez nutz\nPlus I wouldn't give a flying fuck\n'bout none of that shit you fuss about\nI fly them in them bus em out\nThere's nothing left to talk about\n\n[Hook]\nErrybody lookin\n(yo-yo)\nLambo's get the bitches\n(mo-hoes)\nStove make the cookies\n(o's-o's)\nHurtin' these suckas feelings\n(ouch-ouch)", "image": "https://images.genius.com/c1e86882e49586297dcbe8c6885a8b32.1000x1000x1.jpg"}], "artist": "Gucci Mane"}