{"songs": [{"title": "Yellow Light", "album": "Category F5", "year": "2009-07-14", "lyrics": "[Verse 1: R. Kelly]\nSometimes I go fast, somtimes I just stop\nSometimes I take it slow, when I let the sex drop\nBut most of the time I go quick, when I'm hittin that shit\nAnd she like it, she like it\n\nBut tonight she said she didn't want to go too fast\nAnd tonight she said she want me to take my time\nSo I took her down and said \"Do you like that?\", and she said \"Hell yeah\"\nThen hit it medium from the back, I said \"It's cool?\" and she said \"Hell yeah\"\n\nShe said \"Ooh baby, just take control baby\nLong as you take it slow baby, then you can hit it all night baby\"\nShe gave me the green, so I had to go, start screaming my name when I went low\nAnd every time I started going real fast, she looked at me and said\n\n[Hook: R. Kelly]\nYellow light x4\nGotta slow it down\nYellow light x4\nGotta slow it down\nYellow light\n\n[Verse 2: Twista]\nI told her that I wanted to beat it up fast, so lil mama let me know when to go\nTonight she don't want a drill session, she wanna feel it so she told me to take it slow\nI'm so used to mackin it pokin it back to back when I'm attackin it I wanna go get in\nShe blew the whistle like \"beep\" be still, hold it in now roll it in\n\nShe lifted her palms to hold my face because she want me to control my pace\nShe said she wanna feel it all, slide through the windows of the wall cause the feeling was too cold away\nWell I can break it down to 50, down to 40, down to 30\nIn the speed you want me to, I can do for you, shawty tell me how you want it\n\nDo you want the lambo? I give it to you like uh uh uh uh uh when I do it baby\nOr do you want the 64? I give it to you like uh uh when I do it baby\nNow I was thinkin I was all up in it right, but now she got me caught up at the light, I try to call it like\nGreen, uh uh too fast, red uh uh, too slow, she want it in the middle so I gotta\n\n[Hook: R. Kelly]\nYellow light x4\nGotta slow it down\nYellow light x4\nGotta slow it down\nYellow light\n\n[Verse 3: Twista]\nNow with a subtle way to soothe your soul, got her lovin the way I move the pole instead of rude and bold\nI want her to see what it feel like when a playa break it down into cruise control and still rule the role\nNever stuck in only one speed dick shift, in the stick shift I am not them dudes\nIt's not a jack rabbit, when I be tappin it I wanna slow it up and give it to her chopped and screwed\n\nCome here shawty and let me knock them shoes, feel it sensual when I rock to the groove\nMake it hot then cool, if you think you butter show her how to stutter, step, stop, then move\nBut I get not the order, narray canary and my flow is like a shop of horror\nScaryin berries whenever I rock with the R, Kelly in every position for power we slaughter\n\nI'm petty like veli, I'm getting money cause I oughta\nI tell the girl to slow down lil mama, cause you ain't gotta be so anxious\nGoing rapidly when you flex yo thighs, it's still good sex if your exercise your patience\nWe ain't gotta do it like we racin, cause all the time that ain't how I like it\n\nGreen, uh uh too fast, red uh uh too slow, I'm on the mid level so she gotta\n\n[Hook: R. Kelly]\nYellow light x4\nGotta slow it down\nYellow light x4\nGotta slow it down\nYellow light", "image": "https://images.genius.com/ab06dbf0ce99f56ef5472a2ab819fd5f.675x675x1.png"}], "artist": "Twista"}