{"songs": [{"title": "Vanity Slaves", "album": "Kendrick Lamar EP", "year": "2009-12-31", "lyrics": "[Verse 1]\nSometimes I want to leave, sometimes I want to cry\nSometimes I hate to bear the truth, sometimes I want to lie\nSometimes I want to school the youth, sometimes I want to ride\nSometimes I want to not think, sometimes I want to vibe\nSometimes I want to bump Tribe and zone out\nThis song's 'bout a young boy that's gone wild inside\nWhen my world collide\nWith your world where your girl and your kids reside\nWe killed the facades, we feel free to fly\nWe're birds that reserve in the charismatic sky\nI care about my pride too much\nIf my clothes is new, if my ride is plush\nIf my hair is cut, if my diamonds is crushed\nI look in the mirror, I'm trendy enough? Wrong\nInsecurity roams the black community\nHomes where kids must have jewelry\nThe high school female need earrings and details\nSo she can be cool to be, amongst popularity\nThe various name brands that reached the price scan\nIt's not about the right price but more like the right scam\nTo rule us all, confuse us all\nHit the bank within five minutes and then withdraw\nNow let's draw\nThe picture of a rapper with a chain and Range that is not paid for\nMy cousin from the South said he just bought him a house\nThat lives around his neck like a white collar\nSo why fast forward? then I'll rewind, a time machine can help me double back to slavery times\nPicking cotton from a field that a white man own\nThe blacker you are, farther you're from the white man's home\nNegro spiritual songs, gave us some type of sanity\nBefore your vanity, they parted our families\nThey put us in hundred degree shade and outside we bathed\nThe more we were afraid, the more they made rules\nAnd trapped our minds in a cage, our freedom was so vague\nCouldn't see it with the eyes of Tracee Ross (uh)\nAnd school was exempt, see we couldn't have smarts\nAnd a smirk could get you hurt, wounded first from a scar\n400 years of nothing, 400 years of suffering\n400 years of tears, and tribulations, miseducation\nSee what we facing is now coming back to the roots\nRemember whips on our back and if we would run they would shoot\nCalled us niggers and figured that we never live in pursuit\nOf happiness, we capture these feelings in things that we do\nThought of abstinence of slavery but we made it come to\nAbout a perspective, my shoe selection gotta be Louie\nHer hand bag gotta be Gucci, it's fake then she fool me\nShe still bad though, and her fake Gucci ain't that bad though\nWe filling up the gas for Rollies\nUpgrade to 26's after riding Kobes\nMy cousin from the South, slavery start in the South and I bet ya\nHe overcompensates for the life of his ancestors\nSo blame it on the 400 years we never saw\nThe reason why the next 400 we gotta floss\nSlaves\n\n[Outro]\nI said the 400 years we never had nothing\nBarely had clothes on our back\nIs the reason why when we get a little bit of change\nWe over exaggerate on our living expenses\nSo if you get your first big check and you cop a chain before you buy a house\nYou're a vanity slave\nIf you're a female and you got 4,5,6 rings on your finger\nFour holes in your left ear and a nose piercing\nYou're a vanity slave\nIf you got an 02' Monte Carlo with 24's on it\nAnd on the back of the window it says, \"Get on my level ho\"\nYou're a vanity slave\n\nWe're all vanity slaves, and with that being said\nCan somebody please tell me where the mall at?\nI'm not from around here, hey Ali, where we at? Idaho?\nYeah nigga, you know the first of the month, checks coming in\nI'm tryna get some\nWhat up?", "image": "https://images.genius.com/de49545ec6453e829bb3ff6d34d088db.1000x1000x1.jpg"}], "artist": "Kendrick Lamar"}