{"songs": [{"title": "Dollar and a Dream", "album": "The Documentary 2", "year": "2015-10-09", "lyrics": "[Intro: The Game]\nThey say it started in the East where the apple was\nBut out West we be throwing them apples up\nThey say them Fruit Town niggas gon' ride tonight\nThey say them Tree Top niggas gon' ride tonight\nThey say them Grape Street niggas gon' ride tonight\nThey say them Bounty Hunter niggas gon' ride tonight\nThey say them 6-0 niggas gon' ride tonight\nThey say them Cedar Block niggas gon' ride tonight\nThem 1-9-0 niggas gon' ride tonight\nThey say them Denver Lane niggas gon' ride tonight\nThey say them Campanella niggas gon' ride tonight\nWho gon' ride tonight, who gon' die tonight\nStarted with a dollar and a dream\nStarted with a dollar and a dream\n\n[Verse 1: The Game]\nWe did it for the West, motherfucker, like Kanye\nNiggas get stretched out on La Cienega\nGot three thousand stacks, I ain't talking 'bout Andre\nI put it on your head, I ain't talking no toupee\nSee I stayed the same, ain't go weird like Lupe\nSqueeze on this trigger like ain't no more toothpaste\n(You ain't gon' do shit) Bitch, of course I is\nYou want this money, you gon' have to drive the course I did\nI got that Wraith out, you talking 'bout the Porsche out here\nYou in the nosebleeds, come down to where the courtside is\nHow a nigga with a rojo rag end up in Soho\nBag, any bitch walking with a solo swag\nYou think you ballin' in that four do' Jag? Nah\nIn Tom Fords with a MK bag? nah\nGive you a bird's eye view of the streets\nNigga, welcome to Compton, take you to Carson next week\nAb-Soul!\n\n[Chorus: The Game]\nStarted with a dollar and a dream and a pistol (dollar and a dream)\nOn the corner rag hangin', slangin' crystal (dollar and a dream)\nI said you gangbanging let me see credentials\nAnd when I pull this gun out you know how this go\nStarted with a dollar and a dream! (Look at me now)\n(Look at me now, then one day)\nStarted with a dollar and a dream!\n(Dream, and this is what I deserve)\n\n[Verse 2: Ab-Soul]\nUhh, I was, fathered by the bastards\nPardon my mannerisms\nThe Curtiss magnet that managed without the metal with him\nHow the hell I did it? I let God ad lib it\nI put that on Leetwood, I ain’t lying one sentence\nBitch, I started with a dollar and a dream\nWe went from helping old ladies with their groceries at Alpha Beta\nFor a  couple quarters to a baby hustling\nSomething major, we had to grow up sooner or later, but\nI’m so Del Amo, my mama still stay off Anna Lee\nCarson across my belly, I prove you lost already\nRoccett my big brother, Bishop left the door crack\nGame took me on my first tour, now look where we at\nIn the studio getting paid to reflect on that\nDocumenting true facts\nNot to mention this the Documentary 2, too\nYou do the addition in ballerina shoes\nEnough with the clever raps, it’s more important than that\nI put my city on the map, nigga\nYeah, I really put my city on the map\nI mean, when the last time you heard Carson on the track, nigga?\nLet alone when they calling out stomping grounds on the West\nI’ll wait...\nYeah, that’s what I thought, I’m the best, nigga\nThis the new West, nigga, respect that\nIt’s Top Dawg, all I’m missing is the red hat\nBut don’t question what pocket I had left, my handkerchief\nI’m guilty by affiliation, in many ways gangsta\nBut let me explain something, a paradox if you may\nI threw on my fresh Supreme Chuck Taylors today\nAnd then I got a call from Chuck Taylor, I’m saying\nThe game ain’t changed, we still changing the game\nSoul!\n\n[Chorus: The Game]\nStarted with a dollar and a dream and a pistol (dollar and a dream)\nOn the corner rag hangin', slangin' crystal (dollar and a dream)\nI said you gangbanging let me see credentials\nAnd when I pull this gun out you know how this go\nStarted with a dollar and a dream! (Look at me now)\n(Look at me now, then one day)\nStarted with a dollar and a dream!\n(Dream, and this is what I deserve)\n\n[Verse 3: The Game]\nMy first album was a set up. I was the little nigga\nPac was talking to when he said \"keep your head up\"\n'Cause he knew what I would be facing after his demise\nJayceon had to pitch them pies, better life than flipping fries\nI'm the one the Crips despise, move the Yay or kiss the sky\nFor having dreams that 50 died, Eulogy by Mary Blige\nHopped up in that enterprise, had to stop a genocide\nWent from underdog to watching Top Dawg and Kendrick rise\nNow tell me can I testify, pull over trying to rest for 5\nOn a block, no tint on the Wraith left these kids mesmerized\nThey ask me how I did it, how I got it, say I'm king you looking brolic\nI put them weights down start practicing lyrical exercise\nTell me who the next to die, probably who the next in line\nThey got me battling ghost 'cause I'm the illest one alive\nThat's word to Pac, Pun, Biggie, why I stand as my city\nIf we was 'bout to run a train, you couldn't fuck with me\nEver since I saved my coast, it's been born again\nIf I ain't shit then who the king of California then?\nWho could out-rap me?\nNow think about if the same nigga you bout to say can run up and out-strap me\nYeah, out-trap me, yeah, out-gat me\nI mean think about it, exactly\nSpeaking matter-of-factly I'm down playing that actually\nCall me Game I ain't one still I get paid like an athlete\nDo the math after the math, Doc two in the bag\nLived up to expectations, Dre took me first in the draft\nNow who the fuck want what\nNobody survives so look alive when them Impalas in the cut\n\n[Chorus: Game]\nStarted with a dollar and a dream and a pistol (dollar and a dream)\nOn the corner rag hangin', slangin' crystal (dollar and a dream)\nI said you gangbanging let me see credentials\nAnd when I pull this gun out you know how this go\nStarted with a dollar and a dream! (Look at me now)\n(Look at me now, then one day)\nStarted with a dollar and a dream!\n(Dream, and this what I deserve)\n\n[Outro: The Game]\nCrenshaw Mafia down to ride\nThey say the Inglewood family's down to ride\nI heard the Two Bs niggas is down to ride\nThey say them South Side niggas is down to ride\nThey say them Insane niggas is down to ride\nI heard them [?] Park niggas is down to ride\nThey say them Denver Lane niggas is down to ride\nWho gon' ride tonight, who gon' die tonight?", "image": "https://images.genius.com/f5bd9dcb51fd19e06b10b2ae0e3620cf.1000x1000x1.jpg"}], "artist": "The Game"}