{"songs": [{"title": "Get’cha Paper", "album": "Rock City", "year": null, "lyrics": "[Royce]\nUh, yeh\nRock City is the anthem\nThis one is the theme\nMy nigga Tre\n\n[Tre]\nDetroit came up you know we hot\n30 years were gators and big locks\n600's on chrome, you don't stop\nDetroit we just hot\n\n[Royce]\nMy flow switch go, pop like a pistol\nShit, don't stop, its so hard\nHow many times must I tell you how I do?\nHow many times must I prove how I do?\nYou, get six million ways to die, choose one\nOr, booya!\nYou can get one assigned to ya\nHows about to thump, when I'm thumbin this non Ruger\nSomething that will tear you in half and times two ya\n(ooh) I don't think you are better then me\n(no) Nobodys better then me\nNiggas better quit believing they better then a nigga\nThats merely letting them breath, I dead them with ease\nNow come one, you can get swallowed\nIf you let your lead get you into something\nThat your eraser can't get you out of\nI wrote a song about it, like to hear it here it go\n(ahhhhh haaaaaa) Thank you very much\n\n[Royce] (Chorus)\nCause we get this jumpin up in here\nWe don't want no trouble up in here\nI gon' get my money up in here\nLadys is you with me?\n(ooh) Nobodys better then me\n(no) I don't think your better then me\n(ooh) Somebody better believe\nGetcha Paper, Now Lets Go\n\n[Royce]\nYou see how my wrist it glows\nAnd I'm here to get this dough\nYou can see my shit explode\nAnd if you ain't with me (so?)\n(How many?)\nHits does it take for you to believe me?\n(How many?)\nTimes do I gotta tell you its easy?\n(How many?)\nPeople must I run up on, and?\n(How many?)\nBout to see the gun up drawn\nNigga, we just wanna get it up jumpin\nUp in here but ya'll be frontin\nWe can rumble anytime, ya'll niggas talkin shit is nothin\nTry to fuck with nothin, but a hustler\nYou get gutted like a blunt\nOr you get smoked, or treated like a joke\nNiggas why did you lie? Like you fittin to stop it\nI'm donny ize, lottery ticket? It's in the pocket\nWhile I'm high, while im on top\nWhile I'm living, while im survivin\nWhile I'm even able to say \"while I\"\n\n(Chorus)\n\n[Tre]\nDetroit came up you know we hot\n30 years were gators and big locks\n600's on chrome, you don't stop\nDetroit we just hot\nYoung niggas stay fly at all times\nHoes 21 and under with gangsta rides\nKeep our guns by our sides at all times\nDetroit we just fly\n\n[Royce]\nWhoa, pause for a second for the flow\nHands up for my niggas from the D\nA momment of silence for my enemies (tssh)\nIt won't turn to beef till you fools\nDo something to me or one of my crew\nWe lay low like Master P and Snoop\nWith' high shots that will put you away\nYou don't wanna step in front of the gun, when it's comin\nIt's like the abundance of like a hundred the numbers is runnin\nI'm a rare form, you bled warm, be gone dead\nYou prepare for me, beware all, lets go\nMami lookin robotic cause of the strobe light\nHands up in the sky for the whole night\nYou can get between the thighs if it goes right\nThe perfect song for the job, and it goes like...\n\n[Hook] - 2X", "image": "https://images.genius.com/07b1a3fc8d90a21a4bc1e707522e5c82.600x600x1.jpg"}], "artist": "Royce da 5'9'’"}