{"songs": [{"title": "Ghost Is Back", "album": "More Fish", "year": "2006-12-12", "lyrics": "[Intro: Ghostface Killah (Tracy Morgan)]\nListen, man, it's going on 2007, g\nI wanna wish ya'll muthafuckas a happy New Year\n(New Year, let's give it up) How your 2006 was son?\n(Go and get up, get up, ya'll niggas is crazy\nYa'll know how I get, my 2006 off, nigga I broke two of my toes, nigga\nIt's going down nigga, that's what's up, ya'll niggas is crazy)\nThat's why you came to the show with, um, peanut butter on your toes, that day\n(Nigga, why you gotta bring everything up? Man, everybody here enjoying)\nNah, son, because your shit's --- (crazy, a happy New Year\nThis muthfucka) Nah, boy, yo (no, man...) But your shit was looking mad timid\nThat was the funniest shit in the book, that day (Find out who...)\nThat's your toes right there! (Who the fuck said I broke 'em)\nYo, how you put them little baby cast on there? (Just a little punk ass nigga man)\nHow you put them in the baby cast like that, though, son?\nCome on, son, that's what I was, that shit, yo\nLet me tell you something, I ain't gon' front, yo\nI love you and all that, son (then say that!)\nYou my first cousin, (then say that, Ghost, say that)\nYou my first cousin, though, but come on, man\nYou know how it is, son, I ain't seen you in years though\n(You know how I get down) How you had peanut butter on your toes though, son?\n(Cuz the nigga asked for it, man, shit I fucked a nigga up, man)\nYo, it's New Year's, yo (get back to me, muthafucka)\nYo, it's New Year's son (fuck ya'll niggas, this ain't no\nYo, Ghostface, my gold is fifty hundred, I want my money)\nNINE! EIGHT! SEVEN! SIX! FIVE! FOUR! THREE! TWO! ONE!\nI love you my nigga, Happy New Year's!\nFuck that, let's get this paper!\n\n[Ghostface Killah]\nYo, yo I was sitting at the table thinking\nHow the hell do I murder these M.C.'s, sting 'em like bees\nMy attitude's that of Hannibal, not compatible\nWhy I would damage you, fuck, if I drink, then ran with you\nYa'll chose to war, so called rich niggas wanna verse the poor\nI'll rob you first, then go to your earth, it's not gon' hurt\nIf you try calling the cops, it's not gon' work\nAll you gotta do is lay in the dirt, we dug a hole\nAnd my guns weight more, yo, then Gerald Levert\nWith more blubber than a Ruben Studdard, I grease the pan\nWith rhymes, and ya'll can't believe it's not butter\nI told ya'll to chill, stretch all out like franks on the grill\nWith a classic deal, I'm like a farmer when I'm playing the field\nJust painting my seeds, in 20-06, it's time to build\n\n\"Ghost is back...\" - sample 4X\n\n[Ghostface Killah]\nYo, I cooked up the beef, seasoned up the meat\nFried 'em, tried 'em, took it out the grease\nGhost came to steal the show, since you loving your broad\nI'mma lay back and reveal your ho\nShe a brain therapist, chick you can't kiss\nOpened up her legs, like \"ooh, I smell fish\"\nYeast infection, queen, she love dick\nShivlered up tits, she'll bang the whole Knicks\nNow how can I salute you, kid, I'm planning to do you\nCrucial, blow rugers at who you with\nWe bump heads while we out in the street, it's all good\nMy trigger fingers'll matter, kick the back of your feet\nAnd your red monkey jeans, is looking like a scene from Baghdad\nThat's bad, flags red, dirt beds\nYa'll niggas is eating, crystal meth' heads\nWe pissed out, wrist out, with the best threads\nKnockin' niggas off, knockin' niggas out\nFucking up rappers is what I'm about\nI'm holding Staten Island down, ya'll cats must be dead\nKeep fronting and lose your head\n\n\"Ghost is back...\" - sample 4X\n\n[Ghostface Killah]\nYou can decide on who's liver\nToney Knight Rider, wisdoms love my saliva\nSlobbin' 'em down, hoggin' the mound\nPitchin' 'em eightballs, robbing the town\nDon't let your gangsta, get you murked up\nFaggot ass homeys done got you worked up\nRappers can't come around, ya'll wide rap is dead\nFreeze, nigga, come off the bread\nWhole horizon, hit 'em with toast, a rap arising\nRinging the boys bell like Verizon\nEyes, looking suprised, that the four-five\nYo Ghost, don't even do it, I got some more pie\n\n[Outro: Ghostface Killah]\nWord up, aiyo I'd like to give a mean shout out to Staten Island\nHolding the boy down, ya'll know what it do\nTheodore Unit, Big Trife, Wigs, Du-Lilz\nYo Supa! Ya'll know what it is, man, yaknowhatimsaying?\nMy West Brighton niggas... let's see that money come first\nThat's right, yeah, get up in that building\nYou tell L.A. Reid and them niggas to crack that safe\nWord up, cause we coming, J-Love\nAiyo Den, what up, Ice, C-Allah, what up, yo Un\nYou knowhatimean, yo, Buck, hold ya head.. aiyo Bean\nYou know what it is, tell E, I said what's the deal, man\nWe gon' get this paper, this year, yo Irf, you know how we do\nI ain't even gotta say that much, TaVon, come holla at your boy\nI know my jack be off all the time, but yo, that don't mean shit, nigga\nCome through and holla, nigga, word up, this what it is\nYo, S.G., that's my son doola... ya'll niggas keep ya'll hands off him\nYouknowhatimean? Yo Ant Acid.. what's the deal, aiyo Tech, yo Plex\nYour boys here, nigga... word up, it's all about paper this year, nigga, word up\nI got mad babies to feed, I got bills nigga, one...\nWu-Tang for life, Cappadonna, Raekwon, what up?\n\"Ghost got the juice, now\"", "image": "https://images.genius.com/c666c55fe38ac486d5bf42862246cf28.1000x1000x1.jpg"}], "artist": "Ghostface Killah"}