{"songs": [{"title": "Open Letter on Instagram", "album": null, "year": null, "lyrics": "I'm afraid of the future\nI'm afraid my parents won't live long enough to see my kids\nI'm afraid my show will fail\nI'm scared my girl will get pregnant at not the exact time we want\nI'm scared I'll never reach my potential\nI'm afraid she's still in love w/ that dude\n\nI feel like I'm letting everyone down\nI'm afraid people hate who I really am\nI'm afraid I hate who I really am\nI'm scared people will find out what I masturbate to\nI'm afraid I'm here for nothing\nI feel that this will feel pretentious\n\nI'm scared I'll never grow out of Bro Rape\nI'm afraid people think I hate my race\nI'm afraid people think I hate women\nI hate people can say anything\nI hate caring what people think\nI'm afraid there's someone better for you\nOr me\n\nI'm afraid this is all an accident\nI'm scared I'll be Tyrese\nI'm afraid Dan Harmon hates me\nI'm scared I won't know anything ever again\nI'm scared I never knew anything\nI'm afraid I'll regret this\nI'm afraid this doesn't matter at all\n\nI didn't leave Community to rap\nI don't wanna rap\nI wanted to be on my own\nI've been sick this year\nI've seen a bunch of people die this year\nThis is the first time I've felt helpless\nBut I'm not on that\nKept looking for something to be in with\nFollow someone's blueprint. But you have to be on your own\n\nThe label doesn't want me to release in December because it's not a holiday record and I'm not a big artist. I started the record last Christmas. Christmas always made me feel lonely, but it helped me restart the new year. I want people to this album when everything's closed. When everything slows down and quiet.  So you can start over\n\nI got really lost last year. But I can't be lonely tho. Cause we're all here\nWe're all stuck here\n\nI wanted to make something that says, no matter how bad you fuck up, or mistakes you've made during the year, your life, your eternity. You're always allowed to be better. You're always allowed to grow up. If you want", "image": "https://images.genius.com/5a9c598da4e86fefcb845cbbe74706aa.1000x1000x1.jpg"}], "artist": "Childish Gambino"}