{"songs": [{"title": "Fire (Unreleased)", "album": null, "year": null, "lyrics": "[Verse 1]\nFiasco thats my name don't wear it out\nEspecially in front of feds who want to know my where-abouts\nWhere the house and his stash-box at\nHow he live where he is who he flash Glocks at\nAnd them hurt play boys drop all types of change so we gotta dog-fight all night with the range its all right\nYou know I be the all time small nine carrier all across America, quick to bury ya\nWho done pulled out more babies than Heathcliff Huxtable\nHe is W, A-S with the A-R and the L-S with the V-S and his ch-arm kids jealous they get pellets\nBuck shots and what not\nWho tough top get stuck in they mouth like gum-drops\nThese niggas think they're immune but I got chick-booms that will put them in tribunes, resume\n\n[Verse 2]\nNiggas taking mine not permissible. On visual gon' be physical. Niggas don't believe in God make them spiritual\nHe make it out that whip it's a miracle\nNo salad dressing just dress him in his best and bless him I said it so I meant it\nI take it if its local Fed-Ex or if it's distant\nThe business\nMostly sold to the block\nOnly told to my pops\nOnly for if its a lot the Glocks And the watch I dropped\nSealing when I'm peeling\nShop Neimans by the season for the freaks them\nTwo pair of jeans and decent\nNiggas praying I don't see em\nMC's is praying I don't see em\nI'm franchise now\nThey just playing for the season\nI'mma have shoes next year the way I do this here\nI dominate they domino\nIt's common though typically, lyrically catch yourself slipping with me\n\n[Verse 3]\nI'm quite sinister facing two murders one verbal one vehicular\nWhipping ah\nPearl white tight with the cinema\nTwo tears black killing ya\nA few years back was the red room distributor\nLooking ill'er I-L's with the temperature\nSkytell on vibrate hide mail from pirates\nEmperor\nNiggas is pussy and bleed vinegar\nChill-Illy on the index, Jerome on the MX, mack millies\nAnd for-really all you insects one hit wonders don't streak like Windex\nHit Michigan for the caper\nMr. Chen get the paper\nLaundromats in Hong Kong with the accent saying cat trying to wack my smack connect\nBefore he get clipped make sure my stacks correct\nHoes get invaded Cadillacs get wrecked\nNo Problemo long as my habitat's in check", "image": "https://images.genius.com/b67b7f5bfbd7eb8c5c334fa8b05a2432.400x400x1.jpg"}], "artist": "Lupe Fiasco"}