{"songs": [{"title": "Reminische", "album": null, "year": null, "lyrics": "(Verse 1, Big Remo)\nI remember it like a dream\nIt was all clean, rings, accessories\nAnd we ain't puff cabbage we puffed that sensemi\nEspecially, when we been grindin' like two days\nGo in the house and switch hats like a toupee\nWe brown baggin' a back mattress\nWe dressed like we ain't never had shit on the air\nAnd clock a grip for it\nAnd spendin too much cheese\nAnd snortin with skeezers I fell with a nigga\nI helped him and he helped me\nAnd i would ride with him\nWe could of died pullin jobs tryna rob niggas\nAnd then you had a seed unfortunately\nBut very fortunate for you cause dude\nI don't know what the fuck you be goin through\nMy nigga, you was my best friend\nA bitch would never come between us\nRemember that shit\nRims and tires, and backflips in the back of the path\nWe stacked chips, tell them D's cats this\nThen back to the dutchmaster\nTwist it crack a liquor for em\nMy niggas get a cup fill it up\nThis is for my slain and missing ones\nIf you ever had a love found slain or missing\nAlthough you may have parted ways\nThis is how we reminisce\nHey!\n\n(Chorus, Novej)\nNo lie, really how could i forget you\nSometimes, I wish that i could kick it with you\nMore now, than ever\nI wonder do you take time to reminisce\nI reminisce\n\nNo lie, really how could i forget you\nSometimes, I wish that I could kick it with you\nMore now, than ever\nI wonder do you take time to reminisce\nTo Reminisce\n\n(Verse 2, Novej)\nThis is dedicated, yep to everyone that should of made it\nMake it, be reeducated never say that\nIt's too late it's the perfect timing\nOpportunity met by preparation is modern dated\nI feel obligated, to stand tall\nYou recall, when we got raided\nRemember the way we ball\nThey penalized our team\nWho were we playin' for, the cars?\nOh, I'm, just, reminiscing\nWith that in mind we could have a sit down\nWhere we used to, drinkin on deuce-dueces\nThe corner store made a little change off them looses\nFurthermore, what was on my chain cost a few chips\nAnd Ms. You Know Who was like a mother to the whole crew\nHi Ma, ya boy's gone global\nAfter at Noble View, old school\nI paid homage it's an honor\nI know, I never told you\nI reminisce\n\nChorus\n\n(Verse 3, Big Remo, Novej)\n(Big Remo)\nNow you in Cali, I can't ride with a nigga\nWhen shit gettin bout it, Lil Malik gotta meet Lil E\nThey gotta chill, we gotta build\nI tell you bout this life that I live\nCause shit is real for a nigga now\nI met this nigga 9th Wonder he gettin a nigga out there\nHe ain't no joke, I ain't a hoe, yo why'd I I tame the flow\nI'm more reserved, but I still keep it gangsta though, yeah\n(Novej)\nToday is another day, another time at another place\nAnother individual, finds another way\nAnd refuse to catch another case\nAbout food you too? I want another plate\nFor one anothers sake, let's not forget\nWhere we come from, what's done is done, let's elevate\nYeah I remember what they used to say\nBut let's create a bond much stronger bend but never break\n\n(Chorus)\n\n(Outro)", "image": "https://images.genius.com/3bac08dcd927e23d8d0e41d27f713b40.304x304x1.jpg"}], "artist": "9th Wonder"}