{"songs": [{"title": "Compton (OKE)", "album": "OKE: Operation Kill Everything ", "year": "2013-10-10", "lyrics": "[Verse 1: Game]\nI wake up in the morning chilling with my feet up\nLooking on my Instagram for pussy to beat up\nHey, Sap turn that beat up, hey nigga roll that weed up\nRiding through the hood top down trowing that B up\nTurn that YG up, cause niggas fed up\nNiggas get murdered in my city not keeping their head up\nI'm talking Bloods, Crips and shit\nBodies twisting like licorice\nWatch when that pistol lit [Chik-Chik], niggas hit the fence\nCowards, ducking in them lead showers\nCouple of niggas be snitching, pointing like Watts towers [Shshsh]\nThat's how niggas get locked up\n40 Glocc tough? what?\nThat nigga got socked up\nAnd he suing me for four point five\nLet me see, move the decimal\nOnce to the right, that's a forty five\nGlock at the light, now you a vegetable\n\n[Bridge 1: Game]\nTell 'em niggas where I'm from ... you heard\nStat tell em niggas where I'm from\nAR tell em niggas where I'm from ... Esco\nDre, tell em niggas where I'm from\n\n[Bridge 2: Game]\nThe city of money, power and tears\nOverdoses, nightmares, yeah\nCan't walk around here keep talking around here guns spark around here\nYeah\n\n[Verse 2: Stat Quo]\nAtlanta nigga, my nigga raised round J’s, ran plays\nThrowing up trey’s, my dogs squeeze triggers\nDreaming on what we be when we bigger\nFirm Biz delivered\nHaters shiver, they see us\nSedans filled with divas\nSniffing Justin Bieber\nWe staying in the game\nYou lames's in the bleachers\nLuxury vehicles with all the latest features\nThe preachers can't reach us\nSmoking kush on the beaches, no reception\nIt's a blessing ever since recession just progression\nBank account stretching, models in my section\nAs I stare at my reflection, boss nigga\nThese bitches love my complexion, they ain't just talk nigga\nHuh\nCrack in the pot let it bubble on the block\nWatch it double so we can huddle and ball with the Roc\nGot niggas from, Watson, S.W.A.T.’s and niggas from Harlem\nBut my niggas from Compton it's a problem\nFirm Biz\n\n[Bridge 1: Game]\n(Stat Quo: Yeah) Tell 'em niggas where I'm from ... you heard\nStat tell em niggas where I'm from (Stat Quo: DT)\nHey ya'll tell em niggas where I'm from ... Esco\nDrake, tell em niggas where I'm from\n\n[Bridge 2: Game]\nThe city of money, power and tears\nOverdoses, nightmares, yeah\nCan't walk around here keep talking around here guns spark around here\nYeah\n\n[Outro: Stat Quo]\nI swear these niggas lame my nigga\nYou a iPhone 5c nigga\nYou understand that?\nYou the nigga that got the Turquoise back\nYour pull that shit out, niggas'll slapping you off real\nStraight molly-whopping you dog, you're not welcome\nIPhone 5c ass nigga\nYou thought you was just gonna cut the corner and pay 99 to shine\nWe don't fuck with you nigga\nHalf price ass bitch ass soft ass lame ass nigga\nYou understand me?\nYeah", "image": "https://images.genius.com/f04f9b2892eac01c8dd7876593883785.500x500x1.jpg"}], "artist": "The Game"}