{"songs": [{"title": "Tonight’s Da Night", "album": "Whut? Thee Album", "year": "1993-05-04", "lyrics": "[Verse 1: Redman]\nMic check, I can get smooth to any groove\nRelax the tongue, let my mic take a cruise\nAround the planet, pack em in like Janet\nJackson, she's askin' if I can slam it\nI'm—\n\n[Hurricane G]\nYo, yo, Redman, man, what the fuck, man?!\nGet the fuck off that...punk smooth shit, man!\nGet with that rough shit, man; you know how we do!\n\n[Verse 1: Redman]\nMic check, I walk around the streets with a black TEC-9\nBy the waistline, kickin' the hype shit\nI never claim to be the best type of rapper\nBut have to, show them motherfuckers what I'm after\nI'm after the gold, then after that, the platinum\nBeef after that, Hurricane G packs the gat, son\nTrigger, bang, bang, yo bust the slang, what my name?\nIt's the Redman on the funk train\nPsyche, you're motherfuckin' right, tonight's the night\nTo do what I wanna do, to do it like dynamite\nThe work perfected, when the funk been injected\nI roughen up the rough draft to like make your head split\nPunk! Pass the 40 and the blunt and don't front\nOn the block, 'cause when you do front, brothers are gettin' stomped\nI'm not an addict, more like puff than magic\nThen pass it when I'm through 'cause my crew...\n(GOTS TO HAVE IT)\nI don't claim to be a big rap star\n'Cause no matter who you are, you'll still catch a bullet scar\nSo listen up and take heed to what I'm sayin'\n'Cause tonight's the night and me and my niggas ain't playin'\n\n[Interlude over Mary Jane Girls' \"All Night Long\"]\nFat black bitch! Nasty\nBush bear, booga breath bitch\nNasty, talk to your tits bitch\nWith them nasty Africans, Mr. Bojangles\nTurned up shoes havin' ass\nLemming leprechaun haircut motherfucker!\n\n[Verse 2: Redman]\nYou wanna see me get cool, please, save it for the breeze\n'Cause the lyrics and tracks, make me funky like cottage cheese\nFuck the smooth shit, I get down with the boom bip\nLike Q-Tip, I kick more styles than Bruce shoes kick\nBut tonight's the night what I write tonight\nThis type of funk with the flavor like Mike 'n' Ike's\nHanging out with my niggas, my niggas\nThe Pack Pistol Posse keep they fingers on the triggers\nI keep the 40 between my lap, coolin', rollin' down the highway\nBlunt system pumps 'cause it's Friday\nRoll over to pick my boys up, we raise a lot of noise\n'Cause, we can do that black, so \"Get the Bozack\", Jack\nRemember, I do the type of evil that men do\nLike cursin' out my window at a bitch and her friend too\nSo turn the volume up a notch\nAnd watch the ba-BUMP, ba-BUMP, make ya speakers pop\nThat's the funk, when it pumps it makes your rump\nJump, jump, jump...jump, jump, jump\nBut if you want to see a fly but frantic\nCool romantic, more slicker than my man Rick\nYou better check the Yellow Pages under smooth shit\n'Cause Red ain't down for the bullshit\nNiggas fucked up by letting me make an album\n(How come, rude boy?)\nTo get on the mic and let my fuckin' style run\n\n[Interlude over Mary Jane Girls' \"All Night Long\"]\nNasty fuckin' green thumb Jolly Green niggas\nTango mango, pickin' havin' ass\nNasty epileptic disease crazy havin' ass\nJohnny Cash, afro havin'\nJack of Spades, boots havin'\nTony Danza, shoes wearin' ass!\n\n[Verse 3: Redman]\nB-b-b-black by popular demand, I expand\nMy hand to the mic and let my mouth kick the flim flam\nI get sex, I get wreck, I puff mad blunts\nI get vexed, I break necks, punch out gold fronts, chump\nYou—\n\n[Outro]\nYo, fuck that, yo, turn this shit off, man\nTurn this shit off, G\nBoom the new record on, knahmsayin'?", "image": "https://images.genius.com/dc007822478984ef598b7726ec5ad29b.475x475x1.jpg"}], "artist": "Redman"}