{"songs": [{"title": "Redemption", "album": "Views", "year": "2016-04-29", "lyrics": "[Intro]\nYeah, I get it\nI get it, yeah\n\n[Verse 1]\nWhy would I say all these things to have you feelin' a way?\nWhy would I tell you I'm 30 away if I'm not on the way?\nWhy do I settle for women that force me to pick up the pieces?\nWhy do I want an independent woman\nTo feel like she needs me?—I lost my way\n\n[Chorus]\nI'm searchin' for these words to say to you\nPlease give me time\nCause I'm searchin' for these words to say to you\nOh, please give me time\nCause I'm searchin' for these words to say to you right now\nRedemption's on your mind when you think about me, yeah\nRedemption's on your mind when you think about me, yeah\n\n[Verse 2]\nRun your mouth, I'd rather listen to someone else\nI gave your nickname to someone else\nI know you're seein' someone that loves you\nAnd I don't want you to see no one else\nI don't want you here with no one else\nI don't wanna do this with no one else\nI used to know you back when you was young\nYour brother brought me through, you saw me\nThat made me think of you so differently\nI miss the feeling of you missing me\nBut you say you're over and done with me\nAw, yeah, yeah, yeah\nAw, yeah, yeah, yeah\n\n[Chorus]\nNow redemption's on your mind when you think about me\nAw yeah, yeah, yeah\nRedemption's on your mind when you think about me\nAw yeah, yeah, yeah\nRedemption's on your mind when you (think about me)\nAw, please give me time\nCause I'm searchin' for these words\nTo say to you right now, yeah\n\n[Verse 3]\nSay to you—but 80 percent of it was the truth, yeah\nSay to you—a Mercedes coupe that you're still drivin'\nWas for me and you, girl\nReally gon' spend the winter with this other nigga?\nAct like he's really the one to get through it with you\nClicked up with Jessica, Kim\nYou know that I'm bound to see you\nAnd they both say that you're over and done with me\nAw yeah, yeah, yeah\nAw yeah, yeah, yeah\n\n[Chorus]\nThey say redemption's on your mind when you think about me, yeah\nAww yeah, yeah, yeah\nRedemption's on your mind when you think about me\nAw yeah, yeah, yeah\nRedemption's on your mind when you\nAw please give me time\nCause I'm searchin' for these words to say to you right now\n\n[Verse 4]\nDamn\nI'm not unrealistic with none of my women\nI tell them if they ain't with it then let's just forget it\nRelationships slowin' me down, they slow down the vision\nGuess I'm not in a position to deal with commitment\nCertain people need to tell me they're proud of me\nThat mean a lot to me\nNot havin' closure, it take a lot out of me\nThis year for Christmas I just want apologies\nSydney gave up on me when I went missin'\nSyn had a baby and treated me different\nErika sued me and opened a business\nWonder if they wish it could've been different\nWonder what they'd do put in my position\nI wonder, when my shit drop, do they listen?\nWonder if they're second guessin' their decisions\nI hate the number 2, that shit is unforgiven\nTryna satisfy everybody\nIt's like they can't get enough\nUntil enough is enough\nAnd then it's too much\nYou tip the scale when I weigh my options\nWest Palm girls are spoiled rotten\nTiffany on you, you know you poppin'\nI'll kill somebody if they give you problems\nMaster bedroom's where we get it poppin'\nJust ignore all the skeletons in my closet\nI'm a walkin' come-up, I'm a bank deposit\nSell my secrets and get top dollar\nSell my secrets for a Range Rover\nOpportunity and temptation\nThey would sell my secrets for a tropical vacation\nSell my secrets back to me if I was payin'\nWho's gonna save me when I need savin'?\nSince Take Care, I've been caretakin'\nBut second chances, that ain't how you livin'\nRedemption on your mind, I'll never be forgiven\n\n[Outro]\nYeah\nI know", "image": "https://images.genius.com/6f4b9c41ccb18485cccd6aa364ccc3b8.1000x1000x1.jpg"}], "artist": "Drake"}