{"songs": [{"title": "Jesus Walks Remix Version 2", "album": null, "year": null, "lyrics": "[Ma$e]\nThis song right here changed my life... come on, come on!\n\n[Kanye West]\nGod show me the way, now the devil can't break me down\n\n[Verse 1: Common]\nOpen your eyes, there's smoke in the skies\nThe Beast is holdin' a lies\nEverywhere we move, motion denied\nEmotion derived from posters of pride\nOf African, cultures and tribes\nWho live when we suppose they die\nLaugh when we suppose they cry\nThe pain we holding inside\nCause all we really know is survive\nUse that to remember we're kings\nThat's why we so addicted to diamonds and rings\nAnd cutless supremes\nSeen Diana Ross remember that my sisters is queens\nThe Lord is coming -- for now, he visit in dreams\nFor every mission it seems impossible\nSpeak to the gospel to remind me what God can do\nWhen it's not logical\nTo those in hospitals and prisons\nLow-income living\nFor them I say a prayer keep giving\nLearning to receive\nMy heart is burnin' to achieve\nEven when it's hard to breathe, I still believe that\n\n[Hook: Kanye West]\nGod show me the way, now the devil can't break me down\nThe only thing that I pray is that my feet don't fail me now\nAnd now I think there is something that I can say now that'll right my wrongs\nI finally talked to God, I ain't afraid cause His love is so strong\n\n[Verse 2: Kanye West]\nJesus walk with me, he walk with the sinners cause I know I am\nBut I ain't no loser, I'm a winner and I know I can\nOvercome the devil for he get the best of me\nMy daddy always said G-O-D gon' have tests for me\nIllegally they told me to lie when they question me\nBut God sent an angel that said the truth will set you free\nSo in the midst of getting sued for more than my deal\nI admitted I fell asleep at the wheel\nCause I realized I could've died, he saved me\nEvery single hit that got played he gave me\nPeople ask me \"Do you read your Bible?\"\n\"It could help out when you need revival\"\nThere's something about this beat that get me tranquilized\nAnd when I play it at my shows I feel sanctified\nAnd he give me direction when I can't decide\nHe is alive! How could you tell me that he ain't when I said\n\n\n\n[Hook: Kanye West]\n\n[Verse 3: Ma$e]\nBefore you take my name, take my fame\nWhile you at it take my shame\nTake my flaws, take my blame?\nFeel my dirt, conceal my hurt\nSee my bruise, do this and you will walk in my shoes\nYou wasn't there when I was in deep thought\nWhen I had two choice: kill him, or either leave New York\nBut I'm a truth teller, that's why I say what I'm saying\nAnd the only thing the radio is playing\nIs because you be paying\nIt ain't about who really hot no more\nBeasts will knock no more\nSo who cares who flop no more?\nI realize that most labels pay you for lies\nAnd only law dudes can disguise\nThat your favorite artist (shhh)\nI know you hear that (huh?)\nYou wanna fear that? (what?)\nYour worst dream is that you was gonna hear that\nIcon to rap is like John the Baptist\nPrepared the way for what I came to say today\nThey deceived us, having thinking Jesus\nReally didn't need us, when He loved the old days\nHe loved them boys in the hallway up in Broadway\nEven those who be here for dope, every four days\nTo the strippers in broad day up in Norway\nTo the Detroit player gators in Marbres\nWith me, it's not just bars of music\nI walk with God, I got the scars to prove it\n\n[Kanye West]\nGod show me the way, now the devil can't break me down\nThe only thing that I pray is that my feet don't fail me now\n\n[Outro: Ma$e]\nEverybody out there\nJust lift your hands right now\nJust say this with me\nFather, I thank you\nFor forgiving me of everything I've ever done\nFor Jesus walking with me\nFor dying for me\nRaising for me\nAnd all my sins have been forgiven\nI'm a changed man\nI'm healed, I'm delivered, I'm rich\nAnd it's all because of him\nNow walk with me\nWalk with me, walk, walk, walk with me\nWalk with me", "image": "https://images.genius.com/70c6e506a91f6dabdd23cad304812ce3.533x533x1.jpg"}], "artist": "Kanye West"}