{"songs": [{"title": "Starting To Look Like An M&M!", "album": null, "year": null, "lyrics": "In a recent sit-down with MTV News’ Tim Kash, 50 laughed off recent rumors that Em — who has all but disappeared from the public eye in recent years — has been packing on the pounds, and that as a result of his weight gain, has become a recluse, venturing out of his Detroit-area mansion only to gorge himself on meals from Taco Bell and Outback Steakhouse. The G-Unit captain insisted that fans are going to be seeing a slim-and-trim Eminem real soon.\n\n“Em is in shape right now. He looks good. I seen him in Detroit. He’s gonna look real good when you see him return,” Fif laughed. “He’s in shape right now.”\n\nThe rapper has been on hiatus ever since releasing his official Shady Records mixtape, Eminem Presents the Re-Up, in December of 2006. In mid-2007, he called in to Angie Martinez’s show on New York radio station Hot 97 to say he was “in limbo” and “debating” whether to release another album . Then, in January of this year, news broke that he had been rushed to a Detroit-area hospital for complications related to pneumonia , and in at least one of those reports, sources were quoted as saying his weight had exceeded 200 lbs.\n\nThose rumors — coupled with a National Enquirer story that quoted an “insider” as saying that the rapper “[has] got a double chin, a potbelly and droopy man-breasts. And he’s living a reclusive lifestyle in an attempt to hide his new body” — had fans worried about Eminem. But 50, who in recent weeks has battled rumors about his own weight thanks to online photos that show him looking extra gaunt, said that those worries are unfounded. According to him, Em’s fine and in fighting shape (or at least, balling shape).\n\n“The last time I seen him we played basketball together,” 50 said. “He had a knee injury, so we chilled for a little bit.”", "image": "https://images.genius.com/b379811c1415017b9f3e3a71b9d26060.400x400x1.jpg"}], "artist": "Eminem"}