{"songs": [{"title": "Stewie Griffin", "album": "Young Sinatra", "year": "2011-09-19", "lyrics": "[Intro: Stewie Griffin, Brian Griffin & Girl]\nLogic taught me\n\"So, uh... it's been twenty-four hours. Got my money?\"\n\"Oh... uh, you know what, just give me 'til next Friday. I'll have it for you.\"\n\"Oh-oh, uh, that's funny. I could've sworn I said 'have it today'?\"\n\"Yeah... I don't have it, sorry.\"\n\"Oh. Well alright then...\nYeah, that's what happens man!\"\n\n[Verse 1: Logic]\nI'm Stewie Griffin\nAnd this game is Brian\nBeatin' the hell out of em'\nTryin', to get this money\nCheck the statistics\nThe chances of me blowin' up are far from realistic\nFuck it, I'll risk it\nTo have a chance at fame, I'd never miss it\nI know I'm gonna be famous 'cause my friends and family insisted\n(laughs)\nBeen on the low, concealing my shit just like a biscuit\nBut it's time to let off, set off, break this bread off\nBitches I'm comin' and I ain't finna pull out\nAll I do is get this money\nCut these records and cool out\nMy favorite night of the week to perform is Friday\nBut I kinda see it as Louis Vuitton day\n'Cause when I step up on the stage\nI'm snatchin' mics like Kanye\nToo swift to book me for the night\nThat's Andre\nThree stacks, I do it big\nTake no relax, I'm spittin' the facts\nCatch me in the booth, droppin' tracks\nYeah they talkin' bout me\nYeah, I know they talkin' bout me\nYeah I know they talkin' bout me but\nNever face to face, they evade it\nBy rappers I'm hated\nBecause I'm fly, while they just levitated\nAs the hating escalated\nMy flow, it just elevated\nBitches I made it\n\n[Verse 2: Logic]\nYoung jedi, all I do is stack bread\nI said I be in the crib bumpin' Red Hot Chili Peppers\nThis right here for all my city reppers\nFly talker, sky walker, get gritty reppers\nFollow your dreams, this life ain't what it seems\nThey used to tell me I'd never make it\nNow my flow streams\nAcross the world, spit lyrics, let them unfurl\nPoetic rhetoric my girl\nGot my mind playin' tricks on me\nMy eyes is closed, the ice is froze, I got it\nHip-hop was never dead, but it was fallin'\nAnd I caught it\nThe way I process chips, you think my brain's robotic\nFuckin' with bitches overseas cos the pussy's exotic\nI went from switchin' lanes in the rain\nTo switchin' planes with dames\nPoppin' champagne, spittin' game, and gettin' brain\n\n[Outro]\n\n[Stewie Griffin]\n\"Don't bring that trash in here. This is my house!\"", "image": "https://images.genius.com/6118bfdbbde22320e3c6bc130e1772d3.1000x1000x1.jpg"}], "artist": "Logic"}