{"songs": [{"title": "Kon Karne", "album": "MM.. FOOD?", "year": "2004-11-16", "lyrics": "[Verse: MF DOOM + sample]\nDarker than the East river, larger than the Empire State\nWhere the beast who guard the barbed wire gate\nIs on the job—not my fate, tired of the wait\n'Til the Villain bring deliverance from the dire straits\nFire at a higher rate why'd they make the liars?\nFliers scatter, buy a plate—isolate the wires\nTry the straight pliers, if not—the vice grips\nA real price-saver way to acquire nice whips\nWhat a steal for real on wheels of steel\nStunner, a funner summer number-one meal deal-bummer\nA bizarre phenomenon—is your armor on?\nTake your cash, Karma, or break your fast—Ramadan\nTransaction drama—aw, come on, Barney\nClack, clack—pardon me, wack rap con carne\nHe came to feed the childrens like Sally Struthers\nAfter that, he's going back to Cali, where's the—(\"—love is—\")\nWilder than the Nile, hold power like the great pyramids\nOf Giza, and stay leanin' like the tower of Pisa\nGive him something he can feel that's soft to squeeza\nRaw with the pen, and on the mic—off the hezza\nGet shot off that wide-eyed talk\nIf he had a pot—he'd still piss on the sidewalk\nCan't take the street out the street-person\nLookin' for the perfect beat, coercion into heat-burstin'\nThey couldn't spot him on the spot date\nGot the only tape that come with a free hot-plate\nWhoever do get to see me sing\nWith the 3-D ring, sittin' stationary like B.B. King\nCan see how it really sting—it ain't no front row\nStanding room only at the motocross stunt show\nThe ruckus ain't up to Snuffleupagus\nMe and Sub' is like the brown Smothers Brothers (\"My love is—\")\nVaster than the seven seas, bigger than Mount Kilimanjaro\nIf they don't know, fill 'em in tomorrow\nOn the horror show, a mental note: return Bob’s record\nSwear to God, before he gets a job, he robs Eckerd\nBlessed with a hot flow—tested—it got dough\nInvested in stress, the best to finesse an opto\nAs I reminisce, never forgot when I was very broke\nShot the Henny straight, couldn't afford to cop the Cherry Coke\nOr should I say, broke with wealth?\nTo know enough to give them just enough rope to yoke they self\nPlan B before I take the ring and pawn it\nThe long arm of the law couldn't even put they fingers on it\nDog-gone it—do the statistics\nHow he bust lyrics—it's too futuristic for ballistics\nAnd far too eccentric for forensics\nI dedicate this mix to Subroc, the hip-hop Hendrix\n\n[Outro: Sample + [?]]\n\"In my pocket, a note. \nIt's—from my father.\"\n\"—from the guard's whip. Is this a trick?\nWhy would I resort to trickery? You're already a prisoner. What do I gain by deceiving you?\nYou can't blame me for being suspicious.\"\n\"No.\"\nHehe\n\n[Produced by MF DOOM]", "image": "https://images.genius.com/f67af5eb94d7101171adfff4ca96a76c.1000x1000x1.jpg"}], "artist": "MF DOOM"}