{"songs": [{"title": "The Come Up", "album": "Young Sinatra: Welcome to Forever", "year": "2013-05-07", "lyrics": "[Intro]\n\"Now some guys they just hate for no reason, capiche?\"\nAy yo 6ix, This shit is crazy right? Remember when we used to be in Lenny’s basement and shit? Now where we at? The Come Up\n\"Fuck yo money, fuck yo jewelry, fuck yo cars\nFuck all yo bitches that you got\nIt's obsolete, now\nAll that shit ain't fresh no more, fuck all that\"\n\n[Verse 1]\nOn the real homie, on the real\nTell me how you feel\nEverything I spit is gold like I got a grill\nBet you people talking thought I'd sell out once I got a deal\nStill me and my team, only difference - we live in the hills\nWe living a dream, these bitches perpetrating the skills\nAt the soup kitchen with my mama they giving us meals\nI was poor in my adolescence but now I'm getting mills\nCome on, tell me how it feels when that brand new record spills\nHomie this the come up\nI'm from where them drug dealers will run up\nBut I was never 'bout that shit, I just worked till the sun up\nOh yeah\nClaiming that they got it over there\nBut they never had it over there\nMotherfucker this the come up\n\n[Chorus]\nCame a long way, this the come up\nBeen a long time coming, it's the come up\nBeen a long damn time, it's the come up\n\n[Verse 2]\nOpen your mind, this is work ethic\nNinety-nine percent of you couldn't comprehend the method\nCause you too wrapped up in the money and bitches\nI get riches but never sacrifice the art\nBeen real from the start, now break it down\nThat super-duper-killer flow\nAll these bitches in here make you wanna kill a ho\nIt's kind of funny how the flow make me sound ignant\nBut you know the wordplay on another level, isn't it?\nI been at it since a youngin on a dolo\nTill I got a team and said bye to doing it solo\nBad bitches wanna fuck me on the low though\nTryna' break the ice she like, \"Can I get a photo?\"\nA long time comin', what you call that?\nShorty blowin' up my phone, I promise to call back\nUnless you a crazy ass bitch\nI'mma tell your ass to fall back\nThis the come up\n\n[Chorus]\nCame a long way, this the come up\nBeen a long time coming, it's the come up\nBeen a long damn time, it's the come up\n\n[Outro: Seth MacFarlane]\nMaybe baby\nLogic", "image": "https://images.genius.com/da76d57af3e6ee702af91bac2a18326a.1000x1000x1.jpg"}], "artist": "Logic"}