{"songs": [{"title": "Soopaman Lova IV", "album": "Doc’s da Name 2000", "year": "1998-12-08", "lyrics": "Yo yo Yo Yo YO!\nYO! Call me Soopaman Luva the rude bwoy\nThat nigga SWV lose they cool for\nHa ha ha, ha ha, ha hah!\nAh-hah AH-HAH ah-hah AH-HAH\nAh-hahahaha-hah-ha\n\nYo yo, I'm usually flyin through the motherfuckin air\nBut the utility belt on my underwear need repairs\nSo I be in back of the bus unwrappin a Dutch\nLeft court for child support, bitch attackin my bucks (WHY?)\nThey wanna fuck with certified private eye\nEvery week, check stubs to show the judge I got a job\nDamn this; Soopaman used to stack them chips\nNow I'm broke cause little kids riding Batman dick\nI'm not a hater but the Caped Crusader blockin my dough\nAnd I'll let off before I push broom on HBO for Mr. Show\nI'm critically acclaimed; but the press'll fuck my name up\nPolice is lookin for me, call the mayor he'a hang up\nNowhere to run to and Brownstone even know it\nSo I pack the fo'-fifth, and the ice on your wrist, forfeit\nNo game; slappin all hoes who got the fame\nThen I rob em with chickens who got phone bills in they mama name\n(You've been framed!) Yeah yeah I know I gotta go out\nSo I'm shuttin the game down like 30 nuthin blowout\nI rip the flow out, from the ceiling, if I spot cash peel it\nSoopaman Luva gon' switch to Soopaman Villain\n\n[Dave Hollister]\nSoopaman! Roll up a L for me\nKnow I got to pack the heat (sing that shit Dave)\nCause niggas tryin to fuck with me\n(Who am I?)\nSoopaman! Flyin through the air high\nSmokin on that bom-baa\nI don't give a fuck if I die\n(Who am I?)\n\n[Redman]\nYo yo, I'm back on deck, I never lost the pep in my step\nRide in the cab, drunk as hell, weed and Beck's on my breath\nI'm undercover so I'm dressed in turtleneck and the vest\nTec by the waist, yo cabbie make a left on the next\nCorner, get out and let the 30-30 cock the loogie\nTryin to set me up like Jim Kelly, MUY, MUY\nBefore I hit somebody they say, \"We ain't do it!\"\nI believe them these the same niggas I grew up in the hood wit\n\nYo yo yo, what's today's date?\n...\nShh, December 8th?\nMan today my god damn day off\nYo I'm outta here\n...\nYeah, yeah yeah yeah right papi\nI'll slap the shit out you", "image": "https://images.genius.com/ff1bcd7d83855df13cac08a00e033052.594x594x1.jpg"}], "artist": "Redman"}