{"songs": [{"title": "Tilted", "album": "Lupe the Jedi", "year": "2011-09-13", "lyrics": "Yeah!\n\n[Verse 1]\nI was like Porsche puller, Air Force footer\nAutomatic wristed therefore shook-up\nCausing a stir every time I push up\n007 with a jester and a look-up\nIt's Carrera-Ella from the F&F crew\nWith a tiger on his shirt, alligator on his blues\nWith a nice young lady and some righteous kung-fu\nI'm fighting without fighting, enlightening you young fools\nFrankensteins of mine, I tighten you young screws\nSend lighting to your mind and make you move\nCar like cannonball, run!\nI'm lighting my guns fuse, one:\nThat mean I'll lean and leave you, I mean this, Needlz\nThey hook to my hooks, they rehearse my verse\nAnd they sing my singles I can't even see you\n\n[Hook]\nWith it tilted, brim low, brim low\nWith a Cartier eye and his car go by like\nNEEEEEEOOOOOWWWWW!\nTilted (tilted), brim low, brim low\nWith a Cartier eye, and his car go by like\nNEEEEEEOOOOOWWWWW!\nFresh-to-def F&F!\n\n[Verse 2]\nI wear Cartier glasses, Van dutch pants-es\nGameboy Advances next to the black berry\nI'm next to my black berry Molasses\nHat very slanted rapping to the riders\nWriter of the stances driver of the riders\nMatter of fact Shur the chauffeur\nReverse the fifteen teen is so serve\nThe serve is so mean like I served in the marines\nAnd it's full metal jacket\nUpset the jokers every time I draft it\nThey trys to jack it change my will\nI can wait for triple A I remain, I chill\nEven still niggas don't know the drill\nAnd I mean it needles\nJust hook em with my hooks, they rehearse my verse\nAnd they sing my singles I can't even see you\n\n[Hook]\nWith it tilted, brim low, brim low\nWith a Cartier eye and his car go by like\nNEEEEEEOOOOOWWWWW!\nTilted (tilted), brim low, brim low\nWith a Cartier eye, and his car go by like\nNEEEEEEOOOOOWWWWW!\nFresh-to-def F&F!\n\n[Verse 3]\nF, F I to the A S C O, flyin' like Neo\nThey lien' like Leo, Cleo maybe they fronted\nBut they ain't never done it like he though\nRefering to me Joe!\nI feed them through the bars like CO's\nI lead them through the harm like a Hero\nPeaceful\nBut I can bring the violence like Nero\nRight to your keyhole then bring it back to silence\nCause that's the G-Code\nWhich means that if you brought it or your about to bring it on\nBut tell the polices I ain't seen it because I had it\n\n[Hook]\nTilted, brim low, brim low\nWith a Cartier eye and his car go by like\nNEEEEEEOOOOOWWWWW!\nTilted (tilted), brim low, brim low\nWith a Cartier eye, and his car go by like\nNEEEEEEOOOOOWWWWW!\nFresh-to-def F&F!\n\n[Gunshot]", "image": "https://images.genius.com/373c57c9cfddd95f1d232784084809ba.500x500x1.jpg"}], "artist": "Lupe Fiasco"}