{"songs": [{"title": "Jesse James", "album": "The Diary", "year": "1994-10-18", "lyrics": "[Verse 1]\nSnuck up behind him, had his hands in his pocket\nTook my pistol out, unlocked it\nPulled the hammer back and - cocked it\nAnd left his shit all on the carpet\nI seen a (murder, murder) I pin-pointed my target\nI'm making my way up out the building\nI got the nigga that I came here to get, notify his children\nThat they old man done fell up out the game\nBecause I came through this motherfucka\nAnd killed his ass just like Jesse James\n\n[Hook]\nThink it's a motherfuckin game?\nI come around this muthafucka and kill yo ass just like Jesse James\nWhat's my motherfuckin name?\n\n[Verse 2]\nThere'll be no witnesses to this homicide\nNo re-enactment on the late night news to be re-dramatized\nAll you got is a nigga with a dot\nIn the middle of his motherfuckin' head he been shot\nDropped in the middle of the floor and he ain't breathin\nAnd the nigga's on the go cause we ain't seen him\nHe did his dirt and got the fuck up out the picture\nThe hollow point just hitcha, out of line, so it got witcha\nCall the motherfuckin helicopter\nBut ain't no hope, cause the nina broke that nigga off a hella proper\nThat oughta hold your monkey ass (motherfucka, you)\nThat oughta teach your funky ass (motherfucka, you)\nI know this motherfuckin game is sheist\nAnd you done lost the fuckin game of life\nAnd that's a motherfuckin shame\nYou let a nigga come around and do yo ass just like Jesse James\n\n[Hook]\nThink it's a motherfuckin game?\nI come around this muthafucka and kill yo ass just like Jesse James\nWhat's my motherfuckin name?\n\n[Verse 3]\nWait - this motherfucka got me bent, I gots to - break\nBecause this nigga done put his hands all up in my - face\nHe best to chill before I hit him with this - mace\nAnd catch this motherfuckin case\nCause once I got him blind, then he done with\nBecause I'm true to myself, fuck the dumb shit\nYou ain't no motherfuckin gangsta, gee\nAnd when I get up out your ass you gon' realize it just ain'tsta be\nIt ain't no studio up in me\nAnd all that bullshit I'm hearin you talk only offends me\nAnd lately I'm under a lot of pressure\nIt seems to me you can't come clean, so yo, I gots to check ya\nI pull my .45 and (buck, buck, buck, buck)\nAnd right before he die I (fuck, fuck, fuck, fuck)\nI could give a motherfuck about the sentence\nI snatch yo ass up off the hinges cause I'm (SCREAMING FOR VENGEANCE)\nCause life has no meaning, no meaning\nWe were all born to die, so no screaming\nThink it's a motherfuckin game?\nI'll come around this motherfucka and cut yo ass just like Jesse James\nBlow out your motherfuckin brains\n\n[Hook]\nThink it's a motherfuckin game?\nI come around this muthafucka and kill yo ass just like Jesse James\nWhat's my motherfuckin name?", "image": "https://images.genius.com/18ccee2c198d56c7f1368268755e5bd3.1000x966x1.jpg"}], "artist": "Scarface"}