{"songs": [{"title": "Algorythm*", "album": "Spirits", "year": null, "lyrics": "[Verse 1]\nSuper computer status, walking alone in the streets\nEveryone is an addict, know what its gon' be\nWhat was the motivation? Constant communication\nEverybody wanna get chose like Moses\nCame out mother earth smelling like roses\nSummon the new edition, made it way too efficient\nMade us the guinea pig, and did it with no permission\nI told him to call a friend, didn't tell him to listen\nTo very scary, to binary, zero and one\nThat code is like, my cousin [?]\nI dream in color, not black and white\nYou sell your daughter on that data stream\n'Cause you don’t want me making hits, huh?\nHumans don't understand, humans gon' sell a lie\n'Cause humans gotta survive, we know we gon' die\nNothing can live forever, you know we gon' try\nLife isn't really worth it, the algorythm is perfect\n\n[Chorus]\nEverybody move your body, now do it\nHere is something that's gonna make you move and groove\n(Please don't lose that tempo)\nAlgorythm\n(Moving how they say so)\nAlgorythm\n\n[Interlude: Preacher]\nWe done solved everything\nY'all might as well put your hands together\nYou might as well lift them too\nCome on\n\n[Verse 2]\nStep, step, slide, slide, move your body from side to side\nClap your hands, don’t stop the vibe\nJust keep moving, you might survive\nPressure is to evolve\nTook a bite of the apple, we crushing it to its sauce\nHow do we know the cost?\nHow do we know the truth when our feeling just could be false?\nFreedom of being wrong, freedom of being lost\nWe don't have to wait a minute (Wait a minute)\nFeeling like a devil did it (Devil did it)\nOh lord, I'ma step to it (Step to it)\nDo it from behind if you can’t do it\nOoh you eating good over here? (Yeah!)\nIs you eating good over there? (No!)\nFeeling on the move do I care?\nLooking for something worth it, the algorythm is perfect\n\n[Chorus]\nEverybody move your body, now do it\nHere is something that's gonna make you move and groove\n(Please don't lose that tempo)\nAlgorythm\n(Moving how they say so)\nAlgorythm\nEverybody move your body, now do it\nHere is something that's gonna make you move and groove\nAlgorythm, Algorythm\n\n[Refrain]\nAlgorythm, can you hear me?\nDo you love me?\nCan you hear me out?\nCan you help me out?\nSay hell yeah (hell yeah)\nSay hell yeah (hell yeah)\nSay hell yeah (hell yeah)\nSay hell yeah (hell yeah)\nSay hell yeah (hell yeah)\nSay hell yeah (hell yeah)\nSay hell yeah (hell yeah)\n\n[Outro]\nI’ve been waiting\nI’ve been waiting\nI’ve been waiting\nCan you feel it?\nCan you feel it?\nWoo, ahh", "image": "https://images.genius.com/9a602fc29c2e6980cc6607a72c061610.737x851x1.png"}], "artist": "Childish Gambino"}