{"songs": [{"title": "It’s a Set Up", "album": "Kuruption!", "year": "1998-10-06", "lyrics": "Let's do it doggs, ring ding dong\nBitch (aha, aha), bitch (yeah what what what what what?)\nBeeitch (set up, set up, set up), beeitch (it's a set up)\nWhat they're doing? They're trying to...\n\nThey're trying to set me up, they're trying to set me up\nThey wanna set me up, they wanna set me up\nThey're trying to set me up, they're trying to set me up\nThey're trying to set me up, but check it out\n\nThis is it, call it how you wanna call it\nBrawling, call in the headhunter, start headhunting\nHow do you want it? I said we could spread arms\nBust and stare, you wanna snatch a life, is that right?\nWanna-get-rich ass nigga, snitch ass nigga\nFake switch bitch ass nigga, up-in-to-get-lynched ass nigga\nAin't nothing to it, raw doggs doing the lynching, master assassins\nHenchmen, the whole world's against me (fuck 'em)\nIt's a million to one, Kurupt with one gun\nAnd a whole backyard of ammo\nDump these lumps in nigga's backs like a camel\nGet torn and worn just like sandals, now his Willy came to an end\nYou see that nigga he ride with, do him in\nThis nigga's so sweet, he got my girl to set me\nGot her with the tech to tack me and disconnect me\nThere's no (???) when you're playing Russian roulette\nThey're trying to catch me, lay me down and sketch me\nYoung Gotti, (???)\nBringing the whole fucking entourage of murderous minds\nI don't know who rides with a mental dome, who will and who won't\nTrust me, they all wanna bust me, it's a set up\n\nChorus:\nI don't give a fuck who you bring to the table\nAnd I don't give a fuck who you got with you\nYou played me, you're Kane and I'm Abel\nNow the ammo drops, watch 'fore the Glock hits you (it's a set up)\nDon't you know? You fuck around with death sentinel\nIf you didn't learn you'd better start learning (it's a set up nigga)\nAiming, bust and hit your left and you're cold\nThat's how motherfuckers get murdered\n\nHit the (???), fuck a sun roof, this car is dirty\nDirty dirty buster, dirty motherfuckers\nHoller at the big homie Slop (what up Slop? what's up y'all?)\nHit me on the hip, hit it quick on the dick\nGet this rap slapped in the clip\nYou see this black nigga, you'd better duck him\nThorough, in every neighborhood and borough, like motherfuck 'em\nYeah you know me, oh you wanna show me a thang or two\nHow y'all do, nigga show me, creep through slowly\nFriction, I can feel it all around me, my intuition\nLA gangbang mentality got me on a violent spree, violently\nBusting, dusting niggas off silently\nI ain't even trying to be what I can be or could handle\nBut niggas trying to make me an example\nGo over to the West (to the West), niggas wanna feud\nGo back to the East (to the East), niggas wanna feud\nI'm 'bout to go to the North and South to see, what\nAre y'all niggas on that same fucking bullshit, cuz? (I don't know)\n\nChorus\n\nIt's a set up motherfucker, what, it's a set up\nI'm tired of these bitch ass niggas, it's a set up nigga\n\nCan't help it, hoes come through\nMe set, I know 'em, they're out to set me\nThey wanna get me, get the homies\nThe rainstorm's coming and every motherfucker's trying to wet me\nYo it's unforgettable, no you can't touch me\nClutch me like a mic, and do just what you like?\nHell no nigga, even though you dislike me\nYou wanna be just like me, niggas they despite me\nSee all the homies, I make loot like Spike Lee\nDozens, rolling through with me, my homies and my cousins\nI give a fuck nigga, I could stay busting\nAnd still rock it right, and hit the spotlight\nShine bright, these fake ass niggas, snake ass niggas\nEarthquake ass niggas, I shake these niggas\nShake ass niggas, thinking you can come through all the time\nWanna fuck with Kurupt, I just sit, prepare the rhyme\nNow I'm all about the cash nigga\nThinking you could come through\nYou got your heater cocking on busts you just flashed nigga\n\nChorus (2x)\n\nMurdered...\nWhat? Attack assassins, huh\nJust ask the homie D, he rides with me\nJust ask the homie Snoop, S-N-double O-P, he rides with me\nJust ask my big homeboy, my big homie, he rides with me\nHuh, ask 'em all, they ride with me\nTop doggs, D-O-double G's, they ride with me\nAsk my homie Big (???), he rides with me\nAsk the big homeboy B, he rides with me\nAnd the homie D, Slop, what? they ride with me\nBig C, he rides with me\nBig Tray D rides with me\nBig Sean D rides with me\nBig Breez, he rides with me\nK-U-R-U-P-T, beeitch!", "image": "https://images.genius.com/a7652517cf446c15e882aa0bc85229b3.594x594x1.jpg"}], "artist": "Kurupt"}