{"songs": [{"title": "Strangeulation I", "album": "Strangeulation", "year": "2014-03-27", "lyrics": "Strangeulation I\n\n[Intro]\nHmm... Tech N9ne!\nSmashes the masses, but the industry's hatin' asses\n\n[Verse 1]\nStrange days, when your favorite rapper's poppin'\nBut \"Is he on top?\" Is something you can't gauge\nEspecially when he's toppin' the charts\nAnd you see me, K. Lamar, and Macklemore sharing the same stage\nI'm the nigga all these artists look up to\nYet for Tech, it's been the hardest to bust through\nBut I keep my fans fiendin' like clucks do\nYou don't like how we living, well... (\"Fuck you\")\nI dominate your conglomerate, want a beating? I can accommodate\nIt'll be a non-debate, coming up against Aaron the Great\nSo many got arms, legs and necks tatted, Strange\n'Cause music, show, conceptually, I'm the best at it\nLet's have it for all of these Tech addicts\nAny disrespect to family will get your chest gatted\nAimin' at 'em and it's agony\nBurner blew his brain in back and these\nCannons came and caved in cavity, caliber connect, cap it\nYo, there it go, red is in my head, it grow\nHeaded fo', lead and deaded, yeah, the medic said it so\nLet it grow, shred it and get no credits, so pathetic though\nDread embedded steppin' in heaven's crevice, wet and edible\nGive her the shivers when I deliver this\nHit her then quit her 'cause she's on Twitter shit\nAnd when she compared me to Eminem, I said \"I'm different\"\nShe said \"How?\", I said \"I'm black and I can say 'nigger', bitch!\"\nTo him, I may be just another bro with a flow\nWho'll probably never tour 'cause it'll be thousands of Juggalos at a show\nAnd I heard fatalities happen on each side, so that's never no let it go\nSo I get it, I keep what I'm makin' incredible, all of them scared of a negro\nStrangeulation, this occupation so scandalous\nWe stop the hatin', no chances\nWhen I rock the nation, so Danzig\nI'm killing all these niggas, Operation Code Kansas\nStrange gang plain triggered assassins\nGot a bunch of untamed aimed trained spitters a' blastin'\nMy insane brain sayin' \"Give up the rappin'\nAnd go back to the gang bang thang\", nigga, what's happenin'? Soo-woo", "image": "https://images.genius.com/a97c6b9421fc6142eef43b7f37277096.500x501x1.jpg"}], "artist": "Tech N9ne"}