{"songs": [{"title": "Dream Killa", "album": "Grown Man Sh!t", "year": "2005-07-26", "lyrics": "[Verse 1: Proof]\nThis is me dawg, this isn't no \"E\" talking\nDeep thoughts in my dreams\nPlea bargain, I know we see often...\nThe tights and then hammers, the lights & the cameras\nSo-called friends scramble when your life's pretty jammed up\nMy wrists fight with handcuffs, my soul held hostage\nThese jail bars are symbolic of dispelled knowledge\nHis hell's hot\nHis thoughts of semen birthed an idol when we started dreaming\nI wish you could feel my heart is beating\nAnd part the reason I'm this fucked because of Marshall why wasn't partial to stand on his follicles\nI didn't care no obstacle too big, I can't believe head lost his head, now I'm heading to the booth to be Proof\nNothing less\nSomething else got these leeches teaching me freedom is everything\nDirty Harry brings... justice to moochers\nProof just big-hearted with the passion to form art\nThese clowns take advantage of my start\nTake advantage of opportunity\nSo stop pursuing me, you devils will not ruin me\nGod, who is he? Show his face, know this place\nSlow the pace, coldest ray, motive: rage\nOld & raised, damn I miss the golden days...\n\n[Hook]\nSometimes I feel that no one is real\nAnd some on my team are single-handedly killing my dreams\nSometimes I feel that no one is real\nSome on my team are single-handedly killing my dreams\n\n[Verse 2]\nI only been Proof since '88, I was living proof\nA testimony of truth what I'm giving you\nSo from '89 to now, I struggle with rap\nMet Em, D12, had kids, got Bugz on the tat\nLove in my past...\nBut now I'm flooded with evils like the drugs of my dad\nI wasn't the bag...\nAs I recall, before D12 hit, I was headed to hell, man\nFucking around with Delvin\nDid a tail spin when Snook got took, when Bugz got done\nAt night, I'm thinking to myself, \"Damn, am I the next one?\"\nLook in the mirror, my mental's deep\nI let this info leak: As a man, I feel incomplete\nI'm confused, I'm sobering, fuck a pill now\nOh I got it, pass the brew, give me a pill now!\nAnd what's real, while in Austin, I lost it for a lady friend named Adrian\nCo. lends, no friends, but Dolo sold though\nIs my solo for more dough? Or to unleash demons?\nSeeming to me & myself, my wealth, my health, I'm breathing...\nTo even the score of these exec's with publishing checks\nOf musical vet's that's in unusual debts\nConfusing the rest when, nigga, shit, we're losing the best!\nPac & Big\nIf I could live the right life, I'd invite Christ\nI know you all could, it's not all good!\nMy dreams are choked, the king is woke\nI fiend for reality like fiends for dope...\n*ahem* Let me clean my throat\nI fiend for reality like fiends for dope\n\n[Hook]\nSometimes I feel that no one is real\nAnd some on my team are single-handedly killing my dreams\nSometimes I feel that no one is real\nSome on my team are single-handedly killing my dreams", "image": "https://images.genius.com/28ff9193e1357f6fde4a825e763f7ce0.593x593x1.jpg"}], "artist": "Proof"}