{"songs": [{"title": "Caught in the Rain", "album": "Knock Madness", "year": "2013-11-26", "lyrics": "[Verse 1]\nSoon after I dropped Raw the spotlight creeped up\nI received love from fans throughout the world, yeah, seems nuts\nIs it God, could it be luck?\nI put my toes it the sand and ended up with my feet stuck\nWhen the storm comes, then how should we address it?\nMy situation with Ruthless turned out to be a blessing\nDuring the time it left every ounce of me affected\nBut when it was done I saw that I was bound to be a legend\nBut I'm lost\nThe fame drivin' me crazy, cry when I'm angry, the game's trying to change me\nSinister record labels got desires to paint me\nAs the world puts they fucking hands high to embrace me\nHow would you take it in?\nI honestly can't pretend\nThe only reason I started rapping was to make a friend\nAnd now I got fans who love me for creating sins\nYou think fame ain't got a dark side? Think again, yo\n\n[Chorus]\nFame can make you insane (It's so strange)\nEveryday I feel I'm caught in the rain\nOnly very few have walked in my shoes\nI sit alone in my room feelin' so damn confused\n'Cause I don't know who the hell I am\n\n[Verse 2]\nYeah, scared I might never get a wife\nCloser I move into the limelight shit is like\nGirls just want to be next to me cause I rip the mic\nSayin' they love me, but the vibe I get isn't right\nWhat if I flop when my album dropped\nAnd went broke? Baby, tell me, would your love just stop?\nSee I'm in love with you, but you in love with Hop\nThe struggle's real, but through your eyes it's fun to watch\nI swear to god I used to fiend for it\nI see the fire but I keep going\nI smell the sins from the breeze blowin'\nMy crew is telling me to beast mode it\nI feel like I'm going to hell, I keep it up even my priest knows it\nSo many women and the money is great\nBut this life just isn't me and I don't want to be fake\nI didn't think that it would come to this day\nIt's time I put my alter ego to the side and leave him stuck in his grave\n\n[Chorus]\nFame can make you insane (It's so strange)\nEveryday I feel I'm caught in the rain\nOnly very few have walked in my shoes\nI sit alone in my room feelin' so damn confused\n'Cause I don't know who the hell I am\n\n[Verse 3]\nShit, not anymore, my soul's rotten and sore\nI hear a knock at the door, for real\nI got a lot to endure, there ain't no stopping the storm\nHomie, the top isn't warm, so chill\nI think I need my light bulb fixed\nAs of lately I ain't be getting hyped on shit\nLife's a journey, you gotta find your niche\nI'm leaving this tight space because I don't fit\nNow I'm moving away, my whole life I'ma start from scratch\nAs an artist I'm trapped, fuck Hop, Marcus is back\nFor a while it's gon' be hard to adapt\nBut I'm willing to go through it, I ain't starving to rap\nI'm soul searching, it's like I'm living with no purpose\nI tried find a spark to spit but there's no urges\nInside of me for me to pursue it, some people think that I'm stupid\nBut don't judge if you ain't went through it\nI'm out\n\n[Chorus (Extended)]\nFame can make you insane (It's so strange)\nEveryday I feel I'm caught in the rain\nOnly very few have walked in my shoes\nI sit alone in my room feelin' so damn confused\n'Cause I don't know who the hell I am\nFame can make you insane (It's so strange)\nEveryday I feel I'm caught in the rain\nOnly very few have walked in my shoes\nI sit alone in my room feelin' so damn confused\n'Cause I don't know who the hell I am\nFame can make you insane (It's so strange)\nEveryday I feel I'm caught in the rain\nOnly very few have walked in my shoes\nI sit alone in my room feelin' so damn confused\n'Cause I don't know who the hell I am", "image": "https://images.genius.com/89f3b594c1d21cb0ced76a0e54600701.1000x1000x1.jpg"}], "artist": "Hopsin"}