{"songs": [{"title": "Block Work", "album": "#T5DOA: Freestyle Edition", "year": "2015-05-01", "lyrics": "[Intro: Jadakiss (Styles P)]\nYeah, ride out, if I ain't got no money\nHow I'm losin' weight (huh) HA-HAAAEEH!\nRide out (D-Block!)\n\n[Verse: Jadakiss and Styles P]\nGather 'round, y'all, it's goin' down, y'all\nBlock work, twenty-eight for the pound, y'all\nIf he the king, I put a round in his crown, y'all\nHe just talkin', but he pussy in the town, y'all\nI air 'em out, then put 'em in the ground, y'all\nHit him in the church if he prayin' on my downfall\nIt's either this or you wicked with a round ball\nIt's a burial whenever we sound off\nHands to the no-hander right after the round off\nPeanut butter guts, chocolate brown Porsche\nWord to Spanish José, we was movin' the most yay\nHad my boys runnin' and gunnin', sound like 'Coach K'\nListen, duke, you can shoot, but you know that it's both ways\nMy gun splash brothers, I call 'em Curry and Klay\nIn a hurry to get buried ever fuckin' with J\nAh, Dave, come on, nigga, I see you ridin' the wave\nBrave like the crackers that helped hide the slaves\nKeep talkin', I kill you, then slide in your babe\nYou got a homie up top, I have him die in a cage\nAnd you trigger-happy, can't wait to fire the gauge\nGo out on your shield, though you die in a blaze\nGunfire, one liar, gon' put the truth in a maze\nI got the truck off the sour, got a coupe from the haze\nIn the telly down south, I got me a few dames\nWe ain't fuckin', but we stuffin' they pussy with cocaine\nWhipped out, fuck around and hop on the 2 train\nRobbed the first and last car to show you some true pain\nWolf on the phone when I show you a few fangs\nIt's a different kind of hot, my nigga, it's blue flames\nDudes is startin' to get out of pocket; loose change\nHard part: tryin' to stay still, move things\nRight before you about to murder someone, your mood change\nWe came up like ninety bricks\nWe had the city under siege since '96\nGo online: still won't find these kicks\nLike Frank White when he did the Chinese hit\nThat's it, it's us, then everybody else after\nOur part of the good book's a rough chapter\nEverything dead serious, enough laughter\nFronto leaves, Raw papers and Dutch Masters, yeah\nYou read more, you see more\nThey tearin' shit up on the streets in B-more\nSome people don't know what it's like to be poor\nThe hood is a one-way, ain't no detour\nYou know the love course, the hate come free, y'all\nThose who protect and serve will knock your seed off\nThe energy is negative, it's not to feed off\nShit'll cool down when we knock the heat off\n\n[Outro: Jadakiss]\nGet it? R.I.P. Freddie Gray\nRest in peace homie that they shot in the back in South Carolina\nEric Garner, Mike Brown, Glennis, rest in peace, baby girl\nAnd all y'all rappers, HA-HAAAEEH! Haha, one", "image": "https://images.genius.com/91aaca2db40e949852229a6bd8eb75d7.500x500x1.jpg"}], "artist": "Jadakiss"}