{"songs": [{"title": "Where Are They Now (80's Remix)", "album": null, "year": null, "lyrics": "[Bobby Byrd:] (\"GET INVOLVED!!!\" GET INVOLVED!!!\" GET INVOLVED!!!\" GET INVOLVED!!!\")\n\n[Intro: Nas]\nHold up, hold up, hold up man, this is Nas, hip hop still dead\n1980's, I need all my pioneers to set it off on this one right here\nI asked where they are, here they are\n\n[Verse 1: MC Shan (Nas)]\nHip Hop when niggas knew the art of war (Shan!!!)\nRough rhymes that's what gave the hard the core\nNow it's all good best friends became gladiators\nMatter fact you blow more steam than hot gladiators\nSome niggas is ghost written but I ain't hatin (80's!!!)\nCause I still spit fire like the Son of Satan\nShan motherfucker and I'm Queensbridge bred\nCheck Myspace (Queens!!!) Forever will they bare my face\n\n[Verse 2: Raheem from The Furious Five (Nas)]\nWho said lightnin can't strike in the same place twice\nTrailblaze the game, made for life stayed nice\nYeah you made the Top 50, don't mention my name (Here they are!!!)\nI had you open before crack, cocaine grow-in\nBefore The Fever, before +Missy's+ first +Misdemeanor+\nBefore Run's, first pair of Adidas, got heaters\nAnd I pop pop, pop, pop, heaters\nStop dealers, on my block was the first hot wheeler\n\n[Verse 3: Doctor Ice from UTFO (Nas)]\nYou never knew (1980's y'all!!!) Somethin so butter could come from the gutter\nI'm, Doctor Ice the diamond the cutter\nLike, Jacob The Jeweler and Rick is The Ruler (UTFO!!!)\nBoogie Down Kris is The Teacher but Doc run the schoolin\nY'all got y'all, sneakers and beepers, your dutches and reefas\nWe got our, eight tracks and sneakers, our hookers and reefers\nMy work is, never in vain, born to insert\nSo even when I'm buried, I'm still the diamond in the dirt, let's work\n\n[Verse 4: Kangol from UTFO (Nas) {Ladies Screaming Kangol's name}]\n{Go Kangol!!} Yeah what's up fam?\nMy chick for twenty years tried to cut your man\nShe tried to take the house, the kids, the pots and pans\nI'm on to project Plan B, nigga fuck Roxanne!!! (Get focused y'all!!!)\nTried to take the pot I piss in, now the chick outta my system\nThe whooped niggas need to listen listen listen listen\nCock aim fire don't you miss 'em miss 'em miss 'em\nAnd every chance you get you diss 'em diss 'em diss 'em diss 'em\n\n[Chorus: Nas]\nHEY!! Where are, where they nooooooow, huuuhhhhhooohhh HEY!)\n{Aww man, make me feel like I'm back in the days with my cassette player, tape in the radio y'all!!!}\n(Where are they now?)\n{Your man Nas, I asked y'all where they at? The pioneers I got love for them man that's why I'm doin this}\n{I got love for them man, so here they are two thousand and seven, yeah}\n(HEY! Hit me! Where are they nooooooow?)\n\n[Verse 5: Kool Moe Dee (Nas)]\nWhere am I? On high with a pen\nBlessed manifest rhyme god transcend (Pay attention y'all)\nYou call him God's Son, I call him God sent\nFirst the God sent me, then the God Rakim\nHow can Nas not win when the God sent him\nTo resurrect true rhyme God kingdom\nYou should say amen when you see me\nWhen you pray I'm him then you believe me\n\n[Verse 6: Sha Rock from Funky Four +1 (Nas)]\nYeah! Sha ready to rise, ready to blaze somethin\nMother of the mic so I'm here to claim somethin\nI got the munchies for the vultures that crushed the culture\nYo Nas brought us back on this track so bring it back (They don't stop y'all!)\nFrom dusk to dawn equip the mic on my palm\nI bring the love so you can get it on\nGot the books on lock, mother of hip hop\nFor realla, come under from some of you niggas\n\n[Verse 7: Tito from Fearless Four (Nas)]\nYou cats is foul frontin like you hard as a rock\nWhen these brothers were the buildin blocks, that made you turn up the box\nDoug E. Fresh and The Get Fresh Crew, To Markie D and Cool Rock (Know your history y'all!!!)\nRest in peace to the Human Beat Box (Know your history!)\nLike when I first heard Jay, Darryl and Joe, saw a UTFO\nI knew right then and there I wanna blow\nThere need to be a museum where everybody could see 'em\nSaid everybody take some pedium, and get respect\n\n[Verse 8: Grandmaster Caz from The Cold Crush Brothers]\nYou got another thing comin if you think me and my man ain't sellin\nGot more gold than Mr. Drum and we sellin\nThrough Welcome To The Terrordome, niggas are ever wrong\nThat's why you get no ends, but just in case\nYou got a death wish, for flare for the dramatics\nThere's some static in the attic {?} hid it looking at it\nI'm a 'matic, nice to the fifth power son and I'm still at it\nI was about to flip power son 'til I saw a vision, Caz!!!\n\n[Chorus: Nas]\nHEY!! Where are, where they nooooooow, huuuhhhhhooohhh HEY!)\n{Grandmaster Caz, y'all know what this is do y'all know what this means!!!}\n{The fact, that each brother got on this track, the fact, that each sister got on this track}\n(Where are they now?)\n{To rap, took time out of there schedule, when y'all ain't even got no love}\n{But they still givin y'all love, that's hip hop y'all}\n(HEY! Hit me! Where are they nooooooow?)\n{Give it up to the OG's the original gangstas of Rap, yeah}\n\n[Verse 9: Linque AKA Isis from X-Clan]\nNas you had to ask Linque, where you been?\nRippin on the mics with the devilish grin\nSort of like a tack cause I stay under they skin\nCause when I open up my mouth I blow them chicks to the wind\nDon't get besides yourself like you Siamese twins [Professor X:] (\"This is protected!\")\nStill got the pen to make the ?message of sin? (\"By the red, the black\")\nYou bring it back I do it over again (\"and the green\")\nExposin those who pretend, stay on my grind 'til the end\n\n[Verse 10: Dana Dane (Nas)]\nFirst there was a tree and a MC grew and became (Brooklyn!)\nAnother rapper born in Queens, 9/6 the b-day\nMoms moved and born {?}, dad hit the freeway\nMy young life was screenplay, better yet a cliché (I can't believe it!)\nTo rap in the eight-tay, no lenses in the east-say?\nThey say we were a fad but fad don't add reggae\nWe played by the D-Day, eveyday, Eve's day\nCapital D-A-N-E and hip hop, must be in it\n\n[Verse 11: Pebblee Poo from Def Committee (Nas)]\nC'mon! Well I'm the ?wa-say-why? with the with the same crew\nFirst name Pebblee, last name Poo (Oh!)\nGina Parks? says a {?} I'm a leader, theiver, greeter\nLast mark the game like Run and them Adidas (Do the history ya'll!!!)\nI'm a real estate investor but, I still blessed her\nMicrophone teacher outta Alpha Four ?\"Beavers?\nHold on I get deeper, dope b-boy speaker\nPractice what I preach-a, DAMN I'm a keepr, huh\n\n[Verse 12: Just Ice (Nas)]\nJust the mic and make 'em stand up [RAW!]\nLyrics are legendary status so get ya hands up\nClap to the freestyle (Just Ice!) dance, but in the meanwhile\nCool calm collected, smooth that's how I get down\nThen at the stage, hold 'em up like a twelve gauge\nPage after page, all you see is a pure rage!\nSo pass the gat, grab ?taps? for the beat\nJust Ice signing off [Whaaat?!] Yo I'm out y'all, PEACE!!!!!\n\n[Outro: Nas]\nYo that's incredible man play that again!!!", "image": "https://images.genius.com/23061dd2dc7e863127db561906debd27.434x434x1.jpg"}], "artist": "Nas"}