{"songs": [{"title": "Nobody", "album": "Trap House III", "year": "2013-05-21", "lyrics": "[Verse 1: Gucci Mane]\nThere's a trap in every hood and all the j's want that good dope\nGucci got that clean cause all the snorters want that real coke\nMultimillionaire the real La Flare but I feel broke\n10 Million dollar mane but I can't hang with these rich folks\nMy little boy was only 2 he asked me, \"papa, what a roo-poo?\"\n5 years old closet full of jays; fruit loops\nThey say Gucci Mane the god of making music people trap to\nDrumma Boy the god of making music Gucci snap to\nSection 8 apartment and them babies need some fruit loops\nPampers and a bath cause they mamma smoking crack too\nHow you gone critique me, you industry\nI'm in the streets, you out the streets\nI murk the streets and murk the beat\nI'm Hercules, no murkin' me\nGucci back home making music niggas clap to\nHe don't never come to the hood unless he have to\nRappin' ass niggas I'mma make my niggas rap you\nIts big Gucci, not Bobby V, so ain't no way you jackin' me\n\n[Hook:Gucci Mane]\nI ain't really scared of nobody\nNobody\nNobody\nNobody\nNobody\nNobody\nI ain't backin' down for nobody\nNobody\nNobody\nNobody\nNobody\nNobody\nYou got teardrops on your face with no bodies\n\n[Verse 2: Gucci Mane]\nRed cars with tint on them so niggas looking but can't see\nPaved the way for making trap music so street niggas should thank me\nAin't no way you'll out think me\nAin't no way that you could jank me\nAnd all I sending is head shots cause I don't shoot at niggas feet\nNiggas better retreat when they see me\nOn G.P. shoot up the BP\nNigga died with his gun, couldn'a been me\nOne deep on the street with a street sweep?\nGucci Man, I'mma shoot you in your pee pee\nGet you fucked in jail like a fefe\nNiggas know about Flocka & Gucci\nNaw we ain't beef he sissy\nI'm the type to shoot out Peachtree\nYou the type that wanna' be me\nBullets just fly right by me\nThese fuck niggas tried to hit me\nYou scouts don't get no brownies\nOne shot just hit my Bentley\nAnother hit my Charger, but it didn't hurt my hemi\n\n[Hook]", "image": "https://images.genius.com/2d6a6af130abeb84aebd2824e7c3ef8a.500x500x1.jpg"}], "artist": "Gucci Mane"}