{"songs": [{"title": "Witch Doctor", "album": "No Shame", "year": "2017-11-01", "lyrics": "[Intro]\nUndercover Prodigy\nCome on!\n\n[Verse 1]\nLook, I ain't gon' lie to you motherfuckers, I'm bad bidness\nI ain't that industry nigga who always ass-kissin'\nI got mad disses for anybody who askin' and\nY'all can sit and pout as you watch how high the cash gettin'\nAnd bitch, I made hits, day to day in the basement\nSlavin' away, playin' the game, makin' my name fizz\nAnd lowkey I been checkin' to see how Dame is\nAnd without Hop, I'm sorry nigga, you ain't shit\nDo somethin', got you goose bumpin'\nWho fuckin' with me? I'm rude, rugged and love to intrude ruckus\nToo stubborn, I got the motherfuckin' juice chuggin'\nYou think you runnin' shit but you really my cute puppet\nJust danglin' from a string, I was made to disrupt the peace\nDon't care if you poppin', bitch, you basic as fuck to me\nI've been labeled a fuckin' beast, it's a fatal corrupt disease\nDon't be callin' tryna sit for a bagel and cup of tea, my nigga\n\n[Hook]\nOoh, you don't want the backlash\nWhy you actin' like a badass? Slow down, nigga!\nFuck around and break you off proper\nYou gon' need to see the fuckin' witch doctor (sangoma)\nNigga, peep game, no shame, I won't ever change\nYou don't want the backlash\nWhy you actin' like a badass? Slow down, nigga!\nSavage!\n\n[Verse 2]\nI'm the dirty scoundrel, livin' life on the down-low\nI've been to Hell, I sat with the man of the household\nMy heart froze, but you don't wanna know how cold\nI feel like the one, but I ain't what you should count on\nBuckle up, nigga! Have a blast, I'm an avalanche\nMashin' fans down on your master plan with a planned attack\nIt's like a massive pack of elephants, charge you with cataracts\nSo call an ambulance, I'm the straw that just broke the camel's back\nYou don't want problems, I'm serious, I am too sick (yeah, yeah)\nI promise I ain't delirious, I can prove it (yeah, yeah)\nThink twice, nigga, I'm eerie as Tyson's toothpick\nUndercover Prodigy, visualize the movement, nigga\nThis is a brand new side of me that's emergin'\nEvil and purgin', I am more deceivin' in person\nScreamin' and cursin', fuck the world with penis insertions\nI'ma feel this way until the day I'm leavin' this Earth, man\n\n[Hook]\nOoh, you don't want the backlash\nWhy you actin' like a badass? Slow down, nigga!\nFuck around and break you off proper\nYou gon' need to see the fuckin' witch doctor (sangoma)\nNigga, peep game, no shame, I won't ever change\nYou don't want the backlash\nWhy you actin' like a badass? Slow down, nigga!\nSavage!\n\n[Chorus]\nSoek jy ‘n sangoma? Soek jy ‘n sangoma? A sangoma?\nI can show you the way if you want to know\nWitch doctor, witch doctor\nSoek jy ‘n sangoma? Soek jy ‘n sangoma? A sangoma?\nSomebody better call the witch doctor (witch doctor)\nWi-wi-wi-witch doctor!\n\n[Verse 3]\nListen, I ain't gon' pretend to be the best\nI don't give a fuck about ever bein' politically correct\nLook at the fans that all my misery has blessed\nAs long as I'm breathin' I ain't gon' give emcees a rest\nMusic can make a struggle seem cool — it's not\nDo you know what the fuck I've been through? A lot\nThere is an evil me that speaks to me every evening\nI tried to get rid of him but he rules my thoughts\n\n[Hook]\nOoh, you don't want the backlash\nWhy you actin' like a badass? Slow down, nigga!\nFuck around and break you off proper\nYou gon' need to see the fuckin' witch doctor (sangoma)\nNigga, peep game, no shame, I won't ever change\nYou don't want the backlash\nWhy you actin' like a badass? Slow down, nigga!\nSlow down, nigga!\nWhy you actin' like a badass? Slow down, nigga!\n\n[Chorus]\nSoek jy ‘n sangoma? Soek jy ‘n sangoma? A sangoma?\nI can show you the way if you want to know\nWitch doctor, witch doctor\nSoek jy ‘n sangoma? Soek jy ‘n sangoma? A sangoma?\nSavage!\nSomebody better call the witch doctor (witch doctor)\nWi-wi-wi-witch doctor!", "image": "https://images.genius.com/db13fb9f8af35b46f160350721166126.600x600x1.png"}], "artist": "Hopsin"}