{"songs": [{"title": "Konichiwa Bi**ches", "album": null, "year": null, "lyrics": "Konichiwa bi*ches\nKonichiwa bi*ches\nWhat up, what up, these n****z suck?\nThey can't hold a fort, better hold that thought, B\nIf I can't get it off, see my attitude is MSG\nF*** it, I'm salty, the game been loss me\nPay ya dues, it cost me, who acting like I'm past my prime\nHey Carlton Fisk, n****, pass the nine, who wanna cross me, now?\nAnd put my body in the lost and found\nYou with the business, then bust off a round\nIt's like the passions of Christ, get crucified just for having that ice\nAnd the audacity for having that life, while n****z starving and s***\nThe main reason they be robbing and s***\nThe same reason you've been targeted b****\n(These n****z must of forgot)\nThe thin line between a hoe and a trick\nGive 'em the clip between the four and the fifth\n(Yea, motherf***er I'm high)\nThere I go again, blowing a spliff\nWhen I exhale, it's like I'm blowing a kiss\n(Konichiwa bi*ches)\nN.Y.C., is all I see, O.D.B., n****, R.I.P\n(Konichiwa bi*ches)\nThis Killa Beez on ya M.I.C., you want it all\nWell, then y'all like me\n(Konichiwa bi*ches)\nCome on, come on, I think they playing my song\nI came to blow them out the frame and I'm gone\n(Konichiwa bi*ches)\nM E T, to the H O D, why motherf***ers wanna hate on me?\n(Konichiwa bi*ches)\nFor every rhyme, there's a hair on my chest\nScared of the Man, you should be scared of the Meth\nNow every damn that I drop, is homicidal, that could dare to be done\nThere's no survival, now who care to be next?\n(If you don't know me by now)\nKnow where the borough is, doing it for\nThe most thoroughest, you doing the most, pa\nThe French call it \"forpa\" when f***ing with son\nThe odds a hundred to none, too many flavors\nY'all ain't f***ing with one\nIt's getting deep, see the plot thicker\nNo place to be, if you b*****, n****\nOutside the Clan, we always got RZA\nI put it down, like I don't give a\nOne in the head, I bet he don't get up\nWe drinking malt liquor out of your Benz\nJust to talk slicker then paint a scene that you can all picture\nYou going in? Well, let me walk with cha\nIt's Method Man, but for short Mr., Mef\n(Konichiwa bi*ches)\nN.Y.C., is all I see, O.D.B., n****, R.I.P\n(Konichiwa bi*ches)\nThis Killa Beez on ya M.I.C., you want it all\nWell, then y'all like me\n(Konichiwa bi*ches)\nCome on, come on, I think they playing my song\nI came to blow them out the frame and I'm gone\n(Konichiwa bi*ches)\nM E T, to the H O D, why motherf***ers wanna hate on me?\n(Konichiwa bi*ches)\nKonichiwa bi*ches\nKonichiwa bi*ches\nKonichiwa bi*ches\nKonichiwa bi*ches", "image": "https://images.genius.com/fe6629f7a5e6af0aa38ca87547ced96f.1000x562x1.jpg"}], "artist": "Method Man"}