{"songs": [{"title": "The Solution", "album": "The BDP Album", "year": null, "lyrics": "[Intro: KRS-ONE]\n\nEvery time i turn on the news it gets depressing\nWatch the news it gets, man c'mon!\nY'all know what this is for real\n\nTime to Wise up!\nTime to hold yours\nWord Up!\nNo Time for Givin'up!\nWord Up!\nWe gotta take control of our own community\nThat's Word!\nWe're only spittin' hard rhymes, for hard times\n\n[Verse 1: KRS-ONE]\nListen to me closely, it's about to get toasty\nI be the speaker of the house like Nancy Pelosi\nThe challenges we faces on the world is this\nThe banks are telling government to do that & do this\nNo ones taking a truth risk, no ones the looser\nWe need to make trades with Cuba\nOpen up the borders all away to Aruba\nGive taxes brakes to all teachers and tutors\nBut Cats don't like how the teachers be talking\nCause cats don't walk where the teacher be walking\n(L)ove (A)nd (D)evelop (Y)ourself, that spells L.A.D.Y\nI teach it to young girls and women go crazy!\nPhilosopher, criticism don't phase me\nI walk in the truth even the wind obey me\nStanding with a protest sign FREE HAITI!\nMy rhymes blows your mind like «A380» (Explosion)\nI made a million dollars last year didn't change me\nI Make money man, the money does not make me\nLately my popularity just heighten, cause Krs-One Enlightens!\nI go off the top and i recite what i'm written'\nI Write 3 books for you mind to enlighten\nI promote stop the violence so we could stop fightin'\nIf your part of this MOVEMENT, don't just be websitin'\nVolunteer somewhere where people just might win\n\nAight then!\n\nIt ain't about stupid white man with Blacks, Latinos & Asians just act just like them!\nKrs-One, i got this style from D.M.C\nI take it all away back to 83'\nBut right now K.P gonna drop the Chorus on Me\n\nAnd It Goes(Echo)\n\n[Hook]\nRevolution, Revolution That's The Only Solution!\nRevolution, Revolution That's The Only Solution!\nRevolution, Revolution That's The Only Solution!\nRevolution, Revolution That's The Only Solution!\n\n(Hard Rhyme For Hard Times)\nRevolution, Revolution That's The Only Solution!\nRevolution, Revolution That's The Only Solution!\n(Hard Rhyme For Hard Times)\nRevolution, Revolution That's The Only Solution!\nRevolution, Revolution That's The Only Solution!\n\nREVOLUTION!\n\n[Verse 2: KRS-One]\nIlluminati this!, Bilderberg that!\nThe White, how long «the dollar» goes way back\nIf the proof mask the truth, the truth i say that\nSo the TRUTH is that we in a debt that we can never pay back\nSo «..The balance the budget..» we can never say that\nWhen the laws are on the flaws the justices lays back\nIt's the May! Back though, that given us hope\nWhen the «Mercedes Corporation» is trying to stay up float\nThe whole things a JOKE! & FALLEN PART!\nThe Only Institution you can really trust is ART\n\nAND WITH ART(Backspin Instrumental, Krs Still Emceeing)\n\nYou can start up a Civilization\nWe're already Worldwide Man! so WHY are WE! Waiting!\nHip-Hop! is THE SPOT where the money be making!\n& If We UNITE TONIGHT, WE can start up a NATION\nGet Free From The GREED In The Heart Of This Nation\n& Create Our OWN NATION from the words that I'm Stating\nHip-Hop MAKE NOSE if you part of this nation & you ain't Gettin' Sucked in the GLOBALIZATION!!!!!!!", "image": "https://images.genius.com/b5b9e2d96fe62cc9ca0b863120040330.960x960x1.jpg"}], "artist": "KRS-One"}