{"songs": [{"title": "Slave", "album": "Welcome to Strangeland", "year": "2011-11-08", "lyrics": "[Intro: Tech N9ne]\nFight the pain inside the rain\nA rebel know to let the devil go\nSo now to get paid, 'bout to be working like a slave\n\n[Verse 1: Krizz Kaliko]\nI’m kinda good, kinda bad\nKinda getting money can’t be mad\nI’m kinda broke but I’m kinda rich\nWishing I had a corner I could put a bitch in\nAin’t gon' do nothing, ain’t like I’m suffering\nFood for my baby mouth and I bought a house\nFor my baby mother and\nWhat’s wrong? I try\nDon’t matter, still die\nI’m strong, but I’m not\nWhen I’m alone I cry\nOut for you is hard to do\nI can’t see you, so doubt for you\nAnd out my mouth I sprout the noose\nToo much Vodka, and Mountain Dew\nBlaspheming ain’t what I be meaning, if you listen fast\nYou’d think I was a heathen, but the last\nSunday receiving the preaching from the pastor\nAnd I ain’t even believing the bastard\nBut no Hades, God’s baby\nGod made me a lil crazy\nWhen I’m off I’m gone, my life is my songs\nIt's what I mean? When I sing \"still on a wing and a prayer\"\nBut if I listen to what was written\nIn the scripture maybe it’ll get me there\nShare with the people I swear it isn’t evil\nScared that it might be in vain\nBut if I say I’m the genius, and like Jesus\nEverybody gonna know my name, Kali\n\n[Hook: Krizz Kaliko]\nI’ve been working like a slave, oh Lordy\nAnd I get tired along this lonesome journey\nI done stumbled on this road, I’ve been wrong, I know\nI know that there’s no peace in my shelter\n\n[Verse 2: Kutt Calhoun]\nOh, Lord, Lord, Lord\nI need reparations due to devastations\nFrom the state of present situations\nAnd it’s not easy\nTo walk a narrow path and mock Jesus\nIt’s hard when you’re family wonderin'\nWhen you’re gonna make enough to stop leavin'\nStop breathing for a minute 'cause it’s all\nArtificial when them laws tryna get you\nWhen them haters right behind em\nWanna shove a double barrel sawed off in your dental\nWhat can I do to stop a big catastrophe\nWhen niggas after me and bitches after me\nWanna have my baby, missing niggas lately\nTrails and tribulations tackle me\nMy mama think I made it, she feeling elated\nProud of her only son born\nMy kids think I’m the greatest, I can not display a smile\nFeelin' like a Funion\nSalty and all (You’ll be...)\nLocked in a stall (...Tryin')\nLost in the cause (Truly no denying)\nAin’t nobody gonna do it for me\nFor the MO, don't let it drive me insane\nSolicitation of a prostitute\n'Cause you're a ho when you’re playing this game\nBut it’s okay I am gon ride till I triumph\n'Cause everybody once upon a time was a slave\nThis is Calhoun\n\n[Hook: Krizz Kaliko]\nI’ve been working like a slave, oh Lordy\nAnd I get tired along this lonesome journey\nI done stumbled on this road, I’ve been wrong, I know\nI know that there’s no peace in my shelter\n\n[Verse 3: Tech N9ne]\nI work, I play, and I drink booze every day\nTryna muffle the blues I'mma say\nYou'se in the way, fools run astray\nAllah, God, Jesus, Jah somebody please help me\nMama got a problem with diabetes, it don’t seem healthy\nEverything depends on Ninna\nFame hitting Dontez Senior\nGotta nigga thinking some of the fans I’m making it\nWill they wanna do me like Selena\nDevil laughing like a hyena\nLosing all the good in my demeanor\nI don’t wanna go psycho but yo the flow ya know\nI got to go and Charlie Sheen ya\nTryna stay good with the old lady\nMy mind made her go crazy\nNo time for my poor babies\nSo don’t let a motherfucker play me\nWhen I say FU pay me\nEven though I’m getting money you can still see\nI’m hungry like I’m in Haiti\nWhat am I to do? What am I to you?\nBut a lot of cool? But I’m not amused?\nCan’t you see? I’m stressed, not free\nFrom y’all, I’m sick\nMy body’s hot, if 'n this pressure\nDon’t let up, this will prolly stop for Tech Ninna\n\n[Hook: Krizz Kaliko]\nI’ve been working like a slave, oh Lordy\nAnd I get tired along this lonesome journey\nI done stumbled on this road, I’ve been wrong, I know\nI know that there’s no peace in my shelter", "image": "https://images.genius.com/4392f3223b9e5965e7f76dc529941352.1000x1000x1.jpg"}], "artist": "Tech N9ne"}