{"songs": [{"title": "That’s That", "album": "Trap God", "year": "2012-10-17", "lyrics": "[Verse 1: Gucci Mane]\nGot dogs on the chains don't let em get loose\nSippin rich man juice thats a fo and a deuce\nAll my cars ain't got no roof\nAnd I plead not guilty they ain't got no proof\nLook in my closet I ain't got no suits\nTwo thousand dollar shirt, four thousand dollar boots\nBroke ass nigga ain't got no clue\nI'm so rich I could buy yo troops\nGucci going broke? You a god damn fool\nBitch so bad I'mma put her through school\nThese rap niggas dont move like me\nWhen I move hundred y'all niggas gone move\nYou can run up but what it gon' prove?\nGucci Mane put you on the god damn news\nWhole lotta ice and buncha tattoos\nIf ya choose me baby than ya know ya cain't lose\n\n[Hook: Gucci Mane & (Kevin McCall)]\nBaby got that fat back, and that's that\nPocket got them fat stacks, and that's that\nPull up in a whats that, and that's that\nWorth a million bust that, and that's that\n(If its my show than the club packed, and that's that)\n(And ya might not get yo bitch back, and that's that)\n(Yeah I'm smokin' on that loud pack, and that's that)\n(That's dro-oh-oh)\n\n[Verse 2: Gucci Mane]\nGotta bitch so bad, look ya give her note pad\nWrite it down on the book cause the bitch so bad\nFront seat of the jag and her boyfriend mad\nSliding down South Beach with the Georgia tag\nSwag so bad she'll ignore yo ass\nBossed up bitch employ yo ass\nRed bottom heels and they match her bag\nAnd she ridin' round the city just droppin' off swag\nReal fat ass, do you got a man?\nI gotta ask I gotta ask\nHunned yard dash  for the cash I threw\nAnd my car so fast I'll lose yo ass\nHo so bad that she got you blinded\nKill her with kindness ya buyin her diamonds\nOh my I like the way you bend\nBitch so fine I'mma move her in\nHold up stop man damn I'm trippin'\nLast thing I need to do is move that bitch in\nGame work good, and real soon\nWhat can I say baby I'mma tycoon\nGucci Mane I ain't finna jump no broom\nBut tell ya girlfriend she can jump in too\nWhole lotta ice and bunch of tattoos\nIf ya choose me baby then ya know ya cain't lose\n\n[Hook]", "image": "https://images.genius.com/7b2696a5097a1919c042aeac63dd9d8b.500x500x1.jpg"}], "artist": "Gucci Mane"}