{"songs": [{"title": "Kick Along", "album": "Don’t Sweat the Technique", "year": "1992-06-23", "lyrics": "[Hook]\nKick along\n\n[Verse 1]\nIf you like it a capella, a soul clap will be sweet\nAlmost complete\nFeel the impact when it hit the street\nBut uh, it sound thicker when I kick it with a beat\nSee, I can let it speak for itself\nBut every now and then, it need a little help\nGuess who? To the rescue, pump\nRipping up comp, I step and then stomp\nA small scam it's in the land like Mr. Timberland\nPrepare the stage for Rakim to stand\nThen I pick a song, grab the mic, click it on\nTime to get it on, kick along\nSee if you can move to the words I speak\nPick up on a rhythm (hit 'em with the beat)\nMy mental-ect gets warm, feed into your physical form\nYou can't keep calm\nGet fit to the skit, try to hop on\nGet hip to the trick as I flip the script\nYou're feelin' rust like a thrust of an arrow, plus\nYou're lookin' through the eye of a barrel, bust\nEmergency, take him to the operatin' room\nPut him on the floor, let his heart feel the boom\nReact to the wrath of a brand new song\nThen kick along\n\n[Hook]\n\n[Verse 2]\nA kick is a hip with hop\nA pep wit step like the floor is hot\nI project a lot so you can use every kick you got\nBut don't forget, don't kick when I stop\nI'm somethin' like Simon says\nAs I'm pumpin' hype rhymes in your heads\nThe mic's a remote control and I'm pointin' it at ya\nWhen I push buttons, you're gonna have ta\nBreak straight to the floor\n'Cause I'mma make more\nEach one's composed in the shows and each one flows\nHow long? Nobody knows\nAnd whoever try to take 'em, I'mma break 'em\nDrag it out of him, dehydrate 'em\nThe beat makes the beat in your heart accelerate\nYour pulse is a drum-roll, too late to wait\nA pen'll send adrenaline to ten\nIf then begin to blend the smooth that's sent\nThat's to prevent you from gettin' asthma\nYou try to keep up, because, the cut has ya\nBlood pressure to the point, never stops a drop\nPuttin' stain in the veins in the brain, your blood clots\nToo quick to pause it, you almost lost it\nSo, kick along til you're all exhausted\nAnd look what my data made, my power'll never fade\nI keep it energetic, or hype as Gatorade\nNow kick it with a beat\nC'mon, kick along\n\n[Hook]\n\n[Verse 3]\nThey can't wait to kick steps to this\nSo, I make a skit just for kicks\nSyncopated, coursing through\nInnovated because the flow\nMelodic and melodramatic styles occur\nLike a choreographer, my mind's a photographer\nMakin' music visible for the individual that gets visual\nWhat I manifest you express on the dance floor\nPants get torn when the jam is on\n'Cause I kick rhymes until the rhymes kick back\nIt's hard to kick that, where did you get that?\nHere's the concept, part of your concert\nExpect the expert to perfect and do work\nDon't stop the song 'til I'm gone\nKeep gettin' it on, kick it off with the horns\nKick along\n\n[Hook]", "image": "https://images.genius.com/c242f8367734db09ac26eb1c1bbcee98.900x900x1.jpg"}], "artist": "Eric B. & Rakim"}