{"songs": [{"title": "Hoe Cakes", "album": "MM.. FOOD?", "year": "2004-11-16", "lyrics": "[Intro]\nKeep your hoes in check...\n(Super!)\n\n[Verse]\nI got this girl and she wants me to duke her\nI told her I'd come scoop her around 8, she said (\"Super!\")\nThat sounds great, shorty girl's a trooper\nNo matter what I need her to do, she be like (\"Super!\")\nOwn his own throne, the boss like King Koopa\nOn the microphone he flossed the ring (\"Super!\")\nAverage emcees is like a TV blooper\nMF DOOM, he's like D.B. Cooper\nOut with the moolah, I let her get a outfit\nJust to cool her off she said niggas ain't about shit\nI wonder if she meant it, I doubt it\nThe way it be in her mouth she can't live without it\nAnd can't live with this, handle your business\nVillain'll stay on a scandalous ho's shit list\nOne pack of cookies please, Mr. Hooper\nIt's fun smacking rookies, he is the (\"Super!\")\nLook like a black wookie when he let his beard grow\nWeirdo, brown-skinned'd, always kept his hair low\nRumor has it it's a S-Curl accident\nDOOM was always known to keep the best girls' backs bent\nSome say it's the eyes, some say the accent\nA lot of guys wonder where they stacks went\nI call her thunder thighs with the fatty swolla\nOnly mess with high rollers, do what daddy told her\nNo matter the city she with me to do the thang-thang\nWork in the coochie, hooptie chitty chitty bang bang\nSame name on the titty as on the name ring\nPretty like Baby D off \"All in the Same Gang\"\nKeep my eye on her, really don't trust her\nBut I treat her like a daughter, taught her how to bust a nut\nAnd the heat to turn beef to horsemeat chalupa\nTeach her how to hold it, of course he is the (\"Super!\")\nSee most cats treat her like Foofur\nOr beat her to a stupor, take it from the (\"Super!\")\nYou need to make her feel cuter\nAnd lay down the G like Luther, everything'll be (\"Super!\")\nDo for her, keep her in a new fur\nSo she look sweet when she go to meet the (\"Super!\")\nGot the buddha get the Grenadiers, twist it\nPut it in the air, come here, kiss it\nListen here scooter, let her try to bag you\nWhen she's on the rag, never let her fry the Ragu\nWhich'll have you under some type of spell crying \"dag boo\"\nHer name on your back in a tattoo\nWhether a bougie broad, nerd ho, street chick\nDon't call her Wifey if you met her at the Freaknik\nYou don't want her don't waste her time, I'll dupe her\nAnd be a father to your child like the (\"Super!\")\nHe keep his hoes in check\nSends 'em out to get glows from off frozen necks\nTell 'em take his clothes, leave him posing naked for real\nBetter yet, get him for the check off the record deal\nFind out where he keep the Tec and the blue steel\nMake sure for extra wreck, let him know how you feel\nAnd while he's running down to All-Star Weekend to ball\nI'm coming with the U-Haul (\"Super!\")\n(\"Super! Super!\")\n\n[Outro Skit]\n(DOOM): Has the laser cannon been lowered?\n(DOOM Cronie): Everything has been prepared as you ordered. But how did you get permission to return to New York master?\n(DOOM): Through the efforts of the misguided fools\n(J. Jonah Jameson): It's free enterprise, and I'm not gonna have some blasted government bureaucrat tell me how to run my business. But DOOM will be my guest on my private estate in Long Island. There's nothing you can do about it\n(Jameson Employee): He's dangerous, I just hope you know what you're doing\n(Jay Jonah Jameson):  Don't I always. Ah, there's DOOM's jet, right on time\n\n(Voice 1): Why's it so cold out here?\n(Voice 2): The heat went out in the whole building\n(Voice 3): It's warming up out there in Long Island with DOOM\n(Voice 1): DOOM? Here in New York?\n(Voice 2): Yes DOOM has an amazing new machine\n\n(DOOM): Get the president of the United States on the phone\n(Jay Jonah Jameson): How long's all this gonna take, DOOM?\n(DOOM): I would not advise you to repeat that error\n(Jay Jonah Jameson): Sure, I know what you mean", "image": "https://images.genius.com/5714730842e9099bafdf9738a9bf42be.1000x1000x1.jpg"}], "artist": "MF DOOM"}