{"songs": [{"title": "A Thing Going On", "album": null, "year": null, "lyrics": "We meet every single day at the same old place\nAt the same old time, with the same state of mind\nMe and her together but we know it ain't forever\nWe just happy for the time, the weed and the wine\nThe walks in the park, escapades in the dark\nWe knew how it had to be right from the very start\n'Cause I got obligations and she's in the situation\nThat she came to state so this is our fate\nHolding hands, a smile, a glance\nA kiss and a dance but we can't take a chance on\nGettin' caught, so we stick to a plan\n'Cause we both got another and they wouldn't understand it\nMe and Mrs. Jones got a thing going on\nI wouldn't call it love but it damn sure strong\nIt ain't about doin' dirt or living like a flirt\nBut what they don't know don't hurt\nMe and Mrs. Jones\nMe and Mrs., Mrs., Mrs., Mrs. Jones\nMrs. Jones, Mrs. Jones, Mrs. Jones\nMe and Mrs., Mrs., Mrs., Mrs. Jones\nMrs. Jones, Mrs. Jones, Mrs. Jones\nThe very first time I met her, I saw her from across the room\nAnd instantly we both became consumed by the thought\nOf she and I being together, so I headed in her direction\nFor some closer inspection\nI intentionally brushed her hand, her skin had a satin texture\nThe feeling she gave me was more than I could measure\nAnd right away I knew I had to have her with me\nIf not with me, then maybe just to hit me\nShe got pinpoint skill and precision in the walk\nAnd the way that she talk make my mouth turn to chalk\nShe give me everything that I don't get at home\nAnd it seems like I'm a man 'cause hers is always gone\nNow, tell me what love got to do with it?\nLoc, as we both feel good when we kickin' it\nSome might say that I'm wrong and I should leave her alone\nBut me and Mrs. Jones got a thing goin' on\nMe and Mrs., Mrs., Mrs., Mrs. Jones\nMrs. Jones, Mrs. Jones, Mrs. Jones\nMe and Mrs., Mrs., Mrs., Mrs. Jones\nMrs. Jones, Mrs. Jones, Mrs. Jones\nIt's been about a year since we've been seeing each other\nWe're a whole lot more than just part time lovers\n'Cause when I got a problem she do everything she can to solve 'em\nBut her life is not revolved around how revolving\nI'm the Shaka Zulu and she's my fantasy\nBut deep down inside we know that we could never be\nAny more than what we are, a phone call in the car\nBite to eat, with a movie and a drink at the bar\nWhen all of a sudden right out of the blue\nMy lady got a clue on what we was up to\nAnd wait a minute, damn, from what I understand\nIt seems that my woman's been talking to her man\nSince we both in love with the people at home\nIt looks like, we just gone have to leave it alone\n'Cause I got a woman and she's got a man\nSo that's how it goes and that's how it is\nMe and Mrs., Mrs., Mrs., Mrs. Jones\nMrs. Jones, Mrs. Jones, Mrs. Jones\nMe and Mrs., Mrs., Mrs., Mrs. Jones\nMrs. Jones, oh yeah\nWe used to meet at the same place, same time\nUsed to sit and talk it over, talk it over\nMe and Mrs. Jones, Mrs. Jones\nMrs. Jones, Mrs. Jones", "image": "https://images.genius.com/80e7d4d7290ea57cc76b3c5e101a8d2f.755x755x1.jpg"}], "artist": "Coolio"}