{"songs": [{"title": "Figure It Out", "album": "Laugh Now, Fly Later", "year": "2017-11-10", "lyrics": "[Intro]\nCookin' Soul\nYeah\nIt's all about a dollar man\nDon't let nobody else tell you anything otherwise\nUnless it's me\nUh\n\n[Verse 1]\nLeave my iPhone cracked if I take a loss\nKnow I'm gon get it back, I'm always on attack\nLearn to let the money stack, homies turn to rats\nWhen you deal with certain cats, they deserve the facts\nStay in constant meditation, always burning back\nWipe them ashes off my lap, you ain't part of my set\nIt's harder to maintain than it is to get\nThat's why you hold on to it and don't ever forget\nThat you did good with less just gotta deal with the stress\nIt's part of the game\n\n[Chorus]\nSometimes things ain't gon work out\nHow you think you want it to go\nSometimes you gotta keep going\nWhen you think you can't no more\nSometimes you can't depend on\nWho you think you can no more\nSometimes you gotta try, gotta try and\nFigure it out\n\n[Verse 2]\nKnowing your worth is half the battle\nKeep fuck niggas out of your circle\nYeah they gon try to hurt you\nSee you focusing, they try to divert you\nBeing fake ain't rare, it's universal\nThat's why I'll never work with you\nFamily first, till I'm in the dirt\nHow these niggas bosses but they needing work\nThat's exactly why I don't believe em\nGoals, set em, achieve em\nJoints smoke em and leave em\nTen toes, no matter the season\nHot tub with my feet in\nLiving comfortably cheesing\n\n[Chorus]\nSometimes things ain't gon work out\nHow you think you want it to go\nSometimes you gotta keep going\nWhen you think you can't no more\nSometimes you can't depend on\nWho you think you can no more\nSometimes you gotta try, gotta try and\nFigure it out\n\n[Outro]\nYou know what, playboy?\nThey always gonna wonder why\nYou gotta have a brand new car\nOr why you gotta have the flyest watch\nBut you know what, playboy?\nYou just gotta keep doing you\nCoz ain't nobody do you better than you\nYou look good doing it too, playboy\nAnd you know what else\nThem haters, they just gon keep hating man\nAnd when you on top, people always gon want your spot\nBut you know what, playboy?\nIt's up to you whether you give it to them or not\nSo keep that in mind, playboy", "image": "https://images.genius.com/fcf4a167b13ca49e8ad4865ce51249a2.600x600x1.jpg"}], "artist": "Wiz Khalifa"}