{"songs": [{"title": "Filthy", "album": "The Underground EP", "year": "1997-03-02", "lyrics": "Fucks fat ass {*cough*} nasty dirty niggas, uhhh\nFILTH, shit! Fuckin filth! Yeahh\nLA LA LA, la la la la, la LA!\n\n[Proof]\nAiyyo - my style bust holes in the earth, crush the crust\nBy the dirtiest, heathen specialize in stoppin breathin\nMy legion'll bleed man - what do you believe in?\n(Heaven and Hell) Make your grill swell, it ain't hard to tell\nI work spells, all wicked like Gargamel\nPut (?) hand first, the red bursts another victim\n\n[Bizarre] Nah man, let the morgue pick 'em\n\n[Eminem]\nCancel the hash shit, I'm fillin my glands full of acid\nTwo hands full of ass dancin with Angela Bassett\nMake plans for the casket, your head lands in a basket\nA dead man's in the plastic, I got red hands and the mask fits\n(Yeahhh Em) Fuckin rap pervert, I serve dirt\nMy sick thoughts get all mixed up like rainbow sherbert\nGet every nerve hurt - spot a mic and walk toward it\nMy whole click'll beat yo' fuckin ass and camcord it\n\n[Bizarre]\nSomebody hide me, too many hoes on my dick\nSmoked all your \"Hay,\" who wants to start the Crucial Conflict?\nI'm the big daddy smokin blunts in Cali\nIll enough to do a driveby on a stay in school rally\nStop stop knockin cause ain't nobody there\nHoes with AIDS - I still fuck BARE!\nCause I, I just don't care\nIll enough to fuck up, all yo' dental care\nWhen Bizarre kid comes through, you better yell mayday\nWhile you was havin \"Good Times,\" I +dyno-mite+ Kujo and J.J\n\n[Kon Artis]\nHAHA, yeah yeah bitch!\nI get helmet from stank crackheads\nAnd read my kids horror stories when I lay 'em to bed\nRidin bikes butt-naked, gettin frisked by policemen\nFUCK Christmas - this is take your gift season\nBeatin kids up for no reason, take lunch boxes and all\nGettin high off mushrooms and play, \"A Friendly Game of Dodgeball\"\n\nBITCH! YEAH! Aiyyo..\n\n[Repeat to fade]\nYou're battlin the Dirty Dozen, that don't pay\nYou god damn right punk, stay outta my way", "image": "https://images.genius.com/7a40a5dcf4af48c56e2c80bf3d485197.900x900x1.jpg"}], "artist": "D12"}