{"songs": [{"title": "Loyalty", "album": "D12 World", "year": "2004-04-27", "lyrics": "[Intro: Bizarre]\nMike Strange\nWelcome to Our World\nTurn your CD's up!\n\n[Eminem]\nWOOO!!!!! Yeah! AAAAAAHHHH!!!! (Motherfuckers think they know us)\nGuess who's back? D-Twizzie! O-Trizzy!\nDoc-Drizzy! Shady-Twizzie slash Aftermath!\n50 cent! G-Unit! Here we go! Free Yayo!\nMotherfuck a Benzino! They don't know we finna blow!\nSomeone better tell them so\n\n[Verse 1: Swifty McVay]\nYou don't know McVay and I doubt if you understand me\nWhy would I give a fuck about you if we ain't family?\nI roll with a chosen few and those of you that's behind me\nWitness the most coldest, ferocious niggas that rhyme\nThese bitches turn they back on you, acting like they ain't did shit\nWhen you rapping never mix business up with your friendship\nIf you lacking up in this jungle, then what you breathe for?\nNiggas's don't love you, you got habits of breaking street codes\nFar as static, I automatically get medieval\nWhen I'm after people, then I'll explode you bitches with C-4\nThese hoes have no insurance, bodies get repo'\nMaking you vanish even when we ain't got our heat close\nKeeping .44's where your hoes are swallowing deep throat\nIf you owe me dough then you know you falling asleep, close\nNiggas pupils that's what I do, I'm foolish will shoot you\nCuz' I'm coo-coo, but I don't think niggas be taking heed though\n\n[Hook: Kon Artis] (2X)\nSee I'm a man, and a man gon' do what he gotta do\nAnd he ain't really family if he ain't loyal to you\nIf they was really soldiers then they would do what we do\nAnd be loyal to crew when crew was loyal to you\n\n[Verse 2: Bizarre]\nI don't give a fuck, I'm quick to blaze chronic\nSmoke on so much green, you swear I was a supersonic\nBizarre pack guns and knives, put to dick to nuns and wives\nNow who the fuck want to fight?\nAin't nobody fucking with me, Ain't nobody fucking with the D\nThey get beat like a M-P\nYou heard about Bizarre taking all them drugs\nYou heard about Proof wilding in the clubs\nYou heard about that nine that Eminem packs\nYou diss us, you get your fucking face cracked\nI'm from 7 Mile and Stout, I'll shoot up your house\nNext day, I'll pee in your mouth\n\n[Verse 3: Obie Trice]\nAyo, loyalty's first, all the bullshit second\nI showed you on the record, Cheers to who respect it\nMost of these niggas neglect it\nEven though it's a known method\nFrom the hectic hood that you slept in\nYou wanna be an exception\nThat's when the weapon is leaving you half steppin'\nWith that 'caine in your left hand\nObie from a section that'll stain up your flesh and\nHave you on bed breast\nQuestioning your affection for streets\nD-Twizzie no question\nOne of the best groups that done it\nAnd Obie is their reflection\nLil homie that know soley that loyalty is reppin'\nD-Twizzie for life, Obie Trice is second\n\n[Hook] (2X)\n\n[Verse 4: Proof]\nWhich one of you niggas wanna be bulsh' and bump heads\nWhen I got a passion for clapping... with one hand\nTalent's on my roster this mobster'll dump lead\nSend a gangsta to sleep two by two like bunk beds\nNever leave the crib without packing my black burner\nOn some Chi Ali rapper to murk and have murder\nIncorporated, Hitman Harry is at your service\nReach for me one more gain' and that's curtains\nFor life as D12, no ice and spreewells\nEvery night that I chill in, I fight by free-will\nKnowing I can be killed\nLeaving my group, pieces of proof\nWith a reason to shoot and a license to ill\nWe lost Bugz and I'll be damned if we loose another man from our clan\nWithout forcing our hand\nExtorting your family, I'll torture your granny\nFor my niggas, I'm on your motherfucking porch with a Cammy\n\n[Hook] (2X)\n\n[Verse 5: Da Brigade (Kuniva & Kon Artis)]\nYo, it's funny how niggas get caught alone (And get bombed on)\nKnock your teeth in back of your throat (And break you're jaw bone)\n(I'm on ignorant shit) these niggas is bitch\nPass me a cigarette quick (Shit is finna get thick)\nYour man'll get split (By a brutal and critical hit)\nWith identical dents (Or bullets with identical prints)\nI'm wishing you if (You come your Lieutenant's a snitch)\nYour timid and sick (And we know you ain't finna do shit)\nI'll stick with my clique (The Kon Artis, Bomb Artist)\nKuniva, The Rida (Shooting through your fucking Long John garmets)\nDirty Dozen (We deep in the street)\nUnbelievable heat, we'll even lay you out in front of the chief of police\nMotherfucker\n\n[Hook] (2X)\n\n[Outro: Kon Artis]\nYeah! D-Twizzie\nD12, Dirty Dozen\nNothing but family up in this motherfucker\nLoyal to everything that we do\nYou ain't never gonna catch none of us slipping by ourself\nCause we always together\nYou know what I'm saying\nY'all niggas don't know what family means\nBugz watching over our ass\nThat's why we still alive now\nKnocking y'all niggas out of the clubs and shit\nHaha! Runyon Ave Baby!\nShady Records! Haha!\nWhere your momma at, nigga?", "image": "https://images.genius.com/6246e5d82871d591568c0f8881ed9690.1000x1000x1.jpg"}], "artist": "D12"}