{"songs": [{"title": "Heidi Hoe", "album": "Can I Borrow a Dollar?", "year": "1992-10-06", "lyrics": "[Verse 1]\nWhatup BITCH? I'm Petey Wheatstraw\nAnd you don't stop, with the heidi heidi ho\nHi ho, or bye ho, if you're lookin for a sucker\n(What are you?) I'm just another motherfucker\nPucker your lips, do flips like Mary Lou\nJust because I fucked you doesn't mean that I'mma marry you\nBury you, I will do, after, I bill you\nKill you, ho, cause your shit smells like mildew\nPe-ew, think you need some soap and a rag\nOr better yet Black, Flag, you scallywag\nTag, I didn't mean to diss dis... ho butt\nBut you need to stay such, do not touch\nMuch disrespect goes out to you\nAnd your parents, too, for having you\nHaven't you been introduced to a douche?\nI guess you said fuck footloose, and got your pussy loose\nNo juice, you shoulda dried up, like a prune-a\nMister mechanic this place needs a tune up\nFor the pink cadillac cause it's block is off\nAnd have more use, than a public park\nFor recreation, giving up the body is a hobby\nI'm tellin Santa Claus you been naughty (sing it)\nHo ho ho, Merry Christmas\nAiyyo JuJu, I just had to diss dis\n\n[Chorus]\nHeidi Heidi Ho, huh, the Heidi Ho\nAll the niggas know, yo the Heidi Ho, c'mon\nThe Heidi Ho, hah the Heidi Ho\nAll the niggas know, that you're a Heidi Ho\n\n[Verse 2]\n(Now bring it back brotha)\nEni-meeny-meeny-meeny-meeny-meeny-miney-moe\nCareful to catch a tiger, after you catch a tiger\nYou can catch a ho, there's your ho, kiss a ho, fuck a ho\nDiss a ho, I'm Petey Wheatstraw from the Southside of Chicago\nHablo ingles? I don't know espanol Joe\nI can go the line plus a hundred like Flo Jo\nHomo's a nono, so faggots, stay solo\nI roll my dick so it holds just like a Rolo\nTotal recall, yeah I see y'all\nI see you, I see you're a freak too, so peek a boo\nI'm prickin you whether or not, took you out that's work see\nSo get your skirt see, and bitch, dirty\nCurtsey, dosey-do out the do' slut\nThis is what I come on, so slut you better grow up\nSlow up, you forgot your earrings here take em\nSalami beef and ham with the asalaam alaikum\nLike that ho (that ho) that ho (that ho)\nDabba-da-dat, it's like that ho\n\n[Chorus]\nHeidi Heidi Ho, huh, the Heidi Ho\nAll the niggas know, yo the Heidi Ho, c'mon\nThe Heidi Ho, hah the Heidi Ho\nAll the niggas know, that you're a Heidi Ho\n\n[Verse 3]\nSittin on the dock of the bay, I say ho\nSay ho?! (Ho!!) Do you know, do you know?\nBo knows this ho blows much much dick\nAn undercover trick, a toe a tac a tic\nNaked at, frick-a-frat, plus her puddy wat\nC'mere k-k-k-k-k-k, yo c'mere you little puddy cat\nWhat, your booty black is so indespicable\nYou squaw-pie, tack-haired, motherfuckin jiggaboo\nYou can suck a dick or two or three or four or mo' here\nBut first get curlin iron burns off your forehead\nMy nigga Coe said, that you're an around the way girl\nYou're fuckin everybody around the way, and been all around the world\nAnd you still can't find yo' fate\nBut you had a couple of babies I mean a Bunch like Brady\nThe lady is a tramp snake ho yo and all of that\nFuck her sixty-nine you get the eighty-six and don't call me back\nYour black ass bunion\nThere's a party in your mouth BITCH, and everybody's comin\n\n[Chorus]\nHeidi Heidi Ho, huh, the Heidi Ho\nAll the niggas know, yo the Heidi Ho, c'mon\nThe Heidi Ho, hah the Heidi Ho\nAll the niggas know, that you're a Heidi Ho\nHeidi Heidi Ho, huh, the Heidi Ho\nAll the niggas know, yo the Heidi Ho, c'mon\nThe Heidi Ho, hah the Heidi Ho\nAll the niggas know, that you're a Heidi Ho", "image": "https://images.genius.com/e3b1b8cdac9f386a42441991d28a760b.624x624x1.jpg"}], "artist": "Common"}