{"songs": [{"title": "Hip Hop", "album": "Black on Both Sides", "year": "1999-10-12", "lyrics": "[Intro]\nYou say \"one for the treble, two for the time\"\nCome on, y'all, let's rock this!\nYou say \"one for the treble, two for the time\"\nCome on!\nSpeech is my hammer, bang the world into shape\nNow let it fall, (huh!)\n\n[Verse 1]\nMy restlessness is my nemesis\nIt's hard to really chill and sit still, committed to page\nI write a rhyme, sometimes won't finish for days\nScrutinize my literature from the large to the miniature\nI mathematically add-minister, subtract the wack\nSelector, wheel it back, I'm feeling that\nFrom the core to the perimeter black\nYou know the motto, stay fluid even in staccato (Mos Def)\nFull blooded, full throttle\nBreathe deep inside the drum hollow... There's the hum\nYoung man, where you from? Brooklyn number one!\nNative son, speaking in the native tongue\nI got my eyes on tomorrow (there it is)\nWhile you still tryin to find where it is\nI'm on the Ave where it lives and dies, violently but silently\nShine so vibrantly that eyes squint to catch a glimpse\nEmbrace the bass with my dark ink fingertips\nUsed to speak the King's En-ga-lish\nBut caught a rash on my lips, so now my chat just like dis\nLong range from the base-line (swish)\nMove like an apparition, float to the ground with ammunItion\n(Chi-chi-pow) Move from the gate, voice cued\nOn your tape, putting food on your plate\nMany crews can relate, who choosing your fate (yo)\nWe went from picking cotton\nTo chain gang line chopping, to Be-Bopping, to Hip-Hopping\nBlues people got the blue chip stock option\nInvisible man, got the whole world watching\n(Where ya at?) I'm high, low, east, west, all over your map\nI'm getting big props, with this thing called hip hop\nWhere you can either get paid or get shot\nWhen your product in stock, the fair-weather friends flock\nWhen your chart position drop, then the phone calls....\nChill for a minute, let's see who else hot, snatch your shelf spot\nDon't gas yourself, akh'\nThe industry just a better built cell block\nA long way from the shell tops\nAnd the bells that L rocked (rock, rock, rock, rock...)\n\n[Scratching]\nThe more emotion I put into it, the harder I rock\n\n[Verse 2]\nHip Hop is prosecution evidence\nAn out of court settlement, ad space for liquor\nSick without benefits (hungh!) Luxury tenements\nChoking the skyline, it's low life getting tree-top high\nIt is a back water remedy\nBitter and tender memory, a class E felony\nFacing the death penalty (hungh!)\nStimulant and sedative, original repetitive\nViolently competitive, a school unaccredited\nThe break beats you get broken with on time and inappropriate\nHip Hop went from selling crack to smoking it\nMedicine for loneliness remind me of Thelonius and Dizzy\nPropers to B-Boys getting busy\nThe war-time snap shot, the working man's jack-pot\nA two dollar snack box sold beneath the crack spot\nOlympic sponsor of the black Glock\nGold medalist in the back shot\nFrom the sovereign state of the have-nots\nWhere farmers have trouble with cash crops (woooo)\nIt's all-city like Phase 2\nHip Hop will simply amaze you, praise you, pay you\nDo whatever you say do, but, black, it can't save you", "image": "https://images.genius.com/7e6832cab470314ffb530b255928573d.600x600x1.jpg"}], "artist": "Yasiin Bey"}