{"songs": [{"title": "Hot 107.9 Freestyle, Pt. 2", "album": null, "year": "2013-07-02", "lyrics": "[Verse 1]\nK-Dot, Kendrick Lamar, got mad heart\nCome from Compton, I spit straight heart\nGot my hood on for Trayvon Martin\nFreedom, justice, you know we gon' be started\nGet the party started every time we come through flippin'\nFlamin' Hot Cheetos I'm eatin'\nI'm skippin' across L.A., that's somethin' that we do\nEach and every day, hangin' with my crew\nThrow another word, watch how I observe the train\nMatter of face, where's my girl, Sherane\nAnd when I say \"train\", that don't means that I flip her\nYeah, we did toss, turn just like Flipper\nMy favorite cartoon, you know\nGot to go with Bugs Bunny Cartoon Show\nTiny Toon Adventures, Dennis the Menace\nI'm a menace, I spit, break the World of Guinness\nWhen I'm flowin', you never know, I need another word\nGive me nouns and verbs, what I spit is absurd\nThe Finals, the Heat, yeah, they came with the Heat\nLeBron, Wade, no, they can't be defeat\nI stay in the shade, I'm in the darkness, I'm hot though\nAnother word, homie, you give me what you got\nWho kills my vibe? The haters, the groupies\nThe Hoovers in the streets, they try to shoot me\nI move with heat, you never can stop me\nI come from Compton, (?)\nThe best strip club, it's down Atlanta, it's down Miami\nI stay with the (?), I say, \"What's up, shawty?\"\nYou got your girl, I don't like fake ass, I need a referral\nI see everybody twerkin'\nEven Miley Cyrus got that motherfucker workin'\nYou can never stop me, The Rickey Smiley Show\nI'm here, I'm here, I'm lettin' people know\nThe better celebrity female in the game\nI like Rihanna, who else could complain?\nI love, I can't even say the word\nBut I'm cussin' and I don't need to pronounce a verb\nThe Black Hippy is the crew, we do what we do\nWe stay in the booth, we do it, we shoot\nWe straight for the stars, you know just who we ares\nWe ride in Buicks, then we pushin' the flashy cars\nI'm a flow all day, this The Rickey Smiley Show\nJust to let you know, we still 'bout to go\nThey bring me in, they show love with the crew\nRickey Smiley Show, huh, you know what it do, what's up?", "image": "https://images.rapgenius.com/eceef24e6238f4b9e2964245744e6068.1000x1000x1.jpg"}], "artist": "Kendrick Lamar"}