{"songs": [{"title": "Have a Party", "album": "Blood Money", "year": "2005-11-08", "lyrics": "[50 Cent]\nThis is how we do it, when we do it\nLike we just wanna tear the club up\nWe do it like ain't nuttin to it, the way we do it\nNow e'rybody put your fuckin hands up - let's go\n\n[Hook: Nate Dogg]\nHey! Go 'head and have a party if you want to\nNow now now now - c'mon\nHey! Go 'head and touch your body like you want to\nNow now now now - c'mon\n\n[Verse 1: 50 Cent]\nYou heard about the kid, you know how I rock\nWent from pumpin bags on the block, straight to the top\nSo the money ain't a thing now, yeah that's right\nMansion after mansion, next stop the Hamptons\nI splurge with it, I'm so absurd with it\nGot the hunger to go get it, cause I wan' go spend it\nYou know how a boss player play, nigga I'm ballin\nIf there's money to be made, I'm all in\nCatch me in a cherry red Porsche, beige seats, red pipin\nYou want me to teach you how to stunt, aight then\nTattoos on the arm, 30 karats on the charm\nCause the flow be the bomb, learn to respect the Don\nFirst night if I don't hit, second night I want some shit\nThird night we call it quits, I ain't fuckin with the bitch\nSuccess is my drug of choice, I'm high off life\nAnother move another mill', let's get right - aight?\n\n[Hook: Nate Dogg]\nHey! Go 'head and have a party if you want to\nNow now now now - c'mon\nHey! Go 'head and touch your body like you want to\nNow now now now - c'mon\n\n[Verse 2: Havoc]\nYou could, catch me cockin the fifth, got me rockin with Fif'\nNow that's why you see the keys to the Bent'\nGot my niggas movin the bricks, it don't stop\nAnd a million dollar deal, homey get that gwap\nSee dudes get comfy, money ain't long enough\nCome spit one verse, my whole crib's coughed up\nMa I got a fetish, fuckin in them Porsche trucks\nCurtis got one so when I finished I tossed her\nY'all into wifin, we don't condone lifin\nOnly fuck with bitches that, got they liquor license\nShop high prices, shook all vices\nInfamous nigga got the game in a vice grip\nChain hundred K but the flow, is priceless\nAnything less? We rollin them dices\nNuts in the sand if you ain't bumpin my shit\nShorty wanna rip to my sound and my likeness\n\n[Hook: Nate Dogg]\nHey! Go 'head and have a party if you want to\nNow now now now - c'mon\nHey! Go 'head and touch your body like you want to\nNow now now now - c'mon\n\n[Verse 3: Prodigy]\nListen - you can call me Gambino P or V.I.P\nMy wrists could buy a bitch a Ph.D\nMy rings alone could pay for you to eat\nFor the next few years I'm so icy kid\nMy flow is long money, my face is Hollywood\nMy tattoos gon' keep me with a thug part though\nMy attitude is universal, get harmed - call money\nWhen we get back to Queens we gon' hurt you\nCan't afford to ride, you gettin stomped out\nI got a team of dimes, they all thonged out\nReady to line you up and take you out\nMy girls is hot man, they hard to turn down\nYou pee in your drawers lookin like you're Mexican\nAfter lil' shorty wop wop break you off a lil' bit\nYou so stupid, we so much rich\nAnd who braggin? I'm just tryin holla at the chicks like\n\n[Hook: Nate Dogg]\nHey! Go 'head and have a party if you want to\nNow now now now - c'mon\nHey! Go 'head and touch your body like you want to\nNow now now now - c'mon\nHey! Go 'head and have a party if you want to\nNow now now now - c'mon\nHey! Go 'head and touch your body like you want to\nNow now now now - c'mon", "image": "https://images.genius.com/7a4cf429e37986ca33c364f8152cc509.600x600x1.jpg"}], "artist": "Mobb Deep"}