{"songs": [{"title": "Pyro", "album": null, "year": null, "lyrics": "[Verse 1]\nI got a corkscrew swag, they see me and get it popping\nI wear their ass out and in the morning take ‘em shopping\nTreat a ho so sweet, they get wit’ me, they spoilt rotten\nThey wanna be my baby, call me daddy -- no adoption\nShawty raw, ball, out at all costs\nHit the club twice as fly as anybody y'all saw\nTraining wheels on the hustle, I will never fall off\nYou can keep ya pussy baby, give me all jaw\nI’m young dumb, cold as they come\nTreat me like the drummer, give me some would ya hun’\nYeah I’m hung but I still get sprung with the tongue\nFuck her good all night, even the sun finna come\n\n[Hook]\nI’m on fire and ice cold\nA black Benz, a white Rolls\nLike loose women, and tight clothes\nSay I’m the bomb bitch, I’m dynamite, pyro\n(bow, bow, bow, bow, bow..)\nI’m dynamite, pyro\n(bow, bow, bow, bow, bow..)\nI’m the bomb bitch, I’m dynamite, pyro\n\n[Verse 2]\nRock a bad bitch, you with me, whats they name? who cares?\nTreat ‘em like Twix, keep'em coming in pairs\nGo insane in that pussy but I never go fair\nDebonair, so rare shawty it ain't even fair\nEverywhere you see I be, I get that don’t handle my B.I\nMoney small thing to a giant, Eli\nG4 flying, I don’t ever see the kiosk\nI take a nigga little bitch and buy her a little Prius, yes\nThey ain't on fire like we is\nCertified flyer, recognize us where you see us\nTake no shit, no how, no way\nWe TNT C4, Okaaay\n\n[Hook]\n\n[Verse 3]\nParty at the presidential, if you with it, lets get it\nNo matter where you live, I’m the hottest in your city\nThey talking ’bout they balling and their flossing but I live it\nI sit her in that Phantom, get her out that Honda Civic\nIn the VIP I’m chillin’, everythang ice cold\nBlack chicks, Latin bitches, Asian broads, white hoes\nFuck wit’ hoes who like hoes, only if they tight though\nPurse game insane, shoe game pyscho\nBlack on black, credit card on deck\nAnd a Black Maybach on the Boulevard\nV.S.'s in the chain, filled wit’ clear stones\nHero as I can be, H.N.I.C., I'm gone!\n\n[Hook]", "image": "https://images.genius.com/68262ccdcbffb87427d31b0d6085c2e3.400x400x1.jpg"}], "artist": "T.I."}