{"songs": [{"title": "Picture Me Rollin’", "album": "All Eyez on Me", "year": "1996-02-13", "lyrics": "[Intro]\nYeah, clear enough for ya? (alright)\nWhy niggas look mad?\nY'all supposed to be happy I'm free\nY'all niggas look like y'all wanted me to stay in jail\nHo bustas!\n\n[Verse 1: 2Pac]\nPicture me rollin' in my 500 Benz\nI got no love for these niggas, there's no need to be friends\nThey got me under surveillance\nThat's what somebody be tellin'\nKnow there's dope bein' sold, but I ain't the one sellin'\nDon't want to be another number\nI gotta puff a gang of weed to keep from goin' under\nThe federales wanna see me dead\nNiggas put prices on my head\nNow I got two Rottweilers by my bed, I feed 'em lead\nNow I'm released, how will I live?\nWill God forgive me for all the dirt a nigga did, to feed kids?\nOne life to live, it's so hard to be positive\nWhen niggas shootin' at your crib\nMama, I'm still thuggin', the world is a war zone\nMy homies is inmates, and most of them dead wrong\nFull grown, finally a man, just schemin' on ways\nTo put some green inside the palms of my empty hands\nJust picture me rollin'\nFlossin' a Benz on rims that isn't stolen\nMy dreams is censored, my hopes are gone\nI'm like a fiend that finally sees when all the dope is gone\nMy nerves is wrecked, heart beatin'\nAnd my hands are swollen\nThinkin' of the G's I'll be holdin'; picture me rollin'\n\n[Refrain: Danny Boy]\nPicture me rollin'\nPicture me rollin'\nPicture me, picture me rollin'\nPicture me rollin'\nOoh wee\n\n[2Pac during Refrain]\nCan you see me now?\nMove to the side a little bit so you can get a clear picture\nCan you see it?\nPicture me rollin'\nYeah, nigga!\nAye, but peep how my nigga Syke do it to you\nGuess who's back?\n\n[Verse 2: Big Syke]\nI got keys comin' from overseas\nCost a nigga 200 G's\nI'm a street commando, Nino for example\nThis lavish lifestyle is hard to handle\nSo I got to floss 'cause I'm more like a boss player\nThug, branded to be a women-layer\nSo many player haters, imitators steady swangin'\nMake me wanna start back bangin'\nSo I'm caught up in the game, dress code changed\nPackin' 40 Glocks, contain 'em or rearrange\nAll that jealousy and envy comin' from my enemies\nWhile I'm sippin' on Rémy\nIn front of black Lexus, Chevy's on the roam\n'96 big body, sittin' on chrome\nAs we head up out the zone, stone-facin' is on\nYou can admire, but don't look too long\nI'm livin' a dream with triple beams and my pockets bulgin'\nIt's hard to imagine, picture me rollin'\n\n[Refrain: Danny Boy]\nPicture me rollin'\nPicture, picture me rollin'\nPicture me rollin'\nPicture me rollin'\nPicture me\n\n[Verse 3: CPO]\nI gots to get the fuck up in it, formulate a caper\n'Cause a nigga straight sufferin' from lack of havin' paper\nMy bitch fin' to have a bastard, see?\nSo I needs to hit a lick, drastically\nI see some ballin'-ass niggas, and they slippin' in my spot\nAnd, uh, diggin' the plots (so what?)\nCheckin' in the park, 'Pac\n\n[Verse 4: 2Pac]\nWe caught him sleepin'\nHe didn't peep you niggas creepin'?\nThis how we do it every weekend\nI dump for madness, it's time to count the profit\nCPO, you got the bomb spot\nNigga, time to clock it\nI get the liquor, and you can get the females\nThis crooked shit that we inflictin', gettin' street sales\n\n[Verse 5: CPO]\nMove smooth as a motherfucker, me and my 9\nI'm cool as a motherfucker, I'ma get mine\nNow we satisfied, got the pockets on swoll\nBoss Hogg and this 'Pac nigga, picture us rollin'\n\n[Refrain: Danny Boy]\nPicture me rollin'\nPicture me\nPicture me rollin'\nPicture me rollin'\n\n[Outro: 2Pac]\nIs y'all ready for me?\nPicture me rollin' roll call\nYou know there's some muh'fuckers out there\nI just could not forget about\nI wanna make sure they can see me\nNumber one on my list: Clinton Correctional Facilities\nAll you bitch-ass CO's\nCan you niggas see me from there?\nBallin' on y'all punk-ass!\nPicture me rollin', baby!\nYeah, all them niggas up in them cell blocks\nI told y'all niggas when I come home it's on\nThat's right, nigga, picture me rollin'\nOh, I forgot! The DA\nYeah, that bitch had a lot to talk about in court\nCan the ho see me from here?\nCan you see me, ho? Picture me rollin'\nAnd all you punk police, can you see me?\nAm I clear to you?\nPicture me rollin', nigga, legit\nFree like O.J. all day, you can't stop me\nYou know I got my niggas up in this motherfucker\nManute, Pain, Syke, Bogart, Mopreme\nIt's sad, dog, can you picture us rollin'?\nCan you see me, ho?\nIs y'all ready for me? We up out this bitch\nAny time y'all wanna see me again\nRewind this track right here\nClose your eyes and picture me rollin'", "image": "https://images.genius.com/f0e663efef180da9b5d259005a1919e3.589x589x1.jpg"}], "artist": "2Pac"}