{"songs": [{"title": "My Last Words (Nipsey Tribute)", "album": "4REAL 4REAL", "year": "2019-05-24", "lyrics": "Man... uh, first off, I wanna send all my love to the family. Moms, pops, g-moms, Lauren, Emani, Kross, Blacc Sam, Adam, George, BH, Cobby, um... JStone, Jay, Jay Rock, you know what I'm sayin’? The whole family already know what it is with me. Um... Nip, you feel me, that's... you feel me, my brother from the other color, you know what I'm sayin’? Um... he was like a real big brother to me, like we... like we... like every time I'm with Nipsey, we not talkin' about no nothin' that don't mean nothin'. We always talkin' about goals, family, homies, plays we tryna make. Like... like I was havin' conversations with Nip about... I’m like, \"Look, bro, we got, we got some light skinned pretty girls we gotta raise, we in trouble, my nigga, what we gon’ do?\" You know what I'm sayin’? And uh... bro always gave me advice. You feel me? This locc'd out Crip nigga, he gave me books to read and shit like that. I'm like damn, this nigga different, man. You know what I'm sayin’? Uh... I mean, I could talk about a lot, but bro fought for me, I fought for him. You feel me? That's... I look at bro like a real big brother. He sent me a text message on my birthday, March 9th. He texted me like, \"Happy birthday, bro, I wanna congratulate you for building a brand that's gon' last forever. Respect.\" And I replied like, \"Good lookin', bro.\" I told bro, I said, \"Hussle the motivation, my nigga.\" You know what I'm sayin'? So... so... so, um, I just wanna let bro know. I wanna congratulate bro for his legacy and everything he did, all the game he gave me, all the people he touched, and for the brand he left behind. On behalf of the West Coast, on behalf of L.A. The streets, my nigga, we love you, my nigga. I'm gon' miss you, my nigga, and you already know what it is. All money in, 4Hunnid on mines, um, and like Lauren said, \"The mothafuckin' marathon continues, nigga.\" West side, nigga", "image": "https://images.genius.com/13e0c11c5b46547c8ec3c9f0a44c643e.1000x1000x1.jpg"}], "artist": "YG"}