{"songs": [{"title": "Ghetto Love", "album": "Sickology 101", "year": "2009-04-28", "lyrics": "[Intro]\nChoppers!\nOooh-wee\nOooh-wee baby, baby\nI like it a lot\n\n[Hook: Krizz Kaliko]\nI'm talkin' 'bout ghetto love\nGirl don't keep me waitin' for that\nGhetto love\nTalk 'bout misbehavin' 'cause when I\nGet you home in the sack and when I give it to you\nGive it back, give it back, give it back, give it back, give it back\nI'm talkin' 'bout ghetto love\nGirl don't keep me waitin' for that\nGhetto love\nTalk 'bout misbehavin' 'cause when I\nGet you home in the sack and when I give it to you\nGive it back, give it back, give it back, give it back, naked ass\n\n[Verse 1: Krizz Kaliko]\nI'm talkin' 'bout socks on, socks off, get my rocks off\nBig old back end, wax on, wax off\nYou can have it however you like, thin or go bad\nMakin' sure the cookie monster is tight\nGinseng make ya swing from the chandelier\nI know I sing but this a real man standin' here\nNow that I think cackle\nLay on your back girl, I'll have you thinkin' I'm the king of the world!\nWhen I put my thing in ya girl!\nI'm pullin' micro-braids and weaves out, blowin' backs and knees out\nHave ya screamin' Kali baby after that I ease out\nA predator lookin' for a black and decker pecker wrecker\nWith better than bed and head and make me wish I never left her\nHey! Hey! Don't tell your girlfriend how I beat it up\nAnd your man, he so cold to ya and I heat it up\nLet go your inhibitions, reservations: swallow them\nGet some ghetto-ness, I give it to you at your mama-nems\n\n[Hook: Krizz Kaliko]\nTalkin' 'bout ghetto love\nGirl don't keep me waitin' for that\nGhetto love\nTalk 'bout misbehavin' 'cause when I\nGet you home in the sack and when I give it to you\nGive it back, give it back, give it back, give it back, give it back\nI'm talkin' 'bout ghetto love\nGirl don't keep me waitin' for that\nGhetto love!\nTalk 'bout misbehavin' 'cause when I\nGet you home in the sack and when I give it to you\nGive it back, give it back, give it back, give it back, naked ass\n\n[Verse 2: Kutt Calhoun]\nHave you ever all witnessed the \"just been hit with a dick\" stature?\nFrom a nigga like me who licks it then hits in it after\nAll in your cervix servin' you some of this summer salami\nWork up a sweat from passionate sex like performing pilates\nGhetto! I'm lex-er than steel when it comes to real sex in the pill\n(Precaution) No step in this fill if you scared of catchin' a dilznick\nReal spit or do you prefer lil' dick?\nShe said \"no I likes it nice and hard to bring the real shit\"\nAnd I'll be comin', comin' from around a corner\nWith a box of Magnums to put it on you\nBackpack and Newports, a fifth of Patrón you\nNever hear Kutt Calhoun's a loner\nI'm not sincere, not me from the bottom of a bad\nMotherfucker named Sascha Fierce\nDrink, drink your Kool-Aid with a booty naked\nAin't nothin' but some motherfuckin' sex in here\nI beat the koochie, I treat the koochie\nI never heard a bitch call me a pussy\n(Why?) ain't seducing shut 'em up quick\nMake 'em cover up dick like she's a coozie\nTell 'em Kutt just what you like little mommy and we can settle up\nWe'll have you twitchin', feindin'\nAnd constantly thinkin' 'bout my ghe-'bout-'bout my\n\n[Hook: Krizz Kaliko]\nGhetto love\nGirl don't keep me waitin' for that\nGet some love\nTalk 'bout misbehavin' 'cause when I\nGet you home in the sack and when I give it to you\nGive it back, give it back, give it back, give it back, give it back\nI'm talkin' 'bout ghetto love\nGirl don't keep me waitin' for that\nGet some love\nTalk 'bout misbehavin' 'cause when I\nGet you home in the sack and when I give it to you\nGive it back, give it back, give it back, give it back, naked ass\n\n[Bridge: Tech N9ne]\nI want you to pop it and dip\nThen upswing your hips\nBack it up and don't trip\nLet your back bone slip\nSpin around, get a grip\nOf the pole and then flip\nBaby thats the way you strip\nHere's your tip, not on the lips\n\n[Verse 3: Tech N9ne]\nHey-hey the ghetto be missin' me, I had an epiphany\nI need some ghetto lovin', so I get where they're diggin' me\nThey sniffin' and kissin' me\nWanna split with me? All in favor say ye\nIs you is or is you ain't my constituency?\nWhooo-whoo-whoo-whoo-whoo!\nHeimlich, all over Tech N9ne dick, I'm a organ grind this\nDo you know you're beautiful and you're fine miss?\nAnd you two, you three finest, will you never be mine, miss?\nI love big behinds, call me your highndness\nHeavens to Murgatroyd, I love when you're workin'\nYou're twirkin' that ghetto booty, even makin' suburban boys\nMake a lot of suburban noise, got money in my pocket like I'm a turban boy\nSo after your coochie crusade, you know she ghetto\nIf she come and bring you Kool-Aid (Oh, yeah)\n\n[Hook: Krizz Kaliko]\nGhetto love\nGirl don't keep me waitin' for that\nGhetto love\nTalk 'bout misbehavin' 'cause when I\nGet you home in the sack and when I give it to you\nGive it back, give it back, give it back, give it back, give it back\nI'm talkin' 'bout ghetto love\nGirl don't keep me waitin' for that\nGet some love\nTalk 'bout misbehavin' 'cause when I\nGet you home in the sack and when I give it to you\nGive it back, give it back, give it back, give it back, naked ass\n\n[Outro: Krizz Kaliko]\nI'm talkin about pole slidin', lap dance ridin'\nDo something strange for some change if you're buying\nBut big strippers make big tippers\nShow no thankful for all their booty you give us\nFor just a drink or two, she'll make it wink at you\nDrain your change until she think you're through\nThe ohh she got your booty bopper\nOochie-wobble watch you while she callin' you poppa\nThe urge to push to thrust, I mean to shove\nTakes you back to the ghetto for some ghetto", "image": "https://images.genius.com/081166dc5d132ad1d3549578cac249e0.1000x1000x1.jpg"}], "artist": "Tech N9ne"}