{"songs": [{"title": "Meth vs. Chef (original version)", "album": null, "year": null, "lyrics": "[Kung Fu Sample]\nDuel, worthy of a general\nIf you want to fight, fight with me!\nOne to one! Man to man!\n\n[Intro: Lounge Lo, (Raekwon)]\nGet ready to gel team!\nLive and direct from the one-six-ooh\nWe got Tical, pow! Raekwon the Chef, Tical!\nIt's about to go on, Tical!\nYou make the call, I make the call!\nIt's all for all\nMethod Man, Raekwon the Chef\n(count my shells)\nAnd there's about to be one left\n(count my shells, nigga)\nI know you know it's on kid\n(Bring that shit I don't give a fuck!)\n*bell rings*\n\n[Method Man, (Raekwon)]\nWho lit that shit it was I the chinky-eye\nCheeba-hawk from New York, Tical Staten Isle\nNiggas thought, that they could walk a dog but they caught\nA bad situation, cause I'm a sandwich short\nOf a picnic, cause you ain't equipped with the sickening\nStyle, blowing up the spot like ballistic\nMissiles, I be comin through like the four-nine-three-eleven\nTearing up the power-u, Me-Tical\nA bad motherfucking Buddha Monk, what the fuck\nHit your chest, like cardiac arrest, blow the front\nOut the frame, hit the pussycat for the pain\nOf the dog shit, nobody move run your garments\nA rugged vet, terrible like a Champion sweat\nWrap a power in a tec, to wet\nA nigga up, with all the dangerous diseases\nSniffling sneezing coughing aching stuffy head fever\nFucker, I think it's bout time that you suffer\nBobbing on my nob like an all day sucker\n*bell rings* Bitch!\nMeth Vs. Chef\n(it's my turn) Meth Vs. Chef\n(yo let's bring that shit baby) Meth Vs. Chef\n(yo, yeah, one more time nigga) Meth Vs. Chef\n(callin me out, it's goin off) I blow your fuckin ass to death\n*bell rings*\n\n[Raekwon]\nI'm going all out kid no turnbacks\nYou could try to front, get smoked and that's that\nLyric assassin, dressed in black bugging\nSixteen shots to your mug, from a slug then\nI go to war in a concrete jungle, make the punt\nCause niggas act funny, and fumble\nBut I relax, count my shells, a lot of heads gotta fly\nNiggas stay strapped, armed to die\nTime for jet-black Tim boot, flowing\nWha-Su God get him, hit em with the nine troop\nNo question, cha-cha-BLOW in the session\nBloodshot in that direction, cypher\n*bell rings*\nAttack you like chess moves best move\nYo, yeah, yo\nThe boards, your ass\n'Tack, 'tack, 'tack, uH! *bell rings*\n'Tack the boards like chess moves best move\nAt Rae through, comin at your motherfuckin crew\nLive direct, yeah you better step\nGunshots ring on the set, let's jet\nMotivate, to the gate\nWith some quick high Rae stay fly, and rob your Isle\nAirwaves, yo behave\nNow you're a slave with the boots that paved the way\n*bell rings three times*\nAhh shit!\n\nChef Vs. Meth Vs. Meth", "image": "https://images.genius.com/fe6629f7a5e6af0aa38ca87547ced96f.1000x562x1.jpg"}], "artist": "Method Man"}