{"songs": [{"title": "Murder Was the Case (Remix)", "album": "Murder Was the Case - The Soundtrack ", "year": "1994-10-15", "lyrics": "[Intro]\n*helicopter flying overhead*\nThis is Angela Sanders coming to you live\nFrom the scene of yet another murder mystery\nIt seems that entertainer Snoop Doggy Dogg has been murdered\nWe have no information at this time\nBueno, estamos aquí y parece que mataron a Snoop Doggy Dogg, y no sé que pasó, pero, hay mucha gente y hay mucha sangre\n*lightning cracks*\n*helicopter passes by again*\n\n[Verse 1: Snoop Doggy Dogg]\nAs I look up, at the sky\nMy mind starts trippin, a tear drops my eye\nMy body temperature falls\nI'm shakin, and they breakin, tryin to save the Dogg\nPumpin on my chest and I'm screamin\nI stop breathin, damn I see deamons\nDear God, I wonder can ya save me\nI can't die my Boo-Boo's bout to have my baby\nI think it's too late for prayin, hold up\nA voice spoke to me and it slowly started sayin\n\"Bring your lifestyle to me I'll make it better\"\nAnd how long will I live?\n\"Eternal life and forever\"\nAnd will I be, the G that I was?\n\"I'll make your life better than you can imagine or even dreamed of\nSo relax your soul, let me take control\nClose your eyes my son\"\nMy eyes are closed\n\n[Hook (x4)]\nMurder... \"murder was the case that they gave me\"\n\n[Verse 2: Snoop Dogg]\nI'm fresh up out my coma\nI got my momma and my daddy and my homies in my corner\nIt's gonna take a miracle they say\nFor me to walk again and talk again but anyway\nI get, fronted some keys, to get, back on my feet\nAnd everything that nigga said, came to reality\nLivin like a baller, loc\nI'm havin money, and blowin hella chronic smoke\nI bought my momma a Benz, my Boo-Boo a Jag\nAnd now I'm rollin in a nine-trizzay El Do-Rad\n\"Just remember who changed your mind\nCuz when you start set-trippin, that ass is mine\"\nIndeed, agreed proceed to smoke weed\nNever have a want, never have a need\nThey say I'm greedy but I still want mo'\nCause my eyes wanna journey some more, really doe (check it out)\n\n[Break]\nNow I lay me down to sleep\nI pray the lord, my soul to keep\nIf I should die, before I wake\nI pray the lord, my soul to take\n\n[Hook (x2)]\nMurder was the case that they gave me\n\"Murder was the case that they gave me\"\n\n[Verse 3: Snoop Doggy Dogg]\nNo more indo, gin and juice\nI'm on my way to Chino, rollin on the grey goose\nShackled from head to toe\nTwenty-five with a izz-L, with nowhere to gizzo, I know\nThem niggas from the other side recognize my face\nCause it's the O.G. D-O-double-G, L-B-C\nMad doggin niggas cuz I don't care\nRed jumpsuit with two braids in my hair\nNiggas stare as I enter the center\nThey send me to a level three yard, that's where I stay\nLate night I hear toothbrushes scrapin on the floor\nNiggas gettin they shanks, just in case the war, pops off\nCause you can't tell what's next\nMy little homey Baby Boo, he took a pencil in his neck\nAnd he probably won't make it, to see twenty-two\nI put that on my momma, I'mma ride for you Baby Boo\n\n[Hook (x4)]\nMurder... \"murder was the case that they gave me\"\n\nSwitch!", "image": "https://images.genius.com/0e58d7d7abc21e0c996c27e335e08719.999x1000x1.jpg"}], "artist": "Snoop Dogg"}