{"songs": [{"title": "Let It All Work Out", "album": null, "year": "2018-10-07", "lyrics": "[Intro]\nAy, how many hoes you 'bout to fuck, fool? Twelve\nWe got London On Da Track\nHey\nLet it all work out, aye\nLet it all work out\n\n[Verse 1]\n1991, Big Duck had a nigga named Lil Jeff\nStarted from the bottom, now a nigga so high, you gotta watch your damn step\nNever wore fake gold, nigga, diamond’s water like it knew Michael Phelps\nEvery time I get a shape-up, I give 'em Jacksons like niggas was Michael, yeah\nNut by myself, hut by myself\nFight break off in the chain gang, they ain’t gettin' cut by myself\nNigga same thing, nigga bang bang, I did a lot of things for this wealth\nEww, what’s left?\nCalculator living, now she fuck me on the steps\n50k a show, I pray to God I don’t get killed\nPlus, she pray to God I don’t get killed 'cause she need help\nFour diamonds, tuck me in my belt\nNigga, how the hell you gon' throw the profit?\nMy old school own diamonds, squat it\nNigga, let 'em have it\nHow many, how many girls\nSo many years without Tampax Pearls\nBut you forgot to train your lil' girl, let, let this shit work out\n\n[Chorus]\nHey, let this shit work out\nOh, let this shit work out\nHey, let it all work out, out\nLet it all work out out out, out out\nLet it all work out out out, out out\nOut out, out out, out out, out out\nLet it work out, work out\n\n[Verse 2]\nGod, this bitch, wanna fuck, Thug, swag\nHunnids bagged up, up, up\nPass that clique, I'ma meet her like a damn ticket\nFeed my dick, word for brick, I'm the highest hippie\nHouse blacked out, red opps, don't get caught\nFuck a partner, iced out Rollie, I ain't gon' sugarcoat it\nLet let let let, let it all work out\nI'm a junkie, I spend racks like a cash cow\nBih- bitch, I control everything from the couch\nI done served this bitch so much dick, she don't know how to walk\n\n[Outro]\nLet it all work out, let it all work out\nLet it all work out, let it all work out\nLet it all work out\nWe got London On Da Track", "image": "https://images.genius.com/717461618e785def35d07de6484b7ad4.1000x1000x1.png"}], "artist": "Young Thug"}