{"songs": [{"title": "Tookie Knows II", "album": "Blank Face LP", "year": "2016-07-08", "lyrics": "[Intro: Schoolboy Q]\nUh, we might die for this shit, nigga\nUh, might go down for this shit, nigga\n\n[Verse 1: Schoolboy Q]\nGang, gang bangin' that Crip shit\nNiggas said cuz in the first grade\nIn the shade where the cops can't see us\nEighteen, tryna dodge the cage\nIt was cool 'til that gang sweep\nNow I'm in back of a van and my wrists got a band\nGot a number for a name\nNo name on the visit, no call get accepted\nNow I'm forced to a man, murder raps, where you from?\nPut the nigga on his pockets, watch the COs, they be watchin'\nCounting noodles for the hustle\nCounty spread for the muscle\nCouple marks on my knuckles\nPuttin' niggas on bunk status\nShoulda been with the bitch ass\nNow he on a mattress that we bench press\nPC, get the Fruit Loops\nKeep tellin' on niggas, why I fuck with that nigga?\nNigga made bail but I'm still at rage\nShould I thank God for the hell I raised?\nCause the nigga that snitch is gonna feel that grave\nLike, ain't nothin' to a locc, huh?\nWent missin' to his folks, I ain't in, I ain't know, huh?\nThey ain't show up to the court, huh?\nBut then charges gotta go, huh?\nA young nigga back on Fig, H-crown on wig\nShoe strings say where I'm from\nOn probation and got my gun\nOther side goin' for that thumb\nMotherfucker, I'm gangbanging\n\n[Verse 2: Traffic]\nNigga I'm blue'd up, blue Chucks\nBlue tee, nigga I keep it G\nNigga, in the streets is where I be\nI'm up like breakfast while niggas sleep\nMe and Floyd posted on Fig\nGetting it in and movin' it out\nGetting it in and movin' it out\nI'm holdin' the heat, he's watchin' the block\nI'm watchin' for cops, I'm holdin' these rocks\nFiends keep comin', this shit don't stop\nWhen it's war time, niggas get popped\nWe might die for this shit off tops\nMy nigga gonna ride for this Crip, no lie\nBut I ain't dead, yeah, nigga, thank God\nMoney got niggas lookin' at me all odd\nPunk ass niggas better go get a job\nRun up on me wrong, bitch, nigga get popped\nI'm gon' ride for this shit, on Crip\nA nigga gon' die for this shit they trip\n4/5th extendo, with fifty in the clip\nTF by my side, he stupid with this shit\nQ in the ride grippin' on the fifth\nRun up on me wrong\nMy nigga, my nigga, I'm gang banging\n\n[Verse 3: TF]\nUh, might go down for this check, nigga\nUh, I might die for this set, nigga\nI ain't trippin nigga, I ain't slippin'\nNiggas lyin' sayin' I ain't Crippin'\nBack to back, me and Tiny smack\nI said back to back, straight cups of 'gnac\nNiggas ask, what he signed for?\nI got an eight ball, I got a Rondo\nI got an AK when that bitch spray\nIt's like pullin' strings on a lawnmower\nLast time I seen jail, nigga\nI was cell livin', getting mail in it\nI ain't even talkin' mail, nigga\nPay-pals for the cell, nigga\nHit the streets and cause hell, huh?\nSchool of hard knocks, fuck Yale, huh?\nSee me and Traffic like a orca, nigga\nAnd the black and whites love whale watch\nFront line like mailboxes\n5-12, that's the numbers on it\nMay first, May deuce, May twelfth, members only\n.45, no numbers on it\nScratched down, I'm strapped down\nMight go down for this shit\nIf I don't then I'm racked down\nRank up there with Shaq crown\nI got a Benji button like Brad Pitt\nI press that, I'm gettin' rich\nI might go down for this shit\n\n[Hook: Schoolboy Q]\nWe might die for this shit nigga\nMight go down for this shit nigga\nGang, gang bangin' that Crip shit\nWe might die for this shit nigga\nMight go down for this shit nigga\nGang, gang bangin' that Crip shit\nWe might die for this shit nigga\nMight go down for this shit nigga\nGang, gang bangin' that Crip shit\nWe might die for this shit nigga", "image": "https://images.genius.com/2d03dd3816b9f03a303110b5628e696c.1000x1000x1.jpg"}], "artist": "ScHoolboy Q"}