{"songs": [{"title": "Phoenix", "album": "LONG.LIVE.A$AP (Deluxe Version)", "year": "2013-01-15", "lyrics": "[Verse 1]\nBloody ink on my pad spelled suicide\nMichael Jackson even passed cause you scrutinized\nFuck Illuminati lies, say I'm lucified\nBaptized in the gutter, motherfucker you decide\nCause the ride come with doors that be suicide\nOr the thighs on my whores, they be super-sized\nGood and bad having wars, nigga, choose a side\nNow all hail to the Lord like you do to God\nWho am I? Lord Flacko\nPainting vivid pictures, call me Basquiat, Picasso\nCapo Head Hancho, now my following's colossal\nAin't no boxer, Pacquiao, but got the chopper todo caso\nIt's like you heard God spoke, I seen the ghetto gospel\nThe choir like my reefer and the preacher got my eyes low\nSister Mary Jane to make me sleep from singing high notes\nThe bible or the rifle, goodnight folks\n\n[Verse 2]\nBloody ink on my pen spelled suicide\nKurt Cobain even died cause you scrutinize\nIt's a fine line between truth and lies\nJesus Christ never lied, still was crucified\nThat's why I never judge another nigga\nLife's a bitch, but that bitch in love with other niggas\n3 to a bed, sheets, no covers nigga\nDirty kitchen, no supper in the cupboards nigga\nSucker niggas, wassup with niggas?\nSo my new attitude is like \"Fuck them niggas!\"\nI grew up with niggas but don't fuck with niggas\nI don't trust them niggas, ain't got no love for niggas\nHad the gold grills shining like them southern niggas\nKept it trilla, now the whole world fuckin' with us\nMeanwhile, you treated all of us like other niggas\nNow your world is in my palm, take cover niggas\n\n[Bridge]\nIf I shall ever fall, Lord pick me up\nEver since a baby, two deuce in sippy cups\nEver since them diapers and my zip-me-ups\nNow I'm walking on my own, y'all, wish me luck\n\n[Outro]\nWhere do we lie\nTell me where do we stand\nWhere do we go\nIt's all part of the plan\nWhere do we lie\nTell me where do we stand\nWhere do we go\nIt's all part of the plan", "image": "https://images.genius.com/75621d1119a70043aadbe3fbf4387d88.640x640x1.jpg"}], "artist": "A$AP Rocky"}