{"songs": [{"title": "We’re Back", "album": "Grand Champ", "year": "2003-09-16", "lyrics": "{*whispered*} Ruff Ryders (\"They're BAAAACK!\")\n\n[DMX]\nThis is what you're tellin me, okay\nIt all comes down to this huh? Okay\nThis is what you fuckin tellin me?\nThat this is it? Okay (GRRRRRRRRRR)\n\nHow many slugs should I plug into yo' chest before it's get filled\nSince you ain't got nuttin else to do but get killed\nBeen a fiend every since I found out how a slaughter taste\nEmpty a clip of hollow tips into yo' daughter's face\nCause that's just the type of shit that I'm on\nCollect my dough, make the fuckin hit and I'm gone\nI ain't never gots to worry about the aim\nInfrared, to your head, will make sure, I hit him in the brain\nBLAOW! One mo' time for good luck - for what?!\nHe was already dead, what the fuck?!\nI be, breakin my shit up OFF in a nigga\nWhen I don't see, nuttin but SOFT in a nigga\nFuckin coward, I wonder how it - feels\nTo have to look at your moms - squeal, after I hit her with the steel\nIll, that's how a nigga blows shit up\nBelieve whoever I hit up, will never get up\nTell me, how it's goin down nigga\nIf I'm bein a fuckin clown nigga (yeah)\nTake a couple of rounds nigga, I keep a toast real close\nIn case I gotta turn the rest of yo' peeps into ghosts\nFuck it I'm ready for combat, with a gat\nThat'll make any nigga, become a meal for the fuckin rats\nThere won't be nuttin left of money but a soupbone\nBig Motherfuckin DMX from the group home\n\n[Hook: DMX]\nNiggas don't mean what they say when they talk\nNiggas lean a certain kind of way when they walk\nNiggas don't mean what they say when they talk\nNiggas lean a certain kind of way when they walk\n\n[Eve]\nSince the first day in it, I made a promise to myself\nI was gonna make it happen, that's the way I felt\nYou know Philly never scared, play the cards we dealt\nDoin it my way, you bitches strugglin for help\nI hear your rumors and your so-called beefs\nBut it's a different story any time we meet in the streets\nI'm fully in it bitch, your shit is juvenile to me\nWe can squash it, go 'head let you warm up the crowd for me\nI hate to even be like this, y'all bring it out\nTo tell the truth it excites me, I scream it out\nSick wid'dit, ain't a bitch that can get wid'dit\nAdmit it, I'm that bitch you can't live wid'dit\nAnd I'mma keep it comin long as I'm here\nPitbull, back at'cha neck, I'm hearin them cheer\nE-V-E is what they need in they life, I'm bout mine\nNow I'm done wit'chu, fuck out my face, wastin my time\n\n[Hook: Eve]\nBitches don't mean what they say when they talk\nBitches lean a certain kind of way when they walk\nBitches don't mean what they say when they talk\nBitches lean a certain kind of way when they walk\n\n[Jadakiss]\nNahh! Uh, yeah, aiyyo\nI got a wet haze, coke, and a p-blow block\nBut y'all still missin the point like a free throw shot\nGet it? This ain't some'n you learn, this is some'n you earn\nTurn it up and give me some'n to burn\nThat boy 'Kiss is a hell of a man\nTreat your life like a cell phone, so try to get a helluva plan\nCause most dudes left the hood broke\nA couple knew what they was doin, so they came back like good coke\nDown South they'll tell you 'Kiss is good folk (that's right)\nUp North I hit my niggas off with good smoke\nOut West they ridin with me, now I'm back hard\nI'm just worried bout the rats that's in my back yard\nHated by many, confronted by none\nI trust two guys, one's God, and one is my gun\nJada is the nice guy, 'Kiss is the monster\nD-Block and Double R is my sponsor\n\n[Hook: Jadakiss]\nCowards don't mean what they say when they talk\nCowards lean a certain kind of way when they walk\nCowards don't mean what they say when they talk\nCowards lean a certain kind of way when they walk\n\n[Jada] Fuckin cowards!\n\n[DMX]\nNiggas can't be fuckin serious, y'all niggas pussy\nNiggas pussy - y'all don't like it? BRING IT, BITCH!\nJust a lil' some'n man, to let y'all know\nTo niggas know man, matter of fact\nMatter of fact y'all niggas, excuse my back man!\nStraight up y'all niggas, pardon my back!\nI ain't got no rap for no sucka-ass niggas!\nFive time motherfuckin champ!\nFive times! BITCH! Touch that! Then holla back!\nMotherfucker!\n\nA nigga done had this rap shit\nI'm out..", "image": "https://images.genius.com/e730418bfaada4fc845d1179160af643.999x999x1.jpg"}], "artist": "DMX"}