{"songs": [{"title": "I Am Your Leader", "album": "Pink Friday: Roman Reloaded", "year": "2012-04-03", "lyrics": "[Verse 1: Nicki Minaj]\nUnh! Look sucker, this my gun butt-uh\nStreet fighter bitches, this the up-cut-uh\nNunchuk-uh, no time to duck-uh\nSign of the cross, 'cause this is her last supper\nPlay with me, check who came with me\nI bought a couple nines, plus, the Ks with me\nI breeze through Queens to check some bad bitches\nI stunt so hard: assess the damages\n'Cause this that \"Oh,\" this is that \"Oh\"\nAnd yes, I body bitches; go get the bandages\nYoung Yummy, fuck you got for me?\nI hate a phony bitch that front that chum-chummy\nI'm me: top shotta, drop the top top-uh\nBig fat pussy, with a icy watch\n\n[Hook: Nicki Minaj]\nI am your leader, yes, I am your leader\nYou not a believer, suck a big dick\n\n[Verse 2: Nicki Minaj]\nYo! When I fly, it's one letter and one number\nYou wack hoes could get hot for one summer\nAfter that, the Queen'll still reign here\nI'm Santa Claus to these hoes without a reindeer\nSaint Nick; Ross; hey, Rick\nI just got a toy, cost 850\nNow I'm in the hood, niggas is getting woodies\nHit up Hot Topic, Nicki Minaj hoodies\nI-I-I-I-I'm a brand, bitch, I'm a brand\nGo to Harlem, and get Cam\nIt's DipSet, get your dick wet\nBoarded a big jet, and got a big check\nNow you tell me: who the fuck is winning?\nI'm on my Russell Simmon, Nicki denim, Nicki linen\n(Ugh!)\n\n[Hook: Nicki Minaj & Rick Ross]\nI am your leader (Ugh!), yes, I am your leader\nYou're not a believer, suck a big dick\n\n[Verse 3: Rick Ross]\nJealous niggas is gossip, watch me tie up my laces (Ugh!)\nBitches be jocking, tell by the look on they faces\nEight digits I'm clocking, a lot of gold in my bracelet (Woo!)\nSeven figures on watches; I told my mama I made it (Ha-ha!)\nMade a deal for my project; just give me ten mil', I'm gravy (Gravy!)\nI went back to the projects, in two mil of Mercedes\nI get head from your lady; have her bill me later\nI'm old school with the hustle, just gave Rihanna my pager\nHeartbreak hotel, I'm in the A-Rod suite\nRolls Royce wood, I'm talking playoff seats\nKnow that boy busy balling, I like to play all week\nMonday night with the RAW, I’m Vince McMahon with a beat\nPower-slamming them hammers, I get you handled for free (Ugh!)\nSo where the fuck is her manners? She give me brain while I tweet\nDM, in the BM, you \"cm\"; you bucket, you love it\nMotherfuckers on my dick, suck it\n\n[Hook: Nicki Minaj]\nI am your leader, yes, I am your leader\nYou're not a believer, suck a big dick\nI am your leader, yes, I am your leader\nYou're not a believer, suck a big dick\n\n[Verse 4: Cam'ron]\nUgh, see the car is European\nBut got imported from Tokyo (It did)\nLooking like a shark\nThe nose, call it Pinocchio (No lie)\nWell off, wealthy, LV logo (Uh-huh)\nMiddle of July, but the wrist on snow-flow (Swish!)\nOnly do the Aspens\nY'all can have the Poconos (Y'all can have that)\nI'm Sonny, and you my son (Calogero)\nRide the whip, five on the hip\nLive with the pies, got nine for the flip\nHigh with a bitch, she cry for the dick\nOh my, know why? I'm fly as it gets\nNow I need a Aspirin; she said, \"You're only Cameron\"\nGirlfriend, you don't know Cameron from nowhere\nSo don't go tampering (Watch ya mouth)\nYou're just a nail, I hammer (Yup!)\n'Nother girl that's on my camera (Yup!)\nMy name, you cannot slander at all\nGirl, watch your manners (Yup!)\nShe run and tell her mother, \"I think I love him, Nana.\"\nBecause you sat upon my lap? Nah! I ain't Santa (Nope!)\nThey call me \"Pied Piper,\" OJ no glove I knife her\nNever been a lifer, even do Rikers\nWhy would I fight? Don’t even like her (Ch-ch)\n\n[Hook: Nicki Minaj]\nI am your leader, yes, I am your leader\nYou're not a believer, suck a big dick\nI-I-I-I am your leader, yes, I am your leader\nYou're not a believer, suck a big dick\nI-I-I-I am your leader, yes, I am your leader\nYou're not a believer, suck a big dick\nI am your leader, yes, I am your leader\nYou're not a believer, suck a big dick", "image": "https://images.genius.com/d8ab635827060eb71d3130b28c7cd04f.1000x1000x1.jpg"}], "artist": "Nicki Minaj"}