{"songs": [{"title": "Enzo", "album": null, "year": "2013-08-21", "lyrics": "[Tyler]\nIn the back of a truck with a gay slut\nTryna bust a nut in her butt with no makeup\nPassed out, this dead bitch don't wanna wake up\nFuck Rachael Ray, cause she tryna get a cake-up\nEatin' donuts (white hoes)\nGettin' high as fuck (snort coke)\nWhoa, I'm just tryna finger it in your hot car\nFuck a nigga, just fuck here in top block\nI'm a unicorn (yeah), you aren't a unicorn (yeah)\nNow I'm a uniform (yeah), rapin' you to perform (what?)\nMade me doper than my shrooms in my system\nMy trophy sister, she'll get mugged\nRight in the back of a club with a\n45 shotty, bet you 30 dollars you won't\nFind her body, now she's fucked\nGet these bitches love drunk\n\n[Hook]\nWhat up what up, what's goin' on?\nThis OF, up on the song\nWhy you staring over here like something's wrong?\nWe the West over here, nigga sing along\nWhat up what up, what's goin' on?\nThis OF, up on the song\n(Bitch)\n\n[Mike G]\nUh, in the back of a blue truck, fucked up\nRollin' dice, snake eyes, niggas ain't got luck\nI just lay back, still ain't blew up\nHoney got me some of that rum like I threw up\nYou should really fear me\nMade this bitch squint and couldn't see me clearly\nBitch I'm a gift like you lookin' at Christmas\nYou should look up to him, now you on my shit list\nBitch I ain't fucked with you before\nYou ain't gotta hound me when I step through the door\nI'm the best doin' it\nHe's spittin' that super shit\nWhy the nigga so lame\nI don't even say his name\nBut he white like cocaine\nThis is fire, propane\n\n[Hook]\n\n[Tyler]\nWait a minute, what's your name?\nLet's play a game of balls in your throat\nSmell like fish, cheesy like a goat, bitch\nThe only that she good for is sucking dick\n\n[Mike G]\nAnd I came quick\nI fucked a bitch in a plaid skirt\nI mean raped, don't ask her\nThen I put the quick punch on her lip\nBade her in the basement\n\n[Tyler]\nI was wearing a really nice dress\nWith sweet puffs, green and white\nThis is nice, I look nice\nFix my dick...\nCheck it twice", "image": "https://images.genius.com/610384882ca6311db99de4fbfcdf2b46.421x421x1.jpg"}], "artist": "Tyler, The Creator"}