{"songs": [{"title": "Move Back", "album": "Osirus", "year": "2005-01-04", "lyrics": "[Intro: E-Snaps]\nAww, man, yeah, Lenox Ave. Boyz\nAww, man, come on, yea, yeah, yo\n\n[E-Snaps]\nYou doin' what you doin', let's get it\nStarvin' and you robbin', and you catch a nigga slippin', best get 'em\nHit 'em where the good Lord split him\nIntroduce myself, go booth yourself\nIn the far left lane, and I'm, hydro planed\nAnd I'm, slingin' my 'caine, don't care how you feel\nCheckin' out the truck, check the wheels\nWanna get fucked, bitch kneel, let me splash in your grill\nWho but me? Muthafuckin' right, get it right\nPapi of this motherfuckin' thing, truck tight\nRollin' with my niggas, we ain't lookin' for no fights\nNow pop one in your head, that's all she said\nIt's time to get head in my Mercedes-Benz\nChipped up and I ain't even talkin' bout my jams\nClipped up, so any nigga frontin', gettin' banned\nGive 'em all ten in his chin, I'm all in\n\n[Hook 4X: Meeno]\nMove back, move back, you can't fuck with me, huh\nI'm from the clique called N.I.B\n\n[Meeno]\nNext up, I believe that's me\nMeeno, get it right, no descrempancy\nAlways keep a weapon, see, run it ground\nWorth of stones, nothin' less on me, why you stress on me\nNiggas mad cause I stretch my D., ya'll dudes want my recipe?\nHere's what ya'll do, hit the lab, write an album or two\nThen I might let you sign my shoe, that's just how I do\nEverybody sayin', boy too souped up\nNah, I'm just hot, plus Bentley Coup'd up\nWho put, you too busy holdin' the stoupe up\nYa'll fault your broke, and not mine, stupe'a\nI'm like Juve', I need it in my life\nGot fifty birds flyin' in, later on tonight\nRock and I hustle, so I get paid twice\nLife is a gamble boy, roll your dice\n\n[Hook 4X]\n\n[Tony Wink]\nWho you know spit flows, get dough like I\nIn the L.A.B.'s, motherfucker, no lie\nHit the links I've seen, back in late '95\nHad to wait for two nine, rockin' and clickin' on both sides\nOf course we gon' ride, ride over the competition\nThe real has arrived, ya'll bitch niggas is finished\nAll I gotta do is Nextel tag my lieutenant\nYour whole click will get toe tagged tagged in two minutes\nThis to them fools thinkin' they gon' catch the God slippin'\nI'm always on point and I'm always packin' my weapon\nYou see me in the club, believe me, I got the tech in\nI slipped the DJ a guard, you slipped it in with the records\nEither you love it or hate it, but bet you gon' respect it\nRainbow glow, when the lights hit off the necklace\nI'm what you can't be, young, black, rich, and wreckless\nIt's the god free, and L.A.B.'s, one two, check it\n\n[Hook 2X]\n\n[Interlude: Jae Millz]\nRemix! Huh, yeah, it's 101, what?\nYou know what it is when you hear that, Harlem\nFix ya face or smacked in it, Harlem\nHarlem, right here, Harlem\nYou gon' stupid if you don't bounce to this man\nYou gonna only look like a hater, huh-huh\nLenox Ave. Boyz, what up, it's only right\nThey know what it is, man, remix\n\n[Jae Millz]\nMove back, its no touchin' me, I'm from that place called NYC\nH Dub to the death, and I don't give a fuck what party it is\nI'm still in the club wearin' sweats (hah)\nMilk ears with the money colored check\nIll two step, blowin' dubs with the best\nLive life, most hated, with my Lenox Ave. Boyz\nRemix, Move Back, with Grease providing all the noise\nHuh, your home boy game so raw\nAnd I ain't even gotta say my name no more\nHaters wanna give my name to the law\nBut punchin' and kickin', to kick us all, they can blame you for\nMight catch me in the 'Lac with Snaps\nOr lightin' sticky green 'dro, with Wink and Meeno\nYou from the hood and you ain't no coward, well me neither\nAnd before you step on my sneaker, I really think you need to (move back, move\nBack)\n\n[Drag-On]\nThis your boy to the dash\nSame nigga, no talkin', just result to the mass\nI stab niggas, throw the hawk in the trash\nPeroxide my bullets, give the burners a bath\nThree fifty Z, burnin' the Ave\nI'm old school, I still got the fiends burnin' the glass\nI pull the pump off my waist, and dumb in your face\nI'm a little bit too hard for the radios to play\nI still can spit eighty miles an hour in a verse\nAnd my Coupe go eighty miles an hour in reverse\nI let my tool go, ya'll niggas just studio killas\nNigga, I'mma killa in the studio\nI got guns that'll hollow a wall\nPoint it to your jaw, make you swallow it all\nYa'll niggas want hardcore?\nWhat the fuck you think the R, and Full Surface and D-Block is for?\n\n[Cardan]\nThey ask, who's that, that's P-Cardi\nAnd what he in, what he in, he in a Fer-rari\nYou know I'm strapped, you know I'm strapped, I got the heat on me\nAnd what I'm wearin', and what I'm wearin', a long Bigari\nThinkin' I'm Joe Clark, nigga, try to 'lean on me'\nBut if he is, like Biggie said, 'he gon' bleed'\nNiggas ain't hard, niggas heart full of creatine\nBut go against that, green, I go against your, brain\nAnd don't fuck with me and the kid, I've been a daddy all my life\nNo 'dro, we gon' blow that alley all day, say what\nAct stupid, we gon' it crackin' here tonight\nGreasin', Meen' on the front, with Snappy on my right\nIf rap don't work, nigga, we go to the kitchen\nThose ain't hoes, so then you know we ain't pimpin'\nI'm on, my toes, so nigga, no, I ain't slippin'\nToo close, hold somethin', or now I know Cardy didn't\n\n[Terra Blacks]\nAnd if he know, what keep me little\nThink you know, I think it later\nSee me, and my guns come to, just like a waiter\nYou up north, singin' just like Anita Baker\nMake up your mind, then come and ready, feen to meet your maker\nThe man that laugh last, will surely laugh harder\nMe have a gonna shut up and eat bars, and all of the prankster\nWith them and I for black gangster (huh, I'm from the clique called N.I.B.)\n\n[Ol' Dirty Bastard]\nBut drunk, when he hop inside, in the club gettin' tired\nBitches scatter all around me, ready to excite it\nAll these kittens got me flea bitten, eatin' out my mitten\nI'm comin' off top, my moves are unwritten\nNow slitter to the snake, in the spring time wither\nBut strong on my own, Wu-Tang, I'm forever\nWomen desirin', jobs is hiring\nMoney admiring, never keep tiring\nRhymin' ain't nothin', the easiest job ever\nAnd I'm doing mine, holdin' it together\nWhile money quadruple, from playin' the cripple\nDrinkin' from a titty nipple, sippin' on ripple\nBlunt keep on flippin', from keep gettin' dippin'\nThe mic I'm rippin', the record skippin'\nThe pussy drippin', the wet got me slippin'\nThe bitch I'm strippin', I'm platinum shippin'\n\n[Hook 4X]", "image": "https://images.genius.com/4250840e6d0ec82feb74e42c448c72d7.455x455x1.jpg"}], "artist": "Ol’ Dirty Bastard"}