{"songs": [{"title": "Satellite", "album": "Summer Knights", "year": "2013-07-01", "lyrics": "[Verse 1: Joey Bada$$]\nAnd I guess it's my turn to shine\nThe bright light I was starin' at turn lime\nAnd the green stuff turned to slime, and grime\nEverybody want to be your blood cousin\nWhen you're buzzing\nFine, I give 'em my other line, another rhyme\nWord to mother, I'm goosed up\nMy two fucks in two cups\nAnother double entendre\nShe fell in that Bombay\nNow she tumble dry lingerie\nChardonnay nothing but the bottle of emotion\nBut the love potion when it sprays\nThey just caught up in the days\nLet me show you how I feel these Jays\nThe cheese stays high like Dr. J\nMy flow is like land the boats, dock the planes\nHand the dope but cop the chains\nFor more fiends some antidote to stop the pain\nNow my stream, floods these streets\nThey can't stop the reign\n\nAll right I need them back\nTo blast, to blast me out of sight\nLike a satellite\nVibe all night\nA satellite\n\n[Verse 2: Chuck Strangers]\nI take a day off\nLet the trees take some weight off\nMy mental's just a fact, Bannon's got the instrumental\nI keep niggas on their toes\nSo you got creases in your Forces\nMy verses they're important, yo your verses they are boring\nI am not of this Earth bro\nI'm a satellite that's bound to fight\nBut we're down to light, 'n light the fuck up\n\nVibe all night\n\n[Verse 3: Kirk Knight]\nAs I roll the dice\nLike my first drink was just the brink of a crooked eye\nBut don't blame the ice for the I U KEL\nOh God couldn't see past 'em\nIf his puff pass, notarized\nTwo dubs I got 40 on my hit list\nJust smoking drinks both the broken in-glass like old English\nAre you good bro?\nIs your eyes dilated from the kush 'n Nuvo?\nThis new for the life\nLike a Nubian with the doobie cold eyes\nBetter smell the coffee I'mma coughing\nThat means I'm sick widdit, spit it out\nKill it like airborne diseases\nIs this why the rap game is this easy?\nLike please eat your vegetables\nSo I took a dose of the edible\nAin't an overdose\nAlready a rap monster fucking overload\nHopping up on stepping stones\nSo we making stepping stones\nTurn up that tichrome\nWe rap game dose\nThis is Messiah and the eyes are hopeless\nHopin' my divide eyes through the world flex\n\nThis shit\nDon't this shit make my people wanna jump?\nNo disrespect, ask my man for the pumps\nDon't this shit\nTo blast, to blast me out of sight like a satellite\nDon't this shit make my people wanna jump?\nNo disrespect, ask my man for the pumps\nDon't this shit make my people wanna jump?\n\n[Verse 4: Dessy Hinds]\nSurround Sounder\nCome and hear the blunt-smoking philosopher\nSmoking with a joint to get you open like a chakra\nNo time for the roster this rap game goes either way\nLet him lead the way\nAnd niggas will know who they need to play\nFreeing the ways to amplify the idiolect\nSaw nothing but shots since the project days\nLike I was eyin' the Tec\nKept the eye in the text\nMake 'em see my eye in the Lex\nGiving my blood sweat and iron injecting selecting the soul\nCause mind body and soul can't be reinstalled\nSpecial with the flow to make Niagara fall\nIt's over for the systematic rapping robotics\nCrashing my logic\nThese niggas hooked on hooks and Hooked on Phonics\nWith hooked on phonics the pot could get em hooked on chronic\nCause pain conditions from the page conditions\nRacing like Sonic inhaling the tonic\nThey couldn't grade my brain in a college\nThemes behind it rob you for ya mind like thieves is behind it\nSo we had to squeeze in knowledge\nTo pile it when the green sees wallet\nAnything to let the green seize wallet\nTaking forever and a century with sentence speeds\nLike a penitentiary to build cell blocks to block your memory\nCatch me on the enemy's territory\nTelling terrorist story with a terror\nThe Era ends with a good night story\n\nDon't this shit make my people wanna jump?\nNo disrespect, ask my man for the pumps\nDon't this shit make my people wanna jump?", "image": "https://images.genius.com/ccc6b3e099d7f0a3416209e4a5d67fd0.1000x1000x1.jpg"}], "artist": "Joey Bada$$"}