{"songs": [{"title": "Live On The Mic", "album": "Tha Streetz Iz a Mutha", "year": "1999-11-16", "lyrics": "(Kurupt) (talking)\nYeah, this is what you would call somethin' like\nOne of the things that, you know, when you meet your goal\nYou get to the top of the game, and the dream come true\nKurupt and KRS-One freestyle\n\n(KRS-One)\nYes, yes y'all!\nYeah yeah y'all! (uh)\nKRS y'all, uh huh, uh huh (uh)\nYeah Kurupt, y'all\nTime to check it out, uh huh\nProphecy, y'all yes yes, yall (yea)\nKRS, y'all, uh huh, like this y'all (yea)\nYou know what's up comin' through like that! (haha!)\n\n(Verse 1) (KRS-One)\nI laugh at that, your whole premise is off\nI'm blastin' that, somehow my foot is exactly where yo ass is at\nAbusin' it, you know for 86 produce 77\nI'm doin' to you on the other hand still kind of new to it\nI spit lead into better men\nYou a veteran, ain't no tellin'\nWhat I send to get them yet another one\nMy voice-box send shocks of adrenaline so you sweat again\n(unintelligible)\n\n(Verse 2) (Kurupt)\nThen again I noticed that everybody\nThink they can fuck with us\nBut luckily I noticed\nEverybody want to be close to us\nTryin' to bust when they bust\nI seen them they ain't treacherous and they ain't fuckin with us\nMy style's out this universe\nWords that serve all these emcees\nThey hear pre-verbs I break them down to nouns and verbs\nThey know exactly what I do, I run through crew for crew\nKRS, it's on you, baby\n\n(Verse 3) (KRS-One)\nTrue underground, Boogey Down got them runnin' around\nComin' to town breakin' them all the way down\nAnd makin' them frown, true underground\nNot a class clown\nCopy, guilty ass, papi\nI roll with the mash out posse\nThe beatdown posse, terror squad, you'll find you was never hard\nWhen the clip loads, and I yell FLIP-MODE!\nMy faster, fresh blows, give my foes death blows\nThe best nose, goes live at breath shows\n\n(Verse 4) (Kurupt)\nSee I heard it before, word it before\nWorded it before, before, every emcee tried to serve it before\nBe Kurupt the raw dog hog servin' all y'all\nFuck around with us the top dog\nMurder all y'all, my minds incredible\nI'm out this mind state, lookin' at me, oh my goodness!\nWhat rhymes he creates!\n\"Is he the best?\", wonderin', nah, ain't no best\nIt's only me and KRS we dont need no vest, mothafucka\n\n(KRS-One)\nUh! like that!\nYeah uh huh! like that!\nUh! (we gangstafied Kurupt and KRS-One on the mic)\n(Yeah!)\n\n(Verse 5) (KRS-One)\nComin' through in the studio live, KRS-One, yeah I'm still on Jive\nBut I represent emcees now out in..\n\n(Verse 6) (Kurupt)\nYeah, no doubt\nI Be kurupt the raw dog and I'm droppin\nEvery emcee from here to Compton\nRaw dog, assassin when you see me comin' through, blastin\nDon't matter no harrassin, they won't lastin'\nThe last round, the last nigga knocked down\nProvocative sound, droppin' off round for round\nAnd pound for pound, I be from the Dogpound\nIt's me a Kris, nigga you can eat my dick\nI break them down so quick, you can't fuck with this\nThe lyricist poltergiest is way nice\nBreak and take them in freezers just like ice\nFuck around with me, O.G\nYo, we so precise\n\n(Verse 7) (KRS-One)\nYou know the teacher's agenda\nWe will be here forever\nYou plottin' to surrender\nAction start, you start -- tremor\nNever lose my temper, when my temple member\nYou know the center of the dope beat, remember\n\n(Kurupt)\nYea yea! haha!\nRaw dog assassin style\nKRS and kurupt!\n\n(KRS-One)\nYea yea y'all!\nUh huh!\nLike this, like this\n\n(Verse 8) (Kurupt)\nYeah we make them bounce\nI make them bounce\nWe make them bounce\nYo, I make them bounce\nYo, I blaze a ounce\nYeah, I blaze a ounce\nI'm gonna bounce to the ounce\nWhen the homies come through\nDogpound we surround like we bustin' at you\nI leave ya flat, homie\nYou wonderin, you lookin' back, homie\nI leave you all alone, in the danger zone\nLookin' at Kurupt and didn't notice it was on\nMy homeboy, slittin', spreadin', begin the spreadin'\nNiggas, who don't bust rhymes, niggas start beheadin'\nMe and Kris, we do it just like this\nLyricist, niggas can't FUCK with this\n\n(Verse 9) (KRS-One)\nThats right y'all\nYou heard what the man said\nKRS-One styles could never be dead\nThats why we still in-in the studio\nChillin' it's about three o'clock And we representin' real hip-hop\nNow you know what time it is we got the camera in our face\nKRS-One, all up in the fuckin' place\nYou know what time it is\nWe got to come back again\nI got my friend, I can't remember his name again\nBut I'm gonna keep flowin' gonna keep showin'\nRemember the skills that out the box\nWe be blowin', like that, yo Foxy you on the track\nCome and get some'a that pass it right back\nNow my man, Kurupt, on the mic like this\nNow come back and represent beside the Kris\n\n(Verse 10) (Kurupt)\nClap your hands, get it all together then\nSee me come through, me and Kris\nTougher than leather and every emcee who come through\nBe better than you, Claimin' they better than you\nBut we start severin' -- heads\nEverybody lookin' at me I flows from the head\nLeave them all dead, nigga, you heard what I said\nPunk ass niggas, don't realize the game\nDespisin' the game homeboy televisin' the game\nSeen the game, so im televisin the game\nSurprisin' the game, oh no, im risin the game\nThey shook down they took down, shook like clowns\nSee me rockin' I be rockin all around\nDon't you know it, oh yeah, the poltergiest poet\nThrow it, I show it, homeboy just don't blow it\nSit on the couch, with a joint in my mouth\nGettin' as high as can be, even though, they despisin' me\nRealizin' I be makin' more money than Spike Lee\nAnd that's my homie, O.G to me\nYo, Kris (Yeah?) we gonna do it like this\nDrop them down, quick, and they can eat a dick\n\n(KRS-One)\nBoogey Down, Boogey Down\nBoogey Down, Boogey Down\nBoogey Down production\nBoogey Down, Boogey Down\nBoogey Down, Boogey Down, ha-ha! ha-ha! (Byatch!)\nYo we out, dog (Bitch! gangsta life, me and KRS-One on the mic)\n\n(Dogs barking and howling)", "image": "https://images.genius.com/19827b73d665d135cdf903e8afe08997.1000x1000x1.jpg"}], "artist": "Kurupt"}