{"songs": [{"title": "That’s All I Have", "album": "No Ceilings", "year": "2009-10-31", "lyrics": "[Verse 1: Tyga]\nHa! Peek-a-boo, bitch! Swag scare your kids\nMy airplane clothes flyer than your bestest shit\nGorillas in the mist, pro-black: pump they fist\nI'm from the Planet of the Apes: King Kong clips\nSilence Lambs, bitch; run through your land trippin'\nCan't pretend when this is real as it gets, can ya?\nIf shit hits the fan, I Ron Artest niggas\nThis how I'm living: getting tatted in some house slippers\nI like my bitches simple: lay back, relax ya mental\nShit, you know what I do, tell me what you tryna get into\nThe man car's rented, the man car killing\nGossipping? Fuck the car! Look at the man in it!\nHa! Boys-to-man business, we don't hire bitches\nJust fire bitches: Young Money fire spitters\nThem red ants is with us and they ain't ate they dinner\nBegin the feast; feet lying, fatality finish\nI'm killin these records, they put me in Guinness\nI really don't give a fuck if you witness\nYou hear it, listen, buy it, steal it\nI'm still gonna get my fucking percentage\nI cuss a lot cause bitch I'm serious young no beard\nGet soup, like gumbo with shrimp\nFlyer than Dumbo ears is, bitch\n\n[Verse 2: Lil Wayne]\nUhh, now let me start by sayin' I don't like this beat\nBut I weather the storm, I'm a lightnin' streak\nUhh, Weezy F. Baby, I do it big: weigh me\nThem crazy freaky bitches tryna to Cirque du Soleil me\nGot some new bitches, trail got em' laughin'\nThe one that gave me head can suck the nail out a casket\nShotgun on the kitchen table, bullet shells in the cabinet\nFuckin' with me is like steppin' on the tail of a dragon\nWet pussy is my cabin, more bitches than a pageant\nI keep a house full nigga, call me Bob Saget\nSpendin' time backwards, hotter than a cactus\nAnd we ain't in the buildin', we the fuckin' contractors\nYM, muthafucka, why hate it?\nYoung Money down your throat, ya gotta stay hydrated\nQuarterback Weezy, young Tom Brady\nOpen up ya mouth, and catch a bomb baby\nGood morning, dude, Eagle Street corner, Tune\nLong dough, no short bread, no Lorna Doone\nI'm warnin' you: we on the move\nBunch of female dogs and garden tools\nThat's bitches and hoes, hospital full, sick of my flow\nHip-hop was washed up so I brought some change to finish my load\nI load millions and more millions\nMoney to the ceilings? Nigga, NO CEILINGS!\n\n[Verse 3: Shanell]\nStep up in this bitch, 5 o'clock in the morning\nThe world is waking up, you can hear the pigeons yawning\nI'mma get that worm now, tell 'em it's my turn now\nY'all niggas need a lesson on some ethic; you gon' learn now\nI do this for the love of it; saliva, cause I love to spit\nAnd I juke it; for my future records, y'all gon' love to spin\nFucking with my brethren, 10 years strong\nAnd he put them dreads in: Silver John Long\nBut he's more like platinum; hold up, here's a napkin\nPick your jaw up off the floor and tuck your tongue right back in\nTell me, where is Mack Maine? ...That's all I have", "image": "https://images.genius.com/4a183c010cf184b2a9fecdfcb8e16142.320x320x1.jpg"}], "artist": "Lil Wayne"}