{"songs": [{"title": "Supreme (Remix)", "album": "Mastermind", "year": "2014-08-12", "lyrics": "[Intro:]\nFirst of all, understand that she's a master at what she does\nAnd the fact that she's a master of what she does\nAnd the fact that she also has a master's degree\nAnd is mastered the ins and outs of this business\nThe fact that she's doing all of that and giving me brain at the same time\nIs just to let you understand Mastermind\n\n[Verse 1: Fabolous]\nIs that your soulmate or your cellmate?\nDo you fuck with him or you stuck with him?\nWhat's a real nigga who ain't being real with ya?\nWhat's a downass bitch that ain't still with ya?\nThat's a shame Keanan, Ivory Wayans\nPut your best shades on, look what I became\nHad to Allen I the game in my own shoes\nI be steppin' over niggas, Tyrone Lou's\nOohs\nFrom the real, that's the only crowd I hear\nSmoke kush, drink Ciroc, and I call it loud and clear\nHermes outer wear, all gold Audemar\nTom Ford high-tops like you niggas where?\nThem shit's beautiful, what is it? Velvet?\nI fucked your bitch Froggy Style, word to Melvin\nBaby boy shit, you on some maybe boy shit\nLike you got it now, but it maybe your boys shit\nSix, seven, Rolls Royces, maybe it's Floyd shit\nYour bitch playin' games? I maybe the joy-stick\nSupreme baller like, that's all I like\nStraight to the source for the J's, I got all the mics\n\n[Hook: Keith Sweat]\nTell me it's real\nTell me this is real, baby\nHow does it feel?\nHow does it feel?\n\n[Verse 2: Ma$e]\nI'm rap prominent, rap dominent, rap opulence\nFirst cat to take rap across the continent\nI get ya whacked for a stack, it's a G thing\nThen throw a rack and a crack it's a G string\nCash few hundred, clack, who want it?\nBag of blue hundreds, dash 200\nDash 250, endless speed nigga\nOr you near-sighted? You can't see me nigga\nI'm a different speed, different league, different breed\nHit different hoes so you die from a different disease\nDopest of the illest, illest of the dopest\nFold a 2 million dollar check infront of my loafers\nYou get to Heaven you go ask Biggie 'bout me\nClosest thing I'm rich Porter speeding in the Audi\nHot tamale, get the hoes hot without the Molly\nHoppin' out the 'Rari, bodies in the lobby\nLlamas like the Dali\n\n[Hook: Keith Sweat]\n\n[Verse 3: Rick Ross]\nChickens in the kitchen, bitches on the terrace\nNever interference, praying for your parents\nSee me when you see me in the BM look like Erick Sermon\nThe most beautiful thing is I'm high as Keith Murray\nMobb Deep shook ones, know they never think about it\nGlock 5, G6, take the (?) with the single pilot\nNew money, all I see is blue money\nIn Orlando projects new coupe money\nPipe dream, melting shorty ice cream\nTip change with the boss, you will like things\nTop 3, who can top me?\nDead or alive, been that nigga, ask Foxxy!\nI'm in paradise with a pair of dice\nLet's get this money, mastermind, savage life\n50 mil, is it really real?\nWe the hottest niggas, so fuck how you feel\n\n[Hook: Keith Sweat]\n\n[Verse 4: Big KRIT]\nI came a long way from country bumpkin, now I'm with the foreign\nPop top momma, even if it's snowin'\nGot a bad bitch that love to suck and fuck me till I'm snorin'\nRelate to bank tellers, counting money is never borin'\nOver lobster, steak, shrimp and pasta on my plate\nDash on they ass, never prison on the break\nI was doin' what it takes just to make a mil\nBut niggas smile more than ever just to show the grill\n(Invisible set) the set\nDon't make a nigga have to flex, blow a check\nNaw motherfucker, that's a threat\n(Hit the lot) Buy it all, VIPin' with ya broad\nAin’t no service, where she twerkin', make it kinda hard to call\nWe was in it, (my) Beemer whips\n(No fruits and veggies) she was ready\nMy debonairness gets her the wettest\nCause nobody\nCan do it like I does it\nBust a band, pop a trunk, sub thumpin' out in public\nIs this real?\n\n[Hook: Keith Sweat]\n\n[Outro:]\nBlack bottles\nBlack bottles\nBlack bottles\nI need a black model\nBlack bottles", "image": "https://images.rapgenius.com/40cdce8ce15a338867b0c19b0830a18b.600x600x1.jpg"}], "artist": "Rick Ross"}