{"songs": [{"title": "Stars", "album": "Welcome to Strangeland", "year": "2011-11-08", "lyrics": "[Intro]\n(You know that there are billions of stars in the universe)\nBut the star had quite a difficult time shining amongst all the other stars\nThe year was 1994 when the star began his descent\nAnd continued falling.. And falling...\nLanding in an unknown place\nThe star creates followers from underground rap\nOn the quest to shoot beyond the stars once again\nThe star begins in Strangeland\n\n[Verse 1: Tech N9ne]\nGround zero, crowned hero\nBut ain't nobody ever heard the sound before\nI found me so\nCompetitive, I never get the credit back at it when it was clown and LeJo\nNow we pro, the brown people\nWas on it for the moment but they frowned at me fo'\nLayin' what I was sayin' didn't sound negro\nNow people 'round me low down when the beat go\nNever will I ever stop or quit what I'm doing\nI'm getting better, even clever, rockin' it then I ruin every competitor\nWe at 'em poppin' shit, I be chewin' 'em up ahead of ya, etcetera the\nSpeed bandits coming for ya, now he's making an industry sandwich\nCome enjoy the flow, we're takin' them in to see damage\nGunnin' boy, you know we shaking the finicky planet, we've landed\n\n[Hook: Krizz Kaliko]\nWe've landed! The stars have fallen from the heavens!\nThe thoughts will reign on this planet!\nThe arts been painted on the canvas, you're helpless!\nWe've landed! The arms of fans have been branded!\nThe dawn of 6's and 7's! It's the start of musical madness!\nWe've landed!\n\n[Verse 2: Tech N9ne]\nShootin' for the stars, lootin' for the cause\nWho's inducin' puke and hootin' for the bars?\nYou get stupid groups of loose and juicin'\nYou for true, but you recruit the youth ignore bizarre niggas\nBut ain't nobody fuckin' with any of our niggas\nAnd if you trippin' under the Tecca there are millas\nYou don't wanna fuck with a murderous gorilla\nWar 'till the lord hit a scar, nigga, what?\nBitch I'm at the bottom and I'm comin' to get at ya\nBetter get up in ya column\nAnd I'm gonna diminish you, when I spit I really got 'em\nRight in front of me timid, and I want a percentage\nCause I fought for everything I got, it was not handed\nAnd nobody fed a nigga nothin' when I was famished\nI'm bussin' for life and not for Nathan, but God damnit!\nNotice something beautiful just landed\n\n[Hook: Krizz Kaliko]\nWe've landed! The stars have fallen from the heavens!\nThe thoughts will reign on this planet!\nThe arts been painted on the canvas, you're helpless!\nWe've landed! The arms of fans have been branded!\nThe dawn of 6's and 7's! It's the start of musical madness!\nWe've landed!\n\n[Verse 3: Tech N9ne]\nI've landed six feet under six feet\nThe area where ordinary people can't sleep\nThe badness, we had this back in high school classes\nYou're dealing with three faces of madness\nNever been average with the image of a savage\nAt the very bottom I'm livin' under the maggots\nBut I'm 'bout to shoot up and really wake up the masses\nGas it and blast and have the upper class rackin' ashes\nUpper class rappers, sucker ass packers\nRougher tougher motherfucker spaz backwards\nKcuf Natas, gutter mad slacker\nTecca Nina's what their lads after\nEverybody I wanna say, \"What goes up?\"\nVertically movin', I know it's 'bout to blow up\nThinkin' when I hit the stars I'mma slow up? Hold up\n\n[Hook: Krizz Kaliko]\nWe've landed! The stars have fallen from the heavens!\nThe thoughts will reign on this planet!\nThe arts been painted on the canvas, you're helpless!\nWe've landed! The arms of fans have been branded!\nThe dawn of 6's and 7's! It's the start of musical madness!\nWe've landed!\n\n[Outro]\nWhere am I? (You don't know where you are?)\nNo, I don't.. (You're in Strangeland)\nWow, how did I get here? (Well, that's simple, Mr. Yates)\n(You're the creator)", "image": "https://images.genius.com/4392f3223b9e5965e7f76dc529941352.1000x1000x1.jpg"}], "artist": "Tech N9ne"}