{"songs": [{"title": "Shit Popped Off", "album": null, "year": "2009-02-20", "lyrics": "[Hook]\nSee a party ain't a party til the Doc walk in it\nIt's hard to get it started til I hopped off in it\nThen it got so crunk one minute\nSince you didn't get to witness, just listen\nI came in hot, and then I saw\nAs soon as I arrived then the shit popped off\nThe shit popped off\nIt's officially a gangsta party\nYou can leave, man she came to party\nThen the shit popped off (Alright)\nThe shit popped off (Alright)\nThe shit popped off (Alright)\nSaid the shit popped off\nNiggas hands in the air, bitches takin' tops off\nPut the chronic in the air, and the shit popped off\nThe shit popped off\n\n[Verse 1: T.I. as Dr. Dre]\nLate California night, out chillin' I'm\nBout to fall up in the club we just killin time\nDro blowin', on Patron with a hint of lime\n6-4 to the front door with top down\nHit the switches, the ignition, then hopped out\nCrew walked in, shut the whole block down\nNow, hit the door like \"God damn\nHey is a party, ain't it? Man I don't understand\nWhy bitches over here, and niggas over there\nThe atmosphere so square, people so scared\nTo get up off the wall, and get up off they ass\nTo walk up on a broad, and get up on her ass\"\nI commandeer the turntable, that's my first mission\nBecause the DJ ain't spinnin' he bullshittin'\nGo from California Love into Doggystyle\nBought out the bar hours, pulled out the starter now\n\n[Hook]\n\n[Verse 2: T.I.]\nAt the crib in L.A. when the phone ring\nPick it up, it's Dr. Dre, sayin' \"It's on king\"\nI was on Hen, she was on lean\nShe was on gin, they all on the beam\nBroads talkin' loud, and all talkin' bout\n\"We tired of sittin' in the house, when we going out?\"\n\"Hey, shut the fuck up for a second, where you at Dre?\nText the address to me homie I'll be on the the way\"\nI make my way to the closet just for a second\nPrepare myself to step into the party for a second\nCheck it, AKOO hoodie, blue denim, gray fitted cap\nLouis rag, hit the stash, grab 50 stacks\nI tell them bitches come on, get in the Maybach\n57S headed straight to where Dre at\nWe pulled up to the spot lookin' like whoa\nLine wrapped around the corner to the light pole\nLatin chicks, black broads, couple white hoes\nWho knows where the night might go, hit the door like\nYeah, blinded by the glare of the strobe light\nSee something I like, it's going down on sight\n\n[Hook]", "image": "https://images.genius.com/bf3badae49c33b583126057638078bd8.576x576x1.jpg"}], "artist": "Dr. Dre"}