{"songs": [{"title": "Volume", "album": "The State vs. Radric Davis", "year": "2009-12-08", "lyrics": "I'm so motherfuckin' turned up right now\nSomeone please turn Gucci Mane down\nBrick Squad thugged out, we don't give a fuck\nWe hit the club, shoot the club, tear the club up\nSo you should hit the floor. Get low and shut up\nHit the floor, get low and shut the fuck up\nYou's a bitch, you's a snitch, you a motherfuckin' scrub\n\n[Verse 1 - Gucci Mane]\nI pulled up in a 4-door Porsche, set-trippin'\n3 young dreadhead niggas riding with me\nI don't think they like me and I don't like em neither\nBut if they move wrong, I'll red up their white beater\nI do it for the hood, I do it like no equal\nI do it for the red, black, yellow, white people\nI just bought a K, just the other day\nAnd I don't play with grown men: I don't like to play\nI'm so motherfuckin' turned up right now\nNiggas hang on me, I don't give a fuck right now\nWell you niggas keep on trying like the little engine that could\nYou think you can, you think you could, I think you pussies should\n\n[Hook]\n\n[Verse 2 - Gucci Mane]\nCall me Gucci Flocka Flame, I dun changed my name\nCall me Frenchie Mane La Flare, Gucc' the Kid..it's all the same\nI be running, gunning, stunting with 100 killers riding\nYou snitching, bitching, tattle-telling, scared to stand beside me\nI just bought another house just to house my goons\nSo Icey Entertainment, boy, we just like a platoon\nThe colors in my chain remind me of a cartoon\nI'll murk your boy in March, they didn't find that boy til June\nI wish they found him August so that's like \"too much too soon\"\nHis face was swoll and puffy, bout the color of a prune\nBrick Squad Movement and, no, you're not apart of it\nMe, Waka and Wu, Juice and Frenchie Mane started it\n\n[Hook]\n\n[Verse 3 - Wu the Kid]\nIced out bar got me ballin' like the Lakers\nHomicide around the corner. Where you, in Jamaica?\nMy volume on max, you boys better run\nI'm a Nigga With an Attitude holding on the gun\n17 niggas, I left 16 hit\nLast nigga hit the corner, got his whole head split\nTold you you're a goner, I'mma leave you dead quick\nI'm like Wu the Kid, thugged out, we don't give a fuck\nLet your soul meet the sole of the bottom of my Chucks\nBlack car, black tint with the baby tags\nStay low to the floor, my midget out the bag", "image": "https://images.genius.com/b1d579f919289c4a4498c5418f46bf1c.450x450x1.jpg"}], "artist": "Gucci Mane"}