{"songs": [{"title": "Hold Down the Block", "album": "Hip Hop Is Dead", "year": "2006-12-19", "lyrics": "[Chorus: Mark B. Mayfield]\nI gotta hold down the block, when the block is hot\nI gotta use my imagination to change the situation\nI gotta hold down the block, when the block is hot\nI gotta use my imagination to change the situation\n\n[Verse 1: Nas (Mark B. Mayfield)]\nYeah, Feds feast on street dons, look at their teeth showin'\nSalivating at the mouth, South to East Orange\nKeep pourin' that liquor, but nigga don't sleep on it\nYou'll be giving up your Jesus piece to your peeps to pawn it\nFor legal fees in the penal dorm\nScreamin' on the horn with 'bout 30 years on your conscience\nI'm watchin' brothers disappear, it's appallin'\nSome dudes had just only a year of ballin'\nCounter-intelligence found a strange evidence\n(When the block is hot)\nStill we behind the wheel with heat on us, hangin' with predicates\nPosition we placed in caves in, so they got us caged in\nWaves spinnin' like Mike Bivens from New Edition agin'\n(I gotta... when the block is hot)\nI got families I'm feedin', 'cause my mans is bleedin'\nEvery five seconds look in all directions\nI come through prepared, I give 'em a call\n\"I'm close, bring them guns downstairs\"\n\n[Chorus: Mark B. Mayfield (Nas)]\nI gotta hold down the block, when the block is hot\nI gotta use my imagination to change the situation\nI gotta hold down the block, when the block is hot (hold it down)\nI gotta use my imagination to change the situation\n\n[Verse 2: Nas (Mark B. Mayfield)]\nUh, uh, it's beef week, Monday, murder\nTwo niggas dead, Tuesday\nWednesday and Thursday is hearse-day\nFriday, somebody-gotta-die day\nSaturday, put the gat away\nChillin' with your chick and a bag of haze\nWonderin' how it's all gon' end and what type of way\n'Cause Sunday back to gunplay\nMost shit start over nothin'\nAnd get finished quick ‘cause the art of repercussion\nYeah, I seen it, a G going out indecent (when the block is hot)\nTakin' a plea agreement, thinkin' he secret\nEscape the crime scene, now you live straight like 9:15\nThen one-time intervene (I gotta hold...)\nMy man ain't like me sayin' I don't care if I die\nBut the SIG Sauer on me now I'm scared to die\nYou thinkin' the one I send to clap you be a shorty\nBut he old school, holdin' a .38, he in his 40s\n\n[Chorus: Mark B. Mayfield (Nas)]\nI gotta hold down the block when the block is hot\nI gotta use my imagination to change the situation\nI gotta hold down the block, when the block is hot (yeah, word to mother)\nI gotta use my imagination, to change the situation (yeah)\n\n[Verse 3: Nas (Mark B. Mayfield)]\n(I gotta...) Anytime brothers can't get jobs, then they rob\nA man rather die than live on his knees and starve\nCops steady askin' your man what happened\nFirst he tell, then he stop, like he not really rattin'\nGuess he not really in that casket from a sawed-off\n(When the block is hot)\nListen, peep game from the brain of an all-star\nThe rain hurt niggas' bones who been shot\nMetal pins in their leg, they walk with a limp-hop\nThe streets lie (when the block is hot), so you better be cautious\nYour man'll fry you plus everybody talkin'\nA vet, a General, don't step where I walked in\nMake your own path, be a legend in your skin\n(Hold down the block, when the block is hot)\nMake your own cash, don't stress what I'm flossin'\nDon't expect more when you put in less work than all them\nQueensbridge projects has taught him\nAnd that's for life, you heard me right, I got the block\n\n[Outro: Mark B. Mayfield]\nWhen the block is hot, when the block is hot\nI gotta use my imagination to change the situation\nI gotta hold down the block, when the block is hot\nI gotta use my imagination to change the situation\nI gotta hold down the block, when the block is hot\nI gotta use my imagination to change the situation", "image": "https://images.genius.com/ff6738f83747060eafd4a7af4964cd8f.1000x1000x1.jpg"}], "artist": "Nas"}