{"songs": [{"title": "Even If", "album": "Nutty Professor II: The Klumps (Soundtrack)", "year": null, "lyrics": "[Intro: Method Man]\nYo, c’mon!\n\n[Verse 1: Method Man]\nEven if I died a thousand deaths, when I resurrect\nI’ll still be Meth, the jams will still be def\nI’m here, me and this mic-phone, we here\nAnd ain’t tryin’ to hear nothin’ cuz we had it up to here\nLyrics have no dress code, from KRS to Depeche Mode\nKid I’m so cool you catch cold\nAt the jump off, it’s about to jump off\nMy niggas speak with they hands or the gun talk\nYo RZA, we got the Clan in the front and police\nAt the door, every exit is laced with C-4\nAbout to blow, life trial I’m passed out\nMC’s is like bitches in thongs – they assed out\nBut me, the M-E-T-H- the O-D\nJust too real, I can’t be touched and can’t feel\nThe monotony in rap, take a picture of my nut sack\nCarbon copy that and send your crew a fax, motherfucker\n\n[Chorus: Method Man, (Streetlife)]\nNew and improved Wu-Tang style\nTurn it up now, y’all done fucked up now\n(Spit flames) Five mics (Peep game) On site\n(Bring the pain) All night (Off the chain) Damn right!\n\n[Scratches: DJ Ty Boogie]\n“It’s the Method Man, for short Mr. Meth”\n“Tical-lion, hmm”\n\n[Interlude: Method Man]\nYo, yo, yo, yo, yo, yo, c’mon!\n\n[Verse 2: Method Man]\nEven if I died a thousand deaths, when I resurrect\nThrough my first born, my name lives on\nMy words is like a third degree to young emcees\nBuzzworthy on your MTV, the Killa Bees\nJohn Jacob, straight up, break up, schemes and plots\nAce up my sleeve, bake up pies in pots\nSo this is what it’s come to (Huh?)\nLickin’ shots at them kids that used to punk you (Huh?)\nRepetitious rap shit, don’t get no air play in my whip\nAnd niggas can’t smoke wit’ dry lips so chapped\nBite my shit, I’m like Kojack to get my flow back\nIn fo’ flat, I track you down like a low jack\nSpy verse spy, eye for an eye can I\nPenalize the uncivilized, make ’em civilized\nYou know right from wrong, so know I’m the bomb\nWho don’t beef for beats, see the tracks on my arm, motherfucker\n\n[Chorus: Method Man, (Streetlife)]\nNew and improved Wu-Tang style\nTurn it up now, y’all done fucked up now\n(Spit flames) Five mics (Peep game) On site\n(Bring the pain) All night (Off the chain) Damn right!\n\n[Scratches: DJ Ty Boogie]\n“It’s the Method Man, for short Mr. Meth”\n“Tical-lion, hmm”\n\n[Outro: Method Man & DJ Ty Boogie]\nYo, yo, yo, yo, yo, yo, c’mon!\n“It’s the Method Man, for short Mr. Meth”\n“Tical-lion, hmm”\n“It’s the Method Man, for short Mr. Meth”\n“Tical-lion, hmm”\n“It’s the Method Man, for short Mr. Meth”\n“Tical-lion, hmm”\nYo, yo, yo, yo, yo, yo, c’mon!", "image": "https://images.genius.com/9b1fb927772cba11d5bea2fa1b51e497.600x600x1.jpg"}], "artist": "Method Man"}