{"songs": [{"title": "Momma Taught Me", "album": "The Dedication", "year": "2005-12-13", "lyrics": "Momma gave me the swag, I walk like the President\nTalk about only dead presidents and big settlements\nYes I have faith in the flag, yep I'm a citizen\nI'm repping for my city that is bad as the city is\nMomma ain't teach me no better but to get this cheddar\nAnd that I do and for it I get at you\nI consider you all fools, you niggas is hilarious\nYoung Money bitches don't wanna fuck us, they wanna marry us\nNow ain't that some shit\nI can't have one bitch but I just got one dick and no\nI ain't fucking with the fake\nI load my hand gun with hand towels just to touch a nigga face\nI am something like a safe, I will never crack\nAin't no combination, nigga never that\nIf a nigga ever said anything about Weezy and meant it\nHe gone get it that same evening, Pimpin'\nBackseat riding like I'm Mr. Daisy, I am Weezy F Baby, don't miss the Baby\nI kiss the lady on her hand, I'm a fly young man, check my wingspan\nThis year I probably do everything tan buy a crib on the sand\nGotta float to the land but don't get it twisted I still die for me\nAnd do a bid for my man, keep it real as I can\nCuz I'm strong, strong with a will and a plan\nWhere there's a will there's a way so make way for the fam\nYoung Money, I yell it 'til they come for me, come get me\nI bet I'll take more than one with me\nI know it don't take more than one shot\nAnd for that reason, I'm going to shoot more than one shot\nI be clicking when the gun stop, I make the body hot\nThen spit on it when the body drop\nI get on it like a pot of crack\nI get at your bitch, then I tell her like a rapper \"holla back!\"\nI'm still asking, where the dollars at?\nI will smash you if you got 'em Jack, I'll peel faster\nThe lil' bastard in the Maybach\nA young nigga, I still think saving is wack\nI eat, sleep, shit, and bathe with my gat\nI'm like, fuck pimping slaving is back\nThey like, \"Yes Master, You're the best Master\"\nMy hoes need me, I'm like test answers\nYou don't need me, you might catch cancer\nCome back from treatment looking like Van Exel\nNo, I don't like bald head hoes\nI like a long haired diva with the boss ass goals\nI'm a all day pleaser, your boy can't go\nHe too proud, I go where your boy can't go, oh\nNasty ass lil' boy, put my feet up on the dash, pass the the grass\nEnjoy, get the coke up off the glass, get the money out the drawers\nGet the weed out the jars and we do it like stars!\n\nHaha\nWeezy F Baby\nYea\n\n(DJ Drama talking)", "image": "https://images.genius.com/d5aa064a83b316efd87b4aed4c2a27be.941x938x1.jpg"}], "artist": "Lil Wayne"}