{"songs": [{"title": "One Day Closer", "album": "Deeply Rooted: The Lost Files ", "year": "2017-12-15", "lyrics": "[Verse 1]\nMy mama told me find a real job, ‘cause I’m what I’m doing don’t cut it\nSay she never seen a nigga get rich struggling and shit\nJust fussing and I ain’t trying to hear that\nLeaving out the house, I peep the news and it’s clear that\nIf mama woulda said a few words to them damn fools\nYou wouldn’t have them killers in the classroom\nThe destructor of the innocent\nPraises be to God the beneficent\nMost merciful, and I would never question you\nBut babies being shot down’ll hurt a dude\nI know the devil’s got her heels on\nBut as I walk through the valley, I just feel home\nAnd life has got a funny way of testing\nA man of faith but all in all it’s a blessing\nTo walk up out the storm without a scratch on me\nAnd live to talk about my journey—where you at, homie?\n\n[Chorus]\nSam was born by the river; Martin, he had a dream\nBut that don’t mean there will be harmony\nJust because the choir sings\nThey say that change gon’ come\nSo when is change gon’ come?\nSomebody tell me; somebody tell me\n\n[Verse 2]\nI’m not gon’ lie, I’m getting scared now\nI started burying my classmates\nI remember skipping classes in the 8th grade\nAnd walking to the Burger King at lunchtime\nAnd coming back before the bell rung, but one time\nWe decided we was finna ditch the whole day\nAnd catch the metro to Sharpstown, I’ll always\nRemember Kurtis beatboxing on the back seat\nMe freestyling, they knew every rapper that he\nBring up to us, K run through us\nMan, I miss them old days, if one knew us\nYou knew that we was destined for greatness\nFather’s Day came, that’s when God set to take him\nToo many dying young, no sequel\nAnd I have gone a many night sleepless\nEvery page turned brings the ending\nOne day closer, it’s on you on how you spend it\n\n[Chorus]\nSam was born by the river, and Martin, he had a dream\nBut that don’t mean there will be harmony\nJust because the choir sings\nThey say that change gon’ come (Change gon’ come)\nSo when is change gon’ come? (When is change gon’ come?)\nSomebody tell me; somebody tell me\n\n[Verse 3]\nAnd every day it’s something different\nIt’s either politics or one’s religion (Yeah, yeah)\nWe need to keep our guns in my opinion\nIt’s the people that you need to take control of\nYou have the right to bear your arms what they told us\nIt’s tragic when an innocent is gunned down\nBut Congress wants to take away our guns? Wow!\nNow, what about off in Chicago?\nHuh? Them little children in Chicago\nParents heart-broke; I pray I never know that feeling\nAnd although the truth is so revealing\nWe push it to the side like we don’t matter\nAnd that shit makes me madder\nThat’s right, my government Brad Jordan\nNo different than a Trayvon Martin\nNo different than a shot down leader\nYour picture of a blue-eyed Jesus", "image": "https://images.genius.com/0a8834d350e698012cc58bd228f90719.1000x1000x1.jpg"}], "artist": "Scarface"}