{"songs": [{"title": "Loyal to the Game (G-Unit Remix)", "album": "Loyal to the Game", "year": "2004-12-12", "lyrics": "[Intro: 2Pac] I'm loyal to the game\n\n[Verse 1: 2Pac]\nNow I've got task on a nigga's ass\nTell me will they blast me\nI think of an alias in case these crooked bitches ask me, now\nIt's gettin' crazy after dark\nThese narcs be like tryin' to shut me down but I'm too smart\nNow picture me scared of the penetentiary\nI've been movin' these things since the days of elementary\nNow tell me what ya need when ya see me\nI'm stackin' G's buyin' all the things on TV, believe me\nI got some killas on my payroll and they know\nWhen it's time to handle business nigga lay low\nAlthough I'm young I'm still comin up\nI'm gettin' paid pullin' razors on niggas when they runnin' up\nThe first to pull the strap when there's drama\nBuster you ain't heard?\nI been slicin' motherfuckers since I lost my mama\nThere ain't a cop that can stop me\nMy posse is cocky and they don't wait until they drop me\nI'm loyal to the game\n\n[Chorus: 50 Cent (2Pac)]\nI do my thing respect my hustle I ain't playin'\n(Nigga I'm loyal to the game)\nYou get in my way and I cock and pop that thing\n(Man I'm loyal to the game)\nIf you know what I know then you know I ain't playin'\n(I'm loyal to the game)\nNigga get in my way and I'll blow out your brain\n\n[Verse 2: Young Buck]\nPossessed by the streets you can't tell me that this ain't home\nI can't eat if the rest of this shit ain't gone\nI'm gettin' used to the needles on the bathroom sink\nGotta close my door because the bathroom stink\nSee, daddy don't work, and mama don't drink\nBut daddy do dope, and mama can't think\nSo look like I'mma be the man of the house\nGotta have somethin' to put in the air when it's out\nUp early in the mornin' the first to get it\nThey say if you really want it then come on with it\nSacrifice my life for this ice and these cars\nAnd I only spent 30 days behind bars\nI ain't never had a job but my rent got paid\nI handled any beef that they sent my way\nSo send me to the pen but you know I won't change\nIt's thug in my veins\nI'm loyal to the game\n\n[Chorus: 50 Cent (2Pac)]\nI do my thing respect my hustle I ain't playin'\n(Nigga I'm loyal to the game)\nYou get in my way and I cock and pop that thing\n(Man I'm loyal to the game)\nIf you know what I know then you know I ain't playin'\n(I'm loyal to the game)\nNigga get in my way and I'll blow out your brain\n\n[Verse 3: Lloyd Banks]\nYeah\nIt ain't my fault I came up fast\nAnd your the name niggas bring up last\nAnd all the dames get a king up ass\n10 grand on every ring I flash\nLeap frog--and I'mma have to fling your ass\nI'm on the block where it's scorchin' hot\nIf you get caught in the crossfire they have to throw you off the block\nI get 'dro by the pickle jar\nThese broke niggas wanna get the star\nSo I don't keep the four-nickel far\nMy lips is zipped I'm loyal to the game\nBring your bitch around me I'm spoilin' her brain\nGet more slugs to boil in your frame\nCause you got rocks and they got aluminum foil for a chain\nThe paint's the same color as oil in the Range\nI'm stingy ain't got nothin' for you but some change\nI'm good now but the fact still remains\nThat the struggle that I'm from is attached to my name\n\n[Chorus: 50 Cent (2Pac)]\nI do my thing respect my hustle I ain't playin'\n(Nigga I'm loyal to the game)\nYou get in my way and I cock and pop that thing\n(Man I'm loyal to the game)\nIf you know what I know then you know I ain't playin'\n(I'm loyal to the game)\nNigga get in my way and I'll blow out your brain\n\n[Outro: G-Unit & 2Pac]\nHeh\nYA!\n2Pac's in this motherfucker!\nUh!\nG-Unit in the motherfuckin' house\n50!\nBanks!\nBuck!", "image": "https://images.genius.com/aff64f752ccfff1d48590e5db3c0357a.300x300x1.jpg"}], "artist": "2Pac"}