{"songs": [{"title": "Hit Em Up", "album": "Who You Mad At? Me Or Yourself?", "year": "2013-04-18", "lyrics": "[Verse 1]\nGunpowder on my fingertips\nCocaine between my fingernails\nLook, mama, what Schoolboy brought to Show & Tell\nAin't got no vest, protected by these shells\nKill or be killed, lift up souls, we raising Hell\nUngh - two for his back bring failure to his lungs\nYAWK-YAWK-knock-knock your bell been rung\nMight burn your heart, this pistol'll fill your tum'\nUngh... ungh... dope dealer, dope nigga\nGot the stash in the rental takin' blunts to the mental\nFuck y'all, go get 'em - bang 'em all\nBall and ball, money tall, Pau Gasol, want it all\nI want that crib and I want that yard\nI want that broad and I want that car\nI'll pull your card for frontin' like you hard\nYou be in deep shit from this pistol...\nHis heart racing, my heart's not\nShift his top, hold that thought\nWave my flag, bitch stop\nYou forgot, I hit 'em up... yeah\n\n[Hook]\nUngh... boy, I hit 'em up...\nUngh, motherfucker, I hit 'em up...\nUngh... I say, nigga, I hit 'em up..\n\n[Verse 2]\nThey come to me to learn shit they can't learn in church\nLike get him 'fore he get you first\nJump out with J-O-B, 'bout to put in work (work... yeah)\nHave a seat, this bullet pierce your shirt\nAin't nothing sweet, you'll see a star burst\nI keep orange laces in my Converse\nOff house arrest, now hear this converse\nI draw my pistol on my hip, you see that rubber grip\nDon't have a half a clue, them boxes for hollow tips\nI've got more Oxy than a pharmacy\nAlso, I keep action clips, when I move E\nYeah, I swear to God won't find a nigga like him\nI greet 'em, pop 'em, then I As-salamu alaykum 'em\nHeaven or Hell your only ultimatum\nHit a pussy for his lip ring, my niggas murder\nNo attempting - got blasted\n'Nother dropped on his ass, placed up in that body bag\nToe tag, I hit 'em up!\n\n[Hook]", "image": "https://images.genius.com/43cf4f7fb829f88b270853d2534b8f0f.1000x1000x1.jpg"}], "artist": "ScHoolboy Q"}