{"songs": [{"title": "Krazy", "album": "The Don Killuminati: The 7 Day Theory", "year": "1996-09-26", "lyrics": "[Intro: 2Pac]\nThrow me a cigarette, dawg!\nThey got me feelin' crazier than a motherfucker\nI got Bad Azz in this motherfucker\nMakaveli the Don, representin' the Outlawz\nBad Azz representin' the LBC Crew\nSo whatcha wanna do? Y'know how we do it\n\n[Chorus: 2Pac]\nPuffin' on loud\nHopin' that it gets me high\nGot a nigga goin' crazy\nOh yeah, I feel crazy\nTime goes by, puffin' on lye\nHopin' that it gets me high\nGot a nigga goin' crazy\nOh yeah, I feel crazy\n(Tell 'em about it!)\n\n[Verse 1: 2Pac]\nLast year was a hard one, but life goes on\nHold my head against the wall, learnin' right from wrong\nThey say my ghetto instrumental detrimental to kids\nAs if they can't see the misery in which they live\nBlame me for the outcome, ban my records – check it\nDon't have to bump this, but please respect it\nI took a minus and now the hard times are behind us\nTurned into a plus, now they stuck livin' blinded\nHennessy got me feelin' bad, time to stop drinkin'\nRollin' in my drop-top Jag, what's that cops thinkin'?\nSittin' in my car, watch the stars and smoke\nI came a long way, but still I got so far to go\nDear Mama, don't worry, I'ma watch for snakes\nTell Setchu that I love her, but it's hard today\nI got the letter that she sent me, and I cried for weeks\nThis what came out when I tried to speak – all I heard was…\n\n[Chorus: 2Pac]\nTime goes by, puffin' on lye\nHopin' that it gets me high\nGot a nigga goin' crazy\nI feel crazy\nTime goes by, puffin' on lye\nHopin' that it gets me high\nGot a nigga goin' crazy\nI feel crazy\n(One, two, three, four)\n\n[Verse 2: 2Pac]\nI see Bloods and Crips runnin' up the hill\nLookin' for a better wayyy\nMy brothers and sisters, it's time to bail\n‘Cause even thug niggas prayyy\nHopin' God hear me, I entered the game\nLook how much I changed\nI'm no longer innocent – casualties of fame\nMade a lot of money, seen a lot of places\nAnd I swear I seen a peaceful smile on my mama's face\nWhen I gave her the keys to her own house, this yo land\nYour only son done became a man\nWatchin' time fly, I love my people, do or die\nBut I wonder why we scared to let each other fly\nJune 1-6, '7-1, the day\nMama pushed me out her womb, told me, \"Nigga, get paid!\"\nNo one can understand me – the black sheep\nOutcasted from my family, now packin' heat\nI run the streets, a young runaway, live for today\nWhen he died, I could hear him say… (Thug Life, baby!)\n\n[Chorus: 2Pac]\nTime goes by, puffin' on lye\nHopin' that it gets me high\nGot a nigga goin' crazy\nI feel crazy\nTime goes by, puffin' on lye\nHopin' that it gets me high\nGot a nigga goin' crazy\nCrazy, crazy, crazy\nI feel crazy (crazy)\n\n[Verse 3: Bad Azz]\nGod, help me out here, ‘cause I'm possessed\nI need the root of all evil for my stress\n‘Cause money's like a strong prescription\nDrug, it's got me addicted\nTo the pleasure and the pain it inflicted\nSomethin' about the paper\nWith the pictures of the president's head\nDamn, it's like a motherfuckin' plague that spread\nIt's epidemic; forgotten, forgotten it got worse\nI keep my head on straight, makin' money ‘cause it's cursed\nMakin' money makes a difference day by day\nSo I gotta stay paid, no doubt, day in and day out\nThis life is like a vicious cycle called fightin' to live\nNo matter how hard you try, it's in death, you gotta die\nA lot of my peers didn't make it to the years to come\nDid life do 'em right or did life leave 'em dumb?\nWho has the answers? I wonder, I turn to my elders\nThey aged and experienced, but they can't even tell ya\nOr tell me, that there'll be light at the end of the road\n(Why?) ‘Cause they don't even know\nA million things run through my mind\nYou ain't gotta be in jail to be doin' time\n(You ain't gotta be in jail to be doin' time)\n\n[Chorus: 2Pac]\nTime goes by, puffin' on lye\nHopin' that it gets me high\nGot a nigga goin' crazy\nI feel crazy\nTime goes by, puffin' on lye\nHopin' that it gets me high\nGot a nigga goin' crazy\n\n[Collision: 2Pac]\nI feel fucked up in this bitch\nI smoked half a ounce to the head\nChocolate Thai, indo, Hawaiian, lambsbread, buddha\nAll that shit!\nI'm fucked up in this motherfucker\nAnd Hennessy don't help\nAnd Hennessy don't help\nThug Passion in this muh'fucker\nMakaveli the Don puttin' it down to the fullest\nMaximum overload\n3 Day Theory, Killuminati to your body\nWith the impact of a 12 gauge shotty\nDouble-I slugs, no love, straight thugs\n\n[Outro: 2Pac]\nOne time for my niggas in the jail cell\n(One time for my niggas locked up)\nOne time for my niggas doin' life in Hell\n(One time for my niggas and shit, one time)\nOne time for my niggas in the jail cell (One time)\nOne time for my niggas doin' life in Hell\n(One time for my niggas locked down)\nOne time for my niggas on the Death Row\n(One time for my niggas on the Row)\nFor my niggas on Death Row\nOne time for my niggas livin' broke\n(Westside, California style, L.A.)\nOne time for my niggas livin' broke\n(You know what time it is, no doubt)\nOne time for my niggas in the jail cell\n(Get high, puffin' on lye)\nWonder if it get me high, yeah", "image": "https://images.genius.com/de81f90d8bf5ccdc5b74c71182edc9d2.600x600x1.jpg"}], "artist": "2Pac"}