{"songs": [{"title": "Flaws and Sins", "album": "Death Race for Love", "year": "2019-03-08", "lyrics": "[Intro]\nVibe on this bitch, though\nA lighter\nNah, in the room\nOh\nUh-huh\n\n[Verse 1]\nYou work numbers, work wonders\nYou done woke me up from my eternal slumber\nI'm the lightning, you’re the thunder\nThere's a difference 'tween, \"I need you,\" and, \"I want you\"\nGirl, I need you\nGood sex led to conversations getting a little deeper, uh\nTell me your darkest secrets, shit you wouldn’t even tell Jesus, uh\nMy karma been tweaking so much, I don't even believe in karma\nBut you give me a reason to thank God for all these recent falls\nPercocet 30, he ate, all them getting off\nI done chilled out on the drugs since you've been involved\nSuck it like it's law, fuck me like it's law\nNo protection on my heart, God damnit, I'm gon' hit it raw\nTraumatized from my past, yeah, I keep a log\nIn my mind, in my head, where that shit belong\nThey say you after my bread, shit, I hope they wrong\nYou already ran up the bands, we could have a ball\nHit it from the back, humina, call a play, huddle up\nThis that good love in the bedroom\nFuck you in the Prada, poke her face like Lady Gaga\nRide it like a Mazda, zoom zoom zoom\n\n[Chorus]\nI'm all, I’m really all in\nIn love with all your flaws and sins\nYour scars are really gorgeous\nAin’t that a weird way to give compliments?\nI'm all I’m really all in\nI fell in love with all your flaws and sins\nYour scars are really gorgeous\nI see light in all the darkness\n\n[Verse 2]\nWhoa\n'Atta boy, I done turned to a man\nHot chills when my skin is on your skin\nHope that you know that if you ever try to end\nYou gon' catch a couple out the F&N\nThat mean Cupid ain't give you a headshot\nSo I ain’t got no choice but to leave you with a headshot\nLook at the way I make that fucking bed rock, uh\nWhere your ring finger at? I need wedlock\nGot my sights on your ass, ooh, red dot\nWe some bats that made it out of Hell, ooh, red hot\nDon't, ayy, go all night, bitch, don't stop\nWe ain't even gon' be finished 'til the sun's out\n\n[Chorus]\nI'm all, I'm really all in\nIn love with all your flaws and sins\nYour scars are really gorgeous\nAin't that a weird way of giving compliments?\nI'm all, I'm really all in\nIn love with all your flaws and sins\nYour scars are really gorgeous\nThat's my way of giving compliments\nI'm all, I'm really all in\nIn love with all your flaws and sins\nYour scars are really gorgeous\nAin't that a weird way to give compliments?\nI'm all, I'm really all in\nI fell in love with all your flaws and sins\nYour scars are really gorgeous\nI see light in all the darkness", "image": "https://images.genius.com/7b4c1752ee0b9e8c17d6c36d558560d4.1000x1000x1.jpg"}], "artist": "Juice WRLD"}