{"songs": [{"title": "Party Is Goin’ On Over Here", "album": "E.L.E. (Extinction Level Event): The Final World Front", "year": "1998-12-15", "lyrics": "[Verse 1]\nYo, ever since Jimmy Crack Corn\nCrackin' on ever since the day I was born\nYes we get busy whenever we have to perform\nShaking your tushy making your pussy get warm\nHa ha ha until all you niggas is gone\nI be hittin' until the morning got you callin' my storm\nBounce my niggas, bounce my bitches (Bounce baby!)\nWith the shit that do really have all you niggas going crazy\nSuffer from headrushes while niggas be smoking dutches\nBitches be gettin' all in and rippin' they pants crutches\nWiggle they belly buttons\nAy, wait a minute I wanna get all in it\nLong as my shorty with it\nYou know I'm comin' to get it\nDoin' it to you makin' you really wonder who said it\nSwelling your melon while you yellin'\nNow check out the credit\nGiving it to you makin' you gimme back more\n(Coming through too!)\nYes and we be kickin' down your door\nKeepin' it raw my nigga\n\n[Chorus]\nAll my bitches right in the front sayin' \"Aahh\"\nAll my bitches way in the rear sayin' \"Aahh\"\nParty is goin' on over here (Say what?)\nParty is goin' on over here (Say what?)\nAll my niggas right in the front sayin' \"Ho!\"\nAll my niggas right in the rear sayin' \"Ho!\"\nThe party is goin' on over here (Say what?)\nParty is goin' on over here (Say what?)\nAll my people up in the place sayin' \"Ho!\"\n\n[Verse 2]\nLet me just hear you some more\nTell me what you lookin' for\nTold all of y'all already I ain't gonna tell you no more\nHittin' you off makin' you niggas blast off!\nWith some shit that'll be tearing your ass off\nKeppin' it comin', keepin' it movin', keepin' you wylin'\nWe gettin' this paper let's keep the cheddar stacking and piling\nAnd now we happy and smiling cause now we living good\nDoin' it is how we be movin' it in the hood\nWishing you could fuck around with me and my niggas\nHow we double and wyle\nAnd double our bitches double our figures\nTurnin' you out\nRun from my niggas (No doubt!)\nKeepin' it blazing make all my bitches all shout\nThen I hit with the new make you take off your see-through\nWhile you peekin' around the corner baby I see you!\nTell me what you gon' do\nI'm sayin' now I'm gon' have you wylin' until your ass drop\nHit me off, yes now let me take it to the top\nWe never stop my nigga\n\n[Chorus]\nAll my bitches up in the front sayin' \"Aahh\"\nAll my bitches up in the rear sayin' \"Aahh\"\nParty is goin' on over here (Say what?)\nParty is goin' on over here (Say what?)\nAll my niggas up in the front sayin' \"Ho!\"\nAll my niggas up in the rear sayin' \"Ho!\"\nThe party is goin' on over here (Say what?)\nParty is goin' on over here (Say what?)\nAll my people up in the place sayin' \"Ho!\"", "image": "https://images.genius.com/9b46f032177a2aa9e2a3bec70d13c58d.1000x563x1.jpg"}], "artist": "Busta Rhymes"}