{"songs": [{"title": "Can’t Get Enough Of It", "album": "Hell On Earth", "year": "1996-11-19", "lyrics": "[Intro: Havoc]\nQBC\nAbout to take over, your area!\nYo\n\n[Verse 1: Havoc]\nLeft to right protect the life, guard my castle\nWhen goin' at you, take it to the gats if I have to\nIt's the hassle, jealous thugs I suppose squeeze\nTurn that ass to Swiss cheese, leave permanent holes\nAnd to them hoes, you know how it go, no dough\nCause they subject to wakin' with cash and go crazy\nYeah they bangin baby, Havoc representin' for them niggas\nThat don't trick, ladyless, just associates\nAppropriate, no doubt, but bust it\nI love this rap shit got me fillin' mad clips perhaps it's\nThem fake rappers, but they damn good actors\nFrom population, through the math I subtract them\nYou hear no laughter, QBC the thug factor\nYou niggas ain't worth the punch, back snatch ya\nPitbull attack ya, and half snap ya\nKodak moments I capture, like an escaped\nConvict, Pearl Harbor, bomb shit\nHandle B-I, on some calm shit\n\n[Verse 2: Illa Ghee]\nI can't get enough of it, the rough shit, grenade lyrics\nMy appearance is thug, rap slug ritual\nFor every dollar gotta nigga's blood chiseled, the slug sizzle\nPistol-whip tight, night monopoly\nFour 380's in the prophecy, the bigger I got\nHandle B-I, smoke a C-I, snuff a C-O\nCan't You See, I'm the Total, vocals is low blow\nBarely soldierable reinformed the man from Nahwan (Nahwan!)\nToe to toe complex the next expert, who's in control?\nEpisode, you can't control your fascination\nHell is the name, two guns that look the same\nFrame of thought change, first we live then we abort\nCloth Polo Sport, catch a nigga on his sports\nTalk back I'll leave ya jacked, rap format, I'm hostile\nWild out for snakeness equals foul\nGeneral G, blowin judges in the trial\n\n[Chorus: Prodigy (Havoc)]\nYo the NYC, M-O-B-B thug shit (and that's my shit!)\nI can't get enough of it\nEither fuck with it, or don't fuck with it\nCatch us in a middle of the crowd crazily bent\nWhen my cats attack you got your knot split, aiyyo\n\nI can't get enough of it\nEither fuck with it, or don't fuck with it\nCatch us in a middle of the crowd crazily bent\nWhen my cats attack you got your knot split\nWe out to win and that's it!\nWe out to win it like this!\n\n[Verse 3: Prodigy]\nIt's like this kid, aiyyo\nWe shut it down like the Muse and blast like fresh tecs\nOut the box, we outbox, get suplexed\nTake notes nigga, best check the index\nLook over anything that you might've missed\nYou overlooked the part with some unified terrorists\nPirates, straight off the ship, and mad starvin'\nAnchored to land and now we runnin wild poundin'\nOn imbecile niggas who ain't got they feet grounded\nPrecise, astonishin' shots split ya skin's top\nWe sent pops, catch you from two blocks\nDon't run up on you chargin', with hot shit, he felt it, alarmin'\nShockin', surprisin' shit, left you crawlin'\nDangerous, umm, and ready to rock\nThis man's hot, your flesh start to boilin' hot\nRhymes solid like a lead pipe, that bleeds your knot\nKnot headed niggas get knocked out a lot\nKick down your chain-locked door, we raise spot\nMy clique got a deadbolt lock, you rather not Duke\nStormin' through the crowd, hard to see, comin' through\n(Watch out, watch out, watch out, comin' through comin' through kid)\nSpill my over-proof is drippin' from my temple\nLay on the wall and watch all y'all\nYou can't injure a ninja who crept and took fall\nSurrounded by crime cats, time for tap jaws\nLeave red stains on clothes, carpets and floors\nWord up\n\n[Verse 4: Havoc]\nAiyyo we bang like the Tunnel and jam like broke gats\nOne hundred and oh, nigga go check the stats\nQB, yeah that name hold weight and ring bells\nAll you niggas Shook and It Ain't Hard To Tell\nMajor clientele, the Infamous cartel\nCatch a buck fifty, them stars we scar well\nHard luck, got gassed up and starstruck\nThen got stuck in one stroke, the Mobb clutch\nLaid up, sippin' all types of shit, get ya chick bent\nTalk the bitch to death til there's no info left\nHomicidal clepto, like the lye leaf I'm petrol\nRegulate the Metropolitan, niggas gettin' bodied in\nIn the lobby-in, lock the door it ain't safe, kid\nTake it how you take it, grab a hold and embrace it\n\n[Chorus: Prodigy (Havoc)]\nYo the NYC, M-O-B-B thug shit (and that's my shit!)\nI can't get enough of it\nEither fuck with it, or don't fuck with it\nCatch us in a middle of the crowd crazily bent\nWhen my cats attack you got your knot split, aiyyo\n\nI can't get enough of it\nEither fuck with it, or don't fuck with it\nCatch us in a middle of the crowd crazily bent\nWhen my cats attack you got your knot split\nWe out to win and that's it!\nWe out to win it like this!\n\nThat's my shit! Yo", "image": "https://images.genius.com/2c1555f27e44bd87876d75ca225fcb3a.600x600x1.jpg"}], "artist": "Mobb Deep"}