{"songs": [{"title": "Dear Mama (Original Version)", "album": null, "year": "2016-05-05", "lyrics": "[Intro]\nWouldn't be a damn thang without a woman\nWhat'd you say about my mother, man?\nWouldn't be a damn thang without a woman\nWhat'd you say about my mother, man?\n\n[Verse 1]\nWhen I was young, me and my mama had beef\n17 years old, kicked out on the streets\nThough back at the time I never thought I'd see her face\nAin't a woman alive that could take my mama's place\nSuspended from school and scared to go home, I was a fool\nWith the big boys breaking all the rules\nI shed tears with my baby sister, over the years\nWe was poorer than the other little kids\nAnd even though we had different daddies, the same drama\nWhen things went wrong we'd blame mama\nI reminisce on the stress I caused, it was hell\nHuggin' on my mama from a jail cell\nAnd who'd think in elementary, hey\nI'd see the penitentiary one day?\nAnd running from the police, that's right\nMama catch me, put a whoopin' to my backside\nAnd even as a crack fiend, mama\nYou always was a black queen, mama\nI finally understand\nFor a woman it ain't easy tryna raise a man\nYou always was committed\nA poor single mother on welfare, tell me how you did it\nThere's no way I can pay you back, but the plan\nIs to show you that I understand\nYou are appreciated\n\n[Hook]\nWouldn't be a damn thang without a woman\nWhat'd you say about my mother, man?\n(Dear mama)\nWouldn't be a damn thang without a woman\nWhat'd you say about my mother, man?\n(You are appreciated)\nWouldn't be a damn thang without a woman\nWhat'd you say about my mother, man?\n\n[Verse 2]\nNow ain't nobody tell us it was fair\nNo love from my daddy cause the coward wasn't there\nHe passed away and I didn't cry, cause my anger\nWouldn't let me feel for a stranger\nThey say I'm wrong and I'm heartless, but all along\nI was looking for a father he was gone\nI hung around with the thugs, and even though they sold drugs\nThey showed a young brother love\nI moved out and started really hangin'\nI needed money of my own so I started slangin'\nI ain't guilty cause even though I sell rocks\nIt feels good putting money in your mailbox\nI love paying rent when the rent's due\nI hope you got the diamond necklace that I sent to you\nCause when I was low you was there for me\nAnd never left me alone because you cared for me\nAnd I could see you coming home after work late\nYou're in the kitchen trying to fix us a hot plate\nYou just working with the scraps you was given\nAnd mama made miracles every Thanksgivin'\nBut now the road got rough, you're alone\nYou're trying to raise 2 bad kids on your own\nAnd there's no way I can pay you back, but my plan\nIs to show you that I understand\nYou are appreciated\n\n[Hook]\nWouldn't be a damn thang without a woman\nWhat'd you say about my mother, man?\n(Dear mama)\nWouldn't be a damn thang without a woman\nWhat'd you say about my mother, man?\n(You are appreciated)\nWouldn't be a damn thang without a woman\nWhat'd you say about my mother, man?\n\n[Verse 3]\nPour out some liquor and I reminisce, cause through the drama\nI can always depend on my mama\nAnd when it seems that I'm hopeless\nYou say the words that can get me back in focus\nWhen I was sick as a little kid\nTo keep me happy there's no limit to the things you did\nAnd all my childhood memories\nAre full of all the sweet things you did for me\nAnd even though I act crazy\nI gotta thank the Lord that you made me\nThere are no words that can express how I feel\nYou never kept a secret, always stayed real\nAnd I appreciate how you raised me\nAnd all the extra love that you gave me\nI wish I could take the pain away\nIf you can make it through the night there's a brighter day\nEverything will be alright if you hold on\nIt's a struggle every day, gotta roll on\nAnd there's no way I can pay you back, but my plan\nIs to show you that I understand\nYou are appreciated\n\n[Hook]\nWouldn't be a damn thang without a woman\nWhat'd you say about my mother, man?\n(Dear mama)\nWouldn't be a damn thang without a woman\nWhat'd you say about my mother, man?\n(You are appreciated)\nWouldn't be a damn thang without a woman\nWhat'd you say about my mother, man?\n(Dear mama)\nWouldn't be a damn thang without a woman\nWhat'd you say about my mother, man?\n(You are appreciated)\n\n[Outro]\nMama told me there'd be days like this\nWhat'd you say about my mother, man?\nMama told me there'd be days like this\nWhat'd you say about my mother, man?\nMama told me there'd be days like this\nDear mama\nMama told me there'd be days like this\nDear mama\nMama told me there'd be days like this\nDear mama\nMama told me there'd be days like this\nMama told me there'd be days like this\nMama told me there'd be days like this\nMama told me there'd be days like this", "image": "https://images.genius.com/81f4981dce2b3df943fad4ae8cb57a1e.1000x971x1.jpg"}], "artist": "2Pac"}