{"songs": [{"title": "Win Some, Lose Some", "album": "Dark Sky Paradise (Deluxe)", "year": "2015-02-24", "lyrics": "[Chorus: Big Sean & Jhene Aiko]\nYou win some and lose some, I heard that my whole life\nI heard that my whole life, but that doesn't make it right\n(Okay, you got ahead tonight)\nMan, that doesn't make it right\nMan, that doesn't make it right\nHow do you sleep at night?\n\n[Verse 1: Big Sean]\nSean, nigga you on, damn, nigga, you on\nYou was a millionaire but your niggas is still at home\nDamn, nigga, you did it, but damn it you did it wrong\nYou got time for that gig, but not time for the phone\nGot it right with your ends, but fucked it up with your friends\nI seen your ass up on TV,  touched up on them twins\nYou don't know about hard times, you clutched up in that Benz\nGet tired of fuckin' hoes then get to fuckin' their friends, whoa\nNiggas want handouts, and I only got two\nNow I'm on the phone talkin' to my mom like I only got you\nGettin' dressed up for court, that's a law suit\nAin't wearin' V necks, but niggas ask what happened to the crew\nNow I'm in court for some shit I didn't do\nCause of my nigga, knowin' my career could've been through\nSo when it's time to travel management say I only need two\nListenin' to them when I'm the one that makes the rules\nI'm just a victim of the life though that I ain't tryna lose\nThis the dream, I had a wake up call and missed snooze\nLately, though my family been too happy\nI just turned my mama hooptie to a new Caddy\nPeople thinkin' I'm rich and I wish they knew that\nI been signed for four years and I'm just able to do that\nWorry 'bout my next Rolex time piece\nMy nigga Tone worry 'bout our sis, Shanice\nWe supposed to be the role models\nNo wonder why she wanna smoke weed and skip college\n\n[Pre-Chorus 1: Big Sean]\nIs this the example I'm tryna set?\nAre these the people I'mma forget?\nAre these the times I'mma regret?\nLivin' life wishin' I could hit reset but, but\n\n[Chorus: Big Sean & Jhene Aiko]\nYou win some and lose some, I heard that my whole life\nI heard that my whole life, but that doesn't make it right\n(Okay, you got ahead tonight)\nMan, that doesn't make it right\nMan, that doesn't make it right\nHow do you sleep at night?\n\n[Verse 2: Big Sean]\nOkay, you win some, lose some, break some, bruise some\nLife could be a test, multiple choice, choose some\nChoose one, stick with it, man, prove some\nSometimes the best teachers is ourselves goin' through somethin'\nReal life will teach your ass way fucking fast\nI always thought my last girl was supposed to be my last\nI got four aunties, two uncles, one dad\nOne mom, two brothers, and 200 niggas mad\nAnd it's only one me, divide it and do the math\nI'm the one that dropped out, got no time for the class\nHow am I supposed to have time for everyone I just said?\nI don't even have time for everything in my head\nOn my way to see Kim and Ye both tie the knot\nWishin' me and you were no strings attached, but were nots\nMan thats drama, drama drama\nSo deep that call each others mamas' mamas\nWe need a break I mean comma, comma comma\nI'm tryin, homie\nBut she always picks the wrong time like phones dyin' on me\nIn the bed cryin' on me, talkin' lyin' on me\nIt sucks to hit the internet and see you're lyin' on me\n\n[Pre-Chorus 2: Big Sean & Jhene Aiko]\nFuck\nIs this the example we tryna set?\nAre you the person I'mma forget?\nAre these the times I'mma regret?\nLivin' life wishin' I could hit reset but, but\n\n[Chorus: Big Sean & Jhene Aiko]\nYou win some and lose some, I heard that my whole life\nI heard that my whole life, but that doesn't make it right\n(Okay, you got ahead tonight)\nMan, that doesn't make it right\nMan, that doesn't make it right\nHow do you sleep at night?\n\n[Outro]\nSee, the mind is a fucking trickster\nIt can fuck you 'round, but your heart will never lie to you\nAnd that’s why people love you, Sean\nBecause you talk to them from the heart\n(Thanks, dad)\nThat’s why you're magical, Sean\nIt’s no mistake that you’re where you are right now\nYou speaking that from your brain, but they hear you from your heart\nBecause people can see your bullshit\nAnd I know I’m talking a lot of shit\n(No, you’re not)\nBut I want you to hear that\nBecause I’m a great motherfucker, man\nAnd I’m very modest\nYou know, I am\nAnd I know a lot of shit\nThey know when you bullshit\nThey don’t even intellectualize it\nThey feel it\nLife is a feeling process", "image": "https://images.genius.com/740ca6fe7862ad174446f7794050b7a4.1000x1000x1.jpg"}], "artist": "Big Sean"}