{"songs": [{"title": "Nothing to Lose", "album": "R U Still Down? (Remember Me)", "year": "1997-11-25", "lyrics": "[Verse 1]\nThe only way to change me is maybe blow my brains out\nStuck in the middle of the game to get the pain out\nPray to my God everyday, but he don't listen\nThe poverty bothers me, but mama's working wonders in the kitchen\nListen! I can hear her crying in the bedroom\nPraying for money but never think would she be dead soon\nAm I wrong for wishing I was somewhere else\nI'm thirteen, can't feed myself\nCan I blame daddy cause he left me?\nWish he would've hugged me\nToo much like him, so my mama don't love me\nOn my own at a early age, I'm getting paid\nAnd I'm strapped, so I'll never be afraid\nWhere did I go astray?\nI'm hanging in the back streets\nRunning with G's and dope fiends, will they jack me?\nCan't turn back, my eyes on the prize\nI got nothing to lose, everybody gotta die\nSay good-bye to the bad guy\nThat one, you fucked, when you passed by\nBuck-buck from a Glock let the glass fly\nDo or die walk a mile in my shoes\nThen you'd be crazy too\n\n[Hook]\nWith nothing to lose\n[The D.O.C] I got raw when I came to Cali\nGot nothing to lose\n[Ice Cube] That’s why I got gang-related rhymes\n\nGot nothing to lose\n[The D.O.C] I got raw when I came to Cali\nGot nothing to lose\n[Ice Cube] That’s why I got gang-related rhymes\n(x3)\n\n[Verse 2]\nI thank the Lord for my many blessings\nThough I'm stressing keep a vest for protection\nFrom the barrel of a Smith & Wesson\nAnd all my niggas in the pen, here we go again\nAin't nothing separating us from a MAC-10\nBorn in the ghetto as a hustler, older\nStraight soldier, bucking at them bustas\nNo matter how you try, niggas never die\nWe just retaliate with hate, then we multiply\nSee me striking down the block hitting corners\nMobbing like a motherfucker, living like I wanna\nAin't no stopping at the red lights, I'm sideways\nTHUG LIFE, motherfucker, crime pays\nLet the cops put they lights on, chase me, nigga\nZig-zagging through the freeway, race me, nigga\nIn a high speed chase with the law\nThe realest motherfucker that you ever saw\nI'm living raw, til they bury me, don't worry me, I'm high\nLiving like I ain't afraid to die\nAnd if you could walk a mile in my shoes\nThen you'd be crazy too\n\n[Hook]\nWith nothing to lose\n[The D.O.C] I got raw when I came to Cali\nGot nothing to lose\n[Ice Cube] That’s why I got gang-related rhymes\n\nGot nothing to lose\n[The D.O.C] I got raw when I came to Cali\nGot nothing to lose\n[Ice Cube] That’s why I got gang-related rhymes\n(x3)\n\n[Verse 3]\nAin't no escape from a deadly fate\nAnd every day there's a million black bodies put away\nI'm starting to lose hope, it seems everybody's on dope\nMama told me to leave, cause she was broke\nSometimes I choke on the indo, creeping out the window\nAlone, on my own, I'm a criminal\nGot no love from the household\nI'm out cold, on the streets screaming 'Motherfuck peace!'\nI got nothing to lose, and something to prove, what do I do?\nLive the THUG LIFE, nigga, stay true\nI wonder when they kill me, is there a heaven for a real G?\nLord forgive me, if you feel me\nCause all my life I was dirt broke with no hope\nLittle skinny motherfucker wanting dough\nI hated cutting suckers with my razor blade\nBut everyday it's a struggle to get major paid\nAnyway, it's so hard on a nigga in this city, no pity\nAnd ain't no love for the scrubs that be buying dime\nIf you could walk a mile in my shoes\nThen you'd be crazy too\n\n[Hook]\n\n[Outro]\nThey wonder what type nigga be a THUG LIFE nigga\nWe be the craziest, motherfucker!\nYou know!\nThey wonder what type nigga be a THUG LIFE nigga\nWe be the craziest!", "image": "https://images.genius.com/4f924e981b74c6d754d2c9da26f83f15.500x500x1.png"}], "artist": "2Pac"}