{"songs": [{"title": "Uh-Huh", "album": "Malpractice", "year": null, "lyrics": "[Verse One]\nYo, now first of all I'm a kid about money\nTalkin hot bid'ness and my paper work, runnin\nDoc and Hot Nick is like Good Will, Huntin\nPut them shotguns up in the air and start, pumpin\nReal niggas in the hood don't start, nuttin\nWhen the heat breaks they proceed to start, dumpin\nYou eyeballin me like you movin somethin\nYo' bitch fuckin you with me in the Walkman\nSlow down boy, you're not a real, killer\nThree-wheel motion from me shootin the wheel up\nOut the jungle, Doc straight go-rilla (ahh ahh ahh ahh)\nBananas, antennas can't pick up (doo doo doo doo)\nMy crew is Triple P, watch us do it\nBrook-nam, Shaolin, the T-Dot, Newark\nAll my shorties skippin school watch truant\nHit the college dorm, make freaks out the students\n\n[Hook]\nYeah, now do you like the way it feel baby? (uh-huh)\nDo you like the way the Bricks move baby? (uh-huh)\nRoll the L, let's inhale baby (uh-huh)\nStartin it up befo' twelve baby (uh-huh, uh-huh)\nTo my niggas that say buck hoes (uh-huh)\nOnly real dog is they red nose (uh-huh)\nIf it ain't green can't accept those (uh-huh)\nThat can't roll with niggas that's petrol (uh-huh)\n\n[Verse Two]\nNiggas, abandon ship when I'm geared for landing\nYour own tec-ll see my grill and start, jamming\nThrow your hands up in the air, keep 'em standin\nFuck if you in here on V.I.P., laminates (fuck you)\nYou'll get touched too with the, cannon\nAround the handle, a fuck you ban-danna\nDawg I was grown with balls and bad, manners\nThat's why me and your broad is on, camera {*click click click*}\nI'm sick from a childhood head, blow\nWhen systems was pumpin before I let, go\nThe head honcho fall back and pump, fo'\nFigure-four flows 'til they scream, UNCLE!\nNow wake your punk-ass up if you asleep\nDoc and Brick City bout fo'-thousand deep\nFourteen years old, got TV's in the, seat\nWatchin pornos of Janet Jack-me\n\n[Hook] - 2X\n\n[Hook] - whispered", "image": "https://images.genius.com/109a9fb9c91fad29c7f632fb053de1bf.1000x1000x1.jpg"}], "artist": "Redman"}