{"songs": [{"title": "Murda", "album": "Free Weezy Album", "year": "2015-07-04", "lyrics": "[Hook: Junior Reid]\nFirst degree murder\nBeg them, no push it further\nThis a nuh beef, we make burger\nHe youths, them strapped with them burner\n\n[Verse 1: Lil Wayne]\nReal niggas say soowoo\nAnd such and such killed such and such\nThe streets talk\nAnd bullshit walks\nOn crutches, but\nIt's strut to strut\nNiggas panic\nButton pressing\nThe end is coming\nCount your blessings\nWe living in the day and time\nWhere the ten commandments\nAre now suggestions\nHow depressing\nHow infested\nClick-clack, pow; intestines\nBad bitches in flower dresses\nWith tight pussies, I found the crevice\nAK bullets move mountains\nBreak them bitches down to pebbles\nThat tough talk is like music to my ears\nSo keep it acapella\nBased on a true story\nWe not worried, y'all too worried\nI faced my fears\nAnd told them motherfuckers y'all too gorgeous\nDread head from New Orleans\nWhere the youth, them got two choices\nShoot, or get shot, or a nigga choose for you\nWe murdered them\n\n[Hook: Junior Reid]\nFirst degree murder\nBeg them no push it further\nThis a nuh beef we make burger\nThe youths them strapped with them burner\nFirst degree murder\nBeg them no push it further\nThis a nuh beef we make burger\nCus the youths them strapped with them burner\n\n[Verse 2: Cory Gunz]\nYo, Tune point and I'm dusting niggas\nI ain't talking lacing no marijuana\nSoon as I hatch I reign like a quail\nAnd I don't give 2 fucks I ain't a koala\nMy uncle gangsta but I make him nervous\nAll he see in my face is murda\nWaste a burna is my waste a furnace\nI'm pacing turners your face the thermos\nFirst birthday wish was getting caked up\nShoot a nigga wake up on the wake up\nLay down and a model bitch ache up\nThen I put pearls in a bitch like Jacob\nPlay tough taped off of this day pub\nRace off like some motherfucking make up\nTake off looking for something to take up\nWant the paper? Or you want in the paper?\nNot horoscopes but in the horror scope\nPray to God you see tomorrow, nope\nThey gave my nigga 30 for a jar of dope\nBut do a nigga dirty with a bar of soap\nBlowing so much you sneezing dick\nBelieve in me I don't believe in shit\nY'all pinching pennies? I'm squeezing drip\nIt's Young Money till I'm in the freezer stiff\nBitch\n\n[Hook: Junior Reid]\nFirst degree murda\nBeg dem nuh push it further\nThis a nuh beef weh make burga\nThe youths dem strapped with dem burner\nFirst degree murda\nBeg dem nuh push it further\nThis a nuh beef weh make burga\nCus the youths dem strapped with dem burner\n\n[Verse 3: Capo]\nIt's all about the money nigga fuck the fame\nWhere we come from shots ring nigga broad day\nLil woadie said he had the chance he do the shit again\nPop the pills for the pain but still won't feel a thing\nIt's deeper than this rapper man the back soaking gang\nCartier frames got them looking at me strange\nWhy pre mostly heard in the rally same?\nLowkey can still get a brick off my name\nNow I'mma tell you this here for my youngin and them\nThe same ones I help the corners with do numbers with\nIf there ever was a problem watch them pull up quick\nCaught an L sticking to the script you know I switched\nWe now switch\n\n[Hook: Junior Reid]\nFirst degree murda\nBeg dem nuh push it further\nThis a nuh beef weh make burga\nThe youths dem strapped with dem burner\nFirst degree murda\nBeg dem nuh push it further\nThis a nuh beef weh make burga\nCus the youths dem strapped with dem burner", "image": "https://images.genius.com/22c3b68c0f49bb742b34148131ca933d.1000x1000x1.jpg"}], "artist": "Lil Wayne"}