{"songs": [{"title": "Rockin’ Wit Da Best", "album": "Redman Presents... Reggie", "year": null, "lyrics": "[Kool Moe Dee]\n(Yeah) One two, one two\nParty people in the place to be!\n\n[Redman]\nYeah, ha ha\nLet me clear my throat! {*2X*}\nGilla House niggas baby\n\n[Kool Moe Dee]\nWe gon' get a lil' somethin straight here in the place to be\n\n[Redman] + (Kool Moe Dee)\nYeah... yo\nYou now rockin with the best, I'm blessed\nI deliver well, that's why I'm up in the S\nUPS, through rain sleet or snow\nI never break down, my skin made of Goretex\nHeard Reggie went left, cause when I do right\nPunk niggas out of spite only give me a few mics\nThree best emcees, time for new light\nLet the streets decide on how nice! (Let's rock the house)\nYou see to be an emcee is not money in the bank, or\nBlowin niggas off like \"Homey we are late!\"\nA million dollar boss dictatin what I think, shit\nHis shooter's gettin real nervous in the paint\nFive star when I rank, like Le Armitage\nGirls lookin like Nicki Minaj, Reggie\nHip-Hop I rock steady, just check my clout\nWhen Jersey in the building, I (rock the house!)\n\n[Hook: Redman] + (Kool Moe Dee)\nYo, you now rockin with the best, one of the best\nBest believe boy I look so FRESSSH~!\nJust tellin you how I feel\n(We gon' get a lil' somethin straight here in the place to be)\n\n[Redman] + (Kool Moe Dee)\nHeheh, hey, they asked me how I maintain\nThe rap game and the streets I can picture in the same frame\nYou ain't raw? You don't ball\nSo lose yourself, tryin to keep UP when I change lanes\nMy weed game green, clientele is swell\nIt's Cool like LL\nDeBarge look alike brother, time will reveal\nThat I'm doin it, and doin it well! (Let's rock the house)\nEven if you read braille you can feel my swag\nI'm your seein eye dog with the pen and the pad\nBlue collar, when I talk, you can touch\nSo FUCK how much money you can fit in the bag!\nMy gift is the gab, the street's the truth\nThey got a lil' lost when down South came through\nI stayed in the booth and began to trip\nCause (can't nobody rock like me, hah, remember this!)\n\nAnd haters gon' say \"He a funny ass nigga!\"\nBut I'm a asset, good barbershop talk\nThe game without me is Wu-Tang without RZA\nPour out a little liquor how I murder it\nBeef; my boys Fatburger it\nGilla - never heard of it? Shut your mouth\nWhen Jersey in the building, I (rock the house!)\n\n[Hook]\n\n[Redman] + (Kool Moe Dee)\nYo, what you consider the best, what you invest\nA half a mill' around your neck? Let me guess\nPunchlines after punchline for a check\nI did that, when GangStarr had to \"Get a Rep\"\nMy city in debt, that's why I sound hungry\nMy flow dumb as fuck like Al Bun-dy\nAsk Treach, I do it for my lonely\nAll y'all come and get it if you want me (let's rock the house)\nMan, I'm a funny ass nigga", "image": "https://images.genius.com/4d4f1e8f8a259cccb95855c51037a514.600x600x1.jpg"}], "artist": "Redman"}