{"songs": [{"title": "We Riding", "album": "Build and Destroy", "year": null, "lyrics": "[Hook]\nRidin, survivin\nTryin not to die and tryna cop a island\n5'9\" and, sleazy\nThe game needs me, cause I'm drama\nI got problems, I can't resolve 'em\nIt's no beefin, I can't call 'em\nI'm ridin, survivin\nTryin not to die then, look him in his eyes then\n\n[Royce Da 5'9\"]\nRoyce 5'9\", YEAH.. yeah, yeah\nYeah, yeah, yeah, remember me?\n\nThe hype man that came in to blaze shit\nBrought in by the white man like I came on a slave ship\nAnd chains; no master can turn his back on the only rapper\nCan match him and burn him on his own track with him\nNo goin back with him; cause holmes actin like\nHe got Capone backin him (why?) He's gone platinum\nWOW, I'm hurt, cause now his words\nCause now he famous 'bout as down to earth as it rains the worst\nMy value will grow with my next release\nCUT THE CHECK, I suggest you invest in extra ink\nMy next album should raise the brow of every man, woman and child\nAnd today, I gotta get paid\nYou got a sign on your door that says \"Keep Out\"\nI can't fire no more, I can't reach out\nYou truly know more later after you learn\nMy last favor to ask you was when, \"Don't do me no more favors\"\n\n[Hook]\n\n[Royce - over Hook]\nYeah, yeah, yeah\n5'9\", yeah\nCause I'm drama, yeah!\nHow the fuck you gon' forget about me niggas?\n\n[Outro: Royce Da 5'9\"]\nYeah, yeah, I'mma show you muh'fuckers\nHow to go from no buzz, to a big-ass buzz\nI'm a ill motherfucker\nI don't need nobody to hold my motherfuckin hand\nWhatever niggas, one hun'ned\n'03 is my year nigga, Royce 5'9\"\nThe drama king nigga, DRAMA\n\n[Hook]\n\n[Royce - over Hook]\n\"Rock City Version 2.0\" in stores right now\nFeel me!\n\"Dead or Alive\" the new album comin in Spring niggas\nIf you gonna go buy the motherfucker pray for me\nIf not, FIGHT ME!\nMotherfucker, holla!", "image": "https://images.genius.com/d86b45b993cdf0c53559e740521a4bba.500x494x1.jpg"}], "artist": "Royce da 5'9'’"}