{"songs": [{"title": "C-Walk", "album": "Kuruption!", "year": "1998-10-06", "lyrics": "[Intro: Kurupt]\nYeah, this for the West Coast CD\nLet me clear my throat\nCheck it out, check it out, check it out\nWe gonna drop it like this\nThis album is the best of both worlds\n(Kurupt, Daz Dilly)\nThis for the West Coast side (Young Gotti)\n(Don't forget about Tray Deee and Slip Capone)\nThis for the West Coast one, ha, ha\n\n[Verse 1: Kurupt]\nSaggin', nigga G'd up, sippin'\nSip nigga, dip nigga, set trip nigga\nGot a grip, nigga? Get a grip, nigga, with Tha Gang and\nRollin' with the alpine bangin'\nHomie, what you got? A couple sacks to sell\nWent from weed to dope to max the sale\nHit the switch, nigga\nDon't fuck around with bitch niggas\nI'm a money cash nigga, cash gettin', hash hittin'\nGangbang affiliate, hit a stick real quick\nAnd in a minute start killin' shit real quick\nI'm a million dollar motherfuckin' nigga\nI thought you knew 'bout it, 'bout it, 'bout it, do you got it?\nNow the homies 'bout it, I'm about to do this\nHit a lick, then hit back with some new shit\nThen have a gangsta reunion, the homie told me\nGet'cha boogie on youngsta; C-Walk, homie\n\n[Hook: Kurupt]\n(Get'cha walk on)\nC-Walk, homie\nC-Walk, homie\n(Get'cha walk on)\nC-Walk, homie\nYeah, I'ma tell you like this\nKurupt, you know how it was for me\n\n[Verse 2: Tray Deee]\nBeen regarded as the hardest since I hit the set\nYoung nigga with a rep, kept that gangsta step\nBlue Crocka sacs or blue Corduroy house shoes on\nFlossin' for the hoodrats, gettin' my groove on\nHangin' in the park 'til all hours of dark\nTryin' to catch a mark slippin' with this thing that bark\nCry Baby on the swamp got the exit locked\nAnd ain't no doubt comin' out he gon' wreck you not\nPass me the satin loc so I can wet my throat\nWhile I sag the blue khakis with the Raider coat\nAll the hoes really want is gangstas just like us\nRough and don't give a fuck—ain't that right, Kurupt?\nI stay bangin' on these niggas on a regular basis\nBig paper chases, facin' felony cases\nMade it to be famous, livin' hard and dangerous\nSteppin' on these bustas in my blue Chuck Taylor's\n\n[Hook: Kurupt + (Slip Capone)]\nC-Walk, homie\nC-Walk, homie\nC-Walk, homie\n(Hah, Hawthorne is in the house)\nC-Walk, homie\n(And we C-Walkin', ya dig it?)\nC-Walk, homie\n\n[Verse 3: Slip Capone]\nYou know that gangstas rock, gangstas roll\nHere's the gangsta shit, we on a gangsta stroll\n'Cause gangstas ride, gangstas slide\nIn the gangsta ride with the gangsta glide\n'Cause gangstas move and gangstas groove\nMost gangstas got nothin' to lose\nGangstas live, and gangstas die\nGangstas form a gang and the gang multiply\nGangstas give a fuck, a G don't ask why\nGangstas don't snitch, and gangstas don't cry\nGangstas boogie, gangstas don't dance\nGangsta pull the strap out yo' pants and blast\nGangstas don't run and gangstas don't hide\nI'm a gangsta-ass nigga from the sick Southside\nThat's how I know exactly what a gangsta do\nYou love the gangsta shit, ain't you a gangsta too?\nThen C-Walk, homie!\n\n[Hook/Outro: Kurupt]\nC-Walk, homie\nSlip Capone—C-Walk, homie!\nO.G. Tray Deee—C-Walk, homie!\nKurupt, Dat Nigga Daz, Soopafly\nNow walk on 'em!\nC-Walk, homie\nC-Walk, homie\nNow walk on 'em!", "image": "https://images.genius.com/5e581d680d32af2f362cf75a5451a837.732x731x1.jpg"}], "artist": "Kurupt"}