{"songs": [{"title": "Pretty Toes", "album": "Suit", "year": "2004-09-13", "lyrics": "[Nelly + (Jazze Pha)]\n(Whoa) OHH! C'mon (Ladies and gentlemen)\nOhh (Ladies and gentlemen, ladies and gentlemen!)\nWe wanna welcome e'rybody for comin out tonight (Phizzle Phizzle)\n(Most definitely) To another S-T-L/A-T-L connection\nWhoo! We don't normally do this\nBut uhh.. we gon' keep the party goin (All around the world)\n\n[Hook: Jazze Pha]\nGirls, girls, fly girls (yeah yeah yeahhhh)\nPretty toes all around the world\nI'm lookin for the country girls (go shorty, do your thing now)\nCity girls (go shorty, do your thing now)\nSexy girls (go shorty, do your thing now)\nPretty girls, ohh yeah\n\n[Nelly]\nI need that one that'll make ya heart stop when you see her\nShe can get a pick of the 'Llac or the Modena\nI'll give it all from two to fo'-seaters\nIt ain't gotta be Halloween, I'm +trickin+ just to +treat+ her\nJealousy in the urr - other girls wanna be her\nShe young right now, she's an up-and-comin diva\nShe ain't gotta measure up, but she gotta be off the meter\nBut if I can dance with Cindy, I can dance with Shaquita\nCause I know I can, I shall, I will\nI feels I can, I felt\nI plays with a whole lotta mil's\nYou ain't talkin 'bout nothin if you ain't talkin 'bout dollar bills (hey!)\nShorty glow shine, so fine, you gotta keep her (hey!)\nPretty toed, half Black, half senorita (hey!)\nCoochie so good, make it hard for you to leave her\nI'm a playa so even if I'm losin I never cheat her, uhh\n\n[Hook w/ Nelly ad libs]\n\n[T.I.]\nHey, hey\nT.I.P. be off the meter when he sharp as a needle\nIn a new two-seater, pissin on niggas ego\nI don't wanna rap no mo', I'm CEO\nNo mo' menage-a-trois, the full trio\nThree ho, get in they mind like Miss Cleo\nYou know, nigga try a hold like Judo (oh!)\nI know a lot of nigga hot about me ('bout me)\nI know you niggas ain't forgot about me\nI'm a shotter{?} with the O's and the dro\nAnd the blow and the, Jag-o and get the clothes out the sto'\nAnyway - I got a bottle of Mo' and X-O\nAnd I'm lookin for a modelin ho, so let's go\nGet it right - six nights, six flights, six shows (six shows)\nSix checks, each one, six oh's (six oh's)\nSix broads to choose, they six pros\nLight-skinned Asian bitches with pink toes (okay)\n\n[Hook w/ Nelly ad libs]\n\n[Jazze Pha + (Nelly)]\nThere's so many fly girls I've seen\nAround the worrrrld (All around the worrrrld)\nI gotta get me a girl (You gotta get you a what?)\nHey, hey - I gotta get me a girl (You gotta get you a who?)\nC'mon c'mon - Nikki, Tasha, Kiki, and Laverne and Cheryl\n(Yeah, yeah I know that mayne) Hey, hey\nI gotta get me a girl (You gotta get you a what?)\nI gotta get me a girl, hey\n\n[Nelly]\nUhh, uhh\nNow I done been around the world TWICE, back again\nWhoever thought I'd be twenty times plat-inum\nWhoever thought I'd have jewels but I lack a gem\nI done dealt with plenty dimes, but I lack the ten\nA New York chick, I met her through the fashion biz\nAnd we be doin them type of thangs - you can't imagine shit\nShe be bitin and screamin cause she's so passionate\nShorty got blue eyes but she African [echoes]\nTalkin 'bout\n\n[Hook w/ Nelly ad libs]\n\n[Nelly]\nYeah! We wanna thank all the ladies for comin out tonight\nEvery one that.. you know, open-toed, inch-heel stilleto\nMaybe you might have a open-toed sandle\nOr maybe you just runnin to the grocery sto' in your house shoes\nWith your feet out, girl you lookin good\nOH!\n\n[Jazze Pha + (Nelly)]\nThere's so many fly girls I've seen (Go shorty, whoo!)\nAround the worrrrld, all around the worrrrld (Go shorty)\nI gotta get me a girl (Definitely, ladies please)\nHey, hey - I gotta get me a girl (Keep your feet well-taken curr of)\nC'mon c'mon - Nikki, Tasha, Kiki (It's a must)\nAnd Laverne and Cheryl - hey, hey\nI gotta get me a girl - I gotta get me a girl\nI gotta get me a girl - hey, hey", "image": "https://images.genius.com/feab51577febd001d2d1ca3c23574a2d.1000x1000x1.jpg"}], "artist": "Nelly"}