{"songs": [{"title": "Criminal (Snippet)", "album": "The Marshall Mathers LP (Snippet Tape) ", "year": "2000-04-25", "lyrics": "[Intro]\nA lotta people ask me stupid fucking questions\nA lotta people think that what I say on record\nOr what I talk about on a record\nThat I actually do in real life or that I believe in it\nOr if I say that I wanna kill somebody, that\nI'm actually gonna do it or that I believe in it\nWell shit, if you believe that, then I'll kill you\nYou know why? 'Cause I'm a criminal\nYou're goddamn right\nYeah, I'm a criminal\nI'm a criminal\n\n[Verse 1]\nMy words are like a dagger with a jagged edge\nThat'll stab you in the head, whether you're a fag or lez\nOr the homosex, hermaph or a trans-a-vest\nPants or dress, hate fags? the answer's \"yes\"\nHomophobic? Nah, you're just heterophobic\nStaring at my jeans, watching my genitals bulging\nThat's my motherfuckin' balls, you'd better let go of 'em\nThey belong in my scrotum, you'll never get hold of 'em!\n\"Hey, it's me, Versace! Whoops, somebody shot me!\nAnd I was just checking the mail, get it? Checking the 'male'?\"\nHow many records you expecting to sell\nAfter your second LP sends you directly to jail?\nCome on, relax guy, I like gay men\nRight, Ken? Give me an amen! (A-men!)\n\"Please Lord, this boy needs Jesus\nHeal this child, help us destroy these demons\nOh, and please send me a brand new car\nAnd a prostitute while my wife's sick in the hospital\"\nPreacher preacher! Fifth grade teacher!\nYou can't reach me, my mom can't neither\nYou can't teach me a goddamn thing cause\nI watch TV and Comcast cable\nAnd you ain't able to stop these thoughts\nYou can't stop me from toppin' these charts\nAnd you can't stop me from droppin' each March\nWith a brand new CD for these fuckin' retards\nAnd to think, it's just little old me\nMr. \"Don't Give a Fuck\" still won't leave\n\n[Hook]\nI'm a criminal! 'Cause every time I write a rhyme\nThese people think it's a crime to tell 'em what's on my mind\nI guess I'm a criminal! But I don't got to say a word\nI just flip 'em the bird and keep going, I don't take shit from no one\nI'm a criminal! 'Cause every time I write a rhyme\nThese people think it's a crime to tell 'em what's on my mind\nI guess I'm a criminal! But I don't got to say a word\nI just flip 'em the bird and keep going, I don't take shit from no one\n\n[Verse 2]\nMy mother did drugs, hard liquor, cigarettes, and speed\nThe baby came out, disfigured ligaments indeed\nIt was a seed who would grow up just as crazy as-", "image": "https://images.genius.com/7592b9ffb6253a995347b497d73ac378.590x373x1.png"}], "artist": "Eminem"}