{"songs": [{"title": "Who Am I", "album": null, "year": null, "lyrics": "Eeeyiyiyiyi yah, the Dogg Pound's in the house\n(The bomb)\nEeeyiyiyiyi yeah, the Dogg Pound's in the house\nSnoop Doggy, Dogg\n(The bomb)\nSnoop Doggy, Dogg\n(Dog)\nFrom the depths of the sea, back to the block\nSnoop Doggy Dogg, funky as the, the, The D.O.C\nWent solo on that ass but it's still the same\nLong Beach is the spot where I served my cane\nFollow me, follow me, follow me\nFollow me but don't lose your grip\nNine-trizzay's the yizzear for me to fuck up shit\nSo I ain't holdin' nuttin' back\nAnd motherfucker I got five on the twenty sack\nIt's like that and as a matter of fact, rat-tat-tat-tat\n'Cuz I never hesitate to put a nigga on his back\nYeah, so peep out the manuscript\nYou see that it's a must we drop gangsta shit\nWhat's my motherfuckin' name?\nSnoop Doggy, Dogg\n(Yeah, yeah, yeah)\nSnoop Doggy, Dogg\n(The bomb)\nDa duh, da, da, dah\nDo do do do, doo doo, doo da dah\nIt's the bow to the wow, creepin' and crawlin'\nYiggy, yes, y'allin, Snoop Doggy Dogg in\nThe motherfuvkin' house like everyday\nDroppin' shit with my nigga Mr. Dr. Dre\nLike I said, niggas can't fuck with this\nAnd niggas can't fuck with that\nShit that I drop 'cuz ya know it don't stop\nMr. One Eight Seven on a motherfuckin' cop\nTic toc never the Glock just some nuts and a cock\nRobbin motherfuckers then I kill dem blood claats\nThen I step through the fog and I creep through the smog\n'Cuz I'm Snoop Doggy, Doggy Doggy, Dogg\nSnoop Doggy, Dogg\nSnoop Doggy, Dogg\n(The bomb)\nBow wow, yippy yo, yippy yay, bow wow, yippy yo\n(The bomb)\nBow wow, yippy yo, yippy yay, bow wow, yippy yo\nNow just throw your hands in the motherfuckin' air\nAnd wave the motherfuckers like ya just don't care\nYeah, roll up the dank and pour the drank\nAnd watch your step 'cuz Doggy's on the gank\nMy bank roll's on swoll\nMy shit's on hit, legit, now I'm on parole, stroll\nWith the Dogg Pound right behind me\nAnd up in yo bitch, is where ya might find me\nLayin' that, playin' that G Thang\nShe want the nigga with the biggest nuts and guess what?\nHe is I and I am him, slim with the tilted brim\nWhat's my motherfuckin' name?\nSnoop Doggy, Dogg\n(The bomb)\nSnoop Doggy, Dogg\nSnoop Doggy, Dogg\n(The bomb)\nSnoop Doggy, Dogg\n(Dog)\nDa duh, da da dah\nDo do do do, doo doo doo, da dah\n(The bomb)\nDa duh, da da dah\nDo do do do, doo doo doo, da dah\n(Dog, the bomb)\nDoggy Dogg, Doggy Dogg, Doggy Dogg\n(The bomb)\n(The bomb)\nWhat is his name?\nSnoop Dogg and the Dogg Pound\n(The bomb)\nOh, Snoop Dogg, Snoop Dogg, Snoopy Dogg\n(The bomb)\nYeah, yeah, I know his name\nCome on Snoopy, come on Snoopy\n(The bomb)\nAnd the Dogg Pound\nSnoopy Dogg, Snoopy Dogg\n(The bomb)\nSnoopy Dogg\nDog, nasty dog, Doggy Dogg", "image": "https://images.genius.com/8c99dd335733f9c3cf16f57c9f589cfb.361x361x1.jpg"}], "artist": "Snoop Dogg"}