{"songs": [{"title": "Nasty Rhymes", "album": "Gettin’ It (Album Number Ten)", "year": "1996-05-21", "lyrics": "Hook:\nToo $hort why you say those nasty words?\nToo $hort why you say those nasty rhymes?\nHow come you be dissin all us girls?\nToo $hort why you say those nasty words?\n\nIt's like this bitch\n\nVerse 1:\nSee I hit the studio ten years ago\nScreamin out cuss words like \"fuck you ho\"\nComin from East Oakland went nationwide\nI'm on my tenth album bitch and I still ain't died\nWouldn't change for nuthin, gettin paid to kick it\nYou could rap your whole life and wouldn't make a mealticket\nNigga don't stop rappin let the hoes keep hoin'\nAs long as I'm alive I'mma keep on rollin\nCan't do nuthin for a bitch while she bleed\nYou can put that on a fat bag of weed\nAnd get high, nigga fuck these hoes\nI'll be singin nasty rhymes even when I'm old\nCause I don't stop rappin, bank keep stackin\nWherever theres hoes best believe I'm mackin\nAll you emcees tryin to take my place\nYellin \"Beyotch!!\" just to hear the people say\n\nHook\n\nVerse 2:\nI talk bad about a bitch, it ain't that hard\nNever got the big head still the same old Todd\nIn every household niggas know my name\nHoes love the way I kick that game\nFrom nineteen-eighty to ninety-six\nI'm still makin hits, hoes ridin the dick\nMy crew is thick, and we dangerous\nYou lick dick bitch, you wanna hang with us?\nYou better never talk down on a player\nI'm $horty the pimp, I got hoes everywhere\nI get my cash quick you lil' fast bitch\nI take you to my house and get my ass licked\nYou say hey Too $hort why you rap so nasty\nI look you in the face and say bitch don't ask me\nNuthin, they'll never take my place\nI'm yellin \"Beyotch!!\" just to hear the people say\n\n*Female speaking indeterminately*\n\nDon't get me wrong bitch\n\nVerse 3:\nSee I got a gang of homies that I put on deck\nI make the shit that you bump when you in the projects\nYou can check my file and won't find a flaw\nYou can ask these bitches am I really raw\nLike Captain Fowl, I cuss you out while I spit in your mouth\nSo bitch don't ask me how\nToo $hort fucked it up came back again ho\nSmokin them big fat sacks of indo\nI make a new album every year\nMy speakers so loud I can barely hear\nI got a bad bitch, with some big ol' breasts\nI like to play with them titties, lay my dick on her chest\nAnd start strokin, thats how it should be\nI'm bustin' nuts everywhere but in her pussy\nAnd if sometimes things don't go my way\nI say \"Beyotch!!\" just to hear the people say\n\nHook", "image": "https://images.genius.com/7bf671ac92a336bfe3f391d4c6e34ef9.500x500x1.jpg"}], "artist": "Too $hort"}