{"songs": [{"title": "No Biggie", "album": "Young Sinatra: Undeniable", "year": "2012-04-30", "lyrics": "[Intro: Regina King, B.I.G, & Doug Copsey]\nSinatra\nIt was all a dream\nYou are now watching a master at work\nNo Biggie\nYeah, my name is Riley, son\nBut you know what niggas call me?\nAKA, Riley Escobar, know what I'm saying?\nCause I be in the streets you know?\nI got all kinds of names like HR Paper Stacks\nUh, also known as AKA Horse Choker, uh\n\n[Verse 1: Logic]\nHey, yo, I'll chop you up in sixteen pieces\nIn front of your nieces, while I'm eating Reese's\nAnd won't even offer them any, yes I spit plenty\nThis is East Coast flow at its finest\nIn the studio, where you find us, put a bullet where your spine is\nAt sixteen I was skipping school and smoking chronic\nWhile you was learning about English, Big L was teaching Ebonics\nI spit fire so demonic, writing code like I'm masonic\nA Jedi master breaking it down like old plaster\nNo medication for this track cause this is how a psycho rips\nMy bank account is like casino vaults, your pockets microchips, uh\nMotherfucker, I dare you to test it, hope you're well rested\nWhoop your ass and get arrested, in a double breasted\nLouis Vuitton diamond encrested tailor made suit\nNow that's All Sinatra Everything\nI explode like hollow tips on contact\nChronologically murder schmoe there's no bringing Joe back\nPuffing cubans and sipping Cognac\nMafietic mentality, introduce me to this beat and it's fatality\nI kill mics like Conrad Murray\nSharp like Hanzo steel, the rest is obtuse\nI get loose when sipping Goose and rhyme like Doc Seuss\nFlow tight like noose, whoop ass like Bruce, no time for a truce\nAlphabetical mathematic addict\nI spit sixteens so erratic you think it was a semi-automatic\nI know by now you thinking \"Oh my God, he let them have it\"\nBut that was just a loan, time to collect like I'm Capone\nReap what I've sewn, in other words that is the throne\nChilling while homies smoking marijuan'\nIf you thinking that this shit is wack well then you're dead wrong\nCause for every emotion and every mood I have a song\nFor the club, for the streets, for the whip and for the sheets\nCause this is where intellect and versatility meets\nI'm Young Sinatra, backstage chilling with BobbySoxers\nI got ya\n\n[Outro:]\nYeah!\nYou wanna fuck with us?!\nFuck with us, yeah!?", "image": "https://images.genius.com/4cb73fd1e86a44f861bc4ba694c17126.1000x1000x1.jpg"}], "artist": "Logic"}