{"songs": [{"title": "Wit Me", "album": null, "year": "2013-05-21", "lyrics": "[Verse 1: Lil Wayne]\nBitch! Put my dick on yo face, put my gun in yo purse\nPut my work in yo pussy, bitch don’t cum on the work\nPass the weed to your slime, these niggas greener than lime\nSo many knots in my pockets, them bitches need a massage\nI was born in the drought, I hope I die in yo mouth\nIf you're a rat you should’ve died as a mouse\nThe weed louder than the opera house, til the fat lady sings\nDrop codeine in my punch, I’m bout to take a swing\nIf niggas thinkin I’m soft, I’ll knock yo thinkin cap off\nI get blood out these pussies, I’m a stinking tampon\nThis for my niggas back home, I’m so New Orleans regardless\nGot bitches fallin like August could sell bullshit to a Taurus\nMy bitch is badder than me, call that Adam & Eve\nI do tricks on my skateboard, not up my sleeve\nI kiss yo bitch on the neck, shoot your man in the head\nGet his mama address, then send his parents his head\nI play with pussy, not these niggas\nCrucify these niggas\nKidnap em, call they boss, and ask 'em who gone buy these niggas\nGot Lil Wayne on her ass, Lil Tunechi on her titties\nTo kill me you gotta die wit me, wit me, wit me, wit me\n(wit me, wit me, wit me, wit me)\n\n[Hook: T.I.]\nWe ain’t playin, got 100 racks (wit me, wit me, wit me, wit me)\nIn the van got 100 gat (wit me, wit me, wit me, wit me)\nStreets (wit me, wit me, wit me, wit me)\nShe's (wit me, wit me, wit me, wit me)\nHe’s (wit me, wit me, wit me, wit me)\n(I’m wit you!)\nWe ain’t playin, got 100 racks (wit me, wit me, wit me, wit me)\nIn the van got 100 gat (wit me, wit me, wit me, wit me)\nStrong (wit me, wit me, wit me, wit me)\nGas (wit me, wit me, wit me, wit me)\nDrank (wit me, wit me, wit me, wit me)\n\n[Verse 2: T.I.]\nI ain’t never been dumb my nigga\nOr a sucka neither, go ahead play around wit it\nCash on deck, they be layin round wit it\nGot a K - fuck with us,, I’ll be sprayin' rounds with it\nI’m cold! Don't believe me, just ask yo bitch I swear she know her legs up high\nShe spread eagle and then took in my big ego\nI’m stupid, ask Tunechi and them\nLet me tell you a little something bout me\nI talk shit, bread like Muhammad Ali\nThen, whoop a nigga ass like Muhammad Ali\nI’m throwed, no catchin me\nThese niggas in the game – so sad to me\nI’m sure no one would care if we\nJust put them out their misery\nBut no sympathy and no green, uh uh\nLeave home with no heat? Uh uh\nCan niggas talk bullshit on records and see him in public\nAnd they never do nothing\nYou violator, demonstrations I’mma\nPut niggas up under, wherever we want\nI got racks in my pocket right next to my llamas\nGot more in my bag, a couple more hundreds\nGive that to my gunner, they spraying whatever\nSo don’t reach for that when you seein' me nigga\nWhoever fuck with me be smoked in the city\nYou ready for war, you bout that life really\nYou catch me in Cali, you catch me in Philly\nSee me in Miami, them choppers is wit me\nDon’t keep no niggas who be gossippin with me\nLookin for yo bitch but she probably (wit me, wit me, wit me, wit me)\n\n[Hook: T.I.]\nWe ain’t playin, got 100 racks (wit me, wit me, wit me, wit me)\nIn the van got 100 gat (wit me, wit me, wit me, wit me)\nStreets (wit me, wit me, wit me, wit me)\nShe's (wit me, wit me, wit me, wit me)\nHe’s (wit me, wit me, wit me, wit me)\n(I’m wit you!)\nWe ain’t playin, got 100 racks (wit me, wit me, wit me, wit me)\nIn the van got 100 gat (wit me, wit me, wit me, wit me)\nStrong (wit me, wit me, wit me, wit me)\nGas (wit me, wit me, wit me, wit me)\nDrank (wit me, wit me, wit me, wit me)\n\n[Verse 3: Lil Wayne]\nUh, pussy money weed with me\nBefore you judge me I plead guilty\nI wish a nigga would, I won’t get a splinter\nJust bought a chicken, bout to break it down into chicken tenders\nThis block booming, I’m not human\nMy drop zoomin', my eyes boom and\nOne giant leap for mankind\nI’m high as moon men, how have you been?\nGun ain't on my waist\nBut it ain’t that far away\nI’m sparkling like some Chardonnay\nHere today, gone today\nI play with pussy, not these niggas\nCrucify these niggas\nKidnap em call they boss and ask em who gone buy these niggas\nGot Lil Wayne on her ass, Lil Tunechi on her titties\nTo kill me you gotta die wit me, wit me, wit me, wit me\n\n[Verse 4: T.I.]\nHey Wayne wait man, these niggas ain’t true\nHold they own on the yard, these niggas can’t do\nThese niggas ain’t King, these niggas ain’t Tune\nGot the game locked up, covered every angle\nGot the outside, inside, middle lane too\nAll sold up nigga, hold up nigga\nPimps on the loop, put yo hoes up nigga\nHandcuff that bitch when we roll up nigga\nWe’ll hit that bitch, run pole up in her\nHead and shoulders of another ho up in her\nWith the legs hangin' out\nIs she dead? Just about\nThen we rollin some loud and leave up out the house\nWe leave out the house, counting 100’s and 50’s\nAnd go do a show for 250\nWe sell out arenas un hundreds of cities\nThese niggas want trouble? I’m bringing it with me\n\n[Hook: T.I.]\nWe ain’t playin, got 100 racks (wit me, wit me, wit me, wit me)\nIn the van got 100 gat (wit me, wit me, wit me, wit me)\nStreets (wit me, wit me, wit me, wit me)\nShe's (wit me, wit me, wit me, wit me)\nHe’s (wit me, wit me, wit me, wit me)\n(I’m wit you!)\nWe ain’t playin, got 100 racks (wit me, wit me, wit me, wit me)\nIn the van got 100 gat (wit me, wit me, wit me, wit me)\nStrong (wit me, wit me, wit me, wit me)\nGas (wit me, wit me, wit me, wit me)\nDrank (wit me, wit me, wit me, wit me)\n\n[Outro: Lil Wayne]\nThey ain’t fuckin wit me, wit me, wit me, wit me\nNo, they ain’t fuckin wit me, wit me, wit me, wit me\nYo T.I\nThey ain’t fuckin with us pimp\nAHHH!!\nMy bad, I didn't mean to scream\nSorry!", "image": "https://images.rapgenius.com/db155d4699fff95e68506fcab2389ec8.500x500x1.jpg"}], "artist": "T.I."}