{"songs": [{"title": "Intermission", "album": "Forest Hills Drive: Live from Fayetteville, NC", "year": "2016-01-26", "lyrics": "[Intro]\nI need to know, how many people out here tonight, Fayetteville, have been fuckin' with me from day 1 I need to know\nI'm talkin' 'bout when a nigga was passin' his mixtape out the fuckin' mall and shit\nHe like, \"you passed me one, nigga\"\nI'ma do this shit ion' care if there's only like 5 or 6 people in here that know this shit I don't give a fuck\nI'ma do this song for anybody out here tonight that got this shit that I dropped called The Warm Up you know what I mean you gon' fuck with this shit\nOr even if you got this shit that I dropped called Friday Night Lights, you gon' fuck with this shit\nNow listen, I know a lot of people here, been fuckin' with me for a long time\nBut a lot of ya'll, you know this might be the first album you fuck with, or the first show you ever came to so I gotta set the scene for ya'll, I gotta let y'all know somethin'\nThis shit been a long journey it was not always like this\nIt was not this many people\nI'm bout to take ya'll to a time\nWay before we had these fuckin' fancy ass fuckin' LED lights and shit\nI don't even know what the fuck LED lights mean, but I'm payin' for them bitches\nWay before we had this fuckin' cool ass stage and shit, we ain't had to shit like this\nAnd definitely way before we had this stupid fuckin' ridiculous, expensive, blue for no fuckin' reason video wall behind me\nWe ain't have no shit like this man\nThe only thing we had- the only thing we had was classic shit like this\n\n[Intro to Lights Please]\n\nHey!\nHey!\nHey!\nSing!\n\n[Verse 1]\nI had this little bad thing, somethin' like them tens\nShe gave a nigga mad brain, somethin' like The Wiz\nBut, you see, the sad thing fuckin' with her is\nIs the chick ain't even have brains, dummy like a bitch\nSo I tried to show her about the world\nAnd about just who we really are\nAnd where we've come and how we still have to go really far\nLike, \"Baby, look at how we live broke on Bragg boulevard\"\nBut all she ever want me to do is unhook her bra\nThen all I really want is for her to go down low\nBefore you know it, she wet enough to get drowned slow\nAnd all that deep shit I was previously down fo'\nReplaced by freak shit I am currently down fo'\nYou see I peeped it, pussy is power\nThat proud feelin' we get knowin' that pussy is ours\nAnd how it feels to feel that feelin'\nYou feelin' when you be drillin' that shit\nGot her sayin' you be killin' that shit\nAnd all the pain the world cause, she be healin' that shit\nAnd naw, that ain't your girl, dog\nBut you be feelin' that chick\nAnd you just wanna tell her everything she might need\nBut in the meantime it's lights, please\n\n[Chorus]\nLights please, lights please\nSing!\nTurn off the lights\nFor now, everything just seems so right\nAnd how you make the darkness seem so bright\nI'm feeling like things gon' be alright\nLights please, lights please, turn off the lights\nFor now, everything just seems so right\nAnd how you make the darkness seem so bright\nI'm feeling like things gon' be alright\n\n[Intro to In The Morning]\n\nAh shit\n2,6 sing\nHey can I hit it in the mornin'?\nCan I hit it in the mornin'?\nCan I hit it in the mornin'?\nThe sun risin' while you moanin'\nHuh, up top!\n\n[Verse 1]\nBaby, you summertime fine\nI let you get on top, I be the underline, I'm\nTryna get beside you like the number nine, dime\nYou fine as hell\nI guess I met you for a reason, only time can tell\nBut well, I'm wonderin' what type of shit you wantin'\nDo you like the finer things or you a simple woman?\nAy would you drink with a nigga? Do you smoke weed?\nDon't be ashamed, it ain't no thing, I used to blow trees\nGettin' lifted, I quit but shit, I might get high with you\nIt's only fittin' 'cause I'm lookin' super fly with you\nA flower, you are powerful, you do somethin' to me\n'Cause girl, I caught the vibe like you threw somethin' to me\nSo I threw 'em back, now all my niggas hollerin', “Who was that?”\n“Oh boy, she bad nigga, what you 'bout to do with that?”\nI'm finna take you home, just sip a little Patron\nNow we zonin', baby you so fine\n\n[Chorus]\nAnd can I hit it in the mornin'?\nSing\nCan I hit it in the mornin'?\nAnd can I hit it in the mornin'?\nThe Sun risin' while you moanin'\nAnd can I hit it in the mornin'?\nCan I hit it in the mornin'?\nAnd can I hit it in the mornin'?\nThe Sun risin' while you moanin', moanin', moan...\n\n[Intro to Nobody's Perfect]\n\n[Intro]\nHey!\nCole world\nFayettenam sing this shit!\n\n[Verse 1]\nYeah, this is for all the fans...\n[Crowd]\nThat waited, the bitch niggas that hated\nOld hoes we dated, look, Mama; we made it\n[Verse 1]\nYour son out in Barbados, cheese, eggs, and potatoes\nSmokin' weed on the beach as my mind workin' like- Hands up!\nAnalyzin' the world, fantasizin' 'bout girls\nI'm handin' diamonds and pearls, and vandalizin' her curls\nSweatin' her weave out, moans as she breathes out\nFuck I'm doin' in parties with Hova and Steve Stoute\nI step over piranha, death over dishonor\nThey killin' niggas for J's, that's death over designer\nHey, Cole heatin' up like that left-over lasagna\nRemember when I used to be stressed over D'wana\nNow a nigga only text and get stressed over Rihannas\nI'm talkin' tens and better, hood bitches in Timbs and sweaters\nAnd we always argue 'bout the same thing\nAnd tell me, why we gotta argue about the same thing, same thing\nSing!\n\n[Chorus: Missy Elliott, J. Cole and Crows]\nNobody's perfect, sing!\nNobody's perfect, ay ay, uh\nSay what?\nHey, but you're perfect for me\nNobody's perfect, uh (Ay, ay, ay)\nNobody's perfect, ay\nHey, right side, hands up\nHey, but you're perfect for me\nWe rollin', we ridin'\nHe like to go inside and\nI love to go all night and\nWe rock the boat: Poseidon\nI love to call your name, name, name\nYeah, baby, I love to call your name, name, name, eh", "image": "https://images.genius.com/6affcd514d0bc308d7761e9589cd9abc.1000x1000x1.jpg"}], "artist": "J. Cole"}