{"songs": [{"title": "House of Flying Daggers", "album": "Only Built 4 Cuban Linx... Pt. II", "year": "2009-08-23", "lyrics": "[Intro: Sample]\n\n[Hook: GZA]\nSoldiers in the front, let the heat pump\nTroops on the left, fight to the death\nFam on the right, infrared lights\nWolves in the back, ready to attack, for what\nSoldiers in the front, let the heat pump\n\n[Verse 1: Inspectah Deck]\nI pop off like a mobster boss, angel hair with the lobster sauce\nSummertime can't top the scorch\nCheck my hot broad, I dropped the Porsche\nFBI wanna watch the force, trying to lock my source\nWhere I'm from, hear the macs, techs, Glocks and fours\nHide the safe, nigga, lock the doors\nNo respect for the cops and laws\nIn the land where your own blood brother still plot for yours\nSeen things that'll drop your jaw\nMy soldiers got dropped in war\nSee the mural on the project wall?\nWon't stop til I copped them all\nWanna block me? You gots to brawl, trade shots and all\n'Cause I ain't on the clock for talk\nThe Spot Rusher, blow down the spot for sure\nStill break off the block with raw, my stock is more\nThe General, watch your board\n\n[Verse 2: Raekwon]\nDeep pockets with the eight on me, sleep with the safe in the wall\nThe camo's on with the make-up and all\nSwap six 45s, twist reefer in the flicks, papi whoadie ride\nBolt his gun off, from know your horse, she lied\nFly criteria, bury me in Africa\nWith whips and spears, and rough diamonds out of Syria\nA true don, only I could do wrong\nRock fitted hats, get crack money and drive a sick blue joint\nRetard-less, I'ma blow regardless\nResume is straight up live, I shank niggas up for larger Es\nAnd speak with the youth in the spot\nEat the fresh fruit in the crop; all these hip hoppers eat cock\nYou could see me in the street or the yacht\nI'd rather be promoting your block\nOr buying fresh sneakers with guaps\nYo, I'm an ill dude, always been a real dude\nDon't fuck around, I will spill on you and kill you in the field, boo\n\n[Hook 2X: GZA]\nSoldiers in the front, let the heat pump\nTroops on the left, fight to the death\nFam on the right, infrared lights\nWolves in the back, ready to attack, for what\nSoldiers in the front, let the heat pump\n\n[Verse 3: Ghostface Killah]\nLeather jackets on, rocked up rock stars\nTreacherous bank robbers, the plan go dub, we pop guards\nThe team gotta eat, seeds is hungry, that's why we ain't scared\nTo dump on niggas, our guns is chunky\nUsually we bust niggas down with bats, swell up they joints\nElbow, wrists, they shins get cracked\nWe still humiliate, brutalize, Ruger pop, pulverize\nStill got gear in the closet, that's stupid live\nFrom Benetton rugby skullies, Oshkosh conductor jumpers\nThe train hats fit me lovely\nRae job is to make sure the coke is fluffy\nWhile I politic his birthday bash with Puffy\nBagged Nia soon as I linked up, the kid ain't inked up\nI'm an old mummy, my gold weigh as much as King Tut (yeah, yeah)\nSlippers, robes is minked up, under the doorag, bro (uh, yo, yo)\nMy three dimensional fade is clean cut\n\n[Verse 4: Method Man]\nMan, y'all niggas ain't shit to us, still a pistol bust\nSplit your melon like I split the Dutch\nGot a lot of piff to puff, and I ain't come for fisticuffs\nOr for the cop that wanna clip the cuffs\nMan, is Staten in this bitch or what? Don't get it twisted, we...\nTwist it up and even mixed with dust\nSee these fans can't resist the rush, they Wu-Tang for life\nScarred for life, they can't forget the cuts\nGot a whole line of classic joints, and while you at it\nPass the joint, let's push this music past the point\nOf no return, til it crash and burn, down the ashes\nThen placed inside Ol' Dirty Bastard's urn\nWhen it's my time to go, for sure, ya nigga goes to war\nWhat you think I brought these soldiers for?\nTo send shot, like forget me not, at any nigga\nRespect, bitch, that figure they gon' get me got\n\n[Outro: Sample]\nHeheh, your basic kung fu's no good\nYou can't move fast enough!\nAnd you don't have enough strength!\nAnd your body movements are like a street fighter!\nIt's too easy for me to trip you up!\n(Fighting sounds)\nHeheh, how's it feel, eh?\nAh, it's no good! I feel my back's broken!\nHeheh, you've still got a lot to learn!", "image": "https://images.genius.com/2691e582dc2839478e49279288d69cb1.1000x1000x1.jpg"}], "artist": "Raekwon"}