{"songs": [{"title": "Young Forever (Live)", "album": "Live In Brooklyn", "year": "2012-01-01", "lyrics": "[JAY-Z]\nCan I get some light in here?\nCellphones in the air\n\n[Intro: Beyoncé]\nLet's dance in style, let's dance for a while\nHeaven can wait, we're only watching the stars\nHoping for the best but expecting the worst\nAre you gonna drop the bomb or not?\nLet us die young or let us live forever\nWe don't have the power, but we never say never\nSitting in a sandpit, life is a short trip\nThe music's for the sad man (sing)\n\n[Chorus: Beyoncé & JAY-Z]\nForever young\nI wanna be forever young (yes)\nDo you really want to live forever?(ah)\nForever and ever (sing)\nForever young (young) I wanna be (yes)\nForever young young ah\nDo you really want to live forever?\nForever, forever young\n\n[Verse 1: JAY-Z]\nSo we live a life like a video\nWhen the sun is always out and you never get old\nAnd the champagne's always cold\nAnd the music is always good\nAnd the pretty girls just happened to stop by in the hood\nAnd they hop their pretty ass up on the hood of that pretty ass car\nWithout a wrinkle in today 'cause there is no tomorrow\nJust some picture perfect day that last a whole lifetime\nAnd it never ends 'cause all we have to do is hit rewind\nSo lets just stay in the moment, smoke some weed, drink some wine\nReminisce, talk some shit, forever young is in your mind\nLeave a mark that can't erase, neither space nor time\nSo when the director yells cut we'll be fine, ah\n(Sing)\n\n[Chorus: Beyoncé & JAY-Z]\nForever young young I wanna be\n(Forever young) (yes)\nDo you really want to live forever? yeah\nForever and on top ever\nForever young I wanna be\n(Forever young) yeah, yeah\nDo you really want to live forever?\nForever and ever young\n\n[Verse 2: JAY-Z & Beyoncé]\nSlamming Bentley doors, hopping out of Porsche's\nPopping up on Forbes lists, gorgeous, hold up\nNiggas thought I lost it, they be talking more shit\nI be talking more shit, I'm nauseous, hold up\nI'll be here forever, you know I'm on my fall shit\nAnd I ain't waiting for closure, I will never forfeit\nLess than four bars, baby, bring the chorus in\nDid you get the picture yet I'm painting you a portrait\n\n[Chorus: Beyoncé & JAY-Z]\nForever young\nI wanna be forever young yeah, yeah\nDo you really want to live forever?\nAnd ever and ever\nForever young\nI wanna be forever young\nDo you really want to live forever?\nForever your time, sing!\n(Forever young I wanna be\nForever young\nDo you really want to live forever?\nForever and ever)\nOne more time, sing!\n(Forever young I wanna be\nForever young\nDo you really want to live forever?\nForever, forever young)\n\n[JAY-Z]\nMake some noise for Beyoncé one time Brooklyn\nI'mma leave you with this\nDon't be good, Brooklyn, be great\nBe great\nThank you for tonight, thank you for tonight\nI love you", "image": "https://images.genius.com/f934ed9204e87b2868c6fa0206e3219a.300x300x1.jpg"}], "artist": "JAY-Z"}