{"songs": [{"title": "Tha Heat", "album": "Tha Carter", "year": "2004-06-29", "lyrics": "[Lil Wayne talking]\nFuck with me, you know what it is\n\n[Hook] 2x\nI shoot your arm, leg, leg, arm, head\nThe heater burner bruisa is on my hip this year\nI shoot your arm, leg, leg, arm, head\nI wish a motherfucker would trip this year\n\n[Verse One]\nDressed in all black and my gun the same color\nMurder my enemy love thy brother\nAnd I ain't never gave a shit about a motherfucker\nHit him up and watch the guts come up out a youngin stomach\nYou niggas better take side with young money, Cash Money\nYou'll get left in your ride crash dummy\nI'll be around when the times get ugly\nWhen the wheels fall off and the tires stop running\nThe magazine empty and the nine stop busting\nI bang my fist till my palms get bloody\nCuz I'm a monsta man\nI'm gonna find you and my AP nine don't jam\nI'm a rider you can't take it out of me man\nI be wilding, you can wait by my house for me fam\nI will fire and drop a hater right where he stands\nI'ma die with this blazer right in these hands\n\n[Hook] 2x\nI shoot your arm, leg, leg, arm, head\nThe heater burner bruisa is on my hip this year\nI shoot your arm, leg, leg, arm, head\nI wish a motherfucker would trip this year\n\n[Verse 2]\nTwenty-two's, thirty-eight's, forty-four's, forty-five's\nTucked in my thirty-eight, mack on my back I am\nSo ready for whateva that awaits me\nRun up in your place while you're sleepin, awake thee\nCalicoes, ak's, Uzi-machines\nGot ya misplacin your arms and losin your knees\nI am takin names, so who wanna leave\nOut this bitch with your brains and your dew on your sleeve?\nI got the hood with the names of the crew on they t's\nAnd I might make a funeral sweep, I ain't bullshitin\nAR hit ya truck got ya hood flippin\nFeet by the engine, head by the transmission\nAnd I be right where I am mista\nMe and my damn pistol\nMe and my girlfriend\nIn this world alone, so bring it on\nAnd imma have to sing you this song nigga\n\n[Hook] 2x\nI shoot your arm, leg, leg, arm, head\nThe heater burner bruisa is on my hip this year\nI shoot your arm, leg, leg, arm, head\nI wish a motherfucker would trip this year\n\n[Verse 3]\nI got the scope on the tool I can see what you do\nWith a little red dot nigga peek-a-boo\nShhh the silence will speak to you\nHit you from across the street wile you tying ya shoe\nLike Bang! Bang! say breathe nigga breath I stand ova the body with the boy in his tee\nSay Bang! Bang! say breathe deep breath I stand ova the body with the boy in his chest...Clear!\nNow the boy is a mess and the block in fear cuz ya boy up and left\nLife is short enjoy what eva's left\nBefore you run into a nigga like me and meet death\nIn less than three seconds I'll pull a three-eighty\nThree feet from my waist\nThree inches from your face\nMake no mistake Weezy neva hesitate\nI'll pop till your shit separate like eewww!\n\n[Hook] 2x\nI shoot your arm, leg, leg, arm, head\nThe heater burner bruisa is on my hip this year\nI shoot your arm, leg, leg, arm, head\nI wish a motherfucker would trip this year", "image": "https://images.genius.com/423c90e7f232e6d83a86b2645ff72b5c.500x500x1.png"}], "artist": "Lil Wayne"}