{"songs": [{"title": "Starry Night", "album": "The Rose That Grew From Concrete Vol. 1", "year": "2000-11-21", "lyrics": "[Intro: Quincy Jones]\nStarry night.. an unknown creation\nWritten by, and from the archives of 2Pac Shakur\nDedicated to the memory of Vincent Van Gogh\nA creative heart obsessed with satisfying\nThis dorment and uncaring society\nYou have given them the stars at night\nAnd you have given them bountiful bouquets of sunflowers\nBut for you there's only contempt\nThough you pour yourself into that frame and present it so proudly\nThis world could not accept your masterpieces, from the heart\nSo on that starry night, you gave to us and you took away from us\nThe one thing we never acknowledged, your life..\n\n[Interlude: Mac Mall]\nYeah, game laid down by Q, you know what I'm saying?\nVocals by Rasheeda, fly beat by QDIII\nAnd flows by the M-A-C y'all, Mr. M-A-C Mall\n\n[Hook: Rasheeda]\nStarry night, your life\nYou gave to us, and took away from us\nStarry night, your life\nYou gave to us, and took away from us\n\n[Verse 1: Mac Mall]\nUhh, uhh.. watch me live my art; writing words from my soul in blood\nAnd speak the truth on every thing I love\nI'll probably sacrifice my life.. to send my message through mics\nIt's like a war drum calling soldiers at night\nIt's bigger than music I spit it straight from the heart\nSo it's cold and dark and deep like the universe, but nah don't start\nIt's for your entertainment but it's my life y'all\nAnd I can't rewind, fast forward, or press pause\nBut when you give your all, it's like the fans demand more\nAnd after the tour I sit alone like before\nWhen your name is hot it's all love, the world is yours\nBut when you fall off, you get ignored\n\n[Hook: Rasheeda]\nStarry night, your life\nYou gave to us, and took away from us\n\n[Verse 2: Mac Mall]\nYou on the cover of the magazine, flossing on the TV screen\nToasting with your champagne, playin life like a game\nLoaded in the limousine, love to hear the fans scream\nSwimming with the sharks now, ain't no love - money king\nPeople got they hands out but ain't nobody lending hands\nCan you really blame them for trying to get what they can?\nLate night, bright lights, lust and lies\nAnd anything goes under the Hollywood sign\nWell you might lose your soul and who knows what you'll find\nBut go ahead man we all want to shine...\nBut go ahead man we all want to shine...\n\n[Hook: Rasheeda]\nStarry night, your life\nYou gave to us, and took away from us\nStarry night, your life\nYou gave to us, and took away from us\n\n[Outro: Mac Mall]\nThere you have it..\nYou know, when I was younger I prayed, to get in this game\nYou know to hold this microphone in my hand\nI asked the man upstairs, to let me rock a crowd one day\nYou know let people out there feel the way I feel through my music\nLike my homeboy 2Pac did for sure\nAnd he gave that to me\nBut he didn't, he didn't, he didn't let me know\nAbout all the shady shit that's in, in between\nYou and your dream, you know?\nSee it's more than the music, I spit it from the heart\nSo sometime it's cold and it's dark, but it's raw\nAnd that's how I'mma bring it to you every time, you know?\n\n[Hook: Rasheeda]\nStarry night, your life\nYou gave to us, and took away from us\nStarry night, your life\nYou gave to us, and took away from us", "image": "https://images.genius.com/866e68770deafd17a70d2918c7819b81.817x1000x1.jpg"}], "artist": "2Pac"}