{"songs": [{"title": "Got it Twisted", "album": "Amerikaz Nightmare", "year": "2004-03-30", "lyrics": "[Havoc]\nYeah, nigga once again, we have M-O-B-B\nYo.. yo... ain't no party once we crash the party\nI'mma scoop shorty then vacate the party\nYou keep grillin I pump-pump the shotty\nPut you in the trunk then dump-dump the body\nNigga you don't know, you better ask somebody\nYa'll get down, we gonna clash probably\nPeel snowflake outta that Abercrombie\nI'm tryna grip Britney, so I made Jive sign me, nigga\nCatch me in the club with a double edge banger\nI'm the wrong one to fuck with\nNah I know the promoters I'm in with the musket\nPound of that haze and a box of Dutches\nHigh to the cottonmouth, paranoid\nMake the wrong move, bitch, and your ass is out\nLike M.O.P., nigga, I'll mash you out\nIf I can't get you here, swing by your house, muthafucka\n\n[Hook: Havoc]\nYa'll niggas got it twisted, huh?\nThat liquor up into to you, charged\nThat truth come out when you drunk\nYour ass won't make it to see tomorrow\nYa'll niggas got it twisted, huh?\nThat liquor up into you, charged\nThat truth come out when you drunk\nYour ass won't make it to see tomorrow\nWe step up in the club with one thing\nOn our mind, that's leave with something\nGet rid of that ring, get rid of those cuffs\nWe about to... girl\nWe about to... girl\nWe about to... girl-girl\nWe about to... girl\nWe about to... girl-girl\n\n[Prodigy]\nParty over here, ain't shit over there\nThem Mobb Deep boys got it locked right here\nWherever we at we keep the blix right there\nSo wherever there's beef, it's gettin fixed right there\nAnd they can't stop us...they too scared\nThey know our caliber of thugs shoot at heads, nigga\nQB drop you off of that bridge\nShow you how we do it in Queens where murder ain't shit, nigga\nThis is P talkin, show you where I live\nYou can come right to my crib and get it for shiz\nYou bein manslaughtered, right in front of my kids\nA little blood get on my daughter, it's nothing, she'll live\nGot cops shook to death of us...we don't like D's\nYou never catch us runnin with the police\nYa'll niggas get your vest-es up\nAnd ya'll better invest in some real heavy bullet-proof paneling\n\n[Hook: Havoc]\nYa'll niggas got it twisted, huh?\nThat liquor up into to you, charged\nThat truth come out when you drunk\nYour ass won't make it to see tomorrow\nYa'll niggas got it twisted, huh?\nThat liquor up into you, charged\nThat truth come out when you drunk\nYour ass won't make it to see tomorrow\nWe step up in the club with one thing\nOn our mind, that's leave with something\nGet rid of that ring, get rid of those cuffs\nWe about to... girl\nWe about to... girl\nWe about to... girl-girl\nWe about to... girl\nWe about to... girl-girl", "image": "https://images.genius.com/b2028bc5336e13af3d91919e570f79e6.1000x1000x1.jpg"}], "artist": "Mobb Deep"}