{"songs": [{"title": "Over It", "album": "Strangeulation", "year": "2014-03-13", "lyrics": "[Intro]\nNo matter what way the fans receive music\nWe at Strange Music\nWill be right there in it\nAll those streaming services make it nearly impossible for artist to make some real bread\nWe will prevail and take over all facets of the music industry\n\n[Hook: Ryan Bradley]\nAll of us are over it\nSo we're takin' over it\nSo cold the shoulder gets\n'Cause we're over it, over it\nSo we're takin' over it\n\n[Verse 1: Tech N9ne]\nTime's up, I'm just\nGonna make it difficult for other rappers to get they rhymes up\nN9ne's a mindfuck, I'm the kind to\nDesign the crime, bury them all in lime, your shine's behind us\nStop, you could do it all day\nBut you're not gonna pop me the crew and all lay\nIn the box, you were topping the charts\nLook at the people not even jockin' your art\nWhy's that? 'Cause everybody that really buys rap\nDon't wanna listen to any guys yap\nFly! This'll leave you in the sky cap (ahoo!)\nThree X, we test the best\nReflect 'cause you're 'bout to go see death\nAnd the killer gonna be Tech, he next\nAll the people never gonna re-elect such a reject\nWhen I spit vital with this title\nYou sit idle like Seacrest, we over it\n\n[Hook]\nAll of us are over it\nSo we're takin' over it\nSo cold the shoulder gets\n'Cause we're over it, over it\nSo we're takin' over it\n\n[Verse 2: Tech N9ne]\nBetter pray that they want to come see your show\nThat right there gonna be your dough\nYou fizzin' out and we want more, we gon' blow\nThem all away then haul away\nThe raw decay then y'all will say \"we don't know\"\nThe K.O.D'll spray the fraud away\nMake it a holiday, see killin' when he don't flow\nI’m enhanced and polished\nAll of the women, they wanna dance and frolic\nYou was a winner with lotta grands in pockets\nNow you get rants and audits\nWe bored wit'cha, quick to hit ya with the war whip\nThe scripture mister, Forbes lister\nBigger figure from a poor nigga!\nA lot of y'all names I could say\nIf I was evil, I really would Sway\nBut I was taught to not be no punk\nAnd don't pull no punches, my hood say\nBut since y'all actin' like Biancas and Beatrices\nI should say, your last album was everywhere\nAnd I don't mean that in a good way, we over it\n\n[Hook]\nAll of us are over it\nSo we're takin' over it\nSo cold the shoulder gets\n'Cause we're over it, over it\nSo we're takin' over it\n\n[Bridge: Tech N9ne]\nYou can rap all you want and sing\nBut I'm runnin' things\nI'm forever, makes you wanna scream\n'Cause I'm the one and king\n\n[Verse 3: Tech N9ne]\nDon't be devastated due to my dialect\nDummies down declining due to die in debt, die in debt\nWhen you wake and wonder why you wide and wet\nWicked whispers whiskin' away you, why invest? Why invest?\nAin't no competition so get violent\nAin't expectin' nothin' but ya silence, silence\nSo fly your noggin, I can be the fucking pilot\nI know you know my number you can dial it, dial it\nYou got to know by now that I'm really unstoppable\nTry now, you'll be silly in a hospital\nLie down, got the pilly and I lock and load\nI'm takin' everything, breakin' everything you'll spit\nThis ain't nothin' to me, child's play\nThat's why I'm takin' over this (Bullshit!)\n\n[Hook]\nAll of us are over it\nSo we're takin' over it\nSo cold the shoulder gets\n'Cause we're over it, over it\nSo we're takin' over it", "image": "https://images.genius.com/a97c6b9421fc6142eef43b7f37277096.500x501x1.jpg"}], "artist": "Tech N9ne"}