{"songs": [{"title": "Cocaine World", "album": "House of Wax: The Vatican Mixtape, Vol. 3", "year": "2007-09-29", "lyrics": "[Intro: Raekwon]\nYo, son, see the police over there\nHey Kendrick! (Hey Fred)\nWould you mind, and telling them meet me by the car\nCall another station and tell them to send a couple more of cars\nI got Jerry, I got you...\nOne of them got a dick in they mouth\nHood is fucking crazy\nI see about forty dollars on the floor...\nI know somebody know something man\nFucking pricks be standing around and don't be acting\nLike you don't know, tell us what's going on\nGet the fuck outta here...\n\n[Raekwon]\nYo, aiyo, couldn't believe what happened to Steve\nThey found him in the grass, butt ass naked, tied up, it's freezing\nThe D's knew, flew him to the south, had 'em in the barn\nArm all shredded out, vex, forget about it\nHis lady, Baby Blue Eye, she kept a mack in the refrigerator\nYelling how she hate me with eyes, when they bumped her\nFound a Louis bag in the dumpster\nNew blue uzi that ripped her fronts up\nShe leaning, I start dreaming, damn\nNiggas shot shorty in the mouth, then slid in the Lamborghini\nEight days later, they weight her, found heroin\nAll in the bitch arm, trick from decarter\nHer girl durell nails, nigga, that's who you could say tell\nAnything and everything, the nigga's in the jail, yo\nFor Filas, she need, need, come to, to cry\nThis a live bitch from the east, fronting since junior high\nBut let's continue to peep it, Steve, the nigga been through\nMad situations, since he crashed his Benz station\nAll the FBI and 'em, hide 'em\nWaiting for the right time to blow a nine, right through a spine\nThe grind was getting serious, the coke scarce\nOnly niggas who live can get it, if they gun game fierce\nI was in the cut lamping, yeah, watching how it went down\nI'm fronting, knowing this is not my town, that's wild\n\n[Outro: Raekwon]\nAiyo, Chef, when that Cuban 2 coming out\nYo, man.. it's coming out when I want it come out, man\nYa'll niggas just sit back and get ready for it, man\nCuz it's some real motion picture shit, knowhatimsaying?\nStraight up, the date is the date\nIt's coming when I tell it to come\nSo all ya'll niggas that want to know\nYeah, we going into a very serious Chamber right now\nIt's the Cocaine World, I'mma do my numbers\nIt's all real nigga, this is not slavery\nNot over here, aight? So you just walk down the block, man\nAnd go to church or something, man, knowhatimsaying?\nCuz when I come with this flame, nigga\nAll lights is out, for everything, man\nTrust me, I know ya'll niggas need me\nHahaha.. ya'll niggas gon' need me\nWhen I come through, I spit in niggas hands\nYouknowhatimsaying? Straight up, stepping on ya sneakers\nFucking puppets... ya'll niggas is slave workers, man\nWatch what we do, you know?\nIf you need to get some of this, you know\nYou can shoot over to 225 Hudson\nOr you can meet me in Africa\nI just bought a crib out there, you heard?\nNice little hut, luxury hut, nigga\nMuthafucking bed made of hay, nigga\nTied up with gold yarn... ya'll niggas is soft, man\nFor real, man, New York\nI'm throwing ya'll niggas on my back\nRemember what I said...", "image": "https://images.genius.com/258ddd2b01af2188dd6ee5363048d09d.820x820x1.jpg"}], "artist": "Raekwon"}