{"songs": [{"title": "Roman’s Revenge 2.0", "album": "Pink Friday", "year": "2011-01-19", "lyrics": "[Verse 1: Nicki Minaj, \"Roman Zolanski\"]\nI am not Jasmine, I am Aladdin\nSo far ahead, these bums is lagging\nSee me in that new thing, bums is gagging\nI'm starting to feel like a dungeon dragon\nRaah, raah, like a dungeon dragon\nI'm starting to feel like a dungeon dragon\nLook at my show footage, how these girls be spazzin'\nSo fuck I look like getting back to a has-been\nYeah, I said it, has-been, hang it up, flatscreen\nPlasma, hey Nicki, hey Nicki, asthma\nI got the pumps, it ain't got medicine\nI got bars, sentencing\nI'm a bad bitch, I'm a cunt\nAnd I'll kick that ho, punt\nForced trauma, blunt\nYou play the back, bitch, I'm in the front\nYou need a job, this ain't cutting it\nNicki Minaj is who you ain't fucking with\nYou lil' Fraggle Rock, I beat you with a pad-a-lock\nI am a movie, camera block\nYou outta work, I know it's tough\nBut enough is enough\n\n[Hook: Nicki Minaj]\nRaah, raah, like a dungeon dragon\nRaah, raah, raah, like a dungeon dragon\nRaah, raah, raah, like a dungeon dragon\nLike a dungeon dragon, like a dungeon dragon\n\n[Verse 2: Lil Wayne]\nI eat your face off\nYou niggas sweet as pie like this is a bake-off\nI love Nicki's curves, swing at the baseball!\n(Skrr!) I'll beat your brakes off\nHi, I'm Tune, salt in the wound\nI'm up in this bitch - pardon the goons!\nThrow dirt on the floor get caught in the broom\nI like a big wet pussy with a fork and a spoon\nI got the money and the power, a woman in the shower\nAnd she don't want nothing but my Johnson - Howard\nSour Dies in the Swisher Sweet - sweet and sour\nYou're scared? Go to church, say your prayers, read a Bible\nAh! I don't know what y'all on - please\nI go in like \"goin\"\nDrink in my hand with the world in the other\nThe Uzi go \"brrrr\" - stutter\nLife is a puzzle - jigsaw\nAll I do is win - my name should be \"Victor\"\nHaha! Old-ass rappers\nI'm still the shit! Old-ass Pampers\nRaah, raah, like a dungeon dragon\nFoie gras, I hear you ducks is quackin\nI was just dumpin my ashes, I'mma puff it and pass it\nI'm a fuckin assassin, you should jump in the casket!\n\n[Hook: Nicki Minaj]\nRaah, raah, like a dungeon dragon\nRaah, raah, raah, like a dungeon dragon\nRaah, raah, raah, like a dungeon dragon\nLike a dungeon dragon, like a dungeon dragon\n\n[Verse 3: Nicki Minaj]\nIs this the thanks that I get for putting you bitches on?\nIs it my fault that all of you bitches gone?\nShoulda sent a thank-you note, you little ho\nNow I'mma wrap your coffin with a bow\n\"Nicki, she's just mad cause you took the spot\"\nWord, that bitch mad cause I took the spot?\nWell, bitch, if you ain't shitting, then get off the pot\nGot some niggas out in Brooklyn that'll off your top\nI hear them mumbling, I hear the cackling\nI got 'em scared, shook, panicking\nOverseas, church, Vatican\nYou at a standstill, mannequin\nYou wanna sleep on me? Overnight?\nI'm the motherfucking boss, overwrite\nAnd when I pull up, vroom, motorbike\nNow all my niggas getting buck, overbite\nI see them dusty-ass Filas, Levi's\nRaggedy Ann, holes in your knee-highs\nI call the play, now do you see why?\nThese bitches calling me Manning Eli\nManning Eli, these bitches calling me Manning Eli!!", "image": "https://images.genius.com/44a8be97aef4cdd5114bd6cec02b2357.1000x1000x1.png"}], "artist": "Nicki Minaj"}