{"songs": [{"title": "Fuck You (Lab Rat Remix)", "album": "Off The Wall", "year": null, "lyrics": "[Verse]:\n\nMet a retarded kid named Greg with a wooden leg\nSmashed him over the fucking head with a peg\nGo to bed with the keg, wake up with a 40 mixed up with formula 4D\nFuck a acid tab, I strap the whole sheet to my forehead\nWait till it absorbed in then I fell to the floor dead\nNo more, case closed end of discussion\nI'm blowing up like spontaneous human combustion\nLeave you in the aftermath of Holocaust and traumas\nAcross the the bombers, we blowin' up your house\nKilling your parents, and coming back to get for mamas\nAnd I'm as good as keeping a promise as ??\nI ain't making no more threats. I'm doing drive by's in tinted corvettes like Vietnam war vets. I'm more a less sick in the head. Maybe more cuz I smoked cracked today, yesterday, and the day before. Sabadore walked the block with a labadore. Strapping more calaphawar than Al Salvador. Foul stou galore. Verbal calmaneur, coming together like a eyebrow on the shore. I'm the illest rapper to hold a corless. on the corner, looking for hookers to punch in the mouth for a roll of quarters. I'm meaner than with action beating James Senior, smacking his back with vacuum cleaner attachments. I grew up in a wild hood, was a hazardous youth. With a fucked up childhood that I use as an excuse. That made shit change when I kept the same mindstate since the 3rd time I failed 9th grade. You prolly think that i'm a negative person. Don't be so sure of it. I don't promote violence, I just encourage it. i'm inept with the sight of death, cuz I fall down a cement flight of steps and land inside a bed of spider webs. Throw cautions in the wind, you and a friend can jump off a bridge and if you live do it again. Shit why not! Blow your brain out. I'm blowing mine out, fuck it. You only live once, you might as well die now!\n\nVerse 2 [Dr. Dre]:\n\nI squat like a blunts tips, something cavi, making green like minch. gift rap vocals dispatch. with every attempt I had, this game shook up when dre took up. Every thug look up.  Got me on chill. eyes bloodshot every pill. Lay a nigga out like quill. clear the guilt! I rock corollas from low riders to henny toasters. cut off dead weight to own formulas culture, expect no invitation. Dre losing his stack. limits chances, and getting his black fan back. My reputation is like a tech nine. I got the best in the circle. three endless wrektime. see it faster than the eye can chase it. Dre be real, they just got potential they not activated. no illusion I have you caught up in a rapture. executive decisions, from the motha fucking!", "image": "https://images.genius.com/ac33929e6a8fb0324648e8eb9ba496b0.715x715x1.jpg"}], "artist": "Eminem"}