{"songs": [{"title": "Uptown", "album": null, "year": "2011-01-01", "lyrics": "[Hook: Lil Wayne]\nI'm so uptown\nAnd mothafucka if you ain't, don't go uptown, yeah\n\n[Verse 1: A$AP Rocky]\nA$AP, where my crew at\nSwag so sick where the birds caught the flu at\nAll the hoes know me, don't need to ask, \"Who that?\"\nOr where the heat at, my nigga, cause we do that\nAnd pistol popping get it popping, niggas better move that\nCause we get a Glock and with the stock and he ain't scared to shoot it like\n4 G's: blew that, G4: flew that\nI'm the shit, you must admit, true that\nI'm so uptown\nNiggas know we get it for the low uptown\nGold, got 'dro, got snow uptown\nBitch-shit niggas scared to go uptown\nMoney making Manhattan, whip game proper\nThem might be the product of the locker\nA$AP, know I'm gonna prosper\nDon’t care, cause I'm only straight as my posture\n\n[Hook]\n\n[Verse 2: A$AP Nast]\nBoom, nigga, Nast in the house\nFlow like a drug, pass it around\nFag, you're in doubt, what you rapping about?\nA$AP nigga, trash on the couch\nGlass to the mouth, Patrón in the system\nTool on the waist just in case I gotta fix 'em\nBullets like fiends just dying to hit them\nNigga did I mention, swag house nigga\nGet slapped in your shit if you badmouth nigga\nLeft the Range in the garage and brought the Jag out, nigga\nNast be the shit that you brag about, nigga\nI ain't even tryna hear about your hereabouts, nigga\nWeird-ass nigga, scared-ass nigga\nI'm done with this track, did you hear that, nigga?\n(?) and I did wrap niggas\nTry to step on my throne? Bitch, this is my home\n\n[Hook]\n\n[Verse 3: A$AP Twelvyy]\nI'm a uptown blood slime, balling's in my blood line\nPants sagging real low, I'm running from the one time\nFree Church boy, yeah, my nigga caught a gun crime\nMobbing on Lenox and I'm grinding 'til the sunrise\nI'm really getting dope, boy, free my nigga Dough boy\nCatch me on Broadway, we got it for the low, boy\nAnd I got flow, boy, in other words, hoes, boy\nBody after body, yeah, you already know boy\nI'm bumping \"Oh Boy\", classic Harlem shit\nTrue Religion, who you kidding? Nigga started this\nYoung Twelv' get it gang, got the hardest shit\nPolo down to the socks, looking marvelous\nI'm from the home of the free S\nI'm Grade on the West like I'm Gucci on the ES\nAura like GS, stepping out the GX\nA$AP up, y'all niggas kill me with the BS... P.S.:\n\n[Hook]", "image": "https://images.genius.com/5ff1cf6959ea5afde5004b68062591ff.500x500x1.jpg"}], "artist": "A$AP Rocky"}