{"songs": [{"title": "Fire in the Booth", "album": null, "year": "2018-07-14", "lyrics": "[Intro: Drake & Charlie Sloth]\nYeah\nI been waiting on this one Charlie, for real\nI've been waitin' Driz\nI've been waitin', let's get 'em bro\nNah, for real\nShout out Boi-1da too\nMm, I like that\nLet's get 'em Driz\nYou don't have a drink, you're not drinking or what?\nI got a drink bro\nHahahaha, I like that\nI got my drink right here. Cheers my bro\nToast up man\nYeah, okay, yeah\n\n[Verse 1: Drake]\nGoldman Sachs, they wanna hold my racks\nHedge fund investors talk to Adel like he the expert\nI hear it in they tone when they address him\nWe way too connected\nTom Ford assistant texted asking if I want classic or double breasted\nI flex with broad shoulders\nWhen I walk through the halls they move over\nStories of how we handle ours start to travel like a lone soldier\nI told you\nYou hold your girl the same way that I hold composure\nOr hold the wheel of the Fuji white Rover\nSilverstein dinners, all kosher\nNever rushin'\nMy niggas really made somethin' from nothin'\nDodge sentences like they don't wanna discuss it, change subject\nGot the Benny Yang chains rubbin', never tucked in\nWaiting to inhale\nThings that I own will sell at auction as proof we did well\nMy house museum-scale\nThe only skeletons here are the ones from the nights I raised hell\nMake sure the staff are paid well\nMake 'em think twice 'bout the stories that they tell\nNo one knows when the plan is hatchin'\nI'ma let 'em walk on eggshells\nTiptoe, niggas better know\n\n[Interlude: Drake & Charlie Sloth]\nWow, man like Drizzy Drake!\nYeah\nGot his foot on your neck man\nWhat time is it? What time is it? It's like two in the morning right now\nYeah, well it's real late over here\nIt's me and Charlie, that's it, you hear me? We got the whole building to ourselves\nWe got the building. Kill them again, kill them again Driz, kill them!\n\n[Verse 2: Drake]\nY'all keepin' the score while watchin' me score\nY'all keep the awards, I'll take the rewards\nIf y'all goin' for fun, I'll stay and record\nBut if y'all goin' to war I'm there for sure\nWouldn't miss it\nI'm living next to Michael, Bobby, Ralph, Johnny\nMy neighbors soundin' like New Edition\nThat's these guys\nUs guys don't wear New Balance or Levi's\nKey West retirement plan\nGrippin' the Callaway club in my hand\nHittin' balls off of the balcony into the sand\nTryna see where they land\nOctober Firm the new chain of command\nEl chico, this verse is the explanation for the large ego\n100 mill' hands free like Ronaldinho\nI go from Star to Venetian in a small speedboat with girls we know\nTake your pick, Brooke or Tanya\nBoth those shorties'd leave their GPS on so I can find ya\nDrop location\nSpring break trips, I'm in hot rotation\nI took a lot of my brothers from B and E licks or the pot rotation\nTo ridin' shotgun in a Picasso painting\nTricks up sleeves, have 'em playin' innocent to get the shits I need\nLoyalty is priceless to me and this I see\nBefore I ever seen this shit tatted on P and tatted on C and tatted on me\nI speak truth and get to shatterin' dreams\nSo it's best to tiptoe, niggas better know, yeah\n\n[Outro: Drake & Charlie Sloth]\nDrizzy Drake! You're an animal Drake! You already know that you an animal bruh! Animal!\nI'm saucy!\nSaucy! You just stepped out of the club straight into the booth like it's light. Tear up the ting in one take!\nShowed up for you, you know what I'm sayin'?\nMy brother Drizzy\nMy brother, you already know\nWow. And you know what it's like. You stepped out the club into the booth to prove to everyone why you number one bro. Why you got your foot on their necks!\nNah for real. I stepped in here, SN1, OVO, Fire in the Booth, Charlie Sloth. Come on. The official. I rock with the official. I'm on official ting, you know what it is man. Come on, come on\nAyy bro, it feels like that's another moment there, you know what? Like, I got to say this to you on the real bro. The way that you've embraced British culture will be remembered forever. And the UK love you. The real G's over here, you know that bro. When you go to your parties, you see who's in your parties\nNah, you know what it is, of course\nIt's the certies\nNah, listen, but listen. It's a family and it's a big family, you know what it is. I'm just happy to be home, like I said man\nMy brother, man. Foot on neck time\nYo, are these guys dumb? You see the big man Charlie too, oh my goodness\nMy brother Drizzy. I can hear these rappers' prayers man\nNah, I'm heated for you right now\nThey're like, \"Yo, please tell Drizzy to take his foot off my neck!\"\nNah, I'm heated right now man, oh my goodness. Shout out French Montana, my brother, you know what I'm sayin'? The big wave, yeah. Shout out Huncho, Quavo. Shout out Offset, blessings on the new ting. Oh my goodness. Shout out, yo–. I could go for hours. Charlie, come on man\nAyy, you could go for hours. I was at your party the other night, I've seen who was there. I'm like, \"Woah!\" There's a lot of people, there was a lot of faces in that party\nNah, I don't wanna hear no chat for the whole 18 about Charlie Sloth. Are you dumb? Alright. Jheeze, jheeze\nAnd that right there: one take. A real moment right there\nYeah, jhee!\nAnd that's Fire in the Booth my guy!\nAnd I'll be back January-February part two, you know what time it is. Come on!\nOkay, okay\nShout out all the G's too, man. Shout out all the artists man. Everybody from here doin' their thing. I'm telling you. Big inspiration. London, England, come on man\nCome on! You know I've applied for your passport, right?\nHahaha. I need that", "image": "https://images.genius.com/e27e2c5eb87eba5bf96dc1d468a9666e.480x360x1.jpg"}], "artist": "Drake"}