{"songs": [{"title": "Outta Here", "album": "Return of the Boom Bap", "year": "1993-09-28", "lyrics": "[Intro]\n\"Boogie Down was performing, hey they ain't no joke\"\n\"Down with the sound called B-D-P\"\n\n[Verse 1: KRS-ONE]\nBack in the days I knew rap would never die\nI used to listen to Awesome-2 on WHBI\nI used to hear all kind of rap groups before sampling loops\nRappers wore bell-bottom Lee suits\nMe and Kenny couldn't afford that\nSo we would go to the park when they was jammin' to hear rap\nI used to listen till the cops broke it up\nI always thought to myself \"Damn, why they fucked it up?\"\nBut nevertheless I was in love with the microphone\nAnd it stayed that way until I left home\nOn the streets of New York, now I'm free\nBut with freedom comes big responsibility\nI used to walk around driven by the force\nI remember how large Super Rhymes was when he fell off\nI used to wonder about crews that used to rock\nThey were large, but none of them could manage to stay on top\n\n[Bridge: KRS-ONE]\nDo you ever think about when you outta here?\nRecord deal and video outta here?\nMercedes Benz and Range Rover outta here?\nNo doubt BDP is old school, but we ain't goin' out!\n\n[Verse 2: KRS-ONE]\nAfter livin' on the streets alone\nSome years went by, I signed myself into a group home\nI used to watch the show \"I Dream of Jeannie\"\nAnd dreamt about \"When will I be large like Whodini?\"\nBut I was messin' with graffiti on the subway\nAnd gettin' chased by the cops almost everyday\nI knew it had to bea better way see\nSo I would go to my room, blast RUN DMC\nAround 1984 I left the group home, again alone\nStill dreamin' about the microphone\nGimme a chance man, I know I can rock it\nBut I had to worry about puttin' money in my pocket\nSo when I reached the shelter I met my helper DJ Scott La Rock\nAnd we both loved hip-hop\nI was takin' suckas out in the shelter system\nYeah there was rappers in the shelter but I had to diss 'em\nBut all along, my vision was never lost\nI kept seeing all these rap groups fallin' off\n\n[Bridge: KRS-ONE]\nDo you ever think about when you're outta here?\nFly girl and fresh gear outta here?\nFive-thousand dollar love seat outta here?\nNo doubt BDP is old school, but we ain't goin' out!\n\n[Verse 3: KRS-ONE]\nWhile I'm battling these rival crews\nYes, BDP would stay in the Street News\nSome said, All they wanna do is battle\nThey can't write a song, so their careers won't last long!\nAround this time I used to hang with Ced Gee\nAnd DJ Scott La Rock used to buy gold with Eric B\nI didn't meet Rakim till later with Scott\nI remember we were jammin' at the rooftop\nIt used to irk me when these critics had opinions\nScott would say \"Just keep rappin', I'll keep spinnin'\"\nWe had a fucked up contract, but we signed it\nAnd dropped the hip-hop album Criminal Minded\nWe told the critics your opinions are bull\nSame time Eric B and Rakim dropped Paid in Full\nHip-hop pioneers we didn't ask to be\nBut right then hip-hop changed drastically\nPeople didn't wanna hear the old rap sound\nWe started samplin' beats by James Brown\nIn the middle of doin' \"My Philosophy\"\nScott was killed and that shit got to me\nBut knowin' the laws of life and death\nI knew his breath, was one with my breath\nI had nothin' left and it was scary\nSo I dropped By All Means Necessary\nAnother hip-hop group that was a friend of me\nWas a revolution crew called Public Enemy\nIt Takes A Nation of Millions to Hold Us Back\nThese two albums set off consciousness in rap\nBut all along, I'm still lookin' around\nAnd all I can see are these rap groups fallin' down\n\n[Outro]\nDo you ever think about when you outta here?\nCondominium and beach house outta here?\nCredit cards and bank accounts outta here?\nNo doubt BDP is old school, be we ain't goin' out!", "image": "https://images.genius.com/cc761a78fd0527e3099606db60c959f9.600x600x1.jpg"}], "artist": "KRS-One"}