{"songs": [{"title": "Untitled A.K.A. Change the Beat (Bonus Track)", "album": "Vaudeville Villain", "year": "2003-09-16", "lyrics": "[Part I]\n\n[Intro: Samples]\n\"And so—Viktor Vaughn hid from the world—\"\n\"A fascinating story, but it changes nothing.\"\n\n[Interlude: Thunderstorm]\n\n[Outro]\nOh, oooh\nNah, dude—change that beat\nThat's a'ight, but—the other shit—other shit was iller\n\n[Part II]\n\n[Intro]\nWord, word\nYeah, that shit is dope right there\n\n[Verse 1]\nA modern day marvel, but terrible—better—horrible\nWhen he grab the mic from son, he crushed up all his metacarpals\nHe said he ain't mean it—totally by accident\nAfter the show, he didn't follow where y'all taxi went\nWill this be available on wax? Ask Max Mill\nThey on the opposition to his ass-wack tax bill\nBut will it pass the senate? Slum lord tenant\nAnd super like 1-A, have a fun stay\nOne day, he plan to put in a runway\nWith enough land for his own projects and gun play\nSection 8 penthouse, maid look like Faye Dunaway\nAlotta y'all ass out like gay runaways\nIt's how they say \"semi-risque\"\nAll day everyday, give out Emmy's the quick way\nHave the average MC say, \"Gimme a sick day!\"\nThey really ain't got shit to say like Timmy McVeigh\nGet a hunch, a real rag tag bunch\nIn school, he kept a doo-rag in his bag lunch\nJust to eat heads on some breakdance shit and spit\nHe writ this skit in Sanskrit\nIf the pants fit, sport 'em, but rock 'em low\nYour man like Rollo on the slow, can't knock it though\nIt's like the same hustle, bro, two knuckles glow\nTucked-in Le Tigre—just let the name-buckle show\n\n[Part III]\n\n[Verse 2]\nGood googly moogly—see that loogie?\nYeah—but keep it on the D.L. Hughley\nYou don't watch her, he might house her like Doogie\nJust to cut her loosie like, *swoosh*—Mitsurugi\nGooey gum drops—who he got his style from?\n—his pops—you gotta give the bum some props\nAsk ya sister—her beat box is more-thicker\nDOOM that nigga detox with more liquor\n\n[Part IV]\n\n[Verse 3]\nVillain for hire—admire the sound\nMake sure the price is right before he come on down!\nRappers be on some \"You, you, you!\"\nForgot who they talking too, too much pork stew\nThey need to not come out with nothing new\nBlew the whole shit up on some \"What this button do?\"\nDoom cheat the game like walk-thru\nRun 'em, son 'em like Mr. Rourke do Tattoo\nThe way alotta clowns get down is unnatural\nThis flow flip like oranges, apples\nRhymes like limes to a Lemonade Snapple\nLeave her at the chapel, don't eat scrapple\nFirst thing they notice when they come to is they bling is gone\nThen they start remembering the Klingon with the rings on\nIn came the Villain with their own gear like, \"Hi, there\nY'all play the rear, this whole year—my year.\"\nMetal face beard like Brillo pad\nY'all know his steelo so don't feel so bad\nSeed call him, \"Ol' dad,\" the one the ol' ho had\nKnew he was a winner since a swimmer in the gonads\nOkay pal, pay him like Paypal\nSo we could be A-OK not OK Corral\nI think today I'll make the ladies say, \"Ow\"\nAnd maybe fuck around take a bow, now\n\n[Part V]\n\n[Verse 4]\nWho made his first mill and still carry razor blades\nUsed to be straight A's and still made the grade\n'Tarded ass, how he get cash so fast?\nYear after last, left back in the retarded class\nShoulda went to Boces\nWatch him all closely, who he think he supposed to be\nVillain who always win, at least he stay consistent\nFind out where that bitch went, get a room, pitch a tent\nYo—yo, Max—yo, change the beat, yo\nYou got another one?\n\n[Part VI]\n\n[Outro]\nNah, yo", "image": "https://images.genius.com/b14b829f43b59a726bafa07feff716bd.1000x1000x1.jpg"}], "artist": "MF DOOM"}