{"songs": [{"title": "My Skin is My Sin", "album": "Bootlegs & B-Sides", "year": "1994-11-22", "lyrics": "* Originally appeared as a B-side to Cube's \"Really Doe\" single\n\nMotherfucker, you'd better break yourself...\n\n[Ice Cube]\nMy skin is my sin, look at my complexion\nSection 8, erection great\nBalls like Ru Paul and a big fat plank\nGet you higher than a Spike Lee joint\nSee I'm a chicken hawk and I'm hunting chicken and watermelon\nIt ain't nothing but hard time bailing\nJust got a misdomener\nCause I got a deuce-five, and I'm black as Sarafina\nGet the hell out Somolia, we didn't call y'all\nI can't wait till I can kill all y'all\nFuck Reggie Denton and Jimmy (Johnny) Cochran\nDamn I couldn't get close enough to sock him\nI plead guilty your honor\nCause I dissed the Pope more times than Sinead O'Connor\nHuh huh, cool, like Butthead and Beavis\nTruer than the Mack but I'm downer than he is\nAnd that police chief named Willie\nCan take his motherfucking ass back to Philly\nDropped a bomb on a crew named \"Move\"\nYears ago, here's a ho\nThat's ready to stop me, they think I'm Khadafi\nRolling in a six-tre jalopy\nThey want to give me ten in the pen cause I'm smelling like Hen\nMy skin is my sin\n\nMy S-K-I-N is my S-I-N (\"Burning our black skin\") (Repeat 2x)\n\n[Ice Cube]\nI Get Around like 2Pac, just bought a new Glock\nAnd I want what you got\nSo please give it up so I can live it up\nJust like the rich but I still eat grits\nI don't know karate\nBut I can still beat the dog shit out of Nazis\nYou claim you want to put in work\nPlotting to blow up a church\nSee you devils are all the same\nYou'll gun down a congregation in Jesus' name\nUsing me as a scapegoat, well cracker don't sleep\nFar from a goat, more like a black sheep\nLamb of God, and it's odd\nThat Allah is a man that don't need a tan\nAnd you can't stand when I talk like that\nAnd why do black men have to walk like that?\nCause we swing low like a chariot\nAnd now I got Harriet all on my dick\nCause my shoe size is much bigger than a motherfucking 10\nMy skin is my sin\n\nMy S-K-I-N is my S-I-N (\"Burning our black skin\") (Repeat 2x)\n\n[W.C.]\nWho's that janky-ass nigga with last?\nStanding like a G pissing on America's flag\nDub C, the nigga from Westside\nWestide Maad Circle bailing with a double barrel\nCause uh, my skin is my sin\nAnd all I need is knowledge of self and ammunition is my best friend\nWhen it's time to roll nigga, we ain't calling on Jesus\nI'm calling Mad Dog for the 9 millimeters\nCause I give the song with those peckerwoods to the fullest\nAnd a bitch by the name of America's on it\nThe same bitch that jacked my forefathers\nAnd the Indians took my motherfucking religion\nPlace a holy Bible in my hand, but for what?\nLike Jim Kelly said, \"You try to set me up?\" Shit...\nI'm too slick for your lies in disguise\nWhen will you devils open your eyes and realize?\nLike Pepsi, niggas got a new generation\nAnd we don't want your American education\nAin't no brain washing this way\nFuck America, Tom Meztger, and KKK\nAnd to the cracker named J.B. Stoner\nDon't let me catch you on no corners\nI see you on TV talking more shit\nBut just like your punk-ass anscestors, you's a bitch\nYou's a bitch if I ever saw one\nGrand Wizard bring your ass on Imperial so we can get physical\nAnd watch God show and prove\nNot only mentally but physically the black man rules\nSo run devil run, you's to best start running\nBecause the niggas are coming, oh, the niggas are coming\nAnd ain't no way you gon' win\nCause I come from a tribe of O.G.'s and my skin is my sin\n\nMy S-K-I-N is my S-I-N (\"Burning our black skin\") (Repeat 2x)", "image": "https://images.genius.com/bd986178756b67188db2d06a77696b78.1000x1000x1.jpg"}], "artist": "Ice Cube"}