{"songs": [{"title": "Intro", "album": "Streetlights  ", "year": "2010-04-20", "lyrics": "[Intro]\nThis is ridiculous, man, you know\nI told—hey, this that sober flow, yo\nThis that shit, man, that just make you sit and say \"Damn...Kurupt!\"\nHey, enjoy yourself\nThis is a party, and it's in the West Coast!\nThat's the shocker, right?\nHey, look, I ain't gonna tell you again\nHahaha, look...\n\n[Verse]\nBorn and bred it, I stay breaded\nLet it be, spin it on the needles, inject it\nIntravenous, affect them like Lennon in The Beatles Project it like projectiles in loaded weapons\nLike my mind's my Gatling gun\nI inject the mike, I consider it a favor if you save it\nThe bullshit, I stay churching in the pulpit\nAkhi watch me like white folks watch hockey\nI'm in Hawaii sipping sake with Chris and Maki\nTalking bout stocks and bonds, and cheddar and broccoli\nFamous? i'd rather be broke\nWith nothing to lose, under the radar\nHoping to be like these niggas I see on TV\nI got dollars, fuck the fame, I learnt the game from Eazy\nThe rhetoric, we get rid of it, I consider it\nA great compliment to see you imitate the West and shit\nIt shows me just what the West did\nAnd plus the fact that I was involved in it, we evolved\nAnd it's a great day for Californ-I-A\nI love the new New York anthem, I fucks with Jay\nBut now it's time for mines\nNo disrespect for anybody in mine\nSip a little champ', heavyweight champ\nModern day vamp-pire, I'm a live wire\nGotti esquire, empire lava lop fire\nDon't try us, we 'pires, call the quagmire\nIntelligence’s always been underrated\nKurupt, he's always been underrated\nUnderrated, never faded, ain't afraid to say it\nI call your name out, bitch nigga, I ain't afraid to say it\nI don't use the regular slang that I used to\nAnd this type of honesty you ain't used to\nAnd this type of nigga winning I ain't used to\nBut I guess it's something that I gotta get used to\nGotta listen to it even when I refuse to\nI don't sell a lot of records 'cause people don't like me\nI ain't mad at them 'cause I don't like me neither\nEither way, I'mma keep breathing, receiving these blessings\nHeaven-bound, a hell hound retrieving these lessons\nMurder sessions, aggressions\nSome sections, the essence, effervescence, progression\nEvery second's a lesson\nI progress every second, always making my quota\nI done had so many cars I feel like General Motors  And now I got a house the same size as Pomona Want some prolific vocals? Then tell your local promoter\nThis Gotti!\n\n[Outro: Terrace Martin]\nWhat's happening, y'all? It's Terrence Martin and Kurupt\nWell actually, it's Kurupt and Terrence Martin\nSo, I guess they call these things...\nThese first presentations on an album the intro\nI’m gonna call it the beginning of the moment of truth, ya dig?\n'Cause the truth will set you free\nAnd Streetlights will set you free too\nDon't run from it...", "image": "https://images.genius.com/48a18f242c2b2fb8c91b44110a454db4.600x600x1.jpg"}], "artist": "Kurupt"}