{"songs": [{"title": "Mitch Bade", "album": "The Calm Before the Storm: Part 1", "year": "1999-11-09", "lyrics": "[Chorus: Tech N9ne]\nHave you ever met a nigga who was pie sprung?\nThere's a lot of slinky niggas where I come from\nThere's another missile catcher just like him\nHis name is Mitchell Bade, Mitchell Bade\n\n[Verse 1: Tech N9ne & Bakarii]\nWhat up, Mitch? Is it an everyday thang for you to act just like a bitch?\nHow does it feel to have a nigga that will kill you for the foul shit you bitch?\nNumber one snitch, a bitch with a dick, I found the remedy for the enemy\n(What?) Bust at the nigga like shootin' at the Kennedys\nCause Mitch Bade ain't really no friend of me!\n\nTo be exact, he's that nigga that talk, but he really can't back\nThat shit that he talk so he gotta walk around with a gat\nBut a nigga like me, (I'll knock him out with the force of a hurricane)\nThe penalty for the path if you disrespect the game\n\nNow what goes on inside the mind of a nigga like this?\nThe nigga pissed, as I pumped off four rounds up in the trick he was with\nBut it ain't my fault you a little ole' bitch (Without yo clique)\nNigga, run with a quickness (Get away quick, but you bet not slip)\nBetter off with a Bianca then be stuck (With a AK-47 on your lip)\n\nEven if I'm lifted I can scope 'em from a mile away\n(Niggas fakin' like anticipating the doomsday)\nCamouflagin' but I can see you actin' like a bitch\nWhich are the symptoms of a nigga named Mitch!\n\n[Chorus: Tech N9ne & Bakarii]\nHave you ever met a nigga who was pie sprung?\nThere's a lot of slinky niggas where I come from\nThere's another missile catcher just like him\nHis name is Mitchell Bade, (Mitch Bade) Mitchell Bade (Mitch Bade)\nIf a Mitch is in your mix you best to check one\nAnd be ret to go for milli when the next one come\nIf that nigga got a foot off in his rectum\nHis name is Mitchell Bade, (Mitch Bade) Mitchell Bade (Mitch Bade)\n\n[Verse 2: Bakarii]\n(Late night I got a page from Bianca)\nShe told me her man was trippin', so swoop her 'bout a block up\nSo I-uhm, got prepared, my conscience told me grab the gat\nBut all I could think about, was hittin' that kitty kat from the back\nAll about that hustle, but tonight I gosta kick it\nDeep conversation, but it's her first time lettin' a nigga hit\nBut I'm not alone, It seems this nigga was on the phone\nHe heard the spot, the topic, wicked, wicked, now it's on!\nAs I continue (continue) creepin' (creepin') it's apparent\nThat I'm dealin' with a Mitch Bade, I guess that's why he keeps on starin'\nBut I'm well equipped to handle a fleet, so nigga don't think I'm sleep\nWe can talk like men or we can get grim, and handle this shit n'the streets\nDon't ever trust no cock\nEspecially when a nigga like me is rollin' up your block\nBitch Made nigga couldn't see that you was played\nSo we just changed your name and called you Mitch Bade (Mitch Bade)\n\n[Chorus: Tech N9ne & Bakarii]\nHave you ever met a nigga who was pie sprung?\nThere's a lot of slinky niggas where I come from\nThere's another missile catcher just like him\nHis name is Mitchell Bade, (Mitch Bade) Mitchell Bade (Mitch Bade)\nIf a Mitch is in your mix you best to check one\nAnd be ret to go for milli when the next one come\nIf that nigga got a foot off in his rectum\nHis name is Mitchell Bade, (Mitch Bade) Mitchell Bade (Mitch Bade)\n\n[Verse 3: Tech N9ne]\nCruisin' down the 'spect with five spliffs rolled (rolled)\nPassenger seat (seat), Sunday the Ho' Stroll\nWent to the park with major loot\nDippin' up on bitches, but the jealous Mitch is ready to shoot, peep\nBut it ain't complete, the day is foul without a big butt and smile\nI need a chick that's running wet like Fury of the Nile\nBumped into, stepped into, this chick that's thick and photogenic\nIn a minute, I'ma get up in it, with a jimmy to avoid that AIDS epidemic\nGet it, got it, good in the hood, shit's all good nigga, so I knocked on wood\nGot to her crib, drank some Crown, laid me down, showed me the goods\nThen, knock knock, \"Who's that?\"\nShe said her man and he might be strapped with a gat\nPut back on my shit, time to show this fool just where it's at\nRet to get wet, she opened it up enough so I can see\nShe cracked it a bit, but that nigga pushed her, then came after me\nExtended arm, and bodily harm\nHe should have pulled the trigga, chiggas\nBitch-made Mitch Bade nigga!\n\n[Chorus: Tech N9ne]\nHave you ever met a nigga who was pie sprung?\nThere's a lot of slinky niggas where I come from\nThere's another missile catcher just like him\nHis name is Mitchell Bade, Mitchell Bade\nIf a Mitch is in your mix you best to check one\nAnd be ret to go for milli when the next one come\nIf that nigga got a foot off in his rectum\nHis name is Mitchell Bade, (Mitch Bade) Mitchell Bade (Mitch Bade)", "image": "https://images.genius.com/1d4a12a154c6cf30e77857bb018ab602.1000x1000x1.jpg"}], "artist": "Tech N9ne"}