{"songs": [{"title": "Traveling Light", "album": "Radio Silence", "year": "2017-11-17", "lyrics": "[Intro]\nI come from the God body era\nI come from standing on street corners\nSmoking blunts out of white owls with 40s\nBuilding and destroying about the suns\nAnd the planets and the moons and the stars\nAbout the nature of man\nAbout knowledge, wisdom, and understanding\nAnd you had to show and prove\nAnd you had to be right and exact\n\n[Interlude: Talib Kweli]\nVoulez-vous, rendezvous, coucou le poopoo, come on!\nYeah Chris, yeah, I like that right there, yeah!\nHah, come on! Yeah\nKAYTRANADA, classic\n\n[Verse 1: Talib Kweli]\nWaste these niggas, son, I got a doctorate in rockin it\nPardon, we got it poppin, it's marvelous, nigga watch it\nYou follow a carbon copies I'm stoppin' to intervene\nYou're erroneous, these the phoniest rappers I've ever seen\nWhen I take flight, I'm traveling light, that's a double entendre\nFor when I'm touring, exploring outside the genre\nIlluminate, when I grabbin the mic, it's so bright it'll blind you\nYeah I'm back with a friendly reminder\nWe're two ships that're passing in the night, but alas\nYou got to run into the iceberg, I'm cracking this shit in half\nTraveling light, not talking about back of the back\nFirst I get back in the lab, then I hit the road, I'll be back in a flash\nI'm Barry Allen mixed with Harry Allen\nMy blood hot as volcanic rock forming canary diamonds they find on Canary Islands\nMy rhymes inspired by enviroments of the very violent\nI'm the voice of a generation that's very silent\nI stick to my convictions like I've been indicted\nAll you niggas throwing me shade you about to get enlightened\n\n[Chorus: Anderson .Paak]\nTravel light, travel light\nTraveling light, travel light\nYou grinding 'til the sun up\nWhether it's cold murder, the pies have been cut up\nHopping over the hurdles, just look at the stride\nLife is heavy enough but you lifting me high\nHuh, rather leave it behind\nThe legacy that you built will be left when you die, so\nBrooklyn is changing, and so am I\nI see you on the other side, travel light\n\n[Verse 2: Talib Kweli]\nAy, I'm faster than the speed of sound\nSmashing through these barriers, I'm blasting out your speakers now\nTravel around the planet till I landin where I'm needed now\nWe entertainers, they wanna call us leaders now\nWoah, extra baggage not in the plans, I'll shop when I land\nStop for the fans, every airport from Okinawa to Osaka, Japan\nStop assuming I live in your time zone\nJetlag is my reality, the road is my home, I roam\nYour downfall is you should probably get out more\nI been planning out tours, with a band of outlaws\nI'm packing my bags, just marijuana and magazines\nWrapping the flag around a pistol, the red, the black and the green\nNever crashing, the grill is mean when I'm whipping machines\nDipping between all these commuters, they moving slow like they sippin the lean\nAre they living the dream? Get to they office\nAnd that computer's drifting off until they spit start to drip from the screen\n\n[Chorus: Anderson .Paak]\nTravel light, travel light\nTraveling light, travel light\nYou grinding 'til the sun up\nWhether it's cold murder, the pies have been cut up\nHopping over the hurdles, just look at the stride\nLife is heavy enough but you lifting me high\nHuh, rather leave it behind\nThe legacy that you built will be left when you die, so\nBrooklyn is changing, and so am I\nI see you on the other side, travel light\n\n[Verse 3: Talib Kweli]\nCity of broken promises, my mission is reconnaissance\nIt's dangerous for anybody following\nThat's why I take biting as a compliment, it's proof of my dominance\nIt's the haters' way of congratulating me for my accomplishments\nWell, I'm so atop of this demolishing all the Charlotters\nTo whisper in the ears of your congressmen\nShoving dollars in their pockets, the more we locked up, the more they profiting\nThey building empires like Ottoman\nNow who you wanna face? The sharks in the water or the snakes in the boat?\nThe lesser of two evils be fighting for fake votes\nWe walking through the valley of darkness so stay close\nNeed the light at the end of the tunnel to make a toast\nRaise a glass to our glorious past, we the wave of the future\nNever confusing protesters for looters\nSilencing Radioheads and OK Computers\nTravel to Mecca like Mansa Musa so let's go\n(Yeah!)", "image": "https://images.genius.com/25f545688171433c422bdbaf45bd1392.1000x1000x1.jpg"}], "artist": "Talib Kweli"}