{"songs": [{"title": "Party Over (Games re-edit)", "album": null, "year": null, "lyrics": "Intro/Chorus:\nWhatever? Party's over tell the rest of the crew\nYo P, it's on you, what you wanna do?\n*repeat x3*\n\nVerse 1: Prodigy, Havoc\nEvery day of my life since 11-2-74\nOn the street makin non-stop CREAM galore\nPackin heat, stickin up weed stores and more\nCollectin interest off of extortions to settle my score\nIt gets deeper when things get real\nI'm down to stickin out West Bank for my mill\nAnd I'm from Hampstead, it's close to the shacks of Park South\nWell I'll be outside slingin, you're always high\nAnd don't come around to the crossroads of life\nWe're to the death, you and me, this beef for eternity\nI'm goin out to the fullest extent\nSo far into my troubles it's hard for me to get back\nTo my everyday self and composure\nCatch you when you open then I bring you to a closure\nPut ice on a razor and freeze ya when ya shelter\nI went for ya grill but you dent from my *?rolder?*\nI know this kid who says he knows ya because of that\nNow I know where ya lay ya hat at and that's that\nSay no more, I put it on you while you was yawning\nMurder without warning the very next morning\n\nOnce we step thru the door, party over, that's the endin\nYou and your crew'll leave out, a bunch of dead men\nBump me and I'll bump you back\nYou ain't tough black, niggas like you just get their life jacked\nBut I'ma cool nigga til you push me thru the limit\nBut try ta play me and ya ass I get up all in it\nDon't try to cop please now son, it's dead and done\n(I gave you fair warning) So run and get your guns\nIt's on, time to show em how I perform\nMy attitude'll transform, leave you dead plus wrong\nGettin the flow within, representin for Queens\nShit is real, why you hopin that it's all a dream\nBut you can't wake up, wettin a chest you bless\nChokin off your own blood, don't blame me you brought your own death\n\nChorus:\nAiyo Noyd, it's on you, what you wanna do?\nWhatever? Party's over, tell the rest of the crew\nYo Big Noyd it's on you, what you wanna do?\nWhatever? Party's over, tell the rest of the crew\nYo Big Noyd it's on you, what you wanna do?\nWhatever? Party's over, tell the rest of the crew\nYo Big Noyd it's on you, what you wanna do?\nWhatever? Party's over, tell the rest of the crew\n\nVerse 2: Big Noyd, Prodigy\nMy beeper kept beepin, the other numbers started leakin\n'Who is this on my mind?' I was thinkin\nThen I realised it was my dun playin 911\nOnce I seen the numbers I ran for the fuckin guns\nMy dun in trouble, I be there on the double\nI jumped up in the bubble, yo kid where are you?\n(1-14 between Manhattan and Morningside Avenue)\nThis happened just right out the blue\nAiyo dun, fuck that bitch, tell her get off your dick\n(But she's cryin and she says she has feelins and shit)\nYo it's a settup, them niggas got me fed up\nTy stay in the buildin, if they move fuckin buck em\nGet up off the scene, you know what I mean?\nAnd hide yourself down with them other fuckin sixteen\nGlock and get off they block\nThen I hung up the cellular, ready to rock\nAnd it's on\n\nYo, you get deaded in the streets, kid set it\nYou gots no credit, fool you get wetted\nUp with the semi-auto Mac double, love it\n'Did he shoot eleven or twelve?' is what he wondered\nNigga I got one more shot, you must be drinkin\nPut the heater to his head, watch him start blinkin\n'Am I goin to heaven or hell?' is what he's thinkin\nSwitch to a bitch as his life start sinkin\nDown to a level of no return\nPull out the heat cos when the slugs hit it definitely burns\nNow chill and think about your life for real\nEvery member of my crew is livin life for real\nGot your self fucked into somethin that you couldn't finish\nUp against the fulliest squad and get diminished\nI'm from Q-U-E another E-N-S\nSo why you small tough talk? I'm not impressed\nIf I seen you in the Bridge, I'd make you undress\nGive up the money, the polo especially the Guess\n\nChorus:\nBig Noyd! Party's over, tell the rest of the crew\nHavoc! Party's over, tell the rest of the crew\nBlack Ice! Party's over, tell the rest of the crew\nQueensbridge! Party's over, tell the rest of the crew\nThe Big Twins! Party's over, tell the rest of the crew\nTy! Party's over, tell the rest of the crew\nYo Black! It's over, tell the rest of the crew\nMy man Killer! Party's over, tell the rest of the crew\nGerm! It's over, tell the rest of the crew\nKarate Joe! It's over, tell the rest of the crew\nRon Gotti! It's over, tell the rest of the crew\nKarl Capone! Party's over, tell the rest of the crew\nRasheim! Party's over, tell the rest of the crew\nStobo! Party's over, tell the rest of the crew\nTena! Party's over, tell the rest of the crew\nSkins! It's over, tell the rest of the crew\nAnd the whole fuckin projects! It's over, tell the rest of the crew\nIt's over, tell the rest of the crew\nIt's over, tell the rest of the crew\nParty's over, tell the rest of the crew\nParty's over, tell the rest of the crew\nThe motherfuckin party's over, tell the rest of the crew\n\nOutro:\n\nGet that nappy up\nYo get that nappy up\nSon get that nappy up\nQueens get that nappy up\nYo get that nappy up\n*talkin to fade*", "image": "https://images.genius.com/42d069fe8357b9423abc0b46d79ba08d.398x398x1.jpg"}], "artist": "Mobb Deep"}