{"songs": [{"title": "Face Down", "album": "Streetlights  ", "year": "2010-04-20", "lyrics": "[Intro:J. Black Tone Terrace Martin]\nIm from the land of the c’s and b’s, where niggas smoke trees and roll them gold D’s\nWhere niggas fucking hood rap and catch a good c’s where niggas carry rocks and pray Oh lord please!\nHahahah\nYeah!\nWhere niggas dat trip we pull the Glock from the hip\nBustis fucked up start the talk a lot of shit (shit) nigga don’t believe me well we’ll bust your lip\nOr else\n\n[Chorus:J. Black Tone Terrace Martin]\nFace down\nI left her with a whole clip\nLay down\nOr you can get a whole clip\n\nFirst you with a clip clapping body\nPosting mismatch\nO yes I am reloading ou ou face down\nLeft her with a whole clip\n\n[Verse 1:Kurupt]\nI’m living the  living I’m born to get it\nI gave them what\nUhm a\nIm born to get it\nYa in if you with it\nAnd I’m a be\nForced to spill it I gave em one\nYea\nGave em one for the road\nOne for these homeless niggas,  one for these hoes\nTired of mutherfuckers that be talking that bullshit thinking me and the homies with the talking  that bullshit\nNigga dont talk to me nigg cocking and pullshit\nCalling tha bullshit sheed up is how I keep em, em posted and then\nI roll it and smoking and keep it loped and trip nigga we supersoak trip niggas we super soak\nSuper soak em\n\n[Chorus:J. Black Tone Terrace Martin]\n\n[Verse 2:Kurupt]\nLook, im living to live. I’m born to get it another one\nStorm and triping is on,  I’m tripping as soon as I saw him I started reaching grabbing my gun yea\nI saw him reaching its survival of the fittest though i'mma boil and bleach him like\nThat's the sound\nOf the flames from these hood meringues we ain't got m6's tanks\nBut we just bought beens we got eagles that stretch and they fly and sing maliant melodies murdering stinks\nYo im one to fuck around with theses zoo babies cuz we swarm and sting like raising bees\n\n[Chorus:J. Black Tone Terrace Martin]", "image": "https://images.genius.com/48a18f242c2b2fb8c91b44110a454db4.600x600x1.jpg"}], "artist": "Kurupt"}