{"songs": [{"title": "​i (Live Performance on SNL)", "album": null, "year": "2014-11-15", "lyrics": "[Introduction: Woody Harrelson]\nLadies and gentlemen! My man, Kendrick Lamar!\n\n[Kendrick & Background Vocalists]\nLivin' in America\nThuggin' in the trap\nLivin' in a groove\nWatchin' TV\n\n[Kendrick]\nDedicated to the homies in the pen', hit me!\n\n[Intro]\nI done been through a whole lot\nTrial, tribulation, but I know God\nThe Devil wanna put me in a bow tie\nPray that the holy water don't go dry, yay yay\nAs I look around me\nSo many motherfuckers wanna down me\nBut an enemigo never drown me\nIn front of a dirty double-mirror they found me\n\n[Chorus]\n(And I love myself)\nUh, when you lookin' at me, uh, tell me what do you see?\n(I love myself)\nAhh, I put a bullet in the back of the back of the head of the police\n(I love myself)\nUh, illuminated by the hand of God, boy think they high\n(I love myself)\nUh, one day at a time, sun gon' shine\n\n[Verse 1]\nEverybody lookin' at you crazy (Crazy)\nWhat you gon' do? (What you gon' do?)\nLift up your head and keep moving (Keep moving)\nOr let the paranoia haunt you? (Haunt you)\nPeace to fashion police, I wear my heart\nOn my sleeve, let the runway start\nYou know the miserable do love company\nWhat do you want from me and my scars?\nEverybody lack confidence, everybody lack confidence\nHow many times my potential was anonymous?\nHow many times the city making me promises?\nSo I promise this, huh\n\n[Chorus]\n(I love myself)\nUh, when you lookin' at me, tell me what do you see?\n(I love myself)\nAhh, I put a bullet in the back of the back of the head of the police\n(I love myself)\nUh, illuminated hands of God, boy don't seem shy\n(I love myself)\nOne day at a time, sun gon' shine\n\n[Verse 2]\nWhen they say it's a war outside, bomb in the street\nGun in the hood, mob of police\nRock on the corner with a line full of fiend\nAnd a bottle full of lean and a model on a scheme\n(These days of frustration keep y'all on tuck and rotation)\nAh man\n(I duck these cold faces, post up fi-fie-fo-fum basis)\nUh, dreams of reality's peace\nBlow steam in the face of the beast\nSky could fall down, the wind could cry now\nThe strong in me, I still smile\n\n[Chorus]\n(I love myself)\nHuh, when you lookin' at me, uh, tell me what do you see?\n(I love myself)\nAhh, I put a bullet in the back of the back of the head of the police\n(I love myself)\nUh, illuminated by the hand of God, boy don't be shy\n(I love myself)\nOne day at a time, sun gon' shine, everybody, hit me!\n\n[Bridge]\n(Walk my bare feet, walk my bare feet)\n(Down, down valley deep, down, down valley deep)\n(Fi-fie-fo-fum, fi-fie-fo-fum)\n(My heart undone, my heart undone)\n\n[Interlude]\nOh man, hey check this out, this a real Compton thing goin' on right now, ya feel what I'm talkin' bout? Ya dig that? Sometimes I just get a little bit beside myself, you know what I'm talkin' bout? This here's the return of Enoch, and we gonna do it to you like this, here we go: one, two, three, hit me!\n\n[Original Chorus]\nAnd I love myself\n(The world is a ghetto with big guns and picket signs)\nI love myself\n(But it can do what it want whenever it want, I don't mind)\nI love myself\n(He said I gotta get up, life is more than suicide)\nI love myself\n(One day at a time, sun gon' shine)\n\n[Verse 3]\nI went to war last night\nWith an automatic weapon, don't nobody call a medic\nI'ma do it till I get it right\nWar last night\nI've been dealing with depression, duckin' every other blessin'\nI could never see the message, I could--\nI could never take the lead, never bob and weave\nNegative letting them annihilate me\nEvident I'm moving at a meteor speed\nFinna run into a building, lay my--\nMoney in the ceiling lay my body in the street\nGlory to the feeling of the holy unseen\nGlory to the feeling of the holy unseen\nSeen enough, make everybody scream, \"I love myself!\"\n\n[Original Outro]\nI lost my head\nI must've misread what the good book said\nOh woes keep me, it's a jungle inside\nGive myself again 'til the well runs dry\n\n[Interlude]\nAh man, ay, ay homie, I told you it's a straight up Compton thing, ya dig what I'm talkin' bout? And this here is dedicated to the homies. Y'all feel what I'm saying? And sometimes I just get beside myself. The return of the Enoch is back, you hear what I'm talkin' bout?\n\n[Verse 4]\nUh, I've been lookin' for you my whole life, appetite\nFor this feeling I can barely describe, where you reside?\nIn a woman, is it in money, or mankind?\nSomething's got me losing my mind\nWhere you at? From the front to the back\nI'm lookin' for you, I react only when you react\nI thought I found you back in the ghetto\nWhen I was 17 with the .38 Special\nMaybe you're in a dollar bill, maybe you're not real\nMaybe only the wealthy get to know how you feel\nMaybe I'm paranoid, ha, maybe I don't need you anyway\nDon't lie to me, I'm suicidal any day\nI could be your advocate\nI could speak for you if you tell me what the matter is\nI could preach for you with the mighty tongue\nI'm the one, how can I, overcome\nNegative energy while I give infinitely and survive?!", "image": "https://images.rapgenius.com/2140573a77d9d3524f27fe7073409238.600x600x1.jpg"}], "artist": "Kendrick Lamar"}