{"songs": [{"title": "FLIP THE SWITCH", "album": "QUAVO HUNCHO", "year": "2018-10-11", "lyrics": "[Intro]\nTsunami warning\n\n[Chorus: Quavo]\nYou the one that's tryna keep your business low-key, huh? (huh?)\nYou the one that's having your main nigga, can't get no sleep, huh? (Sleep, hey)\nYou the one who walk around on fleek, huh? (Fleek)\nYou the one that started from the bottom but you've reached your peak, huh? (Peak, peak)\nYou taught her how to swallow with no teeth, huh?\nMake them dollars out the street, huh? (Cash)\nBaddest bitch you ever seen, huh? (Bad)\nYou the one who split the guap with your team, huh? (Split it)\nYou the one who drink a lotta codeine, huh? (Drank)\nAyy, ayy I like this shit, this shit take me back to the '99, 2000\n\n[Verse 1: Drake]\nAyy, ayy, I got shorties out tryna find me, that look\nSlipping through the cracks 'cause I'm slimy, I slipped\nChain wetter than a river you could cry me\nQuick to Timberlake a bitch, now she despise me, I swear\nI just let the money energize me\nNigga, you was in your 20s in the '90s, yeah\nI just order Phantoms off the website\nThey ask how I want the shit, I say, \"Surprise me\"\nAyy, yeah, look\nShe wanna hang when the album drop, that's timely\nAyy, got a present for my oppers, word to Smiley\nI know her man, gotta move her from beside me I swear\n\n[Verse 2: Quavo]\nShe got ice in all her veins (All the ice)\nShe gon' change worrying about the wrong things (Wrong thing)\nIf the paparazzi catch her, she'll be famous (Flash)\nGot to move low-key with the gangsters\nDo what you do girl, flex with your gang (Flex)\nLet's call the boys up (BM) Lambos gon' swing (Skrrt)\nWho that making noise? (Who?) Gang-Gang (Who?)\nGot a new crib, with a shooting range, get a professional aim (pow)\nYou was up, now you fell off (Hey)\nThen you pull up, all cap better knock it off (Cap)\nI might get caught with my side bitch (Gang)\n'Cause I put my main bitch in the cockpit\n\n[Bridge: Quavo]\nBad bitches and they lit (Woo)\nI just told 'em, \"Flip the switch\" (Flip it)\nGang 'round, with the shits (Switch it)\nI just told 'em, \"Flip the switch\" (Hey)\n(Flip it, flip it, flip it, flip it)\nSwitch it\n(Flip it, flip it, flip it, flip it)\nFlip that ho switch\n(Flip it!)\n\n[Chorus: Quavo]\nYou the one that's tryna keep your business low-key, huh? (Huh?)\nYou the one that's having your main nigga, can't get no sleep, huh? (Sleep, hey)\nYou the one who walk around on fleek, huh? (Fleek)\nYou the one that started from the bottom but you reached your peak, huh? (Peak, peak)\nYou taught her how to swallow with no teeth, huh?\nMake them dollars out the street, huh? (Cash)\nBaddest bitch you ever seen, huh? (Bad)\nYou the one who split the guap with your team, huh? (Split it)\nYou the one who drink a lotta codeine, huh? (Drank)", "image": "https://images.genius.com/39a1f9d0d1403b9749469ec36ad251e9.1000x1000x1.jpg"}], "artist": "Quavo"}