{"songs": [{"title": "Fake Bonanza", "album": "True Magic", "year": "2006-12-29", "lyrics": "[Verse 1]\nHip hop, modern time, flossy and raw so self-absorbed, immature\nI can't remember being this bored\nFake bonanza, become come real wars\nBullets burn through the candy on the driver side door\nLong investigations and no firm lead, billion dollar flow\nAnd black life is still cheap\nYour rent skyrockets and job prospects plummet\nTen murders, ten days, this summer\nTalk about today's mathematics, a eighth, an O, a ki\nAnd the caliber on your rack, shit\nInmate number, centerfold’s measurements\nIs close as a cold cell come to some tenderness\nI heard them say it was all about the Benjamins\nI don't believe it now, didn't believe it then, fuck wutcha heard\nYou believe wutcha want, the truth is what it is, it be what it been\nGet rich, shorty just tryna live\nDon't believe in heaven and ain't tryna get in\nAnd hell is everyday, fuck the world anyway\nPotion and sips, spark up a clip, FADE AWAY!\n\n[Hook]\nThe low lights, tree top heights\nBe careful how you move the traps are covered in the lights\nLandmines be disguised as welcome signs\nI'll repeat it so you ain't got to press rewind\nThe landmines be disguised as welcome signs\nBlack fresh from Iraq, a wild look in his eyes, missing part of his arm\nWhat the fuck is your problem!? Ohh lord! Fake Bonanza!\n\n[Verse 2]\nGladiator, circus world\nGlamour, pussy, pimp, whole goods and services world\nParanoid, itchy trigga finga nervous world\nShade-tonic natural order in reversal world\nThe ipod, no God, zero circle world\nThe blow-a turtle world, smoke from the purple world\nThe killer murder world, hamburger murder world\nOpen twenty-four hours, all about them dollars\nPretty poison, devoid choices\nCold coffee and more coffins, fake bonanza (2x)\nHuh? What? I don't understand ya!\nWhat they talking bout save they soul, ohh lord, save they soul!\nHelp them reach the goal, peace! (4x)\nYou know, peace (3x), boogieman! Don't be scared\nOhh lord, save they soul (2x) Ohh lord, save my soul (2x) Please\nBoogieman\n\n[Outro]\nWoke up this morning with my, my state on freedom and said I\nHad the baddest feeling, maybe you stayed on my mind, said I (2x)\nWoke up this morning in my, my state, I'm dreaming, dreaming\nAin't nothing even.....dreaming, praying, keeping\nWoke up this morning and my mind stayed on freedom\nWoke up this demon that keep staying on my mind\nSaid, woke up this morning and my mind stayed on freedom\nIt makes no difference what people say, AHHHHHHHHH", "image": "https://images.genius.com/50acba8e30cec066c838d6f22dd475e3.500x500x1.jpg"}], "artist": "Yasiin Bey"}