{"songs": [{"title": "Vato (Miqu Remix)", "album": null, "year": "2010-04-04", "lyrics": "[Snoop Dogg]\nUh-huh, hmm... I was chillin, right around my way (way!)\n21st eastside of the Beach\nThis motherfucker ran up on me\nTalkin shit with his homies like he was a straight.. G\nAskin where I'm from while he runnin up\nGangbang, my set on e'ry one of 'em (true)\nSome things, sons they just won't change\nFools don't respect nuttin but the gangbang (bang!)\nWhat's seen is what's saw, Dogg is the law\nI have you niggas runnin like a marathon\nLittle G's tryna creep, on the East with it\nTalkin 'bout they gon' get my chain and they gon' leave with it (nmm hmm!)\nBut they don't know once they get close\nIt's Tic-Tac Toe, three motherfuckers laid on the floor (watch out!)\nYeah, this happened yesterday\nOn the West they spray - I heard the ese say, he said...\n\n[Hook: B-Real] + (Snoop Dogg)\nVato, you won't believe what I saw\nI saw these pack of guys and they act real hard (and what they do?)\nThey twist the fingers and said, \"You know who we are\"\nHe said, \"I don't give a fuck, I'm Snoop Doggy Dogg\" (uh huh!)\nThey keep buckin and it went too far\nSo Snoopy, he went straight to the trunk of his car (and what he get?)\nHe got his gun and they start runnin' hard\nHe started firing and then he just charged\n\n[Break 2X: Snoop Dogg]\n(BLAOWW!) Run nigga, run nigga!\n(BLAOWW!) Duck nigga, duck nigga!\n(BLAOWW!) Run, motherfucker run!\n(BLAOWW!) Run, motherfucker run!\n\n[2pac]\nI went from rags to riches\nQuick to socializing with the baddest bitches\nWent from a bucket to a rag with switches\nI'm seein' death around the corner\nI'm bumpin' Gloriaaaa doin' 90 cause I wanna\nI'm getting high and like I said it was some chocolate thai\nMixed with some indonesia watch me fly\nAnd even though I know the cops behind me\nHit the weed and uh I continue doing 90 (Biotch)\nUntil I get caught another ticket get to kick it in court\nFuck the law give a shit I'm even worse than before\nI know they wanna see a nigga buried\nBut I ain't worried still throwing these thangs\nGot me locked in these chains\nAnd hey nigga what the fuck is you wailin' 'bout\nSoon as I hit the cell I'll be bailin' out\nAnd when I hit the streets I'm in a rush to ball\nI'm screaming Thug Life nigga fuck y'all\n\n[Hook] + [Break]\n\n[DMX]\nCats playin' games, so I'm goin' raw\nRun up in that fuckin' building, kick down the door\nY'all don't want no fuckin' problems wit' X\nY'all don't wanna see them four-legged beasts\nWit' them collars on their necks\nWit' them niggas downstairs wit' the tech, you know the rest\nFuck it, blow it y'all niggas, bitch I take respect\nDog's shit hot, that's why y'all cowards froze me quick\nI pop up, catch niggas on some cozy shit\nWith Chinese slippers and silk scarves on\nNigga out here tryin' to get his bark on, wonder why the dog gone\nI couldn't take it, deface it, that nigga make shit\nThat's somethin' that'll happen, nigga wanna brace it\nAnd for the record, what you gonna do to fill up my spot?\nI ain't gon' front, that \"Pon De Replay\" shit, was kinda hot\nNot!! How you gonna jack Will Smith for a beat?\nThat's like tryna jack me for the streets! It ain't happenin'!\n\n[Hook] + [Break]\n\n[Snoop Dogg and Pharrell 2X]\nSnoop Dogg, him bust gunshots\nSkateboard P, they say him bust gunshots\nDPG, them bust gunshots\nBBC, you know them bust gunshots (come again, now!)\nSnoop Dogg, him bust gunshots\nSkateboard P, you know him bust gunshots (come again, now!)\nBBC, them bust gunshots\nDPGC, you know them bust gunshots (come again, now!)", "image": "https://images.genius.com/8c99dd335733f9c3cf16f57c9f589cfb.361x361x1.jpg"}], "artist": "Snoop Dogg"}