{"songs": [{"title": "Se Acabo", "album": null, "year": null, "lyrics": "Method Man\nMiscellaneous\nSe Acabo\n[Method Man]\nBeatnuts, Mista Mef, you know how we do\n\"Se Acabó\"\n[Ju Ju]\nFree drinks on the house, word\nEverybody drinkin tonight\n(WHAT DA DEALLY?)\nPor ahí viene el perro, por ahí viene\nCae la gorda por...\nYo check it out\nSwing a bat on you like the devil himself\nPut it on us, sickness or health\nMakin you could only breathe wit help\nI ain't playin, you don't wanna hear what you sayin yourself\nHit the street wit incredible beats\nWe reknowned for tearin it down\nNever have you heard a similar sound\nLike a drop off when shit pop off, feel a hot one\nSide scorching from a hot gun\nNiggas get lost in the buildings wit money and the children\nNot the type to talk too much and catch feelin\nDominican flag over the bed on the ceiling\nProtect everything I rep, that's the first thing\nMany things follow, bullet stay hollow\nYou actin like we don't chew, you can't swallow\nNiggas try to change my plans, I'ma beat you till I break my hands\nJu the German every place I stand (\"Se Acabó\")\n[Method Man]\nAll day everyday (\"Se Acabó\") mothafuckers!\nStep up front! What's goin on?\n[Psycho Les]\nAiyyo it's Big Psych, baby you don't want no problems\nSuckers want war, then yo bomb em\nBring the heat, squeeze the flame torch\nThen peel out in a convertible gray Porsche\nI'm three miles ahead of you, I took the plates off\nJust in case your snitch wanna get paid off\nPull out the chainsaw, it's A Musical Massacre\nCut the head off the driver and the passenger\nSic my dogs after ya, have you climbin a tree\nJust another crime in the street\nAin't nuttin better than findin a beat\nSo if you find that and try to blow my spot up\n(\"You!\") Get shot up \"Se Acabó\"\nMeans \"It's Over\" bro, Method Man on the remix, it's over yo\n\"Se Acabó\" Beatnuts flip the beat, it's over yo\n\"It's a Beatnuts thing, yo you know how that go\" [O.C.]\n[Method Man]\nWhat kind of Beatnut am I? Spanish Fly, P-O-P-P-I\n(Who got the live special guest for the night?)\nExcuse me as I kiss the sky\nYo one on one through the nasal\nTo put food on the table, I Rush Associated Labels\nHuh, ready, willing and able to rock cradle\nAnd rock steady, when I get the drop I drop heavy\nTwist the metal, mask the machette\nThe god don't want beef, he want veggie\nPlus signs over Deadly Medley\nWho got em gassed on his own Getty\nBattery back, he Eveready\nNow what's fuckin wit that ha?\nNot you, you chocha\nI fuck wit Beatnuts, Livin La Vida Loca!\nCallate la boca, see the Spanish Fly on the sofa\nOne word, he slap you wit the toaster\nKeep it in the holster on safety\nPut yourself in timeout, playin wit this dough, let me find out\nYou ain't hard to find though, barrel on your tonsils\nSigan hablando y siga mamando\n\"Se Acabó\" \"Se Acabó\"\nAll day everyday \"Se Acabó\" No doubt\nWhat the fuck's goin on? Worldwide!\n(Beatnuts)Write your own rhymes \"Se Acabó\"\nYeah yeah yeah yeah yeah \"Se Acabó\"\nAll you punk niggas walk it off, \"Se Acabó\" wordup\nWe ain't playin over here yamean \"Se Acabó\"", "image": "https://images.genius.com/fe6629f7a5e6af0aa38ca87547ced96f.1000x562x1.jpg"}], "artist": "Method Man"}