{"songs": [{"title": "Wutchoogonnado", "album": "Red Gone Wild: Thee Album", "year": "2007-03-27", "lyrics": "[Redman]\nYeah... Brick City {*echoes*}\nYeah...\nGilla (yo) Gilla\n\nYo, Brick City, when it comes to grabbin steel\nYou could post me down low like Shaq O'Neil\nYou'll be spittin what I spit when the day is over\nTryin to be me in the mirror, sayin it over\nYeah, he's all right, but you not real\nI'm a dog, shit I eat the food I spill\nFloors ain't dirty enough\nMy game is like carryin shotguns and 21 rough\nDoctor, I'm like the war on drugs\nI don't stop, I'm all night vampire blood\nUnderground {?}, since a kid\nI finger-painted in the mud, with dirty work gloves\nI'm in yo' college campus corridor\nYou should call me Uno the way I +Draw Four+\nBrick City law, strip to your drawers\nBoy now I can pick up two pair from the mall\nIt's time for Doc to check yo' ass nigga\nIt ain't hard, it's an EZ Pass nigga\nFor the paper, I'm offendin neighbors\nRunnin my label out an old Winnebago nigga!\n\n[Hook: Melanie Rutherford]\nOoooooh, shoulda knewwwww\nThat we gon' briiiiing, that funk to youuuuu\nGilla Houuuuse, is comin throuuuuugh\nAnd what you gonna doooooooooooooo-oooooooh, ahhh\n\n[Redman - over Hook]\nYeah.. the Brick City dawgs {*barking*}\nYeah! Holla at your frogs\nYeah, Uptown, Jersey, Brooklyn!\n\n[Redman]\nShhhhhh, Gilla (Gilla) Gilla (Gilla)\n\nYo, uh-oh, Redman back in your town\nYou'll get drug nigga like wedding gowns\nAfter 12, whattup to Dogg Pound\nI roll out, like my earrings got ball bearings\nGive me a Grammy to show my mammy\nHow I smash these Raggedy Ann and Andy's\nI prove that I never left the street\nI just knew I had to come back, with extra heat for y'all\nB-More, are ya ready? (ready ready)\nColorado, are ya ready? (ready ready)\nI'm at your neck like a Doberman mouth\nWith like 40 muh'fuckers out the covenant house - ya heard?\nGilla House in the circuit\nAnd how we do it on purpose, only way to surface\nDef Squad is the foundation\nThree dawgs attached to 98 dalmations\n(Yeah, where them Gilla niggas out at night, at night)\nYou better run 'til you see the light, light\nYo, I know I had you waitin\nBut Death was chasin me and my eight friends for +Final Destination+\n\n[Hook]\n\n[Redman - over Hook]\nYeah..\nYeah! Yo E-Dub, this is hot nigga\nYeah.. Brick City, Milwaukee, California\nWhere ya at?\n\n[Interlude]\nOkay now, take off your shirt, and relax\nLet all your tensions out, just relax (Gilla)\nJust relax (Gilla, Gilla, Gilla)\nJust relax (Gilla, Gilla, Gilla, Gilla!)\n\n[Redman]\nYo, I keep my ears to the street cause that's my job\nBut even the streets can steer you wrong\nI'm walkin with one man above me\nNuttin on my waist, but if it's on you hearin the palm\nYou forgot I'm ten years deep, and out them ten years\nI got two weeks of sleep, and caffeine free\nAmazin right? I got a street team\nThat'll get paid to snipe, yeah by any means\nI'm behind the curtain, my Betty Shabazz\nHope I make it home; I invade alone\nCatch you in the truck, babblin on the phone\nI miss you, I stick up your chaperones\nIt's a dirty dog world, say it louder\nEvery +Friday+ I'm bein chased by Craig's father\nThat's why I'm on the low like pro\nAnd my file is too hi-tech to call next\nI got a heart the size of John Q's son\nAnd on the mic, I'm him times two of 'em\nY'all niggas get your shit together\nCause Gilla House niggas, prepare for whatever\n\n[Hook: Melanie Rutherford] + (Redman)\nYouuuuu, you shoulda knewwwww (yeah)\nThat we gon' bring, got to that funk to you, to you\nGilla Houuuuse, is comin through\nAnd what you bitch ass niggas gonna do-do-do-do-do, ohh ohh (yeah)\nYou and you and you, you shoulda knewwwww (Gilla House nigga!)\nThat we got to bring, that funk, to you you you\nGilla Houuuuse (yeah) is comin through\nAnnnnnnd what your crew gonna do-do-do-do-do-do-do-do-do-do-do-do-do\n\n[Redman] Gilla House", "image": "https://images.genius.com/65aa1591ac947b9397141766462ac089.465x465x1.jpg"}], "artist": "Redman"}