{"songs": [{"title": "Louis Vuitton (Extended Version)", "album": null, "year": null, "lyrics": "J. Cole\n[Verse 1]\nGot a young chick from the hood, south side\nPops never let her outside\nNigga knew the type of shit she was up against\nLittle did he know the shit was going to back fire\n‘Cause she act quiet, got baptized, sang in the choir\nBut the thing she desired was a\nOlder nigga show her how to be a freak\nThe young girl is in heat, it’s deep\nShe sneaking out, off the leash\nOn the streets at night when the freaks is out\nButterfly tat on her back that she tried to hide\nUntil her father found her secret out\nNow he flipping out, he kicked her out\nShe living on her own and it’s vicious out\nYears go by now I got her in my room\nAnd I’m thinking of the best way to kick her out\n\n[Hook]\n‘Cause all she ever talks about is Louie, Louie\nAll she ever talks about is Louis Vuitton\nAnd nigga, I can’t fuck with her no more\nI mean Louie, Louie, all she ever talk about is Louie, Louie\nAll she ever talk about is Louis Vuitton\nAnd nigga, I can’t fuck with her no more\n\n[Verse 2]\nI told the bitch somebody stole my Rollie\nShe talking ‘bout “me too”\nI came through with the brand new Louis bag\nShe talking ‘bout “me too”\nLA on my next flight, you guess right, she said “me too”\nNow everybody gonna Ms. Me Too\nGoddamn, be you\nAnd if that is you, you so shallow\nYou on a boat that won’t travel\nWon’t float and won’t paddle\nIf I go broke it won’t matter\nThis stupid ass shit don’t make me\nI been poor, won’t break me\nYou so caught up on material shit\nWe both know that you can’t even get\n\n[Hook]\nI mean my window down\nLet me roll my windows up\nMy plink went down\nI just got my little cup\nMy freaks go down\nNigga I can’t fuck with her no more\nAyo, ayo…\n\n[Verse 3]\nDude got a rich bitch, though\nShe off the chain, ready to go\nBaddest thing, head to toe\nFine line between a rock star and just a ho\nBut she walked that\nGoddamn, girl, she walked that\nBig money talk real loud\nI mean I can barely talk back\nBut I, but I got good game, good game\nNothing like them lames you used to\nI know the rules gon’ use you\nI just want the same shit that you do\nCan you keep a secret?\nSometimes, man, your beeper leak it\nNigga told me she evil\nI danced with the devil then, please believe it\nPlease believe it\n\n[Hook]\nShe take my hip-hop, ayo\nShe don’t want to fuck with me\nAm I big snob? Ayo\nShe might not fuck with me\nAm I a big splotch? Ayo\nShe don’t want to fuck with me no more", "image": "https://images.genius.com/2cd936e786e1ab454043327d585c7702.1000x1000x1.jpg"}], "artist": "J. Cole"}