{"songs": [{"title": "I’ll Show You", "album": "Fuck Da City Up", "year": "2012-01-01", "lyrics": "[Verse 1: T.I.]\nK-I-N-G\nSolomon, Henry\nRidin' in the Bentley\nThey wanna send me, back to the pen\nHope they give me a ten P\nDoin' it for my dog, with some case are pending\nAnd my folk behind the waterboard city, keep it pimpin'\nTell them hatin'-ass law, bitch I'm ballin come and get me\nSee Tip go by, in the whip, no lie\nDidn't need no wheel cause that shit so fly\nUp, up and away, so far up at the top I sit\nMy air so thin, need oxygen\nI'm so fucked up, intoxicants\nMy flow still so stupid, incompetent\nCompetition evidently don't know what they up against\nObviously oblivious, in the city I'm serious\nI'm seriously poppin', I will be the reason why it's hot in here\nMaterial you droppin' better push that back, that can't come out this year\nI got this here, can't stop this, got this like I got blocks in here\nHit the VIP, all eyes on me like they think Pac in here\nI'm ignorant, belligerent, a gangsta and a gentleman\nPay niggas no concern, ain't no DiGornio, I'm deliverin'\nCenter of attention, my P.O. just threw a wrench in my\nPlan of execution, I'm demandin' retribution\nFirst trip to prison, a lesson, second was just a nuisance\nPeckerwood beefin' with me, they want my neck in a noose\n'Cause they see a nigga's influence, luxurious and affluent\nThey want the king destroyed, see your majesty ruined\nNah, nothin' doin' brah, congratulations you have a\nReally great advantage point, so take your vantage point\nWatch, with the flip of a coin\nThe one they counted out soon become the nigga to join\nDon't listen to the gossipers 'cause them niggas annoyin'\nThey speak what I know and think it's over for them (Boing!)\nI bounce back, in a Boeing I fly high\nWith ten chicks, got high in sha la\nNiggas stay talkin' all that caca\nNo mucho dinero? No hablar\nAbout my dollar Givenchy, Balenciaga\nHow automatic my chopper, they want some problems, I got 'em BYE!\n\n[Verse 2: Pusha T]\nI'll show niggas better than tell niggas\nPanel discussions 'bout Push, I never fail niggas\nCombat Jack, Lindstrom, what the hell niggas?\nThis the new God flow, the Holy Grail niggas\nCan't see me, Book of Eli, it's in Braille niggas\nI'm on track to be the best, I won't derail niggas\nI bend bars on bitches, I unveil nigga\nOfficiallyIce, don’t at ‘em, show and tell nigga\nSay my brother better? Big deal\nBig brother, so fuck you, he hammer, can't touch him\nRide around, nigga, AMG mufflers, second fiddle to my own gene pool\nWe laugh about it, that's cool\nI'm at the top and he better?\nIf you think about it, we rule\nMy life is an open book\nMy stuntin' is an open look\nThese gold chains, these stone rings\nThis cocaine that I overcooked\nI overcame on Novacane, I Frank Ocean'd that fishscale\nI tip scales, I tip hoes, I skip jail on my tip toes\nI beat the odds, bet Tip knows, my top back and my wrist froze\nAnd these ice cubes on my ear lobes\nLike strobe lights on a fish bowl\nSupreme ballers, dope dealers, shot callers\nG.O.O.D. Music, Grand Hustle, what the block taught us", "image": "https://images.genius.com/c4a42649ba1a4f401f2ed78317e312fc.1000x1000x1.jpg"}], "artist": "T.I."}