{"songs": [{"title": "How 2 Feel", "album": "I Love You (A Dedication To My Fans)", "year": "2011-05-23", "lyrics": "[Intro]\nUh, ayyyy!\nDuane DaRock good lookin out baby\nAyyy, feel so beautiful\nThis is the appreciation - I love you\nAH HAHH!\n{\"I'm gonna tell how I feel about, you\"} uh-huh\n{\"How I feel about you!\"} Yeah\n{\"How I feel about you!\"} Uhh, yeah\n\n[Verse 1: Jadakiss]\nYou had a dream that the feds got him\nWoke up went and bought every pair of the red bottoms\nYup! Your new beamer is black\nYou ain't on Madison, you at Neiman's and Saks\nAt the gym or the salon, food shoppin wit'cha mom\nOver one of your girlfriend's house, sippin wine\nWhy risk it, when you could come home to a Don?\nLeave Potsie alone and come home to the Fonz\nGold medal feel so much better than a bronze\nYou don't have to say nothin, I feel your response\nYou can get the ring and the house too\nCause that's how I feel about you - hey!\n\n[Chorus]\n{\"I'm gonna tell how I feel about, you\"}\n{\"How I feel about you! How I feel about you! Yeahhh\"}\n{\"I'm gonna tell how I feel about, you\"} uh-huh\n{\"How I feel about you!\"} Yeah\n{\"How I feel about you!\"} HA HAH! Uhh, yo\n\n[Verse 2: Jadakiss]\nSlacks with the heels (mm)\nAir Max, nice pair of sweats and a ponytail just give me the chills\nYeah - we got our own special handshake\nMuah! And she know how I like my pancakes\nOff white, three piece with the tan snakes\n80 large make her ring finger stand straight (ha ha)\nNow I can have a good time with her (yeah)\nChill with me in the spot I used to grind with her\nUhh, that's on everything I kill for her\nSay what'chu want, that's just how I feel for her - hey!\n\n[Chorus]\n{\"I'm gonna tell how I feel about, you\"}\n{\"How I feel about you! How I feel about you! Yeahhh\"}\n{\"I'm gonna tell how I feel about, you\"} uh-huh\n{\"How I feel about you!\"} Yeah\n{\"How I feel about you!\"} Uhh, yeah, yo\n\n[Verse 3: Jadakiss]\nI gotta play it cool (cool)\nMosaic tiles at the bottom of the pool (mm)\nI got 'em cause of you\nWashing set, you up under the dryer\nWinter time cuddled up under the fire (woo!)\nStill there after all that I put her through (yeah)\nDon't smoke but sometimes she take a pull or two\nHeh, I don't know how I would feel without her\nNah, I just know how I feel about her - hey!\n\n[Outro: repeat 2X]\n{\"I'm gonna tell how I feel about, you\"}\n{\"How I feel about you! How I feel about you! Yeahhh\"}\n{\"I'm gonna tell how I feel about, you\"}\n{\"How I feel about you! How I feel about you!\"}", "image": "https://images.genius.com/2a0fbea6220144ee9e467410d8edb303.1000x1000x1.jpg"}], "artist": "Jadakiss"}