{"songs": [{"title": "Me & My Bitch", "album": "Ready to Die", "year": "1994-09-13", "lyrics": "[Intro: Notorious B.I.G., Puff Daddy & Girl]\nYo let— let— let me ask you a question, yo\nYo, would you kill for me?\nHmm, yeah\nUh, the act of making love— (Haa)\nWhat took you so long to answer motherfucker?\nI don't know\nThe fuck wrong with you, bitch?\n\n[Verse 1: The Notorious B.I.G.]\nWhen I met you, I admit, my first thoughts was to trick\nYou look so good, huh, I suck on your daddy's dick\nI never felt that way in my life\nIt didn't take long before I made you my wife\nGot no rings and shit, just my main squeeze\nComin' to the crib, even had a set a keys\nDuring the days you helped me bag up my nickels\nIn the process, I admit, I tricked a little\nBut you was my bitch, the one who'd never snitch\nLove me when I'm broke or when I'm filthy fuckin' rich\nAnd I admit, when the time is right, the wine is right\nI treat you right, you talk slick, I beat you right\n\n[Chorus: The Notorious B.I.G., Puff Daddy & Girl]\nJust me and my bitch, me and my bitch\n(But you know you love that ass, don't you?)\nJust me and my bitch, yeah, just me and my bitch\n(Yeah, no question, no question)\nJust me and my bitch, yeah, just me and my bitch, yeah\n(Yo, let me ask you another question)\nJust me and my bitch, just me and my bitch, yeah\n(What?)\nJust me and my bitch, yeah, just me and my bitch, yeah\n(You been fuckin' 'round on me?)\nJust me and my bitch, just me and my bitch\n(Why would I do that?)\nJust me and my bitch, me and my bitch, yeah\n(Yo, don't lie to me, motherfucker)\nJust me and my bitch\n\n[Verse 2: The Notorious B.I.G.]\nMoonlight strolls with the hoes, oh, no, that's not my steelo\nI wanna bitch that like to play ceelo and craps\nPackin' gats in a Coach bag, steamin' dime bags\nA real bitch is all I want, all I ever had\nWith a bop just as strong as me\nTotin' guns just as long as me, the bitch belongs with me\nAny plans with another bitch, my bitch'll spoil it\nOne day, she used my toothbrush to clean the toilet\nThrowin' my clothes out the windows, so when the wind blows\nI see my Polos and Timbos\nHide my car keys so I can't leave\nA real slick bitch, keep a trick up her sleeve\nAnd if I deceive, she won't take it lightly\nShe'll invite me, politely, to fight, G\nAnd then we lie together, cry together\nI swear to God I hope we fuckin' die together\n\n[Chorus: The Notorious B.I.G., Puff Daddy & Girl]\nJust me and my bitch, just me and my bitch, yeah\n(Nigga, nigga, if I ever)\nJust me and my bitch, yeah, just me and my bitch\n(Catch your ass fuckin' around)\nJust me and my bitch, just me and my bitch, yeah\n(I'll cut your motherfuckin' dick off)\nJust me and my bitch, yeah, just me and my bitch\n(Haha)\nJust me and my bitch, just me and my bitch, yeah\n(Stop playin')\nJust me and my bitch, yeah, just me and my bitch\n(I ain't pl— ain't— ain't no jokes, ain't no jokes)\nJust me and my bitch, just me and my bitch, yeah\n(Ain't no jokes)\nJust me and my bitch, yeah, just me and my bitch\n(Yo, don— don't play with my dick)\n\n[Verse 3: The Notorious B.I.G.]\nShe helped me plan out my robberies on my enemies\nDidn't hesitate to squeeze to get my life out of danger\nOne day, she put 911 on the pager\nHad to call back, whether it's minor or major\nNo response, the phone just rung\nGrab my vest, grab my gun, to find out the problem\nWhen I pulled up, police was on the scene\nHad to make the U-turn, make sure my shit was clean\nDrove down the block, stashed the burner in the bushes\nStepped to police with the shoves and the pushes\nIt didn't take long before the tears start\nI saw my bitch dead with the gunshot to the heart\nAnd I know it was meant for me\nI guess the niggas felt they had to kill the closest one to me\nAnd when I find 'em your life is to an end\nThey killed my best friend, me and my bitch\n\n[Chorus: The Notorious B.I.G.]\nJust me and my bitch, me and my bitch, yeah\nJust me and my bitch, yeah, just me and my bitch, uh\nJust me and my bitch, me and my bitch, yeah\nJust me and my bitch, yeah, just me and my bitch, uh\nJust me and my bitch, just me and my bitch, yeah\nJust me and my bitch, just me and my bitch\nJust me and my bitch, me and my bitch, yeah\nJust me and my bitch\n\n[Skit: The Notorious B.I.G. & Girl]\nLet's get started then\nSo when did you first start rappin'?\nUm, I was like about 18 years old. Yeah, about 18\nSo how did you first get started? Who influenced you?\nAin't nobody really influenced me, you know what I'm saying?\nI was just tired of being on the streets, you know what I'm saying? Had to get up off that, you know\nI see. So where you from?\nBrooklyn", "image": "https://images.genius.com/e6cce6ad5c26175653cd5e5590b6e235.1000x1000x1.jpg"}], "artist": "The Notorious B.I.G."}