{"songs": [{"title": "I’m Upset", "album": "Scorpion", "year": "2018-05-26", "lyrics": "[Intro]\nYeah\nI'm workin' on dyin'\n\n[Chorus]\nI'm upset\nFifty thousand on my head, it's disrespect\nSo offended that I had to double check\nI'ma always take the money over sex\nThat's why they need me out the way, what you expect?\n\n[Verse 1]\nGot a lot of blood and it's cold\nThey keep tryna get me for my soul\nThankful for the women that I know\nCan't go fifty-fifty with no ho\nEvery month\nI'm supposed to pay her bills and get her what she want\nI still got like seven years of doin' what I want\nMy dad still got child support from 1991 (One, one, one)\nOutta town, people love to pop a lot of shit then come around\nWord to Flacko Jodye, he done seen us put it down\nNiggas askin' if I'm cool\n\n[Chorus]\nI'm upset (‘Set, ‘set)\nHunnid thousand on my head, it's disrespect (Disrespect)\nSo offended that I had to double check\n\n[Verse 2]\nYou tryna check?\nThis is real life, niggas think we playin' chess\nSo what's next?\nJump up out the bed like I’m possessed\nI go out on tour and I say I'm drinkin' less\nEnd up gettin' loose and gettin' pictures from my ex (Ex, ex, ex, ex)\nSMS, triple X\nThat's the only time I ever shoot below the neck (Skrr)\nWhy you keep on shootin' if you know that nigga dead? (Skrr)\nThat's the only kind of shit that gets you some respect\n\n[Refrain]\nGot a lot of blood and it's cold\nThey keep tryna get me for my soul (For my soul)\nThankful for the women that I know\nCan't go fifty-fifty with no ho (Ayy, ayy)\nEvery month\nShe don't even love me, she just puttin' on a front (front)\nShe gon' try and settle outta court and make a run\nThen gon' ask me how I'm doin'?\n\n[Chorus]\nI'm upset (‘set, ‘set)\nHalf a million on my head I can accept, yeah\n'Least it makes me feel like someone tried their best, yeah\nWant to waste a half a million, be my guest\nMade me wanna buy a vest and a TEC (Skrr)\nBut I'm blessed, I just checked (Checked, checked)\nHate me, never met me in the flesh (Flesh)\nSaid she's got some things she gotta come here and collect\nThat shit is in a box to the left, to the left (Left, left, left)\n\n[Outro]\nGot a lot of blood and it's cold\nThey keep tryna get me for my soul (For my soul)\nThankful for the women that I know (That I know)\nCan't go fifty-fifty with no ho", "image": "https://images.genius.com/d7404c0115e8b517f5fd3cbcce7f9424.1000x1000x1.jpg"}], "artist": "Drake"}