{"songs": [{"title": "Enjoy Da Ride", "album": "Malpractice", "year": null, "lyrics": "[Adam F]\nWelcome back ladies and gentlemen, to the Roller Coaster Malpractice\nPlease stay seated, yeh, and hold on even FUCKIN tighter now\nCause this next section's, as big as the\nFUCKIN BLEEDIN Ti-FUCKIN-tanic!!\nAnd it's called the Heart Attack Mountain;\nWhich we feel is self-explanatory (\"Stop stop stop stop!!\")\n\n[Streetlife]\nYo, I know the streets is watchin'\nDirty date niggas cock-blockin' and plottin'\nWaitin' for my downfall, Street got options\nFuck y'all, y'all can ball, I'mma stay rockin\nAll emcee's paused when they heard the album's droppin\nNuttin but the hottest hip-hop rap concoction\nRap's in a state of emergency, it's shockin'\nI produce, joints that loosen up the socket\nCrowd surf through the mosh pit on some rock shit\nBang your head to this, pump your fist if you feelin' it\nWild the fuck out, bust a clip for the fuck of it\nThis is as good as it get, who you rollin' with? (You)\nWho the ultimate? (Wu)\nStay committed, sold my soul to this rap shit (nigga)\nSlow your roll, strike a bowl, you get clapped quick\nI roll with, ghetto bastard with biscuits\nAnd grab my dick and flick it, get the picture\n\n[Interlude]\nHold on..\n{DT}: This is Dr. Trevis, comin to y'all motherfunkers live\nHold on, hold on..\n{Adam F}: The Roller Coaster Malpractice! (\"Stop stop stop stop!!\")\n\n[Redman]\nYo, yo, yo\nI cop a new Benz, crash the front\nSo hard the airbags use nasal pumps\nJump out, cock the shottie (raise 'em up!)\nI stomp holes like the ground ain't paved enough\nInform the former the first step was a warm-up\nThe next step'll bomb on where your car alarm was\nChikens that'll run in, burn the barn up\nShots'll tear ya Sean John and Phat Farm up (nev-ah!)\nI never got a Soul Train award (nev-ah!)\nNever lost to emcee's as lame as y'all (nev-ah!)\nTrick a bitch car payment off\nI'm a orangutang when the chain is off nigga\nI set-trip, and I slowly blas\nWith a axe, and a pump, and a goalie mask\nLeavin, stains of blood on your Roley glass\nWhen I'm, in your hood nigga throw me bags\n\n[Interlude]\nHold on..\n{DT}: You've just been hit, with the ultimate hardcore shit\nHold on, hold on.. {motherfucker}\n{Adam F}: The Roller Coaster Malpractice! (\"Stop stop stop stop!!\")\n\n[Method Man]\nLet's trip the night fantastic\nI'm flexible, they used to call me plastic\nThese big butt bitches get they ass kicked\nIt is what it is, shittin' on y'all kids\nCouldn't live where we live\nI can't be defeated like \"Nobody Beats the Wiz\"\nLike, when daddy's home can't nobody beat the kids\nRight? You know the Clan and you know the fuckin man\nMeth rock a mic without a kickstand\nTwo blunts, and razors in his wristband\nSlap you and your bitch man\nLookin in your lobby, call me stick-man\nWhen it's goin down, call me quicksand\nZero to sixty in a second, pack a Smith & Wesson\nAnd if the price is right, you can be the next contestant\nFor this aggression, no question, M-E to the F\nAnd be flexin as hard as my erection\nKid learn your lesson cuz what if I decide to start testin\nYour joint - end the motherfuckin session\n\n[Interlude]\nHold on..\n{DT}: This is the final moment, where you motherfuckers bout to die\nHold on, hold on.. {yo}\n{Adam F}: The Roller Coaster Malpractice! (\"Stop stop stop stop!!\")\n\n[Saukrates]\nYo, yo - let a nigga get into it\nLubricate y'all veins with this \"Do-It\" fluid\nI Einstein the rymes, spit them thangs to prove it\nCross with the Mack, in fact, my game's the truest\nNow I'm on the highway, doin it my way\nWith Street, Illegal, Meth, Roc, and Doc Friday\nPerformin like the weather was warm\nAnd drop heat on the streets through zero degree storms\nAnd keep the ghetto, pop your metal\nSmoke it like a cigarette till ya optic yellow\nThe addiction, ain't no friction\nI got them rap heads fillin out a prescription, with diciton\nGettin thick when I put fire to the steaks\nAnd burn the odds, like a iron to your face\nThese long hard years spent Oxy-Cleanin\nMake it clear - look out, Big 'Sauks is here, nigga what?\n\n[Outro]\nHold on..\n{DT}: This is Dr. Trevis, warnin y'all motherfuckers\nHold on, hold on..\n{Adam F}: The Roller Coaster Malpractice! (\"Stop stop stop stop!!\")\nHold on, hold on..\n{DT}: PPP Def Squad, we lock shit down\nHold on, hold on..\n{Adam F}: The Roller Coaster Malpractice! (\"Stop stop stop stop!!\")", "image": "https://images.genius.com/109a9fb9c91fad29c7f632fb053de1bf.1000x1000x1.jpg"}], "artist": "Redman"}