{"songs": [{"title": "Talk About It", "album": "Compton", "year": "2015-08-07", "lyrics": "[Verse 1: King Mez]\nI don't give one fuck\nOff the top I wish a nigga would try a nigga\nReal shit, y'all counterfeit\nY'all niggas bad business\nThat's why the game all fucked up\nFuck Glocks, I'm all about Fort Knox, nigga\nRidin' through your neighborhood\nThrowin' money out the window like \"What!?\"\nYou about the dollar (You know nothin' 'bout it)\nYour poor life been without it\nMy life in the spotlight\nOh no, no, no, I ain't even got to talk about it, talk about it\nHol' up, if you really 'bout it\nTell these mothafuckas we don't even wanna talk about it, what?\n\n[Hook: Justus]\nI don't know everything, but one thing, one thing I do know\nOne thing, one thing I do know (I know, I know, I know)\nIs one day I'mma have everything\nIt was all a dream, it was all a dream (I want it all!)\n\n[Verse 2: Dr. Dre]\nI just bought California\nThem other states ain't far behind it either\nI remember selling instrumentals off a beeper\nMillionaire before the headphones or the speakers\nI was getting money 'fore the internet\nStill got Eminem checks I ain't opened yet\nMVP, shit, this is where the trophies at\nD-R-E, yeah, this is where the dope is at\nThe world ain't enough, I want it all\nGoddammit, I'm too old, I forgot I got it all\nBut Andre young enough to still get involved\nAnd Andre still young enough to say fuck y'all\nFuck you, fuck you, and you in the corner too\nIf you wanna beef, make sure that that's somethin' you wanna do\nThere's some missin' people that felt that way too\n\n[Hook: Justus]\nI don't know everything, but one thing, one thing I do know\nOne thing, one thing I do know (I know, I know, I know)\nIs one day I'mma have everything\nIt was all a dream... It was all a dream... (I want it all!)\n\n[Verse 3: King Mez]\nWhat the fuck was y'all thinking?\nYou let the wrong young nigga link with a legend\n'Lotta new niggas talking crazy on the records\nI'm the only king here, you can tell 'em that I said it\nI'm the black Eminem, I'm the humbler 50\nI'm D.O.C., who do it better? Nobody fuckin' with me\nI murder rappers everyday, 'til police come and get me\nAnd Dre just come and bail me out and then we hit the studio\nAin't no new rap in my ear, too many depressed niggas\nEmotional every song, deserve to have breast niggas\nCrying 'bout my old girl, funny how I left niggas\nTrying to get my ex boxed, Red Ring of Death niggas\nI'm Kanye raising the diamond on the day of his chaining\nIf this was you, your diamond wouldn't be worth the appraising\nI'm just talking reckless, I'm just off the record\nBut I mean it, kept my blessings\nWe was dreaming, now we close enough to see it\n\n[Hook: Justus]\nI don't know everything, but one thing, one thing I do know\nOne thing, one thing I do know (I know, I know, I know)\nIs one day I'ma have everything\nIt was all a dream, it was all a dream (I want it all!)\n\n[Outro: Justus & King Mez]\nListen, I've been tryna get it all\nI'm just in this bitch, I'ma show 'em how to get involved\nYeah I want everything, yeah I want everything\nTalk about it, hol' up, if you really 'bout it\nTell these mothafuckas we don't even wanna talk about it, what?", "image": "https://images.genius.com/19804ba7a9b6ceb36d0158950514927a.1000x1000x1.jpg"}], "artist": "Dr. Dre"}