{"songs": [{"title": "Mac Miller - Turkey Love", "album": null, "year": null, "lyrics": "[Verse 1: Mac Miller]\nBaby, baby, baby - yeah\nBaby, baby, baby - yeah\nI know… girl… girl… girl… girl...\nI see you lookin' good\nWearin' that T-shirt\nAnd nothin' else but some purple panties\nYour ass cheeks bouncin' off each other\nLike they don't get along\nBut I'mma make 'em love each other\nI'mma make 'em become the best of friends\nThose ass cheeks, girl…\nThem ass cheeks like, twins…\nWhich one was born first, baby?\nSaid which one is older, and by how many minutes?\nGirl - your ass cheeks've got a mind of their own\nWhich one had better SAT scores, girl?\nI don't know… I don't know…\nBaby, if your ass had a face\nWhat expression would it be making when\nI put my tongue inside that asshole and lick around like\nI'm tryna have some shitty soup\nGirl, fuckin' with you is like\nFuckin' with a girl with a nice ass\nThat's a lot of ass\nAn don't forget about them titties, girl\nDon't forget about them nipples, no!\nThey get hard when I rub 'em gently\nAnd pinch 'em just a little bit\nBut I ain't tryna hurt you, girl\nNo, I don't wanna hurt you, girl\nUnless you talk about the way that\nYour pussy gon' be hurtin' after I get done with it\nGirl, I'm just tryna have some fun with it\nYou ain't nothin' but a slutty-ass hoe\nWho fucks every rapper that comes to your city\nBut goddamn you're so pretty\nWhen that ass is in leggings, girl\nIt don't matter the pattern, or if they're just solid black\nOh, I want that ass - you've got that pack\nI ain't talkin' 'bout no cellulite\nI'mma tell you, right - baby, we gon' have a swell night\nAnd I don't know if you've ever seen something like me\nWhen I pull out my dick, girl\nI plan on fuckin' you so good\nDamn… I hope you like the way my dick feels\nPut it in your mouth, girl\nDon't you dare bite my shit\n'Cause I'll punch you in the motherfuckin' face\nI'll hit a bitch… oh, I'll hit a bitch\nBut if you suck my dick good then we can get along\nMight even put the head in this song\nProbably not… ooh, probably not\nGirl, how does my dick taste after a show\nWhen I still haven't showered?\nYou suck on my balls, you a champion\nGirl, you a champion… girl, baby, baby\nYou and me… nobody wants us to be together, baby\nBut it's okay… I'mma fuck you anyway\nAnd I heard that Kendrick fucked ya\nI heard that Rocky fucked ya\nI hear that every single rapper\nThat been in your city this month fucked ya\nBut you still wouldn't fuck Schoolboy Q and I feel ya\nBut baby, you can love me right\nAnd I know that your money's tight\nAnd I ain't gonna give you shit\nBut a meal and a glass of Henny and this dick, bitch\nDon't come at me for money, no\n'Cause I'mma tell you youse an ugly hoe and slap you in the face\nPunch you, give that ass a bloody nose\nOoh… I'm fuckin' crazy\nAnd I wouldn't marry you if you fuckin' paid me\nA million dollars… 'cause you ain't shit\nBut a real good pussy\nAnd to be honest that pussy ain't even that good\nIjust think it is because when you horny, everything seems incredible\nYou probably just a regular-ass bitch and I'm trippin'\nOh, I'm on a roll, girl, I'm trippin'\nMissionary, Doggystyle\nRide the dick, get wild, girl\nFrom the side, do a split\nTurn around, now suck my dick…\nBaby, suck my dick, oh…\nI love you, girl - psych!\nI just told your mother that\nAnd then I fucked her too while your daddy watched\nI'm crazy, girl\nBetter work out, I don't like my bitches lazy, girl\nDon't get lazy, 'cause I'll kick your ass right to the curb\nI know I'm gettin' fat, so are you down with that?\nOoh, yeah, give that ass a slap, yeah, I like it, girl\nAnd don't you try and put your tongue in my asshole\n'Cause that's way too nasty for me\nAnd I ain't gay, but I like a girl to rub on my asshole\nWhen she sucks my dick - is that weird?\nMaybe, girl - when I eat your pussy can you feel my beard?\nIt's crazy, girl\nI'm a nasty motherfucker in the Gap wearin' khakis, motherfucker\nAnd don't you dare ask me for a rubber\n'Cause I don't have those\nAye! What the fuck's wrong?\nCan't I talk about your ass in a song?\nHave you ever seen that ass in a song?\nOoh… get low, baby! Oh, girl...\nI'll fuck you while I'm listening to Taylor Swift\nOoh, that's some player shit\nSee, at the end of the night\nI might get you a Gatorade 'cause bitch you need to catch your breath\n'Cause I just fucked the shit out of you\nOoh, I fucked the shit out of you…\nBut don't you bleed on my shits, girl, you bled on my sheets\nNow they've been red for a week\nYou bled on my sheets and stained them\nMy dreams have been red for a week\nOoh…\nYeah, yeah, yeah, yeah…\nAnd I just want you to know that you are not mine\nOh… yeah\nI heard you fucked Justin Bieber\nLet me tell you that's fine\nOh baby, that's fine\nBut let me ask you one question, girl\nWas his dick bigger than mine?\nDon't tell me yes… I might get depressed\nOh… I'm walkin' in right, eh?\nAnd I see… the milk section\nWhat kind of milk do I get?\nBaby, what kind of milk do I get?\nThere's so many choices\nSo much variety of milk\nI couldn't help but think of you\nAnd all the things I want to do in the milk section\nGirl, me and you is like the milk section\nBut sometimes you need orange juice\nAnd sometimes you need a little bit of both\nBut don't drink too much milk\n'Cause you'll be congested\nOh, and something manifested in my mind\nI said: \"Hey! Hey! Cashier, you dirty… give me the correct change!\"\nAnd I can't deal with that right now\n'Cause my mom gave me twenty dollars and said:\n\"Bring back my damn change!\"\nYou gon' make that lady go insane…\nYeah… you gon' make her lose her mind...\nOoh, girl…\nI know what you like when you think of the perfect man\nI'll bet you didn't think of me!\nAnd that's why I hate you, girl\nBut love is what we make it, girl\nAnd you a little sloppy naked, girl\nYou might wanna tighten that up…\n'Cause ain't no famous celebrity gon' fuck you\nWhen you look like that\nYou gotta get good, start eatin' on the right track\nAnd baby, it's alright that\nThe first night, you let me pipe that\nNever been with no white rapper…\nHow was it?\nOoh, how was it, girl?\nWas it everything you dreamed, or was it disappointing?\nOh shit, that might need some ointment\nOh, girl!\nYou ain't no hoe, you just know what you want\nAnd I got what you need\nOoh, I got what you need\nSo give that pussy to me\nAnd I'mma do the right thing\nI'mma do the white thing\nAnd treat that pussy disrespectfully\nOh, your pussy don't get what it deserves\nI'mma cum fast - it's cool\nJack myself off then I come back\nOoh… fuck that\nBaby, I'll fuck you and rap in your ear at the same time\nPick a song on my jukebox, girl\nAnd I can sing to you\nIf you've got some friends, please bring 'em too\n'Cause we could have a threesome\nSorry, I think I missed that note\nI missed that note\nOh…\nLet me tell you this story\nWhile I was walking at the flea market the other day\nAnd I saw…\nHalf-price lamps\nAnd I scored, 'cause my living room's lacking some light\nSo I bargained with the nice lady and said:\n\"Can I get four for the price of three?\"\n\"It's alright, you see? Just be nice to me.\"\nAnd she said: \"Who the fuck you think I am?\"\n\"This is a 1970 Fiddich lamp, you can't find these anymore\"\n\"They don't even sell them in stores\"\nThat's how serious this dumb bitch was about her lamps\nI said: \"I know your pussy's dry but this dick gon' make it down\"\n\"Fuckin' tramp - that's what you are\"\n\"So bitch, put them lamps in my car\"\n\"And I'mma go home - and I'mma watch late night television\"\n\"Said I'mma watch late night television, girl\"\nI can't pick between Leno or Letterman\nLeno or Letterman? Leno or Letterman?\nAnd I like Fallon too! And I like Kimmel too!\nAnd I like Craig Ferguson\nBut I can't understand a single fuckin' word that he says, girl!\nAll these words in my head, what happened to SNL?\nIt used to be so funny\nAnd who the fuck is Fred Armisen?\nBaby… how'd he get that job?\nBut let me not spend no time\nHatin' on another man tryna get his\n'Cause I'm just tryna get mine\nAnd I'm gettin' off subject…\nIsn't this a love song?\nNO!\nThis is just a fuck song (whoa)\nSo that's what I'mma do…\nOoh… baby, let me tell another story\nEarlier today, I was flippin' through channels on the cable when I\nWhen I came across one of those commercials for sick dogs\nAnd I hate that shit, I hate eatin' a cheeseburger\nAnd watchin' a video about animal cruelty, 'cause I know that shit happens\nBut I like to forget it and enjoy my cheeseburger, yeah\n'Cause I can't help but like it, girl\nI know that… I know they treat those cows like shit\nAnd I ain't really with that\nBut I ain't no gay-ass vegetarian\nI like beef… yeah, I like beef\nOh baby, I like beef\nBaby… oh, let me tell you somethin' else:\nAnd I was on the internet the other day\nDid somethin' a little vain\nI typed myself into Google Verse… Google Search (excuse me)\nAnd what did I see?\nOh, you ask me, what did I see?\nI'll tell you right now\nI saw some shit\nI clicked on the first picture\nAnd I enlarged it to full screen\nAnd what did I see?\nYou wanna know?\nWhat I saw was so disgusting that I wanted to retire\nI'mma tell you now\nWhat I saw, what I motherfuckin' saw\nWhat did I see?\nI had something stuck in my teeth…\nI think it's lettuce, girl\nFrom that turkey burger I ate when I was out at Turkey World\nOh baby, do you like some jerky girl?\nNo, no - fuck that!\nSuck my motherfuckin' dick\nI don't play around - I'mma take this dick, I'mma lay it down\nOh... yo, I'm not gay - I love pussy\nOoh, I dream of pussy - I draw pussy\nI write about pussy like it is some type of false idol\nIt really is - 'cause y'all be prayin' on that pussy\nY'all be worshippin' that pussy\nY'all be on Instagram commenting bitches' pictures\nYou thirsty for that pussy\nAnd I ain't really with that\nOh, I ain't with that, girl… girl… girl…\nWould you fuck me?\nWould you fuck me if I looked more like Channing Tatum?\nIs that the type of guy you like?\nAh…", "image": "https://images.genius.com/70b2ca5e1882a2f184d45a2e6ccb37eb.916x916x1.jpg"}], "artist": "Mac Miller"}