{"songs": [{"title": "Pray for Me", "album": "DIME TRAP", "year": "2018-10-05", "lyrics": "[Chorus: YFN Lucci]\nYeah, from the cracks and the holes in the pavement\nAin't no hope for the youth, Lord, save me\nGotta smile through it even though you hate it\nAll I ask is that you pray for me\n\n[Verse 1: YFN Lucci]\nYou know we always payin' attention\nAlways out handlin' business\nNiggas in they feelins\nCertain shit can't be given\nI'ma go and get it, yeah\nNiggas got they hand out, shit, that ain't the way we livin', yeah\nThat ain't the way that I pictured thirty hoes and ten of us niggas\nSee, that's the way we kick it\nTwetny of us, and ten of us probably got an extension\nEverybody playin' broke 'cause they think I can fix it\nEverything that you got, that shit probably rented\nI know my partners wit' me\nAin't no stoppin' this shit, the sky is the limit, yeahh\n\n[Break: YFN Lucci]\nWho gon' ride wit' me?\nAye, who gon' ride wit' me?\nYeah, death before dishonor but you lied to me, dang\n\n[Verse 2: T.I.]\nMade it to the top from the gutter\nPromisin' the hood I came from it'll never be another, yeah\nRemember trappin' in the hood, duckin' under cover\nBuyin' hard ounces for my momma brother\nTryna block mine, boy, you get knocked out, hah\nI'm wit' the shit you know that you are not 'bout\nOld nigga wit' some long money\nNigga try me, I'ma get it all from ya\nListen, I ain't worried 'bout the small run it\nGot my chrome on his dome then it dawned on him, dead 'em\nPlans too large, huh, nigga get on your ass, you put laws on 'em\nFuck that shit, I'ma still sic my dogs on 'em\nDon't care how many police you call on 'em\nRidin' wit' my niggas 'til the wheel fall\nIf you got the dice, put it all on\nLive by the sword or die by it but sometimes you gotta fall on it\nHey, ain't it funny how the dumbest niggas know it all, don't it?\nNigga, keep it silent, you ain't lived through it, don't talk 'bout it, yeah\nSixteen totin' A-K, havin' turf war\nI got a record deal, started sellin' dope for my first born, I swear\nLook at God, won't he do it\nGotta run a bag up to Summer good 'til the bullshit I did null and void\nSkully pulled up, forty in my hoodie, hah, and you better not make me pull it\nOne thing about a sucka nigga, he gon' talk cash shit 'til he run into me\nDrop a bankroll on his main bitch, make her go and do it for me\nNo Hollywood, couldn't fake my life\nQuarter million cash on a brand new jet\nCrowd me, nah, nobody can do that\nSlide a bag, sip on yac, and let 'em handle that\nTrap nigga whippin' work in a Bando\nYou violate, retaliation got me mando\nI keep a pistol on me 'cause the bands I don't ran 'em\nNumbers scratched out, paper runner\nStrategy used to be take Atlanta\nSpread it then makin' it in Savannah\nRunnin' my play up the East Coast\nI done tested the caliber, YFN Lucci\nKickin' shit in the Caribbean\nKnow you pussy, can't even open eye when you shoot\nWhen you live wit' that bullshit, you die wit' it too\nI would talk but could not be alive wit' the truth\nWhen you owe me and then gettin' fly wit' it too\nBringin' some action, survive wit' it too\nSwear, I'm smokin' on nothin' but power\nI get money and dodgin' them cowards\n\n[Chorus: YFN Lucci]\nYeah, from the cracks and the holes in the pavement\nAin't no hope for the youth, Lord, save me\nGotta smile through it even though you hate it\nAll I ask is that you pray for me\n\n[Break: YFN Lucci]\nWho gon' ride wit' me?\nAye, who gon' ride wit' me?\nYeah, death before dishonor but you lied to me, dang\nWho gon' ride wit' me?\nAye, who gon' ride wit' me?\nYeah, death before dishonor but you lied to me, dang\n\n[Outro: Dave Chappelle]\nThis next beat is so god damn sinister that I don't even, ahhm\nIt makes me feel like everything\nIt's just that nitty, gritty, fuckin' dirty South shit\nIt makes me feel good\nThis right here, this ones for the pull-up", "image": "https://images.genius.com/762209f629de50995145f116f95b5ea9.750x750x1.jpg"}], "artist": "T.I."}