{"songs": [{"title": "Say Now", "album": "Nellyville", "year": "2002-06-25", "lyrics": "[Verse 1: Nelly]\nGun shots ringed out over the city\nAnd had everybody duckin and runnin checkin for any\nKinda shelter cause them peoples man they at it again\nIf you ain't heard or seen it then you better pretend\nAin't got no time for stoppin ain't no catchin your wind\nYa baby mammas on the porch tellin her daughters \"come in\"\nGot fathers grabbin sons \"where the hell have you been?\"\nBoy and y'all just startin young I'm talkin 13 and 10\nThey started tradin in the streets some type of ghetto battles\nBut they ain't hoopin in the gym they hoopin crates in the alleys\nWhere else can you shoot a jump shot\nSlang a rock all from the same spot?\nGot one gang on this half the other gang\nOn the other half of the same block\nGunplay on Monday\nSundays a fun day\nWill it stop one day?\nI can't call it no way\nWhen your gettin started everybody wanna help and get you off\nBut turn around first motherfuckers wanna see you fall\n\n[Bridge]\nSay now (say now)\nCan you hoes come out to play now? (play now)\nSay now (say now)\nCan you hoes come out to play now? (play now)\nSay now (na na na na)\nCan you hoes come out to play now? (na na na na na na na na)\nSay now (na na na na)\nCan you hoes come out\nNa wait a minute na wait a minute na wait a minute na\n\n[Hook: 2x]\nFeel like I'm runnin for the daylight\nTryin ta get my mind right\nAnd just before I die will somebody reach out and snatch it from me\nSay now\nCan you hoes come out to play now?\n\n[Verse 2: Nelly]\n(Hear me out)\nTryin ta put my city on the map and they mad at me\nThe same city some of them live in and they mad at me\nWhen I come down to speak derrty why you mad at me?\nIs it cause the old school freaked out niggas from A to Z?\nEight cd's, tv's, I aim to please\nThey mean the same to me like Biggie to C's\nLike Eazy to E's, 2Pac to overseas\nAnd I done seen more Aaliyah fans fall cry to their knees\nI tell ya, I ain't been livin this life for too long\nAnd I can't count how many times someone has asked me what's wrong\nWhy my mother was gone\nWhy my daddy wasn't home\nAnd the same shit they told me I found myself tellin my own\nNow its good-bye bad nights\nHello good times\nThere ain't no way Ill let no nigga step in my shine\nKeep tryin (keep tryin)\nTheres bound ta be somethin G\nAs long as I'm in STL\nYou in the TIC\nI'll tell ya\n\n[Bridge]\n\n[Hook]\n\nHear me out now\n\nSay now (echose) (4x)", "image": "https://images.genius.com/ee6c6181ebd522da5b345ff9cd0a61f9.1000x1000x1.jpg"}], "artist": "Nelly"}