{"songs": [{"title": "Live from 504", "album": "Da Drought 3", "year": "2007-04-13", "lyrics": "[Intro]\nDro, fuck with me! Yeah\n\n[Verse]\nLive from the 504\nIt's Mr. Crazy Flow\nJumping like a bungee, no rope\nEven in the dungeon I glow\nEven if it ain't sunny I glow\nIf it ain't about money I go –\nNowhere, I'm nailed to the floor\nMoney controls where I go\nIt is the sail to my boat\nAnd it's going down\nIt's going down like there's a whale in the boat\nSee, you can smell that I smoke\nAnd yep, I sip that lean\nYou hit me with that combination, it make my eyes bleed\nI'm a shark in the water, yep, I swim with the big\nSo I don't have time to deal with Willy the Squid\nL-L-Lilly pad niggas, l-l-look at the monster\nY-Y-You don't want to crash, like La-La-La Bamba\nSee it's me, Roney, and Terry\nAnd my new drop is berry\nWatermelon, plum, just call it fruit punch\nI'm an old rapper getting new bucks\nAnd all you new rappers, you're just new lunch\nFlow sick, so sick, need a doc, yes\nA creature, monster, like the Loch Ness\nI gets hotter by the tock, before I sizzle to death\nI just tell the clock, \"Gimme a sec\"\nIn the middle of the war, where my enemy at?\nI'm running this bitch, like Eric Bieniemy back\n'Cause every time I hit a track I'm like an energy pack\nThe instruments are crying out \"Where the sympathy at?\"\nYeah, if you betting money, baby, him'll be back\nWhatever legends look like, bitch, I'm finna be that\nI walked right in hip hop, like \"Where my dinner be at?\"\nI ate that, and I was like \"Where my dinner be at?\"\nI hate that women lie, so I lie to them back\nGot two bitches in my pants, quiet, neither them that\nA lot of bitches want dick, I give a lot of them that\nLet's do a pill, I can fuck you for an hour with that\nAnd to the kids – Drugs kill, I'm acknowledging that\nBut when I'm on the drugs, I don't have a problem with that\nAnd my niggas got guns the size of toddlers, biatch\nAnd we aiming right at your fucking collar, biatch\nPow!", "image": "https://images.rapgenius.com/3c7ad99895d80e7af6a13e7a68557365.1000x1000x1.jpg"}], "artist": "Lil Wayne"}