{"songs": [{"title": "I Love Music", "album": "All 6's and 7's", "year": "2011-06-07", "lyrics": "[Verse 1: Tech N9ne]\nThe, the, the reason that I'm breathin'\nSeeping heat\nIt gets me cheese, why I'm eaten in Bad Season\nWas deep in beef and was needing some beats to release in evenings\nInstead of me being up and bleeding with thieves and heathens wit keys and obstacles\nMade it possible for the flow go to be profitable\nYo Tech audible, his inaugural prada popped and was plausible\nGod is so good for giving me music!\nLiftin', gettin' me through when I was fixing to lose it\nDudes hit Big Scoob's shit and reppin' the blue tip\nFool's skipped when Scoob scritch, we jumped in the 2 whip\nFull clips for who stick the homie for true grip\nMy crew, thanks to music, we all living through it\nGot me out of the ghetto, got me mucho dinero\nIn Cozumel, Mexico shorts and Jordans and a sombrero\nThis gift ain't given from a devil, so settle\nCome and get this rebel music that's hot as a kettle, pendejo\nSaved my life, paid my lights, made my wife, say \"Bye Bye\"\nGave my nights babes, I like preyed my mic\nWould never fade, forever slayed, days I write\nMy cheddar raised up better, faze way high hyped\nMy music's one reason I always get to lay my pipe\nThe reason Tech N9na can comfortably say \"Night, night\"\nBlessed me, with original flow, so Hey! Why bite?\nI hear, I feel, I live, listen and learn\nI like...\n\n[Hook: Krizz Kaliko]\n(I love music)\nYeah, I love (I love music)\nFor real (I love music)\nAnd I need (I love music)\nTo feel (I love music)\nGo and play it (I love music)\nYeah, know what I'm saying? (I love music)\nMy love (I love music)\nKnow what I'm saying?\n\n[Verse 2: Oobergeek]\nAutomatic when I do this\nManually, daily, monthly, annually\nI get a step closer to being the coolest\nAcoustic got me foolin', about to lose it. Ooh, shit\nJump in the grind, and my hom' Mean Mike produced it\nThat's music pahtna\nI'm just a poet with incredible rhythm\nWords arranged will let you know he has incredible in him\nI don't mean to toot my own horn, but toot toot, ha ha\nI laugh because it's easier than do ray mi fa sol la\nTi do, we know he go say what on that C Note\nAnd he can pay a C Note with that B Note\nI'm talkin' truth\nAnd I got stories that I show you that it's walkin proof\nA thousand miles of it and I can show you what I'm walkin' through\nMusic ain't a hobby, it's an organ, of my body, that the creator provided back in January of '92\nSo don't you dare say good music skipped my generation\nYour hatin' ain't nothin' but motivation for these compilations\nOob!\n\n[Hook]\n\n[Verse 3: Kendrick Lamar]\nMusic is my life\nThe reason why I write\nLike Edgar Allan Poe on the beat, like a parasite\nYou thought a parachute made my flow just fall out the sky\nThen you fell apart into a body part no one would buy\nNobody tried my limits cause they're afraid of heights\nThe ambition, weak or gravity let 'em die\nI let you live until a nigga compose a rhyme\nThen it's like a Rhino in your ass every time\nTime and time again I treat my pen like The Pen\nBars harder than Pelican Bay and I been\nServin' a life sentence since the day I was ten\nNine times outta ten you only ten songs deep before you leap\nInto a pool of sharks then swim\nThat's an analogy on the way I do casualties\nAnd I do this shit casually\nBefore the verse end, I'll be in the Hall of Fame with my picture framed, friend\n\n[Bridge: Krizz Kaliko]\nAnd if it wasn't for my music, I wouldn't be standing here!\nIf it wasn't for my music, you wouldn't have nothing to hear, yeah\nAnd I love...\n\n[Hook]\n\n[Outro: Tech N9ne]\nWake up!!!", "image": "https://images.genius.com/7d4c4dfa3d56e3cd0f59836ef122ff24.1000x1000x1.jpg"}], "artist": "Tech N9ne"}