{"songs": [{"title": "Hand on the Pump [Muggs’ Blunted Mix]", "album": "Unreleased & Revamped", "year": "1996-08-13", "lyrics": "[B-Real:]\nWell, I'm an alley cat, some say a dirty rat\nOn my side is my gat, see I'm all of that\nSpittin' out buck shots, boy I'm gonna wet'cha\nRunnin' hot, but I'm still comin' to get'cha\nThinkin' like a peace smoke comin' on a homicide\nYou talkin' shit, tryna take me for a ride\nI'm not a bad guy, but I'm the funky feel\nFinger on the trigger wit' my hands upon a steel\nLettin' out a bullet, this is goin' Boo-Ya\nYa stuck in my hood so what ya gonna do now?\nBein' the hunted one is no fun\nHere I come son, yo I think ya better run\nBetter run more and move a little faster\nSecond of thought and I'm comin' to blast ya\nWith my...\n\n[Hook:]\nSawn-off shotgun, hand on the pump\nLeft hand on a forty, puffin' on a blunt!\nPumped my shotgun, niggas didn't jump!\nLa la la la la la la la\n\n[Sen Dog:]\nComin' at ya like a stiff blow, fuckin' up ya program\nAin't takin' shit from you, him, or no man\nMastermind, maniac, and a menace\nOhhh, how they wanna pass a sentence\nAll because a nigga tried to play me on a trigger\nHe missed, so now the niggas hiss\nRude and crude like a pit-bull, get ta the point\nYour fuckin' card will get pulled, now...\nI'm headed up the river with a boat and no paddle\nAnd I'm handin' out beat-downs\nI'm headed up the river with a boat and no paddle\nAnd I'm handin' out beat-downs\nPut me in chains, tryda beat my brains\nI can get out but the grudge remains\nWhen I see ya punk ass I'm gonna get'cha\nFuckin' do ya, shotgun go BOO-YA!\n\n[Hook:]\nSawn-off shotgun, hand on the pump\nLeft hand on a forty, puffin' on a blunt!\nPumped my shotgun, niggas didn't jump!\nLa la la la la la la la\n\n[B-Real:]\nKickin' that funky Cypress Hill shit\nThink I'll light another for the blunted to chill wit'\nCause I'm the chill one, known to get ill one\nThey stepped to the Hillrun so I had to kill one\nNow I'm headed up the river with a boat and no paddle\nAnd they got me on lockdown!\nNow I'm headed up the river with a boat and no paddle\nAnd they got me on lockdown!\nLivin' like a nigga who done lost his mind\nCause I ain't goin' out like a spineless jellyfish\nSome say, \"Life is a bitch!\"\nAsk that punk who dug his own ditch\nUp on the Hill fuckin' up at a party\nTried to get funny, put a hole in his body\nLa la la la la la la la\nLook at all those funeral cars\nCause of my...\n\n[Hook:]\nSawn-off shotgun, hand on the pump\nLeft hand on a forty, puffin' on a blunt!\nPumped my shotgun, niggas didn't jump!\nLa la la la la la la la", "image": "https://images.genius.com/5bfb3c1df682504d29cac02d808840bd.600x608x1.jpg"}], "artist": "Cypress Hill"}