{"songs": [{"title": "Baby", "album": "The Marshall Mathers LP2", "year": "2013-11-05", "lyrics": "[Verse 1]\nOne thousand different houses and Münchausen, I'ma make you\nWanna punch out some-fuckin'-one: \"Ouch! What the fuck you hit me for?!\"\nScreamed life as I punch counter, in bunches out of anger\nI once encountered a stranger in a dumb gown\nBlack hoodie with a scythe, shit, I laughed in his face, spit\nBitch gave me an extra life, like, \"Take this!\nNow get your ass back in that game, bitch! Don't take shit\nFor granted, and don't take shit, give it!\"\nOnly bull you should take is by the horns, a mixture of Whitey Ford\nAnd Mighty Thor, I everlast, pen is mightier than sword\nFinish writin', then record, replenish, keep writin' more\nNothing's ridin' on it but your pride, that's all you're fightin' for\nSo you fight, scratch, you claw, backs to wall, no one was there to catch you fall\nYou pick yourself back up, you dust your jacket off\nYou grab your balls like they're gargantuan and ask yourself how fuckin' bad you want it\nPull out your badge for whoopin' ass and flash it on 'em\nNobody's gonna back you in the corner, you're a hornet\nNo one's more ignorant than you fuckin' four in the mornin'\nYou're at the laboratory, stormin' like there's nothin' that's more important\nEmcees, you better consider this a formal warnin', you're in for it!\nGirl, what would you do if I said your body was off the chain\nAnd I told you I smile every single time I saw your face?\nI ain't finished, bitch, I meant \"in half\", oil the blades\nNobody wants to play, they say I'm a spoiled lil' baby, but—\n\n[Chorus]\nNobody puts baby in the corner\nI'm only tryna warn ya\n'Cause that baby gets mad and gets to throwin' a tantrum\nHe'll fuckin' flip on ya\n'Cause nobody puts baby in the corner\nI'm only tryna warn ya\n'Cause that baby gets mad and gets to throwin' a tantrum\nHe'll fuckin' flip on ya\n\n[Verse 2]\nWhat goes through an addict's brain besides static pain\nAnd Big Daddy Kane, breakbeats and words? An erratic train\nOf thought like splatter paint, scatter brain\nYeah, maybe that explains why you're back but don't rap the same (Yeah!)\nAnd you're lookin' way thinner 'cause your hunger got you lookin' like\nThey took away dinner (Chicka) \"Sugar Ray\" Leonard\nWouldn't sugar-coat a fuckin' booger though just to wipe that bitch on a hooker's coat\nWhen you say you're a (Chicka) what? (Chicka) GOAT\nNow fling that bitch from your fingertips, hope it lands on\nAnother rap singer's lips who can't think of shit anything of wit\nThat's interesting to spit, yo, who's king of this fuckin' English lit?\nLet your middle fingers flip on each hand while extendin' the shit\nHow low can you go? Lower then Chuck D, ho\nHear the bassiness in my voice? Rocky's back, where my Adrian's?\nNobody's crazy as Shady in an eighty million mile radius\nI'm what Tom Brady is to the Patriots\nTo rap; I'm not a man, I'm a weapon who just happened\nTo be a rapper who just happen to be on the crapper\nWhen it happened I had an epiphany in the bathroom\nI'd never be the same after now I'm back with an appe-\n-tite for destruction and a fuckin' recipe for disaster\nSo let's eat 'cause I'm famished, every deed is a dastardly\nOne, evilest bastard, even you askin' for me to be po-\n-lite to people's like me havin' my teeth pulled\n\n[Chorus]\nNobody puts baby in the corner\nI'm only tryna warn ya\n'Cause that baby gets mad and gets to throwin' a tantrum\nHe'll fuckin' flip on ya\n'Cause nobody puts baby in the corner\nI'm only tryna warn ya\n'Cause that baby gets mad and gets to throwin' a tantrum\nHe'll fuckin' flip on ya\n\n[Verse 3]\nSo step inside a dimension demented side of a mind that's like\nAn inside of an engine while I multiply your undivided attention\nBut be reminded: if I didn't mention\nI lose my mind and my temper you'll be the first one who finds him offensive\nGot him climbin' the fences, lost some time to addiction\nBut look up \"rhyme\" in the dictio-nary, I'm in the picture\n\"Eminem\" is the synonym for it, I'm an enigma\nFuck it, let's get to the meatballs, I'm gonna skip the\nVeg and potatoes, edumacator (They are)\nShit, legends are made of, spit treacherous data\nShit that you would say to your worst enemy\nThis wretched is what you get when you mix Treach with a Jada\nThen combine 'em with Method Man and Redman with metham-\n-phetamines in each left hand, in each right is a sledgehammer\nIn pajamas, standin' in front of a webcam\nBeatin' themselves in the head 'til Russell lets him off Def Jam\nMaybe I need my head exam-ed, Hannibal Lecter with a dead lamb\nHangin' from his ceiling, drippin' with a bed pan\nI need meds, swear to God 'cause if I go off the edge\nT.I. ain't talkin' me off the ledge, man\nHeart-throb that'll fart, ah, nah\nMore like a smart slob, part blob that'll stab you with a sharp ob-\n-ject to the heart and leave claw marks all over the Wal-\n-Mart walls, little baby with large balls\nFuck mud-slingin', I'm blood-flingin'\nThere's nothing on this fuckin' Earth better than bein' the\nKing of the playground, I hate the swings, but I love bein'\nAn underdog 'cause when I'm pushed I end up swingin' (Ah!)\n\n[Chorus]\nNobody puts baby in the corner\nI'm only tryna warn ya\n'Cause that baby gets mad and gets to throwin' a tantrum\nHe'll fuckin' flip on ya\n'Cause nobody puts baby in the corner\nI'm only tryna warn ya\n'Cause that baby gets mad and gets to throwin' a tantrum\nHe'll fuckin' flip on ya", "image": "https://images.genius.com/574efb6325afca1f0c5dd6d31dd92da9.1000x1000x1.jpg"}], "artist": "Eminem"}