{"songs": [{"title": "Pest Control", "album": null, "year": "2016-09-20", "lyrics": "[Clip from Belly]\n\n[Verse 1]\nAll rats gotta die though\nIn New York, Quad Studios, gettin' high though\nOff that sour diesel and that hydro\nThis nigga take an L every time he go viral\nWelcome to the West, and this ain't The Life of Pablo\nStay on that bullshit it's gon' start to feel like Chicago\nKeep it one hunnid, you Nicki Minaj sideshow\nStill chasin' dreams, I made \"Dreams\" in '05 though\nRidin' around, 10 Cam Newtons in the Tahoe\nAnd when we touch down everybody catchin' spirals\nDressed in all black like the Panthers\nWe seen your Sway freestyle, Omelly ain't the answer\n\n[Interlude: Kanye West + Game]\nYou ain't got the answers, man! You ain't got the answers! (Kanye…) You ain't got the answers! You ain't got the answers, Sway! I've been doin' this more than you!\nNiggas ain't got the answers for me\nYou shoulda went and got A.I., left Beans in rehab\n\n[Verse 2]\nYeah, take Beans back to rehab\nOn Instagram lookin' like a mothafuckin' bean bag\nFlyin' through Philly on them Wocky sticks\nPunk-ass nigga, I'll beat you with a hockey stick\nThe nigga Hov gave you the game, you ain't soak it\nYou was s'posed to throw up the Roc, not smoke it\nTalkin' you gon' be in L.A. in three hours\nIt's a 5-hour flight, put this bum in the shower\nPussy, I'm not a rookie, akhi, don't push me\nStrapped, Ninja Turtles, nigga's runnin' with a rat\nNow Tak tell 'em how you coppin' pleas on the jack\nFuck runnin' in the game, you gon' be runnin' into Wack\nYou jumped Quentin Miller and now you don't scrap\nIt was time to go at Drizzy and now you don't rap\nAsk your bitch, she know I beez in the trap\nYou gotta move out of L.A., I'll put them Bs on your back\nAnd Barbie keep her thumb in your butt\nThat Ken doll love gettin' fucked\nHide behind your niggas, you ain't got the guts\nRidin' dirt bikes with your ass on some nuts\nNow you can pop a wheelie to that!\nI went from B-more to New York to Philly and back\nIt's a lot of cheese at stake, this nigga really a rat\nI fuck with Philly, but this nigga make y'all city look wack\nAnd that's on Piru, yeah, I put the P on that hat\nYou get hit with the Eagle, roll a Philly to that\nNow tell the world how you got your bitch\nYou FaceTimed Nicki while Safaree was fuckin' a chick\nYou ain't shit but a rat to me, a snake that don't rattle me\nLil' homie won't scrap with me, time to body his faculty\nI'm in traffic, B, bumpin' this old Cassidy\nMeesha's another casualty, fuckin' with me's a tragedy\nThe louder your scream, the wacker the verse\nI put that dick chaser logo on the back of your hearse\nThey say the meek shall inherit the Earth\nSo I went and dug your ass up, 'cause Drizzy buried you first\nAnd why you tryna pick on Wale?\nYou told me that you don't fuck with Rozay\nAnd YG can't give you a pass\nI add 20 to your 40s, put the 60s on your ass\nAnd don't try to whine to the Grapes\nYou not the Rams, don't come back to L.A\nI fuck around and catch an Uber to Slay\nI'm a drama king, and a street sweeper with a K\nNigga, this is 2Pac mixed with the old Guwop\n15 years, 30 mil', nigga, who flopped?\nOne good song, but you ain't got a classic yet\nBought your first album, ain't took it out the plastic yet\nMove from Philly to L.A. and think he Fresh Prince\nSean Kingston got robbed and now you niggas best friends\nFat sloppy Twinkie eatin' ass nigga\nYou ain't got no pass, nigga, I'ma beat your ass, nigga\nJelly bean smugglin' fuck-ass nigga\nI'll get some clippers and cut your mama's mustache, nigga\nFuck your sister while you watch 'cause she's kinda thick\nAnd make that bitch take a knee, like Colin Kaepernick\nNow back to Squeak Milly, Meeky Mouse\nYou gon' fuck around, get tied up inside Nicki house\nI got esés on Beaumont, posted like Cousins\nWaiting for the word to pump it up, like Joe Buddens\nThou shall not fuck with Chuck, pawns are stuck\nFold you up in boxes; Armani tux\nLouie sweats, armor tucked\nNight night, use that pillow like a silencer, from dawn to dusk\nGet at me, you niggas gon' see me in gloves\nOr see me in clubs with \"Summer Sixteen\" in the snub\nLying on the Internet like you ain't talking to twelve\nGot the cops at my door, like they dropping off mail\nI seen that fake paperwork on XXL\nRat niggas chew through walls and leave you in cells\nBefore you see me in jail, you will see me in hell\nYou went and got the whole Philly, it's just me by myself\nI could have went and got Kendrick, went and got Snoop\nWent and got Nipsey, Jay Rock, ScHoolboy Q\nCould have went and got E-40, brought Ice Cube back\nAnd have Dr. Dre screaming \"Meek Mill is a rat\"\nIt's a wrap, red khakis, red Cincinnati\nI'ma see you in the streets, don't at me\nYou like a boat with a hole you can't sail\nMeek Mill, me and Drake gave you them two Ls\n\n(Ooouuu, Ooouuu, Ooouuu)\nWhen these rats start snitching, break 'em off!\n(Ooouuu, Ooouuu, Ooouuu)\nWhen these rats start snitching, break 'em off!\n\n[Omelly]\nPussy nigga! (Mumbles)\nI got on gold headphones, gold chain\nGold on my wrist, aim (Mumbles)\nIf you ain't getting money, boy, you lame\n\n[Clip from Paid In Full]\n\nYou rat bastard!", "image": "https://images.genius.com/22cf391c20f7fd8a1a0567f0e81ca96d.500x500x1.jpg"}], "artist": "The Game"}