{"songs": [{"title": "Playas Only", "album": "You Know What it Is Volume 3", "year": "2005-06-19", "lyrics": "[The Game]\nBounce, it's the new \"12Play\"\nBounce,(Game y'all) throw the pussy like Elway\nBounce, I wanna see your tail shake\nBounce, when you hear R. Kells say\n\n[R. Kelly]\nPlayers only\nWe where them tricks be jerkin they bodies\nUp in the club where they get real naughty\nThey come from here to the private party\nWhere there ain't nothin but - players only\nWhere the players be spendin a lot of dough\nHonies got ass bouncin on the flo'\nThis is how we do behind the player's do'\n\nShe on the flo\nSurrounded by the players and thugs\nShe on the flo\nThe girls goin bottlin up\nIn VIP\nThe stacks for a bottle of bub\nShe dont care\nShakin ass just throwin it up\nI really like to know her\nThe way she throws her\nBooty up and down she got me heated up\nYou can tell i really wanna beat it up\nShow u how i get the party started up\nWe gon do it till we drop\nUntil the party stop\nWe gon make it hot\nOHH!!\n\n(HOOK)\n\n[The Game]\nI'm still fresh like uhh, Impala uhh\nDre's young gun still ridin the bass, drum\n(Sha) Four times plati-num\n\"Hate it or Love It,\" I'm still number - one\nStill in the hood one hand on my gun\nAnd my trigger finger still make bitches come\nI mean the one with the ring in her tongue\nCompton R. Kelly found her in the slums\nShakin that rump, both hands on her pumps\nSend her home with me, I'll have your girl yellin UHHH\nKels my bitch drunk\nBut her two girlfriends still wanna have, fun\nPass the blunt, let her drink red rum\nBet she ain't never seen the penthouse at The Trump\nMe and R. been around the world\nAnd we'll give it to you just how you like it girrrrl\n\n[R. Kelly]\nGirl you on a mission\nUp in the club, shuttin down competition\nThat way you walk it, talk it, switch it\nAnd when the doors close handle yo' business\nNow make your booty go\n(Boom, boom-boom-boom) break it down now\n(Boom, boom-boom-boom) bring it up now\n(Boom, boom-boom-boom) push it back girl\n(Boom, boom-boom-boom)\n\n[The Game]\nKels you crazy {*repeats*}", "image": "https://images.genius.com/94aac16d9845daeefdcaedcb5eeb289b.360x360x1.jpg"}], "artist": "The Game"}