{"songs": [{"title": "Lil’ Ghetto Boy", "album": "The Chronic", "year": "1992-12-15", "lyrics": "[Intro: Speaker + Second Speaker]\nAnd also-also, all of you Africans, all of you Africans that wanna do things that's working for other people, y'all need to open your own business, save your money, quit paying motherfuckers for jheri curls! Quit paying motherfuckers for perms! Save your money, start your own business, and you true Africans, will have put hundreds to work. This is our future right here, this our future right here!\nThis some shit! The new generation is on! The new generation!\nHey, I'mma tell you right now, if-if if I have to die today, for this little African right here to have a future I'm a dead motherfucker! (You right!)\n\n[Verse 1: Snoop Dogg]\nWake up, jumped out my bed\nI'm in a 2 man cell with my homie Lil 1/2 Dead\nMurder was the case that they gave me\nDear God, I wonder can you save me\nI'm only 18, so I'm a young buck\nIt's a riot, if I don't scrap, I'm getting stuck\nBut that's the life of a G, I guess\nEse's way deep, shanked two in the chest\nBest run 'cause brothers is dropping quicker\nUh, too late, damn, down goes another nigga\nBouncing off the walls, throwing them dogs\nGetting that rep as a young hog\nIt ain't nothing like the street life\nYou better be strapped with your shank, cause ain't no fist fight\nSo I guess I gots to handle mine\nSince I did the crime, I gots to do my time\n\n[Hook: Daz Dillinger + Donny Hathaway]\nThem say me grow up to be nothing\nLook at me now and tell me what you see\nI am what I am, it's only me\nLittle ghetto boy\nPlaying in the ghetto street\nWhat'cha gonna do when you grow up\nAnd have to face responsibility?\n\n[Verse 2: Dr. Dre]\nNow I'm holding a dub, sitting on swoll\n27 years old, up for parole, stroll\nI'm back up on my feet with my mind on the money\nThat I'll be making soon as I touch the streets\nThings done changed on this side\nRemember they used to thump but now they blast, right\nBut it ain't no thang to me\nCause now I'm what they call a loced-assed OG\nThe little homies from the hood with grip\nAre the ones I get with cause I'm down to set trip\nNigga, I'm bigger than you, so what you wanna do?\nDidn't know he had a .22\nStraight sitting behind his back\nI grabbed his pockets and then I heard six caps\nI fell to the ground with blood on my hands\nI didn't understand\nHow a nigga so young could bust a cap\nI used to be the same way back\nI guess that's what I get (For what?)\nFor trying to jack them little homies for they grip\n\n[Hook: Daz Dillinger + Donny Hathaway]\nMe learn many things from what me see from the street\nThe outcome of what I've come to be\nLittle ghetto boy\nPlaying in the ghetto street\nWhat'cha gonna do when you grow up\nAnd have to face responsibility?\n\n[Verse 3: Snoop Dogg]\nSomething for the real OGs to get with\nSome facts, made our made, now you wanna run and play\nLike every single day, really doe\nYou know me, I'm the smooth macadamien, gaming them for my homie\nNo needing being calm if you pack right\nAnd learning just enough to keep your sack right\nLate nights, I wonder what they getting for?\nEarly morning on the corners, what they hitting for?\nSeven young G's put they serve down\nIn a G ride, east side's where they swerve now.\nNot thinking about what's really going on\nGot crept on, stepped on, now they gone\nI spent 4 years in the county with nothing but convicts around me\nBut now I'm back at the Pound\nAnd we expose ways for the youth to survive\nSome think it's wrong but we tend to think it's right\nSo make all them ends you can make\nCause when you're broke, you break, check it out\nSo ain't no need for your mama to trip\nCause you's a hustling-ass youngsta, clocking your grip\n\n[Hook: Daz Dillinger + Donny Hathaway]\nNow me finally grown as you can see, still an OG\nFor life and always remain to be\nLittle ghetto boy\nPlaying in the ghetto street\nWhat'cha gonna do when you grow up\nAnd have to face responsibility?", "image": "https://images.genius.com/f069b7a57cd614d79e5dba8ee92f08f8.944x937x1.jpg"}], "artist": "Dr. Dre"}