{"songs": [{"title": "Cold Hearted", "album": "Dreams Worth More Than Money", "year": "2015-06-29", "lyrics": "[Intro: Meek Mill]\nYeah, la-da-da, la-da-da-da, yeah\n\n[Verse 1: Meek Mill]\nI never had a role model\nI was loading gold hollows in my little Glock-40\nA little shorty, heart colder than December in the morning\nAnd I think it was December when they swarmed me\nNiggas is jealous, fuck can they tell us\nWith them dreams they try to sell us? Probably why I'm rebellious\nTo a fraud nigga, I lost niggas when I got paper\nIt's like more money I made, they got faker\nAnd it's crazy when your best friend turn into your top hater\nWanna roll out on you and smoke you like top paper\nDamn, what a feeling when you and your homie chilling\nAnd you know he got thoughts of probably robbing and killing you\nMomma said don't ever, ever let them belittle you\nAnd stay away from them haters cause they'll riddle you\nLast year was like a bad year\nEven though I touched more paper than a cashier\nSmall circle, I ain't never really 'round squares\nThey say there's levels to this shit, you niggas downstairs\nDifferent floors for different bulls\nDifferent tours on different jets, my niggas saw\nDifferent city with different bitches and different whores\nSometimes I look in the mirror, Meek Milly, this your car?\nLook at your arm, check out your neck, look at your charm\nAnd to think my niggas started off with cooking raw\nWhen it was hard the coach told me to get the ball\nI step back for the three, watch it go swish and fall\nAnd that was and-one, they thinking how we get this far?\nWe was just down by three and they thought we took a loss\nThey couldn't D me like Earl Boykins, I'm sticking soft\nTried to pick me off like Champ Bailey but I'm Randy Moss\nAnd I ran it all for the touchdown, what now?\nGold AP all bust down, fuck clowns\n\n[Hook: Meek Mill]\nMy heart getting cold, and the streets getting colder\nThey said I wouldn't make it no way\nI think my heart getting colder, my heart getting cold\nTold them I would make it one day, only Lord knows\n\n[Verse 2: Meek Mill]\nDedicated, determinated and disciplined\nWhen Diddy, Hova, and Baby talking, I'm listening\nWhen I be in the jungle, the Devil be whispering\nSlugs flying by me I hear them, they whistling\nThat was a close call\nStand up nigga so I won't fall\nMy teacher told me I would never go far\nSeen him last week, he was my chauffeur, I was like \"told y'all\"\nMommy was a booster, daddy was a shooter\nSo they couldn't blame me when I went and copped a Ruger\nLooking at my homies, see the ghost of Freddy Krueger\nCause if he catch you sleeping he's gon' knock out your medulla\nOblongata, I'm a father and my son don't see a lot of\nIf I don't get he gon' probably end up with a chopper\nIn a field out in Philly do you feel me?\nTold my momma I won't let these haters kill me\nGetting high even though it might derail me\nAnd I won't ever let these bitches see the real me, do you feel me?\nTimes change like the Rollie did\nNow I'm killing these niggas the way that Kobe did\n\n[Interlude: Diddy]\nAyo, it gets fucked up when your own family start calling you up\nShit, money's the root of all evil\nFamily start telling you \"you acting different nigga\"\nYou're goddamn right I'm acting different\nWith all this motherfucking money\nBut then when it comes from your brother, your sister\nYour mother, your father, that shit hurts you to the core man\nWhen they start acting like something that you ain't never motherfucking seen\nYou done grew up motherfucker\nThey gave birth to you, know what I'm saying?\nYou got raised, you done played in the park with them\nThis money thing, this shit will fuck you up man\nYou got to watch what you ask for\nYou sure you want this son? You sure you want this money?\nYou sure you want this fame? You sure you want this power?\nShit have your own mama talking to you like you ain't shit\nYeah everybody want it, everybody need it, money motherfuckers\nGet money don't stop but I ain't mad at them\nShit, but shit even bosses got feelings you know?\nDear mama, dear papa, family, we're all we got\nDon't let this money bring us down\nShit, everybody eats B, everybody eats, everybody eats\nLet's go, hahahah\n\n[Verse 3: Meek Mill]\nUh, yeah\nAnd we started off as kids, stomach's touching our ribs\nAnd them streets all night like we ain't have nowhere to live\nI remember Sundays we ain't have nothing but Liv\nThirty thousand was the tab and you ain't have nothing to give\nI ain't trip, I ain't trip, I pour bottles, I ain't sip\nI let niggas shine bright, you still act like I ain't shit?\nLet you have them little hoes, they was all on my dick\nAnd your main wanted to fuck me nigga, I ain't hit\nTwenty chains, eight watches, can't fit on my wrist\nWhen I speak about them things I never said it's my shit\nI said it's ours nigga and when you're ready we're gonna ball nigga\nLike Kobe Bryant, Metta Peace and Gasol, nigga\nBut I know just what I saw nigga\nIt was envious, you looked sideways and I remembered it\nThe reason that my heart's cold now on some December shit\nYou used to give thanks for giving on some November shit\nTalking about the twenty-fifth, matter of fact the twenty-sixth\nMaybe it's the twenty-eighth, fuck it though my money's straight\nAs long as Papi smiling\nI'mma be on airplane mode flier than a pilot\nI've seen it, I've seen it\nJealousy in your eyes, I swear that look was deceiving\nAnd I was surprised man I ain't want to believe it\nYou said you would ride but shit, I know you ain't mean it\nBut yeah nigga I've seen it\n\n[Hook: Meek Mill]\nMy heart getting cold, and the streets getting colder\nThey said I would't make it no way\nI think my heart getting colder, my heart getting cold\nTold them I would make it one day, only Lord knows", "image": "https://images.genius.com/1a5cda77113ea2b18bfbec0f3ffbaf69.1000x1000x1.jpg"}], "artist": "Meek Mill"}