{"songs": [{"title": "Can I Love", "album": "Young, Broke, and Infamous", "year": "2010-12-17", "lyrics": "[Intro]\n\"I wrote a bunch of letters but—\nI thought it made me look like a fool\nSo I never mailed any of them out\"\nI just wanna talk to you girl, mama you know are...I just got something I wanna say...\n\n[Verse 1]\nBaby do you remember\nWarm summers and cold winters\nSongs by soul singers the feeling it still lingers\nElevated by my kiss as you melted between my fingers\nBabygirl, sometimes I wish\nThat I could just rewind this shit and take it back\nI had visions but they just faded black\nMy train of thought is on a different track\nWhen you’re in love it’s hard to separate fiction from fact\nYour image in my head, and I’m trynna get rid of that\nBut you’re always on my mind like a fitted hat\nBaby girl, I wanna bring it back to puppy love\nWhen you was sent from up above to care for me\nSaid that you’d always be there for me\nAnd even though you’re gone, it’s like you never left\nCuz you always in my heart and still take away my breath\n\n[Hook]\nCan I love?\nBabygirl, can I love?\nI said mama can I love?\nYeah, can I love?\n\n[Verse 2]\nI wanna laugh with you\nRun the water and take a bath with you\nStay up late and watch romantic comedies\nWhen it comes down to it you’re my hearts commodity\nYea, and now I’m feeling like a fool\nWriting love letters that you’ll probably never get\nAnd right now, I love you more than I’d like to admit\nBecause we’re separated\nUnto you this song is dedicated\nI’m love sick and I need you to medicate it\nFeeling devastated\nI think about the past and now I hate it\nCause all it proves is that we never made it\nSee me and shorty got history like a textbook\nBut lately our positon is changed like that sex book\nMs. Independent she the type to hold her own\nLate night contemplating all alone\nThe kingdom is empty without the queen upon the throne\n\n[Hook]\nCan I love?\nBabygirl, can I love?\nI said, Mama, can I love?\"\nI'mma ask you, can I love?\"\n\n[Verse 3]\nThey say there’s many more in the sea\nBut rather then go fish I play solitare\nI look around and see you everywhere\nBut at the same you’re never there\nFingers through your hair\nReminiscing bout when and where\nRemember when we pulled up to that spot and did it there\nSee I hate to watch you walk away\nBut I love to watch you come\nBaby girl you’re so lustful then innocent when it’s done\nThe love we share is like a fine wine\nCuz no matter what happens, it only gets better with time\nBaby girl you’re so fine that I had to take the time\nTo articulate this rhyme with you in mind, you’re so divine\nAin’t no matter who you’re fucking with\nOr no matter who I’m fucking with, you’ll still be mine\nWill we make it? I don’t know\nThe only thing that will tell us is time\n\n[Hook]\nCan I love?\nBabygirl, can I love?\nI said, Mama, can I love?\"\nI'mma ask you, can I love?\"", "image": "https://images.genius.com/0f21a1e2589d732e4a263527296e9f51.500x500x1.jpg"}], "artist": "Logic"}