{"songs": [{"title": "I Don’t Like the Look of It", "album": "I Am Not a Human Being", "year": "2010-09-27", "lyrics": "[Intro]\nI don't like the look of it\n\n[Verse 1: Gudda Gudda]\nOkay, I'm sippin on the syrup, got a nigga movin slow\nI'm all about the money, what the fuck you think I do it for?\nBitch don't act like you don't know, I'm killin all these rap niggas\nCustom made caskets for yo' motherfuckin funeral\nKeep the women with me, shit I gotta keep like two or more\nParty everyday, like we won the fuckin Super Bowl\nChillin wit my nigga Mack, he keep bitches handy\nWhite girl on the table, let 'em sniff the nose candy\nWhen I'm walkin by, the women sayin, \"Who is that nigga?\"\nI replied, \"Hi, I am Gudda Gudda, that nigga!\"\nI was raised in the home of the cap splitters\nWhip on 24's, watch it crawl like a caterpillar\nI come with a toy boy like a Happy Meal\nAnd you's a motherfuckin duck, Daffy Dill\nI'm from the school of hard knocks, where we scrap and kill\nPick the knife or gun or you can get the package deal\nI'm hot nigga, burnin everything around me\nI was lost for a minute, took a while but I found me\nThe streets say I'm king but the game'll never crown me\nRealest nigga doin it just ask the niggas 'round me\nSo you cain't size me up or try to clown a-\nShark in the water, jump in and I'mma drown ya\nNew Orleans nigga, gun out, I'mma down ya\nPut niggas to sleep like a muthafuckin downer\nI'm a Great White, you'se a flounder\nFish and a bitch, I tuna eveything around ya\nU-Haul Gudda, movin everything around ya\nIt's Young Money, bitch! At the top is where they found us, nigga\n\n[Verse 2: Lil Wayne]\nUh, goons on deck, Marley don't shoot 'em\nSilence on the gun, watch a nigga mute 'em\nThe coach in the booth, call me Jon Gruden\nSchool these niggas, they all my students\nAll jokes aside, I ain't playin with ya\nThe weed broke down, like a transmission\nTha chopper spin him 'round, like a ballerina\nBitch I'm still spittin like I ate a jalapeno\nI'm from uptown, my bitch from Argentina\nMy pockets on fat like Joey Cartagena\nStunt so hard, it's all y'all fault\nAnd when it come to beef, give me A1 Sauce\nI ain't worryin 'bout shit, everything paid out\nYou could catch me courtside in Dwayne Wade house\nWith a high yellow thick bitch wit her legs out\nCash Money president, but we in a red house\nWho the fuck want it? Make my fuckin day\nI blow your candles out, now nigga cut the cake\nI gotta eat, bitch! Like a runaway\nY'all niggas ain't eatin, stomach ache\nOkay, all these bitches, and niggas still hatin\nI used to be ballin, but now I'm Bill Gatein\nFuckin with my iPhone, bumpin' Illmatic\nI'm on the road to riches, there's just a lil' traffic\nHair still platted, thuggin is a habit\nKeep my guitar, hip hop Lenny Kravitz\nBunch of bad bitches and I fuck 'em like rabbits\nDope dick Weezy, ya girlfriend an addict, uh", "image": "https://images.genius.com/4961f298812e90e0d45e2664f95cfcd7.1000x1000x1.jpg"}], "artist": "Lil Wayne"}