{"songs": [{"title": "Musketeers of Pig Alley", "album": "The Lex Diamond Story", "year": "2003-12-16", "lyrics": "[Raekwon]\nCrack that pineapple open\nVision of break faces, gettin' money lay in the boats\nGot big rifles, play the hood, ride Benz cycles\nY'all mens are psycho, Killah Hill 'ciples\nMore fly generics, money make moves, forget it\nWe got this locked since nineteen-seven\nSo many rods and weapons, ain't no more reppin's\nTake the shit back, faggot, we hate that\nMeet the real, we lock the real, me/him lock the steel\nPop off, pull out, drop them bills\nI run with all real killas, all for realers\nNikes on, awesome gorillas\nWant more then kill 'em, front war, reveal 'em\nI want him stretched out, listen, he lost the buildin'\nAll fly gangstas, more bankers, hundred wit' us\nWe ex-dust niggas, don't even touch my drink\nFuck around, get shanked, stabbed, shot and broke\nYa' yolked and he blast-es through you in the faint\nAll my niggas get paint, yo what's my name?\nLexus Diamond, Ice Water Inc\n\n[Interlude: Masta Killa]\nHuh.. (uh-uh-uh-uh)\nUh! Yeah!\nOnce again in the motherfuckin' place\nFix yo' motherfuckin' face, nigga\nYeah.. you know how we gets down\nMe and this mixo, we so.. we so tight\nLex Diamond sound, and uh\nI bees the High Chief, Jamel Arief\nStraight from East Medina\nAnd uh.. yo.. yeah!\nYeah.. huh!\n\n[Masta Killa]\nThey started jammin' in the park, just after dark\nTwo turntables and their DJ scratchin'\nWords seemed to have an attraction when they rhymin'\nHip-hop caused the guns to start sparkin'\nTemperature risin'\nDrape a nigga up with the ratchet, less talkin'\nCaught him on the 'nard, bomb like a G. hard\nExplosion rocks the Promenade, I'm God\nAnd he show and provin', 'knowledge how he movin'\nSmift as the wisdom, move from my gate in a drunken state\nI wrote this degree, adjust ya eyes in the light so you could see\nNever fall victim, dictate the fate\nLeave the bake for the snake\nIf he take than I take his head without question\nIn the one to fourteen check the Justice lesson\nNow uh!\n\n[Interlude: Inspectah Deck]\nUh! It's the pineapple Daquiri fuckin' up ya mindstate\nYa heard? (Yeah) Spread the motherfuckin' word\nYo!\n\n[Inspectah Deck]\nI'm from where it's real, niggas peal ya' orange\nWe want enough bricks that we could build apartments\nI. General in the field of marksmen\nThe Bad Boys wit' me ain't Will or Martin\nFeel what I'm droppin', I spit the ill doctrine\nSpot him deep in the Killah Hill poppin'\nTwo feet dug in the dirt, up to the skirt\nSpectator on the sideline lovin' the work\nAnd my team ain't ya' average, CREAM we handle it\nFiends seekin' packages, beams and banana clips\nFesto! If you wit' me, let's go!\nThe nymphos love me, X-O, X-O\nBoy listen hard, think twice before you get involved\nWe hold the weight like cons in the prison yard\nThey call the riot squad, we live and in charge\nY'all non-beleivers get reminded with scars\nIt's the pineapple, Rebel I. natural\nFine wine hundred proof, spittin' mine at you\n(CHUH-PUGH! Nigga!)", "image": "https://images.genius.com/8703b73c19201fea3baccb6c300ec07e.1000x1000x1.jpg"}], "artist": "Raekwon"}