{"songs": [{"title": "Say What", "album": "Tical 0: The Prequel", "year": "2004-05-18", "lyrics": "[Intro: Missy Elliott (Method Man)]\nYeah!\nThis-this-this-this\nThis is an exclusive (let's go)\nMr. Meth, you're so Def, you put them other M.C.'s out to rest (that's right)\nAnd they test (uh-huh), but they forget (yeah) how the M-E-F is so Def (let's go)\n\n[Method Man]\nYo, uh, come on, come on, now\nBig Meth attack soon as the track come on now\nZone out, with Sean Combs and Bizzy Bone out (I see you in the club)\nAnd by one, I'm gettin' thrown out\nMami, got her toes out, ain't one army can Blaze Johnny\nLike Gwen Stefani, you know there's No Doubt\nI'm trill, sick with it, it's like ill\nThat's the only way to explain these mic skills\nOn Homicide Hill, anybody asks is real\nThe more steel, the more bodybags to fill\nCan I get, hit of that hydro, nigga\nI tried to quit puffin' before, but I'm no quitter\nIf honey show me her buns, I'll show her my ones\nIf the bed rockin', keep knockin' and I'mma cum\nWant some, take some, I get it crunk\nSpeak junk, I'll slow up your road with speed bumps\n\n[Hook: Missy Elliott w/ P. Diddy doing ad-libs]\nWhen they play this in the club (say what?)\nGo and tell that nigga, bump that (say what?)\nThrow your hands up, like nigga, what? (say what?)\nYa'll don't really really want that (say what?)\nAnd for whatever muthafucka, don't like it (say what?)\nTell that sucka he can get back (say what?)\nMisdemeanor and Meth in your area (say what?)\nAre ya'll ready? Come on, play it back (saw what?)\n\n[Method Man]\nYou wanna front, what? Step up and get bucked\nAnd if your feelin' lucky, duck, then press ya'll luck\nYa'll got me effed up, over tracks overreact\nOnce I start, like a bullet, ain't no holdin' me back\nI'm all that and two mac's, ya'll fakin' jacks\nWhen I cock back like Busta Bust and make 'em clap\nHere I go again, who blow in like whirlwinds\nWho kiss girlfriends, that kiss they girlfriends\nGot to get it, and when I'm gone\nYa'll bury me with chrome, and tell hell I'm comin' home\nI'm poison, see my skull and crossbones\nGot aim like them kids in Iraq who toss stones\nAnd I got drugs in my system, we thugs in the system\nThat put slugs in victims, Mr. M-E to F, bomb threat\nAs long as I ain't no game, there's no contest\n\n[Hook]\n\n[Method Man]\nTicallion is phatter than your fattest chrome chain\nI guess that should explain why I given the dope name\nAin't nothin' free, everything got a fee\nHow the fuck you got a car and ain't got a pot to pee?\nI'mma grown man, so I do grown man things\nWhy take half, when I can have this whole damn thing?\nIt's Meth, baby, drop top, navy Mercedes\nI'm number one like P.E. or Tracy McGrady\nIt's all good, everything I spit, all hood\nAnd if ya'll gave me one wish, niggas, I wish ya'll would\nWho John Blaze? Uh, when ya'll gon' learn huh\nWhen I burn son, stick a fork in him he's done\nAnd ladies love to play, like Ladies Love Cool J\nFor the right CREAM, the'll do anything you say\nShe Ice Cream, I'm caked up with icing\nMr. Sandman, come on, bring her a pipe dream\n\n[Hook]\n\n[Outro: P. Diddy]\nLet's work... come on\nDef Jam! Mr. Meth, Missy, Bad Boy\nHitmen baby, let's work, come on\nLet's work, come on, yeah\nUh, let's work... aiyo pass that nigga\nJoe Hooker, I see you, let's work, yeah", "image": "https://images.genius.com/b570b137bfca42564ca115c745cf3a4c.500x500x1.jpg"}], "artist": "Method Man"}