{"songs": [{"title": "Wots Up", "album": "Grown Man Sh!t", "year": "2005-04-25", "lyrics": "[Intro: Proof]\nTurn table terrorist\nDJ Sublime record\nYo, what's up?\nI wanna know what's up? (D12)\nHey y'all, it's Em production right here\nGive it up, Slim Shady, he make good beats too\nThis his production, he told me he don't like this track\nNo, you know what I'm sayin'\nBut like, I like it though\nFuck it, mixtape\n\n[Verse 1: Proof]\nAnd you know it's all in this life without Christ to keep sane, nigga\nStaying hot, loyal through plot, drinking the same liquor\nMore whack, dap dap, call him the brain splitter\nFuck around, tryna get it now, push the cane sniffer\nHe excuse, nigga a dog, it's all the same difference\nFlashy or snatchy, see if your chain fit us\nLeaving with, leaving with whoever came with us\nCome out what we call the fool's system, the fame bit us\nThe gang bit us, no jitters, we keep a steady hand\nWhile you deep in these streets, we already ran\nListen man, don't let your feelings wrestle your heart\nThere's like a bleeding drum, man, I wrestle y'all short\nLook, life don't like you, I suggest that you part\nGot some wolves in the club and they eat your flesh in the dark\nHeartless like organ donors\nMorning light 'til the morning, this they can't even hold the corners\n\n[Chorus: Proof]\nWhat's up?\nThe same records that be motherfucking asking y'all\nWhat's up?\nHold the phone, what y'all wanna do to me\nWhat's up?\nD12 back in this bitch ass, we\nWhat's up?\nHeard me for life, Detroit say\nWhat's up?\nAll my real motherfuckers say\nWhat's up?\n50 Cent, G Unit say\nWhat's up?\nObie Trice, motherfuckers say\nWhat's up?\nIt's Shady Records, nigga come on\n\n[Interlude: Proof]\nD12 nigga, we back in the house\nBig growth, straight from the grave\nRecording artist, Conniver busy\nSlim motherfucking Shady\nDJ Sublime right\nOh, we tryin' something\nLloyd Banks, motherfucking ayo\n50 Cent, see I'm screwed up\n\n[Verse 2: Horny Mac]\nHold on bih, what's up baby?\nIt's your man's Mac Miller, you know aka penny scrappy\nYou know, you know how we get down baby\nBut yo, what's up with, what's up with the D\nYou know how we do it in the D, baby\nRecognize, you know seven mile\nSchool crowd, you know how we do it\nAll the way back to PA\nYou know we smacking niggas all day, cuz\nThese niggas don't want no trouble\nThis is how we get down in the d\nNiggas don't understand how we get down\nSo let me tell you 'bout my nigga Grimwald and steak\nYou know, dope low, snacks\nYou know, my niggas\nMy nigga Dirty Mike back in the coupe, popping Xan's\nYou know how we get down\nYou know, the rappers who were running the D back in the day, back then\nGetting money, we still getting money though\nSo continue to keep smacking that ass like it in the club\nKnocking they ass out in the park\nYou know but you\nRemind me back to a time right and let me do this again, right\nYou know? Just warming up", "image": "https://images.genius.com/28ff9193e1357f6fde4a825e763f7ce0.593x593x1.jpg"}], "artist": "Proof"}