{"songs": [{"title": "Walk On Water/Stan/Love The Way You Lie (SNL Medley)", "album": null, "year": "2017-11-18", "lyrics": "Walk On Water\n\n[Chorus: Skylar Grey]\nI walk on water\nBut I ain't no Jesus\nI walk on water\nBut only when it freezes\n\n[Verse 1: Eminem]\nWhy are expectations so high? Is it the bar I set?\nMy arms, I stretch, but I can't reach\nA far cry from it, or it's in my grasp, but as\nSoon as I grab, squeeze\nI lose my grip like the flyin' trapeze\nInto the dark I plummet, now the sky's blackening\nI know the mark's high, butter–\nFlies rip apart my stomach\nKnowin' that no matter what bars I come with\nYou're gonna harp, gripe, and\nThat's a hard Vicodin to swallow, so I scrap these\nAs pressure increases like khakis\nI feel the ice cracking, because—\n\n[Chorus: Skylar Grey]\nI walk on water\nBut I ain't no Jesus\nI walk on water\nBut only when it freezes\n\n[Verse 2: Eminem]\nIt's the curse of the standard\nThat the first of the Mathers discs set\nAlways in search of the verse that I haven't spit yet\nWill this step just be another misstep\nTo tarnish whatever the legacy, love or respect\nI've garnered? The rhyme has to be perfect, the delivery flawless\nAnd it always feels like I'm hittin' the mark\n'Til I go sit in the car, listen and pick it apart\nLike, \"This shit is garbage!\"\nGod's given me all this, still, I feel no different regardless\nKids look to me as a god, this is retarded\nIf only they knew, it's a facade and it's exhaustive\nAnd I try not to listen to nonsense\nBut if you bitches are tryin' to strip me of my confidence\nMission accomplished\nI'm not God-sent, Nas, Rakim, 'Pac, B.I.G., James Todd Smith\nAnd I'm not Prince, so…\n\n[Chorus: Skylar Grey]\nI walk on water\nBut I ain't no Jesus\nI walk on water\nBut only when it freezes\n\n[Post-Chorus: Skylar Grey]\n'Cause I'm only human, just like you\nMaking my mistakes, oh if you only knew\nI don't think you should believe in me the way that you do\n'Cause I'm terrified to let you down, oh\n\n[Verse 3: Eminem]\nIt's true, I'm a Rubik's — a beautiful mess\nAt times juvenile, yes, I goof and I jest\nA flawed human, I guess\nBut I'm doin' my best to not ruin your ex–\nPectations and meet 'em, but first\nThe \"Speedom\" verse, now Big Sean\nHe's goin' too fast, is he gonna shout or curse out his mom?\nThere was a time I had the world by the balls, eatin' out my palm\nEvery album song I was spazzin' the fuck out on\nAnd now I'm gettin' frowned and clowned on\nBut the only one who's looking down on\nMe that matters now's DeShaun\nAm I lucky to be around this long?\nBegs the question though\nEspecially after the methadone\nAs yesterday fades and the Dresden home\nIs burnt to the ground, and all that's left of my house is lawn\nThe crowds are gone\nAnd it's time to wash out the blonde\nSales decline, the curtain's drawn\nThey're closin' the set, I'm still pokin' my head from out behind\nAnd everyone who has doubt, remind\nNow take your best rhyme, outdo it, now do it a thousand times\nNow let 'em tell ya the world no longer cares or gives a fuck about your rhymes\nAnd as I grow outta sight, outta mind, I might go outta mine\n'Cause how do I ever let this mic go without a fight\nWhen I made a fuckin' tightrope outta twine?\nBut when I do fall from these heights though, I'll be fine\nI won't pout or cry or spiral down or whine\nBut I'll decide if it's my final bow this time around, 'cause—\n\n[Chorus: Skylar Grey]\nI walk on water\nBut I ain't no Jesus\nI walk on water\nBut only when it freezes\n\n[Post-Chorus: Skylar Grey]\n'Cause I'm only human, just like you\nI've been making my mistakes, oh if you only knew\nI don't think you should believe in me the way that you do\n'Cause I'm terrified to let you down, oh\nIf I walked on water, I would drown\n\n[Outro: Eminem]\n'Cause I'm just a man\nBut as long as I got a mic, I'm godlike\nSo me and you are not alike\nBitch, I wrote \"Stan\"\n\nStan\n\n[Chorus: Skylar Grey]\nMy tea's gone cold\nI'm wondering why I got out of bed at all\nThe morning rain clouds up my window\nAnd I can't see at all\nAnd even if I could it'd all be gray\nBut your picture on my wall\nIt reminds me that it's not so bad, it's not so bad\n\n[Verse 1: Eminem (as Stan)]\nDear Slim, I wrote you, but you still ain't callin'\nI left my cell, my pager and my home phone at the bottom\nI sent two letters back in autumn, you must not've got 'em\nThere probably was a problem at the post office or somethin'\nSometimes I scribble addresses too sloppy when I jot 'em\nBut anyways, fuck it, what's been up, man? How's your daughter?\nMy girlfriend's pregnant too, I'm 'bout to be a father\nIf I have a daughter, guess what I'ma call her?\nI'ma name her Bonnie\nI read about your Uncle Ronnie too, I'm sorry\nI had a friend kill himself over some bitch who didn't want him\nI know you probably hear this every day, but I'm your biggest fan\nI even got the underground shit that you did with Skam\nI got a room full of your posters and your pictures, man\nI like the shit you did with Rawkus too, that shit was phat\nAnyways, I hope you get this, man, hit me back\nJust to chat, truly yours, your biggest fan, this is Stan\n\n[Chorus: Skylar Grey]\nMy tea's gone cold\nI'm wondering why I got out of bed at all\nThe morning rain clouds up my window\nAnd I can't see at all\nAnd even if I could it'd all be gray\nBut your picture on my wall\nIt reminds me that it's not so bad, it's not so bad\n\nLove the Way You Lie\n\n[Chorus: Skylar Grey]\nJust gonna stand there and watch me burn\nWell, that's all right\nBecause I like the way it hurts\nJust gonna stand there and hear me cry\nWell, that's all right\nBecause I love the way you lie\nI love the way you lie\n\n[Verse 1: Eminem]\nI can't tell you what it really is\nI can only tell you what it feels like\nAnd right now there's a steel knife in my windpipe\nI can't breathe, but I still fight while I can fight\nAs long as the wrong feels right, it's like I'm in flight\nHigh off her love, drunk from her hate\nIt's like I'm huffin' paint\nAnd I love her the more I suffer, I suffocate\nAnd right before I'm about to drown she resuscitates me\nShe fuckin' hates me, and I love it, “Wait!\nWhere you going?”, “I'm leaving you.” “No, you ain't\nCome back!” We're runnin' right back, here we go again\nIt's so insane, 'cause when it's goin' good it's goin' great\nI'm Superman with the wind at his back, she's Lois Lane\nBut when it's bad it's awful, I feel so ashamed\nI snap, “Who's that dude?”, I don't even know his name\nI laid hands on her, I'll never stoop so low again\nI guess I don't know my own strength\n\n[Chorus: Skylar Grey]\nJust gonna stand there and watch me burn\nWell, that's all right\nBecause I like the way it hurts\nJust gonna stand there and hear me cry\nWell, that's all right\nBecause I love the way you lie\nI love the way you lie\nI love the way you lie", "image": "https://images.genius.com/b2ea8d981cb947d1c03afd85eebfe62a.630x630x1.jpg"}], "artist": "Eminem"}