{"songs": [{"title": "Fuck Beanie Sigel (Freestyle)", "album": null, "year": null, "lyrics": "[Jadakiss]\nYo when I met you, you was on my dick\nJigga gave you his old Bentley's, now you on some shit\nAnd I don't know where they found you son\nBut since ya pops ain't around I'mma punish you and ground you son\nAnd niggas can't stand you Sigel\nYa flow is mine anyway so don't bite the hand that feed you\nThem niggas that gassed you is ass too\nTrust me, them niggas don't wanna shoot 5 dawg they rusty\nBelieve or not, the ghetto is mine\nAnd when I see you, I'mma put ya cornrows on the yellow lines\nI got niggas in Philly that been where you live\nFuck Scarface, my bullets hit women and kids\nWorst mistake was trying for me\nAnd you can bring the baby gorilla, with you, he dying for free\nAnd I'm stuntin on a disco beat\nAnd you'se a fag, ya next rhyme should be on a Sisqo beat\nAnd I hate Beans but fuck it, Kiss gon eat\nIt's me and you, fuck the labels, lets go streets\nYa rap fans need me\nI don't know why this nigga keep talking greasy when Macs jam easy\nWhat the fuck was you thinkin nigga?\nFat stinkin nigga...what bitch wanna lay with you?\nFuck nigga, I could get you merked in a day or two\nNo casket, only thing left was a braid or two\nYou forget, the reason that you signed to the Roc\nCause you listened and you watched, and listened to the Lox?\nAll it takes is a gun and a bomb\nYou got me on tape, Hard Knock Life tour, huggin ya moms\nMos def, I'll have a dude buried in carcass\nFor a Kool G and I'm not from Rawkus\nDawg you still gotta convince me\nAnd don't be a coward and try to turn Philly against me\nAnd I ain't making no more songs neither\nSo when I shoot 'em in his face, I don't wanna hear that I'm wrong neither\nHold that, suck my dick, faggot!\nNone of ya'll niggas can fuck wit Kiss\nIt's the J to the izz A, D to the izz A\nYa'll niggas is pussy, ya'll don't want no gunplizzay\nSigel's not real to me therfore he doesn't exist\nVamoose, son of a Kiss....", "image": "https://images.genius.com/34d1815281afeb502b98075367058136.453x453x1.jpg"}], "artist": "Jadakiss"}