{"songs": [{"title": "Glitter", "album": "Flower Boy", "year": "2017-07-21", "lyrics": "[Intro]\nDa na na na na, da na na na na\nDa na na na na, my baby\nYou've been on my mind (How ya feel?)\nI'm losing my mind because\nI hope that we can be more than just friends\n\n[Chorus]\nFireworks, I feel like glitter\nAnd every time you come around, I feel like glitter (How ya feel?)\nYou're the one that I needed in my life (How ya feel?)\nYou're the one that I needed in my life\n\n[Verse 1]\nAyo, mirror mirror on the wall, who the brightest of them all?\nI never been the darkest one 'cause my self esteem is tall\nSo I never seen eye-to-eye with y'all niggas, ayo\nUno peso, never paid attention to what niggas gotta say-o\nSo I keep that buck, I ain't give no fuck\nThey ain't build me up so I block 'em like Lego\nFeelin' glitter, feelin' good and great\nGot the burner, got the heat, like wait\nGot the shit, it's all up on that hip\nI'll use it on myself on the day you dip\nGot that 4, 5, 7, track 8 for me\nBaby doll, I hope you agree\nBecause you light my\n\n[Chorus]\nFireworks, I feel like glitter\nAnd every time you come around, I feel like glitter\n(How you feel?) You're the one that I needed in my life\n(How you feel?) You're the one that I needed in my life\n'Cause I love having you around (I love)\n'Cause I love having you around\n\n[Verse 2]\nYeah, look at my face, look at that joy\nThis is one sided, yeah, I can't lie\nWe ain't gon' work out, we a fat boy\nYeah, sumo, got it, memo\nPale skin see-through, must be a window\n'Cause you ain't an L, could be a DJ\nWhen I see you my heart beat changes tempo\nYeah, simple, that's what I want but I can't\nThat's who you are but I ain't (how ya feel?)\nWe can track 10 skiptrace, I'm caught in your quicksand, wait\nPlease don't save me\n\n[Bridge]\nOoooh\n(Please don't save me, yeah)\nHow ya feel?\n(Rose tinted cheeks)\nHow ya feel?\nHow ya feel?\nHow ya feel?\nHow ya feel?\nHow ya feel?\n(Scum Fuck Flower Boy)\nHow ya feel?\n(Scum Fuck Flower Boy)\nHow ya feel?\n(Scum Fuck Flower Boy)\nHow ya feel?\nHow ya feel?\n\n[Outro]\nWe didn't get your message, either because you were not speaking or because of a bad connection\nFuck", "image": "https://images.genius.com/f6c99f3d5540bedc8662d01430b31001.611x611x1.png"}], "artist": "Tyler, The Creator"}