{"songs": [{"title": "Fontaine Bleu", "album": null, "year": null, "lyrics": "[Intro: Rick Ross]\nHey yo Diddy, it's Ross\nI'm still at the Fontainebleau my nigga\nI overslept, called downstairs, they said you extended this shit\nSpanish bitches still here\nSend some more Ciroc over my nigga\nI need some trees too\nBugatti Boyz (uh)\n\n[Verse 1: Rick Ross]\nThe view in this motherfucka is amazing\nThe one I flew in, this motherfucka's an Asian\nGot a few more just being patient\nPuff double up we Cam'ron and Mase'em\nWe used to be ashy on porches\nNow we lease Aston's and on Porsches\nItalian glass the whole fortress\nCracks in the marble, slabs that we cop shit\nMy marijuana accounts your whole mortgage\nMy watch, your house, ice flawless\nBVS look pink when I light head with the right bitch, white mink be the icy\nLouis Vuitton button up my companion\nAn LG show the bag for the cannon (come on)\n22-32 or straight 8\nFuck her real hard just for the strange face\n\n[Hook: Masspike Miles]\nLive the good life\nThis is what it looks like (living crazy)\nI tell em' fuck you baby (yeah)\nThe big boys do it like this\nThis is money so we gotta get paid\nBaby do it your way I get it my way\nBut the difference is I make it look easy\n\n[Interlude: Diddy]\nTake your time with it\nTurn up your motherfuckin radio\nAnd hear what we hear\nSee what we see (Bugatti Boys!)\nFeel what we feel\nHey yo turn me up\nI speak softly when I talk to these hoes\nCheck it out...\n\n[Verse 2: Diddy]\nI'm interested in women that's independent\nBut the shoppin sprees can be extended\nNew Benz's, your license is suspended\nYour man pretending my bank account tremendous\nWe going places no other niggas ever though about\nBora Bora, I'll show you what the yacht about\nIt's simple math, all I wanna do is spoil her\nLook at her hand, the great rock of Gibraltar\nBuyin land the half a size of Florida\nBaby I'm a baller, New York's my ball court\nStraight out of Harlem, home of the cut steez\nWomen lust me, 100 G's for the cufflinks\nA queen is always a man's best accessory (that's right)\nLook at mine, she half black and Cherokee\nI hit the lotto with all my mulattos\nYou recognize the model with the top off the Gelato\n(Yeah, come on)\n\n[Outro: Diddy]\nYou see, a lot of niggas be talkin that shit\nBut they don't be talkin that fly shit\nCuz they never experienced that fly shit\nYou see, we the Bugatti Boyz baby, we talk because we live it\nTake a deep breathe and smell that effervescence\nYeah that's real motherfuckin pimpin\nYeah, if I said it, I did it\nYou know my name bitch, and if you forget, I'm Puff Daddy\nAnd that's my nigga Rozay\nAs you close your eyes you can fly\nYou can see the visions that I see from the view up high\nI've been here before you\nImma be here after you\nAnd imma be here when you decide to come back mothafucka\nBut bring your bitch with you, come on\nDamn!\nDamn, feels so good\nNiggas dont even make music like this no more\nYou feel me Rosé?\nIt's the Bugatti Boyz!\nThat soul music!\nThat fried chicken and champagne, with some diamonds\nYeah, five million in cash on the bed for no reason\n(Phone rings)\nWith three mothafuckin bitches just money wrestling and shit\nNot mud wrestling, money wrestling\nYou see, this is the way life is for some niggas\nThey the chosen ones\nHate is for suckas nigga, get some love in your life, you'll be blessed for it (Come on)", "image": "https://images.genius.com/3dce21029cdd8aab73eb473e015807d5.1000x1000x1.jpg"}], "artist": "Rick Ross"}