{"songs": [{"title": "Won’t You Come Dirty", "album": "Welcome to Strangeland", "year": "2011-11-08", "lyrics": "[Intro]\nTry it, breath in baby and Ima hold them buns sturdy\nStevie Stone and Bleed say one puff'll make you come dirty\n\n[Verse 1: Tech N9ne]\nFirst 30 minutes it ain't been no hit\n30 more I'm plopping in your shit yeah\nPlop is the sound it makes\nPlop plop plop till the ground breaks\nI'm ground breaking when I fuck I pound great\nAnd she ain't got no stoppers\nNo bra\nNo stockings nigga no gown nothing\nI made that frown straighten around 8 she sound fake but I hound make her go down like she found Satan\nI know you thinking that she ain't do it\nCause with you, ya hella boring so she ain't fluid\nBut when she with me equivalent to straight sewage\nDirty\nLike they call you in the St. Louis\n\n[Hook]\nWon't you come dirty?, won't you come, won't you come dirty? won't you come, won't you come dirty?\nWon't you come, won't you come, won't you come dirty? won't you come, won't you come dirty?\nDont bring miss goodie goodie round me, won't you come dirty?, just let that booty booty drown me\nWon't you come dirty?, Hey, won't you come, won't you come, won't you come dirty? Hey, won't you come\n\n[Verse 2: Young Bleed]\nI'm a black Jim Morrison\nPeep the game from a far away glimpse\nIf I get it\nI got it\nI'm going in\nI'm on some bitch\nI'm far in\nStrange lane I could hardly win\nStrange Chain Jenny car we in\nMy chain hang through the hearts of men\nIt's the same thing at the bar again\nStrange Land more women than men\nStrange hands they be giving me gin\nMy plane land about a quarter to ten\nMy game grand\nLiving this sin again and again\nBottles of Henn\nChop the hair off my chinny chin chin\nWe are wild in there\nWild with friends\nI'm going to drop the top of the beam on my benz\nMy team in my hands\nHustling ends\nI'm along with you\nI'm about to go in\nOn the phone with you\nLike the back of a 4 10\nIt's on with you\nFrom the beginning to the end\nYou look like some twins\nBut really some tens\nI keep them clean blowing smoke in the wind\nI'm a post the kin\nAnd that's pimp the kin\nMr. Snoop my pimping friend\n\n[Hook]\n\n[Verse 3: Stevie Stone]\nWell she come then she eager for the front stroke back stroke\nDeep throat strap in the camel toe swoll\nGetting dirty is our motto\nBaby girl looking like a model\nVery hard act to follow\nGot a new shift kick with that throttle\nShe swallow\nBaby got a mouthpiece swallow\nGirls girls they swallow\nGot them and done them since Carolina Colorado\nFeeling like I won the lotto\nThat bad bitch is Mulatto\nBaby come drown me\nSquirt on me today and tomorrow\nI'll take that\nAnd when I pull your hair you take that\nAnd I'm a smack that ass you take that\nStart cumming in your legs\nGet shaken and shaking\nCallin' her a sexual addict a fanatic\nIn the pussy enthusiastic\nGotta have it\n\n[Hook]\n\nOutro\nToo drugged out\nNow I'm bummed out", "image": "https://images.genius.com/4392f3223b9e5965e7f76dc529941352.1000x1000x1.jpg"}], "artist": "Tech N9ne"}