{"songs": [{"title": "Womp Womp", "album": "Sucka Free", "year": "2008-04-12", "lyrics": "Okay\nHow you gon' tell me I'm not the best\nThat came out the West? Um, I mean the East, see\nI'm the president, but I don't live in D.C\nI rep the NY, FYI, I said I rep the NY, FYI\nI get them pies to them guys that say, \"¡ay, ay, ay!\"\nI'm the head honcho, get work from papi\nAnd dead Pancho, put him in the roncho\nI mean Range Rov' where we let them things go\nI only fuck with dudes that could let their chain show\n(Get your chain out, nigga!), I'm such a eighty's babe\nThink you can beat me, then you're azy-cray\nBody bitches, have them pushing up aisies-day\nWon't you be my DJ, like Lazy K? (He on the 1's and 2's, bitch)\nI'm such a psycho, niggas call me Michael\nNicki been hot, since you was on your tricycle\nBitches, Romans, countrymen\nYou salute the president with your country friend\nBitch, you ain't writing shit, you get ten percent (What up?)\nAnd you softer than them dudes, with their wrist-es bent\n(Ah-a-a-a-a-ha!) It's Nickelodeon\nI am the president, where my podium?\nAnd why these girls salty? Why they sodium? (I don't know)\nIs it because my flow slicker than petroleum?\nSee, I'm that yellow bus girl\nThey say \"Nicki, you the best!\", and I tell them \"Uh, dur!\"\nYou tell me what I know, I guess I must concur\nI'm the reason why these bitches yelling, \"Fuck her!\" (Yes Sir!)\n'Cause everybody hate when you're great and you're caking\nAnd when I say caking, I ain't talking 'bout baking (Oh , okay)\nBut they gon' get it all wrong\nFucking with them fake thugs and them fake Don Juans\nSay he got workers like the kids in Hong Kong (Stop lying!)\nBut he ain't getting chips unless you count them Bon Tons (Oh shit!)\nTell that nigga womp womp\nCause you ain't getting chips unless you count then Bon Tons\n\n[Spoken]\nHow the only chips you got is Bon Ton potato chips?\nLike, that's what I don't understand, I try to tell these niggas, like, you can't be serious\nI'm Nicki Minaj!\nOther than that, like, if you can't see I'm the best\nI mean really, you know, these bitches so washed up\nI'm walking around with them dryer sheets\nLike, you know, the sheets you throw in the dryer\nYeah, I'm walking around with them sheets now\nCause, like, when I see these washed up ass bitches\nI'm just throwing them on bitches like, real talk, like\nI'm just throwing them on bitches like\nBitch, hit the dryer, you washed!\nDirty Money", "image": "https://images.genius.com/6723f478cff14a2ba2cbe0ce2ad7d4c2.320x320x1.jpg"}], "artist": "Nicki Minaj"}