{"songs": [{"title": "I Can’t Decide", "album": "Raw", "year": "2010-11-19", "lyrics": "[Hook]\nIn the land of the killerz\nYou better say your prayers tonight\nAmen, it's hard enough trynna survive\nAnd to top it off I gotta watch my back\n'Cause these niggas wanna act up\nShould I fight or should I run?\nShould I hide or get my gun?\nI can't decide\n\n[Verse 1]\nNow see, Tyrone does whatever his homies do\nJust a dopey dude\nAn' deep in his mind, he knows he's cool\nHe's ditchin' class 'cause he feels like he don't belong in school\nMomma always yellin' out \"Damn Tyrone, what's wrong with you!?\"\nHe wanna show the world he grew in some balls\nAbusing the law, 8 weeks in juvenile hall\nThis dude is the cause of a lot of shit\nDon't know where is father went\nNever had no confidence, resortin' to poppin' clips\nHis homies thought that they were violent assassins\nThey said \"Come on, Tyrone it's time to get active\nWe gon' roll up on this nigga\nReal silent and passive\nThen you pull out the 9 and then blast him\nWe gon' roll to his crib\nBe careful shootin' so you don't hit the kids\nYou down fo' it?\"\nTyrone said \"You know what it is\"\nSo they roll up, about to retaliate on this busta\n\"POP POP\" (Bitch ass muthafucka)\n\n[Hook]\nIn the land of the killerz\nYou better say your prayers tonight\nAmen, it's hard enough trynna survive\nAnd to top it off I gotta watch my back\n'Cause these niggas wanna act up\nShould I fight or should I run?\nShould I hide or get my gun?\nI can't decide\n\n[Verse 2]\nTyrones big ballin’, gettin' the dough\nFuck bitches and hoes, still rippin' the 4’s\nWalk with his fist clinched he was itching to blow\nShit, and all the local neighborhood niggas would know\nIt's like he was born to fit the streets\nNever had no chicken feet\nWalked up to the local liquor store to get a swisher sweet\nBefore he walked in some dudes was like\n“Aye Nigga...POP POP POP, we don't play nigga”\nThey just shot him when his lives undone\nThe man inside the liquor store dialed 911\nAnd at the same time he's strugglin' tryin' to find someone\nScreamin' “HELP HELP, STAY ALIVE YOUNG SON!”\nThe boys gonna die and he knows that\nA bullet went through his skull cap\nHe’s barely breathing\nAnd both of his eyes balls have rolled back\nOh crap the people who witnessed it can't believe it yo\nMaybe it’s linked to the drive by he did a week ago\n\n[Hook]\nIn the land of the killerz\nYou better say your prayers tonight\nAmen, it's hard enough trynna survive\nAnd to top it off I gotta watch my back\n'Cause these niggas wanna act up\nShould I fight or should I run?\nShould I hide or get my gun?\nI can't decide\n\n[Verse 3]\nTyrone’s dead, all over some dumb shit\nHis homies don't know who did it\nThey just got assumptions\nReady to wild out\nWith a sinister function\nAnd drive by on some bitch niggas and dump clips\nAnd OG was like “fuck it he’s dead now\nSo open up the 40 and take a sip and pour the rest out\nY'all got me stressed now\nShit y'all need to chill out\n'Cause every time some shit be poppin' off y'all pull the steel out”\nOne of the younger homies was like\n“Fuck that, we gon’ tug gats and bust back, trust that”\nThe OG was like\n“Man Y'all don’t need to be out here bustin' slugs\nY'all don't even know who the fuck it was\nY'all fucking bugs\nY'all gonna be dead taking this violent route\nYou little niggas always wildin' out\nYou need to getcha shit straight and understand whatcha life about\n'Cause if a bullet hit your ass believe your lights is out”\nThe younger homie like “Nigga, you don't run these streets\nYou ain't never been no fucking G\nIf I wanna bust my heat it’s up to me\nAnd I know them niggas that killed T\nAre the same niggas that we hit up the other week”\nAnother homie like “Naaah they ain't get back for that\n'Cause that’s them niggas pulling up in the Cadilla-\nPOP POP POP POP....POP\n\n[Hook]\nIn the land of the killerz\nYou better say your prayers tonight\nAmen, it's hard enough trynna survive\nAnd to top it off I gotta watch my back\n'Cause these niggas wanna act up\nShould I fight or should I run?\nShould I hide or get my gun?\nI can't decide\nI can't decide\nI can't decide\nI can't decide\nI can't decide", "image": "https://images.genius.com/511235d7620c5ca1e6b46a485cb180d6.1000x1000x1.jpg"}], "artist": "Hopsin"}