{"songs": [{"title": "I Am Raw", "album": "Raw", "year": "2010-11-19", "lyrics": "[Intro: Hopsin]\nYou motherfuckers are quick to judge. It's all good though. You don't know shit about shit. If you only knew what I knew, if you only knew what I could do. If you could only see what I could see you would probably stop bothering me\n\n[Verse 1: Hopsin]\nYeah\nI independently started this shit, marketing hits\nStarving for chips, no gasoline to start off the whip\nFelt like the only nigga labels wasn't bargaining with\nMy heart has been ripped, I stuck with it as hard as it gets\nThese producers would always blow me off\nNow that I'm blowing up, they don't recall\nTalking about \"Yo, you my homie, dawg\" (My nigga)\nOh, now you wanna hop on the Hop train\nKnowing damn well since '04 I had hot flames (The fuck outta here)\nMy real buddies was mainly the worst\nHating to shoot my videos without me paying them first\nSo I slide 'em 100 bucks to watch 'em bitch on how it ain't enough (Man)\nThat money got my cell, internet and cable cut!\nA real homie would've gave a fuck and not expect to pay upfront\nThen get the money later when I'm making some\nNobody saw the bigger picture except me\nThey neglect me, only thing that protects me is FV (Come on)\n\n[Chorus: Chelsea Hopson & Hopsin]\nYou don't always have to stick by my side\nJust make sure you remember me when I die\nI am raw, I am raw\nJust to let you niggas know\nBitch I am raw, I am raw\nDon't forget me when I'm gone\nBitch I am raw\n\n[Verse 2: SwizZz]\nI was a high school grad preparing to go to college\nAn enthusiastic freshman, major in Economics\nI didn't have a clue what to expect to be honest\nBanging beats in my dorm, streaming Pornhub constant\nI figured I could make it out in four years tops\nStudy religiously and graduate, apply for a job\nThe rap thing was secondary, I was putting it off\nCalling it quits, assuming I had better chances playing ball (Yep)\nMy third year came and suddenly that changed\nI couldn't bear watching my mom at home suffering pain\nTryna fight off the strain of only having half a stomach\nPlus a handicap back from a surgery that helped nothing!\nSo I returned to the valley and called the homie\nHop was on Ruthless getting shelved like a trophy\nI told him how I left my life in the OC\nAnd we concluded that we could both use FV\n\n[Chorus: Chelsea Hopson & Hopsin]\nYou don't always have to stick by my side\nJust make sure you remember me when I die\nI am raw, I am raw\nJust to let you niggas know\nBitch I am raw, I am raw\nDon't forget me when I'm gone\nBitch I am raw\n\n[Verse 3: Hopsin]\nThis was written for niggas who wouldn't give me dap\nNiggas who told me that I had sissy rap\nThis was written for all the bitches I used to called who never hit me back\nUntil they heard the word I was buzzing, c'mon don't give me that (Shit)\nYou backed out, now you tryna roll with my clique?\nWhere the fuck were you when my signing bonus was spent?\nWhere the fuck were you when I got the notice for rent\nSaying I was getting evicted and I was hopeless as shit?\nSee I keep some names handy and you got thrown on the list\nThat's how you know that I'm pissed, I got you, don't even trip\n'Cause I'm rude over the nicest beats, you had to go ignite the heat\nYou might agree to beef, but yo I'm not the type you'd like to meet\nLife's indeed a journey that I have yet to finish\nHopefully my career's something that will be epidemic\nYou'll always know that it's Hopsin the way I wreck a sentence\nRealness, I represent it, raw, I'm the definition\n\n[Chorus: Chelsea Hopson & Hopsin]\nYou don't always have to stick by my side\nJust make sure you remember me when I die\nI am raw, I am raw\nJust to let you niggas know\nBitch I am raw, I am raw\nDon't forget me when I'm gone\nBitch I am raw", "image": "https://images.genius.com/511235d7620c5ca1e6b46a485cb180d6.1000x1000x1.jpg"}], "artist": "Hopsin"}