{"songs": [{"title": "Part of Me", "album": "Street Hop", "year": "2009-03-17", "lyrics": "[Intro]\nYou took a part of me with you\n\n[Chorus]\nLast night we had a one night stand\nBut when I woke up in the morning I missed you\nYou see, all I'm saying is \"Can I see you again?\"\n'Cause when you left you took a part of me with you\n\n[Verse]\nIt's like it's an urban legend, his mistake\nHer confession, how 'bout it for a first impression\nHow 'bout it, with the Birkin looking perfectly measured\nLooking certain as ever like she got her purpose together, whatever\nHim? He was like a typical thug\nHat and glasses, he had to bag the baddest bitch at the club\nHe had a way with his words, a certain – how should I put it?\n\"Je ne sais quoi\" is how the French bitches would mention him\nNever known for loving 'em all, having 'em driving his cars\nHaving 'em in the mall on his budget balling\nHim tryna call her is the part of the issue\nHe said that when she left she took a part of him with her\nHe ain't a stranger to the one night stand\nIf you loving 'em, you's a sucker, that's the one night saying\nBut why give him the wrong number and fuck him later on girls\nThat's all I'm saying, let me tell you how they met\nHe approached her with the usual swagger\n\"How you doing? Blahzay-blee-blah-blah-blah\" - the usual blabber\nNow that the ice is broken it's time to get linked\nHe asked her if he could buy her a drink, she nodded to him and said\n\"I don't really drink but thank you for the offer\nLet me buy you one and we can finish talking\nHow 'bout some Patron, and have him fill the cup up\nAnd when you finish up we can get into something\"\nHe like it's easy as pie, you see it in his eyes\nHe tryna turn her out tonight and leave her where she lies\nTell his friend he hung her out to dry\nAnother bitch taps him on the shoulder and he turns around surprised\nShe said, \"How you doing? I think I know you from somewhere\nYes, I do, don't you drive that Mercedes out there\nYou was driving by me one day I was walking\nYou pulled over to me and we started talking\"\nWhile they talking shorty one grabbed something out her Birkin\nTossed it in his drink and watched it sink to the surface\nShorty number two kept talking like she was tryna stall him\nLong enough for that thing to dissolve in\nOne gives the signal, two says \"Who's this?\"\nHe's like, \"Sorry, I'm rude\" then introduces\nOne to two – they start hitting it off\nJust like he wants 'em to, it's wonderful\nHe thinking, she's a skeezer, she's just easy\nThey both probably bi, so this should lead to a threesome\nThey both probably high 'cause neither one of 'em drinking\nThey both keep giggling so you know what he thinking\nHe swallows his Patron shot, sets the cup on top\nThe bar like we gon' fucking party, don't stop\nOne cues two then, says, \"Where your ride at?\"\nHe says, \"Hey, I let valet decide that\"\nThey laugh, they leave, he says, \"Mami, drive that\nI'm tired or I'm high, I just wanna lie back\"\nThey get to the hotel, they get on the elevator\nHe ain't feeling so well like \"Fuck it, I'll get better later\"\nThey get in the room and start taking off they clothes\nDude stepping out his shoes while he checking out the hoes\nHe's sick so he sits, one says \"Lay down\"\nTwo says, \"I'll take off his clothes, okay now?\"\nHe loses consciousness, he dreams of number two riding him\nSliding up and down with no condom\nNumber one sucking on his dick using both hands\nBoth hoes dressed like nurses, I guess they role playing\nHe comes to as the room circles and comes to a stop\nHe's not certain or not is he still dreaming\nHe feels numb so he looks down and sees\nThat he's laying in a tub, full of ice from his knees\nTo his waist, in a bathroom with grief on his face\nHe feeling like he too weak to move so he waits\nHe feels around and notices a piece of paper sticking to the tub\nFrom his bitches and it's written in his blood (What the fuck is this?)\nHe panics, he screams, \"Oh God, what's happening?\"\nMore reading, less praying, no time for rationing\nThe letter reads, \"Never ask for shit\n'Cause you can get more than you ask for, we have your dick\"\nThe letter reads, \"Never ask for shit\n'Cause you can get more than you ask for, we have your dick\"\n\n[Chorus]\nLast night we had a one night stand\nBut when I woke up in the morning I missed you\nYou see, all I'm saying is \"Can I see you again?\"\n'Cause when you left you took a part of me with you", "image": "https://images.genius.com/13187be577e518c77f5c6ac278ec366a.1000x1000x1.jpg"}], "artist": "Royce da 5'9'’"}