{"songs": [{"title": "You, Me, Him and Her", "album": "The Dynasty: Roc La Familia", "year": "2000-10-31", "lyrics": "[Intro: Jay-Z]\nTold y'all\nDynasty, Roc-A-Fella Records, you heard me?\nUnstoppable, niggas! Uhh\nMemph Bleek, (Jigga) Amil-lion, Sigel Sigel ya heard\nIt's a Dynasty, who do you believe?\n\n[Verse 1: Jay-Z]\nJigga Man, mo' better, mo' cheddar\nFo's knock the man off your Polo sweater\nRoll with the R-O-C, A-Fella\nRemember me? The teachers used to fail us\nNow it's more scrilla, hoe killers\nFo'-wheelers, we gorillas\nOh please feel us, we heat holders\nFighting? Listen boy, Roy Jones couldn't steal us\nThe plot thickens, the block clickin'\nWe got the game tied up, stop trippin'\nJigga Man huh, Sigel Sigel y'all\nMemph Bleek what, Amil-lion, uhh\nCat be him, El Cap-i-tan\nThe fire I spit burn down Happyland\nSocial Club, we unapproachable thugs\nNon-social, gone postal\nGreat aim, harm the arm close to your toast\nLike a Don's supposed to Shawn\nI thought I told you, these ain't just vocals\nDon't make me take it to the old school\nI put holes through your hoes too\nThrough your clothes to the foes to the nigga close to you\nFuck it; Jigga Man huh, Sigel Sigel y'all\nAmil-lion what, Memph Bleek\n\n[Verse 2 : Memphis Bleek]\nYo, y'all dudes don't get it, come widdit\nFifth loaded with slugs that'll rest in your fitted\nIt's M dot E-M, the Roc be them\nGot the mamis sayin' look, who can stop be them\nYou wanna press your dumb luck, get blam blam-ed up\nI crush your larynx, you talk about us nigga\nNo obituary, I get it critical\nYou know Memph'll hit the pall bearer liftin' you\nWhen I cock the plastic, make 'em drop the casket\nWhen it's hot, I'm blastin'\nIt's the Roc, you bastards\nJigga Man what, Amil-lion yeah\nMemph Bleek huh, Sigel Sigel c'mon\nSpit acid, c'mon\nWitcha bullshit smash hit, get your bullshit smashed in\nNiggas wanna front and get jumped\nBet the Ruger give your right side a nice-sized lump\nNigga, we are, the supreme squad\nYou can dream hard but reality is\nWe push the dream cars, fuck the queen broads\nPuff the green raw, we as real as it get\nWe the R-O-C dot A dot Fellas\nBitches don't talk to us the hoes, they e-mail us\nNigga, Jigga Man what, Memph Bleek huh\nAmil-lion yeah, Sigel Sigel rap\n\n[Verse 3: Beanie Sigel]\nR (dot) O (dot) C (dot) stop\nFrom Tower to ma and pop, I move out stop\nShower your mom block, move out with Glocks\nRaw to the cook, look, move out them blocks\nTake it to the bucks who be grindin' it up\nUsually take it to the dubs so they diamond it up\nCompetition, linin' 'em up\nForty-five ACP, let me squeeze lime 'em up\nYou want, drama what, well silence it up\nSince a young buck, violent as fuck\nWasn't me dog, the high will do it\nI used to wild off embalmin' fluid, I sent niggas to the trauma unit\nForty-five or the nine'll do it\nI fuck around and have your moms go through it - I'm a beast!\nShit, niggas always wanna ye shit, then they wanna cease shit\nWhen they motherfuckin' peeps hit\nBut I don't cease nothin', I decease som'un\nI fuck around and have you sleepin' underneath som'un\nJigga Man what, Sigel Sigel y'all\nMemph Bleek uh, Amil-lion, right\n\n[Verse 4: Amil]\nYo, A to the M-I, feminist\nHolding the semi, leave niggas faced with a dilemma\nAm I, gon' run or stay, can I\nGet away no you can't can't I surrender?\nAnd I, lazy bop, Mercedes hot\nIn my way through the tunnel like Lady Di\n\n[Outro: Jay-Z]\nJigga Man huh, Sigel Sigel y'all\nMemph Bleek what, Amil-lion, uhh", "image": "https://images.genius.com/c91a9bc0eb9aaf290224ebeaabd243a0.640x640x1.jpg"}], "artist": "JAY-Z"}