{"songs": [{"title": "Cradle 2 The Grave (’Tru Gee 79' Remix)", "album": null, "year": null, "lyrics": "[Intro]\nDamn. True G. Don't fall asleep nigga, Everybody dies Nigga everybody dies, We all gotta go nigga we all gotta go, Go to sleep nigga, Go to sleep, Close your motherfucking eyes, We all gotta die, Fuck Em All X2, Westside M.O.B\n\n[Verse 1 : 2Pac]\nFirst to bomb, Quick to unload\nExpose my foes for being bitches\nKeeping niggas suspicious\n2 Glocks is filled with ammo\nMy army fatigues is ready for battle\nLyrical commando, (Let get it on)\nTell me nigga how much can you handle?\nBanging on wax\nI turn the track into a roman candle\nBooom!\nMy intention specifically\nThugged out no sympathy\nPictures of closed caskets\nSoon as Daz get with me (I am first to bomb)\nFirst is the calm then the panic\nSoon as my niggas break\nWe earthquake the whole planet\nAdversaries can't understand it\nThe way my niggas strategize\nDon't anybody die unless we planted it\nLive long committed, I write songs and then spit it\nNo matter how hard motherfuckers try\nThey can't get it\nIt's west coast\nWestide, Outlawz till we die, Thug life motherfuckers on the first ride and we are the first to bomb\n\n[Hook: Big Syke]\nI got nothing to lose, paying dues\nNigga you wanna die?\nI get high, Then my mission is a walk-by\nYou'd better jet when i hit your set\nCause i am coming, Start running\nYelling Evil-Mind as i am gunning\nOne in the chamber\nFor the anger that i build inside\nFor the mothers that cried\nThe beginning is an ending\nAm i just a slave\nSo i got be brave\nFrom the cradle to the grave\n\n[Verse 3 : Eminem]\nI never would've dreamed in a million years I'd see\nSo many mothafuckin' people, who feel like me\nWho share the same views and the same exact beliefs\nIt's like a fucking army marching in back of me\nSo many lives I touched, so much anger aimed\nIn no particular direction, just sprays and sprays\nAnd straight through your radio waves, it plays and plays\n'til it stays stuck in your head, for days and days\nWho would've thought, standing in this mirror bleaching my hair\nWith some peroxide, reaching for a t-shirt to wear\nThat I would catapult to the forefront of rap like this?\nHow could I predict my words would have an impact like this\nI must've struck a chord with somebody up in the office\nCause Congress keep telling me, I ain't causing nothing but problems\nAnd now they're saying I'm in trouble with the government, I'm loving it\nI shoveled shit all my life, and now I'm dumping it\n\n[Hook]\n\n[Verse 3 : 2Pac]\nTell me baby what's your frequency\nYou see I'm making proposals\nFull of verbal indecency when ya meeting me\nFlash light i am buzzed\nWhat's right like drugs, got 3 strikes\nYou got cause last night for thugs\nHolding my position\nMy competition is never ready\nRipped by a machete\nMy alias is Makaveli\nSo what they tell me through the grapevine\nNiggas ain't ready to see me paid\nThey rather take mine\nRetaliation takes time\nCreating rhymes that so ferocious that the bass line\nWent for my vocals\nEvery time a nigga says it rhyme\nSpending and busting you thought it up\nBut you wasn't prepared\nNiggas is scared, I am eternally thugging\nLike Kamikazes on a suicide mission\nI am spitting multiple gunshots\nBurning turning rappers to victims\nI kick em all day\n\n[Hook : Big Syke]\n\n(Gunshot sound)", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}