{"songs": [{"title": "Never Give Up", "album": "Spiritual Minded", "year": null, "lyrics": "[KRS-One]\nGather 'round, gather 'round, ha\nMetaphysical style, spiritual style, the ORIGINAL style, ha\nYes.. let's do it\n\n[Hook]\n- you can never give up, you should never give up\n- you can never give up, we can never give up\n- you can never give up, you can never give up\n- you should never give up, we can never give up, you can never give up\n\n[KRS-One]\nYeah, yeah\nY'all don't really know about the KRS rap\nY'all don't really about why we stay trapped\nY'all don't really know hip-hop ain't rap\nBut let me tell you how we can get it all back\nFirst realize givin up is wack\nSay to yourself I can never be wack\nThen realize that we must go back\nAnd the reason you can't seem to get on track\nIs you, keep, buying, HOES, simple and plain\nYou, keep, buying, HOES, all y'all know my name\nAnd how I get down and move around\nI've already been to the proving ground\nIn conscious rap, who rule the sound\nThe question is are you down?\n\n[Hook] w/ minor variations\n\n[KRS-One]\nLook - KRS-One, I've learned already\nEverything they doin is temporary\nNo matter how big you live\nYou still the creation of a music executive\nAnd when you get old no matter what you did\nThey throw you away and they pimp your kid\nYeah kids, on the TV whylin\nYou know why we got racial profilin?\nCause you, keep, buying, HOES, simple and plain\nYou, keep, buying, HOES, all y'all know my name\nSo there in the future we'll look back\nAnd then we will see we were under attack\nBut it'll be too late, the loss'll be too great\nYou'll see, just wait!\n\n[Hook] w/ minor variations\n\n[KRS-One]\nC'mon, c'mon, yeah c'mon\nYou see how they shuttin down KRS-One\nCause I'm not sexy, thuggin or dumb\nAsk yourself -\n- why they only promotin criminal activity and nothin else?\nOn the videos and on the radio\nTeachin our kids which way to go\nAnd the way that they tell our kids to go\nIf you listen, heads right straight to prison\nWhile you, keep, buying, HOES, simple and plain\nYou, keep, buying, HOES, y'all better peep the game\nYou got to release that temptation\nGet a brand new affirmation\nYour life is what you make 'em\nPeace, salaam alaikum\n\n[Hook] w/ minor variations", "image": "https://images.genius.com/d84f73e1b21b8b4dbd679efa191364e4.1000x1000x1.jpg"}], "artist": "KRS-One"}