{"songs": [{"title": "Wildflower", "album": "Ironman", "year": "1996-10-29", "lyrics": "[Intro from the motion picture \"J.D.'s Revenge\"]\nThat was the best fucking I ever had\nThat's because you been dealing with the Ace\nYou gotta leave? Where you going sugar?\nI got business to take care of\n[Ghostface]: No shit\nShit that's my old man, shit!\nYa better go talk to him\n\n[Ghostface Killah / Scotty Wotty]\nNo smoke in the lungs\nNo smoke in the lungs\nNo smoke in the lungs\nNo smoke in the lungs\nNo smoke in the lungs\nNo smoke in the lungs\nNo smoke in the lungs\nNo smoke in the lungs\n\n[Break: Jamie Sommers ]\nI'm mind shocking, body rocking, earth shaking, money making\nSitting high, looking fly, drinking on the best wine\n\n[Verse 1: Ghostface Killah]\nYo bitch I fucked your friend, yeah you stank ho\nI seen her on the elevator, honey grabbed my Kangol\nShe put me on to mega-shit, bout to slap the bitch\nShe shot crazy verbal, I leaned back like I'm rich\nIt took place late night on February 17th\nHands flooded like ink, my face on her magazine\nJust got back from Honolulu, pockets stacking beaucoup cash\nGirlfriend sipped the Yoo-hoo and laughed, yo\nWhile I was on tour, whore, you went to work\nQuick fast, had a nigga dick in the dirt\nYou couldn't wait just to kidnap the bait of my sperm\nWhere was you at, ho? 'Pinky house, she put in my perm'\nThat's all you ever said to me, thought that could hold me\nRemember when I long-dicked you and broke your ovary?\nYou crab bitch, chickenhead ho, eating heros\nI'm the first nigga that had you watching flicks by DeNiro\nYou gained crazy points, baby, just being with God\nTaught you how to eat the right foods, fast, and don't eat lard\nI gave you earth lessons, I came to you as a blessing\nYou didn't do the knowledge what the God was manifesting\nYou sneaky fuck bitch, your ways and actions told it all\nI fucked you while you was bleeding, held you down in malls\nSexually you worshipped my di-dick like a cross\nI had you fiend out, broke out, for a month you fell off\nYou was my main shit, my peeps showed you love on the strength\nYou saw how I got down, the way I thought had you tranqued\nBut you had to fuck this lobster-head ass nigga\nI shoulda slapped him but the Gods said chill\nThat's your wiz fault, god, handle that in the lab\nI'm wondering how many times your hot ass got stabbed\nYou dumb bitch, horny hot fuck from out the mountains\nYour clientele is low ho, catch you next show, bro\nI got jerked, gave away my pussy, that shit hurt\nIt feel like somebody died or shot your old Earth\nBut fuck it, I fucked you on a chair with three legs\nBroken tables, had you screaming while you was biting on my cables\nWe slid to the washing machine and threw it on spin\nIf your pussy dry, spit on my dick and put it in\nMy dick's the bomb baby, marvelous hot steak\nPlus I'm conceited Starks make the biggest ho call rape\nI'm God Cipher Divine, love my pussy refined\nThat means clean, a FDS smell with a shine\nWord up, respect that ho", "image": "https://images.genius.com/86aaa4a25c81fd34a671c2db7083cc80.800x800x1.jpg"}], "artist": "Ghostface Killah"}