{"songs": [{"title": "PUSSY MONEY FAME", "album": "STAY DANGEROUS", "year": "2018-08-03", "lyrics": "[Chorus]\nPussy, money, fame (pussy, money and fame, pussy, money and fame)\nPussy, money, fame (pussy, money and fame, pussy, money and fame)\nPussy, money, fame (pussy, money and fame, pussy, money and fame)\nPussy, money, fame (pussy, money and fame, pussy, money and fame)\nPussy, money, fame\nWhat would you do for that pussy? (for that pussy)\nWhat would you do for that fame? (for the fame)\nWhat would you do for that money? (for that money)\nSimply walk up and take everythang\n\n[Verse 1]\nI'll, I'll, I'll beat a nigga ass for that pussy\nThey need another land for that pussy\nCome through so fast, I might crash for that pussy\nWatch hours pass out the hourglass for that pussy\nI'll buy some new ass for that pussy\nI'll pop one of these rap niggas for that money\nI'll rob my own bitch for that money, she don't really love me\nI come through on the late night when it feel right\nThem fatal riders, we seein' what their shit look like\nIf rap don't work, I'm goin' brazy, nigga\nThis lifestyle, you gotta want it 'til you let it, nigga\nI stuff the carseat with that flavor, nigga\nYeah, sittin' right under my baby, nigga\nAyy, I'm really with this money shit\nI'm 'bout to rob one of these music execs real quick\nAyy, there's a million ways to get paid and I do anything but some' strange\n\n[Chorus]\nPussy, money, fame (pussy, money and fame, pussy, money and fame)\nPussy, money, fame (pussy, money and fame, pussy, money and fame)\nPussy, money, fame (pussy, money and fame, pussy, money and fame)\nPussy, money, fame (pussy, money and fame, pussy, money and fame)\nPussy, money, fame\nWhat would you do for that pussy? (for that pussy)\nWhat would you do for that fame? (for the fame)\nWhat would you do for that money? (for that money)\nSimply walk up and take everythang\n\n[Verse 2]\nI might tell a lie for that money\nFatigue hits, his rap career, he be tryin' for that money\nUncle lies to their money\nGet some, I deal, sign myself an independent grind for that money\nCome alive for that money\nNiggas come alive for that money, so is you willin' to die for that money?\nCome alive for that money\nNiggas down to slide for that money, so is you willin' to die for that money?\nFuck fame, nigga (fuck fame)\nNigga, fuck that shit (fuck fame, nigga)\nI need a hunnid mil' real quick, nigga fuck fame, nigga (fuck fame)\nFuck fame (fuck fame)\nBut I do wanna fuck a bitch who wanna fuck me 'cause my name\nBut, I don't give a fuck about hangin' with no famous niggas\nAnd I don't give a fuck about fuckin' on these famous bitches\nAnd I don't give a fuck about nothin' they do for their fame\nBut if fame get you paid then (hey-ey)\n\n[Chorus]\nPussy, money, fame (pussy, money and fame, pussy, money and fame)\nPussy, money, fame (pussy, money and fame, pussy, money and fame)\nPussy, money, fame (pussy, money and fame, pussy, money and fame)\nPussy, money, fame (pussy, money and fame, pussy, money and fame)\nPussy, money, fame", "image": "https://images.genius.com/59064082da48f1c48bf96d62c598b6c3.1000x1000x1.jpg"}], "artist": "YG"}