{"songs": [{"title": "On & On", "album": "The Cookbook", "year": null, "lyrics": "[Pharrell]\nBeware, you're now listening to the sounds\nOf Mis-demeanor\nTurn everything up, all levels\nAll my fucking levels\nTurn that shit the fuck up\nHuh? What? What?\nIs that a two-track?\n\n[Bridge: Missy]\nMissy be the name and y'all should already know\nBeen around long, Scarface sold coke\nShimmy shimmy ya, shimmy yo she ya\nLet me grab the microphone and I'm gone take it away\n\n[Verse 1]\nEvery time I spit I blow one or two speakers\nTop model diva but my name not Eva\nYeah I bring fever rocking classic adidas\nI'm straight off the heater ripping needles off the meter\nHere I go, flip my flow\nBack it up then I drop it low\nIt's a must cause I'm dangerous\nI'll be a hassle on the busta call me angel dust\nI talk shit di, didn't stutter\n2005 MC's in trouble\nYou run for cover hide under your covers\nCause you gone need more protection than a magnum rubber\n\n[Hook 4X: Pharrell]\nAh, ah, on\nAh, ah, on\nAh, ah-ah, ah-ah\nAh, ah, on and it's\n\n[Verse 2]\nMissy finna spit shit simply raw\nMisdemeanor always make MCs feel small\nStick you on the table with a plastic cup\nSay grace, then eat ya ass up\nY'all just rookies, virgins, and nookies\nNot my competition you skip or play hookie\nAin't nobody here that can tear the track up\nAnd naw I ain't done rapping so shut the hell up\nKeep it simple every time I flow\nIf you step to me I shall throw blows\nRaise up like I's break nose\nI ain't about talking I'll lay 'em down slow\nAnd for sure y'all know\nMisdemeanor got 'em by the neck low\nIce cold heart like zero below\nIf you wanna battle me then playa say so\n\n[Hook]\n\n[Verse 3]\nLet me tell you what I'm all about\nAbout spitting hot rhymes on out\nYeah Pharrell did the beat oh yes\nAnd the way he put it down he make it sound so (fresh)\nI be the best don't second guess\nWhen it comes to other rappers bout it boy get flexed\nWhen I say I'm tight as wife beaters\nMissy bout to teach you how to follow the leader\nHit the club in a blue two seater\nLooking like I'm finna cock a nine millimeter\nGet out with my high hill cuffs\nTwisting my ass cause I know what guys want\nLicking my lips like I'm taking him home\nTeasing and teasing I'm faking the funk\nShaking my titties like I wanna bone\nBend over slow then I tell him I'm gone\n\n[Hook]", "image": "https://images.genius.com/49c23ba7107cf9bb93749df01b30111c.1000x1000x1.jpg"}], "artist": "Missy Elliott"}