{"songs": [{"title": "Kush Is My Cologne", "album": "The State vs. Radric Davis", "year": "2009-12-08", "lyrics": "[Hook: Gucci Mane]\nKush is my cologne, gone on that stupid strong\nI know kush is my cologne, Ku-Kush is my cologne\nKush is my cologne, gone on that stupid strong\n\n[Verse 1: Bun B]\nGot a swisher filled up with that one hitter quitter, bro\nBubba for your troubles on the double itl'l get you bro\nPass me the D's, light it up with ease\nIn a cirle full of G’s, smoking on them trees\nPass me a cigar, and i'm-a bust it down quick\nPass me the purple, make sure that ho is round and thick\nBreak it down, fill it up, roll it up and light it\nAnd you know it’s the bomb, soon as it get ignited\nPimping I can’t even fight it, it's calling me to smoke\nSo I fire up another square and take another toke\nI be damn near goin broke\nAnd my girl say I’m wrong, shit but\n\n[Hook: Gucci Mane]\n\n[Verse 2: Gucci Mane]\nI'm inhaling it, exhaling it, it makes me more intelligent\nI feel like I’m still mailing it or selling it, they smelling it\nKush, purp, strong dro. What I need cologne for?\nThey tried to send me to rehab but I said\n\"No, no I won't go\"\nDamn it's really loud, smelling like a whole pound\nKush cologne, haze is her perfume\nBubba kush for breakfast, with my Captain Crunch\nI smoke ten blunts before lunch\nKnow that sounds like that’s too much\nI'm so high, I'm so in the sky, everybody know\nMarijuana is my fragrance, probably smell it on my clothes\nI smoke that bubonic sonic, I've been sipping gin and tonic\nYou lil' boys is hooked on phonics, Gucci hooked on chronic, Sonny\n\n[Hook: Gucci Mane]\n\n[Verse 3: E-40]\nI'm in this booch hella keyed (hella keyed, man, I'm sacked)\nMan I've been smoking hella weed (Hella tweed man, and I ain't talking about Twitter, man, I'm talking about tweed)\nLick it twist back down\nProbably won't know how I go home\nBaby wanna suck my bone\nShe gotta fuck me jeans on\nFuck me dress on, fuck me jeans on\nFuck me dress on, fuck me jeans on\nAnything holling a dane\nTryin' get brain butIdon't know her name\nLooking at my chain\nLet me explain\nKush, cocaine but I don't make it rain\nGimme the gudda bitch, no extension\nPay me up or pay me no attention\nSend a botch, like you send it\nMake her upload, all up in it\nRetirement plan, Booch you my pension\nHater repellant, my brand new invention\nEverything that I say I meant it\nRasied in the Bay where its’ so pimpin’\nRaised in the Bay where it’s so pimpin’\nRaised in the Bay where the bitches tempting\n\n[Hook: Gucci Mane]\n\n[Verse 4: Devin the Dude]\nKush is my cologne, I got many fragrances\nShit gets so expensive but I hardly have to pay for shit\nEvery puff is like a squirt, smell it all off in my shirt\nCoworkers give me compliments every time I go to work\nWhat kinda cologne you on?\nDro is like my aftershave\nHave me feelin and smellin so good yo I don’t have to bathe\nBut by all means, I must keep my balls clean\nMake sure my dicks legit then I go take care the small things\nAnd it all seems worth it\n450's kinda steep but I deserve it\nWeed smell so loud that you think you heard that purp\n\n[Hook: Gucci Mane]", "image": "https://images.genius.com/b1d579f919289c4a4498c5418f46bf1c.450x450x1.jpg"}], "artist": "Gucci Mane"}