{"songs": [{"title": "Nice", "album": "LAX", "year": "2008-08-26", "lyrics": "Ayo, Irv, 'the fuck is wrong with these niggas, man?\nTalking 'bout I ain't no fuckin MC\nI been at this shit for 7 years, nigga\n8 times platinum, nigga\n2 Bentleys, 1 Lambo and 3 houses later\nMuthafucka, what's up?\n\n[Verse 1]\nNaw, this ain't no fucking Dre beat, I got this from Irv Gotti\nGame back on the shit I'm enemies with e'rybody\nGame cook crack, transform to yayo\nThe new Suge Knight, nigga, minus the K.O\nI keep it candy like Mariah, I'm so fire\nWhen step it in the club, get low like Flo Rida\nCus I'm a pimp, you can tell by the limp\nWhen I st-st-st-step aside the 26 inch\nYou see my rims? They bigger than Bow Wow\nGet money, fuck bitches, that's what I'm about now\nThe Phantom, ugly, the Bentley, retarded\nThe kicks still Chuck Taylors, the jacket is a Starter\nI beg your pardon, nigga, we can get it started\nIf you ain't Nas or that nigga on third Carter\nMy happy face is Kenneth Supreme mug shot\nWhen it go down, who goin' stop the blood clot?\n\n[Hook: Newz (The Game)]\nThrow yo hands up it's that gangsta shit\nAll the homies go brazy when they bump my shit\nGo ahead and hate on my click\nGot a couple words for you nigga, suck my dick\nYou strapped? (That's right)\nGang bangin? (for life)\nA little drama (that's life)\nHit 'em up (Nice)\nIt's that gangsta shit\nAll the homies go  brazy when they bump my shit\n\n[Verse 2]\nNigga I'm a throw back, you already know that\nGot swag and I'm street, picture the nigga Hov' strapped\nAnd it's the rock right in my fuckin sock\nDie for my chain, why?\nSo I can go fuck with Pac\nBefore I go, I shoot it out with the cops\nHit one for Sean Bell then bleed on the block, yeah\nLike Big did, I play with toys like a big kid\nGot a snub nose, call it Big Tig\nYou art not fuck with Game, he crazy\nAnd the bars comin' straight outta Compton, baby\nMy 16's mean, you know what I mean\nHeaded to the airport, my flow flying in from Queens\nAccompanied by my bitch, flying in with them things\nMy shorty is a 10, that's that singing nigga, Dream\nThe life of gangsta in Cali is too short\nSo I might as well find me a borough in New York\n\n[Hook: Newz (The Game)]\nThrow yo hands up it's that gangsta shit\nAll the homies go brazy when they bump my shit\nGo ahead and hate on my click\nGot a couple words for you nigga, suck my dick\nYou strapped? (That's right)\nGang bangin? (for life)\nA little drama (that's life)\nHit 'em up (Nice)\nIt's that gangsta shit\nAll the homies go brazy when they bump my shit\n\n[Verse 3]\nMan you know, I don't give a fuck and I don't give a shit\nAny drama, I'm locked on like a red-nose pit\nKeep shooting them cap guns with the red nose tips\nHave some Cali niggas come out and dead those strips\nGive a fuck if you tough nigga, or you buff nigga\nMy 4-5 weigh 3 pounds and it'll snuff niggas\nHop out the truck with the gun so long\nLet the bullets jump out and ask, \"What's going on?\"\nWhat the fuck can I say? I grew up a bastard\nGot sick of the Impala so I threw up a Aston\nI pop big shit, and I keep my wrist lit\nMy entourage shine like the Diamond District\nI got a Rolex, a real big Rolex\nWith so many rocks, the Africans is trying to protest\nBully of the block, why? Cus they got me top 5\nThere's four niggas better than me? Nigga, stop lyin!\n\n[Hook: Newz (The Game)]\nThrow yo hands up it's that gangsta shit\nAll the homies go brazy when they bump my shit\nGo ahead and hate on my click\nGot a couple words for you nigga, suck my dick\nYou strapped? (That's right)\nGang bangin? (for life)\nA little drama (that's life)\nHit 'em up (Nice)\nIt's that gangsta shit\nAll the homies go brazy when they bump my shit\n\n[Outro]\nNewz!\nNiggas better know what the fuck they dealin with\nWhen they dealing with the fuck they dealin with\nYou dealin with a fuckin animal, man\nGotti will tell you, nigga, both the Gottis, nigga\nYou can bring John Gotti back too, nigga\nHe'll tell you, man\nI'm gangsta, nigga\nI was Murda Inc. before anything, man\nBlack Wall Street, Murda Inc., man\nBefore there was a Dr. Dre there was a Irv Gotti, nigga\nWhen I was running around with P. Diddy in Atlanta, nigga\nSlapping asses, nigga\nMario Winans know what it is, nigga\nMix bitches all up in the height on Peach St., nigga\nBeen getting money, nigga\n7 years strong, nigga\n2 platinum albums, nigga\n'Bout to be three\nAy, nigga that's muthafuckin hip hop menage a trios\nBITCH!", "image": "https://images.genius.com/bba1920bee43a618432ce43748293ec6.1000x1000x1.jpg"}], "artist": "The Game"}