{"songs": [{"title": "Gangsta Walk", "album": "Dead Man Walkin", "year": "2000-10-31", "lyrics": "[Kurupt]\nNow this side gangsta walk (say what?)\nAnd this is how gangsta's talk (like that?)\n\n[Breakdown: Kurupt]\nTell 'em how we do, tell 'em what we do\nThis is what we do nigga - gangsta's talk!\nTell 'em one more time - gangsta talk!\nAll the homies in the hood - gangsta talk!\n\n[Kurupt]\nTo my nigga Eastwood - gangsta talk!\nKurupt and Daz - gangsta talk!\nGangsta's ride, uhh, do what gangsta's do\nBandanna hangin from the rear view\nToo smart, load them up, hold 'em up (though)\nWe could go head up, and I'll fold 'em up slow\nThere's a gangsta loose, callin all cars\nJust left the house in some blue Allstars\nPassin by on them thang, it's a brown MC\nNiggas goin buffin DPG (Dogg Pound, Dogg Pound)\nNiggas mad doggin bumpin a bank account (wood)\nBut I don't recognize the busta\nSo I hit up the hood, wit one hand on the heater\nThe other in the air, Dogg Pound gangsta's yo, we don't care\nI gots to watch myself - especially my health, before anything else\nMy life, my wealth, I'ma G, and I do what gangsta's do\nAnd they do it like me and my G Tray Deee\n\n[Snoop Dogg]\nBitch talkin shit, I'm finna dip\nCall up my niggas and say \"Yo, don't even trip\"\nDAZ and my nigga Kurupt\nCame through in a MC and scooped me up\nAiiyo, I got the sack as I usually does\nYoung Gotti in the back seat fucked up cuz\nMan it's a shame how my gang-gang-bang\nNo disrespect but, hey, we run thangs\nIn the ? lets see what quest over seas\nEightball slippin, Dogg Pound trippin\nBack in the mo', where we don't give a fuck\nMy baby brother N-Y-A, and he just he got stuck\nBy them same motherfuckers who supposed to be killin me\nPeelin me, and ya niggas ain't feelin me\nBad news, seem to travel fast\nWhen you on the mash, and all about'cha cash\nAll my niggas in the pen, gangsta talk\nAnd all my homies sippin Hen', gangsta talk\nAnd If ya can't get out, and you mad as hell\nSay \"Biatch,\" that'll make ya sound for real\n\n[Daz Dillinger]\nHaha..\nFuck wit us we, gon' hurt somebody\nFuck wit us we, gon' hurt somebody\nCorleone, Dillinger, Young Gotti\nFuck wit us we, gon' hurt somebody\n\nCha-pow!  Layin all these wack niggas down\nChurned out, blowned out, work high, hell\nWhattup?  I see my niggas all in the cut\nLayed back, actin a nut, waitin 'till we 'rupt\nNo remorse, as we bust, let her feel the dust\nLet 'em do what we gotta do, fuckin shit up\nLet it be known - Daz Dillinger, rough to the bone\nAnd all alone through ya neighborhood at high exhaust\nHigh stylin and profilin, niggas comin after me\nIn actuality they face the technicality\nLet 'em feel the battle, it was a tragedy\nEverywhere a nigga die for the salary\nPray to God, pray to Lord, watch after me\nPrepair the back sniff streets mentality\nIt's the gang and we mad and we walk and we stalk\nAnd we do what we do after dark\nNiggas keep doin what the fuck they gotta do\nAnd we do what we do when we mash wit our crew bitch (ssh!)\nDillinger, willin ya and killin ya\nDoin what I gotta do, it's blood that I'm spillin ya (yeah)\nAll over your floor; tell the fat guy \"Ignore\"\nBreak down your door and let kick ya one more!\n\nGangsta strait out! (bitch)\nTo the flat like that\nLike whaaat, like this, like whaaat\n(like this, like that)\n\n[Kurupt] Now this is how gangsta's walk\nAnd this is how gangsta's talk\n[Daz]\tWhattup!?\n\n[Breakdown]\n\n[Kurupt]\nThe homie Big Style, gangsta talk\nThe homie Tray Deee, gangsta talk\nYeah Bad Azz, gangsta talk\nThe homie Technique, gangsta talk\nSoopafly, gangsta talk\nKurupt and Daz, gangsta talk\nAll my hoes, gangsta talk\nAll my bitches, gangsta talk\nAll the homies, gangsta talk\nTell 'em on more time, gangsta talk\nBiatch!  Gangsta talk..\n\n[Snoop Dogg]\nYeah, this is how the gangsta's talk\nYeah, yeah, gangsta walk\nAll the real G's out there\nI know you gettin yo gangsta walk on right now\nY'know all the real mack's out there\nGettin they gangsta talk on right now\nYeah, DPG, as you can see\nWe in the place to see\nWe not talkin 'bout history, or biology\nWe just talkin 'bout g-eology\nStrait up, gangsta walkin\nWe just gangsta talkin\nDPG - we're gangsta's meant the world go..", "image": "https://images.genius.com/e7d84865e8d21f7778aa93228a899a2c.599x623x1.jpg"}], "artist": "Snoop Dogg"}