{"songs": [{"title": "Plead for Your Life", "album": "Return of the Dozen Vol. 1", "year": "2008-05-21", "lyrics": "[Intro: Young Mase (Kuniva)]\nNew D12! (Yeah)\nPlead for your life, niggas! (Yeah, yeah)\nYou know what time it is!\nKuniva!\n\n[Verse 1: Kuniva]\nWe're back on the map, spit crack on the track (Oh!)\nNiggas try to take our heart, click-clack, give it back\nSpit around, I spit it back (Uh), this is how you peel a cap (Yeah)\nGive it to 'em face to face (Uh), nothing can [?] (Yo) (D12)\nDetroit is a city where niggas gettin' stomped out\nLike they puttin' blunts out with they feet, get gunned down\nIn the street, so what now? When the pump gets pumped out\nWhen the pump thumps hands in the air like touchdown\nLacerations and cuts now, I want his eyes shut now\nHit his ass right now, I don't give a fuck how\nYou better not [?] nigga, lay a finger on me\nOr torch me sideways or even think of swingin' on me (What up? What up?)\nTake a chance, come and holler [?] a problem solver\nAnd I'll stretch a hater out further than my last dollar\nThat's your ass partner, my blood is bubblin' (What?)\nI will pop you, grab a passport and move to Dublin (Ha ha)\nI'm back in it like a repeated felon, I'm pacin' back and forth\nWith the heater, sweatin', maybe I should see a reverend\nYou can feel the anger inside me, I don't hide, see (No)\nI let it consume me, won't run, I let it guide me (Yeah)\nWhen most people take a loss they turn to liquor and drugs (Nah)\nWe took a L, but we turned to pistols and slugs (Blaow)\nAnd I don't have to run after you, the bullets can chase you\nLight your whole mouth piece up and give you a facial, nigga (Blaow)\n\n[Chorus: Kuniva]\nHow's it gonna feel when you pleadin' for your life\nBy your nightstand in the dark speaking to Christ\nWhile you gettin' duct-taped on your knees with your wife\nIf you don't believe in God, you believe now, right?\nHow's it gonna feel when you pleadin' for your life\nBy your nightstand in the dark speaking to Christ\nWhile you gettin' duct-taped on your knees with your wife\nIf you don't believe in God, you believe now, right?\n\n[Verse 2: Swifty McVay]\nThis is your brain on crack, my favorite sport is full contact\nBut only when the stainless attract (Damn!)\nI'm makin' niggas famous overnight, anus full of dynamite\nNeed ta treat ya life more sacred when you ain't on the mic\nWe don't need to conversate, you can speak to [?]\nI'll abbreviate you, your family, and affiliates\nBleedin' quicker than haemophiliacs when penetrated\nMedication's no option, sent away like adoptions (What the fuck?!)\nWilder than a foster juvenile child with an ulcer\nHavin' thoughts to finish you in the hospital\nI treat this thuggin' like a gospel\nStickin' my rascal in your nostrils is what I get high to\nResponsible for drownin' you niggas so [?]\nAnd fuck goggles, you floatin' in a swamp with a mongoose\nI'm on you like you caught with a tape recorder\nI ignore restrainin' orders, I'm waitin' on niggas porches\n\n[Chorus: Kuniva]\nHow's it gonna feel when you pleadin' for your life\nBy your nightstand in the dark speaking to Christ\nWhile you gettin' duct-taped on your knees with your wife\nIf you don't believe in God, you believe now, right?\nHow's it gonna feel when you pleadin' for your life\nBy your nightstand in the dark speaking to Christ\nWhile you gettin' duct-taped on your knees with your wife\nIf you don't believe in God, you believe now, right?\n\n[Verse 3: Royce Da 5'9]\nYeah\nYou should admire my tech-work, now slide me a check first\nUndeniable expert, high as my net-worth\nDrunker than Mel Gibson, deeper than Christ\nLookin' like I'm riding with the whole Verizon network (Oh!)\nYou want no problems, I put you in pyjamas\nNight night if you insult, when I write my pen smoke\nI'm the shit, my scent so influential, hustler\nEverything's for sale 'cept my soul and a trench coat\nYes, we did it, Nickle Nine and D-Twizz\nWe puttin' steel to heads, feel the lead (Uh-huh)\nWe puttin' feet to pegs, nigga, beef to bed\nDoo-doo bags to bellies, boy, wheels to legs\nMachines for breathin', you ain't gotta be Wayne\nTo throw up blood while you on that lean this evenin'\nYellow tape the scene, put the news out front\nAnd give homicide forty-eight hours to prove I done it (Come on!)", "image": "https://images.genius.com/ee35f41ed149c86d6fe47f68d55c39e1.450x450x1.gif"}], "artist": "D12"}