{"songs": [{"title": "Blank Face", "album": "Blank Face LP", "year": "2016-07-08", "lyrics": "[Intro: Anderson .Paak]\nWho you tellin'?\nBlank faces\n\n[Verse 1: Anderson .Paak]\nSmokers and dope fiends, hookers and playas\nDope in the vein, young'ns servin' the meds\nRun from the police, jump from the ledge\nBe what you wanna be as long as you get the money right\nNiggas don’t understand until you leap over 25\nDancin' with devils, never knew how to treat your woman right\nFeet on the pedal runnin' over jokers and funny tops\nWord to my OG, he gone, that nigga fresh out of strikes\nI should know better\nHeaven knows that I ain’t the dummy type, nah\nI should be flyin' home without a care\nMy baby don’t want no toys, she want me there\nI trade the noise for a piece of divine\nI savor my coins for a piece of the land\nSomething to pass while I'm passin' my prime\nMy word in the cards, full deck in my hand\nAs sure as the smog is pollutin' the land\nBe what you wanna be as long as you get the money right, yeah\n\n[Verse 2: ScHoolboy Q]\nWise as my Chevy\nMy life’s so fucked up the drank don’t get me buzzed\nWe ain’t blood and they killed my cuz\nChuckin' Cs since I was a cub\nYoung nigga grew up on hate but where’s the love?\nAsh and dubs on\n\n[Bridge: Anderson .Paak]\nNiggas don’t understand until you leap over 25\nDancin' with devils\nGuess you would say I'm one of the lucky type\nNo—fuck you thought?\n\n[Verse 3: ScHoolboy Q]\nPlayin' tooth fairy, Santa before I’m buried\nEaster egg huntin', pickin' seeds out the pumpkin\nSix years straight the valentine for my munchkin\nI made a queen outta nothin'\nTold me stay in school, my dream was just a small percentage\nSaid a million wasn’t realistic\nLast year I spent it, what’s the laws of physics?\nMove pounds or move down to Section 8 livin'\nGrew up around Crippin', woo business\n\n[Outro: Anderson .Paak]\nAnd if I never make it to 25\nI swear to God I’m still gon' fly, nigga\nBut it’s still my time, nigga\nTell me who gon' fly with me?\nYeah!\nWho gon' ride with ya?\nWho gon' fly with ya?\nIt’s still my time, yeah\nIt’s still my time, nigga, yeah", "image": "https://images.genius.com/2d03dd3816b9f03a303110b5628e696c.1000x1000x1.jpg"}], "artist": "ScHoolboy Q"}