{"songs": [{"title": "Track Two", "album": "Control System ", "year": "2012-05-11", "lyrics": "[Produced by Tae Beast]\n\n[Intro]\nB-O, what up, my nigga?\nE3, I'ma get you on these Backwoods, last thing I do, nigga\nYeah, oh shit, nigga! Oh shit, nigga!\nThese niggas did done it again\nTae Beast, why you do that, man?\nWhy the fuck you had to do that, man?\nThis shit sound like a 100 birds under the Carson Sheriff Station\nI told Rezack, get off my sack\nWe really out here, my nigga!\n\n[Verse 1]\nWhen I roll through the city it give me a rush\nYeah, I'm high off life, but I'm rollin' blunts\nAnd they couldn't wait for Soul to reappear\nClick, boom; TNT, TDE, we in here\nMm, mm, mm! I can smell fear\nFrom a mile away, you might as well get from 'round here\nI run the town like Roc Nation, no exaggeration\nBet I rise like Lazarus, use your imagination\nFascinated by you faggots hatin', get an occupation\nYou in violation, provoke annihilation\nFlow like the Nile River, yo, it's now or never\nYou had a release date, but now it's never\nYeah, welcome to the Control System\nI'm stimulatin' the hoes and educatin' my niggas\nI wiggle through potholes, my destination is vivid\nTo the end of the road I'm driven, y'all trippin'… Soulo\n\n[Hook]\nAnd we stuntin' like, Ab-Soul, abstract, asshole\n(Give the people what they need!) Damn right, let 'em know\n(You got some kind of disease!) I'm the illest in the business\nIf you ain't with the business, mind your business\nAnd we stuntin' like, Ab-Soul, abstract, asshole\n(Give the people what they need!) Damn right, let 'em know\n(You got some kind of disease!) I'm the illest in the business\nIf you ain't with the business, mind your business\nAnd we stunting like\n\n[Verse 2]\nLike I ain't never had shit, ‘cause I never had shit\nSame Chucks, two years straight, doin' bad shit\nSick, twist two spliffs out my dime bag shit\nPissed, tryna get a good response out this bad bitch\nWhich one of you niggas wanna call my bluff?\nWish granted, call his ass granite, now he mopped up\nNever been locked up, but I keep a sentence\nWinners win and sinners sin only to ask God forgiveness\nIn this world of luxury cars and legal tender\nJohnny want me like Wyclef Jean: gone til' November\nPop my collar like I'm Don Juan, green to my slippers\nJust remember that they don't want me to get ignorant\nSinister literature, given from this wicked minister\nWitness your future diminish, no present from Saint Nicholas\nIn particular, you're just a thing of the past\nI'm a diamond ring in the trash, no reason to brag, it's Ab\n\n[Hook]\nAnd we stuntin' like, Ab-Soul, abstract, asshole\n(Give the people what they need!) Damn right, let 'em know\n(You got some kind of disease!) I'm the illest in the business\nIf you ain't with the business, mind your business\nAnd we stuntin' like, Ab-Soul, abstract, asshole\n(Give the people what they need!) Damn right, let 'em know\n(You got some kind of disease!) I'm the illest in the business\nIf you ain't with the business, mind your business\nAnd we stunting like\n\n[Verse 3]\nWhat's your life about? Enlighten me\nIs you gon' live on your knees or die on your feet?\nCan't lose, you niggas must admire defeat\nYou lyin' like Nala, nigga, you know where to find a nigga\n(Del Amo!) Carson in the house\nThe View, The Village, Scottsdale and right back around\nCan't forget about The Patch, matter fact\nI got some homies off Grace Ave, we go way back\nBeen runnin' round since L train cut up at Our People\nRocket was my role model, Lil Roccett my number one O-migo\nWent 15 in the back alley, hop fences and skip school\nFellowship with the gang members, and goddamn it, I still do\nBut just imagine if Einstein got high and sipped juice\nBroke rules, got pussy, beat up rookies on Pro Tools\nYou'd probably call his ass Soul Brother #2\nAnd I just took a number two, and ain't this track number two?", "image": "https://images.genius.com/36147c3e9b6fcfa747233bb1c340f424.500x500x1.jpg"}], "artist": "Ab-Soul"}