{"songs": [{"title": "Who Do You Love?", "album": "Loyal to the Game", "year": "2004-12-12", "lyrics": "[Intro]\nMaybe it's the thug in me\nMaybe it's the thug in me\nMaybe it's the thug in me\nMaybe it's the thug in me\nMaybe it's the thug in me\n\n[Verse 1]\nEver since I was a young scrub\nI was a thug on the corner with my niggas slangin' drugs\nAnd runnin' from the narcs when they pass by, don't ask why\nI'm a hustler, till my ass die\nEven if I do come up, I'll be ready when they run up, huh\nI'll be a nut to put my gun up, huh\nI never trust these hoes at all\nFuckin' with them tramp ass sluts who supposed to fall\nSaid she played you for your money, but the shit was cool\nGuess it's true, niggas be bitches too\nYou can't see how she worked you all up in the skirt\nNow you lookin' like a jerk 'cause she hurts you\nNow hands up, don't be a playa hater, just peep game\nKeep your mind on your money, watch the bitch change\nSee hoes love thugs and thugs love loot\nHand it over motherfucker 'fore I shoot, who do you love?\n\n[Chorus]\nMaybe it's the thug in me, maybe it's the thug in me\nTell me who do you love?\nMaybe it's the thug in me, maybe it's the thug in me\nWho do you love?\nMaybe it's the thug in me, maybe it's the thug in me\nTell me who do you love?\nMaybe it's the thug in me, maybe it's the thug in me\n\n[Verse 2]\nI'm livin' that, thug life baby!\nSteady smokin' Indo, goin' crazy\nBaby come and hug me when you rub me, turn the lights down\nWe in the dark, do you love me?\nEverybody's talkin' 'bout they know me\nBut they ain't down like my motherfuckin' homies\nTell me what you need when you see me\nAnd we can get it on, biatch, take it easy\nDon't try to hold me, control me\nBut you can take my number, baby, call me when you're lonely\n'Cause it's a man's world, ain't no need to ask why\nI'm high till I die and strapped with my .45\n'Cause you can lose it in the gutter\nI wonder if I'll die by the hands of another broke motherfucker\nThey call me the alcoholer, I'm all in\nThug for life, nigga, ballin'\nI'm gettin' tired of these hoes tryna play me\nYou can't fade me and my niggas goin' crazy\nAll day long I'm straight thuggin', and constantly mean muggin'\nBreakin' the bitches that be buggin', tell me who do you love?\n\n[Chorus]\nMaybe it's the thug in me, maybe it's the thug in me\nTell me who do you love?\nMaybe it's the thug in me, maybe it's the thug in me\nWho do you love?\nMaybe it's the thug in me, maybe it's the thug in me\nTell me who do you love?\nMaybe it's the thug in me, maybe it's the thug in me\nWho do you love?", "image": "https://images.genius.com/aff64f752ccfff1d48590e5db3c0357a.300x300x1.jpg"}], "artist": "2Pac"}