{"songs": [{"title": "Something Else", "album": "The Last Kiss", "year": "2009-04-07", "lyrics": "[Intro: Jadakiss] + (Fiend)\n(Uhh) Definitely what they been waitin for (you already KNOW, yeah)\nAt least a certain percentage of the world (uh-huh)\nAnyway (hahahaha)\nCan I talk my shit? (talk that shit)\nSure I can (talk that shit, talk that shit)\nCause ain't nobody gon' do nothin about it anyway... a-ha-HAHHHH!\n(Talk that shit, talk that shit, Jada talk that SHIT, ohh!)\n\nYou could tell the way I stack my money (I'm somethin else!)\nNah, I ain't one of them dummies (I'm somethin else!)\nTre's, nick's, dimes and twenties (I'm somethin else!)\nThe way I get it in with the honeys (I'm somethin else!)\n\n[Verse One: Jadakiss]\nYo, you know I love to style on ya, blue 40-caliber\nButterfly doors on the triple black challenger\nAnd I'm still in and out, got it so I'm spendin out\nDope boy, so I never have a problem in a drought\nDon't take, too much work if you can't manage that\nJust in case you run out of empties, use sandwich bags\nPlay with the hand you was dealt\nThat's why I ride the track 'til it melt\nI could care less how you feel, how you felt\nI done spent niggas rent money on belts\nThreesomes in the trunk, I'm fuckin for the wealth\nAnd the hood ask about me, I'm somethin else\n\n[Hook: Jadakiss] + (Fiend)\nYou could tell the way I stack my money (I'm somethin else!)\nNah, I ain't one of them dummies (I'm somethin else!)\nTre's, nick's, dimes and twenties (I'm somethin else!)\nThe way I get it in with the honeys (I'm somethin else!)\nStill representin the block (I'm somethin else!)\nAnd you ain't got to tell me I'm hot (I'm somethin else!)\nI'm exactly what they not (I'm somethin else!)\nHahh (I'm somethin else!) AH-HAHHH! (I'm somethin else!)\n\n[Young Jeezy - over Hook]\nC.T.E. nigga... yeah!\nYeah! Let's go\n\n[Verse Two: Young Jeezy]\nI ain't even did nothin, feelin like I'm traffickin\nSee these blood diamonds, sir, my chain African\nSpeakin of my chain, yeah it need to get a job\nGet the fuck up off my neck, sell dope or rob\nWhatever that you do, look, don't get caught\nThat stash get low, ya ass might get bought\nOkay I'm over it, let's talk about somethin else\nI said I'm over it, I think I bought somethin else\nThat's why I live e'ry day (day) like a thug holiday\n+Suffocate+ a nigga about mines - J. Holiday\nQuick to make a movie 'bout mine, Doc Holliday\nWork strapped up  365, even holidays, yeah!\n\n[Hook]\n\n[Verse Three: Jadakiss]\nYo, it hurts cause they know that I'm better, and they hate it\nThey came in with my whole style, and they made it\nThe dope boys love me in the hood, I'm they favorite\nIn the jails, niggas is makin bets I'mma say shit\nHands-on with certified G's\nHave your whole family missin for 35 G's, please\nI perfected my craft from a different aspect\nSo the bars is lethal and the voice is a asset\nAnd as far as the people, they ain't finish the class yet\nI'm beyond these feeble-mind rappers that half step\nI don't carve the way, for these niggas like Aztecs\nI touch souls, somethin's felt; yeah, I'm somethin else\n\n[Hook]", "image": "https://images.genius.com/74f6cb8e37420dc73fd4019537e3cbd1.953x953x1.jpg"}], "artist": "Jadakiss"}