{"songs": [{"title": "Fire in AC", "album": "Boiling Point: K.O.D. Collection", "year": "2012-10-30", "lyrics": "[Intro: Tech N9ne]\nShh, psycho over there\nHere he comes, here he comes\nHey James\n(Yeah?)\nYou're killin' us with that wild red hair, bro\n(I like to kill people, people like you)\n\n[Verse 1: Tech N9ne]\nI'm a college student sitting next to James Holmes\nHis mental light ain't on and the lovin' him ain't showin\nSo I gotta invite him to study at my strange home\nCause he needs to be flame thrown and repeatedly banged on\n'Til his brain gone, you think you Bane? I put my fangs on\nThen it's game on, for the pain, gonna break his dang bones\nCause James wrong, get him a hook to hang on\nAnd drain Holmes veins; get em to switch his insane tone\nYou have entered the dungeon of real killers\nDemons they will fill us, with drillas and steel millas\nHe'll pay me with his life, cause this animal's real crazy\nCause this motherfucker don't even care if he kill babies\nI wish, this would've happen like it happened in my mind\nInstead of what occurred in theater number 9\nMy condolences to the families that mourn\nAll humanity was torn, for what he damaged see some horns, motherfucker\nBurn in hell for eternity for what you did\nThe depths of Hell gonna swallow your ass!\n\n[Hook: Tech N9ne & Smackola]\nGone, baby, gone, never made the dawn\nNever had a fucking chance to turn crazy on\nMy fire in AC he stopped you, shocked you\nAurora Colorado, I got you\n\n[Verse 2: Smackola]\nRaa! Dirty Wormz\nThis is Amityville horror Aurora, I make him feel the flame\nFor the respect of the families I mention no names\nAnd I can feel your pain; you see the devil's face?\nLook at him smiling on trial, this is a closed case\nMister Yates, let him in, close the gate\nThis is the date for his fate, there will be no escape\nDuct tape, zip him up, strap gim down\nHe's graduatin' here give him his cap and gown\nTurn off your cell phones, no talking in the preview\nIt's the last midnight show and you know just how it end, too\nIt ain't no part two, this ain't no cartoon\nWatch em start screamin' for god when I put this fire to him\nThis is the murder show, order the blood bath\nA psychopath that murders psychopaths actin' bad\nAnd walk away like I'm Dexter man with my bandana to the back\nIn all black like I'm Batman\nDirty Wormz\n\n[Hook]\n\n[Verse 3: Krizz Kaliko]\nHahahaha, here's Kali!\nWhat you want me to be a, killa?\nWish I can fill up my voice with some incredible heat\nAnd no catchin' me slip, and I stay on my feet\nCall up Brotha Lynch and I tell him go eat\nJames, your brain will be dangling from strings if the\nStrangers could change it, at yourself you would aim\nI wish a nigga would, run up in the movies\nWhile I'm in there with my kids and my boo\nI would be popping them back at you\nCause oddly they life is through\nAnd I'm godly but might get stupid\nPsychotic ain't no excuse\nCause I'm there too and I can prove it (Okay)\nWe hold him for pressures, it ain't effortless\nFor Holmes to count his blessings\nCause he gotta deal with the rest of us (Okay)\nAnd I'd love to take his chest off the rest of him\nArrestin' him ain't good enough, let's make him a vegetable\nOn second thought, I'mma pray for him (Nah)\nHope the angel of death opens the gate for him (Yeah)\nBetter tell him if you bust in Aurora\nAll the nations reppin' Snake and the Bat will be aiming for you (Kali)\nIn the immortal words of Tech N9ne baby\nThe sands of time have already begun to pour against you\n\n[Hook]\n\n[Outro: Krizz Kaliko]\nI got ya, Colorado I got you\nTech N9ne got you, Smackola got you\nStrange Music that’s our biggest market\nWe love you, our condolences to the families\nThat lost their loved ones to this punk", "image": "https://images.genius.com/b49e837c9c7732be929537953b47ac6e.700x700x1.jpg"}], "artist": "Tech N9ne"}