{"songs": [{"title": "Never Snitch", "album": "My Homies Part 2", "year": "2006-03-07", "lyrics": "[Scarface]\nNiggas forget about the streets but when they rap they songs\nThey claim they tote the heat, they quick to clap they guns\nIn interviews be braggin bout the crack they slung\nBut when it's war, these cowards never blast, they run\nThe fuck you think you foolin dog? I live this shit\nI know it when niggas fake it - I live this shit\nYou can front it all you want but when yo ass gets hot\nThen you can rest assured nigga - yo ass gets got\nI'm sayin that to say this - I can plot those hits\nI'm connected in every city on capo shit\nI ain't even gotta say these niggas know my ties\nA nigga made, therefore whoever cross gon' die\nMoney changin motherfuckers, makin hoes grow nuts\nYou a bad motherfucker, you don't give no fuck\nLet me snap you back to reality dude, shit's real\nYou a target, niggas in Houston want you killed\nFacemob until it's over, Southside the pipes\nDirty Third in this bitch, J. Prince for life\nDedicated to these niggas live and breathe that shit\nLet the real niggas shout it out, scream that shit\n\n[Hook - Scarface]\nI never snitch, I never lie\nI'm not a bitch, I rather die\nCan't nothin change me, not even time\nI make the money, money don't make me a dime (x2)\n\n[Beanie Siegel]\nFacemob! Yeah\nB. Sieg baby, I'm back up in this bitch like what\nFresh out the pen, once again I'm here to grab my nuts\nI am hell for real - you doubt it nigga? call my bluff\nOnly respect men that's real, you coward rat-ass fucks\nWho raised you niggas? Yo father probably hate yo guts\nMad he didn't double up, and that Lifestyle bust\nYa lifestyle fucked, ya duckin, every corner tryna clap at you\nPlus fuck ya mother, the bitch ain't shit for havin you\nWhat? If you don't like what I'm sayin, fuck ya attitude\nSame lame probably showed these rap niggas gratitude\nHuh, happy they ain't snitch on you\nMust I remind yo monkey ass what a bitch might do?\nThey act like they got yo back to infiltrate yo rest\nThen have you talkin +Through The Wire+ like Kanye West\nTo all my real niggas trapped homey, mind yo tongues\nCuz these cowards comin home after firin they ones (?)\nI never snitch\n\n[Hook x2]\n\n[The Game]\nSnitch niggas, bitch niggas, they all the same face\nNo matter what hole you crawl in, nigga you ain't safe\nAll you niggas is rats, nicknamed Jake\nSam, Curtis or Alpo belong in the same place\nA penitentary cell block gettin gang raped\nCoward motherfucker, now tell me how my name taste\nI leave you bleedin like ya period came late\nRed bandana on, call that my Game Face\nNiggas come in all shapes\nSome snitches wear Reeboks, some wear Bathing Apes\nSometimes they Crip niggas, other times Piru\nAnd some snitch niggas look just like you\nI promise to never snitch, like some of my homies\nG-Rock, B-Mase, and O.G. Tony\nBefore I have the police run in ya house\nI kiss my son on the cheek and put the gun in my mouth, motherfuckers\n\n[Hook to fade]", "image": "https://images.genius.com/a265e934604ca0815fed6130b5947316.500x500x1.jpg"}], "artist": "Scarface"}