{"songs": [{"title": "To Da Top", "album": null, "year": null, "lyrics": "[Verse 1]\nIf I go back to Cleveland with nada\nI'mma have one disappointed mama, no!\nI'mma have one disappointed fam, I'mma feel bad\nThat I can't provide for my fam\nI can't help how my mom process\nMr. Hutch told a nigga \"young, learn to be the best\"\nAnd if I can't do that mayne, what the fuck I'm living for?\nI got a pack of Newports and a super-bad whore\nI step out and I drink a lot of Hennessey\nBattle in my sleep with the demons tryna ruin me\nA bunch of discouraging words, saying that fame wasn't meant for me\nTake it back to Cleveland, you heard?\nI can't stop them from speaking\nTheir visions are intense, got me laid out leaking\nY'all don't know the half, kid cudi got issues mentally\nThat I scribble down fast, like\nI won't fold, I can't fold\nI won't fold dogg, I can't fold\nIs what I say to myself over and over\nCruising through the city in my black Range Rover\n\n[Hook]\nHeard em' whispering, I heard them talking now\nNow that I'm bubblin'\nThought I forgot how you\nTryna take me off my grind\nYup, yup, they tryna take me off my grind\nBut it's my time, boy\nWe going straight to the top\nWatch me live, my nigga\n\n[Verse 2]\nWhen you making moves, everybody pounding you\nBut when you down and out, niggas won't acknowledge you\nSick to the stomach when I think about losing, but\nI like this music, so this the life that I'm choosing..\nI had to find out who the real Scott was\nMeditated with the wolves, all focused to get my hunger back\nSo alone, just me and an instrumental\nThey say my music ain't normal\nMust be something up with my mental\nI don't spit about guns and drugs\nWell dumb fuck I don't know about guns and drugs\nI spit what I know, and you should too!\nBut you won't, we all know, you wanna jock the next dude\nAnd you follow the next man\nWell I was born to be a leader so you know that I'mma follow my heart fam\nAnd I'mma roll with what my nigga Manny said\n\"Keep your individuality because that's what's gonna get you bread\"\n\n[Hook]\n\n[Verse 3]\nI ain't tryna make hits for the club no more\nI'm just tryna make hits for my niggas at war\nDay to day in the White Man's World\nGetting head from the white man's girl, that's me\nWhen I'm stressed\nHaving dreams of a dark-skinned chick with big breasts\nWhile I'm thinking of steps to be king, just like in chess\nKid Cudi won't rest, that's when I'm at my best\nFlow's good ? I see the rest mayne\nA lot of cats tryna make it happen through the music\nTruest thing about it is not everyone can do this\nGotta spit it different from another nigga living\nIf I ain't, I'm slippin\nAnd I'm never getting up\nWith that in your head, dogg, I'm never giving up\nLooking up at the ceiling, chillin at my wake\nThese lames gotta hate, see the lyrical wizardry\nAiring out my dirty laundry for these niggas that ?", "image": "https://images.genius.com/57fc91d7548f4e591a971ea7f5443a88.355x355x1.jpg"}], "artist": "Kid Cudi"}