{"songs": [{"title": "From Da Bottom", "album": null, "year": "2013-01-16", "lyrics": "[Intro: Meek Mill]\nYoung niggas gettin' money\nAnd we don't owe you niggas shit\nI'm from Philly nigga\nWe come from the bottom\nCome from nothin'\nAnd niggas got the nerve to ask me why I'm stuntin'?\nHuh?\n\n[Verse 1: Meek Mill]\nI'da sip Ciroc with Diddy, drunk Spade with Hov\nIn the VIP of the 40, with some bad-ass hoes\nHad my grip on my forty, still was at that stove\nThe same night work got cooked half that sold\nA pyrex and a triple beam\nLike Mr. King had a dream we ain't miss a fiend\nTalking dirty to these niggas with my Listerine\nIf I was there you know we ball, Mr. Clean\nI'm talking LIV Sunday blowing hella racks\nJust getting right cause in my life I been from hell and back\nI'm just that nice and I don't write so you can tell 'em that\nI'm just making up for nights when I was selling crack\nOn the corner in the cold tryna sling them O's\nAnd half my niggas in the city went against the code\nThem niggas told, still partying them niggas bold\nBut I'm like fuck it I'm young and getting it them niggas old\nTake a walk up to that mirror boy look at yourself\nYou see a getta or a nigga just lookin' for help\nAnd every night I'm in the studio killing myself\nA lot of niggas hate me now cause I'm feeling myself\nFuck em' though\nThey screaming be humble, boy be humble\nBut ain't nobody say that when my stomach used to rumble\nLooked in a cell when I seen my dreams crumble\nNow I'm out here buzzing you can here the bee's bumble\n\n[Pre-Chorus: Guordan Banks]\nSeen some things that can't be told\nI was told these roads was pure as gold\nI never told I never sold my soul\nI just went at every thing I dove\n\n[Chorus: Guordan Banks]\nNobody's going back to da bottom\nNobody's going to da bottom\nI can't be every nigga role model\nI can't go back to the bottom\n\n[Verse 2: Meek Mill]\nNiggas getting high, just to take the pain away\nWhen I'm just getting by couple million for a rainy day\nOff season but I practice like I got a game today\nAnd everybody ain't gon' make it out it's a shame to say\nFeeling like Mike before the fade away\nI'm like should I take the shot? or let it fade away?\nAnd all this love I'm getting ain't gon' take the hate away\nBut these haters motivate me in a crazy way\nAin't no I in team - from what I done seen\nIt's every man for himself well, until I intervene\nI put my niggas on paper, we swarm paper like lions when they smell blood\nWhen dream shatters they sell love like cocaine\nOr heroin from heroin I'm Cobain\nI'm blowing up I did my own thing\nThey want my soul and my body for a little change\nI'm dancing with the Illuminati, call it Soul Train\nNigga\n\n[Pre-Chorus:  Guordan Banks]\nSeen some things that can't be told\nI was told these roads was pure as gold\nI never told I never sold my soul\nI just went at everything I dove\n\n[Chorus: Guordan Banks]\nNobody's going back to da bottom\nNobody's going to da bottom\nI can't be every nigga role model\nI can't go back to the bottom\n\n[Verse 3: Meek Mill]\nLast night I forgot to pray for shit that I got today\nThe devil 'round the corner and the reaper a block away\nIt's body after body very few of us find a way\nYou gotta watch for the hook like you sticking Dr. J\nMy defensive is like three fences and a brick wall\nI get soft every time we go against ya'll\nI'm on guard play the point like I'm Chris Paul\nYou get crossed like AI did Mike for this ball\nFor this rock, you get shot, picked off\nCause in this game we shooting metal like it's pin ball\nI put this Mac to your face like lip gloss\nAnd do you right and put you on ice like Lindros\nNigga\n\n[Chorus: Guordan Banks]\nNobody's going back to da bottom\nNobody's going to da bottom\nI can't be every nigga role model\nI can't go back to the bottom\n\n[Outro: Meek Mill]\nI started with a dollar and a dream\nAnd I'm willing to go and get it by any means\nI can't be every nigga role model\nWhy nobody my role model\nI got my own son to raise\nAnd my life is very precious\nAnd my son expect me to walk through that door every night\nSo any nigga try and stop my shine gotta get it\nAll my niggas out to get it\nAnd we ain't never going back to the bottom\nNone of my niggas\nI hear everybody talking\nHe spending too much money be humble\nMan fuck all that\nWho was talking when I was dead broke starving huh?\nAy Gutta, what these niggas talking huh?\nIt's D.C. double M, G\nWe been jumped out the barrel on your crab ass niggas\nYou heard me?\nMeek Milly, real nigga for life!", "image": "https://images.genius.com/6929169de7116d41676151bdea5cc773.1000x1000x1.jpg"}], "artist": "Meek Mill"}