{"songs": [{"title": "Killafornia", "album": "Cypress Hill III: Temples of Boom", "year": "1995-10-31", "lyrics": "[B-Real]\nLiving in the city of the Scandalous\nShiesty motherfuckers, can't even trust my own brothers\nSo who can I choose to trust, me, that's who\nNiggas want a piece of the pie, fuck off and die!\nJealous, envious fools want to rush this\nLoco, trooping ass nigga with the cash, shit\nMotherfuckers just get your own, and leave mine alone\nForty-five places to get done\nSend out your invitation\nTo the party of your elimination\nI got peeps that play for keeps, (Hardball)\nNow I'm laying your ass down to sleep\nBut every hustler wanna be bawling\nBut I got the balls for the shot calling\nI pull strings, the Don King, only in America\nThen I hustle, and flex my muscle\n\n[Hustlers]\n--Yeah, man, I've been out here\nRunning game for eight years\n--I know I'm getting tired of standing\nOn this corner\n--Nigga, I want a fat pad, and fly ass pool\nFinest motherfucking bitches, jewels\nAnd all that shit, if I got to take it\nFrom a nigga\n--Shit, let him run for me then\n--I can work for myself, don't have to\nWork for nobody, I'll be my own hustler\n\n[B-real]\nWhere can I roam to get my hustle on\nKillafornia, stacking the chips, got the full clips\nLoaded and cocked, I'm used to running with the Glock\nNina Millimeter, lighting up the fucking block\nNow, who you gonna trust?, who can you trust?\nI don't know, but if you coming on my corner\nI think I'm gonna bust\nYou can't handle us, devious, dangerous\nCriminal mentality, insanity\nI move weight, from state to state\nAll the niggas moving weights, can you relate?\n\n[Hustlers]\n--Damn, what's up, I see you\nPushing that big time weight\n--I told you, I wasn't bullshitting\n--You coming up, aight!\n--When I seen you three or four\nMonths ago I told you\n--Got respect for a man now\n--Handle your shit!\n\n[B-Real]\nWhere can I choose to get my hustle on?\nIn the alleyway, lighting up all night long\nFuck working at McD's, I'm rolling with the O.Z's\nIn the QP's, puffing on trees\nWho can I trust?, who can you trust?\nNot that shady motherfucker in the city Los Scandalous\n\n[Hustlers]\n--Well, well, little man came up a little bit\n--It feels good having money in the pocket\n--Fuck that nine to five bullshit, right?\n--Yeah, kick that shit to the curb\n--But you got to look out for the scandalous motherfuckers\nCuz niggas is tricky than a motherfucker\n--Yeah, but motherfuckers got to look out for us too\nYou know what I'm saying\nI'm just as shisty as a nigga\n--Shit, set me up and niggas are gonna die\n--You get set up back, cuz we ain't having that bullshit\n--I got your back, you got mine, that goes without saying\n--Twenty-seven and mo' baby, twenty-seven and mo'\n--Let's get the fuck out of here\"", "image": "https://images.genius.com/05081a10b4aaa2a1d10f8ab1c10a10c8.1000x1000x1.jpg"}], "artist": "Cypress Hill"}