{"songs": [{"title": "Touchdown", "album": "T.I. vs T.I.P.", "year": "2007-07-03", "lyrics": "[Hook: Eminem + (T.I.)]\nWhen we touch down, (in the Midwest we okay\nE'rybody know them southern boys love that bass)\nAtlanta go bananas, Alabama, 'weesiana\nMississippi, Ten-a-keys, every muh'fuckin' state\nWhen we touch down\n(Go right from the plane to the Range)\nWhen we touch down\n(On a private plane, gettin' brains, 'til we)\nTouch down, there ain't no way to keep 'em quiet\nWith T.I. and Shady, baby\nWe 'bout to incite a riot when we touch down\n\n[Verse 1: T.I.]\nWhen we get in town, you know how we gettin' down\nPull up clean, then we hop on out\nSnatch all the freaks, then walk on out\nI'm livin' what they talking 'bout, shinin' if it dark or not\nThat one hundred E-X-double R\nYou'll find that in the parkin' lot\nYou barkin' up the wrong tree, I do this shit for zone three\nFour, five and six as well as one, Atlanta I'm forever, son\nStill be on whatever coke, ridin' blowin' heavy smoke\nAye, Em, you better tell them folk, won't hesitate to let 'em go\nThey know I put that green light on them haters\nKeep on tryin' me, I put that beam right on your tater (pow!)\nNow you don't wanna see T.I.P. outrageous\nTry to keep him in a cage, but somehow he keep escapin'\nThat's why I be on vacation, Virgin Island I be takin'\nPrivate planes out to Spain, I keep on flyin', I ain't fakin'\nThe money ain't a thang, think I'm lyin', you're mistaken\nYou can find long lines of all kinds of bitches waitin'\n\n[Hook: T.I. + (Eminem)]\nWhen we touch down, in the Midwest we okay\nE'rybody know them southern boys love that bass\n(Atlanta go bananas, Alabama, 'weesiana\nMississippi, Ten-a-keys, every muh'fuckin' state\nWhen we touch down)\nGo right from the plane to the Range\n(When we touch down)\nOn a private plane, gettin' brains, 'til we\n(Touch down, there ain't no way to keep 'em quiet\nWith T.I. and Shady, baby\nWe 'bout to incite a riot when we touch down)\n\n[Verse 2: Eminem]\nWelcome to the Midwest, yes, where them Detroit playas ball\nLike you have no idea, the boy is here\nGot the whole place looking like it's candy painted\nAin't it like we left the kids at home\nAnd just let 'em loose with the crayons?\nFuck, I just hit a jogger, people lookin' like Frogger\nThey hoppin' out of the way\nWhenever they see Marshall's car comin'\nThe kids painted my windows with black permanent marker\nAnd let the rest of the car carpet color like swirl pops\nAnd I got the bass thumpin'\nBut I'm bound to bump into somethin'\nKids are flyin' through the air lookin' like they krumpin'\nThe way they tumblin', I gotta do somethin'\nBut as soon as I hit the car wash to get the tar off\nThey just right back at it tomorrow\nThey're like, \"Dad, this is in, so you're with the trends.\"\n\"This is for the pimps\nListening to Mims, nail polish on the rims.\"\nAnd now it's custom chrome, but I gotta go do a show\nSo go on with your bad self, just have it back to normal\n\n[Hook: Eminem + (T.I.)]\nWhen I touch down, (in the Midwest we okay\nE'rybody know them southern boys love that bass)\nAtlanta go bananas, Alabama, 'weesiana\nMississippi, Ten-a-keys, every muh'fuckin' state\nWhen we touch down\n(Go right from the plane to the Range)\nWhen we touch down\n(On a private plane, gettin' brains, 'til we)\nTouch down, there ain't no way to keep 'em quiet\nWith T.I. and Shady, baby\nWe 'bout to incite a riot when we touch down\n\n[Verse 3: T.I.]\nFrom my arrival, until my departure\nGuarantee I put this d-i-c-k in somebody daughter\nAye, I still have my way with the ladies way cross the water\nFlew to Paris from Haiti, did some shit that I thought of\nIt's ironic that the shit that we poppin' makes us psychotic\nThen treaten corporate America\nThat's why they runnin' from me\nHow could they be so ignorant?\nLook what hip-hop done brung us!\nIt's allowed us to run a business, legitimated our moneys\nGot us out of the ghettos and relocated our mommies\nI made it all the way here, ain't no way you takin' it from me\nSo excuse me, Oprah, honey, I'm sorry, really I promise\nBut niggas, bitches and hoes do exist, I'm just bein' honest\nFor that am I being punished? Why is you so astonished?\nNow, I ain't got a degree, just intelligence in abundance\nSo you ain't gotta like me, I know billions of folks who love me\nYou can tell how they yellin' and screamin' and waiting for me\n\n[Hook: T.I. + (Eminem)]\nWhen we touch down, in the Midwest we okay\nE'rybody know them southern boys love that bass\n(Atlanta go bananas, Alabama, 'weesiana\nMississippi, Ten-a-keys, every muh'fuckin' state\nWhen we touch down)\nGo right from the plane to the Range\n(When we touch down)\nOn a private plane, gettin' brains, 'til we\n(Touch down, there ain't no way to keep 'em quiet\nWith T.I. and Shady, baby\nWe 'bout to incite a riot when we touch down)", "image": "https://images.genius.com/2f70d0ed3d87a3cc476cfb530ff86686.600x600x1.jpg"}], "artist": "T.I."}