{"songs": [{"title": "Strangeulation Vol. II Cypher III", "album": "Strangeulation Vol. II", "year": "2015-11-20", "lyrics": "[Produced by Seven]\n\n[Intro: Tech N9ne]\nI'm proud to present this cypher to my technicians, 'cause this one has been a long time coming\nSo I called on my big homie Big Scoob, and my lil' homie; JL B. Hood\nLet's go\n\n[Verse 1: Big Scoob]\nYeah, aha, Big Fella\nBack pushin' that trap shit to your tracklist\nTecca N9na's new package, Big Fella gon' snap bitch\nWhip game, I'm magic, front flips, no backflips\nIll eatin' old passed whips, looky here, these facts, bitch (yeah!)\nBig Fella y'all know me man, show me, homie, I'm still the same\nI'm a little older got a little colder, I'm still a soldier, I'm blowing flames\nTime to get, what's happening blood?\nThis don't get it I'm acting up\nY'all ain’t wit it, then I'ma go get it and ship it in, in the back of the bus\nNah, I'm just fuckin' with it, bickin' back and having fun\nBullshit I'm having none, pussy niggas best hold their tongue\nFlip a switch and I'm with the shit get to clapping clips and I'm banging drums\nIgnorant with this ignant shit and my only wish is you come get some!\n\n[Verse 2: JL of B. Hood]\nI told you bitches where the fuck I'm from\nShowed you this is where the luck might run\nOut for the doubt, what you do with yo mouth about to be part of the reason I come and bust my gun!\nFinicky front wanna be just like them\nNigga's a bore, be hunted just like one\nThis no war nor kid time son\nIt's a warning, do nothing dumb\nYou can feel what it is when exposed to the G's\nA real one exists this close to the lead\nGet ahold of the disk you suppose to believe\nThe show is a trip and the flow's a disease\nCoke gotta fizz, got zones of the trees\nNever let 'em live, let alone let 'em breathe\nNot a fuck I could give, like \"fucks? What are these?\"\nPros we official, the hoes Lebanese\nStrange got the game in a guillotine choke\nLanguage aimed seen finna be quo-\n-Ted, know it ain't my enemy hope\nSwank if you can't consider me dope\nYa skank wanna grope me and Joey Cool both\nOn the bull with a 7, no Tony Kukoč\nBitch check into whenever you post\nThey come out the wood works know whenever you close\nYou know what I'm yellin' know somebody better tell 'em\nHard head make a soft ass lemme get 'em\nUp in art class was the only time you drew a weapon\nUp the bar blur lines I'm a urban legend\nNo T.I. TMI but I'm fuckin' with protection\nPaper work in red like I'm makin' a correction\nSelect what I said hope you makin' the connection\nWe come at a nigga head it come off him in a second\nMe and Tech got high said we finna do work\nSpat hot lava, finna shoot first\nYou expect not vibe I could only do church\nIf my nigga was alive I am in the booth hurt!\nKnow that I'mma ride, while I tell 'em B. Hood\nYou would look odd in my neck of the woods\nIf I really wanna slide in your ho I could\nBut I'm God with a double O, y'all know I'm good!\nStep like I should!\n\n[Outro: Tech N9ne]\nI steps like a real should\nPapered but still hood, we whip it and feel good\nAyy, we makin' your bitches feel good\nYanked it and still could, we whip it and feel good\nI steps like a real should\nPapered but still hood, we whip it and feel good\nAyy, we makin' your bitches feel good\nYanked it and still could, we whip it and feel good", "image": "https://images.genius.com/d6abef8fbc863a78647f5e7bfd58bbe7.500x500x1.jpg"}], "artist": "Tech N9ne"}