{"songs": [{"title": "What It Is", "album": "Urban Ammo 2", "year": "2001-01-01", "lyrics": "[Verse 1: Xzibit]\nGet down, turn around, show me what you got\nYou a pow-pow, Juggernaut, take it up a notch\nOh my god, wow, take 'em out, let me take a shot\nI'mma sit down, get a drink, let you work it out\nStep back, I can nearly put it in your mouth\nHave a cocktail, never fail, turn your body out\nWe can set sail, overseas, you cannot pronounce\nAll the places you will see, currency amounts\nFluctuating, better learn, quickly how to count\nWe can pass out, wake up, make another drop\nGot a pornstar appetite, get it while it's hot\nHow you ticking like a clock, tie your panties in a knot\nLet me crush that, rush that, let me come again\nIt's a must that I touch that, where do I begin?\nIn the back? In the front? Damn, show me what it is\nFast lane, with a fast dame, only way to live\n\n[Hook x2]\nStrip down, turn around\nShow me what it is\nStrip down, turn around\nShow me what it is\nStrip down, turn around\nShow me what it is\nShow me what it is\nShow me what it is\n\n[Verse 2: Young De]\nYou a bad chick, you deserve every single dollar\nAnd your assets make me wanna come and do the honors\nForecast says, you gon' have some money raining on you\nWith the chance that it's gonna last all the way until tomorrow\nCash-in, go and put a price tag on it\nCause your ass, I could probably fit a mic stand on it\nRefrigerator, or mattress and a nightstand on it\nMake a nigga wanna go take a loan, finna own it\nYou flaunt it, can't lie about that\nWhen you're lying down flat and you're arching up your back\nCrazy, face, crazy, taste, crazy, I save you\nPractice making babies, maybe\nI'm getting a lil' ahead of myself\nBut I know I put it down better than anyone else, does\nBut this ain't about love, this about\nTwo pills, a bottle of champagne and a hot tub\n\n[Hook x2]\nStrip down, turn around\nShow me what it is\nStrip down, turn around\nShow me what it is\nStrip down, turn around\nShow me what it is\nShow me what it is\nShow me what it is", "image": "https://images.genius.com/02f6f533db876d1f1282da66cbe1189d.500x500x1.jpg"}], "artist": "Xzibit"}