{"songs": [{"title": "Troublemakers", "album": "Apollo Kids", "year": "2010-12-21", "lyrics": "[Intro: Raekwon]\nFor real? Can I get a juice, lord?\nYeah, yeah... yeah, squad niggas boy, for real\nUh-huh, forreal, man, word, open the door, man\nHustle flow shit, yeah, aiyo, pass the cigar, lord\nCome on, man, stop playing, man\n\n[Verse 1: Raekwon]\nWe in the cabin playing backgammon, gorilla monster slammers\nBrothers hire us, try us you gon' die, son\nGreen medicine, blow veterans\nRun in Adidas store, six more velours, drawers feather skin\nHaircutted up, hollering, seven through three sixes\nNo, we ain't the devil, where ya llama, dick?\nCan't stand the other side, niggas know we rich, we color guys\nLoose up your mother, true lullabies\nGangsta ever readies, take off my shirt, no batteries, nigga\nJust one mean magnum killer\nSnowmobiles jetting out the Timber, feel Chef altitude\nYo, I can't breathe, check the splendor\nBrazilian honey dip, I'm on my rifle day, nigga\nTimes is roughing, Timberland cuffing\nOne knee up, G up all the re-up\nHope we can pull it back, my throat my only weapon\nBlow the beat up\n\n[Verse 2: Ghostface Killah]\nStuff Brillo pads in the rat holes, reduce that faggot-ass nigga\nWho wanna jump like a frog to a tadpole\nGag it up, sliding through the ER, batted up\nA tube in your dick, you can't piss when standing up\nHands is shaking, doctors is taken to operating\n\"Nah, he might not live!\" So they start debating\nYou in bad shape, in the neck of New York\nYour slithering ways, lay with you a bad snake\nSmash bake, eight stab holes in your shoulder blades\nYou wilding on the stretcher and shit, they trynna hold your legs\nNah don't hold his legs, tell that bitch ass nigga to chill\nPut something in his meat like bolognese\nGot gophers that sleep in the woods, Carhartt down\nPadlock your bow-legged spot, where your rocks now?\nYou ain't moving no crack, you'se a moving ass rat\nAfter you lay up in that morgue, I'ma fuck your back\nYeah, nigga, die slow with your smirk on\nNight-night lights, dim it down, get your mirk on\nLater I see you in hell, get your burn on\nFilled with embalming fluid, get your sherm on\n\n[Verse 3: Redman]\nMy sherm on in the hood when I ride by\nMy eyes looking like I learned how to skydive\nThe world is yours, there's rules you abide by\nRide with the fly guy on I-95\nThey said a nigga return, but I never left\nI told Big L through me, he could resurrect\nI'm that nigga like Puff in L-O-X\nI took one L and life is still Double X\nBrick City where I breathe all the trees at\nThe E's in M&M's, I need a Relapse\nAnd bitches, grab my mic, give me feedback\nReggie you an asshole, baby I be that\nYeah, I get cocky when the beat pumping\nYou know you doing it when your tire lip running\nI keep a freak and I call her chicken McNugget\n'Cause this Superbad nigga, she McLovin'\n\n[Verse 4: Method Man]\nFiends get killed in my hallways, we parlay\nMy feet been killing me all day\nYour boy down for lot, like them killas in RahWay\nIt's all work and no play\n'Cause this block ain't nothing like Broadway\nRevenge is sweeter than sorbet, you all become believers\nOnce this heaters in your face, just a part of my feng shui\nYa'll don't want no part of the gun spray\nI would hate to pull it and one stray\nThat's where the innocents by stand\nWe trapped inside these tenements like damn\nWhy mama tryna feed us this spiced ham?\nConnects trynna cheat us with light grams\nCo-defendants try to lighten they sentence\nSnitching to white man\nTurned state evidence, fam, we ain't jellin'\nFelons ain't felons no more, they straight tellin'\nAin't nothing worse than a rat, you can't smellin'\nAnd ain't nothing worse than a trap you can't sell in", "image": "https://images.genius.com/f48f03bc4acc3c9c4ddc676ddc586579.1000x1000x1.png"}], "artist": "Ghostface Killah"}