{"songs": [{"title": "Mash’s Revenge", "album": "2K8 B-Ball Zombie War", "year": "2007-10-02", "lyrics": "[Intro: MF DOOM]\nHe wants to get his girlfriend? Go get your girlfriend\nAy! And now...you is 'bout to dance, like you ain't never danced before\n\n[Verse 1: MF DOOM]\nThis one'll have you get the trash hash out the stash, as they say, \"Ash to Ash\"\nJewels free rash fools ask the mask\nNeed me? I'll be peeing in the pool, ka-splash\nYou may feel a slight drizzle\nVillain'll give a squealer a candlelight vigil\nCouldn't find a healer with a whistle and a line of sight\nAnd he hold the mic like a fistful of dynamite\nThey wonder how he built his C-note tower\nAll before zero hour it's tree grow power\nThen he go shower to scour off the funk\nAnd watch his soul call comp cower soft punk\nThe god is the oddest fella you'll find\nPaid to speak his mind like father jealous and vine\nHe came to rock the banquet, rank it\nAlong with two of the baddest broads to act stank wit, blank spit\nDilla raise the beat like a anchor banker\nOverstand (?) plays the heat\n'll shank a wanker\nDrank a tank of angst, thank ya\nGuess what? Chicken head butts\nHit a rhyme on time, I kicked him dead in the nuts\nOh, the victim had guts\nPrepare to stick 'em, I'll slick 'em in the cut\nGo. Sell a spear chucker voodoo\nGot it her off wholesale male smug lou spew\nSo. Sell a bear a truck of doodoo\nFoes go to hell in a seersucker muumuu\n\n[Verse 2: Guilty Simpson]\nDoom!\nGuilty!\nDilla, Dilla!\nGrind for the paper, hot like Sanka\nTop notch ranker, clock my banker\nDead Presidents, sick dudes - I'm the medicine\nStorming in your residence when I'm in my element\nNo contest, I get hot and go unconscious - ya boy is automatic\nNow go play in traffic, the flow is graphic\nWith no theatrics, still rock sold out shows for practice\nCall it a walk-through. Def. The wrong one to talk to\nBeef ain't nothin I can't stick a fork through\nWe break bread, eat good, and pour brew\nCheers!\nCome toast to the one with respect to the utmost on more than one coast\nGS, check the style I splash, to make the listener wanna pile my cash\nKing of the Hill, money is the issue\nIt's all on me tell 'em bring me the bill\nDaddy Warbucks, shift gears in the armored truck\nLike Big Daddy Kane when I warm it up\nFans scream for the two man team\nDoom and Guilty - Hip Hop supreme\nThe denim is blue but the pockets green\nBig knots in jeans, you can't stop the kings", "image": "https://images.genius.com/47a31a2c8f56a19cc37329265ec60d83.600x600x1.jpg"}], "artist": "MF DOOM"}