{"songs": [{"title": "She’s My Hero", "album": "Radio Silence", "year": "2017-08-28", "lyrics": "[Intro]\nWe do it for the babies\nThey say falling in love the definition of going crazy\nThe knowledge that makes us just cherish innocence makes it impossible\nHe heading for the graves, drivin' right past the hospital\n\n[Hook]\nThere be glass in the hallway, bloodstained floors\n(Yeah) Woo! Move, motherfucker\nI like that one (go in!)\nC'mon\n\n[Verse 1]\nThey say karma is a bitch and when you take a life, you pay the price\nBut if your way of life ain't been threatened and you safe at night\nHow you out here judgin' thinkin' you givin' people great advice\nWhen those who should protect you disrespect you? You can't take it light\nBresha Meadows, resemble my baby girl\n14 years old taking a place in this crazy world\nHer and her brothers lived in fear of their father's rage\nHe beat their mother so often, she prayed for the day she could be far away\nFather's Day, an awkward occasion would daddy fall from grace\nEmbrace the alcohol, call mommy a whore, put her back in her place\nWith black eyes, broken ribs, slashin' her weight\nNo speculation, just the facts of the case\nStated, allegedly wavin' a gun in her face\nAfter all that he came back, and was great, right, right?\nTired of hearin' mommy scream \"Put the gun away\"\nShe knew that when she got the courage she would run away\nBut what about her brothers? She couldn't leave her mother\nThey told the cops but all that did was make him treat 'em rougher\nSo what was she to do? She did what she was told to do\nExposure to violence increased the amount of violence that you open to\nWhy bother when the system support her father?\nGradually her thoughts got darker\nDo you kill yourself or kill the monster that's making you suicidal?\nDecision's too heavy for the mind of a child\n\n[Hook]\nThere'll be glass in the hallway, bloodstained floors\n(Yeah) Woo! Move, motherfucker\nYeah, I like that one (go in!)\nLet's go\n\n[Verse 2]\nThey say karma is a bitch and when you take a life, you pay the price\nWe shootin' in these moments to confuse your violence with a way of life\nThe funnel us from schools to the prisons, it's like they made a pipe\nThe conclusion that we reach is that the solution is that we take the fight\nTo you, Bresha Meadows, took matters in her own hands\n14 years old with more courage than a grown man\nGrabbed the gun that he threatened to whip\nCrept in the bedroom, put the bullet in his brain while he slept\nIt left his daughter with post-traumatic stress disorder\nShe the phoenix out the flames, it's metamorphosis\nSurvivin' in the Meadows house was kinda like a war\nHe threatened to kill her mother and her brothers many times before\nThe justice system is profit, they shuffle us to prison\nBut shit is just as toxic for women to get a judge to listen\nAt first the family freaked out but deep down they felt relief\n\"Wipe the tears from your cheek, mama, you free now\"\nFamily wearin' purple in the court room\nProsecution lookin' at the feds like make your move\nChance of beatin' this murder feel like zero\nHer mama doin' interviews like \"She's my hero\"\nShe shed no tears for her husband\nYears to succumbin' to her fears have made her numb\nFrom video games to war as we solve our problems with violence\nIt's how we speak, they either want your death or your silence", "image": "https://images.genius.com/01888ca6f4a6ac4900fbc379ca2d8c7b.500x500x1.jpg"}], "artist": "Talib Kweli"}