{"songs": [{"title": "Shakey Dog Starring Lolita", "album": "The Big Doe Rehab", "year": "2007-12-04", "lyrics": "[Ghostface Killah]\nI had my eyes squinched up tryin' to get through the fog\nPullin' up mad slow blunted, passin' police cars\nI saw one two three bodies\nBlood mixed with the rain ran through the gutter\nThat's the work of a tommy\nBut then I heard it was the work of a mami\nSpanish chick bad, about five six, long hair, red Jag\nKinda bowlegged, Chanel sweatpants, she thick\nShe love her some pussy, don't really give a fuck about dick\nThat's when I got the call, yo Tone come to the shop\nSome fire jumped, chill I'm about to pull in the lot\nLowered the tunes, pulled the Benz keys out the ignition\nBrushed the ashes off my blazer then finished my Guinness\nSo then I walked in, seen the God shufflin' cards\nSpades game, it's goin' down, he lost a couple of yards\nPeace Lord, how your physical?\n\n[Raekwon]\nHe upstate miserable\nStressed, doin' a thousand sets\nBut yo check the visuals\nI'm at this hotel in Queens\nMe and Charene getting' slow necked\nThat's live, I couldn't finish the bean\nGotta a phone call, seen the whole bitch face fall\nDope fiend look like the bitch swallowed an eight ball\nThey talkin' about killin' ya man's and them\nThat kid from Staten, his jewels is tough, his robes is satin\nYo that's my heart Tone; yea yea he killed the captain\nWhat nationality nigga? The kid was Latin\nIt happened uptown, broad day, right in Manhattan\nI was shoppin' with my home girl, Leona with acne?\nBut you know what, Flaco meets Lolita\nFlew in, she from Medellin, he deaded her uncle over them seventeen bricks\nNiggas ain't slick, niggas is dicks\nY'all got beef for life now cause that bitch is a trick\n\n[Ghostface Killah]\nAy yo fuck that, close the gate\n\n[Raekwon]\nAnd lower the shade\nThen a shot popped off\n\n[Ghostface Killah]\nHit lil' bro in his fade\nAnd then I see him dropped his clippers\n\n[Raekwon]\nHe dipped with the quickness\nIt was Lolita black down yo\n\n[Ghostface Killah]\nWith four other bitches\nHe had a nasty hammer, fat ass\n\n[Raekwon]\nHer tits was bananas\nYo the clip was ninety shot\n\n[Ghostface Killah]\nShe lit up the cameras\nSo then I bugged out, ran up the steps\n\n[Raekwon]\nYo I got hit in the leg\n\n[Ghostface Killah]\nHe shot back, hit one bitch in her breast\nUnder the pinball game aimin'\n\n[Raekwon]\nIt's foggy and rainin'\n\n[Ghostface Killah]\nMy jewels is clangin'\n\n[Raekwon]\nYo Tone tuck your chain in\nShe shootin' like she wanted a payment\nThrowin' bullets like Joe Nameth, yellin'\n\n[Ghostface Killah]\nYo it's all entertainment\nWhere y'all girls at? Where ya'll pussies at?\nThought y'all bang on Gaten Island?\nI killed three things on Staten Island\n\n(Guns firing)\nTake that!\nYou fuckin' with me huh?!\nThat's all you got babyyyyyy?\nHold that! Motherfuckaaaaa!\nYea! You on Staten Island now nigga!\n\n[Ghostface Killah]\nNow where the fuck is your brain at now ho?\nYou fuckin' with me, brains is all over the wall like Velcro\nI fuck your pussy while you die slow\nWake up! You cock suckin' ass maricon\n\nThat's what you get for killin' Frankie\n\n(Police loudspeaker)\nTony Starks, Tony Starks drop you weapons now\nPut your weapons down or we will shoot\n\nAy yo Rae I got this\nI ain't surrenderin', they gon hang me\nYou know what it do, yo I love you\nSay peace to my kids, say peace to my wiz\nI ain't goin' to jail\nFuck it's on G, let's get...FUCK Y'ALL NIGGAS!", "image": "https://images.genius.com/f1bbc70540da138c70debc041f381d0f.1000x1000x1.jpg"}], "artist": "Ghostface Killah"}