{"songs": [{"title": "Pimp Like Me", "album": "Devils Night", "year": "2001-06-19", "lyrics": "[Eminem]\nG-SHIT\n\n[Bizarre]\nWhattup\nI gotta tell you motherfuckers the truth\nThis is straight G shit\nAnd all you can do is respect it\n\n[Verse 1: Swift]\nWell I'mma state my name, Swift McVay\nNone of y'all niggas got shit to say\nRhymes keep coming off like a toupee\nPlus I'm big headed running things my way\nA selfish man, the back of the hand\nBe slapping the hell out of hoes because I can\nProstitute, I want my loot\nAnd I don't give a fuck about your broke-ass man and\nY'all giving niggas what they needing\n'til bitches understand I'm mean and\nSwift McVay is, blowing up\nCourvosier 'til I'm throwing up\nWanna playa hate me, bitch so what?\nWhat's yo' function? Where's yo' bucks?\nAll you wanna do is wanna stick him up\nYou wanna rob me but I got too much (hah)\nD12, naturally lifted\nYou niggas better duck when I cock the biscuit\nYou fuck wit me, I fuck wit you\nYour entourage, nigga fuck them too\nI got grenades\nWhat the hell your little twenty-two gon' do?\n(Y'all ain't gon' shoot)\nY'all major soft\nCops getting mad cause I paid 'em off, made 'em cough\nBlood and shit\nThat's what the hell you motherfuckers get, we runs this bitch?\nSo hey, you ain't gotta be scared to fuck\nIf you want head, then prepare to suck (do it)\nEven if the nigga don't care to nut\nFor every stroke, it's a hundred bucks\nRespect the game, you just a slut\nSo open your legs up and get my duck\n\n[Hook: Eminem (Dina Rae)]\nYou just a .. (ho)\nYou just my .. (ho)\nDirty-ass .. (ho)\nI'm yo' pimp, you my bitch\n\nGo get my .. (dough)\nGo bring me my .. (dough)\nDirty-ass .. (ho)\nI'm yo' pimp, you my bitch\n\n[Verse 2: Proof]\nI don't spit game, no longer than my name\nThe way my chain hang, my nuts do the same\nDon't pay pussy, pussy pay me\nBitch, slut, whore or lady (yup)\nAnd knowing the fact, I was born to mack\nThat's why I got a ho in the back, blowing my sac\nGot good game, that's a hood thang\nWhat'd you brang, loot or poo-tang?\nLet 'em all bang, run that cheese\nTell that trick nigga (come back please!)\nRob a L7, that's a square\nYou a bottom ho, you got to know\nOff you I plan to make a lot of dough\nSo suck fast bitch, and swallow slow\n{​​*swish-slap-swish*}​​ (AH!) Bitch quit talking back\n{​​*swish-slap-swish*}​​ (AH!) Now walk the track\n\n[Verse 3: Kon Artis]\nI don't pay for ass, you pump my gas\nYou get slapped when we're short of cash\nI get whiplash when I hit the gas\nAnd I holla out the window of the hatch\nWhere's my scratch? Bitch, that's, it\nSuck it stroke it make me rich\nAs a token of my appreciation it's\nAnother client for you to hit\nI don't give a fuck if you gotta go home to the kids\nYou shoulda picked another occupation, trick\nNow you're stuck with me, fuck with me\nAnd I'mma slap you up in this truck\nYou must be out your mind or something\nCrying and whining like you tired or something\nGo suck some head until it aches for buffering\nYou don't work? You make nothing\nI'm just another case of a lazy husband\n\n[Verse 4: Kuniva]\nI want the paper stack\nBuy you an outfit, then take it back\nWhen you page me, bitch, I never page you back\nYou only act a certain way that I make you act (whattup)\nHoes recognize, and niggas do too\nCause they realize that niggas do shoot\nDon't like a chick that act too cute\nBitch hold my gat down when I shoot hoop (oh yeah)\nAnd don't be asking me, all kind of questions\nAll harassing me, calling stressing\nOr I may have to release some aggression\nBeat you to death and teach you a lesson\nLooking for handouts like you my damn spouse\nPull your pants down and fuck my mans now\nShut your damn mouth or get in the damn house\nOff with the damn blouse and suck on my damn crotch\n\n[Hook]\nYou just a .. (ho)\nYou just my .. (ho)\nDirty-ass .. (ho)\nI'm yo' pimp, you my bitch\nGo get my .. (dough)\nGo bring me my .. (dough)\nDirty-ass .. (ho)\nI'm yo' pimp, you my bitch\n\n[Verse 5: Bizarre]\nSell that pussy\nSell that pussy, bitch\nGet out there and switch and go make Bizarre rich\nYou gotta itch, you fucking dirty bitch\nNow get on the corner, and start sucking some dicks\nNiggas want pussy, and I need cash\nSo mom, get out there and start selling yo' dirty ass\nBizarre quick to hit 'em, and then stick 'em\nFuck it; I'll let you hear one of my victims:\n(\"Somebody help! I'm on 7 Mile and...\")\nShut up bitch, you talk too much!\nNow you about to get fucked in your dirty butt!\nYou never seen a pimp like me, out here whoring\nShut your fucking mouth and you'll be out by the morning\nCause I'm the dirtiest pimp, you ever heard of\nGive me my five-thousand, and take this cheeseburger (bitch!)\nGo suck dick at a bachelor party\nSo what if you on your period? blood never hurt nobody\n\n[Hook]\nYou just a .. (ho)\nYou just my .. (ho)\nDirty-ass .. (ho)\nI'm yo' pimp, you my bitch\nGo get my .. (dough)\nGo bring me my .. (dough)\nDirty-ass .. (ho)\nI'm yo' pimp, you my bitch\n\n[Eminem (Dina Rae)]\nYou just a .. (ho)\nYou just a .. (ho)\nThat's all you is .. (ho, ho, ho)\nYou just a, dirty ass bitch\nA dirty ass, nasty ass, stinky ass, filthy ass, stanky ass bitch\n(Oooh, ooh-OOOH) Hahahahaha... (lahhh-aHHH)\nBut I love you... (hahaha) .. Kim (mmm)\n\n[Outro: Rondelle Beene]\nAnd there you have it god damnit, the fundamentals of pimping\nYou heard it here first, from the Dirtiest Dozen\nYou ever seen in yo' god damn life\nYo this is Rondell Beene on the scene\nAnd we keep the pussyholes smiling, because we always wilding\nYouknowhatI'msayin? Fuck all what everybody else talking about\nWe let you know right here\nBig pimping, it ain't dead, we love getting head, in a dirty-ass bed\nThat's just what we do\nYou know we was throwing heroin pimp parties back in 1968\nThe pussy is all great\nI'll see you at eight, bitch", "image": "https://images.genius.com/591360993ef93e1c0a2402279fb90319.600x600x1.jpg"}], "artist": "D12"}