{"songs": [{"title": "About All That", "album": "Like Father, Like Son ", "year": "2006-10-31", "lyrics": "[Verse 1 - Lil Wayne]\nYoung desperado, straight out the grotto\nI'm so bad, my shadow chooses not to follow\nLittle nigga, but see me as a fuckin' rhino\nLil Weezy hit this bitch like Rocky Marciano\nIt's a drought ain't it? How the fuck would I know?\nNigga, I've been getting my share in like Sonny Bono\nI ran the streets... check my bio\nI started high with two O's just like Ohio\nI'm fuckin' nuts; cashews\nBut I'm so DC like fat shoes\nI skate away, like \"Later dudes\"\nNever get caught, baby, I'm mashed potato smooth\nAnd just when it stopped, I made it move\nRespect me nigga I'm a dog; no Asian food\nI wet up the party, so have a bathin' suit\nAnd daisy dukes you bitch ass nigga\n\n[Hook - Lil Wayne]\nKeep talking that shit that you talking\nAnd we gone have to get into some gangsta shit\nMy nigga... keep talking that shit that you talking\nAnd we gone have to get into some gangsta shit\nMy nigga... Cause you ain't really even 'bout all that\nYou ain't really even 'bout all that\nAnd don't you forget.. I know ya, you ain't 'bout all that\nYou ain't never been about all that... fall back\n\n[Verse 2 - Fat Joe]\nNiggas must want Joey to lean on 'em\nFlash the binky, splash his dreams on 'em\nLet 'em sleep on it, it's nothing to Crack\nLay the murder game down back to hustlin' packs\nYeah Weezy homie's got your back, whether raps or macks\nEither way they both spit like BRRRRAT!\nNigga... them muhfuckas is broke like them levees\nAnd we done sold so much dope ain't shit you tell me\nNigga... how you want it huh coke or dog food?\nMy shit'll have you running naked like an old school\nAnd yeah we 'bout it 'bout it, and you ain't ridin' on me\nUnless ya got a whole fuckin' suicidal army\nAnd I'm a rider homie, and you can find it on me\nThat 40 cal'll get your shirt picture ironed on it\nThis shit is funny to me\nAll these niggas wanting war but they runnin' from me... Crack!\n\n[Hook - Lil Wayne]\n\n[Verse 3 - Birdman]\nI had 'em as lil' niggas, raised 'em 'round real niggas\nPoppin' bottles fuckin' with them bitches nigga\nMade money to the ceiling, me and my young nigga chilling\nI'm in the streets, hustling, getting money nigga\nChanged all my new shoes nigga, got some new tools\nNigga got some more jewels, we was getting money\nAnd ain't nothing ever changed, still doing the thang\nStill getting money, still spending change\nWe hustling from Sunday to Sunday\nAnd we grinding everyday like the money ain't coming\nNigga... yeah we riding woodgrains and minks\nGot the dope in the Hummer cold case for that thing\nI hate the law for what they done did they broke in niggas cribs\nWish I woulda caught 'em Idda split they fuckin' wig\n3rd Ward let me claim my fame\nI put it down, Uptown, I'mma do my thang believe that\n\n[Hook - Lil Wayne]", "image": "https://images.genius.com/e9aedf71f8ff6f2204602bdff4425bb5.635x635x1.png"}], "artist": "Lil Wayne"}