{"songs": [{"title": "Lil Ghetto Nigga", "album": "The Come Up Vol. 1 Mixtape", "year": "2007-05-04", "lyrics": "[Intro]\nYeah, uh\nUh, yea\nYea, uh\nFayettenam, nigga\nHahaah uh\nCarolina, nigga\nYeah, Yea, let's bring it in\nYea, this is for my niggas in the struggle\nYea, this is for my niggas in the struggle\nUh, uh, uh\nNothing but sweat, tears\nJust another perspective\nYeah\n\n[Verse 1]\nYo, uh\nLifestyles of the young, black and genius\nSons strapped with guns packed in jeans\nAnd the blunts got my lungs black as Jesus, (yea)\nPlay where killers hung at and slung crack for leisure\nAnd tell a nigga run that get gun clap for sneakers\nYoung niggas emulate what's coming out the speakers\nSo everything we learn came from rappers, not teachers\nCause if we can't relate, then how the hell you gonna reach us?\nSurrounded by crooked cops and preachers, (yea) Who am I trusting?\nNo time to think about illegal when your stomachs touching\nBy any means, nigga, even if the gun is busting\nI see the world for what it is now\nI see the odds is looking slim for our kids now\nCause, uh, it wasn't set up for my people to rise, (yea)\nMy niggas slang, but I see the pain deep in they eyes\nNiggas living like they don't give a fuck\nAnd I don't blame 'em, it's a cold world, live it up! (live it up)\n\n[Hook]\nThe things that I've seen, (seen)\nThe dreams that I dream, (dream)\nThe rain in my sky\nThe pain in my eyes\nBut know that it gets better baby\nHope that it gets better baby\nDon't let this world break you, (you) naw, naw\nDon't let them break you, (you)\n\n[Verse 2]\nYea, uh\nI look up in the sky, see that ghetto bird circling\nAnd rollers on the block, my niggas on the curb, cursing them, (fuck)\nAnother day in the ville, do I stay in and chill? (no)\nOr go play in the field?\nHelp my mother paying these bills, you tell me, nigga!\nWe young, black, some strapped\nThem whites got they lunch pack for school, we had our guns packed\nAnd all a nigga wanna do is take his momma from that\nBut they'd rather lock us up and make sure we don't come back\nYou kill a nigga over beef and cheddar even better\nJust one less coon they won't have to arrest soon\nFuck a crooked cop three times\nBitch, I'm getting cake and ain't a nigga finna eat mine\nThat's why a nigga looking like a street sign, (yea)\nPosted on the corner 'til it's sleep time\nWake up and it's feeling like somebody hit the rewind, (why)\nCause them ghetto birds circulate, my niggas still cursin em\nAnother day in the city, my niggas say it with me, yea!\n\n[Hook]\nThe things that I've seen, (seen)\nThe dreams that I dream, (dream)\nThe rain in my sky\nThe pain in my eyes\nBut know that it gets better baby\nHope that it get better baby\nDon't let this world break you, (you) naw, naw\nDon't let them break you, (you)", "image": "https://images.genius.com/bda451f623edd51bf1dcc17564bd3e70.501x501x1.jpg"}], "artist": "J. Cole"}