{"songs": [{"title": "Moscato", "album": "Longterm Mentality", "year": "2011-04-05", "lyrics": "[Intro]\nYou got—you got some more moscato?\n\n[Verse 1: Ab Soul]\nYeah, she's a mean girl, I'm a nice guy\nWe all know opposite attract, like a rail road, and I like\nYou to do anything you please when you're with me, momma\nLet's head home, crack a bottle of the Sutter Homes\nAnd hit some trees, why not?\nWhere your head at?\nHope it's in the gutter like mine, not where you find rats\nTalking 'bout where you find ecstasy\nCome on have a little bit of sex with me\nCan I hit it in the morning, 'til the sun has fallen\nLike a new born, baby you stallin'\nYou know you want all this long dick\nOh shit, might want to make you my misses like I lost it\nPeek-a-boo\nLady your smile light up the room, Pikachu\nYou could put a nigga in a tomb (one) peek-at-you\nLet's pop this cork, let me rub on your neck\n'Til Victoria's secret get all wet\nAnd Victoria's secret safe with me\nLet Victoria's secret leave your legs\nI know you had a hard day, baby, relax your mind\nShit, soon as Christ turned water into wine, everything was fine\n\n[Chorus]\nWhen things get hard to swallow, we need a bottle of Moscato\nPuts me in the mood for your loving, you love it\nWe can even do it tomorrow, just bring a bottle of Moscato\n(Haha, I know we said P&P Baby)\nPuts me in the mood for your loving\n(But now we on something new)\nYou love it\n\n[Verse 2: Kendrick Lamar]\nGuess whose back in this motherfucka\nLooking like a motherfuckin' Chi-town pimp, alright\nMake my money flip, make my money flip\nMake my money flip, I been in the gym all night\nCame in the game with a dollar and a dream\nAnd a AK clip with an infrared beam\nI pop that trunk, make everybody scream\nPut a missing punk on everybody's screen\nAin't nothing changed but the ends I'm holding\nMy dick is big and my nuts is swollen\nI don't know if you've noticed but a nigga be rolling\nWith a bad bitch and the bitch be rolling\nDolphin pills and Moscato spills\nEverything she need to get her thrill\nNo Hennessy on the bartender bill\nJust good wine and a good place to chill\nI feel I might get loose tonight and fuck your girlfriend\nI mean I feel she might come through tonight, plus her girlfriend\nIn a 5-Star suite with a 5-Star freak\nSlinging that dick while baby eat\nOn her punani, ooh mommys, look at yours bodies, I'm geeked\nHaving a good time\nPut my pain in a mothafuckin' bottle\nA chain and a diamond ring don't feel the same\nIf a nigga ain't got his eyes closed (eyes closed)\nI know you had a hard day baby, relax your mind\nShit, soon as Christ turned water into wine everything was fine\n\n[Chorus]\nWhen things get hard to swallow, we need a bottle of Moscato\nPuts me in the mood for your loving, you love it\nWe can even do it tomorrow, just bring a bottle of Moscato\n(Haha, I know we said P&P Baby)\nPuts me in the mood for your loving\n(But now we on something new)\nYou love it\n\n[Bridge: Ab Soul]\nI said, it's a celebration, clap clap bravo\nLobster and shrimp with a glass of Moscato\nWhat up ho, what up?\nI said what up ho, what up?\nI said, it's a celebration, clap clap bravo\nLobster and shrimp with a glass of Moscato\nWhat up ho, what up?\nI said what up ho, what up?\n\n[Outro]\nSip slow\nRelaxation\nThat's our motto\nSoul", "image": "https://images.genius.com/f5819f76daf2dbaa35f05a7775126bfc.500x500x1.jpg"}], "artist": "Ab-Soul"}