{"songs": [{"title": "The Table", "album": "Immobilarity", "year": "1999-11-16", "lyrics": "[Intro: Raekwon (Masta Killa)]\nMoët got me acting like a fucking goat in here\nYo god, remember back in the days god?\nWhen we came a long way and shit, man (no question)\nWe supposed to be blessing each other\nOn our physical days and shit, you know what I'm saying?\nIt's like basically, I wanna hit my family with like land and all that\nDiamonds and all that, we ran through that chamber dun\n\n[Verse 1: Raekwon]\nMainly stack mine, indeed it's been a long time\nLet me feed y'all, fruits of life, shut up and eat y'all\nFlavors for neighbors, Wallee's down to gators\nThe whole configuration stacking paper\nYo we do this, on the low though\nIf so, we running John Dolo\nFirst thing, you need if you don't know\nWe carry cause it's a real world, show and prove\nIn ill words, all my herbs know the slurge\nDress nasty like fuck, keep my bird on the job yo\nYou got to straighten up\nDo the worst thing to hurt her heart, damn\nTook care of that, shared, even shed a tear for that\nBust my gat to throw gear on her back\nDamn son, why she taking you through that?\nShe's a part of me, pardon me flow Allah, we sworn we\nWising up, take care of home bases\nThen we slide to another part and start more hatred\nLife is sacred - the other side of that paw, you lie naked\nClothes in the box, go 'head take it\nFlash back Jew status\nSalute moms and get ya boots splattered\nBatting average, your moms had it\nJust a broke young dumb, full of cum ready to haunt something\nTakes something of yours, here you want something\nGrowing up around fifteen\nWatching how the big niggas rolling wit big cream\nBig schemes\nQuick to flash your gat, laser beam\nPool table action black, hundred stacks made my niggas leave\nSome be saying \"Let em breathe\"\nThe others wanna deceive\nHow we gonna make it if we don't achieve?\nRight now, catch it from a vertical degree yo\nWe starting showing our asses, committing burglaries\nOne got caught, threw us all off\nThrew us in the hell section near the boardwalk\nWondering how the sword talk, did he fall off?\nDid he stand like the hawk that he was in New York?\nKept the waves spinning on the cross, of course\nCome back a little cutty endorse\nRisked it for his kids the pain is lost\nWe sitting back on a better note, yelling \"Peace god\nI love you love you to death, you thoroughbredable\"\nThe Robbin Hood of the hood\nSit back, it's all good\nWon't spoil it if we call it, we all hood, ha ha\n\n[Interlude: Masta Killa]\nI make knowledge born to save self, you know?\nWho gon' live it, gon' live it\nBe is to be a born, know what I mean?\n\n[Verse 2: Masta Killa]\nSoaked in degrees of knowledge, polished by sun rays\nCarving by nine swordsmen\nTo a needle point of perfection\nIt's a blessing to deliver this lesson\nWhile traveling the planet, extending development\nAnd vote for the mind\nNever ended we now send it long-winded\nDescended infital, Bobby Digital\nAbbot of the Shaolin 'Isle\nWhere knowledge and wisdom\nOf the original sword style begin\nBirth of the Wu-Tang Clan", "image": "https://images.genius.com/d8508796401925d32124cc47a45641d8.500x500x1.jpg"}], "artist": "Raekwon"}