{"songs": [{"title": "Penitentiary", "album": "Only Built 4 Cuban Linx... Pt. II", "year": "2009-09-08", "lyrics": "[Intro: Raekwon]\nCome here, pussy, prosthetic hard ass nigga\nYo, where them Levi's that I left on ya bunk, nigga?\nDon't stand on the side of this bunk no more, man, for real\nYou see them Rae and Ghost flicks over there, nigga?\nDon't touch them shits, nigga\nWord up, I'ma break both chains on ya ass, nigga\n\n[Intro 2: Ghostface Killah & Bundy]\nEh-yo, Bundy, make sure you crack cell number five, fifteen minutes early\nYeah, yo, I got you, you want some of these donuts?\nNah, I'm good, just make sure you handle my man right, one\n\n[Verse 1: Raekwon & Ghostface Killah]\nWe up at three mart, blowing, little dust to lift the branch up\nThe watch he had was Bulgari, golden, Spanish kid let him hold it\nHe said he hit him with three cartons of menthol, the kid let him roll with it\nThe face had snow in it, the bass in his voice\nNow he's acting like he ain't rich and po' in it\nCrock pots are steaming, Jasmine rice and Jack Mack\nWith cornflake batter, it's cold in here\n10:45 we lock in, pull out the headphones, jump in the bunk\nThe tunes is knocking, knowing all my goons is clocking\nTwo C.O.'s is on the cat walk\nYo, Spoons, what's popping?, yo, it ain't nothing, baby, you cool?\nYeah, I'm getting that rest, you know that G.E.D. shit with the school?\nTrue, guess that's what it do\nBut on the low I got two big gem stars I'm sliding to you\nMatter of fact they gon' hide in ya food\nAll you do is push the grits out the way, then you get up and move\nGo to sleep, nigga, go 'head and rest, I'mma finish my count\nI'mma set you out, later my dude, one\n\n[Hook: Raekwon]\nMop wringer magic, mess hall murder's the best\nCome through the yard, getting fed lead burgers\nTesting anything with bling\nFresh sneakers, we the best teachers\nTrue, watch me move in the cling\n\n[Verse 2: Raekwon & Ghostface Killah]\nSix A.M., the cells unlock\nHorn the child, I'm half sleep, yo, hearing the pots\nI see the same ice grills, bum niggas talking to me\nWith coal in they eye, I can't finish my meal\nUnder the grits, two pieces of steel\nThen Spoon had left, we got guns though, we trying to chill\nBig Will walked in, him and Seville\nWith blood in they eyes, early bird like they ready to kill\n\n[Hook x2: Raekwon]\nMop wringer magic, mess hall murder's the best\nCome through the yard, getting fed lead burgers\nTesting anything with bling\nFresh sneakers, we the best teachers\nTrue, watch me move in the cling", "image": "https://images.genius.com/2691e582dc2839478e49279288d69cb1.1000x1000x1.jpg"}], "artist": "Raekwon"}