{"songs": [{"title": "Gossip Files", "album": "Freshmen Adjustment Vol. 1", "year": null, "lyrics": "[Hook 1]\nThey gossiping, it runs the city\nThey don't know who watchin them when they comin to get me\nSo I hit the block and bend, do about sixty\nAnd I put my Glocks to them, like blaow, blaow, blaow\n\n[Verse 1]\nI'm finna get on this TV and put shit down\nI ain't finna let these light skinned niggas come back in style\nI'm finna turn this class clown shit to crazy G's\nThey told my Momma I was bipolar, had A.D.D\nI told 'em w-what I wanna do, I wanna be a baller\nThe dream spoilers'll fool ya\nHating on you to their mans on the corners\nOld folks said he'd never make it off the corner\nThey are the virus that corrupts the soul\nThey are the cubic zirconia inside the ten-karat gold\nThat get green on you, when you get green on 'em\nYou gotta wash your hands of 'em, get clean on 'em\nSomebody told me success is the best revenge\nSo they gon' be fucked up when you do your thing on 'em\nNow hold your plaques high, like who would've thought?\nAnd tell em *ahem ahem ahem*, thank you for your no support\n\n[Hook 2]\nThey are the dream killers, they the dream killers\nWho know a dream? Uh, they are the dream (killer Norman Bates)\nThey the dream killers, they the dream killers\nDream, they are the dream (killer Norman Bates)\n\n[Verse 2]\nNow how you going to talk about the way I spend my money?\nEverybody say it with me now, it's my money\nAnd they know they hating, but what they don't know is\nThey are my motivation, they are my inspiration\n'Cause we the leaders and they the followers\nAnd we the nut busters and they the swallowers\nThey are the rumors, they are the lies\nWe are the shit, dog, and they the flies\nHow you gonna tell me how to live my life?\nAnd you can't even get your own shit tight, right?\nThey are the misery that loves company\n'Cause that comfortable corporate job can't comfort me\nTold 'em I finished school, then I started my own business\nThey said, \"Oh you graduated?\" Nah, I decided I was finished\nChasing y'all dreams and what you got planned\nNow I spit it so hot, you got tanned\nAnd they hate on your relationship then break your marriage up\nCan't kill your dreams so they assassinate your character\nDo anything to downplay you or embarrass you\nCome around with you but they ain't down with you\nThey the dream killers\n\n[Instrumental Break]\n\n(Killer Norman Bates)\n\n[Verse 3]\nAnd I'm through spitting these rappers my most heartfelt flow\n'Cause they be like, \"That's cool, you got some beats for me though?\"\nOh, I get it, you want to be Snoop and Dr. Dre\nBut don't nobody give a fuck what you got to say\nAnyway, what you finna rap about?\nYou never sold crack out your house or put a gat to a mouth\nOr put your fist to your spouse, so how you gon' move the crowd?\nI bet a thousand that you get booed out\nI even heard that they even taking wagers in jail\nThey bet ten boxes of cigarettes that I'm finna fail\nSecond you talk about peace, they gon' be like, \"Peace?\"\nThis nigga came from the Chi, moved to the East\nYou gotta kill at least one person at least\nOr we'll evict you from the rap game, cancel your lease\nHow you go to New York? What, you ain't never took a tour there?\nWhat, you ain't know you gotta be rich just to be poor there?\nThe dream killers\n\n[Hook 1]\nThey gossiping, it runs the city\nThey don't know who watchin them when they comin to get me\nSo I hit the block and bend, do about sixty\nAnd I put my Glocks to them, like blaow, blaow, blaow", "image": "https://images.genius.com/11b5c3bdc828bc9942f2c195f9ffa76c.300x300x1.jpg"}], "artist": "Kanye West"}