{"songs": [{"title": "Ryde & Roll", "album": "Same Day,  Different Shit", "year": null, "lyrics": "[Intro]\nWe roll\n\n[Verse 1]\nThrough penitentiary,this nigga is a hoe. You a straight busta. This nigga got to roll\nThis nigga got dog the shit out of my place. This nigga got the bitches. This nigga jacks ice. Me\nI'm just a prop muth fucka . Squad when it's time to squad what mu fucka. You trying to out a hole through my at depends hmm\nYou trying to shoot my momma, my sister, my aunt te am. You trying to shoot my Dorothy nigga when we rolling\nYou trying to shoot the G ride we just stole homie. Niggas trying to play like they don't effect me\nBut in the end you got to torch your spectrum. They trying chew like Hannibal Lector. I spit lectures like Hannibal Lector\nBitches are torios like Hannibal Lector. Cannibal lectures like Hannibal's lectures\n\n[Chorus]\nIf the street shit is hard to know you get to lesson on where to get your gun you better ride and roll\nIf you're a gansta and you know it and you ain't afraid to show it won't you tell them what the fuck\nIs what you Ride and roll. Cause it's a DPGC for life original. I am from (inaudible 1:25) Ride and roll\nYou see we pass going toe for toe to let you know just in case you didn't know you better ride and roll\n\n[Verse 2]\nNigga. Your homie is a flake. Lying on the flakes. He claims to bake in several places across state\nYour bitch is just a bitch. And that's just it. Cross bread idiotic bitch ain't shit. This West Coast\nOh you mad about this? One little fact that part of your clicks. That's kind of racial. Should I get the gauge too?\nAnd pump pump something up in your facial. Das and Kurupt we're legends and that's that\nGansta macks weed assemblies nickles and macks. Unseen vamperic, wolves and bats\nYou niggas is hooks niggas, thieves and rats. You live in fantasy island. I'm on the island boarder\nPlace where body taps happen for sure. My folks get high at me 'cause I'm stubborn and blank\nI'm egging to much and they don't want a nigga to drank\n\n[Chorus]\n\n[Verse 3]\nYeah, my pistol is too heavy now I got reserves in the back. I get tired firing, the reserves would react\nI might thump ya, fuck ya. I ain't fucking with them bustas. Mutha fucka what you want? Bas?\nOr do you want swab with Kurupt or mustard gas? Or do you realize your army's pumped ya?\nEither way that it goes body shots in sides some clothes. Freon nigga. Numb and froze\nFrom his hairline to nose thumb and toes\n\n[Bridge]\nBanging on bustas. Ride and roll\n\n[Chorus]", "image": "https://images.genius.com/c251b0b346b28a8f4079b3f901685705.1000x1000x1.jpg"}], "artist": "Kurupt"}