{"songs": [{"title": "That’s How...", "album": "Devils Night", "year": "2001-06-19", "lyrics": "[Hook]\n{*scratched*: \"Niggas, crackers, whities, jews..\"}\nThis is how it happens to you\nThat's how people get fucked up!\n{*scratched*: \"Niggas, crackers, whities, jews..\"}\n\nThis is how it happens to you\nThat's how people get fucked up!\n\n[Kuniva]\nYo, if you a loudmouth, trying to wild out\nAnd we see just how you laying and we peeped yo' style out\n(You a punk!) When you chilling out in front of your truck and get stuck\nThat's how niggas get fucked up!\n\n[Proof]\nNo love at home with your kinfolk\nAnd the world just keep fucking with your mental\nAnd all these kids making fun of your trench coat\nThat's how students get shot up!\n[Kon Artis]\nHating on us but you come to our show\n(Fuck them niggas) I crowd surf and you let me go\n(Oh no!) Whup yo' ass when I get off the flo', just so you know though\nThat's how haters get fucked up!\n\n[Swift]\nWhen the police pull you over and shit\nThen find ganja, now every month they checking on yo' piss\nThey getting mad cuz you ain't come back since, and now they sweating you\nThat's how P.O.'s get fucked up!\n\n[Kuniva]\nWhen your mans hook you up with a bitch\nOver the phone and when you see her she ugly as shit (god damn!)\nNow at the end of date she want a kiss, AND some dick\nThat's how blind dates get fucked up!\n[Proof]\nSaying we not a real crew with a lot of skill\nAnd only one nigga in our crew make the dollar bills\nY'all fools just mad cause y'all ain't got a deal\nLocal rappers talk too much!\n\n[Kon Artis]\n(We gon' rob this bank) but you roll with punks\nManager tripped the alarm and you all get stuck\nCops got AK's, y'all only got pumps - that shit's just dumb!\nThat's how Cool C got locked up!\n[Swift]\nWhen yo' ass wanna walk in a club\nInstead of telling you to wait, the nigga wanna push and shove\n(Move!) Then get trampled from the niggas you brung, so move over\nThat's how bouncers get fucked up!\n\n[Hook]\n\n[Kuniva]\nWhen you get your guns out of the stash\nAnd gather all your homies up to go and shoot up a pad\nSoon as you finish y'all run out of gas - you better haul ass\nThat's how drivebys get fucked up!\n[Proof]\nMixing weed with the brew, ecstasy and Kahlua\nGasoline fumes, nitrous balloons\nAcid tab-lets and the magic mushrooms\nThat's how D12 get fucked up!\n\n[Kon Artis]\n(Hey I like your records) but my album ain't dropped\n(Dr. Dre's my favorite) bitch get off his jock\nGot a backstage pass and I need to get off; wanna meet da-da-d-Doc\nThat's how groupies get tossed up!\n[Bizarre]\nDrop out of school, take drugs and molest sluts\nGot your girlfriend sucking on my left nut\nYour parents don't like me, but guess what?\nCause Bizarre don't give a fuck!\n\n[Kuniva]\nChokin your wife all in front of your peeps (bitch!)\nShe toss a brick through the window of your Jeep\nGet back together by the end of the week, that's so sweet!\nSlim and Kim argue too much!\n[Proof]\nInvite a ho to your house while your bitch is out\nNow you got your dick all up in her fucking mouth\nPull it out and then you bust off on her favorite blouse\nThat's how Clinton got caught up!\n[Kon Artis]\nSteal cars, wreck bars, get fucked up beyond\nRecognition walk in titty clubs like we stars\nOur mission every day is just to smoke bongs and fuck bitches in thongs\nThat's how Runyan Ave. is cut!\n[Swift]\nWhen your life wasn't raised up right\nThen see your mother coming home with different niggas every night\nAnd then you run into the one you don't like; so get the FUCK lost\nThat's how step-dads get fucked up!\n\n[Hook X2]", "image": "https://images.genius.com/591360993ef93e1c0a2402279fb90319.600x600x1.jpg"}], "artist": "D12"}