{"songs": [{"title": "Hooked", "album": "I Got the Hook-Up! (Original Motion Picture Soundtrack) ", "year": "1998-04-07", "lyrics": "Talking:\nHey yo, Soopafly\nThese niggas act like they don't know my motherfuckin' name (gangsta)\nHmm...ain't that a trip\nNow I put half these niggas on (ain't that something)\n\nChorus:\nSnoop D-O double G (from the DP)\n\nTalking:\nNiggas wasn't even rapping till I came out\nYou know what I'm sayin?\nY'all know what time it is\n\nChorus\n\nEvery nigga in this rap game, to the dope game\nNow I got the hook up on the dodo, for sure tho'\nBut I'm not a weed seller, but a crocka sack beller\nA rap star plus a 2 time felon\nSellin' phones out the trunk I mix G with funk\nI put it all together, and rock it till it chump\nThen bag it up and sag it up and then serve\nI'm always on the pager, never on the curb\nI'm big time, get mine, stay down for the grizind\nI keep it gangsta, nigga, all the tizime\nAsk them niggas, from way down South (who?)\nThe boys right there with the gold in they mouth\nThey'll tell ya (tell ya)\nThere ain't no bullshit to sell ya\nSnoop D-O double G who wannabes wannabe\nI got love for my folkers out in 'Lejo\nAnd all my soldiers gettin' busy down in N-O\nGangsta's, get respect from me\nAnd all you other niggas gettin' checked by me\nThat's on the C, DPG will never break up\nThere's too much motherfuckin' paper to cake up\nThat's on me (DPG)\nNow what?\nI'm\n\nChorus X3\n\nNow all the bitches if you with me, come get me\nI'm in room 210, don't forget to bring the gin\nThat's the old fashion way, and bring a friend with ya\nSo when I'm through with ya she can hit ya\nShit I ain't trippin'\nI'm dippin'\nThere's money to be made\nIt's funny how she layed when I told her she couldn't stay\nLook here, my boo'll be through\nSo you gotta raise, boy game pays\nOn the next phase, gotta show to do at 4\nThen I'm headed right back to the studio\nIf you need the hook up\nGive a nigga a holla\nI slide through your hood, in the gold impala\nDrop off a sack, then I head right back\nAnd I hope I don't get jacked, cause you know I'm ridin' strapped\nBut if the boys decide to pull me over loc\nThey recognize my face, and so they go\nGangsta's get respect ya see\nAll y'all other niggas gettin' shook like fleas\nThat's on the C\nDPG will never break up\nThere's too much motherfuckin' paper to cake up\nThat's on me\n\nChorus X4\n\nDogg Pound Gangsta's\nSay it with me\nSay it with me\nSay it with me\nSay it for me\nRight back at ya\nWho go the hook up?\nI do\nI got the hook up\nI got the hook up\nIf ya need it\nI got the hook up\nYeah\nThat's gangsta\nStraight up\n98\nDoggy Dogg\n\nChorus X5\n\nAin't No Limit to this shit\nAin't No Limit to this shit nigga\nStraight up\nThat's gangsta\nAnd we out", "image": "https://images.genius.com/8a29ae131b647d8c17f3cabee1a5c822.220x208x1.jpg"}], "artist": "Snoop Dogg"}