{"songs": [{"title": "Numb Encore (Remix)", "album": "Dretox", "year": null, "lyrics": "[Intro: 50 Cent:]\nSh-sh-sh-shady\nAftermath, haha\nG-G-G-G-G-Unit!, haha\n\n[Chorus: Jay-Z & Linkin Park]\nI've become so numb\nCan I get an encore\nDo you want more (more)\nI've become so numb\nCan I get an encore\nDo you want more (more)\nI've become so numb\nCan I get an encore\nDo you want more (more)\n\n[Eminem]\nGet your ass up for the doctor\nOne more time, get your ass up for the doctor\nCome on now, here we go\nCliff hanger, it's another club banger\nGot you hangin' on the edge of your seat\nGet on down\n\n[Verse 1: Dr. Dre]\nTimes up, games over, you lose, I win\n'bout to show these knuckleheads how to do this here\nOoh yeah, new year, next phase, begin\nLook who's got you goin' crazy again\nI'm a trend, I set one every time I'm in\nI go out and just come back full circle again\nYou a fad, that means your something that we already had\nBut once you're gone, you don't come back, too bad\n\n[Verse 2: Eminem]\nYou're off the map now, radar can't even find you\nWe stay on the grind, you slip, we out-grind you\nYou walk around mad, you let your anger blind you\nWe walk around just playin' the violin behind you\nEnough with all the pissin' and moanin', whinin' and bitchin'\nSit and observe, listen, you'll learn if you pay attention\nWhy ten multi-platinum albums later, three diamond\nWorld-wide, we're on the charts with a bullet and still climbin'\n\n[Chorus: Jay-Z & Linkin Park]\nNow can I get an encore, do you want more\nCookin raw with the Brooklyn boy\nSo for one last time I need y'all to roar\nNow what the hell are you waitin for\nAfter me, there shall be no more\nSo for one last time, nigga make some noise\n\n[Brigde: Eminem]\nSo all my people on the left, all my people on the right\nScream one last time\nWhen Dr. Dre say crunk, you will get it crunk, get it crunk\nCrunk, crunk, crunk\nAnd when 50 cent says jump, you get on one foot and jump\nJump, jump, jump, jump\n\n[Dr. Dre]\nThe buzz is tremendous, we drop you all to sense it\nI don't gotta promote it for you to know that doc is off the benches\n\n[Eminem]\nWe keep the party rockin' off the henges\nWe ain't showin' off, we just goin' off popular consensus\n\n[Verse 3: Dr. Dre]\nBut critics say that Doc is soft, Doc is talk\nDoc is all washed up, knock it off\nWho the f*ck is Doc impressin'?\nDoc is this, Doc is that, you got the wrong impression\nYou must be on the cock of Doc, cause Doc left you all guessin'\nSo DJ take the needle and just drop it on the record (what)\nWe gon' have this mutherf*cker hoppin' in a second (bump bump)\nThat's why we always save the best cut last\nTo make you scratch and itch for it like fresh cut grass\n\n[Verse 4: Eminem]\nCause we done swam with the sharks, wrestle with alligators\nSpoke to a generation of angry teenagers\nWhom if it wasn't for rap to bridge the gap\nMaybe raised to be racist\nWho may have never got to see our faces\nGrace the cover of Rolling Stone pages\nBroke down barriers of language and races\nJust call on the cape crusaders\nAnd leave it to me and Dre to pass the mic\nAnd we can play the back and forth all day\nLike the hot potato game, that's why we came to\n\n[Bridge: Eminem]\nFirst we came here to set this party off right\nLet's bounce tonight\n\n[Chorus: Jay-Z & Linkin Park]\nNow what the hell are you waitin for\nAfter me, there shall be no more\nSo for one last time, nigga make some noise\nI've become so numb\nSo for one last time I need y'all to roar\nOne last time I need y'all to roar\n\n[Bridge: Linkin Park]\nEvery step that I take is another mistake to you\n(Caught in the undertow just caught in the undertow)\nAnd every second I waste is more than I can take\n\n[Chorus: Linkin Park & Jay-Z]\nI've become so numb I can't feel you there\nI've become so tired so much more aware\nI'm becoming this all I want to do\nIs be more like me and be less like you\nI've become so numb\nCan I get an encore, do you want more (more...)\n\n[50 Cent]\nBounce now, hands up, you know how we do\nWe make the club jump everywhere we go\nIt's no secret, everybody know\nWhen Dre's involved, there's plenty money involved\n\n[Dr. Dre]\nAnd plenty honey's involved, the sunny Sunday's and palm trees\nCali, everyday it's just another party from the valley's\nAll the way to them 8 Mile alleys, let's rally\n\n[Eminem]\nHands up for the grand finale\nNow raise up out your seat, Dre is about to speak\nBlaze a pound of weed six days up out the week\n\n[Dr. Dre]\nYou could catch me in the studio bangin' out the beats to\nProvide you with the heat that keep blazin' out your speaker\n\n[Eminem]\nSo never say never cause Shady Aftermath together\nAlong with G-Unit Records presents the return of the-the Doc (and Shady)\nNo one could do it better\nWe tear the club up and leave without a strand of evidence and uh\n\n[Chorus: Jay-Z & Linkin Park]\nNow can I get an encore, do you want more\nCookin raw with the Brooklyn boy\nSo for one last time I need y'all to roar\nI've become so numb\nSo for one last time I need y'all to roar\nOne last time I need y'all to roar", "image": "https://images.genius.com/a07da7e37a6306d0e29285084f5afb9e.400x400x1.jpg"}], "artist": "Dr. Dre"}