{"songs": [{"title": "21 Jumpstreet", "album": "Murder Was the Case - The Soundtrack ", "year": "1994-10-15", "lyrics": "[Intro: DJ EZ Dicc]\nSmoking a fat sack, right here on the station that plays\nOnly platinum hits, W Ballz\nMy dicks in your ear, caller you wanna say what?\nHello? Hello? Caller?\nOh the hell with it\nThis is something new for the underground\nIn the L.B... See you when I get back\nDedicated to the East Side, Two One Street\nMy favorite and your favorite\nSnoop Froggy Dogg and somebody new Tha Dogg Pound\nCheck it out right here on the station that plays only platinum hits\n187.4 on your FM dial\nWe be taking caller number 21 for those Janet Jackson tickets\nSo call in, 310-D.A.P.O.U.N.D\nThat's 310-P.O.U.N.D. bitch\nThat's Da Pound\n\n[Snoop]\nHear ye, hear ye, come one come all\nIt's the first annual G-nic and all my Doggs\nAre invited, so go on and light it\nCause it's the first time in a long time (right)\nReminiscing about the Fresh Fest back in '85\nWhen the dubs and the San Dieg's used to hoo ride\nOn motherfuckers like it was the thing to do\nEighty-five, eighty-fo', eight-three, and year eighty-two (eighty-two)\nYou know what the fuck I'm talking about\nAfter party on the lake at the big homie's house\nAnd bet nobody bring a motherfucking gun\nCause everybody in the house's from two-one...\n\n[Tray Deee]\nTwenty-first street, burst street, where it all started\nAnd you know East Side, Long Beach, the hardest\nNiggas coming realer than The Real McCoy\nSo step with your rap and we bring the noise\nIt's the gang of fly bitches, homiez on the switches\nDice in the back if ya wanna get your riches\nNo snitches allowed inside the crowd\nCause this is the G thang, East Side L.B.C. brang\nFinna have some fun represent two-one\nAnd bet nobody bring a mothafucking gun and a...\n\n[Snoop]\nYeah, King Park was the location\nAnd to be a G, that was my destination\n(We were) lookin' up to niggas coming up before me\nAnd L.B.C. into my East Side homies..... (It's like)\n\n[Chorus]\nNobody can see you, but you (yeah, the East Side's perfect)\nNobody can see you, but you (ha ha, now that's worth it)\nNobody can see you, but you (hell yeah, the East Side's perfect)\nNobody can see you, but you (ha ha, yeah, now that's worth it)\n\nTatataratatatara...\n\n[Snoop (Tray Deee)]\nIf ya bring a strap, then ya have to trip\n(so if you're on a mission nigga, go on and dip)\nWe got meat to eat, (freaks to meet)\nAnd chronic we can smoke on, (and forever get a loc on)\nStrolling through the Park one day\nPuffing on a fat ass J, with my homie named Tray\nDeee tryin' to see if we could put this LBC thing\nBack together like it was supposed to see\n\n[Tray Deee]\nCause ya know I'm down with ya, to make 'em get the picture\nAnd if I have to sit ya, down then I spit ya\nGame from the heart, I came from the start\nSee I was regulating, when Cragars was the Daytons\n\n[Snoop]\nNigga let me interact with my black croaker sacks*\nAnd a gray golf hat tilted to the back (what's up?)\nDitchin' Sunday school to get a pack of Now and Laters\nWhile I'm rolling with the Steelers and killin' with the raiders\n\n[Tray Deee]\nAnd when we bang with the Saints then we ain't no joke\nCome around from outta bounds and we goes for broke\n\n[Snoop]\nNow we're breaking 'em up (hmm hmm), shaking em up (yeah)\nAnd just for a second we're waking 'em up\n(continue) Giving up game on this tight ass beat\nWith a small dedication, to two-one street", "image": "https://images.genius.com/0e58d7d7abc21e0c996c27e335e08719.999x1000x1.jpg"}], "artist": "Snoop Dogg"}