{"songs": [{"title": "Cold Blood", "album": "Brake Lights", "year": "2010-08-03", "lyrics": "[Verse 1: Game & *Busta Rhymes*]\n\nI was gonna buy a convertible, thought about JFK getting\n*Shot down in cold blood*\nSo I ain't cop that shit, cause I ain't wanna be riding through the hood and get\n*Shot down in cold blood*\nRiding through Compton in the Aston thinking bout my nigga 4cent getting\n*Shot down in cold blood*\nWhat if that was me? Nigga probably bet a G I wouldn't be live to see 30 i'd get\n*Shot down in cold blood*\nNigga getting money, hating niggas tryina' flex, wanna do you like Malcolm X\n*Shot down in cold blood*\nDo you like Martin Luther King, in Memphis were he got\n*Shot down in cold blood*\nAnd N.Y.P.D. Y'all can go to hell for killing that boy Sean Bell\n*Shot down in cold blood*\nKilling that nigga Pac, killing that boy B.I., two of the greatest rappers just\n*Shot down in cold blood*\nCould have been me, could have been that nigga Fifty, don't beef with the 60 you get\n*Shot down in cold blood*\nAsk the nigga Nipsey, know he got some dead homies, and I got some dead homies that got\n*Shot down in cold blood*\n\n[Hook: Game & *Busta Rhymes*] (x2)\nSo you got a red a rag, watch where you hang it fake ass gang bangers get\n*Shot down in cold blood*\nHeard you got a blue rag, watch where you put it the wrong pocket catch a bullet\n*Shot down in cold blood*\n\n[Verse 2: Dre & Busta Rhymes]\nThe news never talk about the killers in the hood, I guess they don't give a fuck if you get\n*Shot down in cold blood*\nLast night a stray bullet hit a niggy in his head, on the way to feed his kids he was\n*Shot down in cold blood*\n\"This business is never personal\", that is what a nigga said, for the right fucking price you get\n*Shot down in cold blood*\nSniff a whole bag of angel dust, walked upon that teacher pull a pistol out \"Blam!\" she got\n*Shot down in cold blood*\nNiggas out in Northern California bout to burn the city down for Oscar Grant, he got\n*Shot down in cold blood*\nReal shit, they try to tear you down when you alive, and call you legendary once you get\n*Shot down in cold blood*\nI bet my niggas ride on everything, everybody getting it, included kids\n*Shot down in cold blood*\nYellow tape at the wake, lord forget my evil ways damn, preacher found slain, he was\n*Shot down in cold blood*\n\n[Hook]", "image": "https://images.genius.com/6e47923e84d22040bd228aa550a666d4.800x800x1.png"}], "artist": "The Game"}