{"songs": [{"title": "Boom Goes the Cannon...", "album": "Hamildrops", "year": "2018-06-18", "lyrics": "[Intro: Havoc, Prodigy]\nUh\nYeah\n\n[Chorus: Prodigy]\nBoom! goes the cannon, watch the blood and the shit spray\nHow can we keep leading if the people keep retreating?\nNah, boom! goes the cannon, push forward, no fear\nWe gon' win this war and run them clowns outta here\nBoom! goes the cannon, watch they bodies and guns drop\nNow we the real leaders, opposition retreats when\nBoom! goes the cannon, push forward, no fear\nWe gon' take the war and run them outta here\n\n[Verse 1: Havoc]\nCheck it out\nThat's my right hand man, we like the Bobbsey Twins\nYou got my back, I got your back when the sass begins\nWe grew up in the slums, broke bread together\nWhen worse came to worse, rolled out the weather\nHad faith, knew it couldn't be this bad forever\nAnd once the sun shined, it could only get better\nBirds of a feather, we on the same page\nSince high school [?] whatever came our way\nYour kids is my kids, vice-versa\nYou ain't ask who the beef with, only where the burner\nNever blink a eye, you'll back down just to hold the fort down\nFrom Q.B. to Strong Isle, my soldiers running wild, we wildin'\nCourtesy of projects houses\nAnd though you not here, you lookin' down on me smiling\nWe took a oath to keep the name afloat\nWe Infamous forever, homie, the ultimate G.O.A.T.s\n\n[Chorus: Prodigy]\nBoom! goes the cannon, watch the blood and the shit spray\nHow can we keep leading if the people keep retreating?\nNah, boom! goes the cannon, push forward, no fear\nWe gon' win this war and run them clowns outta here\nBoom! goes the cannon, watch they bodies and guns drop\nNow we the real leaders, opposition retreats when\nBoom! goes the cannon, push forward, no fear\nWe gon' take the war and run them outta here\n\n[Verse 2: Prodigy]\nYeah, yeah\nWe are at war, no man is safe, you can't hide forever\nDie on the battlefield to rise up and take power\nIt's 32,000 troops in New York harbor\nWe outgunned, outmanned, and outnumbered\nIt's 32,000 troops in New York harbor\nWe outplanned, out our mind pushing forward\nWe a powder keg about to explode\nWish we had a man like Hamilton to lighten the load\nSend the word, get 'em\nHe want to fight, he got the hunger\nYeah, I was just like him when I was younger, uh\nHead full of fantasies of dying like a martyr, but look\nDying is easy, young man, livin' is harder\nIt's gon' be pools of blood in New York Harbor\nRah! Gunfire and cannonballs, it's on, son\nPools of blood in New York Harbor\nRah! Willin' to die in Revolutionary War, dunn\n\n[Chorus: Prodigy]\nBoom! goes the cannon, watch the blood and the shit spray\nHow can we keep leading if the people keep retreating?\nNah, boom! goes the cannon, push forward, no fear\nWe gon' win this war and run them clowns outta here\nBoom! goes the cannon, watch they bodies and guns drop\nNow we the real leaders, opposition retreats when\nBoom! goes the cannon, push forward, no fear\nWe gon' take the war and run them outta here", "image": "https://images.genius.com/f074263d00ce9897349bb19b9cfedcaa.1000x1000x1.jpg"}], "artist": "Mobb Deep"}