{"songs": [{"title": "Dr. Carter", "album": "Tha Carter III", "year": "2008-06-10", "lyrics": "[Intro: Lil Wayne & Nurse]\nWhere's my coffee?\nGood morning, Dr. Carter (Hey sweetie)\nLooks like it's gonna be a long day\nAhh, another one huh? What we got\nYour first patient (Yeah)\nIs suffering from a lack of concepts (Uh-huh)\nOriginality (Ugghh)\nHis flow is weak (Another one)\nAnd he has no style (Ughhh)\nWhat you got for him? (Tssss, okay)\n\n[Verse 1]\nLet me put my gloves on, and my scrubs on\nDr. Carter to the rescue\nExcuse me if I'm late, but like a thief it takes\nTime to be this great, uhh, so just wait\nYour style is a disgrace, your rhymes are fifth place\nAnd I'm just grace, one, uno, ace\nAnd I'm trying make your heart beat like bass\nHmm-mm, but you're sweet like cake\nAnd I come to fix wherever your shell break\nWhere is your originality? You are so fake\nSo picture me like a gallery, capture what I say\nAll I need is one mic, all I need is one take\nLike, hey! Brighter than a sun ray\nGot a pistol on a playground, watch the gun-play\nLike, no kidding, no kids in the way\nBut the kids do watch, gotta watch what we say\nGotta work everyday, gotta not be cliché\nGotta stand out like Andre 3K\nGotta kick it, kick it like a sensei\nYou gotta have faith, you gottta, gotta\nWait, wait, I think I, I think I lost him\n(Flatline)\n\n[Interlude: Lil Wayne & Nurse]\nGood afternoon, Dr. Carter (Nurse)\nI don't know about this one. His confidence is down, vocab and metaphors needs work, and he lacks respect for the game\n(Uhhhh, let me see)\nYou think you can save him?\n\n[Verse 2]\nOkay, respect is in the heart, so that's where I'mma start\nAnd a lot of heart patients don't make it\nBut, hey kid, plural, I graduated\n'Cause you can get through anything if Magic made it\nAnd that was called recycling, r-e-reciting something\n'Cause you just like it, so you say it just like it\nSome say it's biting but I say it's enlightening\nBesides, Dr. Kanye West is one of the brightest\nAnd Dr. Swizz can stitch your track up the tightest\nAnd Dr. Jeezy can fix you back up the nicest\nArthritis in my hand from writing\nBut I'm a doctor, they don't understand my writing\nSo I stopped writing, now I'm like lightning\nAnd you ain't Vince Young so don't clash with the Titan\nFast and exciting, my passion is frightening\nNow let me put some more vocab in your IV\nHere, take this Vicodin, like it and love it\nAnd confidence has no budget\nSo pay me no mind, I don't walk it like I talk it 'cause I run it\nI don't do it 'cause I done it, and I'm in the emergency un-it\nGod dunnit I've lost another one\n(Flatline)\n\n[Interlude: Lil Wayne & Nurse]\nGood evening, Dr. Carter. It's been a long day. But this one looks much better than the others. His respect is back up, concepts sound good, his style is showing strong signs of improvement. All he needs now is his swagger\nOkay, let me take my gloves off then\n\n[Verse 3]\nSwagger tighter than a yeast infection\nFly, go hard, like geese, erection\nFashion patrol, police detection\nEyes stay tight like Chinese Connection\nI stay tight like pussy at night\nBaby, don't get me wrong, I could do that pussy right\nBut I'm too wrong to right, too fresh to fight\nToo paid to freestyle, too paid to freestyle\nHad to say it twice, swagger so nice\nAnd don't ask me shit unless it concern a price\nAnd I don't rap fast, I rap slow\n'Cause I mean every letter in the words\nIn the sentence of my quotes\nSwagger just flows sweeter than honey oats\nThat swagger, I got it, I wear it like a coat\nWait, as I put the light down his throat\nI can only see flow, his blood starting to flow\nHis lungs starting to grow, this one's starting to show\nStrong signs of life, where's the stitches? Here's the knife\nSmack his face, his eyes open, I reply \"What a night\"\n\"Welcome back, Hip-Hop — I saved your life\"\n\n[Outro: Nurse]\nHe looks good, his vitals are up\nHe's looking good, he's looking good\nI think we got one, Dr. Carter, I think we got one\nYep, yep, we got one, we saved him he's good\nHe's good, we got one, he's good\n(Heartbeat)\nHe's good, we got him\nWe saved him, he's a go\nHe's good", "image": "https://images.genius.com/70a7ef69242915a9cd1c3f68031e4c0a.1000x1000x1.jpg"}], "artist": "Lil Wayne"}