{"songs": [{"title": "I Am... (Intro)", "album": "I Am...", "year": "1999-04-06", "lyrics": "[Intro]\nLa la\nLa la, la la, la la la la la la la\nLa la, la la, la la la la la la la\n\n[Sample 1: Live at the Barbeque]\nStreet's disciple, my raps are trifle\nI shoot slugs from my brain just like a rifle\nStampede the stage\n\n[Sample 2: Halftime]\nNas, why did you do it\nYou know you got the mad fat fluid when you rhyme, it's halftime\n\nCheck me out y'all\n\n[Sample 3: It Ain't Hard to Tell]\nFrom the spliff that I lift and inhale, it ain't hard to tell\n\n[Sample 4: The World is Yours]\nIt's yours\nWhose world is this?\nThe world is yours, the world is yours\nIt's mine, it's mine, it's mine; whose world is this?\n\nI sip the Dom P, watching Gandhi til I'm charged\nThen writing in my book of rhymes, all the words past the margin\n\n[Sample 5: One Love]\nOne what?\nOne love, one love, one love, one love\n\n[Sample 6: The Message]\nFake thug, no love\nYou get the slug CB4 Gusto\nYour luck low, I didn't know 'til I was drunk though\n\n[Sample 7: Street Dreams]\nQB since 1933\nStreet dreams are made of these\n\nEverybody's looking for something\n\n[Sample 8: If I Ruled the World]\nJust some thoughts for the mind\nI take a glimpse into time\nWatch the blimp read \"The World Is Mine\"\n\nIf I ruled the world (Imagine that)\n\n[Skit]\n[Horse]: Yo Jungle, how you feel about that Nas shit?\n[Jungle]: Niggas heard that shit, man, the fuck is that, man? Sorry man, y-you gotta play that shit to niggas man, niggas know what the fuck time it is man. (Horse: Okay man) Word man, it's your shit man, it's your time man, fuck all these niggas out man. Word is bond man, we ain't gonna fuck about  none of these motherfuckers man. It's your time man. Word [?]. It's real man. Try to tell these niggas one, two times man. This the motherfucking third time we telling these motherfuckers (Horse: What!?) man. The third time man. And this time gonna be the worse time man. Word is bond man out for the ghetto man, for all the motherfucking corners, all the motherfucking thugs man, real gansters man. Niggas in jail and shit man. Niggas with real-real motherfucking money, niggas with real motherfucking things on their minds man, word is bond man. [?] bitch ass niggas man (Horse: Fucking faggot emcees). Fucking weirdos man, y'all weirdos out there man. Fuck all of y'all niggas. Yeah man y'all niggas can write what y'all want. Suck my motherfucking dick. You're-you're a bitch! What the fuck y'all want, man. Listen to this gangster shit, this is gangster. Real shit! How 'bout that? For the Nas, man. [?] Drugs, man\n[Horse]: Fuck all y'all faggot motherfuckers", "image": "https://images.genius.com/73b36e02ac974c8ab4a3cd49a9cf1794.1000x1000x1.jpg"}], "artist": "Nas"}