{"songs": [{"title": "Tequila Sunrise (Uncensored Remix)", "album": null, "year": null, "lyrics": "Verse One: B-Real\nSipping on tequila, with Sheila, no doubt I'm bringing her on\nKeeping her warm, leaving her heated like Tiger Balm\nIn the hot sun city of Mexico, it's a pity\nMy committee of witty niggas ain't with me to get gritty\nRhymey as fuck on the track, snappin your head back\nGet the medic, cause a victim from my nigga Joey Crack\nStomping the wax, niggas spittin on wax\nGiving the facts, beginners lack the methods of kicking wicked records\nA second of time switch, as styles piles up\nMountains of various flows to rile up\nNow what you wanna do, nigga?  Tequila sunrise, nigga!\nI'm coming to town with my bigger boogie down figga\nIt's the live shit, do you think you can survive it?\nWhen you decide it, leave it to me and Joe can provide it\nCracking open the golden, holdin the bomb load\nWhile records are selling singles, my albums are getting sold\nKicking the universal, never commercial techniques\nBang in the clubs, bang in the jeeps, bang in the streets\n\nChorus:\nTequila Sunrise, bloodshot eyes\nRealize we're all born to die\nSo get the money, nigga!\n(repeat 4x)\n\nVerse Two: Fat Joe\nNow I'm back for the new year, yeah, I volunteer\nSources pioneer, millionaire status here\nI never had no fear sellin records\nI resurrected on my third, that's my word, it's a high selection\nAnd everybody know standing near me\nI'm dangerous like Shannon Greary\nMaking the whole planet hear me\nYou feel me?  I'm on my road to the riches\nWith hoes and bitches fulfilling my goals and my wishes\nMy flows is vicious, but showin' niggas since the early 90's\nWhere Onyx at?  Niggas rockin' both easy 'round a grammy\nDon't mind me, I just call 'em how I see 'em\nMost these rappers is actors living off per diem\nMe? I'm on my own shit, nothing but gold hits\nClaimin the throne with my thuggish ruggish Bone clique\nOn the phone-flip, talking to B\nHe scooped me up in the six, we 'bout to hit overseas, what!\n\nChorus\n\nOutro\n(each overlapping the other)\n\nB-Real:\nThat's right, we hitting you with the L.A./Bronx connection\nSoul Assassins, Terror Squad family\nAll up in your dome... ha!\nThat's right, Soul Assassins style, Cypress Hill IV\nKnocking on your door for the ninety-eight\nThat's right, eat the worm, motherfucker\n\nFat Joe:\nYeah... Terror Squad, Soul Assassins\nB-Real, Joey Crack... wha-wha-wha-what!\nUgh! Puttin' it down, nigga!\nEast coast, West coast\nAnd it's all the same, hahahaha... yeah, yeah", "image": "https://images.genius.com/2615919eb0bcef9d55421080ab3b10b1.860x860x1.jpg"}], "artist": "Cypress Hill"}