{"songs": [{"title": "Let’s Dance", "album": null, "year": "2009-08-25", "lyrics": "[Intro]\nHey! What's your name? Oh, that's nice\nMe? I'm Wolf, you can call me Tyler though\nI'm eighteen, you from around here?\nOh, you look like my next victim\nI said you look like my ex-girlfriend, sister\n\n[Verse 1]\nWhile James is jamming on the mixer\nWe can play Twister naked\nDon't be afraid, it's just a kiss\nI'm open to everything if you're inviting your sister\nThat's another topic, we should start a project\nYou could be the lab rat, I could be the doctor\nLet me drug you up and put different things in you\nBut I'm not gonna do that until you begin to pass out\nNow I can draw your face up pretty\nOr do it jackass and leave your breath all shitty\nOr I can get the hand held and hold held titty\nAnd stick my dick in you but that just might offend you\nTeenage parties, I recommend you\nNever get drunk with a nigga like us\nBut I kinda like your company\nAnd you rubbing on my dick, yeah it comforts me\nFuck, condom pocket, luckily, I brought one\nHerpes virus, yeah bitch, I fought one\nI don't want you to have my permit yet\nThat I just haven't came up with a name yet\nI got some new shit, well technically, I got a new dick\nThe other one fell off in a pulpit\nA gay coaches' white grease and Chris Stokes\nBlew the fuck up in gray clouds of thick smoke\nFunny, right? Ha-ha, this shit's jokes\nI got the idea from a letter that the shit wrote\n\n[Hook]\nHey, you right there\nIn that pretty red dress, let's dance\nI said hey, you right there\nIn that pretty red dress, let's fuck (rough)\n\n[Verse 2]\nWell, I have a gram cupcake mix\nMix a little syrup, it ain't no way to cure him\nBut I don't do the syrup, I just do the sniffles\nTake a couple bits, bitch kibbles, bitch I gotta riddle\nWhat can you tickle that can make a dinosaur giggle\nI'm tryna get your puss, your pimple is a push\nAway from the tush, I don't smoke kush\nI don't do drugs, I don't even club\nI don't drink beer, why the fuck am I here\nThe girls are really cute but there on X\nAnd that's a better reason to for me to take advantage with sex\nAnd you might be next, you pass out on\nMe and your mouth drool, throw you in my van now it's carpool\nLet you rest your ass on my dick like a barstool\nGoing deep like a scuba with the snorkle\nYou never gonna forgive me, but your so damn pretty\nI'mma drop you off home quickly\nYou passed out, bitch you ain't even listening\nAnd leave your house empty, your neighbors didn't see me\nYour never gonna get me, your self respect were skimpy\nYou was up thirty, now you're down fifty\nAbracadabra your memory I'm tricky\nYou are what I rob so I guess your pussy empty\nJust like your home by taking the store of oreos\nOver by the cabin of cheerios and the mint tea\n\n[Interlude]\nYep. But.. I had fun, tonight..\n\n[Hook]", "image": "https://images.genius.com/610384882ca6311db99de4fbfcdf2b46.421x421x1.jpg"}], "artist": "Tyler, The Creator"}