{"songs": [{"title": "Peer Pressure", "album": "Juvenile Hell", "year": "1993-04-13", "lyrics": "[Hook]\nThe pressure... (you gotta find a way to deal with)\nDealin' with the peer pressure\n\n[Verse 1: Havoc]\nAs a young black teen, everyday I, deal\nWith the pressure and mixed up is how I feel\nI walk the streets with a fuck you attitude\nAnd when it comes to my peoples, you ain't half as rude\nFollow the crowd or be a leader, take your pick\nNow I'm smokin' buddha philly blunt style\nA frustrated and confused young juvenile\nKing of the project blues so I choose\nTo take a piece of the action\nBut my sober state of mind won't let it happen\nSo, 24/7 is the number one stresser\nDealin' with the peer pressure\n\n[Hook]\n\n[Verse 2: Prodigy]\nMost don't understand how it is\nIn the world of today growin' up as a young black teen\nI used to dream, of bein' a architect\nEasier said than done, believe me it's hard to get\nOut of the projects, without forgettin' where you came from\nMy parents told me from day one\nFinish school and avoid all obstacles\nBut my environment makes it so impossible\nFor instance, build a strong social life\nWithout messin' up, still tryin' to live right\nLike in junior high, I used to wonder why\nCertain females went out with certain guys\n\n[Verse 3: Havoc]\nThen one day, it all dawned on me, yo\nYou gotta be down and have it goin' on, see?\nI wasn't down with the mainstream or should I say their team, huh\nNow I'm gettin' steamed\nGotta find a way to get accepted by my peers\nSo now I'm sippin' on beers\nBuyin' new gear, nuthin' but the best\nForget Levi's, strictly Polo and Guess\nBut how would I make the cash?\nIt gotta be easy and it gotta be fast\nThinkin' to myself \"Does that make me lesser?\"\nJust, dealin' with the peer pressure\n\n[Hook x2]\n\n[Verse 4: Prodigy]\nAround my way there's a kid that most don't understand\nHow he lives, is it negative or positive?\nHe has a grade A average\nBut when he's on the streets with his friends, he's a savage\nA freshman of high school, daily attendant\nHe never got in trouble, never did he get suspended\nGood little Kenny, who would believe?\nHe dropped out of school to start to smoke weed\nI saw the signs but I didn't pay attention\nBecause he got offended every time that I would mention\nThe drinkin', the smokin', the low school grades\nAnd sleepin' in class, laid back with his black shades\nNowadays, you catch Kenny hangin' in the hallways\nWith his crew, findin' more ways\nTo break out of school and hit the block and get buckwild\nStay out of the way of a mad child\n'Cause he's a product of hell\nKenny never fell but he's gonna fall overall\nSo, let's take a trip to the ghetto\nWhere Kenny got drunk and bought a burner off his man, so\nHe pulled the trigger and the suicide note read:\n\"I'm glad it's finally over and I'm finally dead\nAnd no more do I have to feel lesser\nOr deal with the peer pressure\"\n\n[Hook x2]", "image": "https://images.genius.com/2ca92566d6769c85797a1f455575d4b8.597x597x1.jpg"}], "artist": "Mobb Deep"}