{"songs": [{"title": "Vernon Family", "album": "The Lost Tapes 2", "year": "2019-07-19", "lyrics": "[Intro]\nYeah\nYeah\n\n[Verse 1]\nLiterally rich since nine-six\nStill woulda hit a enemy with a TEC in nine-six\nExotic material on the neck and fly whips\nI was fresh out the 'jects, decked out to death\nY'all witnessed it, I could fill you with real millionaire shit\nEscargot, my car fresh from the dealership\nEsco alias, my escrow grow daily\nIt's the freshest Air Max wearer, yes\nEjaculatory depression after sex\nAnd that mean after I nut, don't touch me, no questions\nUnless she's a restless spirit then I can heal it\nSpend a lot of time together, I know her feelings\nBut you fightin' what the essence of a woman is\nI respect you, my love's limitless\nBut what are you becoming?\nYou wanna be the man or the woman? Play your position\nMornin' or night I'm lickin' the pudding ain't I?\nSince my days of St. Ides\nPullin' out box cutters to bang opps who ain't us\nTo Bentley Continentals, see the man I is\nHand-to-hand hustlers always claiming they ran The Brizz\nThe big homies don't approve that\nFelt and Dirty Red fundin' RK but where was you at?\nWe all tried to move crack\nNowadays I'm just showing my age\nThe new goons hardly heard of these legendary names, it's strange\nThe Bridge rappers influenced me, son\nBut if I was in the Juice Crew, we woulda won\nNo disrespect 'less disrespect served to me\nYou a gangsta groupie, gassin' niggas to murder me, nigga?\nWho I'm reppin'? 10th Street, 12th Street, Vernon Family\nAnd that's word to Yammy, yeah\nDeep roots, I ain't have to fake it yet\nOld solid tree branches ain't breakin' yet\nA vet\n\n[Chorus]\nGet rich project niggas\nBillionaire mindset niggas\nKnow you know my set, niggas\n10th Street, 12th Street, Vernon Family\nGet rich project niggas\nBillionaire mindset niggas\nKnow you know my set, niggas\n10th Street, 12th Street, Vernon Family\n\n[Verse 2]\nI got the je ne sais quoi, why bother\nWith girls who like to play keep-away with they toddlers?\nShe started with good intentions like a rich pastor\nBitch was bad, turned from good thing to disaster\nTakes forever to build a rep, one second to lose it\nShe put her neck in a noose, snapped it\nHangin' on every word she heard come outta cougar mouth, super foul\nPlay your cards right, deuces wild, salute my pals\nFathers all around the board goin' through it\nShe got lobster appetites, lots of habits\nLike frontin' when she need apartment deposits\nHere's something, get you a starter\nBut pardon my pimpin', I don't sponsor\nI don't buy cars, I coach you to win, know what?\nIf you broke and your man don't teach you, get rid of him\nWho I'm reppin'? 10th Street, 12th Street, Vernon, still\nAnd that's word to Will, for real\n\n[Chorus]\nGet rich project niggas\nBillionaire mindset niggas\nKnow you know my set, niggas\n10th Street, 12th Street, Vernon Family\nGet rich project niggas\nBillionaire mindset niggas\nKnow you know my set, niggas\n10th Street, 12th Street, Vernon Family\n\n[Outro]\nShout to Draws, Spanky, Black Ed, Hands\nShout to Shabazz, Wewop and Harvey\nRest in glory\nTJ Killa Black, rest in glory\nShout to all the young legends we losin' too soon\nYeah", "image": "https://images.genius.com/91da51c7ed14c805c492a0346f54d465.1000x1000x1.jpg"}], "artist": "Nas"}