{"songs": [{"title": "Anybody (Remix)", "album": null, "year": null, "lyrics": "(feat. E-40 & C-Murder)\n\n[Intro: C-Murder]\nTytanic, let's wake 'em up, ya heard?\nYeah, it's real out here\nKilla block notch, wit' the ODB\nNYC, CP-3, nigga, what?\nLet me ask you a question\nWhat do you think about the game now? (What you think about it now?)\nHow you feel like my name now (How you feel 'bout me now?)\nHow you feel like C now?\nWhat do you think about the ODB now? (What?)\nWhat do you think about the game now? (What you think about it now?)\nHow you feel like my name now (How you feel about me now?)\nHow you feel like my name now (I told you I wanted somethin')\n\n[Ol' Dirty Bastard]\nYeah, bite that point, the habit apprievin'\nNo hope to find, that you're misbehavin'\nLink your crupid, fuck your brewin'\nFlash the burgers on your crewin'\nCuz the monks, skippin' from the other MC's\nI got the amazing ability\nI get on the mic so you can have a ball\nI could fly through the air and stick to the wall\nI could take a punch or get hit by a car\nCould go to the nearest or farthest star\nAs a matter of fact it's what I won't talk about\nPop a word out of trace just to be in the house\n\n[Chorus: E-40]\nSo pimped out about my big spendish\nI got a 20, 6 O'Clock extra chrystall\nAnybody dat wanna pop off at the lip\nAnybody that wanna give me banana split\nIt's only E-40, Murder in this bitch\nAll the money motivated me to biatch\nThree soldiers from the East, South and West\nStreet soldiers holdin' it down for they vets\n\n[C-Murder]\nI'm C-Murder, murder mass ten, I'm wit' the Dirty Bastard\nAnd my flows comin' faster than a jet to Alaska\nI ask ya how you feelin' my collabo'\nThe CP3, the ODB from NYC the ghetto B\nLight it up, let it cook, look in the mirror, let me crush\nDon't worry about how it looks, put some momey on my books\nOnly God can judge me now\nThat's when I heard the click click, I was Christened\nI ain't with them are you wid that\nLet them whistles out them pistols\nLet loose on them troops and then shake 'em like Cherok smoke\nI slam dunk 'em like Shaq\nI wanna be free, I'm not guilty, do you feel me?\n\nChorus\n\n[E-40]\nHey sluggin', wanna hit this rock dowm (rock down)\nI only got one world, mane, I feel like take this to the thick of him\nUnder there, got the smell, you do the hoe you hear\nFuck it there, let me get a swig of that Thunder Bird\nOK, it's cute, it's squashed\nNow, no though mane, lets have a back wash\nYeah you trippin', \"no I ain't\", yeah you is\nThat boy spittin', what's his name? 40, quarter, biatch\n\n[Ol' Dirty Bastard]\nI stage a place, place stage a me\nI'm a vision of truth, just a true MC\nLove hiphop so much, mic won't untouched\nThugs grow unbust, bitch won't get fucked\nEvery 40 ounce cracked, every napsack packed\nOl' Dirty kickin' your ass, the record gets scrapped\nOh, the record gets scrapped, the record gets scrapped\n\nChorus\n\n[Outro: E-40]\nAnd there you have it\nE-40 the bonzerelli\nThe ballatician from the Soyo block soil\nTurf hall, been through it all\nHard 'til we have it all (hard 'til we have it all)\nAy look it's C-Murder and Ol'Dirty Bastard\nIf you don't stay your ass out of trouble\nWhat's up boy? ODB\nWe got the same motherfuckin' birthday\nNovermber the 12th to be exact motherfuckers\nWhat the fuck you drinkin'? Fortay\nGet 'em off this motherfucker..", "image": "https://images.genius.com/d7e323c108da42ed17c2a306b8658e1d.500x335x1.jpg"}], "artist": "Ol’ Dirty Bastard"}