{"songs": [{"title": "Believe It", "album": "Prophets vs. Profits", "year": null, "lyrics": "Yeah, Yeah, Yeah, Yeah, Yeah, Yeah, Word\nAll my people in Boston make some noise\nWhew! Inebriated Beats. You got to Believe\n\n[ Hook: repeat 6x ]\n\nBelieve it\n\n[ Krs-One ]\n\nYeah, Yeah, Yeah, Yeah, Look, Look\nAll my rap is street related\nHow can you spit and not have it hit the pavement?\nThese beats we created be inebriated\nMeaning intoxicating, believe we made it\nNow we can see they faded\nThem hoes done went from me so horny to me so hated\nFrom Hip Hop, we never deviated\nCome to the Temple, hear the flow and you can see me state it\nThat Knowledge Reign Supreme\nI be on the same streets, with them same hustlers and fiends\nBut Hip Hop, do you know what it means?\nIt means victory over the streets, check the last Beat Street scene\nI leak knowledge, inner-standing, wisdom\nKRS the type that get you outta the prison\nElite knowledge, inner-standing, wisdom\nKRS the type that get you outta the prison, Believe\n\n[ Hook ]\n\n[ Krs-One ]\n\nYo, Yo, Believe it\nI only come to help you achieve it\nYou could believe what you want, you can take it or leave it\nSlow it up or speed it, but never mind if you dont need it\nBut I still gotta teach it, I still gotta speak it\nThere's more to the streets than guns and stuff\nTo all my fathers, you know one sons enough\nBut if you have two or three\nYou know they get -gasm what they see on the t.v\nYou gotta believe me\nWe gotta rise up\nAll my daughters I beg, close your legs and kind of like open your minds up\nBefore your times up, and you find what?\nYou was just another stepping stone for him to climb up\nI'm what? A player? No\nA ho? No. An average rhyme-sayer? No\nA neighbor? Yes. A friend of the Savior? Yes\nI can honestly say I'm blessed\n\n[ Hook ]\n\n[ Krs-One ]\n\nYo, its a Hip Hop intellectual heavyweight\nThat leaves 'em in a truly inebriated state\nIf you thinking about leaving, you better wait\nWe only talking about freedom and showing love instead of hate\nBut no, you dont think it's real\nUntil you're shackled 'round your wrists and your ankles and your heels\nYou could brag if you feel\nBut don't forget to mention the twenty to life is part of the deal\nWhen the DEA flash that shield\nThe bigger they are as stars\nHuh... the harder they squeal\nAnd usually your name comes out\nLeading to that knock on the door, and you being led out\nThat's when my lyrics matter\nAll them guns and bitches and hoes, you don't wanna hear them rappers\nThat's when you wanna hear pastors\nBut if you listen now, you can like avoid them disasters\nTurn your life over to God today\nNot a little bit, Yo, go all the way\nI said, turn your life over to God today\nNot a little bit, Yo, go all the way Yo\n\n[ Hook ]\n\n[ Krs-One talking through Hook ]\n\nIt's live like that ya'll\nIt's live just like that\nBig up! Terry Andrell\nWord up! D.J. Tine E. Tim\nWhew! G. Simone, you know you're not alone\nG. Simone, uh, uh\nMickey Mic, Yo what up Mickey?\nUh, Yo, Yeah", "image": "https://images.genius.com/47add5b76aff66374496d71d637e04ca.220x222x1.jpg"}], "artist": "KRS-One"}