{"songs": [{"title": "My World", "album": "Everready [The Religion]", "year": "2006-11-07", "lyrics": "[Intro]\nIn a world of misery\nWithin this, three planets collide\nBrotha Lynch, Dalima, Tech N9ne\nBring you along for the ride\n\n[Verse 1: Brotha Lynch Hung]\nWait a minute, I’m from the West Coast Conference\nLike Kobe or James Worthy\nYou could just call me the King of the Valley\nAll I need is a game jersey\nNigga nuts and guts get served up\nWhen I get it, I’ll spit enough, aim sturdy\nCut it up, gut it up, with cold cuts\nWita oven that heated up, came dirty\nI’ll be off of that kryptonite\nTurn ‘em into liquid ice, stain his jersey\nLeave ‘em in the back of the El Co\nLike Helter Skelt’, stick it to ‘em like velcro\nNigga, I’m a bitch killer\nI’ma dig a ditch, quick to rip ya\nPaint a murder picture wit'cha\nI’m a jack knife, strip ya that night\nSplit your legs open and dick you\nWith the 9 milli ithaca rippin' your guts\nEat ya meat, the deep heat, deplete you with the meat cleaver\nThen I didn't see you either\nFour quarter receiver, court order delete you\nTech ordered the meat, I’m bringin’ the seasonage\nAnd a suicide note, do-or-die locc\nHe's in the backseat, cut necks, some sexist\n'Bout to get him that Brotha Lynch Hung necklace\nExpect this\n\n[Hook: Tech N9ne]\nWelcome to my world\nWhere hearts are broken, and bars\nAre open, potions pullin’ me closer\nWelcome to my world\nDark’s my ocean, my Ark is floatin’\nBut not livin’ like I’m supposed to\nWelcome to my world\nWhere hearts are broken, and bars\nAre open, potions pullin’ me closer\nWelcome to my world\nDark’s my ocean, my Ark is floatin’\nBut not livin’ like I’m supposed to\n\n[Verse 2: Dalima]\n(Lyrical asylum)\n‘Cause I be Dalima, motherfuckers hatin’ me for the longest\nCould it be critical ‘cause I’m lyrically flawless?\nAnd if I’m heated I cannot be mentally cautious?\n(Diggin' the pain) I get deep peepin’ the flame\nOnly can I be held accountable for makin’ the change\nTo whatever regards are gonna be (Insane)\nIn the middle of a stage, I’m bustin’ like a 12-Gauge\nYou can never bring it to a nigga that’ll hang you up\nSlip a couple mickeys up in your drink for you\nHomicidal with the fully-loaded rifle and undecided of\nWhether or not I can cut up your brains or guts\n(I get spaced out sometimes)\nAnd it’s like I’m a heathen, whether or not you believe it\nEverytime I rap a motherfucker stop breathin’\nHave you ever been in a dilemma for a reason? (Nah)\nWell, let me introduce you to the crucial upliftin’ future (and then)\nRecruit you and seduce you to the mutual group of (My friends' souls)\nNigga you better get ready ‘cause\nWe done put together the fettiest chemical frame\nEnergetic when I let it, embed it in your brain\nTech N9ne, Dalima and Brotha Lynch like\n\n[Hook: Tech N9ne]\nWelcome to my world\nWhere hearts are broken, and bars\nAre open, potions pullin’ me closer\nWelcome to my world\nDark’s my ocean, my Ark is floatin’\nBut not livin’ like I’m supposed to\nWelcome to my world\nWhere hearts are broken, and bars\nAre open, potions pullin’ me closer\nWelcome to my world\nDark’s my ocean, my Ark is floatin’\nBut not livin’ like I’m supposed to\n\n(Dlrow ym ot emocleW)\n(World)\n\n[Verse 3: Tech N9ne]\nFight this phantom, your freakin’ family will fall flat\nBunk Bianca's beat ‘em black and blue with a baseball bat\nI might be a small cat, but I won’t use discretion\nHit ‘em with a weapon, if he steppin’ with a mall rat\nTwenty minus eleven, I make ‘em all scat!\nNot prosperous now, Tech’s not with his crowd\nHe’s lost in his clouds\nRather be off’ed than soft with his style\nI got hopes that my life might get better\nBut I’ve been broke, so I might swipe your cheddar\nYou better get ready to give me, I got a vendetta\nComin’ to get it, whether weed or money, whatever\nNobody said it was gonna be easy, people deceive me\nOr leave me in the dark and buried off in Necropolis\nOne day you gon' see on me TV, you better believe me\nTakin’ over this and never the opposite\nRewrite my life, gimme light, inner fight for what’s right\nAllah Liberate, Cuidado\n151 Rum is how we run from slim sums, then comes Diablo\nI need a medic ‘cause I murder energetic\nIn the cerebellum never tell ‘em I got\nOne of the worst problems in the medulla oblongata\nYou oughtta go in one hell of a shot!\nNo more darkness, how did I start this?\nFeelin' bizarre shit, like kickin’ your carcass\nI am the ruler in my kingdom and my dark seat's hot\nStep into my world and your heartbeat stop!\n\n(Dlrow ym ot emocleW)\n\n[Hook: Tech N9ne]\nWelcome to my world\nWhere hearts are broken, and bars\nAre open, potions pullin’ me closer\nWelcome to my world\nDark’s my ocean, my Ark is floatin’\nBut not livin’ like I’m supposed to\nWelcome to my world\nWhere hearts are broken, and bars\nAre open, potions pullin’ me closer\nWelcome to my world\nDark’s my ocean, my Ark is floatin’\nBut not livin’ like I’m supposed to\nWelcome to my world", "image": "https://images.genius.com/03fc1f30c3a9ab069072c2b38b117ffe.999x1000x1.jpg"}], "artist": "Tech N9ne"}