{"songs": [{"title": "Excellence", "album": "Mos Definite", "year": "2004-10-26", "lyrics": "[Intro: Mos Def]\nYes sir, yes sir\nYou know the runnings\nExcellence always\nBrooklyn embassy, haha\nBlack Star shining\nYou are now rocking with the best\nBrooklyn's own, Brooklyn's only\nM-O-S definite\nBig shout out to Cash Money, Shy and Medina Green\nListen...\n\n[Verse: Mos Def]\nThree words for the con, no you aren't\nSmoke smoke but you're no cigar-a\nSoon as Mos hit the open market\nThe ghetto know to cop it\nGet on my back like a open warrant\nBrook-lyn sick so retarded\nHop on your phone and told your partna\nHop offa him, and told your mama\nGot no type of focus problems\nY'all better focus harder\nGet out your rhyme book and smoke some scama\nEver far you go, I'm going harder\nUnderstand I, rock today like it's no tomorrow\nLast year, my catalog was so impressive\nThat this year my rookie card's a great investment\nAm I hot? Nigga change the question\nAre you hotter than me?\nShit we can take out the product and see\nY'all don't want no drama with me\nWithout a part in a film\nA director and a call from the guild\nY'all don't want no problems for real\nSo why you speaking of beef?\nY'all youngins don't y'all need to be sleep?\nCause secretly I'm the nigga that you dreaming to be\nIt ain't as easy as that\nIt's only one Mos, leave it at that\nWhatever shine you had I'm leaving with that\nI give a fat baby's ass where your peoples is at\nAnd where your heaters is at\nYou fuck around and catch a leak in your back\nGet a hug dogg you need to relax\nDon't get beaten up cause of rap\nAnd don't get mad at me cause you're whack\nShit genetics is the reason for that\nYou ain't seeing me I'm seeing to that\nI'm from the brightest hardest star to ever be on the map\nAnd that's the B-R-O-double y'all don't want no trouble rest\nMighty motherfuckin Mos Def... like that", "image": "https://images.genius.com/01cbfdcd59cbc20d1bd3e72bfc3a0379.500x500x1.jpg"}], "artist": "Yasiin Bey"}