{"songs": [{"title": "See World", "album": "Friday Night Lights", "year": "2010-11-12", "lyrics": "[Sample]\nThis is Shaniya Davis, last seen wearing a blue sleep shirt and pink underwear. The search for the little girl is now entering its 11th hour in Fayetville, and there’s some disturbing new details\n\n[Intro]\nYeah, hey\nFayettenam nigga\nDreamville nigga\nJ. Cole\nHey, ah\nI ain't ready yet\nYeah, I ain't ready yet\nYeah, hey\n\n[Verse 1]\nGettin' higher than the soul of little Shaniya\nAnd to the ones that killed her, hope you burn in fire\nI’m burnin' tires on the strip, tryna get a grip\nLiquor in the cupholder, tryna get a sip\n6 shots of Hennessey, I’m still goin' strong\nPlease numb me from the bullshit that’s goin' on\nThat girl was 5 years old that they just murdered\nAnd did some wicked shit to her that was unheard of\nYou fuckin' coward, ain’t gotta tell em’ go to Hell\n'Cause that’s the shit that make them other niggas sick in jail;\nSo you gon’ feel it\nTravel the world reppin' this city, know I’m gon' kill it\nBut yet a nigga ain’t got a clue..\nHow I’m gon' deal with all the bullshit\nNiggas sendin' shots my way\nYou put a hit out on me, think that I’m gon' stop? No way\nGon' have to kill me, or witness a nigga livin' so filthy\nYoung, black, and wealthy, nigga for that I’m guilty\nStill see all the fake shit, it’s funny somehow\nThought the money could erase it, no matter how\nMuch dough you got you gotta face it, and to my niggas gone\nHope you in a better place, if I make it I’ll holla…\n\n[Chorus]\nSee world, huh-uh\nYou’re no good, uh-uh, hey\nYeah, see world\nYou’re no good, uh-uh\nNo matter how I hate flashbacks and rewinds\nCan’t escape the pain that be trapped in my mind\nNigga, see world\nYou’re no good\n\n[Verse 2]\nUh, I got a chip on my shoulder the size of the Golden Nugget\nThe industry overlook me, for that I be holding grudges\nWouldn’t take a chance on me, suddenly it's, oh you love it\nLet's get a Cole feature, that's gon' put you over budget, now\nPicture being broke without no pot to piss in\nAnd then suddenly your idols is your competition\nUsed to be like God to me, slowly losing my religion\nAs these notes from my composition turn to competitions, then\nPut it out and hope the world sing\nWe sippin’ liquor for the pain that the world bring\nWe had dreams just to make it up the flag pole\nJust to find out that our heroes were some assholes, y’all don't hear me\nMaybe I had the world figured out wrong\nWhen these niggas go from singing our songs and waiting on you\n'Bout a year later the same ones be hatin’ on you\nEvery other record these rappers be faking on you\nDog, we sing your songs but we know that ain’t you\nWe know you gotta make the people pay you\n'Cause either you play the game or watch the game play you\nAnd be that broke muthafucker talkin' 'bout “I stayed true”\n\n[Chorus]\nYeah, see world, huh-uh\nYou’re no good, uh-uh, hey\nYeah, see world\nYou’re no good, uh-uh\nNo matter how I hate flashbacks and rewinds\nCan’t escape the pain that be trapped in my mind\nNigga, see world\nYou’re no good\n\n[Sample]\nBy candlelight, they stood as one, numb with shock and disbelief. A little girl's body, found Monday, is believed to be five-year-old Shaniya Davis, missing since last Tuesday. Davis has been charged with the unthinkable; prostituting her five year old daughter. Security camera’s spotted a man carrying Shaniya into a hotel last Tuesday. This man, police said, is now charged with Shaniya’s kidnapping. Search parties found the girl’s body yesterday a 100 feet off-road, wearing only a t-shirt\n\n[Chorus]\nYeah, see world, huh-uh\nYou’re no good, uh-uh, hey\nYeah, see world\nYou’re no good, uh-uh\nNo matter how I hate flashbacks and rewinds\nCan’t escape the pain that be trapped in my mind\nNigga, see world\nYou’re no good", "image": "https://images.genius.com/ae722fa8fa10d75fe4b25dfeb4b8d8d6.1000x1000x1.jpg"}], "artist": "J. Cole"}