{"songs": [{"title": "Friendz (Original Version)", "album": "The Pac & Biggie You Never Heard (Bootleg)", "year": null, "lyrics": "[Intro: 2Pac]\nPawhoo hoo hoo hoo\nI don’t wanna be your man, bitch\n(Fuck that)\nWhat you crazy\nI don’t wanna be your fuckin' man\nYou stupid you fuckin' idiot\n(Drunk ho)\nI wanna be\nYo let me fuck that nigga down\nWhat’s that?\nMy ghetto love song hahaha\n(Set it off, set it off)\nLet’s be friends\n(Where my niggas at)\n(Where my niggas, where my niggas)\nI know you wanna fuck\n(Where my niggas at?)\n(All my real niggas throw your muthafuckin' hands up)\nLet's be friends\nWhere my niggas, where my niggas\nHahahaha yeeeah\n(Let's go lets go)\nLet’s be friends\n(Throw ya hands in the air)\nThere’s no need to front\n(Let’s see ya just throw ya hands in the air)\nLet's be friends…\n(Westside in this motherfucker right here, Westside)\n(Throw ya hands in the air)\n\n[Verse 1: 2Pac]\nApproach you and post a minute, arm on my double-R tinted\nAs you pass bye, winkin' my eye, freshly scented\nWhat's the haps, baby? Come get with me and perhaps, lady\nYou can help me multiply my stacks, baby\nCurrency seems small, I need companionship\nThrough with that scandalous shit, I bet your man ain't shit\nSo why you hesitatin', actin' like yo' shit don't stink?\nCheck out my diamonds, bitch, everyone gonna blink\nThis be a thug thang, Outlaw nigga with riches\nCream dreamin', motherfucker, on a mash for bitches\nCheck my résumé, sippin' on Cristal and Alize\nSmokin' on big weed, keyed the Cali way\nDon't like trickin', but I'll buy you a fit\nI can't stand no sneaker-wearin' nappy head bitch\nLet my pedigree, read briefly, this O.G\nPuttin' bitch-made bustas to sleep with no grief\nMash on my so-called car, who the man?\nWhile I'm tuggin' on your main bitch head\nUnderstand this: Ain't no nigga like me, fuck Jay Z!\nHe broke and I smoke daily, baby, let's be\n\n[Hook: 2Pac]\nFriends\nThere's no need to front, let’s be friends\nI know you want to fuck\nLet’s be friends\nThere's need to front, let’s be friends\nI know you want to fuck\n\n[Verse 2: 2Pac]\nI met you and I stuttered in passion\nThough slightly blinded by that ass\nIt was hard to keep my dick in my pants\nEvery time you pass got me checkin' for you\nHardcore, starin' and watchin'\nMe and you, one on one, picture countless options\nWas it prophecy? Clear as day, visions on top of me\nErotic, psychotic, would possess my body\nFar from a crush, I wanna bust your guts and touch\nEverything inside you from my head to my nuts\nYou got me sweatin' like a fat girl goin' for mine\nJust a skinny nigga fuckin' like she stole my mind\nBack in time, I recall how she used to be\nI guess money and fame made you used to me\nWhat's up in 9-6? Fine tricks in drag\nFuck Dre! Tell that bitch he can kiss my ass!\nBack to you, my pretty ass caramel queen\nGot my hands on your thighs\nNow let me in between as\n\n[Hook: 2Pac]\nFriends\nThere's no need to front, let’s be friends\nI know you want to fuck\nLet’s be friends\nThere's need to front, let’s be friends\nI know you want to fuck\n\n[Verse 3: 2Pac]\nCan you imagine me in player mode, rush the tricks\nI got her ready for a booty call, I fucked your bitch\nWas it me or the fame, my dick or the game\nBet I scream 'Westside' when I came, Westside\nScream my name because, baby, it's delicious\nGot a weak spot for pretty bitches\nUp and down, similar to switches\nMy movement, baby, let your back dip into it, make it fluid\nIn and out, all around when a nigga do it\nYou've got me high, let me come inside!\nI love it when you get on top, baby let me ride!\nWho wanna stop me? Am I top notch?\nFuck player hatin' niggas cuz they cockblock\nYou probably hate to see a real thug with vision, what's the game?\nRather see a nigga up in prison, why you change?\nMade a living out of cuss words, liquor and weed\nA bad seed turned good in this world of G's\nBaby's got me fantasizin', seein' you naked\nIt's a fuck song, now check the record\nLet's be friends!\n\n[Outro: 2Pac]\nHey we fin to do this shit long stroke style\n(Where my niggas at? Show me where my niggas at)\nBaby long strokes\n(Where my bitches at? Show me where my bitches at)\n(Thug style)\n(Where my people at? Show me where my people at )\n(Where my people at? Show me where my people at)\nLet's be friends\nWestside in this mother fucker right here\n(Where my people at? Show me where my people at )\nWestside in this motherfucker\n(Where my people at? Show me where my people at)\nWestside in this motherfucker right here\nWestside in this motherfucker\nWestside in this motherfucker right here\nWestside in this motherfucker\nWestside in this motherfucker right here\nWestside in this motherfucker\n(Let's be friends)\nBe friends, tell me where my niggas at\n(Westside in this motherfucker)\nBe friends, tell me where my bitches at\nBe friends, tell me where my people at\nMake money, take money\n(Be friends)\nMake money, take money\n(Be friends)\nMake money, take money\nMake money, take money\nMake money, take money\nMake money, take money\nMake money, take money\nCome on, get your cash on\nLet's get paid", "image": "https://images.genius.com/d2c45ba5a5360d934b6c8f30e1fea115.168x168x1.jpg"}], "artist": "2Pac"}