{"songs": [{"title": "Born to Love You", "album": "10", "year": null, "lyrics": "James Todd Smith, knowhatI'msayin?  Trackmasters\nFresh off the private jet from Europe - did four months out there\nExtra paper, scoop that up\nBack on the scene, crisp and clean\nYou know how we get down baby, let me tell you a lil' story\n\n[LL Cool J]\nYou're not a chickenhead goin \"hee-shey\"\nYou're choosy in the bed like \"hee-shey\"\nI know your man's in the feds but \"hee-shey\"\nI can't figure out the reason you keep hawkin me\nIs it the.. invisible settings on the baguettes?\nThe Benzes, Beamers and Corvettes?\nOr the.. wood-grain in the convertible Lex\nBe ease, shoppin sprees, what designer is next?\nIs it the.. Diablo, parked on Rodeo?\nHalf a mill' in the trunk and I ain't moved no llello\nCould it be I'm.. anti-pimp, hundred-thousand a clip\nHat low, doin donuts when I pull up out the dealership\nIs it the.. the Fortune 500 covers?\nThe family man that got one baby mother?\nThe way I brainwash y'all to love one another\nAnd got the whole community bouncin in unity\n\n[Chorus 2X: LL Cool J] + (girl)\n(Born to love you baby) Why?\n(You know I love you baby) Why?\n(Kiss and hug you baby) Why?\n(I'll always love you baby) Why?\n\n[LL Cool J]\nHmm.. you're not a chickenhead goin \"hee-shey\"\nYou're choosy in the bed like \"hee-shey\"\nI know your man's in the feds but \"hee-shey\"\nI can't figure out the reason you be hawkin me\nIs it the.. twenty million I be grabbin a flick?\nOr my four-hundred million dollar FUBU clique?\nIs it the.. \"In the House\" syndication chips\nPoppin two bottles, shorty read my lips\nThey say Ladies, Love, Legend in Leather\nSimple ain't it... uh, but quite clever\nIs it the.. fact I melt in liquid ice?\nTapped it once, you felt it twice\nIs it the.. multiple O's I'm known for those\nTemptation Island, wildin cause my neck froze\nIs it the.. bowlegged, hard-headed\nLittle honey in my grill with her pinkies wetted?\nForget it\n\n[Chorus] w/ variations\n\n[LL Cool J]\nMmm.. you're not a chickenhead goin \"hee-shey\"\nYou're choosy in the bed like \"hee-shey\"\nI know your man's in the feds but \"hee-shey\"\nI can't figure out the reason you keep hawkin me\nIs it the.. way I caress and hold you close?\nThe iller, villa in Barbados?\nIs it the.. Countache rollin up to your door?  Yeah\nTell your roommate you ain't dancin no more, yeah\nTell 'em your new man is cooler than before, yeah\nTell 'em bout them twenty-thousand on tour, yeah\nIs it the.. the way that I defend your honor?\nBackhand your ex-man, tell him kill the drama?\nIs it the.. way the Mazerrati hug her body\nMake you wanna be my next hottie, uh-huh\nFrom the bottom to the bottom to the top to the top\nCruuuuuuuise.. it don't stop\n\n[Chorus]\n\n[Chorus] w/o LL Cool J {*1/2*}", "image": "https://images.genius.com/4f8b990045f8d7f5532831376c6d5cbc.500x500x1.jpg"}], "artist": "LL Cool J"}