{"songs": [{"title": "I’ll Be Damned", "album": "D12 World", "year": "2004-04-27", "lyrics": "[Intro: Proof]\nYeeaah! This is DJ Seven Deuce, live at\nClub Runyan, where all the girls with burgundy hair get in free\nG-Unit in the house! What up baby\nPerforming live tonight live on stage... Captain Save-A-Ho\nAnd the fabulous Case y'all, stick 'em out y'all\nAll my Detroit players, let's go!\n\n[Hook: Kon Artis]\nI ain't set the stroke and I ain't for games\nI just came to fuck and maybe get some brain\nI got a woman at the crib so I ain't your man\nI'll be damned, I'll be damned, I'll be damned\nYou know all I really wanna do is fuck\nI ain't gon' let a money hungry women set me up\nAnd if you think I'm that stupid you done pressed your luck\nI'll be damned, I'll be damned, I'll be damned\n\n[Kon Artis]\nYou damn right, yes I love menage-a-trois\nAnd I got drawers as big as guys's big \"wah\"\nI'm a Trick Daddy nigga, so bitch how you figure\nThat I wouldn't turn my niggas on to you when I hit ya\nI probably could forget ya if I hadn't been drunk\nBut your badunkadunk, keep my mind on hump\nWhen my mind's on hump it mean my .9's in the trunk\nAnd Denaun got a line for every fine bitch I hunt\nNot once, twice, but three times the lover\nThat your man is, and I'm a freak undercover\nI got plans for you, trick, I don't need a baby mother\nI got five of them motherfuckers trying to smother me already\nWe can't go steady, but you can give me head\nGive me that, get the hell out my bed, and leave the shed\nMy chapped lips will cut nipples when breast fed\nAnd on the way, leave the bread with Achmed\nI'd love for you to stay but I got another date\nWith a fat chick that eat cake on playskates\nShe rubbed my funky ass feet and feed me grapes\nPlus my man in the closet ran out of videotape\n\n[Hook]\n\n[Swift]\nI'mma make this one thing clear\nAin't no woman here gon' ruin my career\nAll the hell you doing is pursuing a dream\nThat's when you find out that life ain't truly what it seems\nAll these hoes be lying, bullshitting each other\nAnd why the hell Kobe Bryant didn't wear a rubber?\nHe might as well have went and told the ho that he love her\nI'm sure as hell ain't gonna go to court for my mother\nOr my wife, and my sisters, so motherfuck a mistress\nThey signing a contract before these bitches hit this\nNever will a woman take me out that way\nI keep a RCA camera in their motherfucking face\n\n[Hook]\n\n[Bizarre]\nWhat's your name again? It doesn't matter\nMy name is Bizzy, a bodyguard for Mr. Mathers\nSit down girl, let me get you a drink\nI'mma buy you a mink, and rape you on the sink\nFrom day one, I knew you was a ho\nI put a rubber on my toe and fucked you some mo'\nTurn around, let me see your nasty ass\nPut on a Jason mask while I take off your maxi pad\n\n[Kuniva]\nThese hoes be on some bullshit, always trying to pull shit\nOutta they ass, get mad and put you on blast\nTell 'em bitches how she fucked you, sucked you, put it on you\nBoned you, yapping off with they mouth, saying she loved you\nAll on your dick, calling your phone, spazzing and shit\nHaving a fit until you feel like calling it quits\nThen she starts calling your chick wanting to fight\nEvery time you show up at a gig she front row with her friends\nFlipping you off follow you to the bar, the bathroom\nThe parking lot, to the car, pissing you off\nUntil you blackout, now you and the ho is having a scrap out\nYou get locked up for assault and now you assed out\n\n[Hook]", "image": "https://images.genius.com/6246e5d82871d591568c0f8881ed9690.1000x1000x1.jpg"}], "artist": "D12"}