{"songs": [{"title": "Richard (Solo Version)", "album": null, "year": null, "lyrics": "[Hook]\nSo, Just call me Richard, cause I'm a dick\nIt's also Richard cause I feel like you should\nPry your fucking mouth up off of it\nI said just call me Richard, cause I'm a dick\nYou ain't gotta be no detective to figure out I'm a dick\nWhen I hold my privates to your first clue, Sherlock, prick!\n\n[Verse 1]\nAnd I would like to introduce myse-self, surprise! Hi, it's Ike\n'bout to get my Ike on I come with a life supply of wife beaters\nAnd my Nikes on and a white tee over that iron mic\nLookin' fly tonight, feel like I might die from a spider bite\nCome back as Spider-Man, park my Peter inside a dyke\nBitch actin' like she got fuckin' higher standards than Meijer's, right\nHad to pry her fingers off the mothafuckin' Breyer's ice cream\nWith the pliers, like \"Ahh!\" only a ruthless bastard would do this\nTake a toothless bitch with no taste buds to Ruth's Chris\nGive her toothpicks, stop on the way home, pick up two Big Bufords\nScrupulous, girl, you got a nice pair, but you're plumb stupid!\nSo when I pull up in that Benz, don't try to pretend you ain't interested\nTo impress your stupid ass friends and refuse to get in woman\nAnd get slammed on the ground and snap like a pool stick against cement\nIf you sick of dick, pretend it's a musical instrument\nYou get one shot, do not miss your chance to blow\nI can tell at first glance you're a ho cause your pants are so tight\nWhen you dance with O. Trice, your implants explode\nSo cold to dykes, the chance is snow in San Francisco\nBoy I'm from Detroit city, you live in animosity\nThat's a fucked up state to be in, such an atrocity\nLook where these random thoughts get me in senseless mind babble\n\"What me? Apologize?\" That's just the way the rhyme unravels\nAnd I wouldn't fucking take it back if I time traveled!\n\n[Hook]\nSo, Just call me Richard, cause I'm a dick\nIt's also Richard cause I feel like you should\nPry your fucking mouth up off of it\nI said just call me Richard, cause I'm a dick\nYou ain't gotta be no detective to figure out I'm a dick\nWhen I hold my privates to your first clue, Sherlock, prick!\nJust call me Richard", "image": "https://images.genius.com/b379811c1415017b9f3e3a71b9d26060.400x400x1.jpg"}], "artist": "Eminem"}