{"songs": [{"title": "72nd & Central", "album": "Searching for Jerry Garcia", "year": "2005-08-09", "lyrics": "[Skit]\nMr. Lennon, Mr. Lennon!\nJohn John, could, could I get your autograph?\nCould I get your autograph? (Sure kid)\nOh, yeah yeah yeah, just\nCould you sign this for me please? (Sure, what's your name?)\nThanks thanks, I'm a real big fan, thanks thanks\n(Here you are) Thanks a lot!\n\n[Intro: J-Hill]\nWord uhh\nCould do that, hot as hell though\nYo.. yo, what, uhh.. what\nBella{?} hop to this, what, uhh, uhh\nSet it down dawg, what..\n\n[Verse 1: J-Hill]\n(One by one) Rule one up in this bitch for real\nRoll with a couple niggas like Dave SeVille\nCause they'll, uh - clean you out like some golden seals\nPut your hands up, give me yo' scrill nigga, uhh\n\n[Verse 2: Obie Trice]\n(Two by two) Your bucket is clean, you ridin mean\nPull up at the light on them Spree's (gimme that!)\nSchool Craft wanna jingle your keys\nWhatchu 'bout to do? Bleed!\n\n[Verse 3: Proof]\n(Three one three) Y'all don't run the streets, the streets run you\nPut a gun to your kids, \"Art of War\" Sun-Tzu\nIn the jungle stay humble or stumble and fumble\n'til death inside a rumble\n\n[Verse 4: J-Hill]\n(Four by four) Rule four better get this down\nBefore niggas gon' beef better have that four-pound (uhh)\nAnd bust like four rounds, kick the door down\nGet yo' ass up outta town nigga, uhh, uhh\n\n[Verse 5: Obie Trice]\n(Five by five) Niggas connive, I thought you knew it\nYour main man's settin you up nigga you blew it\nTold him what you doin, nigga, you're ruined\nYou ain't knowin?\n\n[Verse 6: Proof]\n(Six six six) The Devil's your man, the ghetto's your land\nWhen you got knocked yo' block turned yellow and ran\nWhen you got sugar, why settle for sand?\nNever snitch when you clip and put your melons in cans\n\n[Verse 7: J-Hill]\n(Seven by seven) Rule seven kinda where my heart at\nYou want beef in the street? Don't start that\nCause we'll have some niggas up in yo' apartment\nJumpin outta places where it's real dark at, uhh\n\n[Verse 8: Obie Trice]\n(Eight by eight) You're carryin weight, hey, but wait\nA lot of hungry niggas know where you stay\nAddress your address, change your place\nBefore you spray nigga\n\n[Verse 9: Proof]\n(Nine by nine) I learned a lot from stank if you got bank\nFuck buyin gats bitch, get a tank\nFuck a firearm, get a wired bomb\nCause when you blow yourself up at least you dyin warm {*explosion*}\nTen jewels\n\n[Chorus: Proof & J-Hill]\nTen reasons, nine Glocks, eight shots\nSeven cops, six drop on five blocks (For sho'!)\nThree cousins, two/too hot, one law, family\nWe put no man befo', ten jewels now tell 'em\nIt's one purpose, one goal, two halves\nGet a whole, three niggas, one song (For sho'!)\nFive ways, six days, seven plus\nEight/A.K., we can let the nine spray y'all\n\n[Verse 10: Proof]\n(NIne by nine) Oh I'm not real cause I pop pills?\nBring your block to my block nigga get your whole block killed\nDon't let the \"Purple Pills\" shit confuse you\nOne outta my hand, the life'll lose you nigga\n\n[Verse 11: Obie Trice]\n(Eight by eight) You lay at your wake\nYou was played, slugs struck the Escalade\nYour brain rest on what Motor City paved\nNo more sunny days\n\n[Verse 12: J-Hill]\n(Seven by seven) Rule seven, some'in you better tell 'em\nGood coke, good weed, y'all better sell 'em\nCause they'll put some'in up into your cerebellum\nProof, you better tell 'em\n\n[Verse 13: Proof]\n(Six by six) Assume it's only for conversation\nLet's conversate, simple nigga the .38 indiff'\nMine'll set trip, empty out the clip\nHold up, a .38 ain't got clips\n\n[Verse 14: Obie Trice]\n(Five by five) Niggas be live before they die\n'til the test the wrong animal then they spirit fly\nJust know the game while you playin the tough guy\nThat's yo' life\n\n[Verse 15: J-Hill]\n(Four by four) For all you niggas think this rap shit's a joke\nYou get smacked and choked, bring the dagger and cloak\nI put my fuckin heart into this shit that I wrote\nYou muh'fuckers on some dope?\n\n[Verse 16: Proof]\n(Three by three) Watch who near you, focus on your rearview\nOutta life, yo the trife wanna clear you\nDon't get caught on E and fought on streets\nBe a victim of \"Grand Theft Auto 3\"\n\n[Verse 17: Obie Trice]\n(Two by two) Trust no one when you're gettin them\nPut your life in perspective, you're killin 'em\nEnvious niggas stay jealousy driven\nNiggas need to be listenin\n\n[Verse 18: J-Hill]\n(One by one) It's one reason why I still let you breathe\nIt's one reason why the fuckin tec won't squeeze\nIt's one reason why you ain't go out like N*Sync\nThat's cause it's one other nigga that'll do it for me, yo\n\n[Chorus: Proof & J-Hill]\nTen reasons, nine Glocks, eight shots\nSeven cops, six drop on five blocks (For sho'!)\nThree cousins, two/too hot, one law, family\nWe put no man befo', ten jewels now tell 'em\nIt's one purpose, one goal, two halves\nGet a whole, three niggas, one song (For sho'!)\nFive ways, six days, seven plus\nEight/A.K., we can let the nine spray y'all\n\n[Outro: Proof]\nTen jewels...", "image": "https://images.genius.com/ab9a6517cd52ed1370641d9d44571fdd.500x500x1.jpg"}], "artist": "Proof"}