{"songs": [{"title": "2Pac and Biggie (Freestyle At Table)", "album": null, "year": null, "lyrics": "[Intro: The Notorious B.I.G. & 2Pac]\nReady nigga? Ready for that raw dog shit nigga?\nOkay, all right, let me see how I'ma hit you wit'. You wanna set it off?\nAyy, I'm scared to do some freestyle\n\n[Verse 1: 2Pac]\nI'm scared to do some freestyle flow\nI'm too high and I might go off-tempo\nBut now I'm back to let these niggas know just how deep\nMy game run, 2Pacalypse don't sleep\nI keep a motherfucking Glock in my car\nIf I'm holding in the club, I gotta be the fucking star\nSo everybody wanna smile, and raise they hands\nI got a razor, 'case I gotta do a necks (next) man\n'Cause you know how niggas be, they wanna see\nIf Pac is real or is he like that nigga in the movie\nI guess I gotta prove my point\nSlicin' motherfuckers, now I'm doing the joint\nI got my nigga B-I to the G beside me\nBitches on my dick, you know them hoes wanna ride me\nAnd my other homies out here like Spike Lee\nThey got the camera on a nigga guess they like me\nBut now I'm bout to pass this motherfucker on\n'Cause this Tanqueray is getting hella strong\n\n[Verse 2: The Notorious B.I.G.]\nMoney, hoes and clothes\nBlunt smoke coming out the nose is all a nigga knows\nFlippin' on foes, puttin' tags on toes\nWatchin' the stash grow, clockin the cash flow\nThe neighborhood gravedigger\nGettin' paid so much all the bitches wanna see a nigga\nI guessed they figured I'm paid I wanna get laid\nOr since I got loot I wanna knock boots\nHuh, I rather beat my dick than trick\nAnd if she don't suck then we don't fuck\nHuh, I rather lick a buck drive a fat ass truck\nGrab the nine, two clips and run them up\nYes, flex out the 2 or 3 benz's since I wreck shit\nWhat the fuck you expected?\nA fly guy, well fuck it I'ma high guy from Bed-Stuy\nPuttin' the swellin' on your eye\nAnd your nose even, when I choke ya you stop breathin'\nAnd when police come, I'm leavin'", "image": "https://images.genius.com/1d135548fb08d908e384a804522bcea3.639x624x1.jpg"}], "artist": "2Pac"}