{"songs": [{"title": "Shadows On The Road", "album": "K.O.D.", "year": "2009-10-26", "lyrics": "[Hook: Krizz Kaliko]\nI see shadows on the road again\nWonder if they comin' for my soul\nI get trapped up in this mode I'm in\nAnd will I ever grow old?\n\n[Verse 1: Tech N9ne]\nI 'member them high nights, on X we find sites\nTo climb heights, unheard to man we lined white\nMolly up it had to be non-flight\nMix it with weed and wet it's chronkite\nThat shits beyond hype\nSpittin' somethin' we be trippin', seeing some shit\nAnd it's fuckin' up the buzz of me and the clique\nSo we hop up in the whip and flee with the quick\nBut the shadow make us swerve and we on the strip\nDid you see the shit? (Yeah I saw the shit)\nDid y'all see the shit? (Yeah we saw the shit)\nAll agree that a shadow was crossin' the street\nThen immediately vanished we need a hit\n\n[Hook: Krizz Kaliko]\nI see shadows on the road again\nWonder if they comin' for my soul\nI get trapped up in this mode I'm in\nAnd will I ever grow old?\n\n[Verse 2: Tech N9ne]\nIs it comin' for me because of all the shit\nThat I did in the past was bad to people\nMad and evil, if you're the A.O.D. I'm sad to meet you\nAngel of death when I quit doin' X\nBecause of seeing you every night on the stretch\nSo I've been clean for three years\nAnd counting still I'm seeing shadows will they scheme for me\nTo follow them into the pit of despair\nPunishment for what I did in this lair\nWhat if evil spirits live in the road\nTo take the kindred spirits' polluted souls\nI don't know how the spirit thing goes\nReal or livin' in my frontal lobe\nWill I be livin' life until I'm old?\nOr will I be takin' by shadows on the road?\n\n[Hook: Krizz Kaliko]\nI see shadows on the road again\nWonder if they comin' for my soul\nI get trapped up in this mode I'm in\nAnd will I ever grow old?\n\n[Outro: Tech N9ne]\nI be coming home from the studio\nSeventy East real real late, you know?\nDamn I see like a shadow walk right in front of the car\nLike what the hell, you know I be trippin' man\nLike I thought I just saw something\nSwerve real quick, good thing there ain't no other cars on the road\nFucked yourself up\nAnd I be thinking like the people that wrecked on the side of the road or something\nYou see those crosses and their names and the roses and you be thinking it might be their spirits\nI don't even know if most spirits exist\nI don't even know, I don't know what the hell happened man\nIs still haunts me to this day if it is a spirit or whatever it is\nIt's crazy", "image": "https://images.genius.com/de5c12836aa9b9bbb55356aafbf1fa0a.900x900x1.jpg"}], "artist": "Tech N9ne"}