{"songs": [{"title": "Angels (Remix)", "album": "Enemy of the State: A Love Story", "year": "2009-11-26", "lyrics": "[Verse 1: Lupe Fiasco]\nI see, diamond flooded demons, Lamborghini angels\nHalos down with the doors flapping when they came through\nWindows up, system bumping, you the one they sang to\nSame two, who said they the ones you should send your thanks through\nPockets full of blessings, they can sanctify and saint you\nYou can hear them revving/reverend up in heaven now, can't you?\nSandals made of chrome, his soul made of leather\nAn engine full of sinning and candy painted feathers\nThe sound of the motor only revving/reverend you confess to\nI see this all in the eyes of the girl I'm next to\nI asked her \"Where we going?\" and she just told me \"Pleasure\"\nHands on the wheel and her heels on the acceler-\n-rator, told her wait up, she kept going like et cetera\nOr like a broken record, we've come too far to just wheel it back selector\nSo we going ride forever, forever, forever, forever, forever\n\n[Diddy]\nIt's that Dirty Money...\nCame from heaven just to sing a song for you...\nTo the rhythm of my love for you, and now it's beatin slow\nAnd you know, this the ennnnd of the road\nWhen I sing that slow song for you...\nAnd love was nothin but another gun for you ('nother gun for you..)\nAnd I would hide it in my helpless soul\nI'm not afraid to go down the road where we go\nI don't know, you can hear 'em callin, don't you?\nWhen the angels call like..\n\n[Hook: Diddy] (Dawn)\nYou!\nIf you don't wanna stay you can go, oh\nIt seems love don't live here no more\nThe angels are flyin so loooow, singin to you\n(Don't you hear me callin you?)\nHe's the one you love... (cause I hear 'em callin me...)\nAnd he's the one you trust... (...like our time is almost through)\nTime is runnin out (There's nothin left to do)\nWhen they're callin you...\nWhen the angels call like.. (I answeeeeer)\n\n[Verse 2: Lupe Fiasco]\nUh, said she was a fan of mine\nKnew she was New Jersey, but said that she was Anaheim\nButterflies turn to suicides, now it's phantoms flying\nUsed to whisper in my ear, but now she trying to Vander mine\nThat holy feeling/Holyfield all gone, slowly feeling all wrong\nNone of this is satisfying, pull it over, let me out\nI'll just hitchhike back to mine\nNothing's really as it seems, yeah I should of known that\nThought I called a angel, devils had my phones tapped", "image": "https://images.genius.com/dcbb549a53afaa700a208dd2d3d2231d.500x500x1.jpg"}], "artist": "Lupe Fiasco"}