{"songs": [{"title": "Running Your Mouth", "album": "Duets: The Final Chapter", "year": "2007-03-06", "lyrics": "[Notorious B.I.G.]\nWhere Brooklyn at? Where Brooklyn at?\nWhere Brooklyn at? Where Brooklyn at?\nWhere Brooklyn at? Where Brooklyn at?\nWhere Brooklyn at?\n\n1, 2, 3, and...\n\n[Fabolous]\nNow they say you ain't never suppose to envy no man\nCan't tell that to a dingy old man\nWho see a young nigga getting plently dough man\nIcy Audemar, Henny gold band\nWith a mean girl like Lindsay Lohan\nThat's why I keep the 9 in the Bentley door pan\nTrust it's gon' bust you roll on us\nKnow it's gon' blow for my dough\nWhy would you try with that guy\nScene told you he keep it G\nWe can bang like the two chains on my neck\nThe hood is Iraq I'm Hussein in the 'jects\nThe coup's up take the new Lame for a sec\n12\" up, new cane in the deck nigga\nRight now with a squeezer in a coozie\nAnd I'm goin out like Keyshia with the uzzi\n\n[Hook]\nThey talk about it, we all about it\nThey making plans, we sit and counting\nOur cheddar stack it's just like a mountain\nYou heard about it cause she running her mouth\n\nShe want's to ride, and she's trying to hide it\nI'm cool as ever, she's too excited\nHer man look like, he want to fight\nBut he ain't doing nothing, but running his mouth\n\n[Notorious B.I.G.]\nFuck around and feel the fury of a high nigga\nWhen I get busy throw your hands in the sky nigga\nI got the illest of the ill mentality, niggas be grabbing me\nKnowing that they'd rather be stabbing me\nAll up in my back trying to take my track\nWhen I used to sell crack I ain't had problems like that\nStreet rules, watch your pockets and your jewels\nA nigga front, throw the gat to the fool\nNext who wanna move is getting blasted\nStreets to a flows from the ill ghetto bastard\nAs I release masterpieces like adhesive\nStuck to your ass, like tissue when your wiping fast\nMC's have a hard time believing\nI +Marked For Death+, +Hard to Kill+ like Steven\nWhen Jake come I'm leaving, the black man's motto\nYou got a better chance playing lotto\nWhat you want nigga?\n\n[Hook]\n\n[Busta Rhymes]\nAh, Yo\nNow watch me dip-dip-di-dive all over the beat\nNow watch me drip-drip-dri-di all over the street\nThe general consensus is you'll be the dominating fleet\nBitch raw, and let me continue to bring the heat\nYou know who been the kings of the block, the kings of the drops\nThe kings of the crack music and the kings of the clubs\nNiggas fire then drop shit like the purest of powder\nThat's why most of these niggas little song be sounding like ours\nCouple years ago, niggas probably thought I was dieing\nNow same niggas are idolizing put our face in the shrine\nYeah I took a little time to cook and show you what's really hot\nHow the fuck any of you niggas think you feeling my spot\nWhy you niggas getting mad at us, we shit on your floors\nAll in your house nigga, our strategies is different from yours\nListen, you come you can do it while I continue to preach\nSnoop, Fab, Big and Bust of the stand if you can't reach\n\n[Hook]\n\nUhhh, uhhh\nFox then B.I.G\nWho fucking with Fox, who want it with I\nBust a shot for me and Big from the villfredo sky\nGot my joan fross shit on, hop off my dick\nCanary bangle-round I ain't gon' 20 carrots on this bitch\nPull up the Phantom, show 'em how we switch\nFrom the Bentley blinds spur kill 'em with the six\nBedstuy what up y'all, what up with your girl\nHow she leave dude broke tell them boys on work\nI'm in the G5 jedi, Brooklyn what's your chrome\nCause that niggas lying home if the tutti with the dead-eye\nMy nigga Neck got hit up in his truck\nOn Nastrand Ave, ain't the same since Homo got touched\nNasty with the pistol, nasty with the clit\nSee I'm a beast with it, fucking 'til I'm crippled\nIll Na Na - squeezing the lhama\nBog roll dutty, Foxy and Poppa\n\n[Snoop Dogg]\nRun for your gun you suckers\nB.I.G. I'm a get them motherfuckers\nDon't you worry about a thing, bang-bang-boogie\nI got a few chickens that's gon' work that noogie\nIn the ' Lac with a sack go and put it on the mat\nWhat it do nephew (Where Brooklyn at?)\nUh, turning it out, run in your house\nGun in your mouth, motherfucker quit running your mouth\n\n[Hook]\n\nWhat you really want from a nigga?...", "image": "https://images.genius.com/584e1fe455c956b5192a59274912916e.220x220x1.jpg"}], "artist": "The Notorious B.I.G."}