{"songs": [{"title": "The Soundtrack", "album": "The Documentary 2 + 2.5 (Collector’s Edition)", "year": "2015-03-06", "lyrics": "[Verse 1: Game]\nPolitics as usual, them palm trees is beautiful\nCrack rock lingerin', fiends suckin' they cuticles\nWear the wrong colors 'round here, niggas is shootin' you\nNiggas workin' out in them pens, stuck in they cubicles\nNigga, you killin' who? Street shit, me and Meek shit\nFuck with him, fuck around and be your funeral\n\n[Verse 2: Meek Mill]\nHave your momma ten and two, with my homies spinnin' through\nDrive-by, layin' side by side as they viewin' you\nHa, cause you will ride for your nigga, right?\nNow with hearses side by side, with your nigga right\nCause it been plenty nights I barely made it through this life\nNiggas want to snatch my soul from me like I'm Jesus Christ\n\n[Verse 3: Game & (Meek Mill)]\nCompton, California, come and see what my city like\n(Babies losin' hope when they see they momma hit the pipe)\nRosecrans, (Berks Street), niggas tryin' to murk me\n(God, it hit me first, G)\n\n[Hook: Game & (Meek Mill)]\nThis right here the soundtrack to a real nigga life\n(Comin' from a city where they kill niggas like)\n\"La-da-da, la-da-da\"\nThe soundtrack to a real nigga life\n(Comin' from a city where they kill niggas like)\n\"La-da-da, la-da-da\"\n\n[Verse 4: Meek Mill]\nUh, my dog doin' life\nCause he ain't had no safety like the Rams' secondary\nAnd he come out in 2060, Nevuary, never scared\n\n[Verse 5: Game]\nCause I got real niggas everywhere\nThat'll cut your life short like it's February\nKiller Cali, where them burnouts is necessary\n'Specially when the feds is tappin' phones like secretaries\nShit real like 2Pac's obituary\nKill him, B.I.G. too, but they memory legendary\n\n[Verse 6: Meek Mill & (Game)]\nAnd where I'm from, you get murdered like hereditary\nThey killed my homie, we came back like it was January\nThe first nigga aimin' to murk, nigga\nFuck your chain, want your shoes, your jean and your shirt, nigga\nCause it's cold out, fuck your concert cause you sold out\nYour dad didn't teach you all that shit you sing that song 'bout\nSo what you talkin' about?\n(Absolutely nothin', they ain't us, Meek, fuck 'em, cause)\n\n[Hook]\nThis right here the soundtrack to a real nigga life\n(Comin' from a city where they kill niggas like)\n\"La-da-da, la-da-da\"\nThe soundtrack to a real nigga life\n(Comin' from a city where they kill niggas like)\n\"La-da-da, la-da-da\"\n\n[Bridge: Meek Mill]\nFrom Philly to Compton, nigga\nI fell in love with these streets, I lost my niggas too\nBut I'll be damned I'll let one of you niggas take my life\n\n[Verse 7: Game]\nMeek, tell 'em that I'm back on my grizzly though\nMost these rappers' life is like a fuckin' Miguel video\nCompton killed eight of my niggas, but that's my city though\nYeah, we movin' birds, but we throw 'em like a Frisbee though\nNiggas sellin' flat-screens, sixty-inch VIZIOs\nBlow on a stone, smokin' chronic on commodes\nListenin' to Hov like \"I got to get my weight up\"\nThe system was made to break us, but they can't take us, no\n\n[Verse 8: Meek Mill]\nAnd I know they hate us though cause we really made it though\nBallin' like we Jordan, niggas shootin', try and fade me though\nO.G. Bobby Johnson, .44 with the potato nose\nTurn you mashed potato, bro, but it's all gravy though\nI done been to church to mosque, it couldn't save me though\nShit, I got to save myself before I try to save a ho\nFuck your role model, it was gold bottles after the gold hollows\n\n[Hook]\nThis right here the soundtrack to a real nigga life\n(Comin' from a city where they kill niggas like)\n\"La-da-da, la-da-da\"\nThe soundtrack to a real nigga life\n(Comin' from a city where they kill niggas like)\n\"La-da-da, la-da-da\"", "image": "https://images.rapgenius.com/bfa8a0b538f09812ce1d8dabb2d621c2.497x498x1.jpg"}], "artist": "The Game"}