{"songs": [{"title": "I’m a Soldier", "album": null, "year": "1995-08-01", "lyrics": "[Hook: 2Pac]\n'Cuz I'm a soldier\nI just release 'em on a war path, not your average dealer\nI'm a soldier\nWestside Outlaw, Bad Boy killer\n\n[Verse 1: 2Pac]\nStarted off with, runnin from copses duck and hide from helicopters\nWe open fire, who can stop us\nLivin the life of trife juveniles, hopin for righteous\nGettin twenty-five to life, if the judge don't like us\nIn my clearest pictures, I see authorities itchin to get us\nATF state feds scandalous bitches\nI wasn't promised to it, wasn't bitter or sweet\nSee if a, nigga don't hustle then the nigga don't eat\nOnly streets livin do or die circle complete\nRepetitive motions and felons in the rush for cheese\nPlease understand my history a man of many acts\nLivin Thug Life, comin equipped, with many gats\nMaybe I was just a Lost Soul, trapped in time\nLivin in between life, and the cracks were blind\nEven though we had hope for dreams that never came\nYet and still we all feel pain\n\n[Hook]\n\n[Verse 2: Young Noble]\nMy brother Sean, first on my list, he stuck with\nA three-five when he get out would I be dead or alive\nHe taught me the rules so much, but still In Thugs I Trust\nWhen in danger never hesitate to keep my fuckin trap shut\nMy Mom Dukes got a little bit of Thug in her\nThe Devil loves sinners crackheads and drug dealer\nSometimes I feel like the streets are takin over\nNever stayin sober, the brain over and over backtrack\nMy stack's fat, I used to take new\n\n[Hook]\n\n[Verse 3: E.D.I. Mean]\nI was born twenty-two years ago, yesterday\nBut see I saw no reason for me to celebrate, let me demonstrate\nEntered the world from out a poisonous womb\nHeroin bein consumed already predicitin my doom, soon\nTo be one of the many misguided\nAlways the first one on the block to be done tried it and liked it\nLost before I had a chance to find my way\nNow I travel through life, not knowin the time of day\n\n[Outro: 2Pac]\nThug niggas screamin Westside, bustin double Glocks...\nYou gotta be soldiers alright!\nSoldiers!", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}