{"songs": [{"title": "What Can I Do?", "album": "Lethal Injection", "year": "1993-12-07", "lyrics": "[Intro: sampled announcer]\nIn any country, prison is where society sends it's failures. But in this country, society itself is failing\n\n[Verse One]\n\nTadow, how you like me now, I'm in the mix?\nIt's 1986 and I got the fix with the chicken and a quota\nGot the baking soda, let the water boil, workers all loyal\nDropped out the twelfth\nCuz my wealth is shorter than a midget on his knees\nNow I slang keys\nInfest my hood with crack, cuz I'm the mack\nTake a nation of millions to hold me back\nToo big for my britches, and I got bitches\nNow I'm hittin' switches, niggas want my riches\nUsed to get 18 when my G was alive, now a key is 13-5\n'89s the number, another summer\nPolice ain't get no dumber\nStreets dried up, used to think it would last\nBut being a king-pin is a thing of the past\nThey tried to blast me for slingin' a boulder\nNow I got my ass in Minnesota\nGot my own crew, it's on brand new\n\nDamn, what can I do?\n\nTadow...\n\n[Verse Two]\n\nAlready done stack me half a mill ticket\nBought a house next to Prince, so now I can kick it\nNow I got ends, wavin' to my friends, rollin' in my Benz\nGoin' to see the Twins, play at the dome\nPolice are tappin' my mobile phone\nI'm almost home\nGettin' excited, indicted, spent a grip and a year tryin' to fight it\nLawyer got paid, plea, no contest\nAnd everything I own got repossessed\nNow take a look at the dust\nAnd I'm happy cuz I only got 36 months\nNever picked up a book\nBut my arms are 16 inches, niggas look\nCan't wait for '92 so I can get with my crew\nAnd see, what can I do?\n\nTadow...\n\n[Verse Three]\n\nPhucked up in the pen, now it's ninety-fo\nBack in LA, and I'm bailin' in the dough\nEverybody, now I gotta start from scratch\nSo where to work at, and niggas smirk at\nMe say ain't nuttin' poppin from here to the LB\nWhat you tell me?\nNo it ain't crack, and everybody's jackin' for a coupe\nCuz, they sent in the troops\nEven tho I got muscle, that ain't my hustle\nTakin' niggas sh*t in a tussle\nNo skills to pay the bills\nTakin' 'bout education to battle inflation\nNo college degree, just a dumb ass G\n(Yeah you Nigga, who me?)\nI got a baby on the way, damn it's a mess\nHave you ever been convicted of a felony? Yes\nTook some advice from my Uncle Fester\nAll dressed up in polyester\nWelcome to McDonalds may I please help you?\nSh*t, what can I do?\n\nTadow...\n\n[Outro]\n\nThe white man has broke every law known to man to establish AmeriKKKa, but he'll put you in the state penitentary, he'll put you in the federal penitentary for breaking these same laws. Now we gonna look and see if this motherfucker is guilty for the laws he'll put you in jail for:\n\nDrug using, drug selling, armed robbery, strong armed robbery, grand larceny, rape, racketeering, conspiracy to commit murder, extortion, aggravated assault, mayhem, sodomy of the black man, trespassing, embezzelment, purgery, kidnapping, smuggling, grand theft, brandishing a firearm, carrying a concealed weapon, breaking and entering, and premeditated cold-blooded murder\n\nGuilty on every charge", "image": "https://images.genius.com/7130347bb47a4a618915a6de2818699a.1000x1000x1.jpg"}], "artist": "Ice Cube"}