{"songs": [{"title": "Long Hot Summer", "album": null, "year": null, "lyrics": "This right here go out to all the ladies\nWho cannot predict when the sun will shine\nJust make sure when it do, you bask in it\nYou embrace it, you let it hit you in the face\nHuh, you know what I'm talking bout\nYo, yo, ay, ay\nThe sun was in the sky\nI was bumping \"Sly Love\", hard to find in the summertime\nYou can spend a lifetime tryna predict when the sun will shine\nOr simply bask in it like the flowers that come alive\nSummer days always start extraordinary\nSummer nights there's water in the air, wish it would storm already\nI hit the corner store, I had a taste for strawberry quick\nSeen the broad, very tall, very thick, licking her lips\nHips barely fit through the door\nImagine that, she bought a dutch and a lemonade out the Escalade\nBumping \"Renegade\" by Em and Jay\nSymmetrical braids, incredible edible legs\nJust to track her down, I went on a ghetto crusade\nSerenade this angel like Cyrano de Bergerac\nThe lightness of her being was unbearable\nSo here I am at her apartment building, apart from feeling\n\"Heartless\" like Kanye with a talk-box\nI walked four blocks out my way cause her walk had me focussed\nHer scent had me open, and since we had a moment\nWhat I'ma say? Hey, I seen you in the store?\nShe went into a building and I had to guess the floor\nKnocking on every door, that took bout a half an hour\nTill she answered \"whoa\", was still soaked from the shower\nI seen some sour diesel broken up on my CD\nShe introduced me to her room mates, this Vanilla Dutch and this is Swisha Sweety\nI got you open yet?\nIt ain't over yet, I love you when you're soaking wet\nBeen looking for you like the bounty hunter Boba Fett\nI'm the one but you don't know it yet\nThe wettest skin, what a better beginning, she let me in\nLet us begin, perfect weather for sinning, my Seraphin\nWe on the floor, barely made it through the door\nNew high score, she never came like that before, wow", "image": "https://s3.amazonaws.com/rapgenius/talib-pic.png"}], "artist": "Talib Kweli"}