{"songs": [{"title": "Rapman", "album": null, "year": "2011-11-03", "lyrics": "[Intro]\nMeanwhile, back at the rap cave!\nJumping gee willickers Rap Man, you're never gonna believe it!\nWhat seems to be the problem my rap-tastic companion?\nI just found out there's a bunch of wack ass, no talent having, swear they can rap, 40-something, should've got a job, still living with their parents, so wack they couldn't even get the whole 15 minutes of fame, only got 2 minutes perpetrating bitch ass motherfuckers out there on the scene trying to make music!\nOh my god! (I know!)\nRapman will not stand for this! (Go get 'em!)\nTo the booth!\n\n[Verse 1]\nUh, now let me hop up in the rap-mobile\nGet so much pussy in the back, they should call it the cat-mobile\nEverybody's worried about a deal, but I keep it real\nFucking around and I hit you in the crown with an inevitable sound that's spreading through your town\nHold up! Gee willickers Rap Man, I don't think they comprehend or can begin to even understand\nWe don't fight crime, we fight whack rhymes, one song at a time, line after line\nHold up, motherfucker I'm 'bout to roll up, pull out the hammer on a bamma leave em tore up (Oh my god!)\nYeah you talk, but can you walk?\nLet's see you put the dough up (Cha-ching!)\nRhymes I throw up, a little nasty bastard (Yugh!)\nPeople hating on a brother just cause I mastered the flow\nLike Jedi, bet I, murder it before you heard of it, bitches I'm merking it\nGo berserk in the club while honeys twerkin' it\nHaters talking shit where they ain't no time for this, you know I'm bombing this, the flow is ominous\nSecond I'm rhyming this, sound like a dominous (Ching!)\nAll the people that was hatin' in the beginning, know that I'm winning\nLet me slip through your fingers and now your spinning\nYou can check the Polaroid pictures 'cause bitches I'm grinning, I got it\nTreat the game like a honey, I had to get inside it\nVisionary and Logic, is like two planets collided\nI'm a lyrical miracle, matter fact a paradox\nOn stage while my DJ scratching like chicken pox\nNever put me in your box, if your shit eats tapes\nI'm not bitin', only quoting one of the greats, now\nThe radio got me feeling disgusted, punch you in the snot-box 'til your brain concussed it\nWomen they lust it, when they guts get busted, rip it up and thrust it\nI'm the best, trust it\n\n[Interlude]\nOh my god! Rap Man, what have you done?!\nWhy, whatever do you mean, Rap Boy?\nNot only did you kill all the whack rappers, but my favorite ones as well! What were you thinking?!\nWell I just had to show these motherfuckers who's in charge\nWhat, by obliterating them?!\nWell how else was I supposed to let them know who's really running shit around here? (No)\nNo, no, you're out of control, you're drunk with power!\n\n[Verse 2]\nYo, let me get it, you know that I did it, my flow is outta this world, like the alien that spit acidic\nMiddle finger to the critics and as fresh as a fitted, soon as a bet, get the honeys wet, never upset\nWhen I catch wreck, like Bobba Fett down to collect\nDoes it even register that I ain't taken a breath yet?\nOh my god! Oh my god!\nWest Deer Park done raised the rap god\nMaryland I'm reppin' it, dare ya to step in it\nNone others iller for realer the killer slash drug dealer\nI get bitches erotic by slinging dick like a narcotic, you want it I brought it, hit the club and get the party started, yeah\nThe flows never ending, always ascending, while apprehending anybody who's partially comprehending\nFeeling limitless, quickly swallow the pill and enhance\nWith the killer stance, swallow the mic like a Neverland\nAll up in yo' bitch's pants, the second we dance I advance\nAt first glance go together like lettuce and ranch\nA born winner, schooling MC's like Principal Skinner\nHow I murder a kill-able syllable's are no beginner\nFeeling high style running through your stomach like hot bowel\nI'm the only human being'll perfectly rap this\nSo I'm coming for ya head like John the Baptist, is this\nThis is the rapture, no camera can capture\nAnnihilating anybody that's violating by hating\nI spit hotter than Satan, when he was migrating from heaven to hell\nStep to the mic and I shall prevail\nFinna blow your whole mind soon as time avail, what\n\n[Outro]\nHaduken!\nYou have interfered with our affairs for the last time\nLogic\nSinatra", "image": "https://images.genius.com/75b9fd3705271c3c10d64dfb3139caf7.900x900x1.jpg"}], "artist": "Logic"}