{"songs": [{"title": "Ballad of a Dead Soulja", "album": "Until the End of Time", "year": "2001-03-27", "lyrics": "[Intro]\nYeah, ballad of a dead soldier\nThis is the ballad of a dead soldier\nThis is the ballad of a dead soldier\nCome play the ballad of a dead soldier\n\n[Verse 1]\nThe plan, to take command of the whole family\nThough underhanded, to be the man it was planned\nAll my road dogs, official mob figures\nLove to act up, the first to bomb when we rob niggas\nI can be lost in my own mind\nTo be the boss, only thought's: grip on chrome 9's\nNiggas get tossed up, war scars, battlefield memories\nSwore I saw the devil in my empty glass of Hennessy\nTalkin' to a nigga on a tight leash\nScreamin' \"Fuck the police!\" as I ride through the night streets\nLittle child runnin' wild, towards danger\nWhat's the cause? Don't be alarmed, death to all strangers\nMaybe I'm a madman\nA pistol grabbin' nigga, unleash the Sandman\nPromise a merciless retaliation, nothin' is colder\nClose your eyes, hear the ballad of a dead soldier\n\n[Hook: singing + 2Pac]\nThug for Life, I will be\nThis is the ballad of a dead soldier\nA life of crime I will lead\nClose your eyes, hear the ballad of a dead soldier\nIf you play the game, you play to win\nThis is the ballad of a dead soldier\nIt's a crazy world full of sin\nClose your eyes…\n\n[Verse 2]\nCompletely lost, revenge at all costs\nPayback's a bitch, switched, now the trick's crossed\nTossed up and never to be heard of\nA single witness screamin', \"Bloody murder, murder!\"\nBlast, tell me, homie, what you see now?\nA blind man and a dead body, I'm ready to leave town\nAnd get my cash though, hook up with Kastro\nHomie had to blast on the task force\nStupid coppers tried to play us out, never that\nThey took my money and my stash, time to get 'em back\nUpon my secret arrival\nTwo Glock four-fives, time for survival\nDeath to my rivals – tell me, what you want, Lord?\nNobody left after the death of a drug lord\nThe situation's critical, nothin' is colder\nThan hear the ballad of a dead soldier\n\n[Hook: singing + 2Pac]\nThug for Life, I will be\nThis is the ballad of a dead soldier\nA life of crime I will lead\nClose your eyes, hear the ballad of a dead soldier\nIf you play the game, you play to win\nThis is the ballad of a dead soldier\nIt's a crazy world full of sin\nClose your eyes and hear the ballad of a dead soldier\n\n[Verse 3]\nBe a coward, put yo' hands to the moon\nWhen my Glocks rang out, the niggas came out, BOOM!\nWho wanna see me in a challenge?\nSo merciless, I'm terrifyin' niggas in my ballads\nDo you feel me? Capo or Capi-tan\nOne day I'll be the Don; until then, remain strong\nMy only fear of death is reincarnation\nBustin' at my adversaries like a mental patient\nTo all my niggas facin' 60 years\nSheddin' tattooed tears, another suicidal on the tier\nTakin' private planes, tryin' to survive the game\nFor all my homies that'll never be alive again\nAll they promise us is death, nigga\nTake a breath, come be the last one left, nigga\nIt's real now, feel it or fantasize it, ain't nothin' colder\nListen, you can hear it – the ballad of a dead soldier\n\n[Hook: singing + 2Pac]\nThug for Life, I will be\nThis is the ballad of a dead soldier\nA life of crime I will lead\nClose your eyes, hear the ballad of a dead soldier\nIf you play the game, you play to win\nThis is the ballad of a dead soldier\nIt's a crazy world full of sin\nClose your eyes and hear the ballad of a dead soldier\n\n[Outro]\nThis go out to Kato, Mental, all the niggas that passed away\nMutulu, Geronimo, Seyku – all the down-ass riders\nAll the niggas that put it down, all the soldiers\nAll the niggas that go through that day-to-day struggle\n(This is the ballad of a dead soldier!)\nAll the niggas that passed on\nAll the niggas with ambition and money in they heart\nAll the niggas that want some and that don't take none\nHahaha (It's the ballad of a dead soldier!)\nThe police are so scared of us\nAll the feds they aware of us\nThey wanna see us dead\nThey got pictures of a nigga head, (Ballad of a dead soldier!)\nTryin' to see me in chains, shit\nThem niggas'll never breathe again\nBefore they put me in a cell, they'll see me in Hell\n(‘Cause it's the ballad of a dead soldier!)\nGot my pistols cocked\nRun the whole motherfuckin' block; fuck the cops!\nThe police? We run these streets, nigga\n(Ain't heard the ballad of a dead soldier!)\nThese niggas can't see me, half the world wanna be me\nMulti-millionaire, shit, it ain't fair\nBut nigga, you know – it's the ballad of a dead soldier!", "image": "https://images.genius.com/74b94f4112372859edd6ae711af0df41.1000x1000x1.jpg"}], "artist": "2Pac"}