{"songs": [{"title": "Fire in the booth Freestyle", "album": null, "year": "2014-04-05", "lyrics": "Instrumental 1: Redman -- \"Tonight's Da Night\"\n\n[Intro: Joey Bada$$]\nMic check yo yo\nIts the Jozif Badman\nPE, Brooklyn look Check me out huh\n\n[Verse 1: Joey Bada$$]\nThese niggas they ain't  ready for the war\nKnow all about them niggas, close you drawers\nPlease put your bread up\nWe ain't gon' settle for no iceberg lettuce\nLet us eat when it's raw\nOr end up like venison meat in the street\nThey're not ready for beef\nLet the fish burn in the pot, niggas all in the spot\nWhen it turns 12 'o clock then, we'll be servin' the block\nYo cut this shit\nCause I'm the best in the sector\nGet your ear buds to grip, then I dissect ya\nInject ya with my lethal weapon\nPlant a mine in the deeper sections guess who's least expect it\nMotherfucker please respect it\nThe last one to pull my card was easily dealt with\nYou felt it this shit wreckers can't be reckoned with\nOn tracks wreckin' shit, ask me why I'm reckless\nBreak a wrist, approach my demo with a risk\nBrought my demo listens, I'm a demolition specialist\nI got the blueprints to the shit Jay to the O-\nIf blue was a prince I'm still Joseph Ko-\nKnow they can't ever little bro me\nNo matter how big they blow, they still a little below\nIt's the P-R-O E-R-A, indigo with the killer flow\nGuaranteed the realest that you ever saw\n\n[Verse 2: Kirk Knight]\nWe ain't done, no way to London\nYour lung done\nOne next question son is where you from\nFrom dust turn to dust and dust turn to O\nNever was a rusty type so I'm just pure gold, stainless\nClean sheets good arrangements\nAlready made my bed and laid in it\nNow I'm against the say in it\nI said it best I pawn in this game of chess\nI'm a King Luther my mind is my weapon\nAnd I'ma respect the shooter kamikaze yo\nKam kamasutra please my nigga use your mendulla\nI stay perfectiona-uh no dementia not to mention\nI keep that shit sapiosexual still rough around my edges\nService that ask tweety bird is this your favorite cartoon to blast?\nI lost my style cast away brace myself lime now\nWho's wide shook but now I'm free at last\nNow whats the problem now, no tape, no album out\nThese bad muthaphuckas they talked about\n\nInstrumental 2: Mic Righteous -- \"In A Gang\"\n\n[Verse 3: Joey Bada$$]\nI stand juxtaposed to all my Pro's, realest illest niggas I know\nSee these fool's bitin' the flows, they even jooks the pose\nI guess my CD really shakin' the coast\nCould this really be the year that I feast, capisce?\nNothin to feast, the beast, I speak my piece\nNo niggas in the streets that heat seek for me, release and squeeze\nMight put a Halloween between your spleen\nRetreat or trickle down to your last pound of green, know what I mean?\nShit it's like taking candy from the babies\nAll of these now rappers are a bunch of Now and Laters\nThey too sweet, plus they lease their Mercedes\nCan't be second greatest, I'm the best and def your favorite\nMy flow in-depth nigga, I got my wave up\nIt's either get your tidal waved, or you could be my neighbor\nCause if I can't eat, you can't either\nI need to know, need the pizza dough fuck I'm spittin' ether for?\n\n[Verse 4: Kirk Knight]\nSmoke a blunt as my palm to the face a quick change\nI'm banking my shot spray the maces never read reverchi\nDon't sell me dreams actin' like a fuckin' banshee\nUnderstand me rock in my ears so you hear\nWhat I'm dealin' with simplicity is key upon my simple shit\nOne sock on the foot, other on the mic pap filtered me from these\nPlease ride the dark knight\nTry to smoke me and try to [?] in a room full of roaches\nWatch how you approach me\nGetting antsy lies out the pennies\nSeem seventeen old enough for [?] Huh!\n\nInstrumental 3: Biggie Smalls -- \"Dead Wrong\"\n\n[Verse 5: Joey Bada$$]\nImma do it for my city on this one\nYou ain't running with the apes yet\nApex at the empire state neck\nHand no crown, my niggas take that\nIn this state of mind, gotta state facts, suspect nigga\nGet your wig pushed back tonight, to 1999\nWho'd've thought that 19 I might be in my prime\nThought of the right scheme, everything else align\nHere's a penny for your thoughts, another one, another one\nEventually the dream was bought\nNow that's a real, real, real mind fuck\nMight fuck up your mind if you're lighting up\nMake sure the ting is tight enough\nIf you tough\nI'm a titan, like Zeus I enlighten them\nKick flows till it's kung-fu fighting them\nIs it him, it is you who was nice as him?\nI don't see nobody no, no\nI don't see nobody no, no\n\n[Verse 6: Kirk Knight & Joey Bada$$]\nI look at the world like Donnie Darko\nThe flow cuckoo and I don't really care\nI don't chuckle I don't smile\nNo fuckin family no friends and no attire\nI be up in the black timbo up that's entire\nYour attire my mic is never tired\nIt never retire your time's expired and you's a liar\nI punch liars through my punchlines with the choirs\nBitches sitting quiet cause I had her on desire\nYo, I guess it's time to watch this citizen\nJust come off straight up off the block\nAnd become that star that everybody watching\nCatch me on the red carpet\nTo be a citizen, are you gonna really sit or stand?\nSee it in the end on CNN and Channel Five again\nTry to come all the way for first place\nBut I can't relate your time slate comin' back huh\nYou plates gone I comin' through\nNever mistake Don with Jig want\nWith the beat with the flow he enticing\nThese niggas never like them\nYes he's so enticing\nAll these motherfuckers don't like them\n\nInstrumental 4: Paper Aeroplane ft. Splurgeboys -- \"WTF\"\n\n[Verse 7: Kirk Knight & Joey Bada$$]\nI blow more O's than your circus\nNo wild with the churches\nYou see us lurkin' and I never make a purchase\nPut my god over that see me I'm a maverick\nChillin' with the maverick the sabertooth we at it\nBack at it we rapping niggas on the radio spazzin'\nTo my radio waves can't get my wave lengths gotta get it back huh\nRight here man oh bring it back\nThrow it like a baseball bat\nIt don't really matter where you at\nBaby girl come fuck in the back\nIf you fuck in the back then\nI guess that its mac\nAnd I guess it's mac and I guess that\nI got two stacks in my Cadillac\nIn the black and I got the drop-top too\nDouble entendre\nI keep that three stacks\nIn my pocket in my wallet\nWith the wildsack\nI call my aunt Sandra\nWhere my laundry at?\nThese niggas getting washed I don't need no starter cap\nWall of sin and all the sins\nAll the sins in the world couldn't\nEven repent against him", "image": "https://images.rapgenius.com/66a9d35d35c50af238e495c00a7424d8.1000x563x1.jpg"}], "artist": "Joey Bada$$"}