{"songs": [{"title": "Survival", "album": "Scorpion", "year": "2018-06-29", "lyrics": "[Intro]\nI been waitin' on this\nYeah\n\n[Verse]\nAll of this disorder, no addressin'\nThe crown is broken in pieces, but there's more in my possession\nThere's a whole lot in my possession\nWho do you really love? Well, that's sure to be in question\nMy Mount Rushmore is me with four different expressions\nWho's givin' out this much return on investment?\nAfter my run, man, how is that even a question?\nAfter this summer, man, how is that even a—\nI've had real Philly niggas try to write my endin'\nTakin' shots with the GOAT and talked about shots that we sendin'\nI've had scuffles with bad boys that wasn't pretendin'\nI've had too many nights to mention, that's just the beginnin'\nI'm pretty sure we got a label, I'm still independent\nI fell back a hundred times when I don't get the credit\nSeen this movie a hundred times, I know where it's headed\nRealize someone gotta die when no one'll dead it\nNiggas gamblin' with they life for some content\nThat's the type of lottery that could get your top picked\nI am a cream-of-the-crop nigga\nYou niggas pop mollies, my Mali's pop niggas\nHouse on both coasts, but I live on the charts\nI have tea with the stars and I swim with the sharks\nAnd I see in the dark, wasn't this cold at the start\nThink my soul has been marked, there's a hole in my heart\nYeah, I was about to— Man, I thought about it\nIt's unsettlin' to talk about it\nFree all of my niggas that they caught with it\nR.I.P. my niggas that they caught without it\nThis just the intro, let me not get ahead of myself\nThis is God's plan, young man, you said it yourself\nAlways got a ace up my sleeve for whatever was dealt\nDaddy got suits like Bernie Mac, he dresses himself\nI stopped askin' myself and I started feelin' myself\nNow I gotta deal with all this drama and deal with myself\nI ain't even have to cut the tie, it severed itself\nThis just the intro, let me not get ahead of myself", "image": "https://images.genius.com/2fee80dd9aec0717aef8e1eb7aaaae4c.809x809x1.jpg"}], "artist": "Drake"}