{"songs": [{"title": "True to the Game", "album": "Death Certificate", "year": "1992-09-14", "lyrics": "[Intro]\nAy, yeah you, motherfucker. You know who I'm talking to. Yeah, you that motherfucker that betrayed your homeboys and you ain't shit! Yeah, you about to get your motherfucking ghetto pass revoked, motherfucker. Punk-ass mark, bitch-made. Punk-ass trick in a basket... You got caught up in the mix\n\n[Verse 1]\nIt's the nigga, ya love to hate, with a new song\nSo what really goes on?\nNothing but a come-up, but ain't that a bitch\nThey hate to see a young nigga rich\nBut I refuse to switch even though\nCause I can't move to the snow\nCause soon as y'all get some dough\nYa wanna put a white bitch on your elbow\nMoving out your neighborhood\nBut I walk through the ghetto, and the flavor's good\nLittle kids jumping on me\nBut you, you wanna be white and corny\nLiving way out\n\"Nigga go home\", spray-painted on your house\nTrying to be white or a Jew\nBut ask yourself, who are they to be equal to?\nGet the hell out\nStop being, a Uncle Tom, you little sell-out\nHouse nigga scum\nGive something back to the place where you made it from\nBefore you end up broke\nFuck around, and get your ghetto pass revoked\nI ain't saying no names, you know who you are you little punk\nBe true to the game\n\n[Break]\nYeah, motherfucker. Yeah, you thought we forgot, huh? Yeah, get a little money and moves out the neighborhood and shit. But you still ain't shit\n\n[Verse 2]\nWhen you first start rhyming it started off slow, and then you start climbing\nBut it wasn't fast enough I guess, so you gave your other style a test\nYou was hardcore hip-hop\nNow look at yourself, boy you done flip-flopped\nGiving our music away to the mainstream\nDon't you know they ain't down with the team?\nThey just sent they boss over\nPut a bug in your ear, and now ya crossed over\nOn MTV, but they don't care\nThey'll have a new nigga next year\nYa out in the cold\nNo more white fans, and no more soul\nAnd you might have a heart attack\nWhen you find out the black folks don't want you back\nAnd you know what's worse?\nYou was just like the nigga in the first verse\nStop sellin' out ya race\nAnd wipe that stupid-ass smile off your face\nNiggas always gotta show they teeth\nNow I'ma be brief, be true to the game\n\n[Break]\nYeah motherfucker, I see you got your fancy cars and shit, but you know what? You still ain't shit. That's right, I caught you slipping. You know I could've gat you, yeah, but I didn't even trip\n\n[Verse 3]\nA message to the Oreo cookie\nFind a mirror, and take a look, G\nDo you like what you see?\nBut you're quick to point the finger at me\nYou wanna be the big fish, you little guppy\nBlack man can't be no yuppie\nYou put on your suit and tie, and your big clothes\nYou don't associate with the Negroes\nYou wanna be just like Jack\nBut Jack, is calling you a nigga behind your back\nSo back off genius\nI don't need you to correct my broken English\nYou know that's right\nYou ain't white\nSo stop holding your ass tight\nCause you can't pass\nSo why you keep trying to pass?\nWith your black ass\nMister Big\nBut in reality, you're shorter than a midge\nYou only got yourself to blame\nGet a grip, Oreo, and be true to the game\n\n[Outro: Ice Cube and Leesa Gibbons]\nAnd Ice Cube practices what he preaches. He continues to live in South Central Los Angeles, and he puts his money into projects that improve the neighborhood\nBe true to the game!", "image": "https://images.rapgenius.com/89a02ab603eae95e0d380fcd08eda589.1000x1000x1.jpg"}], "artist": "Ice Cube"}