{"songs": [{"title": "Wasted", "album": "No Ceilings", "year": "2009-10-31", "lyrics": "[Intro]\n(Take it FATBOI)\nNo Ceilings\n\n[Verse]\nRockstar lifestyle, might not make it\nPresident got 'em in the White House naked\nLooked at the clock and it say 'Right now'\nGet a pound, break it down, blow it like trial\nPanatela Dutchie, wine in my tall glass\nYoung Money, baby, big shit, like a horse ass\nStacks in my backpack, shades on, hat back\nBugatti matte black, \"Where they do that at?\"\nSouth Beach Miami, ho, I'm probably with Tammy To'\nMy life is a video and the women want they cameo\nI just want them pantyhose, and I’m higher than Geronimo\nAnd I got them tools, tell them boys it could get mechanical\nNow pop that pussy like a .44\nI turn you 'round and bend you over like a low-blow\nIt’s Young Money, baby, we the fucking greatest\nWe done put them other niggas on a hiatus\nBeat your bitch with the pump if she deny data\n'Cause I’ll serve anyone like a blind waiter\nI make my girl cum first then I arrive later\nI shake you pussies up, I'm a vibrator\nGetting money like hell yeah\nThis shit's so good it don’t even smell bad\nAnd you can tell Dad that I’m a Motherfucker\nYou niggas best not slip, Ice Road Truckers\nLight pole barrel, chopper stupid long\nNew Orleans nigga, I get Super-dome\nLoyal to the game, the game been good to me\nStill spitting fire, you niggas wood to me\nWe on, nigga; let them hoes know\nYoung Money lay 'em down like old folks\nYou coming with it? We coming for it\nPlenty to go around, now watch the money orbit\nReal shit, people; now just absorb it\nI tried to pay attention, but y'all mad boring\nAnd I got so much swag I need an ad for it\nAnd I don’t like to brag so my bitches brag for me\nOh, she a good girl? I got her transforming\nShe give me hot head, I call it global warming\nIf we gon' do it, dog, let's do it now\nI am more animal than the zoo allow\nPut me in the wild, I’ll be there for a while\nYou niggas little league, call 'em Curaçao\nEnergizer money, it keep going\nI’m laid up, I’m free throwing\nWho rebounding? Who gives a shit?\nFuck that, I got 27 years of this\nHit or miss, I hit your Missus\nYou are local news, I’m 60 Minutes\nI hit the target, I hit the witness\nI work out in my office, guess I’m fit for business\nToo many visions, completed missions\nStill icing out crosses, keep it Christian\nWe consistent, the streets commend it\nWeezy F. Baby, the 'F' is for 'Forensics'\nFrom start to finish, Usain Wayne\nOK, you're doing your thang, well things change\nYou Plain Jane, I’m diverse\nI save the world second, and I get high first\nI’m a mind freak, check my time sheet\nBitch, I bring the noise, where the lions sleep\nYour flow never wet, like Grandma pussy\nI’m always good, like Grandma cookies\nYeah, call me the spleen or the spine fixer\nIt's going down like the Catalina Wine Mixer\nShe going down like the hands on my time-ticker\nI’m always strapped; Vietnam, nigga\nWe are fine, nigga, like Amber Rose\nWe ball, nigga, like Jalen Rose\nBetter tell them hoes, I got a million flows\nLabel me the hardest nigga in civilian clothes\nIt's Young Money, baby, and the building grows\nAs we look up, where did the ceilings go?\nNo Ceilings", "image": "https://images.genius.com/4a183c010cf184b2a9fecdfcb8e16142.320x320x1.jpg"}], "artist": "Lil Wayne"}