{"songs": [{"title": "B-Boy", "album": "The Language of My World", "year": "2005-10-10", "lyrics": "[Intro: Macklemore]\nLadies and gentlemans\nThis an ode to the B-boys, B-girls\nThe people out there who do it for the love\nAnd believe me I'm not dissin' anybody out there who's trying to get paid\nI'm trying to get paid too!\nBut I got one question\n\n[Verse 1: Macklemore]\nWhatever happened to the heart?\nThat pumped the passion into the art?\nThe entity that gave you the energy to wanna start?\nBreakdancing, I'm battling, doing it at the park\nWhere the mission was expression, not only to top charts\nI don't know what happened, wanting to blow rap\nYou lose soul and passion for the flows and the tracks\nRadio's lacking, controlled by fascists, assholes doing damage\nBut we're gonna take it back\nBefore beats to a hundred G's a pop\nAll you needed was a tabletop and a beatbox\nHip-hop without the B-boy is like shelltoes only having two stripes\nHip-hop, we're freedom-fighting, graffiti-writing, party types\nThat recite and organize and revitalize our rhyming\n'Til the group of the moneymakers systems\nKnows that the industry can eventually get served\nBreakers of my verses spinning up a revolution throughout our words\nIf you really want it, come on get it, cause I've got it\nI'm honestly paying homage to forgotten pioneers of this culture that are giving them props and learn\nIf you wanna earn your stripes\nYou gotta be able to rock this mic and set cyphers alike\nThe feeling to put in everything you got in the circle\nWill never be documented in the Coke commercial\n\n[Hook: Macklemore]\nWe be the baddest\n\n[Verse 2: Macklemore]\nNow B-boys, B-girls\nBring it back to the block\nLemme see you get ill, for real, pop and lock!\nIf you record without thought then stop\nBecause I'll serve your whole album with the goddamn beatbox\nWithout thought it just happens\nIf you gotta think to feel, that's not rapping, that's acting\nI'm from a land of backpacks and fat cats\nMCs with sick raps who serve those that are wack\nIt's a way of life\nI put all my energy into the melody\nOn the mp3s until the death of me\nRecord exceptionally, especially\nWhenever I be monumentally, grammatically, killing the mic\nI tell my DJs, cranking that music, keeping 'em moving when the beat plays\nStaying into it, breaking and grooving, and MCs they\nThinking that you should always pursue in what their dreams make\nTaking from lucid to really do it\nAll the people gotta make their money\nAnd the way to make money is to get inside of the industry\nTake it on the radio, flow\nSo you can go blow, we get a car\nAnd a crib up on MTV\nBut in the end what's classic?\nRadio bubblegum? Or a voice filled with passion?\nTo my real hip-hop heads, please stand up\nCause the only people that can preserve this art is us", "image": "https://images.genius.com/a341d7269423ec87ff688b91d8b38e47.800x800x1.jpg"}], "artist": "Macklemore"}