{"songs": [{"title": "More Than I Can Say", "album": null, "year": null, "lyrics": "[Hook - Keyshia Cole]\nI'm trying to put it all in words, but it's\nMore than I can say\nIt would take a whole lifetime to tell you\nMore than I can say\nEvery time I wrote a line it’s still\nMore than I can say\nThis is the realest shit I ever wrote\nMore than I can say\n\n[Verse 1 - Nas]\nBottles and El Dorados, trapped in the allure\nThe sickness: dreaming of riches\nReality was the cure. My doctor\nPhysician was music, I'm sure\nThe prescription was super-model sandwiches\nAnd suicide doors. I used to stand in my mirror\nFixing up my hat right\nDMV don't make licenses for the fast life\nWas taught never drop my head when I'm doing right\nAnd though I may be watched by feds with the blue sights\nI just want the whole world to bop their heads\nSomeone to stop my bread\nIf my pops was here, he'd be like \"son, you the one\nThey gotta crown you, a gift from around you\nKnow they don't understand you, but what can they handle?\nIf they was wearing Gucci loafers, they'd be through, over\nJust stay on point, do what you do\nSoldier: remember I'm with you when the world get colder..\n\n[Hook - Keyshia Cole]\n\n[Verse 2 - Nas]\nKeep having the same dream\nAbout a mic, a gun, a cross, they all\nIn the middle of flames\nAn hourglass of salt dripping down to its last grain\nHear a voice that asks what do I claim?\nI ask what it means. It's sort of a trance\nAs the planet Earth appears in the palm of my hands\nI could do what I wish with it, and waking up\nTo study my dreambook, see if it links up\nLooking for some significance, like does the dream\nRepresent this cold world I'm living in?\nAsk my man, then his laughter begin\nHe had the same dream, but in his, he grabbed the gun\nDamn son! I told him in mine I took the mic\nThe cross, I had it all my life, the same height\nI'm trying to sneak sleep, so that my mind won't find out\nTime out: my body won't wind down", "image": "https://images.genius.com/23061dd2dc7e863127db561906debd27.434x434x1.jpg"}], "artist": "Nas"}