{"songs": [{"title": "The Recipe", "album": "good kid, m.A.A.d city (Deluxe Version)", "year": "2012-04-03", "lyrics": "[Produced by Scoop DeVille]\n\n[Intro]\nSmokin' weed with you\n'Cause you taught me to\nSmokin' weed with you\n'Cause you taught me to\n\n[Verse 1: Dr. Dre & Kendrick Lamar]\nEvery morning when I wake up, uh\nMoney on my mind, good time to get caked up, uh\nSunshine coming through my blinds, I’m living, but\nReally though, it's never enough\n10 milli on, that's a must, living in California\nEverybody wanna visit for women, weed and weather\nThey come for women, weed and weather\nFor the women, weed and weather\nFrom all around the world for the women, weed and weather\nThese niggas'll kill for that, put it in your grill for that\nStill everybody gotta build for that, me? I make mills off that\nHow the fuck y'all can't see I ride, when I drive, down the block and\nYou look outside, H-A-T-E in your eyes, I enter big money for the enterprise\nIt's a beautiful day, I guess, for a bitch to roll with Andre, I guess\nRoll it up, baby, come and lift that dress then roll it up for me when I'm stressed\n\n[Pre-Chorus: Kendrick Lamar]\nYou might catch me in Atlanta looking like a boss\nNew Orleans and then Miami, party in New York\nTexas I be screwed up, Chi Town I be really pimpin'\nBut nothing like my hometown I'm forever livin'\n\n[Chorus: Kendrick Lamar & Dr. Dre]\nWomen, weed and weather\nThey come for women, weed and weather\nFor the women, weed and weather\nFrom all around the world for the women, weed and weather\nGot that women, weed and weather\nDon't it sound clever, come and play\nWh-What more can I say? W-Welcome to LA\n\n[Verse 2: Kendrick Lamar]\nUhh, my nigga said he wanna fly out to get him some\nThree W's only for a three-day run, bitch\nTake them mothafuckin' panties off, you ain't no nun, shit\nI be living in the sky every time I ride by them hoes\nRibbon in the sky on the radio 'cause Stevie know I control\nLet it breathe, I control, California living 'til I am old\nYou want to be on to peak on the charts\nSo the peons can be gone and pee on their hearts\nShe in the coupe, she in the Neon\n'Cause she on the BS before we can start\nFuck with a nigga, ride with a nigga\nLet 'em know I'm priority, order me\nHennessy and for my niggas\nOG Killa, call it Jason Voorhees\nBoy he's on his job, boy, he sure be having the marks on they mark\nPretty bitches and tire marks, let 'em inhale them pipe exhausts\nLet 'em reveal how much it cost for this life controlling my vice\nNo way, hell no, uh uh, if I'm wrong I don't wanna be right\nWe want to be on to peak on the chart\nSo the peons can be gone and pee on their hearts\nWomen, weed, weather, it's not my fault\nThat it's 82 degrees and my top peeled off\n\n[Pre-Chorus: Kendrick Lamar]\nYou might catch me in Atlanta looking like a boss\nNew Orleans and then Miami, party in New York\nTexas I be screwed up, Chi Town I be really pimpin'\nBut nothing like my hometown I'm forever livin'\n\n[Chorus: Kendrick Lamar & Dr. Dre]\nWomen, weed and weather\nThey come for women, weed and weather\nFor the women, weed and weather\nFrom all around the world for the women, weed and weather\nGot that women, weed and weather\nDon't it sound clever, come and play\nWh-What more can I say? W-Welcome to LA\n\n[Verse 3: Dr. Dre]\nKnown for that homegrown where I come from\nSmoke one, palm trees, double D's got 'em topless in the sun\nI shall proceed, that's me, mothafuck your opinion\nHuh, how many ways am I killing 'em? Shit, right around a billion\nWe on it, that mean we living for the moment\nThat mean she'll fuck 'til the morning, time and I got time\nAnd I know that I'm in a position of controlling anything, I buy that ocean\nI'm a boss, I'll buy that ocean, ain't nobody fucking with this\n\n[Verse 4: Kendrick Lamar]\nThey want that shit, they often fiend\nI give it to 'em, but in between\nMy time, I gotta tie shoestrings\nLife's a trip when you want these things\nI often slip and then I lean\nToward three W's in life\nYou know blow job need an application\nEating pussy make appetite\nAnd yeah my type, I like 'em brown\nJust like my drink, the fuck you think?\nI don't fuck with no hand me downs\nSee if you fuck then it's after me\nYou know how much I'ma make it work?\nYou know her dress livin' in her purse\nWhen you discuss your love for lust\nJust make sure you visit here first - Cali\n\n[Pre-Chorus: Kendrick Lamar]\nYou might catch me in Atlanta, looking like a boss\nNew Orleans and then Miami, party in New York\nTexas I be screwed up, Chi Town I be really pimpin'\nBut nothing like my hometown I'm forever livin'\n\n[Chorus: Kendrick Lamar & Dr. Dre]\nWomen, weed and weather\nThey come for women, weed and weather\nFor the women, weed and weather\nFrom all around the world for the women, weed and weather\nGot that women, weed and weather\nDon't it sound clever, come and play\nWh-What more can I say? W-Welcome to LA", "image": "https://images.rapgenius.com/1f88d4bb676c321dbb666acf642c8fa7.608x608x1.jpg"}], "artist": "Kendrick Lamar"}