{"songs": [{"title": "Burr", "album": "Gangsta Grillz: The Movie: Part 2 (The Sequel)", "year": null, "lyrics": "[Hook]\nSo much Ice, I should have brought my fur\nAfter the club I might leave with her\nGo tell your jewelery man to step it up\nCause man your stones ain't bright enough\nRappers think Gucci Mane should lighten up\nClub night we be lighting up\nTen thousand dime pieces lining up\nAnd all they say is \"boy you blinding us\"\n\n[Verse 1]\nMy money growing like a chia pet, ch-ch-ch-chia\nAnd my ears like a quarter mil, is you for real?\nAnd my lamb is like a shark with gills, look at the rims\nAnd my beamer coupe got spinning wheels, like they on pills\nI put sixes on my old school and my Rolls Royce\nSwear to god Drumma Boy I only drove that bitch once\nGucci, ball players where Gucci live, that's how we chill\nMy back yard big as a baseball field, That's 'fore the deal\nMy pocket full of old big head white dudes\nBecause I get forty thou just to walk through\nSchedule booked up now I can't make room\nPissy jewelery like my jeweler got it from the rest room\n\n[Hook]\n\n[Verse 2]\nYou niggas in the hood mad because I got cash\nProbably because I ride past fast [through the Jag](pending)\nJumping out the back of the phantom like damn\nDon't I look so motherfucking handsome, mam?\nMan fuck Gucci, So Icy ain't a movement\nSo Icy ain't a movement? [Whoop the nigga] is you stupid?\nCupid shoot arrows, I shoot double barrels\nRetarded ass diamond watch like Little Darryl\nA nigga named Harold, who used to go to [Parrel]\nWas found [------?-------] back seat of a jaguar\nHomie hit a lick, 30 bricks bought a camaro\nIt's Gucci Mane La Flare, Just like my apparel\n\n[Hook]\n\n[Verse 3]\nIt ain't legal, search and seizure, get away from vehicle\nBelieve, I be smoking reefer, I don't be legal\n[--------------------?-----------------]\n[The piece, under the seat, just like it beneath]\nI bequeath me unto my sea, you know I'm a G\nShe petite but she such a freak, tear down the boutique\nWe discreet, we rack up with [seeks?], damn I'm such a thief\nMeet your girlfriend, soon as you wink take her out to eat\nCan't compete, say she incomplete, so she fucking me\nThe elite, Gucci Mane The G, Drumma on the beat\nWouldn't believe what you can achieve, then just look at me\nHope my life a living testimony, Gucci [dies a grinch]\n\n[Hook]", "image": "https://images.genius.com/27dbba2e7ebb145c8c99f22fce82ed15.450x450x1.jpg"}], "artist": "Gucci Mane"}