{"songs": [{"title": "Role Model (Clean Version)", "album": null, "year": "1999-08-17", "lyrics": "[Verse 1]\nI'm cancerous, so when I diss, you wouldn't want to answer this\nIf you responded back with a battle rap you wrote for Canibus\nA hellspawn droppin' a stealth bomb\nSix mics in The Source, they borrowed one from LL's arm\nYou beef with me, I'm a even the score equally\nTake you on Jerry Springer and beat your ass legally\nI get too funny off of twenty Nō-Dōz\nHop on a snowboard and hit a tree harder than 'Sonny' Bono\nSo if I said I never get buzzed\nThat would mean I lie and get butt more than the president does\nHillary Clinton tried to slap me and call me a pervert\nI took her freakin' tonsils out and fed her sherbet\nMy nerves hurt and lately I'm on edge\nGrabbed Vanilla Ice and ripped out his blond dreads\nEvery girl I ever went out wit' has gone les'\nFollow me and do exactly what the song says\nTalk back, fake sick, get out of school, steal from people\nAnd don't think before you do somethin' that's illegal\nI'm dumb enough to walk in a store and steal\nSo I'm dumb enough to ask for a date with Lauryn Hill\nSome people only see that I'm white, ignorin' skill\nCause I stand out like a green hat with a orange bill\nBut I don't get pissed, y'all don't even see through the mist\nHow the fuck can I be white? I don't even exist\nI get a clean shave, bathe, go to a rave\nFry from an overload and dig myself up out of my grave\nMy middle finger won't go down, how do I wave?\nAnd this is how I'm 'posed to teach kids how to behave?\n\n[Hook 1]\nNow follow me and do exactly what you see\nDon't you want to grow up to be just like me?\nI slap women and eat 'shrooms, then O.D\nNow don't you want to grow up to be just like me?\n\n[Verse 2]\nMe and Marcus Allen went over to see Nicole\nWhen we heard a knock at the door, must have been 'Ron' Gold\nJumped behind the door, put the session on hold\nDid 'em both and smeared blood on a white Bronco\nMy mind won't work if my spine don't jerk\nI slapped Garth Brooks out of his rhinestone shirt\nI'm not a player, just a ill rhyme-sayer\nThat'll spray a Aerosol can up at the ozone layer\nMy rap style's warped, I'm runnin' out the morgue\nWith your dead grandmother's corpse to throw it on your porch\nJumped in a Chickenhawk cartoon with a cape on\nAnd beat up Foghorn Leghorn with an acorn\nI'm about as normal as Norman Bates with deformative traits\nA premature birth that was four minutes late\nMother, are you there? I love you\nI never meant to hit you over the head with that shovel\nWill someone please explain to my brain\nThat I just severed a main vein\nWith a chainsaw and I'm in pain?\nI take a breather and sigh, either I'm fried or I'm nuts\nCause if you ain't tiltin' this room, neither am I\nSo when you see your mom with a thermometer shoved in her ass\nThen it probably is obvious I got it on with her\nCause when I drop this solo hit, it's over with\nI bought Cage's tape, opened it and dubbed over it\n\n[Hook 2]\nI came to the club drunk with a fake I.D\nDon't you want to grow up to be just like me?\nI've been with ten women who got HIV\nNow don't you want to grow up to be just like me?\nI've got genital warts and it burns when I pee\nDon't you want to grow up to be just like me?\nI tie a rope around my penis and jump from a tree\nYou probably want to grow up to be just like me", "image": "https://images.genius.com/b379811c1415017b9f3e3a71b9d26060.400x400x1.jpg"}], "artist": "Eminem"}