{"songs": [{"title": "New Jack City", "album": null, "year": null, "lyrics": "[Verse 1]\nYeah, lift 38th, I don't care what you bitchin'\nO.D. on the track, need drug intervention\nLook around hip hop, niggas walkin' in fear\nWe call the niggas, get tossed off a tier\nStrong, hearted niggas get tossed off a pier\nIf it's my nigga, I'm gettin' tossed off a tear\nYeah, tell Rick Ross I'm here\nAll you gotta do is call me, cheers\nExterminate your rap for ya\nSend a bitch to bust a gat for ya\nCall me G-Money, I am that for ya\nI do for Nas, what I do for kids\nHop out why, yo broad day, and shoot the shit\nNigga, do for Snoop, what I do for Dre\nViolate my probation, let the rumors spray\nYeah, do for Shyne what he did for Puff\nSit in jail for ten years, who fuckin' with us?\n\n[Bridge]\nWe are hip-hop, hip-hop, hip-hop\nTell my mother that I can't stop makin' it\nTell her that my rags still hangin'\nTell her that my names still ringin'\nThat's how I live and die, on top of the world\nNigga's see I switch it slow\n40 Ounces, rollin' down the liquor store\nGot your ear twisted, but you don't hear me though\nBack 4 to 4 times, nigga here we go\nOh, top down in the Phantom, the joints we smoke\nFlyin' high, now I know\nOh, it's a new jack city, it's a new jack city\n\n[Verse 2]\nIf Wayne is Nino, I bought Tha Carter\nIf it's Lakers vs. Celtics, I'm the departed\nT.I. goin' in, I'm comin' out\nDrop top Phantom's, show 'em what the song about\nRoc-A-Fella used to (?) out\nBut I'm runnin' over shit, yeah bringin' the Hummers out\nGave Jim Jones my rag, let him rock it\nGave Young Money my flag, right pocket\nDo it right if you gon' do it\nAnd make sure you wipe it off it you gon' shoot it\nAll I used to do was sell crack and smoke Buddha\nAnd now I'm poppin' Chris, cause I know Luda\nIf you say \"Fuck Game\", you better (?) chains\nGet a vest, and start workin'n on your motherfuckin' (?) game\nFuck money nigga, I got enough fame\nAnd you could trust Game\n\n[Bridge 2]\nSittin' on the top of the world with his hands up\nIf you into gettin' money, this the anthem\nSomebody tell my grandmama that her grandson\nGot the hood on his shoulders and he can't run\nHe got to stay and fight\n\n[Verse 3]\nFor my soldiers, the goons and the goblins\nThese rap niggas characters, Batman and Robin\nMe? I had the Louie ville bad, and I was robbin'\nRed shit on my head, I was Rodman\nAnd I rebounded after G-Unit\nI sell records, Jimmy ain't gotta sneak units\nUsed to walk to the door, my spotted peak through it\nSit, stare at my 'Pac poster and speak to it\nCrack hip-hop, and let The Chronic seek through it\nNiggas feedin' off me, cause I eat music\nWith my Dre headphones on, think to it\nYou waitin' on Detox? This the leak to it", "image": "https://images.genius.com/9c29ee407cd2d88f01ce08743e61d3b1.614x614x1.jpg"}], "artist": "The Game"}