{"songs": [{"title": "Groupie", "album": "Tha Doggfather", "year": "1996-11-12", "lyrics": "[Chorus]\nShe was just a groupie (She just a groupie)\nShe was just a groupie\nShe was just a groupie (All she wanted was Snoopy)\nShe was just a groupie (A groupie)\nShe was just a groupie\nShe was just a groupie (All she wanted just was Snoopy)\nShe was just a groupie (Yeah just a groupie)\nShe was just a groupie\n\n[Dat Nigga Daz]\nBeotch! (Beotch!)\nI come through with the humps, I'll thump the shit out your block\nI'm on alert for the cops, be on alert for the cop\nSpotted some hoes, tooted my horn at the bitch\nThe Riviera skated, my interior's the shit\nFifteens humpin', dropped the top some more\nCountin' my doe, purchased 250 of some bomb indo\nFloss through South Central, I'm on my way to the Eastside\nWe high, blazin' like crazy and don't know why\nFeelin' good as fuck, on a hot ass day\nAnd there's a pool jam right around the way\nNiggas got hoes, but ladies in the world\nThey wanna play with their minds like little girls\nI twirl my fingers in the air, run my fingers through my hair\nRedbones to blackbones, darkbones to Redbones\nSkinny girls come a dime-a-dozen\nBut I play hoes like Plenty Lenny cause I get pretty\nIt's all about game...\nCause with no game is hard to maintain, for so long man\nFrom Long Beach, California\nFrom Tul-sa, Oklahoma\nTonight boardin' New Orleans from Mississippi\nI know you hold the key to unlock the door\nFrom low pro's she rolls with gold thangs, we ridin' fo' sho'\nSo tell me how much money can one playa make?\nAnd how much ass can one nigga break?\nYou're just a gigolo (ya know)\nTo the heart you're just gigolo (ya know)\n\n[Kurupt]\nI was off in Vallejo\nPeelin' hoes like Idaho Potatoes\nWhat am I to do when life as a G\nBein' from where I be - D.P.G\nIt's manifico, ran into this pretty ass skirt\nMexi con Puerto Rico\nMixed with a sprinkle of black\nSo I'mma approach her like that\nAnd let her know where I ride and reside at\nMy zone, the place that I call home\nIs the world from Philadelphia to Rome\nPicture me ey, entrepenuer with my nigga D-A\nRockin' tours and we still young boys\nWe got bitches, they got some bomb ass lips\nShe used to put 'em on this bomb ass dick\nShe always talked some bomb ass shit\nShe used to blow some bomb ass dick\n\n[Chorus]\nShe was just a groupie (She just a groupie)\nShe was just a groupie\nShe was just a groupie (All she wanted was Snoopy)\nShe was just a groupie (A groupie)\nShe was just a groupie\nShe was just a groupie (All she wanted just was Snoopy)\nShe was just a groupie (Yeah just a groupie)\nShe was just a groupie\n\n[Nate Dogg]\nSomeone's at my door, baby who could it be?\nSomeone wants to score, and get laid by the D-O double-G\nHey girl, what's your name? You wanna go a couple rounds with me?\nI told her Nate Dogg is just the same, but she kept screamin' out Snoopy\n\n[Warren G]\nWhat's up baby, my name is Warren\nI'm down with the Pound, cause I get around\nSo let me scoop you, swoop you, and take you\nGive me a chance, and I'mma break you -\nDown - to the very last compound\nWith my homies from the Dogg Pound\n\n[Snoop Doggy Dogg]\nNow you know and I know\nRule number one, you can't trust no ho\nNow you can get caught up in the mix real fast\nThe ho gon' slip away, get away with all your cash\nYou gots to stay up on your toes when it come to hoes\nI bust a brand new ho at every video\nThat's on the Pound and the Row, and like the wind blow -\nI pass a ho to my kinfolk - and then smoke\nShe say she was no groupie, coochie lookin' juicy\nShe say she never ate a dick before but she gon' do me\nBut before she do me, I blaze up a doobie\nThen turn on some Snoopy and uh - heat up jacuzzi\nAnd, later on I just might turn on a movie\nSo you can regroupie and re-do me, just for Snoopy\n\n[Chorus]\nShe was just a groupie (She just a groupie)\nShe was just a groupie\nShe was just a groupie (All she wanted was Snoopy)\nShe was just a groupie (A groupie)\nShe was just a groupie\nShe was just a groupie (All she wanted just was Snoopy)\nShe was just a groupie (Yeah just a groupie)\nShe was just a groupie", "image": "https://images.genius.com/ecb7c80ab44a68c9d33f60b5fccd0a70.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}