{"songs": [{"title": "Nickel Nine Is...", "album": "Rock City (Version 2.0)", "year": "2002-11-26", "lyrics": "[Hook]\nNickel Nine is.. me not them, this is.. him not they\nRoyce and Reef, double R, beef is close, but trouble's far\nNickel Nine is what the rhyme is, I put my time in nigga\nNickel Nine is.. me not them, this is.. him not they\n\n[Verse 1]\nHe is the reason why the funds is dizzy\nMoney continuously spinning, round and around like a frisbee\nMy lungs is sticky from, the second hand smoke\nFrom out of the guns; he shoots a lot, they busy.. come get me\nHe is, quick on the draw, same nine that I used\nWhen you thought I copped it and popped it at the same time, shit\nCarry tools, you gotta, the streets is overpopulated\nWith niggas who cheat, like Andrew Guilota\nRoyce and Reef, double R, when the gutterest beats\nMeet with the troubled bars, nothin but heat\nNiggas I'm in and outta this booth, like Clark Kent for the youth\nFlying with the NARC-proof tent for the truth\nNiggas be tripping a lot, so I keep the longest clip in the lot\nHit you while you loading the clip in the Glock like bloaw!\nNo life, no rep, the only games I play is Umi Says like Mos Def\n\n[Hook]\n\n[Verse 2]\nHe is over-protected, keep the coldest connections\nWhen it goes in effect the only thing froze is the necklace\nThat's it, keep the gat by me, I'm not rowdy\nSo none of you's can see me like Jack Ponti\nNone of you niggas bad as me\nI got a Mobb and we Deep like Hav' and P, so get a job\nMy shoes is 9 and a half sizes too big\nFor every thug nigga listening and nodding his head\nYou better know that he is, a motherfuckin' throwback\nRap shit nowadays is so wack, I wish I could go back\nShit is undone, so I spent money like\nIt's more from where it came, even more where dick come from\nThe time it took to write this, I could be selling twice this\nAnd wipe shit, like my vemonmous drive is priceless\nMy goons they'll put you away\nAnd if it's heat, then it's no beef, homie I'll cook you today\n\n[Hook]\n\n[Verse 3]\nI got niggas like \"That's Eminem's man, ain't it?\"\nLike that's my name, like I changed it when my man became famous\nBy the way, you ain't beefin with Slim, you beefin with us\nSo stay out the magazines, keep it shh hush, okay?\nThis mothafuckin' rapper is hilarious, dog\nNever to big for that box, cause the area's small\nAnd you'll fit, six feet deep is where you'll sit\nBring it true, I'll turn sixteen deep into a trip to the sky\n\n[Interlude]\nYeah, you don't wanna hover, ya mommy wouldn't like it\nWhat up Proof? My nigga\n\n[Hook]\n\n[Outro]\nWall Street, my nigga X-Gov, Tre Little", "image": "https://images.genius.com/2e33562233c0c84cdaac4c3b252d599c.600x600x1.jpg"}], "artist": "Royce da 5'9'’"}