{"songs": [{"title": "Buzz", "album": null, "year": null, "lyrics": "[Royce Da 5'9\"]\nYeah!\nWelcome to the M.I.C Mixtape niggas!\nVolume two!\nWe back niggas!\nOh yeah, by the way, y'all know what my motherfuckin' name is\nUh oh..\n\n[Chorus]\nI am (Bzzz)\nBuzzin', my name and the streets be (Bzzz)\nBuzzin', the speakers and the jeeps be (Bzzz)\nBuzzin', til I kill your mother, your brother\nThree or four of your cousins like it's nothin' (Bzzz)\nBuzzin'\n\"He ain't really from the hood nigga\nIf I catch him in the hood I'ma\" (Bzzz)\n\n[Verse 1]\nBuzz him, I ride with them choppas all day\nI dare you to pop a\nBlocka, I'm off my rocka\nSilent, you better all findin, Hoffa\nI've lost my mind\nSick man brought my nine\nSixth man off my pine (I'm off!)\nIndustry heads off my grind\nCentipede leg niggas follow me (Follow me!)\nYeah nigga, off that liquor\nWalk back by him, spit lead to the head, niggas off my mind\nGo ahead nigga, talk that crime shh\nTalk that, spark that nine shh, walk that fine\nLine, in between, talk and sparkin' that nine\nRhymin' to be caught in a chalk outline\nEntire teams get bought, like ???\nI am, battling the scatter that rather by triumph\nBreakin' niggas back, we giants\nDavid gettin' slapped by Goliath\nThat means that I am, him\nIn the back chillin', that'll be quiet\nBut that don't mean ???\nThe gatling's, ???\nYou have to be blind, to not see the black and green sign\nPeekin' at no matter who's eyein'\nReadin' he'd be leavin the baddest dude lyin'\nIn a puddle of some sort of fabulous new science (new science)\nI done had it here in babblin'\nI am that dude quietly shootin' that chatter proof iron\nNigga I am (Bzzz)\n\n[Chorus]\nBuzzin', my names and the streets be (Bzzz)\nBuzzin', the speakers and the jeeps be (Bzzz)\nBuzzin', til I kill your mother, your brother\nThree or four of your cousins like it's nothin' (Bzzz)\nBuzzin'\n\"He ain't really from the hood nigga\nIf I catch him in the hood I'ma\" (Bzzz)\n\nBuzz him\n\n[Verse 2]\nEverything y'all love I'm touchin'\n'Ready gone die, fuck em\nBonafide hustler, dude in a tank\nDo a clown, undo now who a do a nigga can't\nWe will do it til the music ends\nDo it when it's noon\nDo it til it's noon again\nDo it til it's new again\nDo it til he prove to you, who to you, can't\nFlow no more, no tool, no shank\nNo rules, no don't do's in the blanks\nOh no (Oh no!) won't go assumin' who you think, gon' blow\nWon't be leavin here sooner than you think\nThe party ain't over til I'm losin' my drink\nImma couple dollars up from hollerin' \"Oo I can't!\"\nUp and at em', til tomorrow while I choose my fate\nThere be dudes that I pay while I move wit' my rank (yeah)\nMove wit' my weight (yeah)\nDo whoever ain't playin' (yeah)\nThere lonely player, only shoes in the paint\nImma go until there's no more room in the bank\nI'm just y'all niggas, sittin' on tall figures\nTil the law, need invisible legit small business\nThe minute, the hits is out I figured y'all get it\nThe fickle now admits, just as I spit it\nI'm as sick as \"Good Lord, just hear him\nGet a good load of him. Hits is hittin like hitlaw done did 'em\"\nThe next villian, tap the nigga next to you\nTell him, \"I don't like him either. Let's kill him\"\nYa'll niggas sound crazy (Bzzz)\n\n[Chorus]\nBuzzin', my names and the streets be (Bzzz)\nBuzzin', the speakers and the jeeps be (Bzzz)\nBuzzin', til I kill your mother, your brother\nThree or four of your cousins like it's nothin' (Bzzz)\nBuzzin'\n\"He ain't really from the hood nigga\nIf I catch him in the hood I'ma\" (Bzzz)\nBuzz him\n\nEverything y'all love I'm touchin'\n'Ready gone die, fuck 'em (fuck em)", "image": "https://images.genius.com/892233b049a8da052593a9b4030be708.988x988x1.png"}], "artist": "Royce da 5'9'’"}