{"songs": [{"title": "The Great", "album": "Ryde or Die Vol.2", "year": "2000-07-04", "lyrics": "[DMX]\nWOO!\nCome on\nWoo!\nUh, uh, woo!\nCome on\nWoo!\nUh, uh uh\n\n[Verse 1]\nMan, I hear you niggas talkin'\nBut you walkin' the wrong way, didn't really mean it\nI done heard it, I done seen it, don't get caught up in between it\nIt's a dark road you walkin on, same street that I be stalkin' on\nSupposed to be quiet, but you keep talkin' on\nNow your mouth got you in some shit\nSo we gon' let everybody see your gangsta ass get smacked like a bitch\nJust to remind y'all niggas, I can find y'all niggas\nClick click, what's up? Walk up right behind y'all niggas\nOnce the four-four hit'cha\nYou ain't going nowhere but out the door on a stretcher\nBoy, I'ma get'cha\nWet y'all niggas up like a pool\n'Cause I done told you, Y'ALL GON' MAKE ME LOSE MY COOL\nYo Knock, get the Glock, these bitch niggas is actin'\nMaking movies, we'll make a movie about this shit after it happened\nAll that yappin', that them niggas is gettin' away with\nTake it easy, my friend, let 'em know, dog ain't nothin' to play with\n\n[Chorus]\nA nigga gotta take the good with the bad\nI'm fuckin' with the hood and I'm glad\nI wish you understood why I'm mad\n'Cause it'd take a lot of pressure of my back\nA nigga gotta take the good with the bad\nI'm fuckin' with the hood and I'm glad\nI wish you understood why I'm mad\n'Cause it'd take a lot of pressure of my back\n\n[Verse 2]\nMost of these hard rocks turn out to be soft as wet dog shit\nTalkin' shit, but when the four spits, dog, they all split\nThen all hit the ground around the same time\nIn the same frame of mind\nThings up in the nine left them bitches blind\nHit 'em up from behind—yeah, that's how you do that\nHe had such a good head on his shoulders, but I blew that\nFuck you, black, you new cats don't know somethin' important\nYou die quick fuckin' with my shit, and my shit's extortin'\nHouse rules, when I speak, y'all niggas listen\nI drop jewels that you cats can't afford to keep missin'\nTriggered by stress, fueled by drugs\nShit is about to get real outta hand, dog, better get ya man, dog\nRap shit comes second, I'ma show you what a robber do\nMention ice one more time and I'm robbin' you\nTie you up for a week starvin' you\nBeatin' the shit out you every day, 'cause yo, these niggas gotta pay\n\n[Chorus]\nA nigga gotta take the good with the bad\nI'm fuckin' with the hood and I'm glad\nI wish you understood why I'm mad\n'Cause it'd take a lot of pressure of my back\nA nigga gotta take the good with the bad\nI'm fuckin' with the hood and I'm glad\nI wish you understood why I'm mad\n'Cause it'd take a lot of pressure of my back\n\n[Verse 3]\nDog, it ain't no secret 'bout how its going down once I put on the pressure\nIt ain't nothing but another nigga put on a stretcher\nWith a blanket over his face, take him to the morgue with the waste\n'Cause he was in the wrong place, at the wrong time\nSo I gave it to him in his chest\nIn his throat, in his head, in his back, through his vest, YES\nAin't a whole lot to breaking a nigga down fast\nThey call me black 'cause that's how I'm gon' be on that ass\nY'all pussy niggas think it's sweet\nBut ain't a fuckin' thing going down until I eat, so kill that beef\nYou better, while you still got teeth\n'Cause they about to get knocked out, hopped out\nOn that ass with a blast that'll make your shit drop out\nPopped out, through a you know what\n'Cause you know why, and you know my\nMotherfuckin' name up in this game, and bitch, you know I\nWill never be caught slippin', but on some East Coast terms\nNew York niggas dope, fuck the perms\n\n[Chorus]\nA nigga gotta take the good with the bad\nI'm fuckin' with the hood and I'm glad\nI wish you understood why I'm mad\n'Cause it'd take a lot of pressure of my back\nA nigga gotta take the good with the bad\nI'm fuckin' with the hood and I'm glad\nI wish you understood why I'm mad\n'Cause it'd take a lot of pressure of my back\n\n[Outro]\nUh uh, woo, come on!\nWoo!", "image": "https://images.genius.com/bf0d5e58337bbb0294f98d9d6b07ab15.300x300x1.jpg"}], "artist": "DMX"}