{"songs": [{"title": "Hey Young World", "album": "The Great Adventures of Slick Rick", "year": "1989-06-15", "lyrics": "[Intro]\nGuess who's back\nGuess who's back\nGuess who's back\n\n[Chorus]\nHey young world... the world is yours\nHey young world... the world is yours\nYoung world young world... the world is yours\nYoung world\n\n[Verse 1]\nThis rap here... it may cause concern it's\nBroad and deep... why don't you listen and learn\nLove, peace, happiness... that once was strong\nBut due to society... even that's turned wrong\nTimes have changed... ay it's cool to look bummy\nAnd be a dumb dummy and disrespect your mummy\nHave you forgotten... who put you on this Earth?\nWho brought you up right... and who loved you since your birth?\nReward is a brainwashed kid going wild\nYoung little girls already have a child\nBad company... hey, now you've been framed\nYour parents are hurting... hurting and ashamed\nYou're ruining yourself... and your mommy can't cope\nHey, little kids don't follow these dopes\nHere's a rule for the non fool.. your life don't drool\nDon't be a fool like those that don't go to school\nGet ahead... and accomplish things\nYou'll see the wonder and the joy life brings\nDon't admire thieves 'cause... hey, they don't admire you\nTheir time's limited, hardrocks' too\nSo listen, be strong, scream whoopee-doo\nGo for yours, 'cause dreams come true\nAnd you'll make your mommy proud... so proud of you too\nAnd this is a message... that the Ruler Rick threw\nAnd it's true\n\n[Refrain]\nYou know, you know what, you know what, you know what?\nWe like to party, like to party\nYou know, you know what, you know what?\nWe like to party (Hey young world, the world is yours)\n(Hey young world)\nYou know, you know what, you know what, you know what?\nWe like to party, like to party\n\n\"Yo peep this\"\n\n[Verse 2]\nHey Mr. Bigshot... hey, don't you look fly?\nBut you don't have a dollar... ohhhh, my my my\nYou've been fightin again and, you forgot why\nHey kid, walk straight, master your high\nWhy? Because you make your family cry\nAnd all jokes aside, are you in good health?\nHey little boy... now have you really checked yourself?\nYou're a disgust, you know someone that I can't trust, you'd\nSteal mom's welfare... and you'd run and buy some dust, and\nPlus, I must say... big shot, you're not\nYour friends are talking and I'm hearing that your girls are what?\nYou didn't know? Go steal and rob\nAnd while you're at it... go get a suit for a job\nYou see you're actin like this urge is demanding\nC'mon, wake up... have some understanding\nSociety's a weak excuse for a man\nIt's time for the brothers... it's time trying to take the stand\nBelieve it or not, the Lord still shines on you, he\nGuides you... and he watched you as you grew, plus\nPast the age of... a little child, that's true\nBut folks your age don't act like you do, so\nSo be mature... and put the point to a halt\nAnd if you're over eighteen... I wish you'd act like an adult\nDon't live in a world... of hate, hate, hate\nPull yourself together... and get yourself straight\nMen don't steal... hey, most don't borrow\nAnd if you smoke crack... your kids'll smoke crack tomorrow\nSo be more mature... and kids do your chores\nMake your own money... hey, be proud that's yours\nYou know why, 'cause that's a man... that's brains, no spite\nStayin out of trouble... when it comes in sight\nAnd a man never loses a fight... in God's sight\n'Cause righteous laws are overdue\nAnd this is a message that the Ruler Rick threw\nAnd it's true\n\n[Refrain]\nYou know, you know what, you know what, you know what?\nWe like to party, like to party\nYou know, you know what, you know what, you know what?\nWe like to party, like to party\n(Hey young world, the world is yours)\n(Hey young world)\n\n[Outro]\n\"Yo peep this...\nMC... Ricky... D...\nThe Grand Grand Grand Wizzard...\nAnd his and his partner...\nAnd his and his and his\nAnd his and his and his partner...\nSay what?\nLa-Di! Da-Di! La-Di! Da-Di!\nLa-Di! Da-Di! La-Di! Da-Di!\nLa-Di! Da-Di! La-Di! Da-Di!\nLa-Di-Da-Di...\"", "image": "https://images.genius.com/1b5003c727be5c3d1612fe1ab8077674.1000x987x1.jpg"}], "artist": "Slick Rick"}