{"songs": [{"title": "Da Countdown (Saga Continues)", "album": "Ill At Will Mixtape Vol. 1", "year": null, "lyrics": "The motherfuckin saga continues...\n\n[Intro]\nYeah, turn me up some on the mic some (1, 2, 1, 2...)\nYeah, Turn it down overall in the headphones\n\n[Verse]\nYo, we go one for the money, two for the show\nThree for Brick City, four for Bang Bro\nThis the count down, bang the underground\nBang a hundred rounds, nigga you want it down\nI can't believe they givin air for these cats to breathe\nBut Ima dog, and I sniff between\nI glow like the sun, but run in the nite\nDoc'll bend you quick, like the front of your Nikes\nRedman, I make my 929 can-can\nAnd if you can't' stand the pressure, slam dance\nDef Jam lost they soul\nThey forgot how to build a artist, so I gotta show 'em\nGilla House, you let the real gorilla out\nThe Pit Boss of the game is how I deal 'em out\nYall philosophy is wrong, it's to the +left+\nSo gimme fifty G's lemme +right+ (write) your songs\n\n[Bridge]\nThe motherfuckin saga continues...\nThe motherfuckin saga continues...\nThe motherfuckin saga continues...\nThe motherfuckin saga continues...\n\n[Verse 2]\nLong as Rockwilder and E. Sermon got my back\nI don't need to pick up tracks\nI choose to do it\nI'm fluent, I crack it to the rooster roostin\nThis for carjackers, and boosters boostin\nDuck nigga, fuck ya Cadillac truck pick-up\nI roll Sanford and Son when cameras come\nI'm Gilla, I do it red-handed and run\nWrite my scripture in the Bible, hand it to nuns\nI'm keepin a green thumb\nMe and my man Tical, Four, Voltron and Team One\nSmoke addicts, when the mic on we toe tag it\nMy Go-go Gadget, go smack bastards\nRap like Ceramic\nDoc Slept on a bed of bricks, yall takin flicks on a hammack\nAnd In my head, I can hear Jam Master jammin\nI'm the Brick Layer, I'm the Brick Mayor\nDoctor Dictator, put ya gun and switchblade up\nGilla House, wakin up your neighbors\nKeep my family tight like Will Smith and Jada\nFYI, I'm back on the job, BITCH!\n\n[Hook x2]\n(10...9...8!!!)\nMotherfuckers better hit the gate, we go...\n(7...6...5!!!)\nGilla house gon keep it alive, we go...\n(4...3...2!!!)\nI got bitches like \"Who that dude!?\"\n(One!) I'm number one\n(One!) I'm number one\n(One!) I'm number one\n\n[Bridge]", "image": "https://images.genius.com/269feb9a815361d5df2b9a0fae3113b1.959x948x1.jpg"}], "artist": "Redman"}