{"songs": [{"title": "Method Man (Remix)", "album": "Def Jam’s Greatest Hits: Hardcore", "year": null, "lyrics": "[Intro]\nFat dub sack! Remix of Method Man for ya one time. Yeah\n\n[Hook]\nM-E-T, H-O-D, Man\nM-E-T, H-O-D, Man\nM-E-T, H-O-D, Man\nM-E-T, H-O-D, Man\n\n[Verse 1]\nHey you get off my cloud\nSee me get raw with my southpaw style\nMover, puffin' on a fat blunt from Cuba\nIt's the Meth-Tical jet to Cal, I'm the Buddha\nMonk on the hunt for machine gun funk\nI gets you open like a slug from the shotgun pump\nDouble-barrel, yeah Meth bring it to them proper\nPartner, you ain't got no wins in mi casa\nStraight up, you movin' too fast so baby wait up\nTook one, added seven more now you eight up\nGet on down wit' your bad self\nGet on down, listen to the sound, come on\nFew can ever get this ultimate legit\nSee you all up in my ass\nBut you don't know shit, uh-huh\nWhat's your definition of a real emcee\nFrom what you dedicated, hey it must be me\nMeth-Tical, a rude descendant of the loud hip-hop\nI go on to the break of dawn, and just don't stop\nGive me the green light, and the sign one way\nHave you had your meth today?\nHuh, move it in, move it out\nStick it in, pull it out\nShake it up, shake it down\nCome on down, Meth-Tical\nOh I hope and pray that I will\nBut today I am still\nJust a...\n\n[Hook]\nM-E-T, H-O-D, Man\nM-E-T, H-O-D, Man\nM-E-T, H-O-D, Man\nM-E-T, H-O-D, Man\n\n[Verse 2]\nRrrappers can't get with the style, extra wicked\nRap flow is bangin' like butter on a biscuit\nA tisket, a tasket I'm not tryin' to have it\nMight show up, stun 'em and run 'em when they raggin'\nThose who test it, respect it, the method\nYou know I can't be messed with, I'm hectic, accept it\nI'll break it down, I get down for my crown\nFilthy, dirty like a worm underground\nTryin' to avoid the early bird, that's my word\nBefore I kick the bucket I'm a kick 'em to the curb\nCheck out the cloud, smoked out from the mouth\nOther brothers got mad fly, flew south for the (winter)\nHey, enter the square if you dare\nWithout a flaw, I'm so raw that I'm rare\nI'm goin' to the country, I'm goin' to the fair\nTo see the senorita, with flowers in her hair\nAnd get mine, cause she love me long time\nBartender bring more wine\nGet in line for the...\n\n[Hook]\nM-E-T, H-O-D, Man\nM-E-T, H-O-D, Man\nM-E-T, H-O-D, Man\nHere I am, here I am, the Method Man\n\n[Outro]\nWu-Tang, killer bees on the swarm, it ain't safe no more\nP.L.O. Style. 1993 to '94, the rugged raw\nAnd we out\n\n(Sample from  Shaolin & Wu-Tang)\nIt's our secret! Never teach the Wu-tang", "image": "https://images.genius.com/49d22d5bdd2bc1c871bd18fde03fab08.274x274x1.jpg"}], "artist": "Method Man"}