{"songs": [{"title": "All Night Long", "album": "The Master", "year": "1999-11-30", "lyrics": "[Verse 1]\nI'm back, the god remains, still at the end\nThey sabotage the game, still I'm a win\nRakim Allah's the name, ill with a pen\nNo one can dodge the rain, kill'em again\nIn a club or the streets I swerve, cool in the cut\nLooking to see what occurs, crusin' the truck\nShorty got deadly curves, soothin' her up\nIf I must explain with words, I smooth as a fuck!\nThe world's most greatest hip-hop's elite\nYou obsolete, you cannot compete, drop the beat\nKeep ya ear to the ground when I rock the street\nCock the heat, we deep papi got to eat\nSo cut on the mic and spit, I much rougher\nPlenty of ice and a whip, plus a crusher\nBecause I don't like to stick, or bust a brother\nLong as they never forget I'm a ill muther fucker\n\n[Hook]\nSo if you love to get your party on\nAnd you feel that your game is strong\nAnd you get mad when the broads is gone\nYou like it all-night-long\nAnd when they love it when the place is warm\nAnd they go out for their favorite song\nThey hate when the player game is wrong\nThey like it all-night-long\n\n[Verse 2]\nMy caliber's high rated\nYeah player, so why hate it\nMy rhyme through out of control, when I say it\nSpit back with a rap or a gat, can I spray it\nHow can I say it? I leave it de-hydrated\nI take aim, and he keep the place flamin'\nTill the place cave in, aye yo this ain't a safe haven\nSave the playin, stay blazin with bass bangin\nThe best is yet to come, so they stay in\nThey keep the music loud, the lights is low\nThe kid with a different style, I like to flow\nIt's time to move the crowd, tonight's the show\nSee what it's all about, they like to go\nGet henny and mo and cris\nThe clothes, the platinum, gold, the wrist\nPlenty of doe, and chicks who pose for flicks\nWomen who love roll their hips, when I'm holding this\n\n[Verse 3]\nMy mic's a equipped with a microchip, with a million Megs\nBite this I might flip, spread a billion plagues\nPut medicine in it before I kill ya dead\nYou can get away, if you can feel your legs\nCould you walk? No, at least you fought though\nAuto fours blow a hole in your torso\nDamage his brain with more flow until he talk slow\nTry to say something now? I thought so!\nI leave emcee's bleeding, while I'm fleeing across sea-in\nStart breeding, double my Swiss cheese in Sweden\nFree on the weekend, come back see if he breathing\nThey breathing, somebody left his brains beat in\nA deadly attack is rare, style will be raw\nBe ready to rap you'll hear, as wild as before\nIf I bust a gat in the air, watch the galaxy fall\nAnd the world will be splat on the floor, that'll be all", "image": "https://images.genius.com/ed0fa8170b1ec37192ad4e270a004891.500x500x1.jpg"}], "artist": "Rakim"}