{"songs": [{"title": "Outlaw", "album": "Me Against the World", "year": "1995-03-14", "lyrics": "[Intro: 2Pac & RahRah]\nThat's right nigga you gotta get your papers in this motherfucker\nI ain't mad at ya at all (damn)\nAiyyo, what the fuck you wanna be when you grow up RahRah?\nNigga, is you stupid, I wanna be a motherfuckin' Outlaw\nThat's right nigga, hahaha.. housin' these hoes, you feel me?\nAight, you know what I'm sayin'?\nYou got to do that shit, keepin' it real nigga or what?\nKeepin' it real!\nHow old are you nigga?\nI'm eleven\n\n[Verse 1: 2Pac]\nCause all I see is, murder murder, my mind state\nPreoccupied with homicide, tryna survive through this crime rate\nDead bodies at block parties, those unlucky bastards\nGunfire now they require many closed caskets\nWho can you blame? It's insane what we been through\nWitnessin' evil that these men do, bitches sin too\nIn fact they be the reasons niggas get to bleedin'\nPull 'n' fuckin' fire when I leave 'em, you shoulda seen 'em\nHostile hoes catch elbows (beotch!) negroes disposed of\nAnd snitches get dealt with, with no love\nBody bags of adversaries that I had to bury\nI broke the law and they jaw, all in the same flurry\nBut never worry, they'll remember me through history\nCausin' motherfuckers to bleed, they'll label me a\n\n[Hook]\nOutlaw, Outlaw, Outlaw (They came in to sin)\nOutlaw, Outlaw, Outlaw (Dear God, I wonder could you save me?)\n\n[Verse 2: 2Pac]\nBefore I close my eyes I fantasize I'm livin' well\nWhen I awake and realize I'm just a prisoner in hell\nJust as well, cause in my cell I'm keepin' pictures of these bastards\nExercisin', visualizin', everyone inside a casket\nPicture me blasted, surrounded by niggas in masks\nSent with the task to harass and murder my ass\nWill I last? Heaven or Hell? Freedom or jail?\nShit's hard, who can you tell? And if we fail?\nHigh speeds, and Thai weed on the freeway\nWhen will they learn to take it easy? Uh\nDrive-by's and niggas die, murder without a motive\nBy makin' motherfuckers fry\nGot me runnin' from these coward-ass crooked-ass cops\nHelicopters tryna hover over niggas 'til we drop\nGot no time for the court, my only thought is open fire\nHit the district attorney, but fuck that bitch, cause she's a liar\nNow it's time to expire, I see the judge, spray the bitch\n\"Motherfuckers is crooked,\" is what I scream, and hit the fence\nI commence to get wicked, spittin' rounds as the plot thickens\nNever missin', an early grave is my only mission\nIf I die, never worry, bury me beside my four-five\nMay God forgive me, I was high, label me a\n\n[Hook]\nOutlaw, Outlaw, Outlaw (They came in to sin)\nOutlaw, Outlaw, Outlaw (Dear God, I wonder could you save me?)\n\n[Verse 3: Dramacydal]\n[Kadafi]\nSociety lied to me, I ain't never gonna try to be\nMy mob'll be doin' robberies, and stickups on these wannabe's\nI witnessed niggas lose they chest\nFor ordinary reasons niggas bodies put to rest\n\n[Kastro]\nSo I just ... swallow my Beck's and holla, \"Fuck 'em!\"\nAnd if I'm next ... just let a nigga step with somethin'\nI ain't fearin' nuttin'\n\n[EDI Amin(Kastro)]\nYoung and thuggin', prepared for bustin' if that's my destiny\nReady for whatever, see you niggas can't get the best of me\n(hold me down) Definitely no need for askin'\n(now he mashin') Top speed (smokin' weed) laughin' (biotch!)\n\n[Napoleon]\nCause when I bust 'em they gonna shiver, the killers cry\nSoldiers got bodies floatin' in the river, what is they sayin'?\nTalkin' 'bout prayin'\n\n[Kadafi]\nThey need to stop, that ain't gon' help\nThese niggas sprayin' up my block\n\n[Napolean]\nTryin' to take my wealth\n\n[Hook]\nOutlaw, Outlaw, Outlaw (They came in to sin)\nOutlaw, Outlaw, Outlaw (Dear God, I wonder could you save me?)\nOutlaw, Outlaw, Outlaw (They came in to sin)\nOutlaw, Outlaw, Outlaw (Dear God, I wonder could you save me?)\n\n[Outro: 2Pac]\nFuck the judge, I gotta grudge\nPunk police, niggas run the streets\nHahah, it ain't nuttin' but muuuusic\nShit's changed\n1995 the game has changed, motherfuckers is actin REAL strange\nThe rules is all rearranged\nYou got babies lyin' dead in the streets\nThese punk police is crooked as me\nBut all I see is motherfuckers actin less than G's\nStop bein' a playa-hater, be a innovator nigga\nFuck that shit, don't be no entertainer and a stranger\nBe a real motherfucker keep it real pack that steel\nCause you know these streets is real ill\nMuh'fuckers wanna see me in my casket\nJealous, motherfuckin' bastards\nI never die, thug niggas multiply\nCause after me is Thug Life baby\nThen the young thugs\nThen the youngest thug of all, my nigga RahRah!", "image": "https://images.genius.com/aa900ef68a5861f06835ba38e4e6d764.640x640x1.jpg"}], "artist": "2Pac"}