{"songs": [{"title": "Rise Above", "album": "Truly Yours", "year": "2013-02-12", "lyrics": "[Chorus]\nRise above, rise above\nAnd you’ve got to\nRise above, rise above\n\n[Verse 1]\nShe had a little daughter with her, it was cold out\nShe said “ah, I hate this motherfucker,” then she rolled out\nHe ain’t answering his phone, she yells “what the fuck?!”\nThen told her daughter “buckle up, yeah, that’s for safety”\nSee she been stressin’ lately\n‘Cause this nigga she done been with for the past two years\nIs now the current reason for her last few tears\nShe text, he don’t text back\nWhen she see him she be tryna sex, he don’t sex back\nHis heart be on jet black\nShe call, he don’t call back, all he say is “fall back”\nA nigga just need his space, so she headed to his place\nCause she just got a call from her homegirl Rhonda\nWho said he been creepin’, he been fuckin’ with Yolanda\n“Yolanda? Yeah girl, Yolanda”\n“Told you he ain’t shit but you ain’t listen, I was tryna” –\n“Click” – hmmm, hung up that phone and hopped right up in that Honda\nHeaded to his crib, she said she fed up with this shit\n“Thought this time this was the one, thought I got better at this shit”\n“Pickin’ out Mr. Right, stick it out through the fights”\n“And long nights, for what? These niggas is all alike”\nShe gon’ set it off, her daughter gon’ witness it all tonight, damn\n\n[Chorus]\nRise above, rise above\nAnd you’ve got to\nRise above, rise above\n\n[Verse 2]\nShe said she just finished school, could barely pay tuition\nNow she teaches 7th grade, tryna make a difference\nAye, but the kids frustrate her, say that they don’t listen\nA ass like that, how the fuck they supposed to pay attention?\nI’m fuckin’ with you, but for real, she say they hopeless\nA class full of jokesters, creating all the obstacles, impossible to focus\nLittle niggas barely read, tryna give them what they need\nAnd they don’t even try, one little boy, he caught her eye\n‘Cause he look just like her brother, she be havin’ to call his mother\nBut she act like she don’t care – what father? He ain’t here\nNow she frustrated, thinkin’ that she just made the mistake of her life\nUnderpaid, be havin’ to waitress at night\nSix years of college down the drain, drinkin’, tryna drown her pain\nParty with her girls, feeling sorry for the world\n‘Cause ain’t no hope for the youth, well ain’t that the truth\nWhen all your role models either rappin’ or they hoop, damn\n\n[Chorus]\nRise above, rise above\nAnd you’ve got to\nRise above, rise above", "image": "https://images.genius.com/6490c45ad4867e7a4b4248258106ac10.899x899x1.jpg"}], "artist": "J. Cole"}