{"songs": [{"title": "Use to Be", "album": "Dreamchasers 2", "year": "2012-05-07", "lyrics": "[Intro: Jordanne]\nYeah (oh-oh)\nYeah\nYeah\n\n[Chorus: Jordanne & Meek Mill]\nI used to be a used-to (Used-to, used-to, used-to)\nI used to be a used-to (I used to be a used-to)\nI used to grind in the dirt\nI used to cry to 'til it hurt (Oh-ho-ho)\nI will look up to the heavens\nWhen is my time gonna come?\nI used to be a used-to\nBut I never got used to\nBeing what I used to be (Yeah, yeah)\nSaid I used to be a used-to (Yeah)\nBut I never got use to (Never)\nBeing what I use to (Yeah) be (Uh!)\n\n[Verse 1: Meek Mill]\nI was never used to niggas that was used to...\nBeing broke so I started selling coke (Coke, coke)\nTimes got hard, was selling soap\nScheming just like the preacher in church; he selling hope (Hope)\nNow I'm getting older, heart getting colder\nLooking at my son while his head lay on my shoulder\nThinking in my head, \"Will I make it to see him grow up?\nOr will I catch a bullet from something these niggas throwing?\"\nTrying to take me out, in the hood trying to make it out (Out)\nNiggas plotting on me cops all staking out\nTrying to get a couple bricks so I can make a house\nClose friends hating on me, really tryna play me out\nDamn, but niggas couldn't deal with me\nIf they had blackjack, my shooters would still hit them\nNorth side of Philly where it's real gritty\nAnd dirty at, where everyday they murder at\n\n[Chorus: Jordanne]\nI used to be a used-to (Used-to, used-to, used-to)\nI used to be a used-to (I used to be a used-to)\nI used to grind in the dirt\nI used to cry to 'til it hurt (Oh-ho-ho)\nI will look up to the heavens\nWhen is my time gonna come?\nI used to be a used-to\nBut I never got used to\nBeing what I used to be (Yeah, yeah)\nSaid I used to be a used-to (Hey)\nBut I never got use to\nBeing what I use to (Yeah) be\n\n[Verse 2: Meek Mill]\nYeah, when I was young, I started planning it out\nMy daddy got killed; I was the man of the house\nBy the age of 16, man, them hammers was out\nSo when niggas trying to hit me, I'm just handing them out\nCause I ain't trying to see my mom crying (Crying)\nAnd my sis mourning (Mourning)\nSo I'ma let this little Mac 11 rip on them\nLouboutin sneaks, watch the blood drip on them\nFor all the times I bled, the tears I shed\nEvery time I made money, it was here, I said\nAnd if my niggas asked for it, it was \"Yeah,\" I said\nSelling butter just to get the fam bread, I spread\nI got married to the streets and it was here I wed\n'Cause I was never used to being what I used to\nStarted off walking now the Rolls Royce a coup too\nI'ma let the top down every time I shoot through\nTo give them motivation, even though I know they hating\n\n[Chorus: Jordanne]\nI used to be a used-to (Used-to, used-to, used-to)\nI used to be a used-to (I used to be a used-to)\nI used to grind in the dirt\nI used to cry to 'til it hurt (Oh-ho-ho)\nI will look up to the heavens\nWhen is my time gonna come?\nI used to be a used-to\nBut I never got used to\nBeing what I used to be (Yeah, yeah)\nSaid I used to be a used-to\nBut I never got use to\nBeing what I use to (Yeah) be\n\n[Verse 3: Meek Mill]\nThe man with the gold makes the rules\nAnd one who makes the rules break the rules\nSome niggas make it alive, some make the news\nIt's either family or money; I hate to choose\n'Cause you need money just to feed the fam\nThe family keep you cool\nGot a nigga on the papers; still, I keep the tool\nNiggas heard I'm getting money so they creeping through\nI keep my hand up on that hammer what's for me to do?\nLet these niggas kill me? (Yeah)\nTry to line me up so they can rail me?  (Yeah)\nI'm just giving you the real me\nStarted with a dollar now I got it and I'm filthy\nNigga!\n\n[Chorus: Jordanne]\nI used to be a used-to (Used-to, used-to, used-to)\nI used to be a used-to (I used to be a used-to)\nI used to grind in the dirt\nI used to cry to 'til it hurt (Oh-ho-ho)\nI will look up to the heavens\nWhen is my time gonna come?\nI used to be a used-to\nBut I never got used to\nBeing what I used to be (Yeah, yeah)\nSaid I used to be a used-to (Hey)\nBut I never got use to\nBeing what I use to (Yeah) be", "image": "https://images.genius.com/a7bc28c05034136e861be4c94601d20a.500x500x1.jpg"}], "artist": "Meek Mill"}