{"songs": [{"title": "Take U Home", "album": "Dreamchasers 2", "year": "2012-05-07", "lyrics": "[Chorus]\nGirl I know you got a man, and you so in love with him\nBut can I get a dance? Maybe a little loving\nSlim girl, if I took you home, I wonder, I wonder\nMaybe I was wondering\nI wonder if I take you home\nWould you still be in love baby?\nCause I need you tonight\nI wonder if I take you home\nWould you still be in love baby?\nCause I need you tonight\n(Tell your man you'll see him next week, cause we gone)\n\n[Verse 1: Meek Mill]\nI say Maserati stance, get it we disappearing\nI tell her cut off the phones, there's nothing to interfere\nShe follow my every order do anything that I dare\nI'm giving her everything so all my neighbors can hear it\nScream to her making her fiend more\nWe be making a movie they thinking its Scream 4\nGot that from bruh Jeezy and then I put Dean on\nI'm 7 looking like Heaven, I love when them jeans on\nWe rolling get your chick stolen\nStand up paper I can't even fold it\nOld bread baby, my money be moldy\nEvery time I'm going down it's nothing but roses, yeah\nI was just on the money, never was on hoes\nI told shorty play her part like some corn rows\nAnd maybe you could get a Neiman Marcus wardrobe\nI'm talking tearing down the mall when the stores close\n\n[Chorus]\nGirl I know you got a man, and you so in love with him\nBut can I get a dance? Maybe a little loving\nSlim girl, if I took you home, I wonder, I wonder\nMaybe I was wondering\nI wonder if I take you home\nWould you still be in love baby?\nCause I need you tonight\nI wonder if I take you home\nWould you still be in love baby?\nCause I need you tonight\n(Tell your man you'll see him next week, cause we gone)\n\n[Verse 2: Wale]\nDub A.L.E. you know I'm in the house\nI'm going on whatever shorty point them bitches out\nThey love me up top, I'm important in the South\nI could talk them into drinking and then talk them out of a blouse\nLook, wild youngin, brown drinking and loud loving\nLiving in a moment shawty it's now or never\nI'm in a 911, this shit is rented though\nBut how I'm whippin' this muthafucka you never know\nShout out my brother Meek, O Melly what it do?\nWe trying to find how many bitches could fit in the coupe\nShe addicted to bags, I'm addicted to shoes\nYou could buy em for me, he can buy em for you\nWord. Wale Folarin\nYoung'un Supreme SB's, I'm a star in this muthafucka\nRaw in this muthafucka, Vuitton a nigga's duffle\nJohn Doe flow: got a car in this muthafucka\nWoop! Park the Caddy in the living room\nHe ain't talking about no paper we don't listen to him\nI try to love 'em in the physical not literal\nAfter I'mma hit it gotta give a little nigga room!\nA little space! I gotta breathe\nWe blew enough trees, you gotta leaf!\nNo days off, me and Meek\nYoung gunner, Rock Boys, double MG!\n\n[Chorus]\nGirl I know you got a man, and you so in love with him\nBut can I get a dance? Maybe a little loving\nSlim girl, if I took you home, I wonder, I wonder\nMaybe I was wondering\nI wonder if I take you home\nWould you still be in love baby?\nCause I need you tonight\nI wonder if I take you home\nWould you still be in love baby?\nCause I need you tonight\n(Tell your man you'll see him next week, cause we gone)\n\n[Verse 3: Big Sean]\nMan I like my drinks high, my lights low\nAnd I'm stacking paper like trifolds\n'Til my momma neighbors them white folks\n'Til my account triple O, oh, triple o, oh\nMan the bank teller thought it was a typo\nI've got loose girls in tight clothes\nMan, that dance floor look perfect\nOnly thing it's missing is Michael\nTwerk that shit, berserk that shit\nFinally Famous ho, I deserve that shit\nPut syrup on top, I dessert that shit\nThen afterwards I'm gone, I desert that shit\nB.I.G. lil bitch!\n\n[Chorus]\nGirl I know you got a man, and you so in love with him\nBut can I get a dance? Maybe a little loving\nSlim girl, if I took you home, I wonder, I wonder\nMaybe I was wondering\nI wonder if I take you home\nWould you still be in love baby?\nCause I need you tonight\nI wonder if I take you home\nWould you still be in love baby?\nCause I need you tonight\n(Tell your man you'll see him next week, cause we gone)", "image": "https://images.genius.com/a7bc28c05034136e861be4c94601d20a.500x500x1.jpg"}], "artist": "Meek Mill"}