{"songs": [{"title": "Gunplay", "album": "Deeper Than Rap", "year": "2009-04-21", "lyrics": "[Intro: Rick Ross]\nRun with me or run from me\nThe worse come to worst\nIt's only gonna be gunplay\nFeel me nigga\n\n[Verse 1: Rick Ross]\nI'm sittin' at the table, countin' my money\nAin't where I wanna be, but I got a few hundred\nLot of talk on the street, like a nigga crossin' me\nWell it's somethin' I gotta see\nIs it how chain swing? Tired of my face\nTellin' lies gettin' niggas wives tied up and raped\nSimilar to the mob, deeper than the rap\nAll you niggas gettin' robbed, all the cell phones tapped\nBullet in my head, bullet in my chest\nYeah they want a nigga dead, they envy my success\nTo be loved, to be loved\nOh what a feelin', 100 rounds in the drum\nNiggas gettin' whacked no sympathy for the soft\nNiggas snitchin', I know bitches who clippin' you dick off\nI'm a boss, champagne with the steak\nPink Rosay jason, Ace by the case\nBrisco line 2, young nigga what it do?\nHe got a pretty shone and he wanna bring her through\nThat's love, we go back to the blue house\nAnd if she bad enough, may take her to the new house\nMy Maserati be the new body\nGot ya girls panties wetter than a pool party, nigga\nI got her sleepin' in the king size\nLast night I had that bitch sittin' ringside\n\n[Hook: Gunplay]\nYou wanna go that route?\nI been on this road before\nI know gunplay, you know gunplay\nShootin' for the win, but ready for the loss\nBoth lines on the tip of my finger\nYellin' bring it, I'm swingin' that iron\nWhen I'm swingin' that iron\nAin't thinkin' 'bout time\nAin't thinkin' 'bout mine\nAin't thinkin' 'bout dyin'\n\n[Verse 2: Rick Ross]\nMy niggas so street, my swishers so sweet\nAll this money on the table, how a nigga gon' sleep?\nSpeculation of my deal, it was over 10 mil\nBlowin' herb, chauffeur plus a home didn't feel\nBeat the case like Gotti, we the trill murder inc\nI race, slip 'n slide, they arraign me in the mink\nLook Ted in the eye, it's the end of the road\nAnd the birth of Maybach, mean I'm gettin' more dough\nSmellin' Christian Dior, I used to be poor\nWhen ya cross Florida line, boy I'm your leader\nBooby boys still, booby boys real\nYou can name a lot of lames that the booby boys killed\nBrisco line 2, young nigga what it do?\nSay he got a couple kilos and he wanna bring 'em through\nThat's love we go back to the blue house\nAnd if he brought enough I may buy me a new house\n\n[Hook: Gunplay]\nYou wanna go that route?\nI been on this road before\nI know gunplay, you know gunplay\nShootin' for the win, but ready for the loss\nBoth lines on the tip of my finger\nYellin' bring it, I'm swingin' that iron\nWhen I'm swingin' that iron\nAin't thinkin' 'bout time\nAin't thinkin' 'bout mine\nAin't thinkin' 'bout dyin'\n\n[Verse 3: Gunplay]\nGettin' how I'm livin' it\nDamn near dyin' for every digit I get\nFuck they know 'bout that?\nI ain't never put shit on the line, just shit in they rhymes\nI shoot a nigga shittin' around\nThese internet niggas, these ain't a threat niggas\nNever seen a laptop in the projects nigga\nJust powder, cut with comet\nFuck them comets, convicts ain't buyin' it\nIf they ain't coppin' or fryin' it\nDon't get a nigga fired up behind some fuck shit\nMy nigga then what then?\nWho that behind the curtain I'll murk 'em\nWizard of Oz ass niggas\nHidin' behind money, hidin' behind luxury\nShootin' up all that fuck shit\nIt's getting ugly\nGot Torch on the line, says he got a couple 9's\nTold him grab 2, bring 'em on through\n\n[Hook: Gunplay]\nYou wanna go that route?\nI been on this road before\nI know gunplay, you know gunplay\nShootin' for the win, but ready for the loss\nBoth lines on the tip of my finger\nYellin' bring it, I'm swingin' that iron\nWhen I'm swingin' that iron\nAin't thinkin' 'bout time\nAin't thinkin' 'bout mine\nAin't thinkin' 'bout dyin'", "image": "https://images.genius.com/78f87f596103b6fbd0d1c2f8dad653c4.1000x1000x1.jpg"}], "artist": "Rick Ross"}