{"songs": [{"title": "Throw Your Set in the Air", "album": "Cypress Hill III: Temples of Boom", "year": "1995-10-31", "lyrics": "[Intro]\n(Showtime) Who dat? Who dat?\n(other gang member) Ah, Showtime, that's that little young nigga again man\n(Showtime) Damn, what the fuck goin' on ova here? What he want, man?\n(young initiate) Ay wassup OG Showtime man?\n(Showtime) Wassup holmes?\n(young initiate) Hey man, I been thinkin' man\n(Showtime) You been thinkin' about what?\n(young initiate) I'm ready to get put down on the set\n(Showtime) You ready to get put down on this set?\n(young initiate) I'm ready to represent the shit\n(Showtime) On this one right here? You ready to die for this?\n(young initiate) I'm ready to die for this, nigga\n(Showtime) Watchu ready to do?\n(young initiate) I'm ready to put in work\n(Showtime) Watchu ready to do?! (punching) You ready to - get - yeah! Get him! Get him! Get him! Yeah. Hit him! What set you from now, huh? What set you from?\n\n\n[Verse 1: B-Real]\nEvery nigga out there wanna be down with the crew\nSome ain't got enough heart let me ask you this\nWould ya be down like a soldier\nLoyal, and do everything I told ya\nI can mold ya into a warrior\nDown for your neighborhood\nWorkin' up to a G with the flava\nCriminal behavior, on the mind\nWhen I got ya back ya know I got ya back each and every time\n\n[Hook]\nThrow ya set in the air (c'mon)\nWave it around like ya just don't care\nThrow ya set in the air (throw it up holmes)\nWave it around like ya just don't care\n\n[Verse 2: B-Real]\nIt's time to exit that busta nigga\nGet ya hands out ya pockets and your finga on the trigga\nLet one fly, we don't die, we multiply\nThrow yo set up in the sky\nHigh as you can cause you can't fuck wit this\nNigga when I got the Glock ya betta duck quick\nCause I ain't havin' it\nIf ya got ya gat ya betta start grabbin' it\nI can handle it\nSoy numero uno, mero mero\nYou know I run with Muggs and the perro\nFirin' up that heater\nWhen I'm throwin' up a set I got my nina millimeter\nLos Scandalous, Killafornia, where I'm from\nDum ditty dum ditty ditty dum dum\nI'm buckin' on ya ass now ya know where I'm from\nDum ditty dum ditty ditty dum dum\n\n[Hook]\nThrow ya set in the air (c'mon)\nWave it around like ya just don't care\nThrow ya set in the air (throw it up)\nWave it around like ya just don't care\nThrow ya set in the air (throw your hood, holmes)\nWave it around like ya just don't care (got c'mon on)\nThrow ya set in the air (give it up)\nWave it around like ya just don't care\n\n[Interlude]\nNigga throw your set in the air, nigga, you know what I'm sayin'\nIf you're scared nigga, take your muthafuckin' punk ass to church\nCause where I'm from, nigga, on the east side\nEvery muthafuckin' day is a job, nigga\nGotta handle your business, cause if you don't\nYour muthafuckin' cap will get peeled back\nAnd that ain't no bullshit\nIf you wanna test a nigga, bring it on nigga, you know what I'm sayin'?\nThrow your muthafuckin' set up in the air\n\n[Verse 3: B-Real]\nLet me take ya to the dark side of the moon\nTell mama that ya won't be comin' home anytime soon\nCause I got ya under my thumb\nNigga what set ya claimin'?\nBetta be the same set I'm claimin'\nTake a look around count this amount of soldiers\nWhen I'm chillin' on the east side of town\nAnd it won't stop 'til I'm done\nDum ditty dum ditty ditty dum dum\n\n[Hook]\nThrow ya set in the air (c'mon)\nWave it around like ya just don't care\nThrow ya set in the air (throw it up)\nWave it around like ya just don't care\nThrow ya set in the air (throw your hood up)\nWave it around like ya just don't care\nThrow ya set in the air (give it up)\nWave it around like ya just don't care\n\n[Outro: Sen Dog]\nYeah, that's right\nStraight givin' up the 'hood all day foo'!\nCypress Hill muthafucka, watchu wanna do?\nUh-huh\nGivin' my shit up in your face foo'!", "image": "https://images.genius.com/c00eba8e5bfcb187bf3bdc38ee982cc0.500x492x1.jpg"}], "artist": "Cypress Hill"}