{"songs": [{"title": "House Of Pain 2003", "album": "Salute the General", "year": null, "lyrics": "[Verse 1: 2Pac]\nThe motherfuckin' dust kicker, who can you trust?\nDo you have the heart to see a nigga, before you bust?\nMy name is spoken on the tongues of so many foes\nBustin' motherfuckers out the box, I ain't even go!\nNow how the hell do you explain my claim to fame?\nFrom doin' flicks to bustin' tricks out the fuckin' frame\nGot these bitches on my jock, niggas on my block\nJealous ass suckers got 'em duckin' from my smokin' Glock\nAnd bustin' niggas asses is to stay alive\nSkinny ass player watchin' bigger motherfuckers fry\nThey ask me how I'm livin', I'm a hustler\nBuckin' busters 'til they die\nNow it's on in the ghetto you ain't heard?\nNiggas got they AKs headin' for the 'burbs\nAimin' at them skin headed bitches let it rain\nGivin' 'em a wet welcome to the house of pain\n\n[Hook:]\nHouse of pain\nHouse of pain\nHouse of pain\nWelcome to the house of pain\nHouse of pain\nHouse of pain\nHouse of pain\nWelcome to the house of pain\nWhoa, whoa\n\n[Verse 2: Notorious B.I.G.]\nHuh, the country bud got me chokin'\nI'm on a mission to the point that motherfuckers think I'm smokin'\nYea that sick nigga Biggie wit the 8-shot fifth\nWit the extra clip for that extra shit\nDon't you know that a killing is thrilling\nAll the blood spilling, is all a part of drug dealing\nA born gangsta my daddy was a thug\nHad a .38 wit the hollow point slug\nSo when he licked shots\nNiggas dropped quicker than a bootlegger sells his liquor\nA little nigga tried to squeeze .22's in my Reebok shoes\nPayin' dues, while kids was on their one's and two's\nNow I'm much older, colder, fuck a holster\nGot the MAC-11 swingin' from my shoulder\nIt's a damn shame I got to put my momma through the strain\nI'm livin' in a house of pain\n\n[Hook:]\nHouse of pain\nHouse of pain\nHouse of pain\nWelcome to the house of pain\nHouse of pain\nHouse of pain\nHouse of pain\nWelcome to the house of pain\nWhoa, whoa\n\n[Verse 3: Busta Rhymes]\nYeah, yeah, check it\nNiggas talking about doing this and doing that\nFucking mouth bigger than the fattest bitch's ass-crack\nAdd and subtract on minus faggots\nGroupies bring the violence to maggots\nI'll silence you bastards and then I\nEmbarrass and disrespect niggas, shameful\nCut the convo short and keep the beating painful\nFinger hugging a trigger like a pussy I'm fingerin'\nShots to you 'till I see them teardrops tricklin'\nYou fuckin' with a grown man and you ain't half-grown\nOr half-known, you faggot, I'll shoot you all in your calf bone\nWhat you get in it for? I'll have you niggas sitting down\nFront and walk with a bop, I'll make you niggas limp around\nIn case you didn't know I'm still a hungry rich nigga\nChop faggots to pieces and eat a little bitch nigga\nDog's not appropriate for women and children\nI spit your pieces out and hang them on the side of a building\nYeah, tie you up and make one of my bitches doo-doo on you\nWith your FUBU on you like I was performing voodoo on you\nHeat rock while you just watch a nigga heat drop\nStreets stop while I'm talking, and push you through a sheet rock\nA whole lot of iron and cocked a lot of hammers\nWhile I give you modes and principles, teaching you niggas manners\nOh yeah, y'all niggas know what's up? You know my name?\nWhile I initiate you motherfuckers in the house of pain\n\n[Hook:]\nHouse of pain\nHouse of pain\nHouse of pain\nWelcome to the house of pain\nHouse of pain\nHouse of pain\nHouse of pain\nWelcome to the house of pain\nWhoa, whoa", "image": "https://images.genius.com/1886c6f8bd30b1cb7fd54c38f3e779a7.400x400x1.jpg"}], "artist": "Busta Rhymes"}