{"songs": [{"title": "Checking My Hoes", "album": "Still Blowin’", "year": null, "lyrics": "[Intro/Chorus: Jazze Pha]\nHoes, hoes\nJust checking my\nHoes, hoes\nI like the way\nI like the way she turn a nigga on\nPut it in her mouth\nShe brings me paper\nTakin niggas home, turnin niggas out\n\n[Too $hort]\nSee I made up my mind when I was only a child\nThat I would hang with the big dogs, runnin wild\nIn the streets chasin cats, they lace these macks\nEverywhere you go you know we take these gats\nSo they treat us like kings, they never try to play us\nThey wanna play with us cause they know why we players\nI got it from my daddy, boy go tell your momma\nI'm watchin cartoons man, I won't, I'ma just\nKeep it to myself, and when I'm grown\nI'ma get a lot of women and get my pimp on\nLike you, and now that's what I do\nGot a bunch of broads just like the fuck I knew\nI ride through with a few, only top notches\nHoes so fast you can't use stopwatches\nUntyin 'em, so when you firin 'em\nBend a bitch over try to rip out the linin\n\n[Chorus]\n[Birdman]\nIt's the pimps of the pimps player\nWent at hollered at $hort, come pimp with a player beotch!\nBaby girl, this our year\nYou see them Lexus Coupes, so mine don't fear\nGorilla pimpin, born hustlers\nSlash, the number one stunna\nWe them hood rich niggas been ghetto bound\nWe worldwide hustlin, we ride Uptown\nIt's the same ol' nigga with the platinum mouth\nIf ye ain't got no food I ain't goin in ya house\nA lil' nigga, freshly chilled\nMa, I don't drink no beer\nI'm the big type nigga in that frozen weather\nChinchilla, rammin on that soft-ass leather\nI'll fly in any weather, I pluck my own feather\nSwine on the G9, pocket full of cheddar beotch!\n\n[Chorus]\n[Too $hort]\nGot new bitches, quite a few bitches\nToo many hoes, that's my life, and you wish\nIt was just a bunch of lies, cause you know it's the truth\nI stick and move cause these hoes'll do\nJust about anything for the low-low\nSometimes I daydream about my old hoes\nBut mostly I just look for a bitch like Stella\nDo what I tell her, and get my mozzarella\n\n[Birdman]\nI'll break a brick like I'll break a bitch\nRun a hundred miles to put some wheels on a whip\nKool-Aid, candy bars, Cadillac, whip\nSilver and gold, barbecue out bitch!\nOn them slab kitted out real slick\nMommy dressed up in her brand new fit\nTailor made Louis and she ridin on 23's\nD-boy, Birdgirl, I know you know me\n\n[Chorus]\n\n[Too $hort over Chorus]\nWe ain't worried about how to treat a itch\nBitch better worry about how to treat us\nYeah, bitch, rub my back\n\n[second half of Chorus]\n\n[Too $hort - still over Chorus]\nSuck my dick, cook my breakfast bitch\nYeah, when you wash the dishes get your ass back in bed\n\n[Chorus]\n\n[second half of Chorus]\n\n[Too $hort - over Chorus again]\nYeah\nPimp shit! Jazze Pha\nBig Baby\nShort Dawg, so real\n\nYou know we love it\nLove the way these hoes treat us\nOh we so special!", "image": "https://images.genius.com/cbce7a2bf9547c73552eb8d05ea5f8b2.700x700x1.jpg"}], "artist": "Too $hort"}