{"songs": [{"title": "Still Shining", "album": "The Coming", "year": "1996-03-26", "lyrics": "RRRRRROAW RRRR.. RRRRRROAW RRRRRRROAW\nTil my dragon baby stop whinin\nI see my influence still..\n\nRRRRRROAW RRRRRRROAW\nTil my dragon baby stop whinin\nI see my influence still..\n\nRRRRRROAW RRRRRRROAW\nTil my dragon baby stop whinin\nI see my influence still..\n\nRRRRRROAW RRRRRRROAW\nTil my dragon baby stop whinin\nI see my influence still shinin\n\nHah!\nHit you with my ultraviolet\nSkin cancer causing laser beam flow then causing riot\nOh shit! I'm gon' give you more and more (hah)\nFlows that's gon' help you see who got the real raw\nYou can watch me wreck (huh) for the entire nine seasons\nCold-blooded flow that got you motherfuckers freezin\nYou (you) must (must) find (find) your style\nIdentify with your own profile! Uhh uhh\nNiggas don't understand what we be talkin about\nDesigned especially for biters who try to figure it out!!\nHuh, WHOOOO! Ice Capades all over beats son\nWhile I smoke your Phillies all the way down to the last one (HAH)\nYo watch me skyrocket (HUH)\nProp me for my flow then get your hand out my pocket\nAs the world keeps on turnin\nKilling microphones as the nigga most determined\nKeeping biters fiending like this was they last serving\nStay away from fake motherfucks like Mark Fuhrman\nGot your whole entire +Little House on the Prarie+ burning\nStick me for my rhyme like you stuck me for my Sherlings\nYo, you must be out your fuckin mind\nThe only thing you really need to do is chill and watch the sun shine\n\nRRRR.. RRRRRROAW RRRRRRROAW\nTil my dragon baby stop whinin\nI see my influence still shinin\n\nHah, hah, hah, hah\nHoh, hoh, hoh, HAHHHHHHHH!\n\nHey, get with this here roll call\nKeep my peoples movin like a U-Haul\nThen I'm gonna hit you, wit that\nShit that's sure to make your dome crack\nWatch me knock you down\nYou'll be surprised how quick the fuckin word will get around\nA biter came up missin and the bitch was never found, YO\nI come with shit, so sure, to hit\nHit you til your motherfuckin dome split\nCounterfeit niggas need to sit back, come off of it\nAnd if you don't listen, you deserve whatever you get\n*gasping for air* Just a moment, let me take a breather\nGot you niggas sweatin cold like you caught the fever\nJust to know my every move, you fuck a freak psychic reader\nFor those who bite my flows, I got to always pack my heater\nYo, I was the one that (hah) made a nigga cough (huh)\nSoft, (hoo!) real quick to turn a nigga off\nYo, I'm quick to break a nigga's spine\nIn any effort made by those who try to take mine\n\nRRRRRROAW RRRRRRROAW\nTil my dragon baby stop whinin\nI see my influence still shinin\n\n..\n\nRRRRRROAW RRRRRRROAW\nTil my dragon baby stop whinin\nI see my influence still..\n\nRRRRRROAW RRRRRRROAW\nTil my dragon baby stop whinin\nI see my influence still..\n\nRRRRRROAW RRRRRRROAW\nTil my dragon baby stop whinin\nI see my influence still shinin..", "image": "https://images.genius.com/e8769bd52f12b0c4930edbc0a93c9cca.1000x973x1.jpg"}], "artist": "Busta Rhymes"}