{"songs": [{"title": "Only the Strong Survive", "album": "Menace II Society (Original Motion Picture Soundtrack)", "year": null, "lyrics": "Yeah man..\nIt's goin down bitch\nMotherfuckers can't be weak\n\n(vocal \"Only the strong'll survive\" repeats in background)\n\nNone of that shit\nShort Dawg is in the house\nNinety-three, bitch\n\nI always heard that you gotta be strong, if you wanna survive\nGet your diploma go to college get a nine-to-five\nEvery year, you're makin 30 G's a pop\nWorkin see, and you're tied to the white man's jock\nMovin out of the ghetto cause it troubles you\nMakin payments on a B-M-W\nI know you never would settle for the minimum snaps\nHave to live in the ghetto where the blacks be at\nAnd send your kids to a school that don't really teach\nI give a fuck about a motherfuckin college degree, beeotch!\nYou think I wanna get cha?\nTake you to the motel, and straight raw dick ya?\nYou must be crazy, smokin that chronic\nI take you to the motel, and put my rubber on it\nAnd hope it don't bust, so I can stay alive\nCause only the strong survive, you little shithead bitch\n\n(vocal \"Only the strong'll survive\" repeats in background 4X)\n\nSo tell me what it is, man tell me what you want\nNot talkin bout the music but we likes to funk\nAin't no such thang as a Oakland punk\nIt don't matter who you are, you'll be _In the Trunk_\nYou come twenty-five deep, or maybe ten\nIf I let your ass push me, then you push me again\nHe was six foot four, they used to call him sir\nBut he was smooth gunned down by a teenage gangsta\nNo bigger than me, never could be hisself\nAlways tryin to act like someone else\nThere just ain't no future for us young black men\nCause we always get killed, or sent to the pen\nBut even, Malcolm X was a ex-convict\nAnd you can bet I won't go fo' it next time bitch!\nI'm kinda strong with my bullets in the clip\nThat's why I never trip, cause only the strong survive\n\n(vocal \"Only the strong'll survive\" repeats in background 4X)\n\n..\n\n(vocal \"Only the strong'll survive\" repeats in background 4X)\n\nYou say be a man, let's go toe to toe\nBut that was like fifteen years ago\nThey say only the strong, will survive\nBut brothers be strong, and still they die\nBut you gotta get around that bullshit\nAll the things we used to do we can't pull the shit no more\nCause ain't nobody trippin on us\nYou wanna fight, fuck around and get shot up\nSee your ass layin there bleedin, losin the fight\nAll behind a bitch and that shit ain't right\nYou could, live or die it just doesn't make a difference\nCause everybody knows about your sorry ass simpin for a ho\nI thought you knew, _Life Is.._\nBut the punk motherfucker can't handle his\nSo you weak bizznews ain't no surprise\nCause only the strong survive, bitch\n\n(vocal \"Only the strong'll survive\" repeats in background 4X)", "image": "https://s3.amazonaws.com/rapgenius/60022300iprv.jpg"}], "artist": "Too $hort"}