{"songs": [{"title": "Gimme Da Gun", "album": "Life", "year": null, "lyrics": "[Intro: KRS-One]\nYo you ain't got to do this man\nI know times get hard but...\nThis is crazy man\n\n[Hook: KRS-One]\nCome on now, give me the gun\nCome on now, give me the gun\nYou don't wanna do that son\nGive me the gun\nCome on now, give me the gun\nCome on now, give me the gun\nYou don't really wanna do that now\nGive me the gun\n\n[Verse 1: KRS-One]\nCome on now, give me the gat\nWhat you doing? What you move? What you living like that?\nGive me that back in fact you ain't living like that\nCome on now, give me the gat\nYou don't wanna sit in the sack, give me the gat\n[?] clean up your act, that's where the change is at\nPut down the gat, I know where you at\nCome on, don't overreact\nCome on now, give me the gun\nYou an adult now, you gotta start living like one\nLike if you an emcee, you can't wait for me man\nYou gotta start spitting like one\nHit like one, shoot the gift and uplift and keep a spliff lit like one\nGet that son, and don't forget that one\nCome on man now, give me the gun\n\n[Hook: KRS-One]\nCome on now, give me the gun\nCome on now, give me the gun\nYou don't wanna do that son\nGive me the gun\nCome on now, give me the gun\nCome on now, give me the gun\nYou don't wanna do that son\nGive me the gun, you don't wanna do that son\nGive me the gun, you don't wanna do that son\n\n[Verse 2: KRS-One]\nCome on now, easy mon\nYou don't want neighbor to be see you mon\nYou ain't not peeped upon\nOlder son, it's time now to be a man\nGive me your hand, let me hear your plan\nLet me get you up and down, now you're ready for jam\nYou can be a whole different mon, a man\nLiving in a whole different plahn, a plan\nMy man, my man, give me your hand\nTake the time off or put your feet in the sand\nBad times hooking you man\nJust another way to see it if you really looking my man\nAre you look-look looking my man\nOr are you in the world of lookbook looking again?\nDrowning, frowning, looking to sin\nYo man I ain't gonna say it again\n\n[Hook: KRS-One]\nCome on now, give me the gun\nCome on now, give me the gun\nYou ain't gotta do that son\nGive me the gun\nCome on now, give me the gun\nCome on now, give me the gun\nYour life is something son\nGive me the gun, you don't wanna do that son\nGive me the gun, come on now, give me the gun\n\n[Verse 3: Raphi]\nGive you the gun, yeah right, why should I?\nHad enough of this life, how could I?\nLive another day, live it away\nIt's all display, come on now really, why would I?\nIt ain't working man, I'm worthless\nI'm a good guy gone berserk\nAnd nobody cares, everyone's smirking\n[?] for me and my girlfriend\n[?] my girlfriend\nIt's better this way like veterans say\nThe world just don't deserve him\nFinal curtain, yeah you heard him\nNever hurt that no one will miss me\nI did them [?] but they diss me\nRespect never cut the check so I did my dirt tryin' to get filthy\nFor feeling guilty, choking on two feet of milky\nBut that's just how Cali build me\nMove on with a new song tryin' to make it, will he?\nThe clever kid never did\nI readily weathered it moving the subject and predicate willfully\nDoing it skillfully, kept it real but it never made a mil for me\nPaid the bills? Yeah right, man it made more\nAnd it wasn't what I came up in the game for\nBig Shame became one of my name\nWhether money ever coming to me [?] open the door\nBut I'm tired of knocking, on my last option\nI'm stopping, never got it popping\nSo it's no longer fun\nI got my gun, I'm done", "image": "https://images.genius.com/12162bd5dc20dab4c0cbb67190522d80.500x493x1.jpg"}], "artist": "KRS-One"}