{"songs": [{"title": "Taxi Driver", "album": "Bar Exam 3: The Most Interesting Man", "year": "2010-05-30", "lyrics": "[Hook]\nI'm the taxi driver\nRidin around with me and my thoughts\nIn the back seat behind me speakin\nTo me while I'm drivin, I'm hearin 'em talk\nTo me sayin' where they wanna go\nSoon as they get in and they close the door\nAnd then I cruise to wherever we ridin'\nWherever you can imagine from coast to coast\n\n[Verse 1]\nI got a foot on the gas, I got my eye on the road\nWith an open mind as I roll, hopin to spy on my soul\nI lose control, pull up to a liquor store then get blowed\nRidin down skid row, feelin kind of miserable\nI been the same since my enemies came\nYou play the game, you get a foul, the penalty's pain\nThough I got a pen full of poison, the venom is fame\nThe light changes, I take a right on Memory Lane\nAnd see, a couple niggas on the corner chillin\nLookin more and more familiar closer to 'em I get\nI pull up, hit the locks, they open the door\nAnd hop in and say they names is Hip and Hop\nSo I grin, pretend I don't know 'em for shit\nI ask \"Ay, homie, why they call you Hip?\"\nHe says \"I'm hip-notic, hip-ocritical\nI could say Dear Mama and wonder why they call you bitch\nI seen drama, I step to the odds lookin at death in the eyes\nThey probably murder me, check my disguise\nYou see it's money over bitches, bitches bring lies\nMoney bring trouble and trouble wanna follow me\nDrop me on the corner of Flamingo and Koval\nAnd remember all eyes on you\nThen I come to a stop, he exits the car\nSo I leave and I hear shots\n\n[Hook]\nI'm the taxi driver\nRidin around with me and my thoughts\nIn the back seat behind me speakin\nTo me while I'm drivin, I'm hearin 'em talk\nTo me sayin' where they wanna go\nSoon as they get in and they close the door\nAnd then I cruise to wherever we ridin'\nWherever you can imagine from coast to coast\n\n[Verse 2]\nI'm the taxi driver, ridin with one passenger left\nAbout to catch a left after I catch my breath\nPeelin' past them times where niggas blast them nines\nParanoid, done already lost half my mind\nI'm high thinkin' like what if the feds try to out me?\nI pull up to a stop on a red light at South Street\nI catch a parade goin by, full of rappers and snappers\nA Cadillac float full of trapsters\nCarryin a sign sayin \"It's Our Time\"\nI wave sayin I would never diss y'all grind\nSo I'm waitin at the stoplight, South Street is jumpin\nI look back at Hop like, people call you Hop, right? (Yes!)\nAfter that, he's like \"It's a green light\nYou can weave right through, if you got keen sight\nTo make you a right then, head for the valley\nI'm Going Going to Cali Cali, uhh\nTrust me, Mo Money Mo Problems\nEspecially when you built for the stars\nYou rather be, drivin your taxi than killed for the car\nSo drop me on the corner of Wilshire Boulevard\"\nI take him to the place he requested\nI tell him thanks for the message, the cab shakes when he exits\nI pull off Hypnotized then hear shots\nAnd then my engine die soon as they kill Hop\n\n[Outro]\nWhat's on your mind? Who's in your back seat?\nDo you go off your own thoughts? Are you even drivin your own car?\nI know what you thinkin, \"This nigga sayin Hip Hop is dead\"\nDon't take song like I'm sayin we lost Hip Hop, take it like I lost my mind\n\n[Hook]\nI'm the taxi driver\nRidin around with me and my thoughts\nIn the back seat behind me speakin\nTo me while I'm drivin, I'm hearin 'em talk\nTo me sayin' where they wanna go\nSoon as they get in and they close the door\nAnd then I cruise to wherever we ridin'\nWherever you can imagine from coast to coast", "image": "https://images.genius.com/f26afa0e15f73eb0b5cef561ec304c68.450x450x1.jpg"}], "artist": "Royce da 5'9'’"}