{"songs": [{"title": "Tough Love (Freestyle)", "album": "Free Agents - The Murda Mixtape", "year": null, "lyrics": "[Intro]\nNiggas, niggas, niggas, niggas, niggas, niggettes\n(Yeah) y'all been invited, (welcome)\nThat's what I'm talkin 'bout\nMobb Deep up in this motherfucker, bring yo' ass in here\nHey yo check it out son, check it out like this\n\n[Havoc]\nI keep a hammer on my waist 'cause ain't no steppin' to this\nHey yo don't let you be a problem that I'm fiendin' to fix\nYou peep the grin on my face that mean I'm creepin' on somethin'\nWhether a bad bitch, or a nigga that stole somethin'\nCall me a old school cat wit aiyyoung mentality\nI live by the day and I go out for family\nI don't understand language if it ain't talkin' money\nFrom the era walkin' 'round with knots lookin' bummy\nCertain bitches knew the code so they went with the flow\nAnd let you know they wanted fifty-four elevens from the door\nWe cut school, cooked caine, took traum' to the brain\nAnd though a nigga had it, still hopped the fuckin' train\nLook back and laugh but ain't shit funny still\nMy little brother took his life, forever I'm stuck with a ice grill\nGot friends with chemical imbalances\nAnd when the love get tough, believe me it's challengin'\n\n[Hook]\nYou go out for me, I'm goin' out for you\nTough love (tough love)\nIt's the crew for one, and one for the crew (yeah)\nIt's tough love (tough love)\nNo matter the bullshit the world put us through (*gunshot*)\nTough love (tough love)\nY'all my motherfuckin' niggas and you know what I'd do\n(hey yo check it out)\nBust slugs (bust slugs)\n\n[Prodigy]\nIt was one of those days you could smell it was 'bout to rain\nParked in the car sittin' in the back seat\nJust me and my dun, smokin' the weed\nThat's when the floor phone rung, \"who could this be?\" (get back)\n\"What's good?\"\n\"Yo dun, I got some very bad news\"\n\"Yo who this?\"\n\"Lil' BG from Springfield, and Franny Lou\"\n\"Okay, talk to me\"\n\"Now to make a long story short, Yvesh got bodied at\nPrecious' party\"\n\"You lyin'\"\n\"That's word to our dead, hear what I said\nNow meet me at the rest it's time for get back\"\n\"I'm there\"\nDropped off my dun at the Vann's, at Yorke College\nCan't believe they killed my man 'Vesh\nWhy not flip?  somebody gotta pay for this\nAnd we know who did it man it's time for that shit\nGo around they way and spray them clips\nAnd watch niggas lay down like naked chicks\n\n[Hook]\nYou go out for me, I'm goin' out for you\nTough love (tough love)\nIt's the crew for one, and one for the crew (yeah)\nIt's tough love (tough love)\nNo matter the bullshit the world put us through (*gunshot*)\nTough love (tough love)\nY'all my motherfuckin' niggas and you know what I'd do\n(HEY YO CHECK IT OUT)\nBust slugs (bust slugs)\n\n[Havoc]\nThat's right my niggas and niggettes\nIt's that certified Mobb shit (God DAMN!)\nStay tuned, know what I'm sayin'\nAnd get that motherfuckin album and stay, in-tune\nYa' heard  (yeah)\n\n[DJ Whoo Kid]\nMobb Deep\nFree agents (HA-HA, HA-HA)\n(*gunshots*)", "image": "https://images.genius.com/8a94d4d15bcdf43ddb8ce2cdbfde357c.455x455x1.jpg"}], "artist": "Mobb Deep"}