{"songs": [{"title": "Don’t Like", "album": "The Black Bar Mitzvah", "year": "2012-10-22", "lyrics": "[Verse 1: Rick Ross]\nI seen a homeboy die in cold blood\nEyes rolled in his head wasn't no love\nHis momma sold pussy daddy was a fiend\nHe from a place where niggas don't believe in dreams\nNiggas snorting powder (Maybach Music)\nI seen a homeboy die in cold blood\nEyes rolled in his head, wasn't no love\nHis momma sold pussy, daddy was a fiend\nHe from a place where niggas don't believe in dreams\nNiggas snorting powder, get your head right\nGet your dick sucked, sittin' at the red light\nNow you catchin' cases\nTalkin home invasions\nHow you get a bond\nHow the fuck you playin'\nCan't be playin games on the home field\nOpen up like a YAGHHHH, when that dome peel, YAGHHH\nWe didn't have shit when we went to school\nNow it's flatscreens up in every room\nNigga do the math bucket full of crab\nTub full of money candy on the slab\nTeflon underneath my fresh tag\nBal harbour walkin out with 40 bags\nI could fuck a model for an autograph\n8 cars, still make her call a cab\nShoutout to Def Jam\nShoutout to Warner Brothers\nShoutout to Dope Boys\nWe all need each other\nI’m in Anguilla, I’m smoking killer\nWe run the game, pussy boy go cry a river\n\n[Chorus: Chief Keef]\nA fuck nigga, that's that shit I don't like\nA snitch nigga, that's that shit I don't like\nA bitch nigga, that's that shit I don't like\nSneak disser, that's that shit I don't like\n\n[Verse 2: Kanye West]\nThey smile in my face is what I don't like\nThey steal your whole sound: that's a soundbite\nThe media crucify me like they did Christ\nThey want to find me not breathin' like they found Mike\nA girl'll run her mouth only out of spite\nBut I'd never hit a woman, never in my life\nI was in too deep like Mekhi Phife'\nIn that pussy so deep I could have drowned twice\nRose gold Jesus piece with the brown ice\nEatin' good: vegetarian with the brown rice\nGirls kissin' girls ‘cause it's hot, right?\nBut unless they use a strap-on, then they not dykes\nThey ain't about that life, they ain't about that life\nWe hangin' out that window: it's about to be a Suge night\nFree Bump J, real nigga for life\nShoutout to Derrick Rose, man, that nigga nice\nShout out to L-E-P, Jay Boogie, right?\nChief Keef, King Louie, this is Chi, right? Right?!\n\n[Chorus: Chief Keef]\nA fuck nigga, that's that shit I don't like\nA snitch nigga, that's that shit I don't like\nA bitch nigga, that's that shit I don't like\nSneak disser, that's that shit I don't like\nDon't like, don't like\nA snitch nigga, that's that shit I don't like\n\n[Verse 3: Chief Keef]\nFake Gucci, that's that shit that I don't like\nSmokin' on this dope, higher than a kite\nThis bitch gon' love me now, she gon' let me pipe\nScreamin', \"Sosa, that's that nigga that I like!\"\nI don't want relations, I just want one night\n‘Cause a thirsty bitch, that's the shit that I don't like\nI got tats up on my arm ‘cause this shit is life\nAnd I stunt so much in clothes ‘cause I'm livin' life\nI come up on the scene, and I'm stealin' light\nBitch, I'm high off life, got me feelin' right\nBitch, I'm Chief Keef, fuck who don't like!\nAnd, bi-bi-bitch, we GBE, we just go on sight\n\n[Chorus: Chief Keef]\nA fuck nigga, that's that shit I don't like\nA snitch nigga, that's that shit I don't like\nA bitch nigga, that's that shit I don't like\nSneak disser, that's that shit I don't like\n\n[Verse 4: Jadakiss]\nI done sold purple, I done sold white\nRunnin' outta work, that's that shit I don't like\nShe never let me hit it, she gave me dome twice\nShe blowin' up my phone, that's that bitch I don't like\nNah, jean jacket with the sleeves cut\nPut the pressure on 'em, just when they think that I eased up\nThirty for the Cuban, another thirty for the Jesus\nBelieve in ourselves when nobody else believed us, suckas!\n\n[Chorus: Chief Keef]\nA fuck nigga, that's that shit I don't like\nA snitch nigga, that's that shit I don't like\nA bitch nigga, that's that shit I don't like\nSneak disser, that's that shit I don't like", "image": "https://images.genius.com/7a562a064cb983f896e86fc8449cc163.658x658x1.jpg"}], "artist": "Rick Ross"}