{"songs": [{"title": "Maniac in the Brainiac", "album": null, "year": null, "lyrics": "Intro: Cube\n\nIn every game, we gotta have the brains and the muscle\nThe game and the hustle... to be real on these streets\nSo here you have it, the Brainiac\nFemale voice Ice Cube\nWith the Maniac\nFemale voice Mack 10\n\nMack & Cube: Yay-y-yay! X2\n\nVerse One\n\nIce Cube:\n\nWhile ya'll niggas think about the papé\nI think about which Titanic I'mma sink\nThe iceberg, with the nice words\nI slice verbs and predicets, ghetto etiquette\nY'all better get, this dime-mega shit\nThe Braniac, the theory be conspiracy\nKeep my eye on the birdie, but never get my hands dirty\nVerbally call the Maniac and his attack dogs\nSigning contracts with automatic jack clause\n\nMack 10:\n\nI get full of their shit and take flight on these niggas\n'Bout to show these so-called\nWig-splitters and nigg-hitters\nWho the man be, and what the number one clique is\nLet my nuts hang on these busts\nAnd hoes see how big my dick is\nManiac Mack 10 always keep the heat toted\nAnd teflon tips keep the .44 loaded\nStraight quoted in nine-trey, by the dime\nNow we connected\nHe said, \"Mack, when you westsidin' and ridin' is expected\"\nSo I...\n\nChorus\n\nCube: Brainiac with Maniac, Mack 10!\nMack: You do the drivin', while I do the jackin'\nCube: Brainiac with Maniac, Mack 10!\nMack: My nigga if you plot it, best believe I got it\nMack: And it's on... feel the chrome\n\nVerse 2\n\nIce Cube:\n\nYou in the Stargate, trying t'escape, it's not an option\nGot torture techniques for them lies, don't ever lie\nJust put the car in drive, we can go ride- get this money\nDetermined as the Energized Bunny, make a left\nUnderground parking, guns start sparkin'\nATF enemies all around start chargin'\nTryin' to fuck up my new suit and my weekend\nAsk me what you want, you bitch! I ain't speakin'\n\nMack 10:\n\nShit, I gives a fuck what the next nigga think\n(?) gives a fuck how much bitch you say you ain't\nIt's like this on mine, potna\nBy all means, I got the ball\nSo it's your life, not mine nigga, so you make the call\nNow, I can blow your brains out, punk and act the fuckin' fool\nOr you can hand your guns over, and let everything be cool\nBut know this: I won't hesitate to peel your wig back\nI'm off that wet-bomb and the whole fifty yak\nIt's Mack the Maniac, nigga\n\nChorus\n\nVerse 3\n\nIce Cube:\n\nWhat's the plan? Everything thought out\nEverything bought out, like Bill Gates\nMy niggas love steel weights\nI'm still great, after 12 muthafuckin' years\nI (?) your ass after 12 muthafuckin' beers\nI act kind to my peers and everybody that listen\nThey know when the Brainiac's missin'\nThe big fish, hanging with the chicken hawk\nGot all the haters, claimin' that they wanna talk\n\nMack 10:\n\nYou argue wit 'em and negotiate, and I really wanna kill 'em\nI'm tired of the bullshit, man I really wanna peel 'em\nDog, I knew they were scareless\n'Cause my brother Snoop told us\nSo fuck the money and the dope that they punk-ass owe us\nNow when I see 'em, it ain't no question it's all the way on\nBut I'mma wait in front of they momma house\nFor that one nigga to get home\nAnd when I gun, watch his body jump\nAnd it's all going to amaze me\nTo see his own self\nLayin' there with his own brains on the pavement\n\nChorus\n\nOutro: Mack 10\n\nAnd it's on... keep takin' 'til it's gone\nAnd it's on... feel the wrath of the chrome\nWessiiide!\nIce Cube the Brainiac\nMack 10 the Maniac", "image": "https://images.genius.com/c457bbdb72f694aa2707c388b36e7230.960x764x1.jpg"}], "artist": "Ice Cube"}