{"songs": [{"title": "Menace to Society", "album": "ScHoolboy Turned Hustla", "year": "2008-07-29", "lyrics": "[Verse 1: Schoolboy Q]\nDreaming to be a menace, me and my two brothers\nWith three mothers, but no fathers and no bitches so fuck it\nShoemaking '96, make the best of it\nLicking on the thumbs, wipe my shoe, because I just scuffed it\nJust another day, another gat buzzin'\nLying up in first grade, like we all fucking\nYou want to fight? We all fight! See, we all rushing\nStreetlights is home, when I'm home mom is [?]fuzzin\nWaking up for the proper time to sneak, jump out at the window\nNow we back up in the streets\nWho got the weed?\nWho got the liqour?\nWho got the flow?\nWho about to rip ya?\nSpit my lyrical shit, now we back up on the bitch\nSaid we're dreaming that we're stars, while we point at different cars\nWishing that we rich, but sooner or later reality hits\nSooner or later our memory switch\nDifferent gats and different clips\nSteady relaxing on the strips\nThinking life is just a bitch\n\n[Verse 2: Punch]\nPost traumatic, cocaine repulsive habits\nRavish the black masses on the Reagan era\nThe reign of terror the masses, the birth of a nation\nFree basing, babies craving a vaccination in this world\nAnd it's desires slowly passing through the fire\nWhen I wish to do right, what is wrong got expired\nKnow i'm preachin' to the choir lost in this quagmire\nSitting on fools gold, 24\" inch, I ball wise\n[?]\nAnd honestly, the truth will set you free\nAnd yall all liars\nI'm giving them food for thought, since they say they ain't eating\nComplaining about hunger pains, in reality they teething\nThey ain't ready for the other side, they're overworking\nTransmission, slow down to check the mileage\nThe road to riches stay crowded, fake smiling\nViolence in the mist of it all, remain consciousness\n\n[Verse 3: Schoolboy Q]\nYo, sitting up, locked in my room, writing my thoughts\nTrying to get it across, but half of my niggas is lost\nIt's like, niggas rather claim a set, than earn a check so fuck it\nHit the burner aim it high up at your neck and bust it\nWhoa it's that easy, that's how you rock it\nDamn, that's how you chop it\nCome on, let's get it popping\nOver these guitars, see me spitting my scarves\nSee, it really gets hard with a felony charge\nThey send a nigga to jail, it was like living in hell\nWith that \"F\" on your record, yo, you're destined to fail\nNiggas try to get a job, they figure you rob\nSo it's back to the street life, living it odd\nYour funds go up, that's when a nigga head blow up\nUntil you floss around a wrong nigga, hair growned up\nIt's kinda strange, when I started, I was already finished\nAdapted to my enviroment, born to be a menace", "image": "https://images.genius.com/72de999ec4144de78b4aca2000e5694f.500x500x1.jpg"}], "artist": "ScHoolboy Q"}