{"songs": [{"title": "Retrogression", "album": "Welcome to Strangeland", "year": "2011-11-08", "lyrics": "[Intro: Tech N9ne]\nWhat is this in the distance?\nMy drug begging for commitment\nMan I'm gonna do what they say\nRelease and just retrogress with ¡Mayday!\n\n[Verse 1: Tech N9ne]\nI'm thinking of retrogression, about going back to my best friend\nOn a X Binge, but the uncut, Molly, will you kill me is the question\nI miss sessions with about two chicks on deck\nIn my bed undressing now we meshing pressing\nSex and sweating left an empress of heaven\nI used to boost her with Adderall, my teeth would chatter all gnaw\nIt really don't matter y'all, I'm cool\nLike the cigarettes, I was a bigger threat to the clitoris\nSuccessful sexually bit her neck get her wet\nJust how high can a nigga get\nBlasted acid, F-asterisks-C-K, coulda' he say\nHe may crash it fit to replay D-Day ashes\nI take masses so I could stay plastered\nThat great plastic I ate like bait in Lake Placid\n\n[Bridge: Tech N9ne]\nMolly I miss you, if I was to kiss you\nWill you take this sick fool to gold days\nI know you can lift moods when I'm having issues\nI wish I could split smooth to the old days\n\n[Hook: Tech N9ne]\nIf you feel like their plan don't fit us all\nThen you will find my land don't give us law\nIf you feel like not taking that bigger fall!\nThen with all respect if we retrogressed\nThen they'll rid us all!\n\n[Verse 2: Wrekonize]\nOkay so lets go, retro-gression I'm guessing that Wrek knows\nThese memories all in my flesh though, strange love, he's in a depeche mode!\nSome of the greatest sex woes that ex-ho\nAnd if I was bringing a Vicks tips to her lips\nIt was for something that she'd never let go\nI drink shots with her laughed and smoke Newports\nThe time we spent was too short, my mind is heading due north\nMy body's on its true course, this woman has got my youth sore\nAnd tooth raw, all of the lights are leading me through a new door\nCan't we just go back? Can't we just reunite?\nI need a throwback to seeing you in flight\nYou had that down south body with a hint of death\nPicked you up and held you down, sound until I went to rest\nBut who needs rest, when the world is gone\nEverything is burning so I'mma just alert the globe and hurt you slow\nYou're known for fast love and vertigo, so I'll just\nPick you up and get a little intimate in a minute\nA cue for the return of a virgin soul\n\n[Hook]\n\n[Verse 3: Bernz]\nI tuned 'em out, I-I tuned 'em out\nToo busy turning on it dropping out\nBehind my, my mama's house, producing clouds\nNever understood my need to get numb\nMeanwhile I'm bleeding out my eyes\nHeaving out my lungs, trying to avoid the sun\nCurious at a young age for a taste, watching them numb they faced\nTill Caroline found someone for us to bring out on dates\nI call it youthful curiosity, jumped the edge every saturday\nStrobe lights and low lifes the city at night was calling me\nI turned 'em out, I-I-I turned 'em out\nHad 'em both kissing on my lips\nThen smoked the spliff to boost the trip\nLift off, I'm gone, phone call my bro, let him know that I'm lost\nAnd I got sand in my shoes from twilight beach - Menage a Trois\nHeavily sedated I, grew up with jaded eyes\nSee she's been friends of mine since '99\nBut now we don't see eye to eye\nCan't retrogress, unless life gets too heavy for my chest\nThen I be tuning out and caning dropping out before they win", "image": "https://images.genius.com/4392f3223b9e5965e7f76dc529941352.1000x1000x1.jpg"}], "artist": "Tech N9ne"}