{"songs": [{"title": "Wu-Gambinos (Shaolin remix)", "album": null, "year": null, "lyrics": "Intro:\n\nAnd in our line of work, we need all the help we can get\nTony Wind is the name, he works for a drug ring in Central America\nWho wants to kill him?\nNo information, say yes or no\nOne point five million\nAll right, you get what you want -- money's no object\nThey're all clean, no serial numbers, untraceable\nAnd there are explosive head bullets, in the clip\n\n[Raekwon, Ghostface, (Method)]\n\nYo yo yo yo yo yo yo-yo, here come the cop man\nYo Starks come here, come here Sun\nCome here for a minute!\nAiyyo aiyyo hold up hold up\nShit we gotta go to the store for more baking soda\nYo yo yo get your fuckin, yo this made of glass nig!\nGet your big Adidas off my moms table man!\nGet the fuck off it man\nYo just chill man, pass the Crystal man\nNiggas is greedy man, damn\nBig ass shits\nYo man you ain't smoking none of that weed in here man\nChill man\n\nBobby Steels\nSomebody go to the store man\nSup kid?\nGet that baking soda\n(Yo!) Let's cut the pie five ways\n(Noodles) We came off with two mil kid\nFast (Rollie Fingers, no doubt coming through)\nLa cosa nostra\n(Johnny Blaze!)\n(Lou Diamonds!)\nRepresent kid\n(Tony Starks)\nUniversal frontier\n(Original blood claat bad bwoys)\n\nChorus: Method Man\nWho come to get you? None. They want guns!\nI be the first to set off shit, last to run\nWu roll together as one\nI call my brother Sun 'cause he shine like one\n\nVerse One: Method Man, a.k.a. Johnny Blaze\nCheck it\nScriptures hit the body like sawed off shotties\nLike my hair notty and my nosepiece snotty\nFuck a nigga hottie, that whole pussy probably\nBurn like the deserts of Mogabi, for real\nAin't nothing fraudulent here, we pioneer\nCommandeer a new frontier, this be the Wu yeah\n36 Chambers of fear, huh, you lost it\nInformation leaking out your faucets, hmmmmm\nTime to forfeit your crown and leave the ground\nThere's a new sheriff in town holdin it down\nIt's the two holster, shit shot smoker\nWanted dead or alive, bounty on the poster\nWild in the West, a student of my culture\nAnd life is the test, hold up\nLet a nigga catch his breath, we still paying dues\nAnd the last one is death, back to the essence\nWith that shit you stressing, this rap profession\nNow peep Tical, the son of the Shaolin\nIsle plus my style, Criminology pays\nThe last times and days, Johnny fuckin Blaze\n\nVerse Two: Raekwon the Chef, a.k.a. Lou Diamonds\nThis goes for niggas who know\nWu will grow like llello, ley no, plus coolin in Barbados\nRicaans be givin me much shit, the dutch shit\nStay cool papi, seize it with enough shit\nBack at the lab a, crack's bagged up\nYo niggas act up, what blow up the workers if they hafta\nSenoritas, fuckin up a storm buyin guards margaritas\nSuckin his dick, up in the whip long\nDesigned for rhyme prime nigga jail time jiggas\nThem niggas up in Height figures bitin niggas\nSilks Wally-Wear finger rolled chain yeah\nJakes beware black rap millionaires\nRock hairs leather goose bears blowin this year\nOne eight hundred gambino niggas yeah\n\nMeth:\nWu roll together as one\nI call my brother Sun 'cause he shine like one\n\nVerse Three: RZA, a.k.a. Bobby Steels\nSolid gold crown is shinin\nSolid gold, check it Sun yo\nSolid gold crown be shinin and blindin like some diamonds\nI be pioneering the style in the cloud with silver linings\nDouble breasted, bullet proof vested, well protected\nThe heart the rib cage the chest and solar plexus\nCasting stones, cracking two-hundred and six bones\nAnd watch yo' ass get blown to a sea of fire and brimstone\nHow dare you approach it with dim pones\nThe overfiend like noah bean green souls with a soldier mean\nThe grand exquisite imperial wizard oh is it\nThe Ryzarector come to pay your ass a visit\nLocal bio-chemical, universal giant, the black general\nLickin shots to Davy Crockett on the bicentennial\nHappen millenium two thousand microchips two shots of penicillin\nGoes up your adrenalin son it's time for boutin\nIt's a mileage resemblin niggas who like followin\nTrapped inside your projects like a genie inside the bottle\n\nVerse Four: Master Killer\nGod steppin forth upon holy down of the track\nIt's the sound that surrounds and hurts me like I'm under attack\nSo I decided to bite down on the mic\nSo the pain of the track won't deny the fact\nThat I'm the Master, for what lurks, is an expert\nThat hurts the individual who tries to visualize under\n'Cause I strike, like thunder\nNiggas couldn't stand my heat, it's unbearable\nMy wisdom fucks up your respiratorial\nSystems are fractured by the killa tactics\nStyle is ragged and thoughts are mad jagged\nEnter the entity, my vicinity\nIs three hundred and sixty degrees of humidity\nRepresent the school of hard knocks and Glocks my\nClan is hoss and got mad moss for blocks so\nFeel the force of impact from the iron side of\nThe gat as I attack the track\nFrom the blind side of the pack, Starks pass the chrome\nWatch a nigga get blown out his muthafuckin dome\nPiece, deceased, laid to rest\n\nChorus\n\nVerse Five: Ghostface Killer, a.k.a. Tony Starks\nYo, aiyyo I got to serve them my way, move give me room\nHoldin up your saloon, clean sweep, like a broom\nFull moons make me howl like a wolf outta breath\nSold only new vocal cords I heard Genius on Gef\nSo step back, to the lab at, high velocity\nMy teammate, enhance cells well like a pharmacy\nFuck horado pablos plan growas bravo\nGoodfellas we know, best sellas become novels\nThe man rockin head bands, silk scarves and jams\nEarly 80's british rock, playboys, mocks, and shams\nThe laser beam vocalist does well at symphonies\nBad days, watch me snatch ice right outta Tiffany's\nRemember them kids that came off with 8 million\nRobbed the Brinks and I labelled in royal pavillions\nThem flower heads must have been stupid\nTell me how the fuck black niggas get caught wit all that loot kid\nThat's jet money, undaground money\nSubmarines and rings too bad you fucked up dummies\n\nCosa cosa, come on...", "image": "https://images.genius.com/32fabf2b8b2eb256a0e1d6a14a76852f.500x500x1.jpg"}], "artist": "Raekwon"}