{"songs": [{"title": "Komradz (So So Crazy)", "album": null, "year": "1995-10-28", "lyrics": "[Intro: 2Pac]\nWell, I just heard some shit on this record\n(Fuckin' in the midst of my comrades)\nI send this out to that biatch; you too, nigga!\n(Standin' in the midst of my comrades)\nYou fuckin' with some thug niggas (That's right)\nBelieve that like you believe crack kills, you stupid mothafucka!\n(Fuck you! Standin' in the midst of my comrades)\n\n[Hook: 2Pac]\nYou must be so so crazy\nBitch, I'll beat your boy bad\nStandin' in the midst of my comrades\nBitches can't fade me\nPlottin' but they ploys crashed\nFuckin' with the midst of my comrades\n\n[Verse 1: 2Pac]\nHave you really thought about your part in this participation?\nMy prediction bloody murder similar to ministration\nNow in fairness to conversation\n‘Cause it's your fate so take the time\nTo contemplate what you'll be facin'\nTalkin' that Hip-Hop shit, don't get shot, bitch\n‘Cause you can tell all in your clique to eat Pac's dick\nThe clip's in, prepare for the mothafuckin' death blow\n‘Cause every rapper in the industry is history, it's Death Row\nNot Bad Boy or So So Def\nI make you bow before Tha Row like them other hoes\nThe intricate design of my lethal lines, criminal rhymes\nFrom the mind of a thug shaking state time\nTake it to the next phase; you had your time to talk shit\nNow bitchless busters getting checkmated\nThese days mothafuckas talk shit and turn snitch\nWhen you see 'em they ain't talking about shit; Westside!\n\n[Hook: 2Pac]\nYou must be so so crazy\nBitch, I'll beat your boy bad\nStandin' in the midst of my comrades\nBitches can't fade me\nPlottin' but they ploys crashed\nFuckin' with the midst of my comrades\n\n[Verse 2: EDI]\nSee, by now the way this shit is situated\nNiggas is getting eliminated simply for being affiliated\nClearly stated and, man, I know you hate it\nWe got a whole list to play with\nAnd y'all niggas is at the top, now let's make this\nHappen, fuck the rappin', let's get to scrappin'\nSo niggas can see what happens\nWhen you get caught up in dirty-mackin'\nEDI'll send you packin', you know we love action\nSneak up on attack, pull back, let's the slugs snap in\nYour chest section, Death has now stepped in\nBitch, should have learnt your lesson\nWhile your chance was still present\nBut now it's past tense, no question askin'\nOut West it's called mashin', bailing the corner blastin'\n\n[Hook: 2Pac]\nYou must be so so crazy\nBitch, I'll beat your boy bad\nStandin' in the midst of my comrades\nBitches can't fade me\nPlottin' but they ploys crashed\nFuckin' with the midst of my comrades\n\n[Verse 3: Napoleon]\nYou must be so so crazy; bitch, I'll beat yo' boy bad\nDriving in the truck with my black MAC\nThinkin' about the shit I never had, so I'm loading up one\nAnd the two things that I cherish is money and guns\nI love my ones and I'll put blood on you\nSnatch money from you, leave slugs in you\nAin't no nigga breathing fucking with Pac\nEvery album that he drop, nigga, number one spot, nigga\nLocked, nigga, let me represent for my dead ones\nEat with my loved ones, squeeze when the beef come\nChill when the freeze comes, I do that shit\nYou think you heavy in the game? Watch me move you, bitch!\nThis Napoleon, why did I say I again?\nYou punk niggas already know I ain't for show\nAnd I'll die for the dough, nigga, that's for sho'\nNever die for a ho, nigga, that's a no-no\n\n[Hook: 2Pac]\nYou must be so so crazy\nBitch, I'll beat your boy bad\nStandin' in the midst of my comrades\nBitches can't fade me\nPlottin' but they ploys crashed\nFuckin' with the midst of my comrades\n\n[Verse 4: Big Syke]\nWho I'm gonna call when a mothafucka feeling sad?\nMy mothafuckin' comrades\nWho I'm gonna call when a mothafucka doing bad?\nMy mothafuckin' comrades\nAnd fuck yo' bitch, ‘cause you a trick anyway\n‘Cause my comrades was raised on pistol play\nAnd boss playerism mixed with this thugism\nSo ain't no love in 'em, nothin' but the fuckism\n\n[Verse 5: 2Pac]\nLast verse is for them trick people, this is the sequel\nI'ma treat you with evil, living forever illegal\nNow homicide got me preoccupied\nBe a lie if I told you that I never wonder when will I die\nBe assured, nigga, word born\n‘Cause now it's on, you can only survive if you be strong\nUntil I'm gone I'll bust on Bad Boy\nMiddle finger to Da Brat, don't get your young ass smacked\n\n[Hook: 2Pac]\nYou must be so so crazy\nBitch, I'll beat your boy bad\nStandin' in the midst of my comrades\nBitches can't fade me\nPlottin' but they ploys crashed\nFuckin' with the midst of my comrades\n\n[Outro: 2Pac]\nLook here, you mothafuckas knew when you wrote this shit\nWhen you spoke this shit, when you smoked this shit\nUh, that you couldn't fuck around with us\nNow what the hell possessed you to get on record\nAnd play yourself like that?\nNigga, is you fuckin' nuts? Do you know who the fuck we are?!\nNigga, do you know who the fuck we are?!\nRectify yo' silly ass, you better put out an apology out, nigga\nBefore I yank that ass out the game, stupid mothafuckas!\nDon't you know I don't give a fuck?\nI'm mad at the world, fuck all you trick-ass niggas!\nThis Thug Life, nigga, Outlaw Immortalz, Westside\nThought you knew, Westcoast, nigga\nAll day long, fuck the world!\nYou must be so so crazy; bitch, I'll beat yo' boy bad\nStandin' in the midst of my comrades, ha ha ha\nFuckin' with the midst of my comrades\nMy mothafuckin' comrades!", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}