{"songs": [{"title": "Want That Old Thing Back", "album": "Greatest Hits", "year": "2007-03-06", "lyrics": "[Intro: Puff Daddy]\nUh yeah, Bad Boy baby\nRalph Tresvant\nBiggie Smalls\nListen...\n\n[Pre-Chorus: Ralph Tresvant]\nUh yeah baby oooooooh, listen to me, oh yeaaaah\n\n[Verse 1: Notorious B.I.G.]\nWhen it comes to sex, I'm similar to the thriller in Manila\nHoneys call me Bigga the condom filler\nWhether it's stiff tongue or stiff dick\nBiggie squeeze it to make shit fit, now check this shit\nI got the pack of Rough Riders in the back of the Pathfinder\nYou know the epilogue by James Todd Smith\nI get swift with the lyrical gift\nHit you with the dick, make your kidneys shift\nHere we go, here we go, but I'm not Domino\nI got the funk flow to make your drawers drop slow\nSo recognize the dick size in these Karl Kani jeans\nI'm in thirteens, know what I mean\nI fuck around and hit you with the Hennessy dick\nMess around and go blind, don't get to see shit\nThe next batter, here to shatter your bladder, it doesn't matter\nSkinny or fat or light-skinned or black, baby, I drop these\nBoricua mommies screamin' \"Ay papi!\"\nI love it when they call me Big Poppa\nI only smoke blunts if they rolled propa\nLook, I gotcha caught up with the drunk flow\nFuck tae kwon do, I tote da fo'-fo'\nFor niggas gettin' mad cause they bitch chose me\nA big black motherfucker with G ya see\nAll I do is separate the game from the truth\nBig bang boots from the Bronx to Bolivia\nGettin' Physical like Olivia Newt\nTricks suck my clique dick all day with no trivia\nSo gimme a ho, a bankroll and a bag of weed\nI'm guaranteed to fuck her till her nose bleed\nEven if your new man's a certified mack\nYou'll get that H-town in ya, you'll want that old thing back\n\n[Chorus: Ralph Tresvant]\nWhat you wanna do?\nI got that old thing back\nWhat you wanna see?\nBaby, sing relax and feel\nWhat you be, where you are\nYou wouldn't start\n\n[Verse 2: Ja Rule]\nBitches screamin' they want that old thing back\nLike B I Double G I E\nWith some new R-U-L-E\nNotorious known for bustin' in ya E-Y-E, baby baby!\nBitches know they love to hate me\nI come, you come, we come, with back some maybe\nHow close we came to coming together is crazy\nHow come you and your sis make similar faces\nWhen I come you be cryin' like I'm killin' ya bitches\nKnows when picture in the camera rollin\nCause I only be knowin' how the shit's unfolded\nBack shots to the rear, got the mac unloaded\nGot a reload, like every so often\nYou sayin' I got my swagger back\nI'm lookin' like bitch, my swagger never left\nIt's so hard pressed, to be impressed by these new rappers\nThey actors, and the fact is, you want that old thing back\nShit...\n\n[Chorus: Ralph Tresvant]\nWhat you wanna do?\nI got that old thing back\nWhat you wanna see?\nBaby, sing relax and feel\nWhat you be, where you are\nYou wouldn't start\n\n[Verse 3: Notorious B.I.G.]\nIs my mind playin' tricks, like Scarface and Bushwick\nWillie D, havin' nightmares of girls killin' me\nShe mad because what we had didn't last\nI'm glad because her cousin let me hit the ass\nFuck the past let's dwell on the 500 SL, the E and J and ginger ale\nThe way my pockets swell to the rim with Benjamins\nAnother hon's in the crib, please send her in\nI fuck non-stop, lick my lips a lot, used to lick the clits a lot\nBut lickin' clits had to stop\nCause y'all don't know how to act when the tongue go down below\nPeep the funk flow, really though\nI got the cleanest meanest penis, ya never seen this stroke of genius\nSo take off your Tim boots and your bodysuit\nI mean the spandex and hit my man next\nSex gettin' rougher when it come to the nut buster\nPussy crusher, black nasty motherfucker\nI don't chase em, I replace em\nAnd if I'm caressin' em, I'm undressin' em\nFuck whatcha heard who's the best in New York\nFulfillin' fantasies without that nigga Mr. Roarke\nOr Tattoo I got you wrapped around my dick\nAnd when I'm done I got to split shit\nBack shots is my position, I gotcha wishin' for an intermission\nFuck the kissin', lickin' down to your belly button, I ain't frontin'\nThey don't call me B.I.G. for nuttin, all of a sudden\n\n[Chorus: Ralph Tresvant]\nWhat you wanna do?\nI got that old thing back\nWhat you wanna see?\nBaby, sing relax and feel\nWhat you be, where you are\nYou wouldn't start\n\n[Puff Daddy: Outro]\nBiggie Smalls\nP. Diddy y'all\nBad Boy for life\nOnce again going to the top baby", "image": "https://images.genius.com/e5ebd89c3dc0b8cd2a10590a5dafbcda.1000x1000x1.jpg"}], "artist": "The Notorious B.I.G."}