{"songs": [{"title": "FNF Goin Up", "album": "Lupe the Jedi", "year": null, "lyrics": "We here homie\nVoo doo master, Lupe Fiasco\n\nWelcome back, an invisible storm\nWe've opened up the show put criminals on\nOpened up the stool let em spit a few songs\nShut down the jewels put his tennis shoes on\nTook off his students put his principles on\nDon't believe my hype put the interviews on\nThey don't believe me right you was interviewed wrong\nI'm believe you like a hype I'll put my chemicals on\nIf your such a G why the limiting ya'll\nIf you can say that's me then why the intervenin on\nSee my whole crew is ? on\nJust the word of me 1st & 15 on\nFor the past year had to get my lean on\nStay away from the streets I was glittering on\nOnly bread was where heralds? put my chicken wings on\nI was said to be short, but now I'm limousine long\n\n(Chorus)\nLupe and his crew done came up while you was sleepin\nFNF goin up (x2)\nThey hate but they study and watch you they can't see em\nFNF goin up (x2)\n\nI'm 5 years deep had deals galore\nWhat they feelin now, I had to feel before\nAnd what they feelin now I used to kill before\nGrown man now I was lil before\nAnd what's phony now wasn't real before\nTold chill I wasn't ready, had to chill some more\nKnew that I was hot but I wasn't cool enough\nSo I said I had to sit on the sill some more\nAnd from the blocks where I made the raw\nBroke down the raps and waged the war\nI waited in the water and layed the law\nI almost didn't make it man I braved it all\nWhen niggas couldn't take it man I shake it off\nWore my hat where you couldn't break it off\nGot a respect for the set, I would take it off\nAnd walk down the same block from shit that you get chased off\nAnd that's gangsta ya'll\n\n(Chorus)\n\nYou see boo Lu\nI've been around the block and I done been around the millionaires\nBeen seated at the power meetings, yeah! I know how it feels in there\nSee its one thing to be put on\nIt's another thing to own\nNiggas don't feel that there, na\nNiggas is A.C. and I'm ocean breeze\nHomie do you feel that air? where\nI'm from West Madison\nFans across the world that's where that begun\nWith this flow that was wack to some\nThey ain't catch until that feedback from Young\nWell he's back and brung?\nThe same flow no fun got his back to em\nMore Lu for you, my girls and my niggas\nRIP to em, God forgive us\n\nChorus (x2)", "image": "https://images.genius.com/cd4d83021b7debccabee0705b6c17c4e.499x499x1.jpg"}], "artist": "Lupe Fiasco"}