{"songs": [{"title": "Gladiators", "album": "May 25th", "year": "2010-02-01", "lyrics": "[Verse 1: B.o.B]\nOkay, so I'm on the beat, what am I supposed to rhyme?\nWhat am I supposed to do in this booth? Am I to flow a line?\nWhat am I, a spokesman now? What am I, a poster child?\nWhat am I supposed to smile?\nWhat am I supposed to be the dopest MC to hold this down?\nWhat if I wasn't poor as a child?\nWhat if I didn't grow up in doubt?\nI probably shouldn't be smoking so much, my mind is over fried\nBut still I notice how them same folks will smile\nIn your face, but behind your back them same folk will frown\nBut that's enough about them, talk about me\nYes, B to the O, I said B to the O\nAnd to the B, I owe it to the streets\nAnd I ain't trying to brag, but you know your boys a beast\nAnd yeah I gotta eat cause my groceries on this beat\nAnd my song will carry on 'til I no longer speak\nMy soul is also Kosher added to the fact I'm cheap\nAnd I put that on my grandma, Othella, so rest in peace\nHater\n\n[Ad-Libs: J. Cole]\nYeah, nigga\nHey, yeah, nigga\nHey\n\n[Verse 2: J. Cole]\nAyy, many blessings sent from heaven, thanking God to be alive\nFlight attendant woke me up said, \"Mr Cole you have arrived, welcome\"\nIn this game the price of fame is steep, Lord help 'em\nKeep 'em sane, prayin' that the heat won't melt 'em\nI'm headed to the top, I couldn't be more welcome\nTook the lead role, now look I'm right outside your peephole\nThat's for the crown holders, never would I dethrone\nBut if you ever leave home, don't worry, I keep your seat warm\nSo yeah, I'm Simba in a sense, I'm the prince\nYou impostors no Mufasa's, but there's Oscars for you gents\nWhen I say I'm better then you niggas don't mean no offense\nBut is clear with no tints, man, just check the fingerprints\nYou'll see we not the same, I got a shit list with lot's of names\nAnd plus hit list with of rappers I'ma cock and aim\nThen it's who shot ya, mane? Finally figured out the game\nGot nuttin' to lose, and a whole fuckin' lot to gain\n\n[Outro: J. Cole]\nWhat\nYeah, nigga\nJ. Cole, nigga\nUh, yeah, B.o.B., nigga\nUh, ATL [?]\nBoy, Grand Hustle, nigga\nRoc Nation, nigga, Dreamville\nYeah", "image": "https://images.genius.com/51bfc55fdc338bff1c957159669698ce.320x320x1.jpg"}], "artist": "B.o.B"}