{"songs": [{"title": "​​voice memo 4 - the remedy for a broken heart", "album": "? (Deluxe)", "year": "2019-09-06", "lyrics": "[Intro: XXXTENTACION & John Cunningham]\nThis brings the vibe of 17 straight into this new album and it's enough for people to be like okay, okay\nExactly exactly, it's like you don't need to give them 6, 7 songs that were the old vibe\nYeah\nIt's like if there was one that was the updated version of 17, yeah\nExactly!\nShould this be number 1 on the album? I don't know\nI feel like it's fire\nI just, it might just be a hit to be honest, it might be a hit and like my mind\n'Cause you're part of my energy now, so it's like when you hear a song from me it's almost like you're hearing the song from yourself so it's like you know my capabilities\nSo it's like, you know what I'm saying? Yeah\nBut this- but like my capabilities are so endless that for other people it's like, uh, you know what I'm saying for something like this they be like Yeah, yeah yeah yeah\nThat's the great question, you wanna give back to the one.. there you go\n\n[Refrain: XXXTENTACION & John Cunningham]\nWhy am I so in love?\nWhy am I so in love? And in it come, yeah that's how it should start\nWhy am I so in love? Damn, this is hypnotizing\nWhy am I so in love?\nWhy am I so in love? Aw, this is fire\nWhy am I so in love? This is fire, yeah\nWhy am I so in love? Just a lil' bit a weed with a lil', yo yeah, yeah, yeah, yeah, yeah, yeah, that's it, that's it, that's it\n\n[Interlude: XXXTENTACION & John Cunningham]\nAnd the other one comes later on\nDo you want the other one\nAnd the other one comes in at the END Yeah\nThis is the perfect intro Yeah, yeah\nWhy am I so in love?\n\n[Chorus: XXXTENTACION]\nMix a little bit of weed with a little bit of cash\nWith a little bit of this, with a little bit of that\nWe gon' be al-, we gon' be al-\nWe gon' be al-, we gon' be al-\n\n[Verse: XXXTENTACION]\nSteady tryin' to maintain\nSame things that'll blow a bitch mind frame\nMy brain can't fathom what the hate say\nHe say, she say, how 'bout me say?\nGet the Vis-a, headed to the islands A-S-A-P\nWhat's that on my shawty wrist? That's a AP\nI'm the type to save a bitch, C-A-P-E\nFeelin' like ET, flyin' out of the Addy\nFuckin' on shawty, she baddie, casual convo then at it\n\n[Interlude: XXXTENTACION & John Cunningham]\nWhoa! Jesus Christ\nWhoa, so fire, then where do you want the other one to come in?\nI mean I'm better than better, maybe I'm lyin'\nHuh?\nYou don't want the other one come 'til you start rapping right?\nUntil the end\nOkay cool\nOr it might, it might, so start- yeah right, the perfect mix, the perfect mix I think I know what you're saying, it's gonna be like, yeah it's gotta be like\nYou should like a drop where it like, you should make a drop where it likes, \"So in love\"\nAnd you know what I'm saying, and I'll come in\n\n[Chorus: XXXTENTACION]\nMix a little bit of weed with a little bit of cash\nWith a little bit of this, with a little bit of that\nWe gon' be al-, we gon' be al-\n\n[Outro: XXXTENTACION & John Cunningham]\nThis is what we needed (Attracted)\nYeah, exactly\nWe gon' be al-, we gon' be al-", "image": "https://images.genius.com/1291110191b6552f48f1db25d7cf5134.600x600x1.jpg"}], "artist": "XXXTENTACION"}