{"songs": [{"title": "Be My Friend/High School Dropout", "album": null, "year": "2012-07-31", "lyrics": "[Verse 1]\nI never had a lot of hope\nI looked above and God had spoke\nAnd said I'm only here because my daddy's fuckin' condom broke\nDid I ever go to college? (Nope)\nAnd even got no job for dough\nI'm looked upon like I'm a joke\n'Cause this the shit that I promote\nThe Ill Mind Of Hopsin!\nWhere real life's an option!\nThe ill lines that I spit make you realize you're not sick!\nScience at its finest tell Bill Nye to watch it\nNow turn this shit the fuck up 'til you feel high and nauseous\nYou fake thug rappers be frontin' like you was born with Glocks\nBut only time you ever bang is when the door is locked\nNigga with attitude just without the S curl\nI break rappers like promises with my ex girl\nI'm kinda strange\nAnd I been this way since a young age\nThe biggest book I've read was less than one page\nI've always had slump grades\nNever use a condom like I want AIDS\nA nutcase, I'll smash your fuckin' dreams like a pugs face\n\n[Hook]\nI'm a high school drop out\nStill living at my moms house (My moms house) (Oh yeah!)\nI talk shit and get knocked out\nMy life sucks and I'm not proud\nOhhh do you wanna be my friend\nI would love to be your friend\nCome on then\nDo you wanna be my friend\nI would love to be your friend\nCome on then\n\n[Verse 2]\nMy life's lame, I gotta pay money to fuck a whore\nI couldn't pull a damn anorexic bitch in a tug of war\nI'm sick of big headed niggas feeling above the lord\nSomebody please give Soulja Boy the \"You Suck\" award!\nOut of all the styles you just had to pick the wack shit\nHopsin won't attack you if you practice\nYou faggot little bastard\nI never would have imagined this would happen\nI should fuckin' power drive your ass into a cactus\nYo, the game's mine, go rule you own\nI got a foolish zone\nI'm a schitzo who carpools alone\nRelax this is the music that I make for maniacs\nWho can't adapt with the rest, now watch the chain react\nThe world's cold, open your mouth and let me come inside\nI diss the fuck outta rappers its 'cause I wanna die\nI never face my problems\nShit I always run from mine\nI fucked my life up, now I'm tryin' to give your son a try\n\n[Hook:]\n\n[Verse 3]\nYo, I come from a land where the kids fail to sick hell\nSo if you're frightened by my lyrics and looks bitch, yell\nBrainwashed, by Slim Shady and D12\nCrooked, Ludacris, Missy Elliot, Big L\nWell, y'all know Hopsin, but let me explain who Marcus is\nI make inspiration on music for the retarded kids\nWho suffer from Parkinson's\nWhose bodies have parts missin'\n'Cause it's Special Ed, man you really don't know how hard it is\nYou know I've always been a know-it-all\nI thought that when I'd grow up tall\nI'd get pussy and not be using blow up dolls\nI want more hoes\nI can't control my hormones\nI'm always watchin' pornos in my bedroom with the door closed\nWhoa! Hey Hopsin!\nStop with the mental hacker games\nYou've already brainwashed our son, Alexander James\nHe's only half your age, and now he masturbates\nHis whole perspective on the things that really matter changed\n\n[Hook]", "image": "https://images.genius.com/1620b55458e423f96bf6316d13418223.1000x1000x1.jpg"}], "artist": "Hopsin"}