{"songs": [{"title": "Gimmie A Call", "album": "“Throw Aways” UNMIXED", "year": "2017-08-19", "lyrics": "[Intro: Chance The Rapper, (The Social Experiment), Taylor Bennett]\nJust give me a call\nRing, ring, ring, ring on the buzzer, hugh, hugh\nGive me a call, give me a call\nRing, ring, ring, ring on the buzzer, hugh!\nJust give me a call, give me a call (Give me a call)\nRing, ring, ring, ring on the buzzer, hugh, hugh (Ring, ring, ring)\nGive me a call, give me a call (Give me a call)\nRing, ring, ring, ring on the buzzer, hugh! (Ring, ring, ring)\nJust give me a call, give me a call (Give me a call)\nRing, ring, ring, ring on the buzzer, hugh, hugh! (Ring, ring, ring)\nGive me a call, give me a call (Give me a call)\nRing, ring, ring, ring on the buzzer, hugh! (Ring, ring, ring)\nJust give me a call, give me a call (Give me a call)\nRing, ring, ring, ring on the buzzer, hugh, hugh (Ring, ring, ring)\nGive me a call, give me a call (Give me a call)\nRing, ring, ring, ring on the buzzer, hugh! (Ring, ring, ring)\nJust give me a call, give me a call (Give me a call)\nRing, ring, ring, ring on the buzzer, hugh, hugh (Ring, ring, ring)\nGive me a call, give me a call (Give me a call)\nRing, ring, ring, ring on the buzzer, hugh! (Ring, ring, ring)\nJust give me a call, give me a call (Give me a call)\n(What's up, Chance?)\nRing, ring, ring, ring on the buzzer, hugh, hugh (Ring, ring, ring)\nJust give me a call, give me a call (Give me a call)\nRing, ring, ring, ring on the buzzer, hugh! (Ring, ring, ring)\nJust give me a call, (Give me a call)\nRing, ring, ring, ring on the buzzer (Ring, ring, ring)\nJust give me a call, give me a call (Give me a call)\nRing, ring, ring, ring on the buzzer (Ring, ring, ring)\nJust give me a call, just give me a call, just give me a call\n\n[Verse: Taylor Bennett]\nHow you doing? It's Taylor Bennett, the famous rapper\nI wanna take you out and maybe even party after\nYou can crash in, prolly catch the morning after\nGot booked over paper, that's another chapter\nI wanna move to the hills where the breeze right\nKnow I like it when your pencil start to write\nWe gotta get it on the dance floor tonight\nBaby, I'm a smooth typer, baby, I'm a you type\nWoke about my future, line up reality\nMind of a different galaxy\nMama said eat your vegetables, celery turns to salary\nSelling souls while I'm only addicted to forms of casualty\nCasualty is a tragedy\nYoung cause of catastrophe, drop boy moving galleries\nEvil is just a half of me\nGreatest grace, my anatomy\nAdam and Eve's apple in me, probably screaming feel 'em\nDreamin' thank god for the trade I, for the way I\nRoll up in a Beemer, hold up, slick nigga\nMoving that weight, fit nigga, guap, guap\nRich nigga, doper than dope\nI got bricks in the side of my watch cause my wrist killing\nNiggas be tweaking, I'm tweaking them out\nSo why I'm the nigga you tweeting about?\nTrashy ass rappers, I'm cleaning them out\nSee, be the reason my phone ringing out\nGive me a call about nothing at all\nGiving me calls about nothing at all\nGiving me calls about nothing at all\nGiving me calls about nothing at all\n\n[Harmonizing]", "image": "https://images.genius.com/1a2917ef67ce244005686ddd41a44d7a.720x720x1.jpg"}], "artist": "Chance the Rapper"}