{"songs": [{"title": "Who Are They", "album": "Emeritus", "year": "2008-12-02", "lyrics": "Huh\n\n[Verse 1 - Scarface]\nYou see a nigga with his game tight, money with a name like\n'Face (Face Mob), havin his way, the homie did his thing, right?\nYou just a peon, the type of bitch I'd pee on\nHigh sidin a nigga, rollin in a Neon, now what the fuck was she on?\nI'm \"Prime Time\" bitch like Deion (yeah)\nI Spinks on a ho like Leon\nAnd you are just a castaway, so get your ass away\nInstead of fuckin you, I'd masturbate\nI shouldn't of had to wait, I think you blew your big chance\nYou rejected when I asked about the eighth grade dance\nNow I'm big time, like my homeboy Randy\nPlus I'm pushin a Porsche with drop top panties\nIt's just like candy but I ain't hammy\nYo ho, so yo, ass can't hand me\nShit, fuck your cell phone bitch, you can keep that\nBroke, you ain't know a motherfucker, where was she at?\n\n[Hook - Unknown Female]\nI think I remember you, from way back when, but how can I be sure?\nThat's so long ago and since then we both have grown\nBut look at you, you're amazin\nWhat's so, crazy, I know how niggas do\nCause they get money, change and don't remember who they are\n\n[Verse 2 - K-Rino]\nListen, in high school with the females, I was rarely selected\nI got rejected by the ones the damn nerds rejected\nIf I wore a shirt Monday, this is true, I ain't lyin\nBy the end of the week you probably saw it two more times\nI was discouraged by the microscopic size of my bank\nBut stayed constantly motivated to rise in the ranks\nI used to be a bottom feeder, lowest man on the totem\nBut I showed a mass like the transit sit on my scrotum\nGettin fed by my music and it's all clean work\nAnd the used to be prom queen is a Walgreens clerk\nI would dream about bein with ya, wantin to kiss on ya\nNow I let my damn bladder bust before I piss on ya\nMe and 'face second to none, makin records for fun\nYou thirty-seven at the strip club gettin naked for ones\nBut I ain't trippin, you can hit the room with me, it's fine\nAnd when I bust one on her chin, I'm like \"clean up on aisle nine!\"\n(yeah)\n\n[Hook - Unknown Female]\nI think I remember you, from way back when, but how can I be sure?\nThat's so long ago and since then we both have grown\nBut look at you, you're amazin\nWhat's so, crazy, is I know how niggas do\nCause they get money, change and don't remember who they are\n\n[Verse 3 - Slim Thug]\nThugga, huh\nA +Bitch Ain't+ never been +Shit+ to me\nI've been screamin that since \"Chronic\" popped back in '93\nBack when I was broke in the hood on my ass\nI couldn't get away when the bitch drove past\nNow a nigga seein cash so fast, things change\nSame bitch askin for a ride in the Range\nLookin at a nigga strange, cause I ain't tryin to entertain\nConversation about her becomin my main\nI'm like \"bitch, you must of fell and bump your brain\nAnd think you fuckin with a lame, nope not me mayne\nI ain't got shit for ya, matter fact, I don't know ya\nThat's all I'm a show ya, cause that's all a nigga owe ya\nUsed to be fine, big titties and behind\nHad a few kids, now your belly bigger than mine\nStomach lookin like you had a fight with a lion\nI ain't fuckin with you bitch, move around\"\n\n[Hook - Unknown Female]\nI think I remember you, from way back when, but how can I be sure?\nThat's so long ago and since then we both have grown\nBut look at you, you're amazin\nWhat's so, crazy, is I know how niggas do\nCause they get money, change and don't remember who they are (they\nAre, they are ...)", "image": "https://images.genius.com/6976a10236f881255b574212a02ae481.1000x1000x1.jpg"}], "artist": "Scarface"}