{"songs": [{"title": "Rip (Remix)", "album": null, "year": null, "lyrics": "R.I.P it's the remix killer\nMike Jack was alive, I'd remix Thriller\nTrap star, bitch, spell it with a big T\nGive a damn if I never be a hot MC\nCause I'm a hood nigga, first on everybody's list\nBuy the whole club P, don't fuck with no Cris\nThat average ass watch can't fuck with my wrist\nThem average ass hoes can't fuck with my bitch\nTo the window, to the motherfuckin' wall\nEnough money in my jeans to buy a motherfuckin' mall\nGot the choppas in the back, bulletproof, that's my Hummer\nR.I.P. to the competition, this is my summer\nR.I.P I wanna kill the judge\nTryna lock the homie up, they don't feel the thug\nI'm thirsty, but I don't give a fuck\nFuckin' with my ex cause I'm still in love\nI can teach you how to fuck and how to stack money\nI ain't went Hollywood, you just act funny\nGirl I know you want this pipe like a crack bummy\nStop playin', I'm tryna hit like a crash dummy\nDon't start no shit, it won't be no shit\nI can't take yo bitch if I don't see yo bitch\nWe done seen that snow, Nat Geo bitch\nCancel her and get another like I'm Nino bitch\nR.I.P., R.I.P., R.I.P., R.I.P\nR.I.P. we just killed the club\nTook patron to the head, almost killed a thug\nR.I.P., R.I.P., R.I.P., R.I.P\nR.I.P. we just killed the club\nTook patron to the head, almost killed a thug\nPull up in this bitch and I'm beamin' and shit\nHundred hoes, hundredfold, this my season and shit\nStomach on belly roll, bitch I'm eatin' and shit\nYou a vegan and shit, get off my penis and shit\nLook a bad bitch, I back that bitch nigga back back\nPull it out the grab bag, turn this ho to Baghdad\nBags on my eyes, I don't sleep much, we up\nBitch I beat the beat up, the homies get you beat up\nAnd R.I.P to p-nut, little Eric\nMossberg, 4 Bent, Compton I live that\nLong hair weave with extensions\nGlock 17 with extension\nBumpin' Suga Free in the automatic dually\nT.V.'s in it like it's '97, watch a porno movie\nHolla Chitty Chitty Bang, this is Com-Town gang\nFuck whoever don't like it, lil' K-Dot be the name, bitch\nR.I.P., R.I.P., R.I.P., R.I.P\nR.I.P. we just killed the club\nTook patron to the head, almost killed a thug\nR.I.P., R.I.P., R.I.P., R.I.P\nR.I.P. we just killed the club\nTook patron to the head, almost killed a thug\nR.I.P. to the V.I.P\nI got my lil' niggas in the club, fuck I.D\nMy niggas kill at will, give you black eyed peas\nAnd the molly make the white girl look Chinese\nOHB, my niggas out here ballin'\nAnd all these fake ass artists, y'all niggas out here drawin'\nOk now dearly departed I bought a plane, I departed\nAnd if you started from the bottom gon' and come out the closet\nYou problematic, I bought them ratchets and automatics\nClip hold 32, I make you feel the Magic\nYou gon' see the flashes, like you in a pageant\nAll black suits, and them long Caddys\nR.I.P., R.I.P., R.I.P., R.I.P\nR.I.P. we just killed the club\nTook patron to the head, almost killed a thug\nR.I.P., R.I.P., R.I.P., R.I.P\nR.I.P. we just killed the club\nTook patron to the head, almost killed a thug\nR.I.P., R.I.P., R.I.P., R.I.P\nR.I.P. we just killed the club\nTook patron to the head, almost killed a thug\nR.I.P., R.I.P., R.I.P., R.I.P\nR.I.P. we just killed the club\nTook patron to the head, almost killed a thug", "image": "https://images.genius.com/25d8a9c93ab97e9e6d5d1d9d36e64a53.1000x1000x1.jpg"}], "artist": "Kendrick Lamar"}