{"songs": [{"title": "Ain’t I", "album": "Dedication 3", "year": "2008-11-14", "lyrics": "[Verse 1: Jae Millz]\nI'm the real, I'm the authentic, the fact and the truth\nIt's Jae Millz, brown skin, but I'm black in the booth\nAnd for the green or that white, you'll see red\nMushroom bullets hit your body then they spread\nThen your ass dead, no need for a hospital room or a bed\nJust tell his momma to get him some nice threads\nSo at least he'll be a bitch ass nigaa dyin' in style\nHe didn't want to look up to me now he gotta look down\nSomebody better tell em on these beats I'm a beast\nHalf-man, half-animal like King on Tekken\nI'll wreck him, hell yeah, Young Money is what I'm reppin'\nRespect 'em or I'll put you on that highway to heaven\nMatter of fact, pussy, you'll get your own lane\nWith no speed limits so you can get there in a minute\nIt's Dedication 3, there's no replacin' we\nThat's like askin' a group of Muslims where that bacon be\nStraight Grand Patrón flow, there is no chasin' me\nAnd that amnesia is what my medication be\nThat's that Amsterdam grade A, I'm smokin' in the Netherlands\nSo high that I'll probably fuckin' never land, bitch\n\n[Verse 2: Lil Wayne]\nMuthafuckin' psychopath\nYoung Money cavemen, muthafuck a Geico ad\nFour-four, bulldog, fuck around and bite your ass\nShittin' on you bitches, now lemme flush the toilet'n wipe my ass\nBitch, I'm ballin', I like my cash, no, I'm lying, I love my dough\nGot them hoes fallin' like a hundred million dominoes\nBut I don't eat pizza, I eat pussy\nWhen he wouldn't\nHolla at ya guala, yeah bitch it's me\nKickin' muthafuckas out the kitchen heat\nI'll put you where the fishes sleep\nAnd when they wake, you'll be the fishies' feast\nYeah, I'm a shark, you see my fin, ho?\nBullet leave a hole in ya face, not a dimple\nStraight from the N.O., it's no problemo\nTo put a nigga brains on the muthafuckin' window\nUgh, damn right I'm nasty\nHow I come through in that white eyed Aston\nThe leather guts and might I add in\nIt's black on chrome like Darren McFadden\nYeah, and don't be comparin my swag with\nThese wack-ass niggas thats o-so-swagless\nYeah, and call me Mr. Swag-more\nGot yaa girlfriend open like some fuckin' pores\nOr open like some fuckin doors\nNigga it's fuck you and I'm fucking yours\nFrom the bedroom to the floors\nWhores, ha!", "image": "https://images.genius.com/9f2858c8807f57c343ffb883015a0a14.220x220x1.jpg"}], "artist": "Lil Wayne"}