{"songs": [{"title": "Fly In", "album": "Tha Carter II", "year": "2005-12-06", "lyrics": "[Intro]\nSo they ask me\n\"Young boy: What you gonna do the second time around?\nHow you gon' come back?\"\nI tried told 'em: I come back like 32\nI jump back like 33! Ugh!\nHit me! That's nothin'\nThis here's Tha Carter II, people\nThis is Tha Carter II, people\n\n[Verse]\nHey! They call me Mr. Carter, I kissed the daughter\nOf the dead's forehead, I killed the father\nSpilled the heart of a mildew hater\nI will put them body on chill like glaciers, gracias\nI'm crazy, yes, it's obvious, going against me is atheist\nI got my angels on my shoulder and a quarter of that angel dust\nI ain't sniffin', I'm just pitchin', ya honor, I ain't snitchin', ya honor\nHate bitch niggas, bitches with power\nVacate when that kitchen get hotter\nI just sit on the counter, open the cabinet, close the cupboard\nPut that jar in the skillet, drop a fo' in the bubbles\nI remember being young, tryin' to hustle my dope\nTryin' to tell the old junkies that my crack ain't soap\nTryin' to tell you 'fore you jump that my Mac ain't broke\nYou ain't trying to see how far that black back lane go, no!\nCall me Pac-Man, your ghosts is blue\nI got my red river rubies and my ocean blue jewelry\nUsually I'm a hooligan for the money\nYeah, I'm eating, but I got a tapeworm in my tummy, oh!\nMake harm and I bomb you in public\nHit you with the straight-arm, no warning, nothing\nLook, it's morning, no yawning or nothing\nI ain't sleeping, I'm up, tryin' to take a nigga lunch\nYou gon' make a nigga break a nigga fronts\nThen shake a nigga shorts and we taking what we want\nI'm so 504 you got to kill me here\nIf you ever looking for me, bitch, I will be here\nCash Money is an army, Navy Seal me here\nLot of niggas ran from me but I still be here\nNo chrome on the Continental, I'm so fundamental\nCrack the Phil', crack the roof and roll up the windows\nAnd my hood love me, they tell me bring it home\nThat's why I holla Hollygrove on each and every song\nYou leaping at a dog, a dog with no bark\nJust a bite like an old shark\nAnd all you rich niggas know Pa, I'm talking 'bout Stunna\nHe like \"Keep your dough\", he got ya ho\nAnd the sun shines on the King and sets on the Prince\nI met the Birdman, and I been shining ever since\nLike that!", "image": "https://images.genius.com/98c56aa11e01a9c25b7485cc3a25c78f.300x300x1.jpg"}], "artist": "Lil Wayne"}