{"songs": [{"title": "Philosophy Sunday (Uomo Mangiato Tigre)", "album": null, "year": "2015-01-12", "lyrics": "We're gonna start the final session of #PhilosophySunday in about 20 minutes from now #PS\nThe topic is the painting used for the T&Y cover\n\nAlright let's get this started the final session of #PhilosophySunday is LIVE!\nYou know da rules tag ya responses wit #PS or be overlooked\n\nBefore we get started I want to say thank you to everybody who has supported #PhilosophySunday over the years!\n\nIt was started to use Twitter for some a little more profound and engaging and I think we can say we've been successful!\n\n#PhilosophySunday would not have been possible without fans and arm chair intellectuals chiming in on the topics and striking #TwitterGold!\n\nI want to send a very special thank you  to @wirelessphi for giving #PhilosophySunday a little more philosophical credibility!\n\nHopefully you guys and gals can continue #PhilosophySunday with @wirelessphi or on your own with your own personal Twitter accounts.\n\nLastly I want to say sorry to all you football fans who had to make the \"tough\" lol decision 2 choose between #PS or those Sunday games! Lol\n\nSo let's get this started. I (as Wasalu Jaco) started painting a couple years back kinda as a hobby & then got a little more serious\n#PS\n\nI found out that the painting became just as meaningful as my music in terms of what idea I was trying to express. Layers of meaning. #PS\n\nStory of how one of my paintings became the cover for 1 of my albums I will save for the memoirs but the painting itself we can discuss #PS\n\nLet's have a look at the painting and the cover #PS\nThe name of the painting is in Italian \"Uomo Mangiato Tigre\" and ROUGHLY translates as \"Man Eating Tiger\" #PS\n\nSo let's start there. What is your interpretation of the title \"Man Eating Tiger\"?\nRemember to tag responses with #PS\n\nRT: @LupeFiasco does the \"man eating tiger\" have any reflection of the issues with you as an artist (man) and your label Atl Rec (Tiger)? #PS\n\nRT: @LupeFiasco internal struggle #PS\n\nRT: @LupeFiasco natures life cycle #PS\n\nRT: @LupeFiasco I feel like the meaning behind it may deal more so with how you say it not what you're saying. #PS\n\nAh! Some very early #TwitterGold from @SpeightSZN\nCare to explain what you mean by \"how you say it\"\n#PS\n\nRT: @LupeFiasco man desires to become part of society and in turn consumes himself #PS\n\nRT: @LupeFiasco Man conquering what would be considered a dangerous animal #PS\n\nRT: @LupeFiasco human contamination of something more vicious than it #PS\n\nRT: @LupeFiasco man becoming more ferocious then the tiger, almost like a David Vs. Goliath also #PS\n\nRT: @LupeFiasco Reversals--wildness tamed and consumed. #PS\n\nRT: @LupeFiasco chaos #PS\n\nRT: @LupeFiasco Man is the top but sometimes we behave like animals..although we say we are superior thus man eating(becoming) Tiger. #PS\n\nRT: @LupeFiasco because you can look at the phrase \"man eating tiger\" in two different ways. It's like a double entendre of a title. #PS\n\nAh some #TwitterGold from @jjLawson_\nSo it has two meanings?\n#PS\n\nRT: @LupeFiasco man destruction against the last majestic and natural strengths of our world. #PS\n\nRT: @SpeightSZN @LupeFiasco Like a play on words. The tiger has gotten a taste for human blood? #PS\n\nRT: @LupeFiasco the definition I see from it stems back to Tigers being pouched by man. So eating man means self preservation and survival #ps\n\nRT: @LupeFiasco the response lines up w the islamic interpretation of the tiger representing money profits & honor which would be Atlantic #PS\n\nRT: @LupeFiasco struggle to survive, Man eating tiger vs Man-Eating tiger #PS\n\nGreat stuff...so yes the title can be read as two ways...let's expand a little bit on that. Who is the man and who is the tiger?\n#PS\n\nRT: @LupeFiasco The man being the normal man and the tiger being society itself #PS\n\nRT: @LupeFiasco the man is a anyone and the tiger is society #PS\n\nRT: @LupeFiasco that is up for you to decide... You can chose to be one or the other. Or can you be both? #PS\n\nRT: @LupeFiasco maybe the man and the tiger are one....this could all be about self destruction if that were the case #PS\n\nRT: @LupeFiasco it can be any David/Goliath situation. Western media against the Muslim Faith comes to mind. But it's open to a lot #PS\n\nRT: @LupeFiasco if I follow-up what I said about red (the tiger) symbolizing carnal tones, the tiger engulfs the skull (the man) with rage #PS\n\nRT: @LupeFiasco Truly depends, everyone posses both characters.  #PS\n\nRT: @LupeFiasco One in the same. #ps We're animals, like tigers, but also, there's a 'tiger'. Whats the tiger though? Lol #ps\n\nRT: @LupeFiasco The man = people in power, keeping you, as the tiger, contained and essentially eating the life and inspiration from you #PS\n\nRT: @LupeFiasco the man is the industry, the tiger is the artist. the industry poaches artists for their talents. #PS\n\nRT: @LupeFiasco well \"the man\" has always been the guy in charge, and we are all animals so you're the tiger? #PS\n\nRT: @LupeFiasco it depends on the situation; for example, man could be the Average Joe, and his tiger could be the daily grind of a 9-to-5 #PS\n\nRT: @LupeFiasco depends on who is saying it; everyone can say they're the man/ tiger when its convenient #PS\n\nAh very interesting #Twittergold . The changing of identities. Adaptation or masquerading?@gvanx\n#PS\n\nRT: @LupeFiasco The tiger is the government and the man is the \"taxpayer\". Nobody really knows who controls who. #PS\n\nRT: @LupeFiasco why shouldn't we be the tiger fighting internally and man could be society in a conceptualized collective perspective #PS\n\nRT: @LupeFiasco man is the people, tiger is the current establishment in the concrete jungle #PS\n\nVery great stuff! You guys could be tour guides at the Prado!\nLet's shift to the other word in the title: \"Eating.\"\nThoughts? #PS\n\nRT: @LupeFiasco eating what? Who's eating? #PS\n\nRT: @LupeFiasco engulfing, overwhelming, controlling #PS\n\nRT: @LupeFiasco whats the meal #ps\n\nRT: @LupeFiasco eating is control. #PS\n\nRT: @LupeFiasco being swallowed by its environment #PS\n\nRT: @LupeFiasco Eating could refer to a conflict between the \"man\" inside us and the \"tiger\".. civilized vs instincts\n\nRT: @LupeFiasco captivity of negativity #PS\n\nRT: @LupeFiasco eating could mean conquering... #PS\n\nRT: @LupeFiasco eating can be synonymous with greed. Double burger with cheese.....#PS\n\nRT: @LupeFiasco consumption of morality #PS\n\nRT: @LupeFiasco I look at eating as a pleasure & I see the two entities (man or tiger) finding pleasure in getting rid of the other. #PS\n\nRT: @LupeFiasco Eating could mean conquering or destroying #ps\n\nRT: @LupeFiasco trying to be controlled #PS\n\nRT: @LupeFiasco consuming and profiting at the expensive of the victim #PS\n\nRT: @LupeFiasco eating as in destroying the tigers habitat #PS\n\nRT: @LupeFiasco Eating could mean the tiger is taking your life away, or your rights #PS\n\nRT: @LupeFiasco Killing/eating your inner artist. Making you discouraged to pursue and keep producing your art. #PS\n\nRT: @LupeFiasco It can be consuming sustenance, a necessity for survival, or gluttony, succumbing to desire. #PS\n\nFun Fact: I don't use the whole title when I talk about this painting with friends. I just call it \"The Mangiato\" or \"The Eating\"\n#PS\n\nRT: @LupeFiasco The eating is still in process. Eternal consumption. Consumerism?  #PS\n\nAh some professional #Twittergold from @wirelessphi\nA continuum of consumption? How? Please expand for us...\n#PS\n\nRT: @LupeFiasco Eating symbolizes survival #PS\n\nRT: @LupeFiasco any form of consumption, be it eat, indulge, be taken over by, etc. #PS\n\nRT: @LupeFiasco \"Drinking the Koolaid\" Taking everything in; Gullible You are what you eat. #PS\n\nAh #TwitterGold from @mickystweeting\nI never looked at it that way. \"You are what you eat\" so the tiger picks up human traits?\n#PS\n\nRT: Eating can symbolize reward. The man (you) is being rewarded through all the challenges Atlantic (tiger) put you through. #PS @LupeFiasco\n\nRT: @LupeFiasco In this case eating = exploitation? #ps\n\nRT: @LupeFiasco tiger = bourgeoisie, man= proletariat, both in never-ending contest. the purple looks like a scab, the wounds from revolt #PS\n\nRT: @LupeFiasco eating doesn't necessarily mean that the other doesn't exist anymore. Can it refer to become one? #PS\n\nAh! #TwitterGold from @heyhappymonday\nSo this painting isn't a violent scene of consumption? It's something softer?\n#PS\n\nRT: @LupeFiasco Man consumes but is consumed by his consumption. Can't escape the cycle--always needs fiercer tigers to keep him entertained #PS\n\nRT: @LupeFiasco it's all about perspective, we could pick up the Tigers traits. Savage, \"regressive\" behavior is omnipresent.. #PS\n\nRT: @LupeFiasco never ending consumption. An indulgent of some sort, probably along the lines of obsession or addiction. #PS\n\nRT: @LupeFiasco #ps \"Man Eating Tiger\"\nMan. Eating. Tiger.\nMan, eating tiger.\nMan=eating tiger.\nMan eating=tiger.\n\nGreat way to put it  in an equation form #Twittergold from @drownsomebody82\nFun Fact: there is a lot of math used in Philosophy\n#PS\n\nLet's move away from the title and look at the painting itself. What do u see? What is what?\n#PS\nRT: @LupeFiasco a skull, most likely representing man #PS\n\nRT: @LupeFiasco I see bars and sculls #PS\n\n“@WWJRHRD: @LupeFiasco why the frame?”\nFor fanciness...lol #PS\n\nRT: @LupeFiasco for one I can see that the red skull might symbolize violence #ps\n\nRT: @LupeFiasco Self contained...straight lines...the skull is the only thing that deviates #PS\n\nRT: @LupeFiasco Those 2 brush strokes remind me of a tiger ripping through the man (or vice versa) #PS\n\nRT: @LupeFiasco I see the red from the skull and the red and purple line are parallel could this be stating they connect with each other? #PS\n\nRT: @LupeFiasco colors of a tiger and a human skull #PS\n\nRT: @LupeFiasco #PS\nRT: @LupeFiasco I see fresh death which is covered in red an also a blue streak an we know only sonic is fast enough to make that streak #ps\n\nRT: @LupeFiasco the skull is fading away. Beinf destroyed by this red shape as an all consuming rage?\n\nLemme help yall out a little: there is a man, a tiger, flesh, blood, bone and my two favorites..a soul & technology!\nSee Them now?\n#PS\n\nThere is also some brain in there...grey matter\nsee it?\n#PS\n\nRT: @lupefiasco Purple=Wounds, , brown and red=blood trail, pink=loss of innocence, white=innocence,beginnings, tan=guilt...red, skull=death #PS\n\nRT: @LupeFiasco I see the tiger being hidden away in the background, the man is trying to consume and cover the tiger but can't completely #PS\n\nRT: @LupeFiasco The soul may be the blue stripe? #PS\n\nRT: @LupeFiasco The lines in the art in different angles convey how \"eating the tiger\" isn't straight forward, it's complex, difficult. #PS\n\nRT: @LupeFiasco Having a soul, and ability to create technology, separates us from the animal instinct/thirst for blood. #PS\n\n“@yellow_arigo35: @LupeFiasco where is the technology? #PS”\nThe Silver color field in the upper left\n#PS\n\nRT: @LupeFiasco duality of man? The thirst for knowledge/innovation but is also consumed by his primal nature? #PS\n\nSome #TwitterGold to take back to the KTT @oilgangebro\n\nRT: @LupeFiasco Are all those things in the painting or in the viewer who finds them there and the artist who put them there for us to find? #PS\n\n“@Mo_Yasini: @LupeFiasco I'm struggling to see the brain/grey matter #PS”\nBottom Far right...smallest thing used in the painting\n#PS\n\nRT: @LupeFiasco the silver (tech) being bigger in area than the grey (brain) makes it seem like your'e saying tech will overcome us? #PS\n\nRT: @LupeFiasco My take on the painting. #PS\nRT: @LupeFiasco smallest thing used and often forgotten but most important part of the human process #ps\n\nRT: @LupeFiasco   #ps tiger is apex predator. With the brain  and tech, man manages to become a danger to the highest in the food chain  #ps\n\nWooh! Some #Twittergold from @mrbrpeters\nBut when man enters nature without all the technological superiority...???\n#PS\n\nRT: @LupeFiasco I feel like you are trying to say that we are becoming over-dependant on technology therefore not using our brains that much #PS\n\nRT: @LupeFiasco @mrbrpeters he's at the mercy of nature #PS\n\nRT: @LupeFiasco but man is the most adaptable animal, entering the wilderness without technology does not preclude him from creating it. #PS\n\nGreat stuff...let's wrap it up...\nFinal Thoughts on \"Uomo Mangiato Tigre\" or \"The Eating\" as I like to call it...\n#PS\n\nRT: @LupeFiasco It feels like epiphenomenalism, the duality between mind & body & technology's affect on it. The tiger symbolizes our instinct.\n\nRT: @LupeFiasco man must stay focused and not let society (the tiger) alter their thoughts and break them down #PS\n\nRT: @LupeFiasco Humans are ruining them self #PS\n\nRT: @LupeFiasco nothing is as evil as we see it to be. It's all perspective. Everything is trying to find their own place in this world. #PS\n\nRT: @LupeFiasco man and tiger in a constant battle over who is the superior predator. #ps\n\nRT: @LupeFiasco Man is oppresses the tiger because of technology, but without it, the tiger wins out.\nMan-eating tiger\nMan eating tiger #PS\n\nRT: @LupeFiasco \"eating\" is living life good from bad decisions (drug dealing) until tiger (police) takes your life and locks you in a cage #PS\n\nRT: @LupeFiasco \"uomo Mangiato Tigre\" is life today as we know it. And we need to appreciate ourselves more then materials #PS\n\nRT: @LupeFiasco the painting's meaning as a whole to me is a man trying to hide corruption (the tiger, tech) but there is still hope (pink) #PS\n\nRT: @LupeFiasco lets just call it mans battle with the world and nature in his eternal bid to understand himself. #PS\n\nRT: @LupeFiasco it further adds to the bigger discussion that'll be expanded in ur LP, so like a quintuple entendre.. Art, tracklist, songs #ps\n\nRT: @LupeFiasco we are depending more on technolgy than our brians!! #PS\n\nRT: @LupeFiasco how bout technology being  the tiger that's eating the man. We feast on it. #PS\n\nRT: @LupeFiasco a lot of things going on, but it seems to tap into a deeper lesson for man. #ps\n\nRT: @LupeFiasco #PS Delicious. Mouthwatering colours.\n\nRT: @LupeFiasco who you are without and with technology #PS\n\nRT: @LupeFiasco It is sometimes necessary to be ruthless in order to avoid being consumed by this savage world.. #PS\n\nRT: @LupeFiasco its about resilience you keep going even though they try to stop you #PS\n\nRT: @LupeFiasco Human progress is like a bell curve, which will eventually bring itself down #PS\n\nRT: @LupeFiasco Be careful what boundaries you draw between yourself and the world around you. #PS\n\nRT: @LupeFiasco no matter how advanced we become as a civilization, we will always be driven by animalistic impulses #PS\n\nRT: @LupeFiasco Man is Trying to Live with both Tiger and Technology with our sacrificing his soul to tech and body and blood to tiger #PS\n\nRT: @LupeFiasco before wrapping it up, can we know your interpretation of it? #ps\n\nSure @rimzS\nFor me as the guy who painted it. I see a tiger descending into the body of a man, being consumed. You see the inside of man\n\nBut I also see a tiger in the process of ripping a man to pieces. A very chaotic scene of violence.  @rimzS\n\nThe meaning of this painting is constantly shifting and changing. I see death and life and a constant pursuit of these two goals. @rimzS\n\nSo let's end it here! Big shouts to Everyone who participated in the final session of #PhilosophySunday! I hope you enjoyed it!!!\n\nSpecial shouts to everyone who struck #TwitterGold and the always vigilant and helpful @wirelessphi <----- follow them! #PS\n\nThe \"Uomo Mangiato Tigre\" will be on public display @ Soho House Chicago starting January 23rd along with some of my other paintings #PS\n\nHigh quality prints of \"The Mangiato\" will be available shortly from WOLFstudio as well as posters and other little knick-knacks\n#PS\n\nTetsuo & Youth will be available 1/20/15 and if you what to grab a tshirt or hoodie of the album cover visit:\nhttp://www.lupefiascostore.com\n\nThanx again...and for the final time...#PS is out!", "image": "https://images.rapgenius.com/c62a47ae3dc30782d567e334dc5a6f2d.1000x1000x1.jpg"}], "artist": "Lupe Fiasco"}