{"songs": [{"title": "French!", "album": "Bastard", "year": "2009-12-25", "lyrics": "[Verse 1: Tyler, the Creator]\nGot all the black bitches mad cause my main bitch vanilla\nShe tryna get her groove back like Stella, grab the umbrella\nWhen it comes to your perception of my shit, I'm Helen Keller\nWhen it comes to the perfection of my shit, I know you smell the\nRectum, I'm like a chromosome, I always X 'em\nLike Wolverine stepson attacking a deadly weapon\nI'm opening a church to sell coke and Led Zeppelin\nAnd fuck Mary in her ass...\nYo, I'm fucking Goldilocks up in the forest\nIn the three bear house eating their mothafuckin' porridge\nI tell her it's my house, give her a tour\nIn my basement, and keep that bitch locked up in my storage\nRape her and record it, then edit it with more shit\nOctopussy special effect the wet bitches be banging\nAnd please never disrespect my set\nWith Canons hanging from our necks like it's a mothafuckin' circus\n\n[Hook: Hodgy & (Tyler)]\nYou little niggas better (check my French)\nYou getting money? Better (check my French)\nWhat time is it, huh? (Check my French)\nIf you got my shit you better check my French, motherfucker\nI'm making moves, (check my French)\nI speak English but (check my French)\nYour ho be on my penis, she (check my French)\nBitch\n\n[Verse 2: Tyler, the Creator]\nI guess I left my dignity up in the cupboard\nCause every girl I'm digging, when I'm digging in her pussy\nI'm never using a rubber\nBut fuck it, I guess I got to stretch it out like it was flubber\nAnd leave it dripping green and red like double cheese burgers\nChewing on cum like bubble gum from Hubba\nThis bitch knew dick like Bubba knew shrimp, yeah\nYo, I'm seventeen, already sniffing blow\nI tell my friends it's asthma every time I start to itch my throat\nI got a new show for MTV, \"Pimp My Boat\"\nBecause some bitch said my semen was dirty, that silly ho\nThe most that they can do is fine me, I'm hiding\nSomewhere where Chris Stokes can't find me\nOh no Mr. Stokes, I don't like misters, no\nDon't tell R. Kelly where my little sister go\n\n[Hook: Hodgy & Tyler]\nYou little niggas better (check my French)\nYou getting money? Better (check my French)\nWhat time is it, huh? (Check my French)\nIf you got my shit you better check my French, motherfucker\nI'm making moves, (check my French)\nI speak English but (check my French)\nYour ho be on my penis, she (check my French)\nBitch\n\n[Verse 3: Hodgy]\nYo, you little niggas better check my French\nI got all stars and you can check my bench\nLeft Brain, Super 3, Creator Ace\nPut expressions in their music and create the face\nOf the picture, punchline, figured out, ahh I get you\nNo, you don't, nigga, so why don't you go and figure?\nYou seem confused anyway, pressured enough?\nYou the type to do the choke when the pressure is up\nThe pressure is the pump and the pressure is us\nBitches having eargasms and the pleasure is us\nNiggas wanna be O.F. and write letters to us\nCompetition's competition, yo, you better than us?\nDigest what I'm saying? I don't think so\nWe sick shit, throw it up down in the sink, yo\nThese Odd niggas are beginning to spill these pink flows\nWe think sorta odd, so we think so\n\n[Verse 4: Tyler, the Creator]\nCrusing in my go-kart at Walmart selling cupcakes\nGo ahead admit it, faggot, this shit is tighter than butt rape\nThat involve Ballpark Franks and silver duct tape\nPornos and hormones and boxes of DiGiorno\nYou homos is loco, you're probably drinking Cuervo\nWith some vatos with the door closed watching Zorro\nYou homos\n\n[Outro: Tyler & Dr. TC]\nO.F., yes\n(So, are you dating anyone right now? You know, or..)\nNo, I'm just playing the field, just for now\n(Ah, so I'm guessing she's white, since she's 'vanilla'\nHahah)", "image": "https://images.genius.com/cb0b25f99dd81109efa8db270a933a38.500x500x1.jpg"}], "artist": "Tyler, The Creator"}