{"songs": [{"title": "Sett Trippin’", "album": null, "year": "2014-09-22", "lyrics": "[Intro]\nYeah\nPunch what's happening brother?\nNiggas be poppin' that shit to me like it's something new to me or something, I tell 'em bout\nI tell a nigga quick, that shit just a rerun to me nigga\nI've been doing this shit since vanguard[?] brother\nAntonio what's happening with it?\nNiggas hatin' on me but hop right on my dick soon as they see me\nSoon as they see me they be like\n\n[Verse 1]\nWhat up Dot?\nThat's what they tell me every second around the clock\nEvery time I clock in, rappers checking they watch\nStudio paid for, hours unlimited\nAssholes, how many MCs I knock off they payroll\nHow many God MCs I knock off they halo\nHip-hop ain't dead, consumers changed up\nRappers love to see gold like the end of a rainbow\nI stay low like my socks under my ankles\nPlay the back like a turtle shell, know well\nThat my team got me if I ever slack on my shit\nSo I fail, guess what? I don't even trip\nJust like that, crush your little battle raps, punchlines\nI did that in 99' you think it's a gold mine\nWhen you think of one, you think you hot but I think you done\nLike Queens New York slang, look what the killer brung\nMachine guns to a fight, fucking right\nPay your bills or I'm turning out your lights, good night\nI shatter niggas dreams, thinking they the West Coast kings\n'Till I drop like visine\nTell a nigga quick it ain't always what it seems\nLike the stitching on swap meet jeans\nI'm itching to scratch a whack rapper, gun clapper\nSnuff him like a rude capper, got a cool bladder, but I'm pissed off\nAt ya\n\n[Hook]\nThe real is back\nFuck the artificial, won't you let the realers rap\nThey scribble in they notebooks, me I state facts\nSafe estate, they know where the best be at\nWhenever I ask, (are you not entertained?)\nBody any nigga that wanna holla' my name\nAnd what, no cuts, this is Top Dawg gang\nWhat the fuck, everybody else, pull your panties up\n\n[Verse 2]\nNigga said he'd snatch my chain in the streets, what chain?\nI barely wear jewelry, so I ever had one\nYou barely see it on me, and if I ever had a gun\nYou wouldn't know it's on me, so snatch it and then you done\nI'm in the studio just sipping on Parmesan\nThinking about who could fuck with Kenny and parlor sons\nI live this shit, try stop me, you won't live to shit\nProbably catch four between your abdomen\nNext time you see me, don't ask me who I'm collabing with\nBetween me and you, some of the new West is actresses\nNew hate activists, lowkey can't stand our shit\nBut still we continue to drink laxatives\nCold blooded, make the label hand me your budget\nThis is mine don't touch (pow pow), did I stutter?\nCatch two, cats knew, I been a gorilla, welcome to the zoo\nYup, you little monkeys know what it do\nCome test me\n\n[Hook]\nThe real is back\nFuck the artificial, won't you let the realers rap\nThey scribble in they notebooks, me I state facts\nSafe estate, they know where the best be at\nWhenever I ask, (are you not entertained?)\nBody any nigga that wanna holla' my name\nAnd what, no cuts, this is Top Dawg gang\nWhat the fuck, everybody else, pull your panties up\n\n[Verse 3]\nDayum, you killin' 'em K-Dizzle\nAnd if you don't kill 'em then you send 'em to hospitals\nSleeping on a reclined bed with a thin pillow\nI'm with a white bitch, ass like a black widow\nBet I jumble to the end of my lifeline\nSo when I die, you can say I balled for a long time\nThe 08' Frankenstein, beast like Sasquatch\nFeet size thirty-six, steppin on Hip-Hop cause that's my bitch\nI write a rhyme, then she ride my dick\nThe girl is mine, I don't know that hoe that you with\nYou niggas know this, I'm way better than I've ever been\nSo focused, like a sniper when he zoom in\nWhat's your motives? I bet it's to go against\nOr like the GT get your bitch ass bit, all on these streets\nI'm the all mighty K, Compton\nRep it 'till my very death day, let the reaper in his face\nAnd recite every song from N.W.A\nI pay homage for those great who paved the way\nWait, back to the subject of who's and who doesn't\nDo what I do, bluffin' until I touch 'em\nLike a masseuse do, nothing compares to me\nBut the throne, so tell 'em bring the chair to me\nI'm a red bullet, small nigga\nBut I handle y'all niggas like I'm eight feet tall\nNigga", "image": "https://images.genius.com/25d8a9c93ab97e9e6d5d1d9d36e64a53.1000x1000x1.jpg"}], "artist": "Kendrick Lamar"}