{"songs": [{"title": "For The Love Of Money", "album": "Compton", "year": "2015-08-07", "lyrics": "[Intro: Jill Scott]\nFor the love of money\nFor the love of money\nFor the love of money\n\n[Bridge]\nIt's beautiful outside\nLooks like it's raining money, mane\nIt's beautiful outside\nLooks like it's raining money, mane\n\n[Verse 1: Jon Connor]\nSay \"What's up\"\nTo the broke nigga at the rich party (Woo!)\nWho the fuck let this nigga in?\nDo it look like I give a fuck? Sorry (Yeah!)\nLooking at these hoes\nAnd they gold digger gorgeous tryna get me (Woo!)\nI run game on a bitch\nAnd one Mississippi, two Mississippi (Yeah!)\nFlint nigga in the spot\n'til they pop one and the cops come like (Woo!)\nMothafuckas own a shotgun\nLike a pop gun and they ready like (Yeah!)\nCivic good nigga\nI'm a Northside nigga 'til I'm gone (Woo!)\nDo it for the ones in the hood\nLike Connor gon' put the city on (Wait!)\nFuck that shit, nigga, fuck that shit, go\nLive for my hood, look this for my block\nRide for the hood, gotta spit it like Pac\nI ain't got shit but I still feel good\nNigga can't take what a nigga don't got\nGo hard in the paint, you can tell 'em post up\nHomie in the hood like \"Let me hold something\"\nYour mans in the hood talking all that shit\nWhen they ran up on him lil' buddy froze up\nAll they be talkin' but ain't saying nothing\nNiggas be talking that ain't what they want\nAin't no fake shit around here\nCause my nigga my city is really as real as the fuck\nI be killing this shit, I ain't giving a fuck\nYou laugh at a bitch, she get hid in the trunk\nYou think this sound crazy, that's how I grew up\nSo this for my people who still in the cut\n\n[Chorus: Jill Scott]\nWant that, need that\nRoot of all evil, mane, oh (get it, get it, I said)\nI want that, need that\nRoot of all evil, mane, oh\n\n[Verse 2: Dr. Dre]\nSay \"What's up\" to the nigga\nWearing all black at the white party (Woo!)\nAnd I'm looking like I don't give a fuck\nThat's just how I get down nigga, sorry (Yeah!)\nAnd I'm looking like I don't play no games\nNah, nigga don't try me (Woo!)\nBeen that nigga that's spitting that\nPaid dues like a motherfuckin' hobby (Yeah!)\nIf you're on that bullshit nigga\nBetter fly that shit right by me (Woo!)\nCame from the bottom of this bitch\nAnd made it out of that shit and that's why we (Yeah!)\nOn top of this motherfuckin' world\nDamn, look at that body (Woo!)\nShe come along with the territories\nTurn around, move it for me (Yeah!)\nBend it over, end of story\n\n[Break: Dr. Dre & Anderson .Paak]\nSeems like chasing paper's what's important to you\nGot a relationship with that money\nBut that bitch will never be faithful to you\nEven though I know she knows she crazy\nPlease just let it go, seize, no saving you\nRide, ride 'til the motherfuckin' wheels fall off in this bitch\nBut we can do it for the love\nBut I'm never stopping my poppin'\nThese numbers don't lie, but your love is superficial\nIt's the simple shit you need to pay attention to\n\n[Chorus: Jill Scott]\nWant that, need that\nRoot of all evil, mane, oh (get it, get, I said)\nI want that, need that\nRoot of all evil, mane, oh\n\n[Bridge: Jill Scott]\nIt's beautiful outside\nLooks like it's raining money, mane\nIt's beautiful outside\nLooks like it's raining money, mane\n\n[Outro: Jill Scott]\nWant that, need that\nRoot of all evil, mane, oh (get it, get, I said)\nI want that, need that\nRoot of all evil, mane", "image": "https://images.genius.com/19804ba7a9b6ceb36d0158950514927a.1000x1000x1.jpg"}], "artist": "Dr. Dre"}