{"songs": [{"title": "The Ruler’s Back", "album": "The Blueprint", "year": "2001-09-11", "lyrics": "[Produced by Bink!]\n\n[Intro]\nUh-huh uhh, uhh, uh-uhh\nUh-huh uhh, uhh, uhh\nWooo! Wooo! Wooo! Wooo!\nI, am, back, niggas\nHa ha ha ha ha.. uh-oh, uh-oh - wooo!\nLadies and gentlemen -- H, to the Izzo\nI wanna thank everybody out there for they purchase\nI surely appreciate it - woo!\nWhat you about to witness is my thoughts\nJust my thoughts, man—right or wrong\nJust what I was feeling at the time, uhh\nYou ever felt like this, vibe with me\nWalk with a nigga, man, just vibe with me\n\n[Verse 1]\nYo, gather round hustlers—that's if you still livin'\nAnd get on down to that ol' Jig rhythm\nHere's a couple of jewels to help you get through your bid in prison\nA ribbon in the sky, keep your head high\nI, Young 'Vito, voice of the young people\nMouthpiece for hustlers - I'm back, motherfuckers\nYour reign on the top was shorter than leprechauns\nY'all can't fuck with Hov', what type of X y'all on?\nI got great lawyers for cops so dress warm\nCharges don't stick to dude, he's Teflon\nI'm too sexy for jail like I'm Right Said Fred\nI'm not guilty, now gimme back my bread\nMr. District Attorney, I'm not sure if they told you\nI'm on TV every day, where the fuck could I go to?\nPlus - Hov' don't run, Hov' stand and fight\nHov' a soldier, Hov' been fightin' all his life so\nWhat could you do to me? It's not new to me\nSue me? Fuck you, what's a couple dollars to me?\nBut you will respect me, simple as that\nOr I got no problem goin' back\nI'm representin' for the seat where Rosa Parks sat\nWhere Malcolm X was shot, where Martin Luther was popped\nSo off we go, let the trumpets blow\nAnd hold on, because the driver of the mission is a pro\nThe ruler's back\n\n[Interlude]\nUhh, uh-huh uhh uhh\nI, am, BACK, niggas - woo! woo! woo! woo!\nYeah, yeah, yeah\nTurn the motherfuckin' music up\nThe ruler's back\nI, am, back, niggas\nYeah, yeah, yeah, yeah\nYeah, yeah, yeah, yeah\n\n[Verse 2]\nWell, in these times—well, at least to me\nThere's a lot of rappers out there tryin' to sound like Jay-Z\nI'll help you out, here's what you do\nYou gonna need a wide lens 'cause that's a VER' big shoe\nAnd you got a couple of beans and you don't have a clue?\nYou situation is bleek, I'ma keep it real cause\nFuckin' with me, you gotta drop a mill\n'Cause if you gonna cop somethin' you gotta cop for real\nDon't only talk it, walk like it - from the bricks to the booth\nI could predict the future like Cleo the psychic\nYou can't date skee-os and wife it\nAnd you can't sell me bullshit, we know the prices\nSo what your life is?\nWe gon' roll 'til the wheels fall off - y'all muh'fuckers check the tires\nOff we go, let the trumpets blow\nAnd hold on, because the driver of that Bentley is a pro\n\n[Interlude]\nUhh, uhh\nI, am, back, niggas\nFeels good! Ha\nPah, holla at me!\nThe ruler's back\nYeah.. whoo!\nYeah.. yeah.. yeah..\n\n[Outro]\nNow bounce, c'mon, bounce\nUhh, woo! Woo!\nBounce, c'mon, bounce\nUhh, uhh, yeah, yeah\nBounce, c'mon, bounce\nUhh, yeah, just my thoughts ladies and gentlemen\nJust what I'm feelin at the time, you know what I mean?\nKnahmean?", "image": "https://images.rapgenius.com/2c157091a41e5094ea044623b6982ca7.500x497x1.jpg"}], "artist": "JAY-Z"}