{"songs": [{"title": "My Own Way", "album": "Doggumentary", "year": "2011-03-29", "lyrics": "[Verse 1: Snoop Dogg]\nBank accounts, big cars\nLiving good like a movie star\nMy mama house ain’t in the hood no more\nI moved her out to San Lu' Obispo\nBut it's a trip, though, 'cause I'm a 20 Crip though\nI gotta lay low, my homies wanna do low\nI got two strikes and I'm gonna get my third\nThese niggas snitching on me, they think I'm selling birds\nSo when I'm in the streets, I'm quick on my feet\nSee, talk is cheap so I stay quick on my heat\nYou niggas bad? Well, Dogg is badder\n\"Rat-a-tatta!\", make you niggas scatter\nI one shotta, your boy want me now\nWent to the station, that nigga straight point me out (Snitch)\nSo I'ma lay away and spray away and spray away\n'Cause at this time I think it's best to just stay away\n\n[Chorus: Mr. Porter]\nThey say I am a fool\n'Cause I like to do my thing my own way (My own way)\nI gotta couple strikes against me\nOne more and I'm on my way (I'm on my way)\nI ain’t got time to hang around the hood like I used to do\nI gotta get my bread, keep my head\nIt's either go to jail or get this money instead\n\n[Verse 2: Snoop Dogg]\nSeparate, elevate\nConcentrate, dominate, and innovate\nTry to be, fly as me\nAnd every other homie tell a lie to me\nI need a deal, I need some stones\nI need some beats, Dogg, I need a loan\nHelp me out, throw me some cash\nIf I got it, you got it and you ain’t got to ask\nBut on the real - or is it lately?\nA lot of homies done tried to implicate me\nThey say I changed; is it the fame?\nIf I throw it to you, then charge it to the game\nMoney fold: overload\nIn the hood, another episode\nMan, I'm getting old, the game cold\nYeah, I'm from the dub, but that ain’t how I roll\n\n[Chorus: Mr. Porter]\nThey say I am a fool\n'Cause I like to do my thing my own way (My own way)\nI gotta couple strikes against me\nOne more and I'm on my way (I'm on my way)\nI ain’t got time to hang around the hood like I used to do\nI gotta get my bread, keep my head\nIt's either go to jail or get this money instead", "image": "https://images.genius.com/bf66457764b32165c7cdb2908ea44580.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}