{"songs": [{"title": "Bullet To The Brain (Remix)", "album": null, "year": "2015-01-24", "lyrics": "[Verse 1: 2Pac]\nThere's no way to survive in the city it's a shame\nNiggas die from my hollow-point bullet to the brain\nWill I survive or will I die is what I wonder\nPuffin on blunts and gettin' drunk to keep from goin' under\nGettin' lost in the madness, blunted gettin' tipsy\nGot my pistol out the window screamin', \"Lord come and get me\"\nAm I sick, or am I just another victim?\nUnloadin' my clip, I'm watchin' every bullet spit when I kick 'em\nNiggas die from automatic gunfire\nYour time to expire, nobody cry every man gotta die\nWhen they bury me, they bury me a G\nRest in peace, to all the homies got to heaven before me\nPour some liquor on the curb for the niggas that's caught\nHad a motherfuckin' warrant but he didn't go to court\nGod damn, and one day we'll all be together\nUntil then I'm ready for whatever, c'mon\n\n[Hook: 2Pac]\nBullet to the brain!\nBullet to the brain!\nBullet to the brain!\nBut don't blame me, blame the [?]\nGoin' to hell with my finger on the trigger\nBullet to the brain!\nBullet to the brain!\nBullet to the brain!\n\n[Verse 2: Eminem]\nIf I could capture the rage of today's youth and bottle it\nCrush the glass with my bare hands and swallow it\nAnd spit it back in the faces of you racists\nAnd hypocrites who think the same shit but don't say shit\nYou Liberaces, Versaces, and you Nazis\nWatch me, 'cause you figured you got me in this hot seat\nYou motherfuckers wanna judge me 'cause you're not me\nYou'll never stop me, I'm top speed and you pop me\nI came to save these new generations of babies\nFrom parents who failed to raise them 'cause they're lazy\nTo grow to praise me, I'm makin' them go crazy\nThat's how I got this whole nation to embrace me\nAnd you fugazi if you think I'ma admit wrong\nI cripple any hypocritic critic I'm sicked on\nAnd this song is for any kid who gets picked on\nA sick song to retaliate to\n\n[Hook: 2Pac]\nBullet to the brain!\nBullet to the brain!\nBullet to the brain!\nBut don't blame me\nNigga go in the hell with my finger on the trigger\nBullet to the brain!\nBullet to the brain!\nBullet to the brain!\nSo suck [?]\n\n[Verse 3: 2Pac]\nDear Lord can ya hear me, it's just me\nA young nigga tryin' to make it on these rough streets\nI'm on my knees beggin' please come and save me\nThe whole world done made a nigga crazy!\nI got my three-five-seven can't control it\nScreamin' die motherfucker and he's loaded\nEverybody run for cover, aww shit\nThug Life motherfucker, duck quick\nNow am I wrong if I am don't worry me\nCause do or die gettin' high 'til they bury me\nDear Lord can ya hear me, when I die\nLet a nigga be strapped, fucked up, and high\nWith my hands on the trigger, thug nigga\nStressin' like a motherfuckin' drug dealer\nAnd even in the darkest nights, I'm a thug for Life\nI got the heart to fight now\nMama raised a hellraiser why cry\nThat's just life in the ghetto, do or die", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}