{"songs": [{"title": "Killuminati", "album": "1999", "year": "2012-06-12", "lyrics": "[Produced by Knxwledge]\n\n[Intro]\nYes, skrawberries\n\n[Verse 1: Joey Bada$$]\nI'm a beast with these flows\nTwo birds, one stoned, you get geese’d when trees rolled\nThey say I'm evil cause I trained my ego to see gold\nCause he know, seagulls couldn't see these goals, please\nIt's the return of the Beast Coast\nNo cash flashed, but the cheese still make teeth show\nIncognito, is how you move on the strip\nWhat you tryna be Vito? Well there's rules to this shit\nDon't get clapped, y'all ain't real spitters, y'all lips chapped\nBetter watch it, Mr. Nice Watch, don't risk that\nI got a six-pack of bare skill that I spill like that\nAnd everybody know (that shit crack!)\nY'all niggas softspoken, down below choking\nThe type to drop the soap when you soakin' in front of most men\nThere's makes sense why you want beef, well this frozen\nIt's nuts for you screwed in the tool, and can't hold em\nBetter shoot yourself Plaxico, because I'm next to go\nThe Progressive flows from New York to New Mexico\nMy lyrical span is what the fans is demandin'\nStep into my box and that's exactly what'chu stand in\nAin't no half steppin' around me\nAnd you gotta drown a fish before you clown me\nThe young cop killer, I'm that ill, so doc' will ya\nGive me two shots for 2Pac killer, nigga\n\n[Verse 2: Capital STEEZ]\nSoul searchin' 'til my flows are perfect\nI ain't tryna be a slave to grow old from workin'\nSorry Bada$$, you lucky that I peeped it second\nTell them niggas keep it steppin' with they beat selection\nCheck the melodies, it's so heavenly\nThat shit'll get your hips to move with no 7D's\nAudi-opium, can I bust soliloquies?\nGot that shit mix and mastered, both remedies\nGrab a spoonful, we stirrin' up a pot\nAnd you know we gotta serve it while it's hot\nI'm flowin' like a volcano and drippin' verses off the top\nDirty cops still swervin' on the block\nLookin' for black kids, that spittin' up acid\nIt's in my jeans so don't worry what my pants is\nGet with the script, it's that ignorant shit\nAnd they bound to get sick of us quick but I ain't sealin' my lips\nIt's a shift, I know you feel it man\nWe blowin' up like a ceiling fan\nDroppin' off jewels like Killa Cam's man\nWhen it comes to kickin' verses, I'm Mr. Van Damme\nCrushin' strawberries, it's a jam\nSo throw up both hands if you can\nIronic how I'm killin' this shit, until they bury me\nMy volume is going in depth with longevity\nStupids", "image": "https://images.genius.com/252e8274d38f0d4a7ea351dd63231cbb.612x612x1.jpg"}], "artist": "Joey Bada$$"}