{"songs": [{"title": "What You Want", "album": "Todd Smith", "year": "2006-04-11", "lyrics": "[Hook: LL Cool J and Freeway]\nYou ice grilling, your blood spilling\nTell me little homey, what's the reason?\n(That can lead to Freeway squeezing) What you faking for?\n24's peeling, ain't no sailing\nMove little homey, see the O.G. leaning\n{LL, I keep birdies fiending} What you hating for?\n\n(What you want?) {big faces, the coupes and the Lincs}\n(What you get?) {top models that gargle in the mink}\n(Who you hit?) {whoever want it, I take it to the brink}\n{It's funny, but I need the Philly money, we had a link}\n{What you want?} (cash money, the jewels, and the car)\n{Who you hit?} (everything from the chickens to the stars)\n{Who you with?} (you rocking with the president of future)\n(The whole world feeling, that's killing 'em with them bars, here we go)\n\n[LL Cool J]\nIntoxicating, got grown women vibrating\nSo nervous that her cervix is dilating\nOn purpose, so her man know I'm violating\nL shirtless now scrams on the wire hating\nYeah, I'm captivating, boy, leaving 'em baking\nWhen the microphone is vacant, vagina waking\nBig shoes to fill don't get it confused\nI will get gutter on 'em, my beats is crispy\nMy bars is like butter on 'em, with a udder on 'em\nSo if you a pimp, we even and bust a scudder on 'em\nMighty L, the biggest, I make rap religious\nHit every country of the world, made 'em all dig us\nI got a vendetta, I must blend cheddar\nI use a pen with the steel, never been better\nThere never will be one to out skill me\nIt's nothing you can tell me, it's like God built me\n\n[Hook]\n\n[Freeway] (LL Cool J)\n(1) 2 (3) 4 (5) 6 (7)\n(Kick in the door) Yeah I rhyme for the legend\nStay strapped I'm on point with the weapons\n(They fell asleep in the getaway car, they half stepping)\n(7) 6 (5) 4 (3) 2 (1, this my 12th album, but your man's not diz-one)\nThis my second album, but your boy's not slipping\n(Queens in the building) Philly is where I'm friz-om\n(Let me get siz-ome, make sure she kiz-um)\n(Bush is the prez but I voted for Shirley Chisholm)\nMe and L, same track, it gotta be craz'\nIt's like, he's Shaq and I'm Dwayne Wade\nNow let's go!\n\n[Hook]\n\n[Freeway]\nPhilly Freeway is hard as hell\nBattle anybody, pull a trigger, catch a body\nYup, lose your breath, don't mess with the shottie\nPut the burner to your mami, then I rock her bells\nIt's young Freeway on the go\nI'm on the speedboat, jeez, don't sit in the cell\nOnly for a second, then they get they bell\nWhen I put the freeze on, you gon' need your coats\nIt's a cold one, you gonna need your toast\nBut me and L O.G.'s overseas for winning\nYour body moms, Swiss cheeses with us, and they no\nTeasing with us, she break us off, she trynna please us both\nChicks argue then I leave 'em broke\nI'm just a 'boy in the hood' like Jody Breeze\nThe bundle book still owe cheese\nAnd the haters on the block wanna see me broke\nYeah I know they wanna see me smoke\nBut I'm the person who the smoke and can't open your V\nThen I go, crack open the O.E\nThe don heron flow keeping it potent, let's go\n\n[Hook]", "image": "https://images.genius.com/8f036bc91d1ae759df9acb3ca88e0c5f.1000x1000x1.jpg"}], "artist": "LL Cool J"}