{"songs": [{"title": "Dear Summer", "album": "The Suffix ", "year": "2005-11-20", "lyrics": "[Intro]\nYeah, Suffix, people, yeah\nYou know\nYou, you, you already\nYeah, come on\n\n[Verse]\nKickin rocks on the block, tellin all the OGs\n\"I be coming for your spot when you're not looking\"\nHot cooking, momma got it on the kitchen table\nI thank God we were always able to\nGet the leather couch, big screen, cable too\nNintendo when them good grades came through\nThen the cooked Ks came through\nSome soft, some stepped-on, but we kept on\nAnd I slept with the work plenty nights\nThought I heard niggas coming, thought I saw the cop lights but\nI was dreaming, then I woke\nThe junkies was still fiending, and I had coke, so\nII had hope; you may say that it's wrong\nBut I ain't talking to your child, I'm talking to this song\nI'm just doing a walk down memory lane\nIf I crash, just pick up my brain\nAnd yes, my niggas the same, but they quicker to bang\nAnd if they do, then I'm the nigga you blame\nSo I shoot first anyway, and I would do the honors any day\nAnd tell your honor he a bitch to his face\nAnd whip through the state like I whip through the yay\nShow your ass how to take four and get eight\nAnd it don't take four niggas to get straight\nThe only hot boy eating off this plate, Young...\nWeezy, baby, that's what ya bitch say\nGive her ass a location and a template\nShow her how to work the interstate\nStop working with that thinner weight, get your brakes fixed\nStop playing, 'cause all we know is gunplay\nTrip while you're full and my clip gon be emp-tay\nWhen the stomachs get empty, anything's tempting\nAin't nobody safe when it's for the kids' sake\nHurricane wipe the south like a earthquake\nWe tryna save face, but we ain't got a place\nTo stay, so they made us evacuate\nWe on our way, pussies; relocate\nY'all know us when you see us, put your jewels up\nPut your cars, put your clothes, put your shoes up\nIt's that serious, homie, pick the news up\nIt wasn't good, nigga, think about the hood, nigga\nThe people who ain't never had shit, ain't gon never have shit\nBullshit, 'cause they still gon try to manage\nNiggas doin anything, like, God gon' understand them\nBut please understand us, niggas with money lost mansions\nNiggas with nothing lost families\nLives lost in traffic\nWater up to the attic, there goes the stashes\nBut a nigga got passion\nEven though the bounce-back seeming like Magic\nShit, but call me Siegfried\nWatch how I turn one key to a hundred Gs\nYeah, dear summer, summer breeze\nSummer, please know I live for you\nThrow on the wife-beater, let back the lid for you\nA few years I'll prolly hear from you, but now I'm here for you\nI know niggas that shed a tear for ya\nBehind bars, tryna get to ya, they'll prol'ly never see you\nIt's that real talk if you ever heard it, homie\nShit hurt so much, might have to hurt you, homie\nNo commercial, no fronting, no curve on it\nNo cut, tell life, \"S what?\"\nThe drought's here, not only white slowed up\nThe weed slowed up, we can't even roll up\nFuck, put a dent in the money, too\nBut that's the last thing, 'cause hustle is what we do\nBut hustle with what? How we getting on?\nWhere he sitting at? What he sitting on?\nStand up if you know it's true\nThe end of the world coming and my city the proof, damn\nShit... And this is after disaster, this ain't rap, this a recap\nStepping off the G4, still strapped\nBust your head in the air, that's a sky-cap\nHave my car pick me up where I arrive at\nDrop the work off 'cause it don't go where I reside at\nGarbage bags filled up with dollars\nDead presidents, gotta dump the bodies\nBirdman, as long as we gon' eat\nThen everybody eat off me\nFeet off ground, fingers to the stars, reaching\nAnd I'm a get death through these bars, believe me\nI'm down for the cause, even\nWhen everything paused, I proceeded\nI'm a leader, me, the son of Jacida\nFuck the world, not the people, damn!", "image": "https://images.genius.com/50e5682ab0aa5fc2ae8062617850bb87.500x500x1.jpg"}], "artist": "Lil Wayne"}