{"songs": [{"title": "Nitro", "album": "Walking with a Panther", "year": "1989-06-09", "lyrics": "[LL Cool J]\nCheck this\nI excel, they fell, I said - well, hell\nL can yell or make em melt like gel\nI signed the contracts that bills'll stack\nPlay the wall or fall I stand tall you're small in fact\nStep aside, you might get fried\nBy the super technique that the rapper applied\nAs a matter of fact, the impact will distract\nYour attention away, from the rest who say\nThey can mess with Cool J the best of today\nYou fess cause the rhymes are so funky fresh\nI'mma attack smack and make em stand back\nBlack strong as Cognac I got the knack\nTo rhyme to the rhythm of this, and give em a gift\nThat's swift, other rappers are stiff and don't riff with\nMr. Smith, cause that ain't safe\nI get you wide open like an uncut eighth\nI write to fight, don't bite, to reach heights\nThe mic makes right, give me the spotlight\nSo I can prove the pen is mightier than the sword\nLL hard as hell, the lyrical lord\nThe counterfeit misfits that rap had to admit that\nMy rhymes are so dangerous, I need a permit to rap\nSolo, on the microphone\nMC's -- don't let me catch you alone\nI'm nitro!\n\nYo, I got the kick of a kettle drum, guaranteed to overcome\nYou're just a minimum, messin with the maximum\nAnd when I swung my tongue among the high strung\nYoung MC's, they all got done by the legend\nEvery second I'm wreckin\nNot a mistake you'll find, but you can keep checkin\nOut the sound you'll find that it's genuine\nBet that you'll rewind this a thousand times\nYou can taste the bass like it's filet-of-sole\nI leave the microphone full of bullet holes\nI drop the bomb like I'm in 'Nam and go beyond\nThe normal boundaries of too much harm\nTo MC's, but as they say please I freeze\nRhymes like these kill like a disease\nTried to fill my shoes, and caught the blues\nBecause they get bruised by the rhymes I choose\nI kill rappers at random, I don't understand em\nThe ones I didn't get, are on a memorandum\nLines I recite are spontaneous\nThe nursery rhymes you write, are miscellaneous\nSo pass the crown, bow down and give in\nI'm the Prince of Rap, that's how we livin\nSettin milestones on the microphone\nEmpires are overthrown, and I ain't even baritone\nNo joke I spoke then God stroke\nAs Job tried to sweat the style and got soaked\nConquered and killed on the microphone\nMC's -- don't let me catch you alone\nLL's nitro!\nNitro!\n\nYo, flammable -- like gasoline\nThreatening -- like a guillotine\nIt's like a bad dream when you battle my team\nI go to every extreme to make MC's scream\nI'm clever, I last forever, we can do whatever\nWith whoever, whenever, I never\nEver got rocked, stopped or dropped\nThey got popped, by the hip-hop rock that I concoct\nI'm so nice yo, flowin with the maestro\nMurderin and hurtin MC's because I'm nitro\nThe earthquakes'll kill snakes and fakes\nYou can't flake, you made a mistake, give me a break, thanks\nNow that we're straight and that's clear\nWatch all the big mouths - dissapear\nDisintergrate, deteriorate, fall\nI demonstrate, and devastate you all\nThere's no doubt about the fact I turn it out, the wack\nBe on the lookout, LL made a comeback\nFull of power, I'mma devour\nI stand tall as a tower, I won't allow a\nMC to C-O-M-E, C-L-O-S-E\nPlay me long D-I-S-T-A-N-C-E, M-C's\nOn the microphone, I'm nitro!\nNitro!\nYo (funky)\n\nI daze amaze faze blaze and beat em down\nNowadays they crave and praise, the funky sound I pound\nRhymes I write em in, recite em and then slide em in\nOrder to slaughter comp and stomp soon as I begin\nTotal domination, across the nation\nDevestation, cut sensation, it's the invasion\nOf L the Terrible, devastating rhymin wiz\nI cut through through do and chew, you know what time it is\nSlick, I kill for kicks, vic you quick\nHard as bricks, rock ya sick over the mix\nThe L, L, C, O, O -- L J Period now you know bro!\nN-I-T-R-O yo, go for what you know\nUnless you're dumb cause yo, I'm nitro-glycerin\nListenin and takin notes\nIcin enticin and slicin throats", "image": "https://images.genius.com/35b951a9c90707d0d03de9bebbadefc6.999x999x1.jpg"}], "artist": "LL Cool J"}