{"songs": [{"title": "“ask me words” - bino (notero is here too)", "album": "Forum Q&As", "year": "2013-12-02", "lyrics": "@DC26\n\n1. Which track had the most interesting story or process?\n2. What do you think about when every things done and you’re alone with nothing but your thoughts?\n3. Which track is your favorite?\n\n@ChildishGambino\n\nI guess “oldest computer” mackelmore was supposed to be on it, but it became a little too house-y. then ms.banks came and made it a different song. it was cool to see\n\nI never feel like everything’s done honestly\n\nUrn\n@ChitownGuevara\n\nWhat are you doing right now? ;)))\n\n@ChildishGambino\n\nIm hanging with notero (nicole) and eating sushi\n@MyNamesCody\n\nAre there more doors opened or closed in the entire world at this moment?\n\n@ChildishGambino\n\nThe problem is we see doors\n@brockemsockemz\n\n1. What was your inspiration for Flight Of The Navigator?\n2. Favorite collab with Chance the Rapper?\n\n@ChildishGambino\n\nI just felt really strange about death after seeing someone leave. i felt like it was a really cruel joke\n@Skyart\n\n1) What are you saying @2:23 on Zealots…\n2) What is the meaning for some of the titles, like sweatpants\n\n@ChildishGambino\n\nI’m saying “wanna walk too?”\n\nRich people wear whatever they want\n@CLOUDS\n\nDuring what season did you record this album?\n\nSpring? summer? fall? winter?\n\nDid it have an effect on your songwriting/state of mind/et cetera?\n\nThnx\n\n@ChildishGambino\n\nI started Christmas day of last year. we were recording on this mountain above weather, so we weren’t cold unless we came down. I made it with winter in mind\n@streetlights\n\n- Will you be my friend and can we eat Osso buco together?\n- Can you break down some of the beats on Because The Internet?\n- How much influence do you get from Kanye West?\n\n@ChildishGambino\n\nI am def your friend if you’re good with yourself and like to talk about stuff. notero LOVES my osso bucco\n@AKNC17\n\nSorry to get personal right away but people always ask basic ass questions in Q and A’s so here it goes\n\nI know you were raised Jehovah’s Witness but do you still follow any type of religion?\n\n@ChildishGambino\n\nI don’t really believe in religion for myself. i’ve become spiritual, more at peace with things. but i don’t believe in god. not like that\n@goochcrucible\n\nWhat website do you visit the most?\n\n@ChildishGambino\n\nRap genius\n@TheDarkKnight\n\nWhat was the meaning behind the title of “Clapping for the Wrong Reasons”?\n\n@ChildishGambino\n\nIts a semi famous quote\n@Robertf\n\nDonald, can you explain the greatness of Sade’s debut album “Diamond Life.” I would appreciate a very detailed explanation of why Sade is so great and what she means to you as an artist. If you refuse to answer this question I will take it to mean you do not enjoy the musical styling of Sade….and as such you will draw my full ire\n-22 y.o male who has just gotten heavily into Sade’s music\n\n@ChildishGambino\n\nI was literally listening to sade yesterday. she’s a world artist. and her music is just in tune with whatever vibration we all run on. I can’t answer a lot of your questions about her, all i can say is she’s a special artist/being\n@MaxGertler\n\nWhat does the ending of the last song symbolize? like that life can end at any second randomly?\n\n@ChildishGambino\n\nYou should read the ‘because the internet’ script when it’s released\n@CrookedModerator\n\nIf you could trade hairlines with another person, who would it be?\n\n@ChildishGambino\n\nThey tell me i should fix my hairline cause i got money now\n\nI ain’t gon sit around and front like i ain't thought about it\n\nA perfect hairline is more appealing but it’s funny how\n\nMy shit is FUCKED UPPPPPPP but look how far i done got without it\n\nI keep my HALF OF AN OCTAGON hairline fucked up just to show the kids it’s real\n@Kid_Kamikazee\n\nWhat did your followers realize at the end of The Biggest Troll?\n\n@ChildishGambino\n\nThey realize “they don’t need a leader”\n@Fran-Soul\n\nDude you are awesome love your music and my question is do you ever see your self touring Africa? coz that’s the only way I will ever see you unless you buy me a plane ticket to see you live in the US\n\nPliz respond\n\n@ChildishGambino\n\nI really wanna see africa. we were planning on south africa soon\n@WiggityWackWes\n\n1. There were huge jumps style-wise and sonically from Camp to Royalty to Because the Internet, do you see yourself developing a “signature sound” or do you plan on keeping things experimental and constantly trying new sounds?\n\n2. Your music has helped me through a lot and continues to, so I just wanted to take this opportunity to thank you for what you do. Thank you!\n\n@ChildishGambino\n\nThanks\n\nI always wanna experiment. in everything. i’ll always try to push myself. i just never wanna be bored\n@RayBeach\n\nDo you make things that have or message or do you just let people interpret it? Kind of like 3005?\n\n@ChildishGambino\n\nI make things with messages for me in them. i hope they translate. sometimes they don’t, and that’s fine, but i usually just try to touch on something that’s intangible for me\n@BasedGator\n\nQuestion part: What inspires you when it comes to production? I hear a lot of tradtional trap drums and sounds on the new album, which make sense since your from the south, but you didn’t really do that on Camp. Then you got something like ‘Zealots of Stockholm’ where it gets Death Grip-ish. Is it as simple as your just finding the right sound for the lyrics or do you draw from other things?\n\nSince your probably not going to see/respond to this, let me stan a little bit haha\n\nStan part: You are my role model, I can identify with your life and lyrics so well it’s crazy. I really hope in 10 years I can be as successful and well respected as you. I already liked your comedy and acting, but ever since I found out you rapped and I heard that E.E. Cummings line in ‘Freaks and Geeks’ I was hooked. Anyway, The new album is dope as heck, great work as always sir, and I can’t wait to see what you do in the future\n\n\n\n\n\n@ChildishGambino\n\nHa. thanks\n\nI try not to think to hard about what’s trap drums, what’s influenced by who’s hot now, and all that. i try to just find what feels honest. cause i don’t know if i’d wanna hear a song that was considered entire original by everyone, but was no fun to make. this album, tho it came from a messy place, was by far the most fun to make\n@SavvyRJA\n\nIt sounds like you are influecnced by john lennon quite alot? care to elaborate?\n\n@ChildishGambino\n\nTo be honest, i don’t know much about him. i was always a beach boys dude over beatles. i learned a little about him through jhene\n@SavvyRJA\n\nWho is your favorite artist outside of Hip-Hop?\n\nPerosnally, Gorillaz or Red Hot Chilli Peppers\n\n@ChildishGambino\n\nAnything by sam cooke\n@griffinmahon\n\nDo you think there is more room for expression or creativity in short films as opposed to full-length movies? Does this translate to the relationship between mixtapes and albums in rap?\n\n@ChildishGambino\n\nShort films just fit normal people a little better. time is ultimate currency. we don’t have a lot of time to spend. a short film, for me, leaves more to the audience, and doesn’t take so much time. And if it’s free, then you really have no excuse not to watch it and at least have an opinion\n@Flowmatic\n\nWhats your perspective on camp looking back at it now ?\n\n@ChildishGambino\n\nI love camp. it there’s little things i’d change, cause i know how music better, but yeah. i does what it’s supposed to do\n@FlyTendencies\n\nHow do you sing so beautifully?\n\n@ChildishGambino\n\nThat’s what you call it?\n@A1_Day\n\nDid My Beautiful Dark Twisted Fantasy and Yeezus’s sound play a role in Because The Internet? How big of a influence is Kanye to you?\n\n@ChildishGambino\n\nI guess it influenced me as much as it influenced all music to be better? but honestly, his whole steez isn’t for me. I can’t do that. he just inspires me to be limitless\n@StefanPonce\n\nCAN YOU BREAK DOWN THE SONG TO “BOY BAND” ?!!!???!!!!\n\n@ChildishGambino\n\n\n@MYH\n\nHow can mirrors be real if our eyes aren’t real?\n\n@ChildishGambino\n\nMirrors aren’t real\n@Metron\n\nWhat’s the biggest opportunity that you could have taken but you missed out on in your life? Did you explain the abrupt ending on Life: The Biggest Troll?\n\n(I forgot to @ before cuz I was excited)\n\n@ChildishGambino\n\nI don’t feel like I’ve missed any opportunity, honestly\n@GrizzyCreekwater\n\n3 questions :\n\n1) Favourite cartoon , what is your choice ?\n\n2) Would you ever do more stand-up shows or skits for youtube ?\n\n3) Favourite album in 2013 , from any genre ?\n\n@ChildishGambino\n\nI really like China, IL. American Dad has the best jokes. Adventure time. Regular Show. Amazing world of gumball\n@brockemsockemz\n\nIf you were an animal, what would you be?\n\n@ChildishGambino\n\nKoala\n@SavvyRJA\n\nWho is your favorite philosopher?\n\n@ChildishGambino\n\nPatrice O'Neal and Louis CK\n@darwin_shameran\n\nYou have Andrew Auernheimer in your song, weev (Andrew) is openly known as a racist and anti-semite, how come you decided to include him?\n\n@ChildishGambino\n\nVideo\n@Eon2323\n\nHey Donald, big fan here (actually #1 Gambino scholar here, but nbd). I have a couple of questions\n\n1) Do you have a whole bunch of those white shirts or is it the same one?\n2) Are you thinking about doing another comedy special in the near future?\n3) What was your sister’s reaction to your fame and come up in the rap game?\n4) Has Chevy Chase ever recited any of your lyrics or played any of your songs?\n\nThanks for just taking the time to read the questions. roscoes wetsuit\n\n@ChildishGambino\n\nFirst. thanks for doing all this work for me on rap genius\n\n1) i have like 9 of these shirts\n\n2) i honestly don’t know\n\n3) she’s good with it. she’s the best\n\n4) no. I’m positive he has never heard of childish gambino. I’m pretty sure he thought i was eddie murphy the entire we were on set\n@AkonoMiles\n\nMy question to you childish is what advice do you have for all the creatives out there that work so much on polishing their craft. that surround themselves with all types of shit, music, art, etc and try as much to absorb to than emit that knowledge into their work. what advice do you have childish cause sometimes i be feeling like im going nowhere. especially seeing others who do what i do get further than me when their ideas are really nothing but regurgetated shit we’ve all seen. i just feel like im going crazy sometimes yo. haha. thanks — akono\n\n@ChildishGambino\n\nYeah. i think you have just look at what y o u really want. it can be frustrating. but u also have to know how people work and what people want from you\n\nYou should read “mastery” by robert greene\n@ChildishGambino\n\nCool. i have some work to do\n\nThanks for the questions. rap genius is a dope place. cool to see you guys taking such good care of it\n\nHappy leak day\n\nEveryone kiss notero goodnight\n\nLearn to code", "image": "https://images.genius.com/5a9c598da4e86fefcb845cbbe74706aa.1000x1000x1.jpg"}], "artist": "Childish Gambino"}