{"songs": [{"title": "Set It Off", "album": "Tha Last Meal", "year": "2000-12-19", "lyrics": "[Intro: Snoop]\nReal nigga shit..\nNow I'm bout to show you how the West coast rock\nReal nigga shit\nNow I'm bout to show you how the West coast rock\nReal nigga shit..\n\n[Verse 1: MC Ren]\nHere come The Villain again, grab your ho and get the fuck outta town\nThis nigga shit make the world go round\nIt's that black nigga Ren, duck when I bust\nMake Jada get on these nuts, make Will love to cuss\nYou wanna fuck with us? Man, I wouldn't do it\nAsk this nigga here, his ass, we ran right through it\nYou out actin like yo' shit be tight\nGet some shit, fuck it off like Tomica Wright\nGet the fuck out my sight, I Ren-incarnate\nDroppin West coast shit in every motherfuckin state\nMotherfuckin legend, y'all niggas be knowin\nYou can leave yo' bitch and keep on goin\n\n[Verse 2: Snoop Dogg]\nI am Doggy Dogg bitch (beitch) love to hit a switch\nNever hit a bitch (beitch) love that gangsta shit\nCan I hear your flow? Can I fuck yo' ho?\nBoy you hard on 'em - nigga you ain't know?\nWhen you testify, you got to keep it fly\nA lot of niggas lie, shit we do or die\nE'ryday we high, it's like a nine to five\nI got my nina my fo'-heata beata by my side\nI keep it tucked close when I'm on the West coast (West coast)\nI keep it on post when I'm with my East coast folks locs (East coast)\nY'all know what's crack-a-lackin\nI'm from the hood of the drivebys and kidnappings, and car-jackings\n\n[Hook: Ice Cube]\nMe and Snoop Dogg on the hog\nOn our way to the mall, fuck alla y'all\nWe gon' ball til we fall, watch the chrome crawl\nIntercept these fine bitches cause we want 'em all\nDroppin drawers, poppin coochie and lickin balls\nOnly gangsta ass nigga follow nigga laws\nOnly gangsta ass bitches get to run the hogs\nOnly real ass niggas get to set it off\n\n[Verse 3: The Lady of Rage]\nNow, the way I gets off in that ass it's a sin to not assassin\nGrab a microphone have flashbacks and start flashin, ahh\nI'm bound to toast ya\nString you up like you was on the Ponderosa\nSip on Mimosa do it that way cause I'm supposed ta\nNow most of ya, don't measure up\nI'll make it hot and turn the pressure up\nSteamin, regular, nah supreme and I\nAin't gassed\nI blow an MC away like Fox when I pass\nAin't nuttin shitty about this here fuck around and that's that ass\nJust like, grass I, I want more Green than the Goblin\nMatter of fact I want more Bank than that chick that be modelin (UHH!)\nMy uzi weighs more than a single ton\nI leave you single son, who wanna mingle not a single one\nHah, now tell me what you figure, nigga\nRob load up the show slow flow spitter\nThe hard hitter (UHH) the R nigga, roll\nI break it down sweet then I bring it back slow\n\n[Hook]\n\n[Verse 4: Nate Dogg]\nNigga that was dumb diggy diggy dumb dumb\nHere them niggas come kiddy kiddy come come\nI think a nigga sprung spriggy spriggy sprung sprung\nProbably why he done diggy diggy done done\nYo' lady think I'm cute, I be knockin her boots\nWhen she's away from home, she be swallowin juice\nYou thinkin that's yo' son, but he ain't lookin like you\nSee the barrel of a gun, nigga whatcha gon' do?\nSet it off\n\n[Verse 5: Snoop Dogg]\nNiggas pop mo' shit while we drop mo' shit\nContinously, nigga nigga please\nSlang yo' ki's, birdies and trees\nYou can catch me and my niggas, overseas\nShootin the breeze, with a cute Vietnamese\nOr was she Lebanese? I think she Chinese\nIt really don't matter cause they all on they knees\nIt's somethin bout these motherfuckin West coast G's\nMake that cheese, when the cops come you bet' not freeze\nBlast on 'em like the Genovese, they yo' enemies\nLock you up and fuck you up\nTalk shit to you beat you down then cuff you up\nAnd leave you in a cell stuck (damn!)\nI ain't got no money for bail, that's real as fuck (f'real)\nTryin to get a meal ticket and kick it\nChill, catch a plane to Spain or maybe Brazil\nOn the real can you feel me?\n\n[Outro: Kurupt]\nYeah, yeah, set it off\nIt's Kurupt Young Gotti\nDoin it big, for all y'all suckers\nWe set it off, Snoop Dogg!\nIt's \"Tha Last Meal\"\nLast time y'all suckers gon' eat off my big homeboy\nWe set it off!\nWe set it off! West coast   ", "image": "https://images.genius.com/1abc5e5fc609da0014a0675d49a1a15f.953x953x1.jpg"}], "artist": "Snoop Dogg"}