{"songs": [{"title": "Power of a Smile", "album": "The Rose, Vol. 2: Music Inspired by Tupac’s Poetry", "year": "2005-09-20", "lyrics": "* Poems written by Shakur as ~ interpreted by other artists\n[Layzie Bone - reciting poem]\nThe power of a gun can kill, and the power of fire can burn\nThe power of wind can chill, and the power of mind can learn\nThe power of anger, can raise inside until it tears you apart\nBut the power of a smile, especially yours, can heal a frozen heart\n\n[Krayzie Bone over poem]\nAnd tomorrow, we'll wake up with the promise of a smile, smile\nYes, maybe tomorrow, we'll wake up with the promise, of a smile\n\n[Intro: Wish Bone]\nRest in peace..\n2Pac, Bone Thugs\nIn His Own Words\nLet's go\n\n[Refrain: Wish Bone]\nAnd tomorrow, morrow, morrow, and tomorrow, morrow\nAnd tomorrow, morrow, and tomorrow we\n\n[Hook: Krayzie Bone & Wish Bone]\nI see the light... (and tomorrow, morrow, morrow)\nI can see the light... (and tomorrow, tomorrow)\nI see the light... (and tomorrow we)\nSee the light that shines... (and tomorrow we)\n\n[Verse 1: Krayzie Bone]\nWell, we still looking for better days\nHoping tomorrow can bring us some bigger and better things\nSo we can escape this maze, and they give us our change in every way\nAnd maybe tomorrow, can bring us the truth\nAnd there'll be no more use, for the pain and sorrow\nLet's put it to use and then maybe the youth, can come and follow\nAnd we can leave all our problems in the bottle, tomorrow\nMaybe god'll wipe our eyes and we'll never have to cry no more\nOr even better, have to die no more\nPoliticians can't tell us lies no more, he decides no more\nMaybe tomorrow, it can be our daylight\nJust might be our sunshine, sunshine..\nYesterday is filled with so much misery and drama\nAnd today it don't seem like I'm getting any further\nPraying tomorrow we can somehow come out of the struggle\nAnd need no more hustle, no stumblin cause we all one muscle\nStill looking for a better day, day, and a better way, way, way\nSo let's hope tomorrow... can lead us to the place we tryin to be\nIn heavenly harmony, in heavenly harmony!\n\n[Hook: Krayzie Bone & Wish Bone]\nI see the light... (and tomorrow, morrow, morrow)\nI can see the light... (and tomorrow, tomorrow)\nI see the light... (and tomorrow we)\nSee the light that shines... (and tomorrow we)\nI see the light... (and tomorrow, morrow, morrow)\nI can see the light... (and tomorrow, tomorrow)\nI see the light... (and tomorrow we)\nSee the light that shines... (and tomorrow we)\n\n[Verse 2: Wish Bone]\nWhere there's a will there's a way, don't let it stand in your way\nLook 'em straight in they face, let 'em know you ain't playing no games\nWe searching for better days, wanna live them better ways\nWhat I promise, heart is all you need to rock\nBe honest, succeed, just look at me!\nIf I can do it, you can do it, we can do it, just believe, believe, believe!\nWhen I lay down, I think about some of the wrong things I done\nSo I pray now, for God to erase some of that wrong\nWipe my soul clean, to be wanted, when he calls me, when he calls me!\nSo I can't sleep, cause I'm worried, I done did things, lord forgive me!\nIt's a damn shame, the things we do to get it our way!\nSnitch on thugs, just to get it, your pay!\nNowadays I act right, in the past we used to fight\nWhere the loyalty at? Where them real street thugs? Where the thug life?\nWhere there's a will there's a way!\n\n[Hook: Krayzie Bone & Wish Bone]\nI see the light... (and tomorrow, morrow, morrow)\nI can see the light... (and tomorrow, tomorrow)\nI see the light... (and tomorrow we)\nSee the light that shines... (and tomorrow we)\nI see the light... (and tomorrow, morrow, morrow)\nI can see the light... (and tomorrow, tomorrow)\nI see the light... (and tomorrow we)\nSee the light that shines... (and tomorrow we)\n\n[Verse 3: Layzie Bone]\nSo as the hours pass by, in the event of my demise\nTell my momma not to cry, these are the words of the wise\nLook at liberty needing glasses now that the promise been broken\nFor the better, keep on hopin, powerful words that's spoken\nWhat I'm quotin is a G, acquired his knowledge from the streets\nMakaveli, 2Pac Shakur, was the rose that grew from concrete\nAmerica's most complete artist, regardless, one of the hardest\nOn a mission to make it better, with the soul of Malcom and Martin\nMixed with a little Garvey, today he got us callin\nOur brighter star is fallen, but now before he was ballin\nOut of control, quick to let a nigga know what he stood for, be a friend or foe\nAnd I bring the truth in the booth cause ain't nobody gon help me\nThis is life, it's a gamble, and I'mma scramble till my pockets wealthy\nFuck what they tell me, I'm all about my biz\nBitch, street biz or showbiz, I'mma make y'all know this\nAnd I'mma say this to every man, woman and child\nDon't you ever be afraid to smile, smile for me now\nAnd I'mma say this to every man, woman and child\nDon't you ever be afraid to smile... the power of a smile!\nBone, Bone, Bone, Bone, Bone, Bone-Bone-Bone-Bone! Bone-Bone-Bone-Bone!\nBone, Bone, Bone, Bone, Bone, Bone-Bone-Bone-Bone! Bone-Bone-Bone-Bone!\n\n[Layzie Bone over hook]\nBone, Bone, Bone, Bone, Bone\nBone-Bone-Bone-Bone, Bone-Bone-Bone-Bone\nBone, Bone, Bone, Bone, Bone\nBone-Bone-Bone-Bone, Bone-Bone-Bone-Bone\n\n[Hook: Krayzie Bone & Wish Bone]\nI see the light... (and tomorrow, morrow, morrow)\nI can see the light... (and tomorrow, tomorrow)\nI see the light... (and tomorrow we)\nSee the light that shines... (and tomorrow we)\nI see the light... (and tomorrow, morrow, morrow)\nI can see the light... (and tomorrow, tomorrow)\nI see the light... (and tomorrow we)\nSee the light that shines... (and tomorrow we)", "image": "https://images.genius.com/564b6e0956d929fc7ae90322b3dc5f9b.953x953x1.jpg"}], "artist": "2Pac"}