{"songs": [{"title": "Hot Nigga", "album": "Sorry 4 The Wait 2", "year": "2015-01-20", "lyrics": "[Intro]\nI'm sorry for the wait, nigga\nI'm tighter than these pussy hoes, I'm chafe, nigga\nPockets full of crumbs, I'm a breadwinner\n(Jahlil Beats, holla at me)\n\n[Verse]\nUh, I'm sorry for the wait, nigga (sorry!)\nI'm aiming at your Beats by Dr. Dre, nigga (bop!)\nI put up some ornaments today nigga (why?)\nCause 'round here, every day a holiday, nigga\nThis that Sorry 4 the Wait 2 (Sorry 4 the Wait 2!)\nThat AK shoot like K Du (bop!)\nHad to tell myself, \"Tune, just stay tuned\" (ay)\nSwear I got the hardest floor, my shit break brooms (ooh!)\nUh, I been hot since 1998, nigga (ay)\nThat's 98 degrees, Nick Lachey, nigga (ay!)\nHope you know the Feds got Instagram\nThey liking every photo that you take, nigga!\nI was totin' a gun before a switchblade (yeah)\nCut your head off and put it on display (bitch)\nBoy, we find out where you live and then we invade (bitch)\nBoy, we do not kill no kids, but your bitch dead (bitch!)\nOoh, shawty like the way that you floss out (ay)\nTill I shoot you in the head, now she grossed out (ugh!)\nI'm the boss, you just heard it from the horse mouth\nI told a nigga count on me and niggas lost count\nThis world is only preparation for the next (alright)\nMoney bags under my eyes, money over rest\nTryna get a hundred M's out the alphabets (uh)\nOpen up my mouth to smile, ooh, treasure chest (ooh!)\nOoh, DJ Stevie J keep the Glock on him (Steve J!)\nI just bought a new .44 and I'm a proud owner (bop, bop, bop!)\nBelfast and Monroe, that was our corner (that's true!)\nFuckin' fast in your ho, ooh, cowabunga\nSip some lean, pop a Xan bar (Xan bar)\nMy bougie bitch pussy taste like caviar (caviar)\nOnce I fuck a bitch, her pussy is a landmark (ay)\nI don't know how you like your steak, but I'm in rare form (get 'em!)\nFuck them bitchass niggas, fuck whoever care for 'em (get 'em!)\nMama jumped out a plane, I was air-borne (see ya)\nGold watches, gold chains; watch for Leprechauns (what?)\nFavorite subject was PE, Pablo Escobar\nKill him when he least expect it, at a restaurant (blaow!)\nThrow him with the rest of 'em, in a reservoir (run it)\nI'm the renaissance man, peep my repertoire\nExcuse my French, but it's menage a trois, au revoir! (ayy!)\nWoo, my Nina Ross got a bad mouth (yeah)\nYea, I'm consuming grass like a cash cow (yeah)\nGive a fuck 'bout a police with his badge out (fuck 'em!)\nIf you ain't got a warrant, get up out my damn house!\nThis that Sorry 4 The Wait 2 (2!)\nThis a all white affair, I brought the yay through (come on)\nShe said, \"Tunechi, skate through, and I'ma skate you\"\nI'm aimin' at your grapefruit, bop, grape juice! (ah!)\nWoo, tell them bitches free dick and blow\nGive me head, can't kiss no more (nope!)\nI got: free jewelry, car keys, and more\nAnd I just started robbin' like a week ago!\nHundred diamonds on my bitch, I don't bling no more (no!)\nTwo hundred thousand for a show, you gotta speak to Po (Po!)\nYeah, got me on my Young Money shit (Young Money shit)\nNo Cash Money, just Young Money shit (woo!)\nWoo, got me on my Young Money shit, yeah\n\n[Outro]\nYeah, hahaha\nMy nigga Chaz Ortiz in this bitch with me\nMula!", "image": "https://images.genius.com/c84ee812d9e99028d560054b386d4d9d.500x500x1.jpg"}], "artist": "Lil Wayne"}