{"songs": [{"title": "Crooked Ass Nigga", "album": "2Pacalypse Now", "year": "1991-11-12", "lyrics": "[Intro]\n(Suddenly I see, some niggas that I don't like)\n(*machine gun fires)\n(Got him)\n\n[Verse 1: 2Pac]\nA smoking-ass nigga robbed me blind\nI got a TEC-9 now his smokin' ass is mine\nI guess I felt sorry for the bastard, he was broke\nI didn't know he smoked so I didn't watch him close\nHe caught me on the sneak tip, now the punk's in deep shit\nCatch him on the streets, I'mma bring him to his feet, quick\nPass the clip, I think I see him comin' now\nFuck the bullshit, posse deep and let's run him down\nGots to be the first one to hit ya when we meet\nComin' quickly up the streets, is the punk ass police\nThe first one jumped out and said \"Freeze!\"\nI popped him in his knees and shot him—punk, please\n’Cause cops should mind they business, when we rush\nNow you're pleadin' like a bitch, cause you don't know how to, hush\nNow back to the smoker that robbed me\nI tell you like Latifah, motherfucker give me body\nOne to the chest, another to his fuckin' dome\nNow the shit can rest, yo tell him to leave me the fuck alone\nTwo very bloody bodies on the streets\nA nosey ass cop and a nigga that robbed from me\nRun from your backup punk, how you figure?\nMy finger's on the trigger for you crooked ass niggas\n\n[Hook]\nCrooked ass niggas\n(Criminal behaviour-- criminal-- criminal behaviour)\n(Suddenly I see--)\n(Cri-cri-criminal)\n\n[Verse 2: Stretch]\nNow listen to the mack of the crooked nigga trade\nWith the fine criminal mind, cold rips like a blade\nIt's already quick stepping to the niggas with the props\nAnd any motherfucker with the flim-flam drops to the knot\nTen o'clock, is a motherfuckin' gank move\nStretch is Uptown, clockin' weight the shit is real smooth\nA nigga's tryna play me like he know me but he don't\nSittin' on ten kis, I'mma get him, think I won't?\nMy nigga 2Pac got the fuckin' Glock cocked and he's ready\nWhen the kid, didn't even bring the weight bag, instead he\nWelcomed us, into his apartment\nOh, this even better, two to the head, he's dead a clean get a-WAY! Niggas got PAID!\nAnd yet another sleepin' ass nigga got slayed, word up\nBy a crooked motherfucker named Stretch\nAnd the T-U-P-A-C, the police can't catch\n\n[Hook]\nThe crooked ass niggas\n(Criminal behaviour)\nYeah, you don't stop!\nCrooked ass niggas\n(Criminal-- criminal behaviour)\n(Suddenly I see, some niggas that I don't like)\n\n[Verse 3: 2Pac]\nNow I could be a crooked nigga too\nWhen I'm rollin' with my crew, watch what crooked niggas, do!\nI got a nine millimeter Glock pistol\nI'm ready to get witcha at the drop, of a whistle\nSo make your move, and act like you wanna flip\nI fire thirteen shots, and pop another clip\nI bring luck, my Glock's like a fuckin' mop\nThe more I shot, the more motherfuckers dropped\nAnd even cops got shot when they rolled up\nBest to bring a knot, or get popped, I'm a soldier\nI ain't the type to fetch ya, ask Stretch, he's my witness\nSmoke til I'm blitzed, fuck a motherfuckin' piss test\nI'm trigger happy, try to 'tack me and I'll drop you quick\nLong as I got a clip I got some shit to hit 'em with\nThe nigga killer I get iller when the shit gets thick\nMy brain flips, I start thinkin' like a lunatic\nI rip shit, came equipped with a bigger crew\nI thought these niggas knew, I'm a crooked nigga too\n\n[Outro]\n(Criminal behaviour-- criminal-- criminal behaviour)\nCrooked ass niggas come in all shapes and sizes\nThey wear disguises, backstabbing's what they specialize in\nThey'll try to get 'cha, they'll sweat 'cha to get in the picture\nAnd then they hit 'cha, son of a bitch! Now he's richer\n(Criminal behaviour-- crimi-criminal behaviour)\nCrooked ass nigga\n(Suddenly I see, some niggas that I don't like)\n(Criminal behaviour-- criminal-- criminal\nCrimi-crim-criminal behaviour (haviour)-- criminal behaviour\nCriminal behaviour)\n(Suddenly I see, some niggas that I don't like)\n(Suddenly I see, some niggas that I don't like)\n(Suddenly I see, some niggas that I don't like)\n(Criminal behaviour- criminal be- criminal crim--\nCrim-criminal behaviour\nCriminal be- crim-crim-crim-crim-crim--\nCriminal behaviour-- criminal behaviour)\n(Suddenly I see, some niggas that I don't like)\n(*machine gun fires)\n(Got him)\n(Suddenly I see, some niggas that I don't like)\n(*machine gun fires)\n(Got him)\n(Suddenly I see, some niggas that I don't like)\n(*machine gun fires)\n(Got him)", "image": "https://images.genius.com/839619da9eb2d92ecf5367044a1fb2ba.500x500x1.jpg"}], "artist": "2Pac"}