{"songs": [{"title": "Respect", "album": "Ready to Die", "year": "1994-09-13", "lyrics": "[Intro: Diana King & The Notorious B.I.G.]\nNo big up our gun men, seen? (Big up, big up)\nCuh dis ah '94 when ah RAA fi kill people and kyaan dun\nNuh waan pussy hole hold di kaanah\nWatch this, lawd\n\n[Chorus: Diana King]\nMe holla respect, to all the gun men dem\nGun men alone, keep gun men friend\nFire bun, fi all the informer dem\nInformer lone keep informer friend\n\n[Verse 1: The Notorious B.I.G.]\n1970 something, nigga I don't sweat the date\nMy moms is late so I had to plan my escape\nOut the skins, in this world of fly girls\nTanqueray and Hennessy until I call hurl\nTen months in this gut, what the fuck?\nI wish moms would hurry up so I could get buck\nWild juvenile ripping mics and shit\nNew York, New York, ready for the likes of this\nThen came the worst date, May 21st\n2:19, that's when my mama water burst\nNo spouse in the house so she rode for self\nTo the hospital, to see if she could get a little help\nUmbilical cord's wrapped around my neck\nI'm seeing my death and I ain't even took my first step\nI made it out, I'm bringing mad joy\nThe doctor looked and said, \"He's going to be a bad boy\"\n\n[Chorus: Diana King]\nMe holla respect, to all the gun men dem\nGun men alone, keep gun men friend\nFire bun, fi all the informer dem\nInformer lone keep informer friend\n\n[Verse 2: The Notorious B.I.G.]\nNow I'm thirteen, smoking blunts, making cream\nOn the drug scene, fuck a football team\nRisking ruptured spleens by the age of sixteen\nHearing the coach scream ain't my lifetime dream\nI mean, I want to blow up, stack my dough up\nSo school I didn't show up, it fucked my flow up\nMom said that I should grow up and check myself\nBefore I wreck myself, disrespect myself\nPut the drugs on the shelf? Nah, couldn't see it\nScarface, King of New York, I want to be it\nRap was secondary, money was necessary\nUntil I got incarcerated, kinda scary\nC74-Mark 8 set me straight\nNot able to move behind the great steel gate\nTime to contemplate, damn, where did I fail?\nAll the money I stacked was all the money for bail\n\n[Chorus: Diana King]\nMe holla respect, to all the gun men dem\nGun men alone, keep gun men friend\nFire bun, fi all the informer dem\nInformer lone keep informer friend\nMe holla respect, to all the gun men dem\nGun men alone, keep gun men friend\nFire bun, fi all the informer dem\nInformer lone keep informer friend\n\n[Verse 3: The Notorious B.I.G.]\nNinety-four, now I explore new horizons\nMama smile when she see me, that's surprising\nHoneys is tantalizing, they freak all night\nKeep ducking cops on the creep all night\nAs I open my eyes and realizing I changed\nNot the same deranged child stuck up in the game\nAnd to my niggas living street life\nLearn to treat life to the best, put stress to rest\nStill tote your vest man, niggas be tripping\nIn the streets without a gat? Nah, nigga you're slipping\nIf I'm dipping on The F with weed on my breath\nOriginal hustler with the muffler on the TEC\nRespect to the macks in the Ac's\nTo the freaks in the Jeeps, lick shots to my peeps\n\n[Chorus: Diana King]\nMe holla respect, to all the gun men dem\nGun men alone, keep gun men friend\nFire bun, fi all the informer dem\nInformer lone keep informer friend\nMe holla respect, to all the gun men dem\nGun men alone, keep gun men friend\nFire bun, fi all the informer dem\nInformer lone keep informer friend\n\n[Post-Chorus: Diana King]\nNow this is Diana King doing a Yankee thing\nIn a Biggie Small's thing, do it, Ja\nHave mercy!\nThe gunman in all de party\nAnd everybody feel irie\nAnd everybody just follow me, follow me, follow me\nHave mercy\nThe wul ah we in ah de party\nAnd everybody look irie\nNow di man them sexy, sexy, sexy\nDo it\n\n[Outro: Diana King]\nNo mercy fuh nuh big up unnu self\nCuh we nuh watch [?][4:15] seen?\nHardcore thing we ah deal with\nOh yes, we are the best\nNo other guy can test\n\n[Skit: The Notorious B.I.G. & Faith Evans]\nShit, mami, damn, why you actin like that, man?\n'Cause I don't be doin' this\nI'm sayin', you know it ain't nothin'\nIt's just part of sex, ya know'm saying\nBut you know I don't do this\nI don't even know how to do this\nI'm just sayin', jus— just a little peck mami, for daddy\nJust a little peck\nLike that?\nThat's what I'm sayin', yeah\nYou know I don't be doin' this though though\nYou know that\nWhatever bitch, God damn it", "image": "https://images.genius.com/e6cce6ad5c26175653cd5e5590b6e235.1000x1000x1.jpg"}], "artist": "The Notorious B.I.G."}