{"songs": [{"title": "Problems", "album": "Category F5", "year": "2009-07-14", "lyrics": "[Intro]\nProblems, problems, problems\nProblems upset you\nProblems, problems, problems\nProblems upset you\nProblems, problems, problems\nProblems upset you\n\n[Verse 1: Twista]\nWhen I'm on the track you will see accuracy\nActually I know that you will see I come like I got the fully\nAutomatic for disintegration of the problematic and negativity of whoever caused the static\nPick up a rose and sniff a scent if you think it's magnificent\nStop the stressin' or just catch a blessin' if it's sin\nIf it's bills or if it's rent\nSome of us worry some of us don't that's why everybody so different\nThe only answer to you problems, solve 'em\nStallin' is the only thing that can stop the ballin'\nThough world is full of hatred, face it\nGet out the matrix and let's get back to the basics\nInstead of being individual let's practice a ritual of bein' indivisible when it's critical\nSo every time that some drama hit yo doorstep\nGotta try to keep your composure and don't let\n\n[Hook]\nProblems (Don't let)\nProblems (You can't let)\nProblems (You won't let)\nProblems upset you\nProblems (Don't let)\nProblems (You can't let)\nProblems (You won't let)\nProblems upset you\n\n[Verse 2: Tech N9ne]\nI'm a problem because I'm different\nAnd people don't get it when I be the clown\nKnockin' suckas down when I be kickin' my music\nTech is dangerous if you think you can hang with us\nSick in your brain a bit when I mangle it\nKnow that I'mma break and abuse it\nHave you prayin' to God 'cause what I'm spraying is odd\nAnd I'm slaying this broad, Tech Nina's laying his ride\nI'm insatiable when it comes to be making this gouda\nI'm a sniper, killa, murderer, look out I'm a shoota\nA dilemma we taking out you beginners\nComing to my psycho cinema, it's a must that I crush them\nIf you accustomed to lovey dovey movies\nThen you unlucky because they call me Tecca Nina: the snuff film\nThrowing the fist up 'cause all of my grips up\nPeople was hating but now they zipping their lips up\nNever debated, you imitated get ripped up\nStuck off in Necropolis 'cause Tecca Nina and Twista's a\n\n[Hook]\nProblems (Don't let)\nProblems (You can't let)\nProblems (You won't let)\nProblems upset you\nProblems (Don't let)\nProblems (You can't let)\nProblems (You won't let)\nProblems upset you\n\n[Verse 3: Twista]\nMy alien complex can get as lethal as bomb threats\nWhen I put together patterns and concepts\nBut when it come to dealin' with pain and problems and relationships I ain't gonna lie I ain't the bomb yet\nWhat do we need? What's the resolution?\nIs it restitution or just retribution? Let's just start a revolution\nBut wait, I'm hesitant because in fact\nHow can I fight to be equal if the president is black and umm...\nA Chi Town resident at that\nHope we focus on us instead of wars in Iraq\nThe future is bright or will it be weary\nDo I need to pay attention to conspiracy theories?\nIs the government systematically destroyin' the population for the progress of one dominant nation?\nSmile, even if the landlord callin'\nDodge 'em, but that the least of your problems\n\n[Hook]\nProblems (Don't let)\nProblems (You can't let)\nProblems (You won't let)\nProblems upset you\nProblems (Don't let)\nProblems (You can't let)\nProblems (You won't let)\nProblems upset you\n\n[Outro]\nTry not to get worried\nTry not to turn onto\nProblems that upset you\nDon't you know", "image": "https://images.genius.com/c1135ec8e864ff4d3bd7cba290c2f598.747x1000x1.jpg"}], "artist": "Twista"}