{"songs": [{"title": "About Me (Original)", "album": "Only Built 4 Cuban Linx... Pt. II", "year": "1995-09-08", "lyrics": "[Intro: Raekwon]\nYeah, ah-yeah, yeah, yeah, yeah, yeah, yeah\nYeah, ah-yeah, yeah, yeah, yeah, yeah, yeah\nYeah, ah-yeah, yeah, yeah, yeah, yeah, yeah\nYeah, ah-yeah, yeah, yeah, yeah, yeah, yeah\nYeah, you know how we do it\nTurn me up, kid, let's get it popping\nYo Dre, good looking on this coke, man\nThis shit is official\n\n[Verse 1: Raekwon]\nAiyo, it's back to business, making them diskettes, pushing sixes\nRocking wild animals on jackets are sickening\nHear me? From here to Rockaway to Cali, we flipped this\nBroad day, Chef'll saute, his lyrics is crispy\nNow I got Dre up in the kitchen, Rae stuck in position\nBout to flame broil his coke and get busy\nWhat? Politics, pop collars and drive violent whips\nStay fly, hungry and wise, you know the code, honor it\nSit back, yelling it's nothing, unless his buttons get pressed\nWe don't stress nothing, we only get dressed\nStretched out, moving professional, frying more fish\nI heard it in slurs, them niggas is blessed\nWhile we ball to the maximum, give me the floor, for real\nI show off and let my money get stretched\nTake it to a new level, new bezzle, few rebels\nFew wolves with medals on, you know we get test\n\n[Hook: Raekwon]\nMe, nigga, me, that's who, Cash Rule\nYou better slow it down, niggas'll smash you, cousin\nMe, nigga, me, pass through, rascals\nHalf gorilla, half ape in them track suits, black\nMe, nigga, me, capsules, birds, whips\nOunces and fifths no licking the glass, duke\nYeah, yea-yea-yeah, yea-yea-yeah, yeah (yeah)\nI'm here, so it's there, yea-yea-yea-yeah, yeah\n\n[Verse 2: Game]\nYo, I be on the Island, wildin', stallions under the Phantom hood\nWith the V12 growling like Mike Vick's pit bulls, the last one to die\nProbably cried, chinky eyes, heading straight for the dirt\nThat's how it is in my hood, Compton, niggas put you under the Earth\nFour-five bulging out that white T-shirt like a hard on\nThis block shit is ill, like the nigga that put Raekwon the God, on\nI can drink to that, but all the Patron probably gone\nChef brought the Hennessey, we start to get our polly on\nAshy knuckles, taped up veggies in a duffle\nBack to back Beemers, Moss'll play me in a huddle, yeah\nI pop big shit, New York Knick shit\nL.A. Laker paper, Kobe coming off a pick, shit\nI'm the shooter, the marble rip ruger\nHard tops, we tell stories like Slick Rick the Ruler\n\n[Hook]\n\n[Verse 3: Raekwon]\nI'm that live little live nigga up in the Lex\nSwinging through hoods, ratchets and a couple Gillette's\nPeoples is straight, can't tell me nothing, we cake\nRolling lovely, bricks and white shit up in Mercedes\nI live by the code, I was never a fake\nWhen it's time to ride, I be in the front with the ace\nLighting blunts, Marvin Gaye shit, bumping them great\nGlass of Cru', get a writing hand, wiping the paint\nCandy apple shine, all my niggas in the line, pollying\nEverybody jollying, and we straight\nWhat it do, baby, Wu coming through in that new Mercedes\nEverybody looking like it's Houston, but it ain't\nStaten Island hot boys, pushing them hot toys\nYou gon' fuck around and let your woman get you got boy\nWho ripped the fever back in '97, rip the year?\nWho came in Cali after west coast gangstas there?\n\n[Hook]", "image": "https://images.genius.com/2691e582dc2839478e49279288d69cb1.1000x1000x1.jpg"}], "artist": "Raekwon"}