{"songs": [{"title": "Perception Vs. Reality", "album": null, "year": "2015-03-14", "lyrics": "[Hook]\nPerception or reality, now what's realer?\nAnd can I really trust that man in the mirror?\nThe death-span of the human mind gets nearer\nCan't withstand time when you're raised out here\nRaised out here\nWhen you're raised out here\nWhen you're raised out here\nRaised out here\nWhen you're raised out here\nOnly place guaranteed is the grave out here\n\n[Verse 1]\nRaised out here, you're never really here, but out here\nWelcome to the jungle, yo, you're living in fear\nLions, tigers and bears, hunters gather your spears\nHow the hell we gonna survive for the next hundred years?\nAnd it's hard to stay alive when one side don't share\nBe the food or eat the shit, either way say your prayer\nAnd if we are what we eat then we're already deceased\nThat's why my squad rolls deep in the bellies of beasts\nPosted at the deli, heli's over the streets\nThe block cold heat, now I'm soaking my feet\nNo, my hands ain't dirty, but as you can see\nI'm another misconception of reality\nSo when the 'po drop by he ain't gotta ask me\nAbout the body that somebody caught last week\nI ain't finna go downtown in no backseat\nCause perception is reality when black like me\nPerception or reality, it's more than meets the eye, I know\n\n[Hook]\n\n[Verse 2]\nPerception or reality, now what's realer?\nAnd do you really base judgement 'bout what I'm hearing\nYoung rich nigga, chinchilla, other [?]\nObjects in this mirror seem closer than they appear\nEverything ain't gold\nBut these days I might pay up just to say it ain't so\nGotta get it, I gotta get that dough\nGotta get my mama in a new Range Rove\nAnd what you saying though?\nAnd yes I meant [?]\n\n[Hook]\n\n[Outro]\nSo, what's your perception when you see a big bald-headed inmate standing on stage wearing prison boots? Are you thinking \"I wonder what that guy did?\" or \"look at those tattoos, he must be one of those white supremacists or a gang member.\" (Black like me) Are you curious to what the reality may be?\nThe reality for me is...", "image": "https://images.genius.com/04d0b6e6105201632be0a45e1968ba75.1000x1000x1.jpg"}], "artist": "Joey Bada$$"}