{"songs": [{"title": "Same Song & Dance", "album": "Relapse", "year": "2009-05-15", "lyrics": "[Intro]\nYeah\nSame song and dance\nDamn girl, everywhere I go\nSame song and dance\nI like the way you move, all over the globe\nSame song and dance\nSomething about it, man\nSame song and dance\nIn the pale moonlight, yo\n\n[Verse 1]\nI'm lookin' at ya, yeah girl, you're kinda tooken back by\nThe whole rapper thing, aren't ya?\nProbably thinking you'll get slapped so dang hard, ya\nWon't even be able to stand up straight, aren't ya?\nCouple rape charges, people think you're a monster\nThe police constantly bugging you non-stop\nI walk up on ya, “Well, hello Tonya”\nI think you got your OnStar button inside your car stuck\nYou out of gas? Do you got a flat?\nI would hate for you to be stranded at the laundromat\nI got your back\nWhy don't you put your laundry baskets in the back\nAnd sit up front; I'm not asking, it's a trap\nYou just got jacked and body snatched, and it's a wrap\nIn broad day, and no mask for this attack\nI heard 'em say exact opposites attract\nIf that's a fact, it'll take task force to get you back\nCome on\n\n[Chorus]\nYeah baby, do that dance\nIt's the last dance you'll ever get the chance to do\nGirl, shake that ass, you ain't never gonna break that glass\nThat windshield's too strong for you\nI said, yeah baby, sing that song\nIt's the last song you'll ever get the chance to sing\nYou sexy little thing, show me what you got, give it your all\nLook at you bawl, why you crying to me?\nSame song and dance\n\n[Verse 2]\nThe first victim I had, she was a big one\nBig movie star, a party girl, big fun\nShe was the girl the media always picked on\nIn and out of rehab every four-to-six months\nShe was always known for little pranks and slick stunts\nAt Nickelodeon, flashed the little kids once\nWhat an event it was, I was sitting in front\nI was hooked in at the first glimpse of them buns\nSeen her backstage, now here's where I come in, son\nLook, here she comes, I better pull out the big guns\nHello Lindsay, you're looking a little thin, hun\nHow 'bout a ride to rehab? Get in, cunt\nBut starting off on the wrong foot is what I didn't want\nGirl, I'm just kidding, let me start over again, hun\nSee what I meant was, we should have a little intervention\nCome with me to Brighton, let me relieve your tension\nYou little wench, ya, murder wasn't my intention\nIf I wanted to kill you, it would've already been done\nSlowly she gets in and I begin to lynch her\nWith 66 inches of extension cord\n\n[Chorus]\nYeah baby, do that dance\nIt's the last dance you'll ever get the chance to do\nGirl, shake that ass, you ain't never gonna break that glass\nThat windshield's too strong for you\nI said, yeah baby, sing that song\nIt's the last song you'll ever get the chance to sing\nYou sexy little thing, show me what you got, give it your all\nLook at you bawl, why you crying to me?\nSame song and dance\n\n[Verse 3]\nMy second victim was even bigger than the first\nPop star, icon, the whole works\nShe played a little schoolgirl when she first\nBurst upon the scene and seen that the world was hers\nShe twirls and turns and flirts in skirts so bad it hurts\nIt irked me, it made me mad at first\nI lashed out in my songs, but what was really going on\nWas that I had developed a crush\nI just didn't know how to tell it to her\nShould I cut off one of my ears and mail it to her?\nSend her pictures of my collection of skeletons, or\nFootage of me impaling myself on an elephant tusk?\nWe'll settle this once and for all, I'ma tell her at dusk\nTonight, tonight is the night, and tell her I must\nCreep up to her mansion in stilettos, and just\nClimb the gate, and ring the bell, like \"Hello, my love\"\nI just picked your prescription for Seroquel up\nNow would you like to share a pill or two with me?\nI'll share my Valium with you 'cause I'm feeling you Britney\nI'll trade you a blue one for a pink one\nEver since a schoolgirl juvenile delinquent\nI've been feeling you, ooh-ooh, girl, you sexy little gal, you\nHold that pill any longer, it'll get sentimental value\nC'mon toots, give me the Valium alley-oop\nI'll slam dunk it in your mouth 'til you puke\nAnd just as soon as you pass out in your alphabet soup\nI'm 'bout to make a new outfit out of you\nNew outfit? Shit, I'll make a suit out of you, shoot\nNow, show me how you move, baby, do how a-you do\n\n[Chorus]\nYeah baby, do that dance\nIt's the last dance you'll ever get the chance to do\nGirl, shake that ass, you ain't never gonna break that glass\nThat windshield's too strong for you\nI said, yeah baby, sing that song\nIt's the last song you'll ever get the chance to sing\nYou sexy little thing, show me what you got, give it your all\nLook at you bawl, why you crying to me?\nSame song and dance\n\n[Outro]\nSame kicking and screaming, same crying and sobbing\nSame song and dance\nSame begging and pleading, same yelling and bleeding\nSame song and dance\nYeah\nSame song and dance\nI know\nSame song and dance", "image": "https://images.genius.com/280d45965a412d7e2a115e2db61d79f2.1000x1000x1.jpg"}], "artist": "Eminem"}