{"songs": [{"title": "Mumbling & Whispering", "album": null, "year": null, "lyrics": "[Notorious B.I.G.]\nAnd ya don't stop, hit it!\nMumbling and whispering is what I hear\nWhen B.I.G. appear on the scene niggas get scared\nWhy? I'm not the stick-up man\nI don't want the rings on your hand, I don't understand\nWhen I come thru the avenue I must know voodoo\nCause all eyes are on you know who - huh!\nAnd my so-called friends beg for ends for me to lend\nBut this bankrolls they won't spend\nI don't need 'em, let the welfare feed 'em\nWhen it come to 'wassup' the peace sign is how I greet em - uh\nSometimes they won't get that, sweating me for some chit-chat\nBite my lyrics like kit-kats\nOpen your eyes, realize ain't no sugar in my tank\nOut of all my friends, there's just one I want to thank\nMy man Big D taught me a lesson that was great\nThat good things come to those who wait\nAnd we've waited through the suffering and pain\nAnd bitches ride the dick like the A-train\nThat's why I flip\nKeep a burner to my hip\nTake a hooker to the crib, you know she got to strip\nStay dip, take out of state trips\nDon't drink a lot of Hennessy, I only take a sip\nI'm a skipper, like a captain, rapping is my specialty\nAnd the best is me, so the rest will see\nB.I.G. don't need to practice\nI'm like a sharpshooter shoot the needle off a cactus\nOnly thing I lack is stage fright and conceit\nI completely defeat the weak - uh\nEven the strong don't last long\nCause I'm Brooklyn born, bay-bro\nI'm not a paper gangster of no sort, don't smoke Newports\nWhen I get stressed I grab my vest\nPut a MC to the test quick specially if he talk slick about who we flipped then whipped\nI tripped the competition, stepped across the step to the big boss\nYou know, of course, they took a loss\nSteppin to big and a hitman 50 grand\nLike sinkin' in quicksand, ya need a hand my man\nDamn, tried to give you the warning sign\nWhen I said chill, I wasn't sayin' LL rhyme\nI was telling ya not to flare up\nHe's about to tear up, I'm telling you not to erupt\nCause he just as corrupt as a DJ should be - huh\n50 Grand, and I'm the BIG\nMister Cee..\n\n[Mister Cee]\nYo, here we go here we go here we go here we go here we go motherfucker here we go\nCan ya withstand this kind of a man\nGettin in your ass like sand\nBut this ain't a date at the beach lil each\nAnd every mc in the place check the speech\nAnd i'll bet the dough from my show they can't get wit\nMister Cee on the flow till I get bit\n\n[Notorious B.I.G interjecting]\nNah nah nah nah nah love. you can't do it like that love. you got to ride that motherfucker you know what I'm sayin? you got to riiide that motherfucker\n\nTry to get props on the brother, that pops the most\nAnd clocks the most, drops the most shit like a pigeon\nListen, to the words I'm slippin' through saliva\nAin't a MC liver, I'm the rap MacGyver\nDoin' tricks with my lips so quick\nIf you blink you would miss the great style of Chris\nDon't try to diss, cause I dismiss, dissaprove, dissapoint\nRappers that think they the joint\nHuh, they'll get the point quicker\nFaster even, MC's I'm leavin' until you can't breathin\nYou call it a homicide, I call it a suicide\nTry to battle me boy ya deserve to die\nPunch ya in your eye, before I blade ya\nTo let ya know that I can fight before I slayed ya\nCall me Chris, this I insist\nAnything different will lead to closed fist\nA wrap up. you don't wanna get tapped up", "image": "https://images.genius.com/accf2df97375292b16f399ff6ec71e6e.500x500x1.png"}], "artist": "The Notorious B.I.G."}