{"songs": [{"title": "Midwest Choppers", "album": "Misery Loves Kompany", "year": "2007-07-17", "lyrics": "[Intro: Tech N9ne]\nWelcome to misery, punk!\nWe deep rooted in this, y'all hear what I'm sayin'?\nKCMO! KCK!\nYerm sayin'? It's how we do it\nTech N9ne in this piece\nStrange Music represent! What!?\n\n[Verse 1: Tech N9ne]\nWelcome to Missouri where the killers pop it off\nAnd when I say pop it off I mean\nDeadly with the tongue or the gun\nWe can do it if anybody want it, whether rapping\nOr get to clapping up another, tell everyone\nMisery Loves Kompany so we dump at the\nEnemy when it be energy sendin’ me the route\nOf negativity, trippin' with me, you runnin' for your life\n'Cause you ran your mouth (Mouth)\n\n[Hook: Tech N9ne]\nWe can sang or we can bang\nIt ain’t no game we untamed\nWhether it’s fame or we can aim\nRelease your brains it ain’t no thang\n(Midwest Choppers)\nYer'm sayin', we livin' in pain\nAnd it’s a shame that you\nCame and got drained and listen\nMan, stay in your lane\n(Midwest Choppers)\nSang or we can bang\nIt ain’t no game we untamed\nWhether it’s fame or we can aim\nRelease your brains it ain’t no thang\n(Midwest Choppers)\nYer'm sayin', we livin' in pain\nAnd it’s a shame that you\nCame and got drained and listen\nMan, stay in your lane\n(Midwest Choppers)\n\n[Verse 2: Tech N9ne]\nFinna witness the murderous monologue of a menace\nComin' from out of a sinister formidable place\nI can let you know the ins and the outs\nAnd I can spit it wicked twisted\nAnd you can see by the look of my face\nGimme the mic and I’ma mangle it tangle it\nDefinitely the people see that I got the hang of it\nPity you gotta try to make a mockery of a city who\nBlock 'em and block 'em, buck at you baby we dangerous\nCame to get strange with it, bang with it\nStop and get a little untame with it\nGet this chopper like I'm fully a bully with a hoodie\nShould he get up and take 'em out or spit 'caine with it?\nWell the answer is right before your eyes - who do you despise?\nKillers who chop you we got to stop you\nPop you partner, you gushin'\nGet up outta the way when Tecca Nina be bustin'\nGotta give it up, I’m a veteran like Edison\nI’ma light 'em up and get in your head again\nI’m better than ever, never let up feather in, death he be fetishin'\nSever it, hit the mic and then we pedalin' medicine\nI’m a chopper, chopper, chopper!\nAutomatic kickin' the ammunition\nKillin' the competition, no it ain’t nobody\nHotter, hotter, hotter!\nDamagin' everything and everybody\nYou know we on a mission, listen to me\nHow can I make you understand I'm a general\nEven if you poppin' the competition is minimal\nKan-city killers and you can bet that we criminal\nThe demon inside of me keep on tellin' me when to go\nSo I’ma keep reppin' the midwest choppers freakin' flows\nAnd I’m 'bout to be up on top of this and truly be bustin'\nBeggin' for mercy, you punk I ain’t givin' you nothing (nothing)\n\n[Hook: Tech N9ne]\nWe can sang or we can bang\nIt ain’t no game we untamed\nWhether it’s fame or we can aim\nRelease your brains it ain’t no thang\n(Midwest Choppers)\nYer'm sayin', we livin' in pain\nAnd it’s a shame that you\nCame and got drained and listen\nMan, stay in your lane\n(Midwest Choppers)\nSang or we can bang\nIt ain’t no game we untamed\nWhether it’s fame or we can aim\nRelease your brains it ain’t no thang\n(Midwest Choppers)\nYer'm sayin', we livin' in pain\nAnd it’s a shame that you\nCame and got drained and listen\nMan, stay in your lane\n(Midwest Choppers)\n\n[Verse 3: D-Loc]\nLyrically we be the best in the Midwest and we caked up\nI ain’t talkin' about women, I’m talkin' about paper\nD-Loc and Dalima enter the center\nAnd get coded and when in the competition we for sure to kill 'em\nI spit like a fully and ready made, through any type of weather\nWith the Beretta tucked right, under my sweater\nAnd we hotter than lava\nThe way that my gillas be keepin' it poppin'\nPartner you tight, but my gillas are better\nWe keep it choppin' like a blender, eatin' boys up for dinner\nGuillotines we chop your heads off, and throw 'em out the window\nWe too critical we ill and you walking away looking so pitiful\nThe AGT we be the number one contenders\n(When it come to the street we still post on the block)\n40 Cal. on my lap and my middle finger up to the cops\nOn the way to the studio to go and make another hot track\nThey be lovin' the way that we spit it when we drop\nThey call me D-Loc, so the functioning definition of a soldier\nMy opposition is more culture than Rocha\nI spit like a Tommy and anybody in my way I’ma fold 'em\nAnd me and my gilla gorillas want it 'cause we the coldest boys\nBe tryin' to battle 'cause they want our position\nBut they can never get in it because we better and bigger\nAnd like I told you we the number one competitors dealin'\nWorkin' their way up to the top and they won't stop til they get the millions\nIn the hone of the century D-Loc and Dalima\nChemistry, you can never cross with them\nIgganas idah the ebe ossinbay the yricala\nIggertra eavela otherma uckerfay’s lost\nYou can try to read us, you can try to beat us\nTry to get your speed up, but it ain’t gon' matter\n'Cause after we get finished bustin' there ain’t gon' be no laughter\nWe takin' over the map with Tecca Nina the master (master)\n\n[Hook: Tech N9ne]\nWe can sang or we can bang\nIt ain’t no game we untamed\nWhether it’s fame or we can aim\nRelease your brains it ain’t no thang\n(Midwest Choppers)\nYer'm sayin', we livin' in pain\nAnd it’s a shame that you\nCame and got drained and listen\nMan, stay in your lane\n(Midwest Choppers)\nSang or we can bang\nIt ain’t no game we untamed\nWhether it’s fame or we can aim\nRelease your brains it ain’t no thang\n(Midwest Choppers)\nYer'm sayin', we livin' in pain\nAnd it’s a shame that you\nCame and got drained and listen\nMan, stay in your lane\n(Midwest Choppers)\n\n[Verse 4: Dalima]\nWhen I’m off in a zone, I get to representing the city of the K\nHollow your brain ‘cause I’m a disaster\nDalima get ridiculous if I’m comin’ at you\nLeave ‘em in a predicament 'cause I’m a style master\nAnd I’m not impressionable, now just so you know\nI make 'em sweat, cause I’m the best with the flow\nWhenever you wanna flex we can go, keep stressin’ your cold\nAnd I bet I leave your neck on the floor\nMidwest finna blow like (C4 with a low strike)\n‘Cause the energy is the bomb\nI can tell that you’re fascinated by the way that we rhyme\nAnd we glow like when the four strike with the fire\n(It ain’t nothin’ you can say though)\n‘Cause I’m sipin’ on Henny and bustin' like a semi on enemies now\nIrritated with the haters that be coming around\nSo I’m kickin' like a relevant but an arrogant style\nMeaning that I’m really sure so\nI’m too sick for a cure, so\nAin’t a need for a doctor\nMy verbal word play, be making your nerves shake cause I caught you\nPants down when I popped you\nNow let’s take a trip through the valley of real gill\nStrange individuals with a militant ill skill\nPop a collar and holler at the broads with real skrill\nGet down for the cause, cause we flossin' big wheels, (what up with it?)\nDon’t be acting like you get tough with it\nWhen the choppers come out the truck spitting\nAll of the Strange gill killas gon' be devoted to leavin' your body smokin' when really you can’t get up with us\n(And that’s game that’s proper)\n‘Cause whenever I’m bustin’ it’s like a full heart stopper\nDalima, Tecca Nina, Kaliko, and D-Loc\nRippin' ‘em up with the flow 'cause we’re Midwest Choppers! (choppers!)\n\n[Hook: Tech N9ne]\nWe can sang or we can bang\nIt ain’t no game we untamed\nWhether it’s fame or we can aim\nRelease your brains it ain’t no thang\n(Midwest Choppers)\nYer'm sayin', we livin' in pain\nAnd it’s a shame that you\nCame and got drained and listen\nMan, stay in your lane\n(Midwest Choppers)\nSang or we can bang\nIt ain’t no game we untamed\nWhether it’s fame or we can aim\nRelease your brains it ain’t no thang\n(Midwest Choppers)\nYer'm sayin', we livin' in pain\nAnd it’s a shame that you\nCame and got drained and listen\nMan, stay in your lane\n(Midwest Choppers)\n\n[Verse 5: Krizz Kaliko]\nHey Tech, watch this!\nKali Baby, you better act right get right\n'Cause I’m the baddest nigga hookin' up with the fastest badass\nThat'll hit you with the lyrical lyrical miracle whip, incredible\nBitin' like the head off a cerebral\nDiggy-diggy down, once your figgy frown at the c-c-clown them\nHounds is bound for your town, diggy-diggy-diggy\nAnd if you lookin' for the sound\nYou can be found by the nigga wearin' the crown\nAre you really with me?\nAnd when you hear it nigga then zip it\nThe exhibit make you wanna reposition your pivot\nWhen we write it and spit it, we makin' somebody get it\nAnd if they won’t hear it and deal it, but forget it to get it (Stop!)\nOr I can keep babblin' on\nOr rattelin' off at the mouth while we travelin'\nAnd I’ll be thinkin' it all be speakin' about the things that I be doin'\nA couple scooping up out my mouth this album ‘bout to ruin\nYou and you and you\nAnd I can stop with the drop of the Caribou\nAnd if it’s on and poppin' it’s due with you and you\nAnd I won’t hesitate to chop you when chewin' you\nUh huh, while they doin' you\nAnd if you lookin' for the better in the veterans who can bust\nYou got the Kali gun for fun\nAnd if you throw, we bustin' back at you when you attack\nI’m on the track I hope they puttin' down the gun\n(Dalima’s a chopper) Chopper!\n(D-Loc a chopper, that Tecca Nina’s a chopper)\nThe Kaliko will knock your block off\nYou never see it coming, hit you when we were gunning\nYou running we walk off (We walk off)\n'Cause it's more than bread that we're wanting (We flaunting)\nAnd we comin' headhunting\nNo we won’t stop ‘til we get to the top\nYou in the way, then we midwest chop ya (Chop ya)\n\n[Outro: Tech N9ne]\nStrange Music, bitch\nSeven years of excellence\nT-O-G, and N-9-N-E, real numbers, bitch\nNow from us to you\nTech N9ne collabos\nWelcome to Misery Loves Company\nAnd for all the haters:\nFuckin' peasants. Soo Woo, motherfucker\nFigure it out", "image": "https://images.genius.com/d568b86ce102e78c9c49f201c1a48234.953x953x1.jpg"}], "artist": "Tech N9ne"}