{"songs": [{"title": "La La La", "album": "The Drought Is Over 2 (The Carter 3 Sessions)", "year": "2007-06-01", "lyrics": "[Intro]\nThat's right, Carter 3, come on\nYea, yea walk with me\nCome go with me\nIt's Lil' Weezy baby, ha ha\n\n[Hook]\nAnd I'm just lightin' up my la\nYea, yea, yea, 1-7, Cash Money, Young Money\n\n[Verse 1]\nBorn in New Orleans, raised in New Orleans\nI will forever remain faithful New Orleans\nI thank you New Orleans, thank you Holygrove\nThat's been my hood since a snotty nose\nI come through the hood, suicidal doors\nI used to come through the hood on the handle bars\nGat in my draws, money in my pocket, crack in my jaws\nI hope it don't dissolve\nAnd you know I'm ducking 5-0 and my Moms\nYoungin' quick to go off like car alarms\nNow the young'n keep his mind on the parmesan\nThem other niggas ain't eatin' like a Ramadan\nSpit the shit that make you feel it in your chromosomes\nGot some money, put my whole damn corner on\nYoung Carter part 3, I'm the cornerstone\nEagle Street keep it going 'til Homer's home\nAnd I'm just lightin' up my\n\n[Hook]\n\n[Verse 2]\nCan I kick it? Can I kick my story to y'all?\nMy glory in God, my faith in my flow, I pray that I go\nWhere no other rapper has, and when you're rappin' as\nVivid as I the limit is the sky, so I\nStudy B.I., I bang 2Pac\nI hum Aaliyah and Soulja Slim was a leader\nWho am I not to follow greatness?\nI give these MCs hell like they all atheists\nTell them hatin' niggas \"one\" like they in the Matrix\nAnd tell the cops I can buy my own bracelets\nI'ma keep the paper running like a pair of ASICS\nUsed to sport the Gucci Bucks, nigga no laces\nStriped polo, five-pocket Girbaud\nMama got her tubes tied, I'm rockin' dolo\nI used to have the starter jacket with the logo\nAnd the hat, me myself I had the N-O\nThat's the Saints, nigga\n\n[Hook]\n\n[Verse 3]\nIt's Lil' Wayne and I'ma shine in the rain\nNow nothin' gets cleared without me signin' my name\nI'm just headlinin' the game\nWon't quit until I'm A-Rod in the game\nThey ridin' the bench, they not in the game\nI misplaced the key, to the lock and chain\nMy spot remain, like a bleach stain, or cranberry\nIt's Murder She Wrote like Angela Lansbury\nI remember being small, man\nNew toys when my mama won the card game\nGot my gifts before Christmas, then have to wait for them\nI had a ten-speeder, scooter, and a skateboard, haha!\nThen we moved to the suburbs\nMe and Lil' Toya Johnson was love birds, aww man!\nAnd I swear I feel born again\nI'm in the buildin' like the audience\nJust lightin' up my\n\n[Hook]", "image": "https://images.genius.com/58abe7b35759cd5e876b36af76e0b072.400x400x1.jpg"}], "artist": "Lil Wayne"}