{"songs": [{"title": "Rewind", "album": "Stillmatic", "year": "2001-12-18", "lyrics": "[Verse]\nListen up, gangstas and honies with your hair done\nPull up a chair, hon', and put it in the air, son\nDog—whatever they call you—God, just listen\nI spit a story backwards—it starts at the endin'\nThe bullet goes back in the gun\nThe bullet holes close in the chest of this nigga\nNow he back to square one, screamin', \"shoot don't please\"\nI put my fifth back on my hip, it's like a VCR rewindin' a hit\nHe put his hands back on his bitch, my caravan doors open up\nI jumped back in the van and closed it shut\nGoin' reverse, slowly prepared\nMy nigga Jungle utters out somethin' crazy like, \"go he there\"\nSittin' in back of this chair, we hittin' the roach\nThe smoke goes back in the blunt\nThe blunt gets bigger in growth\nJungle unrolls it, put his weed back in the jar\nThe blunt turns back into a cigar\nWe listen to Stevie, it sounded like heavy metal fans\nSpinnin' records backwards of AC/DC\nI give my niggas dap, jump out the van, back first\nBack upstairs, took off the black shirt\nI'm in the crib with the phone to my ear\nListen up so y'all can figure out the poem real clear\nThe voice on the phone was like, \"outside right we\"\nSo with my mouth wide, holdin' my heat\nBullets I had plenty to squeeze, plenty for you\n'Cause Jungle said, \"block your on enemy's the\"\nHung up the phone, then the phone rang\nI'm laid in the bed, thinkin' about this pretty young thing\nWho left, she came back, her clothes just fell to the rug\nShe fell to my bed and gave me a hug\nI told her, \"no hell,\" she talkin' about, \"me kiss\"\nBobbed her head then spit a nut back in my dick\nStarted suckin' with no hands, a whole lot of spit\nThen got up and put her bra back on her tits\nGot fully dressed and told me, \"stressed really I'm\"\nPicked up her Gucci bag and left a nigga behind\nWalkin' through the door, she rang the bell twice\nI vomited vodka back in my glass with juice and ice\nThe clock went back from three to two to one\nAnd that's about the time the story begun\nThat's when I first heard the voicemail on the cell\nIt said: \"Son, we found that nigga we gotta kill.\"\n\n[Outro]\n*Beep*\nAyo son, ayo son, you hear me, you hear me?\nListen, man, this dude right on the block\nRight now, man, I found him, right now\nI see him right now, let's kill him!\n*Beep*\n\"Yo, this Nas, leave it: peace.\"", "image": "https://images.genius.com/b568e8d559c7ba98ef485809d81c1d79.1000x1000x1.jpg"}], "artist": "Nas"}