{"songs": [{"title": "I Need Chickens", "album": null, "year": null, "lyrics": "[Intro]\nYeah, yeah\n(Mike WiLL Made-It)\nI got Mike Willie in this muhfucka, nigga, you know what I'm sayin'?\n(Ear Drummers)\nWe just gon' go all the way to the top with it, we ain't gon' turn around, nigga\nNo matter how it go, we goin' up\nYou dig what I'm sayin'?\n[?], what it do, nigga? You dig?\nHey, hey, hey, hey, hey!\n\n[Chorus]\nI buy Rollies in LA worth a milli'\nShe runnin' low and she need it, I know she with it\nI keep my bankrolls, I don't treat her like she kidney\nHome of the Falcons, no football, I need them chickens\nBae, I need chickens (Brrr)\nMama, I need chickens (Brr-brrr)\nI need some chickens (Brr-brr-brrr)\n\n[Verse 1]\nBae asked if I was hungry, only if you stop and get it\nDiamonds pinker than a pony, running with twenty-six chickens\nI'ma stunt on my neighbors, kids seen me on cable\nThick drink, purple maple, I could've went and bought some acres\nPull up swaggin', no blazer, cookin' dope with a apron\nGive the number to the pager\nNo, no, captain, we don't save 'em\nDraw down with the pistol then erase 'em\nNigga so hot, he need a fan...tasia\nI need a brown ho like a baby\nHey, I'm a hated baby with rabies\nI ain't talkin' to the boxer when I say A.B\nAyy, she gon' open up and then drink me\nHey\n\n[Chorus]\nI buy Rollies in LA worth a milli'\nShe runnin' low and she need it, I know she with it\nI keep my bankrolls, I don't treat her like she kidney\nHome of the Falcons, no football, I need them chickens\nBae, I need chickens (Brrr)\nMama, I need chickens (Brr-brrr)\nI need some chickens (Brr-brr-brrr)\n\n[Verse 2]\nPlug, plug, putting them birds in the box\nPutting them birds in the truck\nAy, stuff that lil' muhfucka down, stuff that lil' bitch to the ground\nAy, when I pull up to the town, know that I got myself pounds\nRounds, I'm gonna gun his ass down, fuck all your hoes in one round\nBrrr, brrr, brrr, brrr, brrr, brrr\nAyy, I'ma pull up high like I took a shroom\nAyy, bitch, I'm super fly like a witch with a broom\nAyy, Thugger Harry Potter fly, boming soon\nMy nigga just walked in like he in this bitch, no snitch\nWe leaved him in a ditch, tampered with, you dig?\nTake his bitch, you dig? Fuck his kids, you dig?\nShoot his wig, you dig? I know it\n\n[Chorus]\nI buy Rollies in LA worth a milli'\nShe runnin' low and she need it, I know she with it\nI keep my bankrolls, I don't treat her like she kidney\nHome of the Falcons, no football, I need them chickens\nBae, I need chickens (Brrr)\nMama, I need chickens (Brr-brrr)\nI need some chickens (Brr-brr-brrr)", "image": "https://images.genius.com/717461618e785def35d07de6484b7ad4.1000x1000x1.png"}], "artist": "Young Thug"}