{"songs": [{"title": "The Jig Is Up (Dump’n)", "album": null, "year": "2012-10-20", "lyrics": "[Intro]\nPraise to the almighty, HiiiPower\nMe and my niggas (Live forever)\n3 eyes to my alumni\nFeel this\nI wanna hear it, turn me up (My niggas on point, game tight)\nTurn me up a little bit more nigga (My niggas on point, game tight)\nMy nigga Cole in this motherfucker. Wassup nigga?\n(My niggas on point, game tight)\nThere we go yeah, turn me up\n\n[Verse 1: Kendrick Lamar]\nPicture plenty pussies throwing pellet guns at me\nParanoia make it more than difficult for me to sleep\nPinnacle, I know I be, centerfold, I know I got\nBut they hate to frame me as the Mona Lisa of Hip-Hop\nSo retaliation is a must, when we bend the block\nMy niggas dump'n out the roof, (Do-do-do-do-do)\nDrive past, guns blast, shooting up the charts too\nUh, me K-D-O-T, put TNT inside my suit\nWalk inside the label, struck a match, and then I blew, bomb\nC4 everywhere, C4 everywhere\nI got three whores with me, it smells like Dior and derrière\nDecoys die slow, you can detour to Heaven's stairs\nOr walk inside Hell's dungeon, I just might derail something\nThey pussies, I smell something\nYou douche on the daily, niggas, you pushin' up daisy\nI push the gas on the Mercedes, nigga\nCame in this game with a Rolie chain, and a dream\nBecame reality, made some casualties, my choppers scream\n\n[Chorus: Kendrick Lamar]\nAnd now we dump'n out the roof, (Do-do-do-do-do)\nDrive past, guns blast, shooting up the charts too\nUh, me K-D-O-T, put T-N-T inside my suit\nUh, walk inside the label, struck a match and then I blew\nAnd now we dump'n out the roof, (Do-do-do-do-do)\nDrive past, guns blast, shooting up the charts too\nUh, me K-D-O-T, put T-N-T inside my suit\nUh, walk inside the label, struck a match and then I blew\n\n[Verse 2: Kendrick Lamar]\nNigga that thought Good Kid gon' flop, or that I might go pop\nOr your bitch won't drop, knees when my shit drop\nY'all too infatuated with the fucking numbers\nWhich make it easy for me to divide and conquer\nI come from Compton, we ain't have it all\nSmokers basing inside the cafeteria hall\nAnd I'm putting fear in you all, see your skeletons shaking\nJump out your body, you Ricky Bobby until you naked\nY'all pray to God this week I be putting out bombs\nI pray to God this beat is good enough for Shyne\nIf not J. Cole, your shit is trash\nBut at least my opinion just made everyone laugh\nThis is where we at? I guess it's entertainment\nI guess this is speculation making a classic came with\nIf I ain't have the patience I'd probably self destruct\nReal people want real music, the jig is up\n\n[Bridge: Kendrick Lamar & J. Cole]\nYour worst fear is confirmed\nWe love that you crashed and burned\nThe real is back\nK. Dot it's your turn, take your victory lap\nKing Cole salutin' Compton's own King Kendrick\nThats the sky is falling, the wind is calling\nStand for something or die in the morning\nThe city hail King Kendrick Lamar\nThe world hail King Kendrick Lamar\n\n[Chorus: Kendrick Lamar]\nAnd now we dump'n out the roof, (Do-do-do-do-do)\nDrive past, guns blast, shooting up the charts too\nUh, me K-D-O-T, put T-N-T inside my suit\nUh, walk inside the label, struck a match and then I blew\nAnd now we dump'n out the roof, (Do-do-do-do-do)\nDrive past, guns blast, shooting up the charts too\nUh, me K-D-O-T, put T-N-T inside my suit\nUh, walk inside the label, struck a match and then I blew\n\n[Verse 3: Kendrick Lamar]\nThis is my life and I look at it like its my last\nAnd I'm lookin' right past the future as I reminisce on my past\nAnd I don't even think how I used to, my mind is on rocket blast\nAnd I don't even drink like I used too, and I don't even smoke\nSo you know this natural flow is for users that want to go to rehab\nLookin' at the coke that he had, matter fact that followers bother them\nThen but I won't say my bad, see I just lay in the cut\nWatch the product stack up, motherfucker what what\nSee now we dump'n out the roof", "image": "https://images.rapgenius.com/eb05f014da9ccbfee897c3b7ab9c5a3d.900x600x1.jpg"}], "artist": "Kendrick Lamar"}