{"songs": [{"title": "Hip Hop", "album": "Death is Certain", "year": "2003-11-22", "lyrics": "[Chorus]\nI know my streets, I know my sounds\nY'all know my beats, how I get down\nI take my steps, and leaps and bounds\nNigga it's hip hop\n\n[Verse 1]\nYeah, yeah, we started from nothing a couple MCs\nBeat-boxin', the crowd in the lunch room\nMe and Preem, both names go together\nLike they ain't supposed to be separate like D&D\nI said it before, I rep in records beats\nAt the HeadQCourterz, rest in peace\nNigga I'mma hold shotty, and knock you out\nAnd I ain't gotta know karate like Afu-Ra\nIt's hip hop, strong or not\nThis is rap basketball, stats all you got\nLong as you hot, and your flow can hold up\nTo knowing that all of your short goals is long shots!\nNinety percent of you niggas ain't hard\nHere just to get a rep, you not Gang Starrs\nThe finest flow will amaze\nRap without me is The Source minus the quotable page\n\n[Chorus]\nHip hop is everything around you\nNo competition\nBack to the voice of today\nIt's real in the field\nWhat's realer than hip hop?\nI know my streets, I know my sound\nY'all know my beats, how I get down\nI take my steps, and leaps and bounds, nigga it's hip hop\n\n[Verse 2]\nRhythmically come on with it, I'm long-winded\nI will diss you from long distances\nYou will not get the chance like Choppa\nNess and Dylan to disrespect, who you don't listen to\nEgg in the skillet brain, nigga, this is you\nSmarten up, every person in the Earth\nBe hardened up but the only target is us\nIt's hip hop, cars and trucks\nI be dreaming about shit like having a hard time swinging\nOn a nigga or squeezing a trigger or falling\nIf I land I won't wake up\nMy six shot model, ya crew\nI'm leavin' ya momma faces blue like a Hpnotiq bottle\nThey feel you the realer you spit, this killer shit is hearin' us\nHealin' you if you ill or you sick mentally, it's\n\n[Chorus]\nHip hop is everything around you\nGotta be something for me to write this\nBack to the voice of today\nNo talent rappers\nWhat's realer than hip hop?\nI know my streets, I know my sounds\nY'all know my beats, how I get down\nI take my steps, and leaps and bounds\nNigga it's hip hop!\n\n[Verse 3]\nMore venom, 5’9” is like a G5\nIllest lyrics is stored in him\nChorus is killing, any warrior feeling\nThat I ain't God - Lord willing\nTrust me after I crush ya building\nYou will just hush, you won't restore the village\nWe look toward with killing, real\nThough this album is mor-bidly feeling it's still\nHip hop! Fuck your feelings\nMore rappers dying, much more killing\nIt's no feeling realer than gambling ya life\nEveryday, and waking up to more dealings\nFourteen killings compared to offshore millions\nEquals I got a lot more villians\nYou know that you easily lose, you be on MTV News\nFor the first time, because you died over\n\n[Chorus]\nHip hop is everything around you\nCome alive y'all\nBack to the voice of today\nIt's all in the game\nWhat's realer than hip hop?\nI know my streets, I know my sounds\nY'all know my beats, how I get down\nI take my steps, and leaps and bounds\nNigga it's hip hop!", "image": "https://images.genius.com/2e15d971471dc5a14cf09f1d638b3456.1000x1000x1.jpg"}], "artist": "Royce da 5'9'’"}