{"songs": [{"title": "Workout Plan (Live at Abbey Road Studios)", "album": "Late Orchestration", "year": "2006-04-24", "lyrics": "[Verse 1: Kanye West]\nLet's go!\nOne, and two, and three, and four, and get them sit-ups right, and\nTuck your tummy tight and do your crunches like this\nGive–, stop, breathe, get up, check your weave\nDon't drop the blunt and disrespect the weed\nPick up your son and don't disrespect your seed\nIt's a party tonight and ooh, she's so excited\nTell me who's invited: you, your friends and–\nUh, what's scary to me\nHenny makes girls look like Halle Berry to me\nSo excuse me miss, I forgot your name\nThank you, God bless you, good night, I came\nI came, I came, I came\n\n[Chorus: Kanye West]\nNow, it's been a week without me\nAnd she feel weak without me\nShe wanna talk it out but\nAin't nothin' to talk about\nUnless she's talkin' 'bout freakin' out\nBaby, we can work it out\nC'mon, work it out, let me hear you say, work it out\nLet me hear you say (Work it out)\nI gotta hear you say (Work it out now)\nYeah, yeah, yeah, yeah, say what? (Maybe we can work it out)\n\n[Verse 2: Kanye West]\nOoh, girl, your silhouette make me wanna light a cigarette\nMy name Kanye from the Jigga set, Twista said, \"Get It Wet\"\nOoh, girl, your breath is harsh\nCover your mouth up like you got SARS\nOff them tracks, yeah, I bought them cars\nStill kill a nigga on 16 (Bars)\nWe ain't sweating to the oldies, we juking to a cold beat\nMaybe one day, girl, we can bone\nSo you can brag to all your homies (Now)\nBut I still mess with a big girl, if you ain't fit, girl, I'll still hit it, girl\nOne and, you brought two friends\nOkay, three more, now hop in the Benz\nFour-door: do y'all know the difference between a five, six– uh\nSay, all the mocha lattes, you gotta do Pilates\nYou gotta pop this tape in 'fore you start back datin'\nHustlers, gangstas, all us ballers, uh\n\n[Chorus: Kanye West]\nIt's been a week without me\nAnd she feel weak without me\nShe wanna talk it out but\nAin't nothin' to talk about\nUnless she talkin' 'bout freakin' out\nThen maybe we can work it out\nC'mon, work it out, let me hear you say (Work it out)\nI need to hear you say (Work it out)\nI gotta hear you say (Work it out now)\nYeah, yeah, yeah, yeah, say what? (Maybe we can work it out)", "image": "https://images.genius.com/664fe2cf167d887dd94ca2859078fb37.640x640x1.jpg"}], "artist": "Kanye West"}