{"songs": [{"title": "The Uppercut", "album": "Loyal to the Game", "year": "2004-12-12", "lyrics": "[Intro: 2Pac Talking]\nI wanted to bring back that reality\nBut nobody can ever be confused and think I'm fuckin Mike Tyson\nAnd I'm the heavyweight champion, I'm a little nigga\nThat's why its so raw to just watch me battle lions\nCause I'm a little skinny nigga battlin' niggas three times my size\n\nWatch this uppercut, here it comes..\nWatch the jab nigga...ugh...here it come\nLook out, watch my arms..\n\n[Verse 1: 2Pac]\nNow see so many motherfuckers wanna take a piece\nCommin' equipped with some shit that niggas just can't believe\nI pull a trick from my sleeve now kamikaze\nI'm all over that nigga, come identify the body\nMy middle finger to you ho niggas\nRun up on me and I'll be forced to let it go nigga\nI ain't the one you wanna try, why? Stayin' high\nI hit this blunt and watch these motherfuckers die\nWhose runnin these streets I said that cocaine\nCause in the dope game, niggas'll die 'fore they go broke mayne\nAnother hustler makin' major cash\n'til the punk police come an raid ya ass\nNow you stressed doin' fed time\nAnd its a bitch cause the judge gave you 8 years\nYou doin 6 and we know that you can't hang\nYou a trick rolled over turned snitch like a bitch\n\n[Chorus: 2Pac]\nNow you know you should have ducked nigga\nGotchu fallin from the uppercut, fucked, so what's up? nigga!\nNow you know you should have ducked nigga\nGotchu fallin' from this uppercut, stuck, so what's up? nigga!\n\n[Verse 2: 2Pac]\nThey got a nigga in the dice game\nI'm feelin' lucky but the nigga just a little bigger\nHe tryin fuck me out my cash, I'ma blast nigga\nHe don't know I gotta tell ya like the last nigga\nGotta go don't need to roll for the truck, I get 'em up\nLeft to right, my uppercut'll hit 'em up\nI'm known to walk the streets on any block\nI love my niggas, but I ain't puttin down my Glock\nThe gun shots rang when I lose nigga, and ooh nigga\nI'ma show you not to ever play a true nigga (haha)\nLay it down just to prove it\nAnd fuck the rappin motherfucker we can do this\n\n[Chorus: 2Pac]\nNow you know you should have ducked nigga\nGotchu fallin from the uppercut, fucked, so what's up? nigga!\nNow you know you should have ducked nigga\nGotchu fallin' from this uppercut, stuck, so what's up? nigga!\n\n[Verse 3: E.D.I. and Young Noble of the Outlawz]\nThey claim that we violent, we named after tyrants\nThis revolution won't be televised, we keep it silent\nRoll on our enemies, beat 'em at they own game\nMolotov cocktails, releasing up in flames\nTired of bein' stepped on, sick of bein' held back\nLookin' through my rear view, thinkin' bout the pay back\nWanna see my kids grow don't know if I'ma make it though\nOne more nigga came up short in the ghetto\nSociety lied to me so I'm strapped with the metal\nPush ya middle finger up nigga if you a rebel\nHave ya face down goin' in ya pockets if ya let em'\nI done lost too many homies for me to ever forget em'\nI done made so many mistakes but still I don't regret em'\nI'm a product of the pimp, the pusher, and the reverend\nI'm a product of the block, the fiends and the felons\nWe all lost souls tryna find our way to heaven\n\n[Chorus: 2Pac]\nNow you know you should have ducked nigga\nGotchu fallin from the uppercut, fucked, so what's up? nigga!\nNow you know you should have ducked nigga\nGotchu fallin' from this uppercut, stuck, so what's up? nigga!\n\n[Outro: E.D.I. Talking]\nTo all the comrads no longer with us, see you when we get there\n'Pac, Yak, we gon' keep on ridin', give these cowards the uppercut\n'Til we get up there with y'all, YOU KNOW!\nThug Life we still livin it\nOutlaw for life, in the name of the Don, let's go!", "image": "https://images.genius.com/aff64f752ccfff1d48590e5db3c0357a.300x300x1.jpg"}], "artist": "2Pac"}