{"songs": [{"title": "Diary of a Madman", "album": "Mr. Scarface is Back", "year": "1991-10-03", "lyrics": "(Scarface talking)\n\nYo anybody seen my diary? Oh there it is\nI gotta write this shit down. Check it out\n\nDear Diary, I'm having a little problem\nI can't make it by myself maybe you can help me solve em\nI'm confused and I don't know what to do\nI'm hoping you can help me cause there's no one else to talk to\nI want to die, but it ain't for me\nI try to talk to my dad, but my old man ignores me\nHe says I'm delirious\nAnd I drink too much, so he doesn't take me serious\nBut little does he know I'm really losing it\nI got a head, but ain't no screws in it\nI be thinking deep\nThat's one of the reasons at night I can't sleep\nI thought it would change when I was older\nBut even now I'm still peeping over my shoulder\nIs there life after death too?\nAnd what about the nigga with the cane and the black suit?\nAnd what about cancer?\nToo many motherfucking questions, and not enough answers\nAin't no use in trying\nWe might as well face it we were all born dying\nThere's a black book in Brad's hands\nAnd its the diary of a madman\n\nDear diary today I hit a nigga with the torch\nShot him in his face and watched him die on his front porch\nLeft his family heartbroken\nFlashbacks of him laying there bleeding with his eyes open\nI can't put the shit behind me\nI'm know I'm here somewhere, but I can't find me\nI used to be a drug dealer\nOn the fo rilla, but now I'm a born killer\nAnd it ain't no changing me\nIt used to be hard, but now it ain't no thing to me\nTo go up to a nigga's house\nPut a pistol in his mouth, and blow his fucking brains out\nNo doubt if you cross then I'mma take ya\nCause I'm a fucking killer by nature\nYou got an M11, bring your weapon\nHuh, I got an AK-47\nIt's gonna be a bloody Sunday\nCause your fucking with a nigga like Bundy\nAnd I was taught not to care\nLike a Vietnam vet with a thousand yard stare\nSo welcome to the slaughterhouse nigga\nRedrum and I'mma be the grave digger\nAnd if you want to cap, come cap me\nI'm trigger happy like my great-grandpappy\nJust watch for the chrome in my right hand\nMy second entry from the diary of a madman\n\nDear diary, help me cause I'm frantic\nSometimes I think I'm going schizophrenic\nThe world's looking dark for instance\nMaybe cause I'm looking from a distance\nBut then again I wear a blindfold\nStaring at the motherfuckin world with my eyes closed\nTo myself I'm a stranger\nWalking in the footsteps of danger\nIt's a long path ahead of me\nI gotta get somewhere cause everybody here is scared of me\nI had a job but they fired me\nMy wife walked off now I'm living in my diary", "image": "https://images.genius.com/bfc55f1e39dab482dd5f87425202cda6.453x450x1.jpg"}], "artist": "Scarface"}