{"songs": [{"title": "All I Wanna Do", "album": "Build and Destroy", "year": null, "lyrics": "[Intro]\nWhat wh-wh-what what what, nigga {​7X}​\nYo.. c'mon with it nigga\nThis for my nigga right here, strictly for my niggas\nWhat, turn it up, turn the.. turn the level up\n\n[Hook: Royce Da 5'9\"]\nAll we wanna do is make money\nThat's all that we wanna do\nLong as y'all niggas don't fuck with us\nThen my crew don't fuck with you (feel me, nigga bounce)\nAll we wanna do is make money\nThat's all that we wanna do\nY'all niggas, if you think about fuckin with us\nThen my crew gon' fuck with you\n\n[Royce Da 5'9\"]\nYo, yo, yo.. how many niggas wanna be\nOn the receivin end of a bullet; thugs, keepin it real\nStay heated with steel, I can see dude that you killed\nAnd watch me flee to Brazil\nYou don't wanna make nothin of this\nNaw, I ain't nothin to this, ain't nothin to spit\nFuckin with me gets you nothin but hit\nOpenin up clutchin the fifth, somethin just niggas must admit\n5'9\" nigga with game, knowin all enemy names\nSendin ten at the same shots through ten in your Range\nInto your brain, hearing at the end of your reign\nUhh, ain't shit sweet\nAll y'all niggas gon' know when I finish\nThat I can get when I put my mind to it\nAnd all y'all niggas gon' know when I finish\nThat I can get when I put my nine to it\nI'm here to get the goods in mass amounts\nGive it back to the hood, pass it out\nGet a brand new house, cash it out\nGot a problem with it nigga? We can blast it out\nYou hate this, runnin through holes like shoelaces\nHere to make a statement\nEven if it means puttin you under the pavement\nDrop while I'm foamin at the mouth for dough, money I taste it\nEverybody gotta have a heart as core\nAnd it seems that it's always yours\nBut it never drip-drops in a storm\nWhen it rains it'll always pour (what?)\nY'all niggas know the deally wit me\nAll y'all niggas sound silly to me\nAnd I gotta believe, if you ain't feelin me\nThat you gotta be harder to please to feel it to me\nFeel this, nigga bounce\n\n[Hook] - 2X w/ ad libs\n\n[Royce Da 5'9\"]\nWhat, what? We tryna take over the world\nAny nigga with ears that can hear or comprehend\nAin't one nigga livin I'm scared of\nAll my niggas'll be jumpin in\nAnd for any nigga thinkin that he out of his shit\nSnatched out of his whip\nFed to the dogs, get an ultimatum or pick\nAs to what he wanna get hit by - the rott or the pitt\nUp in the 'burbs, chillin with nothin but birds\nWe cash checks on the third\nAnd when I say that I'm out for the green\nYou know a nigga mean every aspect of the word\n(Yeah) Walk the street\nIt's a nigga that stalk you, chatterin your teeth\nRunnin your mouth until I pull out with the heat\nTellin you that talk is cheap\nAnd it'll cost you true King of the king\nNigga with more beef than a war chief you can't defeat nor beat\nSmile at the sight of a thug, then I go right for the blood\nThis nigga thought he was cold so I hit him with more heat\n(Blaow!) Niggas don't even deserve to breathe\nHow the fuck is you servin me?\nI'm the nigga with the pump ready to dump all nine shots\nUntil your body turn burgundy - want war nigga?\nYou don't wanna fuck with this, what's all of this\nYou might as well un-ball your fist\nYou think the real niggas fight with fists?\nLet me be the first to tell you that it's all a myth\nI ain't playin with y'all niggas, it ain't a game\nReal niggas recognize the real\nSo when I aim, I aim to hit\nAnd I came to spit shit you feel\nFeel this (feel me)\n\n[Hook] - 2X w/ ad libs\n\n[Outro]\nWhat wh-wh-what what what, nigga {​15X}​\nWhat, nigga, what, nigga\nWhat wh-wh-what what what, nigga!", "image": "https://images.genius.com/d86b45b993cdf0c53559e740521a4bba.500x494x1.jpg"}], "artist": "Royce da 5'9'’"}