{"songs": [{"title": "Writer’s Block", "album": "Success Is Certain", "year": "2011-03-29", "lyrics": "[Intro: Eminem]\nYeah! I don’t know what else to say\nI can’t, I can’t think of nothin'\nI’m stumped, here we go!\nOn your feet! Stand up! Everybody hands up!\nUh, man, I don't know man\nEvery time I go to think of something played out to say\nYou already said it\n\n[Verse 1: Royce da 5’9”]\nI ain't callin' names 'cause all of y'all the same\nPlus I'm the king, all my past pain all done changed up\nAll these plains, all these lames, since the Slaughter's came up\n'Cause they know their hands tied, feet ball and chained up\nNiggas be quick to call me the new 50 Cent\nBecause of my relationship with Marshall\nUsed to make me a little partial, but here's the brain fuck\nWe the same, 'cause\nI'm probably 'bout to fall out with a young buck\nWhile I attempt to fuck the fuckin' game up\nBitch, splat! Only thing I fear in here is chit-chat\nYou are hearin' bars like your ear against a Kit Kat\nShady guys like the Navy, try us, wavey bye-bye\nMaybe my Glock can turn your top to Baby's Maybach\nMy shit is parvo, literally sick\nTrust me, nigga, it's ugly to kill; the thing is, the bigger I get\nThe more disgustin' and fuckin' disfigured it gets\nNiggas expect me to go pop, oh, stop\nY'all about the Champagne, I'm about the toast, I\nOnly fuck with mailmen with heroin from Boca\nNiggas that'll smoke you while you starin' in your postbox\nOnly incense he enlightens when he's thinkin'\nWhile that sinks in, I got a Brinks ink pen\nI'm back! Motherfucker, notice the flyness on the cover\nOf the XXL, I'm back from the dead\nLike Tobey Maguire from the Brothers\nHow y'all realer? If I said it, I did it\nIf I didn't, I seen it first-hand like a card dealer\nGive up the throne: your lease up; I am the Mona Lisa\nThat decoded Da Vinci Code, you throwin' your piece up\nIs a waste of fake like a phony B-cup\nMakin' the mistake was like my only teacher\nWait 'til they get a load of me, 'cause—\n\n[Chorus: Royce da 5’9”]\nI've got Guccis on my feet, diamonds on my neck\nDiamonds on my wrist, bitches on my dick\nBut y'all already said that\nChoppers in the trunk, models in the front\nBottles in the club, but I don't give a fuck\nBut y'all already said that\n\n[Bridge: Eminem]\n'Cause sometimes I feel like it's so hard for me\nTo come up with shit to say, ayy\nI'm at a loss for words, 'cause y'all already said it all\nI think I'm runnin' outta clichés\nI'm gettin' writers block, psyche!\n\n[Verse 2: Royce da 5’9”]\nWhen I stand up in this booth, niggas notice it\nSittin' on the same boat that Noah built\nFloatin' on the same water Moses split\nPoetry in motion, but we sittin' on your grave site: overkill\nAren't you tired? Why are you so loud? Quiet\nReal dudes move in silence, like a mute drivin' a new hybrid\nYou dudes is too excited\nYou a dude that'd try to sue a dude that's suicidal\nYou will just be another victim\nI'm like a nickel of weed rolled in a doobie: I'm a little twisted\nI roll like the end credits in movies, y'all just got scripted\nGot y'all niggas' bitches bobbin' to this one when she wit' ya\nWhen she with me, she bobbin', not vibin'\nTryna put her mind into the inside of my zipper\nI'm a serpent with a purpose\nHavin' problems? Not a problem\nI've encountered, I have found elephants, lions, clowns\nWill jump through hoops like they workin' for the circus\nIf the fire 'round the circle's right in front of them, fire rounds\nPun intended, gun extended, what are you marks askin'?\nCar's Aston, started as a hard-top and I saw past it\nSince I decided to start class, this all black, all glass\nPanoramic roof been gettin' marked absent\nI authorize my own all-access\nYour bitch a whore, I'm a catch, she ball-catchin'\nHer jaw's been broadcasted\nAll across the globe from the store to Japan\nHer pussy need to be blocked and reported as spam\nInterscope, I been this dope\nNow sell it, my voicemail is full\nGot bitches screamin' inside of envelopes\nAnd they tryna mail ‘em to me\nTryna reach my phone, I don't know which one is harder:\nTryin' not to take your bitch or tryna get rid of my own\n\n[Chorus: Royce da 5’9”]\nI've got Guccis on my feet, diamonds on my neck\nDiamonds on my wrist, bitches on my dick\nBut y'all already said that\nChoppers in the trunk, models in the front\nBottles in the club, but I don't give a fuck\nBut y'all already said that\n\n[Bridge: Eminem]\n'Cause sometimes I feel like it's so hard for me\nTo come up with shit to say, ayy\nI'm at a loss for words, 'cause y'all already said it all\nI think I'm runnin' outta clichés\nI'm gettin' writers block, psyche!\n\n[Outro: Eminem]\nMan, get the bozac!\nWe need to start bringin' that shit back (Mad flava!)\nMan, fuck it, I'm 'bout to catch some wreck\n(We in effect, money!)\nMad props to Royce for keepin' it real\nOn the strength, no diggity\nI'm 'bout to go pull some hoes, get my mack on\nHaters get the gas face!", "image": "https://images.genius.com/c8c0f6675936ef6d5411281c804e89e6.800x800x1.jpg"}], "artist": "Royce da 5'9'’"}