{"songs": [{"title": "Premeditated Murder", "album": "Friday Night Lights", "year": "2010-11-12", "lyrics": "[Verse 1]\nAm I changing right before your eyes?\nBecoming someone you don't recognize\nAs if I was disguised, I'm on that shit as if I was the flies\nI'm touching skies, no puffing lye\nMan these songs that I made in my bedroom and shit\nGoin' finally give a nigga leg room in the whip\nFrom a Civic to a seven must've died and went to heaven\nLike a passenger on 9/11, please go find a reverend\nYou see I promised that I'd never change\nBut that was way before I made the dough and met the game\nSay hello to Miss Thang, I forgot yo name, she yellow\nAnd even white women want a nigga, Othello\nI'm balling with nuggets, like fuck it I'm Carmelo\nNow the crib got much rooms, Portobello\nShe drop it low and then she bust moves for the fellow\nI sit your ass down like you was playing a cello\nSee, you niggas hated and I levitated further\nKnew I would kill the game, premeditated murder\nSo if it comes down, may the best man win\nNo sweat like a headband in\n\n[Chorus]\nWhere I'm from, if you ever seen what I seen\nYou know it can't get no better for me\nNo it can't get no better for me\nWhere I'm from, if you ever seen what I seen\nYou know it can't get no better for me\nNo it can't get no better for me\n\n[Verse 2]\nI'ma kill the game and invite witnesses\nNo death penalty, I'm giving life sentences\nLike keep grinding boy, your life can change in one year\nAnd even when it's dark out, the sun is shining somewhere\nYeah, look here I paid dues\nMy own worst enemy so fuck it either way I can't lose\n808's so my south niggas feel me\nLight-skinned so the house niggas feel me\nShe catch me creeping out your house she'll kill me\nIs it worth for what's under that blouse?\nMy heart'll turn pitch black and cold if I split with my girl\nIf I could gift-wrap the globe, I would give you the world\nBut, do you love me like you used to?\nEven though I ain't that nigga that you're used to\nRemember back when I was broke, you would fix me\nDo you prefer the broke me or the rich me\nThe broke me couldn't buy you meals, not even a value meal\nAnd now I pay for everything, how you feel?\nMixed feelings cause now all the chicks feeling him\nYou gotta adapt though I'm never going back\n\n[Chorus]\nWhere I'm from, if you ever seen what I seen\nYou know it can't get no better for me\nNo it can't get no better for me\nWhere I'm from, if you ever seen what I seen\nYou know it can't get no better for me\nNo it can't get no better for me\n\n[Outro]\nI can't keep running away\nI can't keep running away\nI swear I'm coming back one day\nWhat if I'm wrong\nAnd I ain't got what it takes\nThen all them people that was counting on me\nBoy won't you climb down the mountain for me", "image": "https://images.genius.com/ae722fa8fa10d75fe4b25dfeb4b8d8d6.1000x1000x1.jpg"}], "artist": "J. Cole"}