{"songs": [{"title": "Life of Mr. Carter", "album": "Tha Carter V (2014 Version)", "year": "2019-09-13", "lyrics": "[Intro: Lil Wayne]\nUh\n\n[Chorus: Lil Wayne]\nWhat's harder? Life or Mr. Carter?\nBalling 'til my hair is as white as Johnny Carson\nYou don't have to beg because I'm fresh out of pardons\nLittle voices in my head said, \"Don't mind the little voices\" (Woah)\nWhat's sharper? Spikes or Mr. Carter\nI ride for this shit like a knight in shining armor\nI pile up the swishers, roll 'em tight like Under Armor\nComing from this neighborhood, it's just like coming from comas\nI got-\nWhat's harder? Life or Mr. Carter\nBalling 'til my hair is as white as Johnny Carson\nYou don't have to beg because I'm fresh out of pardons\nLittle voices in my head said, \"Don't mind the little voices\" (Woah)\nWhat's sharper? Spikes or Mr. Carter\nI ride for this shit like a knight in shining armor\nI pile up the swishers, roll 'em tight like Under Armor\nComing from this neighborhood, it's just like coming from comas\n\n[Verse 1: Lil Wayne]\nI got homies from the old school and we been lost our diplomas\nGot some hoes from California and they shit smell like begonia's\nGot a bone to pick, I'm boneless, that's a bonus\nTim Duncan, Tony Parker, pop up at the spur of the moment\nHow you want it?\nWhen in Hell, I'm a Roman\nHead on fire, I'm a comet, heat up out my abdomen\nAnd you know it, man I'm all about my business\nBusiness handle business for me\nI know you know life's a bitch, I turned her to a business woman\nMind your business, I'm like-\n\n[Bridge: Lil Wayne]\nWhat's harder? Life or Mr. Carter?\nWhat's higher? The price or Mr. Carter?\nShould I call you Mystery 'cause I'm right here to solve you\nIf you start this here off right, I spray that on you\nI made it, I made it with you\nYou hit it, I made it on you\nYou know the streets talk, my nigga, I made 'em argue\nNiggas faded away, I light one and get faded for you\nI'm reclining Weezy Baby, lazy boy do they enjoy you?\nI'm like-\n\n[Refrain: Lil Wayne]\nWhat's harder? Life or Mr. Carter? (Yeah, uh)\nWhat's shorter? Life or Mr. Carter? (Ha)\nI asked, \"What's harder? Jail or Mr. Carter?\"\nSchool or Mr. Carter?\nRules or Mr. Carter?\nMan, \"What's harder? Drugs or Mr. Carter?\"\nJudge or Mr. Carter?\nMr. Carter, huh?\n\n[Verse 2: Lil Wayne]\nWhat's harder? Love or Mr. Carter\nEspecially when these hoes ain't right, these hoes ain't loyal\nShit, what's wrong or right? And what's the order?\nI know this AK will get shit right and fix the toilet\nI'll be a-okay as long as my wife could cook a quarter\nThe type of shit I won't take for granted, need the marble\nSee, you can't believe in all of the hype you hear at the barber\nIf the odds are stacked against us, they're likely to stack 'em on us\nLil Tune, aka no cartoon, no Hanna-Barbera\nI ain't steal it, I took it, I ain't crooked, I'm cat and cornered\nAnd if my fruits of labor were ripe, I would have an orchard\nBut I'm nauseous from my ups and downs and back and forwards\nShit, Mr. Carter, eyes are always on ya\nThrow a five in the air for C5 like, \"Hi, how are you?\"\nShit, what's harder? Drugs or Mr. Carter?\nThe world is on my shoulder, I shrug to get it off from shit\nWhat's harder? Life or Mr. Carter?\nTune in this bitch, let's spike the Holy Water\nTryna stay grounded, my flights said no departures\nShit, what's harder? Murder or abortion?\nWoah, what's harder? Death or Mr. Carter?\nIs it easier to play deaf or to listen harder?\nI'm like, \"Girl, what's harder than life for Mr. Carter?\"\nShit get hard, but I'ma termite to turmoil\nWas it easier to change diapers or back to normal?\nTimes are changing like Father Time just lost it's father\nWhat's harder? To ask for sorrow or to borrow\nOr to propose and get \"I don't know\"?\nI don't know\n\n[Outro: Christina Milian]\nWhat's harder than being Mrs. Carter?\nWhat's harder than being Mrs. Carter?\nWhat's harder than being Mrs. Carter?\nWhat's harder than being Mr. Carter?\nUh, what's harder than being Mr. Carter?\nWhat's harder than being Mr. Carter?\nWhat's harder than being Mr. Carter?\nWhat's harder than being Mr. Carter?\nMm-mm-mm-mm-mm", "image": "https://images.genius.com/393331d8cb04d4fa610bfd6df7df1c38.550x550x1.jpg"}], "artist": "Lil Wayne"}