{"songs": [{"title": "Do U", "album": "Digital Bullet", "year": "2001-08-28", "lyrics": "[Intro: RZA and Method Man]\nCome on my niggas, yo..\nPut your guns in your right hand and hold it down towards the floor\nPoint all your guns down towards the floor for a minute\nYeah, you could hold 'em, just point 'em down towards the floor\nFor a sec, aight? (Yo y'all ain't fuckin' wit the Wu)\nWe gon' splash like this, all my wild Digi heads\n(Y'all niggas is crook) Y'all niggas move a little up to the front\nY'all niggas know what I'm talkin' about\nWord up, my weedheads, y'all play the right for a second\nNahmean? Check it out\nAll y'all niggas on X, y'all keep y'all asses in the back\nAight? Straight up, in fact, matter of fact\nWe gon' mingle this shit like mothafuckin' peas in the mothafuckin' pot\nStraight up Digi Digi style, word up, as we splash you right\n(Yeah, yeah, my niggas is crew, now y'all ain't\nFuckin' wit the Wu\nOh now y'all.. come on!)\n\n[Verse 1: RZA]\nWalk wit a diddy bop ock, you silly pop, Jiffy Pop\nFuck around, son, I'll blow ya face up with fifty shots\nSharp darts, and it pop pop like tarts\nExtreme speed like Anakin inside the Pod\nHeaded for the finish line, BOODOO, watch Bobby cross it\nHoes with the diamonds on your toes, come on and floss it\nI be one of those tall skinny cats with the four-nine\nThree-eleven that rips through Power-U's and breaks spines\nI culture power-tuggin' boys who be drunk, buggin'\nLovin' loud noise from toys, club thuggin'\nSweet chocolate deluxe, rugged, sexy buttercup\nThat don't give a fuck about the cop in the club\nOr the bouncer with the flashlight, one walked passed, right?\nSome pulled the razor and chopped his ear like he was Mad Mike\nI played the cipher in the corner, teachin' math\nOne for one thoughts, a hundred brothers won't last\n\"Do U\"\nBecause you can't do me\n\"Do U\"\nBecause you can't do me\nCome on!\n\n[Verse 2: Prodigal]\nYo, son, Wake Up!\nYo, I gotta do this, man\nI gotta get this money, son\n\nFeatures in the crowd, appearance like, \"Black I'm proud\"\nIn the background, no sounds, four pound, we hold ground!\nBrooklyn bound, seven initials up in the crown\nOne man's ramblin', officials they shot him down\nSupreme, extreme, lean, killin' machines\nAll I wanna do is feed my seed, plus my team\nKeep it logical, no games, straight up about Prodigal\nDiabolic drums and I run from none\nTestimony one, give my life before my only son\nThelonious crumbs, why they wanna press me for guns?\nNow I'm in the face of the judge, court case thug\nFrom a race, laced, based on drugs, some made slugs\nAs it was written, stroll through any block forbidden\nGlock hidden, why they wanna stop precision?\nEighty-five percent of my brothers locked in prison\nAnd we just keep dyin' for the love of good livin'\nBut Do U! Do U! Do U!\n\n[Hook]\n\n[Verse 3: GZA]\nYou know those jams in the park, produced the spark\nMade me feel words how I read books in the dark\nI always took it to heart, loved the art\nA lifetime of darts, ripped crews apart\nMade their stay real short, I stamped the passport\nCouldn't bring through no wack shit of no sort\nI walked the borough challengin' the best that stood\nTorch metal mics, they conduct better than wood\nOnce I electrify and only expect to die\nRounded Bed-Stuy, ZZZZ, nigga fry\nMy opponent block, the beat comin' from his box\nInvestment ranker who's a joke in the stocks\nKeep a rhythmic pace, maintainin' great balance\nMovin' in steps of unheard of silence\nNormally progressioners, they're slow steepin'\nNiggas wanna light up when there's gas leakin'\n\n[Hook: RZA and sample]\n\"Do U feel?\"", "image": "https://images.genius.com/52be3befc1392598c2d27e30b8059858.500x500x1.jpg"}], "artist": "RZA"}