{"songs": [{"title": "Living Proof", "album": "Hell: The Sequel", "year": "2011-06-14", "lyrics": "[Intro: Royce Da 5'9\"]\nYeah, Bad and Evil is (back)\n(Don't stop)\n\n[Verse 1: Royce da 5'9\"]\nWe 'bout to get into a tale of a gunner that details the dungeon\nJust as the pale moon illuminates the hail and thunderin'\n'01's the year where I fell from blunderin'\nShady lifted his wing, then I fell from under it\nNow I’m freefallin’, my career is gone into re-calling\nRegardless of who’s fault, I was speedballin'\nGod bubble wrapped me and dropped me on top of the Earth\nThen Marshall doubled back and got me from on top of the Hearse\nI’m alive, nigga, Justin T ain’t got nothin' on me\n'Cause I done cried Mary J. Blige rivers\nI realized that God’s with us, soon as I decided\nTo put that bottle down and pick up my Todd Bridges\nThe writing's on the wall\nSince niggas seen me at the baseball game\nWith Shady and Jay-Z, suddenly everybody calls\nLike, \"I’m just checking on you, dog!\"\nWhile I throw up this message on the stall\n\n[Chorus: Royce Da 5'9\"]\nWhen them bottles stop poppin’ and them dollars start stopping\nDo what you did to get it and don't stop (don't stop)\nI made a promise to my momma, I'mma out live her\nHow can I be a quitter when haters don't stop? (don't stop)\nI’m living proof, nigga, it's pretty safe to say\nGod giveth and God taketh away\nIt's the Worldwide American way, I’m living proof, nigga\n\n[Verse 2: Eminem]\nYour body language is sayin’ your confidence is gone\nWell, pick ya ass up, lil' homie, come on\nYou just gon' sit there and take it or make 'em suck it?\nTell 'em where to shove it straight up\nYou gon' make love to the world or you gon' fuck it?\nThe last time that life kicked me in the ass\nI pulled down its pants and put a foot up its ass\nMan, what a catastrophe it’d be for me to be a bitch-ass pussy\nAnd not open a can of whoop-ass, let you piss-ants whoop me\nWill be the day I say I ate poop, shit, the day that\nI don't straight shoot, I'll drop outta my anti-women hate group\nSay I’m a sissy faggot, record it, play it back\nAnd put it on straight loop, you haters look like you ate a grape fruit\nTo see me climbing back on that wagon, got my swagger back\nI was dragging, hopped back on it, grab the reigns on that bastard\nAnd came back on 'em without remorse man\nMan, of course, I’m a one-trick pony\n'Cause I’ll be screaming on these whores 'til I’m hoarse!\n\n[Chorus: Royce Da 5'9\"]\nWhen them bottles stop poppin’ and them dollars start stopping\nDo what you did to get it and don't stop (don't stop)\nI made a promise to my momma, I'mma out live her\nHow can I be a quitter when haters don't stop? (don't stop)\nI’m living proof, nigga, it's pretty safe to say\nGod giveth and God taketh away\nIt's the Worldwide American way, I’m living proof, nigga\n\n[Verse 3: Royce Da 5'9\"]\nNah, I ain't fading yet, I’d rather stay and rap\nI might've made a debt but I find excitement in wondering what I’ma write next so I don't stay in debt\nMe broke, you might as well cut the embryo\nOut of my momma and play catch\nWith the baby with AKs with baby bayonets\nI’ma get rich or I’ma die trying\nThat's why it's either kill or be killed\nSo call me suicide homicide Ryan\n\n[Verse 4: Eminem]\nThere's a bomb inside my head, I’m a live wire\nI am on the edge, teetering on it like a totter, I might\nGet on a nut like a tire iron, I have no desire stopping\nSo why would I drop and roll? That's how much on fire I am\nRappers are fun and I’m the time 'cause I’m just flying by ‘em\nMan, I’m laughing at ‘em the entire time, why am I up?\n'Cause tribulations I have triumphed, bitch, I’m fired up\n\"So one time for me, just let your fuckin' lighters light the sky up\"\n\n[Chorus: Royce Da 5'9\"]\nWhen them bottles stop poppin’ and them dollars start stopping\nDo what you did to get it and don't stop (don't stop)\nI made a promise to my momma, I'mma out live her\nHow can I be a quitter when haters don't stop? (don't stop)\nI’m living proof, nigga, it's pretty safe to say\nGod giveth and God taketh away\nIt's the Worldwide American way, I’m living proof, nigga", "image": "https://images.genius.com/4f6a0a530a76a984bf49737247a96417.900x900x1.jpg"}], "artist": "Bad Meets Evil"}