{"songs": [{"title": "Da Destroyer", "album": "House of Wax: The Vatican Mixtape, Vol. 3", "year": "2007-09-29", "lyrics": "[Intro: Raekwon]\nYo, aiyo, yeah nigga, what up\nI can't do this shit!\n\n[Raekwon]\nYo, some nights I feel like sticking up Exxon\nMy gun game experience, came from robbing Louis Vitton\nCocaine specialist, since nine\nAge bracket, fuck them O.G.'s up, they started giving me ratchets\nGet money Diamonds, co-signing all of my check stubs\nBesides getting money, I grub\nI had a Kool G. Rap lifestyle, sliding through the Parrot with drugs\nI'm like a magic with witchcraft, ya'll give a nigga rich cash\nBlankets, anklets, Gucci shit, switch labs\nI'm powerful, yo, you know my hour is due\nFuck the fifteen minutes, I'mma flower my boo\nWord to my Nike's that I throw on pose, from here to Hollywood\nYou know I got soul like that Rakim dude\nJust give me my money, ya'll owe it to me, don't make me blow you for it\nFor real, I'mma show ya'll niggas how to swoll dummies\nHigh profile, he keep it macked out, hundreds of little niggas engage with him\nAnd he gets down, aiyo you fucking with the best of the year\nThe best whoever did it, no love lost\nBeside my shorty and child, I'm like a king in an Egyptian center\nMilitant, to play your perimeter, hold wifey now before I get her\nYou know what Wu do, RZA, tell 'em, now we got, Dre in the kitchen, son\nIt's on, Part Two, watch me sell 'em\nCuz New York is me, homey, watch me throw the crown in the trash\nWhoever wore it, ya'll ass, 'member me, Toney, what up, what up\nYou know my gun game's zid up\nSupplying every borough my cocaine river\nFlashy always, I'm like four ways, none of ya'll see me fresh\nI only do it in, project hallways, ya'll all gay\nYa'll know it, yes, that's what it be, peace\nSee me in streets, God be there, all day, one\n\n[Outro: Raekwon]\nI'm out of here, man, fuck that\nIt's on, Part Two, yeah, Part Two\nAiyo, aiyo, aiyo, I want my money in all fives yo, hahaha\nIce Wate, the new and improved Chef\nWord up, the feist is coming soon, one\nI'm out of here...", "image": "https://images.genius.com/258ddd2b01af2188dd6ee5363048d09d.820x820x1.jpg"}], "artist": "Raekwon"}