{"songs": [{"title": "Mama, I’m In Love Wit A Gangsta", "album": "It Takes A Thief", "year": null, "lyrics": "Verse 1: Coolio\n\nHey baby, how you doin? What's goin on?\nI'm sittin in my motherfuckin cell, it's the same song\nTell my kids that I love em but don't tell em that I'm doing\nKeep tryin' and tell em I'll be home soon\nOh baby I'm goin crazy\nCos I keep seein shit that amaze me\nStill I had to kill a motherfucker last week\nHe thought I was a punk and tried to creep up on me in my sleep\nI just think that I could hold or squeeze or touch or buck ya\nBut I can't, so fuck it\nI'mma behind these bars and it's burnin like nitro\nI might go psycho, the man on the tower got a rifle\nAw shit, there the lights go....\n\n*phone ringing*\n(Hello)\n\nChorus: LeShaun\n\nMama, I'm in love wit a gangsta (damn)\nMama, I'm in love wit a gangsta (y'know)\nMama, I'm in love wit a gangsta and I know he's a killer\nBut I love dat nigga\n\nBridge: LeShaun\n\nHey ba-by\nWhat's happenin honey?\nHow you doin?\nI miss you\n\nVerse 2: LeShaun\n\nThe kids keep askin where's their papa?\nI had to tell em daddy got caught by the coppers\nIt's time for me to raise em up proper by myself\nIt's a goddamn struggle when a bitch ain't got no help\nNow everybody tellin me that you ain't shit black\nAnd when you get out, you'll jack and probably go right the fuck back\nDamn, the pressure's gettin hot and heavy\nAnd yeah, I'm gettin sweated by your homey in the blue and white Chevy\nBut now he's got a condo and a brand new Lexus\nWants me to take a trip with him down to Texas\nThe ends don't justify the means\nAnd in another life he might've been the man of my dreams\nBut you know I got your back to the motherfuckin end\nBut a bitch can't even trip like she doen't need a friend\n\nChorus\n\nInterlude:\n(Hello, you have a collect call from...)\nCoolio!\n(If you choose to accept this call please press 5 now)\n*number dialed*\n\nVerse 3: Coolio\n\nWhat the fuck you mean you need a friend?\nI can't be havin no niggas round my kids\nDon't you make me break up outta this motherfucker\nAnd start killin motherfuckers, SHIT!\nI know it's rough, I know it's tough\nBut when you fumble in the game sometimes you get locked up\nYou better stay away from that punk ass bitch, he ain't shit\nAnd I don't wanna have to kill him\nCos think about the times that we used to have\nDon't make me reach out and touch that ass\nYou put yourself in danger when you fuck with a buster\nLike shootin dice without a pistol in a circle of murderers\nYou got more class than the average-type hooker bitch\nDon't switch, he gotta grip but he ain't rich\nNow I gotta jet, but if you've got the cheque\nGive a nigga a look and put somethin on my books\nPeace\n\nChorus\n\nVerse 4: LeShaun\n\nAiyo remember the homey with the Lexus, he took the trip to Texas\nNow he's wearin the fuckin Lexus like a necklace\nSo tell me, what's the drill, baby pa? What's a bitch to do?\nMy nigga's stretched in the pen since '92\nThem visits ain't doin the trick, drop fucks make me sick\nCos this po' puddy-tat needs a cat nip\nAnd that motherfucker representin you, I think he resents you\nHe got evidence he never presents to\nThe people in court, I heard witnesses abortin\nWhat's he doin about gettin you out to hold the fort?\nI got some ends, I'mma send you a dime and two dubs\nMama hates you but damn I got love for a gangsta\n\nChorus to fade", "image": "https://images.genius.com/681f5b81de576ad7ba17ac999a7e7e8a.1000x1000x1.jpg"}], "artist": "Coolio"}