{"songs": [{"title": "Lock and Load", "album": "Tha Carter II", "year": "2005-12-06", "lyrics": "[Intro: Lil Wayne (Kurupt)]\nRide with me, sweetheart\nIt ain't hard!\nAww, fuck them niggas, I ain't worried 'bout them\nThis Cash Money, baby! This the Carter 2!\nKurupt! Holla at them niggas! (Nigga!)\n\n[Chorus: Kurupt]\nWe won, we won\nAnd then we shot that BB gun\nAnd they lost, and they lost\nTil we took they shit, now it's time to floss (We lock and load!)\n\n[Verse 1: Lil Wayne]\n22-year-old 17th Ward vet\nLife in the fast-lane, little red corvette\nLittle red handkerchief, hangin out the right side\nBack pocket jeans fallin, cover my Evisu sign\nYep we do shine, and they gon' hate\nBut they hated Jesus baby we won't break\nSo we ride like four Pirellis, so secured\nNo security, no protectin no comparing\nLocin' and heavy, Ocean 11\nAviators, vote-takers, so fakers, ah!\nNo playas, I'm Holly Grove to the heart\nHollygrove from the start, don't cross Earhardt\nBoulevard where the ward I come from\nOne-seven, one shot? Never that, blum-blum!\nBrrr, brrr, pop, pop, clap, clap\nWhat the fuck! Hollygrove, stand up! Duck! (Nigga!)\n\n[Chorus: Kurupt]\nWe won, we won\nAnd then we shot that BB gun\nAnd they lost, and they lost\nTil we took they shit, now it's time to floss (We lock and load!)\n\n[Verse 2: Lil Wayne]\nGet 'em, get 'em, Weezy! Hit 'em where you kill 'em, easy\nSit 'em in the river, leave em, they find 'em tomorrow evening\nSinkin, I'm prob-ly drinkin that syrup\nThinkin I won't slip, even though I'm leanin like a broke hip\nHe don't know I got the nina wit the full clip\nThat's a somersault, backspin, full-flip for ya\nPush this button, I flip out and hit something\nMiss nothin, I'm just bustin until this scene clean\nTwelve hundred for the jeans, stop playin\nHundred dollars for the Glock in my pants\nWho the man? I am when I stand with it pointed right at ya face\nKnock the brains from the back of ya neck for lack of respect, I\nStrap a jet black gat 'til the death\nTell the mama to bury me with that, no bullshittin'\nMy hood getting kinda crazy where I be\nSo Ronnie's with me cuz he's the OG (Nigga!)\n\n[Chorus: Kurupt]\nWe won, we won\nAnd then we shot that BB gun\nAnd they lost, and they lost\nTil we took they shit, now its time to floss (We lock and load!)\n\n[Verse 3: Lil Wayne]\nFresh out the back seat of the Phiggity-Phantom\nThe haters, I make 'em madder when I wave at 'em like, \"What up?\"\nIf it ain't about money I keep goin\nI'm tryna get that green, niggas tryna mow my lawn, but fuck--\nThem boys, I got the shottie on my arm\nIf them boys run up, I leave their bodies on the lawn\nAnd duck the fuck outta there, 'cause baby, it's outta there\nIf this was a movie, it's time to roll the credits, cut!\nIts all over, all of ya brains is all over the motherfuckin' block!\nI'm a motherfuckin' rock!\nHardbody, Eagle Street, seventeen shots\nNight vision double-clip, hot steady beam Glock\nPop! Drop, little man, drop!\nThis is not for little bitches, you man or a fox?\nI'm layin in the drop, thinking of more money\nCash money, Young Money, take money, your money\n\n[Chorus: Kurupt]\nWe won, we won\nAnd then we shot that BB gun\nAnd they lost, and they lost\nTil we took they shit, now it's time to floss (We lock and load!)", "image": "https://images.genius.com/98c56aa11e01a9c25b7485cc3a25c78f.300x300x1.jpg"}], "artist": "Lil Wayne"}