{"songs": [{"title": "Its goin down feat nicki minaj (bonus) (feat. nicki minaj)", "album": null, "year": null, "lyrics": "(Lil Wayne)\nYMCMB, bitches call me Tunechi Lee\nI be with niggas that shoot police\nI keep that iron, you can get creased\nAnd if she say she didn't fuck, bitch ya lying through ya teeth\nThey say it cost to be the boss\nThe ones in jail wish they were free\nNiggas call me Hi-C because I'm high as you can see\nNiggas say they paid they dues\nWell I'm checking your receipt\nMight as well go stupid since this is a stupid beat\nGrab the owl out the tree, and ask that bitch, who but me?\nGot ya bitch bent over nigga, hands to her feet\nTell that pig and that cow I'll go ham if it's beef\nCause all my niggas well rounded\nDon't fuck with none of these square niggas\nMask on, Ghostface Killah, draw down and erase niggas\nI'm a Blood, is you a blood donor?\nSwisher full of that California\nI hit it sideways, catacorner\nThen she catch that nut like pneumonia\nLil Tunechi\n\n(Hook)\nLay it down ho\nLay it down bitch\nLay it down ho\nLay it down\n\nLay it down, lay it down\nYou hoes lay it down (x2)\n\nPut the money on the couch nigga\nGimme everything up in you house nigga\nShut yo mouth nigga (x2)\n\n(Cory Gunz)\nStart it up, vroom vroom\nUppercut a bitch out the bus, boom boom\nUnless I get the brain, poom poom\nShe let a nigga run and get the gang, run a train, zoom zoom\nTryna get paid too soon, one deep\nOne sweep away in a room room\nWe getting money over here\nTalking shit and fucking bitches\nI don't know what the fuck they doing Tune\nMy syrup purple, my turf Earth\nMy birth circle, I'll dirt surf you\nI'll squirt murk you, my verse hurtful\nMy shooters still got curb curfews\nYall bout as hot as von dutch\nYall not gone harm much\nHijack yall some prom busts\nAin't no retreat but my arms up\nWe don't graffiti, my bombs up\nIt's Young Money in this shit until a nigga dead and gone\nIf you wanna set it off, what you wanna bet it on?\nI'm betting the wedding's off when everything is wetted on\nPoint 'em out, Truk ya life\nFuck ya style, fuck with me\nYou a bucket foul, niggas'll buck ya smile\nFor a dunkin pile, you better duck it, pal\n\n(Hook)\nLay it down ho\nLay it down bitch\nLay it down ho\nLay it down\n\nLay it down, lay it down\nYou hoes lay it down (x2)\n\n(Nicki Minaj)\nShawty, what's yo name?\nIs you tricking? Is you paying?\nIs you sniffing on that cane?\nWhat the fuck is you saying?\nIf you getting it, then you getting it\nIt's my money I ain't splittiing it\nI ain't tripling it, if she got a fat ass, then I'm tipping it\nCome out the bank, bye teller\nGive a bum money, hi fella\nBad lil ho, high yellow\nBrand new roley, sky dweller\nJust left from Dubai\nFlew private eye\nI made a million dollars, swear to God that ain't no lie\nI said them niggas was poppin\nFake niggas be watchin\nMy black glove be drippin wet, but I got my Cochran\nLosing ain't no option, I'm teaching bitches my doctrine\nThe Maybach ain't poppin if it ain't got no partation\n\nOops I mean partition, it's all a part of my vision\nI sit and count this money while I watch you bitches audition (x2)\n\nI don't give a fuck\nYou don't hear me, you don't see me\nBitch you gon' feel me ho\nYoung Money\nYoung-young Money nigga\nYoung-young, lay it down, lay it down, you hoes lay it down\nLay it down, lay it down, you hoes lay it down, ah!", "image": "https://images.genius.com/361fbb0a68e9287bdc9eb1ad1f8099a7.640x640x1.jpg"}], "artist": "Nicki Minaj"}