{"songs": [{"title": "I’m Serious", "album": "I’m Serious", "year": "2001-06-26", "lyrics": "[Verse 1: T.I.]\nAy, take a good look at me - now picture me unhappy\nNo cash and outta fashion, not flashin'\nPicture me doin' bad even if I wouldn't rappin'\nPicture me even breathe on the mic not snappin'\nI'm fire hot not lukewarm, my arms frozen\nPicture me in a room full of hoes unchosen\nPicture me with no P.O. and no 'dro\nPicture pimps walk with some broads and ain't gettin' no 'tho\nL.A. gone and I ain't gotta deal no mo' (Picture that)\nA ghetto vision ain't real no mo' (Picture that)\nAh T.I.P. ain't work for MIA no mo'\nHe still so-so (picture that) he still po'\nNigga picture that, ah matta fact picture T.I.P\nGettin' anything other than rich\nNow can you picture this, young, pompus, arrogant son of a bitch\nLabelled as anything less than \"the shit\", I can't see it\n\n[Hook: Beenie Man]\nDis bad man you get shot, anywhere\nBad man nuh tek back chat, no day\nJamaican bad bwoy seh dat, zagga zow\nAny bwoy flip dem ago flap - come again\nDis bad man you get shot, any day\nBad man nuh tek back chat, anywhere\nJamaican bad bwoy seh dat - bak\nAny bwoy flip dem ago\n\n[Verse 2: T.I.]\nPull up in a blue coupe that's damn near clear\nAnd Polo gear that won't drop 'til next year\nBe like this here, Cartier frames and Piaget wristwear\nT.I.P. your majesty's right c'here\nNotice when I came the dames disappeared, ya lames listen here\nTo play me, ba-by, hey he\nGone need a track from God featuring Jesus or Jay-Z\nGo on floss, ball but where it cost\nSmile for the cameras, take your shirts off\nY'all niggas actin, take ya skirts off\nHoppin bomb-ass nigga and he ain't wanna work boss\nI'm gettin' sick and tired of these phony renditions\nWonder why I don't consider them no competition\nThere's no vision - lil' ambition\nHow I feel about these niggas, am I worried?\nAre ya kiddin'?\n\n[Hook: Beenie Man]\nDis bad man you get shot, anywhere\nBad man nuh tek back chat, no day\nJamaican bad bwoy seh dat, zagga zow\nAny bwoy flip dem ago flap - come again\nDis bad man you get shot, any day\nBad man nuh tek back chat, anywhere\nJamaican bad bwoy seh dat - bak\nAny bwoy flip dem ago\n\n[Verse 3: T.I.]\nSome niggas wonder what my goal is\nThey think it's goin' gold havin' hoes sweatin' me\nFuck that, I'm in it for the longevity\nPicture me as one of the greatest that'll ever be\nCompare me to, 2Pac, B.I.G., and Jay-Z\nWork with legends like, Organized No-I-Z., and J.D\nNeptunes, they even flow on one of Dre's beats\nFly to Miami, chill with Luke and we can trade freaks\nI freak shows, just peep hoes under shade trees\nHuh, but KP say just keep it top-notch\nAnd make sure that the club is jumpin' like it's hop-scotch\nFloss rocks and in the summer keep the top dropped\nTen thousand dollars work for clothes, when I go shop\nIn the Impala on them vogues so the hoes jock\nEspecially when I rock that linen suit with no socks\nIn Polo skippers, they undo zippers\nAnd they shows cock, to show shot shit\nBitch, I'm serious\n\n[Hook: Beenie Man]\nDis bad man you get shot, anywhere\nBad man nuh tek back chat, no day\nJamaican bad bwoy seh dat, zagga zow\nAny bwoy flip dem ago flap - come again\nDis bad man you get shot, any day\nBad man nuh tek back chat, anywhere\nJamaican bad bwoy seh dat - bak\nAny bwoy flip dem ago\n\n[Outro: Beenie Man]\nWell it's a Neptunes sound (ha-ha-ha-ha-ha)\nZagga-zagga-za, na-na-na-na-na (T.I.P.)\nWhoa na-na-na-na (Beenie Man)\n(Zagga-za-za-za, Oh we dat shit)\nAn a ziggi-ziggi-zagga (Bad man sittin)\nStraight from Jamaica (Alright lemme give this to ya)\nAlright lemme tell them somethin (See it's goin down)", "image": "https://images.genius.com/d4010b5f2aa7374582fd8c3be5913af3.1000x1000x1.jpg"}], "artist": "T.I."}