{"songs": [{"title": "UpDate", "album": "Rejex", "year": "2012-09-06", "lyrics": "[Hook]\nWe should go out on a date, on a date, on a date, on a (date)\nI'll pick you up around 8, around 8 around 8, around (eight)\nShe said that's great. That's great, that's great\nJust don't be late. Just don't be (late)\n\n[Verse 1]\nIt was love at the profile pic\nWe was Facebook flirting, never even met her in person\nBut it seem like we was soulmates on the phone late\nShe my one and only, be there when I be lonely\nWhenever she get horny, she would call me\nBut we speak in code cause her pop dukes be nosy\nTap in to the line like, \"Nigga who you trying to wife\"?\n\"I heard you was a rapper, but I don't see no lime light\"\n\"But look I got these iron sights, used to be in the army\"\n\"So don't you be retarded and make yourself a target\"\n\"That's my word mark it, and if you ever think about sex\nI want you to keep in my mind that my name is Mr. Marcus\"\n\"So, we will see who gets fucked, nigga\"\n\"Trying to run up out the door, I'm at the door like \"Hey, what's up, nigga\"?\n\"You out of luck nigga, choppa in my trunk nigga\nIf you feel a way, then tell your pops I said, 'What's up, nigga'?\"\n\n[Hook]\nWe should go out on a date, on a date, on a date, on a (date)\nI'll pick you up around 8, around 8 around 8, around (eight)\nShe said that's great. That's great, that's great\nJust don't be late. Just don't be (late)\n\n[Verse 2]\nOh, and by the way, I like a well done souffle\nSit up under the stars, nice view of the lake\nAnd we can get baked. I bring the cake, you bring the 8th\nIt's no backing down, it's 8 doobies to the face\nFuck that, and if you act right, I might let you fuck that\nGrab up on my buttox and what not\nSo you better be in order nigga\nDon't forget the product from them corner niggas\n\n[Hook]\nWe should go out on a date, on a date, on a date, on a (date)\nI'll pick you up around 8, around 8 around 8, around (eight)\nShe said that's great. That's great, that's great\nJust don't be late. Just don't be (late)\n\n[Bridge]\nI got what you want, I got what you need\nI got that fire, I got the trees\nNow let's get higher, let's be at peace\nWith the 7 seas, birds and the bees\n\n[Verse 3]\nSaid I'm down for whatever you down for\nWe can catch a flick or do it quick on the down low\nI can go down slow, you can go up in\nWhen I'm in my zone I ain't stopping for nothing\nSaid I ain't stopping for nothing\nWhen I'm in my zone I ain't stopping for nothing\nWhen I'm in my zone I ain't stopping for nothing\nSaid when I'm in my zone, I ain't stopping for nothing\n\n[Bridge]\nI got what you want\nI got what you need\nI got that fire\nI got the trees\nI got what you want, I got what you want\nI got what you need, I got what you need\nSaid I got that fire, I got the trees\nNow let's get higher, birds and the bees\nBirds and the bees\nBirds and the bees\nBirds and the bees\nBirds and the bees\nI got what you need\nLet's get higher\nBirds and the bees\nI got what you need\nLet's get higher\nBirds and the bees\n\n[Hook]\nWe should go out on a date, on a date, on a date, on a (date)\nI'll pick you up around 8, around 8 around 8, around (eight)\nShe said that's great. That's great, that's great\nJust don't be late. Just don't be (late)", "image": "https://images.genius.com/f19a23d547500fb2fba75dfe154e60cb.500x500x1.jpg"}], "artist": "Joey Bada$$"}