{"songs": [{"title": "Anybody", "album": "The Trials & Tribulations of Russell Jones", "year": "2002-03-19", "lyrics": "[Intro: C-Murder]\nTytanic, let's wake 'em up, ya heard?\nYeah, it's real out here\nJusting chill about it now (chill boy)\nSome of the ODB what?\nNYC CP-3 nigga what?\nLet me ask you a question\nWhat do you think about the game now? (What you think about it now?)\nHow you feel like my name now (How you feel 'bout me now?)\nHow you feel like C now?\nWhat do you think about the ODB now? (What?)\nWhat do you think about the game now? (What you think about it now?)\nHow you feel like my name now (How you feel about me now?)\nHow you feel like my name now (I told you I wanted somethin')\n\n[Verse 1: Ol' Dirty Bastard]\nYeah, bite that point, the habit of breathin'\nNo hope to find, that you're misbehavin'\nLink your cupid and fuck your brewin'\nFlash the burgers on your crewin'\nCause I must different from the other MC's\nI got the amazing ability\nI get on the mic so you can have a ball\nI could fly through the air and stick to the wall\nI could take a punch or get hit by a car\nCould go to the nearest or farthest star\nAs a matter of fact it's what I won't talk about\nHoppin' and goin' out of his trace just to be in the house\n\n[Hook: E-40]\nI'm so pimped out about my big spendish\nI got a 20, 6 Clock extra dickless (extra dickless)\nFor Anybody of them wanna pop off at the lip\nAnybody that wanna give me banana split\nIt's only E-40, Murder in this biatch\nAll the money motivated me to biatch\nThree soldiers from the East, South and West\nStreet soldiers holdin' it down for they septs (for they septs)\n\n[Verse 2: C-Murder]\nI'm C-Murder, murder mass ten, I'm wit' the Dirty Bastard\nAnd my flows comin' faster than a jet to Alaska\nI ask ya how you feelin' my collabo'\nThe CP3, the ODB from NYC the ghetto B\nLight it up, let it cook, look in the mirror, as we crush\nDon't worry about how it looks, put some money on my books\nOnly God can judge me now\nThat's when I heard the click clown\nI was Christened ,I ain't with them, am I RZA\nLet them whistles out them pistols\nLet loose on them troops and then shake 'em like Cherok smoke\nI slam dunk 'em like Shaq\nI wanna be free, I'm not guilty, do you feel me?\n\n[Hook: E-40]\nI'm so pimped out about my big spendish\nI got a 20, 6 Clock extra dickless (extra dickless)\nFor Anybody of them wanna pop off at the lip\nAnybody that wanna give me banana split\nIt's only E-40, Murder in this biatch\nAll the money motivated me to biatch\nThree soldiers from the East, South and West\nStreet soldiers holdin' it down for they septs (for they septs)\n\n[Verse 3: E-40]\nHey sluggin', wanna hit this rock down (rock down)\nI only got one world, mane, I feel like take this to the thick of him\nUnder there, got the smell, you do the ho you hear\nFuck it there, let me get a swig of that Thunder Bird\nOK, it's cute, it's squashed\nNow, no though mane, lets have a back wash\nYeah you trippin', \"no I ain't\", yeah you is\nThat boy spittin', what's his name? 40, quarter, biatch\n\n[Verse 4: Ol' Dirty Bastard]\nI stays in place, place stays in me\nI'm a vision of truth, just a true MC\nLove hiphop so much, mic won't untouched\nThugs grow unbust, bitch won't get fucked\nEvery 40 ounce cracked, every napsack packed\nOl' Dirty kickin' your ass, the record gets scratched\nOh, the record gets scratched, the record gets scratched\n\n[Hook]\nI'm so pimped out about my big spendish\nI got a 20, 6 Clock extra dickless (extra dickless)\nFor Anybody of them wanna pop off at the lip\nAnybody that wanna give me banana split\nIt's only E-40, Murder in this biatch\nAll the money motivated me to biatch\nThree soldiers from the East, South and West\nStreet soldiers holdin' it down for they septs (for they septs)\n\n[Outro: E-40]\nAnd there you have it\nE-40 the Fonzarelli\nThe  from the Soyo block soil\nTurf hall, been through it all\nBall 'til we have it all (ball 'til we have it all)\nOh boy ooo me (not me)\nOo we better than ooo me\nI'm so damned stalk on my self on crack by self\nAy look where c-murder at?\nMe and Ol' Dirty Bastard got the same birthday\nIf you don't stay your ass out of trouble\nMe and Ol' Dirty Bastard got the same birthday\nAy we got the nigga Tytanic on the beat\nWhat's up boy? ODB\nWe got the same motherfuckin' birthday\n11 -15 Scorpio, November Scorpio we tight motherfuckers\nWe look at the motherfucking memes when we get on the good one I can't please foul while y'all on the good one\nI'm on thought, I'm not throw em a paw but I only give lood\nWhat the fuck you drinkin'? Fortay\nShit I'm off this motherfucking .......", "image": "https://images.genius.com/8aae5961ee3d6894e7d2abaab7f8fc11.772x768x1.jpg"}], "artist": "Ol’ Dirty Bastard"}