{"songs": [{"title": "Juice WRLD Hour Freestyle of Fire Over Eminem Beats", "album": null, "year": "2018-10-05", "lyrics": "[Intro]\nIt's live? Already?\nCool, uh-huh\nI'm back on Westwood, bitch\nHuh\n\n[Verse 1]\nFreestyle king, I'ma do my thing\nMarried to the game, I'ma need a ring\nRun up on me, that choppa sing\nBrand new bitch, that's a brand new ting\nBroke up with my bitch, now she my side bitch\nText me on my psychic, huh, yeah\nShe gon' keep the strap in her purse like a dyke bitch\nRun up, she fire shit, uh, yeah\nNigga, just lose it, niggas be faker than optical illusions\nRun up on me, that chopper skip to conclusions\nI don't give a fuck, with your bitch, I'ma do her\nPaul Wall with her, I'ma chop her and screw her, uh\nBrand new money\nRun up on me, chopper hoppin' like a bunny\nI don't walk it, I run it\nKeep it one hundred\nHeadshot, headshot, drive-by in a Hummer\nGoddamn, just lose it, uh\nMake love then make music, uh\nRun up, chopper do 'em\nWaka Flocka, \"O Let's Do It\", uh\nOff of the top, I be kickin' it\nHop on my dick like a frog, you be ribbitin', uh\nLook at the way I be rippin' it, drillin' 'em\nLike I be full of adrenaline, uh\nSick of the Percs, I'ma put them down, huh\nRun up on me, that chopper marry your ass like you got a gown on\nGuess you a pussy now, huh?\nHa, ha, yeah, yeah, yeah\nGuess you a pussy now, uh\nKeep this beat goin', mhm\nI'ma spazz for a second\nI'ma get up on they ass for a second\nChopper on me, it's gon' blast for a second\nI'ma shoot him in his ass, I'm reckless\nDo it big like football, Texas\nI'ma ball out like the Texans\nBitches pay me like taxes\nOn the mattress, hittin' backflips\nRide me, carpet, Aladin\nOuterspace, boolin' on Saturn\nGive a fuck what you say, I don't really care about nothin' but the money I manage\nHoes on me, they wanna fuck too, though\nOuterspace, I been pullin' on Pluto\nBad bitch, huh\nHot like a motherfucker hit the bitch up in June, whoa, ayy, ayy\nSummertime sadness\nOff the Xan, tryna figure out what's up though\nBad bitch... uh, tryna fuck though\nKeep it on the low, I don't wanna know, ho\nVVS on my wrist, no snow-globe\nIncredibles, feelin' like Frozone\nI'ma probably put dick in your ho' dome, uh-huh, uh-huh\nIn your ho's home, uh-huh, uh-huh\nI been rappin' all day, that's normal though\nI'm a alien, goddamn, an abnormal ho\nPull up on 'em, chopper make it rainstormin', ho\nHot like a motherfuckin' global warmin', ho\nThen again, I'm colder than a freezer\nFuck your bitch, I'll leave her\nDragon Ball, Frieza\nPull up on the scene, my choppa got a fever\nHand on my heater, kick it like FIFA, uh, yeah\nHot like a cheater, fast like a cheetah\nRun up, I get 'em, uh, yeah\nChoppa like Jessie White the way I up the bitch and it flip 'em, uh, yeah\nSpazz on they ass all day though\nI was in the cut killin' people like Tadoe\nWorld in my hands, I'ma treat it like Play-Doh\nI'm full of shit, I'm a rich ass a-hole, huh\nYeah, just lose it, uh-huh, uh-huh-huh, just lose it\nBad bitch, look, the fuck are you doing?\nIf you ain't gettin' naked then I'm not gon' screw it, uh-huh, uh\nJust lose it\nDon't make love, make music\nHuh, just lose it, uh\nDon't make love, make music, huh\nPill pop, Molly in the party\nBad bitch wanna fuck, I got off the Bacardi\nRun up on me, I'ma hit 'em, choppa crackin' like Pilates\nI ain't ever give a fuck, motherfuck, catch a body\nI was in the cut with a bitch from Tacoma\nSmokin' on pack, you can smell the aroma\nYoung ass nigga but they think that I'm older\nHachoo, bless you, my flow too colder\nWorld on my shoulders, feel like a boulder\nRun up on me, I told you that it's over\nChopper get to doin' motherfuckers like homework\nClip stickin' out like a motherfuckin' boner\nThis is my flow, it's not a motherfuckin' loaner\nOnly one of me, ain't no motherfuckin' cloners\nBallin' on these hoes like Adrian, Adrian\nKnock 'em out, lil' nigga, like Adrian Broner, uh\nLook at the way that I ball on these hoes\nIn the back of the cut, mm, mm\nI got blue faces up in my pockets, I'm not throwin' no dubs, mhm\nHeart out chest, I put that in the grave\nI ain't showin' no love, mhm\nI am not talkin' 'bout snails, shoot like Tony Snell with slugs, mhm\nYeah, spazz, I'ma spazz on they ass\nUh, leave a nigga in the past\nUh, do it for the quick cash\nUh, it's a big ass gun\nMm, so you better get back\nMm, your boyfriend broke, baby, I don't think you could fix that\nUh, haha, yeah\nOld broke ass nigga\nHit the bitch from the back, that's a no ask, nigga\nHuh, already know, ass nigga\nRun up on me, chopper on me, I'ma blow, ass nigga\nWalk around like I don't even know that nigga\nBoppin' on the bitch like Kodak, nigga\nUp, down, left, right, cheat code that nigga\nHaha, hahahaha\nBro, I said \"Up, down, left, right, cheat code that nigga\", boy\nThat mean I got cheat codes\nGuns sing like the leader of the Glee show\nBape on the cape, no, I'm not a hero\nVVS cold, no sub-zero\nGettin' money like Robert De Niro\nFuck with me, you get jacked like Sparrow\nI'll put you out your sorrow\nYou won't live to see tomorrow\nShootin' your Monte Carlo up\nMy shoes, they cost your car note\nI am not tryna brag, but you know I got the quatros\nThe pesos, I don't know, nn-nana, hahaha\nUh-huh, uh-huh\n\n[Verse 2]\n999, 999, uh\n999, uh, uh-huh\nUh, uh-huh-nuh-nuh\nWe on the Eminem wave today\nLast time I was here, I rapped for an hour\nA fucking hour\nUh, ain't no competition, I'm not worried\n.30 on me, Stephen Curry\nSippin' dirty with a bitch that give me head just like she nerdy\nI been shootin', Larry Birdy\nIn that bitch like a surgeon\nPut my dick in her throat, she get to regurgitatin', uh, hahaha\nIgnorant, yes, that's me, uh\nCatch a nigga like a taxi\nUsain Bolt, runnin' shit just like a track meet, uh\nFlexin' up on 'em like an athlete, mm\nFuck nigga, you cannot surpass me, uh\nThat's your bitch, well why is Juice WRLD tatted all over her ass cheek, ya dig? Ha\n\n[Verse 3]\nOoh, yeah, that's what-\nYeah, yeah, yeah, yeah, yeah, yeah\nMy Name Is\nI said hi, my name is gun, I'm aiming\nThese niggas are ass, anus\n.40 aiming, leave 'em brainless\nTote my stainless, fuck is you sayin'?\nI'ma dye my hair blonde, Super Saiyan\nRuthless with this gun, shoot it, slayin'\nSprayin', leave 'em on the pavement\nJackie Chan kush, bitch, I'm feeling like an Asian\nAsian persuasion\nRun up, then I'm blazing\nIn this fucking Bathing Ape blazer, amazing\nI'm up in that new thang\nFeeling like I'm Bruce Wayne\nKickin' shit like Liu Kang\nSicker than some flu game\nJordan on me, flu game, nigga\n60 points on 'em on that flu game, nigga\nLook at the way that I do thangs\nI'm with my clan like Wu-Tang\nEvery day we hustlin'\nWant a Lamborghini, remember dreamin' about a Mustang\nNow I'm 'bout my next thang\nNow I'm 'bout my next thang\nBlue face in my pocket, I'm ain't worried 'bout no chump change\nI can hit your block and then I turn it to a gun range\nCall of Duty closet, boy, that shit look like a gun game\nI just had to dread my hair because I couldn't maintain\nNow a nigga wildin', feeling like a rasta\nChoppa like guitar, get to strummin' like a rockstar\nI'm sipping lean out the cup, I'm such a wokstar\nI put this .40 to your head and then I pop it\nI'm so violent, choppa with a silence\nOptimus Primin'\nTransform on your ho to fuck her for perfect timing\nRollie change colors like the climate\nDiamonds on my neck, best believe them bitches shining\nI left my chains at the hotel, I hate jewelry\nI wear it just so I can participate in the foolery\nYou got a problem with me? I'ma pull up with this choppa\nI'll shoot you and your father, put an end to your eulogy\nUh, clip hold a hundred, count it like a centipede\n21 left in that Glock, I'll shoot it out the century\nI'm schooling niggas like it's fucking Elementary\nProlly fucking these bitches and fucking 'em up mentally\nNow, that's just me\n\n[Verse 4]\nWestwood, you know we gettin' cash, right?\nBad bitch, she gon' shake her ass, right?\nI'm like \"damn baby, where you from?\nWhat's your name? You familiar, did I meet you in a past life?\"\nI can give you all this money if you act right\nI'ma throw you all this money if you act right\nI'ma throw you all this money if you act right, uh\nI'ma throw you all this money if you act right\nThen again I ain't paying for pussy, you rookie\nChopper on my hip and it's shootin', mm, mm\nHo, chopper on my hip and it's bad like Meghan Goodie\nBad little bitch, she gon' give me all her cookies\nBad little bitch and she thick, looking like Snookie\nGot a problem with me, I'ma shoot it like a movie, uh\nThat's just how it is\nI'm Khalifa with the reefer but I've never been a Wiz\nThis is grown man shit, this is not for little kids\nEven though I'm going hard like a nigga Lil Bill\nGot the Molly in drink, I'ma crack a seal\nRun up on me, you get popped, like I'm popping all the pills\nSpazzin' on every track, I battle rap\nAnyone that's gon' battle rap, come battle that\nI feel like Shaquille O'Neal when I shoot\nChoppa gon' break the glass, ratatat\nI don't got time for snakes, no time for rats\nI'm smoking pack, I'm selling crack, bring it back\nRun up on me, cool, that chopper on me get you clapped\nMatter of fact, I don't know how to act\nI'm a real ass nigga, drill ass nigga\nGo and pop a pill ass nigga, real ass nigga\nFuck how you feel, lil' nigga, I'm real, lil' nigga\nI'm sick, I'm ill, lil' nigga, for real, lil' nigga, uh\nFreestyle off the dome, kickin' it for real\nIn the cut totin' my steel like Keel\nIf you don't kill the mothafucker, fuck it, I will\nYou better start writing your will, for real\nI'm real Juice, yes, I'm the real Juice\nYou can get juiced up, you fuckin' with me, uh                                    Won't the real Juice WRLD please stand up?\nWon't the real Juice WRLD please stand up?\nSomeone bring all the real Xans out\nThis fentanyl shit got me layin' on the couch\nLike, what the fuck is all these fake pills about?\nWhat the fuck is all these fake thrills about?\nR.I.P. to X, R.I.P. to Peep\nR.I.P. to Mac, R.I.P. the beats\nR.I.P. to anybody that want beef\nR.I.P. to anybody that want beef\nR.I.P. to all the niggas died in the street\nR.I.P. to all the nigga died, rest in peace\nOnly thing I can't say is R.I.P. me\n'Cause I'ma live forever, I put that on my life, B, uh\nFlow go crazy\nFor niggas that's boolin' red, my flow go brazy\nShake like Haiti\nChoppa on me, give yo ass a plate\nI'on't give a fuck, I might just fuck yo bitch today\nYoung nigga and I'm feelin' rich today\nScratch him off, lil' lotto, no quick pick today\nBurn a nigga like Jamaicans and incense today\nBeen the realest nigga since an infant, okay, uh\nOn these Eminem beats, I'm a beast\nFrom the west to the east, I'm a freak in the sheets\nGot yo bitch and she got a real badass physique\nI'ma fuck her one time, while you beatin' yo meat\nHaha, hahaha\n\n[Verse 5]\nSpazzin' on this Westwood shit, though\nUh\nNicotine is cancerous, kinda like my flow\nMy gun is a thotty, kinda like your ho\nPull up on the scene, choppa on me, whoa\nI get more head than some fuckin' frontal lobe\nGotta let you know she gon' dance, Gigolo\nI'm a nigga, Jigaboo\nWith some money, with some dough\nBallin' on these hoes like a mothafuckin' pro\nRun up on me, choppa on me and it's down to blow\nSpazzin' on they ass like every track that Westwood put on\nLook at all my niggas, how I'm finna put on\nR.I.P. to all my niggas that is gone\nPromise you that I'ma let your name live on\nTatted on my face? Nah\nTatted on my neck? Yeah\nTatted on my chest? Nah\nTatted on my wrist? Yeah\nTriple 9 like wrist slit\nI could fuck a rich bitch\nI feel like a rich bitch\nProlly 'cause I'm rich, bitch\nI feel like I'm Rick James\nRun up on me choppa hit yo ass like \"Okay\"\nBlack bullets hit your fuckin' body like Luke Cage, huh\nIt's a mothafuckin' outrage, nigga\nThese niggas make me mad thinking they can compete\nI swear to God, they flow ain't nothin' to me\nBut Juice WRLD 999, he's something to see\nIt's so hard when he rap, that it's make-believe\n\"He can't be freestyle and shit for real, he be writing it\"\nNah, this off the dome, I do it to be excitin'\nI feel like a Buddha or somethin', my flow is enlightening\nBut I'm not with that folly shit\nPop it like an ollie, bitch\nI was off the Molly in a party with a bitch that's acting faker than a Barbie, kid\nRun up, you get grilled just like a Que, ain't talking barbe', kid\nI'm the type to top, oof, hold on watch this\nChoppa on my side, it's 'bout the size of a hockey\nShit, I shoot it in yo brain and see your thoughts, psychologist\nI been goin' harder than the hardest\nPut my arm up in the rim, I feel like Vince, I feel like Carter\nI been ballin' like a starter\nPut my dick inside your daughter\nMatter of fact, bitch, I'm your father\nNiggas thinkin' that they gettin' it, but I'm tellin' 'em \"why bother?\"\nMake him disappear like Potter\nI swear to God I was whippin' all this crack up in this pot\nI'm making music for the problems\nYeah, I'm making music for the problems, yeah\nI'm known to make hits, take bitches and take pills\nI make thrills, chase thrills and make mills\nI eat meals and chill out with my bro\nChris Mills, we pop willy like Meek Mills\nI'm in the cut, gettin' head from a bitch\nAfter that she could be dead, I wouldn't give a fuck\nShe get on her knees and it's ironic, that she get on her knees so Juice WRLD could live it up\nThat bitch said that she ready to give it up\nI said \"pull your panties down, baby, the jig is up\"\nI seen a bunch of crack pipes and cigarettes\nI ain't wanna fuck her, no way, serve to her mother, bruh\nHuh, that's word to your mom\nIf you looking for me I'm probably puttin' dick in your mom\nIf you looking for me I'm probably putting shit in your mom\nIf you looking for me I'm probably tryna sniff with your mom, huh\nI feel like the bomb, Osam'\nYou ain't on shit, nigga, really, dot com\nYou don't really know the shit that I'm on\nYou don't really know this spliff, my mind gone\n\n[Verse 6]\nHi kids, do you like? Uh, huh\nLook, mhm\nHi kids, do you like Oxy?\nDo you wanna get it poppin' like a Molly?\nProlly, rockstar, lookin' up to Chief Keef and Ozzy\nBombing like a motherfucking kamikaze\nHit him in his face with a choppa, sorry\nThat bitch finna sing like an opera, Harley\nI'ma box him out, left, right, I feel like Ali\nI'ma play your bitch like her first name Atari\nI'ma grill the pussy like it's fresh calamari\nTry me if you want, that chopper on me get to killin'\nBlood all on the floor, you know that shit just got to spillin'\nI don't give a fuck, nigga, I'm such an evil villain\nLouis V 'Preme on my shirt, cost ten bands\nPull up on the scene, choppa hit you and your best friend\nMarried to the money even though I am the best man\nShe on my dick like a mic she was testin'\nIt's time to spazz on a track that's what I do, uh-uh\nGun sing like Erykah Badu, uh-huh\nThrow your body in the bottom of the bayou\nSo rich, motherfucker, I could buy you\nDon't try me, but nigga, I will try you\nI hope your ass ready to die, dude\nChoppa on me, leave your momma traumatized, dude\nLike a bunch of chicken, you will get fried, ooh\nI'm from Chicago where niggas don't live to see 20\nBut then again I made it out and got a lot of money\nI'm 19, I got a couple fucking months left\nMy birthday December 2nd\nSo please don't step in my motherfucking direction\n'Cause if I feel threatened, I'm upping a Smith & Wesson\nI put it to your face, best believe I'ma get it bustin'\nI'm spazzing on a track, got a AK like a Russian\nI hit you in your head like a motherfucking concussion\nI've been causing combustion\nSomething-ness out of nothing\n23 in my Glock, I said it the last time I was on the Westwood\n23 in my Glock, boy, shooting like Jumpman, Jumpman, uh-huh\nI rapped for a hour last time\nAfter that I fucked your bitch in the shower that's fine, huh\nI rapped for a hour last time\nAfter that, I fucked your auntie in the shower, that's fine\nI fucked your auntie then your mother\nThen I put fucking a bullet hole right up in yo uncle\nI got to fucking balling, I refuse to fucking fumble\nI'm confident as fuck, I'm really tired of being humble\nThese niggas really thinking they better but they not, though\nHe say he want beef, I got them shells, let's make some tachos\nYou know I get, hold on, hold on, hold on, hold on\nHe say he want beef, I got them shells, let's make some tacos\nHe say he get cheese, I get cheese, that shit is not yours\nI get cheese like nachos, uh-huh\nThat choppa on my hip, you run up, I'ma give you quanthro\nI shoot through your Monte Carlo, uh, haha\nOn my shoe is your car note\nYou get scanned like a bar-code\nUh, uh, uh, uh\n\n[Verse 7]\nEminem is like \"I'm cancerous\nThis, you wouldn't want to answer this\nResponded back, battle rap, ripped Cannabis\"\nShout out Em, man\nSpazz on some of the racks, oh\n...mm\nPockets fat, you know I got the racks on\nClothes still got the tags on\nBoast on a nigga, I'ma brag, um\nI'm feeling like the champion\nDifferent approach on this beat\nI feel like the best if you askin' me\nI'm balling on these hoes like a athlete\nI don't think anyone gon' come better after me\nLook at the way I spazz, this is off the top, looking like a wave cap Choppa with the mags, shoot you in your ass\nLeave you in the past\nMemories in the past, now it's getting to the cash\nFreestyle flows, I don't write it, nuh-uh\nOff the top, tryna kick it and I hope I don't jag\nBad little bitch in the back of a Benz\nI'ma prolly get behind it and hit it from the back\nGotta tune in and kill shit everyday, ho\nPull up on the scene, choppa give you a halo\nWorld in my hands and I treat it like Play-Doh\nI love Xbox but I really don't play, ho\nI'm on to the next shit, I'm on to the next cash\nI'm smoking the best kush, rollin' the best gas\nPull up in a black Benz, I really do not fuck with Jags\nYou know what's up, nigga\nYour bitch gon' fuck, nigga\nI'm sippin', lean inside my cup, ain't Robituss', nigga\nAin't with that tussling shit, my choppa tussle for me\nI promise you I'm a bully, I keep on getting money\nThese niggas walk it, they walk it, I told them that I run it\nI'm kicking it off the dome, that's how a nigga coming\nI'm kicking it of the dome, that's how a nigga boming\nI'm drinking Henny with pills, you know a nigga vomit\nI'm drinking Henny with pills, you know a nigga vomit\nListen to the way I spazz\nI'ma kill em, put 'em in a body bag, maybe even in a body cast\nSick of all the Percocets, where the fuck the Molly at?\nRan a train up on your mom, she looking for trolly\nGet it popping like it's Tony Hawk, ain't talking 'bout a ollie\nYeah, but I may just pop a ollie\nUsed to skate in the hallways every Friday\nHuh, get it poppin' like a ollie\nI remember I was sitting in my basement\nThinking 'bout the clothes that I can't get\nLook at me now, I'm up right now\nNiggas still got the nerve to say I'm up next\nThree times platinum on a song, beat that\nI'm the best motherfucker, defeat that\nI ain't— hoo\nI turn my phone off 'cause I don't really want no motherfuckin' feedback\nI got a fucking bad bitch where my feet at\nAnd a bunch of, mm, ha\nI'm tryna body this beat, boy\nHahahaha, shit\nUh-huh, yeah, yeah, yeah, yeah, yeah\nBack in London, I'm home\nFeel like it's my second home\nThis is where Juice WRLD roams\nI feel like it's my second, uh\nI'm the best wit' it, quick witted\nI kill niggas, I switch clips\nSame way I end sentences, nigga, I'm so relentless\nPull up on the scene, my choppa just like a pencil, lead\nShoot him in the head, motherfucka\nA couple times, he gon' be dead, motherfucka\nNow his mom calling to the feds, motherfucka\n\"Look at my son laying in the bed\", motherfucka\nRan up in his crib like the repo' man\nI gave his bitch wood like a Home Depot, man, huh\nChoppa on my hip just like a Pringles can\nDesert Eagle on my hip, like I'm a Eagles fan\nI'm the type to kill all your people, man\nI'm not good, hell nah, I'm a evil man\nI'm above y'all, we are not equal, man\nBefore and after, prequel and the sequel, man\nI'ma be here for a long ass time\nYou think you better than me then you lost your mind\nI'm Stevie Wonder with it, I will rob you blind\nI'm looking for the answers that they can't find\nI came to Westwood to spit some facts, motherfucka\nI came to Westwood to spit some crack, motherfucka\nI came to Westwood to get it back, motherfucka\nYour bitch is over here, I hit it like— oof\nYour bitch is over here, I hit it like, ooh\nI pulled up in a Ghost, peekaboo, the new coupe\nYou got a problem, that's okay, I got the gun, ooh\nRich nigga, prolly could fuck up on the principal\nI give a fuck about the principals\nGotta seal lock the envelope\nI feel like I'm Travis Scott 'cause I'm doper than all the antidote\nThat bitch is on my dick, I'ma put it in her, you know she trope\nI'ma put it in her, you know she choke\nI don't got they time for the trolls\nI could put that shit up on my soul\nRun up on me, choppa hit you in your face like it's over with\nI'm sicker than a nigga with a cold and shit\nThese niggas old as fuck, they got mold and shit\nI really wanna give them my condolences\nGo tell them that it's over and to let the new niggas prosper\nHow you my father? Nigga, I'm your father\nHow you my father? Nigga, I'm your father\nSayin' you my father, nigga, why bother?\nI'on't got no father, nigga, I'm harder without a father\nI put that on your daughter\nUh-huh, uh, uh-huh, uh-huh\n\n[Verse 8]\nUh-na-na, na-na-na, na-na-na, na-na-na\nThat was his flow on this song, right?\n*mumbling*\nTour bus full of bottles and models and bitches who swallow\nGot guns full of hollows, put you out your sorrow\nI'm rappin' on Eminem beats 'cause I follow the leaders, that nigga's a beast\nI feel like a monster or maybe a goblin\nA straight Jeffrey Dahmer\nPut dick in your mama\nNeck like a ostrich\nI'm fly, fuck a copper\nCan't judge me at all, put the Johnnie to Cochran\nMy flow brazy, it's crazy, insane\nAnd the fact that I made it, these fuck niggas hate me\nI remember playin' this game in my basement\nSayin' I would make it and fuckin' complainin'\nMomma on the link, car, food, and the fridge\nBut we was still strugglin', ballin', triple doublin'\nDamn near had two jobs, tryna keep up\nWorked at my school just so I could stay up in there, uh\nNow I gotta bless her, now I gotta bless her\nNow I gotta fuck on a bitch named Vanessa\nHer chest the best, huh\nHer breasts the best, uh\nNow I'm ballin', next up\nNow I'm ballin', next up\nThis shit'll upset\nI'm fuckin' the world like it's rough sex\nGot head from a white bitch, I call it a rough neck\nI'm ball on these bitches like Rucker or somethin'\nMoney makin', rich motherfucker or somethin'\nMy flow is crazy, it's brazy\nI told you, you run up then you will get cracked like a soldier\nMake like composers, I promise it's over\nEverything but sober, I do her like homework\nNiggas think they in it but they not\nThey been trippin', catch 'em slippin', I'ma shoot 'em with the Glock\nI been ballin' like a Piston, shit, I do this shit a lot\nAll this shit is really all a part of my evil plot\nIt's world domination, triple 9 in this bitch\nChiropractor with the chopper, break your spine when it hit\nI been ballin' like I'm Kobe or LeBron in this bitch\nMatter fact, I'm feelin' like I'm in my prime in this bitch\nThis shit finna do numbers on YouTube, trust me\nHoes gon' love me, they all wanna fuck me\nEven if I'm ugly, I know I'm not ugly\nI been movin' around too much, trust me\nChopper on my hip with a clover on it, lucky\nMy chopper like a thotty, I pull it out, it's busting\nI really don't got time for none of the discuss-ting\nI problem solve 'em, smoking all this pack, super musty\nOff of the dome\nThis shit comin' off of the dome\nAnd I'm comin' all for your domes\nThis shit comin' off of the dome\nI make hits and take shits on these niggas that think that they better than me, but they not, go figure\nKeep the Tommy in my Tommy, lil' nigga, Hilfigers\nI'ma ball, I'ma swish, lil' nigga\nI remember smoking swishers with my brother and now it's backwoods\nRun up on me, chopper hit you and leave you in back woods\nIf you lookin' for me then I'm prolly up to no good\nRunnin' through your hood, with prolly some more goods\nWater whippin' in the kitchen, flippin' it like chicken\nRun up, chopper hit him, put him into su-submission\nDon't give a fuck about niggas, neither, or bitches\nI promise you I'm only focused on gettin' them riches\nYou see it, believe it\nWhite Justin Beiber\nMy swag super hot like I caught me a fever\nBring the house down like Queen, no Latifah\nYou'll get smoked like a blunt, no Khalifa\nBoolin' on top with a thot from the block\nGive me top, you get hit with the Glock\nAll my niggas get money, best believe it or not\nRun up on me, leave you shoot\nBest believe I'm on top\nJuice WRLD like Pac, shoutout 2Pac\nWithout him I wouldn't be here, believe it or not\nShoutout to Eminem, same situation\nI been makin' all this money, I been money makin'\nI been soul snatchin', I been life takin'\nThey think I sold my soul, nigga, I was just playin'\nI just got this shit on my own, nigga, I'm just sayin'\nI just got this shit on my own, nigga, I'm just sayin'\nMy flow is so intricate, intimate, killin' 'em, really I'm rippin' it\nFocused like Ritalin, nigga, you get it, don't get\nForget me, lil' nigga\nProactively poppin' like zits, lil' nigga\nOn Westwood boolin', back smokin' pack, with a bitch rollin' thrax for me 'cause I don't know how to roll backwoods\nBut it's all good, I'ma get my shit back\nRidin' up, like a pimp, lil' nigga\nYou get your shit slapped, nigga\nJust like slick back, nigga\nBreak you off like a candy, nigga, no Kit Kat, nigga\nAll my niggas get money, best to believe that, nigga\nOver-chieve all the niggas, overachieve that nigga\nThey lookin' at me like \"How we gon' overachieve that nigga\nHe 19, he went three times platinum\nHe wrote that song in twenty minutes, he just started rapping\"\nNah, I been makin' it happen, huh\nAhahaha\nThey say \"Why your dreams super lucid?\", ahaha\nOh, chief, this beat hard as fuck\n\n[Verse 9]\nHis arms are sweaty\nHis face is sweaty, knees weak, arms are heavy\nHe ain't have a Perc in a couple days, he ready\nUh-huh, uh-huh\nHis face is sweaty, haha\nHis face is sweaty, knees weak, arms are heavy\nHe ain't have a Perc in a couple days, he ain't ready\nHe got a show, he gotta perform and do his thing\nBut them withdrawals finna take his ass up out the game\nHell nah, I'ma keep fightin' and I'ma do me\nMy life is such a Blu-ray, it's such a movie\nYour bitch is such a thotty\nShe's such a groupie that she ain't tell you she gave me all of her coochie\nLose yourself in this music, this moment, you own it, you better never let it go\nAnd it's like a seed to plant when you rap and you spazz and you gotta throw it on and watch this shit grow\nI pull up, I'm shootin' out the coupe, it's red on the fucking white 'Cause I killed your ass in the snow\nI'm ballin' out the roof\nWith my troops, redo what we do\nI just gotta let you know\nI spazz on this track like the best fucking rapper\nWhen I freestyle off the top I'm the best fucking rapper\nHe sayin' shit he don't do, that nigga is a actor\nAnd if it's up to me he's not really a benefactor\nI turned him into fractions\nI rap and then I watch y'all reactions\nIt's like, \"How the fuck he made this shit happen?\"\nLike a poetry slam, I got 'em snapping\nYeah, hold the applause, I put dick in your broad\nI put dick in your mom, I put dick in the world\nGive a fuck about shit, I'm a fuck on a bitch\nI'm a count up the grip then put a dick in your girl\nI don't care about nothin' but this money\nAnd God, I'ma pray every day that I make it-\nOut some time, she call me Allah\nI don't want that title, baby, I'm not God, I don't forgive\nMy niggas runnin' into your crib\nKillin' everybody, they even got some bloods on the bib\nIts blood on the leaves, I'm listenin' to Kanye and shit\nIt's 3K for the wrist, I'm feeling like I'm André again\nI get to servin' crackers, feelin' like a Entrée again\nI'm up in a different island, fuckin' on a Bombay chick\nI give a fuck about you, I give a fuck about bitch\nI kill your ass, and then I tell you to rest in piss\nRest in clips, rest in this, you can take the rest of this\nMicheal Jackson with flow, I'm cardiac arrest this shit\nR.I.P. to the king, yeah, king of pop, shit\nRun up on me, choppa play you like the king of rock, shit\nAerosmith with the gun\nHaha, Aerosmith with the gun\nNo guitar, Aerosmith with the gun\nWillow, hahaha\nYeah, man\nI make it look simple\nChoppa hit your face and get blood on your dimples\nMore than some acne problems, bigger than a pimple\nChoppa hit your face and give your forehead a nipple, hahaha\nFor really though\nThese niggas really thinking that they in it, nooo\nWe can get it poppin' like a wheelie, ho\nPhilly shit, ain't talkin' 'bout Meek Milly, ho\nBut shoutout Meek Milly, though, uh\nI'm getting this money\nI'ma stack it, flip it, I keep it one hundred\nI'm gettin' this money\nStack it and flip it, I'm keepin' it one hundred\nI'm gettin' this money\nStack it and flip it, I'm keepin' it one hundred\nUh, there's more of this beat left?\nAlright\nBack on my rap shit, even on my trap shit\nBlood everywhere, you gon' need more than a napkin\n...", "image": "https://images.genius.com/18251b1b9616abad7fd1b3d35bef35e5.1000x563x1.jpg"}], "artist": "Juice WRLD"}