{"songs": [{"title": "Say a Prayer", "album": "Brick Factory: Volume 1", "year": "2014-05-26", "lyrics": "[Intro]\nLet's go, haha, tick tick\nSix spots, twelve stoves, and I need more pots\nAnd I tote more knots than a Boy Scout got\n\n[Verse 1: Gucci Mane]\nThe junkies say it’s finger lickin’ how I whip up powder\nI took your food and Prada shoes and added me more power\nAnd if you bought some Sour Diesel, then your dream gone sour\nI treat your shooters like cowards, make your team look sour\nI feed the hood with the bowl like I cook clam chowder\nRIP to Steve McNair, that boy right arm was a rifle\nI would race you for the car, but look you don't got the title\nIf you ain't made ten mil, I can't call you my rival\nI got your baby mama suckin' on me using saliva\nI made the Forbes list bitch, man you just a subscriber\nMy mam say you just a lyin’ ass, conniving lil’ diver\nMy nigga killed his own brother, seen that shit in the bible\nMan, Joe Blow chose the fork but you chose the screwdriver\nI may did never steal a car, but I did cash off a nine though\nI go so hard I make you dump your whole roster to sign me\nAnd you can find me in the six with all my shooters behind me\n\n[Hook: Rich Homie Quan]\nI’mma say a prayer, get a blessing today (amen)\nNo grey hair, I ain’t stressin’ the case\nMake you scratch for the chase, I invested in yay\nMan what else can I say? I’m still gon’ flex in they face\nWhat the fuck can I say? I got racks in the safe\nGet wrong that gat on my waist, that house they trap in that place\nLeaning so hard on the drank, I forgot what to say\nNever forget where I came, and it’s all ‘cause I’m having my way\n\n[Verse 2: Rich Homie Quan]\nThat right too, I’m having my way\nBy the bay, I move, penthouse by the lake\nThey cool, my neighbors, got a gate so you know them folks safe\nGot a pool, twelve acres, and a guest house if you wanna stay\nMan I’m cool, gettin’ paper, and a custom Cartier\nI’m a smooth operator, I got a customer named Sade\nAnd she’ll bug a motherfucker all day, then try to pull up in all grey\nI ain’t gon’ play with you, I’m impatient too, ain’t gon’ wait for you\nI’m pimpin’ like players do, lean and matching gator shoes, the windbreaker hater proof\nNigga lookin’ nervous, Gerber, soft like baby food\nOkay cool, I got a plug like no other\nNo discussion, me and Thugger, waiting on judgement\n\n[Hook]\nI’mma say a prayer, get a blessing today (amen)\nNo grey hair, I ain’t stressin’ the case\nMake you scratch for the chase, I invested in yay\nMan what else can I say? I’m still gon’ flex in they face\nWhat the fuck can I say? I got racks in the safe\nGet wrong that gat on my waist, that house they trap in that place\nLeaning so hard on the drank, I forgot what to say\nNever forget where I came, and it’s all ‘cause I’m having my way\nI’mma say a prayer, get a blessing today (amen)\nNo grey hair, I ain’t stressin’ the case\nMake you scratch for the chase, I invested in yay\nMan what else can I say? I’m still gon’ flex in they face\nWhat the fuck can I say? I got racks in the safe\nGet wrong that gat on my waist, that house they trap in that place\nLeaning so hard on the drank, I forgot what to say\nNever forget where I came, and it’s all ‘cause I’m having my way\n\n[Outro: Rich Homie Quan]\nOh, Never forget where I came\nAnd it’s all ‘cause I’m having my way\nOh, Never forget where I came\nAnd it’s all ‘cause I’m having my way\nOh, oh, oh, oh", "image": "https://images.genius.com/d65a023cc756026019052ee1eeb88c31.591x591x1.jpg"}], "artist": "Gucci Mane"}