{"songs": [{"title": "Rockafella", "album": "Dare Iz a Darkside", "year": "1994-09-29", "lyrics": "[Intro]\nAyo-yo-yo-yo, you better pass it\nAyo, check this out\nWe coming to you live from that BOMB Chocolate City my man\nWhere the knotty-headed niggas and the Brick City brigade dwell\nAnd if you don't know your fool behind better ask\nAyo-yo, you better pass that blunt\nAnd yo E, we comin' to you live with the Cosmic type stuff\n\n[Verse 1]\nWell it's that brother coming six billion feet from beneath\nAnd you should be peep-in how I get smoked-out on the weekend\nI swing it to my crew or down to my fam\nSchoolin' mellows knock is like final exams\n'Cause, it's that (UH!) Funkadelic, hit you with the irrelevant\nElements, and it's coming through your blocks\nCan't you smell it, trick?\nWanna copy-cat my whole format\nSo you get funk tracks, punchlines and skull hats\nHUHHHHHHH! Got a little Redman in town\nWho's that effin' clown soundin' wack with the frown??\nI don't know man, but you better warn him what I would do\nWild out on his staff like birds one and two\nMy crew runs thicker than syrup from the barrel\nYou get hurt up, word up, Jam-med like Pearl\nKnock off a blood clot puff on the rough block\nR.I.P. my man, Rockafella, it don't stop\n\n[Chorus:]\nOn and on, and it don't quit\nRedman rockin' on to the funky shit, c'mon\n(On and on, and it don't quit\nRedman rockin' on to the funky shit)\nI said Jersey's in the house (Jersey's in the house)\nI said Brooklyn's in the house (Brooklyn's in the house)\nI said Uptown's in the house (Uptown's in the house)\nI said the Bronx in the hidouse (The Bronx in the hidouse)\n\n[Verse 2]\nNewark, New Jersey, rock rock on, word is bond\nI'm comin' in swarms, so turn your flashlights on\nDue to difficulty, my style blows wattage across the planet\nIn 48 Hours like Nick Nolte\nDroppin' the flavor, stay Sky high like Pager\nI'm magical like Fantasia on paper\nI Saw the Light like Kraftwerk, of course\nWhen the T-L-A Rock shock the stuff, It's Yours!\nIn your drawers! Your record label got your staff gassed\nThinkin' you gonna sell two mil cakes real fast\nBut you flopped, and your image choked like a TEC\nNow, who freakin' style your ass gonna steal next?\nAre there any more imitators in the house? There are no\nBust like NBA Jams, and you can have Chicago\nCatch the combo, funky like a bag of Bravos\nWay back, when I pumped 92 KTU in Harlem\nHuuhhh! I just stay funky like that\nMake you wanna *sniff sound* my style like a junkie on crack\nTrick, you better back the freak up, for real now\nWhen I break it down from Newark NJ to IllTown\n\n[Chorus]\nOn and on, and it don't quit\nRedman rockin' on to the funky shit, c'mon\n(On and on, and it don't quit\nRedman rockin' on to the funky shit)\nI said Virginia's in the house (Virginia's in the house)\nI said Cali's in the house (Cali's in the house)\nI said Atlanta's in the house (Atlanta's in the house)\nNorth Carolina's in the house (Carolina's in the house)\n\n[Verse 3]\nYoo-hoo, watch the birdie! While Red wreck your brains early\nIf rap was B-Ball, I'd have assists like James Worthy\nDribble the rock if you got the hots to get your knot rocked\nTwice my device, Run-D.MC's from my Rock Box\nHey you, better Come Clean like Jeru\nBefore I take phase two and do another pay-per-view to your crew\nI give a boom bip to Q-Tip\nStandin' tall like Shaq, money I'm back, this ain't Blue Chips\nThe new stuff, creamin' brothas like Breyers\nHe's heating up — nah, brotha, I'm on fire!\nDribble dribble shootin' three pointers to the drum, trick\nTry to take my style? FOUL! and one\nDJ Twinz in the house for the nine-square\nMy man Shaft, you don't know, you better ask\n\n[Outro]\nHa, that bomb Chocolate City coming to you live\nFor the ninety-fo' era\nAyo you better pass that blunt, ayo check this out\nWe gonna take it to you live\nWhere Newark New Jersey drops that chocolate funk for ya\nEvery day and all day, how we do it word is bond, word is day\nDef Squad's in the house for the nine-fo', word is bond, word is day\nThey said Hawthorne Ave. got the good smoke, word is bond, word is day\nKnotty-head niggas in the house for nine-fo', word is bond, word is day\nBrick City brigade in the house for nine-fo', word is bond, word is day\nRedman rocks on and on for the nine-fo', word is bond, word is day\nWord is bond word is bond in the house I'm in the house\nWord is bond, word is day\nYou can suck my balls and lick my clip, not word bond, word to me, ehehehehehe\nWord is bond, word to me\nHehehehehe, word is bond, word to me\nCheck it out, check it out\nWe comin' to you live with the Cosmic Slop\nOn the fuckin' block and we got the Glocks to your knot\nWho's the funk nigga and I'm comin' to ya hot\nIt's that, Cosmic Slop, hit you with the irrelevant, ele— yeah", "image": "https://images.genius.com/64940bf4c49084b33fd87ec14510613f.600x600x1.jpg"}], "artist": "Redman"}