{"songs": [{"title": "Brick City Mashin’!", "album": "Doc’s da Name 2000", "year": "1998-12-08", "lyrics": "Yo, yo, yo, nigga\n* monkey noises in background *\nSwinging through the forests of the jungles\n* monkey noises in background *\nYo, c'mon, c'mon, yo yo, yo\n\nYo, look around your seats;\nDo you see anybody weirder than me? (me..)\nWhen you find him then I try him, fry him like the grill\nAt Benihana's to hebrew?? how to be an MC (cee.. cee..)\nSheeyit, take two tokes, I'm dope riding over notes\nOverload your periscope, Doc da most\nLock and load with the rock'n'roll star, dozed off\nI had him bruised and closed off with one phone call (brring!)\nChickens, mida mida the heater, believe-a I'm a dog\nStraight labrador chedda retriever\nLet the gorillas out, til the blood is spilling out\nPut a slug up in his mouth, then the thug is chicken out (ha ha)\nDarkrooms get ignited, bright lights on the mic\nSo when we battle they can via satellite it\nPPP draft pick is massive, athlete Tenactin flow\nDoc captain up battin! Brick City Mashin'!\n\nTurn it up! (c'mon) Smoke that shit up! (c'mon)\nTake money money! (c'mon) Brick City Mashin'! (c'mon)\nStolen cars! (c'mon) Counterfeit bills! (c'mon)\nFreak that shit out! (c'mon) Brick City Mashin'! (c'mon)\nTwo for fives! (c'mon) Push that shit out! (c'mon)\nLet the monkey out nigga! (c'mon) Brick City Mashin'! (c'mon)\nFreak that bitch out! (c'mon) Smoke that weed out! (c'mon)\nFreak that ho out! (c'mon) Brick City Mashin'! (c'mon)\n\nSay I am .. (I am..) some-bo-dy! (Some-bo-dy)\nSay I am .. (I am..) some-bo-dy! (Some-bo-dy)\n\nYo, yo-yo, I'm from Da Bricks where the weed go\nFor two for five dick.. you try this\nI promise I'll be at your video, smackin the shit out of you\nFrom crew to hairstylists (lists.. lists..)\nGuerilla maneuver on an intruder\nI pack like Sinbad pack the house in Aruba (chk-chk)\nBlow your brains; yeah, leave the murder scene\nLookin for me is like lookin for Herb at Burger King\n_I Get Around_ like 2Pac and Shock G\nFuckin hotties, block the block like Monopoly\nI rock with an eighty-watt spitter, block lit up\nSnatch profit up, get your Benz lock it up\nSo which nigga got a dope enough spot?\nCall X to shut em down and I'll open up shop (shop, shop)\nPPP draft pick is massive, athlete Tenactin flow\nDoc captain up battin! Brick City Mashin'!\n\nTurn it up! (c'mon) Smoke that shit up! (c'mon)\nTake money money! (c'mon) Brick City Mashin'! (c'mon)\nStolen cars! (c'mon) Counterfeit bills! (c'mon)\nFreak that shit out! (c'mon) Brick City Mashin'! (c'mon)\nTwo for fives! (c'mon) Push that shit out! (c'mon)\nLet the monkey out nigga! (c'mon) Brick City Mashin'! (c'mon)\nFreak that bitch out! (c'mon) Turn that bitch out! (c'mon)\nTurn it up! (c'mon) Brick City Mashin'! (c'mon)", "image": "https://images.genius.com/ff1bcd7d83855df13cac08a00e033052.594x594x1.jpg"}], "artist": "Redman"}