{"songs": [{"title": "I Can’t Help It", "album": "No Mercy", "year": "2010-11-22", "lyrics": "[Verse 1: T.I.]\nHey you know me bitch nigga I’m all of that\nHit your broad with bitch then call her back\nRelax lil' cat let the big dog attack\nThought it was over for me hommie did you fall for that?\nU-turn big arrest no cardiac\nGet your hand out of my pocket\nWhat with all of that?\nTell the sheriff he can get these fucking charges back\nNo jail time, gotta thank God for that\nRegardless, big bank can’t fold it up\nAin't another nigga flowing who a colder bruh\nQuarter-mil for the show really though what's up?\nLouis duffel-bag say \"load it up\"\nGet into the hotel better know what’s up\nWith them niggas out there get the hold it off\nWe never had a problem getting hoes to fuck\nSuck dick, lick, spit til the show is up\nI let this nut get all over her\nAnother thick bitch kissing all over her\nBust the pussy wide open can't close it up\nMake it bounce that shit\nWhen you found that bitch\nShe was laid on the ground\nPatted down, six chicks\nFor the drab bag of money\nTrying to count that shit\nNever would you find me around that bitch\nIf she got them lips wrapped around that dick\nAll the niggas wanna make love fuck that\nI Bing, Bang, pound, beat down that clit\nSick with it, like E-40 and them\nThis K-i-n-g aka, Big Bank, aka Shawty the Pimp\nAy, aka Shawty the Pimp\nBig Bank, aka Shaw the Pimp\n\n[Hook: Rocko (T.I.)]\nI get money, I can’t help it\nYou can’t stop it, you gotta accept it\nYou can’t knock it, you gotta respect it\nThis is who I am nigga, I can’t help it\nI can’t help it\n(In the ghetto in a drop Rolls Royce)\n(They say \"keep it one hundred\")\n(I ain't got no choice)\nI can’t help it\n(Yeah, her all-way big tank)\n(I'm so trill and you ain't)\n(\"Cut it down\" Bitch I can't)\nI can't help it\n(Ay, see how I do it? I'm so hood)\n(\"Cut it off, go Hollywood\")\n(Bitch I would if I could)\nI can't help it\n(Ay, the city wouldn't be shit without me)\n(Fifteen-million dollar houses)\n(Still can't get that trap up out me)\nI can't help it\n\n[Verse 2: Rocko]\nI'm a hustler all they down to the bone\nTerrorists everyday rhyme with that bomb\nStay on the day from night to the morn'\nI ain't gonna server you nothing under a song\nNo fucking favors don't ask for no loan\nShop with your dogs then trynna get on\nCall on my spot don’t be calling my phone\nNigga you ain't trynna shop, leave me alone\nGrinding for days I haven't been home\nDon't plan on going on til it's all gone\nMainly strong whatever you want\n\"Gotta get right\" Well fuck it what's wrong?\nShots of Patron whole lot of storm\n800's on but you know what I'm on\nYour bitch wanna fuck now she know that I'm on\nOn motherfucker I just want some dome\nPlay with me nigga, I got that tone\nNeed no help I can handle my own\nI tear on your sqaud but I ain't from the Bronx\nOne in the back, still play with that drum\nJust no that I don't play the radio home\nNo radio-play every song that I'm on\nCase you ain't know I'm Rocko the Don\nZone folk Hamilton, low on fun\nGucci my hat, Gucci my drawers\nGucci on my ass-cheek cover my balls\nGucci my pant, Gucci my shirt\nGucci bookbag while I keep on that twerk\nGucci bandanna on top of my shirt\nGucci boots on, gotta travel in the dirt\nShe around me everywhere I go\nG Code, G Code that's all I know\n\n[Hook: Rocko (T.I.)]\nI get money, I can’t help it\nYou can’t stop it, you gotta accept it\nYou can’t knock it, you gotta respect it\nThis is who I am nigga, I can’t help it\nI can’t help it\n(In the ghetto in a drop Rolls Royce)\n(They say \"keep it one hundred\")\n(I ain't got no choice)\nI can’t help it\n(Yeah, I’m always big-bank)\n(I'm so trill and you ain't)\n(\"Cut it down\" Bitch I can't)\nI can't help it\n(Ay, see how I do it? I'm so hood)\n(\"Cut it off, go Hollywood\")\n(Bitch I would if I could)\nI can't help it\n(Ay, the city wouldn't be shit without me)\n(Fifteen-million dollar houses)\n(Still can't get that trap up out me)\nI can't help it", "image": "https://images.genius.com/f55abc725080eb05147e45ce3cd406a8.1000x1000x1.jpg"}], "artist": "T.I."}