{"songs": [{"title": "Tho Freestyle", "album": "Droptopwop", "year": "2017-05-26", "lyrics": "[Intro]\nHuh\nMetro, let's try something (tho)\nIt's Drop top\nIt's Gucci\nHuh, yeah\nIf Young Metro don't trust you, I'm gon' shoot you\nGo\n\n[Verse 1]\nI'm a ex con, used to sell crack at the Texaco\nKnown for toting guns and it's what I'm on probation for\nHad a murder charge, but they ain't found me guilty though\nKeep my head on a swivel, 'cause I robbed a couple folks\nAnd you can call me anything, but you can't call me broke, though\nWas damn near 300 pounds, but I lost the weight, though\n300 pounds of mid-grade, I took it 'cross the state, though\nGot a bunch of tattoos, don't ask my why I got them, though\nGot a lot of loved ones, but they ain't here today, though\nReally miss my homeboy, he in a early grave, though\nGucci Mane a troublemaker, I'm trying to behave, though\nNiggas keep on trying me, I think they feelin' brave, though\nPeople say they cloned me because I changed my ways, though\nI fly the dope in on a drone for the pesos\nAll about the bucks bro, but this ain't Tampa Bay, though\nI'm a livin' legend, I do magic with the Draco\nIn the Peach State, but I'm sellin' Cali grapes, though\nAnd Arizona mid-grade, I swear my life is great, bro\nGucci Mane and Metro, exclusive Jordan retro\nI was sellin' half a O trappin' at the Zesto\n\n[Skit]\nAye wassup bruh, ride with me somewhere (Yo)\n[?] (Huh?)\nYeah, I told the nigga \"Meet me at the Zesto\" (Dope)\nHe want a half of one (Go)\n\n[Verse 2]\nGucci super cutthroat, but I was born broke though\nDidn't have a pot to piss, so I wanted to throw it out, so\nNiggas talk sideways, I hit him in his mouth though\nWho you think you talking to? I had to stomp your mouth, bro\nBaby got a pretty face but I just want the mouth though\nYou ain't come to suck me up, then what you in the house for?\nBrand new Air Max and they ain't even out though\nDrippin' sauce excessively and it ain't even called for\nIf the jewelry ain't blindin' me, then what it even about for?\nNiggas want to sign to me, but I can't even vouch for\nBack to back with Ralo, and we ain't even deep though\nHow yo clique compare to mines and y'all ain't even street though?\n\n[Outro]\nNew tape alert\nNew watch alert\nNew whip alert\nBrr, brr\nIf Young Metro don't trust you, I'm gon' shoot you\nIt's Wizop, drop top", "image": "https://images.genius.com/4f51d4ae02f3058fc756d5f1428a908a.1000x1000x1.jpg"}], "artist": "Gucci Mane"}