{"songs": [{"title": "Stop The Party (Remix)", "album": null, "year": "2011-06-06", "lyrics": "[Intro]\nI AM IRONMAN!\n\n[Busta Rhymes]\nRemix! Remix! Remix!\n\n[Hook: Swizz Beatz (Busta Rhymes)]\nI said wait...Stop the party\n(What we waiting for Swizz? The streets want it nigga!)\nI don't wanna hurt nobody but!\nOh! Yeah! Oh! (Remix)\nGet 'em up! Get get 'em up! Oh! (Remix)\nGet 'em up! Get get 'em up! Yeah!\nGet 'em up! Get get 'em up! Oh!\nGet 'em up! Get get 'em up!\nI said wait...Stop the party\n(I don't even gotta change my verse for this)\nI don't wanna hurt nobody but!\n\n[Verse One: Busta Rhymes]\nShit! That's what it's comin' to!\nTell me how you want it boo!\nFuck a line nigga see me skippin' right in front of you!\nCheck! Trust me you don't really want it duke\nOpen club security and pull my niggas off of you!\nWhy try stop it see we primetime comin' through!\nShut it down disrespectful bitch that's what we love to do!\nCheck the method how I shread it there ain't nothin' new!\nActin' like the club through!\n\n[Hook: Swizz Beatz] (Busta Rhymes) {T.I}\nI said wait...Stop the party (T.I. Where you at?)\nI don't wanna hurt nobody but!\n{They wanna be down with the King!}\n\n[Verse Two: T.I.]\nWe pull up to the club, park, hoppin' out, bouncin'\nWalkin' in the door, DJ just made an announcement\nKing in the building, women screamin', shoutin'\nRemy bottles in the hand, standin' on the couches\nMe, I don't smoke, but my niggas blowin' ounces\nIt's hot in here, she sweatin', see her nipples through her blouse and\nHow can (what?!) -- I not be the hottest shit?\nI'm killin' parties, body shit, hey wait a minute, stop it, Swizz\n\n[Interlude: Swizz Beatz] (Busta Rhymes) {Cam'Ron}\nI said wait!\n(Aw shucks man! When the last time you heard somebody say aw shucks man?)\n(Oh God what we 'bout to do here?!) {Killa!} (Where you at playboy?)\nI said wait...Stop the party\nI don't wanna hurt nobody but!\n\n[Verse Three: Cam'Ron]\nUh, I'm a cyclone bull, dry-stones y'all\nWant face time? Get the iPhone four\nBe patient, more beef waitin'\nKing James the game, number one free agent\nI been winnin', you been losin'\nDipset back, got the UN movin'\nMovin' chips, Frito-Lay\nYou folks, yessir, I'm the east coast Dre\n\n[Interlude: Swizz Beatz] (Busta Rhymes)\nI said wait! (Aiyyo Ghost where you at nigga?!)\nI said wait...Stop the party\nI don't wanna hurt nobody but!\n\n[Verse Four: Ghostface]\nYo! I know a couple of real killers that's Catholic\nWhite boys that speed blacks cleanin' they ratchets\nIn the bloodline Osiris, I'm the only Muslim in the pool\nThey know I put that work in like a pirate\nJails you slap the ox in the green jello\nCarvin' your face is like the sound of a sweet demo\nSwiss knives intimidate Roscoe\nBlood drippin' over my crisp Nike's\nThe streets the TECs spit like tobasco\nNever sip the blue shit or pink Rose'\nThat's more for like pretty women, you so lame\nSo if you wanna get physical\nStaten Island goons is in the cut\nTony Starks play the front like my genitials\n\n[Interlude: Swizz Beatz] (Busta Rhymes) {DMX}\nI said wait!\n(And y'all thought I was makin' a movie already huh?)\n(Welcome home dog! Aw shucks man!)\nI said wait...Stop the party\n{Grrrrrrrrrrrrr! Woo!}\nI don't wanna hurt nobody but!\n{Arf! Arf!}\n\n[Verse Five: DMX]\nI went away for a minute, it's like I'm back from the dead (Yea!)\nRelapse on you niggas, and crack some heads (Aight!)\nLemme see - my plate's empty, yours is full\nYou suck, real talk, c'mon with the bull!\nGuns clap like applause (Yea!), tap tap on the doors (Yea!)\nYou gon' be like, \"What's that?!,\" all you gon' hear is Blap! thru the walls (Yea!)\nI rep for the town that said 'Fuck Pataki! (Aight!)\nNiggas from Clinton, Comstock and Coxsackie\n\n[Hook: Swizz Beatz]", "image": "https://images.genius.com/54314abfbbbf16253d72455428cc44e6.834x834x1.jpg"}], "artist": "Busta Rhymes"}