{"songs": [{"title": "Shake This (Street)", "album": null, "year": null, "lyrics": "[Intro: Royce]\nBein enlightened, is no longer enough\nYou must apply\nBein willin is no longer acceptable\nYou must do, make it count\n\n[Chorus: Royce Da 5'9\"]\nNa-na-now, now\nI, I, I gotta shake this\nNa-na-now, na-na-now, now\nI gotta, I gotta\nI gotta shake this jail shit off me\nHe ain't gon' never sell, he gon' fail shit off me\nI, I, I gotta shake this weak shit off me\nKeep shit off me, leave it in the streets like bitch GET OFF ME!\n\n[Royce Da 5'9\"]\n1977, July 5th\nConceived immaculately was me, my mom's gift\nUnwrapped right there in the room like Christmas\nMy mind has been designed to do light distance\nRun whole laps around y'all with my thoughts\nYou ain't hold back on yours, naw that's my fault\nNow picture me fallin, all the way to the bottom\nAnd I'm layin and callin, somebody come help me\nFind my strength to stop drinkin this poison\n'fore I drown my gift, and yeah it's probably unhealthy\nCause I went so hard and woke up sober\nI lost my good friend and broke up soldiers\nLoco, goin hard as a locomotive\nSelf-loathin like I ain't chosen\nChose to bless souls, get exposed\nJust know that I ain't foldin, huh\nI gotta shake this\n\n[Chorus]\n[Royce Da 5'9\"]\nSeptember 18th, 2-oh-oh-6\nI roll up in the court thinkin \"This should go quick\"\nOn some couple thousand dollar suit type shit\nFrom behind thousand dollar Cartier scripts\nI witness my world tumble down like bricks\nTwo words she slurred, and it sounded like this (this)\nOne year (one year) travel through the room like moonlight\nThrough the darkness, ooh it's heartless\nHow could, I beat two felonies then\nTurn around and lose like (lose like) like this!\nMy lawyer sayin stay calm, people sayin pray for him\nThey lockin my black ass up, like Akon\nMy wife at the crib goin crazy\nPregnant, yellin \"I ain't havin no more babies!\"\nPeople sayin Preem ain't fuckin with me no mo'\nNiggas in the pen' lookin homo, NO!\nI gotta shake this\n\n[Chorus]\n[Royce Da 5'9\"]\n(Yes!) Fresh outta jail feelin like Christopher Walken\nThe king of my city, swingin my dick as I'm walkin\nUp to the 7-50, I open the door\nMy cuz and like several bitches make up the decor\nI look in, he got a company porns\nI tell him \"Nah I'm good, I woulda chubbed her before\"\nI'm a new man but I could fuck with a whore\nNigga my dick's so hard it's probably touchin the floor\nRidin round in the back of a black luxury toy\nGettin sucked, like niggas cannot FUCK with me boy!\nWhen I look in the mirror, all I see is the real\nYou niggas shouldn't be here, R.I.P. if you will\nI'm the moment of truth (truth)\nI'm the only significant thing roamin the scene soon as I go in the booth\nI'ma do it this time, I'm feelin really defined\nUnsigned to signed, nigga the city is mines\n\n[Chorus]\n\n[Outro: Royce]\nBitch get off me!\nYeah, get off me!\nBitch get off me!\nNow do that make me a liar?\nGET OFF ME!\nGET OFF ME!\nGET OFF ME!", "image": "https://images.genius.com/892233b049a8da052593a9b4030be708.988x988x1.png"}], "artist": "Royce da 5'9'’"}