{"songs": [{"title": "Drop Off", "album": "Birth of a Prince", "year": "2003-10-07", "lyrics": "Yo, yo, yo, yo Bobby\nWhat up, what up? I can't really hear you\nAiyo, I left ten pounds in the trunk and I gave Sha' ten\nMake sure he drops them shits off\nI'm on my way back to Mexico to pick up another hundred\nCan you hear me? Can you hear me?\nYo make the drop off, don't forget man\nYo, I got niggas on the block, block\nNiggas with them gats, gats\nNiggas on the strip, strip\nPuffin' them packs, packs\nTo my workers that stays sharp like razors\nPlay my part and blaze it, we braveheart with paper\nMy niggas got that Dutch, Dutch\nNiggas got that black, black\nNiggas got a bitch, bitch, head in they lap, lap\nMy team ain't wit' it, we dreamed and did it\nLeaned and pivot, schemed for digits\nEverything you seen, we lived it\nNigga front then we get at duke\nDick hard like statues go to hole like Shaq do\nI cut you like a cantelope\nLike Iverson the truth and the answer\nI'm the poison and the antidote\nDon't care if the bitch cute, we don't sex raw\nWe play the corners like the castles on a chess board\nUp in the Lex 4, drinkin' a Beck's boy\nShoppin' in the best stores, I'm the nigga to check for\nWanna spend our cheese, smoke all our weed\nNo tattoo on titties sayin', \"F R E\"\nAnd my nigga Crizzee baby, and my nigga Digi baby\nWanna spend our cheese, smoke all our weed\nNo tattoo on titties sayin', \"Bob Digi\"\nOr ShaCrizzee baby, or Lil' Frizzee baby\nBobby, stop\nBobby, the cops is comin'\nThat shit is tight girl\nHey you\nFuck that mothafucka\nYou know how I do\nUp in the drop-top Boxter headin' the opposite\nDirection of the cop inside the chopper\nI got the tall Grey Goose vodka\nThis bitch on my side, with no panties, finger pop her\nTen pounds of skunk up in the front trunk\nBird like hittin' a blunt, about to cum, and I'm pinchin' her cunt\nNinety miles per hour I'm like, \"Fuck these punks\"\nIt's the land of the free, son, you only live once\nYou a smart motherfucker or stupid dunce?\nMusic blastin', she orgasm like a singer\nSweet, wet pussy got all over my fingers\nNow I'm sniffin' my hand, all sippin' the plan\nGot the pedal to the floor, goin' swift as I can\nHit the exit, chk-chk-chuh, make the left quick\nHit the garage and slip inside the Lexus\nI got many whips, many clips, many chicks\nAnd my dick's been sucked by many lips\nMany tips or many Vicks, many sticks\nAnd love to gulp with plenty chips\nHe got many whips, many clips, many chicks\nAnd his dick's been sucked by many lips\nMany tips or many Vicks, many sticks\nAnd love to fuck with plenty chips\nWanna spend our cheese, smoke all our weed\nNo tattoo on titties, sayin', \"F R E\"\nAnd my nigga Crizzee baby, and my nigga Digi baby\nWanna spend our cheese, smoke all our weed\nNo tattoo on titties sayin', \"Bob Digi\"\nOr ShaCrizzee baby, or Lil' Frizzee baby", "image": "https://images.genius.com/0b55b2ec40b427a658f9839bb61bb1e8.600x600x1.png"}], "artist": "RZA"}