{"songs": [{"title": "H.O.C.", "album": "Overly Dedicated", "year": "2010-09-14", "lyrics": "[Produced by The Drop]\n\n[Intro]\nH.O.C., H.O.C\nAll the real smokers get me H.O.C\nAll the real smokers get me H.O.C\nH.O.C., H.O.C\nAll the real smokers get me H.O.C\nAll the real smokers get me H.O.C\n\n[Verse 1]\nEverybody know I spit that other shit\nShit that make you duck for cover shit\nShit that make you hop out your seat and slap your mother shit\nEspecially when Drop drop the beat\nI drop jewels like my nuts dropped out of my briefs\nJump in the booth and shatter every rapper's dream\nThey jump in a sauna because I killed their self-esteem\nThat's a jab, you should bob and weave\nLike Pam when Martin pulled jokes out his sleeve\nI go in studio sessions and feel like a nerd\nCause I'm the only nigga there not smoking no herb\nYou telling me the kush make you think on level four?\nI'm on five, you saying that I can level more?\nIn high school, my teachers thought I was smoking stress\nDidn't know my eyes low cause of genetic defects\nI stimulate my mind every time I think about the end of time\nCreation of man, and Columbine\n\n[Chorus]\nBet you think that this some high shit that I wrote\nProbably think I'm off the kush or the hydro\n(Nope) I don't even smoke, I don't even smoke\nI don't even smoke, I don't even smoke\nI really appreciate that you share your Indo\nBut a sip of Henny is the farthest I would go\nI don't even smoke, I don't even smoke\nI don't even smoke, I don't even smoke\n\n[Verse 2]\nLook, nowadays everybody think they're big chiefers\nJust cause they heard that new tape from Wiz Khalifa\nKnowing damn well they can't hit the sour\nThey're new booties, they probably need baby powder\nMy skill shower over your city for 40 days\n40 nights, off the chain, like freedom of slaves\nBefore you get it twisted, like 40 gays\nMy flow worth the earth, that's not to be appraised\nThose the type of lines that I'm talking 'bout\nYou know the type of rhymes you don't talk about\nCopy my session on a disc when the session ends\nSo my momma can have it and play it for her friends\nBrag on me, like \"My son's 'bout to win\nSomehow, someday, and I don't care when\"\nI might hit the gin once a month\nI'll let you inhale, like an atheist\n\n[Chorus]\nBet you think that this some high shit that I wrote\nProbably think I'm off the kush or the hydro\n(Nope) I don't even smoke, I don't even smoke\nI don't even smoke, I don't even smoke\nI really appreciate that you share your Indo\nBut a sip of Henny is the farthest I would go\nI don't even smoke, I don't even smoke\nI don't even smoke, I don't even smoke\n\n[Verse 3]\nI'll take you back to the 9th grade\nWhen Dough Boy had me high for 4 days\nThat's my nigga, he a street nigga\nProbably in your hood, fucking up your street, nigga\nBut anyway I think it was some purple\nTold me \"Don't hit it hard because it'll hurt you\"\nI didn't listen, I was floating like the Rose Parade\nSwear to God a nigga seen some flying fishes\nThat was the Vegas trip, Hooters sponsored\nThe same time I start writing like a fucking monster\nI'm Frankenstein every time this mothafucker ponders\nJust underline every letter, capital K-D-O-T\nLaying it flat out, like a tire with slow leaks\nNow what you 'bout? Nothing huh\nAm I a square cause I don't puff a square?\nAre my raps too blunt to hit the blunt? Yeah\n\n[Chorus]\nBet you think that this some high shit that I wrote\nProbably think I'm off the kush or the hydro\n(Nope) I don't even smoke, I don't even smoke\nI don't even smoke, I don't even smoke\nI really appreciate that you share your Indo\nBut a sip of Henny is the farthest I would go\nI don't even smoke, I don't even smoke\nI don't even smoke, I don't even smoke\n\n[Outro]\nH.O.C., H.O.C\nAll the real smokers give me H.O.C\n(Bitch I'm blowed!)", "image": "https://images.genius.com/9e1efc6d0a7044dbf2f0776a12ed85b8.620x620x1.jpg"}], "artist": "Kendrick Lamar"}