{"songs": [{"title": "Casualties of War", "album": "Don’t Sweat the Technique", "year": "1992-06-23", "lyrics": "[Verse 1]\nCasualties of war; as I approach the barricade\nWhere's the enemy? Who do I invade?\nBullets of Teflon, bulletproof vest rip\nTear ya outta ya frame with a bag full of clips\nCause I got a family that waits for my return\nTo get back home is my main concern\nI'ma get back to New York in one piece\nBut I'm bent in the sand that is hot as the city streets\nSky lights up like fireworks blind me\nBullets, whistlin' over my head remind me\nPresident Bush said attack\nFlashback to Nam, I might not make it back\nMissile hits the area, screams wake me up\nFrom a war of dreams, heat up the M-16\nBasic training, trained for torture\nTake no prisoners, and I just caught ya\nAddicted to murder, send more body bags\nThey can't identify em, leave the name tags\nI get a rush when I see blood, dead bodies on the floor\nCausalities of war\n\n[Hook]\nCausalities of war\nCausalities of war\nCausalities of war\n\n[Verse 2]\nDay divides the night and night divides the day\nIt's all hard work and no play\nMore than combat, it's far beyond that\nCause I got a kill or be killed kind of attack\nArea's mapped out, there'll be no, Stratego\nMe and my platoon make a boom wherever we go\nBut what are we here for? Who's on the other side of the wall?\nSomebody give the President a call\nBut I hear warfare scream through the air\nBack to the battlegrounds, it's war they declare\nA Desert Storm: let's see who reigns supreme\nSomething like Monopoly: a government scheme\nGo to the Army, be all you can be\nAnother dead soldier? Hell no, not me\nSo I start letting off ammunition in every direction\nAllah is my only protection\nBut wait a minute, Saddam Hussein prays the same\nAnd this is Asia, from where I came\nI'm on the wrong side, so change the target\nShooting at the general; and where's the sergeant?\nBlame it on John Hardy Hawkins for bringing me to America\nNow it's mass hysteria\nI get a rush when I see blood, dead bodies on the floor\nCausalities of war\n\n[Hook]\nCausalities of war\nCausalities of war\nCausalities of war\n\n[Verse 3]\nThe war is over, for now at least\nJust because they lost it don't mean it's peace\nIt's a long way home, it's a lot to think about\nWhole generation, left in doubt\nInnocent families killed in the midst\nIt'll be more dead people after this\nSo I'm glad to be alive and walkin'\nHalf of my platoon came home in coffin\nExcept the general, buried in the Storm\nIn bits and pieces no need to look for em\nI played it slick and got away with it\nRigged it up so they would think they did it\nNow I'm home on reserves and you can bet\nWhen THEY call, I'm going AWOL\nCause it ain't no way I'm going back to war\nWhen I don't know who or what I'm fighting for\nSo I wait for terrorists to attack\nEvery time a truck backfires I fire back\nI look for shelter when a plane is over me\nRemember Pearl Harbor? New York could be over, G\nKamikaze, strapped with bombs\nNo peace in the East, they want revenge for Saddam\nDid I hear gunshots, or thunder?\nNo time to wonder, somebody's going under\nPut on my fatigues and my camouflage\nTake control, cause I'm in charge\nWhen I snapped out of it, it was blood, dead bodies on the floor\nCausalities of war\n\n[Hook]\nCausalities of war\nCausalities of war\nCausalities of war", "image": "https://images.genius.com/c242f8367734db09ac26eb1c1bbcee98.900x900x1.jpg"}], "artist": "Eric B. & Rakim"}