{"songs": [{"title": "K.O.D.", "album": "K.O.D.", "year": "2009-10-26", "lyrics": "[Intro: Tech N9ne]\nMhm, okay\nI hear you\nNo\nYes\nI'm your servant\nI have the plan\nAnd I'll give it to 'em\nLike you told me to\n\n[Verse 1: Tech N9ne]\nWanna live in my world you have to have a Tech tat\nPreferably the number N9ne and you gotta get it\nWhere the back of you neck's at\nThat'll let me know that you rep that, plus get you out of a death trap\nYou need it for living 'cause I'm the king\nAnd I'm giving you the permission to get with a no stress pact\nNovus Ordo Seclorum 'cause the old world orders' post mortem\nIt's failure inhaling sailing delta\nWatched it swell and swelter\n'Til there was no male in shelter\nYes I'm the one that provided ya shell in hell and held ya\nWhen your politicians were welchers\nSo I built this structure just to help ya\nSo the communists can't come and quell ya\nThey call me the King of Darkness when I offer you no pain\nWhy would they label me heartless when your love is my cocaine\nAnd your soul is my rogaine, I have a thirst to know your brain\nWhen you enter my domain gotta take this number for your name\nBut you don't have to drink cyanide, I'm gonna be right by your side\nIf we gotta take that riot ride on the enemy and defy your side\nFight for the place we're building\nFor the reproduction of more children\nTrying to get that number back around 6 billion\nI'm gonna rule until then\nFounded this colony like a pilgrim\nAnybody try to penetrate this section or threaten we KILL THEM\n\n[Hook: Mackenzie O'Guin]\nWhat if?\nK. O. D. oh K. O. D. oh\nWhat if, he is, what he says he is?\nThe King Of Darkness!\nK. O. D. oh K. O. D. oh\nWhat if, he is, what he says he is?\nThe King Of Darkness!\n\n[Verse 2: Tech N9ne]\nXes lliw eb yrotadnam yliad\nYlthgin, this women need to be living by it\nStay fit n' way driven paste it and dye it\nI am the king killer captain crazed frigging pilot\nGiving you these khaki pants and white shirt\nThat's what you wear on my Earth\nEliminating your eye thirst to have any kind of desires\nTo envy material or admire, my way will extract any type of divider\nI'm offering this wider\nUnderstanding of life entirely\nBlissfully evading friction and fire, chea\nThe number N9ne will get you food, even get you tools\nTo build anything your family choose, but within my rules\nAll white shoes with red strings for all my crews\nThat lets me know you Tech's people listening inside my pews\nAll your dreams and aspirations, this is the affirmation\nThat you can reach 'em in my world it's not a disaster waiting\nNo bruises and lacerations no choosers of aggravation\nI'm just try'na rehab a nation from exasperation\nIt's not an exaggeration, I'm something more than your blood and gore\nOn a level higher than devils or that of Satan\n\n[Hook: Mackenzie O'Guin]\nWhat if?\nK. O. D. oh K. O. D. oh\nWhat if, he is, what he says he is?\nThe King Of Darkness!\nK. O. D. oh K. O. D. oh\nWhat if, he is, what he says he is?\nThe King Of Darkness!\n\n[Verse 3: Tech N9ne]\nWhen I did \"Anghellic\" I was good and bad, straight confused\nThen an angel turned to Devil Boy when the Reparation blew\nThen demons had \"Absolute Power\" when I drug abused\nSo the angels searched for the \"Vintage Tech\"\nBut they found that the love was through\nThen an accident would happen that made life look necessary\nSo now receiving God, the angel was \"Everready\"\nBut the Melancholy strikes, the loving angels mommy's life\nSo the Misery sat in the angels now becoming ice\nSo as mom got ill and iller, when it hurts her he can feel her\nTo the strain of the pain made him bane\nThere's no more angel straight up KILLER!\nMy apologies, it's not very God of me\nTo go crazy and try to teach the whole world \"Sickology\"\nI was then split in two, back to the beginning view\nAngel/demon 'cause the killer showed me death was overdue\nBut I gotta live for my kids, all the evil stuff I did\nTaught me to teach you, you can love big no matter how much mud you dig\nOr dug, you met my demon back when I had that grudge\nBut I gotta let you know most of my spirit comes from up above\nI'm mostly angel, and you know sometime we fall\nLiving under God and I hope it's listening when I say I love you all!", "image": "https://images.genius.com/de5c12836aa9b9bbb55356aafbf1fa0a.900x900x1.jpg"}], "artist": "Tech N9ne"}