{"songs": [{"title": "In Kindergarten", "album": null, "year": null, "lyrics": "[Intro]\nWhen I was a kid, back in kindergarten\nThat's when I was a kid, you know? What does it mean?\nYeah, yeah, ah-ha-ha-ha-ha\nYeah, um do you–\nYeah, damn\n\n[Verse 1]\nWe been doin' this since you was still in diapers\nKeep it movin' like the wipers, cameras shoot us like a sniper\nI had dreams of fuckin' me an R&B bitch\nI am the melody, who's tellin' me where harmony is?\nIt's all been a trip like dollars that I drop on my whip\nI keep a girl, but when I'm with my friends, I call her my bitch\nAsshole, I'ma need an evolution, just illusion\nI'm out in space, there's no one left but Houston\nI'm at the studio, I'll prolly take some acid after, but\nRight now, me, Evan Adams watchin' battle rappers\nFilet with every flow, you more like kale, bruh\nIllest since I've been in it, don't know what else I can tell ya\nAnd I don't watch TV shows no more\n'Cause I got too much on my plate, I'm never home no more\nI'm smokin' cigarettes, they fuckin' up my vocal cords\n(Alright, after that)\n\n[Chorus]\nI like me 'xactly how I is, yeah\nI like me 'xactly how I is\nI like me 'xactly how I is\nI like me 'xactly how I is\n\n[Verse 2]\nAnd I'm in a, I been the hardest since kindergarten kickball\nFeelin' such a drug and I've been goin' through the withdrawl\nI'm involved with shit that'd kill y'all if you would try it\nThey worry about my crazy ass, but nah, I'm just a ride\nFlow is ultraviolet, I alter minds up when I open up\nCold as fuck, literally stuck in bed, pneumonia\nI'm Obi-Wan Kinobi, bruh, surroundin' sound like Dolby does\nFisherman, slangin' bitches dick, I got the Moby plug\nSummer's built to last, summer's built to crumble\nAnd I ain't sayin' I ain't lyin' in the jungle\nI'm in Tribeca chillin', feelin' like the daily double\nWho you playin' with? I came for trouble\nAnd I send my bitch runnin' to the store real quick\nTold her bring me somethin' good, none of that healthy shit\nWho else you know that's out here raisin' hell like Lyft?\nI can only be myself, that's it\n\n[Chorus]\nI like me 'xactly how I is\nI like me 'xactly how I is\nI like me 'xactly how I is\nI like me 'xactly how I is", "image": "https://images.genius.com/70b2ca5e1882a2f184d45a2e6ccb37eb.916x916x1.jpg"}], "artist": "Mac Miller"}