{"songs": [{"title": "Let Me Get Down", "album": "Born Again", "year": "1999-12-07", "lyrics": "[Verse 1: Notorious B.I.G.]\nTo my motherfuckin man 50 Grand, the alcoholic man\nInject a tall can in his bloodstream if he can\nBiggie Smalls, the pussy stroker\nMC provoker, chocolate thai smoker HEAR??\nI like to max in Maximas and Acuras\nYour girl buttcheeks I'm smackin HER\nThe raw rapper, spine snapper\nWith the little hookers on my lap-ah\nYou know the flavor Mack-ah\nA shy nigga but I ain't your fuckin comforter\nAnd if I ever fall in love I bet I'm fuckin her\nAsk the hooker, if I didn't jook her\nIf she tried to front, then I drop the Chuckii Booker on her:\n\"Why you wanna...play your games on me\"\nBitch, you crazy?\nCommitments, I'm Swayze, no time for the ill shit\nRest with the niggas on that real bloodspill shit\nMy rap-pin tac-tics are drastic\nStretchin motherfuckers like Mr. Fantastic\nSo if you wanna see my pedigreeeee\nYou better be, filled with energy, niggas never gettin me\nSo let me get down, let me get down, let me get down, let me get down\n\n[Hook: Craig Mack]\nHahhhh, AHHHHHHHH HAH\nLet me get down, let me get down, let me get down, let me get down\n(Hahhhh boy, let me get down and funk em)\nYo let me get down, let me get down, let me get down, let me get down\n(Yeah.. uh-huh.. yeah)\nYo let me get down, let me get down, let me get down, let me get down\n(Yo, I just wanna get 'em)\n\n[Verse 2: G-Dep]\nYeah, yo\nOdds even, said shoot (blaow)\nAsked me the reason, and I said loot\nMan that's all I'm here for, therefore\nWhen death declares war, you know what to prepare for\nShit, one for shelter, book flights on Delta\nLive on your station, the radiation'll melt ya\nCool - I guess your momma raised a fool\nYou didn't wanna blaze your tool shoulda stayed in school\nRap terror, shots through your new era\nGet it together, y'all niggas shoulda knew better\nI'm on point like acupuncture\nI might, track and hunt ya, smack and punch ya\nLeft side, right side, witcha ho I might slide\nRunnin' wit' this big guy, y'all niggas is pint-size\nDon't make a nigga have to show you the pound\nAnd show you the sound, that'll put you low in the ground\nJust let me get down\n\n[Hook: Craig Mack]\nLet me get down, let me get down, let me get down, let me get down\n(What? What?)\nLet me get down, let me get down, let me get down, let me get down\n(I just wanna funk a little bit)\nYo let me get down, let me get down, let me get down, let me get down\n(Hahh.. I just wanna funk, what? Ahhhh)\nLet me get down, let me get down, let me get down, let me get down\n\n[Verse 3: Missy Elliott]\nI be like: \"Whaaaat?\" Let me clear my throat\nBreak the smoke, Missy gotta hit some high notes\nHeyy! Yo, from coast to coast I burn like toast\nSo dope that I floats through snow, nig-guh\nOh, you don't wanna battle me\nThe agony be like: \"Somebody help me, please!\"\nFeel my pressure, never could a bitch flow better\nIn any weather, I biddy-bang-bang in ya, nigga\nAh-huh, I used to be the chick to lick the lollipop\nNow I pop through your body parts\nBlaow, blaow! You like the way I interact\nProceed to smack, any MC that's wack\nAh-huh, microphone check one two\nI do ya tool like them freaks run through your crew\nGive it to me, ohh, send it to me, ohh\nBut before I get down, where's my money?\nLet me get down\n\n[Hook: Craig Mack]\nLet me get down, let me get down, let me get down, let me get down\n(Hahhh.. boyeee)\nLet me get down, let me get down, let me get down, let me get down\n(I just wanna funk a little bit)\nYo let me get down, let me get down, let me get down, let me get down\n(Hahh.. I just wanna funk)\nLet me get down, let me get down, let me get down, let me get down\n(The Mackalicious funk wanna get down.. boyeeeeeee, HAHHH, AHHHH-HAH\nMack, feelin the funk)\n\n[Outro: Notorious B.I.G.]\nBringin' it live to you bitch ass niggas", "image": "https://images.genius.com/5fa56d7da6cf3fe54995d91d7120c735.500x500x1.jpg"}], "artist": "The Notorious B.I.G."}