{"songs": [{"title": "Ultimate Rush", "album": "Duets: The Final Chapter", "year": "2005-12-20", "lyrics": "[Intro: Missy] + (B.I.G.)\nUh (uh)\nCome on (uh)\nIt goes B to the I to the G so proper\nMissy and Big Poppa (Check it out)\nCall us chief knockers\n\n[Hook: Notorious B.I.G.]\nDamn Ma, I love you like the lah, the ganja\nSensimilla, can I feel ya\nAll I wanna do is touch ya\nThe ultimate rush, you're drugs baby\n\n[Missy]\nDon't you know I'm the ultimate? To get this nookie, be fortunate\nJust like tastin pussy with pork in it\nPeople stop when I'm walkin in, I'm twist-in twistin 'em\nBack on ten, I'm talkin 'bout like when Mase come back again\nMy ski's is immaculate, my paper stackin keep trackin\nI'm mackin yo slackin, reaction makes ya'll dicks grin\nI'm mo' better than gold diggers with figures\nMo' bigger than Jigga's and even Paris Hilton's\nDamn sir, sniff me like the coke, three lines\nMe won't give you none\nSent amilia, all you wanna do is sniff me\nThe ultimate rush, get high baby\nDamn sir, sniff me like the coke, three lines\nMe won't give you none\nSent amilia, all you wanna do is sniff me\nThe ultimate rush, the drugs baby\n\n[Hook 2x] (w/ Biggie ad-libs)\n\n[Verse Two: B.I.G. & Missy Elliott\nNow Biggie Smalls is not the type to fall in love with 'em\nHit 'em and forget 'em and go handle my business\nI like the kind of whine and dine, who grindin' all the time\nYo ex girl was a fly, but now lucked up on a dime, nigga\nWhat is it with you, all you wanna do is lay around\nAnd stay around and get mad when I play around\nI like to lay never work, put your money in my purse\nTo the mall, I go search matchin' shoes for my skirt\nTuesday I saw you on the zee, but you still wanna get wit me\nWednesday is the Benz day, that's what your friends say\nMe and my friends got your Benz, attractin' mens\nAnd spendin' dividends, blowin' like the wind\n\n[Hook 2x] (w/ Biggie ad-libs)\n\n[Verse Three: B.I.G. & Missy Elliott]\nSo I guess you think I'm slippin' cause I ain't flippin'\nBaby, I'm Big Poppa, ain't no need to be trippin'\nI ain't trippin' nor flippin', I'm just liquor sippin'\nAt the bar, tippin' wit your money, can you pay the difference?\nIt seems like it's a waste of time, that's why I wrote the rhyme\nI hear you jump in every car, except for mines\nNigga, I don't jump in cars, I'm a superstar\nFace way to flaw, you should hang me on your wall\nAll I do all day is drink Tanqueray\nThinking of a way to put a smile on your face\nMake me smile, see them teeth, me look cute down to them features\nMy waste, my physique, me don't want freak-a-leek\nShould I wine and dine? You put ring on your fingers\nWhile sex from the next man in the bedroom lingers\nSex will never linger, hold up, put up the blinkers\nI flow just like sprinklers, give yo ass the middle finger\nYou better slow your roll baby, you ain't got enough dough to pay me\nYou know the pin number, just page me when you will baby\n\n[Hook 2x] (w/ Missy ad-libs)", "image": "https://images.genius.com/09b1732dbce927085a1fca7538fc1bb3.500x500x1.jpg"}], "artist": "The Notorious B.I.G."}