{"songs": [{"title": "Light Speed", "album": "2001", "year": "1999-11-16", "lyrics": "[Dr. Dre]\nHey, yo, whassup?\nMy name is Dre\nCan I blaze some chronic witchu?\n\n[Girl]\nNigga, what? Fo' sho'!\nRoll that shit up!\n\n[Verse 1: Dr. Dre]\nHell yeah, still Alwayz Into Somethin\nHeart still in Compton\nThe comp can't oppose, dope Cali platinum classicals\nIntroduced you to my Doggs, that don't love hoes\nAnd Firm Fiascoes—assholes\nFucked you up with my last video, tuxed up\nDoing a tango\nAnd cash, always in my grasp\nCame up in the game wearin' khakis not kangols, stranglin' hoes\nWhen asked about it in most interviews I just laugh\nNow I vacate with hoes with a gang of ass\nOne feedin' me mangoes, the other lightin' my hash\nRap tabloids write Dre's light in the ass (What?)\nCame home uptight, ready to mash\nLike a gas pedal, get on that '64 Chevy level\nAK-47 heavy metal\nWho say Dre ain't ghetto? Just whistle like a tea kettle\nI throw three at you, tell me if you see devils\n'Cause we rebels over here, I smell chronic in the air\nThat means we takin' over this year\nYou hear?\n\n[Girl] Chronic, 2000\n[KRS-One] \"One!\"\n[Dr. Dre] That means we takin' over this year, ya hear?\n\n[Hook: Ms. Roq & Knoc-Turn'al]\nLight Speed, blazin' Chronic through the galaxy\nHydro, doja, chocolate Thai weed\nOr we might be sippin' on gin or Hennessey\nFuck that, where that new shit, The Chronic Iced Teas?\n\n[Verse 2: Hittman]\nI hang among hustlers, that slang and Hoo-bang Bronson\nWhen bustaz roll through, can't fuck with my bold crew\nWe will hold you captive and bust\n'Cause gangbangin' is the active, activity\nWhere I be livin', B, there ain't no Liberty Statue\nHope you got your gat, don't let them catch you\nSlippin', without yours, it's warfare outdoors\nAmbulance, violent uproars\nTrash niggas takin' out like chores\nI meet whores on tours\nJeanie`s hot as pepper so I sip, champagne on stormy shores\nB on some hardcore, pornographic\nToting Austrian firearms that's made out of plastic\nIn these drastic surroundings, it be sounding like Lebanon\nMakin' fools \"Retreat!\" like Megatron and Starscream\nOh yeah I scream on stars\nThat get loot then crossover like Kareem Abdul-Jabbar\nGet out your car son, that's how I came to bougie niggas\nAt Bar One, it's either that or make front page stardom\nI'm the Golden Child, chased by Sardo Numpsay\nBut God's my bulletproof, it's hard to shoot me, you hear?\n\nBy the time you see him *Two gun shots*\nThat means it's real fuckin' hard to shoot me, you hear?\n\n[Hook: Ms. Roq & Knoc-Turn'al]\nLight Speed, blazin' Chronic through the galaxy\nHydro, doja, chocolate Thai weed\nOr we might be sippin' on gin or Hennessey\nFuck that, where that new shit, The Chronic Iced Teas?", "image": "https://images.genius.com/f9713af0f8164e90022b622002fda842.600x596x1.jpg"}], "artist": "Dr. Dre"}