{"songs": [{"title": "The corner", "album": null, "year": null, "lyrics": "[Intro: Meek Mill]\nM-m-m-m-a\nNo, no, no, no, no, no\nThese hoes, they like niggas that spend money, not talk about it\nIf you ain't gonna get the money then watcha gonna do?\nHey!\n\n[Hook: Meek Mill]\nI graduated from the streets, no diploma\nI made a million on that corner\nI mixed pedico with baking soda\nI made a million on that corner\nGoing Donald Trump numbers on the corner\nI made a million on that corner\nGraduated from the streets, no diploma\nI made a million on that corner\nI made a million on that, I made a million on that\nI made a million on that corner\n\n[Verse 1: Meek Mill]\nYoung rich nigga, I flex, look at my neck\nLook at my bitch, look at my wrist, got these niggas upset\nWho you know blow a mill? Don't even think twice, no sweat\nAnd these hoes around me?\nYou don't fuck, you don't give them no check\nCause ya'll niggas lame as fuck, none of these chumps can't hang with us\nAll these chains getting tangled up\nAnd my clique armed and dangerous, and we'll flame you up\nYou get smoked mothafucker like angel dust\nStart the Rolls Royce with the angel up\nAll these niggas on angels bruh, but I got stripes like a bengal does\nAnd my wrist look like the flash on\nCome that ho and bring that ass on\nSo I can beat it up like you stole something\nMight pop a purple, go mad long like skrrt\nBeen through your hood in a wraith, niggas is jealous, just look at your face\n3-57 get put in your place, follow my lead all you niggas is late\nLike hold up, hold up, I done made a million on that corner\nI bought some coke but couldn't deal with Arizona\nThem yellow diamonds looking clearer than Corona\nAnd if they act like they ain't with it\n\n[Hook]\n\n[Verse 2: Rick Ross]\nI'm on the corner gettin' cake\nI'm talkin' like it's 88\nGivenchy all I really play\nKingpin status when I swerve up on the block\nA nigga like you, you wouldn't even get the cock\nGet my money dolo, I just need some help to count it\nI'm the richest nigga outta Dayton-Broward County\nFeds know my game, they keep it raw, we all at odds\nRepossess my Lambo cause they wanna build a charge\nWhen they got my Chevy, got it runnin' like it's 'sposed to\nHit up on my niggas, let 'em know my shop reopened\nWe rockin' everything, till I'm right back on the top\nNasdaq hustle bitch, come get your ass in stocks\n\n[Hook]\n\n[Outro: Rick Ross]\nUgh, Double M, bang!", "image": "https://images.genius.com/6929169de7116d41676151bdea5cc773.1000x1000x1.jpg"}], "artist": "Meek Mill"}