{"songs": [{"title": "Soldier", "album": "Street Hop", "year": "2009-10-20", "lyrics": "[Verse 1: Royce Da 5'9\"]\nFresh off the jet from just fuckin with Puff\nI'm feelin like the best, nobody - bring it back\nFresh off the jet from just fuckin with Puff\nI'm feelin like the best, nobody fuckin with us\nWe done turned to a bygone don crew\nWe got the semi Kimora like Djimon Hounsou\nA lifetime criminal, live by a code we call shush\nFireman ladder flow, look at it, my bar is up\nAs you can see I'm a beast on the track\nI'm even worse, I'm the hearse with the reef on the back\nI'm like the gun at the race, son you only get one shot\nMy album is the finish line, here's where your run stops\n'bout to go fishin with a clip that's extended\nBecause your momma got a glass eye with a fish in it\n\n[Hook: Iyana Dean]\nI-I think my, niggas is soldiers\nI-I think my, bitches is gangstas\nI-I think my, niggas is soldiers\nI-I think my, I-I think (HUT!)\n\n[Verse 2: Royce Da 5'9\"]\nI get money, I get bitches, I get bored or - bring it back\nI get bitches, I get money, no specific order\nFilthy hit recorder, wipe or Ricky mixed with Ricky Porter\nButchie Jones mixed with Mr. Combs with the Tookie aura\nI'm a muh'fucker, no really I fuck mothers\nI chug bottles and pass out on they La-Z-Boy\nShe try to leave them lil' niglets with me? Shit\nI treat 'em all like I'm Snoop Dogg in \"Baby Boy\"\nLeave me alone, I'm Hancock\nLiquor sto' close I'm swoopin 'round hittin the second-hand spot\nI don't fuck with no ho unless she a dancer\nThere's no position, drug or liquor she can't try\nI'm Cancer, me versus them is a landslide\nIf your face is fly, and your body is decent\nThis your inauguration the same time your impeachment\nI got a lotta anger, I was hot before your first shit\nNot your album, but before your momma potty trained ya\n\n[Hook: Iyana Dean]\nI-I think my, niggas is soldiers\nI-I think my, bitches is gangstas\nI-I think my, niggas is soldiers\nI-I think my, I-I think (HUT!)\n\n[Verse 3: Kid Vishis]\nWhere my soldiers attack, it's a wrap, hold up\nWhen my soldiers attack, it's a wrap\nOne clap'll lay you unconscious, bullets alpha-mega slap\nCock grenade here, think we scared? No way\nSet your ass up like the cops did O.J\nFo' spray his body make his chest explode\nThe barrel on the shotty wide as KRS's nose, partner\nBuck-shot ya, rap like a automatic gun\nLungs stoppin means you can't breathe proper\nYeah, they like I'm on some other shit\nWhole clique hold heat like a oven mitt\nTo fuck with this you want me on wax\nSo I'mma tax you lil' local rappers worse than the government\nBastard, the closest you niggas been\nTo a shotgun is in the car front seat passenger\nHow 'bout you take a trip in the trunk?\nRide to the pastor for a casket to hold ya, it's over!\n\n[Hook: Iyana Dean]\nI-I think my, niggas is soldiers\nI-I think my, bitches is gangstas\nI-I think my, niggas is soldiers\nI-I think my, I-I think (HUT!)", "image": "https://images.genius.com/13187be577e518c77f5c6ac278ec366a.1000x1000x1.jpg"}], "artist": "Royce da 5'9'’"}