{"songs": [{"title": "Wine & Go Down", "album": "Year Of The Dragon", "year": "2012-08-21", "lyrics": "[Busta Rhymes]\nYo! Baby girl let me take you to the essence (Uh huh)\nGift wrapped with a ribbon girl your in my presence (Ok)\nLook at me and let the vision deliver the message\nAnd ready to lead your dude listen and give me a second\n\n[Vybz Kartel]\nHello baby gyal mi waan yuh\nAddi real big man mi call yuh\nWine yuh waist baby mi waan yuh\nPretty like flowers, inna di garden (AH WHO?)\nLong time yuh a beg fi a touch\n(SHE A HOPE AND PRAY) But I'm no Mavado (OH!)\nShe a wine like macarena\nWe haffi talk inna spanish, como te llama\n\n[Busta Rhymes]\nAiyyo you see the way I come in and how I creep up behind 'em\nLike I'm aimin with a rifle comin to seekin to find 'em\nSo many mami's let me go in just wine 'em and dine 'em\nAss big, now I'm ready to go mountain climb 'em\nAsk Spliff, the model agency now let me sign 'em\nCause they beautiful like they Botanical Garden asylum\nWhile they be with they chicks and they busy tryin to hide 'em\nYou know your nigga lame you ain't feel him standin beside 'em\n\n[Chorus: Female]\nHey! Yuh seh yuh need mi?\nHow yuh a watch mi like yuh waan breed mi?\nYuh waan every gyal fi see yuh too greedy!\nTrust mi, mi waan yuh too, believe mi\n\n[Busta Rhymes]\n(Come mek we!) Wine and go down! (Get up!)\n(Hey!) Wine and go down! (Get up!)\n(Hey!) Wine and go down! (Get up!)\n(Hey!) Wine and go down! (Get up!)\n\n[Vybz Kartel]\nOH! Mi and mi thugs everybody waan falla\nInna Desert Clarkes, Wallabees, bank robba\n\n[Busta Rhymes]\nNo! Betta know di woman love di wey mi dappa\nLongside di Gaza government di whole a dem a shotta\n\n[Vybz Kartel]\nAnd a....come yah mi darlin yuh fi be mi baby modda\nPretty like Nicki Minaj badda dan Lady Gaga\n\n[Busta Rhymes]\nYuh know yuh wey yuh pretty nuttin else nah even matta\nHow yuh nice inna di place and everyting about yuh propa\n\n[Vybz Kartel]\nSome gyal a tell mi seh mi ugly like Shabba\nSome a seh mi a di best and dem nuh see nobody badda\n\n[Busta Rhymes]\nBecause mi a di wickedest yuh see mi fresh sorta\nAnd I'm nice at what I do now let mi fuck somebody dawta\n\n[Vybz Kartel]\nOk! Mi have my set a gyal mi kill dem one anotha\nFingatip it a di dagga feel yuh leg upon di ladda\n\n[Busta Rhymes]\nAnd everytime I come you gotta know I put it on you\nBaby girl until you sleep and wake up feelin good manana\n\n[Chorus: Female]\nHey! Yuh seh yuh need mi?\nHow yuh a watch mi like yuh waan breed mi?\nYuh waan every gyal fi see yuh too greedy!\nTrust mi, mi waan yuh too, believe mi\n\n[Busta Rhymes]\n(Come mek we!) Wine and go down! (Get up!)\n(Hey!) Wine and go down! (Get up!)\n(Hey!) Wine and go down! (Get up!)\n(Hey!) Wine and go down! (Get up!)\n\n[Vybz Kartel]\nOH! Mi love yuh body baby come yah now mami\nCau dat style deh ugly Addi a tsunami fi yuh gummy\nUh! Mi be yuh Ken and yuh a fi mi Barbie dolly\nThen mi mi a di Trump, eh eh, mi waan mi dolly\nAnd a, this a nuh swagga Gaza originally\nMi nuh see nuh qualifier Street Vybz inna trolly\nMi a, a rock Molly not a don and we nuh polly\nTek a look inna di gyally pon di tower we a golly\n\n[Busta Rhymes]\nYo! So many woman we should probably have a rally\nWith Shakira and Ayana and Diana pretty Sally\nAnd di wey we tek di whole a dem and go dung in di valley\nAnd a sweep dem up and meet dem up and then we dilly dally\nAnd I dig inna di truck and then go dig inna di alley\nAnd I DIG IT OUT! Mami yah go beg fi mercy probably\nCheck mi how mi do di ting they love and woman call mi daddy\n'Til mi dun wid dem and mek di whole a dem wantin mi sorry\n\n[Chorus: Female]\nHey! Yuh seh yuh need mi?\nHow yuh a watch mi like yuh waan breed mi?\nYuh waan every gyal fi see yuh too greedy!\nTrust mi, mi waan yuh too, believe mi\n\n[Busta Rhymes]\n(Come mek we!) Wine and go down! (Get up!)\n(Hey!) Wine and go down! (Get up!)\n(Hey!) Wine and go down! (Get up!)\n(Hey!) Wine and go down! (Get up!)", "image": "https://images.genius.com/c45e2fd5ac84651b718230013703e247.500x496x1.jpg"}], "artist": "Busta Rhymes"}