{"songs": [{"title": "Life Of An Outlaw", "album": "The Don Killuminati: The 7 Day Theory", "year": "1996-09-26", "lyrics": "[Chorus: Outlawz]\nIn the life we live as thugs\nEverybody fuckin' with us so can't you see\nIt's hard to be a man\nRidin' with my guns in hand\n\n[Verse 1: 2Pac]\nWhy explain the game?\nNiggas ain't listenin', stuck in positions as victims can't stand the heat, then stay the fuck out the kitchen\nHalf these busters switchin', lookin' at me mean, itchin'\nGivin' suckers plenty space, have these bitch niggas snitchin'\nWhere are we now, guns found daily\nThe Feds trail me in hoax that they could finally nail me\nFor sellin' dope, they backwards make the track burst\nWhenever I rap, attack\nWords been known to explode on contact\nExtreme at times, blinded by my passion and fury\nLook at me laugh at my competition's flashin' my jewelry\nYou'd stay silent if you niggas knew me, truely effective\nThe shit you heard ain't do me justice, got a death wish, bitch\nRun, but face being traced, by the infrared beam\nIt seems niggas ain't recognize my team\nAin't nobody holdin' you back\nExplode the track to confetti\nUnload it, 'cause niggas ain't ready\nThe life of an outlaw\n\n[Chorus: Outlawz]\nIn the life we live as thugs\nEverybody fuckin' with us so can't you see\nIt's hard to be a man\nRidin' with my guns in hand\n\n[Verse 2: 2Pac]\nCode 3: attack formation, pull out your pistols\nKeep an eye out for the devils 'cause they itchin' to get you\nMerciless madman, screamin' kamikaze in tongue\nAutomatic gunfire, makin' all my enemies run\nWho should I call when I'm shot and bleedin'?\nIndeed a possibility that's part of chasin' cream\nDope got me hatin' fiends\nScheme with my team, just a chosen few\nMy foes victim of explosives, come closer exhale the fumes\nWe got memories, fadin' fast\nA slave for cash accelerate, mash, blast, then dash\nDon't look now! How you like it, raw?\nNiggas ain't ready for the wrath of the Outlawz\nNever surrender, death before dishonor, stay free\nI'm thugged out, fuck the world 'cause this is how they made me\nScarred but still breathin' believe in me\nAnd you could see the victory, a warrior in jewels, will you picture me?\nLife of an outlaw\n\n[Chorus: Outlawz]\nIn the life we live as thugs (no doubt)\nEverybody fuckin' with us (yes!), so can't you see (life of an outlaw)\nIt's hard to be a man (soldiers in position, attack formation)\nRidin' with my guns in hand\n(No retreat, no surrender)\n\n[Verse 3: Young Noble]\nCity under siege, it's like I can't even breathe\nI'm from the state of car thieves G.E.D. from the streets\nPlenty beef I play for keeps, arrange the whole crime scene\nMobb peep! They sneak up from behind tryin' to creep\nNo halfs with no straps, jack, it's on to bounce back\nAn ounce of wrath so bad, it snatched my style on death\nTell the gripper I was sent to get ya, snip with clippers\nGet the picture, I wrote my life down as a scripture\n\n[Verse 4: E.D.I. Mean]\nAnd still I'm lost in the land of the lonely where ain't nobody holy\nA matter of a fact, we unholy Everybody livin' soley\nFor themselves, too high strung to lend help\nTo somebody who be needin' it\nYou know we lost hope and he needin' it\nBut the evil it's forever\nBut I'm rappin' low down, scandalous like a tramp is\nAll for the street fame on how to be managed\nTo plan shit 6 months in advanced to what we plotted\nApproached the goal on swole and now I got it\n\n[Verse 5: Kastro]\nUh, I crack my window, knowin' they'd love to catch Kastro sleepin'\nAttach a strap under my pillow, hand to hand like we freakin'\nCreepin' deep into the mornin'\nPeepin' out the weak while they yawnin'\nAnd let my clout speak for itself\nNo doubt, outlaw, outta my mind outta time you're all blind\nSome kind of life of mine if K-Dog don't mind\nFindin' it funny, matter of fact, 'cause it is perhaps\nFinally I'll adapt to it, over the years as an outlaw\n\n[Bridge: 2Pac & Napoleon]\nEh, Napoleon\nWhat's up, nigga?\nWould you die for me, nigga?\nHell yeah\nWould you kill for me, nigga?\nOn my grandmother, nigga\nAyy, yo\nWhat's up\nLet's ride on them stupid bitches right now\nWatch out\n\n[Verse 6: Napolean]\nWell, now they all say that vultures and parasites\nSnakes are all alike, thug life break night\nDrink 'til we fist fight, life or death\nBut you can't win with a vest\nWon't be no breathin' for the reason, punk bitch on your breath\nI see day is dark, and I admit it's dark\nSo chase on the ave., hide your stash, beware from them marks\nAnd yo, Makaveli, give me them bullets that was left up in your belly\nAnd let me bust back to them niggas 'til they all cold and sweaty\n\n[Chorus: Outlawz]\nIn the life we live as thugs\nEverybody fuckin' with us so can't you see\nIt's hard to be a man\nRidin' with my guns in hand\nIn the life we live as thugs\nEverybody fuckin' with us so can't you see\nIt's hard to be a man\nRidin' with my guns in hand\nIn the life we live as thugs\nEverybody fuckin' with us so can't you see\nIt's hard to be a man\nRidin' with my guns in hand\nIn the life we live as thugs\nEverybody fuckin' with us so can't you see\nIt's hard to be a man\nRidin' with my guns in hand", "image": "https://images.genius.com/de81f90d8bf5ccdc5b74c71182edc9d2.600x600x1.jpg"}], "artist": "2Pac"}