{"songs": [{"title": "Back Where I Belong", "album": "G.O.A.T. (Greatest of All Time)", "year": "2000-09-12", "lyrics": "[Intro: LL Cool J]\nYo, yeah, aight after this particular practice run\nI'ma practice both verses, after this, I want you to find a spot\nThat's close to when the beat drops to the rewind point, locate point\nYou ain't gotta be on that all night, this the soundtrack\nYo, yeah, check it\nOk, alright, huh ok\n\n[Verse 1: LL Cool J]\nThe other night I was up at Farmers, politickin' with some bloods\nThey told me, \"Yo L, in the streets you ain't gettin' no love\nAnd ever since the X's and the Jiggas came out\nMy niggas ain't tryin' to the hear that smooth shit you talk about\nWhat's up with that cat Canibus? Some played you out\nWhy you didn't answer back correctly, fuck was that about?\"\nAs I sip on some Henny, and try to explain some things\nAbout the life of a legend, and all the drama it brings\nBeen gone a long time, had a lot of shit on my mind\nI decided I don't want to reach my goal if it means losing my shine\nStreets is hip-hop and I'm hip-hop, so the streets is mine\nBallin' as long as you been livin', that's a long time\nHard to stay hungry when your pockets are so fat\nYou hit a hot one in every city on the map\nAnd niggas keep sleepin' and you keep coming back\nYou know better than the gat, but niggas still wanna clap\n\n[Chorus: Ja Rule]\nIt feels so good to be back where I belong\nThe streets is where I belong\nThey had me locked down much too long\nHey hey\nIt feels so good to be back where I belong\nThe streets is where I belong\nThey had me locked down much too long\nHey\n\n[Verse 2: LL Cool J]\nSome say, \"L that's cool, but see times have changed\"\nNiggas got red bandanas, and the grill in the range\nThat gold shit is dead, niggas rock platinum chains\nTrade O.E. for Henny, Colt 45 for champagne\nHustling niggas found they way into the game\nExtorting all these so-called ballers with big names\nAnd you gotta have a squad, 'cause running from Def ain't safe\nI know you living good, but ain't no smile up on our face\nI'm like a villain, I'm representing on my lyrics\nAnd force feed the world, even if they don't want to hear it\nAs far as Canibus go, my man is hittin' his ex-broad\nI'm getting head from his new piece\nWhile 20 gang-bangers applaud, you came up with that bullshit\nSome heads sucked it up, then you dropped that garbage album\nAnd totally fucked it up, I coulda told ya I knew your moms\nFrom the after-hours spot, when I used to be up in Canada\nWith the dreads on a black block, before you dick rode Lost Boyz\nFor a ticket our to Jersey, but being the man I am\nI tried to show ya mercy, I coulda told the World\nThe way ya label hates your guts\nAnd how me and Wyclef, got together to set you up\nAnd how he gave me half your budget, don't believe me look it up\nYa A&R promotion niggas, they helped me hook it up\nI hate to be responsible, for destroying your career\nA one-hit wonder, huh\nNo wonder you disappeared, I coulda told the world\nYou get your lyrics from the internet\nThen spit 'em word for word\nLike you really a rap vet, How you take metaphors from books\nAnd put 'em in your rhyme, and how you really from Canada\nAnd you been frontin' all this time\nI heard your second album, that shit is garbage too\nLL Cool J and I did this to you\nOn that note he said\n\"Yo L, you the man\", I said peace, one love\nAnd drove off in the Lex Land\n\n[Chorus: Ja Rule]\nIt feels so good to be back where I belong\nThe streets is where I belong\nThey had me locked down much too long\nHey hey\nIt feels so good to be back where I belong\nThe streets is where I belong\nThey had me locked down much too long\nHey\n\n[Outro: LL Cool J]\nYea nigga, the jig is up nigga, huh ha\nYou know what I'm sayin'? All that bullshit you was talking\nDon't mean shit, you finish now\nI'm still the man nigga\nThe vanguard award is in my motherfuckin' living room\nYou know what I mean? come get that shit, fuck, what\nMIC still on my arm nigga, word up\nBoth arms, I'ma get another one nigga\nYou Know what I'm sayin', this LL you know how I get down\nYou should of known, when you did it\nHe probably did it to get some fame\nBut is this really what you want? Hahahahahahahha", "image": "https://images.genius.com/7d9009021acaa20a396f75cbd74c2360.1000x1000x1.jpg"}], "artist": "LL Cool J"}