{"songs": [{"title": "Heard ’Em Say", "album": "Late Registration", "year": "2005-08-30", "lyrics": "[Produced by Kanye West and Jon Brion]\n\n[Intro]\nWake up Mr. West - Mr. West - Mr. West...\nUh, yea, uh, yea, uh, yea\n\n[Verse 1: Kanye West]\nAnd I heard 'em say, nothing's ever promised tomorrow today\nFrom the Chi, like Tim it's a harder way\nSo this is in the name of love like Robert say\nBefore you ask me to go get a job today\nCan I at least get a raise of the minimum wage?\nAnd I know that the government administer AIDS\nSo I guess we just pray like the minister say\nAllāhu Akbar and throw in some hot cars\nThings we see on the screen that's not ours\nBut these niggas from the hood so these dreams not far\nWhere I'm from the dope boys is the rock stars\nBut they can't cop cars without seeing cop cars\nI guess they want us all behind bars - I know it\n\n[Hook: Kanye West & Adam Levine]\nUh, and I heard 'em say (Ooh), nothing's ever promised tomorrow today\nAnd I heard 'em say\nNothing's ever promised tomorrow today (Nothing's ever promised tomorrow today)\nBut we'll a find a way\nAnd nothing last forever but be honest babe\nIt hurts but it may be the only way\n\n[Verse 2: Kanye West]\nThey say people in your life are seasons\nAnd anything that happen is for a reason\nAnd niggas gun clapping and keep to squeezing\nAnd Gran keep praying and keep believing\nIn Jesus, and one day that you see him\n'Til then walk in his footsteps and try to be him\nThe devil is alive I feel him breathin\nClaiming money is the key, so keep on dreamin\nAnd put them lottery tickets just to tease us\nMy Aunt Pam can't put them cigarettes down\nSo now my little cousin smokin' them cigarettes now\nHis job try to claim that he too niggerish now\nIs it 'cause his skin blacker than licorice now?\nI can't figure it out, I'm sick of it now\n\n[Hook: Kanye West & Adam Levine]\nUh, and I heard 'em say (Ooh), nothing's ever promised tomorrow today\nAnd I heard 'em say\nNothing's ever promised tomorrow today (Nothing's ever promised tomorrow today)\nBut we'll a find a way\nAnd nothing last forever but be honest babe\nIt hurts but it may be the only way\n\n[Post-Hook: Adam Levine]\nWith every worthless word we get more far away\nAnd nothing's ever promised tomorrow today\nAnd nothing last forever but be honest babe\nIt hurts but it may be the only way\nOohh, Oohh, Oohh, Oohh\n\n[Outro: Kanye West]\nUh, yea, uh, yea, uh, yea", "image": "https://images.rapgenius.com/4a29975c1ce0ed60a18df436b3c28622.300x300x1.jpg"}], "artist": "Kanye West"}