{"songs": [{"title": "Outta Time", "album": "FUTURE", "year": "2017-02-17", "lyrics": "[Intro]\nSuper!\nI see you makin' hella noise, but I ain't enthused\nFeed me Don, Don, Don, Don Perignon\n\n[Bridge]\nGotta be in a rush, I can't be runnin' out of time\nWhat you mean what's on my mind?\nFederal Reserves on my mind\nI got the plug online\nGo crazy lavish, put the spaceship on Davins\nCompellin', you can hear the guns yellin'\nI can't take no vacations, I can't lose\nWe poppin' mollies and they watchin' like parole\n\n[Verse 1]\nI see you makin' that lil' noise, but I ain't enthused\nKidnap, no flinch, I'ma set back and reminisce\nFuck that bitch, got a love for water whippin'\nZone 6 nigga ridin' in a V12, that's too Venice\nI don't wanna show ‘em no slack, I gotta get me a sack\nTakin' their clean batch, still fighting my demons\nI'ma drop my top, get some, I mean this\nShawty give me that mouth while I make a scene with (super sloppy)\n\n[Chorus]\nWho knew I'd get this much attention?\nBe cool before you get put on suspension\nP.I.M.P., gettin' that Monica Lewinsky\nChain on freeze, wrist on jet-skis\n\n[Verse 2]\nI'm gettin' frustrated and all for us\nYou see I bought the Bentley truck for us\nI put in some hours every single night\nSomewhere in the clouds, done lost sight\nKhaled put a whole nigga on ice\nFucked on a gold digger more than twice\nFor the crazy bitches, glance shiesty\nHad a crazy wrist, I didn't ice it\nI'm infatuated with shinin'\nI'm infatuated with shinin' (on my line)\nI'm infatuated with shinin'\nGive you motivation at its finest\n\n[Chorus]\nWho knew I'd get this much attention?\nBe cool before you get put on suspension\nP.I.M.P., gettin' that Monica Lewinsky\nChain on freeze, wrist on jet-skis\n\n[Post-Chorus]\nGo crazy, lavish, put the spaceship on that Davins\nCompellin', you can hear the guns yellin'\nI can't take no vacations, I can't lose\nWe poppin' mollies and they watchin' like parole\n\n[Outro]\nGotta be in a rush, I can't be runnin' out of time\nWhat you mean, what's on my mind?\nP.I.M.P., gettin' that Monica Lewinsky\nChain on freeze, wrist on jet-skis", "image": "https://images.genius.com/017aebcbc814b4a237d11e0bf31c7395.1000x1000x1.jpg"}], "artist": "Future"}