{"songs": [{"title": "Gone Insane", "album": "Longterm Mentality", "year": "2011-04-05", "lyrics": "[Verse 1]\nI feel like, I'm affiliated with the illuminati, bitch\nAll seeing fucking eye, this is your enlightenment\nI'm lighting this, fire my supplier always like to give\nHigher than I've ever been these heights are mighty frightening\nYour hands up as if you wanna strike like lightening\nDon't shoot, you can't fight a viking on Vicodin\nCan you? Hmm, I would like to see you try it then\nI be eating rappers, that's the only way I'm biting 'em\nThat was yummy yummy, dummy dummy, nothing's funny funny\nGive a bitch a sippy sippy, then I get some sucky sucky\nSucky sucky now, think the nigga must be lucky lucky\nShe's such a doll, I guess that makes me Chucky\nWhat's up with y'all other than nothing at all?\nBitches licking my balls, you ain't nuttin' at all!\nYou ain't nuttin' at all, neither am I\nHeaven's a better place, I hope you all die!\n\n[Bridge]\nI think I'm Jimi Hendrix, I think I'm Kurt Cobain\nI think I'm John Lennon, gone insane\nSomeone take this gun, before I blow out my brains (BANG)\nAb-Soul, and A-Y-I-R-O\n\n[Chorus: ScHoolboy Q]\nGrab a bitch then grab ya dick, pop a fifth and have a sip\nSmoke a blunt, pop a pill (Fly nigga, fly nigga)\nParty every single night, mingle with a nigga wife\nDoggone, we all gone (Die nigga, die nigga)\n\n[Verse 2]\nLife's a bitch, but she won't let me hit\nSo I just masturbate to her naked flicks\nI ain't got change for a dolla, but I think I'm making sense\nI do resemble my father, but do I really know I'm his?\nSometimes I like to go on a tangent of random shit\nStay with her Black and Mild out and a handful of ass and tits\nSkywalker in the blunt, Darth Vader in the cup\nYou don't get lifted with us, your elevators stuck\nI never gave a fuck, my name never came up\nBut now that I done came up, I think I'm King Tut\nI told Punch I'd probably get assassinated by the government\nHe probably think I'm sniffing cocaine and some other shit\nI'm on some other shit, Black Hippy, ho!\nYippy ka yeee, Yippy ka yoo\nTilt ya head you see me in the sky\nHeaven's a better place, I hope you all die!\n\n[Bridge]\nI think I'm Jimi Hendrix, I think I'm Kurt Cobain\nI think I'm John Lennon, gone insane\nSomeone take this gun, before I blow out my brains (BANG)\nAb-Soul, and A-Y-I-R-O\n\n[Chorus: ScHoolboy Q]\nGrab a bitch then grab ya dick, pop a fifth and have a sip\nSmoke a blunt, pop a pill (Fly nigga, fly nigga)\nParty every single night, mingle with a nigga wife\nDoggone, we all gone (Die nigga, die nigga)\n\n[Verse 3]\nDrowning in Moscato, popular pothead\nFeel like I hit the lotto, and I just got head\nFrom a famous model (Who?) Gloria Velez\nLusting for Cubana's culo you know what it is\nI think I'm Jimi Hendrix, experience my fate\nAll I'm missing is a band of gypsies and some purple haze\nBut now it's O.G. Kush and Ayiro instrumentals\nNo need to insinuate, miss me with the innuendo\nYa outlooks lousy someone needs a new window\nI'mma win I just don't know when though, you bimbos know\nWhat you in for some info to make you exercise your mental\nA seed small as my pinkie can be your weeping willow\nI'm so ill, I'm held hostage at a hospital\nDoing it big like not little\nTivo the revolution when it's televised\nHeaven's a better place, I hope you all die!\n\n[Bridge]\nI think I'm Jimi Hendrix, I think I'm Kurt Cobain\nI think I'm John Lennon, gone insane\nSomeone take this gun, before I blow out my brains (BANG)\nAb-Soul, and A-Y-I-R-O\n\n[Chorus: ScHoolboy Q]\nGrab a bitch then grab ya dick, pop a fifth and have a sip\nSmoke a blunt, pop a pill (Fly nigga, fly nigga)\nParty every single night, mingle with a nigga wife\nDoggone, we all gone (Die nigga, die nigga)", "image": "https://images.genius.com/f5819f76daf2dbaa35f05a7775126bfc.500x500x1.jpg"}], "artist": "Ab-Soul"}