{"songs": [{"title": "Why We Die", "album": "Anarchy", "year": "2000-06-20", "lyrics": "[Intro: DMX]\nUhh\nThat's some shit that that that niggas ain't even seen before\nThat's that shit\nMotherfuckers ain't never seen nothing like this before\nFor real man\nIt's goin' down, baby, uh\nUnh, Busta Rhymes\n(WHAT!) Unh, DMX nigga\nUnh, unh, unh, unh, unh\n\n[Verse 1: DMX]\nI see ghosts clearly; even though, most don't hear me\nThey still wanna get near me (Unh!), fear me, so I'm leary\nKinda eerie what I'm feelin' (What!), from the floor, to the ceilin'\nStraight through the roof, want the truth?\nI kinda miss robbin' and stealin' (C'mon!)\n'Cause it kept a nigga hungry, only eatin' when I starved (Unh!)\nI was ugly, so I robbed, no one loved me, shit was hard (C'mon!)\nWent to God once in a while when it got a little too hectic\nHe was the only one I knew that I respected (Why?)\nDidn't know why, didn't know what I was livin' was a lie\nIf I ain't shit, then, why should I try? (Unh!)\nSee, plenty niggas die, over dumb shit, up in the hood\nReal good heart, but up to no good (Damn!)\nThought I did what I could, but I guess it wasn't enough (Uh-huh)\nThe Devil told me it would happen\nBut I kept callin' his bluff (Uh-huh)\nWhen it rains it pours now, my pains are yours\nAs yours are what's mine, define, revolvin' doors (Nigga!)\n\n[Chorus: Busta Rhymes]\n(Why?) All my niggas tell me (Why) tell me (We die)\n'Cause we crazy with it (Hunh!), quick to blaze you with it (Ha!)\nFrom in my soul to every word that I curse\nWith all the agony expressed in this verse\nLet me ask my niggas (Why?)\nMy niggas, tell me (why) tell me (we die)\nBecause we Gods nigga (And) we go the yard nigga\nBecause I walk the ground under my feet\nAnd keep it live and stay in tune with the street\nNow let me ask my niggas (why?)\n\n[Verse 2: Jay-Z]\nUnh, yo, they say the good die young, in the hood where I'm from\nI only got one question to that, why the fuck am I here?\nI look to the air, ask God, \"Love me, please\"\nBut in reality, only people that hug me is thieves\nSame niggas that send shots through my rugby sleeves\nThey wanna slug me and leave, I'm thinkin' it must be me\nPlease shed light, the hood's dark\nI did my dirt but got a good heart\nShouldn't that count for somethin'?\nI was told I'd amount to nothin'\nMost of my childhood life by folks that was stuntin' my growth\nSeparated me from the shit I was wantin' the most\nFelt myself comin' close to pumpin' them O's\nLump in my throat, chest poked out, face was poker\nTryin to, erase my ghostses, chase the smokers\nGot demons on both shoulders\nTryin to chauffeur my life through the streets\nIn other words, nigga, my will was weak\nPlease feel what I speak\nThis ain't your average ordinary jargon weak rap niggas be talkin'\nThis shit is deep, from the mind of Busta, X, and me\nTo all my fallen soldiers, rest in peace, 'til we meet, niggas\n\n[Chorus: Busta Rhymes]\n(Why?) All my niggas tell me (why) tell me, ah! (we die)\n'Cause we crazy with it, quick to blaze you with it (Ha!)\nFrom in my soul to every word that I curse\nWith all the agony expressed in this verse (Ha!)\nLet me ask my niggas (why?)\nMy niggas tell me (why) tell me, ah! (we die)\nBecause we Gods, nigga (And) we go the yard nigga\nBecause I walk the ground under my feet (Huh! Ha!)\nAnd keep it live and stay in tune with the street\nNow let me ask my niggas (why?)\n\n[Verse 3: Busta Rhymes]\nI must be cuckoo, like I respect the new-you, never\nSee you too could get it through your FUBU sweater\nLike a nigga when he walk in the dark, trespassin'\nOn a nigga land, shots echo loud in the park\nI live and die for all the shit I believe\nAnd rep for everything I stand for\nWith every single breath I breathe\nLike the intake from cigarette smoke, it's like you inhale\nThe demon in the gutter stressed struggled and broke\nIf the shit was all over tomorrow, I'd leave a treasure\nFor my kids with a legacy for my children to follow\nYou know it's funny how the good die first\nGet the peppin' in your steppin' faggot, nigga\n'Cause you could die worse\nHold on, you know I cut off my arm, in the name of reppin'\nReal niggas in the midst of droppin' this bomb\nAllah blessin' me to rep for the better, and carry on\nSomething great and keep a nigga name livin' forever\nNow tell me!\n\n[Chorus: Busta Rhymes]\n(Why?) All my niggas tell me (why) tell me, ah! (we die)\n'Cause we crazy with it (Hunh!), quick to blaze you with it (Ha!)\nFrom in my soul to every word that I curse\nWith all the agony expressed in this verse\nLet me ask my niggas (Why?)\nMy niggas tell me (why) tell me, ah! (we die)\nBecause we Gods nigga (and) we go the yard nigga (Ha!)\nBecause I walk the ground under my feet (Hunh!)\nAnd keep it live and stay in tune with the street\nNow let me ask my niggas (Why?)", "image": "https://images.genius.com/c03e10c88fa343cd2e7c18112c468983.1000x1000x1.jpg"}], "artist": "Busta Rhymes"}