{"songs": [{"title": "(O.J.) Wake Up", "album": "Tha Doggfather", "year": "1996-11-12", "lyrics": "[Intro:]\n[Snoop] Yeah man, this shit here gonna be bigger than the O.J. case\n[Tray Dee] What?\n[Snoop] This dick\n*laughter*\n\n[Tray Dee]\nAnother blast from the Long Beach section\nStraight gangsta shit (Wake up)\nI thought these fools knew\n\n[Verse 1: Tray Dee]\nOut on the scout I'm about my papers\nCause ain't nobody doin Dee no favors\nI'm trying to get major with minor risk\nMaximising the minimum of time is spent\nOn the heist, nice and easy believe me\nI take mine and make mine extra cheesy\nKeepin niggas in a headlock\nUndress em, press em down in a full nelson\nI hit jacks off six packs of the crooked one\nThey slip and I'm booking em\nFuck fingerprints, gimme from their fingertips\nChips to the neckline cos I got a Tec-9\nCheck mine like a pimp-main ho\nSo hope you only see me when my grip ain't low\nI go up in ya like a skeleton\nSo S-N-double O-Please let em know the crew I'm bailin with\n\n[Hook: Snoop Doggy Dogg]\nEast-side LBC\nIs what I claim but my game is DPG\nAnd every hustler in my clique got to get his grip\nAnd in my world a girl is considered a bitch\nIs money all that makes you move?\nYou ain't doin what'cha s'posed to so you gots ta prove\nSomethin to the ones you love but you needs ta know\nIf you ain't doin it for yourself it don't matter d'ooooh!\nIt was a wake up, wake up, wake up\nJust to wake up, wake up, wake up...\nWake up, wake up wake up...\nGet up, get up, get up..\n\n[Verse 2: Tray Deee]\nI break fools off like leprosy\nIf they dare, you stare when they next to me\nI'mma threat to whoever sweat my style\nHard gangsta aim to represent til death\nReality, you battle me you be in the dirt quick\nI'm clever with whatever type of weapon I work with\nThe bare hand man sleeper\nI even banked up and shank motherfuckers in the peepa\nI sanked a gang of tough fools in my time\nSo try me you're liable to lose on my line\nThe 44'll be what cracks ya head\nCos that's exactly what I'm bout ta cap you with\nI figured niggas gettin soft like jellatine\nSo Doggy Dogg tell em all who we're sailin wit\n\n[Hook: Snoop Doggy Dogg]\nEast-side LBC\nIs what I claim but my game is DPG\nAnd every hustler in my clique got to get his grip\nAnd in my world a girl is considered a bitch\nIs money all that makes you move?\nYou ain't doin what'cha s'posed to so you gots ta prove\nSomethin to the ones you love but you needs ta know\nIf you ain't doin it for yourself it don't matter d'ooooh!\nIt was a wake up, wake up, wake up\nJust to wake up, wake up, wake up...\nWake up, wake up wake up...\nGet up, get up, get up..\n\n[Verse 3: Snoop Dogg]\nUh, gonna work that motherfucker and do the percolator\nCause Snoop Dogg came back with the head raider\nAl Davis's? Nah nigga Tracy Davis\nThe Eastside Long Beach greatest\nCriminal with style and boy you love that\nSit back relax and let me drop another rap\nBut this one's for the sisters and not the hoes\nThe ones who be groovin it on the step shows\nLet a nigga in, I ain't diss ya friend\nAnd like The Staples I make sure we do it again\nBut don't blow a nigga up or show a nigga up\nAnd don't think a nigga sprung cos you know a nigga fuck\nLove is a house and you got the key\nSo give it to a nigga like a D-O-double G\nI'm from the\n\n[Hook: Snoop Doggy Dogg]\nEast-side LBC\nIs what I claim but my game is DPG\nAnd every hustler in my clique got to get his grip\nAnd in my world a girl is considered a bitch\nIs money all that makes you move?\nYou ain't doin what'cha s'posed to so you gots ta prove\nSomethin to the ones you love but you needs ta know\nIf you ain't doin it for yourself it don't matter d'ooooh!\nIt was a wake up, wake up, wake up\nJust to wake up, wake up, wake up...\nWake up, wake up wake up...\nGet up, get up, get up..", "image": "https://images.genius.com/ecb7c80ab44a68c9d33f60b5fccd0a70.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}