{"songs": [{"title": "Dr. Eggman", "album": null, "year": "2016-05-20", "lyrics": "[Intro: Cheese, Ski Mask The Slump God & Ronny J]\nI like chocolate milk\nCan I have some chocolate milk?\nI like chocolate milk (Bitch)\nI like chocolate milk (Wet, wet)\nChocolate milk (Hah, hah)\nChocolate milk (Yuh)\nChocolate milk (Ayy, ayy)\nI like chocolate milk (Ronny J, listen up, bitch, wet)\n\n[Verse 1: Ski Mask The Slump God]\nThree bars on me, I ain't talkin' 'bout the Wi-Fi\nBen 10 wrist, I ain't talkin' 'bout the Sci-Fi\nLook at my leather, same color as my caca\nFeelin' like Messi, tryna kick it like soccer\nAsk me for cash, I say pineapples, hmm (Who?)\nCaucasian gold, I might shine at you, umm (Shine)\nMath tutor, I point the 9 at you, umm (Wet, wet)\nFuck on your bitch while she sigh at you, yuh (Wet, ayy)\nI got my diamonds from Kony, umm (I got my diamonds from)\nBut I still fuck with Obama, uh (But I still fuck with, uh)\nMy jewelry so underwater, Osama (Look at it, look at it)\nI keep it 300 just like the Sparta (Look at it, look at it)\nI'm lord like Darth Vader 'cause I'm the father (Yah, yah)\nTold her giddy up like a rodeo, llama (Look at it)\nBitch, I'm ballin' like Melanie (What I spilled?)\nWhat the fuck is you tellin' me? (Sauce)\nLike it's Resident Evil (What I spilled?)\nI'm on the spider, okay, like (Yuh)\nCatchin' me slumpin', be stupid unconscious ('Conscious)\nYour bitch so wild, pulled up on her like (Crikey)\nPull down that Burberry skirt, said I like it (Wet)\nDiamonds that's on me 1000 like Fauni (Flex, yuh)\nDrippin' like ICEE and Orange like Hi-C\nI feel like I'm Miley, oh, I think they like me\nLook at the gold as same color as my white tee\nGot Christmas spirit, my dick at your wifey (Hah)\n\n[Chorus: Ski Mask The Slump God & Keith Ape]\nGucci color goggles on my head like Dr. Eggman (Pew)\nStripes on my attire like the Sandman, umm (Pew, ooh)\nGucci color goggles on my head like Dr. Eggman (Pew)\nStripes on my attire like the Sandman, umm (Pew, yuh, ooh)\nFeelin' like I'm Bob the Builder, yes, I can, man (Hey)\nNigga, run it up for hunnid bands, man, umm (Ayy)\nFeelin' like I'm Bob the Builder, yes, I can, man (Yeah-e)\nNigga, run it up for hunnid bands, man, umm (Yeah-e, yeah-e, yuh)\nGucci color goggles on my head like Dr. Eggman (Ayy, uh, yuh)\nStripes on my attire like the Sandman, umm (Ayy, ayy, ooh)\nFeelin' like I'm Bob the Builder, yes, I can, man (Ayy)\nNigga, run it up for hunnid bands, man (Ooh, ooh, umm)\nNigga, run it up for hunnid bands, man (Ayy, yuh, run it up, umm)\nNigga, run it up for hunnid bands, man (Yeah-e, run it up, umm)\nNigga, run it up for hunnid bands, man (Yeah-e, run it up, umm)\nNigga, run it up for hunnid bands, man (Yeah-e, run it up, ayy)\n\n[Interlude: Keith Ape]\nAyy, run it up (Run it up)\nAyy, 도망쳐 (도망쳐)\nAyy, run it up (Run it up)\nAyy,  도망쳐 (도망쳐)\nAyy, run it up (Run it up)\nAyy, 도망쳐 (Yuh, 도망쳐)\nAyy, run it up (Ayy, yuh, run it up)\nAyy, 도망쳐 (Ayy, eww)\n\n[Verse 2: Keith Ape]\nI'm gonna worry, I can play with us (Eww)\nFuck yeah, all I need is H2O (Yuh)\nOpen the Fiji water, I mix it up (Yuh)\nAnd I pour, 난 pour, got 범고래 정신력 (Ayy, ayy)\n병신들, 덤비면 실려 가게 해 줄게 (Ayy, yeah-e)\n이 [?] of cash (Yeah-e, yah, cash)\nNo ghouls, no shooters (Shooters)\nBut I got undertakers do the take you underwater (Yah)\n널 물 밑에 묻어 버려 (Yah)\n넌 결국엔 뒤져 버려 (Ayy)\n넌 거기서 끝나 버려 (Yah)\n넌 그냥 거기서 머물러 (머물러)\n머물러, 너는 거기서 머물러 (머물러)\n너는 거기서 왜 자꾸 서둘러 (서둘러)\n서둘러 봤자, 너는 허우적\n$ki Mask, Skull Heads, rob the SeaWorld (SeaWorld)\nWe tryna give 'em Cabin Fever (Fever)\nMakin' more money than Justin Bieber (Bieber)\nBut you know I'm also realer (Realer)\nSchemin' with you but walkin' with me, uh (Uh)\nI didn't do much, I just run it up (Uh)\nI'm the only badman, let me count it up (Ayy, uh)\nDirty South Korean with the 30 pop-riots (Whoa)\n잘 때도 [?], 코 베러 온 서울 (Uh)\n넌 nacho, 넌 아직 초보, ooh (Ooh)\n난 계속 만사, 넌 항상 초조 (Whoa)\n넌 계속 보조, 조연, ooh (Ooh)\n너는 권총, 난 소총 (Whoa)\n넌 안 돼, 조절, 해 줄게, 경고, ooh (Ooh)\n너네 집에 세워 놔, 보초 (Muh, muh)\n안 그럼 모든 게 초토화되고 소멸\nOoh (Ooh, uh)", "image": "https://images.genius.com/624b45b42b10e483bc147da7eac0a9f3.612x612x1.jpg"}], "artist": "Ski Mask the Slump God"}