{"songs": [{"title": "Kingdom Remix", "album": null, "year": "2014-09-24", "lyrics": "[Hook]\nHelp me get, get the keys to the kingdom (yeah)\nOoh (sing)\nHelp me get, get the keys to the kingdom (yeah)\nOoh\nAh yes, my Lord, Ah, Oh\n(And the streets say)\n(And the people say)\n(And we all say)\nAh yes, my Lord, Ah, Oh\n(And the streets say)\n(And the people say)\n(And we all say)\n\n[Verse 1: Common]\nMy money ain't straight, my fam ain't straight\nAin't wanna push kis, heaven couldn't wait\nI was hurtin', couldn't get no work\nYou created me from dust, that's why I did dirt\nYou said that the last shall be first\nNow I'm in a hearse, what's this cash really worth?\nMy whole life I had to worry about eatin’\nI ain’t have time to think about what I believe in\nWhen the days of the kingdom for Chicago gon' come?\nI’m coming back like the Prodigal Son, and I got a son\nAnd I don’t want my waves following him, the streets swallowing him\nAnd I don’t want no hollows in him, his momma said she see his father in him\nHope it’s the good things, ‘til life was over is when I understood things\nStanding at the gates ‘cause I know you’ve forgiven what I’ve done\nI’m your son, do I have the keys to get in?\n\n[Hook]\n\n[Verse 2: Vince Staples]\nSweet Lord Jesus, tell the polices to let a nigga breathe\nMy sinning father see, got a shipment by the seas\nSee my niggas tryna eat, eat whatever’s on your plate\nSave some for me, the worst things in life come sitting six feet\nTryna hop the gate to heaven ‘cause I couldn’t get a key\nBut these niggas play for keeps and I gotta hold my own\nTryna watch my back ‘cause these stripes ain’t free\nWe still wading in the water, cocaine, blunts, marinating in the water\nLeina took a puff and then she gave it to my father\nUsed to take the bullets out so I could play with the revolver\nSatan serenading ever since I was a toddler\nTell ‘em talk is cheap, niggas living for the dollar\nSo in God we trust, leave the praying to my momma though\nAnother motherfucker out of control, just walking my soles low\nLit up with the abuse, they wasn’t for show, I promise every pistol was used\nSee I was waking up afraid to see my name on the news\nBroad day, bare faced, giving niggas the blues\nNigga who you? They know me on the streets where I grew\nIf you ain’t from around here you get gunned down here\nMake the best from the least on the quest for them keys\nTo the kingdom\n\n[Hook]\n\n[Verse 3: Jay Electronica]\nNas hit me up on the phone like \"Peace, Isa\nYou know you need to preach how the pyramids of Giza\nAlone condemn Easter\nInstead of sniffing lines, popping thongs in Ibiza, Ether\nNigga, are we not thy brother's keeper?\"\nAllahu Akbar, abracadabra\nWe used what we had to stay alive like MacGyver\nStarted from the bottom, now we really, really here\nStarted kinda blurry, now we really, really clear\nIt's the Nat King unforgettable, black king on a pedestal\nThe way he made words into edibles was incredible\nVerbs and spices, giving life out to the lifeless\nGiving Christ out to the Christ-less\nMy handle with the dices been documented as priceless\nI roll 7's naturally\nDevils who used to laugh at me bow to me internationally\nRappers I gave birth to shot at the God, blasphemy\nTold these motherfuckers to never Jimmy DeGrassi me\nThis goes out to those that choose to use\nDisrespectful views on original Jews\nThe chosen people of God getting slandered and abused\nIn the streets and the news by the seed of Yakub\nThe synagogues of Satan wanna keep us confused\nThat's how we lose, niggas got the ill street blues\nFrom Chiraq to England\nMe and Common dropping bombs like the baby planes as we establish the kingdom", "image": "https://images.genius.com/dca0dc1680990e772c2f4ed48ddf1cd2.400x400x1.jpg"}], "artist": "Common"}