{"songs": [{"title": "Purple Brick Road", "album": "The Wild", "year": "2017-02-16", "lyrics": "[Hook: Stalking Gia]\nForever may not exist\nBut man do we got our moments\nKilling time, making a name\nWasn’t about money or the fame\nWhy hide the scars?\nIt’s who we are\nIt’s who we are\n\n[Verse 1: Raekwon]\nPurple cloths is on me, salute my presence\nDNA is worth a fortune but I've still seen a life of peasants\nI gave y'all style, taught you how to be fly, go 'head and grace the sky\nGave you wings to soar like you ought to\nForever may not exist in the flesh but my music will\nAll praises due to the Most High\nWith my toast, shocked the world, wasn't Casper when I said\nI came through when the roaster blow in half a Billy Goat\nJust because I'm living this life I'm accustomed to it\nFloating in them fly cars, damn I'm supposed to do it\nPretty women fall in love with my expensive taste, luxury, lust\nPhysical touch by this ace, handcuff 'em\nThat's a no no 'cause I don't trust them far as I can throw those\nGold diggin' vixens who's in love with the coco\nBut fuck it, you know I'm here for this dough though\nLet's pop another bottle of Don and watch our gross grow\nI love it\n\n[Hook: Stalking Gia]\nForever may not exist\nBut man do we got our moments\nKilling time, making a name\nWasn’t about money or the fame\nWhy hide scars?\nIt’s who we are\nIt’s who we are\n\n[Verse 2: Raekwon]\nClarity stones in my bracelets, watches and rings\nFrom a rich nigga's perspective you know what that brings\nHatred, what do I do when I'm so used to shittin' on 'em\nDo I stop because a jealous ass coward wants me to\nOr do I go harder and buy more diamonds and blind his crew\nFuck it, I guess I do that 'cause I love to make 'em blue\nGetting 'em bags,  stayin' fly, stayin' high\nDo what I wanna, no more strugglin' just to get by\nYes, fresher than a new born baby's ass\nNew money, got my ex wishin' she was never in my past\nI laugh, enjoy these fruits from my labor\nBut still feel the strain and pain that be from my labor\nSpent my time to achieve all of the fortune and fame\nAnd for myself makin' a name\nBut deep inside I try to cover up the scars to be a shinin' star\nI guess that's just who we are\n\n[Hook: Stalking Gia]\nForever may not exist\nBut man do we got our moments\nKilling time, making a name\nWasn’t about money or the fame\nWhy hide scars?\nIt’s who we are\nIt’s who we are\n\n[Verse 3: G-Eazy]\nForever may not exist but who else is as hot as this?\nI played the beat then I tried at this\nCuban links on my neck and I just put a presidential on my wrist\nThis year you haters gonna acknowledge this\nIt's G-Rapo and Raekwon, told the homies this wouldn't take long\nMy verses always just as real as the true story it's based on\nChopped the blow on the table plenty times\nIn the lines that she puts her face on\nAnd this is not by accident\nAnything can happen if you simply imagine it\nMy OG put a torch to the blunt then he's passin' it\nBelieve in something, stand for it or take a knee and stand like Kaepernick\nAnything to get the point across makin' a statement\nYou'll only go as far as you take it\n20 years later and we're still slappin' that purple tape shit\nGreatness so close I can taste it, face it\n\n[Hook: Stalking Gia]\nForever may not exist\nBut man do we got our moments\nKilling time, making a name\nWasn’t about money or the fame\nWhy hide scars?\nIt’s who we are\nIt’s who we are", "image": "https://images.genius.com/626cb7a305bf0b1ac796a18f8df3e29a.820x820x1.jpg"}], "artist": "Raekwon"}