{"songs": [{"title": "Health, Wealth, Self", "album": "KRS-One", "year": "1995-11-07", "lyrics": "[Intro]\nYeah.. yeah.. yup!\nYou know I was just downstairs\nAnd I was on my way up here to the studio and\nA guy bumped into me and\nAnd he said.. he said, \"Yo Kris!\nHow is it that you stay in this music?\nYou know, this rap music especially for so long, so long\"\nI said, \"Well you know years ago I made a deal with the Goddess\"\nHe said, \"The Goddess?\"\nI said, \"Well yeah, you might know her as God\nBut I know her as the Goddess\"\nThe universal mother\nThe mother of everything you see in existance\nI asked her for assistance\nIn lyrical persistance\nAnd she gave it to me, under one condition\nShe said, \"I'll give you the gift\nBut use the gift to uplift\"\nI said, \"Okay mom!\"\n\n[Hook]\nSo I tell you the truth, really\nMe nah gon' need nuttin else\nBut health, wealth, and knowledge of myself\nMe nah gon' need nuttin else\nBut health, wealth, and knowledge of myself\n\n[Verse]\nIn the beginning was the word, the word was made flesh\nKnowledge K. Reigns R. Supreme S\nSome of us guess while others of us are blessed\nTake heed to the word, that I manifest\nI manifest the future, the present, followed by the past\nEverything in nature, rules by kickin ass\nWhat they tellin me, but yo, you a friend to me\nSo I'mma tell you the secrets of MC longevity\nSecret one: if it ain't fun, you're done\nAnd about your career, huh, well choose another one\nIf you don't like what you do, you're through\nLesson two: make sure you got a dope crew\nNot some crew, that's like an anchor on a shoe\nA MAD CREW, that's of some benefit to you\nLesson three, might be contradictory or funny\nBut MC's should have OTHER WAYS of gettin money\nThat's to say learn other things beside music\nMake money elsewhere, Hip-Hop you won't abuse it\nToo many MC's, just emcee\nSo their longevity, is based on an Uncle Tom at the record company\nLesson four: sell your image, never sell a record, image is respected\nRecords come and go and get collected\nEven the records of platinum artists, that used to rip shop\nCan be bought, for a quarter at the thrift shop\nWhich brings me to lesson number five, the illusion\nHas me thinkin, the minute they drop a record\nThey'll be cruisin, in the Acura\nSlow down!  You're still a amateur\nWhat seperates the pro from the amateur is stamina\nNot how long you can rhyme, but how long you've been rhymin\nChangin with the times, and findin yourself\nStill climbin for wealth\nBlow for blow, you're still growin, still showin\n(all knowin) now that's a pro at it\n\n[Hook]\n\nThank you Mother, I'm out", "image": "https://images.genius.com/78316fa7efcf948425107910e5b3a92b.300x300x1.jpg"}], "artist": "KRS-One"}