{"songs": [{"title": "Muah", "album": "Strangeulation Vol. II", "year": "2015-11-20", "lyrics": "[Intro: Tech N9ne]\nThem niggas were in each other's face like this, I thought they was gon' fuck, I don't know! I'd rather be looking at a pussy like that like \"Muah, muah, muah, muah, muah, muah, muah, muah!\" Sorry and shit\n\n[Hook: Tech N9ne] (4x)\nMuah, muah, muah, muah\nMuah, muah, muah, muah\nSorry and shit\n\n[Post-Hook: Tech N9ne]\nWe go, that's why she want us in her throat\nDon't bring her around us because we will get the vote\n\n[Verse 1: Tech N9ne]\nCause money and the power get your honey in the shower\nWith this one he got it runny in her flower\nWhen that whore see me rap\nYou won't be able to snatch your beezy back\nIt ain't no reason to act so sleazy cat\nMusic is some kind of aphrodisiac\nYou don't know she dreaming of having us in the sheets like\nLoving that nigga that eat right, what you expect?\nSee, if you were Tech you would be pounding punani each night\nIf she bites, tell her to stop! Then we fight\nNext minute, break up, then make up\nThat's what I call a peace pipe\nMy apologies, she wants Tech so she nollers me\nSwallows me, on my rod is where your broad'll be\nAnd your girl's a hella partying chick and she kiss it like\nMuah, muah, muah\nSorry and shit\n\n[Hook: Tech N9ne] (4x)\nMuah, muah, muah, muah\nMuah, muah, muah, muah\nSorry and shit\n\n[Post-Hook: Tech N9ne]\nWe dope, that's why she want us in her throat\nDon't bring her around us because we will get the vote\n\n[Verse 2: Krizz Kaliko]\nUh huh, 'em big ones huh?\nSo I dumps the pumps, her rump will hear that song and then she on my bumper\nAfter the show, watch how these hoes get (ya, ya!)\nCuties trying to kick it like a Colquitt\nShe just tryna' give me what I'm 'poda get\nI'm sober as a gopher, poke her and then I'm over it\n(Okay!) And I ain't slowing it down cause I got a goal to get\nI know what your motive is, but you roll it 'fore the morning hit\n(Okay!) I know she know just what a boner is\nShe phone the kids, she ain't coming home cause she on the dick\nW-why you fighting 'round them areolas\nMight be piping wives and them, like my rhymes reciting 'em\nAt the bar we can sit, drink and see how far we get\nMe and the Donny Punani we already hit\n(Sorry and shit) Okay!\n\n[Hook: Tech N9ne] (4x)\nMuah, muah, muah, muah\nMuah, muah, muah, muah\nSorry and shit\n\n[Verse 3: Krizz Kaliko]\nAye! We're some dudes they want to hug\nWant us in they throat cause we hard\nAnd give her what she missing at home\nFeelin' K9 and she'll be alone\nI see that snake and bat tat\nThen I'm at that, wanna give us head\nAround the map, you don't match that\nTalkin' bout, she love me now\nNow how hard it can get\nAnd I can tell her now she hardly can sit, yeah, yeah!\n\n[Hook: Tech N9ne] (4x)\nMuah, muah, muah, muah\nMuah, muah, muah, muah\nSorry and shit", "image": "https://images.genius.com/d6abef8fbc863a78647f5e7bfd58bbe7.500x500x1.jpg"}], "artist": "Tech N9ne"}