{"songs": [{"title": "M.E.F.", "album": "Pollen: The Swarm Part Three", "year": "2010-06-22", "lyrics": "[Intro: Method Man]\nYeah, pull your shoes up\nWhy don't ya'll niggas sit your ass down somewhere\nMeth, yeah, yeah *burp*\nI said it, Staten Island back up in this bitch in a major way\nYeah\n\n[Chorus: Method Man]\nWho next on deck? Yo, mark, ready, set\nYou get one guess, Meth, pass that dutchie pon de left\nTake a deep breath, Meth, take that genie to the chest\nIt relieves stress, please believe it\nWho your M-E-F'ing Man, go 'head, ask your man\nAnd them broads with them big drawers, they know who I am\nCall me Meth, like my niggas in Park Hill Projects\nJust Meth, say it with the F, never disrespect\n\n[Verse 1: Method Man]\nGive me dap, or give me depth, Clan in effect\nWhile you shaking my right hand, I stab you with the left\nWhat the fuck ya'll expect, I'm beyond bomb threat\nExplode when I'm talking, I blow shit out proportion\nWho's next, now, to be made an example\nTimb boots stomping on them open toe sandals\nEvery boots scuffed, another win for us\nLife's just fucked up, momma just didn't hug me enough\nLet's you and I discuss over this bag of dust\nMy plans to make bags, up in God we trust ya'll\nI ain't gotta, lift a, finger to touch ya'll\nAnd I ain't got a middle finger you to fuck ya'll\nShit, as far as I'm concerned, ya'll germs\nTo the illest MC to ever get his turn\nStreet, you know the Life, money feed only on these dice\nDon't wanna have to make my point twice\n\n[Chorus: Method Man]\nWho next on deck? Yo, mark, ready, set\nYou get one guess, Meth, pass that dutchie pon de left\nTake a deep breath, Meth, take that genie to the chest\nIt relieves stress, please believe it\nWho your M-E-F'ing Man, go 'head, ask your man\nAnd them broads with them big drawers, they know who I am\nCall me Meth, like my niggas in Park Hill Projects\nJust Meth, say it with the F, never disrespect\n\n[Verse 2: Method Man]\nWho cashing checks every first and fifteen?\nWho earnt they respect? Blunt brother from another mother\nSouthpaw, might Golden Glove ya\nNow Enter the Wu-Tang Forever, The W\nYa'll been eating off our plate for years\nAnd didn't know I spit in the pot\nI'm on the toilet with some new shit, fitting to drop, lend me your years\nFor a minute, get in it, \"see murder\", there ain't \"no limit\" to the killing\nEmotional wreck, cuz I ain't feeling what ya'll feeling\nYa'll rappers is sex with penicillen, who the villain?\nBurning MC's, sick as the V's when he illing\nA hundred degrees in dungarees, still chilling\nYou know me by now, look out Tical\nIn your barn, at your Phat Farm, milking your cow\nStreet, you know the life, money feed only on these dice\nDon't wanna have to make my point twice\n\n[Chorus: Method Man]\nWho next on deck? Yo, mark, ready, set\nYou get one guess, Meth, pass that dutchie pon de left\nTake a deep breath, Meth, take that genie to the chest\nIt relieves stress, please believe it\nWho your M-E-F'ing Man, go 'head, ask your man\nAnd them broads with them big drawers, they know who I am\nCall me Meth, like my niggas in Park Hill Projects\nJust Meth, say it with the F, never disrespect", "image": "https://images.genius.com/b823055f072f6d8953eb7a49090f4fd3.391x391x1.jpg"}], "artist": "Method Man"}