{"songs": [{"title": "Yea Yup", "album": "Fly Times, Vol. 1: The Good Fly Young", "year": "2019-04-20", "lyrics": "[Intro: Wiz Khalifa]\nYeah, yup\nLa música de Harry Fraud\nLet me just run through it in my head\nUh\n\n[Verse 1: Wiz Khalifa]\nGet up off your ass\nThis cash ain't gon’ get itself, the race ain't gon' win itself\nFocus on your business and your health\nPut them notches on your belt\nTreat them haters like they not here\nOnly smoke it if it’s top tier\nNever puttin' your trust in a girl, that's bein' smart, it's not fear\nAll that I'm sayin', they motive's not clear\nLookin’ for a come-up, you won’t get a shot here\nAnd still them bottles gon' pop, ’nother 30K, you gotta go shop\nEven though it pains 'em, I guarantee it ain't never gon' stop\nI’m with a few G's, you ready or not?\nWe levelin' up, conversations 'bout television and such\nMake a toast to the better us\nWe never die, never givin' up\nNever let sucker sheep get ahead of us\nBlow rapper weed on the regular\nYou just rappers with weed, et cetera\n\n[Chorus: Young Deji]\nIt's our time\nI don't wanna hear you cry\nStop complaining, it's our time\nI don't wanna hear you cry\nStop complaining, complaining, yeah\n\n[Verse 2: Wiz Khalifa]\nWhatever you like, I got it on ice\nTrips to paradise, never seen you wear it twice\nWe don't care the price, diamonds in our wrist-wear\nWe celebrate 365 days out of the year\nIt took a lot to get here, some losses\nNow we pour out our own liquor and race Porsches\nSeveral options\nStay real and still made a fortune\nDoesn't happen often\nPull up, don't let the valet park it\nMama get in, don't make it awkward\nThis some G shit you wanna take part in\nAnd if it ain't, well then I'll gladly beg your pardon\nRollin' KK, got it straight from out the garden\nBank the largest\nThank the Lord when we make deposits\nLot of hate but we shake it off us\nWe invest if it's makin' dollars\nThis for legacy, it ain't for follows\n\n[Chorus: Young Deji]\nIt's our time\nI don't wanna hear you cry\nStop complaining, it's our time\nI don't wanna hear you cry\nStop complaining, complaining, yeah", "image": "https://images.genius.com/25f75d9000a8f2a523b5c3528fe6759b.1000x1000x1.png"}], "artist": "Wiz Khalifa"}