{"songs": [{"title": "Go to Sleep", "album": "We Never Sleep, Vol. 1", "year": null, "lyrics": "Feat. Infamous 2-0, Lil' Fate, Three-6 Mafia)\n\n[Hook 3x]\nGO TO SLEEP, hoe to sleep, GO TO SLEEP, hoe to sleep\nIF YOU'RE TIRED BE QUIET AND GO TO SLEEP, hoe to sleep\n\n[Ludacris]\nMaaan, I tell a hoe to go to sleep (go to sleep)\nThey turn around and frown, gotta make 'em six feet deep\n'Cause we knock 'em unconscious with that non-sense\nRead inbetween that fine print, think about lyrical con-tent\nThen about where your time spent\nMess around get your guys hit; a ten HUUUT!\nI send Three-Six ol' sheeyit, nigga WHAAAT?\nIf ya tired ya tired, if ya snooze ya lose\nBut'chu you won't wrap up ya bandages, or hell you would\n\n[Infamous 2-0]\nNigga I got shotty's and semi's - I love 'dro and Henne' ?\nAll brown and skinny, but I've fucked up so many\nI got QP's and halves - if we beefin' I blast\nYou sleepin' I laugh, ask Tit (Titi boi), I'm off the rip\nI had this hoe who talked too much; I had to off the bitch\n2-0, Mr. Crayola; niggas know what I mean\n'Cause I slang brown, white, yellow, purple and green\nAnd all you faggot-muthafuckas gotta know the routine\n\n[Hook 4x]\n[Crunchy Black]\nBitch it's me again, kickin' in your fuckin' doors\nI look for div-idends - I ain't lookin' for you hoes\nYou bitch can't com-prehend; let me put one in ya bro\nLet me put one in ya bro, so you niggas can go to sleep\nSo, lay down bitch; gimme all that you dreamed for\nGimme fancy cars, gimme bling-bling-bling, boi\nIt don't mean a thing, boi, for me that ain't gon' swing, boi\nThem god damn toys; do you know what I mean, boi?\n\n[DJ Paul]\nNow if you warrin' and runnin' from them Three-Six niggas\nThis forty-five gon' give a reason to sleep, nigga\nOr bustin' massive 'round some S.K\nMy last trip to A-T-L I fucked yo' cascade\nI'm strippin' bitches and I'ma ball fucker with a limp\nThey call me infer-stripper, sexy, red hoe's pimp\nAnd quick to sink her on the nigga 'cause this what it's 'bout\nWe rob that trick and stick his dick off in his fuckin' mouth\nWe Memphis niggas\n\n[Hook 4x]\n[Juicy J]\nNorth, north, south, south, Westwood, Orange Mound\nNigga we be smokin' lite; never Cha Cha Charlie Brown\nMemphis niggas in this bitch; pockets full, ya know we bail\nHooked up with my nigga 'Cris, then we head to A-T-L\nPlayas wild, throwin' bows, tellin' chickens, \"Fuck you hoe!\"\nNiggas rollin' Optimo, snortin' that white shit up they nose\nMayne this town is like my town, so we stayed and hung around\nJuicy J be high as fuck; catch me in the lost and found\n\n[Lil' Fate]\nBetter use common sense checkin' me out for bitch I can stand for\nAnd up, get yaself in this clique\nWithout my tongue licks, behind me gettin' handcuffed by a slut\nLook, I'm from Gittero what?\nSouthside niggas throw it up when it's time to get buck\nNiggas in the back of the club postin' up\nWaitin' for a nigga that's new to make it up\nAs in, ain't no askin'; it's no tolerance as long bitch check in\nShe wit' me, comments will only get'chu basically eternally resting\nSo abide by the code of the streets\nIf ya got a bitch better keep her on a leash\nCuz Lil' Fate gonna creep in ya home while you gone\nHave you comin' back findin' nutt on yo' sheets\n\n[Hook 4x]", "image": "https://images.genius.com/3a36b9807391cdc626e1dcc46ca2f8d8.430x430x1.jpg"}], "artist": "Ludacris"}