{"songs": [{"title": "Split Personality", "album": null, "year": null, "lyrics": "[Intro: Dr. Dre]\nYeah, I'm just sittin' in the lab, I'm...\nMy name is Dr. Dre, and\nI want all you mothafuckers out there to know\nThat I have a split personality (*Mr. Ski chuckles*)\nAnd sometimes I just, exit through these things, you know\nHa ha, you know, hell yeah..\n\n[Break: E-A-Ski]\nMr. Ski nigga\nI'm takin' over shit Dre\nLaughing\n\n[Verse 1: Dr. Dre]\nDiagnosis, multiple personality disorder of modern day\nWith modern tech, jugglin' hard in a Leg' versus manslaughter\nI took a swig of the potion and it sent me coastin'\nWith visions of my Alter-Ego hittin' three wheel motion\n\"Is it Dre, is it Dre\"\nNo that Ski in a purple 6-tray G.T.A\nKillin' any mothafucker walkin'\nAnd all these niggas in these magazines that keep on talkin'\nDon't get twisted, I been there, I done that\nBut Ski's out control and maniac\nHe just show me that he got my back \"I just show him I got your back\"\nSee, in a lot of there, I'm straight\nI'm Dr. Dre, but after stroke of mid night\nI’m Mr. Ski A.K.A. Dooms Day\nConcocted the shit up in my lab\nWith Mr. Ski up in my head, bringin' on the Aftermath\nYou can see the stars runnin' from the sky\nTryin' to get away from Dr. Dre and Mr. S-K-I\n\n[Hook 2x]\n[E-A-Ski] the Doctor should've told you, Mr. Ski is fatal to your health\n[Dr. Dre] I'm livin' on another level that y'all ain't been yet\n[E-A-Ski] the Doctor should've told you, Mr. Ski is fatal to your health\n[Dr. Dre] yo, the life style that I'm livin' is just too complex\n\n[Verse 2: E-A-Ski]\nIt's Mr. Ski and Dr. Dre, can't stop this maniacal individual\nTo start showin' level, with 7.0 on your digital\nI'm tryin' to take over shit like Buddy-love\nBut this professor ain't nutty and he can't do it, any herpe dove\nI was the madness that brought on Dre Day\nSuch this time Dr. Dre, he's the one is gonna pay\nI dropped this bud, strain in his brain and shed it off\nAnd have them slangin' guns to them females wouldn't set it off\nI do dirt, and tied up his body and break free\nWitnesses saw Dr. Dre but it was really Mr. Ski\nYou might think it's insane, but it's a clever scheme\nDre don't know shit, he wake up in the morning thinkin' it was a dream\nPut his ass to sleep and soak his game up\nSteady mobbin', hopin' to get this mothafucker brained up\nI can't stop till I succeed, then I can break free\nNo longer Dr. Dre, nigga it's Mr. Ski\n\n[Hook 2x]\n\n[Verse 3: Dr. Dre]\nI start shakin'\nTest tools and bottles start breakin' (*glass crush*)\nMy Ulti-Eagle starts overtakin'\nInstantly spinnin' around like the mass\nTossin' that shit up off like a twister\nNo longer, the docter or Mister \"Ski\"\nI can't hold it back\nI'm trapped behind the walls of my brains, tryin' to count a rack\n\"even though tryin' to fight\"\nMy vocal tone ignited into a loud scream \"how high\"\nIt's time to get the fuck up off, yeah\n\n[Verse 4: E-A-Ski]\nI’m on the loose like 2Pac from Juice\nGod bless the dead\nBut I'm already dead from trauma to the head\nI'mma verbal Manslaughter on the Mic\nBumpin' in your trunk, shatterin' your glass from the street life\nNobody wants to play with me so I'm drillin' them\nI'll be back like Swords nigga, so I can finish killin' them\nIf you want music to drive-By\nTorment minds like yours and Dr. Dre\nBut all I think about is S-K-I\n\n[Hook 2x]\n\n[Outro: Mr. Ski]\n(*exaggerate chuckles*)", "image": "https://images.genius.com/bf3badae49c33b583126057638078bd8.576x576x1.jpg"}], "artist": "Dr. Dre"}