{"songs": [{"title": "On Fire", "album": "Bar Exam 3: The Most Interesting Man", "year": "2010-05-30", "lyrics": "[Verse 1: Crooked I]\nThis is true! Militant mind state\nAnd the villains concealing the 9, wait, it's a zoo\nI'm chilling with primates, I'm a fool\nYou feeling it? I ain't, play gorilla, I'm real as the crime rate\nSo, cool, my right jabs on the right track\nIt'll slide you sideways go get your ice pack\nThat's what the fights bought, bing, punch your lights out\nGo pay your utility bill get your sight back (huh?)\nAll I got is a bunch of weaponry everywhere\nWhen I was a kid I used to machete my teddy bear\nFriday the 13th? Nah, nigga was never scared\nSleeping on Elm Street if somebody tell me Freddy there (yeah!)\nSee I'm a whole 'nother animal\nWith a mechanical trap jaw, highly flammable\nSoon as this cannibal track y'all, I split your cantaloupe\nHannibal Lecter with a hacksaw, I rap raw\nGo in the zone till I'm outside of my body\nYour body get outlined in white powder\nWhen bullets come outside of the shotty (ha!)\nTry to hide in your hotel I'll Al-Qeada your lobby\nThen I'll smile at your hotty\nPut a ride on my side like Clyde riding with Bonnie\nCheck out the way I pimp, mami, after my snake charm her, she get wet, now I'm folding paper (paper!)\nThat's Swami, tsunami and origami (yeah!)\nYes, the best ever! I'm hot as West weather\nWhen you dressed in your sweater vest and you best leather\nI pull buttons and press levers, I'm backwards\nAs a dyslexic letter, jet setter, et cetera\nCatch you boy on planet COB\nGo fuck yourself give your hand a job!\nLike Nickel 9's brother, the kid's Vishis\nI own half a beauty salon\nSo you know I'm with splitting the wig business. (Whoo!)\n\n[Verse 2: Royce da 5'9\"]\nI got a big dick, bitch! (What?)\nThat ain't no punchline, I just a got big dick, bitch!\n'Bout big business, Slaughterhouse!\nYou and your clique gettin' with this\nY'all at the movies wearing blindfolds, get it?\nThat means you ain't seeing the big picture\nI find irony in being the headed rapper decapitating\nI'll get Rihanna on a track and won't even rap on it\nJust let her moan to the song while I'm masturbating\nYou the best rapper? Homie congratulations!\nI'd rather be known for felonious ratchet waving\nYou deep, we deeper, but we married to these streets but\nWe don't jump brooms, we just carry streetsweepers\nHell yeah! Detroit baby? I'm felt there\nLeave a brain elsewhere, it's the name on the card\nTo my health care, I'm hard, you facades, piss me off\nI put your thoughts on your broad\nYou fucking screamer, later with your tough demeanor\nYa fruit, I V8 juice your fucking team up!\nGive me 50 feet! (come on!)\nWhy you acting all brand new? 50's teeth\nGot the bullets looping, I pull it, the clip repeats, without the DJ\nI got more gunshots in the Glock - than Whoo Kid got in that instant replay\nOoh, you thought that was a diss to Fif'?\nThen you stupider than Muslims looking for gifts on Christmas\nClip-out, 'bout to stick my dick in the hole in the handle\nHow you gon' walk a mile in my shoes?\nI'm walking on water in Moses and Hova sandals\nGiving boxers, the opposite of going commando!\nThat's right, I put a bunch of boxers on your ass, boy\nI'm fly, Boeing is my handle\nI'm from the metropolitan rock bottom, if I spot 'em, I got 'em\nShe wanted to swallow when I shot it, but that's not my problem\nShe's your wife she just my concubine and\nShe like to holla Ryan while I'm behind it like she my momma mind it\nWilling to get more physical than the lacrosse team\nBlunt so big look like we just rolled up the Swamp Thing\nI'm high feeling like I should be higher\nI ride like Michael Myers, wire ride like a bike with no tires!\nNo case to fight with no priors\nSay good night, Nickel 9 and Crooked I's on fire\n\n[Outro]\nThat's right\nWhat up, E-Love?", "image": "https://images.genius.com/f26afa0e15f73eb0b5cef561ec304c68.450x450x1.jpg"}], "artist": "Royce da 5'9'’"}