{"songs": [{"title": "Act A Fool", "album": null, "year": null, "lyrics": "[Proof]\nNiggas bite what they can't be\nThe rich throw what they can't eat\nNiggas you ain't sweet\nCoughin and gaggin\nOften i'm braggin\nGot a big dick to stop my pants from saggin\nWaggin your tail like a fag in the jail\nKeep _on the fucker like weed bags in the mail\nEmpty you vein like a sword to flesh\nYou niggas rap about nothing like Lord Finess\n(this is bugz)\n\n[Bugz]\nLet me know\nYou niggas was shoot or start a scrap\nYou think they want to shoot?\nIll put a bullet through they starter cap\nThis a about every niggas that i beat up\nStomped unconscience\nSmacked with tha heater\nFuck you\nBugz don't give a fuck about your feelings\nI blow your shit out like i gun hustle simmons\nSo hide your knot when you walkin up my block\nNiggas smack you with the Glock\nAnd take the money out ya sock\n\n[Hook 2x]\nKnow to act a fool\nAnd wild out when we buzzin\nAlways rumblin\nRoudy niggas dirty dozen\nCold blooded but album hotter then a oven\nYou want beef? what niggas start sumtin\n\n[Proof]\nIts proof the total package\nYou total wackness\nThe fact is\nYou need a life time of practice\nI'm active bouce in the coupe\nTo the _\nFound the foutain of youth\n?mudon? is countin on proof\n_ survival blaze _\nBefore armageddon snatched the prof\nOut the bible\nKill a rival with the impact of a rifle\nAnd ring the blood out ya\nBefore_ crypt and my disciple\n\n(??)\nMan lemme tell what type a nigga i am\nI'm the type of mutha fuckin that write rhymes that kill niggas\nI'm the type of nigga that niggas can't fuck with\nYou know what I'm sayin? that what type of nigga i am\n\n[bugz]\nYou the type write away gone write a million rhymes a day\nCome back around the way and sound the same ol entire way\nBugz will grab a brew and drink a proof from mary j\nAnd bust a freestyle that sounds better then yo tape\nYou style is bitchy, i have a harder time with missy\nYo whole set up sucks like monica lewinsky\nI can cop a seed and read a dictonary first\nAnd kill you with a rap full of words\nI just learned!\n\n[Chorus]", "image": "https://images.genius.com/a168ce2b6c86a86cfb53a6d996cdc8ca.304x400x1.png"}], "artist": "Proof"}