{"songs": [{"title": "Murder For Fun", "album": "Murder Was the Case", "year": "2009-05-05", "lyrics": "[Intro: Ox]\nItal, original Don Dada say\nThe motherfuckin saga just begun\nWARNING! Warning, cinder boots\nSunk in the mud, I am\n\n[Hook: Ox]\n(Killin, killin, killin) The original, WAR! So\nKill dem pussy, we kill dem fi fun\nKillin a pussy, we kill dem fi fun\nKillin pussy, we kill dem fi fun\nSend a man, no mind our business or die tonight\nOr tell him ass again that 'im end soon come\nBefore 'im come, mi Gucci Mane come\nBefore 'im come, de Don Dada come\nWhen we come, it's a battle gun come\nPussy gwan see we, and started to run\nBut - nowhere to 'ide, me-say nowhere to run\nInfrared light might dead 'pon we gun\nSee 'im place the spot them a dead 'im fall down so\nKill him pussy, we kill dem fi fun\nKillin a pussy, kill dem fi fun\n\n[Verse 1: Gucci Mane]\nMan I murder fo' fun but my job is never done\nFrom morning morn' to the setting of the sun\nBad men come come, come get murdered for fun\nThe hundred round drum in my tommy gun\nBe a cat in the Hum' I'll cut out your tongue\nMe and Ox, man we murder fo' fun\nTalk talk bad man, come get murdered fo' fun\nThe Gucci Mane, man I murder fo' fun\nSee my momma ain't raised no bitch-ass nigga\nNever heard Gucci Mane no snitch-ass nigga\nWhen you dealin with a vet, don't bring a rookie\nTell Young Jeezy that I smell pussy\nThe top shotter with the Don Dada\nThe whole hood is a done daddah\nM holla to the state of Nevada\nPut a hole in your fuckin oblongota pussy\n\n[Hook]\n\n[Verse 2: Gucci Mane]\nBig Cat is a Army, better yet a Navy\nTry to kill Gucci Mane, bitch it ain't gravy\nTell Jeezy it's a bullet with his name on it\nA ten thousand dollar hit, he put my chain on it\nYe ain't heard about it? You ain't seen the news?\nYe ain't read the paper? You fuckin player hater\nBird brain-ass nigga perpetratin the boss\nMight think you won one but you really done lost, bitch!\n\n[Hook]", "image": "https://images.genius.com/599d6d3758d41c87831fae654c5caf62.499x500x1.jpg"}], "artist": "Gucci Mane"}