{"songs": [{"title": "So Far...", "album": "The Marshall Mathers LP2", "year": "2013-11-05", "lyrics": "[Intro]\nI own a mansion but live in a house\nA king-size bed but I sleep on the couch\nI'm Mr. Brightside, glass is half-full\nBut my tank's half empty, gasket just blew\n\n[Verse 1]\nThis always happens\nThirty minutes from home, gotta lay a log cabin\nOnly option I have's McDonalds's bathroom\nIn a public stall, droppin' a football\nSo every time someone walks in the john, I get maddened\n\"Shady, what up?\" What? Come on, man, I'm crappin'\nAnd you're askin' for my goddamn autograph on a napkin?\nOh, that's odd, I just happened\nTo run out of tissue, yeah, hand me that\nOn second thought I'd be glad then\n\"Thanks, dawg! Name's Todd, a big fan.\"\nI wiped my ass with it\nCrumbled it up in a wad and threw it back and\nTold him: \"Todd, you're the shit,\" when's all of this crap end?\nCan't pump my gas without causing an accident\nPump my gas, cut my grass, I can't take out the fuckin' trash\nWithout someone passin' through my sub, harassin'\nI'd count my blessings, but I suck at math\nI'd rather wallow than bask sufferin' succotash\nBut the ant-acid, it gives my stomach gas\nWhen I mix my corn with my fuckin' mashed\nPotatoes, so what? Ho, kiss my country bumpkin ass!\nMissouri Southern roots, what the fuck is upper class?\nCall lunch dinner, call dinner supper\nTupperware in the cupboard, plasticware up the ass\nStuck in the past—iPod, what the fuck is that?\nB-Boy to the core, mule, I'm as stubborn as\n\n[Chorus]\nMaybe that's why I feel so strange\nGot it all, but I still won't change\nMaybe that's why I can't leave Detroit\nIt's the motivation that keeps me goin'\nThis is the inspiration I need\nI can never turn my back on the city that made me\nAnd (life's been good to me so far)\n\n[Verse 2]\nThey call me classless, I heard that, I second and third that\nDon't know what the fuck I'd be doin' if it weren't rap\nProbably be a giant turd sack\nBut I blew, never turned back\nTurned 40 and still sag—teenagers act more fuckin' mature, Jack\nFuck you gonna say to me? I leave on my own terms, asshole\nI'm goin' berzerk, my nerves are bad\nBut I love the perks my work has\nI get to meet famous people, look at her dag\nHer nylons are ran, her skirt's snagged\nAnd I heard she drag-races, *burp* swag\nTuck in my Hanes shirt tag\nYou're Danica Patrick (Yeah?) word, skag\nWe'd be the perfect match\n'Cause you're a vacuum, I'm a dirtbag\nMy apologies, no disrespect to technology\nBut what the heck is all of these buttons?\nYou expect me to sit here and learn that?\nFuck I gotta do to hear this new song from Luda?\nBe an expert at computers?\nI'd rather be an Encyclopedia Britannica, hell with\nPlayStation, I'm still on my first man on some Zelda\nNintendo, bitch! Run, jump, punch, stab, and I melt the\nMozzarella on my spaghetti\nPut in on bread, make a sandwich with Welch's, and belch\nThey say this spray butter is bad for my health, but\nI think this poor white trash from the trailer\nJed Clampett, Fred Sanford, and welfare\nMentality helps to keep me grounded\nThat's why I never take full advantage of wealth, I\nManaged to dwell within these parameters\nStill crammin' the shelves full of Hamburger Helper\nI can't even help it, this is the hand I was dealt, a\nCreature of habit, feel like I'm trapped in an animal shelter\nWith all these pet peeves, goddamn it, to hell, I\nCan't stand all these kids with their camera cellphones\nI can't go anywhere, I get so mad I could yell, the\nOther day, someone got all elaborate\nAnd stuck a head from a fuckin' dead cat in my mailbox\nWent to Burger King—they spit on my onion rings\nI think my karma is catchin' up with me\n\n[Chorus]\nMaybe that's why I feel so strange\nGot it all, but I still won't change\nMaybe that's why I can't leave Detroit\nIt's the motivation that keeps me goin'\nThis is the inspiration I need\nI can never turn my back on the city that made me\nAnd (life's been good to me so far)\n\n[Bridge]\nGot friends on Facebook all over the world\nNot sure what that means, they tell me it's good\nSo, I'm artist of the decade, I even got a plaque\nI'd hang it up, but the frame is all cracked\n\n[Verse 3]\nI'm tryin' to be low-key, hopefully nobody notices me\nIn produce, hunched over, giant nosebleed\nOgre style as I mosey over to the frozen aisle\nBy the frozen yogurt this guy approached me\nEmbarrassed, I just did Comerica with Hova\nThe show's over, I'm hidin' in Kroger, buyin' groceries\nHe just had front-row seats\nTold me to sign this poster, then insults me\n\"Wow! Up close didn't know you had crow's feet!\"\nI'm in the crossroads, lost, still shoppin' at Costco's\nSloppy Joe's, bulk waffles\nGot caught picking my nose (agh!)\nLook over, see these two hot hoes\nFinger still up one of my nostrils\nRight next to 'em, stuck at the light, the fuckin' shit's\nTakin' forever to change, it's stuck, these bitches are lovin' it\nRubbin' it in, chucklin', couldn't do nothin'\nPlay it off, \"What you bumpin'?\"\n\"Trunk Muzik, Yelawolf's better,\" fuckin' bitch!\nThey want me to flip at the label, but I won't succumb to it\nThe pressure, they want me to follow up with\nAnother one, after Recovery was so highly coveted\nBut what good is a fuckin' recovery if I fumble it?\n'Cause I'ma drop the ball if I don't get a grip\nHoppin' out shrubbery on you sons of bitches\nWrong subdivision to fuck with, bitch\nQuit snappin' fuckin' pictures of my kids\nI love my city, but you pushed me to the limit—what a pity!\nThe shit I complain about\nIt's like there ain't a cloud in the sky and it's rainin' out\nKool-Aid stain on the couch, I'll never get it out\nBut bitch, I got an elevator in my house\nAnts and a mouse—I'm livin' the dream!\n\n[Chorus]\nMaybe that's why I feel so strange\nGot it all, but I still won't change\nMaybe that's why I can't leave Detroit\nIt's the motivation that keeps me goin'\nThis is the inspiration I need\nI can never turn my back on the city that made me\nAnd (life's been good to me so far)", "image": "https://images.genius.com/2c354260f9edc6b2e9bf6b06c935a0b8.1000x1000x1.png"}], "artist": "Eminem"}