{"songs": [{"title": "Crooked Nigga Too (Raphael Saadiq Remix)", "album": "Loyal to the Game", "year": "2004-12-12", "lyrics": "[Intro: 2Pac]\nYo 'Pac yo, I heard you got beat up by the police\nGot a big fat lawsuit and everything\nNiggas just wanna know\nIf you still gon' be on some crooked-ass sheeeit\n\n[Verse 1: 2Pac]\nPlease tell me what's a nigga to do, and it's true\nAin't nuttin new, so I do, what I can to get through\nNow first they had me trapped and now I'm pissed\nA loaded AK-47 lay under my head so I don't trip\nOne motherfucker from the Underground\nAnd Big Stretch buckin niggas if they fuck around\nYo why I got beef with police?\nAin't that a bitch that motherfuckers got a beef with me\nThey make it hard for me to sleep\nI wake up at the slightest peep, and my sheets are 3 feet deep\nI guess it's hard for you to see\nBut now I'm pointin the finger at police\nInstead of them motherfuckers blamin me\nI got the right to bear a pistol\nAnd when the punk motherfuckers get to trippin I got shit too\nAnd maybe then you'll see the truth (hell yeah)\nBut until then, I gotta do what I do\nAnd stay a crooked nigga too\n\n[Hook: Raphael Saadiq]\nI've got to do, what I'm gon' do\nI'm gon' say what I'm gon' say\nI'm gon' live how I live - how else you want a nigga to live?\nI'm gon' do, what I do\nI'm gon' say, what I say\nI'm gon' live how I live - how do you want a nigga to live?\n\n[Verse 2: 2Pac]\nY'know you really can't say that ya blame niggas\nFuck bein tame, set aflame, time to aim triggers\n2Pac'll spark a revolution, fuck the Constitution\nI want my bucks for restitution\nThis time you got a bigger problem\nTime to face the niggas from South Central, Oakland, Brooklyn and Harlem\nAnd we ain't shootin at each other\nThat's my motherfuckin brother, so Dave Duke, run for cover\nAnd all the bitches from the Klan\nCome feel the wrath of a black man that doesn't smoke crack and\nI don't drink St. Ides (fuck that!)\nGenuine Draft, ganja ganja, and my fuckin tec-9\nThey know they scared to see us sober\nStop drinkin King Cobra, and niggas'll take the world over\nIt's all up to you (up to you)\nBlame the Korean, blame the jew, or be a crooked nigga too\n\n[Hook: Raphael Saadiq]\nI've got to do, what I'm gon' do\nI'm gon' say what I'm gon' say\nI'm gon' live how I live - how else you want a nigga to live?\nI'm gon' do, what I do\nI'm gon' say, what I say\nI'm gon' live how I live - how do you want a nigga to live?\n\n[Verse 3: 2Pac]\nAiyyo! Why me? Play like Jasmine Guy and try me\nI'll be damned if I die, come look at the rage in my eyes G\nThey got my homies in a jail cell\nAnd it's the Rebel and the Devil, and one of us is goin to Hell\nI got the whole place covered, with loc'd out brothers\nAnd nuttin but love for each other\nSo motherfucker make a motion\nI give a fuck, slice you up, and throw your ass in the ocean\nTemperatures drop; see it's cool to shoot a nigga\nBut they hate it when we pop the cops\nThat's when they gettin petrol\nYou better watch your step or you'll be left on death row\nBut I learn to look ahead of me\nStay strapped watch your back keep your eyes on the enemy\nWe blowin up precincts and OOOH\nYou can't fuck with the crew, of crooked nigga too\n\n[Hook: Raphael Saadiq]\nI've got to do, what I'm gon' do\nI'm gon' say what I'm gon' say\nI'm gon' live how I live - how else you want a nigga to live?\nI'm gon' do, what I do\nI'm gon' say, what I say\nI'm gon' live how I live - how do you want a nigga to live?\n\n[Refrain: Raphael Saadiq]\nIt's the coldest town from here to Georgia\n(I'm a crooked nigga too)\nIt's the coldest town from here to Georgia\nIt's the coldest town from here to Georgia\n(I'm a crooked.. crooked nigga too)\nIt's the coldest town from here to Georgia\nY'all gon' stop fuckin with me\n\n[Hook: Raphael Saadiq]\nI've got to do, what I'm gon' do\nI'm gon' say what I'm gon' say\nI'm gon' live how I live - how else you want a nigga to live?\nI'm gon' do, what I do\nI'm gon' say, what I say\nI'm gon' live how I live - how do you want a nigga to live?\nI've got to do, what I'm gon' do\nI'm gon' say what I'm gon' say\nI'm gon' live how I live - how else you want a nigga to live?\nI'm gon' do, what I do\nI'm gon' say, what I say\nI'm gon' live how I live - how do you want a nigga to live?", "image": "https://images.genius.com/aff64f752ccfff1d48590e5db3c0357a.300x300x1.jpg"}], "artist": "2Pac"}