{"songs": [{"title": "Let’s Stay Together", "album": "Theater of the Mind", "year": "2008-11-24", "lyrics": "* iTunes bonus track\n\n[Intro: sample]\nEverybody's breaking-breaking up\nLet's stay together-gether-gether\nLet's stay together-gether-gether-gether\nEverybody's breaking-breaking up\nLet's stay together-gether-gether\nLet's stay together-gether-gether-gether\n\n[Ludacris]\nYeah, tell y'all a lil' story right quick, right\nLuda!\n\n[Verse 1]\nFirst the Fat Boys break up, now every day I wake up\nSomebody done called it quits\nShit I thought Bobby and Whitney'd stay together forever\nIf they made it that long; I guess the drugs weren't that strong\nAnd now it's Russell and Kimora, even Jordan and Juanita\nAnd to top it off, Brad left Jen for Angelina?\nWhat the hell is goin on in this world, this just can't be!\nIf Will and Jada can do it then why can't we?\nHillary's still with Bill Clinton, how do they do it?\nHe got his dick sucked and the whole damn WORLD knew it\nNow Paul McCartney's losin half of his life\nAll because he got divorced from his wife\nSomebody said it's cheaper to keep her, but not in K-Fed's case\nCause Britney even had to pay for K-Fed's case\nNick and Jessica, Trina and Wayne\nAnd if you broke up wit'cha girl I know ya feelin the pain, because\n\n[Hook: sample] + (Ludacris)\nEverybody's breaking-breaking up\nLet's stay together-gether-gether\n(United we stand, divided we fall)\nLet's stay together-gether-gether-gether\n(United we stand, divided we fall, c'mon!)\nEverybody's breaking-breaking up\nLet's stay together-gether-gether\n(United we stand, divided we fall)\nLet's stay together-gether-gether-gether\n(United we stand, divided we fall)\n\n[Verse 2]\nFirst it was Shaq and Kobe, then Iverson and Philly\nT.O. and McNabb, even Game and 50\nI guess sometimes you gotta let the past be the past\nBut I'd give a hundred thou' to see Jay with Dame Dash\nB.G. with Lil Wayne, Juvenile and Turk\nMannie Fresh with Baby, how can we make it work?\nKrunchie with Three-6, Diamond with Crime Mob\nLauren Hill with the Fugees, Remy with Terror Squad\nLil' Kim back with Cease, and Snoop with mo' Dre\nDre with mo' Big Boi, CD's with mo' play\nWhat's Tribes with no Quest? Salt with no Pepa\nEven the Eagles broke up and got the fuck back together!\nSellin millions of copies, and gettin that cash\nAnd Raz B said Chris Stokes was gettin that ass\nI don't even understand it, what the hell went wrong?\nMaybe folks'll wise up and take heed to this song, because\n\n[Hook]\n\n[Ludacris]\nI can't take it, no!\n\nAt first Wu-Tang broke up, now O.D.B. is gone\nThen I'm hearin Cam'Ron don't talk to Jim Jones?\nWho'da saw that shit comin? Certainly not me\nOr the Dogg Pound break up, or Goodie Mo-B\nThen Shawnna almost jumped ship from D.T.P\nIf Chingy left and came back then damnit, why can't she?\nWe gotta think it's all for one, and one for all\nHIP-HOP! United we stand, divided we fall\nSo why is\n\n[Hook] - repeat to fade w/ ad libs", "image": "https://images.genius.com/abff9ac1df466053c5fe1b6b3c92056f.1000x1000x1.jpg"}], "artist": "Ludacris"}