{"songs": [{"title": "Normal", "album": "Kamikaze", "year": "2018-08-31", "lyrics": "[Intro]\nYo, how do I keep\n(Man, I don't know what’s up with these hoes, man)\nGettin' in relationships like this?\n(I'm just sayin’)\nMaybe it says somethin' about me\n(Yeah, yup)\nShould I look in the mirror?\n\n[Chorus 1]\nI just want you to be normal\nWhy can't you bitches be normal?\nAlways gotta be so extra\nWhy you always need a lecture?\nMy ex hates to talk, she's a texter\nEven when I'm in bed layin' right next to her\nWants to get back together\nSaid not 'til she gets her act together\n\n[Verse 1]\nShe thinks I'm bein’ mean and now\nShe starts to scream and shout\nShe’s about to let the demons out\nShe don't wanna see me with other females out\nI tell the bitch to beat it, take the scenic route\nShe retaliates by tryin’ to leave the house\nIn an evening gown with her cleavage out\nWe've been down this road too many times for me to count\nAnd all I can think is how—\n\n[Chorus 2]\nI just want you to be normal\nWhy can't you bitches be normal?\nAlways gotta be so extra\nLike a fuckin' terrestrial\nI guess it comes with the territory\nMy ex girl, she just declared war\nTherefore, I better prepare for it\nI guess bein’ weird's normal\n\n[Verse 2]\nAnd I don't know what's got a hold of me\nMost notably I've been zonin' to Jodeci\nI'm totally open, hopelessly devoted\nSo much so that I bet you she don't even know that she's\nThe first thing I think of when I wake up\nAnd the last thing I think of 'fore I go to sleep\nSike, hope she don't notice me goin' through her purse\nI know she cheats, so do I, I'm soulless, she's heartless\nNo wonder we're partners\nBoth got hundreds of charges\nDomestic disputes but we've always\nSwept it under the carpet\nEven when 911 gets the call that\nI slipped up and busted her jaw with\nA Louisville Slugger 'cause alls it\nReally does is make our love\nFor each other grow stronger\nShe won me over the second she tried to run me over\nTold her I'd keep it a hun', we over\nKicked her out, called her back, now she's coming over\nBut why is she so wicked?\nAnd how the fuck did I get so twisted\nUp with someone so unlikable and shifty\nWe're like nitrogen and hydrogen mixed with\nIgnitable liquids, but I'm finally seeing\nShe's only mine for the time being\nThat's why I keep bringin' up that one time she\nTried to two-time me\nAnd throw it up in her face 'til I dry heave\nHow could I be so naive?\nShould I leave or turn this entire evening\nInto a motherfucking crime scene?\nMaybe I'm just too ugly to compete with him\nYou weren't s'posed to agree, you fucking bitch!\n'Specially when you're the one cheated first\nNow the argument immediately becomes heated\nYou don't want me to flip, little conceited cunt\nEat a monkey dick wrapped in a stuffed pita fajita\nSlut, treat it just like a drum, beat it\nComplete it, and once you've succeeded, repeat it!\nI love you but I hope you fuckin' die though\nIn our business your friends like to pry so\nYou've got 'em all under cover just like moles\nHopin' they'll come back with intel\nBut I'm the one who's thrown into the spiral\n'Cause now the roles are reversed so here I go\nThinkin' I'm sly as I scroll through your iPhone\nWho the fuck's Milo?\nThe guy at work who drives a hi-lo\nI put a tracking device on your Chrysler\nAnd follow you while you drive home\nBut like a cyclone, I just got my disguise blown\nYou recognize me and had Milo flip me off\nRight out the passenger side window\nI hit a light pole, you skirt off\nAnd then pull up at 5 a.m. in the drive in a stretched white limo\nStumble in the side door and hit me in the head with Milo's demo\nBut like a drunk bum, what do I know?\nLet's sleep on it like they did Revival\nI told you you're the apple of my eye, so shut your pie hole\n\n[Outro]\nJust wanna be normal\nWhy can't you be normal? (Yeah)\nI just wanna be normal\nWhy can't you be normal?", "image": "https://images.genius.com/160b53c324c4cdeb709b605d3a591598.1000x1000x1.png"}], "artist": "Eminem"}