{"songs": [{"title": "I Wanna Thank Me", "album": "I Wanna Thank Me", "year": "2019-07-03", "lyrics": "[Intro: Snoop Dogg]\nLast but not least, I wanna thank me\nI wanna thank me for believing in me\nI wanna thank me for doing all this hard work\nI wanna thank me for having no days off\nI wanna thank me for... for never quitting\nI wanna thank me for always being a giver\nAnd tryna give more than I receive\nI wanna thank me for tryna do more right than wrong\nI wanna thank me for just being me at all times\nSnoop Dogg, you a bad motherfucker\n(Snoop Dogg, Snoop Dogg)\n\n[Verse 1: Snoop Dogg]\nEagle side, homie coming up\nI was young and I didn't give a fuck\nLong Beach nigga, a fiend for the bucks\nLean in my chucks, banger, I'm tough\nYeah, long time coming, had to earn my G\nGold digging hoes had to learn my fee\nI beat a couple cases, I'm H-O-T\nI'm Snoop Dogg to the world, gotta thank 'ol me\nWe celebrating, you hating on a real one\nAll the L's that I took, man, I still won\nBig bank rolls coming at ya\nWest Coast king, man, I need a statue\n\n[Chorus: Snoop Dogg]\nYeah, I said it, who did it like me?\nWho want the dice? Nigga, bet it\n20 plus years, I ain't even gotta sell it\nI ain't even got to show up to get the money\nMail it, I'm going in\n\n[Bridge: Marknoxx]\nOh, I paid my dues and earned my stripes (Can you hear me?)\nNo matter what ya say it's all me (Can you hear me?)\nBring that beat back, bring that B-Cat\n\n[Verse 2: Snoop Dogg]\nWho did it like the King? Go tell\nSent a bunch of kids to the NFL\nDid it from the dirt, nigga, can't you tell?\nDon't I ride by in that SSL?\nSnoopy had to get it on, ball, beat ten of y'all\nI'm just tryna show 'em how the men evolve\nCouple mill', then they into y'all\nStill screaming, rolling through my Hollywood stid-all (yeesh)\nBack up off me, sip your coffee, it's the Dogg show\nSmoking weed on TV like a Marlboro\nStanding there flexing, hoes see the drip\nThis crip, no question\n\n[Chorus: Snoop Dogg]\nWho bigger than me? Shit, yeah, I said it\nWho did it like me? Who want the dice? Nigga, bet it\n20 plus years, I ain't even gotta sell it\nI ain't even got to show up to get the money\nMail it, I'm going in\n\n[Bridge: Snoop Dogg]\nBattlecat, what you gon' do?\nHoes recognize, niggas do too\nLong Beach, East Side mad-ass lunatics\nStill own niggas who talk bitch shit\nDown for whatever, whoever wanna see me now\nSlap a bitch nigga out to get a grip\nTake a whole lot to be Snoop D-O-dub\nYou gotta put it down and always stay G'd up\n\n[Verse 3: Snoop Dogg]\nWho did it like a muhfuckin' legend?\nYeah, it hurts, church, reverend\nSat back, took a look at me, shit's classic\nPocket full of paper, the haters, they can't grasp it\nStill at the top of my game, I'm all-pro\nLost count of the cars, nigga, they all show\nI got a family to feed, now that's growth\nBut I'll still lay your ass out for the low\nNow, grown men make it hard to trip\nI'm talking big dick shit, man, it's hard to grip\nGot a whole gang of albums and some major flicks\nI got a wife, rich life, that's some major shit\n\n[Chorus: Snoop Dogg]\nBigg Dogg, yeah, I said it\nWho did it like me? Who want the dice? Nigga, bet it\n20 plus years, I ain't even gotta sell it\nI ain't even got to show up to get the money\nMail it, I'm going in\n\n[Outro: Battlecat]\nUsed to be out West, but now you hear me\nFrom the LBC, around the room, let's blow this smoke\nUsed to be out West, but now you hear me\nFrom the LBC, around the room, let's blow this smoke\nLa-da-da-da-dah\nIt's the Snoop to the D-O-double-G\n(Snoop Dogg, Snoop Dogg, Snoop Dogg)", "image": "https://images.genius.com/5cac0855f2f5614fa68316546c29066f.600x600x1.jpg"}], "artist": "Snoop Dogg"}