{"songs": [{"title": "Shit Can Happen", "album": "Devils Night", "year": "2001-06-19", "lyrics": "[Intro: Rondell Beene, (Eminem)]\nBitch (Yeah)\n\n[Chorus 1]\nShit can happen, shit can happen\nShit can happen, shit can happen\nShit can happen, shit can happen\nShit can happen, shit can happen\n\n[Verse 1: Kon Artis]\nThat's right motherfuckers we back\nSame slanging, orangatanging, wilding out on hoodrats\nThey say I act like I'm too famous to say hi\nAnd tell 'em what my name is but really I'm still nameless\nYou niggas don't get it yet, do you\nDeal or not, platinum or flop I still put it through you\nWith a Luger that'll spit fire\nAnd hit higher than a pitch by a bitch like Mariah\nYou think for one second since we got a deal\nThat we won't deal wit you in front of St. Andrew's still?\nYou gay rappers better learn that\nI won't stop until I see 'em turn back\nIf you don't slow that roll you got\nYou gon' see these Runyan Ave. niggas that really need some Prozac\nFo' sho' that, ask the others, Brigade'll lay you down\nNext to your mother's mother's grandmother\n\n[Verse 2: Kuniva]\nYou know I'm feeling real rowdy tonight\nReady to fight and half the niggas I give dap to I don't even like\nThe same cat who never gave a damn about your name\nI gives a fuck about it like the next L.A. Clippers' game (bitch)\nI kill you in ways you couldn't even fathom (punk)\nYou and your madame, it's really unexplainable how I have 'em\nWho call theyself screaming about a challenge (what?)\nNigga we got a gift while you barely making it off mere talent\nMy skills are deeply embedded even your ho said it (uh-huh)\nShe was knock kneed I fucked her now she's bow legged\nIn the middle of rapping I drop the mic (what?)\nAnd have a stare down and jump in the crowd and start scrapping (bitch)\nKuniv' and Kon Artis, my nigga we get it cracking\nWhile the paramedics pick you up we on the side laughing\n\n[Hook: Kon Artis]\nNow this ain't funny so don't you dare laugh\nShit can happen to him and yo' ass\nYou can be touched don't think you can't\nCause niggas ain't fuckin around no more man\nNow this ain't funny so don't you dare laugh\nShit can happen to him and yo' ass\nYou can be touched don't think you can't\nCause niggas ain't fuckin around no more man\n\n[Verse 3: Swifty McVay]\nThe feds can't hold me, I hold feds\nI was born with a dark ass cloud over my head\nRaining acid, you can't refrain from getting yo' ass kicked\nCause you talk too much - you asked for it\nI'm on some massive shit, everybody ignore me\nThey wouldn't fuck with me if I was performing at an orgy\nThese niggas get confronted (whattup now?) then they change stories\nI cut you and they thinking everything's hunky dory\nI even have you pouring me the gasoline for me\nPulling up slowly, cocktailing your homie\nYou met a lot of niggas but you wouldn't wanna know me (f'real)\nYo' ass might not even make it home wit your Roley\nDon't even try, in your system like e. coli\nTrying to beef with me, nigga please yo' people die\nI'm so wicked that my mama gave birth illegally\nI survived the abortion immediately, SURPRISE! AAAAAH!\n\n[Verse 4: Eminem]\nPicture me sitting in a jail cell rotting (Shit!!)\nOr barricaded in a motel with twelve shotguns\nSo when the cops come knocking each hand's got one\nCocked, ready to dump slugs heavy as shotputs\nOne man army, guns can't harm me\nYoung and ornery, worse than my Uncle Ronnie\nEver since I got my first gun pulled on me\nI can't stop airing out my dirty laundry\nMiddle fingers flipped at censorship\nYour friends just flipped over the swift penmanship\nEver since I spit some shit on Infinite\nI've been giving it 110%\nCause when I vent - most of my energy's spent on enemies\n80% of what I invent is Hennessey\n20% is from being hungry as sin\n10's because I love being under your skin *SHIT!*\nYeah! Shit can happen, so stick to rapping\nQuit the yapping or I'mma lift the mac and\nThat can lead to another mishap happening\nSkip the crap get the can of whoop-ass cracking!\n\n[Hook]\nNow this ain't funny so don't you dare laugh\nShit can happen to him and yo' ass\nYou can be touched don't think you can't\nCause niggas ain't fuckin around no more man\nNow this ain't funny so don't you dare laugh\nShit can happen to him and yo' ass\nYou can be touched don't think you can't\nCause niggas ain't fuckin around no more man\n\n[Outro Over Hook: Eminem]\nIt can and it will (nigga, nigga)\nFuck around with Amityville and you DIE\nInsanity spills from the mentality of twelve motherfuckers\nIn six different bodies with their personalities split\nFucking you up with hit after hit\nSticking you up with clip after clip\nMaking you suck dick after dick\nDirty motherfucking dozen\nThe Kon Artis, motherfucking Peter S. Bizarre\nSwifty McVay, the Kuniva, Dirty FATHER-fucking Harry\nPutting you down in a cemetery, you get buried\nAll you of you motherfuckers suck our motherfucking cocks!\nWe are not playing, we are not playing\nWe are not bullshitting, this is not a motherfucking joke!\nAll of you motherfuckers get smoked!", "image": "https://images.genius.com/591360993ef93e1c0a2402279fb90319.600x600x1.jpg"}], "artist": "D12"}