{"songs": [{"title": "Ion Memba", "album": "N9NA", "year": "2019-04-19", "lyrics": "[Intro: Tech N9ne]\nUmm\nI'm drawing a blank\nSo many drugs, I done did\nI don't 'member\n\n[Verse 1: Tech N9ne]\nIt's like I'm in the Twilight Zone\nI'm like gone, I might bone\nBack in the day but now my eyesight's blown\nComin' to see me 'cause of my microphone\n'Cause I write songs and now they wanna try right wrongs\nI don't 'member none of that, ain't no filler from a cat\nThat be off on another level for me to wanna spat\nWith somebody from a chat that is bringing summer back\nTen years later because a nigga sung a rap\nBut I listen to me, I am different\nSo I don't know what you think is fixing to be\nWhen I was twisting, you is nonexistent to me\nAnd now the word can't, it is missing the T\nMissing the T, but it ain't him\nWhen you was sipping the D and it bang trim\nAin't no mixing with me on the gang brim\nLot of chicks in the sea but I can't swim\nBitches sending me pics like, \"Remember this?\"\nWith a pic of they private, then send a kiss\nI don't try to remember or reminisce\nOh yeah, it smell like when I catch and skin a fish\nMemories escape me, when I take G\nMixed with molly and probably some AC\nID pasties, so fucked up Yates be\nDon't give you no valid reason to hate me\nI don't try to diss\nMessed up, I don't remember a lot of shit\nDon't be mad at me 'cause I ain't giving a cock to kiss\nAnymore, don't owe anybody a pot of piss\nThat's enough to have Tech hate it\nI don't remember us X-rated\nMy brain is so drugged and cess plated\nI don't really know what you be meaning when screaming that we sex made it\nHow the hell when I bust seeds off in her mouth\nOff in her mouth, off in her mouth, she's impregnated?\nI don't know what the fuck\nShe talking about, talking about, talking about, no\n\n[Chorus: Tech N9ne]\nYou 'member this? You 'member that? You 'member us? You 'member back?\nI don't 'member\nYou 'member we both on the 'yac, then headed back and we hit the sack?\nI don't 'member\nYou pulling that new stupid act due to the fact you super rap, who are you to cap?\nYou knew me then, don't know me now\nUsed to be friend, used to be down\nI don't 'member\n\n[Verse 2: C-Mob]\nLook, some people from the past still living in a mess, so stressed\nAnd they see your life is less grotesque\nSo they wonder how did you get so blessed?\nAnd the envy is up at last, they will bring up the past\nHoping that you retrogress\nThat'll make you really check those pests\nMad 'cause you kick it with the best, no less\nThe divine kind, I define grind 'cause I'm dying trying\nRhymes shine from a mind, I'm like an Einstein\nFrom the grime, I'm prime, climb on the timeline\nGet better with age every day like a fine wine\nBut they wanna try to bring back\nMemories of when I was a dingbat\nSing crack, do it all for the greenbacks\nBut I don't remember anything that\nThey talk to me, a debauchery\nWell, my bad, my memory's awful, G\nNow ease off of me, I think maybe when you see me\nYou don't wanna be reminded of your mediocrity\nYou keep stopping me\nBringing up shit to bring me down a notch\n'Cause in the past, I been down a lot\nBut now it goes up and you're hoping that my crown'll drop\nAnd that my sound'll stop, but see, I work hard and hustle\nAround the clock, I got the town on lock\nMarion, Indiana, you down or not?\nWell if so, quit coming around with toxic\nEnergy, 'cause I mentally block it\nTalk shit and you could get a snake bite pronto\nTryna fuck with the snake and bat, you get shit on\nGreat white guano\n\n[Chorus: Tech N9ne]\nYou 'member this? You 'member that? You 'member us? You 'member back?\nI don't 'member\nYou 'member we both on the 'yac, then headed back and we hit the sack?\nI don't 'member\nYou pulling that new stupid act due to the fact you super rap, who are you to cap?\nYou knew me then, don't know me now\nUsed to be friend, used to be down\nI don't 'member\n\n[Outro: Krizz Kaliko]\nOh, not me\nYou got me\nGot me mixed up\nI drunk elixir\nNow you get stuck\nOn reminiscin'", "image": "https://images.genius.com/8ebb9cdb1a785ebf6dcf120453e6e9aa.1000x1000x1.png"}], "artist": "Tech N9ne"}