{"songs": [{"title": "Realest Niggas", "album": "Rise To Power", "year": "2007-09-18", "lyrics": "[Hook:]\nThis here's for the real money makers ridin’ clean\nPockets on ugh shorty talkin’ on the jean\nNever get caught ‘cuz my dip game mean\nSippin’ that lean, the fuck is you mean\nMy game green with your money round here\nRidin' [?] blowing kush in the air\nChopper on the lap case a nigga actin' tall in it\nNip it in the bub' way before it's gettin' started\n\n[Verse 1: Rick Ross]\nI’m not stuck in the game, I fuck with the game\nSleep late, a nice brunch at P. F. Chang's\nLettuce rap, fresh pineapple juice\nSip a Cosmo while I lie in Malibu\nI get the truck washed while I’m sittin’ inside\nIf you feel this, wait till I’m spittin’ that live\nIf you livin’ a lie, you gotta face the dirt\nFully automatics and a few racial slurs\nEye of the tiger fire saliva if a nigga sound like me I’m more than likely the author, leader\nSlaughter, lead the war, great right\nI stay tight with the straight type\nAnd take white to the head late night\nStay tight slay mics straight dykes, what you pay like?\nFo’ five six, how I roll my shit\nOne of the six five, I sold my shit\n\n[Hook]\n\n[Verse 2: Gillie Da Kid]\nSee ‘em like Jack Tripper, 3 bitches I’m living comfortably\nRoll with me and my guns cause three is company\nAnd they don’t like us, feds wanna indite us\nSentence us with the lifers but snitchin’ ain’t like us\nHow I roll, I stick to the code\nI was getting bankrolls while your ass was in diapers\nGillie, you see I let the techs speak\nHeld a nigga 350 hundred pounds next week\nI hit ‘em righty in the ground next week\nGolden on Saturday, it's going down next week\nWe get money homie we don’t wish\nI cook a [?] pizza, colored in deep dish\nI re-up ever week quick, so it's needless to say\nI’m getting’ money hater\nAnd while you’re talkin’ ‘bout bitches, I’m talkin’ ‘bout paper\nAcres, so much layin' I never see my neighbors\n\n[Hook]\n\n[Verse 3: Reed Dollaz]\nIce cream scooper, those about 400 that’s just my footwear, c'mon\nBang bang to the death of me\nHoes see I'm the chef I got the recipe\nSo it's best you should know, dolla all about his paper\nThat's why all grandpas, uncles and brothers be hating me\nI break 'em down from A to Z, don't play with me\nNot toy brick, no joy-stick, no playing me\nHey, the chicks feeling my swag\nThe hood scream: 'Reed get in your back!'\nSo which one? Louis Vitton or the ice cream [?]\nIce cream sneaks too, my socks match that\n[?] Who gon' stop that? You gon' stop that?\nYou get popped that, teddy bear, candles , right where the block at\nBullet went through the front, brains flew out back, ugh\n\n[Hook]", "image": "https://images.genius.com/29b46b5e6777c0cfddcc1b604d7a2597.600x600x1.jpg"}], "artist": "Rick Ross"}