{"songs": [{"title": "Stereo Sun", "album": "Extra Lasers", "year": "2011-05-05", "lyrics": "[Hook - Eric Turner]\nIt's the way of the stage\nIt's like a stereo sun\nIt's the way I build up, the business really gets done\nIt's like a stereo sun\n\n[Verse 1 - Lupe Fiasco]\nI hear it: the spirit, and I don't fear it\nMatter 'fact, I steer it\nRight in the heart of the hardships, I don't veer it\nAnd this car is just a metaphor for my experience\nNo registration or insurance, just a license to ill\nGod's hands on the wheel, and my pedal's to the ceilin', peelin'\nSpeeding like 24 frames through the lights\nWith the traffic cameras filmin, brights\nSo I could see the brilliance of this life I've been given\nLivin' to start a revolution every minute\nDriven to win it, no breaks, no pittin'\nPole position ya soul, keep ya windows tinted\nSo we can see out it, but they can't see in it\nSo this here's ours, and them theirs rented\nCars moving at top gear, Jeremy Clarkson\nI feel like this my first track and I ain't even start nothin, yessir!\n\n[Hook - Eric Turner]\n\n[Verse 2 - Lupe Fiasco]\nThe sky's on fire, the storm is almost near us\nBut that's when I'm the clearest, when things are the severest\nI'll be here for its arrival and for its disappearance\nBroadcasting live and clear, even with the interference\nSee this is what it sounds like when life becomes lyric\nThe best thing ever, you should really come and hear it\nBut if you can't, cool. We'll be coming to your nearest, soon\nShining like two suns, it's better than two thumbs\nThe whole plot's to get you\nTo stop from doing what you do, to do better than you've done\nThen we'll stare down the feds in the room\nWho dares not to scare? Hear it, boom!\nUnaffected by your werewolves, ghosts and your 'boom'\nThe tour through the tombs don't do nothing to 'em, never!\nI turn the pressure into treasure\nMy problem's in the present and my presence is forever\nYes, sir!\n\n[Hook]", "image": "https://images.genius.com/6064ad68b3a05d49650aa973fff2bff4.500x500x1.jpg"}], "artist": "Lupe Fiasco"}