{"songs": [{"title": "Run", "album": "The Pretty Toney Album", "year": "2004-04-20", "lyrics": "[Intro: Ghostface Killah]\nPss… yo, yo, yo (yo son, roll!)\nOh shit, yo, yo, run!\n\n[Verse 1: Ghostface Killah]\nAiyo, I jumped from the 8th floor, step, hit the ground\nThe pound fell, cops is coming\nRunning through the pissy stairwells, I ain't hear nothin'\nBuggin', only thing I remember was the bullshit summons\nSo I stopped at the 2nd floor, ran across\nCracks is fallin', my pockets is mean, clean when I vanished off\nTook off, made track look easy\nThe walkie talkies them D.T.s had, black, they was rated PG\nRun, I will not give up, no, quick flag the car down\nTake me to… Ghost, here they come now!\nErrr! Pull off quick, back up, hit the bitch, dog\nTurned down Hill, light the Marley spliff\nRun! I will not get bagged on a rock\nRun! I seen what happened to Un, they bad with they cops\nRun! They amp shit, plant shit, destroy evidence\nFuck a case, I'm not coming home with no 56\nDie with the heart of Scarface and take 50 licks\nBefore I let these crackers throw me in shit\nBounce if you a good kid, bounce, do the bird hop\nCurse, swerve to get served, these cocksuckers got nerve\nHeard I was killing shit, they must got word\nThat I told the chief of Rich Port I don't wanna merge\n\n[Hook: Ghostface Killah]\nRun! If you sell drugs in the school zone\nRun! If you getting chased with no shoes on\nRun! Fuck that! Run! Cops got guns!\nThey givin' out life like by the ton\nRun! If you ain't do shit, you it\nThat next felony, nigga, is like three zip\nSo, run! Hop fences, jump over benches!\nWhen you see me coming, get the fuck out the entrance!\nRun! Fuck that! Run! Cops got guns! Mothafucka\n\n[Interlude: Jadakiss (Ghostface Killah)]\nAh-hah! I might gotta take my shirt off (yeah, kid...)\nI like that one (uh-huh, go in, go in!)\n\n[Verse 2: Jadakiss]\nYo, uh, it's Task Force Tuesday, the NARCS is in the black car\nI got five hundred hundred-packs in my backyard\nClear 12-12's that look like stuffed shells\nI'm cutting niggas' throats on the sales, while they puff L's\nDon't leave nothing unbagged, shave everything\nI learned from the OG's to save everything\nThey come by one more time, they gon' hop out\nThey two deep, and one is a bitch, she getting knocked out\nThen I can get rid of the pack. But I just copped this pretty chrome thing, so I'm dippin' with that\nUh, down-shifting on 'em like I got gears on me\n(Run!) Besides that, I got about 5 years on me\n(Run!) Scared to death, running like I got bears on me\n(Run!) My Timbs start feeling like they Nike Airs on me\n(Run!) It's hard for me to slow down\nIt's like I'm on the Thruway\nMy belt's in the crib on the floor by my two-way\nNow I'm trying to hold my hammer up, and my pants too\nIf they don't kill me, they gon' give me a number I can't do\nRather it be the streets than jail where I die at\nAnd I'm asthmatic, so I'm looking for somewhere to hide at\nBut they too close, and I got this new toast; imagine if I would've let off a shot or two, you know what I gotta do\n\n[Hook]", "image": "https://images.genius.com/1563d407e670f05603a84947a6af2c41.1000x1000x1.jpg"}], "artist": "Ghostface Killah"}