{"songs": [{"title": "No More Parties in LA", "album": "The Life of Pablo", "year": "2016-01-18", "lyrics": "[Intro: Johnny \"Guitar\" Watson & Junie Morrison]\nLa-di-da-da-a, da-a (I like this flavor)\nLa-da-da-da-di-da-da-a, la-a (La-a, la-a, la-a)\nLet me tell you, I'm out here\nFrom a very far away place\nAll for a chance to be a star\nNowhere seems to be too far\n\n[Chorus: Kanye West, Junie Morrison & Ghostface Killah]\nNo more parties in L.A.\nPlease, baby, no more parties in L.A., uh\nNo more parties in L.A.\nPlease, baby, no more parties in L.A., uh\nNo more (Los Angeles)\nPlease (Shake that body, party that bod-)\nPlease (Shake that body, party that bod-)\nPlease (Shake that body, party that body)\n\n[Verse 1: Kendrick Lamar & Kanye West]\nHey, baby, you forgot your Ray Bans\nAnd my sheets still orange from your spray-tan\nIt was more than soft porn for the K-Man\nShe remember my Sprinter, said \"I was in the grape van\"\nUhm—well, cutie, I like your bougie booty\nCome, Erykah Badu-me—well, let's make a movie\nHell, you know my repertoire is like a wrestler\nI show you the ropes, connect the dots\nA country girl that love Hollywood\nMama used to cook red beans and rice\nNow it's Denny's, 4 in the morning, spoil your appetite\nLiquor pouring and niggas swarming your section with erection\nSmoke in every direction, middle finger pedestrians\nR&B singers and lesbians, rappers and managers\nMusic and iPhone cameras\nThis shit unanimous for you, it's damaging for you, I think\nThat pussy should only be holding exclusive rights to me, I mean\nHe flew you in this motherfucker on first class\nEven went out his way so you could check in an extra bag\nNow you wanna divide the yam like it equate the math?\nThat shit don't add up, you're making him mad as fuck\nShe said she came out here to find an A-list rapper\nI said baby, \"Spin that 'round and say the alphabet backwards\"\nYou're dealing with malpractice, don't kill a good nigga's confidence\nJust 'cause he a nerd and you don't know what a condom is\nThe head still good, though; the head still good, though\nMake me say \"Nam Myoho Renge Kyo\"\nMake a nigga say big words and act lyrical\nMake me get spiritual, make me believe in miracles\nBuddhist monks and Cap'n Crunch cereal\nLord have mercy, thou will not hurt me\nFive buddies all herded up on a Thursday\nBottle service, head service, I came in first place\nThe opportunity, the proper top of breast and booty cheek\nThe pop community, I mean these bitches come with union fee\nAnd I want two of these, moving units through consumer streets\nThen my shoe released, she was kickin' in gratuity\nAnd yeah, G, I was all for it\nShe said, \"K-Lamar, you kinda dumb to be a poet\"\nI'ma put you on game for the lames that don't know they a rookie\nInstagram is the best way to promote some pussy\n\n[Chorus: Kanye West]\nScary, scary\nNo more parties in L.A.\nPlease, baby, no more parties in L.A.\n\n[Verse 2: Kanye West]\nFriday night, tryna make it into the city\nBreakneck speeds, passenger seat—somethin' pretty\nThinking back to how I got here in the first place\nSecond-class bitches wouldn't let me on first base\nA backpack nigga with luxury tastebuds\nAnd the Louis Vuitton store got all of my pay stubs\nGot pussy from beats I did for niggas more famous\nWhen did I become A-list? I wasn't even on a list\nStrippers get invited to where they only got hired\nWhen I get on my Steve Jobs, somebody gon' get fired\nI was uninspired since Lauryn Hill retired\nAnd 3 Stacks, man, you preaching to the choir\nAny rumor you ever heard about me was true and legendary\nI done got Lewinsky'd and paid secretaries\nFor all my niggas with babies by bitches\nThat use they kids as meal tickets\nNot knowin' the disconnect from the father\nThe next generation will be the real victims\nI can't fault 'em, really\nI remember Amber told my boy\nNo matter what happens, she ain't goin' back to Philly\nBack to our regularly scheduled programmin'\nOf weak content and slow jammin'\nBut don't worry, this one's so jammin'\nYou know it, L.A., it's so jammin'\nI be thinkin' every day\nMulholland Drive need to put up some goddamn barricades\nI be paranoid every time, the pressure\nThe problem ain't I be drivin', the problem is I be textin'\nMy psychiatrist got kids that I inspired\nFirst song they played for me was 'bout their friend that just died\nTextin' and drivin' down Mulholland Drive\nThat's why I'd rather take the 405\nI be worried 'bout my daughter, I be worried 'bout Kim\nBut Saint is baby 'Ye, I ain't worried 'bout him\nHad my life threatened by best friends with selfish intents\nWhat I'm supposed to do?\nRide around with a bulletproof car and some tints?\nEvery agent I know, know I hate agents\nI'm too black, I'm too vocal, I'm too flagrant\nSomething smellin' like shit, that's the new fragrance\nIt's just me, I do it my way, bitch\nSome days I'm in my Yeezys, some days I'm in my Vans\nIf I knew y'all made plans, I wouldn't have popped the Xans\nI know some fans thought I wouldn't rap like this again\nBut the writer's block is over; emcees, cancel your plans\nA 38-year-old 8-year-old with rich nigga problems\nTell my wife that I hate the Rolls so I don't never drive it\nIt took six months to get the Maybach all matted out\nAnd my assistant crashed it soon as they backed it out\nGoddamn! Got a bald fade, I might slam\nPink fur, got Nori dressin' like Cam\nThank God for me! (Los Angeles)\nWhole family gettin' money, thank God for E!\nI love rockin' jewelry, a whole neckful\nBitches say he fun-ny and disrespectful\nI feel like Pablo when I'm workin' on my shoes\nI feel like Pablo when I see me on the news\nI feel like Pablo when I'm workin' on my house\nTell 'em party's in here, we don't need to go out\nWe need the turbo thots, high speed, turbo thots\nDrop-dro-dro-dro-drop, like Robocop\nShe brace herself and hold my stomach, good dick'll do that\nShe keep pushin' me back, good dick'll do that\nShe push me back when the dick go too deep\nThis good dick'll put your ass to sleep\nGet money (Money, money, money)!\nBig, big money (Money, money, money!)\nAnd as far as real friends, tell all my cousins I love 'em\nEven the one that stole the laptop, you dirty motherfucker!\n\n[Bridge: Larry Graham]\nI just keep on lovin' you, baby\nAnd there's no one else I know can take your pla-, pla-, pla-\n\n[Chorus: Kanye West & Junie Morrison]\nPlease, no more parties in L.A.\nPlease, baby, no more parties in L.A., uh\nNo more parties in L.A.\nPlease, baby, no more parties in L.A., uh\nNo more parties in L.A.\nPlease, baby, no more parties in L.A., uh\n\n[Outro: Junie Morrison]\nLet me tell you, I'm out here from a very far away place\nAll for a chance to be a star\nNowhere seems to be too far\nSwish\n\n[Produced by Madlib and Kanye West]", "image": "https://images.rapgenius.com/23eeffe52ef34fd68186f3d705aa9160.600x600x1.jpg"}], "artist": "Kanye West"}