{"songs": [{"title": "Love Don’t Live Here No More", "album": "36 Seasons", "year": "2014-12-09", "lyrics": "[Verse 1: Ghostface Killah]\nFeelin' fresh, walkin' down the block\n'Bout to see my boo, it's about 6 o'clock\nLove is love, it'd been a long time comin'\n9 long years, I know she missed my lovin'\nHuggin', kissin' in the scent of the kid\nShe gonna fall out when she see me at the crib\nDing dong, can I speak to Bamboo?\nIt's me Penelope, stop actin' a fool\nShe said, \"damn, I thought you was dead\nNot a phone call? Not a card in the mail?\"\nFor real a phone call? Stop\nYou know I had to up and leave\nI told you I'll be back, girl, but you ain't believe\nShe told me 9 was too long, and she got a new man\nOne who gon' stay and hold it down for the fam\nSo scram, there's no more love for the kid\nSo I turned my head down and walked away from the crib\n\n[Hook: Kandace Springs (Ghostface Killah)]\nLoved so many times\nI've been alone so long\nHad to pull myself together\nFind my heart a brand new home\nGot a good thing goin' on\nCan't let you mess with my flow\nToo little, too late\nLove don't live here no more\n(Love is love, Tony's back up on the aisle)\n(Gone for 9 years like 9 months to a child)\nCried so many times\n(Where's my boo at? I need to see Bamboo)\n(I got a lot of things on my mind, to explain to you)\nLove don't live here no more\nLove don't live here no more\n\n[Interlude: Ghostface Killah]\nIt's like that?\nOkay then where you put all my stuff at then?\nYou know, I thought, you know I swear he's, he been doin' this for too long\nI done came home, you got another man, you know what\n\n[Verse 2: Ghostface Killah]\nOh word, so you over it? That's absurd\nI never did a damn thing to deserved it\nThis is a man's world, I go away come home lookin' for you\nNow you fuckin' up the plans, girl\nYou another man's girl, that ain't kosher\nOnce you see the kid's face you're supposed to\nDrop what you're doin', show your loyalty and love\nStep out on the porch with a kiss and a hug\nYo you buggin'\n\n[Hook]\n\n[Outro: Ghostface Killah]\nJust can't understand, you know. I treated you, I gave you everything you wanted. You know what I'm sayin'? And it's like you got another dude laying in the bed?\nWearin' my robes, wearin' you out\nI know I was gone but damn, I just can't get it, baby\nBut I loved you though man, and I still do though", "image": "https://images.genius.com/b7e8d5889ca7a25f1f186a54b799b1ab.1000x1000x1.jpg"}], "artist": "Ghostface Killah"}