{"songs": [{"title": "Message To Young Rappers", "album": null, "year": null, "lyrics": "[The Notorious B.I.G]\nWhat advice would I give to young rappers? Take control of your shit, don't -- don't be the type of rapper.. Don't be a stupid rapper.\nA stupid rapper is a motherfucker that has somebody else tell them what to do -- which is not always wrong, but -- if it's something that you feel that you don't have to do, you really have to question it and find out why they want you to do it. Most niggas, they feel like, well, \"you see what Biggie's doing! Y'know, he has the hat, the Kangol, and, and this, and you have to be like that!\" But if you don't really wanna be like that, you don't have to be like that, you know what I'm saying? A lot of motherfuckers just try to tell a nigga to do something so quick, and -- and give them examples of other motherfuckers who did it and blew up and make them think they can do the same thing, which is not always necessarily true. And at the same time, you got to watch your money. It's so much funny shit in this game, man -- and they can play with your money, and you won't even know. I mean, as soon as I got in the game, I got a lawyer to watch my lawyer. That's just the way it's supposed to be played, you know what I'm saying? I speak to niggas -- I speak to niggas that got money in the game and they let me know, you know dog, it's a \"dog eat dog'' world. Niggas is trying to get as much as they can. And if you a ignorant motherfucker, they gon' thrive off that. They can tell you anything. And I'm -- I never been stupid, so.. Especially with a whole big lump sum of money? I gotta keep by on that. So I just stay more in the business side of everything -- instead of being a nigga that's gonna be drunk at the bar and fuck all the bitches and.. and just, stay in hotels all day, and just trick a whole lot of money, I stay home with my wife and watch my money. It comes a lot easier that way. And.. you'll have a lot of money!", "image": "https://images.genius.com/accf2df97375292b16f399ff6ec71e6e.500x500x1.png"}], "artist": "The Notorious B.I.G."}