{"songs": [{"title": "Black Wrist Bro’s", "album": "Searching for Jerry Garcia", "year": "2005-08-09", "lyrics": "[Intro]\n\"Now, we must all fear, evil men\nBut there is another kind of evil, which we must fear most\nAnd that is, the indifference, of good, men!\"\n\n[Verse 1: Proof]\nAiyyo doody, it's all about us, you hear me?\nI'm only callin on us, now fear P or die dumb\nLie none 'til my dawg blast the gun for my dawg\nHave a nigga family run to the morgue\nGotta ID the body, for tryna touch mine\nOn some Bad Boy, Puffy shit, fuck Shyne\nFuck fame, you hear me? Don't try to touch my co-D\nMy roll D, protected like my O.G.'s\n\n[Verse 2: 1st Born]\nSo never say never, well forever dawg I'm rock witchu\nWatch you hatin, contemplatin, waitin to take a shot at you\nIt's just me and you plus pistols duty cause niggas talkin\nLeast when we speakin same dudes that felt the heat, traced in chalk\nWe put it down on the block, these niggas flagrant\nMakin statements indictin extra cases, needin an early placement\nFirst and firm, never duckin and aim\nForever co-defendants Iron Fist, I feel such as Citizen Kane\n\n[Verse 3: Proof]\nIt's easy to be the coldest in life\nBut can you write your heart in a rhyme and spit your soul in the mic?\nThe streets talk and the weak fall\nThey currently devour the soft but they never eat dawgs\nWith a few others, two brothers and two mothers\nIn a blaze of a light, I bet it's two of us\nDon't try to do some slick shit and die without it\nCause I bet it on your life, you won’t die without me\n\n[Verse 4: 1st Born]\nPeep how I pound that ass and finger-fuck her\nBlaze at crews in multiples of two’s even single suckas\nBlack Wrist, Iron Fist all day\nThe S.K. spray, make niggas move like \"Ray!\"\nFor the fat funny guy, I jerk 'em like Jackie Gleason\nLeave 'em standin indecent, wheezin needin to know they placement\nIn the middle of murk season, I flirt like a church deacon with death\nOr at least until my last breath\n\n[Chorus: Proof]\nMy dawg is me and you\nTo them tats on our right wrist we both bein true\nYo' needs is my needs, my seeds is yo' seeds\nOne hurt and we both bleed\nWe gon' ride 'til them wheels fall off\nOr God wanna kill us off\nI don't duck when you pop that gat\nDon't ever doubt that you got my back\n\n[Verse 5: 1st Born]\nWe put our life stories in a song, boast how we pop nines\nIt's the truth duke and more than just a hot line\nI got mine, mine is yours cuz, you ready to squeeze\nMy niggas down on they luck, y'all niggas down on y'all knees\nHolla at him, you holla at me\nI'm down for whatever forever, however it gotta be\nIn the clubs or the streets, once these thugs feel this heat\nBlast snubs for the beef, with the love of the D\n\n[Verse 6: Proof]\nYou want trouble with P then that's trouble with 1st\nWe carry weight on our back that's doubled this Earth\nYou know where we at, in the struggle to search\nCome thug on my turf, leave your blood in this dirt\nWith the pride of your manhood I paved the bricks\nLivin life like a movie, it's a gangsta script\nWith my dudey my co-star, been in two so far\nTwo hearts like rice with no R\n\n[Chorus: Proof]\nMy dawg is me and you\nTo them tats on our right wrist we both bein true\nYo' needs is my needs, my seeds is yo' seeds\nOne hurt and we both bleed\nWe gon' ride 'til them wheels fall off\nOr God wanna kill us off\nI don't duck when you pop that gat\nDon't ever doubt that you got my back\nMy dawg is me and you\nTo them tats on our right wrist we both bein true\nYo' needs is my needs, my seeds is yo' seeds\nOne hurt and we both bleed\nWe gon' ride 'til them wheels fall off\nOr God wanna kill us off\nI don't duck when you pop that gat\nDon't ever doubt that you got my back", "image": "https://images.genius.com/ab9a6517cd52ed1370641d9d44571fdd.500x500x1.jpg"}], "artist": "Proof"}