{"songs": [{"title": "Killa Hill Niggas", "album": "Cypress Hill III: Temples of Boom", "year": "1995-10-31", "lyrics": "[Capitán Pingaloca]\n\"Esto no me gusta. Aquí la gente, la gente no sirve pa' mierda\nAquí yo soy, yo soy Capitán Pingaloca. Y to' mundo aquí\nMe sirve a mi o va pa'l carajo. Oye... revolución compadre!\"\n\n[B-Real]\nIn the midst of the madness no question, who's the baddest\nMC's in the game runnin for the status\nTake a few seconds to review the crews\nSittin on top is the Hill lookin over you\nKilla Hill Niggas, cream in my dream\nCookin up a scheme for all them big bank figures\nThe world is yours, but it can be mine and his\nBust you out the frame, I don't give a fuck who it is\nNumber one mission, opposition\nGet thrown sent home in dead position\nIn the casket, best wishes\nAt the bottom of the lake, sleepin with the fishes\nFull out search for the body\nOf the MC's who be comin to disrupt the party\nNo wins, no ends, no way\nThat I'm ever gonna let ya come back again!\n\n[RZA]\nCheck my dramatics, brains get splattered, dreams shattered\nSabas get blasted for words he packaged\nPeep the sequence; crab adolescents, on his defense\nPower-U niggas talkin fast like Puerto Ricans\nWhat you seekin, son I catch cream like Dominicans\nLast Mohican, lyrics I'm speakin, wild as Indians\nTomahawk - Shaolin slang, the violent talk\nUpstate New York, where chumps get extorted for Newports\nWhat you thought?\n\n[B-Real]\nEase back, ease back or I squeeze up on the trigger\n- that I'm ever gonna let ya come back again\n.. that that that I'm ever gonna let ya come back again\nEase back, ease back or I squeeze up on the trigger\n- that I'm ever gonna let ya come back again\nEase back, ease back\nEase back, ease back or I squeeze up on the trigger\n- that I'm ever gonna let ya come back again\n\n[Capitán Pingaloca]\n\"Y ya está dicho. Todos los que no les guste mi 'rebote' van a morir\nYo le voy a meter una bala a la cabeza a cualquier maricón\nQue no me persiga a mi a la 'singadapuerta'. ¡Oye, hijo de puta!\n¡Quiero quemarte la cara!\"\n\n[U-God]\nWords drop in chant, the cheeky-eyed slant\nI'm takin these cannabis plants yo for grant'\nExotic, narcotic, tunes slam soon\nFrom a dune in the desert Mega-Babylon pleasure\nComin out the domepiece, smell my aroma\nWarrior nomad, put you in a coma\nComma, llama, smash-crashin your armor\nDrama, I'm a, stealth aircraft bomber\nHere is where I dwell at the gates o' hell\nIt ain't where you're from it's where you're in the mentals\nAnd if not yo, credentials are essential\nI see reality, few things surroundin me\nThree like a spread, precise strikes the lyric\nNot frontin or braggin, hundred percent red dragon\nPine fragranced lyrics, the rhymes you can't imagine\nThe globe-trotter, call me Meadowlark Lemon\nFive part criminal, two part felon\n\n[B-Real]\n- that I'm ever gonna let ya come back again\n.. that that that I'm ever gonna let ya come back again\nEase back or I squeeze up on the trigger\n- that that I'm ever gonna let ya come back again\nEase back, ease back or I squeeze up on the trigger\n- that I'm ever gonna let ya come back again\nEase back.. ease back..\nEase back, ease back or I squeeze up on the trigger\n- that I'm ever gonna let ya come back again\nEase back or I squeeze up on the trigger..\n\n[Capitán Pingaloca]\n\"Esto es muy antiguo. Esta dicho! Aquí, la revolución! No se va a ver por televisión\nTodos los maricones del norte, que los voy a matar yo\nVa a ser aquí en nuestro país. Y todos los 'singamasones'\nQue están chingando el mundo. También, van a ver la muerte\nDe ellos mismos, en las manos de ellos. Un día, va a ser sangre\nMucha sangre. La peste de los cuerpos muertos, van a oír\nQue se va a hueler hasta los Estados Unidos, estos cabrones\nQue con la democracia, que nos 'tan chingando en el culo\nTodos son unos mismos cabrones...\"", "image": "https://images.genius.com/05081a10b4aaa2a1d10f8ab1c10a10c8.1000x1000x1.jpg"}], "artist": "Cypress Hill"}