{"songs": [{"title": "Breakdown", "album": "Brown Sugar: Music From the Motion Picture  Soundtrack", "year": "2002-09-24", "lyrics": "YO!\n\n[Verse 1]\nGood evening ladies and gents, close and distant fam\nLet me break it down for ya'll exactly who I am...(CAV)\nThat brotha straight off of Myrtle Ave\nThat dude that make the other dude say that's my man, (CAV)\nIt ain't nuttin' I want I can't have\nThe haters know it's real and that's why they mad\nThey struggle so hard while I just lay back\nThey sound under pressure, sweaty and straight wack\nI rock like this because I ain't that, (CAV)\nTell the players I'm taking the game back...\nMatta fact tell the coaches, the GMs, and owners\nShut down the stadiums, it's over\nI make the cat's in the back draw closer\nGet the comp choked up like white folks on Oprah\nYeah you dope, but (CAV) it's more doper\nMore skill, more style, and more focus\nI hit the lab with good shit to smoke up\nAnd tell the sound man where I wanna go from\nBlow up, skit sheet across the notepad\nSchool em' all from the drop out to post grads\nWhat history book you do or don't have\nThere's only two eras of rap, pre and post CAV\nNow you know that\nStop the train, there's no place for the game left to go at\n\n[Hook]\nCavee is my name but you can call me, (CAV)\nIt's all the same abbreviated or whole\nShout it out so it don't be a secret to folk it go, (CAV)\nShort for Cavee but I'm not from Cali\nI'm from the rotten apple, dirty streets and alleys\nBed-Stuy Brooklyn doin' it exactly, Get at me!!!\n\n[Verse 2]\nHolla!!...Like Missy and Ja Rule\nAin't a crowd in the world that CAV cannot move\nHot dude, cats was thinkin' it's not true\nBut come front row at the show, I got proof\nI went from sellin' candy in junior high school\nTo servin' spoony g for the fiends to gnaw to\nGot sent upstate on a bus, (Not cool)\nIn the yard thinkin' damn should've listen to ma duke\nCome home in 99, what the fuck I'm gonna do\nI won't move bundles, I got a new hustle\nI quit pie baking, started rhyme makin\nBuildin' up my rep to be one of the five greatest\nAnd I ain't saying CAV the best nigga out there\nBut until he appear, I'm sittin' in his chair\nAnd I'mma need a few moments just to get in ya'll ear\nTo make you forget that dude was ever even here\nI got two words for the world: Be prepared\nI got three words for your girl: Don't be scared!\nAnd when they ask where the real hip-hop, IT'S OVER HERE!\nAnd when they ask where Brooklyn at, HOLD YA EARS!\nIt's like YEAH! Chris Antione Vashon\nCapricorn hit em' off with the classic bong and then I'm gone...\n\nRidin' back to Brook-Lan... boyeeeeee", "image": "https://images.genius.com/ddd86fe38c4273dea84aef9a607c4d17.500x500x1.jpg"}], "artist": "Yasiin Bey"}