{"songs": [{"title": "The Rocker", "album": "Poindexter", "year": "2009-09-17", "lyrics": "[Hook]\nUh, they call me the rocker\nUh, yeah, uh-huh, uh\n\n[Verse 1]\nThey call me the rocker\nI get down like 2Pac and Big Poppa\nSome say he too birds, you can't stop him\nNiggas got too much beef like two Whoppers\nLook at my clockers, it's about time\nFor a nigga to mature like a glass of fine wine\nAin't no nigga alive can outshine\nI get sneaks, but don't pay like I'm crime\nI run this bitch, cause I'm Will Smith\nCause I am legend and you just Hitch\nNaw, I'm Hitch\nCause I get bitches\nWell, I got more than one so call me eight Hitches\nWe ain't got riches, just some nice kicks\nSo call me Bruce Lee who's dressed in nice shit\nHaters think I'm lame and girls think I'm sick\nBut both of them groups is riding my dick\n\n[Hook]\nYeah, they call me the rocker\nCall me Mr. Gambino\n\n[Verse 2]\nUh-huh, check this out\nI'm fly like birds and I spit real shit so my flow like turds\nAnd my words absurd so I turn it all around\nSo my mouth is my ass and I sit when I'm loud\nAnd I'm black and I'm proud\nAnd I'm white and I'm rich\nSo fuck it, I'm a martian, I'm Lilo and Stitch\nNiggas say I sound like Weezy and shit\nWell he the best in the game so what's wrong with that?\nAre you trying to tell me that my rhymes is phat?\nCall me Usain Bolt cause I run the track\nNigga I'm sick of that\nStop comparing me to people\nI know my voice funny like my name John Heder\nAnd I'm out of this world and I'm hot like space heaters\nAnd my girl top down so I call her two seater\nMy iPhone blast like TNT\nI text back to home girl, \"What you know 'bout me?\"\nI'm in NYC or in ATL\nAnd my wallet stay fat like Kenan plus Kel\nNigga what's that smell, cause my shit don't stink\nCause my shirt bright blue and my shoes hot pink\nAnd I finish this drink that I call a Twin Tower\nTwo Bud Lights and a whiskey sour\nWhere I fall down, that shit is ground zero\nLittle kids saying, \"There goes my hero!\"\n\n[Outro]\nHahahaha\nThey call me the rocker, nigga!\nUh, they call me the rocker\nYo I'm out man", "image": "https://images.genius.com/78bea76bf210cec3130c214f2a4ab5f7.800x800x1.jpg"}], "artist": "Childish Gambino"}