{"songs": [{"title": "Through the Wire (Live at Abbey Road Studios)", "album": "Late Orchestration", "year": "2006-04-24", "lyrics": "[Intro (Over Chorus): Kanye West & Audience]\nNow if the Roc is in the buildin', say, \"Hell yeah\" (Hell yeah)\nThrow your diamonds in the air\nIf the Roc is in the buildin', say, \"Hell yeah\" (Hell yeah)\nThrow your diamonds in the air\nIf the Roc is in the buildin', say, \"Hell yeah\" (Hell yeah)\nThrow your diamonds in the air\nIf the Roc is in the buildin', say, \"Hell yeah\" (Hell yeah)\nThrow your diamonds in the air, keep your diamonds in the air\nYour diamonds in the air, yeah, yeah, yeah, yeah\nYeah, yeah, yeah-yeah\n\n[Chorus: Chaka Khan]\nThrough the fire, to the limit, to the wall\nFor a chance to be with you, I'd gladly risk–\nThrough the fire, through whatever, come what–\nFor a chance at loving you, I'd take it all–\nRight down to the wire, even through the fire\n\n[Verse 1]\nI drink a Boost for breakfast, an Ensure for dessert\nSomebody ordered pancakes, I just sip the sizzurp\nThat right there could drive a sane man berserk\nNot to worry, Mr. H-to-the-Izzo's back to wizz-ork\nHow do you console my mom or give her light support\nTellin' her her son's on life support?\nAnd just imagine how my girl feel\nOn the plane scared as hell that her guy look like Emmett Till\nShe was with me before the deal, she tryna be mine\nShe a Delta, so she'd been throwin' that Dynasty sign\nNo use in me tryna be lyin', I been tryna be signed\nTryin' to be a millionaire, how I used two lifelines\nIn the same hospital where Biggie Smalls died\nThe doctor said I had blood clots, but I ain't Jamaican, man\nStory on MTV and I ain't tryna make a band\nI swear, this right here, history in the makin', man\n\n[Chorus: Chaka Khan]\nThrough the fire, to the limit, to the wall\nFor a chance to be with you, I'd gladly risk it all\nThrough the fire, through whatever, come what may\nFor a chance at loving you, I'd take it all the way\nRight down to the wire, even through the fire\n\n[Interlude (Over Chorus): Kanye West]\nYeah, through the limits, to the wall\nIf y'all know this, sing along with it\nWhat? I hear you, I hear you, I hear you\nThrough the– uh, through whatever, come\nI can't hit that note either, fam\nYeah\nUh, uh, question\n\n[Verse 2: Kanye West]\nWhat if somebody from the Chi' that was ill got a deal\nOn the hottest rap label around?\nBut he wasn't talkin' 'bout coke and birds\nIt's more like spoken word, 'cept he's really puttin' it down?\nAnd he explained the story 'bout how Blacks came from glory\nAnd what we need to do in the game\nGood dude, bad night, right place, wrong time\nIn the blink of a eye, his whole life changed\nIf y'all could feel how my face felt\nYou would know how Mase felt\nThank God I ain't too cool for the safe belt\nI swear to God, driver two wanna sue\nThere's a lawyer for the case to keep what's in my safe safe\nMy dawgs couldn't tell if I…\nI looked like Tom Cruise on Vanilla Sky, it was televised\nIt's been an accident like GEICO\nY'all thought I was burnt up like Pepsi did Michael\nI must got a angel, ‘cause look how death missed his ass\nUnbreakable, what, you thought they'd call me Mr. Glass?\nI look back on my life like the Ghost of Christmas Past\nToys \"R\" Us where I used to spend that Christmas cash\nAnd I still won't grow up, I'm a grown-ass kid\nSwear I should be locked up for stupid shit that I did\nBut I'm a champion, so we turned tragedy to triumph\nMake music that's fire, spit my soul through the wire\n\n[Chorus: Chaka Khan]\nThrough the fire, to the limit, to the–\nFor a chance to be with you, I'd gladly risk it–\nThrough the fire, through whatever, come what–\nFor a chance at loving you, I'd take it all the way\nRight down to the wire, even through the fire\n\n[Outro (Over Chorus): Kanye West & Audience]\nYeah, say, \"Hell yeah\" (Hell yeah)\nNow throw your diamonds in the air\nIf the Roc is in the buildin', say, \"Hell yeah\" (Hell yeah)\nKeep your diamonds in the air\nIf the Roc is in the buildin', say, \"Hell yeah\" (Hell yeah)\nNow keep your diamonds in the air\nIf the Roc is in the buildin', say, \"Hell yeah\" (Hell yeah)\nKeep your diamonds in the air, keep your diamonds in the air\nYour diamonds in the air, yeah, yeah, yeah, yeah\nYeah, yeah, yeah-yeah, yeah-yeah", "image": "https://images.genius.com/664fe2cf167d887dd94ca2859078fb37.640x640x1.jpg"}], "artist": "Kanye West"}