{"songs": [{"title": "Fuck Ya Hip Hop", "album": "Setbacks", "year": "2011-01-11", "lyrics": "[Verse 1: ScHoolboy Q]\nI think my pressure boiling from all the shit that's spoiling\nUh, I once was on it but now my head's enormous\nUh, your shit was boring, my art is fast and forming\nCreativity is what you lack in your performance\nYou see the crowd nigga? Microphone checker\nMr. Home Wrecker, give me hard liquor\nLet the blunt flicker, you see my style evolve\nReservoir Dogs and we some Hannibals\nIf I would catalog, feeling phenomenon\nI'm after the Parmesan, while gripping my fire arm\nBang, he lost an arm, bang, he writing nothing\nNigga you wasting time, I'm wasted, past the line, I'm hard\nMy nig, you whine, you broke, my nig, you lying, you owe\nYou buying dimes, look my nig, we know the signs\nBut quick to speak our minds, fronting like you balling man\nI couldn't tell, Hell, smoking more than what your dealer sell\nHuh, super fail, super duper fail\nListen to the Schoolboy, my mic can teach you well, Hell\nHah, left him at a pit stop\nTop Dawg, mothafuck your hip hop\n\n[Hook]\nMothafuck your hip hop\nMothafuck your hip hop\nYou ain't gotta cop it when my shit drop?\nMothafuck your hip hop\n\n[Verse 2: Big Pooh]\nThey don't wanna see you shine, they don't wanna see you grow\nThey don't wanna see you sign on that line and get doe\nWanna keep you in they pocket, I fire like a rocket\nI'm tryna blow up, like sticking forks in the socket\nI did it for the love, I do it for the art\nNow how am I supposed to write these 16's in the dark?\nMy car's on park, I can't eat skills\nAnd props ain't gon' pay all these mothafuckin' bills\nI can keep it real and get paid at the same time\nMoney in my pocket won't reflect on my next line\nNext rhyme, next date, showing off my chest plate\nBelly big, looking all full, cause I just ate\nKnow some shit been going wrong if I lost weight\nAin't about the doe, but I need it now, won't wait\nCan't stop, won't stop, not even a drip drop\nSay what you want but mothafuck your hip hop\n\n[Hook]\n\n[Verse 3: Murs]\nThey say, \"Murs why you put Dogg Pound on Paid Dues and shit?\nMust have gone mainstream, sold out losing it\"\nNiggas that's been underground for years and ain't doing shit\nMy homies ain't no B-boys fool, all they do is Crip\nKeep on talking shit and they gon' sock you in the lip\nAnd you gon' do is get mad and try to sue a pimp\nThen I'm spending loot on a lawyer that's ludicrous\nCashing out my street cred for you? Man, I'm through with this\nI'm a changed man, that's the only reason you exist\nIf this was '96 we would have caught you in a twist\nThe little homies busting at you out the Bronco\nPeel your cap ten kick back at the compost\nLarge orange bang and a bomb plate of nachos\nBiter broke nigga, quit hating, keep your mouth closed\nRapping 30 years, you still ain't this hot\nShut your ass up nigga, mothafuck your hip hop\n\n[Hook]", "image": "https://images.genius.com/4e5d39814aadb84f19c68cb7ca188a5d.950x946x1.jpg"}], "artist": "ScHoolboy Q"}