{"songs": [{"title": "I’m Me Freestyle", "album": "The Bar Exam 2", "year": "2008-09-20", "lyrics": "[Verse 1]\nYeah, I got money on my mind, that's why I'm twice on my grind\nI'm nice cause I rhyme like it's my life's on that line\nThe second that I'm provoked, I snap into a point\nThat ain't controllable, then it's either war, or another quotable\nDon't let me get a hold of you dudes, I'll murder you on camera\nGet Kelly's lawyer and get a mole removed\nI probably shouldn't have said that, fuck y'all\nOn the record, off the record\nIf I'm on the record, I'ma off the record\nI need a push when I'm tired of rhyming\nGo 'head, diss me\n'Cause me and George Bush got a lot in common\nWe both got no sense, we love to go to war\nAnd we stay looking for weapons of mass destruction\nThis industry is Hilary Clinton literally, listen\nYou ain't got no choice now, roll with a nigga\nIf you twisted enough to picture a devil mixed with a angel\nThat's sick, drunk inside a Range Rov, that's this\nWish I could stick every rapper in this bitch in a building\nLet 'em cypher while I fly a plane through that bitch\nCause I hate y'all, I'm tri-polar with the 8 ball\nIf I want you on my album, I pull out the K and make y'all\nIn case y'all wanna share my light, I'm gonna tell it like it is\nFuck it, it's my Jeremiah Wright\nI'm a motherfucking problem, I don't care if y'all don't like\nTimes three, nigga, I'm me, nigga\n\n[Interlude]\nThe Evil Genius!\nGreen Lantern!\nI'm me, nigga\n\n[Verse 2]\nBig dick, bitch, big balls\nWe the kind that supply the rock like Chris Paul\nThe same kind that aim 9s, insane conscience\nAnd then we get rid of the rock like Dwayne Johnson\nLadykiller, the fly version of Orenthal\nYou ain't got no DUIs then you probably a cornball\nWittiest, if you call a laptop a labtop\nYou sound like a scientist, but you probably a idiot\nYour stories ain't holding up, y'all niggas lying\nGot me thinking y'all either too young or y'all ain't old enough\nNiggas saying, \"When Royce gonna stop beefing with rappers?\"\nBitch, when hell freeze over and Wayne sober up\nBy the way, fuck all DJs! I'm just kidding\nI just threw that in there to get y'all attention\nNo intention of ever dying, nigga, life too sweet\nTwo words for who don't like me, \"fight\" and \"me\"\nI take care of my family\nThey say, \"Do the kid rock like Pam Lee?\"\nThe answer is yes! (Yes!)\nAnd I invest, it takes money to make money\nSo I make green off Green like Stan Lee\nSmart shit, I ain't got beef with no Joe Budden\nY'all gon' get one of these niggas killed tryna start shit\nNiggas hired muscle 'cause living is a privilege\nThe only rapper I admire for his strength is Xzibit\n\n[Interlude]\nIt's an invasion!\nI'm me, nigga\nGreen Lantern, drop that shit!\n\n[Verse 3]\nI killed it, right away\nSoon as you cross, go 'head, you got the right-a-way\nGive a nigga iron like vitamin, play\nI will ride up in broad day and night a nigga day (Brrrrat!)\nDrunk! I'm a recovering outpatient\nYou at the top, you shot, your spot is now taken\nPsychotic is the ploy, how the fuck you rapping and you gay?\nAnd you've been spotted with a boy like a Dalmatian?\nIf I switch up, I'd probably be instantly selling\nGot a clip full of pellets known as MC repellent\nWhile you talkin' 'bout your money and I can't have none of it\nI'll hit a nigga low, just for the Zab fun of it\nI will never lose, never lost, I'ma prove it\nExcept for my virginity, but I was tryna lose it\nI be on some Tom Cruise shit\nStanding on the couch in the club\nLaughing bout my dime new chick (Oh!)\nShe the shit, but if you ask her she useless\nI'm in her pocket\n'Cause I got a rocket down under like Houston\nSo I'm gonna keep being me and you should keep being you\nIf being you offends me, indeed, it's gonna be me and you\nBut understand that if it's that, it's either gonna be me or you\nSo pump your brakes before I do you like a got a key to you\nShut your power off, I'm G-A-N-G\nS-T-ARR, yes, we are, bitch, I'm *gunshot*", "image": "https://images.genius.com/5b0c99ea857e85f30c22aa344281f869.320x320x1.jpg"}], "artist": "Royce da 5'9'’"}