{"songs": [{"title": "WORLDWIDE", "album": null, "year": null, "lyrics": "[Intro]\nNa-Na-Na-Na-Nationwide on yo' bitch side! Ayy!\nAyy ayy! Huh, huh\nWhatever I say, y'all gotta do\nSimon says do, your ho do\nMy bitch look like Kim Possible\nShout-out my mucus!\nMy bitch look like Kim Possible\nNo Nickelodeon ho\nNo slime! No slime part two\nMy sli-sli-sli-sli-sli-slime, ayy!\n\n[Verse 1]\nShapeshift, what you do, I'm you, uh-huh\nTurn into a hoe, no voodoo\nPull up on her, give her my P like I'm Diddy\nI'm puttin', I'm puttin' her legs up like a wheelie\nKnow couple niggas that done fell off\nMight go on Facebook and give your mom a poke\nLike the ozone layer, you don't want smoke\nLike I'm Gary the Snail, your bitch I slow stroke\n\n[Chorus]\nI'm on your bitch side like Nationwide, on me (Like what?)\nIt's some weed (Like what?), and it's lots on me (Like what?)\nYour bitch is to the side, I'm chicken, she fries, on me (Ayy)\nIt's some weed, and it's lots on me, umm\nI’m on your bitch side like Nationwide, on me\nIt's some weed, and it's lots on me (Water)\nYour bitch is to the side, I'm chicken, she fries, on me\nIt's some weed, and it's lots on me, umm\n\n[Verse 2]\nOkay, like poison ivy, nobody is fuckin' with me (Mhm)\nMy flow is float like butterfly, sting like bee (Mhm)\nI got one goddamn question, can I proceed?\nYuh, yuh yuh yuh yuh, yes, indeed (Yuh, yuh, yuh)\nOff the gelato, revvin' the throttle, mhm\nI’m at the top like the next model, mhm\nSpanish bitch fuckin' me, that my vata, mhm\nMhm, mhm, mhm\nLike guys, like five, though, when I ride, though\n'Cause they want the beef no chicken, lettuce, or fries, though\nDick like horn on top of rhino\nTwo different colored bitches with me, tie-dye though\nNiggas be always boring with sauce like ouch though\nCatch Me Outside be buzzin' like I'm a fly though\nDiamonds be wet like on a teary eye though\nAmerican idol, jello psycho\n\n[Chorus]\nI'm on your bitch side like Nationwide, on me\nIt's some weed, and it's lots on me, umm (Water)\nYour bitch is to the side, I'm chicken, she fries, on me\nIt's some weed, and it's lots on me, umm\nI'm on your bitch side like Nationwide, on me\nIt's some weed, and it's lots on me (Water)\nYour bitch is to the side, I'm chicken, she fries, on me\nIt's some weed, and it's lots on me, umm", "image": "https://images.genius.com/ce5a0f55f36633ff7b3c3206691c25c5.1000x1000x1.jpg"}], "artist": "Ski Mask the Slump God"}