{"songs": [{"title": "N 2 Deep", "album": null, "year": null, "lyrics": "(feat. Compton's Most Wanted)\n\nGeah...wutup niggas\nThe compton cyco is back\nIn your shit for the nine-deuce\nAnd check this out\nMy nigga Scarface is in the motherfuckin house\nAnd we bout to drop some gangsta shit\n\nMC Eiht:\n\nI guess its true what they say\nWhen your too far gone ain't no turning back\nAnd coming from the Compton mack thats a fuckin fact\nLivin in the city where bitches won't\nGive up the pussy for free so a nigga don't\nSo heres my story. Another story about a nigga\nWho lives his life by the fuckin trigga\nGotta get my serve on, nigga you don't hear me though\nThrow up the hood, might blast on 5-0\nFirst I hit the Ides and get pumped up\nNow I'm rollin in the car kinda slumped up\nI pop the glove box, Then I reach the block\nThen I plug your ass in the chest with the Glock\nAnd that's how the shits get done\nI guess I'm a mutherfuckin nigga on the run\nBut I won't let them take me alive, so I don't sleep\nCuz, geah, I'm in too deep\n\nScarface\n\nIn too deep, ain't no turnin back\nCock up your mutherfuckin gauge...\n\nMista-Mista Scarface for the nine-deuce\nNiggas pack a nine, fuck you bitch I pack a nine too\nMillimeter Ruger for you hoes who try to flex nuts\nYou point your shit, I pull my shit, come nigga now lets check nuts\nBorn a hustla, raised a hustla, never gonna stop trick\nBuck a hustla, mutherfucker boy, you better die bitch\nFound myself a busta, had the boy front me an Oz\nFucked him out his money, worked my way up to a whole key\nNow he's got some niggas trying to ball 'Face\nTime to go to work, need some back' better call Eiht\nCall my nigga up, Kicked the fundementals\n2 way ticket 3 o'clock, continental\nEiht rolled in with the mutherfuckin task force\nBucked them hoes off, dropped him off at the airport\nNiggas don't ever fuck with me cuz I'm a nigga who plays the game for\nKeeps\nDrop you on your ass with the quickness, cuz I'm in too deep\n\nMC Eiht\n\nGeeah, the criminals is in the mutherfuckin house..\n\nNow they got us on the run, but we tired of runnin\nGot the Glocks all cocked, let the fools keep coming\nScarface got the mutherfuckin pump under the seat\nSo niggas better duck or your ass is fucked. geah\nThe mad man with nuthin to lose\nSo you better bring your strap or catch the blues\nAnd um, or get served like a damn clucker\nSucker, or in the end be a short mutherfucker\nNow them one times is all on my back and\nHeard that Scarface and Eiht peeled the cap and\nThey wanna gaffle us up. But its a shame\nCan't fade the best from Compton and the mid-west\nSo watch your back when the niggas step\nCuz the scene that is left is your whole families death\nAnd fool don't sleep\nCuz sorry mutherfucker, we in too deep\n\nGeah. In your shit for the nine-deuce\nMC Eiht in the mutherfuckin house, and my nigga Scarface and shit\nDJ Slip in mutherfuckin house. And we killin the shit off. Geah", "image": "https://images.genius.com/4a83e0fa554b5f2e5c5acce61362bbe7.1000x1000x1.png"}], "artist": "Scarface"}