{"songs": [{"title": "Oh Na Na", "album": "Elephants on Acid", "year": "2018-09-28", "lyrics": "[Intro: B-Real & Brevi]\nCheck, check, check, check\nCheck, check, check, check, check, check (ooh-ooh)\nCh-ch-ch-ch-ch-ch-ch-ch-ch-ch-ch-ch-ch-ch-ch\nMm, yeah, yeah\n\n[Chorus: Brevi & B-Real]\nNa na na (Heh, heh, heh, heh, heh, heh, heh), marijuana\nOh na na, smoke the ganja\n\n[Verse 1: B-Real]\nFrom them hills we go\nLookin' for another high, bless my soul\nIf I get too high, let me go\nThen I wanna fly like an eagle, yo\nI wanna run through those trees\nChoppin' 'em all down, burn in the breeze\nThen I'm at so much ease, feel like I'm floatin' on the ocean, please\nDon't fuck up my high\nChillin' in the zone, in a trance with my eyes shut\nWrap this joint so tight\nDealin' with my own type of lighter, what?\nDon't ask for a hit\nBe careful what you ask for, you might get it\nWanna try my shit? Only connoisseurs can hang when I split it\n\n[Chorus: Brevi]\nOh na na, marijuana\nOh na na, smoke the ganja\nOh na na, marijuana\nNa na na, smoke the ganja\nOh na na\n\n[Bridge]\nI smoke the Acapulco, it make me go loco\nI like the marijuana and I blaze up the ganja\n\n[Verse 2: B-Real & Brevi]\nOh na na\nI stay in this lane\nBitches better keep up or they gonna miss the train\nYou might try in vain\nYou ain't gonna make it to the station, mane\nFor all y'all missin' out\nWishin' you could fuck her for the weed we dishin' out\nI make shit simple\nWe smoked all the most potent weed for the temple\nThere ain't no example\nHere we cultivate for the mind and the mental\nJust breathe that in\nListen, I don't even know where to begin\nYou feel that urge?\nLike a shock through the body and you're gonna feel the surge\nThis shit is is a blur\nLike I took a mushroom my life's all swerved\n\n[Chorus: Brevi]\nOh na na (Oh na na), marijuana (Marijuana)\nOh na na (Oh na na), smoke the ganja (Smoke the ganja)\nOh na na (Oh na na), marijuana (Marijuana)\nOh na na (Na na na), smoke the ganja (Smoke the ganja)", "image": "https://images.genius.com/1db636d2c3463e2af11b01112ad70920.1000x1000x1.jpg"}], "artist": "Cypress Hill"}