{"songs": [{"title": "Don’t Quit Your Day Job! (Lil B Diss)", "album": null, "year": "2013-01-30", "lyrics": "[Intro]\nThat nigga sent warning shots, nigga\nI'm actually offended that this nigga ain't come harder than this\nCause I’m about to straight ether this nigga\nStraight ether this nigga, tiny shirt ass nigga\nIf I ever catch you slipping on Joseph\nI seen you on Lombard Street, nigga you don’t want it\nWe out here, nigga, get your facts straight\n\n[Verse]\nI got an issue with this little bitch shih tzu\nI'm a pitbull, throw lyrical missiles that won't miss you\nRip open your tissue make your task force miss you\nIt made no sense to diss you, so I dish you\nNothing but food you little bitch\nI drop nines like cat fish sticks and shrimp like you and steak too\nNo bitch, ever gonna get pimp like you\nHit you with the cane 'til you sick in the brain\nYa think drilling your brain, you Pink Flame ass nigga\nLame ass nigga\nPublicity stunts for the fame ass nigga\nBada$$ not lying but you gotta tame that nigga\nHolla at, not replying, now you dying\nJoey Bad blame that nigga, restrain that nigga\nYou Purple Rain ass nigga\nHow you trying to be Prince in a Queen B mix?\nLittle faggot pants dance you make no sense\nDon't quit your day job\nCause after this, your campaign wrecked\nI could do this all day y'all\nIt ain't no sweat, ain't no threat\nIs this little bitch sick? Cause there ain't no vets for the love\nAnd ain't nothing less I come next, ain't a nun\nI'm the one, I think I spit lozenge\nThe Bada$$ enforcing\nThis niggas off I put him in a (cough, cough) coffin\nMake yourself a pitch and get tossed in\nI could do this often on your porch in\nForeign, this a warrant, we warning, if you want we still be\nSparring with the martians with an army of spartans\nSparking up I fuck yo bitch when I park your truck\nRockin' a 49ers' park - what?\n\n[Outro]\nShout out to the OG Too Short\nShout out to the OG E-40\nRIP Mac Dre\nBay area, cause mass hysteria, kidnap and bury ya\nShout out to Del tha Funkee Homosapien\nShout out Hieroglyphics\nAnd most importantly shout out Lil B\nFuck yo' bitch, fuck yo' bitch", "image": "https://images.genius.com/cfdccaf323c0c014efb69b194ef7af31.500x500x1.jpg"}], "artist": "Joey Bada$$"}