{"songs": [{"title": "Kendrick Lamar", "album": null, "year": null, "lyrics": "[Verse 1]\nI can tell you what it is, I can tell you what it isn't\nNo more K. Dot, my mother had named me Kendrick\nFuck a stage name, that's the name that I was given\nThe only thing that I can identify within this business\nI'm just a good kid from Compton that want to rap\nWeighing my options, pick up a Bible or a strap?\nI never killed a man, never sold any crack\nAll I ever did was try to keep my city on the map\nBut this monkey on my back, y'all don't want me to win\nI'm tryna follow dreams, you want me to follow trends\nSo just to get a dollar, will I sell my soul?\nI look the Devil in the eye and tell him, \"Hell no\"\nThey say anything worth having is worth the wait\nWell, I want the world, tell me how long that takes\nThere's no time like now, I can cut my patience short\nOr give 'em some more gowns, I don't even want the crown\nI just want a peace of mind, and nigga, when I get it\nYou won't get a piece of mine, won't you mind your own business?\nA rich nigga buy anything you sell him\nA broke nigga believe anything that you tell him\nWell I'm a broke nigga, but still I wouldn't listen to you\nEven if your hand was on a Bible quote, nigga, pfttuh\n\n[Verse 2]\nSee I was brought up different\nWhatever that my pops said, for sure I'd listen\nYou said you did dirt, but I can't dig it\nIt don't concern you if you wasn't born in it\nOh-no-oh-oh\nI swear we got to fast-forward, before time flies by\nMy new saying for '0-10 is, why lie?\nAnd if you ain't trying to win, then why try?\nNow you can low-ball or give me high five\nThis is I nigga, look into my eye\n\n[Hook]\nNigga, I am Kendrick... Lamar\nNigga, my name is Kendrick... Lamar\nI said my name is Kendrick... Lamar\nI changed the name cause I was tired of being like y'all\nNow finally I'm ready to tell the world who I are, pfttuh\n\n[Verse 3]\nAnd that used to be a hell of a task\nNow I'm ahead of my class, so go ahead and harass\nMy character like it don't carry a confidence\nThat can marry a Halle Berry or Angelina with no cash\nI'm bout to cash in my thoughts\nGive you a compass, then tell you get lost\nWhat I'm bout to accomplish is something that you can't fathom\nOnce the Eves come, they quick to stare at him\nHoping I don't take their bitch, but I'm on some other shit\nWhen I'm done, I'm tryna run the government\nThese are big dreams, tansition from a rapper to a human being\nYou can't 'school' a dean\nI be tutoring artist-es, leave 'em with no audience\nAll cause they all oversaw it, my God\nY'all be out partying, I be stealing your audience\nAll because who I are, Lamar\n\n[Hook]\nBut my first name, it gotta be Kendrick... Lamar\nNigga, my name is Kendrick... Lamar\nI changed the name cause I was tired of being like y'all\nNow finally I'm ready to tell the world who I are, now let's go\n\n[Outro]\nBut we can't go... backwards", "image": "https://images.genius.com/25d8a9c93ab97e9e6d5d1d9d36e64a53.1000x1000x1.jpg"}], "artist": "Kendrick Lamar"}