{"songs": [{"title": "F.T.I. 2.0", "album": "N9NA", "year": "2018-11-30", "lyrics": "[Intro]\nHa, ha, ha, ha, ha, ha\nWhen the monster you created\nComes back to bite you in the ass\nHa, ha, ha\n\n[Verse 1]\nWhat I'm saying is disclosure (What?)\nY’all are stupid, you get shoulder (Ha)\n'Cause your plan was to get over (Whoop whoop whoop)\nSince the days of Victrola\nAll the years of straight lies and deprivin'\nNow I’m pushin' to take a dive and connivin'\nWe should never hear any cries from the guys\nWhen independents we risin', high steady survivin'\nNever ever had an artist wanna spray us\n'Cause when they do the fuckin' work, they know we pay up\nAnd I see the labels getting set to bust\n'Cause them people wanna bypass them and come direct to us\nI mean those with no major, mo’ ways to grow paper\nFor the little mane, they cut out the middle gang\nNow you gotta threaten ’em, tell 'em you’ll pull your catalog\nWe ain't gotta do that at all, we say, \"Ain't that a hog?\"\nFuck the\n\n[Pre-Chorus]\nIndustry, menace, remember me\nFinish these sinners, replenish me\nSlim if he grim and see clemency\nIn the seat, chin then need dentistry\n\n[Chorus]\nWe don't sob when you suffer (Nah)\nWe say haha motherfucker (Haha motherfucker)\nOn god when they snuff ya\nI stand, right hand, middle finger, fuck ya\n\n[Verse 2]\nYou in trouble now, we that bubble sound\nYour record label better get with it or then it’s Hubble bound\nI mean to rebel now, so many befuddled clowns in the industry\nThen it's me, leaving 'em with muddled frowns\nYou've been greedy so believe me\nYour thievery will indeed hit you right where your cheese be\nFor years you been dumb and hold the juice\nBut it's over now, the chickens are coming home to roost\nGet a little stupid, get, get a little stupid\nI mean get a lotta stupid 'cause y'all dishonor the music\nThat's why we celebratin' artists cooled as Christmas\n'Cause we know without no artists, ain't no music business\nNigga fuck the\n\n[Pre-Chorus]\nIndustry, menace, remember me\nFinish these sinners, replenish me\nSlim if he grim and see clemency\nIn the seat, chin then need dentistry\n\n[Chorus]\nWe don't sob when you suffer (Nah)\nWe say haha motherfucker (Haha motherfucker)\nOn god when they snuff ya\nI stand, right hand, middle finger, fuck ya\n\n[Verse 3]\nThis is what will happen when you foul on me (Yeah)\nMissiles coming at you like the Taliban (Whoop)\nPlay me then you turn me to a malice man\nNo more fucking Grammys\nFamily never see you smile again (Yeah)\nThis is what will happen when you foul on me (Yeah)\nMissiles coming at you like the Taliban (Whoop)\nPlay me then you turn me to a malice man\nNo more fucking Grammy's\nFamily never see you smile again (Bitch)\nThis is what will happen when you foul on me (Yeah)\nMissiles coming at you like the Taliban (What)\nPlay me then you turn me to a malice man\nNo more fucking Grammy's\nFamily never see you smile again\n\n[Outro]\nYou used our music to get a quick check\nBut you've created something you'll definitely regret\nWe are the new music business, it goes the fuck up\nStrange Music!\nTech N9ne!\nFuck the industry, independents\nWe enemies to them and he that's blind\nThe champ is here, the champ is here, the champ is here\nThe champ is near", "image": "https://images.genius.com/0fc3217957781d29fa52bbc8fd8c1c5c.400x400x1.jpg"}], "artist": "Tech N9ne"}