{"songs": [{"title": "We Ain’t", "album": "The Documentary", "year": "2005-01-18", "lyrics": "[Intro: Eminem]\nHahahah, ladies and gentleman\nYou are now about to witness the strength, of Aftermath\nStraight out the mothafuckin streets of Compton\nPut your hands together, for Game, bitch! Hahahaha\nYeah! Yeah, mothafuckas!\nCompton's back on the mothafuckin map\nAftermath in that ass, bitch\nGame, let's go\n\n[Verse 1: The Game]\nMe and Marshall ain't start shit they listen to our shit\nThey talk shit about us but that shit is foul when\nI'm tryna feed my son and drop multi-platinum albums\nMake my mother proud that her son made it out\nBut it's hard when they hate us, and think Em a racist\nThey say shit but fuck them, Shady one of the greatest\nLike Biggie and 'Pac was, we saw the throne was empty\nAnd decided to chase it, me, him and 50 racin'\nThis rap shit is basic, I followed that Jay shit\nThink of what I wanna say, step in the booth and one-take it\nHow could I not sell a million when I'm rappin' on Dre hits\nThen spit that classical L.A. N.W.A shit\nThe media is bullshit, now we can't even say bitch\nThey accusin' Michael of touchin' kids in the wrong places\nAt first they embraced him, had a couple of facelifts\nNow people wanna place him with murderers and rapists\nThey comin' I can taste this, swear to God I ain't racin'\nPut the clip in and waste 'em before I go out on that fake shit\nI'm so sick and tired of this black shit, this white shit\nSo I sit here and write shit, Em they ain't gon' like this\nSo they callin' us\n\n[Hook: The Game, Eminem & Dr. Dre]\nWe ain't, goin'\nNowhere, so fuck you\nWe ain't, goin'\nNowhere, so fuck you\nThis day, the game, will never be the same (we ain't, goin')\nThings just ain't the same for gangstas\nThe game just isn't the same, it's changing (we ain't, goin')\nIt's a new game! You're now about to witness the power\nNowhere, so fuck you\n\n[Verse 2: Eminem]\nOnly Dre can, judge me for the mistakes I'm making\nIf I'm faking, I'm Clay Aiken\nYou ain't 50 and you ain't Game, you lame, you're tame, bitch\nYou're mild sauce, you ain't ready to make that flame switch\nYou'll end up in the same situation, same shit\nDifferent day, just with different gangstas in your face, which ... Way do you wanna face when your brains hit pavement?\nThink of what you'll say to Pastor Mase and save it\nFor the day that they got them affidavits waving\nIn my face, looking for answers, rap sensation\nEminem battles to ward off accusations\nThat he had somebody blasted, the Mask of Jason\nWas found at the scene of the task with masking tape\nAnd the victim's penis up his ass, a basket case\nAnd they ask him to clean up his act, you bastards wasting\nToo much time, me no kiss ass, and if that's the case, then\nWe ain't going!\n\n[Hook: The Game, Eminem & Dr. Dre]\nWe ain't, goin'\nNowhere, so fuck you\nWe ain't, goin'\nNowhere, so fuck you\nThis day, the game, will never be the same (we ain't, goin')\nThings just ain't the same for gangstas\nThe game just isn't the same, it's changing (we ain't, goin')\nIt's a new game! You're now about to witness the power\nNowhere, so fuck you\n\n[Verse 3: The Game]\nLo, get Dre on the phone quick\nTell him Em' just killed me on my own shit\nI'm walking through 8 Mile, startin' to get home sick\nI'ma do Shady numbers, I'm ridin' my own dick\nYeah the chrome sick, the window's tinted\nIf Eminem is in it, body armor under the Pendleton\nThese niggas is killing it, take a minute to listen\nTurn down my Jimi Hendrix, I'll throw your demo out the window\nFor telling me it's hot, when it's not and you got\nWhat you got from them rocks, on the block you just stopped\nTelling Dre you got shot, with a Glock that don't fade me\nI'm crazy why the fuck you think I'm rhyming with Shady?\nI don't care if the radio don't play me I say\nWhat I say when I feel like I'm feeling today\nAnd get hard when these bitches see my car in the streets\nI can't even take my son to cop them G-Unit sneaks\nSo I'm gone, bitch\n\n[Hook: The Game, Eminem & Dr. Dre]\nWe ain't, goin'\nNowhere, so fuck you\nWe ain't, goin'\nNowhere, so fuck you\nThis day, the game, will never be the same (we ain't, goin')\nThings just ain't the same for gangstas\nThe game just isn't the same, it's changing (we ain't, goin')\nIt's a new game! You're now about to witness the power\nNowhere, so fuck you\n\n[Outro]\nOh, G-shit homie\nTold you knock my respect\nShut your ass up\nAftermath motherfucker, haha\nGame, Slim Shady, Dr. Dre, G-Unit\nG-G-G-Unit", "image": "https://images.genius.com/395930cce0f4587e3046d2e0a817502c.900x900x1.jpg"}], "artist": "The Game"}