{"songs": [{"title": "The Genius is Slammin’", "album": "Words From the Genius", "year": "1991-02-19", "lyrics": "[Verse 1]\nWhat I'm about to flow on is so dope\nThe average hip hop fiend couldn't cope\nOr explain my style because it's hard to define\nSo the fiend scratch and think and nod to the rhyme\nThat I lay down in a straight narrow path\nWhile beats are just flowin' off a modern phonograph\nBass loud, high hats crisp and clear\nThat'll never let a weak MC interfere\nOr bring about some technical difficulties\nSo I got prepared and I wrote these\nRhymes That just broke loose from the brain\nSearching for dope beats on the same plane\nFor you to write new rhymes it is a must\nBut I come off with rhymes old as dust\nEven as a speck of dust it existed\nYa got that?\nForget it, ya missed it\n\n[Hook]\nI'm slammin'\nThe Genius is slammin'\n\n[Verse 2]\nYou flip me on the mic, no way\nThat's like me being played in April on the 1st day\nNow who's a fool? What do you strive for?\nPrime time juice on the box and fans galore\nForget it, cause you're not hype as they want you\nWith a maximum of 200 your rhymin' IQ\nIs 10, meaning thin, you'll never win\nSo erase that, I'm not gonna lose friend\nI know you're gassed, ya charged, and kinda stuck up\nBut I define your challenge, a total fuck up\nAnd it's critical, a crying shame\nHow MC's challenge me and die in vain\nBut you should've came with ya whole rap\nCommunity, now where's your unity\nCause what I see right now is you and I\nAnd you're too weak to stop me from doin' my\nDamage, you know, type of body and fender\nNAH!, not the same way I did Brenda\nBut you had the audacity to step to me\nThinking you was Butch Cassidy and you could do me\nHow can you do me when you don't know me\nAnd out of the hip hop styles ya couldn't show me\nOne style that may have damaged me\nBut that's something you'll never see\n\n[Hook]\n\n[Verse 3]\nM.C. means mic constructor I build\nThat have suckers running like what track and field\nWhen I conduct please don't interrupt\nWith ya if's or and's or but's keep ya mouth shut\nThe hip hop style that I own is highly known\nTo bury MC's like a dog bury bones\nAnd in this field, yo, I'm extraordinary\nAnd in my back yard there's a cemetary\nOf meek MC's who try to speak\nAnd off-peak technique that's soft and very weak\nYet they still have the heart to ask me to duel\nAnd like Mr. T, I pity the fool\nThe shining chrome microphone is the device\nThat makes me stand out like men amongst mice\nSo respond to the stimuli then fly\nStraight to the sky on a natural high\nCause I'm the transmitter buck wild and bitter\nThinking about tryingme then reconsider\nCause if it sounds tempting boy, I'll Double Dare you\nAnd speaking of your low life, I won't spare you\nCause you're not worthy of the mercy\nAnyway The Genius is just blood thirsty\nSo take a lickin' as the plot thickens\nWhile ya head is took, ya be pumping like a chicken\nHow can you ever say my style was played\nWhen my rhymes be chopping shit like a switchblade\n\n[Hook]", "image": "https://images.genius.com/a2hbqfa2xwvnb8hpdpe5u35cz.300x300x1.jpg"}], "artist": "GZA"}