{"songs": [{"title": "Bugatti (Freestyle)", "album": "Dedication 5", "year": "2013-09-01", "lyrics": "Microphone check, I still don't hear my...\nOh yeah I do, yeah I do\nWho the fuck is Stevie J?\n\n[Hook 1: Lil Wayne]\nDon't be lookin' for no donations\nYou get dick, then reservations\nI get pussy then hibernation\nI start humpin' soon as I wake up\nI woke up in some new punani\nHe woke up bleedin' like \"who shot me?\"\nI kept shootin'; Boo said \"you got 'em\"\nNow, all we gotta do is get rid of the body\nBut anyway I woke up in some new punani\n\n[Verse 1: Lil Wayne]\nI was drunk as a bitch, drunk as a bitch\nBut not drunk as that bitch\nI got in that shit acted donkey in it\nJunk in her trunk, hope my trunk key can fit\nThen she jumped on my dick like a monkey and shit\nMonkey see monkey do, banana clips\nShoot at them niggas, no camera glitch\nWax that ass, no candle stick\nAnd I run with some killers I eat with the mob\nGot some shit built up I keep it inside\nRed in my eyes, Mount Everest high\nLook dead in my eyes, see death in my eyes\nThe TEC on my thigh and my aim so good\nI could shoot a fly or a bull in the eye\nHold up, all bullshit aside\nA nigga almost died but I'm outchea\nFuck around with a real nigga get murked\nI been paid my dues will I get reimbursed?\nLove it when she make faces\nPussy feel like vacation\nEat it like I'm dyin' of starvation\nI'm at the finish line, her heart racin'\nGive her to Fuke if she Caucasian\nMy niggas wild as Jumanji\nYou can call me an S.O.B\nCause its skateboards over bugattis\nI used to be at them Heat games\nWith better seats than Pat Riley\nDon't stop, pop that don't stop\nPop that Ollie, Tunechi\n\n[Verse 2: Boo]\nSippin' on dumb, puffin' a J\nMet her tonight, fuck her today\nYou tuck her away, I'm fuckin' her face\nWine head, she's guzzling grapes\nBack shots, I'm holding her waist\nFreaky, I always freak...\nYou know Tune my bro, but he ain't tryna meet ya\nJust bring your friend, both of us'll eat her\nHater niggas be hungry\nGot a hundred shots to feed 'em\nHer panties are down, her legs is up\nWe finally fucked, she starved for months\nDon't give a fuck, still I'll hit\nNever no feelings, no love for these hoes\nNo flowers, we're simple, we fucked in the Rolls\nNo flowers, we're simple, we fucked in the Rolls\nRoyce - trick!\nNow they mad, I told they was\nBitches'll be lying, I did the same\nFar from a square, don't mistake me for lame\nShe's suckin' me off, I'm pokin' her brain\nShe tell me keep goin', I'm doin' my thing\nThat pussy so wet, I'm calling it rain\nI'm giving her hundreds, she's keeping my change\nI keep it a hundred, you do the same\nMost women front, but who do you blame?\nI gave you dick, you gave me pussy\nIt's safe to say it's an even exchange...\nBitch!\n\n[Hook 2: Lil Wayne]\nDon't be givin' out information\nYou know niggas still on probation\nI get higher than expectations\nYou know this is the Dedication\nI'm on that kush she on that molly\nI turn that pussy to Dasani\nShout out my nigga Luca Brasi\nI don't know this ho\nSo I must dash, no disguises\nTunechi, I had to Dedication 5 it", "image": "https://images.genius.com/aa4f93cf953aad46ecd13d3027b59fff.475x475x1.jpg"}], "artist": "Lil Wayne"}