{"songs": [{"title": "Rest of My Life (Hard Rock Sofa Remix)", "album": "Rest of My Life (Remixes)", "year": null, "lyrics": "[Usher:]\nIf you live for something, you’re not alone, my friend\nSo fill up your cup and, lift your lighter, and toast to life\n\n[Ludacris:]\nLuda!\n\nThey say what don’t kill me, can make me stronger\nSo two drinks a night should help me live longer\nI blow some smoke just to give my lungs a test\nCause why tip-toe through life, to arrive safely at death?\nI’m on a journey, yeah; I’m on a roll\nSometimes gotta close my eyes, just to open my soul\nAnd tonight is the night, I gotta feeling that I’m about act a fool\nSo if you go fix some drinks, me and Usher are about to break some rules!\n\n[Usher:]\nThat’s somewhere to go but the world is moving slow\nI was born for the fast life\nI go for broke, a lesson I can't afford\nBut for what it's worth I’m ready to pay, for the rest of my life\nFor the rest of my life\n\n[beat break]\n\n[Ludacris:]\nIf I got one life to live, I’mma party til I’m dead!\nWhat the hell is a life worth living if it’s not on the edge?\nTryna keep my balance; I’m twisted so just in case I fall\nWritten on my tombstone, it should say: \"Women, Weed, and Alcohol\"!\n\n[Usher:]\nThat’s somewhere to go but the world is moving slow\nI was born for the fast life\nI go for broke, a lesson I can't afford\nBut the what it's worth, I’m ready to pay for the rest of my life\nFor the rest of my life\n\n[beat break]\n\n[Usher:]\nIf you live for something, you’re not alone, my friend\nSo fill up your cup and, lift your lighters, and toast to life! (Yeah)\n\n[Ludacris:]\nI’m stuck in this moment, freeze the hands of my time\nCause I feel inner peace when I’m outta my mind\nAnd you can call me crazy, but I like to roll the dice\nSo I’m willing to bet that I’mma be crazy\n\n[Ludacris & Usher:]\nFor the rest of my life\nFor the rest of my life\nFor the rest of my life", "image": "https://images.genius.com/c1cb19024cbee81dc503b12c0923f0e2.800x800x1.jpg"}], "artist": "Ludacris"}