{"songs": [{"title": "D.O.G.’s Get Lonely 2", "album": "Da Game is to be Sold, Not to be Told", "year": "1998-08-04", "lyrics": "[Intro: Snoop Dogg]\nWhat's up baby can I get with you?\nIts called dogs get lonely 2\nBow-wow\n\n[Chorus: Jon B]\nI don't give a damn, what your homies say\nYou don't stay on me, you're always out to play\nYou're so hard to find, seems your shaking me\nD.O.G.'s we get lonely\n\n[Verse 1: Snoop Dogg]\nLook here baby girl D.O.G.'s we get lonely\nYou can ask all my homies, all D.P.G. got tenderoni's\nNow when we on the road trying to get this paper\nAnd phone call away is what you say\nBut sometimes you got to find time to get up\nTo get out and get away You feel me\nNow all I want to do is stay real and stay true\nI'm trying to have a little something, and keep you satisfied, but\n[when] my homeboys say its time to ride then I'm a ride\nSee I'm a gangsta I always be a gangsta you can't change me\nDespite at night I might get lonely ya heard me come and serve me\nI'd love to take you to the mall\nBuy you a little something go to the movies too\nIf that's what you want to do, that's what you trying to do\nThat's what we going to do\nNow I'm a put you on a back burner\nCause I got to get this cheese with my crew\nBut baby momma full of drama ain't that right\nD.A.Z. dog's get lonely too\nNow you knew the dog was dangerous and you took it\nYou got good loving\nYou hook me up a good meal\nBut you still couldn't hook me\nLet me stop lying, I'm trying to be too cool, I shaking the real\nAll my homies do y'all know D.O.G.'s can get lonely too that's real\n\n[Chorus: Jon B]\nI don't give a damn, what your homies say\nYou don't stay on me, you're always out to play\nYou're so hard to find, seems your shaking me\nD.O.G.'s we get lonely\nI don't give a damn, what your homies say\nYou don't stay on me, you're always out to play\nYou're so hard to find, seems your shaking me\nD.O.G.'s we get lonely\n\n[Verse 2: Snoop Dogg]\nYo yo check this out baby\nI'm not even going to rap on this one\nI'm not I'm not much of a rapper at all\nBut check this out I'm a put this P.I. down to you real small\nI mean I got to get this money I'm out here hanging with my homeboys\nWe do what we do we been doing this\nBefore I even met you, you know what I'm saying\nTimes get hard my homies gone be there I know you there for me\nI know you want to do those things that\nThat a woman supposed to do for a nigga like me\nI mean when I get lonely I'm a holler at you\nYou gon' be there for me\nThat's real\n\n[Chorus: Jon B]\nI don't give a damn, what your homies say\nYou don't stay on me, you're always out to play\nYou're so hard to find, seems your shaking me\nD.O.G.'s we get lonely\nI don't give a damn, what your homies say\nYou don't stay on me, you're always out to play\nYou're so hard to find, seems your shaking me\nD.O.G.'s we get lonely", "image": "https://images.genius.com/cc7312525ce26f443efc158446aeedc3.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}