{"songs": [{"title": "Soulja’s Story", "album": "2Pacalypse Now", "year": "1991-11-12", "lyrics": "[Intro: 2Pac & 2Pac as \"Soulja\"]\nAll you wanted to be, a soulja, a soulja\nAll you wanted to be, a soulja, like me\nAll you wanted to be, a soulja, a soulja\nAll you wanted to be, a soulja, like me\nAll you wanted to be, a soulja, a soulja\nAll you wanted to be, a soulja, a soulja\nAll you wanted to be, a soulja, a soulja\nAll you wanted to be, a soulja, like me\nThey cuttin' off welfare...\nThey think crime is rising now\nYou got whites killing blacks\nCops killing blacks, and blacks killing blacks\nShit just gon' get worse\nThey just gon' become souljas\nStraight souljas\n\n[Chorus]\nAll you wanted to be, a soulja, a soulja\nAll you wanted to be, a soulja, like me\nAll you wanted to be, a soulja, a soulja\nAll you wanted to be, a soulja, like me\nAll you wanted to be, a soulja, a soulja\nAll you wanted to be, a soulja, like me\nAll you wanted to be, a soulja, a soulja\nAll you wanted to be, a soulja, like me\n\n[Verse 1: 2Pac as \"Soulja\"]\nCrack done took a part of my family tree\nMy momma's on the shit, my daddy split and moms is steady blaming me\nIs it my fault, just cause I'm a young black male?\nCops sweat me as if my destiny is makin' crack sales\nOnly fifteen and got problems\nCops on my tail, so I bail 'til I dodge 'em\nThey finally pull me over and I laugh\n\"Remember Rodney King?\" and I blast on his punk ass\nNow I got a murder case...\nYou speak of heaven punk? I never heard of the place\nWanted to come up fast, got a Uz' and a black mask\nDucking fuckin' Task, now who's the jackass?\nKeep my shit cocked, cause the cops got a Glock too\nWhat the fuck would you do? Drop them or let 'em drop you?\nI chose droppin' the cop\nI got me a Glock, and a Glock for the niggas on my block\nMomma tried to stab me, I moved out\nSold a pound a weed, made G's, bought a new house\nI'm only seventeen, I'm the new king\nGot me a crew, bought 'em jewels, and a Uz'-thing\nBut all good things don't last\nTask came fast, and busted my black ass\nCoolin' in the pen, where the good's kept\nNow my little brother wants to follow in my footsteps\nA soulja\n\n[Chorus]\nAll you wanted to be, a soulja, a soulja\nAll you wanted to be, a soulja, like me\nAll you wanted to be, a soulja, a soulja\nAll you wanted to be, a soulja, like me\nAll you wanted to be, a soulja, a soulja\nAll you wanted to be, a soulja, like me\nAll you wanted to be, a soulja, a soulja\nAll you wanted to be, a soulja, like me\n\n[Verse 2: 2Pac as the younger brother]\nBuck, buck - niggas get fucked, don't step to this\nQuiet as kept I'm blessed on a quest with a death wish\nTell 'em to come and test, and arrest, nigga it's hectic\nHere's the anorexic, I'm makin' it to an exit\nWalking through the streets on the black tip\nPacked with several gats, cause I'm on some pay 'em back shit\nNiggas don't wanna try me, brother you'll get shot down\nNow I'm king of the block, since my bigger brother's locked down\nI'm hot now, so many punk police have got shot down\nOther coppers see me on the block, and they jock now\nThat's what I call a kingpin\nSend my brother what he needs and some weed up to Sing-Sing\nTellin' him just be ready set\nPack ya shit up quick; and when I hit, be prepared to jet\nNiggas from the block on the boat now\nEvery single one got a gun, that'll smoke - pow!\nThese punks about to get hit by the best\nI'm wearin' double vest... so aim at my fuckin' chest\nI'll be makin' straight dome calls\nTouch the button on the wall, you'll be pickin' up your own balls\nI can still hear my mother shout\n\"Hit the pen nigga -- break your bigger brother out\"\nI got a message for the warden\nI'm comin' for ya ass, as fast as Flash Gordon\nWe get surrounded in the mess hall, yes y'all\nA crazy motherfucker making death calls\nJust bring me my brother and we leavin'\nFor every minute you stall, one of y'all bleedin'\nThey brought my brother in a jiffy\nI took a cop, just in case things got tricky\nAnd just as we was walkin' out (BANG!)\nI caught a bullet in the head, the screams never left my mouth\nMy brother caught a bullet too\nI think he gon' pull through, he deserve to\nThe fast life ain't everything they told ya\nNever get much older, following the tracks of a soulja\n\n[Chorus]\nAll you wanted to be, a soulja, a soulja\nAll you wanted to be, a soulja, like me\nAll you wanted to be, a soulja, a soulja\nAll you wanted to be, a soulja, like me\nAll you wanted to be, a soulja, a soulja\nAll you wanted to be, a soulja, a soulja\nAll you wanted to be, a soulja, a soulja\nAll you wanted to be, a soulja, like me\nStraight soulja, 1993, and forward", "image": "https://images.genius.com/839619da9eb2d92ecf5367044a1fb2ba.500x500x1.jpg"}], "artist": "2Pac"}