{"songs": [{"title": "Punchlines", "album": "J.U.S.T.I.C.E. For All", "year": "2016-02-19", "lyrics": "[Intro: Lupe Fiasco]\nYeah yeah\nLOOPS, MATH HOFFA, SOUL KHAN\nJUSTICE, LUX\n\n[Verse 1: Loaded Lux]\nBeloved! My life's a knockout\nI'mma punch in 'til I clock out\nI stuck with it like the plastic on my mom's couch\nEff with it if you rappers know what i'm 'bout\n(All I got to show for) All these people I drive out\nWind up, or spring-door-drawer rappers I springboard\nWorld-at-your-fingertips shit 'til I cut the ring off, champ! (mean)\nAll my lyrics poignant, disappointment (mean)\nWhen all of these niggas pointing could get appointments\nSense of a nigga asking for 40!\nBut it ain't like any of you niggas could rap it for me (facts)\nFacts of the story, I'm going out so glorious\nNotorious, all warriors know orators\nSpit it for young critics, sketching from my reflection\nMy manual's a solar panel, wait 'til my son get it\nMy energy take the imagery, main industry\nI think Math thought we were stealing the game literally!\nI physically spoke to him before that round\nYou know, when we try to build\nDon't let the Joneses get you down\n\n[Verse 2: Math Hoffa]\n(MATH HOFFA!) Lupe sent ya mans a track\nAll I needed was a chance to rap\nI made bands with Smack\nWham bam, now I'm banned from SMACK\nWhat Imma do next? The answer's crack! (Hol' up!)\nDo next, the answer's crack!\nHeads turn a little harder when you stand for facts\nNiggas lying so bad, hope you cramp your back\nFrom the hood, where we can't relax, seen your man relapse\nThese punchlines I can't retract\nI put the lean on the pimp, see 'em dancers slacks (my bad!)\nThat's wack\nNow my knuckles gotta bump 'em with the boom-boom\nMe countdown, me come from Brooklyn!\nI just came to represent weed\nGet my mama out the P's, and niggas hating\nYou see the dedication, seeming like they seek my resignation\n'Cause the streets need a cleaner reputation!\nI see you niggas faking, I'm Moses: I need a separation\nIn the end, I just keep my reservation 'fore I be a mental patient\nWhy they trying to hate on your bro!?\nI need a beat like a creep date-raping a hoe\nGlory-hole-ass rappers still waiting to blow\nI bring them bars back like you violated parole! (Whoa!)\nBlame it on them rough blocks\nRazor blades trying to put me in a lunch box\nI got a heater turn Peter: nigga, guns pop!\nWhy step to me? You might as well cumshot!\nMy destiny is on top, I don't got no time to fail\nDevil want my soul, no kind of sale\nCan't pimp a Mac, go find a Dell\nIt's all over: showtime, Adele!\n\n[Verse 3: Soul Khan]\nNow I ain't got a catchy song to make y'all love me\nMy lines fish-hook you 'til your face all bloody\nSon, you're fornicating with a force of nature, formulated\nWhen the dude would sport a pager, and Taye rocked Rugbys\nIt's Hugo Boss, screw your squad\nI push them to the sky rim with a fus-roh-dah\nAnd he got hella style to bring 'em in like Ellis Island\nFuck asking \"Who's your daddy?\"!\nSON, WHO'S YOUR GOD!?\nI ain't here to fill a quota\nI'm here to spill a soda in the memory of every rapper\nThey should've told ya I am not a human\nThat's an illusion, I am the End of Days\nSee you let this plague on the wings of the Enola\nWell, I know you wanna hear some punchlines, Lu!\nBut nowadays, it's kind of hard to be a punchline dude\nI mean my double-a time just could be tougher to contra\nThe truth could hit him harder than them punchlines do\nWho got a vendetta? YOU!? Better get a deathbed or two\nIf I get it crackin', you better expect tentacles\nHomie, I can multiply, you could have sent ten of you\nI will outlast you, past my centennial\nTalk about New York, but still we're the Mecca\nAnd you don't know the time like you still wearing Mecca\nMy righteous words reach you through these Heisenberg features\nSo, I know I'm going to blow up like the wheelchair of Hector\nShorty screaming like she in the hentai biz\nWhat the fuck!? Did y'all forget who the heck I is!?\nI will burn your house down like it's Left Eye's crib\nAnd then move your family up to where Left Eye lives!\nRespect on the rise, but the money stay still\nI'm 28, sitting on 28 bills\nSon, I can't chill if my cupboard ain't filled\nMan, I wonder when they're gonna make the Hunger Games real!\n\n[Verse 4: Lupe Fiasco]\n(We need more shit like this man)\nUh yea, 30 bars to go\nAnd whats a cool heart to 30 carts of coal\nAnd whats a cool car when air part is poor\nAnd the poor part means air part is cold\nAnd the cold part is air parts a stove\nSo everything of them is oven\nAlso something to understand, what I say is ice trays\nAnd Muffin pans also everything other than's\nWell let's call it baked Alaska\nSriracha on the rocks a frozen yogurt on the woks, stop\nEven rejection is perfection when i'm thru with rhymes\nThey cut the floors out my cutting room\nJust to make them out the doors of the Guggenheim\nRaps catholic church\nDiscarded bars would kill just to get back in my verse\nNow what you just observed is you listening to some shit\nThat you've never heard and just to make it cray\nI was talking about some shit that I would never say\nIn a playing song by the song that i'd never play\nYeah, even my wrong turns is a better way\nLong term, I just come around the corner like the letter J\nSo I'm on the right track even when I'm led astray\nLike misdirected lead let out of the letter K\nSlang for chopper, not slang for throw it\nIf i had a knife you wouldn't even know it\nYou knockers on flows for those just to bring it back (???)\nYou know how to say silent K's and reattach chakras\nOh that's a lot to say you never seen him before\nHanging in the hood just like three in a row\nSnakes after I just like a G and a Joe\nCheck out my new chain, I hang a tree from my throat\nHanging a T from a rope, take it from me, I'm a bit crazy\nOr you could hear it from the hoes like Dick Tracy\nLU", "image": "https://images.genius.com/0cf1436c2da6612425d48ab25cd438fd.1000x1000x1.jpg"}], "artist": "Lupe Fiasco"}