{"songs": [{"title": "Because the internet Screenplay - Part 1", "album": "because the internet Screenplay", "year": null, "lyrics": "RAP GENIUS NOTE: We suggest you first read this script on becausetheinter.net for the full authentic experience. This page is a tool for further exploration after the initial reading\n\n\nSdfg-FGSD: CODE: 12.10.13SIXTY\nNOTE TO READER: The prelude to this screenplay (\"clapping for the wrong reasons\") is available on the website youtube for free consumption. It may or may not give CONTEXT TO this work you're reading\n\nSECOND NOTE TO READER: The visuals have no sound. They are meant to be played while the song is playing\n\n[VISUAL]\n\nYou can't live your life on a bus...\n\nEXT. CHURCH PARKING LOT - DAY\n\nA white bus opens its door and a flood of children run off laughing and screaming. After the initial burst, three girls get off laughing. After them, A LITTLE BOY steps off. He's walking slow and somber\n\nAll the parents in the parking lot are hugging and kissing their kids. Lots of kids are laughing. The Boy keeps walking until he reaches a black limousine parked at the far end\n\nA chauffeur (old heavyset white guy) stands holding the door open waiting for The Boy\n\n       CHAUFFEUR: Ey! Look who it is\n\nHe holds out his hand for a high-five. The kid jumps, hi-fives him, and slides into the limo\n\nThe Boy's FATHER (Rick Ross) is sitting by the far door. The limo starts off\n\nThe Boy and his father sit in silence for what feels like 8 hours\n\n       FATHER: How was camp?\n\nThe Boy \"shrugs\"\n\n       FATHER (CONT'D): You make any friends?\n\n       THE BOY: No\n\nThe father laughs under his breath...but the laugh turns into a smh\n\n       FATHER: Elise made you something special tonight\n\n       THE BOY: Frito pie\n\n       FATHER: I don't know. She didn't say-\n\n       THE BOY (cutting him off): It's Frito pie\n\nSilence. Father stares at him, then looks out the window\n\nEXT. MANSION - DAY\n\nThe Chauffeur helps Father out the car. The Boy jumps out and walks toward the front of his home. The Mansion is dope. Very Big, and not gaudy. It looks classic\n\nINT. MANSION - DAY\n\nAn infinity pool lines the horizon in the backyard. A spiral staircase fades up the wall and into the master bedroom upstairs. You can see all of this from the foyer, which has a large Buddha statue in the center of it. The place is very clean. Someone seems to care or is paid to care\n\nThe Father's phone rings:\n\n       FATHER: Hello\n\n       PHONE VOICE: Hello, this is the Califax collection-\n\nFather hangs up. His cell phone goes off\n\nThe Boy walks into the kitchen. It's a big kitchen. There's a chef making food. He waves to The Boy. The Boy throws up a deuce. He gets a s'more Pop tart, then walks back out\n\nINT. BOY'S ROOM - DAY\n\nThe Boy walks in and drops his backpack and jacket in the doorway. He kicks off his shoes. They fly across the room, hit the wall, and fall in a pile of shoes on the ground. We see there's a big black/brown stain on the wall where The Boy's been kicking shoes for years. Doesn't look like he ever wears the same shoe twice\n\nThe Boy rips the bag of pop tarts open with his mouth as he sits at his desk and opens his laptop. There's a picture of a woman holding a child. She's wearing one of those fly tracksuits from 1995. The ones people wore a lot during the centennial Olympics\n\nHe starts checking his mail. His friend \"FAM\" sent him something that says \"this is you\" with a link. The Boy clicks the link and a video of a woman blowing a horse comes up. The Boy watches the video for longer than you should watch a horse blowing video. He closes the video\n\nHe goes onto HOTNEWHIPHOP.COM. There's a new Rich Homie Quan song out. It's listed as \"VERY HOTTTTTTT\". The Boy looks in the comment section, reading what people are saying\n\n\"This nigga sound like a broke-ass Future! [CRYING EMOJI]\" is the top comment\n\nThe Boy stares. Then types \"fuck u niggers\" in the comments\n\nHe waits. He takes a bite out of his pop tart\n\nHe refreshes the page. People immediately respond with \"Fuck U\", \"You wouldn't say that to my face faggot\", and \"LMFAO crackers b crazy\"\n\nThe Boy smiles\n...bec a use the in t e  rnet15 YEARS LATER*******[PLAY SONG \"CRAWL\" AT THIS POINT]*******\n\nINT. THE BOY'S ROOM - EARLY MORNING\n\nThe room is an elegant mess. There's shit everywhere, but everything has its place. Classic furniture; someone with old money would invest in, is used for the bed, desk, desk chair. You can see from where most of the trash accumulates that the occupant spends most of his time on the computer\n\nThere is a pile of stacked and flattened gummy bear wrappers by the desk. There's a picture of The Boy and his father on the boy's desk, along with a flash drive that has \"hackz\" written on it. A small vaporizer charges and glows green on the edge. There's a half ounce of weed in a plastic bag to the left of the laptop on the desk\n\nThere's a black and white Bill Withers poster, a Gorillaz \"Demon Days\" poster, and a \"Black Dynamite\" poster. All framed. Stacks of records are placed on a shelf lining the wall. There are some old 70's soul records by a record player on the shelf. Norman Connors \"You Are My Starship\" is the album on top of the others\n\nLittle hills of dirty clothes grow up the walls from the floor. Same pile of shoes is there. Wall with same dirty spot. The closet is filled with white shirts and flower shorts. There's one very old and tattered Shearling coat that hangs to the right\n\nThe Boy (more a man now) is sprawled out on his bed, no shirt and flower shorts. He opens one eye as very faint, dark orange sunlight from the blinds cut his face. He gets up\n\nINT. LIVING ROOM - DAY\n\nThe Buddha statue again. There's empty old beer and Pellegrino bottles on the bar. The entire back of the living room wall is glass. The boy walks briskly to the kitchen\n\nINT. KITCHEN - DAY\n\nThe kitchen is a slight mess. Things left out. S'mores makings left out. The marshmallows are hard as stones. The boy goes into the cabinet and pulls out a pop tart. He takes out a pop tart and throws it in the microwave, wrapper still on (you're not supposed to do that). He starts the microwave and begins texting someone. The microwave is okay for about 5 seconds, then blue sparks start to pop inside. He turns off the microwave, opens it, grabs the pop tart and tosses it on a plate\n\nEXT. BACKYARD - EARLY MORNING\n\nThe Boy walks onto the little island in the middle of the infinity pool lining the oceans and mountains in the background. The mountains are surrounded by clouds. They're literally above the clouds. It's probably raining down there. There's an orchard with lemon and plums to the west of the wall outside, and a green statue of a golfer further in. Bunnies jump on the lawn in the background\nThe boy sits under a sun umbrella, opens the pop tart and starts to eat it. He looks off with his face flat. He gets a text message:\n\n       FAM: when u wanna paddle out? [PURPLE DEVIL FACE EMOJI]\n\n       The Boy texts back: pick me up\n\nCUT TO:\n\nEXT. MANSION FRONT DRIVEWAY - MORNING\nAn old, red (a gross red. a weak red) Mazda rolls up to the front of the mansion and sputters to a stop. FAM, steps out of the car. Daps up\n\n       FAM: Let's take one of yours\n\n       THE BOY: Nah\n\n       FAM: Really, mane? You want us to drive around in my car? I don't think it'll make it, honestly. It broke down at my mom's. Plus... it looks like my car\n\n       THE BOY: Right. It's inconspicuous\n\n       FAM: My nigga, who are you hiding from? It's not stuttin. It's your car. Why do you even care?\n\n\"...why do you even care?\"\n\n       THE BOY: Aight\n\nINT. GARAGE - MORNING\n\nThe garage door rises to reveal Fam and The Boy's silhouette. Five cars are in the garage. There's a Tesla Model S, Silver 911, some car no one's ever seen, a Tahoe and some car under a tarp. Looks like it could be an Aston Martin. Fam smiles\n\n       FAM (pointing to the car no one's ever seen): That one-\n       THE BOY: No\n       THE BOY: The Bimmer\n\nWe didn't even see this one. It's in the far corner of the garage. It's a nice car. Older, but nice and sleek. Understated, to some. Its black paint is chipping in the front. Fam shakes his head\n\n       FAM: Nah...nah\n\nThey get in the 911\n\nCUT TO:\n\nEXT. SANTA MONICA CONDOS - DAY\n\nThe 911 pulls up to a nice condo complex. Fam honks the horn for a while. Like a jerk\n\n       SOMEONE FROM A WINDOW: I work nights, dickhead!\n\n       FAM: I know. Fuck me, right?\n\nFam honks more\nThe Boy checks his Twitter feed. Twitter name \"You Are Unimportant - @thegoldmolar\" You can see from his feed he just trolls all the time. Politicians, athletes, entertainers, etc. His favorite was simply re-tweeting something someone says. When it was dumb enough to just re-tweet, that was his favorite. He'd gotten a lot of followers that way. Written an article once for a blog. Got more followers. He started posting videos of homeless people and fights\nHe was looking for something to retweet on his time-line. People say dumb shit all the time...\n...someone tweeted \"roscoe's wetsuit\"\n\n\"...what's that?\"\n\nThe Boy drops \"roscoe's wetsuit\" into Google. A Yahoo answer comes up for it. The answer to \"what is roscoe's wetsuit?\" is...\"roscoe's wetsuit\". Hilarious\n\nSWANK, STEVE, MARCUS (Chance the Rapper), and AJ (STEFAN) walk out of the condo. They have longboards with them and they're eating candy. They stop in their tracks when they see the 911\n\n       SWANK (re: boards): How we supposed to get these in there?\n\n       FAM: You guys take your car\n\n       STEVE: What about your boards? Where are they?\n\n       FAM: Can we borrow some?\n\nThey all make a face\n\n       SWANK: We need a bigger car then. I'ma drive to your house and get the Tahoe\n\n       THE BOY: Come on, guys. This is taking forever\n\n       AJ: Where we going?\n\n       FAM: Dockweiler\n\n       MARCUS: I swam into a diaper last time\n\n       FAM: I'm GRIMEY. I ONLY SWIM IN DIRTY WATERS! YOU KNOW THIS!\n\n       SOMEONE AGAIN: Shut the fuck up!\n\nFam honks the horn\n\n       SWANK: I'm drivin that Porsche the way back. I know that shit\n\nSwank and Steve walk toward their car parked on the street\n\n       THE BOY: What's \"roscoe's wetsuit\" mean?\n\n       FAM: I don't know\n\nThey drive off\n\nEXT. DOCKWEILER BEACH - DAY\n\nThe guys carry the boards through the sand to ocean, making a strange pattern behind them\n\nThey setup camp and start changing on the beach\n\n       MARCUS: I thought someone was bringing girls\n\n       THE BOY: No one wants to get up this early\n\n       MARCUS: Did you ask white girls?\n\n       THE BOY: I asked every girl\n\n       FAM: You a lie. You didn't ask anybody. You don't leave the house\n\n       STEVE: Why white girls?\n\n       MARCUS: Cause no one is getting up at 6AM to go into the freezing, dirty ass ocean, fuck up their hair-\n\nAt that moment, they all notice a girl sitting on her board in the ocean. Waiting for a wave she looks behind her. She is black\n\n       MARCUS (CONT'D to AJ): See? This is what I mean about Donnie Darko happening to me\n\nA plane flies low overhead. (Dockweiler is right next to LAX)\n\n       MARCUS (CONT'D) (staring at the plane)\nIt's gonna crush me\n\n       SWANK (re: girl): It's like seeing a mermaid\n\n       STEVE: Maybe it's a manatee\n\n       MARCUS (R. Kelly): I'ma flirt\n\nMarcus runs to the water with his board. They all follow\n\nEXT. OCEAN - MORNING\n\nMarcus swims up to the girl on his board\n\n       MARCUS: Sup\n\n       GIRL: Hi\n\n       MARCUS: I'm Marcus\n       SASHA: Sasha\n       MARCUS: It's lookin alright today\n       SASHA (Australian accent): Yeah. It's the only reason I'm out here\n       MARCUS: Oh, you're Australian (pause) You ever seen \"Kangaroo Jack\"?\n       SASHA (not looking at him): Yeah\n       MARCUS: Classic\n       SASHA: ...wha?\n       MARCUS (not mean...just serious): It's a fucking classic\n\nSilence. Sasha is weirded out. All the guys, except The Boy, swim up\n\n       STEVE (to Sasha. Out of breath): Hi. Did Marcus ruin it already?\n       SASHA: Yes\nSteve splashes Marcus\nSwank takes a plastic bag with four blunts in it. He takes one out. He lights up a blunt. Talks with it hanging in his mouth\n\n       SWANK: How long you been surfing?\n       SASHA: Ten years. You?\n       SWANK: Bouta month\nAJ: Cops don't come out here. It's a good place to smoke. You want some?\n\nHe passes it. She takes a hit\n\n       SWANK: What you doin tonight?\n       SASHA: My friend's birthday in Santa Monica\n       MARCUS: Yo, we're right around close. We're having a party tonight in a mansion. You should come. And if your friend's a girl or a guy who has weed, they should come too\n       AJ: I'm Djing. I start off with Jodeci, then the switch over to 90's rap using \"Dream Lover\" to transition, play ACTUAL ATLANTA TRAP for an hour, hour and a half. Then motown, soul, and house. Girls. Go. Crazy\n       SASHA: What's your DJ name?\n       AJ: Twercules. no \"DJ\". Just Twercules. I got a tumblr where I post my mixes. It's getting pretty popular. I don't know. You sing? Model? Act?\n       SASHA: I'ma go in\n\nSasha starts paddling and catches a wave into the beach\n\n       AJ: I shouldn't have said \"bitches\"\n       MARCUS (thinks): ...you didn't\n\nAJ thinks on this. This is probably saying more about him than he realizes\n\nEXT. BEACH - MORNING\nSasha carries her board onto the beach. The Boy is sitting there\n\n       SASHA: You goin in?\n       THE BOY: Don't know yet\n       SASHA: Then why'd you put on your wetsuit?\n\n...roscoe's wetsuit\n\n\n       THE BOY: Everyone else was\n       SASHA: That's an awful reason\n\nShe starts walking\n\n       THE BOY: You should come to the party. It'll be fun. (then) They invited you, right?\n       SASHA: Where is it?\n       THE BOY: [EDIT]. Text me [EDIT]\n       SASHA: I'll remember. I'll bring some friends\n\nShe walks off\n\nLater that day:\n\n*******[PLAY SONG \"WORLDSTAR\" AT THIS POINT]*******\n\nEXT. I-10 - EVENING\nThe guys drive down the highway eating In-N-Out. Head nods all around. Swank is now driving the Porsche. Crazily. Fam is with The Boy and the rest of the guys in the other car. Marcus drops his animal style fries on the floor\n\n       MARCUS: Fuck\n       FAM: You see you fuckin up this car?\n       THE BOY: It's fine\n       FAM: He's driving crazy. (iphone goes off) And he's textin me\n\nThe text says: R E C K L E S S\n\n       FAM (CONT'D): This nigga's so lame\n\nThe Boy sees a tweet of the lead singer of a boy band tweet \"follow your heart and [HEART EMOJI] all who cross your path!\". The Boy retweets it with a [LAUGHING/CRYING EMOJI]\n\n       FAM (CONT'D): I gotta stop somewhere first\n\nCUT TO:\n\nEXT. CLUB - NIGHT\n\n[VISUAL]\n\nFam pulls outside of a club. Lots of people are trying to get in. He and The Boy get out and walk to the bouncer, their friend CHEESE. Fam and Cheese dap. The Boy stands on the side next to a line of people trying get in VIP. They look at each other. He is not dressed appropriately to get in\n\nFam and Cheese do that handshake thing they do. Fam walks in\n\nSome guys in a black SUV rolls by and yell at the dude next to The Boy\n\n       MAN IN CAR: Dont let me catch you out here Jay! Don't let me catch you!\n\nThe Boy watches this for a second. He looks down for a moment...\n\nSomeone has spray painted \"roscoe's wetsuit\" on the sidewalk. He stares at it\n\n       MAN IN CAR (CONT'D): I got yours, muthafucka!\n\nThe Boy snaps out of it. Then takes out his phone and starts recording the fight. Fam walks out and sees the fight in action\n\n       JAY (I GUESS?): You scared, bitch! That's why you scared!\n       MAN IN CAR: I got something for yo ho-ass my nigga!\n\nPOP. POP\n\n..what's happening?\n\nJay is bleeding from his stomach. The Boy is seeing this through his phone. It takes a moment for him to realize-\nPOP. POP\n...run. now\nFam is already running. Everyone in the line is screaming and running. The Boy runs\n\n       COP: Drop your weapon!\n\n(these are cleaner and succinct) POP.POP.POP\n\nRuns to the side of the building. The SUV that was firing slows down. The driver is dead. Car horn blares as the car slows to a stop, mixing with girls crying and \"oh shit!\" and \"fuck\". Jay is very close to dead. The blood on the sidewalk is almost black. A street sign (No parking between 7-9am and 4-7pm) is reflected in the dark blood. He turns to The Boy, looks around. He knows what's happening. He's leaving\n\nThat was the end. He'll never read this sentence. Or any sentence. He ended earlier. Before this sentence. As far as he knows, before any sentence. He's back to his/the natural state\n\nThe Boy felt something\n\nIt's funny, cause this dude is dead. There really isn't a connection...it's more him seeing himself for the first time since-\n\n       SOME NIGGA: Damnnnnn.....!\n\n       HIS FRIEND: WORLDSTAR!\n\nThe Boy's phone rings:\n\n       THE BOY: Yeah\n       FAM: Get in the car\n\nThe Boy turns and sees the car rolling up to the alley he's hiding in. The Boy runs up and jumps in. They speed off\n\nINT. CAR - NIGHT\n       FAM: That shit was NUTS!\n       STEVE: I knew something was about to happen. I knew it\n       MARCUS: Donnie Darko. I'm tellin you\n\nThe Boy is looking at the footage on his phone. He's got a death on video. It's looped. Over and over\n\nThe Boy touches his shearling coat...there's a hole in it. Bullet hole? He puts his finger through...\n\n...i shouldn't be (here)\n\nHe looks at Fam and Steve. They're talking\n\n       MARCUS (CONT'D): Bitches high heels everywhere! They ran out they shoes, cuh\n\n       FAM: BAP! BAP! BAP! Oooow. That nigga lit up\n\nThe Boy just keeps watching the video\n\n       FAM: Yo. You got it on video?\n\n       THE BOY: Yeah\n\n       FAM: Wow...you caught the end of his journey on video. That's dope. (then) We gotta pic up Doc from the jazz club\n\nINT. JAZZ CLUB - NIGHT\n\nFam and The Boy Stand in the back. Doc is on stage playing saxophone with a band. He's doing a solo\n\n       THE BOY: Does it weird you out that you almost died today?\n\n       FAM: Not really. I'm not trippin on death\n\n       THE BOY: I'm not trippin. I'm just sayin, if you think about it, there's no reason for us to be here\n\n       FAM: Doc be hanging with the weirdest people. Look at these niggas. They all look like James Blake. Is that who likes Jazz now?\n\n       THE BOY: I was thinking about it and I can't offer anyone anything. Like, my job is tweeting at people. That's my job\n\n       FAM: That's not your job. You do it cause it's funny. You're rich. We don't have to do anything\n\n       THE BOY: Yeah. Isn't that sad?\n\n       FAM: Sad? We are making moves. What about that line me and Swank are gonna start selling?\n\n       THE BOY: All we did was print shirts for ourselves. Who else is buying that shit? And the whole reason we wanted to make shirts is cause Tre made some and they were dope\n\n       FAM: I don't know what to tell you. We are doing dope shit. We are making moves. We can do whatever we want-\n\n       THE BOY: But none of it matters cause we're doing it for ourselves! We're just jerking off for each other. No one in the future's gonna give a shit I made a shirt once\n\n       FAM: Then don't make a shirt, my nigga\n\n       JAMES BLAKEY LOOKING DUDE: Shhh!\n\nThe Boy fiddles with the hole in his jacket\n\nINT. MANSION - NIGHT\n\nAll the guys walk in with plastic bags from the grocery store. They have blue cups, alcohol, s'more fixings, and gummy bears\n\nIf I was the director, I'd have everyone walk in in slow motion into the house with \"Nosetalgia\" by Pusha T playing\n\nWalking into bedrooms. Opening drawers. Pulling out bags of weed\n\nCUT TO:\n\nAJ walks into his large closet. Pulls out a bowl. There are some prescription bottles there too\n\nCUT TO:\n\nA naked Marcus steps out of the shower and goes in his closet and pulls out some condoms\n\nCUT TO:\n\nFam is meditating in the center of his bed. He's floating off the bed by about 4 inches\nRAP GENIUS NOTE: This is the end of Part 1, continue on at Part 2", "image": "https://images.genius.com/85529bbeef5d1dc890a832d5d3953daa.600x600x1.jpg"}], "artist": "Childish Gambino"}