{"songs": [{"title": "Why Do You Think They Call it Dope?", "album": "Walking with a Panther", "year": "1989-06-09", "lyrics": "Warning, MC's stand back\nYou better take a chill and observe the skill\nOf the man who can, so understand god damn\nI got a masterpiece a master plan and a brand new\nWay to attack the wack cut 'em down to size\nTo realize LL's back\nDon't sleep I'm too sweet to repeat a beat\nA lyric or rhyme I wouldn't waste your time\nWith weak words, that's for nerds, you never heard a rhyme\nSo you deserve a line rougher than rough enough is enough\nI'm, gonna slaughter choke ya smoke ya like a sauna\nYou don't really wanna\nBut if you wanna battle on here's a lesson: stop 'fessin\nI'm a lethal weapon, you better get to steppin\nOff the stage, and outta my face\nYou're too light *in the asshole* save the bass\n\nWhy do you think they call it dope?\nWhy do you why do you think they call it dope?\n\nIt seems like people'll never understand\nOn the microphone I'm not your average man\nI cool out sometimes, I save my best rhymes\nAnd then the toy boy thinks that he can come and get mine\nLet your friends gas him up, talk trash and make bets\nThen gets played like those kids who tried to rob Goetz\nYou don't know what I'm sayin? Yo check it\nGive me any microphone and god damnit I'll wreck it!\nI'm coldblooded I'm about to mutilate\nLast year before I left I told you to wait\nBut you couldn't stay loyal started goin astray\nThinkin Tom, Dick, and Harry can mess with Cool J\nIs you crazy? I'm boomin, got the talent of two men\nThe stamina and skill in battle to kill a few men\nThe heart of a lion, the loyalty of a soldier\nI wreck your whole mob then tell ya I told ya!\n\nWhy do you think they call it dope?\nWhy do you why do you think they call it dope?\n\nCause I don't jab around you, I come inside\nBob and weave, deceive until you get tongue tied\nBrawl for all give a lyrical display\nAnd next time you know better than to get in my way\n\"Yo whassup wit LL?\nWill he ever make another 'Rock the Bells'?\"\nYo brothers is comin up, \"I think he's fallin off\nI don't think he's still 'hard as hell'\"\nSee, this is the attitude, of ignorant ones\nCause they don't know, all them MC'sll get done\nOne or two might say, \"Yo L'll be back\"\nBut the rest they be suckin on Sugar Smacks\nTalkin that crap about who's better than me\nYou think so? Just let a MC\nMake me mad enough, to really wanna battle\nI put a L on his ass like he was cattle!\n\nWhy do you think they call it dope?\nWhy do you why do you think they call it dope?\n\nJust cause I make a love song, or say a simple rhyme\n\"Boom, move over L, it's Miller Time\"\nI don't know whether to laugh, get ill or get wild\nCause brothers don't realize, I got so many styles\nLike triplin up the words, confusin all the nerds\nHeard put my sights on mics and ?? flippin above the\nWord to the mother, no other MC brother\nCan mess with Ladies Lover\nI'm original, I'm bright under color\nAnd when I get on the mic, yo I burn rubber\nCan't stand criticism, give 'em extra jism\nBeen rockin for years, now I have wisdom\nThe way I'm kickin the lines you can hear my tongue twist\nAnd it'll have your neck spinnin like you're spineless\nI'm pickin 'em up, throwin 'em down\nHypin 'em up and slowin 'em down\nAll of these words with only one tongue\nShakin 'em up and then bakin 'em up\nSmash boom bash scrapin 'em up\nNow you thought that was hard, I just begun\nCause I'm a roll on the microphone\nAnd take control just like Al Capone\nI'm notorious, you're foolish if you sleep on me\nCause I'm too slick to let a rapper get sweet on me\nTry to make a move for my heavyweight belt\nYou get played like the Wizard of Oz witch, you melt\nYo I'm crazy dope, with super hype lines\nAnd a lot of hype lines make one dope rhyme\n\nWhy do you think they call it dope?\nWhy do you why do you think they call it dope?\nWhy do you think they call it dope?\nWhy do you why do you think they call it dope?\n\nCause that's what it is\n\nWhy do you think they call it dope?\nWhy do you why do you think they call it dope?\nWhy do you think they call it dope?\n\n{*cutting and scratching \"Straight from Queens\" to the end*}", "image": "https://images.genius.com/35b951a9c90707d0d03de9bebbadefc6.999x999x1.jpg"}], "artist": "LL Cool J"}