{"songs": [{"title": "Gettin’ Inside", "album": "Mudface", "year": "2015-11-13", "lyrics": "[Intro - (Bouncer) [Redman]]\n'Scuse me, Gilla House on the V.I.P\n(Nah nigga. Ain't no V.I.P. list.)\n[Pass me that second blunt, man]\nThis Gilla House man!\nGilla House?\n[Man, don't be talkin' to my homie like that, nigga]\nNigga if y'all Gilla House, kick a rhyme for me, or get the fuck outside!\n[We gon' have to drop somethin' man. What the fuck is goin' on?]\n\n[Hook]\nFuck outside, I'm gettin' inside\nFuck outside, I'm gettin' inside\nRoll through my hood in my fucked up ride\nMy family be stoned like sly\n\n[Verse 1]\nBoy I don't jive, my tribe gon' kick it\nSyrup in the cup, nah I ain't gon' sip it\nMoney over hoes but hoes want money\nBetter ask Bow-Wow for the lottery ticket\nDrop my top when the sky get yellow\nSo like Pacquiao, I'm waiting for Mayweather\nAll my dogs tougher than leather\nI fell like I hit my lil kid's inhaler\nFranklin, Benjamins, cakes, Entenmann's\nThirsty like Howell trappin' with Gilligan\nNever could mimic him, I'm grade A\nI'm battin' with bonds in my DNA, nigga\n\n[Hook [Redman] (Bouncer)]\nFuck outside, I'm gettin' inside\nFuck outside, I'm gettin' inside [Yeah]\nRoll through my hood in my fucked up ride\nMy family be stoned like Sly [Yeah]\nI'm so high, the chicks gon' love it (Yeah)\nWe so fly, the chicks gon' love it (that shit was kinda hot)\nPull up to the club, I bring no luggage (I wanna hear a joke, nigga)\n'Cause when I leave here, I plan on fuckin' (Or get the fuck outside!)\n\n[Verse 2]\nYo, ayo\nBoy, I'm a winner, boy I'm a sinner\nGot an antenna on the TV dinner\nStrip club, I got my money on Linda\nOne dollar bill peel like Gold member\nI'll make it rain, it's a hurricane already\nTrue to the game like Terry\nThird degree burns, the house on fire\nHustlin', compare me to Jerry McGuire (let's go!)\nRoll that shit, light that shit\nThen mac on the seem Skyped that shit\nAs soon as she smoke, I'ma pipe that bitch\nThen put it in her butt like you like that shit\nWomen give me love and rappers get X\nHood status, I got stripes like the ref\nWrite the check and connect like nine X\nWhen you do, add three more digits to the left (let's go!)\nI'm like Jeter how I rock that speaker\nInternet junkies are WiFi-in' ether (woo!)\nLook at me bro, I'm a leader\nBut I feel like the fat boys tryna get in the beaver\nBitches on E and my homies on percs\nHorses on the car and a horse on the shirt (yeah!)\nFrom now on I'ma be dirty like Mcgirt\nSo I bum rush the door 'til I walked in first, nigga (Yo, yo, yo! Hol' up! Hol' up! Hol' up!)\n\n[Hook (adlibs)]\nFuck outside, I'm gettin' inside (Yeah)\nFuck outside, I'm gettin' inside ('Ey man, we in this mothafucka, man) (Yeah) (Yessir. We in the house now, nigga)\nRoll through my hood in my fucked up ride (That's right, believe that, nigga)\nMy family be stoned like sly (We inside the buildin' now, baby)\nI'm so high, the chicks gon' love it (Feel good to be up in the club right now, yo.)\nWe so fly, the chicks gon' love it (What's good?)\nPull up to the club, I bring no luggage (Y'all rockin'? 'Ey, I need y'all to follow me, I need y'all to rock with me, let's go)\nCause when I leave here, I plan on fuckin'\n\n[Bridge]\nNow I'm inside and I'm feelin' alright\nAnd I'ma show people how to party all night\nSmoke some of that, take one of those\nDrink 'til the bartender yellin' \"I'm closed\"\nNow I'm inside and I'm feelin' alright\nAnd I'ma show people how to party all night\nSmoke some of that, take one of those\nDrink 'til the bartender yellin' \"I'm closed\"\n\n[Outro [Redman]]\nUh, 'scuse me, Gilla House on the V.I.P\n[Gilla House niggas in the buildin']\nUh, 'scuse me, Gilla House on the V.I.P\n[Redman in the buildin', Mr. Yellow, what's good my nigga?] (I'm here already!)\nUh, 'scuse me, Gilla House on the V.I.P\n[Brick City we in here! Yeah. Take one of those]", "image": "https://images.genius.com/c2929de9421dffcccd19e5114ae76a74.1000x1000x1.jpg"}], "artist": "Redman"}