{"songs": [{"title": "Hurt", "album": "T.I. vs T.I.P.", "year": "2007-10-05", "lyrics": "[Intro]\nBa, ba, ba, ba, ba, ba, ba\nYou pussy niggas finna make me kill one a y'all\n\n[Hook: T.I.]\nAin't a damn thang change\nI still keep that thang right up under my shirt\nBetta tell 'em I ain't playin'\nBecause it's all fun and games until somebody get hurt\nAin't a damn thang change\nI still keep that thang right up under my shirt\nRun up on him where he hang and BANG!\nCause it's all fun and games until somebody get hurt\nBoy you finna get hurt, murked, put him in the dirt\nBoy you betta catch me first\nBoy you finna get hurt, murked, put him in the dirt\nBoy you betta catch me first\nBoy you finna get hurt, murked, put him in the dirt\nBoy you betta catch me first\nBoy you finna get hurt, murked, put him in the dirt\nBoy you betta catch me first\n\n[Verse 1: T.I.]\nAlota pussy niggas talk like broads love runnin' they mouth\nThat is til I run in they house\nPut the gun in they mouth, tell 'em \"Nigga talk shit now\"\nYou'd think they know the gun go BOW!\nI ain't scared of the law\nNaw I'm about to go to war what it is nigga win lose or draw\nI'll never get caught murkin' y'all cuz it ain't what you do\nThe question is: Who saw?\nShawty I'm way too raw\nCatch me any day you want you could think I'm a play if you want\nBut the fact still remain if I got a AK and you don't\nWell then playa you gone\nDon't get me wrong there's some niggas wanna kill me too (Well where they at?)\nBut this ain't bout shit cause it's well known where I'm at\nThey could catch me in the booth right now if you really like that\nNaw nigga let they ho get him in the whole shit, the 44 spit they holla \"Oh shit!\"\nProtectin' her and you both hit\nYou betta check ya girl cause you be so sick\nIf the choppa leave you with no dick\nOr a plastic bag holdin' yo' shit\nLeave 6 in you, a couple more in ya bitch\nAnd I don't miss cause I'm focused nigga\n\n[Hook: T.I.]\n\n[Verse 2: Alfa Mega]\n(I got you Tip)\n(I'm finna ride homie)\nFuck niggas might talk loud, act real, but they don't really want this here\nPussy niggas betta act right, lay low, we know where ya family live\nTrust me you don't want me up in ya crib with a ski mask on duck tapin' ya kids\nYou can pray all you want but I don't forgive\nYa shoulda been doin' that before ya did whatcha did\nI ain't gotta spell it out pimp you know what it is\nI'll rest you case for ya real man you know what it is\nPlus I got a hundred goons with me, dressed in black\nFifty at the front door, fifty at the back\nHalf got K's, half got Macs\nBring 'em out, bring em out, show me where he at\nWe can do him right here, we could catch him in trap\nRun up on his 'lac put a hole in his hat\nWith his brain on the dash, and his thoughts in his lap\nAnd dump 50 more on him and tell him to hold that\nLights out, no hasta mañana, hasta la vista, sayonara\nY tú no tomorrow, no remorse and no sorrow\nAnd the next one a y'all niggas try me like that\nI swear to God man I'm really gon' snap\n\n[Hook: T.I.]\n\n[Verse 3: Busta Rhymes]\nRight now I'mma give you somethin' that a make a nigga beg \"Please\"\nWhen a bullet wiz by, he'll probably feel a little breeze\nDrop to ya knees, see the big barrel of the chrome\nFifth triple grip handles in the squeeze\nI keep a couple of those for the niggas who talk shit\nWhen I go to Jacob and cop that ring\nIf you try to see me I'mma cock that thang\nAnd I'mma pop that thang, and the shots gon' sting (really?)\nThe nigga ride inside the truck with me (and) for the most part the nigga stuck with me\nAnd tell you somethin' if you really were smart and you knew\nBetter people probably tell ya don't fuck with me\nFront if want motherfucka you can catch it\nSmile on my face even though I got a ratchet\nPop off (police) pull me over believe I got a compartment if I gotta stash it\nMust I just remind y'all niggas when I come through\nKnow that I'mma find y'all niggas, take two (break through)\nBust so many shots gun powder probably blind y'all niggas now (Okay, okay let's go)\nSee you don't know really wanna feel that Mossberg blow (naw)\nClap up a nigga then I cap up a nigga\nWhen I finish it'll turn into an absurd show (listen)\nThen you better observe yo\nFeel the sizzle from the bullet of the Glock burn slow (ssss)\nShit'll probably twist you up just a little and have your body leanin' lookin' like a quarter past four\nStay down betta (lay down)\nCheckin' for a nigga, come and put your body in the dirt\nI don't play bitch, you really need to go the other way\nIf you ain't know I got it under my shirt\n\n[Hook: T.I.]", "image": "https://images.genius.com/2f70d0ed3d87a3cc476cfb530ff86686.600x600x1.jpg"}], "artist": "T.I."}