{"songs": [{"title": "#BETiGOTSUMWEED", "album": null, "year": null, "lyrics": "Verse 1:\nEverytime that I wake up, I swear I'm never down\nEven when I'm in my dreams, I'm high off self esteem\nBlowin' on that Jamaica my nigg its not a ting, marijuana fiend\nKeep your Black N Milds and cigs cuz me no nicotine\nI keep my pimpin' mean\nMe and Musa as we pulled up on them sixes just to go and bust some bitches\nSee them motherfuckin' wheels, sex appeal\nAnd if I'm in the backseat with them tints, that Glock concealed\nThey eye us as we peel like the, orange hat that I be stylin' in\nLike a zanny or a klonopin\nAll your swishers, they be model thin\nWe plus size, nigga!\nLike Tocarra and them, shining like a halogen\nSo bright, like highbeams, headlights and midnight\nThat one of Rhode Island's watchtower sights\nYeahh, the world is all I need\nBut if you don't know anything just know I got some weed\n\nChorus\nBet I got some weed\n(x2)\nYou don't know anything? Just know I got some weed\nBet I got some weed\n(x2)\nAin't got no money mayne, but bet I got some weed\nHey, who got some weed?\nWho got some weed?\n(x6)\n\nVerse 2:\nLet's go chill up on my balcony and feel the breeze\nOpen up a corona and see who got some weed\nIf we don't have no trees then let's gather up the fees\nHundred dollars, that's a seventh of the sour D\nMake a order it'll be here a quarter to three\nSmoke it till we on E\nThen we fill up again with another 10\nThen we just go run back to the cheese fulfill our, family needs\nNo worries, smoke one for our G's that ran with a strike of 3's\nWe dyin' up in every plea\nSo for ya'll my niggas swear to god my heart will bleed\nKick the shit for my lifers and ones who kickin' seas\nEven if it's just 5 dollars keep your brain on free\nElevate your mind cuz in due time you wine and dine\nSomething fine in that\nKush blunts soon be your valentine and my shit be Columbine\nMy fans is all I need\nBut If you don't know anything just know I got some weed\n\nChorus\nBet I got some weed\n(x2)\nYou don't know anything? Just know I got some weed\nBet I got some weed\n(x2)\nAin't got no money mayne, but bet I got some weed\nHey, who got some weed?\nWho got some weed?\n(x6)\n\n*shout outs till the end*", "image": "https://images.genius.com/e79de87534188a7a50d154e7eb1c6a42.1000x1000x1.jpg"}], "artist": "ScHoolboy Q"}