{"songs": [{"title": "She Wanna Have My Baby", "album": "Hoodmorning (No Typo): Candy Coronas", "year": "2011-07-29", "lyrics": "[Verse 1 - The Game]\nEverybody fucking Amber Rose\nIs the pussy good\nOnly Kanye and Cameron knows\nAnd who this Tammy ho? Telling her me and Tre are shooting a video\nIn a month and she can get a cameo\nSMH. TTM. Five star\nWe be em. LOL, hi my BBM ain't got my BBM\nLouis Vuiton he be in, 'tron got him queasy\nAnd my money ain’t young, ask my nigga Little Weezy and 'em\nI keep one rolled like Wiz Khalifa and 'em\nGot some college hoes that wanna smoke a Swisher Sweet with him\nThey ain't no Lauren Londons but they got that Meagan Goode\nThey use that Photoshop to get their ass up out the hood\nAnd it’s all good when us niggas mayne\nI said it’s all good cause I am with Trigga, man\nYeah, she said she wanna have Jayceon kid\nI told that bitch you better off with Jason Kidd\n\n[Hook - Trey Songz]\n\nI do it cause they love it\nIf you hate it bitch who give a fuck, I made it\nPlus I do it for the ladies\nSomebody say they wanna have my baby\nShe said she wanna have my baby\nWho tryna have my baby?\nShe said she wanna have my baby\nTryna have my baby\n\nHow many bitches in the club just trying to fuck a platinum rapper\nPoking microscopic holes into the magnum wrappers\nHopping on the dick but I ain't throwing carrots at ya\nYou ain't gonna Worldstar me, I ain’t your average rapper\nYou drinking all the Goose & bitch I ain’t fittna pay\nYou don't look like your Twitter avatar any way\nBitch you look like an Avatar anyway\nAnd that’s the same bitch that was stalking Fab, ain’t it Tre?\nAnd this is how I know you giving free head\nIf you was getting paid the bottom of your shoe would be red\nBut it ain’t, she claiming she a saint\nBut as soon as she sees Dwight she going hard in the paint\nGirlfriend-type you wanna take home\nThrow a little Drake on, it really shouldn't take long\nThen she told me she want me & Tre Songz\nI told that bitch \"strip, and start singing all Tre's songs\"\n\n[Hook - Trey Songz]\n\nI do it cause they love it\nIf you hated bitch fuck cause I made it\nI do it for the ladies\nSomebody say they wanna have my baby\nShe said she wanna have my baby\nI am trying to have my baby\nShe said she wanna have my baby\nI am trying to have my baby\n\n[Trey Songz]\nYou look much better than your friend\nJust for the night let me be your boyfriend\nWith that baby, let's go\nAin't no sense in waiting on me\nNobody that I know, they don't be debating on it\nThey gon' say we did it, even though we didn't\nI'mma play cool, interviews, say I didn’t\n\nMr steal your girl!\nLooking for your girl ?\nLooking for a night out and they both came back to me\nIf you jump up in the club go on, clap for me", "image": "https://images.genius.com/c7e8ae0f47986bad415f5d58fc0b2281.320x320x1.jpg"}], "artist": "The Game"}