{"songs": [{"title": "9 Milli Bros.", "album": "Fishscale", "year": "2006-03-28", "lyrics": "[Produced by Metal Fingers]\n\n[Intro: RZA]\nBob Digi, U G.O.D, Raekwon the Chef, the Inspectah Deck\nM.E.T.H.O.D., the B.O.B.B.,\nStraight up, Masta Killa, the GZA/The Genius\nIt's the Ol' d-d-d- d-d-d- d-d-Dirty Bastard!\n\n[ODB] 1, 2, 1, 2, (Killa Beez) turn it up\nThe headphones, turn it up.. yo you hear me?\n[Cappa] Whattup Tony?\n[Ghost] Wassup don-don?\n[ODB] All the way up...\n[Ghost] You know how we do...\n[Cappa] Let's get this paper together...\n[Ghost] You motherfuckin' right Pa, uh huh\n[Cappa] What's up, y'all?\n[Ghost] We wanna do it nigga\n[ODB] You know how I do...\n[Ghost] Sound about to go in on some real Wu shit, uh huh\n[Cappa] W-T-C\n[Ghost] That's right\n[Ghost] Ya know what I mean?\n[RZA] GHOST-FACE KILLAH!\n[Ghost] Lemme give y'all the bullshit hook for y'all niggas\nCheck it out...\n\n[Hook: Ghostface Killah]\nThe burners and the stash, we 'bout the cash\nWe got females that got it like that\nThe golden childs that bone the crowd\nSee, niggas in the place that bit my style\nWell, I'm a singer, dancer, we bulletproof brothers\nWu-Tang got the answer\nCause if I had a chance to do it again\nI will still keep the heat in my pants-uh\n\n[Verse 1: Ghostface Killah]\nY'all be nice to the crackheads, everybody listen up\nI shot one of my bitches, the ho ain't trick enough\nWord life to big screen Don, tapping dustbones out\nWith starwriters like I fucked Celine Dion\nStuck everything that's the god's honest beyond\nWe airin' niggas out, that's the type shit that we on\nOfficial Wu-Tang headbanger\nFlood your space with big waves like you did in Sri Lanka\n\n[Verse 2: Raekwon]\nI drink heavy gallons of cru, play the big part\nNiggas got squid on the grill, selling kids Clarks\nFinesse notes, yo, the Guess on with the vest pose\nYellow swede one matching hat with the grey gun\nNiggas be rhymin' for nothing, then my team pull up\nWe all throw down y'all broke niggas stay frontin'\nLines come digital stupid, plus ain't got no jewelry on\nBet I'm still live and I'm coopin'\nTwo of my silverbacks run through a pack of your wolves\nFront on react, we're sippin' Cognac [?] relax dude\nKnow I'm with these cracks dude\n\n[Verse 3: Ol' Dirty Bastard]\nYo, 1-2, Dirt McGirt\nSolid tone smith with 6th shots, lick shots\nLeave your head like a Shaolin monk with 6 dots\nBrooklyn Zoo, Zoo\nBrooklyn Zoo\n\n[Verse 4: Cappadonna]\nIt's the return of Bin Laden, grab your armor\nSmash pretty boy niggas, crush their karma\nEat bones with alligators, roll deep with my entourage\nMy whole crew's fresh out the bars\nDiggler AKA the Cab Driver\nDrop him off in the middle of fire\nDirty Island, drag bodies to the Murderland\nKnock niggas out hurtin' my hand\n\n[Verse 5: Method Man]\nI remember in the elevator we was playin' corners\nNow we play the corners and the cops is stayin' on us\nStaten's where the war is\nWhere the court system's running out of warrants\nWhere TNT be jumping out the Taurus\nFor real I can't call it\nYou see I love Lucy cause she Lawless\nExactly like that 1-0-3-0-4 is\nSnitch niggas swallow your tongue\nAlready know the island I'm from\nAnd y'all don't want no problems with them\n\n[Verse 6: GZA]\nWe got a history full of lightning victories\nConceptual breakthrough, it ain't no mystery\nLong vision from giants in every way\nRap czars, magnificent flows for every day\nFrom the East to the 'ville, from the West to the hills\nIncredible rhymes, encouraging skills\nFrom rat packs, the smallest crews were enormous\nWe hit 'em fast with an effortless performance\nMCs start fleeing in flocks\nEspecially those that's more sensitive to heat and shock\n\n[Verse 7: Inspectah Deck]\nWe grindin' down to the bone, my name grounded in stone\nI'm Mr. Violence we loungin' with chrome\nMr. Violence we lounge in his home, hit the housing on Rome\nShining like a hundred thousand in stones\nMove mountains with poems, got a jones for dinero\n1-6-zero my songs we throwin' elbows\nThe hoes cling, sho thing, we know kings\nOnly dime dikes with minds right, we choose Queens\n\n[Verse 8: Masta Killa]\nYeah, we wild like rockstars who smash guitars\nYo, son, split his face with the toast, he ain't ghost\nIt's no joke iron coat rifle with the stroke\nOne toke brains float, shot to the throat\nBefore the smoke hit, witness the killing, chilling crime scene\nBody on the block, eyes open from the shock\nOf being popped in the neck\nYet he still held a lit cigarette between his fingers\nDanger when you step into the chamber with the Masta\nDisaster, gotta blast ya cause I have to\n\n[Verse 9: U-God]\nThe rat pack is back from the island of Stat'\nLeave you cursed dust, cause you worship the Gat\nThe first one to snap drunk off the Smirnoff\nBlow the bouncer's ear off, let him floss he the boss\nHandcuffed, to the turntables like Wizard Theodore\nSee it's pure, let it rain pearly ounces\nBang him with the thing that hang from the trousers\nYou don't want no drama, I'm flaming fast\nThat nigga jumped up and did the Damon Dash", "image": "https://images.genius.com/61b48fa7fe972c473dc1c20c9489e45f.1000x1000x1.jpg"}], "artist": "Ghostface Killah"}