{"songs": [{"title": "It Must Be Me", "album": "The Red Room ", "year": "2010-04-27", "lyrics": "[Intro: The Game]\nLet's make it big Pharell\n\n[Verse 1: The Game]\nWake up in the morning, oh shit!\nHad to cock the 9, niggas tryin' to steal my pits\nWent out the back door, see them niggas hit the fence\nI’m telling you, life in Compton is a bitch\nLet off a couple shots, God damn, I missed\nSay fuck it anyway, and let off the whole clip\nI’m not to be fucked with, when I’m off liquor\nOld English in my system, ‘bout to kill me a nigga\nSee, I remember back in the days, loadin’ my AK\nRidin’ ‘round in my Impala with my lungs full of haze\nThat's when I didn’t give a fuck, now I got my son\nShoot a nigga, he die, public enemy number one\nBut, this ain’t no action flick, no Johnny Depp shit\nWhen the Tec spit hollow tips in your Lexus\nSo. Don’t fuck with a Compton nigga when he packin’ the gat\nYeah, nigga, I stay strapped\n\n[Hook: Pharrell Williams]\nSomethin’ hot in here\nNigga, it must be me!\nSomethin’ hot in here\nNigga, it must be me!\nIs it the shades? Is it the J‘s?\nIs it the Bentley with the full color ways?\nOr the old-school sittin’ on blades\nWhat could be?\n\n[Verse 2: The Game]\nIt’s 2-o’-clock in the afternoon, I’m ‘bout to roll a Swisher\n‘Cause that's what real niggas do when they at home\nWatchin’ ESPN on the 70-inch flat screen\nK-Gs and Wade jerseys, blowin’ chronic, that green\nGave up the hoop dreams, bubble with the crack dreams\nTurn hood zombies into a Olympic track team\n‘Till I got shot, and infiltrated the rap scene\nHad to clean my life up, Doc gave me the vaccine\nDon’t get it twisted, I still click-clack things\nRed beam attached to each and every strap\nThat I keep locked up in my basement\nIf I shoot a nigga, will the Lord forgive Jayceon?\nI don’t know, still got a sick fetish for shoot-outs and car chases\nFuck Pacino, ‘cause we know niggas with scarfaces\nAnd we go back, like D-Boys and small faces\nAnd we crashin’ new Ferraris while ya'll hatin'\nPharrell I think it’s\n\n[Hook: Pharrell Williams]\nSomethin’ hot in here\nNigga, it must be me!\nSomethin’ hot in here\nNigga, it must be me!\nIs it the shades? Is it the J‘s?\nIs it the Bentley with the full color ways?\nOr the old-school sittin’ on blades\nWhat could be?\nYou know the answer, fool\n\n[Verse 3: The Game]\nNiggas cain’t fuck with me, real spit\nI guess I am a motherfucking legend, Will Smith\nAll I’m missin’ is a bitch like Jada, Bonnie & Clyde shit\nHit the fence like later, sayonara, arrivederci\nBlack rose Phantom, interior hearse shit\nAnd I got some kisses from a couple Brooklyn bitches\nThem hoes’ll never testify, peace to Common\nBut Game keep it hood like weaves and Top Ramen\nNever stop coming for the top\nIf the bass a flesh wound and Pharrell a head shot\nMotherfucker, and when he take aim\nBullets enter your frame, my bars simi-lar\nTo a dragon swalloin’ flames\nCain’t walk through the club and take a piss\nWithout these new school rap niggas on my dick\nWhile you fuck around with your jewelry and all your whips\nI pull up with your bitch pumpin’ gangsta shit\nNow you know\n\n[Hook: Pharrell Williams]\nSomethin’ hot in here\nNigga, it must be me!\nSomethin’ hot in here\nNigga, it must be me!\nIs it the shades? Is it the J‘s?\nIs it the Bentley with the full color ways?\nOr the old-school sittin’ on blades\nWhat could be?\nYou know the answer, fool\n\n[Outro: Pharrell Williams]\nDo ya thing, shawty\nDo ya thing, shawty\nDo ya thing, shawty\nE’rybody lookin’ now\nDo ya thing, shawty\nDo ya thing, shawty\nDo ya thing, shawty\nE’rybody lookin’ now\nGo, Go, Go\nGo, Go, Go\nE’rybody lookin’ now\nGo, Go, Go\nGo, Go, Go\nE’rybody lookin’ now", "image": "https://images.genius.com/6f2b2ddd912bf816d01b4038ca839d62.1000x1000x1.jpg"}], "artist": "The Game"}