{"songs": [{"title": "Moment for life - freestyle", "album": null, "year": null, "lyrics": "MEEK MILL\nIf I could take the time back, I would rewind back\nThe day my cousin asked my gran where his mom at\nI want my aunt back and my dad too\nThey killed Shawty and Diddy that was sad too\nI cut a couple homies off, shit I had to\nChanged on me for the money, look what cash do\nThinking I’m rich, counting my money\nWorrying bout mine, they should be counting it for me\nI’m just adding up this paper subtracting my homies\nShawty be screaming how she love me, while bouncing it on me\nShe really don’t like me, she just attracted to money\nShe chasing the benjys, so that don’t offend me\nIm just loading up my Glock, hoping that it defend me\nWhen them haters try to kill me I’m clapping the semi\nShe giving me head, I’m grabbing her Remy\nI just wanna B, like the back of the Bentley\nNiggas say I’m Hollywood when I’m Hollyhood\nPut my life on the line for them, shit I probably would\nSwitch that to probably woulda, They wit me probably coulda\nPut'em on probably shoulda, but ain’t nobody realer\nNiggas is so fake, I did my ID check\nKept It A Hunnit Wit Me ?, ain't met nobody yet\nI treat them like the beat, cuz ima body that\nMoving throughout these streets, that’s where you find me at\nBut you ain't gon be running round, like you made my life\nI ain’t met a bitch yet, I would’ve made my wife\nAnd I ain’t met a nigga yet I would’ve made my right\nHand, damn, never take a stand\nNever tell them boys information on your fam\nNever tell them niggas information where you stayin\nCuz they change like the weather, when you wake they're where you land\nWith that hammer in your face, askin for the cake\nEver seen one of your dogs transform into a snake\nEver seen one of them snakes transform into a rat\nI be running through the jungle I could tell you bout that\nI could tell you bout the drought, when the work got snapped\nWhole hood started robbing, everybody got strapped\nWhole team just was broke, everybody got back\nI was selling Sour Diesel, everybody got crack\nIt’s obvious I’m hot, it’s obvious you cold\nPresidential on my wrist, and it’s obvious its gold\nWhole hood got your statements it’s obvious you told\nLike a Lil Wayne album it’s obvious you sold\nI’m on some shit, running neck and neck with Vick\nTrying to bring my city back, take us to where we never been\nI’m just in the studio working like a Mexican\nAnd they tell me I’m a rookie doing it like a veteran\nYea, big dreams small city\nTrying to come up on me, but would you fall with me?\nWould you clutch that hammer and bust it off with me?\nHundred miles an hour running from the law with me?\nI ain’t think so, I just blink slow\nMillion ways to get this money but we think snow\nEvery time I see a chick I just think ho\nAnd every time I meet a nigga I just think Po’\nAlpo ass niggas!\nMoment for life, for life\nI'mma keep it real for life\nAnd I'mma keep getting money, fuckin' bitches for life, for life, for life\nYeah, yeah!", "image": "https://images.genius.com/6929169de7116d41676151bdea5cc773.1000x1000x1.jpg"}], "artist": "Meek Mill"}