{"songs": [{"title": "Kick, Push (Remix)", "album": "Room for Improvement", "year": "2006-02-14", "lyrics": "[Intro: Lupe Fiasco]\nUh, What up y'all? Yeah\nSoundtrakk, what's popping baby?\nIf y'all ain't know\nI go by the name of Lupe Fiasco\nRepresenting that First and Fifteenth, yeah, uh\nAnd this one right here, I dedicate this one right here\nTo all my homies out there grinding\nYou know what I'm saying? Legally and illegally, haha\nYou know what I'm talking about?\nSo, check it out, uh\n\n[Verse 1: Lupe Fiasco]\nFirst got it when he was six, didn't know any tricks\nMatter of fact, first time he got on it, he slipped\nLanded on his hip and busted his lip\nFor a week, he had to talk with a lisp, like thisss\nNow we can end the story right here\nBut shorty didn't quit, it was something in the air\nYeah, he said it was something so appealing\nHe couldn't fight the feeling, something about it\nHe knew he couldn't doubt it, couldn't understand it\nBranded, since the first kickflip he landed, uh\nLabeled a misfit, a bandit\nKa-kunk, ka-kunk, ka-kunk; his neighbors couldn't stand it\nSo, he was banished to the park\nStarted in the morning, wouldn't stop 'til after dark\n\n[Hook: Lupe Fiasco]\nAnd so he kick, push, kick, push\nKick, push, kick, push; coast\nAnd away he rolled\nJust a rebel to the world with no place to go\nAnd so he kick, push, kick, push\nKick, push, kick, push; coast\nSo come and skate with me\nJust a rebel looking for a place to be\nSo let's kick\nAnd push\nAnd coast\nUh, uh, uh\n\n[Break: Drake]\nWhat up, Lupe?\nChi-Town, check\n\n[Verse 2: Drake]\nMy style is very Tennessee mixed with some Terry Kennedy\nPeople barely remember me from back in the day\nI done got some contacts and threw the glasses away\nThe time it took me to get cool was a massive delay, but check\nIt gets boring growing up in Memphis\nTryna become a pro, but keep showing up apprentice\nMama probably would've done anything to prevent this\nCause every single time I break a board, it gets expensive\nLuckily, my aunt workin' as a nurse\nSo every time I needed something, she just reach up in her purse\nAnd plus, she'd always give me speeches on the first\nIf I'm stayin' in her house, then I need to get some work\nI tell her I was there on vacation\nShe said, \"You need to be doing something other than skatin'\nWhy don't you go kick it with your uncle in the basement?\nI'mma let him know that you comin', honey, he's waitin'\"\nSo now, it's me in old school checkered plaid\nPlaying chess, looking through some old school record ads\nHe knew I didn't really wanna post here\nOpened up the window and told me that the coast clear\nAnd now I coast clear, take a deep breath\nFeeling like the Pope's here, homie, this is recess\nThis is each test life's ever given me\nA-plus graded by a teacher in a sweet dress\nYes, I'm literally Larnell Lewis with a\nKick and a snare, a kickflip in the air\nThe kid's sick denim jeans, put a rip in a pair\nJust so the space ain't restricted in here, breathe again\nThink it's obvious that they need my soul\nMy cousin's after Doe, like re-mi-fa-so\nI said, \"Auntie, this is a safe career\"\nShe said, \"Drake, I told you there was no skatin' here\"\n\n[Hook: Drake]\nSo I kick, push Kick, push\nKick, push Kick, push Coast\nFast as the wheels replaced\nI gotta find another hobby just to fill the space\nSo I kick, push\nKick, push Kick, push\nKick, push Coast\nPeep the way I roll\nJust a rebel, lookin' for a place to go\nSo I kick Then push\nAnd coast\n\n[Verse 3: Lupe Fiasco]\nYeah, yeah\nBefore he knew, he had a crew that wasn't no punk\nIn they Spitfire shirts and SB dunks\nThey would push 'til they couldn't skate no more\nOffice building lobbies wasn't safe no more\nAnd it wasn't like they wasn't getting chased no more\nJust the freedom was better than breathing, they said\nAn escape route they used to escape out\nWhen things got crazy, they needed to break out\nThey'd head to any place with stairs\nAny good grinds, the world was theirs\nAnd their four wheels would take them there\nUntil the cops came and said \"There's no skating here\"\n\n[Hook: Lupe Fiasco]\nAnd so they kick, push, kick, push\nKick, push, kick, push; coast\nAnd away they rolled\nJust rebels without a cause with no place to go\nAnd so they kick, push, kick, push\nKick, push, kick, push; coast\nSo come roll with me\nJust a rebel looking for a place to be\nSo let's kick, uh, uh\nAnd push, yeah, yeah\nAnd coast\nAh ha, Swanky", "image": "https://images.genius.com/c85f36c02060316fcec1ed423c60f0da.1000x1000x1.jpg"}], "artist": "Drake"}