{"songs": [{"title": "Warzone", "album": "Us or Else: Letter to the System", "year": "2016-09-08", "lyrics": "[Chorus]\nCan't you see we livin' in a war zone?\nGuess you don't notice when you livin' in it\nLike every weekend it's a man down\nAin't got no pity for the innocent so I'ma represent it\nDedicated, tell 'em,\"Hands up, can't breathe\nHands up, can't breathe\nHands up, can't breathe\"\nHands up, can't you see we livin' in a war zone?\n\n[Verse 1]\nThey left his body swangin' down in Piedmont\nAt a Klan rally the day before, but that ain’t mean nothing\nWhat they say \"a suicide\", I say it's genocide\nHey what you got a gun for? Boy you ain’t finna ride\nThey run up on you like Baton Rouge, bet you finna hide\nThat's the difference 'tween us, I'll die to save a million lives\nAppointed leader when nobody couldn't think of shit\nI'll be a martyr if my great grandaughter benefit\nThey pull you over, ask you where your license at\nBe careful reachin' for it, you know you can die for that\nAnd this ain't nothin' new, just got cameras so you can see the shit\nGot Dr. King and Abe Lincoln askin' where the freedom at\nThis ain't no equality\nMan you ain't have no justice on your mind when you shot at me\nBut fuck it, this the way it gotta be\nHey listen, you won't shoot at them then shoot at me?\nBoy you are not a G\nImagine Trayvon askin' why you followed me\nFeel threatened, hit him and whip him, that’s when he shot him down\nDo that to a grown fuckin' man, drop where you stand\nTell my grandma go on with all that prayin'\nIf it's a God and he in the sky, he looking down, he understand\nI'm just a man, and I'm wrong for revenge\nBut I don't get 'em it's like tellin' him to gon' kill again\nKeep fucking around, it’s going to be on in a minute\n\n[Chorus]\nBoy we livin' in a war zone\nGuess you don't notice when you livin' in it\nLike every weekend it's a man down\nAin't got no pity for the innocent so I'ma represent it\nDedicated, tell 'em,\"Hands up, can't breathe\nHands up, can't breathe\nHands up, can't breathe\"\nHands up, can't you see we livin' in a war zone?\n\n[Verse 2]\nThis goes to the white boy that ran in the old church\nI hope you get slow murked, and they torture you slow first\nRan in our place of worship to slaughter our grandma\nWon't go kamikaze for that, well what would you die for?\nHold up... I'll wait, I'll wait\nHeard it from buddy who took for the fall for Watergate\nThe war on drugs was just a war on us\nGive us all these guns, give us all this dust\nChange all them laws, lock all of us up\nWent from Freeway Ricky, on to BMF (free Meech)\nThen hip hop came, that's when we got rich\nCause white kids gravitated to it like all us did\nAnd that's when they got slick\nInvented the technology to take our shit\nDiluted all of the artistry\nPardon me, somebody tell me what happened to Alton\nSterling, killed Philando right in front of the girl\nAnd the world saw\nEverybody's reaction was, \"Hell naw\"\nThis modern day slavery, the prison publicly traded\nAnd the jig's up\nThe Constitution and Emancipation Proclamation's just a fuckin' piece of paper\n\n[Chorus]\nCan't you see we livin' in a war zone?\nGuess you don't notice when you livin' in it\nLike every weekend it's a man down\nAin't got no pity for the innocent so I'ma represent it\nDedicated, tell 'em,\"Hands up, can't breathe\nHands up, can't breathe\nHands up, can't breathe\"\nHands up, can't you see we livin' in a war zone?\n\n[Outro]", "image": "https://images.genius.com/16f7960118cd6a9d64d17f95c9c1f173.600x600x1.jpg"}], "artist": "T.I."}