{"songs": [{"title": "One Four Love Pt. 1", "album": "We Are Hip Hop, Me, You, Everybody, Pt. 1", "year": null, "lyrics": "[Talib Kweli]\nYo you sent out the signal right?\nAnd this is what happened\nThe voice of Hip Hop got heard\nNever comprimised this is how we put it down c'mon\n\n[Kool G Rap]\nThroughout my thuglife I've seen the ???\nLike ??? fight over the role of dice\nFlashing whole lights when killas on a hiest\nSo contight, get poltergiest over the bowl of Christ\nWho pulled the slice from cats aiming gats who showed the hiest\nTold you right she be the one that come and hold your mic\nThen aim it at the whole vice squad just like ???\nRollin like every prototype was dolomight\nOne man recall his ice inside his gun hand he holds for life\n\n[Rah Digga]\nThis for the ones with holes in they graves\nWaitin for they piece when the law misbehave\nI say we off ??? watch 'em walk the beat\nLike you can't cross streets make them all retreat\n(now) Judges and the jury be a little to appointed\nMaking us defendants when we supossed to be the plantiffs\nLaugh now cause soon the thrill stops\nHeads get it on and start to kill cops\n\n[Sporty Theivz]\nI'm sober but the pull me over\nWhat i do yo? (what we do yo?)\nPoe-poe go i'm drivin to slow (cool yo)\nI torin' them explorin them (damn)\nFor them that's why i'm ignoring them (uh-oh)\nBring like king skip\nBefore they bring this to some Rodeny King shit\nForget them fools\nNow make no sudden moves\nThey reachin for they tools (let's move)\nYou buggin dude\nKirk you ran the stop, word them pigs frontin\nYo tell like you tell 'em cousin we ain't did nothin\nAll they see is three blacks in a jeep with seats back\nLookin for ??? packs how the blood dog can eat that\nThey thirstin for a reason to blast you can't beat that\nGats and a badge to match you can beat that so bounce 'em\n\n[Mos Def]\nMy people unite and let's all get down\nWe gotta have what? love peace and understandin\nOne god, One love, One light\nOne aim, One voice, One fight\nMy people unite, hop up and do it right\nWe gotta have what? love peace and understandin\nOne god, One love, One light\nOne aim, One voice, One fight\nMy people unite, hop up and do it right\nDo it right ya'll, keep it tight ya'll, do it right ya'll, just do it\n\n[Shabaam Sahdeeq]\nBlood on they hands, blood on my mans\nDestroying the fam\nMore souljers die, another mother cries\nAnthony Buyers, ??? ???, Diallo\nLet it keep happenin and theirs more to follow\nIt's even deeper then that penal shot in the back\nForever we fight and cus but the world still adjust\nSo many bullets just to stop one man\nIs that the plan\nTo leave us all dead in the street\n\n[Common]\nI'm an opponent of violence\nTo many of my guys have to condome it in silence\nLaw takes lives and can only do violence\nAnd with night sticks i write quick\nHopin that\n\n[Talib Kweli and Common]\nI might hit somebody in the heart\n\n[Talib Kweli]\nLike an arrow with her eyes on a sparrow\nYo i feel my peoples pain all in my bone marrow\n\n[Common]\nI'm tellin Pharoahe to let my folks go\nMa's been singin to law like they background vocals\n\n[Talib Kweli]\nLocal, state, federal cops have been payed properly\nTo protect the property\nHow can i just stand by and watch a man die for nothin and not react\nThe way we spit on this track is how we bustin back\n\n[Common]\nYo i pimp slap 5-0\nGet behind them and make the marks drive slow\n\n[Talib Kweli]\nYo, you wanna know how to improve on the quality life?\nTry respectin it step into my zone and maifest a check in it\n\n[Pharoahe Monch]\nCops they transport me from Long island to Medina\nWith they fucked up demeanor\nDreamin of stickin it to me like Abner Louima\nPharoahe slash El-Hajj Malik Shabazz\nWith plans of retaliations of they coward ass\nGod please allow me to preach for 'em\nA voiceless man through a spirit i speek for him\nStep to city hall if a dove flew for Diallo\nWith a vision of cops inside the Public Enemy logo\n\n[Posdnous]\nAll that scheming and plotting\nThe young absorb like cotton does\nEcspeacially in my city where the boys steady rockin in\nYou would thought 5-0 would cut it all short\nBut they play the biggest part in the art of living arms\nIn our land cops guns clap more then hands\nAs if we don't deserve what they hear to preserve\nWe just tryin to do it right in these worlds that we rappin in\nWhile they trying to fill us all up with more lead then zepilin\n\n[Everyone Lead by Mos Def]\nMy people unite and let's all get down\nWe gotta have what? love peace and understandin\nOne god, One love, One light\nOne aim, One voice, One fight\nMy people unite, hop up and do it right\nWe gotta have what? love peace and understandin\nOne god, One love, One light\nOne aim, One voice, One fight\nMy people unite, hop up and do it right\nMy people unite and let's all get down\nWe gotta have what? love peace and understandin\nOne god, One love, One light\nOne aim, One voice, One fight\nMy people unite, hop up and do it right\nWe gotta have what? love peace and understandin\nOne god, One love, One light\nOne aim, One voice, One fight\nMy people unite, hop up and do it right\nMy people unite and let's all get down\nWe gotta have what? love peace and understandin\nOne god, One love, One light\nOne aim, One voice, One fight\nMy people unite, hop up and do it right\nWe gotta have what? love peace and understandin\nOne god, One love, One light\nOne aim, One voice, One fight", "image": "https://images.genius.com/facf74257c67da04641635f3cd67e725.268x268x1.jpg"}], "artist": "Yasiin Bey"}