{"songs": [{"title": "Dogg’s Turismo 3", "album": "Gran Turismo 3: A-spec Original Game Soundtrack", "year": null, "lyrics": "Yeah man\nWhich one of these cars you gonna use\nI might use the Celica, the Mazda, the Nissan or the Toyota (what about that MR2?)\nI heard they got that new PT Cruiser on there too\nTea that got that [?], too (oh fo sho!)\nYeah, which course we gonna use (I dont know)\nLets try the Deep Forest\nI heard that was fly (yea, it is)\n\n3! 2! 1! lets go!\nFoot to the pedal and the pedal to the floor\nHurry up and take off, adjust my seat\nEverything cool cause I'm dippin' to this beat\nSlidin', slippin', smashin' off\nI’m taking the lead while others crash the wall\nDoggy D-O-double G in the (motherfucking) Gran Turismo 3\nThe coldest game, doin thangs\nI'm picking up speed while I'm switchin' lanes\nDoin' 'bout a 100 tryin' to reach two\nMy homie in the baby ('Bu), navy blue\nYea, it’s on! sittin' on Firestone\nI'm tryin' to bring another checkered flag home\nIt feels bad in the worst way when you in last place But loc, I’m in 1st place\nSo how I’m gonna trip off that?\nCause if I lose I’m a turn it off and get right back\nChose a whole nother car\nA whole new course, with tunnels and trees\nThanks for your support\nI couldn't have made it without you\nI doubt you ever seen a racing game this astounding\nPicking you up when you’re down and\nI drive good when the beat be poundin'\nKnocking all across your face\nYour boy want another race\nIn a whole nother place, a whole nother state\nI was last seen doing two ninety eight\nIn a S2000 silver and black\nSitting on chrome, actin' bad like that\nBurning rubber, smashing like that\nOn the real deal\nLive from the Apricot Hill\nI’m in hot pursuit\nBeing pursued by (hoes) that’s way too cute\nSlipping out my lane, swerving trough the grass\nMan these cars be on my...\nBumper jump up to three hundred, way cold\nI’m doing too much I done lost control\nShould I stop or should I roll?\nMy mission is to position my pole (position)\nAnd fold these others up, even my brothers (what?)\nIt’s all about winning! y'all know what’s up\nPlaystation 2 taking you to a whole new dimension\nWhere the cars look fly and they got good suspension\nDid I mention it was tight though for real though\nGran Turismo number 3\nYour listening to the sounds of the D-O-G baby\nRiding slippin', slidin'\nWatch out for the curve the cars be colliding\n(Damn) you in second gear? put it in third\nAnd make sure you don’t hit those white lines by the curb\nYou wit your shuby do in the Subaru\nOh Lord I jumped in a dark blue Ford\nAny claim that he in it to win it\nDon’t trip, just make sure that you gonna finish 1st, 2nd, 3rd\nThat’s all that matters and I doubt there’s a racing game that’s phatter\nFor real though Gran Turismo for sho though\nOn the low tho, the game that’s for sho yo\nPut your pedal to the metal\nAnd ax all the kids in the ghetto\n“Is the game hot, like the kettle?“\nAnd I guarantee they all say, “Hello!?!”\n\nRide on, ride on, ride on\nI know u swerving right there\nDoing bout two hundred\nIn the fast lane\nYeah, what’s the name of the game?\nGran Turismo for sho' yo on the low tho\nGran Turismo, Gran Turismo, Gran Turismo\nIs it the tightest game?\nBetter ask somebody\nFor real yo Gran Turismo, Gran Turismo, Gran Turismo, Gran Turismo", "image": "https://images.genius.com/ae2cfe5f02eefc91fd2334d6cb02296b.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}