{"songs": [{"title": "Rider", "album": "Astronaut Status", "year": "2012-01-01", "lyrics": "[Intro:]\nWhatchu lookin for\nI'm lookin for a bitch\nThat'll stay down for a nigga through thick and thin\n\n[Hook:]\nWould you ride for yo nigga\nThat's all I wanna know\nWould you die for yo nigga [Yea!]\nThat's all I wanna know\nI'm lookin for a rider, a rider, a rider\nI'm lookin for a rider, a rider, a rider\n\n[Verse 1: Future]\nGot a bankroll now full of hundreds\nI could let you blow it right now uh hu\nIf everythang failed would run run through the rain, shine, thunderstorms\nWould you fuck with the kid where I'm from... Gotta hold my bond, hold my gun\nWhen days get tight and I come in sweaty, Would you kiss all over me with yo tongue\nWould you ride for the kid, would you lie for the kid? Death before dis-honor\nWhen I'm on the road doin shows from Mississippi all the way to Hong Kong\nAnd we made the bond that's ways beyond loui vuitton loui vuitton, don't wory bout the money, the money gone come (Racks!)\nI just need to know these two questions\n\n[Hook]\nWould you ride for yo nigga {Ayee, whatchu lookin for}\nThat's all I wanna know\nWould you die for yo nigga\nThat's all I wanna know\nI'm lookin for a rider, a rider, a rider\nI'm lookin for a rider {watchu lookin for}, a rider, a rider\n\n[Verse 2: Future]\nIf some things on my mind I need to get off\nCan I come to you?\nWhen I need to talk\nIf I ever get lost, can you help me find my way back to my vault\nWould you cherish yo kid like you never had did\n\nCould you love me? Could you love my kids?\nCan you be there for me like you never had been\nLike any relationship you ever been in\nWe make a connection that's full of affection\nCan you hold me down, Knowin my profession\nWill you wait for me patiently, tastefully\nWill your loyalty lead to royalty\nCan you answer these two questions please\n\n[Hook:]\nWould you ride for yo nigga\nThat's all I wanna know\nWould you die for yo nigga\nThat's all I wanna know\nI'm lookin for a rider, a rider, a rider\nI'm lookin for a rider, a rider, a rider\n\n[Verse 3: Tasha Catour]\nTake you on the town, Baby everythangs on me\nFirst I'm a pick you up in the red rarri\nBaby it's yo night you can have whateva you like\nBet you ain't had a bitch that's gone treat you right\nBitch that's gone stay down\nBitch that's gone stay round\nBitch that'll hold dem pounds... If twelve pull up right now\nI'm in love witchu\nBaby it's the truth\n(Moans)\nBaby it's the truth\n\n[Hook:]\nWould you ride for yo nigga (Alright, alright)\nThat's all I wanna know\nWould you die for yo nigga\nThat's all I wanna know\nI'm lookin for a rider, a rider, a rider\nI'm lookin for a rider, a rider, a rider (Alright, Alright)\n\nThat's all I wanna know!", "image": "https://images.genius.com/fe6d4fe8f740e77fafb8663936890e37.500x500x1.jpg"}], "artist": "Future"}