{"songs": [{"title": "Kings", "album": "Pharaoh Height 2/30  ", "year": "2015-08-28", "lyrics": "[Produced by The Weeknd & Jason “DaHeala” Quenneville]\n\n[Verse 1]\nAs I proceed to go dig through an old crib\nHold kids as I plunder through a pharaoh house\nThug Bones in gilded apparel piss\nBut arrow heads then let the marrow out\nI literally won't leave litter since I've received the Brita\nAnd when the sea leaves the land, who will feed the rivers, huh?\nCrazy busy, make me, make me miss ya even when I'm with ya\nIf a phone calls in the club, but the music is too loud around to hear it\nDo I still have to clear it?\nExample: now I don’t let samples in my lyrics\nMyth be told, 60 souls perished in the parish bill\nWrote a pair of wills on 50 scrolls with a pair of quills\nAnswered the question 'Americause?' Amerikills\nBeen living inside in envelopes with a pair of sills\nTall man like terror bills downfall from a pair of stilts wearin' heels, that's high\nAs I proceed to find silver line in a stalagmite\nCat eyes and scarab crowns on a black grace\nToo wave, not to see bubonic plague in your rat face\nPractice on the uttering until it lactates\nThen begin the buttering of the pancakes\nPush it to the margin flood the garden to the land lakes\nAssociate with mates who spit inside of they handshakes, yeah\n(Pharaoh, pharaoh, pharaoh)\nYeah, yeah, yeah\n\n[Verse 2]\nAs I walk through the shadow of San Fernando Valley\nWalkin' like fingers how, how they rally on pianos\nUp and down the dial until I WKRP, in Cincinnati\nLet's settle on the station like \"Last gas for 100 miles\"\nMay I have this last dance?\nGrab her hands then proceed to do the runnin' child\nVindaloo the stomach growls, introduced to somethin' wild\nUntil we see civilization, Walmarts and Chik-a-fallacious\nPatience, our art isn't intimidation\nBut you can't process the progress\nIf you get your style cues from outta Complex\nNah nigga, that ain't hot\nNo, no and no shots, no boas and no thots\nI walk 'em over the motorboat on the yachts\nTo go so sober on all the shirk and on overdose on salats, huh?\nFrancis Ford Coppola’s spoken plots\nHyannis Port localists rollin' in open drops\nTitanic corpse smokin' from openin' those with chops\nLycanic moonlit leader loc'in with loaded Glocks, huh!", "image": "https://images.genius.com/bef4cf108208bb4604a6547581b0aaf0.500x500x1.jpg"}], "artist": "Lupe Fiasco"}