{"songs": [{"title": "The Dogs of War", "album": "36 Seasons", "year": "2014-12-09", "lyrics": "[Verse 1: Ghostface Killah]\nMoney Miggs, let's get him\nI need help to plan an attack twist back these youngin's\nTired of the run-in's, these niggas ain't live\nNine years in the desert, son, they couldn't survive\nWe're gonna ambush. Blow out the windows, set flames\nTurn the pilots on, set up bombs by the maze\nBlow brains, tie niggas up to the radiators\n\n[Shawn Wigs]\nThey ain't gladiators we gon' crush 'em\nPush 'em to the edge, bum rush 'em\nYou know how we do. OG style I dress like the pizza man\nAnd when they answer the door you come out the van blazin'\nFlame-throwing niggas like shish kebabs\n\n[Ghostface Killah]\nToasty, roasty, they be like Ghost be crazy as shit\nThey fucking with the wrong one\nSon of a gun, I make murdering fun\nYou took my baby, my block, and corrupted my hood\nI'm a do it for my hometown, New York understood\nI see laboratories, chemicals and shit\nThey cooking right here on the block. I'm throwing a fit\nDestructo, destroying houses like wreckin' balls\nCrushing your foundation you sit somewhere, inspect the fall\n\n[Shawn Wigs]\nChill. Back the fuck up; it's gonna blow\nHe gotta face full of powder and that blue-like snow\nThe explosion threw him twenty feet in the air\nHe hit the floor and his face just stuck in blank stare\nHey yo, Tone. Hey yo, Tone. Wake the fuck up\nThe chemical burns on his face, I wanna throw up\nI hugged him, felt his heart beatin', his chest breathin'\nFuck the police, son, I ain't leavin'\nScooped him, threw him in the van and split\nTook him back to the crib and shit, we gon' fix it\n\n[Hook: Ghostface Killah & Shawn Wigs]\nHey yo, get him (I got 'em)\nWe gon' rock 'em\nTry dealin' shit on my block, you got a problem\nIt's Tony Starks and Money Migg, the OG's\nSchoolin' niggas in these streets with no degrees\n\n[Movie Sample]\n\"Yeah. That's right, nigga. What you want? (??) black ass.\"\n\n[Verse 2: Kool G Rap]\nI hear 'em talkin' gun talk, that's my language (language)\nHollows up in the chambers, a hundred shots that'll angle (yeah)\nSoon as a nigga aim 'em, they blowin' like James Ingram (word)\nNickle plates from '88, shit'll \"Wrath Of Kane\" em (Kane 'em)\nI'll pee on a handball court wall where they paint 'em (now hold that)\nI'll fuckin' yellow-stain 'em\nThem niggas out of pocket with it (word)\nBuck shots, left his big man chopped to a midget (blaow-blaow)\nRippin' crazy shit, poppin' from a Civic\nWarm biscuit tryin' to put this nigga Starks in a barrel\nThem slugs hit the wall, I assassinated his shadow (damn)\nAt the train yard, my tires rollin' over gravel (yeah)\nI hope I hear him step on the third rail and crackle\nNow I'm hoppin' out the whip, gotta finish this\nMy biggest hammer about to show him what the business is\nParked trains, darker rain, ain't no witnesses (where he at?)\nI swore I heard his footsteps right behind me (word, yo)\nSo, I turned around quick to do this nigga slimy\nNothin' but a black stray cat ran over line three (what's that?)\nA homeless man rollin' cans in a shoppin' cart (oh, shit)\nAnd then, from top of the train, came a pop, a spark\nTried to pop back but I was locked in a arch\nThe nigga hit his mark right on top of my heart (aw, damn)\nMy whole chest went numb and the pain got sharp (down)\nFell face down on the ground, saw the Timberland mark\nHe bopped, swingin' the gun like a pendulum arm\nThe silencer on the shit was like a Michelin part\nThen everything faded out, became of victim of Starks", "image": "https://images.genius.com/b7e8d5889ca7a25f1f186a54b799b1ab.1000x1000x1.jpg"}], "artist": "Ghostface Killah"}