{"songs": [{"title": "Mr. Scarface", "album": "Mr. Scarface is Back", "year": "1991-09-26", "lyrics": "[Intro]\nMr. Mr. Scarface been walking down the block\nOut jumps some fiends and steals all his rocks\nPulls out a gun and shoots down all the fiends\nAnd Mr. Mr. Scarface went up the block again\n\n[Chorus]\nAll I have in this world, all I have in this world\nAll I have, all I have, all I have in this world\n\n[Bridge]\nAhh yeah, hah\nMr. Scarface is back in the motherfuckin house once again!\nYea, droppin some of that new\nMr. Scarface Two, on your motherfuckin ass\nSo suck a nigga dick, or make a nigga rich\nOr something, bitch\n\n[Verse 1]\nI don't give a fuck about the chatter in the background\nNiggas get beat when they step this is Ak's town\nIf you don't know, I recommend you check\nAnd ask them motherfuckers how many heads I put to rest\nI play a game but the game ain't roulette\nSlangin 'caine is the thang and I bet\nThat there's a lot of wannabe Scarfaces\nI've heard the name in ninety-nine different places\nI'm here to squash it all original will speak\nScarface on your ass from the streets\nI left my cut, in fear of a prison term\nThey wanna put me in a chair and let me burn\nBut go to prison on a murder rap, fuck that\nI refuse to be a visitor at state's camp\nSo I broke and left behind all I worked for\nEither that or be sentenced for a drug war\nAnd many want to know why I've slowed up\nIt's either that or get fucked\nCause laws get happy on the trigger\nSay fuck it put a cap in a nigga\nBut this ass ain't made for no caps, homie\nThis ass says 'Exit Only'\nSo I get in the wind but hey\nA nigga still sold a quarter everyday\nI sat around for six months black\nWaitin for the day to make a comeback\nAnd now I'm ready for combat\nMr. Scarface is back\n\n[Chorus]\nAll I have in this world—all I have in this world\nAll I have in—all I have in—all I have in this world\nNobody knows my name, they'll only know this face\nOn the for-reala my nigga just call me Scarface\nAll I have in this world—all I have in this world\nAll I have in—all I have in—all I have in this world\nNobody knows my name, they'll only know this face\nOn the for-reala my nigga just call me Scarface\nAll I have in this world—all I have in this world\nAll I have in—all I have in—all I have in this world\n\n[Verse 2]\nAiyo Bido, drop that shit\nYeah, heh heh\nBack in the South Park, six o'clock on the dot\nCheckin on my old rock spot\nI seen the same old set\nHeh, the small timers see me so they jet\nBuildin' 128\nI got myself a bag and I can't wait\nTo cut em up small to make a profit\nNiggas on the cut short stop it\nFiends'll see em small then they go\nWhere, to see the motherfuckin' pro\nOne nigga got pissed\nAnd started reachin' for his shit\n.357 on your ass, fool\nLike I said before, you don't get a second chance dude\nUnloaded on his ass, he was hurt\nSix shots put his dick in the dirt\nLaid him out like a motherfuckin' rug\nGettin' pumped full of .38 slugs\nSome other niggas stepped out y'all\nAw shit, I had to make a phone call\n\n[Skit]\nJ. Prince: Hello?\nScarface: Hey J!\nJ. Prince: Wassup?\nScarface: I'm in a little trouble man\nJ. Prince: Where you at?\nScarface: I'm out here in South Park Village\nJ. Prince: Stay right there, I'll be right on\nScarface: C'mon let's take these motherfuckers to war man\n\n[Verse 3]\nJ called up some niggas from the 5th Ward\nAnd came back with a motherfuckin hit squad\nMotherfuckin Uzi machine\nBig Chief packed an M-16\nWill an AK with a banana clip\nAnd little Bill had a god damn pistol grip\nI hit a little laugh and got me a buzz\nAnd that's about the time they got drug\nOne more war took place\nYou can call me the shit starter, or call me Mr. Scarface\n\n[Chorus]\nAll I have in this world—all I have in this world\nAll I have in—all I have in—all I have in this world\nNobody knows my name, they'll only know this face\nOn the for-reala my nigga just call me Scarface\nAll I have in this world—all I have in this world\nAll I have in—all I have in—all I have in this world\nNobody knows my name, they'll only know this face\nOn the for-reala my nigga just call me Scarface\nAll I have in this world—all I have in this world\nAll I have in—all I have in—all I have in this world\n\n[Verse 3]\nDamn, check this shit out\nLater on, all alone, you know what happened next\nAnother bitch came by to give me sex\nIt was kind of strange I was throwed off\nThe last bitch got her head blowed off\nBut fuck I ain'tsta pass up no putty\nShe started strippin' at the door, oh goody\nI got in that ass with the quickness\nFuckin her down with the diznick\nI didn't have to pretend I loved her\nAll she wanted me to do was just fuck her\nSo I gave it up to the lady\nAnd all she said was \"Fuck me baby, fuck me baby\"\nI started stroking in an outrage\nThe whole while I was starin' at my twelve gauge\nThe bitch was makin noise I said I'm killin her\nAnd all the while my dick was hard and he was still in her\nI made a nut as she fell to the floor\nI heard a knock on the front door\nI grabbed the twelve gauge from the bed head\nWho is it? (Fred) Who?\nWho the fuck is Fred, I stood by the door\nBy that time someone jumped in the window\nNow what the fuck was I do?\nThe bitch packed a twenty-two\nHit him in his head, there she laid him\nThe nigga standin' by the door I sprayed him\nAnd headed for the back\nI seen that same old brown Cadillac\nIt kinda fucked me up at first\nCause the nigga that drove that Caddy rode away in a hearse\nI opened up fire on the ride G\nWho I was shootin for was standin right behind me\nI had a double barrel pointed at my ass\nCould this be the end of Mr. Brad?\nI don't know what happened to the slut\nWell that's about the time the closet door it opened up\n(On your ass trick!\nI'll be damned if I go out like the last bitch!)\nHeh, five-0's on my ass, mane\nThey know me by the face, but they don't know my last name\nNow I'm back on the case\nYeah, just call me Mr. Scarface", "image": "https://images.genius.com/bfc55f1e39dab482dd5f87425202cda6.453x450x1.jpg"}], "artist": "Scarface"}