{"songs": [{"title": "Camera Ready", "album": "Writings On The Wall 2", "year": "2011-07-05", "lyrics": "Crazy Mane, with the crazy chains\nGot these bitches at the telly doing crazy thangs\nWhat you bitches know about the Gucci Mane?\n\nHOLIDAY SEASON!\n\n[Verse 1 - Gucci Mane]\n? ain't a thang, call me Gucci Mane\nI got these bitches taking pictures of my candy chain\nI'm just a rich, wealthy nigga, kind of weird and strange\nBut I stay dead fly like a private plane\nIf you don't know about the ki, then I must explain\nEverything that I got, owe it to cocaine\nI'm insane in the brain like Saddam Hussein\nI'm fire: propane, I'm a boiling flame\nI came, I conquered, I did my thang\nDropped my chain, then I changed the game\nTwo dames on the train, got that English brain\nCause my money real long like a Marta train\n\n[Hook - Gucci Mane]\nIs your camera ready?\nHold your camera steady, hold your camera steady\nI stay camera ready\n\n[Verse 2 - Gucci Mane]\nGucci Guwop up in the drop playing 2Pac\nTaking 2 shots of Ciroc, then drop some ?\nTaking me some blocks off the top, I gotta re-rock\n42 grand in my pants, now that's a Teton\nThe hustler don't stop on my block\nThey sell sheet rock\nKick you square dead in your ass until you kick rocks\nGram after gram, yes I am, I got a weed spot\nLast couple days it been hotter than a teapot\nWay to make bills off the deal, I got the fig out\nNiggas got mills on the deal, I pulled the Sig out\nHalf of a bill off this shit, then I'm a nigga\nCount all my money with my chain, then we gon pig\n\n[Hook]\nIs your camera ready?\nHold your camera steady, hold your camera steady\nI stay camera ready\n\n[Verse 3 - Gucci Mane]\nIt's the crazy Mane with the crazy chains\nGot these bitches at the telly doing crazy thangs\nI dunn camouflaged the flow so it's pure ?\nGot a deal for the labor, so it's more to gain\nI am so untame, y'all niggas are lame\nTreat your bitches like a whore, treat em all the same\nYou gon take her to the store, by the bitch a ring\nShe gon beg me for some more, want a catchy drank\n60 grand in my pocket, that's a drop-top Stang\nWhat you bitches know about the Gucci Mane?\nI'mma shave it off the top, get some extra caine\nIf you ain't getting money, you should be ashamed!", "image": "https://images.genius.com/99f53129285385ae9b5b886965d9b2a0.320x320x1.jpg"}], "artist": "Gucci Mane"}