{"songs": [{"title": "Lil Bitch", "album": "No Ceilings 2", "year": "2015-11-26", "lyrics": "[Intro]\nNo Ceilings\nAll my niggas clutchin'\nAll my niggas two-cuppin'\nAll my niggas rap and trap\nThey all got two phone numbers\nReal one since day one\nAnd all my niggas could vouch for me\nNone of my niggas lack in math\nAnd all my niggas countin' money\nYeah\n\n[Verse]\nPull up, banger on me\nBad bitch fainted on me\nThat purple drank stankin' on me\nDon't wake me up, just put a blanket on me\nThank ya, homie, but I ain't ya homie\nDiamonds blingin' like they blinkin' on me\nAll about the Ben Franklins, homie\nBitch can't even get an Abe Lincoln from me\nThinkin' normally, I ain't thinkin' normally\nFrom New Orleans, guns bang in harmony\nThese little niggas is retarded\nPuttin' testimony over sanctimony\nAll these niggas tryna sink the homie\nBitches tryna put the gangster on me\nFeds tryna put sanctions on me\nThe doctor tryna do maintenance on me\nGuess that's why I take  meds on 'em\nPop and sip and go to bed on 'em\nNew Ferrari, no head on it\nNice new carpet, you bled on it\nThese new artists no competition\nTop of the charts no top of the menu\nThat ain't art, nigga drop the pencil\nShe drop the drawers, I never drop the pistol\nBut I drop the clip\nAnd pull out a new clip\nI'm not 'bout that lip\nBop-bop, nobody exempt\nAnd you see the flaaag, as red as a bitch\nYou see the swaaag, I'm wavy and lit\nMy pops had them bricks, yeah, brick wall\nMy slime got them sticks, bop\nAnd I can do tricks, yeah, skateboard\nAnd my lil boo mixed, yeah\nJust met her dad\nGave her momma a kiss\nWhen she turned her back\nI holla'd at sis\nYeah\nWatch out lil bro\nI fly G4\nMy slimes say I'm brazy, I used to talk to a globe\nI tell it it's mine, I tell it \"One day you be mine\"\nI tell the front page \"You be mine\"\nI was locked up upstate for that iron\nYou know I'm comin' straight off the top\nShe knew I cum on her halter top\nCause she know I don't want no five children\nI'm not a player, I just fuck a lot\nBitch, is you dykin' or not?\nThese niggas is wifin' the thots\nI still got some white in my sock\nAs white as my sock\nThe white in her snot, uh\nI know it could be anybody\nSo I prepare for everybody\nWe wavin' that thing at your body\nWe cravin' to catch us a body! Bop\nLook at the watch on my friend\nSay hello to my lil friend\nMy chopper due any day now\nBop-bop; that bitch just had twins\nLord, you run your mouth like a marathon\nI just run out of them styrofoams\nThe Cialis give me testosterone\nNow she got her legs on my collarbone\nAll on my neck like a herringbone\nI had to sit down with Bizzy Bone\nI had to sit down with Tity Boi\nAnd told him just how I'mma kill his song\nIt's not a remix\nIt's just me, on my comeback and shit\nI just unwrapped a brick\nPut it on the scale, it come back thirty-six\nIt come back thirty-six\nThen that's when we whip, we mastered the wrist\nThen that's when it flip\nThen after it flip, that's when it flip\nYou know what it's like when the feeling gone\nI know what that's like when the ceiling gone\nI know what that's like when the ceiling gone\nI know what that's like when the ceiling gone\nWatch out lil bitch\nMy partner got hitched\nNo influence\nOn me, it had no influence\nI don't know my daaad, but my momma is rich\nYou see the red flaaag, but my partner a Crip\nDamn! Watch out lil ho\nOoh, Pew, I fly G4\nOoh, you got jet laaag stuck at the airport\nDamn, I'm in LA stuntin' on Melrose\nYeah, stuntin' on them hoes in them Yeezy's\nThem Jeremy Scott's and Shelltoes\nOkay!\nI think I'mma need a check for shouting out Adidas like that\nFor real\nNo Ceilings", "image": "https://images.genius.com/ed7fb7fe9af1d913b520bf5336619560.800x800x1.jpg"}], "artist": "Lil Wayne"}