{"songs": [{"title": "Hoes in My Room", "album": "Chicken-n-Beer", "year": "2003-10-07", "lyrics": "Hey! Thank all y'all for coming out tonight\nIt was a beautiful night tonight at The Shizznit\nWhere pimping ain't dead, these hoes just scared\nThanks Snoop Dogg, Ludacris, all the players from the LBC\nIt was a beautiful night tonight\nOh, look at these fools, Ay! Security! Come get these niggas!\n\n[Verse 1 - Luda] + (Snoop)\nFresh off the streets, just finished a show in Long Beach\nReady to relax, kick up my feet\nMaybe smoke a blunt or two, that's what I wanna do\nBroke out and called up the homeboy Snoop (What happenin' nephew?)\nOh, nothing just called, looking for some women how can fondle my balls\n(Well you hit the right dogg, I can help you with that\nGimme 15 minutes, and I'll hit you rite back)\nOff to the hotel, I was ready indeed\nSlapped the button in the 'llac to control the speed\nPut one up in the air, the cops just stared\nWaved my hands out the roof like I just ain't care\nGot to the tele and I slid through the door\nOn to the elevator, hit the penthouse floor\nAnd what would happen next only time could tell\nCuz I got up to my room, and I was mad as hell (Aaah! Damn!)\n\n[Hook]\nWho let these hoes in my room? (These hoes)\nWho let these hoes in my room?\nWho let these hoes in my room? (Did you let 'em in?)\nWho let these hoes in my room? (These hoes)\nWho let these hoes in my room?\n\n[Verse 2 - Luda]\nNow it was five bap hoes and they look like trash\nBut one was midget, so we'll just say four and a half\nI was stuck speechless, couldn't believe my eyes\nWhat'd I do to deserve this unpleasant surprise?\nAnd I was thinking to myself, \"This is just my luck\"\nThen my nigga bust in like \"What the fuck!?\"\n(Oh shit it's Snoop!)\n\n[Snoop] + (Luda)\nWho in the hell let them booger bears out they cell (Not me)\nAnd what they doing in ya' room? Nigga make 'em bail (Yeah)\nGot some fine bitches, dime bitches on they way (Okay)\nAnd told security, \"Let 'em in, with no delay\" (Ha Ha!)\nSo when they get here, they'll probably be like half naked\nDon't mean to trip out, but bitch y'all got to dip out (Dip Out!)\nCatch the elevator on more floor\nPresidential with the sliding key for the door (Oh No!)\nWhat the fuck going on?\nShit, all around the world Luda, then it's the same song\nThem bitches was so ugly, I told 'em to go home\n\n[Hook]\nWho let these hoes in my room?\n(Man who let these hoes in my room?)\nWho let these hoes in my room? (Oh no!)\n(Did you let 'em in?)\nWho let these hoes in my room?\n(Well who let 'em in then?)\nWho let these hoes in my room? (Get out!)\n\n[Verse 3 - Luda] + (Snoop)\nNow, these chicks wouldn't leave, they was ready to clown\nOne was 5'6 and weighed three hundred pounds\n(No she didn't come through with a thong on\nShe did for the hell of it, big fat whale of it)\nYou can't separate me, I'mma separate you\nBitch ya' pussy smell like Pepe Le Pew\n(You filthy, nasty, sick in the head\nSitting in my dressing room with dick on ya' bread)\nShe said \"I want you to climb in this underwear, silly\"\nBut I was turned off by her tupperware titties\n(Fake bitches, break bitches, make bitches\nKick rocks, when they fucked up in they face\nTick-tock, you gots to get up out my space\nHey Ludacris let's get the fuck up out this place, let's bounce)\nThen it got to my head, and something reminded me\nI know who let 'em in, it was Bill O'Reilly (Faggot)\n(Ya' white bread, chicken-shit nigga!)\n\n[Hook]\nWho let these hoes in my room?\n(Who let these hoes in my room?)\nWho let these hoes in my room? (Did you let 'em in?)\nWho let these hoes in my room?\n(I need to know, who let these hoes in?)\nWho let these hoes in my room?\n\n[Snoop Dogg]\nAy, ay y'all gotta go\nY'all gotta get the fuck up outta here, ugly ass bitches\nI dont understand how these bitches always get in my dressing room\nYou know what I'm sayin'?\nSoon as I get off stage\nIt's 7 or 8 ugly ass bitches posted up in my dressing room\nAnd security act like they don't know who did it\nI know you feel what I'm sayin', all my nigga around the whole world\nWe need to form a society or something\nFat, gorilla, monkey mouth bitches\nCan't get in our motherfucking dressing room or backstage\nAnd if they do, we kindly put our foot up their asses\nAnd re-direct them bitches to security dressing room, you dig?\nSick of these ugly ass bitches being my dressing room", "image": "https://images.genius.com/1498cf277a7dc50ffc916ca191c3608f.1000x1000x1.jpg"}], "artist": "Ludacris"}