{"songs": [{"title": "Street Fighter", "album": "Street Fighter (All New Songs From the Motion Picture)", "year": "1994-12-06", "lyrics": "[Intro: Ice Cube]\nLet's get ready to rumblllllle!\nHa ha ha ha ha ha hahhhhhh\nAh ha ha ha ha ha hahhhhhh\nSo you wanna fight me?\n{*scratched: \"We are at war!\" - Sister Souljah*}\nHeh, heh heh heh!! {*scratching continues*}\nHMM! Heh heh heh!! {*\"We are, we are...\"*}\nStep into MY arena {*\"We are, we are...\"*}\nYeah nigga! {*\"We are at war!\"*}\n\n[Ice Cube]\nY'all punk-ass ninjas can't wait to see the Ice break\nBailin through the hood with my chocolate rice cakes\n15 ninjas in a row\nJumpin out the bushes with they tae kwon do, yo\nI jumps in my stance fo' protection\nKickin off my coat like \"The Chinese Connection\"\nWah-CHOP~! Watch 'em all drop, you can't stop a\nTeacha teach ya get the grasshopper\nI'm the illest nigga that you ever seen\nMaster of the flying guillotine\nOn with my journey, cops say I need an attorney\nFo' my celly, hit they ass with my Jim Kelly\nAt the Japanese deli fo' my troop\nAnd we all take malt liquor, in our wonton soup\nOops as I smell my fork\nIt smells like sweet'n'sour pork\nThey rush me from the left.. and they rush me from the right\nHere come the chef with the Ginsu knife\nHe wanna take my life, I put that on my momma\nAnd serve my ass at Benihana's now\nWhich style will I use this week? Ahhh\nThe \"Quicker Blood\" technique\nHere they come, one by one they get done\nBy the chosen one, nigga \"Rising Sun\"\nIt's 11 to 1, yet no one left\nServin these fools in my game of death\nIt seems like we fight everytime we meet\nI bow when I greet, let's take it to the street\n\n[Hook: Ice Cube]\nLet's get ready to rumblllllle!\n{*scratched: \"Let's get it on\" - Chuck D*}\nLet's get ready to rumblllllle! Street Fighter\n{*\"Let's get it on\"*}\nLet's get ready to rumblllllle!\n{*\"Let's get it on\"*}\nLet's get ready to rumblllllle! Street Fighter\n{*\"Let's get it on\"*}\n\n[Ice Cube]\nGod damn there's a blind old man on my corner\nAnd he could try to get with me, if he wanna\nCAUSE THEY COME FROM MILES AROUND to try to stop me\nI just keep bailin with my 40 ounce of sake\nI got my eyes on his ass real steady\nI'm ready; he pulls out the black machete\nWith my luck, I think I'm stuck\nIt's a quarter to twelve so I pulls out my nunchuks\nStart to work 'em with style and finesse\nBut the old man's blind so he's not impressed\nI swing; he hits me with the BOOM PING PING~!\nFallin to the ground I can hear my ears ring\nHe smiles, my neighbor dials 911\nFool don't you know my guillotine weighs a ton\nYou're no match - I throw and I snatch\nDecapitate his ass - nigga catch! Ahh\nMany black belts wanna try and snatch the pebble\nFrom the mas-ter, but I'm much fas-ter\nJust ask Bruce Lee\nHim, and Brandon died, befo' I can who-ride\n\n[Interlude]\n{*\"We are at war!\"*} {*\"We are at war!\"*}\n{*\"We are, we are...\"*} {*\"We are at war!\"*}\nStreet Fighter\n{*\"We are at war!\"*} (Anyone, who opposes me)\n{*\"We are at war!\"*} (will be destroyed)\n{*\"We-we, we-we, we-we, we are at war!\"*}\n\n[Ice Cube]\nI'm breakin everybody down to they very last chromosomes\nSo send your, punk-ass ninjas\nI mess around and make turtle soup!\nDo a flip, flop, tuck back on a drum loop\nMaster of the flying guillotine is my chorus\nI want to kill Chuck Norris\nAnd my trick is the invisible fist\nEatin Fatburgers with my chopsticks\nDoin drive-bys with my poison darts\nThat's bamboo, I want to {*censored*} Van Damme too\nSo don't mess around and let me hit you\nWith this skillafied Westside jiujitsu\nHA HA HAH!! SO WHO WANTS TO FIGHT ME~?!\nBefore you come in my house nigga take off your Nikes\nAnd bow, and I'll show you how to withstand this\nCannabis, phantomous praying mantis\nIt's like Chinese arithmetic\nCause you never ever thought you'd see the Dragon saggin\nLife is cheap, I bow when I greet\nSo let's take it to the streets, HAH!\n\n[Hook] - 2X minus Cube saying \"Street Fighter\"\n\n{*\"Let's get it on\" - 4X*}", "image": "https://images.genius.com/79c1e686bb9c0174092d5039500872fa.600x600x1.jpg"}], "artist": "Ice Cube"}