{"songs": [{"title": "We Turn it On", "album": "The Art of Storytelling", "year": "1999-03-25", "lyrics": "Ladies and gentlemen, boys and girls, allright\n\n[Doug E. Fresh]\nThis is... a world premiere...\nOne time y'all, as we turn the heat\nOnce again, as we turn the heat\nMake it hot, make it hot, hot, come on, uh\n\n[Slick Rick]\nHer legends, trying keep it soulful\nBut just since its (Slick Rick) being an old school legend\nI decide to make a jam the kids will slam on\n(DING DONG) How you doing, Gigi? Is your man home?\nIn the living room I see the brother sitting\nSay what up yo?\n\n[Doug E. Fresh]\nYo we cooked 'em in Atlanta\n\n[Slick Rick]\nYou think we didn't?\nBitch coming on, beat box stunning, son\n\n[Doug E. Fresh]\nYo, where'd you get that outfit?\n\n[Slick Rick]\nOne twenty from (?)\nSeen the vibe Cali's on\nLets do an up to date, Doug, put your Ballys on\nI burn 'em on, chick got to storm\nWhile other rapper cat' kettle go hot to warm\nWe Turn It ON\n(Uh uh on, uh uh on, uh uh on)\n\n[Doug E. Fresh]\nAs we turn the heat, yo, yo, uh\nHere's a blast from the past,crowd movers of the future\nUnlimited, hitting it like we used ta\nBoost a track son, we all that son\nWhere you been Rick?\n\n[Slick Rick]\nMe? Missing in action\nHere's a story bout a cutie, bout a rich, bout to ditch\nI'm also known to fuck the beauty out a bitch! (Say what?)\nMight not shoot you in front of group two\nRun a boot, did I mention I'm also quite cute too?\n\n[Doug E. Fresh]\nYo, yo, yo fashion and glamour is ammunition\nCats wishing to rip it like this, keep fishing\nYour flow ain't long enough, strong enough\nAnd record sales aren't (vocal scratching)\n\n[Slick Rick]\nEnough. Slang it on a phatter to a badder kid\nDon't matter a bit, I had to shit, and boomerang\nInadequate\nChick got to storm\nWhile other rapper cat' kettle go hot to warm\nWe Turn It ON\n\n[Doug E. Fresh]\nYo, as we turn the heat, yo, yo, yo\n\n[Slick Rick]\nI bogart through, and then be screaming no hard screw\nHey go-cart crew, your checking out \"The Show Part 2\"\nA fellow I know, \"Is this supposed to sell?\"\nI hope, so well, I spoke, and this is what I tell white folk\nI don't discriminate, don't lack the stimulant crack has\nBattle story man, and I'll eliminate your wack ass\nBackwards tactics, Show for act it\nMe and Doug Fresh took over this rap shit\nFlushes, so as usual tossers\nBetter give us our props as you're new school wusses\nGood times, patch rhyming brought back\nAnd all you other rappers that's trying to talk crap\nI'm not the devil, but your worst nightmare\nSick of rebels, and none of you motherfuckers can\nReach the cat's level\nFour motherfuckers got to storm\nOther rapper cat' kettle go hot to warm\nWe Turn It ON, nigga", "image": "https://images.genius.com/73539fff4e6ebc470e6cab73853f0ac6.1000x1000x1.jpg"}], "artist": "Slick Rick"}