{"songs": [{"title": "Name Of The Game", "album": null, "year": null, "lyrics": "\"The name of the game is..\"\n\n(Talib Kweli)\nPersistance, dedication\nConsistant, motivation, resistance to stagnation\nOf information, distribute it free to the entire population\nNo hesitation, makin it public\nNo privitazation from corporations\nToday in order to be sane you gotta go crazy so remain\nOn top of the game, and master your universe like you was He-Man\nSee me and Hi Tek knock you out de frame\nWhile I'm stimulatin de brain\nIn de \"Train of Thought\" that's the name\nOf the Reflection Eternal LP man!\nAin't nuttin new except organic produce that means that's free range\nYou might see me on MTV, BET, or still up on the D-train\nIt's just everybody else be seemin strange in they approach\nI see these guys and read they eyes\nNeed to disguise and so I cloak\nInto a cloud of smoke, I brown a roach\nTo keep myself from soundin loc'\nDestroy they hopes of hatin\nDon't move aboard before they rock the boat\nYo it's not the dope\nThese snakes will come in peace to slit your throat\nGive you compliments, with a promise yet\nTo get me heated and provoke me\nTo be rockin shit, shove apocalypse\nDown your esophagus so swallow that\nGuess what you could be coppin that\nN'kiru Books for fifteen dollars flat\nCats who spit knowledge on tracks\nAnd get bumped out the back of Impalas and Cadillacs\nAll my live Cincinatti Bearcats holla back\nTomorrow they gonna wanna borrow raps like\n\"C'mon black, I'll pay you back\"\nI ain't no lyrical ATM even though I'm nice and I'm a mack\nBetter believe that, leave that crack alone\nAnd you see that there microphone\nAin't no place to work your self-esteem issues\nDo that shit when you alone!\nNigga you is grown, why is you still suckin on that pacifier\nQuickly call that ass a liar, exposin you's my last desire\nOlympic skills so pass the fire\nI roll with niggas that match attire\nBlack aware, that's filled with gas\nBut rollin on, flat ass tires\nYeahehehe, yo hehehe, yo, yo.. yo yo\nYo I got a special guest\nLil' Baby Tone Tone, tell 'em what's up\nIndecipherable Yo, true\nYo we bout to be, tell 'em peace out Tone\n{Peace out} Yeah word word Baby Tone, what?\n(Yeah what)", "image": "https://s3.amazonaws.com/rapgenius/talib-pic.png"}], "artist": "Talib Kweli"}