{"songs": [{"title": "She Wish She Was", "album": "Still Brazy", "year": "2016-06-14", "lyrics": "[Hook: Jay 305 Joe Moses and YG]\nShe wish she was a nigga\nShe wish she was a nigga\nShe wish she was a nigga\nShe wish she was a nigga\nShe wish she was a nigga\n\n[Verse 1: YG]\nBaby look in the mirror\nYou got your hair and your nails done\nYou fucking who you want, not thinking you was wrong\nBitch you wish you was a nigga\nDamn you should be ashamed\nActing like those pussy lips can't hang (can't hang)\nYou been going against the grain\nYour body is a temple, you going against the saint\nActing like you was innocent\nBut as soon as you get mad at your nigga you be with the shits\nHe just left the house and you calling quick\nWho she calling? Some different dick\nAnd you know that ain't lady like\nWord around the town that pussy whack but head game nice\nIf that pussy ain't tight you ain't living right\nI'm tryna give her some advice on life but...\n\n[Hook: Jay 305 Joe Moses and YG]\nShe wish she was a nigga\nShe wish she was a nigga\nShe wish she was a nigga\nShe wish she was a nigga\nShe wish she was a nigga\n\n[Verse 2: Joe Moses]\nBitches gon' be acting like Bruce but they wanna be Cait\nAnd I heard she fucked Drizzy, didn't even get paid\nDamn, lowkey hoeing for a shoutout (shoutout)\nShe scheming on Wayne before he got out, groupie\nYou dropped outta school to be a stripper, be a stripper\nThis lil bitch be acting like a nigga, what\nLast nigga said he was straight\nSaid every time he pulled up, she be pouring the eighth\nEvery time he wanna chill, you got some friends over\nTo every nigga wanna fuck, you just bend over\nInstagram selling clothes like a swapmeet\nCan't go to no local malls you on the hot seat\nDowntown going HAM with your tax check\nYou off every single drug, you a crack head\nMama told you to value your coochie\nBut traded that head for a hooptie, bitch\n\n[Hook: Jay 305 Joe Moses and YG]\nShe wish she was a nigga\nShe wish she was a nigga\nShe wish she was a nigga\nShe wish she was a nigga\n(Nasty ass hoes, let me tell you about this bitch..)\nShe wish she was a nigga\n\n[Verse 3: Jay 305]\nWhy you always single? Why you think you so cute?\nWhy girls be calling hoes when they fuck a lot of dude?\nWell shit, the answer is this\nY'all bleed once a month and all we got is a dick\nYo emoji was a flip, you know you a hoe bitch\nDrinking on some Lemonade thinking she Beyonce, damn\nCheating on her fiance, damn\nShe getting with it off the powder and the Bombay\nAlways talking she ain't a hoe, she a hoe\nDropping her kids at granny house, she a hoe\nOn Snapchat, dog face, she a hoe\nLA niggas ain't saving no hoes\nThe homegirl, the local hoodrat know all the niggas\nBe bicken back with the Bloods but she be crippin'\nGot drunk one night, tryna fight, this bitch be trippin'\nIf you was a nigga, you'd be a bitch nigga\n\n[Hook: Jay 305 Joe Moses and YG]\nShe wish she was a nigga\n(Bitch what you gotta say about this hoes)\nShe wish she was a nigga\n(Boop ass bitches, man, stripping)\nShe wish she was a nigga\n(Are only at Maestro's, ass bitches, man I don't know)\nShe wish she was a nigga\n(Taking pictures in front of Maestro's\nBitch, man that shit is played out hoe)\nShe wish she was a nigga\nShe wish she was a nigga\n\n[Outro: Joe Moses + Jay 305 ]\nMan these hoes man, I don't know man\n(she wish she was a nigga) they lost\nThey need God man, they need God and Jesus they need to be baptized, I don't know...\nA nigga like me, Jay 305, man to pimp one of these bitches, put one of these bitches on the trinnack\nMan you know what man, I digs that, I digs that\nYou know what I mean, you know what I mean\nWould you hang with that?\nYou know what I mean, it's South Central baby\nYou know what I'm saying world famous\nJay 305...man he stand out, you know what I'm saying?", "image": "https://images.genius.com/6d9597606099b223fdd3ad68fa232887.1000x1000x1.jpg"}], "artist": "YG"}