{"songs": [{"title": "The Predator", "album": "The Predator", "year": "1992-11-17", "lyrics": "\"There's no stoppin what can't be stopped\nNo killin what can't be killed..\"\n\n\"There's somethin out there waitin for us.\" (repeat 2X)\n\n[Ice Cube]\nYou can run but you can't hide\nFrom the Westside night stalker, shit talker\nRun and tell them it's the L.M\nNigga with the gat and I'm back\nOff the everyday prey that I slay\nRollin with a fo' chase ya through South Central\nMonkey-wrench ho should know that, she'll get the bozack\nCause I'm not stavin, but fuck that Johnny Carson ho\nNever had me on the Late Night Show\nComin with the shit that'll hit\n+Steady Mobbin'+ cause the flavor's good\nThere goes the neighborhood\nNigga with the third album; how come he don't fall off?\nRollin with the sawed-off gauge\nTurn the page of the chapter, caught up in the rapture\nBut you know Anita, she can get the peter\nEat 'em up yum, and you're floored\nMotherfuck Billboard and the editor - here comes the Predator\n\n\"Yo I'm out, but - I'll be back\" (repeat 4X)\n\n[Ice Cube]\nCheck your head for the new style\nFuck Laurence Powell and Briseno - Wind and Koon, pretty soon\nWe'll fuck them like they fucked us and won't kiss 'em\nRiots ain't nothin but diets for the system\nFightin with the beast, no justice, no peace\nIf any, even if we fuck up Denny\nNiggas are sick of your white man tricks with no treat\nThat's right; now it's on, on sight\nYou call me a Muslim, no I'm not a resident\nStill got my vote in - Farrakhan for president\nOf white America, I'm tearing ya a new asshole\nWho's the nigga with the new black\nStrollin to your suburb house and I douse\nWith gas, now who's cleanin up trash?\nEat 'em up yum, and you're floored\nMotherfuck Billboard and the editor - here comes the Predator\n\n\"Yo I'm out, but - I'll be back\" (repeat 3X)\n\"Yo I'm out..\"\n\"Here comes the Predator\"\n\n\"There's somethin out there waitin for us.\"\n\n[Ice Cube]\nGot my black rag showin and I'm hoin; Ira Reiner\nCan kiss my grits like Flo, on \"Mel's Diner\"\nI'm meaner than a motherfuckin hyena chasin antelope\nPut my chrome to your dome, watch it bust like a cantaloupe\nI can't stand a rope, so don't try to hang 'em\nTalk about dogs; boy I can slang 'em\nRat-a-tat-tat on your noggin\nCause Ice'll cream your ass like Häagen-Dazs\nChocolate - I get - crazy when I catch wreck\nEven be flippin the tongue like da-diggity-dung Das-EFX\nSo who is Ice Cube? I'm a rapper, actor, macker\nGot a little problem with the redneck cracker, did the tallywacker\nJerry Heller is a devil shit-packer\nComin with a crazy pitch\nAnd the Statue of Liberty ain't nothin but a lazy bitch\nDon't wanna give up the crack, to the black\nBut you'll call it racial, if we go and rape the ho\nBut eat 'em up yum, and you're floored\nMotherfuck Billboard and the editor - I am the Predator\n\n\"Yo I'm out, but - I'll be back\" (repeat 3X)\n\"Yo I'm out..\"\n\"Yo I'm out, but - I'll be back\" (repeat 3X)\n\"Yo I'm out..\"\n\n\"They indicated, that when trapped, the creature activated\nA self-destruct device, that destroyed, enough rainforest\nTo cover three hundred city blocks.\" {*KA-BOOM*}", "image": "https://images.genius.com/aa204256470ef9ed3c3a3fbcc1ee43da.1000x1000x1.jpg"}], "artist": "Ice Cube"}