{"songs": [{"title": "Renegades", "album": "Build and Destroy", "year": "2005-01-01", "lyrics": "[Verse 1: Royce]\nIt's several different levels to picking up shovels\nAnd dumping you in ditches under sea level\nFront and you can witness\nLet me refreshen you niggas, tell you my position in this\n(Ch-chk!) Beef! Leave you under Venice, opposition finished\nHere it is, we invaded, created a pyramid\nOf a Haven of names, so blame Dre, and that ear of his\nSo (ah-ha, ah-ha) breathe, I'd rather reach for your neck\nAnd I never heat you for respect, unless you greet me with less\nI got a skunk in my trunk, I'm lying, I got a pump in my trunk\nYou dying, how many lumps niggas want?\nWho's ready for y'all? We ready for y'all\nWe too incredibly raw for any artist that said he would draw\nI stand firm, and it hurts to live it\nYou open that can of worms\nI hope you ready for the dirt that's with it\nSlap a ho, snatch a mic\nBeing brought to y'all in black and in white\n(It's the new!) Joe Jackson and Ike\nWe renegades\n\n[Verse 2: Eminem]\nSince I'm in a position to talk to these kids and they listen\nI ain't no politician, but I'll kick it with 'em a minute\n‘Cause see, they call me a menace\nAnd if the shoe fits I'll wear it\nBut if it don't, then y'all will swallow the truth, grin and bear it\nNow who's the king of these rude, ludicrous, lucrative lyrics?\nWho could inherit the title, put the youth in hysterics\nUsin' his music to steer it, sharin' his views and his merits?\nBut there's a huge interference\nThey're sayin' you shouldn't hear it\nMaybe it's hatred I spew, maybe it's food for the spirit\nMaybe it's beautiful music I made for you to just cherish\nBut I'm debated, disputed, hated and viewed in America\nAs a motherfuckin' drug addict, like you didn't experiment?\nNah, nah, that's when you start to stare at who's in the mirror\nAnd see yourself as a kid again, and you get embarrassed\nAnd I got nothin' to do but make you look stupid as parents\nYou fuckin' do-gooders, too bad you couldn't do good at marriage\nAnd do you have any clue what I had to do to get here?\nI don't think you do, so stay tuned\nAnd keep your ears glued to the stereo\n'Cause, here we go: He's Royce, he's the King of Detroit\nAnd I'm the sinister, Mr. Kiss-My-Ass is just a—\n\n[Hook: Eminem]\n—renegade!\nNever been afraid to say what's on my mind\nAt any given time of day\n'Cause I'm a renegade!\nNever been afraid to talk about anything\n(Anything?) Anything\n'Cause I'm a renegade!\nNever been afraid to say what's on my mind\nAt any given time of day\n'Cause I'm a renegade!\nNever been afraid to talk about anything\n(Anything?) Anything (Anything)\n\n[Verse 3: Royce]\nI determine what time it's on, I call my nigga Proof\nHand him a pint of Limon and turn him loose\nI'm tired of you new jacks, I'm tired of niggas that's like (I'm 'bout to blow)\nUnless you a bitch, we don't care if you 'bout do that\nMove back, youngster, the Glock gon' speak\nChew up your vest and turn your chest hair to taco meat\nThe street, continuous to pit, quick to smash ya\nOr flash the clip, or give you the picture, develop the\nClick clock, six shots blows through another door\nAnd it gets hot, Hip-hop Quotable tug of war\nWho did you niggas' beats, you bitches, who made it work?\nThat shit was *pfft* — I got harder two-way alerts\nJust when I thought my dog couldn't get any meaner\nYou talk about his daughter, he probably go get you the nina\nYou talk about his momma, he won't even give you the finger\n(He's crazy) Deranged, not media eaters, we renegades\n\n[Verse 4: Eminem]\nSee I'm a poet to some, a regular modern-day Shakespeare\nJesus Christ, the King of these Latter-day Saints here\nTo shatter the picture in which of that as they paint me\nAs a monger of hate and Satan, a scatter-brained atheist\nBut that ain't the case, see it's a matter of taste\nWe as a people decide if Shady's as bad as they say he is\nOr is he the latter, a gateway to escape?\nMedia scapegoat, who they can be mad at today\nSee it's as easy as cake, simple as whistling Dixie\nWhile I'm waving the pistol at sixty Christians against me\nGo to war with the Mormons, take a bath with the Catholics\nIn holy water, no wonder they try to hold me under longer\nI'm a motherfucking spiteful, delightful eyeful\nThe new Ice Cube, motherfuckers hate to like you\nWhat did I do? I'm just a kid from the gutter\nMakin' his butter off these bloodsuckers\n'Cause I'm a motherfuckin'—\n\n[Hook]\n—renegade!\nNever been afraid to say what's on my mind\nAt any given time of day\n'Cause I'm a renegade!\nNever been afraid to talk about anything\n(Anything?) Anything\n'Cause I'm a renegade!\nNever been afraid to say what's on my mind\nAt any given time of day\n'Cause I'm a renegade!\nNever been afraid to talk about anything\n(Anything?) Anything (Anything)\n\nRenegade!\nNever been afraid to say what's on my mind\nAt any given time of day\n'Cause I'm a renegade!\nNever been afraid to talk about anything\n(Anything?) Anything\n'Cause I'm a renegade!\nNever been afraid to say what's on my mind\nAt any given time of day\n'Cause I'm a renegade!\nNever been afraid to talk about anything\n(Anything?) Anything (Anything) Thing", "image": "https://images.genius.com/d86b45b993cdf0c53559e740521a4bba.500x494x1.jpg"}], "artist": "Bad Meets Evil"}