{"songs": [{"title": "Lil’ Homies", "album": "Until the End of Time", "year": "2001-03-27", "lyrics": "[Intro]\nFuckin' lil' homies\nEverybody duckin', my fuckin' lil' homies\nLil' homies\nEverybody duckin', my fuckin' lil' homies\n\n[Verse 1]\nJust pay attention, here's a story 'bout my lil' homies\nStraight thuggin', lil' bad young motherfuckers, gotta love 'em\nYou could catch him in his G ride clutchin' his Glock\nScreamin', Outlaw! (Westside motherfuckers) bustin' on my enemy's block\nEducated on these cold streets\nGettin' money, makin' dummies out the police\nAin't no peace for an adolescent nigga too wild to be a thinker\nBud smokin' 24/7, everyday drinker\nGot my diploma, but I never learned shit in school\nMo' money, mo' bitches, mo' murder, fool!\nAlways the young niggas gettin' in shit\nShe wouldn't stop to conversate, so you called her a bitch\nBustin' on paper thin motherfuckers\nDrinkin' gin before you get to sinnin' on them busters\nEmptied his clip, passed by like he didn't know me\nEverybody duckin', my fuckin' lil' homies\n\n[Chorus]\nLil' homies on the ride\nNiggas gonna die tonight, let's get high tonight\nLil' homies on the mash\nRunnin' from these punk police\n‘Cause lil' niggas run the streets\nLil' homies on the ride\nNiggas gonna die tonight, let's get high tonight\nLil' homies on the mash\nRunnin' from these punk police\n‘Cause lil' niggas run the streets\n\n[Verse 2]\nI remember when you was just a lil' G\nFlirtin' with death, playin' Russian Roulette, screamin', \"Kill me!\"\nHey there, young nigga, what you smokin' on?\nMad at the world ‘cause you came from a broken home?\nLove the squad plus your mob is sick\nA bunch of adolescent niggas spittin' major shit\nTell me, young nigga, if you die, let me know\nWould your heart feel pain, watchin' as your mother cries?\nWill all your homies ride?\nOr will they all get high, and talk about how you died?\nYoung niggas on a mission to compete\nGettin' G's, packin' heat, bringin' havoc to the fuckin' streets\nNobody knows why he took a fo'-fo'\nAnd unloaded on the whole front row\nTry to tell him, but he act like he don't know me\nPull out his pistol and he show me; my lil' homie\n\n[Chorus]\nLil' homies on the ride\nNiggas gonna die tonight, let's get high tonight\nLil' homies on the mash\nRunnin' from these punk police\n‘Cause lil' niggas run the streets\nLil' homies on the ride\nNiggas gonna die tonight, let's get high tonight\nLil' homies on the mash\nRunnin' from these punk police\n‘Cause lil' niggas run the streets\n\n[Verse 3]\n\"First 2 Bomb,\" \"16 On Death Row\"\nBustin' on them phony motherfuckers ‘cause the big homie said so\nNiggas knew I was a nutcase, quick to blast\nLivin' underage, but he'll blaze on your bitch-ass\nIs there a heaven for a G?\nAnd if it is, will I finally get to be at peace?\nOn these streets ain't no peace, shell-shocked souls\nMakin' money off of crack sales\nYoung black male unable to change ‘cause it's a cycle\nPlus nobody knows the evil that they might do\nLil' Moo, Big Yak, K. Kastro\nBig Malc, Hussein, call 'em Outlawz\nTellin' the world to be equipped\nWhen these young motherfuckers rip shit, they don't quit\nDrew down on me, pulled a pound on me\nBust like he didn't know me; my lil' homies\n\n[Chorus]\nLil' homies on the ride\nNiggas gonna die tonight, let's get high tonight\nLil' homies on the mash\nRunnin' from these punk police\n‘Cause lil' niggas run the streets\n\n[Collision]\nWhassup, nigga, let's do this shit! My lil' homies!\nLil' bad-ass motherfuckin' adolescent niggas! My lil' homies!\nWhat the fuck you niggas wanna do?\nWHAT, NIGGA? My fuckin' lil' homies\nSixteen, fifteen, thirteen, my fuckin' lil' homies\nJuvenile delinquents ready to BUST on you motherfuckers\nWhat the fuck you niggas wanna do, nigga?!\nNigga, take yo’ shit on, lil' homies!\nWe robbin' motherfuckers, nigga\nThug Life, Outlawwwwz! West Siiide!\nYou know what time it is, my lil' homies!\nYou know what the fuck you gotta do, nigga\nOutlawz, nigga, my lil' homies", "image": "https://images.genius.com/74b94f4112372859edd6ae711af0df41.1000x1000x1.jpg"}], "artist": "2Pac"}