{"songs": [{"title": "Take Your Tyme", "album": "Spiritual Minded", "year": null, "lyrics": "[KRS-One]\nY'all don't know?  Y'all don't know your body is a temple?\nA temple to the living God?  Don't get gassed y'all\nAll my sisters out there, here's the truth\nYou, a you've got to.. {TAKE.. YOUR.. TIME}\nLook, look!\n\nYou don't want no unsteady relationships, you want it tight\nYou don't want no man beggin and always gonna get, am I right?\nYou don't want no man sleepin cheatin freakin behind his wife\nThere's no such thing as make love, it's really make life\nI don't care what nobody say; you sleep with a man, that's your husband\nSo make sure, before you lay down, you love him\nAnd learn him, yes it's still sacred to be a virgin\nRelax, it's curiosity that always burns 'em in fact\nSex is like candy, be disciplined, no splurgin\nYou don't want your stomach hurtin\nGirl, you gotta.. {TAKE.. YOUR.. TIME}\nListen!\n\nCash is an issue with that he can never diss you\nEven if he makes you cry, you bought your own tissue\nWitcha own case, witcha own hand, wipe ya own face\nAnd throw him out, no doubt, out of your own place\nIf your heart is broken you can mend it\nIf you're independent, your womanhood, that's when you defend it\nJust.. uhh, just {TAKE.. YOUR.. TIME} woo!\nLook!\n\n{TAKE.. YOUR.. TIME}\n\nDon't come witcha hand always out\nIf he buys you somethin thank him, but that's not what a man is about\nReal men are real friends, showin their real commitment\nHe tells you he really loves you, a boy can't really admit it\nIf a man really wants you, that man really flaunts you\nIn public or private a real man really supports you\n'Member what Guru taught you?  Of course you \"Royalty\"\nYou dress how you like when a QUEEN is what you ought to be\nAnd ought to act like, and also ought to manifest\nHow you dress makes you constantly blessed, or constantly stressed\n{TAKE.. YOUR.. TIME} Yo!\n\n{TAKE.. YOUR.. TIME}\n\nYo, yo\nSo while you burnin off those calories, think about reality\nGet a skill for the salary, a man for the family\nNot a boy, that's a catastrophe, don't get mad at me\nInstead of always clubbin visit museums and art galleries\nPick the single man, admirin the ancient sculpture\nHe's cultured, chances are he won't insult ya\nGive him your number only after you know what he does\nAsk him what it is, not what it was\nYou want the good life (GOOD LIFE)\nYou want the good life (GOOD LIFE)\nYou want the, you want the, you want the\nC'mon, you gotta {TAKE.. YOUR.. TIME}", "image": "https://images.genius.com/d84f73e1b21b8b4dbd679efa191364e4.1000x1000x1.jpg"}], "artist": "KRS-One"}