{"songs": [{"title": "U Stank", "album": "Chase the Cat", "year": null, "lyrics": "[George Clinton]\nThe luscious bitch, she is true\nBut it's not nice to fool Mother Nature\nThe proud mother of God, like all hoes\nIs jealous of her own shadow\nWho is this young big tawny bitch who wish to be queen for a day?\nWho would sacrifice the great grandsons and daughters of her jealous mother?\nBy suckin their brain until their ability to think was amuptated?\nBy pimpin their instincts until they were fat, horny and strung out?\nAnd her right to be kept queen of the universe\nWho is this bitch?\n\n[Too $hort]\nYou get, somethin for nothin when you got to get the gas\nSpit the game in her ear tell her, get on the ave\nIt's mind manipulation, in every situation\nThere's a pimp and a ho, somebody roll this Dayton\nDownhill, takin the easy way\nWhile the other brother say it should be this way\nWhich one are you?  Cause I was \"Born to Mack\"\nSince the day of my birth, I was sworn to that\nIt's the P-I, M-P, that's in me\nYou envy, how instantly I make ten G's\nAnd never lift a finger, makes you wanna bring a\nPlayer to the show and get your clown Jerry Springer\nBlame the consumer's how I look at life\nIt's just another day in a hooker's life\nWith no tricks there's no pimpin\nIt's like drugs with no fiends, sex with no women\n\n[George Clinton] + (Too $hort)\nDown with the P-Funk, F-U-N-Kaich\nDown with the P-Funk, P-U\nDown with the P-Funk, F-U-N-K (beotch)\nWhyyyyyyyyyyyyy not?\nLet's funk until they smell it\n(Jump yo' ass in the tub, you stank)\nLet's funk until they smell it\n\n[Too $hort]\nI came through, the party was packed\nI saw three top notches, the rest was rats\nI could smell it, when I first touched down\nI saw yo' bitch, she wanna fuck right now\nQuit actin scared, cause I just might get her\nSpend the night wit her, won't spend my life wit her\nMy specialty, is runnin game\nBut this ain't hide and go get it, I ain't playin\nI'm on a constant pursuit of panties\nShe said she had a man, I said bitch can he\nStick dick to ya, give ya long slow strokes\nOr beat your pussy up 'til it smokes?\nYoung girl lookin brand new, told me what her man do\nFake-ass nigga, she can't stand you\nI took advantage of her, nigga fuck you\nI know bitches, I know just what to do\nI like fat girls, I had plenty\nBlack and white, tall or skinny\nIf you asked me, I won't change my mind\nI cain't marry you, I told you that the last time\n\n[George Clinton] + (Too $hort) + {DC}\nLet's funk 'em, let's funk 'em\n'til they smell it {hah ha ha!}\nHooha hoo ha, ho hoo hoo\n{let's funk 'em 'til they smell it!}\n(Bitch!) {let's funk 'em 'til they smell it!}\n(Jump yo' ass in the tub, you stank)\n{let's funk 'em 'til they smell it!}\n(Jump yo' ass in the tub, you stank)\nMiss me with that shit\n(Jump yo' ass in the tub, you stank)\nMiss me with that shit..\n.. bitch!\n\nNow, it happened\nA case of the miss me with that shits\nMiss me with that shit - somethin stink!\n\n[Baby DC]\nWell I might be young but I bathe in Cristal\nBitches they know the name, sling dick like pis-tal\nCuff your bitch now 'fore we put her on tape\nWith some, dick on her face screamin gimme a taste\nFuck the rest of these niggas and bitches that's like niggas\n(Man just get my motherfuckin Rolex) Man fuck that nigga\nI'ma pawn that nigga, I'm beyond that nigga\nIf you ain't packin a pistol then run my nigga\nCause we been to known to rip shit up, so keep yo' chains up\n'fore you lames get plucked, you shut the fuck up\nShut the fuck up, 'fore I bust, two at your truck\nDraped in all black, two in the Coupe, you better duck\n(Who's that lookin through my window?) Blaow!  Nobody now!\nYou motherfuckers better lay it down\nB-A-B-Y capital D-C\nVirtual pimpin, we mackin in 3-D\nMiss me with that shit\nYeah that ain't no jive\n\n[George Clinton] + (Too $hort)\nDown with the P-Funk, F-U-N-K\n(Jump yo' ass in the tub, you stank)\nWhyyyyyyyyyyyyy not? (beotch)\nDown with the P-Funk, F-U-N-K (you stank)\nDown with the P-Funk, F-U (beotch)\nDown with the P-Funk, F-U-N-K (you stank)\nWhyyyyyyyyyyyyy not?\nP-Funk, F-U-N\n(Jump yo' ass in the tub, you stank)\nDown with the P-Funk, P-U (you stank bitch)\n(Jump yo' ass in the tub, you stank)\n(I smell ya, you stank)\n(Oh it's so funky, cause you stank, beotch)\n(Jump yo' ass in the tub, you stank)\n\n[George Clinton]\nNow you got me talkin niggarish\nSo just color me like a nigga\nPeanut bitin on my tongue while I'm spillin nigga gibberish\nNigga got a habit of babblin broken english\nSo make an american apple so a nigga won't be distinguished\nPerceivin me to be somewhat a common nigga?\nFuck an AK-47, a millimeter\nDon't need a fresh hooker on my jock shootin drag\nGettin paid ho\nGo rush some cash\nYou went to school to still run in the street\nBack in the day, you know a raw nigga like me don't play\nI'm a blue B-L-A-C-K black-ass nigga\nSuck my dick and make it bigger\nAs I walk into the party I grab my goatin ass\nYou see him and you love him, here you go ho hug him\nWalkin around here with your lips curled, makin me sick\nActin like you got class, this here Sheba Makeba\nI said naw, disagree\nShe was a beat the bitch, bitch I bet I'll beat yo' ass\nIn a minute I'm a cuss\nI'm a nigga I don't give a motherfuck\nJam is biggerer, thickerer\nYou a nigga, but I am nigga-er\nThis is to be.. (spit it baby!)\n[Hey did you get that shit on tape?] (It's on tape!)\n[Oh my God that nigga is cold dawg!]\nYou see my pockets stay full, yours stay empty\nYou say I look Kunta Kinte\nBlue black ain't shit jack, I'm blacker than that\nJet black, yeah I do smoke crack\nYou and your bitch will get checked\nI have no respect for a skeezer\nI'll slap her in her muh'fuckin face\nAnd it won't disgrace, this nigga\n[Oh yes!] (there it go) [Oh my God!]\n[Nigga you got some shit done]", "image": "https://images.genius.com/5879836b504c477d7cddacb459c66e7c.776x768x1.jpg"}], "artist": "Too $hort"}