{"songs": [{"title": "5 Boroughs", "album": "The Corruptor: The Soundtrack", "year": null, "lyrics": "[Verse 1: KRS One]\nWe hit 'em and get 'em\nWe stick 'em and jig 'em, we pick 'em and kick 'em\nFlippin' them whip and\nI'm wing clippin' them lip cause I'm cold sick of them\nMuch quicker than them lyrically trickin and\nMy tribe be on a quest like Tip and them\nOn every avenue puttin the full clip in 'em\nSplittin' and strippin' 'em down while spittin' a round\nInto them soundclash see winnin' them, just begginin' them\nGet rid of every bit of them with them negative idioms\nI don't even consider them in the new millenium we killin them\nBreeze Deep, Kenny and Will and them, KRS-One we thrillin' 'em\nMany battles we been in them now we rebuildin them\nWe blaze, fulfillin them, Keith the Clink, Jesse, Jamil and them\nWe originate styles, others be stealin'them\n\n[Verse 2: Vigilante]\nYou got a good rise in your rolodex, who flow is next?\nComin out to fuck with the best, put it in your chest\nInhale it and hold that, blow it out when I say let go\nLet's see if you can hold your breath by the time I flip to the next flow\nThis show is real, this is the deal, guns I'm running\nGotta make it out of town to flip my shit and keep it coming\nThen bring it back with another stack of raps\nTo blow your back out\nHow many of y'all wanna go for yours?\nI keep my dogs in the crackhouse\n\n[Verse 3: Buckshot]\nLet's take a walk through Crown Heights\nSteppin through the city at night with a bunch of niggas and two mics\nForm a little lynch mob, and stomp through the five boroughs\nHead back to Brooklyn in the Expo\nBack on the block, I see the cops everybody clockin\nBuckshot, when you see the rocks, me I got you shocked\nWhy not? You see the recipe\nBuckshot, I represent Brooklyn and my nigga Biggie\n\n[Verse 4: Keith Murray]\nI'm from C-I, L-I, F-L-Y\nWhere the niggas and the bitches stay paid, fly and high\nWhere a slut'll get mad if you call her a bitch\nAnd a rat'll get mad if you call her a snitch\nWhere the rich emerge, with the niggas from the ditch\nAnd it's a myth, they get niggas from the suburbs, that's herbs\nYo, this is for my niggas on the block all day\nWho don't give a fuck waiting for crime to pay\nPut your money on it, yo, we never fronted\nLong Island got some of the best niggas that ever done it\nFrom Riverhead to C.I. to Brentwood to Wyndanch\nNiggas coming through will not stand a chance\nFrom Roosevelt to Freeport to Hempstead to Uniondale\nComing deep from the depths of hell\nI'm dead serious, even though you see me smilin'\nRough enough to break New York from Long Island\n\n[Verse 5: Cam'ron]\nWe destroy niggas, need advice cause I heard em sayin Jesus Christ\nYou should see the sight, cookin ox-tail, peas and rice\nMaking about a G a night, they can't read or write\nBut I got every creed and type\nYou need a dyke, baby girl, I see the light\nBut sometimes y'all get crimey crimey, grimy grimy\nBut those with a tiny hiney they get whiny whiny\nSo guard your girl, Harlem World, cock the gun, pop it son\nFila fam, illa players, Killa Cam is still the man\n\n[Verse 6: Bounty Killer]\n?????????????????????\n\n[Verse 7: Killah Priest]\nYo, hit you with the force of an iron horse\nTear your face off the planet, leaving one-third damaged\nWith your back cracked the Earth canvas, leavin mountains slanted\nRock the Earth off the axle, crabs who\nPolar bears beneath the sea gravel\nThoughts be runnin wild like the Lil' Rascals\nPuttin' dinosaurs inside of figure fours, rip you with nine inch claws\nChasing motherfuckers through malls and clash in halls\nBeating motherfuckers through walls, stompin through floors\nAnd jumpin' down elevator shafts\nSearchin' for they ass, stayin' low in the grass\nWearing a gas mask, wrapping their hands up in plastic bags\nOn stage like a savage goin' mad\nWhat? Yeah yeah, suuuuu!\n\n[Verse 8: Prodigy]\nYeah, by all means you know you gotta put Queens on it\nPut cream on it, Q.B. we rep often\nTake over your party, slam dance with your hood\nTook your ladies back to the projects with us\nThen sent her ass back on the Q-train home\nSatisfied, she learned the words to my thug song\nSee we one big borough of Dons with firearms\nAnd we never use those, til the man act\nOther than he's 'sposed to, nigga what I'm 'sposed to do?\nShots whistle, damn near missed that, shoes get pissed at\n\n[Verse 9: Redman]\nFrom the, tip of my Timbs, to my eyebrows\nThe hostile, eEnglish, Olde E widemouth\nGet PCP fiends, jumpin off cliffs\nAnd if you had the balls, you'd be walkin off stiff\nMy paragraph alone is worth five mics (uh-huh)\nA twelve song LP, that's thirty-six mics (uh-huh)\nAnd while you win Un Hype (uh-huh) I spit on your snipe\nAnd tell you fuck you and that bitch on your bike\nBrick City\n\n[Verse 10: Reverand Run]\nAyo, now bust it, never try me crimey, I'm grimy, so don't deny me\nI be little like your Rascals and stymie to fly that hiney\nBuy me keys, to my Benz and my Coupe\nLike Jay and Run and D.M.C.'s, that's the name of my group\n(Now speed it up) Beat to the rhythm of the rhyme\nI'm givin up a dime, there go another line you figured\nNever drivin by nine, never givin up a dime if you was\nNever been that nigga\nIf you really wanna test me, brother don't stress me\nOr you just be bowlin\nIt's Reverand like a Jesse, brother that's just me\nAnd that's just my colon\n\n[Outro: All]\nThe five boroughs of death, we rep to death\nStep aside little niggas, show time, yep\nIt's goin down the moment we inside the spot\nLet's rock'n'roll, you know the M.O., it gets real\nWhen the five boroughs of death, we rep to death\nStep aside little niggas, show time, yep\nIt's goin down the moment we inside the spot\nLet's rock'n'roll, you know the M.O., it gets hot", "image": "https://images.genius.com/8e70b1ea59dabd22da163c46126eaf7b.610x605x1.jpg"}], "artist": "KRS-One"}