{"songs": [{"title": "Paranoid Remix", "album": null, "year": null, "lyrics": "[Kanye West]\nWhy are you so Paranoid?\nDon't be so Paranoid\n\n[Big Sean; Verse 1]\nAye, Aye\nNow baby I can tell you want more cause you put less out\nAnd every time you stepped in I could tell you stepped out\nYour girlfriend said I remind her of the rest, yea\nBut tell yo girlfriend that she remind me of the Press\nJust talkin' and talkin'\nSo maybe we can sneak to the back then\nI know you heard about the freaks that was back then\nSo last week, we so right now\nThey so hyped up man tell 'em pipe down\nAnd you can tell from the watch and chain\nThey been in and out my jeans like pocket change\nJust be real, man I wouldn't be real\nIf I ain't have my fair share like the stock exchange\nAnd if today tend from your past relations\nWalk around witcho girl sayin that you hate men (What?)\nAye yo you either let go or you go lesbo turn around and date them\nSo maybe we should head to the exit\nJust is from your friends not to mess with (Who me?)\nCause they caught a case with they ex-es\nThey mad you'd a leave while a nigga ex-stressed\nBut we know what it is right?\nSo we gone let 'em live right?\nYou know why they call me Big right?\nTell 'em look left while we get right\n(right, right, right)\n\n[Kid CuDi: Hook]\nAnyway, they don't know you like I do\nThey'll never know you anyway\nThey don't know you like I do\nThey'll never know you\n\n[Kanye West: Verse 2]\nAll of the time\nYou wanna complain about the nights that are long\nSo now you here with me stressing about it too\nLeave that attitude way back at home\nYea you see 'em look dirty\nLet 'em give you cold looks cause we look cold\nYea you heard about all the word of mouth\nDon't worry about what we can't control\nAll the talk and the world lost in the world\nCan you finally let that thing go\nYou wanna check into the heartbreak hotel but sorry we're closed\nBaby, Don't worry about it\nBaby, we'll go out to the floor\n\n[Hook]\n\n[Bridge: Kanye West]\nBaby don't worry about it\nLady don't even think about it\nYou worry bout the wrong things, the wrong thing\nYou worry bout the wrong thing, the wrong thing\nYou worry bout the wrong thing, the wrong thing\nYou worry bout the wrong thing\n\n[Hook]", "image": "https://images.genius.com/1db10915bf07ae763610bb53d1717887.1000x1000x1.jpg"}], "artist": "Big Sean"}