{"songs": [{"title": "2 Times", "album": null, "year": null, "lyrics": "[Intro]\nOk it Wiz Khalifa\nIts Gucci ah, Drumma\nMary Jane, hit a fews times\nCause I'm 2 times it's Gucci 2 times\n\n[Verse 1 - Gucci Mane]\nI'm \"Mister Make Her Stare\"\nThink we make a tear\nLast night was a blur, least I wore fur\nI pulled up in the rear, engine in the rear\nEnd of the night was pulling on her hair I really\nDon't care the games unfair Gucci Mane La Flare\nWho gives a care about niggas over there?\nShawty got a pear: apple with a gap\nI think we make a pair, she like em from the trap\nI got her in the chair she think she in the lear\nThe way I'm switchin' gears, got her takin' off her heels\nI'm Mr. Get Her There, take your underwear, you fuckin\nWith a boss no need for fuckin with a square\n\n[Hook]\nI light the weed up, and hit it two times\nSmoke is so good I hit it few times\nIf I hit her once I hit her two times\nIf I did it once I can do two times\n\n[Verse 2 - Wiz khalifa]\nOh I got a joint burnin here real slow\nWanna slide to my crib lets go I\nShow u my double balcony put ur head in my\nLap rite before u start to make out wit me\nCrib in L.A I flew her to the south with me\nYou niggas wanna be players? Well I can show you how to be\nI got my salary up now all them bitches say hi to me\nI'm smoking loud and these niggas just trying to be as high as me\nAnother causality I kill every beat, I'm smokin on celery\nOnly fuck with papers a gang of Taylors on every feet\nI don't fuck with them haters cause niggas hate but we never speak\nYo bitch want me to save her u betta tame her of get a leash\nMutha-fucker\n\n[Hook]\nI light the weed up and hit it two times\nSmoke is so good I hit it a few times\nIf I hit her once I hit her two times\nIf I did it once I can do two times\n\nOutro (u all ready kno wat it is wen I hook u wit da homie t-pain\n\nOh dis wuz dunn by a gurl luv ya", "image": "https://images.genius.com/6f0a4980c8ef838036229e1d4dcd036c.408x408x1.jpg"}], "artist": "Gucci Mane"}