{"songs": [{"title": "Life in California", "album": "I Am the West", "year": "2010-09-28", "lyrics": "{*ten seconds of instrumental to open*}\n\n[Intro] + (Ice Cube)\nNigga just another day, and I like the way\nL.A. to the Bay, livin life in California\nDough... we get that dough\nOhhhh... we gotta get mo'\nNigga just another day (just another day)\nAK gunplay (AK gunplay)\nL.A. to the Bay (L.A. to the Bay)\nLivin life in Killafornia\n\n[Ice Cube]\nIf Jay-Z can rap about, the NYC\nWhy can't I talk about the shit I see?\nWithout Alicia Keys, without going R&B\nThis ain't Motown, this is R-A-P, nigga\n\n(It's a beautiful day in the neighborhood) Yeah\n(Niggas cain't stand if his name ain't good)\n(All the way from the Bay to L.A., Inglewood) What?\n(This is how it is when you're livin in California)\n\nCalifornia swagger, fuck record sales\nIndustry outlaw like Josie Wales\nCalifornia, off the corner, I'mma warn ya\nI'm the only West coast King, Idi Amin\nGet you in the ring I'm shady as Don King\nI'm takin all the money, befo' the bell ring (ding)\nBefore I grab the mic, the fat bitch sing (sing)\nIt's already over, supernova\nI'm Kobe, you the nigga, I'm hoopin over\nKnow me, big homey, the one and only\nIce Cube don't get airplay\nCause I'm from L.A. and rep where I stay\n\n(It's a beautiful day in the neighborhood) Beautiful\n(Niggas get sprayed, AK'd in this hood) Niggas know\n(Bitches don't play certain niggas so good)\n(It's real in the field when you fuckin with California)\n\n[Jayo Felony]\nSee it's just another day in my neighborhood\nFirst thing off in the mornin and I'm lookin for that good (yeah)\nStickin to my fingertips, sittin on the hill\nAnd I'm overlookin the city, man this shit is for real\nPlenty 'gnac in my cup and the 'llac all fizzy bruh\nIt'll be a long night, that's what we got these bitches for (Jayo)\nYuh, bounce like it's a earthquake, Nitty shake\nLet's see how much noise it make the city make\nYou see it's just another day in my neighborhood\nAnd the police ain't fuckin with me, knock on wood\nFor my shoes, cause she just blew my socks so good\nDouble shot, never knew I'd shoot my Glock so good (pow!)\nI rock like coke when they hit\nAnd they just cain't do it but they all wanna spit\nPut my Padre head on, but see I tried to warn him\nFuck around boy you know it goes down (in California)\n\n[Interlude]\nDough... we get that dough (we get it, get it)\nOhhhh... we gotta get mo'\nLivin just another day (just another day)\nAK gunplay (AK gunplay)\nL.A. to the Bay (L.A. to the Bay)\nLivin life in Killafornia\n\n{*car bounces on hydraulics for about 12 seconds*}\n\n[W.C.]\nBa-block, ba-block, deep in the slums\nHere they come come with the new Chucks on\nClick-click, ba-block, ba-block, green in my lungs\nStraight from Killa Cali got the one one one\nWith a tall stack in all black\nWith that Louis trimmin on our golf cap\nKnown to make 'em all fall back\nIt's that - Mr. Fuck Everybody I Can't Stand\nAnd bust random\nC-Walkin on another anthem\nTryin to teach these new rappers some manners\nChasin niggas out of the mic booth with a camera\nBack at it, loc, it's Da Lench Mob animal, deader than a cannibal\nThan a can of blow, bust ya head open like cantaloupe\nYou niggas is pussy pretend to be, we run the vicinity\nWalk in the +Circle+ and lose your virginity\nPut these khakis on and get out them speedos\nAnd bow down, cause without us, there wouldn't be no\n(California)\n\n[Outro]\nWe get that dough\nOhhhh... we gotta get mo'\nLivin just another day, AK gunplay\nL.A. to the Bay, Livin life in Killafornia\nYo, we get that dough\nOhhhh... we gotta get mo'", "image": "https://images.genius.com/f1c6e4522c58b032c43433a2345b1bb1.1000x1000x1.jpg"}], "artist": "Ice Cube"}