{"songs": [{"title": "Hittas", "album": "Tha Carter V", "year": "2018-09-28", "lyrics": "[Sample: Lil Wayne & David Letterman]\nIs it true you performed with Willie Nelson at the Country Music Awards?\nI don't know, but I know I did perform at this bad ass bitch birthday party recently. She was crazy, stupid thick\n\n[Intro: Lil Wayne]\nMack in here\nPooh in here\nScoob in here with me\n\n[Verse 1: Lil Wayne]\nTell them hoes get they mind right, tell them niggas back up\nMan, I heard the truth is hard to swallow, do you have cups?\nUsed the rope to hang myself to tie a money bag up\nTell ’em get they iron right before Iron-Man come\nTell 'em bring my car around, tell 'em bitches lap up\nI’ma cut this music down, tell 'em put they APs up\nTell 'em throw they pride out, roll the windows back up\nMoney in the air, who said white men can't jump?\nCatch that nigga late night on the phone at a gas pump\nLet me get the phone and the car once it's gassed up\nAK-47 make a sittin' duck stand up\nI could let it blast, but I much rather have one\nTell 'em bring my car around, tell 'em bitches lap up\nThen them hoes get passed down, then them hoes get passed up\nSittin’ on this money to me feel like a cactus\nI’m stickin' to this shit, you would’ve been have hopped yo' ass up\n\n[Chorus: Lil Wayne]\nTell 'em, I got hittas woadie (Hittas woadie)\nI got, yeah I got plenty woadie\nI got hittas woadie (Hittas woadie)\nI got, yeah I got plenty woadie (Plenty woadie)\n\n[Verse 2: Lil Wayne & Katie Couric]\nI got hittas woadie, yeah I got plenty woadie\nAnd they just wait for the word, this shit like Wheel of Fortune\nGoddamn, these snitches nosy, goddamn, these snitches nosy\nNigga, I'm a ass with that semi; call me semicolon\nYeah I got hittas woadie, yeah I got plenty woadie\nThey kick the door and kill yo’ ass and leave the children snorin'\nI'm sippin' lean out a glass, make me feel important\nI made some green in the past and now it's good as golden\nYeah, clearly, Lil Wayne answers to no one\n\n[Chorus: Lil Wayne]\nI got hittas woadie\nI got, yeah I got plenty woadie (Plenty woadie)\nI got hittas woadie (Hittas woadie)\nI got, yeah I got plenty woadie\n\n[Verse 3: Lil Wayne & Drake]\nI'm so lifted, I'm so lifted\nI wrote my will in hieroglyphics (In hieroglyphics)\nWeezy, where you been? The people miss you\nCrickets\nI got hittas and they not kidders, that's my niggas\nYou got niggas but they not hittas, they got jitters\nThey get hit up, I'm placin' figures on your niggas\nTakin' bidders, yo' bae, yo' niggas, don't make a difference\nI got shooters, on pharmaceuticals​, they armed and brutal\nArmed intruders, 'cause we don't doodle, we draw conclusions\nI got sprayers, all type of sprayers, we gon' need Google\nI got paper, on top of paper, we gon' need rulers\nI'm effective, been doin' numbers since Roman numerals\nStrong as sumo, we armed as usual, my hittas hungry\nCharleston Chew you, bazookas chew you, just like Bazookas\nDon't confuse 'em, we only hittas, y'all only humans\nDon't get hit up, woadie (Hit up, woadie, hit up, woadie)\n'Cause I got hittas woadie\n\n[Outro: Jacida Carter]\nHe's a very smart child. And I just said he was a genius, you know what I'm sayin'? Which I used to pray, and ask the Lord to send me one. You know, he did. He's so smart, I can't teach him nothin'. He's done been here before", "image": "https://images.genius.com/9e2d71d269b2971975d5d9ca36deb943.1000x1000x1.jpg"}], "artist": "Lil Wayne"}