{"songs": [{"title": "SUPER PREDATOR", "album": "ALL-AMERIKKKAN BADA$$", "year": "2017-04-07", "lyrics": "[Intro: Joey Bada$$]\nYeah, just ride with a nigga\nAmerica's number one, you can bet on ya life!\nStatik Selektah\nRide with a nigga like\nAmerica’s number one, you can bet on ya life!\n\n[Verse 1: Joey Bada$$]\nCall me the general, pushing that new agenda through\nFor my millennials, troubled youth and the felons too\nTryna be perennial, but chance of livin' is minimal\nShe critical, exactly what made my niggas criminals\nTypical AmeriKKKa, damn sure ain't no miracle\nWord to Steezy, I’ma keep this shit lyrical\n'Til I fall out my physical, all my verses is biblical, uh\nFlowin' religiously, my delivery spiritual, uh\nFeelin' invincible, this here is nothin' new\nThis is just principle, take notes, if I were you\nThey say I'm a clumsy king, how I be droppin' jewels\nBut see, the funny thing is I got lots to lose\nNever no fucks to give, only one life to live\nSo I exchange my negative for a positive and it's all\nGood Lord, the pen is way mighty than the sword\nWho want war? I told you before\n\n[Pre-Chorus: Joey Bada$$]\nHow I kicked in the door\nWith the rugged raw, back just to reinstall\nWhat you niggas thought it was?\nYes, I’m a veteran, you just a comer up\nI can teach you a lesson\nHow to get your hunger up\nHomie ya\nHow I kicked in the door\nWith the rugged raw back just to reinstall\nWhat you niggas thought it was?\nYes, I’m a veteran, you just a come up\nAbout to teach you a lesson\nHow to get your fuckin' hunger up, nigga\n\n[Chorus: Joey Bada$$]\nBadmon, we ah run tings, yeah\nNever let the tings run we, uh\nAll di gyal dem a come pree\nBut mi tell them that the buddy never come free\nBadmon, we ah run tings, yeah\nNever let the tings run we, uh\nAll di gyal dem a come pree\nBut mi tell them that the buddy never come free\n\n[Verse 2: Styles P]\nSuper predator, filthy AmeriKKKa\nBurn the newspapers and the editors\nMy dead presidents ain’t dead enough\nBlew a zip to the head, still ain't red enough\nPray to Jesus, hope he got you\nNo I'm not a chicken, I never listen to FOX News\nNiggas built the country but never givin' they props due\nPayin’ for my people, I'm still payin' for my pops dues\nI'm royalty, my momma said it\nI'm gold hearted, I'm scum headed\nLost soul in a promised land of promises\nGotta mask on, but no, I'm not anonymous\nBuilt on my lonely, no accomplices\nLight a L up for my accomplishments\nI'm a real nigga, it's not a lot of 'em\nIf they were, then the cops probably shot at 'em\n\n[Chorus: Joey Bada$$]\nBadmon, we ah run tings, yeah\nNever let the tings run we, uh\nAll di gyal dem a come pree\nBut mi tell them that the buddy never come free\nBadmon, we ah run tings, yeah\nNever let the tings run we, uh\nAll di gyal dem a come pree\nBut mi tell them that the buddy never come free\n\n[Verse 3: Joey Bada$$]\nYeah, I stomp the grounds in my Timberlands\nAin't nothin' colder than New York when that December in\nThe coldest shoulders, from average Joes and the simple mans\nI pack the heat 'cause I'm known around to be simmerin'\nThat mean I'm finna hit the boilin' point like real soon\nMan, I've been heatin' up, my self esteem been on the moon\nThe flow is hotter than volcanic craters near the equator\nAny debaters is simply haters, they know that I'm greater\nI be countin' my paper, forever fuck all the majors\nDid it all on my own, don't owe nobody no favors\nIt's clear, I'm heir to the throne, I've been the best in my zone\nInternationally known, forever Brooklyn's own\nI mean, come on, but here's for the Presidents, the Congressmen, the Senators\nWho got us all slavin' while they reapin' all the benefits\nGot the world thinkin' that it's true 'bout what they said of us\nAmeriKKKa's worst nightmare, the super predator", "image": "https://images.genius.com/84b143545e0338f7b7459bb9ab8ecca4.630x630x1.jpg"}], "artist": "Joey Bada$$"}