{"songs": [{"title": "Build Ya Skillz", "album": "KRS-One", "year": "1995-11-07", "lyrics": "[Verse 1: KRS-ONE]\nCheck, I control your mind with one rhyme I speak\nAnd get you open like a prostitute's butt cheeks (yeah)\nRappers get kicked in they mouth with cleats\nCause they're speech refuses to reach beyond the beach\nHave a seat quick (uh) I speak or spit flicks on your cheap hits\nTime to complete shit, no weak shit, I mean freak shit properly\nI can feel myself becoming a lyric monopoly\nOthers will copy me but repeat my shit sloppily\nShocking me with inclinations of rocking me\nInsanity it got to be\nMy true identity is never meant to see\nI simply use the gifts sent to me mentally\n\n[Basta Rhymes]\nYo! Word up! Get from out my face, before you get bust quickly!\n\n[Verse 2: KRS-One]\nThat's the hip hop, the hibby\nI rip it in a minute cause I'm gifted like December 25th\nNow let me flip I'm all knowing, lyrically syllable growing\nEven when it's snowing, I'm party going\nFree flowing and stomping! Never tip-toeing\nOverthrowing the comp Big up Bronx!\nI got more styles than the planet got women\nI got as many rhymes as is many styles of women (tell 'em)\nDon't make me come out on that ass start flippin'\nYour mental I'm afflictin', actin' ill and sickin'\nPickin' the victim at random, slammin' 'em\nDraggin' them to the stage and dismantlin' them\nAs my Hydrogen turns to Helium, I shine\nNone of your lyrics I'm feelin' 'em, you rhyme\nLike you should be wearin' an apron scrapin' a pot with a name like Mariam\n\n[Hook: KRS-ONE]\nBut rappers talk too much shit\nAnd can't back it up with lyrics\nBuild ya skillz\n\n[Verse 3: KRS-ONE]\nIt's time for the raw shit, not that on tour shit\nThat outlaw shit, that real hardcore shit\nKRS runs shit like diarrhea\nBitin' motherfuckers hear my name and get up outta here\nI don't care this year, a lot of albums is whack this year\n\"Will KRS bring it?\" Ahh yeah!\nThanks for the invite, it's just about to get hype\nThat straight up raw street type shit is what it feels like\nI will be displayin' lyrical styles I'm saying\nLyrical styles from the miracle child\nWant a pile of ill styles wildin' on your stereo dial?\nSmile, I been here for a while\nPeep my style while I go on with the song\nI rock the microphone then take it to the streets with the Krylon\nClicka clacka! clicka clacka\nTake a spray can and slap a wack rapper!\nStacks of money for videos I don't have it\nYou're lookin' at the last MC with true talent\nGet your tape recorder fast kid\nBoombastic another classic\nTurn up the cassette!\nAll my styles are lyrically fantastic and movin'\nWhile soothin' any urges for booing\nUngluing your mouth from my private\nThe more the merrier syllable superior\nEast coast- West Coast battles are inferior\nCause I by myself will take out the whole North America\nWe need to expand rap beyond this land\nSet up competitions with England and Japan\nWorld cups for rappers that really fuck shit up for fun\nYeah I know I'll get one\n\n[Hook]", "image": "https://images.genius.com/78316fa7efcf948425107910e5b3a92b.300x300x1.jpg"}], "artist": "KRS-One"}