{"songs": [{"title": "Don’t Front", "album": "The Marshall Mathers LP2", "year": "2013-11-05", "lyrics": "[Verse 1]\nUsed to get bent, now I represent to the fullest\nPencil is full of insolent bullets\nI'm like a Doberman Pinscher, Pitbull and a Rott'\nMixed with a toxic, the plot begins to thicken\nI begin to spittin' like vintage Pac\nDemented, demonic, sinister\nEver since the Doc' replenished me\nThe day he gave me that shot when I was just about to quit\nSo to not see him with me would be a shockin' image\nAnd I'm the definition of what a concrete chin is\n‘Cause no matter how many times you sock me in it\nAnd knock me to the canvas, even the boxin' critics\nKnow that if I get off to a rocky start, I'll always have a Rocky finish\nEat me brocoli, spinach, cocky? Nope\nBut I hope I offended you when I told ya how dope I am at\nThis and put emphasis on the \"dope\"\nSo when names come up, in that conversation of who's the dopest, better throw mine in it\nAnd don't mind me, while I remind you of the flow\nYou won't find anywhere\nWhen it fires and I unload, my pen explodes\n'Til there's no rhymes in it, reload in no time\nLet insults fly every 60 seconds that go by, so you know I meant it\nIn school I was so shy, timid\nTwo pairs of jeans I'd alternate, bummy clothes, I 'member\nBeggin' my mom for K-Mart MacGregors\n‘Cause they were new, St. Vincent de Paul\nThose Pony's were used, and no size fitted\nBut kissed them old days, adiós, I did it\nThey said I was a gimmick\nNow I'm the one that those guys mimic\nNow you fuckers don't wanna go startin' no argument\n‘Cause you know I'll win it\nName a flow that's more authentic, and don't front\n\n[Hook: Buckshot]\nDon't front, you know I got you open, kid\nDon't front, you know I got you open, kid\nDon't front, you know I got you open, kid\nDon't front, you know I got you open, word\nDon't front, you know I got you open, kid\nDon't front, you know I got you open, kid\nDon't front, you know I got you open, kid\nYo, why you frontin'?\nYou know I got you open, kid\n\n[Verse 2]\nRest in peace to Big Proof\nYou was a beast, you lyrically mirrored me\nMolded my flow off of you, your spirit's flowin' through me\nI love you, Doody, without you I feel so incomplete\nI'm no king, no need for rose petals to be thrown at my feet\nI'm a thorn in your side, get thrown into a throne\nBetter watch the fuckin' tone that you speak\nFeel like I'm in the zone, I'm in a whole different league\nOn my motherfuckin' own, it's just me\nNo opponents can compete\nAnd I've never been known to retreat\nFrom beef, be beat, follow trends or wallow in defeat\nI'm still hungry as fuck, but can't even say \"Bon appétit!\"\n‘Cause I don't know what to eat\nFuckin' microphone or the beat\nBitch, nobody's mind works like mine\nIt's nose to the grindstone time, holmes, your mind's blown\n‘Cause I rhyme like I'm still tryna get signed\nUp in the Ebony Show-case\nWith Denaun screamin' \"Who the fuck passed you the mic?\"\nNever asked you like my shit from the get\nI'd rather ask you to wipe my ass, bitch\nYou had you a nice run, now take a hike\nI ever meet my match, I'ma strike that bitch first\n‘Cause on the mic I gotta represent the real rappers\nThe real rappers get their mothafuckin' skills crackin'\nWord to Buckshot and Dru-Ha, why the fuck not?\nYou don't like it? Suck a cock! Almost forgot\nBefore I signed with the Doc, I almost signed with Duck Down!\n‘Cause Rawkus didn't make no offers, so mothafuck Loud\nThey jerked me around, so what's up now?\nWow, how much of an asshole would I sound like\nRubbin' it in and holdin' some grudge now? But don't front\n\n[Hook: Buckshot]\nDon't front, you know I got you open, kid\nDon't front, you know I got you open, kid\nDon't front, you know I got you open, kid\nDon't front, you know I got you open, word\nDon't front, you know I got you open, kid\nDon't front, you know I got you open, kid\nDon't front, you know I got you open, kid\nYo, why you frontin'?\nYou know I got you open, kid\n\n[Verse 3]\nLate at night, used to catch a buzz, couldn't write\nNow I write the type of shit to make you wipe\nBut wear diapers, ‘cause you might leave a streak\nI'm on a streak, windshield wipers couldn't wipe\nIt's hard to decipher what cypher I might jump in tonight\n‘Cause I'm hyper or somethin'\nNeedin' someone or somethin' is lightin'\nThis fire under me, it's breathin' new life\nIt's like I already died once\nI guess some people only live twice, and it's funny\nMy days of being broke were so long ago\nI lost all concept of money\nBut you dimes won't get a fuckin' nickle from me\nOh shit, I'm down on one knee\nI'm havin' a stroke of genius—Elizabeth, I'm comin' to you, honey\nFrom boy to man\nAnd still make a whore moan, like a thyroid gland\nI'm in another category, man\nDon't group me up with them pop stars\nI never needed a pat on the back to get at a boy, band\nNo offense? Yes offense\nPrecedents has been set that'll never get met\nMiddle finger pressed against Moby's nose\nShouts to Obie, the curtains closed on my show\nBut never forget that I'm the one you thought wouldn't make it\nYou can't take it, oh\nGot a whole generation of rappers comin' up\nThat are nutty with the flow, but convince me you've heard\nAn MC since me who's as good with the fuckin' mincing of words\nWithout mincing words that'll make you feel like I'm pinching a nerve\nWho's mentally disturbed\nYou might as well stick a knife in me and turn\nIt'll be like my skin bein' Indian burned\nHah, bitch, there isn't one, when will you learn?\nNever been served, if memory serves\nI'd battle that 'til my own recollection remembers these words\n\n[Outro: Buckshot]\nYou know I got you open kid, stop frontin'\nYou know I got you open, Word Life...", "image": "https://images.genius.com/2c354260f9edc6b2e9bf6b06c935a0b8.1000x1000x1.png"}], "artist": "Eminem"}