{"songs": [{"title": "All Bout U [OG]", "album": null, "year": "1996-02-13", "lyrics": "[Intro: 2Pac & (Dru Down)]\nAh, yeah! Hahaha (Yeah!)\nIt's all about you, one time!\n(I'ma say it's all about you, baby, yeah!)\nHaha, for the bitches that think it's all about you\nIt's all about you! (This Dru Down in the house\nWith my boy 'Pizznac, you know what I'm sayin'?)\nIt's all about you\n(Yeah, I'm gon' say it's all about you\nBut you know I'm lyin' though, hah! Yeah)\n\n[Verse 1: 2Pac]\nYou probably crooked as the last trick\nWant to laugh about how I got my ass caught up\nWith this bad bitch?\nThinkin' I had her, but she had me in the long run\nIt's just my luck, I'm stuck with fuckin' with the wrong one\nWise decisions, based on lies we livin'\nScandalous times, this game's like my religion\nYou could be rollin' with a thug\nInstead you with this weak scrub, lookin' for some love\nIn every club, I see you starin' like you want it\nWell, baby, if you got it, better flaunt it\nLet the liquor help you get up on it\nI'm still tipsy from last night\nBumpin' these walls as I pause, addicted to the fast life\nI try to holla, but you tell me you taken\nSayin' you ain't impressed with the money I'm makin'\nGuess it's true what they tellin' me\nFresh out of jail, life's hell for a black celebrity\nSo that's the reason why I call, and maybe you with it\nFantasies of us sweatin', can I hit it?\nAddicted to the things you do\nBut still true what I'm sayin', boo, ‘cause this is all about you\n\n[Hook: Nate Dogg & 2Pac]\nEvery other city we go, every other video\nIt's all about you\nNo matter where I go, I see the same ho'\nYeah, nigga\nEvery other city we go, every other video\nIt's all about you\nNo matter where I go, I see the same ho'\n\n[Verse 2: 2Pac]\nI make a promise if you go with me, just let me know\nI'll have you hollerin' my name out before I leave\nNobody loves me, I'm a thug nigga\nI only hung out with the criminals and drug dealers\nI love niggas, ‘cause we comin' from the same place\nWitness me holla at a hoochie, see how quick the game takes\nHow can I tell her I'm a playa? And I don't even care\nCreep low, weed smoke's in the air\nEverywhere I go, it's all about the groupie hoes\nWaitin' for niggas at the end of every show\nI just seen you in my friend's video\nI never put a bitch before my friends, so here we go\nFollow the leader and peep the drama that I'm goin' through\nIt's all about you, yeah, nigga, it's all about you\n\n[Hook: Nate Dogg & 2Pac]\nEvery other city we go, every other video\nIt's all about you\nNo matter where I go, I see the same ho'\nEvery other city we go, every other video\nIt's all about you\nNo matter where I go, I see the same ho'\n\n[Verse 3: 2Pac]\nI see you struttin' in your miniskirt\nA crooked smile with a heart that did plenty dirt\nWill it work with your ass as you pass me by?\nSayin' \"hey,\" I've been looking at you smile all day, let's parlay\nDrinkin' liquor, kissin' to help you know me quicker\nWhile I keep workin' on your zipper, my tongue kissin'\nIn your position I'm fortified to do the mission\nMove your hips and groove to this\nToo many cooks in the kitchen, nobody take the time to listen\nThey probably think we still dissin'\nWit' your permission, I can make you scream my name\nI'm a real man, guide you through the sleazy game\nFollow me, let me take you to the ecstasy\nYou'll have the time of your life when you next to me you'll see\nAin't no way they can stop me\nWhen I know a true thug woman got me\n\n[Hook: Nate Dogg & 2Pac]\nEvery other city we go, every other video\nIt's all about you\nNo matter where I go, I see the same..", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}