{"songs": [{"title": "Operator (Remix)", "album": "A Son Unique", "year": null, "lyrics": "[Hook - Ol' Dirty Bastard & (Pharrell)]\nOperator! (operator!) get the police! (she so fine!)\nOperator! (operator!) get the police! (she so fine!)\nLook at that girl! (she so fine!)\nLook at that girl! (say it again!)\nLook at that girl! (must be a crime!)\nLook at that girl! (OWW!!)\n\n[Verse - Ol' Dirty Bastard]\nYo! Met this bitch by the name of Subie\nShe was a bad bitch, she had a big ol' booty\nShe got me setting up when I went to the projects\nBad ass bitch she was the one to holla at\nHad another bitch by the name of Pricilla\nYou know that bad bitch, she taste like vanilla\nIn my car looking good like that\nGetting money, making records, down with rap\nSaying to myself, no one can defeat me\nI got my dick out, c'mon bitch beat me!\nLet that shit out, go down your throat\nNigga like me, never miss a note\nIf rain I got coats so I can't get soaked\nMake a nigga know I take's that dough\nGet high like Supa Fly\nI'm the best, that's the shit now I don't know why\n\n[Hook]\n\n[Verse - Pusha T]\nBitch please! Come live out your fantasies\nDollars and diamonds, like on my Ice Creams\n1K jeans wit belt and white tee\nI sling white balls give fiends a pipe dream\nWell in this scene in my british queen\nThe ignition's on the left but yes it's the right theme\nEngine full of horses, chariots the king\nThe B's in the middle like it's tittie fucking the wings\nPornographic, the voice so drastic\nWithout a +Reasonable Doubt+ I'm +classic+\nCake-aholic the same way - that Dame Dash is\nBut I bakes my cakes, bag 'em up in plastic (UHH!)\nHalloween 'em up, trick yeah I treat 'em up\nLou' Vuitton a toe, watch how the hoes eat 'em up\nMa I said I'm finger licking good, ah yes we Re\nAs if invisible Juice, you niggas can't see me!\n\n[Hook]\n\n[Bridge - Ol' Dirty Bastard]\nIf you ain't sweating there's something wrong, girl!\n(I aaaaammmmm) Say it louder!\nIf you ain't sweating there's something wrong, girl!\n(I aaaaammmmm) Say it louder!\nIf you ain't sweating there's something wrong, girl!\n(I aaaaammmmm) Say it louder!\nIf you ain't sweating there's something wrong, girl!\n(I aaaaammmmm) Say it louder!\n\n[Verse - Malice]\nShe so fine, all she need now is a baller\nWho better fit the bill? I myself, I'm a starter\nIn the game, you could tell by the charter\nG4, Lear, or the Yacht in the harbor\nMama come to papa, don't it feel at home here?\nAll the comforts of it, you ain't got a care\nDon't love me wit your heart, love me from a far\nNow sit, look pretty like you came wit the car\nDiamonds in the ear lobe, wrapped in the mink\nCondo chillin, I be tickled pink\nNot worrying bout the next bitch or what people think\nIf I say they don't exist, POOF the extinct\nMama - no! we don't need the drama\nAll we need is south beach, puffing on Habanas\nYou just strike a match girl, do your man a honors\nNext week Cali, we up in Las Palmas\n\n[Hook]", "image": "https://images.genius.com/035d8c96b903707a3cfd550d89c33684.400x400x1.jpg"}], "artist": "Ol’ Dirty Bastard"}