{"songs": [{"title": "Momma", "album": "To Pimp a Butterfly", "year": "2015-03-15", "lyrics": "[Produced by Knxwledge & Taz Arnold]\n\n[Intro: Taz Arnold]\nOh shit! I need that\nI need that sloppy, that sloppy\nLike a Chevy in quicksand\nYeah, that sloppy\n\n[Verse 1: Kendrick Lamar]\nThis feelin' is unmatched\nThis feelin' is brought to you by adrenaline and good rap\nBlack Pendleton ball cap (West, west, west)\nWe don't share the same synonym, fall back (West, west, west)\nBeen in it before internet had new acts\nMimicking radio's nemesis made me wack\nMy innocence limited, the experience lacked\nTen of us with no tentative tactic that cracked\nThe mind of a literate writer, but I did it in fact\nYou admitted it once I submitted it wrapped in plastic\nRemember scribblin', scratchin' diligent sentences backwards\nVisiting freestyle cyphers for your reaction\nNow I can live in a stadium, pack it the fastest\nGamblin' Benjamin benefits, sinnin' in traffic\nSpinnin' women in cartwheels, linen fabric on fashion\nWinnin' in every decision\nKendrick is master that mastered it\nIsn't it lovely how menaces turned attraction?\nPivotin' rappers, finish your fraction while writing blue magic\nThank God for rap, I would say it got me a plaque\nBut what's better than that?\nThe fact it brought me back home\n\n[Chorus: Lalah Hathway]\nWe been waitin' for you\nWaitin' for you\nWaitin' for you\nWaitin' for you\n\n[Verse 2: Kendrick Lamar]\nI know everything\nI know everything, know myself\nI know morality, spirituality, good and bad health\nI know fatality might haunt you\nI know everything, I know Compton\nI know street shit, I know shit that's conscious\nI know everything, I know lawyers, advertisement, their sponsors\nI know wisdom, I know bad religion, I know good karma\nI know everything, I know history\nI know the universe works mentally\nI know the perks of bullshit isn't meant for me\nI know everything, I know cars, clothes, hoes, and money\nI know loyalty, I know respect, I know those that's ornery\nI know everything, the highs, the lows, the groupies, the junkies\nI know if I'm generous at heart, I don't need recognition\nThe way I'm rewarded, well, that's God's decision\nI know you know that line's for Compton School District\nJust give it to the kids, don’t gossip 'bout how it was distributed\nI know how people work\nI know the price of life, I'm knowin' how much it’s worth\nI know what I know and I know it well not to ever forget\nUntil I realized I didn’t know shit\nThe day I came home\n\n[Chorus: Lalah Hathway]\nWe been waitin' for you\nWaitin' for you\nWaitin' for you\nWaitin' for you\n\n[Verse 3]\nI met a little boy that resembled my features\nNappy afro, gap in his smile\nHand-me-down sneakers bounced through the crowd\nRun a number on man and woman that crossed him\nSun beamin' on his beady beads, exhausted\nTossin' footballs with his ashy black ankles\nBreakin' new laws mama passed on home trainin'\nHe looked at me and said, \"Kendrick, you do know my language\nYou just forgot because of what public schools had painted\nOh, I forgot, 'Don't Kill My Vibe', that's right, you're famous\nI used to watch on Channel 5, TV was taken\nBut never mind, you're here right now, don't you mistake it\nIt's just a new trip, take a glimpse of your family's ancestor\nMake a new list of everything you thought was progress\nAnd that was bullshit\nI know your life is full of turmoil\nSpoiled by fantasies of who you are, I feel bad for you\nI can attempt to enlighten you without frightenin' you\nIf you resist, I'll back off quick, go catch a flight or two\nBut if you pick destiny over rest in peace\nThen be an advocate, tell your homies especially\nTo come back home\"\n\n[Interlude]\nThis is a world premiere\nThis is a world premiere\nThis is a world premiere\n\n[Outro]\nI been lookin' for you my whole life, an appetite\nFor the feeling I can barely describe, where you reside?\nIs it in a woman, is it in money or mankind?\nTell me something, got me losing my mind, ah!\nYou make me wanna jump\nJump, jump, jump, jump\nLet's talk about love\nJump, jump, jump, jump\nLet's talk about love\nJump, jump, jump, jump\nLet's talk about love\nJump, jump, jump, jump\nLet's talk about love\nI been lookin' for you my whole life, an appetite\nFor the feeling I can barely describe, where you reside?\nIs it in a woman, is it in money, or mankind?\nTell me something, think I'm losing my mind, ah!\nI say, where you at? From the front to the back\nI'm lookin' for you, I react only when you react\nAh, I thought I found you, back in the ghetto\nWhen I was seventeen with the .38 Special\nMaybe you're in a dollar bill, maybe you're not real\nMaybe only the wealthy get to know how you feel\nMaybe I'm paranoid, ha, maybe I don't need you anyway\nDon't lie to me, I'm suicidal anyway\nI can be your advocate\nI can preach for you if you tell me what the matter is", "image": "https://images.genius.com/ffb1a13cfda120ba85ab9e2a83a4e158.1000x1000x1.jpg"}], "artist": "Kendrick Lamar"}