{"songs": [{"title": "Grindin’", "album": "Big Money Popping Riddim", "year": "2014-08-08", "lyrics": "[Intro]\nGrindin’, grindin’\nGrindin’, grindin’\nGrindin’, grindin’\nGrindin’, grindin’\n\n[Verse 1: Lil Wayne]\nI’m grindin’, I’m grindin’, I’m grindin’ I promise\nI fuck her until I get tired, retire and then come out retirement\nMy girl like it rough she said “find me a diamond”\nHer body be grindin’\nLord we be on every kind of narcotic\nThat make us believe, when we lyin’, we honest, I love you\nPick, Michael Jackson to Jordan to Tyson to Myers\nToo much dirty money when the colors\nAre washing the whites in the dryer my nigga\nIt ain’t rocket science just rockets\nI sleep in pussy not pajamas, grindin'\nI got this shit down to a science, I turn in my project, A minus\nWhew, I ain’t crazy, I’m krazy and all of my niggas chaotic\nDressed in all black like they gothic\nMusic too loud to hear sirens, we pop, pop, pop up where you stay\nKnock, knock, knock, anyone home?\nPop, pop, pop, pop then we outtie\nI need a bitch like Naomi to take off her clothes like Leilani for niggas that’s grindin’\n\n[Chorus: Lil Wayne]\nNigga I’m grindin’ for all my shit\nGrindin’ for all my shit\nYeah, I’m grindin’ for all my shit\nI put time into all this shit\nMan, I’m grindin’ for all my shit\nI’m grindin’ for all my shit\nPerfect timing with all my shit\nI’m grindin’ for all my shit\n\n[Verse 2: Lil Wayne]\nThe feds be spying on all of us nigga\nThese hoes be lying to all of us nigga\nI got news for the monogamous niggas\nYo' bitch fucking anonymous niggas\nI done seen it all my nigga\n'Cause these hoes seeing all of my niggas\n'Cause what’s the hottest shit on these corners?\nThat’s me and all my niggas\nGrind for all this shit, I ain’t ever fall for that bitch\n'Cause picking up the feather from a lovebird\nIs like a medicine ball to that bitch\nWe'll bring Gucci bag in this bitch\nAnd you know what's stashed in that bitch\nThese niggas walk around with they chests out\nLike Janet Jackson and shit\nI’m sweatin’ grindin’ this bitch, I need a shrine in this bitch\nFuck double O seven, I work twenty-four seven\nAin’t got time to bond with no bitch\nHeard Jay Z got a new Cognac, where to find that shit?\nThe weed sticky, grind that shit\nWhere I got it from? Nevermind that shit\nNigga, I'm grindin'\n\n[Chorus: Lil Wayne]\nNigga I’m grindin’ for all my shit\nGrindin’ for all my shit\nYeah, I’m grindin’ for all my shit\nI put time into all this shit\nMan, I’m grindin’ for all my shit\nI’m grindin’ for all my shit\nPerfect timing with all my shit\nI’m grindin’ for all my shit\n\n[Verse 3: Drake & Lil Wayne]\nYeah\nI got a new vision for all my shit (for all my)\nI don’t know what to call that shit (don’t know what to call it)\nI know, I’m selling all of my cars\nI’m selling all of my watches\nI’m selling diamonds and all of that shit\nRealized I don’t need that shit (don’t need it)\nI’m a different breed with this shit (yeah)\nI’m tryna turn M’s to B’s in this bitch (yeah)\nAnd I ain’t ever pay to be with no bitch (woo!)\nI, I, I want that Brigitte Bardot hanging over my bed\nFifty mill' in one room (huh?)\nYou, you could ask anyone out here who running the game?\nAnd they’ll tell you the truth, man, they tell you (and they tell you)\nOh look, they fuck with me now (hey)\nI think they’re hearin' me now (yeah)\nSomeone said, \"Nigga, they takin' you seriously now\"\nI’m like, \"I think they just might be scared of me now\" (might be scared of me now)\nBut it’s all good, niggas wrong every day (every day), niggas wrong every day (true)\nGone, goin' to LA where I’m tryna get high and do a song every day\nSafe, we ain’t ever have to play it safe (nope)\nI would rather stack it up and put it in a safe\nThen peek inside the safe and see I’m runnin' out of space\nMothafucka, that’s grindin'\n\n[Chorus: Lil Wayne]\nNigga I’m grindin’ for all my shit\nGrindin’ for all my shit\nYeah, I’m grindin’ for all my shit\nI put time into all this shit\nMan, I’m grindin’ for all my shit\nI’m grindin’ for all my shit\nPerfect timing with all my shit\nI’m grindin’ for all my shit\n\n[Bridge: Lil Wayne]\n(Grindin’, grindin’) Perfect timing\n(Grindin’, grindin’)\n(Grindin’, grindin’)\nI would rather stack it up and put it in the safe\nThen peek inside the safe and say I’m running out of space\nBelieve that\n\n[Verse 4: Lil Wayne]\nScoob, find another oo-wop\nTell them niggas cool out\n'Cause it can be a mohafucking shoot-out\nKidnap a nigga, beat the truth out\nMoms pick the suit out\nTop floor, window he get threw out\nDeuce out, pussy bitches, deuce out\nFlying out the crew out, they flew out\nInvite 'em to my new house, my new house\nI’m fucking every night up in my new house\n'Cause bitch I worked too hard for this new house, grindin’\nI’m fucking every night up in my new house\n'Cause bitch I worked too hard for this new house, I'm grindin’\nI’m fucking every night up in my new house\n'Cause bitch I worked too hard for this new house, I’m grindin’\n\n[Outro]\nTwap, twap!\nTwap, twap!\nIn the new house, we got the twap", "image": "https://images.rapgenius.com/c16c4f9af39f92eb2ae06323afcb141b.500x500x1.jpg"}], "artist": "Lil Wayne"}