{"songs": [{"title": "Is He Ill?", "album": null, "year": "2003-11-15", "lyrics": "[Hook]\nIs he ill?\nDo he really fit the bill?\nSpit to kill?\nKeep things real?\nKnow the drill?\nThe ledge edge still?\nCatch wreck at will?\n(Repeat x2)\n\n[Verse 1: MF Doom]\nToday's forecast, a slight chance of flurries\nSlightly slim chance that they might dance to worries\nAnd won't know what to say, break to a cutaway\nDOOM like the rain known to come back another day\nLike this day like now-a-day be right there\nLike I, O, A, gimme half a light year\nSame time it take y'all to drink a light beer\nFeel the wrath of his truth just like the cast from Nightmare\nWhoever got the cash, the mic, they both right here\nWhat more can I say? keep your sights clear\nBare facts, triple naked to bare backs\nHe only came to jack rare tracks for your earwax\nOh snap! You hear that? Naw\nDOOM stay way up in the cut like Ma and Pa\nWhen he come out he dumb out, there he go\nThe villain with the illest flow in all of Mexico\nAll foes on some when he leave out let me know\nJust so's I can breath out before I let go\nRappers is like Satchmo that you best know\nInvest in free dough like Matthew Lesko\nFollowed by hailstorms, snow and earthquakes\nGive out more toothaches than first birthday cakes\nThe more we reverse scripts the worse they fate\nTo beat y'all with dimes and dummy Anbesol shake\nNow you got a rhyme tummy ache by mistake\nCan't call it, can't call Jake, call cannonball face\nDig tapes and stay in great shape\nToday's rap game is like one big date rape\nThe name ring bell like ring ding dong\nHe can never be wrong like Ling Ting Tong\nOnce heard a hit song, sounded like an annoying gong\nIt's so wack, I ain't wanna hit the bong\nNow who get iller with the pen than I do?\nAnd in it just to get the benjamin like Netanyahu?\nLet the god bless you like Achoo!\nGet you like whats that on your chest, got you\nPNS beat good for you it's shredded wheat\nAs well as getting shredded by the metal headed lead feet\nSon 'em and dead 'em like a dad that's dead beat\nBeat him like a dead horse, nasty as red meat\nDOOM memorize rhymes and still forgot\nCall it how he see it and kill a shot, like Willard Scott\nIn the place to be like no iller spot\nTo spill a knot, it's like a chilling thriller plot\nStarring the villain as the black Jesus\nIf it ain't the 'gnac or the Jack it's Grey Goose\nStill could stay loose off grape juice regardless\nNevertheless did his best on the retarded test\nIt's trick questions, always kept a cheat sheet\nOn the microphone, a rep up before Beat Street\nAnd beat meat that MF DOOM he stay true\nIf you online check the site and FAQ\n\n[Hook]", "image": "https://images.genius.com/6926a0c71897915966fa5df5a09b112a.970x970x1.jpg"}], "artist": "MF DOOM"}