{"songs": [{"title": "Derty Harry", "album": "I Miss the Hip Hop Shop", "year": null, "lyrics": "[Intro]\nHey them horns ain't extensions nigga listen\nReal shit here\nHaha\n\n[Verse 1]\nFace to face you got no heart, when I blow sparks\nYou lean on me like Joe Clark, my mind is so dark\nYour superficial, nuclear Missile\nHit your body and your bones and not loose the gristle\nProofs official, D12 trademarker\nMale, no \"S,\" big brave heart\nY'all ain't even listen\nNo S big backwards is Gibson\nMel Gibson bravehearted\nNow on to my mission\nAnd since then no failure\nI promised God to commit homicide to niggas wantin a free ride\nLike the Amistad, I'm alive\nAnd just started Anger Management too, like [?]\nBody ya mind, dyin' to ride like Bonnie and Clyde\nInfluenced the greatest like Ronnie and Todd\nIt ain't no problem too hard\nMy solo like Do Lo, been gettin' it\nLike I ain't been shittin' it!\n\n\n[Hook]\n(Y'all done start it)\nDerty Harry\nContract mothafucker lets roll it right now!\n(Y'all done start it)\nDerty Harry\nYou the one on this\n(Y'all done start it)\nDerty Harry\nProof nigga I'm a wolf\n(Y'all done start it)\nDerty Harry\nYou can get some now!\n\n[Verse 2]\nIn high school of course I was the best in the lunchroom\nDon't make me get up out my seat bitch and punch you\nI freestyle for fun but write for wealth\nI'm so dope nigga even bite myself\nI rap it with rapid fire\nBlasting iron at a Baptist choir\nAnd then at the black Messiah\nWe gat for hire to let the techs growl\nPut something in your body worse then the West Nile\nI was born out of test tube glass\nI suggest you blast nigga\nOr catch sum flesh wound fast\nI ain't met a man that can wrestle gats\nI'm right behind the top rappers like a Neptune track\nYa L.P., I slept through that\nNow guess who back\nUnless you strapped with a vest and two gats\nI suggest you pack\nI'll spread you flat then rescue rap\nHit your body so much that your flash won't match\nMuthafucker!\n\n[Hook]\n\nFuck Osama for bombing in the racing buildings\nI'll bust him and hide him like Jason Williams\n(I heard Bizzare and D12 be raping children!?)\nCut the hype dyke I'm trying to make a million\nTake this pill then call me when you sober up\nTurn the dyke from glad to groupies, make'em hold my nuts\nSeldom-ly seen, Elvis the King\nBut it's Em that's got these kids nailed to the screen\nI held the team, I-F\nI got something on my chest thats hard to digest\nI hear the streets talk and sing\nOffering cause jacking my rapping\nThey mad cause I'm flossing bling\nI lost my steam but a demon in human flesh hyped my up\nNow my team is tightly cut\nSo sugar, sugar, salt, salt\nIf you didn't get off it's not my fault\nThe dog is back and y'all niggas!\n\n[Hook]", "image": "https://images.genius.com/d8f208c3ea47250c484492346287c1bf.571x571x1.jpg"}], "artist": "Proof"}