{"songs": [{"title": "A Milli (Mixtape Version)", "album": "The Drought Is Over 5", "year": null, "lyrics": "[Verse 1 - Lil Wayne]\nA Millionaire\nI'm a young money millionaire, tougher than Nigerian hair\nMy criteria compared to your career just isn't fair\nI'm a venereal disease like a menstrual bleed\nThrough the pencil I leak on the sheet of the tablet in my mind\nCause I don't write shit cause I ain't got time\nCause my seconds, minutes, hours go to the almighty dollar\nAnd the almighty power of that ch-cha-cha-chopper\nSister, brother, son, daughter, father, mother-fuck a copper\nGot the Maserati dancing on the bridge, pussy popping\nTell the coppers hahahaha you can't catch em, you can't stop em\nI go by them goon rules\nIf you can't beat em then you pop em\nYou can't man em then you mop em\nYou can't stand em then you drop em\nYou pop 'em cause we pop 'em like Orville Redenbacher\nYoung Money\n\n[Verse 2 - Cory Gunz]\nI'm Millie in here with them Young Money millionaires\nThink you really pop a wheelie in air?\nMac Milli, the Vanilli's in here, I'm a rascal, don't get whopped\nI get brats who don't give top\nI get tassel, pass you with a flow you could never put a brake on and I break on anything a nigga take on\nFeel the napalm from my trey arm, straight long, throw a nigga like I'm Akon, cause I'm acorns\nWhere the base gone? get the base blown, let the Pistons on that chopper\nCome on, cops, I'm kamikaze, drop a rock with them Obamas\nIllie in the mind, really with the nine, millie when I rhyme, silly anytime fine, chilly, gitty on the grind\nShitty on a dime, Penny on the line plenty's in me, any guinea's with 'em, bigger than a mini, and remind I'm\nIllie, and it's all off G piece and a PG walk by, beep beep\nWith a freak, skeet, hawk out, big feet on a jeep\nShe caught by Weezy F, we be the best, truly to death, prove me the rest\nGroupies confess, you be the ref, 'xcuse me, I left\n\n[Verse 3 - Lil Wayne]\nA millionaire, I'm a young money millionaire\nWhat, 'chyall really want it? Nah, y'all don't really wanna do it\nIf hip hop is dead, I am the embalming fluid\nAnd I don't care who it be, I'm steppin' to it\nNotice I say 'it', cause to me, it ain't shit\nGet, it?\nCall me whatcha like, trick, call me on my Sidekick\nNever answer when it's private, man, I hate a shy chick\nDon't you hate a shy chick? I had a plate of shy chick\nAnd she ain't shy no mo', she changed her name to \"My chick\"\nYeah, boy, that's my girl\nAnd she pops excellent up in Wayne's world\nTotally dude, you should see their faces\nWhen they see that this robot can move\nAnd it's like... hahaha, yea\nAnd it go... that's right\n\n[Verse 4 - Lil Wayne]\nA millionaire, I'm a\nYoung Money, Cash Money, fast money\nSlow money, mo' money, never no money\nWhat is that, who is that? I never heard of it\nI will take your picture and make a 'Rest In Peace' shirt of it\nSome should take this beat and make a 'Rest In Peace' shirt of it, cause\nI killed it, now don't tell no one you heard of me\nIt's like the beat was screamin', \"Murder me!\"\nAnd I'm a murderer, so I murdered it\nAnd you niggas is what I eating I'll make sure of it\nAnd he who don't believe me, I'll make dessert of him\nSherbet him, I mean, shame on him\nOr her; Carter, father of\nThis rap thang, this is my race\nGon' take a lap, man, Weezy Baby's nursery\nNow gon' take a nap man, it's naptime\nI'll holla back at you at snacktime\nWeezy F... yeah, OK\n\n[Verse 5 - Lil Wayne]\nThey say I'm rappin' like B.I.G, Jay, and 2Pac\nAndré 3000, where is Erykah Badu at\nWho dat, who dat said they gon' beat Lil' Wayne\nMy name ain't Bic, but I keep dat flame, man\nWho dat one dat do dat boy? You knew dat, true dat, swallow\nAnd I be the shit, now you got loose bowels\nI don't O U like two vowels\nBut I would like for you to pay me by the hour\nAnd I'd rather be pushing flowers\nThan to be in the pen sharing showers\nTony told us this world was ours\nAnd the Bible told us every girl was sour\nDon't play in her garden and don't smell her flower\nCall me Mr. Carter or Mr. Lawn Mower\nBoy I got so many bitches like I'm Mike Lowrey\nEven Gwen Stefani said she couldn't doubt me\nMotherfucka I say life ain't shit without me\nChrome lips poking out the coupe, look like it's pouting\nI do what I do and you do what you can do about it\nBitch, I can turn a crack rock into a mountain\nDare me\nDon't you compare me cause there ain't nobody near me\nThey don't see me but they hear me\nThey don't feel me, but they fear me. I'm illi\n\nMan, life just ain't life without me\nHip hop just ain't hip hop without me\nYoung Moola, baby", "image": "https://images.genius.com/ec6f0c92e7457c18997267cb2c65dcf7.400x400x1.jpg"}], "artist": "Lil Wayne"}