{"songs": [{"title": "I Really Want to Show You", "album": "Born Again", "year": "1999-12-07", "lyrics": "[Intro: The Notorious B.I.G.]\nWooo! There's gonna be a lot of punchin' in this motherfucker!\nY'all better be swift with that punch button, Jack!\nBiggie! - Biggie!\n\n[Verse 1: The Notorious B.I.G.]\nI know how it feel to wake up fucked up\nPockets broke as hell, another rock to sell\nPeople look at you like youse the user\nSelling drugs to all the losers, mad buddha abuser\nBut they don't know about your stress-filled day\nBaby on the way mad bills to pay\nThat's why you drink Tanqueray; so you can reminisce\nAnd wish, you wasn't livin so devilish, ssshit\nI remember I was just like you\nSmokin blunts with my crew, flippin over 62's\nCause G-E-D wasn't B-I-G\nI had to get P-A-I-D that's why my mom's hate me\nShe was forced to kick me out, no doubt\nThen I figured out licks went for twenty down South\nPacked up my tools for my raw power move\nGlock nineteen for casket and flower moves\nFor chumps tryin' to stop my flow\nAnd what they don't know will show on the autopsy\nWent to see Papi to cop me a brick\nAsked for some consignment, he wasn't tryin' to hear it\nSmoking mad Newports 'cause I'm due in court\nFor an assault that I caught in Bridgeport, New York\nCatch me if you can like the Gingerbread Man\nYou better have your gat in hand cause man\n\n[Chorus: K-Ci & JoJo]\nCome and run with me - I really wanna show you\nHow I run the streets - I really wanna show you\nHow I'm clockin' G's - I really wanna show you\nCome and run with me - I really wanna show you\n\n[Verse 2: The Notorious B.I.G.]\nI had the master plan\nI'm in the caravan on my way to Maryland\nWith my man Two-Tecs to take over this projects\nThey call him Two-Tecs, he tote two TECs\nAnd when he start to bust, he like to ask: \"Who's next?\"\nI got my honey on the Amtrak\nWith the crack in the crack of her ass\nTwo pounds of hash in the stash\nI wait for hon to make some quick cash\nI told her she could be Lieutenant\nBitch got gassed\nAt last, I'm literally loungin' black\nSittin' back, countin' double digit thousand stacks\nHad to re-up; see what's up with my peeps\nToyota Deal-a-Thon had it cheap on the Jeeps\nSee who got smoked, what rumors was spread\nLast I heard I was dead with six to the head\nThen I got the phone call, it couldn't hit me harder\nWe got infiltrated like Nino at the Carter\nHeard Tec got murdered in a town I never heard of\nBy some bitch named Alberta over nickel-plated burners\nAnd my bitch swear to God she won't snitch\nI told her: \"When she hit the bricks I'll make the hooker rich!\"\nConspiracy - She'll be home in three\nUntil then I looks out for the whole family\nA true G, that's me! Blowing like a bubble;\nIn the everyday struggle\n\n[Chorus: K-Ci & JoJo]\nCome and run with me - I really wanna show you\nHow I run the streets - I really wanna show you\nHow I'm clockin' G's - I really wanna show you\nCome and run with me - I really wanna show you\n\n[Verse 3: The Notorious B.I.G.]\nI'm seeing body after body and our mayor Giuliani\nAin't tryin' to see no black\nMan turn to John Gotti\n\n[Verse 3: Nas]\nGuns and diamonds\nBitches put they tongues where the sun ain't shinin'\nTake keys 'til they spot us, snakes flee with consignment\nThis kid he got his crib raided, police found grams\nThey locked up, his whole fam; moms, sister, his old man\nNigga bailed his moms out, then he told on his man\nNow they home, actin like nuttin wrong, hustlin again\nHe tried to be the next Frank White, and Escobar\nPickin up coke a fiend holds it in a separate car\nCooks it up til it's bright white, cut it tight right\nThen he slings it to the fiends, lookin like Fright Night\nCoppin the motorbikes, the scooters, countin dough on computers\nHigh technology dealers, to the users and losers\nHalf-leg DiDi, try to swap drug for TV's\nStores run out of baking soda from BK to QB\nMy niggas die for the cause, .45 on the drawer\nCity laws made by Big Nas and Biggie Smalls\nBitches, holdin my weight in they titties and drawers\nMy bitches out of state get busy while they pushin my cars\nCallin me up, callin me baller, call for they cut\nPretty hoes bring me my cash, swallow all of this nut\nSeats on the Bent' stay nasty, push the dash\nFor the stash box is where the cash be; watchin for task force\nCause I know they comin but I'm reachin my goal\nFuck bummin, I'm makin sure I leave this whole game wit somethin\nCrib in West Palms for my dime, crib for my moms\nRidiculous, you lookin at the next Nicholas Barnes, baby\n\n[Chorus (repeat to fade)]", "image": "https://images.genius.com/5fa56d7da6cf3fe54995d91d7120c735.500x500x1.jpg"}], "artist": "The Notorious B.I.G."}