{"songs": [{"title": "Feel Good", "album": "Young Sinatra: Welcome to Forever", "year": "2013-05-07", "lyrics": "[Verse 1]\nMulti-million dollar deals\nGot a million dollar deal\nWhen I was younger\nI would wonder how a million dollars feel\nAnd for real, it feel like I ain't even broke the seal\n'Cause when you drop hits they want you to pick up the bill\nNow my, life is in Maryland\nMy heart is in Chicago\nNew York state of mind but out LA man that's where I go\nWhen I need to lay this shit down\nSo much on my mind, that's the reason I'm spitting now\nFinally running the game and everybody tripping now\nBut I can't give a damn I got they bitches dripping now\nMoet we sipping now\nYeah, we came a long way\nI know a lot of people thought they'd never see the day\nThat we get big like Notorious\n'Cause we battle like warriors in the state of euphoria\nMy team is so fucking glorious\nSo I'ma love life while you live life\n'Cause I ain't perfect but I do my best to live it right, yeah\n\n[Hook]\nAre you ready to go?\nI know the city getting ready for me\nI know the city getting ready\nAre you ready to go?\nI know the city getting ready for me\nI know the city getting ready\n\n[Verse 2]\nI should have took the time to understand the world\nBut I was just too busy tryna understand them girls\nI never told anyone but I asked my ex to marry me\nA couple months later the bitch buried me\nAnd I know what y'all thinking\nLogic, there's still hope\nKeep yo chin up mothafucker\nAin't no reason to mope\nPlus you got a lot of money and your music is dope\nWhat's all the money in the world if yo heart still broke\nBut let's get back to the subject cause I was off of the topic\nHand me the mic and I rock it\nThey say they hate it then jock it, shit\nI remember no heat in the winter time\nNow that I'm eating haters grilling me like dinner time\nTryna make a living off of what we've been giving\nSince a younging I've been driven\nJust tryna do it how I do it, huh\nFrom my city to your city, to Chi-city\nWe blowing up at high velocity, waddup\n\n[Hook]\nAre you ready to go?\nI know the city getting ready for me\nI know the city getting ready\nAre you ready to go?\nI know the city getting ready for me\nI know the city getting ready", "image": "https://images.genius.com/da76d57af3e6ee702af91bac2a18326a.1000x1000x1.jpg"}], "artist": "Logic"}