{"songs": [{"title": "Who’s There?", "album": "Knock Madness", "year": "2013-11-26", "lyrics": "[Pre-Chorus: Hopsin]\nI know how\nLong you've waited (Waited for what?)\nFor the day\nAll these games end\n\n[Chorus: Hopsin]\nKnock-knock, who's there? H (H who?)\nKnock-knock, who's there? O-P\nKnock-knock, who's there? H (H who?)\nKnock-knock, who's there? O-P\n\n[Verse 1: Jarren Benton]\nA bunch of savages, Hop'll slice the head off a faggot\nI wake up in the morning and go raid the medicine cabinet\nEvery word I spit is murder on the page of this tablet\nI spit out a fucking bullet from this gauge at your fabric\nI'm not your average Joe, brain pattern is slow\nA lot of pain, things changed, now I'm stacking this dope\nExclusive new shit, me and Hopsin we too sick\nI crack a hater upside his fucking head with a pool stick\nMurdering me is like Hop signing to Ruthless\nFor a second time and then pigs flying on broomsticks\nMichael Jackson crawling out of his grave with two kids\nBitches squirting St. Ides liquor out of they two tits\nFuck a metaphor, basically nigga you ain't doing it\nHand you a mirror before I murk you, check out a view in it\nI'm losing it, serial killer lurking the music biz\nWithout a mask, I want you bitches to know who the fuck it is\nSuffering succotash, rims on a hovercraft\nRomantic psychopath, I drown whores in a bubble bath\nIt's Mr. Benton nigga, y'all fall back\nAnd lick the crease between my asshole and ballsack, bitch!\n\n[Pre-Chorus: Hopsin]\nI know how\nLong you've waited (Waited for what?)\nFor the day\nAll these games end\n\n[Chorus: Hopsin]\nKnock-knock, who's there? H (H who?)\nKnock-knock, who's there? O-P\nKnock-knock, who's there? H (H who?)\nKnock-knock, who's there? O-P\n\n[Verse 2: Dizzy Wright]\nYo, Locked and loaded\nReady to bring da ruckus\nThuggish ruggish\nNo other rapper can touch it\nI'm disgusted, fuck it\nNah, I'm in a rush to put the pressure on\nLet it be known, ask yo girlfriend who she sextin' on\nBetter known, It's Mister Knock-Knock the panties down\nYou a hand-me down, Hammer down what they invested on\nShoulda' left it alone, Shouldn't have left her at home\nIt gets her off of you, I'm watchin' as she testin' it on\nMy marijuana scent all up in yo shit\nYou ain't shit, You as solid as my spit\nI gotta couple rappers on my list\nBetter get established before I get to wrapping up careers\nKing Dizzy coming to give it to you straight\nTaking place, Fuck being different\nI care about being great\nNigga kill the hate\nI'm coming just to kill it in yo state\nFuck the world, Fuck you\nRun in place, I penetrate\nWe the shit\n\n[Pre-Chorus: Hopsin]\nI know how\nLong you've waited (Waited for what?)\nFor the day\nAll these games end\n\n[Chorus: Hopsin]\nKnock-knock, who's there? H (H who?)\nKnock-knock, who's there? O-P\nKnock-knock, who's there? H (H who?)\nKnock-knock, who's there? O-P\n\n[Verse 3: Hopsin]\nYeah, bitch I didn’t wake up in a new Bugatti\nJust in a room of rotten rappers, gruesome bodies I’m killin' like I’m illuminati\nI’m fuckin' out the blue tsunami, nothin' you can do to stop me\nI don’t care if you knew karate or do pilates\nYou fools are probably scattered so gather you stupid posse\nAnd get me before I move to Aussie and they crucify me\nFuck your new Versace, you can get a cutthroat and deep-throat a dick till it’s poking out through your butthole\nSwallow the nut whole, this shit is X-rated\nY'all kept playin’ on devilish ground till you met Satan\nI stomp on you till you chest cave in and neck breaking\nYou better be keepin’ you mouth shut like your breath stinkin'\nThere really isn't anyway I can be less blatant\nSo face it, you basically fucked, my brain is corrupt\nThis little bar — I’m raising it up\nAnd you can watch me catapult after you finish licking Jarren’s anus and nuts\nIt’s Knock Madness!\n\n[Pre-Chorus: Hopsin]\nI know how\nLong you've waited (Waited for what?)\nFor the day\nAll these games end\n\n[Chorus: Hopsin]\nKnock-knock, who's there? H (H who?)\nKnock-knock, who's there? O-P\nKnock-knock, who's there? H (H who?)\nKnock-knock, who's there? O-P", "image": "https://images.genius.com/89f3b594c1d21cb0ced76a0e54600701.1000x1000x1.jpg"}], "artist": "Hopsin"}