{"songs": [{"title": "O.K.", "album": "Watching Movies With the Sound Off", "year": "2013-06-18", "lyrics": "[Chorus: Tyler, The Creator]\nGet 'em Mac, Mac, Mac, Mac\nMac, Mac, Mac, Mac\nGet 'em! (Get 'em!)\nGirl, shake that body\nGet 'em Mac, Mac, Mac, Mac\nMac, Mac, Mac, Mac\nGet 'em! (Get 'em!)\nGirl, shake that body\n\n[Verse 1: Mac Miller]\nWhoa, what do we have here?\nPeople want to know how we could be that weird\nHow many hoes want to clean Mac's beard?\nI kill flows, think I need that tear on a tattoo\nMy bitch suck, she a vacuum\nFuck her in the ass everytime I'm in a bad mood\nAin't got a choice, know she do it cause she have to\nI hit it raw while I'm listening to Papoose\nNo respect, cause you wear a V-neck\nI mean stress, pressure that could even make Keith sweat\nI wish Narnia was on a GPS\nI wish Rihanna was DTF\nI got rich with these rap songs\nBought a drug problem, now the cash gone\nAlbum filled with all sad songs\nBut this the one that I can laugh on\n\n[Chorus: Tyler, the Creator]\nGet 'em Mac, Mac, Mac, Mac\nMac, Mac, Mac, Mac\nGet 'em! (Get 'em!)\nGirl, shake that body\nGet 'em Mac, Mac, Mac, Mac\nMac, Mac, Mac, Mac\nGet 'em! (Get 'em!)\nGirl, shake that body\n\n[Verse 2: Tyler, The Creator]\nGirl, shake that body, them ass and totties\nI want to see them cankles at my hotel lobby (no nigga fuck you)\nBitch, why you so damn snobby?\nYour ass flatter than the back of my head\nI bought you dinner now it's time to pay me back with some head\nOr I'ma have my little sister beat the back of your head\nI'm a grade-A douchebag, I'm a dickhead\nAsshole area where my gooch sag\nLittle momma got salty at me, she started talking tough\nSo I called the Wolf Gang up, they start to bark it up\nPopped a hundred mollies, fifth of sherm, think I was sparking up\nA bottle of Zima, the Bimmer, I started parking up\nSeen my nigga, Mac, and he hopped in the back\nAnd then we jet to Fatburger, ordered some Big Macs\nAnd bitch came with a gauge, and she wanted my fade\nBut I'm a bitch-ass nigga so I say\n\n[Chorus: Tyler, The Creator]\nGet 'em Mac, Mac, Mac, Mac\nMac, Mac, Mac, Mac\nGet 'em! (Get 'em!)\nGirl, shake that body\nGet 'em Mac, Mac, Mac, Mac\nMac, Mac, Mac, Mac\nGet 'em! (Get 'em!)\nGirl, shake that body\n\n[Verse 3: Tyler, The Creator]\nT-Dollaz and Mac Meezy\nMaking sure you niggas don't win like referees\nLooking for the bitches that love to suck peewee, Herman, I'm a vermin\nAnd you could tell I golf with my hat, man, fuck Thurnis\n\n[Verse 4: Mac Miller]\nI'm at IHOP's and eating with Tyler\nDrink cocoa then double-team Mariah\nBut please, don't tell Nick\nWe were all watching movies at a Motel 6\nLike ha-ha, ha-ha, ha-ha-ha\nI hope Kendrick fuck Gaga\nIf Madonna on the Kabbalah\nThen me and Snoop could chill and be Rastas\nI don't need Prada to show you I'm rich\nPulling out the llama like, \"Show me your tits\"\nKeep crying cause I still ain't over my bitch\n\n[Outro: Mac Miller]\nOh well, it'll be okay", "image": "https://images.genius.com/c97dc009b7b1ff0982e14799c3dd3042.375x375x1.jpg"}], "artist": "Mac Miller"}