{"songs": [{"title": "YM Banger", "album": "I Am Not a Human Being", "year": "2010-09-27", "lyrics": "[Verse 1: Gudda Gudda]\nOk I'm leanin' to the left, flag in my right pocket\nStar Trek fly, unidentified flying objects\nExtraterrestrial, I'm all about my decimals\nRetarded in the booth, they say I got a special flow\nSicker than your average you rappers is ass backwards\nGudda spit crack and you niggas is crack addicts\nIt's simple mathematics; you cut the check\nAnd I rake in the green like I'm rakin' the grass in\nPretty bitches damn near faint when they passin'\nCall my whip Martin, but the first name Aston\nPotatohead niggas get mashed when I'm spazzin\nThink you fuckin' with me? Put your cash in\nNah, I doubt it;\nI was young and reckless when P say he was about it\nYou niggas is Ducks, Howards, Cowards\nKill the competition and shower niggas with flowers\nThis rap shit is ours, Gudda, bitch~!\n\n[Verse 2: Lil Wayne]\nUh, Uptown back in it, Hollygrove black menace\nBlack clothes, black tennis', black semi'\nI've never sat in the Hemi, that will offend me\nTry Maybach or Maybach, bitch I got stacks\nYeah, Paychecks on paychecks and I still want payback\nI still don't play that, I kill on ASAP\nAnd we don't do shit but get money all day\nPut some shoes on my bullets now they runnin' your way\nYM, Young Mula, Young Money all day\nWhere the drugs so sweet like honey on yay\nWhich one of y'all say you want drama? I'm honored\nI blitz yo' ass like a mothafuckin' lineman\nStack of paychecks with a whole bunch of commas\nStill wear red like an old 49er\nFuck shittin' on ya, dump the whole toilet on ya\nWeezy F baby, bitch I'm hotter than Uganda\nUggh!\n\n[Verse 3: Jae Millz]\nLet-let go\nMo-momma ain't make me to make homies, she made me to make history\nSo doin that my extra-curicular activity\nBulldozer boy and my target is the industry\nTwo things in the world I love - good head and victory\nYou ain't doin' it big, I'm grown, stop kiddin me\nYour whip ain't up to date and your hoes look like Mr. T\nThis is Misery, no Kathy Bates\nCome at me sideways my money'll slap you straight\nYeah, I'm a big joker so you know I'll smash your ace\nLeave the club with ya girl send her home with a ashy face\nLove is a gamble, but it's my casino\nAnd tonight you're the loser, I hope she got Aveno\nI hope the game got life insurance cause I'mma kill it\nAnd all you whack ass rap niggas dyin with it\nI'm so Harlem, eatin but still starvin'\nPo-pockets fat as fuck like all they do is eat margarine\nMillz!\n\n[Verse 4: Tyga]\nSay, put the flow\nSay, put the flow in the pot, crank up the notch\nBurn the song from a stove top, this finger lickin hot\nHis pick flip cause the nigga flopped\nMy shit hit like the pitch was soft, niggas cottonballed\nShe dropped drawers cause she poppin off\nHer pussy crossed guard but, I don't stop at all\nI smash in the car, like fuck the fuckin law\nHer baby daddy gone, who wanna meet the Don?\nThat Rocky shit up on the arm-arm\nShittin on 'em like hay in the barn\nHey wait they say Money talks and, man you don't speak at all\nYou shop at mini-malls\nMy style two thumbs up like using analogs\nHa ha~! I wreck shit for the recognition bitch\nJesus as my witness, Saan vision\nEyeball you niggas, flame flicker\nI melt pictures, Tyga skin ain't drippin", "image": "https://images.genius.com/4961f298812e90e0d45e2664f95cfcd7.1000x1000x1.jpg"}], "artist": "Lil Wayne"}