{"songs": [{"title": "From the Back", "album": null, "year": "2015-05-25", "lyrics": "[Intro]\nWoah woah (Woah woah)\nWoah woah (Woah)\nThis beat is so so Digital\nWoah, woah, woah\nThugger, Thugger, nigga\nUh\n\n[Chorus]\nI hit your ho straight from the bizzack\nYoung Thugger Thugger came at your neck (No way)\nGuapo my nigga, he get rinnacks\nFuck niggas stealin' swag, boy, bring back\nBooling in the lobby with cousin Buzz\nI'm a young pimp, where the fuck is my mug? (Pimp)\nPlus I'm redder than the hollywood rug\nEvery time I roll up it's granny's buds (Granny's)\n\n[Verse 1]\nThugger Thugger tatted like fuckin' vatos\nThese fuck niggas country done craze them tacos (Ha)\nI got weight if you in need of colossal (Colossal-lossal)\nMPA done came with us, cop 'em\nHe tried to front me all them bricks and bells\nIf I ain't had spots, I would've been in jail (No way)\nI don't look like Lil Jon, but I'll scream and yell (Yell)\nI drop them bands on, I'ma design her specs (And what?)\nI catch your girl and she have the finest sex (And what?)\nShe a stoner, she cut her molly with her X (And what?)\nShe was like \"What I gotta to fuck your dawg?\" I'm like \"Fetch\"\n\n[Chorus]\nI hit your ho straight from the bizzack (Why?)\nYoung Thugger Thugger came at your neck ([?])\nGuapo my nigga, he get rinnacks\nFuck niggas stealin' swag, boy, bring back (Bring it back, bring it back)\nBoolin' in the lobby with cousin Buzz (Gang bangers)\nI'm a young pimp, where the fuck is my mug?\nPlus I'm redder than the hollywood rug (Suwoo)\nEvery time I roll up, it's granny's buds (Granny's, granny's)\n\n[Verse 2]\nShe wanna meet me at that water (What?)\nShe want Young Thug to take that water (What?)\nYou know I'ma take the water\nYou know I'ma drank the water\nNow you can't catch me in no magazine (No way)\nBut I'm ridin' round with the prom queen\nYoung Thug crooked, he need alignment (Skrrrt)\nI hide that dick, she gon' go and find it\nI had a couple play lined up for her (Lined up for her)\nAin't talkin' cars, but I bought her Tom Ford (Bought her Tom Ford)\nShe say \"How I look?\" and I reply \"Gorgeous\" (Gorgeous)\nIf I weren't rappin', I'd be locked up for forgery (Get that cash)\n\n[Chorus]\nI hit your ho straight from the bizzack (Racks)\nYoung Thugger Thugger came at your neck (No way)\nGuapo my nigga, he get rinnacks (Young Guapo, Young Guapo)\nFuck niggas stealin' swag, boy, bring back (Bring it back, bring it back)\nBooling in the lobby with cousin Buzz (Hey)\nI'm a young pimp, where the fuck is my mug? (Hey)\nPlus I'm redder than the hollywood rug (Hey)\nEvery time I roll up it's granny's buds (What?)", "image": "https://images.genius.com/717461618e785def35d07de6484b7ad4.1000x1000x1.png"}], "artist": "Young Thug"}