{"songs": [{"title": "I’ll Die for You", "album": "The Big Doe Rehab", "year": "2007-12-04", "lyrics": "[Intro: Ghostface Killah] + (sample)\n(What did I do? Was the thing so bad?) It's like...\nYo, there ain't too many people I would die for\nThat I would lay down for, you heard...\nIt's like my family, my closest friends that's here in my circle\nYouknowImean? My moms and 'em, my babies, man\nThat's word to mother, son, that's what it is...\n(I'll die for you, I'll die for you) Uh-huh...\nThat's right, man (I'll die for you) Just some real shit...\n\n[Ghostface Killah]\nAiyo, I'll die for the prophets and I'll die for the Lord\nOn the battlefield, wounded badly, holding a sword\nWith no questions asked, I already know, it's all for the cause\nJust laying me facing the East, when I'm under the floor\nI might've sinned in the process, from being, in the projects\nEyes swept from all the anger, that could've fucked with my conscience\nAnd more or less, I'm a man of my word\nMy body is holding a couple scars on it, though I was never a bird\n\n[Hook: Ghostface Killah] + (sample)\nFor Martin Luther and my brother Malcolm (I'll die for you)\nAnd my ancestors picking cotton (I'll die for you)\nMy close homies that get it popping (I'll die for you)\nYou what time it is, nigga what?\n\n[Ghostface Killah]\nAiyo, I'd die for my moms, and I'd die for my kids\nIf you, really my Queen, then I'd die for my wis\nEven my mans, if we that tight\nJump in front of a biscuit, snuff money with all of my mics\nOr we can brawl it out and take his life\nBy taking his gun, no problem\nJust make sure we eating when we on the run\nLike slaves that's chained together, who killed master?\nThe dogs is coming, the pigs is gon' blast ya\nI'd die for you, I'd die for my brother\nDie for the babies who can't eat with bare feet who need they mother\nI put niggas lights out like Con Ed, my verbal is bond\nMy bread'll blow you, show you who's real with the arms\n\n[Hook: Ghostface Killah] + (sample)\nDog, you want revenge on that devil Satan? (I'll die for you)\nWe could do it now instead of waiting (I'll die for you)\nWe don't have to wait for revelations (I'll die for you)\nWe'll sort this out in other conversations\n\n[Ghostface Killah]\nYo, I'd never jump out the window, lose my life for a lame ass nigga\nThat scene is bogus, it's not in the picture\nYou just can't feed me anything like \"Yo, Tone it's beef\"\nExpect me to go all out, jump in and bust my heat\nFirst off, bruh, you not my peeps\nYeah, I know we from the same town and shit, but we ain't that deep\nWe never stuck nothing, oxed something, ran together, popped something\nI thought ya team was wolves, cocksucker, stop fronting\nYou barking like you got the town in a smash\nI'd never lay down for you, faggot nigga, you ass\n\n[Hook: Ghostface Killah] + (sample)\nWop them niggas that be yelling that (I'll die for you)\nWhen they broke you be heating that (I'll die for you)\nJust stick 'em for they packs, they be crying (I'll die for you)\nAnd just bitch mothafuckas burn...", "image": "https://images.genius.com/f1bbc70540da138c70debc041f381d0f.1000x1000x1.jpg"}], "artist": "Ghostface Killah"}