{"songs": [{"title": "Playing With Fire", "album": "Tha Carter III", "year": "2008-06-10", "lyrics": "[Intro]\n(StreetRunner)\n\n[Chorus: Betty Wright]\nSo you've got so many diamonds\nYou wear all the finest clothes\nAnd your grill is shining\nAs you're driving down the streets of gold\nBut you can't blame me\nIf I set this stage on fire!\n\n[Verse 1: Lil Wayne]\nMomma always told me I was crazy\nAnd my hoes say I'm amazing but I don't listen to a lady\nBut the bitch say I'm hot, and I say \"No bitch, I'm blazing\"\nLike, what the fuck you expect? I'm a motherfucking Cajun\nI feel caged in my mind, it's like my flow doing time\nI goes crazy inside, but when it comes out it's fine\nLike wine; wait, watch...\nSee? I get better with time like a watch\nOsh B'Gosh, Posh Spice husband\nCouldn't kick it like I kick it, bitch, I Kix it\nNo cereal, like a landing, I sticks it\nWherever she asks me, after she licks it\nThat's too explicit, well why you listening?\nI smell smoke, and something's sizzling\nThat's her pussy, so, hey, pussy—play with pussy or play pussy\n\n[Chorus: Betty Wright]\nBut you can't blame me\nIf I set this stage on fire\n\n[Verse 2: Lil Wayne]\nThey say you're nobody till somebody kills you\nWell, where I'm from you're nobody till you kill somebody\nAnd you know what they say, when you great\nIt's not murder, it's assassinate\nSo assassinate me, bitch\n'Cause I'm doing the same shit Martin Luther King did\nChecking in the same hotel, in the same suite, bitch\nSame balcony, like \"Assassinate me, bitch!\"\nIt's Lil Tunechi\nI don't rap, I film movies\nWith my rap, you could call me\n\"Mr. Director's Chair,\" yeah, and that's a wrap\nCut! On to the next\nNot the next scene, bitch, the next check\nSome say the X makes the sex 'spect\nSo play with the pussy or play pussy\n\n[Chorus: Betty Wright & Lil Wayne]\nSo you've got so many diamonds (Hey pussy)\nYou wear all the finest clothes\n(Lay pussy, do what I, say pussy\nAnd I say, I say, lay pussy)\nAnd your grill is shining\n(Lay pussy, lay pussy, haha, hey pussy)\nAs you're driving down the streets of gold\nBut you can't blame me\nIf I set this stage on fire!\n(Hey pussy, don't play pussy\nGet 'em!)\n\n[Verse 3: Lil Wayne]\nStraight off the corner of Apple and Eagle\nBraveheart, bitch, like the times are medieval\nMarried to the game, divorced the cathedral\nStanding on the corner selling porcelain to people\nForced into evil, it's all in your head\nIt's all so cerebral, call me Knievel\nYou follow and I lead you, straight to the needles\nThe bottles, the battles, the beetles'll eat you\nMomma named Cita—I love you, Cita\n'Member when your pussy second husband tried to beat ya?\n'Member when I went into the kitchen, got the cleaver?\nHe ain't give a fuck, I ain't give a fuck neither\nHe could see the devil, see the devil in my features\nHe could smell the ether, you can see Cita\nYou can see the Cita, see the Cita in my features\nAnd she don't play, neither\n\n[Chorus: Betty Wright]\nBut you can't blame me\nIf I set this stage on fire!\n\n[Outro: Lil Wayne]\nC3, 3 peat", "image": "https://images.genius.com/70a7ef69242915a9cd1c3f68031e4c0a.1000x1000x1.jpg"}], "artist": "Lil Wayne"}