{"songs": [{"title": "Words 2 My First Born", "album": "Until the End of Time", "year": "2001-03-27", "lyrics": "[Intro: 2Pac]\nHehehe, yeah\nThese are my words to my firstborn\n\n[Verse 1: 2Pac]\nCan you picture young niggas in a rush to grow?\n'Til hard-timers in the pen' had to crush his throat\nProbably never even saw it comin'\nToo busy bullshittin', caught him with his mouth runnin'\nAin't this a bitch? They got me twisted in this game\nThe feds and the punk police pointin' pistols at my brain\nI wonder if I'm wrong 'cause I'm thugged out\nMy homies murdered execution style, runnin' in the drug house\nWhat was supposed to be a easy hit\nNow shit is flipped,'cause niggas died over bullshit\nIt's not my dream, I'm seein' pictures of a broken man\nNo witnesses only the questions of who smoked the man\nYoung adolescents in our prime live a life of crime\nThough it ain't logical, we hobble through these tryin' times\nLivin' blind—Lord, help me with my troubled soul\nWhy all my homies had to die 'fore they got to grow?\nAnd right before I put my head on the pillow, say a prayer\nOne love to the thugs in Heaven, I'll see you there\nIt's written for the young and dumb that wasn't warned\nHelp you make it through the storm\nMy words to my firstborn—feel me!\n\n[Hook: 2Pac]\nMy words to my firstborn\nMy words to my firstborn\n\n[Verse 2: 2Pac]\nSince my very first day on this Earth, I was cursed\nSo, I knew that the birth of a child would make my life worse\nAnd though it hurt me, there was no distortion\n'Cause wild seeds can't grow, we need more abortions\nQuiet your soul, 'cause you know what you had to do\nAnd so did victims of a world they never came to\nI understand it's a better day comin'\nSometimes cats be sleepin' on the dead end, drivin' with the car runnin'\nBlinded, ain't no love in the hood, only hearts torn\nLove letters to the innocent and unborn\nAll the babies that died up on the table\nWasn't able to breathe, 'cause the family wasn't able\nCan't blame her, I would do the same\nAll I could give her was my debt and my last name\n'Cause in the game things change, livin' up and down\nThis hard life got me walkin' with my head down\nFlashin' frowns wasn't meant to be, was I wrong?\nBut I'll never get to know, so I carry on\nIt's written for the young and dumb that wasn't born\nMy words to my firstborn—feel me!\n\n[Hook: 2Pac]\nMy words to my firstborn\nMmm! (Yeah)\nThese are the words to my firstborn\nHey, nigga, talk to your born!\nTalk to your seed, nigga!\n\n[Verse 3: Above the Law]\nTwo thousand somethin' somethin' mention a new era\nA nigga's too real, now see shit too clear\nSee, there's more than just this scrilla and this tilt\n(What else is it, dawg?) – the velvet and the silk\nAnd makin' sure my kittens got they milk\n(Hoo!) Gotta fill this mattress\nLet my kids know I'm at this\nAttack this, the Mack must roll, hood stroll\nAin't no question, is it? Above the Law hustlers\nIf it's related to chips, homie, we'll handle ya\n\nYo, although we never take advantage\nThough we always into ery'thang\nBy all means, stack green, gangsta lean\nThey say money make the world go 'round\nSo, only associate yourself\nWith paper chasers and niggas that's truly down\nAnd keep God first\nAnd give thanks for the good times, as well as when it hurts\nIt's player haters every corner you hit\nTouchin' their tits, hella thick, tryin' to get you for yo' grip\nI know you stressed-out and fed-up\nBut come out, gun-blazin', and keep yo' head up\nYou can call it what you want to, but it ain't gon' change\nAbove the Law, 2Pac, O.G.'s in this rap game\nAnd we done lived a long hard life\nAnd we done shed so many tears under these bright lights\nY'all, although we grew up corrupted and scorned\nWe still got a lot of wisdom to give to our firstborn\n\n[Outro: 2Pac]\nWhat you gon' tell your kids, nigga?\nWho was you? What was you doin'?\nHow did you put it down?\nThese my words to my motherfuckin' firstborn\nSo, they can know, y'knahmean? Hehehe\nAin't nothin' but a motherfuckin' rider\nWestside 'til I die, that's all it was\nIt's a crooked-ass hand they deal a motherfucker\nI just played to win, just played to win\nMotherfucker gotta bet against the odds, y'knahmean?", "image": "https://images.genius.com/74b94f4112372859edd6ae711af0df41.1000x1000x1.jpg"}], "artist": "2Pac"}