{"songs": [{"title": "Fortune & Fame", "album": null, "year": null, "lyrics": "[Intro: 2Pac]\nAnd my niggas say, we want the fame!\nC'mon\n\n[Hook: 2Pac & Kokane]\nOne thing we all adore\nSomething worth dying for\nNothing but pain, stuck in this game\nSearching for fortune and fame\nOne thing we all adore\nSomething worth dying for\nNothing but pain, stuck in this game\nSearching for fortune and fame\n\n[Verse 1: 2Pac]\nThough we exist to breed, some believe currency comes to G's\nStress is half the battle, with success comes greed\nThey got me hot when they shot me, plotted my revenge\nTo increase my ends, enemies gettin' dropped\nWin or lose, red or blue, we must all stay true\nPlay the game, nigga, never let the game play you\nAnd for the fame, niggas change fast, that's a shame\nWhat's to gain, lost souls? Who controls our brain?\nWho can I blame? The world seems strange at times\nSomewhat insane, I'm hopin' we can change with time\nI'm livin' blinded, searchin' for refinement curse\nI know, death follows me, but I'll murder him first\nAnd worse yet, with each breathe, steps I take, breathless\nIs there a cure for a hustler with a death wish?\nCigar ashes, toast with crystal, glasses\nWe mash on them jealous bastards, with my ski mask\nI'm the first one to want him blasted\nWrapped in plastic, bullshittin' got his ass hit (Outlawz)\nAin't nothing left now, treated like a stepchild was not for me\nNothing but busters and bitches be rockin' beats, fake in fame\n(Fuck 'em all)\n\n[Hook: 2Pac & Kokane]\nSomething thing we all adore\nSomething worth dying for\nNothing but pain, stuck in this game\nSearching for fortune and fame\nSomething thing we all adore\nSomething we dying for\nNothing but pain, stuck in this game\nSearching for fortune and fame\n\n[Bridge: Kokane]\n[?]\n\n[Collision: 2Pac]\nDouble up nigga double up\nIt’s my cell nigga, it's my cell\nHahahah yeah\nOh yeah you got that chicken, nigga?\nEh do, how that shit hook up, though how that shit hook up?\nCan I get some?\n\n[Verse 2: Kokane]\nI love that ghetto shit (that ghetto shit)\nI love that 2Pac shit (that Pac shit)\nI'm that nigga out yo' window eating chicken out yo' caddy shit (shittt)\nWe write this song to make you kill motherfuckers (fuckers)\nSmash motherfuckers (fuckers)\nJust to see ya cluck clucka (clucka)\nI'm not just a rapper I'm a dope dealer (dope man!)\nAnd I Ignorant motherfucker spray cap peeler (cap peela)\nIt's like bass (bass!) How low can you go? (go, go, go)\nI'll have to move my yay across San Di-ya-yo (ya-yo baby)\nWestcoast, tax free, money is a bitch (beotch)\nThese out of state niggas get mad 'cause we rich (hahaha, richhh)\nPick up a super chicken bac-ca (bac-ca, bac-ca)\nHe said selling 28 and a hundred\nBy mail...\n\n[Verse 3: E.D.I.]\nFor the fame (fame) The notoriety\nTo be well-known (well-known) in this society\nTo have everybody eyeing me\n'Cause when I rise up my block mane, my cost is to floss\nI'm making up for all the times, that I floss to be lost (floss to be lost)\nI scream, (scream) 'til I was lost forever, nobody came (fame)\nSo on this day forth, I'ma die for the fortune and fame (fame)\nBeen on my name (fame) where were all these years that I walk this earth\nWent for all mine (we search for fame) especially been cautious since birth\nRemain the same, since the day I came (fame), will never change\nEven though I live my life hellishly (fame) for all this fame (fame)\n\n[Verse 4: Kadafi]\nBlock fronters shoot slugs we throw 'em back like hardballs\nWithout the gloves\nNo love for these fake desperadoes and thugs (hahaha)\nI bleed to envy\nSmoke and blow out they blunts sipping Henny\nDrunk nights And high days\nCocking my heat shooting it sideways\nA life on the run (ey look out, look out)\nFull of common blunts unconditionally married to my gun\nFulfillin' my destiny for needs and ones desires\nBe pulling all my cabbage like pliers\nStuck in the trance searching for something higher\nThan fortune and fame\nHahaha\n\n[Hook: 2Pac & Kokane]\nSomething we all adore\nSomething we dying for\nNothing but pain, stuck in this game\nSearching for fortune and fame\nSomething we all adore\nSomething we dying for\nNothing but pain, stuck in this game\nSearching for fortune and fame\n\n[Verse 5: Spice 1]\nI don't want to live forever, it's do or die\nI'd be a dead nigga talking gangsta S.P.I\nNiggas don't want me to be up in they system when I'm deceased\nTalk shit about when I'm up in the coffin nigga you'll rest in peace (well alright)\nMotherfucker, I die for this shit, I got a lot ridin'\nSome niggas be backslidin', some niggas fall off and go into hidin'\nSome niggas be players up in the game five years\nSome niggas be making one platinum album\nThen be gettin' disrespecting O.G. peers\nMotherfucking hard since I was fo-teen, partners (fo-teen partna)\nSome niggas be laying up in them streets, broke 'em off somethin' proper\nHaters may try to take your soul cold-hearted ass niggas\nGotta ride with two twin Glocks, gotta sleep fingers on triggers\nNiggas don't want to see you have nothing, so have something\nAnd if a nigga run up on you, put a slug and get to dumping nigga\nFame...\n\n[Chorus: Kokane]\nSomething we all adore\nSomething we dying for\nStuck in this pain, stuck in this game\nSearching for fortune and fame\nSomething we all adore\nSomething we dying for\nNothing but pain, stuck in this game\n\nNothing but pain...\nStuck in this gaaaaaame", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}