{"songs": [{"title": "Representin’ 93", "album": "Strictly 4 My N.I.G.G.A.Z...", "year": "1993-02-16", "lyrics": "[Intro]\n\"I got a head, but ain't no screws in it\"\n\n[Verse 1]\nRoll up and get swoll up, hold up\nHow ya gonna play me like a sunkin dunkin donut?\nI ain't came a long way to get checked\nSo give me respect when I get wreck\nOr get your motherfuckin chin checked\nOnce again, it's your friend outta Oakland\nHoping I can rock the shit to get ya open\nSay your looking for some real shit\nThen catch a funkified batch, like that!!\nOakland's on the map\n2Pac is on the big screen strivin\nGotta love a nigga for survivin\nI wear alot of old schools jewels\nLook how the fools drool, ooohh\nStop lookin at me hard cause you're buffer\nBut I'll just buck them bigger motherfuckers\nTurnin men to suckers\nNiggas wanna start a little ruckus\nBetter duck cause I'll be poppin' them motherfuckers\nThey wanna throw their hands up, that's tight\nHit em wit my eight, never had shit left, right\nThen hit em wit the uppercut, duck quick\nShit outta luck, fucked and stuck with that rough shit\nFuck a pop song, fuck a video, fuck Arsenio, fuck the radio\nDo you hear me though?\nGive a holla to my niggas in the pen\nAnd my murderous partners wit their Mac 10s\nI represent the real cause I'm ill, G\nGlock cocked the day they kill me\nI'm representin'\n\n[Verse 2]\nPeace to Redman, Treach, Vin Rock, Kay Gee the great one\nMary J. Blige, Pete Rock and Troy, the late son\nHeavy D, CL Smooth, and Queen Latifah\nToo Short, Tony Toni Tone, LayLaw beat cuts\nEd, the special motherfucker and the Lover\nThe Tribe, A Tribe Called Quest, and Jungle Brothers\nDas EFX, EPMD, and Ice Cube\nHouse of Pain: funky blunted ass white dudes\nCypress Hill, yeah, the ill niggas\nDigital Underground: my real niggas\nRaw Fusion, Organized Konfusion\nWicked and the Mouse Man, Spice 1 and Pooh Man\nTLC, Eric B., Rakim, then Scarface\nStretch, Maj, K-Low, pumpin the Squad's bass\nThorough Heads, Poonannynans, The Click\nE-40, The Governor, and Richie Rich\nYoung Guns in the house pumpin the flava\nDJ Ditch for their behavior\nOff the head, my freestyle flow\nJust a couple of motherfuckers that I know\nI'm strictly representin\n\n[Bridge]\n1 motherfucker, 2 motherfucker, 3 motherfuckers\nDamn, who did I forget?\n\n[Verse 3]\nI'm a soulja, daddy was a soulja\nStrong in the struggle\nMust contend so it's on\nRaised in a house full of bad motherfuckers\nMad motherfuckers\nNever had so we grab from the stacked motherfuckers\nNow they know me, the homies\nRaised by some crazed ass well payed OG's\nAh shit! Pulled up in a benzy, snatch\nThe wheel as I peel out. Catch a cop's tail\nRock shells hit. Raise a fist so they know to make a hit\nCan I flip it? I may get wicked as I rip it\nTo get specific: If the shoe fits, then kick it\nIt's for the gifted, pump your fist if you wit it\nHere's your ticket to see Mr. Wicked rip shit\nNow they wanna ban me (Told ya)\nAll I wanted to be was a soulja\nBang bang boogie, it's a stick up\nQuit now, nigga, eat a dick up\nHuh, I'm representin'", "image": "https://images.genius.com/fb1da91ac989d8c57dfce412441800da.953x953x1.jpg"}], "artist": "2Pac"}