{"songs": [{"title": "BET Shady 2.0 Cypher", "album": null, "year": "2011-10-11", "lyrics": "[Intro: Eminem]\nWelcome to Detroit\nThis is the BET, Shady 2.0 Cypher 2011\nMyself, Slaughterhouse, and Yelawolf\nWhite Dawg, get 'em!\n(Thank you, cracker king!)\n\n[Verse 1: Yelawolf]\nPut these mothafuckas in a box, then I send 'em away\nPut 'em in a gray 'llac and pop the trunk\nAnd throw 'em in the back, jack; ha, dig 'em a grave\nPut a brick inside that Xerox when I print up a page\nMovin' keys I can relate, 'cause I live in the cage\nI throw up the A, I take 'em to school, I give 'em a grade\nAn easy E for effort; that's WWA\nWhite with an attitude, alphabet soup is on my plate\nAll I got is Z's, they sleepin' on me, I can't get 'em awake\nI spoon-feed 'em a sound in a room full of deceivers and clowns\nWho believe in makin' it rain 'cause all they see is the clouds\nAnd I watch from the couch of the VIP like a potato\nWith a bunch of meatheads like, \"Fuck it, I'll just feed 'em a cow.\"\nPlenty of white boys to pick from this year\nBut before you pick a pepper, you better pick up your heater\n'Cause even Peter Piper could pick up a mic\nBut what it's like to pick a fight with me\nIs like puttin' Nikes on a cheetah\nBetter speed up, or at least in my case Adidas\nI'm out this bitch, drinkin' Sprite by the two-liter\nHoller! Shady Records…\n\n[Verse 2: Joe Budden]\nSay I'm from the new school\nI'ma say, \"Check your tone and watch your mouth!\"\nIf they teachin' how to Dougie, I'm condonin' droppin' out\nForced to wild, y'all birthed me, then gave me up\nI just perfected being hip-hop's foster child; now check it\nDon't blame y'all for being trash, fans are coppin' it\nThe radio's the crime scene, the masses are the hostages\nIn my youth I'd throw shots, the fad was dodgin' it\nI'm grown, I ain't watchin' the throne, I'm sabotagin' it\nYou see that four-headed monster in the storm looms?\nSnipe 'em from a distance; the scope got a long zoom\nYou Super Mario thugs is in the wrong room\nGotta figure here you won't get bigger if you on shrooms\nIf it was left to me, I'd revive what the game be 'bout\nI'd have took the wine outta Amy house\nEnough raps from you scrub cats 'bout cockin' a snub back\nWayne couldn't teach me how to love that\nBut I got this chick from uptown, she my summer bunny\nBoth parents broke, but she come from money\nThink my bread is her paper to burn\nSo I lock her out, and now she doubt David is Stern\nShe's so bad, I make her hit the telly from a taxi\nThen dead her in the Holiday Inn, learned that from Max B\nThat's why the haters envy, kinda wanna send me llamas\nI made it right before their eyes, like I was Benihanas\nIs it me, or is what I'm hearing just pitiful?\nAirwaves the same, now the stereo's typical\nMy skin's thick, so the critics ignored\nSo unafraid to die you'd think I did it before\nThe boy's Rodman with the trash talk\nMagic or Walt with the black ball\nWay I bounce off the asphalt with cat paws, glass jaw\nHood of your mask will be the Blackfoot with no passport\nBody be found in a mansion in one of my trapdoors\nIf punks had award you status whores categore\nProbably be that of awards\nBetween Michael Rappaport and Kenny Lattimore\nI know hip-hop's alive and well\nIf it died, you other crews wouldn't survive the smell\n\n[Verse 3: Crooked I]\nI spot a victim, the plot'll thicken when the clock is tickin'\nI caught him slippin', I gotta give him a shot, I hit him\nWith proper spittin', hottest writtens and compositions\nSo competition's a contradiction\nSomebody mention they got a Crooked, highly fiction\nWe probly different, got Gotti henchmen\nOpposition, I'll body quick as Bugatti engines\nI'm on a mission to get richer, the sickest lyric-kicker\nDiggin' a ditch for different spitters\nWeak lyricists get disfigured\nSip liquor, spit like a sick mixture\nOf Notorious, Pun and L; get the big picture?\nThe poster, I'll roast ya\nMy mind so deadly it's just like the beanie is close to a holster\nIt's over, control my whole coastal region\nLike I'm supposed to, flow is goin' postal even\nOpen season, heart close to freezin'\nRuthless as Eazy, nigga, approach, I'm squeezin'\nBelieve me, dopest West-Coaster breathin'\nSo most y'all hope I'm vegan; nope, I'm beefin'\nRappers need to keep it trill, give me a beat to kill\nToo many people still eatin' sleeping pills\nPeople sleepin' on my ether skills\nAnd y'all ain't even real, you 'bout to die in this cypher\nBefore you die you should do the Jada and leave a will, for real\n\n[Verse 4: Joell Ortiz]\nI ain't a rap dude, I'm a dude who rap\nBefore this I was movin' crack\nKillers y'all become when y'all rhyme, I salute and dap\nAnd if I blink, they'll remove your snaps\nYou ain't cool, you wack, with your foolish act\nSkinny jeans don't mean your ass shoot\nIt means your booty claps\nDon't play like Tyler Perry\nThis the Slaughterhouse of pain, flow brown, tight and heavy\nWhen it come to 16's, I'm a fiend\nSeen in the studio near a needle with a mean lean\nProbably writin' bars to Nas' \"Thief's Theme\"\nGettin' my Yaowa on\nMan, all these Olajuwons, we the dream team\nThis is an all day slaughter\nThey fiendin' for us to break, like Beyonce's water\nThe four quarters doin' all the eatin'\nAnd y'all gotta know why I made the cut, I'm Puerto Rican\nOrtiz keep the fire ready; and tryin' to put me out\nIs like tryin' to steal a transvestite from Eddie\n\n[Verse 5: Royce Da 5'9\"]\nI'm do-or-die dope, and you can make the sticker sittin' on the door of that Phantom your suicide note\nHi, Rihanna! Is Nicki livin' with you?\nLet me know so I can buy binoculars and telescopes\nHi, Rihanna! I don't need to know you better\nYou tell me you love my music again, we go together\nBye, Rihanna! Now back to y'all fools\nWe rock out, like the outside of a guitar school\nThousand dollar frames I prefer to see the world through\nDon't ask me nothin' about Budden, I beat my girl too\nYou ask me why do I keep her, I say it's cheaper to\nThat's why I ride around in a Rolls, like Wiz Khalifa do\nRappers, I'm your daddy, I tell you straight as this\nYou don't kill, but your father will, like Jayden Smith\nI tell you like I tell my Spanish chick\nYou fly, but I ain't going down on no landin' strip\nSo get your wax on, like Daniel San, or I'ma have to run\nLike De la Hoya in drag when cameras come\nPoint out the greatest rapper alive, I'll headshot him\nSmack his girl on the butt and buy her some red bottom\nBring every deceased rapper back to see his wife\nWhile I'm cyber-sexin' with Jessica Alba via Skype\nI’m on my D-boy, Deebo thing\nSpiritual steelo swing, like Cee-Lo Green\nGet out the camera with your B-Roll bling\nYou know your flow is wack\nWe cornered the market, like a Wal-Mart in a cul-de-sac\nYeah, this is what two million singles sold\nAnd an album that's gold\nLook like without having to sell your soul\nNickel!\n\n[Verse 6: Eminem]\nAyo, lyrical miracle, spiritual individual, criminal\nSubliminal in your swimming pool… (Boooooo!)\nYou're 'bout to see peace destroyed, it'll never be restored\nWhen I unleash these beastly hordes on your CD stores\nWanna stop it? You gon' need a priest, at least three swords\nA license to ill from the Beastie Boys\nThree Ouija boards, and a squeegee, and please be warned\nDon't ask what the squeegee's for\nOr the holy water, acid raps that'll eat these floors\nEat a hole in a rhyme book, you see these horns?\nAnd as for me, you ask when I'm gone, will he be mourned?\nIs puke lukewarm? Should Casey Anthony do porn?\nCan that chick fit a newborn dead baby inside a frickin' shoebox with a shoehorn\nSmothered in chloroform, so she can go get her groove on?\nCan she duct-tape and Velcro a fetus?\nJoell, yo, tell Joe I need his\nEmpty box from his old shell-toed Adidas\nSo I can put these babies in a fetal position\nThey're gettin' elbows to the penis\nYeah, big deal, I took some little kid's Big Wheel\nAnd spit in his frickin' big kids meal\nQuit tryna bite me and pinch, you wench, sit still!\nDid you just put your six-inch heel\nThrough my Benz windshield?!\nIs it dust we 'bout to kick up?\nCan Yelawolf fit a fifth of rum in a big cup\nBetween his stick shift in his frigging pickup\nAnd drink like a hick redneck hillbilly will 'til he gets hicc-ups?\nFlippin' the script up, like Mike Vick\nGettin' bit in his junk by a Pit, yup, I'm a sick pup\nI'd be a horrible magician, 'cause I'd fuck a trick up\nFix your lips up to say somethin' fly, or zip up!\nAye, B, let's see: you said you were gonna do X-Y-Z\n'Til you fuck around and get dropped\nLike an E when you add an I-N-G\nDon't put a K in front of that, though, when I MC\n'Cause I'm not the king of this microphone booth\nIt's more like a phone booth\nSuperman in this bitch, Kryptonite won't do\nIt gives me more power\nI bump the Fat Boys and eat rat poison, take meteor showers\nFresh outta the mental hospital\nAnd me not flossin' a middle finger while I hop in a mosh pit\nWill be like Nas doin' gospel or R&B—you crazy?\nMe pushin' up daisies, that thought is impossible\nAs if flashin' across the news\nPosdnuos was caught with a prostitute\nWith a huge johnson, boobs and a monstrous tube\nOf lube, and a bra, some boots\nSome panties, and an aqua blue Mazda\nSwallowin' a popsicle, playin' tonsil pool\nSo kill the rumors, it ain’t happenin'; I’ma rap 'til I'm fossil fuel", "image": "https://images.genius.com/9178189c280471861b16738ba457bcbe.500x500x1.jpg"}], "artist": "Eminem"}