{"songs": [{"title": "Shaolin vs Wu Tang", "album": "Shaolin vs. Wu-Tang", "year": "2011-03-07", "lyrics": "[Kung-fu sample]\nMaster!\n*sounds of fighting*\nToad style.. hmmph\nThe Shaolin deliberately tried to use the Lord\nTo learn our Wu-Tang sword fighting!\nThe Shaolin would never do that!\nWouldn't you? The Shaolin have always looked down at us\nAre you afraid the Wu-Tang would become more famous than you?\nYou?\nSo you used your Shaolin poison to set up my master and deliberately frame me!\nThat's nonsense!\nIt's not nonsense! I saw it myself!\nNonsense! The Shaolin have nothing to fear from the Wu-Tang but our swordfight\n\n[Intro: Raekwon]\nAiyo! Come on! Let go of the ratchet, son, come on, let's go! Come on!\n\n[Raekwon]\nVillagers, gangstas, pillagers, paintbrush\nNew whips, blue fifths, Louis Shallah, bitch\nOstrich turtlenecks, the Chef, already reps\nLean off the petty jets, we buy the very best\nOutfits, powerful rich, pouncers, camel clips\nOne bump, two lumps, the shotgun, the new jumps\nWith flying bird, buying herb, new kick, designer birds\nShe on, and we up, let's re-up, and free'd up\nJakes hate it, Rae made it, Clientele, we gon' sell\nYou gon' starve, he gon' jail, night boots, swim with whales\nBetter snub, surgical leather gloves, never loved\nWe gon' kill, take it to the Hill, we forever real\nOld records, old luggage, you ill with no rugged\nYou shoot and we spray, kill off them old buzzards\nWe love it, can't stand it, you hid, the The Wu Manual\nWe found it, stay grounded, we will, we still scrambling\n\n[Kung-fu sample]\nHold your fire!\nYou two traitors!\nYou've mixed the Shaolin and Wu-Tang\nNo, we have not, it's just that they're the same\nThat's right, my Lord\nYou misunderstand our kung-fu work\nIt doesn't belong to anybody, IT EVOLVES!\nKill 'em!\n\n[Raekwon]\nThe wrist lifter, the grave sitter, babysitter\nThe jar twister, open the vault, call your sister\nThe Pyrex, the up in the five, live as Twister\nBlunt rolling, only a robe on, some whiskers\nKnee slapper, the gat packer, blackjacker\nExtortionist, friendly as fuck, Bob and Back-lur\nOnes folder over the stove, gold rover\nThe gear dresser, the chop bagger, Marvin Haggler\nRap stabber, eat you alive, gold tarantula\nSixteen paces and shit, hold the heckler\nPimp style, Axel Foley, stolen Rolly\nAll ya niggas that know me, ya'll owe me\n\n[Kung-fu sample]\nI don't give a damn! Listen\nHahaha, And I'll kill anyone, who dares to go against...", "image": "https://images.genius.com/bd1e2ea326f22bdcaa7332457249e1c5.1000x1000x1.jpg"}], "artist": "Raekwon"}