{"songs": [{"title": "B.L.O.W. (Block Life Is Our Way)", "album": "Rise To Power", "year": null, "lyrics": "[Intro]\nPusha T:\nWoman: How do I know Daddy this stuff's goin' scary\nRick Ross: Yo Papo\nPusha T: Yeah\nRick Ross: Mira, Yo Papo\nPusha T: Yo come out nigga, where you at man?\nRick Ross: Over here yo\nPusha T: All right, let's stop playing games niggas\nRick Ross: I got that stuff man\nPusha T: OK cool I want all that shit nigga\nRick Ross: Yo, you can have everything if you want it man\nPusha T: ? nigga, how much nigga?\nRick Ross: 3 million B\nPusha T: OK. You gotta give me a minute on that ? nigga\nRick Ross: OK, no problema\nPusha T: Yo put all that shit in the truck baby\nWoman: OK Daddy\nRick Ross: Mira, Mira ...\n\n[Verse 1: Rick Ross]\nTeflon sicker than most, sick-nature flow\nI won't battle for the block rick spit for your coast\nI'm handling with narcs they let me sit on the coke\nGodfather in a dark shop mob niggas gettin' the vote\nTwo-piece cufflinks killing the coat\nOn my feet for the baking but I sit with a toast\nMy women on the bitch naked or get dick in the boat\nFresh food in the Benz and I'm deepin' the throat\nTop down ocean drive and I'm chiefin the drought\nStart ten top fuck 'em cuz I'm speaking the coast\nSecond week out, damn creepin' on go\nWe still deep in the hole, keep dicks pickin' on blow\nThey escorted by the killers for that beef on the row\nThey pretty cheap too get put to sleep at the show\nBack at the stage I'm conscious with an object in the back of the braze\nI master the trade, since back in the day\nPackin' the gauge, quit acting afraid\nIt's a package exchange, for my niggas back in the classical days\n\n[Hook]\nUp in the block I'm still hustlin'\n? fro the streets ??\nGettin' no answer it ain't nothin' man\nI wasn't on the go ?? strugglin'\n\n[Verse 2: Pusha T]\nRoll with the winners, the soul of the sinners\nWe drain with ? the limmers\nMy uncle's before me\nMix the dizzle in the blenders\nThen crack came I seen the coldest of winters\nMountains of snow, may fiend strimmer\nMinks to the flow we used to Crème de la crèmes\nSuch a need to shimmer the Benz got the slippers\nClub owners love us call us yellow bottle grippers\nFlipper, no whale scale tipper\nI'm from the line ex-kingpins to turn sniffers\nPray the lord forgive us while the maricons fill us\nUp to the brim call 'em the coffee bean spillers\nBlast from us he call keys gods pillows\nI re-write bury me in my chinchilla\nAin't non iller no, ain't non realer\nIt's Pusha, just your neighborhood dope dealer\n\n[Hook]", "image": "https://images.genius.com/29b46b5e6777c0cfddcc1b604d7a2597.600x600x1.jpg"}], "artist": "Rick Ross"}