{"songs": [{"title": "True Loyalty", "album": "The New Breed (Bonus Disc)", "year": "2003-03-29", "lyrics": "[50 Cent]\nUnh, yeah..I like the way this feel right here\nYo...turn me up in the head phones just a lil' bit\nYeah..\n\n[Verse 1: 50 Cent + Lloyd Banks]\nThere ain't shit in this world deeper than loyalty and love\nExcept loyalty and love between thugs\nFor you I pull up in the whip and spray the whole strip\nFor you, I walk up close and lay a nigga's kid\nFor you, there ain't a damn thing that I won't do\nI'm a Thug, this the way I show my love for you\nNigga for you, I get the coke, I'ma turn it into cash\nFor you, if we go broke, we gon' rob a nigga ass\nFor you, if we get knocked, I'ma have to take the weight\nCause with a record like yours, doawg, you ain't staying upstate\nNigga for you, I kill a whole goddamn crew (Why?)\nCause I know you'd do the same thing too\nI ride for you, you ride for me, my enemies your enemies\nHow could you not love a thug like me?\n\n[Chorus: 50 Cent + Lloyd Banks]\nWould you ride for me?\nYou ain't even got to ask\nWould you die for me?\nNigga, they blast you, they blast me\nWould you cry for me?\nShit, when I die don't cry for me\nJust keep repping Southside for me\nWould you ride for me?\nYou ain't even got to ask\nWould you die for me?\nNigga, they blast you, they blast me\nWould you cry for me?\nShit, when I die don't cry for me\nJust keep repping Southside for me\n\n[Verse 2: Lloyd Banks + 50 Cent]\nNigga, I'm the stem, you the crack\nI'm the clip, you the gat\nI'm the Glock, you the mac\nI'm the artist, you the trap\nI'm a pen, you the pad\nI'm the Dutch, you the bag\nI'm the knife, you the stab\nI'm the driver, you the Jag\nI'm the ice, you the bezel\nI'm grimy, you ghetto\nI'm the bow, you the arrow\nI'm the shell, you the barrel\nI'm a pimp, you a player\nI'm dope, you the hustler\nI'm a nine, quiet me down, you the muffler\n\n[Chorus: 50 Cent + Lloyd Banks]\nWould you ride for me?\nYou ain't even got to ask\nWould you die for me?\nNigga, they blast you, they blast me\nWould you cry for me?\nShit, when I die don't cry for me\nJust keep repping Southside for me\nWould you ride for me?\nYou ain't even got to ask\nWould you die for me?\nNigga, they blast you, they blast me\nWould you cry for me?\nShit, when I die don't cry for me\nJust keep repping Southside for me\n\n[Verse 3: Tony Yayo]\nYou can catch me in public housing with bundles of D\nOr in the Santa Monica mountains bundled up to ski\nSince time is money I rhyme on the clock\nAnd walk through the strip with a nine in the ox\nYou see the ice, you know it's top notch\nAnd when it comes to dice I'm seeing shorty to the shot box\nBanks stop, guns pop through your tank top\nAnd leave you wet up like a sonar range drop\nWhen I grind I wear the same shit tomorrow\nWhen you grind it's Showtime at the Apollo\nDamn near every rapper gotta hot sixteen\nWell, my flow's like a hoe that's sixteen\nI ran through niggas, dismantled niggas\nThey mad 'cause they see me in Cancun, bitches\nBut I'm ghetto, straight from the hood, my nigga\nIf there's no toothbrush I'ma use my finger\nI got so many minks, and so many leathers\nThe crib is surrounded by animal protesters\nI'm a grown man, still living like I'm young\nWith the mind of an old man, full of wisdom\nHere the cops come, task force van\nRock so much ice I'm called Jack Frost, man\nAnd while we sipping on Cris' you sipping backwash, man\nYour team got heart, but your heart's in my hand\nYou want sixteen bars in song format\nOr sixteen cars on your mom's doormat - what?", "image": "https://images.genius.com/6f53516b0687bec48ba8859fb84d74bc.499x499x1.jpg"}], "artist": "50 Cent"}