{"songs": [{"title": "Ain’t Got Time", "album": null, "year": null, "lyrics": "[Verse 1]\nRolling stocky, kinda brocky on the streets where niggas watch me\nIf you plotting I'mma prol'ly get to pop at your noggin\nI'm a Hollygrove problem, like \"Follow me yeah\nCome and be my death volunteer,\"\nThat's why I'm here, I come to get that scratch\nI done been to jail twice and tell them crackers I ain't never going back, huh?\nRode through the city with the metal on my back, huh?\nGave me a shot and I sent several of 'em back, huh?\nGave me some money, they won't ever get it back now\nOne million, two million, three million: I'm stacked now\nNo more crack now, it's in the back for now\nJust in case she crack down\nI never back down, shit bitch, I might react now\nBut, 4 million, 5 million, 6 million: I'm that now\nWhere you at clown? I'm high in the sky\nYou at ground, so set down you bitch you\n\n[Hook]\nMoney on my mind, pistol on my side\nI make a nigga hide that pride\nI ain't got time for you bitches, I'm trying get these riches\nReal niggas know that vision\nI ain't time for you haters, I'm trying get this paper\nReal ladies know that labor\nI ain't got time for you snitches, I'm trying get them riches\nReal niggas know that vision\n\n[Verse 2]\nYou motherfuckers know what I'm out here doing\nAnd you ain't gotta buy it, if you not into it\nDope block influenced, blue pale light, scream\nI'm on that same ass block letting the bell ring\nLooking for the boy, the one in the back\nI could get your stomach out of your back\nI could make you shit better, this better, than what them selling\nThey need drugs no penicillin and I'm the medicine man\nYes I am him, yup-yup\nHip-hip, hoo-ray, 20 hard came today\nAnd two large was the pay, and the Coast Guard said it was okay\nBring them barge to the bay\nAnd my bitch looks like a DeBarge so I call her bait\nShe put packs in her bra, and the keys in the case\nIf she ever try to skate with the cake, and relocate\nI got her social and her birth date, bitch please\n\n[Hook]\n\n[Verse 3]\nI talk like a hustler, walk like a hustler\nStripper attitude, only money make me move\nDapper dan status, I'm the stunner part two\nI got an image to uphold, and my image do, too\nI'm off the scrimmage line like Emmitt 2-2\nWhy would the quarterback give it to you?\nI gotta hundred sacks, and a hundred women; French twist\nAnd we don't even talk, we just French kiss, I could never get pinched\nI'm rocking like a big pimp\nMomma only dated hustlers, so I could only commend them\nAnd never roll with a dummy on your hip\nHave the judge giving you a run-on sentence\nNever that, I keep the gun on for that business\nAnd when I'm not, I'm at business\nSee that's that, mad business, peep the simplistics\nIt's Cash Money, nigga, just live it\n\n[Hook]", "image": "https://images.genius.com/f903dae2533e450c8d3cb233aa846020.745x745x1.jpg"}], "artist": "Lil Wayne"}