{"songs": [{"title": "Desperados", "album": "Detroit Underground 2000 Volume II", "year": null, "lyrics": "[Intro: Proof]\nYo, ayo, turn the heads up and the mics up\nWe got the Dreadknaughts, y'knahmsayin?\nSuper MC, y'knahmean?\nBugz, Dirty and all that\nAll that shit, y'knahmsayin?\nDesperados with the cars — Eminem!\n\n[Verse 1: Eminem]\nChauvinist pig, drove in this big Lincoln\n'Til it went over the bridge\nJumped out and dove in the ditch\nBroke in a mobile home and stole a stove and a fridge\nKidnapped the parents and left the ransom note for the kids\nI'ma go for your mids, here's a body blow for your ribs\nWhile you're clutchin' your stomach\nAnd bleedin' all over your bitch\nI know where you live, your girl showed me your crib\nUnless she told me a fib, then I'ma have both of you did\nBurning incense, facin' a murder sentence\nUnder intense investigation for killin' infants\nWhile I sit in padded rooms, doin' shrooms\nHavin' visions of dead pregnant women\nWith brooms jabbed in they wombs\nSlit your carpet and rugs and fuck your apartment up\nStickin' up arbor drugs, and jumpin' in garbage trucks\nI'm from the shitty slums that look like the city dumps\nGive you a kidney punch and mug you to get me lunch\nSee me every summer layin' up against the dumpster\nWith a hundred dollar jumper, smothered in Southern Comfort\nGot my Slim Shady sticker on your mother's bumper\nShe came home screamin' a bunch of motherfuckers jumped her\n\n[Verse 2: Proof]\nAyo, proceed to list 'em, there's no need to diss 'em\nDown here we heat 'em, destroy your whole breathing system\nTwist 'em, like beer caps, once they hear that\nRap murder rates, and I snap vertebrates\nCollapse further states, my track preserve the great\nYour pack deserve a crate: in fact, the word is fate\nI'll kill you slow like AIDS-infested nuts\nI'm holdin' vendetta like seven great-molested sluts\nCallin' me a bitch nigga, you need to stop\nReality, one on one, how many times you got dropped?\nI'm cut-throat when any track runs\nConscious when I smack nuns\nThe rough neck that make Muslims run and pack guns\nI'm volcanic, the sermon preacher\nBurnin' emcees, most wanted by Herman Kiefer\nYou tried to get a squad, they was like, \"Money, oh no.\"\nLeave you brain-dead, hittin' trees with Sonny Bono\nI kick without a dojo, D12 slow flow\nShoot down your mothership and pimp-smack mojo\nNo pro wanna go knuckle-blades with the renegade\nNigga tried to go pop, and plus they minute-made\nMy lieutenant sprayed your brigade and trampled your flow\nBig P, the reason emcees cancelled they show\nThe truth will hurt, seein' Proof at work, no shame in it\nThe best part of your show is when you put my name in it\nMy squad be godly, fearin' shit hardly\nSo I hope when I'ma die dope like Chris Farley\n\n[Verse 3: Bugz]\nFuck that! Who run shit once these drums hit?\nYou dove headfirst into some old dumb shit\nHere's a can of asswhip for you to come get\nYour click made they trip, I make them hoes suck mint\nAsk your girl, they know the scoop: don't fuck with Bugz, bitch!\nI'll chop off her titty, have you suckin' one tit\nThem pink belly niggas is who you run with\nMakin' half-ass songs, shitty snares and one kick\nI hate your damn sound, don't like it one bit\nYou could make a double album, won't have one hit\nYour entire outfit is on some bullshit\nAnd there's not a damn one that I can't outwit\nI admit that my style is unfit\nFor Momma's baby boy, because I'm on some dumb shit\nLike I commit larceny, give harm quick\nYou pull the alarm switch, I stab you in your armpit\nNow, who the nitwit wanna come get with\nThis egotistic hip-hop fundamentalistic?\nDon't risk it, you get your shit split\nNow keep your distance and keep existence\nI'm persistent when it comes to bent shit\nI smoked a blunt with my judge right before my sentence\nI'm relentless, to deny is senseless\nYour bitch paid my bill, that's where the hell your rent went\nFuck that!\n\n[Verse 4: Supa Emcee]\nI kill competition, with no way out as an opposition\nExecute the passengers on the flight, my executive decision\nThen reminisce on how Shady the business\nTerrorists asked by Israelis when they visit\nBombin' incentive, World War III in the makin'\nMurdered the exhibition, team finish, beat the ref senseless\nNo time-out, extended play burns over your intermission\nThen christen the battlefield with the blood of Christians\nCryin' for the Messiah, but he don't listen\nI pop my wig when I top the stove frame, boil sizzlin'\nA pyromaniac cook, I do damage to kitchens\nFuck Home Depot, I demolition\nWhen I home improve, you need Bob here to fix it\nFuck school and supervision!\nBit off of financial aid and smoked up my tuition\nOnly hang around rappers with explicit lyrics\nAnd pistol-grip punks for the beefin' — do you wanna get heated?\n\n[Verse 5: Stilla Shellz]\nI got a mind full of troubles, everything's in doubles\nI buy my guns in couples, no time for placement fumbles\n‘Cause emcees come and emcees go, with broke flow\nInjured from head to toe, no fitter model, we full-throttle\nYou stuck in low, incapable to master flow\nEverything is tactical, livin' mathematical\nI smash the flow, unleash and let go\nI shit like lava, original designer\nMarried to marijuana since a minor\nMakin' attempts to sink my battleship\nCould get you bent like fibs, what?\nApplying death-defying feats, maintain to keep my peace\nFlow like the sea when I release these beats over concrete\n\n[Verse 6: 0-1]\nMy presidented transition has taken place\nAs I express vocally on the M-I-C-R-O\nPower he cipher, not equality, I deal it\nLace the track and made it real, now I know my peoples feel it\nKeep their heads bobbin' and the emotionals sobbin'\nPlus a culture-cipher after shows, hoes slobbin'\nKnobs love the fuckin' flavor of the icin'\nPlus I'm precise and my double edge continue slicin'", "image": "https://images.genius.com/13189ad7d4d01e3827b9df557176039c.926x926x1.jpg"}], "artist": "D12"}