{"songs": [{"title": "Word on the Street", "album": "The Archive Live, Lost & Found", "year": null, "lyrics": "[Verse 1]\nI left the set, they need me, like, \"Where he go?\"\nYou  can bet, he's still off the heezy, yo!\nThe  kid spit, weezy, but easy? No\nI make it hard to read me, graffiti flow\nEast to West, the world wanna see me blow\nSyndicated,  like your favorite TV show\nI  get respect, and get a check from CDs sold\nThe President, record exec, from CEO, uh\nRa's  still killin' 'em, block's still feelin' 'em\n[?], still peelin' 'em (Hot!), still reelin' 'em, real as\nThem\nDrop! Sell millions, Seventh Seal, here it come\nRa's  chillin', top buildin' spots still fillin' em\nPapi in Puerto Rico, UK's King Harold\nThe Bronx, I'm Carlito, the block I'm Ra Ghetto\nJamaica; I'm Ja', and Rio know my M.O..\nJapan, it's [?]\n\n[Chorus]\nIt don't matter where you at\nO.T. or on the same block I rep'\n(You know!) All come from the same struggle\n(I know!) You understand my lingo\nSo no matter wherever, I know you got my back\nAnd if it ever pop off, I'm gon' react!\nYou see the word on the streets\nIs the world got our back so we need\nTo send love wherever we go!\n\n[Verse 2]\nWhen I'm flowin', my master craft is demographic\nIt's growin', I check the status then let 'em have it\nThe chosen, Rakim is classic, time so far past it\nMasses won't grasp it 'til I'm in the casket\nWhen I'm zonin', I've seen it all like \"Casualties of War\" before it happened\nPerhaps my pen is magic\nUnloadin', mic chokin' smoke keep clappin' 'til it's broken\nPop open, like emptyin' a ratchet\nBlackberry Benzino, [?] is red\nBlack and cherry Timbs [?] stuffed with bread\nThe lee-low, seein' ya group like I'm duckin' the Fed's\nRa's still on fire like I puff with dreads\nStudio-gangster talk tough is dead\nMy 16's a slug stuck in your head, enough said\nThis is for fans and neighborhood celebs\nBaby girl, let's hit the club, hurry up, get dressed\nSo let's go\n\n[Chorus]\nIt don't matter where you at\nO.T. or on the same block I rep'\n(You know!) All come from the same struggle\n(I know!) You understand my lingo\nSo no matter wherever, I know you got my back\nAnd if it ever pop off, I'm gon' react!\nYou see the word on the streets\nIs the world got our back so we need\nTo send love wherever we go!\n\n[Verse 3]\nIt's hip-hop when DJs throw it on in the club\nAnd watch mamis drop and start warmin' it up\nThey get hot, bartender puts some more in the cup\nThugs hear it outside, start stormin' the club\nIt don't stop! Once it's on we enjoyin' the buzz\nInhale the song in your lungs, it's as strong as a blunt\nOr raw rocks off of the block, the audience bump\n'Til the cops run in the spot like I'm wanted for drugs\nI party with mamis, with Bacardi and they're zombies\nSophisticated hotties that ride with me on Ducatis\nFit bodies in they Armanis, mix karate with pilates\nYeah, they hobby's with Papi put tsunami's in their punanis\nThe God stay fly, it ain't hard to aim high\nLike I'm armed with a launcher, or a Don on they grind\nRa display rhymes, it's the crime, dark or day time\nLike a mobster sprays 9's, I'm a monster, ain't I?\n\n[Chorus]\nIt don't matter where you at (Yeah)\nO.T. or on the same block I rep'\n(You know!) All come from the same struggle\n(I know!) You understand my lingo\nSo no matter wherever, I know you got my back\nAnd if it ever pop off, I'm gon' react!\nYou see the word on the streets\nIs the world got our back so we need\nTo send love wherever we go!\n\n[Outro]\nNew York City\nDetroit\nA-T-L\nThe West coast\nThe Midwest\nAcross seas\nR-A-K-I-M", "image": "https://images.genius.com/009ea2953d379ab53e8bb7f20f149287.800x800x1.jpg"}], "artist": "Rakim"}