{"songs": [{"title": "Long Live da Game", "album": "Trap Muzik", "year": "2003-08-19", "lyrics": "[Intro]\nAye, uh-uh, uh, aye\nAye, what's happenin'?\nYe-ye, ye-ye-yeah\nThat's right, one time for your mind\nWhat's happening, pimp?\nThis for all my niggas who think they hard\nOk, nigga, I'll tell you what's hard, pimp\n(What's hard pimp?)\nGoing about your day, nigga, losing your life at the end of it\nNigga, that's what's hard, nigga\n(Minding my muthafuckin' business, that shit was fucked up)\nLet me tell you a story about the last day I lived in my life\n(How it happened, man?)\n\n[Verse]\nI'm in a '96 Impala with the gat in my lap\nAnnihilating any nigga trying to work in my trap\nI have the feds got me tapped\nSo to keep 'em off of my back\nI got a crib in the trap and a crib to relax\nNow my indictment was a secret, and that's the way that they keep it\nIf I ain't have a ho giving head to the feds coming back telling me exactly what they said\nI'm a dead man walking\nWaiting on time in jail\nBut I'll die before I let 'em stop my mail\nLong as I got another ounce to sell\nWhat the hell, I'mma bail?\nGrab my scale\nGet another ki and I'mma slang my yayo\nEveryday it feel like they on my trail\nLook them in the face say, \"Fuck they jail\"\nNiggas on the westside can't re-up because it's a drought\nSo I check the crack house\nDamn, it sold out\nNow back to the crib, so I can check this stash\nAin't sure about how much dope I had\nGot a couple kis in the safe right now\nWeigh it up, cook it up, then chop it down\nNow I'm ready to go and pick up my fetti\nBut before I leave the house I can't dip without grabbin my G's\nAnd my keys to my brand new V, put 'em in pocket\nSo my gat–blue jeans, Desert Eag'\nNigga, you holler 'bout freeze\nPut this red dot to your ass and squeeze\nNow I'm dippin back to the SWAT\nWith the 4-4 and a plastic Glock\nTurned around the corner and I had to stop\nCouldn't trap, before me it was the cops\nSit and watch, but I still ain't scared\nMac Boney and 'em must have fled\nOnly cops is I fear is the feds\nOn my car flashing blue and red\nDamn there they go, now it's time to dip\nGot the 4-4 right my hip\n9 millimeter with an extra clip\nThat's what you niggas get fucking 'round with TIP\nBusting at 'em, and cussing at 'em, but ain't no shaking 'em\nThem bullets that they was busting at me, my vest was taking 'em\nMaking them pigs fall in pain\nTurned around cause one called my name\nTook a hot one to the brain\nYeah, I died, but long live the game", "image": "https://images.genius.com/ab2d918a9feba95d0153b56bb925499d.1000x1000x1.jpg"}], "artist": "T.I."}