{"songs": [{"title": "1995 Westwood Freestyle (Me & Craig)", "album": null, "year": "1995-01-01", "lyrics": "[Craig Mack]\nFlip funk in the UK\nPass the ill fill\nAnd I can feel all the Flava\nKicking from the UA- US neighbour\nKick all the Flava\nDo the Mack do, what you wanna do, you savour\nThis step is called the BRU to the T\nBust the rhymes for free, I gets down\nMack is inside your town\nBusting lyrics tourture like the missiles slow you down\nSup with B.I.G? Pass the microphone to you so I can take a puff\n\n[The Notorious B.I.G]\nWho throw gats to Guiliani?\nFlows tighter than pigeon punani, try me, die G\nDangerous, since my daddy bust me out the tip of his dick\nBiggie Smalls with the Wickedest shit\nSpit clips, niggas split like bananas\nFlavour like Tropicana; orange, mango, peach\nI strangle each\nNegro for they dough\nNiggas get to bendin', got two cases, one pending\n560 V-12 engine, niggas swimmin'\nIn 929 Mazdas, Tammy and Natasha\nThe menage-a-trois is at my crib\nLike Ill and Al Skratch smokin' 50 sacks in the back of Ac's\nWindows cracked, so sit back relax\nCraig, crush the hash, the Beretta's in the stash\n\n[Craig Mack]\nWell, BANG! let's kick it off like a butt\nMore fakes than Allen front to leave you lost like a treasure hunt\nFrom now on, y'all crossed the land\nCraig Mack's the upper hand with more rhymes than the beach got sand\nYou're an MC, yo my original job is that mistaken raps'll guarantee you look like a slob\nI got more rhymes than kids got the measles\nYou shooting needles, we are bigger than The Beatles\nI crush , hush with the Super Sunday rush\nWe're trotting to the cot cause your style turns back to mush\nI flip out the funk off the frame\nNow you know my name- Mackalicious, ain't you got a king?\nBefore 10:00 Westwood, I'm no good\nShaking from here to back to Breckwood\nOn One FM rap show, the illest flow that you ever heard on your radio\nBiggie Smalls, my motherfucking man, take the microphone and kick the wicked like a man\n\n[The Notorious B.I.G]\nI went from construction Timbs to Acs with rims\nFlipping mixtapes to bitches feeding me grapes\nPeep my mind state, Big Poppa flow is lethal\nThat weed make my ass wanna KILL FOUR PEOPLE!\nForget the dames, gimme the range and the wain\nMy niggas up the pawn drop top jag walls\nBlindfold you when you step in the car\nThat's the superstar status apparatus, more wings than clutches\nCease roll the hash, it's in the pocket with the nine\nLick off the wine as my seats recline\nI want a presidential Rollie\nSo I crush MC's, the guacamole making Robin scream \"Holy Molly!\"\nBig Poppa, off the caper, I'm that paper crusader\nPlaying Sega in a widebody blazer\nAnd if you don't know now you know\nMy flow you pick like an afro\nWet like Soul Glo\n\n...Uh, you don't stop...\n\n[Notorious B.I.G]\nBig Poppa, throwing niggas off of cliffs, smoking spliffs\nDisappear with my bitch in a Mitsubishi Eclipse\nRead my lips, I kill you, blood will spill too\nDid I say thank you? I grant you\nThree wishes cause I be the genie\nNiggas is ass out like fat  bitches in bikinis\nRead between the lines, see what I see?\nI see the diary of a sick bastard\nJunior M.A.F.I.A blaster\nRugers on the hips, bought coke to fill chips\nMore burners to fill clips, check it...\nPutting coke in corner store bodegas\nIn the back room playing Sega Streetfighter 2\nI'm inviting you, get your writing crew and their dopest rhymes\nI'll get up in that ass every time\nLyrically I'm untouchable, uncrushable\nGetting mad blunted in a 600 Benz\nAsk your friends who's the illest\nLicking shots niggas screaming Biggie Smalls tried to kill us\n\n[Craig Mack]\nI get ill...\nIt's time for a funk refill of rhymes that I kill as I shoot 'em in the grill\nMC's, I'm not impressed\nYour best don't just throw your chest\nWhere's the bullet proof or the wool vest, won't matter\nYour chest will shatter\nOn the tip of my dick baby you are the badder\nMC's now feel funktified\nThey tried but now they died\n\n[The Notorious B.I.G]\nBiggie bring big bowls of beef\nBacking bitch niggas down burners bring bundles of belief\nCommon thief slash drug chief, syndicated\nWent from 10k to 24k, competition hated, J.M. sedated\nQuarantine\nBig for president, busting shots past your spleen\n9 millimeter dreams, Mac 11 nightmares\nWhich MC's do you fear? Big Poppa, Junior M.A.F.I.A, nuff said\nNiggas disrespect just I dead\n\n[Craig Mack]\nJust I dead\nMC's will turn red from the shot I lick, Ceaser sick\nToo much shagging, too much drinking, too much thinking\nMC's are blinking the third eye when I pass by\nMackalicious got the sweet potato fried for you motherfucker, I... touch the microphone\nI do or die, make the hardest motherfucker cry when a MC pass by\nI flip rhymes off the top of my head just like Raid I spray MC's until they dead\nA vocal volcanic microphone, robotic tonic atonic\nThe microphone is mine so MC's panic\nI get down for my ground\nYou could see I met James Brown in your town\nFlipping funk on a Friday on my malware\nIn the highway, takes MC's by the driveway, driveway\nSlow ill flow, so you know, head to toe\nIll bend flows when I go...\nFrom flow to top ten... to dough...\nFlow ill flow, Badboy down said so\nSo Biggie Smalls my man, take command\nTurn each MC you see into sand\n\n(Change of beat)\n\n[Craig Mack]\nI stretch the funk like my name was Plastic Man\nEating MC's out the can in my hip-hop wonderland\nI got the venom like the snake's got the venom, I put it in 'em\nFaces turn bluer than my denim\nBut don't look down though my name is David Banner\nFlipping green on the mic cause they can't control my gamma\nSo stop hogging us, Mack's the erogenous\nSo rap full grown, see us the acrogynous\nThere ain't a rapper liver than the rebel\nMy voice don't carry treble, eat MC's like a vegetable\nCrack a few stepping on the pedal\nHeavy off the medal, life's stronger waiting for the sun to settle\nKing MC, for that I thank the LORD\nIll vocal chords sometimes you get the style bored\nAs we break it down, Biggie Smalls represent Brooklyn your hometown\n\n(Change of Beat)\n\n[The Notorious B.I.G]\nNiggas in my faction don't like asking questions\nStrictly gun testing, coke measuring\nGiving pleasure in the Benzito\nHitting fannies, spending chips at Manny's\nHope you creeps got receipts, my peeps get dirty like cleats\nRun up in your crib, wrap you in your Polo sheets\n6 up in your wig-piece, nigga decease\nMxwaah! May you rest in peace\nWith my Sycamore style, more sicker than yours\n.44 and 54 draws\nAs my pilot, steers my Lear- yes, my dear\nShit's official, only the Feds I fear\nHere's a tissue, stop your blood clot crying\nThe kids, the dog, everybody dying, no lying\nSo don't you get suspicious\nI'm Big dangerous you're just a little vicious\nAs I leave my competition, respirator style\nClimb the ladder to success escalator style\nHold y'all breath, I told y'all\nDeath controls y'all, Big don't fold y'all\nI spit phrases that'll thrill you\nYou're nobody 'til somebody kills you\n\n(Change of beat)\n\n[The Notorious B.I.G]\nYour reign on the top was short like leprechauns\nAs I crush so-called willies, thugs, and rapper-dons\nGet in that ass, quick fast, like Ramadan\nIt's that rap phenomenon Don Dada\nFuck Poppa, you got to call me Francis M.H. White\nIntake light tokes, tote iron\nWas told in shootouts, stay low, keep firing\nKeep extra clips for extra shit\nWho's next to flip on that cat with that grip on rap\nThe most shady, Frankie baby\nAin't no telling where I may be\nMay see me in D.C. at Howard Homecoming\nWith my man Capone, dumbing, fucking something\nYou should know my steelo\nWent from 10 G's for blow to 30 G's a show\nTo orgies with hoes I never seen before\nSo, Jesus, get off the Notorious'\nPenis before I squeeze and bust\nIf the beef between us, we can settle it\nWith the chrome and metal shit\nMake it hot like a kettle get\nYou're delicate, you better get - who sent ya?\nYou still pedal shit, I got more rides than Great Adventure", "image": "https://images.genius.com/87eaf233d010e2a12c25310721805bb0.1000x750x1.jpg"}], "artist": "The Notorious B.I.G."}