{"songs": [{"title": "Gin & Juice (Remix)", "album": "15 Years on Death Row ", "year": null, "lyrics": "[Intro: Daz Dillinger]\nYeah, Death Row\nDogg Pound, Snoop Dogg\nRight back in they ass with the remix\nLike that! We gotta hit 'em hard\nAnd we gonna hit them like this\nPure gangsta shit\nModefied, Purefied, nigga\nCheck it out\n\n[Verse 1: Snoop Dogg]\nWith so much drama in the L-B-C\nIt's kinda hard being Snoop D-O-double-G\nBut I - somehow, some way\nKeep coming up with funky ass shit like every single day\nMay I, kick a little something for the G's? (yeah)\nAnd make a few ends as (yeah!) I breeze through\n2 in the morning and the party's still jumping\nCause my momma ain't home\nI got bitches in the living room getting it on\nAnd they ain't leaving til 6 in the morning\nSo what you wanna do? Sheeeit\nI got a pocket full of rubbers and my homeboys do too\nSo turn off the lights and close the doors\nBut (but what) we don't love them hoes, yea\nSo we gonna smoke a ounce to this\nG's up, hoes down, while you motherfuckas bounce to this\n\n[Hook]\nJust rollin'! (I'm on a mission on the grind)\nJust rollin'! (Homies get cought up, doin' time)\nJust rollin'! (What?) (laid back)\nJust rollin'! (with my mind on my money and my money on my mind)\nJust rollin'! (I'm on a mission on the grind)\nJust rollin'! (Can't get cought up and do time)\nJust rollin'! (Laid back)\nJust rollin'! (with my mind on my money and my money on my mind)\n\n[Verse 2: Snoop Dogg]\nNow that I got me some Seagram's gin\nEverybody got they cups, but they ain't chipped in\nNow this type of shit happens all the time\nYou got to get yours but fool I gotta get mine\nEverything is fine when you listening to the D-O-G\nI got the cultivating music that be captivating he\nWho listens to the words that I speak\nAs I take me a drink to the middle of the street\nAnd get to mackin' to this bitch named Sadie (Sadie?)\nShe used to be the homeboy's lady (Oh, that bitch)\n80 degrees, when I tell that bitch please\nRaise up off these N-U-T's, cause you gets none of these, at ease\nAs I mob with the Dogg Pound, feel the breeze\nBeyotch I'm just\n\n[Hook]\n\n[Verse 3: Snoop Dogg]\nLater on that day\nMy homey Dr. Dre came through with a gang of Tanqueray\nAnd a fat ass J of some bubonic chronic that made me choke\nShit, this ain't no joke\nI had to back up off of it and sit my cup down\nTanqueray and chronic: yeah I'm fucked up now\nBut it ain't no stopping, I'm still popping\nDre got some bitches from the city of Compton\nTo serve me; not with a cherry on top\nCause when I bust my nut I'm raising up off the cot\nDon't get upset, girl, that's just how it goes\nI don't love you hoes, I'm out the door\nAnd I'll be\n\n[Hook]\n\n[Ol' G Henny Loc]\nYo, again!\nBack up in this muthafucka is Ol' G Henny Loc (what up?)\nTellin' you what's really goin' on, (check)\nWith the big (check) baby of 'em all, Snoop Doggy Dogg (show ya right)\nBack up in ya muthafuckas\nFlipp floppin' hoes like ?Fab Jacks?\nWhat many fuckas remain to be, clockin' them dollas\nSo recognize game as the D-O-double-G, dips with the Gin & Juice\nYa trick ass, bitches!! (ha ha)\n\n[Daz Dillinger]\nYeah, just bounce to this\nSnoop ounce to this\nAll my homies just bounce to this\nEastside just bounce to this\nWestside, bounce to this\nNothside, bounce to this\nSouthside, bounce to this\nJapan, bounce to this\nU.K., bounce to this\nNiggas from Aklohoma, bounce to this\nNiggas from Texas, bounce to this\nNiggas in Atlanta, bounce to this\nNiggas in New York, bounce to this\nNiggas in New York they bounce to this\nNiggas in New York they bounce to this, check!", "image": "https://images.genius.com/e67bb9a0f79870fa52758f302c7c15f9.640x571x1.jpg"}], "artist": "Snoop Dogg"}