{"songs": [{"title": "Get it Live", "album": "Doc’s da Name 2000", "year": "1998-12-08", "lyrics": "[Verse 1]\nYo, if this pussy nigga can't get it live\nGet him the fuck out and let Doc take the job\nI guarantee hardcore funk for three months\nWarranty within that three months is like pre-nups:\nI take half, of everybody's sales, I don't give a fuck\nYou're rap, R&B or, folk or country\nYou could do a duet LP with Billy Dee\nI'm the Doc pure water lettin Bay-watch the slaughter\nI jump off stage and kick him in the fade\nI'm lifted like my back carry helicopter blades\nFuck a police raid, this a bumrush\nYou'll agree like Siskel and Ebert with your thumbs up\n\n[Chorus]\nLike Doc is that nigga that'll freak the funk\nYeah, Doc is that nigga that'll blaze the skunk\nFeel my vibe, give me five on the backhand side\nWell alright then, well alright then\n\n[Verse 2]\nHah, yo, I see y'all niggas tryin to win, dyin to sin\nLiquidate my formats then apply it to skin\nI put work in, my label should be buyin a Benz\nCause with the chrome I'm swift like the hand on Sharon Stone\nC'mon, it's about the scrilla\nMetronomes put holes in bitches silicones then they peel em\nI hang with ghetto hoes that, thumbtack they ceiling\nCause when it's time to throw joints, they the ones illin\nI'm way above 90 plus tax, kleptomaniac\nTake the change out your blue mousetrap\nLo-Jacks is no match to locate, what I demonstrate\nYou need two Dr. Dre's to Phone Tap, me\nCapi-tal D.O., yo\nI keep a dirty piss when I see P.O., yo\nMy phone number's 9-9-FUCK-YOU\nMy crew swing like Bruce Lee num-chuks do, up to\nNo good, to make myself clear\nAny girl ask for drinks is the biggest chicken in here\nLike Run say, \"This is the wayyyyyyyy!\"\nDef Squad lock it like that channel on Superbowl Sunday\nY'all niggas ain't ready, for Reggie\nI B. Steady, to rob that bank in Philly\nBreak Cool C out then ask her (?) what the deally?\nPass them the AK so we can get busy!\nI'm at 112 with Jacque with my neck up\nThis chicken scopin, \"Who the fuck parkin that Lincoln?\"\nIt's D-O-C, Def Squad crew\nI'm ready to fuck baby, how about you?\n\n[Chorus]\nDoc is that nigga that'll freak the funk\nYeah, Doc is that nigga that'll blaze the skunk\nFeel my vibe, give me five on the backhand side\nWell alright then, well alright then\n\n[Verse 3]\nYo yo, yo, yo, yo, y-yo, you ain't fresh\nStill crack a cold Beck's and keep the hoes in check\nSpit a rhyme to make your neck disconnect your chest\nThis Gilette style be Acura and XX, well it's\nDoc, blow your wife MX\nAt the hotel Niko, spankin that Coleco\nI get you hot if you're, lookin through the peephole\nNiggas start duckin out, like I work for repo'\nFo'-fo' italian chrome, bitches yellin, \"Champagne!\"\nI stick the whole Mo' bottle up inside a ho\nJust cause I can flow, I'm not a sucker\nI just love to fuck ya fuck ya fuck ya fuck ya\n\n[Chorus]\nDoc is that nigga that'll freak the funk\nYeah, Doc is that nigga that'll blaze the skunk\nGive me five, feel my vibe on the backhand side\nWell alright then, well alright then\n\nYo yo, I said Doc is that nigga that'll freak the funk\nYeah I blow my fuckin weed if you're out of skunk\nFeel my vibe, give me five on the backhand side\nWell alright then, well alright then\nWell alright then, well alright then\nYeah", "image": "https://images.genius.com/ff1bcd7d83855df13cac08a00e033052.594x594x1.jpg"}], "artist": "Redman"}