{"songs": [{"title": "All Yall", "album": "STN MTN / Kauai", "year": "2014-10-03", "lyrics": "[Verse]\nNow it's the B to the izzo\nYou know what it is I'mma stunt on the d-low\nWatch me get it in, spin in the seat, black as can be\nRolling it up, giving a fuck, like I'm a slut\n\"Bino that's my baby what he doin out at the club?\"\nFuck about your dress code, my dress code is I got a big bank roll\nI think so, time to give these niggas something else\nIsland in the summer best believe that shit ain't common wealth\nSmile on her face best believe she wearing nothing else\nWatch the sun set that's a feeling that she never felt\nWe were born free, that's my God given\nHow a god living? Fantastic, fans spazz when they see  ya man passing\nI'm in the Aston Martin, unforgivable blackness beg your pardon\nOn my Jack Johnson nigga, all my shows sell tix like Boston nigga\nPut this on at the cook out, let me see you shmoney\nOld school on the XM got your Auntie singing \"Hola Hola Ayy\"\nHit the dream too hard, I'm the new young god\nThis the new mixtape, but it's still the same game\nHow you gon be the don, when Don half my name?\nHow you gon be the G.O.A.T, when we are not the same?\nI be feeling all this money but motherfuck the fame\nIt's the young Bino, I'm in your bae like Oakland\nIn my bed out of breath I never been this open\nIf you niggas can't hear me it's the weed I'm smoking\nWhen I opened up the door I had the manager coughing like\n\"The hotels charging you a maintenance fee\"\nGave that nigga 2 stacks and said I'm here all week\nLet me roll OG, let me talk my shit\nHow you hotter than me? You ain't got no hits\nYou just got a hot feature\nBare sole on the track so my feet hurt\nDo some research, know my origin\nI'm the new black, fuck oranges\nYeah, that's that nigga that yall love to hate\nRedbone like golden gate\nChildish y'all know the name, getting hate from Charlemagnes\nLast year things done changed, I was thinking bout killing y'all\nI was working all night long, white bitches like King Kong\nGetting money my theme song, do whatever I want\nFuck your clique do what I want, fuck your bitch do what I want\nHere's some shit you niggas didn't know\nProbably wrote your nigga verse\nProbably wrote your nigga video\nHigh as fuck on Arsenio\nChosen, now they show me my respect nigga\nFrozen, Disney movie round his neck nigga\nI told ya, I'm the best right now\nFrom Atlanta where them niggas in your chest like \"blow\"\nRoyalty equal sign black philosophers\nBecame a top 5 cause nobody else was stopping us\nThey want me Hopsin but I'm popping and getting confident\nGod forbid we give him props for the job he did\nMan his knob need some slobbering\nI mean, fuck, do you want more?\nI'm killing these niggas and still on tour\nFuck is y'all for?\n\n[Outro]\nThis is for all of y'all\nOne day everyone's falling off\nSo right now we should all ball out\nLife's too short to not all out\nThis is for all of y'all\nOne day everyone's falling off\nSo right now we should all ball out\nLife's too short to not all out\nI don't know what I really need\nBut I'd rather be smoking weed\nI don't know what I really need, yeah\nBut I'd rather be smoking weed", "image": "https://images.genius.com/77a2349de407b4d4690746b19b39f6dc.500x500x1.jpg"}], "artist": "Childish Gambino"}