{"songs": [{"title": "Oh Lord", "album": "OKE: Operation Kill Everything ", "year": "2013-10-08", "lyrics": "[Verse 1]\nUh, let Jesus take the wheel of a Phantom, baby!\nClose my eyes, wake up, I’m in Atlanta baby\nWho put the magic in Magic City? Meech did\nWho popping magnum bottles with Diddy? Me kid\nTell ‘em where the beast is, somewhere where the beach is\nLeaning back in my beach chair, yeah\nI’m something like a leap year\nNiggas don’t see me that often in this 'Rari\nBut nigga, we here!\nFirm baby, it's like I got Usher Raymond in this Backwood\nLet it burn, baby! (Weed make niggas so emotional)\nI gotta pull out that hundred 'fore ya'll can poke it with holes\nWe in the Poconos, strokin' hoes til they open those - leggings\nNiggas ain’t begging, we gettin' Oprah dough\nMoney over bitches, till I’m fucking Oprah, so\nBack away from my Phantom, so I can open do'\n\n[Hook: Game & Shontelle]\nMarble floors, Lamborghini doors\nOh Lord, oh Lord, oh Lord!\nHangin' out the window on the West Side, West Side, West Side\nSmoking green you ain’t never seen! (Can I hit that?)\nJust hold it firm baby\n\n[Verse 2]\nTake a puff out it\nThen run it tell puff about it\nCopped a Bent on that Master P shit, we bought it, bought it\nUp in Greystone, it's too fucking crowded\nLet's hit Supperclub after supper, blood\nSay my nigga nip in that bitch, what’s up with cuh?\nFuck with cuh, blood, got guns it's on the up and up\nFuck with blood, cuh got hundred niggas just rolling up\nStill Soo Woo, gotta give it to my niggas, man\nMy nigga Skeme, my nigga Wayne\nMy nigga Joe Moses got the hoes opened\nMy nigga YG winning, I kept the door opened\nCan’t forget about my nigga Top Dawg\nPut Kendrick on a pedestal where thou shall not fall\nOne love to my lil nigga Problem\nGot the LA turned up, like whaaat?\n\n[Hook 2]\nMarble floors, Lamborghini doors\nOh Lord, oh Lord, oh Lord!\nHangin' out the window on the West Side, West Side, West Side\nSmoking green you ain’t never seen! (Can I hit that?)\nYou smokin' sherm baby?\n\n[Outro]\nNigga, what a fuck? I’m from the Valley\nWe don’t smoke sherm\nI don’t know what ya'll do in Compton\nBut in the 818 we put weed in weed\nNigga, you’re tripping\n(I’m just fucking with you, I wouldn’t lace your weed)\nOh, fuck it then, let's smoke", "image": "https://images.genius.com/f04f9b2892eac01c8dd7876593883785.500x500x1.jpg"}], "artist": "The Game"}