{"songs": [{"title": "Guwop Home", "album": "Everybody Looking", "year": "2016-07-13", "lyrics": "[Intro: Young Thug]\nMike Willy with me nigga\n\n[Bridge: Young Thug]\nBig Guwop home\nWe no longer miss you, yeah\nI know Guwop home\nWe all no longer miss you\nI can't wait\n\n[Chorus: Young Thug & Gucci Mane]\nDream, it's a young nigga dream, yeah\nMoney talk like I'm Charlie Sheen, yeah (Wop)\nI'm a blood but I got on blue jeans (it's Wizzop)\nNigga act so tough it's startin' scene, ooh\nIn blue flame, yeah the trap god throwing green rain\nNice guy, mean chain, pull up in a cream Range\nOrange seats, orange feet, what do all that orange mean?\nOld rich ass nigga, I got everything\n\n[Verse 1: Gucci Mane]\nRose gold watch, but my bottle pink gold\nThree red hoes walking round in red robes\nCan't stay the night I'm not the type to be on Skype, hoe\nWrote me off, said that I was gone, that was a typo\nTake a white girl out a trailer make her Iggy\nTake a black bitch outta Magic make her Nicki\nPissy yellow Rollie, baby pissy in her feelings\nMy young bitches show respect they call me Mr. Millions\nBrown skin chick and she love to wear purple\nHer nails purple, lips purple, pussy hair purple\nBig titty Amazon in my black Benz\nI'm rich black man got a couple white friends\n\n[Chorus: Young Thug & Gucci Mane]\nDream, it's a young nigga dream, yeah\nMoney talk like I'm Charlie Sheen, yeah\nI'm a blood but I got on blue jeans\nNigga act so tough it's startin' scene, ooh\nIn blue flame, yeah the trap god throwing green rain\nNice guy, mean chain, pull up in a cream Range\nOrange seats, orange feet, what do all that orange mean?\nOld rich ass nigga, I got everything\n\n[Verse 2: Young Thug]\nMy teeth white like a toilet tissue\nStop the cappin', boy you know you miss her\nWe hit the lobby then we saw you kiss her\nLil' mama crazy she gon' try to kill you\nI got the weed, bring the molly with you\nI got the syrup, bring the Jolly Ranchers\nYou talk to 12 we gon' off your body\nYou tripping boy you need some knowledge in you\nBoss man from the 1248\nFor the clan, nigga 12, 40 plays\nLiving good, everyday my birthday\nPockets full of money, Master P, ay\nNational bid day\nFree the Wop nigga, National Siblings Day\nCall the dentist day\nPull up to the public, come and see the bae\nRun it up to the top\nGet out and ran it back to the top\nFlood your ear, your neck, your wrist, your fingers\nAnd put it all on rocks\nSay Guwop home and yeah it’s official, grab some tissues\nWhat's wrong with you?\n\n[Chorus: Young Thug & Gucci Mane]\nDream, it's a young nigga dream, yeah\nMoney talk like I'm Charlie Sheen, yeah\nI'm a blood but I got on blue jeans\nNigga act so tough it's startin' scene, ooh\nIn blue flame, yeah the trap god throwing green rain\nNice guy, mean chain, pull up in a cream Range\nOrange seats, orange feet, what do all that orange mean?\nOld rich ass nigga, I got everything (It's Gucci!)\n\n[Bridge: Young Thug]\nBig Guwop home\nWe no longer miss you, yeah\nI know Guwop home\nWe all no longer miss you\nI can't wait\n\n[Outro: Young Thug]\nRun it up to the top\nGet it out and ran it back to the top\nFlood your ears, your neck, your wrist, your fingers\nAnd put it all on the rocks\nSay Guwop home and yeah it’s official, grab some tissues", "image": "https://images.genius.com/7b09d3481ad9788a50cd8b537f53ba1a.500x500x1.jpg"}], "artist": "Gucci Mane"}