{"songs": [{"title": "Hot boyz - remix original version", "album": null, "year": null, "lyrics": "Uh, forty side felony\nFelony, misdemeanor\nThe charge is murder\nEscobar CB on bikes\nI'm switching gears\nHeadlights, shine so bright\nBitches freeze like deers\nThem fiends want that deep boy\nFeds send in a decoy, pack that heat boy\nPush ya where ya rest in peace boy\nGet your mama's house shot up\nBodies all chopped up\nWhen them bodies pop up, I ain't getting' locked up\nMy Bentley cruise the block, with the sun roof top\nHood rats jumpin' on my jock cause I blew up the spot\nCrushin' your Benz, crushin' your Navigator system\nMy QB piece make y'all niggas tuck your shit in\nIt's Nas in your area, Queens 'bout to tear it up\nBraveheart y'all scared of us, real niggas, they be us\n\nWhat's your name, cause I'm impressed?\nCan you treat me good, I won't settle for less\nYou a hot boy, a rock boy\nA fun toy, tote a Glock boy\nWhere you live, is it by yourself?\nCan I move with you, do you need some help?\nI cook boy, I'll give you more\nI'm a fly girl, and I like those\n\nHot boyz\nBaby you got what I want\nSee cause y'all be driving Lexus jeeps\nAnd the Benz jeeps, and the Lincoln jeeps\nNothin' cheaper, got them Platinum Visa's\nHot boyz\nBaby you got what I want\nSee cause y'all be driving' Jaguars\nAnd the Bentley's, and the Rolls Royce\nPlayin' hardballs with them Platinum Visa's\n\nIs that your car, the SK-8?\nAre you riding alone, can I be your date?\nCome get me, get me, don't diss me, don't trick me\nGot some friends, can they come too?\nCan you hook them up wit' some boyz like you\nA hot boy, a rock boy, on top boy\nAnd I like those\n\nHot boyz\nBaby you got what I want\nSee cause y'all be driving Lexus jeeps\nAnd the Benz jeeps, and the Lincoln jeeps\nNothin' cheaper, got them Platinum Visa's\nHot boyz\nBaby you got what I want\nSee cause y'all be driving' Jaguars\nAnd the Bentley's, and the Rolls Royce\nPlayin' hardballs with them Platinum Visa's\n\nYo only take 'em thugged out\nSlightly bugged out, fuck with his tongue out\nKnow the job ain't getting done, until the body getting drugged out\nHot boy, keep me right\nPlay your part and I'll keep it tight\nWhere else you gonna be in the middle of the night\nBut up in the sheets with me aiight\nGangsta, true to your gang, street master\nYou the one I need when there's beef, street blaster\nAin't afraid to stop a cat, plus pop a cat, huh\nSoldier, cash money, rule your world\nWhat's topping that?\nHuh, S-4-3-0 keep me on my toes\nGet a tingle in my spine, what spot? Only he knows\nHe's a hot boy, Missy sing it out and I'm gon' spit it\nRuff Ryders scream it loud, daddy is you with it\nIf your team can't handle my bitches then we gon' ride\nBrickhouse stallions, keep thugs open wide, huh\n'Illadelph's best E-V-E stay committed\nMess with many, but if he ain't the realer\nI ain't with it, with it\n\nYo, mami, what the deal?\nAin't no heat fuckin' hotter than the heat a nigga hold\nI think you really should be told that I deal with long shafts\nThat keep a long blast (blast)\nNow look at a nigga and peel off fast (come on)\nWord you got your girlfriend\nWord, she can get it too\nFuck it though, I'm honest yo\nI'm saying though, let's play it through\nGetting cinematic with it\nNiggas if you got it, hit it\nFuck the dumbness\nHit it till its numbness\n\nHot boy\nBaby you got what I want\nWon't you really come and satisfy me\nI be lovin' you like endlessly\n(Everyday all day)\nHot boy\nBaby you got what I want\nWon't you really come and satisfy me", "image": "https://images.genius.com/085828b7d79bf8cf068b1557ca7a5e4c.1000x1000x1.jpg"}], "artist": "Missy Elliott"}