{"songs": [{"title": "Friday Night", "album": "Friday (Original Motion Picture Soundtrack)", "year": "1995-03-07", "lyrics": "Intro: Scarface\n\nDamn, this a bitch\nWe ain't gotta motherfuckin thing\nRing CJ do what he doin in Cali-for-ni-a\n(Hello?)\nHey, wuz up nigga, it's Face\n(What up Fizzace?)\nFeelin I'm gone come fuck wit you\n(Come on down loco)\nAi, please have some bitches, please\n(Ha ha ha) Ha ha ha\n\nVerse 1 (CJ Mack, Scarface)\n\nLocc, I been hustlin all week\nTonight's the night I dips 'n try to step up in a freak\nI call this ho named Tiki, she got homies we can twist\nAll we need's some chronic and a motherfuckin fifth\nIs you wit me locc?\nWhat's mine is yours and what's yours is mines\nWhen I'm in Houston you be treatin me fine\nI scoop you up in L.A.X. around 6\nI scootch you through the hood, then we gone get up in these tricks\nIt's Friday night\n\nTwo players in a black 5-0-0\nSlidin down the shore, gettin at every fly ho\nI'm wit my homey, ain't nobody set trippin\nDrops my shit off at his house and then we kept flippin\nNow see y'know your nigga don't sleep\nHomey enough and see\nWell, hand your nigga some heat\nSo I can feel warm in these cold ass L.A. streets\nNow hook ya nigga wit some L.A. freaks, baby\nIt's Friday night\n\nHook: CJ Mack\n\nStraight sellin with my Texas G\nStayin sucka free as I L-O-C\nIt's Friday night\n\nVerse 2\n\n[CJ Mack]\n\nTwo players on a hoodrat chase\nYou niggas can't see me and you can't see my nigga Face\n\n[Scarface]\n\nFirst thang we do is hit the club\nI'm seein hella bitches in the corners tryin to show your homey love\nThis bitch is fly as a bird\nAnd gotta ass that could swang from California all the way up thru\nPittsburgh\n\n[CJ Mack]\n\nHold up locc (What?)\nI know that flea\nShe been out 'n club hoppin since '83 (Ain't this a bitch)\nAnd the bitch is still hoin\nSee, get at broke bitch and fake smile and keep strollin locc (Riiiight!)\nSee them busters in the corner, they don't like my hood\nI don't like their hood so it ain't all good\nSo keep ya eyes on em\nCos if it ??? ??? line, we gotta slide on em\nRide on em\n\n[Scarface]\n\nI gots no problem kickin dust up wit punk ass little busters\nWho wants to try to buck us, we grab these guns and bust em\nI gots that tena millimetre in tha parkin lot\n[CJ Mack] Fuck em locc, we gots some bitches at the Mariott\n\nHook\n\nVerse 3: (CJ Mack, Scarface)\n\nYou motherfuckers better chill\nBefore you fuck around and lose and get your cap peeled\nJumps on the elevator, hops off the six floor\nKnocks on the door of room 604\nGets greeted by the biggest pair of thighs you wanna see\nWith a pair just like a *?mona?* homegirl G\nSee, vee like the mix and vee like the twist of em\nFace, you can hit it first and then we can switch\nIt ain't no fun if my homey can't twist a bitch\nI'll dare ya ass to try to run that 2PAC shit\n\nI goes high-ho silver like the fuckin Moan Ranger\nPlayin here's out my dick inside a total fuckin stranger\nYou fuckin with a Texas cowboy, I puts it down boy\nYou ready for the second go (You know it!)\nI go two or three hours and I'm sendin these bitches off on their way\n(See ya!) You's a fool CJ!\n(Nigga, how you like the southern California freakin?)\nDogg, I'll be back every motherfuckin weekend\nIt's Friday night\n\nHook: CJ Mack\n\nStraight sellin with my Texas OG\nStayin sucka free as I L-O-C\nIt's Friday night\nYou motherfuckers better lay back\n(Cos you can't see that Face)\nOr it's just the nigga C-Mack\n\nOutro: CJ Mack\n\nYeah Mr Scarface and CJ Mack\nPuttin in much work for Rap-A-Lot and Rap-A-Lot West for the 9-5\nYou motherfuckers better stay down\nCos y'all punks couldn't see us with ultrasound\nCoward\n[Scarface] You motherfuckers couldn't see us with glasses on\nHe he, y'knowhutI'msayin?", "image": "https://images.genius.com/90beb3f2ae85ee389e560ae6fbf6fe68.1000x1000x1.jpg"}], "artist": "Scarface"}