{"songs": [{"title": "Street Niggaz", "album": "Chicken Talk", "year": "2006-03-11", "lyrics": "I'm a street nigga, dog, everybody knows that\nSo a hater get smashed, bond money on deck\nGave my dog half a brick for a '73 donk\nGot that bullfrog yay, cause I know it's gon' jump\nI'm a real street nigga, do you understand me?\nI'm a walking bankroll, breezy, rubber-band me\nRed Monkeys on my ass, Gucci frames on my face\nGot that \"Tony Tiger Kush,\" man, pimpin' smoke great\nEvery time my phone ring, dog, it's eighteen-five\nOnly problem that I have is what car I'm gon' drive\nIm a real street nigga, I ain't never had shit\nMan, this chain 'round my neck cost four or five bricks\nI'm a street nigga, dog, I don't love no bitch\nI ain't talkin' to you, baby, 'less you buyin' ten bricks\nBought an '06 Lamb' with the butterfly doors\nThat's a quarter-million dollars gone, just to pull hoes\n\n(Chorus)\nI'm a street nigga, dog\nI'm a street nigga, dog\nYou a street nigga, just like me\nI'm a street nigga, dog\nI'm a street nigga, dog\nNo industry, I'm in these streets\n\nIm a street nigga, dog, hoes love my swag\nAnd the Jacob on my wrist, that's a drop-top Jag\nBought a drop-top Vette, and a super-bad bitch\n\"How much you think you worth?\"\n'Bout 95 bricks\nWay back in '94, it was 95 cents\nNow I'm 95 south, with an R&B bitch\nEvery time I leave the house, bring at least ten grips\nCause it's two or three stacks just to park my whips\nGot a small amount of niggas, but a large amount of clips\nAnd a blue Bent' Coupe same color as the Crips\nMean mug on my face, nigga, ain't nothin funny\n60 grand on the Jacob, nigga, time costs money\nGot a quarter million plate, that's eighteen blocks\nWhen the cops try to whip me, man, I ain't gon' stop\nIm a real street nigga, dog, I ain't gon' lie\nBought a pound of Bubba Kush, just to get the clique high\n\n(Chorus)\n\nI'm a street nigga, dog, so I love my whip\nCar-jack a street nigga, that's how niggas get killed\nIm a street nigga, dog, so I love my block\nPaid a junkie three grams just to wash my drop\nStreet niggas love me, and I love street niggas\nGot an out of town trap, come twice a week, nigga\nIm an East Atlanta vet, man, I ain't done yet\nBitches standin' in line just to wipe my sweat\nIf you make a good count,then you under good check\nNever beef with street niggas, dog, that's ya best bet\nStreet niggas make a college bitch's panties so wet\nTo a project bitch, I'm the best it's gon' get\nStreet nigga of the year, dog, yeah, that's me\nJust to see my wrist twirl, man, it's eighteen G's\nGucci eatin' real good, dog, what about you?\nIm a street nigga, dog, you a street nigga too?\n\n(Chorus)", "image": "https://images.genius.com/3baa00f3106cb117f4503a7ef54414cc.1000x1000x1.jpg"}], "artist": "Gucci Mane"}