{"songs": [{"title": "Everyday", "album": "Dreamchasers 2", "year": "2012-05-07", "lyrics": "[Intro: Rick Ross]\nMeek ain't countin' money no more\nIf it ain't right, it ain't right\nZip the bag up\nDrop it right there\nUgh!\n\n[Verse 1: Meek Mill]\nI got these niggas hatin' on me\nBut I don't give a fuck, because they bitches waiting on me\nI'm just counting all this money, and buying all these hammers\nSo when these niggas play, I let my shooters go bananas\nDiamonds flashing like a camera, my whip sound like a monster\nMy bitch got on that shit, she got a million dollar sponsor\nThese niggas getting sick, somebody call a doctor\nCause all this blood drippin', 20 racks I Louboutin her\nI go Dolce & Gabana, Gucci Louis Prada\nFly as hell in YSL boy I got a lot of 'em\nMadre and cabanas, that's where they probably find us\nJumpin' off the jet, like sayonara to ya honor\n\n[Chorus: Rick Ross]\nI spoil them bitches, I employ them niggas\nWipe my ass with the riches like it's some toilet tissue\nFuck with a winner, minks in the winter\nPhiladelphia millionaire, Meek be that nigga\nYo niggas hatin', my niggas ballin'\nPoppin' bands, countin' dollars, buyin' the Magnum bottles\nMy bitch is patient, yo bitch is boring\nFucked her that Friday night\nWe both woke up that Sunday morning\n\n[Verse 2: Meek Mill]\nYoung nigga, lotta cash, bad bitch, lotta ass\nLamborghini kinda fast, it got these haters kinda mad\nMake me bring them sticks out, AK with the comma and\nThese niggas is kinda nice, which means they kinda ass\nI be on all kinds of shit, boy I get all kinds of cash\nMonday I'mma wear my J's, Tuesday in my Prada bag\nWednesday I go Louboutin\nThey say \"How you been?\" I say \"Doing fine\"\nBitch I ball hard like 2 LeBrons, I hit the booth, no suit and tie\nI'm Superman, my bitch is super fly\nI make a hater wanna kill hisself, suicide\nA nigga play with me? He know it's do or die\nCause I got a big Mac, and that bitch be super sized\nRollin' with a hundred goons, boy I got a hundred jewels\n'Bout to fuck a hundred hoes, all them bitches coming soon\nTell 'em that I'm comin' now, tell 'em I'mma common coon\nBoy my shit be super hot, I name my album summer June\n\n[Chorus: Rick Ross]\nI spoil them bitches, I employ them niggas\nWipe my ass with the riches like it's some toilet tissue\nFuck with a winner, minks in the winter\nPhiladelphia millionaire, Meek be that nigga\nYo niggas hatin', my niggas ballin'\nPoppin' bands, countin' dollars, buyin' the Magnum bottles\nMy bitch is patient, yo bitch is boring\nFucked her that Friday night\nWe both woke up that Sunday morning\n\n[Verse 3: Meek Mill]\nBugatti with Rozay, 'bout to meet Jose\nHe said that that workin', I was like \"okay\"\nShe say give me money, I was like \"no way\"\nShe got mad and text my phone\nIt ain't no work if there ain't no pay\nI'm like be gone bitch, be gone bitch\nI pop a perc, turn on my on switch\nThem bitches ain't on that, nigga cause they on this\nYou put 'em on money, I put 'em on dick, really though\n\n[Chorus: Rick Ross]\nI spoil them bitches, I employ them niggas\nWipe my ass with the riches like it's some toilet tissue\nFuck with a winner, minks in the winter\nPhiladelphia millionaire, Meek be that nigga\nYo niggas hatin', my niggas ballin'\nPoppin' bands, countin' dollars, buyin' the Magnum bottles\nMy bitch is patient, yo bitch is boring\nFucked her that Friday night\nWe both woke up that Sunday morning\n\n[Outro: DJ Drama]\nCan I ask a favor?\nPlease embrace that Meek is just that boy now!\nWhy fight it?\nYou’re doing yourself a disservice", "image": "https://images.genius.com/a7bc28c05034136e861be4c94601d20a.500x500x1.jpg"}], "artist": "Meek Mill"}