{"songs": [{"title": "Outside", "album": "The Documentary 2.5", "year": "2015-10-15", "lyrics": "[Produced by Travis Barker]\n\n[Hook: Mvrcus Blvck]\nOkay, now why I'm always running from the police when I come outside\nWhen I come outside\nI be lowkey I be hoping they won't notice when I come outside\nWhen I come outside\nAnd if you looking for the hoes fuck with me I'ma tell you when they come outside\nWhen they come outside\nAnd all the homies on the block all day so yeah a nigga gotta come outside\nGotta come outside\n\n[Verse 1: The Game + E-40]\nHeard a gunshot, walked up out\nMy motherfucking door, what's happening with all this madness?\nWhat niggas got going on to make me jump up off this Madden\nIn my Gucci flip-flops, tan khakis, niggas sagging\nNiggas pulled up on me, matte black G wagon\nI'm like shit, the fo' fif's still in the house\nAnd usually niggas shoot from where you from, come out they mouth\nGot a nigga heart beating like a cutlass truck\nBut my mama raised a G and she don't fuck with punks\nNiggas rolled down the window, couldn't tell who it was\nWaving off the chronic smoke, is they Blood or Cuz?\nHaha, it's my little cousin Jordan and he's solid\nWe went up last night, nigga said he forgot his wallet\nWe was bumping E-40, yeah, that Hurricane\nWent through ten or twelve bottles of that Sluricane\nWe had six white bitches and a gang of weed\nYou know them blonde hair, blue eyes, they aim to please\n\n[Hook: Mvrcus Blvck]\nOkay now why I'm always running from the police when I come outside\nWhen I come outside\nI be lowkey I be hoping they won't notice when I come outside\nWhen I come outside\nAnd if you looking for the hoes fuck with me I'ma tell you when they come outside\nWhen they come outside\nAnd all the homies on the block all day so yeah a nigga gotta come outside\nGotta come outside\n\n[Verse 2: The Game + Lil' Eazy-E]\nI was dipping down Greenleaf, swerving and I seen my nigga E\nWhat's cracking Cuz? I ain't seen you in a week\nWhere you going fool? Compton college to pick this bitch up\nWe both in Impalas, make the motherfucker hiccup\nNow bounce, rock, roller skate\n'Cause we done fucked every bitch in the Golden State\nNow tell me, how many bitches wanna fuck this nigga?\nStuff dick in her stomach until that butt get bigger\nAnd we both fuck Kianna, you ain't know that though\nShe put a hole in the condom, I don't know that hoe\nConversating with my nigga at this long ass light\nMade a left at Alameda, Eazy bust that right\nI'm gone Cuz! Aight, hit a switch and I'm outie\nBack to the westside, that's where Dr. Dre found me\nPull up on Cedar, then I put it in park\nNow take yo ass in the house before it get too dark\n\n[Hook: Mvrcus Blvck]\nOkay now why I'm always running from the police when I come outside\nWhen I come outside\nI be lowkey I be hoping they won't notice when I come outside\nWhen I come outside\nAnd if you looking for the hoes fuck with me I'ma tell you when they come outside\nWhen they come outside\nAnd all the homies on the block all day so yeah a nigga gotta come outside\nGotta come outside\n\n[Verse 3: The Game & Mvrcus Blvck]\nOoh ooh ooh, nigga hopped out that rag and smelled the oohwee\nMy little nigga Marcus just pulled up from the I-E\nCup full of Henny, niggas gone off that YG\nTold 'em take a fade little nigga saying Why Me?\nIf he jump up I'm with it, anybody can get it\nMayweather with the right, bop-bop, head splitted\n'Cause nigga I'm from the Murda and I don't even bang\nYou got your ass knocked out, which one of you niggas is Game?\n'Cause you fuckin' my cousin, she don't like it, I don't either\nTake all that bass out your voice, homeboy this is Cedar\nMy bad Chuck, let a nigga hit the weed\nNah, take this quarter piece and drop it off in the trees\nWatch the Fruits though, tell that nigga Soo Woo though\nYou can take the rag, don't get a scratch on my coupe though\nAnd watch the Palmers they ain't tryin' to hear no truce though\nNon-affiliated, still a shooter like Kukoc\n\n[Hook: Mvrcus Blvck]\nOkay now why I'm always running from the police when I come outside\nWhen I come outside\nI be lowkey I be hoping they won't notice when I come outside\nWhen I come outside\nAnd if you looking for the hoes fuck with me I'ma tell you when they come outside\nWhen they come outside\nAnd all the homies on the block all day so yeah a nigga gotta come outside\nGotta come outside\n\n[Outro: Ricky Harris]\nYo this your man, DJ EZ-Dicc, I'm about to be out of here\nUp next you got my man Z-Boy Fro and he's gonna hit ya'll off with this Battlecat joint\nYa'll suck it easy right here on the station that fades 'em all\nW-Balls\n(Static)\nEverybody's gotta hear this shit on W-Balls, W-Balls, W-Balls!", "image": "https://images.genius.com/72a00bceccb1bffdad5f44c0094145dd.1000x1000x1.jpg"}], "artist": "The Game"}