{"songs": [{"title": "Wuda Cuda Shuda", "album": "Freebase", "year": "2014-05-05", "lyrics": "[Hook: 2 Chainz]\nYou a wuda cuda shuda ass nigga, ol' wuda cuda shuda ass nigga (x4)\n\n[Bridge: 2 Chainz]\nI woulda went there with y'all, I woulda got me a rental\nI coulda stunt in the club, I could fuck every ho in the building\nI shoulda got me a plaque, I should get me more attention\nNo, you should shut the fuck up and leave all the bitchin' to bitches\n(Wuda cuda shuda ass nigga, ol' wuda, cuda)\n(Wuda cuda shuda ass nigga, ol' ol', ol')\n\n[Verse 1: 2 Chainz]\nShe in stilettos, she walkin’ all pigeon toed\nReally though, when it come to gettin’ dough\nIf you listen to me, I’m so underground\nYou have to sit on the floor, oh!\nI just thought I’d seen a spaceship, ride right past my airline\nEverybody know I dumps that white girl like Kevin Federline\nDon’t pay me no nevermind\nThese niggas is buggin’, pesticide\nI count money in my spare time\nJust paid a hundred dollars for a hairline\nLabel talkin’ bout what they woulda did\nBet they hustle me and you could be a winner\nGirl, you eat more pussy than me\nGirl, you shoulda been a nigga\nPockets swellin' up like Lymph nodes\nBeen a go-getter from the get go\nAlways talkin' bout what you was finna do\nDamn broad, thought that you were finna get dough!\n\n[Hook + Bridge]\n\n[Verse 2: Lil Boosie]\nYou a wuda, cuda, shuda ass hater\nWanna be a man so bad homie\nAin't wanna see me get free\nIf you could you would have caught the stand on me\nIf I would have shook your hand, I would have been your boy\nNow you extra hot since I dun' hit your broad\nNow you talkin' now, 'bout sparkin' now\nYou prolly would shoot somethin' if you had some heart\nThat Bentley come from exotic rentals\nGotta go back Sunday, so you flat broke Monday\nProbably could go spend 200 on somethin'\nIf you was gettin' Boosie money\nYou in King of Diamonds throwin' counterfeit\nYou might as well gon' pussy pop on the stage\nAll these rappers lyin' on records\nO-M-G Hip-Hop, Hooray!\nAnd you probably woulda been up in my video\nBut that was 'fore I went in\nAin't even write me no letter\nYou a wuda, shuda, cuda ass friend, busta!\n\n[Hook + Bridge]", "image": "https://images.genius.com/8b31226536bddeeb1ff5145959d1792f.420x420x1.jpg"}], "artist": "2 Chainz"}