{"songs": [{"title": "I Wanna Pimp You Hoe", "album": null, "year": null, "lyrics": "[Too $hort]\nI wanna pimp you hoe (pimp you hoe)\nI'm the only pimp you know (that pimp you know)\nMake that money when you go (make that money hoe)\nI just wanna spend yo' dough (spend yo' dough)\nGive a pimp what I need (what I need)\n'Kay, while I puff my weed (while I puff my weed)\nBuy you all the stuff I see (all that stuff I see)\nYou wanna get fucked by me.. by me..\n\nI know you think I'm crazy, based on how retarded I get\nAll these pimps on the mic, bitch I started that shit\nWhen Snoop was in elementary, I rapped on hella pimp beats\nKeep the rhymes in a big-ass box, that's never empty\nIn 1981 I said, \"Bitch suck my dick!\"\nAnd Freddie B, had the tooth fairy turnin tricks\nBefo' Eazy-E, Ice Cube, N.W.A\nI was spittin pimp rhymes, way up in the bay\nI grew up in L.A., back in the day mayne\nI moved to Oakland, and soaked up that bay game\nMo' bounce to the ounce, we was bumpin Spoonie Gee\nOr Grandmaster Flash, Sugarhill to me\nIn 1982 we had fun in the streets\nAll they played was Too $hort, and Run-D.M.C. nigga\nAnd I was rappin X-rated back then\nI was just a lil' kid, but a real mack pimp\n\nNow all these niggas, pimpin, without no hoes\nAll these niggas, rappin and can't rock no shows\nAnd the rest of y'all frontin, in your videos\nGettin it, actin like some silly hoes\nYou ain't pimpin mayne! You don't talk like we talk\nYou like a wannabe gangbanger tryin to C-walk\nYou ain't a crip motherfucker, and you ain't a B-dawg\nYou actin way too phony, and now you pissin me off\nFake gangster who you killed? Fake pimp what you sayin?\nYo' album sound fake, and you're fuckin up the game\nYou make a lot of rap fans, hate this shit\n$hort Dawg got a new one? I can't wait to get it\nIt's called \"Up All Nite,\" with Lil Jon and Jazze Pha\nAnd if you ain't heard yet, you know I have to say that\nBitches jammin, I know you want it now\n$hort Dawg got the hottest shit comin out\n\nYou know I have to say that\nBitches jammin", "image": "https://images.genius.com/f7947ca6d18485b4713ba9c89b2980c7.800x800x1.jpg"}], "artist": "Too $hort"}