{"songs": [{"title": "Pump Pump", "album": "Doggystyle", "year": "1993-11-23", "lyrics": "[Intro]\n*static*\nPump Pump, Pump Pump, Pump Pump, Pump Pump\nPump Pump\n\n[Verse 1: Snoop Dogg]\nLet the motion of your body be the key 'cause we\nBe the motherfuckin G Funk family\nNow, I'll play the G in this deadly game\nSnoop Dogg is the name Dogg Pound's the gang\nIf it ain't one thing it's a motherfuckin' nother\nWord to my granny and my daddy and my mother\nWhether standin on the corner or bouncin in the six-deuce\nWhen I was locked up, I couldn't wait to get loose\n'Cause back in the days, on the side where it's at\nA nigga had to have a fat stack\nAnd I was a fool, don't make me have to grab my strap and go\nRat-tat-tat-tat, nigga slap to a motherfucker face he fall\nCan't none of y'all niggas see the Doggy Dogg\n'Cause I'm one rude bwoy comin with the wickedness\nSo shut the fuck up, and listen while I'm kickin this\n\n[Hook]\nBlam blam, blam to dem all\nListen to the shots from my nigga Doggy Dogg (pump pump)\nBlam blam, blam to dem all\nListen to the shots from my nigga Doggy Dogg (pump pump)\n\n[Verse 2: Snoop Dogg]\nNow you can look to the Sun and spot the moon\nAnd see Snoop Doggy Dogg step into the room\nWith the G funk, he funk, she funk, we funk\nFollow me, follow me, listen to the words that a nigga (pump pump)\nI come down with the wickedness\nOne rude bwoy comin with the dopeness (blam!)\nClose your eyes 'cause you can't see me\nI quit school cause of recess you fuckin B.G\nI'm shakin up the party, like Lodi Dodi\nIs he the dopest? You better aks somebody\nWhen, then, send some gin\nAnd a pack of zig zags now let the games begin\nIn nineteen-motherfuckin-ninety-three\nI'm fuckin up every nigga known in the industry\nCheck this out, it's a Dogg Pound thang\nYou know who I am you know my motherfuckin name, who am I?\n(The S-N-Double-O-P) nickname (Silky Smooth) last name (D-O-double-G)\nThe behavior and the flavor that I found\nMakes me wanna hit that ass up with the Dogg Pound\n\n[Hook]\nBlam blam, blam to dem all\nListen to the shots from my nigga Doggy Dogg (pump pump)\nBlam blam, blam to dem all\nListen to the shots from my nigga Doggy Dogg (pump pump)\n\n[Refrain]\nDi da, di di di da di da, di-di di da, di di di da di da (Blam!)\nDi da, di di di da di da, di-di di da (Blam!) ba-da-bam! Ba-ba-ba-bam!\n\n[Verse 3: Lil' Malik]\nNow just back up, don't act up, I pack up much heat\nAny battle I'm in, I win, I can't be beat\nDon't sleep while I creep peep out my technique\nI forgot, I'm out of sight so you can't see the\nMC of the year, you hear and you fear\nI got somethin for them niggas in the front and the rear\nI handle the sides, did a driveby in the who-ride\nI'm satisfied now everything is really alright\nYou know when I come nigga I come wicked\nDon't need no permission, motherfucker I'ma kick it\nNiggas sweat my shit I wet 'em up with the biscuit\nLick 'em up shot, it don't stop, till dem all drop\nMake up your mind, go pop or slang rocks\nJust stop, ridin' on the next niggas jock\nI'm strapped with my Glock on your block\nAnd ready to let loose on the first imitator that I spot\n\n[Hook: Snoop Dogg & Lil' Malik]\nBlam blam, blam to dem all\nListen to the shots from my nigga Doggy Dogg (pump pump)\nBlam blam, blam to dem all\nListen to the shots from my nigga Doggy Dogg (pump pump)\nBlam blam, blam to dem all\nListen to the shots from my nigga Doggy Dogg (pump pump)\nBlam blam, blam to dem all\nListen to the shots from my nigga Doggy Dogg (pump pump)\n\n[Fade-out]\nDi da, di di di da di da, di-di di da, di di di da di da da\nDa di di da, da da da di di da da\nDa di di da, da da da di di da-\nDa di di da, da da da di di da da\nDa di di da, da da da di di da da\nBa-da-bam! Calm down, the shows over...", "image": "https://images.genius.com/d31a03639b8f8f4259b9b9da07972d52.996x1000x1.jpg"}], "artist": "Snoop Dogg"}