{"songs": [{"title": "Evil", "album": "Gangsta & Soul", "year": "2009-05-14", "lyrics": "[Intro Sample: Blizzard from the movie Juice]\n\"Don't look at me goddammit!\nAyo Q, you want a piece of this?\"\n\n[Verse 1: Schoolboy Q]\nCity filled with this filthy air\nEvil pump in my blood, how dare you to stare\nNever felt fair, no room for a tear\nCome on dump, don't give a fuck if the coast clear\nJacket cover the ratchet, pants hang to my calf\nBurner over the ab, sendin' shots under your jab\nYou really wanna diss me?\nBelieve it like Ripley when I'm off the fifth of whiskey\nDamaging my kidney, I wish a nigga tempt me\nThen it's all bad, leave his parents all sad\nCops with a mystery, murderin' ain't shit to me\nThis a killing symphony, my nigga, for real\nI still keep the weapon concealed, body will spill\nHollow tips stuck in your grill, give a fuck how you feel\nTired of resisting this murder addiction\nFuck a conviction, bust shots, slaughter conviction\nLucifer soul, my temperature cold\nEyes blood shot, throwin up blood clots, body in shock\nI need me a doc, but I figure I'm too sick\nFuck it, adrenaline pumping may lead in to something\nAssumption on life is still, livin' a trife\nAsthmatic causing havoc, keep spazzin' til my brain get damaged\nStill remain most scandalous, that bang hammers\nFuck surveillance, shit, murk in front of cameras\nDump 'em in the sand like tan or big blands\nMore grammar shit, I'm the illest motherfucker\n\nVerse 2: [Kendrick Lamar]\nSplash blocks like Dikembe when I sensai, who wanna shoot?\nThe liquor hear me, I'm off the Remy like Papoose\nI got the truths of a thousand bishops\nTroops of a thousand niggas, you can get your ass missing\nLike a white bitch with big tits to be specific\nI'm over they heads when the words get pledged\nFright night, gun tucked tight like a newborn\nDance with the Devil, hopefully you get your groove on\nWhen I blaze this metal\nLike a rolling stone, flesh and bones come out\nLike a thug reunion, watch yall dumb out\nMost likely, half of you fraudulent niggas don't like me\nScared to fight me even if you had hands just like me\nK Dot, bare arms like a haltertop\nLive from the barbershop, who want a fade?\nWho want war? I got a drawer full of hand grenades\nTake it back to them Contra days, so fall back\nIt's real, off cognac, and pills, we twist caps then peel\nBananas with the hammers, play if you will\nA bullet proof for a shield, that won't work\nI got big big very big big bullets, and they hurt\nLift up your skirt if you play pussy, don't push me, I'm light\nYou pushing up daisies, if the pump do a push up tonight\nI put, I put a new price on your head, like a mannequin dressed well\nStudents from Harvard can hear the nigga Yale\nI'm cold hearted, oh well\nI get's retarded, the yellow bus I'm a park it\nIn front of your house, hop out, gun in ya mouth (Blakka!)\nDuck shows in your peek hole, me and my Hoover crip\nBut all I bang is your bitch, don't get me twist\nLet's do this, I'm ludicrous, disturbing the peace\nPacing back and forth like a stewardess, it's plain to see\nDa Evils\n\n[Outro: Bishop (2Pac) discussing Blizzard's death from Juice]\n\"If you gotta go out, that's how you go out!\nThat motherfucker took his destiny in his own hands!\"", "image": "https://images.genius.com/5be8aea8d73e30772a3a8919cc421f1f.500x500x1.jpg"}], "artist": "ScHoolboy Q"}