{"songs": [{"title": "Asshole", "album": "The Marshall Mathers LP2", "year": "2013-11-05", "lyrics": "[Verse 1: Eminem]\nCame to the world at a time when it was in need of a villain\nAn asshole, that role I think I succeeded fulfillin'\nBut don't think I ever stopped\nTo think that I was speaking to children\nEverything was happening so fast\nIt was like I blinked—sold three million\nThen it all went blank, all I remember is feelin' ridiculous\n‘Cause I was getting sick of this feelin'\nLike I'm always under attack, man\nI could have stacked my shit list to the ceilin'\nWomen dishin' but really thinking: \"If anyone ever talks to one of my little girls like this I would kill him.\"\nGuess I'm a little bit of a hypocrite when I'm rippin' shit\nBut since when did this many people ever give a shit\nWhat I had to say? It's just my opinion\nIf it contradicts how I'm livin', put a dick in your rear end\nThat's why every time you mentioned a lyric\nI thanked you for it, for drawing more attention toward it\n‘Cause it gave me an enormous platform\nI'm flattered you thought I was that important\nBut you can't ignore the fact that I fought for the respect\nAnd battled for it, mad awards, had GLAAD annoyed\nAtta-boy, they told me to slow down, and I just zoned out\nGood luck tryin' to convince a blonde\nIt's like telling Gwen Stefani she sold out\n‘Cause I was tryin' to leave, no doubt\nIn anyone's mind one day I'd go down in history\nThink they know now, because everybody knows\n\n[Chorus: Skylar Grey]\nEverybody knows that you're just an asshole\nEverywhere that you go\nPeople wanna go home, everyone knows\nEverybody knows, so don't pretend to be nice\nThere's no place you can hide\nYou are just an asshole\nEveryone knows, everyone knows\n\n[Interlude: Eminem]\nThanks for the support, asshole! *scratch*\nThanks for the support, asshole!\n\n[Verse 2: Eminem]\nQuit actin' salty! I was countin' on you to count me out\nAsk Asher Roth when he round about\nDissed me to shout me out\nThought I was history, but goddamn, honky\nThat compliment's like backhanding a donkey\nGood way to get your ass socked in the mouth\nNah, I'm off him\nBut what the fuck is all this trash-talkin' about?\nThe fight was fixed, I'm back and you can't stop me\nYou knocked me down, I went down for the count\nI fell, but the fans caught me, and now\nYou're gonna have to beat the fuckin' pants off me\nTo take my belt—word to Pacquiao\nMomma said there ain't nothin' else to talk about\nBetter go in that ring and knock 'em out\nOr you better not come out\nIt's poetry in motion\nLike Freddie Roach when he's quotin' Shakespeare\nSo what if the insults are revoltin'?\nEven Helen Keller knows life stinks\nYou think it's a joke 'til you're bullet-riddled\nBut you should give little shit what I think\nThis whole world is a mess\nGotta have a goddamn vest on your chest\nAnd a Glock just to go watch Batman\nWho needs to test a testicles? Not that man\nHalf of you don't got the guts and intestinal blockage\nRest of you got lap bands\nStuck to this motto before they put bath salts\nAnd all those water bottles in Colorado, so get lost, Waldo!\nMy soul's escapin' through this asshole that is gapin'\nA black hole, and I'm swallowin' this track whole\nBetter pack toilet paper, but I'm taking no crap, ho\nHere I go down the Bat Pole\nAnd I'm changing back into that old maniac\nIn fact there they go tryin' to dip out the back-door retreatin'\n‘Cause everybody knows\n\n[Chorus: Skylar Grey]\nEverybody knows that you're just an asshole\nEverywhere that you go\nPeople wanna go home, everyone knows\nEverybody knows, so don't pretend to be nice\nThere's no place you can hide\nYou are just an asshole\nEveryone knows, everyone knows\n\n[Verse 3: Eminem]\nHoly mackerel! I'm the biggest jerk on the planet Earth\nI smacked a girl off the mechanical bull at a tractor pull\nFor thinkin' we had some magnetic pull\nThen screamed \"ICP in this bitch! How do fuckin' magnets work?\"\n‘Cause you're attractive, but we ain't attractable\nHate to be dramatical, but I'm not romantical\nI'm making up words you can understandable, it's tragical\nThinkin' some magical shit's gonna happen, that ain't practical\nYou crackin' a joke, it's laughable\n‘Cause me and love's like a bad combination\nI keep them feelings locked in a vault\nSo it's safe to say I'm uncrackable\nMy heart is truly guarded, full body armor\nBitch, you just need a helmet\n‘Cause if you think you're special, you're retarded\nThinkin' you're one of a kind like you got some platinum vagina\nYou're a train wreck, I got a one-track mind\nShorty, you're fine, but you sort of remind me of a 49er\n‘Cause you been a gold digger since you was a minor\nBeen tryna hunt me down like a dog\n‘Cause you're on my ass but you can't get a cent\n‘Cause all of my spare time is spent\nOn my nose in this binder, so don't bother tryin'\nOnly women that I love are my daughters\nBut sometimes I rhyme and it sounds like I forget I'm a father\nAnd I push it farther\nSo, Father, forgive me if I forget to draw the line\nIt's apparent shouldn't have been a parent\nI'll never grow up, so to hell with your parents\nAnd motherfuckin' Father Time\nIt ain't never gonna stop a pessimist\nWho transformed to an optimist in his prime\nSo even if I'm half-dead, I'm half alive\nPoured my half empty glass in a cup\nNow my cup has runneth over\nAnd I'm 'bout to set it on you like a mothafuckin' coaster\nI’m going back to what got me here\nYeah, cocky, and can’t knock being rude off, so fear not, my dear\nAnd dry up your teardrops, I'm here\nWhite America's mirror, so don't feel awkward or weird\nIf you stare at me and see yourself, because you're one too\nShouldn't be a shock, because everybody knows\n\n[Chorus: Skylar Grey]\nEverybody knows that you're just an asshole\nEverywhere that you go\nPeople wanna go home, everyone knows\nEverybody knows, so don't pretend to be nice\nThere's no place you can hide\nYou are just an asshole\nEveryone knows, everyone knows", "image": "https://images.genius.com/2c354260f9edc6b2e9bf6b06c935a0b8.1000x1000x1.png"}], "artist": "Eminem"}