{"songs": [{"title": "Frozen", "album": "The Art of Storytelling", "year": "1999-03-25", "lyrics": "[Intro x4]\nHow can I forget you?\n\n[Slick Rick]\nRick the Ruler, Raekwon, hehe the Chef, check one, two\n\n[Verse 1: Raekwon]\nTouch more, taste a glass of oil, flash yours Rick\nMoney we saw, left 'em dead on the door, dick\nRocks look chunky on the index\nStraight up, Lee vets and like old Adidas sweats\nWe the illest vets\n\n[Verse 2: Slick Rick]\nApologies, even a non-dog holler \"He's honor\"\nPlease, appreciate shit I Clark Wallabee's\nBrothas wit they fists like oaks wood\nProvokes doom, and you're also about to go broke soon\n\n[Verse 3: Raekwon]\nMad current merchants, we nursed it, bad guerillas\nFeed us like guaranteed they gon' kill us\nFleein', ninety in a night suit, G-in' white dudes\nHit the locks first, we made a right troop\n\n[Verse 4: Slick Rick]\nI'm lushin' Russian women, via satellite I'm watchin'\nI dare a nigga say he wanna battle me, I'll crush him\nEven blind girls rush next to Hammera and scream out\n\"Oh my gosh, get the camera\"\n\n[Chorus: Raekwon]\nYo, we frozen, lay on, about now we a day on\nIll niggas yellin' \"Throw Rick and Rae on\"\nHydro, how did I blow, how did I flow?\nDid I glow? Let them niggas know\n\n[Verse 5: Slick Rick]\n(Yo) Rap wars commence and they kids cause offense\nI don't have to say a word and your bitch' drawers are drenched\nDidn't say I was gonna murder the fella\nBut The Ruler got some shit the could stop a herd of gorillas\n\n[Verse 6: Raekwon]\nStressed wit Hollywood hoes, actin' up\nBackin' up, what? This yours, what?\nCrawlin' in the cut, we Lee Major\nGems on wit Timbs, brims on drawn to lay you up\nLayin' in the 'dezvous, what?\n\n[Verse 7: Slick Rick]\nNext pull up CEO wit bank books full up\nEven though he's overwhelmed, this nigga Rolls Royce pull up\nOne of the baddest come, noddin' to a Spanish song\nSlung, orange Woolridge park and a Savannah pump\n\n[Verse 8: Raekwon]\nSevere teaspoons, scary money on the moon\nLampin' wit a big goon, keep shit tight like a kid's room\nBig Bird in the driveway, pull it out, Friday\nI'm liver that way, I ride only the fly way\nOlive-green thinkin', ship sinkin'\nDeep-dish thinkin', big fish tank, wrist full of Franklins\nThis is mock-neck, shark-skin money\n'88, summer, read the dunn, dummeries rock dungarees\n\n[Verse 9: Slick Rick]\nPunctures his lung, son says \"I don't want this\"\nEven this so-so beat I make monstrous\nLady cops stake to watch pair hoods\n\"Freeze, you're under arrest, you look mad good\"\nHot and don't fret retard who won't let\nThe new sheriff's in town, what part you don't get?\nRick and Rae are now restorin' the passion\nThe fashion, the class, I went to work on your ass\n\n[Chorus x2]", "image": "https://images.genius.com/73539fff4e6ebc470e6cab73853f0ac6.1000x1000x1.jpg"}], "artist": "Slick Rick"}