{"songs": [{"title": "First Word Freestyle", "album": null, "year": null, "lyrics": "[Paul Rosenberg]\nFirst Word, Excrement\n\n[Eminem]\nExclimate, is that what you said?\nMy next defense, against these extra men\nWho try to step to me and wanna have sex again\n\n[Vaseline]\n\n[Eminem]\nYou little sickass, I'll spray em with gasoline\nThey try to jack me off with Vaseline\nMy ass is mean, I smash your spleen\nWhen I crash the scene\n\n[Cell Phone]\n\n[Eminem]\nWith a cell phone, now who the hell is home?\nY'all can't tell Paul how to throw me words\n\n[Animal Crackers]\n\n[Eminem]\nCause animal crackers is what I do when I eat MC's like a cannibal backwards\nHa ha, I got it, that's not it\nFake rappers been spotted\n\n[Broken Headphones]\n\n[Eminem]\nLike broken headphones, you head home, you sped home\nYou get your head blown, rappers try to step, they speak in the dead tones\nSo I ain't trying to hear them, give me another, word for your mother\n\n[Stretch Armstrong]\n\n[Eminem]\nStretch Armstrong, my brother, coming with rhymes every time that I be drumming\nRunning with this shit when I kick a bitch in the stomach\nAnd star wars, this car's a Taurus\nYo, how many bars we hit tonight, cause I'm drunk off\n\n[Peanut Butter]\n\n[Eminem]\nOff peanut butter, you see my dick and you start to stutter\nStart to utter, words that you shouldn't utter\n\n[Mark Whalberg]\n\n[Eminem]\nCause Mark Whalberg is a small turd, and I'mma step on him like dogshit\nA fore fist, so rappers just get off it, I come across with\n\n[Pulp Fiction]\n\n[Eminem]\nWith pulp fiction, yo I'll eat you like a big gulp addiction\nLike slurpees, got herpes, got a hair piece, rest my anises(?)\nGot brain damage, I'm dumber than rain man is\nThere's mayonnaise on this, I need a plain sandwich\nHurry up, give me one, rappers try to step to this static they wanna give me none\n\n[Fresh vegetables]\n\n[Eminem]\nWith fresh vegetables, my testicles are hanging off to the left of you\nYou're bisexual, and there's a guy next to you, standing, rappers know that I\nBe-\n\n[Preparation H]\n\n[Eminem]\nPreparation H, you didn't even let me finish my rhyme\nJust shut up for one more time, while I just shine, on this\nMicrophone, cause I'mma be honest, any MC who tries to step to this\nI'm making you a promise, that what? Give me a word\n\n[Nostradamus]\n\n[Eminem]\nThat Nostradamus is blowing up your house, killing your foster mammas\nAnd coming back to get your parents, well I have it\nThese rhymes are fourteen karat, solid gold\nRappers step to me, you get your wallet stole\n\n[Times Square]\n\n[Eminem]\nIn Times Square, I got blonde hair, I'm higher than con air\nRappers don't want to see me, I'll butt fuck Goldie Hawn bare\nIn a lawn chair, cause I'm there\n\n[Kurt Russell]\n\n[Eminem]\nWith Kurt Russell, saying \"come here Goldie, you want my love muscle?\"\nI know you want it, I get blunted, then I\nKick these, freestyles just like whipped knees\n\n[Taxicab]\n\n[Eminem]\nWith a taxicab, I'll smack a bitch with a maxi pad\nWhere we going? Don't ask me dad\nLeave me alone, I'm not trying, to even hear you\nDad, I hope you're fucking dying, off this porno mag\nYo, did you see my ad? Yo, wait a minute, did you see my ass?\nIs what I meant to say, I meant to say a rhyme that goes this way is elementary\nFor the century, Slim Shady's is gonna be the illest\n\n[Flamingos]\n\n[Eminem]\nWhat? Flamingos? My mother goes out and plays bingo\nEvery single day, at the bingo hall, that's why my dick is single, small\nDidn't blow up, just don't give a what? A cuff?\nDidn't blow up, just don't give a what? A cuff?\n\n[DT's fired]\n\n[Eminem]\nBut DT's fired, he's retired, he's not hired, yo plus I'm tired\nOf busting and spitting this rhyme nonstop, I'm on top\nTaking records to the pawnshop, stretch\nDamn, see my big ick? Catch\nPut a D in front of it, rappers don't want none of it\nComing with a ton of shit to spill, Slim Shady out, I get ill with the skill\nBaby, aight baby, Slim Shady\nKick eighty million rhymes, till I'm older than Grady\nSpilled gravy, all over my damn navy blue avi\nBye bye", "image": "https://images.genius.com/b379811c1415017b9f3e3a71b9d26060.400x400x1.jpg"}], "artist": "Eminem"}