{"songs": [{"title": "Grove St. Party", "album": "Sorry 4 The Wait", "year": "2011-07-13", "lyrics": "[Intro: Lil Wayne]\nWoo!\nHahahaha\n\n[Verse 1: Lil Wayne]\nI got a whole lotta money, pop that pussy for me\nMy homie got that yopper, he'll bang it at a copper\nAy, gangsta party, gangsta party, gangsta party!\nStove on my waist, cook your ass up, gourmet\nAll-black .44, do you want foreplay?\nI'm going at your face like Oil of Olay\nNo champagne, but you know my flag Rosé\nSwagger on steroids: Canseco, Jose\nNo Limit Records: we so 'bout it 'bout it\nI'm higher than a bitch, feel like I climbed a fucking mountain\nIllest nigga you know, my accountant's still counting\nShot hit him a minute ago but his body's still bouncing\nBeam on the hammer, beam on your forehead\nGotta kill the witnesses 'cause Birdman car red\nHollygrove Monster, Eagle Street creature\nCome to your funeral, kill everybody but the preacher\nI live in Miami, nigga, I'll South Beach ya\nRobin Leach, uh, that's how we ballin'\nYou know that I'm loaded, but please don't think its sweeter\nBeat one of you bitch niggas up like John Cena\nThem hoes on Young Money, tell them hoes we coming\nBoy, we get it popping, we ain't saving hoes, we swapping\nYeah, gangsta party, gangsta party, gangsta party!\nBig head Desert Eagle, call it \"shotty\"\nHow'd you get that money? Stunna taught me that\nThat Xan took me under, patron brought me back\nI'm leaning on you muthafuckers like I caught a flat\nAnd that Glock snap back like an old Starter hat\nWhat the lick read? I'm in the big league\nI'm a breath of fresh air \"Let the bitch breathe!\"\nI'm trying to chillax but I had to do it, dev\nI'm at the funeral like \"I had to do it, rev!\"\nMack you my big brother, I split a wig for you\nPut that on their repeat until they bury me\nMoment of clarity: yeah, that's my diamond game\nI keep a fine bitch 'cause I like the finer things\nFuck with me slime\nNo brain on the whip, I've got nothing in mind\nCarter 4, they ain't fucking with mine\nI drop that Sorry 4 the Wait to make up for the time\n\n[Verse 2: Lil B]\nYeah I do my thang, bitch what's up?\nYoung BasedGod, came in with the ballers\nIced out chain, bitch, I'm rich off that same shit\nSixty-five hoes on my dick, bitch, it's Christmas\nStraight Westside, Bay Area bitch, I'll grave em\nPretty boy shit, Based God finna hang em\nArmed like a cradle and you niggas can't stop me\nShouts out to Mack Maine getting rich and cocky\nBitch it's still West side, shouts out to Weezy\nYoung BasedGod with that 55 heater\n187 bitch, I pull a 2-11 bitch\nWith that tiny shirt mane and the tiny pants mane\nI'm on BasedWorld and I fuck with, Cash Money niggas\nDon't understand, Maine, they gang like a chain\nWoo woo! Swag, bitch, Brang-dang-dang-dang\nMan, bruh, off top, I'm a Wolfpack hitter\nMan, my life just a painting and I paint you a picture, mane\nThink about it: a young paid-ass nigga\nThis that stuntin' music; bitch, I just do's it\nIt's Lil B and I'll muthafuckin prove it, we run it! (Swag!)\n\n[Outro: Lil B]\nMan, shouts out to Maine and Wayne, man\n(Shouts out to New Orleans!)\nI can't believe it's niggas getting money down here who fuck with me! Swag! (West side!)\nWeezy, I see you! What it do!\nThat motherfucking partying\nBitches, man, what it do? Yeah!\nAyyyyy", "image": "https://images.genius.com/a22efe31e108ac84ea44f489ff2716f3.320x320x1.jpg"}], "artist": "Lil Wayne"}