{"songs": [{"title": "Ooh Wee", "album": "Todd Smith", "year": "2006-04-11", "lyrics": "[Ginuwine]\nGimme all you got girl.. gimme, gimme {*4X*}\n\n[LL Cool J]\nUhh, yeah, uh-huh\n\nIf I'm hot for you and you hot for me\nWhat you got for me is no shock to me\nStill can't believe you're my property\nThe sound of you ploppin on top of me\nThe feelin of, hittin the lottery\nOr passin \"Go\" twice in Mono-poly\nDoesn't, dare to compare to what you got for me\nThe taste of the puddin is so chocolatey\nHope to seein it, so I'm seein it\nStill got my sneakers and my chain on lean in it\nMoonlight hit it right it start gleamin\nMean faces, for what was the meanin?\nPop it a little bit and, drop it a little bit\nIt's, hard to read you I feel like I'm illiterate\nBut I'm ready for the graduation\nYeah, right there, repeat that rotation\n\n[Chorus: Ginuwine]\nGive me all you got baby tonight (tonight)\nNow's the perfect time; come blow my mind\nIt's cold out here please let me come inside (let me come inside)\nOooh so warm at night; you blow my mind - hey yeahhh\n\n[LL Cool J]\nYeah baby go ahead and talk greasy\nTell me how you never had it this deeply\nI'mma whisper slick, you respond sweetly\nExtra freaky, I trick and you treat me\nI'll give, you take, but don't hesitate\nWhen you feel it girl, throw it right back\nJust let me hold ya by your shoulders\nDamn, you can take it like that?\nI knew you was a champ girl\nYou got your leg on the dresser kickin the lamp girl\nRun the shower let's head in the bathroom girl\nCause the temperature's hotter than high noon girl\nI crack that do', let the steam blow\nAin't nobody here but me and you, let it go\nYou never had it this good, you already know\nGive me all you got tonight, really though\n\n[Chorus]\n\n[LL] Take it to the bridge\n\n[Interlude: Ginuwine]\nYou're the sexiest woman I've ever known\nBaby my mind is blown\nIt's simply beautiful, how you do it to me (OW!)\nYou're showin me things I'd never do\nA whole 'nother side of you (side of you)\nJust keep doin what you do, it feels like ooh wee!\n\n[LL Cool J]\nYou can go and have the wild climax\nAin't no way I'm 'bout to let you relax\nLet me see if you can hold me on your back\nLet me see you wind your body to the track\nPop it a little bit and, drop it a little bit\nIt's, hard to read you I feel like I'm illiterate\nBut I'm ready for the graduation\nYeah, right there, repeat that rotation\n\n[Chorus]\n\n[Ginuwine]\nGimme all you got girl.. gimme, gimme {*4X*}\n\n[LL over Ginuwine]\nBeautiful, yeah, keep it right there\nI like that\n\nYeah, uh-huh, yeah\nAwww man, yeah.. {*fades out*}", "image": "https://images.genius.com/8f036bc91d1ae759df9acb3ca88e0c5f.1000x1000x1.jpg"}], "artist": "LL Cool J"}