{"songs": [{"title": "How To Be a Player", "album": "The Pimp Tape", "year": "2018-11-09", "lyrics": "[Intro: T.I.]\nAyy\nI don't know what the fuck you niggas thought\nY'all niggas hollerin' that \"pimpin'\" 'cause it sound good\nNigga, back when I was 17, I fuck with my re-up, nigga, I get it out a bitch partna\n\n[Verse 1: T.I.]\nMan I can show you how to pimp (I really could)\nBetcha you won't comprehend it (Uh uh)\nAin't no pimpin' in your heart, so your heart won't be in it\nThat's my bitch, she might spread her legs for ya\nBut I bet your bottom dollar she won't have no bread for ya\nServe 'em Cocktail, yeah, just like my nigga $hort Dog ($hort Dog)\nSo need a dollar from my bitch? I bet you short, dog\nA jack-of-all-trades (Uh huh,) mack of all sort\nYou throw a one, and I throw that ho a fork\n'Cause she done, and well at that\nFor you to have her sellin' that like crack\nBack in my day, on highways and byways\nBeen up 'bout four, five days\nGet a bank roll out the stank ho\nThen the Chevy burn rubber sideways\nBitch, if I say (I say) \"You on fleek, go pull a trick\"\nGo hook your lil ass up with your temper, don't be arguin' me\nNigga think they pimpin' 'cause they bitch'll let 'em borrow a hundred dollars\nShorty, shit, I need a quarter mil' tomorrow\n\n[Chorus: Adrian Marcel]\nI'll show you how to be a player, swimmin' in these women\nLike a motherfucker (Like a motherfucker)\nSippin' on that Slurricane (Whoa)\nI don't chase 'em, I replace 'em, like a motherfucker (I don't chase 'em baby)\nAll these bitches know my name\nI'm a player in the morning, player in the evening (Player)\nBlowin' O.G. I know you see it\nAin't got time for all the games, I'm hustlin' every season\n(Ain't got time, ain't got time, ain't got)\n\n[Verse 2: Too $hort]\nSo you wanna be a player, like Playboy $hort\nI done taught more players than a coach on the court\nIt started many years ago before I started to rap\nThis player lifestyle, I was born for that\nSee one thing about me, I love to spit that game\nControl her brain, make my ho keep payin'\nIt was never about the fame, I want the fortune\nWe ain't splittin' shit, bitch, I want the whole portion\nHoes do what I say, I ain't gotta force 'em\nGet a brand new Ferrari, 800 horses\nPimps taught me how to send 'em, before a nigga bend 'em\nYou'll never get a dime if you rush and stick it in her\nSo don't sneeze and don't cough, tell her \"Break yours off\"\nGo hard on these hoes, pimp, you can't be soft\nWe in the V.I.P. blazin' tree\nAny nigga that's a hater wasn't raised by me\n\n[Chorus: Adrian Marcel]\nI'll show you how to be a player, swimmin' in these women\nLike a motherfucker (Like a motherfucker)\nSippin' on that Slurricane (Whoa)\nI don't chase 'em, I replace 'em, like a motherfucker (I don't chase 'em baby)\nAll these bitches know my name\nI'm a player in the morning, player in the evening (Player)\nBlowin' O.G. I know you see it\nAin't got time for all the games, I'm hustlin' every season\n(Ain't got time, ain't got time, ain't got)\n\n[Verse 3: E-40]\nI'll hypnotize a bitch mind, like a Hindu do a cobra\nIn my pimp cup I got wine with my lobster from Nova Scotia\nThese suckas be killin' me, got my name in they teeth\nBe all in their fillings, just like some teeth\nOne thing I don't like is a liar and people stealin' (Stealin')\nAll I think about is survival and makin' millions (Survival and makin' millions)\nMy paper bipolar, it's got its ups and its downs\nI stay with a toaster, never know who around ('Round)\nBaboon pimpin', I be shot callin' (Shot callin')\nGive her the 30 second checkin', for reckless eye-ballin' (Ballin')\nI come from nothin' now I'm somethin' (Now I'm somethin')\nYou might wanna wrap your hands around your woman (Around your woman)\nGame 201, never trust a bitch (Never trust a bitch)\nPussy got you sprung, now you give her chips\nGame 202, never lighten up (Never lighten up)\nGo hard on the bitch and keep a pistol on the tuck\n\n[Outro: Adrian Marcel & E-40]\nGot that Rollie on my wrist, yeah\nCardier's on Biatch!\nBaby hella thick, ass full grown (Full grown)\nI'ma slide up in it, how you want girl (How you want, girl)\n'Bout to slide up in it, what you want?\nI'ma, I'ma when your girl ain't home\nBut she can get it too and lil' baby at the door, yeah\nI'ma slide up in it, how you want it (How you want, girl)\nHow to be a real player", "image": "https://images.genius.com/46e22a0f3338d4832cc1464e3d1176d3.680x680x1.jpg"}], "artist": "Too $hort"}