{"songs": [{"title": "Everything They Owe", "album": "Until the End of Time", "year": "2001-03-27", "lyrics": "[Intro: 2Pac]\nImagine if we could go back\nActually talk to the motherfuckers that persevered (hehehe)\nI mean the first motherfuckers that came in the slave ships\n(Hey, excuse me, excuse me) Y'know? (Look)\n\n[Verse 1: 2Pac]\nWe back for everything you owe, no longer oppressed\n'Cause now we overthrow those that placed us in this rotten mess\nBut let's agree on strategy and pick out enemies right\nWho stands accused of the abuse my own, kind do right\nPardon, not disregardin' what you thinkin' but you must abandon ship\n'Cause once I rip your whole shit is sinkin'\nSupreme ideology, you claim to hold\nClaimin' that we all drug dealers with empty souls\nThat used to tempt me to roll, commit to violence\nIn the midst of an act of war, witnesses left silent\nShatter, black talon style, thoughts I throw\nIt remains in your brain then of course it grows\nMaybe, even your babies can produce and rise\nPicture a life where black babies can survive past five\nBut we must have hope, quotin' the reverend from the pulpit\nRefuse to turn the other cheek we must defeat the evil culprit\nLace me with words of destruction and I'll explode\nBut supply me with the will to survive, and watch the world grow\nThis ain't 'bout talkin' 'bout problems, I bring solutions\nWhere's the restitution, stipulated through the constitution\nYou violated, now I'm back to haunt your nights\nListen to the screams, of the lives you sacrificed\nAnd in case you don't know, ghetto born black seeds still grow\nWe comin' back, for everything you owe\n\n[Hook: sung]\nI'm comin' collectin' the shit that belong to me\nMotherfuckers are runnin' and duckin'\nI'm a crazy nigga on a mission wit' a bad mentality\nArmed with missiles guns grenades\nPull out the pin, free I'm comin'\n\n[Collision: 2Pac]\nHow do you plead Mr. Shakur, how do you plead?\nHow do I plead?\nYes sir, how do you plead?\nShit, you know how I plead\nC'mon!!\nPsssh\n\n[Verse 2: 2Pac]\nNot guilty on the grounds of insanity it was them or me\nBustin' at my innocent family, say they lookin' for ki's\nI was home alone, blind to the prelude\nBust in, talkin' bout, \"Where is the quaaludes?\" What you say fool?\nWhere in the hell is the search warrant?\nNo feedback is what he uttered, before he screamed \"Nigga motherfucker\"\nDropped me to my knees, I proceed to bleed\nSufferin' a rain of blows to my hands and knees\nWill I survive, is God watchin'?\nI grab his gat and bust in self-defense, my only option\nGod damn!\nNow they got me goin' to the county jail\nAnd my family can't pay this outrageous bail\nTry to offer me a deal, they told me if I squeal\nMove me, and my people, to a mansion in Brazil\nNot me, so this is how it ends, no friends\nI'll be stressed and they just, repossessed my Benz\nTold the judge it was self-defense, he won't listen\nSo I'm bumpin' this in federal prison, givin' everything I owe\n\n[Hook: sung]\nI'm comin' collectin' the shit that belong to me\nMotherfuckers are runnin' and duckin'\nI'm a crazy nigga on a mission wit' a bad mentality\nArmed with missiles guns grenades\nPull out the pin, free I'm comin'\nI'm comin' collectin' the shit that belong to me\nMotherfuckers are runnin' and duckin'\nI'm a crazy nigga on a mission wit' a bad mentality\nArmed with missiles guns grenades\nPull out the pin, free I'm comin'", "image": "https://images.genius.com/74b94f4112372859edd6ae711af0df41.1000x1000x1.jpg"}], "artist": "2Pac"}