{"songs": [{"title": "CoCo", "album": "Sorry 4 The Wait 2", "year": "2015-01-20", "lyrics": "[Intro]\n(Juice 808)\nLook what you made me do\nMe! That's who\n\n[Pre-Chorus]\nI'm sorry for the wait, I'm sorry for the wait (Tell 'em, tell 'em!)\nTha Carter gon' be late so I cooked up a tape (Tell 'em!)\nThe garden's full of snakes so I had to escape\nLil homie gon' be straight, lil homie gon' be straight!\nWoo! OW!\n\n[Chorus 1]\nAnd this that Sorry 4 The Wait 2\nYeah, and I'm sorry for the wait, too\nI told myself to save yourself\n'Cause I can't save you (I can't save you)\nI send my goons to kill somebody\nI need head proof (I need head proof)\nFuck it (fuck it!) This that Sorry 4 The Wait 2\nI ain't trippin', I got Barbie, I got Drake too (I ain't trippin'!)\nI send my goons to kill somebody, I need head proof (Mula!)\nThen they come through and sit it on my coffee table\nBoop!\n\n[Verse 1]\nWho kept this shit together? Nigga, me, that's who (nigga, me!)\nWho was there when niggas left us? Nigga, me, that's who\nCash Money is an army, I'm a one man army (yeah)\nAnd if them niggas comin' for me, I'm goin' out like Tony\n(Bap-bap-bap-bap)\nNow I don't want no problems\nI just want my money (want my money)\nAin't gotta hold no conversation\nNor my luggage (nor my luggage)\nTell whoever's countin' that I'm on a hundred\nWoo, Birdman Junior – more like Ugly Duckling\n\n[Bridge]\nTakin' over, now I'm takin' over, yeah (now I'm takin' over)\nThink it over? Bitch, I'm thinkin' forward, ta\nI'm sippin' lean out a glass, nigga\nAll I got is Young Money – no more Cash, nigga, ayy!\n\n[Hook 2]\nAnd this that Sorry 4 The Wait 2\nNo more am I my brother's keeper – Cain and Abel\nYoung Money sharp, I'm still eatin'\nI just chipped my tooth (Mula!)\nTell them niggas – no love lost, 'cause I ain't got shit to lose\nI told myself to save yourself\n'Cause I can't save you (I can't save you)\nI send my goons to kill somebody\nI need head proof (I need head proof)\nI found the needle in the haystack, put the thread through\nI tried to stitch the wound back up, but I just bled through\n\n[Verse 2]\nYeah, it's compensation over conversation (no more conversation)\nLord, I must got blurry vision, a nigga's got two faces (amen)\nLord, this game is a vampire (woo!)\nBlood, you gotta protect your neck\nIt'll suck you dry like raisins, Lord\nBut fuck that, nigga, got it drawn out\nFuck that nigga, I'ma ball out\nThe day you met me is the day Hell froze\nOn the day I left is when it thawed out (ayy!)\nI'm still in the buildin'\nI just had to knock a couple walls down, had to kick y'all out (ayy)\nLife is a movie, but sometimes a nigga get too tired of watchin'\nAnd walk out\n\n[Bridge]\nTakin' over, Lord I'm takin' over\nDropped the Sorry 4 The Wait until the wait is over\nSippin' lean out a flask, nigga\nAnd all I do is smoke, fuck, and thrash, nigga, ayy!\n\n[Hook 3]\nAnd this that Sorry 4 The Wait 2 (sorry for the wait)\nFuck these haters, throw your board up if you skate too\nI send my goons to kill somebody, I need head proof\nThen they come through and sit it on my coffee table\nTunechi – niggas don't appreciate you (don't appreciate you)\nYou've been down since day one\nIt meant nothin' on day two (damn)\nSometimes the truth is hard to swallow, and to say, too\nBut I graduated from that bullshit, now I hate school\n\n[Outro]\nAnd now I'm takin' over, now I'm takin' over (takin' over)\nThe old me dead and gone, that's who I'm prayin' over\nMight have to go back to slangin' yola 'til the wait is over\nIf so, then I got bakin' soda, I got bakin' soda...", "image": "https://images.genius.com/c84ee812d9e99028d560054b386d4d9d.500x500x1.jpg"}], "artist": "Lil Wayne"}