{"songs": [{"title": "Really Ready", "album": "Trap God 2", "year": "2013-02-12", "lyrics": "[Intro: Terrence McKenna]\n\"...it’s about feeling. The combination of young people, drugs, a fairly sexually charged social environment, and syncopated music is just all designed to draw you into you and your friends and your scene, and your hood, and your place in the cosmos and not sell you out as a consumer to a Hollywood, or Manhattan-manufactured forms of entertainment.”\n\n[Verse 1: Gucci Mane]\nI'm a real nigga, talking 'bout what I really have\nCause I fucked a nigga bitch, that's why he really mad\nHit a nigga in his head, I be really glad\nSince the day I lost Dunk, I been really sad\nA nigga make a hit and dip, will he really last?\nA nigga say he hold you down but will he really blast?\nThey say I'm worth fifteen M's but that ain't really shit\nAnd I ain't content with what I got, got to be really rich\nSold dope on the really, was broke on the really\nIf you really wanna get it then you know I'm with it\nReally wanna go to war with me, not really\nYou wanna get it then you gonna get it\nYou worth a mill', not really really\nI ain't all in your business\nIf it's not your girl not really really, then why is it hurting your feelings?\n\n[Chorus: Gucci Mane]\nMy young niggas, they really ready\nStraps cocked, out ready\nThese rap niggas are really scary, talk loud but ain't ready\nWe tote choppers like military, niggas gotta get passed us\nYour girl with me, you real embarrassed\nDamn I'm fucking your marriage\nMy young niggas, they really ready\nStraps cocked, out ready\nThese rap niggas are really scary, talk loud but ain't ready\nWe tote choppers like military, niggas gotta get passed us\nYour girl with me, you real embarrassed\nDamn I'm fucking your marriage\n\n[Verse 2: Young Dolph]\nOn the real these rappers pussy, nah really, straight up\nBut meanwhile I'm in my traphouse, with 'bout six different flavors\nBut fuck that, let's get to it\nTook out my scale, broke down the bale, and my clientele ran straight through it\nDrinking mud, riding through the city, yup\nSelling P's out the coupe really, yup\nPaid fifteen K for my S.S. and invested another fifty, yup\nThese rap niggas they don't wanna see me, nah\nGotcha bitch with me taking off her draws\nSmoking weed and laughing, burning rubber while I'm running from the law\nReally, fuck you nigga come get me\nI'm a Cashtank nigga and all we do is get money, you feel me?\nKnow there's two Glock's with me, yup\nGot that boy Guwop with me, yup\nDowntown rooftop chilling, yup\nQuarter mill' on the floor, really\n\n[Chorus: Gucci Mane]\nMy young niggas, they really ready\nStraps cocked, out ready\nThese rap niggas are really scary, talk loud but ain't ready\nWe tote choppers like military, niggas gotta get passed us\nYour girl with me, you real embarrassed\nDamn I'm fucking your marriage\nMy young niggas, they really ready\nStraps cocked, out ready\nThese rap niggas are really scary, talk loud but ain't ready\nWe tote choppers like military, niggas gotta get passed us\nYour girl with me, you real embarrassed\nDamn I'm fucking your marriage\n\n[Verse 3: Rulet 1017]\nNigga I'm bickin' back and I'm boolin'\nDrop the top, and then foolish\nFinessing game with your main bitch, now my pockets is stupid\nFuck with Gucci, get you an issue\nYou pussy soft, like tissue\nHundred K'll get you knocked out\nPut me in the ring, get boxed out\nSo I jump on the stage, get the team real hype\nGucci throw a cup and the whole squad fight\nBottles on me, so we pouring all night\nNigga get trippin', switch up, fight night\nI'm jumping out that coupe, I lost my damn roof\nThank god that boy so fly, we don't need no parachute\nSo I'm chasing after fix, squeezing on these triggers\nBank account six figures, kick my feet up, Louie slippers\nVacation in the Hampton's, rockstar Marilyn Manson\nAll for that check, I hold a nigga ransom\n\n[Chorus: Gucci Mane]\nMy young niggas, they really ready\nStraps cocked, out ready\nThese rap niggas are really scary, talk loud but ain't ready\nWe tote choppers like military, niggas gotta get passed us\nYour girl with me, you real embarrassed\nDamn I'm fucking your marriage\nMy young niggas, they really ready\nStraps cocked, out ready\nThese rap niggas are really scary, talk loud but ain't ready\nWe tote choppers like military, niggas gotta get passed us\nYour girl with me, you real embarrassed\nDamn I'm fucking your marriage", "image": "https://images.genius.com/6f5bc65f6cb881521a8455261cd3fda9.475x475x1.jpg"}], "artist": "Gucci Mane"}