{"songs": [{"title": "U.S.A. (Aiight Then)", "album": "Murda Muzik", "year": "1999-08-17", "lyrics": "[Hook:Prodigy]\nEh yo this ones for all my M.O.B.B\nAnd my out of state niggas reppin NYC\nTo my duns up in the clink stuck in the bing\nFor my dogs on the corner that cook they own weight\nFor young lords livin like old time kings\nAnd old timers puttin young bloods on them things\nJust a little something for ya block to sing\nCan you relate?\nDo you feel me?\nAiight then\n\n[Verse 1: Havoc]\nMind like the dutch, forward or backwards\nCouldn't clear my style like Anita Baker \"Rapture\"\nFracture, cry now laugh later\nWe assist and compute data, On ya IBM\nDime bitches I be eyein them\nShoot me down a hundred times\nStill come up wit new lines\nRec exects dont like me\nCome up with new rhymes\nSee you on the edge and give a push for all mankind\n\nHook\n\n[Verse 2:Prodigy]\nMike Tyson style, animal dunns, we live wild\nToo many ways to die, we alive for now\nWe cross borders, take the guns along with us\nDefend infamous to the fullest\nProtect my dunns that came with me, they move with me\nIts risky for you to try to approach the god shifty\nWe all gorgeous, the most fly, the illest\nIts amazing what my Benz do to ya bitches\nWhile you bearin witness, we handlin' ya chick bidness\nThug her out, dug her out, you know the dealings\n\n[Verse 3:Havoc]\nPicture you dead and in the raw\nFlippin 2 not ready for what you and\nMoms already missin you\nOld fool from the old school\nYou thirty-six, I been doin this since niggas selling nic's\nGettin head from tricks\nTakin shorts for kicks\nNiggas mad ain't tell them where the stash was at\nIf she a dime baby moms\nDun be baggin' that\nSmack em with the gat\n(what) React that\n\nHook\n\nAnd to my fifth ward clique (how you like this)\nAnd to my dirty south thugs (how you like this)\nAnd to my westside niggas (let’s unite this)\nAnd to my Chi-town gangstas keep thuggin it\n\n[Verse 4:Prodigy&Havoc]\nProdigy:\nConnect the dots\nMerge with many a block\nMy porto rock representitives blow plenty of shots\nIt's love sincerely\nDeep in my heart\nFor those that relate to this here song\n\nHavoc:\nLovin' the angel\nHave you noddin' off like good dope\nAnd if the nappy good, then bolt regardless\nFinish it when you want to start shit\nTurn the body into carcass\nHandle mines regardless\n\nHook\n\nAnd for my midwest terrorists rock this\nFor my New Orleans team they can't stop us\nAnd to my Little Rock kitka that's heartless\nThis for my Beantown dogs and the lifers\nFrom Seattle to pink houses\nThe Unified States of America, let's get it right, shit", "image": "https://images.rapgenius.com/1e5eaa0e8cee3031e893b42fae6f45af.354x349x1.jpg"}], "artist": "Mobb Deep"}