{"songs": [{"title": "I Miss That", "album": null, "year": null, "lyrics": "[Meek Millz:]\nAye, Aye, I said tell mee (k) what's really goin' on\nPhilly back up in this bitch I'm ready, I'm in my bag\nSound like I turned and hit dem bitches fast\nI wake up early in the morning and go get the cash\nErry day on my birthday\nI be getting cake BITCH\nNiggas talk about me when they see me never say shit\nShout (to) that nigga Puffy cause that Loco got me wasted\nStandin' on the top just blackin' out like I'm a racist\nTip be gotta nigga on some fuck a mixtape shit\nDiddy gotta a nigga on some drink some Roc straight shit\nWe at? King and Diamonds? throwin money by the case? (bitch)?\nI just came back from jail, and I'm ballin' 'Bron James shit\nSame shit no different day\nSwagger blow ya bitch away\nI been gettin money like my block doin' a brick a day\nI know niggas dead broke\nBut they jus' a lick away\nFrom runnin' in your crib, snatchin' yours, and bein' rich today, hey\nHockey team on my wrist bitch\nTell that ho to grab my dick and treat it like a lipstick\nStunt so fuckin' hard I make my hater have a hiss fit\nNigga you don't feel me you gone (going) smell me like a in scent\nI been sick, swine flu\nMatter fact no chicken poc\nWonder how he feel I'm fuckin' every single bitch he got\nI was at the bottom and I crept up on the tippy top\nShinin' on these niggas like the diamonds in my wrist and watch\nI love Nicki Minaj\nI swear I admit it\nI hope one day I can fuck her just to say I fuckin' hit it\nAnd girl I'm fuckin' serious I lick it 'fore I stick it\nIf you ever hear this verse I'm on your top jus' like a fitted UHHH\nAnd Philly want dat back\nYou won't even have a show you be in Philly comin' back\nI make sure I save you verses and put you on every track\nI swear to god girl I ain't lying I would kill it from the back\nBecause I'm gone\nYeah I know I\"m drawin'\nIf I can can get her now, then I jus' wait 'til I get on\nI don't want you to kiss me, I just wanted to bone, [x2]\nAnd you know I will take you down though\nAll the way to the ground though\nIf you wanted to keep your bitch you better not bring her 'round though\nIf I tell her to hit me\nThen you know that she gone (going)\nShe be screamin' she miss me\n'Stead of callin' my phone, (hahaha)\nOh shit\nMother fucker god damn\nMah is you fuckin' or not, like Cam\nI'm out Miami in the R A goin'? ham?\nP my passenger\n? Remy? be stuntin' in the lamb'\nMy nigga? Cooner? in the lamb' too\nUp and down on Collins, bendin' corners like we bamboo\nStuntin' on my old hoes they see me be like damn boo\nCall me Jackie Turner all these hoes that I done ran through\nI'm gone\nI tell them bitches that I'm GONE", "image": "https://images.genius.com/6929169de7116d41676151bdea5cc773.1000x1000x1.jpg"}], "artist": "Meek Mill"}