{"songs": [{"title": "Warning Shot", "album": null, "year": null, "lyrics": "[Intro]\nCome on\nYeah\nPunch, what's happening brother?\nNiggas be poppin' that shit at me like it's something new to me or something, know what I'm talking about\nI tell a nigga quick, that shit just a rerun to me, nigga\nI've been doing this shit since Vanguard, brother\nAnd tell me what's happening with it\nNiggas hate on me but hop right on my dick as soon as they see me\nSoon as they see me, they be like\n\n[Verse 1]\nWhat up doc\nThat's what they tell me every second around the clock\nEverytime I clock in, rappers checkin' they watch\nStudio paid for, hours unlimited\nAssholes, how many MC's I knock off they payroll?\nHow many God MC's I knock off they halo?\nHip-Hop ain’t dead, consumers changed up\nRappers love to see gold like the end of a rainbow\nI stay low, like my socks under my ankles\nPlay the back like a turtle shell, know well\nThat my team got me if I ever slack on my shit, so if I fall?\nGuess what, I don't even trip\nIt's like that, crushin' little battle raps\nPunchlines, I did that in '99, you think it's a gold mine when you think of one\nYou think you hot, but I think you done\nLike Queens, New York slang, look what the killer brung\nMachine guns to a fight, fucking right\nPay the bill or I'm turning out your lights, good night\nI shatter niggas' dreams, thinkin' they the West Coast kings\nTill I drop like visine, tell a nigga quick, it ain't always what it seems\nLike the stitching on swap meet jeans\nI'm itching to scratch a whack rapper, gun clapper, snuff him like a rude capper\nGot a cool bladder, but I'm pissed off, at ya\n\n[Hook]\nThe real is back\nFuck the artificial, won't you let the realers rap\nThey scribble in they notebooks, me? I state facts\nSafe estate, they know where the best be at\nWhenever I ask, \"Are you not entertained?\"\nBody any nigga that wanna holla my name\nAnd what, no cut, this is Top Dawg gang\nWhat the fuck, everybody else, pull your panties up\n\n[Verse 2]\nNigga said he'd snatch my chain in the streets\nWhat chain? I barely wear jewelry\nSo I ever had one, you barely seen it on me\nAnd if I ever had a gun, you wouldn't know it was on me\nSo snatch it and then you're done\nI'm in a studio, just sipping on Parmesan\nThinkin' about who could fuck with Kenny and Paula's son\nI live this shit, try stop me, you won't live to shit properly\nCatch four between your abdomen\nNext time you see me, don't ask me who I'm collabin' with\nBetween me and you, some of the new West is actresses\nNew hate activists, lowkey can't stand our shit\nBut still we continue to drink laxatives\nCold blooded, make the label hand me your budget\nThis is mine don't touch (pow pow), did I stutter?\nCatch two, cats knew, I been a gorilla, welcome to the zoo\nYup, you little monkeys know what it do, come test me\n\n[Hook]\nThe real is back\nFuck the artificial, won't you let the realers rap\nThey scribble in they notebooks, me? I state facts\nSafe estate, they know where the best be at\nWhenever I ask, \"Are you not entertained?\"\nBody, any nigga that wanna holla my name\nAnd what, no cuts, this is Top Dawg gang\nWhat the fuck, everybody else, pull your panties up\n\n[Verse 3]\nDayum, you killin' 'em K-Dizzle\nAnd if you don't kill 'em, then you send 'em to hospitals\nSleepin' on a recliner bed, with a thin pillow\nI'm with a white bitch, ass like a black widow\nBet I dribble to the end of my lifeline\nSo when I die, you can say I balled for a long time\nThe 0-8 Frankenstein, beast like Sasquatch\nFeet size thirty-six, steppin' on Hip-Hop 'cause that's my bitch\nI write a rhyme, then she ride my dick\nThe girl is mine, I don't know the ho that you with\nYou niggas know this, I'm way better than I've ever been\nSo focused, like a sniper when he zoom in\nWhat's your motive?\nI bet it's to go against, like the GT\nGet your bitch ass bit, all on these streets\nI'm the almighty K, Compton\nRep it 'til my very death day, let the reaper in his face\nAnd recite every song from NWA\nI pay homage for those great who paved the way\nWait, back to the subject of who's, and who doesn't do what I do\nBluffin' until I touch 'em like a masseuse do\nNothing compares to me, but the throne, so tell 'em bring the chair to me\nI'm a rare bully, small nigga but I handle y'all niggas like I'm eight feet tall\nNigga", "image": "https://images.genius.com/25d8a9c93ab97e9e6d5d1d9d36e64a53.1000x1000x1.jpg"}], "artist": "Kendrick Lamar"}