{"songs": [{"title": "Bang Bang", "album": "The Drought Is Over 6 (The Reincarnation)", "year": "2008-11-18", "lyrics": "[Verse 1: Lil Wayne]\nShooting till my mother fucking hand fall off\nYa track-stars; the gun shot ran y'all off\nI pop like a soda watch the can fall off\nI can kill y'all and y'all boss\nShotguns, handguns, louder than a band drum\nYou fuckin with the drum major, lemme play you the anthem\nBang-bang-bang-bang, call it heavy metal\nI say bang bang, bitch, I make you feel every letter\nB-A-N-G, B-A-N-G\nG-A-N-G, we spray then leave\nWe play when we, no, we play N-E-\nV-E-R; C.P.R\nDoctor Carter, are you the disease, boy?\nYoung Money, motherfucker, these these boys\nBitch is you crazy? We's retards\nWatch Nina, Mac and Tommy have a brief menage like\n(*bang-bang*, *bang-bang*)\nLike (*bang-bang*, *bang-bang*)\nYeah, Soulja Boy on the beat\nBut you can call me Chef Boyardee\nCause I'ma heat this shit, and I'ma eat this shit\nPlanet Earth is my toilet, you're beneath this shit\nThen I flush and wipe my ass, gunslinger like I pass\nI cock back and throw a bomb, now, Hail Mary\nYou tale-fairy, fairytale, very frail\nAnd yeah, we got them hammers, try and hit every nail\nLet them sail up the river with that ho shit\nOr leave them face-down in the fucking ocean\nI ain't on no other shit, bitch, I'm on some more shit\nThat, \"Hello, how you doing? I am at your front door\" shit\nThat, \"Aww, naww, he got a gun! Oh shit!\" shit, shit\n\n[Verse 2: Jae Millz]\nOkay, it's Young Money, what you know 'bout it?\nThe semi-auto will rip open your body and tear the soul out it\nAnd all that fronting shit, nigga, I don't know about it\nCall me Master J, bitch, I'm so 'bout it\nEven my ho 'bout it, and don't doubt it\n'Cause we both would be Angelina and Brad'n\nSpazzin' and blastlin', blastin' and rat-a-tat-in'\nAnd nah, I don't cook, but like potatoes I mash 'em\nI don't give a fuck about your money or your fashion\nShots through the window of your brand new Aston\nYou get out, try to run, now ya chest where them bullets crashin'\nPine box niggas, no crutches, no casts\nNo wheelchair, just the two-door long black wagon\nFlowers on the side and four wheels to steer\nI ain't never scared, and I ain't never care\nSo fuck what they doing over there, I'm doing it here\nYou're nothing like me, fuckboy, don't be outlandish\nWe gorillas in the mist, y'all just some Kung-Fu Pandas\nSweet like Fantas, my blood is the same as Bruce Banner's\nHit record on the cameras, motherfuck all the bullshitting antics\nThey saying he ain't gotta get a clearance from Wayne, that's a disadvantage\nBeing broke is a foreign language for me like Spanish\nMusically, we direct thrillers, call me John Landis\n\n[Verse 3: Gudda Gudda]\nIt's the 504 slaughterhouse blood-bath\nLittle nigga stand tall like a giraffe\nOne-man gang, animal, cannibal\nEat rappers for dinner, my nickname \"Hannibal\"\nGuns for days I show you what this cannon do\nHit you, split your mothafucking man in two\nI grab the chopper, South Park, that’s how I hold the toy\nI aim and crank that bitch like Soulja Boy\nI’m in the streets one deep, I can hold my own\nAnd shit, it’s only one seat and I control the throne\nLook, bitch, I’m on my crazy ass shit\nYou see the gun poking out like Sheneneh lips\nWatch your lips when talking\nCause I be on grave nigga leaking in your coffin, rest in piss\nWhen I die, let me rest with clips\nRambo, I’ma go out on my Sylvester shit, bang!", "image": "https://images.genius.com/3f99fb60638817d357014fe4a769ff57.320x320x1.jpg"}], "artist": "Lil Wayne"}