{"songs": [{"title": "Leave Me Alone", "album": null, "year": "2010-12-08", "lyrics": "[Verse 1: J. Cole]\nDear Mrs Bill Collector\nI know you just doing your job, don't mean to disrespect ya\nBut we been going through this thing since way back\nI told you when I get the dough I would pay back\nBut I got problems baby\n(Yeah, if you only knew) I got bigger problems baby\nHey\nSo why you talking about the money that I owe\nLike as if I didn't know man it don't mean nothing to me\n'Cause right now I got my little boy crying and my grandmother dying\nCould you please stop fucking with me, listen here\nI ain't looking for no tears but my brother got a year\nAnd my mother keep smoking that shit\nOn top of that I'm broke, please put that in your notes\nFor the next one to call me up talking that shit\nAnd then I holla\n\n[Chorus: Kevin Cossom]\nI just can’t take this shit anymore\nI just might lose control\nI feel like letting it go\nPlease just leave me\nI need to be left\nAnd if I'm wrong (I'm wrong)\nThen let me be wrong\nJust leave me alone\n\n[Verse 2: J. Cole]\nDear Mr Policeman\nAyy, am I wrong or ain't you supposed to keep the peace man\nI could have swore that I was driving pretty peaceful\nSo why the hell is you pulling over me for?\nIs it this black Mercedes?\nOh no I get it I get it I get it\nOr 'cause I'm black? Hmm maybe\nYeah hey tell me why my hands start sweating\nAnd I hold my breath every time that you get behind me\nI turn my music down so you won't hear a sound\nMan i'm nervous like I got a couple pounds on me\nYou pulled me over, you frowned on me\nWith your flashlight tell me what do you see\nThug niggas drug dealers it's a trip\nEvery nigga in this whip got a mother fucking college degree\n\n[Chorus: Kevin Cossom]\nI just can’t take this shit anymore\nI just might lose control\nI feel like letting it go\nPlease just leave me alone\nI need to be left alone\nAnd if I'm wrong (I'm wrong)\nThen let me be wrong\nJust leave me alone\n\n[Verse 3: J. Cole]\nYea, my middle finger to the law, bustin off, tryna touch the sky\nMy teacher said, \"Impossible\", but I'ma fuckin try\nPlus how he gon' tell me, he don't make the rules\nThere's niggas dying everyday, man, we don't make the news\nInstead they talkin bout some thunderstorm, cyclones\nTimmy got his bike stole, top story, Tiger Woods \"be fuckin all these white hoes\"\nAnchorman stop snitchin\nCut the commercial, he be texting all the side bitches, hey my goodness\nHow ironic, on trial for possession of some chronic\nMy lawyer came to court, man he was higher than the comet\nHey your honor, is you kidding? How you sit above me?\nAre you perfect motherfucker, how you finna judge me?\nWhen you home you don't cuss, drink and puff like us\nThese cops is bad boys, baby just like Puff\nThey hate they jobs and they days be fucked up like us\nAt the end of the day, you niggas just like us\n\n[Chorus: Kevin Cossom]\nI just can’t take this shit anymore\nI just might lose control\nI feel like letting it go\nPlease just leave me alone\nI need to be left alone\nAnd if I'm wrong (I'm wrong)\nThen let me be wrong\nJust leave me alone", "image": "https://images.genius.com/2cd936e786e1ab454043327d585c7702.1000x1000x1.jpg"}], "artist": "J. Cole"}