{"songs": [{"title": "Riot Starter", "album": "Cypress Hill IV", "year": "1998-10-06", "lyrics": "[TV Reporter 1]\n\"We understand all of the officers in the Central Division\nHave been ordered to wear their helmets and basically\nTo get into riot gear\"\n\n[TV Reporter 2]\n\"OK, we have uh trouble breaking out here right now\nTensions are building\nUh, the police have just wrestled a couple of people to the ground\"\n\t(\"...Police in riot gear...\")\n\"The police are, uh, forming a long line now...\"\n\n[B-Real]\nIn the year of ninety-eight, you can't wait\nNiggas been waitin on our release date\nI know how to pick em up, stick em up\nEverybody go crazy while I'm fuckin shit up\nWho's on the floor, while the beats break\nHey ? feelin to catch a vibe, you buyin an e-ticket\nTo the unknown, hilltop feelin a lot drop\nYou gotta get the fuck out of the spot\nHear no, speak no, see no, but we know\nGood reigns over evil, how it be though\nI'm doing it my way, like Carlito\nTaking over the whole scene, a bad dude, so\nBring yourself off up the ground, start it up\nBreak it up, shake it up. you better be wakin up\n\nRiot....Starter\nRiot....Starter\nCome on\n\n[Sen Dog]\n\"Yeah...move it to the side\nCypress Hill coming through once again\nCheck this out, this is for ninety-eight, nine-nine\nForever baby, come again now!\"\n\n[B-Real]\nPeople like talkin, but can't walk a mile\nPuttin you down, but they can't bite a style\nI start the riot up, fire it up\nWatch the roof cave in, while I'm lightin the shit up\nYou want some more, fanatical, rhyme animal\nSlammin your head, bangin the wall, it's all mechanical\nHear no, speak no, see no, but we know\nDon't even try to breathe though, an amigo\nDon't move unless you feelin the whole move\nLike a bomb, gonna blow, I'm killin the whole room\nStill no real souls, heal those through real shows\nBroken, how your grill goes, you feel those\nThen I pealed those off of the wall who got bombed\nCypress Hill reignin supreme, we stand tall\nPeople never answer their call, they fall slow\nWhen the riot starts feelin the boom, you better roll\n\nRiot...Starter\nRiot...Starter\nRiot...Starter\nRiot...Starter\nCome on\n\n[Sen Dog]\n\"Yo, get the fuck up out the stage\nWe gonna tear the roof up off this motherfucker\nYo, move the fuck out kid\nWe gonna tear this shit up\nHit that breakdown, homie!\"\n\n[B-Real]\nLook at all the pigs they can't hold me down\nRiot gear on, they fiendin to get clowned\nWatch as I throw my weight, they hesitate\nWhile I'm circulatin the flow, movin through every state\nStay calm, play on, be gone, the teflon\nNo delay on the mission, I breathe calm\nWho's gonna be the thrilla when I'm gone\nMakin the scrilla, Manilla, the Don Juan\nSeek low, need no, info, the weed codes\nDon't even try to think though, I'm a kilo\nDope shit, my position remains firm\nFuckin your head up, take a sip, eat the worm\nLet it burn, up in your stomach, you never learn from it\nWhen the stoned of Soul comin to return\n\nRiot...Starter\nRiot...Starter\nRiot...Starter\nRiot...Starter\nCome on\n\n[Sen Dog]\n\"Yo, get the fuck out of the way or get hurt man\nYou got to move motherfucker, you got to move\nYou gotta make shit happen\nYo, once again, this is Sen Dog\nAll the way from the Soul Assassins Laboratory\nSomewhere, who the fuck knows where at, knahmsayin?\nBig shout out, all the Soul Assassins across the country\nWhereever you at, yo check this shit out\nWe comin hard baby, we bringin it live\nWe gonna burn that motherfucker down yo\nTryin to raise the roof, we wanna fuck it up\nWe wanna do whatever it is the fuck you call it\nAs long you get out the fuckin way, let Cypress come through\nWoooorrrdd, yeah\nWe gonna call this one...the Riot, Starter!\nWe wanna see that shit, everybody say that shit\nRiot Starteeerrrrr!", "image": "https://images.genius.com/4f0b9d852eece67bb00fcc4712c945bb.500x500x1.jpg"}], "artist": "Cypress Hill"}