{"songs": [{"title": "Lyrical Gangbang", "album": "The Chronic", "year": "1992-12-15", "lyrics": "[Intro]\nThis should be played at high volume\nPreferably in a residential area\n\n[Verse 1: The Lady of Rage]\nNow I'ma kick up dust, as I begin to bust\nOn the wick-wack, fucked up suckers you can't trust\nWhen I kick up, I lick up, your face get smacked up\nWhen I rack up, so all you mothafuckas just pack up\nOr get slapped with the swiftness\nIf you think you're swift with the gift, Merry Christmas\nNow stuff that in your stockin'\nI'm knockin' 'em out the box and\nKnockin' 'em out their socks and, cause Robin is rockin'\nBreakin' 'em down to the slab\nTakin' 'em down on their ass\nNow what you wanna do, ya wanna battle, uh?\nSend you up shit creek without a motherfucking paddle\nRattle that brain, I'm not that same ol' plain Jane\nRoll on you like a boulder, you're nothin' more than a grain\nOr a pebble, take it from the real rap rebel\nNot Bushwick Bill but I can take it to that other level\nYou think you got pull? Then pull it, uh!\nI got the trigger so I figure you'll bite the bullet\nThen bite the dust and wipe the fuss\nDo what I must, and what I must is bust\nA bubble, or two some trouble, for you\nSo skip to my Luger, Lady of Rage is comin' through\n\n[Interlude: King Tee + B-Real]\nSome cool shit\nSome cool shit\nBoo-yaa! Spittin' out buckshots\n\n[Verse 2: Kurupt]\nI fears no one, I makes 'em cool off like a polar cap\nLynchin', as a hit, misses the roll of dice\nPushin' packs to make a profit\nDiggy dope duck on the topic so stop and gimme my props, kid\nI'm livin' large like a fat bitch\nSo get back, bitch, I'm hard to bogart, for the faggots\nThis young black kid, a mercenary, merciless\nMurderin' millions of niggas so who's first to diss\nThey say I'm bad so you'll find none worse than this\nChewing motherfuckers up like a Hershey Kiss\nPut to sleep, loving the lyrics I leave in the minds of each\nRough when flex, too complex, wrecks your mental piece\nSo feel the wrath, nigga, I rip in half niggas\nYou're quick to talk shit, I whoop your ass nigga\nThen watch me blast, nigga, cause I'm the last nigga\nYou wanna fuck wit', so up your cash, nigga\nI make 'em stagger, I'm scandalous as Jimmy Swaggart\nI'm a good tracker, scopin' your girl then watch me tag her\nPulling steel like a stunt\nShown like an ID card, nigga, no needs to front, so\nHere to torment I put track on crack\nAnd I'm strapped with a semi-tone mili-ten Mac\nYo, I breaks 'em off, I breaks 'em off, chief\nDeadly as Jason on Friday the 13th\n\n[Interlude: B-Real]\nA to the motherfuckin' K\n\n[Verse 3: RBX]\nBack in the days, niggas they use to scrap\nBut now in ninety two, niggas they pull their strap\nCause umm, police them come wicked and them shoot\nNiggas, so niggas retaliate and start to loot, execute\nBoot stompin'\nBlack soldier, here to teach and mold ya\nThe innovator, dominater, narrarator\nR-B to the mothafuckin' X, flex wicked\nStyley Lee, bump and be found and do bleed by a\nManiac, with a gat\nSee nowadays niggas is like that\nI pull my trigger back, the bullets go\nBo-bo-bo! Now I'm on Death Row\nFuck it, niggas goin' wild\nEvery night they shoot, it's like Beirut\nMaybe you should get a Kevlar vest for your chest\nAnytime steppin' through my hood\nBut that'll do you no good\nOne slug to your face, don't hate\nYou're gettin' smoked like wood\nNasty nigga bloody pumps face flat\nOn the concrete, here comes the white sheet\nMr. Coroner, caught with some yellow tape\nBut the murderers escape\nAudi like 5 G's\nLyrical Gangbang but it's just a G thang", "image": "https://images.genius.com/f069b7a57cd614d79e5dba8ee92f08f8.944x937x1.jpg"}], "artist": "Dr. Dre"}