{"songs": [{"title": "Technicians", "album": "All 6's and 7's", "year": "2011-06-07", "lyrics": "[Intro: Tech N9ne]\nEST is 1985 in KC on a bus ride from the 56th side\nNot too many knew that it was alive\nBut they spread it so now they tied to Technicians worldwide\n\n[Verse 1: Tech N9ne]\nListen!\nTrying to recruit is the mission, we offer you a position\nWhere Tech'll rule and condition your brain\nTo know actin' a fool is the vision, Caribou Lou is tradition\nAnd the way to be true to your living is strange\nWe come in peace, but if you wanna be dumb and beef\nA gun'll summon heat, wanna be young and speak, I'ma numb his beak\nHe's a woman, he the one and, he brung in meat for the cunning beast\nHit a lung and seep dung and sleep long, in deep tongue full of gum and teeth\nIt's when a Tecca-nician do the sets who diss the crew\nThe best thing is for you to let the clique see who the vet is amidst the new seekers\nWonderin' who the fuck is coming through these speakers\nNever forget it the medic for you tweakers\nAhead of the medicine developed to soothe creatures\nYou're pathetic if you're no believer, 'cause we all are energetic and eager\nCome alive when you walking side by side with me\nFly the skies and get high with me\nOn this ride you won't collide, just confide in me\nTry denying me, ye dying violently\nThat's the way, you fakers got to pay\nMy people quick to spray, and buck a demon 'til they lay\nBut if he breathing it must've been an angel by his side like Sade\nNever would've been the case, because my clique ready to ride when I say:\n\n[Hook: Tech N9ne]\nTechnicians!\nOwoh! Owoh! Owoh!\nOthers ain't got a clue, they coming through suspicious\nWe do the shit we do\n'Cause if you not with the crew converting you is our mission\nIf you're a born Technician\nPut your ammunition and your hands up in the sky\nThis is a strong addiction\nLive to this if ya Technician 'til ya die\n\n[Verse 2: Tech N9ne]\nMy people all know what a Bianca is\nMost of 'em want to diss\nDon't come unless you don't want the biz\nIt ain't nothin' but real women in my circle, not them phony chicks\nThat don't know what I mean when I say elbow macaroni bitch\nThey know what I'm drinking, the ladies looking right, they know what I'm thinking\nThe babies even hype, the oldies be geekin'\nThe red, the black, and white, the soldiers beef seekin'\nAll of my people's here, Tech and the bidness are gonna equal fear\n'Cause I'm 'bout to bubble and get the evil peers\nOut of my life I never wanna see you here (Yeah!)\nBitch! You ain't a Technician\nYou don't know the pledge, but you said that you listen\nGuess you misunderstood the shit, huh?\nDisrespect that Tech trick get done\nThe moral of the story is we warriors\nNotorious for the hordes of core, ready to roar he is glorious\nTechnician number one\nThe mission leave 'em sprung with the tongue\nAnd if you listen it's a gun\n\n[Hook: Tech N9ne]\nTechnicians!\nOwoh! Owoh! Owoh!\nOthers ain't got a clue, they coming through suspicious\nWe do the shit we do\n'Cause if you not with the crew converting you is our mission\nIf you're a born Technician\nPut your ammunition and your hands up in the sky\nThis is a strong addiction\nLive to this if ya Technician 'til ya die\n\n[Verse 3: Tech N9ne]\nWe are family, that Tech shit we on it\nWe could be damaging to all you punks that want it\nWe bring calamity, that snake and bat we flaunt it\nUnforgettable, Tech's formidable, reppin' the mid, the MO\nBitch we run it\nYou don't gotta know that I really meant it when I said that I was gonna make the mainstream go me\nStill rapping like I'm popping a pillow off of the killer more like I was taking Molly in '03\nWe can take anybody, we so deep, I bet that you got us on yo' street\nI'm tryna find a spot that's big enough, so that all of my people can meet!\n\n[Hook: Tech N9ne]\nTechnicians!\nOwoh! Owoh! Owoh!\nOthers ain't got a clue, they coming through suspicious\nWe do the shit we do\n'Cause if you not with the crew converting you is our mission\nIf you're a born Technician\nPut your ammunition and your hands up in the sky\nThis is a strong addiction\nLive to this if ya Technician 'til ya die", "image": "https://images.genius.com/7d4c4dfa3d56e3cd0f59836ef122ff24.1000x1000x1.jpg"}], "artist": "Tech N9ne"}