{"songs": [{"title": "Whores", "album": "House of Wax: The Vatican Mixtape, Vol. 3", "year": "2007-09-29", "lyrics": "[Raekwon]\nSnatch the bitch wig off, give up that pussy, ho, get off\nWe taking that, Benjamin Franklin pussy, blinking that\nC.C.B., Barbara Streisand, Cali sisters in the right hand\nRip the shirt off, had a nice pair\nTwelve o'clock, afternoon boom, fucking from room to room\nEnough to zoom, ten minute a wound, I comfort this\nStark confronting her, hello, miss-miss, come out the Tyra bra, miss\nMarvelous, awesome bitch, out as a rich\nFly groupie bitch, crazy cum color, Penela' swiss piss\nDirty burst on her, wipe his dick on her lips\nSlow the fuck down Rich, half his wrist up in the uterus\nShe spoke, \"I'm tellin' Louis Rich\", Max, shoot the bitch\nRollie was rooting this, Goldie hardly spoke, shit was ludicrous\nShe bit his dick, God wilded on her with a kick\nBobby stressed out, just like life is like a lighter\nLit a gal' on her, boo, stop wilding, for real, lighten up\nFor Noodles caught a lapdance, pussy clap-clap just like a tapdance\nLet her fuck you on your head, go to bed\nDelrio the Leo, hot pelepeno, lace a Gambino nigga, right\nWash knobs for free, though, only me though\nHah, polishing wax floors, she's a real whore\nKeep it raw, you break law? My cousin Blake break jaws\nWe all raw, broke bitch, try to come aboard\nSnort on the right, ho, now right as a core\nI'm only fucking ya'll, cuz ya'll on, keeping my legs strong\nYou dead wrong, talking that shit, giving me head wrong\nSextress, dress ya ass off, bullshit necklace\nHere, rock this robe, if you lose it, death wish\nMore head, we all getting feds, forget\nDown the lamb spread, buying the right bread, Nike head\nDike head, married a white dread\nDrive a snow white five, died in the air, swallowing white shit\nWhores, they never listen, what? The girl's a whore\nCome on..", "image": "https://images.genius.com/258ddd2b01af2188dd6ee5363048d09d.820x820x1.jpg"}], "artist": "Raekwon"}