{"songs": [{"title": "Toney Sigel A.K.A. The Barrel Brothers", "album": "The Big Doe Rehab", "year": "2007-12-04", "lyrics": "[Verse 1: Ghostface Killah]\nYo, straight out the ghetto, I'm damn hood\nI stack a dollar like a whole rack of canned goods\nBaggy jeans, no Timbs, ACG boots\nLivin' in the crack spot, bangin' that Sheek Louch\nThe narcotics is far from garbage\nWhether it's cold or it's late August\nMy shit is fresh cuz I catch the hottest\nMy little cousin bubble swatches and carry a couple oxes\nKeep a deuce deuce by his ankle and get it poppin'\nYou know, we be the boys clockin' the graveyard shift\nBig bubbles, countin' the cream, burnin' the lazar spliff\nMy man jumps out the whip with the AR 5th\nAnd we ball from plenties of parties, 'cause we start shit\nParole holes, six months in the box\nMy little sister got her head shaved off\nShe made it home from shock\nWe sellin cartons, Pampers, Similac formula\nAnything you take because the paper keep callin ya\nGangsters keep ballin fosho, we want more\nWe make it rain from the tech and the wop\nThe next coroner priests don't have enough cups for us\nTo slow us up, they hit us with dusk\nThen they rush-bust, my man Big Ron will break the cuffs\n300 pound nigga, po-po has to fuck him up\nThey say that my projects should undergo therapy\nWe never voted, we votin' for Oprah, Obama, and Eric B\n\n[Verse 2: Solomon Childs]\nGuns imported from Duval\nWheelchairs and shit bags\nPeach Snapples and pretty scalpels, renaissance\nI'll stick a pick in ya gut at the chapel\nI'll blow a nigga for a box of Huggies\nCop-killers with a box of dummies\nDummies, stuck to the project floors\nNiggas is suited up and we ready for war\n\n[Verse 3: Beanie Sigel]\nIt's the Broad Street Bully and the Killah with no Face\nMy mac bullets burn like tequila with no chase, yeah!\nMy knife work like the guillotine sword, cutting niggas\nStop frontin' for my killa bee swarm, something\nEmpty out the whole clip and reload\nShotgun barrel leave it smoking like a broke stove\nYeah, and I'm all about that bullshit\nThe casket, the hearse, and the pastor in the pulpit\nI kill a nigga at the drop of a dime\nJust imagine what I'd do for a quarter\nAin't no tellin what I'd do for a dollar\nPop a nigga right in front of his mama\nSon a nigga right in front of his daughter\nAnd I'm nothing like your father\nYou couldn't come from these nuts I got\nAnd C. Baltimore sucked this cock\nI know most of y'all wouldn't understand\nGet it? Understand?\nYeah some niggas will and some niggas won't\nLike some niggas kill and some niggas don't (uh-uh)\nYou's a fake-it-'til-you-make-it of nigga\nI'm a straight-up-take-it type of nigga\nPistol-whip-a-nigga-'til-I-break-it type of nigga\nI'm hard on chumps, most of these dudes is fags\nPut the guarder on pumps, push the broom up they ass\nOr the knife like American me, American Sig' is Muslim\nSo I ain't feelin Bush overseas\nI think with the wisdom of Malcolm, got the soul of a Panther\nSo by any means is the anthem\nYou gonna have to cut me out the track like cancer\nI can't stop, won't stop\nThis how we do it from Philly to Shaolin", "image": "https://images.genius.com/f1bbc70540da138c70debc041f381d0f.1000x1000x1.jpg"}], "artist": "Ghostface Killah"}