{"songs": [{"title": "Freestyle Conversation", "album": "Tha Doggfather", "year": "1996-11-12", "lyrics": "[Intro: Snoop Dogg & Homie]\nAy Dogg, let me holla at'cha man\nWuz up home?\nWord is on the streets, your beats gon' be delicate\nSince Dre did shake the spea's out, man\nDelicate? Beats?\nSo that's what makes me now?\nMan, I don't give a fuck about no beat\n\n(Now let me shake that shit man)\n(I hear ya Dogg)\n(It's a cold, cold thing!)\n(It's a cold thing!)\n(For real, hmm!)\n\n[Verse 1: Snoop Dogg]\nI got more niggas tryin to get at me than the President do sometimes\nNiggas be tryin to get at me cos I be droppin funky rhymes\nWhat the fuck is goin on? This rap game is made to make money\nYou niggas is taking the shit outta hand, actin' way too funny\nDoin too much, y'know I see it from the get-go\nWhat the fuck's goin on wit you niggas, y'all tryin to play a low pro\nAnd tryin ta be hard and tryin ta be big willies or whatever they call it\nI guess it's time for me to act just like an alcoholic\nAnd step to the game, I'm a stumble in like I don't know\nAnd if a nigga say somethin wrong, I'm takin off from the get-go\nI ain't givin no room to try to get me first\nCos I done been bombed on before and I'mma tell you, man, that's the worst\nFifth in the world, but I'mma keep my thang together\nCos I'mma keep makin money and hope everything is still together\nHavin papers, man, now what y'all niggas doin?\nAll y'all broke on the corner\nDrinkin your drink, wanna be doin what I'm doin\nBut don't get mad and don't be tryin to play-hate\nCos, uhh, takin trips around state to state\nRepresentin, uhh, what y'all wanna represent\nBut y'all can't represent it cos y'all got no dollars, no cents\nI'm movin on, groovin on and I'm movin\nMakin more moves than the average Cuban\nTryin ta get G's across the town, tryin ta make more hits\nAnd tryin ta get my game tight and get at your bitch\nNow if she wants to get with this, she gone come holla at a player, do'\nCos she know that Snoop Dogg is got that white Rolls Royce\nAnd she wants to jump in, bring a friend\nCos everything is like alphabet, come on in\nCome on in and bring a friend and you can come on back\nCos when you do, we gone be sippin on some Cognac\nIt's on me, I'm feelin good tonight\nCos I'mma do mines and I'mma keep everything tight\nI ain't lettin nothin leak cos if thangs leak, then I'm get caught\nAnd I can't get caught cos you know how they do it about that child support\nShit, bitches is cold on a nigga who ain't got his game tight\nGettin 18-point-5 percent, half your life\nShit, I love my baby boy and all\nBut I ain't gonna be payin no bitch, no no, no way Dogg\nI'm too slick on my toes, I'm too tight\nI'm guaranteed to get away from some shit like dat, ain't that right\nCos, uhh, when you play in this game you got to be the real player\nYou can't be no fake ass nigga talkin about you wanna be the man\nCos if you ain't with the game, the game ain't gonna be wit you\nAnd I can put that on everything including you\n\n[Interlude]\nOne of every five black males before the year 2000\nWill be detained or deceased\nNo justice, no peace\nYeah the truth hurts, if you're scared, go to church\n\n[Verse 2: Snoop Dogg]\nLook here, but don't cut it, gettin five points\nStep back for a second, I'm puttin less than five to this joint\nHmm, if this is the bomb niggas gonna blow up like Atlanta at the Olympics\nNiggas be trippin but I'll be pimpin\nI don't be trippin off no nigga at all, no bitches\nJust tryin to get money, I don't even be trippin off no switches\nI used to like low-riders but now I like Eastsiders\nI put it down wit me and make a hit maker, y'knowhatI'msayin?\nI love the Lakers now cos now they got Shaq O'Neal\nIt's time to make a million dollars and that's for real\nSee we gone blow up and show up and throw up nuttin but Dogg Pound\nGuaranteed to put it down and we'll be 'round to your town\nSo just sit in your seats and wait 'til we come through\nUntil we do just keep smokin grey and blue\nOr whatever you do just stay true to what you do\nCos we gone keep doin what the fuck we got to do\nNow, follow me now and listen to the instructions\nCos the game's gonna get deep now, niggas is tryin ta creep\nTryin ta get up on game but they don't wanna be down with the PG\nAll of a sudden everybody wanna dis DP\nNow, what we look like?\nMakin y'all diss us, that ain't right\nI should get upset but I'mma stay composed\nChill for a second, spit at some hoes\nDrinkin my drink, smokin my dank\nCountin my bank, uhh that shit stank\nStanky bank is what I got cos I'mma keep it\nAnd nah this ain't no motherfuckin secret\n\n[Interlude]\nYeah, we're in drought season\nNiggas lookin for a reason\nIt's like thanksgiving without the feast\nYeah the truth hurts, we're scared to go to church\n\n[Verse 3: Snoop Dogg]\nThey got me runnin' for my life, I'm jumpin' gates\nThey got dogs on my ass, but I'm a Dogg\nSo I know how to alert and get wit dat shit\nThe dog run up on me I give him a cold\nLike nigga back up off me\nHe turn around and bite the police, hmm\nGame recognise Snoop Dogg too cold, I'm on my toes\nI slide in the back of a garage, dippin with this ho\nThey run right past me, ask me \"Have I seen the suspect?\"\n\"Yeah, he went that way\", now for the jack", "image": "https://images.genius.com/ecb7c80ab44a68c9d33f60b5fccd0a70.1000x1000x1.jpg"}], "artist": "Snoop Dogg"}