{"songs": [{"title": "Ghetto Symphony", "album": "No Limit Top Dogg", "year": "1999-05-11", "lyrics": "[Intro: Snoop Dogg]\nYo nephew, give me some of that No Limit shit\nYeah\nWe got my nigga Fiend in the house\nC-Murder in this motherfucker\nMystikal up in this bitch\nGoldie Loc, hm-hmm\nMy nephew Silkk the Shocker\nOh, yeah, we got something for the ladies too\nMia X, run this bitch\n\n[Verse 1: Mia X]\nLyrical arsonist, lady alligator (For sure)\nDown South, hustler, former weight smuggler, I'm\nMother (Mia!) of the Tank, gave birth to an army\nGuerilla millionaires, so don't even ask, if you wanna\nGet to clappin, soldier action specialty of style\nWe made the whole world respect the underground while\nSome of y'all niggas talk shit and get mad\nCause we did it with a foot up your ass, and it's still there (Sho!)\nI cares not about your click or the block\nI'm still that same bitch to run up in your spot and knock you off\nBroad, with the cause, (yeah) bitch on a mission (Uh-huh)\nKeep them niggas by they nuts while you hoes be dick-kissing\nMissin the game, damn bitch it's written in plain ebonics\nSo shake that come-up off you brain and do the knowledge\nMia X (Mama Mia!), kickin off the ghetto symphony\nNext soldier up, tell em who the FUCK you be\nWHUT? It's Fiend y'all\n\n[Verse 2: Fiend]\nPut me in the ring with real MC's, and watch em run for cover\nAnd hidin in trees, to escape the mic that I breathe on\nBleed on, exceed on!\nWeak rappers with titles after twelve (Ding!)\nHit a bell that's what I'll feed on!\nMicrophone Don, walkin flesh, talkin bomb\nBringin harm, to the calm, and, come be alarmed\nIt's the African, oh, you wanna battle again?\nI'll turn, you and your mans, to my yesterday plans\nOh, damn! Toting two pistols like Yosemite Sam\nOh, man, he grand! Loud as the Southern band\nPickups and caravans, the soldier, that could, that can\nI would be the man, but God beat me to them plans\n\n[Interlude: Snoop Dogg]\nNext up, on the M-I-C\nC-Murder, get busy for the symphony\n\n[Verse 3: C-Murder]\nI be's that nigga on the tank, always trippin never slippin (Never)\nHave you reminiscin and missin, that fool in your picture\nCall me Bossalini BITCH without the Mos at shows\nAnd FUCK those who oppose (Why?) we runnin them hoes (Bitch!)\nThree-hundred and sixty-five motherfuckin days a year\nI have your fool staggerin just like a bottle of beer (Bottle of beer)\nYou niggas runnin from the cops, well I ain't runnin no mo' (Bitch!)\nI flip the bird when I swerve, man, FUCK them hoes\nI'm crazy, my nagga, but uh, I thought y'all knew that (Shiiiit)\nOh you ain't see the news? Shit I'm the nigga with the TRU tat\nAsk my nigga Kenoe, shit, I just don't give a fuck (Fuck)\nAnd if you run up wrong (What?) I'mma fuck you up, you bitch you\n\n[Interlude: Snoop Dogg]\nNext up, on the M-I-C\nSilkk the Shocker get busy on the symphony\nUh-uh, uh-uh-uh\n\n[Verse 4: Silkk the Shocker (Snoop Dogg)]\nNow would I come this far, fucker, if I didn't sound like a hit?\nY'all didn't know what the fuck y'all thinkin bout\nYou sound like a bitch (Biaatch!)\nShit it sound like a wish\nYou know when you got a motherfuckin hit? (When?)\nBitch? When it sound like this! (Hahaha)\nOr you fake niggas get enough heart\nAnd try to bust a rhyme at this clip\nFuck around and miss, then fuck around and get found in a ditch\nGot labels on my dome, when they find I gross this much\nFreestyle shit, you can tell em I ain't wrote this stuff\nSilkk the Shocker, KLC, purple mask life, like Snoop and Dre nigga\nY'all can relay it to a label ten times\nGet a label contract for MJ figures\nIt ain't where you from; it's where the FUCK YOU AT\nN-O-L-I-M-I-T, Top Dogg, and I'm fucking with that!\n\n[Interlude: Snoop Dogg]\nNext up, on the M-I-C\nMystikal, get busy on the symphony\nErrerrhrhrh!!\n\n[Verse 5: Mystikal]\nWHOO SHIT MOTHERFUCKER GOD DAMN!!\nI keep it HYYYYYYPE, BITCH I'm THE MAN!\nWhen the FUCK you ever heard somebody say\nThat they don't sing my song\nOr that I don't roll on every fuckin verse I'm rapping on\n(That nigga Mystikal tighter than a muh'fucker) HAHHHHH?\nI came up off of \"Peter Piper\" bells and the LL's \"Bad\"\nThese niggas be pissed off at me\nCause their old lady call me they baby\nMC's pilin up and crowdin up, but I'm their FAVORITE\nThe type to fly buyin a Z-28 IROC\nAnd chop you in your motherfuckin face (HIII-YAH)\nYour album ain't tight, WHAT IN THE FUCK IS YOU PUSHIN?\nYou played out just like old woman pussy\nEwwwwh!\n\n[Interlude: Snoop Dogg]\nNext up, on the M-I-C\nGoldie Loc, get busy on the symphony\n\n[Verse 6: Goldie Loc, Snoop Dogg, & Both]\nNow watch me put these haters to the test (Test)\nAccumulatin with my stress (Stress)\nFold em fuck em fifty, get the shit up off my chest (Chest)\nReleasin anger, all natural gangsta energy (Energy)\nGoldie Loc the name, Dogg House gang\nMotherfuckers better start backin up (What up, what up)\nWe in the Tank punk busters\nMotherfuckers don't wanna see us loc'd up (AHH!)\nLittle Goldie Loc, Goldie Locks the same thang\nSmashin for the hood, cause I wanted to gangbang\n\n[Interlude: Snoop Dogg]\nLast up, I believe that's me\nSnoop Dogg, light up the mic for the symphony\n\n[Verse 7: Snoop Dogg]\nThis jam is dedicated to all non-optimistics\nThat thought I wasn't coming out with some exquisite rhymes\nBut that's okay, cause now I'm back (Uh-huh)\nTo kill all the rumors (Say what?), and straighten the facts\nLike umm, doin bad (What?), gettin ganked for my bank\nNow you all on my dick when you see I'm a TRU Tank Dogg (Haha)\nYou say, \"Mmmm-mmm-mmm! Ain't that somethin\nDogg, I bought yo' album, my nigga, that shit is bumping\nI apologize (I'm sorry), I'm sorry for the drama\nCan I get your autograph for my baby momma?\" (Sheeeiit)\nShit, I'm setting it off, letting it off, busting (busting)\nHustling (hustling), rushing (rushing), dusting motherfuckers ('Sup?)\nDroppin the heat, lock up the street, we 'posed to\nI put this pistol in your mouth, now what you gon' do?\nTop of the line, first class (First class)\nI pop a cap in yo' ass, then pop some Mo' in the glass\nToo legit to quit (Yeah), I'm spittin gangsta shit (Haha!)\nMan, fuck all that yapping (yeah)\nWe 'bout that gun clapping (Shhh!)\n\n[Outro: Snoop Dogg]\nNo Limit, yeah, that's what's happenin\nNo Limit, No Limit, No LImit, No Limit\nFuck all that yapping, we bout that gun clappin (No Limit)\nYeah, in the real world, talk is cheap\nActions speak louder than words\nNo Limit Records, here to protect and serve", "image": "https://images.genius.com/96262525a2f5c48018386a9b9ec0e619.500x498x1.jpg"}], "artist": "Snoop Dogg"}