{"songs": [{"title": "Untouchable", "album": "Pac’s Life", "year": "2006-11-21", "lyrics": "[Intro: 2Pac talking]\nYou motherfuckers kill me\nWhy yall niggas don't ever talk that shit when we be in the physical form?\nWhy yall niggas get all shy when we right there next to you at the premiere's and shit?\nHahaha\nYall niggas get alot of heart when you get in the studio, huh?\nGet that can the man motherfucker wanna talk shit on the mic\nWell do this for me, would you?\nNext time you get the notion to talk some shit about an Outlaw nigga\nOr a nigga from the west side the best side, call me\nCall me nigga, reach out and touch a nigga, cause uh\nIf you don't do that and I hear one of you niggas sayin somethin on a record, ha\nExpect me nigga like you expect Jesus to come back\nExpect me nigga, I'm comin'\n\n*Beat starts*\n\n[2Pac]\nAh, from the pressure, yeah\nYou know how we do this Quik, Outlaws, untouchable\nAfter the fire comes the rain, after the pleasure there's pain\nEven though we broke for the moment we'll be balling again\nTime to make y'all, my military be prepared for the busters similar to\nBitches to scary, get to near me we rush 'em\nVisions of over packed prisons, millions of niggas thug living\nPressure's, three strikes I hope they don't test us\nSo pull the heat out, ammunition in crates (shh)\nMove without a sound as we slide down pistols in place\nI'm sensing niggas is defenseless I'm hitting fences then getting ghost\nWho can prevent me shooting senseless at these nigga's throats?\nOnly wish to breed, I explode into a million seeds\nY'all remember me legendary live eternally\nBury me in pieces cause they fear reincarnation\nNiggas screamin' peace cause they fear when my squad face 'em\nTake 'em to places face to face then erase 'em, and break 'em\nMurder motherfuckers that are waitin' to quicken the pace\n\n[Hook: 2Pac]\nBitch made niggas and that bullshit you going through\nOutlaws busting while we rushing\nWe untouchable\nFuck you niggas and that bullshit you going through\nWe Outlawz rushing you busting you\nWe untouchable\n(Repeat 2x)\n\n[Gravy]\nAiyyo we won't stop, I let the '44 pop\nTanqueray and Alize' make niggas get shot\nI'm smokin on some kush baby, you know it's all Gravy\nCalicos, AK's, nigga's yellin' mayday\nPayday, soon as the red dots connect\nOff that haze and that 'dro, that Cali sticky icky\nStrictly 2-1-3, 8-1-8, 3-2-3\n3-1-0, we Outlawz, baby\n\n[Yaki Kadafi]\nI'm surrounded by thugs, slugs with crystals and pistols, callin'\nCopy murderers that be softer than tissues\nGot my persona soldier dedicated to the fuckin drama\nMy foes retreat like pros when they post my pros\nMashin' like piranahs or a pack of pitts\nBodies get wasted, paper chasin', tryna stack a brick\nDear mama, I'm touched for lots of lethal clutch, clingin' for a life which ain't much\nAnd a lust for these guns to bust\nAin't no trust for these herbs tryna wet ya, keep my burner on the dresser\nWake up bustin' in the mornin' from the pressure\n\n[Hook: 2x]\n\n[Hussein Fatal]\nI never had a chance to be a buster, I was raised hard\nWith the only shed of tattooed tears out near the graveyard\nI rep my Outlaws deeply\nDone seen too many real players fall to let the industry cheat me\nOnly behind the scenes do they see me as 2Pac the don\nAnd this bitch with 2 Glocks, I'm wrong\nThe homie still gon' roll and standin' with your biggest G\nYou still gon' fold, I can guarantee you a lost\nThe homie 'Pac told me \"I can guarantee you a boss\"\nAnd it was in for a brief minute, far as my life\nSince he disappeared, I still ain't found peace in it\nBut still strugglin like Mumia Abu, it was 'bout to end truly I knew\nNamed my daughter Assadah, for that alone, make 'em more than a rider\nGot every homie trigger finger under the set\nDope but guaranteed now my 1 on 1 will connect\n\n[Hook: 2x]\n\n[2Pac]\nFuck you niggas and that bullshit you going through\nOutlawz! We untouchable!", "image": "https://images.genius.com/7f0e7d35c3475ff32f884c7f54e6de7d.1000x1000x1.jpg"}], "artist": "2Pac"}