{"songs": [{"title": "Fight Music", "album": null, "year": null, "lyrics": "[INTRO]\n{Omar Epps - Q}\nYou're crazy man!\n{2Pac - Bishop}\nYou know what? When you said that last time\nI was kinda trippin' right, but now\nYou're right, I am crazy\nBut you know what else? I don't give a fuck\n\n[Verse 1: 2Pac]\nCheck it out\nIs it, money or women to funny beginnings, tragic endings\nI can make a million and STILL not get enough of spending\nAnd since my life is based on sinnin', I'm hell bound\nRather be buried than be worried, livin' held down\nMy game plan to be trained heavy, military\nMind of a Thug Lord, sittin' in the cemetery\nCryin', I've been lost since my adolescence, callin' to Jesus\nBallin' as a youngster, wonderin' if he sees us\nYoung black males, crack sales got me three strikes\nLivin' in jail, this is hell, enemies die\nWonder when we all pass is anybody listenin'?\nGot my, hands on my semi shotty, everybody's snitchin'\nPlease God can you understand me, bless my family\nGuide us all, before we fall into insanity\nI make it a point, to make my beat bumpin' warlike\nDrop some shit, to have these stupid bitches jaws tight\n\n[Hook]\nGo, niggas wanna get it on, let's fight!\nI got some niggas in my click that make they motherfucking jaws tight now\nGo, niggas wanna get it on, let's fight!\nI got some niggas in my click that make they motherfucking jaws tight\nGo, niggas wanna get it on, let's fight!\nI got some niggas in my click that make they motherfucking jaws tight now\nGo, niggas wanna get it on, let's fight\nI got some niggas in my click that make they motherfucking jaws tight\n\n[Bridge]\n{Scratches}\nThe Evil Genius\nThrow them dubs up\n\n{2Pac - Bishop}\nYou gotta snatch some collars and let them motherfuckers know you there to take them out\n\n{Xzibit}\nMr. X to the you know me (Yeah, C'mon!)\n\n[Verse 2: Xzibit]\nThe love's been lost, the gloves is off, so figure\nWhat side you tryin' be on, the barrel or the trigger?\nA gang of niggas talkin' the talk, but ain't walkin' the straight line\nThey tryin' to hide behind the one time\nFuck being scary and constantly with security\nI ain't afraid of whatever you faggots try to do to me\nShoot at me, try to corner me, orderlies try to get at me\nFlip it like fake identities, stickin' it to my enemies (Enemies!)\nAnd have you runnin' for your motherfuckin' lives\nTill they put me in a courtroom fightin' for mines\nThe only reason I got foes that used to be friends\nWhen niggas mumble under they breath, I'm under their skin, so then\nI pray for the strength to handle what my city bring\nBetter stand for something, or your bound to fall for anything\nThe pitfalls, the potholes, I spit flows that generate straight crack sales, we got those\nOne hitter quitter split a nigga like a embryo\nBring it to your crib, to your kids, to your video shoot\nGive me the loot, my dues all paid up\nThe half-assed gettin' rat packed and sprayed up\nYou say what? Speak up punk, I can't hear you\nYou're transparent, Reynold's wrap, I'm seein' clear through\nPray for my downfall, talk like hoes\nMister rack rack the gauge and kick in the do'\nAnd motherfuckers tryna say I couldn't rap no mo'\nLike one monkey gon' stop the show\nLets go!\n\n\nDirty Harry", "image": "https://images.genius.com/dbbdb7f208d5866d896da3ccaf431d59.681x681x1.jpg"}], "artist": "2Pac"}