{"songs": [{"title": "Supa Ugly", "album": null, "year": "2001-12-11", "lyrics": "[Hook]\nI got myself a gun\nYeah, I got myself a gun\n\nBrooklyn stand up, I got myself a gun\n\n[Verse 1]\nBut really, I don't need the heat\nYour heart pump project Kool-Aid, you're sweet\nI don't gotta two-way you gays\nThis is not beef, this is rap homie\nI don't have a scratch on me\nYou feel Jay soft, rip Jay off\nDamn I'm only worth over a hundred million\nLook, I got beef with like a hundred children\nNiggas with pink suits (faggot) tryna get cute\nYou a little outta line homie, don't let the 9 homie\nPut you out your mind homie, just rhyme homie\nKick your little lies I kick my real facts\nLike you sneaking out the back of the Source Soundlab\nWe wasn't chasing you, we had a taping too\nWe came through to do our one-two thing\nIt wasn't a Roc-A-Fella come-through thing\n'Cause if it was on like that, I would come through Queens\nWith Queens niggas, you know how I do\nLook, I got more shooters in Queensbridge than you\nNiggas'll tie you up on the Colosseum roof\nAnd open beer bottles off the boy chipped tooth\nLook here\n\n[Hook]\nI got myself a gun\nYeah, I got myself a gun\n\n[Verse 2]\nListen, I'm the J, the A, to the fuck this broad\nThis nigga never sold Aspirin, how you Escobar?\nHad to buy your chain back last time you got robbed\nThe nerve of this coward nigga, oh my God\nAnd I don't rap rumors or innuendos\nI bring it to you live, lift up your window\nLet the public peek in, see your dirty laundry\nY'all dont want me to continue\n\n[Interlude]\nSuper ugly\nI don't give a fuck!\nAll I really know is your ho wants to be with me\nAnd she ain't playing, and what I'm saying\nShe creeps with me and sleeps between the sheets\n\n[Verse 3]\nMe and the boy A.I. got more in common\nThan just balling and rhyming; get it? More in Carmen\nI came in your Bentley backseat, skeeted in your Jeep\nLeft condoms on your baby seat\nHere nigga, the gloves is off, the love is done\nIt's whatever, whenever, however nigga - one\nAnd since you infatuated with saying that gay shit\nYes you was kissing my dick when you was kissing that bitch\nNasty shit, you thought I was boning Renette\nYou calling Carm' a hundred times, I was boning her neck\nYou got a baby by the broad, you can't disown her yet\nWhen does your lies end, when does the truth begin\nWhen does reality set in or does it not matter\nGotta hurt I'm your baby mama's favorite rapper\nAnd ask your current girl, she know what's up\nHolla at a real nigga, Jigga (I don't give a fuck!)", "image": "https://images.genius.com/1d4676aab28aa719e13ca599b8ec7968.300x300x1.jpg"}], "artist": "JAY-Z"}