{"songs": [{"title": "Another Winter", "album": "The Meth Lab", "year": "2015-08-21", "lyrics": "(Intro)\nQuick to pop off let a couple shots off\nLeave ‘em bleeding out with his shoes & his socks off\n\n(Verse 1 – Streetlife)\nWar dancing. I ain’t trying to make it rain though\nYou slow gassing. I’ll leave you brain on your Durango\nFirst classmen, old school with the Kangol\nThug passion, that pussy juice like a mango\nHulk smashing, make it jump like everlasting\nGod body Ramadan, 30 day fasting\nSix two brown skin fellow with the Caesar fade\n360 waves, side burns with a little graze\nI remain relevant; I’m a raw element\nHigh street intelligent. Product of my tenement\nSon of Anarchy, smoking that Bob Marley\nLa la la be killing these niggas slowly\nWake up, smell the coffee, sleep on the street is costly\nPay attention to the warning signs, don’t cross me\nGive ‘em hypertention. That niggas is getting salty\nI’m quick to pop off back the fuck up off me\n\n(Chorus - Carlton Fisk)\nCarlton Fisk banana clip silver back gorilla\nMr. Streetlife show you what that heat like\n\n(Chorus - Hanz On)\nHanz on yo we handle them Berettas PLO\nYo its forever, bout to show em what it be’s like\n\n(Chorus - Method Man)\nMethod man, turn a dollar to a million\nKilla bees we in the building\nMaking sure the children eat right eat right\nIn the building make sure the babies eat right\n\n(Chorus - Hanz On)\nIn the building make sure the babies eat right\n\n(Verse 2 - Carlton Fisk)\nBlack scenery white chalk yellow tape\nCarlo got a bullet proof wallet, bitch in every state\nLight that smoke that animals ferocious\nDealing with the boss mentality really focus\nTailor made linen & loafers, louie emblems\nProblems on the street my lieutenant quickly attending them\nCarlito ways, brown bag money\nIn the book of life you can’t get stuck to one page\nAll in together now, chinchilla bullet proof\nHoodies for any sign of winter war weather\nAnd daddy gonna get that cash so clever\nAnd Meth push the button my hands all on the trigger\nAnd they thought I rot in jail, like go figure\nIf I laid down dead in the street you going too nigga\nAnd this is raw kicking out your door start to scream out loud\nCarlton Fisk back for more\n\n(Chorus - Carlton Fisk)\nCarlton Fisk banana clip silver back gorilla\nMr. Streetlife show you what that heat like\n\n(Chorus - Hanz On)\nHanz on yo we handle them Berettas PLO\nYo its forever, bout to show em what it be’s like\n\n(Chorus - Method Man)\nMethod man, turn a dollar to a million\nKilla bees we in the building\nMaking sure the children eat right eat right\n\n(Chorus - Hanz On)\nIn the building make sure the babies eat right\n\n(Verse 3 - Method Man)\nNow whoever read me wrong, can start by reading my palm\nMake me catch a flashback of my father beating my mom\nKiss the ring, (hashtag) ain’t easy being a don\nSo I gotta carry the heat, ain't easy being LeBron\nThis is past rap, but I ain’t pass the baton\nTell them rappers bypass it or get to passing it on\nI won’t take it passed that, even if I pass it I’m gone\nBetter yet, scratch that, ya’ll don’t get a pass then it’s on\nWe Hanz On, everybody watchin the Don\nGot their eyes on the kid when they should be watchin their own\nTelling lies on the kid, they said he’s not in a zone\nSaid he never reach the top, but that ain’t stop him from going\nThey already on, so hungry his ribs are showin\nThe money is getting low, the bum niggas is on\n55 Bowen\nThese hungry adolescents is grown\nWhen they get the Smith & Wesson they adolescence is gone\n\n(Chorus - Carlton Fisk)\nCarlton Fisk banana clip silver back gorilla\nMr. Streetlife show you what that heat like\n\n(Chorus - Hanz On)\nHanz on yo we handle them Berettas PLO\nYo its forever, bout to show em what it be’s like\n\n(Chorus - Method Man)\nMethod man, turn a dollar to a million\nKilla bees we in the building\nMaking sure the children eat right eat right\nIn the building make sure the babies eat right\n\n(Chorus - Hanz On)\nIn the building make sure the babies eat right", "image": "https://images.genius.com/fafd5b6184e352f00d35852ac8b31946.1000x1000x1.jpg"}], "artist": "Method Man"}