{"songs": [{"title": "Love This Life", "album": "Trouble Man: Heavy Is the Head", "year": "2012-12-18", "lyrics": "[Intro]\nHey, I know shit get kinda fucked up some times, you know\nI know you can get carried away with yourself\nBut uh, why don't you be real with me\nAnd be real with you at the same time?\nYou can't get what you get here nowhere else ma\nKeep it real now\n\n[Hook]\nYou know, you love\nBitch you know you love this life\nDon't nobody do you like me\nYou know, you love\nBitch you know you love this life\nDon't nobody do you like me\nYou know\n\n[Verse 1]\nCavalli dress and high heels\nAnd drop tops on hot wheels\nWe live how we wanna live cos we got mills\nThem other niggas barely buy a hot meal\nIn VIP dem bottle popping do it B.I.G\nCome get with T.I.P and be balling til you D.I.E\nInvisible set bracelets see clearly\nTake away your stress, mean that sincerely\nProblem solve‘em, never mind that\nGirlfriends see your bag, be like where you find that?\nPlus, what the fuck's a prenup? You ain't gotta sign that\nYou nut up, take half, I'ma make it right back\nI'm a motherfucking hustler to the heart, what's the\nSense in leaving me and be back fucking with them busters?\nBentley for your birthday, Goyard purse day\nFilled with them stacks you know you gotta love that\n\n[Hook]\n\n[Verse 2]\nMan of respect, on a big jet\nWith a big dick and a big check\nI pop big shit I'm good as it gets\nYou leave me, where else you think you can get this?\nGirl you can get another guy to beat that pussy for you\nThem niggas cowards though and I'd take a bullet for you\nMansions, jewelry, all I need's for you and me to\nHave some understanding, have a couple candid conversations\nYour frustrations, I take in considerations\nI'm rough around the edges, don't bow with me and be patient\nAnd you sadly mistaken if you think I'm into chasing\nMy heart is RSVP, I've extended an invitation\nAnd don't go wasting your time with what they saying online\nYour position's divine, don't believe? Look around\nI got a strong mind and a kind heart\nWith a soft kiss, but I love hard\n\n[Hook]\n\n[Break]\nDon't you love this life like I love you?\nAnything you could ask, do it for you\nDrop Jags, Birkin bags, Louboutin heels\nSummer homes in Miami, Hollywood hills\nVacationin' in Monaco, Ibiza\nOn the French Riviera with our feet up\nA lifestyle so rare\nYou know you ain't going nowhere\n\n[Hook]", "image": "https://images.genius.com/6c270013a37f81fa5c7f0606f8824d12.300x300x1.png"}], "artist": "T.I."}