{"songs": [{"title": "Get That Cheese", "album": "What’s My Favorite Word?", "year": null, "lyrics": "[Too $hort] It's payday!\n[$ + Roger] Get, that, cheese!\n[Roger Jr.] {*vocoder sounds*} We gotta\n[$ + Roger] Get, that, cheese!\n[Roger Jr.] {*vocoder sounds*} We gotta\n[$ + Roger] Get, that, cheese!\n[Roger Jr.] {*vocoder sounds*} Just\n[$ + Roger] Get, that, cheese!\n\n[Verse One]\nNow when you dreamin, it might not be real\nBut when you're all alone, that's how you feel\nDo what you want, you just need a plan\nLittle money and a car, you could be the man\nCause havin money's what you're 'sposed to do\nSpend some, then people start to notice you\nGet all the things that you wish you had\nNow all that little stuff don't get you mad\nAnd once you get your foot in the door\nDon't start actin like you can't look for more\nThere's always more money to be made\nIt's not everything, I know you wanna be paid\nYou should write it down and do the math\nAnything in the world is what you can have\nSo listen to your potnah $hort\nGet your money young man, you ain't gotta be broke, just\n\n[Hook: Too $hort] + Greedy Mac\n[$ + R + GM] Get, that, cheese!\n[Greedy Mac] While you standin on the wall, and you wishin you can ball\n[$ + R + GM] Get, that, cheese!\n[Greedy Mac] While you standin on the wall, and you wishin you can ball\n[$ + R + GM] Get, that, cheese!\n[Greedy Mac] While you bumpin in yo Cadillac, pockets always stayin fat\n[$ + R + GM] Get, that, cheese!\n[Greedy Mac] While you bumpin in yo Cadillac, sippin on yo' Cognac\n\n[Verse Two]\nNow grab a freak, smoke some weed\nAnd kick it all night with this funky-ass beat\nIt's been a long day, gotta stay on the grind\nUp early, hustle for a long time\nYou want big dough? You wanna get mo'?\nYou want a Cadillac truck and a six-fo'?\nI tell all the little homies havin money in the ghetto\nOne day you gotta let go, but don't settle\nFor just hangin on the corner broke\nFiendin for a hit of what you wanna smoke, on that dope\nFree yo' mind if it's trapped in the streets\nBut don't starve; you know us macks have to eat\nI don't care if they don't like me\nJust left the bank and I'm rollin up some light green\nNow hold on to your dreams for me\nCause life ain't always what it seems to be, you gotta\n\n[Hook]\n\n[Verse Three]\n(Is that Too $hort?) Baby yeah I'm back, it's on\nYou never woulda thought I could last this long\nI don't associate with non-believers\nIf my girl keeps me naggin me then I'mma leave her\nCause I worked too hard for way too long\nTo get what I got and I'm way too strong\nIn yo' lifetime, if you don't get yours\nCan't do no ballin like yo' nigga $hort\nBut once you on a roll, they can't stop it\nReceivin checks, makin bank deposits\nAnd that's just the way it is\nDon't come around me if you're negative\nI'm the player of the year, there is no other\nI buy a mansion fo' my mother\nSee me ridin with the top down\nI need some mo' money, can't stop now, I gotta\n\n[Hook]\n\n{*ad libs by Roger and others to fade*}", "image": "https://images.genius.com/5b217fd6496369f950dd5a8a14ae52aa.1000x1000x1.jpg"}], "artist": "Too $hort"}