{"songs": [{"title": "Keep their heads ringin’ - lp version;", "album": null, "year": null, "lyrics": "Intro:\nYeah, whattup, this is Dr. Dre\nThe party's goin on\nThank God it's Friday\n[\"Buck buck buck buck booyaka shan!\" - KRS One\" rpt 4X]\n\nChorus:\nKeep their headz ringin (ding ding dong, ring-gading ding ding dong)\nRepeat 2X\nHey you, sittin over there\nSay what?\nYou better get up out of your chair\nThat's right\nAnd work your body down\nYeahhh...\nNo time to funk around, cause we gon....\nFunk, you, right on up\nSo get up, get a move on, and get your groove on\nIt's the D-R-E the spectacular\nIn a party I go for your neck so call me Blackula\nAs I drain a n****'s jugular vein\nAnd maintain to leave blood stains so don't complain\nJust chill, listen to the beats I spill\nKeepin it real, enables me to make another meal\nStill, n****z run up and try to kill at will\nBut get popped like a pimple, so call me Clearasil\nI wipe n****z off the face of the Earth since birth\nI been a bad n****, now let me tell you what I'm worth\nMore than a Stealth bomber, I cause drama\nThe enforcer, music flows like a flying saucer\nOr a 747 jet, never forget\nI'm that n**** that keeps the hoes' panties wet\nThe mic gets smoked, once you hear the beat kick\nWith grooves so funky, they come with a Speed Stick\nSo check the flavor that I'm bringin\nThe motherf***in D-R-E, will keep their\nMotherf***in headz ringin\nChorus\nOne-two for the crew, three-fo' for the dough\nFive for the hoe, six-seven-eight for Death Row\nMad n****z about to feel the full effect of intellect\nSo I can collect respect, plus a check\nNow I fin' to, get into to, my mental will take care of this business I need\nTo attend to cuz my rent's due\nAnd this rap s***'s my meal ticket\nSo you goddamn right I'm gonna kick it, or get evicted\nI bring terror like Stephen King\nA black Casanova, runnin n****z over like Christine\nWhen I rock the spot with the flavor I got\nI kick plenty of a**, so call me an astronaut\nAs I blast past another n****'s a** that thought he was strong\nBut I smoke him like grass, just like Cheech and Chong\nWhen I flow, n****z know, it's time to take a hike\nCause I grab the mic and flip my tongue like a dyke\nI got rhymes to keep you enchanted\nProduce a smokescreen with the funky green to keep your eyes slanted\nSo check the flavor that I'm bringin\nThe motherf***in D-R-E, will keep their motherf***in headz ringin\nChorus\nDebonair with flair, I scare wear and tear\nWithout a care, runnin s*** as if I was a mayor\nBut I ain't no politician, no competition\nSendin all opposition to see a mortician\nI'm up front, never in the back drop\nStep on stage and get faded just like a flat top\nYour rhyme sounds like you bought em at Stop N Go\nDre came to wax you so, just call me Mop N Glow\nMany tried to, but just can't rock with\nI'm 6-1, 225, a pure chocolate\nYour chances of jackin me are slim, G\nCause I rock from summer til Santa comes down the chimney\nHo ho ho, and so, as I continue to flow\nCause yo, I'm just a fly negro\nSo, check the flavor that I'm bringin'\nThe motherf***in D-R-E will keep their motherf***in headz ringin\nChorus", "image": "https://images.genius.com/bf3badae49c33b583126057638078bd8.576x576x1.jpg"}], "artist": "Dr. Dre"}