{"songs": [{"title": "How I’m Comin’", "album": "14 Shots to the Dome", "year": "1993-02-15", "lyrics": "[Intro]\n(\"I'm comin'\")\n(\"I'm comin'\")\n(\"I'm comin'\")\n(\"I'm comin'\")\n\n[Verse 1]\nBoom bash, wake up, I set it off right\nLook around and turn your wet dream to fright night\nYou can call me R&B, that's only if it stands for Rough Brother\nWord to my grandmother\nI buck you in the head just to let ya know\nStick you for ya dough, spit on the flo'\nDrag it out of ya, bring it on\nI smack him back down, yo dope word is bond\nI know you want a piece of the champ\nBut you roll too weak, you couldn't make it in my camp\nYou thought I went for the flip\nBut I'm bustin' off hip-hop clip after clip\nI kept you out there, ripped you for your wear\nJump inside your video, bust you with a chair\nSmack slap smack slap smack slap smack\nJust to make it worse and hurt your pride I'll run it back\nSmack slap smack slap smack slap smack\nClick click boom, stop dead in your tracks\nStick the steel in your mouth\nBuck buck buck buck buck, lights out\n\n[Chorus]\n(\"I'm comin'\")\nHow ya comin' baby?\n(\"I'm comin'\")\nHow ya comin' baby?\nThis is how I'm comin'\n(\"I'm comin'\")\nHow ya comin' baby?\n(\"I'm comin'\")\nHow ya comin' baby?\nThis is how I'm comin'\n\n[Verse 2]\nThe album that I'm comin' with is rough, the flavor's mean\n(ooooh) kickin' you for real in the guillotine\nFourteen shots to your dome kid\nI'm doin' time in the game like a bid\nMovin' rhymes like a package\nSo stigetty step up and get your nostrils damaged\nShootin', lickin', bustin', sprayin', all of that\nAnd then some, dead dead dead, one by one\nNever step to a real man\nCause your rhymes only work on a playground program\nThey impress your little friends, bring you a little ends\nBut you still you gotta ride in your man's Benz\nWord to hip-hop, I'm a blast ya\nGotta set you on fire cause I gassed ya\nBoom, blow, Batman, bang, pow\nUnh (what) unh (what), that's the way it's goin' down\nMy new album ain't no joke\nYou wanna take me out, how many bunch ya smoke?\nI'll never slack again, I'm off the job like the mob\nHey, no prob', many solved, on the knob, make his heartthrob\nWhat you gotta deal with is real, made of steel\nYou can feel it comin', burnin', buildin', flowin' like an eel\nMovin', killin', breakin', servin' you just like a meal\nTake off your clothes and taste the steel\n\n[Chorus]\n(\"I'm comin'\")\nHow ya comin' baby?\n(\"I'm comin'\")\nHow ya comin' baby?\nThis is how I'm comin'\n(\"I'm comin'\")\nHow ya comin' baby?\n(\"I'm comin'\")\nHow ya comin' baby?\nThis is how I'm comin'\n\n[Interlude]\nCheck baby\nCheck baby, yeah\nCheck baby\nCheck baby, uh\nCheck baby\nCheck baby\nCheck baby\nCheck baby\nCheck baby, uh\nCheck baby\nCheck baby\nCheck baby\nCheck baby\nCheck baby, yeah\nCheck baby\nCheck baby\n\n[Verse 3]\nRockabye baby on the rooftop\nOpen up your mouth and taste my Glock\nWhen your jaw breaks your gold teeth will fall\nDown will come the monkey, banana clip and all\nSplat (buck buck buck) it's all over wit'\nAnother plan O.D.'ed over my war hit\nThe way I'm workin' and jerkin' and hurtin' brothers converted\nNon-believers get murdered, that’s how I preferred it\nGet your face out the bill, catch the thrill\nCarry a nine put your hoochies on the bill\nThe thought of you gettin' scarred turns me on\nLike my first television with my backup tip hard\nSo where's your mouth kid? Where's your heart shorty?\nIt's all over, cash your chips in, crack a forty\nYou look thirsty, you ain't gettin' no mercy mercy\nAnd ain't no way that you can rehearse for me\nMurder I wrote, murder I wrote, is what I figure\nIt's in my tote, it's in my tote, so I pull the trigger\nPut up your women, your crib, your speakers\nYour dog, your cat, your crate, your speakers\nYour sister, your aunt, your crew, your Knicks\nGot 'em booin' all you other rappers who think that's too tough\nBam bam, here's a hit you wish you had\nA hit that makes you mad, a hit that makes you slap your dad\nDead dead dead, kill dead, kill dead\nTry to battle me I gots to buck you in your head\nI pull your file, click\nI know you're good to style, blaow\nLivin' wild, when it comes to this I never smile\nWhat did you learn from the lesson I just gave ya?\nObey your mama, be on your best behavior\nIt's never endin' and I am recommendin'\nYou put your name as Brendan\nI see y'all that is blendin'\nThe message that I'm sendin'\nIs there ain't no pretendin'\nGet in the trunk, buy the album, here to end it\n\n[Outro]\nI'm comin'", "image": "https://images.genius.com/45a2ec7e72cbeacf423d65a82e2688cb.968x968x1.jpg"}], "artist": "LL Cool J"}