{"songs": [{"title": "Rich & Famous", "album": "Dreams and Nightmares", "year": "2012-10-30", "lyrics": "[Intro: Meek Mill]\nAye, shorty I'mma tell you like this\nI know you used to messing with them ordinary guys\nBut, uh\nThe way I'm getting money\nI can introduce you to a lifestyle you gon' love forever\nIt's Double-M-G\n\n[Hook: Louie V]\nI wanna buy your love, tell me what it's gon' be?\nI wanna buy your love, everything is on me\nLifestyle of the rich and the famous\nDon't you wanna be rich and be famous?\nLifestyle of the rich and the famous\nDon't you wanna be rich and be famous?\nI wanna buy your...\n\n[Verse 1: Meek Mill]\nRiding through my city with a chick I used to lust\nBout to make a movie starring me, the two of us\nPenthouse at the top floor, elevator shooters up\nSo I can eat that pussy for breakfast, dinner, and lunch\nAnd uh, she been waiting all night for this hard pipe\nI think she called twice\nBefore you knew it I pulled in she seen them fog lights\nAnd I can see it in her face she had a hard night\nUp and down that pole selling dreams, selling love\nIt was sort of like she serving fiends and selling drugs\nGiving them a fix, body solid as a brick\nWith no baking soda on it I went raw every time I hit\nLife's a bitch but I go deep up in that pussy Jerry Rice\nAnd every time I'm in the building I ain't never like\nShe be on that pole, tryna chase her goals\nGoing up and down like that angel on that Rolls. Lord Knows!\n\n[Hook: Louie V]\nI wanna buy your love, tell me what it's gon' be?\nI wanna buy your love, everything is on me\nLifestyle of the rich and the famous\nDon't you wanna be rich and be famous?\nLifestyle of the rich and the famous\nDon't you wanna be rich and be famous?\nI wanna buy your...\n\n[Verse 2: Meek Mill]\nYeah, Shorty so pretty and that pussy so good\nShe used to say I was crazy, I was up to no good\nTill I slid all in it, started fucking her good\nRed bottom, I damn near had a crush in the hood\nI slid up in an Aston, she heard the pipes they were growling\nFriends wanting to fuck me because they like how I'm styling\nBut I'm cool on the snaking cause I like when she smiling\nWe gon' Lear in the air just to get right on an island\nWe ball harder in Bal Harbour out in Florida\nIsabel Marant sneakers, you got all of them\nTatted up, passports just to cross borders\nShe calling me daddy and I ain't got a daughter\nSaid I'm cooler than them other dudes\nFive racks just to get her Cinderella shoes\nHella Jewels, Money come in different revenues\nBig Paper, your money smaller then that Kevin dude\n\n[Hook: Louie V]\nI wanna buy your love, tell me what it's gon' be?\nI wanna buy your love, everything is on me\nLifestyle of the rich and the famous\nDon't you wanna be rich and be famous?\nLifestyle of the rich and the famous\nDon't you wanna be rich and be famous?\nI wanna buy your...\n\n[Verse 3: Meek Mill]\nMy chick bad, looking like a bag of money\nShe gripping on my H belt, but I tell her grab it for me\nShe was messing with me way before I had the money\nYou niggas playing games, I'm getting Madden money\nJust to commentate, peep how I operate\nI put your chick up in this ghost, Bet she cooperate\nI really balling, tat em all up in and out of state\nBeen getting money for a while, I don't know how to hate\nThey call me racked up shorty, she can smell the Aura\nHad her out in Bora exploring like she was Dora\nMillion dollar sponsor, spoiled her like my daughter\nAnd put her in the game, She ain't fucking with lames\n\n[Hook: Louie V]\nI wanna buy your love, tell me what it's gon' be?\nI wanna buy your love, everything is on me\nLifestyle of the rich and the famous\nDon't you wanna be rich and be famous?\nLifestyle of the rich and the famous\nDon't you wanna be rich and be famous?\nI wanna buy your...", "image": "https://images.genius.com/c59afafa87c6a24df220df1e2af44f8e.1000x1000x1.jpg"}], "artist": "Meek Mill"}