{"songs": [{"title": "County Blues", "album": "Dead Man Walkin", "year": "2000-10-31", "lyrics": "[Snoop Dogg: Verse 1]\nI'm sittin' in a over crowded tank\nI'm tryna see which nigga these niggas plottin to gank\nCause if it's me, it's on (Sup, homie)\nLoc, the Ese wit the black knights just got stole on\nAnd he fell to the ground\nPlus, his homie's ain't around so he better get a beat down\nIt's not a jack for his scratch nor his shoes\nIt's life in the county and the county gives plenty blues\nOne point for the black guys\nThey rolled him up, swelled and belled\nAnd left him with two black eyes\nHe still alive so he know what's next\nAny nigga they catch slippin' they gon' put him to rest\nSo I made my best to protect my chest\nOn point all night cause if I sleep I might\nNot make it in this world of fools\nI might come up missin' if I'm slippin' in these County Blues\n\n1 - Niggas fuck around in they County Blues\nYou might come up missin', if you snooze you lose\nYou confused the fuckin system, when you need I be\nWhy? Cause it's this is gangbangology\n\n[Snoop Dogg: Verse 2]\nSee the first verse got'cho ass scared\nBut hold up, you gotta take a trip upstairs\nWhere the fools always wonderin?\nYoung nigga, welcome (welcome)\n\n{*interlude*}\n\n[Snoop Dogg: Verse 3]\nI be \"God damn nigga, what'chu gon' do?\"\nStay down for yo grits cause he who slips, gets licked\nAnd stuck, fucked and all that\nBoy when you get out you betta not never come back\nI tell you that'll make a punk hard\nPut him on a killer row, where the killers kill and disregard\nSay you don't gang-bang\nWell why your homie - baby boo callin you by ya gang name? (Sup nigga?)\nUhh, later that night, a whole 'nother fight\nBut it's aiight, cause it's a nigga and a white\nBut damn, the Ese's is deep\nAnd it look like they straght tryna creep, you peep?\nCreep like T-L, on the D-L\nBut you fail, tryna tell Deputy Bell\nWell, that shit was disrespectful, nigga\nYou ran out on the brotha's\nThat's what'chu got checked for, and deck for\nNigga you'se a ho (you'se a ho)\nUhh, and I'mma let you know (let you know)\nI mean, niggas is bitches, when they get behind the wall\nBut I ain't talkin 'bout all y'all\nCause I know some niggas from the C-P-T\nAnd some big homie's from the L-B-C and South Central\nNiggas y'all know, y'all is the looniest\nKeep it true and ya County Blues doin' this\n\nRepeat 1\n\n{*singer's sings until fade*}", "image": "https://images.genius.com/e7d84865e8d21f7778aa93228a899a2c.599x623x1.jpg"}], "artist": "Snoop Dogg"}