{"songs": [{"title": "Work", "album": "Dreamchasers", "year": "2011-08-11", "lyrics": "[Intro]\nRolling, we’re rolling!\nYeah!\n\n[Chorus: Meek Mill]\nRiding with the steel, puffing on the purp\nOvertime on you niggas, 'cause I'm goin' to work\nI'm going to work, I'm going to work\nOvertime on you niggas, going to work\nI’m gonna get it any means necessary\n'Cause you know I'm bout my paper like a secretary\nI'm going to work, I'm going to work, I'm going to work\n\n[Verse 1: Meek Mill]\nGotta go to court tomorrow, DA on my dick\nSo I'mma wear my Audemar, just to make her sick\nI might go yellow Presi on her, just to make her pissed\nThen go home and break a brick and break it down to bacon bits\nI'm going to work I'm going to work\nThe phone's popping, like we on the first\nWe up on Neiman's, we going berserk\nA nigga cross me, he going to church\nRidin through the hood, back of the 'Bach\nStarted in the front, now they in back of the 'Bach\nNo love for the haters, no rap for the rats\nVelcro shorty, we strapped and they strapped\nHalf you niggas telling so we never sell em work\nThey don't wanna come and get it so we mail em work\nPut my money in it so you know it better work\nAnd my shooters with me so you know they put in work\n\n[Chorus: Meek Mill]\nRiding with the steel, puffing on the purp\nOvertime on you niggas, 'cause I'm goin' to work\nI'm going to work, I'm going to work\nOvertime on you niggas, going to work\nI’m gonna get it any means necessary\n'Cause you know I'm bout my paper like a secretary\nI'm going to work, I'm going to work, I'm going to work\n\n[Verse 2: Rick Ross]\nI might go buy a boat tomorrow, just to take a trip\nBig belly rude boy, bad Jamaican bitch\nI head straight to Colombia, I'm talking Bogota\nShip em up to Philly, Milly living like he Gorbachev\nNot the Reagen Era but a nigga making cheddar\nRayful Edmond in the mirror and I'm never telling\nThe game sweet soda, seats watermelon\nClip full of sunflower seeds in my Mac-11\nAnd I steal a mothafucka's like a student felon\nBookbags full of blocks and them bitches selling\nI'm going to work, I'm going to work\nI'm going to work, I'm going to work\n\n[Chorus: Meek Mill]\nRiding with the steel, puffing on the purp\nOvertime on you niggas, 'cause I'm goin' to work\nI'm going to work, I'm going to work\nOvertime on you niggas, going to work\nI’m gonna get it any means necessary\n'Cause you know I'm bout my paper like a secretary\nI'm going to work, I'm going to work, I'm going to work\n\n[Verse 3: Meek Mill]\nGot some youngins that will murder for a new bike\nHave you looking like you're fresh up out a food fight\nSpaghetti on your head, shirt ketchup red\nShooting banana clips, we ain't never scared\nNiggas say they looking for me, the ain't ever there\nI'm like a Metro Phone Store 'cause I'm everywhere\nI'm gone get it any means necessary\n'Cause you know I'm bout my paper like a secretary\nGave my nigga fifty years, forever buried\nHe said he gone make it home like he neva worried\nHe said he’s gonna make it home like in Neveruary, damn!\nFree my homie Rick, and free my homie Brick\nDoing hard time, love the 36\nTried to get her number, shawty she ain’t on me\nWanna fuck me now, I’m like you dirty bitch!\nRookie of the year cause I murder shit, murder!\nAnd I'm way back, 'cause it’s Maybach\n\n[Chorus: Meek Mill]\nRiding with the steel, puffing on the purp\nOvertime on you niggas, 'cause I'm goin' to work\nI'm going to work, I'm going to work\nOvertime on you niggas, going to work\nI’m gonna get it any means necessary\n'Cause you know I'm bout my paper like a secretary\nI'm going to work, I'm going to work, I'm going to work", "image": "https://images.genius.com/444ab187fd5c557d6d65efc6fb8931ea.320x320x1.jpg"}], "artist": "Meek Mill"}